{
    "status": true,
    "data": {
        "start": 1324,
        "end": 1470,
        "total": 147,
        "book": "abu-daud",
        "hadits": [
            {
                "number": 1324,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَسُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ قَالَقَالَ عَبْدُ اللَّهِ فَعَدَلَ النَّاسُ بَعْدُ نِصْفَ صَاعٍ مِنْ بُرٍّ قَالَ وَكَانَ عَبْدُ اللَّهِ يُعْطِي التَّمْرَ فَأُعْوِزَ أَهْلُ الْمَدِينَةِ التَّمْرَ عَامًا فَأَعْطَى الشَّعِيرَ",
                "id": "Telah menceritakan kepada Kami [Musaddad] serta [Sulaiman bin Daud Al 'Ataki], mereka berkata; telah menceritakan kepada Kami [Hammad] dari [Ayyub] dari [Nafi'], ia berkata; [Abdullah] berkata; setelah itu orang-orang beralih kepada setengah sha' gandum. Nafi' berkata; dan Abdullah memberikan kurma, kemudian penduduk Madinah sulit mendapatkan kurma selama satu tahun, kemudian ia memberikan gandum. "
            },
            {
                "number": 1325,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا دَاوُدُ يَعْنِي ابْنَ قَيْسٍ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَكُنَّا نُخْرِجُ إِذْ كَانَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ الْفِطْرِ عَنْ كُلِّ صَغِيرٍ وَكَبِيرٍ حُرٍّ أَوْ مَمْلُوكٍ صَاعًا مِنْ طَعَامٍ أَوْ صَاعًا مِنْ أَقِطٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ زَبِيبٍفَلَمْ نَزَلْ نُخْرِجُهُ حَتَّى قَدِمَ مُعَاوِيَةُ حَاجًّا أَوْ مُعْتَمِرًا فَكَلَّمَ النَّاسَ عَلَى الْمِنْبَرِ فَكَانَ فِيمَا كَلَّمَ بِهِ النَّاسَ أَنْ قَالَ إِنِّي أَرَى أَنَّ مُدَّيْنِ مِنْ سَمْرَاءِ الشَّامِ تَعْدِلُ صَاعًا مِنْ تَمْرٍ فَأَخَذَ النَّاسُ بِذَلِكَ فَقَالَ أَبُو سَعِيدٍ فَأَمَّا أَنَا فَلَا أَزَالُ أُخْرِجُهُ أَبَدًا مَا عِشْتُ قَالَ أَبُو دَاوُد رَوَاهُ ابْنُ عُلَيَّةَ وَعَبْدَةُ وَغَيْرِهِمَا عَنْ ابْنِ إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ حَكِيمِ بْنِ حِزَامٍ عَنْ عِيَاضٍ عَنْ أَبِي سَعِيدٍ بِمَعْنَاهُ وَذَكَرَ رَجُلٌ وَاحِدٌ فِيهِ عَنْ ابْنِ عُلَيَّةَ أَوْ صَاعًا مِنْ حِنْطَةٍ وَلَيْسَ بِمَحْفُوظٍ حَدَّثَنَا مُسَدَّدٌ أَخْبَرَنَا إِسْمَعِيلُ لَيْسَ فِيهِ ذِكْرُ الْحِنْطَةِ قَالَ أَبُو دَاوُد وَقَدْ ذَكَرَ مُعَاوِيَةُ بْنُ هِشَامٍ فِي هَذَا الْحَدِيثِ عَنْ الثَّوْرِيِّ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عِيَاضٍ عَنْ أَبِي سَعِيدٍ نِصْفَ صَاعٍ مِنْ بُرٍّ وَهُوَ وَهْمٌ مِنْ مُعَاوِيَةَ بْنِ هِشَامٍ أَوْ مِمَّنْ رَوَاهُ عَنْهُ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah], telah menceritakan kepada Kami [Daud yaitu Ibnu Qais] dari ['Iyash bin Abdullah] dari [Abu Sa'id Al Khudri], ia berkata; Kami dahulu disaat Rasulullah shallAllahu wa'alaihi wa sallam bersama Kami mengeluarkan zakat fitrah untuk setiap anak kecil, dan orang dewasa, orang merdeka atau budak satu sha' makanan atau satu sha' keju, atau satu sha' gandum, atau satu sha' kurma, atau satu sha' kismis. Dan Kami tetap mengeluarkannya hingga [Mu'awiyah] datang untuk melakukan haji, atau umrah. Kemudian ia berbicara kepada orang-orang di atas minbar, dan diantara yang ia katakan kepada orang-orang adalah; saya melihat dua mud gandum Syam setara dengan satu sha' kurma. Kemudian orang-orang mengambil pendapat tersebut. Kemudian Abu Sa'id berkata; adapun aku maka aku tetap mengeluarkannya (sebagaimana dahulu aku mengeluarkannya) untuk selamanya selama aku hidup. Abu Daud berkata; [Ibu 'Ulayyah] dan ['Abdah] serta yang lainnya telah meriwayatkannya dari [Ibnu Ishaq] dari [Abdullah bin Abdullah bin Utsman bin Hakim bin Hizam], dari ['Iyadh] dari [Abu Sa'id] dengan maknanya. Dan satu orang dalam hadits tersebut telah menyebutkan dari Ibnu 'Ulayyah; atau satu sha' dari gandum. Dan hal tersebut bukanlah hadits mahfuzh. Telah menceritakan kepada Kami [Musaddad], telah mengabarkan kepada Kami [Ismail], tidak ada padanya penyebutkan; gandum. Abu Daud berkata; [Mu'awiyah bin Hisyam] dalam hadits ini telah menyebutkan dari [Atsauri] dari [Zaid bin Aslam] dari ['Iyadh] dari [Abu Sa'id]; setengah sha' gandum. Dan hal tersebut merupakan kesalahan dari Mu'awiyah bin Hisyam, atau dari orang yang meriwayatkan darinya."
            },
            {
                "number": 1326,
                "arab": "حَدَّثَنَا حَامِدُ بْنُ يَحْيَى أَخْبَرَنَا سُفْيَانُ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ابْنِ عَجْلَانَ سَمِعَ عِيَاضًا قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُلَا أُخْرِجُ أَبَدًا إِلَّا صَاعًا إِنَّا كُنَّا نُخْرِجُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَاعَ تَمْرٍ أَوْ شَعِيرٍ أَوْ أَقِطٍ أَوْ زَبِيبٍ هَذَا حَدِيثُ يَحْيَى زَادَ سُفْيَانُ أَوْ صَاعًا مِنْ دَقِيقٍقَالَ حَامِدٌ فَأَنْكَرُوا عَلَيْهِ فَتَرَكَهُ سُفْيَانُ قَالَ أَبُو دَاوُد فَهَذِهِ الزِّيَادَةُ وَهْمٌ مِنْ ابْنِ عُيَيْنَةَ",
                "id": "Telah menceritakan kepada Kami [Hamid bin Yahya], telah mengabarkan kepada Kami [Sufyan]. Dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada Kami [Musaddad] telah menceritakan kepada Kami [Yahya] dari [Ibnu 'Ajlan], ia mendengar ['Iyadh] berkata; saya mendengar [Abu Sa'id Al Khudri] berkata; aku tidak akan mengeluarkannya selamanya kecuali satu sha'. Sesungguhnya Kami dahulu mengeluarkan pada zaman Nabi shallallahu 'alaihi wasallam satu sha' kurma atau gandum atau keju atau kismis. Ini adalah hadits Yahya, Sufyan menambahkan; atau satu sha' dari gandum. Hamid berkata; kemudian mereka mengingkarinya, dan Sufyan meninggalakannya. Abu Daud berkata; tambahan ini adalah kesalahan dari Ibnu'Uyainah. "
            },
            {
                "number": 1327,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَسُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ النُّعْمَانِ بْنِ رَاشِدٍ عَنْ الزُّهْرِيِّ قَالَ مُسَدَّدٌ عَنْ ثَعْلَبَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي صُعَيْرٍ عَنْ أَبِيهِ وَقَالَ سُلَيْمَانُ بْنُ دَاوُدَ عَنْ عَبْدِ اللَّهِ بْنِ ثَعْلَبَةَ أَوْ ثَعْلَبَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي صُعَيْرٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَاعٌ مِنْ بُرٍّ أَوْ قَمْحٍ عَلَى كُلِّ اثْنَيْنِ صَغِيرٍ أَوْ كَبِيرٍ حُرٍّ أَوْ عَبْدٍ ذَكَرٍ أَوْ أُنْثَى أَمَّا غَنِيُّكُمْ فَيُزَكِّيهِ اللَّهُ وَأَمَّا فَقِيرُكُمْ فَيَرُدُّ اللَّهُ تَعَالَى عَلَيْهِ أَكْثَرَ مِمَّا أَعْطَى زَادَ سُلَيْمَانُ فِي حَدِيثِهِ غَنِيٍّ أَوْ فَقِيرٍ",
                "id": "Telah menceritakan kepada Kami [Musaddad] dan [Sulaiman bin Daud Al 'Ataki], mereka berkata; telah menceritakan kepada Kami [Hammad bin Zaid] dari [An Nu'man bin Rasyid] dari [Az Zuhri]. [Musaddad] berkata dari [Tsa'labah bin Abdullah bin Abu Shu'air] dari [ayahnya], dan [Sulaiman bin Daud] berkata; dari [Abdullah bin Tsa'labah] atau [Tsa'labah bin Abdullah bin Abu Shu'air] dari [ayahnya], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Satu sha' gandum atas setiap anak kecil dan orang dewasa, yang merdeka dan budak, laki-laki atau perempuanl. Adapun orang kaya kalian maka Allah menzakatinya, dan adapun orang fakir kalian maka Allah mengembalikan kepadanya lebih banyak daripada apa yang telah ia berikan.\" Sulaiman menambahkan dalam haditsnya; orang kaya maupun miskin."
            },
            {
                "number": 1328,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ الدَّرَابِجِرْدِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا بَكْرٌ هُوَ ابْنُ وَائِلٍ عَنْ الزُّهْرِيِّ عَنْ ثَعْلَبَةَ بْنِ عَبْدِ اللَّهِ أَوْ قَالَ عَبْدِ اللَّهِ بْنِ ثَعْلَبَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى النَّيْسَابُورِيُّ حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا هَمَّامٌ عَنْ بَكْرٍ الْكُوفِيِّ قَالَ مُحَمَّدُ بْنُ يَحْيَى هُوَ بَكْرُ بْنُ وَائِلِ بْنِ دَاوُدَ أَنَّ الزُّهْرِيَّ حَدَّثَهُمْ عَنْ عَبْدِ اللَّهِ بْنِ ثَعْلَبَةَ بْنِ صُعَيْرٍ عَنْ أَبِيهِ قَالَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطِيبًا فَأَمَرَ بِصَدَقَةِ الْفِطْرِ صَاعِ تَمْرٍ أَوْ صَاعِ شَعِيرٍ عَنْ كُلِّ رَأْسٍ زَادَ عَلِيٌّ فِي حَدِيثِهِ أَوْ صَاعِ بُرٍّ أَوْ قَمْحٍ بَيْنَ اثْنَيْنِ ثُمَّ اتَّفَقَا عَنْ الصَّغِيرِ وَالْكَبِيرِ وَالْحُرِّ وَالْعَبْدِحَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ وَقَالَ ابْنُ شِهَابٍ قَالَ عَبْدُ اللَّهِ بْنُ ثَعْلَبَةَ قَالَ ابْنُ صَالِحٍ قَالَ الْعَدَوِيُّ وَإِنَّمَا هُوَ الْعُذْرِيُّ خَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّاسَ قَبْلَ الْفِطْرِ بِيَوْمَيْنِ بِمَعْنَى حَدِيثِ الْمُقْرِئِ",
                "id": "Telah menceritakan kepada Kami [Ali bin Al Hasan Ad Darabijirdi], telah menceritakan kepada Kami [Abdullah bin Yazid], telah menceritakan kepada Kami [Hammam], telah menceritakan kepada Kami [Bakr yaitu Ibnu Wail] dari [Az Zuhri] dari [Tsa'labah bin Abdullah] atau Abdullah bin Tsa'labah, dari Nabi shallallahu 'alaihi wasallam. Dan telah diriwayatkan melalui jalur yang lain: Telah menceritakan kepada Kami [Muhammad bin Yahya An Naisaburi], telah menceritakan kepada Kami [Musa bin Ismail], telah menceritakan kepada Kami [Hammam] dari [Bakr Al Kufi], Muhammad bin Yahya berkata; ia adalah Bakr bin Wail bin Daud, bahwa [Az Zuhri] telah menceritakan kepada mereka dar [Abdullah bin Tsa'labah bin Shu'air] dari [ayahnya], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam berdiri berkhutbah, dan memerintahkan untuk menunaikan zakat fitrah, satu sha' kurma, atau satu sha' gandum untuk setiap kepala. Ali menambahkan dalam haditsnya; atau satu sha' kurma diantara dua orang. Kemudian mereka sama mengenai anak kecil, orang dewasa, orang merdeka, dan seorang budak. Telah menceritakan kepada Kami [Ahmad bin Shalih], telah menceritakan kepada Kami [Abdurrazzaq], telah mengabarkan kepada Kami [Ibnu Juraij], ia berkata; [Ibnu Syihab] berkata; [Abdullah bin Tsa'labah] berkata; [Ibnu Shalih] berkata; [Al 'Adawi] berkata; sesungguhnya ia adalah Al 'Udzri; Rasulullah shallAllahu wa'alaihi wa sallam berkhutbah kepada orang-orang dua hari sebelum 'Idul Fitri, seperti makna hadits Al Muqri`."
            },
            {
                "number": 1329,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا سَهْلُ بْنُ يُوسُفَ قَالَ حُمَيْدٌ أَخْبَرَنَا عَنْ الْحَسَنِ قَالَخَطَبَ ابْنُ عَبَّاسٍ رَحِمَهُ اللَّهُ فِي آخِرِ رَمَضَانَ عَلَى مِنْبَرِ الْبَصْرَةِ فَقَالَ أَخْرِجُوا صَدَقَةَ صَوْمِكُمْ فَكَأَنَّ النَّاسَ لَمْ يَعْلَمُوا فَقَالَ مَنْ هَاهُنَا مِنْ أَهْلِ الْمَدِينَةِ قُومُوا إِلَى إِخْوَانِكُمْ فَعَلِّمُوهُمْ فَإِنَّهُمْ لَا يَعْلَمُونَ فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذِهِ الصَّدَقَةَ صَاعًا مِنْ تَمْرٍ أَوْ شَعِيرٍ أَوْ نِصْفَ صَاعٍ مِنْ قَمْحٍ عَلَى كُلِّ حُرٍّ أَوْ مَمْلُوكٍ ذَكَرٍ أَوْ أُنْثَى صَغِيرٍ أَوْ كَبِيرٍفَلَمَّا قَدِمَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ رَأَى رُخْصَ السِّعْرِ قَالَ قَدْ أَوْسَعَ اللَّهُ عَلَيْكُمْ فَلَوْ جَعَلْتُمُوهُ صَاعًا مِنْ كُلِّ شَيْءٍ قَالَ حُمَيْدٌ وَكَانَ الْحَسَنُ يَرَى صَدَقَةَ رَمَضَانَ عَلَى مَنْ صَامَ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Al Mutsanna], telah menceritakan kepada Kami [Sahl bin Yusuf], ia berkata; [Humaid] telah mengabarkan kepada Kami dari [Al Hasan], ia berkata; [Ibnu Abbas] rahimahullah berkhutbah pada akhir Ramadhan diatas mimbar Bashrah, lalu berkata: keluarkanlah zakat puasa kalian! Seakan orang-orang belum mengetahuinya, lalu dia berkata lagi; siapakah disini dari penduduk madinah, ajarkanlah mereka karena sesungguhnya mereka belum mengetahui. Rasulullah shallla Allahu 'alaihi wa sallam telah mewajibkan zakat ini satu sha' dari kurma atau gandum atau setengah sha' dari biji gandum, bagi setiap orang yang merdeka maupun budak, laki-laki maupun wanita, yang besar maupun yang kecil. Ketika Ali Bin Abi Thalib radliallahu 'anhu datang ia melihat murahnya harga, ia berkata; Allah telah melapangkan rizki kalian kalau seandainya kalian menjadikan satu sha' pada segala sesuatu. Humaid berkata; Al Hasan berpendapat bahwa zakat Ramadhan (fitrah) adalah kewajiban orang yang berpuasa. "
            },
            {
                "number": 1330,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ حَدَّثَنَا شَبَابَةُ عَنْ وَرْقَاءَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَبَعَثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُمَرَ بْنَ الْخَطَّابِ عَلَى الصَّدَقَةِ فَمَنَعَ ابْنُ جَمِيلٍ وَخَالِدُ بْنُ الْوَلِيدِ وَالْعَبَّاسُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يَنْقِمُ ابْنُ جَمِيلٍ إِلَّا أَنْ كَانَ فَقِيرًا فَأَغْنَاهُ اللَّهُ وَأَمَّا خَالِدُ بْنُ الْوَلِيدِ فَإِنَّكُمْ تَظْلِمُونَ خَالِدًا فَقَدْ احْتَبَسَ أَدْرَاعَهُ وَأَعْتُدَهُ فِي سَبِيلِ اللَّهِ وَأَمَّا الْعَبَّاسُ عَمُّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهِيَ عَلَيَّ وَمِثْلُهَا ثُمَّ قَالَ أَمَا شَعَرْتَ أَنَّ عَمَّ الرَّجُلِ صِنْوُ الْأَبِ أَوْ صِنْوُ أَبِيهِ",
                "id": "Telah menceritakan kepada Kami [Al Hasan bin Ash Shabbah], telah menceritakan kepada Kami [Syababah] dari [Warqa`] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] radliallahu 'anhu, ia berkata; Nabi shalla Allahu 'alaihi wa sallam mengutus Umar bin Khathab radliallahu 'anhu untuk mengambil zakat, lalu Ibnu Jamil, Khalid bin Walid dan Al Abbas menolak untuk membayar, maka Rasulullah shallla Allahu 'alaihi wa sallam berkata: \"Tidaklah Ibnu jamil membalas dendam kecuali ia dahulu adalah orang yang miskin lalu Allah memberikannya kekayaan, adapun Khalid bin Al Walid, maka sesungguhnya kalian telah mendzalimi Khalid, sungguh ia telah menahan baju-baju besinya dan perlengkapan perangnya dijalan Allah, adapun Al Abbas paman Rasulullah shallla Allahu 'alaihi wa sallam, maka zakatnya dan yang sepertinya menjadi kewajibanku. Kemudian beliau berkata: \"Tidakkah engkau merasakan bahwa paman seseorang adalah saudara sebapak atau saudara bapaknya?\""
            },
            {
                "number": 1331,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ زَكَرِيَّا عَنْ الْحَجَّاجِ بْنِ دِينَارٍ عَنْ الْحَكَمِ عَنْ حُجَيَّةَ عَنْ عَلِيٍّأَنَّ الْعَبَّاسَ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي تَعْجِيلِ صَدَقَتِهِ قَبْلَ أَنْ تَحِلَّ فَرَخَّصَ لَهُ فِي ذَلِكَ قَالَ مَرَّةً فَأَذِنَ لَهُ فِي ذَلِكَقَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ هُشَيْمٌ عَنْ مَنْصُورِ بْنِ زَاذَانَ عَنْ الْحَكَمِ عَنْ الْحَسَنِ بْنِ مُسْلِمٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحَدِيثُ هُشَيْمٍ أَصَحُّ",
                "id": "Telah menceritakan kepada Kami [Sa'id? bin Manshur], telah menceritakan kepada Kami [Ismail bin Zakariya] dari [Al Hajjaj bin Dinar] dari [Al Hakam] dari [Hujayyah] dari [Ali] bahwa Al Abbas bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai menyegerakan zakat sebelum wajib atas mereka? Kemudian beliau memberikan rukhshah baginya dalam hal tersebut. Abu Daud berkata; [Husyaim] telah meriwayatkan hadits ini dari [Manshur bin Zadzan] dari [Al Hakam] dari [Al Hasan bin Muslim] dari Nabi shallallahu 'alaihi wasallam, dan hadits Husyaim lebih shahih."
            },
            {
                "number": 1332,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا أَبِي أَخْبَرَنَا إِبْرَاهِيمُ بْنُ عَطَاءٍ مَوْلَى عِمْرَانَ بْنِ حُصَيْنٍ عَنْ أَبِيهِأَنَّ زِيَادًا أَوْ بَعْضَ الْأُمَرَاءِ بَعَثَ عِمْرَانَ بْنَ حُصَيْنٍ عَلَى الصَّدَقَةِ فَلَمَّا رَجَعَ قَالَ لِعِمْرَانَ أَيْنَ الْمَالُ قَالَ وَلِلْمَالِ أَرْسَلْتَنِي أَخَذْنَاهَا مِنْ حَيْثُ كُنَّا نَأْخُذُهَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَوَضَعْنَاهَا حَيْثُ كُنَّا نَضَعُهَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada Kami [Nashr bin Ali], telah mengabarkan kepada Kami [ayahku], telah mengabarkan kepada Kami [Ibrahim bin 'Atha`] mantan budak Imran bin Hushain dari [ayahnya] bahwa Ziyad atau sebagian pemimpin telah mengutus [Imran bin Hushain] untuk mengambil, kemudian tatkala ia kembali maka Ziyad bertanya kepadanya; dimanakah hartanya? Dia menjawab; apakah untuk harta engkau mengutusku? Kami telah mengambilnya dari tempat yang dahulu Kami pada masa Rasulullah shallla Allahu 'alaihi wa sallam mengambilnya dan Kami telah menempatkannya di tempat yang dahulu Kami tempatkan pada masa Rasulullah shallallahu 'alaihi wasallam."
            },
            {
                "number": 1333,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا سُفْيَانُ عَنْ حَكِيمِ بْنِ جُبَيْرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَأَلَ وَلَهُ مَا يُغْنِيهِ جَاءَتْ يَوْمَ الْقِيَامَةِ خُمُوشٌ أَوْ خُدُوشٌ أَوْ كُدُوحٌ فِي وَجْهِهِ فَقَالَ يَا رَسُولَ اللَّهِ وَمَا الْغِنَى قَالَ خَمْسُونَ دِرْهَمًا أَوْ قِيمَتُهَا مِنْ الذَّهَبِقَالَ يَحْيَى فَقَالَ عَبْدُ اللَّهِ بْنُ عُثْمَانَ لِسُفْيَانَ حِفْظِي أَنَّ شُعْبَةَ لَا يَرْوِي عَنْ حَكِيمِ بْنِ جُبَيْرٍ فَقَالَ سُفْيَانُ حَدَّثَنَاهُ زُبَيْدٌ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ",
                "id": "Telah menceritakan kepada Kami [Al Hasan bin Ali], telah menceritakan kepada Kami [Yahya bin Adam], telah menceritakan kepada Kami [Sufyan] dari [Hakim bin Jubair] dari [Muhammad bin Abdurrahman bin Yazid] dari [ayahnya] dari [Abdullah], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barang siapa yang meminta-minta sementara ia memiliki sesuatu yang mencukupinya maka pada Hari Kiamat terdapat luka pada wajahnya.\" Abdullah berkata; wahai Rasulullah, apa yang kecukupan itu? Beliau berkata: \"Lima puluh dirham, atau senilai dengannya dari emas.\" Yahya berkata; kemudian Abdullah bin Utsman berkata kepada Sufyan; aku hafal bahwa Syu'bah tidak meriwayatkan dari Hakim bin Jubair. Sufyan berkata; telah menceritakan kepadanya Zubaid dari Muhammad bin Abdurrahman bin Yazid. "
            },
            {
                "number": 1334,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ رَجُلٍ مِنْ بَنِي أَسَدٍأَنَّهُ قَالَ نَزَلْتُ أَنَا وَأَهْلِي بِبَقِيعِ الْغَرْقَدِ فَقَالَ لِي أَهْلِي اذْهَبْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلْهُ لَنَا شَيْئًا نَأْكُلُهُ فَجَعَلُوا يَذْكُرُونَ مِنْ حَاجَتِهِمْ فَذَهَبْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَجَدْتُ عِنْدَهُ رَجُلًا يَسْأَلُهُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا أَجِدُ مَا أُعْطِيكَ فَتَوَلَّى الرَّجُلُ عَنْهُ وَهُوَ مُغْضَبٌ وَهُوَ يَقُولُ لَعَمْرِي إِنَّكَ لَتُعْطِي مَنْ شِئْتَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْضَبُ عَلَيَّ أَنْ لَا أَجِدَ مَا أُعْطِيهِ مَنْ سَأَلَ مِنْكُمْ وَلَهُ أُوقِيَّةٌ أَوْ عِدْلُهَا فَقَدْ سَأَلَ إِلْحَافًا قَالَ الْأَسَدِيُّ فَقُلْتُ لَلِقْحَةٌ لَنَا خَيْرٌ مِنْ أُوقِيَّةٍ وَالْأُوقِيَّةُ أَرْبَعُونَ دِرْهَمًا قَالَ فَرَجَعْتُ وَلَمْ أَسْأَلْهُ فَقَدِمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ذَلِكَ شَعِيرٌ وَزَبِيبٌ فَقَسَمَ لَنَا مِنْهُ أَوْ كَمَا قَالَ حَتَّى أَغْنَانَا اللَّهُ عَزَّ وَجَلَّقَالَ أَبُو دَاوُد هَكَذَا رَوَاهُ الثَّوْرِيُّ كَمَا قَالَ مَالِكٌ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah] dari [Malik] dari [Zaid bin Aslam] dari ['Atho` bin Yasar] dari [seorang laki-laki dari Bani Asad] bahwa ia berkata; aku dan keluargaku singgah di Baqi' yang terdapat padanya pohon Gharqad. Kemudian keluargaku berkata; pergilah kepada Rasulullah shallAllahu wa'alaihi wa sallam dan mintakan kepada Rasulullah shallAllahu wa'alaihi wa sallam untuk kita sesuatu yang dapat kita makan. Kemudian mereka menyebutkan sebagian dari keperluan mereka, lalu aku pergi kepada Rasulullah shallAllahu wa'alaihi wa sallam dan aku dapati seorang laki-laki sedang meminta-minta kepada beliau sementara Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Aku tidak memiliki sesuatu yang dapat aku berikan kepadamu.\" Kemudian orang tersebut pergi dari beliau dalam keadaan marah, dan berkata; demi umurku, sungguh engkau memberi orang yang engkau kehendaki. Maka Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Ia marah kepadaku karena aku tidak mendapatkan sesuatu yang dapat aku berikan kepadanya. Barang siapa diantara kalian yang meminta-minta sedangkan ia memiliki satu uqiyah atau yang setara dengannya maka sungguh ia telah meminta-minta dengan mendesak.\" Al Asadi berkata; sungguh unta Kami yang hampir melahirkan lebih baik daripada satu uqiyah. Satu uqiyah adalah empat puluh dirham. Laki-laki tersebut berkata; kemudian aku kembali dan tidak meminta-minta kepada beliau. Kemudian Rasulullah shallAllahu wa'alaihi wa sallam setelah itu datang membawa gandum, dan kismis. Kemudian beliau membagikannya kepada Kami, atau sebagaimana ia katakana, hingga Allah 'azza wajalla memberikan kecukupan kepada Kami. Abu Daud berkata; demikianlah [Ats Tsauri] meriwayatkan sebagaimana yang dikatakan oleh Malik."
            },
            {
                "number": 1335,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَهِشَامُ بْنُ عَمَّارٍ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الرِّجَالِ عَنْ عُمَارَةَ بْنِ غَزِيَّةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِيهِ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَأَلَ وَلَهُ قِيمَةُ أُوقِيَّةٍ فَقَدْ أَلْحَفَ فَقُلْتُ نَاقَتِي الْيَاقُوتَةُ هِيَ خَيْرٌ مِنْ أُوقِيَّةٍ قَالَ هِشَامٌ خَيْرٌ مِنْ أَرْبَعِينَ دِرْهَمًا فَرَجَعْتُ فَلَمْ أَسْأَلْهُ شَيْئًا زَادَ هِشَامٌ فِي حَدِيثِهِ وَكَانَتْ الْأُوقِيَّةُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعِينَ دِرْهَمًا",
                "id": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id] serta [Hisyam bin 'Ammar], mereka berkata; telah menceritakan kepada Kami [Abdurrahman bin Abu Ar Rijal] dari ['Umarah bin Ghaziyyah] dari [Abdurrahman bin Abu Sa'id Al Khudri] dari [ayahnya yaitu Abu Sa'id], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barang siapa yang meminta-minta sedangkan ia memiliki harta senilai satu uqiyah maka sungguh ia telah mendesak dalam meminta.\" Maka aku katakan; untaku yang bernama Al Yaqutah lebih baik dari pada satu uqiyah, -Hisyam berkata; lebih baik daripada empat puluh dirham-, kemudian aku kembali dan tidak lagi meminta kepada beliau sesuatupun. Hisyam berkata dalam haditsnya; satu uqiyah pada masa Rasulullah shallAllahu wa'alaihi wa sallam adalah empat puluh dirham. "
            },
            {
                "number": 1336,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا مِسْكِينٌ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُهَاجِرِ عَنْ رَبِيعَةَ بْنِ يَزِيدَ عَنْ أَبِي كَبْشَةَ السَّلُولِيِّ حَدَّثَنَا سَهْلُ ابْنُ الْحَنْظَلِيَّةِ قَالَقَدِمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُيَيْنَةُ بْنُ حِصْنٍ وَالْأَقْرَعُ بْنُ حَابِسٍ فَسَأَلَاهُ فَأَمَرَ لَهُمَا بِمَا سَأَلَا وَأَمَرَ مُعَاوِيَةَ فَكَتَبَ لَهُمَا بِمَا سَأَلَا فَأَمَّا الْأَقْرَعُ فَأَخَذَ كِتَابَهُ فَلَفَّهُ فِي عِمَامَتِهِ وَانْطَلَقَ وَأَمَّا عُيَيْنَةُ فَأَخَذَ كِتَابَهُ وَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَانَهُ فَقَالَ يَا مُحَمَّدُ أَتُرَانِي حَامِلًا إِلَى قَوْمِي كِتَابًا لَا أَدْرِي مَا فِيهِ كَصَحِيفَةِ الْمُتَلَمِّسِ فَأَخْبَرَ مُعَاوِيَةُ بِقَوْلِهِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَأَلَ وَعِنْدَهُ مَا يُغْنِيهِ فَإِنَّمَا يَسْتَكْثِرُ مِنْ النَّارِ وَقَالَ النُّفَيْلِيُّ فِي مَوْضِعٍ آخَرَ مِنْ جَمْرِ جَهَنَّمَ فَقَالُوا يَا رَسُولَ اللَّهِ وَمَا يُغْنِيهِ وَقَالَ النُّفَيْلِيُّ فِي مَوْضِعٍ آخَرَ وَمَا الْغِنَى الَّذِي لَا تَنْبَغِي مَعَهُ الْمَسْأَلَةُ قَالَ قَدْرُ مَا يُغَدِّيهِ وَيُعَشِّيهِ وَقَالَ النُّفَيْلِيُّ فِي مَوْضِعٍ آخَرَ أَنْ يَكُونَ لَهُ شِبْعُ يَوْمٍ وَلَيْلَةٍ أَوْ لَيْلَةٍ وَيَوْمٍوَكَانَ حَدَّثَنَا بِهِ مُخْتَصَرًا عَلَى هَذِهِ الْأَلْفَاظِ الَّتِي ذَكَرْتُ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada Kami [Miskin], telah menceritakan kepada Kami [Muhammad bin Al Muhajir], dari [Rabi'ah bin Yazid] dari [Abu Kabsyah As Saluli], telah menceritakan kepada Kami [Sahl bin Al Hanzhalah], ia berkata; 'Uyainah bin Hishn dan Al Aqra' bin Habis datang kepada Rasulullah shallAllahu wa'alaihi wa sallam dan meminta kepada beliau. Kemudian beliau memerintahkan agar keduanya diberi apa yang mereka minta dan memerintahkan kepada Mu'awiyah agar menuliskan untuk mereka apa yang mereka minta. Adapun Al Aqra' maka ia mengambil catatannya dan melipatnya pada surbannya dan pergi, adapun 'Uyainah maka ia mengambil catatannya dan datang kepada Nabi shallallahu 'alaihi wasallam di tempatnya, dan berkata; wahai Rasulullah, apakah anda berpendapat saya akan membawa sebuah catatan kepada kaumku yang tidak saya ketahui apa isinya, seperti selembar kertas Al Mutalammis? Kemudian Mu'awiyah memberitahukan perkataannya tersebut kepada Rasulullah shallAllahu wa'alaihi wa sallam, kemudian Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barang siapa yang meminta-minta sementara ia memiliki sesuatu yang mencukupinya maka sesungguhnya ia memperbanyak api Neraka.\" An Nufaili pada tempat yang lain berkata; bara Neraka Jahannam. Kemudian mereka berkata; wahai Rasulullah, apa yang mencukupinya? -An Nufaili berkata pada tempat yang lain; apakah kecukupan yang tidak layak karenanya untuk meminta-minta? - Beliau bersabda: \"Seukuran sesuatu yang dapat memberinya makan siang dan malam.\" An Nufaili berkata pada tempat yang lain; ia kenyang satu hari semalam, atau semalam dan sehari. Ia menceritakan kepada Kami secara ringkas sesuai dengan lafazh yang telah Kami sebutkan ini. "
            },
            {
                "number": 1337,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ عُمَرَ بْنِ غَانِمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ زِيَادٍ أَنَّهُ سَمِعَ زِيَادَ بْنَ نُعَيْمٍ الْحَضْرَمِيَّ أَنَّهُ سَمِعَ زِيَادَ بْنَ الْحَارِثِ الصُّدَائِيَّ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَايَعْتُهُ فَذَكَرَ حَدِيثًا طَوِيلًا قَالَ فَأَتَاهُ رَجُلٌ فَقَالَ أَعْطِنِي مِنْ الصَّدَقَةِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ تَعَالَى لَمْ يَرْضَ بِحُكْمِ نَبِيٍّ وَلَا غَيْرِهِ فِي الصَّدَقَاتِ حَتَّى حَكَمَ فِيهَا هُوَ فَجَزَّأَهَا ثَمَانِيَةَ أَجْزَاءٍ فَإِنْ كُنْتَ مِنْ تِلْكَ الْأَجْزَاءِ أَعْطَيْتُكَ حَقَّكَ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah], telah menceritakan kepada Kami [Abdullah] yaitu Ibnu Umar bin Ghanim dari [Abdurrahman bin Ziyad] bahwa ia mendengar [Ziyad bin Nu'aim Al Hadhrami] bahwa ia telah mendengar [Ziyad bin Harits Ash Shuda'i] berkata; aku menemui Rasulullah shallallahu 'alaihi wasallam lalu membaiatnya. Kemudan ia menyebutkan hadits yang panjang. Ia berkata; kemudian terdapat seseorang yang datang kepada beliau dan berkata; berikanlah aku sebagian dari sedekah! Maka Rasulullah shallallahu 'alaihi wasallam berkata kepadanya: \"Sesungguhnya Allah tidak tidak ridha kepada hukum seorang Nabi atau yang lainnya, Dialah yang telah menentukannya dan telah menetapkannya bagi delapan bagian dalam perkara zakat, hingga Dia sendiri yang memutuskan. Maka Allah membaginya menjadi delapan bagian, seandainya engkau termasuk dari bagian itu maka aku akan memberikan hakmu kepadamu. "
            },
            {
                "number": 1338,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَزُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ الْمِسْكِينُ الَّذِي تَرُدُّهُ التَّمْرَةُ وَالتَّمْرَتَانِ وَالْأَكْلَةُ وَالْأَكْلَتَانِ وَلَكِنَّ الْمِسْكِينَ الَّذِي لَا يَسْأَلُ النَّاسَ شَيْئًا وَلَا يَفْطِنُونَ بِهِ فَيُعْطُونَهُحَدَّثَنَا مُسَدَّدٌ وَعُبَيْدُ اللَّهِ بْنُ عُمَرَ وَأَبُو كَامِلٍ الْمَعْنَى قَالُوا حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ قَالَ وَلَكِنَّ الْمِسْكِينَ الْمُتَعَفِّفُ زَادَ مُسَدَّدٌ فِي حَدِيثِهِ لَيْسَ لَهُ مَا يَسْتَغْنِي بِهِ الَّذِي لَا يَسْأَلُ وَلَا يُعْلَمُ بِحَاجَتِهِ فَيُتَصَدَّقَ عَلَيْهِ فَذَاكَ الْمَحْرُومُ وَلَمْ يَذْكُرْ مُسَدَّدٌ الْمُتَعَفِّفُ الَّذِي لَا يَسْأَلُ قَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ مُحَمَّدُ بْنُ ثَوْرٍ وَعَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ وَجَعَلَا الْمَحْرُومَ مِنْ كَلَامِ الزُّهْرِيِّ وَهُوَ أَصَحُّ",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah] dan [Zuhair bin Harb], mereka berkata; telah menceritakan kepada Kami [Jarir] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang miskin bukanlah orang yang kembali karena diberi satu atau dua butir kurma, serta satu atau dua kali makan, akan tetapi orang miskin adalah orang yang tidak meminta sesuatu kepada orang-orang dan mereka tidak memahaminya, sehingga mereka dapat memberi kepadanya.\" Telah menceritakan kepada Kami [Musaddad] serta ['ubaidhullah bin Umar] dan [Abu Kamil] secara makna, mereka mengatakan; telah menceritakan kepada Kami [Abdul Wahid bin Ziyad], telah menceritakan kepada Kami [Ma'mar] dari [Az Zuhri] dari [Abu Salahamah] dari [Abu Hurairah], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda seperti itu: \"Akan tetapi orang yang miskin adalah orang yang menjaga kehormatan dirinya…\" Musaddad dalam haditsnya menambahkan; ia tidak memiliki sesuatu yang mencukupinya, orang yang tidak meminta-minta dan tidak diketahui kebutuhannya, sehingga dapat diberi sedekah. Maka itulah orang yang terhalang mendapatkan pemberian. Musaddad tidak menyebutkan; orang yang menjaga kehormatan dirinya yang tidak meminta-minta. Abu Daud berkata; [Muhammad bin Tsaur] serta [Abdurrazzaq] telah meriwayatkan dari [Ma'mar], dan mereka menjadikan kata; orang yang terhalang mendapatkan pemberian merupakan perkataan Az Zuhri, dan hal itu yang paling benar. "
            },
            {
                "number": 1339,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عُبَيْدِ اللَّهِ بْنِ عَدِيِّ بْنِ الْخِيَارِ قَالَ أَخْبَرَنِي رَجُلَانِأَنَّهُمَا أَتَيَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ وَهُوَ يُقَسِّمُ الصَّدَقَةَ فَسَأَلَاهُ مِنْهَا فَرَفَعَ فِينَا الْبَصَرَ وَخَفَضَهُ فَرَآنَا جَلْدَيْنِ فَقَالَ إِنَّ شِئْتُمَا أَعْطَيْتُكُمَا وَلَا حَظَّ فِيهَا لِغَنِيٍّ وَلَا لِقَوِيٍّ مُكْتَسِبٍ",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Isa bin Yunus], telah menceritakan kepada Kami [Hisyam bin 'Urwah] dari [ayahnya] dari [Ubaidillah bin Adi bin Al Khiyar] berkata; telah telah mengabarkan kepadaku [dua orang yang telah menemui Rasulullah shallallahu 'alaihi wasallam pada waktu haji wada'] sementara beliau sedang membagikan zakat, mereka berdua meminta kepada beliau sebagian dari zakat tersebut, lalu beliau mengangkat pandangannya kepada Kami lalu menundukkannya dan beliau melihat Kami adalah orang yang kuat, lalu beliau berkata: \"Kalau kalian berdua menginginkannya maka Kami akan memberikan kepada kalian berdua, dan tidak ada bagian dalam zakat tersebut bagi orang yang kaya dan orang yang mampu untuk bekerja.\""
            },
            {
                "number": 1340,
                "arab": "حَدَّثَنَا عَبَّادُ بْنُ مُوسَى الْأَنْبَارِيُّ الْخُتُّلِيُّ حَدَّثَنَا إِبْرَاهِيمُ يَعْنِي ابْنَ سَعْدٍ قَالَ أَخْبَرَنِي أَبِي عَنْ رَيْحَانَ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ وَلَا لِذِي مِرَّةٍ سَوِيٍّقَالَ أَبُو دَاوُد رَوَاهُ سُفْيَانُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ كَمَا قَالَ إِبْرَاهِيمُ وَرَوَاهُ شُعْبَةُ عَنْ سَعْدٍ قَالَ لِذِي مِرَّةٍ قَوِيٍّ وَالْأَحَادِيثُ الْأُخَرُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْضُهَا لِذِي مِرَّةٍ قَوِيٍّ وَبَعْضُهَا لِذِي مِرَّةٍ سَوِيٍّ و قَالَ عَطَاءُ بْنُ زُهَيْرٍ أَنَّهُ لَقِيَ عَبْدَ اللَّهِ بْنَ عَمْرٍو فَقَالَ إِنَّ الصَّدَقَةَ لَا تَحِلُّ لِقَوِيٍّ وَلَا لِذِي مِرَّةٍ سَوِيٍّ",
                "id": "Telah menceritakan kepada Kami ['Abbad bin Musa Al Anbari Al Khuttuli], telah menceritakan kepada Kami [Ibrahim yaitu Ibnu Sa'd], ia berkata; telah mengabarkan kepadaku [ayahku] dari [Raihan bin Yazid] dari [Abdullah bin 'Amr] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidak halal zakat bagi orang kaya dan orang yang kuat dan sehat badan.\" Abu Daud berkata; [Sufyan] telah meriwayatkannya dari [Sa'd bin Ibrahim] sebagaimana yang dikatakan Ibrahim. Dan [Syu'bah] telah meriwayatkannya dari [Sa'd], ia berkata; lidzii mirratin qawiyyin. Sedangkan hadits-hadits yang lain dari Nabi shallallahu 'alaihi wasallam sebagiannya dengan kata; lidzii mirratin qawiyyin, dan sebagiannya; lidzii mirratin sawiyyin. 'Atha` bin Zuhair berkata; bahwa ia telah berjumpa dengan Abdullah bin 'Amr dan berkata; sesungguhnya zakat tidak halal bagi orang yang kuat, dan orang yang kuat lagi sehat badan. "
            },
            {
                "number": 1341,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ إِلَّا لِخَمْسَةٍ لِغَازٍ فِي سَبِيلِ اللَّهِ أَوْ لِعَامِلٍ عَلَيْهَا أَوْ لِغَارِمٍ أَوْ لِرَجُلٍ اشْتَرَاهَا بِمَالِهِ أَوْ لِرَجُلٍ كَانَ لَهُ جَارٌ مِسْكِينٌ فَتُصُدِّقَ عَلَى الْمِسْكِينِ فَأَهْدَاهَا الْمِسْكِينُ لِلْغَنِيِّحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ قَالَ أَبُو دَاوُد وَرَوَاهُ ابْنُ عُيَيْنَةَ عَنْ زَيْدٍ كَمَا قَالَ مَالِكٌ وَرَوَاهُ الثَّوْرِيُّ عَنْ زَيْدٍ قَالَ حَدَّثَنِي الثَّبْتُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah] dari [Malik] dari [Zaid bin Aslam] dari ['Atha` bin Yasar] bahwa Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Tidak halal zakat bagi orang kaya kecuali bagi lima orang, yaitu orang yang berperang di jalan Allah, atau petugas zakat, atau orang yang berhutang, atau seseorang yang membelinya dengan hartanya, atau orang yang memiliki tetangga miskin kemudian orang miskin tersebut diberi zakat, lalu ia memberikannya kepada orang yang kaya.\" Telah menceritakan kepada Kami [Al Hasan bin Ali], telah menceritakan kepada Kami [Abdurrazzaq], telah mengabarkan kepada Kami [Ma'mar] dari [Zaid bin Aslam] dari ['Atha' bin Yasar] dari [Abu Sa'id Al Khudri], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: ……. sama dengan makna hadits tersebut. Abu Daud berkata; [Ibnu 'Uyainah] telah meriwayatkannya dari [Zaid] sebagaimana yang dikatakan Malik. Dan Ats Tsauri telah meriwayatkannya dari Zaid, ia berkata; telah menceritakan kepadaku Ats Tsabtu dari Nabi shallallahu 'alaihi wasallam …."
            },
            {
                "number": 1342,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ الطَّائِيُّ حَدَّثَنَا الْفِرْيَابِيُّ حَدَّثَنَا سُفْيَانُ عَنْ عِمْرَانَ الْبَارِقِيِّ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ إِلَّا فِي سَبِيلِ اللَّهِ أَوْ ابْنِ السَّبِيلِ أَوْ جَارٍ فَقِيرٍ يُتَصَدَّقُ عَلَيْهِ فَيُهْدِي لَكَ أَوْ يَدْعُوكَقَالَ أَبُو دَاوُد وَرَوَاهُ فِرَاسٌ وَابْنُ أَبِي لَيْلَى عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin 'Auf Ath Thai], telah menceritakan kepada Kami [Al Firyabi], telah menceritakan kepada Kami [Sufyan] dari [Imran Al Bariqi] dari ['Athiyyah] dari [Abu Sa'id], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Tidak halal zakat bagi orang kaya, kecuali di jalan Allah, atau orang yang dalam perjalanan, atau tetangga fakir yang diberi zakat kemudian ia memberikan hadiah kepadamu atau mengundangmu.\" Abu Daud berkata; dan hadits tersebut telah diriwayatkan oleh [Firas], dan [Ibnu Abu Laila] dari ['Athiyyah], dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam seperti itu. "
            },
            {
                "number": 1343,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ الصَّبَّاحِ حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنِي سَعِيدُ بْنُ عُبَيْدٍ الطَّائِيُّ عَنْ بُشَيْرِ بْنِ يَسَارٍ زَعَمَ أَنَّ رَجُلًا مِنْ الْأَنْصَارِ يُقَالُ لَهُ سَهْلُ بْنُ أَبِي حَثْمَةَ أَخْبَرَهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدَاهُ بِمِائَةٍ مِنْ إِبِلِ الصَّدَقَةِ يَعْنِي دِيَةَ الْأَنْصَارِيِّ الَّذِي قُتِلَ بِخَيْبَرَ",
                "id": "Telah menceritakan kepada Kami [Al Hasan bin Muhamad bin Ash Shabbah], telah menceritakan kepada Kami [Abu Nu'aim], telah menceritakan kepadaku [Sa'id bin 'Ubaid Ath Thai] dari [Busyair bin Yasar] ia menyangka bahwa seseorang dari kalangan anshar yang dikenal dengan nama [Sahl bin Abu Hatsmah] telah mengabarkan kepadanya bahwa Nabi shalla Allahu 'alaihi wa sallam membayar diyahnya dengan seratus unta dari unta zakat, yaitu diyah seorang anshar yang terbunuh di Khaibar."
            },
            {
                "number": 1344,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ زَيْدِ بْنِ عُقْبَةَ الْفَزَارِيِّ عَنْ سَمُرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمَسَائِلُ كُدُوحٌ يَكْدَحُ بِهَا الرَّجُلُ وَجْهَهُ فَمَنْ شَاءَ أَبْقَى عَلَى وَجْهِهِ وَمَنْ شَاءَ تَرَكَ إِلَّا أَنْ يَسْأَلَ الرَّجُلُ ذَا سُلْطَانٍ أَوْ فِي أَمْرٍ لَا يَجِدُ مِنْهُ بُدًّا",
                "id": "Telah menceritakan kepada Kami [Hafsh bin Umar An Namari], telah menceritakan kepada Kami [Syu'bah] dari [Abdul Malik bin 'Umair] dari [Zaid bin 'Uqbah Al Fazari] dari [Samurah] dari Nabi shalla Allahu 'alaihi wa sallam beliau bersabda: \"Sesungguhnya meminta-minta itu perbuatan buruk, dengannya seseorang mencoreng wajahnya, barangsiapa yang mau maka ia biarkan coreng di wajahnya dan barangsiapa yang mau maka ia tinggalkan, kecuali jika seseorang meminta kepada pemimpin atau meminta sesuatu yang harus ia dapatkan.\""
            },
            {
                "number": 1345,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ هَارُونَ بْنِ رِئَابٍ قَالَ حَدَّثَنِي كِنَانَةُ بْنُ نُعَيْمٍ الْعَدَوِيُّ عَنْ قَبِيصَةَ بْنِ مُخَارِقٍ الْهِلَالِيِّ قَالَتَحَمَّلْتُ حَمَالَةً فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَقِمْ يَا قَبِيصَةُ حَتَّى تَأْتِيَنَا الصَّدَقَةُ فَنَأْمُرَ لَكَ بِهَا ثُمَّ قَالَ يَا قَبِيصَةُ إِنَّ الْمَسْأَلَةَ لَا تَحِلُّ إِلَّا لِأَحَدِ ثَلَاثَةٍ رَجُلٍ تَحَمَّلَ حَمَالَةً فَحَلَّتْ لَهُ الْمَسْأَلَةُ فَسَأَلَ حَتَّى يُصِيبَهَا ثُمَّ يُمْسِكُ وَرَجُلٍ أَصَابَتْهُ جَائِحَةٌ فَاجْتَاحَتْ مَالَهُ فَحَلَّتْ لَهُ الْمَسْأَلَةُ فَسَأَلَ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ قَالَ سِدَادًا مِنْ عَيْشٍ وَرَجُلٍ أَصَابَتْهُ فَاقَةٌ حَتَّى يَقُولَ ثَلَاثَةٌ مِنْ ذَوِي الْحِجَى مِنْ قَوْمِهِ قَدْ أَصَابَتْ فُلَانًا الْفَاقَةُ فَحَلَّتْ لَهُ الْمَسْأَلَةُ فَسَأَلَ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ سِدَادًا مِنْ عَيْشٍ ثُمَّ يُمْسِكُ وَمَا سِوَاهُنَّ مِنْ الْمَسْأَلَةِ يَا قَبِيصَةُ سُحْتٌ يَأْكُلُهَا صَاحِبُهَا سُحْتًا",
                "id": "Telah menceritakan kepada Kami [Musaddad] telah menceritakan kepada Kami [Hammad bin Zaid], dari [Harun bin Riab], ia berkata; ia berkata; telah menceritakan kepadaku [Kinanah bin Nu'aim Al 'Adawi] dari [Qabishah bin Mukhariq Al Hilali], ia berkata; saya menanggung sebuah denda kemudian datang kepada Rasulullah shallallahu 'alaihi wasallam dan bertanya kepadanya mengenai hal tersebut. Kemudian beliau berkata: \"Bangunlah wahai Qabishah hingga datang zakat kepada Kami kemudian Kami perintahkan agar diberikan kepadamu.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Qabishah, sesungguhnya sedekah tidaklah halal kecuali bagi salah satu dari tiga orang yaitu; orang yang menanggung denda maka halal baginya untuk meminta-minta, kemudian meminta-minta hingga ia mendapatkannya kemudian ia menahan diri dari meminta-minta, dan seorang laki-laki yang tertimpa bencana hingga menghancurkan hartanya, maka halal baginya untuk meminta-minta, kemudian ia meminta-minta hingga mendapatkan penopang hidup kemudian menahan diri dari meminta-minta. Dan seorang laki-laki yang tertimpa kemiskinan hingga terdapat tiga orang yang bijaksana dari kaumnya bersaksi bahwa Fulan telah tertimpa kemiskinan. Maka halal baginya untuk meminta-minta hingga ia mendapatkan penopang hidup, dan sikap meminta-minta selain itu wahai Qabishah adalah perbuatan haram yang dimakan pelakunya sebagai sesuatu yang haram.\""
            },
            {
                "number": 1346,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ عَنْ الْأَخْضَرِ بْنِ عَجْلَانَ عَنْ أَبِي بَكْرٍ الْحَنَفِيِّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَجُلًا مِنْ الْأَنْصَارِ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْأَلُهُ فَقَالَ أَمَا فِي بَيْتِكَ شَيْءٌ قَالَ بَلَى حِلْسٌ نَلْبَسُ بَعْضَهُ وَنَبْسُطُ بَعْضَهُ وَقَعْبٌ نَشْرَبُ فِيهِ مِنْ الْمَاءِ قَالَ ائْتِنِي بِهِمَا قَالَ فَأَتَاهُ بِهِمَا فَأَخَذَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ وَقَالَ مَنْ يَشْتَرِي هَذَيْنِ قَالَ رَجُلٌ أَنَا آخُذُهُمَا بِدِرْهَمٍ قَالَ مَنْ يَزِيدُ عَلَى دِرْهَمٍ مَرَّتَيْنِ أَوْ ثَلَاثًا قَالَ رَجُلٌ أَنَا آخُذُهُمَا بِدِرْهَمَيْنِ فَأَعْطَاهُمَا إِيَّاهُ وَأَخَذَ الدِّرْهَمَيْنِ وَأَعْطَاهُمَا الْأَنْصَارِيَّ وَقَالَ اشْتَرِ بِأَحَدِهِمَا طَعَامًا فَانْبِذْهُ إِلَى أَهْلِكَ وَاشْتَرِ بِالْآخَرِ قَدُومًا فَأْتِنِي بِهِ فَأَتَاهُ بِهِ فَشَدَّ فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُودًا بِيَدِهِ ثُمَّ قَالَ لَهُ اذْهَبْ فَاحْتَطِبْ وَبِعْ وَلَا أَرَيَنَّكَ خَمْسَةَ عَشَرَ يَوْمًا فَذَهَبَ الرَّجُلُ يَحْتَطِبُ وَيَبِيعُ فَجَاءَ وَقَدْ أَصَابَ عَشْرَةَ دَرَاهِمَ فَاشْتَرَى بِبَعْضِهَا ثَوْبًا وَبِبَعْضِهَا طَعَامًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا خَيْرٌ لَكَ مِنْ أَنْ تَجِيءَ الْمَسْأَلَةُ نُكْتَةً فِي وَجْهِكَ يَوْمَ الْقِيَامَةِ إِنَّ الْمَسْأَلَةَ لَا تَصْلُحُ إِلَّا لِثَلَاثَةٍ لِذِي فَقْرٍ مُدْقِعٍ أَوْ لِذِي غُرْمٍ مُفْظِعٍ أَوْ لِذِي دَمٍ مُوجِعٍ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah], telah mengabarkan kepada Kami [Isa bin Yunus] dari [Al Akhdhar bin 'Ajlan] dari [Abu Bakr Al Hanafi] dari [Anas bin Malik] bahwa seorang laki-laki dari kalangan Anshar datang kepada Nabi shallallahu 'alaihi wasallam meminta kepada beliau, kemudian beliau bertanya: \"Apakah di rumahmu terdapat sesuatu?\" Ia berkata; ya, alas pelana yang Kami pakai sebagiannya dan Kami hamparkan sebagiannya, serta gelas besar yang gunakan untuk minum air. Beliau berkata: \"Bawalah keduanya kepadaku.\" Anas berkata; kemudian ia membawanya kepada beliau, lalu Rasulullah shallAllahu wa'alaihi wa sallam mengambilnya dengan tangan beliau dan berkata; \"Siapakah yang mau membeli kedua barang ini?\" seorang laki-laki berkata; saya membelinya dengan satu dirham. Beliau berkata: \"Siapa yang menambah lebih dari satu dirham?\" Beliau mengatakannya dua atau tiga kali. Seorang laki-laki berkata; saya membelinya dengan dua dirham. Kemudian beliau memberikannya kepada orang tersebut, dan mengambil uang dua dirham. Beliau memberikan uang tersebut kepada orang anshar tersebut dan berkata: \"Belilah makanan dengan satu dirham kemudian berikan kepada keluargamu, dan belilah kapak kemudian bawalah kepadaku.\" Kemudian orang tersebut membawanya kepada beliau, lalu Rasulullah shallAllahu wa'alaihi wa sallam mengikatkan kayu pada kapak tersebut dengan tangannya kemudian berkata kepadanya: \"Pergilah kemudian carilah kayu dan juAllah. Jangan sampai aku melihatmu selama lima belas hari.\" Kemudian orang tersebut pergi dan mencari kayu serta menjualnya, lalu datang dan ia telah memperoleh uang sepuluh dirham. Kemudian ia membeli pakaian dengan sebagiannya dan makanan dengan sebagiannya. Kemudian Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Ini lebih baik bagimu daripada sikap meminta-minta datang sebagai noktah di wajahmu pada Hari Kiamat. Sesungguhnya sikap meminta-minta tidak layak kecuali untuk tiga orang, yaitu untuk orang fakir dan miskin, atau orang yang memiliki hutang sangat berat, atau orang yang menanggung diyah (sementara ia tidak mampu membayarnya).\""
            },
            {
                "number": 1347,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ عَنْ رَبِيعَةَ يَعْنِي ابْنَ يَزِيدَ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ أَبِي مُسْلِمٍ الْخَوْلَانِيِّ قَالَ حَدَّثَنِي الْحَبِيبُ الْأَمِينُ أَمَّا هُوَ إِلَيَّ فَحَبِيبٌ وَأَمَّا هُوَ عِنْدِي فَأَمِينٌ عَوْفُ بْنُ مَالِكٍقَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبْعَةً أَوْ ثَمَانِيَةً أَوْ تِسْعَةً فَقَالَ أَلَا تُبَايِعُونَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكُنَّا حَدِيثَ عَهْدٍ بِبَيْعَةٍ قُلْنَا قَدْ بَايَعْنَاكَ حَتَّى قَالَهَا ثَلَاثًا فَبَسَطْنَا أَيْدِيَنَا فَبَايَعْنَاهُ فَقَالَ قَائِلٌ يَا رَسُولَ اللَّهِ إِنَّا قَدْ بَايَعْنَاكَ فَعَلَامَ نُبَايِعُكَ قَالَ أَنْ تَعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا وَتُصَلُّوا الصَّلَوَاتِ الْخَمْسَ وَتَسْمَعُوا وَتُطِيعُوا وَأَسَرَّ كَلِمَةً خَفِيَّةً قَالَ وَلَا تَسْأَلُوا النَّاسَ شَيْئًا قَالَ فَلَقَدْ كَانَ بَعْضُ أُولَئِكَ النَّفَرِ يَسْقُطُ سَوْطُهُ فَمَا يَسْأَلُ أَحَدًا أَنْ يُنَاوِلَهُ إِيَّاهُقَالَ أَبُو دَاوُد حَدِيثُ هِشَامٍ لَمْ يَرْوِهِ إِلَّا سَعِيدٌ",
                "id": "Telah menceritakan kepada Kami [Hisyam bin 'Ammar] telah menceritakan kepada Kami [Al Walid] telah menceritakan kepada Kami [Sa'id? bin Abdul Aziz] dari [Rabi'ah yaitu Ibnu Yazid] dari [Abu Idris Al Khaulani] dari [Abu Muslim Al Khaulani], ia berkata; telah menceritakan kepadaku Al Habib Al Amin, ia adalah orang yang aku cintai dan ia bagiku adalah orang yang dapat dipercaya yaitu ['Auf bin Malik], ia berkata; Kami pernah bersama Rasulullah shallAllahu wa'alaihi wa sallam berjumlah tujuh, atau delapan atau sembilan orang. Beliau berkata: \"Tidakkah kalian membaiat Rasulullah shallAllahu wa'alaihi wa sallam?\" Sementara Kami baru saja berbaiat kepada beliau. Kami katakan; Kami telah membaiat anda. Hingga beliau mengatakannya sebanyak tiga kali. Kemudian Kami menghamparkan tangan Kami dan membaiat beliau. Kemudian seseorang berkata; wahai Rasulullah, Kami telah membaiat anda, kepada apakah Kami membaiat anda? Beliau bersabda: \"Agar kalian beribadah kepada Allah dan tidak menyekutukan sesuatupun denganNya, melakukan sholat lima waktu, mendengar dan mentaati…. -dan beliau berkata pelan-: dan kalian tidak meminta-minta kepada orang sesuatupun.\" Ia berkata; sungguh sebagian orang-orang tersebut cemetinya terjatuh dan ia tidak meminta seorangpun untuk mengambilkannya. Abu Daud berkata; Hadits Hisyam tidak diriwayatkan kecuali oleh Sa'id. "
            },
            {
                "number": 1348,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ عَنْ أَبِي الْعَالِيَةِ عَنْ ثَوْبَانَ قَالَ وَكَانَ ثَوْبَانُ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يَكْفُلُ لِي أَنْ لَا يَسْأَلَ النَّاسَ شَيْئًا وَأَتَكَفَّلُ لَهُ بِالْجَنَّةِ فَقَالَ ثَوْبَانُ أَنَا فَكَانَ لَا يَسْأَلُ أَحَدًا شَيْئًا",
                "id": "Telah menceritakan kepada Kami ['ubaidhullah bin Mu'adz], telah menceritakan kepada Kami [ayahku], telah menceritakan kepada Kami [Syu'bah] dari ['Ashim] dari [Abu Al 'Aliyah] dari [Tsauban] mantan budak Rasulullah shallAllahu wa'alaihi wa sallam, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapakah yang menjamin untukku untuk tidak meminta-minta sesuatupun kepada orang lain, dan aku menjaminnya masuk Surga? Tsauban berkata; saya! Dan Tsauban tidak pernah meminta sesuatupun kepada orang lain. "
            },
            {
                "number": 1349,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ نَاسًا مِنْ الْأَنْصَارِ سَأَلُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْطَاهُمْ ثُمَّ سَأَلُوهُ فَأَعْطَاهُمْ حَتَّى إِذَا نَفَدَ مَا عِنْدَهُ قَالَ مَا يَكُونُ عِنْدِي مِنْ خَيْرٍ فَلَنْ أَدَّخِرَهُ عَنْكُمْ وَمَنْ يَسْتَعْفِفْ يُعِفَّهُ اللَّهُ وَمَنْ يَسْتَغْنِ يُغْنِهِ اللَّهُ وَمَنْ يَتَصَبَّرْ يُصَبِّرْهُ اللَّهُ وَمَا أَعْطَى اللَّهُ أَحَدًا مِنْ عَطَاءٍ أَوْسَعَ مِنْ الصَّبْرِ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah] dari [Malik] dari [Ibnu Syihab] dari ['Atho` bin Yazid Al Laitsi] dari [Abu Sa'id Al Khudri] bahwa beberapa orang Anshar meminta kepada Rasulullah, lalu beliau memberi mereka. Kemudian mereka meminta lagi kepadanya, lalu beliau beliau memberi mereka hingga habis apa yang beliau miliki. Beliau bersabda: \"Kebaikan (harta) yang ada padaku tidak akan aku simpan dari kalian. Dan barang siapa yang menjaga kehormatan dirinya maka Allah Azza wa Jalla akan menjaga kehormatannya, dan barang siapa yang bersabar maka Allah akan menjadikannya bersabar. Tidaklah seseorang diberi suatu pemberian yang lebih baik dan lebih luas daripada kesabaran.\""
            },
            {
                "number": 1350,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ ح و حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ حَبِيبٍ أَبُو مَرْوَانَ حَدَّثَنَا ابْنُ الْمُبَارَكِ وَهَذَا حَدِيثُهُ عَنْ بَشِيرِ بْنِ سَلْمَانَ عَنْ سَيَّارٍ أَبِي حَمْزَةَ عَنْ طَارِقٍ عَنْ ابْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَصَابَتْهُ فَاقَةٌ فَأَنْزَلَهَا بِالنَّاسِ لَمْ تُسَدَّ فَاقَتُهُ وَمَنْ أَنْزَلَهَا بِاللَّهِ أَوْشَكَ اللَّهُ لَهُ بِالْغِنَى إِمَّا بِمَوْتٍ عَاجِلٍ أَوْ غِنًى عَاجِلٍ",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Abdullah bin Daud], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada Kami [Abdul Malik bin Habib Abu Marwan], telah menceritakan kepada Kami [Ibnu Al Mubarak], dan ini adalah haditsnya, dari [Basyir bin Salman] dari [Sayyar Abu Hamzah], dari [Thariq] dari [Ibnu Mas'ud], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barangsiapa yang tertimpa kemiskinan lalu menampakkannya kepada manusia, maka kemiskinannya tidak hilang, dan barangsiapa yang menampakkannya kepada Allah, maka Allah akan mempercepat kekayaan baginya, baik dengan kematian yang segera atau dengan kekayaan yang cepat. "
            },
            {
                "number": 1351,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ بَكْرِ بْنِ سَوَادَةَ عَنْ مُسْلِمِ بْنِ مَخْشِيٍّ عَنْ ابْنِ الْفِرَاسِيِّأَنَّ الْفِرَاسِيَّ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُ يَا رَسُولَ اللَّهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا وَإِنْ كُنْتَ سَائِلًا لَا بُدَّ فَاسْأَلْ الصَّالِحِينَ",
                "id": "[Qutaibah], ia berkata; Telah menceritakan kepada Kami [Al Laits] dari [Ja'far bin Rabi'ah] dari [Bakr bin Sawadah] dari [Muslim bin Makhsyi] dari [Ibnu Al Firasi], ia berkata kepada Rasulullah shallallahu 'alaihi wasallam; Apakah saya boleh meminta wahai Rasulullah!\" Rasulullah menjawab: \"Tidak, dan seandainya engkau harus meminta maka mintalah kepada orang-orang shaleh.\""
            },
            {
                "number": 1352,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا اللَّيْثُ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ ابْنِ السَّاعِدِيِّ قَالَاسْتَعْمَلَنِي عُمَرُ رَضِيَ اللَّهُ عَنْهُ عَلَى الصَّدَقَةِ فَلَمَّا فَرَغْتُ مِنْهَا وَأَدَّيْتُهَا إِلَيْهِ أَمَرَ لِي بِعُمَالَةٍ فَقُلْتُ إِنَّمَا عَمِلْتُ لِلَّهِ وَأَجْرِي عَلَى اللَّهِ قَالَ خُذْ مَا أُعْطِيتَ فَإِنِّي قَدْ عَمِلْتُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَمَّلَنِي فَقُلْتُ مِثْلَ قَوْلِكَ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُعْطِيتَ شَيْئًا مِنْ غَيْرِ أَنْ تَسْأَلَهُ فَكُلْ وَتَصَدَّقْ",
                "id": "Telah? mengabarkan kepada Kami [Abu Al Walid Ath Thayalisi], telah? menceritakan kepada Kami [Al Laits] dari [Bukair bin Abdullah bin Al Asyajj] dari [Busr bin Sa'id] dari [Ibnu As Sa'idi], ia berkata; saya pernah ditunjuk Umar untuk mengurusi zakat, lalu tatkala saya telah selesai darinya dan menyampaikannya kepadanya, ia memerintahkan agar saya diberi uang, maka saya katakan; sesungguhnya saya bekerja hanya untuk Allah Azza wa Jalla, dan pahalaku di sisi Allah 'azza wajalla. Kemudian ia berkata; ambillah apa yang telah diberikan kepadamu, karena sesungguhnya saya telah bekerja pada masa? Rasulullah shallallahu 'alaihi wasallam kemudian beliau memberiku uang lalu aku katakan seperti apa yang telah engkau katakan, kemudian beliau berkata kepadaku: \"Apabila engkau diberi sesuatu dengan tanpa meminta maka makan dan sedekahkan.\""
            },
            {
                "number": 1353,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَهُوَ عَلَى الْمِنْبَرِ وَهُوَ يَذْكُرُ الصَّدَقَةَ وَالتَّعَفُّفَ مِنْهَا وَالْمَسْأَلَةَ الْيَدُ الْعُلْيَا خَيْرٌ مِنْ الْيَدِ السُّفْلَى وَالْيَدُ الْعُلْيَا الْمُنْفِقَةُ وَالسُّفْلَى السَّائِلَةُقَالَ أَبُو دَاوُد اخْتُلِفَ عَلَى أَيُّوبَ عَنْ نَافِعٍ فِي هَذَا الْحَدِيثِ قَالَ عَبْدُ الْوَارِثِ الْيَدُ الْعُلْيَا الْمُتَعَفِّفَةُ و قَالَ أَكْثَرُهُمْ عَنْ حَمَّادِ بْنِ زَيْدٍ عَنْ أَيُّوبَ الْيَدُ الْعُلْيَا الْمُنْفِقَةُ و قَالَ وَاحِدٌ عَنْ حَمَّادٍ الْمُتَعَفِّفَةُ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah] dari [Malik], dari [Nafi'] dari [Abdullah bin Umar], bahwa Rasulullah shallAllahu wa'alaihi wa sallam di atas mimbar bersabda dan beliau menyebutkan mengenai sedekah, menahan diri darinya, serta mengenai sikap meminta-minta: \"Tangan yang di atas lebih baik daripada tangan yang di bawah. Tangan yang di atas adalah yang berinfak, sedangkan tangan yang di bawah adalah yang meminta-minta.\" Abu Daud berkata; telah diperselisihkan pada Ayyub dari Nafi' dalam hadits ini. [Abdul Warits] mengatakan; tangan di atas adalah yang menahan diri (dari meminta-minta). [Kebanyakan mereka] mengatakan; dari [Hammad bin Zaid] dari [Ayyub]; tangan yang di atas adalah yang berinfak. [salah seorang dari mereka] mengatakan dari [Hammad]; yaitu yang menahan diri (dari meminta-minta). "
            },
            {
                "number": 1354,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ التَّيْمِيُّ حَدَّثَنِي أَبُو الزَّعْرَاءِ عَنْ أَبِي الْأَحْوَصِ عَنْ أَبِيهِ مَالِكِ بْنِ نَضْلَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَيْدِي ثَلَاثَةٌ فَيَدُ اللَّهِ الْعُلْيَا وَيَدُ الْمُعْطِي الَّتِي تَلِيهَا وَيَدُ السَّائِلِ السُّفْلَى فَأَعْطِ الْفَضْلَ وَلَا تَعْجِزْ عَنْ نَفْسِكَ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Hanbal], telah menceritakan kepada Kami ['Ubaidah bin Humaid At Taimi], telah menceritakan kepadaku [Abu Az Za'ra`] dari [Abu Al Ahwash] dari [ayahnya yaitu Malik bin Nadhlah], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Tangan ada tiga macam, tangan Allah yang Maha Tinggi, tangan orang yang memberi setelah tangan Allah, dan tangan orang yang meminta yaitu tangan yang di bawah. Maka berikan harta dan jangan lemah untuk menafkahi dirimu.\""
            },
            {
                "number": 1355,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ ابْنِ أَبِي رَافِعٍ عَنْ أَبِي رَافِعٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ رَجُلًا عَلَى الصَّدَقَةِ مِنْ بَنِي مَخْزُومٍ فَقَالَ لِأَبِي رَافِعٍ اصْحَبْنِي فَإِنَّكَ تُصِيبُ مِنْهَا قَالَ حَتَّى آتِيَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْأَلَهُ فَأَتَاهُ فَسَأَلَهُ فَقَالَ مَوْلَى الْقَوْمِ مِنْ أَنْفُسِهِمْ وَإِنَّا لَا تَحِلُّ لَنَا الصَّدَقَةُ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Katsir] telah mengabarkan kepada Kami [Syu'bah] dari [Al Hakam] dari [Ibnu Abu Rafi'] dari [Abu Rafi'] bahwa Nabi shallallahu 'alaihi wasallam mengutus seorang laki-laki aga mengambil zakat dari Bani Makhzum, kemudian ia berkata kepada Abu Rafi'; temani aku, sesungguhnya engkau akan memperoleh sebagian darinya. Ia berkata; hingga aku datang kepada Nabi shallallahu 'alaihi wasallam dan meminta kepada beliau. Kemudian ia datang kepada Nabi shallallahu 'alaihi wasallam dan meminta kepadanya, lalu beliau bersabda: \"Mantan budak sebuah kaum adalah bagian dari mereka, dan sesungguhnya tidak halal zakat bagi Kami.\""
            },
            {
                "number": 1356,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ الْمَعْنَى قَالَا حَدَّثَنَا حَمَّادٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَمُرُّ بِالتَّمْرَةِ الْعَائِرَةِ فَمَا يَمْنَعُهُ مِنْ أَخْذِهَا إِلَّا مَخَافَةَ أَنْ تَكُونَ صَدَقَةً",
                "id": "Telah menceritakan kepada Kami [Musa bin Isma'il], serta [Muslim bin Ibrahim] secara makna, mereka berkata; telah menceritakan kepada Kami [Hammad] dari [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam pernah melewati sebuah kurma yang terjatuh, dan tidak ada yang menghalangi beliau untuk mengambilnya kecuali khawatir merupakan kurma zakat. "
            },
            {
                "number": 1357,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا أَبِي عَنْ خَالِدِ بْنِ قَيْسٍ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَدَ تَمْرَةً فَقَالَ لَوْلَا أَنِّي أَخَافُ أَنْ تَكُونَ صَدَقَةً لَأَكَلْتُهَاقَالَ أَبُو دَاوُد رَوَاهُ هِشَامٌ عَنْ قَتَادَةَ هَكَذَا",
                "id": "Telah menceritakan kepada Kami [Nashr bin Ali], telah mengabarkan kepada Kami [ayahku] dari [Khalid bin Qais] dari [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam mendapatkan sebuah kurma kemudian berkata; seandainya aku tidak khawatir kurma tersebut merupakan kurma zakat niscaya aku memakannya. Abu Daud berkata; [Hisyam] meriwayatkannya dari [Qatadah] seperti ini. "
            },
            {
                "number": 1358,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْمُحَارِبِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ الْأَعْمَشِ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ قَالَبَعَثَنِي أَبِي إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِبِلٍ أَعْطَاهَا إِيَّاهُ مِنْ الصَّدَقَةِحَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا مُحَمَّدٌ هُوَ ابْنُ أَبِي عُبَيْدَةَ عَنْ أَبِيهِ عَنْ الْأَعْمَشِ عَنْ سَالِمٍ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ نَحْوَهُ زَادَ أَبِي يُبَدِّلُهَا لَهُ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin 'Ubaid Al Muharibi], telah menceritakan kepada Kami [Muhammad bin Fudhail] dari [Al A'masy] dari [Habib bin Abu Tsabit], dari [Kuraib] mantan budak Ibnu Abbas, ia berkata; ayahku mengutusku pergi kepada Nabi shalla Allahu 'alaihi wa sallam membawa unta shadaqah yang diberikan kepadanya. Telah menceritakan kepada Kami [Muhammad bin Al Ala`] dan [Utsman bin Abu Syaibah], mereka berkata; telah menceritakan kepada Kami [Muhammad bin Abu 'Ubaidah] dari [ayahnya] dari [Al A'masy] dari [Salim] dari [Kuraib] mantan budak Ibnu Abbas dari [Ibnu Abbas] seperti hadits tersebut, ia menambahkan \"ayahku menggantinya untuk beliau\". "
            },
            {
                "number": 1359,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ قَالَ أَخْبَرَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِلَحْمٍ قَالَ مَا هَذَا قَالُوا شَيْءٌ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ فَقَالَ هُوَ لَهَا صَدَقَةٌ وَلَنَا هَدِيَّةٌ",
                "id": "Telah menceritakan kepada Kami ['Amr bin Marzuq], ia berkata; telah mengabarkan kepada Kami [Syu'bah] dari [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam diberi daging, beliau mengatakan; apakah ini? Mereka berkata; sesuatu yang disedekahkan kepada Barirah. Kemudian beliau bersabda: \"Sesuatu tersebut adalah sedekah baginya dan hadiah bagi kita.\""
            },
            {
                "number": 1360,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ بُرَيْدَةَأَنَّ امْرَأَةً أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ كُنْتُ تَصَدَّقْتُ عَلَى أُمِّي بِوَلِيدَةٍ وَإِنَّهَا مَاتَتْ وَتَرَكَتْ تِلْكَ الْوَلِيدَةَ قَالَ قَدْ وَجَبَ أَجْرُكِ وَرَجَعَتْ إِلَيْكِ فِي الْمِيرَاثِ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Abdullah bin Yunus], telah menceritakan kepada Kami [Zuhair], telah menceritakan kepada Kami [Abdullah bin 'Atha`] dari [Abdullah bin Buraidah] dari [ayahnya yaitu Buraidah] bahwa seorang wanita datang kepada Rasulullah shallAllahu wa'alaihi wa sallam dan berkata; saya bersedekah kepada ibuku dengan seorang budak perempuan. Kemudian ia meninggal dan meninggalkan budak tersebut. Beliau bersabda: \"Telah tetap pahalamu dan budak tersebut kembali kepadamu dalam warisan.\""
            },
            {
                "number": 1361,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَاصِمِ بْنِ أَبِي النَّجُودِ عَنْ شَقِيقٍ عَنْ عَبْدِ اللَّهِ قَالَكُنَّا نَعُدُّ الْمَاعُونَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَوَرَ الدَّلْوِ وَالْقِدْرِ",
                "id": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id], telah menceritakan kepada Kami [Abu 'Awanah], dari ['Ashim bin Abu An Najud] dari [Syaqiq] dari [Abdullah], ia berkata: Kami pada zaman Rasulullah shallla Allahu 'alaihi wa sallam menganggap Al Ma'un adalah ember serta periuk. "
            },
            {
                "number": 1362,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ صَاحِبِ كَنْزٍ لَا يُؤَدِّي حَقَّهُ إِلَّا جَعَلَهُ اللَّهُ يَوْمَ الْقِيَامَةِ يُحْمَى عَلَيْهَا فِي نَارِ جَهَنَّمَ فَتُكْوَى بِهَا جَبْهَتُهُ وَجَنْبُهُ وَظَهْرُهُ حَتَّى يَقْضِيَ اللَّهُ تَعَالَى بَيْنَ عِبَادِهِ فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ مِمَّا تَعُدُّونَ ثُمَّ يَرَى سَبِيلَهُ إِمَّا إِلَى الْجَنَّةِ وَإِمَّا إِلَى النَّارِ وَمَا مِنْ صَاحِبِ غَنَمٍ لَا يُؤَدِّي حَقَّهَا إِلَّا جَاءَتْ يَوْمَ الْقِيَامَةِ أَوْفَرَ مَا كَانَتْ فَيُبْطَحُ لَهَا بِقَاعٍ قَرْقَرٍ فَتَنْطَحُهُ بِقُرُونِهَا وَتَطَؤُهُ بِأَظْلَافِهَا لَيْسَ فِيهَا عَقْصَاءُ وَلَا جَلْحَاءُ كُلَّمَا مَضَتْ أُخْرَاهَا رُدَّتْ عَلَيْهِ أُولَاهَا حَتَّى يَحْكُمَ اللَّهُ بَيْنَ عِبَادِهِ فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ مِمَّا تَعُدُّونَ ثُمَّ يَرَى سَبِيلَهُ إِمَّا إِلَى الْجَنَّةِ وَإِمَّا إِلَى النَّارِ وَمَا مِنْ صَاحِبِ إِبِلٍ لَا يُؤَدِّي حَقَّهَا إِلَّا جَاءَتْ يَوْمَ الْقِيَامَةِ أَوْفَرَ مَا كَانَتْ فَيُبْطَحُ لَهَا بِقَاعٍ قَرْقَرٍ فَتَطَؤُهُ بِأَخْفَافِهَا كُلَّمَا مَضَتْ عَلَيْهِ أُخْرَاهَا رُدَّتْ عَلَيْهِ أُولَاهَا حَتَّى يَحْكُمَ اللَّهُ تَعَالَى بَيْنَ عِبَادِهِ فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ مِمَّا تَعُدُّونَ ثُمَّ يَرَى سَبِيلَهُ إِمَّا إِلَى الْجَنَّةِ وَإِمَّا إِلَى النَّارِحَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ هِشَامِ بْنِ سَعْدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ قَالَ فِي قِصَّةِ الْإِبِلِ بَعْدَ قَوْلِهِ لَا يُؤَدِّي حَقَّهَا قَالَ وَمِنْ حَقِّهَا حَلَبُهَا يَوْمَ وِرْدِهَا حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَبِي عُمَرَ الْغُدَانِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذِهِ الْقِصَّةِ فَقَالَ لَهُ يَعْنِي لِأَبِي هُرَيْرَةَ فَمَا حَقُّ الْإِبِلِ قَالَ تُعْطِي الْكَرِيمَةَ وَتَمْنَحُ الْغَزِيرَةَ وَتُفْقِرُ الظَّهْرَ وَتُطْرِقُ الْفَحْلَ وَتَسْقِي اللَّبَنَ حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ قَالَ قَالَ أَبُو الزُّبَيْرِ سَمِعْتُ عُبَيْدَ بْنَ عُمَيْرٍ قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ مَا حَقُّ الْإِبِلِ فَذَكَرَ نَحْوَهُ زَادَ وَإِعَارَةُ دَلْوِهَا",
                "id": "Telah menceritakan kepada Kami [Musa bin Isma'il], telah menceritakan kepada Kami [Hammad] dari [Suhail bin Abu Shalih], dari [ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Tidaklah pemilik barang simpanan yang tidak menunaikan haknya kecuali Allah menjadikannya pada Hari Kiamat dipanaskan barang simpanan tersebut dalam neraka jahannam, lalu dibakar dengannya dahinya, lambung dan punggungnya, hingga Allah memberikan keputusan diantara para hambaNya pada hari yang kadarnya adalah lima puluh ribu tahun menurut perhitungan kalian, kemudian ia akan melihat jalannya, ke Surga atau ke Neraka. Dan tidaklah pemilik kambing yang tidak menunaikan haknya melainkan kambing tersebut akan datang pada Hari Kiamat lebih banyak daripada dahulunya dan pemiliknya di dudukkan di hadapannya pada tanah terbuka yang datar, kambing tersebut menanduknya dengan tanduknya dan menginjaknya dengan sepatu-sepatunya, tidak ada padanya kambing yang bertanduk bengkok serta yang tidak bertanduk. Setiap kali kambing yang terakhir selesai maka kambing yang pertama dikembalikan lagi, hingga Allah memberikan keputusan diantara para hambaNya pada hari yang kadarnya adalah lima puluh ribu tahun menurut perhitungan kalian. Kemudian ia akan melihat jalannya, ke Surga atau ke Neraka. Dan tidaklah pemilik unta yang tidak menunaikan haknya melainkan unta tersebut akan datang pada Hari Kiamat lebih banyak daripada dahulunya dan orang tersebut didudukkan di hadapannya pada tanah terbuka yang datar, unta tersebut menginjaknya dengan sepatunya. Setiap kali unta yang terakhir selesai maka unta yang pertama dikembalikan kepadanya hingga Allah ta'ala memberikan keputusan diantara para hambaNya pada hari kadarnya adalah lima puluh ribu tahun menurut perhitungan kalian. Kemudian ia akan melihat jalannya, ke Surga atau ke Neraka.\" Telah menceritakan kepada Kami [Ja'far bin Musafir], telah menceritakan kepada Kami [Ibnu Abu Fudaik] dari [Hisyam bin Sa'd] dari [Zaid bin Aslam] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti itu. Ia berkata dalam kisah unta, setelah sabdanya: \"Tidak menunaikan haknya….\" Beliau bersabda: \"Dan diantara haknya adalah memerahnya pada hari kedatangannya ke air.\" Telah menceritakan kepada Kami [Al Hasan bin Ali], telah menceritakan kepada Kami [Yazid bin Harun], telah mengabarkan kepada Kami [Syu'bah] dari [Qatadah] dari [Abu Umar Al Ghudani], dari [Abu Hurairah], ia berkata; saya mendengar Rasulullah shallAllahu wa'alaihi wa sallam seperti kisah ini. Kemudian Abu Umar berkata kepada Abu Hurairah; apakah hak unta? Ia berkata; engkau memberikan yang berharga, memberikan susunya yang deras, meminjamkan untuk dikendarai, mengawinkan pejantan, dan memberi minum susu. Telah menceritakan kepada Kami [Yahya bin Khalaf], telah menceritakan kepada Kami [Abu 'Ashim] dari [Ibnu Juraij], ia berkata; [Abu Az Zubair] berkata; saya mendengar ['Ubaid bin 'Umair] berkata; seorang laki-laki berkata; wahai Rasulullah shallallahu 'alaihi wasallam, apakah hak unta? Kemudian 'Ubaid menyebutkan hadits seperti itu dan menambahkan; \"Dan meminjamkan embernya.\""
            },
            {
                "number": 1363,
                "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى الْحَرَّانِيُّ حَدَّثَنِي مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ عَمِّهِ وَاسِعِ بْنِ حَبَّانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ مِنْ كُلِّ جَادِّ عَشْرَةِ أَوْسُقٍ مِنْ التَّمْرِ بِقِنْوٍ يُعَلَّقُ فِي الْمَسْجِدِ لِلْمَسَاكِينِ",
                "id": "Telah menceritakan kepada Kami [Abdul Aziz bin Yahya Al Harrani], telah menceritakan kepadaku [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Muhammad bin Yahya bin Hibban] dari [pamannya yaitu Wasi' bin Habban] dari [Jabir bin Abdullah] bahwa Nabi shallallahu 'alaihi wasallam memerintahkan dari setiap buah yang berjumlah sepuluh wasaq kurma diambil satu tandan dan digantungkan di masjid untuk orang-orang miskin. "
            },
            {
                "number": 1364,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ وَمُوسَى بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا أَبُو الْأَشْهَبِ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَبَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ إِذْ جَاءَ رَجُلٌ عَلَى نَاقَةٍ لَهُ فَجَعَلَ يُصَرِّفُهَا يَمِينًا وَشِمَالًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ عِنْدَهُ فَضْلُ ظَهْرٍ فَلْيَعُدْ بِهِ عَلَى مَنْ لَا ظَهْرَ لَهُ وَمَنْ كَانَ عِنْدَهُ فَضْلُ زَادٍ فَلْيَعُدْ بِهِ عَلَى مَنْ لَا زَادَ لَهُ حَتَّى ظَنَنَّا أَنَّهُ لَا حَقَّ لِأَحَدٍ مِنَّا فِي الْفَضْلِ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Abdullah Al Khuza'i] dan [Musa bin Isma'il], mereka berkata; telah menceritakan kepada Kami [Abu Al Asyhab] dari [Abu Nadhrah] dari [Abu Sa'id Al Khudri], ia berkata; ketika Kami bersama Rasulullah shallAllahu wa'alaihi wa sallam dalam sebuah safar tiba-tiba terdapat seorang laki-laki yang datang menunggang untanya. Ia memalingkan unta tersebut ke kanan dan ke kiri, kemudian Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barang siapa yang memiliki kelebihan tunggangan maka hendaknya ia memberikan tunggangan kepada orang yang tidak memiliki tunggangan, dan barang siapa yang memiliki kelebihan perbekalan maka hendaknya ia memberikan perbekalan kepada orang yang tidak memiliki perbekalan.\" Hingga Kami menyangka bahwa tidak ada seorangpun diantara Kami terhadap sesuatu yang lebih. "
            },
            {
                "number": 1365,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ يَعْلَى الْمُحَارِبِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا غَيْلَانُ عَنْ جَعْفَرِ بْنِ إِيَاسٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَلَمَّا نَزَلَتْ هَذِهِ الْآيَةُ{ وَالَّذِينَ يَكْنِزُونَ الذَّهَبَ وَالْفِضَّةَ }قَالَ كَبُرَ ذَلِكَ عَلَى الْمُسْلِمِينَ فَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ أَنَا أُفَرِّجُ عَنْكُمْ فَانْطَلَقَ فَقَالَ يَا نَبِيَّ اللَّهِ إِنَّهُ كَبُرَ عَلَى أَصْحَابِكَ هَذِهِ الْآيَةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ لَمْ يَفْرِضْ الزَّكَاةَ إِلَّا لِيُطَيِّبَ مَا بَقِيَ مِنْ أَمْوَالِكُمْ وَإِنَّمَا فَرَضَ الْمَوَارِيثَ لِتَكُونَ لِمَنْ بَعْدَكُمْ فَكَبَّرَ عُمَرُ ثُمَّ قَالَ لَهُ أَلَا أُخْبِرُكَ بِخَيْرِ مَا يَكْنِزُ الْمَرْءُ الْمَرْأَةُ الصَّالِحَةُ إِذَا نَظَرَ إِلَيْهَا سَرَّتْهُ وَإِذَا أَمَرَهَا أَطَاعَتْهُ وَإِذَا غَابَ عَنْهَا حَفِظَتْهُ",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Yahya bin Ya'la Al Muharibi], telah menceritakan kepada Kami [ayahku], telah menceritakan kepada Kami [Ghailan] dari [Ja'far bin Iyas] dari [Mujahid] dari [Ibnu Abbas], ia berkata; tatkala turun ayat: \"Dan orang-orang yang menyimpan emas dan perak…..\" Maka hal tersebut terasa berat atas orang-orang muslim. Kemudian Umar radliallahu 'anhu berkata; aku akan melapangkan hal itu dari kalian. Kemudian ia pergi dan berkata; wahai Rasulullah, sesungguhnya ayat ini telah terasa berat atas orang-orang muslim. Kemudian Rasulullah shallla Allahu 'alaihi wa sallam berkata: \"Sesungguhnya Allah tidak mewajibkan zakat kecuali untuk mensucikan apa yang tersisa dari harta kalian, dan mewajibkan warisan untuk orang-orang yang kalian tinggalkan.\" Maka Umar pun bertakbir, kemudian Rasulullah shallla Allahu 'alaihi wa sallam berkata kepada Umar: \"Maukah aku beritahukan simpanan paling baik yang disimpan oleh seseorang? Yaitu istri yang shalih yang apabila suaminya melihatnya maka ia akan menyenangkannya, dan apabilla ia memerintahkannya, maka diapun mentaatinya, dan kalau suaminya pergi maka dia akan menjaga amanahnya.\""
            },
            {
                "number": 1366,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ حَدَّثَنَا مُصْعَبُ بْنُ مُحَمَّدِ بْنِ شُرَحْبِيلَ حَدَّثَنِي يَعْلَى بْنُ أَبِي يَحْيَى عَنْ فَاطِمَةَ بِنْتِ حُسَيْنٍ عَنْ حُسَيْنِ بْنِ عَلِيٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلسَّائِلِ حَقٌّ وَإِنْ جَاءَ عَلَى فَرَسٍحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا زُهَيْرٌ عَنْ شَيْخٍ قَالَ رَأَيْتُ سُفْيَانَ عِنْدَهُ عَنْ فَاطِمَةَ بِنْتِ حُسَيْنٍ عَنْ أَبِيهَا عَنْ عَلِيٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Katsir], telah mengabarkan kepada Kami [Sufyan], telah menceritakan kepada Kami [Mush'ab bin Muhammad bin Syurahbil], telah menceritakan kepadaku [Ya'la bin Abu Yahya], dari [Fathimah binti Humais], dari [Husain bin Ali], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Orang yang meminta-minta memiliki hak walaupun ia berada di atas kuda.\" Telah menceritakan kepada Kami [Muhammad bin Rafi'], telah menceritakan kepada Kami [Yahya bin Adam], telah menceritakan kepada Kami [Zuhair] dari [seorang laki-laki tua], ia berkata; aku melihat Sufyan di sisinya dari [Fathimah binti Husain] dari [ayahnya] dari [Ali] dari Nabi shallallahu 'alaihi wasallam seperti itu. "
            },
            {
                "number": 1367,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ بُجَيْدٍ عَنْ جَدَّتِهِ أُمِّ بُجَيْدٍ وَكَانَتْ مِمَّنْ بَايَعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهَا قَالَتْ لَهُ يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْكَ إِنَّ الْمِسْكِينَ لَيَقُومُ عَلَى بَابِي فَمَا أَجِدُ لَهُ شَيْئًا أُعْطِيهِ إِيَّاهُ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ لَمْ تَجِدِي لَهُ شَيْئًا تُعْطِينَهُ إِيَّاهُ إِلَّا ظِلْفًا مُحْرَقًا فَادْفَعِيهِ إِلَيْهِ فِي يَدِهِ",
                "id": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id], telah menceritakan kepada Kami [Al Laits] dari [Sa'id bin Abu Sa'id] dari [Abdurrahman bin Bujaid] dari [neneknya yaitu Ummu Bujaid], dan ia adalah diantara orang yang membaiat Rasulullah shallAllahu wa'alaihi wa sallam, bahwa ia berkata kepada beliau; wahai Rasulullah, semoga Allah melimpahkan sholat kepada anda. Sesungguhnya terdapat seorang miskin yang berdiri di depan pintuku, dan aku tidak memiliki sesuatu yang dapat aku berikan kepadanya. Kemudian Rasulullah shallAllahu wa'alaihi wa sallam berkata kepadanya: \"Apabila engkau tidak mendapatkan sesuatu yang dapat engkau berikan kepadanya kecuali kaki kambing yang terbakar, maka berikan kepadanya di tangannya.\""
            },
            {
                "number": 1368,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ أَسْمَاءَ قَالَتْقَدِمَتْ عَلَيَّ أُمِّي رَاغِبَةً فِي عَهْدِ قُرَيْشٍ وَهِيَ رَاغِمَةٌ مُشْرِكَةٌ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أُمِّي قَدِمَتْ عَلَيَّ وَهِيَ رَاغِمَةٌ مُشْرِكَةٌ أَفَأَصِلُهَا قَالَ نَعَمْ فَصِلِي أُمَّكِ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Abu Syu'aib Al Harrani], telah menceritakan kepada Kami [Isa bin Yunus], telah menceritakan kepada Kami [Hisyam bin 'Urwah] dari [ayahnya] dari [Asma`], ia berkata; ibuku datang menemuiku dalam keadaan mengharapkan baktiku, sementara ia membenci keislamanku dan ia adalah wanita musyrik. Lalu aku katakan; wahai Rasulullah, sesungguhnya ibuku datang menemuiku dalam keadaan mengharapkan baktiku, sementara ia membenci keislamanku dan ia adalah wanita musyrik. Apakah aku boleh berhubungan dengannya? Beliau berkata: \"Ya, hubungilah ibumu.\""
            },
            {
                "number": 1369,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا كَهْمَسٌ عَنْ سَيَّارِ بْنِ مَنْظُورٍ رَجُلٌ مِنْ بَنِي فَزَارَةَ عَنْ أَبِيهِ عَنْ امْرَأَةٍ يُقَالُ لَهَا بُهَيْسَةُ عَنْ أَبِيهَا قَالَتْاسْتَأْذَنَ أَبِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَخَلَ بَيْنَهُ وَبَيْنَ قَمِيصِهِ فَجَعَلَ يُقَبِّلُ وَيَلْتَزِمُ ثُمَّ قَالَ يَا رَسُولَ اللَّهِ مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ قَالَ الْمَاءُ قَالَ يَا نَبِيَّ اللَّهِ مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ قَالَ الْمِلْحُ قَالَ يَا رَسُولَ اللَّهِ مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ قَالَ أَنْ تَفْعَلَ الْخَيْرَ خَيْرٌ لَكَ",
                "id": "Telah menceritakan kepada Kami ['ubaidhullah bin Mu'adz], telah menceritakan kepada Kami [ayahku], telah menceritakan kepada Kami [Kahmas] dari [Sayyar bin Manzhur] yaitu seorang laki-laki dari Bani Fazarah, dari [ayahnya], dari seorang wanita yang dipanggil [Buhaisah] dari [ayahnya], ia berkata; ayahku meminta izin kepada Nabi shallallahu 'alaihi wasallam, kemudian ia memasuki jubah beliau dan mencium beliau dan terus menyertai beliau. Kemudian berkata; wahai Rasulullah, sesuatu apakah yang tidak boleh untuk dihalangi? Beliau bersabda: \"Air.\" Ia berkata; wahai Rasulullah, sesuatu apakah yang tidak boleh untuk dihalangi? Beliau bersabda: \"Garam.\" Ia berkata; wahai Rasulullah, sesuatu apakah yang tidak boleh untuk dihalangi? Beliau bersabda: \"Engkau melakukan kebaikan adalah lebih baik bagimu.\""
            },
            {
                "number": 1370,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ آدَمَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ السَّهْمِيُّ حَدَّثَنَا مُبَارَكُ بْنُ فَضَالَةَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ مِنْكُمْ أَحَدٌ أَطْعَمَ الْيَوْمَ مِسْكِينًا فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ دَخَلْتُ الْمَسْجِدَ فَإِذَا أَنَا بِسَائِلٍ يَسْأَلُ فَوَجَدْتُ كِسْرَةَ خُبْزٍ فِي يَدِ عَبْدِ الرَّحْمَنِ فَأَخَذْتُهَا مِنْهُ فَدَفَعْتُهَا إِلَيْهِ",
                "id": "Telah menceritakan kepada Kami [Bisyr bin Adam], telah menceritakan kepada Kami [Abdullah bin Bakr As Sahmi], telah menceritakan kepada Kami [Mubarak bin Fadhalah] dari [Tsabit Al Bunani] dari [Abdurrahman bin Abu Laila] dari [Abdurrahman bin Abu Bakr], ia berkata: Rasulullah shallallahu 'alaihi wasallam bertanya: \"Apakah diantara kalian pada hari ini ada orang yang telah memberi makan seorang miskin?\" Abu Bakr radliallahu 'anhu menjawab; saya masuk masjid, dan ternyata saya mendapati seorang miskin yang sedang meminta-minta dan aku dapati sepotong roti ditangan Abdurrahman, maka aku mengambilnya dan aku berikan kepada orang miskin tersebut. "
            },
            {
                "number": 1371,
                "arab": "حَدَّثَنَا أَبُو الْعَبَّاسِ الْقِلَّوْرِيُّ حَدَّثَنَا يَعْقُوبُ بْنُ إِسْحَقَ الْحَضْرَمِيُّ عَنْ سُلَيْمَانَ بْنِ مُعَاذٍ التَّمِيمِيِّ حَدَّثَنَا ابْنُ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُسْأَلُ بِوَجْهِ اللَّهِ إِلَّا الْجَنَّةُ",
                "id": "Telah menceritakan kepada Kami [Abu Al 'Abbas Al Qillauri], telah menceritakan kepada Kami [Ya'qub bin Ishaq Al Hadhrami] dari [Sulaiman bin Mu'adz At Taimi], telah menceritakan kepada Kami [Ibnu Al Munkadir] dari [Jabir], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Tidak boleh ada sesuatu yang diminta dengan wajah Allah kecuali Surga.\""
            },
            {
                "number": 1372,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ مُجَاهِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اسْتَعَاذَ بِاللَّهِ فَأَعِيذُوهُ وَمَنْ سَأَلَ بِاللَّهِ فَأَعْطُوهُ وَمَنْ دَعَاكُمْ فَأَجِيبُوهُ وَمَنْ صَنَعَ إِلَيْكُمْ مَعْرُوفًا فَكَافِئُوهُ فَإِنْ لَمْ تَجِدُوا مَا تُكَافِئُونَهُ فَادْعُوا لَهُ حَتَّى تَرَوْا أَنَّكُمْ قَدْ كَافَأْتُمُوهُ",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Jarir] dari [Al A'masy] dari [Mujahid] dari [Abdullah bin Umar], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barang siapa yang berlindung dengan nama Allah, maka lindungilah dia, barang siapa yang meminta-minta dengan nama Allah maka berikanlah kepadanya, barang siapa yang mengundang kalian maka penuhilah undangannya, dan barang siapa yang berbuat kebaikan kepada kalian maka balaslah, kemudian apabila kalian tidak mendapat sesuatu untuk membalasnya maka doakanlah dia hingga kalian melihat bahwa kalian telah membalasnya.\""
            },
            {
                "number": 1373,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ عَنْ مَحْمُودِ بْنِ لَبِيدٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّ قَالَكُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَهُ رَجُلٌ بِمِثْلِ بَيْضَةٍ مِنْ ذَهَبٍ فَقَالَ يَا رَسُولَ اللَّهِ أَصَبْتُ هَذِهِ مِنْ مَعْدِنٍ فَخُذْهَا فَهِيَ صَدَقَةٌ مَا أَمْلِكُ غَيْرَهَا فَأَعْرَضَ عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ أَتَاهُ مِنْ قِبَلِ رُكْنِهِ الْأَيْمَنِ فَقَالَ مِثْلَ ذَلِكَ فَأَعْرَضَ عَنْهُ ثُمَّ أَتَاهُ مِنْ قِبَلِ رُكْنِهِ الْأَيْسَرِ فَأَعْرَضَ عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ أَتَاهُ مِنْ خَلْفِهِ فَأَخَذَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَذَفَهُ بِهَا فَلَوْ أَصَابَتْهُ لَأَوْجَعَتْهُ أَوْ لَعَقَرَتْهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْتِي أَحَدُكُمْ بِمَا يَمْلِكُ فَيَقُولُ هَذِهِ صَدَقَةٌ ثُمَّ يَقْعُدُ يَسْتَكِفُّ النَّاسَ خَيْرُ الصَّدَقَةِ مَا كَانَ عَنْ ظَهْرِ غِنًىحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ ابْنِ إِسْحَقَ بِإِسْنَادِهِ وَمَعْنَاهُ زَادَ خُذْ عَنَّا مَالَكَ لَا حَاجَةَ لَنَا بِهِ",
                "id": "Telah menceritakan kepada Kami [Musa bin Isma'il], telah menceritakan kepada Kami [Hammad] dari [Muhammad bin Ishaq], dari ['Ashim bin Umar bin Qatadah] dari [Mahmud bin Labid] dari [Jabir bin Abdullah Al Anshari], ia berkata; Kami pernah bersama Rasulullah shallAllahu wa'alaihi wa sallam, tiba-tiba terdapat seorang laki-laki yang datang membawa emas seperti telur, kemudian ia berkata; wahai Rasulullah, aku mendapatkan ini dari sebagian barang tambang, ambillah, itu adalah sedekah, aku tidak memiliki harta selainnya. Lalu Rasulullah shallAllahu wa'alaihi wa sallam berpaling darinya, kemudian ia datang dari sisi kanan beliau, dan berkata seperti itu, kemudian datang dari kiri beliau dan Rasulullah shallAllahu wa'alaihi wa sallam berpaling darinya, kemudian datang dari belakangnya, lalu Rasulullah shallAllahu wa'alaihi wa sallam mengambilnya dan melempar dengannya, apabila mengenainya niscaya akan menyakitinya atau melukainya. Kemudian Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Salah seorang diantara kalian datang membawa harta yang ia miliki, dan berkata; ini adalah sedekah, kemudian ia duduk dan meminta-minta kepada orang. Sebaik-baik sedekah adalah dalam keadaan lebih.\" Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Ibnu Idris], dari [Ibnu Ishaq] dengan sanad serta maknanya, dan ia menambahkan kata: \"Ambillah milikmu, Kami tidak membutuhkannya.\""
            },
            {
                "number": 1374,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ عَجْلَانَ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدٍ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُدَخَلَ رَجُلٌ الْمَسْجِدَ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَطْرَحُوا ثِيَابًا فَطَرَحُوا فَأَمَرَ لَهُ بِثَوْبَيْنِ ثُمَّ حَثَّ عَلَى الصَّدَقَةِ فَجَاءَ فَطَرَحَ أَحَدَ الثَّوْبَيْنِ فَصَاحَ بِهِ وَقَالَ خُذْ ثَوْبَكَ",
                "id": "Telah menceritakan kepada Kami [Ishaq bin Isma'il], telah menceritakan kepada Kami [Sufyan] dari [Ibnu 'Ajlan], dari ['Iyadh bin Abdullah bin Sa'd], ia mendengar [Abu Sa'id Al Khudri], berkata; seorang laki-laki masuk masjid, kemudian Nabi shalla Allahu 'alaihi wa sallam memerintahkan mereka untuk menanggalkan baju mereka, dan mereka pun mensedekahkan pakaian, kemudian mereka melemparkan beberapa pakaian. Lalu beliau memerintahkan agar orang tersebut diberi dua pakaian. Kemudian beliau menganjurkan untuk bersedekah, lalu orang-orang tersebut datang dan melemparkan salah satu pakaian tersebut. Kemudian beliau menteriakinya dan berkata: \"Ambillah pakaianmu!\""
            },
            {
                "number": 1375,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ خَيْرَ الصَّدَقَةِ مَا تَرَكَ غِنًى أَوْ تُصُدِّقَ بِهِ عَنْ ظَهْرِ غِنًى وَابْدَأْ بِمَنْ تَعُولُ",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Jarir] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Sesungguhnya sebaik-baik sedekah adalah sedekah yang masih meninggalkan kecukupan (bagi yang bersedekah), atau yang disedekahkan dalam kondisi kecukupan. Dan mulailah dengan orang yang engkau tanggung.\""
            },
            {
                "number": 1376,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَيَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ الرَّمْلِيُّ قَالَا حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ يَحْيَى بْنِ جَعْدَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَيَا رَسُولَ اللَّهِ أَيُّ الصَّدَقَةِ أَفْضَلُ قَالَ جُهْدُ الْمُقِلِّ وَابْدَأْ بِمَنْ تَعُولُ",
                "id": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id], serta [Yazid bin Khalid bin Mauhib Ar Ramli], mereka berkata; telah menceritakan kepada Kami [Al Laits] dari [Abu Az Zubair] dari [Yahya bin Ja'dah] dari [Abu Hurairah] bahwa ia berkata; wahai Rasulullah, sedekah apakah yang lebih utama? Beliau bersabda: \"Kadar yang mampu ditanggung orang fakir, dan mulailah dari orang yang engkau tanggung.\""
            },
            {
                "number": 1377,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ وَهَذَا حَدِيثُهُ قَالَا حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ يَقُولُأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا أَنْ نَتَصَدَّقَ فَوَافَقَ ذَلِكَ مَالًا عِنْدِي فَقُلْتُ الْيَوْمَ أَسْبِقُ أَبَا بَكْرٍ إِنْ سَبَقْتُهُ يَوْمًا فَجِئْتُ بِنِصْفِ مَالِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَبْقَيْتَ لِأَهْلِكَ قُلْتُ مِثْلَهُ قَالَ وَأَتَى أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ بِكُلِّ مَا عِنْدَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَبْقَيْتَ لِأَهْلِكَ قَالَ أَبْقَيْتُ لَهُمْ اللَّهَ وَرَسُولَهُ قُلْتُ لَا أُسَابِقُكَ إِلَى شَيْءٍ أَبَدًا",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Shalih] serta [Utsman bin Abu Syaibah bin Abu Syaibah], dan ini adalah haditsnya, mereka berkata; telah menceritakan kepada Kami [Al Fadhl bin Dukain], telah menceritakan kepada Kami [Hisyam bin Sa'd] dari [Zaid bin Aslam] dari [ayahnya], ia berkata: aku mendengar [Umar bin Al Khathab radliallahu 'anhu] berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan Kami agar bersedekah, dan hal tersebut bertepatan dengan keberadaan harta yang saya miliki. Lalu saya mengatakan; apabila aku dapat mendahului Abu Bakr pada suatu hari maka hari ini aku akan mendahuluinya. Kemudian saya datang dengan membawa setengah hartaku, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah yang engkau tinggalkan untuk keluargamu?\" Saya katakan; harta yang sama seperti itu. Ia berkata; kemudian Abu Bakar datang dengan membawa seluruh yang ia miliki. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Abu Bakr, apakah yang engkau tinggalkan untuk keluargamu?\" Ia berkata; saya tinggalkan untuk mereka Allah dan RasulullahNya. Maka saya katakan; saya tidak akan dapat mendahuluimu kepada sesuatupun selamanya. "
            },
            {
                "number": 1378,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ سَعِيدٍ أَنَّسَعْدًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَيُّ الصَّدَقَةِ أَعْجَبُ إِلَيْكَ قَالَ الْمَاءُحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ وَالْحَسَنِ عَنْ سَعْدِ بْنِ عُبَادَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Katsir], telah mengabarkan kepada Kami [Hammam] dari [Qatadah] dari [Sa'id] bahwa [Sa'd] datang kepada Nabi shalla Allahu 'alaihi wa sallam lalu bertanya; shadaqah apa yang lebih anda sukai? Beliau menjawab: \"Air!\" Telah berkata kepada Kami [Muhammad bin Abdurrahim], telah berkata kepada Kami [Muhammad bin Ararah] dari [Syu'bah] dari [Qatadah] dari [Sa'id bin Musayyab] dan [Al Hasan] dari [Sa'd bin 'Ubadah] dari Nabi shalla Allahu 'alaihi wa sallam sama seperti itu. "
            },
            {
                "number": 1379,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ رَجُلٍ عَنْ سَعْدِ بْنِ عُبَادَةَ أَنَّهُ قَالَيَا رَسُولَ اللَّهِ إِنَّ أُمَّ سَعْدٍ مَاتَتْ فَأَيُّ الصَّدَقَةِ أَفْضَلُ قَالَ الْمَاءُقَالَ فَحَفَرَ بِئْرًا وَقَالَ هَذِهِ لِأُمِّ سَعْدٍ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Katsir], telah mengabarkan kepada Kami [Israil], [Abu Ishaq] dari seorang [laki-laki], dari [Sa'd bin 'Ubadah], bahwa ia berkata; wahai Rasulullah, sesungguhnya ibuku yaitu Ummu Sa'd telah meninggal, maka sedekah apakah yang paling utama? Beliau bersabda: \"Air.\" Orang tersebut mengatakan; kemudian Sa'd menggali sebuah sumur dan mengatakan; ini adalah untuk Ummu Sa'd. "
            },
            {
                "number": 1380,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ إِبْرَاهِيمَ بْنِ إِشْكَابَ حَدَّثَنَا أَبُو بَدْرٍ حَدَّثَنَا أَبُو خَالِدٍ الَّذِي كَانَ يَنْزِلُ فِي بَنِي دَالَانَ عَنْ نُبَيْحٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا مُسْلِمٍ كَسَا مُسْلِمًا ثَوْبًا عَلَى عُرْيٍ كَسَاهُ اللَّهُ مِنْ خُضْرِ الْجَنَّةِ وَأَيُّمَا مُسْلِمٍ أَطْعَمَ مُسْلِمًا عَلَى جُوعٍ أَطْعَمَهُ اللَّهُ مِنْ ثِمَارِ الْجَنَّةِ وَأَيُّمَا مُسْلِمٍ سَقَى مُسْلِمًا عَلَى ظَمَإٍ سَقَاهُ اللَّهُ مِنْ الرَّحِيقِ الْمَخْتُومِ",
                "id": "Telah menceritakan kepada Kami [Ali bin Al Husain bin Ibrahim bin Isykab], telah menceritakan kepada Kami [Abu Badr], telah menceritakan kepada Kami [Abu Khalid] yang pernah singgah di Bani Dalan, dari [Nubaih] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Siapapun seorang muslim yang memakaikan pakaian kepada muslim yang lainnya karena ia tidak berpakaian maka Allah akan memakaikan kepadanya pakaian dari pakaian yang hijau di Surga, dan siapapun seorang muslim yang memberikan makan kepada muslim lainnya yang dalam keadaan lapar maka Allah memberinya makanan dari buah-buahan di Surga, dan siapapun seorang muslim yang memberi minum muslim lainnya yang dalam keadaan haus maka Allah akan memberinya minum dari Ar Rahiq Al Makhtum (arak Surga).\""
            },
            {
                "number": 1381,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى قَالَ أَخْبَرَنَا إِسْرَائِيلُ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عِيسَى وَهَذَا حَدِيثُ مُسَدَّدٍ وَهُوَ أَتَمُّ عَنْ الْأَوْزَاعِيِّ عَنْ حَسَّانَ بْنِ عَطِيَّةَ عَنْ أَبِي كَبْشَةَ السَّلُولِيِّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعُونَ خَصْلَةً أَعْلَاهُنَّ مَنِيحَةُ الْعَنْزِ مَا يَعْمَلُ رَجُلٌ بِخَصْلَةٍ مِنْهَا رَجَاءَ ثَوَابِهَا وَتَصْدِيقَ مَوْعُودِهَا إِلَّا أَدْخَلَهُ اللَّهُ بِهَا الْجَنَّةَ قَالَ أَبُو دَاوُد فِي حَدِيثِ مُسَدَّدٍ قَالَ حَسَّانُ فَعَدَدْنَا مَا دُونَ مَنِيحَةِ الْعَنْزِ مِنْ رَدِّ السَّلَامِ وَتَشْمِيتِ الْعَاطِسِ وَإِمَاطَةِ الْأَذَى عَنْ الطَّرِيقِ وَنَحْوَهُ فَمَا اسْتَطَعْنَا أَنْ نَبْلُغَ خَمْسَةَ عَشَرَ خَصْلَةً",
                "id": "Telah menceritakan kepada Kami [Ibrahim bin Musa], ia berkata; telah mengabarkan kepada Kami [Israil], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Isa], dan ini adalah haditsnya Musaddad, dan ia lebih sempurna, dari [Al Auza'i], dari [Hassan bin 'Athiyyah], dari [Abu Kabsyah As Saluli], ia berkata; saya mendengar [Abdullah bin 'Amr] berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Terdapat empat puluh sifat, paling tinggi adalah memberikan kambing betina untuk diambil manfaat susu dan bulunya. Tidaklah seseorang melakukan salah satu sifat dari sifat-sifat tersebut karena mengharap pahalanya dan membenarkan apa yang dijanjikan kecuali dengannya Allah akan memasukkannya ke dalam Surga.\" Abu Daud dalam hadits Musaddad berkata; Hassan berkata; kemudian Kami menghitung selain memberikan kambing betina untuk diambil manfaat susu dan bulunya yaitu; membalas salam, menjawab orang yang bersin, menyingkirkan gangguan dari jalan, dan yang semisalnya. Dan Kami tidak mampu mencapai lima belas sifat. "
            },
            {
                "number": 1382,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلَاءِ الْمَعْنَى وَاحِدٌ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْخَازِنَ الْأَمِينَ الَّذِي يُعْطِي مَا أُمِرَ بِهِ كَامِلًا مُوَفَّرًا طَيِّبَةً بِهِ نَفْسُهُ حَتَّى يَدْفَعَهُ إِلَى الَّذِي أُمِرَ لَهُ بِهِ أَحَدُ الْمُتَصَدِّقَيْنِ",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah] dan [Muhammad bin Al 'Ala`], dan maknanya satu, mereka berkata; telah menceritakan kepada Kami [Abu Usamah] dari [Buraid bin Abdullah bin Abu Burdah] dari [Abu Burdah] dari [Abu Musa], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Sesungguhnya bendahara yang dapat dipercaya adalah orang yang memberikan apa yang diperintahkan kepadanya secara sempurna, dan hatinya merasa rela hingga ia menyerahkannya kepada orang yang diperintahkan untuk diberi oleh salah seorang dari para pemberi sedekah.\""
            },
            {
                "number": 1383,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مَنْصُورٍ عَنْ شَقِيقٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَنْفَقَتْ الْمَرْأَةُ مِنْ بَيْتِ زَوْجِهَا غَيْرَ مُفْسِدَةٍ كَانَ لَهَا أَجْرُ مَا أَنْفَقَتْ وَلِزَوْجِهَا أَجْرُ مَا اكْتَسَبَ وَلِخَازِنِهِ مِثْلُ ذَلِكَ لَا يَنْقُصُ بَعْضُهُمْ أَجْرَ بَعْضٍ",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Abu 'Awanah] dari [Manshur] dari [Syaqiq] dari [Masruq] dari [Aisyah] radliallahu 'anha, ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila seorang wanita berinfak dari harta suaminya tanpa membuat kerusakan maka baginya pahala apa yang telah ia infakkan, dan bagi suaminya pahala apa yang ia usahakan, dan bagi orang menyimpannya mendapatkan pahala seperti itu tanpa sebagian mereka mengurangi pahala sebagian yang lain.\""
            },
            {
                "number": 1384,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَوَّارٍ الْمِصْرِيِّ حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ عَنْ يُونُسَ بْنِ عُبَيْدٍ عَنْ زِيَادِ بْنِ جُبَيْرِ بْنِ حَيَّةَ عَنْ سَعْدٍ قَالَلَمَّا بَايَعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النِّسَاءُ قَامَتْ امْرَأَةٌ جَلِيلَةٌ كَأَنَّهَا مِنْ نِسَاءِ مُضَرَ فَقَالَتْ يَا نَبِيَّ اللَّهِ إِنَّا كَلٌّ عَلَى آبَائِنَا وَأَبْنَائِنَاقَالَ أَبُو دَاوُد وَأُرَى فِيهِ وَأَزْوَاجِنَا فَمَا يَحِلُّ لَنَا مِنْ أَمْوَالِهِمْ فَقَالَ الرَّطْبُ تَأْكُلْنَهُ وَتُهْدِينَهُ قَالَ أَبُو دَاوُد الرَّطْبُ الْخُبْزُ وَالْبَقْلُ وَالرُّطَبُ قَالَ أَبُو دَاوُد وَكَذَا رَوَاهُ الثَّوْرِيُّ عَنْ يُونُسَ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Sawwar Al Mishri], Telah menceritakan kepada Kami [Abdussalam bin Harb] dari [Yunus bin 'Ubaid] dari [Ziyad bin Jubair bin Hayyah] dari [Sa'd], ia berkata; tatkala para wanita berbaiat kepada Rasulullah shallallahu 'alaihi wasallam, terdapat seorang wanita yang bertubuh besar sepertinya dia termasuk wanita dari kabilah Mudhar, ia berkata; wahai Nabi Allah, sesungguhnya Kami adalah beban bagi bapak-bapak Kami dan anak laki-laki Kami -Abu Daud berkata; aku menganggap ada kata: dan suami Kami- maka apakah yang halal bagi Kami untuk Kami dari harta mereka? Beliau menjawab: makanan basah yang kalian makan dan kalian hadiahkan. Abu Daud berkata; makanan basah adalah roti dan sayur-sayuran serta ruthab, AbuDaud berkata; seperti inilah yang diriwayatkan [Ats Tsauri] dari [Yunus]. "
            },
            {
                "number": 1385,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَنْفَقَتْ الْمَرْأَةُ مِنْ كَسْبِ زَوْجِهَا مِنْ غَيْرِ أَمْرِهِ فَلَهَا نِصْفُ أَجْرِهِ",
                "id": "Telah menceritakan kepada Kami [Al Hasan bin Ali], telah menceritakan kepada Kami [Abdurrazzaq], telah mengabarkan kepada Kami [Ma'mar] dari [Hammam bin Munabbih], ia berkata; saya mendengar [Abu Hurairah] berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Apabila seorang wanita berinfak dari sebagian usaha suaminya tanpa perintahnya maka baginya setengah pahala suaminya.\""
            },
            {
                "number": 1386,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَوَّارٍ الْمِصْرِيُّ حَدَّثَنَا عَبْدَةُ عَنْ عَبْدِ الْمَلِكِ عَنْ عَطَاءٍ عَنْ أَبِي هُرَيْرَةَفِي الْمَرْأَةِ تَصَدَّقُ مِنْ بَيْتِ زَوْجِهَا قَالَ لَا إِلَّا مِنْ قُوتِهَا وَالْأَجْرُ بَيْنَهُمَا وَلَا يَحِلُّ لَهَا أَنْ تَصَدَّقَ مِنْ مَالِ زَوْجِهَا إِلَّا بِإِذْنِهِقَالَ أَبُو دَاوُد هَذَا يُضَعِّفُ حَدِيثَ هَمَّامٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Siwar Al Mishri] telah menceritakan kepada kami [Abdah] dari [Abdul Malik] dari [Atha'] dari [Abu Hurairah] RhadhiyAllahu 'anhu mengenai seorang wanita yang bersedekah dari harta suaminya. Ia berkata: tidak boleh, kecuali dari sebagian bahan pokoknya dan pahalanya dibagi anara keduanya, dan tidak halal bagi seorang istri untuk bersedekah dengan harta suaminya kecuali dengan izinnya. Abu Daud berkata: hadits ini melemahkan hadits Hammam. "
            },
            {
                "number": 1387,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ هُوَ ابْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَلَمَّا نَزَلَتْ{ لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ }قَالَ أَبُو طَلْحَةَ يَا رَسُولَ اللَّهِ أَرَى رَبَّنَا يَسْأَلُنَا مِنْ أَمْوَالِنَا فَإِنِّي أُشْهِدُكَ أَنِّي قَدْ جَعَلْتُ أَرْضِي بِأَرِيحَاءَ لَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْعَلْهَا فِي قَرَابَتِكَ فَقَسَمَهَا بَيْنَ حَسَّانَ بْنِ ثَابِتٍ وَأُبَيِّ بْنِ كَعْبٍقَالَ أَبُو دَاوُد بَلَغَنِي عَنْ الْأَنْصَارِيِّ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ قَالَ أَبُو طَلْحَةَ زَيْدُ بْنُ سَهْلِ بْنِ الْأَسْوَدِ بْنِ حَرَامِ بْنِ عَمْرِو بْنِ زَيْدِ مَنَاةَ بْنِ عَدِيِّ بْنِ عَمْرِو بْنِ مَالِكِ بْنِ النَّجَّارِ وَحَسَّانُ بْنُ ثَابِتِ بْنِ الْمُنْذِرِ بْنِ حَرَامٍ يَجْتَمِعَانِ إِلَى حَرَامٍ وَهُوَ الْأَبُ الثَّالِثُ وَأُبَيُّ بْنُ كَعْبِ بْنِ قَيْسِ بْنِ عَتِيكِ بْنِ زَيْدِ بْنِ مُعَاوِيَةَ بْنِ عَمْرِو بْنِ مَالِكِ بْنِ النَّجَّارِ فَعَمْرٌو يَجْمَعُ حَسَّانَ وَأَبَا طَلْحَةَ وَأُبَيًّا قَالَ الْأَنْصَارِيُّ بَيْنَ أُبَيٍّ وَأَبِي طَلْحَةَ سِتَّةُ آبَاءٍ",
                "id": "Telah menceritakan kepada Kami [Musa bin Isma'il], telah menceritakan kepada Kami [Hammad yaitu Ibnu Salamah] dari [Tsabit] dari [Anas], ia berkata; tatkala turun ayat: \"Kamu sekali-kali tidak sampai kepada kebajikan (yang sempurna), sebelum kamu menafkahkan sehahagian harta yang kamu cintai.\" Abu Thalhah berkata; wahai Rasulullah, aku melihat Tuhan kita meminta sebagian harta kita, aku meminta persaksianmu bahwa aku telah menjadikan tanahku yang berada di Ariha` untuk Allah. Kemudian Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Berikanlah tanah tersebut untuk para kerabatmu!\" Kemudian ia membaginya diantara Hassan bin Tsabit dan Ubai bin Ka'b. Abu Daud berkata; telah sampai kepadaku dari seorang anshar yaitu Muhammad bin Abdullah, ia berkata; Abu Thalhah Zaid bin Sahl bin Al Aswad bin Haram bin 'Amr bin Zaid Manah bin 'Adi bin 'Amr bin Malik bin An Najjar, serta Hassan bin Tsabit bin Al Mundzir bin Haram bertemu nasabnya di Haram, ia adalah ayah ketiga. Sedangkan Ubai bin Ka'b bin Qais bin 'Atik, bin Zaid bin Mu'awiyah bin 'Amr bin Malik bin An Najjar, maka 'Amr mengumpulkan antara Hassan, Abu Thalhah serta Ubai. Orang Anshar tersebut berkata; antara Abu Thalhah dan Ubai terdapat enam ayah. "
            },
            {
                "number": 1388,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ عَبْدَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكَانَتْ لِي جَارِيَةٌ فَأَعْتَقْتُهَا فَدَخَلَ عَلَيَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ فَقَالَ آجَرَكِ اللَّهُ أَمَا إِنَّكِ لَوْ كُنْتِ أَعْطَيْتِهَا أَخْوَالَكِ كَانَ أَعْظَمَ لِأَجْرِكِ",
                "id": "Telah menceritakan kepada Kami [Hannad bin As Sarri] dari ['Abdah] dari [Muhammad bin Ishaq], dari [Bukair bin Abdullah bin Al Asyajj] dari [Sulaiman bin Yasar] dari [Maimunah] istri Rasulullah shallallahu 'alaihi wasallam, ia berkata; aku pernah mempunyai budak wanita yang telah aku bebaskan. Lalu Nabi shalla Allahu 'alaihi wa sallam masuk menemuiku dan aku memberitahukan hal tersebut kepadanya, lalu beliau berkata: \"Mudah-mudahan Allah memberimu pahala, adapun kalau seandainya kamu berikan budak wanita tersebut kepada paman-pamanmu, maka akan menjadi pahala lebih besar bagimu. "
            },
            {
                "number": 1389,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالصَّدَقَةِ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ عِنْدِي دِينَارٌ فَقَالَ تَصَدَّقْ بِهِ عَلَى نَفْسِكَ قَالَ عِنْدِي آخَرُ قَالَ تَصَدَّقْ بِهِ عَلَى وَلَدِكَ قَالَ عِنْدِي آخَرُ قَالَ تَصَدَّقْ بِهِ عَلَى زَوْجَتِكَ أَوْ قَالَ زَوْجِكَ قَالَ عِنْدِي آخَرُ قَالَ تَصَدَّقْ بِهِ عَلَى خَادِمِكَ قَالَ عِنْدِي آخَرُ قَالَ أَنْتَ أَبْصَرُ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Katsir], telah mengabarkan kepada Kami [Sufyan] dari [Muhammad bin 'Ajlan] dari [Al Maqburi] dari [Abu Hurairah], ia berkata; Nabi shallallahu 'alaihi wasallam memerintahkan untuk bersedekah. Kemudian seorang laki-laki berkata; wahai Rasulullah, aku memiliki uang satu dinar. Kemudian beliau bersabda: \"Sedekahkan kepada dirimu!\" Ia berkata; aku memiliki yang lain. Beliau bersabda: \"Sedekahkan kepada anakmu!\" Ia berkata; aku memiliki yang lain. Beliau bersabda: \"Sedekahkan kepada isterimu!\" Ia berkata; aku memiliki yang lain. Beliau bersabda: \"Sedekahkan kepada pembantumu!\" Ia berkata; aku memiliki yang lain. Beliau bersabda: \"Engkau lebih tahu.\""
            },
            {
                "number": 1390,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ وَهْبِ بْنِ جَابِرٍ الْخَيْوَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَفَى بِالْمَرْءِ إِثْمًا أَنْ يُضَيِّعَ مَنْ يَقُوتُ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Katsir], telah mengabarkan kepada Kami [Sufyan], telah menceritakan kepada Kami [Abu Ishaq] dari [Wahb bin Jabir Al Khaiwani] dari [Abdullah bin 'Amr], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Cukuplah dosa bagi seseorang dengan ia menyia-nyiakan orang yang ia tanggung.\""
            },
            {
                "number": 1391,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٌ وَيَعْقُوبُ بْنُ كَعْبٍ وَهَذَا حَدِيثُهُ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَرَّهُ أَنْ يُبْسَطَ عَلَيْهِ فِي رِزْقِهِ وَيُنْسَأَ فِي أَثَرِهِ فَلْيَصِلْ رَحِمَهُ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Shalih] dan [Ya'qub bin Ka'bin], dan ini adalah haditsnya, mereka berkata; telah menceritakan kepada Kami [Ibnu Wahb], ia berkata; telah mengabarkan kepadaku [Yunus] dari [Az Zuhri] dari [Anas], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barang siapa yang ingin dilapangkan rizqinya dan dipanjangkan umurnya maka hendaknya ia menyambung kekerabatan.\""
            },
            {
                "number": 1392,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَالَ اللَّهُ أَنَا الرَّحْمَنُ وَهِيَ الرَّحِمُ شَقَقْتُ لَهَا اسْمًا مِنْ اسْمِي مَنْ وَصَلَهَا وَصَلْتُهُ وَمَنْ قَطَعَهَا بَتَتُّهُحَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ الْعَسْقَلَانِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ حَدَّثَنِي أَبُو سَلَمَةَ أَنَّ الرَّدَّادَ اللَّيْثِيَّ أَخْبَرَهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ",
                "id": "Telah menceritakan kepada Kami [Musaddad] dan [Abu Bakr bin Abu Syaibah], mereka berkata; telah menceritakan kepada Kami [Sufyan] dari [Az Zuhri] dari [Abu Salamah] dari [Abdurrahman bin 'Auf], ia berkata; saya mendengar Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Allah berfirman: \"Aku adalah Ar Rahman (Yang Maha Pengasih), rahim (kekerabatan) telah aku ambil dari Namaku, barang siapa yang menyambungnya, maka Aku akan menyambung hubungan dengannya, dan barang siapa yang memutuskannya maka Aku akan memutuskan hubungan dengannya sama sekali.\" Telah menceritakan kepada Kami [Muhammad bin Al Mutawakkil Al 'Asqalani], telah menceritakan kepada Kami [Abdurrazzaq], telah mengabarkan kepada Kami [Ma'mar], dari [Az Zuhri], telah menceritakan kepadaku [Abu Salamah] bahwa [Ar Raddad Al Laitsi] telah mengabarkan kepadanya dari [Abdurrahman bin 'Auf] bahwa ia telah mendengar Rasulullah shallAllahu wa'alaihi wa sallam ……dengan makna seperti hadits tersebut. "
            },
            {
                "number": 1393,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدْخُلُ الْجَنَّةَ قَاطِعُ رَحِمٍ",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Sufyan] dari [Az Zuhri] dari [Muhammad bin Jubair bin Muth'im] dari [ayahnya] ia membawanya kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak akan masuk Surga orang yang memutuskan hubungan kekerabatan.\""
            },
            {
                "number": 1394,
                "arab": "حَدَّثَنَا ابْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ الْأَعْمَشِ وَالْحَسَنِ بْنِ عَمْرٍو وَفِطْرٍ عَنْ مُجَاهِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ سُفْيَانُ وَلَمْ يَرْفَعْهُ سُلَيْمَانُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَفَعَهُ فِطْرٌ وَالْحَسَنُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ الْوَاصِلُ بِالْمُكَافِئِ وَلَكِنْ هُوَ الَّذِي إِذَا قُطِعَتْ رَحِمُهُ وَصَلَهَا",
                "id": "Telah menceritakan kepada Kami [Ibnu Katsir], telah mengabarkan kepada Kami [Sufyan] dari [Al A'masy] dan [Al Hasan bin 'Amr], serta [Fithr] dari [Mujahid] dari [Abdullah bin 'Amr], Sufyan berkata; dan Sulaiman tidak menisbatkan perkataan tersebut kepada Nabi shallallahu 'alaihi wasallam sedangkan Fithir serta Al Hasan menisbatkannya kepada beliau. Ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Orang yang menyambung bukanlah orang yang membalas kebaikan orang akan tetapi ia adalah orang yang apabila hubungan kekerabatannya diputuskan maka ia menyambungnya.\""
            },
            {
                "number": 1395,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَخَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِيَّاكُمْ وَالشُّحَّ فَإِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ بِالشُّحِّ أَمَرَهُمْ بِالْبُخْلِ فَبَخِلُوا وَأَمَرَهُمْ بِالْقَطِيعَةِ فَقَطَعُوا وَأَمَرَهُمْ بِالْفُجُورِ فَفَجَرُوا",
                "id": "Telah menceritakan kepada Kami [Hafsh bin Umar], telah menceritakan kepada Kami [Syu'bah] dari ['Amr bin Murrah], dari [Abdullah bin Al Harits] dari [Abu Katsir] dari [Abdullah bin 'Amr], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam berkhutbah, beliau bersabda: \"Jauhilah sifat pelit, karena sesungguhnya yang membinasakan orang sebelum kalian adalah sifat pelit. Mereka diperintahkan untuk bersifat bakhil maka merekapun bersifat bakhil dan mereka diperintahkan untuk memutuskan hubungan kekerabatan maka merekapun memutuskan hubungan kekerabatan, dan mereka diperintahkan untuk berbuat dosa maka merekapun berbuat dosa.\""
            },
            {
                "number": 1396,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا إِسْمَعِيلُ أَخْبَرَنَا أَيُّوبُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ حَدَّثَتْنِي أَسْمَاءُ بِنْتُ أَبِي بَكْرٍ قَالَتْقُلْتُ يَا رَسُولَ اللَّهِ مَا لِي شَيْءٌ إِلَّا مَا أَدْخَلَ عَلَيَّ الزُّبَيْرُ بَيْتَهُ أَفَأُعْطِي مِنْهُ قَالَ أَعْطِي وَلَا تُوكِي فَيُوكَى عَلَيْكِ",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Isma'il], telah mengabarkan kepada Kami [Ayyub], telah menceritakan kepada Kami [Abdullah bin Abu Mulaikah], telah menceritakan kepadaku [Asma` binti Abu Bakr], ia berkata; wahai Rasulullah, aku tidak mempunyai apa-apa kecuali hanya apa yang telah dimasukkan Zubair kerumahnya, apakah aku boleh memberikannya? Beliau menjawab: \"Berikanlah dan janganlah kamu menahan pemberian, maka kamu juga akan diperlakukan sama seperti itu.\""
            },
            {
                "number": 1397,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا إِسْمَعِيلُ أَخْبَرَنَا أَيُّوبُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةِأَنَّهَا ذَكَرَتْ عِدَّةً مِنْ مَسَاكِينَ قَالَ أَبُو دَاوُد و قَالَ غَيْرُهُ أَوْ عِدَّةً مِنْ صَدَقَةٍ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطِي وَلَا تُحْصِي فَيُحْصَى عَلَيْكِ",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Isma'il], telah mengabarkan kepada Kami [Ayyub] dari [Abdullah bin Abu Mulaikah] dari [Aisyah] bahwa ia telah menyebutkan beberapa orang miskin. Abu Daud berkata; sedangkan selainnya mengatakan; atau beberapa sedekah. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata kepadanya: \"Berikan dan jangan menghitung-hitung pemberianmu, sehingga akan dihitung pemberian kepadamu.\""
            },
            {
                "number": 1398,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا شُعْبَةُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ سُوَيْدِ بْنِ غَفَلَةَ قَالَغَزَوْتُ مَعَ زَيْدِ بْنِ صُوحَانَ وَسَلْمَانَ بْنِ رَبِيعَةَ فَوَجَدْتُ سَوْطًا فَقَالَا لِيَ اطْرَحْهُ فَقُلْتُ لَا وَلَكِنْ إِنْ وَجَدْتُ صَاحِبَهُ وَإِلَّا اسْتَمْتَعْتُ بِهِ فَحَجَجْتُ فَمَرَرْتُ عَلَى الْمَدِينَةِ فَسَأَلْتُ أُبَيَّ بْنَ كَعْبٍ فَقَالَ وَجَدْتُ صُرَّةً فِيهَا مِائَةُ دِينَارٍ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ عَرِّفْهَا حَوْلًا فَعَرَّفْتُهَا حَوْلًا ثُمَّ أَتَيْتُهُ فَقَالَ عَرِّفْهَا حَوْلًا فَعَرَّفْتُهَا حَوْلًا ثُمَّ أَتَيْتُهُ فَقَالَ عَرِّفْهَا حَوْلًا فَعَرَّفْتُهَا حَوْلًا ثُمَّ أَتَيْتُهُ فَقُلْتُ لَمْ أَجِدْ مَنْ يَعْرِفُهَا فَقَالَ احْفَظْ عَدَدَهَا وَوِكَاءَهَا وَوِعَاءَهَا فَإِنْ جَاءَ صَاحِبُهَا وَإِلَّا فَاسْتَمْتِعْ بِهَا وَقَالَ وَلَا أَدْرِي أَثَلَاثًا قَالَ عَرِّفْهَا أَوْ مَرَّةً وَاحِدَةًحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ بِمَعْنَاهُ قَالَ عَرِّفْهَا حَوْلًا وَقَالَ ثَلَاثَ مِرَارٍ قَالَ فَلَا أَدْرِي قَالَ لَهُ ذَلِكَ فِي سَنَةٍ أَوْ فِي ثَلَاثِ سِنِينَ حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا سَلَمَةُ بْنُ كُهَيْلٍ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ فِي التَّعْرِيفِ قَالَ عَامَيْنِ أَوْ ثَلَاثَةً وَقَالَ اعْرِفْ عَدَدَهَا وَوِعَاءَهَا وَوِكَاءَهَا زَادَ فَإِنْ جَاءَ صَاحِبُهَا فَعَرَفَ عَدَدَهَا وَوِكَاءَهَا فَادْفَعْهَا إِلَيْهِ قَالَ أَبُو دَاوُد لَيْسَ يَقُولُ هَذِهِ الْكَلِمَةَ إِلَّا حَمَّادٌ فِي هَذَا الْحَدِيثِ يَعْنِي فَعَرَفَ عَدَدَهَا",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Katsir], telah mengabarkan kepada Kami [Syu'bah] dari [Salamah bin Kuhail] dari [Suwaid bin Ghafalah], ia berkata; aku pernah berperang bersama Zaid bin Shuhan, serta Salman bin Rabi'ah, kemudian aku mendapatkan sebuah cambuk. Kemudian mereka berkata kepadaku; letakkan cambuk itu! Maka aku katakan; tidak, akan tetapi apabila aku mendapatkan pemiliknya maka akan aku berikan kepadanya, jika tidak maka aku akan menikmatinya. Kemudian aku melakukan haji dan melewati Madinah, kemudian aku bertanya kepada [Ubai bin Ka'b], kemudian ia berkata; aku pernah mendapatkan sebuah kantong yang berisi uang seratus dinar. Kemudian aku datang kepada Nabi shallallahu 'alaihi wasallam dan beliau berkata: \"Umumkan selama satu tahun.\" Lalu aku mengumumkannya selama satu tahun, kemudian aku datang kepada beliau, dan beliau berkata: \"Umumkan selama satu tahun.\" Lalu aku umumkan selama satu tahun. Kemudian aku datang kepada beliau dan beliau bersabda: \"Umumkan selama satu tahun.\" Lalu aku mengumumkannya selama satu tahun. Kemudian aku berkata; aku tidak mendapatkan orang yang mengakuinya. Lalu beliau bersabda: \"Simpanlah jumlahnya isinya dan kantong dan talinya. Jika datang pemiliknya maka serahkan dan jika tidak maka manfaatkanlah.\" Dia berkata; saya tidak tahu apakah mengatakannya tiga kali atau umumkanlah sekali saja. Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Yahya], dari [Syu'bah] semakna. Yaitu; \"Umumkanlah satu tahun\" dan dikatakan tiga kali, dan saya tidak mengetahuinya apakah itu dikatakan dalam satu tahun atau dalam tiga tahun. Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Salamah bin Kuhail] dengan sanadnya. Hammad menambahkan: \"Apabila pemiliknya telah datang dan mengetahui jumlahnya, serta talinya maka serahkan kepadanya.\" Abu Daud berkata; tidak ada yang mengatakan kalimat ini kecuali Hammad dalam hadits ini, yaitu kata \"dan mengetahui jumlahnya.\""
            },
            {
                "number": 1399,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ يَزِيدَ مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّأَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ اللُّقَطَةِ قَالَ عَرِّفْهَا سَنَةً ثُمَّ اعْرِفْ وِكَاءَهَا وَعِفَاصَهَا ثُمَّ اسْتَنْفِقْ بِهَا فَإِنْ جَاءَ رَبُّهَا فَأَدِّهَا إِلَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ فَضَالَّةُ الْغَنَمِ فَقَالَ خُذْهَا فَإِنَّمَا هِيَ لَكَ أَوْ لِأَخِيكَ أَوْ لِلذِّئْبِ قَالَ يَا رَسُولَ اللَّهِ فَضَالَّةُ الْإِبِلِ فَغَضِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى احْمَرَّتْ وَجْنَتَاهُ أَوْ احْمَرَّ وَجْهُهُ وَقَالَ مَا لَكَ وَلَهَا مَعَهَا حِذَاؤُهَا وَسِقَاؤُهَا حَتَّى يَأْتِيَهَا رَبُّهَاحَدَّثَنَا ابْنُ السَّرْحِ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَالِكٌ بِإِسْنَادِهِ وَمَعْنَاهُ زَادَ سِقَاؤُهَا تَرِدُ الْمَاءَ وَتَأْكُلُ الشَّجَرَ وَلَمْ يَقُلْ خُذْهَا فِي ضَالَّةِ الشَّاءِ وَقَالَ فِي اللُّقَطَةِ عَرِّفْهَا سَنَةً فَإِنْ جَاءَ صَاحِبُهَا وَإِلَّا فَشَأْنُكَ بِهَا وَلَمْ يَذْكُرْ اسْتَنْفِقْ قَالَ أَبُو دَاوُد رَوَاهُ الثَّوْرِيُّ وَسُلَيْمَانُ بْنُ بِلَالٍ وَحَمَّادُ بْنُ سَلَمَةَ عَنْ رَبِيعَةَ مِثْلَهُ لَمْ يَقُولُوا خُذْهَا",
                "id": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id], telah menceritakan kepada Kami [Isma'il bin Ja'far], dari [Rabi'ah bin Abu Abdurrahman], dari [Yazid] mantan budak Al Munba'its, dari [Zaid bin Khalid Al Juhani], bahwa seorang laki-laki bertanya kepada Rasulullah shallAllahu wa'alaihi wa sallam mengenai barang temuan, beliau berkata: \"Umumkan satu tahun, kemudian ketahuilah talinya dan kantongnya kemudian nafkahkan kepada dirimu. Apabila pemiliknya datang maka berikan kepadanya.\" Lalu orang tersebut berkata; wahai Rasulullah, bagaimana dengan kambing yang tersesat? Beliau bersabda: \"Ambillah kambing tersebut, sesungguhnya kambing tersebut adalah milikmu atau saudaramu atau milik serigala.\" Ia berkata; wahai Rasulullah, bagaiamana dengan unta yang tersesat? Kemudian Rasulullah shallAllahu wa'alaihi wa sallam marah hingga kedua pipinya atau wajahnya memerah. Beliau berkata: \"Apa urusanmu dengannya? Ia memiliki sepatu, dan kantong air minum hingga pemiliknya mendapatkannya.\" Telah menceritakan kepada Kami [Ibnu As Sarh], telah menceritakan kepada Kami [Ibnu Wahb], telah mengabarkan kepadaku [Malik] dengan sanad dan maknanya. Ibnu Wahb menambahkan; kantong air minum, unta tersebut minum air dan memakan pohon. Dan beliau tidak mengatakan: \"Ambillah kambing yang hilang.\" Dan beliau berkata mengenai barang temuan: \"Umumkan selama satu tahun, apabila pemiliknya telah datang maka berikan kepadanya, jika tidak maka urusanmu dengannya.\" Dan beliau tidak menyebutkan nafkahkan kepada dirimu. Abu Daud berkata; [Ats Tsauri] dan [Sulaiman bin Bilal] serta [Hammad bin Salamah] dari [Rabi'ah] seperti itu seperti itu, mereka tidak menyebutkan; \"ambillah barang temuan tersebut.\""
            },
            {
                "number": 1400,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ وَهَارُونُ بْنُ عَبْدِ اللَّهِ الْمَعْنَى قَالَا حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ الضَّحَّاكِ يَعْنِي ابْنَ عُثْمَانَ عَنْ سَالِمٍ أَبِي النَّضْرِ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ اللُّقَطَةِ فَقَالَ عَرِّفْهَا سَنَةً فَإِنْ جَاءَ بَاغِيهَا فَأَدِّهَا إِلَيْهِ وَإِلَّا فَاعْرِفْ عِفَاصَهَا وَوِكَاءَهَا ثُمَّ كُلْهَا فَإِنْ جَاءَ بَاغِيهَا فَأَدِّهَا إِلَيْهِ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Rafi'], dan [Harun bin Abdullah] secara makna, mereka berkata; telah menceritakan kepada Kami [Ibnu Abu Fudaik] dari [Adh Dhahhak yaitu Ibnu Utsman] dari [Salim Abu An Nadhr] dari [Busr bin Sa'id] dari [Zaid bin Khalid Al Juhani] bahwa Rasulullah shallAllahu wa'alaihi wa sallam ditanya mengenai barang temuan. Kemudian beliau berkata: \"Umumkan selama satu tahun, kemudian apabila orang yang mencarinya telah datang maka berikan kepadanya, jika tidak maka katahuilah kantongnya dan talinya kemudian makanlah, kemudian apabila orang yang mencarinya telah datang maka kembalikan kepadanya.\""
            },
            {
                "number": 1401,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَفْصٍ حَدَّثَنِي أَبِي حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ عَبَّادِ بْنِ إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ أَبِيهِ يَزِيدَ مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ أَنَّهُ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ نَحْوَ حَدِيثِ رَبِيعَةَقَالَ وَسُئِلَ عَنْ اللُّقَطَةِ فَقَالَ تُعَرِّفُهَا حَوْلًا فَإِنْ جَاءَ صَاحِبُهَا دَفَعْتَهَا إِلَيْهِ وَإِلَّا عَرَفْتَ وِكَاءَهَا وَعِفَاصَهَا ثُمَّ أَفِضْهَا فِي مَالِكَ فَإِنْ جَاءَ صَاحِبُهَا فَادْفَعْهَا إِلَيْهِحَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ وَرَبِيعَةَ بِإِسْنَادِ قُتَيْبَةَ وَمَعْنَاهُ وَزَادَ فِيهِ فَإِنْ جَاءَ بَاغِيهَا فَعَرَفَ عِفَاصَهَا وَعَدَدَهَا فَادْفَعْهَا إِلَيْهِ و قَالَ حَمَّادٌ أَيْضًا عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ قَالَ أَبُو دَاوُد وَهَذِهِ الزِّيَادَةُ الَّتِي زَادَ حَمَّادُ بْنُ سَلَمَةَ فِي حَدِيثِ سَلَمَةَ بْنِ كُهَيْلٍ وَيَحْيَى بْنِ سَعِيدٍ وَعُبَيْدِ اللَّهِ بْنِ عُمَرَ وَرَبِيعَةَ إِنْ جَاءَ صَاحِبُهَا فَعَرَفَ عِفَاصَهَا وَوِكَاءَهَا فَادْفَعْهَا إِلَيْهِ لَيْسَتْ بِمَحْفُوظَةٍ فَعَرَفَ عِفَاصَهَا وَوِكَاءَهَا وَحَدِيثُ عُقْبَةَ بْنِ سُوَيْدٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْضًا قَالَ عَرِّفْهَا سَنَةً وَحَدِيثُ عُمَرَ بْنِ الْخَطَّابِ أَيْضًا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَرِّفْهَا سَنَةً",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Hafsh], telah menceritakan kepadaku [ayahku], telah menceritakan kepadaku [Ibrahim bin Thahman], dari ['Abbad bin Ishaq] dari [Abdullah bin Yazid] dari [ayahnya yaitu Yazid] mantan budak Al Munba'its dari [Zaid bin Khalid Al Juhani] bahwa ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam ditanya ….. kemudian ia menyebutkan seperti hadits Rabi'ah. Ia berkata; dan beliau ditanya mengenai barang temuan, lalu beliau mengatakan: \"Engkau umumkan selama satu tahun, kemudian apabila pemiliknya telah datang maka engkau serahkan kepadanya, jika tidak engkau ketahui talinya dan kantongnya, kemudian masukkan ke dalam hartamu, kemudian apabila pemiliknya datang maka serahkan kepadanya.\" Telah menceritakan kepada Kami [Musa bin Isma'il] dari [Hammad bin Salamah] dari [Yahya bin Sa'id] serta [Rabi'ah] dengan sanad Qutaibah, dan maknanya. Dan ia tambahkan dalam hadits tersebut: \"Kemudian apabila orang yang mencarinya telah datang dan mengetahui isinya dan jumlahnya maka serahkan kepadanya.\" [Hammad] juga mengatakan dari ['ubaidhullah bin Umar] dari ['Amr bin Syuiab] dari [ayahnya] dari [kakeknya] dari Nabi shallallahu 'alaihi wasallam seperti itu. Abu Daud berkata; dan tambahan yang disebutkan Hammad bin Salamah dalam hadits Salamah Kuhail, Yahya bin Sa'id serta 'ubaidhullah bin Umar dan Rabi'ah: \"Apabila pemiliknya telah datang dan mengetahui kantong serta talinya maka serahkan kepadanya\" bukanlah kalimat yang mahfuzh yaitu: \"dan mengetahui kandong dan talinya…\", sedangkan hadits Uqbah bin Suwaid dari ayahnya dari Nabi juga beliau bersabda: \"Umumkan selama satu tahun.\" Sedangkan hadits Umar bin Al Khathab juga dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Umumkan selama satu tahun.\""
            },
            {
                "number": 1402,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا خَالِدٌ يَعْنِي الطَّحَّانَ ح و حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ حَدَّثَنَا وُهَيْبٌ الْمَعْنَى عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي الْعَلَاءِ عَنْ مُطَرِّفٍ يَعْنِي ابْنَ عَبْدِ اللَّهِ عَنْ عِيَاضِ بْنِ حِمَارٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ وَجَدَ لُقَطَةً فَلْيُشْهِدْ ذَا عَدْلٍ أَوْ ذَوِي عَدْلٍ وَلَا يَكْتُمْ وَلَا يُغَيِّبْ فَإِنْ وَجَدَ صَاحِبَهَا فَلْيَرُدَّهَا عَلَيْهِ وَإِلَّا فَهُوَ مَالُ اللَّهِ عَزَّ وَجَلَّ يُؤْتِيهِ مَنْ يَشَاءُ",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Khalid yaitu Ath Thahhan], dan telah diriwayatkan dari jalu yang lain: Telah menceritakan kepada Kami [Musa bin Isma'il], telah menceritakan kepada Kami [Wuhaib] secara makna, dari [Khalid Al Hadzdza`] dari [Abu Al 'Ala`] dari [Mutharrif yaitu Ibnu Abdullah] dari ['Iyadh bin Himar], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barang siapa yang mendapatkan barang temuan, maka hendaknya ia memperlihatkan kepada orang yang adil dan tidak menyembunyikannya, kemudian apabila pemiliknya telah datang maka hendaknya ia mengembalikannya kepadanya. Jika tidak maka itu adalah harta Allah 'azza wajalla yang diberikan kepada orang yang Dia kehendaki.\""
            },
            {
                "number": 1403,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ حَدَّثَهُ عَنْ رَجُلٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ وَجَدَ دِينَارًا فَأَتَى بِهِ فَاطِمَةَ فَسَأَلَتْ عَنْهُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هُوَ رِزْقُ اللَّهِ عَزَّ وَجَلَّ فَأَكَلَ مِنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَكَلَ عَلِيٌّ وَفَاطِمَةُ فَلَمَّا كَانَ بَعْدَ ذَلِكَ أَتَتْهُ امْرَأَةٌ تَنْشُدُ الدِّينَارَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَلِيُّ أَدِّ الدِّينَارَ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Al 'Ala`], telah menceritakan kepada Kami [Abdullah bin Wahb] dari ['Amr bin Al Harits] dari [Bukair bin Al Asyajj] dari ['ubaidhullah bin Miqsam] menceritakannya, dari [seorang laki-laki] dari [Abu Sa'id Al Khudri radliallahu 'anhu] bahwasanya Ali Bin Abu Thalib radliallahu 'anhu menemukan uang satu dinar, kemudian membawanya kepada Fathimah radliallahu 'anha, lalu ia menanyakannya kepada Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallla Allahu 'alaihi wa sallam berkata: itu adalah rizqi dari Allah 'azza wajalla, kemudian beliau memakannya dan begitu juga Ali serta Fathimah. Kemudian setelah itu seorang wanita datang kepada beliau mengumumkan kehilangan uang satu dinar, maka Rasulullah shallallahu 'alaihi wasallam mengatakan kepada Ali: wahai Ali, berikan uang satu dinar tersebut kepadanya. "
            },
            {
                "number": 1404,
                "arab": "حَدَّثَنَا الْهَيْثَمُ بْنُ خَالِدٍ الْجُهَنِيُّ حَدَّثَنَا وَكِيعٌ عَنْ سَعْدِ بْنِ أَوْسٍ عَنْ بِلَالِ بْنِ يَحْيَى الْعَبْسِيِّ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُأَنَّهُ الْتَقَطَ دِينَارًا فَاشْتَرَى بِهِ دَقِيقًا فَعَرَفَهُ صَاحِبُ الدَّقِيقِ فَرَدَّ عَلَيْهِ الدِّينَارَ فَأَخَذَهُ عَلِيٌّ وَقَطَعَ مِنْهُ قِيرَاطَيْنِ فَاشْتَرَى بِهِ لَحْمًا",
                "id": "Telah menceritakan kepada Kami [Al Haitsam bin Khalid Al Juhani], telah menceritakan kepada Kami [Waki'] dari [Sa'd bin Aus] dari [Bilal bin Yahya Al 'Absi] dari [Ali Bin Abu Thalib radliallahu 'anhu] bahwa ia menemukan uang satu dinar lalu dia menggunakannya untuk membeli tepung, pedagang tepung mengetahuinya, kemudian ia mengembalikan uang dinar tersebut kepadanya dan Ali pun mengambilnya lalu dia memotongn sebagian darinya dua kirath lalu ia gunakan untuk membeli daging. "
            },
            {
                "number": 1405,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ الدِّمَشْقِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ عَنْ الْمُغِيرَةِ بْنِ زِيَادٍ عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ أَنَّهُ حَدَّثَهُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَرَخَّصَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْعَصَا وَالسَّوْطِ وَالْحَبْلِ وَأَشْبَاهِهِ يَلْتَقِطُهُ الرَّجُلُ يَنْتَفِعُ بِهِقَالَ أَبُو دَاوُد رَوَاهُ النُّعْمَانُ بْنُ عَبْدِ السَّلَامِ عَنْ الْمُغِيرَةِ أَبِي سَلَمَةَ بِإِسْنَادِهِ وَرَوَاهُ شَبَابَةُ عَنْ مُغِيرَةَ بْنِ مُسْلِمٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ كَانُوا لَمْ يَذْكُرُوا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada Kami [Sulaiman bin Abdurrahman Ad Damasyqi], telah menceritakan kepada Kami [Muhammad bin Syu'aib] dari [Al Mughirah bin Ziyad] dari [Abu Az Zubair Al Makki] bahwa ia menceritakan kepadanya, dari [Jabir bin Abdullah], ia berkata; Rasulullah shallallahu 'alaihi wasallam memberikan keringanan kepada Kami untuk menggunakan tongkat, pecut, tali dan yang semisalnya yang Kami temukan. Abu Daud berkata; hadits ini diriwayatkan [An Nu'man bin Abdussalam] dari [Al Mughirah Abu Salamah] dengan sanadnya. Dan diriwayatkan oleh [Syababah] dari [Al Mughirah bin Muslim] dari [Abu Az Zubair] dari [Jabir], ia berkata; mereka tidak menyebutkan Nabi Shalla Allahu 'alaihi wa sallam. "
            },
            {
                "number": 1406,
                "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ عَمْرِو بْنِ مُسْلِمٍ عَنْ عِكْرِمَةَ أَحْسَبُهُ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ضَالَّةُ الْإِبِلِ الْمَكْتُومَةُ غَرَامَتُهَا وَمِثْلُهَا مَعَهَا",
                "id": "Telah menceritakan kepada Kami [Makhlad bin Khalid], telah menceritakan kepada Kami [Abdurrazzaq], telah mengabarkan kepada Kami [Ma'mar] dari ['Amr bin Muslim] dari [Ikrimah], aku mengira dari [Abu Hurairah] radliallahu 'anhu bahwa Nabi shalla Allahu 'alaihi wa sallam bersabda: \"Unta yang terlepas yang disembunyikan maka dendanya adalah seperti onta tersebut dan ditambah dengan yang semisalnya."
            },
            {
                "number": 1407,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ وَأَحْمَدُ بْنُ صَالِحٍ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو عَنْ بُكَيْرٍ عَنْ يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَاطِبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُقَطَةِ الْحَاجِّقَالَ أَحْمَدُ قَالَ ابْنُ وَهْبٍ يَعْنِي فِي لُقَطَةِ الْحَاجِّ يَتْرُكُهَا حَتَّى يَجِدَهَا صَاحِبُهَا قَالَ ابْنُ مَوْهَبٍ عَنْ عَمْرٍو",
                "id": "Telah menceritakan kepada Kami [Yazid bin Khalid bin Mauhib] serta [Ahmad bin Shalih], mereka berkata; telah menceritakan kepada Kami [Ibnu Wahb], telah mengabarkan kepadaku ['Amr] dari [Bukair] dari [Yahya bin Abdurrahman bin Hathib] dari [Abdurrahman bin Utsman At Taimi] bahwa Rasulullah shallAllahu wa'alaihi wa sallam melarang dari barang temuan dari orang yang melakukan haji. Ahmad berkata; Ibnu Wahb berkata mengenai barang temuan dari orang yang melakukan haji; ia tinggalkan hingga ditemukan pemiliknya. Ibnu Mauhib berkata; dari 'Amr. "
            },
            {
                "number": 1408,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ الْمَعْنَى قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سِنَانٍ عَنْ ابْنِ عَبَّاسٍأَنَّ الْأَقْرَعَ بْنَ حَابِسٍ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ الْحَجُّ فِي كُلِّ سَنَةٍ أَوْ مَرَّةً وَاحِدَةً قَالَ بَلْ مَرَّةً وَاحِدَةً فَمَنْ زَادَ فَهُوَ تَطَوُّعٌقَالَ أَبُو دَاوُد هُوَ أَبُو سِنَانٍ الدُّؤَلِيُّ كَذَا قَالَ عَبْدُ الْجَلِيلِ بْنُ حُمَيْدٍ وَسُلَيْمَانُ بْنُ كَثِيرٍ جَمِيعًا عَنْ الزُّهْرِيِّ و قَالَ عُقَيْلٌ عَنْ سِنَانٍ",
                "id": "Telah menceritakan kepada Kami [Zuhair bin Harb] dan [Utsman bin Abu Syaibah] secara makna, mereka berkata; telah menceritakan kepada Kami [Yazid bin Harun], dari [Sufyan bin Husain] dari [Az Zuhri] dari [Abu Sinan] dari [Ibnu Abbas] bahwa Al Aqra` bin Habis bertanya kepada Nabi shallallahu 'alaihi wasallam, ia berkata; wahai Rasulullah, apakah haji wajib pada setiap tahun atau satu kali? Beliau bersabda: \"Satu kali, barang siapa yang menambahkan maka hal tersebut adalah sebuah sunah.\" Abu Daud berkata; ia adalah Abu Sinan Ad Duali demikian yang dikatakan [Abdul Jalil bin Humaid] serta [Sulaiman bin Katsir] dari [Az Zuhri], sedangkan ['Uqail] mengatakan; dari [Sinan]. "
            },
            {
                "number": 1409,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ ابْنٍ لِأَبِي وَاقِدٍ اللَّيْثِيِّ عَنْ أَبِيهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لِأَزْوَاجِهِ فِي حَجَّةِ الْوَدَاعِ هَذِهِ ثُمَّ ظُهُورَ الْحُصْرِ",
                "id": "Telah menceritakan kepada Kami [An Nufaili] telah menceritakan kepada Kami [Abdul Aziz bin Muhammad] dari [Zaid bin Aslam] dari [anak Abu Waqid Al Laitsi] dari [ayahnya], ia berkata; saya mendengar Rasulullah shallAllahu wa'alaihi wa sallam berkata kepada para isterinya pada saat haji wada'; sesungguhnya haji tersebut adalah ini, kemudian kalian harus tinggal di rumah kalian dan tidak wajib berhaji. "
            },
            {
                "number": 1410,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِيهِ أَنَّ أَبَا هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ لِامْرَأَةٍ مُسْلِمَةٍ تُسَافِرُ مَسِيرَةَ لَيْلَةٍ إِلَّا وَمَعَهَا رَجُلٌ ذُو حُرْمَةٍ مِنْهَاحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ وَالنُّفَيْلِيُّ عَنْ مَالِكٍ ح و حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا بِشْرُ بْنُ عُمَرَ حَدَّثَنِي مَالِكٌ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ قَالَ الْحَسَنُ فِي حَدِيثِهِ عَنْ أَبِيهِ ثُمَّ اتَّفَقُوا عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تُسَافِرَ يَوْمًا وَلَيْلَةً فَذَكَرَ مَعْنَاهُ قَالَ أَبُو دَاوُد وَلَمْ يَذْكُرْ الْقَعْنَبِيُّ وَالنُّفَيْلِيُّ عَنْ أَبِيهِ رَوَاهُ ابْنُ وَهْبٍ وَعُثْمَانُ بْنُ عُمَرَ عَنْ مَالِكٍ كَمَا قَالَ الْقَعْنَبِيُّ حَدَّثَنَا يُوسُفُ بْنُ مُوسَى عَنْ جَرِيرٍ عَنْ سُهَيْلٍ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ نَحْوَهُ إِلَّا أَنَّهُ قَالَ بَرِيدًا",
                "id": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id Ats Tsaqafi], telah menceritakan kepada Kami [Al Laits bin Sa'd] dari [Sa'id bin Abu Sa'id] dari [ayahnya] bahwa [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seorang wanita muslimah untuk bersafar sejauh perjalanan satu malam kecuali bersama dengan seorang laki-laki yang memiliki hubungan mahram dengannya.\" Telah menceritakan kepada Kami [Abdullah bin Maslamah] dan [An Nufaili] dari [Malik], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada Kami [Al Hasan bin Ali], telah menceritakan kepada Kami [Bisyr bin Umar], telah menceritakan kepadaku [Malik] dari [Sa'id bin Abu Sa'id], Al Hasan dalam haditsnya berkata; dari [ayahnya], kemudian mereka sama-sama dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: 'Tidak halal bagi seorang wanita yang beriman kepada Allah dan Hari Akhir untuk bersafar satu hari satu malam …. Ia menyebutkan maknanya. Abu Daud berkata; Al Qa'nabi dan An Nufaili tidak menyebutkan; dari ayahnya. [Ibnu Wahb], serta [Utsman bin Umar] telah meriwayatkan dari [Malik] sebagaimana yang dikatakan Al Qa'nabi. Telah menceritakan kepada Kami [Yusuf bin Musa] dari [Jarir] dari [Suhail] dari [Sa'id bin Abu Sa'id] dari [Abu Hurairah], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"…..\" kemudian ia menyebutkan hadits seperti itu hanya saja ia berkata; selama"
            },
            {
                "number": 1411,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَهَنَّادٌ أَنَّ أَبَا مُعَاوِيَةَ وَوَكِيعًا حَدَّثَاهُمْ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تُسَافِرَ سَفَرًا فَوْقَ ثَلَاثَةِ أَيَّامٍ فَصَاعِدًا إِلَّا وَمَعَهَا أَبُوهَا أَوْ أَخُوهَا أَوْ زَوْجُهَا أَوْ ابْنُهَا أَوْ ذُو مَحْرَمٍ مِنْهَا",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah] dan [Hannad] bahwa [Abu Mu'awiyah] dan [Waki'] telah menceritakan kepada mereka dari [Al A'masy] dari [Abu Shalih] dari [Abu Sa'id], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan Hari Akhir untuk bersafar lebih dari tiga hari, keculai bersama ayahnya atau saudaranya atau suaminya atau anaknya atau orang yang mahram dengannya.\""
            },
            {
                "number": 1412,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُسَافِرُ الْمَرْأَةُ ثَلَاثًا إِلَّا وَمَعَهَا ذُو مَحْرَمٍ",
                "id": "Telah menceritakan kepada Kami [Ahamd bin Hanbal], telah menceritakan kepada Kami [Yahya bin Sa'id] dari ['ubaidhullah], ia berkata; telah menceritakan kepadaku [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak boleh seorang wanita bersafar tiga hari kecuali bersama mahramnya.\""
            },
            {
                "number": 1413,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍأَنَّ ابْنَ عُمَرَ كَانَ يُرْدِفُ مَوْلَاةً لَهُ يُقَالُ لَهَا صَفِيَّةُ تُسَافِرُ مَعَهُ إِلَى مَكَّةَ",
                "id": "Telah menceritakan kepada Kami [Nashr bin Ali], telah menceritakan kepada Kami [Abu Ahmad], telah menceritakan kepada Kami [Sufyan] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] radliallahu 'anhuma bahwa ia membonceng budak wanitanya yang bernama Shafiyyah ketika bepergian ke Mekkah."
            },
            {
                "number": 1414,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ يَعْنِي سُلَيْمَانَ بْنَ حَيَّانَ الْأَحْمَرَ عَنْ ابْنِ جُرَيْجٍ عَنْ عُمَرَ بْنِ عَطَاءٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَرُورَةَ فِي الْإِسْلَامِ",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Abu Khalid yaitu Sulaiman bin Hayyan Al Ahmar] dari [Ibnu Juraij] dari [Umar bin 'Atho`], dari ['Ikrimah] dari [Ibnu Abbas], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam: \"Tidak (ada) hidup membujang dalam Islam.\""
            },
            {
                "number": 1415,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ الْفُرَاتِ يَعْنِي أَبَا مَسْعُودٍ الرَّازِيَّ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْمَخْرَمِيُّ وَهَذَا لَفْظُهُ قَالَا حَدَّثَنَا شَبَابَةُ عَنْ وَرْقَاءَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَكَانُوا يَحُجُّونَ وَلَا يَتَزَوَّدُونَ قَالَ أَبُو مَسْعُودٍ كَانَ أَهْلُ الْيَمَنِ أَوْ نَاسٌ مِنْ أَهْلِ الْيَمَنِ يَحُجُّونَ وَلَا يَتَزَوَّدُونَ وَيَقُولُونَ نَحْنُ الْمُتَوَكِّلُونَ فَأَنْزَلَ اللَّهُ سُبْحَانَهُ{ وَتَزَوَّدُوا فَإِنَّ خَيْرَ الزَّادِ التَّقْوَى }الْآيَةَ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Al Furat yaitu Abu Mas'ud Ar Razi], serta [Muhammad bin Abdullah Al Makhrami], dan ini adalah lafazhnya, mereka berkata; telah menceritakan kepada Kami [Syababah] dari [Warqa`] dari ['Amr bin Dinar] dari ['Ikrimah] dari [Ibnu Abbas], ia berkata; dahulu mereka pergi untuk melaksanakan haji, namun tidak membawa bekal. Abu Mas'ud berkata; dahulu penduduk Yaman atau orang-orang dari penduduk Yaman pergi melaksanakan haji namun tidak membawa bekal dan mereka mengatakan; Kami adalah orang-orang yang bertawakkal kepada Allah. Kemudian Allah menurunkan ayat: \"Dan berbekAllah, dan sebaik-baik bekal adalah ketaqwaan.\""
            },
            {
                "number": 1416,
                "arab": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى حَدَّثَنَا جَرِيرٌ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ مُجَاهِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَقَرَأَ هَذِهِ الْآيَةَ{ لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَبْتَغُوا فَضْلًا مِنْ رَبِّكُمْ }قَالَ كَانُوا لَا يَتَّجِرُونَ بِمِنًى فَأُمِرُوا بِالتِّجَارَةِ إِذَا أَفَاضُوا مِنْ عَرَفَاتٍ",
                "id": "Telah menceritakan kepada Kami [Yusuf bin Musa] telah menceritakan kepada Kami [Jarir] dari [Yazid bin Abu Ziyad] dari [Mujahid] dari [Abdullah bin Abbas], ia membaca ayat \"Tidak ada dosa bagimu untuk mencari karunia (rezki hasil perniagaan) dari Tuhanmu.\" Ia berkata; dahulu mereka tidak mengadakan perdagangan di Mina, setelah ayat ini turun mereka diperintahkan untuk mengadakan perdagangan setelah mereka selesai dari arafat. "
            },
            {
                "number": 1417,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ مُحَمَّدُ بْنُ خَازِمٍ عَنْ الْحَسَنِ بْنِ عَمْرٍو عَنْ مِهْرَانَ أَبِي صَفْوَانَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَرَادَ الْحَجَّ فَلْيَتَعَجَّلْ",
                "id": "Telah menceritakan kepada Kami [Musaddad] telah menceritakan kepada Kami [Abu Mu'awiyah, Muhammad bin Khazin] dari [Al Hasan bin 'Amr] dari [Mihran Abu Shawan] dari [Ibnu Abbas], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barang siapa yang hendak berhaji, maka hendaknya ia bersegera.\""
            },
            {
                "number": 1418,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا الْعَلَاءُ بْنُ الْمُسَيِّبِ حَدَّثَنَا أَبُو أُمَامَةَ التَّيْمِيُّ قَالَكُنْتُ رَجُلًا أُكَرِّي فِي هَذَا الْوَجْهِ وَكَانَ نَاسٌ يَقُولُونَ لِي إِنَّهُ لَيْسَ لَكَ حَجٌّ فَلَقِيتُ ابْنَ عُمَرَ فَقُلْتُ يَا أَبَا عَبْدِ الرَّحْمَنِ إِنِّي رَجُلٌ أُكَرِّي فِي هَذَا الْوَجْهِ وَإِنَّ نَاسًا يَقُولُونَ لِي إِنَّهُ لَيْسَ لَكَ حَجٌّ فَقَالَ ابْنُ عُمَرَ أَلَيْسَ تُحْرِمُ وَتُلَبِّي وَتَطُوفُ بِالْبَيْتِ وَتُفِيضُ مِنْ عَرَفَاتٍ وَتَرْمِي الْجِمَارَ قَالَ قُلْتُ بَلَى قَالَ فَإِنَّ لَكَ حَجًّا جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ عَنْ مِثْلِ مَا سَأَلْتَنِي عَنْهُ فَسَكَتَ عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يُجِبْهُ حَتَّى نَزَلَتْ هَذِهِ الْآيَةُ{ لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَبْتَغُوا فَضْلًا مِنْ رَبِّكُمْ }فَأَرْسَلَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَرَأَ عَلَيْهِ هَذِهِ الْآيَةَ وَقَالَ لَكَ حَجٌّ",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Abdul Wahid bin Ziyad], telah menceritakan kepada Kami [Al 'Ala` bin Al Musayyab], telah menceritakan kepada Kami [Abu Umamah At Taimi], ia berkata; aku menyewakan sesuatu pada saat perjalanan untuk berhaji, orang-orang mengatakan; engkau tidak mendapatkan pahala haji, kemudian aku menemui [Ibnu Umar] dan aku katakan; wahai Abdurrahman, aku adalah orang yang menyewakan sesuatu saat perjalanan untuk berhaji, dan orang-orang mengatakan bahwa aku tidak mendapatkan pahala haji? Maka Ibnu Umar berkata; bukankah kamu berihram, mengucapkan talbiyah (niat), dan melakukan thawaf di ka'bah, bertolak dari Arafah dan melempar jumrah? Aku menjawab: ya! Dia berkata; kamu mendapatkan pahala haji. Telah datang datang seorang laki-laki kepada Rasulullah shallallahu 'alaihi wasallam dan bertanyakan apa yang engkau tanyakan kepadaku, kemudian Nabi shalla Allahu 'alaihi wa sallam tidak menjawabnya hingga ayat ini turun: \"Tidak ada dosa bagimu untuk mencari karunia (rezki hasil perniagaan) dari Tuhanmu.\" Kemudian Rasulullah shallallahu 'alaihi wasallam mengutus seseorang untuk membacakan ayat ini dan mengatakan kepada orang yang bertanya: engkau mendapatkan pahala haji. "
            },
            {
                "number": 1419,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّ النَّاسَ فِي أَوَّلِ الْحَجِّ كَانُوا يَتَبَايَعُونَ بِمِنًى وَعَرَفَةَ وَسُوقِ ذِي الْمَجَازِ وَمَوَاسِمِ الْحَجِّ فَخَافُوا الْبَيْعَ وَهُمْ حُرُمٌ فَأَنْزَلَ اللَّهُ سُبْحَانَهُ{ لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَبْتَغُوا فَضْلًا مِنْ رَبِّكُمْ }فِي مَوَاسِمِ الْحَجِّقَالَ فَحَدَّثَنِي عُبَيْدُ بْنُ عُمَيْرٍ أَنَّهُ كَانَ يَقْرَؤُهَا فِي الْمُصْحَفِ حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ قَالَ أَحْمَدُ بْنُ صَالِحٍ كَلَامًا مَعْنَاهُ أَنَّهُ مَوْلَى ابْنِ عَبَّاسٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ النَّاسَ فِي أَوَّلِ مَا كَانَ الْحَجُّ كَانُوا يَبِيعُونَ فَذَكَرَ مَعْنَاهُ إِلَى قَوْلِهِ مَوَاسِمِ الْحَجِّ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Basysyar] telah menceritakan kepada Kami [Hammad bin Mas'adah], telah menceritakan kepada Kami [Ibnu Abu Dzi`bin] dari ['Atha` bin Abu Rabah] dari ['Ubaid bin 'Umair] dari [Abdullah bin Abbas] bahwa orang-orang ketika perkatama kali melakukan haji mereka tidak berjual beli di Mina serta 'Arafah dan pasar Dzul Majaz, serta pada musim-musim haji. Mereka khawatir berjual beli sementara mereka sedang berihram. Kemudian Allah menurunkan ayat: \"Tidak ada dosa bagimu untuk mencari karunia (rezki hasil perniagaan) dari Tuhanmu, \" Pada Musim-musim haji. Ia berkata; telah menceritakan kepadaku 'Ubaid bin 'Umair bahwa ia membaca ayat tersebut di dalam mushhaf. Telah menceritakan kepada Kami [Ahmad bin Shalih], telah menceritakan kepada Kami [Ibnu Abu Fudaik], telah mengabarkan kepada Kami [Ibnu Abu Dzi`b] dari ['Ubaid bin 'Umair]. Ahmad bin Shalih mengatakan sebuah perkataan yang maknanya bahwa ia adalah mantan budak Ibnu Abbas dari [Abdullah bin Abbas] bahwa pertama kali haji mereka berjual beli, …… -kemudian ia menyebutkan secara makna hingga perkataannya; dan musim-musim haji. "
            },
            {
                "number": 1420,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ إِبْرَاهِيمَ بْنِ عُقْبَةَ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالرَّوْحَاءِ فَلَقِيَ رَكْبًا فَسَلَّمَ عَلَيْهِمْ قَالَ مَنْ الْقَوْمُ فَقَالُوا الْمُسْلِمُونَ فَقَالُوا فَمَنْ أَنْتُمْ قَالُوا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَفَزِعَتْ امْرَأَةٌ فَأَخَذَتْ بِعَضُدِ صَبِيٍّ فَأَخْرَجَتْهُ مِنْ مِحَفَّتِهَا قَالَتْ يَا رَسُولَ اللَّهِ هَلْ لِهَذَا حَجٌّ قَالَ نَعَمْ وَلَكِ أَجْرٌ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Hanbal], telah menceritakan kepada Kami [Sufyan bin 'Uyainah] dari [Ibrahim bin 'Uqbah] dari [Kuraib] dari [Ibnu Abbas], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam pernah berada di Rauha`, kemudian bertemu dengan orang-orang yang menunggang kendaraan. Beliau bertanya: \"Siapakah kalian ini?\" Mereka berkata; Kami adalah orang-orang muslim. Kemudian mereka berkata; dan siapakah kalian? Para sahabat berkata; Rasulullah shallAllahu wa'alaihi wa sallam. Kemudian terdapat seorang wanita yang kaget, lalu ia memegang lengan seorang anak kecil dan mengeluarkannya dari tandunya dan berkata; wahai Rasulullah, apakah anak ini boleh melakukan haji? Beliau bersabda: \"Ya, dan engkau akan mendapatkan pahala.\""
            },
            {
                "number": 1421,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَوَقَّتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَهْلِ الْمَدِينَةِ ذَا الْحُلَيْفَةِ وَلِأَهْلِ الشَّامِ الْجُحْفَةَ وَلِأَهْلِ نَجْدٍ قَرْنَ وَبَلَغَنِي أَنَّهُ وَقَّتَ لِأَهْلِ الْيَمَنِ يَلَمْلَمَحَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادٌ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ وَعَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ قَالَا وَقَّتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ وَقَالَ أَحَدُهُمَا وَلِأَهْلِ الْيَمَنِ يَلَمْلَمَ وَقَالَ أَحَدُهُمَا أَلَمْلَمَ قَالَ فَهُنَّ لَهُمْ وَلِمَنْ أَتَى عَلَيْهِنَّ مِنْ غَيْرِ أَهْلِهِنَّ مِمَّنْ كَانَ يُرِيدُ الْحَجَّ وَالْعُمْرَةَ وَمَنْ كَانَ دُونَ ذَلِكَ قَالَ ابْنُ طَاوُسٍ مِنْ حَيْثُ أَنْشَأَ قَالَ وَكَذَلِكَ حَتَّى أَهْلُ مَكَّةَ يُهِلُّونَ مِنْهَا",
                "id": "Telah menceritakan kepada Kami [Qa'nabi], dari [Malik]. Dan telah diriwayatkan dari jalur yang lain: telah menceritakan kepada Kami [Ahmad bin Yunus], telah menceritakan kepada Kami [Malik] dari [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam menetapkan Dzul Hulaifah sebagai miqat bagi penduduk Madinah Al Juhfah, serta bagi penduduk Najd Qarnul manazil, dan telah sampai kepadaku berita bahwa beliau menetapkan Yalamlam sebagai miqat penduduk Yaman. Telah menceritakan kepada Kami [Sulaiman bin Harb], telah menceritakan kepada Kami [Hammad] dari ['Amr bin Dinar] dari [Thawus] dari [Ibnu Abbas], dan dari [Ibnu Thawus] dari [ayahnya], mereka berkata; Rasulullah shallAllahu wa'alaihi wa sallam telah menetapkan …… -secara makna-. Dan salah seorang diantara mereka berkata; dan Yalamlam sebagai miqat bagi penduduk Yaman. Sedangkan salah seorang dari mereka berkata; Alamlam. Beliau bersabda: Tempat-tempat tersebut adalah miqat untuk mereka dan orang yang datang ke tempat-tempat tersebut yang bukan penduduknya, diantara orang yang ingin berhaji dan berumrah. Dan orang yang diluar hal tersebut Thawus berkata; maka dari tempat ia memulai berihram.\" Ia berkata; dan seperti itu hingga penduduk Mekkah, mereka bertalbiyah darinya. "
            },
            {
                "number": 1422,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ بَهْرَامَ الْمَدَائِنِيُّ حَدَّثَنَا الْمُعَافِىُّ بْنُ عِمْرَانَ عَنْ أَفْلَحَ يَعْنِي ابْنَ حُمَيْدٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَّتَ لِأَهْلِ الْعِرَاقِ ذَاتَ عِرْقٍ",
                "id": "Telah menceritakan kepada Kami [Hisyam bin Bahram Al Madaini], telah menceritakan kepada Kami [Al Mu'afi bin 'Imran] dari [Aflah yaitu Ibnu Humaid] dari [Al Qasim bin Muhammad] dari [Aisyah] radliallahu 'anha bahwa Rasulullah shallla Allahu 'alaihi wa sallam menetapkan Dzatu 'Irq sebagai miqat bagi penduduk Irak. "
            },
            {
                "number": 1423,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ قَالَوَقَّتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَهْلِ الْمَشْرِقِ الْعَقِيقَ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Muhammad bin Hanbal], telah menceritakan kepada Kami [Waki'], telah menceritakan kepada Kami [Sufyan] dari [Yazid bin Abu Ziyad] dari [Muhammad bin Ali bin Abdullah bin Abbas] dari [Ibnu Abbas] radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: Bagi penduduk bagian timur miqatnya adalah Al 'Aqiq. "
            },
            {
                "number": 1424,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يُحَنَّسَ عَنْ يَحْيَى بْنِ أَبِي سُفْيَانَ الْأَخْنَسِيِّ عَنْ جَدَّتِهِ حُكَيْمَةَ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَهَلَّ بِحَجَّةٍ أَوْ عُمْرَةٍ مِنْ الْمَسْجِدِ الْأَقْصَى إِلَى الْمَسْجِدِ الْحَرَامِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ أَوْ وَجَبَتْ لَهُ الْجَنَّةُ شَكَّ عَبْدُ اللَّهِ أَيَّتُهُمَا قَالَقَالَ أَبُو دَاوُد يَرْحَمُ اللَّهُ وَكِيعًا أَحْرَمَ مِنْ بَيْتِ الْمَقْدِسِ يَعْنِي إِلَى مَكَّةَ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Shalih], telah menceritakan kepada Kami [Ibnu Abu Fudaik] dari [Abdullah bin Abdurrahman bin Yuhannas] dari [Yahya bin Abu Sufyan Al Akhnasi] dari [neneknya yaitu Hukaimah] dari [Ummu Salamah] istri Nabi shalla Allahu 'alaihi wa sallam bahwa ia telah mendengar Nabi shalla Allahu 'alaihi wa sallam bersabda: \"Barangsiapa yang bertalbiyah untuk melakukan haji atau umrah dari Masjid Al Aqsha hingga Masjid Al Haram maka akan dihapuskan dosanya yang telah lalu dan yang akan datang, atau wajib ia mendapatkan Surga. Abdullah merasa ragu yang manakah yang beliau ucapkan. Abu Daud berkata; semoga Allah merahmati Waki' sebab dia telah melaksanakan ihram dari Baitul Maqdis sampai ke Mekkah. "
            },
            {
                "number": 1425,
                "arab": "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ أَبِي الْحَجَّاجِ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا عُتْبَةُ بْنُ عَبْدِ الْمَلِكِ السَّهْمِيُّ حَدَّثَنِي زُرَارَةُ بْنُ كُرِيْمٍ أَنَّ الْحَارِثَ بْنَ عَمْرٍو السَّهْمِيَّ حَدَّثَهُ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِمِنًى أَوْ بِعَرَفَاتٍ وَقَدْ أَطَافَ بِهِ النَّاسُ قَالَ فَتَجِيءُ الْأَعْرَابُ فَإِذَا رَأَوْا وَجْهَهُ قَالُوا هَذَا وَجْهٌ مُبَارَكٌ قَالَ وَوَقَّتَ ذَاتَ عِرْقٍ لِأَهْلِ الْعِرَاقِ",
                "id": "Telah menceritakan kepada Kami [Abu Ma'mar Abdullah bin 'Amr bin Abu Al Hajjaj], telah menceritakan kepada Kami [Abdul Warits], telah menceritakan kepada Kami ['Utbah bin Abdul Malik As Sahmi], telah menceritakan kepadaku [Zurarah bin Kuraim] bahwa [Al Harits bin 'Amr As Sahmi] telah menceritakan kepadanya, ia berkata; saya datang kepada Rasulullah shallAllahu wa'alaihi wa sallam, sementara beliau berada di Mina atau 'Arafah, dan orang-orang telah mengelilingi beliau. Al Harits bin 'Amr berkata; kemudian beberapa orang badui datang dan melihat wajah beliau, mereka berkata; ini adalah wajah yang mendapat berkah. Al Harits berkata; dan beliau menetapkan Dzatu 'Irq sebagai miqat bagi penduduk Irak. "
            },
            {
                "number": 1426,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ عَنْ عُبَيْدِ اللَّهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْنُفِسَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ بِمُحَمَّدِ بْنِ أَبِي بَكْرٍ بِالشَّجَرَةِ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَا بَكْرٍ أَنْ تَغْتَسِلَ فَتُهِلَّ",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami ['Abdah] dari ['ubaidhullah] dari [Abdurrahman bin Al Qasim] dari [ayahnya] dari [Aisyah], ia berkata; Asma` binti 'Umais mengalami nifas karena melahirkan Muhammad bin Abu Bakr di bawah pohon. Kemudian Rasulullah shallAllahu wa'alaihi wa sallam memerintahkan Abu Bakr agar Asma` mandi dan bertalbiyah. "
            },
            {
                "number": 1427,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى وَإِسْمَعِيلُ بْنُ إِبْرَاهِيمَ أَبُو مَعْمَرٍ قَالَا حَدَّثَنَا مَرْوَانُ بْنُ شُجَاعٍ عَنْ خُصَيْفٍ عَنْ عِكْرِمَةَ وَمُجَاهِدٍ وَعَطَاءٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْحَائِضُ وَالنُّفَسَاءُ إِذَا أَتَتَا عَلَى الْوَقْتِ تَغْتَسِلَانِ وَتُحْرِمَانِ وَتَقْضِيَانِ الْمَنَاسِكَ كُلَّهَا غَيْرَ الطَّوَافِ بِالْبَيْتِ قَالَ أَبُو مَعْمَرٍ فِي حَدِيثِهِ حَتَّى تَطْهُرَ وَلَمْ يَذْكُرْ ابْنُ عِيسَى عِكْرِمَةَ وَمُجَاهِدًا قَالَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ وَلَمْ يَقُلْ ابْنُ عِيسَى كُلَّهَا قَالَ الْمَنَاسِكَ إِلَّا الطَّوَافَ بِالْبَيْتِ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Isa] dan [Isma'il bin Ibrahim Abu Ma'mar], mereka berkata; telah menceritakan kepada Kami [Marwan bin Syuja'] dari [Khushaif] dari [Ikrimah] serta [Mujahid] dan ['Atha`] dari [Ibnu Abbas] bahwa Nabi Shalla Allahu 'alaihi wa sallam bersabda: \"Wanita yang mengalami haidh atau nifas apabila mendatangi miqat maka mereka mandi dan melakukan ihram serta melaksanakan seluruh ibadah haji kecuali thawaf di Ka'bah. Abu Ma'mar berkata di dalam haditsnya; hingga ia suci. Ibnu Isa tidak menyebutkan Ikrimah dan Mujahid, ia menyebutkan dari 'Atha` dari Ibnu Abbas, Ibnu Isa tidak menyebutkan; kata semuanya, ia menyebutkan; ibadah haji kecuali thawaf. "
            },
            {
                "number": 1428,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكُنْتُ أُطَيِّبُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِإِحْرَامِهِ قَبْلَ أَنْ يُحْرِمَ وَلِإِحْلَالِهِ قَبْلَ أَنْ يَطُوفَ بِالْبَيْتِ",
                "id": "Telah menceritakan kepada Kami [Al Qa'nabi] dari [Malik], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada Kami [Ahmad bin Yunus], telah menceritakan kepada Kami [Malik] dari [Abdurrahman bin Al Qasim] dari [ayahnya] dari [Aisyah], ia berkata; aku memberi Rasulullah shallAllahu wa'alaihi wa sallam minyak wangi untuk ihramnya sebelum beliau melakukan ihram, dan untuk dalam keadaan tidak berihram sebelum beliau melakukan thawaf di Ka'bah. "
            },
            {
                "number": 1429,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا إِسْمَعِيلُ بْنُ زَكَرِيَّا عَنْ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْكَأَنِّي أَنْظُرُ إِلَى وَبِيصِ الْمِسْكِ فِي مَفْرِقِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْرِمٌ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Ash Shabbah Al Bazzaz], telah menceritakan kepada Kami [Isma'il bin Zakariya] dari [Al Hasan bin 'ubaidhullah] dari [Ibrahim] dari [Al Aswad] dari [Aisyah], ia berkata; seolah-olah aku melihat kilatan minyak wangi pada belahan rambut Rasulullah shallAllahu wa'alaihi wa sallam sementara beliau dalam keadaan berihram. "
            },
            {
                "number": 1430,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ يَعْنِي ابْنَ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُهِلُّ مُلَبِّدًا",
                "id": "Telah menceritakan kepada Kami [Sulaiman bin Daud Al Mahri], telah menceritakan kepada Kami [Ibnu Wahb], telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Salim yaitu Ibnu Abdullah] dari [ayahnya], ia berkata; saya mendengar Nabi shallallahu 'alaihi wasallam bertalbiyah dalam keadaan mencelup rambutnya. "
            },
            {
                "number": 1431,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبَّدَ رَأْسَهُ بِالْعَسَلِ",
                "id": "Telah menceritakan kepada Kami ['ubaidhullah bin Umar], telah menceritakan kepada Kami [Abdul A'la], telah menceritakan kepada Kami [Muhammad bin Ishaq] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam mencelup rambut kepalanya menggunakan madu. "
            },
            {
                "number": 1432,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ ابْنِ إِسْحَقَ الْمَعْنَى قَالَ قَالَ عَبْدُ اللَّهِ يَعْنِي ابْنَ أَبِي نَجِيحٍ حَدَّثَنِي مُجَاهِدٌ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهْدَى عَامَ الْحُدَيْبِيَةِ فِي هَدَايَا رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَلًا كَانَ لِأَبِي جَهْلٍ فِي رَأْسِهِ بُرَةُ فِضَّةٍ قَالَ ابْنُ مِنْهَالٍ بُرَةٌ مِنْ ذَهَبٍ زَادَ النُّفَيْلِيُّ يَغِيظُ بِذَلِكَ الْمُشْرِكِينَ",
                "id": "Telah menceritakan kepada Kami [An Nufaili], telah menceritakan kepada Kami [Muhammad bin Salamah] telah menceritakan kepada Kami [Muhammad bin Ishaq], dan telah diriwayatkan melalui jalur yang lain: Telah menceritakan kepada Kami [Muhammad bin Al Minhal], telah menceritakan kepada Kami [Yazid bin Zurai'] dari [Ibnu Ishaq] secara makna, ia berkata; [Abdullah yaitu Ibnu Abu Najih] berkata; telah menceritakan kepada Kami [Mujahid] dari [Ibnu Abbas] bahwa Rasulullah shallAllahu wa'alaihi wa sallam berkurban dengan unta yang dahulu adalah milik Abu Jahl pada tahun terjadinya perjanjian Al Hudaibiyah diantara hewan-hewan kurban beliau. Pada kepala unta tersebut terdapat perak sebesar satu biji gandum. Ibnu Minhal berkata; emas sebesar biji gandum. An Nufaili menambahkan; hal tersebut menyebabkan orang-orang musyrik marah. "
            },
            {
                "number": 1433,
                "arab": "حَدَّثَنَا ابْنُ السَّرْحِ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحَرَ عَنْ آلِ مُحَمَّدٍ فِي حَجَّةِ الْوَدَاعِ بَقَرَةً وَاحِدَةً",
                "id": "Telah menceritakan kepada Kami [Ibnu As Sarh] telah menceritakan kepada Kami [Ibnu Wahb], telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari ['Amrah binti Abdurrahman] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam bahwa Rasulullah shallAllahu wa'alaihi wa sallam pada saat haji wada' menyembelih untuk keluarga Muhammad satu ekor sapi. "
            },
            {
                "number": 1434,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ وَمُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ قَالَا حَدَّثَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَبَحَ عَمَّنْ اعْتَمَرَ مِنْ نِسَائِهِ بَقَرَةً بَيْنَهُنَّ",
                "id": "Telah menceritakan kepada Kami ['Amr bin Utsman], dan [Muhammad bin Mahran Ar Razi], mereka berkata; telah menceritakan kepada Kami [Al Walid] dari [Al Auza'i] dari [Yahya] dari [Abu Salamah] dari [Abu Hurairah] radliallahu 'anhu bahwa Rasulullah shallallahu 'alaihi wasallam menyembelihkan satu ekor sapi untuk istri-istrinya yang melaksanakan umrah. "
            },
            {
                "number": 1435,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ وَحَفْصُ بْنُ عُمَرَ الْمَعْنَى قَالَا حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ أَبُو الْوَلِيدِ قَالَ سَمِعْتُ أَبَا حَسَّانَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ بِذِي الْحُلَيْفَةِ ثُمَّ دَعَا بِبَدَنَةٍ فَأَشْعَرَهَا مِنْ صَفْحَةِ سَنَامِهَا الْأَيْمَنِ ثُمَّ سَلَتَ عَنْهَا الدَّمَ وَقَلَّدَهَا بِنَعْلَيْنِ ثُمَّ أُتِيَ بِرَاحِلَتِهِ فَلَمَّا قَعَدَ عَلَيْهَا وَاسْتَوَتْ بِهِ عَلَى الْبَيْدَاءِ أَهَلَّ بِالْحَجِّحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ بِهَذَا الْحَدِيثِ بِمَعْنَى أَبِي الْوَلِيدِ قَالَ ثُمَّ سَلَتَ الدَّمَ بِيَدِهِ قَالَ أَبُو دَاوُد رَوَاهُ هَمَّامٌ قَالَ سَلَتَ الدَّمَ عَنْهَا بِأُصْبُعِهِ قَالَ أَبُو دَاوُد هَذَا مِنْ سُنَنِ أَهْلِ الْبَصْرَةِ الَّذِي تَفَرَّدُوا بِهِ",
                "id": "Telah menceritakan kepada Kami [Abu Al Walid Ath Thayalisi], dan [Hafsh bin Umar] secara makna, mereka berkata; telah menceritakan kepada Kami [Syu'bah] dari [Qatadah], ia berkata; [Abu Al Walid] berkata; saya mendengar [Abu Hassan] dari [Ibnu Abbas] bahwa Rasulullah shallAllahu wa'alaihi wa sallam melakukan sholat Zhuhur di Dzul Hulaifah kemudian meminta seekor unta lalu beliau melukainya dari sisi punuknya sebelah kanan, kemudian beliau menghentikan darah darinya, dan mengalunginya dengan dua sandal. Kemudian beliau diberi kendaraan, dan tatkala beliau telah duduk di atasnya dan unta tersebut telah menaiki Al Baida` maka beliau bertalbiah untuk melakukan haji. Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Yahya] dari [Syu'bah] dengan hadits ini semakna dengan hadits Abu Al Walid, ia berkata; kemudian beliau menghentikan darah menggunakan tangannya. Abu Daud berkata; hadits tersebut diriwayatkan oleh [Hammam], ia berkata; beliau menghentikan darah darinya menggunakan jari-jarinya. Abu Daud berkata; hal ini merupakan diantara kebiasaan-kebiasaan penduduk Bashrah yang menjadi kekhususan mereka. "
            },
            {
                "number": 1436,
                "arab": "حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ حَمَّادٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ الْمِسْوَرِ بْنِ مَخْرَمَةَ وَمَرْوَانُ بْنُ الْحَكَمِ أَنَّهُمَا قَالَاخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْحُدَيْبِيَةِ فَلَمَّا كَانَ بِذِي الُحُلَيْفَةِ قَلَّدَ الْهَدْيَ وَأَشْعَرَهُ وَأَحْرَمَ",
                "id": "Telah menceritakan kepada Kami [Abdul A'la bin Hammad], telah menceritakan kepada Kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['Urwah] dari [Al Miswar bin Makhramah] serta [Marwan bin Al Hakam], bahwa mereka berdua berkata; Rasulullah shallallahu 'alaihi wasallam keluar pada tahun Hudaibiyah, tatkala beliau telah sampai di Dzul Hulaifah beliau mengalungi hewan kurbannya dan melukainya serta berihram. "
            },
            {
                "number": 1437,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ وَالْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهْدَى غَنَمًا مُقَلَّدَةً",
                "id": "Telah menceritakan kepada Kami [Hannad] telah menceritakan kepada Kami [Waki'] dari [Sufyan] dari [Manshur] dan [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam berkurban dengan kambing yang telah digantungi kalung. "
            },
            {
                "number": 1438,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ أَبِي عَبْدِ الرَّحِيمِ قَالَ أَبُو دَاوُد أَبُو عَبْدِ الرَّحِيمِ خَالِدُ بْنُ أَبِي يَزِيدَ خَالُ مُحَمَّدٍ يَعْنِي ابْنَ سَلَمَةَ رَوَى عَنْهُ حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ جَهْمِ بْنِ الْجَارُودِ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَأَهْدَى عُمَرُ بْنُ الْخَطَّابِ نَجِيبًا فَأَعْطَى بِهَا ثَلَاثَ مِائَةِ دِينَارٍ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَهْدَيْتُ نَجِيبًا فَأَعْطَيْتُ بِهَا ثَلَاثَ مِائَةِ دِينَارٍ أَفَأَبِيعُهَا وَأَشْتَرِي بِثَمَنِهَا بُدْنًا قَالَ لَا انْحَرْهَا إِيَّاهَاقَالَ أَبُو دَاوُد هَذَا لِأَنَّهُ كَانَ أَشْعَرَهَا",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada Kami [Muhammad bin Salamah] dari [Abu Abdurrahim]. -Abu Daud berkata; Abu Abdurrahim adalah Khalid bin Abu Yazid, paman Muhammad bin Salamah-, darinya Hajjaj bin Muhammad dari [Jahm bin Al Jarud], dari [Salim bin Abdullah] dari [ayahnya], ia berkata: Umar bin Khathab berkurban dengan seekor unta yang kuat, ringan dan berlari cepat, kemudian ia menjualnya dengan harga tiga ratus dinar. kemudian ia mendatangi Nabi shalla Allahu 'alaihi wa sallam dan berkata: Wahai Rasulullah, aku berkurban dengan seekor unta, kemudian unta tersebut dibeli dengan harga tiga ratus dinar, aku menjualnya dan membeli unta lain dengan harga yang sama? Beliau menjawab: \"Tidak boleh! Sembelihlah unta tersebut!\" Abu Daud berkata: hal tersebut dikarenakan Umar telah melukainya sebagai tanda."
            },
            {
                "number": 1439,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ حَدَّثَنَا أَفْلَحُ بْنُ حُمَيْدٍ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْفَتَلْتُ قَلَائِدَ بُدْنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِي ثُمَّ أَشْعَرَهَا وَقَلَّدَهَا ثُمَّ بَعَثَ بِهَا إِلَى الْبَيْتِ وَأَقَامَ بِالْمَدِينَةِ فَمَا حَرُمَ عَلَيْهِ شَيْءٌ كَانَ لَهُ حِلًّا",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah Al Qa'nabi], Telah menceritakan kepada Kami [Aflah bin Humaid] dari [Al Qasim] dari [Aisyah], ia berkata; aku menjalin kalung-kalung unta Rasulullah shallAllahu wa'alaihi wa sallam menggunakan tanganku, kemudian beliau melukainya sebagai tanda dan mengalunginya kemudian mengirimnya ke Ka'bah. Dan beliau bermukim di Madinah dan tidak ada sesuatupun yang haram baginya yang dahulunya adalah halal. "
            },
            {
                "number": 1440,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدٍ الرَّمْلِيُّ الْهَمَدَانِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ أَنَّ اللَّيْثَ بْنَ سَعْدٍ حَدَّثَهُمْ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ وَعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُهْدِي مِنْ الْمَدِينَةِ فَأَفْتِلُ قَلَائِدَ هَدْيِهِ ثُمَّ لَا يَجْتَنِبُ شَيْئًا مِمَّا يَجْتَنِبُ الْمُحْرِمُ",
                "id": "Telah menceritakan kepada Kami [Yazid bin Khalid Ar Ramli Al Hamdani], serta [Qutaibah bin Sa'id] bahwa [Al Laits bin Sa'd] telah menceritakan kepada mereka dari [Ibnu Syihab] dari ['Urwah] dan ['Amrah binti Abdurrahman] bahwa [Aisyah] radliallahu 'anha berkata; Rasulullah shallAllahu wa'alaihi wa sallam berkurban dari Madinah, dan aku yang menjalin kalung-kalung hewan kurbannya, kemudian beliau tidak menjauhi sesuatupun diantara perkara-perkara yang dijauhi orang yang berihram. "
            },
            {
                "number": 1441,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ وَعَنْ إِبْرَاهِيمَ زَعَمَ أَنَّهُ سَمِعَهُ مِنْهُمَا جَمِيعًا وَلَمْ يَحْفَظْ حَدِيثَ هَذَا مِنْ حَدِيثِ هَذَا وَلَا حَدِيثَ هَذَا مِنْ حَدِيثِ هَذَا قَالَا قَالَتْ أُمُّ الْمُؤْمِنِينَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْهَدْيِ فَأَنَا فَتَلْتُ قَلَائِدَهَا بِيَدِي مِنْ عِهْنٍ كَانَ عِنْدَنَا ثُمَّ أَصْبَحَ فِينَا حَلَالًا يَأْتِي مَا يَأْتِي الرَّجُلُ مِنْ أَهْلِهِ",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Bisyr bin Al Mufadhdhal], telah menceritakan kepada Kami [Ibnu 'Aun] dari [Al Qasim bin Muhammad] dan [Ibrahim], ia mengaku bahwa ia telah mendengarnya dari keduanya, dan tidak dapat membedakan antara hadits ini dari hadits ini dan hadits ini dari hadits ini. Mereka berkata; telah berkata [Ummul mukminin]; Rasulullah shallAllahu wa'alaihi wa sallam mengirim hewan kurban, dan aku yang menjalin kalung-kalung hewan tersebut dengan tanganku dari bulu yang ada pada Kami, kemudian pada pagi hari beliau dalam keadaan tidak berihram, beliau melakukan apa yang dilakukan seorang laki-laki kepada isterinya. "
            },
            {
                "number": 1442,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَسُوقُ بَدَنَةً فَقَالَ ارْكَبْهَا قَالَ إِنَّهَا بَدَنَةٌ فَقَالَ ارْكَبْهَا وَيْلَكَ فِي الثَّانِيَةِ أَوْ فِي الثَّالِثَةِ",
                "id": "Telah menceritakan kepada Kami [Al Qa'nabi], dari [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam melihat seorang laki-laki menuntun seekor unta. Kemudian beliau berkata: \"Naikilah unta tersebut!\" Ia berkata; unta tersebut adalah unta kurban, kemudian beliau berkata: \"Naikilah, merugilah engkau.\" Beliau mengucapkannya kedua atau ketiga kali. "
            },
            {
                "number": 1443,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِسَأَلْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ عَنْ رُكُوبِ الْهَدْيِ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ارْكَبْهَا بِالْمَعْرُوفِ إِذَا أُلْجِئْتَ إِلَيْهَا حَتَّى تَجِدَ ظَهْرًا",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Hanbal], telah menceritakan kepada Kami [Yahya bin Sa'id] dari [Ibnu Juraij], telah mengabarkan kepadaku [Abu Az Zubair], aku bertanya kepada [Jabir bin Abdullah] mengenai menaiki hewan kurban. Kemudian ia berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: Naikilah dengan cara yang ma'ruf, apabila kalian terpaksa untuk menaikinya hingga mendapatkan tunggannya. "
            },
            {
                "number": 1444,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ نَاجِيَةَ الْأَسْلَمِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ مَعَهُ بِهَدْيٍ فَقَالَ إِنْ عَطِبَ مِنْهَا شَيْءٌ فَانْحَرْهُ ثُمَّ اصْبُغْ نَعْلَهُ فِي دَمِهِ ثُمَّ خَلِّ بَيْنَهُ وَبَيْنَ النَّاسِ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Katsir], telah mengabarkan kepada Kami [Abu Sufyan] dari [Hisyam] dari [ayahnya] dari [Najiyah Al Aslami] bahwa Rasulullah shallAllahu wa'alaihi wa sallam telah mengirim unta kurban bersamanya. Beliau berkata: \"Apabila sebagiannya telah mendekati kematian maka sembelihlah hewan tersebut, kemudian celupkan sandal kakinya ke dalam darahnya, kemudian biarkan dimanfaatkan orang-orang.\""
            },
            {
                "number": 1445,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَمُسَدَّدٌ قَالَا حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَارِثِ وَهَذَا حَدِيثُ مُسَدَّدٍ عَنْ أَبِي التَّيَّاحِ عَنْ مُوسَى بْنِ سَلَمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فُلَانًا الْأَسْلَمِيَّ وَبَعَثَ مَعَهُ بِثَمَانِ عَشْرَةَ بَدَنَةً فَقَالَ أَرَأَيْتَ إِنْ أُزْحِفَ عَلَيَّ مِنْهَا شَيْءٌ قَالَ تَنْحَرُهَا ثُمَّ تَصْبُغُ نَعْلَهَا فِي دَمِهَا ثُمَّ اضْرِبْهَا عَلَى صَفْحَتِهَا وَلَا تَأْكُلْ مِنْهَا أَنْتَ وَلَا أَحَدٌ مِنْ أَصْحَابِكَ أَوْ قَالَ مِنْ أَهْلِ رُفْقَتِكَقَالَ أَبُو دَاوُد الَّذِي تَفَرَّدَ بِهِ مِنْ هَذَا الْحَدِيثِ قَوْلُهُ وَلَا تَأْكُلْ مِنْهَا أَنْتَ وَلَا أَحَدٌ مِنْ رُفْقَتِكَ وَقَالَ فِي حَدِيثِ عَبْدِ الْوَارِثِ ثُمَّ اجْعَلْهُ عَلَى صَفْحَتِهَا مَكَانَ اضْرِبْهَا قَالَ أَبُو دَاوُد سَمِعْت أَبَا سَلَمَةَ يَقُولُ إِذَا أَقَمْتَ الْإِسْنَادَ وَالْمَعْنَى كَفَاكَ",
                "id": "Telah menceritakan kepada Kami [Sulaiman bin Harb], dan [Musaddad], mereka berkata; telah menceritakan kepada Kami [Hammad]. Dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Abdul Warits] dan ini adalah hadits Musaddad dari [Abu At Tayyah] dari [Musa bin Salamah] dari [Ibnu Abbas], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam mengutus Fulan Al Aslami dan mengirim bersamanya delapan belas unta kurban. Kemudian orang tersebut berkata; bagaimana pendapat anda apabila sebagiannya hampir mati dan tidak mampu berjalan? Beliau menjawab: \"Engkau sembelih, kemudian engkau celupkan sepatunya pada darahnya. Kemudian pukulkan sepatu kakinya ke sisi punuknya, dan jangan engkau serta seorangpun dari para sahabatmu memakan sebagian darinya.\" Atau ia berkata; \"Dari orang-orang yang bersahabat denganmu.\" Abu Daud berkata; yang tersendiri dari hadits ini adalah ucapannya; dan janganlah serta seorangpun dari para sahabatmu memakan sebagian darinya.\" Beliau berkata dalam hadits Abdul Warits: \"kemudian jadikan sepatu tersebut pada sisi punuk.\" Sebagai ganti kata; pululkan. Abu Daud berkata; saya mendengar Abu Salamah berkata; apabila engkau menyebutkan sanad dan makna maka sudah cukup. "
            },
            {
                "number": 1446,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مُحَمَّدٌ وَيَعْلَى ابْنَا عُبَيْدٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَلَمَّا نَحَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُدْنَهُ فَنَحَرَ ثَلَاثِينَ بِيَدِهِ وَأَمَرَنِي فَنَحَرْتُ سَائِرَهَا",
                "id": "Telah menceritakan kepada Kami [Harun bin Abdullah], telah menceritakan kepada Kami [Muhammad] serta [Ya'la] kedua anak 'Ubaid, mereka berkata; telah menceritakan kepada Kami [Muhammad bin Ishaq], dari [Ibnu Abu Najih] dari [Mujahid] dari [Abdurrahman bin Abu Laila] dari [Ali radliallahu 'anhu], ia berkata; tatkala Rasulullah shallAllahu wa'alaihi wa sallam menyembelih untanya, beliau menyembelih tiga puluh ekor dengan tangannya dan memerintahkan aku untuk menyembelih sisanya. "
            },
            {
                "number": 1447,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عِيسَى ح و حَدَّثَنَا مُسَدَّدٌ أَخْبَرَنَا عِيسَى وَهَذَا لَفْظُ إِبْرَاهِيمَ عَنْ ثَوْرٍ عَنْ رَاشِدِ بْنِ سَعْدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ لُحَيٍّ عَنْ عَبْدِ اللَّهِ بْنِ قُرْطٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَعْظَمَ الْأَيَّامِ عِنْدَ اللَّهِ تَبَارَكَ وَتَعَالَى يَوْمُ النَّحْرِ ثُمَّ يَوْمُ الْقَرِّ قَالَ عِيسَى قَالَ ثَوْرٌ وَهُوَ الْيَوْمُ الثَّانِي وَقَالَ وَقُرِّبَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَدَنَاتٌ خَمْسٌ أَوْ سِتٌّ فَطَفِقْنَ يَزْدَلِفْنَ إِلَيْهِ بِأَيَّتِهِنَّ يَبْدَأُ فَلَمَّا وَجَبَتْ جُنُوبُهَا قَالَ فَتَكَلَّمَ بِكَلِمَةٍ خَفِيَّةٍ لَمْ أَفْهَمْهَا فَقُلْتُ مَا قَالَ قَالَ مَنْ شَاءَ اقْتَطَعَ",
                "id": "Telah menceritakan kepada Kami [Ibrahim bin Musa Ar Razi], telah mengabarkan kepada Kami [Isa]. Dan telah diriwayatkan dari jalur yang lain: telah menceritakan kepada Kami [Musaddad], telah mengabarkan kepada Kami [Isa], dan ini adalah lafazh Ibrahim, dari [Tsaur] dari [Rasyid bin Sa'd] dari [Abdullah bin 'Amir bin Luhai] dari [Abdullah bin Qurth] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya hari yang teragung di sisi Allah tabaraka wa ta'ala adalah hari Nahr (Hari Raya Kurban), kemudian hari setelah hari Nahr.\" Isa berkata; Tsaur berkata; yaitu hari kedua. Ia berkata; dan telah didekatkan kepada Rasulullah shallAllahu wa'alaihi wa sallam lima atau enam ekor unta. Unta-unta tersebut mendekat kepadanya, beliau memulai dengan unta yang manapun. Kemudian tatkala telah terjatuh beliau mengucapkan sebuah kalimat yang samar, saya tidak memahaminya. Lalu saya katakan; apakah yang beliau katakana? Ia mengatakan; \"Barang siapa yang menginginkan maka boleh ia mengambil sepotong darinya.\""
            },
            {
                "number": 1448,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ حَرْمَلَةَ بْنِ عِمْرَانَ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ الْأَزْدِيِّ قَالَ سَمِعْتُ غُرْفَةَ بْنَ الْحَارِثِ الْكِنْدِيِّ قَالَشَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ وَأُتِيَ بِالْبُدْنِ فَقَالَ ادْعُوا لِي أَبَا حَسَنٍ فَدُعِيَ لَهُ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ فَقَالَ لَهُ خُذْ بِأَسْفَلِ الْحَرْبَةِ وَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَعْلَاهَا ثُمَّ طَعَنَا بِهَا فِي الْبُدْنِ فَلَمَّا فَرَغَ رَكِبَ بَغْلَتَهُ وَأَرْدَفَ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Hatim], telah menceritakan kepada Kami [Abdurrahman bin Mahdi], telah menceritakan kepada Kami [Abdullah bin Al Mubarak] dari [Harmalah bin Imran] dari [Abdullah bin Harits Al Azdi], berkata: saya mendengar [Ghurfah bin Al Harits Al Kindi], ia berkata: aku telah menyaksikan Rasulullah shallallahu 'alaihi wasallam pada waktu haji wada' dan beliau diberi unta, lalu beliau berkata: panggillah Abu Hasan. Maka Ali Bin Abu Thalib radliallahu 'anhu dipanggil lalu, kemudian beliau berkata kepadanya: \"Peganglah bagian bawah tombak! Dan Rasulullah shallallahu 'alaihi wasallam memegang atasnya lalu mereka berdua menghujamkannya ke unta. Setelah selesai beliau menaiki bighalnya(jenis keledai) dan membonceng Ali Bin Abi Thalib radliallahu 'anhu. "
            },
            {
                "number": 1449,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ وَأَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ سَابِطٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابَهُ كَانُوا يَنْحَرُونَ الْبَدَنَةَ مَعْقُولَةَ الْيُسْرَى قَائِمَةً عَلَى مَا بَقِيَ مِنْ قَوَائِمِهَا",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Abu Khalid Al Ahmar] dari [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir], dan telah mengabarkan kepadaku [Abdurrahman bin Sabith] bahwa Nabi shallallahu 'alaihi wasallam dan para sahabatnya menyembelih unta yang diikat kaki kirinya dalam keadaan berdiri dengan kakinya yang lain. "
            },
            {
                "number": 1450,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يُونُسُ أَخْبَرَنِي زِيَادُ بْنُ جُبَيْرٍ قَالَكُنْتُ مَعَ ابْنِ عُمَرَ بِمِنًى فَمَرَّ بِرَجُلٍ وَهُوَ يَنْحَرُ بَدَنَتَهُ وَهِيَ بَارِكَةٌ فَقَالَ ابْعَثْهَا قِيَامًا مُقَيَّدَةً سُنَّةَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Hanbal], telah menceritakan kepada Kami [Husyaim], telah mengabarkan kepada Kami [Yunus], telah mengabarkan kepadaku [Ziyad bin Jubair], ia berkata; aku pernah bersama [Ibnu Umar] di Mina, kemudian ia melewati seorang laki-laki yang menyembelih untanya dalam keadaan menderum. Kemudian Ibnu Umar berkata; bangkitkan unta tersebut dalam keadaan terikat, ikutilah sunah Muhammad shallallahu 'alaihi wasallam. "
            },
            {
                "number": 1451,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا سُفْيَانُ يَعْنِي ابْنَ عُيَيْنَةَ عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ عَنْ مُجَاهِدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَقُومَ عَلَى بُدْنِهِ وَأَقْسِمَ جُلُودَهَا وَجِلَالَهَا وَأَمَرَنِي أَنْ لَا أُعْطِيَ الْجَزَّارَ مِنْهَا شَيْئًا وَقَالَ نَحْنُ نُعْطِيهِ مِنْ عِنْدِنَا",
                "id": "Telah menceritakan kepada Kami ['Amr bin 'Aun], telah mengabarkan kepada Kami [Sufyan yaitu Ibnu 'Uyainah] dari [Abdul Karim Al Jazari] dari [Mujahid] dari [Abdurrahman bin Abu Laila] dari [Ali] radliallahu 'anhu, ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam memerintahkanku menyembelih untanya dan membagikan kulitnya serta segala yang ada diatasnya, dan beliau memerintahkan agar aku tidak memberikan sesuatupun kepada orang yang menyembelih. Beliau bersabda: \"Kami akan memberinya dari diri Kami.\""
            },
            {
                "number": 1452,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مَنْصُورٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ قَالَ حَدَّثَنِي خُصَيْفُ بْنُ عَبْدِ الرَّحْمَنِ الْجَزَرِيُّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَقُلْتُ لِعَبْدِ اللَّهِ بْنِ عَبَّاسٍ يَا أَبَا الْعَبَّاسِ عَجِبْتُ لِاخْتِلَافِ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِهْلَالِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ أَوْجَبَ فَقَالَ إِنِّي لَأَعْلَمُ النَّاسِ بِذَلِكَ إِنَّهَا إِنَّمَا كَانَتْ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَجَّةً وَاحِدَةً فَمِنْ هُنَاكَ اخْتَلَفُوا خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَاجًّا فَلَمَّا صَلَّى فِي مَسْجِدِهِ بِذِي الْحُلَيْفَةِ رَكْعَتَيْهِ أَوْجَبَ فِي مَجْلِسِهِ فَأَهَلَّ بِالْحَجِّ حِينَ فَرَغَ مِنْ رَكْعَتَيْهِ فَسَمِعَ ذَلِكَ مِنْهُ أَقْوَامٌ فَحَفِظْتُهُ عَنْهُ ثُمَّ رَكِبَ فَلَمَّا اسْتَقَلَّتْ بِهِ نَاقَتُهُ أَهَلَّ وَأَدْرَكَ ذَلِكَ مِنْهُ أَقْوَامٌ وَذَلِكَ أَنَّ النَّاسَ إِنَّمَا كَانُوا يَأْتُونَ أَرْسَالًا فَسَمِعُوهُ حِينَ اسْتَقَلَّتْ بِهِ نَاقَتُهُ يُهِلُّ فَقَالُوا إِنَّمَا أَهَلَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ اسْتَقَلَّتْ بِهِ نَاقَتُهُ ثُمَّ مَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا عَلَا عَلَى شَرَفِ الْبَيْدَاءِ أَهَلَّ وَأَدْرَكَ ذَلِكَ مِنْهُ أَقْوَامٌ فَقَالُوا إِنَّمَا أَهَلَّ حِينَ عَلَا عَلَى شَرَفِ الْبَيْدَاءِ وَايْمُ اللَّهِ لَقَدْ أَوْجَبَ فِي مُصَلَّاهُ وَأَهَلَّ حِينَ اسْتَقَلَّتْ بِهِ نَاقَتُهُ وَأَهَلَّ حِينَ عَلَا عَلَى شَرَفِ الْبَيْدَاءِقَالَ سَعِيدٌ فَمَنْ أَخَذَ بِقَوْلِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَهَلَّ فِي مُصَلَّاهُ إِذَا فَرَغَ مِنْ رَكْعَتَيْهِ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Manshur], telah menceritakan kepada Kami [Ya'qub yaitu Ibnu Ibrahim], telah menceritakan kepada Kami [ayahku] dari [Ibnu Ishaq], ia berkata; telah menceritakan kepadaku [Khushaif bin Abdurrahman Al Jazari], dari [Sa'id bin Jubair], ia berkata; aku katakan kepada [Abdullah bin Abbas], wahai Ibnu Abbas, aku heran terhadap perselisihan para sahabat Rasulullah shallAllahu wa'alaihi wa sallam mengenai talbiyah Rasulullah shallAllahu wa'alaihi wa sallam ketika beliau mengharuskan untuk berhaji. Lalu ia berkata; sungguh aku adalah orang yang paling tahu mengenai hal tersebut. Sesungguhnya haji tersebut dilakukan Rasulullah shallAllahu wa'alaihi wa sallam satu kali. Kemudian dari sana mereka berselisih. Rasulullah shallAllahu wa'alaihi wa sallam keluar untuk berhaji, kemudian tatkala beliau telah melakukan sholat dua raka'at di masjidnya di Dzul Hulaifah, beliau mewajibkan haji di majelisnya. Kemudian beliau bertalbiyah untuk melakukan haji ketika telah selesai dari dua raka'at tersebut. Lalu orang-orang mendengar hal tersebut dan aku hafal hal tersebut dari beliau. Kemudian beliau menaiki kendaraannya, lalu ketika untanya telah berada di tempat yang tinggi beliau bertalbiyah, dan hal tersebut didapatkan oleh orang-orang darinya. Sesungguhnya mereka datang bergelombang, lalu mereka mendengar beliau ketika untanya berada di tempat yang tinggi. Mereka berkata; sesungguhnya Rasulullah shallAllahu wa'alaihi wa sallam bertalbiyah ketika untanya berada di tempat yang tinggi. Kemudian Rasulullah berlalu, tatkala beliau telah berada di puncak Al Baida`, demi Allah sungguh beliau telah mewajibkan hajinya di tempat beliau melakukan sholat. Dan beliau bertalbiyah ketika untanya berada di tempat yang tinggi, dan beliau bertalbiyah tatkala berada di puncak Al Baida`. Sa'id berkata; barang siapa yang mengambil ucapan Abdullah bin Abbas maka ia bertalbiyah di tempat ia melakukan sholat apabila telah menyelesaikan sholat dua raka'at. "
            },
            {
                "number": 1453,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَبَيْدَاؤُكُمْ هَذِهِ الَّتِي تَكْذِبُونَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا مَا أَهَلَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مِنْ عِنْدِ الْمَسْجِدِ يَعْنِي مَسْجِدَ ذِي الْحُلَيْفَةِ",
                "id": "Telah menceritakan kepada Kami [Al Qa'nabi], dari [Malik] dari [Musa bin 'Uqbah] dari [Salim bin Abdullah] dari [ayahnya], ia berkata; Baida` kalian ini adalah Baida` yang padanya kalian mendustakan Rasulullah shallAllahu wa'alaihi wa sallam. Tidaklah Rasulullah shallAllahu wa'alaihi wa sallam bertalbiyah kecuali dari Masjid, yaitu Masjid Dzul Hulaifah. "
            },
            {
                "number": 1454,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ عُبَيْدِ بْنِ جُرَيْجٍأَنَّهُ قَالَ لِعَبْدِ اللَّهِ بْنِ عُمَرَ يَا أَبَا عَبْدِ الرَّحْمَنِ رَأَيْتُكَ تَصْنَعُ أَرْبَعًا لَمْ أَرَ أَحَدًا مِنْ أَصْحَابِكَ يَصْنَعُهَا قَالَ مَا هُنَّ يَا ابْنَ جُرَيْجٍ قَالَ رَأَيْتُكَ لَا تَمَسُّ مِنْ الْأَرْكَانِ إِلَّا الْيَمَانِيَّيْنِ وَرَأَيْتُكَ تَلْبَسُ النِّعَالَ السِّبْتِيَّةَ وَرَأَيْتُكَ تَصْبُغُ بِالصُّفْرَةِ وَرَأَيْتُكَ إِذَا كُنْتَ بِمَكَّةَ أَهَلَّ النَّاسُ إِذَا رَأَوْا الْهِلَالَ وَلَمْ تُهِلَّ أَنْتَ حَتَّى كَانَ يَوْمَ التَّرْوِيَةِ فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ أَمَّا الْأَرْكَانُ فَإِنِّي لَمْ أَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمَسُّ إِلَّا الْيَمَانِيَّيْنِ وَأَمَّا النِّعَالُ السِّبْتِيَّةُ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلْبَسُ النِّعَالَ الَّتِي لَيْسَ فِيهَا شَعْرٌ وَيَتَوَضَّأُ فِيهَا فَأَنَا أُحِبُّ أَنْ أَلْبَسَهَا وَأَمَّا الصُّفْرَةُ فَإِنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْبُغُ بِهَا فَأَنَا أُحِبُّ أَنْ أَصْبُغَ بِهَا وَأَمَّا الْإِهْلَالُ فَإِنِّي لَمْ أَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُهِلُّ حَتَّى تَنْبَعِثَ بِهِ رَاحِلَتُهُ",
                "id": "Telah menceritakan kepada Kami [Al Qa'nabi] dari [Malik] dari [Sa'id bin Abu Sa'id Al Maqburi] dari ['Ubaid bin Juraij] bahwa ia berkata kepada [Abdullah bin Umar]; wahai Abu Abdurrahman, aku melihat engkau melakukan empat perkara yang tidak aku lihat seorang pun dari para sahabatmu melakukannya. Ia berkata; apakah itu wahai Ibnu Juraij? Ia berkata; aku melihatmu tidak menyentuh rukun kecuali dua rukun yamani, aku melihat engkau memakai sandal sibti (yang tidak berbulu), dan aku melihat engkau mencelup dengan shufrah (minyak yang terbuat dari campuran kunyit dan yang lainnya), dan aku melihat engkau apabila berada di Mekkah orang-orang bertalbiyah apabila melihat hilal sementara engkau tidak bertalbiyah hingga pada Hari Tarwiyah (yaitu tanggal delapan Dzul Hijjah). Kemudian Abdullah bin Umar berkata; adapun rukun, maka sesungguhnya aku tidak melihat Rasulullah shallAllahu wa'alaihi wa sallam menyentuh kecuali dua rukun Yamani, adapun sandal sibti (sandal dari yaman), maka sesungguhnya aku melihat Rasulullah shallAllahu wa'alaihi wa sallam memakai sandal yang tidak berambut, dan berwudhu dengan memakai sandal tersebut maka aku ingin memakainya, adapun shufrah, sesungguhnya aku telah melihat Rasulullah shallAllahu wa'alaihi wa sallam mencelup rambut dengan shufrah, maka aku ingin mencelup dengannya, adapun talbiyah, sesungguhnya aku tidak melihat Rasulullah shallAllahu wa'alaihi wa sallam bertalbiyah hingga kendaraan beliau berdiri. "
            },
            {
                "number": 1455,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ أَنَسٍ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ بِالْمَدِينَةِ أَرْبَعًا وَصَلَّى الْعَصْرَ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ ثُمَّ بَاتَ بِذِي الْحُلَيْفَةِ حَتَّى أَصْبَحَ فَلَمَّا رَكِبَ رَاحِلَتَهُ وَاسْتَوَتْ بِهِ أَهَلَّ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Hanbal], telah menceritakan kepada Kami [Muhammad bin Bakr], telah menceritakan kepada Kami [Ibnu Juraij] dari [Muhammad bin Al Munkadir] dari [Anas], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam melakukan sholat Zhuhur di Madinah empat raka'at, dan sholat 'Ashar Di Dzul Hulaifah dua raka'at, kemudian bermalam di Dzul Hulaifah hingga pagi hari. Kemudian tatkala beliau menaiki kendaraannya dan kendaraan tersebut telah berada di tempat yang tinggi beliau bertalbiyah. "
            },
            {
                "number": 1456,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا رَوْحٌ حَدَّثَنَا أَشْعَثُ عَنْ الْحَسَنِ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ ثُمَّ رَكِبَ رَاحِلَتَهُ فَلَمَّا عَلَا عَلَى جَبَلِ الْبَيْدَاءِ أَهَلَّ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Hanbal], telah menceritakan kepada Kami [Rauh], telah menceritakan kepada Kami [Aisyah'ats] dari [Al Hasan] dari [Anas bin Malik] bahwa Nabi shallallahu 'alaihi wasallam melakukan sholat Zhuhur kemudian menaiki kendaraannya, dan tatkala telah berada di atas gunung Baida` beliau bertalbiyah. "
            },
            {
                "number": 1457,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا وَهْبٌ يَعْنِي ابْنَ جَرِيرٍ قَالَ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ مُحَمَّدَ بْنَ إِسْحَقَ يُحَدِّثُ عَنْ أَبِي الزِّنَادِ عَنْ عَائِشَةَ بِنْتِ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَتْ قَالَ سَعْدُ بْنُ أَبِي وَقَّاصٍكَانَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَخَذَ طَرِيقَ الْفُرْعِ أَهَلَّ إِذَا اسْتَقَلَّتْ بِهِ رَاحِلَتُهُ وَإِذَا أَخَذَ طَرِيقَ أُحُدٍ أَهَلَّ إِذَا أَشْرَفَ عَلَى جَبَلِ الْبَيْدَاءِ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Basysyar], telah menceritakan kepada Kami [Wahb yaitu Ibnu Jarir], ia berkata; telah menceritakan kepada Kami [ayahku], ia berkata; saya mendengar [Muhammad bin Ishaq] menceritakan dari [Abu Az Zinad] dari [Aisyah binti Sa'd bin Abu Waqqash], ia berkata; [Sa'd bin Abu Waqqash] berkata; Nabi Shalla Allahu 'alaihi wa sallam apabila melewati jalan Al Fur' beliau bertalbiyah apabila kendaraannya sudah berada pada tempat yang tinggi, dan apabilla melewati jalan Uhud beliau bertalbiyah apabila sudah naik di atas gunung Baida`. "
            },
            {
                "number": 1458,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ عَنْ هِلَالِ بْنِ خَبَّابٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ ضُبَاعَةَ بِنْتَ الزُّبَيْرِ بْنِ عَبْدِ الْمُطَّلِبِ أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ الْحَجَّ أَشْتَرِطُ قَالَ نَعَمْ قَالَتْ فَكَيْفَ أَقُولُ قَالَ قُولِي لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ وَمَحِلِّي مِنْ الْأَرْضِ حَيْثُ حَبَسْتَنِي",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Hanbal], telah menceritakan kepada Kami ['Abbad bin Al 'Awwam] dari [Hilal bin Khabbab] dari [Ikrimah] dari [Ibnu Abbas] bahwa Dhuba'ah binti Az Zubair bin Abdul Muththalib, ia datang kepada Rasulullah shallAllahu wa'alaihi wa sallam dan berkata; wahai Rasulullah, aku inggin berhaji, apakah boleh aku mengucapkan syarat? Beliau bersabda: \"Ya.\" Ia berkata; bagaimana saya mengucapkan? Beliau bersabda: \"Ucapkan; LABBAIKALLAAHUMMA LABBAIK WA MAHALLII MINAL ARDHI HAITSU HABASTANII (Ya Allah, aku memenuhi seruanMu, dan tempatku adalah dimana Engkau menahanku). "
            },
            {
                "number": 1459,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْرَدَ الْحَجَّ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah Al Qa'nabi], telah menceritakan kepada Kami [Malik] dari [Abdurrahman bin Al Qasim] dari [ayahnya] dari [Aisyah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam melakukan haji secara ifrad (melakukan haji secara terpisah dari umrah). "
            },
            {
                "number": 1460,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ أَبِي الْأَسْوَدِ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ حَجَّةِ الْوَدَاعِ فَمِنَّا مَنْ أَهَلَّ بِعُمْرَةٍ وَمِنَّا مَنْ أَهَلَّ بِحَجٍّ وَعُمْرَةٍ وَمِنَّا مَنْ أَهَلَّ بِالْحَجِّ وَأَهَلَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَجِّ فَأَمَّا مَنْ أَهَلَّ بِالْحَجِّ أَوْ جَمَعَ الْحَجَّ وَالْعُمْرَةَ فَلَمْ يُحِلُّوا حَتَّى كَانَ يَوْمَ النَّحْرِحَدَّثَنَا ابْنُ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَالِكٌ عَنْ أَبِي الْأَسْوَدِ بِإِسْنَادِهِ مِثْلَهُ زَادَ فَأَمَّا مَنْ أَهَلَّ بِعُمْرَةٍ فَأَحَلَّ",
                "id": "Telah menceritakan kepada Kami [Al Qa'nabi Abdullah bin Maslamah] dari [Malik] dari [Abu Al Aswad Muhammad bin Abdurrahman bin Naufal] dari ['Urwah bin Az Zubair] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata; Kami keluar bersama Rasulullah shallAllahu wa'alaihi wa sallam pada tahun terjadinya haji wada'. Diantara Kami ada yang bertalbiyah untuk melakukan umrah dan diantara Kami ada yang bertalbiyah untuk melakukan haji dan umrah dan diantara Kami ada yang bertalbiyah untuk melakukan haji. Sedangkan Rasulullah shallAllahu wa'alaihi wa sallam bertalbiyah untuk melakukan haji. Adapun orang yang bertalbiyah untuk melakukan haji atau menggabungkan antara haji dan umrah, maka mereka tidak bertahallul hingga pada Hari Nahr (penyembelihan kurban). Telah menceritakan kepada Kami [Ibnu As Sarh], telah mengabarkan kepada Kami [Ibnu Wahb], telah mengabarkan kepadaku [Malik] dari [Abu Al Aswad] dengan sanadnya seperti itu. Ia menambahkan; adapun orang yang bertahlil untuk melakukan umrah maka ia bertahallul. "
            },
            {
                "number": 1461,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهَا قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ فَأَهْلَلْنَا بِعُمْرَةٍ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ مَعَهُ هَدْيٌ فَلْيُهِلَّ بِالْحَجِّ مَعَ الْعُمْرَةِ ثُمَّ لَا يَحِلُّ حَتَّى يَحِلَّ مِنْهُمَا جَمِيعًا فَقَدِمْتُ مَكَّةَ وَأَنَا حَائِضٌ وَلَمْ أَطُفْ بِالْبَيْتِ وَلَا بَيْنَ الصَّفَا وَالْمَرْوَةِ فَشَكَوْتُ ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ انْقُضِي رَأْسَكِ وَامْتَشِطِي وَأَهِلِّي بِالْحَجِّ وَدَعِي الْعُمْرَةَ قَالَتْ فَفَعَلْتُ فَلَمَّا قَضَيْنَا الْحَجَّ أَرْسَلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ إِلَى التَّنْعِيمِ فَاعْتَمَرْتُ فَقَالَ هَذِهِ مَكَانُ عُمْرَتِكِ قَالَتْ فَطَافَ الَّذِينَ أَهَلُّوا بِالْعُمْرَةِ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ ثُمَّ حَلُّوا ثُمَّ طَافُوا طَوَافًا آخَرَ بَعْدَ أَنْ رَجَعُوا مِنْ مِنًى لِحَجِّهِمْ وَأَمَّا الَّذِينَ كَانُوا جَمَعُوا الْحَجَّ وَالْعُمْرَةَ فَإِنَّمَا طَافُوا طَوَافًا وَاحِدًاقَالَ أَبُو دَاوُد رَوَاهُ إِبْرَاهِيمُ بْنُ سَعْدٍ وَمَعْمَرٌ عَنْ ابْنِ شِهَابٍ نَحْوَهُ لَمْ يَذْكُرُوا طَوَافَ الَّذِينَ أَهَلُّوا بِعُمْرَةٍ وَطَوَافَ الَّذِينَ جَمَعُوا الْحَجَّ وَالْعُمْرَةَ",
                "id": "Telah menceritakan kepada Kami [Al Qa'nabi Abdullah bin Maslamah] dari [Malik] dari [Abu Al Aswad Muhammad bin Abdurrahman bin Naufal] dari ['Urwah bin Az Zubair] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata; Kami keluar bersama Rasulullah shallAllahu wa'alaihi wa sallam pada tahun terjadinya haji wada'. Diantara Kami ada yang bertalbiyah untuk melakukan umrah dan diantara Kami ada yang bertalbiyah untuk melakukan haji dan umrah dan diantara Kami ada yang bertalbiyah untuk melakukan haji. Sedangkan Rasulullah shallAllahu wa'alaihi wa sallam bertalbiyah untuk melakukan haji. Adapun orang yang bertalbiyah untuk melakukan haji atau menggabungkan antara haji dan umrah, maka mereka tidak bertahallul hingga pada Hari Nahr (penyembelihan kurban). Abu Daud berkata; [Ibrahim bin Sa'd] dan [Ma'mar] dari [Ibnu Syihab], yang seperti itu. Ia menambahkan; adapun orang yang bertahlil untuk melakukan umrah maka ia bertahallul. "
            },
            {
                "number": 1462,
                "arab": "حَدَّثَنَا أَبُو سَلَمَةَ مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْلَبَّيْنَا بِالْحَجِّ حَتَّى إِذَا كُنَّا بِسَرِفَ حِضْتُ فَدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَبْكِي فَقَالَ مَا يُبْكِيكِ يَا عَائِشَةُ فَقُلْتُ حِضْتُ لَيْتَنِي لَمْ أَكُنْ حَجَجْتُ فَقَالَ سُبْحَانَ اللَّهِ إِنَّمَا ذَلِكَ شَيْءٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ فَقَالَ انْسُكِي الْمَنَاسِكَ كُلَّهَا غَيْرَ أَنْ لَا تَطُوفِي بِالْبَيْتِ فَلَمَّا دَخَلْنَا مَكَّةَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ شَاءَ أَنْ يَجْعَلَهَا عُمْرَةً فَلْيَجْعَلْهَا عُمْرَةً إِلَّا مَنْ كَانَ مَعَهُ الْهَدْيُ قَالَتْ وَذَبَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نِسَائِهِ الْبَقَرَ يَوْمَ النَّحْرِ فَلَمَّا كَانَتْ لَيْلَةُ الْبَطْحَاءِ وَطَهُرَتْ عَائِشَةُ قَالَتْ يَا رَسُولَ اللَّهِ أَتَرْجِعُ صَوَاحِبِي بِحَجٍّ وَعُمْرَةٍ وَأَرْجِعُ أَنَا بِالْحَجِّ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرٍ فَذَهَبَ بِهَا إِلَى التَّنْعِيمِ فَلَبَّتْ بِالْعُمْرَةِ",
                "id": "Telah menceritakan kepada Kami [Abu Salamah Musa bin Isma'il], telah menceritakan kepada Kami [Hammad] dari [Abdurrahman bin Al Qasim] dari [ayahnya] dari [Aisyah] bahwa ia berkata; Kami bertalbiyah untuk melakukan haji, hingga setelah Kami berada di Saraf aku mengalami haid. Kemudian Rasulullah shallAllahu wa'alaihi wa sallam menemuiku sementara aku sedang dalam keadaan menangis. Lalu beliau berkata: \"Apa yang menyebabkanmu menangis wahai Aisyah?\" Aku katakan; aku telah mengalami haid, seandainya aku belum melakukan haji. Kemudian beliau bersabda: \"SubhanAllah, sesungguhnya hal tersebut adalah sesuatu yang telah Allah tetapkan pada anak-anak wanita Adam.\" Kemudian beliau bersabda: \"Lakukanlah seluruh ibadah haji, hanya saja janganlah engkau melakukan thawaf di Ka'bah.\" Kemudian tatkala Kami memasuki Mekkah Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barang siapa yang menghendaki untuk menjadikannya sebagai umrah maka silahkan ia menjadikannya umrah, kecuali orang yang membawa hewan kurban.\" Aisyah berkata; Rasulullah shallAllahu wa'alaihi wa sallam menyembelihkan kurban untuk para isterinya satu ekor sapi pada hari Nahr. Kemudian tatkala pada malam singgah di Buthha` dan Aisyah telah suci, Aisyah berkata; wahai Rasulullah, apakah teman-temanku kembali dengan melakukan haji dan umrah sementara aku kembali hanya dengan melakukan haji? Kemudian Rasulullah shallAllahu wa'alaihi wa sallam memerintahkan Abdurrahman bin Abu Bakr untuk pergi ke Tan'im, kemudian ia bertalbiyah untuk melakukan umrah. "
            },
            {
                "number": 1463,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ الذُّهَلِيُّ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا يُونُسُ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ لَمَّا سُقْتُ الْهَدْيَ قَالَ مُحَمَّدٌ أَحْسَبُهُ قَالَ وَلَحَلَلْتُ مَعَ الَّذِينَ أَحَلُّوا مِنْ الْعُمْرَةِقَالَ أَرَادَ أَنْ يَكُونَ أَمْرُ النَّاسِ وَاحِدًا",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Yahya bin Faris Adz Dzuhali], telah menceritakan kepada Kami [Utsman bin Umar], telah mengabarkan kepada Kami [Yunus] dari [Az Zuhri] dari ['Urwah] dari [Aisyah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Jika dulu tampak kepadaku perkara yang terlihat saat ini maka aku tidak akan berkurban dan aku akan menjadikannya sebagai umrah.\" Muhammad berkata; aku mengira beliau berkata: \"dan niscaya aku akan bertahallul bersama orang-orang yang bertahallul dari melakukan umrah.\" Ia berkata; beliau menghendaki kondisi semua orang adalah satu. "
            },
            {
                "number": 1464,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَأَقْبَلْنَا مُهِلِّينَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَجِّ مُفْرَدًا وَأَقْبَلَتْ عَائِشَةُ مُهِلَّةً بِعُمْرَةٍ حَتَّى إِذَا كَانَتْ بِسَرِفَ عَرَكَتْ حَتَّى إِذَا قَدِمْنَا طُفْنَا بِالْكَعْبَةِ وَبِالصَّفَا وَالْمَرْوَةِ فَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُحِلَّ مِنَّا مَنْ لَمْ يَكُنْ مَعَهُ هَدْيٌ قَالَ فَقُلْنَا حِلُّ مَاذَا فَقَالَ الْحِلُّ كُلُّهُ فَوَاقَعْنَا النِّسَاءَ وَتَطَيَّبْنَا بِالطِّيبِ وَلَبِسْنَا ثِيَابَنَا وَلَيْسَ بَيْنَنَا وَبَيْنَ عَرَفَةَ إِلَّا أَرْبَعُ لَيَالٍ ثُمَّ أَهْلَلْنَا يَوْمَ التَّرْوِيَةِ ثُمَّ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى عَائِشَةَ فَوَجَدَهَا تَبْكِي فَقَالَ مَا شَأْنُكِ قَالَتْ شَأْنِي أَنِّي قَدْ حِضْتُ وَقَدْ حَلَّ النَّاسُ وَلَمْ أَحْلُلْ وَلَمْ أَطُفْ بِالْبَيْتِ وَالنَّاسُ يَذْهَبُونَ إِلَى الْحَجِّ الْآنَ فَقَالَ إِنَّ هَذَا أَمْرٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ فَاغْتَسِلِي ثُمَّ أَهِلِّي بِالْحَجِّ فَفَعَلَتْ وَوَقَفَتْ الْمَوَاقِفَ حَتَّى إِذَا طَهُرَتْ طَافَتْ بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ ثُمَّ قَالَ قَدْ حَلَلْتِ مِنْ حَجِّكِ وَعُمْرَتِكِ جَمِيعًا قَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أَجِدُ فِي نَفْسِي أَنِّي لَمْ أَطُفْ بِالْبَيْتِ حِينَ حَجَجْتُ قَالَ فَاذْهَبْ بِهَا يَا عَبْدَ الرَّحْمَنِ فَأَعْمِرْهَا مِنْ التَّنْعِيمِ وَذَلِكَ لَيْلَةُ الْحَصْبَةِحَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا قَالَ دَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى عَائِشَةَ بِبَعْضِ هَذِهِ الْقِصَّةِ قَالَ عِنْدَ قَوْلِهِ وَأَهِلِّي بِالْحَجِّ ثُمَّ حُجِّي وَاصْنَعِي مَا يَصْنَعُ الْحَاجُّ غَيْرَ أَنْ لَا تَطُوفِي بِالْبَيْتِ وَلَا تُصَلِّي",
                "id": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id], Telah menceritakan kepada Kami [Al Laits] dari [Abu Az Zubair] dari [Jabir], ia berkata; Kami datang dalam keadaan bertalbiyah bersama Rasulullah shallAllahu wa'alaihi wa sallam untuk melakukan haji ifrad, sedangkan Aisyah datang dalam keadaan bertalbiyah untuk melakukan umrah hingga setelah ia sampai di Saraf, ia mengalami haid, hingga setalah Kami datang, Kami melakukan thawaf di Ka'bah dan di Shafa serta Marwa. Kemudian Rasulullah shallAllahu wa'alaihi wa sallam memerintahkan Kami agar orang yang tidak membawa hewan kurban melakukan tahallul. Kemudian Kami katakan; tahallul apa? Beliau mengatakan; tahallul secara menyeluruh. Kemudian Kami bercampur dengan para isteri Kami dan memakai minyak wangi, serta memakai pakaian Kami dan antara Kami dan 'Arafah hanya berjarak empat malam. Kemudian Kami bertalbiyah pada hari Tarwiyah. Kemudian Rasulullah shallAllahu wa'alaihi wa sallam menemui Aisyah dan mendapatinya dalam keadaan menangis. Lalu beliau berkata: \"Ada apa denganmu?\" Ia berkata; aku telah mengalami haid, orang-orang telah bertahallul, sementara aku belum bertahallul, dan belum melakukan thawaf di Ka'bah, serta orang-orang sedang pergi untuk melakukan haji sekarang. Kemudian beliau bersabda: \"Sesungguhnya hal ini adalah perkara yang telah Allah tetapkan atas anak-anak wanita Adam, maka mandilah, kemudian bertalbiyahlah untuk melakukan haji.\" Kemudian ia melakukannya dan berwukuf di tempat-tempat wukuf hingga setelah suci ia berthawaf di Ka'bah, serta Shafa dan Marwa. Kemudian beliau berkata: \"Engkau telah bertahallul dari haji dan umrahmu semua.\" Aisyah berkata; wahai Rasulullah, aku mendapati dalam perasaanku bahwa aku belum melakukan thawaf di Ka'bah ketika aku melakukan haji. Beliau bersabda: \"Wahai Abdurrahman, pergilah bersamanya dan umrahkanlah ia dari Tan'im.\" Dan hal tersebut terjadi pada malam hishbah (ketika singgah di Mihshab). Telah menceritakan kepada Kami [Ahmad bin Hanbal], ia berkata; telah menceritakan kepada Kami [Yahya bin Sa'id] dari [Ibnu Juraij], ia berkata; telah mengabarkan kepadaku [Abu Az Zubair] bahwa ia mendengar [Jabir] berkata; Nabi shallallahu 'alaihi wasallam menemui Aisyah …. -ia menceritakan sebagian kisah ini-, ia menyebutkan perkataan Rasulullah shallAllahu wa'alaihi wa sallam: \"dan bertalbiyahlah untuk melakukan haji, kemudian lakukan haji serta kerjakan apa yang dilakukan orang yang melakukan haji, hanya saja janganlah engkau melakukan thawaf di Ka'bah dan jangan melakukan sholat.\""
            },
            {
                "number": 1465,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ قَيْسِ بْنِ سَعْدٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ جَابِرٍ قَالَقَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ لِأَرْبَعِ لَيَالٍ خَلَوْنَ مِنْ ذِي الْحِجَّةِ فَلَمَّا طَافُوا بِالْبَيْتِ وَبِالصَّفَا وَالْمَرْوَةِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْعَلُوهَا عُمْرَةً إِلَّا مَنْ كَانَ مَعَهُ الْهَدْيَ فَلَمَّا كَانَ يَوْمُ التَّرْوِيَةِ أَهَلُّوا بِالْحَجِّ فَلَمَّا كَانَ يَوْمُ النَّحْرِ قَدِمُوا فَطَافُوا بِالْبَيْتِ وَلَمْ يَطُوفُوا بَيْنَ الصَّفَا وَالْمَرْوَةِ",
                "id": "Telah menceritakan kepada Kami [Musa bin Isma'il], telah menceritakan kepada Kami [Hammad], dari [Qais bin Sa'd] dari ['Atho` bin Abu Rabah] dari [Jabir], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam datang bersama para sahabatnya selama empat malam selain malam Bulan Dzul Hijjah. Kemudian tatkala mereka telah melakukan thawaf di Ka'bah dan Shafa serta Marwa, Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Jadikanlah umrah, kecuali orang yang membawa hewan kurban.\" Kemudian pada saat Hari Tarwiyah, mereka bertalbiyah untuk melakukan haji. Dan ketika Hari Nahr mereka datang dan melakukan thawaf di Ka'bah, dan tidak berthawaf di Shafa serta Marwa. "
            },
            {
                "number": 1466,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ حَدَّثَنَا حَبِيبٌ يَعْنِي الْمُعَلِّمَ عَنْ عَطَاءٍ حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهَلَّ هُوَ وَأَصْحَابُهُ بِالْحَجِّ وَلَيْسَ مَعَ أَحَدٍ مِنْهُمْ يَوْمَئِذٍ هَدْيٌ إِلَّا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَطَلْحَةَ وَكَانَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ قَدِمَ مِنْ الْيَمَنِ وَمَعَهُ الْهَدْيُ فَقَالَ أَهْلَلْتُ بِمَا أَهَلَّ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ أَصْحَابَهُ أَنْ يَجْعَلُوهَا عُمْرَةً يَطُوفُوا ثُمَّ يُقَصِّرُوا وَيُحِلُّوا إِلَّا مَنْ كَانَ مَعَهُ الْهَدْيُ فَقَالُوا أَنَنْطَلِقُ إِلَى مِنًى وَذُكُورُنَا تَقْطُرُ فَبَلَغَ ذَلِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَوْ أَنِّي اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ مَا أَهْدَيْتُ وَلَوْلَا أَنَّ مَعِي الْهَدْيَ لَأَحْلَلْتُ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Hanbal], telah menceritakan kepada Kami [Abdul Wahhab Ats Tsaqafi], telah menceritakan kepada Kami [Habib yaitu Al Mu'allim] dari ['Atho`], telah menceritakan kepada Kami [Jabir bin Abdullah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam melakukan talbiyah bersama para sahabatnya untuk melakukan haji, dan pada saat itu tidak ada seorang pun diantara mereka yang membawa hewan kurban kecuali Nabi shallallahu 'alaihi wasallam dan Thalhah. Ali radliallahu 'anhu datang dari Yaman dengan membawa hewan kurban, kemudian ia berkata; aku bertalbiyah seperti talbiyah Rasulullah shallAllahu wa'alaihi wa sallam. Dan Nabi shallallahu 'alaihi wasallam memerintahkan para sahabatnya agar menjadikannya umrah, mereka melakukan thawaf dan mencukur rambut serta bertahallul, kecuali orang yang membawa hewan kurban. Kemudian mereka berkata; apakah Kami pergi ke Mina, sementara dzakar-dzakar Kami meneteskan mani? Kemudian hal tersebut sampai kepada Rasulullah shallAllahu wa'alaihi wa sallam, lalu beliau berkata: \"Jika dulu tampak kepadaku perkara yang terlihat saat ini maka aku tidak akan berkurban, dan seandainya aku tidak membawa hewan kurban niscaya aku akan bertahallul.\""
            },
            {
                "number": 1467,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ أَنَّ مُحَمَّدَ بْنَ جَعْفَرٍ حَدَّثَهُمْ عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ هَذِهِ عُمْرَةٌ اسْتَمْتَعْنَا بِهَا فَمَنْ لَمْ يَكُنْ عِنْدَهُ هَدْيٌ فَلْيُحِلَّ الْحِلَّ كُلَّهُ وَقَدْ دَخَلَتْ الْعُمْرَةُ فِي الْحَجِّ إِلَى يَوْمِ الْقِيَامَةِقَالَ أَبُو دَاوُد هَذَا مُنْكَرٌ إِنَّمَا هُوَ قَوْلُ ابْنِ عَبَّاسٍ",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah] bahwa [Muhammad bin Ja'far] telah menceritakan kepada mereka dari [Syu'bah] dari [Al Hakam] dari [Mujahid] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Ini adalah umrah yang kita nikmati, barang siapa yang tidak membawa hewan kurban maka hendaknya ia bertahallul secara menyeluruh, sungguh umrah telah masuk dalam haji hingga hari Kiamat.\" Abu Daud berkata; ini adalah hadits munkar, hal tersebut adalah perkataan Ibnu Abbas. "
            },
            {
                "number": 1468,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ شَوْكَرٍ وَأَحْمَدُ بْنُ مَنِيعٍ قَالَا حَدَّثَنَا هُشَيْمٌ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ قَالَ ابْنُ مَنِيعٍ أَخْبَرَنَا يَزِيدُ بْنُ أَبِي زِيَادٍ الْمَعْنَى عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَأَهَلَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَجِّ فَلَمَّا قَدِمَ طَافَ بِالْبَيْتِ وَبَيْنَ الصَّفَا وَالْمَرْوَةِ وَقَالَ ابْنُ شَوْكَرٍ وَلَمْ يُقَصِّرْ ثُمَّ اتَّفَقَا وَلَمْ يُحِلَّ مِنْ أَجْلِ الْهَدْيِ وَأَمَرَ مَنْ لَمْ يَكُنْ سَاقَ الْهَدْيَ أَنْ يَطُوفَ وَأَنْ يَسْعَى وَيُقَصِّرَ ثُمَّ يُحِلَّ زَادَ ابْنُ مَنِيعٍ فِي حَدِيثِهِ أَوْ يَحْلِقَ ثُمَّ يُحِلَّ",
                "id": "Telah menceritakan kepada Kami [Al Hasan bin Syaukar], dan [Ahmad bin Mani'], mereka berkata; telah menceritakan kepada Kami [Husyaim] dari [Yazid bin Abu Ziyad], [Ibnu Mani'] berkata; telah mengabarkan kepada Kami [Yazid bin Abu Ziyad] secara makna dari [Mujahid] dari [Ibnu Abbas], ia berkata; Nabi shallallahu 'alaihi wasallam bertalbiyah untuk melakukan haji, kemudian tatkala datang, beliau berthawaf di Ka'bah, dan Shafa serta Marwa. Ibnu Syaukar berkata; dan beliau tidak mencukur rambut, kemudian keduanya bersepakat (dalam kalimat selanjutnya); dan beliau tidak bertahallul karena keberadaan hewan kurban, dan beliau memerintahkan orang yang tidak menuntun hewan kurban agar berthawaf dan bersa'i serta mencukur rambut, kemudian bertahallul. Ibnu Mani' dalam haditsnya menambahkan; atau menggundul rambut kemudian bertahallul."
            },
            {
                "number": 1469,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ قَالَ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يَحْيَى بْنُ أَبِي إِسْحَقَ وَعَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ وَحُمَيْدٌ الطَّوِيلُ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُمْ سَمِعُوهُ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُلَبِّي بِالْحَجِّ وَالْعُمْرَةِ جَمِيعًا يَقُولُ لَبَّيْكَ عُمْرَةً وَحَجًّا لَبَّيْكَ عُمْرَةً وَحَجًّا",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Hanbal], ia berkata; telah menceritakan kepada Kami [Husyaim], telah mengabarkan kepada Kami [Yahya bin Abu Ishaq] dan [Abdul Aziz bin Shuhaib] serta [Humaid Ath Thawil] dari [Anas bin Malik] bahwa mereka mendengarnya berkata; saya mendengar Rasulullah shallAllahu wa'alaihi wa sallam bertalbiyah untuk melakukan haji dan umrah secara bersamaan. Beliau mengucapkan: \"Labbaika 'umratan wa hajjan, labbaika 'umratan wa hajjan (aku memenuhi seruanMu untuk melakukan umrah dan haji.\""
            },
            {
                "number": 1470,
                "arab": "حَدَّثَنَا أَبُو سَلَمَةَ مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَاتَ بِهَا يَعْنِي بِذِي الُحُلَيْفَةِ حَتَّى أَصْبَحَ ثُمَّ رَكِبَ حَتَّى إِذَا اسْتَوَتْ بِهِ عَلَى الْبَيْدَاءِ حَمِدَ اللَّهُ وَسَبَّحَ وَكَبَّرَ ثُمَّ أَهَلَّ بِحَجٍّ وَعُمْرَةٍ وَأَهَلَّ النَّاسُ بِهِمَا فَلَمَّا قَدِمْنَا أَمَرَ النَّاسَ فَحَلُّوا حَتَّى إِذَا كَانَ يَوْمُ التَّرْوِيَةِ أَهَلُّوا بِالْحَجِّ وَنَحَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبْعَ بَدَنَاتٍ بِيَدِهِ قِيَامًاقَالَ أَبُو دَاوُد الَّذِي تَفَرَّدَ بِهِ يَعْنِي أَنَسًا مِنْ هَذَا الْحَدِيثِ أَنَّهُ بَدَأَ بِالْحَمْدِ وَالتَّسْبِيحِ وَالتَّكْبِيرِ ثُمَّ أَهَلَّ بِالْحَجِّ",
                "id": "Telah menceritakan kepada Kami [Abu Salamah Musa bin Isma'il], telah menceritakan kepada Kami [Wuhaib], telah menceritakan kepada Kami [Ayyub] dari [Abu Qilabah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam bermalam di sana yaitu di Dzul Hulaifah hingga pagi hari, kemudian menaiki kendaraan hingga setelah berada di atas Baida` beliau memuji Allah dan bertasbih serta bertakbir. Kemudian beliau bertalbiyah untuk melakukan haji dan umrah, dan orang-orang bertalbiyah untuk melakukan keduanya. Kemudian tatkala Kami datang beliau memerintahkan orang-orang agar bertahallul hingga ketika pada Hari Tarwiyah mereka bertalbiyah untuk melakukan haji, dan Rasulullah shallAllahu wa'alaihi wa sallam menyembelih tujuh unta dengan tangannya dalam keadaan berdiri. Abu Daud berkata; yang menjadi diriwayatkan Anas sendiri dari hadits ini adalah bahwa beliau memulai dengan memuji, bertasbih serta bertakbir kemudian bertalbiyah untuk melakukan haji. "
            }
        ]
    }
}