{
    "status": true,
    "data": {
        "start": 883,
        "end": 1029,
        "total": 147,
        "book": "abu-daud",
        "hadits": [
            {
                "number": 883,
                "arab": "حَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ حَدَّثَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ نَافِعٍ قَالَ نَادَى ابْنُ عُمَرَ بِالصَّلَاةِ بِضَجْنَانَ ثُمَّ نَادَى أَنْ صَلُّوا فِي رِحَالِكُمْقَالَ فِيهِ ثُمَّ حَدَّثَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَأْمُرُ الْمُنَادِيَ فَيُنَادِي بِالصَّلَاةِ ثُمَّ يُنَادِي أَنْ صَلُّوا فِي رِحَالِكُمْ فِي اللَّيْلَةِ الْبَارِدَةِ وَفِي اللَّيْلَةِ الْمَطِيرَةِ فِي السَّفَرِقَالَ أَبُو دَاوُد وَرَوَاهُ حَمَّادُ بْنُ سَلَمَةَ عَنْ أَيُّوبَ وَعُبَيْدِ اللَّهِ قَالَ فِيهِ فِي السَّفَرِ فِي اللَّيْلَةِ الْقَرَّةِ أَوْ الْمَطِيرَةِ",
                "id": "Telah menceritakan kepada kami [Mu'ammal bin Hisyam] telah menceritakan kepada kami [Isma'il] dari [Ayyub] dri [Nafi'] dia berkata; [Ibnu Umar] pernah menyerukan untuk sholat ketika di Dlajnan, kemudian dia berseru; \"sholatlah kalian di persinggahan kalian.\" Dalam hadits ini, dia juga berkata; \"Kemudian Ibnu Umar menuturkan dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau menyuruh mu'adzinnya untuk menyerukan sholat, kemudian seseorang menyeru; 'Hendaknya kalian sholat di persinggahan kalian ketika malam yang dingin mencekam, dan ketika malam hujan, serta dalam perjalanan.\" Abu Daud mengatakan; \"Di riwayatkan pula oleh [Hammad bin Salamah] dari [Ayyub] dan ['ubaidhullah], dalam hadits tersebut dia mengatakan; \" yaitu ketika dalam perjalanan dan di saat dinginnnya malam atau hujan.\""
            },
            {
                "number": 884,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ نَادَى بِالصَّلَاةِ بِضَجْنَانَ فِي لَيْلَةٍ ذَاتِ بَرْدٍ وَرِيحٍ فَقَالَ فِي آخِرِ نِدَائِهِ أَلَا صَلُّوا فِي رِحَالِكُمْ أَلَا صَلُّوا فِي الرِّحَالِثُمَّ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ الْمُؤَذِّنَ إِذَا كَانَتْ لَيْلَةٌ بَارِدَةٌ أَوْ ذَاتُ مَطَرٍ فِي سَفَرٍ يَقُولُ أَلَا صَلُّوا فِي رِحَالِكُمْ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwa dirinya menyerukan untuk sholat ketika di daerah Dlajnan pada malam yang sangat dingin dan berangin, di akhir seruannya dia mengatakan; \"Ingatlah, sholatlah kalian di persinggahan kalian, sholatlah kalian di persinggahan.\" Selanjutnya dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah memerintahkan Mu'adzinnya apabila malam sangat dingin atau hujan ketika dalam perjalanan, dengan sabdanya: \"Ingatlah, sholatlah kalian di persinggahan kalian masing-masing.\""
            },
            {
                "number": 885,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ يَعْنِي أَذَّنَ بِالصَّلَاةِ فِي لَيْلَةٍ ذَاتِ بَرْدٍ وَرِيحٍ فَقَالَ أَلَا صَلُّوا فِي الرِّحَالِ ثُمَّ قَالَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ الْمُؤَذِّنَ إِذَا كَانَتْ لَيْلَةٌ بَارِدَةٌ أَوْ ذَاتُ مَطَرٍ يَقُولُ أَلَا صَلُّوا فِي الرِّحَالِحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ نَادَى مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذَلِكَ فِي الْمَدِينَةِ فِي اللَّيْلَةِ الْمَطِيرَةِ وَالْغَدَاةِ الْقَرَّةِ قَالَ أَبُو دَاوُد وَرَوَى هَذَا الْخَبَرَ يَحْيَى بْنُ سَعِيدٍ الْأَنْصَارِيُّ عَنْ الْقَاسِمِ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيهِ فِي السَّفَرِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Nafi'] bahwa [Ibnu Umar] yaitu (dia) adzan untuk mengerjakan sholat di saat malam yang sangat dingin dan berangin, katanya; \"sholatlah kalian di persinggahan.\" Kemudian dia berkata; \" Rasulullah shallallahu 'alaihi wasallam pernah memerintahkan Mu'adzinnya, apabila malam sangat dingin atau hujan, beliau bersabda: \"sholatlah kalian di persinggahan.\" Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Muhammad bin Maslamah] dari [Muhammad bin Ishaq] dari [Nafi'] dari [Ibnu Umar] dia berkata; \"Sorang penyeru Rasulullah shallallahu 'alaihi wasallam pernah menyerukan seperti itu ketika di Madinah yaitu di malam yang hujan dan di pagi yang sangat dingin.\" Abu Daud mengatakan; \"Haidts ini juga di riwayatkan oleh [Yahya bin Sa'id Al Anshari] dari [Al Qasim] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, dalam hadits itu dia berkata; \"…dan dalam perjalanan.\""
            },
            {
                "number": 886,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَمُطِرْنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُصَلِّ مَنْ شَاءَ مِنْكُمْ فِي رَحْلِهِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Al Fadl bin Dukain] telah menceritakan kepada kami [Zuhair] dari [Abu Az Zubair] dari [Jabir] dia berkata; \"Kami bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan, lalu kami kehujanan, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaknya seseorang sholat di persinggahannya bagi yang berkehendak.\""
            },
            {
                "number": 887,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا إِسْمَعِيلُ أَخْبَرَنِي عَبْدُ الْحَمِيدِ صَاحِبُ الزِّيَادِيِّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ ابْنِ عَمِّ مُحَمَّدِ بْنِ سِيرِينَ أَنَّ ابْنَ عَبَّاسٍقَالَ لِمُؤَذِّنِهِ فِي يَوْمٍ مَطِيرٍ إِذَا قُلْتُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ فَلَا تَقُلْ حَيَّ عَلَى الصَّلَاةِ قُلْ صَلُّوا فِي بُيُوتِكُمْ فَكَأَنَّ النَّاسَ اسْتَنْكَرُوا ذَلِكَ فَقَالَ قَدْ فَعَلَ ذَا مَنْ هُوَ خَيْرٌ مِنِّي إِنَّ الْجُمُعَةَ عَزْمَةٌ وَإِنِّي كَرِهْتُ أَنْ أُخْرِجَكُمْ فَتَمْشُونَ فِي الطِّينِ وَالْمَطَرِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Isma'il] telah mengabarkan kepadaku [Abdul Hamid] salah seorang sahabatnya Az Ziyadi, telah menceritakan kepada kami [Abdullah bin Al Harits] sepupunya Muhammad bin Sirin, bahwa [Ibnu Abbas] berkata kepada Mu'adzinnya ketika hujan lebat; \"Jika aku mengucapkan; \"asyhadu anna Muhammadan Rasulullah\" maka jangan kamu teruskan dengan; \"Hayya 'alas shalah\" tapi serukanlah; \"Shalluu fii buyuutikum (sholatlah kalian di rumah kalian masing-masing.\" Mendengar hal itu, orang-orang banyak mengingkarinya, maka Ibnu Abbas berkata; \"Yang demikian itu telah di kerjakan oleh orang-orang yang lebih baik daripadaku, sesungguhnya jum'at merupakan suatu kewajiban, namun aku tidak bermaksud menyuruh kalian keluar rumah melalui jalan yang berlumpur lagi becek.\""
            },
            {
                "number": 888,
                "arab": "حَدَّثَنَا عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا هُرَيْمٌ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ قَيْسِ بْنِ مُسْلِمٍ عَنْ طَارِقِ بْنِ شِهَابٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْجُمُعَةُ حَقٌّ وَاجِبٌ عَلَى كُلِّ مُسْلِمٍ فِي جَمَاعَةٍ إِلَّا أَرْبَعَةً عَبْدٌ مَمْلُوكٌ أَوْ امْرَأَةٌ أَوْ صَبِيٌّ أَوْ مَرِيضٌقَالَ أَبُو دَاوُد طَارِقُ بْنُ شِهَابٍ قَدْ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَسْمَعْ مِنْهُ شَيْئًا",
                "id": "Telah menceritakan kepada kami ['Abbas bin 'Abdul 'Adzim] telah menceritakan kepadaku [Ishaq bin Manshur] telah menceritakan kepada kami [Huraim] dari [Ibrahim bin Muhammad Al Muntasyir] dari [Qais bin Muslim] dari [Thariq bin Syihab] dari Nabi shallallahu 'alaihi wasallam beliau bersabda; \"Jum'at itu wajib bagi setiap Muslim dengan berjama'ah, kecuali empat golongan, yaitu; hamba sahaya, wanita, anak-anak dan orang yang sakit.\" Abu Daud berkata; \"Thariq bin Ziyad pernah melihat (hidup semasa) Nabi shallallahu 'alaihi wasallam, namun dirinya tidak mendengar sesuatu pun dari beliau.\""
            },
            {
                "number": 889,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْمُخَرِّمِيُّ لَفْظُهُ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ عَنْ أَبِي جَمْرَةَ عَنْ ابْنِ عَبَّاسٍ قَالَإِنَّ أَوَّلَ جُمُعَةٍ جُمِّعَتْ فِي الْإِسْلَامِ بَعْدَ جُمُعَةٍ جُمِّعَتْ فِي مَسْجِدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ لَجُمُعَةٌ جُمِّعَتْ بِجَوْثَاءَ قَرْيَةٌ مِنْ قُرَى الْبَحْرَيْنِقَالَ عُثْمَانُ قَرْيَةٌ مِنْ قُرَى عَبْدِ الْقَيْسِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syiabah] dan [Muhammad bin Abdullah Al Muharami] secara lafaadz, keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Ibrahim bin Thahman] dari [Abu Jamrah] dari [Ibnu Abbas] dia berkata; \"sholat jum'at yang pertama kali dalam Islam setelah sholat Jum'at yang di laksanakan di masjid Rasulullah shallallahu 'alaihi wasallam di Madinah, adalah sholat Jum'at di desa Juwatsa, yaitu suatu desa yang terletak di daerah Bahrain.\" Utsman mengatakan; 'Yaitu suatu desa yang terletak di wilayah (Bani) Abdul Qais.\""
            },
            {
                "number": 890,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ أَبِي أُمَامَةَ بْنِ سَهْلٍ عَنْ أَبِيهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ وَكَانَ قَائِدَ أَبِيهِ بَعْدَ مَا ذَهَبَ بَصَرُهُ عَنْ أَبِيهِ كَعْبِ بْنِ مَالِكٍأَنَّهُ كَانَ إِذَا سَمِعَ النِّدَاءَ يَوْمَ الْجُمُعَةِ تَرَحَّمَ لِأَسْعَدَ بْنِ زُرَارَةَ فَقُلْتُ لَهُ إِذَا سَمِعْتَ النِّدَاءَ تَرَحَّمْتَ لِأَسْعَدَ بْنِ زُرَارَةَ قَالَ لِأَنَّهُ أَوَّلُ مَنْ جَمَّعَ بِنَا فِي هَزْمِ النَّبِيتِ مِنْ حَرَّةِ بَنِي بَيَاضَةَ فِي نَقِيعٍ يُقَالُ لَهُ نَقِيعُ الْخَضَمَاتِ قُلْتُ كَمْ أَنْتُمْ يَوْمَئِذٍ قَالَ أَرْبَعُونَ",
                "id": "telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ibnu Idris] dari [Muhammad bin Ishaq] dari [Muhammad bin Abu Umamah bin Sahl] dari [ayahnya] dari [Abdurrahman bin Ka'b bin Malik] -dia adalah seorang yang selalu menuntun ayahnya setelah ayahnya buta- dari [ayahnya yaitu Ka'ab bin Malik] bahwa apabila dia mendengar adzan pada hari jum'at, dia memohonkan rahmat untuk As'ad bin Zurarah. Lantas aku bertanya kepadanya; \"Mengapa anda memohonkan rahmat untk as'ad bin Zurarah setiap kali mendengar adzan Jum'at?\" jawabnya; Karena dia adalah orang yang pertama kali sebagai pelopor pelaksanaan sholat Jum'at di tengah-tengah kami di Hazmin-nabit, yang terletak di Bani Bayadhah di Baqi', yaitu Naqi'ul Khadhamat.\" Aku bertanya; \"Berapakah jumlah kalian ketika itu?\" dia menjawab; \"Empat puluh orang.\""
            },
            {
                "number": 891,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا إِسْرَائِيلُ حَدَّثَنَا عُثْمَانُ بْنُ الْمُغِيرَةِ عَنْ إِيَاسِ بْنِ أَبِي رَمْلَةَ الشَّامِيِّ قَالَشَهِدْتُ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ وَهُوَ يَسْأَلُ زَيْدَ بْنَ أَرْقَمَ قَالَ أَشَهِدْتَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِيدَيْنِ اجْتَمَعَا فِي يَوْمٍ قَالَ نَعَمْ قَالَ فَكَيْفَ صَنَعَ قَالَ صَلَّى الْعِيدَ ثُمَّ رَخَّصَ فِي الْجُمُعَةِ فَقَالَ مَنْ شَاءَ أَنْ يُصَلِّيَ فَلْيُصَلِّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin katsir] telah mengabarkan kepada kami [Isra`il] telah menceritakan kepada kami [Utsman bin Al Mughirah] dari [Iyas Ibnu Abu Ramlah As Syami] dia berkata; aku pernah melihat Mu'awiyah bin Abu Sufyan bertanya kepada Zaid bin Arqam, tanyanya; \"Apakah kamu pernah melakukan dua hari raya bertepatan dalam satu hari ketika bersama Rasulullah shallallahu 'alaihi wasallam?\" Jawabnya; \"Ya. ' Mu'awiyah bertanya; \"Bagaimana beliau mengerjakan sholat tersebut?\" [Zaid bin Arqam] menjawab; \"Beliau mengerjakan sholat ied dan memberi keringanan pada waktu sholat Jum'at, lalu beliau bersabda: \"Barangsiapa ingin mengerjakan (sholat Jum'at), hendaknya mengerjakan sholat (Jum'at).\""
            },
            {
                "number": 892,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ الْبَجَلِيُّ حَدَّثَنَا أَسْبَاطٌ عَنْ الْأَعْمَشِ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ قَالَصَلَّى بِنَا ابْنُ الزُّبَيْرِ فِي يَوْمِ عِيدٍ فِي يَوْمِ جُمُعَةٍ أَوَّلَ النَّهَارِ ثُمَّ رُحْنَا إِلَى الْجُمُعَةِ فَلَمْ يَخْرُجْ إِلَيْنَا فَصَلَّيْنَا وُحْدَانًا وَكَانَ ابْنُ عَبَّاسٍ بِالطَّائِفِ فَلَمَّا قَدِمَ ذَكَرْنَا ذَلِكَ لَهُ فَقَالَ أَصَابَ السُّنَّةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Tharif Al Bajali] telah menceritakan kepada kami [Asbath] dari [Al A'masy] dari [Atha' bin Abu Rabah] dia berkata; [Ibnu Zubair] sholat bersama kami pada hari raya di hari jum'at, di awal hari, kemudian kami berangkat untuk melaksanakan sholat jum'at, namun dia tidak keluar untuk mengimami kami, akhirnya kami sholat sendiri-sendiri, ketika itu [Ibnu Abbas] sedang berada di thaif, setelah datang, kami sampaikan hal itu kepadanya, dia menjawab; \"Dia (Ibnu Zubair) benar telah melaksanakan sunnah.\""
            },
            {
                "number": 893,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ قَالَ قَالَ عَطَاءٌاجْتَمَعَ يَوْمُ جُمُعَةٍ وَيَوْمُ فِطْرٍ عَلَى عَهْدِ ابْنِ الزُّبَيْرِ فَقَالَ عِيدَانِ اجْتَمَعَا فِي يَوْمٍ وَاحِدٍ فَجَمَعَهُمَا جَمِيعًا فَصَلَّاهُمَا رَكْعَتَيْنِ بُكْرَةً لَمْ يَزِدْ عَلَيْهِمَا حَتَّى صَلَّى الْعَصْرَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Khalaf] telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dia berkata; ['Atha'] berkata; Hari raya ied dan hari Jum'at pernah bertepatan pada masa [Ibnu Zubair], lalu dia berkata; \"Dua hari raya telah bertepatan dalam satu hari, maka keduanya di kumpulkan (oleh Nabi), dan sholat dua rak'at di pagi hari, tidak menambah dua raka'at, hingga beliau sholat Ashar.\""
            },
            {
                "number": 894,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى وَعُمَرُ بْنُ حَفْصٍ الْوَصَّابِيُّ الْمَعْنَى قَالَا حَدَّثَنَا بَقِيَّةُ حَدَّثَنَا شُعْبَةُ عَنْ الْمُغِيرَةِ الضَّبِّيِّ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ قَدْ اجْتَمَعَ فِي يَوْمِكُمْ هَذَا عِيدَانِ فَمَنْ شَاءَ أَجْزَأَهُ مِنْ الْجُمُعَةِ وَإِنَّا مُجَمِّعُونَقَالَ عُمَرُ عَنْ شُعْبَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mushaffa] dan [Umar bin Hafsh Al Washabi] sedangkan maksud haditsnya sama, keduanya berkata; telah menceritakan kepada kami [Baqiyah] telah menceritakan kepada kami [Syu'bah] dari [Al Mughirah Adl dlabi] dari [Abdul Aziz bin Rufai'] dari [Abu Shalih] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda; \"Pada hari ini telah berkumpul bagi kalian dua hari raya, barangsiapa ingin melaksanakan, maka hari rayanya ini sudah mencukupi sholat jum'atnya, namun kami akan tetap melaksanakan Jum'at.\" Umar berkata dari Syu'bah. "
            },
            {
                "number": 895,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُخَوَّلِ بْنِ رَاشِدٍ عَنْ مُسْلِمٍ الْبَطِينِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي صَلَاةِ الْفَجْرِ يَوْمَ الْجُمُعَةِ تَنْزِيلُ السَّجْدَةَ وَهَلْ أَتَى عَلَى الْإِنْسَانِ حِينٌ مِنْ الدَّهْرِحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ عَنْ مُخَوَّلٍ بِإِسْنَادِهِ وَمَعْنَاهُ وَزَادَ فِي صَلَاةِ الْجُمُعَةِ بِسُورَةِ الْجُمُعَةِ وَإِذَا جَاءَكَ الْمُنَافِقُونَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu 'Awanah] dari [Mukhawwal bin Rasyid] dari [Muslim Al Bathin] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa dalam sholat shubuh di hari Jum'at, Rasulullah shallallahu 'alaihi wasallam membaca suraj As Sajdah dan HAL ATAA 'ALAL INSAAN HIINUM MINAD DAHRI (surat Al insan).\" Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Syu'bah] dari [Mukhawwal] dengan sanad dan maksud yang sama. Dia menambahkan; \"dalam sholat Jum'at, beliau membaca surat Al Jum'at dan \"IDZAA JAA`AKAL MUNAAFIQUUN (surat Al Munafiqun).\""
            },
            {
                "number": 896,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عُمَرَ بْنَ الْخَطَّابِرَأَى حُلَّةً سِيَرَاءَ يَعْنِي تُبَاعُ عِنْدَ بَابِ الْمَسْجِدِ فَقَالَ يَا رَسُولَ اللَّهِ لَوْ اشْتَرَيْتَ هَذِهِ فَلَبِسْتَهَا يَوْمَ الْجُمُعَةِ وَلِلْوَفْدِ إِذَا قَدِمُوا عَلَيْكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لَا خَلَاقَ لَهُ فِي الْآخِرَةِ ثُمَّ جَاءَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهَا حُلَلٌ فَأَعْطَى عُمَرَ حُلَّةً فَقَالَ عُمَرُ كَسَوْتَنِيهَا يَا رَسُولَ اللَّهِ وَقَدْ قُلْتَ فِي حُلَّةِ عُطَارِدَ مَا قُلْتَ فَقَالَ رَسُولُ اللَّهِ إِنِّي لَمْ أَكْسُكَهَا لِتَلْبَسَهَا فَكَسَاهَا عُمَرُ أَخًا لَهُ مُشْرِكًا بِمَكَّةَحَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ وَعَمْرُو بْنُ الْحَارِثِ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ وَجَدَ عُمَرُ بْنُ الْخَطَّابِ حُلَّةَ إِسْتَبْرَقٍ تُبَاعُ بِالسُّوقِ فَأَخَذَهَا فَأَتَى بِهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ابْتَعْ هَذِهِ تَجَمَّلْ بِهَا لِلْعِيدِ وَلِلْوُفُودِ ثُمَّ سَاقَ الْحَدِيثَ وَالْأَوَّلُ أَتَمُّ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa Umar bin Khattab pernah melihat kain campuran sutera di jual dekat pintu masjid, maka dia berkata; \"Wahai Rasulullah, alangkah baiknya jika anda membelinya kemudian anda kenakan pada hari Jum'at, dan untuk menyambut delegasi yang datang kepada anda.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Yang mengenakan pakaian ini hanyalah orang yang tidak mendapatkan bagiannya di akhirat.\" Kemudian Rasulullah shallallahu 'alaihi wasallam di beri beberapa pakaian yang di antaranya terbuat dari sutera, kemudian beliau berikan kain sutera itu kepada Umar, maka Umar berkata; \"Wahai Rasulullah, anda memakaikannya kepadaku, padahal anda telah mengatakannya kepadaku tentang status pakaian 'Utharid tersebut.\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Aku memberikan itu bukan bermaksud untuk kamu pakai.\" Maka Umar memberikannya kepada saudaranya yang masih Musyrik di Makkah. ' Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dan ['Amru bin Al Harits] dari [Ibnu Syihab] dari [Salim] dari [ayahnya] dia berkata; \"Umar bin Khattab mendapati kain sutera yang di jual di pasar, kemudian dia mengambilnya lalu membawanya kepada Rasulullah shallallahu 'alaihi wasallam sambil berkata; \"Belilah ini, untuk berhias diri pada hari raya atau untuk menerima tami delegasi…\" kemudian dia menyebutkan hadits tersebut, namun hadits yang pertama lebih sempurna.\""
            },
            {
                "number": 897,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ وَعَمْرٌو أَنَّ يَحْيَى بْنَ سَعِيدٍ الْأَنْصَارِيَّ حَدَّثَهُ أَنَّ مُحَمَّدَ بْنَ يَحْيَى بْنِ حَبَّانَ حَدَّثَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا عَلَى أَحَدِكُمْ إِنْ وَجَدَ أَوْ مَا عَلَى أَحَدِكُمْ إِنْ وَجَدْتُمْ أَنْ يَتَّخِذَ ثَوْبَيْنِ لِيَوْمِ الْجُمُعَةِ سِوَى ثَوْبَيْ مِهْنَتِهِقَالَ عَمْرٌو وَأَخْبَرَنِي ابْنُ أَبِي حَبِيبٍ عَنْ مُوسَى بْنِ سَعْدٍ عَنْ ابْنِ حَبَّانَ عَنْ ابْنِ سَلَامٍ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ذَلِكَ عَلَى الْمِنْبَرِ قَالَ أَبُو دَاوُد وَرَوَاهُ وَهْبُ بْنُ جَرِيرٍ عَنْ أَبِيهِ عَنْ يَحْيَى بْنِ أَيُّوبَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ مُوسَى بْنِ سَعْدٍ عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ سَلَامٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dan ['Amru] bahwa [Yahya bin Sa'id Al Anshari] telah menceritakan kepadanya, bahwa [Muhammad bin Yahya bin Habban] telah menceritakan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah tidak semestinya salah seorang dari kalian memiliki dua pakaian atau jika salah seorang punya kemampuan mempunyai dua pakaian untuk melaksanakan sholat jum'at selain pakaian untuk bekerja sehari-hari?.\" 'Amru berkata; telah mengabarkan kepadaku [Ibnu Abu Habib] dari [Musa bin Sa'd] dari [Ibnu Habban] dari [Ibnu Salam] bahwa dia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda demikian diatas mimbar.\" Abu Daud berkata; \"Dan hadits ini di riwayatkan oleh [Wahb bin Jarir] dari [ayahnya] dari [Yahya bin Ayyub] dari [Yazid bin Abu Habib] dari [Musa bin Sa'd] dari [Yusuf bin Abdullah bin Salam] dari Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 898,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ابْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الشِّرَاءِ وَالْبَيْعِ فِي الْمَسْجِدِ وَأَنْ تُنْشَدَ فِيهِ ضَالَّةٌ وَأَنْ يُنْشَدَ فِيهِ شِعْرٌ وَنَهَى عَنْ التَّحَلُّقِ قَبْلَ الصَّلَاةِ يَوْمَ الْجُمُعَةِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Ibnu 'Ajlan] dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam melarang berjual beli di masjid, mencari sesuatu yang hilang, mendendangkan syair dan mengadakan mengadakan pertemuan (di masjid) sebelum sholat Jum'at.\""
            },
            {
                "number": 899,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدٍ الْقَارِيُّ الْقُرَشِيُّ حَدَّثَنِي أَبُو حَازِمِ بْنُ دِينَارٍأَنَّ رِجَالًا أَتَوْا سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ وَقَدْ امْتَرَوْا فِي الْمِنْبَرِ مِمَّ عُودُهُ فَسَأَلُوهُ عَنْ ذَلِكَ فَقَالَ وَاللَّهِ إِنِّي لَأَعْرِفُ مِمَّا هُوَ وَلَقَدْ رَأَيْتُهُ أَوَّلَ يَوْمٍ وُضِعَ وَأَوَّلَ يَوْمٍ جَلَسَ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْسَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى فُلَانَةَ امْرَأَةٌ قَدْ سَمَّاهَا سَهْلٌ أَنْ مُرِي غُلَامَكِ النَّجَّارَ أَنْ يَعْمَلَ لِي أَعْوَادًا أَجْلِسُ عَلَيْهِنَّ إِذَا كَلَّمْتُ النَّاسَ فَأَمَرَتْهُ فَعَمِلَهَا مِنْ طَرْفَاءِ الْغَابَةِ ثُمَّ جَاءَ بِهَا فَأَرْسَلَتْهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِهَا فَوُضِعَتْ هَاهُنَا فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عَلَيْهَا وَكَبَّرَ عَلَيْهَا ثُمَّ رَكَعَ وَهُوَ عَلَيْهَا ثُمَّ نَزَلَ الْقَهْقَرَى فَسَجَدَ فِي أَصْلِ الْمِنْبَرِ ثُمَّ عَادَ فَلَمَّا فَرَغَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ أَيُّهَا النَّاسُ إِنَّمَا صَنَعْتُ هَذَا لِتَأْتَمُّوا بِي وَلِتَعْلَمُوا صَلَاتِي",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ya'qub bin Abdurrahman bin Muhammad bin Abdullah bin Abdul Qarri` Al Qurasyi] telah menceritakan kepadaku [Abu Hazim bin Dinar] bahwa beberapa orang pergi menemui [Sahl bin Sa'd As Saidi], sedangkan mereka memperdebatkan mengenai bahan kayu untuk membuat mimbar, mereka menanyakan hal itu kepada Sahl, jawab Sahl; \"Demi Allah, sungguh aku telah mengetahuinya dari apakah ia di buat, sesungguhnya aku telah melihatnya ketika pertama kali di letakkan, dan pada hari pertama Rasulullah shallallahu 'alaihi wasallam duduk di atasnya. Rasulullah shallallahu 'alaihi wasallam pernah mengutus seseorang untuk menemui fulanah -seorang wanita yang namanya di sebutkan oleh Sahl-, sabdanya: \"Suruhlah budakmu yang tukang kayu untuk membuatkanku mimbar supaya aku bisa duduk di atasnya apabila aku berkhutbah (pidato) di hadapan manusia.\" Lantas fulanah tadi menyuruh budaknya, dan budak tersebut mulai membuatnya yang di ambil (kayunya) dari hutan Tharfa' (derah pedesaan), setelah jadi, budak tersebut membawanya kepada wanita itu, lalu (mimbar itu) di kirim kepada Nabi shallallahu 'alaihi wasallam, maka beliau menyuruh untuk meletakkan di sini, aku melihat Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat di atas mimbar tersebut, lalu beliau bertakbir dan ruku', sementara beliau masih di atas mimbar, kemudian beliau turun pelan-pelan dan mundur ke belakang lalu sujud di pangkal mimbarnya, kemudian beliau kembali. Selesai sholat, beliau menghadap kepada orang-orang lalu bersabda: \"Wahai sekalian manusia, aku melakukan hal ini tidak lain supaya kalian mengikutiku dan melihat tata cara sholatku.\""
            },
            {
                "number": 900,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ أَبِي رَوَّادٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا بَدَّنَ قَالَ لَهُ تَمِيمٌ الدَّارِيُّ أَلَا أَتَّخِذُ لَكَ مِنْبَرًا يَا رَسُولَ اللَّهِ يَجْمَعُ أَوْ يَحْمِلُ عِظَامَكَ قَالَ بَلَى فَاتَّخَذَ لَهُ مِنْبَرًا مِرْقَاتَيْنِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Abu Rawwad] dari [Nafi'] dari [Ibnu Umar] bahwa ketika Nabi shallallahu 'alaihi wasallam memasuki usia lanjut, sahabat Tamim Addari berkata kepadanya; \"Sudikah anda aku buatkan mimbar untuk anda pergunakan duduk wahai Rasulullah?\" Beliau menjawab: \"Ya!.\" Maka dia membuatkan mimbar dengan dua anak tangga untuk beliau.\""
            },
            {
                "number": 901,
                "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ قَالَكَانَ بَيْنَ مِنْبَرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَيْنَ الْحَائِطِ كَقَدْرِ مَمَرِّ الشَّاةِ",
                "id": "Telah menceritakan kepada kami [Makhlad bin Khalid] telah menceritakan kepada kami [Abu 'Ashim] dari [Yazid bin Abu 'Ubaid] dari [Salamah bin Al Akwa'] dia berkata; Di antara mimbar Rasulullah shallallahu 'alaihi wasallam dengan tembok berjarak kira-kira seekor kambing bisa melewatinya.\""
            },
            {
                "number": 902,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا حَسَّانُ بْنُ إِبْرَاهِيمَ عَنْ لَيْثٍ عَنْ مُجَاهِدٍ عَنْ أَبِي الْخَلِيلِ عَنْ أَبِي قَتَادَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَرِهَ الصَّلَاةَ نِصْفَ النَّهَارِ إِلَّا يَوْمَ الْجُمُعَةِ وَقَالَ إِنَّ جَهَنَّمَ تُسَجَّرُ إِلَّا يَوْمَ الْجُمُعَةِقَالَ أَبُو دَاوُد هُوَ مُرْسَلٌ مُجَاهِدٌ أَكْبَرُ مِنْ أَبِي الْخَلِيلِ وَأَبُو الْخَلِيلِ لَمْ يَسْمَعْ مِنْ أَبِي قَتَادَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Hassan bin Ibrahim] dari [Laits] dari [Mujahid] dari [Abu Al Khalil] dari [Abu Qatadah] dari Nabi shallallahu 'alaihi wasallam bahwa beliau tidak suka melaksanakan sholat pertengahan siang kecuali hari jum'at. Beliau bersabda: \"Sesungguhnya neraka Jahannam di nyalakan pada waktu itu kecuali hari Jum'at.\" Abu Daud berkata; \"Hadits ini mursal karena Mujahid lebih tua dari Abu Khalil, sedangkan Abu Khalil tidak pernah mendengar dari Abu Qatadah.\""
            },
            {
                "number": 903,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنِي فُلَيْحُ بْنُ سُلَيْمَانَ حَدَّثَنِي عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ التَّيْمِيُّ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الْجُمُعَةَ إِذَا مَالَتْ الشَّمْسُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Zaid bin Al Khubbab] telah menceritakan kepadaku [Fulaih bin Sulaiman] telah menceritakan kepadaku [Utsman bin Abdurrahman At Taimi] saya mendengar [Anas bin Malik] berkata; \"Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat Jum'at ketika matahari mulai condong.\""
            },
            {
                "number": 904,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا يَعْلَى بْنُ الْحَارِثِ سَمِعْتُ إِيَاسَ بْنَ سَلَمَةَ بْنِ الْأَكْوَعِ يُحَدِّثُ عَنْ أَبِيهِ قَالَكُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجُمُعَةَ ثُمَّ نَنْصَرِفُ وَلَيْسَ لِلْحِيطَانِ فَيْءٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Ya'la bin Al Harits] saya mendengar [Iyas bin Salamah bin Al Akwa'] bercerita dari [ayahnya] dia berkata; \"Kami sholat Jum'at bersama Rasulullah shallallahu 'alaihi wasallam, kemudian kami beranjak pergi sedangkan tembok sudah tidak memiliki bayang-bayang lagi (ditengah hari).\""
            },
            {
                "number": 905,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَكُنَّا نَقِيلُ وَنَتَغَدَّى بَعْدَ الْجُمُعَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Abu Hazim] dari [Sahl bin Sa'd] dia berkata; \"Kami melaksanakan qailulah (tidur siang) dan makan siang setelah melaksanakan sholat Jum'at.\""
            },
            {
                "number": 906,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَأَنَّ الْأَذَانَ كَانَ أَوَّلُهُ حِينَ يَجْلِسُ الْإِمَامُ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ فِي عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا فَلَمَّا كَانَ خِلَافَةُ عُثْمَانَ وَكَثُرَ النَّاسُ أَمَرَ عُثْمَانُ يَوْمَ الْجُمُعَةِ بِالْأَذَانِ الثَّالِثِ فَأُذِّنَ بِهِ عَلَى الزَّوْرَاءِ فَثَبَتَ الْأَمْرُ عَلَى ذَلِكَحَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ الزُّهْرِيِّ عَنْ السَّائِبِ بْنِ يَزِيدَ قَالَ كَانَ يُؤَذَّنُ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَلَسَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ عَلَى بَابِ الْمَسْجِدِ وَأَبِي بَكْرٍ وَعُمَرَ ثُمَّ سَاقَ نَحْوَ حَدِيثِ يُونُسَ حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا عَبْدَةُ عَنْ مُحَمَّدٍ يَعْنِي ابْنَ إِسْحَقَ عَنْ الزُّهْرِيِّ عَنْ السَّائِبِ قَالَ لَمْ يَكُنْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مُؤَذِّنٌ وَاحِدٌ بِلَالٌ ثُمَّ ذَكَرَ مَعْنَاهُ حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَنَّ السَّائِبَ بْنَ يَزِيدَ ابْنَ أُخْتِ نَمِرٍ أَخْبَرَهُ قَالَ وَلَمْ يَكُنْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرُ مُؤَذِّنٍ وَاحِدٍ وَسَاقَ هَذَا الْحَدِيثَ وَلَيْسَ بِتَمَامِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Salamah Al Muradi] telah menceritakan kepada kami [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [As Sa`ib bin Yazid] bahwa pada mulanya, adzan pertama pada hari Jum'at ketika imam duduk di atas mimbar yaitu di masa Nabi shallallahu 'alaihi wasallam, Abu Bakar dan Umar radliallahu 'anhuma, ketika Utsman menjabat Khilafah, sementara orang-orang semakin banyak jumlahnya, maka Utsman memerintahkan untuk mengumandangkan adzan ketiga di hari Jum'at, maka di kumandangkanlah adzan di atas Zaura`(tempat ketinggian di pasar Madinah), lalu perkara tersebut menjadi tetap.\" Telah menceritakan kepada kami [An Nufaili] telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Az Zuhri] dari [As Sa`ib bin Yazid] dia berkata; \"Mu'adzin mengumandangkan adzan di hadapan Rasulullah Shallallahu shallallahu 'alaihi wasallam pada hari Jum'at, yaitu ketika beliau telah duduk di atas mimbar, sedangkan Abu Bakar dan Umar berada di depan pintu masjid…\" kemudian dia melanjutkan hadits tersebut sebagaimana hadits Yunus. Telah menceritakan kepada kami [Hannad bin As Sarri] telah menceritakan kepada kami ['Abdah] dari [Muhammad yaitu Ibnu Ishaq] dari [Az Zuhri] dari [As Sa`ib] dia berkata; \"Rasulullah tidak memiliki Mu'adzin (tetap) kecuali satu orang, yaitu Bilal…\" kemudian dia menyebutkan makna haditsnya.\" Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] telah menceritakan kepada kami [Ya'kub bin Ibrahim bin Sa'd] telah menceritakan kepada kami [ayahku] dari [Shalih] dari [Ibnu Syihab] bahwa [As Sa`ib bin Yazid sepupunya Namir] telah mengabarkan kepadanya, katanya; \"Rasulullah shallallahu 'alaihi wasallam tidak memiliki selain satu Mu'adzin…\" kemudian dia melanjutkan hadits tersebut, namun tidak sempurna.\""
            },
            {
                "number": 907,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ كَعْبٍ الْأَنْطَاكِيُّ حَدَّثَنَا مَخْلَدُ بْنُ يَزِيدَ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَلَمَّا اسْتَوَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ قَالَ اجْلِسُوا فَسَمِعَ ذَلِكَ ابْنُ مَسْعُودٍ فَجَلَسَ عَلَى بَابِ الْمَسْجِدِ فَرَآهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ تَعَالَ يَا عَبْدَ اللَّهِ بْنَ مَسْعُودٍقَالَ أَبُو دَاوُد هَذَا يُعْرَفُ مُرْسَلًا إِنَّمَا رَوَاهُ النَّاسُ عَنْ عَطَاءٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَخْلَدٌ هُوَ شَيْخٌ",
                "id": "Telah menceritakan kepada kami [Ya'kub bin Ka'b Al Anthaki] telah menceritakan kepada kami [Makhlad bin Yazid] telah menceritakan kepada kami [Ibnu Juraij] dari ['Atha`] dari [Jabir] dia berkata; \"Ketika Rasulullah shallallahu 'alaihi wasallam duduk diatas mimbar pada hari Jum'at, beliau bersabda: \"Duduklah kalian!.\" ucapan itu di dengar oleh Abdullah bin Mas'ud, maka dia segera duduk di dekat pintu pintu Masjid, ketika Rasulullah shallallahu 'alaihi wasallam melihatnya, beliau berseru kepadanya: \"Kemarilah wahai Abdullah bin Mas'ud!.\" Abu Daud berkata; \"Hadits ini terkenal mursal, karena orang-orang meriwayatkan dari 'Atha` dari Nabi shallallahu 'alaihi wasallam, sementara Makhlad adalah seorang syaikh (maksudnya adalah haditsnya boleh ditulis).\""
            },
            {
                "number": 908,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي ابْنَ عَطَاءٍ عَنْ الْعُمَرِيِّ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ خُطْبَتَيْنِ كَانَ يَجْلِسُ إِذَا صَعِدَ الْمِنْبَرَ حَتَّى يَفْرَغَ أُرَاهُ قَالَ الْمُؤَذِّنُ ثُمَّ يَقُومُ فَيَخْطُبُ ثُمَّ يَجْلِسُ فَلَا يَتَكَلَّمُ ثُمَّ يَقُومُ فَيَخْطُبُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] telah menceritakan kepada kami [Abdul Wahab yaitu Ibnu 'Atha`] dari [Al 'Umari] dari [Nafi'] dari [Ibnu Umar] dia berkata; \"Nabi shallallahu 'alaihi wasallam menyampaikan khutbah dua kali, beliau duduk setelah naik mimbar sehingga Mu'adzin selesai mengumandangkan adzan, setelah itu beliau berdiri dan berkhutbah, lalu duduk lagi dan tidak berbicara kemudian bangkit dan berkhutbah.\""
            },
            {
                "number": 909,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا زُهَيْرٌ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ قَائِمًا ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ فَيَخْطُبُ قَائِمًا فَمَنْ حَدَّثَكَ أَنَّهُ كَانَ يَخْطُبُ جَالِسًا فَقَدْ كَذَبَ فَقَالَ فَقَدْ وَاللَّهِ صَلَّيْتُ مَعَهُ أَكْثَرَ مِنْ أَلْفَيْ صَلَاةٍ",
                "id": "Telah menceritakan kepada kami [An Nufaili Abdullah bin Muhammad] telah menceritakan kepada kami [Zuhair] dari [Simak] dari [Jabir bin Samurah] bahwa Rasulullah shallallahu 'alaihi wasallam khutbah dengan berdiri, lalu duduk, setelah itu beliau berdiri lagi dan menyampaikan khutbahnya. Barangsiapa menyampaikan kepadamu bahwa beliau berkhutbah dengan duduk, sungguh dia telah berdusta.\" Jabir berkata; \"Sungguh, aku sholat bersama beliau lebih dari dua ribu sholat.\""
            },
            {
                "number": 910,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ الْمَعْنَى عَنْ أَبِي الْأَحْوَصِ حَدَّثَنَا سِمَاكٌ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَكَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُطْبَتَانِ كَانَ يَجْلِسُ بَيْنَهُمَا يَقْرَأُ الْقُرْآنَ وَيُذَكِّرُ النَّاسَحَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا ثُمَّ يَقْعُدُ قَعْدَةً لَا يَتَكَلَّمُ وَسَاقَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa] dan [Utsman bin Abi Syaibah] sedangkan ma'na haditsnya dari [Abu Al Ahwash] telah menceritakan kepada kami [Simak] dari [Jabir bin Samurah] dia berkata; \"Nabi shallallahu 'alaihi wasallam biasa menyampaikan dua kali khutbah, beliau duduk di antara dua khutbah tersebut, beliau membaca Al Qur'an dan memberi peringatan kepada orang-orang.\" Telah menceritakan kepada kami [Abu Kamil] telah menceritakan kepada kami [Abu 'Awanah] dari [Simak bin Harb] dari [Jabir bin Samurah] dia berkata; saya melihat Rasulullah shallallahu 'alaihi wasallam khutbah dengan berdiri kemudian duduk, beliau tidak mengatakan sepatah katapun,,,, \" kemudian dia melanjutkan hadits tersebut.\""
            },
            {
                "number": 911,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا شِهَابُ بْنُ خِرَاشٍ حَدَّثَنِي شُعَيْبُ بْنُ زُرَيْقٍ الطَّائِفِيُّ قَالَجَلَسْتُ إِلَى رَجُلٍ لَهُ صُحْبَةٌ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَالُ لَهُ الْحَكَمُ بْنُ حَزْنٍ الْكُلَفِيُّ فَأَنْشَأَ يُحَدِّثُنَا قَالَ وَفَدْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَابِعَ سَبْعَةٍ أَوْ تَاسِعَ تِسْعَةٍ فَدَخَلْنَا عَلَيْهِ فَقُلْنَا يَا رَسُولَ اللَّهِ زُرْنَاكَ فَادْعُ اللَّهَ لَنَا بِخَيْرٍ فَأَمَرَ بِنَا أَوْ أَمَرَ لَنَا بِشَيْءٍ مِنْ التَّمْرِ وَالشَّأْنُ إِذْ ذَاكَ دُونٌ فَأَقَمْنَا بِهَا أَيَّامًا شَهِدْنَا فِيهَا الْجُمُعَةَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ مُتَوَكِّئًا عَلَى عَصًا أَوْ قَوْسٍ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ كَلِمَاتٍ خَفِيفَاتٍ طَيِّبَاتٍ مُبَارَكَاتٍ ثُمَّ قَالَ أَيُّهَا النَّاسُ إِنَّكُمْ لَنْ تُطِيقُوا أَوْ لَنْ تَفْعَلُوا كُلَّ مَا أُمِرْتُمْ بِهِ وَلَكِنْ سَدِّدُوا وَأَبْشِرُواقَالَ أَبُو عَلِيٍّ سَمِعْت أَبُو دَاوُد قَالَ ثَبَّتَنِي فِي شَيْءٍ مِنْهُ بَعْضُ أَصْحَابِنَا وَقَدْ كَانَ انْقَطَعَ مِنْ الْقِرْطَاسِ",
                "id": "Telah menceritakan kepada kami [Sa'd bin Manshur] telah menceritakan kepada kami [Syihab bin Khirasy] telah menceritakan kepadaku [Syu'aib bin Zuraiq Ath Tha`ifi] dia berkata; \"Aku duduk di samping seorang sahabat Rasulullah shallallahu 'alaihi wasallam yang bernama [Al Hakam bin Hazn Al Kulafi], lalu dia menceritakan kepada kami, katanya; \"Aku pernah menemui Rasulullah shallallahu 'alaihi wasallam bersama dengan tujuh atau sembilan orang, setelah kami masuk menemui beliau, kami bertanya; \"Wahai Rasulullah, kami mengunjungi anda, oleh karena itu, do'akanlah kebaikan untuk kami.\" Maka beliau memerintahkan supaya kami di suguhi kurma, pada waktu itu, kondisi dalam situasi lemah. Kami pun tinggal di Madinah beberapa hari, kami juga mengikuti pelaksanaan sholat Jum'at bersama Rasulullah shallallahu 'alaihi wasallam, saat itu beliau berdiri bertopang pada tongkat atau busur, lalu beliau memuji Allah dan menyanjung-Nya dengan beberapa patah kata ringan, baik lagi penuh berkah, beliau bersabda: \"Wahai sekalian manusia, sesungguhnya kalian tidak akan mampu mengerjakan semua yang di perintahkan kalian, akan tetapi bertindaklah yang benar dan berilah kabar gembira.\" Abu Ali berkata; \"Aku mendengar Abu Daud berkata; \"Para sahabat kami telah meneguhkan sesuatu dari hadits tersebut, sebab kertas-kertas telah terputus.\""
            },
            {
                "number": 912,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا عِمْرَانُ عَنْ قَتَادَةَ عَنْ عَبْدِ رَبِّهِ عَنْ أَبِي عِيَاضٍ عَنْ ابْنِ مَسْعُودٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا تَشَهَّدَ قَالَ الْحَمْدُ لِلَّهِ نَسْتَعِينُهُ وَنَسْتَغْفِرُهُ وَنَعُوذُ بِاللَّهِ مِنْ شُرُورِ أَنْفُسِنَا مِنْ يَهْدِهِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ أَرْسَلَهُ بِالْحَقِّ بَشِيرًا وَنَذِيرًا بَيْنَ يَدَيْ السَّاعَةِ مَنْ يُطِعْ اللَّهَ وَرَسُولَهُ فَقَدْ رَشَدَ وَمَنْ يَعْصِهِمَا فَإِنَّهُ لَا يَضُرُّ إِلَّا نَفْسَهُ وَلَا يَضُرُّ اللَّهَ شَيْئًاحَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنْ تَشَهُّدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ فَذَكَرَ نَحْوَهُ قَالَ وَمَنْ يَعْصِهِمَا فَقَدْ غَوَى وَنَسْأَلُ اللَّهَ رَبَّنَا أَنْ يَجْعَلَنَا مِمَّنْ يُطِيعُهُ وَيُطِيعُ رَسُولَهُ وَيَتَّبِعُ رِضْوَانَهُ وَيَجْتَنِبُ سَخَطَهُ فَإِنَّمَا نَحْنُ بِهِ وَلَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu 'Ashim] telah menceritakan kepada kami ['Imran] dari [Qatadah] dari ['Abd Rabbihi] dari [Abu 'Iyadl] dari [Ibnu Mas'ud] bahwa apabila Rasulullah shallallahu 'alaihi wasallam bertasyahhud (memulai khutbahnya), beliau mengucapkan: \"ALHAMDULILLAH NASTA'IINUHU WANASTAGHFIRUHU WANA'UDZU BILLAHI MIN SYURURI ANFUSINA MAN YAHDIHILLAHU FALA MUDHILLA LAHU WAMAN YUDHLIL FALA HADIYA LAHU. WAASYHADU ALLA ILAAHA ILLALLAH WAASYHADU ANNA MUHAMMADAN ABDUHU WA RASULUHU ARSALAHU BIL HUDA, BASYIRAW WANADZIRAN BAINA YADAYISSA'AH MAN YUTHI'ILLAHA WARASULAHU FAQAD RASYAD WAMAN YA'SHIHIMA FAINNAHU LA YADHURRU ILLA NAFSAHUWALA YADHURRU-LLAHA SYAIAN (segala puji bagi Allah, kita memohon ampun kepada-Nya dan memohon pertolongan kepada-Nya dan berlindung kepada Allah dari kejahatan-kejahatan diri kita, barang siapa yang di beri petunjuk oleh Allah, maka tidak ada seorangpun yang dapat menyesatkannya dan barangsiapa di sesatkan-Nya, maka tidak ada seorangpun yang dapat memberikannya petunjuk. Aku bersaksi bahwa tidak ada ilah yang berhak disembah kecuali Allah dan aku bersaksi bahwa Muhammad adalah hamba dan rasul-Nya yang diutus dengan kebenaran sebagai pamberi kabar gembira dan sekaligus pemberi peringatan sebelum datangnya hari Kiamat. Barangsiapa menaati Allah dan rasul-Nya, maka dia telah mendapatkan petunjuk dan barangsiapa bermaksiat kepada keduanya, maka sesungguhnya dia tidaklah mencelakakan kecuali dirinya sendiri dan Allah tidak rugi sedikitpun).\" Telah menceritakan kepada kami [Muhammad bin Salamah Al Muradi] telah mengabarkan kepadaku [Ibnu Wahb] dari [Yunus] bahwa dia bertanya kepada [Ibnu Syihab] tentang tasyahhudnya Rasulullah shallallahu 'alaihi wasallam pada khutbah Jum'at, maka dia menyebutkan seperti diatas dengan tambahan; \"WAMAN YA'SHIHIMA FAQAD GHAWA WANAS'ALULLAHA RABBANA AN YAJ'ALANA MIMMAN YUTHI'UHU WA YUTHI'I RASULAHU WA YATTABI' RIDHWANAHU WA YAJTANIB SAKHATHAHU FAINNAMA NAHNU BIHI WA LAHU\" (Dan barangsiapa bermaksiat kepada keduanya, maka dia telah tersesat, kami memohon kepada Allah Rabb kami agar menjadikan kami termasuk orang-orang yang taat kepada-Nya dan taat kepada rasul-Nya dan termasuk orang yang mengikuti keridhaan-Nya serta menjauhi kamurkaan-Nya, sesungguhnya kami adalah orang-orang yang selalu merindukan keridhaan-Nya dan menjauhi kamurkaan-Nya).\""
            },
            {
                "number": 913,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ بْنِ سَعِيدٍ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ رُفَيْعٍ عَنْ تَمِيمٍ الطَّائِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍأَنَّ خَطِيبًا خَطَبَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ يُطِعْ اللَّهَ وَرَسُولَهُ فَقَدْ رَشَدَ وَمَنْ يَعْصِهِمَا فَقَالَ قُمْ أَوْ اذْهَبْ بِئْسَ الْخَطِيبُ أَنْتَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Sufyan bin Sa'id] telah menceritakan kepadaku [Abdul Aziz bin Rufai'] dari [Tamim Ath Tha`i] dari ['Adi bin Hatim] bahwa seprang Khatib menyampaikan khutbahnya di samping Nabi shallallahu 'alaihi wasallam, katanya; \"Barangsiapa mena'ati Allah dan Rasul-Nya, sungguh ia akan memperoleh petunjuk. Dan barangsiapa bermaksiat kepada keduanya, (maka telah tersesat).\" Maka beliau bersabda: \"Berdirilah dan pergi, kamu adalah seburuk-buruk Khatib.\""
            },
            {
                "number": 914,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ خُبَيْبٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ مَعْنٍ عَنْ بِنْتِ الْحَارِثِ بْنِ النُّعْمَانِ قَالَتْمَا حَفِظْتُ قَافْ إِلَّا مِنْ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ بِهَا كُلَّ جُمُعَةٍ قَالَتْ وَكَانَ تَنُّورُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَنُّورُنَا وَاحِدًاقَالَ أَبُو دَاوُد قَالَ رَوْحُ بْنُ عُبَادَةَ عَنْ شُعْبَةَ قَالَ بِنْتُ حَارِثَةَ بْنِ النُّعْمَانِ و قَالَ ابْنُ إِسْحَقَ أُمُّ هِشَامٍ بِنْتُ حَارِثَةَ بْنِ النُّعْمَانِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syubah] dari [Khubaib] dari [Abdullah bin Muhammad bin Ma'n] dari [Bintu Al Harits bin Nu'man] dia berkata; \"Aku tidak pernah hafal surat Qaaf kecuali langsung dari mulut Rasulullah shallallahu 'alaihi wasallam, sebab beliau selalu berkhutbah dengan surat tersebut setiap hari Jum'at.\" Katanya lagi; \"Dan juga tungku Rasulullah shallallahu 'alaihi wasallam dengan tungku kami menjadi satu.\" Abu Daud berkata; [Rauh bin 'Ubadah] berkata dari [Syu'bah] dia mengatakan; [Bintu Haritsah bin Nu'man] ….\" sedangkan [Ibnu Ishaq] mengatakan; [Ummu Hisyam bintu Haritsah bin Nu'man] …\""
            },
            {
                "number": 915,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنِي سِمَاكٌ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَكَانَتْ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَصْدًا وَخُطْبَتُهُ قَصْدًا يَقْرَأُ آيَاتٍ مِنْ الْقُرْآنِ وَيُذَكِّرُ النَّاسَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Sufyan] dia berkata; telah menceritakan kepadaku [Simak] dari [Jabir bin Samurah] dia berkata; \"sholat yang di kerjakan Rasulullah sangatlah sederhana, begitu juga dengan khutbah beliau, (dalam khutbahnya) beliau hanya membaca beberapa ayat Al Qur'an dan memberi peringatan kepada orang-orang.\""
            },
            {
                "number": 916,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا مَرْوَانُ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ أُخْتِهَا قَالَتْمَا أَخَذْتُ قَافْ إِلَّا مِنْ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَؤُهَا فِي كُلِّ جُمُعَةٍقَالَ أَبُو دَاوُد كَذَا رَوَاهُ يَحْيَى بْنُ أَيُّوبَ وَابْنُ أَبِي الرِّجَالِ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ أُمِّ هِشَامٍ بِنْتِ حَارِثَةَ بْنِ النُّعْمَانِ حَدَّثَنَا ابْنُ السَّرْحِ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ أُخْتٍ لِعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ كَانَتْ أَكْبَرَ مِنْهَا بِمَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Khalid] telah menceritakan kepada kami [Marwan] telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Yahya bin Sa'id] dari ['Amrah] dari [saudara perempuannya] dia berkata; \"Aku tidak pernah hafal surat Qaaf, kecuali dari mulut Rasulullah shallallahu 'alaihi wasallam, karena beliau membacanya setiap Jum'at.\" Abu Daud berkata; Demikianlah yang di riwayatkan oleh [Yahya bin Ayyub] dan [Ibnu Abu Rijal] dari [Yahya bin Sa'id] dari ['Amrah] dari [Ummu Hisyam binti Haritsah bin Nu'man]. Telah menceritakan kepada kami [Ibnu As Sarh] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yahya bin Ayyub] dari [Yahya bin Sa'id] dari ['Amrah] dari [Saudara perempuannya 'Amrah binti Abdurrahman] bahwa dirinya lebih tua daripada saudara perempuannya dan haditsnya semakna.\""
            },
            {
                "number": 917,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زَائِدَةُ عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ قَالَرَأَى عُمَارَةُ بْنُ رُوَيْبَةَ بِشْرَ بْنَ مَرْوَانَ وَهُوَ يَدْعُو فِي يَوْمِ جُمُعَةٍ فَقَالَ عُمَارَةُ قَبَّحَ اللَّهُ هَاتَيْنِ الْيَدَيْنِ قَالَ زَائِدَةُ قَالَ حُصَيْنٌ حَدَّثَنِي عُمَارَةُ قَالَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ مَا يَزِيدُ عَلَى هَذِهِ يَعْنِي السَّبَّابَةَ الَّتِي تَلِي الْإِبْهَامَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Za`idah] dari [Hushain bin Abdurrahman] dia berkata; ['Umarah bin Ruwaibah] melihat Bisyr bin Marwan sedang berdo'a pada hari Jum'at (dengan mengangkat tangan), maka Umarah berkata; \"Semoga Allah menjadikan kedua tangan ini jelek.\" [Za`idah] berkata; [Hushain] berkata; telah menceritakan kepadaku ['Umarah] dia berkata; \"Sungguh aku pernah melihat Rasulullah shallallahu 'alaihi wasallam ketika beliau di atas mimbar, (berdo'a) tidak lebih dari memberi isyarat dengan ini.\" yaitu jari telunjuk dekat ibu jari.\""
            },
            {
                "number": 918,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُعَاوِيَةَ عَنْ ابْنِ أَبِي ذُبَابٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَاهِرًا يَدَيْهِ قَطُّ يَدْعُو عَلَى مِنْبَرِهِ وَلَا عَلَى غَيْرِهِ وَلَكِنْ رَأَيْتُهُ يَقُولُ هَكَذَا وَأَشَارَ بِالسَّبَّابَةِ وَعَقَدَ الْوُسْطَى بِالْإِبْهَامِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Bisyr yaitu Ibnu Al Mufadlal] telah menceritakan kepada kami [Abdurrahman yaitu Ibnu Ishaq] dari [Abdurrahman bin Mu'awiyah] dari [Ibnu Abu Dzubab] dari [Sahl bin Sa'd] dia berkata; \"Aku tidak pernah melihat sama sekali Rasulullah shallallahu 'alaihi wasallam mengangkat kedua tangannya ketika berdo'a, baik di atas mimbar maupun di tempat lain, akan tetapi aku melihat beliau hanya memberi isyarat seperti ini.\" lalu Sahl memberi isyarat dengan jari telunjuk sambil mengenggam jari tengah dengan jempol.\""
            },
            {
                "number": 919,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْعَلَاءُ بْنُ صَالِحٍ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ أَبِي رَاشِدٍ عَنْ عَمَّارِ بْنِ يَاسِرٍ قَالَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِإِقْصَارِ الْخُطَبِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Al 'Ala` bin Shalih] dari ['Adi bin Tsabit] dari [Abu Rasyid] dari ['Ammar bin Yasir] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk mempersingkat khutbah.\""
            },
            {
                "number": 920,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا الْوَلِيدُ أَخْبَرَنِي شَيْبَانُ أَبُو مُعَاوِيَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ السُّوَائِيِّ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُطِيلُ الْمَوْعِظَةَ يَوْمَ الْجُمُعَةِ إِنَّمَا هُنَّ كَلِمَاتٌ يَسِيرَاتٌ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Khalid] telah menceritakan kepada kami [Al Walid] telah mengabarkan kepadaku [Syaiban Abu Mu'awiyah] dari [Simak bin Harb] daru [Jabir bin Samurah As Suwa`i] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam tidak pernah berpanjang lebar dalam menyampaikan nasehat pada hari Jum'at, hanyasanya ia merupakan beberapa patah kata yang singkat.\""
            },
            {
                "number": 921,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ وَجَدْتُ فِي كِتَابِ أَبِي بِخَطِّ يَدِهِ وَلَمْ أَسْمَعْهُ مِنْهُ قَالَ قَتَادَةُ عَنْ يَحْيَى بْنِ مَالِكٍ عَنْ سَمُرَةَ بْنِ جُنْدُبٍأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ احْضُرُوا الذِّكْرَ وَادْنُوا مِنْ الْإِمَامِ فَإِنَّ الرَّجُلَ لَا يَزَالُ يَتَبَاعَدُ حَتَّى يُؤَخَّرَ فِي الْجَنَّةِ وَإِنْ دَخَلَهَا",
                "id": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Mu'adz bin Hisyam] dia berkata; aku mendapati dalam kitabnya [ayahku] dengan tulisannya sendiri, namun aku belum pernah mendengar darinya, [Qatadah] mengatakan, dari [Yahya bin Malik] dari [Samurah bin Jundub] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Hadirilah peringatan (khutbah) dan mendekatlah kepada imam, karena seseorang yang selalu menjauh darinya hingga ia akan di akhirkan masuk surga, meskipun ia memasukinya.\""
            },
            {
                "number": 922,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَنَّ زَيْدَ بْنَ حُبَابٍ حَدَّثَهُمْ حَدَّثَنَا حُسَيْنُ بْنُ وَاقِدٍ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِيهِ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقْبَلَ الْحَسَنُ وَالْحُسَيْنُ رَضِيَ اللَّهُ عَنْهُمَا عَلَيْهِمَا قَمِيصَانِ أَحْمَرَانِ يَعْثُرَانِ وَيَقُومَانِ فَنَزَلَ فَأَخَذَهُمَا فَصَعِدَ بِهِمَا الْمِنْبَرَ ثُمَّ قَالَ صَدَقَ اللَّهُ{ إِنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌ }رَأَيْتُ هَذَيْنِ فَلَمْ أَصْبِرْ ثُمَّ أَخَذَ فِي الْخُطْبَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] bahwa [Zaid bin Al Hubab] telah menceritakan kepada mereka, katanya; telah menceritakan kepada kami [Husain bin Waqid] telah menceritakan kepadaku [Abdullah bin Buraidah] dari [ayahnya] dia berkata; Rasulullah shallallahu 'alaihi wasallam tengah berkhutbah di tengah-tengah kami, tiba-tiba Hasan dan Husain radliallahu 'anhuma membawakan dua baju yang berwarna merah. Keduanya lalu terjatuh, Rasulullah shallallahu 'alaihi wasallam turun dari mimbar dan menggendong keduanya lalu kembali ke mimbar dengan bersabda: \"Maha benar Allah atas firman-Nya: 'Sesungguhnya hartamu dan anak-anakmu hanyalah sebagai cobaan'. (Qs. Al-Anfaal (8): 28). Aku melihat kedua anak ini terjatuh dalam kedua bajunya, maka aku tidak sabar hingga aku mempersingkat khutbahku.\""
            },
            {
                "number": 923,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ حَدَّثَنَا الْمُقْرِئُ حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ عَنْ أَبِي مَرْحُومٍ عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْحُبْوَةِ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Auf] telah menceritakan kepada kami [Al Muqri`] telah menceritakan kepada kami [Sa'id bin Abu Ayyub] dari [Abu Marhum] dari [Sahl bin Mu'adz bin Anas] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam melarang duduk bertekuk lutut ketika imam berkhutbah pada hari Jum'at.\""
            },
            {
                "number": 924,
                "arab": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا خَالِدُ بْنُ حَيَّانَ الرَّقِّيُّ حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ اللَّهِ بْنِ الزِّبْرِقَانِ عَنْ يَعْلَى بْنِ شَدَّادِ بْنِ أَوْسٍ قَالَشَهِدْتُ مَعَ مُعَاوِيَةَ بَيْتَ الْمَقْدِسِ فَجَمَّعَ بِنَا فَنَظَرْتُ فَإِذَا جُلُّ مَنْ فِي الْمَسْجِدِ أَصْحَابُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَيْتُهُمْ مُحْتَبِينَ وَالْإِمَامُ يَخْطُبُقَالَ أَبُو دَاوُد كَانَ ابْنُ عُمَرَ يَحْتَبِي وَالْإِمَامُ يَخْطُبُ وَأَنَسُ بْنُ مَالِكٍ وَشُرَيْحٌ وَصَعْصَعَةُ بْنُ صُوحَانَ وَسَعِيدُ بْنُ الْمُسَيَّبِ وَإِبْرَاهِيمُ النَّخَعِيُّ وَمَكْحُولٌ وَإِسْمَعِيلُ بْنُ مُحَمَّدِ بْنِ سَعْدٍ وَنُعَيْمُ بْنُ سَلَامَةَ قَالَ لَا بَأْسَ بِهَا قَالَ أَبُو دَاوُد وَلَمْ يَبْلُغْنِي أَنَّ أَحَدًا كَرِهَهَا إِلَّا عُبَادَةَ بْنَ نُسَيٍّ",
                "id": "Telah menceritakan kepada kami [Daud bin Rusyaid] telah menceritakan kepada kami [Khalid bin Hayyan Ar Raqqi] telah menceritakan kepada kami [Sulaiman bin Abdullah bin Az Zibriqan] dari [Ya'la bin Syaddad bin Aus] dia berkata; \"Aku bersama Muawiyah menyaksikan penaklukan Baitul Maqdis, lalu dia melaksanakan sholat jum'at bersamanya, maka aku melihat kebanyakan jama'ah yang ada di masjid adalah para sahabat Nabi shallallahu 'alaihi wasallam, aku melihat mereka duduk bertekuk lutut ketika imam sedang berkhutbah.\" Abu Daud berkata; \" [Ibnu Umar] juga duduk bertekuk lutut sementara imam sedang berkhutbah, begitu juga [Anas bin Malik], Syuraih, Sha'sha'ah bin Shuhan, Sa'id bin Musayyab, Ibrahim An Nakha'i, Makhul, Isma'il bin Muhammad bin Sa'd dan Nu'aim bin Salamah, katanya; \"Tidak mengapa duduk seperti itu.\" Abu Daud berkata; \"Belum sampai kepadaku, bahwa ada seseorang yang membencinya kecuali 'Ubadah bin Nusai.\""
            },
            {
                "number": 925,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قُلْتَ أَنْصِتْ وَالْإِمَامُ يَخْطُبُ فَقَدْ لَغَوْتَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Sa'id] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kamu berkata; \"Diamlah\" padahal imam tengah berkhutbah, maka (jum'atmu) telah sia-sia.\""
            },
            {
                "number": 926,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا يَزِيدُ عَنْ حَبِيبٍ الْمُعَلِّمِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَحْضُرُ الْجُمُعَةَ ثَلَاثَةُ نَفَرٍ رَجُلٌ حَضَرَهَا يَلْغُو وَهُوَ حَظُّهُ مِنْهَا وَرَجُلٌ حَضَرَهَا يَدْعُو فَهُوَ رَجُلٌ دَعَا اللَّهَ عَزَّ وَجَلَّ إِنْ شَاءَ أَعْطَاهُ وَإِنْ شَاءَ مَنَعَهُ وَرَجُلٌ حَضَرَهَا بِإِنْصَاتٍ وَسُكُوتٍ وَلَمْ يَتَخَطَّ رَقَبَةَ مُسْلِمٍ وَلَمْ يُؤْذِ أَحَدًا فَهِيَ كَفَّارَةٌ إِلَى الْجُمُعَةِ الَّتِي تَلِيهَا وَزِيَادَةِ ثَلَاثَةِ أَيَّامٍ وَذَلِكَ بِأَنَّ اللَّهَ عَزَّ وَجَلَّ يَقُولُ{ مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا }",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Abu Kamil] keduanya berkata; telah menceritakan kepada kami [Yazid] dari [Habib Al Mu'allim] dari ['Amru bin Syu'aib] dari [ayahnya] dari [Abdullah bin 'Amru] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Ada tiga golongan seseorang dalam menghadiri sholat Jum'at, yaitu; seseorang menghadiri sholat Jum'at sambil bicara, maka bicaranya itulah yang menjadi bagiannya, seseorang yang menghadiri sholat jum'at sambil memanjatkan do'a maka itulah orang yang benar-benar memanjatkan do'a kepada Allah 'azza wajalla, Kalau Dia menghendaki, maka akan di kabulkan atau jika Dia menghendaki maka Dia akan menahannya. Dan orang yang menghadiri sholat Jum'at dengan sikap diam dan tenang, tidak melangkahi pundak orang lain dan tidak pula menyakiti seorang pun, maka jum'atnya menjadi penebus dosanya hingga jum'at berikutnya, di tambah tiga hari, yang demikian itu karena Allah 'azza wajalla berfirman: \"Barangsiapa melakukan amal kebaikan, maka baginya sepuluh kali lipat.\" QS Al An'am; 160. "
            },
            {
                "number": 927,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ الْمِصِّيصِيُّ حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي هِشَامُ بْنُ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَحْدَثَ أَحَدُكُمْ فِي صَلَاتِهِ فَلْيَأْخُذْ بِأَنْفِهِ ثُمَّ لِيَنْصَرِفْقَالَ أَبُو دَاوُد رَوَاهُ حَمَّادُ بْنُ سَلَمَةَ وَأَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَذْكُرَا عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Al Hasan Al Mishishi] telah menceritakan kepada kami [Hajjaj] telah menceritakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Hisyam bin 'Urwah] dari ['Urwah] dari ['Aisyah] dia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian berhadats dalam sholatnya, hendaknya ia memegang hidungnya lalu keluar.\" Abu Daud berkata; \"(hadits ini) juga di riwayatkan oleh [Hammad bin Salamah] dan [Abu Usamah] dari [Hisyam] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam, namun keduanya (Hammad dan Abu Usamah) tidak menyebutkan \"Aisyah radliallahu 'anha.\""
            },
            {
                "number": 928,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادٌ عَنْ عَمْرٍو وَهُوَ ابْنُ دِينَارٍ عَنْ جَابِرٍأَنَّ رَجُلًا جَاءَ يَوْمَ الْجُمُعَةِ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَقَالَ أَصَلَّيْتَ يَا فُلَانُ قَالَ لَا قَالَ قُمْ فَارْكَعْ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad] dari ['Amru yaitu Ibnu Dinar] dari [Jabir] bahwa seorang laki-laki datang pada hari jum'at, sementara Nabi shallallahu 'alaihi wasallam sedang berkhutbah, lalu beliau bersabda: \"Apakah kamu sudah sholat (sunnah) wahai fulan?\" jawabnya; \"Belum.\" Beliau bersabda: \"Berdiri dan kerjakanlah sholat (sunnah).\""
            },
            {
                "number": 929,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ وَإِسْمَعِيلُ بْنُ إِبْرَاهِيمَ الْمَعْنَى قَالَا حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ وَعَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَاجَاءَ سُلَيْكٌ الْغَطَفَانِيُّ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَقَالَ لَهُ أَصَلَّيْتَ شَيْئًا قَالَ لَا قَالَ صَلِّ رَكْعَتَيْنِ تَجَوَّزْ فِيهِمَاحَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ سَعِيدٍ عَنْ الْوَلِيدِ أَبِي بِشْرٍ عَنْ طَلْحَةَ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يُحَدِّثُ أَنَّ سُلَيْكًا جَاءَ فَذَكَرَ نَحْوَهُ زَادَ ثُمَّ أَقْبَلَ عَلَى النَّاسِ قَالَ إِذَا جَاءَ أَحَدُكُمْ وَالْإِمَامُ يَخْطُبُ فَلْيُصَلِّ رَكْعَتَيْنِ يَتَجَوَّزْ فِيهِمَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Mahbub] dan [Isma'il bin Ibrahim] sedangkan maksud haditsnya sama, keduanya berkata; telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] dan [Abu Shalih] dari [Abu Hurairah] katanya; \"Sulaik Al Ghathafani datang, sedangkan Rasulullah shallallahu 'alaihi wasallam tengah berkhutbah, maka beliau bersabda kepadanya; \"Apakah kamu sudah sholat (sunnah)?\" jawabnya; \"Belum.\" Beliau bersabda: \"sholatlah dua raka'at yang ringan.\" Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Muhammad bin Ja'far] dari [Sa'id] dari [Al Walid Abu Bisyr] dari [Thalhah] bahwa dia mendengar [Jabir bin Abdullah] bercerita bahwa Sulaik datang…\" kemudian dia menyebutkan hadits semisalnya, ia menambahkan; \"Kemudian beliau menghadap kepada orang-orang sambil bersabda: \"Apabila salah seorang dari kalian datang, sedangkan imam tengah berkhutbah, hendaknya ia sholat dua raka'at yang ringan.\""
            },
            {
                "number": 930,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ عَنْ أَبِي الزَّاهِرِيَّةِ قَالَكُنَّا مَعَ عَبْدِ اللَّهِ بْنِ بُسْرٍ صَاحِبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ فَجَاءَ رَجُلٌ يَتَخَطَّى رِقَابَ النَّاسِ فَقَالَ عَبْدُ اللَّهِ بْنُ بُسْرٍ جَاءَ رَجُلٌ يَتَخَطَّى رِقَابَ النَّاسِ يَوْمَ الْجُمُعَةِ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْلِسْ فَقَدْ آذَيْتَ",
                "id": "Telah menceritakan kepada kami [Harun bin Ma'ruf] telah menceritakan kepada kami [Bisyr bin As Sarri] telah menceritakan kepada kami [Mu'awiyah bin Shalih] dari [Abu Az Zahiriyah] dia berkata; \"Kami bersama Abdullah bin Busr -salah seorang sahabat Nabi shallallahu 'alaihi wasallam- pada hari Jum'ah, tiba-tiba seorang laki-laki datang melangkahi pundak orang-orang, maka [Abdullah bin Busr] berkata; \"Pernah datang seseorang dengan melangkahi pundak orang-orang pada hari jum'at, sedangkan Nabi shallallahu 'alaihi wasallam tengah berkhutbah, maka Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Duduklah, kamu benar-benar telah mengganggu (orang lain).\""
            },
            {
                "number": 931,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ عَبْدَةَ عَنْ ابْنِ إِسْحَقَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا نَعَسَ أَحَدُكُمْ وَهُوَ فِي الْمَسْجِدِ فَلْيَتَحَوَّلْ مِنْ مَجْلِسِهِ ذَلِكَ إِلَى غَيْرِهِ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sarri] dari ['Abdah] dari [Ibnu Ishaq] dari [Nafi'] dari [Ibnu Umar] dia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang mengantuk di dalam masjid(ketika khutbah Jum'at), hendaknya ia pindah tempat duduk ke tempat duduk yang lain.\""
            },
            {
                "number": 932,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ عَنْ جَرِيرٍ هُوَ ابْنُ حَازِمٍ لَا أَدْرِي كَيْفَ قَالَهُ مُسْلِمٌ أَوْ لَا عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْزِلُ مِنْ الْمِنْبَرِ فَيَعْرِضُ لَهُ الرَّجُلُ فِي الْحَاجَةِ فَيَقُومُ مَعَهُ حَتَّى يَقْضِيَ حَاجَتَهُ ثُمَّ يَقُومُ فَيُصَلِّيقَالَ أَبُو دَاوُد الْحَدِيثُ لَيْسَ بِمَعْرُوفٍ عَنْ ثَابِتٍ هُوَ مِمَّا تَفَرَّدَ بِهِ جَرِيرُ بْنُ حَازِمٍ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] dari [Jarir yaitu Ibnu Hazim] aku tidak tahu bagaimana yang di katakan Muslim, kalau bukan dari [Tsabit] dari [Anas] dia berkata; saya melihat Rasulullah shallallahu 'alaihi wasallam turun dari mimbar, tiba-tiba seseorang muncul dan hendak menyampaikan kebutuhannya kepada beliau, lantas orang tersebut berdiri bersama beliau hingga hajatnya selesai, setelah itu beliau berdiri dan mengerjakan sholat.\" Abu Daud berkata; \"Hadits ini tidak di kenal dari Tsabit, akan tetapi ia merupakan riwayatnya Jarir bin Hazim secara terpisah (sendiri).\""
            },
            {
                "number": 933,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَدْرَكَ رَكْعَةً مِنْ الصَّلَاةِ فَقَدْ أَدْرَكَ الصَّلَاةَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mendapat satu raka'at dalam sholat, berarti ia telah mendapatkan sholat itu.\""
            },
            {
                "number": 934,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الْعِيدَيْنِ وَيَوْمِ الْجُمُعَةِ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ قَالَ وَرُبَّمَا اجْتَمَعَا فِي يَوْمٍ وَاحِدٍ فَقَرَأَ بِهِمَا",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abu 'Awanah] dari [Ibrahim bin Muhammad bin Al Muntasyir] dari [ayahnya] dari [Habib bin Salim] dari [Nu'man bin Basyir] bahwa dalam sholat hari raya dan sholat Jum'at, Rasulullah shallallahu 'alaihi wasallam biasa membaca dengan: \"Sabbihisma rabbikal a'la dan Hal ataaka hadiitsul ghaatsiyah.\" Kata Nu'man; \"Apabila (hari raya dengan sholat jum'at) bertepatan dalam satu hari, maka beliau juga membaca kedua surat tersebut.\""
            },
            {
                "number": 935,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَأَنَّ الضَّحَّاكَ بْنَ قَيْسٍ سَأَلَ النُّعْمَانَ بْنَ بَشِيرٍ مَاذَا كَانَ يَقْرَأُ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ عَلَى إِثْرِ سُورَةِ الْجُمُعَةِ فَقَالَ كَانَ يَقْرَأُ بِهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Dlamrah bin Sa'id Al Mazini] dari ['ubaidhullah bin Abdullah bin 'Utbah] bahwa Dlahhak bin Qais bertanya kepada [Nu'man bin Basyir]; \"Surat apakah yang biasa di baca Rasulullah shallallahu 'alaihi wasallam pada hari Jum'at setelah surat Al Jum'ah?\" dia menjawab; \"Beliau biasa membaca dengan; \"Hal ataaka hadiitsul Ghaasyiyah.\""
            },
            {
                "number": 936,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ ابْنِ أَبِي رَافِعٍ قَالَصَلَّى بِنَا أَبُو هُرَيْرَةَ يَوْمَ الْجُمُعَةِ فَقَرَأَ بِسُورَةِ الْجُمُعَةِ وَفِي الرَّكْعَةِ الْآخِرَةِ إِذَا جَاءَكَ الْمُنَافِقُونَ قَالَ فَأَدْرَكْتُ أَبَا هُرَيْرَةَ حِينَ انْصَرَفَ فَقُلْتُ لَهُ إِنَّكَ قَرَأْتَ بِسُورَتَيْنِ كَانَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ يَقْرَأُ بِهِمَا بِالْكُوفَةِ قَالَ أَبُو هُرَيْرَةَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِهِمَا يَوْمَ الْجُمُعَةِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] telah menceritakan kepada kami [Sulaiman yaitu Ibnu Bilal] dari [Ja'far] dari [ayahnya] dari [Ibnu Abu Rafi'] dia berkata; Abu Hurairah sholat mangimami kami pada hari (sholat) Jum'at, lalu dia membaca surat Al Jumuah pada raka'at pertama dan \"idza jaa-akal munafiqun\" pada raka'at terakhir. Selesai sholat, aku menjumpai Abu Hurairah dan berkata kepadanya; \"Sesungguhnya anda membaca surat sebagaimana yang dibaca oleh Ali bin Abu Thalib di Kufah.\" [Abu Hurairah] berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam membaca kedua surat tersebut pada sholat Jum'at.\""
            },
            {
                "number": 937,
                "arab": "حَدَّثَنَا مُسَدَّدٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ شُعْبَةَ عَنْ مَعْبَدِ بْنِ خَالِدٍ عَنْ زَيْدِ بْنِ عُقْبَةَ عَنْ سَمُرَةَ بْنِ جُنْدُبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي صَلَاةِ الْجُمُعَةِ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ",
                "id": "Telah menceritakan kepada kami [Musaddad] dari [Yahya bin Sa'id] dari [Syu'bah] dari [Ma'bad bin Khalid] dari [Zaid bin 'Uqbah] dari [Samurah bin Jundub] bahwa pada waktu sholat Jum'at, Rasulullah shallallahu 'alaihi wasallam membaca \"Sabbihisma Rabbikal-a'la\" dan\"Hal ataaka haditsul ghasyiyah.\""
            },
            {
                "number": 938,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حُجْرَتِهِ وَالنَّاسُ يَأْتَمُّونَ بِهِ مِنْ وَرَاءِ الْحُجْرَةِ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepadaku [Yahya bin Sa'id] dari ['Amrah] dari [Aisyah radliallahu 'anha] dia berkata; Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat di kamarnya, ternyata orang-orang mengikuti beliau dari belakang kamarnya.\""
            },
            {
                "number": 939,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ وَسُلَيْمَانُ بْنُ دَاوُدَ الْمَعْنَى قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَرَأَى رَجُلًا يُصَلِّي رَكْعَتَيْنِ يَوْمَ الْجُمُعَةِ فِي مَقَامِهِ فَدَفَعَهُ وَقَالَ أَتُصَلِّي الْجُمُعَةَ أَرْبَعًا وَكَانَ عَبْدُ اللَّهِ يُصَلِّي يَوْمَ الْجُمُعَةِ رَكْعَتَيْنِ فِي بَيْتِهِ وَيَقُولُ هَكَذَا فَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid] dan [Sulaiman bin Daud] sedangkan maksud haditsnya sama, keduanya berkata; telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Ayyub] dari [Nafi'] bahwa [Ibnu Umar] melihat seseorang laki-laki sholat dua raka'at di tempat (sholat) nya, maka Ibnu Umar mendorongnya sambil berkata; \"Apakah kamu hendak sholat Jum'at empat raka'at? Abdullah biasa mengerjakan sholat Jum'at (sunnah ba'da Jum'at) dua raka'at di rumahnya, lalu dia berkata; \"Demikianlah yang pernah di lakukan Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 940,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا إِسْمَعِيلُ أَخْبَرَنَا أَيُّوبُ عَنْ نَافِعٍ قَالَكَانَ ابْنُ عُمَرَ يُطِيلُ الصَّلَاةَ قَبْلَ الْجُمُعَةِ وَيُصَلِّي بَعْدَهَا رَكْعَتَيْنِ فِي بَيْتِهِ وَيُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Isma'il] telah mengabarkan kepada kami [Ayyub] dari [Nafi'] dia berkata; \" [Ibnu Umar] biasa memanjangkan sholatnya sebelum (sholat) Jum'at, dan sholat (sunnah) setelahnya dua raka'at di rumahnya, dia mengatakan bahwa Rasulullah shallallahu 'alaihi wasallam juga melakukan yang demikian itu.\""
            },
            {
                "number": 941,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عُمَرُ بْنُ عَطَاءِ بْنِ أَبِي الْخُوَارِأَنَّ نَافِعَ بْنَ جُبَيْرٍ أَرْسَلَهُ إِلَى السَّائِبِ بْنِ يَزِيدَ ابْنَ أُخْتِ نَمِرٍ يَسْأَلُهُ عَنْ شَيْءٍ رَأَى مِنْهُ مُعَاوِيَةُ فِي الصَّلَاةِ فَقَالَ صَلَّيْتُ مَعَهُ الْجُمُعَةَ فِي الْمَقْصُورَةِ فَلَمَّا سَلَّمْتُ قُمْتُ فِي مَقَامِي فَصَلَّيْتُ فَلَمَّا دَخَلَ أَرْسَلَ إِلَيَّ فَقَالَ لَا تَعُدْ لِمَا صَنَعْتَ إِذَا صَلَّيْتَ الْجُمُعَةَ فَلَا تَصِلْهَا بِصَلَاةٍ حَتَّى تَكَلَّمَ أَوْ تَخْرُجَ فَإِنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِذَلِكَ أَنْ لَا تُوصَلَ صَلَاةٌ بِصَلَاةٍ حَتَّى يَتَكَلَّمَ أَوْ يَخْرُجَ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Umar bin 'Atha` bin Abu Al Khuwwar] bahwa Nafi' bin Jubair mengutusnya untuk menemui [As Sa`ib bin Yazid Ibnu Ukhti Namir], dan menanyakan sesuatu yang pernah di lihat Mu'awiyah dalam sholat, dia menjawab; \"Aku pernah mengerjakan sholat Jum'at bersama dia di dalam kamar (dalam masjid), seusai salam, aku langsung berdiri di tempat (sholat Jum'at), lalu aku sholat, sewaktu Mu'awiyah masuk menemuiku, dia berkata; \"jangan kamu ulangi lagi apa yang kamu lakukan itu, apabila kamu selesai sholat jum'at, maka janganlah kamu menyambung sholatmu dengan sholat lain hingga kamu berbicara atau keluar, sesungguhnya Nabi Allah shallallahu 'alaihi wasallam memerintahkan yang demikian itu, yaitu; janganlah kamu menyambung (sholat Jum'at) dengan sholat yang lain sehingga ia (selingi) dengan bicara atau keluar.\""
            },
            {
                "number": 942,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ الْمَرْوَزِيُّ أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عَطَاءٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ إِذَا كَانَ بِمَكَّةَ فَصَلَّى الْجُمُعَةَ تَقَدَّمَ فَصَلَّى رَكْعَتَيْنِ ثُمَّ تَقَدَّمَ فَصَلَّى أَرْبَعًا وَإِذَا كَانَ بِالْمَدِينَةِ صَلَّى الْجُمُعَةَ ثُمَّ رَجَعَ إِلَى بَيْتِهِ فَصَلَّى رَكْعَتَيْنِ وَلَمْ يُصَلِّ فِي الْمَسْجِدِ فَقِيلَ لَهُ فَقَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Aziz bin Abu Rizmah Al Marwazi] telah mengabarkan kepada kami [Al Fadl bin Musa] dari [Abdul Hamid bin Ja'far] dari [Yazid bin Abu Habib] dari ['Atha`] dari [Ibnu Umar] dia berkata; Apabila di Makkah, dia mengerjakan sholat Jum'at, lalu maju kemudian dia mengerjakan sholat (sunnah) dua raka'at, sesudah itu beliau maju kembali dan mengerjakan sholat empat raka'at, apabila di Madinah, dia sholat Jum'at kemudian pulang ke rumahnya lalu sholat dua raka'at, dan tidak sholat di Masjid, lalu di beritahukan kepadanya, maka dia menjawab; \"Rasulullah shallallahu 'alaihi wasallam juga melakukan hal itu.\""
            },
            {
                "number": 943,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا إِسْمَعِيلُ بْنُ زَكَرِيَّا عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ابْنُ الصَّبَّاحِ قَالَ مَنْ كَانَ مُصَلِّيًا بَعْدَ الْجُمُعَةِ فَلْيُصَلِّ أَرْبَعًا وَتَمَّ حَدِيثُهُ وَقَالَ ابْنُ يُونُسَ إِذَا صَلَّيْتُمْ الْجُمُعَةَ فَصَلُّوا بَعْدَهَا أَرْبَعًاقَالَ فَقَالَ لِي أَبِي يَا بُنَيَّ فَإِنْ صَلَّيْتَ فِي الْمَسْجِدِ رَكْعَتَيْنِ ثُمَّ أَتَيْتَ الْمَنْزِلَ أَوْ الْبَيْتَ فَصَلِّ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair], dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin As Shabah Al Bazzaz] telah menceritakan kepada kami [Isma'il bin Zakariya] dari [Suhail] dari [ayahnya] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: …-Ibnu Shabah mengatakan, beliau bersabda; \"Barangsiapa hendak sholat selepas (sholat) Jum'at, hendaknya ia sholat empat raka'at.\" haditsnya (selesai) sampai di sini, Ibnu Yunus mengatakan; \"Apabila kalian sholat Jum'at, maka sholatlah setelahnya empat raka'at.\" Suhal berkata; \"ayahku pernah berkata kepadaku; \"Wahai anakku, apabila kamu telah sholat dua raka'at di masjid, maka setibanya di rumah, sholatlah dua raka'at.\""
            },
            {
                "number": 944,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ فِي بَيْتِهِقَالَ أَبُو دَاوُد وَكَذَلِكَ رَوَاهُ عَبْدُ اللَّهِ بْنُ دِينَارٍ عَنْ ابْنِ عُمَرَ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa mengerjakan sholat dua raka'at setelah jum'at di rumahnya.\" Abu Daud berkata; \"Demikianlah yang di riwayatkan [Abdullah bin Dinar] dari [Ibnu Umar]. "
            },
            {
                "number": 945,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌأَنَّهُ رَأَى ابْنَ عُمَرَ يُصَلِّي بَعْدَ الْجُمُعَةِ فَيَنْمَازُ عَنْ مُصَلَّاهُ الَّذِي صَلَّى فِيهِ الْجُمُعَةَ قَلِيلًا غَيْرَ كَثِيرٍ قَالَ فَيَرْكَعُ رَكْعَتَيْنِ قَالَ ثُمَّ يَمْشِي أَنْفَسَ مِنْ ذَلِكَ فَيَرْكَعُ أَرْبَعَ رَكَعَاتٍ قُلْتُ لِعَطَاءٍ كَمْ رَأَيْتَ ابْنَ عُمَرَ يَصْنَعُ ذَلِكَ قَالَ مِرَارًاقَالَ أَبُو دَاوُد وَرَوَاهُ عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ وَلَمْ يُتِمَّهُ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Al Hasan] telah menceritakan kepada kami [Hajjaj bin Muhammad] dari [Ibnu Juraij] telah mengabarkan kepadaku ['Atha`] bahwa dia melihat [Ibnu Umar] mengerjakan sholat setelah (sholat) Jum'at, lalu dia bergeser sedikit dari tempat ia mengerjakan sholat Jum'at.\" 'Atha` berkata; \"Kemudian ia sholat dua raka'at.\" 'Atha` melanjutkan; \"Setelah itu Ibnu Umar berjalan sedikit dari tempat tersebut dan mengerjakan sholat empat raka'at.\" Tanyaku kepada 'Atha`; \"Berapa kalikah anda melihat Ibnu Umar melakukan hal itu?\" 'Atha` menjawab; \"Sering.\" Abu Daud mengatakan; \"Di riwayatkan pula oleh [Abdul Malik bin Abu Sulaiman], namun tidak selangka hadits di atas.\""
            },
            {
                "number": 946,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ حُمَيْدٍ عَنْ أَنَسٍ قَالَقَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وَلَهُمْ يَوْمَانِ يَلْعَبُونَ فِيهِمَا فَقَالَ مَا هَذَانِ الْيَوْمَانِ قَالُوا كُنَّا نَلْعَبُ فِيهِمَا فِي الْجَاهِلِيَّةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ قَدْ أَبْدَلَكُمْ بِهِمَا خَيْرًا مِنْهُمَا يَوْمَ الْأَضْحَى وَيَوْمَ الْفِطْرِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Humaid] dari [Anas] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam tiba di Madinah, sedangkan penduduknya memiliki dua hari khusus untuk permainan, maka beliau bersabda: \"Apakah maksud dari dua hari ini?\" mereka menjawab; \"Kami biasa mengadakan permainan pada dua hari tersebut semasa masih Jahiliyah.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda; \"Sesungguhnya Allah telah menggantikan untuk kalian yang lebih baik dari kedua hari tersebut, yaitu hari (raya) kurban (idul Aldha) dan hari raya idul fitri.\""
            },
            {
                "number": 947,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا صَفْوَانُ حَدَّثَنَا يَزِيدُ بْنُ خُمَيْرٍ الرَّحَبِيُّ قَالَخَرَجَ عَبْدُ اللَّهِ بْنُ بُسْرٍ صَاحِبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ النَّاسِ فِي يَوْمِ عِيدِ فِطْرٍ أَوْ أَضْحَى فَأَنْكَرَ إِبْطَاءَ الْإِمَامِ فَقَالَ إِنَّا كُنَّا قَدْ فَرَغْنَا سَاعَتَنَا هَذِهِ وَذَلِكَ حِينَ التَّسْبِيحِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Shufwan] telah menceritakan kepada kami [Yazid bin Khumair Ar Rahabi] dia berkata; [Abdullah bin Busr] -salah seorang sahabat Rasulullah shallallahu 'alaihi wasallam- keluar untuk melaksanakan sholat idul fitri atau idul Adha bersama orang-orang, dia tidak membenarkan keterlambatan imam, lalu berkata; \"Sesungguhnya kami dahulu pada saat seperti ini telah selesai melaksanakan sholat.\" waktu itu adalah waktu Dhuha.\""
            },
            {
                "number": 948,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ وَيُونُسَ وَحَبِيبٍ وَيَحْيَى بْنِ عَتِيقٍ وَهِشَامٍ فِي آخَرِينَ عَنْ مُحَمَّدٍ أَنَّ أُمَّ عَطِيَّةَ قَالَتْأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُخْرِجَ ذَوَاتِ الْخُدُورِ يَوْمَ الْعِيدِ قِيلَ فَالْحُيَّضُ قَالَ لِيَشْهَدْنَ الْخَيْرَ وَدَعْوَةَ الْمُسْلِمِينَ قَالَ فَقَالَتْ امْرَأَةٌ يَا رَسُولَ اللَّهِ إِنْ لَمْ يَكُنْ لِإِحْدَاهُنَّ ثَوْبٌ كَيْفَ تَصْنَعُ قَالَ تُلْبِسُهَا صَاحِبَتُهَا طَائِفَةً مِنْ ثَوْبِهَاحَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيَّوبُ عَنْ مُحَمَّدٍ عَنْ أُمِّ عَطِيَّةَ بِهَذَا الْخَبَرِ قَالَ وَيَعْتَزِلُ الْحُيَّضُ مُصَلَّى الْمُسْلِمِينَ وَلَمْ يَذْكُرْ الثَّوْبَ قَالَ وَحَدَّثَ عَنْ حَفْصَةَ عَنْ امْرَأَةٍ تُحَدِّثُهُ عَنْ امْرَأَةٍ أُخْرَى قَالَتْ قِيلَ يَا رَسُولَ اللَّهِ فَذَكَرَ مَعْنَى حَدِيثِ مُوسَى فِي الثَّوْبِ حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَ قَالَتْ كُنَّا نُؤْمَرُ بِهَذَا الْخَبَرِ قَالَتْ وَالْحُيَّضُ يَكُنَّ خَلْفَ النَّاسِ فَيُكَبِّرْنَ مَعَ النَّاسِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Ayyub], [Yunus], [Habib], [Yahya bin 'Atiq] dan [Hisyam] di riwayat yang lain, dari [Muhammad] bahwa [Ummu 'Athiyah] berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan kami supaya menyuruh keluar para wanita yang terpingit dalam rumah untuk keluar pada hari raya Ied, lalu di tanyakan; \"Bagaimana dengan wanita haid?\" beliau bersabda; \"Hendaknya ia menyaksikan kebaikan pada hari itu dan juga do'a dari kaum Muslimin.\" Perawi berkata; Seorang wanita bertanya; \"Wahai Rasulullah, bagaimana kalau sekiranya salah seorang dari wanita tidak memiliki pakaian, apa yang harus ia lakukan?\" beliau menjawab: \"Hendaknya saudaranya meminjami sebagian dari pakaiannya.\" Telah menceritakan kepada kami [Muhammad bin 'Ubaid] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Ayyub] dari [Muhammad] dari [Ummu 'Athiyah] seperti hadits ini, katanya; \"Hendaklah wanita haidh agak menjauh dari tempat sholat kaum Muslimin…\" tanpa menyebutkan; \"…pakaian…\" Perawi berkata; dan telah bercerita dari [Hafshah] dari [seorang wanita] menceritakan dari [seorang wanita lain] dia berkata; \"…di beritahukan; \"Wahai Rasulullah…\" lalu dia menyebutkan semakna dengan hadits Musa tentang \"pakaian.\" Telah menceritakan kepada kami [An Nufaili] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami ['Ashim Al Ahwal] dari [Hafshah binti Sirin] dari [Ummu 'Athiyah] dia berkata; \"Kami di perintah …\" seperti hadits ini, katanya; \"Hendaknya wanita-wanita hendaknya berada di belakang orang-orang dan bertakbir bersama mereka.\""
            },
            {
                "number": 949,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ يَعْنِي الطَّيَالِسِيَّ وَمُسْلِمٌ قَالَا حَدَّثَنَا إِسْحَقُ بْنُ عُثْمَانَ حَدَّثَنِي إِسْمَعِيلُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَطِيَّةَ عَنْ جَدَّتِهِ أُمِّ عَطِيَّةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا قَدِمَ الْمَدِينَةَ جَمَعَ نِسَاءَ الْأَنْصَارِ فِي بَيْتٍ فَأَرْسَلَ إِلَيْنَا عُمَرَ بْنَ الْخَطَّابِ فَقَامَ عَلَى الْبَابِ فَسَلَّمَ عَلَيْنَا فَرَدَدْنَا عَلَيْهِ السَّلَامَ ثُمَّ قَالَ أَنَا رَسُولُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْكُنَّ وَأَمَرَنَا بِالْعِيدَيْنِ أَنْ نُخْرِجَ فِيهِمَا الْحُيَّضَ وَالْعُتَّقَ وَلَا جُمُعَةَ عَلَيْنَا وَنَهَانَا عَنْ اتِّبَاعِ الْجَنَائِزِ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid yaitu Ath Thayalisi] dan [Muslim] keduanya berkata; telah menceritakan kepada kami [Ishaq bin 'Utsman] telah menceritakan kepadaku [Isma'il bin Abdurrahman bin 'Athiyah] dari [neneknya yaitu Ummu 'Athiyah] bahwa ketika Rasulullah shallallahu 'alaihi wasallam tiba di Madinah, beliau mengumpulkan para wanita Anshar di suatu rumah, beliau mengutus Umar bin Khattab untuk menemui kami, lalu Umar berdiri di depan pintu, dia memberi salam kepada kami dan kami pun menjawab salamnya, lalu dia berkata; \"Aku adalah utusan Rasulullah shallallahu 'alaihi wasallam kepada kalian, beliau memerintahkan kami untuk menyuruh keluar wanita haidh dan para hamba sahaya pada dua hari raya, tidak mewajibkan sholat jum'at atas kami dan beliau melarang kami ikut mengantar jenazah.\""
            },
            {
                "number": 950,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ إِسْمَعِيلَ بْنِ رَجَاءٍ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ح وَعَنْ قَيْسِ بْنِ مُسْلِمٍ عَنْ طَارِقِ بْنِ شِهَابٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَأَخْرَجَ مَرْوَانُ الْمِنْبَرَ فِي يَوْمِ عِيدٍ فَبَدَأَ بِالْخُطْبَةِ قَبْلَ الصَّلَاةِ فَقَامَ رَجُلٌ فَقَالَ يَا مَرْوَانُ خَالَفْتَ السُّنَّةَ أَخْرَجْتَ الْمِنْبَرَ فِي يَوْمِ عِيدٍ وَلَمْ يَكُنْ يُخْرَجُ فِيهِ وَبَدَأْتَ بِالْخُطْبَةِ قَبْلَ الصَّلَاةِ فَقَالَ أَبُو سَعِيدٍ الْخُدْرِيِّ مَنْ هَذَا قَالُوا فُلَانُ بْنُ فُلَانٍ فَقَالَ أَمَّا هَذَا فَقَدْ قَضَى مَا عَلَيْهِ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ رَأَى مُنْكَرًا فَاسْتَطَاعَ أَنْ يُغَيِّرَهُ بِيَدِهِ فَلْيُغَيِّرْهُ بِيَدِهِ فَإِنْ لَمْ يَسْتَطِعْ فَبِلِسَانِهِ فَإِنْ لَمْ يَسْتَطِعْ فَبِقَلْبِهِ وَذَلِكَ أَضْعَفُ الْإِيمَانِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy] dari [Isma'il bin Raja`] dari [ayahnya] dari [Abu Sa'id Al Khudri]. Dan telah di riwayatkan dari jalur lain, dan dari [Qais bin Muslim] dari [Thariq bin Syihab] dari [Abu Sa'id Al Khudri] dia berkata; \"Marwan pernah mengeluarkan mimbar pada waktu hari raya, lalu dia mulai khutbah sebelum sholat, maka seorang laki-laki berdiri dan berkata; \"Wahai Marwan, kamu telah menyelisihi sunnah, kamu telah mengeluarkan mimbar pada hari raya, padahal mimbar belum pernah sama sekali di keluarkan, dan kamu juga memulai khutbah sebelum sholat.\" Abu Sa'id Al Khudri berkata; \"Siapakah laki-laki ini?\" mereka menjawab; \"Fulan bin fulan.\" Abu Sa'id berkata; \"Orang ini telah melaksanakan kewajibannya ('Amar ma'ruf dan nahi munkar), aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa melihat kemungkaran, hendaklah semampunya ia merubah dengan tangannya, jika tidak mampu, maka dengan lisannya, dan jika tidak mampu, maka dengan hatinya, dan yang demikian itu adalah selemah-lemah iman.\""
            },
            {
                "number": 951,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ وَمُحَمَّدُ بْنُ بَكْرٍ قَالَا أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَسَمِعْتُهُ يَقُولُ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ يَوْمَ الْفِطْرِ فَصَلَّى فَبَدَأَ بِالصَّلَاةِ قَبْلَ الْخُطْبَةِ ثُمَّ خَطَبَ النَّاسَ فَلَمَّا فَرَغَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَزَلَ فَأَتَى النِّسَاءَ فَذَكَّرَهُنَّ وَهُوَ يَتَوَكَّأُ عَلَى يَدِ بِلَالٍ وَبِلَالٌ بَاسِطٌ ثَوْبَهُ تُلْقِي فِيهِ النِّسَاءُ الصَّدَقَةَ قَالَ تُلْقِي الْمَرْأَةُ فَتَخَهَا وَيُلْقِينَ وَيُلْقِينَ وَقَالَ ابْنُ بَكْرٍ فَتَخَتَهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Abdurrazaq] dan [Muhammad bin Bakr] keduanya berkata; telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku ['Atha`] dari [Jabir bin Abdullah] dia berkata; -saya mendengar dia (Jabir) berkata- sesungguhnya Nabi shallallahu 'alaihi wasallam berdiri pada hari raya fitri, lalu beliau mengerjakan sholat, beliau memulai sholat sebelum berkhutbah, setelah itu barulah beliau berkhutbah di hadapan manusia. Tatkala Nabi Allah shallallahu 'alaihi wasallam selesai khutbah, beliau turun lalu mendatangi kaum wanita, beliau memberi peringatan kepada mereka sambil bersandar kepada tangan Bilal, sedangkan Bilal sendiri membentangkan secarik kain sebagai tempat sedekah yang di sumbangkan oleh kaum perempuan.\" Kata Jabir; \"Ada seorang wanita yang melepas cincinnya dan melemparnya ke (kain tersebut), kemudian mereka bergantian melepaskan perhiasannya.\""
            },
            {
                "number": 952,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا ابْنُ كَثِيرٍ أَخْبَرَنَا شُعْبَةُ عَنْ أَيُّوبَ عَنْ عَطَاءٍ قَالَأَشْهَدُ عَلَى ابْنِ عَبَّاسٍ وَشَهِدَ ابْنُ عَبَّاسٍ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ خَرَجَ يَوْمَ فِطْرٍ فَصَلَّى ثُمَّ خَطَبَ ثُمَّ أَتَى النِّسَاءَ وَمَعَهُ بِلَالٌ قَالَ ابْنُ كَثِيرٍ أَكْبَرُ عِلْمِ شُعْبَةَ فَأَمَرَهُنَّ بِالصَّدَقَةِ فَجَعَلْنَ يُلْقِينَحَدَّثَنَا مُسَدَّدٌ وَأَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرٍو قَالَا حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ أَيُّوبَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ بِمَعْنَاهُ قَالَ فَظَنَّ أَنَّهُ لَمْ يُسْمِعْ النِّسَاءَ فَمَشَى إِلَيْهِنَّ وَبِلَالٌ مَعَهُ فَوَعَظَهُنَّ وَأَمَرَهُنَّ بِالصَّدَقَةِ فَكَانَتْ الْمَرْأَةُ تُلْقِي الْقُرْطَ وَالْخَاتَمَ فِي ثَوْبِ بِلَالٍ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ فِي هَذَا الْحَدِيثِ قَالَ فَجَعَلَتْ الْمَرْأَةُ تُعْطِي الْقُرْطَ وَالْخَاتَمَ وَجَعَلَ بِلَالٌ يَجْعَلُهُ فِي كِسَائِهِ قَالَ فَقَسَمَهُ عَلَى فُقَرَاءِ الْمُسْلِمِينَ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Katsir] telah mengabarkan kepada kami [Syu'bah] dari [Ayyub] dari ['Atha`] dia berkata; aku menyaksikan [Ibnu Abbas], dan Ibnu Abbas menyaksikan Rasulullah shallallahu 'alaihi wasallam, bahwa beliau keluar pada hari raya idul fitri, kemudian beliau sholat dan berkhutbah, setelah itu beliau bersama Bilal mendatangi kaum wanita -Ibnu Katsir mengatakan; Syu'bah adalah orang yang banyak ilmunya, (berkatanya) - lantas beliau menyuruh mereka bersedekah, maka mereka melepaskan perhiasannya.\" Telah menceritakan kepada kami [Musaddad] dan [Abu Ma'mar Abdullah bin 'Amru] keduanya berkata; telah menceritakan kepada kami [Abdul Warits] dari [Ayyub] dari ['Atha`] dari [Ibnu Abbas] dengan maksud yang sama, katanya; \"Beliau mengira kalau para wanita tidak mendengar khutbahnya, maka beliau bersama Bilal menemui mereka dan menasehati mereka serta menyuruh mereka supaya memperbanyak sedekah. Maka ada seorang wanita yang melepas anting dan cincinnya ke kain Bilal.\" Telah menceritakan kepada kami [Muhammad bin 'Ubaid] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari ['Atha`] dari [Ibnu Abbas] mengenai hadits ini, katanya; \"Lantas ada seorang wanita yang melepas anting dan cincinnya, lalu Bilal menaruh di kainnya.\" Jabir melanjutkan; \"Setelah itu, beliau membagi-bagi hasil sedekahnya kepada orang-orang miskin dari kalangan kaum Muslimin.\""
            },
            {
                "number": 953,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ عُيَيْنَةَ عَنْ أَبِي جَنَابٍ عَنْ يَزِيدَ بْنِ الْبَرَاءِ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نُووِلَ يَوْمَ الْعِيدِ قَوْسًا فَخَطَبَ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ibnu Uyainah] dari [Abu Jaban] dari [Yazid bin Bara'] dari [ayahnya] bahwasanya Nabi Shallallahu'alaihiwasallam diberikan sebuah busur pada waktu sholat Ied dan beliau berkhutbah diatasnya. "
            },
            {
                "number": 954,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ قَالَسَأَلَ رَجُلٌ ابْنَ عَبَّاسٍ أَشَهِدْتَ الْعِيدَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ وَلَوْلَا مَنْزِلَتِي مِنْهُ مَا شَهِدْتُهُ مِنْ الصِّغَرِ فَأَتَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَلَمَ الَّذِي عِنْدَ دَارِ كَثِيرِ بْنِ الصَّلْتِ فَصَلَّى ثُمَّ خَطَبَ وَلَمْ يَذْكُرْ أَذَانًا وَلَا إِقَامَةً قَالَ ثُمَّ أَمَرَنَا بِالصَّدَقَةِ قَالَ فَجَعَلَ النِّسَاءُ يُشِرْنَ إِلَى آذَانِهِنَّ وَحُلُوقِهِنَّ قَالَ فَأَمَرَ بِلَالًا فَأَتَاهُنَّ ثُمَّ رَجَعَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Abdurrahman bin 'Abis] dia berkata; seorang laki-laki bertanya kepada [Ibnu Abbas]; \"Apakah kamu pernah menyaksikan hari raya bersama Rasulullah shallallahu 'alaihi wasallam?\" jawabnya; \"Ya, sekiranya tidak karena kedudukanku di sisi beliau, niscaya aku tidak akan menyaksikan sejak kecil. Rasulullah shallallahu 'alaihi wasallam mendekati bendera yang mendatangi bendera yang berada di rumah Katsir bin Ash-Shalt, lalu beliau mengerjakan sholat kemudian menyampaikan khutbah. -tanpa menyebutkan adzan dan iqamah- Ibnu Abbas berkata; setelah itu beliau memerintahkan kami untuk bersedekah.\" Kata ibnu Abbas melanjutkan; \"Maka para wanita menunjuk ke telinga dan leher mereka (melepas anting dan kalung mereka -pent), \" Kata Ibnu Abbas; \"Beliau menyuruh Bilal mendatangi mereka (untuk mengambil hasil sedekah), lantas Bilal menyerahkan kepada Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 955,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ عَنْ الْحَسَنِ بْنِ مُسْلِمٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الْعِيدَ بِلَا أَذَانٍ وَلَا إِقَامَةٍ وَأَبَا بَكْرٍ وَعُمَرَ أَوْ عُثْمَانَ شَكَّ يَحْيَى",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij] dari [Al Hasan bin Muslim] dari [Thawus] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat Ied tanpa di iringi dengan adzan dan iqamah, begitu juga Abu Bakar dan Umar atau Utsman -Yahya ragu dalam redaksi haditsnya-.\""
            },
            {
                "number": 956,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَهَنَّادٌ قَالَا حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ يَعْنِي ابْنَ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَصَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرَ مَرَّةٍ وَلَا مَرَّتَيْنِ الْعِيدَيْنِ بِغَيْرِ أَذَانٍ وَلَا إِقَامَةٍ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abi Syaibah] dan [Hannan], keduanya berkata; telah menceritakan kepada kami [Abu Al Ahwash] dari [Simak yaitu Ibnu Harb] dari [Jabir bin Samurah] berkata; aku sholat ied bersama Nabi shallallahu 'alaihi wasallam tidak hanya satu kali dan tidak pula dua kali, tanpa ada adzan dan iqomat. "
            },
            {
                "number": 957,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُكَبِّرُ فِي الْفِطْرِ وَالْأَضْحَى فِي الْأُولَى سَبْعَ تَكْبِيرَاتٍ وَفِي الثَّانِيَةِ خَمْسًاحَدَّثَنَا ابْنُ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي ابْنُ لَهِيعَةَ عَنْ خَالِدِ بْنِ يَزِيدَ عَنْ ابْنِ شِهَابٍ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ سِوَى تَكْبِيرَتَيْ الرُّكُوعِ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Ibnu Lahi'ah] dari ['Uqail] dari [Ibnu Syihab] dari ['Urwah] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam sholat idul fitri dan Adha dan biasa takbir tujuh kali pada raka'at pertama dan lima kali pada raka'at kedua.\" telah menceritakan kepada kami [Ibnu As Sarh] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Ibnu Lahi'ah] dari [Khalid bin Yazid] dari [Ibnu Syihab] dengan sanad dan maksud yang sama, katanya; \"Selain takbir untuk ruku'.\""
            },
            {
                "number": 958,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَبْدِ الرَّحْمَنِ الطَّائِفِيَّ يُحَدِّثُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّكْبِيرُ فِي الْفِطْرِ سَبْعٌ فِي الْأُولَى وَخَمْسٌ فِي الْآخِرَةِ وَالْقِرَاءَةُ بَعْدَهُمَا كِلْتَيْهِمَا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Al Mu'tamir] dia berkata; aku mendengar [Abdullah bin Abdurrahman Ath Thaifi] menceritakan dari [Amru bin Syu'aib] dari [ayahnya] dari [Abdullah bin Amr bin Ash] berkata Nabi Shallallahu'alaihiwasallam bersabda: takbir pada waktu sholat idul fitri tujuh kali pada rakaat pertama dan lima pada rakaat terakhir dan bacaan AlQur'an setelah itu semua. "
            },
            {
                "number": 959,
                "arab": "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ حَيَّانَ عَنْ أَبِي يَعْلَى الطَّائِفِيِّ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُكَبِّرُ فِي الْفِطْرِ الْأُولَى سَبْعًا ثُمَّ يَقْرَأُ ثُمَّ يُكَبِّرُ ثُمَّ يَقُومُ فَيُكَبِّرُ أَرْبَعًا ثُمَّ يَقْرَأُ ثُمَّ يَرْكَعُقَالَ أَبُو دَاوُد رَوَاهُ وَكِيعٌ وَابْنُ الْمُبَارَكِ قَالَا سَبْعًا وَخَمْسًا",
                "id": "Telah menceritakan kepada kami [Abu Taubah Ar Rabi' bin Nafi'] telah menceritakan kepada kami [Sulaiman yaitu Ibnu Hayyan] dari [Abu Ya'la Ath Tha`ifi] dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Nabi shallallahu 'alaihi wasallam dalam sholat idul fitri bertakbir tujuh kali pada raka'at pertama kemudian membaca (Fatihah dan surat Al Qur'an), kemudian beliau berdiri dan bertakbir empat kali lalu membaca (Fatihah dan surat Al Qur'an) setelah itu beliau ruku'.\" Abu Daud mengatakan; \"di riwayatkan pula oleh [Waki'] dan [Ibnu Mubarrak], keduanya berkata; \"(bertakbir) tujuh kali dan lima kali.\""
            },
            {
                "number": 960,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَابْنُ أَبِي زِيَادٍ الْمَعْنَى قَرِيبٌ قَالَا حَدَّثَنَا زَيْدٌ يَعْنِي ابْنَ حُبَابٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ عَنْ أَبِيهِ عَنْ مَكْحُولٍ قَالَ أَخْبَرَنِي أَبُو عَائِشَةَ جَلِيسٌ لِأَبِي هُرَيْرَةَأَنَّ سَعِيدَ بْنَ الْعَاصِ سَأَلَ أَبَا مُوسَى الْأَشْعَرِيَّ وَحُذَيْفَةَ بْنَ الْيَمَانِ كَيْفَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَبِّرُ فِي الْأَضْحَى وَالْفِطْرِ فَقَالَ أَبُو مُوسَى كَانَ يُكَبِّرُ أَرْبَعًا تَكْبِيرَهُ عَلَى الْجَنَائِزِفَقَالَ حُذَيْفَةُ صَدَقَ فَقَالَ أَبُو مُوسَى كَذَلِكَ كُنْتُ أُكَبِّرُ فِي الْبَصْرَةِ حَيْثُ كُنْتُ عَلَيْهِمْ و قَالَ أَبُو عَائِشَةَ وَأَنَا حَاضِرٌ سَعِيدَ بْنَ الْعَاصِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] dan [Ibnu Abu Ziyad] sedangkan maknanya saling berdekatan, keduanya berkata; telah menceritakan kepada kami [Zaid yaitu Ibnu Hubab] dari [Abdurrahman bin Tsauban] dari [ayahnya] dari [Makhul] dia berkata; telah mengabarkan kepadaku [Abu 'Aisyah] -sahabat Abu Hurairah- bahwa Sa'id bin Al 'Ash bertanya kepada [Abu Musa Al Asy'ari] dan [Hudzaifah bin Yaman]; \"Bagaimanakah cara Rasulullah shallallahu 'alaihi wasallam bertakbir pada hari raya Adha dan fitri?\" Abu Musa menjawab; \"Biasanya beliau bertakbir empat kali, sebagaimana sholat jenazah.\" Hudzaifah menimpali; \"Dia benar.\" Abu Musa berkata; \"aku juga bertakbir seperti itu ketika di Bashrah, ketika aku menjadi pemimpin mereka (penduduk Bashrah).\" Abu Aisyah berkata; \"Aku juga ikut hadir ketika Sa'id bin Al Ash mengajukan pertanyaan tersebut.\""
            },
            {
                "number": 961,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍأَنَّ عُمَرَ بْنَ الْخَطَّابِ سَأَلَ أَبَا وَاقِدٍ اللَّيْثِيَّ مَاذَا كَانَ يَقْرَأُ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْأَضْحَى وَالْفِطْرِ قَالَ كَانَ يَقْرَأُ فِيهِمَا ق وَالْقُرْآنِ الْمَجِيدِ وَاقْتَرَبَتْ السَّاعَةُ وَانْشَقَّ الْقَمَرُ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Dlamrah bin Sa'id Al Mazini] dari ['ubaidhullah bin Abdullah bin 'Utbah bin Mas'ud] bahwa Umar bin Khattab bertanya kepada [Abu Waqid Al Laitsi]; \"Apa yang biasa di baca oleh Rasulullah shallallahu 'alaihi wasallam pada waktu sholat idul Adha dan fitri?\" dia menjawab; \"Pada sholat dua hari raya tersebut, beliau biasa membaca; \"Qaaf wal quraanil majiid\" dan \"Waqtarabatis saa'ah wan syaqqal Qamar.\""
            },
            {
                "number": 962,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى السِّينَانِيُّ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ قَالَشَهِدْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعِيدَ فَلَمَّا قَضَى الصَّلَاةَ قَالَ إِنَّا نَخْطُبُ فَمَنْ أَحَبَّ أَنْ يَجْلِسَ لِلْخُطْبَةِ فَلْيَجْلِسْ وَمَنْ أَحَبَّ أَنْ يَذْهَبَ فَلْيَذْهَبْقَالَ أَبُو دَاوُد هَذَا مُرْسَلٌ عَنْ عَطَاءٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin As Shabah Al Bazzaz] telah menceritakan kepada kami [Al Fadl bin Musa As Sinani] telah menceritakan kepada kami [Ibnu Juraij] dari ['Atha`] dari [Abdullah bin As Sa`ib] dia berkata; \"Aku menyaksikan sholat Ied bersama Rasulullah shallallahu 'alaihi wasallam, setelah melaksanakan sholat, beliau bersabda: \"Kami akan melaksanakan khutbah, barangsiapa ingin mendengarkan khutbah, hendaklah dia duduk. Dan barangsiapa ingin pergi, silahkan pergi.\" Abu Daud berkata; \"Hadits ini Mursal, dari 'Atha` dari Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 963,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ يَوْمَ الْعِيدِ فِي طَرِيقٍ ثُمَّ رَجَعَ فِي طَرِيقٍ آخَرَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] telah menceritakan kepada kami [Abdullah yaitu Ibnu Umar] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam, ketika hendak berangkat sholat Ied, beliau melewati suatu jalan dan kembali dari sholat Ied melewati jalan yang lain.\""
            },
            {
                "number": 964,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ جَعْفَرِ بْنِ أَبِي وَحْشِيَّةَ عَنْ أَبِي عُمَيْرِ بْنِ أَنَسٍ عَنْ عُمُومَةٍ لَهُ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَكْبًا جَاءُوا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَشْهَدُونَ أَنَّهُمْ رَأَوْا الْهِلَالَ بِالْأَمْسِ فَأَمَرَهُمْ أَنْ يُفْطِرُوا وَإِذَا أَصْبَحُوا أَنْ يَغْدُوا إِلَى مُصَلَّاهُمْ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Ja'far bin Abu wahsyiyah] dari [Abu 'Umair bin Anas] dari [paman-pamannya yang juga sahabat Rasulullah shallallahu 'alaihi wasallam] bahwa suatu rombongan datang kepada Nabi shallallahu 'alaihi wasallam, mereka bersaksi bahwa mereka telah melihat hilal kemarin. Maka beliau memerintahkan mereka (masyarakat) untuk berbuka puasa, dan keesokan harinya, mereka berpagi-pagi menuju ke tempat sholat (untuk melaksanakan sholat hari raya).\""
            },
            {
                "number": 965,
                "arab": "حَدَّثَنَا حَمْزَةُ بْنُ نُصَيْرٍ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سُوَيْدٍ أَخْبَرَنِي أُنَيْسُ بْنُ أَبِي يَحْيَى أَخْبَرَنِي إِسْحَقُ بْنُ سَالِمٍ مَوْلَى نَوْفَلِ بْنِ عَدِيٍّ أَخْبَرَنِي بَكْرُ بْنُ مُبَشِّرٍ الْأَنْصَارِيُّ قَالَكُنْتُ أَغْدُو مَعَ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمُصَلَّى يَوْمَ الْفِطْرِ وَيَوْمَ الْأَضْحَى فَنَسْلُكُ بَطْنَ بَطْحَانَ حَتَّى نَأْتِيَ الْمُصَلَّى فَنُصَلِّيَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ نَرْجِعَ مِنْ بَطْنِ بَطْحَانَ إِلَى بُيُوتِنَا",
                "id": "Telah menceritakan kepada kami [Hamzah bin Nushair] telah menceritakan kepada kami [Ibnu Abu Maryam] telah menceritakan kepada kami [Ibrahim bin Suwaid] telah mengabarkan kepadaku [Unais bin Abu Yahya] telah mengabarkan kepadaku [Ishaq bin Salim bekas budak Naufal bin 'Adi] telah mengabarkan kepadaku [Bakr bin Mubasyir Al Anshari] dia berkata; \"Aku berangkat untuk melaksanakan sholat idul fitri dan idul Adha bersama sahabat-sahabat Rasulullah shallallahu 'alaihi wasallam. Ketika pergi, kami melewati lembah Bathhan hingga sampai di tempat sholat, lalu kami sholat bersama Rasulullah shallallahu 'alaihi wasallam, ketika kami pulang ke rumah masing-masing, kami juga lewat lembah Bathhan.\""
            },
            {
                "number": 966,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ حَدَّثَنِي عَدِيُّ بْنُ ثَابِتٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فِطْرٍ فَصَلَّى رَكْعَتَيْنِ لَمْ يُصَلِّ قَبْلَهُمَا وَلَا بَعْدَهُمَا ثُمَّ أَتَى النِّسَاءَ وَمَعَهُ بِلَالٌ فَأَمَرَهُنَّ بِالصَّدَقَةِ فَجَعَلَتْ الْمَرْأَةُ تُلْقِي خُرْصَهَا وَسِخَابَهَا",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepadaku ['Adi bin Tsabit] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam keluar pada hari raya fitri, kemudian sholat dia raka'at, beliau tidak sholat (sunnah) baik sebelum maupun sesudahnya. Setelah itu, beliau bersama Bilal pergi menemui kaum wanita, dan menyuruh mereka memperbanyak sedekah, maka kaum wanita melepas anting dan kalung mereka.\""
            },
            {
                "number": 967,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ ح و حَدَّثَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا رَجُلٌ مِنْ الْقَرَوِيِّينَ وَسَمَّاهُ الرَّبِيعُ فِي حَدِيثِهِ عِيسَى بْنَ عَبْدِ الْأَعْلَى بْنِ أَبِي فَرْوَةَ سَمِعَ أَبَا يَحْيَى عُبَيْدَ اللَّهِ التَّيْمِيَّ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَأَنَّهُ أَصَابَهُمْ مَطَرٌ فِي يَوْمِ عِيدٍ فَصَلَّى بِهِمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْعِيدِ فِي الْمَسْجِدِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Al Walid] dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Ar Rabi' bin Sulaiman] telah menceritakan kepada kami [Abdullah bin Yusuf] telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami seorang dari pedesaan yang Ar Rabi' beri nama dalam haditsnya [Isa bin Abdul A'la bin Abi Farawwah] dia mendengar [Abu Yahya 'ubaidhullah Attaimi] mengatakan dari [Abu Hurairah] berkata; bahwa kami pernah kehujanan pada waktu pelaksanaan sholat Ied, maka Nabi shallallahu 'alaihi wasallam melaksanakannya di masjid.\""
            },
            {
                "number": 968,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ الْمَرْوَزِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَمِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ بِالنَّاسِ لِيَسْتَسْقِيَ فَصَلَّى بِهِمْ رَكْعَتَيْنِ جَهَرَ بِالْقِرَاءَةِ فِيهِمَا وَحَوَّلَ رِدَاءَهُ وَرَفَعَ يَدَيْهِ فَدَعَا وَاسْتَسْقَى وَاسْتَقْبَلَ الْقِبْلَةَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Tsabit Al Mawarzi] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Abbad bin Tamim] dari [pamannya] bahwa Rasulullah shallallahu 'alaihi wasallam keluar bersama orang-orang untuk memohon hujan, lalu beliau sholat dua raka'at dengan mengeraskan bacaan pada raka'at tersebut, beliau membalik kain selendangnya sambil berdo'a dan memohon supaya di turunkan hujan dengan menghadap ke arah Kiblat.\""
            },
            {
                "number": 969,
                "arab": "حَدَّثَنَا ابْنُ السَّرْحِ وَسُلَيْمَانُ بْنُ دَاوُدَ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ وَيُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عَبَّادُ بْنُ تَمِيمٍ الْمَازِنِيُّ أَنَّهُ سَمِعَ عَمَّهُ وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا يَسْتَسْقِي فَحَوَّلَ إِلَى النَّاسِ ظَهْرَهُ يَدْعُو اللَّهَ عَزَّ وَجَلَّ قَالَ سُلَيْمَانُ بْنُ دَاوُدَ وَاسْتَقْبَلَ الْقِبْلَةَ وَحَوَّلَ رِدَاءَهُ ثُمَّ صَلَّى رَكْعَتَيْنِ قَالَ ابْنُ أَبِي ذِئْبٍ وَقَرَأَ فِيهِمَا زَادَ ابْنُ السَّرْحِ يُرِيدُ الْجَهْرَحَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ قَالَ قَرَأْتُ فِي كِتَابِ عَمْرِو بْنِ الْحَارِثِ يَعْنِي الْحِمْصِيَّ عَنْ عَبْدِ اللَّهِ بْنِ سَالِمٍ عَنْ الزُّبَيْدِيِّ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ بِهَذَا الْحَدِيثِ بِإِسْنَادِهِ لَمْ يَذْكُرْ الصَّلَاةَ قَالَ وَحَوَّلَ رِدَاءَهُ فَجَعَلَ عِطَافَهُ الْأَيْمَنَ عَلَى عَاتِقِهِ الْأَيْسَرِ وَجَعَلَ عِطَافَهُ الْأَيْسَرَ عَلَى عَاتِقِهِ الْأَيْمَنِ ثُمَّ دَعَا اللَّهَ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Ibnu As Sarh] dan [Sulaiman bin Daud] keduanya berkata; telah mengabarkan kepada kami [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku [Ibnu Abu Dzi`b] dan [Yunus] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku ['Abbad bin Tamim Al Mazini] bahwa dia mendengar [pamannya] -dia termasuk dari salah seorang sahabat Rasulullah shallallahu 'alaihi wasallam- dia berkata; \"Pada suatu hari, Rasulullah shallallahu 'alaihi wasallam keluar untuk memohon hujan, lalu beliau membalikkan punggungnya dari orang-orang, beliau berdo'a kepada Allah 'azza wajalla.\" Sulaiman bin Daud mengatakan; \"Dengan menghadap ke arah Kiblat, kemudian beliau merubah posisi selendangnya, lalu sholat dua raka'at.\" Ibnu Abu Dzi`b berkata; \"…… dalam dua raka'at tersebut, beliau membaca (surat Al Qur'an).\" Ibnu Sarh menambahkan; \"Maksudnya dengan jelas.\" Telah menceritakan kepada kami [Muhammad bin 'Auf] dia berkata; \"Aku membaca di kitabnya ['Amru bin Al Harits yaitu Al Himshi] dari [Abdullah bin Salim] dari [Az Zubaidi] dari [Muhammad bin Muslim] seperti hadits ini berserta sanadnya, namun dia tidak menyebutkan 'sholat', katanya; \"Kemudian beliau merubah posisi selendangnya, hingga ujung selendang kanannya di sebelah pundak kiri, dan ujung selendang di sebelah kiri menjadi di sebelah kanan, kemudian beliau berdo'a kepada Allah 'azza wajalla.\""
            },
            {
                "number": 970,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ عَنْ عُمَارَةَ بْنِ غَزِيَّةَ عَنْ عَبَّادِ بْنِ تَمِيمٍ أَنَّ عَبْدَ اللَّهِ بْنَ زَيْدٍ قَالَاسْتَسْقَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ خَمِيصَةٌ لَهُ سَوْدَاءُ فَأَرَادَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَأْخُذَ بِأَسْفَلِهَا فَيَجْعَلَهُ أَعْلَاهَا فَلَمَّا ثَقُلَتْ قَلَبَهَا عَلَى عَاتِقِهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdul Aziz] dari ['Umarah bin Ghaziyah] dari ['Abbad bin Tamim] bahwa [Abdullah bin Zaid] berkata; \"Rasulullah shallallahu 'alaihi wasallam memohon di turunkannya hujan, sedangkan waktu itu beliau memakai pakaian berwarna hitam, beliau keberatan ketika hendak meletakkan bagian kain yang ada di bawah ke atas, maka beliau membaliknya di atas pundak.\""
            },
            {
                "number": 971,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ نَحْوَهُ قَالَا حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ حَدَّثَنَا هِشَامُ بْنُ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ كِنَانَةَ قَالَ أَخْبَرَنِي أَبِي قَالَأَرْسَلَنِي الْوَلِيدُ بْنُ عُتْبَةَ قَالَ عُثْمَانُ ابْنُ عُقْبَةَ وَكَانَ أَمِيرَ الْمَدِينَةِ إِلَى ابْنِ عَبَّاسٍ أَسْأَلُهُ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الِاسْتِسْقَاءِ فَقَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَبَذِّلًا مُتَوَاضِعًا مُتَضَرِّعًا حَتَّى أَتَى الْمُصَلَّى زَادَ عُثْمَانُ فَرَقَى عَلَى الْمِنْبَرِ ثُمَّ اتَّفَقَا وَلَمْ يَخْطُبْ خُطَبَكُمْ هَذِهِ وَلَكِنْ لَمْ يَزَلْ فِي الدُّعَاءِ وَالتَّضَرُّعِ وَالتَّكْبِيرِ ثُمَّ صَلَّى رَكْعَتَيْنِ كَمَا يُصَلِّي فِي الْعِيدِقَالَ أَبُو دَاوُد وَالْإِخْبَارُ لِلنُّفَيْلِيِّ وَالصَّوَابُ ابْنُ عُقْبَةَ",
                "id": "Telah menceritakan kepada kami [An Nufaili] dan [Utsman bin Abu Syaibah] semisalnya, keduanya berkata; telah menceritakan kepada kami [Hatim bin Ismail] telah berkata kepada kami [Hisyam bin Ishak bin Abdullah bin Kinanah] dia berkata; telah mengabarkan kepadau [ayahku] dia berkata; bahwa AlWalid bin Utbah-atau Utsman bin Uqbah- gubernur Madinah mengutus aku untuk menemui Ibnu Abbas untuk menanyakan kepadanya tentang sholat istisqa yang dilakukan Rasulullah Shollallahu alaihi wasallam, maka [Ibnu Abbas] menjawab bahwa Rasulullah Shollallahu alaihi wasallam keluar untuk melaksanakan sholat istisqa dalam keadaan lusuh, tawadhu' dan khusyu' hingga beliau sampai di tempat sholat- Utsman menambahkan- kemudian beliau naik mimbar -dan keduanya sepakat bahwa- beliau tidak khutbah, akan tetapi beliau berdo'a dan betul-betul khusyu' dalam berdo'a dan beliau bertakbir kemudian beliau sholat dua rakaat sebagaimana sholat Ied. Abu Daud berkata ikhbar bagi Nufaili dan yang benar adalah Ibnu Uqbah. "
            },
            {
                "number": 972,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ عَنْ يَحْيَى عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ عَنْ عَبَّادِ بْنِ تَمِيمٍ أَنَّ عَبْدَ اللَّهِ بْنَ زَيْدٍ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ إِلَى الْمُصَلَّى يَسْتَسْقِي وَأَنَّهُ لَمَّا أَرَادَ أَنْ يَدْعُوَ اسْتَقْبَلَ الْقِبْلَةَ ثُمَّ حَوَّلَ رِدَاءَهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] telah menceritakan kepada kami [Sulaiman yaitu Ibnu Bilal] dari [Yahya] dari [Abu Bakr bin Muhammad] dari ['Abbad bin Tamim] bahwa [Abdullah bin Zaid] telah mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam keluar menuju Mushalla (tempat sholat) memohon di turunkannya hujan, dan ketika beliau hendak berdo'a, beliau menghadap kiblat sambil merubah posisi selendangnya.\""
            },
            {
                "number": 973,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ أَنَّهُ سَمِعَ عَبَّادَ بْنَ تَمِيمٍ يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ زَيْدٍ الْمَازِنِيَّ يَقُولُخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمُصَلَّى فَاسْتَسْقَى وَحَوَّلَ رِدَاءَهُ حِينَ اسْتَقْبَلَ الْقِبْلَةَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abdullah bin Abu Bakr] bahwa dia mendengar ['Abbad bin Tamim] berkata; saya mendengar [Abdullah bin Zaid Al Mazini] berkata; \"Rasulullah shallallahu 'alaihi wasallam keluar menuju mushalla (tempat sholat), kemudian beliau (berdo'a) memohon di turunkannya hujan, beliau merubah posisi selendangnya sambil menghadap ke Kiblat.\""
            },
            {
                "number": 974,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ حَيْوَةَ وَعُمَرَ بْنِ مَالِكٍ عَنْ ابْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ عُمَيْرٍ مَوْلَى بَنِي آبِي اللَّحْمِأَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَسْقِي عِنْدَ أَحْجَارِ الزَّيْتِ قَرِيبًا مِنْ الزَّوْرَاءِ قَائِمًا يَدْعُو يَسْتَسْقِي رَافِعًا يَدَيْهِ قِبَلَ وَجْهِهِ لَا يُجَاوِزُ بِهِمَا رَأْسَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Salamah Al Muradi] telah mengabarkan kepada kami [Ibnu wahb] dari [Haiwah] dan [Umar bin Malik] dari [Ibnul Had] dari [Muhammad bin Ibrahim] dari ['Umair bekas budak Bani Abu Lahm] bahwa dia melihat Nabi shallallahu 'alaihi wasallam memohon supaya di turunkannya hujan di Ahjaruz Zait dekat Zaura` dengan berdiri sambil berdo'a memohon diturunkannya hujan seraya mengangkat kedua tangannya ke depan dan tidak melebihi kepalanya.\""
            },
            {
                "number": 975,
                "arab": "حَدَّثَنَا ابْنُ أَبِي خَلَفٍ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا مِسْعَرٌ عَنْ يَزِيدَ الْفَقِيرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَأَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَوَاكِي فَقَالَ اللَّهُمَّ اسْقِنَا غَيْثًا مُغِيثًا مَرِيئًا مَرِيعًا نَافِعًا غَيْرَ ضَارٍّ عَاجِلًا غَيْرَ آجِلٍ قَالَ فَأَطْبَقَتْ عَلَيْهِمْ السَّمَاءُ",
                "id": "Telah menceritakan kepada kami [Ibnu Abu Khalaf] telah menceritakan kepada kami [Muhammad bin 'Ubaid] telah menceritakan kepada kami [Mis'ar] dari [Yazid Al Faqir] dari [Jabir bin Abdillah] dia berkata; \"Beberapa wanita mendatangi Rasulullah shallallahu 'alaihi wasallam sambil menangis (karena kekeringan), kemudian beliau berdo'a: \"Allahummasqina ghaitsan mughitsan mari'an nafi'an ghair dharrin 'ajilan ghaira ajilin\" (ya Allah, turunkanlah kepada kami hujan yang dapat menolong kami, yang menyenangkan kami, menyuburkan lagi bermanfaat dan tidak membahayakan, segera jangan ditunda-tunda).\" Seketika itu juga, langit menurunkan hujannya atas mereka.\""
            },
            {
                "number": 976,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَرْفَعُ يَدَيْهِ فِي شَيْءٍ مِنْ الدُّعَاءِ إِلَّا فِي الِاسْتِسْقَاءِ فَإِنَّهُ كَانَ يَرْفَعُ يَدَيْهِ حَتَّى يُرَى بَيَاضُ إِبِطَيْهِ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah mengabarkan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam tidak pernah mengangkat kedua tangannya ketika berdo'a kecuali ketika meminta hujan, ketika itu beliau mengangkat kedua tangan beliau sehingga terlihat putih ketiaknya.\""
            },
            {
                "number": 977,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَسْتَسْقِي هَكَذَا يَعْنِي وَمَدَّ يَدَيْهِ وَجَعَلَ بُطُونَهُمَا مِمَّا يَلِي الْأَرْضَ حَتَّى رَأَيْتُ بَيَاضَ إِبِطَيْهِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Muhammad Az Za'farani] telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad] telah mengabarkan kepada kami [Tsabit] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam meminta hujan dengan begini maksudnya beliau memanjangkan kedua tangannya dengan menjadikan punggung telapak tangannya menghadap ke arah bumi, sehingga aku melihat putih ketiaknya.\""
            },
            {
                "number": 978,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ أَخْبَرَنِي مَنْرَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو عِنْدَ أَحْجَارِ الزَّيْتِ بَاسِطًا كَفَّيْهِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Syu'bah] dari ['Abdi Rabbihi bin Sa'id] dari [Muhammad bin Ibrahim] telah mengabarkan kepadaku [seorang yang pernah melihat Nabi shallallahu 'alaihi wasallam] bahwa beliau pernah berdo'a dekat Ahjaariz Zait sambil membentangkan kedua telapak tangan beliau.\""
            },
            {
                "number": 979,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا خَالِدُ بْنُ نِزَارٍ حَدَّثَنِي الْقَاسِمُ بْنُ مَبْرُورٍ عَنْ يُونُسَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْشَكَا النَّاسُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُحُوطَ الْمَطَرِ فَأَمَرَ بِمِنْبَرٍ فَوُضِعَ لَهُ فِي الْمُصَلَّى وَوَعَدَ النَّاسَ يَوْمًا يَخْرُجُونَ فِيهِ قَالَتْ عَائِشَةُ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ بَدَا حَاجِبُ الشَّمْسِ فَقَعَدَ عَلَى الْمِنْبَرِ فَكَبَّرَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحَمِدَ اللَّهَ عَزَّ وَجَلَّ ثُمَّ قَالَ إِنَّكُمْ شَكَوْتُمْ جَدْبَ دِيَارِكُمْ وَاسْتِئْخَارَ الْمَطَرِ عَنْ إِبَّانِ زَمَانِهِ عَنْكُمْ وَقَدْ أَمَرَكُمْ اللَّهُ عَزَّ وَجَلَّ أَنْ تَدْعُوهُ وَوَعَدَكُمْ أَنْ يَسْتَجِيبَ لَكُمْ ثُمَّ قَالَ{ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ الرَّحْمَنِ الرَّحِيمِ مَلِكِ يَوْمِ الدِّينِ }لَا إِلَهَ إِلَّا اللَّهُ يَفْعَلُ مَا يُرِيدُ اللَّهُمَّ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْغَنِيُّ وَنَحْنُ الْفُقَرَاءُ أَنْزِلْ عَلَيْنَا الْغَيْثَ وَاجْعَلْ مَا أَنْزَلْتَ لَنَا قُوَّةً وَبَلَاغًا إِلَى حِينٍ ثُمَّ رَفَعَ يَدَيْهِ فَلَمْ يَزَلْ فِي الرَّفْعِ حَتَّى بَدَا بَيَاضُ إِبِطَيْهِ ثُمَّ حَوَّلَ إِلَى النَّاسِ ظَهْرَهُ وَقَلَبَ أَوْ حَوَّلَ رِدَاءَهُ وَهُوَ رَافِعٌ يَدَيْهِ ثُمَّ أَقْبَلَ عَلَى النَّاسِ وَنَزَلَ فَصَلَّى رَكْعَتَيْنِ فَأَنْشَأَ اللَّهُ سَحَابَةً فَرَعَدَتْ وَبَرَقَتْ ثُمَّ أَمْطَرَتْ بِإِذْنِ اللَّهِ فَلَمْ يَأْتِ مَسْجِدَهُ حَتَّى سَالَتْ السُّيُولُ فَلَمَّا رَأَى سُرْعَتَهُمْ إِلَى الْكِنِّ ضَحِكَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى بَدَتْ نَوَاجِذُهُ فَقَالَ أَشْهَدُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ وَأَنِّي عَبْدُ اللَّهِ وَرَسُولُهُقَالَ أَبُو دَاوُد وَهَذَا حَدِيثٌ غَرِيبٌ إِسْنَادُهُ جَيِّدٌ أَهْلُ الْمَدِينَةِ يَقْرَءُونَ{ مَلِكِ يَوْمِ الدِّينِ }وَإِنَّ هَذَا الْحَدِيثَ حُجَّةٌ لَهُمْ",
                "id": "Telah menceritakan kepada kami [Harun bin Sa'id Al Aili] telah menceritakan kepada kami [Khalid bin Nizar] telah menceritakan kepadaku [Al Qasim bin Mabrur] dari [Yunus] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Aisyah] dia berkata; \"Orang-orang mengadu kepada Rasulullah shallallahu 'alaihi wasallam tentang musim kemarau yang panjang, maka beliau memerintahkan untuk meletakkan mimbar di tempat sholat (tanah lapang), lalu beliau berjanji kepada orang-orang untuk bertemu pada suatu hari yang telah di tentukan.\" Aisyah berkata; \"Maka Rasulullah shallallahu 'alaihi wasallam keluar ketika matahari mulai terlihat, lalu beliau duduk di mimbar, beliau shallallahu 'alaihi wasallam bertakbir dan memuji Allah Azza Wa Jalla, lalu bersabda: \"Sesungguhnya kalian mengadu kepadaku tentang kegersangan negeri kalian dan keterlambatan turunnya hujan dari musimnya, padahal Allah Azza Wa Jalla telah memerintahkan kalian agar kalian memohon kepadanya, dan berjanji akan mengabulkan do'a kalian, kemudian beliau mengucapkan: \"Segala puji bagi Allah, Rabb semesta alam, Maha Pemurah lagi Maha Penyayang. Dzat yang menguasai hari Pembalasan. (AlFatihah: 2-4). Tidak ada ilah yang berhak disembah kecuali Dia, Dia melakukan apa saja yang dikehendaki. Ya Allah, Engkau adalah Allah, tidak ada tuhan ilah yang berhak disembah kecuali Engkau, Maha kaya sementara kami yang membutuhkan, maka turunkanlah hujan kepada kami dan jadikanlah apa yang telah Engkau turunkan kekuatan bagi kami dan sebagai bekal di hari yang di tetapkan.\" kemudian beliau mengangkat kedua tangannya, dan senantiasa mengangkat kedua tangannya hingga terlihat putih ketiak beliau, kemudian beliau membalikkan punggungnya membelakangi orang-orang dan merubah posisi selendangnya, sedangkan beliau masih mengangkat kedua tangannya. Kemudian beliau menghadap ke orang-orang, lalu beliau turun dari mimbar dan sholat dua raka'at. Seketika itu Allah mendatangkan awan yang di sertai dengan gemuruh dan kilat, Maka turunlah hujan dengan izin Allah, beliau tidak kembali menuju masjid sampai air bah mengalir (di sekitarnya), ketika beliau melihat orang-orang berdesak-desakan mencari tempat berteduh, beliau tersenyum hingga terlihat gigi gerahamnya, lalu bersabda: \"Aku bersaksi bahwa Allah adalah Maha kuasa atas segala sesuatu dan aku adalah hamba dan rasul-Nya.\" Abu Daud berkata; \"Ini adalah hadits gharib, tapi sanadnya bagus, penduduk Madinah mambaca \"Malikiyaumid-din\" dan hadits ini juga menjadi argumentasi mereka.\""
            },
            {
                "number": 980,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ وَيُونُسَ بْنِ عُبَيْدٍ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَأَصَابَ أَهْلَ الْمَدِينَةِ قَحْطٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَيْنَمَا هُوَ يَخْطُبُنَا يَوْمَ جُمُعَةٍ إِذْ قَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَ الْكُرَاعُ هَلَكَ الشَّاءُ فَادْعُ اللَّهَ أَنْ يَسْقِيَنَا فَمَدَّ يَدَيْهِ وَدَعَا قَالَ أَنَسٌ وَإِنَّ السَّمَاءَ لَمِثْلُ الزُّجَاجَةِ فَهَاجَتْ رِيحٌ ثُمَّ أَنْشَأَتْ سَحَابَةً ثُمَّ اجْتَمَعَتْ ثُمَّ أَرْسَلَتْ السَّمَاءُ عَزَالِيَهَا فَخَرَجْنَا نَخُوضُ الْمَاءَ حَتَّى أَتَيْنَا مَنَازِلَنَا فَلَمْ يَزَلْ الْمَطَرُ إِلَى الْجُمُعَةِ الْأُخْرَى فَقَامَ إِلَيْهِ ذَلِكَ الرَّجُلُ أَوْ غَيْرُهُ فَقَالَ يَا رَسُولَ اللَّهِ تَهَدَّمَتْ الْبُيُوتُ فَادْعُ اللَّهَ أَنْ يَحْبِسَهُ فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ حَوَالَيْنَا وَلَا عَلَيْنَا فَنَظَرْتُ إِلَى السَّحَابِ يَتَصَدَّعُ حَوْلَ الْمَدِينَةِ كَأَنَّهُ إِكْلِيلٌحَدَّثَنَا عِيسَى بْنُ حَمَّادٍ أَخْبَرَنَا اللَّيْثُ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ عَنْ أَنَسٍ أَنَّهُ سَمِعَهُ يَقُولُ فَذَكَرَ نَحْوَ حَدِيثِ عَبْدِ الْعَزِيزِ قَالَ فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ بِحِذَاءِ وَجْهِهِ فَقَالَ اللَّهُمَّ اسْقِنَا وَسَاقَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Hammad bin Zaid] dari [Abdul Aziz bin Shuhaib] dari [Anas bin Malik], dan [Yunus bin 'Ubaid] dari [Tsabit] dari [Anas] dia berkata; \"Penduduk Madinah pernah di timpa bencana kekeringan pada masa Rasulullah shallallahu 'alaihi wasallam, ketika beliau tengah menyampaikan khutbah Jum'at, tiba-tiba seorang laki-laki berdiri seraya berkata; \"Wahai Rasulullah, telah binasa kuda dan kambing, oleh karena itu, berdo'alah kepada Allah agar menurunkan hujan kepada kami.\" Lalu beliau merenggangkan kedua tangannya dan berdo'a.\" Anas berkata; \"Saat itu, langit sangat cerah laksana kaca, lalu angin bertiaup yang membawa awan yang menggumpal, setelah itu langit menurunkan hujan, lalu kami keluar mencebur ke air hujan, sehingga kami tiba di rumah kami, dan hujan senantiasa turun hingga jum'at berikutnya, maka laki-laki itu atau laki-laki lain berdiri sambil berkata; \"Wahai Rasulullah, rumah-rumah kami (hampir) roboh (karena hujan kebat), oleh karena itu, berdo'alah kepada Allah agar hujan di hentikan!.\" Maka Rasulullah shallallahu 'alaihi wasallam tersenyum kemudian bersabda: \"Turunkanlah hujan ini di sekeliling kami, dan jangan sampai ia membawa petaka bagi kami.\" Lalu aku melihat awan tersebut terputus-putus di sekitar Madinah, seolah-olah bagaikan Mahkota (maksudnya hujan turun menyebar di seluruh Madinah).\" Telah menceritakan kepada kami [Isa bin Hammad] telah mengabarkan kepada kami [Al Laits] dari [Sa'id Al Maqburi] dari [Syarik bin Abdullah bin Abu Namir] bahwa dia mendengar [Anas] berkata; …\" kemudian dia menyebutkan sebagaimana hadits Abdul Aziz katanya; \"Maka Rasulullah shallallahu 'alaihi wasallam mengangkat kedua tangannya sejajar dengan wajah beliau seraya mengucapkan: \"Ya Allah turunkanlah hujan kepada kami…\" kemudian dia melanjutkan hadits seperti di atas.\""
            },
            {
                "number": 981,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ ح و حَدَّثَنَا سَهْلُ بْنُ صَالِحٍ حَدَّثَنَا عَلِيُّ بْنُ قَادِمٍ أَخْبَرَنَا سُفْيَانُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَسْقَى قَالَ اللَّهُمَّ اسْقِ عِبَادَكَ وَبَهَائِمَكَ وَانْشُرْ رَحْمَتَكَ وَأَحْيِ بَلَدَكَ الْمَيِّتَهَذَا لَفْظُ حَدِيثِ مَالِكٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Yahya bin Sa'id] dari ['Amru bin Syu'aib] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: …\" dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Sahl bin Shalih] telah menceritakan kepada kami [Ali bin Qadim] telah mengabarkan kepada kami [Sufyan] dari [Yahya bin Sa'id] dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya] dia berkata; \"Apabila Nabi shallallahu 'alaihi wasallam memohon turunnya hujan, beliau mengucapkan: \"Ya Allah, hujanilah hamba-hamba-Mu, binatang-binatang ternak-Mu dan tebarkanlah rahmat-Mu serta hidupkanlah tanah-Mu yang tandus.\" Lafadz ini dari hadits Malik. "
            },
            {
                "number": 982,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ أَخْبَرَنِي مَنْ أُصَدِّقُ وَظَنَنْتُ أَنَّهُ يُرِيدُ عَائِشَةَ قَالَكُسِفَتْ الشَّمْسُ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِيَامًا شَدِيدًا يَقُومُ بِالنَّاسِ ثُمَّ يَرْكَعُ ثُمَّ يَقُومُ ثُمَّ يَرْكَعُ ثُمَّ يَقُومُ ثُمَّ يَرْكَعُ فَرَكَعَ رَكْعَتَيْنِ فِي كُلِّ رَكْعَةٍ ثَلَاثُ رَكَعَاتٍ يَرْكَعُ الثَّالِثَةَ ثُمَّ يَسْجُدُ حَتَّى إِنَّ رِجَالًا يَوْمَئِذٍ لَيُغْشَى عَلَيْهِمْ مِمَّا قَامَ بِهِمْ حَتَّى إِنَّ سِجَالَ الْمَاءِ لَتُصَبُّ عَلَيْهِمْ يَقُولُ إِذَا رَكَعَ اللَّهُ أَكْبَرُ وَإِذَا رَفَعَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ حَتَّى تَجَلَّتْ الشَّمْسُ ثُمَّ قَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ عَزَّ وَجَلَّ يُخَوِّفُ بِهِمَا عِبَادَهُ فَإِذَا كُسِفَا فَافْزَعُوا إِلَى الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Isma'il bin 'Ulayyah] dari [Ibnu Juraij] dari ['Atha`] dari ['Ubaid bin 'Umair] telah mengabarkan kepadaku [seseorang yang aku percaya] -aku kira yang di maksud oleh 'Ubaid adalah Aisyah- dia berkata; \"Telah terjadi gerhana matahari pada masa Rasulullah shallallahu 'alaihi wasallam, maka Nabi shallallahu 'alaihi wasallam berdiri lama sekali bersama orang-orang. Kemudian beliau ruku', lalu berdiri dan ruku' lagi kemudian berdiri lalu ruku' lagi. Beliau mengerjakan sholat dua raka'at, yang setiap raka'atnya tiga kali ruku'. Setelah ruku' yang ketiga baru beliau sujud. Beberapa orang ketika itu pingsan karena lamanya beliau berdiri bersama mereka, sehingga seember air di percikkan ke tubuh mereka. Apabila ruku' beliau mengucapkan: \"Allahu akbar.\" Dan apabila mengangkat kepala (I'tidal) beliau mengucapkan: \"Sami'allahu liman hamidah\" sehingga matahari kembali terang. Kemudian berliau bersabda: 'Sesungguhnya gerhana matahari dan bulan terjadi bukan karena matinya atau hidupnya seseorang, akan tetapi keduanya merupakan tanda-tanda kebesaran Allah Azza Wa Jalla untuk memberi peringatan kepada para hamba-Nya, apabila terjadi gerhana, maka bersegeralah kalian melaksanakan sholat. '"
            },
            {
                "number": 983,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ عَبْدِ الْمَلِكِ حَدَّثَنِي عَطَاءٌ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكُسِفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ ذَلِكَ فِي الْيَوْمِ الَّذِي مَاتَ فِيهِ إِبْرَاهِيمُ بْنُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ النَّاسُ إِنَّمَا كُسِفَتْ لِمَوْتِ إِبْرَاهِيمَ ابْنِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِالنَّاسِ سِتَّ رَكَعَاتٍ فِي أَرْبَعِ سَجَدَاتٍ كَبَّرَ ثُمَّ قَرَأَ فَأَطَالَ الْقِرَاءَةَ ثُمَّ رَكَعَ نَحْوًا مِمَّا قَامَ ثُمَّ رَفَعَ رَأْسَهُ فَقَرَأَ دُونَ الْقِرَاءَةِ الْأُولَى ثُمَّ رَكَعَ نَحْوًا مِمَّا قَامَ ثُمَّ رَفَعَ رَأْسَهُ فَقَرَأَ الْقِرَاءَةَ الثَّالِثَةَ دُونَ الْقِرَاءَةِ الثَّانِيَةِ ثُمَّ رَكَعَ نَحْوًا مِمَّا قَامَ ثُمَّ رَفَعَ رَأْسَهُ فَانْحَدَرَ لِلسُّجُودِ فَسَجَدَ سَجْدَتَيْنِ ثُمَّ قَامَ فَرَكَعَ ثَلَاثَ رَكَعَاتٍ قَبْلَ أَنْ يَسْجُدَ لَيْسَ فِيهَا رَكْعَةٌ إِلَّا الَّتِي قَبْلَهَا أَطْوَلُ مِنْ الَّتِي بَعْدَهَا إِلَّا أَنَّ رُكُوعَهُ نَحْوٌ مِنْ قِيَامِهِ قَالَ ثُمَّ تَأَخَّرَ فِي صَلَاتِهِ فَتَأَخَّرَتْ الصُّفُوفُ مَعَهُ ثُمَّ تَقَدَّمَ فَقَامَ فِي مَقَامِهِ وَتَقَدَّمَتْ الصُّفُوفُ فَقَضَى الصَّلَاةَ وَقَدْ طَلَعَتْ الشَّمْسُ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ عَزَّ وَجَلَّ لَا يَنْكَسِفَانِ لِمَوْتِ بَشَرٍ فَإِذَا رَأَيْتُمْ شَيْئًا مِنْ ذَلِكَ فَصَلُّوا حَتَّى تَنْجَلِيَ وَسَاقَ بَقِيَّةَ الْحَدِيثِحَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ حَدَّثَنَا إِسْمَعِيلُ عَنْ هِشَامٍ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ كُسِفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي يَوْمٍ شَدِيدِ الْحَرِّ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَصْحَابِهِ فَأَطَالَ الْقِيَامَ حَتَّى جَعَلُوا يَخِرُّونَ ثُمَّ رَكَعَ فَأَطَالَ ثُمَّ رَفَعَ فَأَطَالَ ثُمَّ رَكَعَ فَأَطَالَ ثُمَّ رَفَعَ فَأَطَالَ ثُمَّ سَجَدَ سَجْدَتَيْنِ ثُمَّ قَامَ فَصَنَعَ نَحْوًا مِنْ ذَلِكَ فَكَانَ أَرْبَعُ رَكَعَاتٍ وَأَرْبَعُ سَجَدَاتٍ وَسَاقَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Yahya] dari [Abdul Malik] telah menceritakan kepadaku ['Atha`] dari [Jabir bin Abdullah] dia berkata; \"Pernah terjadi gerhana Matahari pada masa Rasulullah shallallahu 'alaihi wasallam, waktu itu bertepatan dengan wafatnya Ibrahim putra Rasulullah shallallahu 'alaihi wasallam, maka orang-orang berkata; \"Gerhana terjadi karena wafatnya Ibrahim putra beliau shallallahu 'alaihi wasallam.\" Mendengar itu, Nabi shallallahu 'alaihi wasallam berdiri untuk mengerjakan sholat bersama orang-orang dengan enam kali ruku', dan empat kali sujud (dua raka'at). Beliau kemudian bertakbir, lalu membaca (surat al Qur'an) dengan memanjangkan bacaannya, lalu ruku' lama seperti lama beliau berdiri, kemudian beliau mengangkat kepalanya (i'tidal) tanpa membaca (surat Al Qur'an) sebagaimana yang pertama, setelah itu beliau ruku' lama seperti lamanya beliau berdiri, lalu mengangkat kepalanya dan membaca (surat al Qur'an) yang ketiga kali (beliau berdiri) tidak sebagaimana bacaan yang kedua, kemudian ruku' lama seperti lama berdiri, lalu i'tidal dengan mengangkat kepala, lalu turun sujud dua kali. Setelah itu beliau berdiri kembali, lalu ruku' tiga sebelum sujud. Dalam sholat ini, raka'at pertama lebih panjang daripada raka'at sesudahnya (kedua), akan tetapi beliau ruku' sama lamanya dengan berdiri.\" Jabir berkata; \"Setelah itu, beliau mundur dalam shaf sholatnya, maka shaf-shaf sholat yang berada di belakang beliau pun turut mundur, kemudian beliau maju di tempat semula, maka shaf-shaf yang ada di belakang beliau turut maju ke depan. Seusai beliau sholat, ternyata matahari muncul kembali, lalu beliau bersabda; \"wahai sekalian manusia, sesungguhnya matahari dan bulan adalah salah satu tanda dari beberapa tanda kekuasaan Allah Azza Wa Jalla, tidaklah keduanya mengalami gerhana karena kematian seseorang, oleh karena itu, apabila kalian melihat suatu kejadian padanya, hendaklah kalian melaksanakan sholat sampai (matahari dan bulan) terang kembali…\" kemudian Perawi melanjutkan sisa dari hadits ini. telah menceritakan kepada kami [Mu`ammal bin Hisyam] telah menceritakan kepada kami [Isma'il] dari [Hisyam] telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] dia berkata; \"Pernah terjadi gerhana matahari pada masa Rasulullah shallallahu 'alaihi wasallam yaitu ketika hari sangat terik, maka Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat bersama para sahabatnya, beliau berdiri sangat lama sehingga sebagian mereka tersungkur jatuh, kemudian beliau ruku' hingga lama, lalu berdiri lagi hingga lama, kemudian beliau ruku' lagi hingga lama, lalu beliau sujud dua kali, setelah itu beliau bangkit (berdiri). Lalu beliau mengerjakan yang demikian itu (pada raka'at kedua) sebagaimana raka'at pertama, yaitu dengan empat kali ruku' dan empat kali sujud.\""
            },
            {
                "number": 984,
                "arab": "حَدَّثَنَا ابْنُ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْخُسِفَتْ الشَّمْسُ فِي حَيَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمَسْجِدِ فَقَامَ فَكَبَّرَ وَصَفَّ النَّاسُ وَرَاءَهُ فَاقْتَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِرَاءَةً طَوِيلَةً ثُمَّ كَبَّرَ فَرَكَعَ رُكُوعًا طَوِيلًا ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ ثُمَّ قَامَ فَاقْتَرَأَ قِرَاءَةً طَوِيلَةً هِيَ أَدْنَى مِنْ الْقِرَاءَةِ الْأُولَى ثُمَّ كَبَّرَ فَرَكَعَ رُكُوعًا طَوِيلًا هُوَ أَدْنَى مِنْ الرُّكُوعِ الْأَوَّلِ ثُمَّ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ ثُمَّ فَعَلَ فِي الرَّكْعَةِ الْأُخْرَى مِثْلَ ذَلِكَ فَاسْتَكْمَلَ أَرْبَعَ رَكَعَاتٍ وَأَرْبَعَ سَجَدَاتٍ وَانْجَلَتْ الشَّمْسُ قَبْلَ أَنْ يَنْصَرِفَحَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَنْبَسَةُ حَدَّثَنَا يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ كَانَ كَثِيرُ بْنُ عَبَّاسٍ يُحَدِّثُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ كَانَ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي كُسُوفِ الشَّمْسِ مِثْلَ حَدِيثِ عُرْوَةَ عَنْ عَائِشَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى رَكْعَتَيْنِ فِي كُلِّ رَكْعَةٍ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Ibnu As Sarh] telah mengabarkan kepada kami [Ibnu Wahb]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Salamah Al Muradi] telah menceritakan kepada kami [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku ['Urwah bin Az Zubair] dari ['Aisyah istri Nabi shallallahu 'alaihi wasallam] dia berkata; \"Pernah terjadi gerhana matahari ketika Rasulullah shallallahu 'alaihi wasallam masih hidup, maka Rasulullah shallallahu 'alaihi wasallam keluar menuju masjid, kemudian beliau berdiri dan bertakbir, dan orang-orang juga ikut berbaris di belakang beliau, kemudian Rasulullah shallallahu 'alaihi wasallam memanjangkan bacaannya, lalu beliau bertakbir, kemudian ruku' hingga lama, setelah itu beliau mengangkat kepala (i'tidal) sambil membaca; 'samiallahu liman hamidah, rabbanaa walakal hamdu. ' Kemudian beliau berdiri dan memanjangkan bacaannya (Al Fatihah dan surat Al Qur'an), namun agak pendek dari bacaan yang pertama. Kemudian beliau bertakbir dan ruku' hingga lama, namun ia lebih pendek daripada ruku' yang pertama, lalu beliau mengucapkan 'sami'allahu liman hamidah, rabbanaa walakal hamdu', kemudian ia mengerjakan seperti itu pada raka'at kedua, maka sempurnalah empat kali ruku' dan empat kali sujud. Dan ternyata matahari telah terang kembali sebelum beliau beranjak pergi.\" Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami ['Anbasah] telah menceritakan kepada kami [Yunus] dari [Ibnu Syihab] dia berkata; [Katsir bin 'Abbas] pernah bercerita bahwa [Abdullah bin 'Abbas] pernah bercerita bahwa Rasulullah shallallahu 'alaihi wasallam sholat gerhana matahari…\" kemudian Perawi menyebutkan seperti hadits 'Urwah dari Aisyah dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau sholat dua raka'at, dan di setiap raka'at, beliau mengerjakan dua kali ruku'.\""
            },
            {
                "number": 985,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ الْفُرَاتِ بْنِ خَالِدٍ أَبُو مَسْعُودٍ الرَّازِيُّ أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ الرَّازِيُّ عَنْ أَبِيهِ عَنْ أَبِي جَعْفَرٍ الرَّازِيِّ قَالَ أَبُو دَاوُد وَحُدِّثْتُ عَنْ عُمَرَ بْنِ شَقِيقٍ حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ وَهَذَا لَفْظُهُ وَهُوَ أَتَمُّ عَنْ الرَّبِيعِ بْنِ أَنَسٍ عَنْ أَبِي الْعَالِيَةِ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَانْكَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِهِمْ فَقَرَأَ بِسُورَةٍ مِنْ الطُّوَلِ وَرَكَعَ خَمْسَ رَكَعَاتٍ وَسَجَدَ سَجْدَتَيْنِ ثُمَّ قَامَ الثَّانِيَةَ فَقَرَأَ سُورَةً مِنْ الطُّوَلِ وَرَكَعَ خَمْسَ رَكَعَاتٍ وَسَجَدَ سَجْدَتَيْنِ ثُمَّ جَلَسَ كَمَا هُوَ مُسْتَقْبِلَ الْقِبْلَةِ يَدْعُو حَتَّى انْجَلَى كُسُوفُهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Furat bin Khalid Abu Mas'ud Ar Razi] telah mengabarkan kepada kami [Muhammad bin Abdullah bin Abu Ja'far Ar Razi] dari [ayahnya] dari [Abu Ja'far Ar Razi] dia berkata; Abu Daud mengatakan; \"aku telah di beritahu dari [Umar bin Syaqiq] telah menceritakan kepada kami [Abu Ja'far Ar Razi] dan ini dari lafadznya yang lebih sempurna. Dari [Ar Rabi' bin Anas] dari [Abu 'Aliyah] dari [Ubay bin Ka'b] dia berkata; \"Pernah terjadi gerhana matahari pada masa Rasulullah shallallahu 'alaihi wasallam, lalu Nabi shallallahu 'alaihi wasallam mengerjakan sholat bersama mereka, beliau membaca surat-surat yang di baca panjang dengan lima kali ruku' dan dua kali sujud, setelah itu beliau berdiri di raka'at kedua, lalu membaca surat-surat yang di baca panjang, dengan lima kali ruku' dan dua kali sujud, kemudian beliau duduk menghadap Kiblat sambil berdo'a, sampai gerhana hilang.\""
            },
            {
                "number": 986,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ حَدَّثَنَا حَبِيبُ بْنُ أَبِي ثَابِتٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى فِي كُسُوفِ الشَّمْسِ فَقَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثُمَّ سَجَدَ وَالْأُخْرَى مِثْلُهَا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Sufyan] telah menceritakan kepada kami [Habib bin Abu Tsabit] dari [Thawus] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam bahwa beliau mengerjakan sholat gerhana, lalu beliau membaca (Al Fatihah dan surat Al Qur'an) lalu ruku', kemudian membaca, kemudian ruku', kemudian membaca, kemudian ruku', kemudian membaca, kemudian ruku', kemudian sujud. Beliau mengerjakan seperti itu di raka'at berikutnya (raka'at kedua).\""
            },
            {
                "number": 987,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا الْأَسْوَدُ بْنُ قَيْسٍ حَدَّثَنِي ثَعْلَبَةُ بْنُ عِبَادٍ الْعَبْدِيُّ مِنْ أَهْلِ الْبَصْرَةِأَنَّهُ شَهِدَ خُطْبَةً يَوْمًا لِسَمُرَةَ بْنِ جُنْدُبٍ قَالَ قَالَ سَمُرَةُ بَيْنَمَا أَنَا وَغُلَامٌ مِنْ الْأَنْصَارِ نَرْمِي غَرَضَيْنِ لَنَا حَتَّى إِذَا كَانَتْ الشَّمْسُ قِيدَ رُمْحَيْنِ أَوْ ثَلَاثَةٍ فِي عَيْنِ النَّاظِرِ مِنْ الْأُفُقِ اسْوَدَّتْ حَتَّى آضَتْ كَأَنَّهَا تَنُّومَةٌ فَقَالَ أَحَدُنَا لِصَاحِبِهِ انْطَلِقْ بِنَا إِلَى الْمَسْجِدِ فَوَاللَّهِ لَيُحْدِثَنَّ شَأْنُ هَذِهِ الشَّمْسِ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أُمَّتِهِ حَدَثًا قَالَ فَدَفَعْنَا فَإِذَا هُوَ بَارِزٌ فَاسْتَقْدَمَ فَصَلَّى فَقَامَ بِنَا كَأَطْوَلِ مَا قَامَ بِنَا فِي صَلَاةٍ قَطُّ لَا نَسْمَعُ لَهُ صَوْتًا قَالَ ثُمَّ رَكَعَ بِنَا كَأَطْوَلِ مَا رَكَعَ بِنَا فِي صَلَاةٍ قَطُّ لَا نَسْمَعُ لَهُ صَوْتًا ثُمَّ سَجَدَ بِنَا كَأَطْوَلِ مَا سَجَدَ بِنَا فِي صَلَاةٍ قَطُّ لَا نَسْمَعُ لَهُ صَوْتًا ثُمَّ فَعَلَ فِي الرَّكْعَةِ الْأُخْرَى مِثْلَ ذَلِكَ قَالَ فَوَافَقَ تَجَلِّي الشَّمْسُ جُلُوسَهُ فِي الرَّكْعَةِ الثَّانِيَةِ قَالَ ثُمَّ سَلَّمَ ثُمَّ قَامَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَشَهِدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَشَهِدَ أَنَّهُ عَبْدُهُ وَرَسُولُهُثُمَّ سَاقَ أَحْمَدُ بْنُ يُونُسَ خُطْبَةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Al Aswad bin Qais] telah menceritakan kepadaku [Tsa'labah bin 'Ibad Al 'Abdi] -dari penduduk Bashrah- bahwa suatu hari, dia pernah mendengarkan khutbahnya [Samurah bin Jundub]. Kata Samurah; \"Ketika aku dan seorang pemuda dari Anshar sedang memanah pada dua target kami, tiba-tiba matahari -yang terlihat berada seukuran dua tombak atau tiga tombak- diatas kami, berubah menjadi hitam seperti pohon tanumah (pohon hitam dan buahnya juga hitam). Salah seorang dari kami berkata: mari kita pergi ke masjid! Demi Allah, Rasulullah shallallahu 'alaihi wasallam pasti akan memberitahukan peristiwa ini kepada umatnya!\" Maka kami pun berangkat, (sesampainya di masjid) ternyata beliau sudah bersiap-siap dan maju, lalu beliau sholat. Beliau berdiri tersebut lama sekali dalam sholat tersebut, sepertinya sholat ini yang paling panjang beliau lakukan bersama kami, hingga kami tidak mendengar suara dari beliau. kemudian beliau ruku' dengan ruku' yang panjang juga dan kami tidak mendengar suara dari beliau, kemudian beliau sujud dengan sujud yang panjang juga dan kami tidak mendengar suara dari beliau. Dan beliau melakukan hal yang sama pada raka'at kedua. Samurah berkata; 'Duduk beliau pada raka'at kedua bersamaan dengan terangnya matahari. ' Kemudian beliau mengucapkan salam dan memuji Allah, bersaksi bahwa tiada ilah yang berhak disembah selainNya dan bersaksi bahwa beliau adalah hamba dan utusan-Nya.\"kemudian Ahmad bin Yunus melanjutkan khutbah Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 988,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ عَنْ قَبِيصَةَ الْهِلَالِيِّ قَالَكُسِفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجَ فَزِعًا يَجُرُّ ثَوْبَهُ وَأَنَا مَعَهُ يَوْمَئِذٍ بِالْمَدِينَةِ فَصَلَّى رَكْعَتَيْنِ فَأَطَالَ فِيهِمَا الْقِيَامَ ثُمَّ انْصَرَفَ وَانْجَلَتْ فَقَالَ إِنَّمَا هَذِهِ الْآيَاتُ يُخَوِّفُ اللَّهُ بِهَا فَإِذَا رَأَيْتُمُوهَا فَصَلُّوا كَأَحْدَثِ صَلَاةٍ صَلَّيْتُمُوهَا مِنْ الْمَكْتُوبَةِحَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا رَيْحَانُ بْنُ سَعِيدٍ حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ هِلَالِ بْنِ عَامِرٍ أَنَّ قَبِيصَةَ الْهِلَالِيَّ حَدَّثَهُ أَنَّ الشَّمْسَ كُسِفَتْ بِمَعْنَى حَدِيثِ مُوسَى قَالَ حَتَّى بَدَتْ النُّجُومُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dari [Qabishah Al Hilali] dia berkata; \"Telah terjadi gerhana Matahari pada masa Rasulullah shallallahu 'alaihi wasallam, maka beliau bergegas keluar sambil menyingsingkan lengan bajunya, ketika itu aku bersama beliau di Madinah. Lalu beliau sholat dua raka'at dengan memanjangkan berdiri, seusainya beliau melaksanakan sholat, matahari sudah cerah lagi, lalu beliau bersabda: \"Sesungguhnya ini merupakan tanda dari tanda-tanda kebesaran Allah, dan dengannya Allah membuat hamba-Nya takut, apabila kalian melihat peristiwa itu, hendaklah kalian sholat seperti kalian melaksanakan sholat wajib.\" Telah menceritakan kepada kami [Ahmad bin Ibrahim], telah menceritakan kepada kami [Raihan bin Sa'id] telah menceritakan kepada kami ['Abbad bin Manshur] dari [Ayyub] dari [Abu Qilabah] dari [Hilal bin 'Amir] bahwa [Qabishah Al Hilali] bercerita kepadanya, bahwa telah terjadi gerhana matahari..,. seperti makna hadits Musa, katanya \"… hingga bintang terlihat.\""
            },
            {
                "number": 989,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ حَدَّثَنَا عَمِّي حَدَّثَنَا أَبِي عَنْ مُحَمَّدِ بْنِ إِسْحَقَ حَدَّثَنِي هِشَامُ بْنُ عُرْوَةَ وَعَبْدُ اللَّهِ بْنُ أَبِي سَلَمَةَ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ كُلُّهُمْ قَدْ حَدَّثَنِي عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْكُسِفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِالنَّاسِ فَقَامَ فَحَزَرْتُ قِرَاءَتَهُ فَرَأَيْتُ أَنَّهُ قَرَأَ بِسُورَةِ الْبَقَرَةِ وَسَاقَ الْحَدِيثَ ثُمَّ سَجَدَ سَجْدَتَيْنِ ثُمَّ قَامَ فَأَطَالَ الْقِرَاءَةَ فَحَزَرْتُ قِرَاءَتَهُ أَنَّهُ قَرَأَ بِسُورَةِ آلِ عِمْرَانَ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Sa'd] telah menceritakan kepada kami [pamanku] telah menceritakan kepada kami [ayahku] dari [Muhammad bin Ishaq] telah menceritakan kepadaku [Hisyam bin 'Urwah] dan [Abdullah bin Abu Salamah] dari [Sulaiman bin Yasar], semuanya telah menceritakan kepadaku, dari ['Urwah] dari [Aisyah] dia berkata; \"Terjadi gerhana Matahari pada masa Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallallahu 'alaihi wasallam keluar untuk mengerjakan sholat bersama orang-orang, setelah itu beliau berdiri. Maka aku memperkirakan bacaan beliau, bahwa beliau membaca surat Al Baqarah …\" kemudian dia melanjutkan hadits tersebut -\"lalu beliau sujud dua kali, kemudian beliau berdiri dan memanjangkan bacaannya, maka aku memperkirakan bacaan beliau, bahwa beliau membaca surat Ali Imran.\""
            },
            {
                "number": 990,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ بْنِ مَزْيَدٍ أَخْبَرَنِي أَبِي حَدَّثَنَا الْأَوْزَاعِيُّ أَخْبَرَنِي الزُّهْرِيُّ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ قِرَاءَةً طَوِيلَةً فَجَهَرَ بِهَا يَعْنِي فِي صَلَاةِ الْكُسُوفِ",
                "id": "Telah menceritakan kepada kami [Al 'Abbas bin Al Walid bin Mazyad] telah mengabarkan kepadaku [ayahku] telah menceritakan kepadaku [Al Auza'i] telah mengabarkan kepadaku [Az Zuhri] telah mengabarkan kepadaku ['Urwah bin Az Zubair] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam membaca dalam bacaan panjangnya sambil mengeraskan (bacaannya), yaitu dalam sholat gerhana.\""
            },
            {
                "number": 991,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ ابْنِ عَبَّاسٍ قَالَخُسِفَتْ الشَّمْسُ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ مَعَهُ فَقَامَ قِيَامًا طَوِيلًا بِنَحْوٍ مِنْ سُورَةِ الْبَقَرَةِ ثُمَّ رَكَعَ وَسَاقَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Zaid bin Aslam] dari ['Atha` bin Yasar] dari [Ibnu Abbas] dia berkata; \"Telah terjadi gerhana Matahari, lalu Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat bersama orang-orang, beliau berdiri lama (dalam sholat) kira-kira membaca surat Al Baqarah, kemudian beliau ruku'…\" kemudian (perawi) melanjutkan hadits tersebut.\""
            },
            {
                "number": 992,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا الْوَلِيدُ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ نَمِرٍ أَنَّهُ سَأَلَ الزُّهْرِيَّ فَقَالَ الزُّهْرِيُّ أَخْبَرَنِي عُرْوَةُ عَنْ عَائِشَةَ قَالَتْكُسِفَتْ الشَّمْسُ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا فَنَادَى أَنْ الصَّلَاةُ جَامِعَةٌ",
                "id": "Telah menceritakan kepada kami ['Amru bin Utsman] telah menceritakan kepada kami [Al Walid] telah menceritakan kepada kami [Abdurrahman bin Namir] bahwa dia bertanya kepada [Az Zuhri], maka [Az Zuhri] menjawab; telah mengabarkan kepadaku ['Urwah] dari ['Asiyah] dia berkata; \"Gerhana matahari telah terjadi, maka Rasulullah shallallahu 'alaihi wasallam memerintahkan seseorang untuk menyerukan sholat berjama'ah.\""
            },
            {
                "number": 993,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الشَّمْسُ وَالْقَمَرُ لَا يُخْسَفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ فَإِذَا رَأَيْتُمْ ذَلِكَ فَادْعُوا اللَّهَ عَزَّ وَجَلَّ وَكَبِّرُوا وَتَصَدَّقُوا",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Hisyam bin 'Urwah] dari ['Urwah] dari ['Aisyah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Terjadinya gerhana Matahari dan bulan bukanlah karena mati atau hidupnya salah seorang, apabila kalian melihat hal itu, maka berdo'alah kepada Allah 'azza wajalla, bertakbirlah serta perbanyak sedekah.\""
            },
            {
                "number": 994,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو حَدَّثَنَا زَائِدَةُ عَنْ هِشَامٍ عَنْ فَاطِمَةَ عَنْ أَسْمَاءَ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ بِالْعَتَاقَةِ فِي صَلَاةِ الْكُسُوفِ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Mu'awiyah bin 'Amru] telah menceritakan kepada kami [Za`idah] dari [Hisyam] dari [Fathimah] dari [Asma`] dia berkata; \"Nabi shallallahu 'alaihi wasallam memerintahkan untuk membebaskan budak pada waktu sholat (khutbah) gerhana.\""
            },
            {
                "number": 995,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ حَدَّثَنِي الْحَارِثُ بْنُ عُمَيْرٍ الْبَصْرِيُّ عَنْ أَيُّوبَ السَّخْتِيَانِيِّ عَنْ أَبِي قِلَابَةَ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَكُسِفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلَ يُصَلِّي رَكْعَتَيْنِ رَكْعَتَيْنِ وَيَسْأَلُ عَنْهَا حَتَّى انْجَلَتْ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abu Syu'aib Al Harrani] telah menceritakan kepadaku [Al Harits bin 'Umair Al Bahsri] dari [Ayyub As Sakhtiyani] dari [Abu Qilabah] dari [An Nu'man bin Basyir] dia berkata; \"Telah terjadi gerhana Matahari pada zaman Rasulullah shallallahu 'alaihi wasallam, beliau mengerjakan sholat dua raka'at, dua raka'at, dan beliau bertanya (tentang gerhana) hingga gerhana selesai.\" "
            },
            {
                "number": 996,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَانْكَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَكَدْ يَرْكَعُ ثُمَّ رَكَعَ فَلَمْ يَكَدْ يَرْفَعُ ثُمَّ رَفَعَ فَلَمْ يَكَدْ يَسْجُدُ ثُمَّ سَجَدَ فَلَمْ يَكَدْ يَرْفَعُ ثُمَّ رَفَعَ فَلَمْ يَكَدْ يَسْجُدُ ثُمَّ سَجَدَ فَلَمْ يَكَدْ يَرْفَعُ ثُمَّ رَفَعَ وَفَعَلَ فِي الرَّكْعَةِ الْأُخْرَى مِثْلَ ذَلِكَ ثُمَّ نَفَخَ فِي آخِرِ سُجُودِهِ فَقَالَ أُفْ أُفْ ثُمَّ قَالَ رَبِّ أَلَمْ تَعِدْنِي أَنْ لَا تُعَذِّبَهُمْ وَأَنَا فِيهِمْ أَلَمْ تَعِدْنِي أَنْ لَا تُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ فَفَرَغَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ صَلَاتِهِ وَقَدْ أَمْحَصَتْ الشَّمْسُ وَسَاقَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari ['Atha` bin As Sa`ib] dari [ayahnya] dari [Abdullah bin 'Amru] dia berkata; \"Pernah terjadi gerhana Matahari pada masa Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallallahu 'alaihi wasallam berdiri (lama) seakan-akan tidak ruku', lalu ruku' (lama) seakan-akan tidak mengangkat kepala, kemudian mengangkat kepala, seakan-akan tidak sujud, kemudian sujud, seakan-akan tidak mengangkat kepala (duduk di antara dua sujud), kemudian mengangkat kepala (duduk di antara dua sujud) seakan-akan tidak sujud, kemudian sujud seakan-akan tidak bangkit, setelah itu beliau berdiri, beliau juga mengerjakan seperti itu di raka'at berikutnya, kemudian di akhir sujudnya beliau menghembuskan nafas sambil mengucapkan: \"Uf, uf.\" Lalu beliau berdo'a: \"Wahai Rabbku, bukankah Engkau telah berjanji kepadaku, bahwa Engkau tidak akan menyiksa mereka, sedangkan aku bersama mereka?, bukankah Engkau telah berjanji kepadaku, bahwa Engkau tidak akan menyiksa mereka, sedangkan mereka memohon ampunan?.\" Seusainya Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat, matahari menjadi cerah kembali.\" …kemudian perawi melanjutkan hadits tersebut.\""
            },
            {
                "number": 997,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا الْجُرَيْرِيُّ عَنْ حَيَّانَ بْنِ عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَبَيْنَمَا أَتَرَمَّى بِأَسْهُمٍ فِي حَيَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ كُسِفَتْ الشَّمْسُ فَنَبَذْتُهُنَّ وَقُلْتُ لَأَنْظُرَنَّ مَا أَحْدَثَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُسُوفُ الشَّمْسِ الْيَوْمَ فَانْتَهَيْتُ إِلَيْهِ وَهُوَ رَافِعٌ يَدَيْهِ يُسَبِّحُ وَيُحَمِّدُ وَيُهَلِّلُ وَيَدْعُو حَتَّى حُسِرَ عَنْ الشَّمْسِ فَقَرَأَ بِسُورَتَيْنِ وَرَكَعَ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Bisr bin Al Mufadlal] telah menceritakan kepada kami [Al Jurairi] dari [Hayyan bin 'Umair] dari [Abdurrahman bin Samurah] dia berkata; \"Ketika kami melepaskan anak panah di masa hidupnya Rasulullah shallallahu 'alaihi wasallam, tiba-tiba terjadi gerhana Matahari, lalu aku segera meletakkan anak panah tersebut dan berkata; \"Sungguh aku akan melihat kejadian apa yang akan menimpa Rasulullah shallallahu 'alaihi wasallam pada hari terjadinya gerhana Matahari ini.\" lalu aku menemui beliau, ternyata beliau sedang mengangkat kedua tangannya sambil bertasbih, tahmid dan bertahlil serta berdo'a hingga gerhana hilang dari matahari. Beliau membaca dua surat dan sholat dua raka'at.\""
            },
            {
                "number": 998,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ بْنِ أَبِي رَوَّادٍ حَدَّثَنِي حَرَمِيُّ بْنُ عُمَارَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ النَّضْرِ حَدَّثَنِي أَبِي قَالَكَانَتْ ظُلْمَةٌ عَلَى عَهْدِ أَنَسِ بْنِ مَالِكٍ قَالَ فَأَتَيْتُ أَنَسًا فَقُلْتُ يَا أَبَا حَمْزَةَ هَلْ كَانَ يُصِيبُكُمْ مِثْلُ هَذَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَعَاذَ اللَّهِ إِنْ كَانَتْ الرِّيحُ لَتَشْتَدُّ فَنُبَادِرُ الْمَسْجِدَ مَخَافَةَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Amru bin Jabalah bin Abu Rawwad] telah menceritakan kepadaku [Harami bin 'umarah] dari ['ubaidhullah bin An Nadlr] telah menceritakan kepadaku [ayahku] dia berkata; \"Telah terjadi kegelapan yang sangat pada masa [Anas bin Malik], maka aku mendatangi Anas dan berkata kepadanya; \"Wahai Abu Hamzah, apakah kalian pernah mengalami kejadian seperti ini pada zaman Rasulullah shallallahu 'alaihi wasallam?\" Dia menjawab; \"Aku berlindung kepada Allah! Apabila angin berhembus dengan kencang, maka kami segera bergegas ke masjid, khawatir kalau terjadi kiamat.\""
            },
            {
                "number": 999,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ بْنِ أَبِي صَفْوَانَ الثَّقَفِيُّ حَدَّثَنَا يَحْيَى بْنُ كَثِيرٍ حَدَّثَنَا سَلْمُ بْنُ جَعْفَرٍ عَنْ الْحَكَمِ بْنِ أَبَانَ عَنْ عِكْرِمَةَ قَالَقِيلَ لِابْنِ عَبَّاسٍ مَاتَتْ فُلَانَةُ بَعْضُ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَّ سَاجِدًا فَقِيلَ لَهُ أَتَسْجُدُ هَذِهِ السَّاعَةَ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَيْتُمْ آيَةً فَاسْجُدُوا وَأَيُّ آيَةٍ أَعْظَمُ مِنْ ذَهَابِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Utsman bin Abu Shafwan Ats Tsaqafi] telah menceritakan kepada kami [Yahya bin Katsir] telah menceritakan kepada kami [Salm bin Ja'far] dari [Al Hakam bin Aban] dari [Ikrimah] dia berkata; pernah di beritahukan kepada [Ibnu Abbas] bahwa fulanah -salah seorang dari istri Nabi shallallahu 'alaihi wasallam meninggal dunia-, lalu dia tersungkur sujud, dia ditanya; \"Apakah kamu sujud karena hal ini?\" Dia menjawab; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian melihat tanda-tanda kebesaran Allah, maka sujudlah!.\" Dan tanda kebesaran Allah yang manakah yang lebih besar dari pada wafatnya salah seorang dari istri Nabi shallallahu 'alaihi wasallam?\""
            },
            {
                "number": 1000,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْفُرِضَتْ الصَّلَاةُ رَكْعَتَيْنِ رَكْعَتَيْنِ فِي الْحَضَرِ وَالسَّفَرِ فَأُقِرَّتْ صَلَاةُ السَّفَرِ وَزِيدَ فِي صَلَاةِ الْحَضَرِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Shalih bin Kaisan] dari ['Urwah bin Zubair] dari [Aisyah radliallahu 'anha] dia berkata; \"sholat di wajibkan dua raka'at-dua raka'at, baik ketika mukim atau dalam perjalanan, di tetapkan dua raka'at dalam perjalanan, dan di tambah (raka'atnya) ketika mukim.\""
            },
            {
                "number": 1001,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَمُسَدَّدٌ قَالَا حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ ح و حَدَّثَنَا خُشَيْشٌ يَعْنِي ابْنَ أَصْرَمَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ ابْنِ جُرَيْجٍ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي عَمَّارٍ عَنْ عَبْدِ اللَّهِ بْنِ بَابَيْهِ عَنْ يَعْلَى بْنِ أُمَيَّةَ قَالَقُلْتُ لِعُمَرَ بْنِ الْخَطَّابِ أَرَأَيْتَ إِقْصَارَ النَّاسِ الصَّلَاةَ وَإِنَّمَا قَالَ تَعَالَى{ إِنْ خِفْتُمْ أَنْ يَفْتِنَكُمْ الَّذِينَ كَفَرُوا }فَقَدْ ذَهَبَ ذَلِكَ الْيَوْمَ فَقَالَ عَجِبْتُ مِمَّا عَجِبْتَ مِنْهُ فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ صَدَقَةٌ تَصَدَّقَ اللَّهُ بِهَا عَلَيْكُمْ فَاقْبَلُوا صَدَقَتَهُحَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ وَمُحَمَّدُ بْنُ بَكْرٍ قَالَا أَخْبَرَنَا ابْنُ جُرَيْجٍ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي عَمَّارٍ يُحَدِّثُ فَذَكَرَهُ نَحْوَهُ قَالَ أَبُو دَاوُد رَوَاهُ أَبُو عَاصِمٍ وَحَمَّادُ بْنُ مَسْعَدَةَ كَمَا رَوَاهُ ابْنُ بَكْرٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Musaddad] keduanya berkata; telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Khusyaisy yaitu Ibnu Ashram] telah menceritakan kepada kami [Abdurrazaq] dari [Ibnu Juraij] dia berkata; telah menceritakan kepadaku [Abdurrahman bin Abdullah bin Abu 'Ammar] dari [Abdullah bin Babaih] dari [Ya'la bin Umayyah] dia berkata; aku bertanya kepada Umar bin Khattab; \"Bagaimana pendapat anda mengenai orang-orang yang meng-qashar sholatnya karena firman Allah; \"…Jika kamu takut di serang oleh orang-orang kafir…\" QS An Nisaa'; 101, padahal rasa takut itu telah hilang saat sekarang ini.\" [Umar] berkata; \"Sebenarnya aku juga heran seperti yang kamu herankan itu, oleh karena itu, aku sampaikan masalah tersebut kepada Rasulullah shallallahu 'alaihi wasallam, justru beliau menjawab: \"Itu merupakan sedekah Allah terhadap kalian, oleh karena itu, terimalah sedekah-Nya.\" Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Abdurrazaq] dan [Muhammad bin Bakr] keduanya berkata; telah mengabarkan kepada kami [Ibnu Juraij] saya mendengar [Abdullah bin Abu 'Ammar] bercerita …\" kemudian ia menyebutkan hadits yang semisalnya, Abu Daud mengatakan; \"Di riwayatkan pula oleh [Abu 'Ashim] dan [Hammad bin Mas'adah] sebagaimana yang di riwayatkan oleh Ibnu Bakr.\""
            },
            {
                "number": 1002,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَحْيَى بْنِ يَزِيدَ الْهُنَائِيِّ قَالَسَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنْ قَصْرِ الصَّلَاةِ فَقَالَ أَنَسٌ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَرَجَ مَسِيرَةَ ثَلَاثَةِ أَمْيَالٍ أَوْ ثَلَاثَةِ فَرَاسِخَ شَكَّ شُعْبَةُ يُصَلِّي رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Yahya bin Yazid Al Huna`i] dia berkata; saya bertanya kepada Anas bin Malik tentang mengqashr sholat, maka [Anas] menjawab; \"Apabila Rasulullah shallallahu 'alaihi wasallam bepergian sejauh perjalanan tiga mil atau tiga farsakh -Syu'bah ragu- maka beliau sholat dua raka'at.\""
            },
            {
                "number": 1003,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ وَإِبْرَاهِيمَ بْنِ مَيْسَرَةَ سَمِعَا أَنَسَ بْنَ مَالِكٍ يَقُولُصَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ بِالْمَدِينَةِ أَرْبَعًا وَالْعَصْرَ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Muhammad bin Al Munkadir] dan [Ibrahim bin Maisarah] keduanya mendengar [Anas bin Malik] berkata; \"Aku sholat dluhur empat raka'at di Madinah bersama Rasulullah shallallahu 'alaihi wasallam, dan sholat Ashar dua raka'at di Dzul Hulaifah.\""
            },
            {
                "number": 1004,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ أَنَّ أَبَا عُشَّانَةَ الْمَعَافِرِيَّ حَدَّثَهُ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَعْجَبُ رَبُّكُمْ مِنْ رَاعِي غَنَمٍ فِي رَأْسِ شَظِيَّةٍ بِجَبَلٍ يُؤَذِّنُ بِالصَّلَاةِ وَيُصَلِّي فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ انْظُرُوا إِلَى عَبْدِي هَذَا يُؤَذِّنُ وَيُقِيمُ الصَّلَاةَ يَخَافُ مِنِّي قَدْ غَفَرْتُ لِعَبْدِي وَأَدْخَلْتُهُ الْجَنَّةَ",
                "id": "Telah menceritakan kepada kami [Harun bin Ma'ruf] telah menceritakan kepada kami [Ibnu Wahb] dari ['Amru bin Al harits] bahwa [Abu 'Usyanah Al Ma'afiri] telah menceritakan dari ['Uqbah bin 'Amir] dia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Rabb kalian kagum terhadap seorang yang mengumandangkan sholat di atas bukit, kemudian dia sholat, maka Allah Azza wa Jalla berfirman; \"Lihatlah kepada hamba-Ku ini, dia mengumandangkan adzan lalu sholat karena takut kepada-Ku, Aku telah mengampuni dosa hamba-Ku dan memasukkannya ke dalam surga.\""
            },
            {
                "number": 1005,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْمِسْحَاجِ بْنِ مُوسَى قَالَ قُلْتُ لِأَنَسِ بْنِ مَالِكٍحَدِّثْنَا مَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُنَّا إِذَا كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السَّفَرِ فَقُلْنَا زَالَتْ الشَّمْسُ أَوْ لَمْ تَزُلْ صَلَّى الظُّهْرَ ثُمَّ ارْتَحَلَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al Mishaj bin Musa] dia berkata; kataku kepada [Anas bin Malik]; \"Sampaikanlah kepada kami sesuatu yang anda dengar dari Rasulullah shallallahu 'alaihi wasallam!.\" Anas berkata; \"Apabila kami bepergian bersama Rasulullah shallallahu 'alaihi wasallam, maka kami berkata; \"Matahari telah tergelincir atau belum, beliau kemudian sholat dluhur lalu melanjutkan perjalanan.\""
            },
            {
                "number": 1006,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ حَدَّثَنِي حَمْزَةُ الْعَائِذِيُّ رَجُلٌ مِنْ بَنِي ضَبَّةَ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا نَزَلَ مَنْزِلًا لَمْ يَرْتَحِلْ حَتَّى يُصَلِّيَ الظُّهْرَ فَقَالَ لَهُ رَجُلٌ وَإِنْ كَانَ بِنِصْفِ النَّهَارِ قَالَ وَإِنْ كَانَ بِنِصْفِ النَّهَارِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Syu'bah] telah menceritakan kepadaku [Hamzah Al 'A`idzi] -seorang laki-laki dari Bani Dlabbah- dia berkata; saya mendengar [Anas bin Malik] berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam singgah di suatu tempat, beliau tidak melanjutkan perjalanannya sehingga beliau sholat dluhur.\" Maka laki-laki tersebut berkata; \"Meskipun berada pada tengah hari?\" Anas menjawab; \"Meskipun berada di tengah hari.\""
            },
            {
                "number": 1007,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ عَنْ أَبِي الطُّفَيْلِ عَامِرِ بْنِ وَاثِلَةَ أَنَّ مُعَاذَ بْنَ جَبَلٍ أَخْبَرَهُمْأَنَّهُمْ خَرَجُوا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ فَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجْمَعُ بَيْنَ الظُّهْرِ وَالْعَصْرِ وَالْمَغْرِبِ وَالْعِشَاءِ فَأَخَّرَ الصَّلَاةَ يَوْمًا ثُمَّ خَرَجَ فَصَلَّى الظُّهْرَ وَالْعَصْرَ جَمِيعًا ثُمَّ دَخَلَ ثُمَّ خَرَجَ فَصَلَّى الْمَغْرِبَ وَالْعِشَاءَ جَمِيعًا",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abu Az Zubair Al Makki] dari [Abu Ath Thufail 'Amir bin Watsilah] bahwa [Mu'adz bin Jabal] mengabarkan kepada mereka, bahwa mereka (kaum Muslimin) keluar bersama Rasulullah shallallahu 'alaihi wasallam pada waktu perang Tabuk, dan Rasulullah shallallahu 'alaihi wasallam menjama' sholat antara sholat Dluhur dan Ashar, dan antara sholat Maghrib dan Isya', suatu hari beliau mengakhirkan sholat, kemudian beliau keluar untuk mengerjakan sholat Dluhur dan Ashar secara jama', kemudian beliau masuk (tenda), setelah itu beliau keluar lalu mengerjakan sholat Maghrib dan Isya' secara jama'.\""
            },
            {
                "number": 1008,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَاسْتُصْرِخَ عَلَى صَفِيَّةَ وَهُوَ بِمَكَّةَ فَسَارَ حَتَّى غَرَبَتْ الشَّمْسُ وَبَدَتْ النُّجُومُ فَقَالَ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا عَجِلَ بِهِ أَمْرٌ فِي سَفَرٍ جَمَعَ بَيْنَ هَاتَيْنِ الصَّلَاتَيْنِفَسَارَ حَتَّى غَابَ الشَّفَقُ فَنَزَلَ فَجَمَعَ بَيْنَهُمَا",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al 'Ataki] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Ayyub] dari [Nafi'] bahwa [Ibnu Umar] di beritahu tentang wafatnya Shafiyah, ketika itu ia berada di Makkah. Kemudian dia berangkat hingga matahari terbenam dan bintang-bintang mulai muncul, lalu dia berkata; \"Sesungguhnya apabila Nabi shallallahu 'alaihi wasallam mengalami kesulitan perkara dalam suatu perjalanan, maka beliau menjama' dua sholat ini, lalu beliau berangkat. Setelah awan merah hilang, ia singgah dan menjama' kedua sholat tersebut.\""
            },
            {
                "number": 1009,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ الرَّمْلِيُّ الْهَمْدَانِيُّ حَدَّثَنَا الْمُفَضَّلُ بْنُ فَضَالَةَ وَاللَّيْثُ بْنُ سَعْدٍ عَنْ هِشَامِ بْنِ سَعْدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ أَبِي الطُّفَيْلِ عَنْ مُعَاذِ بْنِ جَبَلٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي غَزْوَةِ تَبُوكَ إِذَا زَاغَتْ الشَّمْسُ قَبْلَ أَنْ يَرْتَحِلَ جَمَعَ بَيْنَ الظُّهْرِ وَالْعَصْرِ وَإِنْ يَرْتَحِلْ قَبْلَ أَنْ تَزِيغَ الشَّمْسُ أَخَّرَ الظُّهْرَ حَتَّى يَنْزِلَ لِلْعَصْرِ وَفِي الْمَغْرِبِ مِثْلُ ذَلِكَ إِنْ غَابَتْ الشَّمْسُ قَبْلَ أَنْ يَرْتَحِلَ جَمَعَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ وَإِنْ يَرْتَحِلْ قَبْلَ أَنْ تَغِيبَ الشَّمْسُ أَخَّرَ الْمَغْرِبَ حَتَّى يَنْزِلَ لِلْعِشَاءِ ثُمَّ جَمَعَ بَيْنَهُمَاقَالَ أَبُو دَاوُد رَوَاهُ هِشَامُ بْنُ عُرْوَةَ عَنْ حُسَيْنِ بْنِ عَبْدِ اللَّهِ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِ الْمُفَضَّلِ وَاللَّيْثِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Khalid bin Yazid bin Abdullah bin Mauhab Ar Ramli Al Hamdani] telah menceritakan kepada kami [AL Mufadlal bin Fadlalah] dan [Laits bin Sa'd] dari [Hisyam bin Sa'ad] dari [Abu Az Zubair] dari [Abu Ath Thufail] dari [Mu'adz bin Jabal] bahwa pada waktu Rasulullah shallallahu 'alaihi wasallam perang Tabuk, ketika matahari telah tergelincir sebelum berangkat, maka beliau menjama' antara sholat Dluhur dan sholat Ashar. Dan jika beliau berangkat sebelum matahari tergelincir, maka beliau mengundurkan Dluhur sehingga beliau singgah untuk sholat Ashar, demikian pula ketika sholat Maghrib, apabila Matahari telah terbenam sebelum berangkat, maka beliau menjama' antara Maghrib dan Isya', dan jika berangkat sebelum matahari terbenam, beliau mengakhirkan sholat Maghrib, sehingga beliau singgah pada waktu Isya', kemudian beliau menjama' keduanya.\" Abu Daud mengatakan; \"Telah di riwayatkan pula oleh [Hisyam bin 'Urwah] dari [Husain bin Abdullah] dari [Kuraib] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam sebagaimana hadits Al Mufadlal dan Al Laits.\""
            },
            {
                "number": 1010,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ عَنْ أَبِي مَوْدُودٍ عَنْ سُلَيْمَانَ بْنِ أَبِي يَحْيَى عَنْ ابْنِ عُمَرَ قَالَمَا جَمَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ قَطُّ فِي السَّفَرِ إِلَّا مَرَّةًقَالَ أَبُو دَاوُد وَهَذَا يُرْوَى عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ مَوْقُوفًا عَلَى ابْنِ عُمَرَ أَنَّهُ لَمْ يَرَ ابْنَ عُمَرَ جَمَعَ بَيْنَهُمَا قَطُّ إِلَّا تِلْكَ اللَّيْلَةَ يَعْنِي لَيْلَةَ اسْتُصْرِخَ عَلَى صَفِيَّةَ وَرُوِيَ مِنْ حَدِيثِ مَكْحُولٍ عَنْ نَافِعٍ أَنَّهُ رَأَى ابْنَ عُمَرَ فَعَلَ ذَلِكَ مَرَّةً أَوْ مَرَّتَيْنِ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdullah bin Nafi'] dari [Abu Maudud] dari [Sulaiman bin Abu Yahya] dari [Ibnu Umar] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam sama sekali tidak pernah menjama' sholat Maghrib dan Isya' dalam suatu perjalanan kecuali hanya sekali.\" Abu Daud mengatakan; \"Hadits ini di riwayatkan dari [Ayyub] dari [Nafi'] dari [Ibnu Umar]. Mauquf sampai Ibnu Umar, bahwa dirinya tidak pernah melihat bila beliau pernah menjama' keduanya kecuali hanya malam itu, yaitu malam ketika dia di beritahu wafatnya Shafiyah, dan di riwayatkan pula dari haditsnya [Makhul] dari [Nafi'] bahwa dia melihat [Ibnu Umar] melakukan hal itu hanya sekali atau dua kali.\""
            },
            {
                "number": 1011,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ وَالْعَصْرَ جَمِيعًا وَالْمَغْرِبَ وَالْعِشَاءَ جَمِيعًا فِي غَيْرِ خَوْفٍ وَلَا سَفَرٍقَالَ قَالَ مَالِكٌ أَرَى ذَلِكَ كَانَ فِي مَطَرٍ قَالَ أَبُو دَاوُد وَرَوَاهُ حَمَّادُ بْنُ سَلَمَةَ نَحْوَهُ عَنْ أَبِي الزُّبَيْرِ وَرَوَاهُ قُرَّةُ بْنُ خَالِدٍ عَنْ أَبِي الزُّبَيْرِ قَالَ فِي سَفْرَةٍ سَافَرْنَاهَا إِلَى تَبُوكَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abu Az Zubair Al Makki] dari [Sa'id bin Jubair] dari [Abdullah bin 'Abbas] dia berkata; Rasulullah mengerjakan sholat Dluhur dan Ashar secara Jama', dan sholat Maghrib dan Isya' secara Jama' tidak dalam kondisi ketakutan atau dalam perjalanan.\" (perawi berkata; Malik berkata; \"Aku berpendapat, beliau melakukan hal itu karena kondisi sedang hujan.\" Abu Daud berkata; \"Dan telah diriwayatkan pula oleh [Hammad bin Salamah] seperti hadits tersebut, dari [Abu Az Zubair], dan di riwayatkan oleh [Qurrah bin Khalid] dari [Abu Az Zubair] dia berkata; \"…Yaitu dalam perjalanan ketika kami ke Tabuk.\""
            },
            {
                "number": 1012,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَجَمَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ الظُّهْرِ وَالْعَصْرِ وَالْمَغْرِبِ وَالْعِشَاءِ بِالْمَدِينَةِ مِنْ غَيْرِ خَوْفٍ وَلَا مَطَرٍفَقِيلَ لِابْنِ عَبَّاسٍ مَا أَرَادَ إِلَى ذَلِكَ قَالَ أَرَادَ أَنْ لَا يُحْرِجَ أُمَّتَهُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy] dari [Habib bin Abu Tsabit] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah menjama' sholat Dluhur dan Ashar, antara sholat Maghrib dan Isya' di Madinah, tidak dalam kondisi ketakutan, tidak pula hujan.\" Maka di tanyakan hal itu kepada Ibnu Abbas; \"Apa maksud beliau melakukan hal itu?\" Ibnu Abbas menjawab; \"Supaya tidak memberatkan umatnya.\""
            },
            {
                "number": 1013,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْمُحَارِبِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ أَبِيهِ عَنْ نَافِعٍ وَعَبْدِ اللَّهِ بْنِ وَاقِدٍأَنَّ مُؤَذِّنَ ابْنِ عُمَرَ قَالَ الصَّلَاةُ قَالَ سِرْ سِرْ حَتَّى إِذَا كَانَ قَبْلَ غُيُوبِ الشَّفَقِ نَزَلَ فَصَلَّى الْمَغْرِبَ ثُمَّ انْتَظَرَ حَتَّى غَابَ الشَّفَقُ وَصَلَّى الْعِشَاءَ ثُمَّ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا عَجِلَ بِهِ أَمْرٌ صَنَعَ مِثْلَ الَّذِي صَنَعْتُ فَسَارَ فِي ذَلِكَ الْيَوْمِ وَاللَّيْلَةِ مَسِيرَةَ ثَلَاثٍقَالَ أَبُو دَاوُد رَوَاهُ ابْنُ جَابِرٍ عَنْ نَافِعٍ نَحْوَ هَذَا بِإِسْنَادِهِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عِيسَى عَنْ ابْنِ جَابِرٍ بِهَذَا الْمَعْنَى قَالَ أَبُو دَاوُد وَرَوَاهُ عَبْدُ اللَّهِ بْنُ الْعَلَاءِ عَنْ نَافِعٍ قَالَ حَتَّى إِذَا كَانَ عِنْدَ ذَهَابِ الشَّفَقِ نَزَلَ فَجَمَعَ بَيْنَهُمَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid Al Muharibi] telah menceritakan kepada kami [Muhammad bin Fudlail] dari [ayahnya] dari [Nafi'] dan [Abdullah bin Waqid] bahwa Mu'adzin [Ibnu Umar] berseru; \"Telah tiba waktu sholat…!\" Maka dia berkata; \"Jalan terus, jalan terus.\" sehingga ketika mega merah hampir hilang, dia singgah lalu mengerjakan sholat Maghrib. Kemudian menunggu sampai mega merah benar-benar hilang, lalu mengerjakan sholat Isya'. Setelah itu dia berkata; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam jika terdesak oleh suatu urusan, beliau melakukan seperti yang aku lakukan tadi.\" Lalu dia berjalan sehari semalam, sejauh perjalanan tiga malam.\" Abu Daud berkata; 'Di riwayatkan pula oleh [Ibnu Jabir] dari [Nafi'] seperti hadits ini dengan sanadnya. Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] telah mengabarkan kepada kami [Isa] dari [Ibnu Jabir] dengan Makna hadits ini. Abu Daud mengatakan; \"Di riwayatkan pula oleh [Abdullah bin Al 'Ala`] dari [Nafi'] dia berkata; \"…Hingga ketika mega merah telah hilang, maka beliau singgah lalu menjama' keduanya.\""
            },
            {
                "number": 1014,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا يَحْيَى بْنُ مُحَمَّدٍ الْجَارِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ مَالِكٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَابَتْ لَهُ الشَّمْسُ بِمَكَّةَ فَجَمَعَ بَيْنَهُمَا بِسَرِفٍحَدَّثَنَا مُحَمَّدُ بْنُ هِشَامٍ جَارُ أَحْمَدَ بْنِ حَنْبَلٍ حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ عَنْ هِشَامِ بْنِ سَعْدٍ قَالَ بَيْنَهُمَا عَشَرَةُ أَمْيَالٍ يَعْنِي بَيْنَ مَكَّةَ وَسَرِفٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Yahya bin Muhammad Al Jari] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Malik] dari [Abu Az Zubair] dari [Jabir] bahwa matahari telah tenggelam ketika Rasulullah shallallahu 'alaihi wasallam masih berada di Makkah, namun beliau baru menjama' sholat di daerah Saraf.\" Telah menceritakan kepada kami Muhammad bin Hisyam tetangga Ahmad bin Hambal, telah menceritakan kepada kami Ja'far bin 'Aun dari Hisyam bin Sa'd dia berkata: \"Jarak antara Makkah dengan Saraf adalah sekitar sepuluh mil.\""
            },
            {
                "number": 1015,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبٍ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ اللَّيْثِ قَالَ قَالَ رَبِيعَةُ يَعْنِي كَتَبَ إِلَيْهِ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ قَالَغَابَتْ الشَّمْسُ وَأَنَا عِنْدَ عَبْدِ اللَّهِ بْنِ عُمَرَ فَسِرْنَا فَلَمَّا رَأَيْنَاهُ قَدْ أَمْسَى قُلْنَا الصَّلَاةُ فَسَارَ حَتَّى غَابَ الشَّفَقُ وَتَصَوَّبَتْ النُّجُومُ ثُمَّ إِنَّهُ نَزَلَ فَصَلَّى الصَّلَاتَيْنِ جَمِيعًا ثُمَّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَدَّ بِهِ السَّيْرُ صَلَّى صَلَاتِي هَذِهِ يَقُولُ يَجْمَعُ بَيْنَهُمَا بَعْدَ لَيْلٍقَالَ أَبُو دَاوُد رَوَاهُ عَاصِمُ بْنُ مُحَمَّدٍ عَنْ أَخِيهِ عَنْ سَالِمٍ وَرَوَاهُ ابْنُ أَبِي نَجِيحٍ عَنْ إِسْمَعِيلَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ذُؤَيْبٍ أَنَّ الْجَمْعَ بَيْنَهُمَا مِنْ ابْنِ عُمَرَ كَانَ بَعْدَ غُيُوبِ الشَّفَقِ",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin Syu'aib] telah menceritakan kepada kami [Ibnu Wahb] dari [Al Laits] dia berkata; [Rabi'ah] berkata; -yaitu ia menulis surat kepada Al Laits- telah menceritakan kepadaku [Abdullah bin Dinar] dia berkata; \"Matahari telah terbenam, sementara aku berada di samping Abdullah bin Umar, lalu kami berangkat. Ketika kami tahu waktu telah sore, kami berkata; \"Waktu sholat telah tiba!.\" Namun Ibnu Umar masih tetap berjalan, hingga mega merah telah hilang dan bintang-bintang mulai muncul, kemudian [Ibnu Umar] singgah untuk menjama' dua sholat tersebut (Maghrib dan Isya), lalu dia berkata; \"Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam, apabila dalam suatu perjalanan mengalami kepayahan, beliau mengerjakan dua sholat ini.\" dia berkata; \"yaitu dengan menjama'nya ketika malam telah tiba.\" Abu Daud berkata; \"Di riwayatkan pula oleh ['Ashim bin Muhammad] dari [Saudaranya] dari [Salim]. Dan di riwayatkan pula oleh [Ibnu Abu Najih] dari [Isma'il bin Abdurrahman bin Dzu`aib] bahwa menjama' keduanya yang berasal dari Ibnu Umar adalah setelah hilang mega merah.\""
            },
            {
                "number": 1016,
                "arab": "حَدَّثَنَا قُتَيْبَةُ وَابْنُ مَوْهَبٍ الْمَعْنَى قَالَا حَدَّثَنَا الْمُفَضَّلُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا ارْتَحَلَ قَبْلَ أَنْ تَزِيغَ الشَّمْسُ أَخَّرَ الظُّهْرَ إِلَى وَقْتِ الْعَصْرِ ثُمَّ نَزَلَ فَجَمَعَ بَيْنَهُمَا فَإِنْ زَاغَتْ الشَّمْسُ قَبْلَ أَنْ يَرْتَحِلَ صَلَّى الظُّهْرَ ثُمَّ رَكِبَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ أَبُو دَاوُد كَانَ مُفَضَّلٌ قَاضِيَ مِصْرَ وَكَانَ مُجَابَ الدَّعْوَةِ وَهُوَ ابْنُ فَضَالَةَ حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي جَابِرُ بْنُ إِسْمَعِيلَ عَنْ عُقَيْلٍ بِهَذَا الْحَدِيثِ بِإِسْنَادِهِ قَالَ وَيُؤَخِّرُ الْمَغْرِبَ حَتَّى يَجْمَعَ بَيْنَهَا وَبَيْنَ الْعِشَاءِ حِينَ يَغِيبُ الشَّفَقُ",
                "id": "Telah menceritakan kepada kami [Qutaibah] dan [Ibnu Mauhib] sedangkan maksud haditsnya sama, keduanya berkata; telah menceritakan kepada kami [Al Mufadlal] dari ['Uqail] dari [Ibnu Syihab] dari [Anas bin Malik] dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam berangkat safar sebelum matahari condong (ke barat), maka beliau mengakhirkan Dluhur hingga waktu Ashar, kemudian beliau singgah dan menjama' keduanya, apabila matahari mulai condong sebelum berangkat, maka beliau mengerjakan sholat Dluhur lalu beliau shallallahu 'alaihi wasallam berangkat.\" Abu Daud berkata; \"Mufadlal adalah qadli (hakim) daerah Mesir, sedangkan orang yang di ijabahi do'anya adalah ibnu Fadlalah.\" Telah menceritakan kepada kami [Sulaiman bin Daud Al Mahri] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Jabir bin Isma'il] dari ['Uqail] seperti hadits ini dengan sanadnya, katanya; \"Kemudian beliau mengakhirkan waktu Maghrib hingga beliau menjama' sholat Isya' ketika mega merah telah hilang.\""
            },
            {
                "number": 1017,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ الْبَرَاءِ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَصَلَّى بِنَا الْعِشَاءَ الْآخِرَةَ فَقَرَأَ فِي إِحْدَى الرَّكْعَتَيْنِ بِالتِّينِ وَالزَّيْتُونِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari ['Adi bin Tsabit] dari [Al Barra`] dia berkata; \"Kami pernah bepergian bersama Rasulullah shallallahu 'alaihi wasallam, lalu beliau mengerjakan sholat Isya', di salah satu raka'atnya beliau membaca: \"At Tiin waz zaitun.\""
            },
            {
                "number": 1018,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ أَبِي بُسْرَةَ الْغِفَارِيِّ عَنْ الْبَرَاءِ بْنِ عَازِبٍ الْأَنْصَارِيِّ قَالَصَحِبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَمَانِيَةَ عَشَرَ سَفَرًا فَمَا رَأَيْتُهُ تَرَكَ رَكْعَتَيْنِ إِذَا زَاغَتْ الشَّمْسُ قَبْلَ الظُّهْرِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Shufwan bin Sulaim] dari [Abu Busrah Al Ghifari] dari [Al Barra` bin 'Azib Al Anshari] dia berkata; \"Aku pernah menyertai Rasulullah shallallahu 'alaihi wasallam dalam perjalanan sebanyak delapan belas kali, dan aku tidak pernah sama sekali melihat beliau meninggalkan dua raka'at ketika matahari telah condong.\""
            },
            {
                "number": 1019,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا عِيسَى بْنُ حَفْصِ بْنِ عَاصِمِ بْنِ عُمَرَ بْنِ الْخَطَّابِ عَنْ أَبِيهِ قَالَصَحِبْتُ ابْنَ عُمَرَ فِي طَرِيقٍ قَالَ فَصَلَّى بِنَا رَكْعَتَيْنِ ثُمَّ أَقْبَلَ فَرَأَى نَاسًا قِيَامًا فَقَالَ مَا يَصْنَعُ هَؤُلَاءِ قُلْتُ يُسَبِّحُونَ قَالَ لَوْ كُنْتُ مُسَبِّحًا أَتْمَمْتُ صَلَاتِي يَا ابْنَ أَخِي إِنِّي صَحِبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السَّفَرِ فَلَمْ يَزِدْ عَلَى رَكْعَتَيْنِ حَتَّى قَبَضَهُ اللَّهُ عَزَّ وَجَلَّوَصَحِبْتُ أَبَا بَكْرٍ فَلَمْ يَزِدْ عَلَى رَكْعَتَيْنِ حَتَّى قَبَضَهُ اللَّهُ عَزَّ وَجَلَّ وَصَحِبْتُ عُمَرَ فَلَمْ يَزِدْ عَلَى رَكْعَتَيْنِ حَتَّى قَبَضَهُ اللَّهُ تَعَالَى وَصَحِبْتُ عُثْمَانَ فَلَمْ يَزِدْ عَلَى رَكْعَتَيْنِ حَتَّى قَبَضَهُ اللَّهُ تَعَالَى وَقَدْ قَالَ اللَّهُ عَزَّ وَجَلَّ{ لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ }",
                "id": "telah menceritakan kepada kami [Al Qa'nabi] telah menceritakan kepada kami [Isa bin Hafsh bin 'Ashim bin Umar bin Khattab] dari [ayahnya] dia berkata; \"Aku pernah menemani Ibnu Umar dalam suatu perjalanan.\" Hafsh berkata; \"lalu Ibnu Umar melaksanakan sholat dua raka'at bersama kami, Kemudian dia menghadap, ketika dia melihat orang-orang berdiri, dia berkata; \"Apa yang di perbuat mereka?\" Jawabku; \"Mereka sedang mengerjakan sholat sunnah.\" [Ibnu Umar] berkata; \"Sekiranya aku mengerjakan sholat sunnah, tentu aku akan menyempurnakan sholatku. Wahai anak saudaraku, Sesungguhnya aku pernah menyertai Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan, namun beliau tidak pernah menambah dua raka'at hingga Allah Azza Wa Jalla mewafatkannya, aku juga pernah menyertai Abu Bakar, namun dia tidak pernah menambah dua raka'at hingga Allah Azza Wa Jalla mewafatkannya, aku juga menyertai Umar, namun dia tidak pernah menambah dua raka'at hingga Allah Ta'ala mewafatkannya, aku juga pernah menyertai Utsman, namun dia tidak pernah menambah dua raka'at hingga Allah Ta'ala mewafatkannya, sungguh Allah Azza Wa Jalla telah berfirman; \"Sesungguhnya Telah ada pada (diri) Rasulullah itu suri teladan yang baik bagimu.\" QS Al Ahzab; 21. "
            },
            {
                "number": 1020,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَبِّحُ عَلَى الرَّاحِلَةِ أَيَّ وَجْهٍ تَوَجَّهَ وَيُوتِرُ عَلَيْهَا غَيْرَ أَنَّهُ لَا يُصَلِّي الْمَكْتُوبَةَ عَلَيْهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Salim] dari [ayahnya] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan sholat sunnah di atas kendaraannya ke arah mana saja kendaraannya menghadap, dan pernah juga mengerjakan sholat witir di atas kendaraan, namun beliau tidak pernah mengerjakan sholat wajib di atas kendaraan.\""
            },
            {
                "number": 1021,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا رِبْعِيُّ بْنُ عَبْدِ اللَّهِ بْنِ الْجَارُودِ حَدَّثَنِي عَمْرُو بْنُ أَبِي الْحَجَّاجِ حَدَّثَنِي الْجَارُودُ بْنُ أَبِي سَبْرَةَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَافَرَ فَأَرَادَ أَنْ يَتَطَوَّعَ اسْتَقْبَلَ بِنَاقَتِهِ الْقِبْلَةَ فَكَبَّرَ ثُمَّ صَلَّى حَيْثُ وَجَّهَهُ رِكَابُهُ",
                "id": "telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Rib'i bin Abdullah bin Al Jarud] telah menceritakan kepadaku ['Amru bin Abu Al Hajjaj] telah menceritakan kepadaku [Jarud bin Abu Sabrah] telah menceritakan kepadaku [Anas bin Malik] bahwa apabila Rasulullah shallallahu 'alaihi wasallam hendak mengerjakan sholat sunnah, beliau menghadapkan untanya ke arah Kiblat, lalu beliau sholat ke arah mana saja kendaraan (untanya) menghadap.\""
            },
            {
                "number": 1022,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ عَنْ أَبِي الْحُبَابِ سَعِيدِ بْنِ يَسَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى حِمَارٍ وَهُوَ مُتَوَجِّهٌ إِلَى خَيْبَرَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari ['Amru bin Yahya Al Mazini] dari [Abu Al Habbab Sa'id bin Yasar] dari [Abdullah bin Umar] bahwa dia berkata; aku pernah melihat Rasulullah shallallahu 'alaihi wasallam sholat di atas keledai, sedangkan beliau menghadap ke arah Khaibar.\""
            },
            {
                "number": 1023,
                "arab": "حَدَّثَنَا ابْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَبَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَاجَةٍ قَالَ فَجِئْتُ وَهُوَ يُصَلِّي عَلَى رَاحِلَتِهِ نَحْوَ الْمَشْرِقِ وَالسُّجُودُ أَخْفَضُ مِنْ الرُّكُوعِ",
                "id": "Telah menceritakan kepada kami [Ibnu Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abu Az Zubair] dari [Jabir] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah mengutusku untuk suatu keperluan, katanya; \"lalu aku datang menemui beliau, sementara beliau sedang sholat di atas kendaraannya menghadap ke timur, dan sujud beliau lebih rendah daripada ruku' beliau.\""
            },
            {
                "number": 1024,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ عَنْ النُّعْمَانِ بْنِ الْمُنْذِرِ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ أَنَّهُ سَأَلَ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاهَلْ رُخِّصَ لِلنِّسَاءِ أَنْ يُصَلِّينَ عَلَى الدَّوَابِّ قَالَتْ لَمْ يُرَخَّصْ لَهُنَّ فِي ذَلِكَ فِي شِدَّةٍ وَلَا رَخَاءٍقَالَ مُحَمَّدٌ هَذَا فِي الْمَكْتُوبَةِ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Khalid] telah menceritakan kepada kami [Muhammad bin Syu'aib] dari [An Nu'man bin Al Mundzir] dari ['Atha` bin Abu Rabah] bahwa dia bertanya kepada [Aisyah] radliallahu 'anha; \"Apakah kaum wanita di beri keringanan untuk mengerjakan sholat di atas kendaraan (binatang tunggangan)?\" dia menjawab; \"Tidak ada keringanan bagi mereka mengenai hal itu, baik dalam keadaan susah atau lapang.\" Muhammad mengatakan; \"Larangan ini merupakan larangan dalam sholat wajib.\""
            },
            {
                "number": 1025,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا ابْنُ عُلَيَّةَ وَهَذَا لَفْظُهُ أَخْبَرَنَا عَلِيُّ بْنُ زَيْدٍ عَنْ أَبِي نَضْرَةَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَغَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَشَهِدْتُ مَعَهُ الْفَتْحَ فَأَقَامَ بِمَكَّةَ ثَمَانِي عَشْرَةَ لَيْلَةً لَا يُصَلِّي إِلَّا رَكْعَتَيْنِ وَيَقُولُ يَا أَهْلَ الْبَلَدِ صَلُّوا أَرْبَعًا فَإِنَّا قَوْمٌ سَفْرٌ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami [Ibnu 'Ulayyah] -lafadz hadits ini dari dia- telah mengabarkan kepada kami [Ali bin Zaid] dari [Abu Nadlrah] dari ['Imran bin Hushain] dia berkata; \"Aku berperang bersama Rasulullah shallallahu 'alaihi wasallam, dan aku juga menyaksikan bersama beliau ketika pembebasan kota Makkah, beliau bermukim di Makkah selama delapan belas hari, dan tidaklah beliau mengerjakan sholat, kecuali hanya dua raka'at, lalu beliau bersabda: 'wahai para penduduk (asli), sholatlah kalian empat raka'at, sebab kami ini adalah para musafir.\""
            },
            {
                "number": 1026,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ الْمَعْنَى وَاحِدٌ قَالَا حَدَّثَنَا حَفْصٌ عَنْ عَاصِمٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَامَ سَبْعَ عَشْرَةَ بِمَكَّةَ يَقْصُرُ الصَّلَاةَقَالَ ابْنُ عَبَّاسٍ وَمَنْ أَقَامَ سَبْعَ عَشْرَةَ قَصَرَ وَمَنْ أَقَامَ أَكْثَرَ أَتَمَّ قَالَ أَبُو دَاوُد قَالَ عَبَّادُ بْنُ مَنْصُورٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ أَقَامَ تِسْعَ عَشْرَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] dan [Utsman bin Abu Syaibah] dengan maksud yang sama, keduanya berkata; telah menceritakan kepada kami [Hafsh] dari ['Ashim] dari ['Ikrimah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam bermukim di Makkah selama tujuh belas hari, dan selalu mengqashar sholat.\" Ibnu Abbas berkata; \"Barangsiapa bermukim selama tujuh belas hari, maka ia boleh mengqashar sholat, dan barangsiapa bermukim lebih dari itu, dia harus menyempurnakan sholat.\" Abu Daud mengatakan; [Abbad bin Manshur] berkata dari [Ikrimah] dari [Ibnu Abbas] dia berkata; \"Beliau bermukim selama sembilan belas hari.\""
            },
            {
                "number": 1027,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَأَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ عَامَ الْفَتْحِ خَمْسَ عَشْرَةَ يَقْصُرُ الصَّلَاةَقَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ عَبْدَةُ بْنُ سُلَيْمَانَ وَأَحْمَدُ بْنُ خَالِدٍ الْوَهْبِيُّ وَسَلَمَةُ بْنُ الْفَضْلِ عَنْ أَبِي إِسْحَقَ لَمْ يَذْكُرُوا فِيهِ ابْنَ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [An Nufaili] telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] dia berkata; \"Pada hari penaklukan kota Makkah, Rasulullah shallallahu 'alaihi wasallam bermukim di sana selama lima belas hari, beliau selalu mengqashar sholat.\" Abu Daud mengatakan; \"Hadits ini di riwayatkan oleh [Abdah bin Sulaiman] dan [Ahmad bin Khalid Al Wahbi] serta [Salamah bin Al Fadl] dari [Abu Ishaq], namun mereka tidak menyebutkan Ibnu Abbas dalam hadits tersebut.\""
            },
            {
                "number": 1028,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنِي أَبِي حَدَّثَنَا شَرِيكٌ عَنْ ابْنِ الْأَصْبَهَانِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَامَ بِمَكَّةَ سَبْعَ عَشْرَةَ يُصَلِّي رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah mengabarkan kepadku [ayahku] telah menceritakan kepada kami [Syarik] dari [Ibnu Al Ashbahani] dari ['Ikrimah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam pernah bermukim di Makkah selama tujuh belas hari, beliau mengerjakan sholat dua raka'at.\""
            },
            {
                "number": 1029,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ الْمَعْنَى قَالَا حَدَّثَنَا وُهَيْبٌ حَدَّثَنِي يَحْيَى بْنُ أَبِي إِسْحَقَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمَدِينَةِ إِلَى مَكَّةَ فَكَانَ يُصَلِّي رَكْعَتَيْنِ حَتَّى رَجَعْنَا إِلَى الْمَدِينَةِفَقُلْنَا هَلْ أَقَمْتُمْ بِهَا شَيْئًا قَالَ أَقَمْنَا بِهَا عَشْرًا",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] dan [Muslim bin Ibrahim] sedangkan maksud haditsnya sama, keduanya berkata; telah menceritakan kepada kami [Wuhaib] telah menceritakan kepadaku [Yahya bin Abu Ishaq] dari [Anas bin Malik] dia berkata; \"Kami pernah bepergian bersama Rasulullah shallallahu 'alaihi wasallam dari madinah menuju Makkah, beliau selalu mengerjakan sholat dua raka'at sehingga kami kembali tiba di Madinah.\" Kami berkata; 'Apakah kalian bermukim di sana?\" dia berkata; \"Kami bermukim di sana selama sepuluh hari.\""
            }
        ]
    }
}