{
    "status": true,
    "data": {
        "start": 1177,
        "end": 1323,
        "total": 147,
        "book": "abu-daud",
        "hadits": [
            {
                "number": 1177,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ الْعَطَّارُ حَدَّثَنَا أَبُو بَحْرٍ حَدَّثَنَا ثَابِتُ بْنُ عُمَارَةَ حَدَّثَنَا أَبُو تَمِيمَةَ الْهُجَيْمِيُّ قَالَلَمَّا بَعَثْنَا الرَّكْبَ قَالَ أَبُو دَاوُد يَعْنِي إِلَى الْمَدِينَةِ قَالَ كُنْتُ أَقُصُّ بَعْدَ صَلَاةِ الصُّبْحِ فَأَسْجُدُ فَنَهَانِي ابْنُ عُمَرَ فَلَمْ أَنْتَهِ ثَلَاثَ مِرَارٍ ثُمَّ عَادَ فَقَالَ إِنِّي صَلَّيْتُ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَ أَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ رَضِيَ اللَّهُ عَنْهُمْ فَلَمْ يَسْجُدُوا حَتَّى تَطْلُعَ الشَّمْسُ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Ash Shabah Al 'Aththar], telah menceritakan kepada Kami [Abu Bahr], telah menceritakan kepada Kami [Tsabit bin 'Umarah], telah menceritakan kepada Kami [Abu Tamimah Al Hujaimi], ia berkata; tatkala Kami mengutus seorang penunggang kuda... Abu Daud berkata; yaitu ia menuju ke Madinah ia berkata; saya membaca (ayat As Sajdah) setelah sholat Subuh, kemudian aku bersujud, lalu [Ibnu Umar] melarangku dan aku tidak berhenti hingga tiga kali. Kemudian ia kembali dan berkata; sesungguhnya aku pernah melakukan sholat di belakang Rasulullah shallAllahu wa'alaihi wa sallam bersama Abu Bakr, Umar dan Utsman radliallahu 'anhum dan mereka tidak bersujud hingga matahari terbit. "
            },
            {
                "number": 1178,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا عِيسَى عَنْ زَكَرِيَّا عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمٍ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَهْلَ الْقُرْآنِ أَوْتِرُوا فَإِنَّ اللَّهَ وِتْرٌ يُحِبُّ الْوِتْرَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو حَفْصٍ الْأَبَّارُ عَنْ الْأَعْمَشِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ زَادَ فَقَالَ أَعْرَابِيٌّ مَا تَقُولُ فَقَالَ لَيْسَ لَكَ وَلَا لِأَصْحَابِكَ",
                "id": "Telah menceritakan kepada [Ibrahim bin Musa] telah mengabarkan kepada Kami [Isa] dari [Zakaria] dari [Abu Ishaq] dari ['Ashim] dari [Ali] radliallahu 'anhu ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam berkata; wahai ahli Al Qur'an, sholat witirlah kalian karena Allah adalah Dzat yang Maha Tunggal dan menyukai sesuatu yang ganjil. Telah berkata kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Abu Hafsh Al Abbar] dari [Al A'masy] dari ['Amr bin Murrah] dari [Abu Ubaidah] dari [Abdullah] dari Nabi Shalla Allahu 'alaihi wa sallam dengan makna yang sama namun ia menambahkan; kemudian terdapat seorang badui berkata; apa yang kamu katakan? Dia menjawab; bukan urusanmu dan bukan urusan para sahabatmu. "
            },
            {
                "number": 1179,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ الْمَعْنَى قَالَا حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عَبْدِ اللَّهِ بْنِ رَاشِدٍ الزَّوْفِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُرَّةَ الزَّوْفِيِّ عَنْ خَارِجَةَ بْنِ حُذَافَةَ قَالَ أَبُو الْوَلِيدِ الْعَدَوِيُّخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ قَدْ أَمَدَّكُمْ بِصَلَاةٍ وَهِيَ خَيْرٌ لَكُمْ مِنْ حُمْرِ النَّعَمِ وَهِيَ الْوِتْرُ فَجَعَلَهَا لَكُمْ فِيمَا بَيْنَ الْعِشَاءِ إِلَى طُلُوعِ الْفَجْرِ",
                "id": "Telah menceritakan kepada Kami [Abul Walid Ath Thayalisi] dan [Qutaibah bin Sa'id] secara makna, mereka mengatakan; telah menceritakan kepada Kami [Al Laits] dari [Yazid bin Abu Habib] dari [Abdullah bin Rasyid Az Zaufi] dari [Abdullah bin Abu Murrah Az Zaufi] dari [Kharijah bin Hudzafah], Abu Al Walid Al Adawi berkata; Rasulullah shallAllahu wa'alaihi wa sallam keluar menemui Kami dan berkata: \"Sesungguhnya Allah telah mewajibkan bagi kalian sebuah sholat yang dia lebih baik bagi kalian dari pada unta merah, yaitu sholat witir, dan telah menjadikannya berada diantara sholat Isya hingga terbit fajar.\""
            },
            {
                "number": 1180,
                "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا أَبُو إِسْحَقَ الطَّالْقَانِيُّ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ الْعَتَكِيِّ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْوِتْرُ حَقٌّ فَمَنْ لَمْ يُوتِرْ فَلَيْسَ مِنَّا الْوِتْرُ حَقٌّ فَمَنْ لَمْ يُوتِرْ فَلَيْسَ مِنَّا الْوِتْرُ حَقٌّ فَمَنْ لَمْ يُوتِرْ فَلَيْسَ مِنَّا",
                "id": "Telah menceritakan kepada Kami [Ibnu Al Mutsanna], telah menceritakan kepada Kami [Abu Ishaq Ath Thaqani], telah menceritakan kepada Kami [Al Fadhl bin Musa] dari ['ubaidhullah bin Abdullah Al 'Ataki] dari [Abdullah bin Buraidah] dari [ayahnya], ia berkata; saya mendengar Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"sholat witir adalah sebuah hak, barang siapa yang tidak melakukan sholat witir maka ia bukan dari golongan Kami, sholat witir adalah sebuah hak, barang siapa yang tidak melakukan sholat witir maka bukan dari golongan Kami, sholat witir adalah sebuah hak, barang siapa yang tidak melakukan sholat witir, barang siapa yang tidak melakukan sholat witir maka bukan dari golongan Kami.\""
            },
            {
                "number": 1181,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ ابْنِ مُحَيْرِيزٍأَنَّ رَجُلًا مِنْ بَنِي كِنَانَةَ يُدْعَى الْمَخْدَجِيَّ سَمِعَ رَجُلًا بِالشَّامِ يُدْعَى أَبَا مُحَمَّدٍ يَقُولُ إِنَّ الْوِتْرَ وَاجِبٌ قَالَ الْمَخْدَجِيُّ فَرُحْتُ إِلَى عُبَادَةَ بْنِ الصَّامِتِ فَأَخْبَرْتُهُ فَقَالَ عُبَادَةُ كَذَبَ أَبُو مُحَمَّدٍ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ خَمْسُ صَلَوَاتٍ كَتَبَهُنَّ اللَّهُ عَلَى الْعِبَادِ فَمَنْ جَاءَ بِهِنَّ لَمْ يُضَيِّعْ مِنْهُنَّ شَيْئًا اسْتِخْفَافًا بِحَقِّهِنَّ كَانَ لَهُ عِنْدَ اللَّهِ عَهْدٌ أَنْ يُدْخِلَهُ الْجَنَّةَ وَمَنْ لَمْ يَأْتِ بِهِنَّ فَلَيْسَ لَهُ عِنْدَ اللَّهِ عَهْدٌ إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ أَدْخَلَهُ الْجَنَّةَ",
                "id": "Telah menceritakan kepada Kami [Al Qa'nabi] dari [Malik] dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari [Ibnu Muhairiz] bahwa seorang laki-laki dari Bani Kinanah yang dipanggil Al Makhdaji telah mendengar seorang laki-laki di Syam yang dipanggil Abu Muhammad berkata; sesungguhnya sholat witir adalah wajib. [Al Makhdaji] berkata; kemudian aku pergi kepada 'Ubadah bin Ash Shamid dan mengabarkan hal tersebut kepadanya. ['Ubadah] berkata; Abu Muhammad telah berdusta, aku telah mendengar Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Lima sholat, telah Allah wajibkan bagi para hamba, barang siapa yang melakukannya dan tidak memenyia-nyiakan sedikitpun darinya karena meremehkan haknya maka baginya di sisi Allah sebuah perjanjian untuk Allah masukkan dirinya ke dalam Surga. Sedangkan orang yang tidak melaksanakannya maka ia tidak memiliki perjanjian di sisi Allah, apabila Allah menghendaki maka Dia akan menyiksanya aan apabila menghendaki maka Allah akan memasukkannya ke dalam Surga.\""
            },
            {
                "number": 1182,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ ابْنِ عُمَرَأَنَّ رَجُلًا مِنْ أَهْلِ الْبَادِيَةِ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ فَقَالَ بِأُصْبُعَيْهِ هَكَذَا مَثْنَى مَثْنَى وَالْوِتْرُ رَكْعَةٌ مِنْ آخِرِ اللَّيْلِ",
                "id": "Telah menceritakan kepada Kamin [Muhammad bin Katsir] telah mengabarkan kepada Kami [Hammam] dari [Qatadah] dari [Abdullah bin Syaqiq] dari [Ibnu Umar] bahwa seorang laki-laki badui bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai sholat malam. Kemudian beliau mengatakan menggunakan jari-jarinya: \"Dua, dua, dan witir satu reka'at pada akhir malam.\""
            },
            {
                "number": 1183,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ حَدَّثَنِي قُرَيْشُ بْنُ حَيَّانَ الْعِجْلِيُّ حَدَّثَنَا بَكْرُ بْنُ وَائِلٍ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوِتْرُ حَقٌّ عَلَى كُلِّ مُسْلِمٍ فَمَنْ أَحَبَّ أَنْ يُوتِرَ بِخَمْسٍ فَلْيَفْعَلْ وَمَنْ أَحَبَّ أَنْ يُوتِرَ بِثَلَاثٍ فَلْيَفْعَلْ وَمَنْ أَحَبَّ أَنْ يُوتِرَ بِوَاحِدَةٍ فَلْيَفْعَلْ",
                "id": "Telah menceritakan kepada Kami [Abdurrahman bin Al Mubarak], telah menceritakan kepadaku [Quraisy bin Hayyan Al 'Ijli] telah menceritakan kepada Kami [Bakr bin Wail] dari [Az Zuhri] dari ['Atha` bin Yazid Al Laitsi] dari [Abu Ayyub Al Anshari] ia berkata; rasul shallallahu 'alaihi wasallam bersabda: \"Witir adalah sebuah hak atas setiap muslim, barang siapa yang hendak melakukan witir lima raka'at maka hendaknya ia melakukankannya dan barang siapa yang hendak melakukan witir tiga raka'at maka hendaknya ia melakukannya, dan barang siapa yang hendak melakukan witir satu raka'at maka hendaknya ia melakukannya.\""
            },
            {
                "number": 1184,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو حَفْصٍ الْأَبَّارُ ح و حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا مُحَمَّدُ بْنُ أَنَسٍ وَهَذَا لَفْظُهُ عَنْ الْأَعْمَشِ عَنْ طَلْحَةَ وَزُبَيْدٍ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ لِلَّذِينَ كَفَرُوا وَاللَّهُ الْوَاحِدُ الصَّمَدُحَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ حَدَّثَنَا خُصَيْفٌ عَنْ عَبْدِ الْعَزِيزِ بْنِ جُرَيْجٍ قَالَ سَأَلْتُ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ بِأَيِّ شَيْءٍ كَانَ يُوتِرُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مَعْنَاهُ قَالَ وَفِي الثَّالِثَةِ بِقُلْ هُوَ اللَّهُ أَحَدٌ وَالْمُعَوِّذَتَيْنِ",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Abu Hafsh Al Abbar], dan diriwayatkan dari jalur yang lain: Telah menceritakan kepada Kami [Ibrahim bin Musa] telah mengabarkan kepada Kami [Muhammad bin Anas] dan ini adalah lafazhnya, dari [Al A'masy] dari [Thalhah] dan [Zubaid] dari [Sa'id? bin Abdurrahman bin Abza] dari [ayahnya] dari [Ubai bin Ka'bin] ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam melakukan witir dengan membaca \"Sabbihisma rabbikal a'laa\" (Surat Al A'la) dan \"Qul lilladzina kafaruu\" (Surat Al Kaafiruun) serta \"WAllahul wahidush shamad\" (Surat Al Ikhlash). Telah berkata kepada Kami [Ahmad bin Abu Syu'aib], telah menceritakan kepada Kami [Muhammad bin Salamah], telah menceritakan kepada Kami [Khushaif] dari [Abdul Aziz bin Juraij] berkata; aku bertanya kepada [Aisyah] ummul mukminin radhiyAllahu; surat apakah yang dibaca Rasulullah shallAllahu wa'alaihi wa sallam ketika melakukan witir? Kemudian ia menyebutkan maknanya; dan pada raka'at yang ketiga beliau membaca \"Qul Huwallaahu Ahad\" dan \"Mu'awwidzatain\" (Surat Al Falaq dan An Naas). "
            },
            {
                "number": 1185,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَحْمَدُ بْنُ جَوَّاسٍ الْحَنَفِيُّ قَالَا حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَبِي الْحَوْرَاءِ قَالَ قَالَ الْحَسَنُ بْنُ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُمَاعَلَّمَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَلِمَاتٍ أَقُولُهُنَّ فِي الْوِتْرِ قَالَ ابْنُ جَوَّاسٍ فِي قُنُوتِ الْوِتْرِ اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ وَعَافِنِي فِيمَنْ عَافَيْتَ وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ وَبَارِكْ لِي فِيمَا أَعْطَيْتَ وَقِنِي شَرَّ مَا قَضَيْتَ إِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ وَإِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ وَلَا يَعِزُّ مَنْ عَادَيْتَ تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو إِسْحَقَ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ فِي آخِرِهِ قَالَ هَذَا يَقُولُ فِي الْوِتْرِ فِي الْقُنُوتِ وَلَمْ يَذْكُرْ أَقُولُهُنَّ فِي الْوِتْرِ أَبُو الْحَوْرَاءِ رَبِيعَةُ بْنُ شَيْبَانَ",
                "id": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id] dan [Ahmad bin Jawwas Al Hanafi] mereka berkata; telah menceritakan kepada Kami [Abu Al Ahwash] dari [Abu Ishaq] dari [Buraid bin Abu Maryam] dari [Abu Al Haura`], ia berkata; telah berkata [Al Hasan bin Ali radliallahu 'anhuma]; Rasulullah shallAllahu wa'alaihi wa sallam telah mengajarkan kepada beberapa kalimat yang aku ucapkan ketika melakukan witir.. Ibnu Hawwas berkata; ketika melakukan qunut witir yaitu; ALLAAHUMMAH DINII FIIMAN HADAIT, WA 'AAFINII FIIMAN TAWALLAIT, WA BAARIK LII FIIMAA A'THAIT, WA QINII SYARRA MAA QADHAIT, INNAKA TAQDHII WA LAA YUQDHAA 'ALAIK, WA INNAHU LAA YADZILLU MAN WAALAIT, WA LAA YA'IZZU MAN 'AADAIT, TABAARAKTA RABBANAA WA TA'AALAIT (Ya Allah, berilah aku petunjuk diantara orang-orang yang Engkau beri petunjuk, dan berilah aku keselamatan diantara orang-orang yang telah Engkau beri keselamatan, uruslah diriku diantara orang-orang yang telah Engkau urus, berkahilah untukku apa yang telah Engkau berikan kepadaku, lindungilah aku dari keburukan apa yang telah Engkau putuskan, sesungguhnya Engkau Yang memutuskan dan tidak diputuskan kepadaku, sesungguhnya tidak akan hina orang yang telah Engkau jaga dan Engkau tolong, dan tidak akan mulia orang yang Engkau musuhi. Engkau Maha Suci dan Maha Tinggi). Telah menceritakan kepada Kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada Kami [Zuhair], telah menceritakan kepada Kami [Abu Ishaq] dengan sanad serta maknannya, ia berkata pada akhir hadits tersebut; Abu Al Haura` Rabi'ah bin Syaiban mengatakan hal ini yaitu; beliau mengucapkan ketika melakukan qunud dalam witir: \"…..\" dan ia tidak menyebutkan; aku mengucapkannya dalam witir. "
            },
            {
                "number": 1186,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ هِشَامِ بْنِ عَمْرٍو الْفَزَارِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ فِي آخِرِ وِتْرِهِ اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سُخْطِكَ وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ وَأَعُوذُ بِكَ مِنْكَ لَا أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَقَالَ أَبُو دَاوُد هِشَامٌ أَقْدَمُ شَيْخٍ لِحَمَّادٍ وَبَلَغَنِي عَنْ يَحْيَى بْنِ مَعِينٍ أَنَّهُ قَالَ لَمْ يَرْوِ عَنْهُ غَيْرُ حَمَّادِ بْنِ سَلَمَةَ قَالَ أَبُو دَاوُد رَوَى عِيسَى بْنُ يُونُسَ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَيِّ بْنِ كَعْبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَنَتَ يَعْنِي فِي الْوِتْرِ قَبْلَ الرُّكُوعِ قَالَ أَبُو دَاوُد رَوَى عِيسَى بْنُ يُونُسَ هَذَا الْحَدِيثَ أَيْضًا عَنْ فِطْرِ بْنِ خَلِيفَةَ عَنْ زُبَيْدٍ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَيِّ بْنِ كَعْبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ وَرُوِيَ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ مِسْعَرٍ عَنْ زُبَيْدٍ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَيِّ بْنِ كَعْبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَنَتَ فِي الْوِتْرِ قَبْلَ الرُّكُوعِ قَالَ أَبُو دَاوُد وَحَدِيثُ سَعِيدٍ عَنْ قَتَادَةَ رَوَاهُ يَزِيدُ بْنُ زُرَيْعٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ عَزْرَةَ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَذْكُرْ الْقُنُوتَ وَلَا ذَكَرَ أُبَيًّا وَكَذَلِكَ رَوَاهُ عَبْدُ الْأَعْلَى وَمُحَمَّدُ بْنُ بِشْرٍ الْعَبْدِيُّ وَسَمَاعُهُ بِالْكُوفَةِ مَعَ عِيسَى بْنِ يُونُسَ وَلَمْ يَذْكُرُوا الْقُنُوتَ وَقَدْ رَوَاهُ أَيْضًا هِشَامٌ الدَّسْتُوَائِيُّ وَشُعْبَةُ عَنْ قَتَادَةَ وَلَمْ يَذْكُرَا الْقُنُوتَ وَحَدِيثُ زُبَيْدٍ رَوَاهُ سُلَيْمَانُ الْأَعْمَشُ وَشُعْبَةُ وَعَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ وَجَرِيرُ بْنُ حَازِمٍ كُلُّهُمْ عَنْ زُبَيْدٍ لَمْ يَذْكُرْ أَحَدٌ مِنْهُمْ الْقُنُوتَ إِلَّا مَا رُوِيَ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ مِسْعَرٍ عَنْ زُبَيْدٍ فَإِنَّهُ قَالَ فِي حَدِيثِهِ إِنَّهُ قَنَتَ قَبْلَ الرُّكُوعِ قَالَ أَبُو دَاوُد وَلَيْسَ هُوَ بِالْمَشْهُورِ مِنْ حَدِيثِ حَفْصٍ نَخَافُ أَنْ يَكُونَ عَنْ حَفْصٍ عَنْ غَيْرِ مِسْعَرٍ قَالَ أَبُو دَاوُد وَيُرْوَى أَنَّ أُبَيًّا كَانَ يَقْنُتُ فِي النِّصْفِ مِنْ شَهْرِ رَمَضَانَ",
                "id": "Telah menceritakan kepada Kami [Musa bin Isma'il], telah menceritakan kepada Kami [Hammad] dari [Hisyam bin 'Amr Al Fazari] dari [Abdurrahman bin Al Harits bin Hisyam] dari [Ali bin Abu Thalib] radliallahu 'anhu bahwa Rasulullah shallAllahu wa'alaihi wa sallam di akhir sholat witirnya membaca: \"ALLAAHUMMA INNII A'UUDZU BIRIDHAAKA MIN SAKHATHIKA WA BIMU'AAFAATIK, MIN 'UQUUBATIK, WA A'UUDZU BIKA MINKA LAA UHSHII TSANAA-AN 'ALAIK, ANTA KAMAA ATSNAITA 'ALAA NAFSIK.\" (Ya Allah, aku berlindung dengan keridhaanMU dari murkaMu dan kepada ampunanMu dari adzabMu, dan aku berlindung kepadaMu dariMu, aku tidak dapat menghitung pujian kepadaMu, Engkau sebagaimana yang telah Engkau puji diri-Mu). Abu Daud berkata; Hisyam adalah guru Hammad yang paling tua, dan telah sampai kepadaku dari Yahya bin Ma'in bahwa ia berkata; tidak ada yang meriwayatkan dari Hisyam selain Hammad bin Salamah. Abu Daud berkata; [Isa bin Yunus] telah meriwayatkan dari [Sa'id? bin Abu Arubah] dari [Qatadah] dari [Sa'id? bin Abdurrahman bin Abza] dari [bapaknya] dari [Ubai bin Ka'b] bahwa Rasulullah shallAllahu wa'alaihi wa sallam melaksanakan qunut pada waktu witir sebelum ruku'. Abu Daud berkata; [Isa bin Yunus] meriwayatkan hadits ini juga dari [Fithr bin Khalifah] dari [Zubaid] dari [Sa'id? bin Abdurrahman bin Abza] dari [ayahnya] dari [Ubai bin Ka'b] dari Nabi Shalla Allahu 'alaihi wa sallam seperti itu. Dan telah diriwayatkan dari [Hafsh bin ghiyats] dari [Mis'ar] dari [Zubaid] dari [Sa'id? bin Abdurrahman bin Abza] dari [ayahnya] dari [Ubai bin Ka'b] bahwa Rasulullah shallAllahu wa'alaihi wa sallam melakukan qunut pada waktu sholat witir sebelum ruku'. Abu Daud berkata; dan hadits Sa'id dari Qatadah diriwayatkan oleh [Yazid bin Zurai'] dari [Sa'id?] dari [Qatadah] dari [Azrah] dari [Sa'id? bin Abdurrahman bin Abza] dari [bapaknya] dari Nabi Shalla Allahu 'alaihi wa sallam, ia tidak menyebutkan qunut dan tidak pula menyebutkan Ubai. Dan begitu juga diriwayatkan oleh [Abdul A'la] dan [Muhammad bin Bisyr Al 'Abdi] dan ia mendengarnya di Kufah bersama [Isa bin Yunus] dan mereka tidak menyebutkan qunut. Dan telah diriwayatkan pula oleh [Hisyam Ad Dastuwa-i] dan [Syu'bah] dari [Qatadah] dan mereka berdua tidak menyebutkan qunut. Hadits Zubaid diriwayatkan oleh [Sulaiman Al A'masy], [Syu'bah], [Abdul Malik bin Abu Sulaiman] dan [Jarir bin Hazim], mereka semua meriwayatkan dari [Zubaid] dan tidak ada seorangpun dari mereka yang menyebutkan qunut kecuali hadits yang diriwayatkan dari [Hafsh bin ghiyats] dari [Mis'ar] dari [Zubaid], sesungguhnya ia menyebutkan dalam haditsnya bahwa beliau melakukan qunut sebelum ruku'. Abu Daud berkata; hal tersebut tidaklah yang dikenal dari hadits Hafsh, Kami hal tersebut berasal dari Hafsh dari selain Mis'ar. Abu Daud berkata; dan diriwayatkan bahwasanya [Ubai bin Kaab] melaksanakan witir pada pertengahan bulan Ramadhan. "
            },
            {
                "number": 1187,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا هِشَامٌ عَنْ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِأَنَّ أُبَيَّ بْنَ كَعْبٍ أَمَّهُمْ يَعْنِي فِي رَمَضَانَ وَكَانَ يَقْنُتُ فِي النِّصْفِ الْآخِرِ مِنْ رَمَضَانَ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Muhammad bin Hanbal], telah menceritakan kepada Kami [Muhammad bin Bakr], telah mengabarkan kepadaku [Hisyam] dari [Muhammad] dari [sebagian sahabatnya] bahwa [Ubai bin Ka'b] mengimami mereka pada bulan ramadhan dan dia qunut pada pertengahan terakhir bulan Ramadhan. "
            },
            {
                "number": 1188,
                "arab": "حَدَّثَنَا شُجَاعُ بْنُ مَخْلَدٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يُونُسُ بْنُ عُبَيْدٍ عَنْ الْحَسَنِ أَنَّعُمَرَ بْنَ الْخَطَّابِ جَمَعَ النَّاسَ عَلَى أُبَيِّ بْنِ كَعْبٍ فَكَانَ يُصَلِّي لَهُمْ عِشْرِينَ لَيْلَةً وَلَا يَقْنُتُ بِهِمْ إِلَّا فِي النِّصْفِ الْبَاقِي فَإِذَا كَانَتْ الْعَشْرُ الْأَوَاخِرُ تَخَلَّفَ فَصَلَّى فِي بَيْتِهِ فَكَانُوا يَقُولُونَ أَبَقَ أُبَيٌّقَالَ أَبُو دَاوُد وَهَذَا يَدُلُّ عَلَى أَنَّ الَّذِي ذُكِرَ فِي الْقُنُوتِ لَيْسَ بِشَيْءٍ وَهَذَانِ الْحَدِيثَانِ يَدُلَّانِ عَلَى ضَعْفِ حَدِيثِ أُبَيٍّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَنَتَ فِي الْوِتْرِ",
                "id": "Telah menceritakan kepada Kami [Syuja' bin Makhlad], telah menceritakan kepada Kami [Husyaim], telah mengabarkan kepada Kami [Yunus bin 'Ubaid] dari [Al Hasan] bahwa [Umar bin Khathab] RhadhiyAllahu 'anhu mengumpulkan orang-orang untuk melakukan sholat dibelakang Ubai bin Kaab, ia melakukan sholat sebagai imam mereka selama dua puluh malam, dan dia tidak melakukan qunut bersama mereka kecuali pada setengah bulan terakhir. Dan apabila sudah masuk hari kesepuluh terakhir ia mengundurkan diri dan melakukan sholat dirumahnya, hingga orang-orang mengatakan bahwa Ubai telah kabur. Abu Daud berkata; hadits ini menunjukkan bahwa hadits yang telah disebutkan mengenai qunut tidak berarti apa-apa, dan dua hadits ini menunjukkan kelemahan hadits Ubai bahwa Nabi Shalla Allahu 'alaihi wa sallam melakukan qunut pada waktu witir. "
            },
            {
                "number": 1189,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُبَيْدَةَ حَدَّثَنَا أَبِي عَنْ الْأَعْمَشِ عَنْ طَلْحَةَ الْأَيَامِيِّ عَنْ ذَرٍّ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَلَّمَ فِي الْوِتْرِ قَالَ سُبْحَانَ الْمَلِكِ الْقُدُّوسِ",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Muhammad bin Abu 'Ubaidah], telah menceritakan kepada Kami [ayahku] dari [Al A'masy] dari [Thalhah Al Ayami] dari [Dzar] dari [Sa'id? bin Abdurrahman bin Abza] dari [ayahnya] dari [Ubai bin Ka'b], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam apabila telah melakukan salam dalam sholat witir beliau mengucapkan: \"SUBHAANAL MALIKIL QUDDUUS\" (Maha suci Raja Yang Maha Suci). "
            },
            {
                "number": 1190,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ حَدَّثَنَا عُثْمَانُ بْنُ سَعِيدٍ عَنْ أَبِي غَسَّانَ مُحَمَّدِ بْنِ مُطَرِّفٍ الْمَدَنِيِّ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَامَ عَنْ وِتْرِهِ أَوْ نَسِيَهُ فَلْيُصَلِّهِ إِذَا ذَكَرَهُ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin 'Auf], telah menceritakan kepada Kami [Utsman bin Sa'id] dari [Abu Gassan Muhammad bin Mutharrif Al Madani] dari [Zaid bin Aslam] dari ['Atha` bin Yasar] dari [Abu Sa'id], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barang siapa yang tertidur dari melakukan witir atau lupa untuk melakukannya maka hendaknya ia melakukannya apabila ia ingat.\""
            },
            {
                "number": 1191,
                "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ عَنْ قَتَادَةَ عَنْ أَبِي سَعِيدٍ مِنْ أَزْدِ شَنُوءَةَ عَنْ أَبِي هُرَيْرَةَ قَالَأَوْصَانِي خَلِيلِي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثٍ لَا أَدَعُهُنَّ فِي سَفَرٍ وَلَا حَضَرٍ رَكْعَتَيْ الضُّحَى وَصَوْمِ ثَلَاثَةِ أَيَّامٍ مِنْ الشَّهْرِ وَأَنْ لَا أَنَامَ إِلَّا عَلَى وِتْرٍ",
                "id": "Telah menceritakan kepada Kami [Ibnu Al Mutsanna], telah menceritakan kepada Kami [Abu Daud], telah menceritakan kepada Kami [Aban bin Yazid] dari [Qatadah] dari [Abu Sa'id?] yang berasal dari Azd Syanuah, dari [Abu Hurairah], ia berkata; kekasihku shallallahu 'alaihi wasallam telah berwasiat kepadaku dengan tiga perkara, aku tidak meninggalkannya ketika bepergian mupun ketika bermukim, yaitu melakukan sholat dua raka'at sholat Dhuha, serta berpuasa tiga hari setiap bulan, dan agar aku tidak tidur kecuali telah melakukan sholat witir. "
            },
            {
                "number": 1192,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ حَدَّثَنَا أَبُو الْيَمَانِ عَنْ صَفْوَانَ بْنِ عَمْرٍو عَنْ أَبِي إِدْرِيسَ السَّكُونِيِّ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِي الدَّرْدَاءِ قَالَأَوْصَانِي خَلِيلِي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثٍ لَا أَدَعُهُنَّ لِشَيْءٍ أَوْصَانِي بِصِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَلَا أَنَامُ إِلَّا عَلَى وِتْرٍ وَبِسُبْحَةِ الضُّحَى فِي الْحَضَرِ وَالسَّفَرِ",
                "id": "Telah menceritakan kepada Kami [Abdul Wahhab bin Najdah], telah menceritakan kepada Kami [Abu Al Yaman] dari [Shafwan bin 'Amr] dari [Abu Idris As Sakuni] dari [Jubair bin Nufair] dari [Abu Ad Darda`], ia berkata; kekasihku shallallahu 'alaihi wasallam telah berwasiat kepadaku dengan tiga perkara, aku tidak meninggalkannya karena sesuatu, beliau berwasiat kepadaku agar melakukan puasa tiga hari setiap bulan, tidak tidur kecuali telah melakukan witir, dan melakukan sholat Dhuha disaat bermukim dan sedang bepergian. "
            },
            {
                "number": 1193,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ حَدَّثَنَا أَبُو زَكَرِيَّا يَحْيَى بْنُ إِسْحَقَ السَّيْلَحِينِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ عَنْ أَبِي قَتَادَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي بَكْرٍ مَتَى تُوتِرُ قَالَ أُوتِرُ مِنْ أَوَّلِ اللَّيْلِ وَقَالَ لِعُمَرَ مَتَى تُوتِرُ قَالَ آخِرَ اللَّيْلِ فَقَالَ لِأَبِي بَكْرٍ أَخَذَ هَذَا بِالْحَزْمِ وَقَالَ لِعُمَرَ أَخَذَ هَذَا بِالْقُوَّةِ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Ahmad bin Abu Khalaf] telah menceritakan kepada Kami [Abu Zakariya Yahya bin Ishaq As Sailahini] telah menceritakan kepada Kami [Hammad bin Salamah] dari [Tsabit] dari [Abdullah bin Rabah] dari [Abu Qatadah] bahwa Nabi shallallahu 'alaihi wasallam bertanya kepada Abu Bakar: \" Kapankah kamu melaksanakan witir?\" Dia menjawab; saya melakukan witir dipermulaan malam. Dan beliau bertanya kepada Umar: \"Kapankah kamu melaksanakan witir?\" Dia menjawab: saya melakukan witir pada akhir malam. Kemudian beliau berkata kepada Abu Bakar; \"Orang ini telah melakukan dengan keteguhan hati, \" dan kepada Umar beliau mengatakan: \"Sedangkan orang ini telah melakukan dengan kemantapan.\""
            },
            {
                "number": 1194,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ الْأَعْمَشِ عَنْ مُسْلِمٍ عَنْ مَسْرُوقٍ قَالَ قُلْتُ لِعَائِشَةَمَتَى كَانَ يُوتِرُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كُلَّ ذَلِكَ قَدْ فَعَلَ أَوْتَرَ أَوَّلَ اللَّيْلِ وَوَسَطَهُ وَآخِرَهُ وَلَكِنْ انْتَهَى وِتْرُهُ حِينَ مَاتَ إِلَى السَّحَرِ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Yunus], telah menceritakan kepada Kami [Abu Bakr bin 'Ayyasy] dari [Al A'masy] dari [Muslim] dari [Masruq], ia berkata; aku katakan kepada [Aisyah]; kapankah Rasulullah shallallahu 'alaihi wasallam melakukan witir? Ia berkata; semua itu telah beliau lakukan, beliau telah melakukan witir di permulaan malam, di pertengahan malam, dan di akhir malam, akan tetapi witir beliau selesai tatkala beliau akan meninggal hingga waktu pagi. "
            },
            {
                "number": 1195,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَادِرُوا الصُّبْحَ بِالْوِتْرِ",
                "id": "Telah menceritakan kepada Kami [Harun bin Ma'ruf], telah menceritakan kepada Kami [Ibnu Abu Zaidah], ia berkata; telah menceritakan kepadaku ['ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Bersegeralah melakukan witir sebelum waktu Subuh.\""
            },
            {
                "number": 1196,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ قَالَسَأَلْتُ عَائِشَةَ عَنْ وِتْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ رُبَّمَا أَوْتَرَ أَوَّلَ اللَّيْلِ وَرُبَّمَا أَوْتَرَ مِنْ آخِرِهِ قُلْتُ كَيْفَ كَانَتْ قِرَاءَتُهُ أَكَانَ يُسِرُّ بِالْقِرَاءَةِ أَمْ يَجْهَرُ قَالَتْ كُلَّ ذَلِكَ كَانَ يَفْعَلُ رُبَّمَا أَسَرَّ وَرُبَّمَا جَهَرَ وَرُبَّمَا اغْتَسَلَ فَنَامَ وَرُبَّمَا تَوَضَّأَ فَنَامَقَالَ أَبُو دَاوُد و قَالَ غَيْرُ قُتَيْبَةَ تَعْنِي فِي الْجَنَابَةِ",
                "id": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id?], telah menceritakan kepada Kami [Al Laits bin Sa'd] dari [Mu'awiyah bin Shalih] dari [Abdullah bin Abu Qais], ia berkata; saya bertanya kepada [Aisyah] mengenai witir Rasulullah shallAllahu wa'alaihi wa sallam, ia berkata; terkadang beliau melakukan witir pada awal malam, dan terkadang melakukan witir di akhirnya. Saya katakan; bagaimana bacaan beliau, apakah beliau menyamarkan bacaan atau mengeraskannya? Aisyah berkata; semua itu pernah beliau lakukan. Beliau terkadang menyamarkan dan terkadang mengeraskan, terkadang beliau mandi kemudian tidur terkadang beliau berwudhu kemudian tidur. Abu Daud berkata; selain Qutaibah berkata; yang dimaksudkan Aisyah adalah ketika dalam keadaan junub. "
            },
            {
                "number": 1197,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اجْعَلُوا آخِرَ صَلَاتِكُمْ بِاللَّيْلِ وِتْرًا",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Hanbal] telah menceritakan kepada Kami [Yahya] dari ['ubaidhullah] telah menceritakan kepadaku [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Jadikan sholat terakhir kalian adalah sholat witir.\""
            },
            {
                "number": 1198,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا مُلَازِمُ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَدْرٍ عَنْ قَيْسِ بْنِ طَلْقٍ قَالَزَارَنَا طَلْقُ بْنُ عَلِيٍّ فِي يَوْمٍ مِنْ رَمَضَانَ وَأَمْسَى عِنْدَنَا وَأَفْطَرَ ثُمَّ قَامَ بِنَا اللَّيْلَةَ وَأَوْتَرَ بِنَا ثُمَّ انْحَدَرَ إِلَى مَسْجِدِهِ فَصَلَّى بِأَصْحَابِهِ حَتَّى إِذَا بَقِيَ الْوِتْرُ قَدَّمَ رَجُلًا فَقَالَ أَوْتِرْ بِأَصْحَابِكَ فَإِنِّي سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا وِتْرَانِ فِي لَيْلَةٍ",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Mulazim bin 'Amr], telah menceritakan kepada Kami [Abdullah bin Badr] dari [Qais bin Thalq], ia berkata; [Thalq bin Ali] telah mengunjungi Kami pada Bulan Ramadhan hingga sore dan berbuka bersama Kami, kemudian dia melakukan sholat sebagai Imam bagi Kami pada malam itu, dan melakukan witir, kemudian dia turun kemasjidnya dan melaksanakan sholat menjadi imam bagi sahabat-sahabatnya hingga tatkala tinggal sholat witir, ia mempersilahkan seseorang kedepan dan mengatakan kepadanya: sholat witirlah kamu sebagai imam bagi sahabat-sahabatmu, karena aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada dua witir dalam semalam!\""
            },
            {
                "number": 1199,
                "arab": "حَدَّثَنَا دَاوُدُ بْنُ أُمَيَّةَ حَدَّثَنَا مُعَاذٌ يَعْنِي ابْنَ هِشَامٍ حَدَّثَنِي أَبِي عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا أَبُو هُرَيْرَةَ قَالَوَاللَّهِ لَأُقَرِّبَنَّ لَكُمْ صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَكَانَ أَبُو هُرَيْرَةَ يَقْنُتُ فِي الرَّكْعَةِ الْآخِرَةِ مِنْ صَلَاةِ الظُّهْرِ وَصَلَاةِ الْعِشَاءِ الْآخِرَةِ وَصَلَاةِ الصُّبْحِ فَيَدْعُو لِلْمُؤْمِنِينَ وَيَلْعَنُ الْكَافِرِينَ",
                "id": "Telah menceritakan kepada Kami [Daud bin Umayyah], telah menceritakan kepada Kami [Mu'adz yaitu Ibnu Hisyam], telah menceritakan kepadaku [ayahku] dari [Yahya bin Abu Katsir] ia berkata; telah menceritakan kepadaku [Abu Salamah bin Abdurrahman], telah menceritakan kepada Kami [Abu Hurairah], ia berkata; Demi Allah aku akan mendekatkan bagi kalian sholat Rasulullah shallAllahu wa'alaihi wa sallam. Abu Salamah berkata; Abu Hurairah melakukan qunut pada raka'at terakhir pada sholat Zhuhur, sholat Isya`, dan sholat Subuh. Ia mendoakan orang-orang mukmin dan melaknat orang-orang kafir. "
            },
            {
                "number": 1200,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ وَحَفْصُ بْنُ عُمَرَ ح و حَدَّثَنَا ابْنُ مُعَاذٍ حَدَّثَنِي أَبِي قَالُوا كُلُّهُمْ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْنُتُ فِي صَلَاةِ الصُّبْحِ زَادَ ابْنُ مُعَاذٍ وَصَلَاةِ الْمَغْرِبِ",
                "id": "Telah menceritakan kepada Kami [Abu Al Walid], [Muslim bin Ibrahim], serta [Hafsh bin Umar].. dan diriwayatkan dari jalur yang lain: Telah menceritakan kepada Kami [Ibnu Mu'adz], telah menceritakan kepada Kami [ayahku], mereka semua berkata; telah menceritakan kepada Kami [Syu'bah] dari ['Amr bin Murrah] dari [Ibnu Abu Laila] dari [Al Bara`] bahwa Nabi shallallahu 'alaihi wasallam melakukan qunut ketika sholat Subuh. Ibnu Mu'adz menambahkan; serta sholat Maghrib. "
            },
            {
                "number": 1201,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الْوَلِيدُ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَقَنَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ الْعَتَمَةِ شَهْرًا يَقُولُ فِي قُنُوتِهِ اللَّهُمَّ نَجِّ الْوَلِيدَ بْنَ الْوَلِيدِ اللَّهُمَّ نَجِّ سَلَمَةَ بْنَ هِشَامٍ اللَّهُمَّ نَجِّ الْمُسْتَضْعَفِينَ مِنْ الْمُؤْمِنِينَ اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ اللَّهُمَّ اجْعَلْهَا عَلَيْهِمْ سِنِينَ كَسِنِي يُوسُفَ قَالَ أَبُو هُرَيْرَةَ وَأَصْبَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ فَلَمْ يَدْعُ لَهُمْ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ وَمَا تُرَاهُمْ قَدْ قَدِمُوا",
                "id": "Telah menceritakan kepada Kami [Abdurrahman bin Ibrahim], telah menceritakan kepada Kami [Al Walid], telah menceritakan kepada Kami [Al Auza'i], telah menceritakan kepadaku [Yahya bin Abu Katsir], telah menceritakan kepadaku [Abu Salamah bin Abdurrahman] dari [Abu Hurairah], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam melakukan qunut pada saat sholat Isya` selama satu bulan, ketika qunut beliau berdoa: \"Ya Allah, selamatkan Al Walid bin Al Walid, ya Allah, selamatkan Salamah bin Hisyam, ya Allah, selamatkan orang-orang mukmin yang lemah, ya Allah, keraskan siksaMu kepada Mudhar, ya Allah, jadikan siksaMu kepada mereka selama bertahun-tahun seperti beberapa tahun yang dialami Yusuf.\" Abu Hurairah berkata; pada suatu pagi beliau tidak mendoakan untuk mereka, kemudian aku tanyakan hal tersebut kepada beliau, kemudian beliau berkata: \"Bagaimana pendapatmu, sementara mereka telah meninggal.\""
            },
            {
                "number": 1202,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ عَنْ هِلَالِ بْنِ خَبَّابٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَنَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهْرًا مُتَتَابِعًا فِي الظُّهْرِ وَالْعَصْرِ وَالْمَغْرِبِ وَالْعِشَاءِ وَصَلَاةِ الصُّبْحِ فِي دُبُرِ كُلِّ صَلَاةٍ إِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ مِنْ الرَّكْعَةِ الْآخِرَةِ يَدْعُو عَلَى أَحْيَاءٍ مِنْ بَنِي سُلَيْمٍ عَلَى رِعْلٍ وَذَكْوَانَ وَعُصَيَّةَ وَيُؤَمِّنُ مَنْ خَلْفَهُ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Mu'awiyah Al Jumahi], telah menceritakan kepada Kami [Tsabit bin Yazid] dari dari [Hilal bin Khabbab] dari [Ikrimah] dari [Ibnu Abbas], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam melakukan qunut selama satu bulan berturut-turut ketika sholat Zhuhur, Ashar, Maghrib, Isya` dan Subuh di akhir setiap sholat, tatkala mengucapkan: \"SAMI'ALLAAHU LIMAN HAMIDAH\" pada raka'at terakhir. Beliau mendoakan atas beberapa perkampungan dari Bani Sulaim, yaitu Ri'l, Dzakwan, serta 'Ushayyah, dan orang-orang yang dibelakangnya mengamininya. "
            },
            {
                "number": 1203,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَمُسَدَّدٌ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّهُ سُئِلَ هَلْ قَنَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ الصُّبْحِ فَقَالَ نَعَمْ فَقِيلَ لَهُ قَبْلَ الرُّكُوعِ أَوْ بَعْدَ الرُّكُوعِ قَالَ بَعْدَ الرُّكُوعِ قَالَ مُسَدَّدٌ بِيَسِيرٍ",
                "id": "Telah menceritakan kepada Kami [Sulaiman bin Harb] serta [Musaddad] mereka berkata; telah menceritakan kepada Kami [Hammad] dari [Ayyub] dari [Muhammad] dari [Anas bin Malik] RhadhiyAllahu 'anhu bahwa ia ditanya; apakah Rasulullah shallAllahu wa'alaihi wa sallam melaksanakan qunut pada waktu sholat subuh? Beliau menjawab: \"Ya.\" Lalu beliau ditanya lagi; sebelum atau sesudah ruku'? Beliau menjawab; \"Setelah ruku'.\" Musaddad berkata; sebentar. "
            },
            {
                "number": 1204,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَنَسِ بْنِ سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَنَتَ شَهْرًا ثُمَّ تَرَكَهُ",
                "id": "Telah menceritakan kepada Kami [Abu Al Walid Ath Thayalisi], telah menceritakan kepada Kami [Hammad bin Salamah] dari [Anas bin Sirin] dari [Anas bin Malik] bahwa Nabi shallallahu 'alaihi wasallam melakukan qunut selama satu bulan kemudian beliau meninggalkannya. "
            },
            {
                "number": 1205,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرُ بْنُ مُفَضَّلٍ حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ قَالَحَدَّثَنِي مَنْ صَلَّى مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْغَدَاةِ فَلَمَّا رَفَعَ رَأْسَهُ مِنْ الرَّكْعَةِ الثَّانِيَةِ قَامَ هُنَيَّةً",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Bisyr bin Mufadhdhal], telah menceritakan kepada Kami [Yunus bin 'Ubaid] dari [Muhammad bin Sirin], ia berkata; telah menceritakan kepadaku [orang yang melakukan sholat Subuh bersama Nabi] shallallahu 'alaihi wasallam; kemudian tatkala beliau mengangkat kepalanya dari raka'at yang kedua beliau berdiri sesaat. "
            },
            {
                "number": 1206,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ الْبَزَّازُ حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ أَبِي النَّضْرِ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْدِ بْنِ ثَابِتٍ أَنَّهُ قَالَاحْتَجَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ حُجْرَةً فَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ مِنْ اللَّيْلِ فَيُصَلِّي فِيهَا قَالَ فَصَلَّوْا مَعَهُ لِصَلَاتِهِ يَعْنِي رِجَالًا وَكَانُوا يَأْتُونَهُ كُلَّ لَيْلَةٍ حَتَّى إِذَا كَانَ لَيْلَةٌ مِنْ اللَّيَالِي لَمْ يَخْرُجْ إِلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَنَحْنَحُوا وَرَفَعُوا أَصْوَاتَهُمْ وَحَصَبُوا بَابَهُ قَالَ فَخَرَجَ إِلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُغْضَبًا فَقَالَ يَا أَيُّهَا النَّاسُ مَا زَالَ بِكُمْ صَنِيعُكُمْ حَتَّى ظَنَنْتُ أَنْ سَتُكْتَبَ عَلَيْكُمْ فَعَلَيْكُمْ بِالصَّلَاةِ فِي بُيُوتِكُمْ فَإِنَّ خَيْرَ صَلَاةِ الْمَرْءِ فِي بَيْتِهِ إِلَّا الصَّلَاةَ الْمَكْتُوبَةَ",
                "id": "Telah menceritakan kepada Kami [Harun bin Abdullah Al Bazzar] telah menceritakan kepada Kami [Makki bin Ibrahim] telah menceritakan kepada Kami [Abdullah yaitu Ibnu Sirin bin Abu Hindun] dari [Abu An Nadhr] dari [Busr bin Sa'id] dari [Zaid bin Tsabit] bahwa ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam membuat sebuah ruangan di masjid, beliau keluar pada malam hari dan melakukan sholat padanya. Zaid berkata; kemudian orang-orang melakukan sholat bersama beliau dengan sholat beliau. Mereka datang setiap malam hingga ketika suatu malam Rasulullah shallAllahu wa'alaihi wa sallam tidak keluar kepada mereka, kemudian mereka berdehem dan mengeraskan suara mereka, dan melempar pintu beliau menggunakan kerikil. Zaid berkata; kemudian beliau keluar menemui mereka dalam keadaan marah seraya berkata: \"Wahai manusia, masih saja apa yang kalian lakukan hingga aku mengira sholat tersebut diwajibkan atas kalian, hendaknya kalian melakukan sholat di rumah kalian, sesungguhnya sebaik-baik sholat seseorang adalah dirumahnya kecuali sholat wajib.\""
            },
            {
                "number": 1207,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ أَخْبَرَنَا نَافِعٌ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْعَلُوا فِي بُيُوتِكُمْ مِنْ صَلَاتِكُمْ وَلَا تَتَّخِذُوهَا قُبُورًا",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Yahya] dari ['ubaidhullah], telah mengabarkan kepada Kami [Nafi'] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jadikanlah sebagian sholat kalian di rumah kalian, dan janganlah kalian menjadikan rumah tersebut sebagai kuburan.\""
            },
            {
                "number": 1208,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ حَدَّثَنِي عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ عَنْ عَلِيٍّ الْأَزْدِيِّ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ حُبْشِيٍّ الْخَثْعَمِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ أَيُّ الْأَعْمَالِ أَفْضَلُ قَالَ طُولُ الْقِيَامِ قِيلَ فَأَيُّ الصَّدَقَةِ أَفْضَلُ قَالَ جَهْدُ الْمُقِلِّ قِيلَ فَأَيُّ الْهِجْرَةِ أَفْضَلُ قَالَ مَنْ هَجَرَ مَا حَرَّمَ اللَّهُ عَلَيْهِ قِيلَ فَأَيُّ الْجِهَادِ أَفْضَلُ قَالَ مَنْ جَاهَدَ الْمُشْرِكِينَ بِمَالِهِ وَنَفْسِهِ قِيلَ فَأَيُّ الْقَتْلِ أَشْرَفُ قَالَ مَنْ أُهَرِيقَ دَمُهُ وَعُقِرَ جَوَادُهُ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Hanbal], telah menceritakan kepada Kami [Hajjaj], ia berkata; [Ibnu Juraij] berkata; telah menceritakan kepada Kami [Utsman bin Abu Sulaiman] dari [Ali Al Azdi] dari ['Ubaid bin 'Umair] dari [Abdullah bin Hubsyi Al Khats'ami] bahwa Nabi shallallahu 'alaihi wasallam ditanya; amalan apakah yang lebih utama? Beliau bersabda; lama berdiri. Ia ditanya; sedekah apakah yang paling utama? Ia berkata; pemberian orang miskin, ia ditanya; hijrah apakah yang paling utama? Beliau bersabda; orang yang meninggalkan apa yang Allah haramkan. Ia ditanya; jihad apakah yang paling utama? Beliau bersabda; orang yang berjihad memerangi orang-orang musyrik dengan harta dan jiwanya. Ia ditanya; terbunuh bagaimana yang paling mulia? Beliau bersabda; orang yang ditumpahkan darahnya dan kudanya disembelih."
            },
            {
                "number": 1209,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى عَنْ ابْنِ عَجْلَانَ حَدَّثَنَا الْقَعْقَاعُ بْنُ حَكِيمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَحِمَ اللَّهُ رَجُلًا قَامَ مِنْ اللَّيْلِ فَصَلَّى وَأَيْقَظَ امْرَأَتَهُ فَصَلَّتْ فَإِنْ أَبَتْ نَضَحَ فِي وَجْهِهَا الْمَاءَ رَحِمَ اللَّهُ امْرَأَةً قَامَتْ مِنْ اللَّيْلِ فَصَلَّتْ وَأَيْقَظَتْ زَوْجَهَا فَإِنْ أَبَى نَضَحَتْ فِي وَجْهِهِ الْمَاءَ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Basysyar] telah menceritakan kepada Kami [Yahya] dari [Ibnu 'Ajlan], telah menceritakan kepada Kami [Al Qa'qa' bin Hakim] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Semoga Allah merahmati orang yang bangun malam hari kemudian melakukan sholat dan membangunkan isterinya lalu iapun melakukan sholat, apabila isterinya enggan maka ia memperciki wajahnya dengan air, dan semoga Allah merahmati seorang wanita yang bangun malam hari kemudian melakukan sholat, dan membangunkan suaminya. Apabila suaminya enggan maka ia memerciki wajahnya dengan air.\""
            },
            {
                "number": 1210,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ شَيْبَانَ عَنْ الْأَعْمَشِ عَنْ عَلِيِّ بْنِ الْأَقْمَرِ عَنْ الْأَغَرِّ أَبِي مُسْلِمٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ وَأَبِي هُرَيْرَةَ قَالَاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اسْتَيْقَظَ مِنْ اللَّيْلِ وَأَيْقَظَ امْرَأَتَهُ فَصَلَّيَا رَكْعَتَيْنِ جَمِيعًا كُتِبَا مِنْ الذَّاكِرِينَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتِ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Hatim bin Bazi'], telah menceritakan kepada Kami ['ubaidhullah bin Musa] dari [Syaiban] dari [Al A'masy] dari [Ali bin Al Qamar] dari [Al Agharr Abu Muslim] dari [Abu Sa'id? Al Khudri] dan [Abu Hurairah] RhadhiyAllahu 'anhuma, mereka Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barangsiapa yang bangun malam dan membangunkan istrinya kemudian mereka berdua melaksanakan sholat dua rakaat secara bersama, maka mereka berdua akan dicatat sebagai orang yang selalu mengingat Allah Ta'ala. "
            },
            {
                "number": 1211,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَنْ عُثْمَانَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ",
                "id": "Telah menceritakan kepada Kami [Hafsh bin Umar] telah menceritakan kepada Kami [Syu'bah] dari ['Alqamah bin Martsad] dari [Sa'd bin 'Ubaidah] dari [Abu Abdurrahman] dari [Utsman] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sebaik-baik kalian adalah orang yang mempelajari Al Qur'an dan mengajarkannya.\""
            },
            {
                "number": 1212,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ عَنْ زَبَّانِ بْنِ فَائِدٍ عَنْ سَهْلِ بْنِ مُعَاذٍ الْجُهَنِيِّ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَرَأَ الْقُرْآنَ وَعَمِلَ بِمَا فِيهِ أُلْبِسَ وَالِدَاهُ تَاجًا يَوْمَ الْقِيَامَةِ ضَوْءُهُ أَحْسَنُ مِنْ ضَوْءِ الشَّمْسِ فِي بُيُوتِ الدُّنْيَا لَوْ كَانَتْ فِيكُمْ فَمَا ظَنُّكُمْ بِالَّذِي عَمِلَ بِهَذَا",
                "id": "Telah menceritakan kepada Kami [Ahmad bin 'Amr bin As Sarh] telah mengabarkan kepada Kami [Ibnu Wahb] telah mengabarkan kepada Kami [Yahya bin Ayyub] dari [Zabban bin Faid] dari [Sahl bin Muadz Al Juhani] dari [ayahnya] bahwa Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barangsiapa yang membaca AlQur'an dan melaksanakan apa yang terkandung di dalamnya, maka kedua orang tuanya pada hari kiamat nanti akan dipakaikan mahkota yang sinarnya lebih terang dari pada sinar matahari di dalam rumah-rumah didunia, jika matahari tersebut ada diantara kalian, maka bagaimana perkiraan kalian dengan orang yang melaksanakan isi Al Qur'an?\""
            },
            {
                "number": 1213,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ وَهَمَّامٌ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الَّذِي يَقْرَأُ الْقُرْآنَ وَهُوَ مَاهِرٌ بِهِ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ وَالَّذِي يَقْرَؤُهُ وَهُوَ يَشْتَدُّ عَلَيْهِ فَلَهُ أَجْرَانِ",
                "id": "Telah menceritakan kepada Kami [Muslim bin Ibrahim], telah menceritakan kepada Kami [Hisyam] dan [Hammam] dari [Qatadah] dari [Zurarah bin Aufa] dari [Sa'd bin Hisyam] dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Orang yang membaca Al Qur'an dan ia pandai membacanya maka ia bersama para malaikat yang mulia, dan orang yang membaca Al Qur'an sedangkan ia mengalami kesulitan dalam membacanya maka baginya dua pahala.\""
            },
            {
                "number": 1214,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللَّهِ تَعَالَى يَتْلُونَ كِتَابَ اللَّهِ وَيَتَدَارَسُونَهُ بَيْنَهُمْ إِلَّا نَزَلَتْ عَلَيْهِمْ السَّكِينَةُ وَغَشِيَتْهُمْ الرَّحْمَةُ وَحَفَّتْهُمْ الْمَلَائِكَةُ وَذَكَرَهُمْ اللَّهُ فِيمَنْ عِنْدَهُ",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah] telah menceritakan kepada Kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidaklah sebuah kaum berkumpul di dalam rumah diantara rumah-rumah Allah ta'ala, membaca kitab Allah, dan saling mempelajarinya diantara mereka melainkan akan turun kepada mereka ketenangan, mereka diliputi rahmat, serta dikelilingi malaikat, dan Allah menyebut-nyebut mereka diantara malaikat yang ada di sisiNya.\""
            },
            {
                "number": 1215,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنَا مُوسَى بْنُ عَلِيِّ بْنِ رَبَاحٍ عَنْ أَبِيهِ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِي الصُّفَّةِ فَقَالَ أَيُّكُمْ يُحِبُّ أَنْ يَغْدُوَ إِلَى بُطْحَانَ أَوْ الْعَقِيقِ فَيَأْخُذَ نَاقَتَيْنِ كَوْمَاوَيْنِ زَهْرَاوَيْنِ بِغَيْرِ إِثْمٍ بِاللَّهِ عَزَّ وَجَلَّ وَلَا قَطْعِ رَحِمٍ قَالُوا كُلُّنَا يَا رَسُولَ اللَّهِ قَالَ فَلَأَنْ يَغْدُوَ أَحَدُكُمْ كُلَّ يَوْمٍ إِلَى الْمَسْجِدِ فَيَتَعَلَّمَ آيَتَيْنِ مِنْ كِتَابِ اللَّهِ عَزَّ وَجَلَّ خَيْرٌ لَهُ مِنْ نَاقَتَيْنِ وَإِنْ ثَلَاثٌ فَثَلَاثٌ مِثْلُ أَعْدَادِهِنَّ مِنْ الْإِبِلِ",
                "id": "Telah menceritakan kepada Kami [Sulaiman bin Daud Al Mahri], telah menceritakan kepada Kami [Ibnu Wahb], telah menceritakan kepada Kami [Musa bin Ali bin Rabah] dari [Ayahnya] dari ['Uqbah bin 'Amir Al Juhani], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam keluar menemui Kami sementara Kami berada di Shuffah, kemudian beliau bertanya: \"Siapakah diantara kalian ingin pergi ke Bathhan atau 'Aqiq, kemudian mengambil dua ekor unta gemuk dan putih tanpa berbuat dosa kepada Allah 'azza wajalla, dan tidak memutuskan hubungan kekerabatan?\" Mereka mengatakan; Kami semua wahai Rasul! Beliau bersabda: \"Sungguh salah seorang diantara kalian setiap hari datang ke Masjid, mempelajari dua ayat dari Kitab Allah 'azza wajalla adalah lebih baik baginya daripada dua ekor unta, dua ayat lebih baik daripada tiga unta, seperti bilangan-bilangan unta tersebut.\""
            },
            {
                "number": 1216,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ أُمُّ الْقُرْآنِ وَأُمُّ الْكِتَابِ وَالسَّبْعُ الْمَثَانِي",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Abu Syu'aib Al Harani], telah menceritakan kepada Kami [Isa bin Yunus], telah menceritakan kepada Kami [Ibnu Abu Dzi`b] dari [Al Maburi] dari [Abu Hurairah], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Al Hamdulillaahi rabbil 'aalamiin (Surat Al Faatihah) adalah Ummul Kitab, serta As Sab'ul matsani.\""
            },
            {
                "number": 1217,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا خَالِدٌ حَدَّثَنَا شُعْبَةُ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ سَمِعْتُ حَفْصَ بْنَ عَاصِمٍ يُحَدِّثُ عَنْ أَبِي سَعِيدِ بْنِ الْمُعَلَّىأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ وَهُوَ يُصَلِّي فَدَعَاهُ قَالَ فَصَلَّيْتُ ثُمَّ أَتَيْتُهُ قَالَ فَقَالَ مَا مَنَعَكَ أَنْ تُجِيبَنِي قَالَ كُنْتُ أُصَلِّي قَالَ أَلَمْ يَقُلْ اللَّهُ عَزَّ وَجَلَّ{ يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ لِمَا يُحْيِيكُمْ }لَأُعَلِّمَنَّكَ أَعْظَمَ سُورَةٍ مِنْ الْقُرْآنِ أَوْ فِي الْقُرْآنِ شَكَّ خَالِدٌ قَبْلَ أَنْ أَخْرُجَ مِنْ الْمَسْجِدِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ قَوْلُكَ قَالَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ هِيَ السَّبْعُ الْمَثَانِي الَّتِي أُوتِيتُ وَالْقُرْآنُ الْعَظِيمُ",
                "id": "Telah menceritakan kepada Kami ['ubaidhullah bin Mu'adz], telah menceritakan kepada Kami [Khalid], telah menceritakan kepada Kami [Syu'bah] dari [Khubaib bin Abdurrahman] ia berkata; saya mendengar [Hafsh bin 'Ashim] menceritakan dari [Abu Sa'id bin Al Ma'alli] bahwa Nabi shallallahu 'alaihi wasallam melewatinya sementara ia sedang melakukan sholat, kemudian beliau memanggilnya. Ia berkata; aku melakukan sholat kemudian datang kepada beliau. Ia berkata; kemudian beliau berkata: \"Apakah yang menghalangimu untuk menjawabku?\" Ia berkata; saya sedang melakukan sholat. Beliau berkata; bukankah Allah 'azza wajalla berfirman: \"Hai orang-orang yang beriman, penuhilah seruan Allah dan seruan Rasul apabila Rasul menyeru kamu kepada suatu yang memberi kehidupan kepada kamu?\" Aku akan mengajarkan kepadamu surat Al Qur'an dalam Al Qur'an yang terbesar -Khalid merasa ragu- sebelum aku keluar dari Masjid?\" Ia berkata; aku katakan; wahai Rasulullah, aku akan mendengar ucapanmu. Beliau bersabda: \"Al Hamdulillahi rabbil 'aalamiin (Surat Al Fatihah), surat tersebut adalah As Sab'ul Matsaani (tujuh ayat yang dibaca berulang-ulang) yang telah diberikan kepadaku, dan Al Qur'an Al Azhiim (Al Qur'an yang agung).\""
            },
            {
                "number": 1218,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ مُسْلِمٍ الْبَطِينِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَأُوتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبْعًا مِنْ الْمَثَانِي الطُّوَلِ وَأُوتِيَ مُوسَى عَلَيْهِ السَّلَام سِتًّا فَلَمَّا أَلْقَى الْأَلْوَاحَ رُفِعَتْ ثِنْتَانِ وَبَقِيَ أَرْبَعٌ",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Jarir] dari [Al A'masy] dari [Muslim Al Bathin] dari [Sa'id? bin Jubair] dari [Ibnu Abbas], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam telah diberikan tujuh ayat yang dibaca berulang-ulang yang panjang, sedangkan Musa telah diberikan enam, namun ketika dia membuang lembaran-lembaran taurat maka yang dua diangkat dan tersisa empat. "
            },
            {
                "number": 1219,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدُ بْنُ إِيَاسٍ عَنْ أَبِي السَّلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ الْأَنْصَارِيِّ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَا الْمُنْذِرِ أَيُّ آيَةٍ مَعَكَ مِنْ كِتَابِ اللَّهِ أَعْظَمُ قَالَ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ أَبَا الْمُنْذِرِ أَيُّ آيَةٍ مَعَكَ مِنْ كِتَابِ اللَّهِ أَعْظَمُ قَالَ قُلْتُ{ اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ }قَالَ فَضَرَبَ فِي صَدْرِي وَقَالَ لِيَهْنَ لَكَ يَا أَبَا الْمُنْذِرِ الْعِلْمُ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Al Mutsanna], telah menceritakan kepada Kami [Abdul A'la] telah menceritakan kepada Kami [Sa'id? bin Iyas] dari [Abu As Salil] dari [Abdullah bin Rabah Al Anshari] dari [Ubai bin Ka'b], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam: \"Wahai Abu Al Mundzir, ayat apakah dari Kitab Allah paling besar menurutmu?\" Saya katakan; Allah dan RasulNya yang lebih mengetahui. Beliau bertanya lagi: \"Wahai Abul Mundzir ayat manakah yang kamu hafal dari Kitab Allah yang lebih besar menurutmu?\" Aku menjawab; ALLAAHU LAA ILAAHA ILLAA HUWAL HAYYUL QAYYUUM\" (ayat Kursi). Kemudian Rasulullah shallAllahu wa'alaihi wa sallam menepuk dadaku dan berkata: \"Wahai Abu Al Mundzir, sungguh engkau adalah orang yang berilmu. "
            },
            {
                "number": 1220,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَجُلًا سَمِعَ رَجُلًا يَقْرَأُ قُلْ هُوَ اللَّهُ أَحَدٌ يُرَدِّدُهَا فَلَمَّا أَصْبَحَ جَاءَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ لَهُ وَكَأَنَّ الرَّجُلَ يَتَقَالُّهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهَا لَتَعْدِلُ ثُلُثَ الْقُرْآنِ",
                "id": "Telah menceritakan kepada Kami [Al Qa'nabi] dari [Malik] dari [Abdurrahman bin Abdullah bin Abdurrahman] dari [Ayahnya] dari [Abu Sa'id Al Khudri] bahwa seorang laki-laki mendengar orang lain membaca; QUL HUWALLAAHU AHAD, ia mengulang-ulangnya. Kemudian tatkala pagi hari ia datang kepada Rasulullah shallAllahu wa'alaihi wa sallam dan menyebutkannya kepada beliau, seolah-olah orang tersebut menganggapnya sedikit. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku ada di tangannya, sesungguhnya ayat tersebut sama dengan sepertiga Al Qur'an.\""
            },
            {
                "number": 1221,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مُعَاوِيَةُ عَنْ الْعَلَاءِ بْنِ الْحَارِثِ عَنْ الْقَاسِمِ مَوْلَى مُعَاوِيَةَ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَكُنْتُ أَقُودُ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاقَتَهُ فِي السَّفَرِ فَقَالَ لِي يَا عُقْبَةُ أَلَا أُعَلِّمُكَ خَيْرَ سُورَتَيْنِ قُرِئَتَا فَعَلَّمَنِي قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ وَقُلْ أَعُوذُ بِرَبِّ النَّاسِ قَالَ فَلَمْ يَرَنِي سُرِرْتُ بِهِمَا جِدًّا فَلَمَّا نَزَلَ لِصَلَاةِ الصُّبْحِ صَلَّى بِهِمَا صَلَاةَ الصُّبْحِ لِلنَّاسِ فَلَمَّا فَرَغَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الصَّلَاةِ الْتَفَتَ إِلَيَّ فَقَالَ يَا عُقْبَةُ كَيْفَ رَأَيْتَ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin 'Amr bin As Sarh], telah memberitakan kepada Kami [Ibnu Wahb], telah memberitakan kepadaku [Mu'awiyah] dari [Al 'Ala`bin Al Harits] dari [Al Qasim] mantan budak Mu'awiyah dari ['Uqbah bin 'Amir], ia berkata; aku menuntun unta Rasulullah shallAllahu wa'alaihi wa sallam yang beliau tunggangi dalam suatu perjalanan. Kemudian beliau berkata: \"Wahai 'Uqbah, maukah aku ajarkan kepadamu dua surat terbaik yang dibaca?\" Kemudian beliau mengajarkan kepadaku QUL A'UUDZU BIRABBIL FALAQ, dan QUL A'UUDZU BIRABBINNAAS. Kemudian tatkala Rasulullah shallAllahu wa'alaihi wa sallam selesai dari sholat beliau menoleh kepadaku dan berkata: \"Wahai 'Uqbah, bagaimana pendapatmu?\""
            },
            {
                "number": 1222,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَبَيْنَا أَنَا أَسِيرُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ الْجُحْفَةِ وَالْأَبْوَاءِ إِذْ غَشِيَتْنَا رِيحٌ وَظُلْمَةٌ شَدِيدَةٌ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ بِأَعُوذُ بِرَبِّ الْفَلَقِ وَأَعُوذُ بِرَبِّ النَّاسِ وَيَقُولُ يَا عُقْبَةُ تَعَوَّذْ بِهِمَا فَمَا تَعَوَّذَ مُتَعَوِّذٌ بِمِثْلِهِمَا قَالَ وَسَمِعْتُهُ يَؤُمُّنَا بِهِمَا فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada Kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Sa'id? bin Abu Sa'id Al Maqburi] dari [ayahnya] dari ['Uqbah bin Amir], ia berkata; ketika aku sedang berjalan bersama Rasulullah shallAllahu wa'alaihi wa sallam antara Juhfah dan Abwa`, tiba-tiba Kami tertutupi angin sangat dan terjadi kegelapan yang sangat, kemudian Rasulullah shallAllahu wa'alaihi wa sallam berlindung dengan mengucapkan: \"QUL A'UUDZU BIRABBIL FALAQ, \" dan \"QUL A'UUDZU BIRABBINNAAS\". Dan beliau berkata: \"Wahai Uqbah, berlindunglah dengan keduanya, tidak ada orang yang berlindung dengan sebuah perlindungan yang menyamai keduanya.\" 'Uqbah berkata; aku mendengar beliau mengimami Kami dengan membaca kedua surat tersebut dalam sholat. "
            },
            {
                "number": 1223,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ حَدَّثَنِي عَاصِمُ بْنُ بَهْدَلَةَ عَنْ زِرٍّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَالُ لِصَاحِبِ الْقُرْآنِ اقْرَأْ وَارْتَقِ وَرَتِّلْ كَمَا كُنْتَ تُرَتِّلُ فِي الدُّنْيَا فَإِنَّ مَنْزِلَكَ عِنْدَ آخِرِ آيَةٍ تَقْرَؤُهَا",
                "id": "Telah menceritakan kepada Kami [Musaddad] telah menceritakan kepada Kami [Yahya] dari [Sufyan], telah menceritakan kepadaku ['Ashim bin Bahdalah] dari [Zirr] dari [Abdullah bin 'Amr], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Dikatakan kepada orang yang membaca Al Qur'an: \"Bacalah, dan naiklah, serta bacalah dengan tartil (jangan terburu-buru), sebagaimana engkau membaca dengan tartil di dunia, sesungguhnya tempatmu adalah pada akhir ayat yang engkau baca.\""
            },
            {
                "number": 1224,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا جَرِيرٌ عَنْ قَتَادَةَ قَالَسَأَلْتُ أَنَسًا عَنْ قِرَاءَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ كَانَ يَمُدُّ مَدًّا",
                "id": "Telah menceritakan kepada Kami [Muslim bin Ibrahim], telah menceritakan kepada Kami [Jarir] dari [Qatadah], ia berkata; saya bertanya kepada [Anas] mengenai bacaan Nabi shallallahu 'alaihi wasallam, kemudian ia berkata; beliau benar-benar memanjangkannya. "
            },
            {
                "number": 1225,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ الرَّمْلِيُّ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ يَعْلَى بْنِ مَمْلَكٍأَنَّهُ سَأَلَ أُمَّ سَلَمَةَ عَنْ قِرَاءَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصَلَاتِهِ فَقَالَتْ وَمَا لَكُمْ وَصَلَاتَهُ كَانَ يُصَلِّي وَيَنَامُ قَدْرَ مَا صَلَّى ثُمَّ يُصَلِّي قَدْرَ مَا نَامَ ثُمَّ يَنَامُ قَدْرَ مَا صَلَّى حَتَّى يُصْبِحَ وَنَعَتَتْ قِرَاءَتَهُ فَإِذَا هِيَ تَنْعَتُ قِرَاءَتَهُ حَرْفًا حَرْفًا",
                "id": "Telah menceritakan kepada Kami [Yazid bin Khalid bin Mauhib Ar Ramli], telah menceritakan kepada Kami [Al Laits] dari [Ibnu Abu Mulaikah] dari [Ya'la bin Mamlak] bahwa ia bertanya kepada [Ummu Salamah] mengenai bacaan Rasulullah shallAllahu wa'alaihi wa sallam serta sholat beliau. Kemudian ia berkata; ada apa dengan kalian dan sholatnya, beliau melakukan sholat dan tidur seukuran lamanya sholat beliau, kemudian beliau melakukan sholat seukuran lamanya tidur beliau, kemudian beliau tidur seukuran lama beliau melakukan sholat hingga pagi hari. Kemudian Ummu Salamah menggambarkan bacaan Nabi Shalla Allahu 'alaihi wa sallam dan ia menggambarkan bacaannya sehuruf-sehuruf. "
            },
            {
                "number": 1226,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فَتْحِ مَكَّةَ وَهُوَ عَلَى نَاقَةٍ يَقْرَأُ بِسُورَةِ الْفَتْحِ وَهُوَ يُرَجِّعُ",
                "id": "Telah menceritakan kepada Kami [Hafsh bin Umar], telah menceritakan kepada Kami [Syu'bah] dari [Mu'awiyah bin Qurrah] dari [Abdullah bin Mughaffal], ia berkata; saya melihat Rasulullah shallAllahu wa'alaihi wa sallam pada saat penaklukan Mekkah berada di atas unta membaca surat Al Fath, dan beliau mengulang-ulangnya. "
            },
            {
                "number": 1227,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ طَلْحَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْسَجَةَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيِّنُوا الْقُرْآنَ بِأَصْوَاتِكُمْ",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Jarir] dari [Al A'masy] dari [Thalhah] dari [Abdurrahman bin 'Ausajah] dari [Al Bara` bin 'Azib] ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Perindahlah Al Qur'an dengan suara kalian.\""
            },
            {
                "number": 1228,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَيَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ الرَّمْلِيُّ بِمَعْنَاهُ أَنَّ اللَّيْثَ حَدَّثَهُمْ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي نَهِيكٍ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ وَقَالَ يَزِيدُ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ وَقَالَ قُتَيْبَةُ هُوَ فِي كِتَابِي عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ مِنَّا مَنْ لَمْ يَتَغَنَّ بِالْقُرْآنِحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي نَهِيكٍ عَنْ سَعْدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada Kami [Abu Al Walid Ath Thayalisi], serta [Qutaibah bin Sa'id] serta [Yazid bin Khalid bin Mauhib Ar Ramli] secara makna bahwa [Al Laits] telah menceritakan kepada mereka dari [Abdullah bin Abu Mulaikah] dari [Abdullah bin Abu Nuhaik] dari [Sa'd bin Abu Waqqash]. [Yazid] berkata dari [Ibnu Mulaikah] dari [Sa'id? bin Abu Sa'id], Qutaibah berkata; dalam catatanku adalah dari Sa'id? bin Abu Sa'id, ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Bukan dari golongan Kami orang yang tidak memperindah bacaan Al Qur'an.\" Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Sufyan bin 'Uyainah] dari ['Amr] dari [Ibnu Abu Mulaikah] dari ['ubaidhullah bin Abu Nuhaik] dari [Sa'd], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam berkata seperti itu. "
            },
            {
                "number": 1229,
                "arab": "حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ حَمَّادٍ حَدَّثَنَا عَبْدُ الْجَبَّارِ بْنُ الْوَرْدِ قَالَ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ يَقُولُ قَالَ عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَمَرَّ بِنَا أَبُو لُبَابَةَ فَاتَّبَعْنَاهُ حَتَّى دَخَلَ بَيْتَهُ فَدَخَلْنَا عَلَيْهِ فَإِذَا رَجُلٌ رَثُّ الْبَيْتِ رَثُّ الْهَيْئَةِ فَسَمِعْتُهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَيْسَ مِنَّا مَنْ لَمْ يَتَغَنَّ بِالْقُرْآنِقَالَ فَقُلْتُ لِابْنِ أَبِي مُلَيْكَةَ يَا أَبَا مُحَمَّدٍ أَرَأَيْتَ إِذَا لَمْ يَكُنْ حَسَنَ الصَّوْتِ قَالَ يُحَسِّنُهُ مَا اسْتَطَاعَ حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ قَالَ قَالَ وَكِيعٌ وَابْنُ عُيَيْنَةَ يَعْنِي يَسْتَغْنِي بِهِ",
                "id": "Telah menceritakan kepada Kami [Abdul A'la bin Hammad], telah menceritakan [Abdul Jabbar bin Al Ward], ia berkata; saya mendengar [Ibnu Abu Mulaikah] berkata; [ubaidhullah bin Abu Yazid] berkata; [Abu Lubabah] lewat didepan Kami, lalu Kami mengikutinya hingga dia masuk ke rumahnya dan Kamipun masuk menemuinya, ternyata ia adalah seorang laki-laki perabotan rumahnya sedikit dan kondisinya memburuk, kemudian aku mendengar dia berkata; aku mendengar Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Bukan dari golongan Kami orang yang tidak memperindah bacaan Al Qur'an.\" Abdul Jabbar berkata; aku bertanya kepada Ibnu Abu Malikah; wahai Abu Muhammad, bagaimana pendapatmu apabila ia tidak bagus suaranya? Ia menjawab; ia perindah suaranya semampunya. Telah menceritakan kepada kami Muhammad bin Sulaiman Al Anbari, ia berkata; Waki' dan Ibnu 'Uyainah berkata; yaitu ia menyibukkan dengan Al Qur'an. "
            },
            {
                "number": 1230,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي عُمَرُ بْنُ مَالِكٍ وَحَيْوَةُ عَنْ ابْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا أَذِنَ اللَّهُ لِشَيْءٍ مَا أَذِنَ لِنَبِيٍّ حَسَنِ الصَّوْتِ يَتَغَنَّى بِالْقُرْآنِ يَجْهَرُ بِهِ",
                "id": "Telah menceritakan kepada Kami [Sulaiman bin Daud Al Mahri], telah mengabarkan kepada Kami [Ibnu Wahb], telah menceritakan kepadaku [Umar bin Malik] serta [Haiwah] dari [Ibnu Al Had] dari [Muhammad bin Ibrahim bin Al Harits] dari [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Tidaklah Allah memberikan izin untuk melakukan sesuatu sebagaimana Allah memberikan izin kepada seorang nabi yang indah suaranya memperindah bacaan Al Qur'an, dan mengeraskannya.\""
            },
            {
                "number": 1231,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَخْبَرَنَا ابْنُ إِدْرِيسَ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عِيسَى بْنِ فَائِدٍ عَنْ سَعْدِ بْنِ عُبَادَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ امْرِئٍ يَقْرَأُ الْقُرْآنَ ثُمَّ يَنْسَاهُ إِلَّا لَقِيَ اللَّهَ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ أَجْذَمَ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Al 'Ala`], telah mengabarkan kepada Kami [Ibnu Idris] dari [Yazid bin Abu Ziyad] dari [Isa bin Faid] dari [Sa'd bin 'Ubadah] ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Tidaklah seseorang membaca Al Qur'an kemudian ia melupakannya melainkan ia bertemu Allah 'azza wajalla pada hari Kiamat dalam keadaan mulutnya ompong.\""
            },
            {
                "number": 1232,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ الْقَارِيِّ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُسَمِعْتُ هِشَامَ بْنَ حَكِيمِ بْنِ حِزَامٍ يَقْرَأُ سُورَةَ الْفُرْقَانِ عَلَى غَيْرِ مَا أَقْرَؤُهَا وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْرَأَنِيهَا فَكِدْتُ أَنْ أَعْجَلَ عَلَيْهِ ثُمَّ أَمْهَلْتُهُ حَتَّى انْصَرَفَ ثُمَّ لَبَّبْتُهُ بِرِدَائِهِ فَجِئْتُ بِهِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي سَمِعْتُ هَذَا يَقْرَأُ سُورَةَ الْفُرْقَانِ عَلَى غَيْرِ مَا أَقْرَأْتَنِيهَا فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَأْ فَقَرَأَ الْقِرَاءَةَ الَّتِي سَمِعْتُهُ يَقْرَأُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَكَذَا أُنْزِلَتْ ثُمَّ قَالَ لِيَ اقْرَأْ فَقَرَأْتُ فَقَالَ هَكَذَا أُنْزِلَتْ ثُمَّ قَالَ إِنَّ هَذَا الْقُرْآنَ أُنْزِلَ عَلَى سَبْعَةِ أَحْرُفٍ فَاقْرَءُوا مَا تَيَسَّرَ مِنْهُحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ قَالَ قَالَ الزُّهْرِيُّ إِنَّمَا هَذِهِ الْأَحْرُفُ فِي الْأَمْرِ الْوَاحِدِ لَيْسَ تَخْتَلِفُ فِي حَلَالٍ وَلَا حَرَامٍ",
                "id": "Telah menceritakan kepada Kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari ['Urwah bin Az Zubair] dari [Abdurrahman bin Abdul Qari], ia berkata; saya mendengar [Umar bin Al Khathab] berkata; aku mendengar Hisyam bin Hakim bin Hizam membaca Surat Al Furqan tidak seperti yang aku baca, dan Rasulullah telah membacakannya kepadaku, maka hampir aku tergesa-gesa untuk bertindak terhadapnya, kemudian aku mengurungkannya hingga ia pergi. Kemudian aku menarik selendangnya dan membawanya kepada Rasulullah shallallahu 'alaihi wasallam. Aku katakan; wahai Rasul, sesungguhnya aku telah mendengar orang ini membaca Surat Al Furqan tidak seperti yang telah engkau bacakan kepadaku. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata kepadanya: \"Bacalah, kemudian ia membaca bacaan yang telah aku dengar. kemudian Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Demikianlah Surat tersebut diturunkan.\" Kemudian beliau berkata kepadaku: \"Bacalah.\" Lalu aku membacanya. Kemudian beliau berkata: \"Demikianlah surat tersebut diturunkan.\" Kemudian beliau bersabda: \"Sesungguhnya Al Qur'an ini diturunkan dengan tujuh gaya bahasa, maka bacalah apa yang mudah darinya.\" Telah menceritakan kepada Kami Muhammad bin Yahya bin Faris, telah menceritakan kepada Kami Abdurrazzaq, telah mengabarkan kepada Kami Ma'mar, ia berkata; Az Zuhri berkata; sesungguhnya gaya bahasa ini dalam satu perkara dan tidak berbeda-beda dalam hal halal dan haram. "
            },
            {
                "number": 1233,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى عَنْ قَتَادَةَ عَنْ يَحْيَى بْنِ يَعْمَرَ عَنْ سُلَيْمَانَ بْنِ صُرَدٍ الْخُزَاعِيِّ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أُبَيُّ إِنِّي أُقْرِئْتُ الْقُرْآنَ فَقِيلَ لِي عَلَى حَرْفٍ أَوْ حَرْفَيْنِ فَقَالَ الْمَلَكُ الَّذِي مَعِي قُلْ عَلَى حَرْفَيْنِ قُلْتُ عَلَى حَرْفَيْنِ فَقِيلَ لِي عَلَى حَرْفَيْنِ أَوْ ثَلَاثَةٍ فَقَالَ الْمَلَكُ الَّذِي مَعِي قُلْ عَلَى ثَلَاثَةٍ قُلْتُ عَلَى ثَلَاثَةٍ حَتَّى بَلَغَ سَبْعَةَ أَحْرُفٍ ثُمَّ قَالَ لَيْسَ مِنْهَا إِلَّا شَافٍ كَافٍ إِنْ قُلْتَ سَمِيعًا عَلِيمًا عَزِيزًا حَكِيمًا مَا لَمْ تَخْتِمْ آيَةَ عَذَابٍ بِرَحْمَةٍ أَوْ آيَةَ رَحْمَةٍ بِعَذَابٍ",
                "id": "Telah menceritakan kepada Kami [Abu Al Walid Ath Thayalisi], telah menceritakan kepada Kami [Hammam bin Yahya] dari [Qatadah] dari [Yahya bin Ya'mar] dari [Sulaiman bin Shurad Al Khuza'i] dari [Ubai bin Ka'b], ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai Ubai, sesungguhnya telah dibacakan Al Qur'an kepadaku, dan aku ditanya; dengan satu gaya bahasa atau dua gaya bahasa? Kemudian malaikat yang bersamaku berkata; katakan; dengan dua gaya bahasa! Maka aku katakan; dengan dua gaya bahasa. Kemudian aku ditanya; dengan dua gaya bahasa atau tiga gaya bahasa? Kemudian malaikat yang bersamaku berkata; katakan; dengan tiga gaya bahasa! Maka aku katakan; dengan tiga gaya bahasa. Hingga sampai tujuh gaya bahasa.\" Kemudian beliau berkata: \"Tidak ada diantara gaya bahasa tersebut kecuali merupakan sesuatu yang memuaskan dan cukup. Apabila engkau membaca; SAMII'AN 'ALIIMAN, 'AZIIZAN HAKIIMAN selama engkau tidak menutup ayat yang berbicara mengenai adzab dengan rahmat atau ayat yang berbicara mengenai rahmat dengan adzab.\""
            },
            {
                "number": 1234,
                "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ مُجَاهِدٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ أُبَيِّ بْنِ كَعْبٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ عِنْدَ أَضَاةِ بَنِي غِفَارٍ فَأَتَاهُ جِبْرِيلُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَأْمُرُكَ أَنْ تُقْرِئَ أُمَّتَكَ عَلَى حَرْفٍ قَالَ أَسْأَلُ اللَّهَ مُعَافَاتَهُ وَمَغْفِرَتَهُ إِنَّ أُمَّتِي لَا تُطِيقُ ذَلِكَ ثُمَّ أَتَاهُ ثَانِيَةً فَذَكَرَ نَحْوَ هَذَا حَتَّى بَلَغَ سَبْعَةَ أَحْرُفٍ قَالَ إِنَّ اللَّهَ يَأْمُرُكَ أَنْ تُقْرِئَ أُمَّتَكَ عَلَى سَبْعَةِ أَحْرُفٍ فَأَيُّمَا حَرْفٍ قَرَءُوا عَلَيْهِ فَقَدْ أَصَابُوا",
                "id": "Telah menceritakan kepada Kami [Ibnu Al Mutsanna], telah menceritakan kepada Kami [Muhammad bin Ja'far], telah menceritakan kepada Kami [Syu'bah] dari [Al Hakam] dari [Mujahid] dari [Ibnu Abu Laila] dari [Ubai bin Ka'b] bahwa Nabi shallallahu 'alaihi wasallam berada di air rawa Bani Ghifar, kemudian Jibril shallallahu 'alaihi wasallam datang kepadanya, dan berkata; sesungguhnya Allah 'azza wajalla memerintahkanmu untuk membacakan Al Qur'an kepada umatmu dengan satu gaya bahasa. Beliau berkata: \"Aku meminta maaf dan Ampunan kepada Allah. Sesungguhnya umatku tidak akan mampu melakukan hal tersebut.\" Kemudian ia datang kepada beliau kedua kalinya dan menyebutkan seperti ini hingga sampai tujuh gaya bahasa. Ia berkata; sesungguhnya Allah memerintahkamu agar membacakan Al Qur'an kepada umatmu dengan tujuh gaya bahasa. Gaya bahasa yang mana saja yang mereka baca maka mereka telah benar. "
            },
            {
                "number": 1235,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ عَنْ زِيَادِ بْنِ مِخْرَاقٍ عَنْ أَبِي نَعَامَةَ عَنْ ابْنٍ لِسَعْدٍ أَنَّهُ قَالَسَمِعَنِي أَبِي وَأَنَا أَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَنَعِيمَهَا وَبَهْجَتَهَا وَكَذَا وَكَذَا وَأَعُوذُ بِكَ مِنْ النَّارِ وَسَلَاسِلِهَا وَأَغْلَالِهَا وَكَذَا وَكَذَا فَقَالَ يَا بُنَيَّ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ سَيَكُونُ قَوْمٌ يَعْتَدُونَ فِي الدُّعَاءِ فَإِيَّاكَ أَنْ تَكُونَ مِنْهُمْ إِنَّكَ إِنْ أُعْطِيتَ الْجَنَّةَ أُعْطِيتَهَا وَمَا فِيهَا مِنْ الْخَيْرِ وَإِنْ أُعِذْتَ مِنْ النَّارِ أُعِذْتَ مِنْهَا وَمَا فِيهَا مِنْ الشَّرِّ",
                "id": "Telah menceritakan kepadaku [Musaddad], telah menceritakan kepada Kami [Yahya] dari [Syu'bah] dari [Ziyad bin Mikhraq] dari [Abu Na'amah] dari [anak Sa'd] bahwa ia berkata; [ayahku] mendengarku berkata; ya Allah, aku memohon kepadaMu Surga dan kenikmatannya, keindahannya dan demikian dan demikian…. dan aku berlindung kepadaMu dari Neraka, rantai serta belenggu-belenggunya, dan demikian dan demikian.. Kemudian ia berkata; wahai anakku, sesungguhnya aku mendengar Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Akan ada sebuah kaum berlebihan dalam berdoa.\" Maka hati-hatilah engkau menjadi bagian dari mereka, sesungguhnya apabila engkau diberi Surga maka engkau telah diberi kebaikan yang ada padanya, dan apabila engkau dilindungi dari Neraka maka engkau telah dilindungi darinya dan dari keburukan yang ada padanya. "
            },
            {
                "number": 1236,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا حَيْوَةُ أَخْبَرَنِي أَبُو هَانِئٍ حُمَيْدُ بْنُ هَانِئٍ أَنَّ أَبَا عَلِيٍّ عَمْرَو بْنَ مَالِكٍ حَدَّثَهُ أَنَّهُ سَمِعَ فَضَالَةَ بْنَ عُبَيْدٍ صَاحِبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُسَمِعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يَدْعُو فِي صَلَاتِهِ لَمْ يُمَجِّدْ اللَّهَ تَعَالَى وَلَمْ يُصَلِّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَجِلَ هَذَا ثُمَّ دَعَاهُ فَقَالَ لَهُ أَوْ لِغَيْرِهِ إِذَا صَلَّى أَحَدُكُمْ فَلْيَبْدَأْ بِتَمْجِيدِ رَبِّهِ جَلَّ وَعَزَّ وَالثَّنَاءِ عَلَيْهِ ثُمَّ يُصَلِّي عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ يَدْعُو بَعْدُ بِمَا شَاءَ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Hanbal], telah menceritakan kepada Kami [Abdullah bin Yazid], telah menceritakan kepada Kami [Haiwah], telah mengabarkan kepadaku [Abu Hani` Humaid bin Hani`] bahwa [Abu Ali 'Amr bin Malik] telah menceritakan kepadanya bahwa ia mendengar [Fadhalah bin 'Ubaid] seorang sahabat Rasulullah shallallahu 'alaihi wasallam berkata; Rasulullah shallAllahu wa'alaihi wa sallam mendengar seorang laki-laki berdoa dalam sholatnya dan tidak mengagungkan Allah ta'ala serta tidak bershalawat kepada Nabi shallallahu 'alaihi wasallam, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang ini telah terburu-buru.\" Kemudian beliau memanggilnya dan berkata kepadanya atau kepada orang lain: \"Apabila salah seorang diantara kalian melakukan sholat maka hendaknya memulai dengan mengagungkan Tuhannya yang Maha Agung dan Perkasa, serta dengan memuji kepadaNya, kemudian bershalawat kepada Nabi shallallahu 'alaihi wasallam kemudian berdoa setelah itu dengan apa yang ia kehendaki.\""
            },
            {
                "number": 1237,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَقُولَنَّ أَحَدُكُمْ اللَّهُمَّ اغْفِرْ لِي إِنْ شِئْتَ اللَّهُمَّ ارْحَمْنِي إِنْ شِئْتَ لِيَعْزِمْ الْمَسْأَلَةَ فَإِنَّهُ لَا مُكْرِهَ لَهُ",
                "id": "Telah menceritakan kepada Kami [Al Qa'nabi] dari [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Janganlah salah seorang diantara kalian mengucapkan; ya Allah, ampunilah aku jika Engkau menghendaki, rahmatilah aku jika Engkau menghendaki. Hendaknya ia membulatkan permohonan karena sesungguhnya tidak ada yang memaksa Allah.\""
            },
            {
                "number": 1238,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي عُبَيْدٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُسْتَجَابُ لِأَحَدِكُمْ مَا لَمْ يَعْجَلْ فَيَقُولُ قَدْ دَعَوْتُ فَلَمْ يُسْتَجَبْ لِي",
                "id": "Telah menceritakan kepada Kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Abu 'Ubaid] dari [Abu Hurairah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Diperkenankan bagi salah seorang diantara kalian selama ia tidak terburu-buru, ia mengatakan; aku telah berdoa namun belum dikabulkan.\""
            },
            {
                "number": 1239,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ مُحَمَّدِ بْنِ أَيْمَنَ عَنْ عَبْدِ اللَّهِ بْنِ يَعْقُوبَ بْنِ إِسْحَقَ عَمَّنْ حَدَّثَهُ عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَسْتُرُوا الْجُدُرَ مَنْ نَظَرَ فِي كِتَابِ أَخِيهِ بِغَيْرِ إِذْنِهِ فَإِنَّمَا يَنْظُرُ فِي النَّارِ سَلُوا اللَّهَ بِبُطُونِ أَكُفِّكُمْ وَلَا تَسْأَلُوهُ بِظُهُورِهَا فَإِذَا فَرَغْتُمْ فَامْسَحُوا بِهَا وُجُوهَكُمْقَالَ أَبُو دَاوُد رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ عَنْ مُحَمَّدِ بْنِ كَعْبٍ كُلُّهَا وَاهِيَةٌ وَهَذَا الطَّرِيقُ أَمْثَلُهَا وَهُوَ ضَعِيفٌ أَيْضًا",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah], telah menceritakan kepada Kami [Abdul Malik bin Muhammad bin Aiman] dari [Abdullah bin Ya'qub bin Ishaq] dari [orang yang telah bercerita kepadanya] dari [Muhammad bin Ka'b Al Qurazhi], telah menceritakan kepadaku [Abdullah bin Abbas] bahwa Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Janganlah kalian menutupi tembok-tembok dengan kain kalian, barang siapa yang melihat tulisan saudaranya tanpa seizinnya maka sesungguhnya ia telah melihat kepada Neraka, mintalah kepada Allah dengan menengadahkan telapak tanganmu dan jangan meminta dengan belakang telapak tangan dan apabila kalian telah selesai maka usaplah muka kalian dengan keduanya. Abu Daud berkata: hadits ini diriwayatkan bukan hanya dari satu sisi dari Muhammad bin Ka'bin, semuanya lemah dan jalur ini yang paling bagus, namun hadits tersebut lemah juga. "
            },
            {
                "number": 1240,
                "arab": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ حَدَّثَنَا سَلْمُ بْنُ قُتَيْبَةَ عَنْ عُمَرَ بْنِ نَبْهَانَ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو هَكَذَا بِبَاطِنِ كَفَّيْهِ وَظَاهِرِهِمَا",
                "id": "Telah menceritakan kepada Kami ['Uqbah bin Mukram] telah menceritakan kepada Kami [Salm bin Qutaibah] dari [Umar bin Nabhan] dari [Qatadah] dari [Anas bin Malik] radliallahu 'anhu berkata; aku melihat Rasulullah shallAllahu wa'alaihi wa sallam berdo'a seperti ini dengan menggunakan telapak tangannya dan belakangnya. "
            },
            {
                "number": 1241,
                "arab": "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ الْحَرَّانِيُّ حَدَّثَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ حَدَّثَنَا جَعْفَرٌ يَعْنِي ابْنَ مَيْمُونٍ صَاحِبَ الْأَنْمَاطِ حَدَّثَنِي أَبُو عُثْمَانَ عَنْ سَلْمَانَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ رَبَّكُمْ تَبَارَكَ وَتَعَالَى حَيِيٌّ كَرِيمٌ يَسْتَحْيِي مِنْ عَبْدِهِ إِذَا رَفَعَ يَدَيْهِ إِلَيْهِ أَنْ يَرُدَّهُمَا صِفْرًا",
                "id": "Telah menceritakan kepada Kami [Muammal bin Al Fadhl Al Harrani], telah menceritakan kepada Kami [Isa yaitu Ibnu Yunus] telah menceritakan kepada Kami [Ja'far yaitu Ibnu Maimun] pemilik beberapa anmath, telah menceritakan kepadaku [Abu Utsman] dari [Salman], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Sesungguhnya Tuhan kalina Yang Maha Suci dan Maha Tinggi adalah Maha Hidup dan Mulia, Dia merasa malu dari hambanya apabila ia mengangkat kedua tanganya kepadaNya dan mengembalikannya dalam keadaan kosong.\""
            },
            {
                "number": 1242,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ حَفْصِ بْنِ هَاشِمِ بْنِ عُتْبَةَ بْنِ أَبِي وَقَّاصٍ عَنْ السَّائِبِ بْنِ يَزِيدَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَعَا فَرَفَعَ يَدَيْهِ مَسَحَ وَجْهَهُ بِيَدَيْهِ",
                "id": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id], telah menceritakan kepada Kami [Ibnu Lahi'ah] dari [Hafsh bin Hasyim bin 'Utbah bin Abu Waqqash] dari [As Saib bin Yazid] dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam apabila berdoa maka beliau mengangkat kedua tangannya dan mengusap wajahnya dengan keduanya. "
            },
            {
                "number": 1243,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ مَالِكِ بْنِ مِغْوَلٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ رَجُلًا يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ فَقَالَ لَقَدْ سَأَلْتَ اللَّهَ بِالِاسْمِ الَّذِي إِذَا سُئِلَ بِهِ أَعْطَى وَإِذَا دُعِيَ بِهِ أَجَابَحَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ الرَّقِّيِّ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ بِهَذَا الْحَدِيثِ قَالَ فِيهِ لَقَدْ سَأَلْتَ اللَّهَ عَزَّ وَجَلَّ بِاسْمِهِ الْأَعْظَمِ",
                "id": "Telah menceritakan kepada Kami [Musaddad] telah menceritakan kepada Kami [Yahya] dari [Malik bin Mighwal] telah menceritakan kepada Kami [Abdullah bin Buraidah] dari [ayahnya] bahwa Rasulullah shallAllahu wa'alaihi wa sallam mendengar seorang laki-laki mengucapkan; ALLAAHUMMA INNII AS-ALUKA ANNII ASYHADU ANNAKA ANTALLAAHU LAA ILAAHA ILLAA ANTA Al AHAD, ASH SHAMAD ALLADZII LAM YALID WA LAM YUULAD WA LAM YAKUN LAHU KUFUWAN AHAD (ya Allah sesungguhnya aku meminta kepada-Mu dengan bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Engkau Dzat Yang Maha Esa dan tempat bergantung Yang tidak beranak dan tidak diperanakkan dan tidak ada seorang pun yang menandingi-Nya). Kemudian beliau berkata: \"Sunngguh engkau telah meminta kepada Allah dengan perantara nama yang apabila Dia diminta dengannya pasti Dia akan mengabulkan.\" Telah menceritakan kepada Kami [Abdurrahman bin Khalid Ar Raqqi], telah menceritakan kepada Kami [Zaid bin Hubbab], telah menceritakan kepada Kami kepada Kami [Malik bin Mighwal] dengan hadits ini dan padanya beliau bersabda: \"Sungguh engkau telah meminta kepada Allah dengan namaNya yang agung.\""
            },
            {
                "number": 1244,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عُبَيْدِ اللَّهِ الْحَلَبِيُّ حَدَّثَنَا خَلَفُ بْنُ خَلِيفَةَ عَنْ حَفْصٍ يَعْنِي ابْنَ أَخِي أَنَسٍ عَنْ أَنَسٍأَنَّهُ كَانَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسًا وَرَجُلٌ يُصَلِّي ثُمَّ دَعَا اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدُ لَا إِلَهَ إِلَّا أَنْتَ الْمَنَّانُ بَدِيعُ السَّمَوَاتِ وَالْأَرْضِ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ يَا حَيُّ يَا قَيُّومُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ دَعَا اللَّهَ بِاسْمِهِ الْعَظِيمِ الَّذِي إِذَا دُعِيَ بِهِ أَجَابَ وَإِذَا سُئِلَ بِهِ أَعْطَى",
                "id": "Telah menceritakan kepada Kami [Abdurrahman bin 'ubaidhullah Al Halabi], telah menceritakan kepada Kami [Khalaf bin Khalifah] dari [Hafsh yaitu anak saudara Anas] dari [Anas] bahwa ia duduk bersama Rasulullah shallAllahu wa'alaihi wa sallam dan terdapat seorang laki-laki yang melakukan sholat, kemudian ia berdoa; ALLAAHUMMA INNII AS-ALUKA BIANNA LAKAL HAMDU LAA ILAAHA ILLAA ANTA, Al MANNAANU, BADII'US SAMAAWAATI WAL ARDHI, YAA DZAL JALAALI WAL IKRAAM, YAA HAYYU YAA QAYYUUM (ya Allah, aku memohon kepadaMu bahwa bagiMu segala pujian, tidak ada tuhan yang berhak disembah kecuali Engkau, Maha Pemberi, Pencipta langit dan bumi. Wahai Dzat yang memiliki keagungan, serta kemuliaan, wahai Dzat yang Maha Hidup, lagi terus menerus mengurus (makhluk-Nya)). Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Sungguh ia telah berdoa kepada Allah dengan namaNya yang agung, yang apabila dipanjatkan doa kepadaNya dengan nama tersebut maka Dia akan mengabulkannya, dan apabila Dia diminta dengan nama tersebut maka Dia akan memberinya.\""
            },
            {
                "number": 1245,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو أَنَّ سَعِيدَ بْنَ أَبِي هِلَالٍ حَدَّثَهُ عَنْ خُزَيْمَةَ عَنْ عَائِشَةَ بِنْتِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِيهَاأَنَّهُ دَخَلَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى امْرَأَةٍ وَبَيْنَ يَدَيْهَا نَوًى أَوْ حَصًى تُسَبِّحُ بِهِ فَقَالَ أُخْبِرُكِ بِمَا هُوَ أَيْسَرُ عَلَيْكِ مِنْ هَذَا أَوْ أَفْضَلُ فَقَالَ سُبْحَانَ اللَّهِ عَدَدَ مَا خَلَقَ فِي السَّمَاءِ وَسُبْحَانَ اللَّهِ عَدَدَ مَا خَلَقَ فِي الْأَرْضِ وَسُبْحَانَ اللَّهِ عَدَدَ مَا خَلَقَ بَيْنَ ذَلِكَ وَسُبْحَانَ اللَّهِ عَدَدَ مَا هُوَ خَالِقٌ وَاللَّهُ أَكْبَرُ مِثْلُ ذَلِكَ وَالْحَمْدُ لِلَّهِ مِثْلُ ذَلِكَ وَلَا إِلَهَ إِلَّا اللَّهُ مِثْلُ ذَلِكَ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ مِثْلُ ذَلِكَ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Shalih] telah menceritakan kepada Kami [Abdullah bin Wahb], telah mengabarkan kepadaku ['Amr] bahwa [Sa'id? bin Abu Hilal] telah menceritakan kepadanya dari [Khuzaimah] dari [Aisyah binti Sa'd bin Abu Waqqash] dari [ayahnya] bahwa ia bersama Rasulullah shallla Allahu 'alaihi wa sallam menemui seorang wanita sementara dihadapannya terdapat biji-bijian atau kerikil yang dipergunakan untuk bertasbih. Kemudian Nabi Shalla Allahu 'alaihi wa sallam berkata: \"Aku akan memberitahukan kepadamu sesuatu yang lebih mudah bagimu dari pada ini dan lebih utama!\" Lalu beliau mengucapkan: \"SUBHAANALLAAHI 'ADADA MAA KHALAQA FIS SAMAAI WA SUBHAANALLAAHI 'ADADA MAA KHALAQA FIL ARDHI WA SUBHAANALLAAHI 'ADADA MAA KHALAQA BAINA DZAALIKA WA SUBHAANALLAAHI 'ADADA MAA HUWA KHAALIQUN, WALLAAHU AKBARU MITSLU DZAALIKA, WAL HAMDU LILLAAHI MITSLU DZAALIKA WA LAA ILAAHA ILLALLAAHU MITSLU DZAALIKA WA LAA HAULA WA LAA QUWWATA ILLAA BILLAAHI MITSLU DZAALIKA\" (Maha Suci Allah sebanyak makhluk yang Dia ciptakan dilangit, dan Maha Suci Allah sebanyak makhluk yang Dia ciptakan di bumi, dan Maha Suci Allah sebanyak makhluk yang Dia ciptakan diantara keduanya dan Maha Suci Allah sebanyak apa yang Dia ciptakan, dan Allah Maha Besar seperti itu, segala puji bagi Allah seperti itu, dan tidak ada tuhan yang berhak disembah kecuali Allah seperti itu, dan tidak ada daya serta kekuatan kecuali karena Allah seperti itu) "
            },
            {
                "number": 1246,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ هَانِئِ بْنِ عُثْمَانَ عَنْ حُمَيْضَةَ بِنْتِ يَاسِرٍ عَنْ يُسَيْرَةَ أَخْبَرَتْهَاأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُنَّ أَنْ يُرَاعِينَ بِالتَّكْبِيرِ وَالتَّقْدِيسِ وَالتَّهْلِيلِ وَأَنْ يَعْقِدْنَ بِالْأَنَامِلِ فَإِنَّهُنَّ مَسْئُولَاتٌ مُسْتَنْطَقَاتٌ",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Abdullah bin Daud] dari [Hani` bin Utsman] dari [Humaidhah binti Yasir] dari [Yusairah] ia telah mengabarkan kepadanya bahwa Nabi shallallahu 'alaihi wasallam memerintahkan mereka (para wanita) agar menjaga takbir, pensucian Allah, serta tahlil, dan menghitung dzikir menggunakan ruas-ruas jari, karena ruas-ruas tersebut akan ditanya dan diminta untuk berbicara. "
            },
            {
                "number": 1247,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ وَمُحَمَّدُ بْنُ قُدَامَةَ فِي آخَرِينَ قَالُوا حَدَّثَنَا عَثَّامٌ عَنْ الْأَعْمَشِ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْقِدُ التَّسْبِيحَ قَالَ ابْنُ قُدَامَةَ بِيَمِينِهِ",
                "id": "Telah menceritakan kepada Kami ['ubaidhullah bin Umar bin Maisarah] dan [Muhammad bin Qudamah] diantara orang-orang yang lain, mereka berkata; \"Telah menceritakan kepada Kami ['Atstsam] dari [Al A'masy] dari ['Atho` bin As Saib] dari [ayahnya] dari [Abdullah bin 'Amr], ia berkata; aku melihat Rasulullah shallla Allahu 'alaihi wa sallam menghitung tasbih. Ibnu Qudamah berkata: yaitu dengan tangan kanannya. "
            },
            {
                "number": 1248,
                "arab": "حَدَّثَنَا دَاوُدُ بْنُ أُمَيَّةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ مَوْلَى آلِ طَلْحَةَ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِ جُوَيْرِيَةَ وَكَانَ اسْمُهَا بُرَّةَ فَحَوَّلَ اسْمَهَا فَخَرَجَ وَهِيَ فِي مُصَلَّاهَا وَرَجَعَ وَهِيَ فِي مُصَلَّاهَا فَقَالَ لَمْ تَزَالِي فِي مُصَلَّاكِ هَذَا قَالَتْ نَعَمْ قَالَ قَدْ قُلْتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ ثَلَاثَ مَرَّاتٍ لَوْ وُزِنَتْ بِمَا قُلْتِ لَوَزَنَتْهُنَّ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
                "id": "Telah menceritakan kepada Kami [Daud bin Umayyah], telah menceritakan kepada Kami [Sufyan bin 'Uyainah] dari [Muhammad bin Abdurrahman] mantan budak keluarga Thalhah, dari [Kuraib] dari [Ibnu Abbas], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam keluar dari sisi Juwairiyah, dan namanya adalah Burrah, kemudian beliau mengganti namanya, beliau keluar sementara ia berada dalam tempat sholatnya, beliau kembali dan ia masih berada di tempat sholatnya. Kemudian beliau berkata: \"Apakah engkau akan tetap berada dalam tempat sholatmu ini?\" Juwairiyah berkata; \"ya.\" Beliau bersabda: \"Setelah pergi darimu aku telah mengucapkan empat kalimat selama tiga kali, apabila empat kalimat tersebut ditimbang dengan apa yang engkau ucapkan niscaya akan lebih berat, yaitu: SUBHAANALLAAHI WA BIHAMDIHI 'ADADA KHALQIHI WA RIDHAA NAFSIHI WA ZINATA 'ARSYIHI WA MIDAADA KALIMAATIHI (Maha Suci Allah, dengan memuji kepadaNya sebanyak makhlukNya, dan keridhaan diriNya, berat 'ArsyNya, dan keluasan kalimat-kalimatNya).\""
            },
            {
                "number": 1249,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي حَسَّانُ بْنُ عَطِيَّةَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي عَائِشَةَ قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ قَالَ قَالَ أَبُو ذَرٍّيَا رَسُولَ اللَّهِ ذَهَبَ أَصْحَابُ الدُّثُورِ بِالْأُجُورِ يُصَلُّونَ كَمَا نُصَلِّي وَيَصُومُونَ كَمَا نَصُومُ وَلَهُمْ فُضُولُ أَمْوَالٍ يَتَصَدَّقُونَ بِهَا وَلَيْسَ لَنَا مَالٌ نَتَصَدَّقُ بِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَبَا ذَرٍّ أَلَا أُعَلِّمُكَ كَلِمَاتٍ تُدْرِكُ بِهِنَّ مَنْ سَبَقَكَ وَلَا يَلْحَقُكَ مَنْ خَلْفَكَ إِلَّا مَنْ أَخَذَ بِمِثْلِ عَمَلِكَ قَالَ بَلَى يَا رَسُولَ اللَّهِ قَالَ تُكَبِّرُ اللَّهَ عَزَّ وَجَلَّ دُبُرَ كُلِّ صَلَاةٍ ثَلَاثًا وَثَلَاثِينَ وَتَحْمَدُهُ ثَلَاثًا وَثَلَاثِينَ وَتُسَبِّحُهُ ثَلَاثًا وَثَلَاثِينَ وَتَخْتِمُهَا بِلَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ غُفِرَتْ لَهُ ذُنُوبُهُ وَلَوْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ",
                "id": "Telah menceritakan kepada Kami [Abdurrahman bin Ibrahim] telah menceritakan kepada Kami [Al Walid bin Muslim], telah menceritakan kepada Kami [Al Auza'i], telah menceritakan kepadaku [Hassan bin 'Athiyyah], ia berkata; telah menceritakan kepadaku [Muhammad bin Abu Aisyah], ia berkata; telah menceritakan kepadaku [Abu Hurairah RhadhiyAllahu 'anhu], ia berkata; Abu Dzar berkata; wahai RasulAllah! Orang-orang kaya pergi dengan membawa banyak pahala, mereka melakukan sholat sebagaimana Kami melakukan sholat, mereka berpuasa sebagaimana Kami berpuasa, mereka mempunyai kelebihan harta yang mereka sedekahkan sementara Kami tidak memiliki harta untuk bersedekah. Kemudian Rasulullah shalallAllahu 'alaihi wa sallam berkata: \"Wahai Abu Dzar, maukah aku ajarkan kepadamu beberapa kalimat yang dengannya kamu dapat menyusul orang yang telah mendahuluimu dan orang yang di belakangmu tidak dapat mengejarmu kecuali orang yang mengerjakan seperti apa yang kamu kerjakan?\" Dia menjawab; ya, wahai Rasulullah! Beliau bersabda: \"Engkau bertakbir kepada tiga puluh tiga kali setiap selesai sholat, bertahmid tiga puluh tiga kali, bertasbih tiga puluh tiga kali dan kamu tutup dengan ucapan LAA ILAAHA ILLALLAAHU WAHDAU LAA SYARIIKALAHU, LAHUL MULKU WA LAHUL HAMDU WA HUWA 'ALAA KULLI SYAI-IN QADIIR (tidak ada tuhan yang berhak disembah kecuali Allah semata, tidak ada sekutu bagiNya, milikNya seluruh kerajaan, dan bagi-Nya segala puji dan Dia Maha Mampu melakukan segala sesuatu) niscaya dosa-dosanya akan diampuni walaupun sebanyak buih lautan.\""
            },
            {
                "number": 1250,
                "arab": "حَدَّثَنَا مُسَدَّدٌ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ وَرَّادٍ مَوْلَى الْمُغِيرَةِ بْنِ شُعْبَةَ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَكَتَبَ مُعَاوِيَةُ إِلَى الْمُغِيرَةِ بْنِ شُعْبَةَ أَيُّ شَيْءٍ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا سَلَّمَ مِنْ الصَّلَاةِ فَأَمْلَاهَا الْمُغِيرَةُ عَلَيْهِ وَكَتَبَ إِلَى مُعَاوِيَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ وَلَا مُعْطِيَ لِمَا مَنَعْتَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
                "id": "Telah menceritakan kepada Kami [Musaddad], ia berkata; telah menceritakan kepada Kami [Abu Mu'awiyah] dari [Al A'masy] dari [Al Musayyab bin Rafi'] dari [Warrad] mantan budak Al Mughirah bin Syu'bah, dari [Al Mughirah bin Syu'bah], Mu'awiyah menulis surat kepada Al Mughirah bin Syu'bah; apakah yang diucapkan Rasulullah apabila telah mengucapkan salam dari sholatnya? Kemudian Al Mughirah mendektekannya kepadanya dan menulis kepada Mu'awiyah, ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam mengucapkan: \"LAA ILAAHA ILLALLAAHU WAHDAU LAA SYARIIKALAHU, LAHUL MULKU WA LAHUL HAMDU WA HUWA 'ALAA KULLI SYAI-IN QADIIR, ALLAAHUMMA LAA MAANI'A LIMAA A'THAITA WA LAA MU'THIYA LIMAA MANA'TA WA LAA YANFA'U DZAL JADDI MINKAL JADDU\" (tidak ada tuhan yang berhak disembah kecuali Allah semata, tidak ada sekutu bagiNya, milikNya seluruh kerajaan, dan bagi-Nya segala puji dan Dia Maha Mampu melakukan segala sesuatu. Ya Allah, tidak ada yang dapat menahan apa yang Engkau berikan, dan tidak ada yang dapat memberikan apa yang Engkau tahan, serta tidaklah bermanfaat kekayaan bagi orang yang kaya dari adzabMu) "
            },
            {
                "number": 1251,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ عَنْ الْحَجَّاجِ بْنِ أَبِي عُثْمَانَ عَنْ أَبِي الزُّبَيْرِ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ عَلَى الْمِنْبَرِ يَقُولُكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا انْصَرَفَ مِنْ الصَّلَاةِ يَقُولُ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ لَا إِلَهَ إِلَّا اللَّهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الْكَافِرُونَ أَهْلُ النِّعْمَةِ وَالْفَضْلِ وَالثَّنَاءِ الْحَسَنِ لَا إِلَهَ إِلَّا اللَّهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الْكَافِرُونَحَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا عَبْدَةُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِي الزُّبَيْرِ قَالَ كَانَ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ يُهَلِّلُ فِي دُبُرِ كُلِّ صَلَاةٍ فَذَكَرَ نَحْوَ هَذَا الدُّعَاءِ زَادَ فِيهِ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ لَا إِلَهَ إِلَّا اللَّهُ لَا نَعْبُدُ إِلَّا إِيَّاهُ لَهُ النِّعْمَةُ وَسَاقَ بَقِيَّةَ الْحَدِيثِ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Isa], ia berkata; telah menceritakan kepada Kami [Ibnu 'Ulayyah] dari [Al Hajjaj bin Abu 'Utsman] dari [Abu Az Zubair], ia berkata; saya mendengar [Abdullah bin Az Zubair] di atas mimbar berkata; Nabi shallallahu 'alaihi wasallam apabila selesai dari sholat mengucapkan: \"LAA ILAAHA ILLALLAAHU WAHDAHU LAA SYARIIKALAHU, LAHUL MULKU WA LAHUL HAMDU WA HUWA 'ALAA KULLI SYAI-IN QADIIR, LAA ILAAHA ILLALLAAHU MUKHLISHIINA LAHUD DIIN, WALAU KARIHAL KAAFIRUUN, AHLUN NI'MATI WAL FADHLI WATS TSANAAIL HASAN, LAA ILAAHA ILLALLAAHU MUKHLISHIINA LAHUD DIIN WALAU KARIHAL KAAFIRUUN.\" (Tidak ada tuhan yang berhak disembah kecuali Allah semata, tidak ada sekutu bagiNya, milikNya seluruh kerajaan, dan bagi-Nya segala puji dan Dia Maha Mampu melakukan segala sesuatu, tidak ada tuhan yang berhak disembah kecuali Allah, Kami memurnikan ketundukan kepadaNya, walaupun orang-orang kafir merasa tidak senang. Dialah Yang Pemilik segala kenikmatan, karunia serta pujian yang baik. Tidak ada tuhan yang berhak disembah kecuali Allah, Kami memurnikan ketundukan kepadaNya walaupun orang-orang kafir merasa tidak senang). Telah menceritakan kepada Kami [Muhammad bin Sulaiman Al Anbari], telah menceritakan kepada Kami ['Abdah] dari [Hisyam bin 'Urwah] dari [Abu Az Zubair], ia berkata; [Abdullah bin Az Zubair] bertahlil setiap selesai sholat, kemudian menyebutkan doa seperti ini dan ia menambahkan; LAA HAULA WA LAA QUWWATA ILLAA BILLAAH, LAA ILAAHA ILLALLAAHU, LAA NA'BUDU ILLAA IYYAAHU, LAHUN NI'MATU (tidak ada daya dan kekuatan kecuali karena Allah, tidak ada tuhan yang berhak disembah kecuali Allah, Kami tidak menyembah kecuali hanya kepadaNya, bagiNya segala kenikmatan), dan ia menyebutkan kelanjutan hadits tersebut. "
            },
            {
                "number": 1252,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَسُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ وَهَذَا حَدِيثُ مُسَدَّدٍ قَالَا حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ دَاوُدَ الطُّفَاوِيَّ قَالَ حَدَّثَنِي أَبُو مُسْلِمٍ الْبَجَلِيُّ عَنْ زَيْدِ بْنِ أَرْقَمَ قَالَسَمِعْتُ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَقَالَ سُلَيْمَانُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي دُبُرِ صَلَاتِهِ اللَّهُمَّ رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ أَنَا شَهِيدٌ أَنَّكَ أَنْتَ الرَّبُّ وَحْدَكَ لَا شَرِيكَ لَكَ اللَّهُمَّ رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ أَنَا شَهِيدٌ أَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ اللَّهُمَّ رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ أَنَا شَهِيدٌ أَنَّ الْعِبَادَ كُلَّهُمْ إِخْوَةٌ اللَّهُمَّ رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ اجْعَلْنِي مُخْلِصًا لَكَ وَأَهْلِي فِي كُلِّ سَاعَةٍ فِي الدُّنْيَا وَالْآخِرَةِ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ اسْمَعْ وَاسْتَجِبْ اللَّهُ أَكْبَرُ الْأَكْبَرُ اللَّهُمَّ نُورَ السَّمَوَاتِ وَالْأَرْضِ قَالَ سُلَيْمَانُ بْنُ دَاوُدَ رَبَّ السَّمَوَاتِ وَالْأَرْضِ اللَّهُ أَكْبَرُ الْأَكْبَرُ حَسْبِيَ اللَّهُ وَنِعْمَ الْوَكِيلُ اللَّهُ أَكْبَرُ الْأَكْبَرُ",
                "id": "Telah menceritakan kepada Kami [Musaddad] serta [Sulaiman bin Daud Al 'Ataki], dan ini adalah hadits Musaddad. Mereka berdua mengatakan; telah menceritakan kepada Kami [Al Mu'tamir] ia berkata; saya mendengar [Daud Ath Thufawi] berkata; telah menceritakan kepadaku [Abu Muslim Al Bajali] dari [Zaid bin Arqam] ia berkata; saya mendengar Nabi shallallahu 'alaihi wasallam mengucapkan: …. Sedangkan Sulaiman berkata; Rasulullah shallAllahu wa'alaihi wa sallam mengucapkan setiap selesai sholat: \"ALLAAHUMMA RABBANAA WA RABBA KULLI SYAI-IN WA ANA SYAHIIDUN ANNAKAR RABBU WAHDAKA LAA SYARIIKA LAKA, ALLAAHUMMA RABBANAA WA RABBA KULLI SYAI-IN, ANA SYAHIIDUN ANNA MUHAMMADAN 'ABDUKA WA RUSUULUKA. ALLAAHUMMA RABBANAA WA RABBA KULLI SYAI-IN ANA SYAHIIDUN ANNAL 'IBAADA KULLAHUM IKHWATUN, ALLAAHUMMA RABBANAA WA RABBA KULLI SYAI-IN, IJ'ALNII MUKHLISHAN LAKA WA AHLII FII KULLI SAA'ATIN FID DUNYAA WAL AAKHIRAH, YAA DZAL JALAALI WAL IKRAAM, ISMA' WAS TAJIB. ALLAAHU AKBARUL AKBAR, ALLAAHUMMA NUURAS SAMAAWAATI WAL ARDHI (Ya Allah, Tuhan Kami dan Tuhan segala sesuatu, aku bersaksi bahwa Engkau adalah Tuhan satu-satunya, tidak ada sekutu bagiMu. Ya Allah, Tuhan Kami dan Tuhan segala sesuatu, aku bersaksi bahwa Muhammad adalah hamba dan utusanMu. Ya Allah, Tuhan Kami dan Tuhan segala sesuatu, aku bersaksi bahwa seluruh hamba adalah bersaudara, ya Allah, Tuhan Kami dan Tuhan segala sesuatu, jadikanlah aku orang yang mengikhlaskan ibadah kepadaMu, begitu juga keluargaku, di dalam setiap saat, di dunia serta Akhirat, wahai Dzat Yang Memiliki keagungan serta kemuliaan. Dengarkan perkenankanlah. Allah Maha Besar, ya Allah, Pemberi cahaya langit dan bumi). Sulaiman bin Daud mengucapkan; RABBAS SAMAAWAATI WAL ARDHI, ALLAAHU AKBARUL AKBARU, HASBIYALLAAHU WA NI'MAL WAKIIL, ALLAAHU AKBARUL AKBARU (Tuhan langit dan bumi, Allah Maha Besar, cukuplah Allah bagiku, dan Dialah sebaik-baik wakil, Allah Maha Besar). "
            },
            {
                "number": 1253,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ قَالَ حَدَّثَنَا أَبِي حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ عَنْ عَمِّهِ الْمَاجِشُونِ بْنِ أَبِي سَلَمَةَ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَلَّمَ مِنْ الصَّلَاةِ قَالَ اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَسْرَفْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَ",
                "id": "Telah menceritakan kepada Kami ['ubaidhullah bin Mu'adz] ia berkata; telah menceritakan kepada Kami [ayahku], telah menceritakan kepada Kami [Abdul Aziz bin Abu Salamah] dari [pamannya yaitu Al Majisyun bin Abu Salamah] dari [Abdurrahman Al A'raj] dari ['ubaidhullah bin Abu Rafi'] dari [Ali bin Abu Thalib] ia berkata; Nabi shallallahu 'alaihi wasallam apabila mengucapkan salam setelah sholat beliau mengucapkan: \"ALLAAHUMMAGHFIRLII MAA QADDAMTU WA MAA AKHKHARTU WA MAA ASRARTU WA MAA A'LANTU WA MAA ASRAFTU, WA MAA ANTA A'LAMU BIHI MINNII, ANTAL MUQADDIMU WA ANTAL MUAKHKHIRU LAA ILAAHA ILLAA ANTA\" (Ya Allah, ampunilah bagiku apa yang telah aku lakukan dan apa yang belum aku lakukan, apa yang aku sembunyikan dan apa yang aku nampakkan, apa yang lakukan secara berlebihan, dan apa yang Engkau lebih tahu daripada diriku. Engkau Yang mendahulukan dan Yang mengakhirkan, tidak ada tuhan yang berhak disembah kecuali Engkau.\""
            },
            {
                "number": 1254,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ طُلَيْقِ بْنِ قَيْسٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو رَبِّ أَعِنِّي وَلَا تُعِنْ عَلَيَّ وَانْصُرْنِي وَلَا تَنْصُرْ عَلَيَّ وَامْكُرْ لِي وَلَا تَمْكُرْ عَلَيَّ وَاهْدِنِي وَيَسِّرْ هُدَايَ إِلَيَّ وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ اللَّهُمَّ اجْعَلْنِي لَكَ شَاكِرًا لَكَ ذَاكِرًا لَكَ رَاهِبًا لَكَ مِطْوَاعًا إِلَيْكَ مُخْبِتًا أَوْ مُنِيبًا رَبِّ تَقَبَّلْ تَوْبَتِي وَاغْسِلْ حَوْبَتِي وَأَجِبْ دَعْوَتِي وَثَبِّتْ حُجَّتِي وَاهْدِ قَلْبِي وَسَدِّدْ لِسَانِي وَاسْلُلْ سَخِيمَةَ قَلْبِيحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ قَالَ سَمِعْتُ عَمْرَو بْنَ مُرَّةَ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ وَيَسِّرْ الْهُدَى إِلَيَّ وَلَمْ يَقُلْ هُدَايَ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Katsir], telah mengabarkan kepada Kami [Sufyan] dari ['Amr bin Murrah] dari [Abdullah bin Al Harits] dari [Thalq bin Qais] dari [Ibnu Abbas], ia berkata; Nabi shallallahu 'alaihi wasallam berdoa dengan mengucapkan: \"RABBI A'INNII WA LAA TU'IN 'ALAYYA, WAN SHURNII WA LAA TANSHUR 'ALAYYA WAMKUR LII WA LAA TAMKUR 'ALAYYA, WAHDINII WA YASSIR HUDAYA ILAYYA WAN SHURNII 'ALAA MAN BAGHAA 'ALAYYA. ALLAAHUMMAJ'ALNII LAKA SYAAKIRAN, DZAAKIRAN LAKA, RAAHIBAN, LAKA MITHWAA'AN ILAIKA, MUKHBITAN AU MUNIIBAN. RABBI TAQABBAL TAUBATII WAGHSIL HAUBATII WA AJIB DA'WATII WA TSABBIT HUJJATII, WAHDI QALBII, WA SADDID LISAANII, WASLUL SAKHIIMATA QALBII\" (Ya Allah, bantulah aku dan jangan Engkau bantu untuk memusuhiku, tolonglah aku dan jangan Engkau tolong untuk memusuhiku, lakukan tipu daya untukku dan jangan Engkau melakukan tipu daya terhadap diriku, berilah kau petunjuk dan permudahlah petunjuk kepadaku, tolonglah aku menghadapi orang yang berbuat lalim terhadap diriku. Ya Allah, jadikanlah aku orang yang bersyukur kepadaMu, ingat kepadaMu, takut kepadaMu, taat kepadaMu, tunduk kepadaMu, atau kembali kepadaMu. Tuhanku, terimalah taubatku, hilangkan kegelisahanku, dan kabulkan doaku, teguhkan hujjahku, dan berilah petunjuk hatiku, luruskan lisanku, dan cabutlah kedengkian hatiku). Telah menceritakan kepada Kami [Musaddad] telah menceritakan kepada Kami [Yahya] dari [Sufyan], ia berkata; aku mendengar ['Amr bin Murrah] dengan sanad dan maknanya ia berkata; \"dan mudahkanlah petunjuk kepadaku\" bukan \"petunjukku\". "
            },
            {
                "number": 1255,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ الْأَحْوَلِ وَخَالِدٍ الْحَذَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَلَّمَ قَالَ اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِقَالَ أَبُو دَاوُد سَمِعَ سُفْيَانُ مِنْ عَمْرِو بْنِ مُرَّةَ قَالُوا ثَمَانِيَةَ عَشَرَ حَدِيثًا حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا عِيسَى عَنْ الْأَوْزَاعِيِّ عَنْ أَبِي عَمَّارٍ عَنْ أَبِي أَسْمَاءَ عَنْ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يَنْصَرِفَ مِنْ صَلَاتِهِ اسْتَغْفَرَ ثَلَاثَ مَرَّاتٍ ثُمَّ قَالَ اللَّهُمَّ فَذَكَرَ مَعْنَى حَدِيثِ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا",
                "id": "Telah menceritakan kepadaku [Muslim bin Ibrahim] telah menceritakan kepada Kami [Syu'bah] dari ['Ashim Al Ahwal] dan [Khalid Al Hadzdza`] dari [Abdullah bin Al Harits] dari [Aisyah] radliallahu 'anha bahwa Nabi shallallahu 'alaihi wasallam apabila mengucapkan salam beliau berdoa: \"ALLAAHUMMA ANTAS SALAAM WA MINKAS SALAAM TABAARAKTA YAA DZAL JALAALI WAL IKRAAM\" (Ya Allah, Engkau adalah Dzat Yang Memberikan keselamatan, dan darimu datang keselamatan, Maha Suci Engkau wahai Dzat yang memiliki keagungan dan kemuliaan). Abu Daud berkata; Sufyan telah mendengar dari 'Amr bin Murrah (mereka mengatakan sebayak delapan belas hadits), telah menceritakan kepada Kami [Ibrahim bin Musa], telah mengabarkan kepada Kami [Isa] dari [Al Auza'i] dari [Abu 'Ammar] dari [Abu Asma`] dari [Tsauban] mantan budak Rasulullah shallAllahu wa'alaihi wa sallam bahwa Nabi shallallahu 'alaihi wasallam apabila hendak berpaling dari sholat beliau beristighfar tiga kali, kemudian mengucapkan, \"ALLAAHUMMA…..\" kemudian ia menyebutkan hadits Aisyah radliallahu 'anha. "
            },
            {
                "number": 1256,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَمُسَدَّدٌ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ أَبِي بُرْدَةَ عَنْ الْأَغَرِّ الْمُزَنِيِّ قَالَ مُسَدَّدٌ فِي حَدِيثِهِ وَكَانَتْ لَهُ صُحْبَةٌ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ لَيُغَانُ عَلَى قَلْبِي وَإِنِّي لَأَسْتَغْفِرُ اللَّهَ فِي كُلِّ يَوْمٍ مِائَةَ مَرَّةٍ",
                "id": "Telah menceritakan kepada Kami [Sulaiman bin Harb] serta [Musaddad] mereka berkata; telah menceritakan kepada Kami [Hammad] dari [Tsabit] dari [Abu Burdah] dari [Al Agharr Al Muzani], Musaddad yang pernah menyertai Nabi shallallahu 'alaihi wasallam dalam haditsnya mengatakan; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Sesungguhnya hatiku pernah tertutup dan aku beristighfar kepada Allah dalam sehari sebanyak seratus kali.\""
            },
            {
                "number": 1257,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ مَالِكِ بْنِ مِغْوَلٍ عَنْ مُحَمَّدِ بْنِ سُوقَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَإِنْ كُنَّا لَنَعُدُّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَجْلِسِ الْوَاحِدِ مِائَةَ مَرَّةٍ رَبِّ اغْفِرْ لِي وَتُبْ عَلَيَّ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ",
                "id": "Telah menceritakan kepada Kami [Al Hasan bin Ali], telah menceritakan kepada Kami [Abu Usamah] dari [Malik bin Mighwal] dari [Muhammad bin Suqah] dari [Nafi'] dari [Ibnu Umar], ia berkata; sungguh Kami telah menghitung ucapan Rasulullah shallla Allahu 'alaihi wa sallam dalam satu majlis beliau \"RABBIGHFIRLII WA TUB 'ALAYYA, INNAKAT TAWWAABUR RAHIIM\" (Ya Tuhanku, ampunilah aku dan terimalah taubatku sesungguhnya Engkau adalah Dzat yang Maha menerima taubat lagi Maha Penyayang) sebanyak seratus kali."
            },
            {
                "number": 1258,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْحَكَمُ بْنُ مُصْعَبٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ أَبِيهِ أَنَّهُ حَدَّثَهُ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ حَدَّثَهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ لَزِمَ الِاسْتِغْفَارَ جَعَلَ اللَّهُ لَهُ مِنْ كُلِّ ضِيقٍ مَخْرَجًا وَمِنْ كُلِّ هَمٍّ فَرَجًا وَرَزَقَهُ مِنْ حَيْثُ لَا يَحْتَسِبُ",
                "id": "Telah menceritakan dari Kami [Hisyam bin 'Ammar], telah menceritakan kepada Kami [Al Walid bin Muslim], telah menceritakan kepada Kami [Al Hakam bin Mush'ab], telah menceritakan kepada Kami [Muhammad bin Ali bin Abdullah bin Abbas] dari [ayahnya] bahwa ia bercerita kepadanya, dari [Ibnu Abbas] bahwa ia bercerita kepadanya, ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barang siapa yang senantiasa beristighfar, maka Allah pasti akan selalu memberikannya jalan keluar dari setiap kesempitan dan kelapangan dari segala kegundahan serta Allah akan memberikan rizki kepadanya dari arah yang tidak ia sangka-sangka.\""
            },
            {
                "number": 1259,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَارِثِ ح و حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ حَدَّثَنَا إِسْمَعِيلُ الْمَعْنَى عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ قَالَ سَأَلَ قَتَادَةُ أَنَسًاأَيُّ دَعْوَةٍ كَانَ يَدْعُو بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْثَرُ قَالَ كَانَ أَكْثَرُ دَعْوَةٍ يَدْعُو بِهَا اللَّهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِوَزَادَ زِيَادٌ وَكَانَ أَنَسٌ إِذَا أَرَادَ أَنْ يَدْعُوَ بِدَعْوَةٍ دَعَا بِهَا وَإِذَا أَرَادَ أَنْ يَدْعُوَ بِدُعَاءٍ دَعَا بِهَا فِيهَا",
                "id": "Telah menceritakan kepada Kami [Musaddad] telah menceritakan kepada Kami [Abdul Harits] dan telah diriwayatkan melalui jalur yang lain: Telah menceritakan kepada Kami [Ziyad bin Ayyub], telah menceritakan kepada Kami [Isma'il Al Ma'na] dari [Abdul Aziz bin Shuhaib], ia berkata; Qatadah bertanya kepada [Anas] doa apakah yang lebih sering diucapkan Rasulullah shallAllahu wa'alaihi wa sallam? Doa yang lebih sering diucapkan Rasulullah shallAllahu wa'alaihi wa sallam adalah ALLAAHUMMA RABBANAA AATINAA FIDDUNYAA HASANATA WA QINAA 'ADZAABAN NAAR (Ya Allah Tuhan Kami, berikanlah kepada Kami kebaikan di dunia, dan lindungilah Kami dari adzab Neraka). Ziyad menambahkan; Anas apabila hendak menyeru dengan sebuah seruan maka ia menyeru dengannya dan apabila hendak berdoa dengan sebuah doa maka ia berdoa dengannya. "
            },
            {
                "number": 1260,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدٍ الرَّمْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ شُرَيْحٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَأَلَ اللَّهَ الشَّهَادَةَ صَادِقًا بَلَّغَهُ اللَّهُ مَنَازِلَ الشُّهَدَاءِ وَإِنْ مَاتَ عَلَى فِرَاشِهِ",
                "id": "Telah menceritakan kepada Kami [Yazid bin Khalid Ar Ramli], telah menceritakan kepada Kami [Ibnu Wahb], telah menceritakan kepada Kami [Abdurrahman bin Syuraih] dari [Abu Umamah bin Sahl bin Hunaif] dari [ayahnya], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Barang siapa yang memohon kepada Allah agar meninggal dalam keadaan syahid dengan jujur, maka Allah akan menyampaikannya kepada derajat para syuhada walaupun dia mati diatas tempat tidurnya.\""
            },
            {
                "number": 1261,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ قَالَ سَمِعْتُ عُقْبَةَ بْنَ مُسْلِمٍ يَقُولُ حَدَّثَنِي أَبُو عَبْدِ الرَّحْمَنِ الْحُبُلِيُّ عَنْ الصُّنَابِحِيِّ عَنْ مُعَاذِ بْنِ جَبَلٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ بِيَدِهِ وَقَالَ يَا مُعَاذُ وَاللَّهِ إِنِّي لَأُحِبُّكَ وَاللَّهِ إِنِّي لَأُحِبُّكَ فَقَالَ أُوصِيكَ يَا مُعَاذُ لَا تَدَعَنَّ فِي دُبُرِ كُلِّ صَلَاةٍ تَقُولُ اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَوَأَوْصَى بِذَلِكَ مُعَاذٌ الصُّنَابِحِيَّ وَأَوْصَى بِهِ الصُّنَابِحِيُّ أَبَا عَبْدِ الرَّحْمَنِ",
                "id": "Telah menceritakan kepada Kami ['ubaidhullah bin Umar bin Maisarah] telah menceritakan kepada Kami [Abdullah bin Yazid Al Muqri`], telah menceritakan kepada Kami [Haiwah bin Syuraih], ia berkata; aku mendengar ['Uqbah bin Muslim] berkata; telah menceritakan kepadaku [Abu Abdurrahman Al Hubuli] dari [Ash Shunabihi] dari [Mu'adz bin Jabal] bahwa Rasulullah shallAllahu wa'alaihi wa sallam menggandeng tangannya dan berkata: \"Wahai Mu'adz, demi Allah, aku mencintaimu.\" Kemudian beliau berkata: \"Aku wasiatkan kepadamu wahai Mu'adz, janganlah engkau tinggalkan setiap selesai sholat untuk mengucapkan, \"ALLAAHUMMA A'INNII 'ALAA DZIKRIKA WA SYUKRIKA WA HUSNI 'IBAADATIK\" (Ya Allah, bantulah aku untuk berdzikir dan bersyukur kepadaMu serta beribadah kepadaMu dengan baik.) Mu'adz mewasiatkan dengan hal tersebut kepada Ash Shunabihi dan Ash Shunabihi mewasiatkan hal tersebut kepada Abdurrahman. "
            },
            {
                "number": 1262,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ اللَّيْثِ بْنِ سَعْدٍ أَنَّ حُنَيْنَ بْنَ أَبِي حَكِيمٍ حَدَّثَهُ عَنْ عَلِيِّ بْنِ رَبَاحٍ اللَّخْمِيِّ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَقْرَأَ بِالْمُعَوِّذَاتِ دُبُرَ كُلِّ صَلَاةٍ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Salamah Al Muradi], telah menceritakan kepada Kami [Ibnu Wahb] dari [Al Laits bin Sa'd] bahwa [Hunain bin Abu Hakim] telah menceritakan kepadanya dari [Ali bin Rabah Al Lakhmi] dari ['Uqbah bin 'Amir], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam telah memerintahkan Kami untuk membaca surat-surat mu'awwidzât (surat yang berisi permintaan perlindungan kepada Allah, seperti Al Falaq, dan An Nâs) setiap selesai sholat. "
            },
            {
                "number": 1263,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ عَنْ هِلَالٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ ابْنِ جَعْفَرٍ عَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ قَالَتْقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أُعَلِّمُكِ كَلِمَاتٍ تَقُولِينَهُنَّ عِنْدَ الْكَرْبِ أَوْ فِي الْكَرْبِ أَللَّهُ أَللَّهُ رَبِّي لَا أُشْرِكُ بِهِ شَيْئًاقَالَ أَبُو دَاوُد هَذَا هِلَالٌ مَوْلَى عُمَرَ بْنِ عَبْدِ الْعَزِيزِ وَابْنُ جَعْفَرٍ هُوَ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ",
                "id": "Telah menceritakan [Musaddad], telah menceritakan kepada Kami [Abdullah bin Daud] dari [Abdul Aziz bin Umar] dari [Hilal] dari [Umar bin Abdul Aziz] dari [Ibnu Ja'far] dari [Asma` bintu 'Umais], ia berkata; Rasulullah shallla Allahu 'alaihi wa sallam berkata kepadaku: \"Maukah aku ajarkan kamu kalimat-kalimat yang dapat kamu baca ketika dalam keadaan susah yaitu \"ALLAAHU, ALLAAHU RABBII, LAA USYRIKU BIHI SYAIAN\" (Allah, Allah adalah tuhanku, aku tidak menyekutukanNya dengan sesuatu apapun). Abu Daud berkata; Hilal yang ini adalah mantan budak Umar bin Abdul aziz sedangkan Ibnu Ja'far adalah Abdullah bin Ja'far. "
            },
            {
                "number": 1264,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ وَعَلِيِّ بْنِ زَيْدٍ وَسَعِيدٍ الْجُرَيْرِيِّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ أَنَّ أَبَا مُوسَى الْأَشْعَرِيَّ قَالَكُنْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَلَمَّا دَنَوْا مِنْ الْمَدِينَةِ كَبَّرَ النَّاسُ وَرَفَعُوا أَصْوَاتَهُمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَيُّهَا النَّاسُ إِنَّكُمْ لَا تَدْعُونَ أَصَمَّ وَلَا غَائِبًا إِنَّ الَّذِي تَدْعُونَهُ بَيْنَكُمْ وَبَيْنَ أَعْنَاقِ رِكَابِكُمْ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَبَا مُوسَى أَلَا أَدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ الْجَنَّةِ فَقُلْتُ وَمَا هُوَ قَالَ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ عَنْ أَبِي عُثْمَانَ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ أَنَّهُمْ كَانُوا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُمْ يَتَصَعَّدُونَ فِي ثَنِيَّةٍ فَجَعَلَ رَجُلٌ كُلَّمَا عَلَا الثَّنِيَّةَ نَادَى لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّكُمْ لَا تُنَادُونَ أَصَمَّ وَلَا غَائِبًا ثُمَّ قَالَ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ فَذَكَرَ مَعْنَاهُ حَدَّثَنَا أَبُو صَالِحٍ مَحْبُوبُ بْنُ مُوسَى أَخْبَرَنَا أَبُو إِسْحَقَ الْفَزَارِيُّ عَنْ عَاصِمٍ عَنْ أَبِي عُثْمَانَ عَنْ أَبِي مُوسَى بِهَذَا الْحَدِيثِ وَقَالَ فِيهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَيُّهَا النَّاسُ ارْبَعُوا عَلَى أَنْفُسِكُمْ",
                "id": "Telah menceritakan kepada Kami [Musa bin Isma'il] telah menceritakan kepada Kami [Hammad] dari [Tsabit] dan [Ali bin Zaid] serta [Sa'id Al Jurairi] dari [Abu Utsman An Nahdi] bahwa [Abu Musa Asy'ari] berkata; aku pernah bersama Rasulullah shallAllahu wa'alaihi wa sallam dalam suatu perjalanan, kemudian tatkala mereka mendekati Madinah orang-orang bertakbir, dan mengeraskan suara mereka. Kemudian Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Wahai para manusia, sesungguhnya kalian tidak berdoa kepada Dzat Yang tuli, dan tidak pula Yang tidak hadir. Sesungguhnya Dzat kalian seru ada diantara kalian dan leher hewan kendaraan kalian.\" Kemudian Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Wahai Abu Musa, maukah aku tunjukkan kepada harta terpendam diantara harta-harta terpendam Surga?\" Maka aku katakan; apakah itu? Beliau berkata: \"LAA HAULA WA LAA QUWWATA ILLAA BILLAAH\" (Tidak ada daya dan kekuatan kecuali karena Allah). Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Yazid bin Zurai'] telah menceritakan kepada Kami [Sulaiman At Taimi] dari [Abu Utsman] dari [Abu Musa Asy'ari] bahwa mereka pernah bersama Nabi shallallahu 'alaihi wasallam sementara mereka menaiki Tsaniyah, kemudian seseorang setiap kali menaiki Tsaniyah berseru: LAA ILAAHA ILLALLAAHU, WALLAAHU AKBAR. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya kalian tidak berseru kepada Dzat yang Tuli, dan tidak pula Yang tidak hadir.\" Kemudian beliau berkata: \"Wahai Abdullah bin Qais!.....\" kemudian Sulaiman menyebutkan hadits tersebut secara makna. Telah menceritakan kepada Kami [Abu Shalih Mahbub bin Musa], telah mengabarkan kepada Kami [Abu Ishaq Al Fazari] dari ['Ashim] dari [Abu Utsman] dari [Abu Musa] dengan hadits ini. Dan dalam hadits tersebut ia berkata; kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai para manusia, pelankan suara dalam hati kalian!\""
            },
            {
                "number": 1265,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو الْحُسَيْنِ زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ شُرَيْحٍ الْإِسْكَنْدَرَانِيُّ حَدَّثَنِي أَبُو هَانِئٍ الْخَوْلَانِيُّ أَنَّهُ سَمِعَ أَبَا عَلِيٍّ الْجَنْبِيَّ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَالَ رَضِيتُ بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ رَسُولًا وَجَبَتْ لَهُ الْجَنَّةُ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Rafi'], telah menceritakan kepada Kami [Abu Al Husain Zaid bin Al Hubab], telah menceritakan kepada Kami [Abdurrahman bin Syuraih Al Iskandarani], telah menceritakan kepadaku [Abu Hani` Al Khaulani] bahwa ia mendengar [Abu Ali Al Hanbi] bahwa ia mendengar [Abu Sa'id Alkhudri] radliallahu 'anhu mengatakan bahwa Rasulullah shallla Allahu 'alaihi wa sallam bersabda: \"Barangsiapa yang mengatakan; RADHIITU BILLAAHI RABBAN WA BIL-ISLAAMI DIINAN WA BIMUHAMMADIN RASUULAN (Aku ridha Allah sebagai Tuhanku, Islam sebagai agamaku dan Muhammad sebagai rasul), maka wajib baginya untuk masuk Surga. "
            },
            {
                "number": 1266,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَيَحْيَى بْنُ الْفَضْلِ وَسُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ قَالُوا حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ حَدَّثَنَا يَعْقُوبُ بْنُ مُجَاهِدٍ أَبُو حَزْرَةَ عَنْ عُبَادَةَ بْنِ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَدْعُوا عَلَى أَنْفُسِكُمْ وَلَا تَدْعُوا عَلَى أَوْلَادِكُمْ وَلَا تَدْعُوا عَلَى خَدَمِكُمْ وَلَا تَدْعُوا عَلَى أَمْوَالِكُمْ لَا تُوَافِقُوا مِنْ اللَّهِ تَبَارَكَ وَتَعَالَى سَاعَةَ نَيْلٍ فِيهَا عَطَاءٌ فَيَسْتَجِيبَ لَكُمْقَالَ أَبُو دَاوُد هَذَا الْحَدِيثُ مُتَّصِلٌ عُبَادَةُ بْنُ الْوَلِيدِ بْنِ عُبَادَةَ لَقِيَ جَابِراً",
                "id": "Telah menceritakan kepada Kami [Hisyam bin 'Ammar] dan [Yahya bin Al Fadhl] serta [Sulaiman bin Abdurrahma], mereka berkata; telah menceritakan kepada Kami [Hatim bin Ismail], telah menceritakan kepada Kami [Ya'qub bin Mujahid Abu Hazrah] dari ['Ubadah bin Al Walid bin 'Ubadah bin Ash Shamit] dari [Jabir bin Abdullah], ia berkata; Rasulullah shallla Allahu 'alaihi wa sallam bersabda: \"Janganlah kalian mendo'akan kecelakaan atas diri kalian, janganlah kalian mendo'akan kecelakaan bagi anak-anak kalian, dan janganlah kalian mendo'akan kecelakaan atas pembantu kalian, dan janganlah kalian mendo'akan kecelakaan atas harta kalian, jangan sampai kalian berdoa tepat saat diperolehnya pemberian sehingga Allah mengabulkan do'a kalian. Abu Daud berkata; hadits ini adalah hadits yang muttashil (yaitu yang sanadnya bersambung kepada Rasulullah shallAllahu wa'alaihi wa sallam) sebab 'Ubadah bin Al Walid bin 'Ubadah bertemu dengan Jabir. "
            },
            {
                "number": 1267,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْأَسْوَدِ بْنِ قَيْسٍ عَنْ نُبَيْحٍ الْعَنَزِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ امْرَأَةً قَالَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلِّ عَلَيَّ وَعَلَى زَوْجِي فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى اللَّهُ عَلَيْكِ وَعَلَى زَوْجِكِ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Isa] telah menceritakan kepada Kami [Abu 'Awanah] dari [Al Aswad bin Qais] dari [Nubaih Al 'Anazi] dari [Jabir bin Abdullah] bahwa terdapat seorang wanita yang berkata kepada Rasulullah shallla Allahu 'alaihi wa sallam; doakan untukku dan suamiku! Maka Nabi Shalla Allahu 'alaihi wa sallam berkata: \"Semoga Allah bershalawat untukmu dan suamimu\". "
            },
            {
                "number": 1268,
                "arab": "حَدَّثَنَا رَجَاءُ بْنُ الْمُرَجَّى حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ أَخْبَرَنَا مُوسَى بْنُ ثَرْوَانَ حَدَّثَنِي طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ بْنِ كَرِيزٍ حَدَّثَتْنِي أُمُّ الدَّرْدَاءِ قَالَتْ حَدَّثَنِي سَيِّدِي أَبُو الدَّرْدَاءِأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا دَعَا الرَّجُلُ لِأَخِيهِ بِظَهْرِ الْغَيْبِ قَالَتْ الْمَلَائِكَةُ آمِينَ وَلَكَ بِمِثْلٍ",
                "id": "Telah menceritakan kepada Kami [Raja` bin Al murajji] telah menceritakan kepada Kami [An Nadhr bin Syumail], telah mengabarkan kepada Kami [Musa bin Tsarwan] telah menceritakan kepadaku [Thalhah bin 'ubaidhullah bin Kariz], telah menceritakan kepadaku [Ummu Ad Darda`], ia berkata; telah menceritakan kepadaku suamiku [Abu Ad Darda`] bahwa ia mendengar Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Apabila seseorang mendoakan saudaranya secara sembunyi-sembunyi maka Malaikat akan berkata; aamiin, dan semoga engkau mendapatkan hal yang sama.\""
            },
            {
                "number": 1269,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ زِيَادٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَسْرَعَ الدُّعَاءِ إِجَابَةً دَعْوَةُ غَائِبٍ لِغَائِبٍ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin 'Amru bin As Sarh], telah menceritakan kepada Kami [Ibnu Wahb], telah menceritakan kepadaku [Abdurrahman bin Ziyad] dari [Abu Abdurrahman] dari [Abdullah bin 'Amr bin Al 'Ash] bahwa Rasulullah shallla Allahu 'alaihi wa sallam bersabda: \"Sesungguhnya do'a yang paling cepat dikabulkan adalah do'a orang yang ghaib (tidak hadir) untuk saudaranya yang tidak hadir.\""
            },
            {
                "number": 1270,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ عَنْ يَحْيَى عَنْ أَبِي جَعْفَرٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ثَلَاثُ دَعَوَاتٍ مُسْتَجَابَاتٌ لَا شَكَّ فِيهِنَّ دَعْوَةُ الْوَالِدِ وَدَعْوَةُ الْمُسَافِرِ وَدَعْوَةُ الْمَظْلُومِ",
                "id": "Telah menceritakan kepada Kami [Muslim bin Ibrahim], telah menceritakan kepada Kami [Hisyam Ad Dastuwai] dari [Yahya] dari [Abu Ja'far] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tiga doa yang akan dikabulkan, dan tidak diragukan padanya, yaitu: doa orang tua, doa orang yang bersafar, dan doa orang yang dizhalimi.\""
            },
            {
                "number": 1271,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَبِي بُرْدَةَ بْنِ عَبْدِ اللَّهِ أَنَّ أَبَاهُ حَدَّثَهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَافَ قَوْمًا قَالَ اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ وَنَعُوذُ بِكَ مِنْ شُرُورِهِمْ",
                "id": "Telah menceritakan dari Kami [Muhammad bin Al Mutsanna], telah menceritakan kepada Kami [Mu'adz bin Hisyam], telah menceritakan kepadaku [ayahku] dari [Qatadah] dari [Abu Burdah bin Abdullah] bahwa [ayahnya] telah menceritakan kepadanya bahwa Nabi shallallahu 'alaihi wasallam apabila khawatir kepada suatu kaum beliau berdoa: \"Ya Allah, sesungguhnya Kami menjadikanMu di leher-leher mereka (yaitu menghadapi mereka) dan Kami berlindung kepadaMu dari kejahatan mereka.\""
            },
            {
                "number": 1272,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ وَعَبْدُ الرَّحْمَنِ بْنُ مُقَاتِلٍ خَالُ الْقَعْنَبِيِّ وَمُحَمَّدُ بْنُ عِيسَى الْمَعْنَى وَاحِدٌ قَالُوا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الْمَوَالِ حَدَّثَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُنَا الِاسْتِخَارَةَ كَمَا يُعَلِّمُنَا السُّورَةَ مِنْ الْقُرْآنِ يَقُولُ لَنَا إِذَا هَمَّ أَحَدُكُمْ بِالْأَمْرِ فَلْيَرْكَعْ رَكْعَتَيْنِ مِنْ غَيْرِ الْفَرِيضَةِ وَلْيَقُلْ اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ وَتَعْلَمُ وَلَا أَعْلَمُ وَأَنْتَ عَلَّامُ الْغُيُوبِ اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ يُسَمِّيهِ بِعَيْنِهِ الَّذِي يُرِيدُ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَمَعَادِي وَعَاقِبَةِ أَمْرِي فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي وَبَارِكْ لِي فِيهِ اللَّهُمَّ وَإِنْ كُنْتَ تَعْلَمُهُ شَرًّا لِي مِثْلَ الْأَوَّلِ فَاصْرِفْنِي عَنْهُ وَاصْرِفْهُ عَنِّي وَاقْدِرْ لِي الْخَيْرَ حَيْثُ كَانَ ثُمَّ رَضِّنِي بِهِ أَوْ قَالَ فِي عَاجِلِ أَمْرِي وَآجِلِهِقَالَ ابْنُ مَسْلَمَةَ وَابْنُ عِيسَى عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابَرٍ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah Al Qa'nabi] dan [Abdurrahman bin Muqatil] paman Al Qa'nabi, serta [Muhammad bin Isa] dengan makna yang sama, mereka berkata; telah menceritakan kepada Kami [Abdurrahman bin Abu Al Mawal], telah menceritakan kepadaku [Muhammad bin Al Munkadir] bahwa ia mendengar [Jabir bin Abdullah], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam mengajari Kami istikharah, sebagaimana mengajari Kami sebuah surat dari Al Qur'an. Beliau berkata kepada Kami: \"Apabila salah seorang diantara kalian merasakan kesedihan maka hendaknya ia melakukan ruku' dua kali yang tidak wajib, dan mengucapkan; ALLAAHUMMA INNII ASTAKHIIRUKA BI'ILMIKA WA ASTAQDIRUKA BIQADRIKA WA AS-ALUKA MIN FADHLIKAL 'AZHIIM, FAINNAKA TAQDIRU WA LAA AQDIRU WA TA'LAMU WA LAA A'LAMU WA ANTA 'ALLAAMUL GHUYUUB, ALLAAHUMMA IN KUNTA TA'LAMU ANNAD HADZAL AMRA ……KHAIRUN LII FII DIINII WA MA'AASYII, WA MA'AADII, WA 'AAQIBATI AMRII FAQDURHU LII WA YASSIRHU LII WA BAARIK LII FIIHI. ALLAAHUMMA IN KUNTA TA'LAMUHU SYARRAN LII MITSLAL AWWALI FASHRIFNII 'ANHU WASHRIFHU 'ANNII, WAQDUR LII Al KHAIRA HAITSU KAANA TSUMMA RADHDHINII BIHI.\" (Ya Allah, aku memohon petunjukMu dengan ilmuMu, dan memohon kemampuan kepadaMu dengan kemampuanMu, serta memohon sebagian karuniaMu yang besar. Sesungguhnya Engkau mampu dan aku tidak mampu, Engkau mengetahui dan aku tidak mengetahui, dan Engkau adalah Dzat Yang Maha mengetahui. Ya Allah seandainya Engkau mengetahui bahwa bahwa perkara ini (kemudian ia menyebutkan perkara yang ia inginkan) adalah lebih baik bagiku, dalam agama, kehidupan, serta tempat kembaliku dan akibat urusanku maka tetapkanlah bagiku, dan mudahkanlah perkara tersebut untukku, serta berilah aku berkah padanya. Ya Allah, apabila Engkau mengetahui perkara tersebut buruk bagiku seperti yang pertama maka palingkanlah aku darinya dan palingkan perkara tersebut dariku, serta tetapkan bagiku segala kebaikan dimanapun berada, kemudian jadikanlah aku ridha kepadanya.) Atau berkata: \"FII 'AAJILI AMRII WA AAJILIHI.\" (dalam perkara yang segera akan datang dan akan datang.\" Hal tersebut dikatakan oleh [Ibnu Maslamah] dan [Ibnu Isa] dari [Muhammad bin Al Munkadir] dari [Jabir]."
            },
            {
                "number": 1273,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنْ خَمْسٍ مِنْ الْجُبْنِ وَالْبُخْلِ وَسُوءِ الْعُمُرِ وَفِتْنَةِ الصَّدْرِ وَعَذَابِ الْقَبْرِ",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah] telah menceritakan kepada Kami [Waki'], telah menceritakan kepada Kami [Israil] dari [Abu Ishaq] dari ['Amr bin Maimun] dari [Umar bin Al Khathab], ia berkata; Nabi Shalla Allahu 'alaihi wa sallam pernah berlindung dari lima perkara yaitu dari sifat pengecut, bakhil, umur yang jelek, fitnah hati dan adzab kubur. "
            },
            {
                "number": 1274,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ عَنْ طَاوُسٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُعَلِّمُهُمْ هَذَا الدُّعَاءَ كَمَا يُعَلِّمُهُمْ السُّورَةَ مِنْ الْقُرْآنِ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ",
                "id": "Telah menceritakan kepada Kami [Al Qa'nabi] dari [Malik] dari [Abu Az Zubair Al Makki] dari [Thawus] dari [Abdullah bin Abbas] bahwa Rasulullah shallAllahu wa'alaihi wa sallam pernah mengajari mereka doa ini sebagaimana mengajarkan kepada mereka satu surat dari Al Qur'an. Beliau mengucapkan: \"ALLAAHUMMA INNII A'UUDZU BIKA MIN 'ADZAABI JAHANNAMA WA A'UUDZU BIKA MIN 'ADZAABIL QABRI WA A'UUDZU BIKA MIN FITNATIL MASIIHID DAJJAAL, WA A'UUDZU BIKA MIN FITNATIL MAHYAA WAL MAMAAT\" (Ya Allah, aku berlindung kepadaMu dari adzab Jahannam, dan berlindung kepadaMu dari adzab kubur, dan berlindung kepadaMu dari fitnah Al Masih Ad Dajjal, serta berlindung kepadaMu dari fitnah kehidupan serta fitnah kematian.) "
            },
            {
                "number": 1275,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عِيسَى حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو بِهَؤُلَاءِ الْكَلِمَاتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ وَمِنْ شَرِّ الْغِنَى وَالْفَقْرِ",
                "id": "Telah menceritakan kepada Kami [Ibrahim bin Musa Ar Razi], telah memberitakan kepadaku [Isa] telah menceritakan kepada Kami [Hisyam] dari [ayahnya] dari [Aisyah] radliallahu 'anha bahwa Nabi shallallahu 'alaihi wasallam pernah berdoa dengan kalimat-kalimat ini, yaitu: \"ALLAAHUMMA INNII A'UUDZU BIKA MIN FITNATIN NAARI WA 'ADZAABIN NAARI, WA MIN SYARRIL GHINAA WAL FAQRI\" (Ya Allah, aku berlindung kepadaMu dari fitnah Neraka dan adzab Neraka, dari keburukan kekayaan dan kefakiran.\""
            },
            {
                "number": 1276,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا إِسْحَقُ بْنُ عَبْدِ اللَّهِ عَنْ سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْفَقْرِ وَالْقِلَّةِ وَالذِّلَّةِ وَأَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلَمَ",
                "id": "Telah menceritakan kepada Kami [Musa bin Ismail], telah menceritakan kepada Kami [Hammad], telah mengabarkan kepada Kami [Ishaq bin Abdullah] dari [Sa'id? bin Yasar] dari [Abu Hurairah] rhadhiyAllahu 'anhu bahwa Nabi shallallahu 'alaihi wasallam pernah mengucapkan: \"ALLAAHUMMA INNII A'UUDZU BIKA MINAL FAQRI WALQILLATI WADZ DZILLATI, WA A'UUDZU BIKA MIN AN AZHLIMA AU UZHLAMA\" (Ya Allah aku berlindung kepada-Mu dari kafakiran, kekurangan dan kehinaan dan aku berlindung kepada-Mu dari aku berbuat dzalim atau didzalimi). "
            },
            {
                "number": 1277,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا بَقِيَّةُ حَدَّثَنَا ضُبَارَةُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي السُّلَيْكِ عَنْ دُوَيْدِ بْنِ نَافِعٍ حَدَّثَنَا أَبُو صَالِحٍ السَّمَّانُ قَالَ قَالَ أَبُو هُرَيْرَةَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الشِّقَاقِ وَالنِّفَاقِ وَسُوءِ الْأَخْلَاقِ",
                "id": "Telah menceritakan kepada Kami ['Amr bin Utsman], telah menceritakan kepada Kami [Baqiyyah], telah menceritakan kepada Kami [Dhubarah bin Abdullah bin Abu As Sulaik] dari [Duwaid bin Nafi'], telah menceritakan kepada Kami [Abu Shalih As Samman], ia berkata; [Abu Hurairah] radliallahu 'anhu berkata; sesungguhnya Rasulullah shallAllahu wa'alaihi wa sallam pernah berdo'a: \"ALLAAHUMMA INNII A'UUDZU BIKA MINASY SYIQAAQI WAN NIFAAQI WA SUUIL AKHLAAQ\" (Ya Allah aku berlindung kepadaMu dari perpecahan dan kemunafikan serta akhlak yang jelek). "
            },
            {
                "number": 1278,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ عَنْ ابْنِ إِدْرِيسَ عَنْ ابْنِ عَجْلَانَ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْجُوعِ فَإِنَّهُ بِئْسَ الضَّجِيعُ وَأَعُوذُ بِكَ مِنْ الْخِيَانَةِ فَإِنَّهَا بِئْسَتِ الْبِطَانَةُ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Al 'Ala`] dari [Ibnu Idris] dari [Ibnu 'Ajlan] dari [Al Maqburi] dari [Abu Hurairah] radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam berdo'a: \"ALLAAHUMMA INNII A'UUDZU BIKA MINAL JUU'I, FAINNAHU BI`SADH DHAJII'U, WA A'UUDZU BIKA MINAL KHIYAANATI FAINNAHAA BI`SATIL BITHAANAH\" (Ya Allah sesungguhnya aku berlindung kepadaMu dari kelaparan, karena itu adalah seburuk-buruk teman tidur. Dan aku berlindung kepadaMu dari khianat karena itu adalah seburuk-buruk teman). "
            },
            {
                "number": 1279,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ حَدَّثَنَا الْمُعْتَمِرُ قَالَ قَالَ أَبُو الْمُعْتَمِرِ أُرَى أَنَّ أَنَسَ بْنَ مَالِكٍ حَدَّثَنَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ صَلَاةٍ لَا تَنْفَعُ وَذَكَرَ دُعَاءً آخَرَ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Al Mutawakkil], telah menceritakan kepada kami [Al Mu'tamir] ia berkata; [Abul Al Mu'tamir] berkata; aku diperlihatkan bahwa [Anas bin Malik] radliallahu 'anhu telah berkata; bahwa Rasulullah shallallahu 'alaihi wasallam berkata; \"ALLAAHUMMA INNII A'UUDZU BIKA MIN SHALAATIN LAA TANFA'\" (Ya Allah, aku berlindung kepadaMu dari sholat yang tidak bermanfaat) dan dia menyebutkan do'a yang lain. "
            },
            {
                "number": 1280,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ فَرْوَةَ بْنِ نَوْفَلٍ الْأَشْجَعِيِّ قَالَسَأَلْتُ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ عَمَّا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو بِهِ قَالَتْ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Jarir] dari [Manshur] dari [Hilal bin Yasaf] dari [Farwah bin Naufal Al Asyja'i], ia berkata; aku pernah bertanya kepada [Aisyah Ummul mukminin] mengenai doa yang diucapkan Rasulullah shallAllahu wa'alaihi wa sallam. Ia berkata; beliau pernah mengucapkan: \"ALLAAHUMMA INNII A'UUDZU BIKA MIN SYARRI MAA 'ALIMTU WA MIN SYARRI MAA LAM A'LAM\" (Ya Allah, aku berlindung kepadaMu dari keburukan apa yang aku ketahui dan dari keburukan apa yang tidak aku ketahui). "
            },
            {
                "number": 1281,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ ح و حَدَّثَنَا أَحْمَدُ حَدَّثَنَا وَكِيعٌ الْمَعْنَى عَنْ سَعْدِ بْنِ أَوْسٍ عَنْ بِلَالٍ الْعَبْسِيِّ عَنْ شُتَيْرِ بْنِ شَكَلٍ عَنْ أَبِيهِ فِي حَدِيثِ أَبِي أَحْمَدَ شَكَلِ بْنِ حُمَيْدٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ عَلِّمْنِي دُعَاءً قَالَ قُلْ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ سَمْعِي وَمِنْ شَرِّ بَصَرِي وَمِنْ شَرِّ لِسَانِي وَمِنْ شَرِّ قَلْبِي وَمِنْ شَرِّ مَنِيِّي",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Muhammad bin Hanbal], telah menceritakan kepada Kami [Muhammad bin Abdullah bin Az Zubair], dan diriwayatkan dari jalur yang lain: Telah menceritakan kepada Kami [Ahmad], telah menceritakan kepada Kami [Waki'] secara makna dar [Sa'd bin Aus] dari [Bilal Al 'Abasi] dari [Syutair bin Syakal] dari [ayahnya] -dalam hadits Abu Ahmad Syakal bin Humaid ia berkata; aku katakan; wahai Rasulullah, ajarkanlah keadaku sebuah doa! Beliau berkata: \"Katakanlah; ALLAAHUMMA INNII A'UUDZU BIKA MIN SYARRI SAM'II WA MIN SYARRI BASHARII WA MIN SYARRI LISAANII, WA MIN SYARRI QALBII, WA MIN SYARRI MANIYYII\" (Ya Allah, aku berlindung kepadaMu dari kejahatan pendengaranku, dari kejahatan pandanganku, dari kejahatan lisanku, dari kejahatan hatiku dan dari kejahatan air maniku). "
            },
            {
                "number": 1282,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا قَتَادَةُ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْبَرَصِ وَالْجُنُونِ وَالْجُذَامِ وَمِنْ سَيِّئْ الْأَسْقَامِ",
                "id": "Telah menceritakan kepada Kami [Musa bin Ismail], telah menceritakan kepada Kami [Hammad], telah mengabarkan kepada Kami [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam mengucapkan: \"ALLAAHUMMA INNII A'UUDZU BIKA MINAL BARASHI WAL JUNUUNI WAL JUDZAAMI WA MIN SAYYI-IL ASQAAM\" (Ya Allah, aku berlindung kepadaMu dari kusta, gila, lepra, dan dari penyakit yang buruk). "
            },
            {
                "number": 1283,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أَبِي هُرَيْرَةَ قَالَلَمَّا تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاسْتُخْلِفَ أَبُو بَكْرٍ بَعْدَهُ وَكَفَرَ مَنْ كَفَرَ مِنْ الْعَرَبِ قَالَ عُمَرُ بْنُ الْخَطَّابِ لِأَبِي بَكْرٍ كَيْفَ تُقَاتِلُ النَّاسَ وَقَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ فَمَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ إِلَّا بِحَقِّهِ وَحِسَابُهُ عَلَى اللَّهِ عَزَّ وَجَلَّ فَقَالَ أَبُو بَكْرٍ وَاللَّهِ لَأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلَاةِ وَالزَّكَاةِ فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ وَاللَّهِ لَوْ مَنَعُونِي عِقَالًا كَانُوا يُؤَدُّونَهُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَاتَلْتُهُمْ عَلَى مَنْعِهِ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ فَوَاللَّهِ مَا هُوَ إِلَّا أَنْ رَأَيْتُ اللَّهَ عَزَّ وَجَلَّ قَدْ شَرَحَ صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ قَالَ فَعَرَفْتُ أَنَّهُ الْحَقُّقَالَ أَبُو دَاوُد وَرَوَاهُ رَبَاحُ بْنُ زَيْدٍ وَرَوَاهُ عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ بِإِسْنَادِهِ وَقَالَ بَعْضُهُمْ عِقَالًا وَرَوَاهُ ابْنُ وَهْبٍ عَنْ يُونُسَ قَالَ عَنَاقًا قَالَ أَبُو دَاوُد قَالَ شُعَيْبُ بْنُ أَبِي حَمْزَةَ وَمَعْمَرٌ وَالزُّبَيْدِيُّ عَنْ الزُّهْرِيِّ فِي هَذَا الْحَدِيثِ لَوْ مَنَعُونِي عَنَاقًا وَرَوَى عَنْبَسَةُ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ فِي هَذَا الْحَدِيثِ قَالَ عَنَاقًا حَدَّثَنَا ابْنُ السَّرْحِ وَسُلَيْمَانُ بْنُ دَاوُدَ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ الزُّهْرِيِّ هَذَا الْحَدِيثَ قَالَ قَالَ أَبُو بَكْرٍ إِنَّ حَقَّهُ أَدَاءُ الزَّكَاةِ وَقَالَ عِقَالًا",
                "id": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id Ats Tsaqafi], telah menceritakan kepada Kami [Al Laits] dari ['Uqail] dari [Az Zuhri], telah mengabarkan kepadaku ['ubaidhullah bin Abdullah bin 'Utbah] dari [Abu Hurairah], ia berkata; tatkala Rasulullah shallAllahu wa'alaihi wa sallam meninggal dan Abu Bakr diangkat sebagai khalifah setelah beliau dan telah kafir sebagian orang Arab, [Umar bin Al Khathab] berkata kepada Abu Bakr; bagaimana engkau memerangi orang-orang tersebut padahal Rasulullah shallAllahu wa'alaihi wa sallam telah bersabda: \"Aku diperintahkan untuk memerangi manusia hingga mereka mengucapkan; LAA ILAAHA ILLALLAAH. Barang siapa yang mengucapkan; LAA ILAAHA ILLALLAAH maka ia telah melindungi dariku harga dan jiwanya kecuali dengan haknya, sedangkan perhitungannya kembali kepada Allah 'azza wajalla.\" Maka [Abu Bakr] berkata; sungguh aku akan memerangi orang yang memisahkan antara sholat dan zakat, sesungguhnya zakat adalah hak harta. Demi Allah seandainya mereka menahanku satu 'iqal yang dahulunya mereka tunaikan kepada Rasulullah shallAllahu wa'alaihi wa sallam niscaya aku akan memerangi mereka karena penolakannya. Kemudian [Umar bin Al Khathab] berkata; Demi Allah sungguh aku melihat Allah 'azza wajalla telah melapangkan dada Abu Bakr untuk memerangi orang-orang tersebut. Umar berkata; maka aku mengetahui bahwa ia adalah yang benar. Abu Daud berkata; dan hadits tersebut diriwayatkan oleh [Rabah bin Zaid], dan diriwayatkan oleh [Abdurrazzaq] dari [Ma'mar] dari [Az Zuhri] dengan sanadnya. Sebagian ulama mengatakan; 'iqal, sedangkan [Ibnu Wahb] dari [Yunus] meriwayatkannya, ia mengatakan; anak kambing. Abu Daud berkata; [Syu'aib bin Abu Hamzah] serta [Ma'mar] dan [Az Zubaidi] dari [Az Zuhri] berkata; seandainya mereka menolakku satu ekor anak kambing, sedangkan ['Anbasah] telah meriwayatkan dari [Yunus] dari [Az Zuhri] dalam hadits ini, ia berkata; anak kambing. Telah menceritakan kepada Kami [Ibnu As Sarh] dan [Sulaiman bin Daud] mereka berkata; telah mengabarkan kepada Kami [Ibnu Wahb], telah mengabarkan kepadaku [Yunus] dari [Az Zuhri] hadits ini, ia berkata; Abu Bakr berkata; sesungguhnya haknya adalah menunaikan zakat. Dan ia menyebutkan; 'iqal."
            },
            {
                "number": 1284,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ قَالَ قَرَأْتُ عَلَى مَالِكِ بْنِ أَنَسٍ عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ عَنْ أَبِيهِ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah], ia berkata; saya membacakan riwayat kepada [Malik bin Anas] dari ['Amr bin Yahya Al Mazini] dari [ayahnya], ia berkata; saya mendengar [Abu Sa'id Al Khudri] berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Tidak ada zakat pada unta yang kurang dari lima dzaud (dzaud adalah antara tiga hingga sepuluh), tidak ada zakat pada perak yang kurang dari lima uqiyah, dan tidak ada zakat pada buah-buahan yang kurang dari lima wasaq.\""
            },
            {
                "number": 1285,
                "arab": "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الرَّقِّيُّ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا إِدْرِيسُ بْنُ يَزِيدَ الْأَوْدِيُّ عَنْ عَمْرِو بْنِ مُرَّةَ الْجَمَلِيِّ عَنْ أَبِي الْبَخْتَرِيِّ الطَّائِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّيَرْفَعُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ زَكَاةٌ وَالْوَسْقُ سِتُّونَ مَخْتُومًاقَالَ أَبُو دَاوُد أَبُو الْبَخْتَرِيُّ لَمْ يَسْمَعْ مِنْ أَبِي سَعِيدٍ حَدَّثَنَا مُحَمَّدُ بْنُ قُدَامَةَ بْنِ أَعْيَنَ حَدَّثَنَا جَرِيرٌ عَنْ الْمُغِيرَةِ عَنْ إِبْرَاهِيمَ قَالَ الْوَسْقُ سِتُّونَ صَاعًا مَخْتُومًا بِالْحَجَّاجِيِّ",
                "id": "Telah menceritakan kepada Kami [Ayyub bin Muhammad Ar Raqi], telah menceritakan kepada Kami [Muhammad bin 'Ubaid], telah menceritakan kepada Kami [Idris bin Yazid Al Audi] dari ['Amr bin Murrah Al Hamali] dari [Abu Al Bakhtari Ath Thai] dari [Abu Sa'id Al Khudri] dan ia mengangkat hadits tersebut hingga sampai kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada zakat pada buah-buahan yang kurang dari lima wasaq, dan satu wasaq adalah enam puluh sha'.\" Abu Daud berkata; Abu Al Bakhtari tidak mendengar dari Abu Sa'id. Telah menceritakan kepada Kami Muhammad bin Qudamah bin A'yan, telah menceritakan kepada Kami Jarir dari Al Mughirah dari Ibrahim, ia berkata; satu wasaq adalah enam puluh sha' yang distempel dengan tanda Al Hajjaj."
            },
            {
                "number": 1286,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ حَدَّثَنَا صُرَدُ بْنُ أَبِي الْمَنَازِلِ قَالَ سَمِعْتُ حَبِيبًا الْمَالِكِيَّ قَالَقَالَ رَجُلٌ لِعِمْرَانَ بْنِ حُصَيْنٍ يَا أَبَا نُجَيْدٍ إِنَّكُمْ لَتُحَدِّثُونَنَا بِأَحَادِيثَ مَا نَجِدُ لَهَا أَصْلًا فِي الْقُرْآنِ فَغَضِبَ عِمْرَانُ وَقَالَ لِلرَّجُلِ أَوَجَدْتُمْ فِي كُلِّ أَرْبَعِينَ دِرْهَمًا دِرْهَمٌ وَمِنْ كُلِّ كَذَا وَكَذَا شَاةً شَاةٌ وَمِنْ كُلِّ كَذَا وَكَذَا بَعِيرًا كَذَا وَكَذَا أَوَجَدْتُمْ هَذَا فِي الْقُرْآنِ قَالَ لَا قَالَ فَعَنْ مَنْ أَخَذْتُمْ هَذَا أَخَذْتُمُوهُ عَنَّا وَأَخَذْنَاهُ عَنْ نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَكَرَ أَشْيَاءَ نَحْوَ هَذَا",
                "id": "Telah menceritakan kepada Kami [Muhamad bin Basysyar] telah menceritakan kepadaku [Muhammad bin Abdullah Al Anshari], telah menceritakan kepada Kami [Shurad bin Abu Al Manazil], ia berkata; saya mendengar [Habib Al Maliki] berkata; seorang laki-laki berkata kepada 'Imran bin Hushain; wahai Abu Nujaid, sesungguhnya kalian telah menceritakan kepada Kami dengan hadits-hadits yang tidak Kami dapatkan dasarnya dalam Al Qur'an! Maka [Imran] berkata kepada orang tersebut; apakah kalian dapatkan dalam setiap empat puluh dirham terdapat zakat satu dirham, dan dalam setiap sekian kambing zakat satu kambing, dan dalam setiap sekian unta zakat sekian dan sekian unta, apakah kalian mendapatkannya dalam Al Qur'an? Orang tersebut menjawab: tidak! Imran berkata lagi: jadi, dari siapa kalian mengambilnya? Kalian mengambilnya dari Kami dan Kami mengambilnya dari Nabi Shalla Allahu 'alaihi wa sallam. Dan dia menyebutkan perkara-perkara lain seperti ini. "
            },
            {
                "number": 1287,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ بْنِ سُفْيَانَ حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سُلَيْمَانُ بْنُ مُوسَى أَبُو دَاوُدَ حَدَّثَنَا جَعْفَرُ بْنُ سَعْدِ بْنِ سَمُرَةَ بْنِ جُنْدُبٍ حَدَّثَنِي خُبَيْبُ بْنُ سُلَيْمَانَ عَنْ أَبِيهِ سُلَيْمَانَ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ قَالَأَمَّا بَعْدُ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُنَا أَنْ نُخْرِجَ الصَّدَقَةَ مِنْ الَّذِي نُعِدُّ لِلْبَيْعِ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Daud bin Sufyan], telah menceritakan kepada Kami [Yahya bin Hassan], telah menceritakan kepada Kami [Sulaiman bin Musa Abu Daud], telah menceritakan kepada Kami [Ja'far bin Sa'd bin Samurah bin Jundab bin Sulaiman] telah menceritakan kepadaku [Hubaib bin Sulaiman] dari [ayahnya yaitu Sulaiman] dari [Samurah bin Jundab], ia berkata; adapun selanjutnya, sesungguhnya Rasulullah shallallahu 'alaihi wasallam memerintahkan Kami untuk mengeluarkan zakat dari sesuatu yang Kami persiapkan untuk dijual. "
            },
            {
                "number": 1288,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ وَحُمَيْدُ بْنُ مَسْعَدَةَ الْمَعْنَى أَنَّ خَالِدَ بْنَ الْحَارِثِ حَدَّثَهُمْ حَدَّثَنَا حُسَيْنٌ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ امْرَأَةً أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهَا ابْنَةٌ لَهَا وَفِي يَدِ ابْنَتِهَا مَسَكَتَانِ غَلِيظَتَانِ مِنْ ذَهَبٍ فَقَالَ لَهَا أَتُعْطِينَ زَكَاةَ هَذَا قَالَتْ لَا قَالَ أَيَسُرُّكِ أَنْ يُسَوِّرَكِ اللَّهُ بِهِمَا يَوْمَ الْقِيَامَةِ سِوَارَيْنِ مِنْ نَارٍ قَالَ فَخَلَعَتْهُمَا فَأَلْقَتْهُمَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَتْ هُمَا لِلَّهِ عَزَّ وَجَلَّ وَلِرَسُولِهِ",
                "id": "Telah menceritakan kepada Kami [Abu Kamil] dan [Humaid bin Mas'adah] secara makna bahwa [Khalid bin Al Harits] telah menceritakan kepada mereka; telah menceritakan kepada Kami [Husain] dari ['Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa seorang wanita datang kepada Rasulullah shallAllahu wa'alaihi wa sallam membawa anak wanitanya, dan di tangan anak wanita tersebut terdapat dua gelang tebal yang terbuat dari emas, kemudian beliau berkata kepadanya: \"Apakah engkau memberikan zakat emas ini?\" Wanita tersebut berkata; tidak. Beliau bersabda: \"Apakah engkau senang karena kedua gelang tersebut Allah memberimu gelang dari api pada Hari Kiamat?\" Khalid berkata; kemudian wanita tersebut melepas kedua gelang tersebut dan melemparkannya kepada Nabi shallallahu 'alaihi wasallam dan berkata; kedua gelang itu untuk Allah 'azza wajalla dan rasulNya. "
            },
            {
                "number": 1289,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا عَتَّابٌ يَعْنِي ابْنَ بَشِيرٍ عَنْ ثَابِتِ بْنِ عَجْلَانَ عَنْ عَطَاءٍ عَنْ أُمِّ سَلَمَةَ قَالَتْكُنْتُ أَلْبَسُ أَوْضَاحًا مِنْ ذَهَبٍ فَقُلْتُ يَا رَسُولَ اللَّهِ أَكَنْزٌ هُوَ فَقَالَ مَا بَلَغَ أَنْ تُؤَدَّى زَكَاتُهُ فَزُكِّيَ فَلَيْسَ بِكَنْزٍ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Isa], telah menceritakan kepada Kami ['Attab yaitu Ibnu Basyir] dari [Tsabit bin 'Ajlan] dari ['Atha`] dari [Ummu Salamah], ia berkata; aku mengenakan perhiasan dari emas, lalu aku bertanya; wahai Rasulullah, apakah ini termasuk barang timbunan? Beliau menjawab: \"Apa yang sudah mencapai nishabnya untuk dizakati kemudian telah dikeluarkan zakatnya maka bukanlah termasuk barang timbunan.\""
            },
            {
                "number": 1290,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِدْرِيسَ الرَّازِيُّ حَدَّثَنَا عَمْرُو بْنُ الرَّبِيعِ بْنِ طَارِقٍ حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ أَنَّ مُحَمَّدَ بْنَ عَمْرِو بْنِ عَطَاءٍ أَخْبَرَهُ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادِ بْنِ الْهَادِ أَنَّهُ قَالَدَخَلْنَا عَلَى عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَى فِي يَدَيَّ فَتَخَاتٍ مِنْ وَرِقٍ فَقَالَ مَا هَذَا يَا عَائِشَةُ فَقُلْتُ صَنَعْتُهُنَّ أَتَزَيَّنُ لَكَ يَا رَسُولَ اللَّهِ قَالَ أَتُؤَدِّينَ زَكَاتَهُنَّ قُلْتُ لَا أَوْ مَا شَاءَ اللَّهُ قَالَ هُوَ حَسْبُكِ مِنْ النَّارِحَدَّثَنَا صَفْوَانُ بْنُ صَالِحٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا سُفْيَانُ عَنْ عُمَرَ بْنِ يَعْلَى فَذَكَرَ الْحَدِيثَ نَحْوَ حَدِيثِ الْخَاتَمِ قِيلَ لِسُفْيَانَ كَيْفَ تُزَكِّيهِ قَالَ تَضُمُّهُ إِلَى غَيْرِهِ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Idris Ar Razi], telah menceritakan kepada Kami ['Amr bin Ar Rabi' bin Thariq], telah menceritakan kepada Kami [Yahya bin Ayyub] dari ['ubaidhullah bin Abu Ja'far] bahwa [Muhammad bin 'Amr bin 'Atha`] telah mengabarkan kepadanya dari [Abdullah bin Syaddad bin Al Had] bahwa ia berkata; Kami menemui [Aisyah] istri Nabi shalla Allahu 'alaihi wa sallam, lalu ia berkata; Rasulullah shallallahu 'alaihi wasallam menemuiku dan melihat ditanganku ada cincin dari perak, lalu beliau berkata: \"Apakah ini wahai Aisyah?\" Aku menjawab; aku menggunakannya untuk berhias di hadapanmu. Beliau berkata: \"Apakah kamu mengeluarkan zakatnya?\" Aku menjawab: tidak! -atau- maasyaa Allah! Beliau berkata: Itu adalah bagianmu dari Neraka!\" Telah menceritakan kepada Kami [Shafwan bin Shalih], telah menceritakan kepada Kami [Al Walid bin Muslim], telah menceritakan kepada Kami [Sufyan] dari [Umar bin Ya'la], kemudian ia menyebutkan hadits seperti hadits mengenai cincin. Sufyan ditanya; bagaimana engkau menzakatinya? Dia menjawab; engkau gabungkan dengan yang lain. "
            },
            {
                "number": 1291,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ قَالَأَخَذْتُ مِنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَنَسٍ كِتَابًا زَعَمَ أَنَّ أَبَا بَكْرٍ كَتَبَهُ لِأَنَسٍ وَعَلَيْهِ خَاتِمُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ بَعَثَهُ مُصَدِّقًا وَكَتَبَهُ لَهُ فَإِذَا فِيهِ هَذِهِ فَرِيضَةُ الصَّدَقَةِ الَّتِي فَرَضَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمُسْلِمِينَ الَّتِي أَمَرَ اللَّهُ عَزَّ وَجَلَّ بِهَا نَبِيَّهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَنْ سُئِلَهَا مِنْ الْمُسْلِمِينَ عَلَى وَجْهِهَا فَلْيُعْطِهَا وَمَنْ سُئِلَ فَوْقَهَا فَلَا يُعْطِهِ فِيمَا دُونَ خَمْسٍ وَعِشْرِينَ مِنْ الْإِبِلِ الْغَنَمُ فِي كُلِّ خَمْسِ ذَوْدٍ شَاةٌ فَإِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ فَفِيهَا بِنْتُ مَخَاضٍ إِلَى أَنْ تَبْلُغَ خَمْسًا وَثَلَاثِينَ فَإِنْ لَمْ يَكُنْ فِيهَا بِنْتُ مَخَاضٍ فَابْنُ لَبُونٍ ذَكَرٌ فَإِذَا بَلَغَتْ سِتًّا وَثَلَاثِينَ فَفِيهَا بِنْتُ لَبُونٍ إِلَى خَمْسٍ وَأَرْبَعِينَ فَإِذَا بَلَغَتْ سِتًّا وَأَرْبَعِينَ فَفِيهَا حِقَّةٌ طَرُوقَةُ الْفَحْلِ إِلَى سِتِّينَ فَإِذَا بَلَغَتْ إِحْدَى وَسِتِّينَ فَفِيهَا جَذَعَةٌ إِلَى خَمْسٍ وَسَبْعِينَ فَإِذَا بَلَغَتْ سِتًّا وَسَبْعِينَ فَفِيهَا ابْنَتَا لَبُونٍ إِلَى تِسْعِينَ فَإِذَا بَلَغَتْ إِحْدَى وَتِسْعِينَ فَفِيهَا حِقَّتَانِ طَرُوقَتَا الْفَحْلِ إِلَى عِشْرِينَ وَمِائَةٍ فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ فَفِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ وَفِي كُلِّ خَمْسِينَ حِقَّةٌ فَإِذَا تَبَايَنَ أَسْنَانُ الْإِبِلِ فِي فَرَائِضِ الصَّدَقَاتِ فَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْجَذَعَةِ وَلَيْسَتْ عِنْدَهُ جَذَعَةٌ وَعِنْدَهُ حِقَّةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ وَأَنْ يَجْعَلَ مَعَهَا شَاتَيْنِ إِنْ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ حِقَّةٌ وَعِنْدَهُ جَذَعَةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَلَيْسَ عِنْدَهُ حِقَّةٌ وَعِنْدَهُ ابْنَةُ لَبُونٍ فَإِنَّهَا تُقْبَلُقَالَ أَبُو دَاوُد مِنْ هَاهُنَا لَمْ أَضْبِطْهُ عَنْ مُوسَى كَمَا أُحِبُّ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنْ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ بِنْتِ لَبُونٍ وَلَيْسَ عِنْدَهُ إِلَّا حِقَّةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ قَالَ أَبُو دَاوُد إِلَى هَاهُنَا ثُمَّ أَتْقَنْتُهُ وَيُعْطِيهِ الْمُصَدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ ابْنَةِ لَبُونٍ وَلَيْسَ عِنْدَهُ إِلَّا بِنْتُ مَخَاضٍ فَإِنَّهَا تُقْبَلُ مِنْهُ وَشَاتَيْنِ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ ابْنَةِ مَخَاضٍ وَلَيْسَ عِنْدَهُ إِلَّا ابْنُ لَبُونٍ ذَكَرٌ فَإِنَّهُ يُقْبَلُ مِنْهُ وَلَيْسَ مَعَهُ شَيْءٌ وَمَنْ لَمْ يَكُنْ عِنْدَهُ إِلَّا أَرْبَعٌ فَلَيْسَ فِيهَا شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا وَفِي سَائِمَةِ الْغَنَمِ إِذَا كَانَتْ أَرْبَعِينَ فَفِيهَا شَاةٌ إِلَى عِشْرِينَ وَمِائَةٍ فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ فَفِيهَا شَاتَانِ إِلَى أَنْ تَبْلُغَ مِائَتَيْنِ فَإِذَا زَادَتْ عَلَى مِائَتَيْنِ فَفِيهَا ثَلَاثُ شِيَاهٍ إِلَى أَنْ تَبْلُغَ ثَلَاثَ مِائَةٍ فَإِذَا زَادَتْ عَلَى ثَلَاثِ مِائَةٍ فَفِي كُلِّ مِائَةِ شَاةٍ شَاةٌ وَلَا يُؤْخَذُ فِي الصَّدَقَةِ هَرِمَةٌ وَلَا ذَاتُ عَوَارٍ مِنْ الْغَنَمِ وَلَا تَيْسُ الْغَنَمِ إِلَّا أَنْ يَشَاءَ الْمُصَدِّقُ وَلَا يُجْمَعُ بَيْنَ مُفْتَرِقٍ وَلَا يُفَرَّقُ بَيْنَ مُجْتَمِعٍ خَشْيَةَ الصَّدَقَةِ وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ فَإِنْ لَمْ تَبْلُغْ سَائِمَةُ الرَّجُلِ أَرْبَعِينَ فَلَيْسَ فِيهَا شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا وَفِي الرِّقَةِ رُبْعُ الْعُشْرِ فَإِنْ لَمْ يَكُنْ الْمَالُ إِلَّا تِسْعِينَ وَمِائَةً فَلَيْسَ فِيهَا شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا",
                "id": "Telah menceritakan kepada Kami [Musa bin Ismail], telah menceritakan kepada Kami [Hammad], ia berkata; aku mengambil sebuah tulisan dari [Tsumamah bin Abdullah bin Anas], ia mengaku bahwa [Abu Bakar] telah menulis [Anas] dan padanya terdapat stempel Rasulullah shallAllahu wa'alaihi wa sallam ketika ia mengutusnya sebagai petugas pengambil zakat, dan ia menulis untuknya, dan ternyata tulisan tersebut berisi: Ini adalah kewajiban zakat yang telah diwajibkan Rasulullah shallAllahu wa'alaihi wa sallam kepada orang-orang muslim yang telah Allah 'azza wajalla perintahkan kepada NabiNya shallallahu 'alaihi wasallam. Maka barangsiapa diantara orang-orang muslim yang diminta zakatnya sesuai dengan ketentuannya, maka hendaknya ia memberikannya. Dan barang siapa yang diminta lebih dari itu maka janganlah ia memberinya. Unta yang kurang dari dua puluh lima zakatnya adalah satu ekor kambing, setiap lima dzaud terdapat zakat satu ekor kambing, kemudian apabila telah mencapai dua puluh lima ekor maka padanya terdapat zakat satu ekor bintu makhadh hingga menjacapai tiga puluh lima, apabila tidak ada bintu makhadh maka ibnu labun (yang memiliki umur dua tahun) jantan, kemudian apabila telah mencapai tiga puluh enam maka padanya zakat bintu labun (yang memiliki umur dua tahun) hingga mencapai empat puluh lima, kemudian apabila telah mencapai empat puluh enam maka padanya hiqqah (yang memiliki umur tiga tahun) yang siap untuk hamil, hingga mencapai enam puluh. Kemudian apabila enam puluh satu maka padanya terdapat zakat tujuh puluh lima. Kemudian apabila telah mencapai tujuh puluh enam maka padanya zakat dua bintu labun (yang memiliki umur dua tahun), hingga mencapai sembilan puluh, kemudian apabila telah mencapai sembilan puluh satu maka padanya zakat dua ekor Hiqqah (yang memiliki umur tiga tahun) yang siap hamil, hingga mencapai seratus dua puluh. Kemudian apabila melebihi seratus dua puluh maka pada setiap empat puluh terdapat zakat satu ekor bintu labun (yang memiliki umur dua tahun), dan pada setiap lima puluh terdapat zakat satu ekor hiqqah (yang memiliki umur tiga tahun). Kemudian apabila telah nampak umur-umur unta dalam zakat-zakat wajib, maka barang siapa yang telah sampai padanya zakat jadza'ah (yang memiliki umur empat tahun) dan ia tidak memiliki jadza'ah (yang memiliki umur empat tahun) akan tetapi memiliki hiqqah (yang memiliki umur tiga tahun) maka diterima darinya, dan bersamanya ia memberikan dua ekor kambing apabila keduanya mudah baginya, uang atau dua puluh dirham. Dan barang siapa yang telah sampai padanya zakat hiqqah (yang memiliki umur tiga tahun) dan ia tidak memiliki hiqqah (yang memiliki umur tiga tahun) akan tetapi memiliki jadza'ah (yang memiliki umur empat tahun) maka diterima darinya dan petugas zakat memberinya uang dua puluh dirham, atau dua ekor kambing. Dan barang siapa yang telah sampai padanya zakat hiqqah (yang memiliki umur tiga tahun) dan ia tidak memiliki hiqqah (yang memiliki umur tiga tahun) akan tetapi memiliki bintu labun (yang memiliki umur dua tahun) maka diterima darinya. -Abu Daud berkata; dari sini aku tidak hafal dari Musa sebagaimana yang aku inginkan. - dan bersamanya ia memberikan dua ekor kambing apabila keduanya mudah baginya, atau dua puluh dirham. Dan barang siapa yang telah sampai padanya zakat bintu labun (yang memiliki umur dua tahun) dan ia hanya memiliki hiqqah (yang memiliki umur tiga tahun) maka diterima darinya -Abu Daud berkata; hingga sini kemudian aku meyakininya ia berkata; dan petugas pengambil zakat memberinya uang dua puluh dirham, atau dua ekor kambing. Dan barang siapa yang sampai padanya zakat bintu labun (yang memiliki umur dua tahun) dan ia hanya memiliki bintu makhadh maka diterima darinya disertai dengan dua ekor kambing atau uang dua dirham. Dna brang siapa yang telah sampai (nishab) zakat bintu makhadh dan ia hanya memiliki ibnu labun (yang memiliki umur dua tahun) jantan, maka diterima darinya dan tidak disertai dengan apapun. Dan barang siapa yang hanya memiliki dua ekor maka tidak ada zakat padanya kecuali pemiliknya menginginkannya. Pada kambing yang digembala di padang rumput apabila berjumlah empat puluh maka padanya zakat satu ekor kambing hingga seratus dua puluh ekor, kemudian apabila melebihi seratus dua puluh maka padanya zakat dua ekor kambing hingga mencapai dua ratus ekor. Kemudian apabila melebihi dua ratus ekor maka padanya terdapat zkaat tiga ekor kambing hingga mencapai tiga ratus, kemudian apabila telah melebihi tiga ratus ekor maka setiap seratus kambing terdapat zakat satu ekor kambing. Dan dalam zakat tidak diambil kambing yang tua dan telah tanggal gigi-giginya, kambing yang memiliki aib, dan kambing pejantan, kecuali petugas pengambil zakat menghendakinya. Tidak boleh digambungkan antara kambing yang dipisahkan dan tidak boleh dipisahkan antara kambing yang digabungkan karena khawatir wajib mengeluarkan zakat. Kambing yang berasal dari gabungan dua orang maka keduanya membagi dengan sama. Kemudian apabila kambing yang digembalakan di padang rumput tidak mencapai empat puluh ekor maka tidak ada zakat padanya kecuali pemiliknya menghendakinya. Pada perak terdapat zakat seperempat puluh, kemudian apabila harta tersebut hanya mencapai seratus sembilan puluh maka tidak ada zakat padanya kecuali pemiliknya menghendakinya. "
            },
            {
                "number": 1292,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ عَنْ سُفْيَانَ بْنِ الْحُسَيْنِ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَكَتَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كِتَابَ الصَّدَقَةِ فَلَمْ يُخْرِجْهُ إِلَى عُمَّالِهِ حَتَّى قُبِضَ فَقَرَنَهُ بِسَيْفِهِ فَعَمِلَ بِهِ أَبُو بَكْرٍ حَتَّى قُبِضَ ثُمَّ عَمِلَ بِهِ عُمَرُ حَتَّى قُبِضَ فَكَانَ فِيهِ فِي خَمْسٍ مِنْ الْإِبِلِ شَاةٌ وَفِي عَشْرٍ شَاتَانِ وَفِي خَمْسَ عَشْرَةَ ثَلَاثُ شِيَاهٍ وَفِي عِشْرِينَ أَرْبَعُ شِيَاهٍ وَفِي خَمْسٍ وَعِشْرِينَ ابْنَةُ مَخَاضٍ إِلَى خَمْسٍ وَثَلَاثِينَ فَإِنْ زَادَتْ وَاحِدَةً فَفِيهَا ابْنَةُ لَبُونٍ إِلَى خَمْسٍ وَأَرْبَعِينَ فَإِذَا زَادَتْ وَاحِدَةً فَفِيهَا حِقَّةٌ إِلَى سِتِّينَ فَإِذَا زَادَتْ وَاحِدَةً فَفِيهَا جَذَعَةٌ إِلَى خَمْسٍ وَسَبْعِينَ فَإِذَا زَادَتْ وَاحِدَةً فَفِيهَا ابْنَتَا لَبُونٍ إِلَى تِسْعِينَ فَإِذَا زَادَتْ وَاحِدَةً فَفِيهَا حِقَّتَانِ إِلَى عِشْرِينَ وَمِائَةٍ فَإِنْ كَانَتْ الْإِبِلُ أَكْثَرَ مِنْ ذَلِكَ فَفِي كُلِّ خَمْسِينَ حِقَّةٌ وَفِي كُلِّ أَرْبَعِينَ ابْنَةُ لَبُونٍ وَفِي الْغَنَمِ فِي كُلِّ أَرْبَعِينَ شَاةً شَاةٌ إِلَى عِشْرِينَ وَمِائَةٍ فَإِنْ زَادَتْ وَاحِدَةً فَشَاتَانِ إِلَى مِائَتَيْنِ فَإِنْ زَادَتْ وَاحِدَةً عَلَى الْمِائَتَيْنِ فَفِيهَا ثَلَاثُ شِيَاهٍ إِلَى ثَلَاثِ مِائَةٍ فَإِنْ كَانَتْ الْغَنَمُ أَكْثَرَ مِنْ ذَلِكَ فَفِي كُلِّ مِائَةِ شَاةٍ شَاةٌ وَلَيْسَ فِيهَا شَيْءٌ حَتَّى تَبْلُغَ الْمِائَةَ وَلَا يُفَرَّقُ بَيْنَ مُجْتَمِعٍ وَلَا يُجْمَعُ بَيْنَ مُتَفَرِّقٍ مَخَافَةَ الصَّدَقَةِ وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ وَلَا يُؤْخَذُ فِي الصَّدَقَةِ هَرِمَةٌ وَلَا ذَاتُ عَيْبٍقَالَ و قَالَ الزُّهْرِيُّ إِذَا جَاءَ الْمُصَدِّقُ قُسِّمَتْ الشَّاءُ أَثْلَاثًا ثُلُثًا شِرَارًا وَثُلُثًا خِيَارًا وَثُلُثًا وَسَطًا فَأَخَذَ الْمُصَدِّقُ مِنْ الْوَسَطِ وَلَمْ يَذْكُرْ الزُّهْرِيُّ الْبَقَرَ حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ الْوَاسِطِيُّ أَخْبَرَنَا سُفْيَانُ بْنُ حُسَيْنٍ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ فَإِنْ لَمْ تَكُنْ ابْنَةُ مَخَاضٍ فَابْنُ لَبُونٍ وَلَمْ يَذْكُرْ كَلَامَ الزُّهْرِيِّ حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَخْبَرَنَا ابْنُ الْمُبَارَكِ عَنْ يُونُسَ بْنِ يَزِيدَ عَنْ ابْنِ شِهَابٍ قَالَ هَذِهِ نُسْخَةُ كِتَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي كَتَبَهُ فِي الصَّدَقَةِ وَهِيَ عِنْدَ آلُ عُمَرَ بْنِ الْخَطَّابِ قَالَ ابْنُ شِهَابٍ أَقْرَأَنِيهَا سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ فَوَعَيْتُهَا عَلَى وَجْهِهَا وَهِيَ الَّتِي انْتَسَخَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ مِنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ وَسَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ فَذَكَرَ الْحَدِيثَ قَالَ فَإِذَا كَانَتْ إِحْدَى وَعِشْرِينَ وَمِائَةً فَفِيهَا ثَلَاثُ بَنَاتِ لَبُونٍ حَتَّى تَبْلُغَ تِسْعًا وَعِشْرِينَ وَمِائَةً فَإِذَا كَانَتْ ثَلَاثِينَ وَمِائَةً فَفِيهَا بِنْتَا لَبُونٍ وَحِقَّةٌ حَتَّى تَبْلُغَ تِسْعًا وَثَلَاثِينَ وَمِائَةً فَإِذَا كَانَتْ أَرْبَعِينَ وَمِائَةً فَفِيهَا حِقَّتَانِ وَبِنْتُ لَبُونٍ حَتَّى تَبْلُغَ تِسْعًا وَأَرْبَعِينَ وَمِائَةً فَإِذَا كَانَتْ خَمْسِينَ وَمِائَةً فَفِيهَا ثَلَاثُ حِقَاقٍ حَتَّى تَبْلُغَ تِسْعًا وَخَمْسِينَ وَمِائَةً فَإِذَا كَانَتْ سِتِّينَ وَمِائَةً فَفِيهَا أَرْبَعُ بَنَاتِ لَبُونٍ حَتَّى تَبْلُغَ تِسْعًا وَسِتِّينَ وَمِائَةً فَإِذَا كَانَتْ سَبْعِينَ وَمِائَةً فَفِيهَا ثَلَاثُ بَنَاتِ لَبُونٍ وَحِقَّةٌ حَتَّى تَبْلُغَ تِسْعًا وَسَبْعِينَ وَمِائَةً فَإِذَا كَانَتْ ثَمَانِينَ وَمِائَةً فَفِيهَا حِقَّتَانِ وَابْنَتَا لَبُونٍ حَتَّى تَبْلُغَ تِسْعًا وَثَمَانِينَ وَمِائَةً فَإِذَا كَانَتْ تِسْعِينَ وَمِائَةً فَفِيهَا ثَلَاثُ حِقَاقٍ وَبِنْتُ لَبُونٍ حَتَّى تَبْلُغَ تِسْعًا وَتِسْعِينَ وَمِائَةً فَإِذَا كَانَتْ مِائَتَيْنِ فَفِيهَا أَرْبَعُ حِقَاقٍ أَوْ خَمْسُ بَنَاتِ لَبُونٍ أَيُّ السِّنَّيْنِ وُجِدَتْ أُخِذَتْ وَفِي سَائِمَةِ الْغَنَمِ فَذَكَرَ نَحْوَ حَدِيثِ سُفْيَانَ بْنِ حُسَيْنٍ وَفِيهِ وَلَا يُؤْخَذُ فِي الصَّدَقَةِ هَرِمَةٌ وَلَا ذَاتُ عَوَارٍ مِنْ الْغَنَمِ وَلَا تَيْسُ الْغَنَمِ إِلَّا أَنْ يَشَاءَ الْمُصَدِّقُ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada Kami ['Abbad bin Al 'Awwam] dari [Sufyan bin Al Husain] dari [Az Zuhri] dari [Salim] dari [ayahnya], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam telah menulis catatan mengenai zakat dan beliau tidak mengeluarkannya kepada para pegawainya hingga beliau meninggal. Beliau menyertakan pada pedangnya. Kemudian Abu Bakr melaksanakannya hingga ia meninggal, kemudian dilaksanakan oleh Umar hingga ia meninggal. Catatan tersebut berisi: Pada lima ekor unta terdapat zakat satu ekor kambing, dan pada sepuluh ekor terdapat zakat dua ekor kambing, pada lima belas ekor unta terdapat zakat tiga ekor kambing, pada dua puluh ekor unta terdapat empat ekor kambing, pada dua puluh lima ekor unta terdapat zakat satu ekor bintu makhadh hingga tiga puluh lima ekor, kemudian apabila lebih satu maka padanya terdapat zakat satu ekor bintu labun (yang memiliki umur dua tahun) hingga empat puluh lima ekor, kemudian apabila lebih satu maka padanya terdapat zakat satu ekor hiqqah (yang memiliki umur tiga tahun) hingga enam ekor, kemudian apabila lebih satu ekor maka padanya terdapat zakat satu ekor jadza'ah (yang memiliki umur empat tahun) hingga tujuh puluh lima ekor, kemudian apabila lebih satu ekor maka padanya terdapat zakat dua ekor bintu labun (yang memiliki umur dua tahun), hingga sembilan puluh ekor, kemudian apabila lebih satu ekor maka padanya terdapat zakat dua ekor hiqqah (yang memiliki umur tiga tahun), hingga seratus dua puluh ekor. Kemudian apabila lebih banyak dari itu maka pada setiap lima puluh ekor terdapat zakat satu ekor hiqqah (yang memiliki umur tiga tahun), dan pada setiap empat ekor terdapat zakat satu ekor bintu labun (yang memiliki umur dua tahun). Pada kambing setiap empat puluh ekor kambing terdapat zakat satu kambing, hingga seratus dua puluh ekor kambing. Kemudian apabila lebih satu ekor maka padanya terdapat zakat dua ekor kambing, hingga dua ratus ekor. Kemudian apabila satu ekor melebihi dua ratus ekor maka padanya terdapat zakat tiga ekor kambing, hingga tiga ratus ekor, kemudian apabila kambing tersebut lebih dari itu, maka pada setiap seratus ekor terdapat zakat satu ekor kambing, dan padanya tidak terdapat zakat hingga mencapai seratus ekor. Dan tidak dipisahkan antara kambing yang digabungkan dan tidak digabungkan antara kambing yang terpisah karena khawatir wajib zakat. Dan kambing yang berasal dari gabungan dua orang maka keduanya membagi dengan sama. Tidak diambil dalam zakat kambing yang sudah tua dan tanggal giginya, serta kambing yang memiliki aib. 'Abbad bin Al 'Awwam berkata; Az Zuhri berkata; apabila petugas zakat telah datang maka kambing dibagi menjadi tiga, seperti tiga adalah kambing jelek, sepertiga kambing pilihan, dan sepertiga kambing pertengahan. Kemudian petugas zakat mengambil dari kambing yang pertengahan, dan Az Zuhri tidak menyebutkan sapi. Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Muhammad bin Yazid Al Wasithi], telah mengabarkan kepada Kami [Sufyan bin Husain] dengan sanad dan maknanya, ia berkata; apabila tidak ada bintu makhadh, maka dikeluarkan ibnu labun (yang memiliki umur dua tahun). Dan ia tidak menyebutkan perkataan Az Zuhri. Telah menceritakan kepada Kami [Muhammad bin Al 'Ala`], telah mengabarkan kepada Kami [Ibnu Al Mubarak] dari [Yunus bin Yazid] dari [Ibnu Syihab], ia berkata; ini adalah naskah catatan Rasulullah shallAllahu wa'alaihi wa sallam yang beliau tulis mengenai zakat, dan naskah tersebut ada pada keluarga Umar bin Al Khathab. Ibnu Syihab berkata; Salim bin Abdullah bin Umar telah membacakannya kepadaku, kemudian aku menghafalnya sesuai dengan keandaanya, dan naskah itu yang disalin oleh Umar bin Abdul 'Aziz dari Abdullah bin Abdullah bin Umar, serta Salim bin Abdullah bin Umar. Kemudian ia menyebutkan hadits tersebut, ia berkata; apabila berjumlah seratus dua puluh satu maka padanya terdapat zakat tiga bintu labun (yang memiliki umur dua tahun), hingga mencapai seratus dua puluh sembilan. Kemudian apabila berjumlah seratus tiga puluh maka padanya terdapat zakat dua bintu labun (yang memiliki umur dua tahun), dan satu ekor hiqqah (yang memiliki umur tiga tahun), hingga mencapai seratus sembilan puluh sembilan. Kemudian apabila berjumlah seratus empat puluh maka padanya terdapat zakat dua hiqqah (yang memiliki umur tiga tahun) dan satu bintu labun (yang memiliki umur dua tahun), hingga mencapai seratus empat puluh sembilan. Kemudian apabila berjumlah seratus lima puluh maka padanya terdapat zakat tiga hiqqah (yang memiliki umur tiga tahun), hingga mencapai seratus lima puluh sembilan. Kemudian apabila berjumlah seratus sembilan puluh maka padanya terdapat zakat empat bintu labun (yang memiliki umur dua tahun), hingga mencapai seratus enam puluh sembilan. Kemudian apabila berjumlah seratus tujuh puluh maka padanya terdapat zakat tiga bintu labun (yang memiliki umur dua tahun) dan satu hiqqah (yang memiliki umur tiga tahun), hingga mencapai seratus tujuh puluh sembilan. Kemudian apabila berjumlah seratus delapan puluh maka padanya terdapat zakat dua hiqqah (yang memiliki umur tiga tahun), dan dua bintu labun (yang memiliki umur dua tahun), hingga mencapai seratus delapan puluh sembilan. Kemudian apabila berjumlah seratus sembilan puluh maka padanya terdapat zakat tiga hiqqah (yang memiliki umur tiga tahun), dan satu bintu labun (yang memiliki umur dua tahun), hingga mencapai seratus sembilan puluh sembilan. Kemudian apabila berjumlah dua ratus maka padanya terdapat zakat empat hiqqah (yang memiliki umur tiga tahun), atau lima bintu labun (yang memiliki umur dua tahun), kambing manapun yang berumur dua tahun didapat maka diambil. Dan pada hewan yang digembalakan di padang rumput ….. kemudian ia menyebutkan seperti hadits Sufyan bin Husain, dan padanya disebutkan; dan tidak diambil dalam zakat kambing yang tua dan telah tanggal giginya, serta yang memiliki aib, serta kambing pejantan, kecuali petugas zakat menghendakinya. "
            },
            {
                "number": 1293,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ قَالَ قَالَ مَالِكٌوَقَوْلُ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ لَا يُجْمَعُ بَيْنَ مُتَفَرِّقٍ وَلَا يُفَرَّقُ بَيْنَ مُجْتَمِعٍ هُوَ أَنْ يَكُونَ لِكُلِّ رَجُلٍ أَرْبَعُونَ شَاةً فَإِذَا أَظَلَّهُمْ الْمُصَدِّقُ جَمَعُوهَا لِئَلَّا يَكُونَ فِيهَا إِلَّا شَاةٌ وَلَا يُفَرَّقُ بَيْنَ مُجْتَمِعٍ أَنَّ الْخَلِيطَيْنِ إِذَا كَانَ لِكُلِّ وَاحِدٍ مِنْهُمَا مِائَةُ شَاةٍ وَشَاةٌ فَيَكُونُ عَلَيْهِمَا فِيهَا ثَلَاثُ شِيَاهٍ فَإِذَا أَظَلَّهُمَا الْمُصَدِّقُ فَرَّقَا غَنَمَهُمَا فَلَمْ يَكُنْ عَلَى كُلِّ وَاحِدٍ مِنْهُمَا إِلَّا شَاةٌ فَهَذَا الَّذِي سَمِعْتُ فِي ذَلِكَ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah], ia berkata; [Malik] berkata; dan perkataan Umar bin Al Khathab radliallahu 'anhu; tidak digabungkan antara kambing yang terpisah, dan tidak dipisahkan antara kambing yang digabungkan, artinya bahwa setiap orang memiliki empat puluh kambing, kemudian apabila petugas zakat telah datang kepada mereka maka mereka menggabungkankannya agar mereka hanya mengeluarkan zakat satu ekor kambing. Dan tidak dipisahkan antara kambing yang digabungkan, bahwa dua orang yang menggabungkan kambing milik mereka apabila setiap mereka memiliki seratus satu ekor kambing maka kewajiban mereka berdua adalah zakat tiga ekor kambing. Kemudian apabila petugas zakat telah datang kepada mereka maka mereka memisahkan kambing mereka sehingga setiap orang hanya berkewajiban membayar zakat satu ekor kambing. Inilah yang aku dengar mengenai hal tersebut. "
            },
            {
                "number": 1294,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ عَلَيْهِ السَّلَام قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ عَفَوْتُ عَنْ الْخَيْلِ وَالرَّقِيقِ فَهَاتُوا صَدَقَةَ الرِّقَةِ مِنْ كُلِّ أَرْبَعِينَ دِرْهَمًا دِرْهَمًا وَلَيْسَ فِي تِسْعِينَ وَمِائَةٍ شَيْءٌ فَإِذَا بَلَغَتْ مِائَتَيْنِ فَفِيهَا خَمْسَةُ دَرَاهِمَقَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ الْأَعْمَشُ عَنْ أَبِي إِسْحَقَ كَمَا قَالَ أَبُو عَوَانَةَ وَرَوَاهُ شَيْبَانُ أَبُو مُعَاوِيَةَ وَإِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ قَالَ أَبُو دَاوُد وَرَوَى حَدِيثَ النُّفَيْلِيِّ شُعْبَةُ وَسُفْيَانُ وَغَيْرُهُمَا عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمٍ عَنْ عَلِيٍّ لَمْ يَرْفَعُوهُ أَوْقَفُوهُ عَلَى عَلِيٍّ",
                "id": "Telah menceritakan kepada Kami ['Amr bin 'Aun], telah mengabarkan kepada Kami [Abu 'Awanah] dari [Abu Ishaq] dari ['Ashim bin Dhamrah] dari [Ali] 'alaihis salam, ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda; Sungguh aku telah memaafkan dari mengambil zakat kuda dan budak, maka berikan zakat perak dari setiap empat puluh dirham, satu dirham. Tidak ada zakat sedikitpun pada jumlah seratus sembilan puluh, kemudian apabila telah mencapai dua ratus maka padanya terdapat zakat lima dirham. Abu Daud berkata; hadits ini telah diriwayatkan oleh [Al A'masy] dari [Abu Ishaq] sebagaimana yang dikatakan Abu 'Awanah, dan telah diriwayatkan oleh [Syaiban Abu Mu'awiyah] dan [Ibrahim bin Thahman] dari [Abu Ishaq] dari [Al Harits] dari [Ali] dari Nabi shallallahu 'alaihi wasallam seperti itu. Abu Daud berkata; dan hadits An Nufaili telah diriwayatkan oleh [Syu'bah] serta [Sufyan] dan yang lainnya dari [Abu Ishaq] dari ['Ashim] dari [Ali]. Mereka tidak merafa'kannya melainkan mereka memauqufkan kepada Ali. "
            },
            {
                "number": 1295,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا بَهْزُ بْنُ حَكِيمٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَأَخْبَرَنَا أَبُو أُسَامَةَ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي كُلِّ سَائِمَةِ إِبِلٍ فِي أَرْبَعِينَ بِنْتُ لَبُونٍ وَلَا يُفَرَّقُ إِبِلٌ عَنْ حِسَابِهَا مَنْ أَعْطَاهَا مُؤْتَجِرًا قَالَ ابْنُ الْعَلَاءِ مُؤْتَجِرًا بِهَا فَلَهُ أَجْرُهَا وَمَنْ مَنَعَهَا فَإِنَّا آخِذُوهَا وَشَطْرَ مَالِهِ عَزْمَةً مِنْ عَزَمَاتِ رَبِّنَا عَزَّ وَجَلَّ لَيْسَ لِآلِ مُحَمَّدٍ مِنْهَا شَيْءٌ",
                "id": "Telah menceritakan kepada Kami [Musa bin Ismail], telah menceritakan kepada Kami [Hammad], telah mengabarkan kepada Kami [Bahz bin Hakim] dan jalur periwayatan lain telah menceritakan kepada kami [Muhammad bin Al 'Ala'] dan telah mengabarkan kepada kami [Abu Usamah] dari [Bahz bin Hakim] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam Bersabda: \"Pada setiap empat puluh unta saimah (yang digembala lebih dari satu tahun) terdapat zakat satu bintu labun (yang memiliki umur dua tahun), dan unta tidak boleh dipisahkan dari hitungannya, barangsiapa yang memberikan zakatnya karena mengharap pahala, maka baginya pahala. Dan barangsiapa yang enggan membayarnya, maka Kami akan mengambilnya dan setengah hartanya; sebagai kewajiban diantara kewajiban-kewajiban Allah Azza wa jalla, dan keluarga Muhammad tidak berhak sedikitpun dari harta tersebut."
            },
            {
                "number": 1296,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ هِلَالِ بْنِ خَبَّابٍ عَنْ مَيْسَرَةَ أَبِي صَالِحٍ عَنْ سُوَيْدِ بْنِ غَفَلَةَ قَالَ سِرْتُ أَوْ قَالَ أَخْبَرَنِي مَنْسَارَ مَعَ مُصَدِّقِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ لَا تَأْخُذَ مِنْ رَاضِعِ لَبَنٍ وَلَا تَجْمَعَ بَيْنَ مُفْتَرِقٍ وَلَا تُفَرِّقَ بَيْنَ مُجْتَمِعٍ وَكَانَ إِنَّمَا يَأْتِي الْمِيَاهُ حِينَ تَرِدُ الْغَنَمُ فَيَقُولُ أَدُّوا صَدَقَاتِ أَمْوَالِكُمْ قَالَ فَعَمَدَ رَجُلٌ مِنْهُمْ إِلَى نَاقَةٍ كَوْمَاءَ قَالَ قُلْتُ يَا أَبَا صَالِحٍ مَا الْكَوْمَاءُ قَالَ عَظِيمَةُ السَّنَامِ قَالَ فَأَبَى أَنْ يَقْبَلَهَا قَالَ إِنِّي أُحِبُّ أَنْ تَأْخُذَ خَيْرَ إِبِلِي قَالَ فَأَبَى أَنْ يَقْبَلَهَا قَالَ فَخَطَمَ لَهُ أُخْرَى دُونَهَا فَأَبَى أَنْ يَقْبَلَهَا ثُمَّ خَطَمَ لَهُ أُخْرَى دُونَهَا فَقَبِلَهَا وَقَالَ إِنِّي آخِذُهَا وَأَخَافُ أَنْ يَجِدَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لِي عَمَدْتَ إِلَى رَجُلٍ فَتَخَيَّرْتَ عَلَيْهِ إِبِلَهُقَالَ أَبُو دَاوُد وَرَوَاهُ هُشَيْمٌ عَنْ هِلَالِ بْنِ خَبَّابٍ نَحْوَهُ إِلَّا أَنَّهُ قَالَ لَا يُفَرَّقُ",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Abu 'Awanah] dari [Hilal bin Khabba] dari [Maisarah Abu Shalih] dari [Suwaid bin Ghafalah], ia berkata; aku berjalan -atau ia berkata; telah mengabarkan kepadaku [orang yang berjalan] bersama petugas pengambil zakat Nabi shallallahu 'alaihi wasallam, ternyata pada zaman Rasulullah shallAllahu wa'alaihi wa sallam dikata; janganlah engkau mengambil zakat dari anak yang sedang menetek susu, dan janganlah engkau menggabungkan antara hewan yang dipisahkandan jangan memisahkan antara hewan yang telah dijadikan satu. Dan sesungguhnya air datang ketika kambing datang, kemudian petugas pengambil zakat berkata; Tunaikan zakat harta kalian. Maisarah berkata; kemudian salah seorang diantara mereka mendatangi unta kauma`. Kemudian aku katakan; wahai Abu Shalih, apakah kauma` itu? Ia berkata; yang besar punuknya. Maisarah berkata; kemudian ia enggan menerimanya. Orang tersebut berkata; sesungguhnya aku ingin anda mengambil unta terbaikku. Maisarah berkata; kemudian ia enggan untuk menerimanya. Maisarah berkata; kemudian orang tersebut menuntun untanya yang lain, lalu petugas zakat tersebut enggan untuk menerimanya, kemudian orang tersebut menuntun untanya yang lain selain unta tersebut, lalu petugas zakat tersebut menerimanya dan berkata; sesungguhnya aku mengambilnya dan aku merasa khawatir Rasulullah shallallahu 'alaihi wasallam marah kepadaku dan berkata: \"Engkau mendatangi seseorang dan memilih unta terbaiknya.\" Abu Daud berkata; dan [Husyaim] telah meriwayatkannya dari [Hilal bin Khabbab] seperti itu, hanya saja ia berkata; tidak dipisahkan….. "
            },
            {
                "number": 1297,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا شَرِيكٌ عَنْ عُثْمَانَ بْنِ أَبِي زُرْعَةَ عَنْ أَبِي لَيْلَى الْكِنْدِيِّ عَنْ سُوَيْدِ بْنِ غَفَلَةَ قَالَأَتَانَا مُصَدِّقُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخَذْتُ بِيَدِهِ وَقَرَأْتُ فِي عَهْدِهِ لَا يُجْمَعُ بَيْنَ مُفْتَرِقٍ وَلَا يُفَرَّقُ بَيْنَ مُجْتَمِعٍ خَشْيَةَ الصَّدَقَةِ وَلَمْ يَذْكُرْ رَاضِعَ لَبَنٍ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Ash Shabbah Al Bazzar], telah menceritakan kepada Kami [Syarik] dari [Utsman bin Abu Zur'ah] dari [Abu Laila Al Kindi] dari [Suwaid bin Ghafalah], ia berkata; [petugas zakat Nabi shallallahu 'alaihi wasallam] telah datang kepada Kami, kemudian aku gandeng tangannya dan aku membaca isi catatannya: Tidak boleh digabungkan antara hewan yang terpisah, dan tidak boleh dipisahkan antara hilang yang digabungkan karena khawatir wajib zakat. Dan ia tidak menyebutkan; hewan yang menetek susu. "
            },
            {
                "number": 1298,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا وَكِيعٌ عَنْ زَكَرِيَّا بْنِ إِسْحَقَ الْمَكِّيِّ عَنْ عَمْرِو بْنِ أَبِي سُفْيَانَ الْجُمَحِيِّ عَنْ مُسْلِمِ بْنِ ثَفِنَةَ الْيَشْكُرِيِّ قَالَ الْحَسَنُ رَوْحٌ يَقُولُ مُسْلِمُ بْنُ شُعْبَةَ قَالَاسْتَعْمَلَ نَافِعُ بْنُ عَلْقَمَةَ أَبِي عَلَى عِرَافَةِ قَوْمِهِ فَأَمَرَهُ أَنْ يُصَدِّقَهُمْ قَالَ فَبَعَثَنِي أَبِي فِي طَائِفَةٍ مِنْهُمْ فَأَتَيْتُ شَيْخًا كَبِيرًا يُقَالُ لَهُ سِعْرُ بْنُ دَيْسَمٍ فَقُلْتُ إِنَّ أَبِي بَعَثَنِي إِلَيْكَ يَعْنِي لِأُصَدِّقَكَ قَالَ ابْنُ أَخِي وَأَيَّ نَحْوٍ تَأْخُذُونَ قُلْتُ نَخْتَارُ حَتَّى إِنَّا نَتَبَيَّنَ ضُرُوعَ الْغَنَمِ قَالَ ابْنُ أَخِي فَإِنِّي أُحَدِّثُكَ أَنِّي كُنْتُ فِي شِعْبٍ مِنْ هَذِهِ الشِّعَابِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَنَمٍ لِي فَجَاءَنِي رَجُلَانِ عَلَى بَعِيرٍ فَقَالَا لِي إِنَّا رَسُولَا رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْكَ لِتُؤَدِّيَ صَدَقَةَ غَنَمِكَ فَقُلْتُ مَا عَلَيَّ فِيهَا فَقَالَا شَاةٌ فَأَعْمَدُ إِلَى شَاةٍ قَدْ عَرَفْتُ مَكَانَهَا مُمْتَلِئَةٍ مَحْضًا وَشَحْمًا فَأَخْرَجْتُهَا إِلَيْهِمَا فَقَالَا هَذِهِ شَاةُ الشَّافِعِ وَقَدْ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَأْخُذَ شَافِعًا قُلْتُ فَأَيَّ شَيْءٍ تَأْخُذَانِ قَالَا عَنَاقًا جَذَعَةً أَوْ ثَنِيَّةً قَالَ فَأَعْمَدُ إِلَى عَنَاقٍ مُعْتَاطٍ وَالْمُعْتَاطُ الَّتِي لَمْ تَلِدْ وَلَدًا وَقَدْ حَانَ وِلَادُهَا فَأَخْرَجْتُهَا إِلَيْهِمَا فَقَالَا نَاوِلْنَاهَا فَجَعَلَاهَا مَعَهُمَا عَلَى بَعِيرِهِمَا ثُمَّ انْطَلَقَاقَالَ أَبُو دَاوُد رَوَاهُ أَبُو عَاصِمٍ عَنْ زَكَرِيَّاءَ قَالَ أَيْضًا مُسْلِمُ بْنُ شُعْبَةَ كَمَا قَالَ رَوْحٌ حَدَّثَنَا مُحَمَّدُ بْنُ يُونُسَ النَّسَائِيُّ حَدَّثَنَا رَوْحٌ حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَقَ بِإِسْنَادِهِ بِهَذَا الْحَدِيثِ قَالَ مُسْلِمُ بْنُ شُعْبَةَ قَالَ فِيهِ وَالشَّافِعُ الَّتِي فِي بَطْنِهَا الْوَلَدُ",
                "id": "Telah menceritakan kepada Kami [Al Hasan bin Ali], telah menceritakan kepada Kami [Waki'] dari [Zakariya bin Ishaq Al Makki] dari ['Amr bin Abu Sufyan Al Jumahi] dari [Muslim bin Tsafinah Al Yasykuri], [Al Hasan] berkata; [Rauh] berkata; [Muslim bin Syu'bah] berkata; Nafi' bin 'Alqamah mempekerjakan ayahku untuk melakukan urusan kaumnya, ia memerintahkannya agar mengambil zakat mereka. Muslim bin Syu'bah berkata; kemudian ayahku mengutusku pada sekelompok orang diantara mereka, kemudian aku datang kepada seseorang yang sudah tua yang dipanggil [Si'r bin Daisam], lalu aku katakan; sesungguhnya ayahku mengutusku untuk datang kepadamu yaitu agar aku mengambil zakatmu. Ia berkata; wahai anak saudaraku, semisal apakah kalian mengambilnya? Aku katakan; Kami akan memilih hingga Kami mengetahui kantong-kantong susu kambing. Ia berkata; wahai anak saudaraku, aku akan menceritakan kepadamu bahwa aku dahulu berada pada lembah diantara lembah-lembah ini pada zaman Rasulullah shallAllahu wa'alaihi wa sallam diantara kambing-kambingku, kemudian terdapat [dua orang laki-laki datang kepadaku dengan menunggang unta] dan berkata; sesungguhnya Kami adalah utusan Rasulullah shallallahu 'alaihi wasallam kepadamu agar engkau menunaikan zakat kambingmu. Kemudian aku katakan; apa yang harus aku tunaikan diantara kambing-kambingku? Kemudian mereka berkata; ini adalah kambing yang memiliki anak, dan Rasulullah shallAllahu wa'alaihi wa sallam telah melarang Kami untuk mengambil kambing yang memiliki anak. Aku katakan; apakah yang akan kalian ambil? Mereka berkata; kambing yang berumur empat tahun memasuki lima tahun atau yang berumur dua tahun memasuki tiga tahun. Si'r bin Daisam berkata; kemudian aku mengambil kambing yang berumur empat tahun yang mu'tath, mu'tath adalah yang belum melahirkan, dan telah datang waktunya melahirkan. Kemudian aku membawanya kepada mereka. Kemudian mereka berkata; berikan kepada Kami! Kemudian mereka membawanya bersama mereka di atas unta mereka, kemudian mereka pergi. Abu Daud berkata; [Abu 'Ashim] telah meriwayatkannya dari [Zakariya`], [Muslim bin Syu'bah] mengatakan pula sebagaimana yang dikatakan Rauh. Telah menceritakan kepada Kami [Muhammad bin Yunus An Nasai], telah menceritakan kepada Kami [Rauh], telah menceritakan kepada Kami [Zakariya` bin Ishaq] dengan sanadnya dengan hadits ini. [Muslim bin Syu'bah] berkata dalam hadits tersebut; dan syafi' adalah yang di dalam perutnya terdapat anak. "
            },
            {
                "number": 1299,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مَنْصُورٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَعْدِ بْنِ زُرَارَةَ عَنْ عُمَارَةَ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَبَعَثَنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُصَدِّقًا فَمَرَرْتُ بِرَجُلٍ فَلَمَّا جَمَعَ لِي مَالَهُ لَمْ أَجِدْ عَلَيْهِ فِيهِ إِلَّا ابْنَةَ مَخَاضٍ فَقُلْتُ لَهُ أَدِّ ابْنَةَ مَخَاضٍ فَإِنَّهَا صَدَقَتُكَ فَقَالَ ذَاكَ مَا لَا لَبَنَ فِيهِ وَلَا ظَهْرَ وَلَكِنْ هَذِهِ نَاقَةٌ فَتِيَّةٌ عَظِيمَةٌ سَمِينَةٌ فَخُذْهَا فَقُلْتُ لَهُ مَا أَنَا بِآخِذٍ مَا لَمْ أُومَرْ بِهِ وَهَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْكَ قَرِيبٌ فَإِنْ أَحْبَبْتَ أَنْ تَأْتِيَهُ فَتَعْرِضَ عَلَيْهِ مَا عَرَضْتَ عَلَيَّ فَافْعَلْ فَإِنْ قَبِلَهُ مِنْكَ قَبِلْتُهُ وَإِنْ رَدَّهُ عَلَيْكَ رَدَدْتُهُ قَالَ فَإِنِّي فَاعِلٌ فَخَرَجَ مَعِي وَخَرَجَ بِالنَّاقَةِ الَّتِي عَرَضَ عَلَيَّ حَتَّى قَدِمْنَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ يَا نَبِيَّ اللَّهِ أَتَانِي رَسُولُكَ لِيَأْخُذَ مِنِّي صَدَقَةَ مَالِي وَايْمُ اللَّهِ مَا قَامَ فِي مَالِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا رَسُولُهُ قَطُّ قَبْلَهُ فَجَمَعْتُ لَهُ مَالِي فَزَعَمَ أَنَّ مَا عَلَيَّ فِيهِ ابْنَةُ مَخَاضٍ وَذَلِكَ مَا لَا لَبَنَ فِيهِ وَلَا ظَهْرَ وَقَدْ عَرَضْتُ عَلَيْهِ نَاقَةً فَتِيَّةً عَظِيمَةً لِيَأْخُذَهَا فَأَبَى عَلَيَّ وَهَا هِيَ ذِهْ قَدْ جِئْتُكَ بِهَا يَا رَسُولَ اللَّهِ خُذْهَا فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاكَ الَّذِي عَلَيْكَ فَإِنْ تَطَوَّعْتَ بِخَيْرٍ آجَرَكَ اللَّهُ فِيهِ وَقَبِلْنَاهُ مِنْكَ قَالَ فَهَا هِيَ ذِهْ يَا رَسُولَ اللَّهِ قَدْ جِئْتُكَ بِهَا فَخُذْهَا قَالَ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَبْضِهَا وَدَعَا لَهُ فِي مَالِهِ بِالْبَرَكَةِ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Manshur], telah menceritakan kepada Kami [Ya'qub bin Ibrahim] Telah menceritakan kepada Kami [ayahku] dari [Ibnu Ishaq], ia berkata; telah menceritakan kepadaku [Abdullah bin Abu Bakr] dari [Yahya bin Abdullah bin Abdurrahman bin Sa'd bin Zurarah] dari ['Umarah bin 'Amr bin Hazm] dari [Ubai bin Ka'b], ia berkata; Nabi shallallahu 'alaihi wasallam telah mengutusku sebagai petugas pengambil zakat, kemudian aku melewati seseorang, tatkala ia telah mengumpulkan hartanya maka aku tidak mendapatkan ia memiliki kewajiban padanya, kecuali satu ekor bintu makhadh (yang berumur satu tahun), kemudian aku katakan kepadanya; berikan bintu makhadh, sesungguhnya itulah zakatmu. Ia berkata; itu tidak memiliki susu, dan tidak dapat ditunggangi. Akan tetapi ini, ini adalah unta muda yang besar dan gemuk. Ambillah unta tersebut. Kemudian aku katakan kepadanya; aku tidak akan mengambilnya, selama aku tidak diperintahkan untuk mengambilnya. Ini, Rasulullah shallAllahu wa'alaihi wa sallam dekat, apabila engkau ingin datang kepada beliau dan menawarkan kepada beliau apa yang telah engkau tawarkan kepadaku maka lakukanlah. Apabila beliau menerimanya maka aku menerimanya dan apabila beliau menolaknya maka aku menolaknya. Ia berkata; aku akan lakukan. Kemudian ia keluar bersamaku, ia keluar dengan membawa unta yang telah ditawarkan kepadaku hingga Kami sampai kepada Rasulullah shallAllahu wa'alaihi wa sallam. Kemudian ia berkata; wahai Nabi Allah, utusanmu telah datang kepadaku untuk mengambil zakat harta dariku. Demi Allah, Rasulullah dan utusannya tidak mengambil hartaku sama sekali sebelumnya, kemudian saya kumpulkan hartaku untuknya, dan ia mengaku bahwa yang harus saya berikan adalah bintu makhadh, dan itu tidak memiliki susu dan tidak dapat dinaiki. Saya menawarkan kepadanya unta muda yang besar agar ia mengambilnya. Kemudian ia menolak. Dan inilah unta tersebut, saya telah membawanya kepada anda wahai Rasulullah, ambillah. Kemudian Rasulullah shallAllahu wa'alaihi wa sallam berkata kepadanya: \"Itu adalah yang menjadi kewajibanmu, kemudian apabila engkau merelakan untuk memberikan yang terbaik maka Allah akan memberimu pahala karenanya, dan Kami menerimanya darimu.\" Ia berkata; ini unta tersebut wahai Rasulullah, aku telah membawanya kepada anda, ambillah. Ubai berkata; kemudian Rasulullah shallAllahu wa'alaihi wa sallam memerintahkan untuk menerimanya dan mendoakan untuknya agar hartanya berkah. "
            },
            {
                "number": 1300,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَقَ الْمَكِّيُّ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ عَنْ أَبِي مَعْبَدٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ مُعَاذًا إِلَى الْيَمَنِ فَقَالَ إِنَّكَ تَأْتِي قَوْمًا أَهْلَ كِتَابٍ فَادْعُهُمْ إِلَى شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ فَإِنْ هُمْ أَطَاعُوكَ لِذَلِكَ فَأَعْلِمْهُمْ أَنَّ اللَّهَ افْتَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ فَإِنْ هُمْ أَطَاعُوكَ لِذَلِكَ فَأَعْلِمْهُمْ أَنَّ اللَّهَ افْتَرَضَ عَلَيْهِمْ صَدَقَةً فِي أَمْوَالِهِمْ تُؤْخَذُ مِنْ أَغْنِيَائِهِمْ وَتُرَدُّ عَلَى فُقَرَائِهِمْ فَإِنْ هُمْ أَطَاعُوكَ لِذَلِكَ فَإِيَّاكَ وَكَرَائِمَ أَمْوَالِهِمْ وَاتَّقِ دَعْوَةَ الْمَظْلُومِ فَإِنَّهَا لَيْسَ بَيْنَهَا وَبَيْنَ اللَّهِ حِجَابٌ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Hanbal] telah menceritakan kepada Kami [Waki'], telah menceritakan kepada Kami [Zakariya bin Ishaq Al Makki] dari [Yahya bin Abdullah bin Shaifi] dari [Abu Ma'bad] dari [Ibnu Abbas] bahwa Rasulullah shallAllahu wa'alaihi wa sallam mengutus Mu'adz ke Yaman, kemudian beliau mengatakan: \"Sesungguhnya engkau akan mendatangi suatu kaum dari ahli kitab, maka ajaklah mereka untuk bersaksi bahwa tidak ada tuhan kecuali Allah dan aku adalah Rasulullah, kemudian apabila mereka mentaatimu untuk itu maka beritahukan kepada mereka bahwa Allah telah mewajibkan atas mereka melakukan sholat lima waktu dalam sehari semalam, kemudian apabila mereka mentaatimu untuk itu maka beritahukan kepda mereka bahwa Allah telah mewajibkan atas mereka sedekah pada harta mereka yang diambil dari orang-orang kaya mereka dan dikembalikan kepada orang-orang miskin mereka, kemudian apabila mereka mentaatimu untuk itu maka jauhilah harta-harta mereka yang berharga, dan berhati-hatilah terhadap doa orang yang dizhalimi, sesungguhnya tidak ada penghalang antara doa tersebut dengan Allah.\""
            },
            {
                "number": 1301,
                "arab": "حَدَّثَنَا مَهْدِيُّ بْنُ حَفْصٍ وَمُحَمَّدُ بْنُ عُبَيْدٍ الْمَعْنَى قَالَا حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ رَجُلٍ يُقَالُ لَهُ دَيْسَمٌ وَقَالَ ابْنُ عُبَيْدٍ مِنْ بَنِي سَدُوسٍ عَنْ بَشِيرِ ابْنِ الْخَصَاصِيَّةِ قَالَ ابْنُ عُبَيْدٍ فِي حَدِيثِهِ وَمَا كَانَ اسْمُهُ بَشِيرًا وَلَكِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمَّاهُ بَشِيرًاقَالَ قُلْنَا إِنَّ أَهْلَ الصَّدَقَةِ يَعْتَدُونَ عَلَيْنَا أَفَنَكْتُمُ مِنْ أَمْوَالِنَا بِقَدْرِ مَا يَعْتَدُونَ عَلَيْنَا فَقَالَ لَاحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ وَيَحْيَى بْنُ مُوسَى قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ أَيُّوبَ بِإِسْنَادِهِ وَمَعْنَاهُ إِلَّا أَنَّهُ قَالَ قُلْنَا يَا رَسُولَ اللَّهِ إِنَّ أَصْحَابَ الصَّدَقَةِ يَعْتَدُونَ قَالَ أَبُو دَاوُد رَفَعَهُ عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ",
                "id": "Telah menceritakan kepada Kami [Mahdi bin Hafsh] dan [Muhammad bin 'Ubaid] secara makna, mereka mengatakan; telah menceritakan kepada Kami [Hammad] dari [Ayyub] dari [seseorang yang dipanggil Daisam]. [Ibnu'Ubaid] berkata; ia berasal dari Bani Sadus, dari [Basyir bin Al Khashashiyyah], [Ibnu 'Ubaid] berkata dalam haditsnya; namanya bukanlah Basyir, akan tetapi Rasulullah shallAllahu wa'alaihi wa sallam menamakannya Basyir. Ia berkata; sesungguhnya para para ahli zakat telah bertindak lalim kepada Kami, apakah boleh Kami menyembunyikan sebagian harta Kami sesuai dengan kelaliman yang mereka lakukan kepada Kami? Maka beliau berkata: \"Tidak.\" Telah menceritakan kepada Kami [Al Hasan bin Ali] dan [Yahya bin Musa], mereka mengatakan; telah menceritakan kepada Kami [Abdurrazzaq] dari [Ma'mar] dari [Ayyub] dengan sanad dan maknanya, hanya saja ia mengatakan; Kami katakan; wahai rasul, sesungguhnya para pemberi zakat berlaku lalim. Abu Daud berkata; Abdurrazzaq telah merafa'kannya menyandarkan perkataan kepada Rasulullah shallAllahu wa'alaihi wa sallam dari Ma'mar."
            },
            {
                "number": 1302,
                "arab": "حَدَّثَنَا عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا بِشْرُ بْنُ عُمَرَ عَنْ أَبِي الْغُصْنِ عَنْ صَخْرِ بْنِ إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جَابِرِ بْنِ عَتِيكٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَيَأْتِيكُمْ رُكَيْبٌ مُبْغَضُونَ فَإِنْ جَاءُوكُمْ فَرَحِّبُوا بِهِمْ وَخَلُّوا بَيْنَهُمْ وَبَيْنَ مَا يَبْتَغُونَ فَإِنْ عَدَلُوا فَلِأَنْفُسِهِمْ وَإِنْ ظَلَمُوا فَعَلَيْهَا وَأَرْضُوهُمْ فَإِنَّ تَمَامَ زَكَاتِكُمْ رِضَاهُمْ وَلْيَدْعُوا لَكُمْقَالَ أَبُو دَاوُد أَبُو الْغُصْنِ هُوَ ثَابِتُ بْنُ قَيْسِ بْنِ غُصْنٍ",
                "id": "Telah menceritakan kepada Kami [Abbas bin 'Abdul 'Azhim] dan [Muhammad bin Al Mutsanna], mereka berkata; telah menceritakan kepada Kami [Bisyr bin Umar] dari [Abu Al Ghushn] dari [Shakhr bin Ishaq] dari [Abdurrahman bin Jabir bin 'Atik] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: akan datang kepada kalian para petugas pengambil zakat, jika mereka sudah datang kepada kalian, maka sambutlah mereka dan biarkanlah mereka mengambil apa yang mereka inginkan, jika mereka berbuat adil maka itu adalah kebaikan buat kalian dan jika mereka berbuat dzalim maka dosanya bagi mereka, buatlah mereka ridha, sebab kesempurnaan zakat kalian pada keridhaan mereka, dan hendaklah mereka mendo'akan kalian. Abu Daud berkata; Abu Al Ghushn adalah Tsabit bin Qais bin Ghushn. "
            },
            {
                "number": 1303,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ وَهَذَا حَدِيثُ أَبِي كَامِلٍ عَنْ مُحَمَّدِ بْنِ أَبِي إِسْمَعِيلَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ هِلَالٍ الْعَبْسِيُّ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ قَالَجَاءَ نَاسٌ يَعْنِي مِنْ الْأَعْرَابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا إِنَّ نَاسًا مِنْ الْمُصَدِّقِينَ يَأْتُونَا فَيَظْلِمُونَا قَالَ فَقَالَ أَرْضُوا مُصَدِّقِيكُمْ قَالُوا يَا رَسُولَ اللَّهِ وَإِنْ ظَلَمُونَا قَالَ أَرْضُوا مُصَدِّقِيكُمْ زَادَ عُثْمَانُ وَإِنْ ظُلِمْتُمْقَالَ أَبُو كَامِلٍ فِي حَدِيثِهِ قَالَ جَرِيرٌ مَا صَدَرَ عَنِّي مُصَدِّقٌ بَعْدَ مَا سَمِعْتُ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا وَهُوَ عَنِّي رَاضٍ",
                "id": "Telah menceritakan kepada Kami [Abu Kamil] telah menceritakan kepada Kami [Abdul Wahid] yaitu Ibnu Ziyad. Dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Abdurrahim bin Sulaiman] dan ini adalah hadits Abu Kamil, dari [Muhammad bin Abu Isma'il] telah menceritakan kepada kami [Abdurrahman bin Hilal Al 'Absi] dari [Jarir bin Abdullah], ia berkata; telah datang beberapa orang yaitu dari kalangan badui kepada Rasulullah shallAllahu wa'alaihi wa sallam dan berkata; sesungguhnya beberapa orang petugas pengambil zakat datang kepada Kami dan berbuat zhalim kepada Kami. Jarir berkata; kemudian beliau berkata; \"Buatlah para petugas zakat kalian ridha.\" Mereka berkata; wahai Rasulullah, walaupun mereka berbuat zhalim kepada Kami? Beliau berkata: \"Buatlah para petugas tersebut zakat kalian ridha.\" Utsman menambahkan; walaupun kalian dizhalimi. Abu Kamil berkata dalam haditsnya; Jarir berkata; tidaklah seorangpun petugas zakat pergi dariku setelah aku mendengar hal ini dari Rasulullah shallAllahu wa'alaihi wa sallam melainkan ia ridha kepadaku. "
            },
            {
                "number": 1304,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ وَأَبُو الْوَلِيدِ الطَّيَالِسِيُّ الْمَعْنَى قَالَا حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى قَالَكَانَ أَبِي مِنْ أَصْحَابِ الشَّجَرَةِ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَتَاهُ قَوْمٌ بِصَدَقَتِهِمْ قَالَ اللَّهُمَّ صَلِّ عَلَى آلِ فُلَانٍ قَالَ فَأَتَاهُ أَبِي بِصَدَقَتِهِ فَقَالَ اللَّهُمَّ صَلِّ عَلَى آلِ أَبِي أَوْفَى",
                "id": "Telah menceritakan kepada Kami [Hafsh bin Umar An Namari] dan [Abu Al Walid Ath Thayalisi] secara makna, mereka berkata; telah menceritakan kepada Kami [Syu'bah] dari ['Amr bin Murrah] dari [Abdullah bin Abu Aufa], ia berkata; ayahku termasuk orang-orang yang melakukan bai'at Ridhwan di bawah pohon, dan Nabi shallallahu 'alaihi wasallam apabila terdapat beberapa orang yang datang kepada beliau membawa zakat mereka maka beliau mengucapkan; ya Allah, sampaikan shalawat kepada keluarga fulan. Abdullah bin Abu Aufa berkata; kemudian ayahku datang kepada beliau dengan membawa zakatnya. Kemudian beliau berdoa: \"Ya Allah, sampaikan shalawat kepada keluarta Abu Aufa.\""
            },
            {
                "number": 1305,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ ابْنِ إِسْحَقَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا جَلَبَ وَلَا جَنَبَ وَلَا تُؤْخَذُ صَدَقَاتُهُمْ إِلَّا فِي دُورِهِمْحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ سَمِعْتُ أَبِي يَقُولُ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ فِي قَوْلِهِ لَا جَلَبَ وَلَا جَنَبَ قَالَ أَنْ تُصَدَّقَ الْمَاشِيَةُ فِي مَوَاضِعِهَا وَلَا تُجْلَبَ إِلَى الْمُصَدِّقِ وَالْجَنَبُ عَنْ غَيْرِ هَذِهِ الْفَرِيضَةِ أَيْضًا لَا يُجْنَبُ أَصْحَابُهَا يَقُولُ وَلَا يَكُونُ الرَّجُلُ بِأَقْصَى مَوَاضِعِ أَصْحَابِ الصَّدَقَةِ فَتُجْنَبُ إِلَيْهِ وَلَكِنْ تُؤْخَذُ فِي مَوْضِعِهِ",
                "id": "Telah menceritakan kepada Kami [Qutaibah bin Sa'id], telah menceritakan kepada Kami [Ibnu Abu 'Adi] dari [Ibnu Ishaq] dari ['Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] dari Nabi shallallahu 'alaihi wasallam beliau bersabda; \"Tidak ada jalab dan janab dan tidaklah zakat mereka diambil kecuali di rumah-rumah mereka.\" Telah menceritakan kepada Kami Al Hasan bin Ali, telah menceritakan kepada Kami Ya'qub bin Ibrahim, ia berkata; saya mendengar ayahku berkata; dari Muhammad bin Ishaq mengenai sabda beliau: \"Tidak ada jalab dan tidak ada janab, \" ia berkata; yaitu hewan ternak dizakatkan di tempat-tempatnya, dan tidak dibawa kepada petugas zakat, sedangkan janab mengenai selain kewajiban ini, juga para pemilik zakat tidak diperlakukan janab kepadanya. Ia mengatakan; seseorang (petugas zakat) tidak berada di tempat terjauh orang yang menunaikan zakat kemudian zakat tersebut dibawa kepadanya, akan tetapi hendaknya zakat tersebut diambil di tempatnya."
            },
            {
                "number": 1306,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ حَمَلَ عَلَى فَرَسٍ فِي سَبِيلِ اللَّهِ فَوَجَدَهُ يُبَاعُ فَأَرَادَ أَنْ يَبْتَاعَهُ فَسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَقَالَ لَا تَبْتَعْهُ وَلَا تَعُدْ فِي صَدَقَتِكَ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah] dari [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa Umar bin Al Khathab radliallahu 'anhu telah mewakafkan kuda di jalan Allah, kemudian ia melihat kuda tersebut dijual, kemudian ia ingin membelinya. Lalu ia bertanya kepada Rasulullah shallAllahu wa'alaihi wa sallam mengenai hal tersebut, kemudian beliau bersabda: \"Jangan engkau beli, dan janganlah engkau mengambil kembali sedekahmu.\""
            },
            {
                "number": 1307,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ يَحْيَى بْنِ فَيَّاضٍ قَالَا حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ رَجُلٍ عَنْ مَكْحُولٍ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِي الْخَيْلِ وَالرَّقِيقِ زَكَاةٌ إِلَّا زَكَاةُ الْفِطْرِ فِي الرَّقِيقِ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Yahya bin Fayyadh], mereka berkata; telah menceritakan kepada Kami [Abdul Wahhab], telah menceritakan kepada Kami ['ubaidhullah] dari [seorang laki-laki] dari [Makhul] dari ['Irak bin Malik] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada zakat pada kuda, dan budak, kecuali zakat fithrah pada budak.\""
            },
            {
                "number": 1308,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ عَلَى الْمُسْلِمِ فِي عَبْدِهِ وَلَا فِي فَرَسِهِ صَدَقَةٌ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah], telah menceritakan kepada Kami [Malik] dari [Abdullah bin Dinar] dari [Sulaiman bin Yasar] dari ['Irak bin Malik] dari [Abu Hurairah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"seorang muslim tidak memiliki kewajiban zakat pada budak dan kudanya.\""
            },
            {
                "number": 1309,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدِ بْنِ الْهَيْثَمِ الْأَيْلِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيمَا سَقَتْ السَّمَاءُ وَالْأَنْهَارُ وَالْعُيُونُ أَوْ كَانَ بَعْلًا الْعُشْرُ وَفِيمَا سُقِيَ بِالسَّوَانِي أَوْ النَّضْحِ نِصْفُ الْعُشْرِ",
                "id": "Telah menceritakan kepada Kami [Harun bin Sa'id bin Al Haitsam Al Aili], telah menceritakan kepada Kami [Abdullah bin Wahb], telah mengabarkan kepadaku [Yunus bin Yazid] dari [Ibnu Syihab] dari [Salim bin Abdullah] dari [ayahnya], ia berkata; Rasulullah shallla Allahu 'alaihi wa sallam bersabda: \"Pertanian yang diairi hujan, sungai dan mata air atau dibiarkan begitu saja maka zakatnya adalah sepersepuluh, dan pertanian yang diairi dengan menggunakan alat pengairan atau dengan ember maka zakatnya seperdua puluh.\""
            },
            {
                "number": 1310,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيمَا سَقَتْ الْأَنْهَارُ وَالْعُيُونُ الْعُشْرُ وَمَا سُقِيَ بِالسَّوَانِي فَفِيهِ نِصْفُ الْعُشْرِ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Shalih], telah menceritakan kepada Kami [Abdullah bin Wahb] telah mengabarkan kepadaku ['Amr], dari [Abu Az Zubair] dari [Jabir bin Abdullah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Pertanian yang diairi sungai dan mata air zakatnya adalah sepersepuluh, dan yang diairi menggunakan alat pengairan maka zakatnya adalah seperdua puluh.\""
            },
            {
                "number": 1311,
                "arab": "حَدَّثَنَا الْهَيْثَمُ بْنُ خَالِدٍ الْجُهَنِيُّ وَحُسَيْنُ بْنُ الْأَسْوَدِ الْعَجَلِيُّ قَالَا قَالَ وَكِيعٌالْبَعْلُ الْكَبُوسُ الَّذِي يَنْبُتُ مِنْ مَاءِ السَّمَاءِقَالَ ابْنُ الْأَسْوَدِ وَقَالَ يَحْيَى يَعْنِي ابْنَ آدَمَ سَأَلْتُ أَبَا إِيَاسٍ الْأَسَدِيَّ عَنْ الْبَعْلِ فَقَالَ الَّذِي يُسْقَى بِمَاءِ السَّمَاءِ و قَالَ النَّضْرُ بْنُ شُمَيْلٍ الْبَعْلُ مَاءُ الْمَطَرِ",
                "id": "Telah menceritakan kepada Kami [Al Haitsam bin Khalid Al Juahani] serta [Husain bin Al Aswad Al 'Ajali], ia berkata; [Waki'] berkata; Al Ba'lu dan Al Kabus adalah tanaman yang tumbuh dari air hujan. [Ibnu Al Aswad] berkata; dan [Yahya yaitu Ibnu Adam] berkata; aku bertanya kepada [Abu Iyaz Al Asadi] mengenai Al Ba'lu, kemudian ia berkata; yaitu yang disirami dengan air hujan. An Nadhr bin Syumail berkata; Al Ba'lu adalah air hujan."
            },
            {
                "number": 1312,
                "arab": "حَدَّثَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ سُلَيْمَانَ يَعْنِي ابْنَ بِلَالٍ عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ مُعَاذِ بْنِ جَبَلٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَهُ إِلَى الْيَمَنِ فَقَالَ خُذْ الْحَبَّ مِنْ الْحَبِّ وَالشَّاةَ مِنْ الْغَنَمِ وَالْبَعِيرَ مِنْ الْإِبِلِ وَالْبَقَرَةَ مِنْ الْبَقَرِقَالَ أَبُو دَاوُد شَبَرْتُ قِثَّاءَةً بِمِصْرَ ثَلَاثَةَ عَشَرَ شِبْرًا وَرَأَيْتُ أُتْرُجَّةً عَلَى بَعِيرٍ بِقِطْعَتَيْنِ قُطِّعَتْ وَصُيِّرَتْ عَلَى مِثْلِ عِدْلَيْنِ",
                "id": "Telah menceritakan kepada Kami [Ar Rabi' bin Sulaiman] telah menceritakan kepada Kami [Ibnu Wahb] dari [Sulaiman yaitu Ibnu Bilal] dari [Syarik bin Abdullah bin Abu Namir] dari ['Atho` bin Yasar] dari [Muadz bin Jabal] bahwa Rasulullah shallallahu 'alaihi wasallam mengutusnya ke Yaman dan berkata: \"Ambillah biji-bijian dari biji-bijian, kambing dari domba, unta dari unta, dan sapi dari sapi.\" Abu Daud berkata: aku mengukur mentimun di Mesir mencapai tiga belas jengkal, dan aku melihat dua potong buah limau (sejenis jeruk nipis) yang telah dipotong diatas unta dan ditempatkan pada tempat seperti dua kantong. "
            },
            {
                "number": 1313,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ حَدَّثَنَا مُوسَى بْنُ أَعْيَنَ عَنْ عَمْرِو بْنِ الْحَارِثِ الْمِصْرِيِّ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَجَاءَ هِلَالٌ أَحَدُ بَنِي مُتْعَانَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعُشُورِ نَحْلٍ لَهُ وَكَانَ سَأَلَهُ أَنْ يَحْمِيَ لَهُ وَادِيًا يُقَالُ لَهُ سَلَبَةُ فَحَمَى لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَلِكَ الْوَادِي فَلَمَّا وُلِّيَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ كَتَبَ سُفْيَانُ بْنُ وَهْبٍ إِلَى عُمَرَ بْنِ الْخَطَّابِ يَسْأَلُهُ عَنْ ذَلِكَ فَكَتَبَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ إِنْ أَدَّى إِلَيْكَ مَا كَانَ يُؤَدِّي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عُشُورِ نَحْلِهِ فَاحْمِ لَهُ سَلَبَةَ وَإِلَّا فَإِنَّمَا هُوَ ذُبَابُ غَيْثٍ يَأْكُلُهُ مَنْ يَشَاءُحَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ حَدَّثَنَا الْمُغِيرَةُ وَنَسَبَهُ إِلَى عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ الْمَخْزُومِيِّ قَالَ حَدَّثَنِي أَبِي عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ شَبَابَةَ بَطْنٌ مِنْ فَهْمٍ فَذَكَرَ نَحْوَهُ قَالَ مِنْ كُلِّ عَشْرِ قِرَبٍ قِرْبَةٌ وَقَالَ سُفْيَانُ بْنُ عَبْدِ اللَّهِ الثَّقَفِيُّ قَالَ وَكَانَ يَحْمِي لَهُمْ وَادِيَيْنِ زَادَ فَأَدَّوْا إِلَيْهِ مَا كَانُوا يُؤَدُّونَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحَمَى لَهُمْ وَادِيَيْهِمْ حَدَّثَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ الْمُؤَذِّنُ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ بَطْنًا مِنْ فَهْمٍ بِمَعْنَى الْمُغِيرَةِ قَالَ مِنْ عَشْرِ قِرَبٍ قِرْبَةٌ وَقَالَ وَادِيَيْنِ لَهُمْ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Abu Syu'aib Al Harrani], telah menceritakan kepada Kami [Musa bin A'yan] dari ['Amr bin Al Harits Al Mishri] dari ['Amr bin Syu'aib] dari [ayahnya] dari [kakeknya], ia berkata: Hilal salah seorang dari Bani Mut'an datang kepada Rasulullah shallallahu 'alaihi wasallam dengan membawa sepersepuluh dari hasil madunya, ia pernah meminta Rasulullah shallla Allahu 'alaihi wa sallam agar melindungi bukitnya yang bernama Salabah, dan Rasulullah shallla Allahu 'alaihi wa sallam pun melindunginya. Dan ketika Umar ditunjuk menjadi khalifah, Sufyan bin Wahb bertanya mengenai hal itu, kemudian Umar radliallahu 'anhu menulis surat kepadanya; jika dia menunaikan zakatnya kepada kalian sebagaimana yang telah dia berikan kepada Rasulullah shallla Allahu 'alaihi wa sallam, maka lindungilah bukit Salabahnya, jika tidak, maka sesungguhnya madu itu adalah terambil dari lebah hujan yang dapat dimakan oleh siapapun yang menghendakinya. Telah menceritakan kepada Kami [Ahmad bin Abdah Adh Dhabbi], telah menceritakan kepada Kami [Al Mughirah] dan ia menisbatkannya kepada Abdurrahman bin Al Harits Al Makhzumi, ia berkata; telah menceritakan kepada Kami [ayahku] dari ['Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Syababah pertengahan daerah Fahm ….. kemudian ia menyebutkan seperti itu. Ia berkata; dari setiap sepuluh griba terdapat zakat satu geriba. Sufyan bin Abdullah Ats Tsaqafi berkata; \"Umar melindungi dua bukit mereka. Ia menambahkan; dan mereka memberikan kepadanya apa yang dahulu mereka berikan kepada Rasulullah shallallahu 'alaihi wasallam, dan ia melindungi melindungi dua bukit mereka. Telah menceritakan kepada Kami [Ar Rabi' bin Sulaiman Al Muadzin], telah menceritakan kepada Kami [Ibnu Wahb], telah menceritakan kepada Kami [Usamah bin Zaid] dari ['Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa suatu daerah di tengah kota …. Fahm dengan makna yang dikatakan Mughirah yaitu \"dari setiap sepuluh geriba terdapat zakat satu geriba. Dan ia berkata; mereka memiliki dua bukit."
            },
            {
                "number": 1314,
                "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ السَّرِيِّ النَّاقِطُ حَدَّثَنَا بِشْرُ بْنُ مَنْصُورٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ عَتَّابِ بْنِ أَسِيدٍ قَالَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُخْرَصَ الْعِنَبُ كَمَا يُخْرَصُ النَّخْلُ وَتُؤْخَذُ زَكَاتُهُ زَبِيبًا كَمَا تُؤْخَذُ زَكَاةُ النَّخْلِ تَمْرًاحَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ الْمُسَيَّبِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ عَنْ مُحَمَّدِ بْنِ صَالِحٍ التَّمَّارِ عَنْ ابْنِ شِهَابٍ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ أَبُو دَاوُد سَعِيدٌ لَمْ يَسْمَعْ مِنْ عَتَّابٍ شَيْئًا",
                "id": "Telah menceritakan kepada Kami [Abdul Aziz bin As Sari An Naqith], telah menceritakan kepada Kami [Bisyr bin Manshur] dari [Abdurrahman bin Ishaq] dari [Az Zuhri] dari [Sa'id? bin Al Musayyab] dari ['Attab bin Usaid], ia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk memperkirakan jumlah anggur sebagaimana memperkirakan jumlah kurma dan diambil zakatnya dalam bentuk kismis sebagaimana pohon kurma diambil zakatnya dalam bentuk kurma. Telah menceritakan kepada Kami [Muhammad bin Ishak Al Musayyabi], telah menceritakan kepada Kami [Abdullah bin Nafi'] dari [Muhammad bin Sholih At Tammar] dari [Ibnu Syihab] dengan sanad dan maknanya. Abu daud berkata Sa'id tidak mendengar dari 'Atab sedikit pun. "
            },
            {
                "number": 1315,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَسْعُودٍ قَالَجَاءَ سَهْلُ بْنُ أَبِي حَثْمَةَ إِلَى مَجْلِسِنَا قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا خَرَصْتُمْ فَجُذُّوا وَدَعُوا الثُّلُثَ فَإِنْ لَمْ تَدَعُوا أَوْ تَجُذُّوا الثُّلُثَ فَدَعُوا الرُّبْعَقَالَ أَبُو دَاوُد الْخَارِصُ يَدَعُ الثُّلُثَ لِلْحِرْفَةِ",
                "id": "Telah menceritakan kepada Kami [Hafsh bin Umar], telah menceritakan kepada Kami [Syu'bah] dari [Khubaib bin Abdurrahman] dari [Abdurrahman bin Mas'ud], ia berkata; [Sahl bin Abu Hatsmah] telah datang ke majelis Kami, ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam telah memerintahkan Kami, beliau bersabda: \"Apabila kalian telah memperkirakan buah yang ada di pohon maka potonglah dan biarkan sepertiganya, apabila kalian tidak membiarkan atau tidak memotong sepertiga maka tinggalkan seperempat.\" Abu Daud berkata; orang yang memperkirakan meninggalkan sepertiga untuk pekerjaan. "
            },
            {
                "number": 1316,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أُخْبِرْتُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةِ رَضِيَ اللَّهُ عَنْهَا أَنَّهَا قَالَتْ وَهِيَ تَذْكُرُ شَأْنَ خَيْبَرَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَبْعَثُ عَبْدَ اللَّهِ بْنَ رَوَاحَةَ إِلَى يَهُودَ فَيَخْرُصُ النَّخْلَ حِينَ يَطِيبُ قَبْلَ أَنْ يُؤْكَلَ مِنْهُ",
                "id": "Telah menceritakan kepada Kami [Yahya bin Ma'in] telah menceritakan kepada Kami [Hajjaj] dari [Ibnu Juraij], ia berkata; aku diberi kabar dari [Ibnu Syihab] dari ['Urwah] dari [Aisyah] radliallahu 'anha bahwa ia menyebutkan perkara Khaibar dan berkata; Nabi shallallahu 'alaihi wasallam mengutus Abdullah bin Rawahah kepada orang-orang Yahudi, kemudian ia memperkirakan kurma yang ada dipohon, ketika telah matang sebelum dimakan sebagian darinya. "
            },
            {
                "number": 1317,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ حَدَّثَنَا عَبَّادٌ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ عَنْ أَبِيهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْجُعْرُورِ وَلَوْنِ الْحُبَيْقِ أَنْ يُؤْخَذَا فِي الصَّدَقَةِقَالَ الزُّهْرِيُّ لَوْنَيْنِ مِنْ تَمْرِ الْمَدِينَةِ قَالَ أَبُو دَاوُد وَأَسْنَدَهُ أَيْضًا أَبُو الْوَلِيدِ عَنْ سُلَيْمَانَ بْنِ كَثِيرٍ عَنْ الزُّهْرِيِّ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Yahya bin Faris], telah menceritakan kepada Kami [Sa'id? bin Sulaiman], telah menceritakan kepada Kami ['Abbad] dari [Sufyan bin Husain] dari [Az Zuhri] dari [Abu Umamah bin Sahl] dari [ayahnya], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang untuk mengambil Ju'rur dan Launu Al Hubaiki (keduanya adalah jenis kurma yang jelek) untuk zakat. Az Zuhri berkata: itu adalah dua macam kurma madinah. Abu Daud berkata: [Abu Al Walid] juga menyebutkan sanad hadits tersebut dari [Sulaiman bin Katsir] dari [Az Zuhri]."
            },
            {
                "number": 1318,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَاصِمٍ الْأَنْطَاكِيُّ حَدَّثَنَا يَحْيَى يَعْنِي الْقَطَّانَ عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ حَدَّثَنِي صَالِحُ بْنُ أَبِي عَرِيبٍ عَنْ كَثِيرِ بْنِ مُرَّةَ عَنْ عَوْفِ بْنِ مَالِكٍ قَالَدَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَسْجِدَ وَبِيَدِهِ عَصَا وَقَدْ عَلَّقَ رَجُلٌ قَنَا حَشَفًا فَطَعَنَ بِالْعَصَا فِي ذَلِكَ الْقِنْوِ وَقَالَ لَوْ شَاءَ رَبُّ هَذِهِ الصَّدَقَةِ تَصَدَّقَ بِأَطْيَبَ مِنْهَا وَقَالَ إِنَّ رَبَّ هَذِهِ الصَّدَقَةِ يَأْكُلُ الْحَشَفَ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada Kami [Nashr bin 'Ashim Al Anthaki], telah menceritakan kepada Kami [Yahya yaitu Al Qaththan] dari [Abdul Hamid bin Ja'far], telah menceritakan kepadaku [Shalih bin Abu 'Arib] dari [Katsir bin Murrah] dari ['Aur bin Malik], ia berkata; Rasulullah shallallahu 'alaihi wasallam menemui Kami di masjid dengan membawa tongkat ditangannya, sementara seseorang telah menggantungkan kurma basah yang rusak, kemudian beliau menusuk tandan tersebut dengan tongkat dan berkata: \"Kalau pemilik sedekah ini hendak bersedekah maka ia bersedekah dengan kurma yang lebih baik darinya.\" Dan beliau bersabda: \"Sesungguhnya pemilik sedekah ini akan makan kurma basah dan rusak di Hari Kiamat.\""
            },
            {
                "number": 1319,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ الدِّمَشْقِيُّ وَعَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ السَّمْرَقَنْدِيُّ قَالَا حَدَّثَنَا مَرْوَانُ قَالَ عَبْدُ اللَّهِ حَدَّثَنَا أَبُو يَزِيدَ الْخَوْلَانِيُّ وَكَانَ شَيْخَ صِدْقٍ وَكَانَ ابْنُ وَهْبٍ يَرْوِي عَنْهُ حَدَّثَنَا سَيَّارُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ مَحْمُودٌ الصَّدَفِيُّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَفَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ الْفِطْرِ طُهْرَةً لِلصَّائِمِ مِنْ اللَّغْوِ وَالرَّفَثِ وَطُعْمَةً لِلْمَسَاكِينِ مَنْ أَدَّاهَا قَبْلَ الصَّلَاةِ فَهِيَ زَكَاةٌ مَقْبُولَةٌ وَمَنْ أَدَّاهَا بَعْدَ الصَّلَاةِ فَهِيَ صَدَقَةٌ مِنْ الصَّدَقَاتِ",
                "id": "Telah menceritakan kepada Kami [Mahmud bin Khalid Ad Dimasyqi] dan [Abdullah bin Abdurrahman As Samarqandi] berkata; telah menceritakan kepada Kami [Marwan], Abdullah berkata; telah menceritakan kepada Kami [Abu Yazid Al Khaulani] ia adalah syekh yang jujur, dan Ibnu Wahb telah meriwayatkan darinya, telah menceritakan kepada Kami [Sayyar bin Abdurrahman], Mahmud Ash Shadafi berkata; dari [Ikrimah] dari [Ibnu Abbas], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam mewajibkan zakat fitrah untuk mensucikan orang yang berpuasa dari bersenda gurau dan kata-kata keji, dan juga untuk memberi makan miskin. Barangsiapa yang menunaikannya sebelum sholat maka zakatnya diterima dan barangsiapa yang menunaikannya setelah sholat maka itu hanya sedekah diantara berbagai sedekah."
            },
            {
                "number": 1320,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِزَكَاةِ الْفِطْرِ أَنْ تُؤَدَّى قَبْلَ خُرُوجِ النَّاسِ إِلَى الصَّلَاةِقَالَ فَكَانَ ابْنُ عُمَرَ يُؤَدِّيهَا قَبْلَ ذَلِكَ بِالْيَوْمِ وَالْيَوْمَيْنِ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada Kami [Zuhair] telah menceritakan kepada Kami [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam telah memerintahkan Kami untuk menunaikan zakat fitrah sebelum orang-orang keluar untuk melakukan sholat. Ia berkata; Ibnu Umar menunaikannya sehai atau dua hari sebelum itu. "
            },
            {
                "number": 1321,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا مَالِكٌ وَقَرَأَهُ عَلَيَّ مَالِكٌ أَيْضًا عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَضَ زَكَاةَ الْفِطْرِ قَالَ فِيهِ فِيمَا قَرَأَهُ عَلَيَّ مَالِكٌ زَكَاةُ الْفِطْرِ مِنْ رَمَضَانَ صَاعٌ مِنْ تَمْرٍ أَوْ صَاعٌ مِنْ شَعِيرٍ عَلَى كُلِّ حُرٍّ أَوْ عَبْدٍ ذَكَرٍ أَوْ أُنْثَى مِنْ الْمُسْلِمِينَحَدَّثَنَا يَحْيَى بْنُ مُحَمَّدِ بْنِ السَّكَنِ حَدَّثَنَا مُحَمَّدُ بْنُ جَهْضَمٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ عُمَرَ بْنِ نَافِعٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ الْفِطْرِ صَاعًا فَذَكَرَ بِمَعْنَى مَالِكٍ زَادَ وَالصَّغِيرِ وَالْكَبِيرِ وَأَمَرَ بِهَا أَنْ تُؤَدَّى قَبْلَ خُرُوجِ النَّاسِ إِلَى الصَّلَاةِ قَالَ أَبُو دَاوُد رَوَاهُ عَبْدُ اللَّهِ الْعُمَرِيُّ عَنْ نَافِعٍ بِإِسْنَادِهِ قَالَ عَلَى كُلِّ مُسْلِمٍ وَرَوَاهُ سَعِيدٌ الْجُمَحِيُّ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ قَالَ فِيهِ مِنْ الْمُسْلِمِينَ وَالْمَشْهُورُ عَنْ عُبَيْدِ اللَّهِ لَيْسَ فِيهِ مِنْ الْمُسْلِمِينَ",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Maslamah], Telah menceritakan kepada Kami [Malik] dan Malik membacakannya kepadaku juga, dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallAllahu wa'alaihi wa sallam mewajibkan zakat fitrah, ia berkata padanya; diantara yang dibacakan Malik kepadaku adalah; zakat fitrah pada Bulan Ramadhan, satu sha' kurma, atau satu sha' gandum atas setiap orang merdeka, atau budak laki-laki dan perempuan dari kalangan muslimin. Telah menceritakan kepada Kami [Yahya bin Muhammad bin As Sakan], telah menceritakan kepada Kami [Muhammad bin Jahdham], telah menceritakan kepada Kami [Ismail bin Ja'far] dari [Umar bin Nafi'] dari [ayahnya] dari [Abdullah bin Umar], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam mewajibkan zakat fitrah satu sebanyak satu sha'. Kemudian ia menyebutkan secara makna yang disebutkan Malik, dan ia menambahkan; dan atas anak kecil, dan orang dewasa. Dan beliau memerintahkan agar ditunaikan sebelum orang-orang keluar untuk melakukan sholat. Abu Daud berkata; [Abdullah Al 'Umari] telah meriwayatkannya dari [Nafi'] dengan sanadnya. Ia berkata; wajib atas setiap muslim. Dan [Sa'id? Al Jumahi] telah meriwayatkan dari ['ubaidhullah] dari [Nafi'] ia berkata dalam hadits tersebut; dari kalangan muslimin. Dan yang masyhur dari 'ubaidhullah tidak ada padanya kata; dari kalangan muslimin. "
            },
            {
                "number": 1322,
                "arab": "حَدَّثَنَا مُسَدَّدٌ أَنَّ يَحْيَى بْنَ سَعِيدٍ وَبِشْرَ بْنَ الْمُفَضَّلِ حَدَّثَاهُمْ عَنْ عُبَيْدِ اللَّهِ ح و حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ فَرَضَ صَدَقَةَ الْفِطْرِ صَاعًا مِنْ شَعِيرٍ أَوْ تَمْرٍ عَلَى الصَّغِيرِ وَالْكَبِيرِ وَالْحُرِّ وَالْمَمْلُوكِ زَادَ مُوسَى وَالذَّكَرِ وَالْأُنْثَىقَالَ أَبُو دَاوُد قَالَ فِيهِ أَيُّوبُ وَعَبْدُ اللَّهِ يَعْنِي الْعُمَرِيَّ فِي حَدِيثِهِمَا عَنْ نَافِعٍ ذَكَرٍ أَوْ أُنْثَى أَيْضًا",
                "id": "Telah menceritakan kepada Kami [Musaddad], bahwa [Yahya bin Sa'id] dan [Bisyr bin Al Mufadlal] menceritakan kepada mereka dari [Ubaidillah] dan di ganti dengan jalur periwayatan lain, Telah menceritakan kepada Kami [Musa bin Isma'il] telah menceritakan kepada kami [Aban] dari [ubaidhullah] dari [Nafi'] dari [Abdullah] dari Nabi shallAllahu wa'alaihi wa sallam bahwa beliau mewajibkan zakat fitrah, satu sha' kurma, atau satu sha' gandum atas setiap orang dewasa maupun anak kecil, merdeka, atau budak Musa menambahkan laki-laki dan wanita. Abu Daud berkata; [Ayyub dan Abdullah Al 'Umari] juga meriwayatkan seperti itu dalam hadits mereka berdua, dari [Nafi'] juga kalangan laki-laki maupun wanita. "
            },
            {
                "number": 1323,
                "arab": "حَدَّثَنَا الْهَيْثَمُ بْنُ خَالِدٍ الْجُهَنِيُّ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ الْجُعْفِيُّ عَنْ زَائِدَةَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي رَوَّادٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَكَانَ النَّاسُ يُخْرِجُونَ صَدَقَةَ الْفِطْرِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَاعًا مِنْ شَعِيرٍ أَوْ تَمْرٍ أَوْ سُلْتٍ أَوْ زَبِيبٍقَالَ قَالَ عَبْدُ اللَّهِ فَلَمَّا كَانَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ وَكَثُرَتْ الْحِنْطَةُ جَعَلَ عُمَرُ نِصْفَ صَاعٍ حِنْطَةً مَكَانَ صَاعٍ مِنْ تِلْكَ الْأَشْيَاءِ",
                "id": "Telah menceritakan kepada Kami [Al Haitsam bin Khalid Al Juhani] telah menceritakan kepada Kami [Husain bin Ali Al Ju'fi] dari [Zaidah] telah menceritakan kepada Kami [Abdul 'Aziz bin Abu Rawwad] dari [Nafi'] dari [Abdullah bin Umar], ia berkata; dahulu orang-orang mengeluarkan zakat fitrah pada zaman Nabi shallallahu 'alaihi wasallam satu sha' gandum, atau kurma atau sult (jenis tanaman gandum), atau kismis. Nafi' berkata; Abdullah berkata; tatkala Umar menjabat sebagai khalifah dan gandum telah banyak maka Umar menjadikan setengah sha' gandum menggantikan satu sha' hal-hal tersebut. "
            }
        ]
    }
}