{
    "status": true,
    "data": {
        "start": 1618,
        "end": 1764,
        "total": 147,
        "book": "abu-daud",
        "hadits": [
            {
                "number": 1618,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ حَدَّثَنَا سُفْيَانُ عَنْ مِسْعَرٍ عَنْ وَبَرَةَ قَالَسَأَلْتُ ابْنَ عُمَرَ مَتَى أَرْمِي الْجِمَارَ قَالَ إِذَا رَمَى إِمَامُكَ فَارْمِ فَأَعَدْتُ عَلَيْهِ الْمَسْأَلَةَ فَقَالَ كُنَّا نَتَحَيَّنُ زَوَالَ الشَّمْسِ فَإِذَا زَالَتْ الشَّمْسُ رَمَيْنَا",
                "id": "Telah menceritakan kepada Kami [Abdullah bin Muhammad Az Zuhri], telah menceritakan kepada Kami [Sufyan] dari [Mas'ar] dari [Wabarah], ia berkata; aku bertanya kepada [Ibnu Umar]; kapankah aku boleh melontar jumrah? Ia menjawab; apabila pemimpinmu telah melempar maka lemparlah! Aku mengulangi pertanyaanku kepadanya, kemudian ia berkata; Kami menunggu saat-saat tergelincirnya matahari, apabila matahari telah tergelincir maka Kami melempar. "
            },
            {
                "number": 1619,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ الْمَعْنَى قَالَا حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْأَفَاضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ آخِرِ يَوْمِهِ حِينَ صَلَّى الظُّهْرَ ثُمَّ رَجَعَ إِلَى مِنًى فَمَكَثَ بِهَا لَيَالِيَ أَيَّامِ التَّشْرِيقِ يَرْمِي الْجَمْرَةَ إِذَا زَالَتْ الشَّمْسُ كُلُّ جَمْرَةٍ بِسَبْعِ حَصَيَاتٍ يُكَبِّرُ مَعَ كُلِّ حَصَاةٍ وَيَقِفُ عِنْدَ الْأُولَى وَالثَّانِيَةِ فَيُطِيلُ الْقِيَامَ وَيَتَضَرَّعُ وَيَرْمِي الثَّالِثَةَ وَلَا يَقِفُ عِنْدَهَا",
                "id": "Telah menceritakan kepada Kami [Ali bin Bahr] dan [Abdullah bin Sa'id] secara makna, mereka berkata; telah menceritakan kepada Kami [Abu Khalid Al Ahmar] dari [Muhammad bin Ishaq] dari [Abdurrahman bin Al Qasim] dari [ayahnya] dari [Aisyah] ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam melakukan thawaf ifadhah pada hari terakhirnya ketika telah melakukan sholat Zhuhur, kemudian beliau kembali ke Mina dan tinggal di sana beberapa malam, pada Hari-hari Tasyriq. Beliau melempar jumrah apabila matahari telah tergelincir. Setiap jumrah dengan tujuh kerikil, beliau bertakbir bersama setiap lemparan kerikil, beliau berdiri pada jumrah pertama dan kedua kemudian berdiri lama dan merendah diri, serta melempar ketiga dan tidak berdiri pada jumrah ketiga. "
            },
            {
                "number": 1620,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ الْمَعْنَى قَالَا حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ ابْنِ مَسْعُودٍ قَالَلَمَّا انْتَهَى إِلَى الْجَمْرَةِ الْكُبْرَى جَعَلَ الْبَيْتَ عَنْ يَسَارِهِ وَمِنًى عَنْ يَمِينِهِ وَرَمَى الْجَمْرَةَ بِسَبْعِ حَصَيَاتٍ وَقَالَ هَكَذَا رَمَى الَّذِي أُنْزِلَتْ عَلَيْهِ سُورَةُ الْبَقَرَةِ",
                "id": "Telah menceritakan kepada Kami [Hafsh bin Umar], serta [Muslim bin Ibrahim] secara makna. Mereka berkata; telah menceritakan kepada Kami [Syu'bah] dari [Al Hakam] dari [Ibrahim] dari [Abdurrahman bin Yazid] dari [Ibnu Mas'ud], ia berkata; tatkala beliau telah sampai pada jumrah kubra beliau menjadikan Ka'bar berada di sisi kirinya dan Mina di sisi kanannya, beliau melempar jumrah dengan tujuh kerikil. Ibnu Mas'ud berkata; demikianlah orang yang kepadanya diturunkan Surat Al Baqarah melempar. "
            },
            {
                "number": 1621,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ وَمُحَمَّدُ ابْنَيْ أَبِي بَكْرٍ عَنْ أَبِيهِمَا عَنْ أَبِي الْبَدَّاحِ بْنِ عَدِيٍّ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ لِلرِّعَاءِ أَنْ يَرْمُوا يَوْمًا وَيَدَعُوا يَوْمًا",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Sufyan] dari [Abdullah] dan [Muhammad] dua anak Abu Bakr, dari [ayah mereka], dari [Abu Al Baddah bin 'Adi] dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam memberikan keringanan untuk para penggembala untuk melempar satu hari dan tidak melempar satu hari. "
            },
            {
                "number": 1622,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَبَا مِجْلَزٍ يَقُولُسَأَلْتُ ابْنَ عَبَّاسٍ عَنْ شَيْءٍ مِنْ أَمْرِ الْجِمَارِ قَالَ مَا أَدْرِي أَرَمَاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسِتٍّ أَوْ بِسَبْعٍ",
                "id": "Telah menceritakan kepada Kami [Abdurrahman bin Al Mubarak], telah menceritakan kepada Kami [Khalid bin Al Harits], telah menceritakan kepada Kami [Syu'bah] dari [Qatadah], ia berkata; saya mendengar [Abu Mijlaz] berkata; saya bertanya kepada [Ibnu Abbas] mengenai sebagian perkara jumrah. Ia berkata; aku tidak tahu apakah Rasulullah shallAllahu wa'alaihi wa sallam melemparnya dengan enam atau tujuh kerikil. "
            },
            {
                "number": 1623,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنِ زِيَادٍ حَدَّثَنَا الْحَجَّاجُ عَنْ الزُّهْرِيِّ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَمَى أَحَدُكُمْ جَمْرَةَ الْعَقَبَةِ فَقَدْ حَلَّ لَهُ كُلُّ شَيْءٍ إِلَّا النِّسَاءَقَالَ أَبُو دَاوُد هَذَا حَدِيثٌ ضَعِيفٌ الْحَجَّاجُ لَمْ يَرَ الزُّهْرِيَّ وَلَمْ يَسْمَعْ مِنْهُ",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Abdul Wahid bin Ziyad], telah menceritakan kepada Kami [Al Hajjaj] dari [Az Zuhri] dari ['Amrah binti Abdurrahman] dari [Aisyah], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Apabila salah seorang diantara kalian melempar jumrah 'aqabah, maka telah halal baginya segala sesuatu, kecuali wanita.\" Abu Daud berkata; hadits ini adalah hadits dha'if. Al Hajjaj tidak melihat Az Zuhri dan tidak mendengar darinya. "
            },
            {
                "number": 1624,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُمَّ ارْحَمْ الْمُحَلِّقِينَ قَالُوا يَا رَسُولَ اللَّهِ وَالْمُقَصِّرِينَ قَالَ اللَّهُمَّ ارْحَمْ الْمُحَلِّقِينَ قَالُوا يَا رَسُولَ اللَّهِ وَالْمُقَصِّرِينَ قَالَ وَالْمُقَصِّرِينَ",
                "id": "Telah menceritakan kepada Kami [Al Qa'nabi] dari [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallAllahu wa'alaihi wa sallam mengucapkan: \"ALLAAHUMMARHAM Al MUHALLIQIIN.\" (Ya Allah, rahmatilah orang-orang yang menggundul rambut kepalanya!) Para sahabat berkata; dan orang-orang yang memendekkan rambutnya wahai Rasulullah! Rasulullah shallAllahu wa'alaihi wa sallam mengucapkan: \"ALLAAHUMMARHAM Al MUHALLIQIIN.\" (Ya Allah, rahmatilah orang-orang yang menggundul rambut kepalanya!) Para sahabat berkata; dan orang-orang yang memendekkan rambutnya wahai Rasulullah! Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"WAL MUQASHSHIRIIN.\" (dan orang-orang yang memendekkan rambut kepalanya). "
            },
            {
                "number": 1625,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا يَعْقُوبُ يَعْنِي الْإِسْكَنْدَرَانِيَّ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَلَقَ رَأْسَهُ فِي حَجَّةِ الْوَدَاعِ",
                "id": "Telah menceritakan kepada Kami [Qutaibah], telah menceritakan kepada Kami [Ya'qub yaitu Al Iskandarani] dari [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallAllahu wa'alaihi wa sallam menggundul rambut kepalanya pada saat haji wada'. "
            },
            {
                "number": 1626,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا حَفْصٌ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَى جَمْرَةَ الْعَقَبَةِ يَوْمَ النَّحْرِ ثُمَّ رَجَعَ إِلَى مَنْزِلِهِ بِمِنًى فَدَعَا بِذِبْحٍ فَذُبِحَ ثُمَّ دَعَا بِالْحَلَّاقِ فَأَخَذَ بِشِقِّ رَأْسِهِ الْأَيْمَنِ فَحَلَقَهُ فَجَعَلَ يَقْسِمُ بَيْنَ مَنْ يَلِيهِ الشَّعْرَةَ وَالشَّعْرَتَيْنِ ثُمَّ أَخَذَ بِشِقِّ رَأْسِهِ الْأَيْسَرِ فَحَلَقَهُ ثُمَّ قَالَ هَا هُنَا أَبُو طَلْحَةَ فَدَفَعَهُ إِلَى أَبِي طَلْحَةَحَدَّثَنَا عُبَيْدُ بْنُ هِشَامٍ أَبُو نُعَيْمٍ الْحَلَبِيُّ وَعَمْرُو بْنُ عُثْمَانَ الْمَعْنَى قَالَا حَدَّثَنَا سُفْيَانُ عَنْ هِشَامِ بْنِ حَسَّانَ بِإِسْنَادِهِ بِهَذَا قَالَ فِيهِ قَالَ لِلْحَالِقِ ابْدَأْ بِشِقِّي الْأَيْمَنِ فَاحْلِقْهُ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Al 'Ala`], telah menceritakan kepada Kami [Hafsh] dari [Hisyam] dari [Ibnu Sirin] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam melempar jumrah 'aqabah pada hari Nahr kemudian beliau kembali ke perkemahannya di Mina lalu beliau meminta hewan kurban dan beliau menyembelih, kemudian beliau memanggil tukang cukur, beliau membagikan rambut kepada orang-orang yang berada di sekitarnya kemudian lalu tukang cukur tersebut mencukur kepala sebelah kiri kemudian beliau berkata: \"Apakah di sini ada Abu Thalhah?\" Lalu beliau menyerahkan rambut tersebut kepada Abu Thalhah. Telah menceritakan kepada Kami ['Ubaid bin Hisyam Abu Nu'aim Al Halabi] dan ['Amr bin Utsman] secara makna, mereka berdua berkata; telah menceritakan kepada Kami [Sufyan] dari [Hisyam bin Hassan] dengan sanad ini dalam hadits tersebut ia berkata; beliau berkata kepada tukang cukur: \"Mulailah dari sebelah kanan, dan gundullah!\". "
            },
            {
                "number": 1627,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ أَخْبَرَنَا خَالِدٌ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُسْأَلُ يَوْمَ مِنًى فَيَقُولُ لَا حَرَجَ فَسَأَلَهُ رَجُلٌ فَقَالَ إِنِّي حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ قَالَ اذْبَحْ وَلَا حَرَجَ قَالَ إِنِّي أَمْسَيْتُ وَلَمْ أَرْمِ قَالَ ارْمِ وَلَا حَرَجَ",
                "id": "Telah menceritakan kepada Kami [Nashr bin Ali], telah mengabarkan kepada Kami [Yazid bin Zurai'], telah mengabarkan kepada Kami [Khalid] dari [Ikrimah] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam ditanya pada hari di Mina dan beliau menjawab: \"Tidak mengapa\". Kemudian seseorang bertanya; sesungguhnya saya telah menggundul rambutku sebelum aku menyembelih. Beliau menjawab: \"Sembelihlah, tidak mengapa!\" Ia berkata; saya pada sore hari belum melempar jumrah. Beliau menjawab: \"Lemparlah, tidak mengapa!\""
            },
            {
                "number": 1628,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْحَسَنِ الْعَتَكِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ بَلَغَنِي عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ بْنِ عُثْمَانَ قَالَتْ أَخْبَرَتْنِي أُمُّ عُثْمَانَ بِنْتُ أَبِي سُفْيَانَ أَنَّ ابْنَ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ عَلَى النِّسَاءِ حَلْقٌ إِنَّمَا عَلَى النِّسَاءِ التَّقْصِيرُ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Al Hasan Al 'Ataki], telah menceritakan kepada Kami [Muhammad bin Bakr], telah menceritakan kepada Kami [Ibnu Juraij], ia berkata; telah sampai kepadaku dari [Shafiyyah binti Syaibah bin Utsman], ia berkata; telah mengabarkan kepadaku [Ummu Utsman binti Abu Sufyan] bahwa [Ibnu Abbas] berkata: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya yang wajib atas wanita adalah mengurangi.\""
            },
            {
                "number": 1629,
                "arab": "حَدَّثَنَا أَبُو يَعْقُوبَ الْبَغْدَادِيُّ ثِقَةٌ حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ عَنْ ابْنِ جُرَيْجٍ عَنْ عَبْدِ الْحَمِيدِ بْنِ جُبَيْرِ بْنِ شَيْبَةَ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ قَالَتْ أَخْبَرَتْنِي أُمُّ عُثْمَانَ بِنْتُ أَبِي سُفْيَانَ أَنَّ ابْنَ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ عَلَى النِّسَاءِ الْحَلْقُ إِنَّمَا عَلَى النِّسَاءِ التَّقْصِيرُ",
                "id": "Telah menceritakan kepada Kami [Abu Ya'qub Al Baghdadi], ia adalah orang-orang Tsiqah, telah menceritakan kepada Kami [Hisyam bin Yusuf] dari [Ibnu Juraij] dari [Abdul Hamid bin Jubair bin Syaibah] dari [Shafiyyah binti Syaibah], ia berkata; telah mengabarkan kepadaku [Ummu Utsman binti Abu Sufyan] bahwa [Ibnu Abbas] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wanita tidak wajib menggundul rambut akan tetapi yang wajib atas wanita adalah mengurangi.\""
            },
            {
                "number": 1630,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مَخْلَدُ بْنُ يَزِيدَ وَيَحْيَى بْنُ زَكَرِيَّا عَنْ ابْنِ جُرَيْجٍ عَنْ عِكْرِمَةَ بْنِ خَالِدٍ عَنْ ابْنِ عُمَرَ قَالَاعْتَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ أَنْ يَحُجَّ",
                "id": "Telah menceritakan kepada Kami [Utsman bin Abu Syaibah], telah menceritakan kepada Kami [Makhlad bin Yazid] dan [Yahya bin Zakariya] dari [Ibnu Juraij] dari [Ikrimah bin Khalid] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam melaksanakan umrah sebelum melaksanakan haji. "
            },
            {
                "number": 1631,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ ابْنِ أَبِي زَائِدَةَ حَدَّثَنَا ابْنُ جُرَيْجٍ وَمُحَمَّدُ بْنُ إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَوَاللَّهِ مَا أَعْمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَائِشَةَ فِي ذِي الْحِجَّةِ إِلَّا لِيَقْطَعَ بِذَلِكَ أَمْرَ أَهْلِ الشِّرْكِ فَإِنَّ هَذَا الْحَيَّ مِنْ قُرَيْشٍ وَمَنْ دَانَ دِينَهُمْ كَانُوا يَقُولُونَ إِذَا عَفَا الْوَبَرْ وَبَرَأَ الدَّبَرْ وَدَخَلَ صَفَرْ فَقَدْ حَلَّتْ الْعُمْرَةُ لِمَنْ اعْتَمَرْ فَكَانُوا يُحَرِّمُونَ الْعُمْرَةَ حَتَّى يَنْسَلِخَ ذُو الْحِجَّةِ وَالْمُحَرَّمُ",
                "id": "Telah menceritakan kepada Kami [Hannad bin As Sarri] dari [Ibnu Abu Zaidah] telah menceritakan kepada kami [Ibnu Juraij] dan [Muhammad bin Ishaq] dari [Abdullah bin Thawus] dari [ayahnya] dari [Ibnu Abbas], ia berkata; demi Allah, tidaklah Rasulullah shallAllahu wa'alaihi wa sallam mengumrahkan Aisyah pada Bulan Dzul Hijjah melainkan agar dengan hal tersebut beliau membantah perkara ahli syirik. Sesungguhnya sebuah kampung Quraisy dan orang-orang yang berkeyakinan seperti keyakinan mereka dahulu mengatakan; apabila rambut unta telah tumbuh, dan luka telah sembuh serta telah masuk Bulan Shafar maka telah halal umrah bagi orang yang berumrah. Dan mereka mengharamkan umrah hingga berlalu Bulan Dzul Hijjah dan Muharram. "
            },
            {
                "number": 1632,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ أَخْبَرَنِي رَسُولُ مَرْوَانَ الَّذِي أُرْسِلَ إِلَى أُمِّ مَعْقَلٍ قَالَتْكَانَ أَبُو مَعْقَلٍ حَاجًّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا قَدِمَ قَالَتْ أُمُّ مَعْقَلٍ قَدْ عَلِمْتَ أَنَّ عَلَيَّ حَجَّةً فَانْطَلَقَا يَمْشِيَانِ حَتَّى دَخَلَا عَلَيْهِ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ عَلَيَّ حَجَّةً وَإِنَّ لِأَبِي مَعْقَلٍ بَكْرًا قَالَ أَبُو مَعْقَلٍ صَدَقَتْ جَعَلْتُهُ فِي سَبِيلِ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطِهَا فَلْتَحُجَّ عَلَيْهِ فَإِنَّهُ فِي سَبِيلِ اللَّهِ فَأَعْطَاهَا الْبَكْرَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ قَدْ كَبِرْتُ وَسَقِمْتُ فَهَلْ مِنْ عَمَلٍ يُجْزِئُ عَنِّي مِنْ حَجَّتِي قَالَ عُمْرَةٌ فِي رَمَضَانَ تُجْزِئُ حَجَّةً",
                "id": "Telah menceritakan kepada Kami [Abu Kamil] telah menceritakan kepada Kami [Abu 'Awanah] dari [Ibrahim bin Muhajir] dari [Abu Bakr bin Abdurrahman], telah mengabarkan kepadaku [utusan Marwan] yang dikirim kepada [Ummu Ma'qil], ia berkata; dahulu Abu Ma'qil pernah berhaji bersama Rasulullah shallAllahu wa'alaihi wa sallam, kemudian tatkala ia datang, Ummu Ma'qil berkata; sungguh engkau telah mengetahui bahwa aku wajib berhaji. Kemudian mereka berdua berjalan hingga menemui beliau. Ummu Ma'qil berkata; wahai Rasulullah, sesungguhnya saya wajib berhaji, dan sesungguhnya Abu Ma'qil memiliki unta muda. Abu Ma'qil berkata; ia benar, saya telah menjadikannya di jalan Allah. Maka Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Berikan kepadanya, dan silahkan ia berhaji dengan mengendarainya, sesungguhnya hal tersebut adalah di jalan Allah.\" Kemudian Abu Ma'qil memberikan unta muda tersebut kepadanya. Lalu Ummu Ma'qil berkata; wahai Rasulullah, sesungguhnya saya adalah seorang wanita yang telah tua, dan sakit. Apakah ada amalan yang mencukupkanku dari melakukan haji? Beliau menjawab: \"Umrah pada Bulan Ramadhan, mencukupkan dari melakukan haji.\""
            },
            {
                "number": 1633,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ الطَّائِيُّ حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ الْوَهْبِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ عِيسَى بْنِ مَعْقَلِ بْنِ أُمِّ مَعْقَلٍ الْأَسَدِيِّ أَسَدِ خُزَيْمَةَ حَدَّثَنِي يُوسُفُ بْنُ عَبْدِ اللَّهِ بْنِ سَلَامٍ عَنْ جَدَّتِهِ أُمِّ مَعْقَلٍ قَالَتْلَمَّا حَجَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَجَّةَ الْوَدَاعِ وَكَانَ لَنَا جَمَلٌ فَجَعَلَهُ أَبُو مَعْقِلٍ فِي سَبِيلِ اللَّهِ وَأَصَابَنَا مَرَضٌ وَهَلَكَ أَبُو مَعْقِلٍ وَخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا فَرَغَ مِنْ حَجِّهِ جِئْتُهُ فَقَالَ يَا أُمَّ مَعْقِلٍ مَا مَنَعَكِ أَنْ تَخْرُجِي مَعَنَا قَالَتْ لَقَدْ تَهَيَّأْنَا فَهَلَكَ أَبُو مَعْقِلٍ وَكَانَ لَنَا جَمَلٌ هُوَ الَّذِي نَحُجُّ عَلَيْهِ فَأَوْصَى بِهِ أَبُو مَعْقِلٍ فِي سَبِيلِ اللَّهِ قَالَ فَهَلَّا خَرَجْتِ عَلَيْهِ فَإِنَّ الْحَجَّ فِي سَبِيلِ اللَّهِ فَأَمَّا إِذْ فَاتَتْكِ هَذِهِ الْحَجَّةُ مَعَنَا فَاعْتَمِرِي فِي رَمَضَانَ فَإِنَّهَا كَحَجَّةٍ فَكَانَتْ تَقُولُ الْحَجُّ حَجَّةٌ وَالْعُمْرَةُ عُمْرَةٌ وَقَدْ قَالَ هَذَا لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَدْرِي أَلِيَ خَاصَّةً",
                "id": "Telah menceritakan kepada Kami [Muhammad bin 'Auf Ath Thai], telah menceritakan kepada Kami [Ahmad bin Khalid Al Wahbi], telah menceritakan kepada Kami [Muhammad bin Ishaq] dari [Isa bin Ma'qil bin Ummu Ma'qil Al Asadi] yaitu Asad Khuzaimah, telah menceritakan kepadaku [Yusuf bin Abdullah bin Salam] dari [Neneknya yaitu Ummu Ma'qil], ia berkata; tatkala Rasulullah shallAllahu wa'alaihi wa sallam melakukan haji wada', dan Kami memiliki seekor unta, Abu Ma'qil menjadikannya di jalan Allah sementara Kami terserang penyakit. Dan Abu Ma'qil meninggal. Nabi shallallahu 'alaihi wasallam meninggal, dan tatkala telah selesai dari hajinya aku datang kepada beliau, lalu beliau berkata: \"Wahai Ummu Ma'qil, apa yang menghalangimu untuk keluar bersama Kami?\" ia berkata; sungguh saya telah bersiap-siap namun Abu Ma'qil meninggal, dan Kami memiliki seekor unta yang Kami gunakan untuk berhaji. Kemudian Abu Ma'qil berwasiat agar unta tersebut untuk di jalan Allah. Beliau berkata: \"Tidakkah engkau keluar dengan mengendarainya? Sesungguhnya haji adalah di jalan Allah, adapun apabila engkau telah tertinggal haji ini bersama Kami maka lakukanlah umrah pada Bulan Ramadhan, karena sesungguhnya umrah tersebut seperti haji.\" Ummu Ma'qil pernah berkata; haji adalah haji dan umrah adalah umrah. Dan Rasulullah shallAllahu wa'alaihi wa sallam telah mengatakan hal ini kepadaku, aku tidak tahu apakah hal khusus untukku? "
            },
            {
                "number": 1634,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَحَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ عَامِرٍ الْأَحْوَلِ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَأَرَادَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحَجَّ فَقَالَتْ امْرَأَةٌ لِزَوْجِهَا أَحِجَّنِي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى جَمَلِكَ فَقَالَ مَا عِنْدِي مَا أُحِجُّكِ عَلَيْهِ قَالَتْ أَحِجَّنِي عَلَى جَمَلِكَ فُلَانٍ قَالَ ذَاكَ حَبِيسٌ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ امْرَأَتِي تَقْرَأُ عَلَيْكَ السَّلَامَ وَرَحْمَةَ اللَّهِ وَإِنَّهَا سَأَلَتْنِي الْحَجَّ مَعَكَ قَالَتْ أَحِجَّنِي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ مَا عِنْدِي مَا أُحِجُّكِ عَلَيْهِ فَقَالَتْ أَحِجَّنِي عَلَى جَمَلِكَ فُلَانٍ فَقُلْتُ ذَاكَ حَبِيسٌ فِي سَبِيلِ اللَّهِ فَقَالَ أَمَا إِنَّكَ لَوْ أَحْجَجْتَهَا عَلَيْهِ كَانَ فِي سَبِيلِ اللَّهِ قَالَ وَإِنَّهَا أَمَرَتْنِي أَنْ أَسْأَلَكَ مَا يَعْدِلُ حَجَّةً مَعَكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْرِئْهَا السَّلَامَ وَرَحْمَةَ اللَّهِ وَبَرَكَاتِهِ وَأَخْبِرْهَا أَنَّهَا تَعْدِلُ حَجَّةً مَعِي يَعْنِي عُمْرَةً فِي رَمَضَانَ",
                "id": "Telah menceritakan kepada Kami [Musaddad], telah menceritakan kepada Kami [Abdul Warits] dari [Amir Al Ahwal] dari [Bakr bin Abdullah] dari [Ibnu Abbas], ia berkata; Rasulullah shallAllahu wa'alaihi wa sallam hendak melakukan haji, kemudian seorang wanita berkata kepada suaminya; hajikan saya bersama Rasulullah shallAllahu wa'alaihi wa sallam di atas untamu! Kemudian beliau berkata; aku tidak memiliki sesuatu untuk membawamu berhaji. Ia berkata; hajikan saya di atas untamu Fulani! Ia berkata; itu adalah unta yang tertahan untuk di jalan Allah 'azza wajalla. Kemudian ia datang kepada Rasulullah shallAllahu wa'alaihi wa sallam dan berkata; sesungguhnya isteriku mengucapkan salam dan rahmat kepadamu. Dan ia meminta kepadaku untuk melakukan haji bersamamu. Ia berkata; hajikan aku bersama Rasulullah shallAllahu wa'alaihi wa sallam Fulani! Lalu aku mengatakan unta itu adalah unta yang tertahan di jalan Allah. Kemudian beliau berkata: \"Sesungguhnya apabila engkau menghajikannya di atas unta tersebut maka hal itu adalah di jalan Allah.\" Ia berkata; dan ia memintaku untuk bertanya kepada anda, apakah yang sama dengan haji bersama anda? Kemudian Rasulullah shallAllahu wa'alaihi wa sallam bersabda: \"Sampaikan salam dan rahmat serta berkah kepadanya. Umrah pada Bulan Ramadhan adalah sama dengan haji bersamaku.\""
            },
            {
                "number": 1635,
                "arab": "حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ حَمَّادٍ حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْتَمَرَ عُمْرَتَيْنِ عُمْرَةً فِي ذِي الْقِعْدَةِ وَعُمْرَةً فِي شَوَّالٍ",
                "id": "Telah menceritakan kepada Kami [Abdul A'la bin Hammad], telah menceritakan kepada Kami [Daud bin Abdurrahman] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Aisyah] bahwa Rasulullah shallAllahu wa'alaihi wa sallam melakukan umrah dua kali, yaitu umrah pada Bulan Dzul Qa'dah dan Umrah pada Bulan Syawal. "
            },
            {
                "number": 1636,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ مُجَاهِدٍ قَالَسُئِلَ ابْنُ عُمَرَ كَمْ اعْتَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَرَّتَيْنِ فَقَالَتْ عَائِشَةُ لَقَدْ عَلِمَ ابْنُ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ اعْتَمَرَ ثَلَاثًا سِوَى الَّتِي قَرَنَهَا بِحَجَّةِ الْوَدَاعِ",
                "id": "Telah menceritakan kepada kami [An Nufaili], telah menceritakan kepada kami [Zuhair], telah menceritakan kepada kami [Abu Ishaq] dari [Mujahid], ia berkata; [Ibnu Umar] ditanya; Berapa kali Rasulullah shallallahu 'alaihi wasallam melakukan umrah? Ia berkata; Dua kali. 'Aisyah berkata; Sungguh, Ibnu Umar mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam telah melaksanakan umrah sebanyak tiga kali selain umrah yang beliau laksanakan bersamaan dengan haji wada'. "
            },
            {
                "number": 1637,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ وَقُتَيْبَةُ قَالَا حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ الْعَطَّارُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَاعْتَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعَ عُمَرٍ عُمْرَةَ الْحُدَيْبِيَةِ وَالثَّانِيَةَ حِينَ تَوَاطَئُوا عَلَى عُمْرَةٍ مَنْ قَابِلٍ وَالثَّالِثَةَ مِنْ الْجِعْرَانَةِ وَالرَّابِعَةَ الَّتِي قَرَنَ مَعَ حَجَّتِهِ",
                "id": "Telah menceritakan kepada kami [An Nufaili] dan [Qutaibah], mereka berkata; telah menceritakan kepada kami [Daud bin Abdurrahman Al 'Aththar] dari ['Amr bin Dinar] dari [Ikrimah] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam melaksanakan umrah sebanyak empat kali, yaitu: pertama, umrah Hudaibiyah, kedua ketika mereka bersepakat untuk melakukan umrah pada tahun mendatang, ketiga umrah dari Al Ji'ranah, dan keempat umrah yang beliau laksanakan bersamaan dengan haji beliau. "
            },
            {
                "number": 1638,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ وَهُدْبَةُ بْنُ خَالِدٍ قَالَا حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْتَمَرَ أَرْبَعَ عُمَرٍ كُلَّهُنَّ فِي ذِي الْقِعْدَةِ إِلَّا الَّتِي مَعَ حَجَّتِهِقَالَ أَبُو دَاوُد أَتْقَنْتُ مِنْ هَا هُنَا مِنْ هُدْبَةَ وَسَمِعْتُهُ مِنْ أَبِي الْوَلِيدِ وَلَمْ أَضْبِطْهُ عُمْرَةً زَمَنَ الْحُدَيْبِيَةِ أَوْ مِنْ الْحُدَيْبِيَةِ وَعُمْرَةَ الْقَضَاءِ فِي ذِي الْقِعْدَةِ وَعُمْرَةً مِنْ الْجِعْرَانَةِ حَيْثُ قَسَمَ غَنَائِمَ حُنَيْنٍ فِي ذِي الْقِعْدَةِ وَعُمْرَةً مَعَ حَجَّتِهِ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi], serta [Hudbah bin Khalid], mereka berkata; telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam melaksanakan umrah sebanyak empat kali, seluruhnya pada bulan Dzul Qa'dah kecuali umrah yang beliau laksanakan bersamaan dengan haji beliau. Abu Daud berkata; Dari sini aku hafal dari Hudbah, dan aku mendengarnya dari Abu Al Walid, dan belum menelitinya secara sempurna yaitu umrah pada saat berada di Hudaibiyah, atau dari Hudaibiyah, umrah qadha` (umratul qadha`) pada Bulan Dzul Hijjah, umrah dari Al Ji'ranah dimana beliau membagi harta rampasan perang pada Bulan Dzul Qa'dah serta umrah bersamaan dengan haji beliau. "
            },
            {
                "number": 1639,
                "arab": "حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ حَمَّادٍ حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ حَفْصَةَ بِنْتِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ عَنْ أَبِيهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِعَبْدِ الرَّحْمَنِ يَا عَبْدَ الرَّحْمَنِ أَرْدِفْ أُخْتَكَ عَائِشَةَ فَأَعْمِرْهَا مِنْ التَّنْعِيمِ فَإِذَا هَبَطْتَ بِهَا مِنْ الْأَكَمَةِ فَلْتُحْرِمْ فَإِنَّهَا عُمْرَةٌ مُتَقَبَّلَةٌ",
                "id": "Telah menceritakan kepada kami [Abdul A'la bin Hammad], telah menceritakan kepada kami [Daud bin Abdurrahman], telah menceritakan kepadaku [Abdullah bin Utsman bin Khutsaim] dari [Yusuf bin Mahik] dari [Hafshah binti Abdurrahman bin Abu Bakr] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam berkata kepada Abdurrahman: \"Boncengkan saudarimu 'Aisyah, dan umrahkan dia dari Tan'im, apabila engkau telah sampai di anak bukit hendaknya ia melakukan umrah, sesungguhnya umrah tersebut adalah umrah yang diterima (sah pelaksanaannya).\""
            },
            {
                "number": 1640,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا سَعِيدُ بْنُ مُزَاحِمِ بْنِ أَبِي مُزَاحِمٍ حَدَّثَنِي أَبِي مُزَاحِمٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ عَبْدِ اللَّهِ بْنِ أَسِيدٍ عَنْ مُحَرِّشٍ الْكَعْبِيِّ قَالَدَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجِعْرَانَةِ فَجَاءَ إِلَى الْمَسْجِدِ فَرَكَعَ مَا شَاءَ اللَّهُ ثُمَّ أَحْرَمَ ثُمَّ اسْتَوَى عَلَى رَاحِلَتِهِ فَاسْتَقْبَلَ بَطْنَ سَرِفَ حَتَّى لَقِيَ طَرِيقَ الْمَدِينَةِ فَأَصْبَحَ بِمَكَّةَ كَبَائِتٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id], telah menceritakan kepada kami [Sa'id bin Muzahim bin Abu Muzahim], telah menceritakan kepadaku [Abu Muzahim] dari [Abdul 'Aziz bin Abdullah bin Usaid] dari [Muharrisy Al Ka'bi], ia berkata; Nabi shallallahu 'alaihi wasallam memasuki Al Ji'ranah, kemudian beliau datang ke masjid dan melakukan sholat sebanyak yang Allah kehendaki, kemudian beliau berada di atas kendaraannya dan menghadap ke arah Sarif, hingga beliau bertemu dengan jalan menuju Madinah, dan pada pagi hari beliau seperti orang yang bermalam di Mekkah. "
            },
            {
                "number": 1641,
                "arab": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ أَبَانَ بْنِ صَالِحٍ وَعَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَامَ فِي عُمْرَةِ الْقَضَاءِ ثَلَاثًا",
                "id": "Telah menceritakan kepada kami [Daud bin Rusyaid], telah menceritakan kepada kami [Yahya bin Zakariya], telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Aban bin Shalih] dan dari [Ibnu Abu Najih] dari [Mujahid] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam bermukim di Mekkah pada waktu umratul qadha selama tiga hari. "
            },
            {
                "number": 1642,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفَاضَ يَوْمَ النَّحْرِ ثُمَّ صَلَّى الظُّهْرَ بِمِنًى يَعْنِي رَاجِعًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam melakukan thawaf ifadhah pada hari nahr kemudian melakukan sholat Zhuhur di Mina ketika, yaitu dalam keadaan kembali kepadanya. "
            },
            {
                "number": 1643,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَيَحْيَى بْنُ مَعِينٍ الْمَعْنَى وَاحِدٌ قَالَا حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ حَدَّثَنَا أَبُو عُبَيْدَةَ بْنُ عَبْدِ اللَّهِ بْنِ زَمْعَةَ عَنْ أَبِيهِ وَعَنْ أُمِّهِ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَيُحَدِّثَانِهِ جَمِيعًا ذَاكَ عَنْهَا قَالَتْ كَانَتْ لَيْلَتِي الَّتِي يَصِيرُ إِلَيَّ فِيهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَسَاءَ يَوْمِ النَّحْرِ فَصَارَ إِلَيَّ وَدَخَلَ عَلَيَّ وَهْبُ بْنُ زَمْعَةَ وَمَعَهُ رَجُلٌ مِنْ آلِ أَبِي أُمَيَّةَ مُتَقَمِّصَيْنِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِوَهْبٍ هَلْ أَفَضْتَ أَبَا عَبْدِ اللَّهِ قَالَ لَا وَاللَّهِ يَا رَسُولَ اللَّهِ قَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْزِعْ عَنْكَ الْقَمِيصَ قَالَ فَنَزَعَهُ مِنْ رَأْسِهِ وَنَزَعَ صَاحِبُهُ قَمِيصَهُ مِنْ رَأْسِهِ ثُمَّ قَالَ وَلِمَ يَا رَسُولَ اللَّهِ قَالَ إِنَّ هَذَا يَوْمٌ رُخِّصَ لَكُمْ إِذَا أَنْتُمْ رَمَيْتُمْ الْجَمْرَةَ أَنْ تَحِلُّوا يَعْنِي مِنْ كُلِّ مَا حُرِمْتُمْ مِنْهُ إِلَّا النِّسَاءَ فَإِذَا أَمْسَيْتُمْ قَبْلَ أَنْ تَطُوفُوا هَذَا الْبَيْتَ صِرْتُمْ حُرُمًا كَهَيْئَتِكُمْ قَبْلَ أَنْ تَرْمُوا الْجَمْرَةَ حَتَّى تَطُوفُوا بِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Yahya bin Ma'in] dengan makna yang sama, mereka berkata; telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Muhammad bin Ishaq], telah menceritakan kepada kami [Abu 'Ubaidah bin Abdullah bin Zam'ah] dari [ayahnya] dari [ibunya yaitu Zainab binti Abu Salamah] dari [Ummu Salamah], mereka semua menceritakan kepadanya hal tersebut dari Ummu Salamah, ia berkata; pada malam bagianku yang seharusnya Rasulullah shallallahu 'alaihi wasallam datang kepadaku adalah sore hari nahr. Wahb bin Zam'ah serta seseorang dari keluarga Umayyah dengan memakai jubah datang dan menemuiku. Lalu Rasulullah shallallahu 'alaihi wasallam berkata kepada Wahb: \"Apakah engkau telah melakukan thawaf ifadhah wahai Abu Abdullah?\" Ia berkata; demi Allah, belum wahai Rasulullah! Beliau berkata: \"Lepaskan jubah darimu!\" Abu Salamah berkata; kemudian ia melepas jubah tersebut dari kepalanya dan temannya pun melepas jubahnya. Kemudian Wahb bin Zam'ah berkata; kenapa wahai Rasulullah? Beliau berkata: \"Sesungguhnya ini adalah hari diberinya kalian keringanan apabila kalian melempar jumrah dari setiap apa yang haram bagi kalian kecuali bercampur dengan wanita. Apabila kalian berada di sore hari sebelum melakukan thawaf di Ka'bah, maka kalian dalam keadaan sedang berihram seperti keadaan kalian sebelum melempar jumrah, hingga kalian melakukan thawaf di Ka'bah.\""
            },
            {
                "number": 1644,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ عَائِشَةَ وَابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَّرَ طَوَافَ يَوْمِ النَّحْرِ إِلَى اللَّيْلِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Abdurrahman], telah menceritakan kepada kami [Sufyan] dari [Abu Az Zubair] dari [Aisyah] dan [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam menunda thawaf pada hari nahr (hari raya kurban) hingga malam. "
            },
            {
                "number": 1645,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي ابْنُ جُرَيْجٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَرْمُلْ فِي السَّبْعِ الَّذِي أَفَاضَ فِيهِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Daud], telah mengabarkan kepada kami [Ibnu Wahb], telah menceritakan kepadaku [Ibnu Juraij], dari ['Atha` bin Abu Rabah] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam tidak melaksanakan raml (berjalan cepat) pada tujuh putaran thawaf ifadhah. "
            },
            {
                "number": 1646,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ سُلَيْمَانَ الْأَحْوَلِ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ النَّاسُ يَنْصَرِفُونَ فِي كُلِّ وَجْهٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَنْفِرَنَّ أَحَدٌ حَتَّى يَكُونَ آخِرُ عَهْدِهِ الطَّوَافَ بِالْبَيْتِ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali], telah menceritakan kepada kami [Sufyan] dari [Sulaiman Al Ahwal] dari [Thawus] dari [Ibnu Abbas], ia berkata; orang-orang pergi dalam segala keadaan (berkelompok dan tidak berkelompok), kemudian Nabi shallallahu 'alaihi wasallam berkata: \"Janganlah seorang pun (dari kalian) meninggalkan Mekkah kembali kepada keluarganya, hingga (ibadah) terakhir ia lakukan adalah thawaf di Ka'bah.\""
            },
            {
                "number": 1647,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ صَفِيَّةَ بِنْتَ حُيَيٍّ فَقِيلَ إِنَّهَا قَدْ حَاضَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَلَّهَا حَابِسَتُنَا قَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا قَدْ أَفَاضَتْ فَقَالَ فَلَا إِذًا",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi], dari [Malik] dari [Hisyam bin 'Urwah], dari [ayahnya] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam menyebut-nyebut Shafiyah bintu Huyai, kemudian dikatakan kepada beliau; sesungguhnya ia mengalami haid. Lalu beliau berkata: \"Kemungkinan ia akan menahan kita (keluar dari Mekkah).\" Para sahabat berkata; wahai Rasulullah, sesungguhnya ia telah melakukan thawaf ifadhah. Kemudian beliau berkata: \"Jika demikian, ia tidak akan menahan kita.\""
            },
            {
                "number": 1648,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ الْحَارِثِ بْنِ عَبْدِ اللَّهِ بْنِ أَوْسٍ قَالَأَتَيْتُ عُمَرَ بْنَ الْخَطَّابِ فَسَأَلْتُهُ عَنْ الْمَرْأَةِ تَطُوفُ بِالْبَيْتِ يَوْمَ النَّحْرِ ثُمَّ تَحِيضُ قَالَ لِيَكُنْ آخِرُ عَهْدِهَا بِالْبَيْتِ قَالَ فَقَالَ الْحَارِثُ كَذَلِكَ أَفْتَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقَالَ عُمَرُ أَرِبْتَ عَنْ يَدَيْكَ سَأَلْتَنِي عَنْ شَيْءٍ سَأَلْتَ عَنْهُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِكَيْ مَا أُخَالِفَ",
                "id": "Telah menceritakan kepada kami ['Amr bin 'Aun], telah mengabarkan kepada kami [Abu 'Awanah] dari [Ya'la bin 'Atha`] dari [Al Walid bin Abdurrahman] dari [Al Harits bin Abdullah bin Aus], ia berkata; aku pernah mendatangi Umar bin Al Khathab dan bertanya kepadanya mengenai seorang wanita yang melakukan thawaf di Ka'bah pada hari nahr (hari raya kurban), kemudian ia mengalami haid. Umar berkata; hendaknya akhir masanya adalah di Ka'bah. Al Walid berkata; kemudian Al Harits berkata; demikianlah Rasulullah saallallahu 'alaihi wa sallam memberikan fatwa kepadaku. Al Harits berkata; kemudian Umar berkata; Apakah engkau merasa ragu hingga engkau menanyakan kepadaku sesuatu yang engkau tanyakan kepada Rasulullah shallallahu 'alaihi wasallam, agar aku menyelisihi beliau? "
            },
            {
                "number": 1649,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ عَنْ أَفْلَحَ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْأَحْرَمْتُ مِنْ التَّنْعِيمِ بِعُمْرَةٍ فَدَخَلْتُ فَقَضَيْتُ عُمْرَتِي وَانْتَظَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْأَبْطَحِ حَتَّى فَرَغْتُ وَأَمَرَ النَّاسَ بِالرَّحِيلِ قَالَتْ وَأَتَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيْتَ فَطَافَ بِهِ ثُمَّ خَرَجَ",
                "id": "Telah menceritakan kepada kami [Wahb bin Baqiyyah] dari [Khalid], dari [Aflah] dari [Al Qasim] dari [Aisyah] radliallahu 'anha, ia berkata; aku melakukan umrah dari Tan'im, aku memasukinya dan melakukan umrahku dan Rasulullah shallallahu 'alaihi wasallam menantiku di Al Abthah hingga selesai melakukan umrah, dan beliau memerintahkan orang-orang agar pergi (keluar dari Mekkah). Aisyah berkata; Rasulullah shallallahu 'alaihi wasallam datang ke Ka'bah dan melaksanakan thawaf, kemudian keluar. "
            },
            {
                "number": 1650,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو بَكْرٍ يَعْنِي الْحَنَفِيَّ حَدَّثَنَا أَفْلَحُ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْخَرَجْتُ مَعَهُ تَعْنِي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي النَّفْرِ الْآخِرِ فَنَزَلَ الْمُحَصَّبَ قَالَ أَبُو دَاوُد وَلَمْ يَذْكُرْ ابْنُ بَشَّارٍ قِصَّةَ بَعْثِهَا إِلَى التَّنْعِيمِ فِي هَذَا الْحَدِيثِ قَالَتْ ثُمَّ جِئْتُهُ بِسَحَرٍ فَأَذَّنَ فِي أَصْحَابِهِ بِالرَّحِيلِ فَارْتَحَلَ فَمَرَّ بِالْبَيْتِ قَبْلَ صَلَاةِ الصُّبْحِ فَطَافَ بِهِ حِينَ خَرَجَ ثُمَّ انْصَرَفَ مُتَوَجِّهًا إِلَى الْمَدِينَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Abu Bakr Al Hanafi], telah menceritakan kepada kami [Aflah] dari [Al Qasim] dari [Aisyah], ia berkata; aku keluar bersama Rasulullah shallallahu 'alaihi wasallam pada rombongan yang terakhir, dan beliau singgah di Muhashshab. Abu Daud berkata; Ibnu Basysyar tidak menyebutkan kisah pengiriman Aisyah ke Tan'im dalam hadits ini. Aisyah berkata; kemudian aku datang kepada beliau pada waktu sahur, lalu beliau mengizinkan para sahabatnya untuk berangkat (keluar Mekkah), beliau melewati Ka'bah sebelum sholat Subuh dan melakukan thawaf padanya ketika beliau keluar kemudian pergi menuju Madinah. "
            },
            {
                "number": 1651,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ طَارِقٍ أَخْبَرَهُ عَنْ أُمِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا جَازَ مَكَانًا مِنْ دَارِ يَعْلَى نَسِيَهُ عُبَيْدُ اللَّهِ اسْتَقْبَلَ الْبَيْتَ فَدَعَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Ma'in], telah menceritakan kepada kami [Hisyam bin Yusuf] dari [Ibnu Juraij], telah mengabarkan kepadaku ['ubaidhullah bin Abu Yazid] bahwa [Abdurrahman bin Thariq] telah mengabarkan kepadanya dari [ibunya] bahwa Rasulullah shallallahu 'alaihi wasallam apabila melewati suatu tempat di Daru Ya'la -ubaidhullah lupa- beliau menghadap kiblat dan lansung berdo'a. "
            },
            {
                "number": 1652,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْإِنَّمَا نَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُحَصَّبَ لِيَكُونَ أَسْمَحَ لِخُرُوجِهِ وَلَيْسَ بِسُنَّةٍ فَمَنْ شَاءَ نَزَلَهُ وَمَنْ شَاءَ لَمْ يَنْزِلْهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Yahya bin Sa'id] dari [Hisyam] dari [ayahnya] dari [Aisyah], ia berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam singgah di Al Muhashshab agar beliau mudah untuk keluar, hal tersebut bukanlah perkara yang sunnah. Maka barangsiapa yang ingin singgah padanya, ia boleh singgah, dan barangsiapa yang tidak ingin singgah padanya, maka ia boleh tidak singgah. "
            },
            {
                "number": 1653,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ الْمَعْنَى ح و حَدَّثَنَا مُسَدَّدٌ قَالُوا حَدَّثَنَا سُفْيَانُ حَدَّثَنَا صَالِحُ بْنُ كَيْسَانَ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ قَالَ قَالَ أَبُو رَافِعٍلَمْ يَأْمُرْنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أُنْزِلَهُ وَلَكِنْ ضَرَبْتُ قُبَّتَهُ فَنَزَلَهُ قَالَ مُسَدَّدٌ وَكَانَ عَلَى ثَقَلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ عُثْمَانُ يَعْنِي فِي الْأَبْطَحِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], dan [Utsman bin Abu Syaibah] secara makna. Dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Musaddad], mereka berkata; telah menceritakan kepada kami [Sufyan], telah menceritakan kepada kami [Shalih bin Kaisan] dari [Sulaiman bin Yasar], ia berkata; [Abu Rafi'] berkata; Rasulullah shallallahu 'alaihi wasallam tidak memerintahkanku agar mensinggahkan beliau, akan tetapi aku mendirikan tenda beliau, kemudian beliau pun singgah padanya. Musaddad berkata; Abu Rafi' pada saat itu berada di atas hewan yang membawa perbekalan Nabi shallallahu 'alaihi wasallam. Utsman berkata: bahwa itu terjadi di Al Abthah. "
            },
            {
                "number": 1654,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ حُسَيْنٍ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَيْنَ تَنْزِلُ غَدًا فِي حَجَّتِهِ قَالَ هَلْ تَرَكَ لَنَا عَقِيْلٌ مَنْزِلًا ثُمَّ قَالَ نَحْنُ نَازِلُونَ بِخَيْفِ بَنِي كِنَانَةَ حَيْثُ قَاسَمَتْ قُرَيْشٌ عَلَى الْكُفْرِ يَعْنِي الْمُحَصَّبَوَذَلِكَ أَنْ بَنِي كِنَانَةَ حَالَفَتْ قُرَيْشًا عَلَى بَنِي هَاشِمٍ أَنْ لَا يُنَاكِحُوهُمْ وَلَا يُبَايِعُوهُمْ وَلَا يُؤْوُوهُمْ قَالَ الزُّهْرِيُّ وَالْخَيْفُ الْوَادِي حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا عُمَرُ حَدَّثَنَا أَبُو عَمْرٍو يَعْنِي الْأَوْزَاعِيَّ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حِينَ أَرَادَ أَنْ يَنْفِرَ مِنْ مِنًى نَحْنُ نَازِلُونَ غَدًا فَذَكَرَ نَحْوَهُ وَلَمْ يَذْكُرْ أَوَّلَهُ وَلَا ذَكَرَ الْخَيْفَ الْوَادِي",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Ali bin Husain] dari ['Amr bin Utsman], dari [Usamah bin Zaid], ia berkata; aku katakan pada saat beliau melakukan haji; wahai Rasulullah, dimana engaku besok akan singgah? Beliau bertanya: \"Apakah 'Aqil (ibnu Abi Thalib) meninggalkan tempat singgah untuk kita?\" kemudian beliau bersabda: \"Kita akan singgah di lembah (padang) Bani Kinanah yang bernama Al Muhashshab, di tempat itulah orang-orang Quraisy saling bersumpah di atas kekafiran. Yang terjadi adalah bahwa Bani Kinanah bersumpah kepada orang-orang Quraisy atas Bani Hasyim bahwa mereka tidak akan menikahkan mereka, tidak berjual beli dengan mereka, serta tidak melindungi mereka.\" Az Zuhri berkata; Khaif adalah sebuah bukit. Telah menceritakan kepada kami [Mahmud bin Khalid], telah menceritakan kepada kami [Umar], telah menceritakan kepada kami [Abu 'Amr yaitu Al Auza'i] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda ketika hendak kembali dari Mina: \"Kita akan singgah besok….\" Kemudian ia menyebutkan permulaannya dan tidak menyebutkan Lembah Khaif. "
            },
            {
                "number": 1655,
                "arab": "حَدَّثَنَا مُوسَى أَبُو سَلَمَةَ حَدَّثَنَا حَمَّادٌ عَنْ حُمَيْدٍ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ وَأَيُّوبَ عَنْ نَافِعٍأَنَّ ابْنَ عُمَرَ كَانَ يَهْجَعُ هَجْعَةً بِالْبَطْحَاءِ ثُمَّ يَدْخُلُ مَكَّةَ وَيَزْعُمُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Musa Abu Salamah], telah menceritakan kepada kami [Hammad] dari [Humaid], dari [Bakr bin Abdullah] serta [Ayyub] dari [Nafi'] bahwa [Ibnu Umar] tidur di Al Bathha`, kemudian masuk ke Mekkah dan mengaku bahwa Rasulullah shallallahu 'alaihi wasallam melakukan hal tersebut. "
            },
            {
                "number": 1656,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا حُمَيْدٌ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عُمَرَ وَأَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ وَالْعَصْرَ وَالْمَغْرِبَ وَالْعِشَاءَ بِالْبَطْحَاءِ ثُمَّ هَجَعَ بِهَا هَجْعَةً ثُمَّ دَخَلَ مَكَّةَوَكَانَ ابْنُ عُمَرَ يَفْعَلُهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammad bin Salamah], telah mengabarkan kepada kami [Humaid] dari [Bakr bin Abdullah] dari [Ibnu Umar] dan [Ayyub], dari [Nafi'] bahwa Nabi shallallahu 'alaihi wasallam melakukan sholat Zhuhur dan 'Ashar, Maghrib serta Isya` di Al Bathha` lalu tidur di sana kemudian masuk ke Mekkah, dan Ibnu Umar melakukan hal tersebut. "
            },
            {
                "number": 1657,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عِيسَى بْنِ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّهُ قَالَوَقَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ بِمِنًى يَسْأَلُونَهُ فَجَاءَهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي لَمْ أَشْعُرْ فَحَلَقْتُ قَبْلَ أَنْ أَذْبَحَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اذْبَحْ وَلَا حَرَجَ وَجَاءَ رَجُلٌ آخَرُ فَقَالَ يَا رَسُولَ اللَّهِ لَمْ أَشْعُرْ فَنَحَرْتُ قَبْلَ أَنْ أَرْمِيَ قَالَ ارْمِ وَلَا حَرَجَ قَالَ فَمَا سُئِلَ يَوْمَئِذٍ عَنْ شَيْءٍ قُدِّمَ أَوْ أُخِّرَ إِلَّا قَالَ اصْنَعْ وَلَا حَرَجَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Isa bin Thalhah bin 'ubaidhullah] dari [Abdullah bin 'Amr bin Al 'Ash] bahwa ia berkata; Rasulullah shallallahu 'alaihi wasallam berdiri pada waktu haji wada' di Mina, mereka bertanya kepada beliau, kemudian seorang laki-laki datang dan berkata; wahai Rasulullah, sesungguhnya aku tidak mengetahui, sehingga aku menyembelih sebelum melempar jumrah. Beliau berkata: \"Lemparlah, tidak mengapa!\" Abdullah bin 'Amr berkata; tidaklah beliau pada saat itu ditanya mengenai sesuatu yang didahulukan atau diakhirkan melainkan beliau mengatakan: \"Lakukanlah, tidak mengapa!\""
            },
            {
                "number": 1658,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الشَّيْبَانِيِّ عَنْ زِيَادِ بْنِ عِلَاقَةَ عَنْ أُسَامَةَ بْنِ شَرِيكٍ قَالَخَرَجْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَاجًّا فَكَانَ النَّاسُ يَأْتُونَهُ فَمَنْ قَالَ يَا رَسُولَ اللَّهِ سَعَيْتُ قَبْلَ أَنْ أَطُوفَ أَوْ قَدَّمْتُ شَيْئًا أَوْ أَخَّرْتُ شَيْئًا فَكَانَ يَقُولُ لَا حَرَجَ لَا حَرَجَ إِلَّا عَلَى رَجُلٍ اقْتَرَضَ عِرْضَ رَجُلٍ مُسْلِمٍ وَهُوَ ظَالِمٌ فَذَلِكَ الَّذِي حَرِجَ وَهَلَكَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Jarir] dari [Asy Syaibani] dari [Ziyad bin 'Ilaqah] dari [Usamah bin Syarik], ia berkata; aku keluar bersama Nabi shallallahu 'alaihi wasallam untuk melakukan haji. Dan orang-orang datang kepada beliau, maka ada yang mengatakan; wahai Rasulullah, aku telah melakukan sa'i sebelum melakukan thawaf. Atau aku telah mendahulukan sesuatu dan mengakhirkan sesuatu. Dan beliau mengatakan: \"Tidak mengapa, tidak mengapa.\" Kecuali terhadap seseorang yang telah mencoreng kehormatan seorang muslim dan ia berbuat kedzaliman, maka itulah orang yang berdosa lagi binasa. "
            },
            {
                "number": 1659,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنِي كَثِيرُ بْنُ كَثِيرِ بْنِ الْمُطَّلِبِ بْنِ أَبِي وِدَاعَةَ عَنْ بَعْضِ أَهْلِهِ عَنْ جَدِّهِأَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِمَّا يَلِي بَابَ بَنِي سَهْمٍ وَالنَّاسُ يَمُرُّونَ بَيْنَ يَدَيْهِ وَلَيْسَ بَيْنَهُمَا سُتْرَةٌ قَالَ سُفْيَانُ لَيْسَ بَيْنَهُ وَبَيْنَ الْكَعْبَةِ سُتْرَةٌقَالَ سُفْيَانُ كَانَ ابْنُ جُرَيْجٍ أَخْبَرَنَا عَنْهُ قَالَ أَخْبَرَنَا كُثَيْرٌ عَنْ أَبِيهِ قَالَ فَسَأَلْتُهُ فَقَالَ لَيْسَ مِنْ أَبِي سَمِعْتُهُ وَلَكِنْ مِنْ بَعْضِ أَهْلِي عَنْ جَدِّي",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Sufyan bin 'Uyainah], telah menceritakan kepadaku [Katsir bin Katsir bin Al Muththalib bin Abu Wida'ah] dari [sebagian keluarganya], dari [Kakeknya], bahwa ia telah melihat Nabi shallallahu 'alaihi wasallam melakukan sholat di tempat yang terletak setelah pintu Bani Sahm, sementara orang-orang lewat di hadapannya, dan tidak ada sutrah (pembatas sholat) antara keduanya. Sufyan berkata; tidak ada sutrah antara beliau dan Ka'bah. Sufyan berkata; [Ibnu Juraij] telah mengabarkan kepada kami mengenai hal tersebut. Ia berkata; telah mengabarkan kepada kami [Kutsair] dari [ayahnya], ia berkata; aku bertanya kepadanya kemudian ia berkata; bukan dari ayahku aku mendengarnya, akan tetapi dari sebagian keluargaku, dari kakekku. "
            },
            {
                "number": 1660,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي يَحْيَى يَعْنِي ابْنَ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَلَمَّا فَتَحَ اللَّهُ تَعَالَى عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِمْ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ إِنَّ اللَّهَ حَبَسَ عَنْ مَكَّةَ الْفِيلَ وَسَلَّطَ عَلَيْهَا رَسُولَهُ وَالْمُؤْمِنِينَ وَإِنَّمَا أُحِلَّتْ لِي سَاعَةً مِنْ النَّهَارِ ثُمَّ هِيَ حَرَامٌ إِلَى يَوْمِ الْقِيَامَةِ لَا يُعْضَدُ شَجَرُهَا وَلَا يُنَفَّرُ صَيْدُهَا وَلَا تَحِلُّ لُقْطَتُهَا إِلَّا لِمُنْشِدٍ فَقَالَ عَبَّاسٌ أَوْ قَالَ قَالَ الْعَبَّاسُ يَا رَسُولَ اللَّهِ إِلَّا الْإِذْخِرَ فَإِنَّهُ لِقُبُورِنَا وَبُيُوتِنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا الْإِذْخِرَقَالَ أَبُو دَاوُد وَزَادَنَا فِيهِ ابْنُ الْمُصَفَّى عَنْ الْوَلِيدِ فَقَامَ أَبُو شَاهٍ رَجُلٌ مِنْ أَهْلِ الْيَمَنِ فَقَالَ يَا رَسُولَ اللَّهِ اكْتُبُوا لِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اكْتُبُوا لِأَبِي شَاهٍ قُلْتُ لِلْأَوْزَاعِيِّ مَا قَوْلُهُ اكْتُبُوا لِأَبِي شَاهٍ قَالَ هَذِهِ الْخُطْبَةُ الَّتِي سَمِعَهَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ فِي هَذِهِ الْقِصَّةِ قَالَ وَلَا يُخْتَلَى خَلَاهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Al Walid bin Muslim], telah menceritakan kepada kami [Al Auza'i], telah menceritakan kepadaku [Yahya bin Abu Katsir] dari [Abu Salamah], dari [Abu Hurairah], ia berkata; tatkala Allah Ta'ala menaklukkan Mekkah melalui Rasulullah shallallahu 'alaihi wasallam, beliau berdiri diantara mereka lalu memuji Allah kemudian berkata: \"Sesungguhnya Allah telah menahan gajah dari Ka'bah, dan Allah menguasakan Ka'bah kepada rasulNya serta orang-orang mukmin. Sesungguhnya hal itu dihalalkan bagiku sesaat pada waktu siang, kemudian haram hingga hari Kiamat, tidak boleh pohonnya ditebang, tidak boleh hewan buruannya diusir, dan tidak halal barang temuannya kecuali bagi orang yang hendak mengumumkan.\" Kemudian Abbas berkata; wahai Rasulullah, kecuali idzkhir, karena tanaman tersebut untuk kuburan dan rumah kami. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Kecuali idzkhir.\" Abu Daud berkata; dan [Ibnu Al Mushthafa] menambahkan padanya dari [Al Walid]; kemudian Abu Syah yaitu seorang laki-laki dari penduduk Yaman berdiri dan berkata; wahai Rasulullah, tuliskan untukku! Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Tuliskan untuk Abu Syah!\" Aku katakan kepada Al Auza'i; apakah ucapan Rasulullah shallallahu 'alaihi wasallam: \"Tuliskan untuk Abu Syah!\" Ia berkata; khutbah yang ia dengar dari Rasulullah shallallahu 'alaihi wasallam. Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Mujahid] dari [Thawus] dari [Ibnu Abbas] mengenai kisah ini, ia berkata; dan tidak boleh dipotong tanamannya. "
            },
            {
                "number": 1661,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا إِسْرَائِيلُ عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ أُمِّهِ عَنْ عَائِشَةَ قَالَتْقُلْتُ يَا رَسُولَ اللَّهِ أَلَا نَبْنِي لَكَ بِمِنًى بَيْتًا أَوْ بِنَاءً يُظِلُّكَ مِنْ الشَّمْسِ فَقَالَ لَا إِنَّمَا هُوَ مُنَاخُ مَنْ سَبَقَ إِلَيْهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Abdurrahman bin Mahdi], telah menceritakan kepada kami [Israil] dari [Ibrahim bin Muhajir] dari [Yusuf bin Mahik] dari [ibunya] dari [Aisyah], ia berkata; aku katakan; wahai Rasulullah, tidakkah kami bangun untukmu sebuah rumah atau bangunan yang dapat menaungimu dari matahari di Mina? Kemudian beliau berkata; sesungguhnya Mina adalah tempat berhenti bagi orang yang datang lebih dahulu. "
            },
            {
                "number": 1662,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ جَعْفَرِ بْنِ يَحْيَى بْنِ ثَوْبَانَ أَخْبَرَنِي عِمَارَةُ بْنُ ثَوْبَانَ حَدَّثَنِي مُوسَى بْنُ بَاذَانَ قَالَأَتَيْتُ يَعْلَى بْنَ أُمَيَّةَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ احْتِكَارُ الطَّعَامِ فِي الْحَرَمِ إِلْحَادٌ فِيهِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Abu 'Ashim] dari [Ja'far bin Yahya bin Tsauban], telah mengabarkan kepada kami ['Imarah bin Tsauban], telah menceritakan kepadaku [Musa bin Badzan]; ia berkata; aku telah mendatangi [Ya'la bin Umayyah] dan dia berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penimbunan makanan di tanah Haram merupakan perbuatan kufur yang dilakukan di dalamnya. "
            },
            {
                "number": 1663,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا خَالِدٌ عَنْ حُمَيْدٍ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَجُلٌ لِابْنِ عَبَّاسٍ مَا بَالُ أَهْلِ هَذَا الْبَيْتِ يَسْقُونَ النَّبِيذَ وَبَنُو عَمِّهِمْ يَسْقُونَ اللَّبَنَ وَالْعَسَلَ وَالسَّوِيقَ أَبُخْلٌ بِهِمْ أَمْ حَاجَةٌ فَقَالَ ابْنُ عَبَّاسٍ مَا بِنَا مِنْ بُخْلٍ وَلَا بِنَا مِنْ حَاجَةٍ وَلَكِنْ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رَاحِلَتِهِ وَخَلْفَهُ أُسَامَةُ بْنُ زَيْدٍ فَدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَرَابٍ فَأُتِيَ بِنَبِيذٍ فَشَرِبَ مِنْهُ وَدَفَعَ فَضْلَهُ إِلَى أُسَامَةَ بْنِ زَيْدٍ فَشَرِبَ مِنْهُ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْسَنْتُمْ وَأَجْمَلْتُمْ كَذَلِكَ فَافْعَلُوا فَنَحْنُ هَكَذَا لَا نُرِيدُ أَنْ نُغَيِّرَ مَا قَالَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami ['Amr bin 'Aun], telah menceritakan kepada kami [Khalid] dari [Humaid] dari [Bakr bin Abdullah], ia berkata; seorang laki-laki berkata kepada [Ibnu Abbas]; kenapa penghuni rumah ini memberi minum nabidz (minuman rendaman kurma, anggur atau yang lainnya), sementara anak-anak paman mereka minum susu, madu dan sawiq (makanan yang terbuat dari gandum dicampur dengan mentega)? Apakah ada sifat kikir pada mereka atau sebuah kebutuhan? Ibnu Abbas berkata; kami tidak kikir, dan kami tidak butuh, akan tetapi Rasulullah shallallahu 'alaihi wasallam pernah berada di atas kendaraannya dan dibelangnya Usamah bin Zaid. Kemudian beliau meminta minum, lalu beliau diberi nabidz lalu beliau minum sebagian darinya dan memberikan sisanya kepada Usamah bin Zaid, dan ia pun minum sebagian darinya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalian telah bertindak baik, memang demikian yang sepatutnya kalian lakukan.\" Maka, kami seperti demikian dan tidak ingin mengubah apa yang Rasulullah shallallahu 'alaihi wasallam katakan. "
            },
            {
                "number": 1664,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي الدَّرَاوَرْدِيَّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍأَنَّهُ سَمِعَ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ يَسْأَلُ السَّائِبَ بْنَ يَزِيدَ هَلْ سَمِعْتَ فِي الْإِقَامَةِ بِمَكَّةَ شَيْئًا قَالَ أَخْبَرَنِي ابْنُ الْحَضْرَمِيِّ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لِلْمُهَاجِرِينَ إِقَامَةٌ بَعْدَ الصَّدْرِ ثَلَاثًا",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi], telah menceritakan kepada kami [Abdul Aziz Ad Darawardi], dari [Abdurrahman bin Humaid] bahwa ia mendengar Umar bin Abdul Aziz bertanya kepada [As Saib bin Yazid]; apakah engkau pernah mendengar sesuatu mengenai bermukim di Mekkah? Ia berkata; telah mengabarkan kepadaku [Ibnu Al Hadhrami], bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam berkata kepada orang-orang muhajirin: \"(Lama) bermukim (di Mekkah) setelah menunaikan ibadah haji adalah tiga hari.\""
            },
            {
                "number": 1665,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْكَعْبَةَ هُوَ وَأُسَامَةُ بْنُ زَيْدٍ وَعُثْمَانُ بْنُ طَلْحَةَ الْحَجَبِيُّ وَبِلَالٌ فَأَغْلَقَهَا عَلَيْهِ فَمَكَثَ فِيهَا قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَسَأَلْتُ بِلَالًا حِينَ خَرَجَ مَاذَا صَنَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ جَعَلَ عَمُودًا عَنْ يَسَارِهِ وَعَمُودَيْنِ عَنْ يَمِينِهِ وَثَلَاثَةَ أَعْمِدَةٍ وَرَاءَهُ وَكَانَ الْبَيْتُ يَوْمَئِذٍ عَلَى سِتَّةِ أَعْمِدَةٍ ثُمَّ صَلَّىحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ إِسْحَقَ الْأَذْرَمِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مَالِكٍ بِهَذَا الْحَدِيثِ لَمْ يَذْكُرْ السَّوَارِيَ قَالَ ثُمَّ صَلَّى وَبَيْنَهُ وَبَيْنَ الْقِبْلَةِ ثَلَاثَةُ أَذْرُعٍ حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ الْقَعْنَبِيِّ قَالَ وَنَسِيتُ أَنْ أَسْأَلَهُ كَمْ صَلَّى",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam memasuki mekkah bersama Usamah bin Zaid dan Utsman bin Thalhah Al Hajabi, dan Bilal, kemudian beliau menutup pintunya dan tingggal di dalamnya. Abdullah bin Umar berkata; aku bertanya kepada [Bilal] ketika ia keluar; apa yang Rasulullah shallallahu 'alaihi wasallam lakukan? Ia berkata; beliau menjadikan satu tiang berada di sebelah kirinya dan dua tiang berada di sebelah kanannya, serta tiga tiang berada di belakang beliau. Ka'bah pada saat itu memiliki enam tiang, kemudian beliau melakukan sholat. Telah menceritakan kepada kami [Abdullah bin Muhammad bin Ishaq Al Adzrami], telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Malik] dengan hadits ini, ia tidak menyebutkan beberapa tiang. Ia mengatakan; kemudian beliau melakukan sholat diantara beliau dan kiblat berjarak tiga hasta. Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Abu Usamah] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam seperti makna hadits Al Qa'nabi, dan aku lupa bertanya kepadanya; berapa raka'at beliau melakukan sholat? "
            },
            {
                "number": 1666,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ مُجَاهِدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ صَفْوَانَ قَالَقُلْتُ لِعُمَرَ بْنِ الْخَطَّابِ كَيْفَ صَنَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ دَخَلَ الْكَعْبَةَ قَالَ صَلَّى رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb], telah menceritakan kepada kami [Jarir] dari [Yazid bin Abu Ziyad] dari [Mujahid] dari [Abdurrahman bin Shafwan], ia berkata; aku katakan kepada [Umar bin Al Khathab]; apa yang dilakukan Rasulullah shallallahu 'alaihi wasallam ketika masuk ke ka'bah? Dia menjawab; beliau melakukan sholat dua rakaat. "
            },
            {
                "number": 1667,
                "arab": "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ أَبِي الْحَجَّاجِ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا قَدِمَ مَكَّةَ أَبَى أَنْ يَدْخُلَ الْبَيْتَ وَفِيهِ الْآلِهَةُ فَأَمَرَ بِهَا فَأُخْرِجَتْ قَالَ فَأُخْرِجَ صُورَةُ إِبْرَاهِيمَ وَإِسْمَعِيلَ وَفِي أَيْدِيهِمَا الْأَزْلَامُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَاتَلَهُمْ اللَّهُ وَاللَّهِ لَقَدْ عَلِمُوا مَا اسْتَقْسَمَا بِهَا قَطُّ قَالَ ثُمَّ دَخَلَ الْبَيْتَ فَكَبَّرَ فِي نَوَاحِيهِ وَفِي زَوَايَاهُ ثُمَّ خَرَجَ وَلَمْ يُصَلِّ فِيهِ",
                "id": "Telah menceritakan kepada kami [Abu Ma'mar Abdullah bin 'Amr bin Abu Al Hajjaj], telah menceritakan kepada kami [Abdul Warits] dari [Ayyub] dari [Ikrimah] dari [Ibnu Abbas] bahwa Nabi Shallallahu 'alaihi sallam tatkala tiba di Mekkah, beliau menolak untuk masuk ke Ka'bah selama di dalamnya masih terdapat patung-patung yang disembah, maka beliau memerintahkan untuk mengeluarkan patung-patung tersebut, maka dikeluarkanlah patung-patung tersebut. Ibnu Abbas berkata; kemudian dikeluarkanlah patung berbentuk Nabi Ibrahim dan Ismail yang di tangan kedua patung tersebut terdapat anak-anak panah. Kemudian Rasulullah shlallallahu 'alaihi wa sallam berkata; semoga Allah memerangi mereka (orang musyrikin)! Demi Allah, sesungguhnya mereka (orang-orang musyrik) mengetahui bahwasanya mereka berdua tidak pernah mengundi nasib dengannya. Kemudian beliau masuk ke dalam ka'bah dan mengucapkan takbir pada penjuru-penjuru serta pojok-pojoknya, kemudian beliau keluar dan melakukan sholat di luar Ka'bah. "
            },
            {
                "number": 1668,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ عَنْ عَلْقَمَةَ عَنْ أُمِّهِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْكُنْتُ أُحِبُّ أَنْ أَدْخُلَ الْبَيْتَ فَأُصَلِّيَ فِيهِ فَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِي فَأَدْخَلَنِي فِي الْحِجْرِ فَقَالَ صَلِّي فِي الْحِجْرِ إِذَا أَرَدْتِ دُخُولَ الْبَيْتِ فَإِنَّمَا هُوَ قَطْعَةٌ مِنْ الْبَيْتِ فَإِنَّ قَوْمَكِ اقْتَصَرُوا حِينَ بَنَوْا الْكَعْبَةَ فَأَخْرَجُوهُ مِنْ الْبَيْتِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi], telah menceritakan kepada kami [Abdul Aziz] dari ['Alqamah] dari [ibunya] dari [Aisyah], ia berkata; aku ingin memasuki Ka'bah dan melakukan sholat di dalamnya. Kemudian Rasulullah shallallahu 'alaihi wasallam menggandeng tanganku dan memasukkanku ke dalam Hijr, dan beliau berkata: \"Apabila engkau hendak memasuki Ka'bah, sesungguhnya Hijr tersebut merupakan bagian dari Ka'bah. Sesungguhnya kaummu menguranginya ketika membangun Ka'bah, dan mengeluarkan Hijr dari Ka'bah.\""
            },
            {
                "number": 1669,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ إِسْمَعِيلَ بْنِ عَبْدِ الْمَلِكِ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ عِنْدِهَا وَهُوَ مَسْرُورٌ ثُمَّ رَجَعَ إِلَيَّ وَهُوَ كَئِيبٌ فَقَالَ إِنِّي دَخَلْتُ الْكَعْبَةَ وَلَوْ اسْتَقْبَلْتُ مِنْ أَمْرِي مَا اسْتَدْبَرْتُ مَا دَخَلْتُهَا إِنِّي أَخَافُ أَنْ أَكُونَ قَدْ شَقَقْتُ عَلَى أُمَّتِي",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Abdullah bin Daud], dari [Isma'il bin Abdul Malik] dari [Abdullah bin Abu Mulaikah] dari [Aisyah] bahwa Nabi Shallallahu 'alaihi sallam keluar dari sisinya dalam keadaan senang kemudian kembali kepadaku dalam keadaan sedih, lalu berkata: aku masuk ke dalam Ka'bah, sekiranya aku telah mengetahui (mendapatkan petunjuk) apa yang aku lakukan sekarang, maka aku tidak akan memasukinya, sebab aku khawatir akan menyusahkan umatku. "
            },
            {
                "number": 1670,
                "arab": "حَدَّثَنَا ابْنُ السَّرْحِ وَسَعِيدُ بْنُ مَنْصُورٍ وَمُسَدَّدٌ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ الْحَجَبِيِّ حَدَّثَنِي خَالِي عَنْ أُمِّي صَفِيَّةَ بِنْتِ شَيْبَةَ قَالَتْ سَمِعْتُ الَأسْلَمِيَّةَ تَقُولُقُلْتُ لِعُثْمَانَ مَا قَالَ لَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ دَعَاكَ قَالَ قَالَ إِنِّي نَسِيتُ أَنْ آمُرَكَ أَنْ تُخَمِّرَ الْقَرْنَيْنِ فَإِنَّهُ لَيْسَ يَنْبَغِي أَنْ يَكُونَ فِي الْبَيْتِ شَيْءٌ يَشْغَلُ الْمُصَلِّيَ قَالَ ابْنُ السَّرْحِ خَالِي مُسَافِعُ بْنُ شَيْبَةَ",
                "id": "Telah menceritakan kepada kami [Ibnu As Sarh] dan [Sa'id bin Manshur] serta [Musaddad], mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Manshur Al Hajabi], telah menceritakan kepadaku [pamanku], dari [ibuku yaitu Shafiyyah binti Syaibah], ia berkata; aku mendengar [Al Aslamiyyah] berkata; aku katakan kepada [Utsman]; apa yang Rasulullah shallallahu 'alaihi wasallam katakan kepadamu ketika beliau memanggilmu? Ia berkata; aku lupa untuk memerintahkanmu agar menutupi dua tanduk (kambing), sesungguhnya tidak selayaknya di Ka'bah terdapat sesuatu yang menyibukkan orang yang melakukan sholat. Ibnu As Sarh berkata; pamanku adalah Musafi' bin Syaibah. "
            },
            {
                "number": 1671,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ الْمُحَارِبِيُّ عَنْ الشَّيْبَانِيِّ عَنْ وَاصِلٍ الْأَحْدَبِ عَنْ شَقِيقٍ عَنْ شَيْبَةَ يَعْنِي ابْنَ عُثْمَانَ قَالَقَعَدَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ فِي مَقْعَدِكَ الَّذِي أَنْتَ فِيهِ فَقَالَ لَا أَخْرُجُ حَتَّى أَقْسِمَ مَالَ الْكَعْبَةِ قَالَ قُلْتُ مَا أَنْتَ بِفَاعِلٍ قَالَ بَلَى لَأَفْعَلَنَّ قَالَ قُلْتُ مَا أَنْتَ بِفَاعِلٍ قَالَ لِمَ قُلْتُ لِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ رَأَى مَكَانَهُ وَأَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ وَهُمَا أَحْوَجُ مِنْكَ إِلَى الْمَالِ فَلَمْ يُخْرِجَاهُ فَقَامَ فَخَرَجَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Abdurrahman bin Muhammad Al Muharibi], dari [Asy Syaibani] dari [Washil Al Ahdab] dari [Syaqiq] dari [Syaibah bin Utsman], ia berkata; [Umar bin Al Khathab] radliallahu 'anhu pernah duduk ditempat yang engkau duduki, lalu ia berkata; aku tidak akan keluar hingga membagikan harta Ka'bah. Syaibah berkata; aku katakan; engkau tidak akan melakukannya. Ia berkata; benar, sungguh aku akan melakukannya. Syaibah berkata; engkau tidak akan melakukannya. Ia berkata; kenapa? Aku katakan; karena Rasulullah shallallahu 'alaihi wasallam telah melihat tempatnya, begitu juga Abu Bakr radliallahu 'anhu, dan mereka berdua lebih membutuhkan harta tersebut daripada dirimu, namun mereka berdua tidak mengeluarkan harta tersebut. Kemudian ia berdiri lalu keluar. "
            },
            {
                "number": 1672,
                "arab": "حَدَّثَنَا حَامِدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ إِنْسَانٍ الطَّائِفِيِّ عَنْ أَبِيهِ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ الزُّبَيْرِ قَالَلَمَّا أَقْبَلْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ لِيَّةَ حَتَّى إِذَا كُنَّا عِنْدَ السِّدْرَةِ وَقَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي طَرَفِ الْقَرْنِ الْأَسْوَدِ حَذْوَهَا فَاسْتَقْبَلَ نَخِبًا بِبَصَرِهِ و قَالَ مَرَّةً وَادِيَهُ وَوَقَفَ حَتَّى اتَّقَفَ النَّاسُ كُلُّهُمْ ثُمَّ قَالَ إِنَّ صَيْدَ وَجٍّ وَعِضَاهَهُ حَرَامٌ مُحَرَّمٌ لِلَّهِ وَذَلِكَ قَبْلَ نُزُولِهِ الطَّائِفَ وَحِصَارِهِ لِثَقِيفٍ",
                "id": "Telah menceritakan kepada kami [Hamid bin Yahya], telah menceritakan kepada kami [Abdullah bin Al Harits] dari [Muhammad bin Abdullah bin Insan Ath Thai] dari [ayahnya] dari ['Urwah bin Az Zubair] dari [Az Zubair], ia berkata; tatkala kami bersama Rasulullah shallallahu 'alaihi wasallam datang dari Liyyah (gunung dekat dengan Thaif), hingga setelah kami sampai pada sebuah pohon bidara Rasulullah shallallahu 'alaihi wasallam berdiri pada pinggir Al Qarn Al Aswad (gunung kecil di Hijaz dekat dengan Thaif) sejajar dengannya, beliau menghadap ke arah Nakhib (bukit di Thaif) dengan pandangan beliau. Terkadang Az Zubair berkata; bukitnya. Beliau berdiri hingga seluruh orang berdiri, kemudian beliau bersabda: \"Sesungguhnya hewan buruan di Wajj (bukit di Thaif) serta pohon-pohonnya yang berduri adalah haram dan diharamkan oleh Allah.\" Dan hal tersebut terjadi sebelum beliau singgah dan mengepung Tsaqif. "
            },
            {
                "number": 1673,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُشَدُّ الرِّحَالُ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ مَسْجِدِ الْحَرَامِ وَمَسْجِدِي هَذَا وَالْمَسْجِدِ الْأَقْصَى",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak boleh diniatkan melakukan perjalanan dengan tujuan beribadah padanya kecuali ke tiga masjid, yaitu; Masjid Al Haram, Masjidku ini dan Masjid Al Aqsha.\""
            },
            {
                "number": 1674,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ أَبِيهِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَمَا كَتَبْنَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا الْقُرْآنَ وَمَا فِي هَذِهِ الصَّحِيفَةِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةُ حَرَامٌ مَا بَيْنَ عَائِرَ إِلَى ثَوْرٍ فَمَنْ أَحْدَثَ حَدَثًا أَوْ آوَى مُحْدِثًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ لَا يُقْبَلُ مِنْهُ عَدْلٌ وَلَا صَرْفٌ وَذِمَّةُ الْمُسْلِمِينَ وَاحِدَةٌ يَسْعَى بِهَا أَدْنَاهُمْ فَمَنْ أَخْفَرَ مُسْلِمًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ لَا يُقْبَلُ مِنْهُ عَدْلٌ وَلَا صَرْفٌ وَمَنْ وَالَى قَوْمًا بِغَيْرِ إِذْنِ مَوَالِيهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ لَا يُقْبَلُ مِنْهُ عَدْلٌ وَلَا صَرْفٌحَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَبِي حَسَّانَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ فِي هَذِهِ الْقِصَّةِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُخْتَلَى خَلَاهَا وَلَا يُنَفَّرُ صَيْدُهَا وَلَا تُلْتَقَطُ لُقَطَتُهَا إِلَّا لِمَنْ أَشَادَ بِهَا وَلَا يَصْلُحُ لِرَجُلٍ أَنْ يَحْمِلَ فِيهَا السِّلَاحَ لِقِتَالٍ وَلَا يَصْلُحُ أَنْ يُقْطَعَ مِنْهَا شَجَرَةٌ إِلَّا أَنْ يَعْلِفَ رَجُلٌ بَعِيرَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim At Taimi] dari [ayahnya] dari [Ali] radliallahu 'anhu, ia berkata; kami tidak mencatat dari Rasulullah shallallahu 'alaihi wasallam kecuali Al Qur'an, dan apa yang ada dalam lembaran ini. Ali berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Madinah adalah haram antara 'Air hingga Tsaur (keduanya adalah nama gunung di Madinah). Barangsiapa yang melakukan perkara dosa atau melindungi orang yang berbuat kejahatan maka baginya laknat Allah, para malaikat serta seluruh manusia, tidak diterima darinya amalan wajib dan yang sunnah. Perlindungan orang muslim adalah satu, orang yang paling rendah dapat memberikannya. Barangsiapa yang membatalkan perjanjian dan keamanan seorang muslim maka baginya laknat Allah, para malaikat serta seluruh manusia, tidak diterima darinya amalan wajib dan yang sunnah. Telah menceritakan kepada kami [Ibnu Al Mutsanna], telah menceritakan kepada kami [Abdushshamad], telah menceritakan kepada kami [Hammam], telah menceritakan kepada kami [Qatadah], dari [Abu Hassan] dari [Ali] radliallahu 'anhu dalam kisah ini dari Nabi shallallahu 'alaihi wasallam, beliau berkata: \"Tidak boleh dipotong tanamannya, tidak boleh di usir hewan buruannya dan tidak boleh diambil barang temuannya, kecuali bagi orang yang mengumumkannya, dan tidak selayaknya bagi seseorang di tempat tersebut membawa senjata untuk berperang dan tidak selayaknya ada sebuah pohon yang ditebang keculai seseorang yang hendak memberi makan untanya.\""
            },
            {
                "number": 1675,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَنَّ زَيْدَ بْنَ الْحُبَابِ حَدَّثَهُمْ حَدَّثَنَا سُلَيْمَانُ بْنُ كِنَانَةَ مَوْلَى عُثْمَانَ بْنِ عَفَّانَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ أَبِي سُفْيَانَ عَنْ عَدِيِّ بْنِ زَيْدٍ قَالَحَمَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلَّ نَاحِيَةٍ مِنْ الْمَدِينَةِ بَرِيدًا بَرِيدًا لَا يُخْبَطُ شَجَرُهُ وَلَا يُعْضَدُ إِلَّا مَا يُسَاقُ بِهِ الْجَمَلُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] bahwa [Zaid bin Al Hubab], telah menceritakan kepada mereka; telah menceritakan kepada kami [Sulaiman bin Kinanah] mantan budak Utsman bin Affan, telah mengabarkan kepada kami [Abdullah bin Abu Sufyan] dari [Adi bin Zaid], ia berkata; Rasulullah shallallahu 'alaihi wasallam membuat batas bagi Madinah kepada setiap sudut dari Madinah berjarak satu barid (empat farsakh), pohonnya tidak boleh ditebang kecuali yang digunakan untuk menggiring onta. "
            },
            {
                "number": 1676,
                "arab": "حَدَّثَنَا أَبُو سَلَمَةَ حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ حَدَّثَنِي يَعْلَى بْنُ حَكِيمٍ عَنْ سُلَيْمَانَ بْنِ أَبِي عَبْدِ اللَّهِ قَالَرَأَيْتُ سَعْدَ بْنَ أَبِي وَقَّاصٍ أَخَذَ رَجُلًا يَصِيدُ فِي حَرَمِ الْمَدِينَةِ الَّذِي حَرَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَبَهُ ثِيَابَهُ فَجَاءَ مَوَالِيهِ فَكَلَّمُوهُ فِيهِ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّمَ هَذَا الْحَرَمَ وَقَالَ مَنْ أَخَذَ أَحَدًا يَصِيدُ فِيهِ فَلْيَسْلُبْهُ ثِيَابَهُ فَلَا أَرُدُّ عَلَيْكُمْ طُعْمَةً أَطْعَمَنِيهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَكِنْ إِنْ شِئْتُمْ دَفَعْتُ إِلَيْكُمْ ثَمَنَهُ",
                "id": "Telah menceritakan kepada kami [Abu Usamah], telah menceritakan kepada kami [Jarir bin Hazim], telah menceritakan kepadaku [Ya'la bin Hakim] dari [Sulaiman bin Abu Abdullah], ia berkata; aku melihat [Sa'd bin Abu Waqqash] menangkap seorang laki-laki yang berburu di tanah haram Madinah yang telah diharamkan Rasulullah shallallahu 'alaihi wasallam. Kemudian ia melucuti pakaiannya, kemudian para walinya datang kepadanya dan berbicara dengannya mengenai orang tersebut. Lalu Sa'd berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah mengharamkan tanah haram ini, dan berkata: \"Barangsiapa yang menangkap seseorang yang berburu padanya (di tanah Haram), maka hendaknya ia melucuti pakaiannya.\" Maka aku tidak akan mengembalikan kepada kalian apa yang telah diberikan Rasulullah shallallahu 'alaihi wasallam kepadaku. Akan tetapi, apabila kalian mau, maka aku akan serahkan uang seharga barang tersebut kepada kalian. "
            },
            {
                "number": 1677,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا ابْنُ أَبِي ذِئْبٍ عَنْ صَالِحٍ مَوْلَى التَّوْأَمَةِ عَنْ مَوْلًى لِسَعْدٍأَنَّ سَعْدًا وَجَدَ عَبِيدًا مِنْ عَبِيدِ الْمَدِينَةِ يَقْطَعُونَ مِنْ شَجَرِ الْمَدِينَةِ فَأَخَذَ مَتَاعَهُمْ وَقَالَ يَعْنِي لِمَوَالِيهِمْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى أَنْ يُقْطَعَ مِنْ شَجَرِ الْمَدِينَةِ شَيْءٌ وَقَالَ مَنْ قَطَعَ مِنْهُ شَيْئًا فَلِمَنْ أَخَذَهُ سَلَبُهُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Yazid bin Harun], telah mengabarkan kepada kami [Ibnu Abu Dzi`bin] dari [Shalih] mantan budak At Tauamah, dari [mantan budak Sa'd], bahwa [Sa'd] telah mendapati seorang budak di antara budak-budak Madinah yang menebangi pohon di Madinah. Kemudian ia mengambil barang-barang mereka dan berkata kepada para wali mereka; aku telah mendengar Rasulullah shallallahu 'alaihi wasallam melarang menebang pohon di Madinah, dan beliau berkata: \"Barangsiapa yang menebang sebagian pohon di Madinah, maka sesuatu yang dilucuti darinya adalah milik orang yang menangkapnya.\""
            },
            {
                "number": 1678,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَفْصٍ أَبُو عَبْدِ الرَّحْمَنِ الْقَطَّانُ حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدٍ أَخْبَرَنِي خَارِجَةُ بْنُ الْحَارِثِ الْجُهَنِيُّ أَخْبَرَنِي أَبِي عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُخْبَطُ وَلَا يُعْضَدُ حِمَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَكِنْ يُهَشُّ هَشًّا رَفِيقًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Hafsh Abu Abdurrahman Al Qathtan], telah menceritakan kepada kami [Muhammad bin Khalid], telah mengabarkan kepadaku [Kharijah bin Al Harits Al Juhani], telah mengabarkan kepadaku [ayahku], dari [Jabir bin Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: larangan ditebang dan potongnya pohon adalah aturan yang ditetapkan Rasulullah shallallahu 'alaihi wasallam, akan tetapi boleh digoyangkan dengan pelan agar daunnya berjatuhan. "
            },
            {
                "number": 1679,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى ح حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ عَنْ ابْنِ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْتِي قِبَاءَ مَاشِيًا وَرَاكِبًا زَادَ ابْنُ نُمَيْرٍ وَيُصَلِّي رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yahya], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dari [Ibnu Numair] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam pernah datang ke Masjid Quba` dengan berjalan kaki dan juga berkendaraan. Ibnu Numair menambahkan dan melakukan sholat dua raka'at. "
            },
            {
                "number": 1680,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ حَدَّثَنَا الْمُقْرِئُ حَدَّثَنَا حَيْوَةُ عَنْ أَبِي صَخْرٍ حُمَيْدِ بْنِ زِيَادٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ أَحَدٍ يُسَلِّمُ عَلَيَّ إِلَّا رَدَّ اللَّهُ عَلَيَّ رُوحِي حَتَّى أَرُدَّ عَلَيْهِ السَّلَامَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Auf], telah menceritakan kepada kami [Al Muqri`], telah menceritakan kepada kami [Haiwah], dari [Abu Shakhr Humaid bin Ziyad] dari [Yazid bin Abdullah bin Qusaith] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam berkata: \"Tidaklah seseorang memberikan salam kepadaku melainkan Allah akan mengembalikan nyawaku hingga aku membalas salamnya.\""
            },
            {
                "number": 1681,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ قَرَأْتُ عَلَى عَبْدِ اللَّهِ بْنِ نَافِعٍ أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَجْعَلُوا بُيُوتَكُمْ قُبُورًا وَلَا تَجْعَلُوا قَبْرِي عِيدًا وَصَلُّوا عَلَيَّ فَإِنَّ صَلَاتَكُمْ تَبْلُغُنِي حَيْثُ كُنْتُمْ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], aku membacakan kepada [Abdullah bin Nafi'], telah mengabarkan kepadaku [Ibnu Abu Dzi`bin] dari [Sa'id Al Maqburi], dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian jadikan rumah-rumah kalian sebagai kuburan (tidak pernah dilaksanakan di dalamnya sholat dan juga tidak pernah dikumandangkan ayat-ayat Al Quran, sehingga seperti kuburan), dan jangan kalian jadikan kuburanku sebagai 'id (hari raya, yakni tempat yang selalu dikunjungi dan didatangi pada setiap waktu dan saat), bershalawatlah kepadaku, sesungguhnya shalawat kalian akan sampai kepadaku di manapun kalian berada.\""
            },
            {
                "number": 1682,
                "arab": "حَدَّثَنَا حَامِدُ بْنُ يَحْيَى حَدَّثَنَا مُحَمَّدُ بْنُ مَعْنٍ الْمَدَنِيُّ أَخْبَرَنِي دَاوُدُ بْنُ خَالِدٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ رَبِيعَةَ يَعْنِي ابْنَ الْهُدَيْرِ قَالَ مَا سَمِعْتُ طَلْحَةَ بْنَ عُبَيْدِ اللَّهِ يُحَدِّثُعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا قَطُّ غَيْرَ حَدِيثٍ وَاحِدٍ قَالَ قُلْتُ وَمَا هُوَ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُرِيدُ قُبُورَ الشُّهَدَاءِ حَتَّى إِذَا أَشْرَفْنَا عَلَى حَرَّةِ وَاقِمٍ فَلَمَّا تَدَلَّيْنَا مِنْهَا وَإِذَا قُبُورٌ بِمَحْنِيَّةٍ قَالَ قُلْنَا يَا رَسُولَ اللَّهِ أَقُبُورُ إِخْوَانِنَا هَذِهِ قَالَ قُبُورُ أَصْحَابِنَا فَلَمَّا جِئْنَا قُبُورَ الشُّهَدَاءِ قَالَ هَذِهِ قُبُورُ إِخْوَانِنَا",
                "id": "Telah menceritakan kepada kami [Hamid bin Yahya], telah menceritakan kepada kami [Muhammad bin Ma'n Al Madini], telah mengabarkan kepadaku [Daud bin Khalid] dari [Rabi'ah bin Abu Abdurrahman] dari [Rabi'ah bin Al Hudair], ia berkata; aku tidak mendengar [Thalhah bin 'ubaidhullah] menceritakan hadits dari Rasulullah shallallahu 'alaihi wasallam kecuali satu hadits, Rabi'ah bin Hudair berkata; aku katakan; apakah hadits tersebut? Ia berkata; kami pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam, beliau ingin pergi ke kuburan orang-orang yang mati syahid, hingga kami berada di atas tanah bebatuan yang (dikenal dengan nama) Waqim, kemudian tatkala kami telah dekat dari kuburan tersebut ternyata terdapat kuburan di tempat tikungan. Rabi'ah bin Hudair berkata; kami katakan; wahai Rasulullah, apakah ini kuburan saudara-saudara kita? Beliau berkata: \"Ini adalah kuburan sahabat-sahabat kita.\" Kemudian tatkala kami sampai pada kuburan orang-orang yang mati syahid beliau bersabda: \"Ini adalah kuburan saudara-saudara kita.\""
            },
            {
                "number": 1683,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَاخَ بِالْبَطْحَاءِ الَّتِي بِذِي الْحُلَيْفَةِ فَصَلَّى بِهَافَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَفْعَلُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik], dari [Nafi'], dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam menderumkan untanya di Al Bathha` yang berada di Dzul Hulaifah, kemudian beliau melakukan sholat padanya. Dan Abdullah bin Umar melakukan hal tersebut. "
            },
            {
                "number": 1684,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ قَالَ قَالَ مَالِكٌلَا يَنْبَغِي لِأَحَدٍ أَنْ يُجَاوِزَ الْمُعَرَّسِ إِذَا قَفَلَ رَاجِعًا إِلَى الْمَدِينَةِ حَتَّى يُصَلِّيَ فِيهَا مَا بَدَا لَهُ لِأَنَّهُ بَلَغَنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَرَّسَ بِهِقَالَ أَبُو دَاوُد سَمِعْتُ مُحَمَّدَ بْنَ إِسْحَقَ الْمَدَنِيَّ قَالَ الْمُعَرَّسُ عَلَى سِتَّةِ أَمْيَالٍ مِنْ الْمَدِينَةِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi], ia berkata; [Malik] berkata; tidak selayaknya seseorang melampaui Al Mu'arras apabila ia kembali ke Madinah hingga ia melakukan sholat padanya sesuai keinginannya, karena telah sampai kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam singgah di akhir malam untuk istirahat padanya. Abu Daud berkata; aku mendengar Muhammad bin Ishak Al Madani berkata; Al Mu'arras jaraknya enam mil dari Madinah. "
            },
            {
                "number": 1685,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ قَالَإِنِّي لَأَمْشِي مَعَ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ بِمِنًى إِذْ لَقِيَهُ عُثْمَانُ فَاسْتَخْلَاهُ فَلَمَّا رَأَى عَبْدُ اللَّهِ أَنْ لَيْسَتْ لَهُ حَاجَةٌ قَالَ لِي تَعَالَ يَا عَلْقَمَةُ فَجِئْتُ فَقَالَ لَهُ عُثْمَانُ أَلَا نُزَوِّجُكَ يَا أَبَا عَبْدِ الرَّحْمَنِ بِجَارِيَةٍ بِكْرٍ لَعَلَّهُ يَرْجِعُ إِلَيْكَ مِنْ نَفْسِكَ مَا كُنْتَ تَعْهَدُ فَقَالَ عَبْدُ اللَّهِ لَئِنْ قُلْتَ ذَاكَ لَقَدْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ اسْتَطَاعَ مِنْكُمْ الْبَاءَةَ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَمْ يَسْتَطِعْ مِنْكُمْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Ibrahim] dari ['Alqamah], ia berkata; sungguh aku pernah berjalan bersama [Abdullah bin Mas'ud] di Mina, tiba-tiba ia bertemu dengan Utsman, kemudian ia mengajaknya menyendiri. Kemudian tatkala Abdullah melihat bahwa ia tidak memiliki keperluan dengannya ia berkata kepadaku; kemarilah wahai 'Alqamah! Kemudian aku datang. Kemudian Utsman berkata kepadanya; maukah kami menikahkanmu wahai Abu Abdurrahman dengan seorang gadis, agar kembali kepadamu semangat dan keperkasaanmu seperti dahulu? Kemudian Abdullah berkata; jika engkau mengatakan demikian sungguh aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa di antara kalian yang memiliki kemampuan maka hendaknya ia menikah, karena hal tersebut lebih dapat menundukkan pandangannya dan lebih menjaga kemaluannya, dan barangsiapa di antara kalian yang belum mampu maka hendaknya ia berpuasa, karena puasa adalah kendali baginya.\""
            },
            {
                "number": 1686,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ حَدَّثَنِي عُبَيْدُ اللَّهِ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُنْكَحُ النِّسَاءُ لِأَرْبَعٍ لِمَالِهَا وَلِحَسَبِهَا وَلِجَمَالِهَا وَلِدِينِهَا فَاظْفَرْ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yahya bin Sa'id], telah menceritakan kepadaku ['ubaidhullah], telah menceritakan kepadaku [Sa'id bin Abu Sa'id], dari [ayahnya], dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau berkata: \"Wanita dinikahi karena empat perkara, yaitu: karena hartanya, keturunannya, kecantikannya dan karena agamannya. Carilah yang memiliki agama yang baik, maka engkau akan beruntung.\""
            },
            {
                "number": 1687,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ أَخْبَرَنَا الْأَعْمَشُ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَزَوَّجْتَ قُلْتُ نَعَمْ قَالَ بِكْرًا أَمْ ثَيِّبًا فَقُلْتُ ثَيِّبًا قَالَ أَفَلَا بِكْرٌ تُلَاعِبُهَا وَتُلَاعِبُكَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Abu Mu'awiyah], telah mengabarkan kepada kami [Al A'masy] dari [Salim bin Abu Al Ja'd] dari [Jabir bin Abdullah], ia berkata; Rasulullah shallallahu 'alaihi wasallam berkata kepadaku: \"Apakah engkau telah menikah?\" Aku katakan; Iya. Beliau bertanya: \"Gadis atau janda?\" Aku katakan; janda. Beliau berkata: \"Mengapa engkau tidak menikah dengan seorang gadis, sehingga engkau dapat bercanda dengannya dan dia bercanda denganmu?\""
            },
            {
                "number": 1688,
                "arab": "قَالَ أَبُو دَاوُد كَتَبَ إِلَيَّ حُسَيْنُ بْنُ حُرَيْثٍ الْمَرْوَزِيُّ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ الْحُسَيْنِ بْنِ وَاقِدٍ عَنْ عُمَارَةَ بْنِ أَبِي حَفْصَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ امْرَأَتِي لَا تَمْنَعُ يَدَ لَامِسٍ قَالَ غَرِّبْهَا قَالَ أَخَافُ أَنْ تَتْبَعَهَا نَفْسِي قَالَ فَاسْتَمْتِعْ بِهَا",
                "id": "Abu Daud berkata; [Husain bin Huraits Al Marwazi] menulis surat kepadaku; telah menceritakan kepada kami [Al Fadhl bin Musa] dari [Al Husain bin Waqid] dari ['Umarah bin Abu Hafsh] dari [Ikrimah] dari [Ibnu Abbas], ia berkata; seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; istriku tidak menolak tangan orang yang menyentuhnya. Beliau menjawab: Ceraikanlah dia! Dia berkata lagi; aku khawatir diriku sangat berhasrat kepadanya (sangat mencintainya). Beliau berkata: \"Kalau begitu, bersenang-senanglah dengannya!\""
            },
            {
                "number": 1689,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُسْتَلِمُ بْنُ سَعِيدٍ ابْنَ أُخْتِ مَنْصُورِ بْنِ زَاذَانَ عَنْ مَنْصُورٍ يَعْنِي ابْنَ زَاذَانَ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي أَصَبْتُ امْرَأَةً ذَاتَ حَسَبٍ وَجَمَالٍ وَإِنَّهَا لَا تَلِدُ أَفَأَتَزَوَّجُهَا قَالَ لَا ثُمَّ أَتَاهُ الثَّانِيَةَ فَنَهَاهُ ثُمَّ أَتَاهُ الثَّالِثَةَ فَقَالَ تَزَوَّجُوا الْوَدُودَ الْوَلُودَ فَإِنِّي مُكَاثِرٌ بِكُمْ الْأُمَمَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Ibrahim], telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Mustalim bin Sa'id anak saudari Manshur bin Zadzan], dari [Manshur bin Zadzan] dari [Mu'awiyah bin Qurrah] dari [Ma'qil bin Yasar], ia berkata; seorang laki-laki datang kepada Nabi Shallallahu 'alaihi sallam lalu berkata; sesungguhnya aku mendapati seorang wanita yang mempunyai keturunan yang baik dan cantik, akan tetapi dia mandul, apakah aku boleh menikahinya? Beliau menjawab: \"Tidak.\" Kemudian dia datang lagi kedua kalinya dan beliau melarangnya, kemudian ia datang ketiga kalinya lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Nikahkanlah wanita-wanita yang penyayang dan subur (banyak keturunan), karena aku akan berbangga kepada umat yang lain dengan banyaknya kalian.\""
            },
            {
                "number": 1690,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُحَمَّدٍ التَّيْمِيُّ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ بْنِ الْأَخْنَسِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ مَرْثَدَ بْنَ أَبِي مَرْثَدٍ الْغَنَوِيَّ كَانَ يَحْمِلُ الْأَسَارَى بِمَكَّةَ وَكَانَ بِمَكَّةَ بَغِيٌّ يُقَالُ لَهَا عَنَاقُ وَكَانَتْ صَدِيقَتَهُ قَالَ جِئْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَنْكِحُ عَنَاقَ قَالَ فَسَكَتَ عَنِّي فَنَزَلَتْ{ وَالزَّانِيَةُ لَا يَنْكِحُهَا إِلَّا زَانٍ أَوْ مُشْرِكٌ }فَدَعَانِي فَقَرَأَهَا عَلَيَّ وَقَالَ لَا تَنْكِحْهَا",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Muhammad At Taimi], telah menceritakan kepada kami [Yahya], dari ['ubaidhullah bin Al Akhnas] dari ['Amr bin Syu'aib] dari [ayahnya], dari [kakeknya] bahwa Martsad bin Abu Martsad Al Ghanawi membawa tawanan dari Mekkah dan di Mekkah terdapat seorang pelacur yang dikenal dengan nama 'Anaq dan dia dahulu adalah teman wanitanya. Martsad berkata; Aku menemui Nabi Shallallahu 'alaihi sallam lalu aku berkata; wahai Rasulullah, bolehkah aku menikahi 'Anaq? Martsad berkata; kemudian beliau diam, lalu turun ayat: \" Seorang wanita pezina tidaklah boleh dinikahi kecuali oleh seorang laki-laki pezina atau orang musyrik\". Lalu beliau memanggilku dan membacakan ayat tersebut di hadapanku seraya bersabda, \"Janganlah kamu menikahinya.\""
            },
            {
                "number": 1691,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَأَبُو مَعْمَرٍ قَالَا حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ حَبِيبٍ حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَنْكِحُ الزَّانِي الْمَجْلُودُ إِلَّا مِثْلَهُو قَالَ أَبُو مَعْمَرٍ حَدَّثَنِي حَبِيبٌ الْمُعَلِّمُ عَنْ عَمْرِو بْنِ شُعَيْبٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Abu Ma'mar], mereka berkata; telah menceritakan kepada kami [Abdul Warits] dari [Habib], telah menceritakan kepadaku ['Amr bin Syu'aib] dari [Sa'id Al Maqburi] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang pezina yang didera tidak boleh menikah kecuali dengan wanita seperti dirinya.\" [Abu Ma'mar] berkata; telah menceritakan kepadaku [Habib Al Mu'allim] dari ['Amr bin Syu'aib]. "
            },
            {
                "number": 1692,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا عَبْثَرٌ عَنْ مُطَرِّفٍ عَنْ عَامِرٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَعْتَقَ جَارِيَتَهُ وَتَزَوَّجَهَا كَانَ لَهُ أَجْرَانِ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari], telah menceritakan kepada kami ['Abtsar] dari [Mutharrif] dari ['Amir] dari [Abu Burdah] dari [Abu Musa], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang membebaskan budak wanita dan menikahinya, maka baginya dua pahala.\""
            },
            {
                "number": 1693,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ وَعَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْتَقَ صَفِيَّةَ وَجَعَلَ عِتْقَهَا صَدَاقَهَا",
                "id": "Telah menceritakan kepada kami ['Amr bin 'Aun], telah mengabarkan kepada kami [Abu 'Awanah] dari [Qatadah] dan [Abdul Aziz bin Shuhaib] dari [Anas bin Malik] bahwa Nabi shallallahu 'alaihi wasallam telah membebaskan Shafiyyah dan menjadikan pembebasannya sebagai maharnya. "
            },
            {
                "number": 1694,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَحْرُمُ مِنْ الرَّضَاعَةِ مَا يَحْرُمُ مِنْ الْوِلَادَةِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Abdullah bin Dinar] dari [Sulaiman bin Yasar] dari ['Urwah] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam bahwa Nabi shallallahu 'alaihi wasallam berkata: \"Sesuatu yang diharamkan karena persusuan, diharamkan seperti (diharamkan) karena nasab (keturunan).\""
            },
            {
                "number": 1695,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَأَنَّ أُمَّ حَبِيبَةَ قَالَتْ يَا رَسُولَ اللَّهِ هَلْ لَكَ فِي أُخْتِي قَالَ فَأَفْعَلُ مَاذَا قَالَتْ فَتَنْكِحُهَا قَالَ أُخْتَكِ قَالَتْ نَعَمْ قَالَ أَوَتُحِبِّينَ ذَلِكَ قَالَتْ لَسْتُ بِمُخْلِيَةٍ بِكَ وَأَحَبُّ مَنْ شَرِكَنِي فِي خَيْرٍ أُخْتِي قَالَ فَإِنَّهَا لَا تَحِلُّ لِي قَالَتْ فَوَاللَّهِ لَقَدْ أُخْبِرْتُ أَنَّكَ تَخْطُبُ دُرَّةَ أَوْ ذُرَّةَ شَكَّ زُهَيْرٌ بِنْتَ أَبِي سَلَمَةَ قَالَ بِنْتَ أُمِّ سَلَمَةَ قَالَتْ نَعَمْ قَالَ أَمَا وَاللَّهِ لَوْ لَمْ تَكُنْ رَبِيبَتِي فِي حِجْرِي مَا حَلَّتْ لِي إِنَّهَا ابْنَةُ أَخِي مِنْ الرَّضَاعَةِ أَرْضَعَتْنِي وَأَبَاهَا ثُوَيْبَةُ فَلَا تَعْرِضْنَ عَلَيَّ بَنَاتِكُنَّ وَلَا أَخَوَاتِكُنَّ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Zuhair], dari [Hisyam bin 'Urwah] dari ['Urwah] dari [Zainab binti Ummu Salamah] bahwa [Ummu Salamah] berkata; wahai Rasulullah, apakah engkau memiliki keinginan terhadap saudariku? Beliau berkata: \"Apa yang meski aku lakukan?\" Ia berkata; engkau menikahinya. Beliau berkata: \"Saudarimu?\" Ia berkata; Iya. Beliau berkata: \"Apakah engkau menginginkan hal tersebut?\" Ia berkata; bukan aku saja yang memilikimu, dan orang yang paling aku sukai untuk bersekutu denganku dalam kebaikan adalah saudariku. Beliau bersabda: \"Ia tidak halal bagiku.\" Ummu Habibah berkata; sungguh aku telah diberitahu bahwa engkau hendak meminang Durrah atau Dzurrah -Zuhair merasa ragu dalam hal tersebut- binti Abu Salamah. Beliau berkata: \"Binti Ummu Salamah?\" Ia berkata; Iya. Beliau berkata: \"Ketahuilah, demi Allah, seandainya ia bukan anak isteriku yang ada dalam pemeliharaanku, tidaklah ia halal bagiku, karena ia adalah anak saudaraku sepersusuan. Aku dan ayahnya telah disusui oleh Tsuwaibah, maka janganlah kalian menawarkan anak-anak dan saudara-saudara wanita kalian kepadaku."
            },
            {
                "number": 1696,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ الْعَبْدِيُّ أَخْبَرَنَا سُفْيَانُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْدَخَلَ عَلَيَّ أَفْلَحُ بْنُ أَبِي الْقُعَيْسِ فَاسْتَتَرْتُ مِنْهُ قَالَ تَسْتَتِرِينَ مِنِّي وَأَنَا عَمُّكِ قَالَتْ قُلْتُ مِنْ أَيْنَ قَالَ أَرْضَعَتْكِ امْرَأَةُ أَخِي قَالَتْ إِنَّمَا أَرْضَعَتْنِي الْمَرْأَةُ وَلَمْ يُرْضِعْنِي الرَّجُلُ فَدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَدَّثْتُهُ فَقَالَ إِنَّهُ عَمُّكِ فَلْيَلِجْ عَلَيْكِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir Al 'Abdi], telah mengabarkan kepada kami [Sufyan] dari [Hisyam bin 'Urwah] dari ['Urwah] dari [Aisyah] radliallahu 'anha, ia berkata; Aflah bin Abu Al Qu'ais menemuiku, kemudian aku menutup diri darinya. Ia berkata; apakah engkau menutup diri dariku? Aku adalah pamanmu. Aisyah berkata; aku katakan; dari mana? Ia berkata; engkau telah disusui isteri saudaraku. Aisyah berkata; sesungguhnya aku disusui oleh seorang wanita dan tidak disusui oleh seorang laki-laki. Kemudian Rasulullah shallallahu 'alaihi wasallam menemuiku dan aku menceritakannya kepada beliau. Lalu beliau berkata: \"Sesungguhnya ia adalah pamanmu, maka silahkan ia menemuimu.\""
            },
            {
                "number": 1697,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ أَشْعَثَ بْنِ سُلَيْمٍ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ الْمَعْنَى وَاحِدٌأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَعِنْدَهَا رَجُلٌ قَالَ حَفْصٌ فَشَقَّ ذَلِكَ عَلَيْهِ وَتَغَيَّرَ وَجْهُهُ ثُمَّ اتَّفَقَا قَالَتْ يَا رَسُولَ اللَّهِ إِنَّهُ أَخِي مِنْ الرَّضَاعَةِ فَقَالَ انْظُرْنَ مَنْ إِخْوَانُكُنَّ فَإِنَّمَا الرَّضَاعَةُ مِنْ الْمَجَاعَةِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar], telah menceritakan kepada kami [Syu'bah], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Sufyan] dari [Asy'ats bin Sulaim] dari [ayahnya] dari [Masruq] dari [Aisyah] dengan makna yang sama bahwa Rasulullah shallallahu 'alaihi wasallam menemuinya dan terdapat seorang laki-laki yang bersamanya -Hafsh berkata; hal tersebut terasa berat bagi beliau dan raut wajah beliau berubah. Kemudian Syu'bah dan Muhammad bin Katsir sama bersepakat mengatakan; Aisyah berkata; wahai Rasulallah, dia adalah saudaraku sepersusuan. Beliau berkata: \"Lihatlah siapa saudara-saudara sepersusuan kalian, sesungguhnya persusuan itu adalah karena lapar.\""
            },
            {
                "number": 1698,
                "arab": "حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ مُطَهَّرٍ أَنَّ سُلَيْمَانَ بْنَ الْمُغِيرَةِ حَدَّثَهُمْ عَنْ أَبِي مُوسَى عَنْ أَبِيهِ عَنْ ابْنٍ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنْ ابْنِ مَسْعُودٍ قَالَلَا رِضَاعَ إِلَّا مَا شَدَّ الْعَظْمَ وَأَنْبَتَ اللَّحْمَفَقَالَ أَبُو مُوسَى لَا تَسْأَلُونَا وَهَذَا الْحَبْرُ فِيكُمْ حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا وَكِيعٌ عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ عَنْ أَبِي مُوسَى الْهِلَالِيِّ عَنْ أَبِيهِ عَنْ ابْنِ مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ وَقَالَ أَنْشَزَ الْعَظْمَ",
                "id": "Telah menceritakan kepada kami [Abdussalam bin Muthahhar] bahwa [Sulaiman bin Al Mughirah], menceritakan kepada mereka dari [Abu Musa] dari [ayahnya] dari [Ibnu Abdullah bin Mas'ud] dari [Ibnu Mas'ud], ia berkata; Tidaklah (dianggap) persusuan kecuali yang dapat menguatkan tulang dan menumbuhkan daging. Abu Musa berkata; jangan kalian bertanya kepada kami sementara orang alim ini berada di antara kalian. Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari], telah menceritakan kepada kami [Waki'] dari [Sulaiman bin Al Mughirah] dari [Abu Musa Al Hilali], dari [ayahnya] dari [Ibnu Mas'ud] dari Nabi shallallahu 'alaihi wasallam dengan makna yang sama dengannya, dan ia berkata; serta menumbuhkan tulang. "
            },
            {
                "number": 1699,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَنْبَسَةُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأُمِّ سَلَمَةَأَنَّ أَبَا حُذَيْفَةَ بْنَ عُتْبَةَ بْنِ رَبِيعَةَ بْنِ عَبْدِ شَمْسٍ كَانَ تَبَنَّى سَالِمًا وَأَنْكَحَهُ ابْنَةَ أَخِيهِ هِنْدَ بِنْتَ الْوَلِيدِ بْنِ عُتْبَةَ بْنِ رَبِيعَةَ وَهُوَ مَوْلًى لِامْرَأَةٍ مِنْ الْأَنْصَارِ كَمَا تَبَنَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْدًا وَكَانَ مَنْ تَبَنَّى رَجُلًا فِي الْجَاهِلِيَّةِ دَعَاهُ النَّاسُ إِلَيْهِ وَوُرِّثَ مِيرَاثَهُ حَتَّى أَنْزَلَ اللَّهُ سُبْحَانَهُ وَتَعَالَى فِي ذَلِكَ{ ادْعُوهُمْ لِآبَائِهِمْ إِلَى قَوْلِهِ فَإِخْوَانُكُمْ فِي الدِّينِ وَمَوَالِيكُمْ }فَرُدُّوا إِلَى آبَائِهِمْ فَمَنْ لَمْ يُعْلَمْ لَهُ أَبٌ كَانَ مَوْلًى وَأَخًا فِي الدِّينِ فَجَاءَتْ سَهْلَةُ بِنْتُ سُهَيْلِ بْنِ عَمْرٍو الْقُرَشِيِّ ثُمَّ الْعَامِرِيِّ وَهِيَ امْرَأَةُ أَبِي حُذَيْفَةَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نَرَى سَالِمًا وَلَدًا وَكَانَ يَأْوِي مَعِي وَمَعَ أَبِي حُذَيْفَةَ فِي بَيْتٍ وَاحِدٍ وَيَرَانِي فُضْلًا وَقَدْ أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ فِيهِمْ مَا قَدْ عَلِمْتَ فَكَيْفَ تَرَى فِيهِ فَقَالَ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْضِعِيهِ فَأَرْضَعَتْهُ خَمْسَ رَضَعَاتٍ فَكَانَ بِمَنْزِلَةِ وَلَدِهَا مِنْ الرَّضَاعَةِ فَبِذَلِكَ كَانَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا تَأْمُرُ بَنَاتِ أَخَوَاتِهَا وَبَنَاتِ إِخْوَتِهَا أَنْ يُرْضِعْنَ مَنْ أَحَبَّتْ عَائِشَةُ أَنْ يَرَاهَا وَيَدْخُلَ عَلَيْهَا وَإِنْ كَانَ كَبِيرًا خَمْسَ رَضَعَاتٍ ثُمَّ يَدْخُلُ عَلَيْهَا وَأَبَتْ أُمُّ سَلَمَةَ وَسَائِرُ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُدْخِلْنَ عَلَيْهِنَّ بِتِلْكَ الرَّضَاعَةِ أَحَدًا مِنْ النَّاسِ حَتَّى يَرْضَعَ فِي الْمَهْدِ وَقُلْنَ لِعَائِشَةَ وَاللَّهِ مَا نَدْرِي لَعَلَّهَا كَانَتْ رُخْصَةً مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِسَالِمٍ دُونَ النَّاسِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami ['Anbasah], telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab], telah menceritakan kepadaku ['Urwah bin Az Zubair], dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam serta [Ummu Salamah] bahwa Abu Hudzaifah bin 'Utbah bin Rabi'ah bin Abdu Syams pernah mengangkat Salim sebagai anak, dan menikahkannya dengan anak saudaranya yaitu Hindun binti Al Walid bin 'Utbah bin Rabi'ah, sementara Salim adalah mantan budak seorang wanita anshar, sebagaimana Rasulullah shallallahu 'alaihi wasallam mengangkat Zaid sebagai anak. Dahulu pada masa jahiliyah orang yang mengangkat seseorang sebagai anak, maka orang-orang memanggilnya dengan menisbatkannya kepadanya dan diberi warisannya hingga Allah subhanahu wa ta'ala menurunkan wahyu mengenai hal tersebut: \"Panggilah mereka (anak-anak angkat itu) dengan (memakai) nama bapak-bapak mereka; itulah yang lebih adil pada sisi Allah, dan jika kamu tidak mengetahui bapak-bapak mereka, maka (panggilah mereka sebagai) saudara-saudaramu seagama dan maula-maulamu.\" Kemudian mereka dikembalikan nasabnya kepada bapak-bapak mereka, sedangkan yang tidak diketahui ayahnya maka ia adalah seorang maula dan saudara seagama. Kemudian Sahlah binti Suhail bin 'Amr Al Qurasyi Al 'Amiri yang merupakan isteri Abu Hudzaifah datang dan berkata; wahai Rasulullah, sesungguhnya dahulu kami melihat Salim masih kecil, dan ia tinggal bersamaku dan bersama Abu Hudzaifah dalam satu rumah. Ia melihatku dalam keadaan memakai pakaian kerja, sedangkan Allah 'azza wajalla telah menurunkan wahyu yang engkau mengerti, maka bagaimana pendapat engkau dalam hal tersebut? Kemudian Nabi shallallahu 'alaihi wasallam berkata kepadanya: \"Susuilah dia!\" Lalu Sahlah menyusuinya lima kali susuan, maka Salim sama seperti anaknya sepersusuan. Oleh karena itu Aisyah memerintahkan anak-anak wanita saudari-saudarinya serta anak-anak wanita saudara-saudaranya agar menyusui orang yang ia ingin melihat serta menemuinya walaupun ia adalah orang dewasa sebanyak lima kali susuan, kemudian orang tersebut dapat menemuinya. Sedangkan Ummu Salamah dan isteri-isteri Nabi yang lain menolak memasukkan seseorang kepada mereka dengan persusuan tersebut kecuali menyusu pada saat masih bayi. Dan mereka berkata kepada Aisyah; demi Allah, kami tidak tahu, kemungkinan hal tersebut merupakan keringanan dari Nabi shallallahu 'alaihi wasallam untuk Salim, bukan orang selainnya. "
            },
            {
                "number": 1700,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْكَانَ فِيمَا أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ مِنْ الْقُرْآنِ عَشْرُ رَضَعَاتٍ يُحَرِّمْنَ ثُمَّ نُسِخْنَ بِخَمْسٍ مَعْلُومَاتٍ يُحَرِّمْنَ فَتُوُفِّيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُنَّ مِمَّا يُقْرَأُ مِنْ الْقُرْآنِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi], dari [Malik] dari [Abdullah bin Abu Bakr bin Muhammad bin 'Amr bin Hazm] dari ['Amrah binti Abdurrahman], dari [Aisyah] bahwa ia berkata; dahulu di antara ayat yang diturunkan adalah sepuluh kali susuan mengharamkan (untuk dinikahi). Kemudian ayat tersebut dinaskh (dihapus) menjadi lima kali susuan mengharamkan (untuk dinikahi). Lalu Nabi Shallallahu 'alaihi sallam meninggal dan ayat tersebut termasuk di antara bagian Al Qur'an yang dibaca. "
            },
            {
                "number": 1701,
                "arab": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُحَرِّمُ الْمَصَّةُ وَلَا الْمَصَّتَانِ",
                "id": "Telah menceritakan kepada kami [Musaddad bin Musarhd], telah menceritakan kepada kami [Isma'il] dari [Ayyub] dari [Ibnu Abu Mulaikah] dari [Abdullah bin Az Zubair] dari [Aisyah] radliallahu 'anha, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Satu kali isapan dan dua kali isapan tidaklah mengharamkan.\""
            },
            {
                "number": 1702,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنَا ابْنُ الْعَلَاءِ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ حَجَّاجِ بْنِ حَجَّاجٍ عَنْ أَبِيهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ مَا يُذْهِبُ عَنِّي مَذَمَّةَ الرَّضَاعَةِ قَالَ الْغُرَّةُ الْعَبْدُ أَوْ الْأَمَةُ قَالَ النُّفَيْلِيُّ حَجَّاجُ بْنُ حَجَّاجٍ الْأَسْلَمِيُّ وَهَذَا لَفْظُهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Abu Mu'awiyah], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Ibnu Al 'Ala`], telah menceritakan kepada kami [Ibnu Idris] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Hajjaj] dari [ayahnya], ia berkata; aku katakan; wahai Rasulullah, apakah yang dapat menghilangkan hak persusuan? Beliau berkata: \"Seorang budak laki-laki atau seorang budak wanita.\""
            },
            {
                "number": 1703,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ عَنْ عَامِرٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُنْكَحُ الْمَرْأَةُ عَلَى عَمَّتِهَا وَلَا الْعَمَّةُ عَلَى بِنْتِ أَخِيهَا وَلَا الْمَرْأَةُ عَلَى خَالَتِهَا وَلَا الْخَالَةُ عَلَى بِنْتِ أُخْتِهَا وَلَا تُنْكَحُ الْكُبْرَى عَلَى الصُّغْرَى وَلَا الصُّغْرَى عَلَى الْكُبْرَى",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Zuhair], telah menceritakan kepada kami [Daud bin Abu Hindun], dari ['Amir], dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh seorang wanita dinikahi sebagai madu bibinya (saudari ayah), dan seorang bibi dinikahi sebagai madu anak wanita saudara laki-lakinya, dan tidak boleh seorang wanita dinikahi sebagai madu bibinya (saudari ibu) dan seorang bibi sebagai madu bagi anak wanita saudara wanitanya. Dan tidak boleh seorang kakak wanita dinikahi sebagai madu adik wanitanya, dan adik wanita dinikahi sebagai madu kakak wanitanya.\""
            },
            {
                "number": 1704,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَنْبَسَةُ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي قَبِيصَةُ بْنُ ذُؤَيْبٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُجْمَعَ بَيْنَ الْمَرْأَةِ وَخَالَتِهَا وَبَيْنَ الْمَرْأَةِ وَعَمَّتِهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami ['Anbasah], telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab], telah mengabarkan kepadaku [Qabishah bin Dzuaib] bahwa ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam melarang menggabungkan (dalam satu perkawinan) antara seorang wanita dengan bibi (saudara wanita ibu) serta seorang wanita dengan bibi (saudara wanita ayah). "
            },
            {
                "number": 1705,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا خَطَّابُ بْنُ الْقَاسِمِ عَنْ خُصَيْفٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَرِهَ أَنْ يُجْمَعَ بَيْنَ الْعَمَّةِ وَالْخَالَةِ وَبَيْنَ الْخَالَتَيْنِ وَالْعَمَّتَيْنِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Khaththab bin Al Qasim], dari [Khushaif] dari [Ikrimah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam bahwa beliau tidak menyukai untuk menggabungkan (dalam satu perkawinan) antara seorang bibi (dari pihak bapak) dengan bibi (dari pihak ibu), serta antara dua bibi (dari pihak ibu) dengan dua bibi (dari pihak ayah). "
            },
            {
                "number": 1706,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّهُ سَأَلَ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ قَوْلِ اللَّهِ تَعَالَى{ وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنْ النِّسَاءِ }قَالَتْ يَا ابْنَ أُخْتِي هِيَ الْيَتِيمَةُ تَكُونُ فِي حِجْرِ وَلِيِّهَا فَتُشَارِكُهُ فِي مَالِهِ فَيُعْجِبُهُ مَالُهَا وَجَمَالُهَا فَيُرِيدُ وَلِيُّهَا أَنْ يَتَزَوَّجَهَا بِغَيْرِ أَنْ يُقْسِطَ فِي صَدَاقِهَا فَيُعْطِيَهَا مِثْلَ مَا يُعْطِيهَا غَيْرُهُ فَنُهُوا أَنْ يَنْكِحُوهُنَّ إِلَّا أَنْ يُقْسِطُوا لَهُنَّ وَيَبْلُغُوا بِهِنَّ أَعْلَى سُنَّتِهِنَّ مِنْ الصَّدَاقِ وَأُمِرُوا أَنْ يَنْكِحُوا مَا طَابَ لَهُمْ مِنْ النِّسَاءِ سِوَاهُنَّ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ ثُمَّ إِنَّ النَّاسَ اسْتَفْتَوْا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ هَذِهِ الْآيَةِ فِيهِنَّ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ وَيَسْتَفْتُونَكَ فِي النِّسَاءِ قُلْ اللَّهُ يُفْتِيكُمْ فِيهِنَّ وَمَا يُتْلَى عَلَيْكُمْ فِي الْكِتَابِ فِي يَتَامَى النِّسَاءِ اللَّاتِي لَا تُؤْتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ }قَالَتْ وَالَّذِي ذَكَرَ اللَّهُ أَنَّهُ يُتْلَى عَلَيْهِمْ فِي الْكِتَابِ الْآيَةُ الْأُولَى الَّتِي قَالَ اللَّهُ سُبْحَانَهُ فِيهَا{ وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنْ النِّسَاءِ }قَالَتْ عَائِشَةُ وَقَوْلُ اللَّهِ عَزَّ وَجَلَّ فِي الْآيَةِ الْآخِرَةِ{ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ }هِيَ رَغْبَةُ أَحَدِكُمْ عَنْ يَتِيمَتِهِ الَّتِي تَكُونُ فِي حِجْرِهِ حِينَ تَكُونُ قَلِيلَةَ الْمَالِ وَالْجَمَالِ فَنُهُوا أَنْ يَنْكِحُوا مَا رَغِبُوا فِي مَالِهَا وَجَمَالِهَا مِنْ يَتَامَى النِّسَاءِ إِلَّا بِالْقِسْطِ مِنْ أَجْلِ رَغْبَتِهِمْ عَنْهُنَّ قَالَ يُونُسُ وَقَالَ رَبِيعَةُ فِي قَوْلِ اللَّهِ عَزَّ وَجَلَّ{ وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا فِي الْيَتَامَى }قَالَ يَقُولُ اتْرُكُوهُنَّ إِنْ خِفْتُمْ فَقَدْ أَحْلَلْتُ لَكُمْ أَرْبَعًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Amr bin As Sarh Al Mishri], telah menceritakan kepada kami [Ibnu Wahb], telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab], ia berkata; telah mengabarkan kepadaku ['Urwah bin Az Zubair] bahwa ia pernah bertanya kepada [Aisyah] radliallahu 'anha istri Rasulullah shallallahu 'alaihi wasallam mengenai firman Allah: \"Dan jika kamu takut tidak akan dapat berlaku adil terhadap (hak-hak) perempuan yang yatim (bilamana kamu mengawininya), maka kawinilah wanita-wanita (lain) yang kamu senangi.\" Dia berkata: wahai anak saudariku, yang dimaksud adalah wanita yatim yang berada di bawah asuhan seorang walinya, kemudian wanita tersebut berserikat dalam hartanya, kemudian walinya tertarik dengan hartanya dan kecantikannya. Kemudian walinya tersebut ingin menikahinya dengan tanpa berbuat adil dalam memberikan maharnya, dia memberikannya sebagaimana yang diberikan orang lain. Maka mereka dilarang untuk menikahi para wanita yatim tersebut kecuali bersikap adil kepada mereka dan memberikan mahar yang lebih tinggi dari mahar mereka yang biasa. Dan para wali tersebut diperintahkan untuk menikahi wanita lain yang mereka senangi. Urwah berkata; Aisyah berkata; kemudian orang-orang meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam setelah turunnya ayat mengenai mereka ini. Lalu Allah menurunkan \"Dan mereka minta fatwa kepadamu tentang para wanita. Katakanlah: \"Allah memberi fatwa kepadamu tentang mereka, dan apa yang dibacakan kepadamu dalam Al Quran (juga memfatwakan) tentang para wanita yatim yang kamu tidak memberikan kepada mereka apa yang ditetapkan untuk mereka, sedang kamu ingin mengawini mereka).\" Aisyah berkata; yang Allah sebutkan bahwa sesuatu tersebut yang dibacakan atas mereka dalam Al Qur'an adalah ayat pertama yang Allah firmankan: \"(Dan jika kamu takut tidak akan dapat berlaku adil terhadap (hak-hak) perempuan yang yatim (bilamana kamu mengawininya), Maka kawinilah wanita-wanita (lain) yang kamu senangi) \". Aisyah berkata: sedangkan firman Allah dalam ayat terakhir: \"(sedang kamu ingin mengawini mereka), \" adalah ketidaksenangan salah seorang di antara kalian kepada wanita yatimnya yang berada dalam asuhannya ketika kecantikan dan harta mereka sedikit. Maka mereka dilarang menikahi wanita yatim yang ingin dinikahinya karena kecantikan dan hartanya kecuali dengan keadilan karena ketidak senangan kepada mereka. Yunus berkata; Rabi'ah berkata tentang firman Allah: \"(Dan jika kamu takut tidak akan dapat berlaku adil terhadap (hak-hak) perempuan yang yatim (bilamana kamu mengawininya). Maka kawinilah wanita-wanita (lain) yang kamu senangi), \" ia berkata; tinggalkanlah mereka, dan jika kamu khawatir tidak dapat menahan nafsu, maka Aku telah menghalalkan bagi kalian empat wanita. "
            },
            {
                "number": 1707,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنِي أَبِي عَنْ الْوَلِيدِ بْنِ كَثِيرٍ حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ حَلْحَلَةَ الدِّيْلِيُّ أَنَّ ابْنَ شِهَابٍ حَدَّثَهُ أَنَّ عَلِيَّ بْنَ الْحُسَيْنِ حَدَّثَهُأَنَّهُمْ حِينَ قَدِمُوا الْمَدِينَةَ مِنْ عِنْدِ يَزِيدَ بْنِ مُعَاوِيَةَ مَقْتَلَ الْحُسَيْنِ بْنِ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُمَا لَقِيَهُ الْمِسْوَرُ بْنُ مَخْرَمَةَ فَقَالَ لَهُ هَلْ لَكَ إِلَيَّ مِنْ حَاجَةٍ تَأْمُرُنِي بِهَا قَالَ فَقُلْتُ لَهُ لَا قَالَ هَلْ أَنْتَ مُعْطِيَّ سَيْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنِّي أَخَافُ أَنْ يَغْلِبَكَ الْقَوْمُ عَلَيْهِ وَايْمُ اللَّهِ لَئِنْ أَعْطَيْتَنِيهِ لَا يُخْلَصُ إِلَيْهِ أَبَدًا حَتَّى يُبْلَغَ إِلَى نَفْسِي إِنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ خَطَبَ بِنْتَ أَبِي جَهْلٍ عَلَى فَاطِمَةَ رَضِيَ اللَّهُ عَنْهَا فَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَخْطُبُ النَّاسَ فِي ذَلِكَ عَلَى مِنْبَرِهِ هَذَا وَأَنَا يَوْمَئِذٍ مُحْتَلِمٌ فَقَالَ إِنَّ فَاطِمَةَ مِنِّي وَأَنَا أَتَخَوَّفُ أَنْ تُفْتَنَ فِي دِينِهَا قَالَ ثُمَّ ذَكَرَ صِهْرًا لَهُ مِنْ بَنِي عَبْدِ شَمْسٍ فَأَثْنَى عَلَيْهِ فِي مُصَاهَرَتِهِ إِيَّاهُ فَأَحْسَنَ قَالَ حَدَّثَنِي فَصَدَقَنِي وَوَعَدَنِي فَوَفَّى لِي وَإِنِّي لَسْتُ أُحَرِّمُ حَلَالًا وَلَا أُحِلُّ حَرَامًا وَلَكِنْ وَاللَّهِ لَا تَجْتَمِعُ بِنْتُ رَسُولِ اللَّهِ وَبِنْتُ عَدُوِّ اللَّهِ مَكَانًا وَاحِدًا أَبَدًاحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ وَعَنْ أَيُّوبَ عَنْ ابْنِ أَبِي مُلَيْكَةَ بِهَذَا الْخَبَرِ قَالَ فَسَكَتَ عَلِيٌّ عَنْ ذَلِكَ النِّكَاحِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd], telah menceritakan kepadaku [ayahku] dari [Al Walid bin Katsir], telah menceritakan kepadaku [Muhammad bin 'Amr bin Halhalah Ad Dili], bahwa [Ibnu Syihab] telah menceritakan kepadanya bahwa [Ali bin Al Husain] telah menceritakan kepada mereka ketika datang ke Madinah dari sisi Yazid bin Mu'awiyah pada waktu terbunuhnya Al Husain bin Ali radliallahu 'anhuma [Al Miswar bin Makhramah] menemuinya dan berkata; apakah engkau memiliki keperluan kepadaku? Ali bin Al Husain berkata; aku katakan kepadanya; tidak. Ia berkata; apakah engkau akan memberikan pedang Rasulullah shallallahu 'alaihi wasallam kepadaku? Sesungguhnya aku khawatir orang-orang mengalahkanmu untuk mendapatkannya. Demi Allah, apabila engkau memberikannya kepadaku maka tidak akan ada orang yang dapat mengambilnya hingga nyawaku di cabut. Sesungguhnya Ali bin Abu Thalib radliallahu 'anhu meminang anak wanita Abu Jahl sebagai madu Fathimah radliallahu 'anha, lalu aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda ketika sedang berkhutbah kepada orang-orang mengenai hal tersebut di atas mimbar beliau ini, sementara pada saat itu aku adalah orang yang sudah baligh: \"Sesungguhnya Fathimah adalah bagian dariku dan aku khawatir ia terfitnah dalam agamanya.\" Kemudian beliau menyebutkan besan beliau yang berasal dari Bani Abdu Syams, kemudian beliau memujinya dalam berbesanan dengan beliau. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ia berbicara kepadaku dan membenarkanku, berjanji kepadaku dan menepati janjinya kepadaku, sesungguhnya aku tidak mengharamkan sesuatu yang halal dan menghalalkan sesuatu yang haram. Akan tetapi demi Allah, tidak boleh berkumpul anak wanita Rasulullah dan anak wanita musuh Allah dalam satu tempat untuk selamanya.\" Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Urwah] dari [Ayyub] dari [Ibnu Abu Mulaikah] dengan khabar ini. Ia berkata; Ali menahan dari pernikahan tersebut. "
            },
            {
                "number": 1708,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ وَقُتَيْبَةُ بْنُ سَعِيدٍ الْمَعْنَى قَالَ أَحْمَدُ حَدَّثَنَا اللَّيْثُ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ الْقُرَشِيُّ التَّيْمِيُّ أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ حَدَّثَهُأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يَقُولُ إِنَّ بَنِي هِشَامِ بْنِ الْمُغِيرَةِ اسْتَأْذَنُونِي أَنْ يُنْكِحُوا ابْنَتَهُمْ مِنْ عَلِيِّ بْنِ أَبِي طَالِبٍ فَلَا آذَنُ ثُمَّ لَا آذَنُ ثُمَّ لَا آذَنُ إِلَّا أَنْ يُرِيدَ ابْنُ أَبِي طَالِبٍ أَنْ يُطَلِّقَ ابْنَتِي وَيَنْكِحَ ابْنَتَهُمْ فَإِنَّمَا ابْنَتِي بَضْعَةٌ مِنِّي يُرِيبُنِي مَا أَرَابَهَا وَيُؤْذِينِي مَا آذَاهَاوَالْإِخْبَارُ فِي حَدِيثِ أَحْمَدَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus], dan [Qutaibah bin Sa'id] secara makna, Ahmad berkata; telah menceritakan kepada kami [Al Laits], telah menceritakan kepadaku [Abdullah bin 'ubaidhullah bin Abu Mulaikah Al Qurasyi At Taimi] bahwa [Al Miswar bin Makhramah] telah menceritakan kepadanya bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam di atas mimbar berkata: \"Sesungguhnya Bani Hisyam bin Al Mughirah telah meminta izin kepadaku untuk menikahkan anak wanita mereka dengan Ali bin Abu Thalib, maka aku tidak memberikan izin, kemudian tidak memberikan izin, kemudian tidak memberikan izin, kecuali Ibnu Abu Thalib ingin menceraikan anak wanitaku dan menikahi anak wanita mereka. Sesungguhnya anak wanitaku adalah bagian dariku, meragukannya apa yang meragukanku dan menyakitiku apa yang menyakitinya.\" Dan pengabaran ada dalam hadits Ahmad. "
            },
            {
                "number": 1709,
                "arab": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ الزُّهْرِيِّ قَالَكُنَّا عِنْدَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ فَتَذَاكَرْنَا مُتْعَةَ النِّسَاءِ فَقَالَ لَهُ رَجُلٌ يُقَالُ لَهُ رَبِيعُ بْنُ سَبْرَةَ أَشْهَدُ عَلَى أَبِي أَنَّهُ حَدَّثَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهَا فِي حَجَّةِ الْوَدَاعِ",
                "id": "Telah menceritakan kepada kami [Musaddad bin Musarhad], telah menceritakan kepada kami [Abdul Warits] dari [Isma'il bin Umayyah] dari [Az Zuhri], ia berkata; kami pernah berada di sisi Umar bin Abdul Aziz, kemudian kami saling menyebutkan menikahi wanita secara mut'ah. Lalu terdapat seorang laki-laki yang dipanggil [Rabi' bin Sabrah] yang berkata; aku bersaksi atas [ayahku] bahwa ia telah menceritakan bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang darinya pada saat haji wada'. "
            },
            {
                "number": 1710,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ رَبِيعِ بْنِ سَبْرَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّمَ مُتْعَةَ النِّسَاءِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Rabi' bin Sabrah] dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam telah mengharamkan menikahi wanita secara mut'ah. "
            },
            {
                "number": 1711,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ ح و حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ كِلَاهُمَا عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الشِّغَارِزَادَ مُسَدَّدٌ فِي حَدِيثِهِ قُلْتُ لِنَافِعٍ مَا الشِّغَارُ قَالَ يَنْكِحُ ابْنَةَ الرَّجُلِ وَيُنْكِحُهُ ابْنَتَهُ بِغَيْرِ صَدَاقٍ وَيَنْكِحُ أُخْتَ الرَّجُلِ وَيُنْكِحُهُ أُخْتَهُ بِغَيْرِ صَدَاقٍ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Musaddad bin Musarhad], telah menceritakan kepada kami [Yahya] dari ['ubaidhullah], keduanya dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang dari nikah syighar. Musaddad menambahkan dalam haditsnya; aku katakan kepada Nafi'; apakah syighar itu? Ia berkata; seseorang menikahi anak wanita seseorang dengan imbalan ia menikahkan anak wanitanya dengan wali dari wanita yang dinikahi tersebut tanpa mahar, serta seseorang menikahi saudari seseorang dan orang tersebut menikahkannya dengan saudarinya tanpa mahar. "
            },
            {
                "number": 1712,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ هُرْمُزَ الْأَعْرَجُأَنَّ الْعَبَّاسَ بْنَ عَبْدِ اللَّهِ بْنِ الْعَبَّاسِ أَنْكَحَ عَبْدَ الرَّحْمَنِ بْنَ الْحَكَمِ ابْنَتَهُ وَأَنْكَحَهُ عَبْدُ الرَّحْمَنِ ابْنَتَهُ وَكَانَا جَعَلَا صَدَاقًا فَكَتَبَ مُعَاوِيَةُ إِلَى مَرْوَانَ يَأْمُرُهُ بِالتَّفْرِيقِ بَيْنَهُمَا وَقَالَ فِي كِتَابِهِ هَذَا الشِّغَارُ الَّذِي نَهَى عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris], telah menceritakan kepada kami [Ya'qub bin Ibrahim], telah menceritakan kepada kami [ayahku] dari [Ibnu Ishaq], telah menceritakan kepadaku [Abdurrahman bin Hurmuz Al A'raj], bahwa Al Abbas bin Abdullah bin Al Abbas telah menikahkan Abdurrahman bin Al Hakam dengan anak wanitanya, dan Abdurrahman menikahkannya dengan anak wanitanya dan mereka berdua memberikan mahar. Kemudian [Mu'awiyah] menulis surat kepada Marwan dan memerintahkannya agar menceraikan antara keduanya. Dan dalam suratnya ia mengatakan; ini adalah syighar yang dilarang Rasulullah shallallahu 'alaihi wasallam. "
            },
            {
                "number": 1713,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنِي إِسْمَعِيلُ عَنْ عَامِرٍ عَنْ الْحَارِثِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ إِسْمَعِيلُ وَأُرَاهُ قَدْ رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَعَنَ اللَّهُ الْمُحَلِّلَ وَالْمُحَلَّلَ لَهُحَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ عَنْ حُصَيْنٍ عَنْ عَامِرٍ عَنْ الْحَارِثِ الْأَعْوَرِ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَرَأَيْنَا أَنَّهُ عَلِيٌّ عَلَيْهِ السَّلَام عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus], telah menceritakan kepada kami [Zuhair], telah menceritakan kepadaku [Isma'il] dari [Amir] dari [Al Harits] dari [Ali] radliallahu 'anhu, Isma'il berkata; aku melihat ia merafa'kan hadits ini kepada Nabi shallallahu 'alaihi wasallam, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Semoga Allah melaknat muhallil (seseorang yang menikahi wanita yang telah dicerai tiga kali oleh suaminya untuk diceraikan lagi agar halal dinikahi kembali oleh suaminya yang pertama, dan ini dilakukan atas perintah suami pertama tersebut) dan muhallal lahu (seseorang -suami pertama- yang menyurh orang lain agar menikahi isterinya yang telah dicerai tiga kali agar halal dinikahi kembali). Telah menceritakan kepada kami [Wahb bin Baqiyyah] dari [Khalid] dari [Hushain] dari [Amir] dari [Al Harits Al A'war] dari seorang sahabat Nabi shallallahu 'alaihi wasallam, ia berkata; kami melihat bahwa ia adakah [Ali] radliallahu 'anhu, dari Nabi shallallahu 'alaihi wasallam dengan makna yang sama. "
            },
            {
                "number": 1714,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ وَهَذَا لَفْظُ إِسْنَادِهِ وَكِلَاهُمَا عَنْ وَكِيعٍ حَدَّثَنَا الْحَسَنُ بْنُ صَالِحٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا عَبْدٍ تَزَوَّجَ بِغَيْرِ إِذْنِ مَوَالِيهِ فَهُوَ عَاهِرٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] serta [Utsman bin Abu Syaibah], dan ini adalah lafazh sanadnya. Keduanya berasal dari [Waki'], telah menceritakan kepada kami [Al Hasan bin Shalih] dari [Abdullah bin Muhammad bin 'Aqil] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapapun budak yang menikah tanpa seizin tuannya, maka ia adalah pezina.\""
            },
            {
                "number": 1715,
                "arab": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ حَدَّثَنَا أَبُو قُتَيْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا نَكَحَ الْعَبْدُ بِغَيْرِ إِذْنِ مَوْلَاهُ فَنِكَاحُهُ بَاطِلٌقَالَ أَبُو دَاوُد هَذَا الْحَدِيثُ ضَعِيفٌ وَهُوَ مَوْقُوفٌ وَهُوَ قَوْلُ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا",
                "id": "Telah menceritakan kepada kami ['Uqbah bin Mukram], telah menceritakan kepada kami [Abu Qutaibah] dari [Abdullah bin Umar], dari [Nafi'], dari [Ibnu Umar] bahwa Nabi Shallallahu 'alaihi sallam bersabda: Apabila seorang budak menikah tanpa izin dari tuannya, maka nikahnya batal. Abu Daud berkata; hadits ini lemah dan mauquf, hanya perkataan Ibnu Umar radliallahu 'anhuma. "
            },
            {
                "number": 1716,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَخْطُبُ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Amr bin As Sarh], telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh seorang laki-laki meminang pinangan saudaranya.\""
            },
            {
                "number": 1717,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَخْطُبْ أَحَدُكُمْ عَلَى خِطْبَةِ أَخِيهِ وَلَا يَبِعْ عَلَى بَيْعِ أَخِيهِ إِلَّا بِإِذْنِهِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Abdullah bin Numair] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang diantara kalian meminang pinangan saudaranya, dan janganlah ia menjual sesuatu yang sedang dalam penawaran saudaranya kecuali dengan seizinnya.\""
            },
            {
                "number": 1718,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ دَاوُدَ بْنِ حُصَيْنٍ عَنْ وَاقِدِ بْنِ عَبْدِ الرَّحْمَنِ يَعْنِي ابْنَ سَعْدِ بْنِ مُعَاذٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَطَبَ أَحَدُكُمْ الْمَرْأَةَ فَإِنْ اسْتَطَاعَ أَنْ يَنْظُرَ إِلَى مَا يَدْعُوهُ إِلَى نِكَاحِهَا فَلْيَفْعَلْقَالَ فَخَطَبْتُ جَارِيَةً فَكُنْتُ أَتَخَبَّأُ لَهَا حَتَّى رَأَيْتُ مِنْهَا مَا دَعَانِي إِلَى نِكَاحِهَا وَتَزَوُّجِهَا فَتَزَوَّجْتُهَا",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Abdul Wahid bin Ziyad], telah menceritakan kepada kami [Muhammad bin Ishaq], dari [Daud bin Hushain], dari [Waqid bin Abdurrahman bin Sa'd bin Mu'adz] dari [Jabir bin Abdullah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian meminang seorang wanita, jika ia mampu untuk melihat sesuatu yang mendorongannya untuk menikahinya hendaknya ia melakukannya.\" Jabir berkata; kemudian aku meminang seorang gadis dan aku bersembunyi untuk melihatnya hingga aku melihat darinya apa yang mendorongku untuk menikahinya, lalu aku pun menikahinya. "
            },
            {
                "number": 1719,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ أَخْبَرَنَا ابْنُ جُرَيْجٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا امْرَأَةٍ نَكَحَتْ بِغَيْرِ إِذْنِ مَوَالِيهَا فَنِكَاحُهَا بَاطِلٌ ثَلَاثَ مَرَّاتٍ فَإِنْ دَخَلَ بِهَا فَالْمَهْرُ لَهَا بِمَا أَصَابَ مِنْهَا فَإِنْ تَشَاجَرُوا فَالسُّلْطَانُ وَلِيُّ مَنْ لَا وَلِيَّ لَهُحَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ جَعْفَرٍ يَعْنِي ابْنَ رَبِيعَةَ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ قَالَ أَبُو دَاوُد جَعْفَرٌ لَمْ يَسْمَعْ مِنْ الزُّهْرِيِّ كَتَبَ إِلَيْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Sufyan], telah mengabarkan kepada kami [Ibnu Juraij], dari [Sulaiman bin Musa] dari [Az Zuhri] dari [Urwah], dari [Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap wanita yang menikah tanpa seizin walinya, maka pernikahannya adalah batal.\" Beliau mengucapkannya sebanyak tiga kali. Apabila ia tleah mencampurinya maka baginya mahar karena apa yang ia peroleh darinya, kemudian apabila mereka berselisih maka penguasa adalah wali bagi orang yang tidak memiliki wali. Telah menceritakan kepada kami [Al Qa'nabi], telah menceritakan kepada kami [Ibnu Luhai'ah], dari [Ja'far bin Rabi'ah], dari [Ibnu Syihab] dari ['Urwah] dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam semakna dengannya. Abu Daud berkata; jal'far tidak mendengar dari Az Zuhri, ia menulis surat kepadanya. "
            },
            {
                "number": 1720,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ قُدَامَةَ بْنِ أَعْيَنَ حَدَّثَنَا أَبُو عُبَيْدَةَ الْحَدَّادُ عَنْ يُونُسَ وَإِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَىأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نِكَاحَ إِلَّا بِوَلِيٍّقَالَ أَبُو دَاوُد وَهُوَ يُونُسُ عَنْ أَبِي بُرْدَةَ وَإِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي بُرْدَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Qudamah bin A'yan], Telah menceritakan kepada kami [Abu 'Ubaidah Al Haddad] dari [Yunus], dan [Israil] dari [Abu Ishaq] dari [Abu Burdah] dari [Abu Musa] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada (tidak sah) pernikahan kecuali dengan wali.\" Abu Daud berkata; Yunus meriwayatkan dari Abu Burddah, sedangkan Israil meriwayatkan dari Abu Ishaq dari Abu Burdah. "
            },
            {
                "number": 1721,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ أُمِّ حَبِيبَةَأَنَّهَا كَانَتْ عِنْدَ ابْنِ جَحْشٍ فَهَلَكَ عَنْهَا وَكَانَ فِيمَنْ هَاجَرَ إِلَى أَرْضِ الْحَبَشَةِ فَزَوَّجَهَا النَّجَاشِيُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ عِنْدَهُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris], telah menceritakan kepada kami [Abdurrazzaq] dari [Ma'mar] dari [Az Zuhri] dari ['Urwah bin Az Zubai] dari [Ummu Habibah], bahwa ia dahulu adalah isteri Ibnu Jahsy, kemudian Ibnu Jahsy meninggal. Ia adalah di antara orang-orang yang berhijrah ke Negeri Habasyah, kemudian An Najasyi menikahkan Ummu Habibah dengan Rasulullah shallallahu 'alaihi wasallam, sementara Ummu Habibah bersama dengan mereka. "
            },
            {
                "number": 1722,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي أَبُو عَامِرٍ حَدَّثَنَا عَبَّادُ بْنُ رَاشِدٍ عَنْ الْحَسَنِ حَدَّثَنِي مَعْقِلُ بْنُ يَسَارٍ قَالَكَانَتْ لِي أُخْتٌ تُخْطَبُ إِلَيَّ فَأَتَانِي ابْنُ عَمٍّ لِي فَأَنْكَحْتُهَا إِيَّاهُ ثُمَّ طَلَّقَهَا طَلَاقًا لَهُ رَجْعَةٌ ثُمَّ تَرَكَهَا حَتَّى انْقَضَتْ عِدَّتُهَا فَلَمَّا خُطِبَتْ إِلَيَّ أَتَانِي يَخْطُبُهَا فَقُلْتُ لَا وَاللَّهِ لَا أُنْكِحُهَا أَبَدًا قَالَ فَفِيَّ نَزَلَتْ هَذِهِ الْآيَةُ{ وَإِذَا طَلَّقْتُمْ النِّسَاءَ فَبَلَغْنَ أَجَلَهُنَّ فَلَا تَعْضُلُوهُنَّ أَنْ يَنْكِحْنَ أَزْوَاجَهُنَّ }الْآيَةَ قَالَ فَكَفَّرْتُ عَنْ يَمِينِي فَأَنْكَحْتُهَا إِيَّاهُ",
                "id": "Telah menceritakan kepada kami [Muhammad Al Mutsanna], telah menceritakan kepadaku [Abu 'Amir], telah menceritakan kepada kami ['Abbad bin Rasyid] dari [Al Hasan], telah menceritakan kepadaku [Ma'qil bin Yasar], ia berkata; dahulu aku memiliki seorang saudara wanita, kemudian anak pamanku datang kepadaku, lalu aku menikahkan saudara wanitaku dengannya. Kemudian ia mencerainya, dengan perceraian yang memiliki kemungkinan untuk kembali, kemudian ia membiarkannya hinga habis masa iddahnya. Kemudian tatkala saudariku tersebut dipinang ia datang kepadaku untuk meminangnya. Lalu aku katakan; tidak, demi Allah, aku tidak akan menikahkannya denganmu selamanya. Ma'qil berkata; kemudian turunlah ayat ini mengenai diriku: \"Apabila kamu mentalak isteri-isterimu, lalu habis masa iddahnya, maka janganlah kamu (para wali) menghalangi mereka kawin lagi dengan bakal suaminya.\" Ma'qil berkata; kemudian aku membayar kafarah sumpahku, lalu menikahkan saudariku dengannya. "
            },
            {
                "number": 1723,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا هَمَّامٌ ح و حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ الْمَعْنَى عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا امْرَأَةٍ زَوَّجَهَا وَلِيَّانِ فَهِيَ لِلْأَوَّلِ مِنْهُمَا وَأَيُّمَا رَجُلٍ بَاعَ بَيْعًا مِنْ رَجُلَيْنِ فَهُوَ لِلْأَوَّلِ مِنْهُمَا",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim], telah menceritakan kepada kami [Hisyam], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Hammam], dan telah diriwayatkan dari jalur yang lain: telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] secara makna, dari [Qatadah] dari [Al Hasan] dari [Samurah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Setiap wanita yang dinikahkan oleh dua orang wali, maka ia menjadi hak bagi wali yang pertama di antara keduanya. Dan setiap orang yang menjual sesuatu kepada dua orang, maka barang tersebut menjadi hak bagi orang pertama (membeli) di antara mereka berdua.\""
            },
            {
                "number": 1724,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ حَدَّثَنَا الشَّيْبَانِيُّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ الشَّيْبَانِيُّ وَذَكَرَهُ عَطَاءٌ أَبُو الْحَسَنِ السُّوَائِيُّ وَلَا أَظُنُّهُ إِلَّا عَنْ ابْنِ عَبَّاسٍفِي هَذِهِ الْآيَةِ{ لَا يَحِلُّ لَكُمْ أَنْ تَرِثُوا النِّسَاءَ كَرْهًا وَلَا تَعْضُلُوهُنَّ }قَالَ كَانَ الرَّجُلُ إِذَا مَاتَ كَانَ أَوْلِيَاؤُهُ أَحَقَّ بِامْرَأَتِهِ مِنْ وَلِيِّ نَفْسِهَا إِنْ شَاءَ بَعْضُهُمْ زَوَّجَهَا أَوْ زَوَّجُوهَا وَإِنْ شَاءُوا لَمْ يُزَوِّجُوهَا فَنَزَلَتْ هَذِهِ الْآيَةُ فِي ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Asbath bin Muhammad], Telah menceritakan kepada kami [Asy Syaibani] dari [Ikrimah] dari [Ibnu Abbas], [Asy Syaibani] berkata; dan telah disebutkan oleh ['Atha` Abu Al Hasan As Suwai], dan aku kira berasal dari [Ibnu Abbas] mengenai ayat: \"Tidak halal bagi kamu mempusakai (mewariskan) wanita dengan jalan paksa dan janganlah kamu menyusahkan mereka.\" Ia berkata; dahulu apabila seorang laki-laki meninggal, maka para walinya lebih berhak terhadap istrinya daripada wali wanita tersebut, apabila sebagian mereka berkehendak maka mereka akan menikahkannya dan apabila mereka berkehendak maka mereka tidak menikahkannya. Kemudian turunlah ayat ini mengenai hal tersebut."
            },
            {
                "number": 1725,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ الْمَرْوَزِيُّ حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنِ بْنِ وَاقِدٍ عَنْ أَبِيهِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ{ لَا يَحِلُّ لَكُمْ أَنْ تَرِثُوا النِّسَاءَ كَرْهًا وَلَا تَعْضُلُوهُنَّ لِتَذْهَبُوا بِبَعْضِ مَا آتَيْتُمُوهُنَّ إِلَّا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ }وَذَلِكَ أَنَّ الرَّجُلَ كَانَ يَرِثُ امْرَأَةَ ذِي قَرَابَتِهِ فَيَعْضُلُهَا حَتَّى تَمُوتَ أَوْ تَرُدَّ إِلَيْهِ صَدَاقَهَا فَأَحْكَمَ اللَّهُ عَنْ ذَلِكَ وَنَهَى عَنْ ذَلِكَحَدَّثَنَا أَحْمَدُ بْنُ شَبُّوَيْهِ الْمَرْوَزِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ عَنْ عِيسَى بْنِ عُبَيْدٍ عَنْ عُبَيْدِ اللَّهِ مَوْلَى عُمَرَ عَنْ الضَّحَّاكِ بِمَعْنَاهُ قَالَ فَوَعَظَ اللَّهُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Tsabit Al Marwazi], telah menceritakan kepadaku [Ali bin Husain bin Waqid] dari [ayahnya] dari [Yazid An Nahwi], dari [Ikrimah] dari [Ibnu Abbas], ia berkata; \"Tidak halal bagi kalian untuk mewariskan wanita secara paksa, dan janganlah kamu menyusahkan mereka karena hendak mengambil kembali sebagian dari apa yang telah kamu berikan kepadanya, terkecuali bila mereka melakukan pekerjaan keji yang nyata.\" Yang demikian itu adalah bahwa seorang laki-laki mewarisi isteri kerabatnya, kemudian ia menyusahkannya hingga meninggal atau wanita tersebut mengembalikan kepadanya maharnya. Kemudian Allah menetapkan dari hal tersebut dan melarang dari hal tersebut. Telah menceritakan kepada kami [Ahmad bin Syabbuwaih Al Marwazi], telah menceritakan kepada kami [Abdullah bin Utsman] dari [Isa bin 'Ubaid] dari ['ubaidhullah] mantan budak Umar, dari [Adh Dhahhak], dengan makna yang sama. Ia berkata; kemudian Allah memberikan nasehat hal tersebut. "
            },
            {
                "number": 1726,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبَانُ حَدَّثَنَا يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُنْكَحُ الثَّيِّبُ حَتَّى تُسْتَأْمَرَ وَلَا الْبِكْرُ إِلَّا بِإِذْنِهَا قَالُوا يَا رَسُولَ اللَّهِ وَمَا إِذْنُهَا قَالَ أَنْ تَسْكُتَ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim], Telah menceritakan kepada kami [Aban], telah menceritakan kepada kami [Yahya] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang janda tidak boleh dinikahkan hingga ia dimintai pertimbangan, dan seorang gadis tidak boleh dinikahkan kecuali dengan seizinnya.\" Para sahabat bertanya; wahai Rasulullah, bagaimana izinya? Beliau bersabda: \"Dengan cara diam.\""
            },
            {
                "number": 1727,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ ح و حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ الْمَعْنَى حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرٍو حَدَّثَنَا أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُسْتَأْمَرُ الْيَتِيمَةُ فِي نَفْسِهَا فَإِنْ سَكَتَتْ فَهُوَ إِذْنُهَا وَإِنْ أَبَتْ فَلَا جَوَازَ عَلَيْهَاوَالْإِخْبَارُ فِي حَدِيثِ يَزِيدَ قَالَ أَبُو دَاوُد وَكَذَلِكَ رَوَاهُ أَبُو خَالِدٍ سُلَيْمَانُ بْنُ حَيَّانَ وُمُعَاذُ بْنُ مُعَاذٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو بِهَذَا الْحَدِيثِ بِإِسْنَادِهِ زَادَ فِيهِ قَالَ فَإِنْ بَكَتْ أَوْ سَكَتَتْ زَادَ بَكَتْ قَالَ أَبُو دَاوُد وَلَيْسَ بَكَتْ بِمَحْفُوظٍ وَهُوَ وَهْمٌ فِي الْحَدِيثِ الْوَهْمُ مِنْ ابْنِ إِدْرِيسَ أَوْ مِنْ مُحَمَّدِ بْنِ الْعَلَاءِ قَالَ أَبُو دَاوُد وَرَوَاهُ أَبُو عَمْرٍو ذَكْوَانُ عَنْ عَائِشَةَ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ الْبِكْرَ تَسْتَحِي أَنْ تَتَكَلَّمَ قَالَ سُكَاتُهَا إِقْرَارُهَا",
                "id": "Telah menceritakan kepada kami [Abu Kamil], telah menceritakan kepada kami [Yazid bin Zurai'], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepadaku [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] secara makna. Telah menceritakan kepadaku [Muhammad bin 'Amr], telah menceritakan kepada kami [Abu Salamah] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang wanita yatim dimintai pertimbangan terhadap dirinya, apabila ia diam maka hal itu adalah izinnya, dan apabila ia menolak maka tidak boleh memaksakannya.\" Hadits Yazid dengan menggunakan bentuk pengabaran. Abu Daud berkata; begitu juga hadits tersebut diriwayatkan oleh [Abu Khalid Sulaiman bin Hayyan], serta [Mu'adz bin Mu'adz] dari [Muhammad bin 'Amr] telah menceritakan kepada kami [Muhammad bin Al 'Ala`], telah menceritakan kepada kami [Ibnu Idris], dari [Muhammad bin 'Amr] dengan hadits ini dengan sanadnya, dalam hadits tersebut ia menambahkan; beliau berkata: \"Apabila ia menangis atau diam, \" ia menambahkan kata \"menangis.\" Abu Daud berkata; kata \"menangis\" bukanlah sesuatu yang terhafalkan (terjaga), hal itu adalah sebuah kesalahan. Dalam hadits tersebut terdapat kesalahan dari Ibnu Idris, atau dari Muhammad bin Al 'Ala`. Abu Daud berkata; dan hadits tersebut diriwayatkan oleh [Abu 'Amr Dzakwan] dari [Aisyah], ia berkata; wahai Rasulullah, sesungguhnya seorang gadis akan merasa malu untuk berbicara. Beliau berkata; diamnya adalah persetujuannya. "
            },
            {
                "number": 1728,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ عَنْ سُفْيَانَ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ حَدَّثَنِي الثِّقَةُ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آمِرُوا النِّسَاءَ فِي بَنَاتِهِنَّ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Mu'awiyah bin Hisyam], dari [Sufyan], dari [Isma'il bin Umayyah], telah menceritakan kepadaku [orang yang tsiqah] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ajaklah para wanita untuk bermusyawarah mengenai anak-anak wanita mereka!\""
            },
            {
                "number": 1729,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ جَارِيَةً بِكْرًا أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ أَنَّ أَبَاهَا زَوَّجَهَا وَهِيَ كَارِهَةٌ فَخَيَّرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَحَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ قَالَ أَبُو دَاوُد لَمْ يَذْكُرْ ابْنَ عَبَّاسٍ وَكَذَلِكَ رَوَاهُ النَّاسُ مُرْسَلًا مَعْرُوفٌ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Husain bin Muhammad], telah menceritakan kepada kami [Jarir bin Hazim], dari [Ayyub], dari [Ikrimah] dari [Ibnu Abbas], bahwa seorang gadis datang kepada Nabi shallallahu 'alaihi wasallam dan menyebutkan bahwa ayahnya telah menikahkannya sementara ia tidak senang. Kemudian beliau beliau memberikan pilihan. Telah menceritakan kepada kami [Muhammad bin 'Ubaid], telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Ikrimah] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini. Abu Daud berkata; Muhammad bin 'Ubaid tidak menyebutkan Ibnu Abbas. Begitu pula hadits tersebut telah diriwayatkan oleh beberapa ulama secara mursal adalah sesuatu yang telah diketahui. "
            },
            {
                "number": 1730,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ وَعَبْدُ اللَّهِ بْنُ مَسْلَمَةَ قَالَا أَخْبَرَنَا مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَيِّمُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ تُسْتَأْذَنُ فِي نَفْسِهَا وَإِذْنُهَا صُمَاتُهَاوَهَذَا لَفْظُ الْقَعْنَبِيِّ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ عَنْ زِيَادِ بْنِ سَعْدٍ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ الثَّيِّبُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ يَسْتَأْمِرُهَا أَبُوهَا قَالَ أَبُو دَاوُد أَبُوهَا لَيْسَ بِمَحْفُوظٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus], serta [Abdullah bin Maslamah], mereka berkata; telah mengabarkan kepada kami [Malik], dari [Abdullah bin Al Fadhl] dari [Nafi' bin Jubair] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang janda lebih berhak terhadap dirinya daripada walinya, seorang gadis dimintai izinnya dalam urusan dirinya, dan izinnya adalah diamnya.\" Lafazh ini adalah lafazh Al Qa'nabi. Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Sufyan], dari [Ziyad bin Sa'd] dari [Abdullah bin Al Fadhl] dengan sanad serta maknanya, beliau bersabda: \"Seorang janda lebih berhak terhadap dirinya daripada walinya, dan seorang gadis dimintai pertimbangannya oleh ayahnya.\" Abu Daud berkata; kata \"ayahnya\" bukanlah sesuatu yang dihafal (dijaga). "
            },
            {
                "number": 1731,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ لِلْوَلِيِّ مَعَ الثَّيِّبِ أَمْرٌ وَالْيَتِيمَةُ تُسْتَأْمَرُ وَصَمْتُهَا إِقْرَارُهَا",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ma'mar] dari [Shalih bin Kaisan] dari [Nafi' bin Jubair bin Muth'im] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang wali tidak memiliki kuasa memaksa terhadap seorang janda, dan seorang wanita yatim dimintai pertimbangannya, dan diamnya adalah persetujuannya.\""
            },
            {
                "number": 1732,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَبْدِ الرَّحْمَنِ وَمُجَمِّعٍ ابْنَيْ يَزِيدَ الْأَنْصَارِيَّيْنِ عَنْ خَنْسَاءَ بِنْتِ خِذَامٍ الْأَنْصَارِيَّةِأَنَّ أَبَاهَا زَوَّجَهَا وَهِيَ ثَيِّبٌ فَكَرِهَتْ ذَلِكَ فَجَاءَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ ذَلِكَ لَهُ فَرَدَّ نِكَاحَهَا",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi], dari [Malik], dari [Abdurrahman bin Al Qasim], dari [ayahnya] dari [Abdurrahman] dan [Mujammi'], keduanya adalah anak Yazid Al Anshari dari [Khansa` binti Khidzam Al Anshariyyah], bahwa ayahnya telah menikahkannya sementara ia adalah seorang janda, kemudian ia tidak menyukai hal tersebut, lalu datang kepada Rasulullah shallallahu 'alaihi wasallam dan menceritakan hal tersebut kepada beliau. Maka beliau menolak pernikahannya."
            },
            {
                "number": 1733,
                "arab": "حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ غِيَاثٍ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ أَبَا هِنْدٍ حَجَمَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْيَافُوخِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا بَنِي بَيَاضَةَ أَنْكِحُوا أَبَا هِنْدٍ وَأَنْكِحُوا إِلَيْهِ وَقَالَ وَإِنْ كَانَ فِي شَيْءٍ مِمَّا تَدَاوُونَ بِهِ خَيْرٌ فَالْحِجَامَةُ",
                "id": "Telah menceritakan kepada kami [Abdul Wahid bin Ghiyats], telah menceritakan kepada kami [Hammad], telah menceritakan kepada kami [Muhammad bin 'Amr], dari [Abu Salamah] dari [Abu Hurairah], bahwa Abu Hindun telah membekam Nabi shallallahu 'alaihi wasallam pada bagian ubun-ubun, kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai Bani Bayadhah, nikahkanlah Abu Hindun, dan nikahkanlah anak-anak wanitanya.\" Dan beliau bersabda: \"Seandainya ada sesuatu yang lebih baik yang kalian gunakan untuk berobat, maka sesuatu tersebut adalah berbekam.\""
            },
            {
                "number": 1734,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ الْمُثَنَّى الْمَعْنَى قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ بْنِ مِقْسَمٍ الثَّقَفِيُّ مِنْ أَهْلِ الطَّائِفِ حَدَّثَتْنِي سَارَةُ بِنْتُ مِقْسَمٍ أَنَّهَا سَمِعَتْ مَيْمُونَةَ بِنْتَ كَرْدَمٍ قَالَتْخَرَجْتُ مَعَ أَبِي فِي حَجَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَنَا إِلَيْهِ أَبِي وَهُوَ عَلَى نَاقَةٍ لَهُ فَوَقَفَ لَهُ وَاسْتَمَعَ مِنْهُ وَمَعَهُ دِرَّةٌ كَدِرَّةِ الْكُتَّابِ فَسَمِعْتُ الْأَعْرَابَ وَالنَّاسَ وَهُمْ يَقُولُونَ الطَّبْطَبِيَّةَ الطَّبْطَبِيَّةَ الطَّبْطَبِيَّةَ فَدَنَا إِلَيْهِ أَبِي فَأَخَذَ بِقَدَمِهِ فَأَقَرَّ لَهُ وَوَقَفَ عَلَيْهِ وَاسْتَمَعَ مِنْهُ فَقَالَ إِنِّي حَضَرْتُ جَيْشَ عِثْرَانَ قَالَ ابْنُ الْمُثَنَّى جَيْشَ غِثْرَانَ فَقَالَ طَارِقُ بْنُ الْمُرَقَّعِ مَنْ يُعْطِينِي رُمْحًا بِثَوَابِهِ قُلْتُ وَمَا ثَوَابُهُ قَالَ أُزَوِّجُهُ أَوَّلَ بِنْتٍ تَكُونُ لِي فَأَعْطَيْتُهُ رُمْحِي ثُمَّ غِبْتُ عَنْهُ حَتَّى عَلِمْتُ أَنَّهُ قَدْ وُلِدَ لَهُ جَارِيَةٌ وَبَلَغَتْ ثُمَّ جِئْتُهُ فَقُلْتُ لَهُ أَهْلِي جَهِّزْهُنَّ إِلَيَّ فَحَلَفَ أَنْ لَا يَفْعَلَ حَتَّى أُصْدِقَهُ صَدَاقًا جَدِيدًا غَيْرَ الَّذِي كَانَ بَيْنِي وَبَيْنَهُ وَحَلَفْتُ لَا أُصْدِقُ غَيْرَ الَّذِي أَعْطَيْتُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِقَرْنِ أَيِّ النِّسَاءِ هِيَ الْيَوْمَ قَالَ قَدْ رَأَتْ الْقَتِيرَ قَالَ أَرَى أَنْ تَتْرُكَهَا قَالَ فَرَاعَنِي ذَلِكَ وَنَظَرْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَأَى ذَلِكَ مِنِّي قَالَ لَا تَأْثَمُ وَلَا يَأْثَمُ صَاحِبُكَقَالَ أَبُو دَاوُد الْقَتِيرُ الشَّيْبُ حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ أَنَّ خَالَتَهُ أَخْبَرَتْهُ عَنِ امْرَأَةٍ قَالَتْ هِيَ مُصَدَّقَةٌ امْرَأَةُ صِدْقٍ قَالَتْ بَيْنَا أَبِي فِي غَزَاةٍ فِي الْجَاهِلِيَّةِ إِذْ رَمِضُوا فَقَالَ رَجُلٌ مَنْ يُعْطِينِي نَعْلَيْهِ وَأُنْكِحُهُ أَوَّلَ بِنْتٍ تُولَدُ لِي فَخَلَعَ أَبِي نَعْلَيْهِ فَأَلْقَاهُمَا إِلَيْهِ فَوُلِدَتْ لَهُ جَارِيَةٌ فَبَلَغَتْ وَذَكَرَ نَحْوَهُ لَمْ يَذْكُرْ قِصَّةَ الْقَتِيرِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], serta [Muhammad bin Al Mutsanna] secara makna, mereka berkata; telah menceritakan kepada kami [Yazid bin Harun], telah mengabarkan kepada kami [Abdullah bin Yazid bin Miqsam Ats Tsaqafi] yang merupakan penduduk Thaif, telah menceritakan kepadaku [Sarah binti Miqsam] bahwa ia mendengar [Maimunah binti Kardam] berkata; aku pernah keluar bersama ayahku pada saat Rasulullah shallallahu 'alaihi wasallam melakukan haji. Aku melihat Rasulullah shallallahu 'alaihi wasallam, kemudian ayahku mendekat kepada beliau sementera beliau berada di atas untanya. Kemudian beliau berhenti dan mendengar darinya dengan membawa cambuk seperti cambuk orang mengajar anak-anak. Kemudian aku mendengar orang-orang badui serta orang-orang yang lain mereka berkata; jangan bersuara! Jangan bersuara! Jangan bersuara! Kemudian ayahku mendekat kepada beliau, mengambil posisi di hadapan beliau, dan mengakui risalah serta kenabian beliau dan beliau berhenti serta mendengarkan darinya. Kemudian ia berkata; sesungguhnya aku telah menghadiri pasukan 'Itsran -Ibnu Al Mutsanna menyebutnya; pasukan Ghitsran- kemudian Thariq bin Al Muraqqa' berkata; siapa yang memberiku tombak akan mendapatkan balasannya. Aku katakan; apakah balasannya? Ia berkata; aku akan menikahkannya dengan anak perempuanku yang pertama. Lalu aku memberikan tombakku kepadanya, kemudian aku menghilang darinya hingga aku mengetahui bahwa anak wanitanya telah lahir dan telah mencapai usia baligh. Kemudian aku mendatanginya dan aku katakan kepadanya; persiapkan isteriku agar datang kepadaku. Kemudian ia bersumpah bahwa ia tidak akan melakukannya kecuali aku memberinya mahar baru bukan mahar yang dahulu aku berikan kepadanya, dan aku pun bersumpah tidak akan memberikan mahar selain yang telah aku berikan kepadanya. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Seumuran wanita manakah ia sekarang?\" Ia berkata; ia telah melihat uban (sudah dewasa). Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku berpendapat agar Engkau meninggalkannya.\" Kardam berkata; hal tersebut mengagetkanku, dan aku melihat kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian tatkala beliau melihat rasa kagetku beliau berkata: Engkau tidak berdosa dan sahabatmu tidak berdosa.\" Abu Daud berkata; Al Qatir adalah uban. Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ibnu Juraij], telah mengabarkan kepadaku [Ibrahim bin Maisarah], bahwa [bibinya] telah mengabarkan kepadanya dari [seorang wanita], ia berkata; ia adalah wanita yang dipercaya dan jujur, ia berkata; ketika ayahku berada dalam sebuah peperangan pada masa jahiliyah tiba-tiba mereka merasakan panas di kaki mereka, kemudian seorang laki-laki berkata; siapa yang memberikan kedua sandalnya kepadaku maka aku akan menikahkannya dengan anak wanitaku yang lahir pertama. Lalu aku melemparkan kedua sandalku kepadanya, kemudian ia memiliki anak wanita yang telah berusia baligh, dan Ahmad bin Shalih menyebutkan seperti itu dan tidak menyebutkan kisah mengenai uban."
            },
            {
                "number": 1735,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ حَدَّثَنَا يَزِيدُ بْنُ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ قَالَسَأَلْتُ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا عَنْ صَدَاقِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ ثِنْتَا عَشْرَةَ أُوقِيَّةً وَنَشٌّ فَقُلْتُ وَمَا نَشٌّ قَالَتْ نِصْفُ أُوقِيَّةٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Abdul Aziz bin Muhammad], telah menceritakan kepada kami [Yazid bin Al Had] dari [Muhammad bin Ibrahim] dari [Abu Salamah]. Ia berkata; aku bertanya kepada [Aisyah] radliallahu 'anha mengenai mahar Nabi shallallahu 'alaihi wasallam, ia berkata; dua belas uqiyah dan nusy. Kemudian aku katakan; apakah nusy itu? Ia berkata; setengah uqiyah. "
            },
            {
                "number": 1736,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَبِي الْعَجْفَاءِ السُّلَمِيِّ قَالَخَطَبَنَا عُمَرُ رَحِمَهُ اللَّهُ فَقَالَ أَلَا لَا تُغَالُوا بِصُدُقِ النِّسَاءِ فَإِنَّهَا لَوْ كَانَتْ مَكْرُمَةً فِي الدُّنْيَا أَوْ تَقْوَى عِنْدَ اللَّهِ لَكَانَ أَوْلَاكُمْ بِهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَصْدَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْرَأَةً مِنْ نِسَائِهِ وَلَا أُصْدِقَتْ امْرَأَةٌ مِنْ بَنَاتِهِ أَكْثَرَ مِنْ ثِنْتَيْ عَشْرَةَ أُوقِيَّةً",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid], telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Muhammad] dari [Abu Al 'Ajfa` As Sulami], ia berkata; [Umar] radliallahu 'anhu berkhutbah kepada kami, ia berkata; ketahuilah, janganlah kalian berlebihan dalam memberi mahar kepada para wanita, seandainya hal itu adalah sebuah kemuliaan di dunia atau sebagai bentuk ketaqwaan di sisi Allah, niscaya orang yang paling dahulu melakukannya adalah Nabi shallallahu 'alaihi wasallam, tidaklah Rasulullah shallallahu 'alaihi wasallam memberikan mahar kepada salah seorang dari isteri-isteri beliau, dan tidak juga diberikan kepada puteri-puteri beliau jumlah mahar yang melebihi dua belas uqiyah. "
            },
            {
                "number": 1737,
                "arab": "حَدَّثَنَا حَجَّاجُ بْنُ أَبِي يَعْقُوبَ الثَّقَفِيُّ حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ حَدَّثَنَا ابْنُ الْمُبَارَكِ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ أُمِّ حَبِيبَةَأَنَّهَا كَانَتْ تَحْتَ عُبَيْدِ اللَّهِ بْنِ جَحْشٍ فَمَاتَ بِأَرْضِ الْحَبَشَةِ فَزَوَّجَهَا النَّجَاشِيُّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمْهَرَهَا عَنْهُ أَرْبَعَةَ آلَافٍ وَبَعَثَ بِهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ شُرَحْبِيلَ ابْنِ حَسَنَةَقَالَ أَبُو دَاوُد حَسَنَةُ هِيَ أُمُّهُ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Ya'qub Ats Tsaqafi], telah menceritakan kepada kami [Mu'alla bin Manshur], telah menceritakan kepada kami [Ibnu Al Mubarak], telah menceritakan kepada kami [Ma'mar], dari [Az Zuhri] dari ['Urwah] dari [Ummu Habibah] bahwa ia pernah menjadi isteri 'ubaidhullah bin Jahsy, kemudian ia meninggal di Negeri Habasyah, lalu An Najasyi menikahkannya dengan Nabi shallallahu 'alaihi wasallam. An Najasyi memberikan mahar empat ribu, dan ia mengirimnya kepada Rasulullah shallallahu 'alaihi wasallam bersama Syurahbil bin Hasanah. Abu Daud berkata; Hasanah adalah ibunya. "
            },
            {
                "number": 1738,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ عَنْ ابْنِ الْمُبَارَكِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّأَنَّ النَّجَاشِيَّ زَوَّجَ أُمَّ حَبِيبَةَ بِنْتَ أَبِي سُفْيَانَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى صَدَاقِ أَرْبَعَةِ آلَافِ دِرْهَمٍ وَكَتَبَ بِذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَبِلَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Hatim bin Bazi'], telah menceritakan kepada kami [Ali bin Al Hasan bin Syaqiq] dari [Ibnu Al Mubarak] dari [Yunus] dari [Az Zuhri] bahwa An Najasyi telah menikahkan Ummu Habibah binti Abu Sufyan dengan Rasulullah shallallahu 'alaihi wasallam dengan mahar empat ribu dirham, dan menuliskan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam, kemudian beliau menerimanya. "
            },
            {
                "number": 1739,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ الْبُنَانِيِّ وَحُمَيْدٍ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ وَعَلَيْهِ رَدْعُ زَعْفَرَانٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَهْيَمْ فَقَالَ يَا رَسُولَ اللَّهِ تَزَوَّجْتُ امْرَأَةً قَالَ مَا أَصْدَقْتَهَا قَالَ وَزْنَ نَوَاةٍ مِنْ ذَهَبٍ قَالَ أَوْلِمْ وَلَوْ بِشَاةٍ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Tsabit Al Bunani], serta [Humaid] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam melihat Abdurrahman bin 'Auf padanya terdapat bekas minyak za'faran. Kemudian Nabi shallallahu 'alaihi wasallam berkata: \"Apakah ini?\" Lalu ia berkata; wahai Rasulullah, aku telah menikahi seorang wanita. Beliau berkata: \"Mahar apakah yang telah engkau berikan kepadanya?\" Ia berkata; emas sebesar biji kurma. Beliau berkata: \"Rayakanlah (adakanlah walimah) walaupun hanya dengan menyembelih satu ekor kambing.\""
            },
            {
                "number": 1740,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ جِبْرَائِيلَ الْبَغْدَادِيُّ أَخْبَرَنَا يَزِيدُ أَخْبَرَنَا مُوسَى بْنُ مُسْلِمِ بْنِ رُومَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَعْطَى فِي صَدَاقِ امْرَأَةٍ مِلْءَ كَفَّيْهِ سَوِيقًا أَوْ تَمْرًا فَقَدْ اسْتَحَلَّقَالَ أَبُو دَاوُد رَوَاهُ عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ صَالِحِ بْنِ رُومَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ مَوْقُوفًا وَرَوَاهُ أَبُو عَاصِمٍ عَنْ صَالِحِ بْنِ رُومَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ كُنَّا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَسْتَمْتِعُ بِالْقُبْضَةِ مِنْ الطَّعَامِ عَلَى مَعْنَى الْمُتْعَةِ قَالَ أَبُو دَاوُد رَوَاهُ ابْنُ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَلَى مَعْنَى أَبِي عَاصِمٍ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Jibrail Al Baghdadi], telah mengabarkan kepada kami [Yazid], telah mengabarkan kepada kami [Musa bin Muslim bin Ruman], dari [Abu Az Zubair] dari [Jabir bin Abdullah] bahwa Nabi shallallahu 'alaihi wasallam berkata: \"Barangsiapa yang memberi mahar seorang wanita berupa gandum atau kurma sepenuh dua telapak tangannya, maka (pemberiannya) itu ia telah menghalalkannya (menjadi mahar bagi istrinya)).\" Abu Daud berkata; hadits tersebut diriwayatkan oleh [Abdurrahman bin Mahdi] dari [Shalih bin Ruman] dari [Abu Az Zubair] dari [Jabir] secara mauquf. Dan diriwayatkan oleh [Abu 'Ashim] dari [Shalih bin Ruman] dari [Abu Az Zubair] dari [Jabir], ia berkata; kami pada zaman Rasulullah shallallahu 'alaihi wasallam menikah mut'ah dengan memberikan mahar satu genggam makanan. Abu Daud berkata; hadits tersebut diriwayatkan oleh [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir] seperti ma'na hadits Abu 'Ashim. "
            },
            {
                "number": 1741,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَتْهُ امْرَأَةٌ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي قَدْ وَهَبْتُ نَفْسِي لَكَ فَقَامَتْ قِيَامًا طَوِيلًا فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ زَوِّجْنِيهَا إِنْ لَمْ يَكُنْ لَكَ بِهَا حَاجَةٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ عِنْدَكَ مِنْ شَيْءٍ تُصْدِقُهَا إِيَّاهُ فَقَالَ مَا عِنْدِي إِلَّا إِزَارِي هَذَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّكَ إِنْ أَعْطَيْتَهَا إِزَارَكَ جَلَسْتَ وَلَا إِزَارَ لَكَ فَالْتَمِسْ شَيْئًا قَالَ لَا أَجِدُ شَيْئًا قَالَ فَالْتَمِسْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ فَالْتَمَسَ فَلَمْ يَجِدْ شَيْئًا فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَلْ مَعَكَ مِنْ الْقُرْآنِ شَيْءٌ قَالَ نَعَمْ سُورَةُ كَذَا وَسُورَةُ كَذَا لِسُوَرٍ سَمَّاهَا فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ زَوَّجْتُكَهَا بِمَا مَعَكَ مِنْ الْقُرْآنِحَدَّثَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ حَدَّثَنِي أَبِي حَفْصُ بْنُ عَبْدِ اللَّهِ حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ الْحَجَّاجِ بْنِ الْحَجَّاجِ الْبَاهِلِيِّ عَنْ عِسْلٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ أَبِي هُرَيْرَةَ نَحْوَ هَذِهِ الْقِصَّةِ لَمْ يَذْكُرْ الْإِزَارَ وَالْخَاتَمَ فَقَالَ مَا تَحْفَظُ مِنْ الْقُرْآنِ قَالَ سُورَةَ الْبَقَرَةِ أَوْ الَّتِي تَلِيهَا قَالَ فَقُمْ فَعَلِّمْهَا عِشْرِينَ آيَةً وَهِيَ امْرَأَتُكَ حَدَّثَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ حَدَّثَنَا أَبِي حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ عَنْ مَكْحُولٍ نَحْوَ خَبَرِ سَهْلٍ قَالَ وَكَانَ مَكْحُولٌ يَقُولُ لَيْسَ ذَلِكَ لِأَحَدٍ بَعْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abu Hazim bin Dinar] dari [Sahl bin Sa'd As Sa'idi] bahwa Rasulullah shallallahu 'alaihi wasallam didatangi oleh seorang wanita seraya berkata; wahai Rasulullah, aku menghibahkan diriku kepadamu. Kemudian wanita tersebut berdiri lama, lalu terdapat seorang laki-laki yang berdiri dan berkata; wahai Rasulullah, nikahkan aku dengannya apabila engkau tidak butuh kepadanya. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Apakah kamu memiliki sesuatu yang dapat kamu berikan kepadanya sebagai mahar?\" Orang tersebut berkata; aku tidak memiliki sesuatu kecuali sarungku ini. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kamu memberikan sarungmu, maka kamu akan telanjang dan kamu tidak memiliki sarung, carilah sesuatu!\" Orang tersebut berkata; aku tidak mendapatkan sesuatu. Beliau berkata: \"Carilah (yang lain) walaupun hanya sebuah cincin besi!\" Kemudian orang tersebut mencari dan tidak mendapatkan sesuatu pun. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata kepadanya: \"Apakah engkau hafal sebagian dari Al Qur'an?\" Orang tersebut berkata; ya, surat ini dan surat ini. Ia menyebutkan surat yang telah ia hafal. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata kepadanya: \"Aku telah menikahkanmu dengan apa yang engkau miliki (hafal) dari Al Qur'an.\" Telah menceritakan kepada kami [Ahmad bin Hafsh bin Abdullah], telah menceritakan kepadaku [Abu Hafsh bin Abdullah], telah menceritakan kepadaku [Ibrahim bin Thahman] dari [Al Hajjaj bin Al Hajjaj Al Bahili] dari ['Asl] dari ['Atha` bin Abu Rabah] dari [Abu Hurairah] seperti kisah ini, namun ia tidak menyebutkan sarung dan cincin. Beliau berkata: \"Surat apakah yang engkau hafal dari Al Qur'an?\" Orang tersebut berkata; Surat Al Baqarah, atau surat yang setelahnya. Beliau berkata: \"Berdirilah dan ajarkanlah dua puluh ayat kepadanya! Ia adalah isterimu.\" Telah menceritakan kepada kami [Harun bin Zaid bin Abu Az Zarqa`], telah menceritakan kepada kami [ayahku], telah menceritakan kepada kami [Muhammad bin Rasyid] dari [Makhul] seperti hadits Sahl. Ia berkata; dan Makhul pernah berkata; hal tersebut bukan hal bagi seseorang setelah Rasulullah shallallahu 'alaihi wasallam. "
            },
            {
                "number": 1742,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ فِرَاسٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ فِي رَجُلٍ تَزَوَّجَ امْرَأَةً فَمَاتَ عَنْهَا وَلَمْ يَدْخُلْ بِهَا وَلَمْ يَفْرِضْ لَهَا الصَّدَاقَ فَقَالَ لَهَا الصَّدَاقُ كَامِلًا وَعَلَيْهَا الْعِدَّةُ وَلَهَا الْمِيرَاثُفَقَالَ مَعْقِلُ بْنُ سِنَانٍ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِهِ فِي بِرْوَعَ بِنْتِ وَاشِقٍحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ وَابْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ وَسَاقَ عُثْمَانُ مِثْلَهُ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ خِلَاسٍ وَأَبِي حَسَّانَ عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ أُتِيَ فِي رَجُلٍ بِهَذَا الْخَبَرِ قَالَ فَاخْتَلَفُوا إِلَيْهِ شَهْرًا أَوْ قَالَ مَرَّاتٍ قَالَ فَإِنِّي أَقُولُ فِيهَا إِنَّ لَهَا صَدَاقًا كَصَدَاقِ نِسَائِهَا لَا وَكْسَ وَلَا شَطَطَ وَإِنَّ لَهَا الْمِيرَاثَ وَعَلَيْهَا الْعِدَّةُ فَإِنْ يَكُ صَوَابًا فَمِنْ اللَّهِ وَإِنْ يَكُنْ خَطَأً فَمِنِّي وَمِنْ الشَّيْطَانِ وَاللَّهُ وَرَسُولُهُ بَرِيئَانِ فَقَامَ نَاسٌ مِنْ أَشْجَعَ فِيهِمْ الْجَرَّاحُ وَأَبُو سِنَانٍ فَقَالُوا يَا ابْنَ مَسْعُودٍ نَحْنُ نَشْهَدُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَاهَا فِينَا فِي بِرْوَعَ بِنْتِ وَاشِقٍ وَإِنَّ زَوْجَهَا هِلَالُ بْنُ مُرَّةَ الْأَشْجَعِيُّ كَمَا قَضَيْتَ قَالَ فَفَرِحَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ فَرَحًا شَدِيدًا حِينَ وَافَقَ قَضَاؤُهُ قَضَاءَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Sufyan] dari [Firas] dari [Asy Sya'bi] dari [Masruq] dari [Abdullah] mengenai seorang laki-laki yang menikahi seorang wanita kemudian lelaki tersebut meninggal dunia, dan belum bercampur dengannya (menggaulinya) serta belum memberikan mahar kepadanya. Kemudian beliau berkata; baginya mahar secara sempurna dan ia wajib ber'iddah serta baginya warisan. Kemudian [Ma'qil bin Sinan] berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam memutuskan dengan hal tersebut pada diri Barwa' binti Wasyiq. Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Yazid bin Harun] dan [Ibnu Mahdi] dari [Sufyan] dari [Manshur] dari [Ibrahim] dari ['Al Qamah] dari [Abdullah], dan Utsman menyebutkan seperti itu. Telah menceritakan kepada kami [ubaidhullah bin Umar], telah menceritakan kepada kami [Yazid bin Zurai'], telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [Khalas] serta [Abu Hassan] dari [Abdullah bin 'Utbah bin Mas'ud] bahwa [Abdullah bin Mas'ud] dihadapkan pada masalah mengenai seorang laki-laki seperti hadits ini. Abdullah bin Utbah berkata; kemudian orang-orang datang kepadanya selama satu bulan. Atau ia mengatakan; selama beberapa kali. Abdullah bin Mas'ud berkata; sesungguhnya aku katakan mengenainya; bahwa baginya mahar seperti mahar wanita-wanita yang setara dengannya, tidak kurang dan tidak lebih, dan baginya warisan, serta berkewajiban untuk ber'iddah. Apabila (perkataan itu) benar maka berasal dari Allah, dan apabila salah maka hal tersebut berasal dariku dan dari syetan, Allah dan rasul-Nya berlepas diri. Kemudian orang-orang dari Asyja' diantara mereka adalah [Al Jarrah], dan [Abu Sinan] berkata; wahai Ibnu Mas'ud, kami bersaksi bahwa Rasulullah shallallahu 'alaihi wasallam telah memutuskan hal tersebut diantara kami mengenai diri Barwa' binti Wasyiq yang suaminya adalah Hilal bin Murrah seperti yang telah engkau putuskan. Abdullah bin 'Utbah berkata; kemudian Abdullah bin Mas'ud sangat senang sekali ketika keputusannya sama dengan keputusan Rasulullah shallallahu 'alaihi wasallam. "
            },
            {
                "number": 1743,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ الذُّهْلِيُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَعُمَرُ بْنُ الْخَطَّابِ قَالَ مُحَمَّدٌ حَدَّثَنَا أَبُو الْأَصْبَغِ الْجَزَرِيُّ عَبْدُ الْعَزِيزِ بْنُ يَحْيَى أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ أَبِي عَبْدِ الرَّحِيمِ خَالِدِ بْنِ أَبِي يَزِيدَ عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ عَنْ عُقْبَةَ بْنِ عَامِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ أَتَرْضَى أَنْ أُزَوِّجَكَ فُلَانَةَ قَالَ نَعَمْ وَقَالَ لِلْمَرْأَةِ أَتَرْضَيْنَ أَنْ أُزَوِّجَكِ فُلَانًا قَالَتْ نَعَمْ فَزَوَّجَ أَحَدَهُمَا صَاحِبَهُ فَدَخَلَ بِهَا الرَّجُلُ وَلَمْ يَفْرِضْ لَهَا صَدَاقًا وَلَمْ يُعْطِهَا شَيْئًا وَكَانَ مِمَّنْ شَهِدَ الْحُدَيْبِيَةَ وَكَانَ مَنْ شَهِدَ الْحُدَيْبِيَةَ لَهُ سَهْمٌ بِخَيْبَرَ فَلَمَّا حَضَرَتْهُ الْوَفَاةُ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَوَّجَنِي فُلَانَةَ وَلَمْ أَفْرِضْ لَهَا صَدَاقًا وَلَمْ أُعْطِهَا شَيْئًا وَإِنِّي أُشْهِدُكُمْ أَنِّي أَعْطَيْتُهَا مِنْ صَدَاقِهَا سَهْمِي بِخَيْبَرَ فَأَخَذَتْ سَهْمًا فَبَاعَتْهُ بِمِائَةِ أَلْفٍقَالَ أَبُو دَاوُد وَزَادَ عُمَرُ بْنُ الْخَطَّابِ وَحَدِيثُهُ أَتَمُّ فِي أَوَّلِ الْحَدِيثِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ النِّكَاحِ أَيْسَرُهُ وَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلرَّجُلِ ثُمَّ سَاقَ مَعْنَاهُ قَالَ أَبُو دَاوُد يُخَافُ أَنْ يَكُونَ هَذَا الْحَدِيثُ مُلْزَقًا لِأَنَّ الْأَمْرَ عَلَى غَيْرِ هَذَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris Adz Dzuhli], serta [Muhammad bin Al Mutsanna] dan [Umar bin Al Khathab], Muhammad berkata; telah menceritakan kepada kami [Abu Al Ashbagh Al Jazari Abdul Aziz bin Yahya], telah mengabarkan kepada kami [Muhammad bin Salamah] dari [Abu Abdurrahim Khalid bin Abu Yazid] dari [Zaid bin Abu Unaisah], dari [Yazid bin Abu Habib] dari [Martsad bin Abdullah] dari ['Uqbah bin 'Amir], bahwa Nabi shallallahu 'alaihi wasallam berkata kepada seorang laki-laki: \"Apakah engkau rela aku nikahkah engkau dengan Fulanah?\" Ia berkata; Iya. Beliau berkata kepada wanita tersebut: \"Apakah engkau rela aku nikahkan engkau dengan Fulan?\" Wanita tersebut berkata; Iya. Kemudian beliau menikahkan mereka berdua. Kemudian laki-laki tersebut bercampur dengannya (menggaulinya) dalam keadaan belum menentukan mahar dan belum memberikan sesuatupun kepadanya. Ia termasuk orang-orang yang menyaksikan perdamaian Al Hudaibiyah, orang yang menghadiri perdamaian Al Hudaibiyah, dan memiliki saham di Khaibar. Kemudian tatkala kematian menjemputnya ia berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah menikahkanku dengan Fulanah dan aku belum menentukan mahar untuknya dan belum memberikan sesuatupun kepadanya, dan aku meminta persaksian kalian bahwa aku telah memberikan kepadanya sahamku di Khaibar sebagai mahar. Kemudian wanita tersebut mengambil saham tersebut dan menjualnya seratus ribu. Abu Daud berkata; dan [Umar bin Al Khathab] menambahkan pada awal hadits, dan haditsnya lebih sempurna; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik pernikahan adalah yang paling mudah.\" Ia berkata; Rasulullah shallallahu 'alaihi wasallam berkata kepada laki-laki tersebut: Kemudian ia menyebutkan hadits tersebut dengan maknanya. Abu Daud berkata; hadits ini dikhawatirkan merupakan hadits tambahan karena kondisinya tidak demikian. "
            },
            {
                "number": 1744,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ فِي خُطْبَةِ الْحَاجَةِ فِي النِّكَاحِ وَغَيْرِهِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ الْمَعْنَى حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ وَأَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ قَالَعَلَّمَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُطْبَةَ الْحَاجَةِ أَنْ الْحَمْدُ لِلَّهِ نَسْتَعِينُهُ وَنَسْتَغْفِرُهُ وَنَعُوذُ بِهِ مِنْ شُرُورِ أَنْفُسِنَا مَنْ يَهْدِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ يَا أَيُّهَا الَّذِينَ آمَنُوا{ اتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا }{ يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسْلِمُونَ }{ يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَقُولُوا قَوْلًا سَدِيدًا يُصْلِحْ لَكُمْ أَعْمَالَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَمَنْ يُطِعْ اللَّهَ وَرَسُولَهُ فَقَدْ فَازَ فَوْزًا عَظِيمًا }لَمْ يَقُلْ مُحَمَّدُ بْنُ سُلَيْمَانَ أَنْ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا عِمْرَانُ عَنْ قَتَادَةَ عَنْ عَبْدِ رَبِّهِ عَنْ أَبِي عِيَاضٍ عَنْ ابْنِ مَسْعُودٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا تَشَهَّدَ ذَكَرَ نَحْوَهُ وَقَالَ بَعْدَ قَوْلِهِ وَرَسُولُهُ أَرْسَلَهُ بِالْحَقِّ بَشِيرًا وَنَذِيرًا بَيْنَ يَدَيْ السَّاعَةِ مَنْ يُطِعْ اللَّهَ وَرَسُولَهُ فَقَدْ رَشَدَ وَمَنْ يَعْصِهِمَا فَإِنَّهُ لَا يَضُرُّ إِلَّا نَفْسَهُ وَلَا يَضُرُّ اللَّهَ شَيْئًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Sufyan] dari [Abu Ishaq] dari [Abu 'Ubaidah] dari [Abdullah bin Mas'ud] mengenai khutbah hajah dalam pernikahan dan yang lainnya, dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] secara makna, telah menceritakan kepada kami [Waki'] dari [Israil], dari [Abu Ishaq] dari [Abu Al Ahwash] dan [Abu 'Ubaidah] dari [Abdullah], ia berkata; Rasulullah shallallahu 'alaihi wasallam telah mengajarkan kepada khutbah hajah, yaitu: INNAL HAMDA LILLAAH, NAHMADUHU WA NASTA'IINUHU WA NASTAGHFIRUH, WA NA'UUDZU BILLAAHI MIN SYURUURI ANFUSINAA MAN YAHDIHILLAAHU FALAA MUDHILLALAH, WA MAN YUDHLIL FALAA HAADIYALAH. ASYHADU ANLAA ILAAHA ILLALLAAHU WA ASYHADU ANNA MUHAMMADAN 'ABDUHU WA RASUULUH. YAA AYYUHALLADZIINA AAMANUT TAQULLAAHAL LADZII TASAA-ALUUNA BIHII WAL ARHAAM, INNALLAAHA KAANA 'ALAIKUM RAQIIBAA. YAA AYYUHALLADZIINA AAMANUT TAQULLAAHA HAQQA TUQAATIHI WA LAA TAMUUTUNNA ILLAA WA ANTUM MUSLIMUUN, YAA AYYUHALLADZIINA AAMANUUT TAQULLAAHA WA QUULUU QAULAN SADIIDAA, YUSHLIH LAKUM A'MAALAKUM WA YAGHFIRLAKUM DZUNUUBAKUM WA MAYYUTHI'ILLAAHA WA RASUULAHU FAQAD FAAZA FAUZAN 'AZHIIMAA (Segala puji bagi Allah, kami memuji dan memohon pertolongan serta ampunan kepadaNya, dan berlindung kepada Allah dari keburukan diri kita, barangsiapa yang Allah beri petunjuk maka tidak ada yang dapat menyesatkannya dan barangsiapa yang Allah sesatkan, maka tidak ada yang dapat memberinya petunjuk. Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah dan Muhammad adalah hamba serta rasulNya. Hai orang-orang yang beriman, bertaqwalah kepada Allah yang dengan (mempergunakan) nama-Nya kamu saling meminta satu sama lain, dan (peliharalah) hubungan silaturrahim. Sesungguhnya Allah selalu menjaga dan mengawasi kamu. Hai orang-orang yang beriman, bertaqwalah kepada Allah sebenar-benar taqwa kepada-Nya; dan janganlah sekali-kali kamu mati melainkan dalam keadaan beragama Islam. Hai orang-orang yang beriman, bertaqwalah kamu kepada Allah dan katakanlah perkataan yang benar, niscaya Allah memperbaiki bagimu amalan-amalanmu dan mengampuni bagimu dosa-dosamu. Dan barangsiapa mentaati Allah dan Rasul-Nya, maka sesungguhnya ia telah mendapat kemenangan yang besar(. Muhammad bin Sulaiman tidak menyebutkan khutbah tersebut. Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Abu 'Ashim], telah menceritakan kepada kami ['Imran] dari [Qatadah] dari [Abdu Rabbih] dari [Abu 'Iyadh] dari [Ibnu Mas'ud] bahwa Rasulullah shallallahu 'alaihi wasallam apabila bertasayahud menyebutkan seperti itu. Dan ia mengatakan setelah ucapannya: \"dan rasulNya\" yang Allah utus dengan kebenaran sebagai pemberi kabar gembira dan pemberi peringatan di hadapan Hari Kiamat. Barangsiapa yang mentaati Allah dan rasulNya maka sungguh ia telah mendapatkan petunjuk dan barangsiapa yang mendurhakai mereka berdua, maka sesungguhnya ia tidak merugikan kecuali terhadap dirinya sendiri, dan tidak merugikan Allah sedikitpun. "
            },
            {
                "number": 1745,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ أَخْبَرَنَا شُعْبَةُ عَنْ الْعَلَاءِ ابْنَ أَخِي شُعَيْبٍ الرَّازِيِّ عَنْ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ عَنْ رَجُلٍ مِنْ بَنِي سُلَيْمٍ قَالَخَطَبْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمَامَةَ بِنْتَ عَبْدِ الْمُطَّلِبِ فَأَنْكَحَنِي مِنْ غَيْرِ أَنْ يَتَشَهَّدَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Badal bin Al Muhabbar], telah mengabarkan kepada kami [Syu'bah] dari [Al 'Ala`] anak saudara Syu'aib Ar Razi dari [Isma'il bin Ibrahim] dari [seorang laki-laki dari Bani Sulaim], ia berkata; aku meminang Umamah binti Abdul Muththalib kepada Rasulullah shallallahu 'alaihi wasallam kemudian beliau menikahkanku tanpa beliau mengucapkan syahadat. "
            },
            {
                "number": 1746,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْتَزَوَّجَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا بِنْتُ سَبْعٍ قَالَ سُلَيْمَانُ أَوْ سِتٍّ وَدَخَلَ بِي وَأَنَا بِنْتُ تِسْعٍ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb], serta [Abu Kamil], mereka berkata; Telah menceritakan kepada kami [Hammad bin Zaid] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam menikahiku sementara aku berumur tujuh tahun. Sulaiman berkata; atau enam tahun, dan beliau bercampur denganku sementara aku berumur sembilan tahun. "
            },
            {
                "number": 1747,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرٍ عَنْ أَبِيهِ عَنْ أُمِّ سَلَمَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا تَزَوَّجَ أُمَّ سَلَمَةَ أَقَامَ عِنْدَهَا ثَلَاثًا ثُمَّ قَالَ لَيْسَ بِكِ عَلَى أَهْلِكِ هَوَانٌ إِنْ شِئْتِ سَبَّعْتُ لَكِ وَإِنْ سَبَّعْتُ لَكِ سَبَّعْتُ لِنِسَائِي",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb], telah menceritakan kepada kami [Yahya] dari [Sufyan], ia berkata; telah menceritakan kepadaku [Muhammad bin Abu Bakr], dari [Abdul Malik bin Abu Bakr] dari [ayahnya] dari [Ummu Salamah] bahwa Rasulullah shallallahu 'alaihi wasallam tatkala menikahi Ummu Salamah beliau tinggal di rumahnya selama tiga hari, kemudian beliau berkata: \"Engkau tidaklah direndahkan dan dikurangi hak kamu oleh keluargamu (maksudnya Rasulullah shallallahu 'alaihi wasallam), apabila engkau mau maka aku akan memberimu (giliran) tujuh hari, dan apabila aku memberimu (giliran) tujuh hari, maka aku memberi isteri-isteriku (giliran) tujuh hari (juga).\""
            },
            {
                "number": 1748,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ عَنْ هُشَيْمٍ عَنْ حُمَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَلَمَّا أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَفِيَّةَ أَقَامَ عِنْدَهَا ثَلَاثًا زَادَ عُثْمَانُ وَكَانَتْ ثَيِّبًاو قَالَ حَدَّثَنِي هُشَيْمٌ أَخْبَرَنَا حُمَيْدٌ أَخْبَرَنَا أَنَسٌ",
                "id": "Telah menceritakan kepada kami [Wahb bin Baqiyyah], serta [Utsman bin Abu Syaibah], dari [Husyaim] dari [Humaid], dari [Anas bin Malik], ia berkata; tatkala Rasulullah shallallahu 'alaihi wasallam mengambil (menikahi) Shafiyyah beliau tinggal di rumahnya selama tiga hari. Utsman menambahkan; dan ia adalah seorang janda. dan ia berkata; telah menceritakan kepadaku [Husyaim], telah mengabarkan kepada kami [Humaid], telah mengabarkan kepada kami [Anas]. "
            },
            {
                "number": 1749,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا هُشَيْمٌ وَإِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَإِذَا تَزَوَّجَ الْبِكْرَ عَلَى الثَّيِّبِ أَقَامَ عِنْدَهَا سَبْعًا وَإِذَا تَزَوَّجَ الثَّيِّبَ أَقَامَ عِنْدَهَا ثَلَاثًا وَلَوْ قُلْتُ إِنَّهُ رَفَعَهُ لَصَدَقْتُ وَلَكِنَّهُ قَالَ السُّنَّةُ كَذَلِكَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Husyaim], dan [Isma'il bin 'Ulayyah], dari [Khalid Al Hadzdza`] dari [Abu Qilabah] dari [Anas bin Malik], ia berkata; apabila seseorang menikahi seorang gadis sebagai madu seorang janda maka ia tinggal di rumahnya selama tujuh hari, dan apabila menikahi seorang janda maka ia tinggal di rumahnya selama tiga hari. Jika aku mengatakan ia telah merafa'kan hadits tersebut, maka aku telah benar, akan tetapi ia mengatakan; sunnah. Demikianlah. "
            },
            {
                "number": 1750,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ الطَّالَقَانِيُّ حَدَّثَنَا عَبْدَةُ حَدَّثَنَا سَعِيدٌ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَلَمَّا تَزَوَّجَ عَلِيٌّ فَاطِمَةَ قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطِهَا شَيْئًا قَالَ مَا عِنْدِي شَيْءٌ قَالَ أَيْنَ دِرْعُكَ الْحُطَمِيَّةُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Isma'il Ath Thalaqani], telah menceritakan kepada kami ['Abdah], telah menceritakan kepada kami [Sa'id], dari [Ayyub] dari [Ikrimah] dari [Ibnu Abbas], ia berkata; tatkala Ali menikahi Fathimah, Rasulullah shallallahu 'alaihi wasallam berkata kepadanya: \"Berikan sesuatu kepadanya!\" Ia berkata; aku tidak memiliki sesuatu. Beliau berkata: \"Dimanakah baju besimu luas dan berat itu?\""
            },
            {
                "number": 1751,
                "arab": "حَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ الْحِمْصِيُّ حَدَّثَنَا أَبُو حَيْوَةَ عَنْ شُعَيْبٍ يَعْنِي ابْنَ أَبِي حَمْزَةَ حَدَّثَنِي غَيْلَانُ بْنُ أَنَسٍ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ عَلِيًّا لَمَّا تَزَوَّجَ فَاطِمَةَ بِنْتَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَرَادَ أَنْ يَدْخُلَ بِهَا فَمَنَعَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى يُعْطِيَهَا شَيْئًا فَقَالَ يَا رَسُولَ اللَّهِ لَيْسَ لِي شَيْءٌ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطِهَا دِرْعَكَ فَأَعْطَاهَا دِرْعَهُ ثُمَّ دَخَلَ بِهَاحَدَّثَنَا كَثِيرٌ يَعْنِي ابْنَ عُبَيْدٍ حَدَّثَنَا أَبُو حَيْوَةَ عَنْ شُعَيْبٍ عَنْ غَيْلَانَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Katsir bin 'Ubaid Al Himshi], telah menceritakan kepada kami [Abu Haiwah] dari [Syu'aib bin Abu Hamzah], telah menceritakan kepadaku [Ghailan bin Anas], telah menceritakan kepadaku [Muhammad bin Abdurrahman bin Tsauban], dari [seorang laki-laki] sahabat Nabi shallallahu 'alaihi wasallam, bahwa Ali tatkala menikahi Fathimah binti Rasulullah shallallahu 'alaihi wasallam dan hendak bercampur dengannya (menggaulinya), Rasulullah shallallahu 'alaihi wasallam melarangnya hingga ia memberikan sesuatu kepadanya. Kemudian ia berkata; wahai Rasulullah, aku tidak memiliki sesuatu. Kemudian Nabi shallallahu 'alaihi wasallam berkata kepadanya: \"Berikan baju besimu kepadanya!\" kemudian Ali memberikannya kepada Fathimah, kemudian ia bercampur dengannya (menggaulinya). Telah menceritakan kepada kami [Katsir bin 'Ubaid], telah menceritakan kepada kami [Abu Haiwah], dari [Syu'aib] dari [Ghailan] dari [Ikrimah] dari [Ibnu Abbas] seperti itu. "
            },
            {
                "number": 1752,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا شَرِيكٌ عَنْ مَنْصُورٍ عَنْ طَلْحَةَ عَنْ خَيْثَمَةَ عَنْ عَائِشَةَ قَالَتْأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أُدْخِلَ امْرَأَةً عَلَى زَوْجِهَا قَبْلَ أَنْ يُعْطِيَهَا شَيْئًاقَالَ أَبُو دَاوُد وَخَيْثَمَةُ لَمْ يَسْمَعْ مِنْ عَائِشَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah Al Bazzar], telah menceritakan kepada kami [Syarik], dari [Manshur] dari [Thalhah] dari [Khaitsamah] dari [Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkanku agar memasukkan (menyerahkan) wanita kepada suaminya sebelum suami tersebut memberikan sesuatu kepadanya. Abu Daud berkata; dan Khaitsamah tidak mendengar dari Aisyah. "
            },
            {
                "number": 1753,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ أَخْبَرَنَا ابْنُ جُرَيْجٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا امْرَأَةٍ نُكِحَتْ عَلَى صَدَاقٍ أَوْ حِبَاءٍ أَوْ عِدَّةٍ قَبْلَ عِصْمَةِ النِّكَاحِ فَهُوَ لَهَا وَمَا كَانَ بَعْدَ عِصْمَةِ النِّكَاحِ فَهُوَ لِمَنْ أُعْطِيَهُ وَأَحَقُّ مَا أُكْرِمَ عَلَيْهِ الرَّجُلُ ابْنَتُهُ أَوْ أُخْتُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ma'mar], telah menceritakan kepada kami [Muhammad bin Bakr Al Bursani], telah mengabarkan kepada kami [Ibnu Juraij] dari ['Amr bin Syu'aib] dari [ayahnya] dari [kakeknya], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap wanita yang dinikahkan dengan suatu mahar, pemberian, atau janji sebelum akad nikah, maka hal itu adalah miliknya. Adapun yang diberikan setelah akad nikah, maka hal itu adalah milik orang yang diberinya. Dan orang yang paling berhak terhadap penghormatan yang diberikan kepada seseorang adalah anak atau saudara wanita wanita.\""
            },
            {
                "number": 1754,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَفَّأَ الْإِنْسَانَ إِذَا تَزَوَّجَ قَالَ بَارَكَ اللَّهُ لَكَ وَبَارَكَ عَلَيْكَ وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id], telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Suhail] dari [ayahnya], dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam apabila mengucapkan selamat kepada seseorang apabila ia menikah beliau mengucapkan: \"BAARAKALLAAHU LAKA WA BAARAKA 'ALAIKA WA JAMA'A BAINAKUMAA FII KHAIRIN\" (Semoga Allah memberkahimu dan senantiasa memberkahimu dan mengumpulkan kalian berdua dalam kebaikan.\""
            },
            {
                "number": 1755,
                "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ وَالْحَسَنُ بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ أَبِي السَّرِيِّ الْمَعْنَى قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ رَجُلٌ مِنْ الْأَنْصَارِ قَالَ ابْنُ أَبِي السَّرِيِّ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَقُلْ مِنْ الْأَنْصَارِ ثُمَّ اتَّفَقُوا يُقَالُ لَهُ بَصْرَةُ قَالَتَزَوَّجْتُ امْرَأَةً بِكْرًا فِي سِتْرِهَا فَدَخَلْتُ عَلَيْهَا فَإِذَا هِيَ حُبْلَى فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهَا الصَّدَاقُ بِمَا اسْتَحْلَلْتَ مِنْ فَرْجِهَا وَالْوَلَدُ عَبْدٌ لَكَ فَإِذَا وَلَدَتْ قَالَ الْحَسَنُ فَاجْلِدْهَا و قَالَ ابْنُ أَبِي السَّرِيِّ فَاجْلِدُوهَا أَوْ قَالَ فَحُدُّوهَاقَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ قَتَادَةُ عَنْ سَعِيدِ بْنِ يَزِيدَ عَنْ ابْنِ الْمُسَيَّبِ وَرَوَاهُ يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ يَزِيدَ بْنِ نُعَيْمٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَعَطَاءٍ الْخُرَاسَانِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَرْسَلُوهُ كُلُّهُمْ وَفِي حَدِيثِ يَحْيَى بْنِ أَبِي كَثِيرٍ أَنَّ بَصْرَةَ بْنَ أَكْثَمَ نَكَحَ امْرَأَةً وَكُلُّهُمْ قَالَ فِي حَدِيثِهِ جَعَلَ الْوَلَدَ عَبْدًا لَهُ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا عَلِيٌّ يَعْنِي ابْنَ الْمُبَارَكِ عَنْ يَحْيَى عَنْ يَزِيدَ بْنِ نُعَيْمٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّ رَجُلًا يُقَالُ لَهُ بَصْرَةُ بْنُ أَكْثَمَ نَكَحَ امْرَأَةً فَذَكَرَ مَعْنَاهُ زَادَ وَفَرَّقَ بَيْنَهُمَا وَحَدِيثُ ابْنِ جُرَيْجٍ أَتَمُّ",
                "id": "Telah menceritakan kepada kami [Makhlad bin Khalid] serta [Al Hasan bin Ali] dan [Muhammad bin Abu As Sari] secara makna, mereka berkata; telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ibnu Juraij], dari [Shafwan bin Sulaim], dari [Sa'id bin Al Musayyab], dari seorang laki-laki anshar, [Ibnu Abu As Sari] berkata; yang merupakan sahabat Nabi shallallahu 'alaihi wasallam, tidak mengatakan; anshar. Kemudian mereka sepakat mengatakan; yang dipanggil Bashrah, ia berkata; aku menikahi seorang budak perawan dalam tabirnya, kemudian aku menemuinya dan ternyata ia sedang hamil. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Baginya mahar karena farji yang telah engkau halalkan, dan anaknya adalah budakmu apabila ia telah melahirkan.\" Al Hasan berkata; cambuklah dia. Ibnu Abu As Sari berkata; cambuklah dia. Atau mengatakan; hukumlah dia. Abu Daud berkata; hadits ini telah diriwayatkan oleh [Qatadah] dari [Sa'id bin Yazid] dari [Ibnu Al Musayyab], dan telah diriwayatkan oleh [Yahya bin Abu Katsir] dari [Yazid bin Nu'aim] dari [Sa'id bin Al Musayyab] serta ['Atha` Al Khurasani], dari [Sa'id bin Al Musayyab]. Mereka semua telah memursalkannya. Dan di dalam hadits Yahya bin Abu Katsir disebutkan bahwa [Bashrah bin Aktsam] menikahi seorang wanita, dan seluruh mereka mengatakan dalam haditsnya; ia menjadikan anak tersebut sebagai budaknya. Telah menceritakan kepada kami [Muhammad bin Al Mutsanna], telah menceritakan kepada kami [Utsman bin Umar], telah menceritakan kepada kami [Ali bin Al Mubarak], dari [Yahya] dari [Yazid bin Nu'aim] dari [Sa'id bin Al Musayyab] bahwa seorang laki-laki yang dipanggil [Bashrah bin Aktsam] telah menikahi seorang wanita…. Kemudian ia menyebutkan makna hadits dan menambahkan; dan beliau memisahkan diantara mereka berdua. Hadits Ibnu Juraij lebih sempurna."
            },
            {
                "number": 1756,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ النَّضْرِ بْنِ أَنَسٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَتْ لَهُ امْرَأَتَانِ فَمَالَ إِلَى إِحْدَاهُمَا جَاءَ يَوْمَ الْقِيَامَةِ وَشِقُّهُ مَائِلٌ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi], telah menceritakan kepada kami [Hammam], telah menceritakan kepada kami [Qatadah] dari [An Nadhrah bin Anas] dari [Basyir bin Nahik] dari [Abu Hurairah], dari Nabi shallallahu 'alaihi wasallam, beliau berkata: \"Barangsiapa yang memiliki dua orang isteri kemudian ia cenderung kepada salah seorang diantara keduanya, maka ia akan datang pada hari Kiamat dalam keadaan sebelah badannya miring.\""
            },
            {
                "number": 1757,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْسِمُ فَيَعْدِلُ وَيَقُولُ اللَّهُمَّ هَذَا قَسْمِي فِيمَا أَمْلِكُ فَلَا تَلُمْنِي فِيمَا تَمْلِكُ وَلَا أَمْلِكُقَالَ أَبُو دَاوُد يَعْنِي الْقَلْبَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Abu Qilabah] dari [Abdullah bin Yazid Al Khathmi] dari [Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam memberikan pembagian dan berbuat adil dalam membagi, dan beliau berkata: \"Ya Allah, inilah pembagianku yang aku mampu, maka janganlah Engkau cela aku pada sesuatu yang Engkau mampu dan tidak aku mampu.\" Abu Daud berkata; yaitu hati. "
            },
            {
                "number": 1758,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ أَبِي الزِّنَادِ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ قَالَ قَالَتْ عَائِشَةُيَا ابْنَ أُخْتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُفَضِّلُ بَعْضَنَا عَلَى بَعْضٍ فِي الْقَسْمِ مِنْ مُكْثِهِ عِنْدَنَا وَكَانَ قَلَّ يَوْمٌ إِلَّا وَهُوَ يَطُوفُ عَلَيْنَا جَمِيعًا فَيَدْنُو مِنْ كُلِّ امْرَأَةٍ مِنْ غَيْرِ مَسِيسٍ حَتَّى يَبْلُغَ إِلَى الَّتِي هُوَ يَوْمُهَا فَيَبِيتَ عِنْدَهَا وَلَقَدْ قَالَتْ سَوْدَةُ بِنْتُ زَمْعَةَ حِينَ أَسَنَّتْ وَفَرِقَتْ أَنْ يُفَارِقَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا رَسُولَ اللَّهِ يَوْمِي لِعَائِشَةَ فَقَبِلَ ذَلِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهَا قَالَتْ نَقُولُ فِي ذَلِكَ أَنْزَلَ اللَّهُ تَعَالَى وَفِي أَشْبَاهِهَا أُرَاهُ قَالَ{ وَإِنْ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا }",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus], telah menceritakan kepada kami [Abdurrahman bin Abu Az Zinad] dari [Hisyam bin 'Urwah] dari [ayahnya], ia berkata; [Aisyah] berkata; wahai anak saudariku, Rasulullah shallallahu 'alaihi wasallam tidak melebihkan sebagian kami atas sebagian yang lain dalam membagi waktu tinggalnya bersama kami. Setiap hari beliau mengelilingi kami semua dan mendekat kepada seluruh isteri tanpa menyentuh hingga sampai kepada rumah isteri yang hari itu merupakan bagiannya, kemudian beliau bermalam padanya. Sungguh Saudah binti Zam'ah ketika telah berusia lanjut dan takut ditinggalkan Rasulullah shallallahu 'alaihi wasallam, ia berkata; wahai Rasulullah, hariku untuk Aisyah. Dan Rasulullah shallallahu 'alaihi wasallam menerima hal tersebut. Ia berkata; kami katakan; mengenai hal tersebut dan orang yang semisalnya, Allah Ta'ala menurunkan ayat: \"Dan jika seorang wanita khawatir akan nusyuz.\""
            },
            {
                "number": 1759,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ وَمُحَمَّدُ بْنُ عِيسَى الْمَعْنَى قَالَا حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ عَنْ عَاصِمٍ عَنْ مُعَاذَةَ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَأْذِنُنَا إِذَا كَانَ فِي يَوْمِ الْمَرْأَةِ مِنَّا بَعْدَمَا نَزَلَتْ{ تُرْجِي مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ }قَالَتْ مَعَاذَةُ فَقُلْتُ لَهَا مَا كُنْتِ تَقُولِينَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كُنْتُ أَقُولُ إِنْ كَانَ ذَلِكَ إِلَيَّ لَمْ أُوثِرْ أَحَدًا عَلَى نَفْسِي",
                "id": "Telah menceritakan kepada kami [Yahya bin Ma'in], serta [Muhammad bin Isa] secara makna, mereka berkata; telah menceritakan kepada kami ['Abbad bin 'Abbad] dari ['Ashim] dari [Mu'adzah] dari [Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam meminta izin kepada kami apabila berada pada hari (giliran) seorang isteri dari kami setelah turunnya ayat: \"Kamu boleh menangguhkan menggauli siapa yang kamu kehendaki di antara mereka (isteri-isterimu) dan (boleh pula) menggauli siapa yang kamu kehendaki.\" Mu'adzah berkata; kemudian aku katakan kepada Aisyah; apa yang engkau katakan kepada Rasulullah shallallahu 'alaihi wasallam? Ia berkata; aku katakan; apabila hal itu diserahkan kepadaku, maka aku tidak akan mendahulukan seorangpun atas diriku. "
            },
            {
                "number": 1760,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا مَرْحُومُ بْنُ عَبْدِ الْعَزِيزِ الْعَطَّارُ حَدَّثَنِي أَبُو عِمْرَانَ الْجَوْنِيُّ عَنْ يَزِيدَ بْنِ بَابَنُوسَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ إِلَى النِّسَاءِ تَعْنِي فِي مَرَضِهِ فَاجْتَمَعْنَ فَقَالَ إِنِّي لَا أَسْتَطِيعُ أَنْ أَدُورَ بَيْنَكُنَّ فَإِنْ رَأَيْتُنَّ أَنْ تَأْذَنَّ لِي فَأَكُونَ عِنْدَ عَائِشَةَ فَعَلْتُنَّ فَأَذِنَّ لَهُ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Marhum bin Abdul Aziz Al 'Aththar], telah menceritakan kepadaku [Abu Imran Al Jauni] dari [Yazid bin Babanus] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam mengirimkan utusan kepada para isterinya ketika beliau sedang sakit, kemudian mereka berkumpul, lalu beliau berkata: \"Sesungguhnya aku tidak mampu untuk berkeliling diantara kalian, maka apabila kalian mengizinkan aku untuk berada di sisi Aisyah, maka lakukanlah.\" Kemudian mereka mengizinkan beliau. "
            },
            {
                "number": 1761,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ حَدَّثَهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ سَفَرًا أَقْرَعَ بَيْنَ نِسَائِهِ فَأَيَّتُهُنَّ خَرَجَ سَهْمُهَا خَرَجَ بِهَا مَعَهُ وَكَانَ يَقْسِمُ لِكُلِّ امْرَأَةٍ مِنْهُنَّ يَوْمَهَا وَلَيْلَتَهَا غَيْرَ أَنَّ سَوْدَةَ بِنْتَ زَمْعَةَ وَهَبَتْ يَوْمَهَا لِعَائِشَةَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Amr bin As Sarh], telah mengabarkan kepada kami [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] bahwa ['Urwah bin Az Zubair] telah menceritakan kepadanya bahwa [Aisyah] isteri Nabi shallallahu 'alaihi wasallam berkata; Rasulullah shallallahu 'alaihi wasallam apabila hendak bepergian beliau mengundi diantara para isterinya, siapa diantara mereka yang keluar undiannya maka beliau keluar bersamanya. Dan beliau membagi bagian untuk setiap isteri satu hari satu malam, hanya saja Saudah binti Zam'ah telah memberikan harinya untuk Aisyah. "
            },
            {
                "number": 1762,
                "arab": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ أَخْبَرَنِي اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ بْنِ عَامِرٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ أَحَقَّ الشُّرُوطِ أَنْ تُوفُوا بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ",
                "id": "Telah menceritakan kepada kami [Isa bin Hammad], telah mengabarkan kepadaku [Al Laits] dari [Yazid bin Abu Habib] dari [Abu Al Khair] dari ['Uqbah bin 'Amir] dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Sesungguhnya syarat yang paling berhak untuk dipenuhi adalah (syarat) yang kalian gunakan untuk menghalalkan farji.\""
            },
            {
                "number": 1763,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا إِسْحَقُ بْنُ يُوسُفَ عَنْ شَرِيكٍ عَنْ حُصَيْنٍ عَنْ الشَّعْبِيِّ عَنْ قَيْسِ بْنِ سَعْدٍ قَالَأَتَيْتُ الْحِيرَةَ فَرَأَيْتُهُمْ يَسْجُدُونَ لِمَرْزُبَانٍ لَهُمْ فَقُلْتُ رَسُولُ اللَّهِ أَحَقُّ أَنْ يُسْجَدَ لَهُ قَالَ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنِّي أَتَيْتُ الْحِيرَةَ فَرَأَيْتُهُمْ يَسْجُدُونَ لِمَرْزُبَانٍ لَهُمْ فَأَنْتَ يَا رَسُولَ اللَّهِ أَحَقُّ أَنْ نَسْجُدَ لَكَ قَالَ أَرَأَيْتَ لَوْ مَرَرْتَ بِقَبْرِي أَكُنْتَ تَسْجُدُ لَهُ قَالَ قُلْتُ لَا قَالَ فَلَا تَفْعَلُوا لَوْ كُنْتُ آمِرًا أَحَدًا أَنْ يَسْجُدَ لِأَحَدٍ لَأَمَرْتُ النِّسَاءَ أَنْ يَسْجُدْنَ لِأَزْوَاجِهِنَّ لِمَا جَعَلَ اللَّهُ لَهُمْ عَلَيْهِنَّ مِنْ الْحَقِّ",
                "id": "Telah menceritakan kepada kami ['Amr bin 'Aun], telah mengabarkan kepada kami [Ishaq bin Yusuf] dari [Syarik], dari [Hushain], dari [Asy Sya'bi] dari [Qais bin Sa'd], ia berkata; aku datang ke Al Hirah (negeri lama yang berada di Kufah), maka aku melihat mereka bersujud kepada penunggang kuda mereka yang pemberani. Lalu aku katakan; Rasulullah shallallahu 'alaihi wasallam lebih berhak untuk dilakukan sujud kepadanya. Qais bin Sa'd berkata; kemudian aku datang kepada Nabi shallallahu 'alaihi wasallam dan aku katakan; sesungguhnya aku datang ke Al Hirah dan aku melihat mereka bersujud kepada penunggang kuda mereka yang pemberani. Engkau wahai Rasulullah, lebih berhak untuk kami bersujud kepadamu. Beliau berkata: \"Bagaimana pendapatmu, seandainya engkau melewati kuburanku, apakah engkau akan bersujud kepadanya?\" Qais bin Sa'd berkata; aku katakan; tidak. Beliau bersabda: \"Jangan kalian lakukan, seandainya aku boleh memerintahkan seseorang untuk bersujud kepada seseorang, niscaya aku perintahkan para wanita agar bersujud kepada suami-suami mereka, karena hak yang telah Allah berikan atas mereka.\""
            },
            {
                "number": 1764,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو الرَّازِيُّ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَعَا الرَّجُلُ امْرَأَتَهُ إِلَى فِرَاشِهِ فَأَبَتْ فَلَمْ تَأْتِهِ فَبَاتَ غَضْبَانَ عَلَيْهَا لَعَنَتْهَا الْمَلَائِكَةُ حَتَّى تُصْبِحَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Amr Ar Razi], telah menceritakan kepada kami [Jarir], dari [Al A'masy], dari [Abu Hazim], dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila seorang laki-laki memanggil isterinya ke ranjangnya (mengajak melakukan hubungan badan), kemudian sang istri menolak dan tidak datang kepadanya sehingga suaminya melewati malam (tidur) dalam keadaan marah, maka Malaikat akan melaknatnya hingga pagi.\""
            }
        ]
    }
}