{
    "status": true,
    "data": {
        "start": 4293,
        "end": 4440,
        "total": 13,
        "book": "ahmad",
        "hadits": [
            {
                "number": 4293,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ الْكَرِيمِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ قَالَزَوَّجَنِي أَبِي فِي إِمَارَةِ عُثْمَانَ فَدَعَا نَفَرًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَ صَفْوَانُ بْنُ أُمَيَّةَ وَهُوَ شَيْخٌ كَبِيرٌ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ انْهَسُوا اللَّحْمَ نَهْسًا فَإِنَّهُ أَهْنَأُ وَأَمْرَأُ أَوْ أَشْهَى وَأَمْرَأُقَالَ سُفْيَانُ الشَّكُّ مِنِّي أَوْ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Abdul Karim] dari [Abdullah bin Al Harits] dia berkata, \"Ayahku telah menikahkan aku pada masa kepemimpinannya Utsman, maka dia mengundang beberapa orang sahabat Rasulullah shallallahu 'alaihi wasallam. Lalu datanglah [Shafwan bin Umayyah], sedangkan dia telah lanjut usia, kemudian dia berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Gigitlah (makanlah) oleh kalian daging, karena sesungguhnya ia lebih enak dan lezat, atau lebih membangkitkan selera dan lebih lezat.\" Perawi berkata, [Sufyan] ragu 'dariku' ataukah 'darinya'."
            },
            {
                "number": 4294,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ ثَنَا التَّيْمِيُّ يَعْنِي سُلَيْمَانَ عَنْ أَبِي عُثْمَانَ يَعْنِي النَّهْدِيَّ عَنْ عَامِرِ بْنِ مَالِكٍ عَنْ صَفْوَانَ بْنِ أُمَيَّةَ قَالَالطَّاعُونُ وَالْبَطْنُ وَالْغَرَقُ وَالنُّفَسَاءُ شَهَادَةٌقَالَ حَدَّثَنَا بِهِ أَبُو عُثْمَانَ مِرَارًا وَقَدْ رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّةً",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] berkata, telah menceritakan kepada kami [At Taimi] -yakni Sulaiman- dari [Abu Utsman] -yakni An Nahdi- dari [Amir bin Malik] dari [Shafwan bin Umayyah] berkata, \"(Meninggal) karena penyakit tha'un, sakit perut, tenggelam dan habis melahirkan adalah mati syahid.\" Telah menceritakan kepada kami tentangnya [Abu Utsman] secara terus menerus, dan sekali waktu ia memarfu'kannya kepada Nabi shallallahu 'alaihi wasallam sekali.\""
            },
            {
                "number": 4295,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا شَرِيكٌ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ أُمَيَّةَ بْنِ صَفْوَانَ بْنِ أُمَيَّةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَعَارَ مِنْهُ يَوْمَ حُنَيْنٍ أَدْرَاعًا فَقَالَ أَغَصْبًا يَا مُحَمَّدُ قَالَ بَلْ عَارِيَةٌ مَضْمُونَةٌ قَالَ فَضَاعَ بَعْضُهَا فَعَرَضَ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُضَمِّنَهَا لَهُ قَالَ أَنَا الْيَوْمَ يَا رَسُولَ اللَّهِ فِي الْإِسْلَامِ أَرْغَبُ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Syarik] dari [Abdul Aziz bin Rufai'] dari [Umayyah bin Shafwan bin Umayyah] dari [Ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam meminjam baju besi darinya pada waktu perang Hunain, maka dia berkata, \"Apakah kamu telah mengambilnya wahai Muhammad?\" Beliau bersabda: \"Bahkan aku meminjamnya dengan jaminan.\" Dia berkata, \"Lalu sebagian (baju besinya) ada yang hilang, sehingga Rasulullah shallallahu 'alaihi wasallam menerangkan kepadanya dan membayar uang jaminan, maka Umayyah pun berkata, \"Wahai Rasulullah, pada hari ini aku lebih mencintai Islam.\""
            },
            {
                "number": 4296,
                "arab": "حَدَّثَنَا رَوْحٌ قَالَ ثَنَا مُحَمَّدُ بْنُ أَبِي حَفْصَةَ قَالَ ثَنَا الزُّهْرِيُّ عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِأَنَّ صَفْوَانَ بْنَ أُمَيَّةَ بْنِ خَلَفٍ قِيلَ لَهُ هَلَكَ مَنْ لَمْ يُهَاجِرْ قَالَ فَقُلْتُ لَا أَصِلُ إِلَى أَهْلِي حَتَّى آتِيَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَكِبْتُ رَاحِلَتِي فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ زَعَمُوا أَنَّهُ هَلَكَ مَنْ لَمْ يُهَاجِرْ قَالَ كَلَّا أَبَا وَهْبٍ فَارْجِعْ إِلَى أَبَاطِحِ مَكَّةَ قَالَ فَبَيْنَا أَنَا رَاقِدٌ جَاءَ السَّارِقُ فَأَخَذَ ثَوْبِي مِنْ تَحْتِ رَأْسِي فَأَدْرَكْتُهُ فَأَتَيْتُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنَّ هَذَا سَرَقَ ثَوْبِي فَأَمَرَ بِهِ أَنْ يُقْطَعَ فَقُلْتُ يَا رَسُولَ اللَّهِ لَيْسَ هَذَا أَرَدْتُ هُوَ عَلَيْهِ صَدَقَةٌ قَالَ هَلَّا قَبْلَ أَنْ تَأْتِيَنِي بِهِ",
                "id": "Telah menceritakan kepada kami [Rauh] berkata, telah menceritakan kepada kami [Muhammad bin Abu Hafshah] berkata, telah menceritakan kepada kami [Az Zuhry] dari [Shafwan bin Abdullah] bahwa Shafwan bin Umayah bin Khalaf pernah dikatakan kepadanya, \"Binasalah orang-orang yang belum berhijrah.\" Shafwan berkata, \"Maka aku berkata, \"Aku tidak akan menemui keluargaku sampai aku mendatangi Rasulullah shallallahu 'alaihi wasallam.\" Kemudian aku menaiki hewan tungganganku dan pergi menemui Rasulullah shallallahu 'alaihi wasallam, kukatakan kepada beliau, \"Wahai Rasulullah, orang-orang menganggap bahwa binasalah bagi orang-orang yang belum berhijrah?\" Beliau bersabda: \"Sekali-kali tidak wahai Abu Wahb, kembalilah kamu ke lembah di Makkah.\" Shafwan berkata, \"Maka tatkala aku tiduran, seorang pencuri datang dan mencuri kain yang aku taruh di bawah kepalaku, lantas aku menangkapnya dan membawanya ke hadapan Nabi shallallahu 'alaihi wasallam. Aku katakan, \"Laki-laki ini telah mencuri pakaianku!\" Beliau lantas memerintahkan untuk memotong tangannya, maka aku pun berkata, \"Wahai Rasulullah, bukan ini yang aku maksudkan, biarlah ini sedekah buat dia.\" Beliau bersabda: \"Kenapa tidak kamu katakan itu sebelum kamu bawa dia kemari.\""
            },
            {
                "number": 4297,
                "arab": "حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ قَالَ أَخْبَرَنَا ابْنُ مُبَارَكٍ عَنْ يُونُسَ عَنِ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ صَفْوَانَ بْنِ أُمَيَّةَ قَالَأَعْطَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ حُنَيْنٍ وَإِنَّهُ لَأَبْغَضُ النَّاسِ إِلَيَّ فَمَا زَالَ يُعْطِينِي حَتَّى صَارَ وَإِنَّهُ لَأَحَبُّ النَّاسِ إِلَيَّ",
                "id": "Telah menceritakan kepada kami [Zakaria bin Adi] berkata, telah mengabarkan kepada kami [Ibnu Mubarak] dari [Yunus] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Shafwan bin Umayyah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam memberiku sesuatu pada waktu perang Hunain, padahal dia adalah orang yang paling aku benci. Dan beliau terus saja memberiku sesuatu sehingga dia menjadi sosok manusia yang paling aku cintai.\""
            },
            {
                "number": 4298,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ ثَنَا سَعِيدٌ يَعْنِي ابْنَ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ عَطَاءٍ عَنْ طَارِقِ بْنِ مُرَقَّعٍ عَنْ صَفْوَانَ بْنِ أُمَيَّةَأَنَّ رَجُلًا سَرَقَ بُرْدَهُ فَرَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِقَطْعِهِ فَقَالَ يَا رَسُولَ اللَّهِ قَدْ تَجَاوَزْتُ عَنْهُ قَالَ فَلَوْلَا كَانَ هَذَا قَبْلَ أَنْ تَأْتِيَنِي بِهِ يَا أَبَا وَهْبٍ فَقَطَعَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Sa'id] -yakni Ibnu Abu Arubah- dari [Qatadah] dari [Atha'] dari [Thariq bin Muraqqa'] dari [Shafwan bin Umayyah], bahwa seorang laki-laki telah mencuri kainnya, maka pencuri itu pun dibawa ke hadapan Nabi shallallahu 'alaihi wasallam. Beliau kemudian menyuruh untuk memotong tangannya, maka Shafwan pun berkata, \"Wahai Rasulullah, aku telah berlebihan terhadapnya.\" Beliau bersabda: \"Wahai Abu Wahb, sekiranya hal ini terjadi sebelum kamu membawanya kehadapanku.\" Maka Rasulullah shallallahu 'alaihi wasallam tetap memotong tangannya.\""
            },
            {
                "number": 4299,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ ثَنَا وُهَيْبٌ قَالَ ثَنَا ابْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ صَفْوَانَ بْنِ أُمَيَّةَأَنَّهُ قِيلَ لَهُ إِنَّهُ لَا يَدْخُلُ الْجَنَّةَ إِلَّا مَنْ هَاجَرَ قَالَ فَقُلْتُ لَا أَدْخُلُ مَنْزِلِي حَتَّى آتِيَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْأَلَهُ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ هَذَا سَرَقَ خَمِيصَةً لِي لِرَجُلٍ مَعَهُ فَأَمَرَ بِقَطْعِهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي قَدْ وَهَبْتُهَا لَهُ قَالَ فَهَلَّا قَبْلَ أَنْ تَأْتِيَنِي بِهِ قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّهُمْ يَقُولُونَ لَا يَدْخُلُ الْجَنَّةَ إِلَّا مَنْ هَاجَرَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا هِجْرَةَ بَعْدَ فَتْحِ مَكَّةَ وَلَكِنْ جِهَادٌ وَنِيَّةٌ وَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا",
                "id": "Telah menceritakan kepada kami [Affan] berkata, telah menceritakan kepada kami [Wuhaib] berkata, telah menceritakan kepada kami [Ibnu Thawus] dari [ayahnya] dari [Shafwan bin Umayyah] bahwa dikatakan kepadanya, \"Tidak akan masuk surga kecuali orang yang telah berhijrah.\" Shafwan lalu berkata, \"Maka aku pun berkata, \"Aku tidak akan masuk ke rumah sebelum aku mendatangi Rasulullah shallallahu 'alaihi wasallam dan menanyakan kepada beliau.\" Lalu aku mendatangi Rasulullah shallallahu 'alaihi wasallam dan bertanya, \"Wahai Rasulullah, sesungguhnya laki-laki ini telah mencuri selembar kainku.\" Maka beliau memerintahkan untuk memotong tangan orang yang telah mencurinya, tetapi Shafwan justru berkata, \"Wahai Rasulullah, sesungguhnya aku telah memberikan untuknya.\" Beliau bersabda: \"Kenapa itu tidak kamu lakukan sebelum kamu bawa dia kemari!\" Shufwan berkata, \"Lalu aku berkata, \"Wahai Rasulullah, orang-orang berkata, 'Tidak akan masuk surga kecuali orang-orang yang telah berhijrah'? Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada hijrah setelah penaklukan Makkah, yang ada adalah Jihad dan niat, akan tetapi jika kalian diseru untuk berperang maka berangkatlah.\""
            },
            {
                "number": 4300,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ عَنْ أَبِي عُثْمَانَ يَعْنِي النَّهْدِيَّ عَنْ عَامِرِ بْنِ مَالِكٍ عَنْ صَفْوَانَ بْنِ أُمَيَّةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الطَّاعُونُ شَهَادَةٌ وَالْغَرَقُ شَهَادَةٌ وَالْبَطْنُ شَهَادَةٌ وَالنُّفَسَاءُ شَهَادَةٌ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Sulaiman At Taimi] dari [Abu Utsman] -yakni An Nahdi- dari [Amir bin Malik] dari [Shafwan bin Umayyah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"(Orang yang meninggal karena) penyakit Tha'un adalah syahid, mati tenggelam adalah syahid, mati sakit perut adalah syahid dan mati karena melahirkan adalah syahid.\""
            },
            {
                "number": 4301,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ قَالَ ثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُعَاوِيَةَ عَنْ عُثْمَانَ بْنِ أَبِى سُلَيْمَانَ قَالَ قَالَ صَفْوَانُ بْنُ أُمَيَّةَرَآنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا آخُذُ اللَّحْمَ عَنْ الْعَظْمِ بِيَدِي فَقَالَ يَا صَفْوَانُ قُلْتُ لَبَّيْكَ قَالَ قَرِّبْ اللَّحْمَ مِنْ فِيكَ فَإِنَّهُ أَهْنَأُ وَأَمْرَأُ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Ibrahim] berkata, telah menceritakan kepada kami [Abdurrahman bin Ishaq] dari [Abdurrahman bin Mu'awiyyah] dari [Utsman bin Abu Sulaiman] berkata, \" [Shafwan bin Umayyah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melihatku saat aku sedang mengambil daging yang masih menempel pada tulangnya dengan tanganku, maka beliau bersabda: \"Wahai Shafwan.\" Aku menjawab, \"Aku penuhi panggilanmu.\" Beliau lalu bersabda: \"Dekatkanlah daging itu ke mulutmu, sesungguhnya itu lebih mudah dan lebih enak.\""
            },
            {
                "number": 4302,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ قَالَ ثَنَا سُلَيْمَانُ يَعْنِى ابْنَ قَرْمٍ عَنْ سِمَاكٍ عَنْ حُمَيْدِ ابْنِ أُخْتِ صَفْوَانَ بْنِ أُمَيَّةَ عَنْ صَفْوَانَ بْنِ أُمَيَّةَ قَالَكُنْتُ نَائِمًا فِي الْمَسْجِدِ عَلَى خَمِيصَةٍ لِي فَسُرِقَتْ فَأَخَذْنَا السَّارِقَ فَرَفَعْنَاهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِقَطْعِهِ فَقُلْتُ يَا رَسُولَ اللَّهِ أَفِي خَمِيصَتِي ثَمَنُ ثَلَاثِينَ دِرْهَمًا أَنَا أَهَبُهَا لَهُ أَوَ أَبِيعُهَا لَهُ قَالَ فَهَلَّا كَانَ قَبْلَ أَنْ تَأْتِيَنِي بِهِ",
                "id": "Telah menceritakan kepada kami [Husain bin Muhammad] berkata, telah menceritakan kepada kami [Sulaiman] -yakni Ibnu Qarm- dari [Simak] dari [Humaid bin Ukhti Shafwan bin Umayyah] dari [Shafwan bin Umayyah] dia berkata, \"Aku sedang tidur di dalam masjid dengan beralaskan kain milikku, tiba-tiba kain tersebut dicuri, maka aku menangkap pencuri tersebut dan membawanya ke hadapan Nabi shallallahu 'alaihi wasallam. Maka beliau pun memerintahkan untuk memotong tangannya, lantas aku berkata, \"Wahai Rasulullah, kainku hanya seharga tiga puluh delapan dirham, aku kasihkan untuknya atau aku jual kepadanya.\" Beliau bersabda: \"Kenapa itu tidak kamu lakukan sebelum kamu bawa dia kemari!\""
            },
            {
                "number": 4303,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو وَسُرَيْجٌ الْمَعْنَى قَالَا ثَنَا نَافِعُ بْنُ عُمَرَ يَعْنِي الْجُمَحِيَّ عَنْ أُمَيَّةَ بْنِ صَفْوَانَ عَنْ أَبِي بَكْرِ بْنِ أَبِي زُهَيْرٍ قَالَ أَبِي كِلَاهُمَا قَالَ عَنْ أَبِي بَكْرِ بْنِ أَبِي زُهَيْرٍ الثَّقَفِيِّ عَنْ أَبِيهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِالنَّبَاءَةِ أَوْ النَّبَاوَةِ شَكَّ نَافِعُ بْنُ عُمَرَ مِنْ الطَّائِفِ وَهُوَ يَقُولُ يَا أَيُّهَا النَّاسُ إِنَّكُمْ تُوشِكُونَ أَنْ تَعْرِفُوا أَهْلَ الْجَنَّةِ مِنْ أَهْلِ النَّارِ أَوْ قَالَ خِيَارُكُمْ مِنْ شِرَارِكُمْ قَالَ فَقَالَ رَجُلٌ مِنْ النَّاسِ بِمَ يَا رَسُولَ اللَّهِ قَالَ بِالثَّنَاءِ السَّيِّئِ وَالثَّنَاءِ الْحَسَنِ وَأَنْتُمْ شُهَدَاءُ اللَّهِ بَعْضُكُمْ عَلَى بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin Amru] dan [Suraij] secara makna, keduanya berkata, telah menceritakan kepada kami [Nafi' bin Amru] -yaitu Al Jumahi- dari [Umaiyah bin Shafwan] dari [Abu Bakar bin Abu Zuhair] -Abdullah berkata; ayahku berkata; keduanya berkata dari Abu Bakar bin Abu Zuhair Ats Tsaqafi- dari [Bapaknya] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda di Naba`ah atau Nabawah -Nafi' bin Umar masih ragu-, beliau bersabda: \"Wahai manusia, sesungguhnya kalian hampir saja mengetahui penghuni Surga dari penduduk neraka, \" atau dalam riwayat lain beliau bersabda: \"Orang yang paling baik di antara kalian dari yang peling jahat di antara kalian.\" Abu Zuhair berkata, \"Lalu seorang laki-laki dari mereka berkata, \"Wahai Rasulullah, bagaimana kami mengetahuinya?\" Beliau menjawab: \"Dengan pujian yang buruk dan dengan pujian yang baik, dan kalian adalah saksi-saksi Allah antara sebagian kalian dengan sebagian yang lain.\""
            },
            {
                "number": 4304,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ سَعِيدٍ قَالَ أَخْبَرَنَا مُعَاوِيَةُ بْنُ سَلَّامٍ قَالَ سَمِعْتُ يَحْيَى بْنَ أَبِي كَثِيرٍ قَالَ أَخْبَرَنِي بَعْجَةُ بْنُ عَبْدِ اللَّهِ أَنَّ أَبَاهُ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُمْ يَوْمًا هَذَا يَوْمُ عَاشُورَاءَ فَصُومُوا فَقَالَ رَجُلٌ مِنْ بَنِى عَمْرِو بْنِ عَوْفٍ يَا رَسُولَ اللَّهِ إِنِّي تَرَكْتُ قَوْمِي مِنْهُمْ صَائِمٌ وَمِنْهُمْ مُفْطِرٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اذْهَبْ إِلَيْهِمْ فَمَنْ كَانَ مِنْهُمْ مُفْطِرًا فَلْيُتِمَّ صَوْمَهُ",
                "id": "Telah menceritakan kepada kami [Hisyam Bin Sa'id] berkata, telah mengabarkan kepada kami [Mu'awiyah bin Sallam] dia berkata, aku mendengar [Yahya bin Abu Katsir] berkata, telah mengabarkan kepadaku [Ba'jah bin Abdullah] bahwa [bapaknya] telah mengabarkan kepadanya, bahwa pada suatu hari Rasulullah shallallahu 'alaihi wasallam berkata kepada mereka: \"Ini adalah hari Asyura, maka berpuasalah kalian.\" Lalu berkatalah salah seorang lelaki dari bani Amru Bin Auf, \"Wahai Rasulullah, aku tinggalkan kaumku, sedangkan di antara mereka ada yang berpuasa dan ada yang berbuka?\" maka Nabi shallallahu 'alaihi wasallam pun menjawab: \"Pergilah kepada mereka, barangsiapa di antara mereka ada yang berbuka maka suruhklah untuk menyempurnakan puasanya.\""
            },
            {
                "number": 4305,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا جَرِيرُ بْنُ حَازِمٍ قَالَ ثَنَا مُحَمَّدُ بْنُ أَبِي يَعْقُوبَ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ أَبِيهِ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِحْدَى صَلَاتَيْ الْعَشِيِّ الظُّهْرِ أَوْ الْعَصْرِ وَهُوَ حَامِلُ حَسَنٍ أَوْ حُسَيْنٍ فَتَقَدَّمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَضَعَهُ ثُمَّ كَبَّرَ لِلصَّلَاةِ فَصَلَّى فَسَجَدَ بَيْنَ ظَهْرَيْ صَلَاتِهِ سَجْدَةً أَطَالَهَا قَالَ إِنِّي رَفَعْتُ رَأْسِي فَإِذَا الصَّبِيُّ عَلَى ظَهَرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ سَاجِدٌ فَرَجَعْتُ فِي سُجُودِي فَلَمَّا قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةَ قَالَ النَّاسُ يَا رَسُولَ اللَّهِ إِنَّكَ سَجَدْتَ بَيْنَ ظَهْرَيْ الصَّلَاةِ سَجْدَةً أَطَلْتَهَا حَتَّى ظَنَنَّا أَنَّهُ قَدْ حَدَثَ أَمْرٌ أَوْ أَنَّهُ يُوحَى إِلَيْكَ قَالَ كُلُّ ذَلِكَ لَمْ يَكُنْ وَلَكِنَّ ابْنِي ارْتَحَلَنِي فَكَرِهْتُ أَنْ أُعَجِّلَهُ حَتَّى يَقْضِيَ حَاجَتَهُ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata, telah menceritakan kepada kami [Jarir bin Hazim] berkata, telah menceritakan kepada kami [Muhammad bin Abu Ya'qub] dari [Abdullah bin Syaddad] dari [ayahnya] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam keluar bersama kami pada salah satu dari dua sholat siang; zhuhur atau ashar, dan saat itu beliau membawa Hasan atau Husain. Nabi shallallahu 'alaihi wasallam lalu maju ke depan dan meletakkannya, kemudian bertakbir untuk sholat, beliau lalu sholat. Kemudian beliau sujud di antara (rakaat) sholatnya dengan sujud yang sangat lama.\" Syaddad berkata, \"Sungguh aku mengangkat kepalaku dan ternyata seorang anak kecil naik di atas punggung Rasulullah shallallahu 'alaihi wasallam ketika beliau sedang sujud, kemudian aku kembali sujud, maka setelah Rasulullah shallallahu 'alaihi wasallam selesai sholat, orang-orang berkata kepada beliau, \"Wahai Rasulullah, sesungguhnya tuan malakukan sujud sangat panjang sekali di tengah-tengah sholat, hingga kami mengira telah terjadi sesuatu atau turun wahyu kepada tuan?\" Kemudian beliau menjawab: \"Semua itu tidak terjadi melainkan anakku menaiki punggungku, dan aku tidak suka untuk mempercepat sampai dia selesai dari keinginannya.\""
            }
        ]
    }
}