{
    "status": true,
    "data": {
        "start": 1185,
        "end": 1332,
        "total": 148,
        "book": "ahmad",
        "hadits": [
            {
                "number": 1185,
                "arab": "قَالَ حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا شَيْبَانُ عَنْ أَشْعَثَ قَالَ حَدَّثَنِي شَيْخٌ مِنْ بَنِي مَالِكِ بْنِ كِنَانَةَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسُوقِ ذِي الْمَجَازِ يَتَخَلَّلُهَا يَقُولُ يَا أَيُّهَا النَّاسُ قُولُوا لَا إِلَهَ إِلَّا اللَّهُ تُفْلِحُوا قَالَ وَأَبُو جَهْلٍ يَحْثِي عَلَيْهِ التُّرَابَ وَيَقُولُ يَا أَيُّهَا النَّاسُ لَا يَغُرَّنَّكُمْ هَذَا عَنْ دِينِكُمْ فَإِنَّمَا يُرِيدُ لِتَتْرُكُوا آلِهَتَكُمْ وَتَتْرُكُوا اللَّاتَ وَالْعُزَّى قَالَ وَمَا يَلْتَفِتُ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُلْنَا انْعَتْ لَنَا رَسُولَ اللَّهِ قَالَ بَيْنَ بُرْدَيْنِ أَحْمَرَيْنِ مَرْبُوعٌ كَثِيرُ اللَّحْمِ حَسَنُ الْوَجْهِ شَدِيدُ سَوَادِ الشَّعْرِ أَبْيَضُ شَدِيدُ الْبَيَاضِ سَابِغُ الشَّعْرِ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Abu Nadlr] berkata; telah menceritakan kepada kami [Syaiban] dari [Asy'ats] berkata; telah menceritakan kepadaku [Syaikh dari Bani Malik bin Kinanah] berkata; saya telah melihat Rasulullah Shallallahu'alaihiwasallam di pasar Dzil Majaz, beliau melewati sela-selanya. Beliau bersabda: \"Wahai manusia, katakanlah LAA ILAAHA ILLALLAAH (tidak ada tuhan selain Allah) maka kalian akan beruntung.\" (Syaikh dari Bani Malik bin Kinanah radliyallahu'anhu) berkata; Abu Jahal melemparkan tanah kepada beliau dan berkata; Wahai manusia jangan sampai orang ini menyesatkan kalian dari agama kalian. Dia hanya menginginkan agar kalian meninggalkan tuhan-tuhan kalian, kalian meninggalkan Lata dan Al Uzza. (Syaikh dari Bani Malik bin Kinanah radliyallahu'anhu) berkata; dan Rasulullah Shallallahu'alaihiwasallam tidak menoleh kepadanya. (Syaikh dari Bani Malik bin Kinanah radliyallahu'anhu) berkata; kami bertanya, berikan tanda-tanda Rasulullah Shallallahu'alaihiwasallam kepada kami! Dia menjawab, beliau memakai dua mantel yang berwarna, tinggi beliau sedang dan banyak dagingnya, wajahnya bagus, rambutnya sangat hitam, kulitnya putih sangat dan rambutnya lebat."
            },
            {
                "number": 1186,
                "arab": "قَالَ حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا شَيْبَانُ عَنْ أَشْعَثَ عَنِ الْأَسْوَدِ بْنِ هِلَالٍ عَنْ رَجُلٍ مِنْ قَوْمِهِ قَالَكَانَ يَقُولُ فِي خِلَافَةِ عُمَرَ بْنِ الْخَطَّابِ لَا يَمُوتُ عُثْمَانُ حَتَّى يُسْتَخْلَفَ قُلْنَا مِنْ أَيْنَ تَعْلَمُ ذَلِكَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ رَأَيْتُ اللَّيْلَةَ فِي الْمَنَامِ كَأَنَّهُ ثَلَاثَةٌ مِنْ أَصْحَابِي وُزِنُوا فَوُزِنَ أَبُو بَكْرٍ فَوَزَنَ ثُمَّ وُزِنَ عُمَرُ فَوَزَنَ ثُمَّ وُزِنَ عُثْمَانُ فَنَقَصَ صَاحِبُنَا وَهُوَ صَالِحٌ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Abu Nadlr] berkata; telah menceritakan kepada kami [Syaiban] dari [Al Asy'ats] dari [Al Aswad bin Hilal] dari [seorang dari kaumnya] berkata; dia berkata pada masa ke khilafahan 'Umar Al Khattab, tidak akan mati 'Utsman sehingga dia diangkat menjadi seorang khilafah. Kami bertanya, 'Dari mana kamu mengetahui hal itu?. Dia menjawab, saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \" Tadi malam aku bermimpi seolah-olah tiga sahabatku ditimbang, Abu Bakar ditimbang dan timbangan begitu berat, 'Umar ditimbang dan timbangan begitu berat, kemudian 'Utsman namun sahabat kami menguranginya dan dia adalah orang yang shalih.\""
            },
            {
                "number": 1187,
                "arab": "قَالَ حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ مُهَاجِرٍ أَبِي الْحَسَنِ عَنْ شَيْخٍ أَدْرَكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَخَرَجْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَمَرَّ بِرَجُلٍ يَقْرَأُ قُلْ يَا أَيُّهَا الْكَافِرُونَ قَالَ أَمَّا هَذَا فَقَدْ بَرِئَ مِنْ الشِّرْكِ قَالَ وَإِذَا آخَرُ يَقْرَأُ قُلْ هُوَ اللَّهُ أَحَدٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَا وَجَبَتْ لَهُ الْجَنَّةُ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Abu Nadlr] berkata; telah menceritakan kepada kami [Al Mas'udi] dari [Muhajir Abu Al Hasan] dari [seorang yang sudah tua yang mendapatkan masa Nabi Shallallahu'alaihiwasallam] berkata; saya keluar bersama Nabi Shallallahu'alaihiwasallam dalam suatu perjalanan, lalu kami melewati seorang laki-laki yang sedang membaca, QUL YAA AYYUHAL KAAFIRUUN, maka beliau bersabda: \"dia telah terbebas dari syirik\", dan yang lainnya membaca QUL HUWA AllAHU AHAD, lalu Nabi Shallallahu'alaihiwasallam bersabda: \"Dengan surat itu, wajib baginya mendapatkan surga.\""
            },
            {
                "number": 1188,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي أَبِي وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ حَدَّثَنَا سُفْيَانُ عَنْ حُمْرَانَ بْنِ أَعْيَنَ عَنْ أَبِي الطُّفَيْلِ عَنْ فُلَانِ بْنِ جَارِيَةَ الْأَنْصَارِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَخَاكُمْ النَّجَاشِيَّ قَدْ مَاتَ فَصَلُّوا عَلَيْهِ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepadaku bapakku dan Abu Bakar bin Abu Syaibah telah menceritakan kepada kami [Mu'awiyah bin Hisyam] telah menceritakan kepada kami [Sufyan] dari [Humran bin A'yan] dari [Abu Ath-Thufail] dari [Fulan bin Jariyah Al Anshary] berkata; Rasulullah bersabda: \"Saudaramu An-Najasyi telah meninggal, maka sholatilah dia.\""
            },
            {
                "number": 1189,
                "arab": "قَالَ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ قَالَ حَدَّثَنَا ابْنُ جَعْفَرٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنِ ابْنَةِ كَرْدَمَةَ عَنْ أَبِيهَا أَنَّهُسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي نَذَرْتُ أَنْ أَنْحَرَ ثَلَاثَةً مِنْ إِبِلِي فَقَالَ إِنْ كَانَ عَلَى جَمْعٍ مِنْ جَمْعِ الْجَاهِلِيَّةِ أَوْ عَلَى عِيدٍ مِنْ أَعْيَادِ الْجَاهِلِيَّةِ أَوْ عَلَى وَثَنٍ فَلَا وَإِنْ كَانَ عَلَى غَيْرِ ذَلِكَ فَاقْضِ نَذْرَكَ قَالَ يَا رَسُولَ اللَّهِ إِنَّ عَلَى أُمِّ هَذِهِ الْجَارِيَةِ مَشْيًا أَفَأَمْشِي عَنْهَا قَالَ نَعَمْ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Abu Bakar Al Hanafi] berkata; telah menceritakan kepada kami [Ibnu Ja'far] dari ['Amr bin Syua'ib] dari [anak perempuan Kardamah] dari [bapaknya] sesungguhnya bapaknya bertanya kepada Rasulullah Shallallahu'alaihiwasallam berkata; Aku bernadzar untuk menyembelih tiga ekor untaku, maka beliau bersabda: \"Jika nadzar dalam suatu perkumpulan Jahiliyyah ataupun hari raya dari hari raya orang Jahiliyyah ataupun untuk berhala, janganlah kamu melaksanakan nadzarmu, tetapi apabila untuk selain hAl hal tersebut penuhilah nadzarmu\" Dia bertanya, \"Wahai Rasulullah, ibu dari anak wanita ini meniatkan untuk berjalan, apakah saya harus berjalan untuknya?\", beliau menjawab, Ya."
            },
            {
                "number": 1190,
                "arab": "حَدَّثَنَا أَبُو عَاصِمٍ عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ التَّنُوخِيِّ قَالَ حَدَّثَنَا مَوْلًى لِيَزِيدَ بْنِ نِمْرَانَ قَالَ حَدَّثَنِي يَزِيدُ بْنُ نِمْرَانَ قَالَلَقِيتُ رَجُلًا مُقْعَدًا شَوَّالًا فَسَأَلْتُهُ قَالَ مَرَرْتُ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَتَانٍ أَوْ حِمَارٍ فَقَالَ قَطَعَ عَلَيْنَا صَلَاتَنَا قَطَعَ اللَّهُ أَثَرَهُ فَأُقْعِدَ",
                "id": "Telah menceritakan kepada kami [Abu 'Ashim] dari [Sa'id bin Abdul Aziz At-Tanukhi] berkata; telah menceritakan kepada kami [budak milik Yazid bin Nimran] berkata; telah menceritakan kepadaku [Yazid bin Nimran] berkata; saya pernah bertemu [seseorang yang hanya bisa duduk di tempatnya], lalu saya bertanya kepadanya. Dia lantas menceritakan suatu peristiwa, 'Saya pernah lewat di depan Rasulullah Shallallahu'alaihiwasallam (ketika beliau sholat) dan saya saat itu menunggang keledai betina atau keledai-si perawi tidak ingat, lalu beliau bersabda: \"Dia telah memutus sholat kami semoga Allah memutus nama baiknya setelah meninggal, dan jadikanlah ia hanya bisa duduk.\""
            },
            {
                "number": 1191,
                "arab": "قَالَ حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ يَعْنِي شَيْبَانَ عَنْ لَيْثٍ عَنْ شَهْرٍ قَالَ حَدَّثَنِي الْأَنْصَارِيُّ صَاحِبُ بُدْنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا بَعَثَهُ قَالَ رَجَعْتُ فَقُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ مَا تَأْمُرُنِي بِمَا عَطِبَ مِنْهَا قَالَ انْحَرْهَا ثُمَّ اصْبُغْ نَعْلَهَا فِي دَمِهَا ثُمَّ ضَعْهَا عَلَى صَفْحَتِهَا أَوْ عَلَى جَنْبِهَا وَلَا تَأْكُلْ مِنْهَا أَنْتَ وَلَا أَحَدٌ مِنْ أَهْلِ رُفْقَتِكَ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Abu Nadlr] berkata; telah menceritakan kepada kami [Abu Mu'awiyah] yaitu Syaiban dari [Laits] dari [Syahr] berkata; telah menceritakan kepadaku [Al Anshari] penggembala unta Nabi Shallallahu'alaihiwasallam, sesungguhnya Rasulullah Shallallahu'alaihiwasallam tatkala beliau mengutusnya, beliau berkata 'Engkau telah kembali?, saya menjawab, benar Wahai Rasulullah, apa yang anda perintahkan, dengan segala hal yang bisa merusaknya?. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Sembelihlah, lalu taruhlah sandalnya pada darahnya kemudian letakkanlah pada dua pipinya atau pada sampingnya dan janganlah kamu memakannya, baik kamu atau kenalan-kenalanmu.\""
            },
            {
                "number": 1192,
                "arab": "حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ عَنْ سُلَيْمَانَ بْنِ سُحَيْمٍ عَنْ أُمِّهِ ابْنَةِ أَبِي الْحَكَمِ الْغِفَارِيِّ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الرَّجُلَ لَيَدْنُو مِنْ الْجَنَّةِ حَتَّى يَكُونَ مَا بَيْنَهُ وَبَيْنَهَا قِيدُ ذِرَاعٍ فَيَتَكَلَّمُ بِالْكَلِمَةِ فَيَتَبَاعَدُ مِنْهَا أَبْعَدَ مِنْ صَنْعَاءَ",
                "id": "Telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Muhammad bin Ishaq] dari [Sulaiman bin Suhaim] dari [Ibunya, anak perempuan Abu Al Hakam Al Ghifari] berkata; saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Sungguh ada seseorang laki-laki yang telah mendekati surga sampai jarak antara dia dengan surga tinggal seukuran satu dzira' (hasta), lalu dia mengucapkan sepatah kata yang bisa menjauhkannya dari surga melebihi jauhnya dari Shan'a."
            },
            {
                "number": 1193,
                "arab": "قَالَ حَدَّثَنَا رَوْحٌ قَالَ حَدَّثَنَا مَالِكٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَمْرِو بْنِ مُعَاذٍ الْأَشْهَلِيِّ عَنْ جَدَّتِهِ أَنَّها قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا نِسَاءَ الْمُؤْمِنَاتِ لَا تَحْقِرَنَّ إِحْدَاكُنَّ لِجَارَتِهَا وَلَوْ كُرَاعُ شَاةٍ مُحْرَقٌ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Rauh] berkata; telah menceritakan kepada kami [Malik] dari [Zaid bin Aslam] dari ['Amr bin Mu'adz Al Asyhali] dari [neneknya] sesungguhnya dia berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Wahai kaum wanita mukmin, janganlah seorang diantara kalian menyepelekan hadiah untuk tetangganya walau hanya dengan kaki kambing yang dimasak (dipanggang).\""
            },
            {
                "number": 1194,
                "arab": "حَدَّثَنَا رَوْحٌ وَعَبْدُ الرَّزَّاقِ قَالَا أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي حَسَنُ بْنُ مُسْلِمٍ عَنْ طَاوُسٍ عَنْ رَجُلٍ أَدْرَكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا الطَّوَافُ صَلَاةٌ فَإِذَا طُفْتُمْ فَأَقِلُّوا الْكَلَامَ وَلَمْ يَرْفَعْهُ ابْنُ بَكْرٍ",
                "id": "Telah menceritakan kepada kami [Rauh] dan [Abdurrazzaq] berkata; telah mengabarkan kepada kami [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Hasan bin Muslim] dari [Thawus] dari [seseorang laki-laki yang mendapati Nabi Shallallahu'alaihiwasallam] sesungguhnya Nabi Shallallahu'alaihiwasallam bersabda: \"Thawaf itu layaknya sholat, maka jika kalian berthawaf sedikitkanlah bicara\" Dalam hal ini [Ibnu Bakar] tidak memarfukkannya."
            },
            {
                "number": 1195,
                "arab": "حَدَّثَنَا يُونُسُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنِ الْأَشْعَثِ بْنِ سُلَيْمٍ عَنْ أَبِيهِ عَنْ رَجُلٍ مِنْ بَنِي يَرْبُوعٍ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمِعْتُهُ وَهُوَ يُكَلِّمُ النَّاسَ يَقُولُ يَدُ الْمُعْطِي الْعُلْيَا أُمَّكَ وَأَبَاكَ وَأُخْتَكَ وَأَخَاكَ ثُمَّ أَدْنَاكَ فَأَدْنَاكَ قَالَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هَؤُلَاءِ بَنُو ثَعْلَبَةَ الَّذِينَ أَصَابُوا فُلَانًا قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا لَا تَجْنِي نَفْسٌ عَلَى أُخْرَى",
                "id": "Telah menceritakan kepada kami [Yunus] berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Al Asy'ats bin Sulaim] dari [Bapaknya] dari [seorang laki-laki dari Bani Yarbu'] berkata; saya mendatangi Nabi Shallallahu'alaihiwasallam, lalu saya mendengarnya, beliau berbicara kepada orang-orang, beliau bersabda: \"Tangan orang yang memberi itu yang berada diatas, Dahulukan pemberian kepada ibumu, bapakmu dan saudara laki-lakimu, lalu yang terdekat, lalu yang terdekat\". (seorang laki-laki dari Bani Yarbu' Radliyallahu'anhu) berkata; lalu ada seorang laki-laki yang berkata; Wahai Rasulullah, Juga untuk Bani Tsa'labah yang telah bertindak kejahatan kepada si fulan?. Lalu Rasulullah Shallallahu'alaihiwasallam bersabda: \"Ketahuilah, bahwasanya seseorang terlarang bertindak aniaya kepada lainnya\"."
            },
            {
                "number": 1196,
                "arab": "قَالَ حَدَّثَنَا حَسَنُ بْنُ مُوسَى قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنِ الْأَزْرَقِ بْنِ قَيْسٍ عَنْ يَحْيَى بْنِ يَعْمَرَ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَّلُ مَا يُحَاسَبُ بِهِ الْعَبْدُ صَلَاتُهُ فَإِنْ كَانَ أَتَمَّهَا كُتِبَتْ لَهُ تَامَّةً وَإِنْ لَمْ يَكُنْ أَتَمَّهَا قَالَ اللَّهُ عَزَّ وَجَلَّ انْظُرُوا هَلْ تَجِدُونَ لِعَبْدِي مِنْ تَطَوُّعٍ فَتُكْمِلُوا بِهَا فَرِيضَتَهُ ثُمَّ الزَّكَاةُ كَذَلِكَ ثُمَّ تُؤْخَذُ الْأَعْمَالُ عَلَى حَسَبِ ذَلِكَ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Hasan bin Musa] berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Al Arzaq bin Qais] dari [Yahya bin Ya'mar] dari [salah seorang sahabat Nabi Shallallahu'alaihiwasallam] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Yang pertama kali dihisab dari seorang hamba adalah sholatnya, jika dia menyempurnakannya maka akan ditulis secara sempurna. Jika dia tidak menyempurnakannya, maka Allah Azza wa jalla berfirman: 'Lihatlah kalian, apakah kalian mendapatkan pada hamba-Ku amalan sunah sehingga menjadi sempurna kewajibannya?, lalu zakatnya demikian juga, semua amal akan diperiksa seperti itu.\""
            },
            {
                "number": 1197,
                "arab": "قَالَ حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَاقَ عَنِ الْمُهَلَّبِ بْنِ أَبِي صُفْرَةَ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا أُرَاهُمْ اللَّيْلَةَ إِلَّا سَيُبَيِّتُونَكُمْ فَإِنْ فَعَلُوا فَشِعَارُكُمْ حم لَا يُنْصَرُونَ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Aswad bin 'Amir] berkata; telah menceritakan kepada kami [Syarik] dari [Abu Ishaq] dari [Al Muhallab bin Abu Shufrah] dari [salah seorang sahabat Nabi Shallallahu'alaihiwasallam] dari Nabi Shallallahu'alaihiwasallam bersabda: \"Saya taksir mereka pasti akan menyerang kalian pada malam ini, jika mereka melakukannya maka sandi kalian adalah HAMIM, LA YUNSHARUN.\""
            },
            {
                "number": 1198,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا الْحَكَمُ بْنُ فُضَيْلٍ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي تَمِيمَةَ عَنْ رَجُلٍ مِنْ قَوْمِهِأَنَّهُ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ قَالَ شَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَتَاهُ رَجُلٌ فَقَالَ أَنْتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ قَالَ أَنْتَ مُحَمَّدٌ فَقَالَ نَعَمْ قَالَ فَإِلَامَ تَدْعُو قَالَ أَدْعُو إِلَى اللَّهِ عَزَّ وَجَلَّ وَحْدَهُ مَنْ إِذَا كَانَ بِكَ ضُرٌّ فَدَعَوْتَهُ كَشَفَهُ عَنْكَ وَمَنْ إِذَا أَصَابَكَ عَامُ سَنَةٍ فَدَعَوْتَهُ أَنْبَتَ لَكَ وَمَنْ إِذَا كُنْتَ فِي أَرْضٍ قَفْرٍ فَأَضْلَلْتَ فَدَعَوْتَهُ رَدَّ عَلَيْكَ قَالَ فَأَسْلَمَ الرَّجُلُ ثُمَّ قَالَ أَوْصِنِي يَا رَسُولَ اللَّهِ قَالَ لَهُ لَا تَسُبَّنَّ شَيْئًا أَوْ قَالَ أَحَدًا شَكَّ الْحَكَمُ قَالَ فَمَا سَبَبْتُ بَعِيرًا وَلَا شَاةً مُنْذُ أَوْصَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا تَزْهَدْ فِي الْمَعْرُوفِ وَلَوْ مُنْبَسِطٌ وَجْهُكَ إِلَى أَخِيكَ وَأَنْتَ تُكَلِّمُهُ وَأَفْرِغْ مِنْ دَلْوِكَ فِي إِنَاءِ الْمُسْتَسْقِي وَاتَّزِرْ إِلَى نِصْفِ السَّاقِ فَإِنْ أَبَيْتَ فَإِلَى الْكَعْبَيْنِ وَإِيَّاكَ وَإِسْبَالَ الْإِزَارِ فَإِنَّهَا مِنْ الْمَخِيلَةِ وَاللَّهُ تَبَارَكَ وَتَعَالَى لَا يُحِبُّ الْمَخِيلَةَ",
                "id": "Telah menceritakan kepada kami [Abu Nadlr] berkata; telah menceritakan kepada kami [Al Hakam bin Fudlail] dari [Khalid Al Hadza`] dari [Abu Tamimah] dari [seorang laki-laki dari kaumnya] sesungguhnya dia mendatangi Rasulullah Shallallahu'alaihiwasallam atau berkata; saya melihat Rasulullah Shallallahu'alaihiwasallam didatangi oleh seorang laki-laki lalu bertanya, apakah kamu adalah Rasulullah Shallallahu'alaihiwasallam atau berkata; kamu adalah Muhammad?. Lalu beliau menjawab, Ya. Dia berkata; kepada apa kamu berseru? Beliau menjawab, saya menyeru kepada Allah Azza wa jalla Yang Maha Esa, jika kamu tertimpa bahaya lalu kamu meminta kepada-Nya maka Dia akan menghilangkannya. Dan jika ada tahun masa paceklik yang datang pada kalian lalu kamu meminta kepada-Nya maka Dia akan menumbuhkannya. Jika kamu berada pada tanah yang tandus, lalu kamu hilang, lalu meminta kepada-Nya maka Dia akan mengembalikanmu. (seorang laki-laki dari kaumnya radliyallahu'anhu) berkata; lalu orang itu masuk Islam, lalu berkata; 'Berilah wasiat kepadaku Wahai Rasulullah.' Beliau bersabda kepadanya, \"Janganlah kamu mencela sesuatu pun\". Atau berkata; \"Seorang pun.\" Al Hakam ragu. (seorang laki-laki radliyallahu'anhu) berkata; karenanya saya tidak pernah mencela unta maupun kambing sekalipun semenjak Rasulullah Shallallahu'alaihiwasallam memberi wasiat kepadaku. (Rasulullah juga berwasiat) Janganlah kamu menganggap remeh suatu kebaikan walaupun kamu hanya tersenyum kepada saudaramu ketika kamu sedang berbicara dengannya. Kosongkan embermu untuk kau isikan kepada bejana orang yang meminta air dan pakailah pakaian setengah betis. Jika kamu merasa berat maka sampai mata kaki. Hindarilah isbal (menurunkan pakaian sampai menutupi mata kaki) dalam pakaian sesungguhnya itu merupakan bagian dari kesombongan. Sedang Allah Tabaroka Wa Ta'ala tidak menyukai orang yang sombong.\""
            },
            {
                "number": 1199,
                "arab": "قَالَ حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ مُهَاجِرٍ الصَّائِغِ عَنْ رَجُلٍ لَمْ يُسَمِّهِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهُ سَمِعَ رَجُلًا يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ قُلْ يَا أَيُّهَا الْكَافِرُونَ قَالَ أَمَّا هَذَا فَقَدْ بَرِئَ مِنْ الشِّرْكِ وَسَمِعَ آخَرَ يَقْرَأُ قُلْ هُوَ اللَّهُ أَحَدٌ فَقَالَ أَمَّا هَذَا فَقَدْ غُفِرَ لَهُ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Al Aswad bin 'Amir] berkata; telah menceritakan kepada kami [Syarik] dari [Muhajir Ash-shaigh] dari [seorang yang tidak ada namanya dari kalangan sahabat] Nabi Shallallahu'alaihiwasallam sesungguhnya dia mendengar seorang laki-laki yaitu Nabi Shallallahu'alaihiwasallam membaca 'QUL YAA AYYUHAL KAAFIRUUN', beliau bersabda: \"Orang ini telah terbebas dari syirik\", dan telah mendengar yang lainnya membaca, 'QUL HUWAAllAHU AHAD', lalu (Nabi Shallallahu'alaihiwasallam) bersabda: \"Sedangkan orang ini, sungguh dia telah diampuni.\""
            },
            {
                "number": 1200,
                "arab": "قَالَ حَدَّثَنَا حَسَنُ بْنُ مُوسَى قَالَ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي الزُّبَيْرِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَكَوَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَعْدًا أَوْ أَسْعَدَ بْنَ زُرَارَةَ فِي حَلْقِهِ مِنْ الذُّبْحَةِ وَقَالَ لَا أَدَعُ فِي نَفْسِي حَرَجًا مِنْ سَعْدٍ أَوْ أَسْعَدَ بْنِ زُرَارَةَ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; tatkala [Hasan bin Musa] berkata; telah menceritakan kepada kami [Zuhair] dari [Abu Az Zubair] dari ['Amr bin Syu'aib] dari [Bapaknya] dari [sebagian sahabat Nabi Shallallahu'alaihiwasallam] berkata; Rasulullah Shallallahu'alaihiwasallam pernah mengobati seseorang dengan cara kay (metode pengobatan dengan cara mengunakan besi yang dipanaskan dan disundutkan ke organ yang sakit) kepada Saad atau As'ad bin Zurarah pada tenggorokannya karena luka dan bersabda: \"Saya anggap tidak masalah dari Saad atau As'ad bin Zurarah.\""
            },
            {
                "number": 1201,
                "arab": "قَالَ حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ قَالَ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ عَنْ الْفَضْلِ بْنِ عَمْرِو بْنِ أُمَيَّةَ عَنْ أَبِيهِ قَالَ سَمِعْتُ رِجَالًا يَتَحَدَّثُونَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِذَا أُعْتِقَتْ الْأَمَةُ فَهِيَ بِالْخِيَارِ مَا لَمْ يَطَأْهَا إِنْ شَاءَتْ فَارَقَتْهُ وَإِنْ وَطِئَهَا فَلَا خِيَارَ لَهَا وَلَا تَسْتَطِيعُ فِرَاقَهُ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Yahya bin Ishaq] berkata; telah menceritakan kepada kami [Ibnu Lahi'ah] dari ['ubaidhullah bin Abu Ja'far] dari [Al Fadl bin 'Amr bin Umayyah] dari [Bapaknya] berkata; saya telah mendengar [beberapa orang yang mereka saling menceritakan] dari Nabi Shallallahu'alaihiwasallam, beliau bersabda: \"Jika budak wanita dimerdekakan maka dia berhak melakukan pilihan (ikut majikan atau meninggalkannya) selama dia belum digauli, jika dia mau maka dia bisa meninggalkan majikannya. Sebaliknya jika telah digauli maka dia tidak boleh memilih dan dia tidak bisa meninggalkan tuannya\"."
            },
            {
                "number": 1202,
                "arab": "قَالَ حَدَّثَنَا حَسَنٌ قَالَ حَدَّثَنَا ابْنُ لَهِيعَةَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي جَعْفَرٍ عَنِ الْفَضْلِ بْنِ الْحَسَنِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ قَالَ سَمِعْتُ رِجَالًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَحَدَّثُونَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أُعْتِقَتْ الْأَمَةُ وَهِيَ تَحْتَ الْعَبْدِ فَأَمْرُهَا بِيَدِهَا فَإِنْ هِيَ أَقَرَّتْ حَتَّى يَطَأَهَا فَهِيَ امْرَأَتُهُ لَا تَسْتَطِيعُ فِرَاقَهُ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Hasan] berkata; telah menceritakan kepada kami [Ibnu Lahi'ah] berkata; telah menceritakan kepada kami ['ubaidhullah bin Abu Ja'far] dari [Al Fadl bin Al Hasan bin 'Amr bin Umayyah Adl-Dlamri] berkata; saya telah mendengar [beberapa orang sahabat Rasulullah Shallallahu'alaihiwasallam] yang menceritakan sesungguhnya Rasulullah Shallallahu'alaihiwasallam bersabda: \"Jika seorang budak wanita dimerdekakan dan dia di bawah seorang budak laki-laki, maka urusannya berada di tangannya sehingga dia yang memutuskannya. Namun jika dia telah digauli, maka dia adalah istrinya dan dia tidak bisa meninggalkan (budak laki-laki tersebut) \"."
            },
            {
                "number": 1203,
                "arab": "حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ عَنْ يَزِيدَ بْنِ يَزِيدَ يَعْنِي ابْنَ جَابِرٍ عَنْ خَالِدِ بْنِ اللَّجْلَاجِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَائِشٍ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ عَلَيْهِمْ ذَاتَ غَدَاةٍ وَهُوَ طَيِّبُ النَّفْسِ مُسْفِرُ الْوَجْهِ أَوْ مُشْرِقُ الْوَجْهِ قُلْنَا يَا رَسُولَ اللَّهِ إِنَّا نَرَاكَ طَيِّبَ النَّفْسِ مُسْفِرَ الْوَجْهِ أَوْ مُشْرِقَ الْوَجْهِ فَقَالَ وَمَا يَمْنَعُنِي وَأَتَانِي رَبِّي عَزَّ وَجَلَّ اللَّيْلَةَ فِي أَحْسَنِ صُورَةٍ قَالَ يَا مُحَمَّدُ قُلْتُ لَبَّيْكَ رَبِّي وَسَعْدَيْكَ قَالَ فِيمَ يَخْتَصِمُ الْمَلَأُ الْأَعْلَى قُلْتُ لَا أَدْرِي أَيْ رَبِّ قَالَ ذَلِكَ مَرَّتَيْنِ أَوْ ثَلَاثًا قَالَ فَوَضَعَ كَفَّيْهِ بَيْنَ كَتِفَيَّ فَوَجَدْتُ بَرْدَهَا بَيْنَ ثَدْيَيَّ حَتَّى تَجَلَّى لِي مَا فِي السَّمَوَاتِ وَمَا فِي الْأَرْضِ ثُمَّ تَلَا هَذِهِ الْآيَةَ{ وَكَذَلِكَ نُرِي إِبْرَاهِيمَ مَلَكُوتَ السَّمَوَاتِ وَالْأَرْضِ وَلِيَكُونَ مِنْ الْمُوقِنِينَ }ثُمَّ قَالَ يَا مُحَمَّدُ فِيمَ يَخْتَصِمُ الْمَلَأُ الْأَعْلَى قَالَ قُلْتُ فِي الْكَفَّارَاتِ قَالَ وَمَا الْكَفَّارَاتُ قُلْتُ الْمَشْيُ عَلَى الْأَقْدَامِ إِلَى الْجَمَاعَاتِ وَالْجُلُوسُ فِي الْمَسْجِدِ خِلَافَ الصَّلَوَاتِ وَإِبْلَاغُ الْوُضُوءِ فِي الْمَكَارِهِ قَالَ مَنْ فَعَلَ ذَلِكَ عَاشَ بِخَيْرٍ وَمَاتَ بِخَيْرٍ وَكَانَ مِنْ خَطِيئَتِهِ كَيَوْمِ وَلَدَتْهُ أُمُّهُ وَمِنْ الدَّرَجَاتِ طِيبُ الْكَلَامِ وَبَذْلُ السَّلَامِ وَإِطْعَامُ الطَّعَامِ وَالصَّلَاةُ بِاللَّيْلِ وَالنَّاسُ نِيَامٌ قَالَ يَا مُحَمَّدُ إِذَا صَلَّيْتَ فَقُلْ اللَّهُمَّ إِنِّي أَسْأَلُكَ الطَّيِّبَاتِ وَتَرْكَ الْمُنْكَرَاتِ وَحُبَّ الْمَسَاكِينِ وَأَنْ تَتُوبَ عَلَيَّ وَإِذَا أَرَدْتَ فِتْنَةً فِي النَّاسِ فَتَوَفَّنِي غَيْرَ مَفْتُونٍ",
                "id": "Telah menceritakan kepada kami [Abu 'Amir] telah menceritakan kepada kami [Zuhair bin Muhammad] dari [Yazid bin Yazid] yaitu Ibnu Jabir dari [Khalid bin Al Lajlaj] dari [Abdurrahman bin 'A`isy] dari [beberapa sahabat Nabi Shallallahu'alaihiwasallam] sesungguhnya Rasulullah Shallallahu'alaihiwasallam keluar menemui mereka pada suatu pagi dalam keadaan yang sangat baik dan berseri-seri wajahnya, terang wajahnya, lalu bersabda: \"Tidak ada yang menghalangiku, padahal telah datang Rabku Azzawajalla tadi malam dengan wajah sangat mempesona.\" Dia (Allah Azza wa jalla) berkata; 'Wahai Muhammad', saya menjawab, 'Ya Wahai Rabku.' Dia bertanya, dalam masalah apa para Malaikat yang tinggi saling berselisih, saya menjawab, saya tidak tahu Wahai Rabku. Dia berkata seperti itu dua kali atau tiga kali. Lalu Dia (Rab Muhammad) meletakkan kedua telapak tangannya antara kedua pundakku, lalu saya merasakan dinginnya di antara kedua dadaku sehingga Dia menampakkan kepadaku apa yang ada di langit dan apa yang ada di bumi, lalu beliau membaca ayat ini, 'Dan Demikianlah kami perlihatkan kepada Ibrahim tanda-tanda keagungan (Kami yang terdapat) di langit dan bumi dan (Kami memperlihatkannya) agar dia termasuk orang yang yakin. lalu Dia berfirman, Wahai Muhammad, dalam masalah apa para Malaikat yang tinggi saling berselisih?, saya menjawab, dalam masalah kaffarat (penghapusan dosa-dosa). Apakah kafarat itu? Saya menjawab, berjalan kaki menuju jamaah sholat dan duduk di masjid untuk menanti sholat-sholat ditegakkan dan meratakan berwudlu saat-saat tidak suka. Beliau bersabda: \"Barangsiapa yang melakukan hal itu maka dia akan hidup dengan baik dan meninggal dalam keadaan baik dan keadaannya dengan kesalahannya sebagaimana hari dia dilahirkan oleh ibunya, dan yang termasuk mengangkat derajat adalah perkataan yang baik, menyebarkan salam, memberi makanan, sholat malam saat manusia dalam keadaan tidur.\" Dia berfirman, \"Wahai Muhammad, jika kamu sholat maka bacalah: Ya Allah, sesungguhnya saya meminta kepada-Mu kebaikan-kebaikan, meninggalkan kemungkaran, mencintai orang miskin dan kamu dalam keadaan bertaubat kepada-Ku, dan jika Engkau menghendaki fitnah pada manusia, tolong wafatkanlahku dalam keadaan tidak terkena fitnah."
            },
            {
                "number": 1204,
                "arab": "قَالَ حَدَّثَنَا الزُّبَيْرِيُّ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا إِسْرَائِيلُ عَنْ سِمَاكٍ قَالَ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ عَامِرٍ قَالَ حَدَّثَنِي مَنْ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَوَأَمَرَ بِرَجْمِ رَجُلٍ بَيْنَ مَكَّةَ وَالْمَدِينَةِ فَلَمَّا وَجَدَ مَسَّ الْحِجَارَةِ خَرَجَ فَهَرَبَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَلَّا تَرَكْتُمُوهُ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Az Zubairi Muhammad bin Abdullah] berkata; telah menceritakan kepada kami ['Israil] dari [Simak] berkata; telah menceritakan kepadaku [Abdul Aziz bin Abdullah bin 'Amir] berkata; telah menceritakan kepadaku [seseorang yang telah mendengar Nabi Shallallahu'alaihiwasallam], beliau memerintahkan seorang laki-laki untuk dirajam di lokasi antara Makkah dan Madinah. Tatkala dia merasakan sentuhan batu dia pergi dan kabur, lalu Nabi Shallallahu'alaihiwasallam bersabda: \"Kenapa kalian tidak membiarkannya?.\""
            },
            {
                "number": 1205,
                "arab": "قَالَ حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ رَجُلٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ مَتَى جُعِلْتَ نَبِيًّا قَالَ وَآدَمُ بَيْنَ الرُّوحِ وَالْجَسَدِ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Suraij bin An-Nu'man] berkata; telah menceritakan kepada kami [Hammad] dari [Khalad Al Hadza'] dari [Abdullah bin Syaqiq] dari [seorang laki-laki] berkata; saya berkata; \"Wahai Rasulullah, kapankah anda dijadikan Nabi?\" Beliau menjawab, \"Tatkala Adam masih berupa ruh dan jasadnya.\""
            },
            {
                "number": 1206,
                "arab": "قَالَ حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا الْمُبَارَكُ قَالَ حَدَّثَنَا الْحَسَنُ أَنَّ شَيْخًا مِنْ بَنِي سَلِيطٍ أَخْبَرَهُ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُكَلِّمُهُ فِي سَبْيٍ أُصِيبَ لَنَا فِي الْجَاهِلِيَّةِ فَإِذَا هُوَ قَاعِدٌ وَعَلَيْهِ حَلْقَةٌ قَدْ أَطَافَتْ بِهِ وَهُوَ يُحَدِّثُ الْقَوْمَ عَلَيْهِ إِزَارُ قِطْرٍ لَهُ غَلِيظٌ قَالَ سَمِعْتُهُ يَقُولُ وَهُوَ يُشِيرُ بِإِصْبَعِهِ الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَظْلِمُهُ وَلَا يَخْذُلُهُ التَّقْوَى هَاهُنَا التَّقْوَى هَاهُنَا يَقُولُ أَيْ فِي الْقَلْبِ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Abu Nadlr] berkata; telah menceritakan kepada kami [Al Mubarak] berkata; telah menceritakan kepada kami [Al Hasan] sesungguhnya [seorang yang sudah tua dari Bani Salith] mengabarinya berkata; saya menemui Nabi Shallallahu'alaihiwasallam, saya mengajak bicara beliau tentang tawanan perang dari kalangan anak-anak dan wanita yang kami dapatkan pada masa jahiliyah. Beliau saat itu sedang duduk dengan membawa lingkaran yang telah dilingkarkan dan beliau mengajak bicara orang-orang -Dan ketika itu beliau memakai sarung dari kain berjahit yang warna merahnya yang sangat tebal-(Orang tua bani Salith) itu berkata; saya mendengar (Rasulullah Shallallahu'alaihiwasallam) bersabda dan beliau memberi isyarat dengan jarinya, \"Seorang muslim itu saudara muslim lainnya, tidak boleh menganiayanya dan tidak boleh merendahkannya. taqwa itu letaknya di sini, taqwa itu letaknya di sini.\" beliau mengatakannya yang maksudnya di hati."
            },
            {
                "number": 1207,
                "arab": "قَالَ حَدَّثَنَا عُمَرُ بْنُ سَعْدٍ أَبُو دَاوُدَ الْحَفَرِيُّ قَالَ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ قَالَ حَدَّثَنِي سَعْدُ بْنُ طَارِقٍ عَنْ بِلَالِ بْنِ يَحْيَى عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ أَخْبَرَنِي أَعْرَابِيٌّ أَنَّهُسَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا أَخَافُ عَلَى قُرَيْشٍ إِلَّا أَنْفُسَهَا قُلْتُ مَا لَهُمْ قَالَ أَشِحَّةٌ بَجَرَةٌ وَإِنْ طَالَ بِكَ عُمْرٌ لَتَنْظُرَنَّ إِلَيْهِمْ يَفْتِنُونَ النَّاسَ حَتَّى تَرَى النَّاسَ بَيْنَهُمْ كَالْغَنَمِ بَيْنَ الْحَوْضَيْنِ إِلَى هَذَا مَرَّةً وَإِلَى هَذَا مَرَّةً",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami ['Umar bin Sa'ad Abu Daud Al Hafari] berkata; telah menceritakan kepada kami [Yahya bin Zakariya bin Abu Za`idah] berkata; telah menceritakan kepadaku [Sa'ad bin Thariq] dari [Bilal bin Yahya] dari ['Imran bin Husain] berkata; telah mengabarkan kepadaku [seorang Badui], sesungguhnya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidak ada yang ditakutkan pada orang Quraisy kecuali diri mereka\". Saya bertanya, \"Apa yang terjadi pada mereka?\". Beliau menjawab, \"Mereka adalah orang yang sangat pelit, rakus dan sangat besar perutnya. Jika umurmu panjang, sungguh kamu akan dapat melihat mereka, mereka membuat fitnah pada manusia sehingga kamu melihat manusia antara mereka sebagaimana kambing yang berada di antara dua telaga. Terkadang ke sini sekali dan terkadang ke sana sekali.\" "
            },
            {
                "number": 1208,
                "arab": "حَدَّثَنَا الزُّبَيْرِيُّ قَالَ حَدَّثَنَا إِسْرَائِيلُ عَنْ سِمَاكٍ عَنْ مَعْبَدِ بْنِ قَيْسٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَيْرٍ أَوْ عَمِيرَةَ قَالَ حَدَّثَنِي زَوْجُ ابْنَةِ أَبِي لَهَبٍ قَالَدَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تَزَوَّجْتُ ابْنَةَ أَبِي لَهَبٍ فَقَالَ هَلْ مِنْ لَهْوٍ",
                "id": "Telah menceritakan kepada kami [Az Zubairi] berkata; telah menceritakan kepada kami [Isra`il] dari [Simak] dari [Ma'bad bin Qais] dari [Abdullah bin 'Umair] atau 'Amirah berkata; telah menceritakan kepadaku [suami anak perempuan, Abu Lahab] berkata; Rasulullah Shallallahu'alaihiwasallam menemui kami ketika saya menikah dengan anak perempuan Abu lahab, lalu beliau bertanya, \"Bukankah hal ini hanyalah sia-sia belaka?.\""
            },
            {
                "number": 1209,
                "arab": "قَالَ حَدَّثَنَا أَبُو عَامِرٍ قَالَ حَدَّثَنَا عَلِيٌّ عَنْ يَحْيَى يَعْنِي ابْنَ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي حَيَّةُ التَّمِيمِيُّ أَنَّ أَبَاهُ أَخْبَرَهُ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا شَيْءَ فِي الْهَامِ وَالْعَيْنُ حَقٌّ وَأَصْدَقُ الطِّيَرِ الْفَأْلُ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Abu 'Amir] berkata; telah menceritakan kepada kami ['Ali] dari [Yahya] yaitu Ibnu Abu Katsir berkata; telah menceritakan kepadaku [Hayyah At-Tamimi] sesungguhnya [Bapaknya] mengabarinya, ia mendengar Nabi Shallallahu'alaihiwasallam bersabda: \"Anggapan ada Ham (keyakinan orang jahiliyah bahwa tulang mayat dapat berubah menjadi burung) adalah tidak ada kebenarannya sama sekali, dan 'ain (kedengkian yang timbul dari orang yang jahat) itu adalah benar dan tiyarah yang paling benar adalah Al fa'l (perkataan yang baik).\" "
            },
            {
                "number": 1210,
                "arab": "قَالَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا أَبَانُ وَعَبْدُ الصَّمَدِ قَالَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي جَعْفَرٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَبَيْنَمَا رَجُلٌ يُصَلِّي وَهُوَ مُسْبِلٌ إِزَارَهُ إِذْ قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اذْهَبْ فَتَوَضَّأْ قَالَ فَذَهَبَ فَتَوَضَّأَ ثُمَّ جَاءَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اذْهَبْ فَتَوَضَّأْ قَالَ فَذَهَبَ فَتَوَضَّأَ ثُمَّ جَاءَ فَقَالَ مَا لَكَ يَا رَسُولَ اللَّهِ مَا لَكَ أَمَرْتَهُ يَتَوَضَّأُ ثُمَّ سَكَتَّ قَالَ إِنَّهُ كَانَ يُصَلِّي وَهُوَ مُسْبِلٌ إِزَارَهُ وَإِنَّ اللَّهَ عَزَّ وَجَلَّ لَا يَقْبَلُ صَلَاةَ عَبْدٍ مُسْبِلٍ إِزَارَهُ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Yunus bin Muhammad] berkata; telah menceritakan kepada kami [Aban] dan [Abdushshomad] berkata; telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Abu Ja'far] dari ['Atha` bin Yasar] dari [beberapa sahabat Nabi Shallallahu'alaihiwasallam] berkata; tatkala ada seorang yang sholat dalam keadaan isbal (memanjangkan kainnya sampai bawah mata kaki) pada sarungnya, Rasulullah Shallallahu'alaihiwasallam bersabda kepadanya, \"Pergilah dan berwudlulah\". (beberapa sahabat radliyallahu'anhum) berkata; lalu orang itu pergi dan wudlu, lalu datang lagi. Lalu Rasulullah Shallallahu'alaihiwasallam bersabda kepadanya, \"Pergilah dan berwudlulah.\" (beberapa sahabat radliyallahu'anhum) berkata; lalu dia pergi dan berwudlku, kemudian datang. lalu (beberapa sahabat radliyallahu'anhum) bertanya, kenapa anda Wahai Rasulullah, kenapa anda memerintahkannya untuk berwudlu kemudian anda diam?. Beliau menjawab, \"Dia sholat sedangkan dia dalam keadaan musbil sarungnya, sesungguhnya Allah Azza wa jalla tidak menerima sholat seorang hamba yang sarungnya isbal.\" "
            },
            {
                "number": 1211,
                "arab": "قَالَ حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ قَالَ حَدَّثَنَا عُبَيْدَةُ بْنُ حُمَيْدٍ الضَّبِّيُّ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ ذِي الْغُرَّةِ قَالَعَرَضَ أَعْرَابِيٌّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسِيرُ فَقَالَ يَا رَسُولَ اللَّهِ تُدْرِكُنَا الصَّلَاةُ وَنَحْنُ فِي أَعْطَانِ الْإِبِلِ أَفَنُصَلِّي فِيهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا قَالَ أَفَنَتَوَضَّأُ مِنْ لُحُومِهَا قَالَ نَعَمْ قَالَ أَفَنُصَلِّي فِي مَرَابِضِ الْغَنَمِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَمْ قَالَ أَفَنَتَوَضَّأُ مِنْ لُحُومِهَا قَالَ لَا",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami Abdullah telah menceritakan kepada kami ['Amr bin Muhammad An-Naqid] berkata; telah menceritakan kepada kami ['Ubaidah bin Humaid Adl-Dlab'i] dari [Abdullah bin Abdullah] dari [Abdurrahman bin Abu Ya'la] dari [Dzil Ghurrah] berkata; seorang Badui datang kepada Rasulullah Shallallahu'alaihiwasallam yang ketika itu Rasulullah Shallallahu'alaihiwasallam sedang berjalan, lalu dia berkata; Wahai Rasulullah, terkadang waktu sholat datang saat kami di kandang unta, apakah kami boleh sholat di dalamnya? Lalu Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidak.\" (orang Badui) berkata; apakah kami harus berwudlu karena dagingnya?. Beliau menjawab, ya. (orang Badui) berkata; bolehkah kami sholat di kandang kambing?, lalu Rasulullah Shallallahu'alaihiwasallam bersabda: \"Ya.\" (orang Badui) berkata; apakah kami harus berwudlu dari dagingnya?, maka beliau menjawab, tidak."
            },
            {
                "number": 1212,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ قَالَ حَدَّثَنَا أَبُو عُبَيْدَةَ يَعْنِي الْحَدَّادَ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ عَنْ يَزِيدَ بْنِ أَبِي مَنْصُورٍ عَنْ ذِي اللِّحْيَةِ الْكِلَابِيِّ أَنَّهُ قَالَيَا رَسُولَ اللَّهِ أَنَعْمَلُ فِي أَمْرٍ مُسْتَأْنَفٍ أَوْ أَمْرٍ قَدْ فُرِغَ مِنْهُ قَالَ لَا بَلْ فِي أَمْرٍ قَدْ فُرِغَ مِنْهُ قَالَ فَفِيمَ نَعْمَلُ إِذًا قَالَ اعْمَلُوا فَكُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Yahya bin Ma'in] berkata; telah menceritakan kepada kami [Abu 'Ubaidah] yaitu Al Haddad, berkata; telah menceritakan kepada kami [Abdul Aziz bin Muslim] dari [Yazid bin Abu Manshur] dari [Dzil Lihyah Al Kilabi] sesungguhnya dia berkata; Wahai Rasulullah, adakah kita beramal untuk urusan yang baru akan ditetapkan ataukah memang telah ditetapkan?. Beliau bersabda: \"Tidak, tapi untuk urusan yang telah ditetapkan\" lalu (Dzil Lihyah Al Kilabi radliyallahu'anhum) berkata; \"Kalau begitu untuk apa kita beramal?\" Beliau bersabda: \"Semuanya akan dimudahkan sesuai dengan apa yang dicipta baginya.\""
            },
            {
                "number": 1213,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا أَبُو عَبْدِ اللَّهِ الْبَصْرِيُّ حَدَّثَنَا سَهْلُ بْنُ أَسْلَمَ الْعَدَوِيُّ قَالَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي مَنْصُورٍ عَنْ ذِي اللِّحْيَةِ الْكِلَابِيِّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَنَعْمَلُ فِي أَمْرٍ مُسْتَأْنَفٍ أَوْ فِي أَمْرٍ قَدْ فُرِغَ مِنْهُ قَالَ بَلْ فِي أَمْرٍ قَدْ فُرِغَ مِنْهُ قَالَ فَفِيمَ الْعَمَلُ فَقَالَ اعْمَلُوا فَكُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Abu Abdullah Al Bashri] telah menceritakan kepada kami [Sahal bin Aslam Al 'Adawi] berkata; telah menceritakan kepada kami [Yazid bin Abu Manshur] dari [Dzil Lihyah Al Kilabi] berkata; saya berkata; Wahai Rasulullah, apakah kami beramal pada urusan yang tengah akan ditetapkan ataukah amalan yang telah ditetapkan?. Beliau bersabda: \"Pada urusan yang telah ditentukan\" lalu (Dzil Lihyah Al Kilabi radliyallahu'anhum) berkata; \"Kalau begitu untuk apa kita beramal?\" Beliau bersabda: \"Beramallah, semuanya akan dimudahkan sesuai dengan apa yang dicipta baginya.\""
            },
            {
                "number": 1214,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا أَبُو صَالِحٍ الْحَكَمُ بْنُ مُوسَى قَالَ حَدَّثَنَا ضَمْرَةُ بْنُ رَبِيعَةَ عَنْ عُثْمَانَ بْنِ عَطَاءٍ عَنْ أَبِي عِمْرَانَ عَنْ ذِي الْأَصَابِعِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنْ ابْتُلِينَا بَعْدَكَ بِالْبَقَاءِ أَيْنَ تَأْمُرُنَا قَالَ عَلَيْكَ بِبَيْتِ الْمَقْدِسِ فَلَعَلَّهُ أَنْ يَنْشَأَ لَكَ ذُرِّيَّةٌ يَغْدُونَ إِلَى ذَلِكَ الْمَسْجِدِ وَيَرُوحُونَ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Abu Shalih Al Hakam bin Musa] berkata; telah menceritakan kepada kami [Dlamrah bin Rabi'ah] dari ['Utsman bin 'Atha`] dari [Abu Imran] dari [Dzil Ashabi'] berkata; saya berkata; Wahai Rasulullah, jika kami diuji dengan panjang umur setelah anda, maka anda menyuruh Kemana?. Beliau bersabda: \"Pergilah ke Baitul Maqdis, semoga akan lahir darimu keturunan yang akan pergi ke masjid itu baik pagi maupun sore harinya\"."
            },
            {
                "number": 1215,
                "arab": "حَدَّثَنَا أَبُو صَالِحٍ الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا عِيسَى بْنُ يُونُسَ قَالَ أَبِي أَخْبَرَنَا عَنْ أَبِيهِ عَنْ ذِي الْجَوْشَنِ الضِّبَابِيِّ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ أَنْ فَرَغَ مِنْ أَهْلِ بَدْرٍ بِابْنِ فَرَسٍ لِي يُقَالُ لَهَا الْقَرْحَاءُ فَقُلْتُ يَا مُحَمَّدُ إِنِّي قَدْ جِئْتُكَ بِابْنِ الْقَرْحَاءِ لِتَتَّخِذَهُ قَالَ لَا حَاجَةَ لِي فِيهِ وَإِنْ أَرَدْتَ أَنْ أَقِيضَكَ فِيهَا الْمُخْتَارَةَ مِنْ دُرُوعِ بَدْرٍ فَعَلْتُ فَقُلْتُ مَا كُنْتُ لِأَقِيضَهُ الْيَوْمَ بِعُدَّةٍ قَالَ لَا حَاجَةَ لِي فِيهِ ثُمَّ قَالَ يَا ذَا الْجَوْشَنِ أَلَا تُسْلِمُ فَتَكُونَ مِنْ أَوَّلِ أَهْلِ هَذَا الْأَمْرِ فَقُلْتُ لَا قَالَ لِمَ قُلْتُ إِنِّي رَأَيْتُ قَوْمَكَ وَلِعُوا بِكَ قَالَ فَكَيْفَ بَلَغَكَ عَنْ مَصَارِعِهِمْ بِبَدْرٍ قُلْتُ قَدْ بَلَغَنِي قَالَ فَإِنَّا نُهْدِي لَكَ قُلْتُ إِنْ تَغْلِبْ عَلَى الْكَعْبَةِ وَتَقْطُنْهَا قَالَ لَعَلَّكَ إِنْ عِشْتَ تَرَى ذَلِكَ ثُمَّ قَالَ يَا بِلَالُ خُذْ حَقِيبَةَ الرَّجُلِ فَزَوِّدْهُ مِنْ الْعَجْوَةِ فَلَمَّا أَدْبَرْتُ قَالَ أَمَا إِنَّهُ مِنْ خَيْرِ فُرْسَانِ بَنِي عَامِرٍ قَالَ فَوَاللَّهِ إِنِّي بِأَهْلِي بِالْغَوْرِ إِذْ أَقْبَلَ رَاكِبٌ فَقُلْتُ مَا فَعَلَ النَّاسُ قَالَ وَاللَّهِ قَدْ غَلَبَ مُحَمَّدٌ عَلَى الْكَعْبَةِ وَقَطَنَهَا فَقُلْتُ هَبِلَتْنِي أُمِّي وَلَوْ أُسْلِمُ يَوْمَئِذٍ ثُمَّ أَسْأَلُهُ الْحِيرَةَ لَأَقْطَعَنِيهَاحَدَّثَنَا شَيْبَانُ بْنُ أَبِي شَيْبَةَ أَبُو مُحَمَّدٍ قَالَ حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ عَنْ أَبِي إِسْحَاقَ الْهَمْدَانِيِّ قَالَ قَدِمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذُو الْجَوْشَنِ وَأَهْدَى لَهُ فَرَسًا وَهُوَ يَوْمَئِذٍ مُشْرِكٌ فَأَبَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَقْبَلَهُ ثُمَّ قَالَ إِنْ شِئْتَ بِعْتَنِيهِ أَوْ هَلْ لَكَ أَنْ تَبِيعَنِيهِ بِالْمُتَخَيَّرَةِ مِنْ دُرُوعِ بَدْرٍ ثُمَّ قَالَ لَهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ لَكَ أَنْ تَكُونَ أَوَّلَ مَنْ يَدْخُلُ فِي هَذَا الْأَمْرِ فَقَالَ لَا فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يَمْنَعُكَ مِنْ ذَلِكَ قَالَ رَأَيْتُ قَوْمَكَ قَدْ كَذَّبُوكَ وَأَخْرَجُوكَ وَقَاتَلُوكَ فَانْظُرْ مَا تَصْنَعُ فَإِنْ ظَهَرْتَ عَلَيْهِمْ آمَنْتُ بِكَ وَاتَّبَعْتُكَ وَإِنْ ظَهَرُوا عَلَيْكَ لَمْ أَتَّبِعْكَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا ذَا الْجَوْشَنِ لَعَلَّكَ إِنْ بَقِيتَ وَذَكَرَ الْحَدِيثَ نَحْوًا مِنْهُ حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ ذِي الْجَوْشَنِ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ أَنْ فَرَغَ مِنْ بَدْرٍ بِابْنِ فَرَسٍ لِي يُقَالُ لَهَا الْقَرْحَاءُ فَقُلْتُ يَا مُحَمَّدُ وَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Abu Shalih Al Hakam bin Musa] telah menceritakan kepada kami ['Isa bin Yunus] berkata;  telah mengabarkan kepada kami dari [Bapaknya] dari [Dzil Jausyan Adl-Dlababi], berkata; saya menemui Nabi Shallallahu'alaihiwasallam dengan anak penunggang kudaku yang bernama Al Qarha' setelah beliau selesai membereskan Ahli Badar, lalu saya berkata; Wahai Muhammad sesungguhnya saya datang untuk menemui kamu dengan anak (penunggang kuda) Al Qarha` ini agar anda bersedia mengambilnya. Beliau bersabda: \"Saya tidak berminat dengannya, namun jika kau mau, saya akan menggantikan anak penunggang kudamu dengan baju besi dari Badar yang sangat mahal\". Saya berkata; saya tidak akan menukarkannya hari ini dengan barang lain. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Saya tidak ada keperluan dengan anak itu\" lalu bersabda: \"Wahai Dzal Jausyan!, tidak sebaiknyakah engkau masuk Islam, lalu kamu menjadi menjadi orang yang pertama-tama dalam urusan agama ini?\". Saya berkata; tidak. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Kenapa?\" Saya menjawab, saya melihat kaummu telah tertipu denganmu. Beliau bersabda: \"Bagaimana kabar yang sampai padamu tentang lokasi-lokasi mereka terbunuh di Badar?.\" (Dzil Jausyan) berkata; ya, telah sampai berita itu kepadaku.Beliau bersabda: \"Jika kamu masuk Islam, kami memberimu hadiah\". Saya (Dzil Jausyan) berkata; \"Saya mau masuk Islam asalkan engkau bisa menguasai Makkah dan tinggal disana\". Beliau bersabda: \"Semoga jika kau masih hidup, kamu bisa menyaksikan hal itu\". Lalu beliau bersabda: \"Wahai Bilal, ambilah tas orang ini dan isilah dengan kurma Ajwah\". Tatkala saya hendak berangkat beliau bersabda: \"Sesungguhnya dia termasuk penunggang kuda terbaik di Bani 'Amir\". (Dzil Jausyan) berkata; demi Allah, ketika saya bersama dengan keluarga pada suatu tempat yang rendah, datanglah orang yang berkendaraan. Saya bertanya, apa yang telah dilakukan orang-orang? Dia menjawab, \"Demi Allah, Muhammad telah menguasai kakbah dan tinggal disana.\" Lalu saya (Dzil Jausyan) berkata; 'Uhh, aduhai seandainya saya masuk Islam saat itu dengan harapan nabi memberiku tanah Hirah (nama tempat). Telah menceritakan kepada kami [Syaiban bin Abu Syaibah Abu Muhammad] berkata; telah menceritakan kepada kami [Jarir] yaitu Ibnu Hazm dari [Abu Ishaq Al Hamdani] berkata; [Dzul Jausyan] menemui Nabi Shallallahu'alaihiwasallam dan memberihadiah seekor penunggang kuda. Pada saat itu dia masih dalam keadaan musyrik, lalu Rasulullah Shallallahu'alaihiwasallam menolaknya dengan bersabda: \"Jika kamu mau kamu juallah kepadaku\", atau \"Maukah kau menjualnya untukku dan kuganti dengan baju-baju besi dari Badar?. Kemudian beliau bersabda kepadanya tidak sebaiknyakah engkau menjadi orang pertama-tama memasuki agama ini? Dia menjawab, \"Menurutku, karena kaummu telah mendustakanmu dan mengusirmu serta memerangimu, lihatlah apa ang kau perbuat. Jika kamu bisa mengalahkan mereka saya akan beriman kepadamu dan saya akan mengikutimu. Jika mereka yang mengalahkanmu maka saya tidak akan mengikutimu\". Lalu Rasulullah Shallallahu'alaihiwasallam bersabda kepadanya, \"Wahai Dzal Jausyan, jika kamu masih hidup, \" lalu menyebutkan hadits yang sama dengan yang di atas. Telah menceritakan kepadaku [Abu Bakar bin Abu Syaibah] berkata; telah menceritakan kepada kami ['Isa bin Yunus] dari [Bapaknya] dari [kakeknya] dari [Dzil-Jausyan] berkata; saya menemui Nabi Shallallahu'alaihiwasallam setelah beliau selesai dari Perang Badar dengan membawa anak penunggang kuda milikku yag bernama Al Qarha`, lalu saya berkata; \"Wahai Muhammad, \" lalu dia menyebutkan hadis secara sempurna."
            },
            {
                "number": 1216,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ إِسْحَاقَ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ مَنْصُورِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ عَنْ أُمِّ عُثْمَانَ ابْنَةِ سُفْيَانَ وَهِيَ أُمُّ بَنِي شَيْبَةَ الْأَكَابِرِ قَالَ مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ وَقَدْ بَايَعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَا شَيْبَةَ فَفَتَحَ فَلَمَّا دَخَلَ الْبَيْتَ وَرَجَعَ وَفَرَغَ وَرَجَعَ شَيْبَةُ إِذَا رَسُولُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَجِبْ فَأَتَاهُ فَقَالَ إِنِّي رَأَيْتُ فِي الْبَيْتِ قَرْنًا فَغَيِّبْهُقَالَ مَنْصُورٌ فَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُسَافِعٍ عَنْ أُمِّي عَنْ أُمِّ عُثْمَانَ بِنْتِ سُفْيَانَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ فِي الْحَدِيثِ فَإِنَّهُ لَا يَنْبَغِي أَنْ يَكُونَ فِي الْبَيْتِ شَيْءٌ يُلْهِي الْمُصَلِّينَ",
                "id": "Telah menceritakan kepada kami ['Ali bin Ishaq] berkata; telah mengabarkan kepada kami [Abdullah] berkata; telah mengabarkan kepada kami [Muhammad bin Abdurrahman] dari [Manshur bin Abdurrahman] dari [Ibunya] dari [Ummu 'Utsman, anak perempuan Sufyan] dia adalah Ummu Bani Syaibah yang paling tua, Muhammad bin Abdurrahman berkata; sesungguhnya dia (Ummu 'Utsman) telah berbaiat kepada Nabi Shallallahu'alaihiwasallam, sesungguhnya Nabi Shallallahu'alaihiwasallam memanggil Syaibah lalu beliau membukakan untuknya, tatkala dia memasuki rumah, lalu pulang dan telah selesai maka Syaibah kembali karena ada utusan Rasulullah Shallallahu'alaihiwasallam yang mengharap untuk menjawabnya, maka dia mendatangi beliau, lalu beliau bersabda: \"Saya melihat di dalam rumah ada suatu tanduk maka hilangkanlah.\" Manshur berkata; lalu telah menceritakan kepadaku [Abdullah bin Musafi'] dari [ibuku] dari [Ummu 'Utsman binti Sufyan] sesungguhnya Nabi Shallallahu'alaihiwasallam bersabda kepadanya dalam hadits, \"Sesungguhnya tidak layak di dalam rumah ada sesuatu yang sia-sia yang mengganggu orang yang sholat.\""
            },
            {
                "number": 1217,
                "arab": "قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي مَنْصُورٌ عَنْ خَالِهِ مُسَافِعٍ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ أُمِّ مَنْصُورٍ قَالَتْ أَخْبَرَتْنِي امْرَأَةٌ مِنْ بَنِي سُلَيْمٍ وَلَدَتْ عَامَّةَ أَهْلِ دَارِنَاأَرْسَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى عُثْمَانَ بْنِ طَلْحَةَ وَقَالَ مَرَّةً إِنَّهَا سَأَلَتْ عُثْمَانَ بْنَ طَلْحَةَ لِمَ دَعَاكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنِّي كُنْتُ رَأَيْتُ قَرْنَيْ الْكَبْشِ حِينَ دَخَلْتُ الْبَيْتَ فَنَسِيتُ أَنْ آمُرَكَ أَنْ تُخَمِّرَهُمَا فَخَمِّرْهُمَا فَإِنَّهُ لَا يَنْبَغِي أَنْ يَكُونَ فِي الْبَيْتِ شَيْءٌ يَشْغَلُ الْمُصَلِّيَقَالَ سُفْيَانُ لَمْ تَزَلْ قَرْنَا الْكَبْشِ فِي الْبَيْتِ حَتَّى احْتَرَقَ الْبَيْتُ فَاحْتَرَقَا",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Sufyan] berkata; telah menceritakan kepadaku [Manshur] dari [pamannya, Musafi'] dari [Shafiyyah binti Syaibah, Ummu Manshur] berkata; telah mengabarkan kepadaku [seorang perempuan dari Bani Sulaim] yang telah melahirkan seorang budak wanita pada salah satu kelurga kami, Rasulullah Shallallahu'alaihiwasallam mengutus kalian 'Utsman bin Thalhah, dan pernah berkata; sesungguhnya dia (seorang perempuan dari Bani Sulaim) bertanya kepada 'Utsman bin Thalhah, mengapa Nabi Shallallahu'alaihiwasallam memanggilmu. Dia menjawab, sesungguhnya saya melihat dua tanduk kambing ketika saya memasuki rumah, lalu saya lupa menyuruh kamu menutupinya, sesungguhnya tidak boleh di dalam rumah ada sesuatu yang bisa menyibukkan orang sholat. Sufyan berkata; maka dua tanduk tersebut tetap berada di rumah sampai rumah itu terbakar sehingga tanduk itu ikut terbakar."
            },
            {
                "number": 1218,
                "arab": "قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنِي نَافِعٌ عَنْ صَفِيَّةَ عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَتَى عَرَّافًا فَصَدَّقَهُ بِمَا يَقُولُ لَمْ يُقْبَلْ لَهُ صَلَاةٌ أَرْبَعِينَ يَوْمًا",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari ['ubaidhullah] berkata; telah menceritakan kepadaku [Nafi'] dari [Shafiyah] dari [sebagian istri Nabi Shallallahu'alaihiwasallam] dari Nabi Shallallahu'alaihiwasallam bersabda: \"Barangsiapa mendatangi dukun lalu membenarkan apa yang dikatakan, tidak diterima sholatnya selama empat puluh hari.\""
            },
            {
                "number": 1219,
                "arab": "قَالَ حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ إِبْرَاهِيمَ قَالَ حَدَّثَنَا حُسَيْنُ بْنُ ذَكْوَانَ عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ امْرَأَةٍ مِنْهُمْ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا آكُلُ بِشِمَالِي وَكُنْتُ امْرَأَةً عَسْرَاءَ فَضَرَبَ يَدِي فَسَقَطَتْ اللُّقْمَةُ فَقَالَ لَا تَأْكُلِي بِشِمَالِكِ وَقَدْ جَعَلَ اللَّهُ تَبَارَكَ وَتَعَالَى لَكِ يَمِينًا أَوْ قَالَ قَدْ أَطْلَقَ اللَّهُ عَزَّ وَجَلَّ لَكِ يَمِينَكِقَالَ فَتَحَوَّلَتْ شِمَالِي يَمِينًا فَمَا أَكَلْتُ بِهَا بَعْدُ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Isma'il] yaitu Ibnu Ibrahim berkata; telah menceritakan kepada kami [Husain bin Dzakwan] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Abdullah bin Muhammad] dari [salah satu wanita mereka] berkata; Rasulullah Shallallahu'alaihiwasallam mendatangiku sedangkan aku makan dengan tangan kiri. Aku saat itu adalah perempuan yang berumur sekitar sepuluh tahunan, maka beliau memukul tanganku sehingga jatuhlah suapanku. Lalu beliau bersabda: \"Janganlah kamu makan dengan tangan kirimu, sedangkan Allah Tabaraka Wa Ta'ala telah menciptakan tangan kanan untukmu\", atau bersabda: \"Sungguh Allah Azza wa jalla telah menetapkan tangan kananmu\", Maka dia berkata; lalu aku mengubahnya dengan tangan kanan, dan aku selalu makan dengan tangan kanan tersebut setelahnya."
            },
            {
                "number": 1220,
                "arab": "قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ عَنْ مَوْلًى لَهُمْ يُقَالُ لَهُ مُزَاحِمُ بْنُ أَبِي مُزَاحِمٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ عَبْدِ اللَّهِ بْنِ خَالِدِ بْنِ أَسِيدٍ عَنْ رَجُلٍ مِنْهُمْ مِنْ خُزَاعَةَ يُقَالُ لَهُ مُخَرِّشٌ أَوْ مُحَرِّشٌ لَمْ يَكُنْ سُفْيَانُ يُقِيمُ عَلَى اسْمِهِ وَرُبَّمَا قَالَ مُحَرِّسٌ وَلَمْ أَسْمَعْهُ أَنَاأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ الْجِعِرَّانَةِ لَيْلَةً فَاعْتَمَرَ ثُمَّ رَجَعَ وَأَصْبَحَ بِهَا كَبَائِتٍ فَنَظَرْتُ إِلَى ظَهْرِهِ كَأَنَّهُ سَبِيكَةُ فِضَّةٍ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Isma'il bin Umayyah] dari [budak mereka yang bernama Muzahim bin Abu Muzahim] dari [Abdul Aziz bin Abdullah bin Khalid bin Asid] dari [seorang laki-laki Bani Khuza'ah yang bernama Mukharrasy (si bisu) atau Muharrisy], Sufyan belum memberikan nama yang jelas, tetapi sepertinya dia adalah si muharris (si bisu) dan aku belum pernah mendengarnya, sesungguhnya Nabi Shallallahu'alaihiwasallam keluar dari Ji'ranah pada malam hari untuk berumrah kemudian pulang, dan pada waktu paginya seakan-akan bermalam, maka aku melihat punggungnya seakan-akan perak yang dilebur lalu dituang dalam cetakan."
            },
            {
                "number": 1221,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنِ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ رَجُلٍ مِنْ ثَقِيفٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَالَ فَنَضَحَ فَرْجَهُ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Najih] dari [Mujahid] dari [seorang laki-laki Bani Tsaqif] dari bapaknya sesungguhnya Nabi Shallallahu'alaihiwasallam kencing lalu memercikkan air pada kemaluannya."
            },
            {
                "number": 1222,
                "arab": "قَالَ حَدَّثَنَا حَفْصُ بنُ غِيَاثٍ قَالَ حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ عَنِ الشَّعْبِيِّ عَنْ أَبِي جَبِيرَةَ بْنِ الضَّحَّاكِ الْأَنْصَارِيِّ عَنْ عُمُومَةٍ لَهُقَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَيْسَ أَحَدٌ مِنَّا إِلَّا لَهُ لَقَبٌ أَوْ لَقَبَانِ قَالَ فَكَانَ إِذَا دَعَا بِلَقَبِهِ قُلْنَا يَا رَسُولَ اللَّهِ إِنَّ هَذَا يَكْرَهُ هَذَا قَالَ فَنَزَلَتْ{ وَلَا تَنَابَزُوا بِالْأَلْقَابِ }",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Hafsh bin Ghiyats] berkata; telah menceritakan kepada kami [Daud bin Abu Hind] dari [Asy Sya'bi] dari [Abu Jabirah bin Adl-Dlahak Al Anshari, Saudara jalur paman Al Anshary] dari [paman] Nabi Shallallahu'alaihiwasallam datang dan tidaklah seorangpun dari kami kecuali mempunyai satu atau dua nama panggilan. (Abu Jabirah bin Adl-Dlahak Al Anshari Radliyallahu'anhu) berkata; (Rasulullah Shallallahu'alaihiwasallam) apabila memanggil dengan laqabnya, kami berkata; \"Sesungguhnya nama panggilan ini dibenci\", lalu turunlah ayat, 'Janganlah kalian memperolok-olok dengan nama pangilan\""
            },
            {
                "number": 1223,
                "arab": "قَالَ حَدَّثَنَا أَبُو عَامِرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي سُلَيْمَانَ شَيْخٌ صَالِحٌ حَسَنُ الْهَيْئَةِ مَدِينِيٌّ قَالَ حَدَّثَنَا مُعَاذُ بْنُ عَبْدِ اللَّهِ بْنِ خُبَيْبٍ عَنْ أَبِيهِ عَنْ عَمِّهِ قَالَكُنَّا فِي مَجْلِسٍ فَطَلَعَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَهُ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Abu 'Amir] berkata; telah menceritakan kepada kami [Abdullah bin Abu Sulaiman], seorang yang sudah tua dan sangat shalih, dan fisiknya baik, seseorang dari Madinah, berkata; telah menceritakan kepada kami [Mu'adz bin Abdullah bin khubaib] dari [Bapaknya] dari [pamannya] berkata; kami sedang berada pada suatu majlis, lalu Rasulullah Shallallahu'alaihiwasallam muncul kepada kami. Lalu, menyebutkannya."
            },
            {
                "number": 1224,
                "arab": "قَالَ حَدَّثَنَا أَبُو عَامِرٍ قَالَ حَدَّثَنَا عَبَّادٌ يَعْنِي ابْنَ رَاشِدٍ عَنِ الْحَسَنِ عَنْ رَجُلٍ مِنْ بَنِي سَلِيطٍ أَنَّهُمَرَّ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ قَاعِدٌ عَلَى بَابِ مَسْجِدِهِ مُحْتَبٍ وَعَلَيْهِ ثَوْبٌ لَهُ قِطْرٌ لَيْسَ عَلَيْهِ ثَوْبٌ غَيْرَهُ وَهُوَ يَقُولُ الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَظْلِمُهُ وَلَا يَخْذُلُهُ ثُمَّ أَشَارَ بِيَدِهِ إِلَى صَدْرِهِ يَقُولُ التَّقْوَى هَاهُنَا التَّقْوَى هَاهُنَا",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Abu 'Amir] berkata; telah menceritakan kepada kami ['Abbad] yaitu Ibnu Rasyid dari [Al Hasan] dari seorang laki-laki dari Bani Salith sesungguhnya dia melewati Rasulullah Shallallahu'alaihiwasallam waktu itu beliau sedang duduk di depan masjidnya dalam keadaan duduk ihtiba' (posisi duduk dengan meletakkan kedua pahanya pada dadanya) dengan di atasnya ada pakaian yang ada jahitannya berwarna merah, tidak ada pakaian setelahnya, beliau bersabda: \"Seorang muslim adalah sauadara muslim yang lainnya, tidak boleh menganiayanya maupun merendahkannya\", lalu beliau menunjukkan dengan tangannya ke arah dadanya dan bersabda: \"taqwa itu letaknya di sini.\""
            },
            {
                "number": 1225,
                "arab": "قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو قَالَ حَدَّثَنَا زَائِدَةُ قَالَ حَدَّثَنَا الرُّكَيْنُ بْنُ الرَّبِيعِ بْنِ عُمَيْلَةَ عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ عَنْ رَجُلٍ مِنْ الْأَنْصَارِعَنْ النَّبِيِّ قَالَ الْخَيْلُ ثَلَاثَةٌ فَرَسٌ يَرْبِطُهُ الرَّجُلُ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ فَثَمَنُهُ أَجْرٌ وَرُكُوبُهُ أَجْرٌ وَعَارِيَتُهُ أَجْرٌ وَعَلَفُهُ أَجْرٌ وَفَرَسٌ يُغَالِقُ عَلَيْهِ الرَّجُلُ وَيُرَاهِنُ فَثَمَنُهُ وِزْرٌ وَعَلَفُهُ وِزْرٌ وَفَرَسٌ لِلْبِطْنَةِ فَعَسَى أَنْ يَكُونَ سَدَادًا مِنْ الْفَقْرِ إِنْ شَاءَ اللَّهُ تَعَالَى",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Mu'awiyah bin 'Amr] berkata; telah menceritakan kepada kami [Za`idah] berkata; telah menceritakan kepada kami [Ar Rukain bin Ar Rabi' bin 'Umailah] dari [Abu 'Amr Asy Syaibani] dari [seseorang dari Anshar] dari Nabi Shallallahu'alaihiwasallam bersabda: \"Kuda itu ada tiga: Kuda yang diikat oleh seseorang di jalan Allah Azza wa jalla maka biaya untuk membelinya adalah pahala, menaikinya adalah pahala, orang yang meminjaminya ada pahala dan memberi makannya adalah pahala. Kuda yang di jadikan jaminan seseorang yang menggadaikan, maka harganya menjadi dosa dan memberi makannya juga dosa. Kuda untuk mencari nafkah, bisa jadi sebagai sesuatu untuk memenuhi kebutuhan dari kefakiran jika Allah Ta'ala menghendaki.\""
            },
            {
                "number": 1226,
                "arab": "قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ قَالَ حَدَّثَنَا يَحْيَى بْنُ حُصَيْنِ بْنِ عُرْوَةَ قَالَ حَدَّثَتْنِي جَدَّتِي قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَلَوْ اسْتُعْمِلَ عَلَيْكُمْ عَبْدٌ يَقُودُكُمْ بِكِتَابِ اللَّهِ عَزَّ وَجَلَّ فَاسْمَعُوا لَهُ وَأَطِيعُوا",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] berkata; telah menceritakan kepada kami [Yahya bin Husain bin 'Urwah] berkata; telah menceritakan kepadaku [nenekku] berkata; saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Jika ada yang diangkat menjadi pimpinan pada kalian seorang budak, yang memimpin dengan kitab Allah Azza wa jalla maka dengarkanlah dan taatilah.\""
            },
            {
                "number": 1227,
                "arab": "قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ يَحْيَى بْنِ حُصَيْنٍ عَنْ جَدَّتِهِ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَرْحَمُ اللَّهُ الْمُحَلِّقِينَ يَرْحَمُ اللَّهُ الْمُحَلِّقِينَ قَالُوا فِي الثَّالِثَةِ وَالْمُقَصِّرِينَ قَالَ وَالْمُقَصِّرِينَ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Waki'] berkata; telah menceritakan kepada kami [Syu'bah] dari [Yahya bin Hushain] dari [neneknya] berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Allah akan memberi rahmat orang yang telah mencukur habis rambutnya, Allah akan memberi rahmat orang yang telah mencukur habis rambutnya\" mereka berkata pada yang ketiga kalinya, \"Dan orang yang memendekkannya\" Beliau bersabda: \"Dan orang yang memendekkan rambutnya.\""
            },
            {
                "number": 1228,
                "arab": "قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورِ بْنِ حَيَّانَ الْأَسَدِيِّ عَنِ ابْنِ نَجَّادٍ عَنْ جَدَّتِهِ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُدُّوا السَّائِلَ وَلَوْ بِظِلْفٍ مُحْتَرِقٍ أَوْ مُحْرَقٍ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Waki'] berkata; telah menceritakan kepada kami [Sufyan] dari [Manshur bin Hayyan Al Asadi] dari [Ibnu Najjad] dari [neneknya] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Berilah orang yang meminta walaupun hanya dengan tulang kaki yang dibakar.\""
            },
            {
                "number": 1229,
                "arab": "قَالَ حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَاقَ عَنْ يَحْيَى بْنِ حُصَيْنٍ عَنْ أُمِّهِ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فِي حَجَّةِ الْوَدَاعِ يَقُولُ يَا أَيُّهَا النَّاسُ اتَّقُوا اللَّهَ وَاسْمَعُوا وَأَطِيعُوا وَإِنْ أُمِّرَ عَلَيْكُمْ عَبْدٌ حَبَشِيٌّ مُجَدَّعٌ مَا أَقَامَ فِيكُمْ كِتَابَ اللَّهِ عَزَّ وَجَلَّ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Waki'] dari [Isra`il] dari [Abu Ishaq] dari [Yahya bin Hushain] dari [ibunya] berkata; saya telah mendengar Rasulullah Shallallahu'alaihiwasallam berkhutbah pada Haji Wada', \"Wahai manusia, bertaqwalah kepada Allah, dengarkanlah dan taatilah, walau yang memimpin kalian adalah seorang budak Ethopia yang botak, selama dia menegakkan kitab Allah Azza wa jalla\"."
            },
            {
                "number": 1230,
                "arab": "قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْحَاقَ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ عَنْ جَدَّتِهِ عَنِ امْرَأَةٍ مِنْ نِسَائِهِمْ قَالَ وَقَدْ كَانَتْ صَلَّتْ الْقِبْلَتَيْنِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِي اخْتَضِبِي تَتْرُكُ إِحْدَاكُنَّ الْخِضَابَ حَتَّى تَكُونَ يَدُهَا كَيَدِ الرَّجُلِقَالَتْ فَمَا تَرَكَتْ الْخِضَابَ حَتَّى لَقِيَتْ اللَّهَ عَزَّ وَجَلَّ وَإِنْ كَانَتْ لَتَخْتَضِبُ وَإِنَّهَا لَابْنَةُ ثَمَانِينَ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Yazid bin Harun] berkata; telah mengabarkan kepada kami [Muhammad bin Ishaq] dari [Dlamrah bin Sa'id] dari [neneknya] dari [seorang wanita dari kalangan mereka] dia telah mengalami sholat dua arah kiblat bersama Rasulullah Shallallahu'alaihiwasallam, berkata; Rasulullah Shallallahu'alaihiwasallam menemuiku, lalu bersabda kepadaku, \"Warnailah kukumu, kenapa salah seorang dari kalian meninggalkan pacar sampai tangannya seperti tangan kaum laki-laki\". (seorang wanita dari kalangan kaumnya Dlamrah Radliyallahu'anha) berkata; lalu (wanita) tidak meninggalkan pewarna kuku sampai mereka bertemu Allah Azza wa jalla, ia tetap mewarnainya walau sudah berumur delapan puluh tahun."
            },
            {
                "number": 1231,
                "arab": "قَالَ حَدَّثَنَا الْهَيْثَمُ بْنُ خَارِجَةَ قَالَ عَبْد اللَّهِ وَقَدْ سَمِعْتُهُ أَنَا مِنْ الْهَيْثَمِ قَالَ حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ عَنِ ابْنِ حَرْمَلَةَ عَنْ أَبِي ثِفَالٍ الْمُرِّيِّ أَنَّهُ قَالَ سَمِعْتُ رَبَاحَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ حُوَيْطِبٍ يَقُولُ حَدَّثَتْنِي جَدَّتِي أَنَّها سَمِعَتْ أَبَاهَا يَقُولُسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا صَلَاةَ لِمَنْ لَا وُضُوءَ لَهُ وَلَا وُضُوءَ لِمَنْ لَمْ يَذْكُرْ اللَّهَ تَعَالَى وَلَا يُؤْمِنُ بِاللَّهِ مَنْ لَمْ يُؤْمِنْ بِي وَلَا يُؤْمِنُ بِي مَنْ لَا يُحِبُّ الْأَنْصَارَقَالَ حَدَّثَنَا شَيْبَانُ قَالَ حَدَّثَنَا يَزِيدُ بْنُ عِيَاضٍ عَنْ أَبِي ثِفَالٍ بِهَذَا الْحَدِيثِ وَقَالَ سَمِعَتْ أَبَاهَا سَعِيدَ بْنَ زَيْدٍ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami Haitsam bin Kharijah Abdullah berkata; dan saya telah mendengarnya dari [Al Haitsam], berkata; telah menceritakan kepada kami [Hafs bin Maisarah] dari [Ibnu Harmalah] dari [Abu Tsifal Al Muri] sesungguhnya dia berkata; saya telah mendengar [Rabah bin Abdurrahman bin Huwaithib] berkata; telah menceritakan kepadaku [nenekku] sesungguhnya telah mendengar [bapaknya] berkata; saya telah mendengar Nabi Shallallahu'alaihiwasallam bersabda: \"Tidak sah sholat bagi orang yang tidak berwudlu, dan tidak ada wudlu bagi orang yang tidak menyebut Allah Ta'ala. Tidak dikatakan beriman kepada Allah orang yang tidak beriman kepadaku dan tidak dikatakan beriman kepadaku jika dia tidak mencintai Anshar.\" (Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Syaiban] berkata; telah menceritakan kepada kami [Yazid bin Iyadl] dari [Abu Tsifal] dengan hadits ini dan berkata; saya telah mendengar bapaknya sesungguhnya berkata; [Sa'id bin Zaid]."
            },
            {
                "number": 1232,
                "arab": "قَالَ عَبْد اللَّهِ حَدَّثَنَا أَبُو مَعْمَرٍ حَدَّثَنَا هُشَيْمٌ قَالَ أَخْبَرَنَا سَيَّارٌ عَنْ خَالِدِ بْنِ عَبْدِ اللَّهِ الْقَسْرِيِّ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِجَدِّهِ يَزِيدَ بْنِ أَسَدٍ أَحِبَّ لِلنَّاسِ مَا تُحِبُّ لِنَفْسِكَ",
                "id": "Abdullah berkata; telah menceritakan kepada kami [Abu Ma'mar] telah menceritakan kepada kami [Hutsaim] berkata; telah mengabarkan kepada kami [Sayyar] dari [Khalid bin Abdullah Al Qasri] dari [Bapaknya] sesungguhnya Nabi Shallallahu'alaihiwasallam bersabda kepada kakeknya, Yazid bin Asad, \"Cintalah kepada manusia sebagaimana kamu mencintai untuk dirimu.\""
            },
            {
                "number": 1233,
                "arab": "قَالَ عَبْد اللَّهِ حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ قَالَ حَدَّثَنَا سَلْمُ بْنُ قُتَيْبَةَ عَنْ يُونُسَ بْنِ أَبِي إِسْحَاقَ عَنْ إِسْمَاعِيلَ بْنِ أَوْسَطَ عَنْ خَالِدِ بْنِ عَبْدِ اللَّهِ عَنْ جَدِّهِ أَسَدِ بْنِ كُرْزٍسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْمَرِيضُ تَحَاتُّ خَطَايَاهُ كَمَا يَتَحَاتُّ وَرَقُ الشَّجَرِ",
                "id": "Abdullah berkata; telah menceritakan kepada kami ['Uqbah bin Mukram Al 'Ami] berkata; telah menceritakan kepada kami [Salm bin Qutaibah] dari [Yunus bin Abu Ishaq] dari [Isma'il bin Ausath] dari [Khalid bin Abdullah] dari [kakeknya, Asad bin Kurz] telah mendengar Nabi Shallallahu'alaihiwasallam bersabda: \"Orang yang sakit itu kesalahannya akan berjatuhan sebagaimana berjatuhannya daun dari pohon.\""
            },
            {
                "number": 1234,
                "arab": "قَالَ عَبْد اللَّهِ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرُّزِّيُّ أَبُو جَعْفَرٍ قَالَ حَدَّثَنَا رَوْحُ بْنُ عَطَاءٍ بْنِ أَبِي مَيْمُونَةَ قَالَ حَدَّثَنَا سَيَّارٌ أَنَّهُ سَمِعَ خَالِدَ بْنَ عَبْدِ اللَّهِ الْقَسْرِيَّ وَهُوَ يَخْطُبُ عَلَى الْمِنْبَرِ وَهُوَ يَقُولُ حَدَّثَنِي أَبِي عَنْ جَدِّي أَنَّهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتُحِبُّ الْجَنَّةَ قَالَ قُلْتُ نَعَمْ قَالَ فَأَحِبَّ لِأَخِيكَ مَا تُحِبُّ لِنَفْسِكَ",
                "id": "Abdullah berkata; telah menceritakan kepadaku [Muhammad bin Abdullah Ar Ruzi, Abu Ja'far] berkata; telah menceritakan kepada kami [Rauh bin 'Atha` bin Abu Maimunah] berkata; telah menceritakan kepada kami [Sayyar] sesungguhnya telah mendengar [Khalid bin Abdullah Al Qasri] dia berkhutbah di atas mimbar, dia berkata; telah menceritakan kepadaku [bapakku] dari [kakekku] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Apakah kalian menyukai surga\". Dia menjawab, ya. Beliau bersabda: \"Cintailah pada saudaramu sebagai kamu mencintai untuk diri kamu.\""
            },
            {
                "number": 1235,
                "arab": "قَالَ عَبْد اللَّهِ حَدَّثَنِي أَبُو الْحَسَنِ عُثْمَانُ بْنُ أَبِي شَيْبَةَ بِالْكُوفَةِ سَنَةَ ثَلَاثِينَ وَمِائَتَيْنِ وَيَعْقُوبُ الدَّوْرَقِيُّ قَالَا حَدَّثَنَا هُشَيْمُ بْنُ بَشِيرٍ قَالَ عُثْمَانُ بْنُ أَبِي شَيْبَةَ أَخْبَرَنَا سَيَّارٌ قَالَ سَمِعْتُ خَالِدَ بْنَ عَبْدِ اللَّهِ الْقَسْرِيَّ عَلَى الْمِنْبَرِ يَقُولُ حَدَّثَنِي أَبِي عَنْ جَدِّي يَزِيدَ بْنِ أَسَدٍقَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا يَزِيدُ بْنَ أَسَدٍ أَحِبَّ لِلنَّاسِ مَا تُحِبُّ لِنَفْسِكَ",
                "id": "Abdullah berkata; telah menceritakan kepadaku [Abu Al Hasan, 'Utsman bin Abu Syaibah] di Kufah pada tahun dua ratus tiga puluh dan [Ya'qub Ad-Dauraqi] berkata; telah menceritakan kepada kami [Husyaim bin Basyir] berkata; ['Utsman bin Abu Syaibah] berkata; telah mengabarkan kepada kami [Sayyar] berkata; saya telah mendengar [Khalid bin Abdullah Al Qari] di atas mimbar berkata; telah menceritakan kepadaku [bapakku] dari [kakekku, Yazid bin Asad] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda kepadaku, \"Wahai Yazid bin Asad, Cintailah manusia sebagaimana kamu mencintai diri kamu sendiri.\""
            },
            {
                "number": 1236,
                "arab": "قَالَ عَبْد اللَّهِ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ وَهُوَ الْمُقَدَّمِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ ثَابِتٍ الْعَبْدِيُّ قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ عَنِ الصَّعْبِ بْنِ جَثَّامَةَأَنَّهُ أَهْدَى لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَحْمَ صَيْدٍ فَلَمْ يَقْبَلْهُ فَرَأَى ذَلِكَ فِي وَجْهِ الصَّعْبِ فَقَالَ إِنَّهُ لَمْ يَمْنَعْنَا أَنْ نَقْبَلَ مِنْكَ إِلَّا أَنَّا كُنَّا حُرُمًا",
                "id": "Abdullah berkata; telah menceritakan kepada kami [Muhammad bin Abu Abu Bakar] yaitu Al Muqadami, berkata; telah menceritakan kepada kami [Muhammad bin Tsabit Al 'Abdi] berkata; telah menceritakan kepada kami ['Amr bin Dinar] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Ibnu 'Abbas] dari [Ash-Sha'b bin Jatsamah] sesungguhnya dia memberi hadiah kepada Rasulullah Shallallahu'alaihiwasallam daging buruan namun beliau tidak menerimanya, lalu (Rasulullah Shallallahu'alaihiwasallam) melihat pancaran ketidaksukaan pada wajah Ash-Shab, lalu bersabda: \"Sebenarnya tidak ada yang menghalangi kami untuk menerima darimu, hanya karena kami dalam keadaan ihram.\""
            },
            {
                "number": 1237,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنِي أَبُو خَيْثَمَةَ زُهَيْرُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ عَنِ الصَّعْبِ بْنِ جَثَّامَةَ قَالَمَرَّ بِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا بِالْأَبْوَاءِ أَوْ بِوَدَّانَ فَأَهْدَيْتُ لَهُ لَحْمَ حِمَارِ وَحْشٍ وَهُوَ مُحْرِمٌ فَرَدَّهُ عَلَيَّ فَلَمَّا رَأَى فِي وَجْهِي الْكَرَاهِيَةَ قَالَ لَيْسَ بِنَا رَدٌّ عَلَيْكَ وَلَكِنَّا حُرُمٌ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku [Abu Khaitsamah, Zuhair bin Harb] berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] dari [Ash-Sha'b bin Jatsamah] berkata; Rasulullah Shallallahu'alaihiwasallam melewatiku, waktu itu saya sedang berada di Abwa` atau Waddan, lalu saya memberi hadiah berupa daging keledai liar dan beliau dalam keadaan ihram namun beliau menolaknya. Tatkala beliau melihat ketidaksukaan pada wajahku, beliau bersabda: \"Kami tidak menolaknya hanya karena kami sedang dalam keadaan ihram.\""
            },
            {
                "number": 1238,
                "arab": "قَالَوَسَمِعْتُهُ يَقُولُ لَا حِمَى إِلَّا لِلَّهِ وَلِرَسُولِهِ",
                "id": "Masih melalui jalur periwayatan yang sama seperti hadits sebelumnya, dari [Sha'bi bin Jatstsamah]; (Ash-Shab bin Jatsamah Radliyallahu'anhu) berkata; dan saya telah mendengarnya beliau bersabda: \"Tidak ada hima (batasan yang tidak boleh dilanggar seorang muslim) kecuali batasan yang ditetapkan oleh Allah dan Rasul-Nya."
            },
            {
                "number": 1239,
                "arab": "قَالَوَسُئِلَ عَنْ أَهْلِ الدَّارِ مِنْ الْمُشْرِكِينَ يُبَيَّتُونَ فَيُصَابُ مِنْ نِسَائِهِمْ وَذَرَارِيِّهِمْ قَالَ هُمْ مِنْهُمْ",
                "id": "Masih melalui jalur periwayatan yang sama seperti hadits sebelumnya, dari [Sha'bi bin Jatstsamah]; (Ash-Shab bin Jatsamah Radliyallahu'anhu) berkata; beliau ditanya tentang orang yang sedang berada di perkampungan orang musyrik yang diserang pada malam harinya, lalu para wanita mereka ditawan, juga anak-anak mereka. Beliau mengatakan, \"Mereka adalah bagian dari diri mereka.\""
            },
            {
                "number": 1240,
                "arab": "قَالَ عَبْد اللَّهِ حَدَّثَنِي مُصْعَبٌ هُوَ الزُّبَيْرِيُّ قَالَ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ عَبْدِ اللَّهِ بْنِ عَيَّاشٍ الْمَخْزُومِيُّ عَنِ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنِ الصَّعْبِ بْنِ جَثَّامَةَ اللَّيْثِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَمَى النَّقِيعَ وَقَالَ لَا حِمَى إِلَّا لِلَّهِ وَلِرَسُولِهِ",
                "id": "Abdullah berkata; telah menceritakan kepadaku [Mush'ab, Az Zubairi] berkata; telah menceritakan kepadaku [Abdul Aziz bin Muhammad] dari [Abdurrahman bin Al Harits bin Abdullah bin 'Ayyasy Al Makhzumi] dari [Ibnu Syihab] dari ['ubaidhullah bin Abdullah bin 'Utbah bin Mas'ud] dari [Abdullah bin 'Abbas] dari [Ash-Shab bin Jatsamah Al Laitsi] sesungguhnya Rasulullah Shallallahu'alaihiwasallam menjaga sumur yang banyak airnya dan bersabda: \"Tidak ada hima (batasan yang seharusnya tidak dilanggar oleh seorang muslim) kecuali batasan yang ditetapkan Allah dan Rasul-Nya\"."
            },
            {
                "number": 1241,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنَا مُصْعَبُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ عَنِ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنِ الصَّعْبِ بْنِ جَثَّامَةَ اللَّيْثِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَهْدَى لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِمَارًا وَحْشِيًّا وَهُوَ بِالْأَبْوَاءِ أَوْ بِوَدَّانَ فَرَدَّهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا فِي وَجْهِي فَقَالَ إِنَّا لَمْ نَرُدَّهُ عَلَيْكَ إِلَّا أَنَّا حُرُمٌ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepada kami [Mus'ab bin Abdullah] berkata; telah menceritakan kepadaku [Malik bin Anas] dari [Ibnu Syihab] dari ['ubaidhullah bin Abdullah bin 'Utbah bin Masud] dari [Abdullah bin Abbas] dari [Ash-Shab bin Jatsamah Al Laitsi] dari Nabi Shallallahu'alaihiwasallam, sesungguhnya dia pernah memberi hadiah kepada Rasulullah Shallallahu'alaihiwasallam keledai liar. Dia sedang berada di Abwa` atau Waddan, lalu Rasulullah Shallallahu'alaihiwasallam menolaknya. Tatkala Rasulullah Shallallahu'alaihiwasallam melihat ketidaksukaan pada wajahku, beliau bersabda: \"Kami tidak menolaknya, hanya karena kami sedang dalam keadaan ihram.\""
            },
            {
                "number": 1242,
                "arab": "قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ قَالَ سَمِعْتُ صَالِحَ بْنَ كَيْسَانَ يُحَدِّثُ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنِ الصَّعْبِ بْنِ جَثَّامَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَمَا هُوَ بِوَدَّانَ إِذْ أَتَاهُ الصَّعْبُ بْنُ جَثَّامَةَ أَوْ رَجُلٌ بِبَعْضِ حِمَارِ وَحْشٍ فَرَدَّهُ عَلَيْهِ فَقَالَ إِنَّا حُرُمٌ لَا نَأْكُلُ الصَّيْدَ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepadaku ['ubaidhullah bin 'Umar Al Qawariri] berkata; telah menceritakan kepada kami [Hammad bin Zaid] berkata; saya telah mendengar [Shalih bin Kaisan] menceritakan dari ['ubaidhullah bin Abdullah] dari [Abdullah bin Abbas] dari [Ash-Sha'b bin Jatsamah] sesungguhnya Rasulullah Shallallahu'alaihiwasallam tatkala sedang berada di Waddan, Ash-Shab bin Jatsamah menemuinya atau beberapa orang dengan membawa keledai liar, lalu (Rasulullah Shallallahu'alaihiwasallam) menolaknya. Lalu bersabda: \"Kami sedang berihram, kami tidak boleh makan hewan buruan.\""
            },
            {
                "number": 1243,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ عَنِ ابْنِ عَبَّاسٍ عَنِ الصَّعْبِ بْنِ جَثَّامَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا حِمَى إِلَّا لِلَّهِ وَرَسُولِهِ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepada kami [Muhammad bin Abu Bakar] berkata; telah menceritakan kepada kami [Hammad bin Zaid] berkata; telah menceritakan kepada kami ['Amr bin Dinar] dari [Ibnu Abbas] dari [Ash-Sha'b bin Jatsamah] sesungguhnya Rasulullah Shallallahu'alaihiwasallam bersabda: \" Tidak ada hima (larangan yang harus dijauhi oleh seorang muslim) kecuali hima yang ditetapkan oleh Allah dan Rasul-Nya\"."
            },
            {
                "number": 1244,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ قَالَ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ عَنِ ابْنِ عَبَّاسٍ عَنِ الصَّعْبِ بْنِ جَثَّامَةَ قَالَأُوتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِوَدَّانَ بِحِمَارِ وَحْشٍ فَرَدَّهُ وَقَالَ إِنَّا حُرُمٌ لَا نَأْكُلُ الصَّيْدَ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku [Muhammad bin Abu Bakar] berkata; telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami ['Amr bin Dinar] dari [Ibnu Abbas] dari [Ash-Sha'b bin Jatsamah] berkata; Rasulullah Shallallahu'alaihiwasallam diberi keledai liar pada saat di Waddan, lalu beliau menolaknya dan bersabda: \"Kami sedang berihram, kami tidak boleh makan hewan buruan.\""
            },
            {
                "number": 1245,
                "arab": "حَدَّثَنَا عَامِرُ بْنُ صَالِحٍ الزُّبَيْرِيُّ سَنَةَ ثَمَانِينَ وَمِائَةٍ قَالَ حَدَّثَنِي يُونُسُ بْنُ يَزِيدَ عَنِ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنِ ابْنِ عَبَّاسٍ عَنِ الصَّعْبِ بْنِ جَثَّامَةَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا حِمَى إِلَّا لِلَّهِ وَلِرَسُولِهِ",
                "id": "Telah menceritakan kepada kami ['Amir bin Shalih Az Zubairi] tahun seratus delapan puluh, berkata; telah menceritakan kepadaku [Yunus bin Yazid] dari [Ibnu Syihab] dari ['ubaidhullah bin Abdullah bin 'Utbah] dari [Ibnu Abbas] dari [Ash-Sha'b bin Jatsamah] saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \" Tidak ada hima (larangan yang harus dijauhi oleh seorang muslim) kecuali hima yang ditetapkan oleh Allah dan Rasul-Nya.\""
            },
            {
                "number": 1246,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنَا أَبُو أَحْمَدَ الْهَيْثَمُ بْنُ خَارِجَةَ قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي فَرْوَةَ عَنْ يُوسُفَ بْنِ سُلَيْمَانَ عَنْ جَدَّتِهِ مَيْمُونَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَنَّةَ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بَدَأَ الْإِسْلَامُ غَرِيبًا ثُمَّ يَعُودُ غَرِيبًا كَمَا بَدَأَ فَطُوبَى لِلْغُرَبَاءِ قِيلَ يَا رَسُولَ اللَّهِ وَمَنْ الْغُرَبَاءُ قَالَ الَّذِينَ يُصْلِحُونَ إِذَا فَسَدَ النَّاسُ وَالَّذِي نَفْسِي بِيَدِهِ لَيُحَازَنَّ الْإِيمَانُ إِلَى الْمَدِينَةِ كَمَا يَحُوزُ السَّيْلُ وَالَّذِي نَفْسِي بِيَدِهِ لَيَأْرِزَنَّ الْإِسْلَامُ إِلَى مَا بَيْنَ الْمَسْجِدَيْنِ كَمَا تَأْرِزُ الْحَيَّةُ إِلَى جُحْرِهَا",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepada kami [Abu Ahmad Al Haistami bin Kharijah] berkata; telah menceritakan kepada kami [Isma'il bin Ayyas] dari [Ishaq bin Abdullah bin Abu farwah] dari [Yusuf bin Sulaiman] dari [neneknya Maimunah] dari [Abdurrahman bin Sannah] sesungguhnya telah mendengar Nabi Shallallahu'alaihiwasallam bersabda: \"Islam datang dalam keadaan asing lalu akan kembali asing sebagaimana bermula, maka beruntunglah orang yang asing\". Ada yang bertanya, \"Wahai Rasulullah, siapakah orang yang asing itu?\" Beliau menjawab, \"Orang-orang yang berbuat baik jika manusia telah rusak. Demi jiwaku yang berada di tangan-Nya, sungguh iman itu akan masuk ke Madinah sebagaimana masuknya cairan. Demi Dzat yang jiwaku berada di tangan-Nya, sungguh Islam akan bersatu ke tempat antara dua masjid ini sebagaimana kembalinya ular ke lubangnya.\""
            },
            {
                "number": 1247,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا مُصْعَبُ بْنُ عَبْدِ اللَّهِ هُوَ الزُّبَيْرِيُّ قَالَ حَدَّثَنِي أَبِي عَنْ فَائِدٍ مَوْلَى عَبَادِلَ قَالَ خَرَجْتُ مَعَ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي رَبِيعَةَ فَأَرْسَلَ إِبْرَاهِيمُ بْنُ عَبْدِ الرَّحْمَنِ إِلَى ابْنِ سَعْدٍ حَتَّى إِذَا كُنَّا بِالْعَرْجِ أَتَى ابْنُ سَعْدٍ وَسَعْدٌ هُوَ الَّذِي دَلَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى طَرِيقِ رَكُوبِهِ فَقَالَ إِبْرَاهِيمُ أَخْبِرْنِي مَا حَدَّثَكَ أَبُوكَ قَالَ ابْنُ سَعْدٍ حَدَّثَنِي أَبِيأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَاهُمْ وَمَعَهُ أَبُو بَكْرٍ وَكَانَتْ لِأَبِي بَكْرٍ عِنْدَنَا بِنْتٌ مُسْتَرْضَعَةٌ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرَادَ الِاخْتِصَارَ فِي الطَّرِيقِ إِلَى الْمَدِينَةِ فَقَالَ لَهُ سَعْدٌ هَذَا الْغَائِرُ مِنْ رَكُوبَةٍ وَبِهِ لِصَّانِ مِنْ أَسْلَمَ يُقَالُ لَهُمَا الْمُهَانَانِ فَإِنْ شِئْتَ أَخَذْنَا عَلَيْهِمَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذْ بِنَا عَلَيْهِمَا قَالَ سَعْدٌ فَخَرَجْنَا حَتَّى أَشْرَفْنَا إِذَا أَحَدُهُمَا يَقُولُ لِصَاحِبِهِ هَذَا الْيَمَانِي فَدَعَاهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَرَضَ عَلَيْهِمَا الْإِسْلَامَ فَأَسْلَمَا ثُمَّ سَأَلَهُمَا عَنْ أَسْمَائِهِمَا فَقَالَا نَحْنُ الْمُهَانَانِ فَقَالَ بَلْ أَنْتُمَا الْمُكْرَمَانِ وَأَمَرَهُمَا أَنْ يَقْدَمَا عَلَيْهِ الْمَدِينَةَ فَخَرَجْنَا حَتَّى أَتَيْنَا ظَاهِرَ قُبَاءَ فَتَلَقَّى بَنُو عَمْرِو بْنِ عَوْفٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْنَ أَبُو أُمَامَةَ أَسْعَدُ بْنُ زُرَارَةَ فَقَالَ سَعْدُ بْنُ خَيْثَمَةَ إِنَّهُ أَصَابَ قَبْلِي يَا رَسُولَ اللَّهِ أَفَلَا أُخْبِرُهُ لَكَ ثُمَّ مَضَى حَتَّى إِذَا طَلَعَ عَلَى النَّخْلِ فَإِذَا الشَّرْبُ مَمْلُوءٌ فَالْتَفَتَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَقَالَ يَا أَبَا بَكْرٍ هَذَا الْمَنْزِلُ رَأَيْتُنِي أَنْزِلُ عَلَى حِيَاضٍ كَحِيَاضِ بَنِي مُدْلِجٍ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Mus'ab bin Abdullah Az Zubairi] berkata; telah menceritakan kepadaku [bapakku] dari [Fa`id], budak Abadil, berkata; saya telah keluar bersama Ibrahim bin Abdurrahman bin Abdullah bin Abu Rabi'ah lalu Ibrahim bin Abdurrahman mengutus pada Ibnu Sa'd sampai kami di Al Araj, Ibnu Sa'd datang dan Sa'd yang menunjukkan pada Rasulullah Shallallahu'alaihiwasallam jalan kendaraannya. Ibrahim berkata; \"Kabarkanlah kepadaku apa yang telah bapakmu ceritakan\". [Ibnu Sa'd] berkata; telah menceritakan kepadaku [bapakku] sesungguhnya Rasulullah Shallallahu'alaihiwasallam mendatangi mereka bersama dengan Abu Bakar. Abu Bakar memiliki seorang anak perempuan sesusuan pada kami, dan Rasulullah Shallallahu'alaihiwasallam hendak meringkas perjalanannya ke Madinah. Lalu Sa'd berkata kepadanya, tanah yang rendah ini termasuk dari jalan yang biasa dilalui, di dalamnya ada dua pencuri dari Aslam yang bernama Al Muhanani (orang yang diremehkan) jika anda mau, maka kami akan menangkapnya. Lalu Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tangkaplah keduanya.\" Sa'd berkata; \"Kami keluar sampai mendekatinya, ternyata salah seorang darinya berkata kepada temannya ini adalah orang Yaman, lalu Rasulullah Shallallahu'alaihiwasallam memanggil keduanya. Lantas keduanya ditawari Islam, mereka menerimanya. Lalu beliau menanyakan kepada keduanya tentang nama mereka. Mereka berdua berkata; \"Kami adalah Al Muhanani (orang yang sangat di remehkan) \" lalu beliau bersabda: \"Bahkan kalian adalah orang yang sangat dimuliakan\", lalu keduanya diperintahkan untuk datang ke Madinah. Lalu kami keluar sampai kami di Quba`, kami bertemu dengan Bani 'Amr bin 'Auf. Lalu Nabi Shallallahu'alaihiwasallam bersabda: \"Dimana Abu Umamah As'ad bin Zurarah?\" Lalu Sa'd bin Khaitsamah berkata; \"Sesungguhnya dia telah terkena musibah sebelumku Wahai Rasulullah, bukankah saya telah mengabari anda lalu telah berlalu\". Sampai dia muncul pada pohon kurma, ternyata tempat minumnya penuh, lalu Nabi Shallallahu'alaihiwasallam menoleh kepada Abu Bakar Radliyallahu'anhu, lalu bersabda: \"Wahai Abu Bakar, rumah ini, saya telah melihatnya dalam mimpiku, saya turun pada sebuah kolam seperti kolam Bani Mudlij.\""
            },
            {
                "number": 1248,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ قَالَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ عَنْ يَحْيَى بْنِ كَثِيرٍ الْكَاهِلِيِّ عَنْ مِسْوَرِ بْنِ يَزِيدَ الْأَسَدِيِّ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَرَكَ آيَةً فَقَالَ لَهُ رَجُلٌ يَا رَسُولَ اللَّهِ تَرَكْتَ آيَةَ كَذَا وَكَذَا قَالَ فَهَلَّا ذَكَّرْتَنِيهَا",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku [Suraij bin Yunus] berkata; telah menceritakan kepada kami [Marwan bin Mu'awiyah] dari [Yahya bin Katsir Al Kahili] dari [Miswar bin Yazid Al Asadi] berkata; Rasulullah Shallallahu'alaihiwasallam sholat dan meninggalkan satu ayat. Lalu ada seorang laki-laki yang berkata; Wahai Rasulullah, anda meninggalkan ayat ini dan ini. Beliau bersabda: Kenapa kamu tidak mengingatkanku padanya?.\""
            },
            {
                "number": 1249,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ مِنْ كِتَابِهِ قَالَ حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ يَعْنِي الْمُهَلَّبِيَّ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ سَعِيدِ بْنِ أَبِي رَاشِدٍ مَوْلًى لِآلِ مُعَاوِيَةَ قَالَقَدِمْتُ الشَّامَ فَقِيلَ لِي فِي هَذِهِ الْكَنِيسَةِ رَسُولُ قَيْصَرَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَدَخَلْنَا الْكَنِيسَةَ فَإِذَا أَنَا بِشَيْخٍ كَبِيرٍ فَقُلْتُ لَهُ أَنْتَ رَسُولُ قَيْصَرَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ نَعَمْ قَالَ قُلْتُ حَدِّثْنِي عَنْ ذَلِكَ قَالَ إِنَّهُ لَمَّا غَزَا تَبُوكَ كَتَبَ إِلَى قَيْصَرَ كِتَابًا وَبَعَثَ بِهِ مَعَ رَجُلٍ يُقَالُ لَهُ دِحْيَةُ بْنُ خَلِيفَةَ فَلَمَّا قَرَأَ كِتَابَهُ وَضَعَهُ مَعَهُ عَلَى سَرِيرِهِ وَبَعَثَ إِلَى بَطَارِقَتِهِ وَرُءُوسِ أَصْحَابِهِ فَقَالَ إِنَّ هَذَا الرَّجُلَ قَدْ بَعَثَ إِلَيْكُمْ رَسُولًا وَكَتَبَ إِلَيْكُمْ كِتَابًا يُخَيِّرُكُمْ إِحْدَى ثَلَاثٍ إِمَّا أَنْ تَتَّبِعُوهُ عَلَى دِينِهِ أَوْ تُقِرُّوا لَهُ بِخَرَاجٍ يَجْرِي لَهُ عَلَيْكُمْ وَيُقِرَّكُمْ عَلَى هَيْئَتِكُمْ فِي بِلَادِكُمْ أَوْ أَنْ تُلْقُوا إِلَيْهِ بِالْحَرْبِ قَالَ فَنَخَرُوا نَخْرَةً حَتَّى خَرَجَ بَعْضُهُمْ مِنْ بَرَانِسِهِمْ وَقَالُوا لَا نَتَّبِعُهُ عَلَى دِينِهِ وَنَدَعُ دِينَنَا وَدِينَ آبَائِنَا وَلَا نُقِرُّ لَهُ بِخَرَاجٍ يَجْرِي لَهُ عَلَيْنَا وَلَكِنْ نُلْقِي إِلَيْهِ الْحَرْبَ فَقَالَ قَدْ كَانَ ذَاكَ وَلَكِنِّي كَرِهْتُ أَنْ أَفْتَاتَ دُونَكُمْ بِأَمْرٍ قَالَ عَبَّادٌ فَقُلْتُ لِابْنِ خُثَيْمٍ أَوَلَيْسَ قَدْ كَانَ قَارَبَ وَهَمَّ بِالْإِسْلَامِ فِيمَا بَلَغَنَا قَالَ بَلَى لَوْلَا أَنَّهُ رَأَى مِنْهُمْ قَالَ فَقَالَ ابْغُونِي رَجُلًا مِنْ الْعَرَبِ أَكْتُبْ مَعَهُ إِلَيْهِ جَوَابَ كِتَابِهِ قَالَ فَأَتَيْتُ وَأَنَا شَابٌّ فَانْطُلِقَ بِي إِلَيْهِ فَكَتَبَ جَوَابَهُ وَقَالَ لِي مَهْمَا نَسِيتَ مِنْ شَيْءٍ فَاحْفَظْ عَنِّي ثَلَاثَ خِلَالٍ انْظُرْ إِذَا هُوَ قَرَأَ كِتَابِي هَلْ يَذْكُرُ اللَّيْلَ وَالنَّهَارَ وَهَلْ يَذْكُرُ كِتَابَهُ إِلَيَّ وَانْظُرْ هَلْ تَرَى فِي ظَهْرِهِ عَلَمًا قَالَ فَأَقْبَلْتُ حَتَّى أَتَيْتُهُ وَهُوَ بِتَبُوكَ فِي حَلْقَةٍ مِنْ أَصْحَابِهِ مُحْتَبِينَ فَسَأَلْتُ فَأُخْبِرْتُ بِهِ فَدَفَعْتُ إِلَيْهِ الْكِتَابَ فَدَعَا مُعَاوِيَةَ فَقَرَأَ عَلَيْهِ الْكِتَابَ فَلَمَّا أَتَى عَلَى قَوْلِهِ دَعَوْتَنِي إِلَى جَنَّةٍ عَرْضُهَا السَّمَوَاتُ وَالْأَرْضُ فَأَيْنَ النَّارُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَاءَ اللَّيْلُ فَأَيْنَ النَّهَارُ قَالَ فَقَالَ إِنِّي قَدْ كَتَبْتُ إِلَى النَّجَاشِيِّ فَخَرَّقَهُ فَخَرَّقَهُ اللَّهُ مُخَرَّقَ الْمُلْكِ قَالَ عَبَّادٌ فَقُلْتُ لِابْنِ خُثَيْمٍ أَلَيْسَ قَدْ أَسْلَمَ النَّجَاشِيُّ وَنَعَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ إِلَى أَصْحَابِهِ فَصَلَّى عَلَيْهِ قَالَ بَلَى ذَاكَ فُلَانُ بْنُ فُلَانٍ وَهَذَا فُلَانُ بْنُ فُلَانٍ قَدْ ذَكَرَهُمْ ابْنُ خُثَيْمٍ جَمِيعًا وَنَسِيتُهُمَا وَكَتَبْتُ إِلَى كِسْرَى كِتَابًا فَمَزَّقَهُ فَمَزَّقَهُ اللَّهُ تَمْزِيقَ الْمُلْكِ وَكَتَبْتُ إِلَى قَيْصَرَ كِتَابًا فَأَجَابَنِي فِيهِ فَلَمْ تَزَلْ النَّاسُ يَخْشَوْنَ مِنْهُمْ بَأْسًا مَا كَانَ فِي الْعَيْشِ خَيْرٌ ثُمَّ قَالَ لِي مَنْ أَنْتَ قُلْتُ مِنْ تَنُوخٍ قَالَ يَا أَخَا تَنُوخٍ هَلْ لَكَ فِي الْإِسْلَامِ قُلْتُ لَا إِنِّي أَقْبَلْتُ مِنْ قِبَلِ قَوْمٍ وَأَنَا فِيهِمْ عَلَى دِينٍ وَلَسْتُ مُسْتَبْدِلًا بِدِينِهِمْ حَتَّى أَرْجِعَ إِلَيْهِمْ قَالَ فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ تَبَسَّمَ فَلَمَّا قَضَيْتُ حَاجَتِي قُمْتُ فَلَمَّا وَلَّيْتُ دَعَانِي فَقَالَ يَا أَخَا تَنُوخٍ هَلُمَّ فَامْضِ لِلَّذِي أُمِرْتَ بِهِ قَالَ وَكُنْتُ قَدْ نَسِيتُهَا فَاسْتَدَرْتُ مِنْ وَرَاءِ الْحَلْقَةِ وَيَلْقَى بُرْدَةً كَانَتْ عَلَيْهِ عَنْ ظَهْرِهِ فَرَأَيْتُ غُضْرُوفَ كَتِفِهِ مِثْلَ الْمِحْجَمِ الضَّخْمِحَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنِي أَبُو عَامِرٍ حَوْثَرَةُ بْنُ أَشْرَسَ إِمْلَاءً عَلَىَّ قَالَ أَخْبَرَنِي حَمَّادُ بْنُ سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ سَعِيدِ بْنِ أَبِي رَاشِدٍ قَالَ كَانَ رَسُولُ قَيْصَرَ جَارًا لِي زَمَنَ يَزِيدَ بْنِ مُعَاوِيَةَ فَقُلْتُ لَهُ أَخْبِرْنِي عَنْ كِتَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى قَيْصَرَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْسَلَ دِحْيَةَ الْكَلْبِيَّ إِلَى قَيْصَرَ وَكَتَبَ مَعَهُ إِلَيْهِ كِتَابًا فَذَكَرَ نَحْوَ حَدِيثِ عَبَّادِ بْنِ عَبَّادٍ وَحَدِيثُ عَبَّادٍ أَتَمُّ وَأَحْسَنُ اقْتِصَاصًا لِلْحَدِيثِ وَزَادَ قَالَ فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ دَعَاهُ إِلَى الْإِسْلَامِ فَأَبَى أَنْ يُسْلِمَ وَتَلَا هَذِهِ الْآيَةَ{ إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ }ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّكَ رَسُولُ قَوْمٍ وَإِنَّ لَكَ حَقًّا وَلَكِنْ جِئْتَنَا وَنَحْنُ مُرْمِلُونَ فَقَالَ عُثْمَانُ بْنُ عَفَّانَ أَنَا أَكْسُوهُ حُلَّةً صَفُورِيَّةً وَقَالَ رَجُلٌ مِنْ الْأَنْصَارِ عَلَيَّ ضِيَافَتُهُ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku [Suraij bin Yunus] dari kitabnya, berkata; telah menceritakan kepada kami ['Abbad bin 'Abbad] yaitu Al Muhallabi, dari [Abdullah bin 'Utsman bin Khutsaim] dari [Sa'id bin Abu Rasyid] budak keluarga Mu'awiyah berkata; saya datang ke Syam, lalu ada diberitahukan kepadaku 'Dalam gereja itu ada seorang [utusan Kaisar] kepada Rasulullah Shallallahu'alaihiwasallam. (Sa'id bin Abu Rasyid Radliyallahu'anhu) berkata; lalu kami memasuki gereja tersebut, ternyata saya mendapati seorang yang sudah tua berbadan besar, lalu saya berkata kepadanya, \"Apakah kamu adalah utusan Kaisar kepada Rasulullah Shallallahu'alaihiwasallam?\" Maka dia menjawab, Ya. (Sa'id bin Abu Rasyid Radliyallahu'anhu) berkata; ceritakan kepadaku tentang hal itu! Dia berkata; tatkala terjadi Perang Tabuk, Rasulullah menulis surat kepada Kaisar, sebuah surat lalu dikirimkan bersama dengan seorang utusan yang bernama Dihyah bin Khalifah, tatkala (Kaisar) membaca surat beliau, dia meletakkannya di atas tempat tidurnya, lalu dia mengutus kepada para pendetanya dan para tokohnya dari kalangan sahabatnya, lalu berkata; \"Orang ini telah diutus kepada kalian, menulis kepada kalian sebuah surat, agar kalian memilih tiga hal: Pertama, kalian mengikutinya dan mengikuti agamanya, kedua, atau kalian menentukan pajak yang menjadi hak mereka dan menjadi kewajiban kalian dan menetapkan agar kalian tetap tinggal pada negeri kalian, ketiga, atau kalian memeranginya\". Lalu mereka murka dengan sangat sampai sebagian mereka melepaskan pakaiannya dan berkata; \"Kami tidak akan ikut dia dan agamanya, lalu kami meninggalkan agama kita dan agama nenek moyang kita, kami tidak mau membayar pajak kepada dia, tapi kita berperang saja melawan mereka\". Maka dia menjawab, \"Saya juga menghendaki hal itu, tapi saya sangat benci jika memberi fatwa pada orang selain kalian pada urusan ini.\" 'Abbad berkata; lalu saya berkata kepada Ibnu Khutsaim, \"Bukankah dia telah berusaha dan hendak masuk Islam, menurut kabar yang sampai kepada kami?\". Dia menjawab, \"Ya. seandainya saja dia tidak melihat kepada pendapat yang lainnya.\" Lalu (Kaisar) berkata; \"Carilah seorang laki-laki dari Arab, saya akan menuliskan kepadanya jawaban surat.\" (Sa'id bin Abu Rasyid Radliyallahu'anhu) berkata; lalu saya menemuinya waktu itu saya masih muda, lalu saya menuju ke tempatnya, dia menulis jawabannya. Dia berkata kepadaku, \"Walaupun kamu bisa lupa terhadap sesuatu, tapi ingatlah dariku tiga ciri: Lihatlah jika dia (Rasulullah Shallallahu'alaihiwasallam) membaca suratku, apakah dia menyebutkan malam dan siang, apakah dia menyebutkan suratnya kepadaku, dan lihatlah apakah pada punggungnya ada suatu tanda.\" (Sa'id bin Abu Rasyid Radliyallahu'anhu) berkata; Lalu saya pergi sehingga saya dapat menemui dia. Saat itu beliau sedang berada di Tabuk pada suatu halaqah dengan para sahabatnya dalam keadaan duduk bersila, lalu saya menanyakannya, lalu ada yang memberitahukannya, lalu saya serahkan surat kepadanya, beliau memanggil Mu'awiyah, untuk membacakannya surat tesebut. Tatkala sampai pada kalimat, 'Kamu menyerukan kepadaku untuk menuju surga yang luasnya seluas langit dan bumi, lalu di mana neraka'. Rasulullah Shallallahu'alaihiwasallam bersabda: \"Jika datang malam, di manakah siang?\" lalu beliau bersabda: \"Sesungguhnya saya telah menulis surat kepada Najasyi, lalu dia membakarnya, maka Allah membakarnya sehingga binasalah kerajaannya\". 'Abbad berkata; lalu saya bertanya kepada Ibnu Khutsaim, bukankah Najasyi telah masuk Islam dan Rasulullah Shallallahu'alaihiwasallam telah mengumumkan kematiannya di Madinah kepada para sahabatnya, lalu beliau sholat atasnya. Dia menjawab, Ya, itu adalah Fulan bin Fulan, namun ini adalah Fulan bin Fulan. Ibnu Khutsaim menyebutkanya semuanya dan saya lupa, \"Lalu saya (Rasulullah Shallallahu'alaihiwasallam) menulis kepada Kisra sebuah surat, lalu dia merobeknya, maka Allah merobek-robek kerajaannya dengan sangat dahsat, lalu saya menulis kepada Kaisar sebuah surat lalu dia menjawabnya, maka orang-orang tetap takut dari mereka dengan bahayanya selama hidupnya ada kebaikan\", lalu beliau bertanya kepadaku, \"Siapa kamu?\" Saya menjawab, Saya berasal dari Tanukh. Lalu beliau bersabda: \"Wahai orang Tanukh, apakah kamu telah masuk Islam?\"saya menjawab, \"Tidak. Sesungguhnya saya datang dari suatu kaum saya yang sudah berada di dalamnya, mereka dalam suatu agama dan saya tidak akan mengganti agama mereka sampai saya kembali kepada mereka.\" (Sa'id bin Abu Rasyid RA) berkata; lalu Rasulullah Shallallahu'alaihiwasallam tertawa atau tersenyum. Tatkala saya telah menyelesaikan urusanku, lalu saya bangun. Tatkala saya sudah meninggalkan tempat itu, beliau memanggilku, lalu bersabda: \"Wahai orang Tanukh, dengarkanlah dulu lalu pergilah sesuai dengan apa yang diperintahkan kepadamu\" (Sa'id bin Abu Rasyid RA) berkata; \"Saya telah lupa, lalu saya melihat dari belakang lingkaran dan beliau memberikan kepadaku mantel yang sedang beliau pakai\". Lalu say adapat melihat tulang lunak ada keitakanya seperti sutu lingkaran yang agak besar.\" Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku [Abu 'Amir, Hautsarah bin Asyras], secara dikte kepadaku, berkata; telah mengabarkan kepadaku [Hammad bin Salamah bin Abdullah bin 'Utsman bin Khutsaim] dari [Sa'id bin Abu Rasyid] berkata; \"Utusan Kaisar adalah seorang tetanggaku pada masa Yazid bin Mu'awiyah, lalu saya berkata kepadanya, 'kabarkanlah kepadaku tentang surat Rasulullah Shallallahu'alaihiwasallam kepada Kaisar', lalu dia berkata; \"Sesungguhnya Rasulullah Shallallahu'alaihiwasallam mengutus Dihyah Al Kalbi kepada Kaisar dengan menjawab surat kepadanya\", lalu menyebutkan sama dengan hadits 'Abad bin 'Abad dan hadits 'Abad lebih lengkap dan lebih bagus kisahnya dengan tambahan, \"Lalu Rasulullah Shallallahu'alaihiwasallam tertawa ketika dia mengajaknya kepada Islam, lalu dia menolaknya. lalu beliau membaca ayat ini: Sesungguhnya kamu tidak akan dapat memberi petunjuk kepada orang yang kamu kasihi, tetapi Allah memberi petunjuk kepada orang yang dikehendaki-Nya Kemudian Rasulullah Shallallahu'alaihiwasallam bersabda: \"Sesungguhnya kamu adalah utusan sebuah kaum, sesungguhnya ada pada dirimu hak, tapi kau datang kepada kami dan kami dalam keadaan kekurangan bekal kami. Lalu 'Utsman bin 'Affan berkata; \"Saya yang akan memberikannya perhiasan yang bagus\", ada seorang laki-laki dari Anshar berkata; \"Saya yang akan menyambutnya.\""
            },
            {
                "number": 1250,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ قَالَ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي زِيَادٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ كَثِيرٍ الدَّارِيُّ عَنْ مُجَاهِدٍ قَالَ حَدَّثَنَا شَيْخٌ أَدْرَكَ الْجَاهِلِيَّةَ وَنَحْنُ فِي غَزْوَةِ رُودِسَ يُقَالُ لَهُ ابْنُ عَبْسٍ قَالَكُنْتُ أَسُوقُ لِآلٍ لَنَا بَقَرَةً قَالَ فَسَمِعْتُ مِنْ جَوْفِهَا يَا آلَ ذَرِيحٍ قَوْلٌ فَصِيحٌ رَجُلٌ يَصِيحُ لَا إِلَهَ إِلَّا اللَّهُ قَالَ فَقَدِمْنَا مَكَّةَ فَوَجَدْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ خَرَجَ بِمَكَّةَ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Muhammad bin Bakar Al Bursani] berkata; telah mengabarkan kepada kami ['ubaidhullah bin Abu Ziyad] berkata; telah menceritakan kepadaku [Abdullah bin Katsir Ad-Dari] dari [Mujahid] berkata; telah menceritakan kepada kami seorang yang sudah tua yang mengalami masa Jahiliyyah, dan kami dalam Perang Rudis, yang bernama [Ibnu 'Abbas], berkata; saya sedang menggiring sapi milik keluarga kami. Dia berkata; lalu saya mendengar dari lubang tengahnya, \"Wahai Keluarga Dzuraih\" suara yang sangat lantang yaitu suara seorang yang menyerukan, LA ILAHA ILLA ALLAH (tidak ada tuhan selain Allah) \" (Ibnu Abs RA) berkata; tatkala kami sampai di Makkah, kami mendapatkan Nabi Shallallahu'alaihiwasallam telah keluar di dalamnya."
            },
            {
                "number": 1251,
                "arab": "قَالَ عَبْد اللَّهِ حَدَّثَنِي أَبُو مُوسَى الْعَنْزِيُّ قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ قَالَ حَدَّثَنِي سَكَنُ بْنُ الْمُغِيرَةِ قَالَ حَدَّثَنِي الْوَلِيدُ بْنُ أَبِي هِشَامٍ عَنْ فَرْقَدٍ أَبِي طَلْحَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ خَبَّابٍ السُّلَمِيِّ قَالَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَثَّ عَلَى جَيْشِ الْعُسْرَةِ فَقَالَ عُثْمَانُ بْنُ عَفَّانَ عَلَيَّ مِائَةُ بَعِيرٍ بِأَحْلَاسِهَا وَأَقْتَابِهَا قَالَ ثُمَّ حَثَّ فَقَالَ عُثْمَانُ عَلَيَّ مِائَةٌ أُخْرَى بِأَحْلَاسِهَا وَأَقْتَابِهَا قَالَ ثُمَّ نَزَلَ مَرْقَاةً مِنْ الْمِنْبَرِ ثُمَّ حَثَّ فَقَالَ عُثْمَانُ بْنُ عَفَّانَ عَلَيَّ مِائَةٌ أُخْرَى بِأَحْلَاسِهَا وَأَقْتَابِهَا قَالَ فَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِيَدِهِ هَكَذَا يُحَرِّكُهَاوَأَخْرَجَ عَبْدُ الصَّمَدِ يَدَهُ كَالْمُتَعَجِّبِ مَا عَلَى عُثْمَانَ مَا عَمِلَ بَعْدَ هَذَا قَالَ عَبْد اللَّهِ حَدَّثَنِي أَبُو مُوسَى الْعَنَزِيُّ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ حَدَّثَنَا سَكَنُ بْنُ الْمُغِيرَةِ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ هِشَامٍ عَنْ أَبِي طَلْحَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ خَبَّابٍ السُّلَمِيِّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ فَحَضَّ عَلَى جَيْشِ الْعُسْرَةِ فَذَكَرَهُ",
                "id": "Abdullah berkata; telah menceritakan kepadaku [Abu Musa Al 'Anazi] berkata; telah menceritakan kepada kami [Abdushshomad bin Abdul Warits] berkata; telah menceritakan kepadaku [Sakan bin Al Mughirah] berkata; telah menceritakan kepadaku [Al Walid bin Abu Hisyam] dari [Farqad Abu Thalhah] dari [Abdurrahman bin Khabbab As-Sulami] berkata; Rasulullah Shallallahu'alaihiwasallam keluar lalu beliau menyemangati pada pasukan Perang 'Usrah. Lalu 'Utsman bin 'Affan berkata; saya akan memberikan seratus unta lengkap dengan perhiasan dan pelananya. (Abdurrahman bin Khabbab As-Sulami radliyallahu'anhu) berkata; lalu beliau menyemangati lagi, lalu 'Utsman berkata; saya tambah seratus lagi lengkap dengan perhiasan dan pelananya. (Abdurrahman bin Khabbab As-Sulami radliyallahu'anhu) berkata; lalu beliau turun dari satu tingkat tingkat dari mimbar, lalu menyemangati lagi. Lalu 'Utsman bin 'Affan berkata; saya tambah seratus lagi lengkap dengan perhiasan dan pelananya. (Abdurrahman bin Khabbab As-Sulami radliyallahu'anhu) berkata; lalu saya melihat Nabi Shallallahu'alaihiwasallam bersabda dengan tangannya, begini dengan mengerakkannya. Abdushshamad mengeluarkan tangannya layaknya orang yang kaget atas apa yang telah dilakukan 'Utsman dan apa yang telah dia lakukan setelahnya. Abdullah berkata; telah menceritakan kepadaku [Abu Musa Al 'Anazi] berkata; telah menceritakan kepada kami ['Utsman bin 'Umar] berkata; telah menceritakan kepada kami [Sakan bin Al Mugirah] berkata; telah menceritakan kepada kami [Al Walid bin Hisyam] dari [Abu Thalhah] dari [Abdurrahman bin Khabbab As-Sulami] berkata; saya telah melihat Rasulullah Shallallahu'alaihiwasallam berkhutbah lalu memberi semangat pada pasukan Al 'Usrah, lalu menyebutkan hadits secara lengkap."
            },
            {
                "number": 1252,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنِي أَبُو مُوسَى الْعَنَزِيُّ مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ عَنِ ابْنِ عَوْنٍ عَنْ كُلْثُومِ بْنِ جَبْرٍ قَالَكُنَّا بِوَاسِطِ الْقَصَبِ عِنْدَ عَبْدِ الْأَعْلَى بْنِ عَبْدِ اللَّهِ بْنِ عَامِرٍ قَالَ فَإِذَا عِنْدَهُ رَجُلٌ يُقَالُ لَهُ أَبُو الْغَادِيَةِ اسْتَسْقَى مَاءً فَأُتِيَ بِإِنَاءٍ مُفَضَّضٍ فَأَبَى أَنْ يَشْرَبَ وَذَكَرَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ هَذَا الْحَدِيثَ لَا تَرْجِعُوا بَعْدِي كُفَّارًا أَوْ ضُلَّالًا شَكَّ ابْنُ أَبِي عَدِيٍّ يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ فَإِذَا رَجُلٌ يَسُبُّ فُلَانًا فَقُلْتُ وَاللَّهِ لَئِنْ أَمْكَنَنِي اللَّهُ مِنْكَ فِي كَتِيبَةٍ فَلَمَّا كَانَ يَوْمُ صِفِّينَ إِذَا أَنَا بِهِ وَعَلَيْهِ دِرْعٌ قَالَ فَفَطِنْتُ إِلَى الْفُرْجَةِ فِي جُرُبَّانِ الدِّرْعِ فَطَعَنْتُهُ فَقَتَلْتُهُ فَإِذَا هُوَ عَمَّارُ بْنُ يَاسِرٍ قَالَ قُلْتُ وَأَيَّ يَدٍ كَفَتَاهُ يَكْرَهُ أَنْ يَشْرَبَ فِي إِنَاءٍ مُفَضَّضٍ وَقَدْ قَتَلَ عَمَّارَ بْنَ يَاسِرٍ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku [Abu Musa Al 'Anazi, Muhammad bin Al Mutsanna] berkata; telah menceritakan kepada kami [Muhammad bin Abu 'Adi] dari [Ibnu 'Aun] dari [Kultsum bin Jabar] berkata; kami sedang berada pada tengah bambu, di sisi Abdul A'la bin Abdullah bin 'Amir, berkata; ternyata ada seorang laki-laki yang bernama [Abu Al Ghadiyah] yang sedang meminta air, lalu ia diberi bejana yang disepuh dengan perak, dia menolak untuk meminumnya, dan dia menyebutkan Nabi Shallallahu'alaihiwasallam, lalu menyebutkan hadits ini, \"Janganlah kalian kembali kufur setelahku\", atau dengan redaksi \" Jangan kalian kembali sesat sepeninggalkau\" Ibnu Abu 'Adi ragu kepastian redaksinya.\"Sebagian kalian memukul leher sebagian yang lain.\" Jika ada seorang laki-laki yang mencela fulan maka saya katakan, Demi Allah, semoga Allah memberi tempat darimu di dalam sebuah pasukan Perang. Maka tatkala Perang Shiffin, saya bersamanya dan dia membawa baju besi. (Abu Ghadiyah Radliyallahu'anhu) berkata; lalu saya ingatkan dia ke lubang dalam sarung pedang pada baju besinya, lalu saya tusuk dan saya bunuh ternyata dia adalah 'Ammar bin Yasir. (Abu Ghadiyah Radliyallahu'anhu) berkata; lalu saya berkata; tangan mana yang bisa mengantikannya, membenci untuk minum dalam bejana disepuh dengan perak padahal telah membunuh 'Ammar bin Yasir."
            },
            {
                "number": 1253,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ قَالَ حَدَّثَنَا رَبِيعَةُ بْنُ كُلْثُومٍ قَالَ حَدَّثَنِي أَبِي عَنْ أَبِي غَادِيَةَ الْجُهَنِيِّ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْعَقَبَةِ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ عَلَيْكُمْ حَرَامٌ إِلَى أَنْ تَلْقَوْا رَبَّكُمْ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا أَلَا هَلْ بَلَّغْتُ قَالُوا نَعَمْ قَالَ اللَّهُمَّ هَلْ بَلَّغْتُحَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنِي رَبِيعَةُ قَالَ حَدَّثَنِي أَبِي قَالَ سَمِعْتُ أَبَا غَادِيَةَ الْجُهَنِيَّ قَالَ بَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْعَقَبَةِ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ دِمَاءَكُمْ فَذَكَرَ مِثْلَهُ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Abdushshamad bin Abdul Warits] berkata; telah menceritakan kepada kami [Rabi'ah bin Kultsum] berkata; telah menceritakan kepadaku [bapakku] dari [Abu Ghaidah Al Juhani] berkata; Rasulullah Shallallahu'alaihiwasallam berkhutbah kepada kami pada peristiwa 'Aqabah, lalu bersabda: \"Wahai manusia, sesungguhnya darah dan harta kalian, atas kalian adalah haram sampai kalian menjumpai Rab kalian, sebagaimana keharaman hari kalian ini, pada negeri kalian ini, pada bulan kalian ini. Ketahuilah, bukankah saya sudah sampaikan?.\" Mereka menjawab, Ya. Beliau bersabda: \"Ya Allah, sudah saya sampaikan\". Telah menceritakan kepada kami ['Affan] berkata; telah menceritakan kepadaku [Rabi'ah] berkata; telah menceritakan kepadaku [bapakku] berkata; saya telah mendengar [Abu Ghaifah Al Juhani] berkata; saya telah bebaiat kepada Rasulullah Shallallahu'alaihiwasallam pada Peristiwa 'Aqabah, lalu bersabda: \"Wahai manusia, sesungguhnya darah kalian, \" lalu menyebutkan hadits yang sama."
            },
            {
                "number": 1254,
                "arab": "قَالَ حَدَّثَنِي الصَّلْتُ بْنُ مَسْعُودٍ الْجَحْدَرِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الطُّفَاوِيُّ قَالَ سَمِعْتُ الْعَاصِ بْنَ عَمْرٍو الطُّفَاوِيَّ قَالَخَرَجَ أَبُو الْغَادِيَةِ وحَبِيبُ بْنُ الْحَارِثِ وَأُمُّ أَبِي الْعَالِيَةِ مُهَاجِرِينَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْلَمُوا فَقَالَتْ الْمَرْأَةُ أَوْصِنِي يَا رَسُولَ اللَّهِ قَالَ إِيَّاكِ وَمَا يَسُوءُ الْأُذُنَ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepadaku [As-Shalt bin Mas'ud Al Jahdari], berkata; telah menceritakan kepada kami [Muhammad bin Abdurrahman Ath-Thufawi] berkata; saya telah mendengar [Al Ash bin 'Amr Ath-Thufawi] berkata; Abu Al Ghadiyah, Habib bin Al Harits dan Umu Abu Al 'Aliyah keluar dalam rangka berhijrah kepada Rasulullah Shallallahu'alaihiwasallam lalu mereka masuk Islam. wanita itu berkata; \"Berilah aku wasiat Wahai Rasulullah, \" Beliau bersabda: \"Hindarilah kamu hAl hal yang mengganggu telinga.\""
            },
            {
                "number": 1255,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارٍ مَوْلَى بَنِي هَاشِمٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنِ الْأَعْمَشِ عَنْ يَعْقُوبَ بْنِ بَحِيرٍ عَنْ ضِرَارِ بْنِ الْأَزْوَرِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ وَهُوَ يَحْلِبُ فَقَالَ دَعْ دَاعِيَ اللَّبَنِ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepada kami [Muhammad bin Bakar] budak Bani Hasyim, berkata; telah menceritakan kepada kami [Abdullah bin Al Mubarak] dari [Al A'masy] dari [Ya'qub bin Bahir] dari [Dlirar bin Al Azwar] sesungguhnya Nabi Shallallahu'alaihiwasallam melewatinya dan waktu itu dia sedang memeras, maka beliau bersabda: \"Sisakanlah untuk orang yang meminta susu\"."
            },
            {
                "number": 1256,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنَا أَبُو بَكْرِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ جَارُنَا قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَعِيدٍ الْبَاهِلِيُّ الْأَثْرَمُ الْبَصْرِيُّ قَالَ حَدَّثَنَا سَلَّامُ بْنُ سُلَيْمَانَ الْقَارِئُ قَالَ حَدَّثَنَا عَاصِمُ بْنُ بَهْدَلَةَ عَنْ أَبِي وَائِلٍ عَنْ ضِرَارِ بْنِ الْأَزْوَرِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ امْدُدْ يَدَكَ أُبَايِعْكَ عَلَى الْإِسْلَامِ قَالَ ضِرَارٌ ثُمَّ قُلْتُ تَرَكْتُ الْقِدَاحَ وَعَزْفَ الْقِيَانِوَالْخَمْرَ تَصْلِيَةً وَابْتِهَالَاوَكَرِّي الْمُحَبَّرَ فِي غَمْرَةٍوَحَمْلِي عَلَى الْمُشْرِكِينَ الْقِتَالَافَيَا رَبِّ لَا أُغْبَنَنْ صَفْقَتِيفَقَدْ بِعْتُ مَالِي وَأَهْلِي ابْتِدَالَافَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا غُبِنَتْ صَفْقَتُكَ يَا ضِرَارُ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepada kami [Abu Bakar Muhammad bin Abdullah] salah seorang tetangga kami, berkata; telah menceritakan kepada kami [Muhammad bin Sa'id Al Bahili Al Atsram Al Bashri] berkata; telah menceritakan kepada kami [Sallam bin Sulaiman Al Qari`] berkata; telah menceritakan kepada kami ['Ashim bin Bahdalah] dari [Abu Wa`il] dari [Dlirar bin Al Azwar] berkata; saya menemui Rasulullah Shallallahu'alaihiwasallam lalu saya berkata; \"Bentangkanlah tangan anda, saya hendak berbaiat kepada anda atas Islam\" Dlirar berkata; \"Telah saya tinggalkan periuk minum-minuman dan nyanyian penyanyi, arak hibur-hiburan dan kesombongan, kembalikanlah mantel pertempuranku, bekalku untuk perang kepada orang musyrik, Wahai tuhanku, tidak akan hilang juAl beliku, saya telah menjual harta dan keluargaku sebagai gantinya\". Lalu Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidak akan hilang jual belimu, Wahai Dlirar!\""
            },
            {
                "number": 1257,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ يَعْقُوبَ بْنِ بَحِيرٍ عَنْ ضِرَارِ بْنِ الْأَزْوَرِ قَالَبَعَثَنِي أَهْلِي بِلَقُوحٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَنِي أَنْ أَحْلِبَهَا فَحَلَبْتُهَا فَقَالَ دَعْ دَاعِيَ اللَّبَنِ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku [Muhammad bin Abdullah bin Numair] berkata; telah menceritakan kepada kami [Waki'] berkata; telah menceritakan kepada kami [Al A'masy] dari [Ya'qub bin Bahir] dari [Dlirar bin Al Azwar] berkata; keluargaku mengutusku dengan membawa unta yang hampir melahirkan kepada Nabi Shallallahu'alaihiwasallam, lalu beliau menyuruhku untuk memerahnya. Saya memerahnya dan bersabda: \"Sisakanlah untuk orang yang meminta susu\"."
            },
            {
                "number": 1258,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي أَبُو صَالِحٌ الْحَكَمُ بْنُ مُوسَى قَالَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ عَنْ الْأَعْمَشِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنِ الْمُغِيرَةِ بْنِ سَعْدٍ عَنْ أَبِيهِ أَوْ عَنْ عَمِّهِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَةَ فَأَخَذْتُ بِزِمَامِ نَاقَتِهِ أَوْ بِخِطَامِهَا فَدَفَعْتُ عَنْهُ فَقَالَ دَعُوهُ فَأَرَبٌ مَا جَاءَ بِهِ فَقُلْتُ نَبِّئْنِي بِعَمَلٍ يُقَرِّبُنِي إِلَى الْجَنَّةِ وَيُبْعِدُنِي مِنْ النَّارِ قَالَ فَرَفَعَ رَأْسَهُ إِلَى السَّمَاءِ ثُمَّ قَالَ لَئِنْ كُنْتَ أَوْجَزْتَ فِي الْخُطْبَةِ لَقَدْ أَعْظَمْتَ أَوْ أَطْوَلْتَ تَعْبُدُ اللَّهَ لَا تُشْرِكُ بِهِ شَيْئًا وَتُقِيمُ الصَّلَاةَ وَتُؤْتِي الزَّكَاةَ وَتَحُجُّ الْبَيْتَ وَتَصُومُ رَمَضَانَ وَتَأْتِي إِلَى النَّاسِ مَا تُحِبُّ أَنْ يُؤْتُوهُ إِلَيْكَ وَمَا كَرِهْتَ لِنَفْسِكَ فَدَعْ النَّاسَ مِنْهُ خَلِّ عَنْ زِمَامِ النَّاقَةِ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku [Abu shalih Al Hakam bin Musa] berkata; telah mengkhabarkan kepada kami [Isa bin Yunus] dari [Al A'masy] dari ['Amr bin Murrah] dari [Al Mughirah bin Saad] dari [Bapaknya] atau dari pamannya berkata; saya mendatangi Nabi Shallallahu'alaihiwasallam di Arafah lalu saya memegang tali kendali untanya atau ujung hidungnya, lalu saya menariknya. Lalu beliau bersabda: \"Biarkanlah, keperluan apa yang kau butuhkan?\" lalu saya berkata; \"Beritakanlah kepadaku tentang amalan yang bisa mendekatkan aku ke surga dan menjauhkanku dari neraka.\" Beliau mengangkat kepalanya ke langit kemudian bersabda: \"Kamu telah meringkas isi khutbah. Sungguh kau telah meminta hal yang sangat besar atau sesuatu yang panjang. Kamu beribadah kepada Allah dan janganlah kau menyekutukan-Nya dengan sesuatu pun, kamu menegakkan sholat dan membayar zakat. Melaksanakan haji dan berpuasa ramadhan, memberi apa yang kamu sukai kepada orang-orang, sebagaimana mereka memberikannya kepadamu. Apa yang kamu benci jika ada pada dirimu maka tinggalkanlah. Lepaskan kendali untanya!\""
            },
            {
                "number": 1259,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنِي أَبُو مُوسَى الْعَنَزِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَثْمَةَ قَالَ حَدَّثَنَا سَعِيدُ بْنُ بَشِيرٍ عَنْ قَتَادَةَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الشَّعْثَاءِ عَنْ يُونُسَ بْنِ شَدَّادٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ صَوْمِ أَيَّامِ التَّشْرِيقِ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku [Abu Musa Al 'Anazi] berkata; telah menceritakan kepada kami [Muhammad bin 'Atsamah] berkata; telah menceritakan kepada kami [Sa'id bin Basyir] dari [Qatadah] dari [Abu Qilabah] dari [Abu Asy Sya'tsa`] dari [Yunus bin Syaddad] sesungguhnya Rasulullah Shallallahu'alaihiwasallam melarang berpuasa pada Hari-Hari Tasyrik."
            },
            {
                "number": 1260,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مَعْدِيُّ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا شُعَيْثُ بْنُ مُطَيْرٍ عَنْ أَبِيهِ مُطَيْرٍ ومُطَيْرٌ حَاضِرٌ يُصَدِّقُهُ مَقَالَتَهُ قَالَكَيْفَ كُنْتُ أَخْبَرْتُكَ قَالَ يَا أَبَتَاهُ أَخْبَرْتَنِي أَنَّكَ لَقِيَكَ ذُو الْيَدَيْنِ بِذِي خُشُبٍ فَأَخْبَرَكَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِهِمْ إِحْدَى صَلَاتَيْ الْعَشِيِّ وَهِيَ الْعَصْرُ فَصَلَّى رَكْعَتَيْنِ وَخَرَجَ سَرَعَانُ النَّاسِ وَهُمْ يَقُولُونَ أَقَصُرَتْ الصَّلَاةُ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاتَّبَعَهُ أَبُو بَكْرٍ وَعُمَرُ رَضِيَ اللَّهُ عَنْهُمَا وَهُمَا مُبْتَدٍ فَلَحِقَهُ ذُو الْيَدَيْنِ فَقَالَ يَا رَسُولَ اللَّهِ أَقَصُرَتْ الصَّلَاةُ أَقَصُرَتْ الصَّلَاةُ أَمْ نَسِيتَ فَقَالَ مَا قَصُرَتْ وَلَا نَسِيتُ ثُمَّ أَقْبَلَ عَلَى أَبِي بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا فَقَالَ مَا يَقُولُ ذُو الْيَدَيْنِ فَقَالَا صَدَقَ يَا رَسُولَ اللَّهِ فَرَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَثَابَ النَّاسُ فَصَلَّى رَكْعَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ سَجَدَ سَجْدَتَيْ السَّهْوِقَالَ أَبُو سُلَيْمَانَ حَدَّثْتُ سِتَّ سِنِينَ أَوْ سَبْعَ سِنِينَ ثُمَّ سَلَّمَ وَشَكَكْتُ فِيهِ وَهُوَ أَكْثَرُ حِفْظِي",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku [Muhammad bin Al Mutsanna] berkata; telah menceritakan kepada kami [Ma'di bin Sulaiman] berkata; telah menceritakan kepada kami [Syu'aits bin Muthair] dari [bapaknya, Muthair] Muthair datang membenarkannya pembicaraannaya. Berkata; bagaimana kamu saat mengabarkannya.\"Wahai bapak, anda telah mengabarkan kepadaku, sesungguhnya [Dzul Yadain] bertemu kamu di Dzil Khusub. Lalu dia mengabarkan sesungguhnya Rasulullah Shallallahu'alaihiwasallam sholat bersama mereka salah satu sholat siang, yaitu sholat asar dengan dua rekaat, lalu keluar menuju orang-orang. Mereka berkata; sholat telah diqasar. Lalu Rasulullah Shallallahu'alaihiwasallam berdiri dan Abu Bakar dan 'Umar radliyallahu'anhuma mengikuti di belakangnya, lalu Dzul Yadain mengikutinya dan berkata; \"Wahai Rasulullah, apakah sholat telah diqashar, apakah sholat telah diqashar atau karena anda lupa?.\" Lalu beliau bersabda: \"Saya tidak mengqasarnya tapi saya lupa, \" lalu beliau menemui Abu Bakar dan 'Umar Radliyallahu'anhuma lalu bertanya, \"Apa yang dikatakan Dzul Yadain?\". Mereka berdua menjawab, \"Benar, Wahai Rasulullah.\" Lalu Rasulullah Shallallahu'alaihiwasallam kembali dan orang-orang mengikutinya, lalu beliau sholat dua rekaat dan mengucapkan salam, lalu bersujud dua kali sujud sahwi.\" Abu Sulaiman berkata; saya telah menyampaikannya selama enam tahun atau tujuh tahun, \"Lalu salam\". Saya ragu di dalamnya, itu adakah hapalan terbanyakku."
            },
            {
                "number": 1261,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي نَصْرُ بْنُ عَلِيٍّ قَالَ أَخْبَرَنِي مَعْدِيُّ بْنُ سُلَيْمَانَ قَالَ أَتَيْتُ مُطَيْرًا لِأَسْأَلَهُ عَنْ حَدِيثِ ذِي الْيَدَيْنِ فَأَتَيْتُهُ فَسَأَلْتُهُ فَإِذَا هُوَ شَيْخٌ كَبِيرٌ لَا يُنْفِذُ الْحَدِيثَ مِنْ الْكِبَرِ فَقَالَ ابْنُهُ شُعَيْثٌ بَلَى يَا أَبَتِحَدَّثَتْنِي أَنَّ ذَا الْيَدَيْنِ لَقِيَكَ بِذِي خَشَبٍ فَحَدَّثَكَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِهِمْ إِحْدَى صَلَاتَيْ الْعَشِيِّ وَهِيَ الْعَصْرُ رَكْعَتَيْنِ ثُمَّ سَلَّمَ فَخَرَجَ سَرَعَانُ النَّاسِ فَقَالَ أَقَصُرَتْ الصَّلَاةُ وَفِي الْقَوْمِ أَبُو بَكْرٍ وَعُمَرُ فَقَالَ ذُو الْيَدَيْنِ أَقَصُرَتْ الصَّلَاةُ أَمْ نَسِيتَ قَالَ مَا قَصُرَتْ الصَّلَاةُ وَلَا نَسِيتُ ثُمَّ أَقْبَلَ عَلَى أَبِي بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا فَقَالَ مَا يَقُولُ ذُو الْيَدَيْنِ فَقَالَا صَدَقَ يَا رَسُولَ اللَّهِ فَرَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَثَابَ النَّاسُ وَصَلَّى بِهِمْ رَكْعَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ سَجَدَ بِهِمْ سَجْدَتَيْ السَّهْوِ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepadaku [Nasr bin Ali] berkata; telah mengabarkan kepadaku [Ma'di bin Sulaiman] berkata; saya telah mendatangi [Muthair] untuk menanyakannya tentang hadits Dzul Yadain lalu saya mendatanginya dan bertanya kepadanya, ternyata dia sudah sangat tua yang tidak lagi kuasa menyampaikan hadis karena sudah sangat tuanya. Lalu anaknya [Syu'aits] berkata; Wahai bapakku, dahulu engkau telah menceritakan kepadaku sesungguhnya [Dzil Yadain] telah bertemu denganmu di Dzil Khasyab lalu menceritakan kepadamu, sesungguhnya Rasulullah Shallallahu'alaihiwasallam sholat bersama mereka salah satu sholat siang yaitu sholat asar dua rekaat lalu salam, lalu keluar menuju ke orang-orang. Dia berkata; sholat telah diqashar dan di dalam kaum ada Abu Bakar dan 'Umar Radliyallahu'anhu. Lalu (Rasulullah Shallallahu'alaihiwasallam) bertanya tentang apa yang dikatakan oleh Dzul Yadain. Mereka berdua menjawab, \"Benar, Wahai Rasulullah, \" Lalu Rasulullah Shallallahu'alaihiwasallam kembali dan orang-orang mengikutinya lalu sholat dua rekaat dan mengucapkan salam, lalu bersujud bersama mereka dua kali sujud sahwi.\""
            },
            {
                "number": 1262,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي أَبُو مَعْمَرٍ عَنْ ابْنِ أَبِي حَازِمٍ قَالَجَاءَ رَجُلٌ إِلَى عَلِيِّ بْنِ حُسَيْنٍ فَقَالَ مَا كَانَ مَنْزِلَةُ أَبِي بَكْرٍ وَعُمَرَ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْزِلَتُهُمَا السَّاعَةَ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepadaku [Abu Ma'mar] dari [Ibnu Abu Hazim] berkata; telah datang seorang laki-laki kepada ['Ali bin Husain] lalu bertanya, apakah kedudukan Abu Bakar dan 'Umar dari Nabi Shallallahu'alaihiwasallam?, maka dia menjawab, \"Kedudukan keduanya adalah bagaikan pentingnya waktu.\""
            },
            {
                "number": 1263,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ وَخَلَفُ بْنُ هِشَامٍ قَالَا حَدَّثَنَا عَامِرُ بْنُ أَبِي عَامِرٍ الْخَزَّازُ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا نَحَلَ وَالِدٌ وَلَدَهُ نُحْلًا أَفْضَلَ مِنْ أَدَبٍ حَسَنٍ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepada kami ['ubaidhullah bin 'Umar Al Qawariri] dan [Khalaf bin Hisyam] berkata; telah menceritakan kepada kami ['Amr bin Abu 'Amr Al Khazari] dari [Ayyub bin Musa] dari [Bapaknya] dari [kakeknya] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Orang tua tidak bisa memberi pemberian kepada anaknya yang lebih utama daripada adab yang baik.\""
            },
            {
                "number": 1264,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ قَالَ عَمْرُو بْنُ يَحْيَى حَدَّثَنِي عَنْ يَحْيَى بْنِ عُمَارَةَ عَنْ جَدِّهِ أَبِي حَسَنٍ قَالَدَخَلْتُ الْأَسْوَاقَ وَقَالَ فَأَثَرْتُ وَقَالَ الْقَوَارِيرِيُّ مَرَّةً فَأَخَذْتُ دُبْسَتَيْنِ قَالَ وَأُمُّهُمَا تُرَشْرِشُ عَلَيْهِمَا وَأَنَا أُرِيدُ أَنْ آخُذَهُمَا قَالَ فَدَخَلَ عَلَيَّ أَبُو حَسَنٍ فَنَزَعَ مِتِّيخَةً قَالَ فَضَرَبَنِي بِهَا فَقَالَتْ لِي امْرَأَةٌ مِنَّا يُقَالُ لَهَا مَرْيَمُ لَقَدْ تَعِسْتَ مِنْ عَضُدِهِ وَمِنْ تَكْسِيرِ الْمِتِّيخَةِ فَقَالَ لِي أَلَمْ تَعْلَمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّمَ مَا بَيْنَ لَابَتَيْ الْمَدِينَةِ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepada kami ['ubaidhullah bin 'Umar] telah menceritakan kepada kami [Abdul Aziz bin Muhammad Ad-Darawardi] ['Amr bin Yahya] berkata; telah menceritakan kepadaku dari [Yahya bin 'Umarah] dari [kakeknya Abu Hasan] berkata; saya memasuki pasar lalu saya saya meninggalkan, Al Qawariri berkata; lalu saya mengambil dua kuda. (Al Qawariri radliyallahu'anhu) berkata; induk keduanya menderuminya padahal saya hendak mengambilnya. (Al Qawariri radliyallahu'anhu) berkata; lalu Abu Hasan menemuiku dan mencabut dahan, lalu dia memukuliku dengan dahan itu, lalu ada seorang wanita yang berkata kepadaku yang bernama Maryam, \"Sungguh kamu telah rugi dari ototnya dan dari rusaknya dahan\". Lalu (Abu Hasan Radliyallahu'anhu) berkata kepadaku, \"Tidakkah kamu mengetahui sesungguhnya Rasulullah Shallallahu'alaihiwasallam mengharamkan apa yang ada antara dua gunung di Madinah?.\""
            },
            {
                "number": 1265,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا أَبُو الْفَضْلِ الْمَرْوَزِيُّ قَالَ حَدَّثَنِي ابْنُ أَبِي أُوَيْسٍ قَالَ وَحَدَّثَنِي حُسَيْنُ بْنُ عَبْدِ اللَّهِ ابْنِ ضُمَيْرَةَ عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ عَنْ جَدِّهِ أَبِي حَسَنٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَكْرَهُ نِكَاحَ السِّرِّ حَتَّى يُضْرَبَ بِدُفٍّ وَيُقَالَ أَتَيْنَاكُمْ أَتَيْنَاكُمْفَحَيُّونَا نُحَيِّيكُمْ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Abu Al Fadl Al Marwazi] berkata; telah menceritakan kepadaku [Ibnu Abu Uwais] berkata; dan telah menceritakan kepadaku [Husain bin Abdullah bin Dlumairah] dari ['Amr bin Yahya Al Mazini] dari [kakeknya Abu Hasan] sesungguhnya Nabi Shallallahu'alaihiwasallam membenci pernikahan yang diselenggarakan secara sembunyi-sembunyi sehingga kendang dipukul, dan dilantunkan bait-bait lagu, \"Kami mendatangi kalian, kami mendatangi kalian, sambutlah kami dan kami akan menyambut kalian.\""
            },
            {
                "number": 1266,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ حَاتِمٍ الطَّوِيلُ وَكَانَ ثِقَةً رَجُلًا صَالِحًا قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ يَعْنِي الدَّرَاوَرْدِيَّ عَنْ عَمْرِو بْنِ يَحْيَى عَنْ أَبِيهِ أَوْ عَمِّهِ قَالَكَانَتْ لِي جُمَّةٌ كُنْتُ إِذَا سَجَدْتُ رَفَعْتُهَا فَرَآنِي أَبُو حَسَنٍ الْمَازِنِيُّ فَقَالَ تَرْفَعُهَا لَا يُصِيبُهَا التُّرَابُ وَاللَّهِ لَأَحْلِقَنَّهَا فَحَلَقَهَا",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepada kami [Ahmad bin Hatim Ath-Thawil] dia adalah orang yang tsiqah, seorang laki-laki yang shalih, berkata; telah menceritakan kepada kami [Abdul Aziz bin Muhammad Ad-Darawardi] dari ['Amr bin Yahya] dari [Bapaknya] atau [pamannya] berkata; saya memiliki rambut panjang hingga kedua pundakku, jika saya bersujud maka saya harus mengangkatnya, [Abu Hasan Al Mazini] melihatku lalu dia berkata; kalaulah kamu mengangkatnya niscaya tidak akan terkena tanah. Demi Allah, saya akan memotongnya. Lalu dia mencukurnya."
            },
            {
                "number": 1267,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنِي أَبُو مَالِكٍ الْحَنَفِيُّ كَثِيرُ بْنُ يَحْيَى بْنِ كَثِيرٍ الْبَصْرِيُّ قَالَ حَدَّثَنَا ثَابِتٌ أَبُو زَيْدٍ قَالَ حَدَّثَنَا هِلَالُ بْنُ خَبَّابٍ عَنْ عِكْرِمَةَ بْنِ خَالِدٍ الْمَخْزُومِيِّ قَالَ حَدَّثَنِي عَرِيفٌ مِنْ عُرَفَاءِ قُرَيْشٍ عَنْ أَبِيهِسَمِعَهُ مِنْ فَلْقِ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَامَ رَمَضَانَ وَشَوَّالَ وَالْأَرْبِعَاءَ وَالْخَمِيسَ دَخَلَ الْجَنَّةَ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku [Abu Malik Al Hanafi, Katsir bin Yahya bin Katsir Al Basri] berkata; telah menceritakan kepada kami [Tsabit Abu Zaid] berkata; telah menceritakan kepada kami [Hilal bin Khabbab] dari [Ikrimah Khalid Al Makhzumi] berkata; telah menceritakan kepadaku [orang yang punya pengetahuan dari kalangan Quraish] dari [Bapaknya] telah mendengar dari seseorang yang berada disisi Rasulullah Shallallahu'alaihiwasallam bersabda: \"Barangsiapa yang berpuasa Ramadan, Syawal, Rabu dan Kamis, maka akan masuk surga\"."
            },
            {
                "number": 1268,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ مِنْ كِتَابِهِ قَالَ أَخْبَرَنَا أَبُو إِسْمَاعِيلَ الْمُؤَدِّبُ عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ عَائِذٍ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى نَاقَةٍ خَرْمَاءَ وَعَبْدٌ حَبَشِيٌّ مُمْسِكٌ بِخِطَامِهَاوَهَلَكَ قَيْسٌ أَيَّامَ الْمُخْتَارِ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku [Suraij bin Yunus] dari kitabnya, berkata; telah mengabarkan kepada kami [Abu Isma'il Al Mu`addab] dari [Isma'il bin Abu Khalid] dari [Qais bin 'A`id] berkata; saya pernah melihat Rasulullah Shallallahu'alaihiwasallam berkhutbah di atas unta Kharma` dan seorang budak memegang tali kendali untanya. Dan Qais meninggal pada masa Al Mukhtar berkuasa. "
            },
            {
                "number": 1269,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ قَالَ حَدَّثَنَا أَبُو مَعْشَرٍ الْبَرَاءُ قَالَ حَدَّثَنَا ابْنُ حَرْمَلَةَ عَنْ يَحْيَى بْنِ هِنْدِ بْنِ حَارِثَةَ عَنْ أَبِيهِ وَكَانَ مِنْ أَصْحَابِ الْحُدَيْبِيَةِ وَأَخُوهُ الَّذِي بَعَثَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ قَوْمَهُ بِصِيَامِ يَوْمِ عَاشُورَاءَ وَهُوَ أَسْمَاءُ بْنُ حَارِثَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَهُ فَقَالَ مُرْ قَوْمَكَ فَلْيَصُومُوا هَذَا الْيَوْمَ قَالَ أَرَأَيْتَ إِنْ وَجَدْتُهُمْ قَدْ طَعِمُوا قَالَ فَلْيُتِمُّوا بَقِيَّةَ يَوْمِهِمْ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku [Muhammad bin Abu Bakar Al Muqaddami] berkata; telah menceritakan kepada kami [Abu Ma'syar Al Bara`] berkata; telah menceritakan kepada kami [Ibnu Harmalah] dari [Yahya bin Hind bin Haritsah] dari [Bapaknya] salah seorang yang ikut Peristiwa Hudaibiyah, saudaranya adalah termasuk yang diutus Rasulullah Shallallahu'alaihiwasallam agar menyuruh kaumnya agar berpuasa hari Asy Syura` yaitu Asma` bin Haritsah sesungguhnya Rasulullah Shallallahu'alaihiwasallam mengutusnya dan bersabda: \"Perintahkan kaummu agar berpuasa pada hari ini.\" (Asma` bin Haritsah Radliyallahu'anhu) berkata; \"Bagaimana pendapat anda jika saya dapatkan mereka telah makan?\". Beliau bersabda: \"Sempurnakanlah sisa harinya\""
            },
            {
                "number": 1270,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا نَضْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ وَعَبْدُ الْأَعْلَى بْنُ حَمَّادٍ أَبُو يَحْيَى النَّرْسِيُّ قَالَا حَدَّثَنَا عَامِرُ بْنُ أَبِي عَامِرٍ الْخَزَّازُ قَالَ حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا نَحَلَ وَالِدٌ وَلَدًا أَفْضَلَ مِنْ أَدَبٍ حَسَنٍ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Nadlr bin 'Ali Al Jahdlami] dan [Abdul A'la bin Hammad, Abu Yahya An-Narsi] berkata; telah menceritakan kepada kami ['Amir bin Abu 'Amir Al Khazari] berkata; telah menceritakan kepada kami [Ayyub bin Musa] dari [Bapaknya] dari [kakeknya] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Orang tua tidak bisa memberi pemberian kepada anaknya yang lebih utama daripada adab yang baik.\""
            },
            {
                "number": 1271,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا مُحَمَّدُ بْنُ ثَعْلَبَةَ بْنِ سَوَاءٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَوَاءٍ قَالَ حَدَّثَنَا حُمْرَانُ بْنُ يَزِيدَ الْأَعْمَى عَنْ قَتَادَةَ عَنْ رَجُلٍ مِنْ بَنِي سَدُوسٍ عَنْ قُطْبَةَ بْنِ قَتَادَةَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُفْطِرُ إِذَا غَرَبَتْ الشَّمْسُ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Muhammad bin Tsa'labah bin Sawa`] berkata; telah menceritakan kepada kami [Muhammad bin Sawa`] berkata; telah menceritakan kepada kami [Humran bin Yazid yang buta] dari [Qatadah] dari [seorang laki-laki dari Bani Sundus] dari [Quthbah bin Qatadah] berkata; saya melihat Rasulullah Shallallahu'alaihiwasallam berbuka jika matahari telah tenggelam."
            },
            {
                "number": 1272,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ ثَعْلَبَةَ بْنِ سَوَاءٍ قَالَ حَدَّثَنِي ابْنُ سَوَاءٍ قَالَ حَدَّثَنِي حُمْرَانُ بْنُ يَزِيدَ عَنْ قَتَادَةَ عَنْ رَجُلٍ مِنْ بَنِي سَدُوسٍ عَنْ قُطْبَةَ بْنِ قَتَادَةَ قَالَبَايَعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى ابْنَتِي الْحَوْصَلَةِوَكَانَ يُكَنَّى بِأَبِي الْحَوْصَلَةِ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku [Muhammad bin Tsa'labah bin Sawa`] berkata; telah menceritakan kepadaku [Ibnu Sawa`] berkata; telah menceritakan kepadaku [Humran bin Yazid] dari [Qatadah] dari [seorang laki-laki dari Bani Sundus] dari [Quthbah bin Qatadah] berkata; saya telah berbaiat kepada Nabi Shallallahu'alaihiwasallam untuk dua anak perempuan Al Hushalah sehingga dia diberi julukan dengan Abu Al Haushalah."
            },
            {
                "number": 1273,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنِي نَصْرُ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يُوسُفُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا أَبُو جَعْفَرٍ الْخَطْمِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُقْبَةَ بْنِ الْفَاكِهِ عَنْ جَدِّهِ الْفَاكِهِ بْنِ سَعْدٍ وَكَانَتْ لَهُ صُحْبَةٌأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْتَسِلُ يَوْمَ الْجُمُعَةِ وَيَوْمَ عَرَفَةَ وَيَوْمَ الْفِطْرِ وَيَوْمَ النَّحْرِقَالَ وَكَانَ الْفَاكِهُ بْنُ سَعْدٍ يَأْمُرُ أَهْلَهُ بِالْغُسْلِ فِي هَذِهِ الْأَيَّامِ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku [Nasr bin Ali] berkata; telah menceritakan kepada kami [Yusuf bin Khalid] berkata; telah menceritakan kepada kami [Abu Ja'far Al Khathmi] dari [Abdurrahman bin 'Uqbah bin Al Faqih] dari [kakeknya, Al Faqih bin Saad] dia adalah salah seorang sahabat, sesungguhnya Rasulullah Shallallahu'alaihiwasallam mandi pada Hari Jumat, Hari Arafah, Idul Fitri dan Idul Adha. (Abdurrahman bin 'Uqbah bin Al Faqih Radliyallahu'anhu) berkata; Al Faqih bin Saad menyuruh keluarganya mandi pada hari-hari tersebut."
            },
            {
                "number": 1274,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنِي إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ أَبُو مَعْمَرٍ الْهُذَلِيُّ حَدَّثَنَا سَعِيدُ بْنُ خُثَيْمٍ الْهِلَالِيُّ قَالَ حَدَّثَتْنِي جَدَّتِي أُمُّ أَبِي رَبِيعَةُ بِنْتُ عِيَاضٍ الْكِلَابِيَّةُ عَنْ جَدِّهَا عَبِيدَةَ بْنِ عَمْرٍو الْكِلَابِيِّ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَتَوَضَّأُ فَأَسْبَغَ الطُّهُورَوَكَانَتْ هِيَ إِذَا تَوَضَّأَتْ أَسْبَغَتْ الطُّهُورَ حَتَّى تَرْفَعَ الْخِمَارَ فَتَمْسَحَ رَأْسَهَا",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku [Isma'il bin Ibrahim, Abu Ma'mar Al Hudzali] telah menceritakan kepada kami [Sa'id bin Khustaim Al Hilali] berkata; telah menceritakan kepadaku [nenekku, Rabi'ah binti Iyadl Al Kilabiyah] dari [kakeknya, 'Abidah bin 'Amr Al Kilabi] berkata; saya melihat Nabi Shallallahu'alaihiwasallam beliau sedang berwudlu lalu menyempurnakan wudlunya. (Umu Abu Rabi'ah binti Iyadl Al Kilabiyah Radliyallahu'anhuma) jika berwudlu menyempurnakan wudlu sampai mengangkat kerudungnya dan mengusap kepalanya."
            },
            {
                "number": 1275,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنِي عُثْمَانُ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا سَعِيدُ بْنُ خُثَيْمٍ الْهِلَالِيُّ قَالَ سَمِعْتُ جَدَّتِي رَبِيعَةَ ابْنَةَ عِيَاضٍ عَنْ جَدِّهَا عَبِيدَةَ بْنِ عَمْرٍو الْكِلَابِيِّ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فَأَسْبَغَ الْوُضُوءَقَالَ وَكَانَتْ رَبِيعَةُ إِذَا تَوَضَّأَتْ أَسْبَغَتْ الْوُضُوءَ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepadaku ['Utsman bin Muhammad bin Abu Syaibah] berkata; telah menceritakan kepada kami [Sa'id bin Khustaim Al Hilali] berkata; saya telah mendengar [nenekku, Rabi'ah binti Iyadl] dari [kakeknya 'Abidah bin 'Amr Al Kilabi] berkata; saya telah melihat Rasulullah Shallallahu'alaihiwasallam berwudlu lalu menyempurnakan wudlunya. (Sa'id bin Khustaim Al Hilali Radliyallahu'anhu) berkata; Rabi'ah jika berwudlu maka dia menyempurnakan wudlunya."
            },
            {
                "number": 1276,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ قَالَ حَدَّثَنَا سَعِيدُ بْنُ خُثَيْمٍ الْهِلَالِيُّ قَالَ حَدَّثَتْنِي جَدَّتِي رَبِيعَةُ ابْنَةُ عِيَاضٍ الْكِلَابِيَّةُ عَنْ جَدِّهَا عَبِيدَةَ بْنِ عَمْرٍو الْكِلَابِيِّ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ فَأَسْبَغَ الطُّهُورَقَالَ وَكَانَتْ هِيَ يَعْنِي جَدَّتَهُ إِذَا أَخَذَتْ الطَّهُورَ أَسْبَغَتْ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepadaku ['Amr bin Muhammad An-Naqid] berkata; telah menceritakan kepada kami [Sa'id bin Khustaim Al Hilali] berkata; telah menceritakan kepadaku [nenekku, Rabi'ah binti Iyadl Al Kilabiyah] dari [kakeknya, 'Abidah bin 'Amr Al Kilabi] berkata; saya telah melihat Rasulullah Shallallahu'alaihiwasallam berwudlu lalu menyempurnakan wudlunya. (Sa'id bin Khustaim Al Hilali Radliyallahu'anhu) berkata; dia (Rabi'ah Radliyallahu'anhu) alias neneknya, jika berwudlu maka dia menyempurnakan wudlunya."
            },
            {
                "number": 1277,
                "arab": "قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ الْيَزَنِيِّ عَنْ مَالِكِ بْنِ هُبَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مُؤْمِنٍ يَمُوتُ فَيُصَلِّي عَلَيْهِ أُمَّةٌ مِنْ الْمُسْلِمِينَ بَلَغُوا أَنْ يَكُونُوا ثَلَاثَةَ صُفُوفٍ إِلَّا غُفِرَ لَهُقَالَ فَكَانَ مَالِكُ بْنُ هُبَيْرَةَ يَتَحَرَّى إِذَا قَلَّ أَهْلُ جَنَازَةٍ أَنْ يَجْعَلَهُمْ ثَلَاثَةَ صُفُوفٍ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Yazid bin Harun] berkata; telah mengabarkan kepada kami [Hammad bin Zaid] dari [Muhammad bin Ishaq] dari [Yazid bin Abu Habib] dari [Martsad bin Abdullah Al Yazani] dari [Malik bin Hubarah] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidaklah seorang mukmin yang meninggal lalu ada sekelompok orang yang mensholatinya sampai tiga shaf kecuali pasti dia diampuni.\" (Martsad bin Abdullah Al Yazani Radliyallahu'aanhu) berkata; jika keluarga jenazah sedikit, Malik bin Hubarah tetap menjaga agar bisa dijadikan tiga shaf."
            },
            {
                "number": 1278,
                "arab": "قَالَ حَدَّثَنَا يَزِيدُ قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْحَاقَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنِ الْمِقْدَادِ بْنِ الْأَسْوَدِ قَالَقَالَ لِي عَلِيٌّ سَلْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرَّجُلِ يُلَاعِبُ امْرَأَتَهُ فَيَخْرُجُ مِنْهُ الْمَذْيُ مِنْ غَيْرِ مَاءِ الْحَيَاةِ قَالَ يَغْسِلُ فَرْجَهُ وَيَتَوَضَّأُ وُضُوءَهُ لِلصَّلَاةِ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Yazid] berkata; telah mengabarkan kepada kami [Muhammad bin Ishaq] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari [Al Miqdad bin Al Aswad] berkata; \"'Ali berkata kepadaku tanyakan kepada Rasulullah Shallallahu'alaihiwasallam tentang seorang laki-laki yang mencumbui istrinya lalu keluar madzi bukan 'air kehidupan'(mani). Beliau bersabda: \"Hendaklah ia mencuci kemaluannya dan berwudlu untuk sholat\"."
            },
            {
                "number": 1279,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا إِسْرَائِيلُ بْنُ يُونُسَ بْنِ أَبِي إِسْحَاقَ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عَبْدِ الْأَعْلَى عَنْ جَدَّتِهِ عَنْ أَبِيهَا سُوَيْدِ بْنِ حَنْظَلَةَ قَالَخَرَجْنَا نُرِيدُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَنَا وَائِلُ بْنُ حُجْرٍ فَأَخَذَهُ عَدُوٌّ لَهُ فَتَحَرَّجَ النَّاسُ أَنْ يَحْلِفُوا وَحَلَفْتُ أَنَّهُ أَخِي فَخَلَّى عَنْهُ فَأَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ أَنْتَ كُنْتَ أَبَرَّهُمْ وَأَصْدَقَهُمْ صَدَقْتَ الْمُسْلِمُ أَخُو الْمُسْلِمِحَدَّثَنَا الْوَلِيدُ بْنُ الْقَاسِمِ وأَسْوَدُ بْنُ عَامِرٍ قَالَا حَدَّثَنَا إِسْرَائِيلُ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الْأَعْلَى عَنْ جَدَّتِهِ عَنْ أَبِيهَا سُوَيْدِ بْنِ حَنْظَلَةَ قَالَ خَرَجْنَا نُرِيدُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَهُ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata; telah mengabarkan kepada kami [Isra`il bin Yunus bin Abu Ishaq] berkata; telah menceritakan kepada kami [Ibrahim bin Abdu' A'la] dari [neneknya] dari [Bapaknya, Suwaid bin Hanzlalah] berkata; kami keluar untuk menemui Rasulullah Shallallahu'alaihiwasallam bersama dengan Wa`il bin Hujr lalu ada musuh yang menangkapnya. Orang-orang meminta dengan berulang-ulang agar bersumpah. Saya bersumpah bahwa dia adalah saudara laki-lakiku, lalu dia melepaskannya. Lalu kami mendatangi Rasulullah Shallallahu'alaihiwasallam, saya menyebutkan apa yang terjadi, lalu beliau bertanya, \"Kamu adalah orang terbaik dan orang terpercaya di antara mereka. Kamu benar, seorang muslim adalah saudara muslim lainnya. Telah menceritakan kepada kami [Al Walid bin Al Qasim] dan [Aswad bin 'Amir] berkata; telah menceritakan kepada kami [Isra`il] dari [Ibrahim bin Abdul A'la] dari [neneknya] dari [Bapaknya, Suwaid bin Hanzlalah] berkata; kami keluar untuk menemui Rasulullah Shallallahu'alaihiwasallam, lalu menyebutkan secara lengkap."
            },
            {
                "number": 1280,
                "arab": "حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى قَالَ أَنَا الْحَارِثُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ مُنِيرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ سَعْدِ بْنِ أَبِي ذُبَابٍ قَالَقَدِمْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْلَمْتُ قُلْتُ يَا رَسُولَ اللَّهِ اجْعَلْ لِقَوْمِي مَا أَسْلَمُوا عَلَيْهِ مِنْ أَمْوَالِهِمْ فَفَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاسْتَعْمَلَنِي عَلَيْهِمْ ثُمَّ اسْتَعْمَلَنِي أَبُو بَكْرٍ رَضِيَ اللَّهُ تَعَالَى عَنْهُ ثُمَّ اسْتَعْمَلَنِي عُمَرُ مِنْ بَعْدِهِ",
                "id": "Telah menceritakan kepada kami [Shafwan bin Isa] berkata; telah memberitakan kepada kami [Al Harits bin Abdurrahman] dari [Munir bin Abdullah] dari [Bapaknya] dari [Sa'd bin Abu Dzubab] berkata; saya menemui Rasulullah Shallallahu'alaihiwasallam lalu saya masuk Islam. Saya berkata; \"Wahai Rasulullah, berbuatlah sesuatu agar kaumku masuk Islam karena harta mereka.\" Lalu Rasulullah Shallallahu'alaihiwasallam melakukannya dan beliau mengangkatku menjadi pejabat atas mereka, lalu Abu Bakar Radliyallahu'anhu juga mengangkatku. Lalu 'Umar juga demikian pada setelahnya."
            },
            {
                "number": 1281,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنَا ابْنُ جُرَيْجٍ قَالَ أَنَا عَمْرُو بْنُ دِينَارٍ أَنَّهُ سَمِعَ طَاوُسًا يُخْبِرُ عَنِ ابْنِ عَبَّاسٍ عَنْ عُمَرَ رَضِيَ اللَّهُ تَعَالَى عَنْهُأَنَّهُ نَشَدَ قَضَاءَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ فَجَاءَ حَمَلُ بْنُ مَالِكِ بْنِ النَّابِغَةِ فَقَالَ كُنْتُ بَيْنَ بَيْتَيْ امْرَأَتَيَّ فَضَرَبَتْ إِحْدَاهُمَا الْأُخْرَى بِمِسْطَحٍ فَقَتَلَتْهَا وَجَنِينَهَا فَقَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَنِينِهَا بِغُرَّةٍ وَأَنْ تُقْتَلَ بِهَاقُلْتُ لِعَمْرٍو لَا أَخْبَرَنِي عَنْ أَبِيهِ بِكَذَا وَكَذَا قَالَ لَقَدْ شَكَّكْتَنِي",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] berkata; telah memberitakan kepada kami [Ibnu Juraij] berkata; telah memberitakan kepada kami ['Amr bin Dinar] sesungguhnya telah mendengar [Thawus] mengabari dari [Ibnu Abbas] dari ['Umar radliyallahu'anhuma] sesungguhnya dia melakukan ketentuan Rasulullah Shallallahu'alaihiwasallam pada masalah itu. Lalu [Hamal bin Malik bin Nabighah] datang, lalu berkata; saya berada di antara kedua rumah istriku, lalu salah satunya memukul yang lainnya dengan tongkat sehingga meninggal beserta janinnya. Lalu Nabi Shallallahu'alaihiwasallam memutuskan pada janinnya dengan uzzah (delapan belas diat atau setara dengan satu budak) lalu dia dibunuh. Saya (Ibnu Juraij Radliyallahu'anhu) berkata kepada 'Amr, tidak, dia telah mengabariku dari Bapaknya, demikian dan demikian. Dia berkata; kamu telah menjadikan saya ragu."
            },
            {
                "number": 1282,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنَا أَبُو خَالِدٍ هُدْبَةُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى قَالَ حَدَّثَنَا أَبُو جَمْرَةَ الضُّبَعِيُّ عَنْ أَبِي بَكْرٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى الْبَرْدَيْنِ دَخَلَ الْجَنَّةَ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; telah menceritakan kepada kami [Abu Khalid Hudbah bin Khalid] berkata; telah menceritakan kepada kami [Hammam bin Yahya] berkata; telah menceritakan kepada kami [Abu Jamrah Adl-Dlab'i] dari [Abu Bakar] dari [Bapaknya] sesungguhnya Rasulullah Shallallahu'alaihiwasallam bersabda: \"Barangsiapa yang sholat sholat fajar dan sholat asar, akan masuk surga.\""
            },
            {
                "number": 1283,
                "arab": "قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ قَالَأَضْلَلْتُ بَعِيرًا لِي بِعَرَفَةَ فَذَهَبْتُ أَطْلُبُهُ فَإِذَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاقِفٌ قُلْتُ إِنَّ هَذَا مِنْ الْحُمْسِ مَا شَأْنُهُ هَاهُنَا وَقَالَ سُفْيَانُ مَرَّةً عَنْ عَمْرٍو عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ قَالَ ذَهَبْتُ أَطْلُبُ بَعِيرًا لِي بِعَرَفَةَ فَوَجَدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاقِفًا قُلْتُ هَذَا مِنْ الْحُمْسِ مَا شَأْنُهُ هَاهُنَا",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Sufyan] dari ['Amr] dari [Muhammad bin Jubair bin Muth'im] dari [Bapaknya] berkata; saya kehilangan kendaraanku di Arafah, lalu saya pergi untuk mencarinya. Ternyata Nabi Shallallahu'alaihiwasallam sedang berwukuf di sana, saya berkata; sesungguhnya ini termasuk tradisi yang dipegang teguh Al humus (orang Quraisy dinamai dengan hal itu karena sangat eratnya dalam memegang agama) ada apa di sini. [Sufyan] berkata; dari ['Amr] dari [Muhammad bin Jubair bin Muth'im] dari [Bapaknya] berkata; saya pergi untuk mencari unta kendaraanku di Arafah, lalu saya mendapatkan Rasulullah Shallallahu'alaihiwasallam berwukuf lalu saya berkata; ini adalah termasuk tradisi yang dipegang teguh Al humus, bagaimana keadaannya di sini?. "
            },
            {
                "number": 1284,
                "arab": "قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مِسْعَرٍ قَالَ حَدَّثَنِي عَمْرُو بْنُ مُرَّةَ عَنْ رَجُلٍ عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي التَّطَوُّعِ اللَّهُ أَكْبَرُ كَبِيرًا ثَلَاثَ مِرَارٍ وَالْحَمْدُ لِلَّهِ كَثِيرًا ثَلَاثَ مِرَارٍ وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلًا ثَلَاثَ مِرَارٍ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الشَّيْطَانِ الرَّجِيمِ مِنْ هَمْزِهِ وَنَفْثِهِ وَنَفْخِهِ قُلْتُ يَا رَسُولَ اللَّهِ مَا هَمْزُهُ وَنَفْثُهُ وَنَفْخُهُ قَالَ أَمَّا هَمْزُهُ فَالْمُوتَةُ الَّتِي تَأْخُذُ ابْنَ آدَمَ وَأَمَّا نَفْخُهُ الْكِبْرُ وَنَفْثُهُ الشِّعْرُ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Mis'ar] berkata; telah menceritakan kepadaku ['Amr bin Murrah] dari [seorang laki-laki] dari [Nafi' bin Jubair bin Muth'im] dari [Bapaknya] berkata; saya mendengar Nabi Shallallahu'alaihiwasallam membaca pada sholat sunnah, \"Allah Maha Besar\" tiga kali.\"Segala puji bagi Allah, pujian yang banyak\" tiga kali.\"Maha suci Allah pada pagi hari dan sore\" tiga kali.\"Ya Allah, sesungguhnya saya berlindung kepada-Mu dari setan yang terkutuk dari ganguannya (kegilaan yang bisa menimpa anak Adam), syairnya dan kesombongannya.\" Saya bertanya Wahai Rasulullah, apa yang dimaksud istilah hamz-nya, nafts-nya dan an-nafkh-nya? Beliau menjawab,, \"Hamznya maksudnya adalah keadaan gila atau ayan yang menimpa anak Adam, an-nafkh adalah kesombongannya dan nafts adalah syairnya yang jelek.\""
            },
            {
                "number": 1285,
                "arab": "قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا مِسْعَرٌ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ رَجُلٍ مِنْ عَنَزَةَ عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ اللَّهُ أَكْبَرُ كَبِيرًا وَالْحَمْدُ لِلَّهِ كَثِيرًا وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلًا اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الشَّيْطَانِ الرَّجِيمِ مِنْ هَمْزِهِ وَنَفْثِهِ وَنَفْخِهِ قَالَ قُلْتُ مَا هَمْزُهُ قَالَ فَذَكَرَ كَهَيْئَةِ الْمُوتَةِ يَعْنِي يَصْرَعُ قُلْتُ فَمَا نَفْخُهُ قَالَ الْكِبْرُ قُلْتُ فَمَا نَفْثُهُ قَالَ الشِّعْرُ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Waki'] berkata; telah menceritakan kepada kami [Mis'ar] dari ['Amr bin Murrah] dari [seorang laki-laki dari 'Anazah] dari [Nafi' bin Jubair bin Muth'im] dari [Bapaknya] sesungguhnya Rasulullah Shallallahu'alaihiwasallam membaca, \"Allah Maha Besar. Segala puji bagi Allah, pujian yang banyak. Maha suci Allah pada pagi hari dan sore. Ya Allah, sesungguhnya saya berlindung kepada-Mu dari setan yang terkutuk dari ganguannya (kegilaan yang bisa menimpa anak Adam), syairnya dan kesombongannya.\" (Jubair bin Muth'im Radliyallahu'anhu) berkata; saya bertanya, apakah Hamznya itu? Beliau menyebutkan, seperti keadaan orang yang gila atau ayan. Saya bertanya, an-nafkh? Beliau menjawab, kesombongannya. Saya bertanya, nafts, maka beliau menjawab, syairnya yang jelek."
            },
            {
                "number": 1286,
                "arab": "قَالَ حَدَّثَنَا يَزِيدُ قَالَ أَنَا ابْنُ أَبِي ذِئْبٍ عَنِ الزُّهْرِيِّ عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَزْهَرِ عَنْ جُبَيْرِ بْنِ مُطْعِمٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِلْقُرَشِيِّ مِثْلَيْ قُوَّةِ الرَّجُلِ مِنْ غَيْرِ قُرَيْشٍفَقِيلَ لِلزُّهْرِيِّ مَا عَنَى بِذَلِكَ قَالَ نُبْلَ الرَّأْيِ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Yazid] berkata; telah memberitakan kepada kami [Ibnu Abu Dzi`b] dari [Az Zuhri] dari [Thalhah bin Abdullah bin 'Auf] dari [Abdurrahman bin Al Azhar] dari [Jubair bin Muth'im] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Sesungguhnya orang Quraisy adalah keteladanan kekuatan bagi selain Quraisy.\" Ditanyakan kepada Az Zuhri, apa yang dimaksud dengan hal itu? Maka dia menjawab, kecerdasan dalam berpendapat."
            },
            {
                "number": 1287,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو قَالَ أَنَا ابْنُ جُرَيْجٍ قَالَ أَنَا أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ بَابَيْهِ عَنْ جُبَيْرِ بْنِ مُطْعِمٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ عَطَاءٍ هَذَا يَا بَنِي عَبْدِ مَنَافٍ وَيَا بَنِي عَبْدِ الْمُطَّلِبِ إِنْ كَانَ لَكُمْ مِنْ الْأَمْرِ شَيْءٌ فَلَأَعْرِفَنَّ مَا مَنَعْتُمْ أَحَدًا يَطُوفُ بِهَذَا الْبَيْتِ أَيَّ سَاعَةٍ مِنْ لَيْلٍ أَوْ نَهَارٍ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Muhammad bin 'Amr] berkata; telah memberitakan kepada kami [Ibnu Juraij] berkata; telah memberitakan kepada kami [Abu Az Zubair] sesungguhnya telah mendengar [Abdullah bin Babaih] dari [Jubair bin Muth'im] dari Nabi Shallallahu'alaihiwasallam, sebaik-baik pemberian adalah ini, Wahai Bani Abdu Manaf, Wahai Bani Abdul Muthalib. Jika kalian pada masalah ini ada sesuatu, maka pasti saya akan mengetahuinya. kalian tidak pernah melarang seseorangpun yang thawaf di ka'bah ini kapan saja baik malam ataupun siang."
            },
            {
                "number": 1288,
                "arab": "قَالَ حَدَّثَنَا أَبُو عَامِرٍ قَالَ حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِأَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَيُّ الْبُلْدَانِ شَرٌّ قَالَ فَقَالَ لَا أَدْرِي فَلَمَّا أَتَاهُ جِبْرِيلُ عَلَيْهِ السَّلَام قَالَ يَا جِبْرِيلُ أَيُّ الْبُلْدَانِ شَرٌّ قَالَ لَا أَدْرِي حَتَّى أَسْأَلَ رَبِّي عَزَّ وَجَلَّ فَانْطَلَقَ جِبْرِيلُ عَلَيْهِ السَّلَام ثُمَّ مَكَثَ مَا شَاءَ اللَّهُ أَنْ يَمْكُثَ ثُمَّ جَاءَ فَقَالَ يَا مُحَمَّدُ إِنَّكَ سَأَلْتَنِي أَيُّ الْبُلْدَانِ شَرٌّ فَقُلْتُ لَا أَدْرِي وَإِنِّي سَأَلْتُ رَبِّي عَزَّ وَجَلَّ أَيُّ الْبُلْدَانِ شَرٌّ فَقَالَ أَسْوَاقُهَا",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Abu 'Amir] berkata; telah menceritakan kepada kami [Zuhair bin Muhammad] dari [Abdullah bin 'Aqil] dari [Muhammad bin Jubair bin Muth'im] dari [Bapaknya] sesungguhnya seorang laki-laki menemui Nabi Shallallahu'alaihiwasallam lalu bertanya, \"Wahai Rasulullah, bagian negeri mana yang paling jelek?\" (Muth'im radliyallahu'anhu) berkata; beliau menjawab, saya tidak tahu. Tatkala Jibril alaihissalam menemuinya, beliau bersabda: \"Wahai Jibril, bagian negeri mana yang paling jelek?\" dia menjawab, saya tidak tahu hingga saya akan menanyakan kepada Rabbku Azzawajalla. Lalu Jibril alaihissalam pergi dan menetap selama beberapa waktu lalu datang dan berkata; \"Wahai Muhammad, Sesungguhnya kamu menanyakan kepadaku tentang bagian negeri mana yang paling jelek?\" lalu saya menjawab, tidak tahu, lantas saya menanyakan kepada Rabbku Azzawajalla tentang hal itu, dan Dia (Allah Azzawajalla) menjawab lokasi paling jelek adalah pasar (tempat berjualan)."
            },
            {
                "number": 1289,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ وَعَفَّانُ قَالَا حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ قَالَ مَنْ يَكْلَؤُنَا اللَّيْلَةَ لَا نَرْقُدُ عَنْ صَلَاةِ الْفَجْرِ فَقَالَ بِلَالٌ أَنَا فَاسْتَقْبَلَ مَطْلَعَ الشَّمْسِ فَضُرِبَ عَلَى آذَانِهِمْ فَمَا أَيْقَظَهُمْ إِلَّا حَرُّ الشَّمْسِ فَقَامُوا فَأَدَّوْهَا ثُمَّ تَوَضَّئُوا فَأَذَّنَ بِلَالٌ فَصَلَّوْا الرَّكْعَتَيْنِ ثُمَّ صَلَّوْا الْفَجْرَ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Abdushshamad] dan ['Affan] berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari ['Amr bin Dinar] dari [Nafi' bin Jubair bin Muth'im] dari [Bapaknya] berkata; Rasulullah Shallallahu'alaihiwasallam dalam suatu perjalanan, lantas bersabda: \"Siapa yang akan menjaga kami pada malam ini sehingga kami tidak ketiduran dan ketinggalan sholat subuh?\" Lalu Bilal berkata; 'Saya.' Lalu dia bangun namun matahari telah terbit. Telinga-telinga mereka tidak mendengar suara apa-apa. Tidak ada yang membangunkan mereka kecuali panas sinar matahari, lalu mereka bangun, melaksanakan sholat. Mereka berwudlu, lalu Bilal melantunkan adzan, lalu mereka sholat dua rekaat lalu sholat fajar."
            },
            {
                "number": 1290,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَنْزِلُ اللَّهُ عَزَّ وَجَلَّ كُلَّ لَيْلَةٍ إِلَى سَمَاءِ الدُّنْيَا فَيَقُولُ هَلْ مِنْ سَائِلٍ فَأُعْطِيَهُ هَلْ مِنْ مُسْتَغْفِرٍ فَأَغْفِرَ لَهُ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] berkata; telah menceritakan kepada kami ['Amr bin Dinar] dari [Nafi' bin Jubair bin Muth'im] dari [Bapaknya] sesungguhnya Rasulullah Shallallahu'alaihiwasallam bersabda: \"Allah Azzawajalla turun setiap malam ke langit dunia lalu berfirman, 'Adakah orang yang meminta lalu Aku memberinya, adakah orang yang meminta ampun lalu Aku mengampuninya?.\""
            },
            {
                "number": 1291,
                "arab": "قَالَ حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَاقَ عَنْ سُلَيْمَانَ بْنِ صُرَدٍ عَنْ جُبَيْرِ بْنِ مُطْعِمٍ قَالَتَذَاكَرْنَا غُسْلَ الْجَنَابَةِ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا أَنَا فَآخُذُ مِلْءَ كَفِّي ثَلَاثًا فَأَصُبُّ عَلَى رَأْسِي ثُمَّ أُفِيضُ بَعْدُ عَلَى سَائِرِ جَسَدِي",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Hujain bin Al Mutsanna] berkata; telah menceritakan kepada kami [Isra`il] dari [Abu Ishaq] dari [Sulaiman bin Shurd] dari [Jubair bin Muth'im] berkata; kami saling memperbincangkan tentang mandi junub di sisi Nabi Shallallahu'alaihiwasallam, lalu Rasulullah Shallallahu'alaihiwasallam bersabda: \"Saya mengambil dua telapak tangan, tiga kali lalu saya siramkan pada kepalaku, kemudian saya tuangkan setelahnya pada semua tubuhku.\""
            },
            {
                "number": 1292,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ قَالَانْشَقَّ الْقَمَرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَارَ فِرْقَتَيْنِ فِرْقَةً عَلَى هَذَا الْجَبَلِ وَفِرْقَةً عَلَى هَذَا الْجَبَلِ فَقَالُوا سَحَرَنَا مُحَمَّدٌ فَقَالُوا إِنْ كَانَ سَحَرَنَا فَإِنَّهُ لَا يَسْتَطِيعُ أَنْ يَسْحَرَ النَّاسَ كُلَّهُمْ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Muhammad bin Katsir] berkata; telah menceritakan kepada kami [Sulaiman bin Katsir] dari [Hushain bin Abdurrahman] dari [Muhammad bin Jubair bin Muth'im] dari [Bapaknya] berkata; Bulan terbelah pada masa Rasulullah Shallallahu'alaihiwasallam menjadi dua bagian, satu bagian di atas gunung ini dan satu bagian lagi pada gunung itu. Mereka berkata; \"Muhammad telah menyihir kita\". Mereka juga berkata; \"Jika dia telah menyihir kita, namun niscaya dia tidak akan bisa menyihir manusia semuanya.\""
            },
            {
                "number": 1293,
                "arab": "قَالَ حَدَّثَنَا إِسْمَاعِيلُ قَالَ حَدَّثَنَا سَعِيدُ بْنُ إِيَاسٍ الْجُرَيْرِيُّ عَنْ قَيْسِ بْنِ عَبَايَةَ عَنِ ابْنِ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ يَزِيدَ بْنِ عَبْدِ اللَّهِ قَالَسَمِعَنِي أَبِي وَأَنَا أَقُولُ{ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ }فَقَالَ أَيْ بُنَيَّ إِيَّاكَ قَالَ وَلَمْ أَرَ أَحَدًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ أَبْغَضَ إِلَيْهِ حَدَثًا فِي الْإِسْلَامِ مِنْهُ فَإِنِّي قَدْ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَ أَبِي بَكْرٍ وَعُمَرَ وَمَعَ عُثْمَانَ فَلَمْ أَسْمَعْ أَحَدًا مِنْهُمْ يَقُولُهَا فَلَا تَقُلْهَا إِذَا أَنْتَ قَرَأْتَ فَقُلْ{ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ }",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Isma'il] berkata; telah menceritakan kepada kami [Sa'id bin Iyas Al Jurairi] dari [Qais bin Abayah] dari [Ibnu Abdullah bin Mughaffal, Yazid bin Abdullah] berkata; [bapakku] telah mendengarku membaca, BISMILLAHIRRAHMAANIRRAHIIM ketika sholat, Lalu dia berkata; \"Wahai anakku, jangan kau lakukan begitu, --dan saya tidak pernah melihat seorang pun dari kalangan sahabat Nabi Shallallahu'alaihiwasallam yang lebih marah terhadap bid'ah dalam Islam daripadanya--. Sesungguhnya saya pernah sholat bersama Rasulullah Shallallahu'alaihiwasallam, Abu Bakar, 'Umar dan 'Utsman, saya tidak pernah mendengar seorang pun dari mereka mengawalmulai sholat dengan bacaan itu (Bismillaahirrahmaanirrahiim), janganlah kau basmalah itu untuk mengawalmulai sholat. Jika kamu membacanya, maka bacalah, ALHAMDU LILLAHI RABBIL 'ALAMIN.\""
            },
            {
                "number": 1294,
                "arab": "قَالَ حَدَّثَنَا إِسْمَاعِيلُ قَالَ أَخْبَرَنَا يُونُسُ عَنِ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْلَا أَنَّ الْكِلَابَ أُمَّةٌ مِنْ الْأُمَمِ لَأَمَرْتُ بِقَتْلِهَا فَاقْتُلُوا مِنْهَا الْأَسْوَدَ الْبَهِيمَ وَأَيُّمَا قَوْمٍ اتَّخَذُوا كَلْبًا لَيْسَ بِكَلْبِ حَرْثٍ أَوْ صَيْدٍ أَوْ مَاشِيَةٍ نَقَصُوا مِنْ أُجُورِهِمْ كُلَّ يَوْمٍ قِيرَاطًا",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Isma'il] berkata; telah mengabarkan kepada kami [Yunus] dari Al [Hasan] dari [Abdullah bin Mughaffal] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Seandainya anjing bukanlah termasuk sekelompok mahluk dari mahluk yang ada, niscaya saya menyuruh untuk membunuhnya, bunuhlah yang berwarna hitam pekat. Siapa pun yang mengambil anjing bukan anjing yang untuk jaga atau berburu atau untuk ternaknya maka pahalanya akan berkurang setiap hari satu qirat.\" "
            },
            {
                "number": 1295,
                "arab": "قَالَوَكُنَّا نُؤْمَرُ أَنْ نُصَلِّيَ فِي مَرَابِضِ الْغَنَمِ وَلَا نُصَلِّيَ فِي أَعْطَانِ الْإِبِلِ فَإِنَّهَا خُلِقَتْ مِنْ الشَّيَاطِينِ",
                "id": "[Abdullah bin Mughaffal Radliyallahu'anhu] berkata; kami diperintahkan untuk sholat di kandang kambing dan tidak diperkenankan sholat pada kandang unta karena diciptakan dari setan."
            },
            {
                "number": 1296,
                "arab": "قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا كَهْمَسٌ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنِ ابْنِ مُغَفَّلٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ لِمَنْ شَاءَ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Yahya bin Sa'id] berkata; telah menceritakan kepada kami [Kahmas] berkata; telah menceritakan kepada kami [Abdullah bin Buraidah] dari [Ibnu Mughaffal] dari Nabi Shallallahu'alaihiwasallam bersabda: \"Setiap waktu antara dua adzan adalah ada sholat bagi siapa yang menghendakinya.\""
            },
            {
                "number": 1297,
                "arab": "قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَبَهْزٌ قَالَا حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ قَالَ حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُغَفَّلٍقَالَ قَالَ دُلِّيَ جِرَابٌ مِنْ شَحْمٍ يَوْمَ خَيْبَرَ قَالَ فَالْتَزَمْتُهُ قُلْتُ لَا أُعْطِي أَحَدًا مِنْهُ شَيْئًا قَالَ فَالْتَفَتُّ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَبَسَّمُ قَالَ بَهْزٌ إِلَيَّ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dan [Bahz] berkata; telah menceritakan kepada kami [Sulaiman bin Al Mughirah] berkata; telah menceritakan kepada kami [Humaid bin Hilal] berkata; telah menceritakan kepada kami [Abdullah bin Mughaffal] berkata; diturunkan sebuah wadah berisi lemak para Perang Khaibar. (Abdullah bin Mughaffal radliyallahu'anhu) berkata; lalu saya menjaganya, lalu saya katakan saya tidak akan memberikannya sedikit pun kepada seorangpun. (Abdullah bin Mughaffal radliyallahu'anhu) berkata; lalu saya menoleh, ternyata Rasulullah Shallallahu'alaihiwasallam tersenyum. Bahz berkata kepadaku."
            },
            {
                "number": 1298,
                "arab": "قَالَ حَدَّثَنَا يَحْيَى عَنْ هِشَامٍ قَالَ سَمِعْتُ الْحَسَنَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ الْمُزَنِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ التَّرَجُّلِ إِلَّا غِبًّا",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Yahya] dari [Hisyam] berkata; saya telah mendengar [Al Hasan] dari [Abdullah bin Mughaffal Al Muzani], sesungguhnya Nabi Shallallahu'alaihiwasallam melarang seseorang menyisir rambut kecuali secara berkala."
            },
            {
                "number": 1299,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنِي كَهْمَسٌ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنِ ابْنِ مُغَفَّلٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَذْفِ وَقَالَ إِنَّهَا لَا يُنْكَأُ بِهَا عَدُوٌّ وَلَا يُصَادُ بِهَا صَيْدٌ",
                "id": "Telah menceritakan kepada kami [Waki'] berkata; telah menceritakan kepada kami [Kahmas] dari [Abdullah bin Buraidah] dari [Ibnu Mughaffal] berkata; Rasulullah Shallallahu'alaihiwasallam melarang pelemparan dengan menggunakan kerikil kecil dan bersabda: \"Yang demikian karena tidak bisa membunuh musuh dan tidak bisa melukai hewan buruan.\""
            },
            {
                "number": 1300,
                "arab": "قَالَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ قَالَ حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ عَنِ فُضَيْلِ بْنِ زَيْدٍ الرَّقَاشِيِّ قَالَكُنَّا عِنْدَ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَ فَتَذَاكَرْنَا الشَّرَابَ فَقَالَ الْخَمْرُ حَرَامٌ قُلْتُ لَهُ الْخَمْرُ حَرَامٌ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ قَالَ إِيشْ تُرِيدُ تُرِيدُ مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ الدُّبَّاءِ وَالْحَنْتَمِ وَالْمُزَفَّتِقَالَ قُلْتُ مَا الْحَنْتَمُ قَالَ كُلُّ خَضْرَاءَ وَبَيْضَاءَ قَالَ قُلْتُ مَا الْمُزَفَّتُ قَالَ كُلُّ مُقَيَّرٍ مِنْ زِقٍّ أَوْ غَيْرِهِ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Yunus bin Muhammad] berkata; telah menceritakan kepada kami [Abdul Wahid] berkata; telah menceritakan kepada kami ['Ashim Al Ahwal] dari [Fudlail bin Zaid Ar Raqasyi] berkata; kami sedang berada pada [Abdullah bin Mughaffal] lalu kami memperbincangkan tentang minuman. Lalu dia berkata 'Arak adalah haram', lalu saya bertanya kepadanya, 'Apakah arak haram dalam kitab Allah Azzawajalla?. Dia berkata; kamu mau tahu, kamu mau tahu, apa yang telah saya dengar dari Rasulullah Shallallahu'alaihiwasallam. Saya telah mendengar Rasulullah Shallallahu'alaihiwasallam melarang ad-duba`(bejana yang terbuat dari buah sejenis labu untuk mengoplos anggur), hantam (bejana yang terbuat dari tanah, rambut dan darah untuk mengoplos anggur) dan Al muzaffat. Saya bertanya, apakah hantam itu? Dia menjawab, semua yang berwarna hijau dan putih. Saya bertanya, apakah Al muzaffat)? Dia menjawab, semua bejana yang yang terukir dengan cat atau ter ataupun yang lainnya untuk mengoplos anggur."
            },
            {
                "number": 1301,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَعَبْدُ الْأَعْلَى قَالَا حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَقْطَعُ الصَّلَاةَ الْمَرْأَةُ وَالْكَلْبُ وَالْحِمَارُ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] dan [Abdul `A'la] berkata; telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Abdullah bin Mughaffal] sesungguhnya Rasulullah Shallallahu'alaihiwasallam bersabda: \"Yang dapat memutus sholat adalah wanita, anjing dan keledai.\""
            },
            {
                "number": 1302,
                "arab": "قَالَ حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا الْمُبَارَكُ عَنِ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَبِعَ جِنَازَةً حَتَّى يُصَلِّيَ عَلَيْهَا فَلَهُ قِيرَاطٌ وَمَنْ انْتَظَرَهَا حَتَّى يُفْرَغَ مِنْهَا فَلَهُ قِيرَاطَانِ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Abu Nadlr] berkata; telah menceritakan kepada kami [Al Mubarak] dari [Al Hasan] dari [Abdullah bin Mughaffal] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Barangsiapa yang mengiringi jenazah sampai disholatinya, maka dia mendapatkan satu qirath dan barangsiapa yang menunggunya sampai selesai maka dia mendapatkan dua qirath.\""
            },
            {
                "number": 1303,
                "arab": "قَالَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَزْهَرَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَخَلَّلُ النَّاسَ يَوْمَ حُنَيْنٍ يَسْأَلُ عَنْ مَنْزِلِ خَالِدِ بْنِ الْوَلِيدِ فَأُتِيَ بِسَكْرَانَ فَأَمَرَ مَنْ كَانَ مَعَهُ أَنْ يَضْرِبُوهُ بِمَا كَانَ فِي أَيْدِيهِمْ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Zaid bin Al Hubab] berkata; telah menceritakan kepadaku [Usamah bin Zaid] berkata; telah menceritakan kepadaku [Az Zuhri] dari [Abdurrahman bin Azhar] berkata; saya melihat Rasulullah Shallallahu'alaihiwasallam berada di tengah-tengah orang-orang pada Perang Hunain untuk mencari rumah Khalid bin Al Walid. Tiba-tiba dibawa ke hadapan beliau seorang pemabuk, dan beliau menyuruh para sahabat yang bersamanya untuk mencambuk dengan peralatan seadanya yang mereka bawa."
            },
            {
                "number": 1304,
                "arab": "قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ عَنِ الزُّهْرِيِّ أَنَّهُ سَمِعَ عَبْدَ الرَّحْمَنِ بْنَ أَزْهَرَ يَقُولُرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزَاةَ يَوْمِ الْفَتْحِ وَأَنَا غُلَامٌ شَابٌّ يَتَخَلَّلُ النَّاسَ يَسْأَلُ عَنْ مَنْزِلِ خَالِدِ بْنِ الْوَلِيدِ فَأُتِيَ بِشَارِبٍ فَأَمَرَهُمْ فَضَرَبُوهُ بِمَا فِي أَيْدِيهِمْ فَمِنْهُمْ مَنْ ضَرَبَهُ بِعَصًا وَمِنْهُمْ مَنْ ضَرَبَهُ بِسَوْطٍ وَحَثَى عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التُّرَابَ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami ['Utsman bin 'Umar] berkata; telah menceritakan kepada kami [Usamah Zaid] dari [Az Zuhri] sesungguhnya telah mendengar [Abdurrahman bin Al Azhar] berkata; saya melihat Rasulullah Shallallahu'alaihiwasallam pada saat Fathu Makkah, waktu itu masih sangat muda, beliau berada di tengah-tengah mereka untuk mencari rumah Khalid bin Al Walid. Tiba-tiba dibawa ke hadapan beliau seorang peminum, lalu beliau menyuruh agar dia di cambuk. Mereka mencambuknya dengan peralatan yang berada di tangan mereka. Diantara mereka ada yang mencambuk dengan tongkat, ada yang mencambuknya dengan cemeti sedangkan Rasulullah Shallallahu'alaihiwasallam mengambil tanah dengan kedua telapak tangannya."
            },
            {
                "number": 1305,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ قَالَ وَكَانَ عَبْدُ الرَّحْمَنِ بْنُ الْأَزْهَرِ يُحَدِّثُأَنَّ خَالِدَ بْنَ الْوَلِيدِ بْنِ الْمُغِيرَةِ جُرِحَ يَوْمَئِذٍ وَكَانَ عَلَى الْخَيْلِ خَيْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ابْنُ الْأَزْهَرِ قَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَمَا هَزَمَ اللَّهُ الْكُفَّارَ وَرَجَعَ الْمُسْلِمُونَ إِلَى رِحَالِهِمْ يَمْشِي فِي الْمُسْلِمِينَ وَيَقُولُ مَنْ يَدُلُّ عَلَى رَحْلِ خَالِدِ بْنِ الْوَلِيدِ قَالَ فَمَشَيْتُ أَوْ قَالَ فَسَعَيْتُ بَيْنَ يَدَيْهِ وَأَنَا مُحْتَلِمٌ أَقُولُ مَنْ يَدُلُّ عَلَى رَحْلِ خَالِدٍ حَتَّى حَلَلْنَا عَلَى رَحْلِهِ فَإِذَا خَالِدُ بْنُ الْوَلِيدِ مُسْتَنِدٌ إِلَى مُؤْخِرَةِ رَحْلِهِ فَأَتَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَظَرَ إِلَى جُرْحِهِ قَالَ الزُّهْرِيُّ وَحَسِبْتُ أَنَّهُ قَالَ وَنَفَثَ فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَآخِرُ مُسْنَدِ الْمَكِّيِّينَ وَالْمَدَنِيِّينَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَضِيَ اللَّهُ تَعَالَى عَنْهُمْ",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Abdurrazzaq] dari [Ma'mar] dari [Az Zuhri] berkata; dan [Abdurrahman bin Al Azhar] menceritakan sesungguhnya Khalid bin Al Walid bin Al Mughirah terluka pada hari itu, yaitu saat berada pada kuda Rasulullah Shallallahu'alaihiwasallam. Ibnu Al Azhar berkata; saya melihat Rasulullah Shallallahu'alaihiwasallam setelah Allah mengalahkan orang-orang kafir dan kaum muslimin kembali pada kendaraan mereka, beliau berjalan di tengah-tengah kaum muslimin dan bersabda: \"Siapa yang mau menunjukkan kepada kendaraan Al Khalid bin Al Walid?.(Ibnu Al Azhar Radliyallahu'anhu) berkata; lalu saya berjalan, atau berkata; lalu saya bersegera ke hadapan beliau dan saat itu saya dalam keadaan habis mimpi basah. Saya berkata; siapa yang bisa menunjukkan kepadaku tentang kendaraan Khalid bin Al Walid, sampai kami mendapatkan pada kendaraannya, ternyata dia dalam keadaan bersandar pada kendaraannya lalu Rasulullah Shallallahu'alaihiwasallam menemuinya dan beliau melihat lukanya. [Az Zuhri] berkata; seingat saya dia berkata; lalu Rasulullah Shallallahu'alaihiwasallam memberi tiupan kepadanya."
            },
            {
                "number": 1306,
                "arab": "قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ أَخْبَرَنَا أَبِي عَنْ صَالِحِ بْنِ كَيْسَانَ وَحَدَّثَ ابْنُ شِهَابٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ عَنِ ابْنِ عَبَّاسٍ أَنَّهُ أَخْبَرَهُ أَنَّ خَالِدَ بْنَ الْوَلِيدِ أَخْبَرَهُأَنَّهُ دَخَلَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى مَيْمُونَةَ بِنْتِ الْحَارِثِ وَهِيَ خَالَتُهُ فَقَدَّمَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَحْمَ ضَبٍّ جَاءَتْ بِهِ أُمُّ حُفَيْدٍ بِنْتُ الْحَارِثِ مِنْ نَجْدٍ وَكَانَتْ تَحْتَ رَجُلٍ مِنْ بَنِي جَعْفَرٍ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَأْكُلُ شَيْئًا حَتَّى يَعْلَمَ مَا هُوَ فَقَالَ بَعْضُ النِّسْوَةِ أَلَا تُخْبِرْنَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يَأْكُلُ فَأَخْبَرْنَهُ أَنَّهُ لَحْمُ ضَبٍّ فَتَرَكَهُ فَقَالَ خَالِدٌ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَرَامٌ هُوَ قَالَ لَا وَلَكِنَّهُ طَعَامٌ لَيْسَ فِي قَوْمِي فَأَجِدُنِي أَعَافُهُ قَالَ خَالِدٌ فَاجْتَرَرْتُهُ إِلَيَّ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْظُرُقَالَ ابْنُ شِهَابٍ وَحَدَّثَهُ الْأَصَمُّ يَعْنِي يَزِيدَ بْنَ الْأَصَمِّ عَنْ مَيْمُونَةَ وَكَانَ فِي حَجْرِهَا",
                "id": "(Ahmad bin Hanbal radliyallahu'anhu) berkata; telah menceritakan kepada kami [Ya'qub bin Ibrahim] berkata; telah mengabarkan kepada kami [bapakku] dari [Shalih bin Kaisan] dan [Ibnu Syihab] menceritakan dari [Abu Umamah bin Sahal] dari [Ibnu 'Abbas] sesungguhnya dia mengabarinya, sesungguhnya [Khalid bin Walid] mengabarinya, pernah dia masuk ke dalam rumah Maimunah binti Al Harits bersama Rasulullah Shallallahu'alaihiwasallam. Dia adalah bibinya. Selanjutnya dia menyuguhkan daging biawak kepada Rasulullah Shallallahu'alaihiwasallam yang dibawa Ummu Hufaid binti Al Harits dari Najd, yang sebelumnya ditangkap oleh seorang laki-laki dari Bani ja'far. adalah Rasulullah Shallallahu'alaihiwasallam tidak pernah memakan sesuatu sehingga beliau mengetahui betul apa yang akan dimakan. Sebagian kaum wanita berkata; \"Kenapa kalian tidak mengabarkan kepada Rasulullah Shallallahu'alaihiwasallam, apa yang hendak beliau makan tersebut!\" Lalu saya berkata; \"Ini adalah biawak, \" Rasulullah Shallallahu'alaihiwasallam pun meninggalkannya. Saya Khalid berkata; \"Saya bertanya kepada Rasulullah Shallallahu'alaihiwasallam? apakah daging itu haram?. menjawab, \"Tidak, tapi saya tidak mendapatkannya di daerahku dan saya tidak menyukainya.\" Khalid berkata; \"Lalu saya mendekatinya, kemudian memakannya dan Rasulullah Shallallahu'alaihiwasallam melihatnya.\" [Ibnu Syihab] berkata; dan [Al Asham] yaitu Yazid bin Al Asham dari [Maimunah], biawak itu berada di rumahnya."
            },
            {
                "number": 1307,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا مَالِكٌ عَنِ ابْنِ شِهَابٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ وَخَالِدِ بْنِ الْوَلِيدِأَنَّهُمَا دَخَلَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْتَ مَيْمُونَةَ فَأُتِيَ بِضَبٍّ مَحْنُوذٍ فَأَهْوَى إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بَعْضُ النِّسْوَةِ أَخْبِرُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يُرِيدُ أَنْ يَأْكُلَ فَقَالُوا هُوَ ضَبٌّ يَا رَسُولَ اللَّهِ فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ فَقُلْتُ أَحَرَامٌ هُوَ يَا رَسُولَ اللَّهِ قَالَ لَا وَلَكِنْ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ قَالَ خَالِدٌ فَاجْتَرَرْتُهُ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْظُرُ",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari [Abu Umamah bin Sahal] dari [Abdullah bin 'Abbas] dan [Khalid bin Walid], keduanya bersama Rasulullah Shallallahu'alaihiwasallam memasuki rumah Maimunah lalu dihidangkan kepada mereka biawak yang sudah dibakar, dan Rasulullah Shallallahu'alaihiwasallam menyukainya. Lalu sebagian kaum wanita berkata; \"Tolong kabarkan kepada Rasulullah Shallallahu'alaihiwasallam, apa yang hendak beliau makan tersebut!.\" mereka berkata; \"Ini adalah biawak, Wahai Rasulullah, \" Rasulullah Shallallahu'alaihiwasallam lantas mengangkat tangannya. Saya bertanya, \"Apakah itu haram Wahai Rasulullah?\" beliau menjawab, \"Tidak, hanya saya tidak mendapatkannya pada daerahku dan saya tidak meyukainya.\" Khalid berkata; \"Lalu saya mendekatinya, kemudian memakannya sementara Rasulullah Shallallahu'alaihiwasallam melihatnya.\""
            },
            {
                "number": 1308,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْعَوَّامُ بْنُ حَوْشَبٍ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ عَلْقَمَةَ عَنْ خَالِدِ بْنِ الْوَلِيدِ قَالَكَانَ بَيْنِي وَبَيْنَ عَمَّارِ بْنِ يَاسِرٍ كَلَامٌ فَأَغْلَظْتُ لَهُ فِي الْقَوْلِ فَانْطَلَقَ عَمَّارٌ يَشْكُونِي إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَ خَالِدٌ وَهُوَ يَشْكُوهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَجَعَلَ يُغْلِظُ لَهُ وَلَا يَزِيدُ إِلَّا غِلْظَةً وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَاكِتٌ لَا يَتَكَلَّمُ فَبَكَى عَمَّارٌ وَقَالَ يَا رَسُولَ اللَّهِ أَلَا تَرَاهُ فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأْسَهُ قَالَ مَنْ عَادَى عَمَّارًا عَادَاهُ اللَّهُ وَمَنْ أَبْغَضَ عَمَّارًا أَبْغَضَهُ اللَّهُقَالَ خَالِدٌ فَخَرَجْتُ فَمَا كَانَ شَيْءٌ أَحَبَّ إِلَيَّ مِنْ رِضَا عَمَّارٍ فَلَقِيتُهُ فَرَضِيَ قَالَ عَبْد اللَّهِ سَمِعْتُهُ مِنْ أَبِي مَرَّتَيْنِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Al Awwam bin Hautsab] dari [Sallamah bin Kuhail] dari ['Alqamah] dari [Khalid bin Al Walid] berkata; terjadi sebuah perdebatan antara aku dengan Amar bin Yasir sehingga saya sangat murka kepadanya. Dia juga mengadukanku kepada Nabi Shallallahu'alaihiwasallam lalu Khalid datang dan mengadukannya kepada Nabi Shallallahu'alaihiwasallam. (Khalid bin Al Walid Radliyallahu'anhu) berkata; dia bertambah marah dan Nabi Shallallahu'alaihiwasallam diam dan tidak mengucapkan sepatah kata pun, lalu 'Ammar menangis dan berkata; \"Wahai Rasulullah, bagaimana pendapatmu?\" Lalu Rasulullah Shallallahu'alaihiwasallam mengangkat kepalanya, bersabda: \"Barangsiapa memusuhi 'Ammar niscaya Allah memusuhinya. Barangsiapa membuat marah 'Ammar, Allah membuat dia marah\". Khalid berkata; saya keluar maka tidak ada yang lebih saya senangi selain kerelaan 'Ammar, lalu saya menemuinya dan dia meredlaiku. Abdullah berkata; saya mendengar dari bapakku dua kali."
            },
            {
                "number": 1309,
                "arab": "حَدَّثَنَا عَتَّابٌ حَدَّثَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ الْمُبَارَكِ حَدَّثَنَا يُونُسُ عَنِ الزُّهْرِيِّ أَخْبَرَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ الْأَنْصَارِيُّ أَنَّ ابْنَ عَبَّاسٍ أَخْبَرَهُ أَنَّ خَالِدَ بْنَ الْوَلِيدِ الَّذِي يُقَالُ لَهُ سَيْفُ اللَّهِ أَخْبَرَهُأَنَّهُ دَخَلَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ خَالَتُهُ وَخَالَةُ ابْنِ عَبَّاسٍ فَوَجَدَ عِنْدَهَا ضَبًّا مَحْنُوذًا قَدِمَتْ بِهِ أُخْتُهَا حُفَيْدَةُ بِنْتُ الْحَارِثِ مِنْ نَجْدٍ فَقَدَّمَتْ الضَّبَّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ قَلَّمَا يُقَدِّمُ يَدَهُ لِطَعَامٍ حَتَّى يُحَدَّثَ بِهِ وَيُسَمَّى لَهُ فَأَهْوَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ إِلَى الضَّبِّ فَقَالَتْ امْرَأَةٌ مِنْ النِّسْوَةِ الْحُضُورِ أَخْبِرْنَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا قَدَّمْتُنَّ إِلَيْهِ قُلْنَ هُوَ الضَّبُّ يَا رَسُولَ اللَّهِ فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ عَنْ الضَّبِّ فَقَالَ خَالِدُ بْنُ الْوَلِيدِ أَحَرَامٌ الضَّبُّ يَا رَسُولَ اللَّهِ قَالَ لَا وَلَكِنْ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ قَالَ خَالِدٌ فَاجْتَرَرْتُهُ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْظُرُ إِلَيَّ فَلَمْ يَنْهَنِي",
                "id": "Telah menceritakan kepada kami ['Attab] telah menceritakan kepada kami [Abdullah] yaitu Ibnu Al mubarak, telah menceritakan kepada kami [Yunus] dari [Az Zuhri] telah mengabarkan kepadaku [Abu Umamah bin Sahl bin Hunaif Al Anshari] sesungguhnya [Ibnu Abbas] mengabarinya, sesungguhnya [Khalid bin Al Walid] yang dijuluki dengan pedang Allah mengabarinya, pernah dia bersama Rasulullah Shallallahu'alaihiwasallam memasuki rumah Maimunah, salah seorang istri Nabi Shallallahu'alaihiwasallam, dia adalah bibinya dan bibi Ibnu Abbas. Lalu dia mendapatkan di sisinya biawak yang sudah disate, yang sate tersebut disuguhkan oleh saudara perempuannya, yaitu Hufaidah binti Al Harits dari Najd. Lalu dia menyuguhkan biawak kepada Rasulullah Shallallahu'alaihiwasallam dan sangat jarang beliau disajikan suatu makanan sampai beliau diberitahukan nama dan jenis makanan tersebut. Tiba-tiba beliau ingin menjulurkan tangannya kepada daging biawak tersebut. Kontan salah seorang wanita dari mereka datang dan berkata; 'Heih tolong kabarkan kepada Rasulullah Shallallahu'alaihiwasallam tentang apa yang kalian suguhkan kepada beliau.' kami berkata; \"Itu daging biawak Wahai Rasulullah?\" Rasulullah Shallallahu'alaihiwasallam bergegas mengangkat tangannya dari biawak tersebut. Lalu Khalid bin Al Walid bertanya, \"Apakah itu haram, Wahai Rasulullah?\" beliau bersabda: \"Tidak, tapi saya tidak mendapatkannya pada kaumku dan saya membencinya.\" Khalid berkata; \"Lalu saya mendekatkan kepadaku, saya memakannya dan Rasulullah Shallallahu'alaihiwasallam melihatku dan beliau tidak melarangku.\""
            },
            {
                "number": 1310,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ يَعْنِي الْأَبْرَشَ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ سُلَيْمٍ أَبُو سَلَمَةَ عَنْ صَالِحٍ يَعْنِي ابْنَ يَحْيَى بْنِ الْمِقْدَامِ عَنْ جَدِّهِ الْمِقْدَامِ بْنِ مَعْدِي كَرِبَ قَالَغَزَوْنَا مَعَ خَالِدِ بْنِ الْوَلِيدِ الصَّائِفَةَ فَقَرِمَ أَصْحَابُنَا إِلَى اللَّحْمِ فَسَأَلُونِي فَقَالُوا أَتَأْذَنُ لَنَا أَنْ نَذْبَحَ رَمْكَةً لَهُ فَدَفَعْتُهَا إِلَيْهِمْ فَحَبَلُوهَا ثُمَّ قُلْتُ مَكَانَكُمْ حَتَّى آتِيَ خَالِدًا فَأَسْأَلَهُ قَالَ فَأَتَيْتُهُ فَسَأَلْتُهُ فَقَالَ غَزَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزْوَةَ خَيْبَرَ فَأَسْرَعَ النَّاسُ فِي حَظَائِرِ يَهُودَ فَأَمَرَنِي أَنْ أُنَادِيَ الصَّلَاةُ جَامِعَةٌ وَلَا يَدْخُلُ الْجَنَّةَ إِلَّا مُسْلِمٌ ثُمَّ قَالَ أَيُّهَا النَّاسُ إِنَّكُمْ قَدْ أَسْرَعْتُمْ فِي حَظَائِرِ يَهُودَ أَلَا لَا تَحِلُّ أَمْوَالُ الْمُعَاهَدِينَ إِلَّا بِحَقِّهَا وَحَرَامٌ عَلَيْكُمْ لُحُومُ الْحُمُرِ الْأَهْلِيَّةِ وَخَيْلِهَا وَبِغَالِهَا وَكُلِّ ذِي نَابٍ مِنْ السِّبَاعِ وَكُلِّ ذِي مِخْلَبٍ مِنْ الطَّيْرِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdul Malik] telah menceritakan kepada kami [Muhammad bin Harb] yaitu Al Abrasy, berkata; telah menceritakan kepada kami [Sulaiman bin Sulaim Abu Salamah] dari [Shalih] yaitu Ibnu Yahya bin Al Miqdam dari [kakeknya, Al Miqdam bin Ma'di Kariba], berkata; kami berperang bersama [Khalid bin Al Walid] pada musim panas lalu sahabat kami kecanduan daging, lalu mereka meminta kepadaku. Mereka berkata; \"Apakah anda mengijinkan, jika kami menyembelih seekor unta yang lemah?\" Lalu saya menyerahkan kepada mereka dan mereka memerasnya lalu saya berkata; \"Tetaplah kalian berada pada tempat kalian, sampai saya mendatangi Khalid dan saya akan menanyakan.\" (Al Miqdam bin Ma'di Kariba Radliyallahu'anhu) berkata; lalu saya mendatanginya dan menanyakannnya. Dia berkata; kami berperang bersama Rasulullah Shallallahu'alaihiwasallam Perang Khaibar, lalu orang-orang bersegera dalam menyerang kandang-kandang ternak kaum Yahudi, lalu beliau menyuruhku untuk menyerukan: Tunaikanlah sholat berjama'ah, ketahuilah bahwa tidak bakalan masuk surga kecuali orang muslim, lalu bersabda: \"Wahai manusia, kalian telah bersegera dalam kandang-kandang milik orang Yahudi. Ketahuilah, sesungguhnya tidak halal harta orang yang berada dalam perjanjian kecuali sesuai haknya. Haram bagi kalian daging keledai jinak, kuda dan bighalnya, semua hewan bertaring dari hewan buas dan setiap burung yang berkuku tajam.\""
            },
            {
                "number": 1311,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ رَبِّهِ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ حَدَّثَنِي ثَوْرُ بْنُ يَزِيدَ عَنْ صَالِحِ بْنِ يَحْيَى بْنِ الْمِقْدَامِ بْنِ مَعْدِي كَرِبَ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ خَالِدِ بْنِ الْوَلِيدِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ لُحُومِ الْخَيْلِ وَالْبِغَالِ وَالْحَمِيرِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Abdu Rabbihi] telah menceritakan kepada kami [Baqiyyah bin Al Walid] telah menceritakan kepadaku [Tsaur bin Yazid] dari [Shalih bin Yahya bin Al Miqdam bin Ma'di Karib] dari [Bapaknya] dari [kakeknya] dari [Khalid bin Al Walid] berkata; Rasulullah Shallallahu'alaihiwasallam melarang memakan daging kuda, bighal (keturunan campuran antara kuda dengan keledai) dan keledai."
            },
            {
                "number": 1312,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ الْخَوْلَانِيُّ حَدَّثَنَا أَبُو سَلَمَةَ الْحِمْصِيُّ عَنْ صَالِحِ بْنِ يَحْيَى بْنِ الْمِقْدَامِ عَنِ ابْنِ الْمِقْدَامِ عَنْ جَدِّهِ الْمِقْدَامِ بْنِ مَعْدِي كَرِبَ قَالَغَزَوْتُ مَعَ خَالِدِ بْنِ الْوَلِيدِ الصَّائِفَةَ فَقَرِمَ أَصْحَابِي إِلَى اللَّحْمِ فَقَالُوا أَتَأْذَنُ لَنَا أَنْ نَذْبَحَ رَمْكَةً لَهُ قَالَ فَحَبَلُوهَا فَقُلْتُ مَكَانَكُمْ حَتَّى آتِيَ خَالِدَ بْنَ الْوَلِيدِ فَأَسْأَلَهُ عَنْ ذَلِكَ فَأَتَيْتُهُ فَأَخْبَرْتُهُ خَبَرَ أَصْحَابِي فَقَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزْوَةَ خَيْبَرَ فَأَسْرَعَ النَّاسُ فِي حَظَائِرِ يَهُودَ فَقَالَ يَا خَالِدُ نَادِ فِي النَّاسِ أَنَّ الصَّلَاةَ جَامِعَةٌ لَا يَدْخُلُ الْجَنَّةَ إِلَّا مُسْلِمٌ فَفَعَلْتُ فَقَامَ فِي النَّاسِ فَقَالَ يَا أَيُّهَا النَّاسُ مَا بَالُكُمْ أَسْرَعْتُمْ فِي حَظَائِرِ يَهُودَ أَلَا لَا تَحِلُّ أَمْوَالُ الْمُعَاهَدِينَ إِلَّا بِحَقِّهَا وَحَرَامٌ عَلَيْكُمْ حُمُرُ الْأَهْلِيَّةِ وَالْإِنْسِيَّةِ وَخَيْلُهَا وَبِغَالُهَا وَكُلُّ ذِي نَابٍ مِنْ السِّبَاعِ وَكُلُّ ذِي مِخْلَبٍ مِنْ الطَّيْرِ",
                "id": "Telah menceritakan kepada kami [Ali bin Bahr] telah menceritakan kepada kami [Muhammad bin Harb Al Khaulani] telah menceritakan kepada kami [Abu Salamah Al Himshi] dari [Shalih bin Yahya bin Al Miqdam] dari [Ibnu Al Miqdam] dari [kakeknya Al Miqdam bin Ma'di Kariba], berkata; kami berperang bersama [Khalid bin Al Walid] pada musim panas lalu sahabat kami kecanduan daging, lalu mereka berkata; \"Apakah kamu mengijinkan kepada kami, jika kami menyembelih seekor unta yang lemah?\" (Al Miqdam bin Ma'di Kariba Radliyallahu'anhu) berkata; kontan mereka memerasnya, saya berkata; \"Tetaplah kalian berada pada tempat kalian, sampai saya mendatangi Khalid dan saya akan menanyakan tentang hal itu.\" lalu saya mengabari tentang keadaan para sahabatku, lalu (Khalid bin Al Walid Radliyallahu'anhu) berkata; \"Saya berperang bersama Rasulullah Shallallahu'alaihiwasallam Perang Khaibar, lalu orang-orang bersegera dalam menyerang kandang-kandang milik orang Yahudi, \" lalu beliau menyuruhku, \"Wahai Khalid, serukanlah kepada orang-orang: 'Tunaikanlah sholat dengan berjama'ah, dan tidak akan masuk surga kecuali orang muslim\", lalu hal itu saya lakukan. Lantas beliau berdiri ditengah orang-orang dan bersabda: Wahai manusia, bagaimana kalian bisa terburu-buru dalam menyerang kandang-kandang milik orang Yahudi?. Ketahuilah, sesungguhnya tidak halal harta orang yang berada dalam perjanjian kecuali sesuai haknya. Haram bagi kalian daging keledai jinak, kuda dan bighalnya, semua hewan yang bertaring dari hewan buas dan setiap burung yang berkuku tajam.\""
            },
            {
                "number": 1313,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنِ أَبِي نَجِيحٍ عَنْ خَالِدِ بْنِ حَكِيمِ بْنِ حِزَامٍ قَالَتَنَاوَلَ أَبُو عُبَيْدَةَ رَجُلًا بِشَيْءٍ فَنَهَاهُ خَالِدُ بْنُ الْوَلِيدِ فَقَالَ أَغْضَبْتَ الْأَمِيرَ فَأَتَاهُ فَقَالَ إِنِّي لَمْ أُرِدْ أَنْ أُغْضِبَكَ وَلَكِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ أَشَدَّ النَّاسِ عَذَابًا يَوْمَ الْقِيَامَةِ أَشَدُّ النَّاسِ عَذَابًا لِلنَّاسِ فِي الدُّنْيَا",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Amr bin Dinar] dari [Abu Najih] dari [Khalid bin Hakim bin Hizam] berkata; Abu 'Ubaidah memberi hukuman kepada seorang laki-laki dengan suatu hal, lalu [Khalid bin Walid] melarangnya, lalu (Abu 'Ubaidah) berkata; 'Apakah kamu memancing emosi seorang pemimpin?, lalu dia (Khalid bin Al Walid radliyallahu'anhu) menemuinya dan berkata; \"Saya tidak bermaksud menjadikan kamu marah hanya saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: 'Orang yang paling keras siksanya pada Hari Kiamat adalah orang yang paling keras menyiksa orang ketika dia berada di di dunia'.\""
            },
            {
                "number": 1314,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَاصِمٍ عَنْ أَبِي وَائِلٍ عَنْ عَزْرَةَ بْنِ قَيْسٍ عَنْ خَالِدِ بنِ الْوَلِيدِ قَالَكَتَبَ إِلَيَّ أَمِيرُ الْمُؤْمِنِينَ حِينَ أَلْقَى الشَّامَ بَوَانِيَةً بَثْنِيَةً وَعَسَلًا وَشَكَّ عَفَّانُ مَرَّةً قَالَ حِينَ أَلْقَى الشَّامَ كَذَا وَكَذَا فَأَمَرَنِي أَنْ أَسِيرَ إِلَى الْهِنْدِ وَالْهِنْدُ فِي أَنْفُسِنَا يَوْمَئِذٍ الْبَصْرَةُ قَالَ وَأَنَا لِذَلِكَ كَارِهٌ قَالَ فَقَامَ رَجُلٌ فَقَالَ لِي يَا أَبَا سُلَيْمَانَ اتَّقِ اللَّهَ فَإِنَّ الْفِتَنَ قَدْ ظَهَرَتْ قَالَ فَقَالَ وَابْنُ الْخَطَّابِ حَيٌّ إِنَّمَا تَكُونُ بَعْدَهُ وَالنَّاسُ بِذِي بِلِّيَانَ وَذِي بِلِّيَانَ بِمَكَانِ كَذَا وَكَذَا فَيَنْظُرُ الرَّجُلُ فَيَتَفَكَّرُ هَلْ يَجِدُ مَكَانًا لَمْ يَنْزِلْ بِهِ مِثْلُ مَا نَزَلَ بِمَكَانِهِ الَّذِي هُوَ فِيهِ مِنْ الْفِتْنَةِ وَالشَّرِّ فَلَا يَجِدُهُ قَالَ وَتِلْكَ الْأَيَّامُ الَّتِي ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ يَدَيْ السَّاعَةِ أَيَّامُ الْهَرْجِ فَنَعُوذُ بِاللَّهِ أَنْ تُدْرِكَنَا وَإِيَّاكُمْ تِلْكَ الْأَيَّامُ",
                "id": "Telah menceritakan kepada kami ['Affan] berkata; telah menceritakan kepada kami [Abu Awanah] dari ['Ashim] dari [Abu Wail] dari ['Azrah bin Qais] dari [Khalid bin Al Walid] berkata; Amirul mukminin berkirim surat kepadaku ketika negeri Syam mendatangkan produksi-produksi pertaniannya, alias dimasa-masa kesuburannya, atau saat menghasilkan produksi madunya, -- ['Affan] ragu kepastian redaksinya hingga terkadang dia berkata; 'Ketika Syam menghasilkan ini dan itu--, lalu dia (Amirul Mukmin) menyuruhku untuk pergi menuju India, sedang India yang dimaksud menurut kami saat itu adalah Basrah. (Khalid bin Al Walid radliyallahu'anhu) berkata; padahal saya sangat membenci negeri itu. Lalu ada seorang laki-laki berkata kepadaku, \"Wahai Abu Sulaiman, bertaqwalah kepada Allah. Fitnah-fitnah telah muncul\". (Khalid bin Al Walid radliyallahu'anhu) berkata; lalu dia berkata; sedangkan Ibnu Al Khattab saat itu masih hidup, dan hal itu terjadi setelahnya. Sedang orang-orang berada pada Dzil Baliyyan, dan Dzil Baliyan adalah di tempat ini dan itu. Lalu ada seorang laki-laki mengamati-amati dan berfikir, apakah dia mendapatkan suatu tempat yang dia singgahi pada saat adanya fitnah dan kejelekan namun tidak juga ia mendapatkannya?. (Khalid bin Al Walid radliyallahu'anhu) berkata; \"Itu adalah hari-hari yang telah disebutkan Rasulullah Shallallahu'alaihiwasallam tentang tanda-tanda Hari Kiamat yaitu hari pembunuhan, lalu kami berlindung kepada Allah jika kami sampai mendapatinya dan jangan sampai kalian menjumpai hari itu\"."
            },
            {
                "number": 1315,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ يُحَدِّثُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنِ الْأَشْتَرِ قَالَكَانَ بَيْنَ عَمَّارٍ وَبَيْنَ خَالِدِ بْنِ الْوَلِيدِ كَلَامٌ فَشَكَاهُ عَمَّارٌ إِلَى رَسُولِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ مَنْ يُعَادِ عَمَّارًا يُعَادِهِ اللَّهُ عَزَّ وَجَلَّ وَمَنْ يُبْغِضْهُ يُبْغِضْهُ اللَّهُ عَزَّ وَجَلَّ وَمَنْ يَسُبَّهُ يَسُبَّهُ اللَّهُ عَزَّ وَجَلَّفَقَالَ سَلَمَةُ هَذَا أَوْ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Salamah bin Kuhail] berkata; saya telah mendengar [Muhammad bin Abdurrahman] menceritakan dari [Abdurrahman bin Yazid] dari [Al Asytar] berkata; antara Amar dan Khalid bin Al Walid pernah terjadi sebuah perdebatan. Lalu 'Ammar mengadukannya kepada Rasulullah Shallallahu'alaihiwasallam, dan beliau bersabda: \"Barangsiapa memusuhi 'Ammar, niscaya Allah Azzawajalla memusuhinya. Barangsiapa membuat marah 'Ammar, Allah Azzawajalla akan membuat dia marah. Barangsiapa yang mencelanya niscaya Allah Azzawajalla akan mencelanya\". Lalu Salamah berkata; demikian atau semisalnya."
            },
            {
                "number": 1316,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا صَفْوَانُ بْنُ عَمْرٍو قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ وَخَالِدِ بْنِ الْوَلِيدِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يُخَمِّسْ السَّلَبَ",
                "id": "Telah menceritakan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Shafwan bin 'Amr] berkata; telah menceritakan kepadaku [Abdurrahman bin Jubair bin Nufair] dari [Bapaknya] dari [Auf bin Malik Al Asyja'i] dan [Khalid bin Al Walid] sesungguhnya Nabi Shallallahu'alaihiwasallam tidak menjadikan perhiasan dan harta orang yang terbunuh bagian dari khumus. "
            },
            {
                "number": 1317,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ الْجُعْفِيُّ عَنْ زَائِدَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ قَالَاسْتَعْمَلَ عُمَرُ بْنُ الْخَطَّابِ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ عَلَى الشَّامِ وَعَزَلَ خَالِدَ بْنَ الْوَلِيدِ قَالَ فَقَالَ خَالِدُ بْنُ الْوَلِيدِ بُعِثَ عَلَيْكُمْ أَمِينُ هَذِهِ الْأُمَّةِ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَمِينُ هَذِهِ الْأُمَّةِ أَبُو عُبَيْدةَ بْنُ الْجَرَّاحِ قَالَ أَبُو عُبَيْدَةَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ خَالِدٌ سَيْفٌ مِنْ سُيُوفِ اللَّهِ عَزَّ وَجَلَّ وَنِعْمَ فَتَى الْعَشِيرَةِ",
                "id": "Telah menceritakan kepada kami [Husain bin 'Ali Al Ja'fi] dari [Za`idah] dari [Abdul Malik bin 'Umair] berkata; 'Umar bin Khattab pernah mengangkat Abu 'Ubaidah Ibnu Jarah untuk menjadi pejabat di Syam dan menghentikan [Khalid bin Al Walid]. (Abdul Malik bin 'Umair Radliyallahu'anhu) berkata; lalu Khalid bin Al Walid berkata; \"Telah diutus kepada kalian orang kepercayaan umat ini. Saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: 'Orang kepercayaan umat ini adalah Abu 'Ubaidah Ibnu Jarrah'.\" [Abu 'Ubaidah] berkata; \"Saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: 'Khalid adalah salah satu pedang daripada pedang-pedang Allah Azzawajalla dan sebaik-baik pemuda sebuah kaum.\""
            },
            {
                "number": 1318,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا حَرِيزٌ عَنْ يَزِيدَ بْنِ صُلَيْحٍ عَنْ ذِي مِخْمَرٍ وَكَانَ رَجُلًا مِنْ الْحَبَشَةِ يَخْدُمُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَكُنَّا مَعَهُ فِي سَفَرٍ فَأَسْرَعَ السَّيْرَ حِينَ انْصَرَفَ وَكَانَ يَفْعَلُ ذَلِكَ لِقِلَّةِ الزَّادِ فَقَالَ لَهُ قَائِلٌ يَا رَسُولَ اللَّهِ قَدْ انْقَطَعَ النَّاسُ وَرَاءَكَ فَحَبَسَ وَحَبَسَ النَّاسُ مَعَهُ حَتَّى تَكَامَلُوا إِلَيْهِ فَقَالَ لَهُمْ هَلْ لَكُمْ أَنْ نَهْجَعَ هَجْعَةً أَوْ قَالَ لَهُ قَائِلٌ فَنَزَلَ وَنَزَلُوا فَقَالَ مَنْ يَكْلَؤُنَا اللَّيْلَةَ فَقُلْتُ أَنَا جَعَلَنِي اللَّهُ فِدَاءَكَ فَأَعْطَانِي خِطَامَ نَاقَتِهِ فَقَالَ هَاكَ لَا تَكُونُنَّ لُكَعَ قَالَ فَأَخَذْتُ بِخِطَامِ نَاقَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِخِطَامِ نَاقَتِي فَتَنَحَّيْتُ غَيْرَ بَعِيدٍ فَخَلَّيْتُ سَبِيلَهُمَا يَرْعَيَانِ فَإِنِّي كَذَاكَ أَنْظُرُ إِلَيْهِمَا حَتَّى أَخَذَنِي النَّوْمُ فَلَمْ أَشْعُرْ بِشَيْءٍ حَتَّى وَجَدْتُ حَرَّ الشَّمْسِ عَلَى وَجْهِي فَاسْتَيْقَظْتُ فَنَظَرْتُ يَمِينًا وَشِمَالًا فَإِذَا أَنَا بِالرَّاحِلَتَيْنِ مِنِّي غَيْرُ بَعِيدٍ فَأَخَذْتُ بِخِطَامِ نَاقَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِخِطَامِ نَاقَتِي فَأَتَيْتُ أَدْنَى الْقَوْمِ فَأَيْقَظْتُهُ فَقُلْتُ لَهُ أَصَلَّيْتُمْ قَالَ لَا فَأَيْقَظَ النَّاسُ بَعْضُهُمْ بَعْضًا حَتَّى اسْتَيْقَظَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا بِلَالُ هَلْ لِي فِي الْمِيضَأَةِ يَعْنِي الْإِدَاوَةَ قَالَ نَعَمْ جَعَلَنِي اللَّهُ فِدَاءَكَ فَأَتَاهُ بِوَضُوءٍ فَتَوَضَّأَ لَمْ يَلُتَّ مِنْهُ التُّرَابَ فَأَمَرَ بِلَالًا فَأَذَّنَ ثُمَّ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى الرَّكْعَتَيْنِ قَبْلَ الصُّبْحِ وَهُوَ غَيْرُ عَجِلٍ ثُمَّ أَمَرَهُ فَأَقَامَ الصَّلَاةَ فَصَلَّى وَهُوَ غَيْرُ عَجِلٍ فَقَالَ لَهُ قَائِلٌ يَا نَبِيَّ اللَّهِ أَفْرَطْنَا قَالَ لَا قَبَضَ اللَّهُ عَزَّ وَجَلَّ أَرْوَاحَنَا وَقَدْ رَدَّهَا إِلَيْنَا وَقَدْ صَلَّيْنَا",
                "id": "Telah menceritakan kepada kami [Abu Nadlr] telah menceritakan kepada kami [Hariz] dari [Yazid bin Shulaih] dari [Dzi Mihmar], dia adalah seorang laki-laki dari Habasyah yang pernah melayani Nabi Shallallahu'alaihiwasallam. Dia berkata; \"Pernah kami bersama beliau dalam suatu perjalanan, beliau berjalan dengan cepat ketika melakukan perjalanan karena sedikitnya bekal. Lalu ada seseorang yang menegur 'Wahai Rasulullah, orang-orang telah tertinggal jauh di belakang anda' Karena teguran ini beliau menghentikan perjalanannya dan beliau ajak orang-orang menghentikan perjalanannya hingga jumlah sahabat lengkap.\" Beliau bertanya kepada mereka, \"Tidak sebaiknyakah kalian tidur malam sebentar?\" --Atau sepertinya ada seseorang yang berkata kepada beliau \"lantas beliau singgah dan mereka pun ikut singgah\", lalu beliau bertanya, \"Siapa yang hendak menjaga kami pada malam ini?\", Saya berkata; \"Saya, semoga Allah menjadikanku sebagai tebusan anda, \" lalu beliau memberikan kendali untanya kepadaku lalu bersabda: \"Ini dan janganlah kau menjadi orang yang bodoh\". (Dzi Mihmar Al Habasyi Radliyallahu'anhu) berkata; lalu saya mengambil kendali untanya dengan kendali untaku lalu saya menyingkir ke arah yang tidak terlalu jauh, lalu saya lepaskan kedua unta itu dalam keadaan bebas, dan saya terus mengawasi-awasi keduanya sampai saya ketiduran, sehingga saya bisa merasakan panasnya matahari pada wajahku, lalu saya bangun dan saya menoleh ke kanan, ke kiri ternyata saya berada di antara kedua kendaraanku yang jaraknya tidak terlalu jauh dariku. Saya mengambil unta Nabi Shallallahu'alaihiwasallam dengan untaku lalu saya datangi manusia yang terdekat denganku. Orang itu kubangunkan dan saya bertanya, \"Apakah kamu telah sholat?\" dia menjawab, \"Belum, \" lalu orang-orang saling membangunkan satu dengan yang lainnya. Sampai Nabi Shallallahu'alaihiwasallam terbangun lalu bersabda: \"Wahai Bilal, apakah ada air untuk wudlu?\" Dia menjawab, 'Iya', semoga Allah menjadikanku sebagai tawananmu, \" lalu dibawa kepada beliau air wudlu, lalu beliau berwudlu dengan tidak mencampurnya dengan tanah. Lalu beliau memerintahkan Bilal dan langsung mengumandangkan adzan, lalu Nabi Shallallahu'alaihiwasallam berdiri dan sholat dua rekaat sebelum subuh dengan tidak terburu-buru. Bilal disuruhnya mengumandangkan iqamat sholat dengan tergesa-gesa, lalu ada seorang yang berkata; \"Wahai Nabiyullah, apakah kita berarti telah menyepelekan sholat?\" Beliau menjawab, \"Tidak, karena Allah Azzawajalla telah mengambil ruh kita, dan Dialah yang akan mengembalikannya lagi, dan kita telah melakukan sholat.\""
            },
            {
                "number": 1319,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ حَسَّانَ بْنِ عَطِيَّةَ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ ذِي مِخْمَرٍ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ سَتُصَالِحُكُمْ الرُّومُ صُلْحًا آمِنًا ثُمَّ تَغْزُونَ وَهُمْ عَدُوًّا فَتُنْصَرُونَ وَتَسْلَمُونَ وَتَغْنَمُونَ ثُمَّ تَنْصُرُونَ الرُّومَ حَتَّى تَنْزِلُوا بِمَرْجٍ ذِي تُلُولٍ فَيَرْفَعُ رَجُلٌ مِنْ النَّصْرَانِيَّةِ صَلِيبًا فَيَقُولُ غَلَبَ الصَّلِيبُ فَيَغْضَبُ رَجُلٌ مِنْ الْمُسْلِمِينَ فَيَقُومُ إِلَيْهِ فَيَدُقُّهُ فَعِنْدَ ذَلِكَ يَغْدِرُ الرُّومُ وَيَجْمَعُونَ لِلْمَلْحَمَةِ",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Al Auza'i] dari [Hassan bin 'Athiyyah] dari [Khalid bin Ma'dan] dari [Dzi Mikhmar, salah seorang sahabat Nabi Shallallahu'alaihiwasallam] berkata; saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Orang Romawi akan membuat perjanjian kepada kalian dengan suatu perjanjian damai lalu kalian berperang sedangkan mereka adalah musuh, lalu kalian diberi pertolongan dan kalian selamat dan mendapatkan rampasan. Lalu kalian bisa mengalahkan bangsa Romawi sampai kalian di tempat yang sangat subur dan luas yaitu di Dzi Tulul, lalu ada seorang Nasrani yang mengangkat salib lalu berkata; 'Salib telah menang'. Lalu ada seorang muslim yang marah, lalu dia berdiri dan memukulnya, maka saat itu orang Romawi berkhianat dan mereka berkumpul untuk menghadapi perang besAr besaran'."
            },
            {
                "number": 1320,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ هُوَ الْقُرْقُسَائِيُّ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ حَسَّانَ بْنِ عَطِيَّةَ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ ذِي مِخْمَرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُصَالِحُونَ الرُّومَ صُلْحًا آمِنًا وَتَغْزُونَ أَنْتُمْ وَهُمْ عَدُوًّا مِنْ وَرَائِهِمْ فَتَسْلَمُونَ وَتَغْنَمُونَ ثُمَّ تَنْزِلُونَ بِمَرْجٍ ذِي تُلُولٍ فَيَقُومُ إِلَيْهِ رَجُلٌ مِنْ الرُّومِ فَيَرْفَعُ الصَّلِيبَ وَيَقُولُ أَلَا غَلَبَ الصَّلِيبُ فَيَقُومُ إِلَيْهِ رَجُلٌ مِنْ الْمُسْلِمِينَ فَيَقْتُلُهُ فَعِنْدَ ذَلِكَ تَغْدِرُ الرُّومُ وَتَكُونُ الْمَلَاحِمُ فَيَجْتَمِعُونَ إِلَيْكُمْ فَيَأْتُونَكُمْ فِي ثَمَانِينَ غَايَةً مَعَ كُلِّ غَايَةٍ عَشْرَةُ آلَافٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Mu'sab] yaitu Al Qurqusa`i telah menceritakan kepada kami [Al Auza'i] dari [Hassan bin 'Athiyyah] dari [Khalid bin Ma'dan] dari [Jabir bin Nufair] dari [Dzi Mikhmar] dari Nabi Shallallahu'alaihiwasallam bersabda: \"Kalian akan membuat perjanjian damai kepada Orang Romawi, kalian berperang sedangkan kalian dan mereka adalah sama-sama musuh, ada musuh dari belakang mereka. Lalu kalian selamat dan mendapatkan rampasan. Lalu kalian tinggal di tempat yang sangat subur dan luas di Dzi Tulul, lalu ada seorang Romawi yang berdiri dan mengangkat salib lalu berkata; 'Ketahuilah salib telah menang'. Lalu ada seorang muslim yang berdiri dan membunuhnya. Maka saat itu orang Romawi berkhianat dan terjadilah pembunuhan yang sangat dahsyat dan mereka berkumpul untuk menyerang kalian. Mereka mendatangi kalian dalam delapan puluh bendera dan di setiap bendera ada sepuluh ribu orang.\""
            },
            {
                "number": 1321,
                "arab": "حَدَّثَنَا عَبْدُ الْقُدُّوسِ أَبُو الْمُغِيرَةِ قَالَ حَدَّثَنَا حَرِيزٌ يَعْنِي ابْنَ عُثْمَانَ الرَّحَبِيَّ قَالَ حَدَّثَنَا رَاشِدُ بْنُ سَعْدٍ الْمَقْرَائِيُّ عَنْ أَبِي حَيٍّ عَنْ ذِي مِخْمَرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَانَ هَذَا الْأَمْرُ فِي حِمْيَرَ فَنَزَعَهُ اللَّهُ عَزَّ وَجَلَّ مِنْهُمْ فَجَعَلَهُ فِي قُرَيْشٍوَ سَ يَ عُ و دُ إِ لَ يْ هِ مْ وَكَذَا كَانَ فِي كِتَابِ أَبِي مُقَطَّعًا وَحَيْثُ حَدَّثَنَا بِهِ تَكَلَّمَ عَلَى الِاسْتِوَاءِ",
                "id": "Telah menceritakan kepada kami [Abdul Qudus Abu Al Mughirah] berkata; telah menceritakan kepada kami [Hariz] yaitu Ibnu 'Utsman Ar Rahabi, berkata; telah menceritakan kepada kami [Rasyid bin Sa'd bin Al Maqra`i] dari [Abu Hay] dari [Dzi Mihmar] sesungguhnya Rasulullah Shallallahu'alaihiwasallam bersabda: \" Urusan kepemimpinan ini akan berada di Himyar, lantas Allah Azzawajalla mencabutnya dari mereka, lalu memindahkannya kepada orang Quraisy: WA SA YA 'U DU `I LAI HIM (selanjutnya akan kembali kepada mereka) \" demikian yang tertulis dalam kitab bapakku, redaksi s e l a n j u t n y a dalam keadaan terputus-putus, sebagaimana dia telah menceritakan kepada kami, sama ketika dia membacanya."
            },
            {
                "number": 1322,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ قَالَ حَدَّثَنِي مَرْحُومُ بْنُ عَبْدِ الْعَزِيزِ قَالَ حَدَّثَنِي أَبُو نَعَامَةَ السَّعْدِيُّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَخَرَجَ مُعَاوِيَةُ عَلَى حَلْقَةٍ فِي الْمَسْجِدِ فَقَالَ مَا أَجْلَسَكُمْ قَالُوا جَلَسْنَا نَذْكُرُ اللَّهَ عَزَّ وَجَلَّ قَالَ آللَّهِ مَا أَجْلَسَكُمْ إِلَّا ذَاكَ قَالُوا آللَّهِ مَا أَجْلَسَنَا إِلَّا ذَاكَ قَالَ أَمَا إِنِّي لَمْ أَسْتَحْلِفْكُمْ تُهْمَةً لَكُمْ وَمَا كَانَ أَحَدٌ بِمَنْزِلَتِي مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَلَّ عَنْهُ حَدِيثًا مِنِّي وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ عَلَى حَلْقَةٍ مِنْ أَصْحَابِهِ فَقَالَ مَا أَجْلَسَكُمْ قَالُوا جَلَسْنَا نَذْكُرُ اللَّهَ عَزَّ وَجَلَّ وَنَحْمَدُهُ عَلَى مَا هَدَانَا لِلْإِسْلَامِ وَمَنَّ عَلَيْنَا بِكَ قَالَ آللَّهِ مَا أَجْلَسَكُمْ إِلَّا ذَلِكَ قَالُوا آللَّهِ مَا أَجْلَسَنَا إِلَّا ذَلِكَ قَالَ أَمَا إِنِّي لَمْ أَسْتَحْلِفْكُمْ تُهْمَةً لَكُمْ وَإِنَّهُ أَتَانِي جِبْرِيلُ عَلَيْهِ السَّلَام فَأَخْبَرَنِي أَنَّ اللَّهَ عَزَّ وَجَلَّ يُبَاهِي بِكُمْ الْمَلَائِكَةَ",
                "id": "Telah menceritakan kepada kami ['Ali bin Bahr] berkata; telah menceritakan kepadaku [Marhum bin Abdul Aziz] berkata; telah menceritakan kepadaku [Abu Na'amah As-Sa'di] dari [Abu 'Utsman An-Nahdi] dari [Abu Sa'id Al Hudri] berkata; [Mu'awiyah] keluar dari sebuah halaqah di dalam masjid, lalu bertanya, \"Apakah yang membuat kalian duduk?.\" Mereka menjawab, \"Demi Allah, Kami duduk untuk mengingat Allah Azzawajalla.\" Dia bertanya, \"Apakah hanya itu sebab kalian duduk?\" Mereka menjawab, \"Ya.\" Mu'awiyah berkata; \"Maaf, saya meminta kalian bersumpah bukan karena saya ragu terhadap kalian, dan bukan pula karena kedudukanku disisi Rasulullah Shallallahu'alaihiwasallam lantas selainku lebih sedikit hadisnya daripadaku. Ketahuilah, sesungguhnya Rasulullah Shallallahu'alaihiwasallam pernah mendatangi sebuah halaqah sahabatnya, Lalu bertanya, \"Apakah yang membuat kalian duduk?\" mereka menjawab, \"Kami duduk untuk berdzikir kepada Allah Azzawajalla dan kami memuji-Nya karena petunjuk-Nya kepada Islam dan Dia telah mengaruniai kami dengan engkau.\" Beliau bersabda: Demi Allah, tidakkah kalian duduk selain karena dorongan itu?\" Mereka menjawab, \"Demi Allah, kami tidak melakukannya kecuali karena hal itu.\" Beliau bersabda: \"Ketahuilah bahwasanya saya meminta sumpah kalian bukan karena saya ragu terhadap kalian hanya Jibril Alaihissalam pernah datang kepadaku, lalu mengabariku sesungguhnya Allah Azzawajalla membanggakan kalian di hadapan para Malaikat karena perkumpulan kalian.\""
            },
            {
                "number": 1323,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا شُعْبَةُ قَالَ أَنْبَأَنِي سَعْدُ بْنُ إِبْرَاهِيمَ عَنْ مَعْبَدٍ الْجُهَنِيِّ قَالَكَانَ مُعَاوِيَةُ قَلَّمَا يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا وَيَقُولُ هَؤُلَاءِ الْكَلِمَاتِ قَلَّمَا يَدَعُهُنَّ أَوْ يُحَدِّثُ بِهِنَّ فِي الْجُمَعِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ يُرِدْ اللَّهُ بِهِ خَيْرًا يُفَقِّهُّ فِي الدِّينِ وَإِنَّ هَذَا الْمَالَ حُلْوٌ خَضِرٌ فَمَنْ يَأْخُذْهُ بِحَقِّهِ يُبَارَكْ لَهُ فِيهِ وَإِيَّاكُمْ وَالتَّمَادُحَ فَإِنَّهُ الذَّبْحُ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Syu'bah] berkata; telah memberitakan kepadaku [Sa'ad bin Ibrahim] dari [Ma'bad Al Juhani] berkata; [Mu'awiyah] jarang menceritakan sesuatu dari Rasulullah Shallallahu'alaihiwasallam. Dan hanya beberapa kalimat berikut ini yang jarang ditinggalkannya atau kerap diceritakannya dalam perkumpulan orang, yaitu dari Nabi Shallallahu'alaihiwasallam bersabda: \"Barangsiapa yang Allah kehendaki kebaikan, niscaya Allah akan pahamkan dalam masalah agama. Harta ini sangat manis dan hijau (menyenangkan) siapa yang mengambilnya sesuai dengan haknya maka ia dapatkan berkah darinya. Janganlah kalian saling memuji karena hal itu sama halnya penyembelihan.\""
            },
            {
                "number": 1324,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنِ ابْنِ عَجْلَانَ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ حَبَّانَ عَنِ ابْنِ مُحَيْرِيزٍ عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُبَادِرُونِي بِرُكُوعٍ وَلَا بِسُجُودٍ فَإِنَّهُ مَهْمَا أَسْبِقْكُمْ بِهِ إِذَا رَكَعْتُ تُدْرِكُونِي إِذَا رَفَعْتُ وَمَهْمَا أَسْبِقْكُمْ بِهِ إِذَا سَجَدْتُ تُدْرِكُونِي إِذَا رَفَعْتُ إِنِّي قَدْ بَدَّنْتُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Ajlan] berkata; telah mengabarkan kepadaku [Muhammad bin Yahya bin Habban] dari [Ibnu Muhairiz] dari [Mu'awiyah bin Abu Sufyan] dari Nabi Shallallahu'alaihiwasallam bersabda: \"Janganlah kalian mendahuluiku dalam rukuk dan sujud. Sebab segala ruku' yang terlebih dahulu saya lakukan sebelum kalian, kalian bisa menyusulku saat saya mengangkat rukuk. Dan segala sujud yang kulakukan sebelum kalian, bisa kalian susul ketika saya mengangkat sujud. Sesungguhnya saya telah tua.\""
            },
            {
                "number": 1325,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ قَالَقَالَ مُعَاوِيَةُ عَلَى الْمِنْبَرِ اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ وَلَا مُعْطِيَ لِمَا مَنَعْتَ وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ مَنْ يُرِدْ اللَّهُ بِهِ خَيْرًا يُفَقِّهُّ فِي الدِّينِ سَمِعْتُ هَؤُلَاءِ الْكَلِمَاتِ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى هَذَا الْمِنْبَرِ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Usamah bin Zaid] dari [Muhammad bin Ka'Abu Bakar Al Qurazhi] berkata; [Mu'awiyah] berkata; di atas mimbar, \"Ya Allah, tidak ada yang menghalangi terhadap yang Kau beri dan tidak ada yang memberi terhadap yang Kau halangi. Tidak berguna kekayaan dan kemuliaan itu bagi pemiliknya (selain iman dan amal shalihnya), hanya dari-Mu segala kekayaan dan kemuliaan. Barangsiapa yang Allah kehendaki kebaikan kepadanya, niscaya Allah pahamkan urusan agamanya\". Saya mendengar kalimat-kalimat itu dari Rasulullah Shallallahu'alaihiwasallam dari atas mimbar."
            },
            {
                "number": 1326,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا مُجَمِّعُ بْنُ يَحْيَى عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ عَنْ مُعَاوِيَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَشَهَّدُ مَعَ الْمُؤَذِّنِينَ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Mujamma' bin Yahya] dari [Abu Umamah bin Sahal] dari [Mu'awiyah] sesungguhnya Nabi Shallallahu'alaihiwasallam pernah bersyahadat bersama para muadzin."
            },
            {
                "number": 1327,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ وَبَهْزٌ قَالَا حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ جَبَلَةَ بْنِ عَطِيَّةَ عَنِ ابْنِ مُحَيْرِيزٍ قَالَ بَهْزٌ عَبْدُ اللَّهِ بْنُ مُحَيْرِيزٍ عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ اللَّهُ عَزَّ وَجَلَّ بِعَبْدٍ خَيْرًا يُفَقِّهُّ فِي الدِّينِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] dan [Bahz] berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Jabalah bin 'Athiyyah] dengan [Ibnu Muhairiz]. [Bahz], [Abdullah bin Muhairiz] berkata; dari [Mu'awiyah bin Abu Sufyan] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Jika Allah Azzawajalla menghendaki pada seorang hamba itu dalam kebaikan, niscaya Allah pahamkan dia dalam urusan agamanya.\""
            },
            {
                "number": 1328,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ قَالَ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ مَيْمُونٍ الْقَنَّادِ عَنْ أَبِي قِلَابَةَ عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ رُكُوبِ النِّمَارِ وَعَنْ لُبْسِ الذَّهَبِ إِلَّا مُقَطَّعًا",
                "id": "Telah menceritakan kepada kami [Isma'il] berkata; telah menceritakan kepada kami [Khalid Al Hadzdza`] dari [Maimun Al Qannad] dari [Abu Qilabah] dari [Mu'awiyah bin Abu Sufyan] sesungguhnya Rasulullah Shallallahu'alaihiwasallam melarang memakai kain yang terbuat dari macan tutul dan memakai emas kecuali yang sudah dalam keadaan potongan (dalam ukuran yang dimaafkan dalam syariat karena sangat sedikitnya misalnya dalam hiasan pedang atau kalung atau cincin bagi para wanita)."
            },
            {
                "number": 1329,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا حَبِيبُ بْنُ الشَّهِيدِ عَنْ أَبِي مِجْلَزٍأَنَّ مُعَاوِيَةَ دَخَلَ بَيْتًا فِيهِ ابْنُ عَامِرٍ وَابْنُ الزُّبَيْرِ فَقَامَ ابْنُ عَامِرٍ وَجَلَسَ ابْنُ الزُّبَيْرِ فَقَالَ لَهُ مُعَاوِيَةُ اجْلِسْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ سَرَّهُ أَنْ يَمْثُلَ لَهُ الْعِبَادُ قِيَامًا فَلْيَتَبَوَّأْ بَيْتًا فِي النَّارِ",
                "id": "Telah menceritakan kepada kami [Isma'il] telah menceritakan kepada kami [Habib bin Asy Syahid] dari [Abu Mijlaz] sesungguhnya [Mu'awiyah] pernah memasuki suatu rumah yang di rumah itu Ibnu 'Amir dan Ibnu Az Zubair sedang berdiam, lalu Ibnu 'Amir berdiri dan Ibnu Az Zubair tetap duduk. lalu Mu'awiyah berkata kepadanya, \"Duduklah, sesungguhnya saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: 'Barangsiapa yang dia senang jika ada seorang hamba berdiri karenanya maka bersiaplah menempati rumahnya di neraka.\""
            },
            {
                "number": 1330,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ وَحَجَّاجٌ قَالَ أَخْبَرَنَا شُعْبَةُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ مَعْبَدٍ الْجُهَنِيِّ قَالَكَانَ مُعَاوِيَةُ قَلَّمَا يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَكَانَ قَلَّمَا يَكَادُ أَنْ يَدَعَ يَوْمَ الْجُمُعَةِ هَؤُلَاءِ الْكَلِمَاتِ أَنْ يُحَدِّثَ بِهِنَّ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ يُرِدْ اللَّهُ بِهِ خَيْرًا يُفَقِّهُّ فِي الدِّينِ وَإِنَّ هَذَا الْمَالَ حُلْوٌ خَضِرٌ فَمَنْ يَأْخُذْهُ بِحَقِّهِ يُبَارَكْ لَهُ فِيهِ وَإِيَّاكُمْ وَالتَّمَادُحَ فَإِنَّهُ الذَّبْحُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] dan [Hajjaj] berkata; telah mengabarkan kepada kami [Syu'bah] dari [Sa'd bin Ibrahim] dari [Ma'bad Al Juhani] berkata; [Mu'awiyah] jarang menceritakan dari Nabi Shallallahu'alaihiwasallam. (Ma'bad Al Juhani Radliyallahu'anhu) berkata; pada Hari Jumat bisa dikatakan sangat jarang dia meninggalkan kalimat-kalimat yang didengarnya dari Rasulullah Shallallahu'alaihiwasallam, beliau bersabda: \"Barangsiapa yang Allah kehendaki kebaikan padanya, niscaya Allah akan pahamkan urusan agamanya. Sesungguhnya harta ini sangat manis dan hijau (menyenangkan) siapa yang mengambilnya sesuai dengan haknya maka akan mendapatkan berkah. Janganlah kalian saling memuji karena hal itu ibarat penyembelihan.\""
            },
            {
                "number": 1331,
                "arab": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا حَرِيزٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَوْفٍ الْجُرَشِيِّ عَنْ مُعَاوِيَةَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمُصُّ لِسَانَهُ أَوْ قَالَ شَفَتَهُ يَعْنِي الْحَسَنَ بْنَ عَلِيٍّ صَلَوَاتُ اللَّهِ عَلَيْهِ وَإِنَّهُ لَنْ يُعَذَّبَ لِسَانٌ أَوْ شَفَتَانِ مَصَّهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Hariz] dari [Abdurrahman bin Abu Auf Al Jarasyi] dari [Mu'awiyah] berkata; saya pernah melihat Rasulullah Shallallahu'alaihiwasallam mengisap lidah atau mulut Al Hasan bin 'Ali dan sesungguhnya tidak akan disiksa lidah atau mulut yang telah dihisap oleh Rasulullah Shallallahu'alaihiwasallam."
            },
            {
                "number": 1332,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ تَمِيمٍ الدَّارِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الدِّينَ النَّصِيحَةُ إِنَّمَا الدِّينُ النَّصِيحَةُ قَالُوا لِمَنْ يَا رَسُولَ اللَّهِ قَالَ لِلَّهِ وَلِكِتَابِهِ وَلِرَسُولِهِ وَلِأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan] dari [Suhail bin Abu Shalih] dari ['Atha` bin Yazid Al Laitsi] dari [Tamim Ad-Dari] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Agama itu kebaktian diri, hanyasanya agama itu adalah kebaktian diri.\" Mereka bertanya, \"Kebaktian diri kepada siapa Rasulullah?\" beliau menjawab, \"Bagi Allah, kitab-Nya, rasul-Nya, para pemimpin kaum muslimin dan mereka secara umum.\""
            }
        ]
    }
}