{
    "status": true,
    "data": {
        "start": 889,
        "end": 1036,
        "total": 148,
        "book": "ahmad",
        "hadits": [
            {
                "number": 889,
                "arab": "قَالَ حَدَّثَنَا أَبُو سَلَمَةَ الْخُزَاعِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الْمَوَالِي قَالَ أَخْبَرَنِي نَافِعُ بْنُ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى الْعِشَاءَ رَكَعَ أَرْبَعَ رَكَعَاتٍ وَأَوْتَرَ بِسَجْدَةٍ ثُمَّ نَامَ حَتَّى يُصَلِّيَ بَعْدَ صَلَاتِهِ بِاللَّيْلِ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Abu Salamah Al Khuza'i] telah menceritakan kepada kami [Abdurrahman bin Abu Al Mawali] berkata; telah mengabarkan kepadaku [Nafi' bin Tsabit] dari [Abdullah bin Zubair] berkata; Rasulullah Shallallahu'alaihiwasallam apabila sholat isya', beliau lakukan dengan empat rakaat, kemudian beliau melakukan witir dengan satu sujud, kemudian tidur hingga beliau lakukan sholat di malam itu."
            },
            {
                "number": 890,
                "arab": "قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامٍ قَالَ أَخْبَرَنِي أَبِي عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُحَرِّمُ مِنْ الرَّضَاعِ الْمَصَّةُ وَالْمَصَّتَانِ",
                "id": "(Ahmad bin hanbal) berkata; Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Hisyam] berkata; telah mengabarkan kepadaku [bapakku] dari [Abdullah bin Zubair] Nabi Shallallahu'alaihiwasallam bersabda: \"Tidaklah menjadi mahram dari sepersusuan jika hanya karena satu atau dua kali sedotan.\""
            },
            {
                "number": 891,
                "arab": "قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ جَامِعِ بْنِ أَبِي رَاشِدٍ وَعَاصِمٍ عَنْ أَبِي وَائِلٍ عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ قَالَكُنَّا نُسَمَّى السَّمَاسِرَةَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَانَا بِالْبَقِيعِ فَقَالَ يَا مَعْشَرَ التُّجَّارِ فَسَمَّانَا بِاسْمٍ أَحْسَنَ مِنْ اسْمِنَا إِنَّ الْبَيْعَ يَحْضُرُهُ الْحَلِفُ وَالْكَذِبُ فَشُوبُوهُ بِالصَّدَقَةِ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Jami' bin Abu Rasyid] dan ['Ashim] dari [Abu Wa'il] dari [Qais bin Abu Gharzah] berkata; kami menamakan diri kami dengan nama samasirah (Makelar) pada masa Rasulullah Shallallahu'alaihiwasallam. Lalu (Rasulullah Shallallahu'alaihiwasallam) mendatangi kami waktu di Baqi' dan bersabda: \"Wahai para pedagang\", beliau menamakan kami dengan nama yang lebih baik dari nama kita sendiri (makelar, pent), \"Sesunguhnya jual beli itu terdapat sumpah dan kebohongan, maka campurkanlah dengan sedekah.\""
            },
            {
                "number": 892,
                "arab": "قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي وَائِلٍ عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ قَالَكُنَّا نَبْتَاعُ الْأَوْسَاقَ بِالْمَدِينَةِ وَكُنَّا نُسَمَّى السَّمَاسِرَةَ قَالَ فَأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمَّانَا بِاسْمٍ هُوَ أَحْسَنُ مِمَّا كُنَّا نُسَمِّي بِهِ أَنْفُسَنَا فَقَالَ يَا مَعْشَرَ التُّجَّارِ إِنَّ هَذَا الْبَيْعَ يَحْضُرُهُ اللَّغْوُ وَالْحَلِفُ فَشُوبُوهُ بِالصَّدَقَةِ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Waki'] berkata; telah menceritakan kepada kami [Al A'Masy] dari [Abu Wa'il] dari [Qais bin Abu Gharzah] berkata; kami menjual watsaq (ukuran takaran kurma setara dengan enam puluh sho`) di Madinah, kami menamai diri kami dengan samasirah. (Qais bin Abu Gharzah) berkata; lalu Rasulullah Shallallahu'alaihiwasallam mendatangi kami dan memberi nama kepada kami dengan nama yang terbaik daripada nama kami sebelumnya, beliau bersabda: \"Wahai para pedagang, jual beli ini ada unsur hal yang sia-sia dan sumpah maka campurkanlah dengan sedekah.\""
            },
            {
                "number": 893,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مُغِيرَةَ عَنْ أَبِي وَائِلٍ عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ قَالَأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِي السُّوقِ فَقَالَ إِنَّ هَذِهِ السُّوقَ يُخَالِطُهَا اللَّغْوُ وَحَلِفٌ فَشُوبُوهَا بِصَدَقَةٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] dari [Mughirah] dari [Abu Wa`il] dari [Qais bin Abu Gharzah] berkata; Rasulullah Shallallahu'alaihiwasallam mendatangi kami dan kami sedang berada di pasar, lalu beliau bersabda: \"Sesungguhnya di dalam pasar ini, ada campurannya berupa hAl hal yang sia-sia dan sumpah maka campurlah dengan sedekah.\""
            },
            {
                "number": 894,
                "arab": "قَالَ حَدَّثَنَا بَهْزٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَبِيبُ بْنُ أَبِي ثَابِتٍ أَخْبَرَنِي قَالَ سَمِعْتُ أَبَا وَائِلٍ يُحَدِّثُ عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ قَالَخَرَجَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَبِيعُ الرَّقِيقَ نُسَمَّى السَّمَاسِرَةَ فَقَالَ يَا مَعْشَرَ التُّجَّارِ إِنَّ بَيْعَكُمْ هَذَا يُخَالِطُهُ لَغْوٌ وَحَلِفٌ فَشُوبُوهُ بِصَدَقَةٍ أَوْ بِشَيْءٍ مِنْ صَدَقَةٍ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Bahz] berkata; telah menceritakan kepada kami [Syu'bah] berkata; [Habib bin Abu Tsabit] telah mengabarkan kepadaku berkata; saya telah mendengar [Abu Wa`il] menceritakan dari [Qais bin Abu Gharzah] berkata; Rasulullah Shallallahu'alaihiwasallam menemui kami ketika kami sedang menjual budak kami dinamakan dengan samamir (makelar) lalu beliau bersabda: \"Wahai para pedagang, jual beli kalian ini telah tercampur dengan hAl hal yang sia-sia dan sumpah maka campurlah dengan sedekah atau dengan sesuatu yang ada nilai sedekah\"."
            },
            {
                "number": 895,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ أَبِي وَائِلٍ عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ قَالَكُنَّا نَبِيعُ الرَّقِيقَ فِي السُّوقِ وَكُنَّا نُسَمَّى السَّمَاسِرَةَ فَسَمَّانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَحْسَنَ مِمَّا سَمَّيْنَا بِهِ أَنْفُسَنَا فَقَالَ يَا مَعْشَرَ التُّجَّارِ إِنَّ هَذَا الْبَيْعَ يَحْضُرُهُ اللَّغْوُ وَالْأَيْمَانُ فَشُوبُوهُ بِالصَّدَقَةِ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Abdurrohman bin Mahdi] dari [Sufyan] dari [Habib bin Abu Tsabit] dari [Abu Wa`il] dari [Qais bin Abu Gharzah] berkata; kami sedang menjual budak di pasar sehingga kami dinamakan dengan samamir (makelar) lalu Rasulullah Shallallahu'alaihiwasallam memberi nama dengan nama yang baik buat kami dari nama yang kami pakai sendiri, bersabda: \"Wahai para pedagang, jual beli ini telah tercampur dengan hAl hal yang sia-sia dan sumpah maka campurlah dengan sedekah.\""
            },
            {
                "number": 896,
                "arab": "قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ قَالَكُنَّا نُسَمَّى عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّمَاسِرَةَ فَمَرَّ بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمَّانَا بِاسْمٍ هُوَ أَحْسَنُ مِنْهُ فَقَالَ يَا مَعْشَرَ التُّجَّارِ إِنَّ هَذَا الْبَيْعَ يَحْضُرُهُ اللَّغْوُ وَالْحَلِفُ فَشُوبُوهُ بِالصَّدَقَةِقَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا الْعَوَّامُ بْنُ حَوْشَبٍ قَالَ حَدَّثَنِي إِبْرَاهِيمُ مَوْلَى صُخَيْرٍ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَرَادَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْهَى عَنْ بَيْعٍ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا مَعَايِشُنَا قَالَ فَقَالَ لَا خِلَابَ إِذًا وَكُنَّا نُسَمَّى السَّمَاسِرَةَ فَذَكَرَ الْحَدِيثَ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] dari [Qais bin Abu Gharzah] berkata; kami diberi nama pada masa Rasulullah Shallallahu'alaihiwasallam dengan samamir (makelar) lalu Rasulullah Shallallahu'alaihiwasallam melewati kami lalu memberi nama pada kami dengan nama yang lebih dari nama sebelumnya.beliau bersabda: \"Wahai para pedagang, jual beli ini telah tercampur dengan hAl hal yang sia-sia dan sumpah maka campurlah dengan sedekah\". (Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Yazid bin Harun] berkata; telah mengabarkan kepada kami [Al Awwam bin Hausyab] berkata; telah menceritakan kepadaku [Ibrahim] budak Shukhair, dari [beberapa sahabat Nabi Shallallahu'alaihiwasallam], berkata; Rasulullah Shallallahu'alaihiwasallam hendak melarang jual beli. lalu mereka berkata; itu adalah mata pencaharian kami. (beberapa sahabat ASC) berkata; yang tidak ada hilab (penghianatan dalam agama), kami menamainya dengan Samasirah (makelar), lalu menyebutkan hadis secara lengkap."
            },
            {
                "number": 897,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ فُرَاتٍ عَنْ أَبِي الطُّفَيْلِ عَنْ حُذَيْفَةَ بْنِ أَسِيدٍاطَّلَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْنَا وَنَحْنُ نَتَذَاكَرُ السَّاعَةَ فَقَالَ مَا تَذْكُرُونَ قَالُوا نَذْكُرُ السَّاعَةَ فَقَالَ إِنَّهَا لَنْ تَقُومَ حَتَّى تَرَوْنَ عَشْرَ آيَاتٍ الدُّخَانُ وَالدَّجَّالُ وَالدَّابَّةُ وَطُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا وَنُزُولُ عِيسَى ابْنِ مَرْيَمَ وَيَأْجُوجُ وَمَأْجُوجُ وَثَلَاثُ خُسُوفٍ خَسْفٌ بِالْمَشْرِقِ وَخَسْفٌ بِالْمَغْرِبِ وَخَسْفٌ بِجَزِيرَةِ الْعَرَبِ وَآخِرُ ذَلِكَ نَارٌ تَخْرُجُ مِنْ قِبَلِ تَطْرُدُ النَّاسَ إِلَى مَحْشَرِهِمْقَالَ أَبُو عَبْد الرَّحْمَنِ سَقَطَ كَلِمَةٌ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Furat] dari [Abu Thufail] dari [Hudaifah bin Asid] Rasulullah Shallallahu'alaihiwasallam menemui kita dan kita sedang membicarakan tentang Hari Kiamat, lalu Rasulullah Shallallahu'alaihiwasallam bersabda: \"Apa yang kalian bincangkan\" Kami menjawab, kami sedang membincangkan Hari Kiamat. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Kalian tidak akan menemui Hari Kiamat sampai kalian melihat sepuluh tandanya: keluarnya asap, Dajjal, binatang melata, keluarnya matahari dari sebelah barat, turunnya 'Isa bin Maryam, keluarnya bangsa Yajuj dan ma'juj, dan berkobarnya api di tiga tempat, yaitu di sebelah timur, barat dan di Jazirah Arab dan pemungkasnya adalah api yang menggiring mereka menuju ke tempat berkumpul\"Abu Abdurrohman berkata; kalimatnya ada yang hilang."
            },
            {
                "number": 898,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ أَبِي الطُّفَيْلِ عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ الْغِفَارِيِّ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْخُلُ الْمَلَكُ عَلَى النُّطْفَةِ بَعْدَمَا تَسْتَقِرُّ فِي الرَّحِمِ بِأَرْبَعِينَ لَيْلَةً وَقَالَ سُفْيَانُ مَرَّةً أَوْ خَمْسِينَ وَأَرْبَعِينَ لَيْلَةً فَيَقُولُ يَا رَبِّ مَاذَا أَشَقِيٌّ أَمْ سَعِيدٌ أَذَكَرٌ أَمْ أُنْثَى فَيَقُولُ اللَّهُ تَبَارَكَ وَتَعَالَى فَيَكْتُبَانِ فَيَقُولَانِ مَاذَا أَذَكَرٌ أَمْ أُنْثَى فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ فَيَكْتُبَانِ فَيُكْتَبُ عَمَلُهُ وَأَثَرُهُ وَمُصِيبَتُهُ وَرِزْقُهُ ثُمَّ تُطْوَى الصَّحِيفَةُ فَلَا يُزَادُ عَلَى مَا فِيهَا وَلَا يُنْقَصُ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari ['Amr] dari [Abu Thufail] dari [Hudzaifah bin Asid Al Ghiffary] berkata; Aku mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Malaikat masuk untuk meniupkan ruh pada janin setelah berumur 40 hari\" Sufyan berkata; \"Lima puluh atau empat hari, lalu Malaikat berkata; 'Wahai Rab, apakah dia termasuk yang bahagia ataukah celaka, apakah laki-laki ataukah perempuan, maka Allah 'azza wajalla Tabaroka Wa Ta'ala berfirman lalu kedua Malaikat mencatatnya dan berkata; \"Laki-laki ataukah perempuan?\" lalu Allah 'azza wajalla berfirman lalu keduanya mencatat, mencatat segala amalnya, bagian, musibah dan rizqinya, kemudian dilipatlah catatan amalnya dengan tidak dikurangi dan ditambah"
            },
            {
                "number": 899,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ فُرَاتٍ عَنْ أَبِي الطُّفَيْلِ عَنْ أَبِي سَرِيحَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غُرْفَةٍ وَنَحْنُ تَحْتَهَا نَتَحَدَّثُ قَالَ فَأَشْرَفَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا تَذْكُرُونَ قَالُوا السَّاعَةَ قَالَ إِنَّ السَّاعَةَ لَنْ تَقُومَ حَتَّى تَرَوْنَ عَشْرَ آيَاتٍ خَسْفٌ بِالْمَشْرِقِ وَخَسْفٌ بِالْمَغْرِبِ وَخَسْفٌ فِي جَزِيرَةِ الْعَرَبِ وَالدُّخَانُ وَالدَّجَّالُ وَالدَّابَّةُ وَطُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا وَيَأْجُوجُ وَمَأْجُوجُ وَنَارٌ تَخْرُجُ مِنْ قَعْرِ عَدَنٍ تُرَحِّلُ النَّاسَ فَقَالَ شُعْبَةُ سَمِعْتُهُ وَأَحْسِبُهُ قَالَ تَنْزِلُ مَعَهُمْ حَيْثُ نَزَلُوا وَتَقِيلُ مَعَهُمْ حَيْثُ قَالُواقَالَ شُعْبَةُ وَحَدَّثَنِي بِهَذَا الْحَدِيثِ رَجُلٌ عَنْ أَبِي الطُّفَيْلِ عَنْ أَبِي سَرِيحَةَ لَمْ يَرْفَعْهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَحَدُ هَذَيْنِ الرَّجُلَيْنِ نُزُولُ عِيسَى ابْنِ مَرْيَمَ وَقَالَ الْآخَرُ رِيحٌ تُلْقِيهِمْ فِي الْبَحْرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] dari [Furat] dari [Abu Thufail] dari [Abu Sarihah] berkata; Rasulullah shallallahu 'alaihi wasallam sedang berada di kamar dan kami berada di tengahnya kami berbincang-bincang. Lalu Rasulullah shallallahu 'alaihi wasallam mendekati kami dan bertanya, \"Apakah yang kalian sebutkan tadi?\" Mereka menjawab, Hari Kiamat. Beliau bersabda: \"Sesungguhnya Hari Kiamat tidak akan terjadi sampai ada sepuluh tanda. Terjadinya kerusakan di timur, kerusakan di barat, kerusakan di negeri Arab, asap, Dajjal, dabbah (munculnya hewan melata), terbitnya matahari dari arah barat, Ya'juj dan Ma'juj dan api yang keluar dari ujung tanah Adan yang mengiring manusia. Lalu Syu'bah berkata; saya telah mendengarnya dan saya menyangka dia berkata; akan turun bersama mereka sebagaimana mereka turun dan akan beristirahat bersama mereka sebagaimana mereka berkata. Syu'bah berkata; dan telah menceritakan kepadaku dengan hadis ini seorang laki-laki dari Abu Ath-Thufail dari Abu Sarihah dengan tidak memarfukkan kepada Nabi Shallallahu'alaihiwasallam, maka salah seorang dari keduanya berkata; turunnya Isa bin Maryam dan yang satunya berkata; angin yang melemparkan mereka ke laut."
            },
            {
                "number": 900,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ فُرَاتٍ عَنْ أَبِي الطُّفَيْلِ عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ الْغِفَارِيِّ قَالَأَشْرَفَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غُرْفَةٍ وَنَحْنُ نَتَذَاكَرُ السَّاعَةَ فَقَالَ لَا تَقُومُ السَّاعَةُ حَتَّى تَرَوْنَ عَشْرَ آيَاتٍ طُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا وَالدُّخَانُ وَالدَّابَّةُ وَخُرُوجُ يَأْجُوجَ وَمَأْجُوجَ وَخُرُوجُ عِيسَى ابْنِ مَرْيَمَ وَالدَّجَّالِ وَثَلَاثُ خُسُوفٍ خَسْفٌ بِالْمَغْرِبِ وَخَسْفٌ بِالْمَشْرِقِ وَخَسْفٌ بِجَزِيرَةِ الْعَرَبِ وَنَارٌ تَخْرُجُ مِنْ قَعْرِ عَدَنٍ تَسُوقُ أَوْ تَحْشُرُ النَّاسَ تَبِيتُ مَعَهُمْ حَيْثُ بَاتُوا وَتَقِيلُ مَعَهُمْ حَيْثُ قَالُوا",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan] dari [Furat] dari [Abu Ath-Thufail] dari [Hudzaifah bin Asid Al Ghifari] berkata; Rasulullah Shallallahu'alaihiwasallam mendekati kami dari kamar dan kami sedang memperbincangkan Hari Kiamat. Lalu beliau bersabda: \"Tidak akan terjadi hari kiamat sehingga kalian melihat sepuluh tanda: Terbitnya matahari dari arah barat, munculnya asap, dabbah (munculnya hewan melata),, Ya'juj dan Ma'juj, keluarnya 'Isa bin Maryam, Dajjal, terjadinya kerusakan di tiga tempat: di barat, di timur dan di negeri Arab, dan api yang keluar dari ujung tanah Adan yang mengiring manusia, dan api tersebut turun bersama mereka dimana mereka turun dan akan beristirahat bersama mereka sebagaimana mereka berkata."
            },
            {
                "number": 901,
                "arab": "قَالَ حَدَّثَنَا رَوْحٌ قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ وَعَبْدُ الْوَهَّابِ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَبِي الطُّفَيْلِ عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ الْغِفَارِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَ بِمَوْتِ النَّجَاشِيِّ قَالَ فَقَالَ صَلُّوا عَلَى أَخٍ لَكُمْ بِغَيْرِ بِلَادِكُمْ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Rouh] berkata; telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dan [Abdul Wahab] dari [Sa'id] dari [Qatadah] dari [Abu Thufail] dari [Hudzaifah bin Usaid Al Ghiffary] Rasulullah Shallallahu'alaihiwasallam memberitahukan kematian Najasy, lalu beliau berkata; \"sholatlah kalian atas saudara kalian yang meninggal bukan di negara kalian.\""
            },
            {
                "number": 902,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ وَأَزْهَرُ بْنُ الْقَاسِمِ قَالَا حَدَّثَنَا الْمُثَنَّى حَدَّثَنَا قَتَادَةُ عَنْ أَبِي الطُّفَيْلِ عَنْ حُذَيْفَةَ بْنِ أَسِيدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ عَلَيْهِمْ يَوْمًا فَقَالَ صَلُّوا عَلَى صَاحِبِكُمْ مَاتَ بِغَيْرِ بِلَادِكُمْ قَالُوا مَنْ هُوَ يَا رَسُولَ اللَّهِ قَالَ صُحْمَةُ النَّجَاشِيُّ وَقَالَ أَزْهَرُ صَحْمَةُ وَقَالَ أَزْهَرُ أَبِي الطُّفَيْلِ اللَّيْثِيِّ عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ الْغِفَارِيِّ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Abdusshomad] dan [Azhar bin Al Qasim] berkata; telah menceritakan kepada kami [Al Mutsanna] telah menceritakan kepada kami [Qatadah] dari [Abu Thufail] dari [Hudzaifah bin Asid] Rasulullah Shallallahu'alaihiwasallam menemui mereka pada suatu hari lalu bersabda: \"sholatlah kalian atas sahabat kalian yang mati di negerinya\", mereka bertanya siapakah dia Wahai Rasulullah. Beliau menjawab, Shuhmah dari Najasyi. Azhar berkata; Shahmah, Abu Thufail Al Laitsi berkata; dari Hudzaifah bin Asid Al Ghifari."
            },
            {
                "number": 903,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ قَالَ حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ أَبِي الطُّفَيْلِ عَنْ حُذَيْفَةَ بْنِ أَسِيدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَ ذَاتَ يَوْمٍ فَقَالَ صَلُّوا عَلَى أَخٍ لَكُمْ مَاتَ بِغَيْرِ أَرْضِكُمْ قَالُوا مَنْ هُوَ يَا رَسُولَ اللَّهِ قَالَ صُحْمَةُ النَّجَاشِيُّ فَقَامُوا فَصَلَّوْا عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Ibnu Asid] budak Bani Hasyim, berkata; telah menceritakan kepada kami [Al Mutsanna bin Sa'id] berkata; telah menceritakan kepada kami [Qatadah] dari [Abu Thufail] dari [Hudzaifah bin Asid] Rasulullah Shallallahu'alaihiwasallam datang pada suatu hari lalu bersabda: \"sholatlah kalian atas sahabat kalian yang mati di negerinya\", mereka bertanya siapakah dia Wahai Rasulullah. Beliau menjawab, Shuhmah dari Najasyi. Lalu mereka berdiri dan sholat atasnya."
            },
            {
                "number": 904,
                "arab": "قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ قَالَ أَخْبَرَنَا أَيُّوبُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ قَالَ حَدَّثَنِي عُبَيْدُ بْنُ أَبِي مَرْيَمَ عَنْ عُقْبَةَ بْنِ الْحَارِثِ قَالَ وَقَدْ سَمِعْتُهُ مِنْ عُقْبَةَ وَلَكِنِّي لِحَدِيثِ عُبَيْدٍ أَحْفَظُ قَالَتَزَوَّجْتُ فَجَاءَتْنَا امْرَأَةٌ سَوْدَاءُ فَقَالَتْ إِنِّي قَدْ أَرْضَعْتُكُمَا فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنِّي تَزَوَّجْتُ امْرَأَةً فُلَانَةَ ابْنَةَ فُلَانٍ فَجَاءَتْنَا امْرَأَةٌ سَوْدَاءُ فَقَالَتْ إِنِّي أَرْضَعْتُكُمَا وَهِيَ كَافِرَةٌ فَأَعْرَضَ عَنِّي فَأَتَيْتُهُ مِنْ قِبَلِ وَجْهِهِ فَقُلْتُ إِنَّهَا كَاذِبَةٌ فَقَالَ لِي كَيْفَ بِهَا وَقَدْ زَعَمَتْ أَنَّهَا أَرْضَعَتْكُمَا دَعْهَا عَنْكَ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Isma'il bin Ibrahim] berkata; telah mengabarkan kepada kami [Ayyub] dari [Abdullah bin Abu Mulaikah] berkata; telah menceritakan kepadaku ['Ubaid bin Abu Maryam] dari ['Uqbah bin Al Harits] berkata; dan saya telah mendengarnya dari 'Uqbah, tapi untuk hadis 'Ubaid, saya lebih menjaga. Dia berkata; saya baru saja menikah, lalu datanglah seorang wanita yang berkulit hitam dan berkata; saya telah menyusui kalian berdua. Lalu saya menemui Nabi Shallallahu'alaihiwasallam dan saya katakan 'Saya baru saja menikahi seorang wanita sebut saja si fulanah binti fulan lalu datang seorang wanita hitam dan berkata; saya pernah menyusui kalian berdua.' Wanita tersebut masih kafir, lalu beliau berpaling dariku, lalu saya memergokirnya dari arah depannya, lalu saya berkata; 'Wanita itu hanyalah pembohong.' Lalu beliau bersabda kepadaku 'Bagaimana dengan dia, padahal dia telah yakin bahwa dia telah menyusui kalian berdua, tinggalkanlah isterimu.\""
            },
            {
                "number": 905,
                "arab": "قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ إِسْمَاعِيلَ يَعْنِي ابْنَ أُمَيَّةَ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ عُقْبَةَ بْنِ الْحَارِثِتَزَوَّجْتُ ابْنَةَ أَبِي إِيهَابٍ فَجَاءَتْ امْرَأَةٌ سَوْدَاءُ يَعْنِي فَذَكَرَتْ أَنَّهَا أَرْضَعَتْكُمَا فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُمْتُ بَيْنَ يَدَيْهِ فَكَلَّمْتُهُ فَأَعْرَضَ عَنِّي فَقُمْتُ عَنْ يَمِينِهِ فَأَعْرَضَ عَنِّي فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا هِيَ سَوْدَاءُ قَالَ فَكَيْفَ وَقَدْ قِيلَ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Isma'il] yaitu Ibnu Umayyah, dari [Ibnu Abu Mulaikah] dari ['Uqbah bin Al Harits], saya menikah dengan anak perempuan Abu Ihab (Jangan dibaca Abu Lahab), lalu datanglah seorang wanita yang berwarna hitam, dia mengutarakan bahwa dia telah menyusui kalian berdua. Lalu saya datangi Nabi Shallallahu'alaihiwasallam, lalu saya duduk di hadapannya, dan saya berbicara dengan mereka. Namun beliau berpaling dariku, lalu saya berpindah ke arah sebelah kanan, namun beliau tetap berpaling dariku. Lalu saya berkata; Wahai Rasulullah, dia hanyalah orang yang hitam. Beliau bersabda: \"Lha bagaimana, padahal telah dikatakan seperti itu.\""
            },
            {
                "number": 906,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا أَيُّوبُ عَنِ ابْنِ أَبِي مُلَيْكَةَ قَالَ حَدَّثَنِي عُقْبَةُ بْنُ الْحَارِثِ قَالَأُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالنُّعَيْمَانِ قَدْ شَرِبَ الْخَمْرَ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ فِي الْبَيْتِ فَضَرَبُوهُ بِالْأَيْدِي وَالْجَرِيدِ وَالنِّعَالِقَالَ فَكُنْتُ مِمَّنْ ضَرَبَهُ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Abdusshamad] berkata; telah menceritakan kepada kami [bapakku] berkata; telah menceritakan kepada kami [Ayyub] dari [Ibnu Abu Mulaikah] berkata; telah menceritakan kepadaku ['Uqbah bin Al Harits] berkata; dihadapkan kepada Rasulullah Shallallahu'alaihiwasallam seorang laki-laki yang bernama Nu'man yang meminum arak. Rasulullah Shallallahu'alaihiwasallam menyuruh orang yang sedang berada di rumah untuk memukulinya dengan tangan, pelepah dan sandal. 'Uqbah bin Al Harits) berkata; saya termasuk orang yang memukulinya."
            },
            {
                "number": 907,
                "arab": "قَالَ حَدَّثَنَا رَوْحٌ قَالَ حَدَّثَنَا عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي حُسَيْنٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ عَنْ عُقْبَةَ بْنِ الْحَارِثِ قَالَصَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَصْرَ فَلَمَّا سَلَّمَ قَامَ سَرِيعًا فَدَخَلَ عَلَى بَعْضِ نِسَائِهِ ثُمَّ خَرَجَ وَرَأَى مَا فِي وُجُوهِ الْقَوْمِ مِنْ تَعَاجُبِهِمْ وَلُبِسَ عَلَيْهِ قَالَ ذَكَرْتُ وَأَنَا فِي الصَّلَاةِ تِبْرًا عِنْدَنَا فَكَرِهْتُ أَنْ يُمْسِيَ أَوْ يَبِيتَ عِنْدَنَا فَأَمَرْتُ بِقِسْمَتِهِقَالَ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ قَالَ حَدَّثَنَا عُمَرُ بْنُ سَعِيدٍ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ عُقْبَةَ بْنِ الْحَارِثِ قَالَ انْصَرَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ صَلَّى الْعَصْرَ فَذَكَرَ مَعْنَاهُ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Rouh] berkata; telah menceritakan kepada kami ['Umar bin Sa'id bin Abu Husain] berkata; telah menceritakan kepadaku [Abdullah bin Ibnu Mulaikah] dari ['Uqbah bin Al Harits] berkata; saya sholat ashar bersama Rasulullah Shallallahu'alaihiwasallam. Setelah mengucapkan salam, beliau bangkit dengan segera, beliau temui sebagian istrinya, lalu beliau muncul, beliau lihat wajah para sahabatnya yang merasa terherAn heran. Hati beliau merasa kacau dengan emas itu. Beliau bersabda: \"Ketika sedang sholat saya teringat sebiji emas atau perak yang kami punyai dan saya tidak suka jika itu berlangsung sampai sore atau sampai malam di rumah kami. Lalu saya memerintahkan agar di bagikan. Ahmad bin hanbal berkata; telah menceritakan kepada kami [Abu Ahmad Az Zubairy] berkata; telah menceritakan kepada kami ['Umar bin Sa'id] dari [Ibnu Abu Mulaikah] dari ['Uqbah bin Al Harits] berkata; Rasulullah Shallallahu'alaihiwasallam pulang ketika sholat asar, lalu menyebutkan secara makna."
            },
            {
                "number": 908,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنِ ابْنِ جُرَيْجٍ عَنِ ابْنِ أَبِي مُلَيْكَةَ قَالَ حَدَّثَنِي عُقْبَةُ بْنُ الْحَارِثِ أَوْ سَمِعْتُهُ مِنْهُأَنَّهُ تَزَوَّجَ أُمَّ يَحْيَى ابْنَةَ أَبِي إِيهَابٍ فَجَاءَتْ امْرَأَةٌ سَوْدَاءُ فَقَالَتْ قَدْ أَرْضَعْتُكُمَا فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْرَضَ عَنِّي فَتَنَحَّيْتُ فَذَكَرْتُهُ لَهُ فَقَالَ فَكَيْفَ وَقَدْ زَعَمَتْ أَنْ قَدْ أَرْضَعَتْكُمَا فَنَهَاهُ عَنْهَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] dari [Ibnu Abu Mulaikah] berkata; telah menceritakan kepadaku ['Uqbah bin Al Harits] atau saya mendengarnya darinya, dia menikah dengan Umu Yahya, anak perempuan Abu Ihab, lalu datanglah seorang wanita berkulit hitam. Si wanita itu berkata; sungguh saya telah menyusui kalian berdua. Segera saja saya menyebutkan kasus ini kepada Rasulullah Shallallahu'alaihiwasallam, lalu beliau berpaling dariku, saya mencoba memergoki beliau dari arah lainnya dan saya sampaikan lagi, lalu beliau bersabda: \"Bagaimana, dia telah mengatakan bahwa dia telah menyusui kalian berdua\". Lalu beliau melarang laki-laki tadi berumahtangga dengan wanita itu."
            },
            {
                "number": 909,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنَا عَبْدُ اللَّهُ بْنُ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ أَنَّ عُقْبَةَ بْنَ الْحَارِثِ بْنِ عَامِرٍ أَخْبَرَهُ أَوْ سَمِعَهُ مِنْهُ إِنْ لَمْ يَكُنْ خَصَّهُ بِهِأَنَّهُ نَكَحَ ابْنَةَ أَبِي إِيهَابٍ فَقَالَتْ أَمَةٌ سَوْدَاءُ قَدْ أَرْضَعْتُكُمَا فَجِئْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَأَعْرَضَ عَنِّي فَجِئْتُ فَذَكَرْتُ لَهُ فَقَالَ فَكَيْفَ وَقَدْ زَعَمَتْ أَنْ قَدْ أَرْضَعَتْكُمَا فَنَهَاهُ عَنْهَا",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] berkata; telah menceritakan kepada kami [Ibnu Juraij] berkata; telah mengabarkan kepada kami [Abdullah bin 'ubaidhullah bin Abu Mulaikah] ['Uqbah bin Al Harits bin 'Amir], dia mengabarinya atau mendengarnya --dia tidak mengkhususkan dengan salah satu redaksi mengabari atau mendengar-- dia menikahi anak perempuan Abu Ihab, lalu ada seorang budak wanita yang berwarna hitam berkata 'Sungguh saya telah menyusui kalian berdua.' Kontan saya datangi Nabi Shallallahu'alaihiwasallam, saya utarakan kasus ini kepada beliau, lalu berpaling dariku, lalu saya datang lagi dan saya utarakan lagi kasusnya kepada beliau, lantas beliau bersabda: \"Lha bagaimana, dia telah mengatakan bahwa dia telah menyusui kalian berdua\". Lalu beliau melarang dia berumah tangga dengan wanita itu."
            },
            {
                "number": 910,
                "arab": "قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَعَفَّانُ قَالَا حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ قَالَ عَفَّانُ فِي حَدِيثِهِ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ عَنْ عُقْبَةَ بْنِ الْحَارِثِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِالنُّعَيْمَانِ أَوْ ابْنِ النُّعَيْمَانِ وَهُوَ سَكْرَانُ قَالَ فَاشْتَدَّ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمَرَ مَنْ فِي الْبَيْتِ أَنْ يَضْرِبُوهُ فَضَرَبُوهُ قَالَ عَفَّانُ فِي حَدِيثِهِ فَشَقَّ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَشَقَّةً شَدِيدَةًقَالَ عُقْبَةُ فَكُنْتُ فِيمَنْ ضَرَبَهُ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Sulaiman bin Harb] dan ['Affan] berkata; telah menceritakan kepada kami [Wuhaib bin Khalid] ['Affan] berkata; dalam hadisnya, berkata; telah menceritakan kepada kami [Ayyub] dari [Abdullah bin Abu Mulaikah] dari ['Uqbah bin Al Harits], dihadapkan kepada Nabi Shallallahu'alaihiwasallam An Nu'aiman atau Ibnu An Nua'iman dalam keadaan mabuk. ('Uqbah bin Al Harits) berkata; hal itu membuat Rasulullah Shallallahu'alaihiwasallam marah, lalu menyuruh orang yang berada di rumah untuk memukulinya, dan mereka lakukan. 'Affan berkata dalam hadisnya, lalu hal itu sangat memberatkan Rasulullah Shallallahu'alaihiwasallam. 'Uqbah berkata; saya termasuk orang yang memukulinya."
            },
            {
                "number": 911,
                "arab": "حَدَّثَنَا هُشَيْمٌ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ أَبِيهِ عَنْ أَوْسِ بْنِ أَوْسٍ الثَّقَفِيِّ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى كِظَامَةَ قَوْمٍ فَتَوَضَّأَ",
                "id": "Telah menceritakan kepada kami [Husyaim] dari [Ya'la bin 'Atha`] dari [Bapaknya] dari [Aus bin Aus Al Atsaqafi] berkata; Aku pernah melihat Rasulullah Shallallahu'alaihiwasallam mendatangi tempat penampungan air, kemudian beliau berwudlu.\""
            },
            {
                "number": 912,
                "arab": "قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ عَنِ النُّعْمَانِ بْنِ سَالِمٍ عَنِ ابْنِ أَبِي أَوْسٍ عَنْ جَدِّهِ أَنَّهُكَانَ يُؤْتَى بِنَعْلَيْهِ وَهُوَ يُصَلِّي فَيَلْبَسُهُمَا وَيَقُولُ إِنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي نَعْلَيْهِ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] dari [An Nu'man bin Salim] dengan [Ibnu Abu Aus] dari [kakeknya], Sepasang sandal didatangkan baginya ketika ia sholat, lalu dia mengenakannya waktu sholat dan berkata; \"Saya pernah melihat Rasulullah sholat dengan memakai kedua sandalnya.\""
            },
            {
                "number": 913,
                "arab": "قَالَ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ قَالَ حَدَّثَنَا يَعْلَى بْنُ عَطَاءٍ عَنْ أَبِيهِ عَنْ أَوْسِ بْنِ أَبِي أَوْسٍ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ وَمَسَحَ عَلَى نَعْلَيْهِ ثُمَّ قَامَ إِلَى الصَّلَاةِ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Yahya] dari [Syu'bah] berkata; telah menceritakan kepada kami [Ya'la bin 'Atha`] dari [Bapaknya] dari [Aus bin Abi Aus] berkata; saya melihat Rasulullah Shallallahu'alaihiwasallam berwudlu dan mengusap kedua sandalnya, kemudian berdiri dan mendirikan sholat.\""
            },
            {
                "number": 914,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنِ النُّعْمَانِ قَالَ سَمِعْتُ أَوْسًا يَقُولُأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي وَفْدِ ثَقِيفٍ فَكُنَّا فِي قُبَّةٍ فَقَامَ مَنْ كَانَ فِيهَا غَيْرِي وَغَيْرَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَ رَجُلٌ فَسَارَّهُ فَقَالَ اذْهَبْ فَاقْتُلْهُ ثُمَّ قَالَ أَلَيْسَ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ قَالَ بَلَى وَلَكِنَّهُ يَقُولُهَا تَعَوُّذًا فَقَالَ رُدَّهُ ثُمَّ قَالَ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ فَإِذَا قَالُوهَا حُرِّمَتْ عَلَيَّ دِمَاؤُهُمْ وَأَمْوَالُهُمْ إِلَّا بِحَقِّهَا فَقُلْتُ لِشُعْبَةَ أَلَيْسَ فِي الْحَدِيثِ ثُمَّ قَالَ أَلَيْسَ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ قَالَ شُعْبَةُ أَظُنُّهَا مَعَهَا وَمَا أَدْرِي",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] dari [An Numan] berkata; aku mendengar [Aus] berkata; Aku pernah mendatangi Rasulullah Shallallahu'alaihiwasallam yang tengah berkumpul bersama utusAn utusan Bani Tsaqif, ketika itu kami berada di suatu bangunan. Lalu orang-orang penghuni bangunan itu berdiri kecuali saya dan Rasulullah Shallallahu'alaihiwasallam. Tiba-tiba datanglah seorang laki-laki yang memancing kemarahan nabi shallallahu 'alaihi wasallam, lalu nabi berkata; \"Pergilah dan bunuhlah dia\". Tapi beberapa saat kemudian nabi shallallahu 'alaihi wasallam bersabda: \"Namun bukankah dia mengucapkan kalimah syahadah?\" Aus menjawab, Ya, tapi dia mengucapkannya hanya sebagai alat untuk menghindarkan diri dari pembunuhan? (Rasulullah Shallallahu'alaihiwasallam) kontan bersabda: \"Lepaskanlah dia\" lalu beliau bersabda: \"Saya diperintahkan untuk memerangi manusia sampai mereka mengucapkan, \"Tidak ada tuhan selain Allah', jika mereka telah mengucapkannya, maka haram bagiku darah dan harta mereka kecuali karena alasan yang dibenarkan.\" Saya bertanya kepada Syu'bah, 'Apakah dalam hadis terdapat redaksi kemudian ia berkata; bukankah dia bersaksi bahwa 'tidak ada tuhan selain Allah dan saya adalah Rasul Allah? '. Syu'bah berkata; saya pikir begitu, namun saya tidak tahu."
            },
            {
                "number": 915,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ عَنْ عُمَرَ بْنِ مُحَمَّدٍ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ عَنْ مُحَمَّدِ بْنِ سَعِيدٍ عَنْ أَوْسِ بْنِ أَوْسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانَ يَوْمُ الْجُمُعَةِ فَغَسَلَ أَحَدُكُمْ رَأْسَهُ وَاغْتَسَلَ ثُمَّ غَدَا أَوْ ابْتَكَرَ ثُمَّ دَنَا فَاسْتَمَعَ وَأَنْصَتَ كَانَ لَهُ بِكُلِّ خُطْوَةٍ خَطَاهَا كَصِيَامِ سَنَةٍ وَقِيَامِ سَنَةٍ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Abdurrozzaq] berkata; telah mengabarkan kepada kami [Ibnu Juraij] dari ['Umar bin Muhammad] dari [Sa'id bin Abu Hilal] dari [Muhammad bin Sa'id] dari [Aus bin Aus] dari Nabi Shallallahu'alaihiwasallam bersabda: \"Apabila hari Jum'at tiba, lantas salah seorang diantara kalian membasuh kepalanya, mandi, berangkat sedini mungkin, mendekat imam, mendengar khutbah dengan baik, dan diam,, maka setiap langkah yang dilakukannya bagaikan puasa dan sholat selama setahun.\""
            },
            {
                "number": 916,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ السَّهْمِيُّ قَالَ حَدَّثَنَا حَاتِمُ بْنُ أَبِي صَغِيرَةَ عَنِ النُّعْمَانِ بْنِ سَالِمٍ أَنَّ عَمْرَو بْنَ أَوْسٍ أَخْبَرَهُ أَنَّ أَبَاهُ أَوْسًا أَخْبَرَهُ قَالَإِنَّا لَقُعُودٌ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصُّفَّةِ وَهُوَ يَقُصُّ عَلَيْنَا وَيُذَكِّرُنَا إِذْ جَاءَ رَجُلٌ فَسَارَّهُ فَقَالَ اذْهَبُوا فَاقْتُلُوهُ قَالَ فَلَمَّا وَلَّى الرَّجُلُ دَعَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ قَالَ الرَّجُلُ نَعَمْ نَعَمْ يَا رَسُولَ اللَّهِ فَقَالَ اذْهَبُوا فَخَلُّوا سَبِيلَهُ فَإِنَّمَا أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لَا إِلَهَ إِلَّا اللَّهُ فَإِذَا فَعَلُوا ذَلِكَ حُرِّمَتْ عَلَيَّ دِمَاؤُهُمْ وَأَمْوَالُهُمْ إِلَّا بِحَقِّهَاقَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ قَالَ حَدَّثَنَا أَبُو يُونُسَ حَاتِمُ بْنُ أَبِي صَغِيرَةَ قَالَ حَدَّثَنِي النُّعْمَانُ بْنُ سَالِمٍ أَنَّ عَمْرَو بْنَ أَوْسٍ أَخْبَرَهُ عَنْ أَبِيهِ أَوْسٍ قَالَ إِنَّا لَقُعُودٌ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحَدِّثُنَا وَيُوصِينَا إِذْ أَتَاهُ رَجُلٌ فَذَكَرَ مِثْلَهُ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Abdullah bin Bakr As-Sahmi] berkata; telah menceritakan kepada kami [Hatim bin Abu Saghirah] dari [An Nu'man bin Salim] ['Amr bin Aus] mengabarinya, [Bapaknya, Aus] mengabarinya berkata; kami sedang duduk di samping Rasulullah Shallallahu'alaihiwasallam di suatu bangunan, beliau berbagi cerita kepada kami dan mengingatkan kami. Tiba-tiba datanglah seorang yang marah-marah kepada beliau. Lalu beliau bersabda: \"Pergilah dan bunuhlah dia\". (Aus) berkata; tatkala laki-laki itu telah berpaling, Rasulullah Shallallahu'alaihiwasallam memanggilnya dan bersabda: \"Apakah dia mengucapkan \"Tidak ada tuhan selain Allah? '\". Orang itu berkata; ya, ya Wahai Rasulullah, Lalu beliau bersabda: \"Pergilah dan biarkanlah, saya hanya diperintah untuk memerangi manusia sampai mereka bersaksi bahwa tidak ada sesembahan yang hak selain Allah. Jika mereka melakukan hal itu, maka diharamkan bagiku darah mereka dan harta mereka kecuali ada alasan yang dibenarkan.\" (Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Muhammad bin Abdullah Al Anshari] berkata; telah menceritakan kepada kami [Abu Yunus, Hatim bin Abu Saghirah] berkata; telah menceritakan kepadaku [Nu'man bin Salim] ['Amr bin Aus] mengabarinya dari [Bapaknya, Aus] berkata; kami sedang duduk di sisi Rasulullah Shallallahu'alaihiwasallam, beliau menceritakan kepada kami dan memberi nasehat kepada kami. Tiba-tiba datang seorang laki-laki, lalu menyebutkan hadis secara lengkap."
            },
            {
                "number": 917,
                "arab": "قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا يَعْلَى بْنُ عَطَاءٍ عَنْ أَوْسِ بْنِ أَبِي أَوْسٍ قَالَرَأَيْتُ أَبِي يَوْمًا تَوَضَّأَ فَمَسَحَ النَّعْلَيْنِ فَقُلْتُ لَهُ أَتَمْسَحُ عَلَيْهِمَا فَقَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Bahz bin Asad] telah menceritakan kepada kami [Hammad bin Salamah] telah menceritakan kepada kami [Ya'la bin 'Atha`] dari [Aus bin Abu Aus] berkata; saya telah melihat [bapakku] pada suatu hari berwudlu dan mengusap kedua sandalnya, lalu saya bertanya kepadanya, apakah bapak mengusap keduanya?. Dia menjawab, beginilah saya melihat Rasulullah Shallallahu'alaihiwasallam melakukan."
            },
            {
                "number": 918,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الطَّائِفِيُّ عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ أَوْسٍ الثَّقَفِيِّ عَنْ جَدِّهِ أَوْسِ بْنِ حُذَيْفَةَ قَالَكُنْتُ فِي الْوَفْدِ الَّذِينَ أَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْلَمُوا مِنْ ثَقِيفٍ مِنْ بَنِي مَالِكٍ أَنْزَلَنَا فِي قُبَّةٍ لَهُ فَكَانَ يَخْتَلِفُ إِلَيْنَا بَيْنَ بُيُوتِهِ وَبَيْنَ الْمَسْجِدِ فَإِذَا صَلَّى الْعِشَاءَ الْآخِرَةَ انْصَرَفَ إِلَيْنَا وَلَا نَبْرَحُ حَتَّى يُحَدِّثَنَا وَيَشْتَكِي قُرَيْشًا وَيَشْتَكِي أَهْلَ مَكَّةَ ثُمَّ يَقُولُ لَا سَوَاءَ كُنَّا بِمَكَّةَ مُسْتَذَلِّينَ وَمُسْتَضْعَفِينَ فَلَمَّا خَرَجْنَا إِلَى الْمَدِينَةِ كَانَتْ سِجَالُ الْحَرْبِ عَلَيْنَا وَلَنَا فَمَكَثَ عَنَّا لَيْلَةً لَمْ يَأْتِنَا حَتَّى طَالَ ذَلِكَ عَلَيْنَا بَعْدَ الْعِشَاءِ قَالَ قُلْنَا مَا أَمْكَثَكَ عَنَّا يَا رَسُولَ اللَّهِ قَالَ طَرَأَ عَلَيَّ حِزْبٌ مِنْ الْقُرْآنِ فَأَرَدْتُ أَنْ لَا أَخْرُجَ حَتَّى أَقْضِيَهُ قَالَ فَسَأَلْنَا أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ أَصْبَحْنَا قَالَ قُلْنَا كَيْفَ تُحَزِّبُونَ الْقُرْآنَ قَالُوا نُحَزِّبُهُ ثَلَاثَ سُوَرٍ وَخَمْسَ سُوَرٍ وَسَبْعَ سُوَرٍ وَتِسْعَ سُوَرٍ وَإِحْدَى عَشْرَةَ سُورَةً وَثَلَاثَ عَشْرَةَ سُورَةً وَحِزْبَ الْمُفَصَّلِ مِنْ قَافْ حَتَّى يُخْتَمَ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Abdullah bin Abdurrahman Ath-Tha'ifi] dari ['Utsman bin Abdullah bin Aus Ats-Tsaqafi] dari [kakeknya, Aus bin Hudzaifah] berkata; saya berada dalam rombongan utusan yang mendatangi Nabi Shallallahu'alaihiwasallam. Mereka telah masuk Islam, dari kabilah tsaqif Tsaqif, dari Bani Malik. Kami mendatangi kemah besar beliau, yang kemah tersebut berada antara rumahnya dan masjid. Jika beliau telah melaksanakan sholat isya' pada akhir malam, beliau mengunjungi kami, dan kami tidak meninggalkan tempat itu sampai beliau menceritakan kepada kami dan mengadukan penderitaannya dari orang Quraisy dan penduduk Makkah. Selanjutnya beliau bersabda: \"Tidak sama, kami di Makkah dalam keadaan selalu dihinakan dan dilemahkan. Tatkala kami keluar ke Madinah, terjadilah peperangan, Kemenangan dan kekalahan terjadi silih berganti, terkadang kami menerima kekalahan, namun terkadang memperoleh kemenangan\". Suatu malam beliau tidak mendatangi kami, hal itu berlalu sekian lama sesudah waktu isya'. (Aus bin Hudzaifah) berkata; apa yang menyebabkan anda meninggalkan kami Wahai Rasulullah? Beliau bersabda: \"Telah turun kepadaku sekian kumpulan alqur'an, sehingga memaksa saya tidak keluar sampai hal itu selesai. (Aus bin Hudzaifah) berkata; kami bertanya kepada para sahabat Rasulullah Shallallahu'alaihiwasallam pada pagi harinya. Bagaimana kalian membagi pengelompokan Al qur'an?, mereka menjawab, kami membaginya menjadi tiga surat, lima surat, tujuh surat, sembilan surat, sebelas surat, tiga belas surat, dan hizb Al mufashshal yaitu dari surat QAF sampai akhir."
            },
            {
                "number": 919,
                "arab": "قَالَ حَدَّثَنَا وَكِيعٌ عَنْ شَرِيكٍ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ أَوْسِ بْنِ أَبِي أَوْسٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ وَمَسَحَ عَلَى نَعْلَيْهِ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Waki'] dari [Syarik] dari [Ya'la bin 'Atha`] dari [Aus bin Abu Aus] dari [Bapaknya] Nabi Shallallahu'alaihiwasallam berwudlu dengan mengusap kedua sandalnya."
            },
            {
                "number": 920,
                "arab": "قَالَ حَدَّثَنَا بَهْزٌ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا النُّعْمَانُ بْنُ سَالِمٍ عَنْ رَجُلٍ جَدُّهُ أَوْسُ بْنُ أَبِي أَوْسٍكَانَ يُصَلِّي وَيُومِئُ إِلَى نَعْلَيْهِ وَهُوَ فِي الصَّلَاةِ فَيَأْخُذُهُمَا فَيَنْتَعِلُهُمَا وَيُصَلِّي فِيهِمَا وَيَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي نَعْلَيْهِ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [An Nu'man bin Salim] dari [seorang laki-laki], yaitu kakeknya, [Aus bin Abu Aus] dia sholat dan memberi isyarat kepada sepasang sandalnya padahal dalam keadaan sholat, lalu dia mengambil keduanya dan memakainya dan dipergunakannya untuk sholat. Lalu dia berkata; Rasulullah Shallallahu'alaihiwasallam sholat dengan memakai kedua sandalnya."
            },
            {
                "number": 921,
                "arab": "حَدَّثَنَا بَهْزٌ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ وَكِيعِ بْنِ عُدُسٍ عَنْ عَمِّهِ أَبِي رَزِينٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الرُّؤْيَا مُعَلَّقَةٌ بِرِجْلِ طَائِرٍ مَا لَمْ يُحَدِّثْ بِهَا صَاحِبُهَا فَإِذَا حَدَّثَ بِهَا وَقَعَتْ وَلَا تُحَدِّثُوا بِهَا إِلَّا عَالِمًا أَوْ نَاصِحًا أَوْ لَبِيبًا وَالرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ أَرْبَعِينَ جُزْءًا مِنْ النُّبُوَّةِ",
                "id": "Telah menceritakan kepada kami [Bahz] berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Ya'la bin 'Atha`] dari [Waki' bin 'Udus] dari [pamannya, Abu Razin] dari Nabi Shallallahu'alaihiwasallam bersabda: \"Setiap mimpi adalah sebuah misteri selama orang yang bermimpi belum menceritakannya. Jika dia telah menceritakannya, maka akan terjadi. Janganlah kalian menceritakannya kecuali kepada orang alim, atau orang yang bisa memberi nasehat atau orang yang berakal, mimpi yang baik adalah bagian dari empat puluh bagian kenabian\""
            },
            {
                "number": 922,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنِ النُّعْمَانِ بْنِ سَالِمٍ عَنْ عَمْرِو بْنِ أَوْسٍ عَنْ أَبِي رَزِينٍ الْعُقَيْلِيِّ أَنَّهُأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أَبِي شَيْخٌ كَبِيرٌ لَا يَسْتَطِيعُ الْحَجَّ وَلَا الْعُمْرَةَ وَلَا الظَّعْنَ قَالَ حُجَّ عَنْ أَبِيكَ وَاعْتَمِرْ",
                "id": "Telah menceritakan kepada kami [Waki'] berkata; telah menceritakan kepada kami [Syu'bah] dari [An Nu'man bin Salim] dari ['Amr bin Aus] dari [Abu Razin Al 'Uqaily] dia mendatangi Nabi Shallallahu'alaihiwasallam dan berkata; bapakku sudah tua dan tidak mampu lagi untuk berhaji, umrah dan juga berkendaraan. Rasulullah Shallallahu'alaihiwasallam bersabda: \"Berhajilah dan berumrahlah untuk menggantikan bapakmu.\""
            },
            {
                "number": 923,
                "arab": "قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ وَكِيعِ بْنِ عُدُسٍ عَنْ عَمِّهِ أَبِي رَزِينٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَكُلُّنَا يَرَى اللَّهَ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ وَمَا آيَةُ ذَلِكَ فِي خَلْقِهِ قَالَ يَا أَبَا رَزِينٍ أَلَيْسَ كُلُّكُمْ يَرَى الْقَمَرَ مُخْلِيًا بِهِ قَالَ قُلْتُ بَلَى يَا رَسُولَ اللَّهِ قَالَ فَاللَّهُ أَعْظَمُ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Yazid bin Harun] berkata; telah mengabarkan kepada kami [Hammad bin Salamah] dari [Ya'la bin 'Atho`] dari [Waki' bin 'Udus] dari [pamannya, Abu Razin] berkata; saya berkata; Wahai Rasulullah, apakah semua dari kita bisa melihat Allah AzzaWaJalla pada Hari Kiamat, tolong jelaskan tandanya dari ciptaAn Nya!. Beliau bersabda: \"Wahai Abu Razin, tidakkah kalian semua bisa melihat bulan dengan mata telanjang?\". (Abu Razin) berkata; saya menjawab, ya Wahai Rasulullah? Beliau bersabda: \"Allah lebih Agung.\""
            },
            {
                "number": 924,
                "arab": "قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ وَكِيعِ بْنِ عُدُسٍ عَنْ عَمِّهِ أَبِي رَزِينٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحِكَ رَبُّنَا مِنْ قُنُوطِ عَبْدِهِ وَقُرْبِ غَيْرِهِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَوَيَضْحَكُ الرَّبُّ عَزَّ وَجَلَّ قَالَ نَعَمْ قَالَ لَنْ نَعْدَمَ مِنْ رَبٍّ يَضْحَكُ خَيْرًا",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Yazid bin Harun] berkata; telah mengabarkan kepada kami [Hammad bin Salamah] dari [Ya'la bin 'Atha`] dari [Waki' bin 'Udus] dari [pamannya, Abu Razin] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Rabb kita tertawa terhadap hamba-Nya yang berputus asa karena sadar dirinya lemah dan membutuhkan pertolongan\". (Abu Razin) berkata; saya bertanya, \"Wahai Rasulullah, Apakah Rabb AzzaWaJalla tertawa?\" Rasulullah bersabda: \"Ya\". (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Selama Rab kita tertawa, kita tidak kehilangan kebaikan.\""
            },
            {
                "number": 925,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ وَكِيعِ بْنِ عُدُسٍ عَنْ عَمِّهِ أَبِي رَزِينٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَيْنَ كَانَ رَبُّنَا عَزَّ وَجَلَّ قَبْلَ أَنْ يَخْلُقَ خَلْقَهُ قَالَ كَانَ فِي عَمَاءٍ مَا تَحْتَهُ هَوَاءٌ وَمَا فَوْقَهُ هَوَاءٌ ثُمَّ خَلَقَ عَرْشَهُ عَلَى الْمَاءِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Hammad bin Salamah] dari [Ya'la bin 'Atho`] dari [Waki' bin 'Udus] dari [pamannya, Abu Razin] berkata; saya berkata; \"Wahai Rasulullah, di mana Rab kita AzzaWaJalla sebelum mencipta makhluq-Nya?\", beliau berkata; \"Dia berada di awan yang bagian bawah dan atasnya adalah ruang udara kemudian Dia menciptakan Arsy-Nya di atas air\""
            },
            {
                "number": 926,
                "arab": "قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي النُّعْمَانُ بْنُ سَالِمٍ قَالَ سَمِعْتُ عَمْرَو بْنَ أَوْسٍ يُحَدِّثُ عَنْ أَبِي رَزِينٍ أَنَّهُ قَالَيَا رَسُولَ اللَّهِ إِنَّ أَبِي شَيْخٌ كَبِيرٌ لَا يَسْتَطِيعُ الْحَجَّ وَالْعُمْرَةَ وَلَا الظَّعْنَ قَالَ حُجَّ عَنْ أَبِيكَ وَاعْتَمِرْ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami ['Affan] berkata; telah menceritakan kepada kami [Syu'bah] berkata; telah menghabarkan kepadaku [An Nu'man bin Salim] berkata; saya mendengar ['Amr bin Aus] menceritakan dari [Abu Razin] dia berkata; Wahai Rasulullah, bapakku orang yang sudah tua, tidak mampu untuk berhaji dan umrah atau naik kendaraan. (Rasulullah shallallahu'alaihiwasallam) bersabda: \"Berhajilah dan umrahlah untuk menggantikan bapakmu.\""
            },
            {
                "number": 927,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا سُفْيَانُ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ أَبِي رَزِينٍ لَقِيطٍ عَنْ عَمِّهِ رَفَعَهُ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ أَرْبَعِينَ جُزْءًا مِنْ النُّبُوَّةِ أَشُكُّ أَنَّهُ قَالَ رُؤْيَا الْمُؤْمِنِ عَلَى رِجْلِ طَائِرٍ مَا لَمْ يُخْبِرْ بِهَا فَإِذَا أَخْبَرَ بِهَا وَقَعَتْ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Abdurrazzaq] berkata; telah menghabarkan kepada kami [Sufyan] dari [Ya'la bin 'Atha`] dari [Abu Razin, Laqith] dari [Pamannya] dengan memarfukkannya, berkata; Nabi bersabda: \"Mimpi seorang mukmin adalah bagian dari empat puluh bagian kenabian\", saya ragu dia berkata; mimpi seorang mukmin adalah sebuah misteri selama belum dikabarkannya. Jika dikabarkan maka akan terjadi."
            },
            {
                "number": 928,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ وَكِيعِ بْنِ حُدُسٍ عَنْ أَبِي رَزِينٍ عَمِّهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ يُحْيِي اللَّهُ الْمَوْتَى فَقَالَ أَمَا مَرَرْتَ بِالْوَادِي مُمْحِلًا ثُمَّ تَمُرُّ بِهِ خَضِرًا قَالَ شُعْبَةُ قَالَهُ أَكْثَرَ مِنْ مَرَّتَيْنِ كَذَلِكَ يُحْيِي اللَّهُ الْمَوْتَى",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin 'Atha`] dari [Waki' bin Hudus] dari [Abu Razin, pamannya] berkata; saya berkata; Wahai Rasulullah, bagaimana Allah menghidupkan makhluq yang sudah mati?. Lalu (Rasulullah shallallahu'alaihiwasallam) bersabda: \"Bagaimana jika kalian melewati suatu bukit yang sangat tandus lalu kalian melewatinya dalam keadaan yang sangat subur?.\" Syu'bah berkata; beliau mengatakannya lebih dari dua kali, demikianlah Allah menghidupkan makhluq yang mati."
            },
            {
                "number": 929,
                "arab": "قَالَ حَدَّثَنَا عَلِيُّ بْنُ إِسْحَاقَ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ الْمُبَارَكِ قَالَ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ أَبِي رَزِينٍ الْعُقَيْلِيِّ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ يُحْيِي اللَّهُ الْمَوْتَى قَالَ أَمَا مَرَرْتَ بِأَرْضٍ مِنْ أَرْضِكَ مُجْدِبَةٍ ثُمَّ مَرَرْتَ بِهَا مُخْصَبَةً قَالَ نَعَمْ قَالَ كَذَلِكَ النُّشُورُ قَالَ يَا رَسُولَ اللَّهِ وَمَا الْإِيمَانُ قَالَ أَنْ تَشْهَدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ وَأَنْ يَكُونَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْكَ مِمَّا سِوَاهُمَا وَأَنْ تُحْرَقَ بِالنَّارِ أَحَبُّ إِلَيْكَ مِنْ أَنْ تُشْرِكَ بِاللَّهِ وَأَنْ تُحِبَّ غَيْرَ ذِي نَسَبٍ لَا تُحِبُّهُ إِلَّا لِلَّهِ عَزَّ وَجَلَّ فَإِذَا كُنْتَ كَذَلِكَ فَقَدْ دَخَلَ حُبُّ الْإِيمَانِ فِي قَلْبِكَ كَمَا دَخَلَ حُبُّ الْمَاءِ لِلظَّمْآنِ فِي الْيَوْمِ الْقَائِظِ قُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ لِي بِأَنْ أَعْلَمَ أَنِّي مُؤْمِنٌ قَالَ مَا مِنْ أُمَّتِي أَوْ هَذِهِ الْأُمَّةِ عَبْدٌ يَعْمَلُ حَسَنَةً فَيَعْلَمُ أَنَّهَا حَسَنَةٌ وَأَنَّ اللَّهَ عَزَّ وَجَلَّ جَازِيهِ بِهَا خَيْرًا وَلَا يَعْمَلُ سَيِّئَةً فَيَعْلَمُ أَنَّهَا سَيِّئَةٌ وَاسْتَغْفَرَ اللَّهَ عَزَّ وَجَلَّ مِنْهَا وَيَعْلَمُ أَنَّهُ لَا يَغْفِرُ إِلَّا هُوَ إِلَّا وَهُوَ مُؤْمِنٌ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami ['Ali bin Ishaq] berkata; telah menghabarkan kepada kami [Abdullah] yaitu Ibnu Al Mubarak, berkata; telah menghabarkan kepada kami [Abdurrahman bin Yazid bin Jabir] dari [Sulaiman bin Musa] dari [Abu Razin Al 'Uqaili] berkata; saya menemui Rasulullah shallallahu'alaihiwasallam lalu saya berkata; Wahai Rasulullah, bagaimana Allah menghidupkan orang yang mati, apa bukti tersebut bagi makhluq-Nya? (Rasulullah shallallahu'alaihiwasallam) menjawab, \"Apa kalian pernah melewati suatu tanah yang tandus lalu kalian melewatinya dalam keadaan subur?\" (Abu Razin) berkata; \"Ya.\" Lalu (Rasulullah shallallahu'alaihiwasallam) bersabda: \"Begitulah fenomena kebangkitan.\" (Abu Razin) berkata; Wahai Rasulullah, apakah iman itu? Beliau bersabda: \"Kamu bersaksi bahwa tidak ada sesembahan yang hak selain Allah, Yang Maha Esa, tidak ada sekutu bagi-Nya, Muhammad adalah hamba-Nya dan Rasul-Nya. Allah dan Rasul-Nya lebih kamu sukai daripada selainnya. Ia dibakar dengan neraka lebih dia sukai daripada menyekutukan Allah. Kamu mencintai orang yang tidak punya kekerabatan denganmu, kamu tidak mencintainya kecuali hanya karena Allah AzzaWaJalla. Jika kamu seperti itu, kecintaan kepada iman telah masuk dalam hatimu, sebagaimana masuknya air kepada orang yang haus pada hari yang sangat panas. Saya bertanya, Wahai Rasulullah, bagaimana saya mengetahui bahwa saya adalah seorang mukmin?. Beliau bersabda: \"Tidaklah dari umatku, atau dari umat ini seorang hamba yang mengerjakan kebaikan, lalu dia mengetahui bahwa hal itu adalah kebaikan, ia sadar bahwa Allah AzzaWaJalla akan membalasnya dengan kebaikan, dia tidak melakukan kejelekan dan dia mengetahui bahwa itu adalah kejelekan, lalu dia meminta ampunan kepada Allah AzzaWaJalla, dan dia sadar bahwa tidak ada yang mengampuni selain Dia kecuali orang yang mukmin.\""
            },
            {
                "number": 930,
                "arab": "قَالَ حَدَّثَنَا بَهْزٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي يَعْلَى بْنُ عَطَاءٍ قَالَ سَمِعْتُ وَكِيعَ بْنَ حُدُسٍ يُحَدِّثُ عَنْ عَمِّهِ أَبِي رَزِينٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ رُؤْيَا الْمُسْلِمِ جُزْءٌ مِنْ أَرْبَعِينَ جُزْءًا مِنْ النُّبُوَّةِ وَهِيَ عَلَى رِجْلِ طَائِرٍ مَا لَمْ يُحَدِّثْ بِهَا فَإِذَا حَدَّثَ بِهَا وَقَعَتْ قَالَ أَظُنُّهُ قَالَ لَا يُحَدِّثُ بِهَا إِلَّا حَبِيبًا أَوْ لَبِيبًا",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Bahz] berkata; telah menceritakan kepada kami [Syu'bah] berkata; telah menghabarkan kepadaku [Ya'la bin 'Atha`] berkata; saya mendengar [Waki' bin Hudus] dari [Pamannya, Abu Razin] Rasulullah shallallahu'alaihiwasallam bersabda: \"Mimpi seorang muslim adalah bagian dari empat puluh kenabian, dan hal itu merupakan sebuah misteri selama belum diceritakannya. Jika dia menceritakannya maka akan terjadi.\" (Abu Razin) berkata; setahu saya beliau mengatakan 'Janganlah kamu menceritakannya kecuali kepada orang yang dia sukai atau kepada orang yang berakal.'"
            },
            {
                "number": 931,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْحَجَّاجِ النَّاجِيُّ قَالَ حَدَّثَنَا عَبْدُ الْقَاهِرِ بْنُ السَّرِيِّ قَالَ حَدَّثَنِي ابْنٌ لِكِنَانَةَ بْنِ عَبَّاسِ بْنِ مِرْدَاسٍ عَنْ أَبِيهِ أَنَّ أَبَاهُ الْعَبَّاسَ بْنَ مِرْدَاسٍ حَدَّثَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَا عَشِيَّةَ عَرَفَةَ لِأُمَّتِهِ بِالْمَغْفِرَةِ وَالرَّحْمَةِ فَأَكْثَرَ الدُّعَاءَ فَأَجَابَهُ اللَّهُ عَزَّ وَجَلَّ أَنْ قَدْ فَعَلْتُ وَغَفَرْتُ لِأُمَّتِكَ إِلَّا مَنْ ظَلَمَ بَعْضُهُمْ بَعْضًا فَقَالَ يَا رَبِّ إِنَّكَ قَادِرٌ أَنْ تَغْفِرَ لِلظَّالِمِ وَتُثِيبَ الْمَظْلُومَ خَيْرًا مِنْ مَظْلَمَتِهِ فَلَمْ يَكُنْ فِي تِلْكَ الْعَشِيَّةِ إِلَّا ذَا فَلَمَّا كَانَ مِنْ الْغَدِ دَعَا غَدَاةَ الْمُزْدَلِفَةِ فَعَادَ يَدْعُو لِأُمَّتِهِ فَلَمْ يَلْبَثْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَبَسَّمَ فَقَالَ بَعْضُ أَصْحَابِهِ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي ضَحِكْتَ فِي سَاعَةٍ لَمْ تَكُنْ تَضْحَكُ فِيهَا فَمَا أَضْحَكَكَ أَضْحَكَ اللَّهُ سِنَّكَ قَالَ تَبَسَّمْتُ مِنْ عَدُوِّ اللَّهِ إِبْلِيسَ حِينَ عَلِمَ أَنَّ اللَّهَ عَزَّ وَجَلَّ قَدْ اسْتَجَابَ لِي فِي أُمَّتِي وَغَفَرَ لِلظَّالِمِ أَهْوَى يَدْعُو بِالثُّبُورِ وَالْوَيْلِ وَيَحْثُو التُّرَابَ عَلَى رَأْسِهِ فَتَبَسَّمْتُ مِمَّا يَصْنَعُ جَزَعُهُ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepadaku [Ibrahim bin Alhajjaj] berkata; telah menceritakan kepada kami [Abdul Qahir bin As-Sari] berkata; telah menceritakan kepadaku [salah seorang anak Kinanah bin 'Abbas bin Mirdas] dari [bapaknya] bapaknya, [Al 'Abbas bin Mirdas], menceritakannya, Rasulullah shallallahu'alaihiwasallam, berdoa untuk ummatnya di Arafah pada waktu sore dengan pengampunan dan rahmat. Beliau memperbanyak doa, lalu Allah AzzaWaJalla menjawabnya, telah Aku kerjakan dan telah Aku ampuni dosa ummatmu kecuali yang berlaku zhalim di antara kalian. (Rasulullah shallallahu'alaihiwasallam) bersabda: \"Wahai Rabku Engkau mampu untuk mengampuni yang berbuat zhalim dan memberikan pahala bagi yang teraniaya atas kezhalimannya.\" Tidaklah beliau berdoa sore itu kecuali seperti itu, sampai kemudian pada esok harinya di Muzdalifah berdoa seperti sebelumnya, sampai kemudian terlihat senyum beliau. Sebagian sahabat berkata; \"Wahai Rasulullah, demi bapak dan ibumu, sungguh engkau tertawa pada waktu yang engkau tidak pernah tertawa saat itu, apakah gerangan yang membuatmu tertawa, apakah Allah yang yang menjadikan anda tertawa. (Rasulullah shallallahu'alaihiwasallam) bersabda: \"Aku tertawa dari musuh Allah iblis, ketika dia mengetahui bahwa Allah AzzaWaJalla mengabulkan permintaan doaku dengan mengampuni ummatku dan yang berbuat zhalim, kemudian mengampuni orang yang berbuat aniaya, Iblis mengambil pasir lalu manaburkannya di atas kepalanya, maka aku tersenyum karenanya.\""
            },
            {
                "number": 932,
                "arab": "قَالَ حَدَّثَنَا هُشَيْمٌ عَنِ ابْنِ أَبِي خَالِدٍ وَزَكَرِيَّا عَنِ الشَّعْبِيِّ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ مُضَرِّسٍ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِجَمْعٍ فَقُلْتُ يَا رَسُولَ اللَّهِ جِئْتُكَ مِنْ جَبَلَيْ طَيِّءٍ أَتْعَبْتُ نَفْسِي وَأَنْصَبْتُ رَاحِلَتِي وَاللَّهِ مَا تَرَكْتُ مِنْ جَبَلٍ إِلَّا وَقَفْتُ عَلَيْهِ فَهَلْ لِي مِنْ حَجٍّ فَقَالَ مَنْ شَهِدَ مَعَنَا هَذِهِ الصَّلَاةَ يَعْنِي صَلَاةَ الْفَجْرِ بِجَمْعٍ وَوَقَفَ مَعَنَا حَتَّى نُفِيضَ مِنْهُ وَقَدْ أَفَاضَ قَبْلَ ذَلِكَ مِنْ عَرَفَاتٍ لَيْلًا أَوْ نَهَارًا فَقَدْ تَمَّ حَجُّهُ وَقَضَى تَفَثَهُ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Husyaim] dari [Ibnu Abu Khalid] dan [Zakariya] dari [Asy-Sya'bi] berkata; telah mengabarkan kepadaku ['Urwah bin Mudlarris] berkata; saya mendatangi Nabi Shallallahu'alaihiwasallam dan beliau sedang di Jam', saya berkata kepada beliau 'Wahai Rasulullah, aku datang kepada engkau dari daerah gunung Thayyi' sehingga aku keletihan dan tungganganku kelelahan, Demi Allah, tidaklah aku tinggalkan gunung kecuali agar dapat berdiri di sana. Apakah dengan ini, saya mendapatkan haji (tidak batalkah hajiku)?, maka (Rasulullah shallallahu'alaihiwasallam) bersabda: \"Barangsiapa sholat subuh bersama kami di Muzdalifah, dan melakukan wuquf bersama kita lalu bertolak darinya, atau sudah bertolak sebelumnya dari Arafah baik malam atau siang maka haji telah sah\" "
            },
            {
                "number": 933,
                "arab": "قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا زَكَرِيَّا عَنِ الشَّعْبِيِّ قَالَ حَدَّثَنِي عُرْوَةُ بْنُ مُضَرِّسِ بْنِ أَوْسِ بْنِ حَارِثَةَ بْنِ لَامٍأَنَّهُ حَجَّ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يُدْرِكْ النَّاسَ إِلَّا لَيْلًا وَهُوَ بِجَمْعٍ فَانْطَلَقَ إِلَى عَرَفَاتٍ فَأَفَاضَ مِنْهَا ثُمَّ رَجَعَ فَأَتَى جَمْعًا فَقَالَ يَا رَسُولَ اللَّهِ أَتْعَبْتُ نَفْسِي وَأَنْصَبْتُ رَاحِلَتِي فَهَلْ لِي مِنْ حَجٍّ فَقَالَ مَنْ صَلَّى مَعَنَا صَلَاةَ الْغَدَاةِ بِجَمْعٍ وَوَقَفَ مَعَنَا حَتَّى نُفِيضَ وَقَدْ أَفَاضَ قَبْلَ ذَلِكَ مِنْ عَرَفَاتٍ لَيْلًا أَوْ نَهَارًا فَقَدْ تَمَّ حَجُّهُ وَقَضَى تَفَثَهُ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Abu Nua'im] berkata; telah menceritakan kepada kami [Zakariya] dari [Asy-Sya'bi] berkata; telah menceritakan kepada kami ['Urwah bin Mudlarris bin Aus bin Haritsah bin Lam] dia melakukan haji pada masa Rasulullah shallallahu'alaihiwasallam, dia tidak menjumpai orang-orang kecuali pada malam hari ketika di Muzdalifah, lalu dia berangkat ke Arafah dan bertolak daripadanya dengan cepat, ia pulang dan datang lagi ke Jama' (Muzdalifah). Lalu dia berkata; Wahai Rasulullah, saya telah kecapekan dan tungganganku telah kelelahan, apakah saya telah mendapatkan haji?. (Rasulullah shallallahu'alaihiwasallam) bersabda: \"Barangsiapa yang sholat subuh bersama kami di di Jam' (Muzdalifah) dan melakukan wuquf bersama kami hingga kita bertolak (dari Arafah) padahal sebelumnya ia telah bertolak dari Arafah pada. malam atau siangnya, berarti telah terlaksana hajinya dan menuntaskan manasiknya"
            },
            {
                "number": 934,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أُخْبِرْتُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ و عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ فُلَانٍ و عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ وَلَمْ يَبْلُغْ أَبُو الزُّبَيْرِ هَذِهِ الْقِصَّةَ كُلَّهَاأَنَّ أَبَا قَتَادَةَ أَتَى أَهْلَهُ فَوَجَدَ قَصْعَةَ ثَرِيدٍ مِنْ قَدِيدِ الْأَضْحَى فَأَبَى أَنْ يَأْكُلَهُ فَأَتَى قَتَادَةَ بْنَ النُّعْمَانِ فَأَخْبَرَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِي حَجٍّ فَقَالَ إِنِّي كُنْتُ أَمَرْتُكُمْ أَنْ لَا تَأْكُلُوا الْأَضَاحِيَّ فَوْقَ ثَلَاثَةِ أَيَّامٍ لِتَسَعَكُمْ وَإِنِّي أُحِلُّهُ لَكُمْ فَكُلُوا مِنْهُ مَا شِئْتُمْ قَالَ وَلَا تَبِيعُوا لُحُومَ الْهَدْيِ وَالْأَضَاحِيِّ فَكُلُوا وَتَصَدَّقُوا وَاسْتَمْتِعُوا بِجُلُودِهَا وَإِنْ أُطْعِمْتُمْ مِنْ لُحُومِهَا شَيْئًا فَكُلُوهُ إِنْ شِئْتُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Bakr] berkata; telah menghabarkan kepada kami [Ibnu Juraij] berkata; saya telah diberi kabar, [Abu Sa'id Al Khudri], dan dari [Sulaiman bin Musa] dari [Fulan] dan [Abu Zubair] dari [Jabir bin Abdullah] dan belum tersampaikan kisah ini kepada Abu Zubair secara keseluruhan, Abu Qatadah mendatangi keluarganya lalu mendapati periuk (yang bisa memuat sepuluh orang) yang berisi tsarid (makanan yang terbuat dari daging dan roti) dari bahan dendeng hewan kurban, lalu dia menolak untuk memakannnya. [Qatadah bin Nu'man] datang, mengabarkan kepadanya, Nabi Shallallahu'alaihiwasallam berdiri pada Hari Haji dan bersabda: \"Aku dahulu memperintahkan kalian untuk tidak memakan sembelihan kurban di atas tiga hari untuk mencukupkan kalian. Sekarang aku memperbolehkan kalian darinya sekehendak hati kalian.\" Dan beliau bersabda: \"Janganlah kalian menjual daging Hadyu (daging yang disembelih Jamaah Haji waktu pelaksanaan ibadah), tapi makanlah, bersedekahlah dan nikmatilah dengan kulitnya. Jika kalian diberi makan dengan daging tersebut maka makanlah sekehendak hati kalian.\""
            },
            {
                "number": 935,
                "arab": "قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ حَدَّثَنِي ابْنُ جُرَيْجٍ قَالَ قَالَ سُلَيْمَانُ بْنُ مُوسَى أَخْبَرَنِي زُبَيْدٌأَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ أَتَى أَهْلَهُ فَوَجَدَ قَصْعَةً مِنْ قَدِيدِ الْأَضْحَى فَأَبَى أَنْ يَأْكُلَهُ فَأَتَى قَتَادَةَ بْنَ النُّعْمَانِ فَأَخْبَرَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فَقَالَ إِنِّي كُنْتُ أَمَرْتُكُمْ أَنْ لَا تَأْكُلُوا الْأَضَاحِيَّ فَوْقَ ثَلَاثَةِ أَيَّامٍ لِتَسَعَكُمْ وَإِنِّي أُحِلُّهُ لَكُمْ فَكُلُوا مِنْهُ مَا شِئْتُمْ وَلَا تَبِيعُوا لُحُومَ الْهَدْيِ وَالْأَضَاحِيِّ فَكُلُوا وَتَصَدَّقُوا وَاسْتَمْتِعُوا بِجُلُودِهَا وَلَا تَبِيعُوهَا وَإِنْ أُطْعِمْتُمْ مِنْ لَحْمِهَا فَكُلُوا إِنْ شِئْتُمْو قَالَ فِي هَذَا الْحَدِيثِ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَالْآنَ فَكُلُوا وَاتَّجِرُوا وَادَّخِرُوا قَالَ حَدَّثَنَا حَجَّاجٌ عَنِ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ عَنْ جَابِرٍ نَحْوَ حَدِيثِ زُبَيْدٍ هَذَا عَنْ أَبِي سَعِيدٍ لَمْ يَبْلُغْهُ كُلُّ ذَلِكَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Hajjaj] berkata; telah menceritakan kepadaku [Ibnu Juraij] berkata; [Sulaiman bin Musa] berkata; telah mengabarkan kepadaku [Zubaid], [Abu Sa'id Al Khudri] menemui keluarganya lalu mendapati periuk (yang bisa memuat sepuluh orang) yang berisi daging hewan kurban, dan dia menolak memakannya. Selanjutnya dia menemui [Qatadah bin Nu'man], lalu dia mengabarkan kepada (Abu Sa'id Al Khudri), Nabi Shallallahu'alaihiwasallam berdiri pada Hari Haji dan bersabda: \"Aku dahulu memerintahkan kalian untuk tidak memakan sembelihan kurban di atas tiga hari untuk mencukupkan kalian. Sekarang saya halalkan untuk kalian, makanlah kalian terserah kalian. Janganlah kalian menjual daging Hadyu (daging yang disembelih Jamaah Haji waktu pelaksanaan ibadah), tapi makanlah, bersedekahlah dan nikmatilah dengan kulitnya dan jangan kalian menjualnya. Jika kalian diberi makan dengan daging tersebut maka makanlah sekehendak hati kalian.\" (Zubaid) berkata dalam hadits ini, dari [Abu Sa'id] dari Nabi Shallallahu'alaihiwasallam, Namun sekarang makanlah, juallah dan simpanlah kalian. (Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Abu Az-Zubair] dari [Jabir] sebagaimana hadis Zubaid ini, dari Abu Sa'id tidak sampai kepadanya, semuanya hal itu dari Nabi Shallallahu'alaihiwasallam."
            },
            {
                "number": 936,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو قَالَ حَدَّثَنَا زُهَيْرٌ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ شَرِيكٍ يَعْنِي ابْنَ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ تَمِيمٍ عَنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِيهِ وَعَمِّهِ قَتَادَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُوا لُحُومَ الْأَضَاحِيِّ وَادَّخِرُوا",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Abdul Malik bin 'Amr] berkata; telah menceritakan kepada kami [Zuhair] yaitu Ibnu Muhammad dari [Syarik] yaitu Ibnu Abdullah bin Abu Namr Tamim, dari [Abdurrahman bin Abu Sa'id Al Khudri] dari [Bapaknya] dan [pamannya, Qatadah] Rasulullah shallallahu'alaihiwasallam bersabda: \"Makanlah daging kurban dan simpanlah.\""
            },
            {
                "number": 937,
                "arab": "قَالَ حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنَا أَبِي عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ حُسَيْنِ بْنِ جَعْفَرٍ وَأَبِي إِسْحَاقُ بْنُ يَسَارٍ عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ مَوْلَى بَنِي عَدِيِّ بْنِ النَّجَّارِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ نَهَانَا عَنْ أَنْ نَأْكُلَ لُحُومَ نُسُكِنَا فَوْقَ ثَلَاثٍ قَالَ فَخَرَجْتُ فِي سَفَرٍ ثُمَّ قَدِمْتُ عَلَى أَهْلِي وَذَلِكَ بَعْدَ الْأَضْحَى بِأَيَّامٍ قَالَ فَأَتَتْنِي صَاحِبَتِي بِسَاقٍ قَدْ جَعَلَتْ فِيهِ قَدِيدًا فَقُلْتُ لَهَا أَنَّى لَكِ هَذَا الْقَدِيدُ فَقَالَتْ مِنْ ضَحَايَانَا قَالَ فَقُلْتُ لَهَا أَوَلَمْ يَنْهَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَنْ نَأْكُلَهَا فَوْقَ ثَلَاثٍ قَالَ فَقَالَتْ إِنَّهُ قَدْ رَخَّصَ لِلنَّاسِ بَعْدَ ذَلِكَ قَالَ فَلَمْ أُصَدِّقْهَا حَتَّى بَعَثْتُ إِلَى أَخِي قَتَادَةَ بْنِ النُّعْمَانِ وَكَانَ بَدْرِيًّا أَسْأَلُهُ عَنْ ذَلِكَ قَالَ فَبَعَثَ إِلَيَّ أَنْ كُلْ طَعَامَكَ فَقَدْ صَدَقَتْ قَدْ أَرْخَصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْمُسْلِمِينَ فِي ذَلِكَ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Ya'qub] berkata; telah menceritakan kepada kami [bapakku] dari [Muhammad bin Ishaq] berkata; telah menceritakan kepadaku [Muhammad bin 'Ali bin Husain bin Ja'far] dan [bapakku, Ishaq bin Yasar] dari [Abdullah bin Khabbab] budak bani 'Adi bin An Najar, dari [Abu Sa'id Al Khudri] berkata; Rasulullah shallallahu'alaihiwasallam melarang kami memakan daging kurban lebih dari tiga hari. (Abu Sa'id Al Khudri) berkata; lalu saya keluar untuk suatu perjalanan dan saya datangi keluargaku dan itu terjadi beberapa hari setelah hari kurban. Lalu [salah satu sahabat perempuanku] datang dengan membawa satu tempat yang berisi daging yang diawetkan, saya bertanya kepadanya 'Dari mana daging ini? ' Dia menjawab 'Dari daging kurban kami.' Saya bertanya, bukankan Rasulullah shallallahu'alaihiwasallam melarang untuk memakannya lebih dari tiga hari?. Dia menjawan 'Sungguh (Rasulullah shallallahu'alaihiwasallam) telah memberi keringanan kepada orang-orang setelah itu. Saya tidak langsung mempercayai sampai saya mengirim seorang utusan kepada saudaraku, [Qatadah bin An Nu'man], dia adalah seorang veteran perang Badar, saya bertanya kepadanya mengenai hal itu. Lalu dia mengirim utusan kepadaku agar saya memakan makanan itu, dan (wanita tersebut) adalah benar, Rasulullah shallallahu'alaihiwasallam telah memberi keringanan bagi kaum muslimin mengenai hal itu."
            },
            {
                "number": 938,
                "arab": "قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ رِفَاعَةَ الْجُهَنِيِّ قَالَأَقْبَلْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا كُنَّا بِالْكَدِيدِ أَوْ قَالَ بِقُدَيْدٍ فَجَعَلَ رِجَالٌ مِنَّا يَسْتَأْذِنُونَ إِلَى أَهْلِيهِمْ فَيَأْذَنُ لَهُمْ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ مَا بَالُ رِجَالٍ يَكُونُ شِقُّ الشَّجَرَةِ الَّتِي تَلِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبْغَضَ إِلَيْهِمْ مِنْ الشِّقِّ الْآخَرِ فَلَمْ نَرَ عِنْدَ ذَلِكَ مِنْ الْقَوْمِ إِلَّا بَاكِيًا فَقَالَ رَجُلٌ إِنَّ الَّذِي يَسْتَأْذِنُكَ بَعْدَ هَذَا لَسَفِيهٌ فَحَمِدَ اللَّهَ وَقَالَ حِينَئِذٍ أَشْهَدُ عِنْدَ اللَّهِ لَا يَمُوتُ عَبْدٌ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ صِدْقًا مِنْ قَلْبِهِ ثُمَّ يُسَدِّدُ إِلَّا سُلِكَ فِي الْجَنَّةِ قَالَ وَقَدْ وَعَدَنِي رَبِّي عَزَّ وَجَلَّ أَنْ يُدْخِلَ مِنْ أُمَّتِي سَبْعِينَ أَلْفًا لَا حِسَابَ عَلَيْهِمْ وَلَا عَذَابَ وَإِنِّي لَأَرْجُو أَنْ لَا يَدْخُلُوهَا حَتَّى تَبَوَّءُوا أَنْتُمْ وَمَنْ صَلَحَ مِنْ آبَائِكُمْ وَأَزْوَاجِكُمْ وَذُرِّيَّاتِكُمْ مَسَاكِنَ فِي الْجَنَّةِ وَقَالَ إِذَا مَضَى نِصْفُ اللَّيْلِ أَوْ قَالَ ثُلُثَا اللَّيْلِ يَنْزِلُ اللَّهُ عَزَّ وَجَلَّ إِلَى السَّمَاءِ الدُّنْيَا فَيَقُولُ لَا أَسْأَلُ عَنْ عِبَادِي أَحَدًا غَيْرِي مَنْ ذَا يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ مَنْ الَّذِي يَدْعُونِي أَسْتَجِيبُ لَهُ مَنْ ذَا الَّذِي يَسْأَلُنِي أُعْطِيهِ حَتَّى يَنْفَجِرَ الصُّبْحُقَالَ حَدَّثَنَا أَبُو الْمُغِيرَةِ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ رِفَاعَةَ بْنِ عَرَابَةَ الْجُهَنِيِّ قَالَ صَدَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ مَكَّةَ فَجَعَلَ النَّاسُ يَسْتَأْذِنُونَهُ فَذَكَرَ الْحَدِيثَ قَالَ وَقَالَ أَبُو بَكْرٍ إِنَّ الَّذِي يَسْتَأْذِنُكَ بَعْدَ هَذِهِ لَسَفِيهٌ فِي نَفْسِي ثُمَّ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَمِدَ اللَّهَ وَقَالَ خَيْرًا ثُمَّ قَالَ أَشْهَدُ عِنْدَ اللَّهِ وَكَانَ إِذَا حَلَفَ قَالَ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ مَا مِنْ عَبْدٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ ثُمَّ يُسَدِّدُ إِلَّا سُلِكَ فِي الْجَنَّةِ فَذَكَرَ الْحَدِيثَ حَدَّثَنَا حَسَنُ بْنُ مُوسَى قَالَ حَدَّثَنَا شَيْبَانُ عَنْ يَحْيَى يَعْنِي ابْنَ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي هِلَالُ بْنُ أَبِي مَيْمُونَةَ رَجُلٌ مِنْ أَهْلِ الْمَدِينَةِ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ رِفَاعَةَ بْنِ عَرَابَةَ الْجُهَنِيِّ قَالَ أَقْبَلْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا كُنَّا بِالْكَدِيدِ أَوْ قَالَ بِعَرَفَةَ فَذَكَرَ الْحَدِيثَ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Isma'il bin Ibrahim] berkata; telah menceritakan kepada kami [Hisyam Ad-Dastuwani] dari [Yahya bin Abu Katsir] dari [Hilal bin Abu Maimunah] dari ['Atha' bin Yasar] dari [Rifa'ah Al Juhanny] berkata; kami bersama Rasulullah shallallahu'alaihiwasallam sampai di Kadid -dengan huruf kaf diawAl atau di Qadid -dengan huruf qaf diawAl, lalu sebagian orang di antara kami meninggalkan Rasulullah dengan meminta ijin untuk menemui keluarganya. (Rasulullah shallallahu'alaihiwasallam) pun mengijinkannya. Rasulullah shallallahu'alaihiwasallam bangkit, memuji Allah lalu bersabda: \"Bagaimana keadaan suatu kaum yang bagian sisi pohonnya yang dekat Rasulullah shallallahu'alaihiwasallam lebih mereka benci daripada sisi yang lain?\", lalu kami tidak kami melihat keadaan orang-orang selain dalam keadaan menangis. Lalu ada seorang laki-laki yang berkata 'Orang yang meminta ijin kepada anda setelah ini betul-betul orang yang tolol, dia memuji Allah, lalu (Rasulullah shallallahu'alaihiwasallam) saat itu juga bersabda: \"Saya bersaksi di sisi Allah, tidaklah seorang hamba pun yang meninggal, yang bersaksi bahwa tidak ada tuhan selain Allah dan saya adalah utusan Allah, dengan tulus dari hatinya, kemudian dia berbuat benar kecuali dia pasti masuk surga.\" (Rasulullah shallallahu'alaihiwasallam) bersabda kembali, \"Sungguh Rabbku AzzaWaJalla menjanjikan kepadaku untuk memasukkan dari kalangan umatku sebanyak tujuh puluh ribu orang yang masuk surga tanpa hisab dan siksa. Namun saya berharap agar mereka tidak memasukinya sampai kalian menempati tempat-tempat di surga, juga bapak-bapak kalian yang shalih, istri-istri kalian dan keluarga kalian.\" Lalu beliau bersabda: \"Jika telah lewat pertengahan malam\", atau, \"Dua pertiga malam, Allah AzzaWaJalla turun ke langit dunia, lalu berfirman, 'Aku tidak mungkin meminta kepada seorang pun dari hamba-Ku selain diri-Ku sendiri, dan siapakah yang meminta ampun kepada-Ku lantas Aku ampuni? siapakah yang mau berdo'a kepada-Ku lantas Aku kabulkan?, siapakah yang meminta kepada-Ku lantas Aku beri?\", Dan hal ini terus berlaku sampai pagi hari. (Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Abu Al Mughirah] berkata; telah menceritakan kepada kami [Al Auza'i] berkata; telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Hilal bin Abu Maimunah] dari ['Atha' bin Yasar] dari [Rifa'ah bin 'Arabah Al Juhanny] berkata; kami tiba bersama Rasulullah shallallahu'alaihiwasallam dari Makkah, lalu banyak orang yang meminta ijin kepada beliau, lalu ia sebutkan hadis secara lengkap. (Rifa'ah bin 'Arabah Al Juhanny) berkata; Abu Bakar berkata; orang yang meminta ijin kepada anda setelah itu adalah orang yang sangat tolol menurutku, lalu Nabi Shallallahu'alaihiwasallam memuji Allah dan berkata tentang kebaikan, lalu bersabda: \"Saya bersaksi di sisi Allah\" dan beliau jika bersumpah, biasa dengan lafadz, \"Demi yang jiwa Muhammad berada di tangAn Nya, tidaklah seorang hamba beriman kepada Allah dan hari Kiamat lalu berbuat baik, kecuali dia sedang menuju ke surga, lalu ia sebutkan hadis secara lengkap. Telah menceritakan kepada kami [Hasan bin Musa] berkata; telah menceritakan kepada kami [Syaiban] dari [Yahya] yaitu Ibnu Abu Katsir, berkata; telah menceritakan kepadaku [Hilal bin Abu Maimunah] seorang laki-laki dari Madinah, dari ['Atha' bin Yasar] dari [Rifa'ah bin 'Arabah Al Juhanny] berkata; kami berangkat bersama Rasulullah shallallahu'alaihiwasallam, lalu ketika kami sampai di daerah Kadid atau berkata; di Arafah, lalu ia sebutkan hadis secara lengkap."
            },
            {
                "number": 939,
                "arab": "قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا هِشَامٌ يَعْنِي الدَّسْتُوَائِيَّ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ قَالَ حَدَّثَنَا عَطَاءُ بْنُ يَسَارٍ أَنَّ رِفَاعَةَ الْجُهَنِيَّ حَدَّثَهُ قَالَأَقْبَلْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا كُنَّا بِالْكَدِيدِ أَوْ قَالَ بِقُدَيْدٍ جَعَلَ رِجَالٌ يَسْتَأْذِنُونَ إِلَى أَهْلِيهِمْ فَيُؤْذَنُ لَهُمْ قَالَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَقَالَ خَيْرًا وَقَالَ أَشْهَدُ عِنْدَ اللَّهِ لَا يَمُوتُ عَبْدٌ شَهِدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ صَادِقًا مِنْ قَلْبِهِ ثُمَّ يُسَدِّدُ إِلَّا سُلِكَ فِي الْجَنَّةِ ثُمَّ قَالَ وَعَدَنِي رَبِّي أَنْ يُدْخِلَ مِنْ أُمَّتِي سَبْعِينَ أَلْفًا بِغَيْرِ حِسَابٍ وَإِنِّي لَأَرْجُو أَنْ لَا يَدْخُلُوهَا حَتَّى تَبَوَّءُوا أَنْتُمْ وَمَنْ صَلَحَ مِنْ أَزْوَاجِكُمْ وَذَرَارِيِّكُمْ مَسَاكِنَ فِي الْجَنَّةِ وَقَالَ إِذَا مَضَى نِصْفُ اللَّيْلِ أَوْ ثُلُثُ اللَّيْلِ يَنْزِلُ اللَّهُ عَزَّ وَجَلَّ إِلَى السَّمَاءِ الدُّنْيَا فَيَقُولُ لَا أَسْأَلُ عَنْ عِبَادِي أَحَدًا غَيْرِي مَنْ ذَا الَّذِي يَسْتَغْفِرُنِي أَغْفِرُ لَهُ مَنْ ذَا الَّذِي يَدْعُونِي فَأَسْتَجِيبَ لَهُ مَنْ ذَا الَّذِي يَسْأَلُنِي فَأُعْطِيَهُ حَتَّى يَنْفَجِرَ الصُّبْحُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] berkata; telah menceritakan kepada kami [Hisyam] yaitu ad-dastuwa'i, berkata; telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Hilal bin Abu Maimunah] berkata; telah menceritakan kepada kami ['Atha' bin Yasar] [Rifa'ah Al Juhanny] menceritakannya berkata; kami berjalan bersama Rasulullah shallallahu'alaihiwasallam sampai di Kadid, atau Qadid. Orang-orang banyak yang meminta ijin untuk menemui keluarga mereka, dan beliau pun mengijinkan mereka. (Rifa'ah Al Juhanny) berkata; lalu (Rasulullah shallallahu'alaihiwasallam) memuji Allah dan melontarkan ucapAn ucapan kebaikan dan bersabda: \"Saya bersaksi di sisi Allah, tidaklah seorang hamba meninggal dengan bersaksi bahwa tidak ada sesembahan yang hak selain Allah dan Muhammad adalah utusan Allah secara tulus dari hatinya, kemudian ia berusaha menepati ucapannya kecuali dia dibimbing menuju surga\", lalu bersabda: \"Dan Rabbiku telah menjanjikan kepadaku untuk memasukkan dari kalangan umatku sebanyak tujuh puluh ribu orang tanpa hisab dan siksa. Saya berharap agar mereka tidak memasukinya sampai kalian menyinggahi tempat-tempat kalian di surga, dan juga istri-istri kalian dan keluarga kalian.\" Lalu beliau bersabda: \"Jika telah lewat pertengahan malam\", atau, \"dua pertiga malam, Allah AzzaWaJalla turun ke langit dunia, lalu berfirman, 'Aku tidak bakalan meminta seorangpun dari hamba-Ku selain diri-Ku sendiri, siapa yang mau meminta ampun kepada-Ku sehingga kuampuni?, siapa yang mau berdo'a kepada-Ku sehingga Aku kabulkan?, siapa yang meminta kepada-Ku sehingga aku beri?\", Dan itu berlaku sampai pagi hari."
            },
            {
                "number": 940,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ قَالَ حَدَّثَنِي أَبُو سَلَمَةَعَنْ الرَّجُلِ الَّذِي مَرَّ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُنَاجِي جِبْرِيلَ عَلَيْهِ السَّلَام فَزَعَمَ أَبُو سَلَمَةَ أَنَّهُ تَجَنَّبَ أَنْ يَدْنُوَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَخَوُّفًا أَنْ يَسْمَعَ حَدِيثَهُ فَلَمَّا أَصْبَحَ قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مَنَعَكَ أَنْ تُسَلِّمَ إِذْ مَرَرْتَ بِي الْبَارِحَةَ قَالَ رَأَيْتُكَ تُنَاجِي رَجُلًا فَخَشِيتُ أَنْ تَكْرَهَ أَنْ أَدْنُوَ مِنْكُمَا قَالَ وَهَلْ تَدْرِي مَنْ الرَّجُلُ قَالَ لَا قَالَ فَذَلِكَ جِبْرِيلُ عَلَيْهِ السَّلَام وَلَوْ سَلَّمْتَ لَرَدَّ السَّلَامَوَقَدْ سَمِعْتُ مِنْ غَيْرِ أَبِي سَلَمَةَ أَنَّهُ حَارِثَةَ بْنَ النُّعْمَانِ",
                "id": "Telah menceritakan kepada kami ['Affan] berkata; telah menceritakan kepada kami [Wuhaib] berkata; telah menceritakan kepada kami [Musa Bin 'Uqbah] berkata; telah menceritakan kepadaku [Abu Salamah] dari [seorang laki-laki yang melewati Rasulullah shallallahu'alaihiwasallam] yang ketika itu beliau sedang bercakap-cakap dengan Jibril Alaihissalam. Abu Salamah beranggapan orang itu menjauh dari mendekati Rasulullah shallallahu'alaihiwasallam karena khawatir jangAn jangan mendengar percakapan nabi. Ketika pagi tiba, Rasulullah shallallahu'alaihiwasallam bertanya, \"Apa yang yang membuat kamu tidak mengucapkan salam ketika kamu melewatiku tadi malam? (Sahabat tadi) menjawab 'Saya melihat anda sedang bercakap-cakap dengan seorang laki-laki, sehingga saya khawatir jangAn jangan anda keberatan jika saya mendekati anda berdua. (Rasulullah shallallahu'alaihiwasallam) bersabda: \"Apakah engkau mengetahui siapa laki-laki tersebut?\" (Sahabat tadi) menjawab, \"Tidak\" (Rasulullah shallallahu'alaihiwasallam) bersabda: \"Dialah Jibril 'Alaihissalam, kalau saja engkau mengucapkan salam, pastilah dia menjawabnya.\" (Musa bin 'Uqbah) berkata 'Saya mendengarnya selain dari Abi Salamah yaitu dari [Haritsah bin An Nu'man].'"
            },
            {
                "number": 941,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ أَبَا مَالِكٍ الْأَشْجَعِيَّ يُحَدِّثُ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالَ أَخْبَرَنِي مَنْرَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي ثَوْبٍ قَدْ خَالَفَ بَيْنَ طَرَفَيْهِ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] berkata; saya mendengar [Abu Malik Al Asyja'i] menceritakan dari [Abu Salamah bin Abdurrahman] berkata; telah mengabarkan kepadaku [orang yang telah melihat Nabi Shallallahu'alaihiwasallam] sholat dengan memakai satu kain dengan mengikatkan ke dua ujungnya."
            },
            {
                "number": 942,
                "arab": "قَالَ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ زَمْعَةَ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ النِّسَاءَ فَوَعَظَ فِيهِنَّ وَقَالَ عَلَامَ يَضْرِبُ أَحَدُكُمْ امْرَأَتَهُ وَلَعَلَّهُ أَنْ يُضَاجِعَهَا مِنْ آخِرِ النَّهَارِ أَوْ آخِرِ اللَّيْلِ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Waki'] dari [Hisyam] dari [Bapaknya] dari [Abdullah bin Zam'ah] berkata Aku mendengar Nabi Shallallahu'alaihiwasallam menyebut-nyebut kaum perempuan dan menasehati sahabatnya tentang para isteri seraya bersabda: \"Atas dasar apa salah seorang di antara kalian memukul isterinya padahal siapa tahu dia menidurinya di waktu sorenya atau di akhir malamnya bukan?\""
            },
            {
                "number": 943,
                "arab": "قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ زَمْعَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ{ إِذْ انْبَعَثَ أَشْقَاهَا }انْبَعَثَ لَهَا رَجُلٌ عَارِمٌ عَزِيزٌ مَنِيعٌ فِي رَهْطِهِ مِثْلُ أَبِي زَمْعَةَ ثُمَّ وَعَظَهُمْ فِي الضَّحِكِ مِنْ الضَّرْطَةِ فَقَالَ إِلَى مَا يَضْحَكُ أَحَدُكُمْ مِمَّا يَفْعَلُ قَالَ ثُمَّ قَالَ إِلَى مَا يَجْلِدُ أَحَدُكُمْ امْرَأَتَهُ جَلْدَ الْعَبْدِ ثُمَّ لَعَلَّهُ أَنْ يُضَاجِعَهَا مِنْ آخِرِ يَوْمِهِ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Abu Mu'awiyah] berkata; telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [Bapaknya] dari [Abdullah bin Zam'ah] berkata; Rasulullah shallallahu'alaihiwasallam bersabda mengomentari ayat 'Ketika bangkit orang yang paling celaka di antara mereka' maka bangkitlah seorang laki-laki yang kasar, bangsawan, dan pelit di kalangan kaumnya seperti Abu Zam'ah, lalu nabi menasehati mereka perihal tertawa karena kentut. Lalu beliau bersabda: \"Atas dasar apa salah seorang diantara kalian tertawa karena kentut?\" (Abdullah bin Zam'ah) berkata; lalu beliau bersabda: \"Atas dasar apa salah seorang di antara kalian mencambuk istrinya sebagaimana mencambuk budak, yang bisa jadi pada sore harinya dia menggaulinya?.\""
            },
            {
                "number": 944,
                "arab": "قَالَ حَدَّثَنَا ابْنُ نُمَيْرٍ قَالَ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ زَمْعَةَ قَالَخَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ النَّاقَةَ وَذَكَرَ الَّذِي عَقَرَهَا فَقَالَ{ إِذْ انْبَعَثَ أَشْقَاهَا }انْبَعَثَ لَهَا رَجُلٌ عَارِمٌ عَزِيزٌ مَنِيعٌ فِي رَهْطِهِ مِثْلُ أَبِي زَمْعَةَ ثُمَّ ذَكَرَ النِّسَاءَ فَوَعَظَهُمْ فِيهِنَّ فَقَالَ عَلَامَ يَجْلِدُ أَحَدُكُمْ امْرَأَتَهُ جَلْدَ الْعَبْدِ وَلَعَلَّهُ يُضَاجِعُهَا مِنْ آخِرِ يَوْمِهِ ثُمَّ وَعَظَهُمْ فِي ضَحِكِهِمْ مِنْ الضَّرْطَةِ فَقَالَ عَلَامَ يَضْحَكُ أَحَدُكُمْ عَلَى مَا يَفْعَلُ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Ibnu Numair] berkata; telah menceritakan kepada kami [Hisyam] dari [Bapaknya] dari [Abdullah bin Zam'ah] berkata; Rasulullah shallallahu'alaihiwasallam berkhutbah lalu menyebut-nyebut 'Unta' dan menyebut-nyebut unta yang kaum Tsamud sembelih. Beliau bersabda mengomentari ayat 'Ketika bangkit orang yang paling celaka di antara mereka', Maka bangkitlah seorang yang kasar dan jelek, bangsawan, orang yang pelit di kalangan kaumnya seperti Abu Zam'ah, kemudian beliau menyebut-nyebut wanita dan menasehati (kaum laki-laki) tentang kaum wanita. Lalu beliau bersabda: \"Atas dasar apa salah seorang di antara kalian mencambuk istrinya sebagaimana mencambuk budak bisa jadi padahal bisa jadi pada sore harinya dia menggaulinya?.\" Lalu beliau menasehati mereka tentang tertawa mereka karena kentut, beliau bersabda: \"Atas dasar apa kalian mentertawakannya?.\""
            },
            {
                "number": 945,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ زَمْعَةَوَعَظَهُمْ فِي النِّسَاءِ وَقَالَ عَلَامَ يَضْرِبُ أَحَدُكُمْ امْرَأَتَهُ ضَرْبَ الْعَبْدِ ثُمَّ يُضَاجِعُهَا مِنْ آخِرِ اللَّيْلِ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Hisyam] dari [Bapaknya] dari [Abdullah bin Zam'ah] dia menasehati mereka dalam masalah wanita dan berkata; atas dasar apa salah seorang diantara kalian memukul istrinya sebagaimana memukul budak lalu menggaulinya pada akhir malam?."
            },
            {
                "number": 946,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا هِشَامٌ عَنْ حَفْصَةَ عَنِ الرَّبَابِ الضَّبِّيَّةِ عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ أَنَّهُ قَالَإِذَا أَفْطَرَ أَحَدُكُمْ فَلْيُفْطِرْ عَلَى تَمْرٍ فَإِنْ لَمْ يَجِدْ فَلْيُفْطِرْ عَلَى الْمَاءِ فَإِنَّ الْمَاءَ طَهُورٌقَالَ هِشَامٌ وَحَدَّثَنِي عَاصِمٌ الْأَحْوَلُ أَنَّ حَفْصَةَ رَفَعَتْهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] Berkata; telah menceritakan kepada kami [Hisyam] dari [Hafshah] dari [Ar-Rabab Adl-Dlabbiyah] dari [Salman bin 'Amir Adz-Dlabby] dia berkata; Jika di antara kalian berbuka, berbukalah dengan kurma, kalaulah tidak ada, maka berbukalah dengan air, karena air itu suci. [Hisyam] berkata; dan telah menceritakan kepadaku ['Ashim Al Ahwal] [Hafshah] memarfukkannya kepada Nabi Shallallahu'alaihiwasallam."
            },
            {
                "number": 947,
                "arab": "قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَاصِمٍ عَنْ حَفْصَةَ عَنِ الرَّبَابِ عَنْ عَمِّهَا سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَلْيُفْطِرْ عَلَى تَمْرٍ فَإِنْ لَمْ يَجِدْ فَلْيُفْطِرْ عَلَى مَاءٍ فَإِنَّهُ طَهُورٌ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Ashim] dari [Hafshah] dari [Ar-Rabab] dari [pamannya, Salman bin 'Amir Adz-Dlabby] dari Nabi Shallallahu'alaihiwasallam bersabda: \"Hendaklah berbuka dengan kurma, jika dia tidak mendapatkannya, maka berbukalah dengan air karena air itu suci.\""
            },
            {
                "number": 948,
                "arab": "وَمَعَ الْغُلَامِ عَقِيقَتُهُ فَأَمِيطُوا عَنْهُ الْأَذَى وَأَرِيقُوا عَنْهُ دَمًا وَالصَّدَقَةُ عَلَى ذِي الْقَرَابَةِ ثِنْتَانِ صَدَقَةٌ وَصِلَةٌ",
                "id": "MaAsih melalui jalur periwayatan yang sama seperti hadits sebelumnya dari [Salman bin Amir]; Dan, \"Kelahiran seorang anak itu harus disertai aqiqah, Hilangkan gangguannya (maksudnya cukurlah rambutnya) dan alirkanlah darah (sembelihlah hewan). Dan bersedekah kepada kerabat dekat mendapatkan dua pahala sekaligus, pahala sedekah dan pahala silaturrahim.\""
            },
            {
                "number": 949,
                "arab": "قَالَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ حَفْصَةَ عَنِ الرَّبَابِ أُمِّ الرَّائِحِ ابْنَةِ صُلَيْعٍ عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَفْطَرَ أَحَدُكُمْ فَلْيُفْطِرْ عَلَى تَمْرٍ فَإِنْ لَمْ يَجِدْ فَلْيُفْطِرْ عَلَى مَاءٍ فَإِنَّهُ طَهُورٌ",
                "id": "(Abdullah bin Ahmad) berkata; (Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Waki'] berkata; telah menceritakan kepada kami [Sufyan] dari ['Ashim Al Ahwal] dari [Hafshah] dari [Ar-Rabab], Ummu Ar-Ra`ihah binti Shulaih dari [Salman bin 'Amir Adz-Dlabby] berkata; Rasulullah shallallahu'alaihiwasallam bersabda: \"Jika salah seorang dari kalian berbuka hendaklah dengan kurma, jika dia tidak mendapatkannya maka berbukalah dengan air karena air itu suci.\""
            },
            {
                "number": 950,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَابْنُ نُمَيْرٍ قَالَا حَدَّثَنَا هِشَامٌ وَيَزِيدُ قَالَ أَخْبَرَنَا هِشَامٌ عَنْ حَفْصَةَ ابْنَةِ سِيرِينَ عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ابْنُ نُمَيْرٍ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ يَزِيدُ بْنُ هَارُونَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَعَ الْغُلَامِ عَقِيقَتُهُ فَأَهْرِيقُوا عَنْهُ دَمًا وَأَمِيطُوا عَنْهُ الْأَذَى",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] dan [Ibnu Numair] berkata; telah menceritakan kepada kami [Hisyam] dan [Yazid] berkata; telah menghabarkan kepada kami [Hisyam] dari [Hafshah binti Sirin] dari [Salman bin 'Amir Adz-Dlabby] Nabi Shallallahu'alaihiwasallam bersabda: Adapun Ibnu Numair dia telah mendengar Rasulullah shallallahu'alaihiwasallam. Yazid bin Harun berkata; saya mendengar Rasulullah shallallahu'alaihiwasallam bersabda: \"Anak yang lahir harus disertai aqiqahnya\", beliau bersabda: \"Alirkanlah darah (sembelihlah kambing) dan hilangkanlah gangguannya?\""
            },
            {
                "number": 951,
                "arab": "قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا عَاصِمٌ عَنْ حَفْصَةَ عَنِ الرَّبَابِ عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَفْطَرَ أَحَدُكُمْ فَلْيُفْطِرْ عَلَى تَمْرٍ فَإِنْ لَمْ يَجِدْ فَلْيُفْطِرْ عَلَى مَاءٍ فَإِنَّهُ طَهُورٌ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Abu Mu'awiyah] berkata; telah menceritakan kepada kami ['Ashim] dari [Hafshah] dari [Ar-Rabab] dari [Salman bin 'Amir Adz-Dlabby] berkata; Rasulullah shallallahu'alaihiwasallam bersabda: \"Jika salah seorang dari kalian berbuka hendaklah dengan kurma, jika dia tidak mendapatkannya maka berbukalah dengan air karena air itu suci.\""
            },
            {
                "number": 952,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا هِشَامٌ عَنْ حَفْصَةَ ابْنَةِ سِيرِينَ عَنِ الرَّبَابِ عَنْ سَلْمَانَ بْنِ عَامِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَفْطَرَ أَحَدُكُمْ فَلْيُفْطِرْ عَلَى تَمْرٍ فَإِنْ لَمْ يَجِدْ فَلْيُفْطِرْ بِمَاءٍ فَإِنَّ الْمَاءَ طَهُورٌ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Abdurrazzaq] berkata; telah menghabarkan kepada kami [Hisyam] dari [Hafshah binti Sirin] dari [Ar-Rabab] dari [Salman bin 'Amir Adz-Dlabby] berkata; Rasulullah shallallahu'alaihiwasallam bersabda: \"Jika salah seorang dari kalian berbuka hendaklah dengan kurma, jika dia tidak mendapatkannya maka berbukalah dengan air. Sesungguhnya air itu suci.\""
            },
            {
                "number": 953,
                "arab": "وَقَالَمَعَ الْغُلَامِ عَقِيقَتُهُ فَأَهْرِيقُوا عَنْهُ دَمًا وَأَمِيطُوا عَنْهُ الْأَذَى",
                "id": "Masih melalui jalur periwayatan yang sama seperti hadits sebelumnya, dari [Salman bin Amir]; dan beliau bersabda: \"Anak yang baru lahir harus disertai aqiqahnya, Alirkanlah darah (lakukan penyembelihan) dan hilangkanlah gangguannya.\""
            },
            {
                "number": 954,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا هِشَامٌ عَنْ حَفْصَةَ عَنْ سَلْمَانَ بْنِ عَامِرٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الصَّدَقَةُ عَلَى الْمِسْكِينِ صَدَقَةٌ وَالصَّدَقَةُ عَلَى ذِي الرَّحِمِ اثْنَتَانِ صَدَقَةٌ وَصِلَةٌ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata; telah menghabarkan kepada kami [Hisyam] dari [Hafshah] dari [Salman bin 'Amir Adz-Dlabby] berkata; saya mendengar Rasulullah shallallahu'alaihiwasallam bersabda: \"Sedekah bagi kaum miskin mendapat pahala sedekah, adapun sedekah untuk kerabat dekat mendatangkan dua pahala, pahala sedekah dan pahala menyambung tali kerabat.\""
            },
            {
                "number": 955,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامٍ قَالَ حَدَّثَتْنِي حَفْصَةُ عَنْ سَلْمَانَ بْنِ عَامِرٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَعَ الْغُلَامِ عَقِيقَتُهُ فَأَهْرِيقُوا عَنْهُ دَمًا وَأَمِيطُوا عَنْهُ الْأَذَى",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Hisyam] berkata; telah menceritakan kepadaku [Hafshah] dari [Salman bin 'Amir] berkata; saya mendengar Rasulullah shallallahu'alaihiwasallam bersabda: \"Anak yang baru lahir harus disertai aqiqahnya, alirkanlah darahnya dan singkirkanlah gangguannya.\""
            },
            {
                "number": 956,
                "arab": "قَالَ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ قَالَ حَدَّثَنَا أَبُو خَيْثَمَةَ عَنْ عُرْوَةَ بْنِ عَبْدِ اللَّهِ بْنِ قُشَيْرٍ الْجُعْفِيِّ قَالَ حَدَّثَنِي مُعَاوِيَةُ بْنُ قُرَّةَ عَنْ أَبِيهِ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَهْطٍ مِنْ مُزَيْنَةَ فَبَايَعْنَا وَإِنَّ قَمِيصَهُ لَمُطْلَقٌ فَبَايَعْتُهُ فَأَدْخَلْتُ يَدِي مِنْ جَيْبِ الْقَمِيصِ فَمَسِسْتُ الْخَاتَمَقَالَ عُرْوَةُ فَمَا رَأَيْتُ مُعَاوِيَةَ وَلَا أَبَاهُ شِتَاءً وَلَا حَرًّا إِلَّا مُطْلِقَيْ أَزْرَارِهِمَا لَا يَزُرَّانِ أَبَدًا",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Hasyim bin Al Qasim] berkata; telah menceritakan kepada kami [Abu Khatsmah] dari ['Urwah bin Abdullah bin Qusyair Al ju'fy] telah menceritakan kepadaku [Mu'awiyah bin Qurrah] dari [bapaknya] berkata; Aku menemui Rasulullah shallallahu'alaihiwasallam dalam rombongan dari Muzainah, lalu kami berbaiat kepadanya dan gamisnya diselempangkan begitu saja (tidak dikancing), lantas aku berbaiat kepadanya, lalu kumasukkan tanganku ke dalam kantong gamis, dan kusentuh cincinnya\" 'Urwah berkata; \"Di hari-hari selanjutnya aku tidak pernah melihat Mu'awiyah dan juga ayahnya, baik di musim dingin maupun musim panas selain melepas kancing bajunya dan tidak mengancingkannya.\""
            },
            {
                "number": 957,
                "arab": "قَالَ حَدَّثَنَا سُلَيْمَانُ حَدَّثَنَا رَوْحٌ قَالَ حَدَّثَنَا بِسْطَامُ بْنُ مُسْلِمٍ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ قَالَ قَالَ أَبِيلَقَدْ عَمَّرْنَا مَعَ نَبِيِّنَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا لَنَا طَعَامٌ إِلَّا الْأَسْوَدَانِثُمَّ قَالَ هَلْ تَدْرِي مَا الْأَسْوَدَانِ قُلْتُ لَا قَالَ التَّمْرُ وَالْمَاءُ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Sulaiman] telah menceritakan kepada kami [Rouh] berkata; telah menceritakan kepada kami [Bistham bin Muslim] dari [Muawiyah bin Qurrah] berkata [bapakku] berkata; kami pernah berumrah bersama Nabi kita Shallallahu'alaihiwasallam dan tidak tersisa makanan bagi kami kecuali hanyalah Al Aswadan (dua benda hitam) kemudian (Rasulullah shallallahu'alaihiwasallam) bertanya, Apakah kalian tahu maksud dua benda hitam? Saya menjawab, Tidak. beliau berkata; \"Kurma dan air.\""
            },
            {
                "number": 958,
                "arab": "قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَبِيهِ أَنَّهُأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ كَانَ حَلَبَ وَصَرَّقَالَ حَدَّثَنَا سُلَيْمَانُ عَنْ شُعْبَةَ عَنْ مُعَاوِيَةَ قَالَ كَانَ أَبِي حَدَّثَنَا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَا أَدْرِي أَسَمِعَهُ مِنْهُ أَوْ حُدِّثَ عَنْهُ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Sulaiman bin Daud] berkata; telah menceritakan kepada kami [Syu'bah] dari [Muawiyah bin Qurrah] dari [Bapaknya] dia menemui Nabi Shallallahu'alaihiwasallam ternyata beliau baru saja memeras dan mengikat. (Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Sulaiman] dari [Syu'bah] dari [Mu'awiyah] berkata; [bapakku] telah menceritakan kepada kami dari Nabi Shallallahu'alaihiwasallam, saya tidak tahu apakah dia mendengarnya dari beliau atau diceritakan dari beliau."
            },
            {
                "number": 959,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو قَالَ حَدَّثَنَا خَالِدُ بْنُ مَيْسَرَةَ حَدَّثَنَا مُعَاوِيَةُ بْنُ قُرَّةَ عَنْ أَبِيهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ هَاتَيْنِ الشَّجَرَتَيْنِ الْخَبِيثَتَيْنِ وَقَالَ مَنْ أَكَلَهُمَا فَلَا يَقْرَبَنَّ مَسْجِدَنَا وَقَالَ إِنْ كُنْتُمْ لَا بُدَّ آكِلِيهِمَا فَأَمِيتُمُوهُمَا طَبْخًا قَالَ يَعْنِي الْبَصَلَ وَالثُّومَ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Abdul Malik bin 'Amr] berkata; telah menceritakan kepada kami [Khalid bin Maisarah] telah menceritakan kepada kami [Muawiyah bin Qurrah] dari [Bapaknya] berkata; Rasulullah shallallahu'alaihiwasallam melarang dua pohon yang buruk, dengan bersabda: \"Barangsiapa yang memakan keduanya, maka janganlah mendekati masjid kami, jika kalian terpaksa untuk memakannya, hilangkanlah baunya dengan memasaknya\" dua pohon itu adalah, \"Bawang merah dan bawang putih.\""
            },
            {
                "number": 960,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مُعَاوِيَةَ أَبِي إِيَاسٍ قَالَ سَمِعْتُ أَبِي وَقَدْ كَانَ أَدْرَكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَفَمَسَحَ رَأْسَهُ وَاسْتَغْفَرَ لَهُ",
                "id": "Telah menceritakan kepada kami [Husain bin Muhammad] berkata; telah menceritakan kepada kami [Syu'bah] dari [Muawiyah, Abu 'Iyash] berkata; saya mendengar [bapakku], dia pernah menjumpai Nabi Shallallahu'alaihiwasallam, dan nabi membasuh kepalanya dan memintakan ampun baginya."
            },
            {
                "number": 961,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي صِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ الشَّهْرِ صَوْمُ الدَّهْرِ وَإِفْطَارُهُ",
                "id": "Telah menceritakan kepada kami ['Affan] berkata; telah menceritakan kepada kami [Syu'bah] dari [Muawiyah bin Qurrah] dari [Bapaknya] dari Nabi Shallallahu'alaihiwasallam, beliau bersabda bahwa puasa tiga hari dalam sebulan bagaikan puasa sepanjang masa dan berbukanya."
            },
            {
                "number": 962,
                "arab": "حَدَّثَنَا حَجَّاجٌ قَالَ حَدَّثَنِي شُعْبَةُ عَنْ أَبِي إِيَاسٍ قَالَجَاءَ أَبِي إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ غُلَامٌ صَغِيرٌ فَمَسَحَ رَأْسَهُ وَاسْتَغْفَرَ لَهُقَالَ شُعْبَةُ قُلْنَا لَهُ صُحْبَةٌ قَالَ لَا وَلَكِنَّهُ كَانَ عَلَى عَهْدِهِ قَدْ حَلَبَ وَصَرَّ",
                "id": "Telah menceritakan kepada kami [Hajjaj] berkata; telah menceritakan kepadaku [Syu'bah] dari [Abu 'Iyas] berkata; bapakku menemui Nabi Shallallahu'alaihiwasallam pada saat masih muda, lalu beliau mengusap kepalanya dan memintakan ampun baginya. Syu'bah berkata; apakah dia bisa di katakan sahabat? (Abu 'Iyas) berkata; tidak tapi pada masa beliau dia telah bisa memeras susu dan mengikat-ikat kayu."
            },
            {
                "number": 963,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ هِشَامِ بْنِ عَامِرٍ الْأَنْصَارِيِّ قَالَلَمَّا كَانَ يَوْمُ أُحُدٍ أَصَابَ النَّاسَ قَرْحٌ وَجَهْدٌ شَدِيدٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْفِرُوا وَأَوْسِعُوا وَادْفِنُوا الِاثْنَيْنِ وَالثَّلَاثَةَ فِي الْقَبْرِ قَالُوا يَا رَسُولَ اللَّهِ مَنْ نُقَدِّمُ قَالَ أَكْثَرَهُمْ جَمْعًا وَأَخْذًا لِلْقُرْآنِ",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Sulaiman bin Al Mughirah] dari [Humaid bin Hilal] dari [Hisyam bin 'Amir Al Anshari] berkata; Pada waktu Perang Uhud, manusia terkena luka-luka dan kepayahan yang sangat, Lalu Rasulullah shallallahu'alaihiwasallam bersabda: \"Galilah lubang dan perluaslah, serta kuburkanlah dua atau tiga orang dalam satu pekuburan\" mereka berkata 'Wahai Rasulullah, siapa yang kita dahulukan? beliau bersabda: \"Yang paling banyak mengumpulkan dan menghafalkan Al qur'an.\""
            },
            {
                "number": 964,
                "arab": "قَالَ حَدَّثَنَا إِسْمَاعِيلُ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ قَالَكَانَ النَّاسُ يَشْتَرُونَ الذَّهَبَ بِالْوَرِقِ نَسِيئَةً إِلَى الْعَطَاءِ فَأَتَى عَلَيْهِمْ هِشَامُ بْنُ عَامِرٍ فَنَهَاهُمْ وَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَانَا أَنْ نَبِيعَ الذَّهَبَ بِالْوَرِقِ نَسِيئَةً وَأَنْبَأَنَا أَوْ قَالَ وَأَخْبَرَنَا أَنَّ ذَلِكَ هُوَ الرِّبَا",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Isma'il] berkata; telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] berkata; orang-orang membeli emas dengan mata uang secara kredit dengan syarat ada penambahan, kemudian hari [Hisyam bin 'Amir] datang kepada mereka, lalu melarang transaksi semacam itu dan berkata; Rasulullah shallallahu'alaihiwasallam melarang kita untuk menjual emas dengan mata uang secara kredit dan bersyarat penambahan, ia beritakan itu adalah riba.\""
            },
            {
                "number": 965,
                "arab": "قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ هِشَامِ بْنِ عَامِرٍ قَالَإِنَّكُمْ لَتَخُطُّونَ إِلَى أَقْوَامٍ مَا هُمْ بِأَعْلَمَ بِحَدِيثِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَّا قُتِلَ أَبِي يَوْمَ أُحُدٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْفِرُوا وَأَوْسِعُوا وَادْفِنُوا الِاثْنَيْنِ وَالثَّلَاثَةَ فِي الْقَبْرِ وَقَدِّمُوا أَكْثَرَهُمْ قُرْآنًاوَكَانَ أَبِي أَكْثَرَهُمْ قُرْآنًا فَقُدِّمَ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Ayyub] dari [Humaid bin Hilal] dari [Hisyam bin 'Amir] berkata; kalian mendatangi suatu kaum yang mereka tidak lebih tahu terhadap hadis Rasulullah shallallahu'alaihiwasallam daripada kita. Bapakku tewas dalam Perang Uhud, lalu Rasulullah shallallahu'alaihiwasallam bersabda: \"Galilah, perluaslah dan dan kuburkanlah dua atau tiga orang dalam satu liang. Dahulukanlah orang yang paling banyak hapalan Al qur'annya\" bapakku adalah termasuk yang paling banyak hapalannya, maka lebih didahulukan."
            },
            {
                "number": 966,
                "arab": "قَالَوَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَاللَّهِ مَا بَيْنَ خَلْقِ آدَمَ إِلَى قِيَامِ السَّاعَةِ أَمْرٌ أَعْظَمُ مِنْ الدَّجَّالِ",
                "id": "[Hisyam bin 'Amir] berkata; saya mendengar Rasulullah shallallahu'alaihiwasallam bersabda: \"Sejak Adam dicipta sampai terjadi Hari Kiamat, tidak ada perkara yang lebih besar daripada Dajjal.\""
            },
            {
                "number": 967,
                "arab": "حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ الرِّشْكِ قَالَ شُعْبَةُ قَرَأْتُهُ عَلَيْهِ قَالَ سَمِعْتُ مُعَاذَةَ الْعَدَوِيَّةَ قَالَتْ سَمِعْتُ هِشَامَ بْنَ عَامِرٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ مُسْلِمًا فَوْقَ ثَلَاثِ لَيَالٍ فَإِنْ كَانَ تَصَارَمَا فَوْقَ ثَلَاثٍ فَإِنَّهُمَا نَاكِبَانِ عَنْ الْحَقِّ مَا دَامَا عَلَى صُرَامِهِمَا وَأَوَّلُهُمَا فَيْئًا فَسَبْقُهُ بِالْفَيْءِ كَفَّارَتُهُ فَإِنْ سَلَّمَ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيْهِ وَرَدَّ عَلَيْهِ سَلَامَهُ رَدَّتْ عَلَيْهِ الْمَلَائِكَةُ وَرَدَّ عَلَى الْآخَرِ الشَّيْطَانُ فَإِنْ مَاتَا عَلَى صُرَامِهِمَا لَمْ يَجْتَمِعَا فِي الْجَنَّةِ أَبَدًا",
                "id": "Telah menceritakan kepada kami [Rauh bin 'Ubadah] berkata; telah menceritakan kepada kami [Syu'bah] dari [Yazid Ar-Risyk]. Syu'bah berkata; saya membacakan di hadapannya, berkata saya mendengar [Mu'adzah Al 'Adawiyah] berkata; saya mendengar [Hisyam bin 'Amir] berkata; saya mendengar Rasulullah shallallahu'alaihiwasallam bersabda: \"Tidak halal bagi seorang muslim untuk mendiamkan saudaranya semuslim lebih dari tiga malam, jika mereka berdua saling mendiamkan lebih dari tiga malam tersebut, keduanya jauh dari kebenaran selama mereka berdua masih mendiamkan. Jika salah satu di antaranya kembali sadar dari rasa marah, maka sadarnya tersebut sebagai penebus dosanya. Jika si 'A' memberi salam terhadap temannya si 'B' namun tidak diterima, padahal si 'A' masih mau menjawab salamnya, maka si 'A' akan dijawab oleh Malaikat, dan si 'B' yang mendiamkan akan dijawab oleh setan. Jika mereka berdua meninggal dalam keadaan saling mendiamkan, maka mereka berdua tidak akan berkumpul di surga selama-lamanya.\""
            },
            {
                "number": 968,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ الرِّشْكِ عَنْ مُعَاذَةَ عَنْ هِشَامِ بْنِ عَامِرٍ أَنَّهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ مُسْلِمًا فَوْقَ ثَلَاثِ لَيَالٍ فَإِنَّهُمَا نَاكِبَانِ عَنْ الْحَقِّ مَا دَامَا عَلَى صُرَامِهِمَا وَأَوَّلُهُمَا فَيْئًا يَكُونُ سَبْقُهُ بِالْفَيْءِ كَفَّارَةً لَهُ وَإِنْ سَلَّمَ فَلَمْ يَقْبَلْ وَرَدَّ عَلَيْهِ سَلَامَهُ رَدَّتْ عَلَيْهِ الْمَلَائِكَةُ وَرَدَّ عَلَى الْآخَرِ الشَّيْطَانُ وَإِنْ مَاتَا عَلَى صُرَامِهِمَا لَمْ يَدْخُلَا الْجَنَّةَ جَمِيعًا أَبَدًا",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] dari [Yazid Ar-Risyk] dari [Mu'adzah] dari [Hisyam bin 'Amir] dia berkata; Rasulullah shallallahu'alaihiwasallam bersabda: \"Tidak halal bagi seorang muslim untuk mendiamkan muslim yang lain lebih dari tiga malam. Sesungguhnya kedua-duanya jauh dari kebenaran selama mereka berdua masih saling mendiamkan. Yang pertama-tama insyaf di antara keduanya, maka kesegeraannya berinsyaf menjadi penebus dosanya. Jika si 'A' mengucapkan salam terhadap temannya si 'B', namun si 'B' tidak menerimanya padahal si'A'masih mau menjawab salamnya, maka salamnya akan dijawab oleh Malaikat, dan yang lain salamnya akan dijawab oleh setan. Jika mereka berdua meninggal dalam keadaan saling mendiamkan, niscaya mereka berdua tidak akan masuk surga selamanya.\""
            },
            {
                "number": 969,
                "arab": "حَدَّثَنَا بَهْزٌ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ قَالَ حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ قَالَ قَالَ هِشَامُ بْنُ عَامِرٍجَاءَتْ الْأَنْصَارُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أُحُدٍ فَقَالُوا يَا رَسُولَ اللَّهِ أَصَابَنَا قَرْحٌ وَجَهْدٌ فَكَيْفَ تَأْمُرُنَا قَالَ احْفِرُوا وَأَوْسِعُوا وَاجْعَلُوا الرَّجُلَيْنِ وَالثَّلَاثَةَ فِي الْقَبْرِ قَالُوا فَأَيُّهُمْ نُقَدِّمُ قَالَ أَكْثَرَهُمْ قُرْآنًاقَالَ فَقُدِّمَ أَبِي عَامِرٌ بَيْنَ يَدَيْ رَجُلٍ أَوْ اثْنَيْنِ",
                "id": "Telah menceritakan kepada kami [Bahz] berkata; telah menceritakan kepada kami [Sulaiman bin Al Mughirah] berkata; telah menceritakan kepada kami [Humaid bin Al Hilal] berkata; [Hisyam bin 'Amir] berkata; orang Anshar datang menemui Rasulullah shallallahu'alaihiwasallam Pada waktu Perang Uhud, lalu mereka berkata 'Wahai Rasulullah, kami terkena luka-luka dan kepayahan yang sangat, apa yang anda perintahkan kepada kami!, (Rasulullah shallallahu'alaihiwasallam) bersabda: \"Galilah lubang untuk kalian dan perluaslah serta kuburkanlah dua orang atau tiga orang dalam satu liang\" mereka bertanya, Wahai Rasulullah, siapa yang kami dahulukan? beliau bersabda: \"Yang paling banyak hafal Al qur'an.\" (Hisyam bin 'Amir) berkata; lalu kami mendahulukan Abu 'Amir sebelum seorangpun atau yang lainnya.\""
            },
            {
                "number": 970,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ حُمَيْدِ بْنِ هِلَالٍ قَالَ أَخْبَرَنَا هِشَامُ بْنُ عَامِرٍ قَالَقُتِلَ أَبِي يَوْمَ أُحُدٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْفِرُوا وَوَسِّعُوا وَأَحْسِنُوا وَادْفِنُوا الِاثْنَيْنِ وَالثَّلَاثَةَ فِي الْقَبْرِ وَقَدِّمُوا أَكْثَرَهُمْ قُرْآنًافَكَانَ أَبِي ثَالِثَ ثَلَاثَةٍ وَكَانَ أَكْثَرَهُمْ قُرْآنًا فَقُدِّمَ",
                "id": "(Ahmad bin Hanbal) berkata; telah menghabarkan kepada kami [Abdurrazzaq] berkata; telah menceritakan kepada kami [Ma'mar] dari [Ayyub] dari [Humaid bin Al Hilal] berkata; telah menghabarkan kepada kami [Hisyam bin 'Amir] berkata; Bapakku tewas dalam Perang Uhud, lalu Nabi Shallallahu'alaihiwasallam bersabda: \"Galilah, perluaslah, perbaguslah, kuburkanlah dua atau tiga orang dalam satu liang. Dahulukanlah orang yang paling banyak hapalan Al qur'annya\" bapakku adalah jenazah ketiga yang datang terakhir kali, hanya dia orang yang paling banyak hapalannya maka didahulukan."
            },
            {
                "number": 971,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ قَالَ حَدَّثَنَا أَبِي حَدَّثَنَا أَيُّوبُ عَنْ حُمَيْدٍ عَنْ أَبِي الدَّهْمَاءِ عَنْ هِشَامِ بْنِ عَامِرٍ قَالَشَكَوْا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بِهِمْ مِنْ الْقَرْحِ فَقَالَ احْفِرُوا وَأَحْسِنُوا وَأَوْسِعُوا وَادْفِنُوا الِاثْنَيْنِ وَالثَّلَاثَةَ فِي الْقَبْرِ وَقَدِّمُوا أَكْثَرَهُمْ قُرْآنًافَمَاتَ أَبِي فَقُدِّمَ بَيْنَ يَدَيْ رَجُلَيْنِ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ قَالَ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ حُمَيْدَ بْنَ هِلَالٍ يُحَدِّثُ عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ أَبِيهِ هِشَامِ بْنِ عَامِرٍ قَالَ لَمَّا كَانَ يَوْمُ أُحُدٍ فَذَكَرَ الْحَدِيثَ قَالَ حَدَّثَنَا عَفَّانُ قَالَ سَمِعْتُ جَرِيرَ بْنَ حَازِمٍ يُحَدِّثُ هَذَا الْحَدِيثَ عَنْ حُمَيْدِ بْنِ هِلَالٍ وَزَادَ فِيهِ عَنْ سَعْدِ بْنِ هِشَامٍ وَزَادَ فِيهِ وَأَعْمِقُوا",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Abdusshomad] berkata; telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Ayyub] dari [Humaid] dari [Abu Ad-Dahma'] dari [Hisyam bin 'Amir] berkata; mereka mengadu kepada Nabi Shallallahu'alaihiwasallam kesusahan yang menimpa mereka. Lalu (Rasulullah shallallahu'alaihiwasallam) bersabda: \"Galilah, perbaguslah, perluaslah dan kuburkanlah dua atau tiga orang dalam setiap lubang. Dahulukanlah orang yang paling banyak hapalan Al qur'annya\" lalu bapakku termasuk yang meninggal lalu di dahulukan daripada yang lainnya. Telah menceritakan kepada kami [Wahab bin Jarir] berkata; telah menceritakan kepada kami [bapakku] berkata; saya mendengar [Humaid bin Hilal] menceritakan dari [Sa'ad bin Hisyam] dari [Bapaknya, Hisyam bin 'Amir] berkata; pada saat Perang Uhud, lalu menyebutkan haditsnya, secara lengkap. (Ahmad bin Hanbal) berkata; telah menceritakan kepada kami ['Affan] berkata; saya mendengar [Jarir bin Hazim] menceritakan hadits ini, dari [Humaid bin Hilal] dan menambahkan di dalamnya dari [Sa'ad bin Hisyam] dengan tambahan, dan perdalamlah."
            },
            {
                "number": 972,
                "arab": "قَالَ حَدَّثَنَا حَسَنُ بْنُ مُوسَى قَالَ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ قَالَقَدِمَ هِشَامُ بْنُ عَامِرٍ الْبَصْرَةَ فَوَجَدَهُمْ يَتَبَايَعُونَ الذَّهَبَ فِي أُعْطِيَاتِهِمْ فَقَامَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الذَّهَبِ بِالْوَرِقِ نَسِيئَةً وَأَخْبَرَنَا أَوْ قَالَ إِنَّ ذَلِكَ هُوَ الرِّبَا",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Hasan bin Musa] berkata; telah menceritakan kepada kami [Hammad] yaitu Ibnu Zaid, dari [Ayyub] dari [Abu Qilabah] berkata; [Hisyam bin 'Amir] datang ke Basrah, lalu mendapati mereka saling berjual beli emas dalam tempat pertukaran mereka, lalu dia berdiri dan berkata; Rasulullah shallallahu'alaihiwasallam melarang juAl beli emas dengan uang secara kredit, dan telah mengabarkan kepada kami atau berkata; itu adalah riba."
            },
            {
                "number": 973,
                "arab": "قَالَ حَدَّثَنَا رَوْحٌ قَالَ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ يَزِيدَ بْنِ خُصَيْفَةَ أَنَّ عَمْرَو بْنَ عَبْدِ اللَّهِ بْنِ كَعْبٍ السُّلَمِيَّ أَخْبَرَهُ أَنَّ نَافِعَ بْنَ جُبَيْرٍ أَخْبَرَهُأَنَّ عُثْمَانَ بْنَ أَبِي الْعَاصِ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عُثْمَانُ وَبِي وَجَعٌ قَدْ كَادَ يُهْلِكُنِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْسِكْ بِيَمِينِكَ سَبْعَ مَرَّاتٍ وَقُلْ أَعُوذُ بِعِزَّةِ اللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُقَالَ فَفَعَلْتُ ذَلِكَ فَأَذْهَبَ اللَّهُ مَا كَانَ بِي فَلَمْ أَزَلْ آمُرُ بِهِ أَهْلِي وَغَيْرَهُمْ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Rouh] berkata; telah menceritakan kepada kami [Malik bin Anas] dari [Yazid bin Khushaifah] ['Amr bin Abdullah bin Ka'ab As-Sulami] menghabarinya [Nafi' bin Jubair] menghabarinya, ['Utsman bin Abu Al 'Ash] mendatangi Rasulullah shallallahu'alaihiwasallam. 'Utsman berkata; Aku merasakan sakit yang sangat sehingga aku hampir meninggal olehnya, lalu Rasulullah shallallahu'alaihiwasallam bersabda: \"Peganglah daerah yang sakit itu dengan tangan kananmu sebanyak tujuh kali dengan berdoa, 'AUDZU BI IZZATILLAH WA QUDRATIHI MIN SYARRI MA AJIDU (Aku berlindung dari kemuliaan Allah dan Segala kemampuAn Nya, dari segala keburukan yang menimpaku) lalu saya melakukan hal itu sehingga Allah menghilangkan rasa sakit yang aku derita, sehingga aku menyuruh keluargaku dan orang lain untuk mempraktekkan doa tersebut"
            },
            {
                "number": 974,
                "arab": "قَالَ حَدَّثَنَا رَوْحٌ وَعَبْدُ الصَّمَدِ قَالَا حَدَّثَنَا حَمَّادٌ قَالَ رَوْحٌ قَالَ أَخْبَرَنَا الْجُرَيْرِيُّ عَنْ أَبِي الْعَلَاءِ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ وَامْرَأَةٍ مِنْ قَيْسٍ أَنَّهُمَاسَمِعَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَحَدُهُمَا سَمِعْتُهُ يَقُولُ اللَّهُمَّ اغْفِرْ لِي ذَنْبِي وَخَطَئِي وَعَمْدِيو قَالَ الْآخَرُ سَمِعْتُهُ يَقُولُ اللَّهُمَّ أَسْتَهْدِيكَ لِأَرْشَدِ أَمْرِي وَأَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Rouh] dan [Abdusshomad] berkata; telah menceritakan kepada kami [Hammad] berkata; [Rouh] berkata; telah menghabarkan kepada kami [Al Jurairi] dari [Abu Al Ala'i] dari ['Utsman bin Abu Al Ash] dan [seorang wanita] dari Qais, mereka berdua mendengar Nabi Shallallahu'alaihiwasallam, bersabda: salah satu dari keduanya, saya mendengarnya berkata; \"ALLAHUMMA IGFIRLI DZANBI WA KHATAI WA 'AMDY (Ya Allah ampunilah dosaku dan kesalahan yang tidak sengaja maupun disengaja).\" Adapun salah satunya berkata; Aku mendengarnya (Rasulullah shallallahu'alaihiwasallam) berdoa, \"ASTAHDIIKA LI ARSYADI AMRY WA `A'UDZU BIKA MIN SYARRI NAFSI\" (aku meminta petunjuk kepada-Mu agar urusanku di puncak kebenaran, dan aku berlindung dari kejelekan diriku) \""
            },
            {
                "number": 975,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ قَالَ حَدَّثَنَا حَمَّادٌ عَنِ الْجُرَيْرِيِّ عَنْ أَبِي الْعَلَاءِ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ اجْعَلْنِي إِمَامَ قَوْمِي فَقَالَ أَنْتَ إِمَامُهُمْ وَاقْتَدِ بِأَضْعَفِهِمْ وَاتَّخِذْ مُؤَذِّنًا لَا يَأْخُذُ عَلَى أَذَانِهِ أَجْرًا",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Abdushshomad] berkata; telah menceritakan kepada kami [Hammad] dari [Al Jurairi] dari [Abu Al Ala'i] dari ['Utsman bin Abu Al Ash] berkata; Wahai Rasulullah shallallahu'alaihiwasallam jadikanlah aku imam kaumku!. Lalu (Rasulullah shallallahu'alaihiwasallam) berkata 'Engkau imam mereka dan teladanilah orang terlemah di antara mereka, dan ambillah seorang muadzin yang tidak mengambil upah atas adzannya.\""
            },
            {
                "number": 976,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ أَخْبَرَنَا سَعِيدٌ الْجُرَيْرِيُّ عَنْ أَبِي الْعَلَاءِ عَنْ مُطَرِّفٍ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ اجْعَلْنِي إِمَامَ قَوْمِي قَالَ أَنْتَ إِمَامُهُمْ فَاقْتَدِ بِأَضْعَفِهِمْ وَاتَّخِذْ مُؤَذِّنًا لَا يَأْخُذُ عَلَى أَذَانِهِ أَجْرًا",
                "id": "Telah menceritakan kepada kami ['Affan] berkata; telah menceritakan kepada kami [Hammad bin Salamah] berkata; telah menghabarkan kepada kami [Sa'id Al Jurairi] dari [Abu Al Ala'i] dari [Mutharrif] dari ['Utsman bin Abu Al Ash] berkata saya berkata; Wahai Rasulullah, jadikanlah saya imam bagi kaum saya. Beliau bersabda: \"Kamu adalah imam mereka, dan teladanilah orang yang paling lemah di antara kalian. Angkatlah seorang muadzin yang tidak mengambil upah.\""
            },
            {
                "number": 977,
                "arab": "حَدَّثَنَا يُونُسُ قَالَ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ مُطَرِّفٍ قَالَدَخَلْتُ عَلَى عُثْمَانَ بْنِ أَبِي الْعَاصِ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الصِّيَامُ جُنَّةٌ كَجُنَّةِ أَحَدِكُمْ مِنْ الْقِتَالِ وَكَانَ آخِرُ مَا عَهِدَ إِلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ بَعَثَنِي إِلَى الطَّائِفِ قَالَ يَا عُثْمَانُ تَجَوَّزْ فِي الصَّلَاةِ فَإِنَّ فِي الْقَوْمِ الْكَبِيرَ وَذَا الْحَاجَةِ",
                "id": "Telah menceritakan kepada kami [Yunus] berkata; telah menceritakan kepada kami [Hammad] yaitu Ibnu Zaid, dari [Muhammad bin Ishaq] dari [Sa'id bin Abu Hind] dari [Mutharrif] Berkata; Aku menemui ['Utsman bin Abu Al Ash], lalu dia berkata; Aku mendengar Rasulullah shallallahu'alaihiwasallam bersabda: \"Puasa adalah perisai, seperti perisai di antara kalian waktu berperang, dan wasiat terakhir Rasulullah shallallahu'alaihiwasallam kepadaku ketika beliau mengutusku ke Thaif beliau bersabda: \"Wahai Usman peringanlah dalam sholat, karena yang menjadi makmum terdapat orang tua dan orang yang mempunyai keperluan.\""
            },
            {
                "number": 978,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى قَالَ حَدَّثَنَا مَالِكٌ عَنْ يَزِيدَ بْنِ خُصَيْفَةَ أَنَّ عَمْرَو بْنَ عَبْدِ اللَّهِ بْنِ كَعْبٍ أَخْبَرَهُ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ قَالَأَتَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِي وَجَعٌ قَدْ كَادَ يُهْلِكُنِي فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْسَحْهُ بِيَمِينِكَ سَبْعَ مَرَّاتٍ وَقُلْ أَعُوذُ بِعِزَّةِ اللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُقَالَ فَفَعَلْتُ ذَلِكَ فَأَذْهَبَ اللَّهُ مَا كَانَ بِي فَلَمْ أَزَلْ آمُرُ بِهِ أَهْلِي وَغَيْرَهُمْ",
                "id": "Telah menceritakan kepada kami [Ishaq bin 'Isa] berkata; telah menceritakan kepada kami [Malik] dari [Yazid bin Khushaifah] ['Amr bin Abdullah bin Kaab] menghabarinya, dari [Nafi' bin Jubair] dari ['Utsman bin Abu Al Ash] berkata; Rasulullah shallallahu'alaihiwasallam menemuiku ketika saya sedang sakit yang hampir saja menjadikanku meninggal karenanya. lalu Rasulullah shallallahu'alaihiwasallam bersabda kepadaku, \"Usaplah daerah yang sakit itu dengan tangan kananmu sebanyak tujuh kali dengan berdoa, 'AUDZU BI IZZATILLAH WA QUDRATIHI MIN SYARRI MA AJIDU (Aku berlindung dengan kemuliaan Allah dan Segala kemampuAn Nya, dari segala keburukan yang menimpaku), saya lakukan hal itu sehingga Allah menghilangkan rasa sakit yang aku derita, sehingga aku menyuruh keluargaku dan orang lain untuk mempraktekkan doa tersebut."
            },
            {
                "number": 979,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنِ النُّعْمَانِ بْنِ سَالِمٍ قَالَ سَمِعْتُ أَشْيَاخَنَا مِنْ ثَقِيفٍ قَالُوا أَخْبَرَنَا عُثْمَانُ بْنُ أَبِي الْعَاصِ أَنَّهُ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمَّ قَوْمَكَ وَإِذَا أَمَمْتَ قَوْمَكَ فَأَخِفَّ بِهِمْ الصَّلَاةَ فَإِنَّهُ يَقُومُ فِيهَا الصَّغِيرُ وَالْكَبِيرُ وَالضَّعِيفُ وَالْمَرِيضُ وَذُو الْحَاجَةِ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [An Nu'man bin Salim] berkata; saya mendengar para [Syaikh] dari Tsaqif, telah menghabarkan kepada kami ['Utsman bin Abu Al Ash] dia berkata; Rasulullah shallallahu'alaihiwasallam bersabda kepadaku 'Imamilah kaummu. Ketika kamu menjadi imam kaummu, peringkaslah sholat, karena yang ikut ada anak kecil, orang yang sudah tua, orang yang lemah, orang yang sakit dan orang yang memiliki keperluan.\""
            },
            {
                "number": 980,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيِّبِ قَالَ حَدَّثَ عُثْمَانُ بْنُ أَبِي الْعَاصِ قَالَآخِرُ مَا عَهِدَ إِلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَمَمْتَ قَوْمًا فَأَخِفَّ بِهِمْ الصَّلَاةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari ['Amr bin Murrah] berkata; saya mendengar [Sa'id bin Musayyab] berkata; ['Utsman bin Abu Al Ash] menceritakan, berkata; pesan terakhir yang diwasiatkan Rasulullah shallallahu'alaihiwasallam kepadaku adalah 'Jika kamu menjadi imam suatu kaum, ringankanlah sholat.'"
            },
            {
                "number": 981,
                "arab": "قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ أَنَّ مُطَرِّفًا مِنْ بَنِي عَامِرِ بْنِ صَعْصَعَةَ حَدَّثَهُأَنَّ عُثْمَانَ بْنَ أَبِي الْعَاصِ الثَّقَفِيَّ دَعَا لَهُ بِلَبَنٍ لِيَسْقِيَهُ فَقَالَ مُطَرِّفٌ إِنِّي صَائِمٌ فَقَالَ عُثْمَانُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الصِّيَامُ جُنَّةٌ مِنْ النَّارِ كَجُنَّةِ أَحَدِكُمْ مِنْ الْقِتَالِ وَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ صِيَامٌ حَسَنٌ صِيَامُ ثَلَاثَةِ أَيَّامٍ مِنْ الشَّهْرِ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Hajjaj] berkata; telah menceritakan kepada kami [Laits bin Sa'ad] berkata; telah menceritakan kepadaku [Yazid bin Abu Habib] dari [Sa'id bin Abu Hind] [Mutharrif] dari Bani 'Amir bin Sha'sha'ah, menceritakannya ['Utsman bin Abu Al Ash Ats-Tsaqafi] meminta susu untuk diminum, lalu Mutharrif berkata; saya sedang berpuasa. 'Usman berkata; saya mendengar Rasulullah shallallahu'alaihiwasallam bersabda: \"Puasa adalah perisai dari neraka seperti perisai di antara kalian waktu berperang\", dan saya mendengar Rasulullah shallallahu'alaihiwasallam bersabda: \"Puasa yang baik adalah puasa tiga hari setiap bulan.\""
            },
            {
                "number": 982,
                "arab": "قَالَ حَدَّثَنَا يَزِيدُ قَالَ أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا عَلِيُّ بْنُ زَيْدٍ عَنِ الْحَسَنِ قَالَمَرَّ عُثْمَانُ بْنُ أَبِي الْعَاصِ عَلَى كِلَابِ بْنِ أُمَيَّةَ وَهُوَ جَالِسٌ عَلَى مَجْلِسِ الْعَاشِرِ بِالْبَصْرَةِ فَقَالَ مَا يُجْلِسُكَ هَاهُنَا قَالَ اسْتَعْمَلَنِي هَذَا عَلَى هَذَا الْمَكَانِ يَعْنِي زِيَادًا فَقَالَ لَهُ عُثْمَانُ أَلَا أُحَدِّثُكَ حَدِيثًا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَلَى فَقَالَ عُثْمَانُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كَانَ لِدَاوُدَ نَبِيِّ اللَّهِ عَلَيْهِ السَّلَام مِنْ اللَّيْلِ سَاعَةٌ يُوقِظُ فِيهَا أَهْلَهُ فَيَقُولُ يَا آلَ دَاوُدَ قُومُوا فَصَلُّوا فَإِنَّ هَذِهِ سَاعَةٌ يَسْتَجِيبُ اللَّهُ فِيهَا الدُّعَاءَ إِلَّا لِسَاحِرٍ أَوْ عَشَّارٍ فَرَكِبَ كِلاَبُ بْنُ أُمَيَّةَ سَفِينَتَهُ فَأَتَى زَيِادًا فَاسْتَعْفَاهُ فَأَعْفَاهُحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنِ الْحَسَنِ قَالَ مَرَّ عُثْمَانُ بْنُ أَبِي الْعَاصِ عَلَى كِلَابِ بْنِ أُمَيَّةَ فَذَكَرَ نَحْوَهُ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Yazid] berkata; telah mengabarkan kepada kami [Hammad bin Salamah] berkata; telah menceritakan kepada kami ['Ali bin Zaid] dari [Al Hasan] 'Utsman bin Abu Al Ash melewati Kilab Bin Umayyah yang sedang duduk di tempat perpajakan di Bashrah, maka 'Utsman bin Abu Al Ash bertanya, \" Apa yang membuatmu duduk disini\"? (Kilab bin Umayyah) menjawab 'Ziyad yang menyuruhku untuk duduk.' 'Utsman berkata, maukah saya ceritakan sesuatu hadits?.\"Maukah aku tunjukkan kepadamu suatu hadits yang saya dengar langsung dari Rasulullah shallallahu'alaihiwasallam?.\" Dia berkata; Ya. Lalu ['Utsman] berkata; saya mendengar Rasulullah shallallahu'alaihiwasallam bersabda: \"Dawud, Nabi Allah Alaihissalam, suatu malam membangunkan keluarganya dan berseru, 'Wahai keluarga Dawud, bangunlah kalian dan sholatlah! sungguh ini adalah waktu yang dikabulkan doa oleh Allah, kecuali untuk tukang sihir atau para pekerja pajak. Lalu Kilab bin Umayyah menaiki kapalnya untuk mendatangi Ziyad, untuk meminta maaf, dan (Kilab) pun memaafkannya. Telah menceritakan kepada kami ['ubaidhullah bin 'Umar Al Qawaryry] berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari ['Ali bin Zaid] dari [Al Hasan] berkata; ['Utsman bin Abu Al Ash] melewati Kilab bin Umayyah, maka (Hasan) menyebutkan hadis sebagaimana di atas."
            },
            {
                "number": 983,
                "arab": "قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ أَوْ بَدْرٍ أَنَا أَشُكُّ عَنْ طَلْقِ بْنِ عَلِيٍّ الْحَنَفِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَنْظُرُ اللَّهُ عَزَّ وَجَلَّ إِلَى صَلَاةِ عَبْدٍ لَا يُقِيمُ فِيهَا صُلْبَهُ بَيْنَ رُكُوعِهَا وَسُجُودِهَا",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Waki'] berkata; telah menceritakan kepada kami ['Ikrimah bin 'Ammar] dari [Abdullah bin Zaid] atau Badr saya ragu, dari [Thalq bin 'Ali Al Hanafi], berkata; Rasulullah shallallahu'alaihiwasallam bersabda: \"Allah AzzaWaJalla tidak melihat sholat seorang hamba yang tidak menegakkan tulang punggungnya pada saat ruku' dan sujudnya.\""
            },
            {
                "number": 984,
                "arab": "قَالَ حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا أَيُّوبُ بْنُ عُتْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَدْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَلِيِّ بْنِ شَيْبَانَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَنْظُرُ اللَّهُ عَزَّ وَجَلَّ إِلَى رَجُلٍ لَا يُقِيمُ صُلْبَهُ بَيْنَ رُكُوعِهِ وَسُجُودِهِ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Abu Nadlr] berkata; telah menceritakan kepada kami [Ayyub bin 'Utbah] telah menceritakan kepada kami [Abdullah bin Badr] dari [Abdurrahman bin 'Ali bin Syaiban] dari [bapaknya], Rasulullah shallallahu'alaihiwasallam bersabda: \"Allah AzzaWaJalla tidak melihat seorang laki-laki yang tidak menegakkan tulang punggungnya antara ruku'nya dan sujudnya.\""
            },
            {
                "number": 985,
                "arab": "قَالَ قَالَ حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا أَيُّوبُ بْنُ عُتْبَةَ عَنْ قَيْسِ بْنِ طَلْقٍ عَنْ أَبِيهِ قَالَسَأَلَ رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيَتَوَضَّأُ أَحَدُنَا إِذَا مَسَّ ذَكَرَهُ قَالَ إِنَّمَا هُوَ بَضْعَةٌ مِنْكَ أَوْ جَسَدِكَ",
                "id": "(Abdullah bin Ahmad) berkata; (Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Hammad bin Khalid] berkata; telah menceritakan kepada kami [Ayyub bin 'Utbah] dari [Qais bin Thalq] dari [bapaknya] berkata; Seorang laki-laki bertanya Rasulullah shallallahu'alaihiwasallam, Apabila salah di antara kita memegang kemaluannya haruskah dia berwudlu? beliau bersabda: \"Sesungguhnya itu (kemaluan, pent) adalah bagian darimu atau tubuhmu.\""
            },
            {
                "number": 986,
                "arab": "قَالَ حَدَّثَنَا يُونُسُ حَدَّثَنَا أَبَانُ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عِيسَى بْنِ خُثَيْمٍ عَنْ قَيْسِ بْنِ طَلْقٍ أَنَّ أَبَاهُشَهِدَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَأَلَهُ رَجُلٌ عَنْ الصَّلَاةِ فِي الثَّوْبِ الْوَاحِدِ فَلَمْ يَقُلْ لَهُ شَيْئًا فَلَمَّا أُقِيمَتْ الصَّلَاةُ طَارَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ ثَوْبَيْهِ فَصَلَّى فِيهِمَا",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Yunus] telah menceritakan kepada kami [Aban] dari [Yahya bin Abu Katsir] dari ['Isa bin Khutsaim] dari [Qais bin Thalq] [bapaknya] dia pernah menjumpai Rasulullah shallallahu'alaihiwasallam, ketika ada seorang yang bertanya telah sholat dengan satu pakaian, beliau tidak mengucapkan sepatah katapun. Tatkala sholat didirikan, Rasulullah shallallahu'alaihiwasallam melipat antara kedua ujung kainnya dan beliau pergunakan untuk sholat."
            },
            {
                "number": 987,
                "arab": "قَالَ حَدَّثَنَا مُوسَى بْنُ دَاوُدَ حَدَّثَنَا مُحَمَّدُ بْنُ جَابِرٍ عَنْ عَبْدِ اللَّهِ بْنِ بَدْرٍ عَنْ عَلِيِّ بْنِ طَلْقٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَكُونُ وِتْرَانِ فِي لَيْلَةٍ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Musa bin Daud] telah menceritakan kepada kami [Muhammad bin Jabir] dari [Abdullah bin Badr] ['Ali bin Thalq] dari [bapaknya] berkata; Rasulullah shallallahu'alaihiwasallam bersabda: \"Tidak ada witir dalam satu malam.\""
            },
            {
                "number": 988,
                "arab": "قَالَوَسُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرَّجُلِ يُصَلِّي فِي ثَوْبٍ وَاحِدٍ قَالَ وَكُلُّكُمْ يَجِدُ ثَوْبَيْنِ",
                "id": "[Thalq] berkata; Nabi Shallallahu'alaihiwasallam ditanya tentang seorang laki-laki yang sholat dengan memakai satu pakaian. Beliau bersabda: \"Tapi bukankah kalian mendapatkan dua kain?.\""
            },
            {
                "number": 989,
                "arab": "حَدَّثَنَا مُوسَى قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَابِرٍ عَنْ قَيْسِ بْنِ طَلْقٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَيْتُمْ الْهِلَالَ فَصُومُوا وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا فَإِنْ أُغْمِيَ عَلَيْكُمْ فَأَتِمُّوا الْعِدَّةَ",
                "id": "Telah menceritakan kepada kami [Musa] berkata; telah menceritakan kepada kami [Muhammad bin Jabir] dari [Qais bin Thalq] dari [bapaknya] berkata; Rasulullah shallallahu'alaihiwasallam bersabda: \"Jika kalian melihat Hilal, maka berpuasalah. Jika kalian melihatnya lagi maka berbukalah. Jika ada mendung pada kalian maka sempurnakanlah hitungan.\""
            },
            {
                "number": 990,
                "arab": "قَالَ حَدَّثَنَا مُوسَى بْنُ دَاوُدَ حَدَّثَنَا مُحَمَّدُ بْنُ جَابِرٍ عَنْ قَيْسِ بْنِ طَلْقٍ عَنْ أَبِيهِ قَالَكُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ رَجُلٌ فَقَالَ مَسِسْتُ ذَكَرِي أَوْ الرَّجُلُ يَمَسُّ ذَكَرَهُ فِي الصَّلَاةِ عَلَيْهِ الْوُضُوءُ قَالَ لَا إِنَّمَا هُوَ مِنْكَ",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Musa bin Daud] telah menceritakan kepada kami [Muhammad bin Jabir] dari [Qais bin Thalq] dari [bapaknya] berkata; Aku sedang duduk bersama Nabi Shallallahu'alaihiwasallam, lalu ada seorang laki-laki bertanya beliau dengan berkata; \"Aku telah memegang kemaluanku\" ataupun ada seorang laki-laki yang memegang kemaluannya dalam sholat, apakah wajib baginya untuk berwudlu? Beliau bersabda: \"Tidak, karena itu (kemaluan, pent) adalah bagian dari anggota tubuhmu.\""
            },
            {
                "number": 991,
                "arab": "قَالَ حَدَّثَنَا مُوسَى بْنُ دَاوُدَ حَدَّثَنَا مُحَمَّدُ بْنُ جَابِرٍ عَنْ عَبْدِ اللَّهِ بْنِ بَدْرٍ عَنْ طَلْقِ بْنِ عَلِيٍّ قَالَوَفَدْنَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا وَدَّعَنَا أَمَرَنِي فَأَتَيْتُهُ بِإِدَاوَةٍ مِنْ مَاءٍ فَحَثَا مِنْهَا ثُمَّ مَجَّ فِيهَا ثَلَاثًا ثُمَّ أَوْكَأَهَا ثُمَّ قَالَ اذْهَبْ بِهَا فَانْضَحْ مَسْجِدَ قَوْمِكَ وَأْمُرْهُمْ يَرْفَعُوا بِرُءُوسِهِمْ أَنْ رَفَعَهَا اللَّهُ قُلْتُ إِنَّ الْأَرْضَ بَيْنَنَا وَبَيْنَكَ بَعِيدَةٌ وَإِنَّهَا تَيْبَسُ قَالَ فَإِذَا يَبِسَتْ فَمُدَّهَا",
                "id": "(Ahmad bin Hanbal) berkata, telah menceritakan kepada kami [Musa bin Daud] telah menceritakan kepada kami [Muhammad bin Jabir] dari [Abdullah bin Badr] dari [Thalq bin 'Ali] berkata, kami menjadi utusan untuk menemui Nabi Shallallahu'alaihiwasallam. Tatkala beliau hendak meninggalkan kami, beliau menyuruhku suatu urusan. Lalu saya membawa bejana yang berisi air, beliau mengambil dengan kedua telapak tangannya, lalu mengeluarkan dari mulutnya tiga kali, mengikatnya kembali lalu bersabda: \"Bawalah ini dan basahilah masjid kaummu dan perintahkan mereka untuk mengangkat kepala mereka, niscaya Allah akan mengangkatnya. Saya berkata, bumi antara tempat anda dengan kami sangat jauh dan tanah itu sangat kering. (Rasulullah) bersabda: \"Jika telah kering maka panjangkanlah!\""
            },
            {
                "number": 992,
                "arab": "حَدَّثَنَا قُرَّانُ بْنُ تَمَّامٍ عَنْ مُحَمَّدِ بْنِ جَابِرٍ عَنْ قَيْسِ بْنِ طَلْقٍ عَنْ أَبِيهِ قَالَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَيَتَوَضَّأُ أَحَدُنَا إِذَا مَسَّ ذَكَرَهُ فِي الصَّلَاةِ قَالَ هَلْ هُوَ إِلَّا مِنْكَ أَوْ بَضْعَةٌ مِنْكَ",
                "id": "Telah menceritakan kepada kami [Qurrab bin Tamam] dari [Muhammad bin Jabir] dari [Qais bin Thalq] dari [bapaknya] berkata, ada seorang laki-laki yang berkata, Wahai Rasulullah, jika salah seorang dari kita memegang kemaluannya ketika sholat, apa harus berwudhu?. (Rasulullahi Shallallahu'alaihiwasallam) bersabda: \"Itu hanya potongan dari tubuhmu atau secuil daging darimu.\""
            },
            {
                "number": 993,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ وَسُرَيْجٌ قَالَا حَدَّثَنَا مُلَازِمُ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَدْرٍ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَلِيٍّ حَدَّثَهُ أَنَّ أَبَاهُ عَلِيَّ بْنَ شَيْبَانَ حَدَّثَهُأَنَّهُ خَرَجَ وَافِدًا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَصَلَّيْنَا خَلْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَحَ بِمُؤْخِرِ عَيْنَيْهِ إِلَى رَجُلٍ لَا يُقِيمُ صُلْبَهُ فِي الرُّكُوعِ وَالسُّجُودِ فَلَمَّا انْصَرَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَا مَعْشَرَ الْمُسْلِمِينَ إِنَّهُ لَا صَلَاةَ لِمَنْ لَا يُقِيمُ صُلْبَهُ فِي الرُّكُوعِ وَالسُّجُودِ قَالَ وَرَأَى رَجُلًا يُصَلِّي خَلْفَ الصَّفِّ فَوَقَفَ حَتَّى انْصَرَفَ الرَّجُلُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَقْبِلْ صَلَاتَكَ فَلَا صَلَاةَ لِرَجُلٍ فَرْدٍ خَلْفَ الصَّفِّ قَالَ عَبْدُ الصَّمَدِ فَرْدًا خَلْفَ الصَّفِّحَدَّثَنَا عَبْدُ الصَّمَدِ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنَا أَبُو عَبْدِ اللَّهِ الشَّقَرِيُّ قَالَ حَدَّثَنِي عَمْرُو بْنُ جَابِرٍ عَنْ عَبْدِ اللَّهِ بْنِ بَدْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَلِيِّ بْنِ شَيْبَانَ عَنْ أَبِيهِ فَذَكَرَهُ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا أَيُّوبُ بْنُ عُتْبَةَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَدْرٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَلِيِّ بْنِ شَيْبَانَ السُّحَيْمِيُّ قَالَ حَدَّثَنِي أَبِي فَذَكَرَهُ",
                "id": "(Ahmad bin Hanbal) berkata, telah menceritakan kepada kami [Abdushshamad] dan [Suraij] berkata, telah menceritakan kepada kami [Mulazim bin 'Amr] telah menceritakan kepada kami [Abdullah bin Badr] [Abdurrahman bin 'Ali] menceritakannya, [bapaknya, 'Ali bin Syaiban] menceritakannya, dia berangkat sebagai utusan untuk menemui Rasulullahi Shallallahu'alaihiwasallam. Dia berkata, Kami sholat di belakang Nabi Shallallahu'alaihiwasallam, dengan kedua matanya secara selintas beliau melihat seorang laki-laki yang tidak menyempurnakan tulang punggungnya waktu ruku' dan sujud. Ketika Rasulullahi Shallallahu'alaihiwasallam selesai sholat, bersabda: \"Wahai kaum muslimin, tidak sah sholat bagi seseorang yang tidak menyempurnakan tulang punggungnya waktu ruku' dan sujud\", lalu ('Ali bin Syaiban) berkata, (Rasulullahi Shallallahu'alaihiwasallam) melihat seorang laki-laki sholat di belakang shaf dan berdiri sendiri sampai sholat selesai, maka Rasulullah Shallallahu'alaihiwasallam bersabda: \"Ulangilah sholatmu, karena tidak sah sholat seseorang yang berdiri di belakang shaf sendirian.\" Abdushshamad berkata dengan redaksi 'Secara sendirian di belakang shaf.' Telah menceritakan kepada kami [Abdushamad] berkata, telah menceritakan kepadaku [bapakku] berkata, telah mengabarkan kepada kami [Abu Abdullah Asy-Syaqary] berkata, telah menceritakan kepadaku ['Amr bin Jabir bin Abdullah bin Badr] dari [Abdurrahman] dari ['Ali bin Syaiban] dari bapaknya yang dia menyebutkan haditsnya. Telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Ayyub bin 'Utbah] berkata, telah menceritakan kepada kami [Abdullah bin Badr] berkata, telah menceritakan kepada kami [Abdurrahman bin 'Ali bin Syaiban Asy-Suhaimi] berkata, telah menceritakan kepadaku [bapakku] lalu dia menyebutkan hadits secara lengkap."
            },
            {
                "number": 994,
                "arab": "قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي مُلَازِمُ بْنُ عَمْرٍو قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بَدْرٍ عَنْ قَيْسِ بْنِ طَلْقٍ عَنْ أَبِيهِ طَلْقِ بْنِ عَلِيٍّ قَالَ قَالَلَدَغَتْنِي عَقْرَبٌ عِنْدَ نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَقَانِي وَمَسَحَهَا",
                "id": "(Ahmad bin Hanbal) berkata, telah menceritakan kepada kami ['Ali bin Abdullah] berkata, telah menceritakan kepadaku [Mulazim bin 'Amr] berkata, telah menceritakan kepadaku [Abdullah bin Badr] dari [Qais bin Thalq] dari [bapaknya, Talq bin 'Ali] berkata, saya disengat kalajengking di sisi Nabiyullah Shallallahu'alaihiwasallam, lalu beliau membacakanku dengan dengan doa dan mengusapnya.\""
            },
            {
                "number": 995,
                "arab": "قَالَ حَدَّثَنَا رَوْحٌ قَالَ حَدَّثَنَا سَعِيدٌ وَعَبْدُ الْوَهَّابِ قَالَ أَخْبَرَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنِ الْأَسْوَدِ بْنِ سَرِيعٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ سَرِيَّةً يَوْمَ حُنَيْنٍ قَالَ رَوْحٌ فَأَتَوْا حَيًّا مِنْ أَحْيَاءِ الْعَرَبِ فَذَكَرَ الْحَدِيثَ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ مَا مِنْ نَسَمَةٍ تُولَدُ إِلَّا عَلَى الْفِطْرَةِ حَتَّى يُعْرِبَ عَنْهَا لِسَانُهَا",
                "id": "(Ahmad bin Hanbal) berkata, telah menceritakan kepada kami [Rauh] berkata, telah menceritakan kepada kami [Sa'id] dan [Abdul Wahab] berkata, telah mengabarkan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Al Aswad bin Sari'] Rasulullahi Shallallahu'alaihiwasallam mengutus satuan kelompok perang pada Peristiwa Hunain. [Rauh] berkata, lalu mereka mendatangi salah satu desa yang ada di pedalaman Arab, lalu menyebutkan hadis secara lengkap. Beliau bersabda: \"Demi yang jiwa Muhammad berada di tangan-Nya, tidaklah ada jiwa yang dilahirkan kecuali pasti dalam keadaan fitrah sehingga lidahnya yang akan mengikrarkannya.\""
            },
            {
                "number": 996,
                "arab": "قَالَ حَدَّثَنَا حَسَنُ بْنُ مُوسَى حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ عَنِ الْأَسْوَدِ بْنِ سَرِيعٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي قَدْ مَدَحْتُ اللَّهَ بِمَدْحَةٍ وَمَدَحْتُكَ بِأُخْرَى فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَاتِ وَابْدَأْ بِمَدْحَةِ اللَّهِ عَزَّ وَجَلَّ",
                "id": "(Ahmad bin Hanbal) berkata, telah menceritakan kepada kami [Hasan bin Musa] telah menceritakan kepada kami [Hammad bin Zaid] dari ['Ali bin Zaid] dari [Abdurrahman bin Abu Bakrah] dari [Aswad bin Sari'] berkata, saya berkata, Wahai Rasulullah, saya telah memuji Allah dengan suatu pujian dan memuji anda dengan pujian yang lain. Lalu Nabi Shallallahu'alaihiwasallam bersabda: \"Lakukanlah dan mulailah dengan memuji Allah AzzaWaJalla.\""
            },
            {
                "number": 997,
                "arab": "قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنِ الْأَحْنَفِ بْنِ قَيْسٍ عَنِ الْأَسْوَدِ بْنِ سَرِيعٍأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَرْبَعَةٌ يَوْمَ الْقِيَامَةِ رَجُلٌ أَصَمُّ لَا يَسْمَعُ شَيْئًا وَرَجُلٌ أَحْمَقُ وَرَجُلٌ هَرَمٌ وَرَجُلٌ مَاتَ فِي فَتْرَةٍ فَأَمَّا الْأَصَمُّ فَيَقُولُ رَبِّ لَقَدْ جَاءَ الْإِسْلَامُ وَمَا أَسْمَعُ شَيْئًا وَأَمَّا الْأَحْمَقُ فَيَقُولُ رَبِّ لَقَدْ جَاءَ الْإِسْلَامُ وَالصِّبْيَانُ يَحْذِفُونِي بِالْبَعْرِ وَأَمَّا الْهَرَمُ فَيَقُولُ رَبِّي لَقَدْ جَاءَ الْإِسْلَامُ وَمَا أَعْقِلُ شَيْئًا وَأَمَّا الَّذِي مَاتَ فِي الْفَتْرَةِ فَيَقُولُ رَبِّ مَا أَتَانِي لَكَ رَسُولٌ فَيَأْخُذُ مَوَاثِيقَهُمْ لَيُطِيعُنَّهُ فَيُرْسِلُ إِلَيْهِمْ أَنْ ادْخُلُوا النَّارَ قَالَ فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ دَخَلُوهَا لَكَانَتْ عَلَيْهِمْ بَرْدًا وَسَلَامًاقَالَ حَدَّثَنَا عَلِيٌّ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنِ الْحَسَنِ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ مِثْلَ هَذَا غَيْرَ أَنَّهُ قَالَ فِي آخِرِهِ فَمَنْ دَخَلَهَا كَانَتْ عَلَيْهِ بَرْدًا وَسَلَامًا وَمَنْ لَمْ يَدْخُلْهَا يُسْحَبُ إِلَيْهَا",
                "id": "(Ahmad bin Hanbal) berkata, telah menceritakan kepada kami ['Ali bin Abdullah] telah menceritakan kepada kami [Mu'adz bin Hisyam] berkata, telah menceritakan kepadaku [bapakku] dari [Qatadah] dari [Ahnaf bin Qais] dari [Aswad bin Sari'] Sesungguhnya Nabiyullah Shallallahu'alaihiwasallam bersabda: \"Ada empat jenis orang di hari kiamat nanti: Seorang laki-laki tuli yang tidak mendengar apapun, seorang laki-laki bodoh, seorang laki-laki yang pikun, dan seorang laki-laki yang mati dalam masa-masa kevakuman (ajaran agama atau risalah kenabian tidak sempat menjumpai dirinya). Orang tuli tersebut menyampaikan alasannya, 'Wahai Rabku, telah datang Islam hanya aku tidak mendengar apapun tentang hal itu'. Adapun orang yang bodoh beralasan, 'Wahai Rabku, Islam telah datang, hanya anak-anak melempariku dengan kotoran unta'. Adapun yang pikun berkata, 'Wahai Rabku, telah datang Islam hanya aku tidak bisa berfikir sama sekali'. Adapun orang yang mati dalam masa-masa kevakuman berkata, 'Wahai Rabku, para utusan-Mu tidak mendatangiku dan mengambil janji orang-orang untuk taat kepadanya. Lantas Allah mengutus para malaikatnya untuk mengatakan 'Masuklah kalian ke dalam neraka'. Demi Dzat yang jiwa Muhammad berada di tangan-Nya, kalaulah mereka memasuki api tersebut, api itu akan menjadi dingin dan menyelamatkan mereka\". (Ahmad bin Hanbal) berkata, telah menceritakan kepada kami ['Ali] telah menceritakan kepada kami [Mu'adz bin Hisyam] berkata, telah menceritakan kepadaku [bapakku] dari [Al Hasan] dari [Abu Rafi'] dari [Abu Hurairah] sepereti di atas, kecuali dalam perkataan yang terakhirnya, 'Barangsiapa memasuki api tersebut, api tersebut akan menjadi dingin dan menyelamatkan, dan barangsiapa tidak memasukinya, ia justru diseret untuk memasukinya.\""
            },
            {
                "number": 998,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا السَّرِيُّ بْنُ يَحْيَى حَدَّثَنَا الْحَسَنُ عَنْ الْأَسْوَدِ بْنِ سَرِيعٍ وَكَانَ رَجُلًا مِنْ بَنِي سَعْدٍ قَالَ وَكَانَ أَوَّلَ مَنْ قَصَّ فِي هَذَا الْمَسْجِدِ يَعْنِي الْمَسْجِدَ الْجَامِعَ قَالَغَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعَ غَزَوَاتٍ قَالَ فَتَنَاوَلَ قَوْمٌ الذُّرِّيَّةَ بَعْدَمَا قَتَلُوا الْمُقَاتِلَةَ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلَا مَا بَالُ أَقْوَامٍ قَتَلُوا الْمُقَاتِلَةَ حَتَّى تَنَاوَلُوا الذُّرِّيَّةَ قَالَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَوَلَيْسَ أَبْنَاءُ الْمُشْرِكِينَ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ خِيَارَكُمْ أَبْنَاءُ الْمُشْرِكِينَ إِنَّهَا لَيْسَتْ نَسَمَةٌ تُولَدُ إِلَّا وُلِدَتْ عَلَى الْفِطْرَةِ فَمَا تَزَالُ عَلَيْهَا حَتَّى يُبِينَ عَنْهَا لِسَانُهَا فَأَبَوَاهَا يُهَوِّدَانِهَا أَوْ يُنَصِّرَانِهَاقَالَ وَأَخْفَاهَا الْحَسَنُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [As Sari bin Yahya] telah menceritakan kepada kami [Al Hasan] dari [Al Aswad bin Sari'] dia adalah seorang laki-laki dari Bani Saad berkata, dan dia adalah orang yang pertama kali menceritakan Masjid Jami' ini, ia berkata, saya berperang bersama Rasulullahi Shallallahu'alaihiwasallam sebanyak empat kali peperangan. (Al Aswad bin Sari') berkata, lalu orang-orang menyerang anak-anak dan para wanita (rakyat sipil) setelah membunuh prajurit musuh. Kasus ini sampai kepada Rasulullahi Shallallahu'alaihiwasallam, lalu beliau bersabda: \"Atas dasar apa suatu kaum membunuh para prajurit hingga juga mereka bunuh rakyat sipil (anak-anak dan para wanita)?\" (Al Aswad bin Sari') berkata, lalu ada seorang laki-laki yang berkata, Wahai Rasulullah, bukankan mereka adalah anak-anak orang musyrik? (Al Aswad bin Sari') berkata, lalu Rasulullahi Shallallahu'alaihiwasallam bersabda: \"Apa alasan kalian hanya karena mereka adalah anak orang musyrik, tidak ada jiwa yang lahir yang dilahirkan kecuali dalam keadaan fitrah, dan akan tetap seperti itu sampai lidahnya mengikrarkannya. Lalu kedua orang tuanyalah yang akan menjadikan dia Yahudi atau menjadikan Nasrani\" (Al Aswad bin Sari') berkata, Al Hasan menyembunyikannya."
            },
            {
                "number": 999,
                "arab": "حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ وَبَهْزٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ مُطَرِّفٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ شُعْبَةُ قَالَ قَتَادَةُ أَخْبَرَنِي قَالَ سَمِعْتُ مُطَرِّفًا عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَوْمِ الدَّهْرِ قَالَ مَا صَامَ وَمَا أَفْطَرَ أَوْ لَا صَامَ وَلَا أَفْطَرَ وَقَالَ بَهْزٌ فِي حَدِيثِهِ لَا صَامَ وَلَا أَفْطَرَ",
                "id": "Telah menceritakan kepada kami [Yahya] dari [Syu'bah] dan [Bahz] Nabi Shallallahu'alaihiwasallam telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Mutharrif] dari [bapaknya] dari Nabi Shallallahu'alaihiwasallam. Syu'bah berkata, Qatadah berkata, telah mengabarkan kepadaku, berkata, saya telah mendengar Mutharrif dari Bapaknya dari Nabi Shallallahu alaihi wa sallam tentang puasa dahr (puasa sepanjang masa, pent). (Rasulullahi Shallallahu'alaihiwasallam) bersabda: \"Orang itu dianggap tidak berpuasa juga tidak berbuka.\" Bahz berkata dalam hadisnya dengan redaksi 'Tidak berpuasa juga tidak berbuka.'"
            },
            {
                "number": 1000,
                "arab": "قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِأَنَّ رَجُلًا انْتَهَى إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَقُولُ وَقَالَ وَكِيعٌ مَرَّةً انْتَهَى إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَقْرَأُ{ أَلْهَاكُمْ التَّكَاثُرُ حَتَّى زُرْتُمْ الْمَقَابِرَ }قَالَ يَقُولُ ابْنُ آدَمَ مَالِي مَالِي وَهَلْ لَكَ مِنْ مَالِكَ إِلَّا مَا تَصَدَّقْتَ فَأَمْضَيْتَ أَوْ لَبِسْتَ فَأَبْلَيْتَ أَوْ أَكَلْتَ فَأَفْنَيْتَ",
                "id": "(Ahmad bin Hanbal) berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Mutharrif bin Abdullah] dari [bapaknya], ada seorang laki-laki yang menemui Rasulullahi Shallallahu'alaihiwasallam lalu berkata. --Sedang Waki' berkata dengan redaksi menemui Nabi Shallallahu'alaihiwasallam bukan Rasulullah--, dan beliau membaca, ALHAAKUMUT TAKAATSUR HATTAA ZURTUMUL MAQAABIR, 'Bermegah-megahan Telah melalaikan kamu, Sampai kamu masuk ke dalam kubur' Lalu beliau bersabda: \"Anak Adam berkata, 'aduhai hartaku, aduhai hartaku', padahal tidak ada harta yang menjadi milikmu melainkan yang kau makan lantas menjadi musnah, atau apa yang kamu pakai lalu menjadi kusut atau yang kamu sedekahkan lalu harta tersebut habis.\""
            },
            {
                "number": 1001,
                "arab": "حَدَّثَنَا حَجَّاجٌ حَدَّثَنِي شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ قَالَ سَمِعْتُ مُطَرِّفَ بْنَ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ يُحَدِّثُ عَنْ أَبِيهِ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَنْتَ سَيِّدُ قُرَيْشٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّيِّدُ اللَّهُ قَالَ أَنْتَ أَفْضَلُهَا فِيهَا قَوْلًا وَأَعْظَمُهَا فِيهَا طَوْلًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَقُلْ أَحَدُكُمْ بِقَوْلِهِ وَلَا يَسْتَجِرُّهُ الشَّيْطَانُ",
                "id": "Telah menceritakan kepada kami [Hajjaj] telah menceritakan kepadaku [Syu'bah] berkata, saya telah mendengar [Qatadah] berkata, saya telah mendengar [Mutharrif bin Abdullah bin Asy-Syikhir] menceritakan dari [Bapaknya] berkata, Datang seorang laki-laki kepada Nabi Shallallahu'alaihiwasallam lalu berkata 'Engkaulah tuan Quraisy, Lalu Nabi Shallallahu'alaihiwasallam bersabda: \"Sesungguhnya hakekat Tuan adalah Allah\" lalu laki-laki tersebut berkata, \"engkau adalah oang yang paling utama perkataannya di antara mereka dan yang paling agung kemampuannya\" Rasulullahi Shallallahu'alaihiwasallam bersabda: \"Hendaklah kalian hati-hati dalam perkataannya (berkata sewajarnya dengan tidak berlebihan), jangan sampai disesatkan oleh setan.\""
            },
            {
                "number": 1002,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ أَبِيهِ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسُئِلَ عَنْ رَجُلٍ يَصُومُ الدَّهْرَ قَالَ لَا صَامَ وَلَا أَفْطَرَ",
                "id": "(Ahmad bin Hanbal) berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Mutharrif bin Abdullah bin Asy-Syikhir] dari [Bapaknya] telah mendengar Nabi Shallallahu'alaihiwasallam tentang seorang laki-laki yang berpuasa Dahr, maka beliau bersabda: \"Orang itu tidak dianggap puasa juga tidak dianggap berbuka.\""
            },
            {
                "number": 1003,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ سَعِيدٍ الْجُرَيْرِيِّ عَنْ أَبِي الْعَلَاءِ بْنِ الشِّخِّيرِ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي نَعْلَيْهِ",
                "id": "(Ahmad bin Hanbal) berkata, telah menceritakan kepada kami [Abdurrazzaq] telah menceritakan kepada kami [Ma'mar] dari [Sa'id Al Jurairi] dari [Abu Al 'Ala` bin Abdullah bin Asy-Syikhir] dari [bapaknya] berkata, Aku melihat Rasulullahi Shallallahu'alaihiwasallam sholat dengan menggunakan kedua sandalnya.\""
            },
            {
                "number": 1004,
                "arab": "قَالَ حَدَّثَنَا سُوَيْدُ بْنُ عَمْرٍو وَعَبْدُ الصَّمَدِ قَالَا حَدَّثَنَا مَهْدِيٌّ حَدَّثَنَا غَيْلَانُ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ أَبِيهِأَنَّهُ وَفَدَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَهْطٍ مِنْ بَنِي عَامِرٍ قَالَ فَأَتَيْنَاهُ فَسَلَّمْنَا عَلَيْهِ فَقُلْنَا أَنْتَ وَلِيُّنَا وَأَنْتَ سَيِّدُنَا وَأَنْتَ أَطْوَلُ عَلَيْنَا قَالَ يُونُسُ وَأَنْتَ أَطْوَلُ عَلَيْنَا طَوْلًا وَأَنْتَ أَفْضَلُنَا عَلَيْنَا فَضْلًا وَأَنْتَ الْجَفْنَةُ الْغَرَّاءُ فَقَالَ قُولُوا قَوْلَكُمْ وَلَا يَسْتَجِرَّنَّكُمْ الشَّيْطَانُ قَالَ وَرُبَّمَا قَالَ وَلَا يَسْتَهْوِيَنَّكُمْ",
                "id": "(Ahmad bin Hanbal) berkata, telah menceritakan kepada kami [Suwaid bin 'Amr] dan [Abdushshamad] berkata, telah menceritakan kepada kami [Mahdi] telah menceritakan kepada kami [Ghailan] dari [Mutharrif bin Abdullah bin Asy-Syikhir] dari [bapaknya] dia menjadi seorang utusan untuk menemui Nabi Shallallahu'alaihiwasallam dalam sebuah rombongan dari Bani 'Amir. (Abdullah bin Asy-Syikhir) berkata, lalu kami menemuinya dan kami mengucapkan salam kepada beliau, lalu kami berkata 'Anda adalah wali kami, tuan kami dan anda adalah yang paling kaya dan paling mampu di antara kami.' Yunus berkata, anda adalah orang yang paling mampu dan kaya di antara kami, anda adalah orang yang paling utama di antara kami, anda bagaikan piring besar yang putih wajahnya. (Rasulullahi Shallallahu'alaihiwasallam) bersabda: \"Katakanlah yang wajar-wajar saja dan janganlah setan menyesatkan kalian.\" (Abdullah bin Asy-Syikhir) berkata, barangkali beliau bersabda: \"Janganlah sampai (setan) menjadikan kalian tersesat.\""
            },
            {
                "number": 1005,
                "arab": "قَالَ حَدَّثَنَا يَزِيدُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي صَدْرِهِ أَزِيزٌ كَأَزِيزِ الْمِرْجَلِ مِنْ الْبُكَاءِقَالَ عَبْد اللَّهِ لَمْ يَقُلْ مِنْ الْبُكَاءِ إِلَّا يَزِيدُ بْنُ هَارُونَ",
                "id": "(Ahmad bin Hanbal) berkata, telah menceritakan kepada kami [Yazid] berkata, telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit Al Bunani] dari [Mutharrif bin Abdullah] dari [bapaknya] berkata, Aku melihat Rasulullah Shallallahu'alaihiwasallam yang ketika itu dalam dadanya terdengar rintihan suara tangisan sebagaimana suara air yang bergolak ketika dimasak dalam periuk karena menangis.\" Abdullah berkata, tidak ada yang mengatakan dengan redaksi karena menangis kecuali Yazid bin Harun."
            },
            {
                "number": 1006,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حُمَيْدٌ يَعْنِي الطَّوِيلَ حَدَّثَنَا الْحَسَنُ عَنْ مُطَرِّفٍ عَنْ أَبِيهِأَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ هَوَامَّ الْإِبِلِ نُصِيبُهَا قَالَ ضَالَّةُ الْمُسْلِمِ حَرَقُ النَّارِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] berkata, telah menceritakan kepada kami [Humaid] yaitu Ath-Thawil, telah menceritakan kepada kami [Al Hasan] dari [Mutharrif] dari [Bapaknya] ada seorang laki-laki berkata, Wahai Rasulullah, jika ada unta yang telah tertidur, apakah kami bisa mengambilnya?. Beliau bersabda: \"Barang yang hilang dari seorang muslim adalah api neraka yang membakar.\""
            },
            {
                "number": 1007,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ مُطَرِّفٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ الدَّهْرَ لَا صَامَ وَلَا أَفْطَرَ وَمَا صَامَ وَلَا أَفْطَرَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Syu'bah] dari [Qatadah] dari [Mutharrif] dari [Bapaknya] berkata, Rasulullahi Shallallahu'alaihiwasallam bersabda: \"Barangsiapa berpuasa sepanjang puasa, maka dia tidak dianggap puasa dan berbuka.\""
            },
            {
                "number": 1008,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ وَحَجَّاجٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ وَقَالَ ابْنُ جَعْفَرٍ سَمِعْتُ قَتَادَةَ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ قَالَ حَجَّاجٌ فِي حَدِيثِهِ قَالَ سَمِعْتُ مُطَرِّفًا عَنْ أَبِيهِ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَنْتَ سَيِّدُ قُرَيْشٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّيِّدُ اللَّهُ فَقَالَ أَنْتَ أَفْضَلُهَا فِيهَا قَوْلًا وَأَعْظَمُهَا فِيهَا طَوْلًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَقُلْ أَحَدُكُمْ بِقَوْلِهِ وَلَا يَسْتَجِرَّنَّهُ الشَّيْطَانُ أَوْ الشَّيَاطِينُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dan [Hajjaj] berkata, telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dan [Ibnu Ja'far] berkata, saya mendengar [Qatadah] dari [Mutharrif bin Abdullah] [Hajjaj] berkata, dalam hadisnya, berkata, saya mendengar [Mutharrif] dari [Bapaknya] berkata, seorang laki-laki datang kepada Nabi Shallallahu'alaihiwasallam lalu berkata 'Anda adalah tuan Quraisy.' Lalu Nabi Shallallahu'alaihiwasallam bersabda: \"Tuan itu adalah Allah\", lalu dia berkata, anda adalah orang yang paling utama dan paling kaya dan paling mampu. Lalu Rasulullahi Shallallahu'alaihiwasallam bersabda: \"Hendaklah kalian berkata secara wajar dan jangan sampai setan menyesatkan kalian.\""
            },
            {
                "number": 1009,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامٍ يَعْنِي ابْنَ عُرْوَةَ قَالَ حَدَّثَنِي أَبِي عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ وَوَكِيعٌ قَالَ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي ثَوْبٍ وَاحِدٍ قَالَ وَكِيعٌ فِي بَيْتِ أُمِّ سَلَمَةَ فِي ثَوْبٍ قَدْ أَلْقَى طَرَفَيْهِ عَلَى عَاتِقِهِ فِي بَيْتِ أُمِّ سَلَمَةَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Hisyam] yaitu Ibnu 'Urwah berkata, telah menceritakan kepadaku [bapakku] dari ['Umar bin Abu Salamah] Dan [Waki'] berkata, telah menceritakan kepada kami [Hisyam] dari [Bapaknya] dari ['Umar bin Abu Salamah] berkata, Aku melihat Rasulullahi Shallallahu'alaihiwasallam sholat dengan memakai satu baju. Waki' berkata, pada waktu di rumah Ummu Salamah dengan kedua sisinya terjurai ke pundak beliau."
            },
            {
                "number": 1010,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ وَإِبْرَاهِيمُ بْنُ إِسْمَاعِيلَ عَنْ أَبِي وَجْزَةَ السَّعْدِيِّ عَنْ رَجُلٍ مِنْ مُزَيْنَةَ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِطَعَامٍ فَقَالَ يَا عُمَرُ قَالَ هِشَامٌ يَا بُنَيَّ سَمِّ اللَّهَ عَزَّ وَجَلَّ وَكُلْ بِيَمِينِكَ وَكُلْ مِمَّا يَلِيكَقَالَ فَمَا زَالَتْ أُكْلَتِي بَعْدُ",
                "id": "Telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Hisyam bin 'Urwah] dan [Ibrahim bin Isma'il] dari [Abu Wajzah As Sa'di] dari [seseorang dari Muzainah] dari ['Umar bin Abu Salamah] Nabi Shallallahu'alaihiwasallam diberi makanan, lalu beliau bersabda: \"Wahai 'Umar\". Hisyam berkata, Wahai anakku, Sebutlah nama Allah AzzaWaJalla, makanlah dengan tangan kananmu dan makanlah makanan yang terdekat olehmu. ('Umar bin Abu Salamah) berkata, Maka sejak itu aku makan dengan cara itu (cara yang diajarkan oleh Rasulullahi Shallallahu'alaihiwasallam)."
            },
            {
                "number": 1011,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِي وَجْزَةَ رَجُلٍ مِنْ بَنِي سَعْدٍ عَنْ رَجُلٍ مِنْ بَنِي مُزَيْنَةَ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا بُنَيَّ إِذَا أَكَلْتَ فَسَمِّ اللَّهَ وَكُلْ بِيَمِينِكَ وَكُلْ مِمَّا يَلِيكَقَالَ فَمَا زَالَتْ أُكْلَتِي بَعْدُ",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] berkata, telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [Abu Wajzah, seorang laki-laki dari Bani Sa'ad] dari [seorang laki-laki dari Bani Muzainah] dari ['Umar bin Abu Salamah] berkata, Rasulullahi Shallallahu'alaihiwasallam bersabda: \"Wahai anakku, jika kau makan maka sebutlah nama Allah, makanlah dengan tangan kananmu, makanlah pada yang terdekat denganmu\". ('Umar bin Abu Salamah) berkata, Maka sejak itu aku makan dengan cara itu (cara yang diajarkan oleh Rasulullahi Shallallahu'alaihiwasallam)."
            },
            {
                "number": 1012,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الْوَلِيدِ بْنِ كَثِيرٍ عَنْ وَهْبِ بْنِ كَيْسَانَ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ قَالَقَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا غُلَامُ سَمِّ اللَّهَ وَكُلْ بِيَمِينِكَ وَكُلْ مِمَّا يَلِيكَفَلَمْ تَزَلْ تِلْكَ طُعْمَتِي بَعْدُ وَكَانَتْ يَدِي تَطِيشُ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Al Walid bin Katsir] dari [Wahb bin Kaisan] dari ['Umar bin Abu Salamah] berkata, Nabi Shallallahu'alaihiwasallam bersabda kepadaku, wahai pemuda, sebutlah nama Allah, makanlah dengan tangan kananmu, makanlah yang terdekat, maka sejak saat itu cara makanku seperti itu, padahal sebelumnya tanganku bergerak-gerak."
            },
            {
                "number": 1013,
                "arab": "قَالَ حَدَّثَنَا سُفْيَانُ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي بَيْتِ أُمِّ سَلَمَةَ فِي ثَوْبٍ وَاحِدٍ مُشْتَمِلًا بِهِ",
                "id": "(Ahmad bin Hanbal) berkata, telah menceritakan kepada kami [Sufyan] dari [Hisyam] dari [Bapaknya] dari ['Umar bin Abu Salamah] berkata, saya melihat Rasulullahi Shallallahu'alaihiwasallam sholat di rumah Umu Salamah dengan memakai satu kain dengan menyelendangkannya."
            },
            {
                "number": 1014,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِّ اللَّهَ وَكُلْ بِيَمِينِكَ وَكُلْ مِمَّا يَلِيكَ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari ['Umar bin Abu Salamah] berkata, Rasulullahi Shallallahu'alaihiwasallam bersabdaku, \"sebutlah nama Allah, makanlah dengan tangan kananmu dan makanlah yang terdekat."
            },
            {
                "number": 1015,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ أَبِي إِسْحَاقَ قَالَ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي ثَوْبٍ وَاحِدٍ قَدْ خَالَفَ بَيْنَ طَرَفَيْهِ جَعَلَ طَرَفَيْهِ عَلَى عَاتِقَيْهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Abu Ishaq] berkata, telah menceritakan kepada kami [Al Laits bin Sa'ad] dari [Yahya bin Sa'id] dari [Abu Umamah bin Sahal] dari ['Umar bin Abu Salamah] berkata, saya melihat Rasulullahi Shallallahu'alaihiwasallam sholat dengan memakai satu pakaian dengan menyelempangkan pada kedua ujungnya pada kedua pundaknya."
            },
            {
                "number": 1016,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَاقَ قَالَ وَذَكَرَ يَحْيَى بْنُ سَعِيدِ بْنِ قَيْسٍ الْأَنْصَارِيِّ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ قَالَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي ثَوْبٍ وَاحِدٍ مُتَوَشِّحًا بِهِ",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [bapakku] dari [Ibnu Ishaq] berkata, dan [Yahya bin Sa'id bin Qais Al Anshari] menyebutkan dari [Abu Umamah bin Sahal] dari ['Umar bin Abu Salamah] berkata, sungguh saya melihat Rasulullah Shallallahu'alaihiwasallam sholat dengan satu kain dengan menyarungkannya (melingkarkannya)."
            },
            {
                "number": 1017,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ قَرَأْتُ عَلَى أَبِي مُوسَى بْنُ دَاوُدَ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ أَبِي وَجْزَةَ السَّعْدِيِّ قَالَ أَخْبَرَنِي عُمَرُ بْنُ أَبِي سَلَمَةَ قَالَدَعَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِطَعَامٍ يَأْكُلُهُ فَقَالَ ادْنُ فَسَمِّ اللَّهَ عَزَّ وَجَلَّ وَكُلْ بِيَمِينِكَ وَكُلْ مِمَّا يَلِيكَ",
                "id": "Telah menceritakan kepada kami Abdullah berkata, saya telah membaca di hadapan [Abu Musa bin Daud], berkata, telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Abu Wajzah As Sa'di] berkata, telah mengabarkan kepadaku ['Umar bin Abu Salamah] berkata, Rasulullahi Shallallahu'alaihiwasallam memanggilku untuk makan yang beliau sedang memakannya, lalu bersabda: \"Mendekatlah, lalu sebutlah nama Allah, makanlah dengan tangan kananmu dan yang terdekat darimu.\""
            },
            {
                "number": 1018,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ قَرَأْتُ عَلَى أَبِي : مَنْصُورُ بْنُ سَلَمَةَ الْخُزَاعِيُّ قَالَ أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلَالٍ قَالَ حَدَّثَنِي أَوْ أَخْبَرَنِي أَبُو وَجْزَةَ السَّعْدِيُّ أَنَّهُ سَمِعَ عُمَرَ بْنَ أَبِي سَلَمَةَ رَبِيبَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُدَعَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ادْنُ يَا بُنَيَّ فَسَمِّ وَكُلْ مِمَّا يَلِيكَحَدَّثَنَا لُوَيْنٌ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ أَبِي وَجْزَةَ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami Abdullah berkata, saya telah membaca di hadapan bapakku: [Manshur bin Salamah Al Khuza'i], berkata, telah menceritakan kepada kami [Sulaiman bin Bilal] berkata, telah menceritakan kepadaku atau telah mengabarkan kepadaku [Abu Wajzah As Sa'idi] telah mendengar ['Umar bin Abu Salamah, anak tiri Nabi Shallallahu'alaihiwasallam] berkata, Rasulullahi Shallallahu'alaihiwasallam memanggilku lalu bersabda: \"Mendekatlah wahai anakku, sebutlah nama Allah dan makanlah yang terdekat denganmu\". Telah menceritakan kepada kami [Luwain] berkata, telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Abu Wajzah] dari ['Umar bin Abu Salamah] dari Nabi Shallallahu'alaihiwasallam sama dengan yang di atasnya."
            },
            {
                "number": 1019,
                "arab": "حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنِي أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي أُمَيَّةَ الْمَخْزُومِيِّ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي بَيْتِ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَوْبٍ وَاحِدٍ مُتَوَشِّحًا مَا عَلَيْهِ غَيْرُهُ",
                "id": "Telah menceritakan kepada kami [Ya'qub] berkata, telah menceritakan kepadaku [bapakku] dari [Ibnu Ishaq] berkata, telah menceritakan kepadaku [Hisyam bin 'Urwah] dari [Bapaknya] dari [Abdullah bin Abdullah bin Abu Umayyah Al Makhzumy] berkata, Aku melihat Rasulullahi Shallallahu'alaihiwasallam sholat di rumah Ummu Salamah istri beliau, dengan memakai satu baju yang tertutup yang bagian atasnya tidak terdapat apapun selainnya."
            },
            {
                "number": 1020,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ أَنَّهُ قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ أَبِي أُمَيَّةَ أَنَّهُرَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي بَيْتِ أُمِّ سَلَمَةَ فِي ثَوْبٍ مُلْتَحِفًا بِهِ مُخَالِفًا بَيْنَ طَرَفَيْهِ",
                "id": "Telah menceritakan kepada kami [Husain bin Muhammad] berkata, telah menceritakan kepada kami [Ibnu Abu Az Zinad] dari [Bapaknya] dari ['Urwah bin Az Zubair] dia berkata, telah mengabarkan kepadaku [Abdullah bin Abdullah bin Abu Umayyah] dia melihat Rasulullahi Shallallahu'alaihiwasallam sholat di rumah Umu Salamah dengan memakai satu kain, yang beliau selimutkan dan kedua ujungnya diselendangkan."
            },
            {
                "number": 1021,
                "arab": "حَدَّثَنَا رَوْحٌ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ قَالَ حَدَّثَنِي ابْنُ عُمَرَ عَنْ أَبِيهِ عَنْ أُمِّ سَلَمَةَ أَنَّ أَبَا سَلَمَةَ حَدَّثَهُمْأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَصَابَتْ أَحَدَكُمْ مُصِيبَةٌ فَلْيَقُلْ{ إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ }اللَّهُمَّ عِنْدَكَ أَحْتَسِبُ مُصِيبَتِي فَأْجُرْنِي فِيهَا وَأَبْدِلْنِي بِهَا خَيْرًا مِنْهَافَلَمَّا قُبِضَ أَبُو سَلَمَةَ خَلَفَنِي اللَّهُ عَزَّ وَجَلَّ فِي أَهْلِي خَيْرًا مِنْهُ",
                "id": "Telah menceritakan kepada kami [Rauh] berkata, telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] berkata, telah menceritakan kepadaku [Ibnu 'Umar] dari [Bapaknya] dari [Ummu Salamah] bahwa [Abu Salamah] menceritakan kepada mereka Rasulullahi Shallallahu'alaihiwasallam bersabda: Jika diantara kalian yang terkena suatu musibah maka hendaklah berkata, \"INNA LILLAHI WAINNA ILAIHI ROJI'UN ALLAHUMMA 'INDAKA AHTASIBU MUSIBATI FA'JURNI FIIHA WABDILNI BIHA KHAIRAN MINHA\" (Segala sesuatu milik Allah dan hanya kepada Allah-lah kita kembali. Ya Allah Disisi-Mu aku mengharapkan pahala atas musibah yang menimpaku, dan berikanlah kepadaku balasan dan gantilah itu dengan sesuatu yang lebih baik). Ketika Abu Salamah meninggal, Allah AzzaWaJalla menggantinya dengan orang yang lebih baik (yaitu Rasulullahi Shallallahu'alaihiwasallam, pent) "
            },
            {
                "number": 1022,
                "arab": "حَدَّثَنَا يُونُسُ قَالَ حَدَّثَنَا لَيْثٌ يَعْنِي ابْنَ سَعْدٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ عَنْ عَمْرٍو يَعْنِي ابْنَ أَبِي عَمْرٍو عَنْ الْمُطَّلِبِ عَنْ أُمِّ سَلَمَةَ قَالَتْأَتَانِي أَبُو سَلَمَةَ يَوْمًا مِنْ عِنْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَقَدْ سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَوْلًا فَسُرِرْتُ بِهِ قَالَ لَا تُصِيبُ أَحَدًا مِنْ الْمُسْلِمِينَ مُصِيبَةٌ فَيَسْتَرْجِعَ عِنْدَ مُصِيبَتِهِ ثُمَّ يَقُولُ اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَاخْلُفْ لِي خَيْرًا مِنْهَا إِلَّا فُعِلَ ذَلِكَ بِهِ قَالَتْ أُمُّ سَلَمَةَ فَحَفِظْتُ ذَلِكَ مِنْهُ فَلَمَّا تُوُفِّيَ أَبُو سَلَمَةَ اسْتَرْجَعْتُ وَقُلْتُ اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَاخْلُفْنِي خَيْرًا مِنْهُ ثُمَّ رَجَعْتُ إِلَى نَفْسِي قُلْتُ مِنْ أَيْنَ لِي خَيْرٌ مِنْ أَبِي سَلَمَةَ فَلَمَّا انْقَضَتْ عِدَّتِي اسْتَأْذَنَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَدْبُغُ إِهَابًا لِي فَغَسَلْتُ يَدَيَّ مِنْ الْقَرَظِ وَأَذِنْتُ لَهُ فَوَضَعْتُ لَهُ وِسَادَةَ أَدَمٍ حَشْوُهَا لِيفٌ فَقَعَدَ عَلَيْهَا فَخَطَبَنِي إِلَى نَفْسِي فَلَمَّا فَرَغَ مِنْ مَقَالَتِهِ قُلْتُ يَا رَسُولَ اللَّهِ مَا بِي أَنْ لَا تَكُونَ بِكَ الرَّغْبَةُ فِيَّ وَلَكِنِّي امْرَأَةٌ فِيَّ غَيْرَةٌ شَدِيدَةٌ فَأَخَافُ أَنْ تَرَى مِنِّي شَيْئًا يُعَذِّبُنِي اللَّهُ بِهِ وَأَنَا امْرَأَةٌ دَخَلْتُ فِي السِّنِّ وَأَنَا ذَاتُ عِيَالٍ فَقَالَ أَمَّا مَا ذَكَرْتِ مِنْ الْغَيْرَةِ فَسَوْفَ يُذْهِبُهَا اللَّهُ عَزَّ وَجَلَّ مِنْكِ وَأَمَّا مَا ذَكَرْتِ مِنْ السِّنِّ فَقَدْ أَصَابَنِي مِثْلُ الَّذِي أَصَابَكِ وَأَمَّا مَا ذَكَرْتِ مِنْ الْعِيَالِ فَإِنَّمَا عِيَالُكِ عِيَالِي قَالَتْ فَقَدْ سَلَّمْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَزَوَّجَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَفَقَالَتْ أُمُّ سَلَمَةَ فَقَدْ أَبْدَلَنِي اللَّهُ بِأَبِي سَلَمَةَ خَيْرًا مِنْهُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yunus] berkata, telah menceritakan kepada kami [Laits] yaitu Ibnu Sa'ad dari [Yazid bin Abdullah bin Usamah bin Al Had] dari ['Amr] yaitu Ibnu Abu 'Amr, dari [Al Muthallib] dari [Umu Salamah] berkata, [Abu Salamah] datang kepadaku pada suatu hari dari sisi Rasulullahi Shallallahu'alaihiwasallam lalu berkata, saya mendengar dari Rasulullahi Shallallahu'alaihiwasallam suatu perkataan lalu saya merasa sangat senang dengannya. Beliau bersabda: \"Tidaklah seorang muslimpun yang terkena musibah lalu dia mengucapkan kalimat istirja' (ucapan INNA LILLAHI WA INNA ILAIHI RAJI'UN) ketika tertimpanya lalu membaca, 'Ya Allah, berilah pahala pada musibahku ini dan gantilah dengan yang lebih baik darinya' kecuali hal itu pasti akan terjadi.\" Umu Salamah berkata, lalu saya menghapal hal itu darinya. Tatkala Abu Salamah meninggal, saya mengucapkan kalimat istirja' dan saya membaca Ya Allah, berilah pahala pada musibahku dan gantilah dengan yang lebih baik darinya, lalu saya kembalikan kepada diriku, dan saya bertanya bagaimana ada yang lebih bagiku daripada Abu Salamah. Setelah iddahku habis, Rasulullahi Shallallahu'alaihiwasallam meminta ijin kepadaku, waktu itu saya sedang membersihkan kulit yang hendak disamak milikku, lalu saya mencuci tanganku dengan daun suatu pohon yang biasa dijadikan sebagai campuran dalam menyamak, lalu saya mengijinkan beliau. Saya meletakkan kepada beliau bantal dari kulit yang pinggirnya ada lipantannya, lalu kujadikan tempat duduk, lalu beliau melamarku. Tatkala beliau selesai berbicara, saya berkata, Wahai Rasulullah, bagaimana saya, saya tidak menyangka jika anda ada rasa cinta kepadaku, sayang, saya adalah wanita yang sangat cemburu, lalu saya takut jika anda melihat dariku suatu hal yang Allah menyiksaku karenanya, selain saya adalah wanita yang telah berumur, saya mempunyai banyak tanggungan. Lalu beliau bersabda: \"Apa yang kamu sebutkan berupa rasa cemburu niscaya Allah AzzaWaJalla akan menghilangkannya darimu. Hal lain yang kamu sebutkan dari umurmu maka saya juga mengalami apa yang kau alami, sedangkan apa yang kau sebutkan mengenai tanggungan maka tanggunganmu adalah tanggunganku. Lalu (Umu Salamah berkata, maka saya menerima Rasulullahi Shallallahu'alaihiwasallam. Lalu Rasulullahi Shallallahu'alaihiwasallam menikahinya. Lalu Umu Salamah berkata, sungguh Allah telah mengganti Abu Salamah dengan yang lebih baik darinya yaitu Rasulullahi Shallallahu'alaihiwasallam."
            },
            {
                "number": 1023,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا حَجَّاجٌ وَابْنُ أَبِي زَائِدَةَ قَالَ أَخْبَرَنَا حَجَّاجٌ عَنِ الْحَسَنِ بْنِ سَعْدٍ عَنِ ابْنِ عَبَّاسٍ قَالَ أَخْبَرَنِي أَبُو طَلْحَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَ الْحَجِّ وَالْعُمْرَةِ",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Hajjaj] dan [Ibnu Abu Za`idah] berkata, telah mengabarkan kepada kami [Hajjaj] dari [Al Hasan bin Sa'id] dari [Ibnu 'Abbas] berkata, telah menceritakan kepadaku [Abu Thalhah] Rasulullahi Shallallahu'alaihiwasallam pernah menghimpun antara pelaksanaan Haji dan Umrah."
            },
            {
                "number": 1024,
                "arab": "و قَالَ عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ يَقُولُ سَمِعْتُ أَبَا طَلْحَةَ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلَا صُورَةُ تَمَاثِيلَ",
                "id": "dan [Abdurrazzaq] berkata, telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] berkata, telah mengabarkan kepadaku ['ubaidhullah bin Abdullah bin 'Utbah] telah mendengar [Ibnu 'Abbas] berkata, saya mendengar [Abu Thalhah] berkata, saya mendengar Rasulullahi Shallallahu'alaihiwasallam bersabda: \"Malaikat tidak akan masuk rumah yang terdapat anjing dan gambar.\""
            },
            {
                "number": 1025,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أَبِي طَلْحَةَ قَالَلَمَّا صَبَّحَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْبَرَ وَقَدْ أَخَذُوا مَسَاحِيَهُمْ وَغَدَوْا إِلَى حُرُوثِهِمْ وَأَرْضِهِمْ فَلَمَّا رَأَوْا نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَهُ الْجَيْشُ رَكَضُوا مُدْبِرِينَ فَقَالَ نَبِيُّ اللَّهِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [Anas bin Malik] dari [Abu Thalhah] berkata, Tatkala Nabiyyullah Shallallahu'alaihiwasallam datang pada waktu pagi ke Khaibar, penduduknya telah mondar mandir dan berangkat ke ladang-ladang dan kebun mereka. Ketika mereka melihat Nabiyullah Shallallahu'alaihiwasallam bersama para pasukannya, mereka lari terbirit-birit hingga beliau bersabda: Allahu Akbar Allahu Akbar, kita jika telah memasuki bumi sebuah kaum, maka alangkah buruklah pagi harinya (keadaan) orang-orang yang mendapatkan peringatan itu.\""
            },
            {
                "number": 1026,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنَا أَبُو بَكْرِ بْنُ حَفْصٍ عَنِ الْأَغَرِّ عَنْ رَجُلٍ آخَرَ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَوَضَّئُوا مِمَّا غَيَّرَتْ النَّارُو قَالَ أَبُو بَكْرٍ يَعْنِي ابْنَ حَفْصٍ قَالَ حَدَّثَنَا الزُّهْرِيُّ عَنْ ابْنِ أَبِي طَلْحَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ فَقَالَ وَثَنَا شُعْبَةُ عَنِ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "id": "Telah menceritakan kepada kami [Abdushshamad] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah menceritakan kepada kami [Abu Bakar bin Hafsh] dari [Al A'ghar] dari [orang lain] dari [Abu Hurairah] Nabi Shallallahu'alaihiwasallam bersabda: \"Berwudlulah dari segala hal yang tersentuh api\". Dan [Abu Bakar] yaitu Ibnu Al Hafs, berkata, telah menceritakan kepada kami [Az Zuhri] dari [Ibnu Abu Thalhah] dari [Bapaknya] dari Nabi Shallallahu'alaihiwasallam sama dengan yang di atas. Lalu berkata, dan telah menceritakan kepada kami [Syu'bah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi Shallallahu'alaihiwasallam sama dengan yang di atas."
            },
            {
                "number": 1027,
                "arab": "حَدَّثَنَا حُسَيْنٌ فِي تَفْسِيرِ شَيْبَانَ عَنْ قَتَادَةَ قَالَ حَدَّثَ أَنَسُ بْنُ مَالِكٍ عَنْ أَبِي طَلْحَةَ قَالَصَبَّحَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْبَرَ وَقَدْ أَخَذُوا مَسَاحِيَهُمْ وَغَدَوْا إِلَى حُرُوثِهِمْ فَلَمَّا رَأَوْا نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَهُ الْجَيْشُ نَكَصُوا مُدْبِرِينَ فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ خَرِبَتْ خَيْبَرُ إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ قَالَحَدَّثَنَا يُونُسُ قَالَ حَدَّثَنَا شَيْبَانُ عَنْ قَتَادَةَ قَوْلَهُ عَزَّ وَجَلَّ{ فَإِذَا نَزَلَ بِسَاحَتِهِمْ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ }قَالَ حَدَّثَ أَنَسُ بْنُ مَالِكٍ عَنْ أَبِي طَلْحَةَ قَالَ صَبَّحَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْبَرَ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Husain] dalam tafsir [Syaiban], dari [Qatadah] berkata, [Anas bin Malik] menceritakan dari [Abu Thalhah] berkata, Nabiyullah Shallallahu'alaihiwasallam datang pada waktu pagi di Khaibar, para penduduknya telah berangkat ke ladang-ladang dan kebun mereka. Ketika mereka melihat Nabiyullah Shallallahu'alaihiwasallam bersama para pasukannya, mereka lari terbirit-birit hingga beliau bersabda: Allahu Akbar Allahu Akbar, telah tumbang Khaibar, kami jika memasuki sebuah halaman kaum, maka alangkah buruklah pagi harinya (keadaan) orang-orang yang mendapatkan peringatan itu.\" (Ahmad bin Hanbal) berkata, telah menceritakan kepada kami [Yunus] berkata, telah menceritakan kepada kami [Syaiban] dari [Qatadah] pada firman-Nya AzzaWaJalla, 'Maka apabila siksaan itu turun dihalaman mereka, Maka amat buruklah pagi hari yang dialami oleh orang-orang yang diperingatkan itu' Dia berkata, [Anas bin Malik] menceritakan dari [Abu Thalhah] berkata, Nabiyullah Shallallahu'alaihiwasallam datang pada saat masih pagi, ke Khaibar, seperti pada hadis di atas."
            },
            {
                "number": 1028,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ عَنْ أَبِي طَلْحَةَيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ صُورَةٌ وَلَا كَلْبٌ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['ubaidhullah] dari [Ibnu 'Abbas] dari [Abu Thalhah] sampai padanya dari Nabi Shallallahu'alaihiwasallam bersabda: \"Malaikat tidak akan masuk rumah yang terdapat gambar dan anjing\"."
            },
            {
                "number": 1029,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ قَالَ أَخْبَرَنَا حَجَّاجٌ عَنِ الْحَسَنِ بْنِ سَعْدٍ عَنِ ابْنِ عَبَّاسٍ قَالَ أَنْبَأَنِي أَبُو طَلْحَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَ حَجَّةٍ وَعُمْرَةٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Zakariya bin Abu Za`idah] berkata, telah mengabarkan kepada kami [Hajjaj] dari [Al Hasan bin Sa'id] dari [Ibnu 'Abbas] berkata, telah memberitakan kepada kami [Abu Thalhah] Rasulullahi Shallallahu'alaihiwasallam pernah mnghimpun antara haji dan umrah."
            },
            {
                "number": 1030,
                "arab": "حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أَبِي طَلْحَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا غَلَبَ قَوْمًا أَحَبَّ أَنْ يُقِيمَ بِعَرْصَتِهِمْ ثَلَاثًا",
                "id": "Telah menceritakan kepada kami [Mu'adz bin Mu'adz] berkata, telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [Anas bin Malik] dari [Abu Thalhah] Rasulullahi Shallallahu'alaihiwasallam jika telah mengalahkan suatu kaum, maka beliau senang untuk tetap bermukim di daerah tersebut selama tiga hari."
            },
            {
                "number": 1031,
                "arab": "حَدَّثَنَا يُونُسُ حَدَّثَنَا شَيْبَانُ وَحُسَيْنٌ فِي تَفْسِيرِ شَيْبَانَ عَنْ قَتَادَةَ قَالَ وَحَدَّثَنَا أَنَسُ بْنُ مَالِكٍ أَنَّ أَبَا طَلْحَةَ قَالَغَشِيَنَا النُّعَاسُ وَنَحْنُ فِي مَصَافِّنَا يَوْمَ بَدْرٍ قَالَ أَبُو طَلْحَةَ وَكُنْتُ فِيمَنْ غَشِيَهُ النُّعَاسُ يَوْمَئِذٍ فَجَعَلَ سَيْفِي يَسْقُطُ مِنْ يَدِي وَآخُذُهُ وَيَسْقُطُ وَآخُذُهُ",
                "id": "Telah menceritakan kepada kami [Yunus] telah menceritakan kepada kami [Syaiban] dan [Husain] dalam Tafsir [Syaiban], dari [Qatadah] berkata, dan telah menceritakan kepada kami [Anas bin Malik] [Abu Thalhah] berkata, kami mendapati rasa kantuk yang sangat pada waktu kita dalam barisan perang Badar, lalu Abu Thalhah berkata, saya termasuk yang mengalami rasa kantuk yang sangat pada hari itu sehingga pedangku terjatuh dari tanganku, lalu aku mengambilnya, lalu jatuh kembali dan kembali aku mengambilnya."
            },
            {
                "number": 1032,
                "arab": "حَدَّثَنَا رَوْحٌ قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أَبِي طَلْحَةَ قَالَلَمَّا صَبَّحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْبَرَ وَقَدْ أَخَذُوا مَسَاحِيَهُمْ وَغَدَوْا إِلَى حُرُوثِهِمْ وَأَرْضِيهِمْ فَلَمَّا رَأَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَهُ الْجَيْشُ نَكَصُوا مُدْبِرِينَ فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ{ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ }",
                "id": "Telah menceritakan kepada kami [Rauh] berkata, telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [Anas bin Malik] dari [Abu Thalhah] berkata, Tatkala Rasulullahi Shallallahu'alaihiwasallam datang pada waktu pagi ke Khaibar, penduduknya telah mondar mandir dan berangkat ke ladang-ladang dan kebun mereka. Ketika mereka melihat Nabi Shallallahu'alaihiwasallam bersama para pasukannya, mereka lari terbirit-birit hingga Nabiyullah Shallallahu'alaihiwasallam bersabda: Allahu Akbar, Allahu Akbar, jika kami telah memasuki halaman sebuah kaum, maka alangkah buruklah pagi harinya (keadaan) orang-orang yang mendapatkan peringatan itu.\""
            },
            {
                "number": 1033,
                "arab": "حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ قَالَ أَخْبَرَنَا زَكَرِيَّا بْنُ إِسْحَاقَ قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ وَكَانَتْ لَهُ صُحْبَةٌ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُحْسِنْ إِلَى جَارِهِ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ",
                "id": "Telah menceritakan kepada kami [Rauh bin 'Ubadah] berkata, telah mengabarkan kepada kami [Zakariya bin Ishaq] berkata, telah menceritakan kepada kami ['Amr bin Dinar] dari [Nafi' bin Jubair bin Muth'im] dari [Abu Syuraih Al Khuza'i], dia berkata, Aku mendengar Rasulullahi Shallallahu'alaihiwasallam bersabda: \"Barangsiapa yang beriman kepada Allah dan Hari Akhir, hendaklah dia memuliakan tamunya. Barangsiapa yang beriman kepada Allah dan Hari Akhir hendaklah ia berbuat baik kepada tetangganya, dan barangsiapa yang beriman kepada Allah dan Hari Akhir, hendaklah ia berkata baik atau diam.\""
            },
            {
                "number": 1034,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الضِّيَافَةُ ثَلَاثَةُ أَيَّامٍ وَجَائِزَتُهُ يَوْمٌ وَلَيْلَةٌ وَلَا يَحِلُّ لِلرَّجُلِ أَنْ يُقِيمَ عِنْدَ أَحَدٍ حَتَّى يُؤْثِمَهُ قَالُوا يَا رَسُولَ اللَّهِ فَكَيْفَ يُؤْثِمُهُ قَالَ يُقِيمُ عِنْدَهُ وَلَيْسَ لَهُ شَيْءٌ يَقْرِيهِ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Abdul Hamid bin Ja'far] dari [Sa'id bin Abu Sa'id Al Maqburi] dari [Abu Syuraih Al Khuza'i] berkata, Rasulullahi Shallallahu'alaihiwasallam bersabda: \"Hak jamuan bertamu itu selama tiga hari, sedang yang wajar adalah sehari semalam, dan tidak halal bagi seseorang untuk tinggal pada seseorang sampai dia menjadikan dia berdosa\". Mereka bertanya, Wahai Rasulullah, bagaimana dia membuat dosa terhadapnya?. Beliau bersabda: \"Dia tinggal bersama seseorang dan seseorang itu tidak memiliki apapun untuk menjamunya.\""
            },
            {
                "number": 1035,
                "arab": "حَدَّثَنَا حَجَّاجٌ وَرَوْحٌ قَالَا حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي شُرَيْحٍ الْكَعْبِيِّ وَقَالَ رَوْحٌ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَاللَّهِ لَا يُؤْمِنُ وَاللَّهِ لَا يُؤْمِنُ وَاللَّهِ لَا يُؤْمِنُ قَالَهَا ثَلَاثَ مَرَّاتٍ قَالُوا وَمَا ذَاكَ يَا رَسُولَ اللَّهِ قَالَ الْجَارُ لَا يَأْمَنُ الْجَارُ بَوَائِقَهُ قَالُوا وَمَا بَوَائِقُهُ قَالَ شَرُّهُ",
                "id": "Telah menceritakan kepada kami [Hajjaj] dan [Rauh] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi`b] dari [Sa'id Al Maqburi] dari [Abu Syuraih Al Ka'b'i] dan [Rauh] berkata, dari [Abu Hurairah] Nabi Shallallahu'alaihiwasallam bersabda: \"Demi Allah tidaklah beriman seseorang, Demi Allah tidaklah beriman seseorang, Demi Allah tidaklah beriman seseorang\" beliau mengulanginya tiga kali. Mereka bertanya, \"Apakah hal tersebut wahai Rasulullah?\" (Rasulullahi Shallallahu'alaihiwasallam) menjawab, \"Yaitu seorang tetangga yang tidak merasa nyaman dengan tetangganya karena cobaan yang dia terima\", lalu mereka berkata, Apakah cobaan tersebut? Beliau bersabda: \"Keburukannya\"."
            },
            {
                "number": 1036,
                "arab": "حَدَّثَنَا حَجَّاجٌ قَالَ حَدَّثَنَا لَيْثٌ قَالَ حَدَّثَنِي سَعِيدٌ يَعْنِي الْمَقْبُرِيَّ عَنْ أَبِي شُرَيْحٍ الْعَدَوِيِّأَنَّهُ قَالَ لِعَمْرِو بْنِ سَعِيدٍ وَهُوَ يَبْعَثُ الْبُعُوثَ إِلَى مَكَّةَ ائْذَنْ لِي أَيُّهَا الْأَمِيرُ أُحَدِّثْكَ قَوْلًا قَامَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْغَدَ مِنْ يَوْمِ الْفَتْحِ سَمِعَتْهُ أُذُنَايَ وَوَعَاهُ قَلْبِي وَأَبْصَرَتْهُ عَيْنَايَ حِينَ تَكَلَّمَ بِهِ أَنْ حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ إِنَّ مَكَّةَ حَرَّمَهَا اللَّهُ وَلَمْ يُحَرِّمْهَا النَّاسُ فَلَا يَحِلُّ لِامْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ يَسْفِكَ بِهَا دَمًا وَلَا يَعْضِدَ بِهَا شَجَرَةً فَإِنْ أَحَدٌ تَرَخَّصَ لِقِتَالِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا فَقُولُوا إِنَّ اللَّهَ عَزَّ وَجَلَّ أَذِنَ لِرَسُولِهِ وَلَمْ يَأْذَنْ لَكُمْ إِنَّمَا أَذِنَ لِي فِيهَا سَاعَةً مِنْ نَهَارٍ وَقَدْ عَادَتْ حُرْمَتُهَا الْيَوْمَ كَحُرْمَتِهَا بِالْأَمْسِ وَلْيُبَلِّغْ الشَّاهِدُ الْغَائِبَ",
                "id": "Telah menceritakan kepada kami [Hajjaj] berkata, telah menceritakan kepada kami [Laits] berkata, telah menceritakan kepadaku [Sa'id yaitu Al Maqburi] dari [Abu Syuraih Al 'Adawi] dia berkata, kepada 'Amr bin Sa'id yang mengutus utusan ke Makkah, Wahai Amir (pemimpin, pent) ijinkanlah diriku untuk menceritakan kepadamu sebuah sabda Rasulullahi Shallallahu'alaihiwasallam yang beliau sampaikan ketika beliau berdiri pada satu hari setelah Penaklukan Makkah, yang aku mendengar hadits tersebut dengan kedua telingaku, dan aku memperhatikanya dengan segenap hatiku serta melihatnya dengan kedua bola mataku ketika beliau bersabda: yang beliau memuji Allah dan memujanya, lalu beliau bersabda: \"Sesungguhnya Allah-lah yang telah mengharamkan Makkah, maka tidak diperbolehkan barangsiapa yang beriman kepada Allah dan hari akhir untuk menumpahkan darah di tanah Makah dan menebang pohonnya, maka barangsiapa yang merasa bolehnya untuk berperang di tanah Makkah karena perang yang di lakukan Rasulullahi Shallallahu'alaihiwasallamdi atasnya, maka katakanlah kepadanya bahwasanya Allah mengizinkan Rasul-Nya dan bukan kepada kalian. Sesungguhnya Allah AzzaWaJalla mengizinkan hanya sementara waktu pada waktu siang, dan keharamannya (Makkah, pent) telah kembali hari ini sebagaimana keharamannya pada hari kemarin. Bagi yang menyaksikan, tolong sampaikanlah hal ini kepada yang tidak hadir\""
            }
        ]
    }
}