{
    "status": true,
    "data": {
        "start": 297,
        "end": 444,
        "total": 148,
        "book": "ahmad",
        "hadits": [
            {
                "number": 297,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا شُعْبَةُ قَالَ زُبَيْدٌ وَسَلَمَةُ أَخْبَرَانِي أَنَّهُمَا سَمِعَا ذَرًّا عَنِ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ وَكَانَ إِذَا سَلَّمَ يَقُولُ سُبْحَانَ الْمَلِكِ الْقُدُّوسِ ثَلَاثًا يَرْفَعُ صَوْتَهُ بِالْآخِرَةِ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Syu'bah] [Zubaid] dan [Salamah] berkata; telah mengabarkan kepadaku keduanya telah mendengar [Dzar] dari [Ibnu Abdurrahman bin Abaz] dari [Bapaknya] dari Nabi Shallallahu'alaihiwasallam membaca dalam sholat witirnya dengan Sucikanlah nama Tuhanmu yang Maha Tingi, dan Katakanlah: \"Hai orang-orang kafir dan Katakanlah: \"Dia-lah Allah, yang Maha Esa. dan jika telah selesai salam beliau bersabda: \"Maha Suci Raja Yang Maha Suci\" beliau membacanya tiga kali dengan mengangkat suaranya pada terakhirnya."
            },
            {
                "number": 298,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ عَزْرَةَ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ وَيَقُولُ إِذَا سَلَّمَ سُبْحَانَ الْمَلِكِ الْقُدُّوسِ ثَلَاثَ مِرَارٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari ['Azrah] dari [Sa'id bin Abdurrahman bin Abza] dari [Bapaknya] Rasulullah Shallallahu'alaihiwasallam membaca dalam sholat witirnya dengan Sucikanlah nama Tuhanmu yang Maha Tingi, dan Katakanlah: \"Hai orang-orang kafir dan Katakanlah: \"Dia-lah Allah, yang Maha Esa. jika telah selesai salam beliau bersabda: \"Maha Suci Raja Yang Maha Suci\" tiga kali."
            },
            {
                "number": 299,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا سُفْيَانُ عَنْ زُبَيْدٍ عَنْ ذَرِّ بْنِ عَبْدِ اللَّهِ الْمُرْهِبِيِّ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِقَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ وَإِذَا أَرَادَ أَنْ يَنْصَرِفَ مِنْ الْوِتْرِ قَالَ سُبْحَانَ الْمَلِكِ الْقُدُّوسِ ثَلَاثَ مَرَّاتٍ ثُمَّ يَرْفَعُ صَوْتَهُ فِي الثَّالِثَةِ",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] berkata; telah mengabarkan kepada kami [Sufyan] dari [Zubaid] dari [Dzar bin Abdullah Al Murhibi] dari [Sa'id bin Abdurrahman bin Abza] dari [Bapaknya] berkata; Nabi Shallallahu'alaihiwasallam sholat witir dengan Sucikanlah nama Tuhanmu yang Maha Tingi (Surat Al a'la), dan Katakanlah: \"Hai orang-orang kafir (Surat alkafirun) dan Katakanlah: \"Dia-lah Allah, yang Maha Esa (surat Al ikhlas).. Jika hendak meninggalkan witirnya beliau bersabda: \"Maha Suci, Raja Yang Maha Suci\" tiga kali. Lalu mengangkat suaranya pada kali ketiganya."
            },
            {
                "number": 300,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ زُبَيْدٍ عَنْ ذَرٍّ الْهَمْدَانِيِّ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى الْخُزَاعِيِّ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ وَيَقُولُ إِذَا جَلَسَ فِي آخِرِ صَلَاتِهِ سُبْحَانَ الْمَلِكِ الْقُدُّوسِ ثَلَاثًا يَمُدُّ بِالْآخِرَةِ صَوْتَهُ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan] dari [Zubaid] dari [Dzar Al Hamdani] dari [Sa'id bin Abdurrahman bin Abza Al Khuza'i] dari [Bapaknya] Nabi Shallallahu'alaihiwasallam membaca dalam sholat witirnya dengan Sucikanlah nama Tuhanmu yang Maha Tinggi (surat Al a'la), dan Katakanlah: \"Hai orang-orang kafir (surat alkafirun) dan Katakanlah: \"Dia-lah Allah, yang Maha Esa (surat Al ikhlash). dan membaca jika beliau duduk pada akhir sholatnya, \"Maha Suci, Raja Yang Maha Suci\" membacanya tiga kali, dengan memanjangkan terakhir kalinya."
            },
            {
                "number": 301,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ إِذَا أَصْبَحَ وَإِذَا أَمْسَى أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ وَعَلَى كَلِمَةِ الْإِخْلَاصِ وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا وَمَا كَانَ مِنْ الْمُشْرِكِينَ",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Salamah] dari [Abdullah bin Abdurrahman bin Abza] dari [Bapaknya] Nabi Shallallahu'alaihiwasallam jika masuk waktu pagi atau masuk waktu sore memanjatkan doa \"Di waktu pagi kami memegang teguh agama Islam, diatas kalimat ikhlas, agama Nabi kita Muhammad Shallallahu'alaihiwasallam dan agama bapak kami Ibrahim, di atas jalan yang lurus, dan tidak tergolong orang-orang musrik.\""
            },
            {
                "number": 302,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ حَدَّثَنَا سَلَمَةُ بْنُ كُهَيْلٍ عَنْ ذَرٍّ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي الْفَجْرِ فَتَرَكَ آيَةً فَلَمَّا صَلَّى قَالَ أَفِي الْقَوْمِ أُبَيُّ بْنُ كَعْبٍ قَالَ أُبَيٌّ يَا رَسُولَ اللَّهِ نُسِخَتْ آيَةُ كَذَا وَكَذَا أَوْ نُسِّيتَهَا قَالَ نُسِّيتُهَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] telah menceritakan kepada kami [Salamah bin Kuhail] dari [Dzar] dari [Sa'id bin Abdurrahman bin Abza] dari [Bapaknya] Nabi Shallallahu'alaihiwasallam sholat fajar, dan meninggalkan satu ayat (dalam bacaanya). Tatkala selesai sholat, beliau bersabda: \"Apakah di antara kalian ada Ubbay bin Ka'b? Ubbay berkata; Wahai Rasulullah apakah ayat begini telah dihapus) atau anda telah lupa? (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Saya telah lupa.\""
            },
            {
                "number": 303,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ حَدَّثَنَا قَتَادَةُ عَنْ زُرَارَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَىأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] telah menceritakan kepada kami [Qatadah] dari [Zurarah] dari [Abdurrahman bin Abza] Nabi Shallallahu'alaihiwasallam membaca dalam sholat witirnya dengan Sucikanlah nama Tuhanmu yang Maha Tinggi (surat Al a'la)."
            },
            {
                "number": 304,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ حَدَّثَنِي جَمِيلٌ أَخْبَرَنَا وَمُجَاهِدٌ عَنْ نَافِعِ بْنِ عَبْدِ الْحَارِثِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ سَعَادَةِ الْمَرْءِ الْجَارُ الصَّالِحُ وَالْمَرْكَبُ الْهَنِيءُ وَالْمَسْكَنُ الْوَاسِعُحَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ حَبِيبٍ عَنْ جَمِيلٍ عَنْ نَافِعِ بْنِ عَبْدِ الْحَارِثِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Habib bin Abu Tsabit] telah menceritakan kepadaku [Jamil] telah mengabarkan kepada kami [Mujahid] dari [Nafi' bin Abdul Harits] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Termasuk kebahagiaan seseorang adalah tetangga yang baik, kendaraan yang menyenangkan dan tempat tinggal yang luas.\" Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Habib] dari [Jamil] dari [Nafi' bin Abdul Harits] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: lalu disebutkan sama."
            },
            {
                "number": 305,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ قَالَ قَالَ نَافِعُ بْنُ عَبْدِ الْحَارِثِخَرَجْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى دَخَلَ حَائِطًا فَقَالَ لِي أَمْسِكْ عَلَيَّ الْبَابَ فَجَاءَ حَتَّى جَلَسَ عَلَى الْقُفِّ وَدَلَّى رِجْلَيْهِ فِي الْبِئْرِ فَضُرِبَ الْبَابُ قُلْتُ مَنْ هَذَا قَالَ أَبُو بَكْرٍ قُلْتُ يَا رَسُولَ اللَّهِ هَذَا أَبُو بَكْرٍ قَالَ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ قَالَ فَأَذِنْتُ لَهُ وَبَشَّرْتُهُ بِالْجَنَّةِ قَالَ فَدَخَلَ فَجَلَسَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْقُفِّ وَدَلَّى رِجْلَيْهِ فِي الْبِئْرِ ثُمَّ ضُرِبَ الْبَابُ فَقُلْتُ مَنْ هَذَا فَقَالَ عُمَرُ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا عُمَرُ قَالَ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ قَالَ فَأَذِنْتُ لَهُ وَبَشَّرْتُهُ بِالْجَنَّةِ قَالَ فَدَخَلَ فَجَلَسَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْقُفِّ وَدَلَّى رِجْلَيْهِ فِي الْبِئْرِ قَالَ ثُمَّ ضُرِبَ الْبَابُ فَقُلْتُ مَنْ هَذَا قَالَ عُثْمَانُ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا عُثْمَانُ قَالَ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ مَعَهَا بَلَاءٌ فَأَذِنْتُ لَهُ وَبَشَّرْتُهُ بِالْجَنَّةِ فَجَلَسَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْقُفِّ وَدَلَّى رِجْلَيْهِ فِي الْبِئْرِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Muhammad bin 'Amr] dari [Abu Salamah] berkata; [Nafi' bin Abdul Harits] berkata; Saya berangkat bersama Rasulullah Shallallahu'alaihiwasallam hingga memasuki sebuah bangunan. Lalu beliau bersabda kepadaku, \"Tolong jagalah pintunya!.\" Beliau masuk lalu duduk di tepi kolam, lalu menjulurkan kedua kakinya pada kolam. Lantas ada yang mengetuk pintu, saya bertanya, siapa ini? ia berkata 'Abu Bakar.' Saya (Nafi' bin Abdul Harits Radliyallahu'anhu) berkata 'wahai Rasulullah itu Abu Bakar.' Beliau bersabda: \"Biarkan dia masuk, berilah dia kabar gembira dengan surga.\" (Nafi' bin Abdul Harits Radliyallahu'anhu) berkata; saya mengijinkannya dan saya beri kabar gembira surga, lalu (Abu Bakar radliyallahu'anhu) masuk dan duduk bersama Rasulullah Shallallahu'alaihiwasallam di tepi kolam dan ikut menjulurkan kedua kakinya pada kolam. Lalu ada yang mengetuk pintu, saya bertanya, siapa itu? Dia berkata; 'Umar. Saya berkata; Wahai Rasulullah itu adalah 'Umar. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Biarkan dia, berilah dia kabar gembira dengan surga \" (Nafi' bin Abdul Harits Radliyallahu'anhu) berkata; saya mengijinkan dia masuk dan memberinya kabar gembira surga, hingga ('Umar radliyallahu'anhu) masuk dan duduk bersama Rasulullah Shallallahu'alaihiwasallam di tepi kolam dan ikut menurunkan kedua kakinya pada kolam. Lalu ada yang mengetuk pintu lagi, maka saya bertanya, Siapa itu? Dia menjawab, 'Utsman. Saya berkata; wahai Rasulullah ini adalah 'Utsman. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Biarkan dia masuk, berilah ia kabar gembira dengan surga, dia akan mendapatkan ujian\", maka saya mengijinkannya masuk dan memberinya kabar genbira dengan surga, hingga ia duduk bersama Rasulullah Shallallahu'alaihiwasallam di tepi kolam dan ikut menjulurkan kedua kakinya pada kolam."
            },
            {
                "number": 306,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا وُهَيْبٌ حَدَّثَنِي مُوسَى بْنُ عُقْبَةَ قَالَ سَمِعْتُ أَبَا سَلَمَةَ يُحَدِّثُ وَلَا أَعْلَمُهُ إِلَّا عَنْ نَافِعِ بْنِ عَبْدِ الْحَارِثِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ حَائِطًا مِنْ حَوَائِطِ الْمَدِينَةِ فَجَلَسَ عَلَى قُفِّ الْبِئْرِ فَجَاءَ أَبُو بَكْرٍ يَسْتَأْذِنُ فَقَالَ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ ثُمَّ جَاءَ عُمَرُ يَسْتَأْذِنُ فَقَالَ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ ثُمَّ جَاءَ عُثْمَانُ يَسْتَأْذِنُ فَقَالَ ائْذَنْ لَهُ وَبَشِّرْهُ بِالْجَنَّةِ وَسَيَلْقَى بَلَاءً",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepadaku [Musa bin 'Uqbah] berkata; saya telah mendengar [Abu Salamah] menceritakan dan saya tidak mengetahuinya kecuali dari [Nafi' bin Abdul Harits] Pernah Rasulullah Shallallahu'alaihiwasallam masuk ke sebuah kebun yang terletak di Madinah, lalu beliau duduk di tepi sumur, lalu datanglah Abu Bakar meminta ijin. Beliau bersabda: \"Ijinkanlah dia dan berikan kabar gembira dengan surga.\" Lalu datanglah 'Umar meminta ijin juga. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Ijinkanlah dia dan berikan kabar gembira dengan surga.\" Lalu datang 'Utsman meminta ijin pula. Lalu (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Ijinkanlah dia dan berikan kabar gembira dengan surga dan dia akan mendapatkan cobaan.\""
            },
            {
                "number": 307,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنِي ابْنُ جُرَيْجٍ حَدَّثَنِي عُثْمَانُ بْنُ السَّائِبِ مَوْلَاهُمْ عَنْ أَبِيهِ السَّائِبِ مَوْلَى أَبِي مَحْذُورَةَ وَعَنْ أُمِّ عَبْدِ الْمَلِكِ بْنِ أَبِي مَحْذُورَةَ أَنَّهُمَا سَمِعَاهُ مِنْ أَبِي مَحْذُورَةَ قَالَ أَبُو مَحْذُورَةَخَرَجْتُ فِي عَشَرَةِ فِتْيَانٍ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ أَبْغَضُ النَّاسِ إِلَيْنَا فَأَذَّنُوا فَقُمْنَا نُؤَذِّنُ نَسْتَهْزِئُ بِهِمْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ائْتُونِي بِهَؤُلَاءِ الْفِتْيَانِ فَقَالَ أَذِّنُوا فَأَذَّنُوا فَكُنْتُ أَحَدَهُمْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَمْ هَذَا الَّذِي سَمِعْتُ صَوْتَهُ اذْهَبْ فَأَذِّنْ لِأَهْلِ مَكَّةَ فَمَسَحَ عَلَى نَاصِيَتِهِ وَقَالَ قُلْ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ مَرَّتَيْنِ وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ مَرَّتَيْنِ ثُمَّ ارْجِعْ فَاشْهَدْ أَنْ لَا إِلَهَ إِلَّا اللَّهُ مَرَّتَيْنِ وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ مَرَّتَيْنِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الْفَلَاحِ حَيَّ عَلَى الْفَلَاحِ مَرَّتَيْنِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُ وَإِذَا أَذَّنْتَ بِالْأَوَّلِ مِنْ الصُّبْحِ فَقُلْ الصَّلَاةُ خَيْرٌ مِنْ النَّوْمِ الصَّلَاةُ خَيْرٌ مِنْ النَّوْمِ وَإِذَا أَقَمْتَ فَقُلْهَا مَرَّتَيْنِ قَدْ قَامَتْ الصَّلَاةُ قَدْ قَامَتْ الصَّلَاةُ أَسَمِعْتَقَالَ وَكَانَ أَبُو مَحْذُورَةَ لَا يَجُزُّ نَاصِيَتَهُ وَلَا يُفَرِّقُهَا لِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَسَحَ عَلَيْهَا حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عُثْمَانُ بْنُ السَّائِبِ عَنْ أُمِّ عَبْدِ الْمَلِكِ بْنِ أَبِي مَحْذُورَةَ عَنْ أَبِي مَحْذُورَةَ قَالَ لَمَّا رَجَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى حُنَيْنٍ خَرَجْتُ عَاشِرَ عَشَرَةٍ فَذَكَرَ الْحَدِيثَ إِلَّا أَنَّهُ قَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ مَرَّتَيْنِ فَقَطْ و قَالَ رَوْحٌ أَيْضًا مَرَّتَيْنِ",
                "id": "Telah menceritakan kepada kami [Abdurrozaq] telah mengabarkan kepadaku [Ibnu Juraij] telah menceritakan kepadaku ['Utsman bin As-Sa'ib] budak mereka, dari Bapaknya [As-Sa'ib], budak Bani Mahdzurah dan dari [Ummu Abdul Malik bin Abu Mahdzurah] keduanya mendengarnya dari [Abu Mahdzurah] Abu Mahdzurah berkata; \"Saya keluar dengan sepuluh pemuda bersama Nabi Shallallahu'alaihiwasallam yang saat itu beliau adalah orang yang paling kami benci. Lalu mereka mengumandangkan adzan pada kami. Kami berdiri dan mengumandangkan adzan seraya menghinanya. Nabi Shallallahu'alaihiwasallam bersabda: \"Datangkan para pemuda itu kepadaku\" Lalu beliau bersabda: \"Adzanlah kalian\" lalu mereka mengkumandangkan adzan, saya adalah salah satu di antara mereka. Nabi Shallallahu'alaihiwasallam bersabda: \"Ya. Inilah dia suara yang saya dengar. Pergilah dan kumandangkanlah adzan kepada penduduk Makkah\", lalu beliau mengusap ubun-ubunnya (Abu Mahdzurah) dan bersabda: \"Ucapkanlah: ALLAHU AKBAR ALLAHU AKBAR, ALLAHU AKBAR ALLAHU AKBAR, ASYHADU AN LAA ILAAHA ILLA ALLAH dua kali, dan ASYHADU ANNA MUHAMMADAR RASULULLAH dua kali, kemudian ulangilah (dengan suara pelan) ASYHADU AN LAA ILAAHA ILLA ALLAH dua kali, dan ASYHADU ANNA MUHAMMADAR RASULULLAH dua kali, HAYYA 'ALAS SHOLAAH, HAYYA 'ALAS SHOLAAH, HAYYA 'ALAL FALAAH HAYYA 'ALAL FALAAH dua kali, ALLAHU AKBAR ALLAHU AKBAR, LAA ILAAHA ILLA ALLAH, dan jika kamu adzan pada awal subuh maka ucapkanlah: ASSOLAATU KHOIRUN MINAN NAUM, ASsholatU KHOIRUN MINAN NAUM, Jika mengiqomatinya maka ucapkan dua kali: QOD QOOMATIS SHOLAAAH QOD QOOMATIS SHOLAAH, apakah kamu mendengar? (Ibnu Abi Mahdzurah Radliyallahu'anhu) berkata; maka Abu Mahdzurah tidak pernah mencukur rambut ubun-ubunnya serta memotongnya karena Rasulullah Shallallahu'alaihiwasallam telah mengusapnya. Telah menceritakan kepada kami [Muhammad bin Bakar] telah mengabarkan kepada kami [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Utsman bin As-Sa'ib] dari [Ummu Abdul Malik bin Abi Mahdzurah] dari [Abu Mahdzurah] dia berkata; tatkala Nabi Shallallahu'alaihiwasallam kembali ke Hunain, kami keluar bersepuluh, lalu dia menyebutkan Hadits yang sama, hanya saja dia menyebutkan bahwa Rasulullah Shallallahu'alaihiwasallam mengucapkan ALLAHU AKBAR ALLAHU AKBAR dua kali saja, dan Rauh juga berkata dua kali."
            },
            {
                "number": 308,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي جَعْفَرٍ قَالَ عَبْدُ الرَّحْمَنِ لَيْسَ هُوَ الْفَرَّاءَ عَنْ أَبِي سَلْمَانَ عَنْ أَبِي مَحْذُورَةَقَالَ كُنْتُ أُؤَذِّنُ فِي زَمَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ الصُّبْحِ فَإِذَا قُلْتُ حَيَّ عَلَى الْفَلَاحِ قُلْتُ الصَّلَاةُ خَيْرٌ مِنْ النَّوْمِ الصَّلَاةُ خَيْرٌ مِنْ النَّوْمِ الْأَذَانُ الْأَوَّلُ",
                "id": "Telah menceritakan kepada kami [Abdurrahman] telah menceritakan kepada kami [Sufyan] dari [Abu Ja'far] berkata; dia bukan yang Al Farra' dari [Abu Salman] dari [Abu Mahdzurah] berkata; saya mengumandangkan adzaan pada masa Nabi Shallallahu'alaihiwasallam pada sholat subuh, jika saya baca, HAYYA 'ALAL FALAH, saya baca setelahnya AS-SOLATU KHOIRUN MIN AN-NAUM (sholat itu lebih baik daripada tidur) AS-SOLATU KHOIRUN MIN AN-NAUM, pada adzan awal."
            },
            {
                "number": 309,
                "arab": "حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ حَدَّثَنَا الْحَارِثُ بْنُ عُبَيْدٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْمَلِكِ بْنِ أَبِي مَحْذُورَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ عَلِّمْنِي سُنَّةَ الْأَذَانِ فَمَسَحَ بِمُقَدَّمِ رَأْسِي وَقَالَ قُلْ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ تَرْفَعُ بِهَا صَوْتَكَ ثُمَّ تَقُولُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ مَرَّتَيْنِ تَخْفِضُ بِهَا صَوْتَكَ ثُمَّ تَرْفَعُ صَوْتَكَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ مَرَّتَيْنِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ مَرَّتَيْنِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الْفَلَاحِ حَيَّ عَلَى الْفَلَاحِ مَرَّتَيْنِ فَإِنْ كَانَ صَلَاةُ الصُّبْحِ قُلْتَ الصَّلَاةُ خَيْرٌ مِنْ النَّوْمِ الصَّلَاةُ خَيْرٌ مِنْ النَّوْمِ مَرَّتَيْنِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُ",
                "id": "Telah menceritakan kepada kami [Suraij An-Nu'man] telah menceritakan kepada kami [Al Harits bin 'Ubaid] dari [Muhammad bin Abdul Malik bin Abu Mahdzurah] dari [Bapaknya] dari [kakeknya] berkata; saya bertanya Wahai Rasulullah ajarkanlah kepadaku cara adzan, lalu beliau mengusap bagian depan kepalaku dan bersabda bacalah ALLAHU AKBAR ALLAHU AKBAR, dengan mengangkat suaramu, lalu kau baca ASYHADU AN LAA ILAAHA ILLA ALLAH ASYHADU AN LAA ILAAHA ILLA ALLAH ASYHADU ANNA MUHAMMADAR RASULULLAH dua kali dengan merenadahkan suaramu, kemudia kau angkat suaramu untuk membaca ASYHADU AN LAA ILAAHA ILLA ALLAH dua kali, ASYHADU ANNA MUHAMMADAR RASULULLAH dua kali, HAYYA 'ALAS SHOLAAH, HAYYA 'ALAS SHOLAAH, HAYYA 'ALAL FALAAH HAYYA 'ALAL FALAAH dua kali. Pada sholat subuh, bacalah ASSOLAATU KHOIRUN MINAN NAUM, ASsholatU KHOIRUN MINAN NAUM dua kali, ALLAHU AKBAR ALLAHU AKBAR LAA ILAAHA ILLA ALLAH."
            },
            {
                "number": 310,
                "arab": "حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا ابْنُ جُرَيْجٍ وَمُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي مَحْذُورَةَ أَنَّ عَبْدَ اللَّهِ بْنَ مُحَيْرِيزٍ أَخْبَرَهُ وَكَانَ يَتِيمًا فِي حَجْرِ أَبِي مَحْذُورَةَ قَالَ رَوْحٌ ابْنُ مِعْيَرٍ وَلَمْ يَقُلْهُ ابْنُ بَكْرٍ حِينَ جَهَّزَهُ إِلَى الشَّامِ قَالَفَقُلْتُ لِأَبِي مَحْذُورَةَ يَا عَمِّ إِنِّي خَارِجٌ إِلَى الشَّامِ وَأَخْشَى أَنْ أُسْأَلَ عَنْ تَأْذِينِكَ فَأَخْبَرَنِي أَنَّ أَبَا مَحْذُورَةَ قَالَ لَهُ نَعَمْ خَرَجْتُ فِي نَفَرٍ فَكُنَّا بِبَعْضِ طَرِيقِ حُنَيْنٍ فَقَفَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ حُنَيْنٍ فَلَقِيَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبَعْضِ الطَّرِيقِ فَأَذَّنَ مُؤَذِّنُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالصَّلَاةِ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمِعْنَا صَوْتَ الْمُؤَذِّنِ وَنَحْنُ مُتَنَكِّبُونَ فَصَرَخْنَا نَحْكِيهِ وَنَسْتَهْزِئُ بِهِ فَسَمِعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّوْتَ فَأَرْسَلَ إِلَيْنَا إِلَى أَنْ وَقَفْنَا بَيْنَ يَدَيْهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّكُمْ الَّذِي سَمِعْتُ صَوْتَهُ قَدْ ارْتَفَعَ فَأَشَارَ الْقَوْمُ كُلُّهُمْ إِلَيَّ وَصَدَقُوا فَأَرْسَلَ كُلَّهُمْ وَحَبَسَنِي فَقَالَ قُمْ فَأَذِّنْ بِالصَّلَاةِ فَقُمْتُ وَلَا شَيْءَ أَكْرَهُ إِلَيَّ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا مِمَّا يَأْمُرُنِي بِهِ فَقُمْتُ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَلْقَى إِلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّأْذِينَ هُوَ نَفْسُهُ فَقَالَ قُلْ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ثُمَّ قَالَ لِي ارْجِعْ فَامْدُدْ مِنْ صَوْتِكَ ثُمَّ قَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الْفَلَاحِ حَيَّ عَلَى الْفَلَاحِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُ ثُمَّ دَعَانِي حِينَ قَضَيْتُ التَّأْذِينَ فَأَعْطَانِي صُرَّةً فِيهَا شَيْءٌ مِنْ فِضَّةٍ ثُمَّ وَضَعَ يَدَهُ عَلَى نَاصِيَةِ أَبِي مَحْذُورَةَ ثُمَّ أَمَارَّهَا عَلَى وَجْهِهِ مَرَّتَيْنِ ثُمَّ مَرَّتَيْنِ عَلَى يَدَيْهِ ثُمَّ عَلَى كَبِدِهِ ثُمَّ بَلَغَتْ يَدُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُرَّةَ أَبِي مَحْذُورَةَ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَارَكَ اللَّهُ فِيكَ فَقُلْتُ يَا رَسُولَ اللَّهِ مُرْنِي بِالتَّأْذِينِ بِمَكَّةَ فَقَالَ قَدْ أَمَرْتُكَ بِهِ وَذَهَبَ كُلُّ شَيْءٍ كَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ كَرَاهِيَةٍ وَعَادَ ذَلِكَ مَحَبَّةً لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَدِمْتُ عَلَى عَتَّابِ بْنِ أُسَيْدٍ عَامِلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ فَأَذَّنْتُ مَعَهُ بِالصَّلَاةِ عَنْ أَمْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَخْبَرَنِي ذَلِكَ مَنْ أَدْرَكْتُ مِنْ أَهْلِي مِمَّنْ أَدْرَكَ أَبَا مَحْذُورَةَ عَلَى نَحْوِ مَا أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَيْرِيزٍ",
                "id": "Telah menceritakan kepada kami [Rauh bin 'Ubadah] telah menceritakan kepada kami [Ibnu Juraij] dan [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Abdul aziz bin Abdul Malik bin Abu Mahdzurah] [Abdullah bin Muhairiz] mengabarinya, dia adalah seorang yatim di rumah Abu Mahdzurah. Rauh berkata; Ibnu Mi'yar, dan tidak mengatakan Ibnu Bakr ketika dia mempersiapkannya ke Syam. (Abdullah bin Muhairiz Radliyallahu'anhu) berkata; Saya bertanya kepada [Abu Mahdzurah] \"Wahai pamanku, saya hendak keluar ke Syam, saya takut kalau saya ditanya tentang adzanmu, maka kabarkan kepadaku.\" Lalu Abu Mahdzurah berkata kepadanya, Ya. Saya keluar bersama beberapa orang menuju ke Hunain, lalu Rasulullah Shallallahu'alaihiwasallam kembali dari Hunain dan bertemu kami di jalan. Lalu seorang muadzin Rasulullah Shallallahu'alaihiwasallam beradzan untuk suatu sholat, di hadapan Rasulullah Shallallahu'alaihiwasallam. Kami mendengar suara muadzin dalam keadaan berpaling. Kami berteriak mengadukannya dan mencelanya, lalu Rasulullah Shallallahu'alaihiwasallam mendengar suara itu, lalu mengutus seseorang kepada kami agar kami menghadap beliau. Rasulullah Shallallahu'alaihiwasallam bersabda: \"Siapa di antara kalian yang tadi saya dengar suaranya sedemikian tinggi?\" anggota kaum memberi syarat semuanya kepadaku, dan mereka berkata apa adanya. Mereka semuanya di suruh pergi dan beliau menahanku, lalu beliau bersabda: \"Berdiri dan adzanlah untuk sholat.\" Lalu saya berdiri, ketika itu tidak ada yang lebih saya benci daripada Rasulullah Shallallahu'alaihiwasallam ataupun apa yang beliau perintahkan. Lalu saya berdiri di depan Rasulullah Shallallahu'alaihiwasallam, lalu beliau menyampaikan cara adzan langsung. Beliau bersabda: bacalah: ALLAHU AKBAR, ALLAHU AKBAR. ASYHADU AN LAA ILAAHA ILLA ALLAH, ASYHADU AN LAA ILAAHA ILLA ALLAH. ASYHADU ANNA MUHAMMADAR RASULULLAH, ASYHADU ANNA MUHAMMADAR RASULULLAH. Kemudian bersabda kepadaku, Ulangi dan pandjangkan suaramu lalu beliau membaca, ASYHADU AN LAA ILAAHA ILLA ALLAH, ASYHADU AN LAA ILAAHA ILLA ALLAH. ASYHADU ANNA MUHAMMADAR RASULULLAH, ASYHADU ANNA MUHAMMADAR RASULULLAH. HAYYA 'ALAS SHOLAAH, HAYYA 'ALAS SHOLAAH, HAYYA 'ALAL FALAAH, HAYYA 'ALAL FALAAH. ALLAHU AKBAR, ALLAHU AKBAR LAA ILAAHA ILLA ALLAH. Lalu beliau memanggilku setelah saya melakukan adzan, memberiku kantong yang berisi perak. Lalu beliau meletakkan tangannya pada ubun-ubun Abu Mahdzurah kemudian mengulanginya pada bagian wajahnya dua kali, lalu dua kali dengan kedua tangannya, lalu pada hatinya. Sampai tangan Rasulullah Shallallahu'alaihiwasallam mencapai pusar Abu Mahdzurah lalu beliau bersabda: \"Baroka allahhu fik (semoga Allah memberi berkah kepadamu).\" Lalu saya berkata kepada Rasulullah Shallallahu'alaihiwasallam, perintahkanlah saya adzan di Makkah. Beliau menjawab, ya silahkan. Maka apa yang ada pada diriku, berupa kebencian kepada Rasulullah Shallallahu'alaihiwasallam hilang, dan berubah menjadi kesukaan kepada beliau. Lalu saya menemui 'Attab bin Usaid, pekerja Rasulullah Shallallahu'alaihiwasallam di Makkah. Saya mengumandangkan adzan untuk sholat atas perintah Rasulullah Shallallahu'alaihiwasallam. Maka angota keluargaku mengabariku siapa saja yang menjumpaiku, siapa yang menjumpai Abu Mahdzurah sebagaimana yang telah dikabarkan Abdullah bin Muhairiz kepadaku."
            },
            {
                "number": 311,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا عَامِرٌ الْأَحْوَلُ حَدَّثَنِي مَكْحُولٌ أَنَّ عَبْدَ اللَّهِ بْنَ مُحَيْرِيزٍ حَدَّثَهُ أَنَّ أَبَا مَحْذُورَةَ حَدَّثَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَّمَهُ الْأَذَانَ تِسْعَ عَشْرَةَ كَلِمَةً وَالْإِقَامَةَ سَبْعَ عَشْرَةَ كَلِمَةً الْأَذَانُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الْفَلَاحِ حَيَّ عَلَى الْفَلَاحِ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُ وَالْإِقَامَةُ مَثْنَى مَثْنَى اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الْفَلَاحِ حَيَّ عَلَى الْفَلَاحِ قَدْ قَامَتْ الصَّلَاةُ قَدْ قَامَتْ الصَّلَاةُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لَا إِلَهَ إِلَّا اللَّهُ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami ['Amir Al Ahwal] telah menceritakan kepadaku [Makhul] [Abdullah bin Muhairiz] menceritakannya [Abu Mahdzurah] menceritakan kepadanya, Rasulullah Shallallahu'alaihiwasallam mengajarinya adzan sembilan belas kalimat dan iqomat tujuh belas kalimat. Adzan: ALLAHU AKBAR ALLAHU AKBAR. ASYHADU AN LAA ILAAHA ILLA ALLAH, ASYHADU AN LAA ILAAHA ILLA ALLAH. ASYHADU ANNA MUHAMMADAR RASULULLAH, ASYHADU ANNA MUHAMMADAR RASULULLAH. ASYHADU AN LAA ILAAHA ILLA ALLAH, ASYHADU AN LAA ILAAHA ILLA ALLAH, ASYHADU ANNA MUHAMMADAR RASULULLAH ASYHADU ANNA MUHAMMADAR RASULULLAH. HAYYA 'ALAS SHOLAAH, HAYYA 'ALAS SHOLAAH. HAYYA 'ALAL FALAAH HAYYA 'ALAL FALAAH. ALLAHU AKBAR ALLAHU AKBAR LAA ILAAHA ILLA ALLAH. Dan iqomah dua-dua: ALLAHU AKBAR, ALLAHU AKBAR. ASYHADU AN LAA ILAAHA ILLA ALLAH, ASYHADU ANNA MUHAMMADAR RASULULLAH. HAYYA 'ALAS SHOLAAH, HAYYA 'ALAS SHOLAAH. HAYYA 'ALAL FALAAH, HAYYA 'ALAL FALAAH. QOD QOOMATIS sholatU, QOD QOOMATIS sholatU, ALLAHU AKBAR, ALLAHU AKBAR. LAA ILAAHA ILLA ALLAH."
            },
            {
                "number": 312,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ وَاصِلٍ الْأَحْدَبِ عَنْ أَبِي وَائِلٍ قَالَجَلَسْتُ إِلَى شَيْبَةَ بْنِ عُثْمَانَ فَقَالَ جَلَسَ عُمَرُ بْنُ الْخَطَّابِ فِي مَجْلِسَكَ هَذَا فَقَالَ لَقَدْ هَمَمْتُ أَنْ لَا أَدَعَ فِي الْكَعْبَةِ صَفْرَاءَ وَلَا بَيْضَاءَ إِلَّا قَسَمْتُهَا بَيْنَ النَّاسِ قَالَ قُلْتُ لَيْسَ ذَلِكَ لَكَ قَدْ سَبَقَكَ صَاحِبَاكَ لَمْ يَفْعَلَا ذَلِكَ فَقَالَ هُمَا الْمَرْءَانِ يُقْتَدَى بِهِمَا",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan] dari [Washil Al Ahdab] dari [Abu Wa'il] berkata; saya berada dalam dalam majlis [Syaibah bin Utsman] lalu dia (Syaibah bin Utsman radliyallahu'anhu) berkata; ['Umar bin Khattab] telah duduk dalam majlis kamu ini, lalu ('Umar bin Khattab radliyallahu'anhu) berkata; sungguh saya ingin sekali untuk tidak meninggalkan dinar dan dirham di Ka'bah kecuali saya bagikan pada manusia. (Syaibah radliyallahu'anhu) berkata; dua sahabatmu yang telah mendahului kamu tidak melakukan hal itu. Dia ('Umar bin Khattab radliyallahu'anhu) berkata; keduanya adalah orang yang harus diikuti."
            },
            {
                "number": 313,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ وَاصِلٍ عَنْ أَبِي وَائِلٍ قَالَجَلَسْتُ إِلَى شَيْبَةَ بْنِ عُثْمَانَ فِي هَذَا الْمَسْجِدِ فَقَالَ جَلَسَ إِلَيَّ عُمَرُ بْنُ الْخَطَّابِ مَجْلِسَكَ هَذَا فَقَالَ لَقَدْ هَمَمْتُ أَنْ لَا أَدَعَ فِيهَا صَفْرَاءَ وَلَا بَيْضَاءَ إِلَّا قَسَمْتُهَا بَيْنَ الْمُسْلِمِينَ قَالَ قُلْتُ مَا أَنْتَ بِفَاعِلٍ قَالَ لِمَ قُلْتُ لَمْ يَفْعَلْهُ صَاحِبَاكَ قَالَ هُمَا الْمَرْءَانِ يُقْتَدَى بِهِمَا",
                "id": "Telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dari [Washil] dari [Abu Wa'il] berkata; saya duduk bersama [Syaibah bin 'Utsman], lalu dia (Syaibah bin 'Utsman radliyallahu'anhu) berkata; 'Umar bin Khattab telah duduk dalam majlis kamu ini. Dia ('Umar bin Khattab Radliyallahu'anhuma) berkata; sungguh saya ingin sekali, untuk tidak meninggalkan dinar dan dirham kecuali saya bagikan kepada kaum muslimin. (Syaibah bin 'Utsman radliyallahu'anhu) berkata; saya bertanya: kenapa kau melakukannya? saya katakan, dua sahabatmu tidak melakukannya. ('Umar bin Khattab Radliyallahu'anhu) menjawab, keduanya adalah orang yang harus diikuti."
            },
            {
                "number": 314,
                "arab": "حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ أَبِي الْحَكَمِ أَوْ الْحَكَمِ بْنِ سُفْيَانَ الثَّقَفِيِّ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَالَ ثُمَّ تَوَضَّأَ وَنَضَحَ فَرْجَهُحَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ قَالَ قَالَ شَرِيكٌ سَأَلْتُ أَهْلَ الْحَكَمِ بْنِ سُفْيَانَ فَذَكَرُوا أَنَّهُ لَمْ يُدْرِكْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Mujahid] dari [Abu Al Hakam] atau Al Hakam bin Sufyan Ats-Tsaqofi berkata; saya pernah melihat Rasulullah Shallallahu'alaihiwasallam kencing lalu berwudhu dan memerciki kemaluannya. Telah menceritakan kepada kami Aswad bin 'Amir berkata; Syarik berkata; saya telah bertanya kepada keluarga Al Hakam bin Sufyan, maka mereka menyebutkan dia tidak bertemu Nabi Shallallahu'alaihiwasallam."
            },
            {
                "number": 315,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ وَجَدْتُ فِي كِتَابِ أَبِي بِخَطِّ يَدِهِ حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ رَجُلٍ مِنْ ثَقِيفٍ هُوَ الْحَكَمُ بْنُ سُفْيَانَ أَوْ سُفْيَانُ بْنُ الْحَكَمِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَالَ ثُمَّ يَعْنِي نَضَحَ فَرْجَهُ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; saya telah mendapatkan dalam kitab bapakku dengan tulisan tangannya, telah menceritakan kepada kami [Ya'la bin 'Ubaid] telah menceritakan kepada kami [Sufyan] dari [Manshur] dari [Mujahid] dari seorang laki-laki dari Tsaqif, yaitu Al Hakam bin Sufyan atau [Sufyan bin Al Hakam] berkata; saya pernah melihat Rasulullah Shallallahu'alaihiwasallam kencing lalu memerciki kemaluannya."
            },
            {
                "number": 316,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ وَحَسْنُ بْنُ مُوسَى قَالَا حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عُثْمَانَ بْنِ طَلْحَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْبَيْتَ فَصَلَّى رَكْعَتَيْنِ وِجَاهَكَ حِينَ تَدْخُلُ بَيْنَ السَّارِيَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] dan [Hasan bin Musa] berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari ['Utsman bin Thalhah] Nabi Shallallahu'alaihiwasallam masuk Baitullah, lalu sholat dua rekaat menghadap ke kamu ketika kamu masuk di antara dua tiang."
            },
            {
                "number": 317,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا خَالِدٌ عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ بْنِ جَوْشَنٍ عَنْ عُقْبَةَ بْنِ أَوْسٍ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ يَوْمَ فَتْحِ مَكَّةَ فَقَالَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ نَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ قَالَ هُشَيْمٌ مَرَّةً أُخْرَى الْحَمْدُ لِلَّهِ الَّذِي صَدَقَ وَعْدَهُ وَنَصَرَ عَبْدَهُ أَلَا إِنَّ كُلَّ مَأْثَرَةٍ كَانَتْ فِي الْجَاهِلِيَّةِ تُعَدُّ وَتُدَّعَى وَكُلَّ دَمٍ أَوْ دَعْوَى مَوْضُوعَةٌ تَحْتَ قَدَمَيَّ هَاتَيْنِ إِلَّا سِدَانَةَ الْبَيْتِ وَسِقَايَةَ الْحَاجِّ أَلَا وَإِنَّ قَتِيلَ خَطَإِ الْعَمْدِ قَالَ هُشَيْمٌ مَرَّةً بِالسَّوْطِ وَالْعَصَا وَالْحَجَرِ دِيَةٌ مُغَلَّظَةٌ مِائَةٌ مِنْ الْإِبِلِ مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلَادُهَا وَقَالَ مَرَّةً أَرْبَعُونَ مِنْ ثَنِيَّةٍ إِلَى بَازِلِ عَامِهَا كُلُّهُنَّ خَلِفَةٌحَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا حُمَيْدٌ عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ أَنَّهُ قَالَ فِي هَذَا الْحَدِيثِ وَإِنَّ قَتِيلَ خَطَإِ الْعَمْدِ بِالسَّوْطِ وَالْعَصَا وَالْحَجَرِ مِائَةٌ مِنْ الْإِبِلِ مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلَادُهَا فَمَنْ ازْدَادَ بَعِيرًا فَهُوَ مِنْ أَهْلِ الْجَاهِلِيَّةِ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يُونُسُ عَنِ الْقَاسِمِ بْنِ رَبِيعَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَرِيبٍ مِنْ ذَلِكَ إِلَّا أَنَّهُ قَالَ مِائَةٌ مِنْ الْإِبِلِ ثَلَاثُونَ حِقَّةً وَثَلَاثُونَ جَذَعَةً وَثَلَاثُونَ بَنَاتُ لَبُونٍ وَأَرْبَعُونَ ثَنِيَّةً خَلِفَةً إِلَى بَازِلِ عَامِهِ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Khalid] dari [Al Qasim bin Rabi'ah bin Jausyan] dari ['Uqbah bin Aus] dari [seorang laki-laki sahabat Nabi Shallallahu'alaihiwasallam], Nabi Shallallahu'alaihiwasallam pernah berkhutbah pada Fathu Makkah, Beliau bersabda: \"LAA ILAAHA ILLA ALLAHU WAHDAH NASHORO 'ABDAH WAHAZAMAL AHZAABA WAHDAH (tiada Ilah selain Allah semata yang menolong hamba-Nya serta yang menghancurkan tentara musuh semata).\" Husyaim berkata (dalam riwayatnya) suatu kali: ALHAMDULILLAHIL LADZI SHODAQO WA'DAH WANASHORO 'ABDAH. Ketahuilah bahwasanya setiap kebanggaan jahiliyah yang selalu dibangga-banggakan dan diagung-agungkan, dan setiap darah dan klaim-klaim jahiliyah, harus ditumpas dibawah telapak kakiku ini, kecuali kepengurusan Baitul Haram dan memberi minuman orang yang haji. Ketahuilah, pembunuh yang tidak disengaja, -Hisyam berkata (dalam riwayatnya): \"Dengan cemeti, tongkat dan batu, ada diyat yang mugholladzoh (diyat pembunuh seperti yang disengaja) adalah seratus unta, empat puluh dalam keadaan hamil, dan pada suatu kali berkata; empat puluh yang sudah berumur dua tahun sampai sembilan tahun, semuanya hamil. Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Humaid] dari [Al Qasim bin Rabi'ah] dia berkata; dalam hadits ini, pembunuh yang tidak disengaja dengan cambuk, tongkat dan batu diatnya adalah seratus unta, empat puluh di antaranya yang sedang hamil, siapa yang menambahi dengan unta maka itu termasuk orang Jahiliyyah. Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Yunus] dari [Al Qasim bin Rabi'ah] dari Nabi Shallallahu'alaihiwasallam yang mendekati hal itu kecuali tambahan, seratus unta, tiga puluh diantara hiqqoh (unta betina yang memasuki tahun ke empat), tiga puluh diantara jadza'ah (unta yang berumur antara enam bulan sampai satu tahun) dan tiga puluh diantara banat labun (unta yang memasuki umur tiga tahun) dan empat puluh di antaranya unta yang masuk tahun ke enam dan hamil sampai umur sembilan tahun."
            },
            {
                "number": 318,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنِ السَّائِبِ بْنِ عُمَرَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ السَّائِبِأَنَّ عَبْدَ اللَّهِ بْنَ السَّائِبِ كَانَ يَقُودُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ وَيُقِيمُهُ عِنْدَ الشِّقَّةِ الثَّالِثَةِ مِمَّا يَلِي الْبَابَ مِمَّا يَلِي الْحَجَرَ فَقُلْتُ يَعْنِي الْقَائِلُ ابْنُ عَبَّاسٍ لِعَبْدِ اللَّهِ بْنِ السَّائِبِ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُومُ هَاهُنَا أَوْ يُصَلِّي هَاهُنَا فَيَقُولُ نَعَمْ فَيَقُومُ ابْنُ عَبَّاسٍ فَيُصَلِّي",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sa'ib bin 'Umar] berkata; telah menceritakan kepadaku [Muhammad bin Abdullah bin Sa'ib] [Abdullah bin Sa'ib] pernah menuntun Abdullah bin 'Abbas, lantas menghentikannya pada sisi yang ketiga (dari Ka'bah) yang menghadap pintu dan menghadap Hajar Aswad. Lalu saya (Ibnu 'Abbas) berkata kepada Abdillah bin Sa'ib, apakah Rasulullah Shallallahu'alaihiwasallam sholat berdiri di sini atau sholat di sini? Lalu Abdullah berkata; Ya. Ibnu Abbas berdiri lalu sholat."
            },
            {
                "number": 319,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنِ ابْنِ جُرَيْجٍ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَبَّادِ بْنِ جَعْفَرٍ عَنْ عَبْدِ اللَّهِ بْنِ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى يَوْمَ الْفَتْحِ فَوَضَعَ نَعْلَيْهِ عَنْ يَسَارِهِقَالَ عَبْد اللَّهِ سَمِعْتُ هَذَا الْحَدِيثَ مِنْ أَبِي ثَلَاثَ مِرَارٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] berkata; telah menceritakan kepadaku [Muhammad bin 'Abbad bin Ja'far] dari [Abdullah bin Sufyan] dari [Abdullah bin As-Sa'ib] Rasulullah Shallallahu'alaihiwasallam pada saat Fathu Makkah mengerjakan sholat, beliau meletakkan kedua sandalnya di sisi kirinya. Abdullah berkata; saya telah mendengar hadits ini dari Bapakku tiga kali."
            },
            {
                "number": 320,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ مُحَمَّدِ بْنِ عَبَّادٍ الْمَخْزُومِيِّ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ افْتَتَحَ الصَّلَاةَ يَوْمَ الْفَتْحِ فِي الْفَجْرِ فَقَرَأَ بِسُورَةِ الْمُؤْمِنِينَ فَلَمَّا بَلَغَ ذِكْرَ مُوسَى وَهَارُونَ أَصَابَتْهُ سَعْلَةٌ فَرَكَعَ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Ibnu Juraij] dari [Muhammad bin 'Abbad Al Makhzumi] dari [Abdullah bin As-Sa'ib] Nabi Shallallahu'alaihiwasallam membuka sholat pada saat Fathu Makkah dalam sholat fajar dengan surat Al Mukminun, tatkala sampai penyebutan Musa dan Harun maka beliau batuk lalu ruku'."
            },
            {
                "number": 321,
                "arab": "حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ سَمِعْتُ مُحَمَّدَ بْنَ عَبَّادِ بْنِ جَعْفَرٍ قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ سُفْيَانَ وَعَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ وَعَبْدُ اللَّهِ بْنُ الْمُسَيَّبِ الْعَابِدِيُّ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الصُّبْحَ بِمَكَّةَ قَالَ فَافْتَتَحَ سُورَةً فَلَمَّا انْتَهَى إِلَى ذِكْرِ مُوسَى وَهَارُونَ أَوْ ذِكْرِ عِيسَى مُحَمَّدُ بْنُ عَبَّادٍ يَشُكُّ فَاخْتَلَفُوا عَلَيْهِ أَخَذَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَعْلَةٌ فَرَكَعَقَالَ وَابْنُ السَّائِبِ حَاضِرُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Hajjaj] berkata; [Ibnu Juraij] berkata; saya telah mendengar [Muhammad bin 'Abbad bin Ja'far] berkata; telah mengabarkan kepadaku [Abu Salamah bin Sufyan] dan [Abdullah bin 'Amr bin Al 'Ash] dan [Abdullah bin Al Musayyab Al 'Abidi] dari [Abdullah bin As-Sa'ib] Nabi Shallallahu'alaihiwasallam sholat subuh di Makkah. (Abdullah bin As-Sa'ib Radliyallahu'anhu) berkata; beliau membuka dengan suatu surat, tatkala sampai kata Musa dan Harun atau kata 'Isa, Muhammad bin 'Abbad ragu, lalu mereka berselisih atasnya, Nabi Shallallahu'alaihiwasallam batuk lalu ruku'. (Abdullah bin Al Musayyab Radliyallahu'anhu) berkata; Ibnu As-Sa'ib melihat hal itu."
            },
            {
                "number": 322,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ وَرَوْحٌ قَالَا أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ عَبَّادِ بْنِ جَعْفَرٍ قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ سُفْيَانَ وَعَبْدُ اللَّهِ بْنُ عَمْرٍو قَالَ رَوْحٌ ابْنُ الْعَاصِ وَعَبْدُ اللَّهِ بْنُ الْمُسَيَّبِ الْعَابِدِيُّ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصُّبْحَ بِمَكَّةَ فَاسْتَفْتَحَ سُورَةَ الْمُؤْمِنِينَ حَتَّى إِذَا جَاءَ ذِكْرُ مُوسَى وَهَارُونَ أَوْ ذِكْرُ عِيسَى قَالَ رَوْحٌ مُحَمَّدُ بْنُ عَبَّادٍ يَشُكُّ وَاخْتَلَفُوا عَلَيْهِ أَخَذَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَعْلَةٌ فَحَذَفَ فَرَكَعَقَالَ وَعَبْدُ اللَّهِ بْنُ السَّائِبِ حَاضِرُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] dan [Rauh] berkata; telah mengabarkan kepada kami [Ibnu Juraij] berkata; saya telah mendengar [Muhammad bin 'Abbad bin Ja'far] berkata; telah mengabarkan kepadaku [Abu Salamah bin Sufyan] dan [Abdullah bin 'Amr] [Rauh bin Al 'Ash] dan [Abdullah bin Al Musayyab Al 'Abidi] berkata; dari [Abdullah bin As-Sa'ib] berkata; Rasulullah Shallallahu'alaihiwasallam sholat subuh bersama kami di Makkah lalu membukanya dengan surat Al Mukminin sampai pada penyebutan Musa dan Harun atau 'Isa. [Rauh] berkata; Muhammad bin 'Abbad ragu dan mereka saling berselisih, Nabi Shallallahu'alaihiwasallam batuk lalu beliau memotong dan ruku'. (Abdullah bin Al Musayyab Radliyallahu'anhu) berkata; [Ibnu As-Sa'ib] melihat hal itu."
            },
            {
                "number": 323,
                "arab": "حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ بْنُ أَبِي الْوَضَّاحِ عَنْ عَبْدِ الْكَرِيمِ عَنْ مُجَاهِدٍ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي قَبْلَ الظُّهْرِ بَعْدَ الزَّوَالِ أَرْبَعًا وَيَقُولُ إِنَّ أَبْوَابَ السَّمَاءِ تُفْتَحُ فَأُحِبُّ أَنْ أُقَدِّمَ فِيهَا عَمَلًا صَالِحًا",
                "id": "Telah menceritakan kepada kami [Abu Daud Ath-Thoyalisi], berkata; telah menceritakan kepada kami [Muhammad bin Muslim bin Abu Al Wadloh] dari [Abdul Karim] dari [Mujahid] dari [Abdullah bin As-Sa'ib] berkata; Rasulullah Shallallahu'alaihiwasallam sholat sebelum dhuhur setelah tergelincirnya matahari empat rekaat, beliau bersabda: \"Pintu-pintu langit dibuka, dan saya senang mempersembahkan amalan sholeh ketika itu.\""
            },
            {
                "number": 324,
                "arab": "حَدَّثَنَا هَوْذَةُ بْنُ خَلِيفَةَ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ مُحَمَّدُ بْنُ عَبَّادٍ حَدَّثَنِي حَدِيثًا رَفَعَهُ إِلَى أَبِي سَلَمَةَ بْنِ سُفْيَانَ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ قَالَحَضَرْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ وَصَلَّى فِي قِبَلِ الْكَعْبَةِ فَخَلَعَ نَعْلَيْهِ فَوَضَعَهُمَا عَنْ يَسَارِهِ ثُمَّ اسْتَفْتَحَ سُورَةَ الْمُؤْمِنِينَ فَلَمَّا جَاءَ ذِكْرُ عِيسَى أَوْ مُوسَى أَخَذَتْهُ سَعْلَةٌ فَرَكَعَ",
                "id": "Telah menceritakan kepada kami [Haudzan bin Khalifah] telah mengabarkan kepada kami [Ibnu Juraij] berkata [Muhammad bin 'Abbad] telah menceritakan kepadaku sebuah hadits yang di marfu'kan sampai pada [Abu Salamah bin Sufyan] dan [Abdullah bin 'Amr] dari [Abdullah bin As-Sa'ib] berkata; saya menghadiri Rasulullah Shallallahu'alaihiwasallam pada Fathu Makkah pada arah Ka'bah, lalu beliau melepas kedua sandalnya, lalu meletakkan keduanya di sebelah kirinya. Beliau membaca surat Al Mukminun. Tatkala sampai pada penyebutan Musa dan Harun (Nabi Shallallahu'alaihiwasallam) batuk lalu ruku'."
            },
            {
                "number": 325,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ وَرَوْحٌ قَالَا حَدَّثَنَا ابْنُ جُرَيْجٍ وَابْنُ بَكْرٍ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ حَدَّثَنِي يَحْيَى بْنُ عُبَيْدٍ مَوْلَى السَّائِبِ أَنَّ أَبَاهُ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ السَّائِبِ أَخْبَرَهُ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِيمَا بَيْنَ رُكْنَيْ بَنِي جُمَحَ وَالرُّكْنِ الْأَسْوَدِ{ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ }",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] dan [Rauh] berkata; telah menceritakan kepada kami [Ibnu Juraij] dan [Ibnu Bakr] berkata; telah mengabarkan kepada kami [Ibnu Juraij] telah menceritakan kepadaku [Yahya bin 'Ubaid] budak As-Sa'ib, bahwa [Bapaknya] mengabarinya [Abdullah bin As-Sa'ib] mengabarinya, dia telah mendengar Nabi Shallallahu'alaihiwasallam ketika berada di dua rukun yaitu Bani Jumah dan Rukun Aswad membaca: \"ROBBANAA AATINAA FID DUNYA HASANAH WA FIL AAKHIROTI HASANAH WAQINA 'ADZABAN NAAR, (Ya Allah, berikan kami kebaikan di dunia dan kebaikan di akhirat dan jagalah kami dari adzab neraka) \""
            },
            {
                "number": 326,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنِ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي يَحْيَى بْنُ عُبَيْدٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بَيْنَ الرُّكْنِ الْيَمَانِي وَالْحَجَرِ{ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ }قَالَ عَبْدُ الرَّزَّاقِ وَابْنُ بَكْرٍ وَرَوْحٌ فِي هَذَا الْحَدِيثِ إِنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِيمَا بَيْنَ رُكْنِ بَنِي جُمَحَ وَالرُّكْنِ الْأَسْوَدِ{ رَبَّنَا آتِنَا }",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Yahya bin 'Ubaid] dari [Bapaknya] dari [Abdullah bin As-Sa'ib] berkata; saya telah mendengar Rasulullah Shallallahu'alaihiwasallam membaca antara rukun Yamani dan Hajar Aswad membaca, \"ROBBANAA AATINAA FID DUNYA HASANAH WA FIL AAKHIROTI HASANAH WAQINA 'ADZABAN NAAR, (Ya Allah, berikan kami kebaikan di dunia dan kebaikan di akhirat dan jagalah kami dari adzab neraka) \" Telah menceritakan kepada kami [Abdurrazaq] dan [Ibnu Bakr] dan [Rauh] dalam hadits ini, dia telah mendengar Nabi Shallallahu'alaihiwasallam ketika berada di dua rukun yaitu Bani Jumah dan Rukun Aswad membaca, \"ROBBANAA AATINAA.\""
            },
            {
                "number": 327,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ عَبَّادِ بْنِ جَعْفَرٍ قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ سُفْيَانَ وَعَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ وَعَبْدُ اللَّهِ بْنُ الْمُسَيَّبِ الْعَابِدِيُّ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِقَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصُّبْحَ فَاسْتَفْتَحَ سُورَةَ الْمُؤْمِنِينَ حَتَّى إِذَا جَاءَ ذِكْرُ مُوسَى وَهَارُونَ أَوْ ذِكْرُ عِيسَى مُحَمَّدُ بْنُ عَبَّادٍ شَكَّ اخْتَلَفُوا عَلَيْهِ أَخَذَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَعْلَةٌ فَحَذَفَ فَرَكَعَقَالَ وَابْنُ السَّائِبِ حَاضِرُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Ibnu Juraij] berkata; saya telah mendengar [Muhammad bin 'Abbad bin Ja'far] berkata; telah mengabarkan kepadaku [Abu Salamah bin Sufyan] dan [Abdullah bin 'Amr bin Al 'Ash] dan [Abdullah bin Al Musayyab Al 'Abidi] dari [Abdullah bin As-Sa'ib] berkata; Rasulullah Shallallahu'alaihiwasallam sholat subuh bersama kami, lalu membukanya dengan surat Al Mukminin sampai pada penyebutan Musa dan Harun atau 'Isa --Muhammad bin 'Abbad ragu tentang kepastian yang mereka perselisihkan-- Nabi Shallallahu'alaihiwasallam terkena batuk lalu menghentikannya dan ruku'. (Abdullah bin Al Musayyab Radliyallahu'anhuma) berkata; Ibnu As-Sa'ib melihat hal itu."
            },
            {
                "number": 328,
                "arab": "حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ حَدَّثَنِي عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ عَنْ عَلِيٍّ الْأَزْدِيِّ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ حُبْشِيٍّ الْخَثْعَمِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ أَيُّ الْأَعْمَالِ أَفْضَلُ قَالَ إِيمَانٌ لَا شَكَّ فِيهِ وَجِهَادٌ لَا غُلُولَ فِيهِ وَحَجَّةٌ مَبْرُورَةٌ قِيلَ فَأَيُّ الصَّلَاةِ أَفْضَلُ قَالَ طُولُ الْقُنُوتِ قِيلَ فَأَيُّ الصَّدَقَةِ أَفْضَلُ قَالَ جَهْدُ الْمُقِلِّ قِيلَ فَأَيُّ الْهِجْرَةِ أَفْضَلُ قَالَ مَنْ هَجَرَ مَا حَرَّمَ اللَّهُ عَلَيْهِ قِيلَ فَأَيُّ الْجِهَادِ أَفْضَلُ قَالَ مَنْ جَاهَدَ الْمُشْرِكِينَ بِمَالِهِ وَنَفْسِهِ قِيلَ فَأَيُّ الْقَتْلِ أَشْرَفُ قَالَ مَنْ أُهَرِيقَ دَمُهُ وَعُقِرَ جَوَادُهُ",
                "id": "Telah menceritakan kepada kami [Hajjaj] berkata; [Ibnu Juraij] berkata; telah menceritakan kepadaku ['Utsman bin Abu Sulaiman] dari ['Ali bin Al Azdi] dari ['Ubaid bin 'Umair] dari [Abdullah bin Hubsyi Al Khots'ami] Nabi Shallallahu'alaihiwasallam ditanya tentang amalan apa yang paling utama? Beliau bersabda: \"Iman yang tidak ada keraguan di dalamnya, jihad yang tidak ada ghulul (mengambil harta rampasan orang sebelum di bagikan) di dalamnya serta haji yang mabrur.Ditanyakan lagi: sholat mana yang paling utama? Beliau bersabda: \"Yang panjang waktu berdirinya\" Ditanyakan: sedekah mana yang paling utama? Beliau bersabda: \"Kesungguhan yang maksimal saat kondisi terdesak\" Ditanyakan, hijrah mana yang paling utama? Beliau bersabda: \"Berhijrah dari apa yang diharamkan oleh Allah padanya\", Ditanyakan, jihad mana yang paling utama? Beliau bersabda: \"Orang yang berjihad pada orang-orang musyrik dengan harta dan jiwanya\" Ditanyakan, terbunuh bagaimana yang paling utama? Beliau Shallallahu'alaihiwasallam: \"Orang yang terkucur darahnya, dan terbunuh kudanya.\""
            },
            {
                "number": 329,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرُ بْنُ حَوْشَبٍ حَدَّثَنِي إِسْمَاعِيلُ بْنُ أُمَيَّةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَكَانَ لَهُمْ غُلَامٌ يُقَالُ لَهُ طَهْمَانُ أَوْ ذَكْوَانُ فَأَعْتَقَ جَدُّهُ نِصْفَهُ فَجَاءَ الْعَبْدُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُعْتَقُ فِي عِتْقِكَ وَتُرَقُّ فِي رِقِّكَ قَالَ وَكَانَ يَخْدِمُ سَيِّدَهُ حَتَّى مَاتَقَالَ عَبْدُ الرَّزَّاقِ وَكَانَ مَعْمَرٌ يَعْنِي ابْنَ حَوْشَبٍ رَجُلًا صَالِحًا",
                "id": "Telah menceritakan kepada kami [Abdurrozaq] telah menceritakan kepada kami [Ma'mar bin Husyab] telah menceritakan kepadaku [Isma'il bin Umayyah] dari [Bapaknya] dari [kakeknya] berkata; mereka memiliki seorang budak laki-laki yang bernama Tuhman atau Dzakwan lalu kakek Isma'il bin Umayyah memerdekakan setengahnya, lalu sang budak datang kepada Nabi Shallallahu'alaihiwasallam. Lalu Nabi Shallallahu'alaihiwasallam bersabda: \"Separuh dirimu kamu merdeka dan separuh dirimu masih menjadi budak\", maka dia tetap membantu tuannya hingga meninggal, Abdur Rozzaq berkata; Ma'mar yaitu Ibnu Hausyab adalah seorang laki-laki yang shaleh."
            },
            {
                "number": 330,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا عَامِرُ بْنُ صَالِحِ بْنِ رُسْتُمَ الْمُزَنِيُّ حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى بْنِ عَمْرِو بْنِ سَعِيدِ بْنِ الْعَاصِي قَالَ أَوْ ابْنُ سَعِيدِ بْنِ الْعَاصِ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا نَحَلَ وَالِدٌ وَلَدَهُ أَفْضَلَ مِنْ أَدَبٍ حَسَنٍقَالَ أَبُو عَبْد الرَّحْمَنِ حَدَّثَنَا بِهِ خَلَفُ بْنُ هِشَامٍ الْبَزَّارُ وَالْقَوَارِيرِيُّ قَالَا حَدَّثَنَا عَامِرُ بْنُ أَبِي عَامِرٍ بِإِسْنَادِهِ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata; telah mengabarkan kepada kami ['Amir bin Sholih bin Rustum Al Muzanni] telah menceritakan kepada kami [Ayyub bin Musa bin 'Amr bin Sa'id bin Al 'Ashi] berkata; atau Ibnu Sa'id bin Al 'Ash dari [ayahnya] dari [kakeknya] berkata: Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidak ada pemberian orang tua terhadap anaknya yang lebih utama dari sebuah adab yang baik.\" Abu Abdur Rahman berkata; telah menceritakan kepada kami dengan hadits itu [Khalaf bin Hisyam Al Bazzar] dan [Al Qawariri] berkata; telah menceritakan kepada kami ['Amir bin Abu 'Amir] dengan sanadnya lalu dia menyebutkan seperti itu."
            },
            {
                "number": 331,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ زَكَرِيَّا عَنِ الشَّعْبِيِّ عَنِ الْحَارِثِ بْنِ مَالِكِ ابْنِ بَرْصَاءَ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فَتْحِ مَكَّةَ يَقُولُ لَا يُغْزَى هَذَا يَعْنِي بَعْدَ الْيَوْمِ إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Zakariya] dari [Sya'bi] dari [Al Harits bin Malik bin Barsho'] berkata; saya mendengar Nabi Shallallahu'alaihiwasallam bersabda pada hari Penaklukan Makkah, \"Tempat ini (Bumi Makkah) tidak diperangi lagi yakni setetah hari ini hingga Hari Kiamat.\""
            },
            {
                "number": 332,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنِي زَكَرِيَّا عَنْ عَامِرٍ قَالَ قَالَ الْحَارِثُ بْنُ مَالِكِ ابْنِ بَرْصَاءَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَوْمَ فَتْحِ مَكَّةَ وَهُوَ يَقُولُ لَا يُغْزَى بَعْدَهَا إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid] berkata; telah menceritakan kepadaku [Zakariya] dari ['Amir] berkata; [Al Harits bin Malik bin Barsho'] berkata; saya telah mendengar Rasulullah Shallallahu'alaihiwasallam pada Fathu Makkah beliau bersabda: \"Tidak boleh diperangi setelah ini sampai Hari Kiamat.\""
            },
            {
                "number": 333,
                "arab": "حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ أَبُو الْحَسَنِ قَالَ حَدَّثَنَا شَيْبَانُ عَنْ فِرَاسٍ عَنِ الشَّعْبِيِّ قَالَ قَالَ مُطِيعُ بْنُ الْأَسْوَدِقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ لَا يَنْبَغِي أَنْ يُقْتَلَ قُرَشِيٌّ بَعْدَ يَوْمِهِ هَذَا صَبْرًا",
                "id": "Telah menceritakan kepada kami [Mu'awiyah bin Hisyam Abu Al Hasan] berkata; telah menceritakan kepada kami [Syaiban] dari [Firos] dari [Asy-Sya'bi] berkata; [Muthi' bin Al Aswad] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda pada hari Penaklukan Makkah, \"Orang Quraiys tidak layak dibunuh setelah hari ini dengan cara dijadikan obyek sasaran panah-memanah.\""
            },
            {
                "number": 334,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا زَكَرِيَّا عَنْ عَامِرٍ عَنْ عَبْدِ اللَّهِ بْنِ مُطِيعٍ عَنْ أَبِيهِقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَوْمَ فَتْحِ مَكَّةَ لَا يُقْتَلُ قُرَشِيٌّ صَبْرًا بَعْدَ الْيَوْمِ إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Zakariya] dari ['Amir] dari [Abdullah bin Muthi'] dari [Bapaknya] berkata; saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda pada Fathu Makkah, \"Tidak boleh orang Quraisy dibunuh dengan cara dijadikan obyek sasaran panah-memanah.\""
            },
            {
                "number": 335,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَاقَ حَدَّثَنِي شُعْبَةُ بْنُ الْحَجَّاجِ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ عَنْ عَامِرٍ الشَّعْبِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مُطِيعِ بْنِ الْأَسْوَدِ أَخِي بَنِي عَدِيِّ بْنِ كَعْبٍ عَنْ أَبِيهِ مُطِيعٍ وَكَانَ اسْمُهُ الْعَاصُ فَسَمَّاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُطِيعًا قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ أَمَرَ بِقَتْلِ هَؤُلَاءِ الرَّهْطِ بِمَكَّةَ يَقُولُ لَا تُغْزَى مَكَّةُ بَعْدَ هَذَا الْعَامِ أَبَدًا وَلَا يُقْتَلُ رَجُلٌ مِنْ قُرَيْشٍ بَعْدَ الْعَامِ صَبْرًا أَبَدًا",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [Bapakku] dari [Ibnu Ishaq] telah menceritakan kepadaku [Syu'bah bin Al Hajjaj] dari [Abdullah bin Abu As-Safar] dari ['Amir Asy-Sya'bi] dari [Abdullah bin Muthi' bin Al Aswad, dari Bani 'Adi bin Ka'b] dari [Bapaknya, Muthi', namanya adalah Al 'Ash] lalu Rasulullah Shallallahu'alaihiwasallam memberinya nama Muthi, berkata; saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda ketika menyuruh membunuh beberapa orang di Makkah, \"Tidak boleh diperangi kota Makkah sejak tahun selamanya dan tidak boleh seseorang dari Quraisy dibunuh dengan cara dijadikan obyek sasaran panah-memanah.\""
            },
            {
                "number": 336,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ زَكَرِيَّا حَدَّثَنَا عَامِرٌ عَنْ عَبْدِ اللَّهِ بْنِ مُطِيعٍ عَنْ أَبِيهِأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فَتْحِ مَكَّةَ يَقُولُ لَا يُقْتَلُ قُرَشِيٌّ صَبْرًا بَعْدَ الْيَوْمِ وَلَمْ يُدْرِكْ الْإِسْلَامُ أَحَدًا مِنْ عُصَاةِ قُرَيْشٍ غَيْرَ مُطِيعٍ وَكَانَ اسْمُهُ عَاصِي فَسَمَّاهُ مُطِيعًا يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Zakariya] telah menceritakan kepada kami ['Amir] dari [Abdullah bin Muthi'] dari [Bapaknya] telah mendengar Rasulullah Shallallahu'alaihiwasallam pada Fathu Makkah bersabda: \"Tidak boleh orang Quraisy dibunuh dengan cara dijadikan obyek sasaran panah-memanah sejak hari ini. Agama Islam tidak mendapatkan seorangpun dari kalangan ahli maksiat Quraisy selain Muthi', namanya adalah 'Ashi, lalu ada yang memberi nama Muthi' yaitu Nabi Shallallahu'alaihiwasallam. "
            },
            {
                "number": 337,
                "arab": "حَدَّثَنَا مُوسَى بْنُ طَارِقٍ أَبُو قُرَّةَ الزُّبَيْدِيُّ مِنْ أَهْلِ الْحُصَيْبِ وَإِلَى جَانِبِهَا رِمَعٌ وَهِيَ قَرْيَةُ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ أَبِي وَكَانَ أَبُو قُرَّةَ قَاضِيًا لَهُمْ بِالْيَمَنِ قَالَ حَدَّثَنَا أَيْمَنُ بْنُ نَابِلٍ أَبُو عِمْرَانَ قَالَ سَمِعْتُ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَالُ لَهُ قُدَامَةُ يَعْنِي ابْنَ عَبْدِ اللَّهِ يَقُولُرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَى جَمْرَةَ الْعَقَبَةِ يَوْمَ النَّحْرِقَالَ أَبُو قُرَّةَ وَزَادَنِي سُفْيَانُ الثَّوْرِيُّ فِي حَدِيثِ أَيْمَنَ هَذَا عَلَى نَاقَةٍ صَهْبَاءَ بِلَا زَجْرٍ وَلَا طَرْدٍ وَلَا إِلَيْكَ إِلَيْكَ",
                "id": "Telah menceritakan kepada kami [Musa bin Thoriq Abu Qurroh Az-Zubaidi] dari penduduk Husaib sampai ke sampingnya, di Rima', yaitu daerah Abu Musa Al 'Asy'ari, berkata; bapakku Abu Qurroh adalah seorang hakim mereka di Yaman, berkata; telah menceritakan kepada kami [Aiman bin Nabil, Abu 'Imron] berkata; saya telah mendengar seorang sahabat Nabi Shallallahu'alaihiwasallam yang bernama [Qudamah] yaitu Ibnu Abdullah berkata; saya telah melihat Rasulullah Shallallahu'alaihiwasallam melempar jumrah 'Aqobah pada Hari Nahr. [Abu Qurroh] berkata; [Sufyan At Tsauri] menambahkan dalam hadits Aiman ini, di atas unta Shoba' (merah kehitam-hitaman) tanpa memukul dan mendorong juga tanpa berdesak-desakan."
            },
            {
                "number": 338,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا أَيْمَنُ بْنُ نَابِلٍ قَالَ سَمِعْتُ شَيْخًا مِنْ بَنِي كِلَابٍ يُقَالُ لَهُ قُدَامَةُ بْنُ عَبْدِ اللَّهِ بْنِ عَمَّارٍ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ يَرْمِي الْجَمْرَةَ عَلَى نَاقَةٍ لَهُ صَهْبَاءَ لَا ضَرْبَ وَلَا طَرْدَ وَلَا إِلَيْكَ إِلَيْكَ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Aiman bin Nabil] berkata; saya telah mendengar seorang syaikh dari Bani Kilab yang bernama [Qudamah bin Abdullah bin 'Ammar] berkata; saya telah melihat Rasulullah Shallallahu'alaihiwasallam pada Hari Nahr melempar jumrah di atas untanya Shohba' dengan tidak memukulnya atau menariknya atau berdesak-desakan."
            },
            {
                "number": 339,
                "arab": "حَدَّثَنَا أَبُو أَحْمَدَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الزُّبَيْرِيُّ حَدَّثَنَا أَيْمَنُ بْنُ نَابِلٍ حَدَّثَنَا قُدَامَةُ بْنُ عَبْدِ اللَّهِ الْكِلَابِيُّأَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَى الْجَمْرَةَ جَمْرَةَ الْعَقَبَةِ مِنْ بَطْنِ الْوَادِي يَوْمَ النَّحْرِ عَلَى نَاقَةٍ لَهُ صَهْبَاءَ لَا ضَرْبَ وَلَا طَرْدَ وَلَا إِلَيْكَ إِلَيْكَحَدَّثَنَا قُرَّانٌ فِي الْحَدِيثِ قَالَ يَرْمِي الْجِمَارَ عَلَى نَاقَةٍ لَهُ",
                "id": "Telah menceritakan kepada kami [Abu Ahmad, Muhammad bin Abdullah Az-Zubairi] telah menceritakan kepada kami [Aiman bin Nabil] telah menceritakan kepada kami [Qudamah bin Abdullah Al Kilabi] dia telah melihat Rasulullah Shallallahu'alaihiwasallam melempar jumrah yaitu Jumrah 'Aqobah, dari bawah bukit pada Hari Nahr di atas untanya Shohba' dengan tidak memukulnya atau menariknya atau berdesak-desakan. Telah menceritakan kepada kami [Qurron] dalam haditsnya, berkata; melempar kerikil di atas unta beliau."
            },
            {
                "number": 340,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ وَمُحْرِزُ بْنُ عَوْنِ بْنِ أَبِي عَوْنٍ أَبُو الْفَضْلِ قَالَا حَدَّثَنَا قُرَّانُ بْنُ تَمَّامٍ الْأَسَدِيُّ حَدَّثَنَا أَيْمَنُ عَنْ قُدَامَةَ بْنِ عَبْدِ اللَّهِقَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى نَاقَةٍ يَسْتَلِمُ الْحَجَرَ بِمِحْجَنِهِ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Suraij bin Yunus] dan [Muhriz bin 'Aun bin Abu 'Aun, Abu Al Fadl] berkata; telah menceritakan kepada kami [Qurron bin Tamam Al Asadi] telah menceritakan kepada kami ['Aiman] dari [Qudamah bin Abdullah] berkata; saya telah melihat Rasulullah Shallallahu'alaihiwasallam di atas unta beliau menyentuh hajar dengan tongkat."
            },
            {
                "number": 341,
                "arab": "قَالَ أَبُو عَبْد الرَّحْمَنِ حَدَّثَنِي مُحْرِزُ بْنُ عَوْنٍ وَعَبَّادُ بْنُ مُوسَى قَالَا حَدَّثَنَا قُرَّانُ بْنُ تَمَّامٍ عَنْ أَيْمَنَ بْنِ نَابِلٍ عَنْ قُدَامَةَ بْنِ عَبْدِ اللَّهِأَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمِي الْجِمَارَ عَلَى نَاقَةٍ لَا ضَرْبَ وَلَا طَرْدَ وَلَا إِلَيْكَ إِلَيْكَ وَزَادَ عَبَّادٌ فِي حَدِيثِهِ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى نَاقَةٍ صَهْبَاءَ يَرْمِي الْجَمْرَةَ",
                "id": "Berkata; Abu Abdurrahman telah menceritakan kepadaku [Muhriz bin 'Aun] dan ['Abbad bin Musa] berkata; telah menceritakan kepada kami [Qurron bin Tamam] dari ['Aiman bin Nabil] dari [Qudamah bin Abdullah] dia telah melihat Nabi Shallallahu'alaihiwasallam melempar jumrah di atas untanya dengan tidak memukulnya atau menariknya atau berdesak-desakan. 'Abbad menambahkan dalam haditsnya, berkata; saya telah melihat Rasulullah Shallallahu'alaihiwasallam di atas unta Shohba' melempar jumrah."
            },
            {
                "number": 342,
                "arab": "حَدَّثَنَا مُعْتَمِرٌ عَنْ أَيْمَنَ بْنِ نَابِلٍ عَنْ قُدَامَةَ بْنِ عَبْدِ اللَّهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ يَرْمِي الْجَمْرَةَ عَلَى نَاقَةٍ لَهُ صَهْبَاءَ لَا ضَرْبَ وَلَا طَرْدَ وَلَا إِلَيْكَ إِلَيْكَ",
                "id": "Telah menceritakan kepada kami [Mu'tamir] dari ['Aiman bin Nabil] dari [Qudamah bin Abdullah] berkata; saya telah melihat Rasulullah Shallallahu'alaihiwasallam pada Hari Nahr, melempar jumrah di atas untanya Shohba' dengan tidak memukulnya atau menariknya atau berdesak-desakan."
            },
            {
                "number": 343,
                "arab": "حَدَّثَنَا وَكِيعٌ وَأَبُو مُعَاوِيَةَ قَالَا حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ سُفْيَانَ بْنِ عَبْدِ اللَّهِ الثَّقَفِيِّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ قُلْ لِي فِي الْإِسْلَامِ قَوْلًا لَا أَسْأَلُ عَنْهُ أَحَدًا غَيْرَكَ قَالَ أَبُو مُعَاوِيَةَ بَعْدَكَ قَالَ قُلْ آمَنْتُ بِاللَّهِ ثُمَّ اسْتَقِمْ",
                "id": "Telah menceritakan kepada kami [Waki'] dan [Abu Mu'awiyah] berkata; telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [Bapaknya] dari [Sufyan bin Abdullah Ats-Tsaqofi] berkata; saya berkata; Wahai Rasulullah, katakanlah kepadaku dalam Islam sebuah perkataan, yang saya tidak perlu menanyakan lagi kepada selain anda. Abu Mu'awiyah berkata; \"Setelah anda\", beliau bersabda: \"Katakanlah, saya beriman kepada Allah, lalu beristiqomahlah.\""
            },
            {
                "number": 344,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بْنِ سُفْيَانَ عَنْ أَبِيهِأَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ أَخْبِرْنِي أَمْرًا فِي الْإِسْلَامِ لَا أَسْأَلُ عَنْهُ أَحَدًا بَعْدَكَ قَالَ قُلْ آمَنْتُ بِاللَّهِ ثُمَّ اسْتَقِمْ قَالَ يَا رَسُولَ اللَّهِ فَأَيَّ شَيْءٍ أَتَّقِي قَالَ فَأَشَارَ بِيَدِهِ إِلَى لِسَانِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin 'Atho'] dari [Abdullah bin Sufyan] dari [Bapaknya] ada seorang laki-laki berkata; Wahai Rasulullah, khabarkanlah kepadaku suatu urusan dalam Islam, yang saya tidak perlu menanyakan lagi kepada seorangpun setelah anda. Beliau bersabda: \"Katakanlah, saya beriman kepada Allah, lalu beristiqomahlah.\" Dia berkata; Wahai Rasulullah, apa yang harus saya jaga betul. Beliau memberi isyarat dengan tangannya ke arah lisannya."
            },
            {
                "number": 345,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا إِبْرَاهِيمُ يَعْنِي ابْنَ سَعْدٍ حَدَّثَنَا ابْنُ شِهَابٍ وَيَزِيدُ بْنُ هَارُونَ قَالَ أَنْبَأَنَا إِبْرَاهِيمُ قَالَ حَدَّثَنِي ابْنُ شِهَابٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَاعِزٍ الْعَامِرِيِّ عَنْ سُفْيَانَ بْنِ عَبْدِ اللَّهِ الثَّقَفِيِّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ حَدِّثْنِي بِأَمْرٍ أَعْتَصِمُ بِهِ قَالَ قُلْ رَبِّيَ اللَّهُ ثُمَّ اسْتَقِمْ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَا أَكْبَرُ مَا تَخَافُ عَلَيَّ قَالَ فَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلِسَانِ نَفْسِهِ ثُمَّ قَالَ هَذَا قَالَ يَزِيدُ فِي حَدِيثِهِ بِطَرْفِ لِسَانِ نَفْسِهِ",
                "id": "Telah menceritakan kepada kami [Abu Kamil] telah menceritakan kepada kami [Ibrahim] yaitu Ibnu Sa'd, telah menceritakan kepada kami [Ibnu Syihab] dan [Yazid bin Harun] berkata; telah memberitakan kepada kami [Ibrahim] berkata; telah menceritakan kepadaku [Ibnu Syihab] dari [Muhammad bin Abdurrahman bin Ma'iz bin Al 'Amiri] dari [Sufyan bin Abdullah Ats-Tsaqofi] berkata; saya berkata; kepada Rasulullah Shallallahu'alaihiwasallam, apa sesuatu yang anda paling takuti dari saya. Dia berkata; Rasulullah Shallallahu'alaihiwasallam memegang lidah beliau, lalu bersabda: \"Ini.\" Yazid berkata dalam haditsnya, \"Dengan ujung lidah beliau sendiri.\""
            },
            {
                "number": 346,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ إِسْحَاقَ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ الْمُبَارَكِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَاعِزٍ عَنْ سُفْيَانَ بْنِ عَبْدِ اللَّهِ الثَّقَفِيِّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ حَدِّثْنِي بِأَمْرٍ أَعْتَصِمُ بِهِ قَالَ قُلْ رَبِّيَ اللَّهُ ثُمَّ اسْتَقِمْ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَا أَخْوَفُ مَا تَخَافُ عَلَيَّ قَالَ فَأَخَذَ بِلِسَانِ نَفْسِهِ ثُمَّ قَالَ هَذَا",
                "id": "Telah menceritakan kepada kami ['Ali bin Ishaq] berkata; telah memberitakan kepada kami [Abdullah] yaitu Ibnu Al Mubarok, berkata; telah memberitakan kepada kami [Ma'mar] dari [Az-Zuhri] dari [Abdurrahman bin Ma'iz] dari [Sufyan bin Abdullah Ats-Tsaqofi] berkata; saya berkata; Wahai Rasulullah, ceritakan kepadaku suatu hal yang saya akan berpegang teguh terhadapnya. Beliau bersabda: \"Katakanlah robku adalah Allah lalu beristiqomahlah. (Sufyan bin Abdullah Ats-Tsaqofi Radliyallahu'anhuma) berkata; Wahai Rasulullah, apa yang paling anda takuti terhadapku. Beliau memegang lisannya lalu bersabda: ini."
            },
            {
                "number": 347,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا أَيُّوبُ قَالَ سَمِعْتُ رَجُلًا يَمَانِيًّا يُحَدِّثُ عَنْ أَبِيهِ قَالَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً كُنْتُ فِيهَا فَنَهَانَا أَنْ نَقْتُلَ الْعُسَفَاءَ وَالْوُصَفَاءَ",
                "id": "Telah menceritakan kepada kami [Isma'il] telah menceritakan kepada kami [ayyub] berkata; saya telah mendengar seorang laki-laki Yaman menceritakan dari [Bapaknya] berkata; Rasulullah Shallallahu'alaihiwasallam mengutus sebuah pasukan yang saya ikut menyertainya, beliau melarang membunuh budak laki-laki dan budak perempuan."
            },
            {
                "number": 348,
                "arab": "حَدَّثَنَا بَهْزٌ وَعَفَّانُ قَالَا حَدَّثَنَا هَمَّامٌ قَالَ عَفَّانُ فِي حَدِيثِهِ حَدَّثَنَا قَتَادَةُ عَنْ كَثِيرٍ عَنْ أَبِي عِيَاضٍ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُجْلَسَ بَيْنَ الضِّحِّ وَالظِّلِّ وَقَالَ مَجْلِسُ الشَّيْطَانِ",
                "id": "Telah menceritakan kepada kami [Bahz] dan ['Affan] berkata; telah menceritakan kepada kami [Hammam] berkata; ['Affan] dalam haditsnya, telah menceritakan kepada kami [Qatadah] dari [Katsir] dari [Abu 'Iyadl] dari [salah seorang sahabat Nabi Shallallahu'alaihiwasallam], Nabi Shallallahu'alaihiwasallam melarang duduk di antara tempat yang terkena sinar matahari dan teduh. Beliau bersabda: \"Itu adalah tempat duduknya setan\""
            },
            {
                "number": 349,
                "arab": "حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ التَّيْمِيُّ قَالَ أَخْبَرَنَا حُمَيْدٌ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدٍ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَرَأَيْتُ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَامَ حَتَّى نَفَخَ ثُمَّ قَامَ فَصَلَّى وَلَمْ يَتَوَضَّأْ",
                "id": "Telah menceritakan kepada kami [Mu'tamir bin Sulaiman At Taimi] berkata; telah mengabarkan kepada kami [Humaid] dari [Abdullah bin 'Ubaid] dari [salah seorang sahabat Nabi Shallallahu'alaihiwasallam] berkata; saya pernah melihat Nabiyullah ShallallahuAlaihiWasallam tidur hingga mendengkur kemudian beliau bangun, lalu sholat tanpa berwudhu."
            },
            {
                "number": 350,
                "arab": "حَدَّثَنَا عَبْدُ الرَزَّاقِ وَرَوْحٍ قَالَا حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي حَسَنُ بْنُ مُسْلِمٍ عَنْ طَاوُسٍ عَنْ رَجُلٍ قَدْ أَدْرَكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا الطَّوَافُ صَلَاةٌ فَإِذَا طُفْتُمْ فَأَقِلُّوا الْكَلَامَوَلَمْ يَرْفَعْهُ مُحَمَّدُ بْنُ بَكْرٍ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] dan [Rauh] berkata; telah menceritakan kepada kami [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Hasan bin Muslim] dari [Thawus] dari [seorang laki-laki yang mendapatkan masa Nabi Shallallahu'alaihiwasallam], Nabi Shallallahu'alaihiwasallam bersabda: \" thawaf adalah sholat maka jika kalian thawaf sedikitkan dari berbicara\" Muhammad bin Bakr tidak memarfu'kan hadits ini."
            },
            {
                "number": 351,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ عَنْ حُمَيْدٍ عَنْ رَجُلٍ مِنْ أَهْلِ مَكَّةَ يُقَالُ لَهُ يُوسُفُ قَالَكُنْتُ أَنَا وَرَجُلٌ مِنْ قُرَيْشٍ نَلِي مَالَ أَيْتَامٍ قَالَ وَكَانَ رَجُلٌ قَدْ ذَهَبَ مِنِّي بِأَلْفِ دِرْهَمٍ قَالَ فَوَقَعَتْ لَهُ فِي يَدِي أَلْفُ دِرْهَمٍ قَالَ فَقُلْتُ لِلْقُرَشِيِّ إِنَّهُ قَدْ ذَهَبَ لِي بِأَلْفِ دِرْهَمٍ وَقَدْ أَصَبْتُ لَهُ أَلْفَ دِرْهَمٍ قَالَ فَقَالَ الْقُرَشِيُّ حَدَّثَنِي أَبِي أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَدِّ الْأَمَانَةَ إِلَى مَنْ ائْتَمَنَكَ وَلَا تَخُنْ مَنْ خَانَكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu 'Adi] dari [Humaid] dari seorang laki-laki penduduk Makkah yang bernama [Yusuf] berkata; saya bersama seorang laki-laki dari Quraisy mengurus harta anak-anak yatim. (Yusuf) berkata; laki-laki tersebut kabur membawa pergi seribu dirham. (Yusuf) berkata; lalu uang seribu dirham miliknya terjatuh di tanganku. (Yusuf) berkata; saya berkata kepada Al Qurosyi, ada yang membawa pergi uangku seribu dirham dan saya menemukan seribu dirham miliknya. (Yusuf) berkata; lalu [Al Qurasyi] berkata; telah menceritakan kepadaku [bapakku] telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tunaikanlah amanat kepada orang yang memberimu amanat, dan janganlah kamu berkhianat kepada orang yang telah menghianati dirimu.\""
            },
            {
                "number": 352,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ وَالضَّحَّاكُ بْنُ مَخْلَدٍ قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ وَعَبْدُ اللَّهِ بْنُ الْحَارِثِ قَالَ عَرَضَ عَلَيَّ ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ أَبِي سُفْيَانَ أَنَّ عَمْرَو بْنَ أَبِي صَفْوَانَ أَخْبَرَهُ قَالَ الضَّحَّاكُ وَعَبْدُ اللَّهِ بْنُ الْحَارِثِ أَنَّ عَمْرَو بْنَ عَبْدِ اللَّهِ بْنِ صَفْوَانَ أَخْبَرَهُ أَنَّ كَلَدَةَ بْنَ الْحَنْبَلِأَخْبَرَهُ أَنَّ صَفْوَانَ بْنَ أُمَيَّةَ بَعَثَهُ فِي الْفَتْحِ بِلِبَإٍ وَجَدَايَةٍ وَضَغَابِيسَ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَعْلَى الْوَادِي قَالَ فَدَخَلْتُ عَلَيْهِ وَلَمْ أُسَلِّمْ وَلَمْ أَسْتَأْذِنْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ارْجِعْ فَقُلْ السَّلَامُ عَلَيْكُمْ أَدْخُلُ بَعْدَ مَا أَسْلَمَ صَفْوَانُ قَالَ عَمْرٌو أَخْبَرَنِي هَذَا الْخَبَرَ أُمَيَّةُ بْنُ صَفْوَانَ وَلَمْ يَقُلْ سَمِعْتُهُ مِنْ كَلَدَةَ قَالَ الضَّحَّاكُ وَابْنُ الْحَارِثِ وَذَلِكَ بَعْدَمَا أَسْلَمَ وَقَالَ الضَّحَّاكُ وَعَبْدُ اللَّهِ بْنُ الْحَارِثِ بِلَبَنٍ وَجَدَايَةٍ",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Ibnu Juraij] Dan [Adl Dlahhak bin Makhlad] berkata; telah mengabarkan kepadaku [Ibnu Juraij] Dan [Abdullah bin Al Harits] berkata; [Ibnu Juraij] menunjukan kepadaku, berkata; telah mengabarkan kepadaku ['Amar bin Abu Sufyan] ['Amr bin Abu Shafwan] mengabarinya. [Adl Dlahhak] dan [Abdullah Al Harits] berkata; ['Amr bin Abdullah bin Shafwan] mengabarinya, [Kaldah bin Hanbal] mengabarinya, Shafwan bin Umayyah pada hari Penaklukan Makkah mengutusnya untuk membawa susu yang baru diperah dari hewan ternak yang baru melahirkan, serta anak biawak yang berumur enam bulan dan rempah rempah kepada Nabi Shallallahu'alaihiwasallam. Nabi Shallallahu'alaihiwasallam berada pada ketinggian bukit. (Kaldah) berkata; saya menemui beliau tanpa salam dan memohon ijin, lalu Nabi Shallallahu'alaihiwasallam bersabda: \"Kembalilah dan ucapkan: 'Assalamu 'alaikum', saya masuk Islam setelah Islamnya Shafwan. ['Amr] berkata; Umayyah bin Shafwan mengabariku kabar ini hanya dia tidak berkata 'Saya mendengarnya dari Kaldah.' [Adl Dlahhak] dan [Ibnu Harits] berkata; yang demikian itu setelah keIslaman (Kaldah). [Adl Dlahhak] dan [Abdullah bin Harits] berkata; \"Membawa susu dan anak biawak.\""
            },
            {
                "number": 353,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَاقَ عَنْ عَمْرِو بْنِ أَبِي سُفْيَانَ سَمِعَهُ مِنْ مُسْلِمِ بْنِ ثَفِنَةَ قَالَاسْتَعْمَلَ ابْنُ عَلْقَمَةَ أَبِي عَلَى عِرَافَةِ قَوْمِهِ وَأَمَرَهُ أَنْ يُصَدِّقَهُمْ قَالَ فَبَعَثَنِي أَبِي فِي طَائِفَةٍ لِآتِيَهُ بِصَدَقَتِهِمْ قَالَ فَخَرَجْتُ حَتَّى أَتَيْتُ شَيْخًا كَبِيرًا يُقَالُ لَهُ سِعْرٌ فَقُلْتُ إِنَّ أَبِي بَعَثَنِي إِلَيْكَ لِتُؤَدِّيَ صَدَقَةَ غَنَمِكَ قَالَ يَا ابْنَ أَخِي وَأَيُّ نَحْوٍ تَأْخُذُونَ قُلْتُ نَخْتَارُ حَتَّى إِنَّا لَنَشْبُرُ ضُرُوعَ الْغَنَمِ قَالَ ابْنَ أَخِي فَإِنِّي أُحَدِّثُكَ أَنِّي كُنْتُ فِي شِعْبٍ مِنْ هَذِهِ الشِّعَابِ فِي غَنَمٍ لِي عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَنِي رَجُلَانِ عَلَى بَعِيرٍ فَقَالَا نَحْنُ رَسُولَا النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْكَ لِتُؤَدِّيَ صَدَقَةَ غَنَمِكَ قُلْتُ مَا عَلَيَّ فِيهَا قَالَا شَاةٌ فَأَعْمِدُ إِلَى شَاةٍ قَدْ عَلِمْتُ مَكَانَهَا مُمْتَلِئَةٍ مَحْضًا وَشَحْمًا فَأَخْرَجْتُهَا إِلَيْهِمَا فَقَالَا هَذِهِ الشَّافِعُ الْحَائِلُ وَقَدْ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَأْخُذَ شَافِعًا قُلْتُ فَأَيُّ شَيْءٍ قَالَا عَنَاقًا جَذَعَةً أَوْ ثَنِيَّةً قَالَ فَأَعْمِدُ إِلَى عَنَاقٍ مُعْتَاطٍ قَالَ وَالْمُعْتَاطُ الَّتِي لَمْ تَلِدْ وَلَدًا وَقَدْ حَانَ وِلَادُهَا فَأَخْرَجْتُهَا إِلَيْهِمَا فَقَالَا نَاوِلْنَاهَا فَدَفَعْتُهَا إِلَيْهِمَا فَجَعَلَاهَا مَعَهُمَا عَلَى بَعِيرِهِمَا ثُمَّ انْطَلَقَاقَالَ عَبْد اللَّهِ سَمِعْتُ أَبِي يَقُولُ كَذَا قَالَ وَكِيعٌ مُسْلِمُ بْنُ ثَفِنَةَ صُحِّفَ و قَالَ رَوْحٌ ابْنُ شُعْبَةَ وَهُوَ الصَّوَابُ و قَالَ أَبِي و قَالَ بِشْرُ بْنُ السَّرِيِّ لَا إِلَهَ إِلَّا اللَّهُ هُوَ ذَا وَلَدُهُ هَاهُنَا يَعْنِي مُسْلِمَ بْنَ شُعْبَةَ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Zakariya bin Ishaq] dari ['Amr bin Abu Sufyan] telah mendengarnya dari [Muslim bin Tsafinah] berkata; Ibnu Al Qomah menugaskan bapakku untuk menjadi pemimpin kaumnya dan menyuruhnya untuk mengambil zakat mereka. (Muslim Radliyallahu'anhu) berkata; lalu ayahku mengutusku kepada sebuah kaum agar saya mengambil zakat mereka. Lalu saya keluar hingga menemui seorang yang telah tua yang bernama [Si'ir], lalu saya katakan, 'Ayahku mengutusku kepadamu agar kamu menunaikan zakat kambingmu.' (orang tua itu) berkata; 'Wahai anak saudaraku! kambing seperti apa yang akan kalian ambil? saya berkata; biarkan saya memilih sampai saya bisa mengukur susu kambingmu. Dia berkata; wahai anak saudaraku, saya akan memberitahumu bahwa ketika saya berada di sebuah bukit bersama kambing-kambingku pada masa Nabi Shallallahu'alaihiwasallam, tiba-tiba datang kepadaku [dua orang laki-laki] yang mengendarai unta dan berkata; kami adalah utusan Nabi Shallallahu'alaihiwasallam yang datang kepadamu agar kamu menunaikan zakat kambingmu, saya berkata; apa yang wajib saya keluarkan darinya? (Keduanya) berkata; seekor kambing. Lalu saya pergi menuju seekor kambing, yang saya melihatnya telah mengandung dan gemuk, lalu saya mengeluarkannya kepada mereka. Lalu keduanya berkata 'Ini adalah kambing yang sedang hamil, padahal Rasulullah Shallallahu'alaihiwasallam melarang kami untuk mengambil kambing yang hamil', saya bertanya 'Kalau begitu kambing yang bagaimana? ' Keduanya berkata 'Anak kambing betina yang berumur enam hingga satu tahun, atau yang baru berumur tiga tahun', (orang tua itu) berkata; lalu saya menuju 'anaq (kambing betina yang berumur enam bulan hingga satu tahun) yang mu'tath, dia berkata; mu'tath adalah kambing yang tidak bisa melahirkan anak (karena gemuk) padahal sudah masanya untuk bisa melahirkan anak, lalu saya mengeluarkannya kepada keduanya dan keduanya berkata; 'Berikan kepada kami, maka saya memberikannya kepada mereka hingga keduanya menaikkannya ke atas unta mereka lalu pergi.' Abdullah berkata; 'Saya telah mendengar ayahku berkata seperti ini.' Waki' berkata; nama Muslim bin Tsafinah adalah salah baca. Rauh berkata; yang benar adalah Ibnu Syu'bah. Bapakku dan Bisyr bin As-Sari berkata; LAA ILAAHA ILLA ALLAH, dalam hadits ini dia itu adalah anaknya, yaitu Muslim bin Syu'bah."
            },
            {
                "number": 354,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَاقَ قَالَ حَدَّثَنِي عَمْرُو بْنُ أَبِي سُفْيَانَ قَالَ حَدَّثَنِي مُسْلِمُ بْنُ شُعْبَةَأَنَّ ابْنَ عَلْقَمَةَ اسْتَعْمَلَ أَبَاهُ عَلَى عِرَافَةِ قَوْمِهِ قَالَ مُسْلِمٌ فَبَعَثَنِي إِلَى مُصَدِّقَةٍ فِي طَائِفَةٍ مِنْ قَوْمِي قَالَ فَخَرَجْتُ حَتَّى آتِيَ شَيْخًا يُقَالُ لَهُ سِعْرٌ فِي شِعْبٍ مِنْ الشِّعَابِ فَقُلْتُ إِنَّ أَبِي بَعَثَنِي إِلَيْكَ لِتُعْطِيَنِي صَدَقَةَ غَنَمِكَ فَقَالَ أَيْ ابْنَ أَخِي وَأَيَّ نَحْوٍ تَأْخُذُونَ فَقُلْتُ نَأْخُذُ أَفْضَلَ مَا نَجِدُ فَقَالَ الشَّيْخُ إِنِّي لَفِي شِعْبٍ مِنْ هَذِهِ الشِّعَابِ فِي غَنَمٍ لِي إِذْ جَاءَنِي رَجُلَانِ مُرْتَدِفَانِ بَعِيرًا فَقَالَا إِنَّا رَسُولَا رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَنَا إِلَيْكَ لِتُؤْتِيَنَا صَدَقَةَ غَنَمِكَ قُلْتُ وَمَا هِيَ قَالَا شَاةٌ فَعَمِدْتُ إِلَى شَاةٍ قَدْ عَلِمْتُ مَكَانَهَا مُمْتَلِئَةً مَحْضًا أَوْ مَحْضًا وَشَحْمًا فَأَخْرَجْتُهَا إِلَيْهِمَا فَقَالَا هَذِهِ شَافِعٌ وَقَدْ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَأْخُذَ شَافِعًا وَالشَّافِعُ الَّتِي فِي بَطْنِهَا وَلَدُهَا قَالَ فَقُلْتُ فَأَيَّ شَيْءٍ تَأْخُذَانِ قَالَا عَنَاقًا أَوْ جَذَعَةً أَوْ ثَنِيَّةً قَالَ فَأَخْرَجَ لَهُمَا عَنَاقًا قَالَ فَقَالَا ادْفَعْهَا إِلَيْنَا فَتَنَاوَلَاهَا وَجَعَلَاهَا مَعَهُمَا عَلَى بَعِيرِهِمَا",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Zakariya bin Ishaq] berkata; telah menceritakan kepadaku ['Amr bin Abu Sufyan] berkata; telah menceritakan kepadaku [Muslim bin Syu'bah] Ibnu Al Qomah menugaskan bapaknya untuk menjadi pemimpin kaumnya. Muslim berkata; lalu ayahku mengutusku kepada sebuah kelompok dari kaumku agar saya mengambil zakat. (Muslim Radliyallahu'anhu) berkata; Lalu saya keluar hingga menemui seorang yang telah tua yang bernama [Si'ir], di sebuah bukit. lalu saya katakan 'Ayahku mengutusku kepadamu agar kamu memberikan zakat kambingmu.' (orang tua itu) berkata; 'Wahai anak saudaraku! kambing seperti apa yang akan kalian ambil? saya berkata; biarkan saya memilih sampai saya bisa mengukur susu kambingmu.' Orang tua itu berkata; ketika saya berada di sebuah bukit bersama kambing-kambingku, tiba-tiba datang kepadaku [dua orang laki-laki] yang mengendarai unta berboncengan dan berkata; kami adalah utusan Rasulullah Shallallahu'alaihiwasallam yang telah mengutus kami agar kamu memberikan zakat kambingmu, saya berkata; 'Apa yang wajib saya keluarkan darinya? (Keduanya) berkata; seekor kambing. Lalu saya pergi menuju seekor kambing, yang saya melihatnya telah mengandung dan gemuk atau mengandung dan berlemak, lalu saya mengeluarkannya kepada mereka. Lalu keduanya berkata; 'Ini adalah kambing syafi', padahal Rasulullah Shallallahu'alaihiwasallam melarang kami untuk mengambil kambing syafi', syafi' adalah kambing yang sedang hamil.' Saya bertanya, 'Kalau begitu kambing yang bagaimana yang akan kalian berdua ambil? ' Keduanya berkata 'Anak kambing betina yang berumur belum sampai satu tahun, atau yang baru berumur satu tahun, atau yang telah masuk umur tiga tahun.' (Muslim Radliyallahu'anhu) berkata; lalu orang itu mengeluarkan 'anaq (kambing betina yang berumur enam bulan hingga satu tahun). (Muslim Radliyallahu'anhu) berkata; keduanya berkata; 'Berikan kepada kami', lalu keduanya menerimanya lalu menaikkannya ke atas unta."
            },
            {
                "number": 355,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ أَخْبَرَنَا سُفْيَانُ وَعَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ قَالَ وَقَالَ نَافِعُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ بِشْرِ بْنِ سُحَيْمٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ فِي يَوْمِ التَّشْرِيقِ قَالَ عَبْدُ الرَّحْمَنِ فِي أَيَّامِ الْحَجِّ فَقَالَ لَا يَدْخُلُ الْجَنَّةَ إِلَّا نَفْسٌ مُسْلِمَةٌ وَإِنَّ هَذِهِ الْأَيَّامَ أَيَّامُ أَكْلٍ وَشُرْبٍ",
                "id": "Telah menceritakan kepada kami [Waki'] berkata; telah mengabarkan kepada kami [Sufyan] dan [Abdurrahman] dari [Sufyan] dari [Habib bin Abu Tsabit] berkata; dan [Nafi' bin Jubair bin Muthim] berkata; dari [Bisyr bin Suhaim] Nabi Shallallahu'alaihiwasallam berkhutbah pada Hari Tasyriq. Abdur Rahman berkata; di sekitar Hari Haji, bersabda: \"Tidak akan masuk surga melainkan orang Islam dan hari-hari ini adalah hari makan dan minum.\" "
            },
            {
                "number": 356,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ بَعَثَ بِشْرَ بْنَ سُحَيْمٍ فَأَمَرَهُ أَنْ يُنَادِيَ أَلَا إِنَّهُ لَا يَدْخُلُ الْجَنَّةَ إِلَّا نَفْسُ مُؤْمِنٍ وَإِنَّهَا أَيَّامُ أَكْلٍ وَشُرْبٍ يَعْنِي أَيَّامَ التَّشْرِيقِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] dari ['Amr bin Dinar] dari [Nafi' Bin Jubair Bin Muth'im] dari [salah seorang sahabat Nabi Shallallahu'alaihiwasallam] dari Nabi Shallallahu'alaihiwasallam beliau mengutus Bisyr bin Suhaim, lalu beliau menyuruhnya untuk menyiarkan bahwa tidak masuk surga kecuali seorang mukmin, dan hari itu yaitu hari makan dan minum, yaitu Hari Tasyriq."
            },
            {
                "number": 357,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي حَبِيبُ بْنُ أَبِي ثَابِتٍ أَنَّهُ سَمِعَ نَافِعَ بْنَ جُبَيْرِ بْنِ مُطْعِمٍ يُحَدِّثُ عَنْ رَجُلٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَالُ لَهُ بِشْرُ بْنُ سُحَيْمٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ فَقَالَ إِنَّهُ لَا يَدْخُلُ الْجَنَّةَ إِلَّا مُؤْمِنٌ وَإِنَّ هَذِهِ الْأَيَّامَ أَيَّامُ أَكْلٍ وَشُرْبٍ",
                "id": "Telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Syu'bah] berkata; telah mengabarkan kepadaku [Habib bin Abu Tsabit] telah mendengar [Nafi' Bin Jubair Bin Muth'im] menceritakan dari salah seorang sahabat Nabi Shallallahu'alaihiwasallam yang bernama [Bisyr bin Suhaim], Nabi Shallallahu'alaihiwasallam berkhutbah lalu beliau bersabda: \"Tidak masuk surga kecuali seorang mukmin, dan hari-hari ini adalah hari makan dan minum.\""
            },
            {
                "number": 358,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ أَنَّ مُحَمَّدَ بْنَ الْأَسْوَدِ بْنِ خَلَفٍ أَخْبَرَهُ أَنَّ أَبَاهُ الْأَسْوَدَرَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُبَايِعُ النَّاسَ يَوْمَ الْفَتْحِ قَالَ جَلَسَ عِنْدَ قَرْنِ مَسْقَلَةَ فَبَايَعَ النَّاسَ عَلَى الْإِسْلَامِ وَالشَّهَادَةِ قَالَ قُلْتُ وَمَا الشَّهَادَةُ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ الْأَسْوَدِ بْنِ خَلَفٍ أَنَّهُ بَايَعَهُمْ عَلَى الْإِيمَانِ بِاللَّهِ وَشَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abdurrozaq] telah mengabarkan kepada kami [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Abdullah bin 'Utsman bin khutsaim] [Muhammad bin Al 'Aswad bin Khalaf] mengabarinya, ayahnya yaitu [Al Aswad] melihat Nabi Shallallahu'alaihiwasallam membaiat manusia pada hari Penaklukan Makkah. Dia berkata; (Rasulullah Shallallahu'alaihiwasallam) duduk di Qarn Masqalah, beliau membaiat orang-orang atas Islam dan syahadat. (Ibnu Juraij Radliyallahu'anhu) berkata; saya bertanya, apa itu syahadah? (Abdullah bin 'Utsman bin Khutsaim Radliyallahu'anhu) berkata; Muhammad bin Al Aswad bin Khalaf mengabariku (Rasulullah Shallallahu'alaihiwasallam) membaiat mereka atas Iman kepada Allah dan syahadat LAA ILAAHA ILLA ALLAH WA ANNA MUHAMMADAN ABDUHU WA RASULUH Shallallahu'alaihiwasallam."
            },
            {
                "number": 359,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عَنْ عُثَيْمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّهُ جَاءَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ قَدْ أَسْلَمْتُ فَقَالَ أَلْقِ عَنْكَ شَعَرَ الْكُفْرِ يَقُولُ أَحْلِقْ قَالَ وَأَخْبَرَنِي آخَرُ مَعَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِآخَرَ أَلْقِ عَنْكَ شَعَرَ الْكُفْرِ وَاخْتَتِنْ",
                "id": "Telah menceritakan kepada kami [Abdurrozaq] telah mengabarkan kepada kami [Ibnu Juraij] berkata; telah mengabarkan kepadaku, dari ['Utsaim bin Kulaib] dari [Bapaknya] dari [kakeknya] dia datang kepada Nabi Shallallahu'alaihiwasallam dan berkata; saya telah masuk Islam. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Buanglah bulu-bulu kekafiran darimu\" Dan bersabda: \"Cukurlah.\" ('Utsaim Radliyallahu'anhu) berkata; telah mengabarinya orang lain yang bersamanya, Nabi Shallallahu'alaihiwasallam bersabda kepada orang lain itu, \"Buanglah bulu-bulu kekafiran darimu dan berkhitanlah.\""
            },
            {
                "number": 360,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا مِسْعَرٌ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَمِعْتُ عَمْرَو بْنَ أَوْسٍ قَالَ أَخْبَرَنِي مَنْ سَمِعَمُنَادِيَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ قَامَتْ الصَّلَاةُ أَوْ حِينَ حَانَتْ الصَّلَاةُ أَوْ نَحْوَ هَذَا أَنْ صَلُّوا فِي رِحَالِكُمْ لِمَطَرٍ كَانَ",
                "id": "Telah menceritakan kepada kami [Abu Nua'im] telah menceritakan kepada kami [Mis'ar] dari ['Amr bin Dinar] berkata; saya telah mendengar ['Amru bin Aus] berkata; telah mengabarkan kepadaku [orang yang pernah mendengar Muaddzin Rasulullah Shallallahu'alaihiwasallam] ketika sholat ditegakkan atau ketika tiba waktu sholat atau yang seperti itu, menyerukan, \"sholatlah kalian di rumah kalian\", karena turun hujan."
            },
            {
                "number": 361,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ وَعَفَّانُ قَالَا حَدَّثَنَا ثَابِتٌ قَالَ عَفَّانُ بْنُ زَيْدٍ أَبُو زَيْدٍ حَدَّثَنَا هِلَالُ بْنُ خَبَّابٍ عَنْ عِكْرِمَةَ بْنِ خَالِدٍ قَالَ حَدَّثَنِي عَرِيفٌ مِنْ عُرَفَاءِ قُرَيْشٍ حَدَّثَنِي أَبِي أَنَّهُ سَمِعَ مِنْ فَلْقِ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَمَنْ صَامَ رَمَضَانَ وَشَوَّالًا وَالْأَرْبِعَاءَ وَالْخَمِيسَ وَالْجُمُعَةَ دَخَلَ الْجَنَّةَ",
                "id": "Telah menceritakan kepada kami [Abdusshamad] dan ['Affan] berkata; telah menceritakan kepada kami [Tsabit] berkata; ['Affan] bin Zaid, Abu Zaid telah menceritakan kepada kami [Hilal bin Khabbab] dari ['Ikrimah bin Khalid] berkata telah menceritakan kepadaku [salah seorang pemimpin Quraisy], telah menceritakan kepadaku [Bapakku] dia telah mendengar dari majlis subuh Rasulullah Shallallahu'alaihiwasallam, \"Barangsiapa yang berpuasa Ramadhan, Syawwal, Rabu dan Kamis serta Jum'at maka akan masuk surga.\""
            },
            {
                "number": 362,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا عِكْرِمَةُ بْنُ خَالِدٍ الْمَخْزُومِيُّ عَنْ أَبِيهِ أَوْ عَنْ عَمِّهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي غَزْوَةِ تَبُوكَ إِذَا وَقَعَ الطَّاعُونُ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلَا تَخْرُجُوا مِنْهَا وَإِذَا وَقَعَ وَلَسْتُمْ بِهَا فَلَا تَقْدَمُوا عَلَيْهِ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] telah mengabarkan kepada kami ['Ikrimah bin Khalid Al Mahzumi] dari [Bapaknya] atau [pamannya] dari [kakeknya] Rasulullah Shallallahu'alaihiwasallam bersabda pada Perang Tabuk, \"Jika terjadi penyakit Thaun pada suatu tempat, dan kalian sedang bermukim disana, janganlah kalian meninggalkannya, namun jika sedang terjadi suatu tempat dan kalian tidak berdiam disana, janganlah mendatanginya.\""
            },
            {
                "number": 363,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ عِكْرِمَةَ يَعْنِي ابْنَ خَالِدٍ عَنْ أَبِيهِ أَوْ عَنْ عَمِّهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي غَزْوَةِ تَبُوكَ إِذَا وَقَعَ الطَّاعُونُ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلَا تَخْرُجُوا مِنْهَا وَإِذَا كَانَ بِأَرْضٍ وَلَسْتُمْ بِهَا فَلَا تَقْرَبُوهَا",
                "id": "Telah menceritakan kepada kami [Abdusshamad] telah menceritakan kepada kami [Hammad] yaitu Ibnu Salamah, dari ['Ikrimah] yaitu Ibnu Khalid dari [Bapaknya] atau [Pamannya] dari [kakeknya] Rasulullah Shallallahu'alaihiwasallam bersabda pada Perang Tabuk: \"Jika terjadi penyakit Thaun pada suatu tempat, dan kalian sedang kalian berdiam disana, janganlah kalian meninggalkannya, namun jika sedang terjadi suatu tempat dan kalian tidak berdiam disana, janganlah mendekatinya.\""
            },
            {
                "number": 364,
                "arab": "حَدَّثَنَا أَزْهَرُ بْنُ الْقَاسِمِ الرَّاسِبِيُّ حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَاقَ عَنِ الْوَلِيدِ بْنِ عَبْدِ اللَّهِ بْنِ شُمَيْلَةَ عَنْ أَبِي طَرِيفٍ قَالَكُنْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ حَاصَرَ الطَّائِفَ وَكَانَ يُصَلِّي بِنَا صَلَاةَ الْعَصْرِ حَتَّى لَوْ أَنَّ رَجُلًا رَمَى لَرَأَى مَوْقِعَ نَبْلِهِ",
                "id": "Telah menceritakan kepada kami [Azhar bin Al Qasim Ar-Rosi] telah menceritakan kepada kami [Zakariya bin Ishaq] dari [Al Walid bin Abdullah bin Syumailah] dari [Abu Tharif] berkata; saya bersama Rasulullah Shallallahu'alaihiwasallam ketika pengepungan Thaif, maka (Rasulullah Shallallahu'alaihiwasallam) sholat asar bersama kami hingga jikalau orang melempar anak panah maka dia masih bisa melihat tempat anak panahnya (karena keadaan masih terang)."
            },
            {
                "number": 365,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ عُمَارَةَ بْنِ حَدِيدٍ البَجْلِيِّ عَنْ صَخْرٍ الْغَامِدِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ اللَّهُمَّ بَارِكْ لِأُمَّتِي فِي بُكُورِهِمْ قَالَ فَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَعَثَ سَرِيَّةً بَعَثَهَا أَوَّلَ النَّهَارِوَكَانَ صَخْرٌ رَجُلًا تَاجِرًا وَكَانَ لَا يَبْعَثُ غِلْمَانَهُ إِلَّا مِنْ أَوَّلِ النَّهَارِ فَكَثُرَ مَالُهُ حَتَّى كَانَ لَا يَدْرِي أَيْنَ يَضَعُ مَالَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin 'Atho'] dari ['Umarah bin Hadid Al Bajli] dari [Shakhr Al Ghamidi] dari Nabi Shallallahu'alaihiwasallam beliau bersabda: \"Ya Allah, berilah barakah kepada umatku pada pagi hari mereka.\" (Shakhr Al Ghamidi Radliyallahu'anhu) berkata; Rasulullah Shallallahu'alaihiwasallam jika mengutus suatu pasukan, mengutusnya pada permulaan siang. Shakhr adalah seorang pedagang, dia tidak mengirimkan pekerjanya kecuali pada permulaan siang, maka hartanya menjadi banyak sampai tidak tahu harus dimana meletakkan hartanya."
            },
            {
                "number": 366,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو وَسُرَيْجٌ الْمَعْنَى قَالَا حَدَّثَنَا نَافِعُ بْنُ عُمَرَ عَنْ أُمَيَّةَ بْنِ صَفْوَانَ عَنْ أَبِي بَكْرِ بْنِ أَبِي زُهَيْرٍ قَالَ أَبِي كِلَاهُمَا قَالَ عَنْ أَبِي بَكْرِ بْنِ أَبِي زُهَيْرٍ الثَّقَفِيِّ عَنْ أَبِيهِ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِالنَّبَاءَةِ أَوْ بِالنِّبَاوَةِ شَكَّ نَافِعٌ مِنْ الطَّائِفِ وَهُوَ يَقُولُ يَا أَيُّهَا النَّاسُ إِنَّكُمْ تُوشِكُونَ أَنْ تَعْرِفُوا أَهْلَ الْجَنَّةِ مِنْ أَهْلِ النَّارِ أَوْ قَالَ خِيَارَكُمْ مِنْ شِرَارِكُمْ قَالَ فَقَالَ رَجُلٌ مِنْ النَّاسِ بِمَ يَا رَسُولَ اللَّهِ قَالَ بِالثَّنَاءِ السَّيِّئِ وَالثَّنَاءِ الْحَسَنِ وَأَنْتُمْ شُهَدَاءُ اللَّهِ بَعْضُكُمْ عَلَى بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin 'Amr] dan [Suraij] secara makna, berkata; telah menceritakan kepada kami [Nafi' bin 'Umar] dari [Umayyah bin Shafwan] dari [Abu Bakr bin Abu Zuhair] Bapakku berkata; keduanya berkata; dari Abu Bakr bin Abu Zuhair Ats-Tsaqafi dari [Bapaknya] berkata; saya mendengar Nabi Shallallahu'alaihiwasallam bersabda di Naba'ah atau Nabawwah, Nafi' ragu tempat yang mana yang di Thaif, \"Wahai para manusia, kalian hampir saja bisa mengenal penduduk surga dari penduduk neraka\" atau bersabda: \"Orang yang baik kalian dari orang yang jelek kalian\" (Abu Zuhair Radliyallahu'anhu) berkata; ada seorang laki-laki yang bertanya, dengan apa wahai Rasulullah? (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Dengan pujian yang jelek dan pujian yang baik, dan sebagian dari kalian adalah saksi Allah atas sebagian yang lainnya.\""
            },
            {
                "number": 367,
                "arab": "حَدَّثَنَا بَهْزٌ وَعَفَّانُ قَالَا حَدَّثَنَا أَبُو عَوَانَةَ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنِ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ عَنِ الْحَارِثِ بْنِ عَبْدِ اللَّهِ بْنِ أَوْسٍ الثَّقَفِيِّ قَالَسَأَلْتُ عُمَرَ بْنَ الْخَطَّابِ عَنْ الْمَرْأَةِ تَطُوفُ بِالْبَيْتِ ثُمَّ تَحِيضُ قَالَ لِيَكُنْ آخِرَ عَهْدِهَا الطَّوَافُ بِالْبَيْتِ فَقَالَ الْحَارِثُ كَذَلِكَ أَفْتَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَفَقَالَ عُمَرُ رَضِيَ اللَّهُ تَعَالَى عَنْهُ أَدَّيْتَ عَنْ يَدَيْكَ سَأَلْتَنِي عَنْ شَيْءٍ سَأَلْتُ عَنْهُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَكِنِّي مَا أُخَالِفُ",
                "id": "Telah menceritakan kepada kami [Bahz] dan ['Affan] berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Ya'la bin 'Atha'] dari [Al Walid bin Abdurrahman] dari [Al Harits bin Abdullah bin Aus Ats-Tsaqafi] berkata; saya bertanya pada ['Umar bin Khattab] tentang seorang wanita yang thawaf di Ka'bah kemudian dia haid. ('Umar radliyallahu'anhu) berkata; hendaknya (wanita haid itu) menjadikan penutup hajinya dengan thawaf di Ka'bah. Al Harits berkata; begitulah Rasulullah Shallallahu'alaihiwasallam berfatwa kepadaku. 'Umar radliyallahu'anhu berkata; \"Celaka kamu, kamu bertanya sesuatu kepadaku yang saya telah menanyakannya kepada Rasulullah Shallallahu'alaihiwasallam, tapi saya tidak menyelisihinya.\""
            },
            {
                "number": 368,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَجَّاجِ وَعَلِيُّ بْنُ إِسْحَاقَ قَالَا أَخْبَرَنَا عَبْدُ اللَّهِ قَالَ أَخْبَرَنَا الْحَجَّاجُ بْنُ أَرْطَاةَ عَنْ عَبْدِ الْمَلِكِ بْنِ الْمُغِيرَةِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْبَيْلَمَانِيِّ عَنْ عَمْرِو بْنِ أَوْسٍ عَنِ الْحَارِثِ بْنِ عَبْدِ اللَّهِ بْنِ أَوْسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَجَّ الْبَيْتَ أَوْ اعْتَمَرَ فَلْيَكُنْ آخِرُ عَهْدِهِ بِالْبَيْتِفَبَلَغَ حَدِيثُهُ عُمَرَ رَضِيَ اللَّهُ تَعَالَى عَنْهُ فَقَالَ لَهُ خَرَرْتَ مِنْ يَدِكَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ تُخْبِرْنَا بِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Al Hajjaj] dan ['Ali bin Ishaq] berkata; telah mengabarkan kepada kami [Abdullah] berkata; telah mengabarkan kepada kami [Al Hajjaj bin Arthah] dari [Abdul Malik bin Al Mughirah] dari [Abdurrahman bin Al Bailamani] dari ['Amar bin Aus] dari [Al Harits bin Abdullah bin Aus] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Barangsiapa yang berhaji menuju Baitullah atau berumrah, maka akhir amalannya yaitu di Ka'bah.\" Hadits itu sampai pada 'Umar radliyallahu'anhu, lalu dia dan berkata kepadanya.\"Celaka kamu, kamu telah mendengarnya dari Rasulullah Shallallahu'alaihiwasallam namun kamu tidak mengabarkannya kepada kami.\""
            },
            {
                "number": 369,
                "arab": "حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ قَالَ أَخْبَرَنَا عَبَّادٌ عَنِ الْحَجَّاجِ بْنِ أَرْطَاةَ عَنْ عَبْدِ الْمَلِكِ بْنِ الْمُغِيرَةِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْبَيْلَمَانِيِّ عَنْ عَمْرِو بْنِ أَوْسٍ عَنِ الْحَارِثِ بْنِ أَوْسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَجَّ أَوْ اعْتَمَرَ فَلْيَكُنْ آخِرَ عَهْدِهِ الطَّوَافُ بِالْبَيْتِفَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ خَرَرْتَ مِنْ يَدَيْكَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ لَمْ تُحَدِّثْنِي",
                "id": "Telah menceritakan kepada kami [Suraij bin An-Nu'man] berkata; telah mengabarkan kepada kami ['Abbad] dari [Al Hajjaj bin Arthah] dari [Abdul Malik bin Al Mughirah] dari [Abdurrahman bin Al Bailamani] dari ['Amar bin Aus] dari [Al Harits bin Abdullah bin Aus] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Barangsiapa yang berhaji atau berUmrah, maka akhir amalannya yaitu thawaf di Ka'bah.\" Lalu 'Umar bin Khattab berkata kepadanya.\"Celaka kamu, kamu telah mendengar hal itu dari Rasulullah Shallallahu'alaihiwasallam namun kamu tidak mengabarkannya kepadaku.\""
            },
            {
                "number": 370,
                "arab": "حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا يَعْلَى بْنُ عَطَاءٍ عَنْ عُمَارَةَ بْنِ حَدِيدٍ عَنْ صَخْرٍ الْغَامِدِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ بَارِكْ لِأُمَّتِي فِي بُكُورِهَا قَالَ فَكَانَ إِذَا بَعَثَ سَرِيَّةً أَوْ جَيْشًا بَعَثَهُمْ مِنْ أَوَّلِ النَّهَارِقَالَ فَكَانَ صَخْرٌ رَجُلًا تَاجِرًا وَكَانَ يَبْعَثُ تِجَارَتَهُ مِنْ أَوَّلِ النَّهَارِ قَالَ فَأَثْرَى وَكَثُرَ مَالُهُ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah menceritakan kepada kami [Ya'la bin 'Atha'] dari ['Umarah bin Hadid] dari [Shakhr Al Ghamidi] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Ya Allah, berilah barakah kepada umatku pada pagi harinya.\" (Shakhr Al Ghamidi Radliyallahu'anhu) berkata; jika beliau mengutus suatu pasukan atau kelompok tentara, mengutus mereka dari permulaan siang. ('Umarah bin Hadid Radliyallahu'anhu) berkata; Shakhr adalah seorang pedagang, jika dia mengirimkan dagangannya maka pada permulaan siang, maka hal itu hartanya menjadi banyak dan melimpah."
            },
            {
                "number": 371,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ أَنَّ أَبَا الْمِنْهَالِ أَخْبَرَهُ أَنَّ إِيَاسَ بْنَ عَبْدٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَلَا تَبِيعُوا فَضْلَ الْمَاءِ فَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْمَاءِقَالَ وَالنَّاسُ يَبِيعُونَ مَاءَ الْفُرَاتِ فَنَهَاهُمْ",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Ibnu Juraij] berkata; telah mengabarkan kepadaku ['Amr bin Dinar] [Abu Al Minhal] mengabarinya [Iyas bin Abd] salah seorang sahabat Nabi Shallallahu'alaihiwasallam berkata; janganlah kalian menjual air yang lebih, karena Nabi Shallallahu'alaihiwasallam melarang untuk menjual air yang lebih. (Abu Minhal Radliyallahu'anhu) berkata; ketika itu orang-orang menjual air sungai Eufrat, lalu (Iyas bin Abd Radliyallahu'anhu) melarangnya."
            },
            {
                "number": 372,
                "arab": "حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ أَخْبَرَنَا عَمْرُو بْنُ كَثِيرٍ الْمَكِّيُّ قَالَ سَأَلْتُ عَبْدَ الرَّحْمَنِ بْنَ كَيْسَانَ مَوْلَى خَالِدِ بْنِ أُسَيْدٍ قُلْتُ أَلَا تُحَدِّثُنِي عَنْ أَبِيكَ فَقَالَ مَا سَأَلْتَنِي فَقَالَ حَدَّثَنِي أَبِي أَنَّهُرَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ الْمَطَابِخِ حَتَّى أَتَى الْبِئْرَ وَهُوَ مُتَّزِرٌ بِإِزَارٍ لَيْسَ عَلَيْهِ رِدَاءٌ فَرَأَى عِنْدَ الْبِئْرِ عَبِيدًا يُصَلُّونَ فَحَلَّ الْإِزَارَ وَتَوَشَّحَ بِهِ وَصَلَّى رَكْعَتَيْنِ لَا أَدْرِي الظُّهْرَ أَوْ الْعَصْرَ",
                "id": "Telah menceritakan kepada kami [Yunus bin Muhammad] telah mengabarkan kepada kami ['Amr bin Katsir Al Makki] berkata; saya bertanya kepada [Abdurrahman bin Kaisan] budak Khalid bin Usaid, saya berkata; maukah kamu menceritakan kepadaku dari bapakmu, Dia berkata; apa yang kamu tanyakan? Dia berkata; telah menceritakan kepadaku [bapakku], dia telah melihat Rasulullah Shallallahu'alaihiwasallam keluar dari dapur menuju ke sumur dalam kedaan memakai sarung dengan tidak memakai selendang. ketika di sumur, beliau melihat budak-budak yang sedang sholat, lalu beliau melepas sarungnya lalu menyandangnya dan sholat dua rekaat, saya tidak tahu zhuhur atau asar."
            },
            {
                "number": 373,
                "arab": "حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ حَدَّثَنَا عَمْرُو بْنُ كَثِيرِ بْنِ أَفْلَحَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَيْسَانَ قَالَ سَأَلْتُ أَبِي كَيْسَانَمَا أَدْرَكْتَ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَأَيْتُهُ يُصَلِّي عِنْدَ الْبِئْرِ الْعُلْيَا بِبِئْرِ بَنِي مُطِيعٍ مُلَبَّبًا فِي ثَوْبٍ الظُّهْرَ أَوْ الْعَصْرَ فَصَلَّاهَا رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Hammad bin Khalid Al Khoyyath] telah menceritakan kepada kami ['Amr bin Katsir bin Aflah] dari [Abdurrahman bin Kaisan] berkata; saya bertanya kepada [Abu Kaisan] apa yang kamu dapatkan dari Nabi Shallallahu'alaihiwasallam?. Dia menjawab, saya melihat beliau sholat zhuhur atau ashar di samping sumur yang tinggi yang terletak pada Bani Muthi', dengan mengikatkan satu kain dua rekaat."
            },
            {
                "number": 374,
                "arab": "حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ الْمُهَلَّبِيُّ عَنْ هِشَامِ بْنِ زِيَادٍ عَنْ عُثْمَانَ بْنِ الْأَرْقَمِ بْنِ أَبِي الْأَرْقَمِ الْمَخْزُومِيِّ عَنْ أَبِيهِ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الَّذِي يَتَخَطَّى رِقَابَ النَّاسِ يَوْمَ الْجُمُعَةِ وَيُفَرِّقُ بَيْنَ الِاثْنَيْنِ بَعْدَ خُرُوجِ الْإِمَامِ كَالْجَارِّ قُصْبَهُ فِي النَّارِ",
                "id": "Telah menceritakan kepada kami ['Abbad bin 'Abbad Al Muhallabi] dari [Hisyam bin Ziyad] dari ['Utsman bin Al Arqam bin Abu Al Arqam Al Mahzumi] dari [Bapaknya], dia adalah salah seorang sahabat Nabi Shallallahu'alaihiwasallam, Nabi Shallallahu'alaihiwasallam bersabda: \"Orang yang melangkahi leher orang-orang pada Hari Jum'at atau, menyela antara dua orang setelah datangnya seorang khatib, seperti orang yang menarik ususnya di neraka.\""
            },
            {
                "number": 375,
                "arab": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا أَبُو مُعَاوِيَةَ يَعْنِي شَيْبَانَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ أَنَّ ابْنَ عَابِسٍ الْجُهَنِيَّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا ابْنَ عَابِسٍ أَلَا أُخْبِرُكَ بِأَفْضَلِ مَا تَعَوَّذَ بِهِ الْمُتَعَوِّذُونَ قُلْتُ بَلَى يَا رَسُولَ اللَّهِ قَالَ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ وَقُلْ أَعُوذُ بِرَبِّ النَّاسِ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Abu Mu'awiyah] yaitu Syaiban dari [Yahya bin Abu Katsir] dari [Muhammad bin Ibrahim], [Ibnu 'Abis Al Juhani] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Wahai Ibnu 'Abbas, maukah kamu kuberitahu tentang bacaan yang paling utama, yang dibaca oleh orang yang memohon perlindungan?\" Dia berkata; Ya wahai Rasulullah! (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Bacalah, QUL A'UDZU BIROBBIL FALAQ dan QUL A'UDZU BIROBBIN NAAS \""
            },
            {
                "number": 376,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ إِسْحَاقَ أَخْبَرَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ مُبَارَكٍ قَالَ أَخْبَرَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي الْمُطَّلِبُ بْنُ حَنْطَبٍ الْمَخْزُومِيُّ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ الْأَنْصَارِيُّ حَدَّثَنِي أَبِي قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزَاةٍ فَأَصَابَ النَّاسَ مَخْمَصَةٌ فَاسْتَأْذَنَ النَّاسُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَحْرِ بَعْضِ ظُهُورِهِمْ وَقَالُوا يُبَلِّغُنَا اللَّهُ بِهِ فَلَمَّا رَأَى عُمَرُ بْنُ الْخَطَّابِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ هَمَّ أَنْ يَأْذَنَ لَهُمْ فِي نَحْرِ بَعْضِ ظَهْرِهِمْ قَالَ يَا رَسُولَ اللَّهِ كَيْفَ بِنَا إِذَا نَحْنُ لَقِينَا الْقَوْمَ غَدًا جِيَاعًا أَرْجَالًا وَلَكِنْ إِنْ رَأَيْتَ يَا رَسُولَ اللَّهِ أَنْ تَدْعُوَ لَنَا بِبَقَايَا أَزْوَادِهِمْ فَتَجْمَعَهَا ثُمَّ تَدْعُوَ اللَّهَ فِيهَا بِالْبَرَكَةِ فَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى سَيُبَلِّغُنَا بِدَعْوَتِكَ أَوْ قَالَ سَيُبَارِكُ لَنَا فِي دَعْوَتِكَ فَدَعَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبَقَايَا أَزْوَادِهِمْ فَجَعَلَ النَّاسُ يُجِيئُونَ بِالْحَثْيَةِ مِنْ الطَّعَامِ وَفَوْقَ ذَلِكَ وَكَانَ أَعْلَاهُمْ مَنْ جَاءَ بِصَاعٍ مِنْ تَمْرٍ فَجَمَعَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَامَ فَدَعَا مَا شَاءَ اللَّهُ أَنْ يَدْعُوَ ثُمَّ دَعَا الْجَيْشَ بِأَوْعِيَتِهِمْ فَأَمَرَهُمْ أَنْ يَحْتَثُوا فَمَا بَقِيَ فِي الْجَيْشِ وِعَاءٌ إِلَّا مَلَئُوهُ وَبَقِيَ مِثْلُهُ فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى بَدَتْ نَوَاجِذُهُ فَقَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ لَا يَلْقَى اللَّهَ عَبْدٌ مُؤْمِنٌ بِهِمَا إِلَّا حُجِبَتْ عَنْهُ النَّارُ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami ['Ali bin Ishaq] telah mengabarkan kepada kami [Abdullah] yaitu Ibnu Mubarak, berkata; telah mengabarkan kepada kami [Al Auza'i] berkata; telah menceritakan kepadaku [Al Muthalib bin Hanthab Al Mahzumi] berkata; telah menceritakan kepadaku [Abdurrahman bin Abu 'Amrah Al Anshari] telah menceritakan kepadaku [Bapakku] berkata; kami bersama Rasulullah Shallallahu'alaihiwasallam dalam sebuah peperangan, lalu para pasukan tertimpa kelaparan hingga mereka meminta ijin kepada Rasulullah Shallallahu'alaihiwasallam untuk menyembelih sebagian kendaraan mereka, dan mereka berkata; 'Semoga Allah membuat kita cukup dengannya.' Tatkala 'Umar bin Khattab mengetahui Rasulullah Shallallahu'alaihiwasallam hendak mengijinkan mereka untuk menyembelih sebagian kendaraan mereka, ia berkata; 'Wahai Rasulullah bagaimana jika besok kita bertemu dengan musuh dalam keadaan lapar dan berjalan kaki. namun jika anda mau, suruhlah kami untuk mengumpulkan sisa-sisa bekal mereka, lalu anda mengumpulkannya dan berdoa kepada Allah memohon barokah kepada-Nya, niscaya Allah akan mencukupkan kita dengan doa anda. atau berkata; Allah akan memberi barokah kita dengan doa anda.' Nabi Shallallahu'alaihiwasallam menyuruh untuk mengumpulkan perbekalan mereka, hingga orang-orang mengumpulkan perbekalan mereka. Ada yang menyerahkan satu cakupan makanan, ada yang lebih dari itu, dan paling banyak dari mereka adalah yang datang dengan membawa dengan satu sho' kurma. Nabi Shallallahu'alaihiwasallam mengumpulkannya, lalu berdoa dengan do'anya, lalu menyuruh para pasukan untuk membawa tempat makanan dan menyuruh mereka untuk mencakup perbekalan makanan yang telah dikumpulkan, maka tak ada seorang pun yang membawa tempat makanan mereka melainkan mereka telah mengisinya dengan makanan tersebut dan ternyata masih tetap utuh seperti sedia kala. Nabi Shallallahu'alaihiwasallam tersenyum hingga terlihat gerahamnya, lalu bersabda: \"ASYHADU AN LAA ILAAHA ILLA ALLAH WA ANNI ROSULULLOH, tidak seorang hamba yang mukmin yang bertemu Allah dengan kedua kalimat ini melainkan neraka ditutup darinya.\""
            },
            {
                "number": 377,
                "arab": "حَدَّثَنَا هُشَيْمٌ قَالَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ قَالَ أَخْبَرَنِي عِيسَى بْنُ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ عَنْ عُمَيْرِ بْنِ سَلَمَةَ الضَّمْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِالْعَرْجِ فَإِذَا هُوَ بِحِمَارٍ عَقِيرٍ فَلَمْ يَلْبَثْ أَنْ جَاءَ رَجُلٌ مِنْ بَهْزٍ فَقَالَ يَا رَسُولَ اللَّهِ هَذِهِ رَمْيَتِي فَشَأْنُكُمْ بِهَا فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَقَسَمَهُ بَيْنَ الرِّفَاقِ ثُمَّ سَارَ حَتَّى أَتَى عَقَبَةَ أُثَايَةَ فَإِذَا هُوَ بِظَبْيٍ فِيهِ سَهْمٌ وَهُوَ حَاقِفٌ فِي ظِلِّ صَخْرَةٍ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا مِنْ أَصْحَابِهِ فَقَالَ قِفْ هَاهُنَا حَتَّى يَمُرَّ الرِّفَاقُ لَا يَرْمِيهِ أَحَدٌ بِشَيْءٍ",
                "id": "Telah menceritakan kepada kami [Husyaim] berkata; telah mengabarkan kepada kami [Yahya bin Sa'id] dari [Muhammad bin Ibrahim] berkata; telah menceritakan kepadaku ['Isa bin Thalhah bin 'ubaidhullah] dari ['Umair bin Salamah Adl Dlamri] Rasulullah Shallallahu'alaihiwasallam melewati 'Aroj (dalam keadaan ihram), lantas ada seekor keledai yang terbunuh dan Rasulullah Shallallahu'alaihiwasallam membiarkannya hingga datang seorang laki-laki dari Bahzi dan berkata 'Wahai Rasulullah ini adalah buruanku, maka terserah apa yang anda perbuat.' Lalu Rasulullah Shallallahu'alaihiwasallam menyuruh Abu Bakar radliyallahu'anhu hingga dia membagikannya kepada para sahabat yang menyertainya. Lalu Rasulullah Shallallahu'alaihiwasallam pergi berjalan hingga ketika sampai di Utsayah maka ada seekor rusa yang terkena anak panah dan terbaring melingkar pada lubang batu besar, Nabi Shallallahu'alaihiwasallam memerintahkan salah seorang dari sahabatnya seraya bersabda: \"Berhentilah disini\", hingga para sahabat yang mengikuti Nabi Shallallahu'alaihiwasallam melewati rusa tersebut begitu saja tanpa ada seorangpun yang melemparnya dengan sesuatu."
            },
            {
                "number": 378,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا أَبُو بَلْجٍ عَنْ مُحَمَّدِ بْنِ حَاطِبٍ الْجُمَحِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصْلٌ بَيْنَ الْحَلَالِ وَالْحَرَامِ الدُّفُّ وَالصَّوْتُ فِي النِّكَاحِ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Abu Balj] dari [Muhammad bin Hathib Al Jumahi] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Yang memisahkan antara halal dan haram adalah rebana dan suara nyanyian dalam acara pernikahan.\""
            },
            {
                "number": 379,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ عَنْ سِمَاكٍ قَالَ قَالَ مُحَمَّدُ بْنُ حَاطِبٍانْصَبَّتْ عَلَى يَدِي مِنْ قِدْرٍ فَذَهَبَتْ بِي أُمِّي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي مَكَانٍ قَالَ فَقَالَ كَلَامًا فِيهِ أَذْهِبْ الْبَاسْ رَبَّ النَّاسْ وَأَحْسِبُهُ قَالَ اشْفِ أَنْتَ الشَّافِي قَالَ وَكَانَ يَتْفُلُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] dari [Simak] berkata; [Muhammad bin Hathib] berkata; tanganku tertuang oleh air panas dari sebuah bejana, lalu ibuku membawaku kepada Rasulullah Shallallahu'alaihiwasallam yang berada pada sebuah tempat. (Hathib Radliyallahu'anhu) berkata; beliau mengucapkan sebuah perkataan di dalamnya, ADZHIBIL BA'SA ROBBAN NAS (Hilangkanlah sakitnya wahai Tuhan para manusia) \", saya mengira beliau juga bersabda: \"ISYFI ANTAS SYAAFII\" (Sembuhkanlah karena Engkaulah yang Maha Menyembuhkan). (Hathib Radliyallahu'anhu) berkata; beliau meludah."
            },
            {
                "number": 380,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْعَبَّاسِ وَيُونُسُ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عُثْمَانَ قَالَ إِبْرَاهِيمُ بْنُ الْعَبَّاسِ فِي حَدِيثِهِ ابْنُ إِبْرَاهِيمَ بْنُ مُحَمَّدِ بْنِ حَاطِبٍ قَالَ حَدَّثَنِي أَبِي عَنْ جَدِّهِ مُحَمَّدِ بْنِ حَاطِبٍ عَنْ أُمِّهِ أُمِّ جَمِيلٍ بِنْتِ الْمُجَلِّلِقَالَتْ أَقْبَلْتُ بِكَ مِنْ أَرْضِ الْحَبَشَةِ حَتَّى إِذَا كُنْتُ مِنْ الْمَدِينَةِ عَلَى لَيْلَةٍ أَوْ لَيْلَتَيْنِ طَبَخْتُ لَكَ طَبِيخًا فَفَنِيَ الْحَطَبُ فَخَرَجْتُ أَطْلُبُهُ فَتَنَاوَلْتَ الْقِدْرَ فَانْكَفَأَتْ عَلَى ذِرَاعِكَ فَأَتَيْتُ بِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ بِأَبِي وَأُمِّي يَا رَسُولَ اللَّهِ هَذَا مُحَمَّدُ بْنُ حَاطِبٍ فَتَفَلَ فِي فِيكَ وَمَسَحَ عَلَى رَأْسِكَ وَدَعَا لَكَ وَجَعَلَ يَتْفُلُ عَلَى يَدَيْكَ وَيَقُولُ أَذْهِبْ الْبَاسْ رَبَّ النَّاسْ وَاشْفِ أَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءً لَا يُغَادِرُ سَقَمًا فَقَالَتْ فَمَا قُمْتُ بِكَ مِنْ عِنْدِهِ حَتَّى بَرَأَتْ يَدُكَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Abu Al 'Abbas] dan [Yunus bin Muhammad] berkata; telah menceritakan kepada kami [Abdurrahman bin 'Utsman] berkata; [Ibrahim bin Abu Al 'Abbas] dalam haditsnya [Ibnu Ibrahim bin Muhammad bin Hathib], berkata; telah menceritakan kepadaku [bapakku] dari kakeknya, [Muhammad bin Hathib] dari ibunya, [Ummu Jamil binti Al Mujallil], berkata; saya menemuimu dari Habasyah sampai jika saya di Madinah selama satu atau dua hari, saya memasakkan untukmu, namun kayunya habis, lalu saya keluar untuk memintanya. Kamu memegang bejana, ternyata terbalik dan mengenai tanganmu, lalu saya membawamu menemui Nabi Shallallahu'alaihiwasallam. Saya katakan kepada beliau, demi bapakku dan ibuku Wahai Rasulullah, ini adalah Muhammad bin Hathib, lalu beliau meludah pada mulutmu dan membasuh kepalamu dan mendo'akanmu, lalu beliau meludah pada tanganmu dan membaca: \"Hilangkanlah sakitnya, wahai rabb manusia, Sembuhkanlah karena Engkaulah yang Maha Menyembuhkan. Tidak ada kesembuhan kecuali kesembuhan dari-Mu. Kesembuhan yang tidak menyisakan penyakitpun.\" (Ummu Jamil Radliyallahu'anhuma) berkata; tidaklah saya berdiri denganmu untuk meninggalkan beliau, sehingga tanganmu telah sembuh."
            },
            {
                "number": 381,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْعَبَّاسِ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ مُحَمَّدِ بْنِ حَاطِبٍقَالَ دَبَبْتُ إِلَى قِدْرٍ وَهِيَ تَغْلِي فَأَدْخَلْتُ يَدِي فِيهَا فَاحْتَرَقَتْ أَوْ قَالَ فَوَرِمَتْ يَدِي فَذَهَبَتْ بِي أُمِّي إِلَى رَجُلٍ كَانَ بِالْبَطْحَاءِ فَقَالَ شَيْئًا وَنَفَثَ فَلَمَّا كَانَ فِي إِمْرَةِ عُثْمَانَ قُلْتُ لِأُمِّي مَنْ كَانَ ذَلِكَ الرَّجُلُ قَالَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Abu Al 'Abbas] berkata; telah menceritakan kepada kami [Syarik] dari [Simak bin Harb] dari [Muhammad bin Hathib] berkata; saya merangkak ke sebuah bejana, ternyata sedang mendidih, kumasukkan tanganku ke dalamnya dan terbakarlah tanganku, sehingga tanganku melepuh, lalu ibuku membawaku ke seorang laki-laki di Bathha' lalu dia membaca sesuatu dan meniupnya. Tatkala pada masa pemerintahan 'Utsman, saya bertanya kepada ibuku, siapa orang tersebut. Dia menjawab, dia adalah Rasulullah Shallallahu'alaihiwasallam."
            },
            {
                "number": 382,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا أَبِي حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ قَالَ حَدَّثَنِي حَكِيمُ بْنُ أَبِي يَزِيدٍ عَنْ أَبِيهِ قَالَ حَدَّثَنِي أَبِيأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ دَعُوا النَّاسَ يُصِيبُ بَعْضُهُمْ مِنْ بَعْضٍ فَإِذَا اسْتَنْصَحَ أَحَدُكُمْ أَخَاهُ فَلْيَنْصَحْهُ",
                "id": "Telah menceritakan kepada kami [Abdusshamad] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami ['Atho' bin As-Sa'ib] berkata; telah menceritakan kepadaku [Hakim bin Abu Yazid] dari [Bapaknya] berkata; telah menceritakan kepadaku [bapakku] Rasulullah Shallallahu'alaihiwasallam bersabda: \"Biarkanlah orang-orang saling membenarkan sebagian dari mereka atas sebagian yang lain, jika salah satu dari kalian memohon nasehat kepada saudaranya maka berilah dia nasehat.\""
            },
            {
                "number": 383,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنِي أَبُو الْحُوَيْرِثِ حَفْصٌ مِنْ وَلَدِ عُثْمَانَ بْنِ أَبِي الْعَاصِ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ يَعْلَى بْنِ كَعْبٍ عَنْ مَيْمُونَةَ بِنْتِ كَرْدَمٍ عَنْ أَبِيهَا كَرْدَمِ بْنِ سُفْيَانَأَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَذْرٍ نُذِرَ فِي الْجَاهِلِيَّةِ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلِوَثَنٍ أَوْ لِنُصُبٍ قَالَ لَا وَلَكِنْ لِلَّهِ تَبَارَكَ وَتَعَالَى قَالَ فَأَوْفِ لِلَّهِ تَبَارَكَ وَتَعَالَى مَا جَعَلْتَ لَهُ انْحَرْ عَلَى بُوَانَةَ وَأَوْفِ بِنَذْرِكَ",
                "id": "Telah menceritakan kepada kami [Abdusshamad] telah menceritakan kepadaku [Abu Al Huwairits, Hafsh dari anak laki-laki 'Utsman bin Abu Al Ash], berkata; telah menceritakan kepadaku [Abdullah bin Abdurrahman bin Ya'la bin Ka'b] dari dari [Maimunah binti Kardam] dari [Bapaknya, Kardam bin Sufyan] dia telah bertanya kepada Rasulullah Shallallahu'alaihiwasallam tentang nadzar yang di ikrarkan di waktu Jahiliyyah. Nabi Shallallahu'alaihiwasallam bersabda kepadanya, apakah untuk berhala atau untuk patung? Dia berkata; tidak, tapi untuk Allah Tabaroka wa ta'ala, (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Tepatilah nadzar kamu untuk Allah Tabaroka wa ta'ala, apa yang telah kamu janjikan pada-Nya, sembelihlah di Buwanah dan tepatilah nadzarmu.\""
            },
            {
                "number": 384,
                "arab": "حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ فَضَاءٍ يُحَدِّثُ عَنْ أَبِيهِ عَنْ عَلْقَمَةَ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَنَهَى نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُكْسَرَ سِكَّةُ الْمُسْلِمِينَ الْجَائِزَةُ بَيْنَهُمْ إِلَّا مِنْ بَأْسٍ",
                "id": "Telah menceritakan kepada kami [Mu'tamir bin Sulaiman] berkata; saya telah mendengar [Muhammad bin Fadlo'] menceritakan dari [Bapaknya] dari [Al Qomah bin Abdullah] dari [Bapaknya] berkata; Nabiyullah Shallallahu'alaihiwasallam melarang memecah (merusak) mata uang kaum muslimin yang berlaku di antara mereka kecuali jika rusak sendiri."
            },
            {
                "number": 385,
                "arab": "حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنِي أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ فَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ ضَمْرَةَ الْفَزَارِيُّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي سَلِيطٍ عَنْ أَبِيهِ أَبِي سَلِيطٍ قَالَأَتَانَا نَهْيُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ لُحُومِ الْحُمُرِ الْإِنْسِيَّةِ وَالْقُدُورُ تَفُورُ بِهَا فَكَفَأْنَاهَا عَلَى وُجُوهِهَا",
                "id": "Telah menceritakan kepada kami [Ya'qub] berkata; telah menceritakan kepadaku [bapakku] dari [Ibnu Ishaq] berkata; telah menceritakan kepadaku [Abdullah bin 'Amr bin Dlomroh Al Fazari] dari [Abdullah bin Abu Salith] dari [Bapaknya, Abi Salith] berkata; telah sampai kepada kami larangan Rasulullah Shallallahu'alaihiwasallam tentang memakan keledai yang dipakai untuk kendaraan dan makanan dalam bejana yang masih menyala-nyala (yang masih mendidih) hingga kami menuangkan isinya."
            },
            {
                "number": 386,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ قَالَ عَبْد اللَّهِ وَسَمِعْتُ أَنَا مِنْ ابْنِ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ ضَمُرَةَ الْفَزَارِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي سَلِيطٍ عَنْ أَبِيهِ أَبِي سَلِيطٍ وَكَانَ بَدْرِيًّا قَالَأَتَانَا نَهْيُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لُحُومِ الْحُمُرِ وَنَحْنُ بِخَيْبَرَ فَكَفَأْنَاهَا وَإِنَّا لَجِيَاعٌ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad bin Abu Syaibah] Abdullah berkata; saya telah mendengar [Ibnu Abu Syaibah] berkata; telah menceritakan kepada kami [Abdullah bin Numair] dari [Muhammad bin Ishaq] dari [Abdullah bin 'Amr bin Dlamrah Al Fazari] dari [Abdullah bin Abu Salith] dari [Bapaknya, Abi Salith] dia adalah termasuk Ahli Badar, berkata; sampai kepada kami larangan Rasulullah Shallallahu'alaihiwasallam tentang daging keledai dan kami sedang di Khaibar, lalu kami menumpahkannya saat kami dalam keadaan lapar."
            },
            {
                "number": 387,
                "arab": "حَدَّثَنَا سَيَّارُ بْنُ حَاتِمٍ أَبُو سَلَمَةَ الْعَنَزِيُّ قَالَ حَدَّثَنَا جَعْفَرٌ يَعْنِي ابْنَ سُلَيْمَانَ قَالَ حَدَّثَنَا أَبُو التَّيَّاحِ قَالَ قُلْتُ لِعَبْدِ الرَّحْمَنِ بْنِ خَنْبَشٍ التَّمِيمِيِّ وَكَانَ كَبِيرًاأَدْرَكْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ قَالَ قُلْتُ كَيْفَ صَنَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ كَادَتْهُ الشَّيَاطِينُ فَقَالَ إِنَّ الشَّيَاطِينَ تَحَدَّرَتْ تِلْكَ اللَّيْلَةَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْأَوْدِيَةِ وَالشِّعَابِ وَفِيهِمْ شَيْطَانٌ بِيَدِهِ شُعْلَةُ نَارٍ يُرِيدُ أَنْ يُحْرِقَ بِهَا وَجْهَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَبَطَ إِلَيْهِ جِبْرِيلُ عَلَيْهِ السَّلَام فَقَالَ يَا مُحَمَّدُ قُلْ قَالَ مَا أَقُولُ قَالَ قُلْ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ شَرِّ مَا خَلَقَ وَذَرَأَ وَبَرَأَ وَمِنْ شَرِّ مَا يَنْزِلُ مِنْ السَّمَاءِ وَمِنْ شَرِّ مَا يَعْرُجُ فِيهَا وَمِنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ وَمِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقًا يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ قَالَ فَطَفِئَتْ نَارُهُمْ وَهَزَمَهُمْ اللَّهُ تَبَارَكَ وَتَعَالَى",
                "id": "Telah menceritakan kepada kami [Sayyar bin Hatim Abu Salamah Al 'Anazi] berkata; telah menceritakan kepada kami [Ja'far] yaitu Ibnu Sulaiman berkata; telah menceritakan kepada kami [Abu At Tayah] berkata; saya bertanya kepada [Abdur Rahman bin Khanbasy At Tamimi] yang pada waktu itu sudah tua usia, apakah kamu bertemu Rasulullah Shallallahu'alaihiwasallam? dia berkata; Ya. (Abut At Tayyah Radliyallahu'anhu) berkata; apa yang dilakukan Rasulullah Shallallahu'alaihiwasallam ketika datang setan kepadanya?. dia berkata; \" Setan datang secara bergemuruh kepada Rasulullah Shallallahu'alaihiwasallam pada malam itu dari lembah-lembah dan bukit-bukit dan di antara mereka ada yang membawa obor di tangannya, hendak membakar wajah Rasulullah Shallallahu'alaihiwasallam, lalu Jibril Alaihissalam turun kepada (Rasulullah Shallallahu'alaihiwasallam) dan berkata; wahai Muhammad katakanlah! Beliau bertanya, \"Apa yang saya harus baca?\" (Jibril alaihissalam) berkata; bacalah: A'UDZU BI KALIMATILLAHI TAAMMATI MIN SYARRI MAA KHOLAQ WA DZAROA WA BAROA WA MIN SYARRI MA YANZIL MINAS SAMAAI WA MIN SYARRI MA YA'RUJU FIIHAA WA MIN SYARRI FITANIL LAILI WAN NAHAARI WA MIN SYARRI KULLI THORIQIN ILLAA THOORIQON YATHRUQU BI KHOIRIN YA ROHMAN (aku berlindung dengan kalimat Allah yang sempurna dari kejelekan yang Dia ciptakan, yang Dia buat dan yang Dia adakan dan dari kejelekan apa saja yang turun dari langit dan dari kejelekan apa saja yang naik padaNya, dan dari kejelekan fitnah malam dan siang, dan dari kejelekan yang datang pada malam hari kecuali yang datang dengan kebaikan wahai Rahman (tuhan yang maha pengasih). (Abdur Rahman Radliyallahu'anhu) berkata; lalu api mereka padam dan Allah Tabaaroka wa ta'ala menghancurkan mereka.\""
            },
            {
                "number": 388,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ حَدَّثَنَا أَبُو التَّيَّاحِ قَالَ سَأَلَ رَجُلٌ عَبْدَ الرَّحْمَنِ بْنَ خَنْبَشٍكَيْفَ صَنَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ كَادَتْهُ الشَّيَاطِينُ قَالَ جَاءَتْ الشَّيَاطِينُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْأَوْدِيَةِ وَتَحَدَّرَتْ عَلَيْهِ مِنْ الْجِبَالِ وَفِيهِمْ شَيْطَانٌ مَعَهُ شُعْلَةٌ مِنْ نَارٍ يُرِيدُ أَنْ يُحْرِقَ بِهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَرُعِبَ قَالَ جَعْفَرٌ أَحْسَبُهُ قَالَ جَعَلَ يَتَأَخَّرُ قَالَ وَجَاءَ جِبْرِيلُ عَلَيْهِ السَّلَام فَقَالَ يَا مُحَمَّدُ قُلْ قَالَ مَا أَقُولُ قَالَ قُلْ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ وَلَا فَاجِرٌ مِنْ شَرِّ مَا خَلَقَ وَذَرَأَ وَبَرَأَ وَمِنْ شَرِّ مَا يَنْزِلُ مِنْ السَّمَاءِ وَمِنْ شَرِّ مَا يَعْرُجُ فِيهَا وَمِنْ شَرِّ مَا ذَرَأَ فِي الْأَرْضِ وَمِنْ شَرِّ مَا يَخْرُجُ مِنْهَا وَمِنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ وَمِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقًا يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ فَطَفِئَتْ نَارُ الشَّيَاطِينِ وَهَزَمَهُمْ اللَّهُ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Ja'far bin Sulaiman] telah menceritakan kepada kami [Abu At Tayah] berkata; seseorang bertanya kepada [Abdur Rahman bin Khanbasy] apa yang dilakukan Rasulullah Shallallahu'alaihiwasallam ketika datang setan kepadanya?. Lalu dia berkata; \"Setan datang kepada Rasulullah Shallallahu'alaihiwasallam dari bukit-bukit, mereka bergemuruh dari gunung-gunung menuju beliau. Di antara mereka ada setan yang membawa obor, hendak memBakar rasulullah Shallallahu'alaihiwasallam.\" (Rasulullah Shallallahu'alaihiwasallam) takut. Ja'far berkata; saya menaksir (Abdur Rahman bin Khanbasy Radliyallahu'anhu) berkata; (Rasulullah Shallallahu'alaihiwasallam) mundur. (Abdur Rahman bin Khanbasy Radliyallahu'anhu) berkata; lalu Jibril Alaihissalam datang dan berkata; wahai Muhammad bacalah! Beliau bertanya, \"Apa yang saya harus baca?\" (Jibril Alaihissalam) berkata; bacalah: A'UDZU BI KALIMATILLAHI TAAMMATI ALLATI LA YUJAWIZUHUNNA BARRUN WALA FAJIRUN, MIN SYARRI MAA KHOLAQ WA DZAROA WA BAROA WA MIN SYARRI MA YANZIL MINAS SAMAAI WA MIN SYARRI MA YA'RUJU FIIHAA WA MIN SYARRI MA DZAROA FIL ARDLI WA MIN SYARRI MA YAKHRUJU MINHA WAMIN SYARRI FITANIL LAILI WAN NAHAARI WA MIN SYARRI KULLI THORIQIN ILLAA THOORIQON YATHRUQU BI KHOIRIN YA ROHMAN (aku berlindung dengan kalimat Allah yang sempurna yang tidak bisa melewatinya orang yang baik maupun orang yang berdosa, dari kejelekan yang Dia ciptakan, yang Dia buat dan yang Dia adakan dan dari kejelekan apa saja yang turun dari langit dan dari kejelekan apa saja yang naik padanya, dan dari kejelekan apa yang ada di bumi dan dari kejelekan apa yang keluar darinya, dan dari kejelekan fitnah malam dan siang, dan dari kejelekan yang datang pada malam hari kecuali yang datang dengan kebaikan wahai Rahman (tuhan yang maha pengasih). lalu api setan padam dan Allah AzzaWaJalla menghancurkan mereka."
            },
            {
                "number": 389,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي زِيَادٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ كَثِيرٍ الدَّارِيُّ عَنْ مُجَاهِدٍ قَالَ حَدَّثَنَا شَيْخٌ أَدْرَكَ الْجَاهِلِيَّةَ وَنَحْنُ فِي غَزْوَةِ رُودِسَ يُقَالُ لَهُ ابْنُ عَبْسٍ قَالَكُنْتُ أَسُوقُ لِآلٍ لَنَا بَقَرَةً قَالَ فَسَمِعْتُ مِنْ جَوْفِهَا آلَ ذَرِيحْ قَوْلٌ فَصِيحْ رَجُلٌ يَصِيحْ أَنْ لَا إِلَهَ إِلَّا اللَّهُ قَالَ فَقَدِمْنَا مَكَّةَ فَوَجَدْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ خَرَجَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami ['ubaidhullah bin Abu Ziyad] berkata; telah menceritakan kepadaku [Abdullah bin Katsir Ad Dari] dari [Mujahid] berkata; telah menceritakan kepada kami seorang tua yang pernah mengalami masa Jahiliyyah ketika kami berada dalam perang Rudisa, namanya adalah [Ibnu Abas], berkata; Saya mengembala sapi milik keluarga kami. Dia berkata; lalu saya mendengar dari perutnya ada suara, 'Wahai keluarga Dzarih ada sebuah perkataan yang fasih, seorang laki-laki yang meneriakkan bahwa tiada ILah selain Allah?. Dia berkata; ketika kami datang di Makkah, ternyata Nabi Shallallahu'alaihiwasallam telah muncul."
            },
            {
                "number": 390,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ تَخْرُجُ رِيحٌ بَيْنَ يَدَيْ السَّاعَةِ تُقْبَضُ فِيهَا أَرْوَاحُ كُلِّ مُؤْمِنٍ",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] berkata; telah mengabarkan kepada kami [Ma'mar] dari [Ayyub] dari [Nafi'] dari ['Ayyasy bin Abu Rab'iah] berkata; saya telah mendengar Nabi Shallallahu'alaihiwasallam bersabda: \"Diantara tanda-tanda Kiamat adalah akan keluar angin yang mencabut ruh setiap mukmin.\""
            },
            {
                "number": 391,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ ابْنِ طَاوُسٍ عَنْ عِكْرِمَةَ بْنِ خَالِدٍ عَنِ الْمُطَّلِبِ بْنِ أَبِي وَدَاعَةَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ فِي النَّجْمِ وَسَجَدَ النَّاسُ مَعَهُقَالَ الْمُطَّلِبُ وَلَمْ أَسْجُدْ مَعَهُمْ وَهُوَ يَوْمَئِذٍ مُشْرِكٌ فَقَالَ الْمُطَّلِبُ فَلَا أَدَعُ السُّجُودَ فِيهَا أَبَدًا",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Ibnu Thawus] dari ['Ikrimah bin Khalid] dari [Al Muthalib bin Abu Wada'ah] berkata; saya melihat Rasulullah Shallallahu'alaihiwasallam sujud karena membaca ayat dalam surat An-Najm, (AN Najm:) lalu orang-orang ikut sujud bersama beliau. Al Muthalib berkata; saya tidak ikut sujud bersama mereka, karena ketika itu dia masih musyrik. Lalu Al Muthalib berkata; namun di kemudian hari saya tidak meninggalkan sujud ketika membacanya selamanya."
            },
            {
                "number": 392,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ خَالِدٍ حَدَّثَنَا رَبَاحٌ عَنْ مَعْمَرٍ عَنِ ابْنِ طَاوُسٍ عَنْ عِكْرِمَةَ بْنِ خَالِدٍ عَنْ جَعْفَرِ بْنِ أَبِي وَدَاعَةَ السَّهْمِيِّ عَنْ أَبِيهِ قَالَقَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ سُورَةَ النَّجْمِ فَسَجَدَ وَسَجَدَ مَنْ عِنْدَهُفَرَفَعْتُ رَأْسِي وَأَبَيْتُ أَنْ أَسْجُدَ وَلَمْ يَكُنْ أَسْلَمَ يَوْمَئِذٍ الْمُطَّلِبُ وَكَانَ بَعْدُ لَا يَسْمَعُ أَحَدًا قَرَأَهَا إِلَّا سَجَدَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Khalid] telah menceritakan kepada kami [Rabah] dari [Ma'mar] dari [Ibnu Thawus] dari ['Ikrimah bin Khalid] dari [Ja'far bin Abu Wada'ah As-Sahmi] dari [Bapaknya] berkata; Rasulullah Shallallahu'alaihiwasallam di Makkah membaca surat An-Najm lalu beliau bersujud, dan orang-orang yang sedang bersama beliau juga bersujud. Lalu saya mengangkat kepalaku dan saya menolak untuk bersujud. Karena ketika itu Al Muthalib belum masuk Islam. Di kemudian hari, tidaklah ia mendengarkan seorang pun yang membacanya kecuali dia bersujud."
            },
            {
                "number": 393,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا الزُّهْرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ ثَعْلَبَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ قَالَ سَمِعْتُ مُجَمِّعَ ابْنَ جَارِيَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ الدَّجَّالَ فَقَالَ يَقْتُلُهُ ابْنُ مَرْيَمَ بِبَابِ لُدٍّ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] telah menceritakan kepada kami [Az-Zuhri] dari [Abdullah bin 'ubaidhullah bin Tsa'labah] dari [Abdur Rahman bin Yazid] berkata; saya telah mendengar [Mujammi' bin Jariyah] Nabi Shallallahu'alaihiwasallam menceritakan Dajjal, beliau bersabda: Ibnu Maryam membunuhnya di pintu Ludd."
            },
            {
                "number": 394,
                "arab": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ قَالَ حَدَّثَنَا لَيْثٌ يَعْنِي ابْنَ سَعْدٍ قَالَ حَدَّثَنَا ابْنُ شِهَابٍ أَنَّهُ سَمِعَ عُبَيْدِ اللَّهِ بْنَ ثَعْلَبَةَ الْأَنْصَارِيَّ يُحَدِّثُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ الْأَنْصَارِيِّ مِنْ بَنِي عَمْرِو بْنِ عَوْفٍ يَقُولُ سَمِعْتُ عَمِّي مُجَمِّعَ ابْنَ جَارِيَةَ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَقْتُلُ ابْنُ مَرْيَمَ الْمَسِيحَ الدَّجَّالَ بِبَابِ لُدٍّ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] berkata; telah menceritakan kepada kami [Laits] yaitu Ibnu Sa'd, berkata; telah menceritakan kepada kami [Ibnu Syihab] telah mendengar ['ubaidhullah bin Tsa'labah Al Anshari] menceritakan dari [Abdurrahman bin Yazid Al Anshari] dari Bani 'Amr Bin 'Auf, berkata; saya telah mendengar [pamanku, Mujammi' bin Jariyah] berkata; saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Ibnu Maryam membunuh Al Masih Dajjal di pintu Lud.\""
            },
            {
                "number": 395,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ ثَعْلَبَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَمِّهِ مُجَمِّعٍ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَقْتُلُ ابْنُ مَرْيَمَ الْمَسِيحَ الدَّجَّالَ بِبَابِ لُدٍّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Mush'ab] berkata; telah menceritakan kepada kami [Al Auza'i] dari [Az-Zuhri] dari ['ubaidhullah bin Tsa'labah] [Abdurrahman bin Yazid] dari [pamannya, Mujammi'] berkata; saya telah mendengar Nabi Shallallahu'alaihiwasallam bersabda: \"Ibnu Maryam membunuh Al Masih Dajjal di pintu Lud.\""
            },
            {
                "number": 396,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ ثَعْلَبَةَ الْأَنْصَارِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ مُجَمِّعِ ابْنِ جَارِيَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَقْتُلُ ابْنُ مَرْيَمَ الدَّجَّالَ بِبَابِ لُدٍّ أَوْ إِلَى جَانِبِ لُدٍّ",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az-Zuhri] dari [Abdullah bin 'ubaidhullah bin Tsa'labah Al Anshori] dari [Abdurrahman bin Yazid] dari [Mujammi' bin Jariyah] berkata; saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Ibnu Maryam membunuh Al Masih Dajjal di pintu Lud atau ke samping Lud.\""
            },
            {
                "number": 397,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى قَالَ حَدَّثَنَا مُجَمِّعُ بْنُ يَعْقُوبَ قَالَ سَمِعْتُ أَبِي يَقُولُ عَنْ عَمِّهِ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَمِّهِ مُجَمِّعِ ابْنِ جَارِيَةَ الْأَنْصَارِيِّوَكَانَ أَحَدَ الْقُرَّاءِ الَّذِينَ قَرَءُوا الْقُرْآنَ قَالَ شَهِدْنَا الْحُدَيْبِيَةَ فَلَمَّا انْصَرَفْنَا عَنْهَا إِذَا النَّاسُ يُنْفِرُونَ الْأَبَاعِرَ فَقَالَ النَّاسُ بَعْضُهُمْ لِبَعْضٍ مَا لِلنَّاسِ قَالُوا أُوحِيَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجْنَا مَعَ النَّاسِ نُوجِفُ حَتَّى وَجَدْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رَاحِلَتِهِ عِنْدَ كُرَاعِ الْغَمِيمِ وَاجْتَمَعَ النَّاسُ إِلَيْهِ فَقَرَأَ عَلَيْهِمْ إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا فَقَالَ رَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْ رَسُولَ اللَّهِ وَفَتْحٌ هُوَ قَالَ أَيْ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ إِنَّهُ لَفَتْحٌ فَقُسِمَتْ خَيْبَرُ عَلَى أَهْلِ الْحُدَيْبِيَةِ لَمْ يُدْخِلْ مَعَهُمْ فِيهَا أَحَدًا إِلَّا مَنْ شَهِدَ الْحُدَيْبِيَةَ فَقَسَمَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى ثَمَانِيَةَ عَشَرَ سَهْمًا وَكَانَ الْجَيْشُ أَلْفًا وَخَمْسَ مِائَةٍ فِيهِمْ ثَلَاثُ مِائَةِ فَارِسٍ فَأَعْطَى الْفَارِسَ سَهْمَيْنِ وَأَعْطَى الرَّاجِلَ سَهْمًا",
                "id": "Telah menceritakan kepada kami [Ishaq bin 'Isa] berkata; telah menceritakan kepada kami [Mujammi' bin Ya'qub] berkata; saya telah mendengar [bapakku] dari [pamannya, Abdurrahman bin Yazid] dari [pamannya, Mujammi' bin Jariyah Al Ashori] dia adalah salah seorang Qurra' yang pandai dalam membaca Al Qur'an, berkata; Kami ikut hadir dalam perdamaian Hudaibiyyah, ketika kami selesai dari sana tiba-tiba orang-orang membawa lari unta-unta mereka. Sebagian mereka berkata kepada yang lainnya, ada apa dengan mereka? Mereka menjawab, sebuah wahyu turun kepada Rasulullah Shallallahu'alaihiwasallam, maka kami keluar bersama mereka dengan cepat hingga kami menemukan Rasulullah Shallallahu'alaihiwasallam di atas kendaraannya di Kura'il Ghamim. Mereka berkumpul kepada (Rasulullah Shallallahu'alaihiwasallam) lalu beliau membacakan: \"kami Telah memberikan kepadamu kemenangan yang nyata.\" Lalu ada seorang sahabat Rasulullah Shallallahu'alaihiwasallam yang berkata; Wahai Rasulullah! apakah itu sebuah kemenangan? (Rasulullah Shallallahu'alaihiwasallam) bersabda: Ya. Demi Dzat yang jiwa Muhammad berada di tangan-Nya, itu adalah kemenangan. Maka (Ghanimah) Khaibar dibagi kepada orang-orang yang mengikuti Hudaibiyyah, tidak ada yang mendapatkan bagian darinya kecuali orang yang ikut dalam peristiwa Hudaibiyyah. Rasulullah Shallallahu'alaihiwasallam membaginya menjadi delapan belas saham, pasukan tersebut jumlahnya yaitu seribu lima ratus, yang diantaranya terdapat tiga ratus kafaleri, (Rasulullah Shallallahu'alaihiwasallam) memberi para kafaleri dengan dua saham dan memberi para infantri dengan satu saham."
            },
            {
                "number": 398,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو أُوَيْسٍ حَدَّثَنَا شُرَحْبِيلٌ عَنْ جَبَّارِ بْنِ صَخْرٍ الْأَنْصَارِيِّ أَحَدِ بَنِي سَلِمَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِطَرِيقِ مَكَّةَ مَنْ يَسْبِقُنَا إِلَى الْأُثَايَةِ قَالَ أَبُو أُوَيْسٍ هُوَ حَيْثُ نَفَّرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَمْدُرَ حَوْضَهَا وَيَفْرِطَ فِيهِ فَيَمْلَأَهُ حَتَّى نَأْتِيَهُ قَالَ قَالَ جَبَّارٌ فَقُمْتُ فَقُلْتُ أَنَا قَالَ اذْهَبْ فَذَهَبْتُ فَأَتَيْتُ الْأُثَايَةَ فَمَدَرْتُ حَوْضَهَا وَفَرَطْتُ فِيهِ وَمَلَأْتُهُ ثُمَّ غَلَبَتْنِي عَيْنَايَ فَنِمْتُ فَمَا انْتَبَهْتُ إِلَّا بِرَجُلٍ تُنَازِعُهُ رَاحِلَتُهُ إِلَى الْمَاءِ وَيَكُفُّهَا عَنْهُ فَقَالَ يَا صَاحِبَ الْحَوْضِ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ نَعَمْ قَالَ فَأَوْرَدَ رَاحِلَتَهُ ثُمَّ انْصَرَفَ فَأَنَاخَ ثُمَّ قَالَ اتْبَعْنِي بِالْإِدَاوَةِ فَتَبِعْتُهُ بِهَا فَتَوَضَّأَ وَأَحْسَنَ وُضُوءَهُ وَتَوَضَّأْتُ مَعَهُ ثُمَّ قَامَ يُصَلِّي فَقُمْتُ عَنْ يَسَارِهِ فَأَخَذَ بِيَدِي فَحَوَّلَنِي عَنْ يَمِينِهِ فَصَلَّيْنَا فَلَمْ يَلْبَثْ يَسِيرًا أَنْ جَاءَ النَّاسُ",
                "id": "Telah menceritakan kepada kami [Husain bin Muhammad] telah menceritakan kepada kami [Abu Uwais] telah menceritakan kepada kami [Syurahbil] dari [Jabbar bin Shakhr Al Anshari] salah seorang Bani Salamah berkata; ketika Rasulullah Shallallahu'alaihiwasallam berada di sebuah Jalan Makkah, bersabda: \"Siapa yang ingin pergi mendahului kami ke 'Utsayah? - -- Abu Uwais berkata dalam riwayatnya, Rasulullah Shallallahu'alaihiwasallam mendorong kami ke Utsayah- lalu dia membendung telaga Utsayah kemudian mengisi air disana serta memenuhinya hingga kami datang kepadanya.\" Jabbar berkata; saya berdiri dan berkata; saya. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Pergilah\", Lalu saya pergi hingga ketika sampai di 'Utsayah, saya membuat bendungan di telaganya dan mengisinya dengan air hingga penuh, lalu mataku tidak kuat lagi hingga saya tertidur, ketika saya tidak terbangun hingga datang seorang laki-laki yang dihantar oleh kendaraannya menuju air lalu dia menahannya di dalamnya. Dia berkata; \"Wahai penghuni telaga\", dan ternyata orang itu adalah Rasulullah Shallallahu'alaihiwasallam, maka saya berkata; ya. (Jabbar Radliyallahu'anhu) berkata; (Rasulullah Shallallahu'alaihiwasallam) menyuruh minum untanya lalu pergi menuntunnya lalu bersabda: \"Ikutilah saya dengan membawa setimba air\", maka saya mengikutinya dengan membawa setimba air lalu beliau berwudhu dengan sempurna dan saya ikut berwudhu bersamanya, kemudian beliau berdiri sholat, saya ikut berdiri di sisi kirinya hingga beliau mengait tanganku seraya menggeserku ke sisi kanannya lalu kami sholat, kemudian beliau diam sejenak hingga orang-orang datang."
            },
            {
                "number": 399,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ عَنِ ابْنِ أَبِي خُزَامَةَ عَنْ أَبِيهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ وَقَالَ سُفْيَانُ مَرَّةً سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرَأَيْتَ دَوَاءً نَتَدَاوَى بِهِ وَرُقًى نَسْتَرْقِي بِهَا وَتُقًى نَتَّقِيهَا أَتَرُدُّ مِنْ قَدَرِ اللَّهِ تَبَارَكَ وَتَعَالَى شَيْئًا قَالَ إِنَّهَا مِنْ قَدَرِ اللَّهِ تَبَارَكَ وَتَعَالَى",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az-Zuhri] dari [Ibnu Abu Khuzamah] dari [Bapaknya] berkata; saya berkata; wahai Rasulullah Shallallahu'alaihiwasallam, Sufyan berkata dalam riwayatnya, saya telah bertanya kepada Rasulullah Shallallahu'alaihiwasallam, bagaimana menurut anda tentang obat yang kami gunakan untuk mengobati penyakit, ruqyah yang kami praktekkan, dan penjagaan yang kami buat, apakah bisa menolak dari takdir Allah sama sekali? (Rasulullah Shallallahu'alaihiwasallam) bersabda: \" itu semua termasuk takdir Allah Tabaaroka wa Ta'ala.\""
            },
            {
                "number": 400,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ عَنِ الزُّبَيْدِيِّ مُحَمَّدِ بْنِ الْوَلِيدِ عَنِ الزُّهْرِيِّ عَنْ ابْنِ أَبِي خِزَامَةَ أَحَدِ بَنِي الْحَارِثِ عَنْ أَبِيهِأَنَّهُ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ دَوَاءً نَتَدَاوَى بِهِ وَرُقًى نَسْتَرْقِي بِهَا وَتُقًى نَتَّقِيهَا هَلْ تَرُدُّ ذَلِكَ مِنْ قَدَرِ اللَّهِ شَيْئًا قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَلِكَ مِنْ قَدَرِ اللَّهِ تَبَارَكَ وَتَعَالَى",
                "id": "Telah menceritakan kepada kami ['Ali bin 'Ayyasy] telah menceritakan kepada kami [Baqiyyah bin Al Walid] dari [Az-Zubadi, Muhammad bin Al Walid] dari [Az-Zuhri] dari [Ibnu Abu Khuzamah] salah satu Bani Al harits dari [Bapaknya] dia datang kepada Rasulullah Shallallahu'alaihiwasallam lalu berkata; Wahai Rasulullah, Bagaimana menurut anda tentang obat yang kami gunakan untuk mengobati penyakit, ruqyah yang kami praktekkan, dan penjagaan yang kami buat, apakah bisa menolak dari takdir Allah? Rasulullah Shallallahu'alaihiwasallam bersabda: itu semua termasuk takdir Allah Tabaaroka wa Ta'ala."
            },
            {
                "number": 401,
                "arab": "حَدَّثَنَا هَارُونُ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرٌو عَنِ ابْنِ شِهَابٍ أَنَّ ابْنَ أَبِي خُزَامَةَ أَحَدَ بَنِي الْحَارِثِ بْنِ سَعْدِ بْنِ هُذَيْمٍ حَدَّثَهُ أَنَّ أَبَاهُ حَدَّثَهُأَنَّهُ قَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ دَوَاءً نَتَدَاوَى بِهِ وَرُقًى نَسْتَرْقِيهَا وَتُقًى نَتَّقِيهِ هَلْ تَرُدُّ ذَلِكَ مِنْ قَدَرِ اللَّهِ تَبَارَكَ وَتَعَالَى مِنْ شَيْءٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ مِنْ قَدَرِ اللَّهِ عَزَّ وَجَلَّحَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ وَيَحْيَى بْنِ أَبِي بُكَيْرٍ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ عَنِ الزُّهْرِيِّ عَنْ ابْنِ أَبِي خُزَامَةَ عَنْ أَبِيهِ قَالَ أَبِي وَهُوَ الصَّوَابُ كَذَا قَالَ الزُّبَيْدِيُّ",
                "id": "Telah menceritakan kepada kami [Harun] telah menceritakan kepada kami [Ibnu Wahb] berkata; telah mengabarkan kepadaku ['Amr] dari [Ibnu Syihab] [Ibnu Abu Khuzamah] salah satu Bani Al Harits bin Sa'd bin Hudzaim menceritakannya, [Bapaknya] menceritakannya, dia berkata; Wahai Rasulullah, bagaimana menurut anda tentang obat yang kami gunakan untuk mengobati penyakit, ruqyah yang kami praktekkan, dan penjagaan yang kami buat, apakah bisa menolak dari takdir Allah sama sekali? Rasulullah Shallallahu'alaihiwasallam bersabda: \" itu semua termasuk takdir Allah AzzaWaJalla.\" Telah menceritakan kepada kami [Husain bin Muhammad] dan [Yahya bin Abu Bukair] dari [Sufyan bin 'Uyainah] dari [Az-Zuhri] dari [Ibnu Abu Khuzamah] dari [Bapaknya] berkata; dan itulah yang benar, demikian yang dikatakan Az-Zubaidi."
            },
            {
                "number": 402,
                "arab": "حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ سَمِعْتُ يَحْيَى بْنَ أَبِي كَثِيرٍ يَقُولُ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَسْعَدَ بْنِ زُرَارَةَ عَنْ قَيْسِ بْنِ سَعْدٍ قَالَزَارَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَنْزِلِنَا فَقَالَ السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ قَالَ فَرَدَّ سَعْدٌ رَدًّا خَفِيًّا فَرَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاتَّبَعَهُ سَعْدٌ فَقَالَ يَا رَسُولَ اللَّهِ قَدْ كُنْتُ أَسْمَعُ تَسْلِيمَكَ وَأَرُدُّ عَلَيْكَ رَدًّا خَفِيًّا لِتُكْثِرَ عَلَيْنَا مِنْ السَّلَامِ قَالَ فَانْصَرَفَ مَعَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ لَهُ سَعْدٌ بِغُسْلٍ فَوُضِعَ فَاغْتَسَلَ ثُمَّ نَاوَلَهُ أَوْ قَالَ نَاوَلُوهُ مِلْحَفَةً مَصْبُوغَةً بِزَعْفَرَانٍ وَوَرْسٍ فَاشْتَمَلَ بِهَا ثُمَّ رَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ وَهُوَ يَقُولُ اللَّهُمَّ اجْعَلْ صَلَوَاتِكَ وَرَحْمَتَكَ عَلَى آلِ سَعْدِ بْنِ عُبَادَةَ قَالَ ثُمَّ أَصَابَ مِنْ الطَّعَامِ فَلَمَّا أَرَادَ الِانْصِرَافَ قَرَّبَ إِلَيْهِ سَعْدٌ حِمَارًا قَدْ وَطَّأَ عَلَيْهِ بِقَطِيفَةٍ فَرَكِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ سَعْدٌ يَا قَيْسُ اصْحَبْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَيْسٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ارْكَبْ فَأَبَيْتُ ثُمَّ قَالَ إِمَّا أَنْ تَرْكَبَ وَإِمَّا أَنْ تَنْصَرِفَ قَالَ فَانْصَرَفْتُ",
                "id": "Telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Al Auza'i] berkata; saya telah mendengar [Yahya bin Abu Katsir] berkata; telah menceritakan kepadaku [Muhammad bin Abdurrahman bin As'ad bin Zurarah] dari [Qais bin Sa'd] berkata; Rasulullah Shallallahu'alaihiwasallam pernah mengunjungi kami di rumah kami, bersabda: \"Assalaamu 'alaikum warohmatullah\" (Qais radliyallahu'ahu) berkata; maka Sa'd menjawabnya dengan suara pelan, lalu Rasulullah Shallallahu'alaihiwasallam mengulangi salamnya dan Sa'd juga menjawabnya dengan suara pelan, lalu dia berkata; Wahai Rasulullah, saya mendengar salam anda, saya menjawabnya dengan pelan supaya anda memperbanyak salam atas kami. (Qais radliyallahu'ahu) berkata; lalu dia pergi bersama Rasulullah Shallallahu'alaihiwasallam dan menyuruh orang untuk menyiapkan pemandian (Rasulullah Shallallahu'alaihiwasallam) hingga beliau mandi. Lalu (Saad radliyallahu'anhu) memberikan atau (Qais radliyallahu'ahu) berkata; lalu mereka memberikan kepada beliau selembar selimut yang telah dilumuri dengan minyak wangi za'faron dan waros, lalu (Rasulullah Shallallahu'alaihiwasallam) memakainya. Lalu (Rasulullah Shallallahu'alaihiwasallam) mengangkat kedua tangannya dengan membaca: \"Ya Allah, jadikan kesejahteraan dan rahmAt Mu atas keluarga Sa'd bin 'Ubadah\" (Qais radliyallahu'ahu) berkata; lalu (Rasulullah Shallallahu'alaihiwasallam) menyantap makanan, tatkala beliau hendak pergi, Sa'd memberikan keledai kepadanya yang telah dilapisi pelana di atasnya, lalu Rasulullah Shallallahu'alaihiwasallam naik. Sa'd berkata; Wahai Qais, temani Rasulullah Shallallahu'alaihiwasallam. Qais berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Naiklah\", namun saya menolaknya. Lalu beliau bersabda: \"Kamu naik atau kamu meninggalkan saya saja\", (Qais radliyallahu'ahu) berkata; lalu saya meninggalkannya."
            },
            {
                "number": 403,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنِ الْقَاسِمِ بْنِ مُخَيْمِرَةَ عَنْ أَبِي عَمَّارٍ عَنْ قَيْسِ بْنِ سَعْدٍ قَالَأَمَرَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَصُومَ عَاشُورَاءَ قَبْلَ أَنْ يَنْزِلَ صِيَامُ رَمَضَانَ فَلَمَّا نَزَلَ صِيَامُ رَمَضَانَ لَمْ يَأْمُرْنَا وَلَمْ يَنْهَنَا وَنَحْنُ نَفْعَلُهُ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan] dari [Salamah bin Kuhail] dari [Al Qasim bin mukhoimiroh] dari [Abu 'Ammar] dari [Qais bin Sa'd] berkata; Nabi Shallallahu'alaihiwasallam memerintahkan kami untuk berpuasa 'Asyuro sebelum turun ayat tentang Puasa ramadhan. Tatkala turun ayat tentang Puasa ramadhan, beliau tidak menyuruh kami dan tidak juga melarang kami namun kami tetap mengerjakannya."
            },
            {
                "number": 404,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ أَبُو عَبْدِ الرَّحْمَنِ حَدَّثَنَا حَيْوَةُ قَالَ أَخْبَرَنِي عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الْمَلِكِ بْنِ مُلَيْلٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي أُمَيَّةَأَنَّ حَبِيبَ بْنَ مَسْلَمَةَ أَتَى قَيْسَ بْنَ سَعْدِ بْنِ عُبَادَةَ فِي الْفِتْنَةِ الْأُولَى وَهُوَ عَلَى فَرَسٍ فَأَخَّرَ عَنْ السَّرْجِ وَقَالَ ارْكَبْ فَأَبَى وَقَالَ لَهُ قَيْسُ بْنُ سَعْدٍ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ صَاحِبُ الدَّابَّةِ أَوْلَى بِصَدْرِهَا فَقَالَ لَهُ حَبِيبٌ إِنِّي لَسْتُ أَجْهَلُ مَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَكِنِّي أَخْشَى عَلَيْكَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Yazid, Abu Abdurrahman] telah menceritakan kepada kami [Haiwah] berkata; telah mengabarkan kepadaku [Abdul Aziz bin Abdul Malik bin Mulail] dari [Abdur Rahman bin Abu Umayyah] [Habib bin Maslamah] pernah mendatangi [Qais bin Sa'd bin 'Ubadah] pada zaman Fitnah Pertama dengan berkendara atas untanya, lantas dia mundur dari pelananya dan berkata (kepada Qais radliyallahu'ahu) naiklah. (Qais radliyallahu'ahu) menolak dan dia berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Pemilik kendaraan lebih berhak untuk duduk di depan\", Lalu Habib berkata kepadanya, bukannya saya tidak mengerti sabda Rasulullah Shallallahu'alaihiwasallam akan tetapi saya takut akan terjadi apa-apa padamu."
            },
            {
                "number": 405,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا إِسْرَائِيلُ عَنْ جَابِرٍ عَنْ عَامِرٍ عَنْ قَيْسِ بْنِ سَعْدِ بْنِ عُبَادَةَ قَالَمَا مِنْ شَيْءٍ كَانَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا وَقَدْ رَأَيْتُهُ إِلَّا شَيْئًا وَاحِدًا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُقَلَّسُ لَهُ يَوْمَ الْفِطْرِقَالَ جَابِرٌ هُوَ اللَّعِبُ",
                "id": "Telah menceritakan kepada kami [Abu Nadlroh] telah menceritakan kepada kami [Isro'il] dari [Jabir] dari ['Amir] dari [Qais bin Sa'd 'Ubadah] berkata; tidak ada sesuatu yang ada pada masa Rasulullah Shallallahu'alaihiwasallam kecuali saya telah melihatnya, kecuali satu hal. Rasulullah Shallallahu'alaihiwasallam, (pernah dimainkan sebuah permainan pedang dan anak panah di hadapan Rasulullah Shallallahu'alaihiwasallam) pada Hari Idul fitri. Jabir berkata; itu adalah permainan."
            },
            {
                "number": 406,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ مَنْصُورَ بْنَ زَاذَانَ يُحَدِّثُ عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ عَنْ قَيْسِ بْنِ سَعْدِ بْنِ عُبَادَةَأَنَّ أَبَاهُ دَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْدُمُهُ فَأَتَى عَلَيَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ صَلَّيْتُ رَكْعَتَيْنِ قَالَ فَضَرَبَنِي بِرِجْلِهِ وَقَالَ أَلَا أَدُلُّكَ عَلَى بَابٍ مِنْ أَبْوَابِ الْجَنَّةِ قُلْتُ بَلَى قَالَ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
                "id": "Telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [bapakku] berkata; saya telah mendengar [Manshur bin Zadzan] menceritakan dari [Maimun bin Abu Syabib] dari [Qais bin Sa'd bin 'Ubadah] bapaknya menyerahkan (Qais bin Sa'd Radliyallahu'anhu) kepada Nabi Shallallahu'alaihiwasallam sebagai pembantunya. Lalu Nabi Shallallahu'alaihiwasallam datang kepadaku setelah saya sholat dua rekaat. (Qais bin Sa'd Radliyallahu'anhu) berkata; lalu (Rasulullah Shallallahu'alaihiwasallam) menendangku dengan kakinya dan bersabda: maukah kamu saya tunjukkan salah satu pintu dari pintu surga? saya menjawab, Ya. (Rasulullah Shallallahu'alaihiwasallam) bersabda: LAA HAULA WA LAA QUWWATA ILLAA BILLAAH (tidak ada daya dan kekuatan kecuali dengan ijin Allah)."
            },
            {
                "number": 407,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ قَالَ أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ عَنْ عُبَيْدِ اللَّهِ بْنِ زَحْرٍ عَنْ بَكْرِ بْنِ سَوَادَةَ عَنْ قَيْسِ بْنِ سَعْدِ بْنِ عُبَادَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ رَبِّي تَبَارَكَ وَتَعَالَى حَرَّمَ عَلَيَّ الْخَمْرَ وَالْكُوبَةَ وَالْقِنِّينَ وَإِيَّاكُمْ وَالْغُبَيْرَاءَ فَإِنَّهَا ثُلُثُ خَمْرِ الْعَالَمِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ishaq] berkata; telah mengabarkan kepadaku [Yahya bin Ayyub] dari ['ubaidhullah bin Zahr] dari [Bakr bin Sawadah] dari [Qais bin Sa'dengan bin 'Ubadah] Rasulullah Shallallahu'alaihiwasallam bersabda: Robku Tabaaroka wa Ta'ala mengharamkan padaku arak, gendang dan judi. Jauhilah kalian Al ghubairo' (arak yang terbuat dari jagung) karena itu adalah sepertiga arak di dunia."
            },
            {
                "number": 408,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى حَدَّثَنَا ابْنُ لَهِيعَةَ قَالَ حَدَّثَنِيهِ ابْنُ هُبَيْرَةَ قَالَ سَمِعْتُ شَيْخًا مِنْ حِمْيَرَ يُحَدِّثُ أَبَا تَمِيمٍ الْجَيْشَانِيَّ أَنَّهُ سَمِعَ قَيْسَ بْنَ سَعْدِ بْنِ عُبَادَةَ الْأَنْصَارِيَّ وَهُوَ عَلَى مِصْرٍ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ كَذَبَ عَلَيَّ كِذْبَةً مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَضْجَعًا مِنْ النَّارِ أَوْ بَيْتًا فِي جَهَنَّمَ",
                "id": "Telah menceritakan kepada kami [Hasan bin Musa] telah menceritakan kepada kami [Ibnu Lahi'ah] berkata; telah menceritakannya kepadaku [Ibnu Hubairoh] berkata; saya telah mendengar [seseorang dari Himyar] menceritakan kepada [Abu Tamim Al Jaisyani] telah mendengar [Qais bin Sa'd bin 'Ubadah Al Anshori] ketika berada di Mesir berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Barangsiapa yang berdusta sekali dengan sengaja maka bersiaplah menempati tempat tidurnya di neraka atau rumahnya di Jahannam.\""
            },
            {
                "number": 409,
                "arab": "سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ شَرِبَ الْخَمْرَ أَتَى عَطْشَانًا يَوْمَ الْقِيَامَةِ أَلَا فَكُلُّ مُسْكِرٍ خَمْرٌ وَإِيَّاكُمْ وَالْغُبَيْرَاءَقَالَ هَذَا الشَّيْخُ ثُمَّ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو بَعْدَ ذَلِكَ يَقُولُ مِثْلَهُ فَلَمْ يَخْتَلِفَا إِلَّا فِي بَيْتٍ أَوْ مَضْجَعٍ",
                "id": "Saya (Qais bin Sa'd bin 'Ubadah Radliyallahu'anhu) telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Barangsiapa yang meminum arak, maka pada Hari Kiamat dalam keadaan haus. Ketahuilah setiap yang memabukkan adalah arak. Jauhilah Al Ghubaira'.\" Demikian yang dikatakan syaikh tersebut, lalu saya (Qais bin Sa'd bin 'Ubadah Radliyallahu'anhu) telah mendengar [Abdullah bin 'Amr] setelah itu berkata; sama dengan di atas, dan keduanya tidak ada perbedaan kecuali dalam perkataan di rumah atau tempat tidur."
            },
            {
                "number": 410,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا عَمْرُو بْنُ يَحْيَى بْنِ عُمَارَةَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ قَالَ حَدَّثَنِي عَمِّي وَاسِعُ بْنُ حَبَّانَ عَنْ وَهْبِ بْنِ حُذَيْفَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الرَّجُلُ أَحَقُّ بِمَجْلِسِهِ وَإِنْ قَامَ مِنْهُ ثُمَّ رَجَعَ أَيْ فَهُوَ أَحَقُّ بِهِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Sa'id] berkata; telah menceritakan kepada kami [Khalid] yaitu Ibnu Abdullah, berkata; telah menceritakan kepada kami ['Amr bin Yahya bin 'Umarah] dari [Muhammad bin Yahya bin Habban] berkata; telah menceritakan kepadaku [pamanku, Wasi' bin Habban] dari [Wahb bin Hudzaifah] Nabi Shallallahu'alaihiwasallam bersabda: \"Seorang lebih berhak dengan tempat duduknya (yang telah ia tempati), jika dia berdiri kemudian kembali lagi maka juga lebih berhak terhadapnya.\""
            },
            {
                "number": 411,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا خَالِدٌ الْوَاسِطِيُّ قَالَ حَدَّثَنَا عَمْرُو بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ عَمِّهِ وَاسِعِ بْنِ حَبَّانَ عَنْ وَهْبِ بْنِ حُذَيْفَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَامَ الرَّجُلُ مِنْ مَجْلِسِهِ فَرَجَعَ إِلَيْهِ فَهُوَ أَحَقُّ بِهِ وَإِنْ كَانَتْ لَهُ حَاجَةٌ فَقَامَ إِلَيْهَا ثُمَّ رَجَعَ فَهُوَ أَحَقُّ بِهِ",
                "id": "Telah menceritakan kepada kami ['Affan] berkata; telah menceritakan kepada kami [Khalid Al Wasithi] berkata; telah menceritakan kepada kami ['Amr bin Yahya] dari [Muhammad bin Yahya] dari [pamannya, Wasi' bin Habban] dari [Wahb bin Hudzaifah] dari Nabi Shallallahu'alaihiwasallam bersabda: \"Jika seseorang berdiri dari tempat duduknya (yang telah ia tempati), lalu kembali lagi maka dia lebih berhak terhadapnya, walau dia memiliki keperluan yang dia tinggalkan. Jika dia kembali lagi maka dia lebih berhak.\""
            },
            {
                "number": 412,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو أُوَيْسٍ حَدَّثَنَا شُرَحْبِيلٌ عَنْ عُوَيْمِ بْنِ سَاعِدَةَ الْأَنْصَارِيِّ أَنَّهُ حَدَّثَهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَاهُمْ فِي مَسْجِدِ قُبَاءَ فَقَالَ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَدْ أَحْسَنَ عَلَيْكُمْ الثَّنَاءَ فِي الطُّهُورِ فِي قِصَّةِ مَسْجِدِكُمْ فَمَا هَذَا الطُّهُورُ الَّذِي تَطَّهَّرُونَ بِهِ قَالُوا وَاللَّهِ يَا رَسُولَ اللَّهِ مَا نَعْلَمُ شَيْئًا إِلَّا أَنَّهُ كَانَ لَنَا جِيرَانٌ مِنْ الْيَهُودِ فَكَانُوا يَغْسِلُونَ أَدْبَارَهُمْ مِنْ الْغَائِطِ فَغَسَلْنَا كَمَا غَسَلُوا",
                "id": "Telah menceritakan kepada kami [Husain bin Muhammad] telah menceritakan kepada kami [Abu Uwais] telah menceritakan kepada kami [Syurohbil] dari ['Uwaim bin Sa'idah Al Anshori] dia menceritakannya, Nabi Shallallahu'alaihiwasallam pernah mendatangi mereka di masjid Quba, lalu bersabda: \" Allah telah memperbagus pujian-Nya pada kalian dalam hal bersuci, dalam kisah masjid kalian ini, bagaimana kalian bersuci selama ini?\" Mereka menjawab, Demi Allah, wahai Rasulullah, kami tidak mengetahuinya kecuali kami memiliki tetangga Yahudi, yang mencuci dubur mereka setelah buang air besar lalu kami ikut mencucinya seperti yang mereka kerjakan."
            },
            {
                "number": 413,
                "arab": "حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُطَّلِبِ بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي أَخِي الْحَكَمُ بْنُ الْمُطَّلِبِ عَنْ أَبِيهِ عَنْ قُهَيْدِ بْنِ مُطَرِّفٍ الْغِفَارِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلَهُ سَائِلٌ إِنْ عَدَا عَلَيَّ عَادٍ فَأَمَرَهُ أَنْ يَنْهَاهُ ثَلَاثَ مِرَارٍ قَالَ فَإِنْ أَبَى فَأَمَرَهُ بِقِتَالِهِ قَالَ فَكَيْفَ بِنَا قَالَ إِنْ قَتَلَكَ فَأَنْتَ فِي الْجَنَّةِ وَإِنْ قَتَلْتَهُ فَهُوَ فِي النَّارِ",
                "id": "Telah menceritakan kepada kami [Abu 'Amir, Abdul Malik bin 'Amr] telah menceritakan kepada kami [Abdul Aziz bin Al Muthalib bin Abdullah] berkata; telah menceritakan kepadaku [saudaraku, Al Hakam bin Al Muthalib] dari [Bapaknya] dari [Quhaid bin Mutharrif Al Ghifari] Rasulullah Shallallahu'alaihiwasallam pernah ditanya oleh seseorang, bagaimana jika ada orang yang menganiaya diriku? (Rasulullah Shallallahu'alaihiwasallam) menyuruh agar melarangnya tiga kali, (seseorang tersebut) berkata; jika dia enggan? maka beliau menyuruh untuk memeranginya, (dia berkata) lalu bagaimana dengan posisi kami? (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Jika dia membunuhmu, kamu berada di surga, jika kamu membunuhnya maka dia berada di neraka.\""
            },
            {
                "number": 414,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُطَّلِبِ الْمَخْزُومِيُّ عَنْ أَخِيهِ الْحَكَمِ بْنِ الْمُطَّلِبِ عَنْ أَبِيهِ عَنْ قُهَيْدٍ الْغِفَارِيِّقَالَ سَأَلَ سَائِلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنْ عَدَا عَلَيَّ عَادٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكِّرْهُ وَأَمَرَهُ بِتَذْكِيرِهِ ثَلَاثَ مَرَّاتٍ فَإِنْ أَبَى فَقَاتِلْهُ فَإِنْ قَتَلَكَ فَإِنَّكَ فِي الْجَنَّةِ وَإِنْ قَتَلْتَهُ فَإِنَّهُ فِي النَّارِ",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [Abdul Aziz bin Al Muthalib Al Makhzumi] dari [saudaranya, Al Hakam bin Al Muthalib] dari [Bapaknya] dari [Quhaid Al Ghifari] berkata; ada seseorang yang bertanya kepada Rasulullah Shallallahu'alaihiwasallam, bagaimana jika ada orang yang menganiaya diriku? Rasulullah Shallallahu'alaihiwasallam bersabda: \"Ingatkanlah dia\" dan beliau menyuruh agar mengingatkannya tiga kali, \"Jika dia menolak, maka perangilah, jika dia membunuhmu, kamu di surga, jika kamu membunuhnya maka dia di neraka.\""
            },
            {
                "number": 415,
                "arab": "حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا عَبْدُ الْمَلِكِ يَعْنِي ابْنَ حَسَنٍ الْحَارِثِيَّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي سَعِيدٍ قَالَ سَمِعْتُ عُمَارَةَ بْنَ حَارِثَةَ الضَّمْرِيَّ يُحَدِّثُ عَنْ عَمْرِو بْنِ يَثْرِبِيٍّ الضَّمْرِيِّ قَالَشَهِدْتُ خُطْبَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى فَكَانَ فِيمَا خَطَبَ بِهِ أَنْ قَالَ وَلَا يَحِلُّ لِامْرِئٍ مِنْ ذَأَفِ أَخِيهِ إِلَّا مَا طَابَتْ بِهِ نَفْسُهُ قَالَ فَلَمَّا سَمِعْتُ ذَلِكَ قُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ لَوْ لَقِيتُ غَنَمَ ابْنِ عَمِّي فَأَخَذْتُ مِنْهَا شَاةً فَاحْتَرَزْتُهَا هَلْ عَلَيَّ فِي ذَلِكَ شَيْءٌ قَالَ إِنْ لَقِيتَهَا نَعْجَةً تَحْمِلُ شَفْرَةً وَزِنَادًا فَلَا تَمَسَّهَا",
                "id": "Telah menceritakan kepada kami [Abu 'Amir] telah menceritakan kepada kami [Abdul Malik] yaitu ibnu Hasan Al Haritsi, telah menceritakan kepada kami [Abdurrahman bin Abu Sa'id] berkata; saya telah mendengar ['Umaroh bin Haristah Ad Dlamri] menceritakan dari ['Amr bin Yatsribi Ad Dlamri] berkata; saya menyaksikan khutbah Rasulullah Shallallahu'alaihiwasallam di Mina maka diantara isi khutbahnya adalah, \"Tidak halal seorang mengambil harta saudaranya kecuali atas kerelaan dirinya\" ('Amr bin Yatsribi Ad Dlamri Radliyallahu'anhu) berkata; tatkala saya mendengar itu, saya berkata 'Wahai Rasulullah, bagaimana menurutmu jika saya menemukan beberapa kambing anak pamanku lalu saya mengambilnya satu lalu saya rawat, apakah berdosa? (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Jika kamu menemukan seekor kambing, kamu membawa pisau dan bambu (ingin menyembelihnya) maka janganlah kamu menyentuhnya.\""
            },
            {
                "number": 416,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ إِسْحَاقَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ الْمَدَنِيُّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَبِي يَحْيَى عَنْ أَبِيهِ عَنِ ابْنِ أَبِي حَدْرَدٍ الْأَسْلَمِيِّأَنَّهُ كَانَ لِيَهُودِيٍّ عَلَيْهِ أَرْبَعَةُ دَرَاهِمَ فَاسْتَعْدَى عَلَيْهِ فَقَالَ يَا مُحَمَّدُ إِنَّ لِي عَلَى هَذَا أَرْبَعَةَ دَرَاهِمَ وَقَدْ غَلَبَنِي عَلَيْهَا فَقَالَ أَعْطِهِ حَقَّهُ قَالَ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أَقْدِرُ عَلَيْهَا قَالَ أَعْطِهِ حَقَّهُ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ مَا أَقْدِرُ عَلَيْهَا قَدْ أَخْبَرْتُهُ أَنَّكَ تَبْعَثُنَا إِلَى خَيْبَرَ فَأَرْجُو أَنْ تُغْنِمَنَا شَيْئًا فَأَرْجِعُ فَأَقْضِيهِ قَالَ أَعْطِهِ حَقَّهُ قَالَ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَالَ ثَلَاثًا لَمْ يُرَاجَعْ فَخَرَجَ بِهِ ابْنُ أَبِي حَدْرَدٍ إِلَى السُّوقِ وَعَلَى رَأْسِهِ عِصَابَةٌ وَهُوَ مُتَّزِرٌ بِبُرْدٍ فَنَزَعَ الْعِمَامَةَ عَنْ رَأْسِهِ فَاتَّزَرَ بِهَا وَنَزَعَ الْبُرْدَةَ فَقَالَ اشْتَرِ مِنِّي هَذِهِ الْبُرْدَةَ فَبَاعَهَا مِنْهُ بِأَرْبَعَةِ الدَّرَاهِمِ فَمَرَّتْ عَجُوزٌ فَقَالَتْ مَا لَكَ يَا صَاحِبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهَا فَقَالَتْ هَا دُونَكَ هَذَا بِبُرْدٍ عَلَيْهَا طَرَحَتْهُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Ishaq] telah menceritakan kepada kami [Hatim bin Isma'il Al Madani] berkata; telah menceritakan kepada kami [Abdullah bin Muhammad bin Yahya] dari [Bapaknya] dari [Ibnu Abu Hadrad Al Aslami] dia memiliki hutang pada seorang Yahudi berupa empat dirham, maka dia menagihnya dengan berkata; 'Wahai Muhammad orang ini berhutang kepadaku empat dirham, saya sangat membutuhkannya. Lalu (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Berikan padanya hak dia.\" Dia berkata; demi Dzat yang mengutusmu dengan Al haq, saya tidak mampu membayarnya. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Berikan padanya haknya\" Dia berkata; demi Dzat yang mengutusmu dengan Al haq, saya tidak mampu membayarnya, saya telah mengabarkan kepadanya, dan anda mengutus kami ke Khaibar dengan harapan anda memberi bagian ghanimah pada kami lalu saya pulang untuk melunasinya. (Nabi Shallallahu'alaihiwasallam) bersabda: \"Berikan padanya hak dia.\" Nabi Shallallahu'alaihiwasallam jika telah mengucapkan tiga kali, niscaya tidak akan mengulanginya lagi. Ibnu Abu Hadrod akhirnya keluar bersama orang Yahudi tersebut ke pasar dengan memakai surban di kepalanya dan bersarung dengan mantel, lalu dia (Ibnu Abu Hadrod Radliyallahu'anhu) melepas surban dari kepalanya dan memakainya sebagai sarung, lalu kemudian melepas selimut dan berkata kepada orang-orang, belilah dariku selimut ini, maka dia menjual selimut tersebut dengan empat dirham, lalu ada seorang nenek yang lewat seraya berkata; ada apa denganmu wahai sahabat Rasulullah Shallallahu'alaihiwasallam? Lalu (Ibnu Abu Hadrod Radliyallahu'anhu) memberitahukannya hingga nenek itu berkata; kalau begitu ambillah ini, maka nenek itu memberikan selimut kepadanya."
            },
            {
                "number": 417,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا شَيْبَانُ عَنْ عَاصِمٍ عَنْ أَبِي رَزِينٍ عَنْ عَمْرِو بْنِ أُمِّ مَكْتُومٍ قَالَجِئْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ كُنْتُ ضَرِيرًا شَاسِعَ الدَّارِ وَلِي قَائِدٌ لَا يُلَائِمُنِي فَهَلْ تَجِدُ لِي رُخْصَةً أَنْ أُصَلِّيَ فِي بَيْتِي قَالَ أَتَسْمَعُ النِّدَاءَ قَالَ قُلْتُ نَعَمْ قَالَ مَا أَجِدُ لَكَ رُخْصَةً",
                "id": "Telah menceritakan kepada kami [Abu Nadlroh] telah menceritakan kepada kami [Syaiban] dari ['Ashim] dari [Abu Razin] dari ['Amr bin Ummi Maktum] berkata; saya datang kepada Rasulullah Shallallahu'alaihiwasallam dan berkata; wahai Rasulullah! saya adalah orang buta yang jauh rumahnya, saya memiliki seorang penuntun yang tidak cocok denganku, apakah ada keringanan bagiku untuk sholat di rumahku? (Rasulullah Shallallahu'alaihiwasallam) bertanya: \"Apakah kamu mendengar adzan?\" ('Amr bin Ummi Maktum Radliyallahu'anhu) berkata; saya menjawab, Ya. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Saya tidak mendapatkan keringanan bagimu.\""
            },
            {
                "number": 418,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُسْلِمٍ حَدَّثَنَا الْحُصَيْنُ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادِ بْنِ الْهَادِ عَنِ ابْنِ أُمِّ مَكْتُومٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى الْمَسْجِدَ فَرَأَى فِي الْقَوْمِ رِقَّةً فَقَالَ إِنِّي لَأَهُمُّ أَنْ أَجْعَلَ لِلنَّاسِ إِمَامًا ثُمَّ أَخْرُجُ فَلَا أَقْدِرُ عَلَى إِنْسَانٍ يَتَخَلَّفُ عَنْ الصَّلَاةِ فِي بَيْتِهِ إِلَّا أَحْرَقْتُهُ عَلَيْهِ فَقَالَ ابْنُ أُمِّ مَكْتُومٍ يَا رَسُولَ اللَّهِ إِنَّ بَيْنِي وَبَيْنَ الْمَسْجِدِ نَخْلًا وَشَجَرًا وَلَا أَقْدِرُ عَلَى قَائِدٍ كُلَّ سَاعَةٍ أَيَسَعُنِي أَنْ أُصَلِّيَ فِي بَيْتِي قَالَ أَتَسْمَعُ الْإِقَامَةَ قَالَ نَعَمْ قَالَ فَأْتِهَا",
                "id": "Telah menceritakan kepada kami [Abdusshamad] telah menceritakan kepada kami [Abdul Aziz] yaitu Ibnu Muslim, telah menceritakan kepada kami [Al Hushain] dari [Abdullah bin Syadad bin Al Had] dari [Ibnu Ummi Maktum] Rasulullah Shallallahu'alaihiwasallam mendatangi masjid lalu melihat jamaahnya hanya sedikit. Kontan beliau bersabda: \" Saya berniat untuk mengangkat imam untuk kalian, lalu saya keluar dan menemui orang yang meninggalkan sholat bersamaku dan sholat di rumahnya lalu saya bakar rumahnya.\" Ibnu Ummi Maktum berkata; Wahai Rasulullah, antara saya dengan masjid terdapat banyak pohon kurma dan pohon yang lainnya, dan tidak mungkin bagi penunntunku untuk menuntunku setiap saat, apakah saya boleh sholat di rumahku?. Beliau bertanya, apakah kamu mendengar iqomah?. Dia menjawab, Ya. Beliau bersabda: \"Datangilah.\" "
            },
            {
                "number": 419,
                "arab": "حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ أَيْمَنَ الْمَكِّيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ الزُّرَقِيِّ عَنْ أَبِيهِ قَالَ وَقَالَ الْفَزَارِيُّ مَرَّةً عَنِ ابْنِ رِفَاعَةَ الزُّرَقِيِّ عَنْ أَبِيهِ قَالَ قَالَ أَبِي وَقَالَ غَيْرُ الْفَزَارِيِّ عُبَيْدِ بْنِ رِفَاعَةَ الزُّرَقِيِّ قَالَلَمَّا كَانَ يَوْمُ أُحُدٍ وَانْكَفَأَ الْمُشْرِكُونَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَوُوا حَتَّى أُثْنِيَ عَلَى رَبِّي فَصَارُوا خَلْفَهُ صُفُوفًا فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ كُلُّهُ اللَّهُمَّ لَا قَابِضَ لِمَا بَسَطْتَ وَلَا بَاسِطَ لِمَا قَبَضْتَ وَلَا هَادِيَ لِمَا أَضْلَلْتَ وَلَا مُضِلَّ لِمَنْ هَدَيْتَ وَلَا مُعْطِيَ لِمَا مَنَعْتَ وَلَا مَانِعَ لِمَا أَعْطَيْتَ وَلَا مُقَرِّبَ لِمَا بَاعَدْتَ وَلَا مُبَاعِدَ لِمَا قَرَّبْتَ اللَّهُمَّ ابْسُطْ عَلَيْنَا مِنْ بَرَكَاتِكَ وَرَحْمَتِكَ وَفَضْلِكَ وَرِزْقِكَ اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ الْمُقِيمَ الَّذِي لَا يَحُولُ وَلَا يَزُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ يَوْمَ الْعَيْلَةِ وَالْأَمْنَ يَوْمَ الْخَوْفِ اللَّهُمَّ إِنِّي عَائِذٌ بِكَ مِنْ شَرِّ مَا أَعْطَيْتَنَا وَشَرِّ مَا مَنَعْتَ اللَّهُمَّ حَبِّبْ إِلَيْنَا الْإِيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ وَاجْعَلْنَا مِنْ الرَّاشِدِينَ اللَّهُمَّ تَوَفَّنَا مُسْلِمِينَ وَأَحْيِنَا مُسْلِمِينَ وَأَلْحِقْنَا بِالصَّالِحِينَ غَيْرَ خَزَايَا وَلَا مَفْتُونِينَ اللَّهُمَّ قَاتِلْ الْكَفَرَةَ الَّذِينَ يُكَذِّبُونَ رُسُلَكَ وَيَصُدُّونَ عَنْ سَبِيلِكَ وَاجْعَلْ عَلَيْهِمْ رِجْزَكَ وَعَذَابَكَ اللَّهُمَّ قَاتِلْ الْكَفَرَةَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَهَ الْحَقِّ",
                "id": "Telah menceritakan kepada kami [Marwan bin Mu'awiyah Al Fazari] telah menceritakan kepada kami [Abdul Wahid bin Aiman Al Maki] dari ['ubaidhullah bin Abdullah Az-Zuroqi] dari [Bapaknya] berkata. [Al Fazari] berkata juga, dari [Ibnu Rifa'ah Az-Zuraqi] dari [Bapaknya] berkata; Bapakku berkata. Dan selain Al Fazari, ['Ubaid bin Rifa'ah Az-Zuraqi] berkata; pada hari Perang Uhud ketika orang-orang musyrik berlari mundur, Rasulullah Shallallahu'alaihiwasallam bersabda: \"Berbarislah kalian hingga saya memuji Rabbku\" lalu mereka membuat barisan di belakang, lalu bersabda: \"Ya Allah, segala puji hanya bagi-Mu, ya Allah tidak ada yang bisa mengenggam apa yang telah Engkau bentangkan dan tidak ada pula yang bisa membentangkan apa yang telah Engkau genggam. Tidak ada yang bisa memberi petunjuk terhadap siapa yang telah Engkau sesatkan, tak ada pula yang bisa menyesatkan siapa yang telah Engkau beri petunjuk. Tidak ada yang bisa memberi terhadap apa yang telah Engkau tahan dan tidak ada pula yang bisa menahan terhadap apa yang telah Engkau beri. Tidak ada yang bisa mendekatkan terhadap apa yang telah Engkau jauhkan dan tidak ada pula yang bisa menjauhkan terhadap apa yang telah Engkau dekatkan. Ya Allah bentangkan pada kami dari barakah-Mu, rahmAt Mu, kelebihan-Mu dan rizki-Mu. Ya Allah, saya memohon kepada-Mu kenikmatan yang kekal yang tidak berlalu dan tidak pula hilang. Ya Allah saya memohon kepada-Mu kenikmatan pada saat kefakiran, dan keamanan pada saat ketakutan. Ya Allah, saya berlindung kepada-Mu dari kejelekan apa saja yang telah Engkau berikan, dan dari kejelekan apa saja yang telah Engkau tahan. Ya Allah, cintakan pada diri kami keimanan dan hiaskanlah pada hati-hati kami. dan bencikan diri kami terhadap kekufuran, kefasikan serta kemaksiatan. Jadikan kami di antara orang-orang yang berpetunjuk. Ya Allah, wafatkan kami dalam keadaan Islam, hidupkan kami dalam keadaan Islam dan sertakan kami bersama dengan orang orang sholeh yang tidak hina dan tidak pula terfitnah. Ya Allah, perangilah orang orang kafir yang mendustakan para Rasul-Mu dan merintangi jalan-Mu, dan berikan mereka siksa-Mu dan adzab-Mu. Ya Allah, perangilah orang orang kafir yang telah diberi kitab (yahudi dan nashroni), ya Allah Tuhan kebenaran.\""
            },
            {
                "number": 420,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا الْحَارِثُ بْنُ يَزِيدَ عَنْ أَبِي مُصْعَبٍ قَالَقَدِمَ رَجُلٌ مِنْ أَهْلِ الْمَدِينَةِ شَيْخٌ فَرَأَوْهُ مُوَثِّرًا فِي جَهَازِهِ فَسَأَلُوهُ فَأَخْبَرَهُمْ أَنَّهُ يُرِيدُ الْمَغْرِبَ وَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ سَيَخْرُجُ نَاسٌ إِلَى الْمَغْرِبِ يَأْتُونَ يَوْمَ الْقِيَامَةِ وُجُوهُهُمْ عَلَى ضَوْءِ الشَّمْسِ",
                "id": "Telah menceritakan kepada kami [Husain bin Musa] telah menceritakan kepada kami [Ibnu Lahi'ah] telah menceritakan kepada kami [Al Harits bin Yazid] dari [Abu Mush'ab] berkata; [ada seorang laki-laki dari penduduk Madinah yang sudah tua], namun mereka melihatnya membawa banyak bekal. Mereka bertanya kepadanya, lalu dia memberitahukan bahwa dia bermaksud pergi ke Maghrib (maroko). Dan berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Orang-orang akan pergi menuju Maghrib (maroko), mereka datang pada Hari Kiamat dengan wajah bersinar seperti matahari.\""
            },
            {
                "number": 421,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْعَبَّاسِ قَالَ حَدَّثَنَا بَقِيَّةُ قَالَ حَدَّثَنِي عُثْمَانُ بْنُ زُفَرَ الْجُهَنِيُّ قَالَ حَدَّثَنِي أَبُو الْأَشَدِّ السُّلَمِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَكُنْتُ سَابِعَ سَبْعَةٍ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَأَمَرَنَا نَجْمَعُ لِكُلِّ رَجُلٍ مِنَّا دِرْهَمًا فَاشْتَرَيْنَا أُضْحِيَّةً بِسَبْعِ الدَّرَاهِمِ فَقُلْنَا يَا رَسُولَ اللَّهِ لَقَدْ أَغْلَيْنَا بِهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَفْضَلَ الضَّحَايَا أَغْلَاهَا وَأَسْمَنُهَا وَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخَذَ رَجُلٌ بِرِجْلٍ وَرَجُلٌ بِرِجْلٍ وَرَجُلٌ بِيَدٍ وَرَجُلٌ بِيَدٍ وَرَجُلٌ بِقَرْنٍ وَرَجُلٌ بِقَرْنٍ وَذَبَحَهَا السَّابِعُ وَكَبَّرْنَا عَلَيْهَا جَمِيعًا",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Abu Al 'Abbas] berkata; telah menceritakan kepada kami [Baqiyyah] berkata; telah menceritakan kepadaku ['Utsman bin Zufar Al Juhani] berkata; telah menceritakan kepadaku [Abu Al Asyad As-Sulami] dari [Bapaknya] dari [kakeknya] berkata; saya adalah satu dari tujuh orang yang bersama Rasulullah Shallallahu'alaihiwasallam. (Abu Al Asyad Radliyallahu'anhu) berkata; lalu (Rasulullah Shallallahu'alaihiwasallam) menyuruh kami untuk mengumpulkan satu dirham setiap orang, lalu kami membeli hewan kurban dengan tujuh dirham tersebut. Kami bertanya, wahai Rasulullah, sungguh kami merasa mahal dengannya. Rasulullah Shallallahu'alaihiwasallam bersabda: \"sebaik-baik hewan kurban adalah yang paling mahal dan paling gemuk.\" Lalu Rasulullah Shallallahu'alaihiwasallam menyuruh seorang untuk memegang kakinya, seorang lagi memegang kakinya yang lain. Seorang lagi memegang kakinya yang lain, seorang lagi memegang kakinya yang lain. Seorang untuk memegang tanduknya dan seorang lagi memegang tanduknya yang lain. Orang ketujuh agar menyembelihnya. Kami pun bertakbir semua."
            },
            {
                "number": 422,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْعَبَّاسِ حَدَّثَنَا بَقِيَّةُ حَدَّثَنَا بَحِيرُ بْنُ سَعْدٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يُصَلِّي وَفِي ظَهْرِ قَدَمِهِ لُمْعَةٌ قَدْرُ الدِّرْهَمِ لَمْ يُصِبْهَا الْمَاءُ فَأَمَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُعِيدَ الْوُضُوءَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Abu Al 'Abbas] telah menceritakan kepada kami [Baqiyyah] telah menceritakan kepada kami [Bahir bin Sa'd] dari [Khalid bin Ma'dan] dari [salah seorang sahabat Nabi Shallallahu'alaihiwasallam], Rasulullah Shallallahu'alaihiwasallam melihat seorang laki-laki yang sedang sholat dan pada punggung telapak kakinya terdapat petak kulit seukuran satu logam dirham yang tidak tersentuh air, lalu Rasulullah Shallallahu'alaihiwasallam menyuruhnya untuk mengulangi wudhun'ya."
            },
            {
                "number": 423,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ قَالَ حَدَّثَنِي مَنْصُورٌ عَنْ تَمِيمِ بْنِ سَلَمَةَ عَنْ عُبَيْدِ بْنِ خَالِدٍ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ مَوْتُ الْفَجْأَةِ أَخْذَةُ أَسَفٍ وَحَدَّثَ بِهِ مَرَّةً عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] berkata; telah menceritakan kepadaku [Manshur] dari [Tamim bin Salamah] dari ['Ubaid bin Khalid] dia adalah salah seorang sahabat Nabi Shallallahu'alaihiwasallam, berkata; \"Kematian secara tiba-tiba adalah cara pengambilan nyawa yang mengenaskan (yaitu kematiannya orang kafir) \" dan pernah bercerita bahwa hadits ini dari Nabi Shallallahu'alaihiwasallam."
            },
            {
                "number": 424,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ تَمِيمِ بْنِ سَلَمَةَ عَنْ عُبَيْدِ بْنِ خَالِدٍ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهُ قَالَ فِي مَوْتِ الْفَجْأَةِ أَخْذَةُ أَسَفٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Manshur] dari [Tamim bin Salamah] dari ['Ubaid bin Khalid] salah seorang sahabat Nabi Shallallahu'alaihiwasallam, dia berkata; \"Kematian secara tiba-tiba adalah cara pengambilan nyawa yang mengenaskan.\""
            },
            {
                "number": 425,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو قَالَ حَدَّثَنِي عَبِيدَةُ بْنُ سُفْيَانَ الْحَضْرَمِيُّ عَنْ أَبِي الْجَعْدِ الضَّمْرِيِّ وَكَانَتْ لَهُ صُحْبَةٌ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَرَكَ ثَلَاثَ جُمَعٍ تَهَاوُنًا مِنْ غَيْرِ عُذْرٍ طَبَعَ اللَّهُ تَبَارَكَ وَتَعَالَى عَلَى قَلْبِهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Muhammad bin 'Amr] berkata; telah menceritakan kepadaku ['Abidah bin Sufyan Al Hadlrami] dari [Abu Ja'd Ad Dlamri], dia termasuk sahabat Nabi Shallallahu'alaihiwasallam berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Barangsiapa yang meninggalkan tiga jumat dengan menganggap enteng, tanpa ada udzur (darinya) maka Allah Tabaroka Wa Ta'ala akan menutup hatinya.\""
            },
            {
                "number": 426,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ أَخْبَرَنَا مُحَمَّدُ بْنُ مُطَرِّفٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْبَيْلَمَانِيِّ قَالَاجْتَمَعَ أَرْبَعَةٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَحَدُهُمْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقْبَلُ تَوْبَةَ الْعَبْدِ قَبْلَ أَنْ يَمُوتَ بِيَوْمٍفَقَالَ الثَّانِي أَأَنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ قَالَ وَأَنَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقْبَلُ تَوْبَةَ الْعَبْدِ قَبْلَ أَنْ يَمُوتَ بِنِصْفِ يَوْمٍ فَقَالَ الثَّالِثُ أَأَنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ قَالَ وَأَنَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقْبَلُ تَوْبَةَ الْعَبْدِ قَبْلَ أَنْ يَمُوتَ بِضَحْوَةٍ قَالَ الرَّابِعُ أَأَنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ وَأَنَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ يَقْبَلُ تَوْبَةَ الْعَبْدِ مَا لَمْ يُغَرْغِرْ بِنَفَسِهِ",
                "id": "Telah menceritakan kepada kami [Husain bin Muhammad] telah mengabarkan kepada kami [Muhammad bin Muthorrif] dari [Zaid bin Aslam] [Abdurrahman Al Bailamani] berkata; ada empat orang dari sahabat Nabi Shallallahu'alaihiwasallam yang berkumpul, maka [salah satu dari mereka] berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \" Allah Tabaaroka Wa Ta'ala menerima taubat seorang hamba sehari sebelum kematiannya.\" [Orang yang kedua] berkata; apakah kamu mendengarnya dari Rasulullah Shallallahu'alaihiwasallam? (orang pertama) berkata; Ya. (orang kedua) berkata; sedangkan saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \" Allah menerima taubat seorang hamba setengah hari sebelum kematiannya.\" Lalu [orang ketiga] berkata; apakah kamu mendengar ini dari Rasulullah Shallallahu'alaihiwasallam? (orang kedua) berkata; Ya. Orang ketiga berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \" Allah menerima tubat seorang hamba sepertiga hari (pada waktu dhuha) sebelum kematiannya.\" Lalu [orang keempat] berkata; apakah kamu mendengar ini dari Rasulullah Shallallahu'alaihiwasallam?. (orang ketiga) berkata; Ya. Orang keempat berkata; sedangkan saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \" Allah menerima taubat seorang hamba selagi ia belum sekarat.\""
            },
            {
                "number": 427,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا إِسْرَائِيلُ عَنْ إِبْرَاهِيمَ يَعْنِي ابْنَ مُهَاجِرٍ عَنْ مُجَاهِدٍ عَنِ السَّائِبِ بْنِ عَبْدِ اللَّهِ قَالَجِيءَ بِي إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فَتْحِ مَكَّةَ جَاءَ بِي عُثْمَانُ بْنُ عَفَّانَ وَزُهَيْرٌ فَجَعَلُوا يَثْنُونَ عَلَيْهِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُعْلِمُونِي بِهِ قَدْ كَانَ صَاحِبِي فِي الْجَاهِلِيَّةِ قَالَ قَالَ نَعَمْ يَا رَسُولَ اللَّهِ فَنِعْمَ الصَّاحِبُ كُنْتَ قَالَ فَقَالَ يَا سَائِبُ انْظُرْ أَخْلَاقَكَ الَّتِي كُنْتَ تَصْنَعُهَا فِي الْجَاهِلِيَّةِ فَاجْعَلْهَا فِي الْإِسْلَامِ أَقْرِ الضَّيْفَ وَأَكْرِمْ الْيَتِيمَ وَأَحْسِنْ إِلَى جَارِكَ",
                "id": "Telah menceritakan kepada kami [Aswad bin 'Amir] telah menceritakan kepada kami [Isro'il] dari [Ibrahim] yaitu Ibnu Muhajir, [Mujahid] dari [As-Sa'ib bin Abdullah] berkata; saya dibawa ke hadapan Nabi Shallallahu'alaihiwasallam dan bersamaku 'Utsman bin 'Affan dan Zuhair, maka mereka memuji (Rasulullah Shallallahu'alaihiwasallam) lalu Rasulullah Shallallahu'alaihiwasallam bersabda kepada mereka, kalian tidak usah memberitahu diriku tentang dia (As-Sa'ib), dia adalah sahabatku di Masa Jahiliyyah. (Mujahid Radliyallahu'anhu) berkata; As-Sa'ib berkata; Ya wahai Rasulullah! Sebaik-baik sahabat adalah anda. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Wahai Sa'ib, lihatlah akhlak yang telah kamu perbuat di Masa Jahiliyyah, maka lakukanlah (akhlaq tersebut) dalam Islam; muliakanlah tamu dan hormatilah anak yatim serta berbuatlah baik kepada tetanggamu.\""
            },
            {
                "number": 428,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا إِبْرَاهِيمُ يَعْنِي ابْنَ مُهَاجِرٍ عَنْ مُجَاهِدٍ عَنْ قَائِدِ السَّائِبِ عَنِ السَّائِبِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ الْقَاعِدِ عَلَى النِّصْفِ مِنْ صَلَاةِ الْقَائِمِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Ibrahim] yaitu Ibnu Muhajir, dari [Mujahid] dari [orang yang pernah menuntun As-Sa'ib] dari [As-Sa'ib] dari Nabi Shallallahu'alaihiwasallam bersabda: \"sholat orang yang duduk seperti separuh sholatnya orang yang berdiri.\""
            },
            {
                "number": 429,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ إِبْرَاهِيمَ يَعْنِي ابْنَ مُهَاجِرٍ عَنْ مُجَاهِدٍ عَنْ قَائِدِ السَّائِبِ عَنِ السَّائِبِأَنَّهُ قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُنْتَ شَرِيكِي فَكُنْتَ خَيْرَ شَرِيكٍ كُنْتَ لَا تُدَارِي وَلَا تُمَارِي",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan] dari [Ibrahim] yaitu Ibnu Muhajir, dari [Mujahid] dari [penuntun As-Sa'ib], dari [As-Sa'ib] dia berkata kepada Nabi Shallallahu'alaihiwasallam, \"Anda adalah serikatku, anda adalah sekutu yang paling baik. Anda tidak pernah melakukan madarot dan juga tidak hobi berdebat.\" "
            },
            {
                "number": 430,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا سَيْفٌ قَالَ سَمِعْتُ مُجَاهِدًا يَقُولُكَانَ السَّائِبُ بْنُ أَبِي السَّائِبِ الْعَابِدِيُّ شَرِيكَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْجَاهِلِيَّةِ قَالَ فَجَاءَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فَتْحِ مَكَّةَ فَقَالَ بِأَبِي وَأُمِّي لَا تُدَارِي وَلَا تُمَارِي",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Saif] berkata; saya telah mendengar [Mujahid] berkata; As-Sa'ib bin Abu As-Sa'ib Al 'Abidi sekutu Rasulullah Shallallahu'alaihiwasallam pada Masa Jahiliyah, ketika Nabi Shallallahu'alaihiwasallam datang pada Fath Makkah, berkata; demi bapakku dan ibuku, anda tidak suka melakukan 'madarot' dan tidak suka berjidal."
            },
            {
                "number": 431,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا ثَابِتٌ يَعْنِي أَبَا زَيْدٍ حَدَّثَنَا هِلَالٌ يَعْنِي ابْنَ خَبَّابٍ عَنْ مُجَاهِدٍ عَنْ مَوْلَاهُأَنَّهُ حَدَّثَهُ أَنَّهُ كَانَ فِيمَنْ يَبْنِي الْكَعْبَةَ فِي الْجَاهِلِيَّةِ قَالَ وَلِي حَجَرٌ أَنَا نَحَتُّهُ بِيَدَيَّ أَعْبُدُهُ مِنْ دُونِ اللَّهِ تَبَارَكَ وَتَعَالَى فَأَجِيءُ بِاللَّبَنِ الْخَاثِرِ الَّذِي أَنْفَسُهُ عَلَى نَفْسِي فَأَصُبُّهُ عَلَيْهِ فَيَجِيءُ الْكَلْبُ فَيَلْحَسُهُ ثُمَّ يَشْغَرُ فَيَبُولُ فَبَنَيْنَا حَتَّى بَلَغْنَا مَوْضِعَ الْحَجَرِ وَمَا يَرَى الْحَجَرَ أَحَدٌ فَإِذَا هُوَ وَسْطَ حِجَارَتِنَا مِثْلَ رَأْسِ الرَّجُلِ يَكَادُ يَتَرَاءَى مِنْهُ وَجْهُ الرَّجُلِ فَقَالَ بَطْنٌ مِنْ قُرَيْشٍ نَحْنُ نَضَعُهُ وَقَالَ آخَرُونَ نَحْنُ نَضَعُهُ فَقَالُوا اجْعَلُوا بَيْنَكُمْ حَكَمًا قَالُوا أَوَّلَ رَجُلٍ يَطْلُعُ مِنْ الْفَجِّ فَجَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا أَتَاكُمْ الْأَمِينُ فَقَالُوا لَهُ فَوَضَعَهُ فِي ثَوْبٍ ثُمَّ دَعَا بُطُونَهُمْ فَأَخَذُوا بِنَوَاحِيهِ مَعَهُ فَوَضَعَهُ هُوَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abdusshamad] telah menceritakan kepada kami [Tsabit] yaitu Abu Zaid, telah menceritakan kepada kami [Hilal] yaitu Ibnu Khabbab dari [Mujahid] dari [mantan budaknya], menceritakan kepadanya bahwa dirinya termasuk orang yang membangun Ka'bah di Masa Jahiliyyah. Dia berkata; saya memiliki batu yang saya pahat dengan tanganku dan yang saya sembah selain Allah Tabaaroka Wa Ta'ala, lalu saya membawa susu kental, yang saya hisap sendiri kemudian saya tuangkan di atas batu tersebut hingga datang seekor anjing dan menjilatinya, lalu mengangkat satu kakinya dan mengencinginya. Kami membangun Ka'bah hingga kami sampai pada tempat Hajar Aswad. Tidak ada seorang pun yang melihat Hajar aswad, walau itu ternyata berada pada tengah-tengah batu kami, sebagaimana rambut seseorang, seseolah-olah hampir wajah seorang laki-laki tersebut. Maka ada seorang kepercayaan Quraish berkata 'Kami yang akan menaruhnya.' Yang lainnya berkata 'Kami yang akan menaruhnya.' Mereka berkata 'Bagimana kalau kita mengangkat seorang hakim.' Mereka berkata 'Yang meletakkannya adalah orang yang pertama kali datang dari lorong ka'bah ini'. Kemudian hari datanglah Nabi Shallallahu'alaihiwasallam, mereka berkata; 'Telah datang kepada kalian orang yang dapat dipercaya', lalu beliau meletakkan pada kainnya, lalu memanggil para tokoh mereka, mereka saling memegang ujung-ujungnya dan beliau Shallallahu'alaihiwasallam yang meletakkan di tengahnya."
            },
            {
                "number": 432,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ مُجَاهِدٍ عَنِ السَّائِبِ بْنِ أَبِي السَّائِبِأَنَّهُ كَانَ يُشَارِكُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ الْإِسْلَامِ فِي التِّجَارَةِ فَلَمَّا كَانَ يَوْمُ الْفَتْحِ جَاءَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرْحَبًا بِأَخِي وَشَرِيكِي كَانَ لَا يُدَارِي وَلَا يُمَارِي يَا سَائِبُ قَدْ كُنْتَ تَعْمَلُ أَعْمَالًا فِي الْجَاهِلِيَّةِ لَا تُقْبَلُ مِنْكَ وَهِيَ الْيَوْمَ تُقْبَلُ مِنْكَ وَكَانَ ذَا سَلَفٍ وَصِلَةٍ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Abdullah bin 'Utsman bin Khutsaim] dari [Mujahid] dari dari [As-Sa'ib bin Abu As-Sa'ib] dia bersekutu bersama Rasulullah Shallallahu'alaihiwasallam sebelum Islam dalam suatu jual beli. Tatkala Fathu Makkah, dia mendatangi beliau. Lalu Nabi Shallallahu'alaihiwasallam bersabda: \"Selamat datang saudaraku dan sekutuku. Kamu tidak pernah melakukan madarot dan tidak hobi berdebat Wahai Sa'ib, kamu telah melakukan amalan pada Masa Jahiliyyah, yang hal itu adalah tidak diterima, namun hari ini bisa diterima. Amalan itu telah terjadi masa lalu, namun silahkan dilestarikan sekarang. "
            },
            {
                "number": 433,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ أَخْبَرَنَا ابْنُ لَهِيعَةَ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ مَالِكٍ أَنَّ مُحَمَّدَ بْنَ عَمْرِو بْنِ عَطَاءٍ حَدَّثَهُ قَالَرَأَيْتُ السَّائِبَ يَشُمُّ ثَوْبَهُ فَقُلْتُ لَهُ مِمَّ ذَاكَ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا وُضُوءَ إِلَّا مِنْ رِيحٍ أَوْ سَمَاعٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ishaq] telah mengabarkan kepada kami [Ibnu Lahi'ah] dari [Muhammad bin Abdullah bin Malik] [Muhammad bin 'Amr bin Atho'] berkata; saya melihat [As-Sa'ib] mencium bau bajunya, maka saya bertanya, kenapa itu? (As-Sa'ib Radliyallahu'anhu) berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidak ada wudlu kecuali karena bau angin atau terdengar suara.\""
            },
            {
                "number": 434,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ شَبِيبِ بْنِ غَرْقَدَةَ الْبَارِقِيِّ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ عَنْ أَبِيهِ قَالَشَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ النَّاسَ فِي حَجَّةِ الْوَدَاعِ فَقَالَ أَيُّ يَوْمٍ يَوْمُكُمْ فَذَكَرَ خُطْبَتَهُ يَوْمَ النَّحْرِ",
                "id": "Telah menceritakan kepada kami [Yahya bin 'Adam] telah menceritakan kepada kami [Abu Al Awash] dari [Syabib bin ghorqodah Al Bariqi] dari [Sulaiman bin 'Amr bin Al Ahwash] dari [Bapaknya] berkata; saya menyaksikan Rasulullah Shallallahu'alaihiwasallam berkhutbah kepada manusia pada waktu Haji Wada', beliau bersabda: \"Hari apa yang paling mulia?\" lalu (Rasulullah Shallallahu'alaihiwasallam) menyebutkan dalam khutbahnya, hari penyembelihan (Yaitu Hari Idul Adha).\""
            },
            {
                "number": 435,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا الْمُشْمَعِلُّ قَالَ حَدَّثَنِي عَمْرُو بْنُ سُلَيْمٍ الْمُزَنِيُّ قَالَ سَمِعْتُ رَافِعَ بْنَ عَمْرٍو الْمُزَنِيَّ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا وَصِيفٌ يَقُولُ الْعَجْوَةُ وَالشَّجَرَةُ مِنْ الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Al Musyma'il] berkata; telah menceritakan kepadaku ['Amr bin Sulaim Al Muzni] berkata; saya telah mendengar [Rafi' bin 'Amr Al Muzani] berkata; saya telah mendengar Nabi Shallallahu'alaihiwasallam bersabda ketika saya masih bujang, \"Al 'Ajwah (kurma Nabi) beserta pohonnya berasal dari surga.\""
            },
            {
                "number": 436,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا هِشَامٌ قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ قَالَ حَدَّثَنِي مُعَيْقِيبٌ قَالَقِيلَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَسْحُ فِي الْمَسْجِدِ يَعْنِي الْحَصَى قَالَ فَقَالَ إِنْ كُنْتَ لَا بُدَّ فَاعِلًا فَوَاحِدَةً",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Hisyam] berkata; telah menceritakan kepadaku [Yahya bin Abu Katsir] dari [Abu Salamah] berkata; telah menceritakan kepadaku [Al Mu'aiqib] berkata; ditanyakan kepada Nabi Shallallahu'alaihiwasallam tentang mengusap kerikil di masjid (ketika sedang sholat) maka beliau Shallallahu'alaihiwasallam bersabda: \"Jika kamu memang harus melakukannya, cukuplah sekali.\""
            },
            {
                "number": 437,
                "arab": "حَدَّثَنَا خَلَفُ بْنُ الْوَلِيدِ حَدَّثَنَا أَيُّوبُ بْنُ عُتْبَةَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ مُعَيْقِيبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيْلٌ لِلْأَعْقَابِ مِنْ النَّارِ",
                "id": "Telah menceritakan kepada kami [Khalaf bin Al Walid] telah menceritakan kepada kami [Ayyub bin 'Utbah] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Al Mu'aiqib] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Celakalah orang-orang yang mata kakinya tak tersentuh air wudhu dari api neraka.\""
            },
            {
                "number": 438,
                "arab": "قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ قَالَ حَدَّثَنَا شَيْبَانُ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ قَالَ حَدَّثَنِي مُعَيْقِيبٌأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الرَّجُلِ يُسَوِّي التُّرَابَ حَيْثُ يَسْجُدُ إِنْ كُنْتَ فَاعِلًا فَوَاحِدَةً",
                "id": "Telah menceritakan kepada kami [Yahya bin Abu Bukair] berkata; telah menceritakan kepada kami [Syaiban] dari [Yahya bin Abu Katsir] dari [Abu Salamah] berkata; telah menceritakan kepadaku [Al Mu'aiqib] Rasulullah Shallallahu'alaihiwasallam bersabda kepada seseorang yang meratakan tanahnya ketika hendak bersujud, \"Jika kamu harus melakukannya maka lakukanlah sekali saja.\""
            },
            {
                "number": 439,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ عَنْ مَوْلًى لَهُمْ مُزَاحِمِ بْنِ أَبِي مُزَاحِمٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ عَبْدِ اللَّهِ بْنِ خَالِدِ بْنِ أُسَيْدٍ عَنْ رَجُلٍ مِنْ خُزَاعَةَ يُقَالُ لَهُ مُحَرِّشٌ أَوْ مُخَرِّشٌ لَمْ يُثْبِتْ سُفْيَانُ اسْمَهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ الْجِعْرَانَةِ لَيْلًا فَاعْتَمَرَ ثُمَّ رَجَعَ فَأَصْبَحَ كَبَائِتٍ بِهَا فَنَظَرْتُ إِلَى ظَهْرِهِ كَأَنَّهُ سَبِيكَةُ فِضَّةٍ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Isma'il bin 'Umayah] dari budak mereka, [Muzahim bin Abu Muzahim], dari [Abdil Aziz bin Abdullah bin Khalid bin Usaid] dari seorang laki-laki Khuza'ah yang bernama [Muharrisy] atau Mukharrisy (Sufyan bin Uyyainah tidak pasti dalam penyebutan namanya) Nabi Shallallahu'alaihiwasallam pernah keluar dari Ji'ronah pada malam hari, lalu beliau berumrah kemudian kembali hingga beliau bermalam di Ji'ranah lalu saya melihat punggungnya yang terlihat seperti batang perak."
            },
            {
                "number": 440,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنِ ابْنِ جُرَيْجٍ حَدَّثَنِي مُزَاحِمُ بْنُ أَبِي مُزَاحِمٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ عَبْدِ اللَّهِ عَنْ مُحَرِّشٍ الْكَعْبِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ الْجِعْرَانَةِ مُعْتَمِرًا فَدَخَلَ مَكَّةَ لَيْلًا ثُمَّ خَرَجَ مِنْ تَحْتِ لَيْلَتِهِ فَأَصْبَحَ بِالْجِعْرَانَةِ كَبَائِتٍ فَلَمَّا زَالَتْ الشَّمْسُ أَخَذَ فِي بَطْنِ سَرِفَ حَتَّى جَامَعَ الطَّرِيقُ طَرِيقَ الْمَدِينَةِ قَالَ فَلِذَلِكَ خَفِيَتْ عُمْرَتُهُحَدَّثَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي مُزَاحِمُ بْنُ أَبِي مُزَاحِمٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ عَبْدِ اللَّهِ عَنْ مُحَرِّشٍ الْكَعْبِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فَذَكَرَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] telah menceritakan kepadaku [Muzahim bin Abu Muzahim] dari [Abdul Aziz bin Abdullah] dari [Muharisy Al Ka'bi] Nabi Shallallahu'alaihiwasallam keluar dari Ji'ronah karena umroh lalu memasuki Makkah pada malam hari, lalu kembali dari malam itu dan pagi sudah sampai di Ji'ranah, seperti orang yang menginap. Tatkala matahari condong, beliau menuju ke tengah Sarifa sehingga jalan tersebut bertemu dengan jalan Madinah. Oleh karena itu umrahnya tersembunyi. Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Muzahim bin Abu Muzahim] dari [Abdul Aziz bin Abdullah] dari [Muharisy Al Ka'bi] Nabi Shallallahu'alaihiwasallam keluar, lalu menyebutkan sama dengan di atas."
            },
            {
                "number": 441,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا إِسْمَاعِيلُ قَالَ حَدَّثَنَا قَيْسٌ عَنْ أَبِيهِ قَالَجَاءَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَقَامَ فِي الشَّمْسِ فَأَمَرَ بِهِ فَحُوِّلَ إِلَى الظِّلِّ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] berkata; telah menceritakan kepada kami [Isma'il] berkata; telah menceritakan kepada kami [Qais] dari [Bapaknya] berkata; Pernah seseorang datang ketika Rasulullah Shallallahu'alaihiwasallam berkhutbah, dan (orang itu) berdiri di bawah terik matahari, lalu (Rasulullah Shallallahu'alaihiwasallam) memerintahkannya untuk berpindah ke tempat yang teduh."
            },
            {
                "number": 442,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا هُرَيْمٌ عَنْ إِسْمَاعِيلَ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ أَبِيهِأَنَّهُ كَانَ فِي الشَّمْسِ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَحَوَّلَ إِلَى الظِّلِّ أَوْ يُجْعَلَ فِي الظِّلِّ",
                "id": "Telah menceritakan kepada kami [Aswad bin 'Amir] telah menceritakan kepada kami [Huraim] dari [Isma'il] dari [Qais bin Abu Hazim] dari [Bapaknya] dia berada di bawah matahari lalu Nabi Shallallahu'alaihiwasallam menyuruhnya agar berpindah ke tempat yang teduh atau dipersilahkan pindah ke tempat yang teduh."
            },
            {
                "number": 443,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ إِسْمَاعِيلَ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍأَنَّ أَبَاهُ جَاءَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَقَعَدَ فِي الشَّمْسِ قَالَ فَأَوْمَأَ إِلَيْهِ أَوْ قَالَ فَأَمَرَ بِهِ أَنْ يَتَحَوَّلَ إِلَى الظِّلِّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Isma'il] dari [Qais bin Abu Hazim]. Bapaknya datang dan Rasulullah Shallallahu'alaihiwasallam sedang berkhutbah lalu dia duduk di bawah sinar matahari. (Qais bin Abu Hazim Radliyallahu'anhu) berkata; lalu (Rasulullah Shallallahu'alaihiwasallam) memberi isyarat kepadanya. Atau berkata; lalu (Nabi Shallallahu'alaihiwasallam) menyuruhnya agar berpindah ke tempat yang ada naungannya."
            },
            {
                "number": 444,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا ابْنُ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ أَبِيهِقَالَ رَآنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَخْطُبُ فَأَمَرَ بِي فَحُوِّلْتُ إِلَى الظِّلِّ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Ibnu Abu Khalid] dari [Qais bin Abu Hazim] dari [Bapaknya] berkata; Nabi Shallallahu'alaihiwasallam melihatku ketika sedang berkhutbah, lalu beliau menyuruhku berpindah ke tempat yang teduh."
            }
        ]
    }
}