{
    "status": true,
    "data": {
        "start": 741,
        "end": 888,
        "total": 148,
        "book": "ahmad",
        "hadits": [
            {
                "number": 741,
                "arab": "حَدَّثَنَا أَبُو عَامِرٍ قَالَ حَدَّثَنَا زُهَيْرٌ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ عَبْدِ اللَّهِ بْنِ جَرْهَدٍ الْأَسْلَمِيِّ أَنَّهُ سَمِعَ أَبَاهُ جَرْهَدًا يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَخِذُ الْمَرْءِ الْمُسْلِمِ عَوْرَةٌ",
                "id": "Telah menceritakan kepada kami [Abu 'Amir] berkata; telah menceritakan kepada kami [Zuhair] yaitu Ibnu Muhammad, dari [Abdullah bin Muhammad bin 'Aqil] dari [Abdullah bin Jarhad Al Aslami] sesungguhnya telah mendengar [Bapaknya] berkata; saya telah mendengar Rasulullah Shallallahu'alahiwasallam bersabda: \"Paha seseorang muslim adalah aurat\"."
            },
            {
                "number": 742,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى قَالَ أَخْبَرَنِي مَالِكٌ عَنْ أَبِي النَّضْرِ عَنْ زُرْعَةَ بْنِ جَرْهَدٍ الْأَسْلَمِيِّ عَنْ أَبِيهِ وَكَانَ مِنْ أَصْحَابِ الصُّفَّةِ قَالَجَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَى فَخِذِي مُنْكَشِفَةً فَقَالَ خَمِّرْ عَلَيْكَ أَمَا عَلِمْتَ أَنَّ الْفَخِذَ عَوْرَةٌ",
                "id": "Telah menceritakan kepada kami [Ishaq bin 'Isa] berkata; telah mengabarkan kepadaku [Malik] dari [Abu Nadlr] dari [Zur'ah bin Jarhad Al Aslami] dari [Bapaknya] dia adalah seorang ahli shuffah berkata; Rasulullah Shallallahu'alahiwasallam duduk lalu beliau melihat paha saya tersingkap. Lalu beliau bersabda: \"Tutuplah, tidakkah kau tahu, paha adalah aurat\"."
            },
            {
                "number": 743,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ زُرْعَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ جَرْهَدٍ عَنْ جَرْهَدٍ جَدِّهِ وَنَفَرٍ مِنْ أَسْلَمَ سِوَاهُ ذَوِي رِضًاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ عَلَى جَرْهَدٍ وَفَخِذُ جَرْهَدٍ مَكْشُوفَةٌ فِي الْمَسْجِدِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا جَرْهَدُ غَطِّ فَخِذَكَ فَإِنَّ يَا جَرْهَدُ الْفَخِذَ عَوْرَةٌ",
                "id": "Telah menceritakan kepada kami [Husain bin Muhammad] berkata; telah menceritakan kepada kami [Ibnu Abu Az Zanad] dari [Bapaknya] dari [Zur'ah bin Abdurrahman bin Jarhad] dari [Jarhad] kakeknya dan beberapa orang Aslam selainnya yang bisa dipertanggungjawabkan, Rasulullah Shallallahu'alahiwasallam melewati Jarhad dan paha Jarhad tersingkap dalam masjid. Lalu Rasulullah Shallallahu'alahiwasallam bersabda kepadanya, \"Wahai Jarhad tutuplah pahamu. paha itu aurat.\""
            },
            {
                "number": 744,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ قَالَ حَدَّثَنِي أَبُو الزِّنَادِ عَنْ زُرْعَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ جَرْهَدٍ عَنْ جَدِّهِ جَرْهَدٍ قَالَمَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيَّ بُرْدَةٌ وَقَدْ انْكَشَفَتْ فَخِذِي قَالَ غَطِّ فَإِنَّ الْفَخْذَ عَوْرَةٌ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] berkata; telah menceritakan kepadaku [Abu Zinad] dari [Zur'ah bin Abdurrahman bin Jarhad] dari [kakeknya, Jarhad] berkata; Rasulullah Shallallahu'alahiwasallam melewati saya ketika saya memakai selendang yang tersingkap pahaku. Beliau bersabda: \"Tutuplah, karena paha itu aurat\"."
            },
            {
                "number": 745,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عُلَاثَةَ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ قَالَ حَدَّثَنَا خَالِدُ بْنُ اللَّجْلَاجِ أَنَّ أَبَاهُ حَدَّثَهُ قَالَبَيْنَمَا نَحْنُ فِي السُّوقِ إِذْ مَرَّتْ امْرَأَةٌ تَحْمِلُ صَبِيًّا فَثَارَ النَّاسُ وَثُرْتُ مَعَهُمْ فَانْتَهَيْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَقُولُ لَهَا مَنْ أَبُو هَذَا فَسَكَتَتْ فَقَالَ مَنْ أَبُو هَذَا فَسَكَتَتْ فَقَالَ شَابٌّ بِحِذَائِهَا يَا رَسُولَ اللَّهِ إِنَّهَا حَدِيثَةُ السِّنِّ حَدِيثَةُ عَهْدٍ بِجِزْيَةٍ وَإِنَّهَا لَمْ تُخْبِرْكَ وَأَنَا أَبُوهُ يَا رَسُولَ اللَّهِ فَالْتَفَتَ إِلَى مَنْ عِنْدَهُ كَأَنَّهُ يَسْأَلُهُمْ عَنْهُ فَقَالُوا مَا عَلِمْنَا إِلَّا خَيْرًا أَوْ نَحْوَ ذَلِكَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْصَنْتَ قَالَ نَعَمْ فَأَمَرَ بِرَجْمِهِ فَذَهَبْنَا فَحَفَرْنَا لَهُ حَتَّى أَمْكَنَّا وَرَمَيْنَاهُ بِالْحِجَارَةِ حَتَّى هَدَأَ ثُمَّ رَجَعْنَا إِلَى مَجَالِسِنَا فَبَيْنَمَا نَحْنُ كَذَلِكَ إِذْ أَنَا بِشَيْخٍ يَسْأَلُ عَنْ الْفَتَى فَقُمْنَا إِلَيْهِ فَأَخَذْنَا بِتَلَابِيبِهِ فَجِئْنَا بِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّ هَذَا جَاءَ يَسْأَلُ عَنْ الْخَبِيثِ فَقَالَ مَهْ لَهُوَ أَطْيَبُ عِنْدَ اللَّهِ رِيحًا مِنْ الْمِسْكِ قَالَ فَذَهَبْنَا فَأَعَنَّاهُ عَلَى غُسْلِهِ وَحَنُوطِهِ وَتَكْفِينِهِ وَحَفَرْنَا لَهُ وَلَا أَدْرِي أَذَكَرَ الصَّلَاةَ أَمْ لَا",
                "id": "Telah menceritakan kepada kami [Abu Sa'id] budak Bani Hasyim, berkata; telah menceritakan kepada kami [Muhammad bin Abdullah bin 'Ulatsah] berkata; telah menceritakan kepada kami [Abdul Aziz bin 'Umar bin Abdul Aziz] berkata; telah menceritakan kepada kami [Khalid bin Hallaj] sesungguhnya [bapaknya] menceritakannya, berkata; ketika kami sedang berada di pasar, lewatlah seorang wanita yang membawa seorang bayi, lalu serentak orang-orang menyelidikinya, saya juga ikut dengan mereka. Saya laporkan perihal tersebut pada Rasulullah Shallallahu'alahiwasallam, lalu beliau bertanya kepada wanita tersebut, \"Siapakah bapak dari bayi ini\"? wanita tersebut terdiam. (Rasulullah Shallallahu'alahiwasallam) bertanya, siapakah bapak bayi ini? lalu wanita itu tetap terdiam. lalu ada seorang laki-laki yang berdiri di sampingnya, \"Wahai Rasulullah, sungguh perempuan ini masih belum cukup umur dan orang baru yang termasuk pembayar jizyah, dia belum bisa memberitahukan hal itu pada anda, Wahai Rasulullah. Saya bapak dari bayi tersebut\". Lalu (Rasulullah Shallallahu'alahiwasallam) menoleh ke samping orang itu seolah-olah dia bertanya kepada mereka tentangnya. Mereka berkata; sesungguhnya kami tidak mengenalnya kecuali dalam kebaikan, atau yang semisalnya. Maka Rasulullah Shallallahu'alahiwasallam bertanya kepada laki-laki tersebut, \"Apakah engkau sudah menikah?\" dia menjawab, Ya. Maka (Rasulullah Shallallahu'alahiwasallam) memerintahkan untuk merajamnya, lalu kami serentak pergi dan menggali lubang untuknya, sampai ketika kami telah memposisikan dia dalam lubang tersebut dan mulai melemparinya dengan batu. Ketika dia sudah tidak bergerak (bernyawa), kami pulang ke tempat kumpul kami. Ketika kami sedang berkumpul datanglah orang tua menanyakan tentang pemuda tersebut, maka kami berdiri dan mengambilkan untuknya bekas kain yang dipakai dalam prosesi rajam, dan kami membawa orang tua tersebut kepada Rasulullah Shallallahu'alahiwasallam, lalu kami berkata; \"Wahai Rasulullah, sesungguhnya orang tua ini datang untuk menanyakan pemuda yang berbuat buruk tadi\", Rasulullah Shallallahu'alahiwasallam bersabda: \"Tahan, Sungguh dia disisi Allah lebih wangi daripada minyak kasturi\". (Hallaj Radliyallahu'anhu) berkata; lalu kami pergi untuk mensucikan pemuda tersebut, memberi wewangian, mengafani dan menguburnya, tapi saya tidak ingat apakah disholati atau tidak."
            },
            {
                "number": 746,
                "arab": "حَدَّثَنَا الْوَلِيدُ بْنُ مَسْلِمٍ قَالَ سَمِعْتُ يَزِيدَ بْنَ أَبِي مَرْيَمَ قَالَ لَحِقَنِي عَبَايَةُ بْنُ رَافِعِ بْنِ خَدِيجٍ وَأَنَا رَائِحٌ إِلَى الْمَسْجِدِ إِلَى الْجُمُعَةِ مَاشِيًا وَهُوَ رَاكِبٌ قَالَ أَبْشِرْ فَإِنِّي سَمِعْتُ أَبَا عَبْسٍ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اغْبَرَّتْ قَدَمَاهُ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ حَرَّمَهُمَا اللَّهُ عَزَّ وَجَلَّ عَلَى النَّارِ",
                "id": "Telah menceritakan kepada kami [Al Walid bin Muslim] berkata saya telah mendengar [Yazid bin Abu Maryam] berkata; ['Abayah bin Rafi' bin Khadij] menyusulku, sedang saya sedang menuju ke masjid untuk (sholat) Jum'at dengan keadaan berjalan kaki, sedang dia berkendaraan. Dia berkata 'Bergembiralah, saya mendengar [Abu Abbas] berkata; Rasulullah Shallallahu'alahiwasallam bersabda: \"Barangsiapa yang kedua kakinya terkena debu di jalan Allah Azzawajalla, Allah Azzawajalla mengharamkan keduanya untuk neraka.\""
            },
            {
                "number": 747,
                "arab": "حَدَّثَنَا أَبُو سَلَمَةَ الْخُزَاعِيُّ قَالَ أَخْبَرَنَا أَبُو هِلَالٍ عَنْ حُمَيْدِ بْنِ هِلَالٍ الْعَدَوِيِّ سَمِعَهُ مِنْهُ عَنْ أَبِي قَتَادَةَ عَنِ الْأَعْرَابِيِّالَّذِي سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ خَيْرَ دِينِكُمْ أَيْسَرُهُ إِنَّ خَيْرَ دِينِكُمْ أَيْسَرُهُ",
                "id": "Telah menceritakan kepada kami [Abu Salamah Al Khuza'i] berkata; telah mengabarkan kepada kami [Abu Hilal] dari [Humaid bin Hilal Al 'Adawi] sesungguhnya dia mendengarnya, dari [Abu Qatadah] dari [seorang Badui], yang mendengar dari Rasulullah Shallallahu'alahiwasallam bersabda: \"Sebaik-baik perkara agama kalian adalah yang paling mudah urusannya, sungguh sebaik-baik perkara dien kalian adalah yang paling mudah urusannya\""
            },
            {
                "number": 748,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ قَالَ حَدَّثَنِي أَبُو النَّضْرِ عَنْ رَجُلٍ كَانَ قَدِيمًا مِنْ بَنِي تَمِيمٍ كَانَ فِي عَهْدِ عُثْمَانَ رَجُلٌ يُخْبِرُ عَنْ أَبِيهِأَنَّهُ لَقِيَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ اكْتُبْ لِي كِتَابًا أَنْ لَا أُؤَاخَذَ بِجَرِيرَةِ غَيْرِي فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ ذَلِكَ لَكَ وَلِكُلِّ مُسْلِمٍ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Musa bin 'Uqbah] berkata; telah menceritakan kepadaku [Abu Nadlr] dari [seorang laki-laki] dari Bani Tamim pada waktu kekhalifahan 'Utsman menghabari dari bapaknya, dia bertemu Rasulullah Shallallahu'alahiwasallam lalu berkata \"Wahai Rasulullah, tulislah sebagai catatan, bahwa saya tidak menanggung dosa yang diperbuat orang lain\" Lalu Rasulullah Shallallahu'alahiwasallam berkata kepadanya, \"Catatan itu adalah untukmu dan semua kaum muslimin\"."
            },
            {
                "number": 749,
                "arab": "حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ قَالَ أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ جُرَيْجٍ عَنْ عَمْرِو بْنِ دِينَارٍ أَنَّ هِشَامَ بْنَ يَحْيَى أَخْبَرَهُ أَنَّ عِكْرِمَةَ بْنَ سَلَمَةَ بْنِ رَبِيعَةَأَخْبَرَهُ أَنَّ أَخَوَيْنِ مِنْ بَنِي الْمُغِيرَةِ لَقِيَا مُجَمِّعَ بْنَ يَزِيدَ الْأَنْصَارِيَّ فَقَالَ إِنِّي أَشْهَدُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ أَنْ لَا يَمْنَعَ جَارٌ جَارَهُ أَنْ يَغْرِزَ خَشَبَةً فِي جِدَارِهِ فَقَالَ الْحَالِفُ أَيْ أَخِي قَدْ عَلِمْتُ أَنَّكَ مَقْضِيٌّ لَكَ وَقَدْ حَلَفْتُ فَاجْعَلْ أُسْطُوَانًا دُونَ جِدَارِي فَفَعَلَ الْآخَرُ فَغَرَزَ فِي الْأُسْطُوَانِ خَشَبَةًقَالَ ابْنُ جُرَيْجٍ قَالَ عَمْرٌو وَأَنَا نَظَرْتُ إِلَى ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Maki bin Ibrahim] berkata; telah mengabarkan kepada kami [Abdul Malik bin Juraij] dari ['Amr bin Dinar] Sesunguhnya [Hisyam bin Yahya] Mengabarinya sesungguhnya ['Ikrimah bin Salamah bin Rabi'ah] mengabarinya, sesungguhnya dua saudara dari Bani Mughirah bertemu dengan [Mujamma' bin Yazid Al Anshori] lalu berkata; \"Saya bersumpah, sesungguhnya Nabi Shallallahu'alaihiwasallam memerintahkan tetangga untuk tidak melarang para tetangganya yang lain menyandarkan kayu di dinding rumah\", Orang yang tadi bersumpah, yaitu saudaraku sendiri berkata; \"Aku tahu bahwa keputusan jatuh di tanganmu, dan saya telah bersumpah, maka buatlah sandaran pada selain dindingku\", Maka saudaranya itu pun berbuat yang sama untuk tidak menancapkan paku pada dinding tetangganya, dan ia sandarkan kayu pada sebuah tiang. Ibnu Juraij berkata; 'Amr berkata; saya melihat kejadian tersebut."
            },
            {
                "number": 750,
                "arab": "حَدَّثَنَا حَجَّاجٌ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ عَنْ هِشَامِ بْنِ يَحْيَى أَخْبَرَهُ أَنَّ عِكْرِمَةَ بْنَ سَلَمَةَ بْنِ رَبِيعَةَأَخْبَرَهُ أَنَّ أَخَوَيْنِ مِنْ بَنِي الْمُغِيرَةِ أَعْتَقَ أَحَدُهُمَا أَنْ لَا يَغْرِزَ خَشَبًا فِي جِدَارِهِ فَلَقِيَا مُجَمِّعَ بْنَ يَزِيدَ الْأَنْصَارِيَّ وَرِجَالًا كَثِيرًا فَقَالُوا نَشْهَدُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَمْنَعْ جَارٌ جَارَهُ أَنْ يَغْرِزَ خَشَبًا فِي جِدَارِهِ فَقَالَ الْحَالِفُ أَيْ أَخِي قَدْ عَلِمْتُ أَنَّكَ مَقْضِيٌّ لَكَ عَلَيَّ وَقَدْ حَلَفْتُ فَاجْعَلْ أُسْطُوَانًا دُونَ جِدَارِي فَفَعَلَ الْآخَرُ فَغَرَزَ فِي الْأُسْطُوَانِ خَشَبَةًفَقَالَ لِي عَمْرٌو فَأَنَا نَظَرْتُ إِلَى ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Hajjaj] [Ibnu Juraij] berkata; telah mengabarkan kepadaku ['Amr bin Dinar] dari [Hisyam bin Yahya] menghabarinya, sesungguhnya ['Ikrimah bin Salamah bin Rabi'ah] menghabarinya, sesungguhnya dua saudara dari Bani Mughirah membebaskan salah satunya untuk tidak meletakkan kayu pada dindingnya, lalu bertemu dengan [Mujamma' bin Yazid Al Anshori] dan beberapa orang. Mereka berkata; kami menyaksikan Rasulullah Shallallahu'alahiwasallam bersabda: \"Tidak boleh seseorang melarang tetangganya menyandarkan kayu di dinding rumah\", Orang yang bersumpah, yaitu saudaraku berkata; \"Aku tahu bahwa keputusan jatuh di tanganmu, dan saya wajib (untuk taat), namun saya telah bersumpah, maka buatlah sandaran pada selain dindingku\", lalu saudaranya pun berbuat yang sama yaitu tidak menyandarkan kayu di dinding tetangganya, dan menyandarkannya pada sebuah tiang. Lalu 'Amr berkata kepadaku, saya melihat kejadian tersebut."
            },
            {
                "number": 751,
                "arab": "حَدَّثَنَا هَارُونُ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يَزِيدُ بْنُ عِيَاضٍ عَنْ يَزِيدَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ رُقَيْشٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَارِيَةَ عَنْ مُجَمِّعِ بْنِ يَزِيدَ بْنِ جَارِيَةَأَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي نَعْلَيْنِ",
                "id": "Telah menceritakan kepada kami [Harun] berkata; telah menceritakan kepada kami [Ibnu Wahab] berkata; telah mengabarkan kepadaku [Yazid bin 'Iyadl] dari [Yazid bin Abdurrahman bin Ruqaisy] dari [Abdurrahman bin Yazid bin Jariyah] dari [Mujamma' bin Yazid bin Jariyah], pernah dia melihat Nabi Shallallahu'alaihiwasallam sholat dengan memakai kedua sandal."
            },
            {
                "number": 752,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ قَالَ حَدَّثَنَا زَائِدَةُ قَالَ حَدَّثَنَا السَّائِبُ بْنُ حُبَيْشٍ عَنْ أَبِي الشَّمَّاخِ الْأَزْدِيِّ عَنِ ابْنِ عَمٍّ لَهُ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهُ أَتَى مُعَاوِيَةَ فَدَخَلَ عَلَيْهِ وَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ وَلِيَ أَمْرَ النَّاسِ ثُمَّ أَغْلَقَ بَابَهُ دُونَ الْمِسْكِينِ أَوْ الْمَظْلُومِ أَوْ ذِي الْحَاجَةِ أَغْلَقَ اللَّهُ عَزَّ وَجَلَّ دُونَهُ أَبْوَابَ رَحْمَتِهِ عِنْدَ حَاجَتِهِ وَفَقْرِهِ أَفْقَرَ مَا يَكُونُ إِلَيْهَا",
                "id": "Telah menceritakan kepada kami [Abu Sa'id] Budak Bani Hasyim, berkata; telah menceritakan kepada kami [Za'idah] berkata; telah menceritakan kepada kami [As-Sa'ib bin Hubaits] dari [Abu Asy-Syamah Al Azdi] dari [anak pamannya], yaitu termasuk sahabat Nabi Shallallahu'alaihiwasallam, dia menemui Mu'awiyah, dan berkata; saya mendengar Rasulullah Shallallahu'alahiwasallam bersabda: \"Barangsiapa yang mengurus urusan manusia lalu menutup pintu-pintunya untuk orang-orang miskin atau orang yang teraniaya atau orang sedang sangat butuh, niscaya Allah Azzawajalla menutup pintu-pintu rahmAt Nya ketika dia butuh dan terdesak, lebih dari pada yang dia sangat butuhkan.\""
            },
            {
                "number": 753,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَنَادَى رَجُلٌ مِنْ أَهْلِ الشَّامِ يَوْمَ صِفِّينَ أَفِيكُمْ أُوَيْسٌ الْقَرَنِيُّ قَالُوا نَعَمْ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ خَيْرِ التَّابِعِينَ أُوَيْسًا الْقَرَنِيَّ",
                "id": "Telah menceritakan kepada kami [Abu Nua'im] berkata; telah menceritakan kepada kami [Syarik] dari [Yazid bin Abu Ziyad] dari [Abdurrahman bin Abu Laila] berkata; ada [seorang laki-laki] dari penduduk Syam berseru pada Perang Shiffin, Apakah di antara kalian ada yang bernama Uwais Al Qarny?. mereka berkata; benar. (Abdurrahman bin Abu Laila Radliyallahu'anhu) berkata; saya mendengar Rasulullah Shallallahu'alahiwasallam, di antara para tabiin yang terbaik adalah Uwais Al Qarny."
            },
            {
                "number": 754,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ قَالَأُتِيَ عَبْدُ اللَّهِ فِي امْرَأَةٍ تَزَوَّجَهَا رَجُلٌ ثُمَّ مَاتَ عَنْهَا وَلَمْ يَفْرِضْ لَهَا صَدَاقًا وَلَمْ يَكُنْ دَخَلَ بِهَا قَالَ فَاخْتَلَفُوا إِلَيْهِ فَقَالَ أَرَى لَهَا مِثْلَ صَدَاقِ نِسَائِهَا وَلَهَا الْمِيرَاثُ وَعَلَيْهَا الْعِدَّةُ فَشَهِدَ مَعْقِلُ بْنُ سِنَانٍ الْأَشْجَعِيُّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي بِرْوَعَ ابْنَةِ وَاشِقٍ بِمِثْلِ مَا قَضَى",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata; telah mengabarkan kepada kami [Sufyan] dari [Manshur] dari [Ibrahim] dari ['AlQamah] berkata; [Abdullah] dibawa kepada seorang perempuan yang dinikahi seorang laki-laki, lantas si laki-laki meninggal, ternyata si laki-laki belum memberinya maskawin namun belum pula mencampurinya. (Ibrahim bin 'AlQamah Radliyallahu'anhu) berkata; orang-orang pun berselisih dan menyerahkan urusan kepadanya, lalu dia berkata; menurutku wanita itu berhak mendapatkan mahar seperti isteri-isteri yang lainnya. Dia juga termasuk dari ahli waris dan juga wajib ber'iddah. [Ma'qil bin Sinan Al Asyja'i] bersaksi, sesungguhnya Nabi Shallallahu'alaihiwasallam memberi keputusan kepada Birwa' binti Wasyiq sebagaimana keputusan yang diambil (Abdullah)."
            },
            {
                "number": 755,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ قَالَ عَبْد اللَّهِ وَسَمِعْتُهُ أَنَا مِنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ عَطَاءِ بْنِ السَّائِبِ قَالَ شَهِدَ عِنْدِي نَفَرٌ مِنْ أَهْلِ الْبَصْرَةِ مِنْهُمْ الْحَسَنُ بْنُ أَبِي الْحَسَنِ عَنْ مَعْقِلِ بْنِ سِنَانٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ وَهُوَ يَحْتَجِمُ لِثَمَانِ عَشْرَةَ قَالَ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad bin Abu Syaibah] Abdullah berkata; dan saya mendengarnya dari [Abdullah bin Muhammad bin Abu Syaibah] berkata; telah menceritakan kepada kami [Ibnu Fudlail] dari ['Atho' bin As-Sa'ib] berkata; ada beberapa orang Bashrah yang menyaksikan, diantaranya adalah [Al Hasan bin Abu Al Hasan] dari [Ma'qil bin Sinan], Rasulullah Shallallahu'alahiwasallam melewatinya, dia sedang membekam pada tanggal delapan belas. (Rasulullah Shallallahu'alahiwasallam) kontan bersabda: \"Orang yang membekam dan yang dibekam telah batal puasanya.\""
            },
            {
                "number": 756,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا كَهْمَسُ بْنُ الْحَسَنِ عَنْ سَيَّارِ بْنِ مَنْظُورٍ الْفَزَارِيِّ عَنْ أَبِيهِ عَنْ بُهَيْسَةَ عَنْ أَبِيهَا قَالَاسْتَأْذَنْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَخَلْتُ بَيْنَهُ وَبَيْنَ قَمِيصِهِ قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ قَالَ الْمَاءُ قُلْتُ يَا رَسُولَ اللَّهِ مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ قَالَ الْمَاءُ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ قَالَ أَنْ تَفْعَلَ الْخَيْرَ خَيْرٌ لَكَحَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا كَهْمَسٌ قَالَ سَمِعْتُ سَيَّارَ بْنَ مَنْظُورٍ الْفَزَارِيَّ قَالَ حَدَّثَنِي أَبِي عَنْ بُهَيْسَةَ قَالَتِ اسْتَأْذَنَ أَبِي عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَخَلَ بَيْنَهُ وَبَيْنَ قَمِيصِهِ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Waki'] berkata; telah menceritakan kepada kami [Kahmas bin Al Hasan] dari [Sayyar bin Mandzur Al Fazari] dari [bapaknya] dari [Buhaisah] dari [bapaknya] berkata; saya meminta izin kepada Nabi Shallallahu'alaihiwasallam lalu saya masuk antara beliau dan bajunya. (bapaknya Buhaisah Radliyallahu'anhu) berkata; saya berkata \"Wahai Rasulullah, apakah yang tidak diperbolehkan untuk ditolak\"? (Rasulullah Shallallahu'alahiwasallam) menjawab, \"Air\". saya bertanya lagi \"Wahai Rasulullah, apakah yang tidak diperbolehkan untuk ditolak\"? (Rasulullah Shallallahu'alahiwasallam) menjawab, \"Air\". Saya bertanya \"Wahai Rasulullah, apakah yang tidak diperbolehkan untuk ditolak\"? beliau bersabda: \"Kamu berbuat kebaikan itu lebih baik bagimu\". Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Kahmas] berkata; saya telah mendengar [Sayyar bin Mandzur Al Fazari] berkata; telah menceritakan kepadaku [bapakku] dari [Buhaisah] berkata; bapakku meminta izin untuk menemui Nabi Shallallahu'alaihiwasallam, maka dia masuk antara beliau dan bajunya. Lalu menyebutkan secara maknanya."
            },
            {
                "number": 757,
                "arab": "حَدَّثَنَا يَزِيدُ حَدَّثَنَا كَهْمَسٌ قَالَ حَدَّثَنِي سَيَّارُ بْنُ مَنْظُورٍ الْفَزَارِيُّ عَنْ أَبِيهِ عَنْ بُهَيْسَةَ قَالَتِاسْتَأْذَنَ أَبِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلَ يَدْنُو مِنْهُ وَيَلْتَزِمُهُ ثُمَّ قَالَ يَا نَبِيَّ اللَّهِ مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ قَالَ الْمَاءُ ثُمَّ قَالَ يَا نَبِيَّ اللَّهِ مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ قَالَ الْمِلْحُ ثُمَّ قَالَ يَا نَبِيَّ اللَّهِ مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ تَفْعَلْ الْخَيْرَ خَيْرٌ لَكَقَالَ فَانْتَهَى قَوْلُهُ إِلَى الْمَاءِ وَالْمِلْحِ قَالَ وَكَانَ ذَلِكَ الرَّجُلُ لَا يَمْنَعُ شَيْئًا وَإِنْ قَلَّ",
                "id": "Telah menceritakan kepada kami [Yazid] telah menceritakan kepada kami [Kahmas] berkata; telah menceritakan kepadaku [Sayar bin Mandlur Al Fazari] dari [Bapaknya] dari [Buhaitsah], berkata; bapakku meminta ijin kepada Nabi Shallallahu'alaihiwasallam lalu dia mendekatinya dan menemaninya, lalu berkata; Wahai Nabiyullah apakah hal yang tidak boleh ditolak?. Beliau bersabda: \"Air\". Lalu dia bertanya lagi, Wahai Nabiyullah apa yang tidak boleh ditolak?. Beliau menjawab, \"Garam\". Lalu bertanya, Wahai Nabiyullah apa yang tidak boleh ditolak?. Beliau bersabda: \"Jika kamu melakukan kebaikan itu lebih baik bagimu.\" (Bapak Bukaitsah Radliyallahu'anhu) berkata; lalu perkataan sampai pada air dan garam. (Bapak Bukaitsah Radliyallahu'anhu) berkata; laki-laki tersebut tidak pernah menolak sesuatu apapun walaupun sedikit."
            },
            {
                "number": 758,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ اللَّهِ وَسَمِعْتُهُ أَنَا مِنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ شَيْبَةَ قَالَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ يَحْيَى بْنِ الْحَارِثِ التَّيْمِيِّ عَنْ يَحْيَى بْنِ غَسَّانَ التَّيْمِيِّ عَنِ ابْنِ الرَّسِيمِ عَنْ أَبِيهِ أَنَّهُ قَالَوَفَدْنَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَهَانَا عَنْ الظُّرُوفِ قَالَ ثُمَّ قَدِمْنَا عَلَيْهِ فَقُلْنَا إِنَّ أَرْضَنَا أَرْضٌ وَخِمَةٌ قَالَ فَقَالَ اشْرَبُوا فِيمَا شِئْتُمْ مَنْ شَاءَ أَوْكَأَ سِقَاءَهُ عَلَى إِثْمٍ",
                "id": "Telah menceritakan kepada kami Abdullah dan saya telah mendengarnya dari [Abdullah bin Muhammad bin Syaibah] berkata; telah menceritakan kepada kami [Abdurrahim bin Sulaiman] dari [Yahya bin Al Harits At Taimi] dari [Yahya bin Ghassan At Taimi] dari [Abu Ar Rasim] dari [bapakku] sesungguhnya dia berkata; kami mengutus utusan kepada Rasulullah Shallallahu'alahiwasallam, lalu beliau melarang kami menggunakan bejana yang terbuat dari kulit, lalu kami mendatangi beliau. (Abu Ar Rasim Radliyallahu'anhu) berkata; kami berkata; \"Sesungguhnya keadaan tanah kita tidak cocok dengan keadaan cuacanya\". maka beliau bersabda: \"Minumlah kalian menggunakan apa saja yang kalian sukai, siapa saja yang mau, silahkan mengikat tutup minumnya dengan menanggung dosa\"."
            },
            {
                "number": 759,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ أَبُو زَيْدٍ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ التَّيْمِيِّ عَنْ يَحْيَى بْنِ غَسَّانَ التَّيْمِيِّ عَنْ أَبِيهِ قَالَكَانَ أَبِي فِي الْوَفْدِ الَّذِينَ وَفَدُوا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عَبْدِ قَيْسٍ فَنَهَاهُمْ عَنْ هَذِهِ الْأَوْعِيَةِ قَالَ فَأَتْخَمْنَا ثُمَّ أَتَيْنَاهُ الْعَامَ الْمُقْبِلَ قَالَ فَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّكَ نَهَيْتَنَا عَنْ هَذِهِ الْأَوْعِيَةِ فَأَتْخَمْنَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْتَبِذُوا فِيمَا بَدَا لَكُمْ وَلَا تَشْرَبُوا مُسْكِرًا فَمَنْ شَاءَ أَوْكَأَ سِقَاءَهُ عَلَى إِثْمٍ",
                "id": "Telah menceritakan kepada kami [Hasan bin Musa] berkata; telah menceritakan kepada kami [Abdul Aziz bin Muslim Abu Zaid] dari [Yahya bin Abdullah At Taimi] dari [Yahya bin Ghassan At Taimi] dari [Bapaknya] berkata; [bapakku] termasuk utusan yang diutus kepada Rasulullah Shallallahu'alahiwasallam dari Abdu Qais, beliau melarang mereka bejana-bejana ini. (Bapak Ghassan Radliyallahu'anhu) berkata; lalu kami merasa tidak enak makan, kami menemui beliau lagi satu tahun setelahnya. Lalu kami berkata; Wahai Rasulullah, sesungguhnya anda telah pernah melarang kami menggunakan bejana ini dan itu, lalu kami merasa tidak enak makan. Rasulullah Shallallahu'alahiwasallam bersabda: \"Oploslah minuman yang kelihatan layak bagi kalian, janganlah meminum yang memabukkan, sehingga mereka yang berkehendak mengikat tutup minumnya di atas dosa\"."
            },
            {
                "number": 760,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ مُحَمَّدٍ وَسَمِعْتُهُ أَنَا مِنْ عُثْمَانَ بْنِ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا سَعِيدُ بْنُ خُثَيْمٍ الْهِلَالِيُّ قَالَ سَمِعْتُ جَدَّتِي رَبِيعَةَ ابْنَةَ عِيَاضٍ قَالَتْ سَمِعْتُ جَدِّي عُبَيْدَةَ بْنَ عَمْرٍو الْكِلَابِيَّ يَقُولُرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فَأَسْبَغَ الْوُضُوءَقَالَ وَكَانَتْ رِبْعِيَّةُ إِذَا تَوَضَّأَتْ أَسْبَغَتْ الْوُضُوءَ",
                "id": "Telah menceritakan kepada kami ['Utsman bin Muhammad] dan saya telah mendengarnya dari ['Utsman bin Muhammad bin Abu Syaibah] berkata; telah menceritakan kepada kami [Sa'id bin Khutsaim Al Hilali] berkata; saya mendengar [kakek perempuanku, Rabi'ah binti Iyadl] berkata; saya mendengar [kakekku, 'Ubaidah bin 'Amr Al Killaby] berkata; saya melihat Rasulullah Shallallahu'alahiwasallam berwudlu dan menyempurnakanya. ('Ubaidah Radliyallahu'anhu) berkata; Rabi'ah jika berwudlu menyempurnakannya."
            },
            {
                "number": 761,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنَا لَيْثٌ عَنْ طَلْحَةَ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْسَحُ رَأْسَهُ حَتَّى بَلَغَ الْقَذَالَ وَمَا يَلِيهِ مِنْ مُقَدَّمِ الْعُنُقِ مَرَّةًقَالَ الْقَذَالُ السَّالِفَةُ الْعُنُقِ",
                "id": "Telah menceritakan kepada kami [Abdushamad bin Abdul Warits] berkata; telah menceritakan kepadaku [bapakku] berkata; telah menceritakan kepada kami [Laits] dari [Thalhah] dari [bapaknya] dari [kakeknya], dia pernah melihat Rasulullah Shallallahu'alahiwasallam mengusap kepalanya sampai bawah leher setelah itu adalah bagian atas leher sebanyak sekali. Dia berkata; bagian atas leher kemudian leher."
            },
            {
                "number": 762,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ قَالَ حَدَّثَنَا عَاصِمُ بْنُ أَبِي النَّجُودِ عَنِ الْحَارِثِ بْنِ حَسَّانَ الْبَكْرِيِّ قَالَقَدِمْنَا الْمَدِينَةَ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ وَبِلَالٌ قَائِمٌ بَيْنَ يَدَيْهِ مُتَقَلِّدٌ السَّيْفَ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِذَا رَايَاتٌ سُودٌ وَسَأَلْتُ مَا هَذِهِ الرَّايَاتُ فَقَالُوا عَمْرُو بْنُ الْعَاصِ قَدِمَ مِنْ غَزَاةٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin 'Ayyasy] berkata; telah menceritakan kepada kami ['Ashim bin Abu An-Nujud] dari [Al Harits bin Hassan Al Bakri] berkata; kami datang ke Madinah, yang ketika itu Rasulullah Shallallahu'alahiwasallam sedang di atas Mimbar dan Bilal berdiri di depan beliau dengan membawa pedang. Lalu datanglah bendera hitam, saya bertanya, apakah bendera hitam ini? Maka mereka menjawab, \"Itu adalah 'Amar bin Al 'Ash yang datang dari perang\"."
            },
            {
                "number": 763,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا سَلَّامٌ أَبُو الْمُنْذِرِ عَنْ عَاصِمِ بْنِ بَهْدَلَةَ عَنْ أَبِي وَائِلٍ عَنِ الْحَارِثِ بْنِ حَسَّانَ قَالَمَرَرْتُ بِعَجُوزٍ بِالرَّبَذَةِ مُنْقَطِعٌ بِهَا مِنْ بَنِي تَمِيمٍ قَالَ فَقَالَتْ أَيْنَ تُرِيدُونَ قَالَ فَقُلْتُ نُرِيدُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ فَاحْمِلُونِي مَعَكُمْ فَإِنَّ لِي إِلَيْهِ حَاجَةً قَالَ فَقُلْتُ فَدَخَلْتُ الْمَسْجِدَ فَإِذَا هُوَ غَاصٌّ بِالنَّاسِ وَإِذَا رَايَةٌ سَوْدَاءُ تَخْفِقُ فَقُلْتُ مَا شَأْنُ النَّاسِ الْيَوْمَ قَالُوا هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُرِيدُ أَنْ يَبْعَثَ عَمْرَو بْنَ الْعَاصِ وَجْهًا قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنْ رَأَيْتَ أَنْ تَجْعَلَ الدَّهْنَاءَ حِجَازًا بَيْنَنَا وَبَيْنَ بَنِي تَمِيمٍ فَافْعَلْ فَإِنَّهَا كَانَتْ لَنَا مَرَّةً قَالَ فَاسْتَوْفَزَتْ الْعَجُوزُ وَأَخَذَتْهَا الْحَمِيَّةُ فَقَالَتْ يَا رَسُولَ اللَّهِ أَيْنَ تَضْطَرُّ مُضَرَكَ قُلْتُ يَا رَسُولَ اللَّهِ حَمَلْتُ هَذِهِ وَلَا أَشْعُرُ أَنَّهَا كَائِنَةٌ لِي خَصْمًا قَالَ قُلْتُ أَعُوذُ بِاللَّهِ أَنْ أَكُونَ كَمَا قَالَ الْأَوَّلُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا قَالَ الْأَوَّلُ قَالَ عَلَى الْخَبِيرِ سَقَطْتَ يَقُولُ سَلَّامٌ هَذَا أَحْمَقُ يَقُولُ الرَّسُولُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْخَبِيرِ سَقَطْتَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هِيهْ يَسْتَطْعِمُهُ الْحَدِيثَ قَالَ إِنَّ عَادًا أَرْسَلُوا وَافِدَهُمْ قَيْلًا فَنَزَلَ عَلَى مُعَاوِيَةَ بْنِ بَكْرٍ شَهْرًا يَسْقِيهِ الْخَمْرَ وَتُغَنِّيهِ الْجَرَادَتَانِ فَانْطَلَقَ حَتَّى أَتَى عَلَى جِبَالِ مُهْرَةَ فَقَالَ اللَّهُمَّ إِنِّي لَمْ آتِ لِأَسِيرٍ أُفَادِيهِ وَلَا لِمَرِيضٍ فَأُدَاوِيَهُ فَاسْقِ عَبْدَكَ مَا كُنْتَ سَاقِيَهُ وَاسْقِ مُعَاوِيَةَ بْنَ بَكْرٍ شَهْرًا يَشْكُرْ لَهُ الْخَمْرَ الَّتِي شَرِبَهَا عِنْدَهُ قَالَ فَمَرَّتْ سَحَابَاتٌ سُودٌ فَنُودِيَ أَنْ خُذْهَا رَمَادًا رِمْدِدًا لَا تَذَرْ مِنْ عَادٍ أَحَدًاقَالَ أَبُو وَائِلٍ فَبَلَغَنِي أَنَّ مَا أُرْسِلَ عَلَيْهِمْ مِنْ الرِّيحِ كَقَدْرِ مَا يَجْرِي فِي الْخَاتَمِ",
                "id": "Telah menceritakan kepada kami ['Affan] berkata; telah menceritakan kepada kami [Sallam Abu Al Mundzir] dari ['Ashim bin Bahdalah] dari [Abu Wa'il] dari [Al Harits bin Hassan] berkata; saya melewati seseorang yang sudah tua di Rabdzah berjalan sendirian dari Bani Tamim. (Al Harits bin Hassan Radliyallahu'anhu) berkata; dia bertanya: 'Kalian hendak kemana? ' (Al Harits bin Hassan Radliyallahu'anhu) berkata; saya menjawab, kami hendak menemui Rasulullah Shallallahu'alahiwasallam. Dia berkata; 'Ajaklah saya bersama kalian, saya memiliki keperluan kepada beliau.' (Al Harits bin Hassan Radliyallahu'anhu) berkata; saya masuk ke masjid, waktu itu beliau sedang dipenuhi orang-orang, dan di situ juga ada bendera hitam yang berkibar. Saya bertanya ada apa orang-orang pada hari ini? Mereka menjawab, Rasulullah Shallallahu'alahiwasallam hendak mengutus 'Amr bin Al 'Ash ke suatu peperangan. (Al Harits bin Hassan Radliyallahu'anhu) berkata; 'Wahai Rasulullah, bagaimana pendapat anda jika anda menjadikan Dahna' sebagai penghalang, antara kami dengan Bani Tamim?. Jika anda setuju, karena tempat itu menjadi tempat lewat kami.' (Al Harits bin Hassan Radliyallahu'anhu) berkata; orang tua tadi tidak tenang dalam duduknya dan mulai terlihat rasa fanatisme kesukuannya, lalu berkata; 'Wahai Rasulullah, di mana anda memaksa rasa masam anda. Saya berkata; Wahai Rasulullah, saya mengajak orang ini dan saya tidak merasa kalau dia mememusuhiku. (Al Harits bin Hassan Radliyallahu'anhu) berkata; saya berkata; saya berlindung kepada Allah jika saya menjadi sebagaimana yang dikatakan pertama kali. Rasulullah Shallallahu'alahiwasallam bertanya, apa yang dikatakan pertama. (Al Harits bin Hassan Radliyallahu'anhu) berkata; tepat kamu pada orang yang tahu, Sallam berkata; orang ini bodoh ini, Rasulullah Shallallahu'alahiwasallam bersabda: tepat kamu pada orang yang tahu. (Al Harits bin Hassan Radliyallahu'anhu) berkata; Rasulullah Shallallahu'alahiwasallam bersabda: \"Tambahkan kepadaku\", -beliau meminta tambahan perkataan cerita-. Dia berkata; sesungguhnya kaum 'Ad telah mengutus utusan mereka yaitu Qail, lalu singgah pada Mu'awiyah bin Bakr selama sebulan, dan memberinya minum dengan arak, ada dua budak yang bernyanyi untuknya, lalu dia pergi sampai di gunung Muhrah. Lalu berkata; Ya Allah, sesungguhnya saya tidak datang kepada tawanan yang akan saya tebus, juga bukan orang yang sakit lalu saya obati, berilah minum hamba-Mu dengan apa yang engkau kehendaki, berilah minum Mu'awiyah bin Bakr selama sebulan dengan arak yang dia minum. (Al Harits bin Hassan Radliyallahu'anhu) berkata; lalu lewatlah awan-awan yang hitam lalu diserukan agar mengambilnya untuk merusakkan serusak-rusaknya. Jangan tinggalkan kaum 'Ad satupun. Abu Wa'il berkata; sampai kepadaku, sesungguhnya yang dikirimkan kepada mereka berupa angin seukuran apa yang bisa melewati cincin."
            },
            {
                "number": 764,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ حَدَّثَنِي أَبُو الْمُنْذِرِ سَلَّامُ بْنُ سُلَيْمَانَ النَّحْوِيُّ قَالَ حَدَّثَنَا عَاصِمُ بْنُ أَبِي النَّجُودِ عَنْ أَبِي وَائِلٍ عَنِ الْحَارِثِ بْنِ يَزِيدَ الْبَكْرِيِّ قَالَخَرَجْتُ أَشْكُو الْعَلَاءَ بْنَ الْحَضْرَمِيِّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَرَرْتُ بِالرَّبَذَةِ فَإِذَا عَجُوزٌ مِنْ بَنِي تَمِيمٍ مُنْقَطِعٌ بِهَا فَقَالَتْ لِي يَا عَبْدَ اللَّهِ إِنَّ لِي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَاجَةً فَهَلْ أَنْتَ مُبَلِّغِي إِلَيْهِ قَالَ فَحَمَلْتُهَا فَأَتَيْتُ الْمَدِينَةَ فَإِذَا الْمَسْجِدُ غَاصٌّ بِأَهْلِهِ وَإِذَا رَايَةٌ سَوْدَاءُ تَخْفِقُ وَبِلَالٌ مُتَقَلِّدٌ السَّيْفَ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ مَا شَأْنُ النَّاسِ قَالُوا يُرِيدُ أَنْ يَبْعَثَ عَمْرَو بْنَ الْعَاصِ وَجْهًا قَالَ فَجَلَسْتُ قَالَ فَدَخَلَ مَنْزِلَهُ أَوْ قَالَ رَحْلَهُ فَاسْتَأْذَنْتُ عَلَيْهِ فَأَذِنَ لِي فَدَخَلْتُ فَسَلَّمْتُ فَقَالَ هَلْ كَانَ بَيْنَكُمْ وَبَيْنَ بَنِي تَمِيمٍ شَيْءٌ قَالَ فَقُلْتُ نَعَمْ قَالَ وَكَانَتْ لَنَا الدَّبْرَةُ عَلَيْهِمْ وَمَرَرْتُ بِعَجُوزٍ مِنْ بَنِي تَمِيمٍ مُنْقَطِعٌ بِهَا فَسَأَلَتْنِي أَنْ أَحْمِلَهَا إِلَيْكَ وَهَا هِيَ بِالْبَابِ فَأَذِنَ لَهَا فَدَخَلَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنْ رَأَيْتَ أَنْ تَجْعَلَ بَيْنَنَا وَبَيْنَ بَنِي تَمِيمٍ حَاجِزًا فَاجْعَلْ الدَّهْنَاءَ فَحَمِيَتْ الْعَجُوزُ وَاسْتَوْفَزَتْ قَالَتْ يَا رَسُولَ اللَّهِ فَإِلَى أَيْنَ تَضْطَرُّ مُضَرَكَ قَالَ قُلْتُ إِنَّمَا مَثَلِي مَا قَالَ الْأَوَّلُ مِعْزَاءُ حَمَلَتْ حَتْفَهَا حَمَلْتُ هَذِهِ وَلَا أَشْعُرُ أَنَّهَا كَانَتْ لِي خَصْمًا أَعُوذُ بِاللَّهِ وَرَسُولِهِ أَنْ أَكُونَ كَوَافِدِ عَادٍ قَالَ هِيهْ وَمَا وَافِدُ عَادٍ وَهُوَ أَعْلَمُ بِالْحَدِيثِ مِنْهُ وَلَكِنْ يَسْتَطْعِمُهُ قُلْتُ إِنَّ عَادًا قَحَطُوا فَبَعَثُوا وَافِدًا لَهُمْ يُقَالُ لَهُ قَيْلٌ فَمَرَّ بِمُعَاوِيَةَ بْنِ بَكْرٍ فَأَقَامَ عِنْدَهُ شَهْرًا يَسْقِيهِ الْخَمْرَ وَتُغَنِّيهِ جَارِيَتَانِ يُقَالُ لَهُمَا الْجَرَادَتَانِ فَلَمَّا مَضَى الشَّهْرُ خَرَجَ جِبَالَ تِهَامَةَ فَنَادَى اللَّهُمَّ إِنَّكَ تَعْلَمُ أَنِّي لَمْ أَجِئْ إِلَى مَرِيضٍ فَأُدَاوِيَهُ وَلَا إِلَى أَسِيرٍ فَأُفَادِيَهُ اللَّهُمَّ اسْقِ عَادًا مَا كُنْتَ تَسْقِيهِ فَمَرَّتْ بِهِ سَحَابَاتٌ سُودٌ فَنُودِيَ مِنْهَا اخْتَرْ فَأَوْمَأَ إِلَى سَحَابَةٍ مِنْهَا سَوْدَاءَ فَنُودِيَ مِنْهَا خُذْهَا رَمَادًا رِمْدِدًا لَا تُبْقِ مِنْ عَادٍ أَحَدًا قَالَ فَمَا بَلَغَنِي أَنَّهُ بُعِثَ عَلَيْهِمْ مِنْ الرِّيحِ إِلَّا قَدْرَ مَا يَجْرِي فِي خَاتِمِي هَذَا حَتَّى هَلَكُواقَالَ أَبُو وَائِلٍ وَصَدَقَ قَالَ فَكَانَتْ الْمَرْأَةُ وَالرَّجُلُ إِذَا بَعَثُوا وَافِدًا لَهُمْ قَالُوا لَا تَكُنْ كَوَافِدِ عَادٍ",
                "id": "Telah menceritakan kepada kami [Zaib bin Al Habhab] berkata; telah menceritakan kepadaku [Abu Al Mundzir, Sallam bin Sulaiman Al Nahwi] berkata; telah menceritakan kepada kami ['Ashim bin Abu An-Nujud] dari [Abu Wa'il] dari [Al Harits bin Yazid Al Bakri] berkata; saya keluar hendak mengadukan Al 'Ala' bin Al Hadlrami kepada Rasulullah Shallallahu'alahiwasallam Lalu saya melewati Rabdzah, di sana ada nenek tua dari Bani Tamim berjalan sendirian. Lalu dia berkata kepadaku, Wahai Abdullah, saya hendak menuju Rasulullah Shallallahu'alahiwasallam karena suatu urusan, maukah kamu mengantarkan saya kepada beliau?. (Al Harits bin Yazid Al Bakri Radliyallahu'anhu) berkata; saya membawanya ke Madinah, ternyata masjid telah ramai dengan orang yang berada di dalamnya, di situ juga ada bendera hitam yang berkibar. Bilal sedang menenteng pedang di depan Rasulullah Shallallahu'alahiwasallam. Saya bertanya, ada apa dengan orang-orang? Mereka menjawab, (Rasulullah Shallallahu'alahiwasallam) hendak mengutus 'Amr bin Al 'Ash ke suatu lokasi. (Al Harits bin Yazid Al Bakri Radliyallahu'anhu) berkata; saya duduk, dan beliau masuk ke dalam rumah beliau, atau kendaraannya, saya meminta ijin kepada beliau, beliau mengijinkannya. Saya masuk dan mengucapkan salam kepada beliau. Beliau bertanya, apakah antara kalian dan Bani Tamim ada masalah yang harus dipecahkan?. (Al Harits bin Yazid Al Bakri Radliyallahu'anhu) berkata; saya menjawab, Ya. Kami menguasai mereka, saya melewati seseorang wanita tua dari Bani Tamim yang berjalan sendirian, dia memintaku untuk mengajaknya menemui anda dan ini orangnya ada di depan pintu. Beliau pun mengijinkannya dan dia masuk. Saya berkata; Wahai Rasulullah, jika anda berkenan, tolong buatlah benteng yang menghalangi antara antara kami dengan Bani Tamim, dan buatlah padang luas yang terbuka. Nenek tua tadi kontan terlihat rasa fanatisme sukunya dan duduk bergerak kesana-kesini pertanda nggak suka. Dia berkata; 'Wahai Rasulullah, di mana anda memaksa bani Mudharmu?. (Al Harits bin Yazid Al Bakri Radliyallahu'anhu) berkata; saya katakan, permisalanku sebagaimana yang dikatakan pertama kali, 'Padang tandus yang membawa bebatuannya' -maksudnya Harits bin Yazid membawa musuh bebuyutan- saya mengajak wanita tua ini, saya tidak merasa kalau dia ternyata musuh bagiku. Saya berlindung kepada Allah dan Rasul-Nya, jika saya seperti utusan kepada kaum 'Ad. Beliau bersabda: \"Apakah utusan 'Ad itu?\", padahal beliau lebih tahu dengan yang terjadi tentangnya namun beliau memintanya di jelaskan. Saya berkata; kaum 'Ad mengalami masa paceklik, lalu mengutus seseorang yang bernama Qail bin 'Athar, selanjutnya dia singgah di Mu'awiyah bin Bakr. Dia singgah di tempatnya selama sebulan. Qail menjamunya dengan minuman arak, sedang dua budak yang bernama Al Jaradatan mendendangkan lagu-lagu untuknya. Setelah habis sebulan, Qail pergi ke gunung Tihamah lalu berkata; 'Ya Allah, sungguh Kamu tahu bahwa saya tidak datang kepada orang yang sakit untuk saya obati, tidak pula kepada tawanan untuk saya tebus, berilah siraman hujan kepada kaum 'Ad, hanya kamu yang memberi mereka minuman, awan-awan hitam datang mengepul, lalu adau suara panggilan dari awan itu 'pilihlah'. Qail memberi isyarat ke arah awan yang berwarna hitam, kontan ada suara panggilan dari awan tersebut 'Ambillah sebagai awan yang menghancurkan sehancur-hancurnya.' Jangan kau tinggalkan kaum 'Ad seorang pun. (Al Harits bin Yazid Al Bakri Radliyallahu'anhu) berkata; berita yang sampai kepadaku angin yang dikirim kepada mereka kecuali hanya seukuran angin yang bisa melewati cincinku ini namun mereka musnah. Abu Wa'il berkata; dan benar. (Al Harits bin Yazid Al Bakri Radliyallahu'anhu) berkata; atas kejadian ini, jika ada seorang laki-laki maupun wanita mengutus utusan, mereka menyampaikan pesan, 'Namun kalian janganlah seperti utusan kaum 'Ad.'"
            },
            {
                "number": 765,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا سَعِيدٌ الْجُرَيْرِيُّ عَنْ أَبِي السَّلِيلِ عَنْ أَبِي تَمِيمَةَ الْهُجَيْمِيِّ قَالَ إِسْمَاعِيلُ مَرَّةً عَنْ أَبِي تَمِيمَةَ الْهُجَيْمِيِّ عَنْ رَجُلٍ مِنْ قَوْمِهِ قَالَلَقِيتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ طُرُقِ الْمَدِينَةِ وَعَلَيْهِ إِزَارٌ مِنْ قُطْنٍ مُنْتَثِرُ الْحَاشِيَةِ فَقُلْتُ عَلَيْكَ السَّلَامُ يَا رَسُولَ اللَّهِ فَقَالَ إِنَّ عَلَيْكَ السَّلَامَ تَحِيَّةُ الْمَوْتَى إِنَّ عَلَيْكَ السَّلَامَ تَحِيَّةُ الْمَوْتَى إِنَّ عَلَيْكَ السَّلَامَ تَحِيَّةُ الْمَوْتَى سَلَامٌ عَلَيْكُمْ سَلَامٌ عَلَيْكُمْ مَرَّتَيْنِ أَوْ ثَلَاثًا هَكَذَا قَالَ سَأَلْتُ عَنْ الْإِزَارِ فَقُلْتُ أَيْنَ أَتَّزِرُ فَأَقْنَعَ ظَهْرَهُ بِعَظْمِ سَاقِهِ وَقَالَ هَاهُنَا اتَّزِرْ فَإِنْ أَبَيْتَ فَهَاهُنَا أَسْفَلَ مِنْ ذَلِكَ فَإِنْ أَبَيْتَ فَهَاهُنَا فَوْقَ الْكَعْبَيْنِ فَإِنْ أَبَيْتَ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ قَالَ وَسَأَلْتُهُ عَنْ الْمَعْرُوفِ فَقَالَ لَا تَحْقِرَنَّ مِنْ الْمَعْرُوفِ شَيْئًا وَلَوْ أَنْ تُعْطِيَ صِلَةَ الْحَبْلِ وَلَوْ أَنْ تُعْطِيَ شِسْعَ النَّعْلِ وَلَوْ أَنْ تَنْزِعَ مِنْ دَلْوِكَ فِي إِنَاءِ الْمُسْتَسْقِي وَلَوْ أَنْ تُنَحِّيَ الشَّيْءَ مِنْ طَرِيقِ النَّاسِ يُؤْذِيهِمْ وَلَوْ أَنْ تَلْقَى أَخَاكَ وَوَجْهُكَ إِلَيْهِ مُنْطَلِقٌ وَلَوْ أَنْ تَلْقَى أَخَاكَ فَتُسَلِّمَ عَلَيْهِ وَلَوْ أَنْ تُؤْنِسَ الْوُحْشَانَ فِي الْأَرْضِ وَإِنْ سَبَّكَ رَجُلٌ بِشَيْءٍ يَعْلَمُهُ فِيكَ وَأَنْتَ تَعْلَمُ فِيهِ نَحْوَهُ فَلَا تَسُبَّهُ فَيَكُونَ أَجْرُهُ لَكَ وَوِزْرُهُ عَلَيْهِ وَمَا سَرَّ أُذُنَكَ أَنْ تَسْمَعَهُ فَاعْمَلْ بِهِ وَمَا سَاءَ أُذُنَكَ أَنْ تَسْمَعَهُ فَاجْتَنِبْهُ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Ibrahim] berkata; telah menceritakan kepada kami [Sa'id Al Jurairi] dari [Abu As-Salil] dari [Abu Tamimah Al Hujaimi]. [Isma'il] berkata pada kali lain, dari [Abu Tamimah Al Hujaimi] dari [seorang laki-laki kaumnya] berkata; saya bertemu Rasulullah Shallallahu'alahiwasallam di salah satu jalan di Madinah dan beliau memakai sarung yang terbuat dari kapas yang ujungnya terjuntai. Saya berkata; \"Semoga keselamatan atas anda, wahai Rasulullah\". Lalu (Rasulullah Shallallahu'alahiwasallam) bersabda: \"Sesungguhnya 'ALAIKASSALAM (semoga keselamatan atas kamu), adalah doa keselamatan untuk orang yang telah meninggal. Sesungguhnya 'ALAIKASSALAM, adalah doa keselamatan untuk orang yang telah meninggal. Sesungguhnya 'ALAIKASSALAM, adalah doa keselamatan untuk orang yang telah meninggal. Semoga keselamatan atas kalian, semoga keselamatan atas kalian, dua kali atau tiga kali. (seorang laki-laki kaum Abu Tamimah) berkata; saya bertanya tentang memakai sarung, dimana saya memakai sarung? Beliau lalu mengangkat ujung sarung sampai pertengahan betisnya lantas dia berkata; 'Disinilah tempatnya.' Jika kamu enggan maka turunkanlah sedikit dari itu, jika kamu masih enggan juga, maka tempatnya adalah di atas kedua tumit kaki, jika kamu masih enggan juga, sesungguhnya Allah Azzawajalla tidak menyukai orang yang sombong lagi memamerkan diri. Lalu saya bertanya tentang perkara kebaikan. Maka beliau bersabda: \"Janganlah menyepelekan perkara kebaikan sedikitpun, walau hanya dengan memberikan tali, walau hanya memberikan tali sandal, walau hanya mengisi dari embermu kepada orang yang butuh air, Walau menyingkirkan sesuatu dari jalan yang dapat mengganggu manusia, walaupun hanya bertemu dengan saudaramu dalam keadaan wajah yang berseri, walaupun jika kau bertemu saudaramu, lalu kamu mengucapkan salam untuknya, walaupun hanya lemah-lembut terhadap binatang liar yang di bumi. Jika ada seseorang yang mencelamu, karena dia tahu keburukanmu dan kamu juga tahu keburukannya, maka janganlah kamu mencelanya, maka pahalanya akan menjadi milikmu dan dosanya dilimpahkan kepadanya. Apa yang telingamu senang untuk mendengarnya, lakukanlah! Dan segala hal yang telingamu tidak suka mendengarnya, jauhilah."
            },
            {
                "number": 766,
                "arab": "قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ عَنِ الْجُرَيْرِيِّ عَنْ أَبِي الْعَلَاءِ بْنِ الشِّخِّيرِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ صُحَارٍ الْعَبْدِيِّ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقُومُ السَّاعَةُ حَتَّى يُخْسَفَ بِقَبَائِلَ فَيُقَالُ مَنْ بَقِيَ مِنْ بَنِي فُلَانٍ قَالَ فَعَرَفْتُ حِينَ قَالَ قَبَائِلَ أَنَّهَا الْعَرَبُ لِأَنَّ الْعَجَمَ تُنْسَبُ إِلَى قُرَاهَا",
                "id": "(Ahmad bin Hanbal Radliyallahu'anhu) berkata; telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Al Jurairi] dari [Abu Al 'Ala'i bin Asy-Syikhkhir] dari [Abdurrahman bin Shuhar Al 'Abdy] dari [bapaknya] berkata; Rasulullah Shallallahu'alahiwasallam bersabda: \"Tidak akan datang Hari Kiamat sampai ditenggelamkan kabilah-kabilah ke bumi\", lalu ditanyakan, siapakah yang tersisa dari Bani Fulan? lalu berkata; saya mengetahuinya maksud dari kata kabilah-kabilah, sesungguhnya itu adalah adalah Arab karena orang-orang selain Arab menisbatkan diri mereka kepada desa tempat tinggal mereka."
            },
            {
                "number": 767,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الطَّيَالِسِيُّ قَالَ وَحَدَّثَنَا الضَّحَّاكُ بْنُ يَسَارٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ صُحَارٍ الْعَبْدِيُّ عَنْ أَبِيهِ قَالَاسْتَأْذَنْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَأْذَنَ لِي فِي جَرَّةٍ أَنْتَبِذُ فِيهَا فَرَخَّصَ لِي فِيهَا أَوْ أَذِنَ لِي فِيهَا",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al Thayalisi] berkata; dan telah menceritakan kepada kami [Al Dlahak bin Yasar] berkata; telah menceritakan kepada kami [Yazid bin Abdullah bin Asy-Syikhir] berkata; telah menceritakan kepada kami [Abdurrahman bin Shuhar Al 'Abdi] dari [bapaknya] berkata; saya meminta izin Rasulullah Shallallahu'alahiwasallam untuk memakai bejana yang terbuat dari tanah liat untuk memeras anggur maka beliau memperbolehkan atau mengizinkan hal tersebut."
            },
            {
                "number": 768,
                "arab": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ قَالَ حَدَّثَنَا أَبُو عَقِيلٍ يَعْنِي الثَّقَفِيَّ عَبْدَ اللَّهِ بْنَ عَقِيلٍ حَدَّثَنَا مُوسَى بْنُ الْمُسَيَّبِ أَخْبَرَنِي سَالِمُ بْنُ أَبِي الْجَعْدِ عَنْ سَبْرَةَ بْنِ أَبِي فَاكِهٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الشَّيْطَانَ قَعَدَ لِابْنِ آدَمَ بِأَطْرُقِهِ فَقَعَدَ لَهُ بِطَرِيقِ الْإِسْلَامِ فَقَالَ لَهُ أَتُسْلِمُ وَتَذَرُ دِينَكَ وَدِينَ آبَائِكَ وَآبَاءِ أَبِيكَ قَالَ فَعَصَاهُ فَأَسْلَمَ ثُمَّ قَعَدَ لَهُ بِطَرِيقِ الْهِجْرَةِ فَقَالَ أَتُهَاجِرُ وَتَذَرُ أَرْضَكَ وَسَمَاءَكَ وَإِنَّمَا مَثَلُ الْمُهَاجِرِ كَمَثَلِ الْفَرَسِ فِي الطِّوَلِ قَالَ فَعَصَاهُ فَهَاجَرَ قَالَ ثُمَّ قَعَدَ لَهُ بِطَرِيقِ الْجِهَادِ فَقَالَ لَهُ هُوَ جَهْدُ النَّفْسِ وَالْمَالِ فَتُقَاتِلُ فَتُقْتَلُ فَتُنْكَحُ الْمَرْأَةُ وَيُقَسَّمُ الْمَالُ قَالَ فَعَصَاهُ فَجَاهَدَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَنْ فَعَلَ ذَلِكَ مِنْهُمْ فَمَاتَ كَانَ حَقًّا عَلَى اللَّهِ أَنْ يُدْخِلَهُ الْجَنَّةَ أَوْ قُتِلَ كَانَ حَقًّا عَلَى اللَّهِ عَزَّ وَجَلَّ أَنْ يُدْخِلَهُ الْجَنَّةَ وَإِنْ غَرِقَ كَانَ حَقًّا عَلَى اللَّهِ أَنْ يُدْخِلَهُ الْجَنَّةَ أَوْ وَقَصَتْهُ دَابَّتُهُ كَانَ حَقًّا عَلَى اللَّهِ أَنْ يُدْخِلَهُ الْجَنَّةَ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] berkata; telah menceritakan kepada kami [Abu 'Aqil] yaitu Ats-Staqafi, Abdullah bin 'Aqil, telah menceritakan kepada kami [Musa bin Al Musayyab] telah mengabarkan kepadaku [Salim bin Abu Al Jad] dari [Sabrah bin Abu Fakih] berkata; saya mendengar Rasulullah Shallallahu'alahiwasallam bersabda: \"Setan menghalangi anak Adam dari banyak jalan. Dia duduk di jalan Islam, dia berkata kepada manusia, 'Apakah engkau mau masuk Islam dan meninggalkan agamamu dan agama nenek moyangmu? ' (Rasulullah Shallallahu'alahiwasallam) bersabda: \"Lalu orang tersebut tidak menurutinya dan dia masuk Islam\" Lalu setan menghalanginya dari jalan hijrah, dengan berkata; apakah kamu akan berhijrah meninggalkan bumimu dan langitmu?. Permisalan orang yang berhijrah sebagaimana kuda yang ditambat. (Rasulullah Shallallahu'alahiwasallam) bersabda: lalu manusia tidak menurutinya dan dia tetap berhijrah. (Rasulullah Shallallahu'alahiwasallam) bersabda: lantas dia menghadangnya dari pintu jihad dan berkata; \"Jihad adalah mengorbankan harta dan nyawa, engkau mau membunuh dan terbunuh, dan istrimu akan dinikahi orang lain dan hartamu akan dibagi-bagikan?, (Rasulullah Shallallahu'alahiwasallam) bersabda: orang itu menolaknya dan tetap berjihad. Rasulullah Shallallahu'alahiwasallam bersabda: \"Barangsiapa yang berbuat seperti itu di antara mereka dan mati dalam keadaan tersebut, maka Allah memasukkannya ke surga\" ataupun dia terbunuh maka kewajiban Allah Azzawajalla untuk memasukkan ke surga. Jika dia tenggelam, maka kewajiban Allah untuk memasukkan dia ke surga ataupun juga di tewas karena kendaraannya, maka kewajiban Allah untuk memasukkannya ke surga\"."
            },
            {
                "number": 769,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامِ بْنِ عُرْوَةَ قَالَ أَخْبَرَنِي أَبِي عَنْ عَبْدِ اللَّهِ بْنِ أَرْقَمَأَنَّهُ حَجَّ فَكَانَ يُصَلِّي بِأَصْحَابِهِ يُؤَذِّنُ وَيُقِيمُ فَأَقَامَ يَوْمًا الصَّلَاةَ وَقَالَ لِيُصَلِّ أَحَدُكُمْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا أَرَادَ أَحَدُكُمْ أَنْ يَذْهَبَ إِلَى الْخَلَاءِ وَأُقِيمَتْ الصَّلَاةُ فَلْيَذْهَبْ إِلَى الْخَلَاءِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Hisyam bin 'Urwah] berkata; telah mengabarkan kepadaku [bapakku] dari [Abdullah bin Arqam] sesungguhnya dia berhaji, dia sholat bersama para sahabatnya. Dia melantunkan adzan dan iqamah, lalu didirikan sholat pada suatu hari, lalu dia berkata; sholatlah salah seorang dari kalian, saya mendengar Rasulullah Shallallahu'alahiwasallam bersabda: \"Apabila salah seorang di antara kalian hendak pergi ke WC, dan sholat sedang didirikan, pergilah ke WC dulu\"."
            },
            {
                "number": 770,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ عَنْ أَبَانَ بْنِ صَالِحٍ عَنِ الْفَضْلِ بْنِ عَبْدِ اللَّهِ بْنِ مَعْقِلِ بْنِ سِنَانٍ عَنْ عَبْدِ اللَّهِ بْنِ نِيَارٍ الْأَسْلَمِيِّ عَنْ عَمْرِو بْنِ شَأْسٍ الْأَسْلَمِيِّ قَالَ وَكَانَ مِنْ أَصْحَابِ الْحُدَيْبِيَةِ قَالَخَرَجْتُ مَعَ عَلِيٍّ إِلَى الْيَمَنِ فَجَفَانِي فِي سَفَرِي ذَلِكَ حَتَّى وَجَدْتُ فِي نَفْسِي عَلَيْهِ فَلَمَّا قَدِمْتُ أَظْهَرْتُ شَكَايَتَهُ فِي الْمَسْجِدِ حَتَّى بَلَغَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَخَلْتُ الْمَسْجِدَ ذَاتَ غُدْوَةٍ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَاسٍ مِنْ أَصْحَابِهِ فَلَمَّا رَآنِي أَمَدَّنِي عَيْنَيْهِ يَقُولُ حَدَّدَ إِلَيَّ النَّظَرَ حَتَّى إِذَا جَلَسْتُ قَالَ يَا عَمْرُو وَاللَّهِ لَقَدْ آذَيْتَنِي قُلْتُ أَعُوذُ بِاللَّهِ أَنْ أُوذِيَكَ يَا رَسُولَ اللَّهِ قَالَ بَلَى مَنْ آذَى عَلِيًّا فَقَدْ آذَانِي",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Aban bin Shalih] dari [Al Fadl bin Abdullah bin Ma'qil bin Sinan] dari [Abdullah bin Niyar Al Aslami] dari ['Amr bin Sya'si Al Aslamy] berkata; dia termasuk dari ahli Hudaibiyah berkata; saya bepergian bersama 'Ali ke Yaman, 'Ali berbuat kasar terhadapku dalam perjalanan itu sehingga saya marah terhadapnya. Ketika sampai di tujuan, saya mengadukan kejadian tersebut di masjid, hingga hal tersebut sampai pada Rasulullah Shallallahu'alahiwasallam, saya masuk ke masjid pada suatu pagi dan Rasulullah Shallallahu'alahiwasallam berada dalam kerumunan para sahabatnya. Ketika beliau melihatku, beliau menajamkan pandangannya seolah-olah mengancamku dengan pandangan beliau. Tatkala saya sudah duduk beliau bersabda: \"Wahai 'Amr, Demi Allah, sungguh kamu telah menyakitiku\" Saya menjawab, \"Saya berlindung kepada Allah jika saya menyakiti anda, wahai Rasulullah\". Lalu beliau bersabda: \"Ya, barangsiapa yang menyakiti 'Ali, dia telah menyakitiku\"."
            },
            {
                "number": 771,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا الْمُرَجَّى بْنُ رَجَاءٍ الْيَشْكُرِيُّ قَالَ حَدَّثَنِي سَلْمُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ سَمِعْتُ سَوَادَةَ بْنَ الرَّبِيعِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْتُهُ فَأَمَرَ لِي بِذَوْدٍ ثُمَّ قَالَ لِي إِذَا رَجَعْتَ إِلَى بَيْتِكَ فَمُرْهُمْ فَلْيُحْسِنُوا غِذَاءَ رِبَاعِهِمْ وَمُرْهُمْ فَلْيُقَلِّمُوا أَظْفَارَهُمْ وَلَا يَعْبِطُوا بِهَا ضُرُوعَ مَوَاشِيهِمْ إِذَا حَلَبُوا",
                "id": "Telah menceritakan kepada kami [Abu Nadlr] berkata; telah menceritakan kepada kami [Al Murajja bin Raja' Al Yasykuri] berkata; telah menceritakan kepadaku [Salm bin Abdurrahman] berkata; saya mendengar [Sawadah bin Ar Rabi'] berkata; saya mendatangi Nabi Shallallahu'alaihiwasallam lalu saya bertanya, beliau menyuruhku dengan sekumpulan unta (antara3-10) lalu bersabda: \"Jikalau kamu pulang ke rumahmu maka suruhlah mereka untuk tidak menyapih anak unta dari induk-induknya, dan perintahlah mereka untuk memotong kuku mereka. Janganlah serampangan dalam bersikap terhadap unta ternaknya ketika memeras susunya\""
            },
            {
                "number": 772,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ مُحَمَّدٍ عَنْ حَبِيبِ بْنِ هِنْدِ بْنِ أَسْمَاءَ الْأَسْلَمِيِّ عَنْ هِنْدِ بْنِ أَسْمَاءَ قَالَبَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى قَوْمِي مِنْ أَسْلَمَ فَقَالَ مُرْ قَوْمَكَ فَلْيَصُومُوا هَذَا الْيَوْمَ يَوْمَ عَاشُورَاءَ فَمَنْ وَجَدْتَهُ مِنْهُمْ قَدْ أَكَلَ فِي أَوَّلِ يَوْمِهِ فَلْيَصُمْ آخِرَهُ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim] berkata; telah menceritakan kepada kami [bapakku] dari [Ibnu Ishaq] berkata; telah menceritakan kepada kami [Abdurrahman bin Abu Bakar bin Muhammad] dari [Habib bin Hind bin Asma' Al Aslami] dari [Hind bin Asma'] berkata; Rasulullah Shallallahu'alahiwasallam mengutusku menuju kaumku dari Aslam dan bersabda: \"Suruhlah kaum-mu untuk berpuasa hari ini yaitu hari 'Asyura', siapa saja yang kamu temukan telah makan dari mereka pada hari ini, hendaklah mereka berpuasa pada penghujung harinya (maksudnya meneruskan puasanya) \"."
            },
            {
                "number": 773,
                "arab": "قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ حَرْمَلَةَ عَنْ يَحْيَى بْنِ هِنْدِ بْنِ حَارِثَةَ وَكَانَ هِنْدٌ مِنْ أَصْحَابِ الْحُدَيْبِيَةِ وَأَخُوهُ الَّذِي بَعَثَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ قَوْمَهُ بِصِيَامِ عَاشُورَاءَ وَهُوَ أَسْمَاءُ بْنُ حَارِثَةَ فَحَدَّثَنِي يَحْيَى بْنُ هِنْدٍ عَنْ أَسْمَاءَ بْنِ حَارِثَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَهُ فَقَالَ مُرْ قَوْمَكَ بِصِيَامِ هَذَا الْيَوْمِ قَالَ أَرَأَيْتَ إِنْ وَجَدْتُهُمْ قَدْ طَعِمُوا قَالَ فَلْيُتِمُّوا آخِرَ يَوْمِهِمْ",
                "id": "(Ahmad bin Hanbal Radliyallahu'anhu) berkata; telah menceritakan kepada kami ['Affan] berkata; telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Abdurrahman bin Harmalah] dari Yahya bin Haritsah, Hind adalah salah seorang pengikut dalam Peristiwa Hudaibiyyah, dan saudaranya yang mengutusnya. Dia berkata; suruhlah kaummu dengan berpuasa 'Asyura'. Dia adalah Asma' bin Haristsah lalu dia menceritakan kepadaku [Yahya bin Hind] dari [Asma' bin Haristsah], Rasulullah Shallallahu'alahiwasallam mengutusnya, lalu bersabda: \"Suruhlah kaummu untuk berpuasa pada hari ini\" dia bertanya, bagaimana pendapat anda jika saya mendapati mereka telah makan? Beliau bersabda: \"Sempurnakanlah sampai akhir hari\"."
            },
            {
                "number": 774,
                "arab": "قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامٍ يَعْنِي ابْنَ عُرْوَةَ قَالَ أَخْبَرَنِي أَبِي عَنِ الْأَحْنَفِ بْنِ قَيْسٍ عَنْ عَمٍّ لَهُ يُقَالُ لَهُ جَارِيَةُ بْنُ قُدَامَةَأَنَّ رَجُلًا قَالَ لَهُ يَا رَسُولَ اللَّهِ قُلْ لِي قَوْلًا وَأَقْلِلْ عَلَيَّ لَعَلِّي أَعْقِلُهُ قَالَ لَا تَغْضَبْ فَأَعَادَ عَلَيْهِ مِرَارًا كُلُّ ذَلِكَ يَقُولُ لَا تَغْضَبْقَالَ يَحْيَى كَذَا قَالَ هِشَامٌ قُلْتُ يَا رَسُولَ اللَّهِ وَهُمْ يَقُولُونَ لَمْ يُدْرِكْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Hisyam] yaitu Ibnu 'Urwah, berkata; telah mengabarkan kepadaku [bapakku] dari [Al Ahnaf bin Qais] dari [salah seorang pamannya] yang bernama Jariyah bin Qudamah, Ada seorang laki-laki berkata kepadanya, Wahai Rasulullah, katakanlah kepadaku satu perkataan dan ringankanlah itu supaya saya dapat memahaminya?. lalu beliau bersabda: \"Janganlah kamu marah\", beliau mengulanginya berkali-kali, semuanya berbunyi, \"Janganlah kamu marah\". Yazid berkata; begini. Hisyam berkata; Wahai Rasulullah. Mereka berkata dia tidak mengetahui Nabi Shallallahu'alaihiwasallam."
            },
            {
                "number": 775,
                "arab": "حَدَّثَنَا عِصَامُ بْنُ خَالِدٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ بْنِ أَبِي إِسْحَاقَ الْهَمْدَانِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ ذِي الْجَوْشَنِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ أَنْ فَرَغَ مِنْ أَهْلِ بَدْرٍ بِابْنِ فَرَسٍ لِي فَقُلْتُ يَا مُحَمَّدُ إِنِّي قَدْ جِئْتُكَ بِابْنِ الْعَرْجَاءِ لِتَتَّخِذَهُ قَالَ لَا حَاجَةَ لِي فِيهِ وَلَكِنْ إِنْ شِئْتَ أَنْ أَقِيضَكَ بِهِ الْمُخْتَارَةَ مِنْ دُرُوعِ بَدْرٍ فَقُلْتُ مَا كُنْتُ لِأَقِيضَكَ الْيَوْمَ بِعُدَّةٍ قَالَ فَلَا حَاجَةَ لِي فِيهِ ثُمَّ قَالَ يَا ذَا الْجَوْشَنِ أَلَا تُسْلِمُ فَتَكُونَ مِنْ أَوَّلِ هَذَا الْأَمْرِ قُلْتُ لَا قَالَ لِمَ قُلْتُ إِنِّي رَأَيْتُ قَوْمَكَ قَدْ وَلِعُوا بِكَ قَالَ فَكَيْفَ بَلَغَكَ عَنْ مَصَارِعِهِمْ بِبَدْرٍ قَالَ قُلْتُ بَلَغَنِي قَالَ قُلْتُ إِنْ تَغْلِبْ عَلَى مَكَّةَ وَتَقْطُنْهَا قَالَ لَعَلَّكَ إِنْ عِشْتَ أَنْ تَرَى ذَلِكَ قَالَ ثُمَّ قَالَ يَا بِلَالُ خُذْ حَقِيبَةَ الرَّجُلِ فَزَوِّدْهُ مِنْ الْعَجْوَةِ فَلَمَّا أَنْ أَدْبَرْتُ قَالَ أَمَا إِنَّهُ مِنْ خَيْرِ بَنِي عَامِرٍ قَالَ فَوَاللَّهِ إِنِّي لَبِأَهْلِي بِالْغَوْرِ إِذْ أَقْبَلَ رَاكِبٌ فَقُلْتُ مِنْ أَيْنَ قَالَ مِنْ مَكَّةَ فَقُلْتُ مَا فَعَلَ النَّاسُ قَالَ قَدْ غَلَبَ عَلَيْهَا مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُلْتُ هَبِلَتْنِي أُمِّي فَوَاللَّهِ لَوْ أُسْلِمُ يَوْمَئِذٍ ثُمَّ أَسْأَلُهُ الْحِيرَةَ لَأَقْطَعَنِيهَاحَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَالْحَكَمُ بْنُ مُوسَى قَالَا حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ ذِي الْجَوْشَنِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَاقَ عَنْ ذِي الْجَوْشَنِ أَبِي شِمْرٍ الضِّبَابِيِّ نَحْوَ هَذَا الْحَدِيثِ قَالَ سُفْيَانُ فَكَانَ ابْنُ ذِي الْجَوْشَنِ جَارًا لِأَبِي إِسْحَاقَ لَا أُرَاهُ إِلَّا سَمِعَهُ مِنْهُ",
                "id": "Telah menceritakan kepada kami ['Isham bin Khalid] telah menceritakan kepada kami ['Isa bin Yunus bin Abu Ishaq Al Hamdani] dari [Bapaknya] dari [kakeknya] dari [Dzil Jausyan] berkata; saya menemui Nabi Shallallahu'alaihiwasallam setelah beliau menemui Ahli Badar dengan anak kuda milikku. Saya berkata; Wahai Muhammad! Saya datang kepada anda, saya membawa Ibnu Al Arja', agar anda mengambilnya. Beliau bersabda: \"Saya tidak berminat dengannya, namun jika kau mau, saya akan menggantikan dengan anak kuda itu untukmu dengan baju besi dari Badar yang mahal. Saya berkata; saya tidak akan menukarkannya hari ini dengan barang lain. (Rasulullah Shallallahu'alahiwasallam) bersabda: \"Saya tidak ada keperluan dengan barang itu\" lalu bersabda: \"Wahai Dzal Jausyan!, tidakkah kau masuk Islam, lalu kamu menjadi menjadi orang yang pertama pada urusan ini\". Saya berkata; tidak. (Rasulullah Shallallahu'alahiwasallam) bersabda: \"Kenapa?\" Saya menjawab, saya melihat kaum anda telah terkena fitnah dengan anda. Beliau bersabda: \"Bagaimana kabar yang sampai padamu tentang tempat meninggalnya mereka di Badar?.\" (Dzil Jausyan Radliyallahu'anhu) berkata; ya, telah sampai kepadaku. Bisakah anda mengalahkan Makkah dan anda tinggal di dalamnya?. Beliau bersabda: \"Semoga jika kau masih hidup, kamu bisa menyaksikan hal itu\". (Dzil Jausyan Radliyallahu'anhu) berkata; beliau bersabda: \"Wahai Bilal, ambilah tas orang ini dan isilah dengan kurma 'Ajuwa. Tatkala saya hendak berangkat, beliau bersabda: \"Dia adalah orang paling baik di Bani 'Amir\". (Dzil Jausyan Radliyallahu'anhu) berkata; demi Allah, ketika saya bersama dengan keluarga pada suatu tempat yang rendah, datanglah orang yang berkendaraan. Saya bertanya, dari mana? Dia menjawab, dari Makkah. Saya (Dzil Jausyan Radliyallahu'anhu) berkata; apa yang terjadi di sana? Dia menjawab, Muhammad Shallallahu'alaihiwasallam telah mengalahkannya. (Dzil Jausyan Radliyallahu'anhu) berkata; 'ibuku telah kehilanganku' demi Allah, seandainya saya masuk Islam saat itu, lalu saya meminta Al Hirah (nama tempat) agar saya dapat memotongnya. Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Al Hakam bin Musa] berkata; telah menceritakan kepada kami ['Isa bin Yunus] dari [Bapaknya] dari [kakeknya] dari [Dzil Jausyan] dari Nabi Shallallahu'alaihiwasallam semisalnya. (Ahmad bin Hanbal Radliyallahu'anhu) berkata; telah menceritakan kepada kami [Muhammad bin 'Abbad] berkata; telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Dzil Jausyan, Abu Syimr Al Dlababi] seperti ini."
            },
            {
                "number": 776,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا أَبَانُ الْعَطَّارُ حَدَّثَنَا قَتَادَةُ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَبِي عُبَيْدٍ أَنَّهُطَبَخَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِدْرًا فِيهِ لَحْمٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاوِلْنِي ذِرَاعَهَا فَنَاوَلْتُهُ فَقَالَ نَاوِلْنِي ذِرَاعَهَا فَنَاوَلْتُهُ فَقَالَ نَاوِلْنِي ذِرَاعَهَا فَقَالَ يَا نَبِيَّ اللَّهِ كَمْ لِلشَّاةِ مِنْ ذِرَاعٍ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَوْ سَكَتَّ لَأَعْطَتْكَ ذِرَاعًا مَا دَعَوْتَ بِهِ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Aban Al 'Athar] telah menceritakan kepada kami [Qatadah] dari [Syahr bin Hausab] dari [Abu 'Ubaid], dia memasak untuk Rasulullah Shallallahu'alahiwasallam dalam suatu periuk yang berisi daging, lalu Rasulullah Shallallahu'alahiwasallam bersabda: \"Berikan lengannya untukku\", maka saya serahkan untuknya, lalu beliau bersabda: \"Ambillkan untukku lengannya\", maka saya ambilkan untuknya, bersabda: \"Berikan untukku lengannya\", maka saya serahkan untuknya, (Abu 'Ubaid Radliyallahu'anhu) berkata; \"Wahai Nabiyullah, berapa lengan yang ada pada kambing\"? beliau bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, jikalah kamu diam, niscaya kamu akan diberi lengan kambing sebanyak yang kamu inginkan\"."
            },
            {
                "number": 777,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ قَالَ حَدَّثَنِي الْهِرْمَاسُ بْنُ زِيَادٍ الْبَاهِلِيُّ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى رَاحِلَتِهِ يَوْمَ النَّحْرِ بِمِنًي",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari ['Ikrimah bin 'Ammar] berkata; telah menceritakan kepadaku [Al Hirmas bin Ziyad Al Bahily] berkata; Aku melihat Rasulullah Shallallahu'alaihiwasallam berpidato di atas untanya pada hari nahar ketika di Mina. "
            },
            {
                "number": 778,
                "arab": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ وَهُوَ الْعِجْلِيُّ حَدَّثَنَا الْهِرْمَاسُ بْنُ زِيَادٍ الْبَاهِلِيُّ قَالَكُنْتُ رِدْفَ أَبِي يَوْمَ الْأَضْحَى وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى نَاقَتِهِ بِمِنًى",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami ['Ikrimah bin 'Ammar] yaitu Al 'Ijli, telah menceritakan kepada kami [Al Hirmas bin Ziyad Al Bahily] berkata; saya membonceng bapakku pada Idul Adha dan Rasulullah Shallallahu'alaihiwasallam berkhutbah di atas untanya di Mina."
            },
            {
                "number": 779,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَاقِدٍ قَالَ أَخْبَرَنِي عِكْرِمَةُ بْنُ عَمَّارٍ عَنِ الْهِرْمَاسِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى بَعِيرٍ نَحْوَ الشَّامِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Waqid] berkata; telah mengabarkan kepadaku ['Ikrimah bin 'Ammar] dari [Al Hirmas] berkata; saya melihat Rasulullah Shallallahu'alaihiwasallam sholat di atas unta menghadap Syam."
            },
            {
                "number": 780,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عِمْرَانَ بْنِ أَبِي عَلِيٍّ أَبُو مُحَمَّدٍ مِنْ أَهْلِ الرَّيِّ وَكَانَ أَصْلُهُ أَصْبَهَانِيًّا قَالَ حَدَّثَنَا يَحْيَى بْنُ الضُّرَيْسِ قَالَ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ عَنْ هِرْمَاسٍ قَالَكُنْتُ رِدْفَ أَبِي فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى بَعِيرٍ وَهُوَ يَقُولُ لَبَّيْكَ بِحَجَّةٍ وَعُمْرَةٍ مَعًا",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Abdullah bin 'Imran bin Abu 'Ali, Abu Muhammad] dari Ray, yang aslinya adalah dari Asbahan, berkata; telah menceritakan kepada kami [Yahya bin Adl-Dlurais] berkata; telah menceritakan kepada kami ['Ikrimah bin 'Ammar] dari [Hirmas] berkata; saya membonceng bapakku, lalu saya melihat Rasulullah Shallallahu'alaihiwasallam di atas unta dengan membaca 'Kami berniat haji dan umrah bersama-sama.'"
            },
            {
                "number": 781,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا يَحْيَى بْنُ زُرَارَةَ السَّهْمِيُّ قَالَ حَدَّثَنِي أَبِي عَنْ جَدِّي الْحَارِثِ بْنِ عَمْرٍوأَنَّهُ لَقِيَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ فَقُلْتُ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ اسْتَغْفِرْ لِي قَالَ غَفَرَ اللَّهُ لَكُمْ قَالَ وَهُوَ عَلَى نَاقَتِهِ الْعَضْبَاءِ قَالَ فَاسْتَدَرْتُ لَهُ مِنْ الشِّقِّ الْآخَرِ أَرْجُو أَنْ يَخُصَّنِي دُونَ الْقَوْمِ فَقُلْتُ اسْتَغْفِرْ لِي قَالَ غَفَرَ اللَّهُ لَكُمْ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ الْفَرَائِعُ وَالْعَتَائِرُ قَالَ مَنْ شَاءَ فَرَّعَ وَمَنْ شَاءَ لَمْ يُفَرِّعْ وَمَنْ شَاءَ عَتَرَ وَمَنْ شَاءَ لَمْ يَعْتِرْ فِي الْغَنَمِ أُضْحِيَّةٌ ثُمَّ قَالَ أَلَا إِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا وَقَالَ عَفَّانُ مَرَّةً حَدَّثَنِي يَحْيَى بْنُ زُرَارَةَ السَّهْمِيُّ قَالَ حَدَّثَنِي أَبِي عَنْ جَدِّهِ الْحَارِثِ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Yahya bin Zurarah As-Sahmi] berkata; telah menceritakan kepadaku [bapakku] dari [kakekku, Al Harits bin 'Amr], dia bertemu Rasulullah Shallallahu'alaihiwasallam pada waktu Haji Wada', maka aku berkata; Demi ayahku dan ibuku, wahai Rasulullah, mintakanlah ampun untukku. (Rasulullah Shallallahu'alaihiwasallam) bersabda di atas untanya yang bernama Al'Adlba', \"Semoga Allah mengampuni kalian\". Lalu saya berputar ke sisi yang lain berharap untuk mendapatkan perhatian beliau, dan saya berkata 'Tolong mintakan ampun untukku, wahai Rasulullah.' (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Semoga Allah mengampuni kalian\". Ada seseorang yang berkata 'Wahai Rasulullah, Al fara'i' dan al'Ata'ir apa boleh dilakukan?. Beliau bersabda: \"Barangsiapa yang berkenan lakukanlah, dan barangsiapa yang berkenan jangan lakukan. Barangsiapa yang mau menyembelih lakukanlah, siapa yang tidak mau maka tinggalkanlah kambing, sebagai hewan kurban\". Lalu beliau bersabda: \"Ketahuilah bahwa darah dan harta kalian adalah haram sebagaimana keharaman hari ini di negeri kalian ini'. Dan 'Affan berkata suatu kali, telah menceritakan kepadaku Yahya bin Zurarah As-Sahmi berkata; telah menceritakan kepadaku bapakku dari kakekku, Al Harits. "
            },
            {
                "number": 782,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْحَاقَ قَالَ حَدَّثَنِي سَعِيدُ بْنُ عُبَيْدِ بْنِ السَّبَّاقِ عَنْ أَبِيهِ عَنْ سَهْلِ بْنِ حُنَيْفٍ قَالَكُنْتُ أَلْقَى مِنْ الْمَذْيِ شِدَّةً فَكُنْتُ أُكْثِرُ الِاغْتِسَالَ مِنْهُ فَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَقَالَ إِنَّمَا يُجْزِئُكَ مِنْهُ الْوُضُوءُ فَقُلْتُ كَيْفَ بِمَا يُصِيبُ ثَوْبِي فَقَالَ يَكْفِيكَ أَنْ تَأْخُذَ كَفًّا مِنْ مَاءٍ فَتَمْسَحَ بِهَا مِنْ ثَوْبِكَ حَيْثُ تَرَى أَنَّهُ أَصَابَ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Ibrohim] berkata; telah mengabarkan kepada kami [Muhammad bin Ishaq] berkata; telah menceritakan kepadaku [Sa'id bin 'Ubaid Bin As-Sabaq] dari [Bapaknya] dari [Sahal bin Hunaif] berkata; Saya mengeluarkan madzi karena tingginya hasratku, hingga menyebabkan banyak mandi. Saya bertanya Rasulullah Shallallahu'alaihiwasallam tentang hal itu. Beliau bersabda: \"Cukup bagimu berwudlu\". Saya bertanya, Bagaimana dengan pakaianku yang terkena itu? beliau bersabda: \"Cukuplah engkau ambil segenggam air lalu engkau usap pakaianmu di bagian yang kau lihat terkena\""
            },
            {
                "number": 783,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي وَائِلٍ قَالَ قَالَ سَهْلُ بْنُ حُنَيْفٍاتَّهِمُوا رَأْيَكُمْ فَلَقَدْ رَأَيْتُنَا يَوْمَ أَبِي جَنْدَلٍ وَلَوْ نَسْتَطِيعُ أَنْ نَرُدَّ أَمْرَهُ لَرَدَدْنَاهُ وَاللَّهِ مَا وَضَعْنَا سُيُوفَنَا عَنْ عَوَاتِقِنَا مُنْذُ أَسْلَمْنَا لِأَمْرٍ يُفْظِعُنَا إِلَّا أَسْهَلَ بِنَا إِلَى أَمْرٍ نَعْرِفُهُ إِلَّا هَذَا الْأَمْرَ مَا سَدَدْنَا خَصْمًا إِلَّا انْفَتَحَ لَنَا خَصْمٌ آخَرُ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] berkata; telah menceritakan kepada kami [Al 'Amasy] dari [Abu Wa'il] berkata; [Sahal bin Hunaif] berkata; perhitungkanlah pendapat kalian, kami mengalami hari-hari siksaan Abu Jandal, sekiranya kami dapat mengembalikan urusannya niscaya kami akan mengembalikannya. Demi Allah, tidaklah kami meletakkan pedang dari pundak kami sejak kami masuk Islam karena suatu urusan yang sangat mengerikan, kecuali memudahkan kami kepada urusan yang kami ketahui, kecuali urusan ini (maksudnya saat-saat tumbuhnya sekte khawarij). Kami tidak menutup permusuhan kecuali terbuka lagi bagi kami permusuhan yang lain."
            },
            {
                "number": 784,
                "arab": "حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ سِيَاهٍ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ قَالَأَتَيْتُ أَبَا وَائِلٍ فِي مَسْجِدِ أَهْلِهِ أَسْأَلُهُ عَنْ هَؤُلَاءِ الْقَوْمِ الَّذِينَ قَتَلَهُمْ عَلِيٌّ بِالنَّهْرَوَانِ فَفِيمَا اسْتَجَابُوا لَهُ وَفِيمَا فَارَقُوهُ وَفِيمَا اسْتَحَلَّ قِتَالَهُمْ قَالَ كُنَّا بِصِفِّينَ فَلَمَّا اسْتَحَرَّ الْقَتْلُ بِأَهْلِ الشَّامِ اعْتَصَمُوا بِتَلٍّ فَقَالَ عَمْرُو بْنُ الْعَاصِ لِمُعَاوِيَةَ أَرْسِلْ إِلَى عَلِيٍّ بِمُصْحَفٍ وَادْعُهُ إِلَى كِتَابِ اللَّهِ فَإِنَّهُ لَنْ يَأْبَى عَلَيْكَ فَجَاءَ بِهِ رَجُلٌ فَقَالَ بَيْنَنَا وَبَيْنَكُمْ كِتَابُ اللَّهِ{ أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِنْ الْكِتَابِ يُدْعَوْنَ إِلَى كِتَابِ اللَّهِ لِيَحْكُمَ بَيْنَهُمْ ثُمَّ يَتَوَلَّى فَرِيقٌ مِنْهُمْ وَهُمْ مُعْرِضُونَ }فَقَالَ عَلِيٌّ نَعَمْ أَنَا أَوْلَى بِذَلِكَ بَيْنَنَا وَبَيْنَكُمْ كِتَابُ اللَّهِ قَالَ فَجَاءَتْهُ الْخَوَارِجُ وَنَحْنُ نَدْعُوهُمْ يَوْمَئِذٍ الْقُرَّاءَ وَسُيُوفُهُمْ عَلَى عَوَاتِقِهِمْ فَقَالُوا يَا أَمِيرَ الْمُؤْمِنِينَ مَا نَنْتَظِرُ بِهَؤُلَاءِ الْقَوْمِ الَّذِينَ عَلَى التَّلِّ أَلَا نَمْشِي إِلَيْهِمْ بِسُيُوفِنَا حَتَّى يَحْكُمَ اللَّهُ بَيْنَنَا وَبَيْنَهُمْ فَتَكَلَّمَ سَهْلُ بْنُ حُنَيْفٍ فَقَالَ يَا أَيُّهَا النَّاسُ اتَّهِمُوا أَنْفُسَكُمْ فَلَقَدْ رَأَيْتُنَا يَوْمَ الْحُدَيْبِيَةِ يَعْنِي الصُّلْحَ الَّذِي كَانَ بَيْنَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَيْنَ الْمُشْرِكِينَ وَلَوْ نَرَى قِتَالًا لَقَاتَلْنَا فَجَاءَ عُمَرُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَلَسْنَا عَلَى الْحَقِّ وَهُمْ عَلَى بَاطِلٍ أَلَيْسَ قَتْلَانَا فِي الْجَنَّةِ وَقَتْلَاهُمْ فِي النَّارِ قَالَ بَلَى قَالَ فَفِيمَ نُعْطِي الدَّنِيَّةَ فِي دِينِنَا وَنَرْجِعُ وَلَمَّا يَحْكُمِ اللَّهُ بَيْنَنَا وَبَيْنَهُمْ فَقَالَ يَا ابْنَ الْخَطَّابِ إِنِّي رَسُولُ اللَّهِ وَلَنْ يُضَيِّعَنِي أَبَدًا قَالَ فَرَجَعَ وَهُوَ مُتَغَيِّظٌ فَلَمْ يَصْبِرْ حَتَّى أَتَى أَبَا بَكْرٍ فَقَالَ يَا أَبَا بَكْرٍ أَلَسْنَا عَلَى حَقٍّ وَهُمْ عَلَى بَاطِلٍ أَلَيْسَ قَتْلَانَا فِي الْجَنَّةِ وَقَتْلَاهُمْ فِي النَّارِ قَالَ بَلَى قَالَ فَفِيمَ نُعْطِي الدَّنِيَّةَ فِي دِينِنَا وَنَرْجِعُ وَلَمَّا يَحْكُمِ اللَّهُ بَيْنَنَا وَبَيْنَهُمْ فَقَالَ يَا ابْنَ الْخَطَّابِ إِنَّهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَنْ يُضَيِّعَهُ اللَّهُ أَبَدًا قَالَ فَنَزَلَتْ سُورَةُ الْفَتْحِ قَالَ فَأَرْسَلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى عُمَرَ فَأَقْرَأَهَا إِيَّاهُ قَالَ يَا رَسُولَ اللَّهِ وَفَتْحٌ هُوَ قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Ya'la bin 'Ubaid] dari [Abdul Aziz bin Siyah] dari [Habib bin Abu Tsabit] berkata; saya mendatangi [Abu Wa'il] di masjid keluarganya, saya bertanya kepadanya tentang kaum yang diperangi 'Ali di Nahrawan, hal-hal apa saja yang mereka terima, hal-hal apa saja yang mereka tak cocok, dan hal-hal apa saja sehingga 'Ali menganggap halal mereka diperangi. (Abu Wa'il radliyallahu'anhu) berkata; kami saat itu sedang di Shiffin, tatkala berkecamuk perang dengan penduduk Syam, mereka berpegang teguh untuk tetap di tempat yang tinggi. Lalu 'Amr bin Al 'Ash berkata kepada Mu'awiyah 'Utuslah seseorang kepada 'Ali dengan mushaf dan ajaklah dia kepada kitab Allah, dia tidak bakalan menolaknya.' Sang utusan pun datang menemui 'Ali dan berujar 'Antara kita dan kalian ada kitab Allah, 'Tidakkah kamu memperhatikan orang-orang yang telah diberi bahagian yaitu Al Kitab (Taurat), mereka diseru kepada Kitab Allah supaya Kitab itu menetapkan hukum diantara mereka; Kemudian sebahagian dari mereka berpaling, dan mereka selalu membelakangi (kebenaran) ' 'Ali berkata; ya saya lebih layak untuk melakukan hal itu, antara kami dan kalian ada kitab Allah. Lalu datanglah Al Khawarij, pada saat itu kami memanggil mereka dengan istilah Al Qurra', pedang mereka diletakkan pada pundak-pundak mereka. Mereka berkata; Wahai Amirul Mukminin, kenapa kita menunggu mereka, kaum yang berada di atas dataran tinggi itu, tidak sebaiknyakah kita berjalan kepada mereka dengan membawa pedang kita, sampai Allah memutuskan antara kita dengan mereka?. Lalu [Sahl bin Hunaif] berkata; Wahai manusia, koreksilah diri kalian sendiri, kami telah mengadakan perdamaian pada saat Hudaibiyah antara Rasulullah Shallallahu'alaihiwasallam dan kaum musrikin. Jika kami hendak berperang niscaya itu akan terjadi. Lalu datanglah 'Umar kepada Rasulullah Shallallahu'alaihiwasallam, berkata; \"Wahai Rasulullah, bukankah kita berada di atas kebenaran dan mereka berada di atas kebatilan, bukankah jika ada yang terbunuh diantara kita berada di surga dan jika ada yang terbunuh dari mereka akan berada di neraka?.\" Beliau menjawab, ya. ('Umar radliyallahu'anhu) berkata; kenapa kita memberi kehinaan kepada agama kita ini dan kita kembali, bukankah Allah telah memutuskan antara kita dan mereka?. beliau bersabda: \"Wahai Ibnu Khattab, saya adalah Rasulullah Shallallahu'alaihiwasallam dan (Allah Azzawajalla) tidak akan menelantarkanku selamanya.\" (Abu Wa'il radliyallahu'anhu) berkata; lalu Umar pulang dalam keadaan marah dan tidak sabar sehingga mendatangi Abu Bakar, seraya bertanya-tanya, Wahai Abu Bakar, bukankah kita berada di atas kebenaran dan mereka di atas kebatilan, bukankah korban dari kita berada di syurga dan korban dari mereka di neraka?.\" (Abu Bakar) menjawab, ya. ('Umar radliyallahu'anhu) berkata; kenapa kita memberi kekurangan pada agama kita ini dan kita kembali, bukankah Allah telah memutuskan antara kita dan mereka?. Abu Bakar terus mengatakan, \"Wahai Ibnu Al Khattab, dia adalah Rasulullah Shallallahu'alaihiwasallam dan Allah Azzawajalla tidak bakalan menelantarkannya selama-lamanya.\" (Abu Wa'il radliyallahu'anhu) berkata; lalu turunlah Surat Al Fath. Lantas Rasulullah Shallallahu'alaihiwasallam mengutusku kepada 'Umar, dan saya membacakan kepadanya. Dia berkata; Wahai Rasulullah, apakah itu berarti kemenangan?. Beliau menjawab, Ya."
            },
            {
                "number": 785,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا حِزَامُ بْنُ إِسْمَاعِيلَ الْعَامِرِيُّ عَنْ أَبِي إِسْحَاقَ الشَّيْبَانِيِّ عَنْ يُسَيْرِ بْنِ عَمْرٍو قَالَدَخَلْتُ عَلَى سَهْلِ بْنِ حُنَيْفٍ فَقُلْتُ حَدِّثْنِي مَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْحَرُورِيَّةِ قَالَ أُحَدِّثُكَ مَا سَمِعْتُ لَا أَزِيدُكَ عَلَيْهِ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ قَوْمًا يَخْرُجُونَ مِنْ هَاهُنَا وَأَشَارَ بِيَدِهِ نَحْوَ الْعِرَاقِ يَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ حَنَاجِرَهُمْ يَمْرُقُونَ مِنْ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنْ الرَّمِيَّةِقُلْتُ هَلْ ذَكَرَ لَهُمْ عَلَامَةً قَالَ هَذَا مَا سَمِعْتُ لَا أَزِيدُكَ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Abu Nadlr] berkata; telah menceritakan kepada kami [Hizam bin Isma'il Al 'Amiri] dari [Abu Ishaq As-Syaibani] dari [Yusair bin 'Amr] berkata; saya menemui [Sahal bin Hunaif], lalu saya berkata; ceritakan kepadaku apa yang kau dengar dari Rasulullah Shallallahu'alaihiwasallam tentang Al Haruriyyah?. Dia berkata; akan saya sampaikan kepadamu apa yang saya dengar, saya tidak menambah-nambahi. Saya mendengar Rasulullah Shallallahu'alaihiwasallam menyebutkan suatu kaum, yang akan keluar dari tempat itu, dia menunjukkan dengan tangannya ke arah Iraq, mereka membaca alqur'an namun tidak sampai tenggorokan mereka, mereka meninggalkan agama sebagaimana anak panah meninggalkan busurnya. Saya berkata; apa beliau menyebutkan kepada mereka tanda-tandanya?. Dia menjawab, ini yang saya dengar, saya tidak menambahi sedikitpun. "
            },
            {
                "number": 786,
                "arab": "قَالَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ وَعَفَّانُ قَالَا حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ قَالَ حَدَّثَتْنِي جَدَّتِي الرَّبَابُ وَقَالَ يُونُسُ فِي حَدِيثِهِ قَالَتْ سَمِعْتُ سَهْلَ بْنَ حُنَيْفٍ يَقُولُمَرَرْنَا بِسَيْلٍ فَدَخَلْتُ فَاغْتَسَلْتُ مِنْهُ فَخَرَجْتُ مَحْمُومًا فَنُمِيَ ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مُرُوا أَبَا ثَابِتٍ يَتَعَوَّذُ قُلْتُ يَا سَيِّدِي وَالرُّقَى صَالِحَةٌ قَالَ لَا رُقْيَةَ إِلَّا فِي نَفْسٍ أَوْ حُمَةٍ أَوْ لَدْغَةٍ قَالَ عَفَّانُ النَّظْرَةُ وَاللَّدْغَةُ وَالْحُمَةُ",
                "id": "Telah menceritakan kepada kami [Yunus bin Muhammad] dan ['Affan] berkata; telah menceritakan kepada kami [Abdul Wahid] yaitu Ibnu Ziyad, berkata; telah menceritakan kepada kami ['Utsman bin Hakim] berkata; telah menceritakan kepadaku [nenekku, Ar-Rabab] dan [Yunus] berkata; dalam hadisnya, (Ar-Rabab Radliyallahu'anha) berkata; saya mendengar [Sahal bin Hunaif] berkata; \"Kami melewati aliran air, lalu saya menceburkan diri, mandi. Ketika saya keluar dari air, aku merasakan demam. Kejadian tersebut dilaporkan kepada Rasulullah Shallallahu'alaihiwasallam. Beliau bersabda: \"Suruhlah Abu Tsabit untuk berlindung diri dengan doa\", Lalu saya berkata; \"Wahai baginda, apakah dengan membaca doa (ruqyah) boleh? Beliau bersabda: \"Tidak ada Ruqyah, kecuali karena pandangan mata jahat, badan yang terkena racun ataupun sengatan\". 'Affan mengatakan; karena pandangan mata jahat, sengatan, atau racun."
            },
            {
                "number": 787,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا أَبُو أُوَيْسٍ حَدَّثَنَا الزُّهْرِيُّ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ أَنَّ أَبَاهُ حَدَّثَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ وَسَارُوا مَعَهُ نَحْوَ مَكَّةَ حَتَّى إِذَا كَانُوا بِشِعْبِ الْخَزَّارِ مِنْ الْجُحْفَةِ اغْتَسَلَ سَهْلُ بْنُ حُنَيْفٍ وَكَانَ رَجُلًا أَبْيَضَ حَسَنَ الْجِسْمِ وَالْجِلْدِ فَنَظَرَ إِلَيْهِ عَامِرُ بْنُ رَبِيعَةَ أَخُو بَنِي عَدِيِّ بْنِ كَعْبٍ وَهُوَ يَغْتَسِلُ فَقَالَ مَا رَأَيْتُ كَالْيَوْمِ وَلَا جِلْدَ مُخَبَّأَةٍ فَلُبِطَ سَهْلٌ فَأُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ هَلْ لَكَ فِي سَهْلٍ وَاللَّهِ مَا يَرْفَعُ رَأْسَهُ وَمَا يُفِيقُ قَالَ هَلْ تَتَّهِمُونَ فِيهِ مِنْ أَحَدٍ قَالُوا نَظَرَ إِلَيْهِ عَامِرُ بْنُ رَبِيعَةَ فَدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامِرًا فَتَغَيَّظَ عَلَيْهِ وَقَالَ عَلَامَ يَقْتُلُ أَحَدُكُمْ أَخَاهُ هَلَّا إِذَا رَأَيْتَ مَا يُعْجِبُكَ بَرَّكْتَ ثُمَّ قَالَ لَهُ اغْتَسِلْ لَهُ فَغَسَلَ وَجْهَهُ وَيَدَيْهِ وَمِرْفَقَيْهِ وَرُكْبَتَيْهِ وَأَطْرَافَ رِجْلَيْهِ وَدَاخِلَةَ إِزَارِهِ فِي قَدَحٍ ثُمَّ صُبَّ ذَلِكَ الْمَاءُ عَلَيْهِ يَصُبُّهُ رَجُلٌ عَلَى رَأْسِهِ وَظَهْرِهِ مِنْ خَلْفِهِ يُكْفِئُ الْقَدَحَ وَرَاءَهُ فَفَعَلَ بِهِ ذَلِكَ فَرَاحَ سَهْلٌ مَعَ النَّاسِ لَيْسَ بِهِ بَأْسٌ",
                "id": "Telah menceritakan kepada kami [Husain bin Muhammad] berkata; telah menceritakan kepada kami [Abu Uwais] telah menceritakan kepada kami [Az Zuhri] dari [Abu Umamah bin Sahal bin Hunaif], [bapaknya] menceritakan kepadanya, Rasulullah Shallallahu'alaihiwasallam keluar melakukan perjalanan bersama para sahabat menuju Makkah. Ketika mereka sampai pada suatu daerah pegunungan di daerah Juhfah, Sahal bin Hunaif mandi, dia adalah seorang yang berperawakan putih wajah dan kulitnya. Lalu 'Amir bin Rabi'ah-saudara bani Ady bin Kaab- melihatnya, dia juga dalam sedang mandi. 'Amir bin Rabi'ah berkata; \"Belum pernah aku melihat seperti hari ini, dan juga tidak kulit yang begitu putih\". Seketika itu juga, terjatuhlah Sahal, Sahal kontan digotong kepada Rasulullah Shallallahu'alaihiwasallam dan dikatakan kepada beliau, \"Wahai Rasulullah, apakah engkau mengetahui apa yang terjadi dengan Sahal?\", demi Allah, Sahal tidak dapat mengangkat kepalanya dan tidak sadar. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Mungkin kalian bisa menebak seseorang dalam kasus ini\". Mereka berkata; 'Amir bin Rabi'ah tertegun melihat Sahal. Rasulullah Shallallahu'alaihiwasallam kontan memanggil 'Amir dengan agak marah, lalu bersabda: \"Atas dasar apa di antara kalian membunuh saudaranya, jika di antara kalian melihat sesuatu yang membuat terkagum, mintalah Allah agar memberkahinya\". Lalu bersabda: \"Mandikanlah\", lalu 'Amir bin Rabi'ah membasuh wajahnya, kedua tangannya, kedua sikutnya, pergelangan kaki dan ujung kakinya serta menyiram apa yang ada pada sarungnya dengan gayung, lalu memercikinya dengan air itu. Ada seorang laki-laki memercikan air ke kepala dan punggungnya dari belakang, sehingga habislah air dalam bejana, setelah itu Sahal istirahat bersama yang lain dan tidak terjadi apa-apa dengannya."
            },
            {
                "number": 788,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى حَدَّثَنِي مُجَمِّعُ بْنُ يَعْقُوبَ الْأَنْصَارِيُّ بِقُبَاءٍ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ الْكَرْمَانِيِّ قَالَ سَمِعْتُ أَبَا أُمَامَةَ بْنَ سَهْلِ بْنِ حُنَيْفٍ يَقُولُ قَالَ أَبِيقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ خَرَجَ حَتَّى يَأْتِيَ هَذَا الْمَسْجِدَ يَعْنِي مَسْجِدَ قُبَاءٍ فَيُصَلِّيَ فِيهِ كَانَ كَعَدْلِ عُمْرَةٍحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا مُجَمِّعُ بْنُ يَعْقُوبَ الْأَنْصَارِيُّ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ الْكَرْمَانِيِّ قَالَ سَمِعْتُ أَبَا أُمَامَةَ بْنَ سَهْلِ بْنِ حُنَيْفٍ فَذَكَرَ مِثْلَهُ قَالَ حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ قَالَ حَدَّثَنَا حَاتِمٌ حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْكَرْمَانِيُّ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin 'Isa] telah menceritakan kepadaku [Mujami' bin Ya'qub Al Anshari] di Quba', berkata; telah menceritakan kepadaku [Muhammad bin Al Karmany] berkata; saya mendengar [Abu Umamah bin Sahal bin Hunaif] berkata; [bapakku] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Barangsiapa keluar dan datang ke masjid ini (yaitu masjid Quba') lalu sholat di dalamnya, maka menyamai pahala umrah\". Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata; telah menceritakan kepada kami [Mujammi' bin Ya'qub Al Anshory] dari [Muhammad bin Sulaiman Al Karmany] berkata; saya mendengar [Abu Umamah bin Sahal bin Hunaif], lalu menyebutkan sebagaimana dalam hadis. (Ahmad bin Hanbal) berkata; telah menceritakan kepada kami ['Ali bin Bahr] berkata; telah menceritakan kepada kami [Hatim] telah menceritakan kepada kami [Muhammad bin Sulaiman Al Karmany] lalu menyebutkan secara makna."
            },
            {
                "number": 789,
                "arab": "قَالَ حَدَّثَنَا رَوْحٌ وَعَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ حَدَّثَنِي عَبْدُ الْكَرِيمِ بْنُ أَبِي الْمُخَارِقِ أَنَّ الْوَلِيدَ بْنَ مَالِكِ بْنِ عَبْدِ الْقَيْسِ أَخْبَرَهُ وَقَالَ عَبْدُ الرَّزَّاقِ مِنْ عَبْدِ الْقَيْسِ أَنَّ مُحَمَّدَ بْنَ قَيْسٍ أَخْبَرَهُ أَنَّ سَهْلًا أَخْبَرَهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَهُ قَالَ أَنْتَ رَسُولِي إِلَى أَهْلِ مَكَّةَ قُلْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْسَلَنِي يَقْرَأُ عَلَيْكُمْ السَّلَامَ وَيَأْمُرُكُمْ بِثَلَاثٍ لَا تَحْلِفُوا بِغَيْرِ اللَّهِ وَإِذَا تَخَلَّيْتُمْ فَلَا تَسْتَقْبِلُوا الْقِبْلَةَ وَلَا تَسْتَدْبِرُوهَا وَلَا تَسْتَنْجُوا بِعَظْمٍ وَلَا بِبَعْرَةٍ",
                "id": "Telah menceritakan kepada kami [Rouh] dan [Abdurrozaq] berkata; telah mengabarkan kepada kami [Muhammad bin Qais] telah mengabarkan kepada kami [Ibnu Juraij] berkata; telah menceritakan kepadaku [Abdul Karim bin Abu Al Muhariq] [Al Walid bin Malik bin Abdul Qais] mengabarinya. Dan [Abdurrazzaq] berkata; dari Abdul Qais [Muhammad bin Qais] mengabarinya [Sahal] mengabarinya, Nabi Shallallahu'alaihiwasallam mengutusnya dan bersabda: \"Engkau adalah utusanku kepada penduduk Makkah, katakan, Rasulullah Shallallahu'alaihiwasallam telah mengutusku untuk menyampaikan salam dan menyuruh kalian tiga hal yaitu: Janganlah kalian bersumpah dengan selain Allah. Jika kalian menunaikan hajatnya, janganlah menghadap atau membelakangi kiblat. Janganlah bercebok menggunakan tulang ataupun bekas kotoran unta\"."
            },
            {
                "number": 790,
                "arab": "قَالَ حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ قَالَ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ عَبْدِ اللَّهِ بْنِ سَهْلِ بْنِ حُنَيْفٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَعَانَ مُجَاهِدًا فِي سَبِيلِ اللَّهِ أَوْ غَارِمًا فِي عُسْرَتِهِ أَوْ مُكَاتَبًا فِي رَقَبَتِهِ أَظَلَّهُ اللَّهُ فِي ظِلِّهِ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ",
                "id": "Telah menceritakan kepada kami [Zakariya bin 'Adi] berkata; telah mengabarkan kepada kami ['ubaidhullah bin 'Amr] dari [Abdullah bin Muhammad bin 'Aqil] dari [Abdullah bin Suhail bin Hunaif] dari [bapaknya] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Barangsiapa menolong seorang mujahid di jalan Allah atau orang yang terlilit hutang dalam kesulitan yang dia hadapi atau budak (yang telah dijanjikan merdeka oleh tuannya) dalam tanggungannya, Allah menaunginya dalam naungAn Nya pada hari ketika tidak ada naungan selain naungAn Nya\""
            },
            {
                "number": 791,
                "arab": "قَالَ حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ قَالَ حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ عَبْدِ اللَّهِ بْنِ سَهْلِ بْنِ حُنَيْفٍ أَنَّ سَهْلًا حَدَّثَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَعَانَ مُجَاهِدًا فِي سَبِيلِ اللَّهِ أَوْ غَارِمًا فِي عُسْرَتِهِ أَوْ مُكَاتَبًا فِي رَقَبَتِهِ أَظَلَّهُ اللَّهُ فِي ظِلِّهِ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] berkata; telah menceritakan kepada kami [Zuhair bin Muhammad] berkata; telah menceritakan kepada kami [Abdullah bin Muhammad bin 'Aqil] dari [Abdullah bin Sahl bin Hunaif] bahwa [Sahl] menceritakannya, Rasulullah Shallallahu'alaihiwasallam bersabda: \"Barangsiapa menolong seorang mujahid di jalan Allah atau orang yang terlilit hutang dalam kesulitan yang dia hadapi atau budak (yang dijanjikan merdeka oleh tuannya) dalam tanggungannya, Allah menaunginya dalam naungAn Nya pada hari ketika tidak ada naungan selain naungAn Nya\""
            },
            {
                "number": 792,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ قَالَ حَدَّثَنِي أَبِي حَدَّثَنَا دَاوُدُ يَعْنِي ابْنَ أَبِي هِنْدٍ عَنْ أَبِي حَرْبٍ أَنَّ طَلْحَةَ حَدَّثَهُ وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَأَتَيْتُ الْمَدِينَةَ وَلَيْسَ لِي بِهَا مَعْرِفَةٌ فَنَزَلْتُ فِي الصُّفَّةِ مَعَ رَجُلٍ فَكَانَ بَيْنِي وَبَيْنَهُ كُلَّ يَوْمٍ مُدٌّ مِنْ تَمْرٍ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ فَلَمَّا انْصَرَفَ قَالَ رَجُلٌ مِنْ أَصْحَابِ الصُّفَّةِ يَا رَسُولَ اللَّهِ أَحْرَقَ بُطُونَنَا التَّمْرُ وَتَخَرَّقَتْ عَنَّا الْخُنُفُ فَصَعِدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَطَبَ ثُمَّ قَالَ وَاللَّهِ لَوْ وَجَدْتُ خُبْزًا أَوْ لَحْمًا لَأَطْعَمْتُكُمُوهُ أَمَا إِنَّكُمْ تُوشِكُونَ أَنْ تُدْرِكُوا وَمَنْ أَدْرَكَ ذَلِكَ مِنْكُمْ أَنْ يُرَاحَ عَلَيْكُمْ بِالْجِفَانِ وَتَلْبَسُونَ مِثْلَ أَسْتَارِ الْكَعْبَةِ قَالَ فَمَكَثْتُ أَنَا وَصَاحِبِي ثَمَانِيَةَ عَشَرَ يَوْمًا وَلَيْلَةً مَا لَنَا طَعَامٌ إِلَّا الْبَرِيرَ حَتَّى جِئْنَا إِلَى إِخْوَانِنَا مِنْ الْأَنْصَارِ فَوَاسَوْنَا وَكَانَ خَيْرَ مَا أَصَبْنَا هَذَا التَّمْرُ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Abdusshamad bin Al Abdul Warits] berkata; telah bercerita kepadsaya [bapakku] telah menceritakan kepada kami [Daud] yaitu Ibnu Abu Hind, dari [Abu Harb] [Thalhah] menceritakannya, dia termasuk dari kalangan sahabat, berkata; saya datang ke Madinah dalam keadaan buta tentang seluk beluk kota itu, maka saya singgah di Suffah bersama seorang laki-laki, saya dan dia saban hari mendapat jatah satu mud kurma. Suatu hari Rasulullah Shallallahu'alaihiwasallam melaksanakan sholat, ketika sudah selesai, ada seorang laki-laki Ahli Shuffah berkata; \"Wahai Rasulullah, kurma telah membakar perut kami, dan pakaian jelek ini telah sedemikian compang camping\". Rasulullah Shallallahu'alaihiwasallam naik ke mimbar lalu berkhutbah, lalu bersabda: \"Demi Allah, kalaulah saya mendapatkan roti atau daging, pastilah saya berikan untuk kalian. Tak lama lagi kalian mendapatkannya. Siapa di antara kalian menjumpainya, niscaya ada yang diberi piring besar, atau kalian memakai pakaian seperti penutup Ka'bah.\" (Thalhah radliyallhu'anhu) berkata; lalu saya dan saudaraku tinggal selama delapan belas hari, kami tidak mendapatkan makanan kecuali barir (buah arak yang telah hitam dan rusak) sampai saya datang kepada saudara kami dari Anshar, dan dia membantu kami, kurma itulah makanan paling baik yang kami dapati. "
            },
            {
                "number": 793,
                "arab": "قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الرَّازِيُّ قَالَ حَدَّثَنَا سَلَمَةُ بْنُ الْفَضْلِ الْأَنْصَارِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ قَالَ حَدَّثَنِي سَعْدُ بْنُ طَارِقٍ الْأَشْجَعِيُّ وَهُوَ أَبُو مَالِكٍ عَنْ سَلَمَةَ بْنِ نُعَيْمِ بْنِ مَسْعُودٍ الْأَشْجَعِيِّ عَنْ أَبِيهِ نُعَيْمٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ حِينَ قَرَأَ كِتَابَ مُسَيْلِمَةَ الْكَذَّابِ قَالَ لِلرَّسُولَيْنِ فَمَا تَقُولَانِ أَنْتُمَا قَالَا نَقُولُ كَمَا قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاللَّهِ لَوْلَا أَنَّ الرُّسُلَ لَا تُقْتَلُ لَضَرَبْتُ أَعْنَاقَكُمَا",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim Ar-Razi] berkata; telah menceritakan kepada kami [Salamah bin Al Fadl Al Anshari] berkata; telah menceritakan kepada kami [Muhammad bin Ishaq] berkata; telah menceritakan kepadaku [Sa'ad bin Thariq Al Asyja'i] yaitu Abu Malik, dari [Salamah bin Nu'aim bin Mas'ud Al Asyja'i] dari [Bapaknya, Nu'aim] berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam ketika membaca surat Musailamah Al Kadzab, beliau bertanya dua orang utusannya, \"Apa yang kalian komentari tentang suratnya?\" (mereka berdua) berkata; Kami sependapat dengan dia (Musailamah). Rasulullah Shallallahu'alaihiwasallam bersabda: \"Demi Allah, kalaulah bukan karena pertimbangan seorang utusan tidak boleh dibunuh, pasti saya potong leher kalian berdua\"."
            },
            {
                "number": 794,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ الْأَنْصَارِيِّ قَالَ حَدَّثَنِي بُشَيْرُ بْنُ يَسَارٍ عَنْ سُوَيْدِ بْنِ النُّعْمَانِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَزَلَ بِالصَّهْبَاءِ عَامَ خَيْبَرَ فَلَمَّا صَلَّى الْعَصْرَ دَعَا بِالْأَطْعِمَةِ فَلَمْ يُؤْتَ إِلَّا بِسَوِيقٍ قَالَ فَلُكْنَا يَعْنِي أَكَلْنَا مِنْهُ فَلَمَّا كَانَتْ الْمَغْرِبُ تَمَضْمَضَ وَتَمَضْمَضْنَا مَعَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Yahya bin Sa'id Al Anshori] berkata; telah menceritakan kepadaku [Busyair bin Yasar] dari [Suwaid bin An Nu'man] Rasulullah Shallallahu'alaihiwasallam singgah di Shahba' pada tahun terjadinya Perang Khaibar. Selesai beliau sholat asar, beliau meminta makanan, namun tidak di suguhkan kecuali hanya sawiq (makanan yang terbuat dari tepung gandum). (Suwaid bin An Nu'man) berkata; Lalu kami memakannya, pada saat maghrib, beliau berkumur-kumur saja dan juga kami."
            },
            {
                "number": 795,
                "arab": "قَالَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنِي مُوسَى بْنُ عُقْبَةَ قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنِ الْأَقْرَعِ بْنِ حَابِسٍأَنَّهُ نَادَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ وَرَاءِ الْحُجُرَاتِ فَقَالَ يَا رَسُولَ اللَّهِ فَلَمْ يُجِبْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَلَا إِنَّ حَمْدِي زَيْنٌ وَإِنَّ ذَمِّي شَيْنٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا حَدَّثَ أَبُو سَلَمَةَ ذَاكَ اللَّهُ عَزَّ وَجَلَّ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Wuhaib] berkata; telah menceritakan kepadaku [Musa bin 'Utbah] berkata; telah menceritakan kepadaku [Abu Salamah bin Abdurrahman] dari [Al Aqro' bin Habis] dia memanggil Rasulullah Shallallahu'alaihiwasallam dari belakang kamar, \"Wahai Rasulullah\", Rasulullah Shallallahu'alaihiwasallam tidak menjawabnya. Lalu dia mengulangi kembali, \"Wahai Rasulullah, bukankah pujianku adalah perhiasan dan keburukan amalku adalah aib\". Rasulullah Shallallahu'alaihiwasallam bersabda: sebagaimana Abu Salamah menceritakan, \"Itu adalah Allah Azzawajalla\"."
            },
            {
                "number": 796,
                "arab": "قَالَ حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو قَالَ حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي الزِّنَادِ قَالَ حَدَّثَنِي الْمُرَقِّعُ بْنُ صَيْفِيٍّ عَنْ جَدِّهِ رَبَاحِ بْنِ الرَّبِيعِ أَخِي حَنْظَلَةَ الْكَاتِبِ أَنَّهُ أَخْبَرَهُأَنَّهُ خَرَجَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةٍ غَزَاهَا وَعَلَى مُقَدِّمَتِهِ خَالِدُ بْنُ الْوَلِيدِ فَمَرَّ رَبَاحٌ وَأَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى امْرَأَةٍ مَقْتُولَةٍ مِمَّا أَصَابَتْ الْمُقَدِّمَةُ فَوَقَفُوا يَنْظُرُونَ إِلَيْهَا وَيَتَعَجَّبُونَ مِنْ خَلْقِهَا حَتَّى لَحِقَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رَاحِلَتِهِ فَانْفَرَجُوا عَنْهَا فَوَقَفَ عَلَيْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا كَانَتْ هَذِهِ لِتُقَاتِلَ فَقَالَ لِأَحَدِهِمْ الْحَقْ خَالِدًا فَقُلْ لَهُ لَا تَقْتُلُونَ ذُرِّيَّةً وَلَا عَسِيفًاقَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْعَبَّاسِ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ عَنْ أَبِي الزِّنَادِ قَالَ أَخْبَرَنِي الْمُرَقِّعُ بْنُ صَيْفِيِّ بْنِ رَبَاحٍ أَنَّ رَبَاحًا جَدَّهُ ابْنَ الرَّبِيعِ أَخْبَرَهُ أَنَّهُ كَانَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ الْحَدِيثَ حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنِ الْمُرَقِّعِ بْنِ صَيْفِيِّ بْنِ رَبَاحٍ أَخِي حَنْظَلَةَ الْكَاتِبِ قَالَ أَخْبَرَنِي جَدِّي أَنَّهُ خَرَجَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ الْحَدِيثَ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أُخْبِرْتُ عَنْ أَبِي الزِّنَادِ قَالَ أَخْبَرَنِي مُرَقِّعُ بْنُ صَيْفِيٍّ التَّمِيمِيُّ شَهِدَ عَلَى جَدِّهِ رَبَاحِ بْنِ رَبِيعٍ الْحَنْظَلِيِّ الْكَاتِبِ أَنَّهُ أَخْبَرَهُ أَنَّهُ خَرَجَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةٍ فَذَكَرَ مِثْلَ حَدِيثِ ابْنِ أَبِي الزِّنَادِ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Abu 'Amir Abdul Malik bin 'Amr] berkata; telah menceritakan kepada kami [Al Mughirah bin Abdurrohman] dari [Abu Zinad] berkata; telah menceritakan kepadaku [Al Muraqq' bin Shaifi] dari [kakeknya, Rabah bin Ar-Rabi'], saudara Handzalah seorang penulis dia mengabarinya, dia keluar bersama Rasulullah Shallallahu'alaihiwasallam dalam suatu peperangan. Di bagian depan terdapat Khalid bin Al Walid, lalu Rabah dan beberapa sahabat Rasulullah melewati seorang wanita yang terbunuh oleh pasukan yang berada di depan, maka mereka berhenti dan mengamat-amatinya serta terherAn heran. Sampai Rasulullah Shallallahu'alaihiwasallam menghampiri mereka dari atas untanya, para sahabat serentak memberi kelapangan jalan kepada beliau, dan Rasulullah Shallallahu'alaihiwasallam berdiri di atas mayat wanita itu. Lalu beliau bersabda: Kenapa wanita ini diperangi?!\" lalu beliau bersabda kepada salah seorang, susullah Khalid dan katakan padanya, jangan membunuh anak-anak dan para wanita\". (Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Ibrahim bin Abu Al 'Abbas] berkata; telah menceritakan kepada kami [Abdurrahman bin Abu Az Zinnad] dari [Abu Zinad] berkata; telah mengabarkan kepadaku [Al Muraqqi' bin Shaify bin Rabah] [Rabah, kakek Ibnu Ar-Rabi] mengabarinya, dia bersama Rasulullah Shallallahu'alaihiwasallam, lalu menyebutkan hadis secara lengkap. Telah menceritakan kepada kami [Husain bin Muhammad] berkata; telah menceritakan kepada kami [Ibnu Abu Zinnad] dari [bapaknya] dari [Al Muraqqi' bin Shaifi bin Rabah, saudara Handzalah seorang penulis] berkata; telah mengabarkan kepadaku [kakekku] dia keluar bersama Rasulullah Shallallahu'alaihiwasallam, lalu menyebutkan hadis secara sempurna. Telah menceritakan kepada kami [Abdurrazaq] berkata; telah mengabarkan kepada kami [Ibnu Juraij] berkata; saya [telah dikabari] dari [Abu Zinad] berkata; telah menceritakan kepadaku [Muraqqi' bin Ash-Shaifi At-Taimi] menyaksikan [kakeknya, Rabah bin Rabi' Al Handzaly, seorang penulis] dia mengabarinya, dia keluar bersama Rasulullah Shallallahu'alaihiwasallam dalam suatu peperangan, lalu menyebutkan seperti hadis Ibnu Abu Zinnad."
            },
            {
                "number": 797,
                "arab": "قَالَ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا الْحَكَمُ بْنُ فُضَيْلٍ حَدَّثَنَا يَعْلَى بْنُ عَطَاءٍ عَنْ عُبَيْدِ بْنِ جُبَيْرٍ عَنْ أَبِي مُوَيْهِبَةَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَأُمِرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُصَلِّيَ عَلَى أَهْلِ الْبَقِيعِ فَصَلَّى عَلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةً ثَلَاثَ مَرَّاتٍ فَلَمَّا كَانَتْ لَيْلَةُ الثَّانِيَةِ قَالَ يَا أَبَا مُوَيْهِبَةَ أَسْرِجْ لِي دَابَّتِي قَالَ فَرَكِبَ فَمَشَيْتُ حَتَّى انْتَهَى إِلَيْهِمْ فَنَزَلَ عَنْ دَابَّتِهِ وَأَمْسَكَتْ الدَّابَّةُ وَوَقَفَ عَلَيْهِمْ أَوْ قَالَ قَامَ عَلَيْهِمْ فَقَالَ لِيَهْنِيكُمْ مَا أَنْتُمْ فِيهِ مِمَّا فِيهِ النَّاسُ أَتَتْ الْفِتَنُ كَقِطَعِ اللَّيْلِ يَرْكَبُ بَعْضُهَا بَعْضًا الْآخِرَةُ أَشَدُّ مِنْ الْأُولَى فَلْيَهْنِيكُمْ مَا أَنْتُمْ فِيهِ ثُمَّ رَجَعَ فَقَالَ يَا أَبَا مُوَيْهِبَةَ إِنِّي أُعْطِيتُ أَوْ قَالَ خُيِّرْتُ مَفَاتِيحَ مَا يُفْتَحُ عَلَى أُمَّتِي مِنْ بَعْدِي وَالْجَنَّةَ أَوْ لِقَاءَ رَبِّي فَقُلْتُ بِأَبِي وَأُمِّي يَا رَسُولَ اللَّهِ فَأَخْبِرْنِي قَالَ لَأَنْ تُرَدَّ عَلَى عَقِبِهَا مَا شَاءَ اللَّهُ فَاخْتَرْتُ لِقَاءَ رَبِّي عَزَّ وَجَلَّ فَمَا لَبِثَ بَعْدَ ذَلِكَ إِلَّا سَبْعًا أَوْ ثَمَانِيًا حَتَّى قُبِضَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ أَبُو النَّضْرِ مَرَّةً تُرَدُّ عَلَى عَقِبَيْهَا",
                "id": "Telah menceritakan kepada kami [Abu Nadlr] telah menceritakan kepada kami [Al Hakam bin Fudlail] telah menceritakan kepada kami [Ya'la bin 'Atha'] dari ['Ubaid bin Jubair] dari [Abu Muwaihibah] budak Rasulullah Shallallahu'alaihiwasallam mengatakan; Rasulullah Shallallahu'alaihiwasallam diminta untuk mendoakan penghuni pekuburan Baqi', lalu Rasulullah Shallallahu'alaihiwasallam mendoakan mereka pada waktu malam sebanyak tiga kali. Pada malam kedua, beliau bersabda: \"Wahai Abu Muwaihibah, berilah pelana pada kendaraanku.\" Lalu beliau naik dan saya berjalan sehingga kami sampai ke mereka. Beliau turun dari tunggangannya setelah tunggangannya berhenti. Beliau berdiri di tengah-tengah mereka dan bersabda: \"Hendaklah kalian merasa nyaman, daripada keadaan yang dialami manusia sekarang ini. Telah datang fitnah seperti segelapAn kegelapan malam, kegelapan itu bertumpuk-tumpukan. Fitnah yang terakhir jauh lebih dahsyat daripada fitnah yang pertama, maka hendaklah kalian merasa nyaman dengan keadaanmu sekarang\", lalu beliau kembali dan bersabda: \"Wahai Abu Muwaihibah. Sesungguhnya saya telah diberi, \" atau bersabda dengan redaksi, \" Aku diberi pilihan kunci-kunci perbendaharaan duniawi yang akan dibuka untuk umatku setelahku dan surga, atau pertemuan Rabku\" Lalu saya berkata; demi bapakku dan ibuku, Wahai Rasulullah, beritahukanlah aku!. Beliau bersabda: \"Umatku akan kembali kepada kekufuran sebagaimana Allah kehendaki, sehingga saya memilih bertemu dengan Rabku\". Tidak lama setelah kejadian itu kecuali tujuh atau delapan hari, sehingga (Rasulullah) Shallallahu'alaihiwasallam wafat.\" Dan Abu Nadlr berkata; dan umatnya telah kembali kepada kekufuran."
            },
            {
                "number": 798,
                "arab": "قَالَ حَدَّثَنِي يَعْقُوبُ قَالَ حَدَّثَنِي أَبِي قَالَ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُمَرَ الْعَبْلِيُّ قَالَ حَدَّثَنِي عُبَيْدُ بْنُ جُبَيْرٍ مَوْلَى الْحَكَمِ بْنِ أَبِي الْعَاصِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ أَبِي مُوَيْهِبَةَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَبَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ جَوْفِ اللَّيْلِ فَقَالَ يَا أَبَا مُوَيْهِبَةَ إِنِّي قَدْ أُمِرْتُ أَنْ أَسْتَغْفِرَ لِأَهْلِ الْبَقِيعِ فَانْطَلِقْ مَعِي فَانْطَلَقْتُ مَعَهُ فَلَمَّا وَقَفَ بَيْنَ أَظْهُرِهِمْ قَالَ السَّلَامُ عَلَيْكُمْ يَا أَهْلَ الْمَقَابِرِ لِيَهْنِ لَكُمْ مَا أَصْبَحْتُمْ فِيهِ مِمَّا أَصْبَحَ فِيهِ النَّاسُ لَوْ تَعْلَمُونَ مَا نَجَّاكُمْ اللَّهُ مِنْهُ أَقْبَلَتْ الْفِتَنُ كَقِطَعِ اللَّيْلِ الْمُظْلِمِ يَتْبَعُ أَوَّلُهَا آخِرَهَا الْآخِرَةُ شَرٌّ مِنْ الْأُولَى قَالَ ثُمَّ أَقْبَلَ عَلَيَّ فَقَالَ يَا أَبَا مُوَيْهِبَةَ إِنِّي قَدْ أُوتِيتُ مَفَاتِيحَ خَزَائِنِ الدُّنْيَا وَالْخُلْدَ فِيهَا ثُمَّ الْجَنَّةَ وَخُيِّرْتُ بَيْنَ ذَلِكَ وَبَيْنَ لِقَاءِ رَبِّي عَزَّ وَجَلَّ وَالْجَنَّةِ قَالَ قُلْتُ بِأَبِي وَأُمِّي فَخُذْ مَفَاتِيحَ الدُّنْيَا وَالْخُلْدَ فِيهَا ثُمَّ الْجَنَّةَ قَالَ لَا وَاللَّهِ يَا أَبَا مُوَيْهِبَةَ لَقَدْ اخْتَرْتُ لِقَاءَ رَبِّي عَزَّ وَجَلَّ وَالْجَنَّةَ ثُمَّ اسْتَغْفَرَ لِأَهْلِ الْبَقِيعِ ثُمَّ انْصَرَفَ فَبُدِئَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي وَجَعِهِ الَّذِي قَضَاهُ اللَّهُ عَزَّ وَجَلَّ فِيهِ حِينَ أَصْبَحَ",
                "id": "Telah menceritakan kepada kami [Ya'qub] berkata; telah menceritakan kepadaku [bapakku] berkata; dari [Muhammad bin Ishaq] berkata; telah menceritakan kepadaku [Abdullah bin 'Umar Al 'Abla] berkata; telah menceritakan kepadaku ['Ubaid bin Jubair] budak Al Hakam bin Abu Al 'Ash, dari [Abdullah bin 'Amr] dari [Abu Muwaihibah], budak Rasulullah Shallallahu'alaihiwasallam, berkata; Rasulullah Shallallahu'alaihiwasallam mengutusku pada suatu malam yang sangat gelap, lalu beliau bersabda: \"Wahai Abu Muwaihibah? Saya diperintah untuk memintakan ampun untuk penghuni pekuburan Baqi', berangkatlah bersamaku\". Saya pun berangkat bersamanya, tatkala sudah sampai di sana, beliau bersabda: \"Semoga kesejahteraan kepada kalian wahai penghuni kubur, hendaklah kalian merasa nyaman dengan keadaanmu sekarang daripada keadaan yang dialami manusia sekarang ini. Duhai sekiranya kalian mengetahui bagaimana Allah menyelamatkan kalian. Telah datang fitnah sebagaimana bagiAn bagian malam yang sangat gelap, yang fitnah itu datang susul menyusul, dan fitnah yang terakhir jauh lebih jelek daripada yang pertama.\" (Abu Muwaihibah) berkata; lalu beliau menemui saya dan bersabda: \"Wahai Abu Muwaihibah, saya telah diberi kunci-kunci simpanAn simpanan dunia dan kekekalannya, kemudian surga. Saya di suruh memilih antara hal itu atau bertemu dengan Rabku Azzawajalla dan surga\". Lalu beliau bersabda: \"Tidak, demi Allah, Wahai Abu Muwaihibah, saya memilih bertemu dengan Rabku AzzaWaJalla dan surga', lalu beliau meminta ampunan untuk penghuni pekuburan Baqi'. Lalu beliau pergi dan mulailah sakit Rasulullah Shallallahu'alaihiwasallam yang Allah Azzawajalla tetapkan pada pagi harinya\"."
            },
            {
                "number": 799,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ مُسْلِمِ بْنِ يَسَارٍ عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ عَنْ رَاشِدِ بْنِ حُبَيْشٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى عُبَادَةَ بْنِ الصَّامِتِ يَعُودُهُ فِي مَرَضِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَعْلَمُونَ مَنْ الشَّهِيدُ مِنْ أُمَّتِي فَأَرَمَّ الْقَوْمُ فَقَالَ عُبَادَةُ سَانِدُونِي فَأَسْنَدُوهُ فَقَالَ يَا رَسُولَ اللَّهِ الصَّابِرُ الْمُحْتَسِبُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ شُهَدَاءَ أُمَّتِي إِذًا لَقَلِيلٌ الْقَتْلُ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ شَهَادَةٌ وَالطَّاعُونُ شَهَادَةٌ وَالْغَرَقُ شَهَادَةٌ وَالْبَطْنُ شَهَادَةٌ وَالنُّفَسَاءُ يَجُرُّهَا وَلَدُهَا بِسُرَرِهِ إِلَى الْجَنَّةِقَالَ وَزَادَ فِيهَا أَبُو الْعَوَّامِ سَادِنُ بَيْتِ الْمَقْدِسِ وَالْحَرْقُ وَالسَّيْلُ حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ صَاحِبٍ لَهُ عَنْ رَاشِدِ بْنِ حُبَيْشٍ عَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَاهُ يَعُودُهُ فِي مَرَضِهِ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Bakr] berkata; telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [Muslim bin Yasar] dari [Abu Al Asy'ats, Ash-Shan'ani] dari [Rasyid bin Hubais], Rasulullah Shallallahu'alaihiwasallam menemui 'Ubadah bin Shamit untuk menjenguknya ketika dia sakit. Rasulullah Shallallahu'alaihiwasallam bersabda: \"Apakah kalian tahu, siapa yang diistilahkan syahid di antara umatku?\" Semua terdiam. 'Ubadah berkata; \"Sandarkanlah saya\", mereka pun menyandarkannya. Lalu Ubadah berkata; \"Wahai Rasulullah, yang dinamakan syahid adalah orang sabar yang mengharapkan balasan dari Allah\". Rasulullah Shallallahu'alaihiwasallam bersabda: \"Kalau begitu orang yang syahid dari ummatku sangat sedikit, padahal orang yang terbunuh di jalan Allah Azzawajalla adalah syahid, orang yang mati terkena Thaun adalah syahid, orang mati tenggelam adalah syahid, orang yang mati karena sakit perut adalah syahid, wanita yang meninggal karena melahirkan anaknya, anaknya menariknya dengan tali pusar untuk masuk ke surga\". [Abu Al 'Awwam], pengurus Baitul Maqdis menambahnya, \"Orang yang mati karena terbakar, dan yang mati karena terseret sungai\" Telah menceritakan kepada kami [Abdusshamad] telah menceritakan kepada kami [Hammad] dari [Qatadah] dari [temannya] dari [Rasyid bin Hubais] dari ['Ubadah bin Shamit] Rasulullah Shallallahu'alaihiwasallam menjenguknya waktu sakitnya, lalu menyebut hadis."
            },
            {
                "number": 800,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ عَمَّارِ بْنِ أَبِي عَمَّارٍ عَنْ أَبِي حَبَّةَ الْبَدْرِيِّ قَالَلَمَّا نَزَلَتْ لَمْ يَكُنْ قَالَ جِبْرِيلُ عَلَيْهِ السَّلَام يَا مُحَمَّدُ إِنَّ رَبَّكَ يَأْمُرُكَ أَنْ تُقْرِئَ هَذِهِ السُّورَةَ أُبَيَّ بْنَ كَعْبٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أُبَيُّ إِنَّ رَبِّي عَزَّ وَجَلَّ أَمَرَنِي أَنْ أُقْرِئَكَ هَذِهِ السُّورَةَ فَبَكَى وَقَالَ ذُكِرْتُ ثَمَّةَ قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id] budak Bani Hasyim, berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari ['Ali bin Zaid] dari ['Amar bin Abu Amar] dari [Abu Habbah Al Badry] berkata; Ketika turun ayat, LAM YAKUN (Al Bayyinah), Jibril Alaihissalam berkata; \"Wahai Muhammad, Rab-mu menyuruhmu untuk membacakan surat ini kepada Ubay bin Ka'ab\". Nabi Shallallahu'alaihiwasallam kontan bersabda: \"Wahai Ubay Rabbi-ku AzzaWaJalla menyuruhku untuk membacakan surat ini kepadamu\", maka (Ubbay) menangis dan berkata; Apakah namaku disebut-sebut di sana\"? (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Ya\"."
            },
            {
                "number": 801,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا عَلِيُّ بْنُ زَيْدٍ عَنْ عَمَّارِ بْنِ أَبِي عَمَّارٍ قَالَ سَمِعْتُ أَبَا حَبَّةَ الْبَدْرِيَّ قَالَلَمَّا نَزَلَتْ لَمْ يَكُنْ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ إِلَى آخِرِهَا قَالَ جِبْرِيلُ عَلَيْهِ السَّلَام يَا رَسُولَ اللَّهِ إِنَّ رَبَّكَ يَأْمُرُكَ أَنْ تُقْرِئَهَا أُبَيًّا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُبَيٍّ إِنَّ جِبْرِيلَ عَلَيْهِ السَّلَام أَمَرَنِي أَنْ أُقْرِئَكَ هَذِهِ السُّورَةَ قَالَ أُبَيٌّ وَقَدْ ذُكِرْتُ ثَمَّ يَا رَسُولَ اللَّهِ قَالَ نَعَمْ قَالَ فَبَكَى أُبَيٌّ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] telah mengabarkan kepada kami ['Ali bin Zaid] dari ['Amar bin Abu Amar] berkata; saya mendengar [Abu Habbah Al Badry] berkata; Ketika turun ayat LAMYAKUNIL LADZINA KAFARU MIN AHLIL KITABI, sampai akhir, Jibril 'alaihissalam berkata; \"Wahai Rasulullah, Rab-mu menyuruhmu untuk membacakannya kepada Ubbay\". Lalu Nabi Shallallahu'alaihiwasallam bersabda kepada Ubay 'Jibril 'alaihissalam menyuruhku untuk membacakan surat ini kepadamu\", maka Ubay berkata; Apakah namaku disebut-sebut di sana Wahai Rasulullah?. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Ya\". Lalu Ubay menangis."
            },
            {
                "number": 802,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا مَعْرُوفٌ يَعْنِي ابْنَ وَاصِلٍ قَالَ حَدَّثَتْنِي حَفْصَةُ ابْنَةُ طَلْقٍ امْرَأَةٌ مِنْ الْحَيِّ سَنَةَ تِسْعِينَ عَنْ أَبِي عُمَيْرَةَ قَالَكُنَّا جُلُوسًا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا فَجَاءَ رَجُلٌ بِطَبَقٍ عَلَيْهِ تَمْرٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا هَذَا أَصَدَقَةٌ أَمْ هَدِيَّةٌ قَالَ صَدَقَةٌ قَالَ فَقَدِّمْهُ إِلَى الْقَوْمِ وَحَسَنٌ صَلَوَاتُ اللَّهِ وَسَلَامُهُ عَلَيْهِ يَتَعَفَّرُ بَيْنَ يَدَيْهِ فَأَخَذَ الصَّبِيُّ تَمْرَةً فَجَعَلَهَا فِي فِيهِ فَأَدْخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُصْبُعَهُ فِي فِي الصَّبِيِّ فَنَزَعَ التَّمْرَةَ فَقَذَفَ بِهَا ثُمَّ قَالَ إِنَّا آلَ مُحَمَّدٍ لَا تَحِلُّ لَنَا الصَّدَقَةُفَقُلْتُ لِمَعْرُوفٍ أَبُو عُمَيْرٍ جَدُّكَ قَالَ جَدُّ أَبِي قَالَ حَدَّثَنَا حَسَنُ بْنُ مُوسَى قَالَ حَدَّثَنَا مَعْرُوفٌ عَنْ حَفْصَةَ بِنْتِ طَلْقٍ عَنْ أَبِي عَمِيرَةَ أُسَيْدِ بْنِ مَالِكٍ جَدِّ مَعْرُوفٍ قَالَ كُنَّا جُلُوسًا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Adam] telah menceritakan kepada kami [Ma'ruf] yaitu Ibnu Wasil, berkata; telah menceritakan kepadaku [Hafshah], anak Thalq, seorang wanita dari suatu desa tahun sembilan puluh, dari [Abu 'Umairah] berkata; kami sedang duduk di samping Rasulullah Shallallahu'alaihiwasallam pada suatu hari, selanjutnya seorang laki-laki membawa periuk berisi kurma. Rasulullah Shallallahu'alaihiwasallam bersabda: \"Apakah ini sedekah ataukah hadiah?\" laki-laki tersebut menjawab, \"Itu adalah sedekah\". beliau bersabda: \"Berikanlah untuk orang-orang\". Lantas Hasan memasukkan jarinya, mengambil kurma lalu meletakkanya di mulutnya. Kontan Nabi Shallallahu'alaihiwasallam memasukkan jarinya pada mulut bayi dan mengeluarkan kurma dan membuangnya. Beliau bersabda: \"Sesungguhnya keluarga Muhammad, tidak halal sedekah bagi kita\". Saya berkata kepada Ma'ruf bahwa Abu 'Umair adalah kakekmu, maka (Ma'ruf) berkata; dia adalah kakek bapakku. (Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Hasan bin Musa] berkata; telah menceritakan kepada kami [Ma'ruf] dari [Hafshah binti Thalq] dari [Abu 'Amirah, Usaid bin Malik, kakek Ma'ruf] berkata; kami sedang duduk bersama Rasulullah Shallallahu'alaihiwasallam, lalu menyebutkan hadisnya secara lengkap"
            },
            {
                "number": 803,
                "arab": "قَالَ حَدَّثَنَا هَيْثَمُ بْنُ خَارِجَةَ قَالَ أَخْبَرَنَا أَبُو عَبْدِ الْمَلِكِ الْحَسَنُ بْنُ يَحْيَى الْخُشَنِيُّ عَنْ بِشْرِ بْنِ حَيَّانَ قَالَجَاءَ وَاثِلَةُ بْنُ الْأَسْقَعِ وَنَحْنُ نَبْنِي مَسْجِدَنَا قَالَ فَوَقَفَ عَلَيْنَا فَسَلَّمَ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ بَنَى مَسْجِدًا يُصَلَّى فِيهِ بَنَى اللَّهُ عَزَّ وَجَلَّ لَهُ فِي الْجَنَّةِ أَفْضَلَ مِنْهُقَالَ أَبُو عَبْد الرَّحْمَنِ وَقَدْ سَمِعْتُهُ مِنْ هَيْثَمِ بْنِ خَارِجَةَ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Hutsaim bin Kharijah] berkata; telah mengabarkan kepada kami [Abu Abdul Malik Al Hasan bin Yahya Al Khusyni] dari [Bisyr bin Hayyan] berkata; [Watsilah bin Al Asyqa'] datang ketika kami membangun masjid kami. Dia berdiri dan mengucapkan salam kepada kami, dan berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Barangsiapa membangun masjid dan digunakan untuk sholat, Allah Azzawajalla membangunkan sesuatu yang jauh lebih baik baginya di surga\". Abu Abdurrahman berkata demikian dan saya juga mendengarnya dari Haitsam bin Kharijah."
            },
            {
                "number": 804,
                "arab": "قَالَ حَدَّثَنَا عَتَّابٌ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ قَالَ أَخْبَرَنَا ابْنُ لَهِيعَةَ قَالَ حَدَّثَنِي يَزِيدُ يَعْنِي ابْنَ أَبِي حَبِيبٍ أَنَّ رَبِيعَةَ بْنَ يَزِيدَ الدِّمَشْقِيَّ أَخْبَرَهُ عَنْ وَاثِلَةَ يَعْنِي ابْنَ الْأَسْقَعِ قَالَكُنْتُ مِنْ أَهْلِ الصُّفَّةِ فَدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا بِقُرْصٍ فَكَسَرَهُ فِي الْقَصْعَةِ وَصَنَعَ فِيهَا مَاءً سُخْنًا ثُمَّ صَنَعَ فِيهَا وَدَكًا ثُمَّ سَفْسَفَهَا ثُمَّ لَبَّقَهَا ثُمَّ صَعْنَبَهَا ثُمَّ قَالَ اذْهَبْ فَأْتِنِي بِعَشَرَةٍ أَنْتَ عَاشِرُهُمْ فَجِئْتُ بِهِمْ فَقَالَ كُلُوا وَكُلُوا مِنْ أَسْفَلِهَا وَلَا تَأْكُلُوا مِنْ أَعْلَاهَا فَإِنَّ الْبَرَكَةَ تَنْزِلُ مِنْ أَعْلَاهَا فَأَكَلُوا مِنْهَا حَتَّى شَبِعُوا",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami ['Attab] berkata; telah menceritakan kepada kami [Abdullah bin Al Mubarak] berkata; telah mengabarkan kepada kami [Ibnu Lahi'ah] berkata; telah menceritakan kepadaku [Yazid] yaitu Ibnu Abu Habib, [Rabi'ah bin Yazid Ad-Dimasyki] mengabarinya, dari [Watsilah] yaitu Ibnu Al Asyqa', saya termasuk dari Ahli Shuffah, pada suatu hari Rasulullah Shallallahu'alaihiwasallam memanggil-manggil dengan membawa roti yang berbentuk bulat pipih, lantas beliau memecahnya dalam bejana yang berisi air hangat. Beliau buat bubur roti dalam bejana tersebut, beliau saring dengan saringan, dan beliau campur sedemikian rupa, kemudian beliau bersabda: \"Undanglah sepuluh orang, sekaligus kamu\". Saya membawa mereka, lalu beliau bersabda: \"Makanlah, makanlah kalian dari bawahnya dan jangan kalian makan dari atasnya, sebab keberkahan itu turun dari atas\" lalu mereka memakannya sampai kenyang."
            },
            {
                "number": 805,
                "arab": "قَالَ حَدَّثَنَا إِسْمَاعِيلُ قَالَ حَدَّثَنَا لَيْثٌ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مَلِيحِ بْنِ أُسَامَةَ عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمِرْتُ بِالسِّوَاكِ حَتَّى خَشِيتُ أَنْ يُكْتَبَ عَلَيَّ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Isma'il] berkata; telah menceritakan kepada kami [Laits] dari [Abu Burdah] dari [Abu Mulaih bin Usamah] dari [Watsilah bin Al Ayqa'] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Saya diperintah untuk bersiwak hingga saya khawatir jangAn jangan hal itu diwajibkan atasku\""
            },
            {
                "number": 806,
                "arab": "قَالَ حَدَّثَنَا هَاشِمٌ قَالَ حَدَّثَنَا أَبُو فَضَالَةَ الْفَرَجُ قَالَ حَدَّثَنَا أَبُو سَعْدٍ قَالَرَأَيْتُ وَاثِلَةَ بْنَ الْأَسْقَعِ يُصَلِّي فِي مَسْجِدِ دِمَشْقَ فَبَزَقَ تَحْتَ رِجْلِهِ الْيُسْرَى ثُمَّ عَرَكَهَا بِرِجْلِهِ فَلَمَّا انْصَرَفَ قُلْتُ أَنْتَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَبْزُقُ فِي الْمَسْجِدِ قَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Hasyim] berkata; telah menceritakan kepada kami [Abu Fadlalah bin Al Faraj] berkata; telah menceritakan kepada kami [Abu Sa'd] berkata; Saya melihat [Watsilah bin Asyqa'] sholat di masjid Damaskus, lalu dia meludah di bawah kaki kirinya kemudian mengubur bekas ludahnya dengan kakinya. Selesai sholat, saya bertanya, \"Apa kamu termasuk sahabat Rasulullah Shallallahu'alaihiwasallam, berludah di masjid?\", maka dia berkata; \"Begitulah saya melihat Rasulullah Shallallahu'alaihiwasallam berbuat\"."
            },
            {
                "number": 807,
                "arab": "قَالَ حَدَّثَنَا أَبُو النَّضْرِ هَاشِمٌ قَالَ أَخْبَرَنَا ابْنُ عُلَاثَةَ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي عَبْلَةَ عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ قَالَجَاءَ نَفَرٌ مِنْ بَنِي سُلَيْمٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّ صَاحِبًا لَنَا قَدْ أَوْجَبَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَعْتِقْ رَقَبَةً مُسْلِمَةً يَفُكَّ اللَّهُ عَزَّ وَجَلَّ بِكُلِّ عُضْوٍ مِنْهَا عُضْوًا مِنْهُ مِنْ النَّارِ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Abu Nadlr, Hasyim] berkata; telah mengabarkan kepada kami [Ibnu 'Ulatsah] berkata; telah menceritakan kepada kami [Ibrahim bin Abu 'Ablah] dari [Watsilah bin Al Asyqa'] berkata; telah datang beberapa laki-laki dari Bani Sulaim kepada Rasulullah Shallallahu'alaihiwasallam lalu mereka berkata; \"Wahai Rasulullah, ada salah seorang teman kami yang melakukan dosa besar\", Rasulullah Shallallahu'alaihiwasallam bersabda: \"Hendaklah dia membebaskan seorang budak muslim, niscaya Allah Azzawajalla akan membebaskan anggota tubuhnya dari api neraka dengan perantaraan masing-masing anggota tubuh budak yang dimerdekakannya\""
            },
            {
                "number": 808,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ الْحِمْصِيُّ عَنْ أَبِي سَلَمَةَ الْحِمْصِيِّ قَالَ حَدَّثَنَا عُمَرُ بْنُ رُؤْبَةَ التَّغْلِبِيُّ قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ عَبْدِ اللَّهِ النَّصْرِيُّ عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَرْأَةُ تَحُوزُ ثَلَاثَ مَوَارِيثَ عَتِيقَهَا وَلَقِيطَهَا وَوَلَدَهَا الَّذِي تُلَاعِنُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Abu Nadlr] berkata; telah menceritakan kepada kami [Baqiyah bin Al Walid Al Himshi] dari [Abu Salamah Al Himshi] berkata; telah menceritakan kepada kami ['Umar bin Ru`bah At-Taghlibi] berkata; telah menceritakan kepada kami [Abdul Wahid bin Abdullah An Nashri] dari [Watsilah bin Al Asyqa'] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Wanita itu berhak mendapatkan tiga warisan, warisan orang yang dia bebaskan (yaitu dengan wala' jika dia tidak ada ahli warisnya). Warisan dari orang yang dia temukan dan warisan anaknya yang dia di li'an karena anak tersebut\"."
            },
            {
                "number": 809,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا أَبُو جَعْفَرٍ يَعْنِي الرَّازِيَّ عَنْ يَزِيْدَ بْنِ أَبِي مَالِكٍ قَالَ حَدَّثَنَا أَبُو سِبَاعٍ قَالَاشْتَرَيْتُ نَاقَةً مِنْ دَارِ وَاثِلَةَ بْنِ الْأَسْقَعِ فَلَمَّا خَرَجْتُ بِهَا أَدْرَكَنَا وَاثِلَةُ وَهُوَ يَجُرُّ رِدَاءَهُ فَقَالَ يَا عَبَد اللَّهِ اشْتَرَيْتَ قُلْتُ نَعَمْ قَالَ هَلْ بَيَّنَ لَكَ مَا فِيهَا قُلْتُ وَمَا فِيهَا قَالَ إِنَّهَا لَسَمِينَةٌ ظَاهِرَةُ الصِّحَّةِ قَالَ فَقَالَ أَرَدْتَ بِهَا سَفَرًا أَمْ أَرَدْتَ بِهَا لَحْمًا قُلْتُ بَلْ أَرَدْتُ عَلَيْهَا الْحَجَّ قَالَ فَإِنَّ بِخُفِّهَا نَقْبًا قَالَ فَقَالَ صَاحِبُهَا أَصْلَحَكَ اللَّهُ أَيْ هَذَا تُفْسِدُ عَلَيَّ قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحِلُّ لِأَحَدٍ يَبِيعُ شَيْئًا إِلَّا يُبَيِّنُ مَا فِيهِ وَلَا يَحِلُّ لِمَنْ يَعْلَمُ ذَلِكَ إِلَّا يُبَيِّنُهُ",
                "id": "Telah menceritakan kepada kami [Abu Nadlr] berkata; telah menceritakan kepada kami [Abu Ja'far] yaitu Ar-Razi dari [Yazid bin Abu Malik] berkata; telah menceritakan kepada kami [Abu Siba'] berkata; saya membeli unta dari perkampungan [Watsilah bin Al Asyqa'], ketika kami keluar dari perkampungan itu, kami mengetahui Watsilah sedang membentangkan selendangnya, lalu dia berkata; \"Wahai hamba Allah, engkau membeli unta itu?\" Abu Siba' menjawab, \"Ya\". Watsilah bertanya, \"Apakah pemilik unta menjelaskan kepadamu segala hal ihwal unta itu?\" saya bertanya, \"Memangnya kenapa\"? Pemilik unta menjawab, \"Unta tersebut gemuk dan kelihatan sehat\". Watsilah bertanya kepadaku, \"Unta tersebut memangnya hendak kau pergunakan untuk apa, digunakan untuk perjalanan atau diambil dagingnya\"? Saya (Abu Siba') menjawab, \"Bukan, tapi saya gunakan untuk keperluan haji\" Watsilah berkata; \"Maaf ya, kaki unta itu berlubang, \" pemilik unta tersebut berkata; \"Kiranya Allah membereskanmu -Maksud pemilik unta, ucapan Watsilah menjadikan jual belinya gagAl -\", (Watsilah bin Al Asyqa') berkata; Maaf saja, saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidak halal bagi seseorang untuk menjual sesuatu kecuali dia menjelaskan segala hal ihwal (cacat) barangnya, dan tidak halal bagi seseorang yang mengetahui hal tersebut kecuali harus menjelaskannya.\""
            },
            {
                "number": 810,
                "arab": "قَالَ حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا شَيْبَانُ عَنْ لَيْثٍ عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى عَنْ أَبِي مَلِيحِ بْنِ أُسَامَةَ عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ قَالَشَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ وَأَتَاهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ حَدًّا مِنْ حُدُودِ اللَّهِ عَزَّ وَجَلَّ فَأَقِمْ فِيَّ حَدَّ اللَّهِ فَأَعْرَضَ ثُمَّ أَتَاهُ الثَّانِيَةَ فَأَعْرَضَ عَنْهُ ثُمَّ قَالَهَا الثَّالِثَةَ فَأَعْرَضَ عَنْهُ ثُمَّ أُقِيمَتْ الصَّلَاةُ فَلَمَّا قَضَى الصَّلَاةَ أَتَاهُ الرَّابِعَةَ فَقَالَ إِنِّي أَصَبْتُ حَدًّا مِنْ حُدُودِ اللَّهِ عَزَّ وَجَلَّ فَأَقِمْ فِيَّ حَدَّ اللَّهِ عَزَّ وَجَلَّ قَالَ فَدَعَاهُ فَقَالَ أَلَمْ تُحْسِنْ الطُّهُورَ أَوْ الْوُضُوءَ ثُمَّ شَهِدْتَ الصَّلَاةَ مَعَنَا آنِفًا قَالَ بَلَى قَالَ اذْهَبْ فَهِيَ كَفَّارَتُكَ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Abu Nadlr] berkata; telah menceritakan kepada kami [Syaiban] dari [Laits] dari [Abu Burdah bin Abu Musa] dari [Abu Malih bin Usamah] dari [Watsilah bin Al Asyqa'] berkata; Suatu hari aku menyaksikan Rasulullah Shallallahu'alaihiwasallam didatangi seorang laki-laki berkata; \"Wahai Rasulullah Shallallahu'alaihiwasallam, saya telah melanggar salah satu hukum Allah Azzawajalla, maka tegakkanlah kepadaku hukuman atas hal tersebut\". (Rasulullah Shallallahu'alaihiwasallam) berpaling, lalu (pemuda itu) datang untuk kedua kalinya, beliau berpaling darinya, lalu mengatakan yang ketiga kalinya namun beliau tetap menolaknya kembali. Kemudian didirikanlah sholat, setelah sholat ditunaikan, pemuda tersebut kembali datang keempat kalinya, dia berkata; saya telah melanggar hukum Allah Azzawajalla, maka lakukanlah hukuman terhadap diriku\". Beliau memanggilnya dan bersabda: \"Bukankah kamu telah menyempurnakan wudlu, dan kamu ikut sholat bersama kami?\" (pemuda tersebut) berkata; \"Ya\". (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Pergilah, apa yang telah kamu kerjakan tadi menjadi penebus dari kesalahanmu\"."
            },
            {
                "number": 811,
                "arab": "قَالَ حَدَّثَنَا الْوَلِيدُ بْنِ مُسْلِمٍ قَالَ حَدَّثَنِي الْوَلِيدُ بْنُ سُلَيْمَانَ يَعْنِي ابْنَ أَبِي السَّائِبِ قَالَ حَدَّثَنِي حَيَّانُ أَبُو النَّضْرِ قَالَدَخَلْتُ مَعَ وَاثِلَةَ بْنِ الْأَسْقَعِ عَلَى أَبِي الْأَسْوَدِ الْجُرَشِيِّ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ فَسَلَّمَ عَلَيْهِ وَجَلَسَ قَالَ فَأَخَذَ أَبُو الْأَسْوَدِ يَمِينَ وَاثِلَةَ فَمَسَحَ بِهَا عَلَى عَيْنَيْهِ وَوَجْهِهِ لِبَيْعَتِهِ بِهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ وَاثِلَةُ وَاحِدَةٌ أَسْأَلُكَ عَنْهَا قَالَ وَمَا هِيَ قَالَ كَيْفَ ظَنُّكَ بِرَبِّكَ قَالَ فَقَالَ أَبُو الْأَسْوَدِ وَأَشَارَ بِرَأْسِهِ أَيْ حَسَنٌ قَالَ وَاثِلَةُ أَبْشِرْ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَالَ اللَّهُ عَزَّ وَجَلَّ أَنَا عِنْدَ ظَنِّ عَبْدِي بِي فَلْيَظُنَّ بِي مَا شَاءَ قَالَحَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنِي سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ وَهِشَامُ بْنُ الْغَازِ أَنَّهُمَا سَمِعَاهُ مِنْ حَيَّانَ أَبِي النَّضْرِ يُحَدِّثُ بِهِ وَلَا يَأْتِيَانِ عَلَى حِفْظِ الْوَلِيدِ بْنِ سُلَيْمَانَ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Al Walid bin Muslim] berkata; telah menceritakan kepadaku [Al Walid bin Sulaiman] yaitu Ibnu Abu Sa`ib, berkata; telah menceritakan kepadaku [Hayyan Abu Nadlar] berkata; saya bersama [Watsilah bin Al Asyqa'] mengunjungi Abu Aswad Al Jurasy ketika sakit yang menyebabkan kematiannya, (Watsilah bin Al Asyqa') memberi salam untuknya dan duduk. Abul Aswad menggandeng tangan kanan Watsilah dan mengusapkanya pada kedua mata dan wajahnya untuk berbaiat Rasulullah Shallallahu'alaihiwasallam. Watsilah berkata padanya, \"Ada satu hal yang ingin saya tanyakan\" Dia berkata; \"Apakah itu?\" (Watsilah bin Al Asyqa') berkata; \"Apa prasangkamu terhadap Rab-mu\"? Maka Abu Al Aswad memberi isyarat dengan kepalanya yang artinya prasangkanya baik, Watsilah berkata; bergembiralah, saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Allah berfirman: 'Aku pada prasangka hamba-Ku terhadap-Ku, maka terserah dia untuk berprasangka terhadap-Ku'\". (Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Al Walid bin Muslim] berkata; telah menceritakan kepada kami [Said bin Abdul Aziz] dan [Hisyam bin Ghaz] mereka berdua mendengar dari [Hayyan, Abu Nadzar] menceritakannya, dan mereka berdua tidak mendatangi hafalan Al Walid bin Sulaiman"
            },
            {
                "number": 812,
                "arab": "قَالَ حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنَا مَرْوَانُ بْنُ جَنَاحٍ عَنْ يُونُسَ بْنِ مَيْسَرَةَ بْنِ حَلْبَسٍ عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ أَنَّهُسَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَلَا إِنَّ فُلَانَ بْنَ فُلَانٍ فِي ذِمَّتِكَ وَحَبْلِ جِوَارِكَ فَقِهِ فِتْنَةَ الْقَبْرِ وَعَذَابَ النَّارِ أَنْتَ أَهْلُ الْوَفَاءِ وَالْحَقِّ اللَّهُمَّ فَاغْفِرْ لَهُ وَارْحَمْهُ فَإِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami ['Ali bin Bahr] berkata; telah menceritakan kepada kami [Al Walid bin Muslim] berkata; telah menceritakan kepada kami [Marwan bin Jannah] dari [Yunus bin Maisarah bin Halbas] dari [Watsilah bin Al Asyqa'] mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Bukankah fulan bin fulan berada dalam tanggunganmu dan berada dalam tali kekerabatanmu. Jagalah dia dari fitnah kubur dan siksa neraka. Kamu adalah orang yang selalu menepati janji dan kebenaran. Ya Allah, ampunilah dosanya dan kasihanilah ia Engkau adalah Maha pengampun dan Maha Penyayang\"."
            },
            {
                "number": 813,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا مُصْعَبُ بْنُ عَبْدِ اللَّهِ الزُّبَيْرِيُّ قَالَ حَدَّثَنِي عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدِ بْنِ أَبِي عُبَيْدٍ عَنِ ابْنِ أَبِي ذِئْبٍ عَنْ سَعِيدِ بْنِ خَالِدٍ الْقَارِظِيِّ عَنْ رَبِيعَةَ بْنِ عَبَّادٍ الدِّيلِيِّ أَنَّهُ قَالَرَأَيْتُ أَبَا لَهَبٍ بِعُكَاظٍ وَهُوَ يَتْبَعُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَقُولُ يَا أَيُّهَا النَّاسُ إِنَّ هَذَا قَدْ غَوَى فَلَا يُغْوِيَنَّكُمْ عَنْ آلِهَةِ آبَائِكُمْ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفِرُّ مِنْهُ وَهُوَ عَلَى أَثَرِهِ وَنَحْنُ نَتْبَعُهُ وَنَحْنُ غِلْمَانُ كَأَنِّي أَنْظُرُ إِلَيْهِ أَحْوَلَ ذَا غَدِيرَتَيْنِ أَبْيَضَ النَّاسِ وَأَجْمَلَهُمْ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Mush'ab bin Abdullah Az Zubairi] berkata; telah menceritakan kepadaku [Abdul Aziz bin Muhammad bin Abu 'Ubaid] dari [Ibnu Abu dzi`b] dari [Sa'id bin Khalid Al Qarizhi] dari [Rabi'ah bin 'Abbad Ad-Dili] dia melihat Abu Lahab di pasar 'Ukazh mengikuti Rasulullah Shallallahu'alaihiwasallam dengan berseru, \"Wahai manusia, orang ini telah sesat. Janganlah kalian tersesat olehnya sehingga meninggalkan tuhAn tuhan bapak kalian\" Rasulullah Shallallahu'alaihiwasallam pun menjauh darinya, namun Abu Lahab tetap mengikutinya. Kami pada waktu itu masih anak-anak membuntuti (Abu lahab) yang aku melihatnya seakAn akan aku melihat orang yang juling, yang rambutnya di kepang dua, kulitnya sangat putih dan sangat tampan di antara mereka\"."
            },
            {
                "number": 814,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ بُنْدَارٌ قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ رَبِيعَةَ بْنِ عَبَّادٍ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذِي الْمَجَازِ يَدْعُو النَّاسَ وَخَلْفَهُ رَجُلٌ أَحْوَلُ يَقُولُ لَا يَصُدَّنَّكُمْ هَذَا عَنْ دِينِ آلِهَتِكُمْ قُلْتُ مَنْ هَذَا قَالُوا هَذَا عَمُّهُ أَبُو لَهَبٍ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Muhammad bin Basyar, bundar] berkata; telah menceritakan kepada kami [Abdul Wahab] berkata; telah menceritakan kepada kami [Muhammad bin 'Amr] dari [Muhammad Al Munkadir] dari [Rabi'ah bin 'Abbad] berkata; saya melihat Nabi Shallallahu'alaihiwasallam di Dzil Majaz, menyeru orang-orang masuk Islam dan di belakangnya seorang laki-laki juling dan berkata; jangan sesekali laki-laki ini menghalangi kalian dari agama nenek moyang kalian\". Saya (Rabi'ah bin 'Abbad) bertanya, siapakah ini?, mereka menjawab, pamannya Abu Lahab."
            },
            {
                "number": 815,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي سُرَيْجُ بْنُ يُونُسَ قَالَ حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ رَبِيعَةَ بْنِ عَبَّادٍ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَدْعُو النَّاسَ إِلَى الْإِسْلَامِ بِذِي الْمَجَازِ وَخَلْفَهُ رَجُلٌ أَحْوَلُ يَقُولُ لَا يَغْلِبَنَّكُمْ هَذَا عَنْ دِينِكُمْ وَدِينِ آبَائِكُمْ قُلْتُ لِأَبِي وَأَنَا غُلَامٌ مَنْ هَذَا الْأَحْوَلُ الَّذِي يَمْشِي خَلْفَهُ قَالَ هَذَا عَمُّهُ أَبُو لَهَبٍقَالَ عَبَّادٌ أَظُنُّ بَيْنَ مُحَمَّدِ بْنِ عَمْرٍو وَبَيْنَ رَبِيعَةَ مُحَمَّدَ بْنَ الْمُنْكَدِرِ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepadaku [Suraij bin Yunus] berkata; telah menceritakan kepada kami ['Abbad bin 'Abbad] dari [Muhammad bin 'Amr] dari [Rabi'ah bin 'Abbad] berkata; saya melihat Rasulullah Shallallahu'alaihiwasallam menyeru manusia kepada Islam di Dzil Majaz dan di belakangnya ada seorang yang juling yang berkata 'Jangan sesekali orang ini mengalahkan kalian dari agama kalian dan agama nenek moyang kalian.' Saya bertanya kepada bapakku, waktu itu saya ada seorang pemuda, siapakah orang juling yang mengikuti di belakangnya?. Dia menjawab, orang itu adalah pamannya, Abu Lahab. 'Abbad berkata; sepengetahuanku antara Muhammad bin 'Amr dan Rabi'ah bin 'Abbad ada [Muhammad bin Munkadir]."
            },
            {
                "number": 816,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي أَبُو سُلَيْمَانَ الضَّبِّيُّ دَاوُدُ بْنُ عَمْرِو بْنِ زُهَيْرٍ الْمُسَيِّبِيُّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ رَبِيعَةَ بْنِ عَبَّادٍ الدِّيلِيِّ وَكَانَ جَاهِلِيًّا أَسْلَمَ فَقَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَصَرَ عَيْنِي بِسُوقِ ذِي الْمَجَازِ يَقُولُ يَا أَيُّهَا النَّاسُ قُولُوا لَا إِلَهَ إِلَّا اللَّهُ تُفْلِحُوا وَيَدْخُلُ فِي فِجَاجِهَا وَالنَّاسُ مُتَقَصِّفُونَ عَلَيْهِ فَمَا رَأَيْتُ أَحَدًا يَقُولُ شَيْئًا وَهُوَ لَا يَسْكُتُ يَقُولُ أَيُّهَا النَّاسُ قُولُوا لَا إِلَهَ إِلَّا اللَّهُ تُفْلِحُوا إِلَّا أَنَّ وَرَاءَهُ رَجُلًا أَحْوَلَ وَضِيءَ الْوَجْهِ ذَا غَدِيرَتَيْنِ يَقُولُ إِنَّهُ صَابِئٌ كَاذِبٌ فَقُلْتُ مَنْ هَذَا قَالُوا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ وَهُوَ يَذْكُرُ النُّبُوَّةَ قُلْتُ مَنْ هَذَا الَّذِي يُكَذِّبُهُ قَالُوا عَمُّهُ أَبُو لَهَبٍقُلْتُ إِنَّكَ كُنْتَ يَوْمَئِذٍ صَغِيرًا قَالَ لَا وَاللَّهِ إِنِّي يَوْمَئِذٍ لَأَعْقِلُ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepadaku [Abu Sulaiman Adl-Dlabbi, Daud bin 'Amr bin Zuhair Al Musayyibi], berkata; telah menceritakan kepada kami [Abdurrahman bin Abu Az Zinad] dari [Bapaknya] dari [Rabi'ah bin 'Abbad Ad-Dili] dia awalnya jahiliyyah, lantas masuk Islam. Dia berkata; saya melihat Rasulullah Shallallahu'alaihiwasallam dengan mataku sendiri, di pasar Dzil Majaz berseru 'Wahai manusia. katakanlah \"Tidak ada tuhan selain Allah, niscaya kalian akan beruntung\" beliau memasuki lorong-lorong pasar itu. Orang-orang berhiruk pikuk kepadanya dan saya tidak melihat seorangpun yang berbicara. Sedang beliau tidak diam. Beliau menyerukan 'Katakanlah \"Tidak ada tuhan selain Allah\", niscaya kalian akan beruntung.' Sedang di belakangnya ada seorang yang juling, wajahnya berseri-seri, memiliki dua kepang rambut yang dipintal seraya berkata 'Ini adalah orang murtad dan pendusta.' Saya bertanya siapakah orang itu? Mereka menjawab, itu adalah pamannya, Abu Lahab. Saya berkata; kamu waktu itu adalah masih kecil. Dia berkata; tidak demi Allah, saya waktu itu sudah berakal."
            },
            {
                "number": 817,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا سَعِيدُ بْنُ أَبِي الرَّبِيعِ السَّمَّانُ قَالَ حَدَّثَنِي سَعِيدُ بْنُ سَلَمَةَ يَعْنِي ابْنَ أَبِي الْحُسَامِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ أَنَّهُ سَمِعَ رَبِيعَةَ بْنَ عَبَّادٍ الدِّيلِيَّ يَقُولُرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَطُوفُ عَلَى النَّاسِ بمِنًى فِي مَنَازِلِهِمْ قَبْلَ أَنْ يُهَاجِرَ إِلَى الْمَدِينَةِ يَقُولُ يَا أَيُّهَا النَّاسُ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَأْمُرُكُمْ أَنْ تَعْبُدُوهُ وَلَا تُشْرِكُوا بِهِ شَيْئًا قَالَ وَوَرَاءَهُ رَجُلٌ يَقُولُ هَذَا يَأْمُرُكُمْ أَنْ تَدَعُوا دِينَ آبَائِكُمْ فَسَأَلْتُ مَنْ هَذَا الرَّجُلُ فَقِيلَ هَذَا أَبُو لَهَبٍ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Sa'id bin Abu Ar-Rabi' As-Saman] berkata; telah menceritakan kepadaku [Sa'id bin Salamah] yaitu Ibnu Abu Al Husam, berkata; telah menceritakan kepada kami [Muhammad bin Munkadir] mendengar [Rabi'ah bin 'Abbad Ad-Dili] berkata; saya melihat Rasulullah Shallallahu'alaihiwasallam berkeliling kepada manusia di Mina di tempat tinggal mereka sebelum hijrah ke Madinah. Beliau menyerukan, 'Wahai manusia, Allah Azzawajalla memerintahkan kalian agar kalian menyembah-Nya dan janganlah kalian menyekutukAn Nya dengan sesuatupun. Sedang di belakangnya seorang laki-laki yang berkata 'Orang ini memerintahkan kalian untuk meninggalkan agama bapak-bapak kalian', saya bertanya 'Siapakah orang ini?. Ada yang menjawab, ini adalah Abu Lahab."
            },
            {
                "number": 818,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا مَسْرُوقُ بْنُ الْمَرْزُبَانِ الْكُوفِيُّ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ قَالَ قَالَ ابْنُ إِسْحَاقَ فَحَدَّثَنِي حُسَيْنُ بْنُ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ الْعَبَّاسِ قَالَ سَمِعْتُ رَبِيعَةَ بْنَ عَبَّادٍ الدِّيلِيَّ قَالَإِنِّي لَمَعَ أَبِي رَجُلٌ شَابٌّ أَنْظُرُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتْبَعُ الْقَبَائِلَ وَوَرَاءَهُ رَجُلٌ أَحْوَلُ وَضِيءٌ ذُو جُمَّةٍ يَقِفُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْقَبِيلَةِ وَيَقُولُ يَا بَنِي فُلَانٍ إِنِّي رَسُولُ اللَّهِ إِلَيْكُمْ آمُرُكُمْ أَنْ تَعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا وَأَنْ تُصَدِّقُونِي حَتَّى أُنْفِذَ عَنْ اللَّهِ مَا بَعَثَنِي بِهِ فَإِذَا فَرَغَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ مَقَالَتِهِ قَالَ الْآخَرُ مِنْ خَلْفِهِ يَا بَنِي فُلَانٍ إِنَّ هَذَا يُرِيدُ مِنْكُمْ أَنْ تَسْلُخُوا اللَّاتَ وَالْعُزَّى وَحُلَفَاءَكُمْ مِنْ الْحَيِّ بَنِي مَالِكِ بْنِ أُقَيْشٍ إِلَى مَا جَاءَ بِهِ مِنْ الْبِدْعَةِ وَالضَّلَالَةِ فَلَا تَسْمَعُوا لَهُ وَلَا تَتَّبِعُوهُ فَقُلْتُ لِأَبِي مَنْ هَذَا قَالَ عَمُّهُ أَبُو لَهَبٍ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Masruq bin Al Marzuban Al Kufi] telah menceritakan kepada kami [Ibnu Abu Za`idah], berkata; [Ibnu Ishaq] berkata; lalu menceritakan kepadaku [Husain bin Abdullah bin 'ubaidhullah bin Al Abbas] berkata; saya mendengar [Rabi'ah bin 'Abbad Ad-Dili] berkata; aku yang ketika itu masih muda belia, saya melihat Rasulullah Shallallahu'alaihiwasallam membuntuti kabilah- kabilah sedang di belakangnya ada seorang juling, wajahnya cerah dan terjuntai rambutnya, Rasulullah Shallallahu'alaihiwasallam berdiri pada setiap kabilah dan menyerukan 'Wahai Bani Fulan, saya Rasulullah, saya perintahkan kalian agar kalian menyembah Allah dan janganlah menyekutukAn nya dengan sesuatupun dan agar kalian membenarkanku sampai saya bisa melaksanakan apa yag telah Allah bebankan kepadaku.' Jika Rasulullah Shallallahu'alaihiwasallam selesai melafadzkan perkataan itu, orang yang di belakangnya berkata 'Wahai Bani Fulan, orang ini menghendaki kalian meninggalkan Latta dan Uzza dan sekutu-sekutu kalian dari perkampungan Bani Malik bin Uqais untuk mengikuti ajaran yang dibawanya berupa hal yang baru dan kesesatan. Janganlah kalian mendengarnya, janganlah kalian mengikutinya. Saya berkata kepada bapakku siapakah orang ini?. Dia menjawab, itu justru pamannya sendiri, Abu lahab."
            },
            {
                "number": 819,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي مُحَمَّدُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ ذَكْوَانَ عَنْ أَبِيهِ أَبِي الزِّنَادِ قَالَرَأَيْتُ رَجُلًا يُقَالُ لَهُ رَبِيعَةُ بْنُ عَبَّادٍ الدِّيلِيُّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَمُرُّ فِي فِجَاجِ ذِي الْمَجَازِ إِلَّا أَنَّهُمْ يَتْبَعُونَهُ وَقَالُوا هَذَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْمُطَّلِبِ قَالَ وَرَجُلٌ أَحْوَلُ وَضِيءُ الْوَجْهِ ذُو غَدِيرَتَيْنِ يَتْبَعُهُ فِي فِجَاجِ ذِي الْمَجَازِ وَيَقُولُ إِنَّهُ صَابِئٌ كَاذِبٌ فَقُلْتُ مَنْ هَذَا قَالُوا هَذَا عَمُّهُ أَبُو لَهَبٍ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepadaku [Muhammad bin Bakr] berkata; telah menceritakan kepada kami [Abdurrahman bin Abdullah bin Dzakwan] dari [Bapaknya, Abu Az Zinad] berkata; saya melihat seorang laki-laki yang bernama [Rabi'ah bin 'Abbad Ad-Dili] berkata; saya melihat Rasulullah Shallallahu'alaihiwasallam melewati lorong-lorong pasar Dzul Majaz, mereka mengikutinya dan berkata; ini adalah Muhammad bin Abdullah bin Abdul Muthalib. (Rabi'ah bin 'Abbad) berkata; dan ada laki-laki juling yang wajahnya cerah memiliki dua kepang rambut membuntutinya di lorong-lorong Dzil Majaz dan berkata 'Dia adalah orang murtad lagi pendusta.' Saya bertanya 'Siapakah orang itu?. Mereka menjawab, itu adalah pamannya, Abu Lahab."
            },
            {
                "number": 820,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الْقُرَشِيُّ قَالَ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي حُسَيْنُ بْنُ عَبْدِ اللَّهِ عَنْ رَبِيعَةَ بْنِ عَبَّادٍ الدُؤَلِيِّ وَعَمَّنْ حَدَّثَهُ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ رَبِيعَةَ بْنِ عَبَّادٍ قَالَوَاللَّهِ إِنِّي لَأَذْكُرُهُ يَطُوفُ عَلَى الْمَنَازِلِ بِمِنًى وَأَنَا مَعَ أَبِي غُلَامٌ شَابٌّ وَوَرَاءَهُ رَجُلٌ حَسَنُ الْوَجْهِ أَحْوَلُ ذُو غَدِيرَتَيْنِ فَلَمَّا وَقَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى قَوْمٍ قَالَ أَنَا رَسُولُ اللَّهِ يَأْمُرُكُمْ أَنْ تَعْبُدُوهُ وَلَا تُشْرِكُوا بِهِ شَيْئًا وَيَقُولُ الَّذِي خَلْفَهُ إِنَّ هَذَا يَدْعُوكُمْ إِلَى أَنْ تُفَارِقُوا دِينَ آبَائِكُمْ وَأَنْ تَسْلُخُوا اللَّاتَ وَالْعُزَّى وَحُلَفَاءَكُمْ مِنْ بَنِي مَالِكِ بْنِ أُقَيْشٍ إِلَى مَا جَاءَ بِهِ مِنْ الْبِدْعَةِ وَالضَّلَالِ قَالَ فَقُلْتُ لِأَبِي مَنْ هَذَا قَالَ هَذَا عَمُّهُ أَبُو لَهَبٍ عَبْدُ الْعُزَّى بْنُ عَبْدِ الْمُطَّلِبِ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Yahya bin Sa'id Al Qurasyi] berkata; telah menceritakan kepada kami [bapakku] dari [Ibnu Ishaq] berkata; telah menceritakan kepadaku [Husain bin Abdullah] dari [Rabi'ah bin 'Abbad Ad-Dili] dari [orang yang telah menceritakannya] dari [Zaid bin Aslam] dari [Rabi'ah bin 'Abbad] berkata; demi Allah saya akan menceritakannya, dia (Muhammad) berkeliling ke rumah-rumah di Mina, ketika itu saya masih muda bersama bapakku, sedang di belakangnya ada seorang yang wajahnya cerah, juling, memiliki dua kepang. Tatkala Rasulullah Shallallahu'alaihiwasallam berhenti pada suatu kaum, beliau bersabda: \"Saya adalah utusan Allah, saya perintahkan kalian untuk menyembah-Nya dan jangan kalian menyekutukAn Nya dengan sesuatupun. Anehnya, orang yang di belakangnya berkata; orang ini menyeru kalian agar meninggalkan agama bapak kalian dan kalian meninggalkan Lata dan 'Uzza dan para pemimpin kalian dari perkampungan Bani Malik bin Uqais kepada ajaran yang dibawanya berupa hal baru dan kesesatan. Saya berkata kepada bapakku, siapakah orang ini?. Dia menjawab, pamannya Abu lahab, Abdul Al 'Uzza bin Abdul Muthallib."
            },
            {
                "number": 821,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا الْحَجَّاجُ بْنُ أَرْطَاةَ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ قَالَرَأَيْتُ مُحَمَّدَ بْنَ مَسْلَمَةَ يُطَارِدُ امْرَأَةً بِبَصَرِهِ فَقُلْتُ تَنْظُرُ إِلَيْهَا وَأَنْتَ مِنْ أَصْحَابِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا أَلْقَى اللَّهُ عَزَّ وَجَلَّ فِي قَلْبِ امْرِئٍ خِطْبَةً لِامْرَأَةٍ فَلَا بَأْسَ أَنْ يَنْظُرَ إِلَيْهَا",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata; telah mengabarkan kepada kami [Al Hajjaj bin Arthah] dari [Muhammad bin Sulaiman bin Abu Hatsmah] dari [Sahal bin Abu Hatsmah] berkata; saya melihat [Muhammad bin Maslamah] mengintip seorang wanita dengan matanya. Saya bertanya, kamu mengintipnya padahal kamu adalah seorang sahabat Muhammad Shallallahu'alaihiwasallam? lalu dia berkata; 'Saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Jika Allah Azzawajalla menjadikan hati seseorang tertarik untuk melamar seorang wanita, tidak masalah ia melihatnya.\""
            },
            {
                "number": 822,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ أَبِي بُرْدَةَ قَالَمَرَرْتُ بِالرَّبَذَةِ فَإِذَا فُسْطَاطٌ فَقُلْتُ لِمَنْ هَذَا فَقِيلَ لِمُحَمَّدِ بْنِ مَسْلَمَةَ فَاسْتَأْذَنْتُ عَلَيْهِ فَدَخَلْتُ عَلَيْهِ فَقُلْتُ رَحِمَكَ اللَّهُ إِنَّكَ مِنْ هَذَا الْأَمْرِ بِمَكَانٍ فَلَوْ خَرَجْتَ إِلَى النَّاسِ فَأَمَرْتَ وَنَهَيْتَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّهُ سَتَكُونُ فِتْنَةٌ وَفُرْقَةٌ وَاخْتِلَافٌ فَإِذَا كَانَ ذَلِكَ فَأْتِ بِسَيْفِكَ أُحُدًا فَاضْرِبْ بِهِ عُرْضَهُ وَاكْسِرْ نَبْلَكَ وَاقْطَعْ وَتَرَكَ وَاجْلِسْ فِي بَيْتِكَ فَقَدْ كَانَ ذَلِكَ وَقَالَ يَزِيدُ مَرَّةً فَاضْرِبْ بِهِ حَتَّى تَقْطَعَهُ ثُمَّ اجْلِسْ فِي بَيْتِكَ حَتَّى تَأْتِيَكَ يَدٌ خَاطِئَةٌ أَوْ يُعَافِيَكَ اللَّهُ عَزَّ وَجَلَّ فَقَدْ كَانَ مَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفَعَلْتُ مَا أَمَرَنِي بِهِ ثُمَّ اسْتَنْزَلَ سَيْفًا كَانَ مُعَلَّقًا بِعَمُودِ الْفُسْطَاطِ فَاخْتَرَطَهُ فَإِذَا سَيْفٌ مِنْ خَشَبٍ فَقَالَ قَدْ فَعَلْتُ مَا أَمَرَنِي بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاتَّخَذْتُ هَذَا أُرْهِبُ بِهِ النَّاسَ قَالَحَدَّثَنَا مُؤَمَّلٌ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ أَبِي بُرْدَةَ قَالَ مَرَرْنَا بِالرَّبَذَةِ فَإِذَا فُسْطَاطٌ مَضْرُوبٌ فَذَكَرَهُ قَالَ إِنَّهُ سَتَكُونُ فِتْنَةٌ وَفُرْقَةٌ فَاضْرِبْ بِسَيْفِكَ عُرْضَ أُحُدٍ قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا عَلِيُّ بْنُ زَيْدٍ عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى قَالَ مَرَرْنَا بِالرَّبَذَةِ فَإِذَا فُسْطَاطٌ فَقُلْتُ لِمَنْ هَذَا فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata; telah mengabarkan kepada kami [Hammad bin Salamah] dari ['Ali bin Zaid] dari [Abu Burdah] berkata; saya melewati Rabadzah, di sana ada kemah, saya bertanya, Kemah ini milik siapa\"? Ada yang berkata; milik [Muhammad bin Maslamah], maka saya pun meminta izin dan masuk kemah itu. Saya berkata; \"Semoga Allah merahmatimu, engkau mempunyai kedudukan dalam permasalahan ini yang apabila engkau keluar bersama manusia, engkau dapat memberi perintah dan melarang sesuatu\". Lalu Muhammad bin Maslamah berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: Sungguh akan terjadi suatu fitnah, perpecahan dan perbedaan, jika hal itu terjadi, datanglah membawa pedangmu ke gunung Uhud dan pukullah gunung itu dengan pedangmu, pecahkanlah panahmu serta potonglah, tinggalkan dan kemudian duduklah kamu di rumah, sampai datanglah tangan yang berdosa atau Allah mengampuni dosamu. Lalu lakukan apa yang beliau perintahkan. Kemudian saya meminta diturunkanya pedang yang tergantung di tiang kemah dan mengeluarkanya dari sarungnya, pedang itu terbuat dari kayu, maka dia berkata: \"Aku telah melaksanakan apa yang Rasulullah Shallallahu'alaihiwasallam perintahkan, maka aku ambil pedang itu untuk menakuti manusia, ternyata itu adalah pedang dari kayu.\" (Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Mu'amal] berkata; telah bercerita kepada kami [Hammad] dari ['Ali bin Zaid] dari [Abu Burdah'] dia berkata; Aku melewati Rabadzah, ketika itu ada sebuah kemah besar, maka dia berkata; lalu menyebutkannya, berkata; \"Sungguh akan terjadi fitnah dan perpecahan, maka pukullah gunung Uhud dengan pedangmu\". (Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami ['Affan] berkata; telah menceritakan kepada kami [Hammad bin Salamah] telah mengabarkan kepada kami ['Ali bin Zaid] dari [Abu Burdah bin Musa] dia berkata; Aku melewati tempat Rabazhah, ternyata ada sebuah kemah besar\", maka aku berkata; \"Sebagaimana telah disebutkan dalam hadis\""
            },
            {
                "number": 823,
                "arab": "حَدَّثَنَا الْقَاسِمُ بْنُ مَالِكٍ الْمُزَنِيُّ أَبُو جَعْفَرٍ قَالَ أَخْبَرَنِي جَمِيلُ بْنُ زَيْدٍ قَالَ صَحِبْتُ شَيْخًا مِنْ الْأَنْصَارِ ذَكَرَ أَنَّهُ كَانَتْ لَهُ صُحْبَةٌ يُقَالُ لَهُ كَعْبُ بْنُ زَيْدٍ أَوْ زَيْدُ بْنُ كَعْبٍ فَحَدَّثَنِيأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَزَوَّجَ امْرَأَةً مِنْ بَنِي غِفَارٍ فَلَمَّا دَخَلَ عَلَيْهَا وَضَعَ ثَوْبَهُ وَقَعَدَ عَلَى الْفِرَاشِ أَبْصَرَ بِكَشْحِهَا بَيَاضًا فَانْحَازَ عَنْ الْفِرَاشِ ثُمَّ قَالَ خُذِي عَلَيْكِ ثِيَابَكِ وَلَمْ يَأْخُذْ مِمَّا أَتَاهَا شَيْئًا",
                "id": "Telah menceritakan kepada kami [Al Qasim bin Malik Al Muzani, Abu Ja'far] berkata; telah mengabarkan kepadaku [Jamil bin Zaid] berkata; saya menemani seorang guru dari Anshar, yang disebutkan bahwa dia adalah salah seorang sahabat yang bernama [Ka'ab bin Zaid] atau Zaid bin Ka'ab, dia menceritakan kepadaku bahwa Rasulullah Shallallahu'alaihiwasallam menikahi seorang perempuan Bani Ghiffar, ketika beliau menemuinya dan meletakkan bajunya serta duduk di atas tempat tidur, beliau melihat bagian badan perempuan tersebut di sekitar pinggul berwarna putih, maka beliau bangkit dari tempat tidur dan berkata; \"Ambillah bajumu\" dan beliau tidak mengambil apapun dari yang telah beliau berikan kepadanya\"."
            },
            {
                "number": 824,
                "arab": "قَالَ حَدَّثَنَا يَزِيدُ قَالَ أَخْبَرَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ مُحَمَّدِ بْنِ أَبِي يَعْقُوبَ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ أَبِيهِ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِحْدَى صَلَاتَيْ الْعَشِيِّ الظُّهْرِ أَوْ الْعَصْرِ وَهُوَ حَامِلٌ الْحَسَنَ أَوْ الْحُسَيْنَ فَتَقَدَّمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَضَعَهُ ثُمَّ كَبَّرَ لِلصَّلَاةِ فَصَلَّى فَسَجَدَ بَيْنَ ظَهْرَانَيْ صَلَاتِهِ سَجْدَةً أَطَالَهَا فَقَالَ إِنِّي رَفَعْتُ رَأْسِي فَإِذَا الصَّبِيُّ عَلَى ظَهْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ سَاجِدٌ فَرَجَعْتُ فِي سُجُودِي فَلَمَّا قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةَ قَالَ النَّاسُ يَا رَسُولَ اللَّهِ إِنَّكَ سَجَدْتَ بَيْنَ ظَهْرَانَيْ صَلَاتِكَ هَذِهِ سَجْدَةً قَدْ أَطَلْتَهَا فَظَنَنَّا أَنَّهُ قَدْ حَدَثَ أَمْرٌ أَوْ أَنَّهُ قَدْ يُوحَى إِلَيْكَ قَالَ فَكُلُّ ذَلِكَ لَمْ يَكُنْ وَلَكِنَّ ابْنِي ارْتَحَلَنِي فَكَرِهْتُ أَنْ أُعَجِّلَهُ حَتَّى يَقْضِيَ حَاجَتَهُ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Yazid] berkata; telah mengabarkan kepada kami [Jarir bin Hazim] dari [Muhammad bin Abu Ya'qub] dari [Abdulllah bin Syadad] dari [bapaknya] berkata; Rasulullah Shallallahu'alaihiwasallam keluar menemui kami dengan menggendong Hasan atau Husain antara dua waktu sholat, zhuhur dan ashar. Nabi Shallallahu'alaihiwasallam maju ke depan dan meletakkan (Hasan dan Hasan) lalu mulai bertakbir untuk sholat, dan beliau bersujud ketika dalam sholatnya dengan sujud yang begitu lama.(Syadad) berkata; \"Saya mengangkat kepalaku, terlihat anak kecil itu sedang berada di punggung Rasulullah Shallallahu'alaihiwasallam, maka saya kembali lagi untuk bersujud, ketika Rasulullah Shallallahu'alaihiwasallam selesai dari sholatnya, orang-orang berkata; 'Wahai Rasulullah, anda tadi sujud waktu dalam sholat dengan begitu lama, sehingga kami mengira jangAn jangan terjadi suatu hal atau telah diturunkan wahyu kepadamu\". Beliau bersabda: \"Bukan karena itu, tapi ketika aku sujud, anakku (maksudnya cucuku) sedang menaikku, saya tidak mau menyegerakannya sampai cucuku turun dariku\"."
            },
            {
                "number": 825,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي الزِّنَادِ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ حَمْزَةَ الْأَسْلَمِيُّ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّرَهُ عَلَى سَرِيَّةٍ فَخَرَجْتُ فِيهَا فَقَالَ إِنْ أَخَذْتُمْ فُلَانًا فَأَحْرِقُوهُ بِالنَّارِ فَلَمَّا وَلَّيْتُ نَادَانِي فَقَالَ إِنْ أَخَذْتُمُوهُ فَاقْتُلُوهُ فَإِنَّهُ لَا يُعَذِّبُ بِالنَّارِ إِلَّا رَبُّ النَّارِ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] telah menceritakan kepada kami [Al Mughirah bin Abdurrahman] dari [Abu Zinad] berkata; telah menceritakan kepadaku [Muhammad bin Hamzah Al Aslamy] dari [bapaknya] Rasulullah Shallallahu'alaihiwasallam menjadikannya panglima suatu pasukan. Lalu saya berangkat, maka beliau bersabda: \"Jika kalian menemukan fulan, maka bakarlah dia dengan api\". Ketika saya berangkat, beliau memanggilku lagi seraya bersabda: \"Kalau kalian menemukannya, maka bunuhlah, karena tidak boleh menyiksa dengan api kecuali pencipta api\"."
            },
            {
                "number": 826,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي زِيَادٌ يَعْنِي ابْنَ سَعْدٍ أَنَّ أَبَا الزِّنَادِ قَالَ أَخْبَرَنِي حَنْظَلَةُ بْنُ عَلِيٍّ عَنْ حَمْزَةَ بْنِ عَمْرٍو الْأَسْلَمِيِّ صَاحِبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَهُ وَرَهْطًا مَعَهُ إِلَى رَجُلٍ مِنْ عُذْرَةَ فَقَالَ إِنْ قَدَرْتُمْ عَلَى فُلَانٍ فَأَحْرِقُوهُ بِالنَّارِ فَانْطَلَقُوا حَتَّى إِذَا تَوَارَوْا مِنْهُ نَادَاهُمْ أَوْ أَرْسَلَ فِي أَثَرِهِمْ فَرَدُّوهُمْ ثُمَّ قَالَ إِنْ أَنْتُمْ قَدَرْتُمْ عَلَيْهِ فَاقْتُلُوهُ وَلَا تُحْرِقُوهُ بِالنَّارِ فَإِنَّمَا يُعَذِّبُ بِالنَّارِ رَبُّ النَّارِ قَالَحَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنَا زِيَادٌ أَنَّ أَبَا الزِّنَادِ أَخْبَرَهُ قَالَ أَخْبَرَنِي حَنْظَلَةُ بْنُ عَلَيٍّ الْأَسْلَمِيُّ أَنَّ حَمْزَةَ بْنَ عَمْرٍو الْأَسْلَمِيَّ صَاحِبَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَهُ وَرَهْطًا مَعَهُ سَرِيَّةً إِلَى رَجُلٍ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] berkata; telah mengabarkan kepada kami [Ziyad] yaitu Ibnu Saad, [Abu Zinad] berkata; telah menceritakan kepadaku [Hanzhalah bin 'Ali] dari [Hamzah bin 'Amr Al Aslami] seorang sahabat Nabi Shallallahu'alaihiwasallam menceritakannya bahwa Rasulullah Shallallahu'alaihiwasallam mengutusnya bersama beberapa orang seorang laki-laki dari 'Udzrah, lalu beliau bersabda: \"Jika mampu maka bakarlah, bakarlah dia dengan api\". Lalu mereka berangkat, setelah mereka meninggalkan beliau, beliau memanggil mereka lagi, atau mengutus kepada mereka, dan meminta mereka untuk kembali dan bersabda: \"Jika kalian bisa, maka bunuhlah, tapi jangan kalian bakar dengan api. Karena yang berhak menyiksa dengan api adalah pencipta api\" (Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Abdurrazzaq] berkata; telah mengabarkan kepada kami [Ibnu Juraij] berkata; telah mengabarkan kepada kami [Ziyad] [Abu Zinad] mengabarinya, berkata; telah mengabarkan kepadaku [Hanzhalah bin 'Ali Al Aslami] [Hamzah bin 'Amr Al Aslami] salah seorang sahabat Nabi Shallallahu'alaihiwasallam menceritakannya bahwa Rasulullah Shallallahu'alaihiwasallam mengutusnya bersama beberapa orang dalam sebuah ekspedisi untuk menangkap seseorang, lalu menyebutkan secara makna."
            },
            {
                "number": 827,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ حَمْزَةَ بْنِ عَمْرٍو الْأَسْلَمِيِّ أَنَّهُسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّوْمِ فِي السَّفَرِ فَقَالَ إِنْ شِئْتَ صُمْتَ وَإِنْ شِئْتَ أَفْطَرْتَ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Sulaiman bin Yasar] dari [Hamzah bin 'Amr Al Aslami] dia bertanya Rasulullah Shallallahu'alaihiwasallam tentang berpuasa pada saat perjalanan, maka (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Terserah kamu untuk berpuasa atau tidak\"."
            },
            {
                "number": 828,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ حَمْزَةَ بْنِ عَمْرٍو الْأَسْلَمِيِّأَنَّهُ رَأَى رَجُلًا عَلَى جَمَلٍ يَتْبَعُ رِحَالَ النَّاسِ بِمِنًى وَنَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَاهِدٌ وَالرَّجُلُ يَقُولُ لَا تَصُومُوا هَذِهِ الْأَيَّامَ فَإِنَّهَا أَيَّامُ أَكْلٍ وَشُرْبٍ قَالَ قَتَادَةُ فَذَكَرَ لَنَا أَنَّ ذَلِكَ الْمُنَادِي كَانَ بِلَالًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Sulaiman bin Yasar] dari [Hamzah bin 'Amr Al Aslami] dia melihat seorang laki-laki di atas unta mengikuti orang yang berjalan sewaktu di Mina dan Nabiyullah Shallallahu'alaihiwasallam menyaksikan, laki-laki tersebut berseru, \"Janganlah kalian berpuasa pada hari-hari ini (Tasyriq) karena hari tersebut adalah hari makan dan minum\". Qatadah berkata; \"(Hamzah bin 'Amr Al Aslami) menyebutkan bahwa laki-laki yang menyerukan tersebut adalah Bilal\"."
            },
            {
                "number": 829,
                "arab": "قَالَ حَدَّثَنَا عَتَّابٌ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ وَعَلِيُّ بْنُ إِسْحَاقَ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ الْمُبَارَكِ قَالَ أَخْبَرَنَا أُسَامَةُ بْنُ زَيْدٍ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ حَمْزَةَ أَنَّهُ سَمِعَ أَبَاهُ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَلَى ظَهْرِ كُلِّ بَعِيرٍ شَيْطَانٌ فَإِذَا رَكِبْتُمُوهَا فَسَمُّوا اللَّهَ عَزَّ وَجَلَّ ثُمَّ لَا تُقَصِّرُوا عَنْ حَاجَاتِكُمْ",
                "id": "Telah menceritakan kepada kami ['Attab] berkata; telah menceritakan kepada kami [Abdullah] dan ['Ali bin Ishaq] berkata; telah mengabarkan kepada kami [Abdullah] yaitu Ibnu Mubarak berkata; telah mengabarkan kepada kami [Usamah bin Zaid] berkata; telah mengabarkan kepadaku [Muhammad bin Hamzah] bahwa dia mendengar [bapaknya] berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Di atas pundak setiap unta terdapat setan, apabila kalian menaikinya, sebutlah nama Allah Azzawajalla, kemudian janganlah kalian menyepelekan kebutuhan kalian\""
            },
            {
                "number": 830,
                "arab": "قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ عَنْ عُثْمَانَ بْنِ عُمَيْرٍ عَنْ زَاذَانَ أَبِي عُمَرَ عَنْ عُلَيْمٍ قَالَكُنَّا جُلُوسًا عَلَى سَطْحٍ مَعَنَا رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَزِيدُ لَا أَعْلَمُهُ إِلَّا عَبْسًا الْغِفَارِيَّ وَالنَّاسُ يَخُوضُونَ فِي الطَّاعُونِ فَقَالَ عَبَسٌ يَا طَاعُونُ خُذْنِي ثَلَاثًا يَقُولُهَا فَقَالَ لَهُ عُلَيْمٌ لِمَ تَقُولُ هَذَا أَلَمْ يَقُلْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَتَمَنَّى أَحَدُكُمْ الْمَوْتَ فَإِنَّهُ عِنْدَ انْقِطَاعِ عَمَلِهِ لَا يُرَدُّ فَيُسْتَعْتَبَ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بَادِرُوا بِالْمَوْتِ سِتًّا إِمْرَةَ السُّفَهَاءِ وَكَثْرَةَ الشَّرْطِ وَبَيْعَ الْحُكْمِ وَاسْتِخْفَافًا بِالدَّمِ وَقَطِيعَةَ الرَّحِمِ وَنَشْئًا يَتَّخِذُونَ الْقُرْآنَ مَزَامِيرَ يُقَدِّمُونَهُ يُغَنِّيهِمْ وَإِنْ كَانَ أَقَلَّ مِنْهُمْ فِقْهًا",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Yazid bin Harun] berkata; telah menceritakan kepada kami [Syarik bin Abdullah] dari ['Utsman bin 'Umair] dari [Zadzan Abu 'Umar] dari ['Ulaim] berkata; kami duduk di atas atap beserta seorang laki-laki dari sahabat Nabi Shallallahu'alaihiwasallam. [Yazid] berkata; saya tidak mengetahuinya kecuali ['Abbas] Al Giffary, manusia pada saat itu sedang terkena wabah penyakit thaun. 'Abbas berkata; \"Wahai Penyakit Thaun, ambillah aku\", dia mengulangnya sampai tiga kali. Lalu 'Ulaim berkata kepadanya, \"Mengapa engkau ucapkan perkataan semacam itu! Bukankah Rasulullah Shallallahu'alaihiwasallam bersabda: 'Jangan kalian berangAn angan untuk mati karena ketika itu amal diputus dan tidak dapat dikembalikan', sehingga dia binasa.\" lalu dia berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Bersegeralah melakukan enam hal sebelum datang kematian: dari pemimpin bodoh, banyaknya ajudan, hokum diperjualbelikan, darah tertumpah dengan mudah, saling memotong tali silaturrahmi, dan keturunan yang menjadikan Al Qur'an bagaikan seruling, mereka dahulukan siapa saja yang bisa menyanyikannya walaupun dia adalah orang yang tidak mengerti persoalan agama\""
            },
            {
                "number": 831,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا مُسْلِمُ بْنُ خَالِدٍ عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ عَنْ أَبِيهِ عَنْ شُقْرَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَرَأَيْتُهُ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَوَجِّهًا إِلَى خَيْبَرَ عَلَى حِمَارٍ يُصَلِّي عَلَيْهِ يُومِئُ إِيمَاءً",
                "id": "Telah menceritakan kepada kami [Asad bin 'Amir] berkata; telah menceritakan kepada kami [Muslim bin Khalid] dari ['Amr bin Yahya Al Muzani] dari [Bapaknya] dari [Syuqran] budak Rasulullah Shallallahu'alaihiwasallam berkata; saya melihat Rasulullah Shallallahu'alaihiwasallam sholat dengan memberi isyarat di atas untanya menuju ke Khaibar\"."
            },
            {
                "number": 832,
                "arab": "قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا هَمَّامُ بْنُ يَحْيَى عَنِ الْقَاسِمِ بْنِ عَبْدِ الْوَاحِدِ الْمَكِّيِّ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُبَلَغَنِي حَدِيثٌ عَنْ رَجُلٍ سَمِعَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاشْتَرَيْتُ بَعِيرًا ثُمَّ شَدَدْتُ عَلَيْهِ رَحْلِي فَسِرْتُ إِلَيْهِ شَهْرًا حَتَّى قَدِمْتُ عَلَيْهِ الشَّامَ فَإِذَا عَبْدُ اللَّهِ بْنُ أُنَيْسٍ فَقُلْتُ لِلْبَوَّابِ قُلْ لَهُ جَابِرٌ عَلَى الْبَابِ فَقَالَ ابْنُ عَبْدِ اللَّهِ قُلْتُ نَعَمْ فَخَرَجَ يَطَأُ ثَوْبَهُ فَاعْتَنَقَنِي وَاعْتَنَقْتُهُ فَقُلْتُ حَدِيثًا بَلَغَنِي عَنْكَ أَنَّكَ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْقِصَاصِ فَخَشِيتُ أَنْ تَمُوتَ أَوْ أَمُوتَ قَبْلَ أَنْ أَسْمَعَهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ أَوْ قَالَ الْعِبَادُ عُرَاةً غُرْلًا بُهْمًا قَالَ قُلْنَا وَمَا بُهْمًا قَالَ لَيْسَ مَعَهُمْ شَيْءٌ ثُمَّ يُنَادِيهِمْ بِصَوْتٍ يَسْمَعُهُ مِنْ قُرْبٍ أَنَا الْمَلِكُ أَنَا الدَّيَّانُ وَلَا يَنْبَغِي لِأَحَدٍ مِنْ أَهْلِ النَّارِ أَنْ يَدْخُلَ النَّارَ وَلَهُ عِنْدَ أَحَدٍ مِنْ أَهْلِ الْجَنَّةِ حَقٌّ حَتَّى أَقُصَّهُ مِنْهُ وَلَا يَنْبَغِي لِأَحَدٍ مِنْ أَهْلِ الْجَنَّةِ أَنْ يَدْخُلَ الْجَنَّةَ وَلِأَحَدٍ مِنْ أَهْلِ النَّارِ عِنْدَهُ حَقٌّ حَتَّى أَقُصَّهُ مِنْهُ حَتَّى اللَّطْمَةُ قَالَ قُلْنَا كَيْفَ وَإِنَّا إِنَّمَا نَأْتِي اللَّهَ عَزَّ وَجَلَّ عُرَاةً غُرْلًا بُهْمًا قَالَ بِالْحَسَنَاتِ وَالسَّيِّئَاتِ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Yazid bin Harun] berkata; telah mengabarkan kepada kami [Hammad bin Yahya] dari [Al Qasim bin Abdul Wahid Al Maki] dari [Abdullah bin Muhammad bin 'Aqil] mendengar [Jabir bin Abdullah] berkata; telah sampai hadis kepadaku dari seorang laki-laki yang mendengar dari Rasulullah Shallallahu'alaihiwasallam, kontan saya membeli unta, kuikat kencang perbekalanku dan kuarahkan perjalananku untuk menemuinya selama satu bulan. Selanjutnya aku menemuinya tepatnya di Syam, tak tahunya orang itu adalah [Abdullah bin Unais]. Saya berkata kepada penjaga pintu, \"Katakan padanya, Jabir sedang menunggunya di di depan pintu\". Lalu dia bertanya, kamu adalah Ibnu Abdullah, saya menjawab, Ya. Lalu dia keluar dengan menginjak pakaiannya, dia memelukku dan sebaliknya aku juga memeluknya, saya berkata; telah sampai kepadaku suatu hadis darimu, kamu mendengar Rasulullah Shallallahu'alaihiwasallam tentang perkara qishas, saya khawatir apabila engkau meninggal ataupun saya meninggal sebelum saya dapat mendengarnya. (Abdullah bin Unais) berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Manusia akan dikumpulkan pada Hari Kiamat\", --atau bersabda dengan redaksi para hamba--, dalam keadaan telanjang, tidak berkhitan dan dalam keadaan buhman\", lalu kami bertanya, \"Apakah buhman itu?\" Beliau bersabda: \"Tidak memakai pakaian sehelai benangpun\", lalu ada suara yang memanggil mereka dari dekat, 'Aku adalah raja dan Aku Dayyan (pemberi pembalasan) tidaklah patut bagi seorang penduduk neraka untuk masuk neraka sedangkan dia mempunyai hak atas seseorang dari penduduk surga sampai Aku memberikan haknya. Juga tidaklah patut seseorang dari penduduk surga untuk masuk syurga sedangkan seseorang dari penduduk nereka mempunyai hak atas dirinya sampai Aku memberikan haknya. Sampai satu tamparan sekalipun. (Jabir bin Abdullah) berkata; kami bertanya, Bagaimana ini? Kami mendatangi Allah Azzawajalla dalam keadaan telanjang dan tidak berkhitan, dan tidak memakai sehelai benangpun? maka beliau bersabda: \"Kalian datang dengan kebaikan dan keburukan\"."
            },
            {
                "number": 833,
                "arab": "قَالَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا لَيْثٌ عَنْ هِشَامِ بْنِ سَعْدٍ عَنْ مُحَمَّدِ بْنِ زَيْدِ بْنِ الْمُهَاجِرِ بْنِ قُنْفُذٍ التَّيْمِيِّ عَنْ أَبِي أُمَامَةَ الْأَنْصَارِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أُنَيْسٍ الْجُهَنِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ أَكْبَرِ الْكَبَائِرِ الشِّرْكَ بِاللَّهِ وَعُقُوقَ الْوَالِدَيْنِ وَالْيَمِينَ الْغَمُوسَ وَمَا حَلَفَ حَالِفٌ بِاللَّهِ يَمِينًا صَبْرًا فَأَدْخَلَ فِيهَا مِثْلَ جَنَاحِ بَعُوضَةٍ إِلَّا جَعَلَهُ اللَّهُ نُكْتَةً فِي قَلْبِهِ إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Yunus bin Muhammad] berkata; telah menceritakan kepada kami [Laits] dari [Hisyam bin Sa'ad] dari [Muhammad bin Zaid bin Al Muhajir bin Qunfudz At-Taimi] dari [Abu Umamah Al Anshari] dari [Abdullah bin Unais Al Juhani] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Yang termasuk dosa-dosa paling besar adalah: Menyekutukan Allah, durhaka kepada orang tua, dan sumpah bohong. Tidaklah bersumpah seseorang dengan nama Allah di hadapan seorang hakim walau hanya untuk perkara sepele yang hanya senilai sayap nyamuk kecuali Allah akan membuat coretan hitam dalam hatinya sampai Hari Kiamat nanti\"."
            },
            {
                "number": 834,
                "arab": "حَدَّثَنَا أَبُو سَلَمَةَ الْخُزَاعِيُّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ يَعْنِي الْمَخْرَمِيَّ عَنْ يَزِيدَ بْنِ الْهَادِ عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ عَنْ عَبْدِ اللَّهِ بْنِ أُنَيْسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُمْ وَسَأَلُوهُ عَنْ لَيْلَةٍ يَتَرَاءَوْنَهَا فِي رَمَضَانَ قَالَ لَيْلَةُ ثَلَاثٍ وَعِشْرِينَ",
                "id": "Telah menceritakan kepada kami [Abu Salamah Al Khuza'i] berkata; telah menceritakan kepada kami [Abdullah bin Ja'far] yaitu Al Makhrami, dari [Yazid bin Al Had] dari [Abu Bakar bin Hazm] dari [Abdullah bin Unais] Nabi Shallallahu'alaihiwasallam bersabda kepada mereka. Mereka bertanya kepada beliau tentang malam yang mereka saling melihatnya (malam lailatul qodar, pent) waktu Bulan ramadhan. Beliau bersabda: \"Malam ke dua puluh tiga\"."
            },
            {
                "number": 835,
                "arab": "قَالَ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ أَبُو ضَمْرَةَ قَالَ حَدَّثَنِي الضَّحَّاكُ بْنُ عُثْمَانَ عَنْ أَبِي النَّضْرِ مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ أُنَيْسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَأَيْتُ لَيْلَةَ الْقَدْرِ ثُمَّ أُنْسِيتُهَا وَأُرَانِي صَبِيحَتَهَا أَسْجُدُ فِي مَاءٍ وَطِينٍ فَمُطِرْنَا لَيْلَةَ ثَلَاثٍ وَعِشْرِينَ فَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْصَرَفَ وَإِنَّ أَثَرَ الْمَاءِ وَالطِّينِ عَلَى جَبْهَتِهِ وَأَنْفِهِ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Anas bin 'Iyadl, Abu Dlamrah] berkata; telah menceritakan kepadaku [Al Dlahaq bin 'Utsman] dari [Abu Nadlr] budak 'Umar bin 'ubaidhullah dari [Busr bin Sa'id] dari [Abdullah bin Unais] Rasulullah Shallallahu'alaihiwasallam bersabda: \"Saya bermimpi malam Lailaitul Qadr lalu saya lupa, saya mengingatnya pada pagi harinya. Saya bersujud pada air dan tanah\". Lalu kami mendapatkan hujan pada malam ke dua puluh tiga. Lalu Rasulullah Shallallahu'alaihiwasallam sholat bersama kami. Dan beliau pergi. Bekas air dan tanah terlihat pada keningnya dan hidungnya."
            },
            {
                "number": 836,
                "arab": "قَالَ حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنِي أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي مُعَاذُ بْنُ عَبْدِ اللَّهِ بْنِ خُبَيْبٍ الْجُهَنِيُّ عَنْ أَخِيهِ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ خُبَيْبٍ قَالَكَانَ رَجُلٌ فِي زَمَانِ عُمَرَ بْنِ الْخَطَّابِ قَدْ سَأَلَهُ فَأَعْطَاهُ قَالَ جَلَسَ مَعَنَا عَبْدُ اللَّهُ بْنُ أُنَيْسٍ صَاحِبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَجْلِسِهِ فِي مَجْلِسِ جُهَيْنَةَ قَالَ فِي رَمَضَانَ قَالَ فَقُلْنَا لَهُ يَا أَبَا يَحْيَى سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذِهِ اللَّيْلَةِ الْمُبَارَكَةِ مِنْ شَيْءٍ فَقَالَ نَعَمْ جَلَسْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي آخِرِ هَذَا الشَّهْرِ فَقُلْنَا لَهُ يَا رَسُولَ اللَّهِ مَتَى نَلْتَمِسُ هَذِهِ اللَّيْلَةَ الْمُبَارَكَةَ قَالَ الْتَمِسُوهَا هَذِهِ اللَّيْلَةَ وَقَالَ وَذَلِكَ مَسَاءَ لَيْلَةِ ثَلَاثٍ وَعِشْرِينَ فَقَالَ لَهُ رَجُلٌ مِنْ الْقَوْمِ وَهِيَ إِذًا يَا رَسُولَ اللَّهِ أَوَّلُ ثَمَانٍ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهَا لَيْسَتْ بِأَوَّلِ ثَمَانٍ وَلَكِنَّهَا أَوَّلُ السَّبْعِ إِنَّ الشَّهْرَ لَا يَتِمُّ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Ya'qub] berkata; telah menceritakan kepadaku [bapakku] dari [Ibnu Ishaq] berkata; telah menceritakan kepadaku [Mu'adz bin Abdullah bin Hubaib Al Juhani] dari [saudaranya, Abdullah bin Abdullah Khubaib] berkata; ada seorang laki-laki pada jaman 'Umar bin Al Khattab meminta-minta kepada beliau, lalu beliau memberinya. (Abdullah bin Abdullah Khubaib) berkata; [Abdullah bin Unais] yaitu salah seorang sahabat Rasulullah Shallallahu'alaihiwasallam duduk bersama kami di majlis Juhainah. Dia berkata; pada bulan ramadhan. Kami pun bertanya ' Hai Abu Yahya, adakah kamu mendengar suatu hal dari Rasulullah Shallallahu'alaihiwasallam di malam yang penuh barakah ini? 'Ya' jawabnya. Pernah kami duduk-duduk bersama Rasulullah Shallallahu'alaihiwasallam di akhir bulan seperti ini. Kami pun bertanya kepada beliau 'Hai Rasulullah, kapan kami bisa mendapatkan malam yang penuh barakah (lailatul qadar)? Beliau menjawab 'Carilah seperti malam ini'. Ia katakan, itu terjadi sore hari di malam dua puluh tiga. Lantas seseorang bertanya 'kalau begitu maksudnya di malam ke delapan begitu? Lantas Rasulullah Shallallahu'alaihiwasallam bersabda 'Bukan awal malam ke delapan namun malam ketujuh, sebab sebulan itu tidak genap.'"
            },
            {
                "number": 837,
                "arab": "قَالَ حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي قَالَ عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرِ بْنِ الزُّبَيْرِ عَنِ ابْنِ عَبْدِ اللَّهِ بْنِ أُنَيْسٍ عَنِ أَبِيهِ قَالَدَعَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّهُ قَدْ بَلَغَنِي أَنَّ خَالِدَ بْنَ سُفْيَانَ بْنِ نُبَيْحٍ يَجْمَعُ لِي النَّاسَ لِيَغْزُوَنِي وَهُوَ بِعُرَنَةَ فَأْتِهِ فَاقْتُلْهُ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ انْعَتْهُ لِي حَتَّى أَعْرِفَهُ قَالَ إِذَا رَأَيْتَهُ وَجَدْتَ لَهُ أُقْشَعْرِيَرَةً قَالَ فَخَرَجْتُ مُتَوَشِّحًا بِسَيْفِي حَتَّى وَقَعْتُ عَلَيْهِ وَهُوَ بِعُرَنَةَ مَعَ ظُعُنٍ يَرْتَادُ لَهُنَّ مَنْزِلًا وَحِينَ كَانَ وَقْتُ الْعَصْرِ فَلَمَّا رَأَيْتُهُ وَجَدْتُ مَا وَصَفَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْأُقْشَعْرِيرَةِ فَأَقْبَلْتُ نَحْوَهُ وَخَشِيتُ أَنْ يَكُونَ بَيْنِي وَبَيْنَهُ مُحَاوَلَةٌ تَشْغَلُنِي عَنْ الصَّلَاةِ فَصَلَّيْتُ وَأَنَا أَمْشِي نَحْوَهُ أُومِئُ بِرَأْسِي الرُّكُوعَ وَالسُّجُودَ فَلَمَّا انْتَهَيْتُ إِلَيْهِ قَالَ مَنْ الرَّجُلُ قُلْتُ رَجُلٌ مِنْ الْعَرَبِ سَمِعَ بِكَ وَبِجَمْعِكَ لِهَذَا الرَّجُلِ فَجَاءَكَ لِهَذَا قَالَ أَجَلْ أَنَا فِي ذَلِكَ قَالَ فَمَشَيْتُ مَعَهُ شَيْئًا حَتَّى إِذَا أَمْكَنَنِي حَمَلْتُ عَلَيْهِ السَّيْفَ حَتَّى قَتَلْتُهُ ثُمَّ خَرَجْتُ وَتَرَكْتُ ظَعَائِنَهُ مُكِبَّاتٍ عَلَيْهِ فَلَمَّا قَدِمْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَآنِي فَقَالَ أَفْلَحَ الْوَجْهُ قَالَ قُلْتُ قَتَلْتُهُ يَا رَسُولَ اللَّهِ قَالَ صَدَقْتَ قَالَ ثُمَّ قَامَ مَعِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَخَلَ فِي بَيْتِهِ فَأَعْطَانِي عَصًا فَقَالَ أَمْسِكْ هَذِهِ عِنْدَكَ يَا عَبْدَ اللَّهِ بْنَ أُنَيْسٍ قَالَ فَخَرَجْتُ بِهَا عَلَى النَّاسِ فَقَالُوا مَا هَذِهِ الْعَصَا قَالَ قُلْتُ أَعْطَانِيهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمَرَنِي أَنْ أَمْسِكَهَا قَالُوا أَوَلَا تَرْجِعُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَسْأَلَهُ عَنْ ذَلِكَ قَالَ فَرَجَعْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ لِمَ أَعْطَيْتَنِي هَذِهِ الْعَصَا قَالَ آيَةٌ بَيْنِي وَبَيْنَكَ يَوْمَ الْقِيَامَةِ إِنَّ أَقَلَّ النَّاسِ الْمُتَخَصِّرُونَ يَوْمَئِذٍ يَوْمَ الْقِيَامَةِفَقَرَنَهَا عَبْدُ اللَّهِ بِسَيْفِهِ فَلَمْ تَزَلْ مَعَهُ حَتَّى إِذَا مَاتَ أَمَرَ بِهَا فَصُبَّتْ مَعَهُ فِي كَفَنِهِ ثُمَّ دُفِنَا جَمِيعًا قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ عَنْ بَعْضِ وَلَدِ عَبْدِ اللَّهِ بْنِ أُنَيْسٍ عَنْ أَبِي عَبْدِ اللَّهِ بْنِ أُنَيْسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَهُ إِلَى خَالِدِ بْنِ سُفْيَانَ بْنِ نُبَيْحٍ الْهُذَلِيِّ لِيَقْتُلَهُ وَكَانَ يُجَمِّعُ لِقِتَالِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَأَتَيْتُهُ بِعُرَنَةَ وَهُوَ فِي ظَهْرٍ لَهُ وَقَدْ دَخَلَ وَقْتُ الْعَصْرِ فَخِفْتُ أَنْ يَكُونَ بَيْنِي وَبَيْنَهُ مُحَاوَلَةٌ تَشْغَلُنِي عَنْ الصَّلَاةِ قَالَ فَصَلَّيْتُ وَأَنَا أَمْشِي أُومِئُ إِيمَاءً فَلَمَّا انْتَهَيْتُ إِلَيْهِ قُلْتُ كَذَا وَكَذَا حَتَّى ذَكَرَ الْحَدِيثَ ثُمَّ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ بِقَتْلِهِ إِيَّاهُ وَذَكَرَ الْحَدِيثَ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [bapakku] berkata; dari [Ibnu Ishaq] berkata; telah menceritakan kepadaku [Muhammad bin Ja'far bin Al Zubair] dari [Ibnu Abdullah bin Unais] dari [bapaknya] berkata; Rasulullah Shallallahu'alaihiwasallam memanggilku dan bersabda: \"Telah sampai berita kepadaku bahwa Khalid bin Sufyan bin Nubaih mengumpulkan khalayak manusia untuk memerangiku, dia berada di 'Uranah (nama tempat, pent) bunuhlah dia. Berkata (Abdullah bin Unais), \"Wahai Rasulullah, jelaskan sifat-sifatnya kepadaku hingga aku dapat mengenalnya\". Beliau bersabda: \"Apabila kamu mendapatkanya, dia dalam kedaaan tubuh yang merinding dan bergetar\". (Abdullah bin Unais) berkata; saya keluar dan menutupi tubuhku dengan pedang hingga aku bertemu langsung denganya di 'Uranah pada waktu ashar dengan isterinya dan memilimilih sebuah persinggahanuntuk istrinya. Aku melihat sifat sebagaimana yang disebutkan Rasulullah Shallallahu'alaihiwasallam dari tubuh yang merinding dan bergetar. Aku berusaha menemuinya, dan aku sempat khawatir jangAn jangan ada perlawanan darinya sehingga menyibukkanku dari sholat. Aku pun berjalan di depannya dan sholat dengan isyarat kepala dan ruku serta sujud, ketika aku telah menyelesaikan keperluanku, Dia bertanya, \"Siapakah laki-laki itu?\" (maksudnya menanyakan Abdullah bin Unais, pent) (Abdullah bin Unais) menjawabnya, \"Seorang laki-laki Arab yang telah mendengarmu dan tujuanmu mengumpulkan orang untuk membunuh Muhammad, maka dia (maksudnya dirinya) datang untuk membantumu perihal urusanmu itu\", dia berkata; \"Tepat sekali, aku memang sedang mengurusi hal itu (ingin membunuh Muhammad, pent) \" lalu (Abdullah bin Unais) berkata; lalu saya berjalan sebentar bersamanya, begitu ketika aku mendapatkan kesempatan untuk membunuhnya, aku bawakan pedang dan aku bunuh dia. Kemudian aku keluar dan meninggalkan para isterinya yang meratapinya. Ketika saya menemui Rasulullah Shallallahu'alaihiwasallam dan beliau melihatku, beliau bersabda: \"Telah beruntung wajahmu\" (ungkapan kegembiraan, pent) (Abdullah bin Unais) berkata; \"Wahai Rasulullah, saya telah membunuhnya\", Beliau bersabda: \"Engkau benar\" kemudian beliau berdiri bersamaku, dan beliau masuk ke rumah dan memberiku tongkat seraya bersabda: \"Peganglah tongkat ini wahai Abdullah bin Unais! (Abdullah bin Unais) berkata; lalu saya pulang dengan membawa tongkat tersebut sehingga orang-orang bertanya, \"Untuk apa tongkatmu itu wahai Abdullah bin Unais?\", maka aku berkata; \"Tongkat ini adalah pemberian Rasulullah Shallallahu'alaihiwasallam dan beliau memerintahkanku untuk memegangnya\". Mereka berkata; \"Apakah tidak lebih baik apabila engkau kembali kepada Rasulullah Shallallahu'alaihiwasallam dan menanyakan perihal tongkat itu? (Abdullah bin Unais) berkata; lalu saya kembali kepada Rasulullah Shallallahu'alaihiwasallam dan bertanya beliau, \"Wahai Rasulullah Shallallahu'alaihiwasallam mengapa engkau memberiku tongkat ini?\" Beliau menjawab, \"Ini adalah tanda antara aku dan dirimu pada waktu Hari Kiamat nanti, hari ketika sedikit manusia yang berjalan dengan berpegang tongkat, maka tongkat itu selalu menyertai Abdullah beserta dengan pedangnya dan selalu bersamanya sampai dia meninggal. Ketika dia meninggal, dia memerintahkan agar tongkat itu ditancapkan bersamanya dengan kain kafannya, yang kemudian dia dimakamkan bersama dengan tongkatnya. Telah menceritakan kepada kami [Yahya bin Adam] berkata; telah menceritakan kepada kami [Ibnu Abu Idris] dari [Muhammad bin Ishaq] dari [Muhammad bin Ja'far bin Az Zubair] dari [beberapa anak Abdullah bin Unais] dari [Abu Abdullah bin Unais] Rasulullah Shallallahu'alaihiwasallam menyuruhnya untuk membunuh Khalid bin Sufyan bin Nubaih Al Hudzailly yang dia mengumpulkan orang untuk membunuh Rasulullah Shallallahu'alaihiwasallam, maka aku menemuinya di 'Uranah ketika dia diatas tungganganya ketika waktu ashar. Aku khawatir jangAn jangan ada perlawanan atau duel antara aku dan dia sehingga melalaikanku dari sholat. Maka saya sholat dengan berjalan dan hanya memberi isyarat, ketika aku bertemu dengannya kuceritakan demikiAn demikian, hingga ia sebutkan dalam hadis kemudian datang pada Nabi Shallallahu'alaihiwasallam dan memberitahukannya tentang terbunuhnya dia, lalu dia menyebutkan hadis secara lengkap."
            },
            {
                "number": 838,
                "arab": "حَدَّثَنَا حَجَّاجٌ قَالَ حَدَّثَنِي شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أَبِي أُسَيْدٍ السَّاعِدِيِّ قَالَ أَبِي و قَالَ ابْنُ جَعْفَرٍ عَنْ أَبِي أُسَيْدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ دُورِ الْأَنْصَارِ بَنُو النَّجَّارِ ثُمَّ بَنُو عَبْدِ الْأَشْهَلِ ثُمَّ بَنُو الْحَارِثِ بْنِ الْخَزْرَجِ ثُمَّ بَنُو سَاعِدَةَ وَفِي كُلِّ دُورِ الْأَنْصَارِ خَيْرٌفَقَالَ سَعْدُ بْنُ عُبَادَةَ مَا أَرَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا قَدْ فَضَّلَ عَلَيْنَا فَقِيلَ قَدْ فَضَّلَكُمْ عَلَى كَثِيرٍ",
                "id": "Telah menceritakan kepada kami [Hajjaj] berkata; telah menceritakan kepadaku [Syu'bah] berkata; saya mendengar [Qatadah] dari [Anas bin Malik] dari [Abu Usaid As-Saidi] berkata; [bapakku] dan [Ibnu Ja'far] berkata; dari Abu Usaid berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Sebaik-baik rumah kaum Anshor adalah Bani Najjar, kemudian Bani Abdul Asyhal, kemudian Bani Al Harits bin Khajraj kemudian Bani Sa'idah dan setiap derajat kaum Anshar adalah baik\". Sa'ad bin 'Ubadah berkata; \"Aku tidak pernah melihat Rasulullah Shallallahu'alaihiwasallam kecuali memberi keutamaan kita atau telah memberi banyak keutamaan di antara yang lainnya\""
            },
            {
                "number": 839,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ أَبِي الزِّنَادِ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي أُسَيْدٍ السَّاعِدِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ الْأَنْصَارِ بَنُو النَّجَّارِ ثُمَّ بَنُو عَبْدِ الْأَشْهَلِ ثُمَّ بَنُو الْحَارِثِ بْنِ الْخَزْرَجِ ثُمَّ بَنُو سَاعِدَةَ ثُمَّ قَالَ وَفِي كُلِّ دُورِ الْأَنْصَارِ خَيْرٌ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Sufyan] dari [Abu Az Zinad] dari [Abu Salamah] dari [Abu Usaid As-Sa'idi] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Sebaik-baik rumah orang Anshar adalah Bani Najjar, kemudian Bani Abdul Asyhal, kemudian Bani Al Harits bin Khazraj, kemudian Bani Sa'idah\" kemudian berkata; \"Setiap derajat kaum Anshar adalah baik\"."
            },
            {
                "number": 840,
                "arab": "قَالَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ ذَكْوَانَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي أُسَيْدٍ السَّاعِدِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ دُورِ الْأَنْصَارِ بَنُو النَّجَّارِ ثُمَّ بَنُو عَبْدِ الْأَشْهَلِ ثُمَّ بَنُو الْحَارِثِ بْنِ الْخَزْرَجِ ثُمَّ بَنُو سَاعِدَةَ ثُمَّ قَالَ وَفِي كُلِّ دُورِ الْأَنْصَارِ خَيْرٌفَقَالَ سَعْدُ بْنُ عُبَادَةَ جَعَلَنَا رَابِعَ أَرْبَعَةٍ أَسْرِجُوا لِي حِمَارِي فَقَالَ ابْنُ أَخِيهِ أَتُرِيدُ أَنْ تَرُدَّ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَسْبُكَ أَنْ تَكُونَ رَابِعَ أَرْبَعَةٍ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah mengabarkan kepada kami [Abdurrazzaq] berkata; telah menceritakan kepada kami [Sufyan] dari [Abdullah bin Dzakwan] dari [Abu Salamah] dari [Abu Usaid As-Sa'idi] dari Nabi Shallallahu'alaihiwasallam, \"Sebaik-baik rumah Anshar adalah Bani Najjar, kemudian Bani Abdul Asyhal, kemudian Bani Al Harits bin Khazraj, kemudian Bani Sa'idah\" kemudian berkata; \"Setiap rumah kaum Anshar adalah baik\". Sa'ad bin 'Ubadah berkata; kami menjadikan urutan yang keempat adalah berilah pelana pada keledaiku. Anak saudaraku berkata; apakah kamu mau dikembalikan kepada Rasulullah Shallallahu'alaihiwasallam, cukuplah bagimu untuk urutan yang ke empat."
            },
            {
                "number": 841,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى قَالَ حَدَّثَنِي عَطَاءٌ رَجُلٌ كَانَ يَكُونُ بِالسَّاحِلِ عَنْ أَبِي أُسَيْدٍ أَوْ أَبِي أَسِيدِ بْنِ ثَابِتٍ شَكَّ سُفْيَانُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُوا الزَّيْتَ وَادَّهِنُوا بِالزَّيْتِ فَإِنَّهُ مِنْ شَجَرَةٍ مُبَارَكَةٍ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan] dari [Abdullah bin 'Isa] berkata; telah menceritakan kepadaku ['Atha`] orang yang berada di tepi pantai, dari [Abu Usaid] atau Abu Asid bin Tsabit, Sufyan ragu, Nabi Shallallahu'alaihiwasallam bersabda: \"Makanlah buah zaitun dan dan pakailah minyak rambut dari buah zaitun, karena buah itu dari pohon yang berbarakah\""
            },
            {
                "number": 842,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى عَنْ عَطَاءٍ الشَّامِيِّ عَنْ أَبِي أَسِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُوا الزَّيْتَ وَادَّهِنُوا بِهِ فَإِنَّهُ مِنْ شَجَرَةٍ مُبَارَكَةٍ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan] dari [Abdullah bin 'Isa] dari ['Atho`Asy-Syami] dari [Abu Asid] dengan Rasulullah Shallallahu'alaihiwasallam bersabda: \"Makanlah buah zaitun dan dan pakailah minyak rambut dari buah zaitun, karena buah itu dari pohon yang berbarakah\""
            },
            {
                "number": 843,
                "arab": "قَالَ حَدَّثَنَا أَبُو عَامِرٍ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدِ بْنِ سُوَيْدٍ الْأَنْصَارِيِّ قَالَ سَمِعْتُ أَبَا حُمَيْدٍ وَأَبَا أُسَيْدٍ يَقُولَانِقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ أَحَدُكُمْ الْمَسْجِدَ فَلْيَقُلْ اللَّهُمَّ افْتَحْ لَنَا أَبْوَابَ رَحْمَتِكَ وَإِذَا خَرَجَ فَلْيَقُلْ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Abu 'Amir] berkata; telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Rabi'ah bin Abu Abdurrohman] dari [Abdul Malik bin Sa'id bin Suwaid Al Anshari], berkata; saya mendengar [Abu Humaid] dan [Abu Usaid] keduanya berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Apabila salah seorang dari kalian masuk masjid hendaklah membaca, 'ALLAHUMMAFTAH LI ABWABA RAHMATIKA' (Ya Allah bukakanlah untukku pintu-pintu rahmat-Mu) dan apabila keluar hendaklah dia berdoa, 'ALLAHUMMA INNI ASA`LUKA MIN FADZLIK' (Ya Allah, aku memohon dari keutamaAn Mu) \"."
            },
            {
                "number": 844,
                "arab": "قَالَ حَدَّثَنَا أَبُو عَامِرٍ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدِ بْنِ سُوَيْدٍ عَنْ أَبِي حُمَيْدٍ وَعَنْ أَبِي أُسَيْدٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا سَمِعْتُمْ الْحَدِيثَ عَنِّي تَعْرِفُهُ قُلُوبُكُمْ وَتَلِينُ لَهُ أَشْعَارُكُمْ وَأَبْشَارُكُمْ وَتَرَوْنَ أَنَّهُ مِنْكُمْ قَرِيبٌ فَأَنَا أَوْلَاكُمْ بِهِ وَإِذَا سَمِعْتُمْ الْحَدِيثَ عَنِّي تُنْكِرُهُ قُلُوبُكُمْ وَتَنْفِرُ أَشْعَارُكُمْ وَأَبْشَارُكُمْ وَتَرَوْنَ أَنَّهُ مِنْكُمْ بَعِيدٌ فَأَنَا أَبْعَدُكُمْ مِنْهُ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Abu 'Amir] berkata; telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Rabi'ah bin Abu Abdurrahman] dari [Abdul Malik bin Sa'id bin Suwaid] dari [Abu Humaid] dan dari [Abu Usaid] Nabi Shallallahu'alaihiwasallam, bersabda: \"Jika kalian mendengar sebuah hadis dariku, hati kalian membenarkan dan perasaan kalian menjadi halus serta kalian memandang hadis tersebut dekat dengan kalian maka aku menjadi dekat dengan kalian. Tapi jika kalian mendengar hadis dariku dan hati kalian mengingkarinya, perasaan kalian menjadi keras karenanya dan kalian memandang hadis sebagai sesuatu yang jauh dari kalian, maka aku akan jauh dari kalian\"."
            },
            {
                "number": 845,
                "arab": "قَالَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْغَسِيلِ قَالَ حَدَّثَنِي أَسِيدُ بْنُ عَلِيٍّ عَنْ أَبِيهِ عَلِيِّ بْنِ عُبَيْدٍ عَنْ أَبِي أُسَيْدٍ صَاحِبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ بَدْرِيًّا وَكَانَ مَوْلَاهُمْ قَالَ قَالَ أَبُو أُسَيْدٍبَيْنَمَا أَنَا جَالِسٌ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَهُ رَجُلٌ مِنْ الْأَنْصَارِ فَقَالَ يَا رَسُولَ اللَّهِ هَلْ بَقِيَ عَلَيَّ مِنْ بِرِّ أَبَوَيَّ شَيْءٌ بَعْدَ مَوْتِهِمَا أَبَرُّهُمَا بِهِ قَالَ نَعَمْ خِصَالٌ أَرْبَعَةٌ الصَّلَاةُ عَلَيْهِمَا وَالِاسْتِغْفَارُ لَهُمَا وَإِنْفَاذُ عَهْدِهِمَا وَإِكْرَامُ صَدِيقِهِمَا وَصِلَةُ الرَّحِمِ الَّتِي لَا رَحِمَ لَكَ إِلَّا مِنْ قِبَلِهِمَا فَهُوَ الَّذِي بَقِيَ عَلَيْكَ مِنْ بِرِّهِمَا بَعْدَ مَوْتِهِمَا",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Yunus bin Muhammad] berkata; telah menceritakan kepada kami [Abdurrohman bin Al Ghasil] berkata; telah menceritakan kepadaku [Asid bin 'Ali] dari [bapaknya, 'Ali bin 'Ubaid] dari [Abu Usaid], sahabat Rasulullah Shallallahu'alaihiwasallam, Ahli Badar, dan dia termasuk maula mereka, berkata; Abu Usaid berkata; Ketika aku duduk di samping Rasulullah Shallallahu'alaihiwasallam, tiba-tiba seorang laki-laki Anshar datang dan berkata; Wahai Rasulullah Shallallahu'alaihiwasallam apakah masih tersisa kewajiban atasku untuk berbuat baik kepada orang tuaku setelah kematian mereka berdua?. Beliau menjawab 'Ya', masih tersisa empat perkara yaitu: mendoakan untuk mereka berdua, meminta ampunan mereka, memenuhi janji mereka yang belum terselesaikan dan memuliakan temAn teman mereka serta silaturrahim yang sebenarnya tidak berhubungan dengan kamu kecuali dari jalur mereka. Itulah semua yang tersisa dari kewajibanmu untuk berbuat kebaikan kepada orang tuamu setelah mereka meninggal \""
            },
            {
                "number": 846,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الزُّبَيْرِيُّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْغَسِيلِ عَنْ حَمْزَةَ بْنِ أَبِي أُسَيْدٍ عَنْ أَبِيهِ وَعَبَّاسِ بْنِ سَهْلٍ عَنْ أَبِيهِ قَالَامَرَّ بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابٌ لَهُ فَخَرَجْنَا مَعَهُ حَتَّى انْطَلَقْنَا إِلَى حَائِطٍ يُقَالُ لَهُ الشَّوْطُ حَتَّى انْتَهَيْنَا إِلَى حَائِطَيْنِ مِنْهُمَا فَجَلَسْنَا بَيْنَهُمَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْلِسُوا وَدَخَلَ هُوَ وَقَدْ أُوتِيَ بِالْجَوْنِيَّةِ فِي بَيْتِ أُمَيْمَةَ بِنْتِ النُّعْمَانِ بْنِ شَرَاحِيلَ وَمَعَهَا دَايَةٌ لَهَا فَلَمَّا دَخَلَ عَلَيْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هَبِي لِي نَفْسَكِ قَالَتْ وَهَلْ تَهَبُ الْمَلِكَةُ نَفْسَهَا لِلسُّوقَةِ قَالَتْ إِنِّي أَعُوذُ بِاللَّهِ مِنْكَ قَالَ لَقَدْ عُذْتِ بِمُعَاذٍ ثُمَّ خَرَجَ عَلَيْنَا فَقَالَ يَا أَبَا أُسَيْدٍ اكْسُهَا رَازِقِيَّتَيْنِ وَأَلْحِقْهَا بِأَهْلِهَاقَالَ وَقَالَ غَيْرُ أَبِي أَحْمَدَ امْرَأَةٌ مِنْ بَنِي الْجَوْنِ يُقَالُ لَهَا أَمِينَةُ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Muhammad bin Abdullah Az Zubairi] berkata; telah menceritakan kepada kami [Abdurrahman Al Ghasil] dari [Hamzah bin Abu Usaid] dari [bapaknya] dan ['Abbas bin Sahal] dari [bapaknya] mereka berdua berkata; Rasulullah Shallallahu'alaihiwasallam dan para sahabatnya melewati mereka, lalu kami ikut keluar bersama mereka hingga berhenti di sebuah kebun yang disebut Syauth dan kami berhenti dan duduk di antara dua kebun tersebut. Rasulullah Shallallahu'alaihiwasallam bersabda: \"Duduklah kalian!\" Dan beliau diserahi seorang perempuan (untuk dinikahi) dari Kabilah Jaun di rumah Umaimah binti An Nu'man bin Syarahbil, dan perempuan bidan. Ketika Rasulullah Shallallahu'alaihiwasallam menemuinya, beliau bersabda: \"Serahkanlah dirimu untukku\" perempuan itu menjawab, \"Apakah seorang ratu perempuan menyerahkan dirinya untuk laki-laki jelata?\" dan berkata; \"Aku berlindung kepada Allah dari dirimu\". (Rasulullah Shallallahu'alaihiwasallam) menjawab, \"Sesungguhnya engkau telah berlindung kepada Sang Pelindung\", kemudian (Rasulullah Shallallahu'alaihiwasallam) menemui kami dan berkata; \"Wahai Abu Usaid pakaikanlah untuknya dua lapis pakaian yang berwarna putih dan pulangkanlah dia kepada keluarganya\". ('Abbas bin Sahal) berkata; selain Abu Ahmad berkata; seorang wanita dari Bani Al Jaun yang bernama Aminah."
            },
            {
                "number": 847,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي حَازِمٍ قَالَ سَمِعْتُ سَهْلًا يَقُولُأَتَى أَبُو أُسَيْدٍ السَّاعِدِيُّ فَدَعَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي عُرْسِهِ فَكَانَتْ امْرَأَتُهُ خَادِمَهُمْ يَوْمَئِذٍ وَهِيَ الْعَرُوسُ قَالَ تَدْرُونَ مَا سَقَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْقَعَتْ تَمَرَاتٍ مِنْ اللَّيْلَةِ فِي تَوْرٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ya'qub bin Abdurrahman] dari [Abu Hazm] berkata; saya mendengar [Sahal] berkata; Abu Usaid As-Sai'di datang dan memanggil Rasulullah Shallallahu'alaihiwasallam di tempat pelaminannya, adapun istri Abu Usaid membantu mereka pada hari ketika dia menjadi pengantin. (Sahal) berkata 'Apakah kalian mengetahui apa yang perempuan itu tuangkan kepada Rasulullah Shallallahu'alaihiwasallam? sesungguhnya dia memasukkan kurma dalam sebuah kuali untuk direndam\""
            },
            {
                "number": 848,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ قَالَ عَبْد اللَّهِ وَسَمِعْتُهُ أَنَا مِنْ هَارُونَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ أَنَّ مُوسَى بْنَ جُبَيْرٍ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحُبَابِ الْأَنْصَارِيَّ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ أُنَيْسٍ حَدَّثَهُأَنَّهُمْ تَذَاكَرُوا هُوَ وَعُمَرُ بْنُ الْخَطَّابِ يَوْمًا الصَّدَقَةَ فَقَالَ عُمَرُ أَلَمْ تَسْمَعْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ ذَكَرَ غُلُولَ الصَّدَقَةِ إِنَّهُ مَنْ غَلَّ مِنْهَا بَعِيرًا أَوْ شَاةً أُتِيَ بِهِ يَحْمِلُهُ يَوْمَ الْقِيَامَةِ قَالَ عَبْدُ اللَّهِ بْنُ أُنَيْسٍ بَلَى",
                "id": "Telah menceritakan kepada kami [Harun bin Makruf] Abdullah berkata; dan saya mendengarnya dari [Harun] berkata; telah menceritakan kepada kami [Ibnu Wahb] berkata; telah menceritakan kepada kami ['Amr bin Al Harits] [Musa bin Jubair] menceritakannya [Abdullah bin Abdurrahman bin Al Habab Al Anshary] menceritakannya, [Abdullah bin Unais] menceritakan kepadanya bahwa pada suatu hari dia dan 'Umar bin Khattab teringat perkara zakat. ['Umar] berkata; tidakkah engkau mendengar Rasulullah Shallallahu'alaihiwasallam ketika beliau mengingatkan pencurian zakat?, \"Sesungguhnya orang yang berkhianat dengan mengambil unta dan kambing zakat, maka Allah akan mendatangkannya pada Hari Kiamat dalam keadaan memikul barang-barang yang diambilnya\". [Abdullah bin Unais] berkata; Ya."
            },
            {
                "number": 849,
                "arab": "قَالَ حَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ قَالَ حَدَّثَنَا زَائِدَةُ قَالَ حَدَّثَنَا شَبِيبُ بْنُ غَرْقَدَةَ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ قَالَ حَدَّثَنِي أَبِي أَنَّهُشَهِدَ حَجَّةَ الْوَدَاعِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَجْنِي جَانٍ إِلَّا عَلَى نَفْسِهِ لَا يَجْنِي وَالِدٌ عَلَى وَلَدِهِ وَلَا مَوْلُودٌ عَلَى وَالِدِهِ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id] budak Bani Hasyim. Berkata; telah menceritakan kepada kami [Za`idah] berkata; telah menceritakan kepada kami [Syabib bin Ghurqadah] dari [Sulaiman bin 'Amr bin Al Ahwash] berkata; telah menceritakan kepadaku [bapakku] dia menyaksikan Haji Wada'bersama Rasulullah Shallallahu'alaihiwasallam. Lalu Rasulullah Shallallahu'alaihiwasallam bersabda: \" Tidaklah seseorang melakukan pelanggaran kecuali kepada dirinya sendiri, dan tidaklah orang tua melakukan pelanggaran sedang dosanya ditanggung anaknya, dan tidak pula seorang anak melakukan pelanggaran dan dosanya ditanggung kedua orang tuanya.\""
            },
            {
                "number": 850,
                "arab": "حَدَّثَنَا هَيْثَمُ بْنُ خَارِجَةَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ أَيُّوبَ بْنِ مَيْسَرَةَ بْنِ حَلْبَسٍ قَالَ سَمِعْتُ أَبِي سَمِعَ خُرَيْمَ بْنَ فَاتِكٍ الْأَسَدِيَّ يَقُولُأَهْلُ الشَّامِ سَوْطُ اللَّهِ فِي الْأَرْضِ يَنْتَقِمُ بِهِمْ مِمَّنْ يَشَاءُ كَيْفَ يَشَاءُ وَحَرَامٌ عَلَى مُنَافِقِيهِمْ أَنْ يَظْهَرُوا عَلَى مُؤْمِنِيهِمْ وَلَنْ يَمُوتُوا إِلَّا هَمًّا أَوْ غَيْظًا أَوْ حُزْنًا",
                "id": "Telah menceritakan kepada kami [Husyaim bin Kharijah] berkata; telah menceritakan kepada kami [Muhammad bin Ayyub bin Maisarah bin Halbas] berkata; saya mendengar [bapakku] juga mendengar dari [Huraim bin Fatik Al Asadi] berkata; \"Penduduk Syam adalah cemeti Allah di muka bumi, (Allah Azzawajalla) menyiksa sebuah kaum dengan perantaraan mereka terhadap siapa saja yang Dikehendaki-Nya. Dan diharamkan bagi kaum munafiqnya mengalahkan kaum mukminnya, dan mereka (orang munafiqnya) sekali-kali tidak akan mati kecuali dalam keadaan cemas, marah ataupun sedih.\""
            },
            {
                "number": 851,
                "arab": "حَدَّثَنَا هَيْثَمُ بْنُ خَارِجَةَ قَالَ حَدَّثَنَا طَيَّافٌ الْإِسْكَنْدَرَانِيُّ عَنِ ابْنِ شَرَاحِيلَ بْنِ بُكَيْلٍ عَنِ أَبِيهِ شُرَاحْبِيلَ قَالَقُلْتُ لِابْنِ عُمَرَ إِنَّ لِي أَرْحَامًا بِمِصْرَ يَتَّخِذُونَ مِنْ هَذِهِ الْأَعْنَابِ قَالَ وَفَعَلَ ذَلِكَ أَحَدٌ مِنْ الْمُسْلِمِينَ قُلْتُ نَعَمْ قَالَ لَا تَكُونُوا بِمَنْزِلَةِ الْيَهُودِ حُرِّمَتْ عَلَيْهِمْ الشُّحُومُ فَبَاعُوهَا وَأَكَلُوا أَثْمَانَهَا قَالَ قُلْتُ مَا تَقُولُ فِي رَجُلٍ أَخَذَ عُنْقُودًا فَعَصَرَهُ فَشَرِبَهُ قَالَ لَا بَأْسَ فَلَمَّا نَزَلْتُ قَالَ مَا حَلَّ شُرْبُهُ حَلَّ بَيْعُهُ",
                "id": "Telah menceritakan kepada kami [Husyaim bin Kharijah] berkata; telah menceritakan kepada kami [Thayyaf Al Iskandari] dari [Ibnu Syarahil bin Bukail] dari [bapaknya, Syurahil] berkata; saya berkata kepada [Ibnu 'Umar], saya mempunyai kerabat yang berada di Mesir yang menjadikan anggur menjadi sejenis Nabid (setelah melalui proses fregmentasi, pent). (Syurahbil) berkata; yang melakukan hal tersebut dari kaum muslimin? aku berkata; Ya. (Ibnu Umar) berkata; \"Janganlah kalian seperti orang yang Yahudi, diharamkan bagi mereka lemak, lalu mereka menjualnya dan memakan hasilnya\" Saya berkata; \"Bagaimana pendapat kamu mengenai seorang laki-laki yang mengambil pohon 'Unqud lalu memerasnya dan meminumnya? lalu dia berkata; \"Tidak apa-apa\" maka ketika aku turun, dia kembali berkata; \"Apa yang boleh untuk diminum, maka boleh untuk dijual.\""
            },
            {
                "number": 852,
                "arab": "قَالَ حَدَّثَنَا هَيْثَمٌ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَيْمُونٍ الْأَشْعَرِيُّ عَنِ الْعَلَاءِ بْنِ الْحَارِثِ عَنْ مَكْحُولٍرَفَعَهُ قَالَ أَيُّمَا شَجَرَةٍ أَظَلَّتْ عَلَى قَوْمٍ فَصَاحِبُهُ بِالْخِيَارِ مِنْ قَطْعِ مَا أَظَلَّ أَوْ أَكْلِ ثَمَرِهَا",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Hutsaim] berkata; telah menceritakan kepada kami [Abdullah bin Maimun Al Asy'ari] dari [Al 'Ala` bin Al Harits] dari [Makhul] dia memarfukkannya, (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Pohon mana saja yang menaungi suatu kaum, maka yang terkena naungan itu berhak memilih antara memotong bagian pohon yang menaungi atau menyantap buahnya.\""
            },
            {
                "number": 853,
                "arab": "قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ إِسْحَاقَ قَالَ حَدَّثَنِي الْمُنْكَدِرُ بْنُ مُحَمَّدٍ يَعْنِي ابْنَ الْمُنْكَدِرِ عَنْ أَبِيهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمًا فِي السُّوقِ يَوْمَ الْعِيدِ يَنْظُرُ وَالنَّاسُ يَمُرُّونَ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Ibrahim bin Ishaq] berkata; telah menceritakan kepadaku [Al Munkadir bin Muhammad] yaitu Ibnu Al Munkadir, dari [Bapaknya] dari [Abdurrahman bin 'Utsman At-Taimi] berkata; Aku melihat Rasulullah Shallallahu'alaihiwasallam berdiri melihat-lihat di pasar pada hari raya, dan manusia berlalu lalang.\""
            },
            {
                "number": 854,
                "arab": "قَالَ حَدَّثَنَا هَاشِمٌ عَنِ ابْنِ أَبِي ذِئْبٍ وَيَزِيدُ قَالَ أَخْبَرَنَا ابْنُ أَبِي ذِئْبٍ عَنْ سَعِيدِ بْنِ خَالَدٍ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ قَالَذَكَرَ طَبِيبٌ الدَّوَاءَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَكَرَ الضُّفْدَعَ تَكُونُ فِي الدَّوَاءِ فَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِهَا",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; Telah menceritakan kepada kami [Hasyim] dari [Ibnu Abu Dzi`b], dan [Yazid] berkata; telah mengabarkan kepada kami [Ibnu Abu Dz`ib] dari [Sa'id bin Khalid] dari [Sa'id bin Musayyab] dari [Abdurrahman bin 'Utsman] berkata; ada seorang dokter yang menyebutkan obat di sisi Rasulullah Shallallahu'alaihiwasallam berupa katak, lalu Rasulullah Shallallahu'alaihiwasallam melarang membunuhnya."
            },
            {
                "number": 855,
                "arab": "قَالَ حَدَّثَنَا سُرَيْجٌ وَهَارُونُ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ حَاطِبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ التَّيْمِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُقَطَةِ الْحَاجِّ وَقَالَ هَارُونُ فِي حَدِيثِهِ عَمْرُو بْنُ الْحَارِثِقَالَ عَبْد اللَّهِ وَسَمِعْتُهُ أَنَا مِنْ هَارُونَ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Suraij] dan [Harun] berkata; telah menceritakan kepada kami [Ibnu Wahb] dari ['Amr bin Al Harits] dari [Bukair bin Al Asysyaj] dari [Yahya bin Abdurrahman bin Hatib] dari [Abdurahman bin 'Utsman At-Taimi] Rasulullah Shallallahu'alaihiwasallam mencegah dari mengambil barang temuan jamaah haji. Harun berkata dalam hadisnya, 'Amr bin Al Harits berkata; Abdullah berkata; dan saya mendengarnya dari Harun."
            },
            {
                "number": 856,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ ثَابِتٍ قَالَ حَدَّثَنِي عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ الْأَنْصَارِيُّ عَنْ أَبِيهِ عَنْ عِلْبَاءَ السُّلَمِيِّ قَالَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَقُومُ السَّاعَةُ إِلَّا عَلَى حُثَالَةِ النَّاسِ",
                "id": "Telah menceritakan kepada kami ['Ali bin Tsabit] berkata; telah menceritakan kepadaku [Abdul Hamid bin Ja'far Al Anshari] dari [Bapaknya] dari ['Ilba' As-Sulamy] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Hari Kiamat tidak terjadi kecuali menimpa manusia-manusia yang buruk\"."
            },
            {
                "number": 857,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ ثَابِتٍ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ النُّعْمَانِ بْنِ مَعْبَدِ بْنِ هَوْذَةَ الْأَنْصَارِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِالْإِثْمِدِ الْمُرَوَّحِ عِنْدَ النَّوْمِ",
                "id": "Telah menceritakan kepada kami ['Ali bin Tsabit] berkata; telah menceritakan kepadaku [Abdurrahman bin An Nu'man bin Ma'bad bin Haudzah Al Anshari] dari [bapaknya] dari [kakeknya] Rasulullah Shallallahu'alaihiwasallam menyuruh untuk memakai celak yang bercampur dengan wangi-wangian ketika tidur."
            },
            {
                "number": 858,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ قَالَ عَبْد اللَّهِ حَدَّثَنَاه أَبِي عَنْهُ وَهُوَ حَيٌّ قَالَ حَدَّثَنَا حُجْرُ بْنُ الْحَارِثِ الْغَسَّانِيُّ مِنْ أَهْلِ الرَّمْلَةِ عَنْ عَبْدِ اللَّهِ بْنِ عَوْنٍ الْكِنَانِيِّ وَكَانَ عَامِلًا لِعُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَلَى الرَّمْلَةِ أَنَّهُشَهِدَ عَبْدَ الْمَلِكِ بْنَ مَرْوَانَ قَالَ لِبَشِيرِ بْنِ عَقْرَبَةَ الْجُهَنِيِّ يَوْمَ قُتِلَ عَمْرُو بْنُ سَعِيدِ بْنِ الْعَاصِ يَا أَبَا الْيَمَانِ إِنِّي قَدْ احْتَجْتُ الْيَوْمَ إِلَى كَلَامِكَ فَقُمْ فَتَكَلَّمْ قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ قَامَ يَخْطُبُ لَا يَلْتَمِسُ بِهَا إِلَّا رِيَاءً وَسُمْعَةً أَوْقَفَهُ اللَّهُ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ مَوْقِفَ رِيَاءٍ وَسُمْعَةٍ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] Abdullah berkata; bapakku menceritakannya dari (Sa'id bin Manshur) ketika masih hidup berkata; telah menceritakan kepada kami [Hujr bin Al Harits, Al Ghassani] dari penduduk Ramlah, dari [Abdullah bin 'Aun Al Kinany] yang dia adalah gubernur untuk 'Umar Bin Abdul Aziz di Ramlah, bahwa dia menyaksikan Abdul Malik bin Marwan berkata kepada [Basyir bin 'Aqrabah] pada hari terbunuhnya Sa'id bin Al 'Ash 'Wahai Abu Al Yaman, pada hari aku membutuhkan perkataanmu, bangunlah dan bicaralah.' Lalu dia berkata; Aku mendengar Rasulullah Shallallahu'alaihiwasallam bersabda \"Barangsiapa yang berbicara dengan tujuan untuk riya dan sum'ah (diperdengarkan kepada orang lain-pent) niscaya Allah Azzawajalla akan menempatkan dia di tempat orang-orang yang riya dan sum'ah (neraka, pent)."
            },
            {
                "number": 859,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ قَالَ سَمِعْتُ عَمْرَو بْنَ مَيْمُونٍ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ رَبِيعَةَ السُّلَمِيِّ عَنْ عُبَيْدِ بْنِ خَالِدٍ السُّلَمِيِّ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَآخَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ رَجُلَيْنِ قُتِلَ أَحَدُهُمَا عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ مَاتَ الْآخَرُ فَصَلَّوْا عَلَيْهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا قُلْتُمْ قَالَ قُلْنَا اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ اللَّهُمَّ أَلْحِقْهُ بِصَاحِبِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَيْنَ صَلَاتُهُ بَعْدَ صَلَاتِهِ وَأَيْنَ صِيَامُهُ أَوْ عَمَلُهُ بَعْدَ عَمَلِهِ مَا بَيْنَهُمَا أَبْعَدُ مَا بَيْنَ السَّمَاءِ وَالْأَرْضِ",
                "id": "Telah menceritakan kepada kami [Abu Nadlr] berkata; telah menceritakan kepada kami [Syu'bah] dari ['Amr bin Murrah] berkata; saya mendengar ['Amr bin Maimun] menceritakan dari [Abdullah bin Rabi'ah As-Sulami] dari [Ubaid bin Khalid As-Sulamy] yang termasuk dari sahabat Nabi Shallallahu'alaihiwasallam berkata; Nabi Shallallahu'alaihiwasallam mempersaudarakan dua orang laki-laki yang salah satunya terbunuh (pada waktu peperangan) pada zaman Nabi Shallallahu'alaihiwasallam. Kemudian yang satu lagi meninggal, maka para sahabat mensholatkannya. Rasulullah Shallallahu'alaihiwasallam bersabda: \"Apa yang kalian ucapkan dalam sholat?\" Kami menjawab, ALLAHUMMAGFIR LAHU WARHAMHU, ALLAHUMMA ALHIQHU BISHAHIBIHI (Ya Allah ampunilah dosanya dan berilah kasih sayang dan pertemukanlah dia dengan saudaranya). Nabi Shallallahu'alaihiwasallam bersabda: \"Lalu dimanakah letak amal sholatnya setelah amal sholat (yang terbunuh) dan amalAn amalanya setelah amalan dari sahabat yang terbunuh, yang antara amalan keduanya terdapat perbedaan bagaikan langit dan bumi (artinya: sahabat yang pertama lebih utama dari sahabat yang mati terakhir dengan amalan yang disertai dengan rasa khusu' dan ikhlas dan waktu beramal yang lebih banyak-pent).\""
            },
            {
                "number": 860,
                "arab": "قَالَ حَدَّثَنَا أَبُو الْيَمَانِ قَالَ أَخْبَرَنَا شُعَيْبٌ عَنِ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ كَعْبِ بْنِ مَالِكٍ الْأَنْصَارِيُّ وَهُوَ أَحَدُ الثَّلَاثَةِ الَّذِينَ تِيبَ عَلَيْهِمْ أَنَّهُ أَخْبَرَهُ بَعْضُ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يَوْمًا عَاصِبًا رَأْسَهُ فَقَالَ فِي خُطْبَتِهِ أَمَّا بَعْدُ يَا مَعْشَرَ الْمُهَاجِرِينَ فَإِنَّكُمْ قَدْ أَصْبَحْتُمْ تَزِيدُونَ وَأَصْبَحَتْ الْأَنْصَارُ لَا تَزِيدُ عَلَى هَيْئَتِهَا الَّتِي هِيَ عَلَيْهَا الْيَوْمَ وَإِنَّ الْأَنْصَارَ عَيْبَتِي الَّتِي أَوَيْتُ إِلَيْهَا فَأَكْرِمُوا كَرِيمَهُمْ وَتَجَاوَزُوا عَنْ مُسِيئِهِمْ",
                "id": "(Ahmad bin Hanbal radliyallhu'anhu) berkata; telah menceritakan kepada kami [Abu Al Yaman] berkata; telah mengabarkan kepada kami [Syua'ib] dari [Az Zuhri] berkata; telah mengabarkan kepadaku [Abdullah bin Ka'ab bin Malik Al Anshary] dia termasuk salah seorang dari tiga orang yang diterima taubatnya (pada peristiwa Perang Tabuk, pent) bahwa [sebagian sahabat Nabi Shallallahu'alaihiwasallam] mengabari kepadanya bahwa Nabi Shallallahu'alaihiwasallam suatu hari bepergian dengan kepala yang terikat dan berkata dalam khutbahnya, \"Amma Ba'du, Wahai sekalian Kaum Muhajirin, kalian telah bertambah banyak, Kaum Anshar tidaklah bertambah kecuali sebagaimana keadaan mereka pada hari ini, dan kaum Anshar adalah pembelaku dan tempat menjaga rahasiaku yang aku berlindung kepadanya, maka muliakanlah yang baik-baik di antara mereka dan maafkanlah mereka yang berbuat jelek."
            },
            {
                "number": 861,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا خَالِدٌ يَعْنِي الْوَاسِطِيَّ قَالَ حَدَّثَنَا عَمْرُو بْنُ يَحْيَى الْأَنْصَارِيُّ عَنْ زِيَادِ بْنِ أَبِي زِيَادٍ مَوْلَى بَنِي مَخْزُومٍ عَنْ خَادِمٍ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٍ أَوْ امْرَأَةٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا يَقُولُ لِلْخَادِمِ أَلَكَ حَاجَةٌ قَالَ حَتَّى كَانَ ذَاتَ يَوْمٍ فَقَالَ يَا رَسُولَ اللَّهِ حَاجَتِي قَالَ وَمَا حَاجَتُكَ قَالَ حَاجَتِي أَنْ تَشْفَعَ لِي يَوْمَ الْقِيَامَةِ قَالَ وَمَنْ دَلَّكَ عَلَى هَذَا قَالَ رَبِّي قَالَ إِمَّا لَا فَأَعِنِّي بِكَثْرَةِ السُّجُودِ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Khalid] yaitu Al Washiti, berkata; telah menceritakan kepada kami ['Amr bin Yahya Al Anshary] dari [Ziyad bin Abu Ziyad] budak Bani Makhzum dari [pembantu Nabi] Shallallahu'alaihiwasallam, laki-laki atau perempuan, berkata; Nabi Shallallahu'alaihiwasallam pernah berkata kepada pelayannya, \"Mungkin engkau mempunyai keperluan?\" (Ziyad bin Abu Ziyad) berkata; hingga pada suatu hari dia berkata; \"Wahai Rasulullah, aku punya keperluan ya Rasulullah\" Rasulullah Shallallahu'alaihiwasallam bertanya, \"Apa keperluanmu\"? pembantu tersebut berkata; \"Berilah syafaat kepadaku pada Hari Kiamat\" (Rasulullah Shallallahu'alaihiwasallam) bertanya kembali, \"Siapakah yang menunjukkan kepadamu perkara ini?\" dia menjawab, \"Rabbku\" (Rasulullah Shallallahu'alaihiwasallam) bersabda padanya, \"Bantulah diriku agar bisa memberi syafaat kepadamu dengan memperbanyak sujud.\""
            },
            {
                "number": 862,
                "arab": "حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى أَبُو عُمَرَ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ جَعْفَرِ بْنِ عَمْرٍو الضَّمْرِيِّ قَالَخَرَجْتُ مَعَ عُبَيْدِ اللَّهِ بْنِ عَدِيِّ بْنِ الْخِيَارِ إِلَى الشَّامِ فَلَمَّا قَدِمْنَا حِمْصَ قَالَ لِي عُبَيْدُ اللَّهِ هَلْ لَكَ فِي وَحْشِيٍّ نَسْأَلُهُ عَنْ قَتْلِ حَمْزَةَ قُلْتُ نَعَمْ وَكَانَ وَحْشِيٌّ يَسْكُنُ حِمْصَ قَالَ فَسَأَلْنَا عَنْهُ فَقِيلَ لَنَا هُوَ ذَاكَ فِي ظِلِّ قَصْرِهِ كَأَنَّهُ حَمِيتٌ قَالَ فَجِئْنَا حَتَّى وَقَفْنَا عَلَيْهِ فَسَلَّمْنَا فَرَدَّ عَلَيْنَا السَّلَامَ قَالَ وَعُبَيْدُ اللَّهِ مُعْتَجِرٌ بِعِمَامَتِهِ مَا يَرَى وَحْشِيٌّ إِلَّا عَيْنَيْهِ وَرِجْلَيْهِ فَقَالَ عُبَيْدُ اللَّهِ يَا وَحْشِيُّ أَتَعْرِفُنِي قَالَ فَنَظَرَ إِلَيْهِ ثُمَّ قَالَ لَا وَاللَّهِ إِلَّا أَنِّي أَعْلَمُ أَنَّ عَدِيَّ بْنَ الْخِيَارِ تَزَوَّجَ امْرَأَةً يُقَالُ لَهَا أُمُّ قِتَالٍ ابْنَةُ أَبِي الْعِيصِ فَوَلَدَتْ لَهُ غُلَامًا بِمَكَّةَ فَاسْتَرْضَعَهُ فَحَمَلْتُ ذَلِكَ الْغُلَامَ مَعَ أُمِّهِ فَنَاوَلْتُهَا إِيَّاهُ فَلَكَأَنِّي نَظَرْتُ إِلَى قَدَمَيْكَ قَالَ فَكَشَفَ عُبَيْدُ اللَّهِ وَجْهَهُ ثُمَّ قَالَ أَلَا تُخْبِرُنَا بِقَتْلِ حَمْزَةَ قَالَ نَعَمْ إِنَّ حَمْزَةَ قَتَلَ طُعَيْمَةَ بْنَ عَدِيٍّ بِبَدْرٍ فَقَالَ لِي مَوْلَايَ جُبَيْرُ بْنُ مُطْعِمٍ إِنْ قَتَلْتَ حَمْزَةَ بِعَمِّي فَأَنْتَ حُرٌّ فَلَمَّا خَرَجَ النَّاسُ يَوْمَ عِينِينَ قَالَ وَعِينِينُ جُبَيْلٌ تَحْتَ أُحُدٍ وَبَيْنَهُ وَادٍ خَرَجْتُ مَعَ النَّاسِ إِلَى الْقِتَالِ فَلَمَّا أَنْ اصْطَفُّوا لِلْقِتَالِ قَالَ خَرَجَ سِبَاعٌ مَنْ مُبَارِزٌ قَالَ فَخَرَجَ إِلَيْهِ حَمْزَةُ بْنُ عَبْدِ الْمُطَّلِبِ فَقَالَ سِبَاعُ بْنُ أُمِّ أَنْمَارٍ يَا ابْنَ مُقَطِّعَةِ الْبُظُورِ أَتُحَادُّ اللَّهَ وَرَسُولَهُ ثُمَّ شَدَّ عَلَيْهِ فَكَانَ كَأَمْسِ الذَّاهِبِ وَأَكْمَنْتُ لِحَمْزَةَ تَحْتَ صَخْرَةٍ حَتَّى إِذَا مَرَّ عَلَيَّ فَلَمَّا أَنْ دَنَا مِنِّي رَمَيْتُهُ بِحَرْبَتِي فَأَضَعُهَا فِي ثُنَّتِهِ حَتَّى خَرَجَتْ مِنْ بَيْنِ وَرِكَيْهِ قَالَ فَكَانَ ذَلِكَ الْعَهْدُ بِهِ قَالَ فَلَمَّا رَجَعَ النَّاسُ رَجَعْتُ مَعَهُمْ قَالَ فَأَقَمْتُ بِمَكَّةَ حَتَّى فَشَا فِيهَا الْإِسْلَامُ قَالَ ثُمَّ خَرَجْتُ إِلَى الطَّائِفِ قَالَ فَأَرْسَلَ إِلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَقِيلَ لَهُ إِنَّهُ لَا يَهِيجُ لِلرُّسُلِ قَالَ فَخَرَجْتُ مَعَهُمْ حَتَّى قَدِمْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَلَمَّا رَآنِي قَالَ أَنْتَ وَحْشِيٌّ قَالَ قُلْتُ نَعَمْ قَالَ أَنْتَ قَتَلْتَ حَمْزَةَ قَالَ قُلْتُ قَدْ كَانَ مِنْ الْأَمْرِ مَا بَلَغَكَ يَا رَسُولَ اللَّهِ إِذْ قَالَ مَا تَسْتَطِيعُ أَنْ تُغَيِّبَ عَنِّي وَجْهَكَ قَالَ فَرَجَعْتُ فَلَمَّا تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَخَرَجَ مُسَيْلِمَةُ الْكَذَّابُ قَالَ قُلْتُ لَأَخْرُجَنَّ إِلَى مُسَيْلِمَةَ لَعَلِّي أَقْتُلُهُ فَأُكَافِئَ بِهِ حَمْزَةَ قَالَ فَخَرَجْتُ مَعَ النَّاسِ فَكَانَ مِنْ أَمْرِهِمْ مَا كَانَ قَالَ فَإِذَا رَجُلٌ قَائِمٌ فِي ثَلْمَةِ جِدَارٍ كَأَنَّهُ جَمَلٌ أَوْرَقُ ثَائِرٌ رَأْسُهُ قَالَ فَأَرْمِيهِ بِحَرْبَتِي فَأَضَعُهَا بَيْنَ ثَدْيَيْهِ حَتَّى خَرَجَتْ مِنْ بَيْنِ كَتِفَيْهِ قَالَ وَوَثَبَ إِلَيْهِ رَجُلٌ مِنْ الْأَنْصَارِ قَالَ فَضَرَبَهُ بِالسَّيْفِ عَلَى هَامَتِهِقَالَ عَبْدُ اللَّهِ بْنُ الْفَضْلِ فَأَخْبَرَنِي سُلَيْمَانُ بْنُ يَسَارٍ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ فَقَالَتْ جَارِيَةٌ عَلَى ظَهْرِ بَيْتٍ وَأَمِيرُ الْمُؤْمِنِينَ قَتَلَهُ الْعَبْدُ الْأَسْوَدُ",
                "id": "Telah menceritakan kepada kami [Hujain bin Al Mustanna, Abu 'Umar] berkata; telah menceritakan kepada kami [Abdul Aziz] yaitu Ibnu Abdullah bin Abu Salamah dari [Abdullah bin Al Fadl] dari [Sulaiman bin Yasar] dari [Ja'far bin 'Amr Ad-Dlamry] berkata; saya keluar bersama 'ubaidhullah bin 'Ady bin Hiyar ke Syam. Ketika kami sampai ke Himsh, 'ubaidhullah berkata kepadaku, \"Bagaimana kalau kita ke Wahsy dan bertanya tentang pembunuhan Hamzah\", saya menjawab, \"Baiklah\". [Wahsy] ketika itu bertempat tinggal di Himsh. (Ja'far bin 'Amr Ad-Dlamry) berkata; kami bertanya tentang dia, maka ditunjukkan kepada kami bahwa Wahsy saat itu berada di bawah istana seakAn akan dia geriba (kantong air dari kulit) yang berisi minyak samin. (Ja'far bin 'Amr Ad-Dlamry) berkata; kami mendatanginya sampai kami di hadapannya, kami mengucapkan salam, lalu dia membalasnya. 'ubaidhullah melipat penutup kepalanya, sehingga Wahsy tidak dapat melihatnya kecuali kedua mata ubaidhullah dan kedua kakinya. 'ubaidhullah bertanya, \"Wahai Wahsy, apa engkau mengenaliku\"?, maka Wahsy memperhatikannya, lalu berkata; \"Demi Allah, tidak. Aku tidak mengenalimu, kecuali aku tahu bahwa 'Ady bin Khiyar menikah dengan seorang perempuan yang disebut dengan Ummu Qital putri Abu Al 'Ish. Lalu lahirlah seorang anak di Makkah, maka dia dimintakan untuk disusukan kepada orang lain lalu aku membawa anak kecil itu sama ibunya, lalu aku serahkan kepadanya, maka seakAn akan aku melihatnya sama jika melihat ke kedua kakimu\" (Ja'far bin 'Amr Ad-Dlamry) berkata; lalu 'ubaidhullah menyingkapkan wajahnya, lalu berkata; \"Maukah engkau menceritakan kepada kami tentang terbunuhnya Hamzah\"? dia menjawab, \"Ya, Hamzah membunuh Tu'aimah bin 'Ady pada Perang Badar, lalu tuanku, Zubair bin Muth'im berkata kepadaku, jika kamu dapat membunuh Hamzah sebagai balas dendam kematian pamanku, kamu menjadi bebas. Ketika orang-orang serentak keluar ke 'Innin, yaitu sebuah gunung kecil di bawah Uhud yang terpisah dengan bukit, saya keluar bersama mereka untuk ikut serta perang. Ketika pasukan telah berbaris untuk berperang, maka keluarlah para pendekar untuk maju ke depan, ketika itu keluarlah Hamzah bin Abdul Al Munthalib, lalu Siba' bin Ummi Anmar berkata; \"Wahai anak potongan bagian dari kemaluan perempuan, apakah kamu akan memerangi Allah dan Rasul-Nya \" kemudian Hamzah menghabisinya, kemudian aku secara diam-diam mengincar Hamzah di bawah bebatuan, sampai ketika dia melewatiku. Tatkala dia sangat dekat denganku, saya lemparkan tombakku dan mengenai daerah bawah perutnya sehingga keluarlah apa yang di dalam daerah yang terkena lemparan tombak tersebut. (Wahsy) berkata; dan itulah apa yang akan menjadi janjiku. Ketika orang-orang balik pulang, sayapun bersama mereka. (Wahsy) berkata; saya tinggal di Makkah sampai Islam tersebar di sana. Saya keluar ke Thaif. lalu Rasulllah Shallallahu'alaihiwasallam mengirimkan suatu utusan kepadaku, dan mengajakku bicara, sang utusan mengatakan bahwa beliau tidak marah terhadapnya. Aku pun pergi bersama mereka sampai aku temui Rasulullah Shallallahu'alaihiwasallam. Ketika beliau melihatku, beliau bertanya, \"Apakah engkau wahsy?\" saya menjawab, \"Benar\". Beliau bersabda: \"Kamu yang telah membunuh Hamzah?\" (Wahsy) berkata; urusan tentang pembunuhan itu telah sampai kepada anda, Wahai Rasulullah\", dan beliau bersabda: \"Dapatkah kamu menjauhkan wajahmu dariku?\" (Wahsy) berkata; lalu saya kembali pulang, ketika Rasulullah Shallallahu'alaihiwasallam meninggal dan muncul nabi palsu Musailamah Al Kadzab, saya bertekad, \"Sayan akan menjumpai Musailamah, semoga saya dapat membunuhnya dan menebus kesalahan karena membunuh Hamzah\", lalu saya keluar bersama orang-orang yang akan memerangi Musailamah. Saya melihat seorang laki-laki berdiri di salah satu dinding rumah seakAn akan unta yang berambut ikal kepalanya. Ketika itu saya lemparkan tombakku dan mengenai tepat di tengah dadanya, sehingga keluar dari antara kedua pundaknya. (Wahsy) berkata; lalu ada seorang laki-laki Anshar yang melompat kepadanya dan menghunuskan pedang ke kepalanya\". [Abdullah bin Al Fadl] berkata; telah mengabarkan kepadaku, [Sulaiman bin Yasar] mendengar [Abdullah bin 'Umar] lalu ada seorang wanita yang berada di dalam rumahnya berkata; dan yang membunuh Amirul Mukminin, Al 'Abd Al Aswad."
            },
            {
                "number": 863,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ رَبِّهِ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ وَحْشِيِّ بْنِ حَرْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّا نَأْكُلُ وَمَا نَشْبَعُ قَالَ فَلَعَلَّكُمْ تَأْكُلُونَ مُفْتَرِقِينَ اجْتَمِعُوا عَلَى طَعَامِكُمْ وَاذْكُرُوا اسْمَ اللَّهِ تَعَالَى عَلَيْهِ يُبَارَكْ لَكُمْ فِيهِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Abdurobbih] berkata; telah menceritakan kepada kami [Al Walid bin Muslim] dari [Wahsy bin Harb] dari [bapaknya] dari [kakeknya] ada seorang laki-laki berkata kepada Nabi Shallallahu'alaihiwasallam, kami makan, tapi tidak merasakan kenyang. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Mungkin kalian makan dengan berpencar-pencar, maka berkumpullah ketika makan, dan sebutlah nama Allah Ta'ala, semoga kalian akan diberi berkah di dalamnya\""
            },
            {
                "number": 864,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا مَعْمَرٌ عَنْ عُثْمَانَ بْنِ زُفَرَ عَنْ بَعْضِ بَنِي رَافِعِ بْنِ مَكِيثٍ عَنْ رَافِعِ بْنِ مَكِيثٍ وَكَانَ مِمَّنْ شَهِدَ الْحُدَيْبِيَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حُسْنُ الْخُلُقِ نَمَاءٌ وَسُوءُ الْخُلُقِ شُؤْمٌ وَالْبِرُّ زِيَادَةٌ فِي الْعُمُرِ وَالصَّدَقَةُ تَمْنَعُ مِيتَةَ السَّوْءِ",
                "id": "Telah menceritakan kepada kami [Abdurrozzaq] berkata; telah mengabarkan kepada kami [Ma'mar] dari ['Utsman bin Zufar] dari [sebagian Bani Rafi' bin Makits] dari [Rafi' bin Makits] dia salah satu yang ikut dalam Peristiwa Hudaibiyah, Nabi Shallallahu'alaihiwasallam bersabda: \"Akhlaq yang baik akan berkembang, dan akhlaq yang buruk adalah tercela, kebaikan adalah menambah umur dan sedekah mencegah dari bangkai keburukan\""
            },
            {
                "number": 865,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ حَدَّثَنِي ابْنُ شِهَابٍ أَنَّ الْحُسَيْنَ بْنَ السَّائِبِ بْنِ أَبِي لُبَابَةَ أَخْبَرَهُأَنَّ أَبَا لُبَابَةَ عَبْدَ الْمُنْذِرِ لَمَّا تَابَ اللَّهُ عَلَيْهِ قَالَ يَا رَسُولَ اللَّهِ إِنَّ مِنْ تَوْبَتِي إِلَى اللَّهِ عَزَّ وَجَلَّ أَنْ أَهْجُرَ دَارَ قَوْمِي وَأُسَاكِنَكَ وَأَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً لِلَّهِ عَزَّ وَجَلَّ وَلِرَسُولِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُجْزِئُ عَنْكَ الثُّلُثُ",
                "id": "Telah menceritakan kepada kami [Rouh] telah menceritakan kepada kami [Ibnu Juraij] telah menceritakan kepadaku [Ibnu Syihab] [Al Husain bin As-Sa`Ib bin Abu Lubabah] mengabarinya, [Abu lubabah, Abdul Mundzir], ketika Allah menerima taubahnya, dia berkata; \"Wahai Rasulullah, bagian dari taubatku kepada Allah Azzawajalla: saya berhijrah dari rumah kaumku dan bertempat dekat denganmu, melepaskan dari hartaku sebagai sedekah kepada Allah Azzawajalla dan Rasul-Nya\". Lalu Rasulullah Shallallahu'alaihiwasallam bersabda: \"Cukup bagimu dengan sepertiga hartamu saja\"."
            },
            {
                "number": 866,
                "arab": "قَالَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا الْعَطَّافُ قَالَ حَدَّثَنِي مُجَمِّعُ بْنُ يَعْقُوبَ عَنْ غُلَامٍ مِنْ أَهْلِ قُباءٍ أَنَّهُ أَدْرَكَهُ شَيْخًا أَنَّهُ قَالَجَاءَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقُبَاءٍ فَجَلَسَ فِي فَيْءِ الْأَحْمَرِ وَاجْتَمَعَ إِلَيْهِ نَاسٌ فَاسْتَسْقَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسُقِيَ فَشَرِبَ وَأَنَا عَنْ يَمِينِهِ وَأَنَا أَحْدَثُ الْقَوْمِ فَنَاوَلَنِي فَشَرِبْتُ وَحَفِظْتُ أَنَّهُ صَلَّى بِنَا يَوْمَئِذٍ الصَّلَاةَ وَعَلَيْهِ نَعْلَاهُ لَمْ يَنْزِعْهُمَا",
                "id": "(Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Yunus bin Muhammad] berkata; telah menceritakan kepada kami [Al 'Atthaf] berkata; telah menceritakan kepadaku [Mujamma' bin Yaqub] dari [seorang pemuda dari penduduk Quba`] yang telah tua, dia berkata; Rasulullah Shallallahu'alaihiwasallam datang ke Quba', beliau duduk di bawah bayangan merah setelah matahari tergelincir, orang-orang pun duduk mengelilingi beliau. Lantas Rasulullah Shallallahu'alaihiwasallam meminta air minum, beliau pun diberi dan minum. Saya pada saat itu masih sangat muda, berada di posisi kanan beliau. Lantas beliau memberikan kepadaku dan aku meminumnya. Aku ingat betul bahwa waktu itu (Rasulullah Shallallahu'alaihiwasallam) menjadi imam bagi kita dan beliau memakai sandal dan tidak melepasnya.\""
            },
            {
                "number": 867,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ عَنْ أَبِي وَائِلٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ أَنَّهَا قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلنِّسَاءِ تَصَدَّقْنَ وَلَوْ مِنْ حُلِيِّكُنَّ قَالَتْ فَكَانَ عَبْدُ اللَّهِ خَفِيفَ ذَاتِ الْيَدِ فَقَالَتْ لَهُ أَيَسَعُنِي أَنْ أَضَعَ صَدَقَتِي فِيكَ وَفِي بَنِي أَخِي أَوْ بَنِي أَخٍ لِي يَتَامَى فَقَالَ عَبْدُ اللَّهِ سَلِي عَنْ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا عَلَى بَابِهِ امْرَأَةٌ مِنْ الْأَنْصَارِ يُقَالُ لَهَا زَيْنَبُ تَسْأَلُ عَمَّا أَسْأَلُ عَنْهُ فَخَرَجَ إِلَيْنَا بِلَالٌ فَقُلْنَا انْطَلِقْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلْهُ عَنْ ذَلِكَ وَلَا تُخْبِرْ مَنْ نَحْنُ فَانْطَلَقَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ هُمَا فَقَالَ زَيْنَبُ فَقَالَ أَيُّ الزَّيَانِبِ فَقَالَ زَيْنَبُ امْرَأَةُ عَبْدِ اللَّهِ وَزَيْنَبُ الْأَنْصَارِيَّةُ فَقَالَ نَعَمْ لَهُمَا أَجْرَانِ أَجْرُ الْقَرَابَةِ وَأَجْرُ الصَّدَقَةِقَالَ حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا الْأَعْمَشُ عَنْ مَنْصُورٍ عَنْ عَمْرِو بْنِ الْحَارِثِ بْنِ الْمُصْطَلِقِ عَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ قَالَتْ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالصَّدَقَةِ فَقَالَ تَصَدَّقْنَ يَا مَعْشَرَ النِّسَاءِ فَذَكَرَ الْحَدِيثَ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا سُفْيَانُ عَنِ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ عَمْرِو بْنِ الْحَارِثِ بْنِ الْمُصْطَلِقِ عَنْ زَيْنَبَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَصَدَّقْنَ يَا مَعْشَرَ النِّسَاءِ فَذَكَرَهُ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] dari [Sulaiman] dari [Abu Wa`il] dari ['Amr bin Al Harits] dari [Zainab, istri Abdullah] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda kepada para wanita, \"Bersedekahlah kalian, walaupun dengan perhiasan kalian!\" (Zainab) berkata; \"Abdullah adalah orang yang ringan tangannya (suka membantu) \", aku pun berkata kepadanya, \"Bolehkan aku bersedekah untukmu atau kepada kaum saudaraku ataupun anak saudaraku yang yatim?.\" Abdullah menjawab, \"Coba tanyakan saja hal itu kepada Nabi Shallallahu'alaihiwasallam\". (Zainab) berkata; kontan saya temui Nabi Shallallahu'alaihiwasallam, ketika saya sampai di pintu rumahnya, aku mendapati ada seorang perempuan yang bernama Zainab, kebetulan ia hendak bertanya beliau sebagaimana yang hendak aku tanyakan, lalu Bilal keluar menemui kami. Kami berkata; \"Temuilah Rasulullah Shallallahu'alaihiwasallam dan tanyakanlah hal itu kepada beliau, tapi janganlah engkau beritahukan siapa kami sebenarnya.\" Lalu (Bilal) menemui Rasulullah Shallallahu'alaihiwasallam, dan beliau bertanya, \"Siapa dua orang perempuan tadi?\", Bilal berkata; Zainab. (Rasulullah Shallallahu'alaihiwasallam) bertanya, Zainab yang mana? Dia menjawab, Zainab istri Abdullah dan Zainab wanita Anshar. Beliau menjawab, \"Ya, mereka mendapatkan dua pahala, yaitu pahala sedekah dan pahala kekerabatan.\" (Ahmad bin Hanbal) berkata; telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Al A'masy] dari [Manshur] dari ['Amr bin Al Harits bin Al Musthaliq] dari [Zainab istri Abdullah] berkata; Rasulullah Shallallahu'alaihiwasallam menyuruh kami untuk bersedekah. Beliau bersabda: \"Wahai kaum wanita, bersedekahlah kalian\", lalu menyebutkan seperti dalam hadis di atas. (Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Abdurrazaq] berkata; telah mengabarkan kepada kami [Sufyan] dari [Al A'masy] dari [Syaqiq] dari ['Amr bin Al Harits bin Al Musthaliq] dari [Zainab] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Bersedekahlah kalian, wahai kaum wanita\", lalu menyebutkannya."
            },
            {
                "number": 868,
                "arab": "قَالَ قَالَ حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ وَسُلَيْمَانُ بْنُ دَاوُدَ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ عُرْوَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَعَنْ رَائِطَةَ امْرَأَةِ عَبْدِ اللَّهِ وَكَانَتْ امْرَأَةً صَنَاعًا وَكَانَتْ تَبِيعُ وَتَصَدَّقُ فَقَالَتْ لِعَبْدِ اللَّهِ يَوْمًا لَقَدْ شَغَلْتَنِي أَنْتَ وَوَلَدُكَ فَمَا أَسْتَطِيعُ أَنْ أَتَصَدَّقَ مَعَكُمْ فَقَالَ مَا أُحِبُّ إِنْ لَمْ يَكُنْ فِي ذَلِكَ أَجْرٌ أَنْ تَفْعَلِي فَسَأَلَا عَنْ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَكِ أَجْرُ مَا أَنْفَقْتِ عَلَيْهِمْ",
                "id": "(Abdullah bin Ahmad bin Hanbal) berkata; (Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Husain bin Muhammad] telah menceritakan kepada kami [Ibnu Abu Az Zinad] dan [Sulaiman bin Daud] berkata; telah menceritakan kepada kami [Abdurrahman] dari [Bapaknya] dari ['Urwah] dari ['ubaidhullah bin Abdullah bin 'Utbah] dari [Ra`ithah, isteri Abdullah] dia adalah wanita yang rajin membuat kerajinan, dia berjualan dan bersedekah. Suatu hari dia berkata kepada Abdullah, \"Engkau dan anakmu telah menyibukkanku sehingga aku tidak dapat bersedekah\". Abdullah berkata; \"Kalaulah hal tersebut tidak mendapatkan pahala, maka aku tidak menyukainya untuk kamu kerjakan\". Lalu mereka berdua bertanya mengenai hal itu kepada Rasulullah Shallallahu'alaihiwasallam, dan beliau bersabda kepada istri Abdullah, \"Engkau mendapatkan pahala dari yang kamu belanjakan untuk mereka.\""
            },
            {
                "number": 869,
                "arab": "قَالَ حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَعَنْ رَائِطَةَ امْرَأَةِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ وَأُمِّ وَلَدِهِ وَكَانَتْ امْرَأَةً صَنَاعَ الْيَدِ قَالَ وَكَانَتْ تُنْفِقُ عَلَيْهِ وَعَلَى وَلَدِهِ مِنْ صَنْعَتِهَا قَالَتْ فَقُلْتُ لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ لَقَدْ شَغَلْتَنِي أَنْتَ وَوَلَدُكَ عَنْ الصَّدَقَةِ فَمَا أَسْتَطِيعُ أَنْ أَتَصَدَّقَ مَعَكُمْ بِشَيْءٍ فَقَالَ لَهَا عَبْدُ اللَّهِ وَاللَّهِ مَا أُحِبُّ إِنْ لَمْ يَكُنْ فِي ذَلِكَ أَجْرٌ أَنْ تَفْعَلِي فَأَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ ذَاتُ صَنْعَةٍ أَبِيعُ مِنْهَا وَلَيْسَ لِي وَلَا لِوَلَدِي وَلَا لِزَوْجِي نَفَقَةٌ غَيْرَهَا وَقَدْ شَغَلُونِي عَنْ الصَّدَقَةِ فَمَا أَسْتَطِيعُ أَنْ أَتَصَدَّقَ بِشَيْءٍ فَهَلْ لِي مِنْ أَجْرٍ فِيمَا أَنْفَقْتُ قَالَ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْفِقِي عَلَيْهِمْ فَإِنَّ لَكِ فِي ذَلِكَ أَجْرَ مَا أَنْفَقْتِ عَلَيْهِمْ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [bapakku] dari [Ibnu Ishaq] berkata; telah menceritakan kepadaku [Hisyam bin 'Urwah] dari [Bapaknya] dari ['ubaidhullah bin Abdullah bin 'Utbah] dari [Ra`ithah], istri Abdullah bin Mas'ud, dan ibu dari anaknya, dia adalah seorang yang biasa membuat kerajinan. ('Urwah) berkata; dia berinfak kepada (Abdullah) dan anaknya dari hasil kerjanya. Dia berkata; saya berkata kepada Abdullah bin Mas'ud, kamu dan anakmu telah menyibukkanku dari bersedekah, sehingga saya tidak bisa bersedekah bersama kalian. Abdullah berkata kepadanya 'Demi Allah, saya tidak suka kamu melakukannya jika kamu tidak mendapatkan pahala dari hal itu.' Raitah kontan mendatangi Rasulullah Shallallahu'alaihiwasallam dan berkata; 'Wahai Rasulullah, saya seorang wanita yang punya ketrampilan, yang hasilnya bisa saya jual, namun anak dan suamiku tidak ada nafkahnya selainnya, namun selanjutnya mereka menyibukkanku sehingga aku tidak bisa bersedekah, apakah saya mendapatkan pahala dari apa yang saya belanjakan?. Rasulullah Shallallahu'alaihiwasallam bersabda: \"Berinfaklah kepada mereka, karena hal itu menjadi pahala bagimu.\""
            },
            {
                "number": 870,
                "arab": "قَالَ حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ يَزِيدَ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ عَنْ أُمِّهِ قَالَتْرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمِي جَمْرَةَ الْعَقَبَةِ مِنْ بَطْنِ الْوَادِي يَوْمَ النَّحْرِ وَهُوَ يَقُولُ يَا أَيُّهَا النَّاسُ لَا يَقْتُلُ بَعْضُكُمْ وَلَا يُصِيبُ بَعْضُكُمْ وَإِذَا رَمَيْتُمْ الْجَمْرَةَ فَارْمُوهَا بِمِثْلِ حَصَى الْخَذْفِ فَرَمَى بِسَبْعٍ وَلَمْ يَقِفْ وَخَلْفَهُ رَجُلٌ يَسْتُرُهُ قُلْتُ مَنْ هَذَا قَالُوا الْفَضْلُ بْنُ الْعَبَّاسِ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Ibnu Fudlail] dari [Yazid] dari [Sulaiman bin 'Amr bin Al Ahwash] dari [ibunya] berkata; Aku melihat Rasulullah Shallallahu'alaihiwasallam sedang melempar jumrah Aqabah di tengah bukit pada Hari Nahr, sambil bersabda: \"Wahai manusia, janganlah kalian membunuh sebagian kalian, melempari sebagian lainnya. Jika kalian melempar Jumrah, lakukan dengan kerikil\". Lalu beliau melemparkan tujuh kali, dan tidak berdiri. Di belakangnya ada seorang laki-laki yang menutupinya. Saya bertanya, \"Ini siapa\"? mereka menjawab, \"Al Fadl bin Al 'Abbas.\""
            },
            {
                "number": 871,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ عَنْ أُمِّهِ وَكَانَتْ بَايَعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْسَمِعْتُ رَسُولَ اللَّهِ يَقُولُ وَهُوَ يَرْمِي الْجَمْرَةَ مِنْ بَطْنِ الْوَادِي وَهُوَ يَقُولُ يَا أَيُّهَا النَّاسُ لَا يَقْتُلْ بَعْضُكُمْ بَعْضًا وَإِذَا رَأَيْتُمْ الْجَمْرَةَ فَارْمُوهَا بِمِثْلِ حَصَى الْخَذْفِ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Yazid bin Abu Ziyad] dari [Sulaiman bin 'Amr bin Al Ahwash] dari [ibunya] dia adalah termasuk orang yang berbaiat kepada Nabi Shallallahu'alaihiwasallam, dia berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda sambil melempar jumrah Aqabah di tengah bukit \"Wahai manusia, janganlah kalian membunuh sebagian kalian, Jika kalian melakukan Jumrah, lakukan saja dengan kerikil.\""
            },
            {
                "number": 872,
                "arab": "قَالَ حَدَّثَنَا رَوْحٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ الْأَزْدِيِّ عَنْ أُمِّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا سَمِعَتْهُ يَقُولُ عِنْدَ جَمْرَةِ الْعَقَبَةِ يَا أَيُّهَا النَّاسُ لَا تَقْتُلُوا أَنْفُسَكُمْ وَارْمُوا الْجَمْرَةَ أَوْ الْجَمَرَاتِ بِمِثْلِ حَصَى الْخَذْفِهَذَا آخِرُ مُسْنَدِ الْمَكِّيِّينَ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Rouh] berkata; telah menceritakan kepada kami [Syu'bah] dari [Yazid bin Abu Ziyad] dari [Sulaiman bin 'Amr bin Al Ahwash Al Azdi] dari [ibunya] dari Nabi Shallallahu'alaihiwasallam, dia mendengar (Rasulullah Shallallahu'alaihiwasallam) bersabda ketika di jumrah Aqabah \"Wahai manusia, janganlah kalian membunuh diri kalian, lemparlah Jumrah dengan kerikil.\""
            },
            {
                "number": 873,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَقَالَ سُفْيَانُ مَرَّةً إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ إِلَى سُتْرَةٍ فَلْيَدْنُ مِنْهَا مَا لَا يَقْطَعُ الشَّيْطَانُ عَلَيْهِ صَلَاتَهُ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Shafwan bin Sulaim] dari [Nafi' bin Jubair] dari [Sahl bin Abu Hatsmah] sampai kepadanya bahwa Nabi Shallallahu'alaihiwasallam, --di lain waktu Sufyan berkata dengan redaksi Rasulullah (bukan nabi) Shallallahu'alaihiwasallam-- bersabda: \"Jika salah seorang di antara kalian sholat dengan pembatas, mendekatlah kepada pembatas tersebut, sehingga setan tidak dapat memotong sholatnya.\""
            },
            {
                "number": 874,
                "arab": "قَالَ أَخْبَرَنَا سُفْيَانُ عَنْ يَحْيَى بْنِ سَعِيدٍ سَمِعَ بُشَيْرَ بْنَ يَسَارٍ مَوْلَى بَنِي حَارِثَةَ قَالَ سُفْيَانُ هَذَا حَدِيثُ ابْنِ حَثْمَةَ يُخْبِرُ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَوَوُجِدَ عَبْدُ اللَّهِ بْنُ سَهْلٍ مِنْ الْأَنْصَارِ قَتِيلًا فِي قَلِيبٍ مِنْ قُلُبِ خَيْبَرَ فَجَاءَ عَمَّاهُ وَأَخُوهُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخُوهُ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَعَمَّاهُ حُوَيِّصَةُ وَمُحَيِّصَةُ فَذَهَبَ عَبْدُ الرَّحْمَنِ يَتَكَلَّمُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ الْكِبَرَ الْكِبَرَ فَتَكَلَّمَ أَحَدُ عَمَّيْهِ إِمَّا حُوَيِّصَةُ وَإِمَّا مُحَيِّصَةُ قَالَ سُفْيَانُ نَسِيتُ أَيُّهُمَا الْكَبِيرُ مِنْهُمَا فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا وَجَدْنَا عَبْدَ اللَّهِ قَتِيلًا فِي قَلِيبٍ مِنْ قُلُبِ خَيْبَرَ ثُمَّ ذَكَرَ يَهُودَ وَشَرَّهُمْ وَعَدَاوَتَهُمْ قَالَ لِيُقْسِمْ مِنْكُمْ خَمْسُونَ أَنَّ يَهُودَ قَتَلَتْهُ قَالُوا كَيْفَ نُقْسِمُ عَلَى مَا لَمْ نَرَ قَالَ فَتُبْرِئُكُمْ يَهُودُ بِخَمْسِينَ يَحْلِفُونَ أَنَّهُمْ لَمْ يَقْتُلُوهُ قَالُوا كَيْفَ نَرْضَى بِأَيْمَانِهِمْ وَهُمْ مُشْرِكُونَ قَالَ فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ فَرَكَضَتْنِي بَكْرَةٌ مِنْهُقِيلَ لِسُفْيَانَ فِي الْحَدِيثِ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ قَالَ هُوَ ذَا",
                "id": "(Ahmad bin hanbal) berkata; telah mengabarkan kepada kami [Sufyan] dari [Yahya bin Sa'id] telah mendengar [Busyair bin Yasar] budak Bani Haritsah, Sufyan berkata; ini adalah hadis Ibnu Hatsmah, yang mengabari dari [Sahl bin Abu Hatsmah], Abdullah bin Sahl seseorang dari Anshar diketemukan terbunuh di salah satu sumur tua di Khaibar. Dua pamannya dan saudara laki-lakinya mengadukan perkaranya kepada Rasulullah Shallallahu'alaihiwasallam. saudaranya yaitu Abdurrahman bin Sahl dan dua pamannya yaitu Huwaishah dan Muhaishah. Abdurrahman berangkat dan menceritakan kasusnya di sisi Rasulullah Shallallahu'alaihiwasallam. Hanya nabi shallallahu 'alaihi wasallam bersabda 'Tolong yang menyampaikan yang tua, tolong yang menyampaikan yang tua.' Selanjutnya salah seorang pamannya, entah Huwaishah, entah Muhaishah menyampaikan uneg-unegnya. [Sufyan] berkata; saya lupa mana yang lebih tua di antara keduanya. Dia berkata; Wahai Rasulullah, kami mendapatkan Abdullah terbunuh di salah satu sumur tua di Khaibar, lalu dia ceritakan orang Yahudi dan kejelekannya dan permusuhannya. Beliau bersabda: \"Hendaklah di antara kalian lima puluh orang yang bersumpah bahwa orang yahudi itu yang membunuhnya\". Mereka berkata; bagaimana kami bersumpah terhadap sebuah kasus yang tidak kami lihat!. Beliau bersabda: \"Suruhlah orang Yahudi terbebaskan dari kalian dengan cara lima puluh dari mereka bersumpah bahwa mereka tidak membunuhnya!\" Mereka berkata; bagaimana kami rela dengan sumpah mereka, sedangkan mereka adalah orang musyrik?. Lalu Rasulullah Shallallahu'alaihiwasallam membayarkan diyatnya dari hartanya sendiri, dan untanya menendangku. Dikatakan kepada Sufyan dalam hadis, dan kalian berhak atas darah saudara kalian. Dia menjawab, ya. Seperti itu."
            },
            {
                "number": 875,
                "arab": "قَالَ حَدَّثَنَا سُفْيَانُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ التَّمْرِ بِالتَّمْرِ وَرَخَّصَ فِي الْعَرَايَا أَنْ تُشْتَرَى بِخَرْصِهَا يَأْكُلُهَا أَهْلُهَا رُطَبًاقَالَ سُفْيَانُ قَالَ لِي يَحْيَى بْنُ سَعِيدٍ وَمَا عِلْمُ أَهْلِ مَكَّةَ بِالْعَرَايَا قُلْتُ أَخْبَرَهُمْ عَطَاءٌ سَمِعَهُ مِنْ جَابِرٍ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Sufyan] dari [Yahya bin Sa'id] dari [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah] berkata; Rasulullah melarang jual beli kurma dengan kurma tetapi beliau memberi pengecualian pada Al Araya yaitu pembelian kurma yang masih dalam batang pohonnya, sedang pemiliknya biasanya makan kurma yang masih mentah-mentah masak. Sufyan berkata; Yahya bin Sa'id berkata kepadaku, penduduk Makkah tidak mengetahui tentang Al Araya, lalu aku berkata; \"'Atho` telah mengabarkan kepada mereka, yang dia mendengarnya dari Jabir.\""
            },
            {
                "number": 876,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنَا خُبَيْبُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَسْعُودِ بْنِ نِيَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ قَالَأَتَانَا وَنَحْنُ فِي مَسْجِدِنَا قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَرَصْتُمْ فَخُذُوا وَدَعُوا دَعُوا الثُّلُثَ فَإِنْ لَمْ تَدَعُوا أَوْ تَجُدُّوا شُعْبَةُ الشَّاكُّ الثُّلُثَ فَالرُّبُعَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] berkata; telah menceritakan kepada kami [Khubaib bin Abdurrahman] dari [Abdurrahman bin Mas'ud bin Niyar] dari [Sahl bin Abu Hatsmah] berkata; telah kepada kami dan kami waktu itu di masjid kami, (Sahl bin Abu Hatsmah) berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Jika kalian menaksir (kurma dalam pohon) maka ambillah dan tinggalkanlah sepertiganya, jika kalian tidak meninggalkannya atau kalian memanennya, --Syu'bah ragu kepastian redaksinya-- maka sepertiga atau seperempat."
            },
            {
                "number": 877,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي خُبَيْبُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَسْعُودِ بْنِ نِيَارٍ قَالَأَتَانَا سَهْلُ بْنُ أَبِي حَثْمَةَ فِي مَسْجِدِنَا فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَرَصْتُمْ فَخُذُوا وَدَعُوا دَعُوا الثُّلُثَ فَإِنْ لَمْ تَجُدُّوا أَوْ تَدَعُوا فَالرُّبُعَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Syu'bah] berkata; telah mengabarkan kepadaku [Khubaib bin Abdurrahman] dari [Abdurrahman bin Mas'ud bin Niyar] berkata; [Sahl bin Abu Hatsmah] menemui kami di masjid kami, lalu (Sahl bin Abu Hatsmah) berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Jika kalian menaksir (kurma dalam pohon) maka ambillah dan tinggalkanlah sepertiganya, jika kalian tidak meninggalkannya atau memanennya maka seperempatnya."
            },
            {
                "number": 878,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ بَكْرِ بْنِ خُنَيْسٍ قَالَ أَخْبَرَنَا حَجَّاجٌ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو وَالْحَجَّاجِ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ عَنْ عَمِّهِ سَهْلِ بْنِ أَبِي حَثْمَةَ قَالَكَانَتْ حَبِيبَةُ ابْنَةُ سَهْلٍ تَحْتَ ثَابِتِ بْنِ قَيْسِ بْنِ شَمَّاسٍ الْأَنْصَارِيِّ فَكَرِهَتْهُ وَكَانَ رَجُلًا دَمِيمًا فَجَاءَتْ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي لَأَرَاهُ فَلَوْلَا مَخَافَةُ اللَّهِ عَزَّ وَجَلَّ لَبَزَقْتُ فِي وَجْهِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَرُدِّينَ عَلَيْهِ حَدِيقَتَهُ الَّتِي أَصْدَقَكِ قَالَتْ نَعَمْ فَأَرْسَلَ إِلَيْهِ فَرَدَّتْ عَلَيْهِ حَدِيقَتَهُ وَفَرَّقَ بَيْنَهُمَا قَالَ فَكَانَ ذَلِكَ أَوَّلَ خُلْعٍ كَانَ فِي الْإِسْلَامِ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Abdul Qudus bin Bakr bin Khunais] berkata; telah mengabarkan kepada kami [Hajjaj] dari ['Amr bin Syua'ib] dari [Bapaknya] dari [Abdullah bin 'Amr] dan [Al Hajjaj] dari [Muhammad bin Sulaiman bin Abu Khatsmah] dari [pamannya, Sahal bin Abu Khatsmah] berkata; \"Habibah anak perempuan Sahal diperistri oleh Tsabit bin Qais bin Syamas Al Anshory, dia seorang laki-laki yang buruk mukanya, dan perempuan tersebut membencinya. Lalu datang kepada Nabi Shallallahu'alaihiwasallam, berkata; \"Wahai Rasulullah, kalaulah bukan karena saya takut pada Allah, pastilah aku meludahi wajahnya\", lalu Rasulullah bersabda: \"Apakah engkau mau mengembalikan kebun yang telah dia berikan kepadamu?\" maka perempuan itu menjawab, \"Ya\". Selanjutnya dikirimlah (utusan) kepada Tsabit bin Qais dan dikembalikan kebunnya, keduanya kemudian bercerai. (Sahal bin Abu Khatsmah) berkata; itulah Khulu' (permintaan cerai dari pihak perempuan, pent) yang pertama dalam Islam."
            },
            {
                "number": 879,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ حَدَّثَنِي بُشَيْرُ بْنُ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ قَالَخَرَجَ عَبْدُ اللَّهِ بْنُ سَهْلٍ أَخُو بَنِي حَارِثَةَ يَعْنِي فِي نَفَرٍ مِنْ بَنِي حَارِثَةَ إِلَى خَيْبَرَ يَمْتَارُونَ مِنْهَا تَمْرًا قَالَ فَعُدِيَ عَلَى عَبْدِ اللَّهِ بْنِ سَهْلٍ فَكُسِرَتْ عُنُقُهُ ثُمَّ طُرِحَ فِي مَنْهَرٍ مِنْ مَنَاهِرِ عُيُونِ خَيْبَرَ وَفَقَدَهُ أَصْحَابُهُ فَالْتَمَسُوهُ حَتَّى وَجَدُوهُ فَغَيَّبُوهُ قَالَ ثُمَّ قَدِمُوا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقْبَلَ أَخُوهُ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَابْنَا عَمِّهِ حُوَيِّصَةُ وَمُحَيِّصَةُ وَهُمَا كَانَا أَسَنَّ مِنْ عَبْدِ الرَّحْمَنِ وَكَانَ عَبْدُ الرَّحْمَنِ إِذًا أَقْدَمَ الْقَوْمِ وَصَاحِبَ الدَّمِ فَتَقَدَّمَ لِذَلِكَ فَكَلَّمَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ ابْنَيْ عَمِّهِ حُوَيِّصَةَ وَمُحَيِّصَةَ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكِبَرَ الْكِبَرَ فَاسْتَأْخَرَ عَبْدُ الرَّحْمَنِ وَتَكَلَّمَ حُوَيِّصَةُ ثُمَّ تَكَلَّمَ مُحَيِّصَةُ ثُمَّ تَكَلَّمَ عَبْدُ الرَّحْمَنِ فَقَالُوا يَا رَسُولَ اللَّهِ عُدِيَ عَلَى صَاحِبِنَا فَقُتِلَ وَلَيْسَ بِخَيْبَرَ عَدُوٌّ إِلَّا يَهُودَ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُسَمُّونَ قَاتِلَكُمْ ثُمَّ تَحْلِفُونَ عَلَيْهِ خَمْسِينَ يَمِينًا ثُمَّ تُسْلِمُهُ قَالَ فَقَالُوا يَا رَسُولَ اللَّهِ مَا كُنَّا لِنَحْلِفَ عَلَى مَا لَمْ نَشْهَدْ قَالَ فَيَحْلِفُونَ لَكُمْ خَمْسِينَ يَمِينًا وَيَبْرَءُونَ مِنْ دَمِ صَاحِبِكُمْ قَالُوا يَا رَسُولَ اللَّهِ مَا كُنَّا لِنَقْبَلَ أَيْمَانَ يَهُودَ مَا هُمْ فِيهِ مِنْ الْكُفْرِ أَعْظَمُ مِنْ أَنْ يَحْلِفُوا عَلَى إِثْمٍ قَالَ فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ مِائَةَ نَاقَةٍقَالَ يَقُولُ سَهْلٌ فَوَاللَّهِ مَا أَنْسَى بَكْرَةً مِنْهَا حَمْرَاءَ رَكَضَتْنِي وَأَنَا أَحُوزُهَا",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [bapakku] dari [Ibnu Ishaq] telah menceritakan kepadaku [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah] berkata; Abdullah bin Sahl dari Bani Haritsah keluar bersama beberapa orang dari sukunya menuju Khaibar, hendak mengambil kurma. (Sahl bin Abu Hatsmah) berkata; Lalu Abdullah bin Sahl diculik, lehernya dipotong, dan dicampakkan di salah satu mata air Khaibar. Para sahabatnya merasa kehilangan dirinya, lalu mereka mencarinya sampai mereka mendapatkannya setelah lama hilang. Mereka datangi Rasulullah Shallallahu'alaihiwasallam. Selanjutnya saudaranya, Abdurrahman bin Sahl dan dua anak pamannya, yaitu Huwaishah dan Muhaishah datang, mereka berdua lebih tua daripada Abdurrahman. Abdurrahman adalah orang yang paling pemberani dan yang berhak menuntut darahnya. Karenanya dialah yang maju sebagai pembicara dan berkata kepada Rasulullah Shallallahu'alaihiwasallam sebelum kedua anak pamannya yaitu Huwaishah dan Muhaishah. Hanya Rasulullah Shallallahu'alaihiwasallam menegur, \"Maaf, yang bicara silahkan yang tua, yang bicara silahkan yang lebih tua\". Lalu Abdurrahman mundur dan Huwaishah berkata; dan diikuti Muhaishah. Lalu Abdurrahman juga berbicara, mereka berkata; Wahai Rasulullah, telah di culik saudara kami dan dibunuh dan kami tidak mempunyai musuh di Khaibar kecuali orang Yahudi. (Sahl bin Abu Hatsmah) berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tolong kalian sebutkan nama pembunuhnya lalu kalian bersumpah dengan cara menghadirkan lima orang diantara kalian yang kesemua bersumpah bahwa orang itu yang membunuhnya, setelah itu kaum yahudi harus menyerahkannya\". (Sahl bin Abu Hatsmah) berkata; kami bertiga berkata; \"Wahai Rasulullah, kami tidak akan bersumpah atas suatu kasus yang kami tidak menyaksikannya sendiri\". Beliau bersabda: \" Kalau begitu, suruhlah kaum yahudi untuk mendatangkan lima puluh orang dan kesemuanya bersumpah bahwa bukan dari merekalah yang membunuhnya dan mereka akan terlepas dari tuntutan darah sahabat kalian\". Mereka berkata; Wahai Rasulullah, kami tidak bakalan menerima sumpah orang Yahudi karena kekufuran yang mereka pegang teguh jauh lebih besar daripada sekedar melakukan sumpah dosa. (Sahl bin Abu Hatsmah) berkata; lalu Rasulullah Shallallahu'alaihiwasallam sendiri yang membayar diyatnya dengan seratus unta. (Busyair bin Yasar) berkata; Sahl berkata; demi Allah, saya tidak melupakan unta di antaranya yang berwarna merah yang menendangku ketika aku melewatinya."
            },
            {
                "number": 880,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ إِدْرِيسَ الشَّافِعِيُّ قَالَ حَدَّثَنَا مَالِكٌ عَنِ أَبِي لَيْلَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَهْلِ بْنِ أَبِي حَثْمَةَ أَنَّ سَهْلَ بْنَ أَبِي حَثْمَةَ أَخْبَرَهُ وَرِجَالٌ مِنْ كُبَرَاءِ قَوْمِهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِحُوَيِّصَةَ وَمُحَيِّصَةَ وَعَبْدِ الرَّحْمَنِ أَتَحْلِفُونَ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ قَالُوا لَا قَالَ فَتَحْلِفُ يَهُودُ قَالُوا لَيْسُوا بِمُسْلِمِينَ فَوَدَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Muhammad bin Idris Asy-Syafi'i] berkata; telah menceritakan kepada kami [Malik] dari [Abu Laila bin Abdullah bin Abdurrahman bin Sahl bin Abu Hatsmah], [Sahl bin Abu Hatsmah] mengabarinya dari [beberapa orang dari pembesar kaumnya], Rasulullah Shallallahu'alaihiwasallam bersabda kepada Huwaishah, Muhaishah dan Abdurrahman, Apakah kalian mau bersumpah dan berhak mendapatkan tuntutan darah sahabat kalian? Mereka berkata; 'Tidak.' Beliau bersabda: 'Kalau kalian tidak mau bersumpah, biarlah kaum yahudi yang bersumpah.' Mereka berkata 'Jangan, mereka bukan orang muslim' lalu Nabi Shallallahu'alaihiwasallam menebus diyatnya dari hartanya sendiri."
            },
            {
                "number": 881,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا سَعِيدُ بْنُ يَزِيدَ يَعْنِي أَبَا مَسْلَمَةَ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَسِيدٍ قَالَسَمِعْتُ رَجُلًا قَالَ لِابْنِ الزُّبَيْرِ أَفْتِنَا فِي نَبِيذِ الْجَرِّ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْهُ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Ibrahim] telah menceritakan kepada kami [Sa'id bin Yazid] yaitu Abu Maslamah berkata; telah menceritakan kepada kami ['Abdul Aziz bin Usaid] berkata; Aku mendengar seorang laki-laki berkata kepada [Ibnu Zubair], \"Berilah kami fatwa tentang perasan kurma yang direndam dalam suatu bejana tanah liat\" (Abdul Aziz bin Usaid) berkata; aku mendengar Rasulullah melarang hal tersebut. "
            },
            {
                "number": 882,
                "arab": "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ بَكْرِ بْنِ خُنَيْسٍ قَالَ أَخْبَرَنَا حَجَّاجٌ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ افْتَتَحَ الصَّلَاةَ فَرَفَعَ يَدَيْهِ حَتَّى جَاوَزَ بِهِمَا أُذُنَيْهِقَالَ قُرِئَ عَلَى سُفْيَانَ وَأَنَا شَاهِدٌ سَمِعْتُ ابْنَ عَجْلَانَ وَزِيَادَ بْنَ سَعْدٍ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو هَكَذَا وَعَقَدَ ابْنُ الزُّبَيْرِ",
                "id": "Telah menceritakan kepada kami [Abdulquddus bin Bakr bin Khunais] berkata; telah mengabarkan kepada kami [Hajjaj] dari ['Amir bin Abdullah Az Zubair] dari [Bapaknya] berkata; Aku melihat Rasulullah memulai sholat dan mengangkat kedua tangannya sampai melewati kedua daun telinganya. (Ahmad bin hanbal) berkata; dibacakan hadis ini di hadapan [Sufyan] dan aku menyaksikan, aku mendengar [Ibnu 'Ajlan] dan [Ziyad bin Sad] dari ['Amir bin Abdullah bin Zubair] dari [bapaknya] berkata; saya melihat Nabi Shallallahu'alaihiwasallam berdoa seperti ini dan Abu Zubair melipat tangannya."
            },
            {
                "number": 883,
                "arab": "قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِي الْبَخْتَرِيِّ عَنْ عَبِيدَةَ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَجُلًا حَلَفَ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ كَاذِبًا فَغَفَرَ اللَّهُ لَهُقَالَ شُعْبَةُ مِنْ قَبْلِ التَّوْحِيدِ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] dari ['Atho` bin As-Sa`Ib] dari [Abu Al Bukhtari] dari ['Abidah] dari [Abdullah bin Az Zubair] dari Nabi Shallallahu'alaihiwasallam, ada seorang laki-laki bersumpah dengan nama Allah yang tidak ada ilah selain-Nya namun ia bohong dalam sumpahnya, maka Allah akan mengampuni dosanya, Syu'bah berkata; \"Itulah bagian dari tauhid\"."
            },
            {
                "number": 884,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ يُوسُفَ عَنِ ابْنِ الزُّبَيْرِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ أَنْتَ أَكْبَرُ وَلَدِ أَبِيكَ فَاحْجُجْ عَنْهُ",
                "id": "Telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dari [Manshur] dari [Mujahid] dari [Yusuf] dari [Ibnu Zubair] Nabi Shallallahu'alaihiwasallam bersabda kepada seorang laki-laki, \"Kamu adalah yang paling tua dari anak bapakmu, maka hajikanlah bapakmu.\""
            },
            {
                "number": 885,
                "arab": "قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنِي أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي أَبِي إِسْحَاقُ بْنُ يَسَارٍ قَالَإِنَّا لَبِمَكَّةَ إِذْ خَرَجَ عَلَيْنَا عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ فَنَهَى عَنْ التَّمَتُّعِ بِالْعُمْرَةِ إِلَى الْحَجِّ وَأَنْكَرَ أَنْ يَكُونَ النَّاسُ صَنَعُوا ذَلِكَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَلَغَ ذَلِكَ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ فَقَالَ وَمَا عِلْمُ ابْنِ الزُّبَيْرِ بِهَذَا فَلْيَرْجِعْ إِلَى أُمِّهِ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ فَلْيَسْأَلْهَا فَإِنْ لَمْ يَكُنْ الزُّبَيْرُ قَدْ رَجَعَ إِلَيْهَا حَلَالًا وَحَلَّتْ فَبَلَغَ ذَلِكَ أَسْمَاءَ فَقَالَتْ يَغْفِرُ اللَّهُ لِابْنِ عَبَّاسٍ وَاللَّهِ لَقَدْ أَفْحَشَ قَدْ وَاللَّهِ صَدَقَ ابْنُ عَبَّاسٍ لَقَدْ حَلُّوا وَأَحْلَلْنَا وَأَصَابُوا النِّسَاءَ",
                "id": "(Ahmad bin hanbal) berkata; telah menceritakan kepada kami [Ya'qub bin Ibrahim] berkata; telah menceritakan kepadaku [bapakku] dari [Ibnu Ishaq] berkata; telah menceritakan kepadaku [Abu Ishaq bin Yasar] berkata; \"Ketika kami sedang berada di Makkah, tiba-tiba Abdullah Bin Zubair menemui kami, beliau melarang Haji dengan cara tamattu' (melaksanakan umrah lantas diikuti haji) dan beliau mengingkari bahwa para sahabat pernah melakukan yang demikian bersama Rasulullah Shallallahu'alaihiwasallam. Hal tersebut sampai kepada [Abdullah bin 'Abbas], lalu dia berkata; apa yang diketahui oleh Ibnu Az Zubair tentang hal itu, hendaklah dia merujuk kepada ibunya [Asma` binti Abu Bakar], dan menanyakan kepadanya. Jika dia tidak mau merujuk kepadanya, maka berarti dia telah bertahalul dan juga ibunya. Hal itu sampai pada Asma`, lalu dia berkata; semoga Allah mengampuni Ibnu Abbas, demi Allah, dia telah berbuat kekejian. Demi Allah, Ibnu Abbas benar, mereka telah bertahallul dan juga kami dan mereka mendatangi para isteri-isterinya."
            },
            {
                "number": 886,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ قَالَ حَدَّثَنَا هِشَامٌ يَعْنِي ابْنَ عُرْوَةَ عَنْ أَبِي الزُّبَيْرِ قَالَكَانَ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ يَقُولُ فِي دُبُرِ كُلِّ صَلَاةٍ حِينَ يُسَلِّمُ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ لَا إِلَهَ إِلَّا اللَّهُ وَلَا نَعْبُدُ إِلَّا إِيَّاهُ وَلَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ لَا إِلَهَ إِلَّا اللَّهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الْكَافِرُونَ قَالَ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُهَلِّلُ بِهِنَّ دُبُرَ كُلِّ صَلَاةٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Numair] berkata; telah menceritakan kepada kami [Hisyam] yaitu Ibnu 'Urwah dari [Abu Az Zubair] berkata; [Abdullah bin Az Zubair] memanjatkan doa-doa setelah melaksanakan sholat ketika salam, \"LA ILAHA ILLA ALLAH WAHDAHU LA SYARIKA LAHU, LAHUL MULKU WA LAHUL HAMDU WA HUWA ALA KULLI SYAIIN QODIIR. LA HAULA WALA QUWWATA ILLA BILLAH LA ILAHA ILLALLAHU WA LA NA'BUDU ILLA IYYAHU WA LAHU NI'MAH WA LAHUL FADLU WALAHU TSANAU AL HASAN LA ILLA HA ILLALLAH MUKHLISIINA LAHUDDINA WALAU KARIHAL KAFIRUN\" (Tidak ada tuhan selain Allah, dan tidak ada sekutu bagi-Nya dan Dia Maha Kuasa atas segala sesuatu. Tidak ada kekuatan selain kekuatan Allah bagi-Nya segala kenikmatan dan keutamaan yang baik, tidak ada tuhan selain Allah orang-orang yang ihlas baginya agama walaupun kaum kafir membencinya). (Abdullah bin Az Zubair) berkata; Rasulullah Shallallahu'alaihiwasallam membaca kalimat tahlil dengan kalimat tersebut setiap selesai sholat."
            },
            {
                "number": 887,
                "arab": "حَدَّثَنَا مُوسَى بْنُ دَاوُدَ حَدَّثَنَا نَافِعٌ يَعْنِي ابْنَ عُمَرَ عَنِ ابْنِ أَبِي مُلَيْكَةَ فَقَالَ ابْنُ الزُّبَيْرِفَمَا كَانَ عُمَرُ يَسْمَعُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ هَذِهِ الْآيَةِ حَتَّى يَسْتَفْهِمَهُ يَعْنِي قَوْلَهُ تَعَالَى{ لَا تَرْفَعُوا أَصْوَاتَكُمْ فَوْقَ صَوْتِ النَّبِيِّ }",
                "id": "Telah menceritakan kepada kami [Musa bin Daud] berkata; telah menceritakan kepada kami [Nafi'] yaitu Ibnu 'Umar dari [Ibnu Abu Mulaikah], [Ibnu Az Zubair] berkata; 'Umar tidak mau mendengar Nabi Shallallahu'alaihiwasallam setelah ayat ini, sampai dia meminta kefahaman yaitu firman (Allah) Ta'ala, 'Janganlah kalian mengangkat suara kalian di atas suara Nabi'.\""
            },
            {
                "number": 888,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ فَحَدَّثَنِي وَهْبُ بْنُ كَيْسَانَ مَوْلَى ابْنِ الزُّبَيْرِ قَالَسَمِعْتُ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ فِي يَوْمِ الْعِيدِ يَقُولُ حِينَ صَلَّى قَبْلَ الْخُطْبَةِ ثُمَّ قَامَ يَخْطُبُ النَّاسَ يَا أَيُّهَا النَّاسُ كَذَا سُنَّةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim] berkata; telah menceritakan kepada kami [bapakku] dari [Ibnu Ishaq] berkata; telah menceritakan kepada kami [Wahab bin Kaisan] budak Ibnu Zubair, berkata; aku mendengar [Abdullah bin Zubair] pada Hari Raya ia melakukan sholat sebelum khutbah, kemudian berdiri dan berkhutbah di hadapan manusia, \"Wahai segenap manusia, beginilah sunnah Rasulullah Shallallahu'alaihiwasallam.\""
            }
        ]
    }
}