{
    "status": true,
    "data": {
        "start": 2221,
        "end": 2368,
        "total": 148,
        "book": "ahmad",
        "hadits": [
            {
                "number": 2221,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنِي سُفْيَانُ الْعُصْفُرِيُّ عَنْ أَبِيهِ عَنْ حَبِيبِ بْنِ النُّعْمَانِ الْأَسَدِيِّ أَحَدُ بَنِي عَمْرِو بْنِ أَسَدٍ عَنْ خُرَيْمِ بْنِ فَاتِكٍ الْأَسَدِيِّ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ فَلَمَّا انْصَرَفَ قَامَ قَائِمًا فَقَالَ عَدَلَتْ شَهَادَةُ الزُّورِ الْإِشْرَاكَ بِاللَّهِ عَزَّ وَجَلَّ ثُمَّ تَلَا هَذِهِ الْآيَةَ{ وَاجْتَنِبُوا قَوْلَ الزُّورِ حُنَفَاءَ لِلَّهِ غَيْرَ مُشْرِكِينَ بِهِ }",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid] telah menceritakan kepadaku [Sufyan Al Ushfuri] dari [bapaknya] dari [Habib bin Nu'man Al Asadi] salah seorang dari Bani Amru bin Asad, dari [Khuraim bin Fatik Al Asadi] ia berkata; Rasulullah shallallahu 'alaihi wasallam menunaikan sholat subuh. Setelah itu, beliau berdiri dan bersabda: \"Persaksikan palsu dosanya, menyamai dosa perbuatan syirik kepada Allah 'azza wajalla.\" Kemudian beliau membaca ayat ini; \"Maka jauhilah olehmu berhala-berhala yang najis itu dan jauhilah perkataan-perkataan dusta.31. Dengan ikhlas kepada Allah, tidak mempersekutukan sesuatu dengan Dia.\""
            },
            {
                "number": 2222,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ أَبِي إِسْحَاقَ عَنْ شِمْرٍ عَنْ خُرَيْمٍ رَجُلٍ مِنْ بَنِي أَسَدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْلَا أَنْ فِيكَ اثْنَتَيْنِ كُنْتَ أَنْتَ قَالَ إِنْ وَاحِدَةً تَكْفِينِي قَالَ تُسْبِلُ إِزَارَكَ وَتُوَفِّرُ شَعْرَكَ قَالَ لَا جَرَمَ وَاللَّهِ لَا أَفْعَلُ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] Telah menceritakan kepada kami [Ma'mar] dari [Abu Ishaq] dari [Syimr] dari [Khuraim] seorang laki-laki dari Bani Asad, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya pada tidak terdapat dua hal, niscaya kamu ankan menjadi..\" Khuraim berkata, \"Kalu satu, apakah telah cukup.\" beliau bersabda: \"Kamu menjulurkan kainmu dan memanjangkan rambutmu.\" Khuraim berkata, \"Tidak ada masalah, demi Allah, saya tidak akan lagi melakukannya.\""
            },
            {
                "number": 2223,
                "arab": "حَدَّثَنَا يَزِيدُ أَخْبَرَنَا الْمَسْعُودِيُّ عَنِ الرُّكَيْنِ بْنِ الرَّبِيعِ عَنْ رَجُلٍ عَنْ خُرَيْمِ بْنِ فَاتِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَعْمَالُ سِتَّةٌ وَالنَّاسُ أَرْبَعَةٌ فَمُوجِبَتَانِ وَمِثْلٌ بِمِثْلٍ وَحَسَنَةٌ بِعَشْرِ أَمْثَالِهَا وَحَسَنَةٌ بِسَبْعِ مِائَةٍ فَأَمَّا الْمُوجِبَتَانِ فَمَنْ مَاتَ لَا يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ وَمَنْ مَاتَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ النَّارَ وَأَمَّا مِثْلٌ بِمِثْلٍ فَمَنْ هَمَّ بِحَسَنَةٍ حَتَّى يَشْعُرَهَا قَلْبُهُ وَيَعْلَمَهَا اللَّهُ مِنْهُ كُتِبَتْ لَهُ حَسَنَةً وَمَنْ عَمِلَ سَيِّئَةً كُتِبَتْ عَلَيْهِ سَيِّئَةً وَمَنْ عَمِلَ حَسَنَةً فَبِعَشْرِ أَمْثَالِهَا وَمَنْ أَنْفَقَ نَفَقَةً فِي سَبِيلِ اللَّهِ فَحَسَنَةٌ بِسَبْعِ مِائَةٍ وَأَمَّا النَّاسُ فَمُوَسَّعٌ عَلَيْهِ فِي الدُّنْيَا مَقْتُورٌ عَلَيْهِ فِي الْآخِرَةِ وَمَقْتُورٌ عَلَيْهِ فِي الدُّنْيَا مُوَسَّعٌ عَلَيْهِ فِي الْآخِرَةِ وَمَقْتُورٌ عَلَيْهِ فِي الدُّنْيَا وَالْآخِرَةِ وَمُوَسَّعٌ عَلَيْهِ فِي الدُّنْيَا وَالْآخِرَةِ",
                "id": "Telah menceritakan kepada kami [Yazid] telah mengabarkan kepada kami [Al Mas'udi] dari [Ar Rukain bin Ar Rabi'] dari [seorang laki-laki] dari [Khuraim bin Fatik] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"(Balasan) amalan itu ada enam, sedangkan manusia ada empat (golongan). Yaitu, Mujibatan (amalan yang mendapatkan dua balasan) Mitslu bi Mitslin (amalan yang mendapat balasan yang setimpal), amalan yang akan dilipatgandakan menjadi sepuluh kebaikan, dan amalan kebaikan yang menjadi tujuh ratus. Adapun Mujibatan adalah; siapa saja yang meninggal dalam keadaan tidak menyekutukan Allah dengan sesuatu apapun, maka dia akan masuk surga. Dan barangsiapa yang meninggal dalam keadaan menyekutukan Allah dengan sesuatu yang lain, maka ia akan masuk neraka. (Adapun) Mitslu bi Mitslin; Siapa yang berkeinginan untuk melakukan kebaikan hingga hatinya merasakannya, dan Allah pun tahu akan hal itu, maka hal itu akan ditulis baginya menjadi satu kebaikan. Barangsiapa yang mengerjakan amal keburukan, maka akan ditulis atasnya satu keburukan. Namun barangsiapa yang beramal kebajikan, maka akan dicatat baginya sepuluh kebaikan semisalnya. Dan siapa yang memberikan nafkah di jalan Allah, maka satu kebaikan itu (dilipatgandakan menjadi) tujuh ratus kali. Sedangkan manusia itu ada empat yaitu; (pertama) seorang yang mendapat kelapangan di dunia, namun di akhirat, yang ia dapatkan adalah kesempitan. (kedua) seorang yang mendapat kelapangan di akhirat, namun ia selalu berada dalam kesempitan di dunia. (yang ketiga) seorang yang mendapat kesempitan baik di dunia maupun di akhirat. Dan (yang keempat) seorang yang mendapat kelapangan di dunia dan juga kelapangan di di akhirat.\""
            },
            {
                "number": 2224,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا أَبُو بَكْرٍ عَنْ أَبِي إِسْحَاقَ عَنْ شِمْرِ بْنِ عَطِيَّةَ عَنْ خُرَيْمِ بْنِ فَاتِكٍ الْأَسَدِيِّ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِعْمَ الرَّجُلُ أَنْتَ يَا خُرَيْمُ لَوْلَا خُلَّتَانِ فِيكَ قُلْتُ وَمَا هُمَا يَا رَسُولَ اللَّهِ قَالَ إِسْبَالُكَ إِزَارَكَ وَإِرْخَاؤُكَ شَعْرَكَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Adam] telah menceritakan kepada kami [Abu Bakar] dari [Abu Ishaq] dari [Syimr bin 'Athiyyah] dari [Khuraim bin Fatik Al Asadi] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Senikmat-nikmat laki-laki adalah kamu wahai Khuraim, sekiranya bukan karena dua hal yang ada padamu.\" Saya berkata, \"Apakah kedua hal itu wahai Rasulullah?\" berliau menjawab: \"(Yaitu) kainmu yang Isbal (menjulur hingga melewati kedua mata kaki) dan rambutmu yang panjang.\""
            },
            {
                "number": 2225,
                "arab": "حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ أَخْبَرَنَا سُفْيَانُ بْنُ زِيَادٍ عَنْ فَاتِكِ بْنِ فَضَالَةَ عَنْ أَيْمَنَ بْنِ خُرَيْمٍ قَالَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطِيبًا فَقَالَ يَا أَيُّهَا النَّاسُ عَدَلَتْ شَهَادَةُ الزُّورِ إِشْرَاكًا بِاللَّهِ عَزَّ وَجَلَّ ثَلَاثًا ثُمَّ قَالَ{ اجْتَنِبُوا الرِّجْسَ مِنْ الْأَوْثَانِ وَاجْتَنِبُوا قَوْلَ الزُّورِ }",
                "id": "Telah menceritakan kepada kami [Marwan bin Mu'awiyah] telah mengabarkan kepada kami [Sufyan bin Ziyad] dari [Fatik bin Fadlalah] dari [Aiman bin Khuraim] ia berkata; Rasulullah shallallahu 'alaihi wasallam berdiri menyampaikan khutbah seraya bersabda: \"Wahai sekalian manusia, persaksikan palsu menyamai dosa perbuatan syirik kepada Allah 'azza wajalla.\" Beliau mengucapkannya hingga tiga kali. Kemudian beliau bersabda: \"Jauihilah perkara najis dan kotor dari berhala-berhala, serta jauhilah persaksian palsu.\""
            },
            {
                "number": 2226,
                "arab": "حَدَّثَنَا يَعْلَى حَدَّثَنَا مِسْعَرٌ عَنْ زِيَادِ بْنِ عِلَاقَةَ عَنْ عَمِّهِ قُطْبَةَ بْنِ مَالِكٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْفَجْرِ وَالنَّخْلَ بَاسِقَاتٍ",
                "id": "Telah menceritakan kepada kami [Ya'la] Telah menceritakan kepada kami [Mis'ar] dari [Ziyad bin Ilaqah] dari [pamannya, Quthbah bin Malik], ia berkata; Pada saat sholat Fajar, saya mendengar Rasulullah shallallahu 'alaihi wasallam membaca: \"WAN NAKHLI BAASIQAAT.\""
            },
            {
                "number": 2227,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ عَطَاءٍ يَعْنِي ابْنَ السَّائِبِ عَنْ رَجُلٍ مِنْ بَكْرِ بْنِ وَائِلٍ عَنْ خَالِهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أُعْشِرُ قَوْمِي فَقَالَ إِنَّمَا الْعُشُورُ عَلَى الْيَهُودِ وَالنَّصَارَى وَلَيْسَ عَلَى الْإِسْلَامِ عُشُورٌ",
                "id": "Telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dari ['Atha`] yakni Ibnu Sa`ib, dari [seorang laki-laki] dari Bakr bin Wa`il, dari [pamannya] ia berkata; Saya bertanya, \"Wahai Rasulullah, bolehkah aku melakukan Al 'Usyru (mengambil sepersepuluh) dari harta kaumku?\" Maka beliau bersabda: \"Yang melakukan Al 'Usyru hanyalah kaum Yahudi dan Nasrani. Tidak ada Usyru atas kaum muslimin.\""
            },
            {
                "number": 2228,
                "arab": "حَدَّثَنَا وَكِيعٌ وَأَبُو مُعَاوِيَةَ قَالَا ثَنَا الْأَعْمَشُ عَنْ يَعْقُوبَ بْنِ بَحِيرٍ عَنْ ضِرَارِ بْنِ الْأَزْوَرِ قَالَبَعَثَنِي أَهْلِي بِلَقُوحٍ وَقَالَ أَبُو مُعَاوِيَةَ بِلَقْحٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَيْتُهُ بِهَا فَأَمَرَنِي أَنْ أَحْلُبَهَا ثُمَّ قَالَ دَعْ دَاعِيَ اللَّبَنِقَالَ أَبُو مُعَاوِيَةَ لَا تُجْهِدَنَّهَا",
                "id": "Telah menceritakan kepada kami [Waki'] dan [Abu Mu'awiyah] keduanya berkata, Telah menceritakan kepada kami [Al A'masy] dari [Ya'qub bin Bahir] dari [Dlirar bin Al Azwar] ia berkata; Keluargaku mengutusku menghadap Nabi shallallahu 'alaihi wasallam dengan membawa Laquh (Unta bunting yang hampir beranak), maka aku pun mendatangi beliau. Kemudian beliau menyuruhku untuk memeras susunya dan bersabda: \"Tinggalkanlah sedikit susunya, untuk memancing air susu yang lain.\" Abu Mu'awiyah berkata; \"Janganlah kamu mengeringkan (air susunya).\""
            },
            {
                "number": 2229,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ وَقَالَ ابْنُ شِهَابٍ الزُّهْرِيُّ حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ زَمْعَةَ بْنِ الْأَسْوَدِ بْنِ الْمُطَّلِبِ بْنِ أَسَدٍ قَالَلَمَّا اسْتُعِزَّ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا عِنْدَهُ فِي نَفَرٍ مِنْ الْمُسْلِمِينَ قَالَ دَعَا بِلَالٌ لِلصَّلَاةِ فَقَالَ مُرُوا مَنْ يُصَلِّي بِالنَّاسِ قَالَ فَخَرَجْتُ فَإِذَا عُمَرُ فِي النَّاسِ وَكَانَ أَبُو بَكْرٍ غَائِبًا فَقَالَ قُمْ يَا عُمَرُ فَصَلِّ بِالنَّاسِ قَالَ فَقَامَ فَلَمَّا كَبَّرَ عُمَرُ سَمِعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَوْتَهُ وَكَانَ عُمَرُ رَجُلًا مُجْهِرًا قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَيْنَ أَبُو بَكْرٍ يَأْبَى اللَّهُ ذَلِكَ وَالْمُسْلِمُونَ يَأْبَى اللَّهُ ذَلِكَ وَالْمُسْلِمُونَ قَالَ فَبَعَثَ إِلَى أَبِي بَكْرٍ فَجَاءَ بَعْدَ أَنْ صَلَّى عُمَرُ تِلْكَ الصَّلَاةَ فَصَلَّى بِالنَّاسِ قَالَ وَقَالَ عَبْدُ اللَّهِ بْنُ زَمْعَةَ قَالَ لِي عُمَرُ وَيْحَكَ مَاذَا صَنَعْتَ بِي يَا ابْنَ زَمْعَةَ وَاللَّهِ مَا ظَنَنْتُ حِينَ أَمَرْتَنِي إِلَّا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَكَ بِذَلِكَ وَلَوْلَا ذَلِكَ مَا صَلَّيْتُ بِالنَّاسِ قَالَ قُلْتُ وَاللَّهِ مَا أَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَكِنْ حِينَ لَمْ أَرَ أَبَا بَكْرٍ رَأَيْتُكَ أَحَقَّ مَنْ حَضَرَ بِالصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Ya'qub] Telah menceritakan kepada kami [bapakku] dari [Abu Ishaq] ia berkata, [Ibnu Syihab Az Zuhri] berkata, telah menceritakan kepadaku [Abdul Malik bin Abu Bakr bin Abdurrahman bin Harits bin Hisyam] dari [bapaknya] dari [Abdullah bin Zam'ah bin Aswad bin Al Muthallib bin Asad] ia berkata; Ketika sakit Rasulullah shallallahu 'alaihi wasallam semakin parah -sementara saya saat itu berada di sisi beliau beserta beberapa orang dari kaum muslimin- Bilal mengumandangkan adzan sholat, maka beliau bersabda: \"Perintahkanlah seseorang untuk sholat (mengimami) orang-orang.\" Abdullah bin Zam'ah berkata; Saya pun keluar dan ternyata Umar ada di tengah-tengah para sahabat, sementara Abu Bakar tidak ada. Abdullah bin Zam'ah berkata, \"Berdirilah wahai Umar, sholatlah (menjadi imam) bersama kaum muslimin.\" Maka Umar pun berdiri, dan ketika ia bertakbir, Rasulullah shallallahu 'alaihi wasallam mendengar suaranya -sebab Umar adalah seorang laki-laki yang lantang suaranya-, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mana Abu Bakar, Allah dan kaum muslimin enggan akan hal itu. Allah dan kaum muslimin enggan akan hal itu.\" Akhirnya beliau mengutus seseorang kepada Abu Bakar. Maka ia pun datang setelah Umar usai menunaikan sholat itu, kemudian Abu Bakar pun sholat (mengimami) bersama kaum muslimin. Abdullah bin Zam'ah berkata; Umar berkata kepadaku, \"Celaka kamu, apa yang kamu lakukan terhadapku wahai Ibnu Zam'ah. Demi Allah, saya tidak berpikir ketika kamu memerintahkanku, kecuali Rasulullah shallallahu 'alaihi wasallam-lah yang memerintahkanmu (untuk menyuruhku menjadi Imam). Kalau bukan karena itu, aku tidak akan sholat (mengimami) kaum muslimin.\" Saya berkata, \"Demi Allah, Rasulullah shallallahu 'alaihi wasallam tidaklah memerintahkanku. Namun ketika saya tidak melihat Abu Bakar, saya memandang, Andalah yang lebih berhak untuk mengimami sholat.\""
            },
            {
                "number": 2230,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ حَدَّثَتْنَا أُمُّ بَكْرٍ بِنْتُ الْمِسْوَرِ بْنِ مَخْرَمَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنِ الْمِسْوَرِ أَنَّهُبَعَثَ إِلَيْهِ حَسَنُ بْنُ حَسَنٍ يَخْطُبُ ابْنَتَهُ فَقَالَ لَهُ قُلْ لَهُ فَلْيَلْقَنِي فِي الْعَتَمَةِ قَالَ فَلَقِيَهُ فَحَمِدَ الْمِسْوَرُ اللَّهَ وَأَثْنَى عَلَيْهِ وَقَالَ أَمَّا بَعْدُ وَاللَّهِ مَا مِنْ نَسَبٍ وَلَا سَبَبٍ وَلَا صِهْرٍ أَحَبُّ إِلَيَّ مِنْ سَبَبِكُمْ وَصِهْرِكُمْ وَلَكِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَاطِمَةُ مُضْغَةٌ مِنِّي يَقْبِضُنِي مَا قَبَضَهَا وَيَبْسُطُنِي مَا بَسَطَهَا وَإِنَّ الْأَنْسَابَ يَوْمَ الْقِيَامَةِ تَنْقَطِعُ غَيْرَ نَسَبِي وَسَبَبِي وَصِهْرِي وَعِنْدَكَ ابْنَتُهَا وَلَوْ زَوَّجْتُكَ لَقَبَضَهَا ذَلِكَ قَالَ فَانْطَلَقَ عَاذِرًا لَهُ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id] bekas budak Bani Hasyim, Telah menceritakan kepada kami [Abdullah bin Ja'far] Telah menceritakan kepada kami [Ummu Bakr binti Al Miswar bin Makhramah] dari [ubaidhullah bin Abu Rafi'] dari [Miswar] bahwasanya; Hasan bin Hasan mengutus seseorang padanya untuk meminang anak putrinya. Maka ia pun berkata, \"Katakanlah padanya, hendaklah ia menemui setelah sholat Isya`.\" Maka Hasan menemuinya. Setelah Miswar memuji Allah dan membaca pujian-pujian atasnya, ia berkata, \"Amma ba'du, demi Allah, tidak ada hubungan kekeluargaan, tidak pula nasab dan kerabat yang paling aku sukai daripada nasab dan hubungan kekerabatan kalian. Akan tetapi, Rasulullah Shallallahu 'Alaihi Wasallam pernah bersabda: 'Sesungguhnya Fathimah adalah bagian dariku, aku merasa tersakiti atas semua yang menyakitinya dan aku merasa senang dengan apa saja yang membuatnya senang. Sesungguhnya pada hari Kiamat, semua nasab (keturunan) akan terputus kecuali nasab, hubungan kekeluargaan dan hubungan kekerabatanku, sementara putrinya (Abu Jahal) berada dalam asuhanmu! Sekiranya aku menikahkanmu, niscaya aku telah menyakitinya.” Lalu Ali pergi berpamitan."
            },
            {
                "number": 2231,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ مَرْوَانَ وَالْمِسْوَرِ بْنِ مَخْرَمَةَ يَزِيدُ أَحَدُهُمَا عَلَى صَاحِبِهِخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْحُدَيْبِيَةِ فِي بِضْعَ عَشْرَةَ مِائَةً مِنْ أَصْحَابِهِ فَلَمَّا كَانَ بِذِي الْحُلَيْفَةِ قَلَّدَ الْهَدْيَ وَأَشْعَرَ وَأَحْرَمَ مِنْهَا وَبَعَثَ عَيْنًا لَهُ بَيْنَ يَدَيْهِ فَسَأَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Urwah] dari [Marwan] dan [Miswar bin Makhramah] -salah seorand dari keduanya menambahkan atas temannya- Pada tahun Hudaibiyah, Rasulullah shallallahu 'alaihi wasallam berangkat beserta seratus orang lebih sahabatnya. Ketika beliau sampai di Hudaibiyah, beliau menuntun Hadyu (hewan kurban) dan memberi tanda padanya serta beliau memulai niat ihram dari tempat itu. kemudian beliau mengutus mata-matanya. Maka Rasulullah shallallahu 'alaihi wasallam pun bertanya hingga..."
            },
            {
                "number": 2232,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْحَاقَ بْنِ يَسَارٍ عَنِ الزُّهْرِيِّ مُحَمَّدِ بْنِ مُسْلِمِ بْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ وَمَرْوَانَ بْنِ الْحَكَمِ قَالَاخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْحُدَيْبِيَةِ يُرِيدُ زِيَارَةَ الْبَيْتِ لَا يُرِيدُ قِتَالًا وَسَاقَ مَعَهُ الْهَدْيَ سَبْعِينَ بَدَنَةً وَكَانَ النَّاسُ سَبْعَ مِائَةِ رَجُلٍ فَكَانَتْ كُلُّ بَدَنَةٍ عَنْ عَشَرَةٍ قَالَ وَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا كَانَ بِعُسْفَانَ لَقِيَهُ بِشْرُ بْنُ سُفْيَانَ الْكَعْبِيُّ فَقَالَ يَا رَسُولَ اللَّهِ هَذِهِ قُرَيْشٌ قَدْ سَمِعَتْ بِمَسِيرِكَ فَخَرَجَتْ مَعَهَا الْعُوذُ الْمَطَافِيلُ قَدْ لَبِسُوا جُلُودَ النُّمُورِ يُعَاهِدُونَ اللَّهَ أَنْ لَا تَدْخُلَهَا عَلَيْهِمْ عَنْوَةً أَبَدًا وَهَذَا خَالِدُ بْنُ الْوَلِيدِ فِي خَيْلِهِمْ قَدِمُوا إِلَى كُرَاعِ الْغَمِيمِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا وَيْحَ قُرَيْشٍ لَقَدْ أَكَلَتْهُمْ الْحَرْبُ مَاذَا عَلَيْهِمْ لَوْ خَلَّوْا بَيْنِي وَبَيْنَ سَائِرِ النَّاسِ فَإِنْ أَصَابُونِي كَانَ الَّذِي أَرَادُوا وَإِنْ أَظْهَرَنِي اللَّهُ عَلَيْهِمْ دَخَلُوا فِي الْإِسْلَامِ وَهُمْ وَافِرُونَ وَإِنْ لَمْ يَفْعَلُوا قَاتَلُوا وَبِهِمْ قُوَّةٌ فَمَاذَا تَظُنُّ قُرَيْشٌ وَاللَّهِ إِنِّي لَا أَزَالُ أُجَاهِدُهُمْ عَلَى الَّذِي بَعَثَنِي اللَّهُ لَهُ حَتَّى يُظْهِرَهُ اللَّهُ لَهُ أَوْ تَنْفَرِدَ هَذِهِ السَّالِفَةُ ثُمَّ أَمَرَ النَّاسَ فَسَلَكُوا ذَاتَ الْيَمِينِ بَيْنَ ظَهْرَيْ الْحَمْضِ عَلَى طَرِيقٍ تُخْرِجُهُ عَلَى ثَنِيَّةِ الْمِرَارِ وَالْحُدَيْبِيَةِ مِنْ أَسْفَلِ مَكَّةَ قَالَ فَسَلَكَ بِالْجَيْشِ تِلْكَ الطَّرِيقَ فَلَمَّا رَأَتْ خَيْلُ قُرَيْشٍ قَتَرَةَ الْجَيْشِ قَدْ خَالَفُوا عَنْ طَرِيقِهِمْ نَكَصُوا رَاجِعِينَ إِلَى قُرَيْشٍ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا سَلَكَ ثَنِيَّةَ الْمِرَارِ بَرَكَتْ نَاقَتُهُ فَقَالَ النَّاسُ خَلَأَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا خَلَأَتْ وَمَا هُوَ لَهَا بِخُلُقٍ وَلَكِنْ حَبَسَهَا حَابِسُ الْفِيلِ عَنْ مَكَّةَ وَاللَّهِ لَا تَدْعُونِي قُرَيْشٌ الْيَوْمَ إِلَى خُطَّةٍ يَسْأَلُونِي فِيهَا صِلَةَ الرَّحِمِ إِلَّا أَعْطَيْتُهُمْ إِيَّاهَا ثُمَّ قَالَ لِلنَّاسِ انْزِلُوا فَقَالُوا يَا رَسُولَ اللَّهِ مَا بِالْوَادِي مِنْ مَاءٍ يَنْزِلُ عَلَيْهِ النَّاسُ فَأَخْرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَهْمًا مِنْ كِنَانَتِهِ فَأَعْطَاهُ رَجُلًا مِنْ أَصْحَابِهِ فَنَزَلَ فِي قَلِيبٍ مِنْ تِلْكَ الْقُلُبِ فَغَرَزَهُ فِيهِ فَجَاشَ الْمَاءُ بِالرَّوَاءِ حَتَّى ضَرَبَ النَّاسُ عَنْهُ بِعَطَنٍ فَلَمَّا اطْمَأَنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بُدَيْلُ بْنُ وَرْقَاءَ فِي رِجَالٍ مِنْ خُزَاعَةَ فَقَالَ لَهُمْ كَقَوْلِهِ لِبُشَيْرِ بْنِ سُفْيَانَ فَرَجَعُوا إِلَى قُرَيْشٍ فَقَالُوا يَا مَعْشَرَ قُرَيْشٍ إِنَّكُمْ تَعْجَلُونَ عَلَى مُحَمَّدٍ وَإِنَّ مُحَمَّدًا لَمْ يَأْتِ لِقِتَالٍ إِنَّمَا جَاءَ زَائِرًا لِهَذَا الْبَيْتِ مُعَظِّمًا لَحَقِّهِ فَاتَّهَمُوهُمْ قَالَ مُحَمَّدٌ يَعْنِي ابْنَ إِسْحَاقَ قَالَ الزُّهْرِيُّ وَكَانَتْ خُزَاعَةُ فِي غَيْبَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسْلِمُهَا وَمُشْرِكُهَا لَا يُخْفُونَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا كَانَ بِمَكَّةَ قَالُوا وَإِنْ كَانَ إِنَّمَا جَاءَ لِذَلِكَ فَلَا وَاللَّهِ لَا يَدْخُلُهَا أَبَدًا عَلَيْنَا عَنْوَةً وَلَا تَتَحَدَّثُ بِذَلِكَ الْعَرَبُ ثُمَّ بَعَثُوا إِلَيْهِ مِكْرَزَ بْنَ حَفْصِ بْنِ الْأَخْيَفِ أَحَدَ بَنِي عَامِرِ بْنِ لُؤَيٍّ فَلَمَّا رَآهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هَذَا رَجُلٌ غَادِرٌ فَلَمَّا انْتَهَى إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَلَّمَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوٍ مِمَّا كَلَّمَ بِهِ أَصْحَابَهُ ثُمَّ رَجَعَ إِلَى قُرَيْشٍ فَأَخْبَرَهُمْ بِمَا قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَبَعَثُوا إِلَيْهِ الْحِلْسَ بْنَ عَلْقَمَةَ الْكِنَانِيَّ وَهُوَ يَوْمَئِذٍ سَيِّدُ الْأَحَابِشِ فَلَمَّا رَآهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هَذَا مِنْ قَوْمٍ يَتَأَلَّهُونَ فَابْعَثُوا الْهَدْيَ فِي وَجْهِهِ فَبَعَثُوا الْهَدْيَ فَلَمَّا رَأَى الْهَدْيَ يَسِيلُ عَلَيْهِ مِنْ عَرْضِ الْوَادِي فِي قَلَائِدِهِ قَدْ أَكَلَ أَوْتَارَهُ مِنْ طُولِ الْحَبْسِ عَنْ مَحِلِّهِ رَجَعَ وَلَمْ يَصِلْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِعْظَامًا لِمَا رَأَى فَقَالَ يَا مَعْشَرَ قُرَيْشٍ قَدْ رَأَيْتُ مَا لَا يَحِلُّ صَدُّهُ الْهَدْيَ فِي قَلَائِدِهِ قَدْ أَكَلَ أَوْتَارَهُ مِنْ طُولِ الْحَبْسِ عَنْ مَحِلِّهِ فَقَالُوا اجْلِسْ إِنَّمَا أَنْتَ أَعْرَابِيٌّ لَا عِلْمَ لَكَ فَبَعَثُوا إِلَيْهِ عُرْوَةَ بْنَ مَسْعُودٍ الثَّقَفِيَّ فَقَالَ يَا مَعْشَرَ قُرَيْشٍ إِنِّي قَدْ رَأَيْتُ مَا يَلْقَى مِنْكُمْ مَنْ تَبْعَثُونَ إِلَى مُحَمَّدٍ إِذَا جَاءَكُمْ مِنْ التَّعْنِيفِ وَسُوءِ اللَّفْظِ وَقَدْ عَرَفْتُمْ أَنَّكُمْ وَالِدٌ وَأَنِّي وَلَدٌ وَقَدْ سَمِعْتُ بِالَّذِي نَابَكُمْ فَجَمَعْتُ مَنْ أَطَاعَنِي مِنْ قَوْمِي ثُمَّ جِئْتُ حَتَّى آسَيْتُكُمْ بِنَفْسِي قَالُوا صَدَقْتَ مَا أَنْتَ عِنْدَنَا بِمُتَّهَمٍ فَخَرَجَ حَتَّى أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَلَسَ بَيْنَ يَدَيْهِ فَقَالَ يَا مُحَمَّدُ جَمَعْتَ أَوْبَاشَ النَّاسِ ثُمَّ جِئْتَ بِهِمْ لِبَيْضَتِكَ لِتَفُضَّهَا إِنَّهَا قُرَيْشٌ قَدْ خَرَجَتْ مَعَهَا الْعُوذُ الْمَطَافِيلُ قَدْ لَبِسُوا جُلُودَ النُّمُورِ يُعَاهِدُونَ اللَّهَ أَنْ لَا تَدْخُلَهَا عَلَيْهِمْ عَنْوَةً أَبَدًا وَأَيْمُ اللَّهِ لَكَأَنِّي بِهَؤُلَاءِ قَدْ انْكَشَفُوا عَنْكَ غَدًا قَالَ وَأَبُو بَكْرٍ الصِّدِّيقُ رَضِيَ اللَّهُ تَعَالَى عَنْهُ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَاعِدٌ فَقَالَ امْصُصْ بَظْرَ اللَّاتِ أَنَحْنُ نَنْكَشِفُ عَنْهُ قَالَ مَنْ هَذَا يَا مُحَمَّدُ قَالَ هَذَا ابْنُ أَبِي قُحَافَةَ قَالَ وَاللَّهِ لَوْلَا يَدٌ كَانَتْ لَكَ عِنْدِي لَكَافَأْتُكَ بِهَا وَلَكِنَّ هَذِهِ بِهَا ثُمَّ تَنَاوَلَ لِحْيَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْمُغِيرَةُ بْنُ شُعْبَةَ وَاقِفٌ عَلَى رَأْسِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَدِيدِ قَالَ يَقْرَعُ يَدَهُ ثُمَّ قَالَ أَمْسِكْ يَدَكَ عِنْ لِحْيَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ وَاللَّهِ لَا تَصِلُ إِلَيْكَ قَالَ وَيْحَكَ مَا أَفَظَّكَ وَأَغْلَظَكَ قَالَ فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ هَذَا يَا مُحَمَّدُ قَالَ هَذَا ابْنُ أَخِيكَ الْمُغِيرَةُ بْنُ شُعْبَةَ قَالَ أَغُدَرُ هَلْ غَسَلْتَ سَوْأَتَكَ إِلَّا بِالْأَمْسِ قَالَ فَكَلَّمَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ مَا كَلَّمَ بِهِ أَصْحَابَهُ فَأَخْبَرَهُ أَنَّهُ لَمْ يَأْتِ يُرِيدُ حَرْبًا قَالَ فَقَامَ مِنْ عِنْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ رَأَى مَا يَصْنَعُ بِهِ أَصْحَابُهُ لَا يَتَوَضَّأُ وُضُوءًا إِلَّا ابْتَدَرُوهُ وَلَا يَبْسُقُ بُسَاقًا إِلَّا ابْتَدَرُوهُ وَلَا يَسْقُطُ مِنْ شَعَرِهِ شَيْءٌ إِلَّا أَخَذُوهُ فَرَجَعَ إِلَى قُرَيْشٍ فَقَالَ يَا مَعْشَرَ قُرَيْشٍ إِنِّي جِئْتُ كِسْرَى فِي مُلْكِهِ وَجِئْتُ قَيْصَرَ وَالنَّجَاشِيَّ فِي مُلْكِهِمَا وَاللَّهِ مَا رَأَيْتُ مَلِكًا قَطُّ مِثْلَ مُحَمَّدٍ فِي أَصْحَابِهِ وَلَقَدْ رَأَيْتُ قَوْمًا لَا يُسْلِمُونَهُ لِشَيْءٍ أَبَدًا فَرُوا رَأْيَكُمْ قَالَ وَقَدْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ ذَلِكَ بَعَثَ خِرَاشَ بْنَ أُمَيَّةَ الْخُزَاعِيَّ إِلَى مَكَّةَ وَحَمَلَهُ عَلَى جَمَلٍ لَهُ يُقَالُ لَهُ الثَّعْلَبُ فَلَمَّا دَخَلَ مَكَّةَ عَقَرَتْ بِهِ قُرَيْشٌ وَأَرَادُوا قَتْلَ خِرَاشٍ فَمَنَعَهُمْ الْأَحَابِشُ حَتَّى أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَعَا عُمَرَ لِيَبْعَثَهُ إِلَى مَكَّةَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَخَافُ قُرَيْشًا عَلَى نَفْسِي وَلَيْسَ بِهَا مِنْ بَنِي عَدِيٍّ أَحَدٌ يَمْنَعُنِي وَقَدْ عَرَفَتْ قُرَيْشٌ عَدَاوَتِي إِيَّاهَا وَغِلْظَتِي عَلَيْهَا وَلَكِنْ أَدُلُّكَ عَلَى رَجُلٍ هُوَ أَعَزُّ مِنِّي عُثْمَانَ بْنِ عَفَّانَ قَالَ فَدَعَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَعَثَهُ إِلَى قُرَيْشٍ يُخْبِرُهُمْ أَنَّهُ لَمْ يَأْتِ لِحَرْبٍ وَأَنَّهُ جَاءَ زَائِرًا لِهَذَا الْبَيْتِ مُعَظِّمًا لِحُرْمَتِهِ فَخَرَجَ عُثْمَانُ حَتَّى أَتَى مَكَّةَ وَلَقِيَهُ أَبَانُ بْنُ سَعِيدِ بْنِ الْعَاصِ فَنَزَلَ عَنْ دَابَّتِهِ وَحَمَلَهُ بَيْنَ يَدَيْهِ وَرَدِفَ خَلْفَهُ وَأَجَارَهُ حَتَّى بَلَّغَ رِسَالَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْطَلَقَ عُثْمَانُ حَتَّى أَتَى أَبَا سُفْيَانَ وَعُظَمَاءَ قُرَيْشٍ فَبَلَّغَهُمْ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَرْسَلَهُ بِهِ فَقَالُوا لِعُثْمَانَ إِنْ شِئْتَ أَنْ تَطُوفَ بِالْبَيْتِ فَطُفْ بِهِ فَقَالَ مَا كُنْتُ لِأَفْعَلَ حَتَّى يَطُوفَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَاحْتَبَسَتْهُ قُرَيْشٌ عِنْدَهَا فَبَلَغَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْمُسْلِمِينَ أَنَّ عُثْمَانَ قَدْ قُتِلَ قَالَ مُحَمَّدٌ فَحَدَّثَنِي الزُّهْرِيُّ أَنَّ قُرَيْشًا بَعَثُوا سُهَيْل",
                "id": "Telah menceritakan kepada kami [Yazid bin harun] Telah mengabarkan kepada kami [Muhammad bin Ishaq bin Yasar] dari [Az Zuhri Muhammad bin Muslim bin Syihab] dari ['Urwah bin Zubair] dari [Miswar bin Makhramah] dan [Marwan bin Hakam], kata keduanya, Pada tahun Hudaibiyah Rasulullah Shallallahu'alaihiwasallam berangkat dengan niyat mengunjungi baitullah, ka'bah, bukan niyat untuk berperang, sekaligus beliau giring unta sembelihannya (hadyu) sebanyak tujuh puluh ekor. Sahabat ketika itu berjumlah tujuh ratus orang. Setiap satu ekor unta untuk sepuluh orang. Kata Miswar atau Marwan, Rasulullah Shallallahu'alaihiwasallam terus melanjutkan perjalanan, hingga ketika beliau di 'Usfan, Bisyir bin Sufyan alka'bi memergoki beliau dan berujar \"Hai Rasulullah, ini quraisy telah mendengar berita keberangkatanmu dan mereka ikutsertakan wanita dan anak-anak, baik yang masih kecil atau dewasa. Telah mereka pakai kulit macan loreng - kulit macan loreng mereka pakai sebagai symbol kebanggaan dan keberingasan, dan kesiapan matinya betul-betul serius--, mereka telah berjanji kepada Allah agar engkau tidak memasuki baitullah secara paksa. Disana telah ada Khalid bin Walid yang tiba di Kura'il ghamim. Rasulullah Shallallahu'alaihiwasallam kontan bersabda \"Celaka quraisy, mereka telah tercabik-cabik oleh perang, apa beratnya sekiranya mereka tidak menghalang-halangi aku dan sahabatku, kalaulah mereka berhasil mengalahkanku, itu ambisi mereka, dan sekiranya Allah menjadikanku menang atas mereka, jumlah mereka banyak sekali. Kalaulah (keIslaman) itu tidak mereka kerjakan, musti mereka lakukan peperangan karena mereka juga mempunyai kekuatan. Quraisy, apa lagi keinginan mereka? Demi Allah, sungguh aku tidak akan berhenti memerangi mereka karena risalah Allah yang utuskan kepadaku hingga Allah memenangkannya atau tali kekang unta tinggal satu -maksudnya hingga binasa, sebab tali kekang hewan yang biasanya sepasang sangat jarang satunya putus selain karena pembunuhan atau peperangan--. Kemudian beliau perintahkan para sahabat hingga mereka menyusuri jalan jalur sebelah kanan antara dua rerimbunan pohon yang bisa menghantarkan mereka ke Tsaniyatul mirar dan Hudaibiyah di bawah Makkah. Kata Marwan atau Miswar, sahabat Nabi menyusuri jalan tersebut. Ketika pasukan berkuda quraisy melihat debu-debu para sahabat nabi menyelisihi jalur mereka, mereka kembali pulang menemui Quraisy. Rasulullah Shallallahu'alaihiwasallam terus berangkat hingga ketika beliau selesai menempuh Tsaniyyatul mirar, unta beliau menderum. Para sahabat berujar \"Wah, unta Nabi rupanya mogok.\" Rasulullah Shallallahu'alaihiwasallam menjawab \"Unta ini tidak mogok karena kemauannya sendiri, dan mogok bukanlah adat kebiasaannya, namun Dzat yang pernah menahan gajah (pasukan Abrahah) dari Makkah-lah yang menahannya. Demi Allah, tidaklah quraisy mengajakku hari ini kepada ajakan yang isinya memintaku untuk menyambung silatu rahim, selain akan aku penuhi. Dan beliau katakan kepada para sahabatnya \"Silahkan kalian turun.\" Para sahabat berujar \"Ya rasulullah, lembah yang dijadikan kawan-kawan untuk singgah ini tak ada sumber mata air.\" Rasulullah kemudian mencabut anak panah dari tabungnya, beliau berikan kepada salah seorang sahabatnya, lantas beliau singgah di sebuah sumur tua dari beberapa sumur tua yang ada. Beliau lemparkan anak panahnya ke dalam sumur tersebut hingga air memancar deras. Para sahabat minum dengan puas, untanya juga minum dengan puas, sehingga mereka jadikan tempat bermukim. Ketika Rasulullah Shallallahu'alaihiwasallam tenang, tak tahunya Budail bin Warqa' bersama rombongan bani khuza'ah datang dan Rasulullah berujar kepada mereka sebagaimana ucapannya kepada Busyair bin Abi Sofyan. Akhirnya mereka kembali ke quraisy dan berujar \"Wahai segenap quraisy, kalian tergesa-gesa menimpakan bahaya kepada Muhammad, sungguh Muhammad datang bukan untuk berperang, hanyasanya ia datang dalam rangka mengunjungi baitullah untuk menghormati haknya.Quraisy pun menuduh dengan tuduhan buruk kepada Budail bin Warqa' dan rombongannya ini. Kata Muhammad, alias Ibn ishaq, kata Azzuhri, Tradisi bani Khuza'ah ketika itu, mereka senantiasa membongkar keburukan Rasulullah Shallallahu'alaihiwasallam, baik mereka yang muslim maupun yang musyrik, mereka tak pernah menyembunyikan sedikitpun berita yang ada pada diri Rasulullah Shallallahu'alaihiwasallam ketika di Makkah. Kata Quraisy, \"Sekalipun ia datang untuk itu, demi Allah, selama-lamanya mereka tak bisa memasukinya secara paksa, dan jangan sampai bangsa arab berbicara mengenai hal itu!\" Lantas quraisy mengutus Mikraz bin Hafs bin al-akhyaf salah seorang bani Amir bin Lu'ay. Ketika Rasulullah Shallallahu'alaihiwasallam melihatnya, Rasulullah Shallallahu'alaihiwasallam berkomentar \"Yang ini laki-laki pengkhianat! Ketika Mikraz sampai ke Rasulullah Shallallahu'alaihiwasallam, Rasulullah Shallallahu'alaihiwasallam menyampaikan kepadanya sebagaimana yang telah beliau konsultasikan kepada para sahabatnya. Lantas Mikraz kembali ke Quraisy dan mengabari mereka segala yang diucapkan Rasulullah Shallallahu'alaihiwasallam. Kata Miswar atau Marwan, Quraisy kemudian mengutus Alhilsa bin 'Alqamah Alkinani yang ketika itu adalah tokoh kabilah yang ikut bersekutu dengan quraisy. Ketika Rasulullah Shallallahu'alaihiwasallam melihatnya, Rasulullah Shallallahu'alaihiwasallam berkomentar: \"Laki-laki ini dari sebuah kaum yang suka menyembah tuhan, tolong persiapkanlah hewan kurban yang bisa dilihatnya.\" Para sahabat pun mengumpulkan beberapa hewan kurban. Ketika Hilsa bin 'Alqamah melihat hewan kurban susul-menyusul berjalan menghadapnya dari lembah bagian lebarnya dan lengkap dengan kalung-kalungnya, --tradisi arab mengalungi hewan yang akan dijadikan kurban- dan hewan tersebut memakan tali kalungnya karena sekian lama tertahan ditempatnya, Hilsa langsung pulang dan tidak menemui Rasulullah Shallallahu'alaihiwasallam sebagai penghormatan atas peristiwa yang dilihatnya sendiri. Dan ia katakan kepada quraisy \"Wahai segenap quraisy, telah kulihat kejadian yang terlarang dihalang-halangi, yaitu hewan-hewan kurban lengkap dengan kalung-kalungnya, mereka memangsa tali-tali kalungnya karena sekian lama tertahan di tempatnya. Quraisy menjawab \"Duduk engkau hai Hilsa, kau adalah manusia arab primitife yang tak kenal apa-apa.\" Quraisy kemudian mengutus 'Urwah bin mas'ud atstsaqafi. 'Urwah kemudian mengatakan \"Hai segenap quraisy, telah kulihat segala yang kalian temui dari sahabat-sahabat yang kalian utus kepada Muhammad, yang membawa kata-kata menyakitkan dan penghinaan. Kalian telah sama-sama mengerti bahwa kalian adalah orang tua dan aku adalah anak kecil, dan telah kudengar utusan yang mewakili kalian. Maka aku kumpulkan siapapun yang menaatiku dari kaumku, kemudian aku datang hingga aku tolong kalian dengan pribadiku sendiri. Qurays menjawab \"Engkau benar, engkau tak lagi tersanksikan lagi oleh kami-kami ini.\" Urwah spontan berangkat hingga menemui Rasulullah Shallallahu'alaihiwasallam. Ia pun duduk di hadapannya dan berujar \"Hai Muhammad, telah kau kumpulkan sekian banyak kabilah kemudian kau datangkan mereka kepada keluargamu untuk kau pecah belah. Ketahuilah bahwa quraisy telah berangkat membawa isteri-isteri dan anak-anak mereka, telah mereka pakai kulit-kulit harimau -ungkapan kesombongan bahwa mereka siap mati, menumpahkan darah, dan pantang mundur-mereka ikrarkan janji kepada Allah agar engkau tidak memasukinya secara paksa selama-lamanya. Demi Allah, sungguh seolah-olah aku bersama mereka akan kelihatan olehmu tinggal esok saja! Kata Marwan atau miswar, Abu Bakar ketika itu duduk di belakang Rasulullah Shallallahu'alaihiwasallam dan berujar \"Hisaplah kemaluan berhala Lattamu, apa mungkin kami kelihatan oleh berhalamu itu! (Perkataan ini Abu bakar ucapkan untuk menghina Urwah bin mas'ud). Urwah bertanya \"Siapa ini hai Muhammad!\"Itu Ibnu Abu Quhafah!\" jawab Rasulullah. Urwah berujar \"Kalaulah bukan karena budi baikmu kepadaku yang belum sempat saya balas, niscaya kubalas ucapan kotormu, namun cukuplah ucapan kotormu sekarang cukuplah sebagai pembalasan budi baikmu yang belum terbalaskan.\" Selanjutnya Urwah berusaha ingin menarik jenggot Rasulullah Shallallahu'alaihiwasallam yang ketika itu Mughirah bin Syu'bah berdiri diatas kepala Rasulullah Shallallahu'alaihiwasallam dengan berbaju besi yang menutup seluruh tubuhnya. Kata Marwan atau Miswar, Mughirah seketika itu juga memukul tangan 'Urwah bin mas'ud agar jangan sampai menarik jenggot Rasul. Mughirah katakan \" Heih, tahan tanganmu dari jenggot Rasulullah Shallallahu'alaihiwasallam, demi Allah, tanganmu tak bakalan bisa meraih jenggotnya! 'Urwah menjawab \"Huss, alangkah jahat dan kasarnya engkau! Rasulullah Shallallahu'alaihiwasallam pun tersenyum. Urwah bertanya \"Siapa ini ya Muhammad! Rasul menjawab \"Ini anak saudaramu,. Mughirah bin Syu'bah. Kata 'Urwah \" Pengkhianatan apa lagi ini, engkau tidak menghapus kesalahanmu masa lalu selain baru kemaren?! Kemudian Rasulullah sampaikan kepada 'Urwah bin mas'ud sebagaimana yang telah ia konsultasikan terlebih dahulu kepada para sahabatnya. Dan Rasul beritahukan bahwa beliau tidak berambisi berperang. Kata Marwan atau Miswar, kemudian Urwah tinggalkan Rasulullah Shallallahu'alaihiwasallam, dan ia lihat perlakuan para sahabatnya terhadap beliau. Tidaklah Rasulullah berwudhu, selain para sahabatnya berebutan memperoleh sisa air wudhunya, dan tidaklah Rasulullah meludah selain mereka juga berebutan untuk memperoleh sisa ludahnya. Tidaklah rambut rasululah terjatuh selain mereka mengambilnya. Urwah kontan kembali menemui quraisy dan berujar \"Wahai segenap quraisy, aku pernah menemui Kisra dalam kerajaannya, dan juga pernah kudatangi Kaisar dan Najasyi dalam dua kerajaannya. Demi Allah, sama sekali belum pernah kulihat raja seorang pun yang seperti Muhammad di kalangan sahabat-shaabatnya. Telah kulihat sebuah kaum yang mereka tidak menyerahkannya kepada apapun selama-lamanya. Maka sekarang keluarkanlah saran dan ide kalian. Kata Marwan atau Miswar, sebelum itu Rasulullah Shallallahu'alaihiwasallam telah mengirim Khirasy bin Umayyah alkhuza'i ke Makkah dan beliau berikan kendaraan untanya yang seringkali dijuluki Tsa'lab. Ketika Khirasy bin Umayyah masuk Makkah, Quraisy membantai untanya dan ingin membantai Khirasy, namun sekutu-sekutu Quraisy mencegahnya hingga Khirasy datangi Rasulullah Shallallahu'alaihiwasallam, lantas Rasulullah panggil 'Umar untuk beliau utus ke Makkah. 'Umar menampik seraya mengatakan \"Wahai Rasulullah, saya khawatir Quraisy akan mencelakai diriku, sementara disana tidak ada seorang pun dari bani Adi yang membelaku, dan semua quraisy tahu permusuhanku terhadapnya dan kekasaranku kepadanya, namun baiklah kutunjukkan kepadamu seseorang yang lebih kuat daripadaku, yaitu Usman bin Affan.\" Kemudian Rasulullah Shallallahu'alaihiwasallam panggil Usman bin Affan, dan beliau utus ke Quraisy dengan misi memberitahu mereka bahwa kedatangan Nabi bukan untuk menyalakan perang, hanyasanya tujuannya sekedar mengunjungi baitullah, mengagungkan kehormatannya. Usman terus berangkat hingga beliau datangi Makkah, dan Usman dicegat oleh Abban bin Sa'id bin 'Ash. Usman turun dari untanya. Abban bin Sa'id menaikkan Usman keatas untanya, dan ia dudukkan didepannya sedang ia sendiri membonceng di belakangnya dan melindunginya, hingga 'Usman bisa menyampaikan surat Rasulullah Shallallahu'alaihiwasallam. Usman terus berangkat hingga ia temui Abu Sofyan dan pejabat-pejabat elit quraisy. Ia sampaikan semua misi pengutusannya dari Rasulullah Shallallahu'alaihiwasallam. Mereka katakan kepada Usman \"Kalaulah engkau berkenan, silahkan engkau thawaf di baitullah. Usman hanya menjawab \"Saya tak akan melakukan thawaf sampai Rasulullah Shallallahu'alaihiwasallam melakukan tawaf.\" Quraisy kemudian menahan Usman di baitullah, namun Rasulullah dan para sahabatnya keburu mendapat issue (alias hanya ghosip) bahwa Usman telah dibunuh. Kata Muhammad, telah menceritakan kepadaku Azzuhri, Quraisy mengutus Suhail bin Amru dan salah seorang bani 'Amir bin Lu'ay seraya mereka pesankan \"Tolong kalian berdua datangilah Muhammad dan ajaklah untuk berdamai. Dan jangan sampai terjadi dalam perdamaiannya selain ia harus pulang untuk tahun ini, demi Allah, jangan sampai bangsa arab berujar bahwa Rasulullah bisa menemui kita secara paksa selama-lamanya! Suhail kemudian mendatangi Nabi, ketika Nabi Shallallahu'alaihiwasallam melihatnya, Nabi berkomentar \"Quraisy rupanya ingin berdamai ketika mengutus si laki-laki ini! Sesampai Suhail di hadapan Rasulullah Shallallahu'alaihiwasallam, Suhail dan kawannya berbicara, mengajak diskusi yang sedemikian lama dan berlangsung alot hingga terjadi perdamaian diantara keduanya. Setelah terjadi titik kesepakatan dan hanya tinggal penulisan, Umar bin Khattab berlari dan ia datangi Abu bakar seraya berujar \"Wahai Abu bakar, bukankah dia itu Rasulullah Shallallahu'alaihiwasallam? Bukankah kita muslimin? Bukankah mereka musyrikin? Abu bakar hanya menjawab \"Benar.\" Kata Umar \"Lantas karena alasan apa kita memberi kehinaan terhadap agama kita?!\" Abu bakar menjawab \"Wahai Umar, jagalah kayu tunggangannya sebagaimana apa adanya, karena saya bersaksi bahwa ia adalah Rasulullah Shallallahu'alaihiwasallam. Kata Umar \"Kalau masalah bersaksi, aku juga bersaksi!.\" Rasulullah Shallallahu'alaihiwasallam kemudian datang, lantas Umar menyatakan protesnya sevara vulgar \"Wahai Rasulullah, bukankah kita muslimin dan mereka musyrikin?\"Benar\" Jawab Rasulullah.\" Lanjut Umar \" lalu mengapa kita kita berikan kehinaan terhadap agama kita? Nabi hanya menjawab \"Ingat, saya adalah hamba Allah dan Rasul-Nya, sekali-kali aku tak bakalan menyelisihi perintah-Nya, dan sekali-kali Allah tak bakalan menelantarkan keadaanku.\" Kemudian hari Umar katakan, \"Aku tidak berhenti melakukan puasa dan bersedekah, sholat dan membebaskan budak untuk menebus kesembronoanku terhadap Rasulullah, tepatnya karena ketakutanku terhadap ucapanku yang kuucapkan ketika itu, hingga aku berharap semua itu membawa kebaikan. Kata Miswar atau Marwan, Rasulullah Shallallahu'alaihiwasallam lalu memanggil Ali bin Abi Thalib dan Rasulullah Shallallahu'alaihiwasallam katakana \"Coba kamu tulis Bismillaahirrohmaanirrohiim.\" Suhail memprotes seraya ia katakan \"Saya tidak tahu kalimat ini, namun ucapkanlah Alloohumma.\" Rasulullah pun mengucapkan \"Yah, tulis saja Bismikalloohumma, inilah perjanjian damai yang ditetapkan Rasulullah untuk Suhail bin Amru.\" Suhail protes lagi seraya mengatakan \"Kalaulah aku bersaksi bahwa engkau adalah Rasulullah, niscaya aku tidak akan memerangimu, namun tulis saja Ini perjanjian yang ditetapkan Muhammad bin Abdullah dan Suhail bin Amru untuk menghentikan perang selama sepuluh tahun. Selama sepuluh tahun itu manusia aman dan satu sama lain saling menahan diri. Siapa saja yang menemui Rasulullah Shallallahu'alaihiwasallam dari sahabat Suhail dengan tanpa seijin walinya, maka Rasulullah wajib mengembalikan kepada mereka. Sebaliknya siapa saja yang menemui Quraisy dari sahabat Rasulullah Shallallahu'alaihiwasallam, maka Quraisy tak berkewajiban mengembalikan kepada mereka. Sesama kita (Quraisy dan muslimin) harus melupakan balas dendam yang terjadi masa lalu yang bisa menyulutkan perang, juga tidak ada pencurian, tak ada pengkhianatan. Dalam syarat mereka ketika penulisan dilangsungkan juga disetujui, siapa yang ingin memihak akad Muhammad dan janjinya, maka ia bersama Muhammad, dan barangsiapa memihak akad quraisy dan janji mereka, ia bersama quraisy. Serta merta Bani khuza'ah datang dan berujar \"Kami memihak akad Rasulullah Shallallahu'alaihiwasallam dan janjinya.\" Sedang banu Bakar bergegas datang dan berujar \"Adapun kami akan memihak akad quraisy dan janji mereka.\" Dan engkau (Muhammad) tidak berhak memasuki baitullah tahun ini, maka janganlah menemui kami (Quraisy Makkah), adapun tahun depan kami (Quraisy) mengosongkan Mekkah untuk anda (Muhammad) sehingga engkau bisa memasuki Makkah bersama sahabatmu dan tinggal disana selama tiga hari saja, engkau (Muhammad) boleh membawa senjata sebatas senjata pengendara, maksudnya selain pedang itupun harus disarungkan. Ketika Rasulullah Shallallahu'alaihiwasallam melangsungkan penulisan, tiba-tiba Abu jandal bin Suhail bin Amru datang dengan terantai besi, ia melarikan diri kepada Rasulullah Shallallahu'alaihiwasallam. Kata Marwan atau Miswar, sahabat-sahabat Rasulullah Shallallahu'alaihiwasallam sebelumnya keluar dengan "
            },
            {
                "number": 2233,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنِ الزُّهْرِيِّ أَخْبَرَنِي عَلِيُّ بْنُ حُسَيْنٍ أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ أَخَبَرَهُأَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ خَطَبَ ابْنَةَ أَبِي جَهْلٍ وَعِنْدَهُ فَاطِمَةُ ابْنَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا سَمِعَتْ بِذَلِكَ فَاطِمَةُ أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ لَهُ إِنَّ قَوْمَكَ يَتَحَدَّثُونَ أَنَّكَ لَا تَغْضَبُ لِبَنَاتِكَ وَهَذَا عَلِيٌّ نَاكِحٌ ابْنَةَ أَبِي جَهْلٍ قَالَ الْمِسْوَرُ فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمِعْتُهُ حِينَ تَشَهَّدَ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنِّي أَنْكَحْتُ أَبَا الْعَاصِ بْنَ الرَّبِيعِ فَحَدَّثَنِي فَصَدَقَنِي وَإِنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ بَضْعَةٌ مِنِّي وَأَنَا أَكْرَهُ أَنْ تَفْتِنُوهَا وَإِنَّهَا وَاللَّهِ لَا تَجْتَمِعُ ابْنَةُ رَسُولِ اللَّهِ وَابْنَةُ عَدُوِّ اللَّهِ عِنْدَ رَجُلٍ وَاحِدٍ أَبَدًا قَالَ فَتَرَكَ عَلِيٌّ الْخِطْبَةَ",
                "id": "Telah menceritakan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepadaku [Ali bin Husain] bahwa [Miswar bin Makhramah] telah mengabarkan kepadanya bahwasanya; Ali bin Abu Thalib meminang putri Abu Jahal, sementara di sisinya (isterinya) ada Fathimah putri Nabi shallallahu 'alaihi wasallam. Ketika Fathimah mendengar hal itu, ia langsung mendatangi Nabi shallallahu 'alaihi wasallam dan berkata, \"Sesungguhnya kaum Anda tengah berbincang-bincang bahwa Anda tidak marah lantaran putri Anda. Sedangkan Ali hendak menikahi putri Abu Jahal.\" Miswar berkata; Maka Nabi shallallahu 'alaihi wasallam berdiri dan saya mendengarnya ketika beliau bersyahadat kemudian beliau bersabda: \"Amma ba'du, saya telah menikahkan Abul Ash bin Rabi', lalu ia bercerita kepadaku dan membenarkanku. Dan sesungguhnya Fathimah binti Muhammad adalah bagian dariku, dan saya benci jika kalian berbuat fitnah atasnya. Demi Allah, putri Rasulullah tidak akan berkumpul dengan putri mush Allah pada seorang laki-laki selama-lamanya.\" (Miswar) Berkata; Maka Ali pun meninggalkan pinangan itu."
            },
            {
                "number": 2234,
                "arab": "حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنِ الْوَلِيدِ بْنِ كَثِيرٍ حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ حَلْحَلَةَ الدُّؤَلِيُّ أَنَّ ابْنَ شِهَابٍ حَدَّثَهُ أَنَّ عَلِيَّ بْنَ الْحُسَيْنِ حَدَّثَهُأَنَّهُمْ حِينَ قَدِمُوا الْمَدِينَةَ مِنْ عِنْدِ يَزِيدَ بْنِ مُعَاوِيَةَ مَقْتَلَ حُسَيْنِ بْنِ عَلِيٍّ لَقِيَهُ الْمِسْوَرُ بْنُ مَخْرَمَةَ فَقَالَ هَلْ لَكَ إِلَيَّ مِنْ حَاجَةٍ تَأْمُرُنِي بِهَا قَالَ فَقُلْتُ لَهُ لَا قَالَ لَهُ هَلْ أَنْتَ مُعْطِيَّ سَيْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنِّي أَخَافُ أَنْ يَغْلِبَكَ الْقَوْمُ عَلَيْهِ وَأَيْمُ اللَّهِ لَئِنْ أَعْطَيْتَنِيهِ لَا يُخْلَصُ إِلَيْهِ أَبَدًا حَتَّى تَبْلُغَ نَفْسِي إِنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ خَطَبَ ابْنَةَ أَبِي جَهْلٍ عَلَى فَاطِمَةَ فَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَخْطُبُ النَّاسَ فِي ذَلِكَ عَلَى مِنْبَرِهِ هَذَا وَأَنَا يَوْمَئِذٍ مُحْتَلِمٌ فَقَالَ إِنَّ فَاطِمَةَ بَضْعَةٌ مِنِّي وَأَنَا أَتَخَوَّفُ أَنْ تُفْتَنَ فِي دِينِهَا قَالَ ثُمَّ ذَكَرَ صِهْرًا لَهُ مِنْ بَنِي عَبْدِ شَمْسٍ فَأَثْنَى عَلَيْهِ فِي مُصَاهَرَتِهِ إِيَّاهُ فَأَحْسَنَ قَالَ حَدَّثَنِي فَصَدَقَنِي وَوَعَدَنِي فَوَفَى لِي وَإِنِّي لَسْتُ أُحَرِّمُ حَلَالًا وَلَا أُحِلُّ حَرَامًا وَلَكِنْ وَاللَّهِ لَا تَجْتَمِعُ ابْنَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَابْنَةُ عَدُوِّ اللَّهِ مَكَانًا وَاحِدًا أَبَدًا",
                "id": "Telah menceritakan kepada kami [Ya'qub] yakni Ibnu Ibrahim, Telah menceritakan kepada kami [bapakku] dari [Al Walid bin Katsir] telah menceritakan kepadaku [Muhammad bin Amru bin Halhalah Ad Du`ali] bahwa [Ibnu Syihab] telah menceritakan kepadanya bahwa [Ali bin Husain] telah menceritakan kepadanya, bahwasanya; Ketika mereka mendatangi kota Madinah dari sisi Yazid bin Mu'awiyah Maqtal (tempat dibunuhnya) Husain bin Ali, [Miswar bin Makhramah] menemuinya dan bertanya, \"Apakah Anda ada perlu denganku, atau keperluan yang Anda perintahkan padaku?\" (Ali bin Husain) Berkata; Saya menjawab, \"Tidak.\" Miswar bertanya lagi, \"Apakah Anda yang memberi pedang Rasulullah shallallahu 'alaihi wasallam? Saya khawatir, kaum itu akan mengalahkanku dan menguasainya. Demi Allah, sekiranya kamu memberikannya padaku, maka tidak akan ada yang sampai padanya selama-lamanya hingga diriku beranjak dewasa. Sesungguhnya Ali bin Abu Thalib telah meminang putri Abu Jahal (untuk memadu) Fathimah. Maka saya mendengar Rasulullah shallallahu 'alaihi wasallam menyampaikan khutbah kepada manusian di atas mimbar terkait dengan persoalan itu. Saat itu, saya adalah seorang yang muhtalim (baru menginjak masa aqil baligh). Beliau bersabda: \"Fathimah adalah bagian dari diriku, dan saya mengkhawatirkan akan terjadi fitnah terkait dengan agamanya.\" Kemudian beliau menyebutkan menyebutkan kerabatnya dari Bani Abdu Syams dan memuji hubungan kekerabatan dengannya. Berliau bersabda: \"Ia telah menceritakan kepadaku, membenarkanku, berjanji padaku, dan ia telah memenuhi janjinya padaku. Sesungguhnya, saya tidaklah mengharamkan yang halal, dan pula mengharamkan yang halal, akan tetapi, demi Allah, tidak akan berkumpul putri Rasulullah shallallahu 'alaihi wasallam dan putri musuh Allah di tempat yang satu selama-lamanya.\""
            },
            {
                "number": 2235,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ عَنْ عَمِّهِ قَالَ وَزَعَمَ عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ مَرْوَانَ وَالْمِسْوَرَ بْنَ مَخْرَمَةَ أَخْبَرَاهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ حِينَ جَاءَهُ وَفْدُ هَوَازِنَ مُسْلِمِينَ فَسَأَلُوا أَنْ يَرُدَّ إِلَيْهِمْ أَمْوَالَهُمْ وَسَبْيَهُمْ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعِي مَنْ تَرَوْنَ وَأَحَبُّ الْحَدِيثِ إِلَيَّ أَصْدَقُهُ فَاخْتَارُوا إِحْدَى الطَّائِفَتَيْنِ إِمَّا السَّبْيُ وَإِمَّا الْمَالُ وَقَدْ كُنْتُ اسْتَأْنَيْتُ بِكُمْ وَكَانَ أَنْظَرَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِضْعَ عَشْرَةَ لَيْلَةً حِينَ قَفَلَ مِنْ الطَّائِفِ فَلَمَّا تَبَيَّنَ لَهُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرُ رَادٍّ إِلَيْهِمْ إِلَّا إِحْدَى الطَّائِفَتَيْنِ قَالُوا فَإِنَّا نَخْتَارُ سَبْيَنَا فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمُسْلِمِينَ فَأَثْنَى عَلَى اللَّهِ عَزَّ وَجَلَّ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنَّ إِخْوَانَكُمْ قَدْ جَاءُوا تَائِبِينَ وَإِنِّي قَدْ رَأَيْتُ أَنْ أَرُدَّ إِلَيْهِمْ سَبْيَهُمْ فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يُطَيِّبَ ذَلِكَ فَلْيَفْعَلْ وَمَنْ أَحَبَّ مِنْكُمْ أَنْ يَكُونَ عَلَى حَظِّهِ حَتَّى نُعْطِيَهُ إِيَّاهُ مِنْ أَوَّلِ مَا يُفِيءُ اللَّهُ عَزَّ وَجَلَّ عَلَيْنَا فَلْيَفْعَلْ فَقَالَ النَّاسُ قَدْ طَيَّبْنَا ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّا لَا نَدْرِي مَنْ أَذِنَ مِنْكُمْ فِي ذَلِكَ مِمَّنْ لَمْ يَأْذَنْ فَارْجِعُوا حَتَّى يَرْفَعَ إِلَيْنَا عُرَفَاؤُكُمْ أَمْرَكُمْ فَجَمَعَ النَّاسُ فَكَلَّمَهُمْ عُرَفَاؤُهُمْ ثُمَّ رَجَعُوا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرُوهُ أَنَّهُمْ قَدْ طَيَّبُوا وَأَذِنُوا هَذَا الَّذِي بَلَغَنِي عَنْ سَبْيِ هَوَازِنَ",
                "id": "Telah menceritakan kepada kami [Ya'qub] Telah menceritakan kepada kami [Ibnu Akhi bin Syihab] dari [pamannya] ia berkata, [Urwah bin Zubair] telah berdalih bahwa [Marwan] dan [Miswar bin Makhramah] telah mengabarkan kepadanya, bahwasanya; Rasulullah shallallahu 'alaihi wasallam berdiri ketika utusan Hawazin mendatanginya dalam keadaan telah memeluk Islam. Kemudian mereka meminta agar harta dan para tawanan (wanita dan anak-anak) mereka dibebaskan dan dikembalikan. Maka Rasulullah shallallahu 'alaihi wasallam bersabda kepada mereka: \"Kalau aku, terserah pendapat kalian. perkataan yang paling aku sukai adalah perkataan yang paling benar. Maka pilihlah salah satu dari dua hal, imma As Sabyu (tawanan para wanita dan anak-anak) ataukah harta. Dan saya tidak memaksa (kalian untuk memutuskannya) dengan segera.\" Rasulullah shallallahu 'alaihi wasallam memberi waktu kepada mereka selama sepuluh malam lebih saat beliau kembali dari Tha`if. Ketika telah jelas bagi mereka bahwa Rasulullah shallallahu 'alaihi wasallam tidak ridla kecuali salah satu dari dua hal itu, mereka pun berkata, \"Kami lebih memilih para tawanan wanita dan anak-anak kami (untuk dikembalikan).\" Rasulullah shallallahu 'alaihi wasallam berdiri di hadapan kaum muslimin, beliau memuji Allah 'azza wajalla dengan pujian yang memang layak untuk-Nya. Kemudian beliau bersabda: \"Amma ba'du. Sesungguhnya saudara kalian telah datang dengan bertaubat. Dan saya berpendapat untuk mengembalikan para tawanan wanita dan anak-anak kepada mereka. karena itu, siapa diantara kalian yang merelakan hal itu, maka hendaklah ia melakukannya. Dan siapa di antara kalian yang lebih memilih untuk mengambil bagiannya dari Fai` yang telah diberikan Allah, hendaknya ia juga melakukannya.\" Kemudian kaum muslimin pun berkata, \"Kami telah merelakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kami tidak tahu, siapa di antara kalian yang merelakannya dan siapa pula yang tidak merelakannya. Karena itu, pulanglah kalian hingga orang-orang 'arif kalian menyerahkan urusan itu kepada kami.\" Maka kaum muslimin pun berkumpul dan bermusyawarah dengan orang-orang arif mereka. setelah itu, mereka kembali kepada Rasulullah shallallahu 'alaihi wasallam dan mengabarkan kepada beliau bahwa mereka telah merelakan dan mengizinkannya. Inilah yang sampai padaku mengenai tawanan wanita dan anak-anak Hawazin."
            },
            {
                "number": 2236,
                "arab": "حَدَّثَنَا رَوْحٌ قَالَ ثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ أخْبَرَهُ قَالَ وَثَنَا إِسْحَاقُ يَعْنِي ابْنَ الطَّبَّاعِ قَالَ أَخْبَرَنِي مَالِكٌ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَأَنَّ سُبَيْعَةَ الْأَسْلَمِيَّةَ نُفِسَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِلَيَالٍ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ حَلَلْتِ فَانْكِحِي",
                "id": "Telah menceritakan kepada kami [Rauh] ia berkata, Telah menceritakan kepada kami [Malik bin Anas] dari [Hisyam bin Urwah] dari [bapaknya] bahwa [Miswar bin Makhramah] -dalam riwayat lain- (Imam Ahmad) Berkata, dan Telah menceritakan kepada kami [Ishaq] yakni Ibnu Thabba', ia berkata, telah mengabarkan kepadaku [Malik] dari [Hisyam] dari [bapaknya] dari [Miswar bin Makhramah] bahwasanya Subai'ah Al Aslamiyyah melahirkan setelah beberapa malam dari kematian suaminya, maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Kamu telah halal, silahkan menikah.\""
            },
            {
                "number": 2237,
                "arab": "حَدَّثَنَا حَمَّادُ بْنُ أُسَامَةَ أَخْبَرَنَا هِشَامٌ عَنْ أَبِيهِ عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَأَنَّ سُبَيْعَةَ الْأَسْلَمِيَّةَ تُوُفِّيَ عَنْهَا زَوْجُهَا وَهِيَ حَامِلٌ فَلَمْ تَمْكُثْ إِلَّا لَيَالِيَ حَتَّى وَضَعَتْ فَلَمَّا تَعَلَّتْ مِنْ نِفَاسِهَا خُطِبَتْ فَاسْتَأْذَنَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي النِّكَاحِ فَأَذِنَ لَهَا أَنْ تَنْكِحَ فَنَكَحَتْحَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَاصِمِ بْنِ عُمَرَ عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ قَالَ وَضَعَتْ سُبَيْعَةُ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Hammad bin Usamah] telah mengabarkan kepada kami [Hisyam] dari [bapaknya] dari [Miswar bin Makhramah] bahwa Subai'ah Al Aslamiyyah ditinggal mati oleh suaminya sedangkan ia dalam keadaan hamil. Selang beberapa malam kemudian, ia melahirkan. Dan setelah suci dari nifasnya, ia dipinang. Maka ia pun meminta izin kepada Nabi shallallahu 'alaihi wasallam untuk menikah dan beliau mengizinkannya. Akhirnya, ia pun menikah. Telah menceritakan kepada kami [Abu Mu'awiyah] Telah menceritakan kepada kami [Hisyam] dari [bapaknya] dari [Ashim bin Umar] dari [Miswar bin Makhramah] ia berkata; Subai'ah melahirkan. Maka ia pun menyebutkan hadits."
            },
            {
                "number": 2238,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عَوْفِ بْنِ الْحَارِثِ وَهُوَ ابْنُ أَخِي عَائِشَةَ لِأُمِّهَا أَنَّ عَائِشَةَ حَدَّثَتْهُأَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ قَالَ فِي بَيْعٍ أَوْ عَطَاءٍ أَعْطَتْهُ وَاللَّهِ لَتَنْتَهِيَنَّ عَائِشَةُ أَوَ لَأَحْجُرَنَّ عَلَيْهَا فَقَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا أَوَقَالَ هَذَا قَالُوا نَعَمْ قَالَتْ هُوَ لِلَّهِ عَلَيَّ نَذْرٌ أَنْ لَا أُكَلِّمَ ابْنَ الزُّبَيْرِ كَلِمَةً أَبَدًا فَاسْتَشْفَعَ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ الْمِسْوَرَ بْنَ مَخْرَمَةَ وَعَبْدَ الرَّحْمَنِ بْنَ الْأَسْوَدِ بْنِ عَبْدِ يَغُوثَ وَهُمَا مِنْ بَنِي زُهْرَةَ فَذَكَرَ الْحَدِيثَ وَطَفِقَ الْمِسْوَرُ وَعَبْدُ الرَّحْمَنِ يُنَاشِدَانِ عَائِشَةَ إِلَّا كَلَّمَتْهُ وَقَبِلَتْ مِنْهُ وَيَقُولَانِ لَهَا إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ نَهَى عَمَّا قَدْ عَلِمْتِ مِنْ الْهَجْرِ إِنَّهُ لَا يَحِلُّ لِمُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلَاثِ لَيَالٍحَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا الزُّهْرِيُّ عَنِ الطُّفَيْلِ بْنِ الْحَارِثِ وَكَانَ رَجُلًا مِنْ أَزْدِ شَنُوءَةَ وَكَانَ أَخًا لِعَائِشَةَ لِأُمِّهَا أُمِّ رُومَانَ فَذَكَرَ الْحَدِيثَ فَاسْتَعَانَ عَلَيْهَا بِالْمِسْوَرِ بْنِ مَخْرَمَةَ وَعَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ بْنِ عَبْدِ يَغُوثَ فَاسْتَأْذَنَا عَلَيْهَا فَأَذِنَتْ لَهُمَا فَكَلَّمَاهَا وَنَاشَدَاهَا اللَّهَ وَالْقَرَابَةَ وَقَوْلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ لِامْرِئٍ مُسْلِمٍ أَنْ يَهْجُرَ أَخَاهُ فَوْقَ ثَلَاثٍ حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنِ الزُّهْرِيِّ حَدَّثَنِي عَوْفُ بْنُ الْحَارِثِ بْنِ الطُّفَيْلِ وَهُوَ ابْنُ أَخِي عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُمِّهَا أَنَّ عَائِشَةَ حَدَّثَتْهُ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] Telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Auf bin Harits] -ia adalah anak dari saudara Aisyah seibu- bahwa [Aisyah] telah menceritakan kepadanya, bahwa Abdullah bin Zubair berkata terkait dengan penjualan atau pemberian yang telah diberikannya oleh Aisyah, \"Aisyah benar-benar mau berhenti (melakukannya) ataukah saya benar-benar akan mendiamkannya.\" Aisyah bertanya, \"Apakah ia benar-benar mengatakan hal ini?\" mereka menjawab, \"Ya.\" Aisyah berkata, \"Hal itu, karena aku mempunyai tanggungan nadzar kepada Allah, yaitu aku tidak akan berbicara sepatah kata pun dengan Ibnu Zubair selama-lamanya.\" Maka Abdullah bin Zubair meminta bantuan Miswar bin Makhramah dan Abdurrahman bin Aswad bin Abdu Yaghuts, keduanya adalah dari Bani Zuhrah. Ia pun menyebutkan hadits. [Miswar] dan [Abdurrahman] mulai berbicara dengan Aisyah, ia pun menerimanya. Mereka berdua berkata kepadanya, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah melarang dari sesuatu yang telah Anda ketahui, yaitu Al Hajr. Sesungguhnya tidak halal bagi seorang muslim, untuk mendiamkan saudaranya lebih dari tiga malam.\" Telah menceritakan kepada kami [Al Walid bin Muslim] Telah menceritakan kepada kami [Al Auza'i] Telah menceritakan kepada kami [Az Zuhri] dari [Thufail bin Harits] -ia adalah seorang yang berasal dari Azd Syanu`ah, dan ia juga saudara seibu Aisyah yaitu Ummu Rumman. Maka ia pun menyebutkan hadits. Maka ia meminta bantuan kepada [Miswar bin Makhramah] dan [Abdurrahman bin Al Aswad bin Abd Yaghuts]. Kemudian keduanya meminta izin kepada Aisyah, dan Aisyah pun mengizinkan mereka berdua. Keduanya pun berbicara kepada Aisyah dan bersumpah dengan nama Allah, serta mengingatkan akan sabda Rasulullah shallallahu 'alaihi wasallam, \"Tidak halal bagi seorang muslim untuk mendiamkan saudaranya lebih dari tiga hari.\" Telah menceritakan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah menceritakan kepadaku ['Auf bin Harits bin Thufail] -ia adalah anak dari saudara Aisyah isteri Nabi shallallahu 'alaihi wasallam seibu- bahwa Aisyah telah menceritakan kepadanya. lalu ia menyebutkan hadits."
            },
            {
                "number": 2239,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ مَرْوَانَ وَالْمِسْوَرِ بْنِ مَخْرَمَةَ يَزِيدُ أَحَدُهُمَا عَلَى صَاحِبِهِخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْحُدَيْبِيَةِ فِي بِضْعَ عَشْرَةَ مِائَةً مِنْ أَصْحَابِهِ فَلَمَّا كَانَ بِذِي الْحُلَيْفَةِ قَلَّدَ الْهَدْيَ وَأَشْعَرَ وَأَحْرَمَ مِنْهَا وَقَالَ سُفْيَانُ مَرَّةً مِنْ عُمْرَةٍ وَلَمْ يُسَمِّ الْمِسْوَرَ وَبَعَثَ عَيْنًا لَهُ بَيْنَ يَدَيْهِ فَسَارَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Urwah bin Zubair] dari [Marwan] dan [Miswar bin Makhramah] -salah seorang dari keduanya menambah atas temannya- Pada tahun Hudaibiyah, Rasulullah shallallahu 'alaihi wasallam keluar bersama seratus sepuluh lebih dari sahabatnya. Ketika beliau sampai di Dzul Hulaifah, beliau mulai menuntun Hadyu (hewan kurban) dan memberinya tanda serta beliau memulai ihram dari tempat itu. Sekali waktu Sufyan mengatakan; (Beliau melakukan ihram dengan niat) Umrah -sementara Miswar tidak menyebutkannya- kemudian beliau mengutus mata-matanya. Dan Rasulullah shallallahu 'alaihi wasallam terus berjalan hingga.."
            },
            {
                "number": 2240,
                "arab": "حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ لَيْثٌ يَعْنِي ابْنَ سَعْدٍ حَدَّثَنِي بَكْرٌ يَعْنِي ابْنَ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ نَابِلٍ صَاحِبِ الْعَبَاءِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ صُهَيْبٍ صَاحِبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُقَالَ مَرَرْتُ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي فَسَلَّمْتُ فَرَدَّ إِلَيَّ إِشَارَةً وَقَالَ لَا أَعْلَمُ إِلَّا أَنَّهُ قَالَ إِشَارَةً بِإِصْبَعِهِ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Muhammad] ia berkata, [Laits] yakni Ibnu Sa'd berkata, telah menceritakan kepadaku [Bakr bin Abdullah bin Al Asyaj] dari [Nabl Shahibil Aba] dari [Abdullah bin Umar] dari [Shuhaib] salah seorang sahabat Rasulullah shallallahu 'alaihi wasallam, bahwa ia berkata; Suatu ketika saya melewati Rasulullah shallallahu 'alaihi wasallam yang saat itu sedang sholat, lalu saya mengucapkan salam, maka beliau membalasnya dengan isyarat. (Abdullah bin Umar) Berkata; Saya tidak tahu kecuali mengatakan; \"Isyarat dengan jari tangannya.\""
            },
            {
                "number": 2241,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ الْأَنْصَارِيِّ قَالَ حَدَّثَنِي رَجُلٌ مَنْ النَّمِرِ بْنِ قَاسِطٍ قَالَ سَمِعْتُ صُهَيْبَ بْنَ سِنَانٍ يُحَدِّثُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا رَجُلٍ أَصْدَقَ امْرَأَةً صَدَاقًا وَاللَّهُ يَعْلَمُ أَنَّهُ لَا يُرِيدُ أَدَاءَهُ إِلَيْهَا فَغَرَّهَا بِاللَّهِ وَاسْتَحَلَّ فَرْجَهَا بِالْبَاطِلِ لَقِيَ اللَّهَ يَوْمَ يَلْقَاهُ وَهُوَ زَانٍ وَأَيُّمَا رَجُلٍ ادَّانَ مِنْ رَجُلٍ دَيْنًا وَاللَّهُ يَعْلَمُ أَنَّهُ لَا يُرِيدُ أَدَاءَهُ إِلَيْهِ فَغَرَّهُ بِاللَّهِ وَاسْتَحَلَّ مَالَهُ بِالْبَاطِلِ لَقِيَ اللَّهَ عَزَّ وَجَلَّ يَوْمَ يَلْقَاهُ وَهُوَ سَارِقٌ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Abdul Hamid bin Ja'far] dari [Al Hasan bin Muhammad Al Anshari] ia berkata, telah menceritakan kepadaku [seorang laki-laki] dari Namr bin Qasith, ia berkata, saya mendengar [Shuhaib bin Sinan] menceritakan, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa saja laki-laki yang memberikan mahar kepada seorang wanita, sedangkan Allah mengetahui bahwa ia (bermaksud) tidak akan menyerahkannya sehingga ia meniupnya dengan nama Allah dan menghalalkan kemaluannya dengan batil, maka laki-laki itu akan menjumpai Allah kelak pada hari kiamat sebagai orang yang berzina. Dan siapa saja laki-laki yang berhutang dari seseorang, sedang Allah mengetahui bahwa ia tidak bermaksud untuk melunasinya, dan ia meniupnya dengan nama Allah dan menggalalkan hartanya dengan batil, maka ia akan menemui Allah sebagai seorang pencuri.\""
            },
            {
                "number": 2242,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ ثَابِتٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ صُهَيْبٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحَرِّكُ شَفَتَيْهِ أَيَّامَ حُنَيْنٍ بِشَيْءٍ لَمْ يَكُنْ يَفْعَلُهُ قَبْلَ ذَلِكَ قَالَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ نَبِيًّا كَانَ فِيمَنْ كَانَ قَبْلَكُمْ أَعْجَبَتْهُ أُمَّتُهُ فَقَالَ لَنْ يَرُومَ هَؤُلَاءِ شَيْءٌ فَأَوْحَى اللَّهُ إِلَيْهِ أَنْ خَيِّرْهُمْ بَيْنَ إِحْدَى ثَلَاثٍ إِمَّا أَنْ أُسَلِّطَ عَلَيْهِمْ عَدُوًّا مِنْ غَيْرِهِمْ فَيَسْتَبِيحَهُمْ أَوْ الْجُوعَ أَوْ الْمَوْتَ قَالَ فَقَالُوا أَمَّا الْقَتْلُ أَوْ الْجُوعُ فَلَا طَاقَةَ لَنَا بِهِ وَلَكِنْ الْمَوْتُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَاتَ فِي ثَلَاثٍ سَبْعُونَ أَلْفًا قَالَ فَقَالَ فَأَنَا أَقُولُ الْآنَ اللَّهُمَّ بِكَ أُحَاوِلُ وَبِكَ أَصُولُ وَبِكَ أُقَاتِلُ",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Hammad bin Salamah] dari [Tsabit] dari [Abdurrahman bin Abu Laila] dari [Shuhaib] ia berkata; Rasulullah shallallahu 'alaihi wasallam menggerakkan kedua bibirinya dengan sesuatu yang belum pernah beliau lakukan sebelumnya. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhya ada seorang Nabi sebelum masa kalian yang terkagum-kagum akan banyaknya umatnya, sehingga ia pun berkata, 'Mereka ini tidak akan lagi terkalah oleh sesuatu pun.' Akhirnya Allah mewahyuhkan padanya, 'Hendaknya kamu memilih salah satu dari tiga hal yaitu; mereka dikalahkan oleh musuh dari selain golongan mereka dan membinasakan mereka. Atau (mereka ditimpa) kelaparan, ataukah kematian yang akan menjemput mereka.' Maka umat sang Nabi itu pun berkata, 'Kalau musuh, maka tidak ada ketaatan kami terhadap mereka. Adapun kelaparan, maka kami tidak akan sabar atasnya. Akan tetapi (biarlah kami dijemput) oleh kematian.'\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maka dalam waktu tiga hari, telah meninggal dari mereka sebanyak tujuh puluh ribu orang.\" Beliau bersabda lagi: \"Maka sekarang aku akan berdo'a, 'ALLAHUMMA BIKA UHAAWIL WABIKA ASHUULU WABIKA UQAATIL (Ya Allah, kepada-Mulah kuserahkan segala daya dan upaya, dengan-Mulah kami menyerang, dan dengan (kekuatan-Mulah) kami berperang).'\""
            },
            {
                "number": 2243,
                "arab": "حَدَّثَنَا بَهْزٌ وَحَجَّاجٌ قَالَا ثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ صُهَيْبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَجِبْتُ مِنْ أَمْرِ الْمُؤْمِنِ إِنَّ أَمْرَ الْمُؤْمِنِ كُلَّهُ لَهُ خَيْرٌ وَلَيْسَ ذَلِكَ لِأَحَدٍ إِلَّا لِلْمُؤْمِنِ إِنْ أَصَابَتْهُ سَرَّاءُ شَكَرَ كَانَ ذَلِكَ لَهُ خَيْرًا وَإِنْ أَصَابَتْهُ ضَرَّاءُ فَصَبَرَ كَانَ ذَلِكَ لَهُ خَيْرًا",
                "id": "Telah menceritakan kepada kami [Bahz] dan [Hajjaj] keduanya berkata, Telah menceritakan kepada kami [Sulaiman bin Al Mughirah] dari [Tsabit] dari [Abdurrahman bin Abu Laila] dari [Shuhaib] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya terkagum akan perkara seorang mukmin. Sesungguhnya seluruh perkara orang mukmin itu adalah baik baginya, dan keadaan itu tidak ada pada seorang pun kecuali pada orang mukmin. Jika ia mendapatkan kemudahan, maka ia bersyukur, dan hal itu adalah kebaikan baginya. Dan jika ia tertimpa kesempitan, maka ia akan bersabar, dan hal itu juga merupakan kebaikan baginya.\""
            },
            {
                "number": 2244,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ صُهَيْبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ نُودُوا يَا أَهْلَ الْجَنَّةِ إِنَّ لَكُمْ مَوْعِدًا عِنْدَ اللَّهِ لَمْ تَرَوْهُ فَقَالُوا وَمَا هُوَ أَلَمْ تُبَيِّضْ وُجُوهَنَا وَتُزَحْزِحْنَا عَنْ النَّارِ وَتُدْخِلْنَا الْجَنَّةَ قَالَ فَيُكْشَفُ الْحِجَابُ فَيَنْظُرُونَ إِلَيْهِ فَوَاللَّهِ مَا أَعْطَاهُمْ اللَّهُ شَيْئًا أَحَبَّ إِلَيْهِمْ مِنْهُ ثُمَّ تَلَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ{ لِلَّذِينَ أَحْسَنُوا الْحُسْنَى وَزِيَادَةٌ }",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Hammad bin Salamah] dari [Tsabit Al Banani] dari [Abdurrahman bin Abu Laila] dari [Shuhaib] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika penghuni surga telah memasuki surga, maka mereka akan diseru, 'Wahai penduduk surga, sesungguhnya kalian masih memiliki janji di sisi Allah yang belum kalian lihat.' Mereka bertanya, 'Janji apakah itu? bukankah wajah kami telah diberi cahanya, kami dibebaskan dari api nereka dan dimasukkan ke dalam surga? ' kemudian hijab pun disingkap hingga mereka pun melihat (wajah-Nya). Maka Demi Allah, tidak sesuatu pun yang telah diberikan Allah kepada mereka yang lebih mereka cintai dari pada hal itu.\" kemudian Rasulullah shallallahu 'alaihi wasallam membaca ayat: \"Bagi orang-orang yang berbuat baik, ada pahala yang terbaik (surga) dan tambahannya.\""
            },
            {
                "number": 2245,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ صُهَيْبٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَخَلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ وَأَهْلُ النَّارِ النَّارَ نُودُوا يَا أَهْلَ الْجَنَّةِ إِنَّ لَكُمْ عِنْدَ اللَّهِ مَوْعِدًا فَقَالُوا أَلَمْ يُثَقِّلْ مَوَازِينَنَا وَيُعْطِينَا كُتُبَنَا بِأَيْمَانِنَا وَيُدْخِلْنَا الْجَنَّةَ وَيُنْجِينَا مِنْ النَّارِ فَيُكْشَفُ الْحِجَابُ قَالَ فَيَتَجَلَّى اللَّهُ عَزَّ وَجَلَّ لَهُمْ قَالَ فَمَا أَعْطَاهُمْ اللَّهُ شَيْئًا أَحَبَّ إِلَيْهِمْ مِنْ النَّظَرِ إِلَيْهِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] Telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Abdurrahman bin Abu Laila] dari [Shuhaib] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika penghuni surga telah memasuki surga, maka mereka akan diseru, 'Wahai penduduk surga, sesungguhnya kalian masih memiliki janji di sisi Allah yang belum kalian lihat.' Mereka bertanya, 'Janji apakah itu? bukankah timbangan kami telah diberatkan, dan kami telah diberikan kitab-kitab kami dengan tangan kanan kami? Dan kami juga dimasukkan ke dalam surga dan diselamatkan dari neraka? ' kemudian hijab pun disingkap hingga Allah menampakkan wajah-Nya bagi mereka. Maka tidak sesuatu pun yang telah diberikan Allah kepada mereka yang lebih mereka cintai dari pada melihat wajah-Nya.\""
            },
            {
                "number": 2246,
                "arab": "قَالَ حَدَّثَنَا عَفَّانُ مِنْ كِتَابِهِ قَالَ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ الْمُغِيرَةِ قَالَ ثَنَا ثَابِتٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ صُهَيْبٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى هَمَسَ شَيْئًا لَا نَفْهَمُهُ وَلَا يُحَدِّثُنَا بِهِ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَطِنْتُمْ لِي قَالَ قَائِلٌ نَعَمْ قَالَ فَإِنِّي قَدْ ذَكَرْتُ نَبِيًّا مِنْ الْأَنْبِيَاءِ أُعْطِيَ جُنُودًا مِنْ قَوْمِهِ فَقَالَ مَنْ يُكَافِئُ هَؤُلَاءِ أَوْ مَنْ يَقُومُ لِهَؤُلَاءِ أَوْ كَلِمَةً شَبِيهَةً بِهَذِهِ شَكَّ سُلَيْمَانُ قَالَ فَأَوْحَى اللَّهُ إِلَيْهِ اخْتَرْ لِقَوْمِكَ بَيْنَ إِحْدَى ثَلَاثٍ إِمَّا أَنْ أُسَلِّطَ عَلَيْهِمْ عَدُوًّا مِنْ غَيْرِهِمْ أَوْ الْجُوعَ أَوْ الْمَوْتَ قَالَ فَاسْتَشَارَ قَوْمَهُ فِي ذَلِكَ فَقَالُوا أَنْتَ نَبِيُّ اللَّهِ نَكِلُ ذَلِكَ إِلَيْكَ فَخِرْ لَنَا قَالَ فَقَامَ إِلَى صَلَاتِهِ قَالَ وَكَانُوا يَفْزَعُونَ إِذَا فَزِعُوا إِلَى الصَّلَاةِ قَالَ فَصَلَّى قَالَ أَمَّا عَدُوٌّ مِنْ غَيْرِهِمْ فَلَا أَوْ الْجُوعُ فَلَا وَلَكِنْ الْمَوْتُ قَالَ فَسُلِّطَ عَلَيْهِمْ الْمَوْتُ ثَلَاثَةَ أَيَّامٍ فَمَاتَ مِنْهُمْ سَبْعُونَ أَلْفًا فَهَمْسِي الَّذِي تَرَوْنَ أَنِّي أَقُولُ اللَّهُمَّ يَا رَبِّ بِكَ أُقَاتِلُ وَبِكَ أُصَاوِلُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِحَدَّثَنَا عَفَّانُ قَالَ ثَنَا حَمَّادُ بْنُ سَلَمَةَ بِهَذَا الْحَدِيثِ سَوَاءً بِهَذَا الْكَلَامِ كُلِّهِ وَبِهَذَا الْإِسْنَادِ وَلَمْ يَقُلْ فِيهِ كَانُوا إِذَا فَزِعُوا فَزِعُوا إِلَى الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Affan] dari kitabnya, katanya, Telah menceritakan kepada kami [Sulaiman] yaitu Ibnul Mughirah, katanya, Telah menceritakan kepada kami [Tsabit] dari [Abdurrahman bin Abi Laila] dari [Shuhaib] katanya, Pernah Rasulullah Shallallahu'alaihiwasallam sholat, dan beliau ucapkan kata-kata samar yang kami tak mendengarnya, dan ucapan samar itu tidak beliau beritakan kepada kami. Katanya, Rasulullah Shallallahu'alaihiwasallam lantas bertanya \"Apakah kalian paham bacaanku? Ada seseorang menjawab 'Benar.\" Kata Nabi, aku ingat seorang nabi yang diberi beberapa tentara dari kaumnya lantas mengatakan, siapa yang bisa menyamai mereka itu? -atau dengan redaksi 'Siapa yang bisa setanding mereka? atau kata-kata yang mirip -Sulaeman ragu kepastian redaksinya-, lantas Allah memberi wahyu kepadanya \"Pilihlah untuk kaummu salah satu diantara tiga, aku kuasakan musuh atas mereka dari selainnya, kelaparan, atau kematian. Kata Nabi, lantas nabi tersebut meminta saran kaumnya dalam hal ini. Mereka menjawab \"Engkau nabiyullah, kami menurut saja kepadamu, maka pilihlah untuk kami! Maka nabi tersebut menuju sholatnya sementara kaumnya dalam keadan panik, tradisi mereka sat itu jika panik, mereka menghampiri sholatnya. Maka nabi itu pun sholat dan berdoa' Adapun musuh dari selain mereka, jangan, adapun kelaparan, juga jangan, namun kematian sajalah!\" Maka mereka kemudian dikuasi oleh kematian selama tiga hari yang menyebabkan tujuh puluh ribu orang meninggal. Maka bicara rahasiaku tadi yang kalian lihat adalah doaku \"Aloohumma rabbi, bika uqaatil, wabika ushoowilu, walaa haula walaa quwwata illa billah (Ya Allah, karena-Mu aku berperang, karena-Mu aku menerjang, tiada daya dan kekuatan selain dengan pertolongan Allah.\" Telah menceritakan kepada kami ['Affan], katanya, Telah menceritakan kepada kami [Hammad bin Salamah] dengan hadis ini dengan redaksi yang sama dan juga dengan isnad ini, hanya tak ada redaksi \"Jika mereka dalam kepanikan, mereka hampiri sholat.\""
            },
            {
                "number": 2247,
                "arab": "حَدَّثَنَا عَفَّانُ مِنْ كِتَابِهِ حَدَّثَنَا سُلَيْمَانُ حَدَّثَنَا ثَابِتٌ عَنِ ابْنِ أَبِي لَيْلَى عَنْ صُهَيْبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَجِبْتُ لِأَمْرِ الْمُؤْمِنِ إِنَّ أَمْرَ الْمُؤْمِنِ كُلَّهُ لَهُ خَيْرٌ لَيْسَ ذَلِكَ لِأَحَدٍ إِلَّا لِلْمُؤْمِنِ إِنْ أَصَابَتْهُ سَرَّاءُ شَكَرَ وَكَانَ خَيْرًا وَإِنْ أَصَابَتْهُ ضَرَّاءُ صَبَرَ وَكَانَ خَيْرًا",
                "id": "Telah menceritakan kepada kami ['Affan] dari kitabnya; Telah menceritakan kepada kami [Sulaiman] Telah menceritakan kepada kami [Tsabit] dari [Ibnu Abu Laila] dari [Shuhaib] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya terkagum akan perkara seorang mukmin. Sesungguhnya seluruh perkara orang mukmin itu adalah baik baginya, dan keadaan itu tidak ada pada seorang pun kecuali pada orang mukmin. Jika ia mendapatkan kemudahan, maka ia bersyukur, dan hal itu adalah kebaikan baginya. Dan jika ia tertimpa kesempitan, maka ia akan bersabar, dan hal itu juga merupakan kebaikan baginya.\""
            },
            {
                "number": 2248,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ حَدَّثَنَا ثَابِتٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ صُهَيْبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ أَيَّامَ حُنَيْنٍ يُحَرِّكُ شَفَتَيْهِ بَعْدَ صَلَاةِ الْفَجْرِ بِشَيْءٍ لَمْ نَكُنْ نَرَاهُ يَفْعَلُهُ فَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّا نَرَاكَ تَفْعَلُ شَيْئًا لَمْ تَكُنْ تَفْعَلُهُ فَمَا هَذَا الَّذِي تُحَرِّكُ شَفَتَيْكَ قَالَ إِنَّ نَبِيًّا فِيمَنْ كَانَ قَبْلَكُمْ أَعْجَبَتْهُ كَثْرَةُ أُمَّتِهِ فَقَالَ لَنْ يَرُومَ هَؤُلَاءِ شَيْءٌ فَأَوْحَى اللَّهُ إِلَيْهِ أَنْ خَيِّرْ أُمَّتَكَ بَيْنَ إِحْدَى ثَلَاثٍ إِمَّا أَنْ نُسَلِّطَ عَلَيْهِمْ عَدُوًّا مِنْ غَيْرِهِمْ فَيَسْتَبِيحَهُمْ أَوْ الْجُوعَ وَإِمَّا أَنْ أُرْسِلَ عَلَيْهِمْ الْمَوْتَ فَشَاوَرَهُمْ فَقَالُوا أَمَّا الْعَدُوُّ فَلَا طَاقَةَ لَنَا بِهِمْ وَأَمَّا الْجُوعُ فَلَا صَبْرَ لَنَا عَلَيْهِ وَلَكِنْ الْمَوْتُ فَأَرْسَلَ عَلَيْهِمْ الْمَوْتَ فَمَاتَ مِنْهُمْ فِي ثَلَاثَةِ أَيَّامٍ سَبْعُونَ أَلْفًا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَنَا أَقُولُ الْآنَ حَيْثُ رَأَى كَثْرَتَهُمْ اللَّهُمَّ بِكَ أُحَاوِلُ وَبِكَ أُصَاوِلُ وَبِكَ أُقَاتِلُ",
                "id": "Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Hamamd] yakni Ibnu Salamah, Telah menceritakan kepada kami [Tsabit] dari [Abdurrahman bin Abu Laila] dari [Shuhaib] bahwa Rasulullah shallallahu 'alaihi wasallam pada hari Hunain menggerakkan kedua bibirnya setelah menunaikan sholat Fajar, suatu pemandangan yang belum pernah kami lihat sebelumnya. Maka kami berkata, \"Wahai Rasulullah, kami melihat Anda melakukan sesuatu yang belum pernah Anda lakukan sebelumnya. Apa maksud Anda menggerakkan kedua bibir Anda?\" beliau menjawab: \"Sesungguhnya para Nabi sebelum (masa) kalian terkagum-kagum akan banyaknya umatnya. Maka Nabi itu pun berkata, 'Mereka ini tidaklah diinginkan oleh sesuatu pun.' Akhirnya Allah mewahyuhkan padanya, 'Hendaknya kamu memilih salah satu dari tiga hal yaitu; mereka dikalahkan oleh musuh dari selain golongan mereka dan membinasakan mereka. Atau (mereka ditimpa) kelaparan, ataukah kematian yang akan menjemput mereka.' Maka sang Nabi itu pun bermusyawarah dengan mereka. mereka berkata, 'Adapan musuh, maka tidak ada ketaatan kami terhadap mereka. Sedangkan kelaparan, maka kami tidak akan sabar atasnya. Akan tetapi (biarlah kami dijemput) oleh kematian.' Setelah itu, Allah pun mengirimkan kematian atas mereka. Sehingga yang meninggal dari mereka dalam waktu tiga hari mencapai tujuh puluh ribu orang.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maka sekarang aku akan berdo'a -saat melihat banyaknya jumlah mereka-, 'ALLAHUMMA BIKA UHAAWIL WABIKA USHAAWIL WABIKA UQAATIL (Ya Allah, kepada-Mulah kuserahkan segala daya dan upaya, dengan-Mulah kami menyerang, dan dengan (kekuatan-Mulah) kami berperang).'\""
            },
            {
                "number": 2249,
                "arab": "حَدَّثَنَا عَفَّانُ أَخْبَرَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ صُهَيْبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَلَا هَذِهِ الْآيَةَ{ لِلَّذِينَ أَحْسَنُوا الْحُسْنَى وَزِيَادَةٌ }قَالَ إِذَا دَخَلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ وَأَهْلُ النَّارِ النَّارَ نَادَى مُنَادٍ يَا أَهْلَ الْجَنَّةِ إِنَّ لَكُمْ عِنْدَ اللَّهِ مَوْعِدًا يُرِيدُ أَنْ يُنْجِزَكُمُوهُ فَيَقُولُونَ وَمَا هُوَ أَلَمْ يُثَقِّلْ مَوَازِينَنَا وَيُبَيِّضْ وُجُوهَنَا وَيُدْخِلْنَا الْجَنَّةَ وَيُجِرْنَا مِنْ النَّارِ قَالَ فَيُكْشَفُ لَهُمْ الْحِجَابُ فَيَنْظُرُونَ إِلَيْهِ قَالَ فَوَاللَّهِ مَا أَعْطَاهُمْ شَيْئًا أَحَبَّ إِلَيْهِمْ مِنْ النَّظَرِ إِلَيْهِ وَلَا أَقَرَّ بِأَعْيُنِهِمْ",
                "id": "Telah menceritakan kepada kami ['Affan] telah mengabarkan kepada kami [Hammad] telah mengabarkan kepada kami [Tsabit] dari [Abdurrahman bin Abu Laila] dari [Shuhaib] bahwa Rasulullah shallallahu 'alaihi wasallam membaca ayat ini: \"Bagi orang-orang yang berbuat baik, ada pahala yang terbaik (surga) dan tambahannya.\" (Kemudian beliau melanjutkan sabdanya): \"Jika penghuni surga telah memasuki surga, dan penghuni neraka telah memasuki neraka, maka sang penyeru pun akan menyerukan, 'Wahai penduduk surga, sesungguhnya kalian masih memiliki janji di sisi Allah, dan Dia ingin memenuhinya untuk kalian.' Mereka bertanya, 'Janji apakah itu? bukankah timbangan kami telah diberatkan, memberi cahaya pada wajah-wajah kami? Bukankah kami telah dimasukkan ke dalam surga dan dibebaskan dari api nereka? ' kemudian hijab pun disingkap hingga mereka pun melihat (wajah-Nya). Maka Demi Allah, tidak sesuatu pun yang telah diberikan Allah kepada mereka yang lebih mereka cintai dari pada (kenikmatan) melihat wajah-Nya.\""
            },
            {
                "number": 2250,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ نَاجِيَةَ الْخُزَاعِيِّ قَالَوَكَانَ صَاحِبَ بُدْنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُلْتُ كَيْفَ أَصْنَعُ بِمَا عَطِبَ مِنْ الْبُدْنِ قَالَ انْحَرْهُ وَاغْمِسْ نَعْلَهُ فِي دَمِهِ وَاضْرِبْ صَفْحَتَهُ وَخَلِّ بَيْنَ النَّاسِ وَبَيْنَهُ فَلْيَأْكُلُوهُ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Hisyam bin Urwah] dari [bapaknya] dari [Najiyah Al Khuza'i] ia adalah pemilik Unta Rasulullah shallallahu 'alaihi wasallam, ia berkata; Saya bertanya, \"Apa yang mesti saya lakukan terhadap Unta yang sekarat?\" beliau menjawab: \"Sembelihlah ia, dan celupkan kakinya ke dalam darahnya (sebagai tanda). Kemudian biarkan, dan hendaklah orang-orang memakannya.\""
            },
            {
                "number": 2251,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ نَاجِيَةَ الْخُزَاعِيِّ وَكَانَ صَاحِبَ بُدْنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ أَصْنَعُ بِمَا عَطِبَ مِنْ الْإِبِلِ أَوْ الْبُدْنِ قَالَ انْحَرْهَا ثُمَّ أَلْقِ نَعْلَهَا فِي دَمِهَا ثُمَّ خَلِّ عَنْهَا وَعَنْ النَّاسِ فَلْيَأْكُلُوهَا",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] Telah menceritakan kepada kami [Hisyam bin Urwah] dari [bapaknya] dari [Najiyah Al Khuza'i] pemilik Unta Rasulullah shallallahu 'alaihi wasallam, ia berkata; Saya bertanya, \"Apa yang mesti saya lakukan terhadap Unta yang sekarat?\" beliau menjawab: \"Sembelihlah ia, dan celupkan kakinya ke dalam darahnya (sebagai tanda). Kemudian biarkan, dan hendaklah orang-orang memakannya.\""
            },
            {
                "number": 2252,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ أَبُو عَبْد الرَّحْمَنِ وَكَتَبَ بِهِ إِلَىَّ قُتَيْبَةُ بْنُ سَعِيدٍ كَتَبْتُ إِلَيْكَ بِخَطِّي وَخَتَمْتُ الْكِتَابَ بِخَاتَمِي وَنَقْشُهُ اللَّهُ وَلِيُّ سَعِيدٍ رَحِمَهُ اللَّهُ وَهُوَ خَاتَمُ أَبِي حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ بَكْرِ بْنِ سَوَادَةَ عَنْ مُسْلِمِ بْنِ مَخْشِيٍّ عَنِ ابْنِ الْفِرَاسِيِّ أَنَّ الْفِرَاسِيَّقَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا وَإِنْ كُنْتَ سَائِلًا لَا بُدَّ فَاسْأَلْ الصَّالِحِينَ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] -Abu Abdurrahman berkata- dan Qutaibah bin Sa'id telah menulis kepadaku; Saya menulis kepadamu dengan tulisan tanganku dan mengesahkannya dengan stempelku yang berukiran, \"Allah Waliyyu Sa'id Rahimahullah\" itu adalah stempel bapakku- Telah menceritakan kepada kami [Laits bin Sa'id] dari [Ja'far bin Rabi'ah] dari [Bakr bin Sawadah] dari [Muslim bin Makhsyi] dari [Ibnul Firasiy] bahwa Al Firasiy bertanya kepada Rasulullah shallallahu 'alaihi wasallam, \"Apakah aku boleh meminta-minta?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Tidak, dan jika memang kamu harus meminta, maka mintalah kepada orang-orang yang shalih.\""
            },
            {
                "number": 2253,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَكَتَبَ بِهِ إِلَيَّ قُتَيْبَةُ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ يَحْيَى بْنِ مَيْمُونٍ الْحَضْرَمِيِّ أَنَّ أَبَا مُوسَى الْغَافِقِيَّ سَمِعَ عُقْبَةَ بْنَ عَامِرٍ الْجُهَنِيَّ يُحَدِّثُ عَلَى الْمِنْبَرِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَادِيثَ فَقَالَ أَبُو مُوسَىإِنَّ صَاحِبَكُمْ هَذَا لَحَافِظٌ أَوْ هَالِكٌ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ آخِرُ مَا عَهِدَ إِلَيْنَا أَنْ قَالَ عَلَيْكُمْ بِكِتَابِ اللَّهِ وَسَتَرْجِعُونَ إِلَى قَوْمٍ يُحِبُّونَ الْحَدِيثَ عَنِّي فَمَنْ قَالَ عَلَيَّ مَا لَمْ أَقُلْ فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ وَمَنْ حِفْظَ عَنِّي شَيْئًا فَلْيُحَدِّثْهُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] -dan Qutaibah telah menuliskannya kepadaku- Telah menceritakan kepada kami [Laits bin Sa'id] dari [Amru bin Harits] dari [Yahya bin Maimun Al Hadlrami] bahwa Abu Musa Al Ghafiqi telah mendengar Uqbah bin Amir Al Juhani menceritakan beberapa hadits di atas mimbar dari Rasulullah shallallahu 'alaihi wasallam. Maka [Abu Musa] berkata, \"Sesungguhnya teman kalian ini adalah seorang yang Hafizh ataukah seorang yang binasa. Sesungguhnya pesan terakhir yang disampaikan Rasulullah shallallahu 'alaihi wasallam kepada kami adalah beliau bersabda: 'Hendaklah kalian senantiasa berpegang teguh dengan Kitabullah dan kalian benar-benar akan kembali (menemui) suatu kaum yang sangat menggemari periwayatan hadits dariku. Maka siapa yang berkata atas namaku sesuatu yang belum pernah aku katakan, hendaklah ia mempersiapkan tempat duduknya dari neraka. Dan barangsiapa yang menghafal suatu hadits dariku, hendaklah ia menceritakannya.'\""
            },
            {
                "number": 2254,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي الْعُشَرَاءِ عَنْ أَبِيهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَمَا تَكُونُ الذَّكَاةُ إِلَّا فِي الْحَلْقِ أَوْ اللَّبَّةِ قَالَ لَوْ طَعَنْتَ فِي فَخِذِهَا لَأَجْزَأَكَحَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي الْعُشَرَاءِ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ قَالَ وَسَمِعْتُهُ يَقُولُ وَأَبِيكَ حَدَّثَنَاه هُدْبَةُ بْنُ خَالِدٍ وَإِبْرَاهِيمُ بْنُ الْحَجَّاجِ قَالَا ثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ ثَنَا أَبُو الْعُشَرَاءِ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ حَدِيثِ وَكِيعٍ حَدَّثَنَا حَوْثَرَةُ بْنُ أَشْرَسَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ فَذَكَرَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Hammad bin Salamah] dari [Abul 'Usyara`] dari [bapaknya] ia berkata; Saya bertanya, \"Wahai Rasulullah, apakah penyembelihan tidak boleh dilakukan kecuali pada ujung leher atau pangkal leher?\" beliau menjawab: \"Jika kamu menikam pahanya, maka hal itu telah mencukupimu.\" Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Hammad bin Salamah] dari [Abul 'Usyara`] dari [bapaknya] dari Nabi shallallahu 'alaihi wasallam semisalnya. (Imam Ahmad) Berkata; Dan saya mendengarnya berkata -dan juga bapamu-, Telah menceritakannya kepada kami [Hudbah bin Khalid] dan [Ibrahim bin Hajjaj] keduanya berkata, Telah menceritakan kepada kami [Hammad bin Salamah] ia berkata, Telah menceritakan kepada kami [Abul 'Usyara`] dari [bapaknya] dari Nabi shallallahu 'alaihi wasallam, semisal dengan haditsnya Waki'. Telah menceritakan kepada kami [Hautsarah bin Asyras] Telah menceritakan kepada kami [Hammad bin Salamah], lalu ia pun menyebutkan maknanya."
            },
            {
                "number": 2255,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَكَتَبَ بِهِ إِلَيَّ قُتَيْبَةُ حَدَّثَنَا مُجَمِّعُ بْنُ يَعْقُوبَ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ مُجَمِّعٍ قَالَ قِيلَ لِعَبْدِ اللَّهِ بْنِ أَبِي حَبِيبَةَمَا أَدْرَكْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدِمَ وَهُوَ غُلَامٌ حَدِيثٌ قَالَ جَاءَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا إِلَى مَسْجِدِنَا يَعْنِي مَسْجِدَ قُبَاءَ قَالَ فَجِئْنَا فَجَلَسْنَا إِلَيْهِ وَجَلَسَ إِلَيْهِ النَّاسُ قَالَ فَجَلَسَ مَا شَاءَ اللَّهُ أَنْ يَجْلِسَ ثُمَّ قَامَ يُصَلِّي فَرَأَيْتُهُ يُصَلِّي فِي نَعْلَيْهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] -dan Qutaibah telah menuliskannya kepadaku- Telah menceritakan kepada kami [Mujammi' bin Ya'qub] dari [Muhammad bin Isma'il bin Mujammi'] ia berkata; Telah ditanyakan kepada [Abdullah bin Abu Habibah], \"Apa yang telah Anda dapatkan dari Rasulullah shallallahu 'alaihi wasallam?\" -Saat Rasulullah shallallahu 'alaihi wasallam datang, waktu itu ia masih anak kecil- Abdullah bin Abu Habibah menjawab, \"Pada suatu hari Rasulullah shallallahu 'alaihi wasallam mendatangi kami di Masjid kami, yakni Masjid Quba`. Maka kami pun segera datang dan duduk bersama beliau, hingga orang-orang pun iut berkumpul. Beliau duduk sekehendak Allah, setelah itu beliau berdiri dan sholat. Maka saat itu, saya melihat beliau sholat dengan mengenakan kedua terompahnya.\""
            },
            {
                "number": 2256,
                "arab": "حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا الْعَطَّافُ حَدَّثَنِي مُجَمِّعُ بْنُ يَعْقُوبَ عَنْ غُلَامٍ مِنْ أَهْلِ قُبَاءَ أَنَّهُ أَدْرَكَهُ شَيْخًا قَالَجَاءَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقُبَاءَ فَجَلَسَ فِي فِنَاءِ الْأُجُمِ وَاجْتَمَعَ إِلَيْهِ نَاسٌ فَاسْتَسْقَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسُقِيَ فَشَرِبَ وَأَنَا عَنْ يَمِينِهِ وَأَنَا أَحْدَثُ الْقَوْمِ فَنَاوَلَنِي فَشَرِبْتُ وَحَفِظْتُ أَنَّهُ صَلَّى بِنَا يَوْمَئِذٍ وَعَلَيْهِ نَعْلَانِ لَمْ يَنْزِعْهُمَا",
                "id": "Telah menceritakan kepada kami [Yunus bin Muhammad] Telah menceritakan kepada kami [Al 'Aththaf] telah menceritakan kepadaku [Mujammi' bin Ya'qub] dari [seorang anak] dari penduduk Quba`, bahwa ia mendapati seorang syaikh ia berkata; Rasulullah shallallahu 'alaihi wasallam mendatangi kami di Masjid Quba`, lalu beliau duduk di sekitar tiang, maka para sahabat pun berkumpul di sekelilingnya. Kemudian beliau meminta minum, maka beliau pun diberi minum dan langsung meminumnya. Saat itu, saya berada di sebelah kanan beliau dan paling dekat dengannya. Beliau kemudian menyerahkannya padaku dan aku pun meminumnya. Saya ingat bahwa pada hari itu, beliau sholat dengan mengenakan dua terompah dan tidak melepaskannya."
            },
            {
                "number": 2257,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ قَالَ عَبْد اللَّهِ وسَمِعْتُهُ أَنَا مِنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ عَنْ إِسْمَاعِيلَ بْنِ أَبِي حَبِيبَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ قَالَجَاءَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِنَا فِي مَسْجِدِ بَنِي عَبْدِ الْأَشْهَلِ فَرَأَيْتُهُ وَاضِعًا يَدَهُ فِي ثَوْبِهِ إِذَا سَجَدَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad bin Abu Syaibah] -Abdullah berkata; Dan saya mendengarnya dari Abdullah bin Muhammad bin Abu Syaibah- Telah menceritakan kepada kami [Abdul Aziz bin Muhammad Ad Darawardi] dari [Isma'il bin Abu Habibah] dari [Abdullah bin Abdurrahman] ia berkata; Rasulullah shallallahu 'alaihi wasallam mendatangi kami, lalu beliau sholat di kediaman kami yakni di Masjid Bani Abdul Asyhal, maka saya pun melihat beliau sholat dengan meletakkan tangannya di atas kainnya ketika beliau sujud."
            },
            {
                "number": 2258,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ بُكَيْرِ بْنِ عَطَاءٍ اللَّيْثِيِّ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَعْمَرَ الدِّيلِيَّ يَقُولُشَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ وَاقِفٌ بِعَرَفَةَ فَأَتَاهُ نَاسٌ مِنْ أَهْلِ نَجْدٍ فَقَالُوا يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ الْحَجُّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحَجُّ حَجُّ عَرَفَةَ مَنْ جَاءَ قَبْلَ صَلَاةِ الْفَجْرِ مِنْ لَيْلَةِ جَمْعٍ تَمَّ حَجُّهُ أَيَّامُ مِنًى ثَلَاثَةٌ{ فَمَنْ تَعَجَّلَ فِي يَوْمَيْنِ فَلَا إِثْمَ عَلَيْهِ وَمَنْ تَأَخَّرَ فَلَا إِثْمَ عَلَيْهِ }ثُمَّ أَرْدَفَ خَلْفَهُ فَجَعَلَ يُنَادِي بِهِنَّ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Sufyan] dari [Bukair bin Atha` Al Laitsi] ia berkata, saya mendengar [Abdurrahman bin Ya'mar Ad Daili] berkata; Saya menyaksikan Rasulullah shallallahu 'alaihi wasallam wukuf di Arafah. Kemudian orang-orang dari penduduk Najed pun mendatangi beliau dan bertanya, \"Wahai Rasulullah, bagaimanakah (mansik) haji itu?\" beliau menjawab: \"(Inti dari ibadah) haji itu, adalah ketika haji di Arafah. Barangsiapa yang datang sebelum sholat Fajar (Shubuh) pada malam Jam', maka hajinya telah sempurna. Hari-hari di Mina adalah tiga hari. Maka barangsiapa yang ingin cepat berangkat (dari Mina) sesudah dua hari, Maka tiada dosa baginya. dan barangsiapa yang ingin menangguhkan (keberangkatannya dari dua hari itu), Maka tidak ada dosa pula baginya.\" Maka ia pun membonceng di belakang beliau, dan menyerukan kalimat tadi."
            },
            {
                "number": 2259,
                "arab": "حَدَّثَنَا سُرَيْجٌ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ بِشْرِ بْنِ سُحَيْمٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ أَنْ يُنَادَى أَيَّامَ التَّشْرِيقِ أَنَّهُ لَا يَدْخُلُ الْجَنَّةَ إِلَّا مُؤْمِنٌ وَهِيَ أَيَّامُ أَكْلٍ وَشُرْبٍحَدَّثَنَا ابْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ حَبِيبٍ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ بِشْرِ بْنِ سُحَيْمٍ قَالَ خَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَيَّامِ التَّشْرِيقِ فَذَكَرَ نَحْوَهُ وَقَالَ إِنَّ هَذِهِ أَيَّامُ أَكْلٍ وَشُرْبٍ",
                "id": "Telah menceritakan kepada kami [Suraij] Telah menceritakan kepada kami [Hammad bin Zaid] dari [Amru bin Dinar] dari [Nafi' bin Jubair] dari [Bisyr bin Suhaim] bahwa Nabi shallallahu 'alaihi wasallam memerintahkan pada hari tasyriq untuk menyerukan bahwasanya, \"Tidak akan masuk surga kecuali orang mukmin.\" Hari itu adalah makan-makan dan minum. Telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Sufyan] dari [Habib] dari [Nafi' bin Jubair] dari [Bisyr bin Suhaim] ia berkata; Rasulullah shallallahu 'alaihi wasallam berkhutbah pada hari-hari tasyrik. Beliau pun menyebutkan semisalnya. Dan beliau berkata; \"Sesungguhnya hari-hari ini adalah hari makan-makan dan minum.\""
            },
            {
                "number": 2260,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ وَسَمِعْتُهُ أَنَا مِنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ قَالَ ثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ حَدَّثَنِي الْوَلِيدُ بْنُ الْمُغِيرَةِ الْمَعَافِرِيُّ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بِشْرٍ الْخَثْعَمِيُّ عَنْ أَبِيهِ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَتُفْتَحَنَّ الْقُسْطَنْطِينِيَّةُ فَلَنِعْمَ الْأَمِيرُ أَمِيرُهَا وَلَنِعْمَ الْجَيْشُ ذَلِكَ الْجَيْشُ قَالَ فَدَعَانِي مَسْلَمَةُ بْنُ عَبْدِ الْمَلِكِ فَسَأَلَنِي فَحَدَّثْتُهُ فَغَزَا الْقُسْطَنْطِينِيَّةَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad bin Abu Syaibah] -dan saya mendengarnya dari Abdullah bin bin Muhammad bin Abu Syaibah- ia berkata, Telah menceritakan kepada kami [Zaid bin Hubab] ia berkata, telah menceritakan kepadaku [Al Walid bin Al Mughirah Al Ma'afiri] ia berkata, telah menceritakan kepadaku [Abdullah bin Busyr Al Khats'ami] dari [bapaknya] bahwa ia mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Konstantinovel benar-benar akan ditaklukkan, maka senikmat-nikmat pemimpin adalah pemimpinnya dan senikmat-nikmat pasukan adalah pasukan itu.\" Lalu Maslamah bin Abdul Malik pun memanggilku dan bertanya kepadaku, maka aku menceritakan hadits itu, dan setelah itu, ia pun memerangi Konstantinovel."
            },
            {
                "number": 2261,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ قَالَ عَبْد اللَّهِ وَسَمِعْتُهُ أَنَا مِنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الطَّائِفِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ خَالِدٍ الْعَدْوَانِيِّ عَنْ أَبِيهِ أَنَّهُأَبْصَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَشْرِقِ ثَقِيفٍ وَهُوَ قَائِمٌ عَلَى قَوْسٍ أَوْ عَصًا حِينَ أَتَاهُمْ يَبْتَغِي عِنْدَهُمْ النَّصْرَ قَالَ فَسَمِعْتُهُ يَقْرَأُ وَالسَّمَاءِ وَالطَّارِقِ حَتَّى خَتَمَهَا قَالَ فَوَعَيْتُهَا فِي الْجَاهِلِيَّةِ وَأَنَا مُشْرِكٌ ثُمَّ قَرَأْتُهَا فِي الْإِسْلَامِ قَالَ فَدَعَتْنِي ثَقِيفٌ فَقَالُوا مَاذَا سَمِعْتَ مِنْ هَذَا الرَّجُلِ فَقَرَأْتُهَا عَلَيْهِمْ فَقَالَ مَنْ مَعَهُمْ مِنْ قُرَيْشٍ نَحْنُ أَعْلَمُ بِصَاحِبِنَا لَوْ كُنَّا نَعْلَمُ مَا يَقُولُ حَقًّا لَتَبِعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad] -Abdullah berkata; dan saya mendengarnya dari Abdullah bin Muhammad bin Abu Syaibah- Telah menceritakan kepada kami [Marwan bin Mu'awiyah Al Fazari] dari [Abdullah bin Abdurrahman Ath Tha`ifi] dari [Abdurrahman bin Khalid Al Adwani] dari [bapaknya] bahwa ia melihat Rasulullah shallallahu 'alaihi wasallam di sebelah Timur Tsaqif sedang bersandar di atas sebatang tongkat, yakni saat beliau mendatangi mereka untuk mengharap pertolongan. (Khalid Al Adwani) Berkata; Lalu saya mendengar beliau membaca: \"WAS SAMAA`I WATH THAARIQ (Demi langit dan yang datang pada malam hari).\" hingga beliau merampungkannya. Maka saya pun menghafalkannya pada masa jahiliyah dan waktu saya masih musyrik. Kemudian setelah memeluk Islam, saya membacanya lagi. Lalu orang-orang Tsaqif memanggilku dan bertanya, \"Apa yang telah kamu dengar dari laki-laki ini?\" maka saya pun membacakannya kepada mereka. kemudian seorang Quraisy yang bersama mereka berkata, \"Kami lebih tahu akan sahabat kami, sekiranya kami tahu apa yang dikatakannya itu benar, niscaya kami akan mengikutinya.\""
            },
            {
                "number": 2262,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَاقَ عَنْ نُمَيْرِ بْنِ عَرِيبٍ عَنْ عَامِرِ بْنِ مَسْعُودٍ الْجُمَحِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّوْمُ فِي الشِّتَاءِ الْغَنِيمَةُ الْبَارِدَةُ",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abu Ishaq] dari [Numair bin Arib] dari [Amir bin Mas'ud Al Jumahi] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Puasa pada musim semi, dan ghanimah itu pada musim dingin.\" "
            },
            {
                "number": 2263,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ سُلَيْمَانَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ نَافِعِ بْنِ كَيْسَانَ أَنَّ أَبَاهُ أخْبَرَهُأَنَّهُ كَانَ يَتَّجِرُ بِالْخَمْرِ فِي زَمَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَّهُ أَقْبَلَ مِنْ الشَّامِ وَمَعَهُ خَمْرٌ فِي الزِّقَاقِ يُرِيدُ بِهَا التِّجَارَةَ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي جِئْتُكَ بِشَرَابٍ جَيِّدٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا كَيْسَانُ إِنَّهَا قَدْ حُرِّمَتْ بَعْدَكَ قَالَ أَفَأَبِيعُهَا يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهَا قَدْ حُرِّمَتْ وَحُرِّمَ ثَمَنُهَا فَانْطَلَقَ كَيْسَانُ إِلَى الزِّقَاقِ فَأَخَذَ بِأَرْجُلِهَا ثُمَّ أَهْرَقَهَا",
                "id": "Telah menceritakan kepada kami [Qutaibah] Telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Sulaiman bin Abdurrahman] dari [Nafi' bin Kaisan] bahwa [bapaknya] telah mengabarkan kepadanya bahwasanya; Ia berjulan khamer pada masa Nabi shallallahu 'alaihi wasallam. Suatu ketika ia datang dari Syam dengan membawa Ziqaq (bejana-bejana yang berisi khamer) untuk menjualnya. Kemudian ia mendatangi Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah shallallahu 'alaihi wasallam, sesungguhnya aku datang kepada Anda dengan membawa minuman yang baik.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Kaisan, sesungguhnya minuman itu telah diharamkan setelahmu.\" Ia berkata, \"Apakah boleh saya menjualnya wahai Rasulullah?\" beliau bersabda: \"Sesungguhnya minuman itu telah diharamkan dan diharamkan pula labanya.\" Akhirnya Kaisan kembali ke Ziqaq miliknya, lalu menumpahkannya."
            },
            {
                "number": 2264,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ زُهْرَةَ بْنِ مَعْبَدٍ عَنْ جَدِّهِ قَالَكُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ آخِذٌ بِيَدِ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ تَعَالَى عَنْهُ فَقَالَ وَاللَّهِ يَا رَسُولَ اللَّهِ لَأَنْتَ أَحَبُّ إِلَيَّ مِنْ كُلِّ شَيْءٍ إِلَّا نَفْسِي فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي نَفْسِي بِيَدِهِ لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ نَفْسِهِ قَالَ فَأَنْتَ الْآنَ وَاللَّهِ أَحَبُّ إِلَيَّ مِنْ نَفْسِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْآنَ يَا عُمَرُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] Telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Zuhair bin Ma'bad] dari [kakeknya] ia berkata; Kami pernah bersama Nabi shallallahu 'alaihi wasallam, saat itu beliau memegang tangannya Umar bin Al Khaththab radliallahu 'anhu. Maka Umar pun berkata, \"Demi Allah, wahai Rasulullah, Anda benar-benar orang yang paling saya cintai dari segala sesuatu, kecuali dari diriku sendiri.\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, tidaklah salah seorang dari kalian beriman, hingga aku lebih ia cintai daripada dirinya sendiri.\" Kemudian Umar berkata, \"Sungguh, sekarang Anda adalah orang yang paling saya cintai daripada diriku sendiri.\" Akhirnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekaranglah wahai Umar (sempurna imanmu).\""
            },
            {
                "number": 2265,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ مَعْنِ بْنِ مُحَمَّدِ بْنِ مَعْنِ بْنِ نَضْلَةَ بْنِ عَمْرٍو الْغِفَارِيُّ مَدِينِيٌّ قَالَ حَدَّثَنِي جَدِّي مُحَمَّدُ بْنُ مَعْنٍ عَنْ أَبِيهِ مَعْنِ بْنِ نَضْلَةَ عَنْ نَضْلَةَ بْنِ عَمْرٍو الْغِفَارِيِّ أَنَّهُلَقِيَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَرَّبَيْنَ فَهَجَمَ عَلَيْهِ شَوَائِلُ لَهُ فَسَقَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ شَرِبَ فَضْلَةَ إِنَاءٍ فَامْتَلَأَ بِهِ ثُمَّ قَالَ يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ كُنْتُ لَأَشْرَبُ السَّبْعَةَ فَمَا أَمْتَلِئُ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْمُؤْمِنَ يَشْرَبُ فِي مِعًى وَاحِدٍ وَإِنَّ الْكَافِرَ يَشْرَبُ فِي سَبْعَةِ أَمْعَاءٍ",
                "id": "Telah menceritakan kepada kami [Ali bin Abdullah] ia berkata, telah menceritakan kepadaku [Muhammad bin Ma'n bin Muhammad bin Ma'n bin Nadllah bin Amr Al Ghifari Madini] ia berkata, telah menceritakan kepadaku [kakekku, Muhammad bin Ma'n] dari bapaknya [Ma'n bin Nadllah] dari [Nadllah bin Amru Al Ghifari] bahwa ia pernah menjumpai Rasulullah shallallahu 'alaihi wasallam di Marrabain. Kemudian ia segera memeras susu Unta miliknya dan memberi minum Rasulullah shallallahu 'alaihi wasallam, dan ia pun meminum susu yang tersisa dan ia pun kenyang. Kemudian Nadllah berkata, \"Wahai Rasulullah, dulu saya benar-benar minum tujuh kali, namun saya tidak kenyang.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya seorang mukmin itu minum dengan satu usus, sementara orang kafir minum dengan tujuh usus.\""
            },
            {
                "number": 2266,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا جَابِرُ بْنُ صُبْحٍ قَالَ حَدَّثَنِي الْمُثَنَّى بْنُ عَبْدِ الرَّحْمَنِ الْخُزَاعِيُّ وَصَحِبْتُهُ إِلَى وَاسِطٍوَكَانَ يُسَمِّي فِي أَوَّلِ طَعَامِهِ وَفِي آخِرِ لُقْمَةٍ يَقُولُ بِسْمِ اللَّهِ فِي أَوَّلِهِ وَآخِرِهِ فَقُلْتُ لَهُ إِنَّكَ تُسَمِّي فِي أَوَّلِ مَا تَأْكُلُ أَرَأَيْتَ قَوْلَكَ فِي آخِرِ مَا تَأْكُلُ بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ قَالَ أُخْبِرُكَ عَنْ ذَلِكَ إِنَّ جَدِّي أُمَيَّةَ بْنَ مَخْشِيٍّ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعْتُهُ يَقُولُ إِنَّ رَجُلًا كَانَ يَأْكُلُ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْظُرُ فَلَمْ يُسَمِّ حَتَّى كَانَ فِي آخِرِ طَعَامِهِ لُقْمَةٌ فَقَالَ بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا زَالَ الشَّيْطَانُ يَأْكُلُ مَعَهُ حَتَّى سَمَّى فَلَمْ يَبْقَ فِي بَطْنِهِ شَيْءٌ إِلَّا قَاءَهُ",
                "id": "Telah menceritakan kepada kami [Ali bin Abdullah] Telah menceritakan kepada kami [Yahya bin Sa'id] Telah menceritakan kepada kami [Jabir bin Shubh] ia berkata, telah menceritakan kepadaku [Al Mutsanna bin Abdurrahman Al Khuza'i] suatu ketika saya menemaninya ke Wasith. Saat makan ia memulainya dengan basmalah, di akhir suapan makanannya ia membaca lagi, \"BISMILLAH (Dengan nama Allah).\" Maka saya pun berkata, \"Ketika pertama kali Anda makan, Anda membaca Basmalah, lalu bagaimana dengan bacaan, 'BISMILLAH.' di akhir suapan yang Anda makan?\" Ia menjawab; Saya akan mengabarkan mengenai hal itu kepadamu. Kakekku [Umayyah bin Makhsyi] adalah salah seorang dari sahabat Nabi shallallahu 'alaihi wasallam, saya telah mendengarnya berkata; \"Seorang laki-laki sedang makan, sementara Nabi shallallahu 'alaihi wasallam melihatnya. Laki-laki itu belum membaca Basmalah hingga ia menyudahi makannya, dan pada suapan terakhir ia membaca, 'BISMILLAH AWWALAHU WA AAKHIRAHU (Dengan menyebut nama Allah di awal dan di akhir).' Maka Nabi shallallahu 'alaihi wasallam bersabda: 'Syetan masih terus makan bersamanya hingga ia membaca Basmalah. Maka tidak ada sedikit makanan pun yang tersisa di perutnya kecuali syetan mengeluarkannya.'\""
            },
            {
                "number": 2267,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ ثَنَا شُعْبَةُ عَنِ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عَبْدِ اللَّهِ بْنِ رَبِيعَةَ السُّلَمِيِّ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَسَمِعَ مُؤَذِّنًا يَقُولُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ قَالَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشْهَدُ أَنِّي مُحَمَّدٌ رَسُولُ اللَّهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَجِدُونَهُ رَاعِيَ غَنَمٍ أَوْ عَازِبًا عَنْ أَهْلِهِ فَلَمَّا هَبَطَ الْوَادِي قَالَ مَرَّ عَلَى سَخْلَةٍ مَنْبُوذَةٍ فَقَالَ أَتَرَوْنَ هَذِهِ هَيِّنَةً عَلَى أَهْلِهَا لَلدُّنْيَا أَهْوَنُ عَلَى اللَّهِ مِنْ هَذِهِ عَلَى أَهْلِهَا",
                "id": "Telah menceritakan kepada kami [Waki'] ia berkata, Telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Abdurrahman bin Abu Laila] dari [Abdullah bin Rabi'ah As Sulamai] ia berkata; Suatu ketika Rasulullah shallallahu 'alaihi wasallam berada suatu perjalanan, lalu beliau mendengar seorang mudzin membaca, \"ASYHADU ANLAA ILAAHA ILLALLAH (Aku bersaksi bahwa tidak ada Tuhan yang berhak disembah selain Allah).\" Maka Rasulullah shallallahu 'alaihi wasallam membaca: \"ASYHADU ANLAA ILAAHA ILLALLAH (Aku bersaksi bahwa tidak ada Tuhan yang berhak disembah selain Allah).\" Kemudian muadzin membaca, \"ASYHADU ANNA MUHAMMADAN RASUULULLAH.\" Nabi shallallahu 'alaihi wasallam membaca: \"ASYHADU ANNII MUHAMMAD RASUULULLAH (Aku bersaksi bahwa aku adalah Muhammad utusan Allah).\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalian akan mendapatinya sebagai seorang penggembala kambing atau seorang yang jauh dari anggota keluarganya.\" Ketika beliau menuruni suatu lembah, beliau melewati bangkai anak kambing yang dibuang, maka beliau pun bersabda: \"Apakah kalian melihat alangkah hinanya bangkai ini di mata pemiliknya? Sesungguhnya dunia lebih hina di sisi Allah daripada hinanya bangkai ini di mata pemiliknya.\""
            },
            {
                "number": 2268,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ قَالَ أَبُو عَبْد الرَّحْمَنِ وَحَدَّثَنِي أَبُو خَيْثَمَةَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَاقَ عَنْ حَارِثَةَ بْنِ مُضَرِّبٍ عَنْ فُرَاتِ بْنِ حَيَّانَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِهِ وَكَانَ عَيْنًا لِأَبِي سُفْيَانَ وَحَلِيفًا فَمَرَّ بِحَلْقَةٍ مِنْ الْأَنْصَارِ فَقَالَ إِنِّي مُسْلِمٌ قَالُوا يَا رَسُولَ اللَّهِ إِنَّهُ يَزْعُمُ أَنَّهُ مُسْلِمٌ فَقَالَ إِنَّ مِنْكُمْ رِجَالًا نَكِلُهُمْ إِلَى إِيمَانِهِمْ مِنْهُمْ فُرَاتُ بْنُ حَيَّانَ",
                "id": "Telah menceritakan kepada kami [Ali bin Abdullah] Telah menceritakan kepada kami [Bisyr bin As Sariy] -Abdu Abdurrahman berkata- dan telah menceritakan kepadaku [Abu Khaitsamah] Telah menceritakan kepada kami [Bisyr bin As Sariy] Telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Haritsah bin Mudlarrib] dari [Furat bin Hayyan] bahwa Nabi shallallahu 'alaihi wasallam memerintahkan untuk membunuhnya. Ia adalah mata-matanya Sufyan dan juga sekutunya. Suatu ketika ia melewati suatu halaqah kaum Anshar dan berkata, \"Saya adalah seorang muslim.\" Mereka pun berkata, \"Wahai Rasulullah, ia mengaku bahwa ia adalah seorang muslim.\" Maka beliau bersabda: \"Sesungguhnya di antara kalian terdapat orang-orang yang kita tinggalkan iman mereka. Di antara mereka itu adalah Furat bin Hayyan.\""
            },
            {
                "number": 2269,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ عَنْ مُغِيرَةَ عَنْ مُوسَى بْنِ زِيَادِ بْنِ حِذْيَمٍ السَّعْدِيِّ عَنْ أَبِيهِ عَنْ جَدِّهِ حِذْيَمٍ السَّعْدِيِّ أَنَّهُشَهِدَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ فَقَالَ أَلَا إِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا وَكَحُرْمَةِ شَهْرِكُمْ هَذَا وَكَحُرْمَةِ بَلَدِكُمْ هَذَاقَالَ أَبُو عَبْد الرَّحْمَنِ و حَدَّثَنِي أَبُو خَيْثَمَةَ حَدَّثَنَا جَرِيرٌ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Ali bin Bahr] Telah menceritakan kepada kami [Jarir bin Abdul Hamid] dari [Mughirah] dari [Musa bin Ziyad bin Hidzyam As Sa'di] dari [bapaknya] dari [kakeknya, Hidzyam As Sa'di], bahwasanya; Ia turut menyaksikan Rasulullah shallallahu 'alaihi wasallam pada saat haji wada', yang mana beliau bersabda: \"Sesungguhnya darah kalian, harta kalian, dan kehormatan kalian adalah haram atas kalian, sebagaimana haramnya hari kalian ini, bulan kalian ini dan negeri kalian ini.\" Abu Abdurrahman berkata, telah menceritakan kepadaku [Abu Khutsaimah] Telah menceritakan kepada kami [Jarir]. Ia pun menyebutkan hadits semisalnya."
            },
            {
                "number": 2270,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي عَقِيلٍ قَاضِي وَاسِطٍ عَنْ سَابِقِ بْنِ نَاجِيَةَ عَنْ أَبِي سَلَّامٍ قَالَمَرَّ رَجُلٌ فِي مَسْجِدِ حِمْصَ فَقَالُوا هَذَا خَادِمُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقُمْتُ إِلَيْهِ فَقُلْتُ حَدِّثْنِي حَدِيثًا سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَتَدَاوَلُهُ بَيْنَكَ وَبَيْنَهُ الرِّجَالُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ عَبْدٍ مُسْلِمٍ يَقُولُ حِينَ يُصْبِحُ وَحِينَ يُمْسِي ثَلَاثَ مَرَّاتٍ رَضِيتُ بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا إِلَّا كَانَ حَقًّا عَلَى اللَّهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Aswad bin Amir] Telah menceritakan kepada kami [Syu'bah] dari [Abu 'Aqil] Qadli Wasith, dari [Sabiq bin Najiyah] dari [Abu Sallam] ia berkata; [Seorang laki-laki] berjalan melewati Masjid Himsh, maka orang-orang pun berkata, \"Orang ini adalah Khadimnya Nabi shallallahu 'alaihi wasallam.\" Maka saya pun beranjak ke arahnya dan berkata, \"Ceritakanlah kepadaku suatu hadits yang telah Anda denganr dari Rasulullah shallallahu 'alaihi wasallam, tanpa seorang perantara pun.\" Ia pun berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang muslim membaca, 'RADLITU BILLAHI RABBA WA BIL ISLAAMI DIINA WA BIMUHAMMADIN NABIYYA (Aku ridla Allah sebagai Rabb-ku, Islam sebagai agamaku, dan Muhammad sebagai Nabi-ku).' saat ia memasuki sore hari sebanyak tiga kali dan di pagi hari tiga kali, kecuali wajib bagi Allah untuk meridlainya pada hari kiamat.\""
            },
            {
                "number": 2271,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا مِسْعَرٌ عَنْ أَبِي عَقِيلٍ عَنْ سَابِقٍ عَنْ أَبِي سَلَّامٍ عَنْ خَادِمِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ قَالَ رَضِيتُ بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا حِينَ يُمْسِي ثَلَاثًا وَحِينَ يُصْبِحُ ثَلَاثًا كَانَ حَقًّا عَلَى اللَّهِ أَنْ يُرْضِيَهُ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Mis'ar] dari [Abu 'Aqil] dari [Sabiq] dari [Abu Sallam] dari [Khadim Nabi shallallahu 'alaihi wasallam] dari Nabi shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Barangsiapa yang mengatakan, 'RADLITU BILLAHI RABBA WA BIL ISLAAMI DIINA WA BIMUHAMMADIN NABIYYA (Aku ridla Allah sebagai Rabb-ku, Islam sebagai agamaku, dan Muhammad sebagai Nabi-ku).' saat ia memasuki sore hari sebanyak tiga kali dan di pagi hari tiga kali, maka wajib bagi Allah untuk meridlainya pada hari kiamat.\""
            },
            {
                "number": 2272,
                "arab": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي عَقِيلٍ هَاشِمِ بْنِ بِلَالٍ عَنْ سَابِقِ بْنِ نَاجِيَةَ عَنْ أَبِي سَلَّامٍ قَالَ أَبُو النَّضْرِ الْحَبَشِيُّ قَالَمَرَّ بِهِ رَجُلٌ فِي مَسْجِدِ حِمْصَ فَقِيلَ هَذَا خَدَمَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ إِلَيْهِ فَقَالَ حَدِّثْنِي حَدِيثًا سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَتَدَاوَلْهُ بَيْنَكَ وَبَيْنَهُ الرِّجَالُ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ عَبْدٍ يَقُولُ حِينَ يُمْسِي وَحِينَ يُصْبِحُ رَضِيتُ بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا ثَلَاثَ مَرَّاتٍ إِلَّا كَانَ حَقًّا عَلَى اللَّهِ أَنْ يُرْضِيَهُ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Qasim] Telah menceritakan kepada kami [Syu'bah] dari [Abu Aqil Hasyim bin Bilal] dari [Sabiq bin Najiyah] dari [Abu Sallam] -dalam riwayat lain, telah berkata Abu An Nadlr Al Habasyi- ia berkata; [Seorang laki-laki] melewatinya di Masjid Himsh, kemudian dikatakanlah bahwa, \"Ini adalah orang yang pernah menjadi Khadim (pelayan) Nabi shallallahu 'alaihi wasallam.\" Maka ia pun beranjak mendatangi laki-laki tersebut dan berkata, \"Ceritakanlah kepadaku suatu hadits yang telah Anda dengar langsung dari Rasulullah shallallahu 'alaihi wasallam dan tidak seorang pun memperantarai antara kamu dan beliau.\" Laki-laki itu pun berkata; Saya mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang hamba memasuki waktu sore dan pagi hari, kemudian ia membaca, 'RADLIITU BILLAHI RABBAA, WA BIL ISLAAMI DIINAA, WA BIMUHAMMAD SHALLALLAHU 'ALAIHI WASALLAM NABIYYAA (Aku rela Allah sebagai Rabb-ku, Islam sebagai agama-ku dan Muhammad shallallahu 'alaihi wasallam sebagai Nabi-ku).' sebanyak tiga kali, kecuali telah menjadi keharusan bagi Allah untuk meridlainya.\""
            },
            {
                "number": 2273,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ غَيْلَانَ حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ حَدَّثَنَا بَكْرُ بْنُ عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ هُبَيْرَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ أَنَّهُ حَدَّثَهُ رَجُلٌ خَدَمَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَمَانِ سِنِينَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قُرِّبَ لَهُ طَعَامٌ قَالَ بِسْمِ اللَّهِ فَإِذَا فَرَغَ مِنْ طَعَامِهِ قَالَ اللَّهُمَّ أَطْعَمْتَ وَأَسْقَيْتَ وَأَغْنَيْتَ وَأَقْنَيْتَ وَهَدَيْتَ وَاجْتَبَيْتَ فَلَكَ الْحَمْدُ عَلَى مَا أَعْطَيْتَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ghailan] Telah menceritakan kepada kami [Risydin bin Sa'd] Telah menceritakan kepada kami [Bakr bin Amr] dari [Abdullah bin Hubairah] dari [Abdurrahman bin Jubair] bahwa telah menceritakan kepadanya [seorang laki-laki] yang pernah menjadi Khadim (pelayan) Nabi shallallahu 'alaihi wasallam selama delapan tahun, ia berkata; Jika Nabi shallallahu 'alaihi wasallam disuguhkan makanan, maka beliau membaca: \"BISMILLAH.\" Dan jika beliau telah selesai makan, beliau membaca: \"ALLAHUMMA ATH'AMTA WA ASQAITA, WA AGHNAITA, WA AQNAITA WA HADAITA, WAJTABAITA, FALAKAL HAMDU MAA A'THAITA (Ya Allah, Engkau telah memberi makan dan minum. Engkau telah memberi kecukupan. Dan Engkaulah yang telah memberi petunjuk, serta memilih dan mensucikan -yang Engkau kehendaki dari para hambaMu- maka segala puji hanya bagi-Mu atas segala yang telah Engkau berikan).\""
            },
            {
                "number": 2274,
                "arab": "حَدَّثَنَا وَكِيعٌ أَخْبَرَنَا هِشَامُ بْنُ سَعْدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنِ ابْنِ الْأَدْرَعِ قَالَكُنْتُ أَحْرُسُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَخَرَجَ لِبَعْضِ حَاجَتِهِ قَالَ فَرَآنِي فَأَخَذَ بِيَدِي فَانْطَلَقْنَا فَمَرَرْنَا عَلَى رَجُلٍ يُصَلِّي يَجْهَرُ بِالْقُرْآنِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَسَى أَنْ يَكُونَ مُرَائِيًا قَالَ قُلْتُ يَا رَسُولَ اللَّهِ يُصَلِّي يَجْهَرُ بِالْقُرْآنِ قَالَ فَرَفَضَ يَدِي ثُمَّ قَالَ إِنَّكُمْ لَنْ تَنَالُوا هَذَا الْأَمْرَ بِالْمُغَالَبَةِ قَالَ ثُمَّ خَرَجَ ذَاتَ لَيْلَةٍ وَأَنَا أَحْرُسُهُ لِبَعْضِ حَاجَتِهِ فَأَخَذَ بِيَدِي فَمَرَرْنَا عَلَى رَجُلٍ يُصَلِّي بِالْقُرْآنِ قَالَ فَقُلْتُ عَسَى أَنْ يَكُونَ مُرَائِيًا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَلَّا إِنَّهُ أَوَّابٌ قَالَ فَنَظَرْتُ فَإِذَا هُوَ عَبْدُ اللَّهِ ذُو الْبِجَادَيْنِ",
                "id": "Telah menceritakan kepada kami [Waki'] telah mengabarkan kepada kami [Hisyam bin Sa'd] dari [Zaid bin Aslam] dari [Ibnu Al Adra'] ia berkata; Pada suatu malam, saya pernah menjaga Nabi shallallahu 'alaihi wasallam. kemudian beliau pun keluar untuk suatu keperluan. Beliau menggandeng tanganku dan kami pun pergi. Kemudian kami melewati seorang laki-laki yang sedang sholat dengan mengeraskan bacaan Alqur`annya, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Boleh jadi ia melakukannya karena riya`.\" Saya bertanya, \"Wahai Rasulullah, bukankah ia sholat dan dengan mengeraskan bacaan Al Qur`annya?\" Beliau pun melepaskan tanganku kemudian bersabda: \"Kalian tidak akan meraih Islam ini dengan cara mendebatku.\" Pada suatu malam, beliau keluar lagi untuk suatu keperluan. Saat itu, saya sedang menjaganya. Beliau kemudian menggandeng tanganku kemudian pergi dan melewati seorang laki-laki yang sedang sholat dengan membaca Al Qur`an, dan saya pun berkata, \"Boleh jadi ia melakukannya karena riya`.\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak, bahkan ia adalah seorang yang banyak bertaubat dan kembali kepada Allah.\" Saya menolehnya, dan ternyata ia adalah Abdullah Dzul Bijadain.\""
            },
            {
                "number": 2275,
                "arab": "حَدَّثَنَا يَزِيدُ أَخْبَرَنَا الْمَسْعُودِيُّ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ جَابِرِ بْنِ سَمُرَةَ عَنْ نَافِعِ بْنِ عُتْبَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُقَاتِلُونَ جَزِيرَةَ الْعَرَبِ فَيَفْتَحُهَا اللَّهُ وَتُقَاتِلُونَ فَارِسَ فَيَفْتَحُهُمْ اللَّهُ وَتُقَاتِلُونَ الرُّومَ فَيَفْتَحُهُمْ اللَّهُ وَتُقَاتِلُونَ الدَّجَّالَ فَيَفْتَحُهُ اللَّهُ",
                "id": "Telah menceritakan kepada kami [Yazid] telah mengabarkan kepada kami [Al Mas'udi] dari [Abdul Malik bin Umair] dari [Jabir bin Samurah] dari [Nafi' bin Utbah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalian memerangi bangsa Arab hingga Allah menaklukkannya. Kemudian kalian akan memerangi bangsa Persia, hingga Allah menaklukkan mereka, dan kalian akan memerangi bangsa Romawi, hingga Allah menaklukkan mereka. Dan kalian juga akan memerangi Dajjal, sehingga Allah menaklukkannya.\""
            },
            {
                "number": 2276,
                "arab": "حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو حَدَّثَنَا أَبُو إِسْحَاقَ يَعْنِي الْفَزَارِيَّ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ جَابِرِ بْنِ سَمُرَةَ عَنْ نَافِعِ بْنِ عُتْبَةَ قَالَكُنْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزَاةٍ فَأَتَاهُ قَوْمٌ مِنْ قِبَلِ الْمَغْرِبِ عَلَيْهِمْ ثِيَابُ الصُّوفِ فَوَافَقُوهُ عِنْدَ أَكَمَةٍ وَهُمْ قِيَامٌ وَهُوَ قَاعِدٌ فَأَتَيْتُهُ فَقُمْتُ بَيْنَهُمْ وَبَيْنَهُ فَحَفِظْتُ مِنْهُ أَرْبَعَ كَلِمَاتٍ أَعُدُّهُنَّ فِي يَدِي قَالَ تَغْزُونَ جَزِيرَةَ الْعَرَبِ فَيَفْتَحُهَا اللَّهُ ثُمَّ تَغْزُونَ فَارِسَ فَيَفْتَحُهَا اللَّهُ ثُمَّ تَغْزُونَ الرُّومَ فَيَفْتَحُهَا اللَّهُ ثُمَّ تَغْزُونَ الدَّجَّالَ فَيَفْتَحُهُ اللَّهُ قَالَ نَافِعٌ يَا جَابِرُ أَلَا تَرَى أَنَّ الدَّجَّالَ لَا يَخْرُجُ حَتَّى تُفْتَحَ الرُّومُ",
                "id": "Telah menceritakan kepada kami [Mu'awiyah bin Amr] Telah menceritakan kepada kami [Abu Ishaq] yakni Al Fazari, dari [Abdul Malik bin Umair] dari [Jabir bin Samurah] dari [Nafi' bin Utbah] ia berkata; Saya pernah bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu peperangan, kemudian beliau didatangi suatu kaum dari arah Barat yang semuanya memakai pakaian dari bahan wool. Dan mereka pun berpapasan dengan beliau di sisi bukit kecil. Mereka semua berdiri, sedangkan beliau duduk. Saya pun mendatanginya dan berdiri tepat di antara mereka dan tempat beliau berdiri. Akhirnya saya dapat menghafal empat kalimat dari beliau yang saya hitung dengan jari-jari tanganku. Beliau bersabda: \"Kalian memerangi bangsa Arab hingga Allah menaklukkannya. Kemudian kalian akan memerangi bangsa Persia, hingga Allah menaklukkan mereka, dan kalian akan memerangi bangsa Romawi, hingga Allah menaklukkan mereka. Dan kalian juga akan memerangi Dajjal, sehingga Allah menaklukkannya.\" Nafi' bertanya kepada Jabir, \"Wahai Jabir, bukankah Dajjal tidak akan keluar hingga Romawi ditaklukkan?\""
            },
            {
                "number": 2277,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنِي أَبِي حَدَّثَنَا حُسَيْنٌ يَعْنِي الْمُعَلِّمَ عَنِ ابْنِ بُرَيْدَةَ حَدَّثَنِي حَنْظَلَةُ بْنُ عَلِيٍّ أَنَّ مِحْجَنَ بْنَ الْأَدْرَعِ حَدَّثَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْمَسْجِدَ فَإِذَا هُوَ بِرَجُلٍ قَدْ قَضَى صَلَاتَهُ وَهُوَ يَتَشَهَّدُ وَهُوَ يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاللَّهِ الْوَاحِدِ الْأَحَدِ الصَّمَدِ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ أَنْ تَغْفِرَ لِي ذُنُوبِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ قَالَ فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ غُفِرَ لَهُ قَدْ غُفِرَ لَهُ قَدْ غُفِرَ لَهُ ثَلَاثَ مَرَّاتٍ",
                "id": "Telah menceritakan kepada kami [Abdush Shamad] telah menceritakan kepadaku [bapakku] Telah menceritakan kepada kami [Husain] yakni Al Mu'allim, dari [Ibnu Buraidah] telah menceritakan kepadaku [Hanzhalah bin Ali] bahwa [Mihjan bin Al Adra'] telah menceritakan kepadanya, bahwa suatu ketika, Rasulullah shallallahu 'alaihi wasallam masuk masjid, kemudian beliau mendapati seorang laki-laki yang sedang bertasyahud mengakhiri sholatnya dengan membaca: \"ALLAHUMMA INNII ASALUKA BILLAHIL WAAHIDIL AHADISH SHAMAD ALLADZI LAM YALID WA LAM YUULAD, WALAM YAKUN LAHU KUFUWAN AHAD, AN TAGHFIRLII DZUNUUBII, INNAKA ANTAL GHAFUURUR RAHIIM (Ya Allah, aku meminta kepada-Mu dengan nama Allah yang Maha Esa, Yang tiada beranak dan tidak pula diperanakkan, Dan tidak ada seorangpun yang setara dengan Dia).\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Sungguh, ia telah diampuni. Sungguh, ia telah diampuni. Sungguh, ia telah diampuni.\""
            },
            {
                "number": 2278,
                "arab": "حَدَّثَنَا يُونُسُ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ سَعِيدٍ الْجُرَيْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ مِحْجَنِ بْنِ الْأَدْرَعِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ النَّاسَ فَقَالَ يَوْمُ الْخَلَاصِ وَمَا يَوْمُ الْخَلَاصِ يَوْمُ الْخَلَاصِ وَمَا يَوْمُ الْخَلَاصِ يَوْمُ الْخَلَاصِ وَمَا يَوْمُ الْخَلَاصِ ثَلَاثًا فَقِيلَ لَهُ وَمَا يَوْمُ الْخَلَاصِ قَالَ يَجِيءُ الدَّجَّالُ فَيَصْعَدُ أُحُدًا فَيَنْظُرُ الْمَدِينَةَ فَيَقُولُ لِأَصْحَابِهِ أَتَرَوْنَ هَذَا الْقَصْرَ الْأَبْيَضَ هَذَا مَسْجِدُ أَحْمَدَ ثُمَّ يَأْتِي الْمَدِينَةَ فَيَجِدُ بِكُلِّ نَقْبٍ مِنْهَا مَلَكًا مُصْلِتًا فَيَأْتِي سَبْخَةَ الْحَرْفِ فَيَضْرِبُ رُوَاقَهُ ثُمَّ تَرْجُفُ الْمَدِينَةُ ثَلَاثَ رَجَفَاتٍ فَلَا يَبْقَى مُنَافِقٌ وَلَا مُنَافِقَةٌ وَلَا فَاسِقٌ وَلَا فَاسِقَةٌ إِلَّا خَرَجَ إِلَيْهِ فَذَلِكَ يَوْمُ الْخَلَاصِ",
                "id": "Telah menceritakan kepada kami [Yunus] Telah menceritakan kepada kami [Hammad] yakni Ibnu Salamah, dari [Sa'id Al Jurairi] dari [Abdullah bin Syaqiq] dari [Mihjan bin Al Adra'] bahwa Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada manusia seraya bersabda: \"Hari Al Khalash, dan apakah itu hari Al Khalash? Hari Al Khalash, dan apakah itu hari Al Khalash? Hari Al Khalash, dan apakah itu hari Al Khalash?\" beliau mengulanginya hingga tiga kali, lalu ditanyakanlah kepada beliau, \"Dan apakah itu hari Al Khalash?\" beliau menjawab: \"Yaitu, saat keluarnya Dajjal, lalu ia menaiki gunung Uhud sehingga ia pun melihat kota Madinah. Kepada ia pun berkata kepada para sahabatnya, 'Tidakkah kalian melihat istana yang putih ini? ini adalah Masjidnya Ahmad.\" Kemudian ia mendatangi Madinah, dan ia pun mendapati pada setiap jalannya satu Malaikat yang telah siap dengan hunusan pedangnya. Lalu ia mendatangi Sabhatul Harf (tanah kering di penghujung kota Madinah), kemudian ia memukul-mukul perkemahaman, Qubah beserta tempat-tempat duduknya, dengan itu, kota Madinah pun bergetar dengan tiga kali getaran. Sehingga tidak seorang munafik pun baik laki-laki atau perempuan dan tidak juga seorang fasik pun baik laki-laki maupun perempuan yang tersisa, kecuali semuanya keluar mengikuti Dajjal. Dan hari itulah yang dinamakan Yaumul Khalash.\" "
            },
            {
                "number": 2279,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ رَجَاءِ بْنِ أَبِي رَجَاءٍ قَالَكَانَ بُرَيْدَةُ عَلَى بَابِ الْمَسْجِدِ فَمَرَّ مِحْجَنٌ عَلَيْهِ وَسُكْبَةُ يُصَلِّي فَقَالَ بُرَيْدَةُ وَكَانَ فِيهِ مُرَاحٌ لِمِحْجَنٍ أَلَا تُصَلِّي كَمَا يُصَلِّي هَذَا فَقَالَ مِحْجَنٌ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ بِيَدِي فَصَعِدَ عَلَى أُحُدٍ فَأَشْرَفَ عَلَى الْمَدِينَةِ فَقَالَ وَيْلُ أُمِّهَا قَرْيَةً يَدَعُهَا أَهْلُهَا خَيْرَ مَا تَكُونُ أَوْ كَأَخْيَرِ مَا تَكُونُ فَيَأْتِيهَا الدَّجَّالُ فَيَجِدُ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِهَا مَلَكًا مُصْلِتًا جَنَاحَيْهِ فَلَا يَدْخُلُهَا قَالَ ثُمَّ نَزَلَ وَهُوَ آخِذٌ بِيَدِي فَدَخَلَ الْمَسْجِدَ وَإِذَا هُوَ بِرَجُلٍ يُصَلِّي فَقَالَ لِي مَنْ هَذَا فَأَتَيْتُ عَلَيْهِ فَأَثْنَيْتُ عَلَيْهِ خَيْرًا فَقَالَ اسْكُتْ لَا تُسْمِعْهُ فَتُهْلِكَهُ قَالَ ثُمَّ أَتَى حُجْرَةَ امْرَأَةٍ مِنْ نِسَائِهِ فَنَفَضَ يَدَهُ مِنْ يَدِي قَالَ إِنَّ خَيْرَ دِينِكُمْ أَيْسَرُهُ إِنَّ خَيْرَ دِينِكُمْ أَيْسُرُهُحَدَّثَنَا حَجَّاجٌ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ شَقِيقٍ يُحَدِّثُ عَنْ رَجَاءِ بْنِ أَبِي رَجَاءٍ الْبَاهِلِيِّ عَنْ مِحْجَنٍ رَجُلٍ مِنْ أَسْلَمَ فَذَكَرَ مَعْنَاهُ وَلَمْ يَقُلْ حَجَّاجٌ وَلَا أَبُو النَّضْرِ بِجَنَاحِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Abu Bisyr] dari [Abdullah bin Syaqiq] dari [Raja` bin Abu Raja`] ia berkata; Suatu ketika, Burdah berada di pintu Masjid, kemudian lewatlah Mihjan, sementara Sukbah sedang menunaikan sholat. Maka Burdah pun bertanya -di sekitar tempat itu, ada kandang Unta milik Mihjan-, \"Tidakkah kamu sholat sebagaimana orang ini sholat?\" kemudian [Mihjan] menjawab, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam pernah menggandeng tanganku, kemudian beliau menaiki gunung Uhud dan memandangi kota Madinah. Kemudian beliau bersabda: 'Musibah akan menimpa Ummul Qura. Sebuah daerah yang akan ditinggal pergi oleh sebagian penduduknya, dan hal itu merupakan peristiwa yang paling baik yang pernah terjadi. Kemudian Dajjal mendatanginya, dan ia pun mendapati pada setiap pintu kota Madinah satu Malaikat yang mengepakkan sayapnya, hingga ia tidak dapat memasukinya.' Kemudian beliau turun sambil memegang tanganku, dan masuk ke dalam Masjid. Ternyata beliau mendapati seorang laki-laki yang sedang sholat, beliau bertanya, 'Siapakah orang ini? ' saya pun mendatangi laki-laki itu dan memujinya dengan kebaikan. Maka beliau bersabda: 'Diamlah. Jangan kamu memperdengarkannya hingga kamu menghancurkannya.' Setelah itu, beliau mendatangi kamar salah seorang dari isteri-isterinya, dan beliau pun melepaskan tanganku dari tangannya. Beliau bersabda: 'Sesungguhnya yang terbaik dari Agama kalian adalah yang termudah. Sesungguhnya yang terbaik dari Agama kalian adalah yang termudah.'\" Telah menceritakan kepada kami [Hajjaj] Telah menceritakan kepada kami [Syu'bah] dari [Abu Bisyr] ia berkata, saya mendengar [Abdullah bin Syaqiq] menceritakan dari [Raja` bin Abu Raja` Al Bahili] dari [Mihjan] seorang laki-laki berasal dari Bani Aslam, Maka ia pun menyebutkan maknanya. Dan [Hajjaj] tidak Mengatakan, \"Sayapnya.\" Dan tidak pula [Abu An Nadlr]."
            },
            {
                "number": 2280,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ زَيْدِ بْنِ أَسْلَمَ قَالَ سُفْيَانُ مَرَّةً عَنْ بُسْرٍ أَوْ بُسْرِ بْنِ مِحْجَنٍ ثُمَّ كَانَ يَقُولُ بَعْدُ عَنْ أَبِي مِحْجَنٍ الدِّيلِيِّ عَنْ أَبِيهِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي الْمَسْجِدِ فَحَضَرَتْ الصَّلَاةُ فَصَلَّى فَقَالَ لِي أَلَا صَلَّيْتَ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ قَدْ صَلَّيْتُ فِي الرَّحْلِ ثُمَّ أَتَيْتُكَ قَالَ فَإِذَا فَعَلْتَ فَصَلِّ مَعَهُمْ وَاجْعَلْهَا نَافِلَةًقَالَ أَبِي وَلَمْ يَقُلْ أَبُو نُعَيْمٍ وَلَا عَبْدُ الرَّحْمَنِ وَاجْعَلْهَا نَافِلَةً",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Sufyan] dari [Zaid bin Aslam] -dan sekali waktu Sufyan berkata- dari [Busr] atau Busrun bin Mihjan -setelah itu ia mengatakan, dari ayahku, Mihjan Ad Dili- dari [bapaknya] ia berkata; Saya mendatangi Nabi shallallahu 'alaihi wasallam, yang saat itu beliau berada di Masjid. Kemudian masuklah waktu sholat, beliau pun sholat dan bertanya kepadaku: \"Tidakkah kamu sholat?\" saya menjawab, \"Wahai Rasulullah, saya telah menunaikan sholat di perjalanan, baru kemudian menemui Anda.\" Beliau bersabda: \"Jika kamu telah laksanakan, maka sholatlah bersama mereka, dan jadikanlah ia sebagai Nafilah.\" Bapakku berkata; [Abu Nu'aim] tidak mengatakan, \"Dan jadikanlah ia sebagai sholat Nafilah.\" Dan tidak pula [Abdurrahman]."
            },
            {
                "number": 2281,
                "arab": "حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ عَنْ سُلَيْمَانَ بْنِ سُلَيْمٍ عَنْ يَحْيَى بْنِ جَابِرٍ عَنْ ضَمْرَةَ بْنِ ثَعْلَبَةَ أَنَّهُأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ حُلَّتَانِ مِنْ حُلَلِ الْيَمَنِ فَقَالَ يَا ضَمْرَةُ أَتَرَى ثَوْبَيْكَ هَذَيْنِ مُدْخِلَيْكَ الْجَنَّةَ فَقَالَ لَئِنْ اسْتَغْفَرْتَ لِي يَا رَسُولَ اللَّهِ لَا أَقْعُدُ حَتَّى أَنْزَعَهُمَا عَنِّي فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ اغْفِرْ لِضَمْرَةَ بْنِ ثَعْلَبَةَ فَانْطَلَقَ سَرِيعًا حَتَّى نَزَعَهُمَا عَنْهُ",
                "id": "Telah menceritakan kepada kami [Suraij bin Nu'man] Telah menceritakan kepada kami [Baqiyyah bin Al Walid] dari [Sulaiman bin Sulaim] dari [Yahya bin Jabir] dari [Dlamrah bin Tsa'labah] bahwa ia pernah mendatangi Nabi shallallahu 'alaihi wasallam dengan mengenakan dua helai pakaian yang berasal dari Yaman. maka beliau pun bertanya: \"Wahai Dlamrah, apakah kamu mengira kedua helai pakaianmu ini akan memasukkanmu ke dalam surga?\" ia menjawab, \"Jika Anda mau meminta ampun bagiku, wahai Rasulullah, niscaya saya tidak akan duduk, hingga aku menanggalkannya dari tubuhku.\" Maka Nabi shallallahu 'alaihi wasallam membaca: \"Ya Allah, Ampunilah Dlamrah bin Tsa'labah.\" Ia pun segera pergi dan menanggalkan pakaiannya."
            },
            {
                "number": 2282,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ يَعْقُوبَ بْنِ بَحِيرٍ عَنْ ضِرَارِ بْنِ الْأَزْوَرِ قَالَبَعَثَنِي أَهْلِي بِلَقُوحٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَنِي أَنْ أَحْلُبَهَا فَحَلَبْتُهَا فَقَالَ لِي دَعْ دَاعِيَ اللَّبَنِ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Al A'masy] dari [Ya'qub bin Bahir] dari [Dlirar bin Al Azwar] ia berkata; Suatu ketika, aku diutus oleh keluargaku untuk membawa Unta perahan kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian beliau memerintahkanku untuk memerah susunya, maka saya pun memerahnya. Kemudian beliau bersabda: \"Tinggalkanlah sedikit dari susunya, agar ia menurunkan air susu yang lain.\""
            },
            {
                "number": 2283,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا زُهَيْرٌ عَنِ الْأَعْمَشِ عَنْ يَعْقُوبَ بْنِ بَحِيرٍ رَجُلٍ مِنْ الْحَيِّ قَالَ سَمِعْتُ ضِرَارَ بْنَ الْأَزْوَرِ قَالَأَهْدَيْنَا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِقْحَةً قَالَ فَحَلَبْتُهَا قَالَ فَلَمَّا أَخَذْتُ لِأُجْهِدَهَا قَالَ لَا تَفْعَلْ دَعْ دَاعِيَ اللَّبَنِ",
                "id": "Telah menceritakan kepada kami [Aswad bin Amir] Telah menceritakan kepada kami [Zuhair] dari [Al A'masy] dari [Ya'qub bin Bahir] seorang laki-laki dari Al Hayy, ia berkata, saya mendengar [Dlirar bin Al Azwar] ia berkata; Kami menghadiahkan kepada Rasulullah shallallahu 'alaihi wasallam Unta perahan. Kemudian saya pun memerahnya. Ketika saya mengambil untuk memerahnya beliau bersabda: \"Jangan kamu lakukan, tinggalkanlah sedikit dari susunya, agar menurunkan air susu yang lain.\""
            },
            {
                "number": 2284,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنِ الْأَعْمَشِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ ضِرَارِ بْنِ الْأَزْوَرِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ وَهُوَ يَحْلُبُ فَقَالَ دَعْ دَاعِيَ اللَّبَنِقَالَ عَبْد اللَّهِ و حَدَّثَنِي مُحَمَّدُ بْنُ بَكَّارٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ حَدَّثَنَا الْأَعْمَشُ أَوْ عَنْ الْأَعْمَشِ عَنْ يَعْقُوبَ بْنِ بَحِيرٍ عَنْ ضِرَارِ بْنِ الْأَزْوَرِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman] Telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Abdullah bin Sinan] dari [Dlirar bin Al Azwar] bahwa Nabi shallallahu 'alaihi wasallam melewatinya, sementara ia sedang memerah susu. Maka beliau pun bersabda: \"Tinggalkanlah sedikit dari susunya, agar menurunkan air susu yang lain.\" Abdullah berkata; Dan telah menceritakan kepadaku [Muhammad bin Bakkar] Telah menceritakan kepada kami [Abdullah bin Mubarak] Telah menceritakan kepada kami [Al A'masy] atau dari Al A'masy dari [Ya'qub bin Bahir] dari [Dlirar bin Al Azwar] dari Nabi shallallahu 'alaihi wasallam, semisalnya."
            },
            {
                "number": 2285,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا أَبُو إِسْرَائِيلَ الْجُشَمِيُّ عَنْ شَيْخٍ لَهُمْ يُقَالُ لَهُ جَعْدَةُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى لِرَجُلٍ رُؤْيَا قَالَ فَبَعَثَ إِلَيْهِ فَجَاءَ فَجَعَلَ يَقُصُّهَا عَلَيْهِ وَكَانَ الرَّجُلُ عَظِيمَ الْبَطْنِ قَالَ فَجَعَلَ يَقُولُ بِأُصْبُعِهِ فِي بَطْنِهِ لَوْ كَانَ هَذَا فِي غَيْرِ هَذَا لَكَانَ خَيْرًا لَكَ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Syu'bah] Telah menceritakan kepada kami [Abu Isra`il Al Jusyami] dari syaikh mereka yang biasa dipanggil [Ja'dah], bahwa Nabi shallallahu 'alaihi wasallam pernah bermimpi melihat seorang laki-laki, maka beliau pun mengutus seseorang kepadanya. laki-laki itu datang, dan beliau pun mengkisahkan mimpinya. Laki-laki itu adalah seorang yang besar perutnya, maka beliau bersabda seraya menunjuk perut laki-laki itu: \"Sekiranya ini, ditempatkan bukan di sini, niscaya hal itu akan lebih baik.\""
            },
            {
                "number": 2286,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنِ السَّائِبِ بْنِ يَزِيدَ عَنِ الْعَلَاءِ بْنِ الْحَضْرَمِيِّ إِنْ شَاءَ اللَّهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَمْكُثُ الْمُهَاجِرُ بِمَكَّةَ بَعْدَ قَضَاءِ نُسُكِهِ ثَلَاثًاقَالَ مَا كَانَ أَشَدَّ عَلَى ابْنِ عُيَيْنَةَ أَنْ يَقُولَ حَدَّثَنَا",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] telah menceritakan kepadaku [Abdurrahman bin Humaid bin Abdurrahman bin Auf] dari [As Sa`ib bin Yazid] dari [Al Ala` bin Al Hadlrami] Insya Allah, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Para Muhajir bermukim di Makkah selama tiga malam setelah menunaikan Nusuknya (menyembelih hewan kurban).\" Tidak ada lebih keras atas diri Ibnu Uyainah melebihi ketika ia mengatakan, \"Telah menceritakan kepada kami.\""
            },
            {
                "number": 2287,
                "arab": "حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا مَنْصُورٌ عَنِ ابْنِ سِيرِينَ عَنِ ابْنِ الْعَلَاءِ بْنِ الْحَضْرَمِيِّ قَالَ أَبِي حَدَّثَنَا بِهِ هُشَيْمٌ مَرَّتَيْنِ مَرَّةً عَنْ ابْنِ الْعَلَاءِ وَمَرَّةً لَمْ يَصِلْأَنَّ أَبَاهُ كَتَبَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَدَأَ بِنَفْسِهِ",
                "id": "Telah menceritakan kepada kami [Husyaim] Telah menceritakan kepada kami [Manshur] dari [Ibnu Sirin] dari [Ibnul Ala` bin Al Hadlrami], -bapakku berkata, Husyaim telah menceritakannya kepada kami sebanyak dua kali, sekali dari Ibnul Ala` dan yang satunya lagi tidak bersambung sanadnya- Bahwa [bapaknya] menulis surat kepada Nabi shallallahu 'alaihi wasallam, dan ia pun memulai dari dirinya sendiri."
            },
            {
                "number": 2288,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ سَلَمَةَ بْنِ قَيْسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَوَضَّأْتَ فَانْتَثِرْ وَإِذَا اسْتَجْمَرْتَ فَأَوْتِرْ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Manshur] dari [Hilal bin Yasaf] dari [Salamah bin Qais] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kamu berwudlu, maka lakukanlah Al Intsar (memasukkan air ke dalam hidung, dan menghembuskannya kembali). Dan jika kamu beristinja` dengan batu, maka ganjilkanlah bilangannya.\""
            },
            {
                "number": 2289,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ سَلَمَةَ بْنِ قَيْسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَوَضَّأْتَ فَانْتَثِرْ وَإِذَا اسْتَجْمَرْتَ فَأَوْتِرْ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Sufyan] dari [Manshur] dari [Hilal bin Yasaf] dari [Salamah bin Qais] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kamu berwudlu, maka lakukanlah Al Intsar (memasukkan air ke dalam hidung, dan menghembuskannya kembali). Dan jika kamu beristinja` dengan batu, maka ganjilkanlah bilangannya.\""
            },
            {
                "number": 2290,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ سَلَمَةَ بْنِ قَيْسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ إِنَّمَا هُنَّ أَرْبَعٌ لَا تُشْرِكُوا بِاللَّهِ شَيْئًا وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ وَلَا تَسْرِقُوا وَلَا تَزْنُوا",
                "id": "Telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dari [Manshur] dari [Hilal bin Yasaf] dari [Salamah bin Qais] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda pada saat Haji Wada': \"Sesungguhnya hanya ada empat perkara, yaitu, Janganlah kalian berbuat syirik kepada Allah, janganlah kalian membunuh jiwa yang diharamkan Allah kecuali dengan benar, janganlah kalian mencuri dan janganlah kalian berzina.\""
            },
            {
                "number": 2291,
                "arab": "حَدَّثَنَا هَاشِمٌ قَالَ ثَنَا أَبُو مُعَاوِيَةَ يَعْنِي شَيْبَانَ حَدَّثَنَا مَنْصُورٌ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ سَلَمَةَ بْنِ قَيْسٍ الْأَشْجَعِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ أَلَا إِنَّمَا هُنَّ أَرْبَعٌ أَنْ لَا تُشْرِكُوا بِاللَّهِ شَيْئًا وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ وَلَا تَزْنُوا وَلَا تَسْرِقُوا قَالَ فَمَا أَنَا بِأَشَحَّ عَلَيْهِنَّ مِنِّي إِذْ سَمِعْتُهُنَّ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Hasyim] ia berkata, Telah menceritakan kepada kami [Abu Mu'awiyah] yakni Syaiban, Telah menceritakan kepada kami [Manshur] dari [Hilal bin Yasaf] dari [Salamah bin Qais Al Asyja'i] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda pada saat Haji Wada': \"Ketahuilah, kuperintahkan kepada kalian empat perkara, yaitu, Janganlah kalian menyekutukan Allah dengan sesuatu apapun, janganlah kalian membunuh jiwa yang diharamkan Allah kecuali dengan benar, janganlah kalian mencuri dan janganlah kalian berzina.\" Tidaklah saya lebih pelit untuk melakukan semua itu, setelah saya mendengarnya semua dari Rasulullah shallallahu 'alaihi wasallam."
            },
            {
                "number": 2292,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ وَالثَّوْرِيُّ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ سَلَمَةَ بْنِ قَيْسٍ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَوَضَّأْتَ فَانْتَثِرْ وَإِذَا اسْتَجْمَرْتَ فَأَوْتِرْ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] Telah menceritakan kepada kami [Ma'mar] dan [Ats Tsauri] dari [Manshur] dari [Hilal bin Yasaf] dari [Salamah bin Qais] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Jika kamu berwudlu, maka lakukanlah Al Intsar (memasukkan air ke dalam hidung, dan menghembuskannya kembali). Dan jika kamu beristinja` dengan batu, maka ganjilkanlah bilangannya.\""
            },
            {
                "number": 2293,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنِ ابْنِ خُثَيْمٍ عَنْ إِسْمَاعِيلَ بْنِ عُبَيْدِ بْنِ رِفَاعَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَوْلَى الْقَوْمِ مِنْهُمْ وَابْنُ أُخْتِهِمْ مِنْهُمْ وَحَلِيفُهُمْ مِنْهُمْ",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Ibnu Khutsaim] dari [Isma'il bin Ubaid bin Rifa'ah] dari [bapaknya] dari [kakeknya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bekas budak suatu kaum adalah termasuk golongan mereka, anak saudara perempuannya juga dari golongan mereka, dan sekutu mereka, juga termasuk golongan mereka.\""
            },
            {
                "number": 2294,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنِ ابْنِ خُثَيْمٍ عَنْ إِسْمَاعِيلَ بْنِ عُبَيْدِ بْنِ رِفَاعَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَجَمَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُرَيْشًا فَقَالَ هَلْ فِيكُمْ مِنْ غَيْرِكُمْ قَالُوا لَا إِلَّا ابْنُ أُخْتِنَا وَحَلِيفُنَا وَمَوْلَانَا فَقَالَ ابْنُ أُخْتِكُمْ مِنْكُمْ وَحَلِيفُكُمْ مِنْكُمْ وَمَوْلَاكُمْ مِنْكُمْ إِنَّ قُرَيْشًا أَهْلُ صِدْقٍ وَأَمَانَةٍ فَمَنْ بَغَى لَهَا الْعَوَائِرَ أَكَبَّهُ اللَّهُ فِي النَّارِ لِوَجْهِهِ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Sufyan] dari [Ibnu Khutsaim] dari [Isma'il bin Ubaid bin Rifa'ah] dari [bapaknya] dari [kakeknya] ia berkata; Rasulullah shallallahu 'alaihi wasallam menyatakan orang-orang Quraisy. Beliau pun bertanya: \"Apakah di antara kalian ada orang lain selain dari kabilah kalian?\" mereka menjawab, \"Tidak ada kecuali, anak saudara perempuan kami dan sekutu kami serta bekas budak kami.\" Maka beliau bersabda: \"Sesungguhnya anak saudara perempuan kalian, para sekutu kalian dan bekas budak kalian, semuanya adalah termasuk dari kabilah kalian. Sesungguhnya orang-orang Quraiys adalah orang-orang yang jujur lagi amanahj, maka siapa yang berani bertindak lalim dan gegabah terhadapnya, niscaya Allah akan melemparkannya ke dalam neraka.\""
            },
            {
                "number": 2295,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ إِسْمَاعِيلَ بْنِ عُبَيْدِ بْنِ رِفَاعَةَ بْنِ رَافِعٍ الزُّرَقِيِّ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حَلِيفُنَا مِنَّا وَمَوْلَانَا مِنَّا وَابْنُ أُخْتِنَا مِنَّا",
                "id": "Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Bisyr] yakni Ibnu Al Mufadldlal, Telah menceritakan kepada kami [Abdullah bin Utsman bin Khutsaim] dari [Isma'il bin Ubaid bin Rifa'ah bin Rafi' Az Zuraqi] dari [bapaknya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekutu kami, bekas budak kami dan anak saudara perempuan kami adalah termasuk dari golongan kami.\""
            },
            {
                "number": 2296,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ عَلِيِّ بْنِ يَحْيَى بْنِ خَلَّادٍ الزُّرَقِيِّ عَنْ رِفَاعَةَ بْنِ رَافِعٍ الزُّرَقِيِّ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَجَاءَ رَجُلٌ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسٌ فِي الْمَسْجِدِ فَصَلَّى قَرِيبًا مِنْهُ ثُمَّ انْصَرَفَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعِدْ صَلَاتَكَ فَإِنَّكَ لَمْ تُصَلِّ قَالَ فَرَجَعَ فَصَلَّى كَنَحْوٍ مِمَّا صَلَّى ثُمَّ انْصَرَفَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ أَعِدْ صَلَاتَكَ فَإِنَّكَ لَمْ تُصَلِّ فَقَالَ يَا رَسُولَ اللَّهِ عَلِّمْنِي كَيْفَ أَصْنَعُ قَالَ إِذَا اسْتَقْبَلْتَ الْقِبْلَةَ فَكَبِّرْ ثُمَّ اقْرَأْ بِأُمِّ الْقُرْآنِ ثُمَّ اقْرَأْ بِمَا شِئْتَ فَإِذَا رَكَعْتَ فَاجْعَلْ رَاحَتَيْكَ عَلَى رُكْبَتَيْكَ وَامْدُدْ ظَهْرَكَ وَمَكِّنْ لِرُكُوعِكَ فَإِذَا رَفَعْتَ رَأْسَكَ فَأَقِمْ صُلْبَكَ حَتَّى تَرْجِعَ الْعِظَامُ إِلَى مَفَاصِلِهَا وَإِذَا سَجَدْتَ فَمَكِّنْ لِسُجُودِكَ فَإِذَا رَفَعْتَ رَأْسَكَ فَاجْلِسْ عَلَى فَخِذِكَ الْيُسْرَى ثُمَّ اصْنَعْ ذَلِكَ فِي كُلِّ رَكْعَةٍ وَسَجْدَةٍ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] ia berkata, telah mengabarkan kepada kami [Muhammad bin Amru] dari [Ali bin Yahya bin Khallad Az Zuraqi] dari [Rifa'ah bin Rafi' Az Zuraqi] ia adalah salah seorang dari sahabat Nabi shallallahu 'alaihi wasallam, ia berkata; Seorang laki-laki datang, sementara Rasulullah shallallahu 'alaihi wasallam sedang duduk di dalam Masjid. Kemudian laki-laki itu sholat di dekat beliau, dan setelah sholat ia pun menemui Rasulullah shallallahu 'alaihi wasallam. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ulangilah sholatmu, karena kamu belum sholat.\" laki-laki itu pun mengulangi sholatnya seperti yang dikerjakannya pertama kali. Setelah selesai, ia pun kembali menemui Rasulullah shallallahu 'alaihi wasallam, dan beliau bersabda lagi: \"Ulangilah sholatmu, karena sesungguhnya kamu belum sholat.\" maka laki-laki itu pun berkata, \"Wahai Rasulullah, ajarilah aku, bagaimana seharusnya saya lakukan!\" beliau bersabda: \"Jika telah menghadap kiblat, maka bertakbir dan bacalah Ummul Qur`an (surat Al Fatihah), kemudian bacalah sesukamu dari Al Qur`an. Dan jika kamu ruku', maka letakkanlah kedua telapak tanganmu di atas kedua lututmu. Luruskanlah punggungmu dan bersikap tenanglah dalam posisi ruku'. Dan ketika kamu mengangkat kepala dari posisi ruku', maka luruskanlah tulang sulbimu, sehingga tulang-tulang dan persendian kembali ke posisinya semula. Kemudian saat kamu sujud, maka bersikap tenanglah dalam sujudmu, dan jika kamu mengangkat kepala dari posisi sujud, maka duduklah di atas paha kirimu. Dan lakukanlah itu semua dalam setiap raka'at dan sujud.\""
            },
            {
                "number": 2297,
                "arab": "قَالَ قَرَأْتُ عَلَى عَبْدِ الرَّحْمَنِ بْنِ مَهْدِيٍّ : مَالِكٌ عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ عَنْ عَلِيِّ بْنِ يَحْيَى الزُّرَقِيِّ عَنْ أَبِيهِ عَنْ رِفَاعَةَ بْنِ رَافِعٍ الزُّرَقِيِّ قَالَكُنَّا نُصَلِّي يَوْمًا وَرَاءَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأْسَهُ مِنْ الرَّكْعَةِ وَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ قَالَ رَجُلٌ وَرَاءَهُ رَبَّنَا لَكَ الْحَمْدُ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ فَلَمَّا انْصَرَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ الْمُتَكَلِّمُ آنِفًا قَالَ الرَّجُلُ أَنَا يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ رَأَيْتُ بِضْعَةً وَثَلَاثِينَ مَلَكًا يَبْتَدِرُونَهَا أَيُّهُمْ يَكْتُبُهَا أَوَّلًا",
                "id": "(Imam Ahmad) Berkata, Saya telah membacakan kepada [Abdurrahman bin Mahdi]: [Malik] dari [Nu'aim bin Abdullah Al Mujmir] dari [Ali bin Yahya Az Zuraqi] dari [ayahnya] dari [Rifa'ah bin Rafi' Az Zuraqi] ia berkata; Pada suatu hari, kami sholat di belakang Rasulullah shallallahu 'alaihi wasallam. Ketika beliau mengangkat kepalanya dari ruku' dan membaca, \"SAMI'ALLAHU LIMAN HAMIDAH (Allah Maha Mendengar bagi siapa saja yang memujinya).\" Tiba-tiba seorang laki-laki menyahut di belakangnya, \"RABBANAA LAKAL HAMDU KATSIIRAN THAYYIBAN MUBAARAKAN FIIH (Ya Rabb kami, bagi-Mu segala pujian yang baik dan banyak, serta mengandung keberkahan).\" Ketika Rasulullah shallallahu 'alaihi wasallam selesai sholat, beliau bertanya: \"Siapa yang berkata-kata tadi?\" laki-laki itu pun menjawab, \"Saya wahai Rasulullah.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungghnya saya telah melihat tiga puluh lebih Malaikat yang saling berlomba, siapa di antara mereka yang menulisnya pertama kali.\""
            },
            {
                "number": 2298,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ عَجْلَانَ حَدَّثَنَا عَلِيُّ بْنُ يَحْيَى بْنِ خَلَّادٍ عَنْ أَبِيهِ عَنْ عَمِّهِ وَكَانَ بَدْرِيًّا قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ فَدَخَلَ رَجُلٌ فَصَلَّى فِي نَاحِيَةِ الْمَسْجِدِ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمُقُهُ ثُمَّ جَاءَ فَسَلَّمَ فَرَدَّ عَلَيْهِ وَقَالَ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ قَالَ مَرَّتَيْنِ أَوْ ثَلَاثًا فَقَالَ لَهُ فِي الثَّالِثَةِ أَوْ فِي الرَّابِعَةِ وَالَّذِي بَعَثَكَ بِالْحَقِّ لَقَدْ أَجْهَدْتُ نَفْسِي فَعَلِّمْنِي وَأَرِنِي فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَدْتَ أَنْ تُصَلِّيَ فَتَوَضَّأْ فَأَحْسِنْ وُضُوءَكَ ثُمَّ اسْتَقْبِلْ الْقِبْلَةَ ثُمَّ كَبِّرْ ثُمَّ اقْرَأْ ثُمَّ ارْكَعْ حَتَّى تَطْمَئِنَّ رَاكِعًا ثُمَّ ارْفَعْ حَتَّى تَطْمَئِنَّ قَائِمًا ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا ثُمَّ ارْفَعْ حَتَّى تَطْمَئِنَّ جَالِسًا ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا ثُمَّ قُمْ فَإِذَا أَتْمَمْتَ صَلَاتَكَ عَلَى هَذَا فَقَدْ أَتْمَمْتَهَا وَمَا انْتَقَصْتَ مِنْ هَذَا مِنْ شَيْءٍ فَإِنَّمَا تُنْقِصُهُ مِنْ صَلَاتِكَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] Telah menceritakan kepada kami [Ibnu Ajlan] Telah menceritakan kepada kami [Ali bin Yahya bin Khallad] dari [bapaknya] dari [pamannya] dan ia telah menyaksikan perang Badar, ia berkata; Kami pernah bersama Rasulullah shallallahu 'alaihi wasallam berada di dalam Masjid. Kemudian masuklah seorang laki-laki dan sholat di samping Masjid. Maka Rasulullah shallallahu 'alaihi wasallam memandangnya sepintas. Kemudian laki-laki itu pun mendatangi beliau dan mengucapkan salam. beliau pun membalas salamnya dan bersabda: \"Kembali dan sholatlah, karena sesungguhnya kamu belum menunaikan sholat.\" Beliau mengulanginya sebanyak dua atau tiga kali. Maka laki-laki itu pun berkata pada kali yang ketiga atau yang keempat, \"Demi Dzat yang telah mengutusmu dengan membawa kebenaran, sungguh, saya telah berusaha sekuat kemampuan. Karena itu, ajari dan tunjukkanlah (sholat yang benar) padaku.\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Jika kamu hendak menunaikan sholat, maka berwudlu dan sempurnakanlah wudlumu. Kemudian kamu menghadap kiblat dan bertakbir lalu bacalah (sesuatu dari ayat Al Qur`an). Setelah itu, ruku'lah, sampai kamu tenang dalam posisi ruku'. Kemudian angkatlah kepalamu, hingga kamu tenang dalam posisi berdiri. Dan setelah itu, kamu sujud hingga tenang dalam posisi sujud, kemudian angkatlah kepalamu hingga kamu tenang dalam posisi duduk. Kemudian kamu sujud lagi, hingga tenang dalam posisi sujud, lalu berdirilah. Jika menyempurnakan sholatmu seperti ini, maka sungguh, kamu telah menyempurnakannya, dan jika kamu mengurangi sedikit darinya, maka sesungguhnya kamu hanya mengurangi sholatmu.\""
            },
            {
                "number": 2299,
                "arab": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا عِكْرِمَةُ يَعْنِي ابْنَ عَمَّارٍ قَالَ حَدَّثَنِي طَارِقُ بْنُ عَبْدِ الرَّحْمَنِ الْقُرَشِيُّ قَالَجَاءَ رَافِعُ بْنُ رِفَاعَةَ إِلَى مَجْلِسِ الْأَنْصَارِ فَقَالَ لَقَدْ نَهَانَا نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْيَوْمَ عَنْ شَيْءٍ كَانَ يَرْفُقُ بِنَا فِي مَعَايِشِنَا فَقَالَ نَهَانَا عَنْ كِرَاءِ الْأَرْضِ قَالَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ لِيُزْرِعْهَا أَخَاهُ أَوْ لِيَدَعْهَا وَنَهَانَا عَنْ كَسْبِ الْحَجَّامِ وَأَمَرَنَا أَنْ نُطْعِمَهُ نَوَاضِحَنَا وَنَهَانَا عَنْ كَسْبِ الْأَمَةِ إِلَّا مَا عَمِلَتْ بِيَدِهَا وَقَالَ هَكَذَا بِأَصَابِعِهِ نَحْوَ الْخَبْزِ وَالْغَزْلِ وَالنَّفْشِ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Qasyim] Telah menceritakan kepada kami [Ikrimah] yakni Ibnu Ammar, ia berkata, telah menceritakan kepadaku [Thariq bin Abdurrahman Al Qurasyi] ia berkata, [Rafi' bin Rifa'ah] mendatangi majelis orang-orang Anshar dan berkata; Pada hari ini, Nabi shallallahu 'alaihi wasallam telah melarang kita, dari sesuatu yang telah akrab dengan kehidupan kita. Ia pun melanjutkan berkata; Beliau melarang untuk menyewakan lahan, beliau bersabda: \"Barangsiapa yang memiliki lahan hendaklah ia menanaminya, atau ditanami oleh saudaranya.\" Kemudian beliau juga melarang untuk mencari penghidupan dari hasil bekam. Dan beliau memerintahkan untuk memberi makan Unta, dan melarang untuk mempekejakan budak wanita kecuali apa yang dikerjakannya dengan tangannya sendiri. Dan beliau bersabda -seperti ini, yakni beliau memberikan isyarat dengan jari tangannya menunjuk-: \" roti, tenun dan rumput.\""
            },
            {
                "number": 2300,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا شَيْبَانُ عَنْ زِيَادِ بْنِ عِلَاقَةَ عَنْ عَرْفَجَةَ بْنِ شُرَيْحٍ الْأَسْلَمِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهَا سَتَكُونُ بَعْدِي هَنَاتٌ وَهَنَاتٌ وَرَفَعَ يَدَيْهِ فَمَنْ رَأَيْتُمُوهُ يُفَرِّقُ بَيْنَ أُمَّةِ مُحَمَّدٍ وَهُمْ جَمِيعٌ فَاقْتُلُوهُ كَائِنًا مَنْ كَانَ مِنْ النَّاسِ",
                "id": "Telah menceritakan kepada kami [Abu An Nadlr] Telah menceritakan kepada kami [Syaiban] dari [Ziyad bin Ilaqah] dari [Arfajah bin Suraih Al Aslami] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya akan terjadi setelahku berbagai macam fitnah, -beliau sambil mengangkat kedua tangannya- maka barangsiapa yang kalian lihat memecahkan perkara umat ini, padahal mereka telah menyatakan ikrar kesepakatan, maka bunuhlah dia, siapa pun orangnya dari kalangan manusia.\""
            },
            {
                "number": 2301,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ زِيَادِ بْنِ عِلَاقَةَ قَالَ سَمِعْتُ عَرْفَجَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّهُ سَتَكُونُ هَنَاتٌ وَهَنَاتٌ فَمَنْ أَرَادَ أَنْ يُفَرِّقَ أَمْرَ هَذِهِ الْأُمَّةِ وَهِيَ جَمِيعٌ فَاضْرِبُوهُ بِالسَّيْفِ كَائِنًا مَنْ كَانَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Ziyad bin 'Iaaqah] ia berkata, saya mendengar ['Arfajah] ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya akan terjadi berbagai macam fitnah, maka barangsiapa yang ingin mencerai-beraikan perkara umat ini padahal mereka telah menyatakan ikrar kesepakatan, maka penggallah ia dengan pedang, siapa pun orangnya.\""
            },
            {
                "number": 2302,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ أَنَّ عَبَّادَ بْنَ تَمِيمٍ أَخْبَرَهُ عَنْ عُوَيْمِرِ بْنِ أَشْقَرَأَنَّهُ ذَبَحَ قَبْلَ أَنْ يَغْدُوَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَّهُ ذَكَرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَمَا فَرَغَ فَأَمَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَعُودَ لِأُضْحِيَّتِهِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Yahya] yakni Ibnu Sa'id bahwa [Abbad bin Tamim] telah mengabarkan kepadanya, dari [Uwaimir bin Asyqar] bahwa ia telah menyembelih sebelum keberangkatan Rasulullah shallallahu 'alaihi wasallam (untuk menunaikan sholat Idul adha). Setelah itu, ia pun menuturkan hal itu kepada Rasulullah shallallahu 'alaihi wasallam. Maka Rasulullah shallallahu 'alaihi wasallam pun memerintahkan untuk mengulangi penyembelihan hewan kurbannya."
            },
            {
                "number": 2303,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي جَعْفَرٍ الْخَطْمِيِّ عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ عَنْ كَثِيرِ بْنِ السَّائِبِ قَالَ حَدَّثَنِي ابْنَا قُرَيْظَةَأَنَّهُمْ عُرِضُوا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَمَنَ قُرَيْظَةَ فَمَنْ كَانَ مِنْهُمْ مُحْتَلِمًا أَوْ نَبَتَتْ عَانَتُهُ قُتِلَ وَمَنْ لَا تُرِكَ",
                "id": "Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Hammad bin Salamah] dari [Abu Ja'far Al Khathmi] dari [Muhammad bin Ka'ab Al Qurazhi] dari [Katsir bin Sa`ib] ia berkata, telah menceritakan kepadaku [Ibnu Quraizhah] bahwa mereka (yakni Bani Quraizhah) diringkus ke hadapan Nabi shallallahu 'alaihi wasallam pada peperangan Quraizhah. Siapa di antara mereka yang telah mencapai Ihtilam (mimpi basah), atau rambut kemaluannya telah tumbuh, maka ia dibunuh, sedangkan yang belum, maka akan dilepaskan."
            },
            {
                "number": 2304,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنِ الْحُصَيْنِ بْنِ مِحْصَنٍأَنَّ عَمَّةً لَهُ أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَاجَةٍ فَفَرَغَتْ مِنْ حَاجَتِهَا فَقَالَ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَذَاتُ زَوْجٍ أَنْتِ قَالَتْ نَعَمْ قَالَ كَيْفَ أَنْتِ لَهُ قَالَتْ مَا آلُوهُ إِلَّا مَا عَجَزْتُ عَنْهُ قَالَ فَانْظُرِي أَيْنَ أَنْتِ مِنْهُ فَإِنَّمَا هُوَ جَنَّتُكِ وَنَارُكِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] ia berkata, telah mengabarkan kepada kami [Yahya bin Sa'id] dari [Busyair bin Yasar] dari [Al Hushain bin Mihshan] bahwa bibinya pernah mendatangi Nabi shallallahu 'alaihi wasallam untuk suatu keperluan. Setelah urusannya selesai, Nabi shallallahu 'alaihi wasallam pun bertanya kepadanya: \"Apakah kamu mempunyai suami?\" ia menjawab, \"Ya.\" Beliau bertanya lagi: \"Bagaimanakah sikapmu terhadapnya?\" ia menjawab, \"Saya tidak pernah mengabaikannya, kecuali terhadap sesuatu yang memang aku tidak sanggup.\" Beliau bersabda: \"Camkanlah selalu, akan posisimu terhadapnya. Sesungguhnya yang menentukan surga dan nerakamu terdapat pada (sikapmu terhadap) suamimu.\""
            },
            {
                "number": 2305,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْعَبَّاسِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ قَالَ أَخْبَرَنِي رَجُلٌ يُقَالُ لَهُ رَبِيعَةُ بْنُ عَبَّادٍ مِنْ بَنِي الدِّيلِ وَكَانَ جَاهِلِيًّا قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْجَاهِلِيَّةِ فِي سُوقِ ذِي الْمَجَازِ وَهُوَ يَقُولُ يَا أَيُّهَا النَّاسُ قُولُوا لَا إِلَهَ إِلَّا اللَّهُ تُفْلِحُوا وَالنَّاسُ مُجْتَمِعُونَ عَلَيْهِ وَوَرَاءَهُ رَجُلٌ وَضِيءُ الْوَجْهِ أَحْوَلُ ذُو غَدِيرَتَيْنِ يَقُولُ إِنَّهُ صَابِئٌ كَاذِبٌ يَتْبَعُهُ حَيْثُ ذَهَبَ فَسَأَلْتُ عَنْهُ فَذَكَرُوا لِي نَسَبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالُوا لِي هَذَا عَمُّهُ أَبُو لَهَبٍحَدَّثَنَا سُرَيْجٌ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ رَبِيعَةَ بْنِ عَبَّادٍ الدُّؤَلِيِّ وَكَانَ جَاهِلِيًّا فَأَسْلَمَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ الْحَدِيثَ قَالَ فَقُلْتُ مَنْ هَذَا قَالَ هَذَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْمُطَّلِبِ وَهُوَ يَذْكُرُ النُّبُوَّةَ قُلْتُ مَنْ هَذَا الَّذِي يُكَذِّبُهُ قَالُوا هَذَا عَمُّهُ أَبُو لَهَبٍ قَالَ أَبُو الزِّنَادِ فَقُلْتُ لِرَبِيعَةَ بْنِ عَبَّادٍ إِنَّكَ يَوْمَئِذٍ كُنْتَ صَغِيرًا قَالَ لَا وَاللَّهِ إِنِّي يَوْمَئِذٍ لَأَعْقِلُ أَنِّي لَأَزْفِرُ الْقِرْبَةَ يَعْنِي أَحْمِلُهَا",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Abul Abbas] Telah menceritakan kepada kami [Abdurrahman bin Abuz Zinad] dari [bapaknya] ia berkata, telah mengabarkan kepadaku seorang laki-laki yang biasa dipanggil [Rabi'ah bin Abbad] dari Bani Ad Dil dan ia adalah seorang yang telah mengenyam masa jahiliyah, ia berkata; Saat masih Jahiliyah, saya pernah melihat Nabi shallallahu 'alaihi wasallam di pasar Dzul Majaz. Saat itu, beliau bersabda: \"Wahai sekalian manusian, ucapkanlah, 'LAA ILAAHA ILLALLAH, niscaya kalian akan selamat.\" Maka orang-orang pun mengerumuninya, sementara di belakangnya ada seorang laki-laki yang berwajah tampan, bermata juling dan rambut terjalin dua bagian, si laki-laki berkata, \"Dia adalah seorang yang murtad (keluar dari agama nenek moyangnya) dan pendusta.\" Laki-laki itu selalu mengikutinya kemana pun beliau pergi. Maka saya pun menanyakan siapa lelaki itu, mereka pun menurutkan nasab Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Laki-laki ini adalah pamannya, yakni Abu Lahab. Telah menceritakan kepada kami [Suraij] Telah menceritakan kepada kami [Ibnu Abu Zinad] dari [bapaknya] dari [Rabi'ah bin Abbad Ad Du`ali] ia adalah seorang yang mengenyam masa jahiliyah dan kemudian memeluk Islam. Ia berkata; Saya pernah melihat Rasulullah shallallahu 'alaihi wasallam, kemudian ia pun menyebutkan hadits. Rabi'ah berkata; Saya bertanya, \"Siapakah orang ini?\" ia menjawab, \"Ia adalah Muhammad bin Abdullah bin Abdul Muthalib.\" Ia pun menyebutkan tentang kenabian. Kemudian saya bertanya lagi, \"Siapakah orang yang selalu mendustakannya ini?\" mereka menjawab, \"Orang ini adalah pamannya, yakni Abu Lahab.\" Abu Zinad berkata; Saya berkata kepada Rabi'ah bin Abbad, \"Sesungguhnya pada hari itu kamu masih kecil.\" Ia menjawab, \"Tidak, demi Allah. Pada hari itu saya telah mencapai masa aqil baligh. Saya benar-benar telah mampu membawa Qirbah (kantong kulit untuk menyimpan air).\""
            },
            {
                "number": 2306,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا أَبُو الْأَشْهَبِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ طَرَفَةَأَنَّ جَدَّهُ عَرْفَجَةَ أُصِيبَ أَنْفُهُ يَوْمَ الْكُلَابِ فِي الْجَاهِلِيَّةِ فَاتَّخَذَ أَنْفًا مِنْ وَرِقٍ فَأَنْتَنَ عَلَيْهِ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَّخِذَ أَنْفًا مِنْ ذَهَبٍقَالَ يَزِيدُ فَقِيلَ لِأَبِي الْأَشْهَبِ أَدْرَكْتَ عَبْدَ الرَّحْمَنِ جَدَّهُ قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Abu Asyhab] dari [Abdurrahman bin Tharafah] bahwa [kakeknya, Arfajah], hidungnya terlepas pada masa jahiliyah pada peristiwa kulab, maka ia pun memasang hidung yang terbuat dari Waraq (sejenis mata uang logam dirham), dan akhirnya hidungnya itu membusuk. Maka Nabi shallallahu 'alaihi wasallam menyuruhnya untuk memasang hidung dari emas. Yazid berkata; Dan telah ditanyakan kepada Abu Al Asyhab, \"Apakah kamu mendapati kakeknya, Abdurrahman?\" ia menjawab, \"Ya.\" "
            },
            {
                "number": 2307,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مُعَاوِيَةَ يَعْنِي ابْنَ صَالِحٍ عَنِ الْعَلَاءِ يَعْنِي ابْنَ الْحَارِثِ عَنْ حَرَامِ بْنِ حَكِيمٍ عَنْ عَمِّهِ عَبْدِ اللَّهِ بْنِ سَعْدٍ أَنَّهُسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَمَّا يُوجِبُ الْغُسْلَ وَعَنْ الْمَاءِ يَكُونُ بَعْدَ الْمَاءِ وَعَنْ الصَّلَاةِ فِي بَيْتِي وَعَنْ الصَّلَاةِ فِي الْمَسْجِدِ وَعَنْ مُؤَاكَلَةِ الْحَائِضِ فَقَالَ إِنَّ اللَّهَ لَا يَسْتَحْيِي مِنْ الْحَقِّ وَأَمَّا أَنَا فَإِذَا فَعَلْتُ كَذَا وَكَذَا فَذَكَرَ الْغُسْلَ قَالَ أَتَوَضَّأُ وُضُوئِي لِلصَّلَاةِ أَغْسِلُ فَرْجِي ثُمَّ ذَكَرَ الْغُسْلَ وَأَمَّا الْمَاءُ يَكُونُ بَعْدَ الْمَاءِ فَذَلِكَ الْمَذْيُ وَكُلُّ فَحْلٍ يُمْذِي فَأَغْسِلُ مِنْ ذَلِكَ فَرْجِي وَأَتَوَضَّأُ وَأَمَّا الصَّلَاةُ فِي الْمَسْجِدِ وَالصَّلَاةُ فِي بَيْتِي فَقَدْ تَرَى مَا أَقْرَبَ بَيْتِي مِنْ الْمَسْجِدِ وَلَأَنْ أُصَلِّيَ فِي بَيْتِي أَحَبُّ إِلَيَّ مِنْ أَنْ أُصَلِّيَ فِي الْمَسْجِدِ إِلَّا أَنْ تَكُونَ صَلَاةً مَكْتُوبَةً وَأَمَّا مُؤَاكَلَةُ الْحَائِضِ فَآكِلْهَا",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Mu'awiyah] yakni Ibnu Shalih, dari [Al Ala`] yakni Ibnul Harits, dari [Haram bin Hakim] dari [pamannya, Abdullah bin Sa'd] bahwa ia pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hal apa saja yang mewajibkan seseorang mandi. Kemudian tentang air yang keluar setelah keluarnya air mani, tentang sholat di rumahku, sholat di Masjid, dan tentang makan bersama wanita yang sedang haid. Maka beliau menjawab, \"Sesungguhnya Allah tidak malu terhadap kebenaran. Adapun saya, jika melakukan ini dan itu, -beliau pun menyebutkan tentang mandi dan bersabda- saya berwudlu sebagaimana wudlu untuk sholat, kemudian saya mencucui kemaluanku -kemudian beliau menyebut tentang mandi-. Adapun air yang keluar setelah keluarnya mani, maka itu adalah Madzi, setiap laki-laki akan mengeluarkan madzi, karena itu, saya pun mencuci kemaluanku darinya, baru kemudian saya sholat. mengenai sholat di Masjid dan sholat di rumahku, maka kamu telah melihat betapa dekatnya rumahku dari Masjid, maka sholat di rumahku lebih aku sukai daripada sholat di rumah, kecuali sholat wajib. Kemudian mengenai makan bersama orang yang haid, maka makanlah bersamanya.\""
            },
            {
                "number": 2308,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ عَنِ الْعَلَاءِ بْنِ الْحَارِثِ عَنْ حَرَامِ بْنِ حَكِيمٍ عَنْ عَمِّهِ عَبْدِ اللَّهِ بْنِ سَعْدٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ مُؤَاكَلَةِ الْحَائِضِ فَقَالَ وَاكِلْهَا",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] Telah menceritakan kepada kami [Mu'awiyah bin Shalih] dari [Al 'Ala` bin Harits] dari [Haram bin Hakim] dari [pamannya yakni Abdullah bin Sa'd] ia berkata; Saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai makan bersama dengan wanita yang sedang haid, maka beliau pun menjawab: \"Makanlah bersamanya.\""
            },
            {
                "number": 2309,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا بَكْرُ بْنُ سَوَادَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَسْلَمَ مَوْلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ لِجَعْفَرِ بْنِ أَبِي طَالِبٍ أَشْبَهْتَ خَلْقِي وَخُلُقِي",
                "id": "Telah menceritakan kepada kami [Hasan bin Musa] Telah menceritakan kepada kami [Ibnu Lahi'ah] Telah menceritakan kepada kami [Bakr bin Sawadah] dari [ubaidhullah bin Aslam] bekas budak Nabi shallallahu 'alaihi wasallam, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepada Ja'far bin Abu Thalib: \"Kamu menyerupai wajahku dan juga akhlakku.\""
            },
            {
                "number": 2310,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي مَسْعُودٍ يَعْنِي الْجُرَيْرِيَّ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ مَاعِزٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ سُئِلَ أَيُّ الْأَعْمَالِ أَفْضَلُ قَالَ إِيمَانٌ بِاللَّهِ وَحْدَهُ ثُمَّ الْجِهَادُ ثُمَّ حَجَّةٌ بَرَّةٌ تَفْضُلُ سَائِرَ الْعَمَلِ كَمَا بَيْنَ مَطْلَعِ الشَّمْسِ إِلَى مَغْرِبِهَاحَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ عَنِ الْجُرَيْرِيِّ عَنْ حَيَّانَ بْنِ عُمَيْرٍ حَدَّثَنَا مَاعِزٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ أَيُّ الْأَعْمَالِ أَفْضَلُ فَذَكَرَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Abu Mas'ud] yakni Al Jurairi dari [Yazid bin Abdullah Asy Syikhkhir] dari [Ma'iz] dari Nabi shallallahu 'alaihi wasallam bahwa beliau pernah ditanya mengenai amalan apakah yang paling utama. Beliau menjawa: \"Yaitu, beriman kepada Allah, jihad di jalan Allah, dan Haji yang mabrur melebihi seluruh amal baik, sebagaimana jarak antara tempat terbitnya matahari hingga tempat terbenamnya.\" Telah menceritakan kepada kami [Hudbah bin Khalid] Telah menceritakan kepada kami [Wuhaib bin Khalid] dari [Al Jurairi] dari [Hayyan bin Umair] Telah menceritakan kepada kami [Ma'iz] bahwa Nabi shallallahu 'alaihi wasallam pernah ditanya mengenai amalan yang paling utama. Maka ia pun menyebutkan hadits yang sama."
            },
            {
                "number": 2311,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا عَبَّادُ بْنُ رَاشِدٍ قَالَ سَمِعْتُ الْحَسَنَ يَقُولُ ثَنَا أَحْمَرُ بْنُ جَزِيٍّ صَاحِبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَإِنْ كُنَّا لَنَأْوِي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا يُجَافِي مِرْفَقَيْهِ عَنْ جَنْبَيْهِ إِذَا سَجَدَ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] Telah menceritakan kepada kami [Abbad bin Rasyid] ia berkata, saya mendengar [Al Hasan] berkata, Telah menceritakan kepada kami [Ahmar bin Jazi'] salah seorang dari sahabat Rasulullah shallallahu 'alaihi wasallam, ia berkata; Kami benar-benar bernaung kepada Rasulullah shallallahu 'alaihi wasallam, saat beliau merenggangkan kedua sikunya dari pinggangnya ketika beliau sujud."
            },
            {
                "number": 2312,
                "arab": "حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ حَدَّثَنَا كَثِيرُ بْنُ زَيْدٍ عَنِ الْمُطَّلِبِ بْنِ عَبْدِ اللَّهِ عَنْ عِتْبَانَ أَوْ ابْنِ عُتْبَانَ الْأَنْصَارِيِّ قَالَقُلْتُ أَيْ نَبِيَّ اللَّهِ إِنِّي كُنْتُ مَعَ أَهْلِي فَلَمَّا سَمِعْتُ صَوْتَكَ أَقْلَعْتُ فَاغْتَسَلْتُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَاءُ مِنْ الْمَاءِ",
                "id": "Telah menceritakan kepada kami [Abu Ahmad Az Zubairi] Telah menceritakan kepada kami [Katsir bin Zaid] dari [Al Muthallib bn Abdullah] dari ['Ityan atau Ibnu Utban Al Anshari], ia berkata, \"Wahai Nabiyullah, saya pernah bergaul dengan isteriku, dan ketika saya mendengar suaramu, saya pun melepaskannya dan mandi.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Keharusan mandi, adalah ketika keluarnya mani.\""
            },
            {
                "number": 2313,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ قَالَ قَالَ أَبُو عَبْد الرَّحْمَنِ وَسَمِعْتُهُ أَنَا مِنْ هَارُونَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي حُرَّةَ عَنْ عَمِّهِ حَكِيمِ بْنِ أَبِي حُرَّةَ عَنْ سِنَانِ بْنِ سَنَّةَ صَاحِبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الطَّاعِمُ الشَّاكِرُ لَهُ مِثْلُ أَجْرِ الصَّائِمِ الصَّابِرِحَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَاه أَحْمَدُ بْنُ حَاتِمٍ الطَّوِيلُ حَدَّثَنَا عَبْدُ الْعَزِيزِ الدَّرَاوَرْدِيُّ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Harun bin Ma'ruf] ia berkata, -telah berkata Abu Abdurrahman dan saya mendengarnya dari Harun- Telah menceritakan kepada kami [Abdul Aziz bin Muhammad] ia berkata, telah mengabarkan kepadaku [Muhammd bin Abdullah bin Abu Hurrah] dari [pamannya, Hakim bin Abu Hurrah], dari [Sinan bin Abu Sannah] salah seorang sahabat Nabi shallallahu 'alaihi wasallam, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang yang memberi makan lagi bersyukur, maka baginya seperti pahala seorang yang berpuasa lagi sabar.\" Telah menceritakan kepada kami Abdullah Telah menceritakannya kepada kami [Ahmad bin Hatim Ath Thawil] Telah menceritakan kepada kami [Abdul Aziz Ad Darawardi] hadits semisalnya."
            },
            {
                "number": 2314,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ حَرْمَلَةَ عَنْ يَحْيَى بْنِ هِنْدٍ أَنَّهُ سَمِعَ حَرْمَلَةَ بْنَ عَمْرٍو وَهُوَ أَبُو عَبْدِ الرَّحْمَنِ قَالَحَجَجْتُ حَجَّةَ الْوَدَاعِ مُرْدِفِي عَمِّي سِنَانُ بْنُ سَنَّةَ قَالَ فَلَمَّا وَقَفْنَا بِعَرَفَاتٍ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاضِعًا إِحْدَى أُصْبُعَيْهِ عَلَى الْأُخْرَى فَقُلْتُ لِعَمِّي مَاذَا يَقُولُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَقُولُ ارْمُوا الْجَمْرَةَ بِمِثْلِ حَصَى الْخَذْفِ",
                "id": "Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Wuhaib] Telah menceritakan kepada kami [Abdurrahman bin Harmalah] dari [Yahya bin Hind] bahwa ia telah mendengar [Harmalah bin Amru] ia adalah Abu Abdurrahman, ia berkata; Saya ikut serta dalam haji wada' dengan membonceng di belakang pamanku, Sinan bin Sannah. Ketika kami melakukan wukuf di Arafah, saya melihat Rasulullah shallallahu 'alaihi wasallam salah satu dari dua jarinya di atas jari yang lain. Kemudian saya pun bertanya kepada pamanku, \"Apa yang dikatakan oleh Rasulullah shallallahu 'alaihi wasallam?\" ia menjawab; Beliau bersabda: \"Lemparilah jumrah dengan menggunakan batu kerikil.\""
            },
            {
                "number": 2315,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ عَنْ عَمِّهِ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ أَنَّ شَبْلَ بْنَ حَامِدٍ الْمُزَنِيَّ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَالِكٍ الْأَوْسِيَّ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْوَلِيدَةِ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَبِيعُوهَا وَلَوْ بِضَفِيرٍ وَالضَّفِيرُ الْحَبْلُ فِي الثَّالِثَةِ أَوْ فِي الرَّابِعَةِ",
                "id": "Telah menceritakan kepada kami [Ya'qub] Telah menceritakan kepada kami [Ibnu Akhi Ibnu Syihab] dari [pamannya] ia berkata, telah mengabarkan kepadaku [ubaidhullah bin Abdullah bin Utbah bin Mas'ud] bahwa [Syabl bin Hamid Al Muzani] telah mengabarkan kepadanya, bahwa [Abdullah bin Malik Al Ausi] telah mengabarkan kepadanya, bawha Rasulullah shallallahu 'alaihi wasallam bersabda kepada Al Walidah: \"Jika ia berzina, maka deralah ia. Kemudian jika ia berzina lagi, maka deralah ia. Jika ia berzina lagi, maka deralah ia. Dan jika ia berzina lagi, maka jualah ia, meskipun hanya seharga Ash Shafir.\" Ash Shafir adalah tali. Yakni beliau mengatakannya pada kali yang ketiga atau yang keempat."
            },
            {
                "number": 2316,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ رَبِّهِ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ حَدَّثَنِي الزُّبَيْدِيُّ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ أَنَّ شِبْلَ بْنَ خُلَيْدٍ الْمُزَنِيَّ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ مَالِكٍ الْأَوْسِيَّ أَخْبَرَهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْوَلِيدَةِ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَبِيعُوهَا وَلَوْ بِضَفِيرٍ وَالضَّفِيرُ الْحَبْلُ",
                "id": "Telah menceritakan kepada kami [Yazid bin Abdu Rabbih] Telah menceritakan kepada kami [Baqiyyah bin Al Walid] telah menceritakan kepadaku [Az Zubaidi] dari [Az Zuhri] dari [ubaidhullah bin Abdullah] bahwa [Syibl bin Khulaid Al Muzani] telah mengabarkan kepadanya, bahwa [Abdullah bin Malik Al Ausi] telah mengabarkan kepadanya, bahwa Nabi shallallahu 'alaihi wasallam bersabda kepada Al Walidah: \"Jika ia berzina, maka deralah ia. Kemudian jika ia berzina lagi, maka deralah ia. Jika ia berzina lagi, maka deralah ia. Dan jika ia berzina lagi, maka jualah ia, meskipun hanya seharga Ash Shafir.\" Ash Shafir adalah tali."
            },
            {
                "number": 2317,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا زَكَرِيَّا عَنِ الشَّعْبِيِّ عَنِ الْحَارِثِ بْنِ مَالِكٍ ابْنِ بَرْصَاءَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُغْزَى مَكَّةُ بَعْدَهَا أَبَدًاقَالَ سُفْيَانُ الْحَارِثُ خُزَاعِيٌّ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] Telah menceritakan kepada kami [Zakariya] dari [Asy Sya'bi] dari [Harits bin Malik bin Barsha`] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Kota Makkah tidak akan diperangi setelah pembebasannya, selama-lamanya.\" Sufyan berkata; Al Harits adalah Khuza'i."
            },
            {
                "number": 2318,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا زَكَرِيَّا عَنْ عَامِرٍ عَنِ الْحَارِثِ بْنِ مَالِكٍ ابْنِ بَرْصَاءَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَوْمَ فَتْحِ مَكَّةَ لَا تُغْزَى هَذِهِ بَعْدَهَا أَبَدًا إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] ia berkata, telah mengabarkan kepada kami [Zakariya] dari [Amir] dari [Al Harits bin Malik bin Barsha`] ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda pada hari penaklukan kota Makkah: \"Kota ini tidak akan diperangi setelah fathu Makkah selama-lamanya hingga datangnya hari kiamat.\""
            },
            {
                "number": 2319,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الطَّائِفِيُّ عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ أَوْسٍ الثَّقَفِيِّ عَنْ جَدِّهِ أَوْسِ بْنِ حُذَيْفَةَ قَالَكُنْتُ فِي الْوَفْدِ الَّذِينَ أَتَوْا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْلَمُوا مِنْ ثَقِيفٍ مِنْ بَنِي مَالِكٍ أَنْزَلَنَا فِي قُبَّةٍ لَهُ فَكَانَ يَخْتَلِفُ إِلَيْنَا بَيْنَ بُيُوتِهِ وَبَيْنَ الْمَسْجِدِ فَإِذَا صَلَّى الْعِشَاءَ الْآخِرَةَ انْصَرَفَ إِلَيْنَا فَلَا يَبْرَحُ يُحَدِّثُنَا وَيَشْتَكِي قُرَيْشًا وَيَشْتَكِي أَهْلَ مَكَّةَ ثُمَّ يَقُولُ لَا سَوَاءَ كُنَّا بِمَكَّةَ مُسْتَذَلِّينَ أَوْ مُسْتَضْعَفِينَ فَلَمَّا خَرَجْنَا إِلَى الْمَدِينَةِ كَانَتْ سِجَالُ الْحَرْبِ عَلَيْنَا وَلَنَا فَمَكَثَ عَنَّا لَيْلَةً لَمْ يَأْتِنَا حَتَّى طَالَ ذَلِكَ عَلَيْنَا بَعْدَ الْعِشَاءِ قَالَ قُلْنَا مَا أَمْكَثَكَ عَنَّا يَا رَسُولَ اللَّهِ قَالَ طَرَأَ عَنِّي حِزْبٌ مِنْ الْقُرْآنِ فَأَرَدْتُ أَنْ لَا أَخْرُجَ حَتَّى أَقْضِيَهُ فَسَأَلْنَا أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ أَصْبَحْنَا قَالَ قُلْنَا كَيْفَ تُحَزِّبُونَ الْقُرْآنَ قَالُوا نُحَزِّبُهُ سِتَّ سُوَرٍ وَخَمْسَ سُوَرٍ وَسَبْعَ سُوَرٍ وَتِسْعَ سُوَرٍ وَإِحْدَى عَشْرَةَ سُورَةً وَثَلَاثَ عَشْرَةَ سُورَةً وَحِزْبُ الْمُفَصَّلِ مِنْ ق حَتَّى تَخْتِمَ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] Telah menceritakan kepada kami [Abdullah bin Abdurrahman Ath Thaifi] dari [Utsman bin Abdullah bin Aus Ats Tsaqafi] dari [kakeknya yakni Aus bin Hudzaifah], ia berkata; Saya berada dalam suatu utusan yang menemui Rasulullah shallallahu 'alaihi wasallam dan menyatakan masuk Islam. Mereka adalah Bani Tsaqif dari Bani Malik. Kami singgah di sebuah kemah milik beliau. Beliau seringkali mendatangi kami yang berada antara rumah beliau dan masjid. Jika beliau selesai sholat isyak (yaitu sholat fardhu terakhir), beliau sering menemui kami, mengajak kami berbincang-bincang dan mengeluhkan quraisy dan juga penduduk Makkah. Kemudian beliau bersabda \"Terus terang tidak sama nasib kita, kita di Makkah dalam keadaan terintimidasi, atau tertindas, ada pun setelah kita mengungsi ke Madinah, keadaan peperangan silih berganti. Terkadang kita yang kalah, dan tak jarang terkadang kita yang menang. Suatu malam beliau tidak menemui sekian lama sehabis isyak. Kata Aus, kami mencoba bertanya \"Wahai rasulullah, apa yang menghalangimu tidak menemui kami? Beliau menjawab \" Maaf, pengelompokan alquran harus kukerjakan, sehingga aku tak bisa pergi hingga aku menyelesaikannya. Pagi harinya kami bertanya sahabat-sahabat Rasulullah, bagaimana kalian mengelompokkan alquran? Mereka jawab \"Kami mengelompokkannya enam surat, lima surat, tujuh surat, Sembilan surat, sebelas surat, tiga belas surat, dan satu hizib (kelompok) yang berisi surat-surat pendek, semenjak surat Qaf hingga khatam."
            },
            {
                "number": 2320,
                "arab": "قَالَ قَرَأْتُ عَلَى عَبْدِ الرَّحْمَنِ بْنِ مَهْدِيٍّ : مَالِكٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ أَبِي حَازِمٍ التَّمَّارِّ عَنِ الْبَيَاضِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ عَلَى النَّاسِ وَهُمْ يُصَلُّونَ وَقَدْ عَلَتْ أَصْوَاتُهُمْ بِالْقِرَاءَةِ فَقَالَ إِنَّ الْمُصَلِّي يُنَاجِي رَبَّهُ عَزَّ وَجَلَّ فَلْيَنْظُرْ مَا يُنَاجِيهِ وَلَا يَجْهَرْ بَعْضُكُمْ عَلَى بَعْضٍ بِالْقُرْآنِ",
                "id": "(Imam Ahmad) Berkata; Saya telah membacakan kepada [Abdurrahman bin Mahdi]: [Malik] dari [Yahya bin Sa'id] dari [Muhammad bin Ibrahim At Taimi] dari [Abu Hazim At Tammari] dari [Al Bayadli] bahwa Rasulullah shallallahu 'alaihi wasallam keluar menemui para sahabatnya, dan saat itu, mereka sedang menunaikan sholat, sedangkan suara bacaan mereka saling meraung satu sama lain. Maka beliau pun bersabda: \"Seorang yang menunaikan sholat, pada hakekatnya sedang bermunajat kepada Rabb-nya 'azza wajalla. Karena itu, hendaknya setiap orang mencermati doa yang dibacanya, dan janganlah salah seorang di antara kalian mengeraskan bacaan terhadap saudaranya yang lain.\""
            },
            {
                "number": 2321,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ وُهَيْبٍ عَنْ أَبِي وَاقِدٍ اللَّيْثِيِّ حَدَّثَنِي أَبُو أَرْوَى قَالَكُنْتُ أُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَصْرَ ثُمَّ آتِي الشَّجَرَةَ قَبْلَ غُرُوبِ الشَّمْسِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Wuhaib] dari [Abu Waqid Al Laitsi] telah menceritakan kepadaku [Abu Arwa] ia berkata; Saya pernah sholat Ashar bersama Nabi shallallahu 'alaihi wasallam, kemudian mendatangi pohon sebelum terbenamnya matahari."
            },
            {
                "number": 2322,
                "arab": "حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ حَدَّثَنَا هُشَيْمٌ قَالَ أَخْبَرَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ قَالَ حَدَّثَنِي أَبُو حَرْبِ بْنُ أَبِي الْأَسْوَدِ عَنْ فَضَالَةَ اللَّيْثِيِّ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْلَمْتُ وَعَلَّمَنِي حَتَّى عَلَّمَنِي الصَّلَوَاتِ الْخَمْسَ لِمَوَاقِيتِهِنَّ قَالَ فَقُلْتُ لَهُ إِنَّ هَذِهِ لَسَاعَاتٌ أُشْغَلُ فِيهَا فَمُرْنِي بِجَوَامِعَ فَقَالَ لِي إِنْ شُغِلْتَ فَلَا تُشْغَلْ عَنْ الْعَصْرَيْنِ قُلْتُ وَمَا الْعَصْرَانِ قَالَ صَلَاةُ الْغَدَاةِ وَصَلَاةُ الْعَصْرِ",
                "id": "Telah menceritakan kepada kami [Suraij bin Nu'man] Telah menceritakan kepada kami [Husyaim] ia berkata, telah mengabarkan kepada kami [Dawud bin Abu Hind] ia berkata, telah menceritakan kepadaku [Abu Harb bin Abul Aswad] dari [Fadlalah Al Laitsi] ia berkata; Saya mendatangi Nabi shallallahu 'alaihi wasallam dan akhirnya memeluk Islam. Kemudian beliau pun mengajariku sehingga beliau mengajarkanku sholat lima waktu beserta waktu-waktunya. Maka saya pun berkata kepada beliau, \"Sesungguhnya waktu-waktu ini merupakan saat-saat sibuk. Karena itu, perintahkanlah kepadaku sesuatu yang (nilainya) menyeluruh.\" Maka beliau pun bersabda kepadaku: \"Jika kamu benar-benar sibuk, maka jangan sampai kamu tersibukkan dari dua waktu.\" Saya bertanya, \"Apakah kedua waktu itu?\" beliau menjawab: \"Yaitu, sholat subuh dan sholat Ashar.\""
            },
            {
                "number": 2323,
                "arab": "قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ عَلِيُّ بْنُ زَيْدٍ أَخْبَرَنَا عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ مَالِكِ بْنِ الْحَارِثِ رَجُلٍ مِنْهُمْ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ ضَمَّ يَتِيمًا بَيْنَ أَبَوَيْنِ مُسْلِمَيْنِ إِلَى طَعَامِهِ وَشَرَابِهِ حَتَّى يَسْتَغْنِيَ عَنْهُ وَجَبَتْ لَهُ الْجَنَّةُ الْبَتَّةَ وَمَنْ أَعْتَقَ امْرَأً مُسْلِمًا كَانَ فَكَاكَهُ مِنْ النَّارِ يُجْزِي بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنْهُ مِنْ النَّارِ",
                "id": "Telah menceritakan kepada kami [Husyaim] ia berkata, [Ali bin Zaid] telah mengabarkan kepada kami dari [Zurarah bin Aufa] dari [Malik bin Harits] yakni seorang laki-laki dari mereka, bahwa ia mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang menyerahkan seorang anak yatim pada dua orang tua muslim dengan memenuhi kebutuhan makan dan minumnya hingga anak itu ter cukupi, maka wajib baginya surga. Dan barangsiapa yang memerdekakan satu orang budak muslim, maka budak itu akan menjadi tebusannya dari api neraka. Setiap anggota badan budak itu, akan menjadi tebusan untuk setiap anggota tubuhnya.\""
            },
            {
                "number": 2324,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ عَلِيِّ بْنِ زَيْدِ بْنِ جُدْعَانَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ عَمْرِو بْنِ مَالِكٍ أَوْ مَالِكِ بْنِ عَمْرٍو كَذَا قَالَ سُفْيَانُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ضَمَّ يَتِيمًا بَيْنَ أَبَوَيْهِ فَلَهُ الْجَنَّةُ الْبَتَّةَ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Sufyan] dari [Ali bin Zaid bin Jud'an] dari [Zurarah bin Aufa] dari [Amru bin Malik] -atau Malik bin Amr, seperti inilah yang dikatakan oleh Sufyan- ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang menyerahkan seorang anak yatim pada dua orang tua muslim dengan memenuhi kebutuhan makan dan minumnya hingga anak itu ter cukupi, maka wajib baginya surga.\""
            },
            {
                "number": 2325,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ أُبَيِّ بْنِ مَالِكٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ أَدْرَكَ وَالِدَيْهِ أَوْ أَحَدَهُمَا ثُمَّ دَخَلَ النَّارَ مِنْ بَعْدِ ذَلِكَ فَأَبْعَدَهُ اللَّهُ وَأَسْحَقَهُحَدَّثَنَا حَجَّاجٌ حَدَّثَنِي شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ زُرَارَةَ بْنَ أَوْفَى يُحَدِّثُ عَنْ أُبَيِّ بْنِ مَالِكٍ عَنْ النَّبِيِّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] ia berkata, saya mendengar [Qatadah] menceritakan dari [Zurarah bin Aufa] dari [Ubay bin Malik] dari Nabi shallallahu 'alaihi wasallam, bahwasanya beliau bersabda: \"Barangsiapa yang mendapati kedua orang tuanya, atau salah satu dari keduanya, kemudian setelah itu ia masuk neraka, maka Allah akan menjaukannya (dari rahmat-Nya) dan membinasakannya.\" Telah menceritakan kepada kami [Hajjaj] telah menceritakan kepadaku [Syu'bah] dari [Qatadah] ia berkata, saya mendengar [Zurarah bin Aufa] menceritakan dari [Ubay bin Malik] dari Nabi shallallahu 'alaihi wasallam."
            },
            {
                "number": 2326,
                "arab": "قَالَ و حَدَّثَنِي بَهْزٌ قَالَ ثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ رَجُلٍ مِنْ قَوْمِهِ يُقَالُ لَهُ أُبَيُّ بْنُ مَالِكٍ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَدْرَكَ وَالِدَيْهِ أَوْ أَحَدَهُمَا فَدَخَلَ النَّارَ فَأَبْعَدَهُ اللَّهُ",
                "id": "(Imam Ahmad) Berkata; Dan telah menceritakan kepadaku [Bahz] ia berkata, Telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Zurarah bin Aufa] dari seorang laki-laki yang berasal dari kaumnya dan biasa dipanggil [Ubay bin Malik], bahwa ia pernah mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang mendapati kedua orangtuanya, atau salah satu dari keduanya, kemudian ia masuk neraka, maka Allah menjauhkannya (dari rahmat-Nya).\""
            },
            {
                "number": 2327,
                "arab": "حَدَّثَنَا بَهْزٌ وَعَفَّانُ قَالَا ثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ عَفَّانُ فِي حَدِيثِهِ أَخْبَرَنَا عَلِيُّ بْنُ زَيْدٍ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ مَالِكِ بْنِ عَمْرٍو الْقُشَيْرِيِّ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَعْتَقَ رَقَبَةً مُسْلِمَةً فَهِيَ فِدَاؤُهُ مِنْ النَّارِ قَالَ عَفَّانُ مَكَانَ كُلِّ عَظْمٍ مِنْ عِظَامِ مُحَرِّرِهِ بِعَظْمٍ مِنْ عِظَامِهِ وَمَنْ أَدْرَكَ أَحَدَ وَالِدَيْهِ ثُمَّ لَمْ يُغْفَرْ لَهُ فَأَبْعَدَهُ اللَّهُ وَمَنْ ضَمَّ يَتِيمًا مِنْ بَيْنِ أَبَوَيْنِ مُسْلِمَيْنِ قَالَ عَفَّانُ إِلَى طَعَامِهِ وَشَرَابِهِ حَتَّى يُغْنِيَهُ اللَّهُ وَجَبَتْ لَهُ الْجَنَّةُ",
                "id": "Telah menceritakan kepada kami [Bahz] dan ['Affan] keduanya berkata, Telah menceritakan kepada kami [Hammad bin Salamah] -dalam riwayat lain 'Affan berkata dalam haditsnya- telah mengabarkan kepada kami [Ali bin Zaid] dari [Zurarah bin Aufa] dari [Malik bin Amru Al Qusyairi] ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang memerdekakan seorang budak wanita muslimah, maka wanita itu akan menjadi tebusan baginya dari neraka.\" Affan berkata, \"Yakni setiap anggota tubuh wanita itu akan menjadi tebusan bagi setiap anggota tubuhnya (dari neraka). Dan barangsiapa yang mendapati salah seorang dari kedua orang tuanya, kemudian ia tidak ampuni dosanya, maka Allah telah menjauhkannya (dari rahmat-Nya). Barangsiapa yang menyerahkan seorang anak yatim pada dua orang tua muslim -Affan berkata- dengan memenuhi kebutuhan makan dan minumnya hingga anak itu ter cukupi, maka wajib baginya surga.\""
            },
            {
                "number": 2328,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يُونُسُ بْنُ عُبَيْدٍ عَنْ حُصَيْنِ بْنِ أَبِي الْحُرِّ عَنِ الْخَشْخَاشِ الْعَنْبَرِيِّ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعِي ابْنٌ لِي قَالَ فَقَالَ ابْنُكَ هَذَا قَالَ قُلْتُ نَعَمْ قَالَ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِقَالَ هُشَيْمٌ مَرَّةً يُونُسُ قَالَ أَخْبَرَنِي مُخْبِرٌ عَنْ حُصَيْنِ بْنِ أَبِي الْحُرِّ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Yunus bin Ubaid] dari [Hushain bin Abu Al Hurr] dari [Al Khasykhasy Al 'Anbari] ia berkata; Saya bersama anakku menemui Rasulullah shallallahu 'alaihi wasallam. kemudian beliau bertanya: \"Apakah ini anakmu?\" saya menjawab, \"Ya.\" Beliau bersabda: \"Janganlah ia berbuat lalim atasmu, dan jangan pula kamu berbuat lalim atasnya.\" Sekali waktu, Husyaim berkata; Yunus telah mengabarkan kepadaku seorang penyampai berita dari Hushain bin Abul Hurr."
            },
            {
                "number": 2329,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ سَعِيدٍ حَدَّثَنَا مُحَمَّدُ بْنُ مُهَاجِرٍ يَعْنِي أَخَا عَمْرِو بْنِ مُهَاجِرٍ قَالَ حَدَّثَنِي عَقِيلُ بْنُ شَبِيبٍ عَنْ أَبِي وَهْبٍ الْجُشَمِيِّ وَكَانَتْ لَهُ صُحْبَةٌ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسَمَّوْا بِأَسْمَاءِ الْأَنْبِيَاءِ وَأَحَبُّ الْأَسْمَاءِ إِلَى اللَّهِ عَزَّ وَجَلَّ عَبْدُ اللَّهِ وَعَبْدُ الرَّحْمَنِ وَأَصْدَقُهَا حَارِثٌ وَهَمَّامٌ وَأَقْبَحُهَا حَرْبٌ وَمُرَّةُ وَارْتَبِطُوا الْخَيْلَ وَامْسَحُوا بِنَوَاصِيهَا وَأَعْجَازِهَا أَوْ قَالَ وَأَكْفَالِهَا وَقَلِّدُوهَا وَلَا تُقَلِّدُوهَا الْأَوْتَارَ وَعَلَيْكُمْ بِكُلِّ كُمَيْتٍ أَغَرَّ مُحَجَّلٍ أَوْ أَشْقَرَ أَغَرَّ مُحَجَّلٍ أَوْ أَدْهَمَ أَغَرَّ مُحَجَّلٍحَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُهَاجَرِ حَدَّثَنَا عَقِيلُ بْنُ شَبِيبٍ عَنْ أَبِي وَهْبٍ الْكَلَاعِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مَعْنَاهُ قَالَ مُحَمَّدٌ وَلَا أَدْرِي بِالْكُمَيْتِ بَدَأَ أَوْ بِالْأَدْهَمِ قَالَ وَسَأَلُوهُ لِمَ فَضَّلَ الْأَشْقَرَ قَالَ لِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ سَرِيَّةً فَكَانَ أَوَّلَ مَنْ جَاءَ بِالْفَتْحِ صَاحِبُ الْأَشْقَرِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Sa'id] Telah menceritakan kepada kami [Muhammad bin Muhajir] yakni saudaranya Amru bin Muhajir, ia berkata, telah menceritakan kepadaku ['Aqil bin Syabib] dari [Abu Wahb Al Jusyami] dan ia termasuk salah seorang dari sahabat Rasulullah shallallahu 'alaihi wasallam, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian memberi nama dengan nama-nama para Nabi. Nama yang paling disukai Allah 'azza wajalla adalah Abdullah dan Abdurrahman. Kemudian nama yang paling benar adalah Harits dan Hammam. Sedangkan nama yang paling buruk adalah Harb dan Murrah. Persiapkanlah kuda, sisirlah rambut yang tumbuh pada bagian kening dan juga ekornya. -atau beliau mengatakan- (dan juga) pahanya. Dan pasanglah kalung pada lehernya, dan janganlah kalian memasangkannya kalung Al Autar (sejenis kalung untuk menangkal hasad). Kemudian, hendaklah kalian memilih kuda yang berwrana antara putih dan kemerah-merahan, berbelang putih di wajah dan kaki-kakinya. Atau yang rambutnya berwarna blonde dan berbelan putih di wajah serta kaki-kakinya. Atau yang berwarna hitam, dan berbelang putih di wajah serta kaki-kakitnya.\" Telah menceritakan kepada kami [Abul Mughirah] Telah menceritakan kepada kami [Muhammad bin Muhajir] Telah menceritakan kepada kami [Aqil bin Syabib] dari [Abu Wahb Al Kala'i] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda. Maka ia pun menyebutkan maknanya. Muhammad berkata, \"Saya tidak tahu, apakah beliau mendahulukan Al Kumait ataukah Al Adham.\" Dan orang-orang pun bertanya kepadanya, kenapa ia lebih mendahulukan Al Asyqar?\" ia menjawab, \"Karena Rasulullah shallallahu 'alaihi wasallam pernah mengutus Sariyyah (pasukan khusus yang ditugaskan untuk operasi khusus), ternyata yang pertama kali datang adalah shahibul Asyqar (pasukan kuda yang rambut kudanya berwarna blonde).\""
            },
            {
                "number": 2330,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ سُئِلَ عَنْ رَجُلٍ يُسَلِّمُ عَلَيْهِ وَهُوَ غَيْرُ مُتَوَضِّئٍ فَقَالَ ثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنِ الْحُضَيْنِ أَبِي سَاسَانَ عَنِ الْمُهَاجِرِ بْنِ قُنْفُذٍأَنَّهُ سَلَّمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَتَوَضَّأُ فَلَمْ يَرُدَّ عَلَيْهِ حَتَّى تَوَضَّأَ فَرَدَّ عَلَيْهِ وَقَالَ إِنَّهُ لَمْ يَمْنَعْنِي أَنْ أَرُدَّ عَلَيْكَ إِلَّا أَنِّي كَرِهْتُ أَنْ أَذْكُرَ اللَّهَ إِلَّا عَلَى طَهَارَةٍقَالَ فَكَانَ الْحَسَنُ مِنْ أَجْلِ هَذَا الْحَدِيثِ يَكْرَهُ أَنْ يَقْرَأَ أَوْ يَذْكُرَ اللَّهَ عَزَّ وَجَلَّ حَتَّى يَتَطَهَّرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], bahwa pernah ditanyakan kepadanya tentang seorang laki-laki yang diucapkan salam atasnya, sementara saat itu ia tidak berwudlu, maka ia pun berkata, Telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Al Hudlain Abu Sasan] dari [Al Muhajir bin Qunfudz] bahwa ia pernah mengucapkan salam atas Nabi shallallahu 'alaihi wasallam dan saat itu, beliau sedang berwudlu. Namun, beliau tidak membalas salamnya hingga beliau selesai wudlu, baru kemudian beliau membalasnya dan bersabda: \"Sesungguhnya tidak ada yang menghalangiku untuk membalas salammu, kecuali karena saya tidak suka menyebut nama Allah selain dalam keadaan suci.\" Maka berdasarkan hadits inilah, Al Hasan tidak suka membaca atau menyebut nama Allah sehingga ia bersuci."
            },
            {
                "number": 2331,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا شَيْبَانُ بْنُ عَبْدِ الرَّحْمَنِ عَنِ الرُّكَيْنِ بْنِ الرَّبِيعِ عَنْ أَبِيهِ عَنْ عَمِّهِ فُلَانِ بْنِ عَمِيلَةَ عَنْ خُرَيْمِ بْنِ فَاتِكٍ الْأَسَدِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ النَّاسُ أَرْبَعَةٌ وَالْأَعْمَالُ سِتَّةٌ فَالنَّاسُ مُوَسَّعٌ عَلَيْهِ فِي الدُّنْيَا وَالْآخِرَةِ وَمُوَسَّعٌ لَهُ فِي الدُّنْيَا مَقْتُورٌ عَلَيْهِ فِي الْآخِرَةِ وَمَقْتُورٌ عَلَيْهِ فِي الدُّنْيَا مُوَسَّعٌ عَلَيْهِ فِي الْآخِرَةِ وَشَقِيٌّ فِي الدُّنْيَا وَالْآخِرَةِ وَالْأَعْمَالُ مُوجِبَتَانِ وَمِثْلٌ بِمِثْلٍ وَعَشْرَةُ أَضْعَافٍ وَسَبْعُ مِائَةِ ضِعْفٍ فَالْمُوجِبَتَانِ مَنْ مَاتَ مُسْلِمًا مُؤْمِنًا لَا يُشْرِكُ بِاللَّهِ شَيْئًا فَوَجَبَتْ لَهُ الْجَنَّةُ وَمَنْ مَاتَ كَافِرًا وَجَبَتْ لَهُ النَّارُ وَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا فَعَلِمَ اللَّهُ أَنَّهُ قَدْ أَشْعَرَهَا قَلْبَهُ وَحَرَصَ عَلَيْهَا كُتِبَتْ لَهُ حَسَنَةً وَمَنْ هَمَّ بِسَيِّئَةٍ لَمْ تُكْتَبْ عَلَيْهِ وَمَنْ عَمِلَهَا كُتِبَتْ وَاحِدَةً وَلَمْ تُضَاعَفْ عَلَيْهِ وَمَنْ عَمِلَ حَسَنَةً كَانَتْ لَهُ بِعَشْرِ أَمْثَالِهَا وَمَنْ أَنْفَقَ نَفَقَةً فِي سَبِيلِ اللَّهِ كَانَتْ لَهُ بِسَبْعِ مِائَةِ ضِعْفٍ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] Telah menceritakan kepada kami [Syaiban bin Abdurrahman] dari [Ar Rukain bin Ar Rabi'] dari [bapaknya] dari [pamannya] yakni Fulan bin Alimah, dari [Khuraim bin Fatik Al Asadi] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Manusia ada empat, sedangkan amalan itu ada enam. Manusia ada yang memiliki kelapangan di dunia dan juga di akhirat. Ada yang memiliki kelapangan di dunia, namun ia fakir di akhirat. Ada yang fakir ketika hidup di dunia, akan tetapi di akhiratnya ia mendapat kelapangan. Kemudian, ada juga yang sengsara di dunia dan di juga di akhirat. Sedangkan amalan itu, adalah yang mendapatkan ganjaran dua kali lipat, semisal amalan itu sendiri, ada yang dilipatkan hingga sepuluh kali, dan ada juga yang dilipat gandakan menjadi seratus tujuh kali. Maka yang pertama, barangsiapa yang mati dalam keadaan muslim, dengan tidak menyekutukan Allah dengan sesuatu apa pun, maka wajib baginya surga. Dan siapa yang mati dalam keadaan kafir, maka wajib baginya neraka. Kemudian, barangsiapa yang bertekad untuk berbuat kebaikan, namun ia belum sempat melakukannya, padahal Allah mengetahui bahwa hatinya telah memiliki keinginan keras untuk melakukan amalan tersebut, maka Allah akan menuliskannya sebagai amalan kebaikan. Dan barangsiapa yang bertekat untuk melakukan kejahatan, maka hal itu belum ditulis sebagai suatu keburukan, dan siapa yang melakukannya, baru akan ditulis baginya satu keburukan dan keburukan itu tidaklah dilipatgandakan. Dan barangsiapa yang beramal kebaikan, maka kebaikan itu, akan dilipatgandakan baginya menjadi sepuluh kebaikan. Kemudian, siapa yang mengeluarkan nafaqah di jalan Allah, akan dilipatgandakan baginya menjadi tujuh ratus kali.\""
            },
            {
                "number": 2332,
                "arab": "حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو حَدَّثَنَا زَائِدَةُ حَدَّثَنَا الرُّكَيْنُ بْنُ الرَّبِيعِ بْنِ عَمِيلَةَ الْفَزَارِيُّ عَنْ أَبِيهِ عَنْ يُسَيْرِ بْنِ عَمِيلَةَ عَنْ خُرَيْمِ بْنِ فَاتِكٍ الْأَسَدِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَنْفَقَ نَفَقَةً فِي سَبِيلِ اللَّهِ كُتِبَتْ بِسَبْعِ مِائَةِ ضِعْفٍ",
                "id": "Telah menceritakan kepada kami [Mu'awiyah bin Amru] Telah menceritakan kepada kami [Za`idah] Telah menceritakan kepada kami [Ar Rukain bin Ar Rabi' bin Amilah Al Fazari] dari [bapaknya] dari [Yusair bin Amilah] dari [Khuraim bin Fatik Al Asadi] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang mengeluarkan sedekah di jalan Allah, maka akan ditulis baginya menjadi tujuh ratus kali lipat kebaikan.\""
            },
            {
                "number": 2333,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا أَبُو بَكْرٍ يَعْنِي ابْنَ عَيَّاشٍ عَنْ أَبِي إِسْحَاقَ عَنْ شَمْرِ بْنِ عَطِيَّةَ عَنْ خُرَيْمِ بْنِ فَاتِكٍ الْأَسَدِيِّ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِعْمَ الرَّجُلُ أَنْتَ يَا خُرَيْمُ لَوْلَا خُلَّتَانِ قَالَ قُلْتُ وَمَا هُمَا يَا رَسُولَ اللَّهِ قَالَ إِسْبَالُكَ إِزَارَكَ وَإِرْخَاؤُكَ شَعْرَكَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Adam] Telah menceritakan kepada kami [Abu Bakr] yakni Ibu 'Ayyasy, dari [Ibnu Ishaq] dari [Syamr bin Athiyyah] dari [Khuraim bin Fatik Al Asadi] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Senikmat-nikmat laki-laki adalah kamu, wahai Khuraim, kalau bukan karena dua hal.\" Saya bertanya, \"Apakah kedua hal itu wahai Rasulullah?\" beliau menjawab: \"Isbalnya kainmu (menjulurnya hingga melewati kedua mata kaki), dan rambutmu yang panjang.\""
            },
            {
                "number": 2334,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ عَنْ زَائِدَةَ عَنِ الرُّكَيْنِ بْنِ الرَّبِيعِ بْنِ عَمِيلَةَ الْفَزَارِيِّ عَنْ أَبِيهِ عَنْ يُسَيْرِ بْنِ عَمِيلَةَ عَنْ خُرَيْمِ بْنِ فَاتِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَنْفَقَ نَفَقَةً فِي سَبِيلِ اللَّهِ تُضَاعَفُ بِسَبْعِ مِائَةِ ضِعْفٍ",
                "id": "Telah menceritakan kepada kami [Husain bin Ali] dari [Zaidah] dari [Ar Rukain bin Ar Rabi' bin Amilah Al Fazari] dari [bapaknya] dari [Yusair bin Amilah] dari [Khuraim bin Fatik] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang membelanjakan hartanya di jalan Allah, maka pahalanya akan dilipatgandakan menjadi tujuh ratus kali.\""
            },
            {
                "number": 2335,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا الْمَسْعُودِيُّ عَنِ الرُّكَيْنِ بْنِ الرَّبِيعِ عَنْ أَبِيهِ عَنْ خُرَيْمِ بْنِ فَاتِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَعْمَالُ سِتَّةٌ وَالنَّاسُ أَرْبَعَةٌ فَمُوجِبَتَانِ وَمِثْلٌ بِمِثْلٍ وَالْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا وَالْحَسَنَةُ بِسَبْعِ مِائَةٍ فَأَمَّا الْمُوجِبَتَانِ مَنْ مَاتَ لَا يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ وَمَنْ مَاتَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ النَّارَ وَأَمَّا مِثْلٌ بِمِثْلٍ فَمَنْ هَمَّ بِحَسَنَةٍ حَتَّى يُشْعِرَهَا قَلْبَهُ وَيَعْلَمُ اللَّهُ عَزَّ وَجَلَّ ذَلِكَ مِنْهُ كُتِبَتْ لَهُ حَسَنَةً وَمَنْ عَمِلَ سَيِّئَةً كُتِبَتْ عَلَيْهِ سَيِّئَةً وَمَنْ عَمِلَ حَسَنَةً كُتِبَتْ لَهُ بِعَشْرِ أَمْثَالِهَا وَمَنْ أَنْفَقَ نَفَقَةً فِي سَبِيلِ اللَّهِ فَحَسَنَةٌ بِسَبْعِ مِائَةٍ وَالنَّاسُ أَرْبَعَةٌ مُوَسَّعٌ عَلَيْهِ فِي الدُّنْيَا مَقْتُورٌ عَلَيْهِ فِي الْآخِرَةِ وَمُوَسَّعٌ عَلَيْهِ فِي الْآخِرَةِ مَقْتُورٌ عَلَيْهِ فِي الدُّنْيَا وَمُوَسَّعٌ عَلَيْهِ فِي الدُّنْيَا وَالْآخِرَةِ وَمَقْتُورٌ عَلَيْهِ فِي الدُّنْيَا وَالْآخِرَةِ",
                "id": "Telah menceritakan kepada kami [Abu An Nadlr] Telah menceritakan kepada kami [Al Mas'udi] dari [Ar Rukain bin Ar Rabi'] dari [bapaknya] dari [Khuraim bin Fatik] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"(Balasan) amalan itu ada enam, sedangkan manusia ada empat (golongan). Yaitu, Mujibatan (amalan yang mendapatkan dua balasan) Mitslu bi Mitslin (amalan yang mendapat dengan balasan yang setimpal), amalan yang akan dilipatgandakan menjadi sepuluh kebaikan, dan amalan kebaikan yang dilipatgandakan menjadi tujuh ratus. Adapun Mujibatan adalah; siapa saja yang meninggal dalam keadaan tidak menyekutukan Allah dengan sesuatu apapun, maka dia akan masuk surga. Dan barangsiapa yang meninggal dalam keadaan menyekutukan Allah dengan sesuatu yang lain, maka ia akan masuk neraka. (Adapun) Mitslu bi Mitslin; Siapa yang berkeinginan untuk melakukan kebaikan hingga hatinya merasakannya, dan Allah pun tahu akan hal itu, maka hal itu akan ditulis baginya menjadi satu kebaikan. Dan barangsiapa yang beramal baik, maka akan dicatat baginya sepuluh kebaikan semisalnya. Dan siapa yang memberikan nafkah di jalan Allah, maka satu kebaikan itu (dilipatgandakan menjadi) tujuh ratus kali. Sedangkan manusia itu ada empat yaitu; (pertama) seorang yang mendapat kelapangan di dunia, namun di akhirat yang ia dapatkan adalah kesempitan. (kedua) seorang yang mendapat kelapangan di akhirat, namun ia selalu berada dalam kesempitan di dunia. (yang ketiga) seorang yang mendapat kelapangan di dunia maupun di akhirat. Dan (yang keempat) seorang yang mendapat kesempitan baik di dunia maupun di akhirat.\""
            },
            {
                "number": 2336,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ جَابِرٍ قَالَ سَمِعْتُ الشَّعْبِيَّ قَالَ أَشْهَدُ عَلَى أَبِي سَعِيدِ بْنِ زَيْدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّتْ بِهِ جِنَازَةٌ فَقَامَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Jabir] ia berkata, saya mendengar [Asy Sya'bi] berkata; Saya telah bersaksi atas [ Abu Sa'id bin Zaid], bahwa ketika jenazah lewat di hadapan Rasulullah shallallahu 'alaihi wasallam, beliau berdiri."
            },
            {
                "number": 2337,
                "arab": "حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَمْرِو بْنِ أَوْسٍ عَنْ رَجُلٍ حَدَّثَهُ مُؤَذِّنُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَنَادَى مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي يَوْمٍ مَطِيرٍ صَلُّوا فِي الرِّحَالِ",
                "id": "Telah menceritakan kepada kami [Hajjaj] Telah menceritakan kepada kami [Syu'bah] dari [Amru bin Dinar] dari [Amru bin Aus] dari [seorang laki-laki] telah menceritakan kepadanya [Muadzin] Nabi shallallahu 'alaihi wasallam, ia berkata; Muadzin Rasulullah shallallahu 'alaihi wasallam menyerukan saat hujan turun, \"SHALLUU FII RIHAALIKUM (sholatlah di rumah-rumah kalian).\""
            },
            {
                "number": 2338,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أُخْبِرْتُ عَنْ أَبِي الزِّنَادِ حَدَّثَنِي مُرَقِّعُ بْنُ صَيْفِيٍّ التَّمِيمِيُّ شَهِدَ عَلَى جَدِّهِ رِيَاحِ بْنِ رُبَيِّعٍ الْحَنْظَلِيِّ الْكَاتِبِ أَنَّهُ أَخْبَرَهُ أَنَّهُ خَرَجَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَ حَدِيثِ ابْنِ أَبِي الزِّنَادِ قَالَ حَدَّثَنَا أَبُو عَامِرٍ قَالَ ثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي الزِّنَادِ قَالَ أَخْبَرَنِي الْمُرَقِّعُ بْنُ صَيْفِيٍّ عَنْ جَدِّهِ رِيَاحِ بْنِ رُبَيِّعٍ أَخِي حَنْظَلَةَ الْكَاتِبِ أَنَّهُ أَخْبَرَهُ أَنَّهُ خَرَجَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ الْحَدِيثَ قَالَ حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي الزِّنَادِ قَالَ حَدَّثَنِي مُرَقِّعُ بْنُ صَيْفِيٍّ قَالَ حَدَّثَنِي جَدِّي رِيَاحُ بْنُ رُبَيِّعٍ أَخِي حَنْظَلَةَ الْكَاتِبِأَنَّهُ خَرَجَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزَاةٍ عَلَى مُقَدِّمَتِهِ خَالِدُ بْنُ الْوَلِيدِ فَذَكَرَ رِيَاحًا وَأَصْلَهُ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] telah dikabarkan [(oleh seseorang)] kepadaku dari [Abu Zinad] telah menceritakan kepadaku [Muraqqi'u bin Shaifi At Tamimi] bahwa ia menyaksikan [kakeknya yakni Riyah bin Rubayyi' Al Hanzhali Al Katib], bahwa ia telah mengabarkan kepadanya bahwasanya; Suatu hari, ia keluar bersama Rasulullah shallallahu 'alaihi wasallam. lalu ia pun menyebutkan hadits semisal hadits Ibnu Abu Zinad. Ia berkata; Telah menceritakan kepada kami [Ibnu Amir] ia berkata, Telah menceritakan kepada kami [Al Mughirah bin Abdurrahman] dari [Abu Zinad] ia berkata, telah mengabarkan kepadaku [Al Muraqqi'u bin Shaifi] dari [kakeknya] yakni Riyah bin Rubayyi' saudaranya Hanzhalah Al Katib, bahwa ia telah mengabarkan kepadanya bahwasanya; Ia pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam. ia pun menyebutkan hadits. Ia berkata; Telah menceritakan kepada kami [Sa'id bin Manshur] ia berkata, Telah menceritakan kepada kami [Al Mughirah bin Abdurrahman] dari [Abu Zinad] ia berkata, telah menceritakan kepadaku [Muraqqi' bin Shaifi] ia berkata, [kakekku, Riyah bin Rubayyi'] saudaranya Hanzhalah Al Katib, bahwasanya; Ia pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam pada suatu peperangana atas komando Khalid bin Walid. Ia pun menyebutkan Riyah dan asalnya. Lalu ia menyebutkan hadits."
            },
            {
                "number": 2339,
                "arab": "حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ حَدَّثَنَا سُفْيَانُ عَنِ الْجُرَيْرِيِّ عَنْ أَبِي عُثْمَانَ عَنْ حَنْظَلَةَ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْنَا الْجَنَّةَ وَالنَّارَ حَتَّى كَانَا رَأْيَ عَيْنٍ فَقُمْتُ إِلَى أَهْلِي فَضَحِكْتُ وَلَعِبْتُ مَعَ أَهْلِي وَوَلَدِي فَذَكَرْتُ مَا كُنْتُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجْتُ فَلَقِيتُ أَبَا بَكْرٍ فَقُلْتُ يَا أَبَا بَكْرٍ نَافَقَ حَنْظَلَةُ قَالَ وَمَاذَاكَ ذَاكَ قُلْتُ كُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْنَا الْجَنَّةَ وَالنَّارَ حَتَّى كَانَا رَأْيَ عَيْنٍ فَذَهَبْتُ إِلَى أَهْلِي فَضَحِكْتُ وَلَعِبْتُ مَعَ وَلَدِي وَأَهْلِي فَقَالَ إِنَّا لَنَفْعَلُ ذَاكَ قَالَ فَذَهَبْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ يَا حَنْظَلَةُ لَوْ كُنْتُمْ تَكُونُونَ فِي بُيُوتِكُمْ كَمَا تَكُونُونَ عِنْدِي لَصَافَحَتْكُمْ الْمَلَائِكَةُ وَأَنْتُمْ عَلَى فُرُشِكُمْ وَبِالطُّرُقِ يَا حَنْظَلَةُ سَاعَةً وَسَاعَةً",
                "id": "Telah menceritakan kepada kami [Abu Ahmad Az Zubairi] Telah menceritakan kepada kami [Sufyan] dari [Al Jurairi] dari [Abu Utsman] dari [Hanzhalah] ia berkata; Suatu ketika, kami berada di sisi Rasulullah shallallahu 'alaihi wasallam, lalu beliau menyebutkan tentang surga dan neraka, hingga seolah-olah mata melihatnya. Setelah itu saya beranjak pulang menemui keluargaku, dan saat itu aku pun tertawa bersama isteri dan anakku. Kemudian aku teringat, akan perasaanku saat berada di sisi Rasulullah shallallahu 'alaihi wasallam, lalu aku keluar dan berjumpa dengan Abu Bakr. Aku pun berkata, \"Wahai Abu Bakr, Hanzhalah telah munafik.\" Ia bertanya, \"Kenapa bisa begitu?\" saya berkata, \"Ketika kami berada di sisi Rasulullah shallallahu 'alaihi wasallam, beliau mengingatkan kami surga dan neraka hingga seakan-akan mata melihatnya. Namun setelah itu, saya pulang menemui keluargaku, dan saya pun tertawa dan bermain-main bersama anak dan isteriku.\" Abu Bakar berkata, \"Sesungguhnya kami juga melakukan hal yang demikian.\" Maka aku pun menemui Nabi shallallahu 'alaihi wasallam dan menuturkan hal itu pada beliau. Beliau bersabda: \"Wahai Hanzhalah, sekiranya saat kalian berada di rumah-rumah kalian, sebagaimana saat kalian berada di sisiku, niscaya malaikat akan menyalami kalian. Dan saat kalian berada di rumah atau di jalan, maka (ingatlah sewaktu) waktu.\""
            },
            {
                "number": 2340,
                "arab": "حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ حَدَّثَنَا عِمْرَانُ يَعْنِي الْقَطَّانَ عَنْ قَتَادَةَ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ حَنْظَلَةَ الْأُسَيِّدِيِّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّا إِذَا كُنَّا عِنْدَكَ كُنَّا فَإِذَا فَارَقْنَاكَ كُنَّا عَلَى غَيْرِ ذَلِكَ فَقَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَوْ كُنْتُمْ تَكُونُونَ عَلَى الْحَالِ الَّذِي تَكُونُونَ عَلَيْهَا عِنْدِي لَصَافَحَتْكُمْ الْمَلَائِكَةُ وَلَأَظَلَّتْكُمْ بِأَجْنِحَتِهَا",
                "id": "Telah menceritakan kepada kami [Abu Dawud Ath Thiyalisi] Telah menceritakan kepada kami [Imran] yakni Al Qaththan, dari [Qatadah] dari [Yazid bin Abdullah Asy Syikhkir] dari [Hanzhalah Al Usaidi] ia berkata; Saya berkata, \"Jika kami berada di sisimu, maka (iman) kami (kuat), namun setelah kami meninggalakan Anda, kami tidak lagi seperti itu.\" Maka beliau pun bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, sekiranya keadaan kalian seperti saat kalian berada di sisiku, niscaya malaikat menyalami kalian dan menaungi kalian dengan sayap-sayapnya.\""
            },
            {
                "number": 2341,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا أَبُو هِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ سَوَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ رَجُلٍ مِنْ بَنِي عَبْدِ اللَّهِ بْنِ كَعْبٍ قَالَأَغَارَتْ عَلَيْنَا خَيْلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَيْتُهُ وَهُوَ يَتَغَدَّى فَقَالَ ادْنُ فَكُلْ قُلْتُ إِنِّي صَائِمٌ قَالَ اجْلِسْ أُحَدِّثْكَ عَنْ الصَّوْمِ أَوْ الصِّيَامِ إِنَّ اللَّهَ عَزَّ وَجَلَّ وَضَعَ عَنْ الْمُسَافِرِ شَطْرَ الصَّلَاةِ وَعَنْ الْمُسَافِرِ وَالْحَامِلِ وَالْمُرْضِعِ الصَّوْمَ أَوْ الصِّيَامَ وَاللَّهِ لَقَدْ قَالَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كِلَاهُمَا أَوْ أَحَدُهُمَافَيَا لَهْفَ نَفْسِي هَلَّا كُنْتُ طَعِمْتُ مِنْ طَعَامِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا أَبُو هِلَالٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَوَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ رَجُلٍ مِنْ بَنِي عَبْدِ اللَّهِ بْنِ كَعْبٍ وَلَيْسَ بِالْأَنْصَارِيِّ قَالَ أَغَارَتْ عَلَيْنَا خَيْلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ الْحَدِيثَ قَالَ عَبْد اللَّهِ و حَدَّثَنَاه شَيْبَانُ حَدَّثَنَا أَبُو هِلَالٍ قَالَ فَذَكَرَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Abu Hilal] dari [Abdullah bin Sawadah] dari [Anas bin Malik] -ia adalah seorang laki-lakid ari Bani Abdullah bin Ka'ab, ia berkata; Kuda Rasulullah shallallahu 'alaihi wasallam tiba-tiba menyerang kami, maka saya pun mendatangi beliau yang sedang makan. Maka beliau berkata: \"Mendekat dan makanlah.\" saya berkata, 'Sesungguhnya, saya sedang berpuasa.\" Beliau bersabda: \"Duduklah, saya akan menceritakanmu tentang shaum atau Shiyam. Sesungguhnya Allah 'azza wajalla meringankan setengah sholat untuk musafir. Dan meringankan shaum bagi Musafir, wanita hamil dan menyusui. Demi Allah, kedua hal itu telah disabdakan oleh Rasulullah shallallahu 'alaihi wasallam. Keduanya atau salah satu dari keduanya berkata \"Duhai, kemarilah, saya telah diberi makan dari makanan Rasulullah shallallahu 'alaihi wasallam.\" Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Abu HIlal] Telah menceritakan kepada kami [Abdullah bin Sawadah] dari [Anas bin Malik] seorang laki-laki dari Bani Abdullah bin Ka'ab dan bukan Al Anshari. Ia berkata; Kuda Rasulullah shallallahu 'alaihi wasallam tiba-tiba menyerang kami. Maka ia pun menyebutkan hadits itu. Abdullah berkata; Dan Telah menceritakannya kepada kami [Syaiban] Telah menceritakan kepada kami [Abu Hilal] ia berkata; Maka ia pun menyebutkan hadits semisalnya."
            },
            {
                "number": 2342,
                "arab": "حَدَّثَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ حَدَّثَنَا شَرِيكٌ وَيَزِيدُ بْنُ عَطَاءٍ عَنْ يَزِيدَ يَعْنِي ابْنَ أَبِي زِيَادٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَابِطٍ عَنْ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَزَالُ هَذِهِ الْأُمَّةُ بِخَيْرٍ مَا عَظَّمُوا هَذِهِ الْحُرْمَةَ حَقَّ تَعْظِيمِهَا فَإِذَا تَرَكُوهَا وَضَيَّعُوهَا هَلَكُوا وَقَالَ فِي حَدِيثِ يَزِيدَ بْنِ عَطَاءٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَحَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا شَرِيكٌ عَنْ يَزِيدَ عَنِ ابْنِ سَابِطٍ عَنِ الْمُطَّلِبِ أَوْ عَنِ الْعَيَّاشِ بْنِ أَبِي رَبِيعَةَ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Al Husain bin Muhammad] Telah menceritakan kepada kami [Syarik] dan [Yazid bin Atah`] dari [Yazid bin Abu Ziyad] dari [Abdurrahman bin Sabith] dari [Ayyasy bin Abu Rabi'ah] ia berkata; Saya mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Umat ini akan senantiasa berada dalam kebaikan, selama mereka memuliakan Hurmah (kesucian) ini dengan sebaik-baik pengagungan. Dan jika mereka telah meninggalkan dan meremehkannya, niscaya mereka akan binasa.\" Dan ia berkata dalam haditsnya Yazid bin Atha` dari Nabi shallallahu 'alaihi wasallam. Telah menceritakan kepada kami [Aswad bin Amir] Telah menceritakan kepada kami [Syarik] dari [Yazid bin Tsabith] dari [Al Muthallib] atau [Al Ayyas bin Abu Rabi'ah] ia berkata; Saya mendengar. Lalu ia pun menyebutkan hadits semisalnya."
            },
            {
                "number": 2343,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَسْوَدُ بْنُ شَيْبَانَ عَنْ أَبِي نَوْفَلِ بْنِ أَبِي عَقْرَبٍ عَنْ أَبِيهِ قَالَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّوْمِ فَقَالَ صُمْ مِنْ الشَّهْرِ يَوْمًا قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أَقْوَى فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أَقْوَى إِنِّي أَقْوَى صُمْ يَوْمَيْنِ مِنْ كُلِّ شَهْرٍ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ زِدْنِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زِدْنِي زِدْنِي ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Al Aswad bin Syaiban] dari [Abu Naufal bin Abu 'Aqrab] dari [bapaknya] ia berkata; Saya bertanya kepada Nabi shallallahu 'alaihi wasallam tentang shaum (puasa). Beliau menjawab: \"Berpuasalah satu hari dari setiap bulan.\" Saya berkata, \"Wahai Rasulullah, saya lebih kuat dari itu.\" beliau bersabda: \"Saya kuat, saya kuat, berpuasalah dua hari dari setiap bulan.\" Saya berkata, \"Wahai Rasulullah, tambahkanlah lagi.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tambahkan lagi, tambahkan lagi, berpuasalah tiga hari dari setiap bulannya.\""
            },
            {
                "number": 2344,
                "arab": "حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الْجَعْدُ عَنِ الْحَسَنِ بْنِ عَبْدِ اللَّهِ أَنَّ عَمْرَو بْنَ عُبَيْدِ اللَّهِ حَدَّثَهُ أَنَّهُ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَلَ كَتِفًا ثُمَّ قَامَ فَمَضْمَضَ فَصَلَّى وَلَمْ يَتَوَضَّأْ",
                "id": "Telah menceritakan kepada kami [Makki bin Ibrahim] Telah menceritakan kepada kami [Al Ja'd] dari [Al Hasan bin Abdullah] bahwa [Amru bin Ubaid] telah menceritakan kepadanya, bahwa ia berkata; Saya melihat Rasulullah shallallahu 'alaihi wasallam makan bahu kambing, kemudian beliau berdiri dan berkumur-kumur lalu sholat dengan tidak berwudlu lagi."
            },
            {
                "number": 2345,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا زَمْعَةُ عَنْ عِيسَى بْنِ يَزْدَادَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَالَ أَحَدُكُمْ فَلْيَنْتُرْ ذَكَرَهُ ثَلَاثًا قَالَ زَمْعَةُ مَرَّةً فَإِنَّ ذَلِكَ يُجْزِئُ عَنْهُ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Zam'ah] dari [Isa bin Yazdad] dari [bapaknya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian kencing, hendaklah ia menarik zakarnya tiga kali.\" Zam'ah berkata; \"Sekali (saja), karena hal itu telah mencukupinya.\""
            },
            {
                "number": 2346,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَاقَ عَنْ عِيسَى بْنِ يَزْدَادَ بْنِ فَسَاءَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَالَ أَحَدُكُمْ فَلْيَنْتُرْ ذَكَرَهُ ثَلَاثَ مَرَّاتٍ",
                "id": "Telah menceritakan kepada kami [Rauh] Telah menceritakan kepada kami [Zakariya bin Ishaq] dari [Isa bin Yazdad bin Fasa`ah] dari [bapaknya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian kencing, hendaklah ia menarik zakarnya tiga kali.\""
            },
            {
                "number": 2347,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا ابْنُ أَبِي لَيْلَى عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِي لَيْلَى قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي صَلَاةٍ لَيْسَتْ بِفَرِيضَةٍ فَمَرَّ بِذِكْرِ الْجَنَّةِ وَالنَّارِ فَقَالَ أَعُوذُ بِاللَّهِ مِنْ النَّارِ وَيْحٌ أَوْ وَيْلٌ لِأَهْلِ النَّارِ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Ibnu Abu Laila] dari [Tsabit Al Banani] dari [Abdurrahman bin Abu Laila] dari [Abu Laila] ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam membaca ayat di dalam sholat, namun bukan sholat wajib. Kemudian beliau melewati penyebutan Surga dan neraka, maka beliau pun membaca: \"Aku berlindung kepada Allah dari api neraka -atau- kecelakaanlah bagi penghuni neraka.\""
            },
            {
                "number": 2348,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا ابْنُ أَبِي لَيْلَى عَنْ أَخِيهِ عِيسَى بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَكُنَّا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَ الْحَسَنُ بْنُ عَلِيٍّ يَحْبُو حَتَّى صَعِدَ عَلَى صَدْرِهِ فَبَالَ عَلَيْهِ قَالَ فَابْتَدَرْنَاهُ لِنَأْخُذَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْنِي ابْنِي قَالَ ثُمَّ دَعَا بِمَاءٍ فَصَبَّهُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Ibnu Abu Laila] dari [saudaranya, Isa bin Abdurrahman], dari [bapaknya] dari [kakeknya], ia berkata; Kami berada di sisi Rasulullah shallallahu 'alaihi wasallam, kemudian datanglah Hasan bin Ali, ia merayap hingga menaiki dada beliau dan kencing. Maka kami pun segera beranjak hendak mengambilnya, namun Nabi shallallahu 'alaihi wasallam bersabda: \"Anakku.., anakku.\" Kemudian beliau meminta air dan menuangkan ke atasnya."
            },
            {
                "number": 2349,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا زُهَيْرٌ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى عَنْ عِيسَى بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِي لَيْلَى أَنَّهُكَانَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى بَطْنِهِ الْحَسَنُ أَوْ الْحُسَيْنُ شَكَّ زُهَيْرٌ قَالَ فَبَالَ حَتَّى رَأَيْتُ بَوْلَهُ عَلَى بَطْنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسَارِيعَ قَالَ فَوَثَبْنَا إِلَيْهِ قَالَ فَقَالَ عَلَيْهِ الصَّلَاة وَالسَّلَامُ دَعُوا ابْنِي أَوْ لَا تُفْزِعُوا ابْنِي قَالَ ثُمَّ دَعَا بِمَاءٍ فَصَبَّهُ عَلَيْهِ قَالَ فَأَخَذَ تَمْرَةً مِنْ تَمْرِ الصَّدَقَةِ قَالَ فَأَدْخَلَهَا فِي فِيهِ قَالَ فَانْتَزَعَهَا رَسُولُ اللَّهِ مِنْ فِيهِ",
                "id": "Telah menceritakan kepada kami [Aswad bin Amir] Telah menceritakan kepada kami [Zuhair] dari [Abdullah bin Isa] dari [Isa bin Abdurrahman bin Abu Laila] dari [Abu Laila] bahwa ia pernah berada di sisi Rasulullah shallallahu 'alaihi wasallam. Saat itu, beliau sedang menggendong Hasan atau Husain -Zuhari ragu-, lalu anak itu kencing hingga saya melihat air kencingnya mengalir di perut Rasulullah shallallahu 'alaihi wasallam dan membasahi kainnya. Kami pun segera melompat hendak mengambilnya, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Biarkan anakku -atau- janganlah kalian mengagetkannya.\" Kemudian beliau meminta air, lalu menuangkan ke atasnya. Kemudian anak itu mengambil satu biji dari kurma sedekah dan memasukkan ke dalam mulutnya, namun Rasulullah shallallahu 'alaihi wasallam segera menariknya kembali dari mulutnya."
            },
            {
                "number": 2350,
                "arab": "حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ قَيْسِ بْنِ مُسْلِمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِيهِ قَالَشَهِدْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتْحَ خَيْبَرَ فَلَمَّا انْهَزَمُوا وَقَعْنَا فِي رِحَالِهِمْ فَأَخَذَ النَّاسُ مَا وَجَدُوا مِنْ خُرْثِيٍّ فَلَمْ يَكُنْ أَسْرَعَ مِنْ أَنْ فَارَتْ الْقُدُورُ قَالَ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْقُدُورِ فَأُكْفِئَتْ وَقَسَمَ بَيْنَنَا فَجَعَلَ لِكُلِّ عَشَرَةٍ شَاةً",
                "id": "Telah menceritakan kepada kami [Zakariya bin Adi] Telah menceritakan kepada kami [ubaidhullah bin Amru] dari [Zaid bin Abu Unaisah] dari [Qais bin Muslim] dari [Abdurrahman bin Abu Laila] dari [bapaknya] ia berkata; Saya ikut serta dalam penaklukan Khaibar bersama Rasulullah shallallahu 'alaihi wasallam. Ketika mereka kalah dan terpukul mundur, kami pun memasuki kediaman mereka, sehingga orang-orang pun mengambil apa yang mereka dapatkan dari berbagai perabot rumah dan perhiasannya. Dengan tidak secepat kuali yang mendidih, Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk (menumpahkan kuali itu), maka kuali itu pun ditumpahkan. Kemudian Rasulullah shallallahu 'alaihi wasallam membagikan untuk setiap orangnya sepuluh ekor kambing."
            },
            {
                "number": 2351,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى حَدَّثَنَا زُهَيْرٌ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ أَبِي لَيْلَى قَالَكُنْتُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى صَدْرِهِ أَوْ بَطْنِهِ الْحَسَنُ أَوْ الْحُسَيْنُ قَالَ فَرَأَيْتُ بَوْلَهُ أَسَارِيعَ فَقُمْنَا إِلَيْهِ فَقَالَ دَعُوا ابْنِي لَا تُفْزِعُوهُ حَتَّى يَقْضِيَ بَوْلَهُ ثُمَّ أَتْبَعَهُ الْمَاءَ ثُمَّ قَامَ فَدَخَلَ بَيْتَ تَمْرِ الصَّدَقَةِ وَدَخَلَ مَعَهُ الْغُلَامُ فَأَخَذَ تَمْرَةً فَجَعَلَهَا فِي فِيهِ فَاسْتَخْرَجَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ إِنَّ الصَّدَقَةَ لَا تَحِلُّ لَنَا",
                "id": "Telah menceritakan kepada kami [Hasan bin Musa] Telah menceritakan kepada kami [Zuhair] dari [Abdullah bin Isa] dari [bapaknya] dari [kakeknya] dari [Abu Laila] ia berkata; Saya berada di sisi Rasulullah shallallahu 'alaihi wasallam yang sedang menggendong Hasan atau Husain, lalu saya melihat air kencingnya mengalir, maka saya segera berdiri ke arahnya, Maka beliau pun bersabda: \"Biarkan anakku, janganlah kalian mengagetkannya hingga ia selesai kencing.\" Setelah itu, beliau mengikutinya dengar siraman air, kemudian beliau berdiri dan masuk bersama anak itu ke dalam rumah penyimpanan kurma sedekah. Lalu anak itu mengambil satu biji kurma dan meletakkan di mulutnya, maka Nabi shallallahu 'alaihi wasallam pun mengeluarkannya dan bersabda: \"Sesungguhnya harta sedekah tidak halal bagi kami.\""
            },
            {
                "number": 2352,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ وَسَمِعْتُهُ أَنَا مِنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ هَاشِمٍ عَنِ ابْنِ أَبِي لَيْلَى عَنْ ثَابِتٍ قَالَكُنْتُ جَالِسًا مَعَ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى فِي الْمَسْجِدِ فَأُتِيَ بِرَجُلٍ ضَخْمٍ فَقَالَ يَا أَبَا عِيسَى قَالَ نَعَمْ قَالَ حَدِّثْنَا مَا سَمِعْتَ فِي الْفِرَاءِ فَقَالَ سَمِعْتُ أَبِي يَقُولُ كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَى رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ أُصَلِّي فِي الْفِرَاءِ قَالَ فَأَيْنَ الدِّبَاغُفَلَمَّا وَلَّى قُلْتُ مَنْ هَذَا قَالَ هَذَا سُوَيْدُ بْنُ غَفَلَةَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad] dan -saya mendengarnya dari Abdullah bin Muhammad bin Abu Syaibah- Telah menceritakan kepada kami [Ali bin Hasyim] dari [Ibnu Abu Laila] dari [Tsabit] ia berkata; saya pernah duduk bersama [Abdurrahman bin Abu Laila] di dalam masjid. Lalu didatangkanlah seorang laki-laki yang besar badannya dan berkata, \"Wahai Abu Isa.\" Ia menjawab, \"Ya.\" Laki-laki berkata lagi, \"Ceritakanlah kepada kami apa yang telah Anda dengar tentang Al Firaa` (kulit).\" Maka ia berkata; Saya mendengar [bapakku] berkata; Saya pernah duduk di sisi Nabi shallallahu 'alaihi wasallam, lalu datanglah seorang laki-laki dan berkata, \"Wahai Rasulullah, apakah saya boleh sholat di atas kulit?\" beliau bersabda: \"Kalau begitu, di manakah Ad Dibaagh (proses penyamakan kulit)?\" ketika orang itu berlalu, saya bertanya, \"Siapakah orang ini?\" beliau menjawab: \"Ini adalah Suwaid bin Ghafalah.\""
            },
            {
                "number": 2353,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا مُوسَى بْنُ دَاوُدَ حَدَّثَنَا عَلِيُّ بْنُ عَابِسٍ عَنْ أَبِي فَزَارَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِيهِ فِيمَا أَعْلَمُ شَكَّ مُوسَىأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْتَكَفَ فِي قُبَّةٍ مِنْ خُوصٍ",
                "id": "Telah menceritakan kepada kami Abdullah Telah menceritakan kepada kami [Musa bin Dawud] Telah menceritakan kepada kami [Ali bin Abis] dari [Abu Fazarah] dari [Abdurrahman bin Abu Laila] dari [bapaknya] menurut apa yang saya ketahui -Musa ragu-ragu- bahwa Nabi shallallahu 'alaihi wasallam melakukan i'tikaf di dalam Kubah yang terbuat dari daun kurma."
            },
            {
                "number": 2354,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ وَأَبُو مَعْمَرٍ وَمُحَمَّدُ بْنُ حَسَّانَ السَّمْتِيُّ قَالُوا ثَنَا عَلِيُّ بْنُ عَابِسٍ عَنْ أَبِي فَزَارَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِيهِ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْتَكَفَ فِي قُبَّةٍ مِنْ خُوصٍ",
                "id": "Telah menceritakan kepada kami [Harun bin Ma'ruf] dan [Abu Ma'mar] dan [Muhammad bin Hassan As Samti] mereka berkata, Telah menceritakan kepada kami [Ali bin Abis] dari [Abu Fazarah] dari [Abdurrahman bin Abu Laila] dari [bapaknya] ia berkata; Saya melihat Nabi shallallahu 'alaihi wasallam melakukan i'tikaf di dalam Qubah yang terbuat dari daun kurma."
            },
            {
                "number": 2355,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ الصُّنَابِحِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الشَّمْسَ تَطْلُعُ بَيْنَ قَرْنَيْ شَيْطَانٍ فَإِذَا ارْتَفَعَتْ فَارَقَهَا فَإِذَا كَانَتْ فِي وَسَطِ السَّمَاءِ قَارَنَهَا فَإِذَا دَلَكَتْ أَوْ قَالَ زَالَتْ فَارَقَهَا فَإِذَا دَنَتْ لِلْغُرُوبِ قَارَنَهَا فَإِذَا غَرُبَتْ فَارَقَهَا فَلَا تُصَلُّوا هَذِهِ الثَّلَاثَ سَاعَاتٍ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] Telah menceritakan kepada kami [Ma'mar] dari [Zaid bin Aslam] dari [Atha` bin Yasar] dari [Abdullah Ash Shunabihi] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya matahari itu terbit di antara dua tanduk dari dua syetan. Jika ia meninggi, maka ia pun meninggalkannya. Jika matahari telah berada di tengah-tengah langit, syetan itu kembali menyertainya. Dan saat matahari menyingsing\/condong ke arah barat, maka syetan itu meninggalkannya. kemudian, saat matahari mulai akan terbenam, syetan kembali menyertainya. Dan setelah terbenam, ia pun meninggalkannya. karena itu, janganlah kalian sholat pada tiga waktu ini.\""
            },
            {
                "number": 2356,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ مُطَرِّفٍ أَبُو غَسَّانَ حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ الصُّنَابِحِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ مَضْمَضَ وَاسْتَنْشَقَ خَرَّتْ خَطَايَاهُ مِنْ فِيهِ وَأَنْفِهِ وَمَنْ غَسَلَ وَجْهَهُ خَرَجَتْ خَطَايَاهُ مِنْ أَشْفَارِ عَيْنَيْهِ وَمَنْ غَسَلَ يَدَيْهِ خَرَجَتْ مِنْ أَظْفَارِهِ أَوْ مِنْ تَحْتِ أَظْفَارِهِ وَمَنْ مَسَحَ رَأْسَهُ وَأُذُنَيْهِ خَرَجَتْ خَطَايَاهُ مِنْ رَأْسِهِ أَوْ شَعَرِ أُذُنَيْهِ وَمَنْ غَسَلَ رِجْلَيْهِ خَرَجَتْ خَطَايَاهُ مِنْ أَظْفَارِهِ أَوْ تَحْتَ أَظْفَارِهِ ثُمَّ كَانَتْ خُطَاهُ إِلَى الْمَسْجِدِ نَافِلَةًحَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ حَدَّثَنَا مُحَمَّدُ بْنُ مُطَرِّفٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ الصُّنَابِحِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَمَضْمَضَ وَاسْتَنْثَرَ خَرَجَتْ خَطَايَاهُ مِنْ أَنْفِهِ وَفَمِهِ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id] bekas budak Bani Hasyim, Telah menceritakan kepada kami [Muhammad bin Mutharrif Abu Ghassan] Telah menceritakan kepada kami [Zaid bin Aslam] dari [Atha` bin Yasar] dari [Abu Abdullah Ash Shunabihi] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang berkumur-kumur dan istinsyaaq (memasukkan air ke hidung lalu mengeluarkannya kembali), maka dosa-dosanya akan berjatuhan dari mulut dan hidungnya. Dan barangsiapa yang membasuh wajahnya, maka dosa-dosanya akan keluar dari bulu matanya. Dan siapa yang membasuh kedua tangannya, maka dosa-dosanya akan keluar dari kuku-kukunya atau dari bawah kuku-kukunya. Dan siapa yang mengusap kepala dan kedua telinganya, maka dosa-dosanya akan keluar dari kepala atau dari rambut kedua telinganya. Dan barangsiapa yang mencuci kedua kakinya, maka dosa-dosanya akan keluar dari kuku-kuku kakinya, atau dari bawah kukunya. kemudian langkah kaki yang ia ayunkan akan terhitung sebagai amalan sunnah.\" Telah menceritakan kepada kami [Husain bin Muhammad] Telah menceritakan kepada kami [Muhammad bin Mutharrif] dari [Zaid bin Aslam] dari [Atha` bin Yasar] dari [Abu Abdullah Ash Shunabihi] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang berkumur-kumur dan intitsar (memasukkan air ke hidung lalu mengeluarkannya kembali), maka dosa-dosanya akan berjatuhan dari hidung dan mulutnya.\" Lalu ia pun menyebutkan maknanya."
            },
            {
                "number": 2357,
                "arab": "حَدَّثَنَا عَتَّابُ بْنُ زِيَادٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُبَارَكٍ أَخْبَرَنَا خَالِدُ بْنُ سَعِيدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنِ الصُّنَابِحِيِّ قَالَرَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِبِلِ الصَّدَقَةِ نَاقَةً مُسِنَّةً فَغَضِبَ وَقَالَ مَا هَذِهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي ارْتَجَعْتُهَا بِبَعِيرَيْنِ مِنْ حَاشِيَةِ الصَّدَقَةِ فَسَكَتَ",
                "id": "Telah menceritakan kepada kami ['Attab Bin Ziyad] Telah menceritakan kepada kami [Abdullah bin Mubarak] telah mengabarkan kepada kami [Khalid Bin Sa'id] dari [Qais Bin Abi Hazim] dari [Ash Sunabihi], ia berkata; Rasulullah shallallahu 'alaihi wasallam melihat unta yang berumur satu tahun di segerombolan unta zakat, maka beliau marah dan bersabda; \"Apa ini?\" dia menjawab; \"Wahai Rasulullah, aku akan mengembalikannya dengan ganti dengan dua ekor unta dari hewan zakat.\" maka beliau pun diam."
            },
            {
                "number": 2358,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا الصَّلْتُ يَعْنِي ابْنَ الْعَوَّامِ قَالَ حَدَّثَنِي الْحَارِثُ بْنُ وَهْبٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الصُّنَابِحِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَنْ تَزَالَ أُمَّتِي فِي مَسَكَةٍ مَا لَمْ يَعْمَلُوا بِثَلَاثٍ مَا لَمْ يُؤَخِّرُوا الْمَغْرِبَ بِانْتِظَارِ الْإِظْلَامِ مُضَاهَاةَ الْيَهُودِ وَمَا لَمْ يُؤَخِّرُوا الْفَجْرَ إِمْحَاقَ النُّجُومِ مُضَاهَاةَ النَّصْرَانِيَّةِ وَمَا لَمْ يَكِلُوا الْجَنَائِزَ إِلَى أَهْلِهَا",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] Telah menceritakan kepada kami [Ash Shalt Bin al 'Awwam] ia berkata, telah menceritakan kepadaku [Al HArits Bin Wahb] dari [Abu Abdurrahman Ash Shunabihi], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ummatku akan tetap berada dalam keteguhan beragama selagi mereka tidak melakukan tiga perkara; selagi mereka tidak mengakhirkan waktu maghrib dengan menanti waktu gelap untuk menyelisihi orang-orang Yahudi, selagi mereka tidak mengakhirkan waktu fajar sampai hilangnya bintang untuk menyelisihi orang-orang Nashrani, dan selagi mereka tidak menelantarkan perkara jenazah kepada keluarganya.\""
            },
            {
                "number": 2359,
                "arab": "قَالَ قَرَأْتُ عَلَى عَبْدِ الرَّحْمَنِ : مَالِكٌ قَالَ وَحَدَّثَنَا إِسْحَاقُ أَخْبَرَنِي مَالِكٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ عَبْدِ اللَّهِ الصُّنَابِحِيِّ قَالَإِذَا تَوَضَّأَ الْعَبْدُ فَمَضْمَضَ خَرَجَتْ الْخَطَايَا مِنْ أَنْفِهِ فَإِذَا غَسَلَ وَجْهَهُ خَرَجَتْ الْخَطَايَا مِنْ وَجْهِهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَشْفَارِ عَيْنَيْهِ فَإِذَا غَسَلَ يَدَيْهِ خَرَجَتْ خَطَايَاهُ مِنْ يَدَيْهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَظْفَارِ يَدَيْهِ فَإِذَا مَسَحَ رَأْسَهُ خَرَجَتْ الْخَطَايَا مِنْ رَأْسِهِ حَتَّى تَخْرُجَ مِنْ أُذُنَيْهِ وَإِذَا غَسَلَ رِجْلَيْهِ خَرَجَتْ الْخَطَايَا مِنْ رِجْلَيْهِ حَتَّى تَخْرُجَ مِنْ تَحْتِ أَظْفَارِ رِجْلَيْهِ ثُمَّ كَانَ مَشْيُهُ إِلَى الْمَسْجِدِ وَصَلَاتُهُ نَافِلَةً لَهُ",
                "id": "(Imam Ahmad) Berkata; Aku telah membacakan kepada [Abdurrahman]; [Malik], ia berkata, Telah menceritakan kepada kami [Ishaq] telah mengabarkan kepadaku [Malik] dari [Zaid bin Aslam] dari [Atha` bin Yasar] dari [Abdullah Ash Shunabihi] ia berkata; \"Apabila seorang hamba berwudlu, kemudian dia berkumur-kumur, maka kesalahan-kesalahannya keluar dari hidungnya, apabila dia membasuh mukanya maka kesalahan-kesalahannya keluar dari mukanya sampai keluar dari bawah tepi pelupuk matanya, apabila dia membasuh kedua tangannya maka kesalahan-kesalahannya akan keluar dari kedua tangannya sampai keluar dari ujung jari-jari kedua tangannya, apabila ia mengusap kepalanya, maka kesalahan-kesalahannya akan keluar dari kepalanya sehingga keluar dari kedua telinganya. Dan apabila ia membasuh kedua kakinya maka kesalahan-kesalahannya akan keluar dari kedua kakinya sehingga keluar dari ujung jari-jari kakinya, kemudian berjalannya menuju masjid serta sholatnya adalah terhitung sunnah baginya.\""
            },
            {
                "number": 2360,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ إِسْمَاعِيلَ أَنَّهُ سَمِعَ قَيْسًا يَقُولُ سَمِعْتُ الصُّنَابِحِيَّ الْأَحْمَسِيَّ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَلَا إِنِّي فَرَطُكُمْ عَلَى الْحَوْضِ وَإِنِّي مُكَاثِرٌ بِكُمْ الْأُمَمَ فَلَا تَقْتَتِلُنَّ بَعْدِي",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Isma'il] bahwa mendengar [Qais] berkata, saya mendengar [Ash Shunabihi al Ahmasi] berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketahuilah bahwa sayalah yang akan mendahului dan menyambut kalian di telaga, dan sesungguhnya aku berbangga dengan banyaknya jumlah kalian di banding dengan umat yang lain, maka janganlah kalian saling berbunuhan sepeninggalku.\""
            },
            {
                "number": 2361,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا مَالِكٌ وَزُهَيْرُ بْنُ مُحَمَّدٍ قَالَا ثَنَا زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ الصُّنَابِحِيَّ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الشَّمْسَ تَطْلُعُ بَيْنَ قَرْنَيْ شَيْطَانٍ فَإِذَا طَلَعَتْ قَارَنَهَا فَإِذَا ارْتَفَعَتْ فَارَقَهَا وَيُقَارِنُهَا حِينَ تَسْتَوِي فَإِذَا زَالَتْ فَارَقَهَا فَصَلُّوا غَيْرَ هَذِهِ السَّاعَاتِ الثَّلَاثِحَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ أَبِي عَبْدِ اللَّهِ بِحَدِيثِ الشَّمْسِ",
                "id": "Telah menceritakan kepada kami [Rauh] Telah menceritakan kepada kami [Malik] dan [Zuhair Bin Muhammad] keduanya berkata, Telah menceritakan kepada kami [Zaid Bin Aslam] dari ['Atha` Bin Yasar] dia berkata, saya mendengar [Abdullah Ash Shunabihi] berkata; Saya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya matahari terbit diantara dua tanduk syaitan, maka apabila dia terbit dia mengiringinya dan apabila dia meninggi dia meninggalkannya, dan mengiringinya tatkala tegak dan apabila tergelincir dia meninggalkannya. Maka lakukanlah sholat di selain pada tiga waktu ini.\" Telah menceritakan kepada kami [Abdurrazzaq] Telah menceritakan kepada kami [Ma'mar] dari [Abu Abdillah], dengan hadis matahari diatas."
            },
            {
                "number": 2362,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ أَخْبَرَنِي ابْنُ أَخِي أَبِي رُهْمٍ أَنَّهُ سَمِعَ أَبَا رُهْمٍ الْغِفَارِيَّ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِينَ بَايَعُوا تَحْتَ الشَّجَرَةِ يَقُولُغَزَوْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزْوَةَ تَبُوكَ فَلَمَّا فَصَلَ سَرَى لَيْلَةً فَسِرْتُ قَرِيبًا مِنْهُ وَأُلْقِيَ عَلَيَّ النُّعَاسُ فَطَفِقْتُ أَسْتَيْقِظُ وَقَدْ دَنَتْ رَاحِلَتِي مِنْ رَاحِلَتِهِ فَيُفْزِعُنِي دُنُوُّهَا خَشْيَةَ أَنْ أُصِيبَ رِجْلَهُ فِي الْغَرْزِ فَأُؤَخِّرُ رَاحِلَتِي حَتَّى غَلَبَتْنِي عَيْنِي فِي نِصْفِ اللَّيْلِ فَرَكِبَتْ رَاحِلَتِي رَاحِلَتَهُ وَرِجْلُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْغَرْزِ فَأَصَابَتْ رِجْلَهُ فَلَمْ أَسْتَيْقِظْ إِلَّا بِقَوْلِهِ حَسِّ فَرَفَعْتُ رَأْسِي فَقُلْتُ اسْتَغْفِرْ لِي يَا رَسُولَ اللَّهِ فَقَالَ سَلْ فَقَالَ فَطَفِقَ يَسْأَلُنِي عَمَّنْ تَخَلَّفَ مِنْ بَنِي غِفَارٍ فَأُخْبِرُهُ فَإِذَا هُوَ يَسْأَلُنِي مَا فَعَلَ النَّفَرُ الْحُمْرُ الطُّوَالُ الْقِطَاطُ أَوْ قَالَ الْقِصَارُ عَبْدُ الرَّزَّاقِ يَشُكُّ الَّذِينَ لَهُمْ نَعَمٌ بِشَظِيَّةِ شَرْخٍ قَالَ فَذَكَرْتُهُمْ فِي بَنِي غِفَارٍ فَلَمْ أَذْكُرْهُمْ حَتَّى ذَكَرْتُ رَهْطًا مِنْ أَسْلَمَ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا يَمْنَعُ أَحَدُ أُولَئِكَ حِينَ تَخَلَّفَ أَنْ يَحْمِلَ عَلَى بَعِيرٍ مِنْ إِبِلِهِ امْرَأً نَشِيطًا فِي سَبِيلِ اللَّهِ فَادْعُوا هَلْ أَنْ يَتَخَلَّفَ عَنْ الْمُهَاجِرِينَ مِنْ قُرَيْشٍ وَالْأَنْصَارِ وَأَسْلَمَ وَغِفَارٍحَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنْ صَالِحٍ قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي ابْنُ أَخِي أَبِي رُهْمٍ الْغِفَارِيِّ أَنَّهُ سَمِعَ أَبَا رُهْمٍ وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِينَ بَايَعُوا تَحْتَ الشَّجَرَةِ يَقُولُ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزْوَةَ تَبُوكَ فَنِمْتُ لَيْلَةً بِالْأَخْصَرِ فَسِرْتُ قَرِيبًا مِنْهُ فَذَكَرَ مَعْنَى حَدِيثِ مَعْمَرٍ إِلَّا أَنَّهُ قَالَ فَطَفِقْتُ أُؤَخِّرُ رَاحِلَتِي حَتَّى غَلَبَتْنِي عَيْنِي بَعْضَ اللَّيْلِ وَقَالَ مَا فَعَلَ النَّفَرُ السُّودُ الْجِعَادُ الْقِصَارُ الَّذِينَ لَهُمْ نَعَمٌ بِشَظِيَّةِ شَرْخٍ فَيَرَى أَنَّهُمْ مِنْ بَنِي غِفَارٍ حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَاقَ وَذَكَرَ ابْنُ شِهَابٍ عَنِ ابْنِ أُكَيْمَةَ اللَّيْثِيِّ عَنِ ابْنِ أَخِي أَبِي رُهْمٍ الْغِفَارِيِّ أَنَّهُ سَمِعَ أَبَا رُهْمٍ كُلْثُومَ بْنَ حُصَيْنٍ وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِينَ بَايَعُوا تَحْتَ الشَّجَرَةِ يَقُولُ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزْوَةَ تَبُوكَ فَذَكَرَ الْحَدِيثَ إِلَّا أَنَّهُ قَالَ فَطَفِقْتُ أُؤَخِّرُ رَاحِلَتِي عَنْهُ حَتَّى غَلَبَتْنِي عَيْنِي وَقَالَ مَا فَعَلَ النَّفَرُ السُّودُ الْجِعَادُ الْقِصَارُ قَالَ قُلْتُ وَاللَّهِ مَا أَعْرِفُ هَؤُلَاءِ مِنَّا حَتَّى قَالَ بَلَى الَّذِينَ لَهُمْ نَعَمٌ بِشَبَكَةِ شَرْخٍ قَالَ فَتَذَكَّرْتُهُمْ فِي بَنِي غِفَارٍ فَلَمْ أَذْكُرْهُمْ حَتَّى ذَكَرْتُ أَنَّهُمْ رَهْطٌ مِنْ أَسْلَمَ كَانُوا حِلْفًا فِينَا فَقُلْتُ يَا رَسُولَ اللَّهِ أُولَئِكَ رَهْطٌ مِنْ أَسْلَمَ كَانُوا حُلَفَاءَنَا",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] Telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] telah mengkhabarkan kepadaku [keponakan Abu Ruhm] bahwa ia mendengar [Abu Ruhm Al Ghifari] -dan ia termasuk salah seorang dari sahabat Nabi shallallahu 'alaihi wasallam yang ikut berbai'at dibawah pohon (Bai'atu Ridlwan) - berkata; Saya pernah bersama Rasulullah shallallahu 'alaihi wasallam pada perang Tabuk. Tatkala perjalanan membelah malam, aku berjalan dekat dengan beliau, tiba-tiba rasa kantuk menyerangku, maka aku bersegera bangun dan ternyata hewan tungganganku sudah mendekati hewan tunggangannya dan kedekatannya membuat aku terkejut. Karena khawatir kaki beliau yang ada di pelana terserempet maka aku mengakhirkan hewan tunggangankku sampai akhirnya mataku terkatup selama setengah malam. Dan ternyata hewan tungganganku menabrak hewan tunggangan beliau dan kaki beliau yang ada di pelana terserempet, dan aku tidak terbangun kecuali karena suara beliau yang merintih. Maka aku mengangkat kepalaku dan berkata, \"Mintalah ampun untukku wahai Rasulullah.\" Beliau bersabda: \"Mintalah.\" Kemudian beliau pun segera menanyakan orang-orang yang tidak ikut berperang dari Bani Ghifar, akupun memberitahukan kepada beliau dan ternyata beliau menanyakan kepadaku apa yang diperbuat oleh sekelompok orang hitam yang tinggi lagi berambut keriting, atau dia berkata: yang pendek -Abdurrazzaq ragu- yang mereka itu memiliki unta-unta di Syadziyatu Syarkhi. Dia melanjutkan; ' maka aku menyebutkan mereka dari Bani Ghifar, dan tidaklah aku menyebutkan mereka sehingga aku menyebutkan sekelompok orang dari Bani Aslam, dan aku berkata; \"Wahai Rasulullah apa yang mencegah salah seorang dari mereka ketika mereka tidak ikut berperang, untuk memberikan tunggangan diatas unta-unta mereka kepada seseorang yang sigap berada dijalan Allah sehingga mereka menyeru, apakah mereka hendak meninggalkan kaum Muhajirin dari Quraisy, kaum Anshar, Aslam dan Ghifar?\" Telah menceritakan kepada kami [Ya'qub] Telah menceritakan kepada kami [bapakku] dari [Shalih] [Ibnu Syihab] berkata; telah mengabarkan kepadaku [Ibnu Akhi Abu Ruhm Al Ghifari]  aku mendengar [Abu Ruhm] dan ia termasuk salah satu dari sahabat Nabi shallallahu 'alaihi wasallam yang ikut berbai'at dibawah pohon (Bai'atu Ridlwan) - berkata; Aku berperang bersama dengan Rasulullah shallallahu 'alaihi wasallam pada saat perang Tabuk. Suatu malam aku tidur di Akhsar, dan aku berjalan dekat beliau, lantas ia sebutkan makna hadis Ma'mar, hanya ia mengatakan dengan redaksi \"Maka aku lambatkan untaku hingga aku ketiduran sebagian malam, dan ia bertanya \"Apa yang dilakukan orang-orang hitam yang keriting dan cebol, yang mereka mempunyai unta di Syazhiyah Syarkh?, lantas ia lihat mereka dari bani ghifar. Telah menceritakan kepada kami [Ya'qub] Telah menceritakan kepada kami [bapakku] dari [Ibnu Ishaq] dan [Ibnu Syihab] menyebutkan dari [Ibnu Ukaimah Al Laitsi] dari [keponakan Abu Ruhm Al Ghifari] bahwasanya dia telah mendengar [Abu Ruhm] -dan ia termasuk salah satu dari sahabat Nabi shallallahu 'alaihi wasallam yang ikut berbai'at dibawah pohon (Bai'atu Ridlwan) - berkata; Aku berperang bersama dengan Rasulullah shallallahu 'alaihi wasallam pada saat perang Tabuk. Ia pun menyebutkan hadits. Hanya saja ia mengatakan; \"Maka aku bersegera melambatkan hewan tungganganku sampai akhirnya mataku tak kuat menahan kantuk di pertengahan malam.\" Dan dia juga mengatakan; \"Apa yang diperbuat sekelompok orang hitam yang berambut kriting dan pendek?\" dan dia berkata, \"Demi Allah, aku tidak tahu, kalau mereka dari kelompok kami.\" sampai dia berkata; \"Betul, mereka adalah orang-orang yang memiliki unta-unta di Syabakati Syarkhi.\" Ia berkata; Maka aku pun mengingat-ingat Bani Ghifar, namun saya tidak mengingat mereka. Namun akhirnya saya pun ingat, bahwa mereka adalah orang-orang yang mempunyai perjanjian dengan kami. Maka saya berkata, \"Wahai Rasulullah, mereka adalah sekelompok orang dari Bani Aslam dan mereka adalah para sekutu kami.\""
            },
            {
                "number": 2363,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ثَوْرٍ قَالَ حَدَّثَنِي رَاشِدُ بْنُ سَعْدٍ عَنْ عَبْدِ اللَّهِ بْنِ لُحَيٍّ عَنْ عَبْدِ اللَّهِ بْنِ قُرْطٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَعْظَمُ الْأَيَّامِ عِنْدَ اللَّهِ يَوْمُ النَّحْرِ ثُمَّ يَوْمُ النَّفْرِ وَقُرِّبَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسُ بَدَنَاتٍ أَوْ سِتٌّ يَنْحَرُهُنَّ فَطَفِقْنَ يَزْدَلِفْنَ إِلَيْهِ أَيَّتُهُنَّ يَبْدَأُ بِهَا فَلَمَّا وَجَبَتْ جُنُوبُهَا قَالَ كَلِمَةً خَفِيَّةً لَمْ أَفْهَمْهَا فَسَأَلْتُ بَعْضَ مَنْ يَلِينِي مَا قَالَ قَالُوا قَالَ مَنْ شَاءَ اقْتَطَعَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Tsaur] ia berkata; telah menceritakan kepadaku [Rasyid Bin Sa'd] dari [Abdullah bin Luhay] dari [Abdullah bin Qurth] bahwasanya; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hari-hari yang paling agung disisi Allah adalah hari Nahr (hari-hari penyembelihan hewan kurban), kemudian hari An Nafr (yakni saat-saat kembali dari Mina ke Madinah).\" Kemudian didekatlan kepada Rasulullah shallallahu 'alaihi wasallam lima atau enam Badanaat (Unta atau sapi yang disembelih di Mekah) untuk beliau sembelih, "
            },
            {
                "number": 2364,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ عَنْ بَكْرِ بْنِ زُرْعَةَ الْخَوْلَانِيِّ عَنْ مُسْلِمِ بْنِ عَبْدِ اللَّهِ الْأَزْدِيِّ قَالَجَاءَ عَبْدُ اللَّهِ بْنُ قُرْطٍ الْأَزْدِيُّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْتَ عَبْدُ اللَّهِ بْنُ قُرْطٍ",
                "id": "Telah menceritakan kepada kami [Abul Yaman] Telah menceritakan kepada kami [Isma'il bin Ayyasy] dari [Bakr bin Zur'ah Al Khaulani] dari [Muslim bin Abdullah Al Azdi] ia berkata; Abdulah bin Qurth Al Azdi datang menghadap Rasulullah shallallahu 'alaihi wasallam, maka Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Kamu adalah Abdulah bin Qurth.\""
            },
            {
                "number": 2365,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو أَخْبَرَنَا أَبُو كَثِيرٍ مَوْلَى اللَّيْثِيِّينَ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ جَحْشٍأَنَّ رَجُلًا جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا لِي يَا رَسُولَ اللَّهِ إِنْ قُتِلْتُ فِي سَبِيلِ اللَّهِ قَالَ الْجَنَّةُ قَالَ فَلَمَّا وَلَّى قَالَ إِلَّا الدَّيْنَ سَارَّنِي بِهِ جِبْرِيلُ عَلَيْهِ السَّلَام آنِفًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Bisyr] Telah menceritakan kepada kami [Muhammad bin Amr] telah mengabarkan kepada kami [Abu Katsir] bekas budak Al Laitsiyyin, dari [Muhammad bin Abdullah bin Jahsy] bahwa seorang laki-laki mendatangi Nabi shallallahu 'alaihi wasallam dan bertanya, \"Ganjaran apakah bagiku wahai Rasululah, jika aku terbunuh di jalan Allah?\" beliau menjawab, \"Yaitu surga.\" Ketika laki-laki itu berpaling beliau melanjutkan: \"Kecuali (kamu masih memiliki) hutang. Jibril telah membisikiku tadi.\""
            },
            {
                "number": 2366,
                "arab": "حَدَّثَنَا خَلَفُ بْنُ الْوَلِيدِ حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي كَثِيرٍ مَوْلَى الْهِلَالِيِّينَ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ جَحْشٍ عَنْ أَبِيهِ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ مَاذَا لِي إِنْ قَاتَلْتُ فِي سَبِيلِ اللَّهِ حَتَّى أُقْتَلَ قَالَ الْجَنَّةُ قَالَ فَلَمَّا وَلَّى قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا الدَّيْنَ سَارَّنِي بِهِ جِبْرِيلُ عَلَيْهِ السَّلَام",
                "id": "Telah menceritakan kepada kami [Khalaf bin Al Walid] Telah menceritakan kepada kami [Abbad bin Abbad] Telah menceritakan kepada kami [Muhammad bin Amru] dari [Abu Katsir] bekas budak Al Hilaliyyin, dari [Muhammad bin Abdullah bin Jahsy] dari [bapaknya] ia berkata; Seorang laki-laki menemui Nabi shallallahu 'alaihi wasallam dan bertanya, \"Wahai Rasulullah, ganjaran apakah untukku, jika aku berperang di jalan Allah hingga terbunuh?\" beliau menjawab: \"Yaitu surga.\" Ketika laki-laki itu berpaling, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kecuali (jika kamu masih memiliki tanggungan) hutang. Jibril 'Alaihis Salam telah membisikkannya padaku.\""
            },
            {
                "number": 2367,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَزْهَرَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَخَلَّلُ النَّاسَ يَوْمَ حُنَيْنٍ يَسْأَلُ عَنْ مَنْزِلِ خَالِدِ بْنِ الْوَلِيدِ فَأُتِيَ بِسَكْرَانَ فَأَمَرَ مَنْ كَانَ مَعَهُ أَنْ يَضْرِبُوهُ بِمَا كَانَ فِي أَيْدِيهِمْ",
                "id": "Telah menceritakan kepada kami [Zaid bin Al Hubbab] Telah menceritakan kepada kami [Usamah bin Zaid] ia berkata, telah menceritakan kepadaku [Az Zuhri] dari [Abdurrahman bin Azhar] ia berkata; \"Saya melihat Rasulullah shallallahu 'alaihi wasallam berjalan di tengah-tengah manusia pada hari Hunain seraya menanyakan kediaman Khalid bin Al Walid. Kemudian didatangkanlah seorang peminum khamer (pemabuk), maka beliau pun memerintahkan orang-orang yang bersamanya untuk memukulinya dengan benda apa saja yang ada di tangan mereka.\""
            },
            {
                "number": 2368,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ عَنِ الزُّهْرِيِّ أَنَّهُ سَمِعَ عَبْدَ الرَّحْمَنِ بْنَ أَزْهَرَ يَقُولُرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزَاةَ الْفَتْحِ وَأَنَا غُلَامٌ شَابٌّ يَتَخَلَّلُ النَّاسَ يَسْأَلُ عَنْ مَنْزِلِ خَالِدِ بْنِ الْوَلِيدِ فَأُتِيَ بِشَارِبٍ فَأَمَرَ بِهِ فَضَرَبُوهُ بِمَا فِي أَيْدِيهِمْ فَمِنْهُمْ مَنْ ضَرَبَهُ بِنَعْلِهِ وَمِنْهُمْ مَنْ ضَرَبَهُ بِعَصًا وَمِنْهُمْ مَنْ ضَرَبَهُ بِسَوْطٍ وَحَثَا عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التُّرَابَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Umar] Telah menceritakan kepada kami [Usamah bin Zaid] dari [Az Zuhri] bahwa ia mendengar [Abdurrahman bin Azhar] berkata; Saya melihat Rasulullah shallallahu 'alaihi wasallam pada saat perang Fathu Makkah. Dan saat itu saya masih anak muda belia. Beliau berjalan di tengah-tengah manusia seraya menanyakan kediaman Khalid bin Al Walid. Kemudian didatangkanlah seorang peminum khamer, dan beliau pun memerintahkannya (untuk menghukumnya). Maka mereka pun memukulinya dengan benda-benda yang ada pada tangan mereka. di antara mereka ada yang memukul dengan sendalnya, ada yang memukul dengan tongkat dan ada juga yang memukul dengan cambuk. Dan Rasulullah shallallahu 'alaihi wasallam melemparinya dengan pasir."
            }
        ]
    }
}