{
    "status": true,
    "data": {
        "start": 6028,
        "end": 6174,
        "total": 147,
        "book": "bukhari",
        "hadits": [
            {
                "number": 6028,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ فِرَاسٍ عَنْ الشَّعْبِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْكَبَائِرُ الْإِشْرَاكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ أَوْ قَالَ الْيَمِينُ الْغَمُوسُشَكَّ شُعْبَةُ وَقَالَ مُعَاذٌ حَدَّثَنَا شُعْبَةُ قَالَ الْكَبَائِرُ الْإِشْرَاكُ بِاللَّهِ وَالْيَمِينُ الْغَمُوسُ وَعُقُوقُ الْوَالِدَيْنِ أَوْ قَالَ وَقَتْلُ النَّفْسِ",
                "id": "Telah menceritakan kepadaku [Muhammad bin Basysyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Firas] dari [Asy Sya'bi] dari [Abdullah bin Amru] dari Nabi shallallahu 'alaihi wasallam bersabda; \"Diantara dosa besar adalah, menyekutukan Allah, durhaka kepada orang tua, -atau ia mengatakan - sumpah dusta.\" Syu'bah ragu kepastian redaksinya. Dan [Mu'adz] mengatakan telah menceritakan kepada kami [Syu'bah] mengatakan; Dosa besar ialah menyekutukan Allah, sumpah dusta, dan durhaka kepada orang tua. Atau ia mengatakan; dan membunuh orang."
            },
            {
                "number": 6029,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي بَكْرٍ سَمِعَ أَنَسَ بْنَ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْكَبَائِرُ ح و حَدَّثَنَا عَمْرٌو وَهُوَ ابْنُ مَرْزُوقٍ حَدَّثَنَا شُعْبَةُ عَنْ ابْنِ أَبِي بَكْرٍ عَنْ أَنَسِ بْنِ مَالِكٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَكْبَرُ الْكَبَائِرِ الْإِشْرَاكُ بِاللَّهِ وَقَتْلُ النَّفْسِ وَعُقُوقُ الْوَالِدَيْنِ وَقَوْلُ الزُّورِ أَوْ قَالَ وَشَهَادَةُ الزُّورِ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] telah menceritakan kepada kami ['Abdushshamad] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami ['ubaidhullah bin Abi Bakr] ia mendengar [Anas bin Malik] radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam bersabda: \"dosa-dosa besar yaitu\" -lewat jalur periwayatan lain-Telah menceritakan kepada kami ['Amru] tepatnya Amru bin Marzuq, telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Ibnu Abi Bakar], dari [Anas bin Malik] radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam bersabda; \"Dosa paling besar diantara dosa besar ialah menyekutukan Allah, membunuh, durhaka kepada orang tua, ucapan dusta, \" atau beliau mengatakan; \"persaksian dusta.\""
            },
            {
                "number": 6030,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا حُصَيْنٌ حَدَّثَنَا أَبُو ظَبْيَانَ قَالَ سَمِعْتُ أُسَامَةَ بْنَ زَيْدِ بْنِ حَارِثَةَ رَضِيَ اللَّهُ عَنْهُمَا يُحَدِّثُ قَالَبَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْحُرَقَةِ مِنْ جُهَيْنَةَ قَالَ فَصَبَّحْنَا الْقَوْمَ فَهَزَمْنَاهُمْ قَالَ وَلَحِقْتُ أَنَا وَرَجُلٌ مِنْ الْأَنْصَارِ رَجُلًا مِنْهُمْ قَالَ فَلَمَّا غَشِينَاهُ قَالَ لَا إِلَهَ إِلَّا اللَّهُ قَالَ فَكَفَّ عَنْهُ الْأَنْصَارِيُّ فَطَعَنْتُهُ بِرُمْحِي حَتَّى قَتَلْتُهُ قَالَ فَلَمَّا قَدِمْنَا بَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقَالَ لِي يَا أُسَامَةُ أَقَتَلْتَهُ بَعْدَ مَا قَالَ لَا إِلَهَ إِلَّا اللَّهُ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا كَانَ مُتَعَوِّذًا قَالَ أَقَتَلْتَهُ بَعْدَ مَا قَالَ لَا إِلَهَ إِلَّا اللَّهُ قَالَ فَمَا زَالَ يُكَرِّرُهَا عَلَيَّ حَتَّى تَمَنَّيْتُ أَنِّي لَمْ أَكُنْ أَسْلَمْتُ قَبْلَ ذَلِكَ الْيَوْمِ",
                "id": "Telah menceritakan kepada kami ['Amru bin Zurarah] telah menceritakan kepada kami [Husyaim] telah menceritakan kepada kami [Hushain] telah menceritakan kepada kami [Abu Dhibyan] mengatakan, aku mendengar [Usamah bin Zaid bin haritsah] radliallahu 'anhuma menceritakan dengan mengatakan; 'Rasulullah Shallallahu'alaihiwasallam mengutus kami ke perkampungan Hurqah di bani Juhainah. Kami menyerang mereka di pagi buta dan menjadikan mereka kocar kacir. Saya dan seorang laki-laki anshar berhasil menemukan seseorang dari mereka. Tatkala kami bisa mengepung, ia tiba-tiba mengatakan; 'laa-ilaaha-illallah.' Si laki-laki anshar menahan penyerbuannya, sedang aku meneruskannya hingga kubunuh orang itu. Ketika kami pulang, peristiwa ini disampaikan kepada Nabi shallallahu 'alaihi wasallam sehingga beliau berujar kepadaku: \"Apakah kamu membunuhnya setelah ia mengucapkan laa-ilaaha-illallah?\" Kujawab; 'betul, Ya Rasulullah, ia mengucapkannya hanya sekedar mencari keselamatan.' Nabi melanjutkan: \"Apakah kamu membunuhnya setelah ia mengucapkan laa-ilaaha-illallah?\" Nabi berulangkali menegurku dengan ucapan ini hingga aku mengandai-andai kalaulah aku belum masuk Islam sebelum itu."
            },
            {
                "number": 6031,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ حَدَّثَنَا اللَّيْثُ حَدَّثَنَا يَزِيدُ عَنْ أَبِي الْخَيْرِ عَنْ الصُّنَابِحِيِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِ رَضِيَ اللَّهُ عَنْهُ قَالَإِنِّي مِنْ النُّقَبَاءِ الَّذِينَ بَايَعُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَايَعْنَاهُ عَلَى أَنْ لَا نُشْرِكَ بِاللَّهِ شَيْئًا وَلَا نَسْرِقَ وَلَا نَزْنِيَ وَلَا نَقْتُلَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ وَلَا نَنْتَهِبَ وَلَا نَعْصِيَ بِالْجَنَّةِ إِنْ فَعَلْنَا ذَلِكَ فَإِنْ غَشِينَا مِنْ ذَلِكَ شَيْئًا كَانَ قَضَاءُ ذَلِكَ إِلَى اللَّهِ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] telah menceritakan kepada kami [Al Laits] telah menceritakan kepada kami [Yazid] dari [Abul khair] dari [Ash Shunabihi] dari ['Ubadah bin Ash Shamit] radliallahu 'anhu mengatakan; \"Saya diantara pemuka masyarakat yang berbait kepada Rasulullah Shallallahu'alaihiwasallam, kami berbaiat kepadanya untuk tidak menyekutukan Allah dengan sesuatu apapun, tidak mencuri, tidak berzina, dan tidak membunuh jiwa yang Allah haramkan, tidak merampok, kami memperoleh surga jika melakukan janji setia ini, namun jika melanggar satu perkara itu, keputusannya terserah Allah.\""
            },
            {
                "number": 6032,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ حَدَّثَنَا جُوَيْرِيَةُ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَاعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَمَلَ عَلَيْنَا السِّلَاحَ فَلَيْسَ مِنَّارَوَاهُ أَبُو مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Musa bin Ismail] telah menceritakan kepada kami [Juwairiyah] dari [Nafi'] dari [Abdullah bin Umar] radliallahu 'anhuma dari Nabi shallallahu 'alaihi wasallam bersabda; \"Barangsiapa yang menghunuskan kepada kami, maka bukan golongan kami.\" Abu Musa meriwayatkannya dari Nabi shallallahu 'alaihi wasallam."
            },
            {
                "number": 6033,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا أَيُّوبُ وَيُونُسُ عَنْ الْحَسَنِ عَنْ الْأَحْنَفِ بْنِ قَيْسٍ قَالَذَهَبْتُ لِأَنْصُرَ هَذَا الرَّجُلَ فَلَقِيَنِي أَبُو بَكْرَةَ فَقَالَ أَيْنَ تُرِيدُ قُلْتُ أَنْصُرُ هَذَا الرَّجُلَ قَالَ ارْجِعْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا الْتَقَى الْمُسْلِمَانِ بِسَيْفَيْهِمَا فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ قُلْتُ يَا رَسُولَ اللَّهِ هَذَا الْقَاتِلُ فَمَا بَالُ الْمَقْتُولِ قَالَ إِنَّهُ كَانَ حَرِيصًا عَلَى قَتْلِ صَاحِبِهِ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Mubarak] telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Ayyub] dan [Yunus] dari [Al Hasan] dari [Al Ahnaf bin Qais] mengatakan; 'aku berangkat untuk membantu lelaki ini, (di tengah perjalanan) [Abu Bakrah] memergokiku dan bertanya; 'mau kemana kau? ' Saya menjawab; 'untuk menolong orang ini.' Abu Bakrah berkata; Pulang saja kamu. Sebab aku mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Jika dua orang muslim bertemu dengan menghunuskan pedangnya, maka si pembunuh dan yang dibunuh sama-sama di neraka.\" Saya bertanya; 'Ya Rasulullah, saya maklum terhadap si pembunuh, lantas apa dosa yang dibunuh? ' Nabi menjawab: \"sesungguhnya dia juga berkeinginan keras membunuh kawannya.\""
            },
            {
                "number": 6034,
                "arab": "حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُأَنَّ يَهُودِيًّا رَضَّ رَأْسَ جَارِيَةٍ بَيْنَ حَجَرَيْنِ فَقِيلَ لَهَا مَنْ فَعَلَ بِكِ هَذَا أَفُلَانٌ أَوْ فُلَانٌ حَتَّى سُمِّيَ الْيَهُودِيُّ فَأُتِيَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَزَلْ بِهِ حَتَّى أَقَرَّ بِهِ فَرُضَّ رَأْسُهُ بِالْحِجَارَةِ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Anas bin Malik] radliallahu 'anhu, ada seorang yahudi menumbuk kepala seorang budak perempuan dengan dua batu. Maka budak perempuan tersebut ditanya; 'sebutkan siapa yang mencederaimu, apakah yang melakukannya fulan, fulan? ' hingga disebut nama seorang yahudi.' Maka orang yahudi itu lantas dihadapkan ke Nabi shallallahu 'alaihi wasallam. Nabi tiada henti menginterogasinya hingga ia mengakui, kemudian Nabi mengqisasnya dengan meretakkan kepalanya dengan batu."
            },
            {
                "number": 6035,
                "arab": "حَدَّثَنَا مُحَمَّدٌ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ شُعْبَةَ عَنْ هِشَامِ بْنِ زَيْدِ بْنِ أَنَسٍ عَنْ جَدِّهِ أَنَسِ بْنِ مَالِكٍ قَالَخَرَجَتْ جَارِيَةٌ عَلَيْهَا أَوْضَاحٌ بِالْمَدِينَةِ قَالَ فَرَمَاهَا يَهُودِيٌّ بِحَجَرٍ قَالَ فَجِيءَ بِهَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِهَا رَمَقٌ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فُلَانٌ قَتَلَكِ فَرَفَعَتْ رَأْسَهَا فَأَعَادَ عَلَيْهَا قَالَ فُلَانٌ قَتَلَكِ فَرَفَعَتْ رَأْسَهَا فَقَالَ لَهَا فِي الثَّالِثَةِ فُلَانٌ قَتَلَكِ فَخَفَضَتْ رَأْسَهَا فَدَعَا بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَتَلَهُ بَيْنَ الْحَجَرَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad] telah mengabarkan kepada kami [Abdullah bin Idris] dari [Syu'bah] dari [Hisyam bin Zaid bin Anas] dari [kakeknya, anas bin Malik] mengatakan, seorang hamba sahaya Madinah keluar dengan menggunakan anting-anting, lantas seorang laki-laki yahudi melemparnya dengan batu. Si yahudi lantas diringkus dan diseret ke hadapan Nabi shallallahu 'alaihi wasallam yang ketika itu si hamba sahaya tinggal menyisakan sisa-sisa nyawanya. Rasulullah Shallallahu'alaihiwasallam bertanya; 'Apakah fulan yang membunuhmu? ' Si hamba sahaya menjawab; 'tidak' dengan menggelengkan kepalanya. Nabi kembali menanyainya; 'Apakah fulan yang membunuhmu? ' Kembali ia menjawab; 'tidak' dengan menggelengkan kepalanya. Untuk kali ketiganya Nabi bertanya; 'Apakah yang membunuhmu fula? ' Si hamba sahaya mengiyakan dengan menundukkan kepalanya. Nabi terus meminta si yahudi didatangkan, dan beliau membunuhnya dengan menjepitnya diantara dua batu."
            },
            {
                "number": 6036,
                "arab": "حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ إِلَّا بِإِحْدَى ثَلَاثٍ النَّفْسُ بِالنَّفْسِ وَالثَّيِّبُ الزَّانِي وَالْمَارِقُ مِنْ الدِّينِ التَّارِكُ لِلْجَمَاعَةِ",
                "id": "Telah menceritakan kepada kami [Umar bin Hafsh], telah menceritakan kepada kami [bapakku], telah menceritakan kepada kami [Al A'masy], dari ['Abdullah bin Murrah] dari [Masruq] dari [Abdullah] mengatakan Rasulullah shallallahu 'alaihi wasallam bersabda: \"darah seorang muslim yang telah bersyahadat laa-ilaaha-illallah dan mengakui bahwa aku utusan Allah terlarang ditumpahkan selain karena alasan diantara tiga; membunuh, berzina dan dia telah menikah, dan meninggalkan agama, meninggalkan jamaah muslimin.\""
            },
            {
                "number": 6037,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ هِشَامِ بْنِ زَيْدٍ عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُأَنَّ يَهُودِيًّا قَتَلَ جَارِيَةً عَلَى أَوْضَاحٍ لَهَا فَقَتَلَهَا بِحَجَرٍ فَجِيءَ بِهَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِهَا رَمَقٌ فَقَالَ أَقَتَلَكِ فُلَانٌ فَأَشَارَتْ بِرَأْسِهَا أَنْ لَا ثُمَّ قَالَ الثَّانِيَةَ فَأَشَارَتْ بِرَأْسِهَا أَنْ لَا ثُمَّ سَأَلَهَا الثَّالِثَةَ فَأَشَارَتْ بِرَأْسِهَا أَنْ نَعَمْ فَقَتَلَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِحَجَرَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Hisyam bin Zaid] dari [Anas] radliallahu 'anhu, seorang laki-laki yahudi membunuh hamba sahaya karena ingin merampas anting-antingnya. Ia membunuhnya dengan batu. Si hamba sahaya dibawa ke hadapan Nabi shallallahu 'alaihi wasallam dengan sisa-sisa nyawanya. Nabi bertanya; \"Apakah yang membunuhmu fulan?\" Ia menjawab tidak dengan mengisyaratkan kepalanya. Nabi mengulang pertanyaannya: \"Apakah yang membunuhmu fulan?\" Ia menjawab tidak dengan mengisyaratkan kepalanya. Nabi bertanya lagi untuk kali ketiganya: \"Apakah yang membunuhmu fulan?\" ia menjawab 'iya.' Maka Nabi membunuh si yahudi dengan menjepitnya diantara dua batu."
            },
            {
                "number": 6038,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَيْبَانُ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ خُزَاعَةَ قَتَلُوا رَجُلًا وَقَالَ عَبْدُ اللَّهِ بْنُ رَجَاءٍ حَدَّثَنَا حَرْبٌ عَنْ يَحْيَى حَدَّثَنَا أَبُو سَلَمَةَ حَدَّثَنَا أَبُو هُرَيْرَةَأَنَّهُ عَامَ فَتْحِ مَكَّةَ قَتَلَتْ خُزَاعَةُ رَجُلًا مِنْ بَنِي لَيْثٍ بِقَتِيلٍ لَهُمْ فِي الْجَاهِلِيَّةِ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ اللَّهَ حَبَسَ عَنْ مَكَّةَ الْفِيلَ وَسَلَّطَ عَلَيْهِمْ رَسُولَهُ وَالْمُؤْمِنِينَ أَلَا وَإِنَّهَا لَمْ تَحِلَّ لِأَحَدٍ قَبْلِي وَلَا تَحِلُّ لِأَحَدٍ بَعْدِي أَلَا وَإِنَّمَا أُحِلَّتْ لِي سَاعَةً مِنْ نَهَارٍ أَلَا وَإِنَّهَا سَاعَتِي هَذِهِ حَرَامٌ لَا يُخْتَلَى شَوْكُهَا وَلَا يُعْضَدُ شَجَرُهَا وَلَا يَلْتَقِطُ سَاقِطَتَهَا إِلَّا مُنْشِدٌ وَمَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِمَّا يُودَى وَإِمَّا يُقَادُ فَقَامَ رَجُلٌ مِنْ أَهْلِ الْيَمَنِ يُقَالُ لَهُ أَبُو شَاهٍ فَقَالَ اكْتُبْ لِي يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اكْتُبُوا لِأَبِي شَاهٍ ثُمَّ قَامَ رَجُلٌ مِنْ قُرَيْشٍ فَقَالَ يَا رَسُولَ اللَّهِ إِلَّا الْإِذْخِرَ فَإِنَّمَا نَجْعَلُهُ فِي بُيُوتِنَا وَقُبُورِنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا الْإِذْخِرَوَتَابَعَهُ عُبَيْدُ اللَّهِ عَنْ شَيْبَانَ فِي الْفِيلِ قَالَ بَعْضُهُمْ عَنْ أَبِي نُعَيْمٍ الْقَتْلَ وَقَالَ عُبَيْدُ اللَّهِ إِمَّا أَنْ يُقَادَ أَهْلُ الْقَتِيلِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syaiban] dari [Yahya] dari [Abu Salamah] dari [Abu Hurairah]; bani Khuza'ah membunuh seorang laki-laki. Sedang [Abdullah bin Raja'] mengatakan; telah menceritakan kepada kami [Harb] dari [Yahya] telah menceritakan kepada kami [Abu Salamah] telah menceritakan kepada kami [Abu Hurairah]; ketika tahun pembebasan Makkah bani Khuza'ah membunuh seorang laki-laki dari bani Laits sebagai pembalasan mereka yang dibunuh semasa masih jahiliyah. Serta merta Rasulullah Shallallahu'alaihiwasallam berdiri dan menyampaikan pidato; \"Allah telah menahan pasukan gajah dari Makkah ini, dan menguasakan rasul-NYA dan orang-orang mukmin untuk mengalahkan mereka, ketahuilah, bahwasanya Makkah tidak dihalalkan bagi siapa pun baik sebelum maupun sesudahku, hanyasanya dihalalkan bagiku beberapa saat siang saja, Ketahuilah, bahwasanya Makkah pada saatku sekarang ini telah haram, durinya tidak boleh dipatahkan dan pohonnya tidak boleh ditebang, barang temuannya tidak boleh diambil kecuali orang yang hendak mengumumkannya, dan barangsiapa menjadi wali korban pembunuhan, baginya dua pilihan, ia diberi diyat atau diberi kesempatan untuk membalas qisas.\" Lantas berdirilah seorang laki-laki penduduk yaman yang dikenal dengan nama Abu Syah dan mengatakan; 'Tuliskan untukku Ya Rasulullah! ' Rasulullah Shallallahu'alaihiwasallam mengatakan; \"tuliskanlah untuk Abu Syah.\" Kemudian ada laki-laki dari Qurasy berdiri dan mengatakan; 'Ya Rasulullah, selain idzkhir, sebab rumput idzkhir sering kami manfaatkan untuk kuburan dan rumah kami.' Rasulullah Shallallahu'alaihiwasallam menjawab; \"kecuali idzkhir.\" hadits ini diperkuat oleh ['ubaidhullah] dari [Syaiban] tentang gajah, dan sebagian mereka dari [Abu Nu'aim] mengatakan dengan redaksi baginya kesempatan membunuh balasan. Sedang ubaidhullah mengatakan dengan redaksi atau keluarga terbunuh diberi diyat."
            },
            {
                "number": 6039,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَكَانَتْ فِي بَنِي إِسْرَائِيلَ قِصَاصٌ وَلَمْ تَكُنْ فِيهِمْ الدِّيَةُ فَقَالَ اللَّهُ لِهَذِهِ الْأُمَّةِ{ كُتِبَ عَلَيْكُمْ الْقِصَاصُ فِي الْقَتْلَى }إِلَى هَذِهِ الْآيَةِ{ فَمَنْ عُفِيَ لَهُ مِنْ أَخِيهِ شَيْءٌ }قَالَ ابْنُ عَبَّاسٍ فَالْعَفْوُ أَنْ يَقْبَلَ الدِّيَةَ فِي الْعَمْدِ قَالَ{ فَاتِّبَاعٌ بِالْمَعْرُوفِ }أَنْ يَطْلُبَ بِمَعْرُوفٍ وَيُؤَدِّيَ بِإِحْسَانٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Sufyan] dari ['Amru] dari [Mujahid] dari [Ibnu 'Abbas] radliallahu 'anhuma mengatakan; 'Di kalangan bani israil hanya berlaku hukum qisas dan tidak ada hukum tebusan (diyat), sehingga Allah menurunkan ayat ini 'Diwajibkan atas kalian qisas dalam pembunuhan (QS. ALbaqarah 178) Hingga ayat ini; kecuali jika ia mendapat pemaafan dari saudara (QS. Albaqarah 178), kata Ibn Abbas; istilah maaf maksudnya menerima diyat secara tulus. Dan Ibnu Abbas berkata perihal kutipan ayat; 'fattibaa'un bil ma'ruuf (Maka hendaklah ia mengikutinya dengan baik), ' maksudnya hendaklah betu-betul meminta maaf dan melakukannya dengan sebaik-baiknya."
            },
            {
                "number": 6040,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي حُسَيْنٍ حَدَّثَنَا نَافِعُ بْنُ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبْغَضُ النَّاسِ إِلَى اللَّهِ ثَلَاثَةٌ مُلْحِدٌ فِي الْحَرَمِ وَمُبْتَغٍ فِي الْإِسْلَامِ سُنَّةَ الْجَاهِلِيَّةِ وَمُطَّلِبُ دَمِ امْرِئٍ بِغَيْرِ حَقٍّ لِيُهَرِيقَ دَمَهُ",
                "id": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari ['Abdullah bin Abu Husain] telah menceritakan kepada kami [Nafi' bin Jubair] dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Manusia yang paling dimurkai Allah ada tiga, Orang yang melakukan pelanggaran di tanah haram, orang yang mencari-cari perilaku jahiliyah padahal telah masuk Islam, dan memburu darah seseorang tanpa alasan yang dibenarkan untuk menumpahkan darahnya.\""
            },
            {
                "number": 6041,
                "arab": "حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ هُزِمَ الْمُشْرِكُونَ يَوْمَ أُحُدٍ ح و حَدَّثَنِي مُحَمَّدُ بْنُ حَرْبٍ حَدَّثَنَا أَبُو مَرْوَانَ يَحْيَى بْنُ أَبِي زَكَرِيَّاءَ يَعْنِي الْوَاسِطِيَّ عَنْ هِشَامٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْصَرَخَ إِبْلِيسُ يَوْمَ أُحُدٍ فِي النَّاسِ يَا عِبَادَ اللَّهِ أُخْرَاكُمْ فَرَجَعَتْ أُولَاهُمْ عَلَى أُخْرَاهُمْ حَتَّى قَتَلُوا الْيَمَانِ فَقَالَ حُذَيْفَةُ أَبِي أَبِي فَقَتَلُوهُ فَقَالَ حُذَيْفَةُ غَفَرَ اللَّهُ لَكُمْ قَالَ وَقَدْ كَانَ انْهَزَمَ مِنْهُمْ قَوْمٌ حَتَّى لَحِقُوا بِالطَّائِفِ",
                "id": "Telah menceritakan kepada kami [Farwah bin Abil Maghra'] telah menceritakan kepada kami ['Ali bin Mushir] dari [Hisyam] dari [Ayahnya] dari [Aisyah]; kaum musyrikin lari tunggang langgang dalam perang Uhud -lewat jalur periwayatan lain-- telah menceritakan kepadaku [Muhammad bin harb] telah menceritakan kepada kami [Abu marwan Yahya bin Abi Zakariya alias Al Wasthi] dari [Hisyam] dari ['Urwah] dari [Aisyah] radliallahu 'anhuma mengatakan; Pada hari Uhud Iblis berteriak ditengah-tengah pasukan musuh seraya mengatakan; 'wahai hanba-hamba Allah, awas barisan belakang kalian, ' sehingga pasukan depan berbalik ke belakang sehingga mereka membunuh Al Yaman, dan Khudzaifah berteriak-teriak; 'itu ayahku, itu ayahku! ' lantas Khudzaifah mengatakan; 'Kiranya Allah mengampuni kalian.' kaum musyrikin lari tunggang langgang hingga diantara mereka ada yang lari ke Thaif."
            },
            {
                "number": 6042,
                "arab": "حَدَّثَنِي إِسْحَاقُ أَخْبَرَنَا حَبَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍأَنَّ يَهُودِيًّا رَضَّ رَأْسَ جَارِيَةٍ بَيْنَ حَجَرَيْنِ فَقِيلَ لَهَا مَنْ فَعَلَ بِكِ هَذَا أَفُلَانٌ أَفُلَانٌ حَتَّى سُمِّيَ الْيَهُودِيُّ فَأَوْمَأَتْ بِرَأْسِهَا فَجِيءَ بِالْيَهُودِيِّ فَاعْتَرَفَ فَأَمَرَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُضَّ رَأْسُهُ بِالْحِجَارَةِ وَقَدْ قَالَ هَمَّامٌ بِحَجَرَيْنِ",
                "id": "Telah menceritakan kepadaku [Ishaq] telah mengabarkan kepada kami [Habban] telah menceritakan kepada kami [Hammam] telah mengabarkan kepada kami [Qatadah] telah menceritakan kepada kami [Anas bin Malik], ada seorang yahudi meretakkan hamba sahaya dengan menjepit diantara dua batu. Si hamba sahaya ditanya; 'sebutkan siapa yang membunuhmu, apakah fulan dan fulan, ' hingga disebutlah nama seorang yahudi, dan si hamba sahaya mengiyakan dengan mengisyaratkan kepalanya. Si yahudi ditahan dan mengakui perbuatannya. Nabi shallallahu 'alaihi wasallam memerintahkan agar si yahudi diseret kepadanya dan beliau memecah kepalanya dengan batu. Sedang Hamam mengatakan dengan redaksi; 'dengan dua batu'."
            },
            {
                "number": 6043,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَتَلَ يَهُودِيًّا بِجَارِيَةٍ قَتَلَهَا عَلَى أَوْضَاحٍ لَهَا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas bin Malik] radliallahu 'anhu; bahwasanya Nabi Shallallahu'alaihi wasallam pernah membunuh seorang yahudi karena membunuh hamba sahaya yang ingin ia rampas anting-antingnya."
            },
            {
                "number": 6044,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَلِيِّ بْنِ بَحْرٍ حَدَّثَنَا يَحْيَى حَدَّثَنَا سُفْيَانُ حَدَّثَنَا مُوسَى بْنُ أَبِي عَائِشَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْلَدَدْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَرَضِهِ فَقَالَ لَا تُلِدُّونِي فَقُلْنَا كَرَاهِيَةُ الْمَرِيضِ لِلدَّوَاءِ فَلَمَّا أَفَاقَ قَالَ لَا يَبْقَى أَحَدٌ مِنْكُمْ إِلَّا لُدَّ غَيْرَ الْعَبَّاسِ فَإِنَّهُ لَمْ يَشْهَدْكُمْ",
                "id": "Telah menceritakan kepada kami [Amru bin Ali bin Bahr] telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Musa bin Abi Aisyah] dari [ubaidhullah bin Abdillah] dari [Aisyah] radliallahu 'anha, mengatakan; Pernah kami memasukkan obat di mulut Nabi shallallahu 'alaihi wasallam ketika sakitnya, namun beliau berpesan: \"Janganlah kalian memasukkan obat dalam mulutku!\" Kami hanya saling mengatakan; 'Itu hanyalah kebiasaan orang sakit yang enggan minum obat'. Ketika beliau sadar, beliau bersabda: \"Tidak ada diantara kalian kecuali mulutnya harus diminumi obat, kecuali Abbas, sebab ia tidak ikut serta bersama kalian.\""
            },
            {
                "number": 6045,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ حَدَّثَنَا أَبُو الزِّنَادِ أَنَّ الْأَعْرَجَ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ إِنَّهُسَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ نَحْنُ الْآخِرُونَ السَّابِقُونَ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Abul yaman] telah mengabarkan kepada kami [Syu'aib] telah menceritakan kepada kami [Abu Az Zanad], bahwasanya [Al A'raj] menceritakan kepadanya, bahwa [Abu Hurairah] berkata; dirinya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kami adalah orang-orang terkemudian (generasi pungkasan) di dunia, namun menjadi orang-orang pemula (angkatan pemula) yang masuk surga di hari kiamat.\""
            },
            {
                "number": 6046,
                "arab": "وَبِإِسْنَادِهِ لَوْ اطَّلَعَ فِي بَيْتِكَ أَحَدٌ وَلَمْ تَأْذَنْ لَهُ خَذَفْتَهُ بِحَصَاةٍ فَفَقَأْتَ عَيْنَهُ مَا كَانَ عَلَيْكَ مِنْ جُنَاحٍ",
                "id": "(Masih dari jalur periwayatan yang sama dengan hadits sebelumnya -dari [Abu Hurairah]-) \"Jika seseorang mengintip rumahmu padahal kamu tidak mengijinkannya, lalu kamu melemparnya dengan batu sehingga membutakan matanya, kamu tidak mendapat dosa karenanya.\""
            },
            {
                "number": 6047,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ حُمَيْدٍأَنَّ رَجُلًا اطَّلَعَ فِي بَيْتِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَدَّدَ إِلَيْهِ مِشْقَصًا فَقُلْتُ مَنْ حَدَّثَكَ قَالَ أَنَسُ بْنُ مَالِكٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Humaid], ada seorang laki-laki mengintip rumah Nabi shallallahu 'alaihi wasallam, maka beliau memperlihatkan anak panahnya kepadanya. Saya (Yahya Al Qaththan) bertanya; 'Siapa yang menceritakan hadits ini kepadamu? ' Humaid menjawab; [Anas bin Malik]."
            },
            {
                "number": 6048,
                "arab": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ أَخْبَرَنَا أَبُو أُسَامَةَ قَالَ هِشَامٌ أَخْبَرَنَا عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْلَمَّا كَانَ يَوْمُ أُحُدٍ هُزِمَ الْمُشْرِكُونَ فَصَاحَ إِبْلِيسُ أَيْ عِبَادَ اللَّهِ أُخْرَاكُمْ فَرَجَعَتْ أُولَاهُمْ فَاجْتَلَدَتْ هِيَ وَأُخْرَاهُمْ فَنَظَرَ حُذَيْفَةُ فَإِذَا هُوَ بِأَبِيهِ الْيَمَانِ فَقَالَ أَيْ عِبَادَ اللَّهِ أَبِي أَبِي قَالَتْ فَوَاللَّهِ مَا احْتَجَزُوا حَتَّى قَتَلُوهُ قَالَ حُذَيْفَةُ غَفَرَ اللَّهُ لَكُمْقَالَ عُرْوَةُ فَمَا زَالَتْ فِي حُذَيْفَةَ مِنْهُ بَقِيَّةُ خَيْرٍ حَتَّى لَحِقَ بِاللَّهِ",
                "id": "Telah menceritakan kepadaku [Ishaq bin manshur] telah mengabarkan kepada kami [Abu Usamah], [Hisyam] mengatakan, ia mengabarkan kepada kami dari [Ayahnya] dari ['Aisyah], mengatakan, Dalam perang Uhud kaum musyrikin kocar kacir dan Iblis berseru; 'hai hamba Allah, awas barisan belakang kalian! ' Maka pasukan depan kaum musyrikin berbalik kearah belakang sehingga tubrukan sesama mereka tak terelakkan. Lantas Hudzaifah melihat anggota pasukan satu persatu, dan dia dapatkan ayahnya, Al Yaman. Maka ia berseru: 'hai hamba Allah, awas itu ayahku, awas itu ayahku! ' Aisyah berkata; Demi Allah, kaum muslimin tak sabar menahan diri hingga mereka membunuh ayahnya. Khudzaifah kemudian mengatakan; 'Semoga Allah mengampuni kalian.' 'Urwah berkomentar; pada diri Khudzaifah tiada henti tertanam sifat-sifat kebaikan hingga ia menjumpai Allah."
            },
            {
                "number": 6049,
                "arab": "حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي عُبَيْدٍ عَنْ سَلَمَةَ قَالَخَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى خَيْبَرَ فَقَالَ رَجُلٌ مِنْهُمْ أَسْمِعْنَا يَا عَامِرُ مِنْ هُنَيْهَاتِكَ فَحَدَا بِهِمْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ السَّائِقُ قَالُوا عَامِرٌ فَقَالَ رَحِمَهُ اللَّهُ فَقَالُوا يَا رَسُولَ اللَّهِ هَلَّا أَمْتَعْتَنَا بِهِ فَأُصِيبَ صَبِيحَةَ لَيْلَتِهِ فَقَالَ الْقَوْمُ حَبِطَ عَمَلُهُ قَتَلَ نَفْسَهُ فَلَمَّا رَجَعْتُ وَهُمْ يَتَحَدَّثُونَ أَنَّ عَامِرًا حَبِطَ عَمَلُهُ فَجِئْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا نَبِيَّ اللَّهِ فَدَاكَ أَبِي وَأُمِّي زَعَمُوا أَنَّ عَامِرًا حَبِطَ عَمَلُهُ فَقَالَ كَذَبَ مَنْ قَالَهَا إِنَّ لَهُ لَأَجْرَيْنِ اثْنَيْنِ إِنَّهُ لَجَاهِدٌ مُجَاهِدٌ وَأَيُّ قَتْلٍ يَزِيدُهُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Makki bin Ibrahim] telah menceritakan kepada kami [Yazid bin Abi 'Ubaid] dari [Salamah bin Al Akwa'] mengatakan, Dahulu kami berangkat bersama Nabi Shallallahu'alaihiwasallam ke Khaibar. Salah seorang pasukan berujar; 'Wahai Amir, perdengarkan syair-syairmu kepada kami! ' Lantas Amir Ibn Al Akwa' memperdengarkan bait-bait syairnya sehingga terdengar oleh mereka. Selanjutnya Nabi shallallahu 'alaihi wasallam bertanya; \"Siapa yang menggiring unta-unta kita?\" 'Sahabat kita, Amir bin Al akwa' Jawab para sahabat. Nabi Terus memanjatkan doa: \"Semoga Allah merahmati dia!\" Para sahabat berujar; 'Ya Rasulullah, apakah engkau memberi kami kenyamanan lewat perantaraannya' pagi harinya ia meninggal, selanjutnya para sahabat berkomentar (mengenai peristiwa 'Amir); 'Sungguh amir sia-sia amalnya, ia telah membunuh dirinya.' Ketika aku pulang, para sahabat berbincang-bincang dengan mengatakan bahwa Amir bin Al Akwa' sia-sia amalnya karena telah membunuh dirinya sendiri. Maka kudatangi Nabi shallallahu 'alaihi wasallam dan aku berkata; 'ya Nabiyullah, demi ayahku dan ibuku menjadi tebusanmu, orang-orang beranggapan bahwa saudaraku, Amir, sia-sia amalnya! ' maka Beliau bersabda: \"Bohong semua yang mengatakan seperti itu, bahkan ia memperoleh dua pahala, sungguh ia orang yang bersungguh-sungguh sekaligus menjadi mujahid, mana ada pembunuhan yang lebih sadis dari seperti yang dialaminya?\""
            },
            {
                "number": 6050,
                "arab": "حَدَّثَنَا آدَمُ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا قَتَادَةُ قَالَ سَمِعْتُ زُرَارَةَ بْنَ أَوْفَى عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ رَجُلًا عَضَّ يَدَ رَجُلٍ فَنَزَعَ يَدَهُ مِنْ فَمِهِ فَوَقَعَتْ ثَنِيَّتَاهُ فَاخْتَصَمُوا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَعَضُّ أَحَدُكُمْ أَخَاهُ كَمَا يَعَضُّ الْفَحْلُ لَا دِيَةَ لَكَ",
                "id": "Telah menceritakan kepada kami [Adam] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Qatadah] mengatakan, aku mendengar [Zurarah bin Awfa] dari ['Imran bin Hushain], berkata; seorang laki-laki menggigit tangan seseorang, yang digigit lantas menarik tangannya dari mulutnya sehingga dua gigi serinya tanggal, lantas mereka mengadukan sengketa ini kepada Nabi Shallallahu'alaihiwasallam, dan Nabi bersabda: \"Salah seorang diantara kalian menggigit saudaranya sebagaimana kambing jantan menggigit, dan tidak ada diyat.\""
            },
            {
                "number": 6051,
                "arab": "حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ صَفْوَانَ بْنِ يَعْلَى عَنْ أَبِيهِ قَالَخَرَجْتُ فِي غَزْوَةٍ فَعَضَّ رَجُلٌ فَانْتَزَعَ ثَنِيَّتَهُ فَأَبْطَلَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari ['Atho'] dari [Shafwan bin Ya'la] dari [ayahnya] mengatakan, pernah aku berangkat untuk suatu peperangan, kemudian ada seseorang yang menggigit sehingga kedua gigi serinya tanggal, dan Nabi shallallahu 'alaihi wasallam menganggap kasus ini tak dianggap (tak ada diyat)."
            },
            {
                "number": 6052,
                "arab": "حَدَّثَنَا الْأَنْصَارِيُّ حَدَّثَنَا حُمَيْدٌ عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُأَنَّ ابْنَةَ النَّضْرِ لَطَمَتْ جَارِيَةً فَكَسَرَتْ ثَنِيَّتَهَا فَأَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِالْقِصَاصِ",
                "id": "Telah menceritakan kepada kami [Al Anshari] telah menceritakan kepada kami [Humaid] dari [Anas] radliallahu 'anhu, anak perempuan Nadhr menempeleng seorang hamba sahaya sehigga gigi serinya tanggal, maka mereka mengadukan perkaranya kepada Nabi shallallahu 'alaihi wasallam, dan Nabi memerintahkan qisas berlaku."
            },
            {
                "number": 6053,
                "arab": "حَدَّثَنَا آدَمُ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هَذِهِ وَهَذِهِ سَوَاءٌ يَعْنِي الْخِنْصَرَ وَالْإِبْهَامَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Adam] dari [Syu'bah] dari [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam bersabda; \"Ini dan ini sama saja, \" yang beliau maksudkan kelingking dan telunjuk. Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Ibnu Abi 'Adi] dari [Syu'bah] dari [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] mengatakan; Aku mendengar Nabi shallallahu 'alaihi wasallam. Semisal hadits diatas."
            },
            {
                "number": 6054,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ حَدَّثَنَا مُوسَى بْنُ أَبِي عَائِشَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَتْ عَائِشَةُلَدَدْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَرَضِهِ وَجَعَلَ يُشِيرُ إِلَيْنَا لَا تَلُدُّونِي قَالَ فَقُلْنَا كَرَاهِيَةُ الْمَرِيضِ بِالدَّوَاءِ فَلَمَّا أَفَاقَ قَالَ أَلَمْ أَنْهَكُمْ أَنْ تَلُدُّونِي قَالَ قُلْنَا كَرَاهِيَةٌ لِلدَّوَاءِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَبْقَى مِنْكُمْ أَحَدٌ إِلَّا لُدَّ وَأَنَا أَنْظُرُ إِلَّا الْعَبَّاسَ فَإِنَّهُ لَمْ يَشْهَدْكُمْ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Sufyan] telah menceritakan kepada kami [Musa bin Abu 'Aisyah] dari ['ubaidhullah bin Abdillah] mengatakan; ['Aisyah] mengatakan; 'Dahulu kami memasukkan obat ke mulut Rasulullah Shallallahu'alaihiwasallam ketika beliau sakit, beliau memberi isyarat kepada kami yang isinya; \"Janganlah kalian memasukkan obat ke dalam mulutku'. --Kata ubaidhullah, kami mengira bahwa beliau ucapkan karena orang yang sakit memang tidak suka obat-- Dikala Nabi telah sadar, beliau berkata: \"Bukankah kalian telah kularang memasukkan obat ke dalam mulutku?\" -- Kata ubaidhullah, kami berpendapat bahwa itu pertanda beliau tidak suka obat- Lantas Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang pun diantara kalian sekarang, kecuali mulutnya harus dimasuki obat dan aku sendiri harus menyaksikannya, selain Abbas, karena ia tidak ikut bersama kalian.\""
            },
            {
                "number": 6055,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ زَعَمَ أَنَّ رَجُلًا مِنْ الْأَنْصَارِ يُقَالُ لَهُ سَهْلُ بْنُ أَبِي حَثْمَةَ أَخْبَرَهُأَنَّ نَفَرًا مِنْ قَوْمِهِ انْطَلَقُوا إِلَى خَيْبَرَ فَتَفَرَّقُوا فِيهَا وَوَجَدُوا أَحَدَهُمْ قَتِيلًا وَقَالُوا لِلَّذِي وُجِدَ فِيهِمْ قَدْ قَتَلْتُمْ صَاحِبَنَا قَالُوا مَا قَتَلْنَا وَلَا عَلِمْنَا قَاتِلًا فَانْطَلَقُوا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا يَا رَسُولَ اللَّهِ انْطَلَقْنَا إِلَى خَيْبَرَ فَوَجَدْنَا أَحَدَنَا قَتِيلًا فَقَالَ الْكُبْرَ الْكُبْرَ فَقَالَ لَهُمْ تَأْتُونَ بِالْبَيِّنَةِ عَلَى مَنْ قَتَلَهُ قَالُوا مَا لَنَا بَيِّنَةٌ قَالَ فَيَحْلِفُونَ قَالُوا لَا نَرْضَى بِأَيْمَانِ الْيَهُودِ فَكَرِهَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُبْطِلَ دَمَهُ فَوَدَاهُ مِائَةً مِنْ إِبِلِ الصَّدَقَةِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sa'id bin Ubaid] dari [Busyair bin Yasar], seingatnya ada seorang laki-laki Anshar yang bergelar [Sahl bin Abi Khatsmah] mengabarinya bahwa; Beberapa orang kaumnya berangkat ke Khaibar, setibanya disana mereka berpencar, lantas mereka mendapatkan salah seorang dari mereka terbunuh. Mereka pun berujar kepada penduduk yang kawan mereka terbunuh disana; \"kalian telah membunuh kawan kami!\" Penduduk tersebut mengelak seraya mengatakan; 'Kami tidak membunuh dan juga tidak tahu si pembunuhnya.' Lantas para sahabat mengadukan perkaranya kepada Nabi shallallahu 'alaihi wasallam; 'Ya Rasulullah, kami berangkat ke Khaibar, selanjutnya kami dapatkan kawan kami terbunuh.' Nabi menjawab: \"yang berbicara yang paling tua, yang berbicara yang paling tua!\" Lalu Nabi mengatakan; \"kalian harus membawa bukti terhadap si pembunuhnya!\" Para sahabat menjawab; 'kalau bukti kami tidak punya! ' Nabi menjawab; \"kalau begitu suruhlah kaum yahudi itu untuk bersumpah!\" Para sahabat menjawab; 'Kami tidak percaya dengan sumpah orang-orang yahudi.' Rupanya Rasulullah shallallahu 'alaihi wasallam tidak berkenan jika darah sahabatnya sia-sia sehingga beliau sendiri yang membayar diyatnya dengan sebanyak seratus ekor unta."
            },
            {
                "number": 6056,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو بِشْرٍ إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ الْأَسَدِيُّ حَدَّثَنَا الْحَجَّاجُ بْنُ أَبِي عُثْمَانَ حَدَّثَنِي أَبُو رَجَاءٍ مِنْ آلِ أَبِي قِلَابَةَ حَدَّثَنِي أَبُو قِلَابَةَأَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ أَبْرَزَ سَرِيرَهُ يَوْمًا لِلنَّاسِ ثُمَّ أَذِنَ لَهُمْ فَدَخَلُوا فَقَالَ مَا تَقُولُونَ فِي الْقَسَامَةِ قَالَ نَقُولُ الْقَسَامَةُ الْقَوَدُ بِهَا حَقٌّ وَقَدْ أَقَادَتْ بِهَا الْخُلَفَاءُ قَالَ لِي مَا تَقُولُ يَا أَبَا قِلَابَةَ وَنَصَبَنِي لِلنَّاسِ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ عِنْدَكَ رُءُوسُ الْأَجْنَادِ وَأَشْرَافُ الْعَرَبِ أَرَأَيْتَ لَوْ أَنَّ خَمْسِينَ مِنْهُمْ شَهِدُوا عَلَى رَجُلٍ مُحْصَنٍ بِدِمَشْقَ أَنَّهُ قَدْ زَنَى لَمْ يَرَوْهُ أَكُنْتَ تَرْجُمُهُ قَالَ لَا قُلْتُ أَرَأَيْتَ لَوْ أَنَّ خَمْسِينَ مِنْهُمْ شَهِدُوا عَلَى رَجُلٍ بِحِمْصَ أَنَّهُ سَرَقَ أَكُنْتَ تَقْطَعُهُ وَلَمْ يَرَوْهُ قَالَ لَا قُلْتُ فَوَاللَّهِ مَا قَتَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَدًا قَطُّ إِلَّا فِي إِحْدَى ثَلَاثِ خِصَالٍ رَجُلٌ قَتَلَ بِجَرِيرَةِ نَفْسِهِ فَقُتِلَ أَوْ رَجُلٌ زَنَى بَعْدَ إِحْصَانٍ أَوْ رَجُلٌ حَارَبَ اللَّهَ وَرَسُولَهُ وَارْتَدَّ عَنْ الْإِسْلَامِ فَقَالَ الْقَوْمُ أَوَلَيْسَ قَدْ حَدَّثَ أَنَسُ بْنُ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطَعَ فِي السَّرَقِ وَسَمَرَ الْأَعْيُنَ ثُمَّ نَبَذَهُمْ فِي الشَّمْسِ فَقُلْتُ أَنَا أُحَدِّثُكُمْ حَدِيثَ أَنَسٍ حَدَّثَنِي أَنَسٌ أَنَّ نَفَرًا مِنْ عُكْلٍ ثَمَانِيَةً قَدِمُوا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَايَعُوهُ عَلَى الْإِسْلَامِ فَاسْتَوْخَمُوا الْأَرْضَ فَسَقِمَتْ أَجْسَامُهُمْ فَشَكَوْا ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَفَلَا تَخْرُجُونَ مَعَ رَاعِينَا فِي إِبِلِهِ فَتُصِيبُونَ مِنْ أَلْبَانِهَا وَأَبْوَالِهَا قَالُوا بَلَى فَخَرَجُوا فَشَرِبُوا مِنْ أَلْبَانِهَا وَأَبْوَالِهَا فَصَحُّوا فَقَتَلُوا رَاعِيَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَطْرَدُوا النَّعَمَ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَرْسَلَ فِي آثَارِهِمْ فَأُدْرِكُوا فَجِيءَ بِهِمْ فَأَمَرَ بِهِمْ فَقُطِّعَتْ أَيْدِيهِمْ وَأَرْجُلُهُمْ وَسَمَرَ أَعْيُنَهُمْ ثُمَّ نَبَذَهُمْ فِي الشَّمْسِ حَتَّى مَاتُوا قُلْتُ وَأَيُّ شَيْءٍ أَشَدُّ مِمَّا صَنَعَ هَؤُلَاءِ ارْتَدُّوا عَنْ الْإِسْلَامِ وَقَتَلُوا وَسَرَقُوا فَقَالَ عَنْبَسَةُ بْنُ سَعِيدٍ وَاللَّهِ إِنْ سَمِعْتُ كَالْيَوْمِ قَطُّ فَقُلْتُ أَتَرُدُّ عَلَيَّ حَدِيثِي يَا عَنْبَسَةُ قَالَ لَا وَلَكِنْ جِئْتَ بِالْحَدِيثِ عَلَى وَجْهِهِ وَاللَّهِ لَا يَزَالُ هَذَا الْجُنْدُ بِخَيْرٍ مَا عَاشَ هَذَا الشَّيْخُ بَيْنَ أَظْهُرِهِمْ قُلْتُ وَقَدْ كَانَ فِي هَذَا سُنَّةٌ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهِ نَفَرٌ مِنْ الْأَنْصَارِ فَتَحَدَّثُوا عِنْدَهُ فَخَرَجَ رَجُلٌ مِنْهُمْ بَيْنَ أَيْدِيهِمْ فَقُتِلَ فَخَرَجُوا بَعْدَهُ فَإِذَا هُمْ بِصَاحِبِهِمْ يَتَشَحَّطُ فِي الدَّمِ فَرَجَعُوا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا يَا رَسُولَ اللَّهِ صَاحِبُنَا كَانَ تَحَدَّثَ مَعَنَا فَخَرَجَ بَيْنَ أَيْدِينَا فَإِذَا نَحْنُ بِهِ يَتَشَحَّطُ فِي الدَّمِ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بِمَنْ تَظُنُّونَ أَوْ مَنْ تَرَوْنَ قَتَلَهُ قَالُوا نَرَى أَنَّ الْيَهُودَ قَتَلَتْهُ فَأَرْسَلَ إِلَى الْيَهُودِ فَدَعَاهُمْ فَقَالَ آنْتُمْ قَتَلْتُمْ هَذَا قَالُوا لَا قَالَ أَتَرْضَوْنَ نَفَلَ خَمْسِينَ مِنْ الْيَهُودِ مَا قَتَلُوهُ فَقَالُوا مَا يُبَالُونَ أَنْ يَقْتُلُونَا أَجْمَعِينَ ثُمَّ يَنْتَفِلُونَ قَالَ أَفَتَسْتَحِقُّونَ الدِّيَةَ بِأَيْمَانِ خَمْسِينَ مِنْكُمْ قَالُوا مَا كُنَّا لِنَحْلِفَ فَوَدَاهُ مِنْ عِنْدِهِ قُلْتُ وَقَدْ كَانَتْ هُذَيْلٌ خَلَعُوا خَلِيعًا لَهُمْ فِي الْجَاهِلِيَّةِ فَطَرَقَ أَهْلَ بَيْتٍ مِنْ الْيَمَنِ بِالْبَطْحَاءِ فَانْتَبَهَ لَهُ رَجُلٌ مِنْهُمْ فَحَذَفَهُ بِالسَّيْفِ فَقَتَلَهُ فَجَاءَتْ هُذَيْلٌ فَأَخَذُوا الْيَمَانِيَّ فَرَفَعُوهُ إِلَى عُمَرَ بِالْمَوْسِمِ وَقَالُوا قَتَلَ صَاحِبَنَا فَقَالَ إِنَّهُمْ قَدْ خَلَعُوهُ فَقَالَ يُقْسِمُ خَمْسُونَ مِنْ هُذَيْلٍ مَا خَلَعُوهُ قَالَ فَأَقْسَمَ مِنْهُمْ تِسْعَةٌ وَأَرْبَعُونَ رَجُلًا وَقَدِمَ رَجُلٌ مِنْهُمْ مِنْ الشَّأْمِ فَسَأَلُوهُ أَنْ يُقْسِمَ فَافْتَدَى يَمِينَهُ مِنْهُمْ بِأَلْفِ دِرْهَمٍ فَأَدْخَلُوا مَكَانَهُ رَجُلًا آخَرَ فَدَفَعَهُ إِلَى أَخِي الْمَقْتُولِ فَقُرِنَتْ يَدُهُ بِيَدِهِ قَالُوا فَانْطَلَقَا وَالْخَمْسُونَ الَّذِينَ أَقْسَمُوا حَتَّى إِذَا كَانُوا بِنَخْلَةَ أَخَذَتْهُمْ السَّمَاءُ فَدَخَلُوا فِي غَارٍ فِي الْجَبَلِ فَانْهَجَمَ الْغَارُ عَلَى الْخَمْسِينَ الَّذِينَ أَقْسَمُوا فَمَاتُوا جَمِيعًا وَأَفْلَتَ الْقَرِينَانِ وَاتَّبَعَهُمَا حَجَرٌ فَكَسَرَ رِجْلَ أَخِي الْمَقْتُولِ فَعَاشَ حَوْلًا ثُمَّ مَاتَ قُلْتُ وَقَدْ كَانَ عَبْدُ الْمَلِكِ بْنُ مَرْوَانَ أَقَادَ رَجُلًا بِالْقَسَامَةِ ثُمَّ نَدِمَ بَعْدَ مَا صَنَعَ فَأَمَرَ بِالْخَمْسِينَ الَّذِينَ أَقْسَمُوا فَمُحُوا مِنْ الدِّيوَانِ وَسَيَّرَهُمْ إِلَى الشَّأْمِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abu Bisyr Isma'il bin Ibrahim Al Asadi] telah menceritakan kepada kami [Al Hajjaj bin Abi 'Utsman] telah menceritakan kepadaku [Abu Raja`] dari keluarga Abu Qilaba, telah menceritakan kepadaku [Abu Qilabah]; Umar bin Abdul aziz suatu hari menghamparkan kasur tamunya untuk umum dan memberi mereka izin, mereka pun masuk. Lantas Umar bin Abdul azis bertanya; 'bagaimana pedapat kalian tentang Qosamah? ' Kami menjawab; 'Qosamah? Qisas karena Qasamah adalah benar, para khalifah pernah memberlakukan qisas karenanya.' Lantas Umar bin Abd aziz bertanya padaku -yang ketika itu dia memberiku kedudukan special untuk membimbing masyarakat- aku menjawab; 'Wahai amirul mukminin, engkau mempunyai panglima-panglima tentara dan pejabat-pejabat elit arab, bagaimana pendapatmu sekiranya lima puluh orang diantara mereka bersaksi bahwa seseorang yang telah menikah di Damaskus melakukan perzinahan padahal mereka tidak melihatnya, apakah anda merajamnya? ' \"TIDAK\" Jawabnya. Saya bertanya lagi; 'Bagaimana pendapatmu sekiranya lima puluh orang diantara mereka bersaksi bahwa ada seorang laki-laki di Himsh telah mencuri, apakah engkau potong tangannya padahal mereka tidak melihatnya? ' \"TIDAK\" Jawabnya. Maka saya berkata; 'Demi Allah, Rasulullah Shallallahu'alaihiwasallam sama sekali belum pernah membunuh seorang pun kecuali karena salah satu alasan diantara tiga; Seseorang yang membunuh secara sengaja, maka ia harus dibunuh, atau seseorang yang berzina setelah menikah, atau seseorang yang memerangi Allah dan rasul-NYA dan murtad dari Islam.' Lantas orang-orang menyela pembicaraan; 'Bukankah [Anas bin Malik] menceritakan bahwa Rasulullah shallallahu 'alaihi wasallam pernah memotong seseorang karena pencurian dan mencongkel matanya, dan membiarkan mereka terhempas di terik matahari? ' Kujawab; 'akan saya ceritakan kepada kalian hadits Anas yang Anas sendirilah yang menceritakan kepadaku; Bahwasanya sekelompok orang dari kabilah 'Ukl sejumlah delapan orang menemui Rasulullah Shallallahu'alaihiwasallam, mereka berbaiat kepada beliau menyatakan keIslaman. Tapi mereka tidak cocok dengan iklim Madinah sehingga tubuh mereka sakit. Lalu mereka mengadukan keluh kesahnya kepada Rasulullah Shallallahu'alaihiwasallam. Nabi menyarankan: \"Tidakkah sebaiknya kalian berangkat bersama penggembala unta-unta kami sehingga kalian bisa memperoleh susunya dan air kencingnya (untuk berobat)?\" 'baiklah' Jawab mereka. Mereka pun berangkat dan meminum susu dan air kencingnya sehingga sehat. Tapi mereka malah membunuh penggembala Rasulullah Shallallahu'alaihiwasallam dan merampok unta-untanya. Kejadian ini akhirnya sampai kepada Rasulullah Shallallahu'alaihiwasallam. Nabi pun mengirim pasukan untuk memburu jejak mereka. Mereka berhasil diringkus dan diseret di hadapan Nabi. Maka Nabi pun memerintahkan mereka untuk dipotong tangan dan kaki mereka dan mata mereka dicongkel. Lantas Nabi membuang mereka di terik panas matahari hingga tewas.' Saya bertanya; 'Siapa lagi yang lebih sadis daripada mereka? Mereka murtad dari Islam, membunuh, dan merampok.' Kemudian 'Anbasah bin Sa'id mengatakan; 'Demi Allah, saya belum pernah mendengar seperti hari ini sama sekali.' Saya berkata; 'Apakah engkau menolak haditsku ini hai 'Anbasah? ' 'tidak, engkau telah membawakan hadits seperti apa adanya. 'Demi Allah, tentara ini akan tetap dalam kebaikan selama syaikh ini hidup ditengah-tengah mereka.' Aku terus melanjutkan; dalam kasus seperti ini, juga ada pedoman lain dari Rasulullah Shallallahu'alaihiwasallam, kisahnya, Pernah beberapa orang anshar menemui Rasulullah Shallallahu'alaihiwasallam. Mereka berbincang-bincang bersama beliau, lantas seorang dari mereka keluar dari tengah-tengah mereka, dan ternyata ia dibunuh. Sesudah pembunuhan itu, para sahabat keluar, mereka temukan sahabatnya telah terbunuh bersimbah darah, sehingga mereka laporkan kasusnya kepada Rasulullah Shallallahu'alaihiwasallam. Kata mereka; ' Ya Rasulullah, kawan kita yang tadi berbincang-bincang bersama kita, kemudian keluar dari tengah-tengah kami, ternyata ia telah bersimbah darah.' Rasulullah Shallallahu'alaihiwasallam keluar dan bertanya: \"Menurut kalian, siapa yang kalian terka?\" dalam redaksi lain \"Siapa yang kalian sangka telah membunuhnya?\" Mereka menjawab; 'kami pikir, kaum yahudilah yang telah membunuhnya.' Rasul pun mengutus utusan menemui yahudi, mengundang mereka dan berujar; \"apakah kalian telah membunuh kawan kami ini?\" Mereka menjawab; 'Tidak'. Nabi kemudian mengatakan kepada para sahabat; \"apakah kalian rela jika lima puluh orang yahudi bersumpah bahwa mereka tidak membunuhnya?\" Para sahabat menjawab; 'Tentu mereka takkan peduli jika memang benar-benar membunuh kami! ' Kemudian kaum yahudi bersumpah. Lantas Nabi bertanya; \"bagaimana kalau kalian memperoleh diyat asalkan lima puluh orang diantara kalian bersumpah?\" Namun para sahabat tidak mau bersumpah. Akhirnya Nabi membayar diyatnya dari kantong beliau sendiri. Saya berkata; Dahulu kabilah Hudzail pernah melepaskan (membatalkan) persekutuan (ikrar perjanjian untuk bahagia-sengsara secara bersama) semasa jahiliyah. Tetapi Hudzail menyerang satu keluarga Yamani di malam buta di Bat-ha'. Seorang yamani dari penghuni rumah terjaga sehingga bisa memenggalnya dengan pedang dan berhasil membunuhnya. Kemudian penduduk Hudzail datang dan meringkus keluarga yamani dan mengadukannya kepada Umar di Al Mausim. Hudzail menyampaikan dengan berkata; 'dia telah membunuh sahabat kami.' Dia menjawab; 'sesungguhnya mereka (Hudzail) telah melepaskan perjanjiannya.' Lantas Umar mengatakan; 'Silahkan lima puluh orang Hudzail bersumpah bahwa mereka belum melepaskan perjanjiannya.' Lantas empat puluh sembilan orang Hudzail bersumpah bahwa mereka belum melepas perjanjiannya. Kemudian salah seorang dari mereka datang dari Syam, dan mereka pun meminta orang yang baru datang tersebut untuk bersumpah, namun ia enggan bersumpah sehingga harus menebus keengganan sumpahnya dengan membayar seribu dirham. Lantas Hudzail mencari pengganti lain untuk melengkapi lima puluh orang. Sedang laki-laki yang membayar tebusan tadi, mereka serahkan kepada saudara korban sehingga tangannya bergandengan dengan tangannya. Keduanya terus berjalan bersama lima puluh orang yang telah bersumpah, hingga setibanya mereka di sebuah pohon kurma, hujan mengguyur mereka sehingga mereka terperangkap dalam gua di sebuah gunung. Gua pun runtuh sehingga menimpa kelima puluh orang Hudzail yang bersumpah itu dan mereka semua mati. Kedua orang sisanya bisa lolos, namun tiba-tiba ada sebuah batu yang menggelinding ke arah mereka dan meretakkan kaki saudara yang terbunuh, ia masih bisa hidup setahun kemudian lantas meninggal. Saya berkata; Abdul Malik bin Marwan pernah mengqisas seseorang dengan bukti Qossamah, namun di kemudian hari ia menyesal dari yang dia lakukan, dan ia perintahkan kelima puluh orang yang bersumpah untuk dihilangkan dari catatan Negara dan beliau memutasikan kelima puluh orang tadi ke negeri Syam. "
            },
            {
                "number": 6057,
                "arab": "حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ أَنَسٍ عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُأَنَّ رَجُلًا اطَّلَعَ مِنْ حُجْرٍ فِي بَعْضِ حُجَرِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ إِلَيْهِ بِمِشْقَصٍ أَوْ بِمَشَاقِصَ وَجَعَلَ يَخْتِلُهُ لِيَطْعُنَهُ",
                "id": "Telah menceritakan kepada kami [Abu Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari ['ubaidhullah bin Abu Bakar bin Anas] dari [Anas] radliallahu 'anhu, ada seseorang yang mengintip salah satu kamar Nabi shallallahu 'alaihi wasallam, maka beliau menuju orang itu sambil membawa guntingnya dan beliau sembunyikan untuk ditusukkannya."
            },
            {
                "number": 6058,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ ابْنِ شِهَابٍ أَنَّ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ أَخْبَرَهُأَنَّ رَجُلًا اطَّلَعَ فِي جُحْرٍ فِي بَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِدْرًى يَحُكُّ بِهِ رَأْسَهُ فَلَمَّا رَآهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَعْلَمُ أَنَّكَ تَنْتَظِرُنِي لَطَعَنْتُ بِهِ فِي عَيْنَيْكَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا جُعِلَ الْإِذْنُ مِنْ قِبَلِ الْبَصَرِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab], [Sahal bin Sa'd as Sa'idi] mengabarkannya, ada seseorang yang mengitintip melalui lubang pintu kamar Nabi shallallahu 'alaihi wasallam yang ketika itu beliau tengah menyisir kepalanya, ketika Rasulullah Shallallahu'alaihiwasallam melihatnya, beliau bersabda: \"Kalaulah aku tahu bahwa engkau mengintip, niscaya sisir itu kutusukkan pada kedua matamu, \" lalu Rasulullah Shallallahu'alaihiwasallam bersabda; \"Hanyasanya ijin demi pandangan.\""
            },
            {
                "number": 6059,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا أَبُو الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَنَّ امْرَأً اطَّلَعَ عَلَيْكَ بِغَيْرِ إِذْنٍ فَخَذَفْتَهُ بِعَصَاةٍ فَفَقَأْتَ عَيْنَهُ لَمْ يَكُنْ عَلَيْكَ جُنَاحٌ",
                "id": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Abu Az Zanad] dari [Al A'raj] dari [Abu Hurairah] mengatakan, Abul Qashim Shallallahu'alaihiwasallam bersabda; \"Jika seseorang mengintipmu tanpa seijinmu, lantas engkau tusuk dengan tongkat sehingga matanya buta, maka tak ada diyat atasmu.\""
            },
            {
                "number": 6060,
                "arab": "حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ أَخْبَرَنَا ابْنُ عُيَيْنَةَ حَدَّثَنَا مُطَرِّفٌ قَالَ سَمِعْتُ الشَّعْبِيَّ قَالَ سَمِعْتُ أَبَا جُحَيْفَةَ قَالَ سَأَلْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُهَلْ عِنْدَكُمْ شَيْءٌ مِمَّا لَيْسَ فِي الْقُرْآنِ وَقَالَ مَرَّةً مَا لَيْسَ عِنْدَ النَّاسِ فَقَالَ وَالَّذِي فَلَقَ الْحَبَّةَ وَبَرَأَ النَّسَمَةَ مَا عِنْدَنَا إِلَّا مَا فِي الْقُرْآنِ إِلَّا فَهْمًا يُعْطَى رَجُلٌ فِي كِتَابِهِ وَمَا فِي الصَّحِيفَةِ قُلْتُ وَمَا فِي الصَّحِيفَةِ قَالَ الْعَقْلُ وَفِكَاكُ الْأَسِيرِ وَأَنْ لَا يُقْتَلَ مُسْلِمٌ بِكَافِرٍ",
                "id": "Telah menceritakan kepada kami [Shadaqah bin Al Fadhl] Telah mengabarkan kepada kami [Ibnu 'Uyainah] telah menceritakan kepada kami [Mutharrif] mengatakan; aku mendengar [Asy Sya'bi], dia berkata; aku mendengar [Abu Juhaifah] mengatakan, aku bertanya kepada [Ali] radliallahu 'anhu; 'Apakah kalian mempunyai sesuatu yang tidak tersebut dalam alquran? ' kesempatan lain dia berkata; 'yang tidak ada pada orang-orang? ' ia menjawab; 'Demi Dzat yang membelah biji-bijian dan mencipta manusia, kami tidak mempunyai selain yag terdapat dalam al Qur`an, kecuali kepahaman yang diberikan kepada seseorang terhadap kitab-Nya dan yang terdapat dalam lembaran.' Saya bertanya; 'apa yang terdapat dalam lembaran? ' ia menjawab; 'yaitu membayar diyat, membebaskan tawanan, dan janganlah seorang muslim dibunuh karena orang kafir.'"
            },
            {
                "number": 6061,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ أَخْبَرَنَا مَالِكٌ وَحَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُأَنَّ امْرَأَتَيْنِ مِنْ هُذَيْلٍ رَمَتْ إِحْدَاهُمَا الْأُخْرَى فَطَرَحَتْ جَنِينَهَا فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Yusuf] Telah mengabarkan kepada kami [Malik] dan telah menceritakan kepada kami [Isma'il] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] radliallahu 'anhu, ada dua wanita Hudzail, salah satunya memukul yang lain sehingga janin yang dikandung keguguran, dan Rasulullah Shallallahu'alaihiwasallam memutuskan untuk membayar ghurrah, budak laki-laki atau hamba sahaya perempuan."
            },
            {
                "number": 6062,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ عَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُأَنَّهُ اسْتَشَارَهُمْ فِي إِمْلَاصِ الْمَرْأَةِ فَقَالَ الْمُغِيرَةُ قَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْغُرَّةِ عَبْدٍ أَوْ أَمَةٍفَشَهِدَ مُحَمَّدُ بْنُ مَسْلَمَةَ أَنَّهُ شَهِدَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِهِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Hisyam] dari [ayahnya] dari [Mughirah bin Syu'bah] dari Umar radliallahu 'anhu, ia pernah meminta pendapat mereka mengenai menggugurkan janin wanita. Kontan Mughirah mengatakan; 'Nabi shallallahu 'alaihi wasallam memutuskan dengan ghurrah, budak atau hamba sahaya.' [Muhammad bin Maslamah] memberi kesaksian bahwasanya ia pernah menyaksikan Nabi shallallahu 'alaihi wasallam memutuskan sedemikian."
            },
            {
                "number": 6063,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ هِشَامٍ عَنْ أَبِيهِأَنَّ عُمَرَ نَشَدَ النَّاسَ مَنْ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي السِّقْطِ فَقَالَ الْمُغِيرَةُ أَنَا سَمِعْتُهُ قَضَى فِيهِ بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍقَالَ ائْتِ مَنْ يَشْهَدُ مَعَكَ عَلَى هَذَا فَقَالَ مُحَمَّدُ بْنُ مَسْلَمَةَ أَنَا أَشْهَدُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ هَذَا حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ حَدَّثَنَا زَائِدَةُ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ أَنَّهُ سَمِعَ الْمُغِيرَةَ بْنَ شُعْبَةَ يُحَدِّثُ عَنْ عُمَرَ أَنَّهُ اسْتَشَارَهُمْ فِي إِمْلَاصِ الْمَرْأَةِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Musa] dari [Hisyam] dari [ayahnya], Umar pernah meminta kesaksian orang-orang, siapa diantara mereka yang mendengar Nabi shallallahu 'alaihi wasallam memutuskan masalah keguguran janin (yang di pukul). Maka [Al Mughirah] mengatakan; 'Aku mendengar beliau memutuskannya untuk membayar ghurrah, budak laki-laki atau hamba sahaya perempuan, ' lantas [Muhammad bin Maslamah] mengatakan; 'aku menyaksikan Nabi shallallahu 'alaihi wasallam dengan seperti ini.' Telah menceritakan kepadaku [Muhammad bin Abdullah] telah menceritakan kepada kami [Muhammad bin Sabiq] telah menceritakan kepada kami [Za'idah] telah menceritakan kepada kami [Hisyam bin Urwah] dari [ayahnya] ia mendengar [Mughirah bin Syu'bah] menceritakan tentang Umar, bahwa ia pernah meminta pendapat orang-orang tentang keguguran janin wanita semisalnya."
            },
            {
                "number": 6064,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي جَنِينِ امْرَأَةٍ مِنْ بَنِي لَحْيَانَ بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ ثُمَّ إِنَّ الْمَرْأَةَ الَّتِي قَضَى عَلَيْهَا بِالْغُرَّةِ تُوُفِّيَتْ فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ مِيرَاثَهَا لِبَنِيهَا وَزَوْجِهَا وَأَنَّ الْعَقْلَ عَلَى عَصَبَتِهَا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Yusuf] telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari [Sa'id bin Musayyab] dari [Abu Hurairah], Rasulullah Shallallahu'alaihiwasallam pernah memutuskan (diyat) janin wanita dari bani Lahyan dengan nilai setara ghurrah, budak laki-laki atau hamba sahaya perempuan, kemudian wanita yang beliau putuskan untuk membayar ghurrah meninggal, maka Rasulullah Shallallahu'alaihiwasallam putuskan warisannya untuk anak-anaknya dan suaminya, sedang pembayaran diyat bagi 'ashabahnya."
            },
            {
                "number": 6065,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنَا يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ ابْنِ الْمُسَيَّبِ وَأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَاقْتَتَلَتْ امْرَأَتَانِ مِنْ هُذَيْلٍ فَرَمَتْ إِحْدَاهُمَا الْأُخْرَى بِحَجَرٍ فَقَتَلَتْهَا وَمَا فِي بَطْنِهَا فَاخْتَصَمُوا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَضَى أَنَّ دِيَةَ جَنِينِهَا غُرَّةٌ عَبْدٌ أَوْ وَلِيدَةٌ وَقَضَى أَنَّ دِيَةَ الْمَرْأَةِ عَلَى عَاقِلَتِهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah menceritakan kepada kami [Yunus] dari [Ibnu Syihab] dari [Ibnul Musayyab] dan [Abu Salamah bin Abdurrahman], [Abu Hurairah] radliallahu 'anhu mengatakan; Ada dua wnaita Hudzail yang berkelahi sehingga salah satunya melempar yang lain dengan batu sehingga membunuhnya dan menggugurkan kandungannya, lantas orang-orang mengadukan sengketa ini kepada Nabi shallallahu 'alaihi wasallam, dan beliau putuskan diyat janin sebesar ghurrah, setara budak laki-laki atau hamba sahaya perempuan, beliau putuskan diyat wanita ditanggung 'aqilah-nya. "
            },
            {
                "number": 6066,
                "arab": "حَدَّثَنِي عَمْرُو بْنُ زُرَارَةَ أَخْبَرَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ عَنْ عَبْدِ الْعَزِيزِ عَنْ أَنَسٍ قَالَلَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ أَخَذَ أَبُو طَلْحَةَ بِيَدِي فَانْطَلَقَ بِي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أَنَسًا غُلَامٌ كَيِّسٌ فَلْيَخْدُمْكَ قَالَ فَخَدَمْتُهُ فِي الْحَضَرِ وَالسَّفَرِ فَوَاللَّهِ مَا قَالَ لِي لِشَيْءٍ صَنَعْتُهُ لِمَ صَنَعْتَ هَذَا هَكَذَا وَلَا لِشَيْءٍ لَمْ أَصْنَعْهُ لِمَ لَمْ تَصْنَعْ هَذَا هَكَذَا",
                "id": "Telah menceritakan kepadaku [Amru bin Zurarah] Telah mengabarkan kepada kami [Isma'il bin Ibrahim] dari ['Abdul 'Aziz] dari [Anas] mengatakan, dikala Rasulullah Shallallahu'alaihiwasallam datang ke Madinah, Abu Thalhah menggandeng tanganku dan mengajakku menemui Rasulullah shallallahu 'alaihi wasallam dan berujar; 'Wahai Rasulullah, Anas adalah anak belia yang terampil, baik sekali jika ia menjadi pembantumu! ' Kata Anas, maka aku membantu beliau baik ketika beliau di rumah maupun bepergian, dan demi Allah, beliau tidak pernah menggerutu terhadap yang kulakukan dengan mengatakan; 'mengapa kau lakukan seperti ini! ' Dan tidak pernah pula beliau menggerutu terhadapku karena pekerjaan yang tidak kulakukan dengan mengatakan; 'mengapa tidak kau kerjakan ini hah! '"
            },
            {
                "number": 6067,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ حَدَّثَنَا اللَّيْثُ حَدَّثَنَا ابْنُ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعَجْمَاءُ جَرْحُهَا جُبَارٌ وَالْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمُسُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Yusuf] telah menceritakan kepada kami [Al Laits] telah menceritakan kepada kami [Ibnu Syihab] dari [Sa'id bin Musayyab] dan [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] radliallahu 'anhu, bahwasanya Rasulullah bersabda: \"Binatang ternak yang mencelakakan tidak ada kewajiban diyat, sumur yang mencelakai juga tak ada kewajiban diyat, Pertambangan (yang mencelakai juga) tak ada kewajiban diyat, dan harta karun zakatnya seperlima.\""
            },
            {
                "number": 6068,
                "arab": "حَدَّثَنَا مُسْلِمٌ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعَجْمَاءُ عَقْلُهَا جُبَارٌ وَالْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمُسُ",
                "id": "Telah menceritakan kepada kami [Muslim] telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin Ziyad] dari [Abu Hurairah] radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam bersabda: \"Binatang ternak yang mencederai tak berkewajiban membayar diyat, sumur yang menjadikan celaka juga tak ada diyat, pertambangan yang menjadikan celaka juga tak ada diyat, dan harta karun zakatnya seperlima.\""
            },
            {
                "number": 6069,
                "arab": "حَدَّثَنَا قَيْسُ بْنُ حَفْصٍ حَدَّثَنَا عَبْدُ الْوَاحِدِ حَدَّثَنَا الْحَسَنُ حَدَّثَنَا مُجَاهِدٌ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَتَلَ نَفْسًا مُعَاهَدًا لَمْ يَرِحْ رَائِحَةَ الْجَنَّةِ وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ أَرْبَعِينَ عَامًا",
                "id": "Telah menceritakan kepada kami [Qais bin Hafsh] telah menceritakan kepada kami [Abdul Wahid] telah menceritakan kepada kami [Al Hasan] telah menceritakan kepada kami [Mujahid] dari [Abdullah bin Amru] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Siapa yang membunuh orang kafir yang telah mengikat perjanjian (mu'ahid) dengan pemerintahan muslimin, ia tak dapat mencium harum surga, padahal harum surga dapat dicium dari jarak empat puluh tahun.\""
            },
            {
                "number": 6070,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا مُطَرِّفٌ أَنَّ عَامِرًا حَدَّثَهُمْ عَنْ أَبِي جُحَيْفَةَ قَالَ قُلْتُ لِعَلِيٍّ ح حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ أَخْبَرَنَا ابْنُ عُيَيْنَةَ حَدَّثَنَا مُطَرِّفٌ سَمِعْتُ الشَّعْبِيَّ يُحَدِّثُ قَالَ سَمِعْتُ أَبَا جُحَيْفَةَ قَالَ سَأَلْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُهَلْ عِنْدَكُمْ شَيْءٌ مِمَّا لَيْسَ فِي الْقُرْآنِ وَقَالَ ابْنُ عُيَيْنَةَ مَرَّةً مَا لَيْسَ عِنْدَ النَّاسِ فَقَالَ وَالَّذِي فَلَقَ الْحَبَّةَ وَبَرَأَ النَّسَمَةَ مَا عِنْدَنَا إِلَّا مَا فِي الْقُرْآنِ إِلَّا فَهْمًا يُعْطَى رَجُلٌ فِي كِتَابِهِ وَمَا فِي الصَّحِيفَةِ قُلْتُ وَمَا فِي الصَّحِيفَةِ قَالَ الْعَقْلُ وَفِكَاكُ الْأَسِيرِ وَأَنْ لَا يُقْتَلَ مُسْلِمٌ بِكَافِرٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Mutharrif], bahwa [Amir] menceritakan kepada mereka, dari [Abu Juhaifah] mengatakan; Pernah aku berkata kepada [Ali] -lewat jalur periwayatan lain-telah menceritakan kepada kami [Shadaqoh bin Al Fadhl] telah mengabarkan kepada kami [Ibnu 'Uyainah] telah menceritakan kepada kami [Mutharrif] Aku mendengar [Asy Sya'bi] menceritakan dengan mengatakan; aku mendengar [Abu Juhaifah] mengatakan; aku bertanya kepada [Ali radliallahu 'anhu]; 'Apakah kamu mempunyai sesuatu yang tidak terdapat didalam alqur'an? ' sesekali Ibnu Uyainah mengatakan dengan redaksi; 'sesuatu yang tidak dimiliki manusia? ' ia menjawab; 'Demi Dzat yang membelah biji-bijian dan mencipta manusia, kami tidak mempunyai selain yang terdapat dalam al Qur`an, kecuali pemahaman yang diberikan kepada seseorang terhadap kitabNya dan yang terdapat dalam shahifah.' Saya bertanya; 'apa yang terdapat dalam shahifah? ' ia menjawab: 'kewajiban membayar diyat, membebaskan tawanan dan tidak boleh seorang muslim dibunuh karena orang kafir."
            },
            {
                "number": 6071,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ يَحْيَى عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُخَيِّرُوا بَيْنَ الْأَنْبِيَاءِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Amru bin Yahya] dari [Ayahnya] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Jangan kalian memilih-milih diantara para nabi.\""
            },
            {
                "number": 6072,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَجَاءَ رَجُلٌ مِنْ الْيَهُودِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ لُطِمَ وَجْهُهُ فَقَالَ يَا مُحَمَّدُ إِنَّ رَجُلًا مِنْ أَصْحَابِكَ مِنْ الْأَنْصَارِ قَدْ لَطَمَ فِي وَجْهِي قَالَ ادْعُوهُ فَدَعَوْهُ قَالَ لِمَ لَطَمْتَ وَجْهَهُ قَالَ يَا رَسُولَ اللَّهِ إِنِّي مَرَرْتُ بِالْيَهُودِ فَسَمِعْتُهُ يَقُولُ وَالَّذِي اصْطَفَى مُوسَى عَلَى الْبَشَرِ قَالَ قُلْتُ وَعَلَى مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَأَخَذَتْنِي غَضْبَةٌ فَلَطَمْتُهُ قَالَ لَا تُخَيِّرُونِي مِنْ بَيْنِ الْأَنْبِيَاءِ فَإِنَّ النَّاسَ يَصْعَقُونَ يَوْمَ الْقِيَامَةِ فَأَكُونُ أَوَّلَ مَنْ يُفِيقُ فَإِذَا أَنَا بِمُوسَى آخِذٌ بِقَائِمَةٍ مِنْ قَوَائِمِ الْعَرْشِ فَلَا أَدْرِي أَفَاقَ قَبْلِي أَمْ جُوزِيَ بِصَعْقَةِ الطُّورِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Amru bin Yahya Al Mazini] dari [ayahnya] dari [Abu Sa'id Al Khudzri] mengatakan, seorang laki-laki yahudi mendatangi Nabi shallallahu 'alaihi wasallam yang ketika itu wajahnya telah ditempeleng, ia berujar; 'Hai Muhammad, salah seorang sahabatmu dari Anshar telah menempeleng wajahku.' Nabi bersabda; \"panggil dia!\" Lantas para sahabat memanggilnya, dan Nabi bertanya: \"Mengapa kau tempeleng wajahnya?\" dia menjawab; 'ya Rasulullah, aku melewati orang-orang yahudi, lalu aku mendengar dia mengatakan; 'Demi Dzat yang memilih Musa diatas semua manusia.' Saya berujar; 'Dan diatas Muhammad Shallallahu'alaihiwasallam.' Maka pada saat itu aku terbawa amarah, sehingga aku menempelengnya.' Nabi terus bersabda: \"Jangan kalian memilih-memilih aku diantara para nabi, sebab padahari kiamat nanti manusia pingsan, dan aku yang pertama-tama sadarkan diri, namun ternyata Musa telah memegang penyangga arsy, saya tidak tahu, apakah dia siuman sebelumku ataukah ia telah memperoleh pembalasan dari kepingsanannya di bukit Tursina.\""
            },
            {
                "number": 6073,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ قَالَلَمَّا نَزَلَتْ هَذِهِ الْآيَةُ{ الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ }شَقَّ ذَلِكَ عَلَى أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالُوا أَيُّنَا لَمْ يَلْبِسْ إِيمَانَهُ بِظُلْمٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ لَيْسَ بِذَاكَ أَلَا تَسْمَعُونَ إِلَى قَوْلِ لُقْمَانَ{ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ }",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Ibrahim] dari [Alqomah] dari [Abdullah] radliallahu 'anhu, mengatakan; 'Dikala diturunkan ayat; 'Sesungguhnya orang yang beriman dan tidak mencampur adukkan keimanan mereka dengan kezhaliman' (QS. Al an'am 82), para sahabat Nabi shallallahu 'alaihi wasallam merasa gusar, sehingga bertanya; 'Siapakah diantara kami yang tidak mencampur keimananya dengan kezjhaliman? ' Maka Rasulullah Shallallahu'alaihiwasallam menjawab; \"Bukan itu yang dimaksudkan, tidakkah kalian mendengar ucapan Luqman; 'sesungguhnya kesyirikan adalah kezhaliman yang besar\" (QS. Luqman 13) "
            },
            {
                "number": 6074,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا الْجُرَيْرِيُّ ح و حَدَّثَنِي قَيْسُ بْنُ حَفْصٍ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا سَعِيدٌ الْجُرَيْرِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ عَنْ أَبِيهِ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْبَرُ الْكَبَائِرِ الْإِشْرَاكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ وَشَهَادَةُ الزُّورِ وَشَهَادَةُ الزُّورِ ثَلَاثًا أَوْ قَوْلُ الزُّورِ فَمَا زَالَ يُكَرِّرُهَا حَتَّى قُلْنَا لَيْتَهُ سَكَتَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Bisyr bin Mufadhdhal] telah menceritakan kepada kami [Al Jurairi] -lewat jalur periwayatan lain- telah menceritakan kepadaku [Qais bin Hafsh] telah menceritakan kepada kami [Isma'il bin Ibrahim] Telah mengabarkan kepada kami [Sa'id Al Jurairi] telah menceritakan kepada kami [Abdurrahman bin Abu Bakrah] dari [ayahnya] radliallahu 'anhu mengatakan, Nabi shallallahu 'alaihi wasallam bersabda: \"Dosa yang paling besar diantara dosa-dosa besar lainnya adalah menyekutukan Allah, durhaka kepada orang tua, kesaksian palsu, kesaksian palsu (beliau mengulanginya tiga kali), atau ucapan dusta, \" beliau tidak henti-henti mengulang-ulanginya sehingga kami mengatakan; 'Duhai, sekiranya beliau diam.' "
            },
            {
                "number": 6075,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ الْحُسَيْنِ بْنِ إِبْرَاهِيمَ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَخْبَرَنَا شَيْبَانُ عَنْ فِرَاسٍ عَنْ الشَّعْبِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو رَضِيَ اللَّهُ عَنْهُمَا قَالَجَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ مَا الْكَبَائِرُ قَالَ الْإِشْرَاكُ بِاللَّهِ قَالَ ثُمَّ مَاذَا قَالَ ثُمَّ عُقُوقُ الْوَالِدَيْنِ قَالَ ثُمَّ مَاذَا قَالَ الْيَمِينُ الْغَمُوسُ قُلْتُ وَمَا الْيَمِينُ الْغَمُوسُ قَالَ الَّذِي يَقْتَطِعُ مَالَ امْرِئٍ مُسْلِمٍ هُوَ فِيهَا كَاذِبٌ",
                "id": "telah menceritakan kepadaku [Muhammad bin Al Husain bin Ibrahim] telah mengabarkan kepada kami [ubaidhullah bin Musa] Telah mengabarkan kepada kami [Syaiban] dari [Firas] dari [Asy Sya'bi] dari [Abdullah bin Amru] mengatakan; Seorang arab badui menemui Nabi shallallahu 'alaihi wasallam dan bertanya; 'Waya Rasulullah, apa yang dianggap dosa-dosa besar itu? ' Beliau menjawab: \"Menyekutukan Allah\" 'Lantas selanjutnya apa? ' Tanyanya. Nabi menjawab: \"Mendurhakai orang tua.\" 'selanjutnya apa? ' Tanyanya. Nabi shallallahu 'alaihi wasallam menjawab: \"Sumpah ghamus.\" Kami bertanya; 'apa makna ghamus? ' Beliau jawab; \"maknanya sumpah palsu, dusta, yang karena sumpahnya ia bisa menguasai harta seorang muslim, padahal sumpahnya bohong belaka.\""
            },
            {
                "number": 6076,
                "arab": "حَدَّثَنَا خَلَّادُ بْنُ يَحْيَى حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ وَالْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ ابْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَنُؤَاخَذُ بِمَا عَمِلْنَا فِي الْجَاهِلِيَّةِ قَالَ مَنْ أَحْسَنَ فِي الْإِسْلَامِ لَمْ يُؤَاخَذْ بِمَا عَمِلَ فِي الْجَاهِلِيَّةِ وَمَنْ أَسَاءَ فِي الْإِسْلَامِ أُخِذَ بِالْأَوَّلِ وَالْآخِرِ",
                "id": "Telah menceritakan kepada kami [Khallad bin Yahya] telah menceritakan kepada kami [Sufyan] dari [Manshur] dan [Al A'masy] dari [Abu Wa`il] dari [Ibnu Mas'ud] radliallahu 'anhu mengatakan, seorang laki-laki bertanya; 'ya Rasulullah, apakah kami dihukum karena kelakuan-kelakuan kami semasa jahiliyah? ' Nabi menjawab: \"Barangsia berbuat baik dalam Islam, maka tak dihukum kelakuan-kelakuannya semasa jahiliyah, sebaliknya barangsiapa berbuat buruk dalam Islam, ia dihukum semenjak kelakuan awalnya dan akhirnya.\" "
            },
            {
                "number": 6077,
                "arab": "حَدَّثَنَا أَبُو النُّعْمَانِ مُحَمَّدُ بْنُ الْفَضْلِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ قَالَأُتِيَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ بِزَنَادِقَةٍ فَأَحْرَقَهُمْ فَبَلَغَ ذَلِكَ ابْنَ عَبَّاسٍ فَقَالَ لَوْ كُنْتُ أَنَا لَمْ أُحْرِقْهُمْ لِنَهْيِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُعَذِّبُوا بِعَذَابِ اللَّهِ وَلَقَتَلْتُهُمْ لِقَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ",
                "id": "Telah menceritakan kepada kami [Abu Nu'man Muhammad bin Fadhl] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Ikrimah] mengatakan, beberapa orang Zindiq diringkus dan dihadapkan kepada Ali radliallahu 'anhu, lalu Ali membakar mereka. Kasus ini terdengar oleh [Ibnu Abbas], sehingga ia berujar; 'Kalau aku, aku tak akan membakar mereka karena ada larangan Rasulullah Shallallahu'alaihiwasallam yang bersabda: \"Janganlah kalian menyiksa dengan siksaan Allah, \" dan aku tetap akan membunuh mereka sesuai sabda Rasulullah Shallallahu'alaihiwasallam: \"Siapa yang mengganti agamanya, bunuhlah!\""
            },
            {
                "number": 6078,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ قُرَّةَ بْنِ خَالِدٍ حَدَّثَنِي حُمَيْدُ بْنُ هِلَالٍ حَدَّثَنَا أَبُو بُرْدَةَ عَنْ أَبِي مُوسَى قَالَأَقْبَلْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعِي رَجُلَانِ مِنْ الْأَشْعَرِيِّينَ أَحَدُهُمَا عَنْ يَمِينِي وَالْآخَرُ عَنْ يَسَارِي وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَاكُ فَكِلَاهُمَا سَأَلَ فَقَالَ يَا أَبَا مُوسَى أَوْ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ قَالَ قُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أَطْلَعَانِي عَلَى مَا فِي أَنْفُسِهِمَا وَمَا شَعَرْتُ أَنَّهُمَا يَطْلُبَانِ الْعَمَلَ فَكَأَنِّي أَنْظُرُ إِلَى سِوَاكِهِ تَحْتَ شَفَتِهِ قَلَصَتْ فَقَالَ لَنْ أَوْ لَا نَسْتَعْمِلُ عَلَى عَمَلِنَا مَنْ أَرَادَهُ وَلَكِنْ اذْهَبْ أَنْتَ يَا أَبَا مُوسَى أَوْ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ إِلَى الْيَمَنِ ثُمَّ اتَّبَعَهُ مُعَاذُ بْنُ جَبَلٍ فَلَمَّا قَدِمَ عَلَيْهِ أَلْقَى لَهُ وِسَادَةً قَالَ انْزِلْ وَإِذَا رَجُلٌ عِنْدَهُ مُوثَقٌ قَالَ مَا هَذَا قَالَ كَانَ يَهُودِيًّا فَأَسْلَمَ ثُمَّ تَهَوَّدَ قَالَ اجْلِسْ قَالَ لَا أَجْلِسُ حَتَّى يُقْتَلَ قَضَاءُ اللَّهِ وَرَسُولِهِ ثَلَاثَ مَرَّاتٍ فَأَمَرَ بِهِ فَقُتِلَ ثُمَّ تَذَاكَرَا قِيَامَ اللَّيْلِ فَقَالَ أَحَدُهُمَا أَمَّا أَنَا فَأَقُومُ وَأَنَامُ وَأَرْجُو فِي نَوْمَتِي مَا أَرْجُو فِي قَوْمَتِي",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Qurrah bin Khalid] telah menceritakan kepadaku [Humaid bin Hilal] telah menceritakan kepada kami [Abu Burdah] dari [Abu Musa] mengatakan, Aku berangkat menemui Nabi shallallahu 'alaihi wasallam bersama dua orang asy'ari, satunya di sebelah kananku dan satunya di sebelah kiriku, sedang Rasulullah Shallallahu'alaihiwasallam tengah bersiwak. Keduanya sama-sama meminta pekerjaan (jabatan). Kemudian Nabi berujar: \"Wahai Abu Musa atau hai Abdullah bin Qais\" Abu Musa berkata; maka Saya menjawab; 'demi Dzat yang mengutusmu dengan kebenaran, kedua tamu itu tidak mengungkapkan isi hati mereka, dan aku tidak merasa bahwa keduanya minta pekerjaan (jabatan).' dan seolah-olah aku melihat siwak beliau dibawah bibirnya mengempes. Kemudian Nabi bersabda: \"Sekali-kali aku tidak akan mempekerjakan tugas-tugas kita kepada orang yang memintanya (menginginkannya), akan tetapi kamu ya Abu Musa atau ya Abdullah bin Qais, pergilah ke Yaman.\" kemudian Mu'adz bin jabal menyusulnya. Ketika Mu'adz bin jabal menemuinya, Abu Musa menghamparkan bantal dan berujar; 'Turunlah'. Ternyata disisinya ada seorang laki-laki yang terikat. Muadz bertanya; 'kenapa dengan orang ini? ' Abu Musa menjawab; 'dahulu dia seorang yahudi, lantas masuk Islam dan kembali lagi memeluk agama yahudinya.' Maka Abu Musa berujar; 'Duduklah engkau! ' Mu'adz menjawab; 'Saya tidak akan duduk hingga dia dibunuh untuk menunaikan ketetapan Allah dan rasul-NYA' (ia mengulang tiga kali), maka Abu Musa memerintahkan untuk membunuh yahudi tersebut. Keduanya kemudian berbincang-bincang masalah sholat malam. Satunya mengatakan; 'Adapun aku sholat malam namun juga tidur, dan kuharap dari tidurku (mendapat pahala) sebagaimana aku berharap memperoleh pahala bersama di kaumku.'"
            },
            {
                "number": 6079,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ أَنَّ أَبَا هُرَيْرَةَ قَالَلَمَّا تُوُفِّيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاسْتُخْلِفَ أَبُو بَكْرٍ وَكَفَرَ مَنْ كَفَرَ مِنْ الْعَرَبِ قَالَ عُمَرُ يَا أَبَا بَكْرٍ كَيْفَ تُقَاتِلُ النَّاسَ وَقَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ فَمَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ فَقَدْ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ إِلَّا بِحَقِّهِ وَحِسَابُهُ عَلَى اللَّهِ قَالَ أَبُو بَكْرٍ وَاللَّهِ لَأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلَاةِ وَالزَّكَاةِ فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ وَاللَّهِ لَوْ مَنَعُونِي عَنَاقًا كَانُوا يُؤَدُّونَهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَاتَلْتُهُمْ عَلَى مَنْعِهَاقَالَ عُمَرُ فَوَاللَّهِ مَا هُوَ إِلَّا أَنْ رَأَيْتُ أَنْ قَدْ شَرَحَ اللَّهُ صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ فَعَرَفْتُ أَنَّهُ الْحَقُّ",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari [Uqail] dari [Ibnu Syihab] telah mengabarkan kepadaku [ubaidhullah bin Abdullah bin 'Utbah], bahwasanya [Abu Hurairah] mengatakan; Tatkala Nabi shallallahu 'alaihi wasallam wafat dan Abu Bakar diangkat menjadi khalifah, beberapa orang arab menjadi kafir, lalu [Umar] bertanya; 'Hai Abu bakar, bagaimana engkau memerangi manusia padahal Rasulullah Shallallahu'alaihiwasallam bersabda; \"Saya diperintahkan memerangi manusia hingga mereka mengucapkan laa-ilaaha-illallah, siapa yang telah mengucapkan laa-ilaaha-illallah, berarti ia telah menjaga kehormatan darahnya dan jiwanya kecuali karena alasan yang dibenarkan dan hisabnya kepada Allah.\" [Abu Bakar] menjawab; 'Demi Allah, saya akan terus memerangi siapa saja yang memisahkan antara sholat dan zakat, sebab zakat adalah hak harta, Demi Allah, kalaulah mereka menghalangiku dari anak kambing yang pernah mereka bayarkan kepada Rasulullah Shallallahu'alaihiwasallam, niscaya aku perangi mereka karena tidak membayarnya.' Umar kemudian berkata; 'Demi Allah, tiada lain kuanggap memang Allah telah melapangkan Abu Bakar untuk memerangi dan aku sadar bahwa yang dilakukannya adalah benar.'"
            },
            {
                "number": 6080,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا شُعْبَةُ عَنْ هِشَامِ بْنِ زَيْدِ بْنِ أَنَسِ بْنِ مَالِكٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُمَرَّ يَهُودِيٌّ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ السَّامُ عَلَيْكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَدْرُونَ مَا يَقُولُ قَالَ السَّامُ عَلَيْكَ قَالُوا يَا رَسُولَ اللَّهِ أَلَا نَقْتُلُهُ قَالَ لَا إِذَا سَلَّمَ عَلَيْكُمْ أَهْلُ الْكِتَابِ فَقُولُوا وَعَلَيْكُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Muqatil Abul Hasan] Telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Syu'bah] dari [Hisyam bin Zaid bin Anas bin Malik] mengatakan, aku mendengar [Anas bin malik] mengatakan; seorang yahudi melewati Rasulullah Shallallahu'alaihiwasallam dan mengucapkan; 'Assaam 'alaikum (kiranya kalian tertimpa kematian).' Maka Rasulullah shallallahu 'alaihi wasallam menjawab: \"wa'ailaika (Dan untukmu).' kemudian Rasulullah shallallahu 'alaihi wasallam bertanya; \"tahukah kalian apa yang diucapkannya? dia telah mengatakan; 'alaikum (Semoga kalian tertimpa kematian).\" Maka para sahabat menjawab; 'bagaimana kalau dia kami bunuh? ' Nabi menjawab; \"jangan, jika ahlu kitab mengucapkan salam kepada kalian, jawablah; wa'alaikum (kepada kalian kematian)!\""
            },
            {
                "number": 6081,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ عَنْ ابْنِ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْاسْتَأْذَنَ رَهْطٌ مِنْ الْيَهُودِ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا السَّامُ عَلَيْكَ فَقُلْتُ بَلْ عَلَيْكُمْ السَّامُ وَاللَّعْنَةُ فَقَالَ يَا عَائِشَةُ إِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ فِي الْأَمْرِ كُلِّهِ قُلْتُ أَوَلَمْ تَسْمَعْ مَا قَالُوا قَالَ قُلْتُ وَعَلَيْكُمْ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] dari [Ibnu Uyainah] dari [Az Zuhri] dari [Urwah] dari [Aisyah] radliallahu 'anha mengatakan; Sekelompok orang yahudi meminta izin kepada Nabi shallallahu 'alaihi wasallam dan mengucapkan; 'Assaam 'alaika (semoga kematian tertimpa kepada kalian), saya menjawab; 'bal 'alaikum Assam wal la'nah (Bahkan untuk kalian kematian dan juga laknat).' Maka Nabi berujar; 'hai Aisyah, bahwasanya Allah menyukai kelembutan dalam segala urusan.' Saya menjawab; 'Tidakkah engkau mendengar apa yang mereka ucapkan? ' Beliau menjawab: \"Saya menjawab; wa'alaikum (bahkan untuk kalian).\""
            },
            {
                "number": 6082,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ وَمَالِكِ بْنِ أَنَسٍ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ قَالَ سَمِعْتُ ابْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْيَهُودَ إِذَا سَلَّمُوا عَلَى أَحَدِكُمْ إِنَّمَا يَقُولُونَ سَامٌ عَلَيْكَ فَقُلْ عَلَيْكَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] dan [Malik bin Anas] mengatakan, telah menceritakan kepada kami [Abdullah bin Dinar] mengatakan, aku mendengar [Ibnu Umar] radliallahu 'anhu mengatakan; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kaum yahudi mengucapkan salam kepada salah seorang diantara kalian, kemudian mereka katakan; Saamun 'alaika (kiranya kamu tertimpa kematian), maka katakanlah; wa'alaika (bahkan untukmu).\""
            },
            {
                "number": 6083,
                "arab": "بَاب حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ قَالَ حَدَّثَنِي شَقِيقٌ قَالَ قَالَ عَبْدُ اللَّهِكَأَنِّي أَنْظُرُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْكِي نَبِيًّا مِنْ الْأَنْبِيَاءِ ضَرَبَهُ قَوْمُهُ فَأَدْمَوْهُ فَهُوَ يَمْسَحُ الدَّمَ عَنْ وَجْهِهِ وَيَقُولُ رَبِّ اغْفِرْ لِقَوْمِي فَإِنَّهُمْ لَا يَعْلَمُونَ",
                "id": "Telah menceritakan kepada kami [Umar bin Hafsh] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al A'masy] mengatakan, telah menceritakan kepadaku [Syaqiq] mengatakan, [Abdullah] mengatakan, Seakan-akan aku melihat Nabi shallallahu 'alaihi wasallam mengisahkan seorang Nabi yang ditempeleng oleh kaumnya sambil ia menyeka darah dari wajahnya dan memanjatkan doa; 'ya Rabbi, ampunilah kaumku, sebab mereka adalah orang yang tidak tahu.'"
            },
            {
                "number": 6084,
                "arab": "حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ حَدَّثَنَا خَيْثَمَةُ حَدَّثَنَا سُوَيْدُ بْنُ غَفَلَةَ قَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُإِذَا حَدَّثْتُكُمْ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثًا فَوَاللَّهِ لَأَنْ أَخِرَّ مِنْ السَّمَاءِ أَحَبُّ إِلَيَّ مِنْ أَنْ أَكْذِبَ عَلَيْهِ وَإِذَا حَدَّثْتُكُمْ فِيمَا بَيْنِي وَبَيْنَكُمْ فَإِنَّ الْحَرْبَ خِدْعَةٌ وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ سَيَخْرُجُ قَوْمٌ فِي آخِرِ الزَّمَانِ أَحْدَاثُ الْأَسْنَانِ سُفَهَاءُ الْأَحْلَامِ يَقُولُونَ مِنْ خَيْرِ قَوْلِ الْبَرِيَّةِ لَا يُجَاوِزُ إِيمَانُهُمْ حَنَاجِرَهُمْ يَمْرُقُونَ مِنْ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنْ الرَّمِيَّةِ فَأَيْنَمَا لَقِيتُمُوهُمْ فَاقْتُلُوهُمْ فَإِنَّ فِي قَتْلِهِمْ أَجْرًا لِمَنْ قَتَلَهُمْ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Umar bin Hafsh bin Ghiyats] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al A'masy] telah menceritakan kepada kami [Khaitsumah] telah menceritakan kepada kami [Suwaid bin Ghaflah] mengatakan, [Ali] radliallahu 'anhu mengatakan; \"Jika saya menyampaikan sebuah hadits kepada kalian dari Rasulullah shallallahu 'alaihi wasallam, demi Allah, saya terjatuh dari langit adalah lebih aku sukai daripada aku mendustakannya. Karenanya, akan saya ceritakan kepada kalian sesuatu yang akan terjadi diantara saya dan kalian, sesungguhnya perang adalah tipu daya, dan aku mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Di akhir jaman nanti muncul suatu kaum yang umur-umur mereka masih muda, pikiran-pikiran mereka bodoh, mereka mengatakan dari sebaik-baik manusia, padahal iman mereka tak sampai melewati kerongkongan, mereka keluar dari agama sebagaimana anak panah keluar dari busurnya, dimanapun kalian menemukannya, bunuhlah dia, sebab siapa membunuhnya mendatangkan ganjaran pagi pelakunya di hari kiamat.\""
            },
            {
                "number": 6085,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ وَعَطَاءِ بْنِ يَسَارٍ أَنَّهُمَا أَتَيَا أَبَا سَعِيدٍ الْخُدْرِيَّفَسَأَلَاهُ عَنْ الْحَرُورِيَّةِ أَسَمِعْتَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا أَدْرِي مَا الْحَرُورِيَّةُ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَخْرُجُ فِي هَذِهِ الْأُمَّةِ وَلَمْ يَقُلْ مِنْهَا قَوْمٌ تَحْقِرُونَ صَلَاتَكُمْ مَعَ صَلَاتِهِمْ يَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ حُلُوقَهُمْ أَوْ حَنَاجِرَهُمْ يَمْرُقُونَ مِنْ الدِّينِ مُرُوقَ السَّهْمِ مِنْ الرَّمِيَّةِ فَيَنْظُرُ الرَّامِي إِلَى سَهْمِهِ إِلَى نَصْلِهِ إِلَى رِصَافِهِ فَيَتَمَارَى فِي الْفُوقَةِ هَلْ عَلِقَ بِهَا مِنْ الدَّمِ شَيْءٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul Wahhab] mengatakan, aku mendengar [Yahya bin Sa'id] mengatakan, Telah mengabarkan kepadaku [Muhammad bin Ibrahim] dari [Abu Salamah] dan ['Atho' bin Yasar] bahwasanya keduanya pernah mendatangi [Abu Sa'id Al Khudri] dan menanyainya tentang sekte Haruriyah; 'apakah engkau mendengar dari Nabi shallallahu 'alaihi wasallam? ' Ia mengatakan; 'Saya tidak tahu menahu tentang haruriyah, hanyasaja Aku mendengar Nabi Shallallahu'alaihi wasalalm bersabda; \"Akan muncul di kalangan umat ini -dan ia tidak mengatakan dari umat ini- suatu kaum yang kalian akan meremehkan sholat kalian bila di bandingkan dengan sholat mereka, mereka membaca al Qur`an namun tidak melewati kerongkongan atau tenggorokan mereka, mereka keluar dari agama sebagimana anak panah keluar dari busurnya, lantas sang pelempar melihat anak panahnya, mata panahnya hingga kain panahnya, hingga seolah-olah anak panah itu keluar dalam tempat senar, apakah ada darah yang menempel?\""
            },
            {
                "number": 6086,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سُلَيْمَانَ حَدَّثَنِي ابْنُ وَهْبٍ قَالَ حَدَّثَنِي عُمَرُ أَنَّ أَبَاهُ حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَوَذَكَرَ الْحَرُورِيَّةَ فَقَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْرُقُونَ مِنْ الْإِسْلَامِ مُرُوقَ السَّهْمِ مِنْ الرَّمِيَّةِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sulaiman] telah menceritakan kepadaku [Ibnu Wahb] mengatakan, telah menceritakan kepadaku [Umar] bahwasanya [Ayahnya] menceritakan kepadanya dari [Abdullah bin Umar] dan ia menceritakan tentang al hariuriyah, kemudian dia menuturkan; Nabi shallallahu 'alaihi wasallam bersabda: \"Mereka keluar dari Islam, sebagaimana anak panah keluar dari busurnya.\""
            },
            {
                "number": 6087,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا هِشَامٌ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ قَالَبَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْسِمُ جَاءَ عَبْدُ اللَّهِ بْنُ ذِي الْخُوَيْصِرَةِ التَّمِيمِيُّ فَقَالَ اعْدِلْ يَا رَسُولَ اللَّهِ فَقَالَ وَيْلَكَ وَمَنْ يَعْدِلُ إِذَا لَمْ أَعْدِلْ قَالَ عُمَرُ بْنُ الْخَطَّابِ دَعْنِي أَضْرِبْ عُنُقَهُ قَالَ دَعْهُ فَإِنَّ لَهُ أَصْحَابًا يَحْقِرُ أَحَدُكُمْ صَلَاتَهُ مَعَ صَلَاتِهِ وَصِيَامَهُ مَعَ صِيَامِهِ يَمْرُقُونَ مِنْ الدِّينِ كَمَا يَمْرُقُ السَّهْمُ مِنْ الرَّمِيَّةِ يُنْظَرُ فِي قُذَذِهِ فَلَا يُوجَدُ فِيهِ شَيْءٌ ثُمَّ يُنْظَرُ فِي نَصْلِهِ فَلَا يُوجَدُ فِيهِ شَيْءٌ ثُمَّ يُنْظَرُ فِي رِصَافِهِ فَلَا يُوجَدُ فِيهِ شَيْءٌ ثُمَّ يُنْظَرُ فِي نَضِيِّهِ فَلَا يُوجَدُ فِيهِ شَيْءٌ قَدْ سَبَقَ الْفَرْثَ وَالدَّمَ آيَتُهُمْ رَجُلٌ إِحْدَى يَدَيْهِ أَوْ قَالَ ثَدْيَيْهِ مِثْلُ ثَدْيِ الْمَرْأَةِ أَوْ قَالَ مِثْلُ الْبَضْعَةِ تَدَرْدَرُ يَخْرُجُونَ عَلَى حِينِ فُرْقَةٍ مِنْ النَّاسِ قَالَ أَبُو سَعِيدٍ أَشْهَدُ سَمِعْتُ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَشْهَدُ أَنَّ عَلِيًّا قَتَلَهُمْ وَأَنَا مَعَهُ جِيءَ بِالرَّجُلِ عَلَى النَّعْتِ الَّذِي نَعَتَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَنَزَلَتْ فِيهِ{ وَمِنْهُمْ مَنْ يَلْمِزُكَ فِي الصَّدَقَاتِ }",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad] telah menceritakan kepada kami [Hisyam] Telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah] dai [Abu Sa'id] mengatakan; Ketika Nabi shallallahu 'alaihi wasallam sedang membagi (harta rampasan), tiba-tiba Adbdullah bin Dzil huwaishirah At Tamimi datang seraya menegur Nabi; 'Hendaklah engkau berbuat adil! ' Spontan Nabi menjawab: \"siapa lagi yang berbuat adil jika aku tak berbuat adil?\" Umar kemudian berujar; 'Biarkan aku yang memenggal lehernya! ' Nabi bersabda; \"Biarkan saja dia, sebab dia mempunyai beberapa kawan yang salah seorang diantara kalian meremehkan sholatnya dibanding dengan sholatnya, dan meremehkan puasanya dibanding puasanya, mereka keluar dari agama sebagaimana anak panah keluar dari busur, ia melihat bulu anak panahnya namun tak ada apa-apa, kemudian memperhatikan mata anak panahnya namun tidak ditemukan apa-apa, kemudian melihat kain panahnya namun tidak didapatkan apa-apa, dan telah didahulu oleh kotoran dan darah. Tanda-tanda mereka adalah salah satu diantara kedua tangannya -atau- diantara kedua putingnya seperti puting kaum perempuan atau ia seperti daging yang bergerak-gerak, mereka muncul ketika manusia mengalami perpecahan.\" Sedang Abu Sa'id mengatakan; aku bersaksi bahwa aku mendengar dari Nabi shallallahu 'alaihi wasallam shallallahu 'alaihi wasallam, dan aku bersaksi bahwa 'Ali membunuh mereka dan aku bersamanya ketika didatangkan seseorang yang ciri-cirinya seperti yang disifatkan Nabi shallallahu 'alaihi wasallam, lantas diturunlah ayat; 'Diantara mereka ada yang mengolok-olokmu karena sedekah yang kamu infakkan' (QS. Attaubah 58)."
            },
            {
                "number": 6088,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ حَدَّثَنَا عَبْدُ الْوَاحِدِ حَدَّثَنَا الشَّيْبَانِيُّ حَدَّثَنَا يُسَيْرُ بْنُ عَمْرٍو قَالَ قُلْتُ لِسَهْلِ بْنِ حُنَيْفٍهَلْ سَمِعْتَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي الْخَوَارِجِ شَيْئًا قَالَ سَمِعْتُهُ يَقُولُ وَأَهْوَى بِيَدِهِ قِبَلَ الْعِرَاقِ يَخْرُجُ مِنْهُ قَوْمٌ يَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ تَرَاقِيَهُمْ يَمْرُقُونَ مِنْ الْإِسْلَامِ مُرُوقَ السَّهْمِ مِنْ الرَّمِيَّةِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Abdul Wahid] telah menceritakan kepada kami [Asy Syaibani] telah menceritakan kepada kami [Yusair bin Amru] mengatakan, aku bertanya kepada [Sahal bin Hunaif]; 'apakah engkau mendengar Nabi shallallahu 'alaihi wasallam bersabda tentang Khawarij? ' Ia menjawab; aku mendengar beliau bersabda; -sambil beliau arahkan tangannya menuju Irak- \"Dari sanalah muncul sekelompok kaum yang membaca al Qur`an tidak melebihi kerongkongan mereka, mereka keluar dari Islam sebagaimana anak panah keluar dari busurnya.\""
            },
            {
                "number": 6089,
                "arab": "حَدَّثَنَا عَلِيٌّ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا أَبُو الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقُومُ السَّاعَةُ حَتَّى تَقْتَتِلَ فِئَتَانِ دَعْوَاهُمَا وَاحِدَةٌ",
                "id": "Telah menceritakan kepada kami [Ali] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Abu Az Zanad] dari [Al A'raj] dari [Abu Hurairah] radliallahu 'anhu mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hari kiamat tidak terjadi hingga dua kelompok saling membunuh, padahal semboyan keduanya satu.\""
            },
            {
                "number": 6090,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا وَكِيعٌ ح و حَدَّثَنَا يَحْيَى حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ قَالَلَمَّا نَزَلَتْ هَذِهِ الْآيَةُ{ الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ }شَقَّ ذَلِكَ عَلَى أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالُوا أَيُّنَا لَمْ يَظْلِمْ نَفْسَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ كَمَا تَظُنُّونَ إِنَّمَا هُوَ كَمَا قَالَ لُقْمَانُ لِابْنِهِ{ يَا بُنَيَّ لَا تُشْرِكْ بِاللَّهِ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ }",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] Telah mengabarkan kepada kami [Waki'] -lewat jalur periwayatan lain-Telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Waki'] dari [Al A'masy] dari [Ibrahim] dari [Alqomah] dari ['Abdullah] radliallahu 'anhu mengatakan; tatkala turun ayat ini; 'Sesungguhnya orang yang beriman dan tidak mencampuradukkan keimanan mereka dengan kezaliman' (QS.Luqman 82), ayat ini sangat menggusarkan para sahabat Nabi shallallahu 'alaihi wasallam, sehingga mereka bertanya; 'Siapa diantara kami yang tidak melakukan kezaliman terhadap dirinya sendiri? ' lantas Rasulullah Shallallahu'alaihiwasallam bersabda: \"Bukan seperti yang kalian sangka, hanyasanya yang dimaksudkan adalah seperti ucapan Luqman kepada anaknya; 'Wahai anakku, janganlah engkau menyekutukan Allah, sebab menyekutukan Allah adalah kezhaliman yang besar\" (QS.Luqman 82)."
            },
            {
                "number": 6091,
                "arab": "حَدَّثَنَا عَبْدَانُ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ أَخْبَرَنِي مَحْمُودُ بْنُ الرَّبِيعِ قَالَ سَمِعْتُ عِتْبَانَ بْنَ مَالِكٍ يَقُولُغَدَا عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَجُلٌ أَيْنَ مَالِكُ بْنُ الدُّخْشُنِ فَقَالَ رَجُلٌ مِنَّا ذَلِكَ مُنَافِقٌ لَا يُحِبُّ اللَّهَ وَرَسُولَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا تَقُولُوهُ يَقُولُ لَا إِلَهَ إِلَّا اللَّهُ يَبْتَغِي بِذَلِكَ وَجْهَ اللَّهِ قَالَ بَلَى قَالَ فَإِنَّهُ لَا يُوَافَى عَبْدٌ يَوْمَ الْقِيَامَةِ بِهِ إِلَّا حَرَّمَ اللَّهُ عَلَيْهِ النَّارَ",
                "id": "Telah menceritakan kepada kami ['Abdan] Telah mengabarkan kepada kami [Abdullah] Telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] telah menceritakan kepadaku [Mahmud bin Rabi'] mengatakan, aku mendengar [Itban bin Malik] mengatakan, Rasulullah shallallahu 'alaihi wasallam pernah menemuiku, lantas ada seseorang bertanya; 'mana Malik bin Duhsyun? ' seseorang dari kami mengatakan; 'Dia munafik, tidak mencintai Allah dan Rasul-NYA.' Spontan Nabi shallallahu 'alaihi wasallam bersabda: \"Bukankah kalian katakan bahwa ia mengucapkan; laa-ilaaha-illallah, untuk mencari wajah Allah?\" Ia menjawab; 'Benar'. Maka Nabi bersabda: \"Tidaklah seorang hamba dipenuhi kecintaan kepada Allah, melainkan Allah mengharamkan neraka baginya di hari kiamat.\""
            },
            {
                "number": 6092,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ حُصَيْنٍ عَنْ فُلَانٍ قَالَ تَنَازَعَ أَبُو عَبْدِ الرَّحْمَنِ وَحِبَّانُ بْنُ عَطِيَّةَ فَقَالَ أَبُو عَبْدِ الرَّحْمَنِ لِحِبَّانَ لَقَدْ عَلِمْتُ مَا الَّذِي جَرَّأَ صَاحِبَكَ عَلَى الدِّمَاءِ يَعْنِي عَلِيًّا قَالَمَا هُوَ لَا أَبَا لَكَ قَالَ شَيْءٌ سَمِعْتُهُ يَقُولُهُ قَالَ مَا هُوَ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالزُّبَيْرَ وَأَبَا مَرْثَدٍ وَكُلُّنَا فَارِسٌ قَالَ انْطَلِقُوا حَتَّى تَأْتُوا رَوْضَةَ حَاجٍ قَالَ أَبُو سَلَمَةَ هَكَذَا قَالَ أَبُو عَوَانَةَ حَاجٍ فَإِنَّ فِيهَا امْرَأَةً مَعَهَا صَحِيفَةٌ مِنْ حَاطِبِ بْنِ أَبِي بَلْتَعَةَ إِلَى الْمُشْرِكِينَ فَأْتُونِي بِهَا فَانْطَلَقْنَا عَلَى أَفْرَاسِنَا حَتَّى أَدْرَكْنَاهَا حَيْثُ قَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسِيرُ عَلَى بَعِيرٍ لَهَا وَقَدْ كَانَ كَتَبَ إِلَى أَهْلِ مَكَّةَ بِمَسِيرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْهِمْ فَقُلْنَا أَيْنَ الْكِتَابُ الَّذِي مَعَكِ قَالَتْ مَا مَعِي كِتَابٌ فَأَنَخْنَا بِهَا بَعِيرَهَا فَابْتَغَيْنَا فِي رَحْلِهَا فَمَا وَجَدْنَا شَيْئًا فَقَالَ صَاحِبَايَ مَا نَرَى مَعَهَا كِتَابًا قَالَ فَقُلْتُ لَقَدْ عَلِمْنَا مَا كَذَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ حَلَفَ عَلِيٌّ وَالَّذِي يُحْلَفُ بِهِ لَتُخْرِجِنَّ الْكِتَابَ أَوْ لَأُجَرِّدَنَّكِ فَأَهْوَتْ إِلَى حُجْزَتِهَا وَهِيَ مُحْتَجِزَةٌ بِكِسَاءٍ فَأَخْرَجَتْ الصَّحِيفَةَ فَأَتَوْا بِهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ قَدْ خَانَ اللَّهَ وَرَسُولَهُ وَالْمُؤْمِنِينَ دَعْنِي فَأَضْرِبَ عُنُقَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا حَاطِبُ مَا حَمَلكَ عَلَى مَا صَنَعْتَ قَالَ يَا رَسُولَ اللَّهِ مَا لِي أَنْ لَا أَكُونَ مُؤْمِنًا بِاللَّهِ وَرَسُولِهِ وَلَكِنِّي أَرَدْتُ أَنْ يَكُونَ لِي عِنْدَ الْقَوْمِ يَدٌ يُدْفَعُ بِهَا عَنْ أَهْلِي وَمَالِي وَلَيْسَ مِنْ أَصْحَابِكَ أَحَدٌ إِلَّا لَهُ هُنَالِكَ مِنْ قَوْمِهِ مَنْ يَدْفَعُ اللَّهُ بِهِ عَنْ أَهْلِهِ وَمَالِهِ قَالَ صَدَقَ لَا تَقُولُوا لَهُ إِلَّا خَيْرًا قَالَ فَعَادَ عُمَرُ فَقَالَ يَا رَسُولَ اللَّهِ قَدْ خَانَ اللَّهَ وَرَسُولَهُ وَالْمُؤْمِنِينَ دَعْنِي فَلِأَضْرِبْ عُنُقَهُ قَالَ أَوَلَيْسَ مِنْ أَهْلِ بَدْرٍ وَمَا يُدْرِيكَ لَعَلَّ اللَّهَ اطَّلَعَ عَلَيْهِمْ فَقَالَ اعْمَلُوا مَا شِئْتُمْ فَقَدْ أَوْجَبْتُ لَكُمْ الْجَنَّةَ فَاغْرَوْرَقَتْ عَيْنَاهُ فَقَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُقَالَ أَبُو عَبْد اللَّهِ خَاخٍ أَصَحُّ وَلَكِنْ كَذَا قَالَ أَبُو عَوَانَةَ حَاجٍ وَحَاجٍ تَصْحِيفٌ وَهُوَ مَوْضِعٌ وَهُشَيْمٌ يَقُولُ خَاخٍ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Abu 'Awanah] dari [Hushain] dari [fulan] mengatakan, Abu Abdurrahman dan Hibban bin 'Uthayyah bersengketa. [Abu Abdurrahman] kemudian mengatakan kepada Hibban; 'Aku tahu alasan yang memotivasi kawanmu untuk menumpahkan darah.' Maksudnya [Ali bin Abi Thalib]. 'Apa itu? ' Tanya Hibban. Abu Abdurrahman menjawab; 'Sesuatu yang aku mendengar darinya secara langsung.' 'Apa itu? ' Tanya Hibban. Abu Abdurrahman melanjutkan; dia berkata; Rasulullah shallallahu 'alaihi wasallam mengutusku bersama Zubair dan Abu Murtsad. Masing-masing kami ketika itu menunggang kuda. Nabi berpesan: \"Berangkatlah kalian hingga kalian sampai ke Raudah Haj.\" Kata Abu Salamah demikian, namun Abu Awanah mengatakan dengan redaksi; 'Haj'.\"disana ada seorang wanita yang membawa surat Hathib bin Abi Baltha'ah kepada kaum musyrikin, bawalah surat itu kepadaku.\" Lantas kami berangkat menunggang kuda kami hingga kami menemukan wanita itu sebagaimana yang disabdakan Nabi kepada kami, yaitu ia berada diatas untanya. Ketika itu Hathib bin Abi Baltha'ah telah berkirim surat kepada penduduk Makkah yang isinya mengabarkan keberangkatan Rasulullah Shallallahu'alaihiwasallam kepada mereka. Maka kami bertanya kepada wanita tersebut; 'Mana surat yang ada bersamamu? ' 'Saya tak membawa surat apapun' Jawab wanita tersebut. Maka kami menderumkan untanya, Kami mencari-cari surat itu di barang-barang bawaannya namun tidak kami dapatkan apa-apa. Kedua kawan kami mengatakan; 'Menurut hemat kami, dia tak membawa surat! ' Saya jawab; 'Kita sama-sama tahu bahwa Rasulullah shallallahu 'alaihi wasallam tak mungkin bohong.' Maka Ali bersumpah dengan mengatakan; 'Demi Dzat yang dijadikan untuk bersumpah, sekarang kamu harus mengeluarkan surat itu, atau kami benar-benar menelanjangimu.' Spontan wanita tersebut meraih ikat pinggangnya dan pada saat itu dia mengenakan ikat pinggang terbuat dari kain, dan mengeluarkan surat tersebut. Kemudian mereka membawa surat itu kepada Rasulullah Shallallahu'alaihiwasallam. Umar berkata; 'ya Rasulullah, sungguh Hathib telah mengkhianati Allah dan rasul-NYA dan juga orang-orang mukmin, biarkan diriku memenggal lehernya.' Rasulullah shallallahu 'alaihi wasallam bertanya kepada Hathib: \"Hai Hathib, apa yang mendorongmu untuk berbuat seperti itu?\" Hathib menjawab; 'ya Rasulullah, Bukan berarti saya tidak beriman kepada Allah dan rasul-NYA, akan tetapi saya ingin mempunyai di tengah-tengah kaum (di Makkah) tangan yang membela keluarga dan hartaku, dan saya berpikir tak ada satupun dari sahabatmu melainkan dia juga disana mempunyai keluarga yang lewat perantaraannya Allah menjaga keluarga dan hartanya dari kaumnya.' Maka Nabi menjawab; \"Ia jujur, maka janganlah kalian berkomentar terhadapnya selain kebaikan.\" Namun Umar belum juga reda kemarahannya sehingga kembali mengatakan; 'ya Rasulullah, ia telah berkhianat kepada Allah dan rasul-Nya dan juga orang-orang mukmin, biarkan aku memenggal kepalanya.' Spontan Nabi shallallahu 'alaihi wasallam menegur: \"bukankah dia termasuk orang yang mengikuti perang Badar? apakah kamu tahu, barangkali Allah telah melihat orang-orang yang mengikuti perang badar lantas mengatakan; 'lakukanlah sekehendak kalian, Aku telah mewajibkan surga bagi kalian!\" Kedua mata Umar pun berlinang, dan berujar; 'Allah dan Rasul-Nya-lah yang lebih tahu! ' Abu Abdullah mengatakan mengenai tempat diatas; 'Khah adalah lebih sahih, namun beginilah Abu 'Awanah mengatakan, haj. Padahal haj adalah kesalahan tulis. Haj adalah nama tempat, sedang [Husyaim] mengatakan Khah (dengan huruf akhir Kha' bukan jim).'"
            },
            {
                "number": 6093,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنَا اللَّيْثُ عَنْ خَالِدِ بْنِ يَزِيدَ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ عَنْ هِلَالِ بْنِ أُسَامَةَ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ أَخْبَرَهُ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو فِي الصَّلَاةِ اللَّهُمَّ أَنْجِ عَيَّاشَ بْنَ أَبِي رَبِيعَةَ وَسَلَمَةَ بْنَ هِشَامٍ وَالْوَلِيدَ بْنَ الْوَلِيدِ اللَّهُمَّ أَنْجِ الْمُسْتَضْعَفِينَ مِنْ الْمُؤْمِنِينَ اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ وَابْعَثْ عَلَيْهِمْ سِنِينَ كَسِنِي يُوسُفَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari [Khalid bin Yazid] dari [Sa'id bin Abi Hilal] dari [Hilal bin Usamah], bahwasanya [Abu Salamah bin Abdurrahman] mengabarkan kepadanya dari [Abu Hurairah], bahwasanya Nabi shallallahu 'alaihi wasallam dalam sholatnya berdoa: \"Ya Allah, selamatkanlah 'Ayyasy bin Abi rabi'ah, Salamah bin Hisyam, Walid bin Al Walid, Ya Allah selamatkanlah orang-orang lemah dari kalangan orang-orang mukmin, ya Allah, kokohkanlah penyengsaraanmu terhadap Mudhar, dan kirimkanlah musim paceklik kepada mereka, sebagaimana paceklik yang menimpa Yusuf.\""
            },
            {
                "number": 6094,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَوْشَبٍ الطَّائِفِيُّ حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثٌ مَنْ كُنَّ فِيهِ وَجَدَ حَلَاوَةَ الْإِيمَانِ أَنْ يَكُونَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا وَأَنْ يُحِبَّ الْمَرْءَ لَا يُحِبُّهُ إِلَّا لِلَّهِ وَأَنْ يَكْرَهَ أَنْ يَعُودَ فِي الْكُفْرِ كَمَا يَكْرَهُ أَنْ يُقْذَفَ فِي النَّارِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Hausyab Ath Tha`ifi] telah menceritakan kepada kami [Abdul Wahhab] telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dari [Anas] radliallahu 'anhu mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada tiga hal yang jika seseorang melaksanakannya, ia mendapat kemanisan iman, Allah dan rasul-NYA lebih ia cintai daripada selain keduanya, ia mencintai seseorang dengan tiada dorongan selain karena Allah, dan benci kembali kepada kekafiran sebagaimana kebenciannya untuk dilempar ke neraka.\""
            },
            {
                "number": 6095,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ حَدَّثَنَا عَبَّادٌ عَنْ إِسْمَاعِيلَ سَمِعْتُ قَيْسًا سَمِعْتُ سَعِيدَ بْنَ زَيْدٍ يَقُولُلَقَدْ رَأَيْتُنِي وَإِنَّ عُمَرَ مُوثِقِي عَلَى الْإِسْلَامِ وَلَوْ انْقَضَّ أُحُدٌ مِمَّا فَعَلْتُمْ بِعُثْمَانَ كَانَ مَحْقُوقًا أَنْ يَنْقَضَّ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Sulaiman] telah menceritakan kepada kami [Abbad] dari [Isma'il] aku mendengar [Qais] aku mendengar [Sa'id bin Zaid] mengatakan; aku pernah bermimpi bahwa Umar adalah peneguhku terhadap Islam, dan sekiranya gunung Uhud runtuh karena perlakuan kalian terhadap Utsman, niscaya gunung itu pun runtuh.'"
            },
            {
                "number": 6096,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ إِسْمَاعِيلَ حَدَّثَنَا قَيْسٌ عَنْ خَبَّابِ بْنِ الْأَرَتِّ قَالَشَكَوْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُتَوَسِّدٌ بُرْدَةً لَهُ فِي ظِلِّ الْكَعْبَةِ فَقُلْنَا أَلَا تَسْتَنْصِرُ لَنَا أَلَا تَدْعُو لَنَا فَقَالَ قَدْ كَانَ مَنْ قَبْلَكُمْ يُؤْخَذُ الرَّجُلُ فَيُحْفَرُ لَهُ فِي الْأَرْضِ فَيُجْعَلُ فِيهَا فَيُجَاءُ بِالْمِنْشَارِ فَيُوضَعُ عَلَى رَأْسِهِ فَيُجْعَلُ نِصْفَيْنِ وَيُمْشَطُ بِأَمْشَاطِ الْحَدِيدِ مَا دُونَ لَحْمِهِ وَعَظْمِهِ فَمَا يَصُدُّهُ ذَلِكَ عَنْ دِينِهِ وَاللَّهِ لَيَتِمَّنَّ هَذَا الْأَمْرُ حَتَّى يَسِيرَ الرَّاكِبُ مِنْ صَنْعَاءَ إِلَى حَضْرَمَوْتَ لَا يَخَافُ إِلَّا اللَّهَ وَالذِّئْبَ عَلَى غَنَمِهِ وَلَكِنَّكُمْ تَسْتَعْجِلُونَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Isma'il] telah menceritakan kepada kami [Qais] dari [Khabbab bin Al Arat] mengatakan, kami pernah mengeluhkan penderitaan kepada Rasulullah Shallallahu'alaihiwasallam yang ketika itu beliau beralaskan kain panjangnya di naungan ka'bah. Maka kami mengadu; 'Tidakkah engkau meminta pertolongan untuk kami? Tidakkah engkau berdoa untuk kami? ' maka beliau bersabda; \"Sungguh sebelum kalian ada orang yang diringkus kemudian digalikan lubang baginya dan ia ditimbun disana, lantas didatangkan gergaji dan diletakkan di kepalanya, sehingga kepalanya terbelah menjadi dua, dan ada yang disisir dengan sisir besi sehingga memisahkan tulang dan dagingnya namun semua siksaan itu tidak memalingkannya dari agamanya, demi Allah, perkara ini akan sempurna sehingga seorang pengendara bisa berjalan dari Shan'a hingga Hadramaut, dan ia tidak khawatir selain kepada Allah dan srigala yang akan menerkam kambingnya, namun kalian ini orang yang suka tergesa-gesa.\""
            },
            {
                "number": 6097,
                "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا اللَّيْثُ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَبَيْنَمَا نَحْنُ فِي الْمَسْجِدِ إِذْ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ انْطَلِقُوا إِلَى يَهُودَ فَخَرَجْنَا مَعَهُ حَتَّى جِئْنَا بَيْتَ الْمِدْرَاسِ فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَادَاهُمْ يَا مَعْشَرَ يَهُودَ أَسْلِمُوا تَسْلَمُوا فَقَالُوا قَدْ بَلَّغْتَ يَا أَبَا الْقَاسِمِ فَقَالَ ذَلِكَ أُرِيدُ ثُمَّ قَالَهَا الثَّانِيَةَ فَقَالُوا قَدْ بَلَّغْتَ يَا أَبَا الْقَاسِمِ ثُمَّ قَالَ الثَّالِثَةَ فَقَالَ اعْلَمُوا أَنَّ الْأَرْضَ لِلَّهِ وَرَسُولِهِ وَإِنِّي أُرِيدُ أَنْ أُجْلِيَكُمْ فَمَنْ وَجَدَ مِنْكُمْ بِمَالِهِ شَيْئًا فَلْيَبِعْهُ وَإِلَّا فَاعْلَمُوا أَنَّمَا الْأَرْضُ لِلَّهِ وَرَسُولِهِ",
                "id": "Telah menceritakan kepada kami [Abdul Aziz bin Abdullah] telah menceritakan kepada kami [Al Laits] dari [Sa'id Al Maqburi] dari [ayahnya] dari [Abu Hurairah] radliallahu 'anhu; ketika kami di masjid, tiba-tiba Rasulullah shallallahu 'alaihi wasallam menemui kami dan berujar: \"Ayo kita pergi ke kaum yahudi, \" maka kami berangkat bersama beliau, hingga kami tiba di Baitil Midras, Nabi shallallahu 'alaihi wasallam berdiri dan menyeru mereka; \"Wahai sekalian kaum yahudi, masuklah ke dalam Islam, maka kalian akan selamat.\" 'Telah engkau sampaikan wahai Abul Qasim' Sambut mereka.\"Itulah yang kuinginkan sebenarnya\" Kata Nabi. Nabi mengulang ajakannya dua kali dan mereka memberi jawaban sama; 'Telah engkau sampaikan wahai Abul qasim.' Nabi mengajak mereka untuk kali ketiga, dan berujar kepada mereka: \"Ketahuilah, bahwasanya bumi ini adalah milik Allah dan rasul-NYA, dan saya ingin mengusir kalian, maka siapa diantara kalian yang mendapatkan sesuatu dengan hartanya, juallah, kalaulah tidak, ketahuilah bumi hanyalah milik Allah dan rasul-NYA.\""
            },
            {
                "number": 6098,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَبْدِ الرَّحْمَنِ وَمُجَمِّعٍ ابْنَيْ يَزِيدَ بْنِ جَارِيَةَ الْأَنْصَارِيِّ عَنْ خَنْسَاءَ بِنْتِ خِذَامٍ الْأَنْصَارِيَّةِأَنَّ أَبَاهَا زَوَّجَهَا وَهِيَ ثَيِّبٌ فَكَرِهَتْ ذَلِكَ فَأَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَدَّ نِكَاحَهَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Qaza'ah] telah menceritakan kepada kami [Malik] dari ['Abdurrahman bin Al Qasim] dari [ayahnya] dari ['Abdurrahman] dan [Mujamma'], dua anak Yazid bin Jariyah Al Anshari, dari [Khansa' binti Khidzam Al Anshariyah]; bahwa ayahnya mengawinkannya -ketika itu ia janda-dengan lak-laki yang tidak disukainya, kemudian dia menemui Nabi shallallahu 'alaihi wasallam dan beliau membatalkan pernikahannya."
            },
            {
                "number": 6099,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ أَبِي عَمْرٍو هُوَ ذَكْوَانُ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقُلْتُ يَا رَسُولَ اللَّهِ يُسْتَأْمَرُ النِّسَاءُ فِي أَبْضَاعِهِنَّ قَالَ نَعَمْ قُلْتُ فَإِنَّ الْبِكْرَ تُسْتَأْمَرُ فَتَسْتَحْيِي فَتَسْكُتُ قَالَ سُكَاتُهَا إِذْنُهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Ibnu Juraij] dari [Ibnu Abi Mulaikah] dari [Abu Amru] alias Dzakwan, dari [Aisyah] radliallahu 'anhuma mengatakan, saya berkata; 'ya Rasulullah, apakah wanita dimintai izin pada kemaluan mereka? ' Nabi menjawab: \"iya.\" Saya bertanya; 'sungguh gadis merasa malu lantas ia memilih diam jika dimintai persetujuannya.' Nabi shallallahu 'alaihi wasallam menjawab; \"jika ia diam, itulah tanda persetujuannya.\""
            },
            {
                "number": 6100,
                "arab": "حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُأَنَّ رَجُلًا مِنْ الْأَنْصَارِ دَبَّرَ مَمْلُوكًا وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ يَشْتَرِيهِ مِنِّي فَاشْتَرَاهُ نُعَيْمُ بْنُ النَّحَّامِ بِثَمَانِ مِائَةِ دِرْهَمٍ قَالَ فَسَمِعْتُ جَابِرًا يَقُولُ عَبْدًا قِبْطِيًّا مَاتَ عَامَ أَوَّلَ",
                "id": "Telah menceritakan kepada kami [Abu Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari [Amru bin Dinar] dari [Jabir] radliallahu 'anhu, ada seorang laki-laki anshar menjanjikan kemerdekaan budaknya (mudabbar) padahal ia tak punya harta selainnya. Berita ini sampai kepada Rasulullah shallallahu 'alaihi wasallam, maka beliau bertanya: \"Siapa mau membelinya dariku?\" Selanjutnya budak itu dibeli oleh Nu'aim bin Najjam seharga delapan ratus dirham. Kata Amru bin dinar, lalu kudengar Jabir mengatakan; 'budak qibthi yang meninggal di tahun pertama.'"
            },
            {
                "number": 6101,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مَنْصُورٍ حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ حَدَّثَنَا الشَّيْبَانِيُّ سُلَيْمَانُ بْنُ فَيْرُوزٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ الشَّيْبَانِيُّ وَحَدَّثَنِي عَطَاءٌ أَبُو الحَسَنِ السُّوَائِيُّ وَلَا أَظُنُّهُ إِلَّا ذَكَرَهُ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا{ يَا أَيُّهَا الَّذِينَ آمَنُوا لَا يَحِلُّ لَكُمْ أَنْ تَرِثُوا النِّسَاءَ كَرْهًا }الْآيَةَ قَالَ كَانُوا إِذَا مَاتَ الرَّجُلُ كَانَ أَوْلِيَاؤُهُ أَحَقَّ بِامْرَأَتِهِ إِنْ شَاءَ بَعْضُهُمْ تَزَوَّجَهَا وَإِنْ شَاءُوا زَوَّجَهَا وَإِنْ شَاءُوا لَمْ يُزَوِّجْهَا فَهُمْ أَحَقُّ بِهَا مِنْ أَهْلِهَا فَنَزَلَتْ هَذِهِ الْآيَةُ فِي ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Husain bin Manshur] telah menceritakan kepada kami [Asbath bin Muhammad] telah menceritakan kepada kami [Asy Syaibani Sulaiman bin fairuz] dari [Ikrimah] dari [Ibnu 'Abbas], Asy Syaibani mengatakan, dan telah menceritakan kepadaku ['Atho' Abul hasan As suwa`i] dan setahuku dia tidak menyebutnya selain dari Ibnu 'Abbas radliallahu 'anhuma; 'Hai orang-orang yang beriman, tidak dihalalkan bagi kalian menguasai wanita secara paksa (QS.Annisa'; 19), dia berkata mengenai ayat ini; Dahulu jika seseorang meninggal, maka wali si laki-laki yang meninggal lah yang paling berhak terhadap isterinya, jika berkenan mereka kawini, atau mereka kawinkan dengan orang lain, atau mereka biarkan terkatung-katung, merekalah yang paling berhak terhadapnya daripada keluarga wanita itu sendiri, sehingga turunlah ayat ini yang menyelesaikan masalah itu."
            },
            {
                "number": 6102,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ حَدَّثَنَا شُعَيْبٌ حَدَّثَنَا أَبُو الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَاجَرَ إِبْرَاهِيمُ بِسَارَةَ دَخَلَ بِهَا قَرْيَةً فِيهَا مَلِكٌ مِنْ الْمُلُوكِ أَوْ جَبَّارٌ مِنْ الْجَبَابِرَةِ فَأَرْسَلَ إِلَيْهِ أَنْ أَرْسِلْ إِلَيَّ بِهَا فَأَرْسَلَ بِهَا فَقَامَ إِلَيْهَا فَقَامَتْ تَوَضَّأُ وَتُصَلِّي فَقَالَتْ اللَّهُمَّ إِنْ كُنْتُ آمَنْتُ بِكَ وَبِرَسُولِكَ فَلَا تُسَلِّطْ عَلَيَّ الْكَافِرَ فَغُطَّ حَتَّى رَكَضَ بِرِجْلِهِ",
                "id": "Telah menceritakan kepada kami [Abul Yaman] telah menceritakan kepada kami [Syu'aib] telah menceritakan kepada kami [Abu Az Zanad] dari [Al A'raj] dari [Abu Hurairah] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ibrahim berhijrah bersama Sarah, kemudian mereka memasuki suatu desa yang dipimpin oleh seorang raja atau diktator. Raja mengutus seorang ajudan untuk menemui Ibrahim; 'Panggil Ibrahim untuk menghadapku bersama isterinya', lantas sang ajudan membawa isterinya kepada sang raja. Ketika raja berdiri menghadap Sarah, Sarah lantas berwudhu dan sholat dan memanjatkan doa; 'Ya Allah, jika aku beriman terhadap-Mu dan rasul-Mu, maka janganlah Engkau kuasakan seorang kafir kepada kami', ketika itu pula kaki sang raja terbenam ke dalam bumi hingga meronta-ronta dengan kakinya.\""
            },
            {
                "number": 6103,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ أَنَّ سَالِمًا أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَظْلِمُهُ وَلَا يُسْلِمُهُ وَمَنْ كَانَ فِي حَاجَةِ أَخِيهِ كَانَ اللَّهُ فِي حَاجَتِهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari [Uqail] dari [Ibnu Syihab], bahwa [Salim] mengabarinya, bahwasanya [Abdullah bin Umar] radliallahu 'anhuma mengabarinya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang muslim adalah saudara muslim lainnya, tidak menzhaliminya dan tidak menyerahkannya kepada musuh, barangsiapa yang memenuhi kebutuhan saudaranya, maka Allah akan memenuhi kebutuhannya.\""
            },
            {
                "number": 6104,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ أَنَسٍ عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْصُرْ أَخَاكَ ظَالِمًا أَوْ مَظْلُومًا فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَنْصُرُهُ إِذَا كَانَ مَظْلُومًا أَفَرَأَيْتَ إِذَا كَانَ ظَالِمًا كَيْفَ أَنْصُرُهُ قَالَ تَحْجُزُهُ أَوْ تَمْنَعُهُ مِنْ الظُّلْمِ فَإِنَّ ذَلِكَ نَصْرُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdurrahim] telah menceritakan kepada kami [Sa'id bin Sulaiman] telah menceritakan kepada kami [Husyaim] Telah mengabarkan kepada kami [ubaidhullah bin Abi Bakr bin Anas] dari [Anas] radliallahu 'anhu mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"'Tolonglah saudaramu baik ia zhalim atau dizhalimi.\" Ada seorang laki-laki bertanya; 'ya Rasulullah, saya maklum jika ia dizhalimi, namun bagaimana saya menolong padahal ia zhalim? ' Nabi menjawab; \"engkau mencegahnya atau menahannya dari kezhaliman, itulah cara menolongnya.\""
            },
            {
                "number": 6105,
                "arab": "حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ يَخْطُبُ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَا أَيُّهَا النَّاسُ إِنَّمَا الْأَعْمَالُ بِالنِّيَّةِ وَإِنَّمَا لِامْرِئٍ مَا نَوَى فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ وَمَنْ هَاجَرَ إِلَى دُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَتَزَوَّجُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin Sa'id] dari [Muhammad bin Ibrahim] dari [Alqomah bin Waqqash] mengatakan, aku mendengar [Umar bin Khaththab] radliallahu 'anhu berpidato, dia mengatakan, aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Hai manusia, hanyasanya amal itu tergantung niyatnya, dan setiap orang mendapatkan sesuai yang diniatkan, barangsiapa hijrahnya karena Allah dan rasul-Nya,, maka hijrahnya dihitung karena Allah dan rasul-Nya, barangsiapa hijrahnya karena dunia yang ingin diperolehnya, atau wanita yang ingin dinikahinya, maka hijrahnya sekedar mendapat yang diniatkan.\""
            },
            {
                "number": 6106,
                "arab": "حَدَّثَنِي إِسْحَاقُ بْنُ نَصْرٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ هَمَّامٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَقْبَلُ اللَّهُ صَلَاةَ أَحَدِكُمْ إِذَا أَحْدَثَ حَتَّى يَتَوَضَّأَ",
                "id": "Telah menceritakan kepadaku [Ishaq bin Nashr] telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Hammam] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Allah tidak menerima sholat salah seorang diantara kalian jika berhadas hingga ia berwudhu.\""
            },
            {
                "number": 6107,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا ثُمَامَةُ بْنُ عَبْدِ اللَّهِ بْنِ أَنَسٍ أَنَّ أَنَسًا حَدَّثَهُأَنَّ أَبَا بَكْرٍ كَتَبَ لَهُ فَرِيضَةَ الصَّدَقَةِ الَّتِي فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا يُجْمَعُ بَيْنَ مُتَفَرِّقٍ وَلَا يُفَرَّقُ بَيْنَ مُجْتَمِعٍ خَشْيَةَ الصَّدَقَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah Al Anshari] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Tsumamah bin Abdullah bin Anas] bahwasanya [Anas] menceritakan kepadanya, bahwasanya Abu Bakar menuliskan kepadanya kewajiban sedekah sebagaimana Rasulullah Shallallahu'alaihiwasallam wajibkan, hewan ternak yang terpisah tidak boleh dihimpun dan hewan yang terhimpun tidak boleh dipisah, karena takut sedekah (zakat) nya."
            },
            {
                "number": 6108,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ عَنْ أَبِي سُهَيْلٍ عَنْ أَبِيهِ عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِأَنَّ أَعْرَابِيًّا جَاءَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَائِرَ الرَّأْسِ فَقَالَ يَا رَسُولَ اللَّهِ أَخْبِرْنِي مَاذَا فَرَضَ اللَّهُ عَلَيَّ مِنْ الصَّلَاةِ فَقَالَ الصَّلَوَاتِ الْخَمْسَ إِلَّا أَنْ تَطَوَّعَ شَيْئًا فَقَالَ أَخْبِرْنِي بِمَا فَرَضَ اللَّهُ عَلَيَّ مِنْ الصِّيَامِ قَالَ شَهْرَ رَمَضَانَ إِلَّا أَنْ تَطَوَّعَ شَيْئًا قَالَ أَخْبِرْنِي بِمَا فَرَضَ اللَّهُ عَلَيَّ مِنْ الزَّكَاةِ قَالَ فَأَخْبَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرَائِعَ الْإِسْلَامِ قَالَ وَالَّذِي أَكْرَمَكَ لَا أَتَطَوَّعُ شَيْئًا وَلَا أَنْقُصُ مِمَّا فَرَضَ اللَّهُ عَلَيَّ شَيْئًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْلَحَ إِنْ صَدَقَ أَوْ دَخَلَ الْجَنَّةَ إِنْ صَدَقَوَقَالَ بَعْضُ النَّاسِ فِي عِشْرِينَ وَمِائَةِ بَعِيرٍ حِقَّتَانِ فَإِنْ أَهْلَكَهَا مُتَعَمِّدًا أَوْ وَهَبَهَا أَوْ احْتَالَ فِيهَا فِرَارًا مِنْ الزَّكَاةِ فَلَا شَيْءَ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Isma'il bin ja'far] dari [Abu Suhail] dari [ayahnya] dari [Thalhah bin ubaidhullah]; ada seorang arab badui menemui Rasulullah shallallahu 'alaihi wasallam dengan rambut acak-acakan, ia berkata; 'ya Rasulullah, beritahukanlah kepadaku sholat apakah yang Allah wajibkan atasku? ' Nabi menjawab: \"sholat lima waktu, kecuali jika engkau mau mengerjakan yang sunnah.\" Si arab badui bertanya lagi: 'Beritahukanlah kepadaku puasa apakah yang Allah wajibkan bagiku? ' Nabi menjawab: \"puasa bulan ramadhan, kecuali jika kamu ingin melaksanakan yang sunnah.\" Si arab badui bertanya; 'Beritahukanlah kepadaku, zakat apakah yang Allah wajibkan atasku? ' maka Rasulullah shallallahu 'alaihi wasallam memberitahukan kepadanya syariat-syariat Islam, dan arab badui tersebut mengatakan; 'Demi Dzat yang memuliakanmu, saya tidak akan melakukan yang sunnah, namun juga tak akan mengurangi sedikitpun yang telah Allah fardhukan atas diriku.' Maka Rasulullah bersabda; \"dia beruntung jika ia jujur atau dengan redaksi -ia masuk surga jika jujur.\" Penulis menuturkan; Sebagian orang mengatakan, bahwa seratus duapuluh unta zakatnya dua hiqqah, dan jika yang punya membelanjakannya secara sengaja, atau meng-hibahkannya atau mencari siasat terhadapnya dengan tujuan untuk tidak berzakat, maka yang demikian dia tak terkena dosa."
            },
            {
                "number": 6109,
                "arab": "حَدَّثَنِي إِسْحَاقُ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامٍ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكُونُ كَنْزُ أَحَدِكُمْ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ يَفِرُّ مِنْهُ صَاحِبُهُ فَيَطْلُبُهُ وَيَقُولُ أَنَا كَنْزُكَ قَالَ وَاللَّهِ لَنْ يَزَالَ يَطْلُبُهُ حَتَّى يَبْسُطَ يَدَهُ فَيُلْقِمَهَا فَاهُ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا مَا رَبُّ النَّعَمِ لَمْ يُعْطِ حَقَّهَا تُسَلَّطُ عَلَيْهِ يَوْمَ الْقِيَامَةِ فَتَخْبِطُ وَجْهَهُ بِأَخْفَافِهَاوَقَالَ بَعْضُ النَّاسِ فِي رَجُلٍ لَهُ إِبِلٌ فَخَافَ أَنْ تَجِبَ عَلَيْهِ الصَّدَقَةُ فَبَاعَهَا بِإِبِلٍ مِثْلِهَا أَوْ بِغَنَمٍ أَوْ بِبَقَرٍ أَوْ بِدَرَاهِمَ فِرَارًا مِنْ الصَّدَقَةِ بِيَوْمٍ احْتِيَالًا فَلَا بَأْسَ عَلَيْهِ وَهُوَ يَقُولُ إِنْ زَكَّى إِبِلَهُ قَبْلَ أَنْ يَحُولَ الْحَوْلُ بِيَوْمٍ أَوْ بِسِتَّةٍ جَازَتْ عَنْهُ",
                "id": "Telah menceritakan kepadaku [Ishaq] telah menceritakan kepada kami [Abdurrazzaq] telah menceritakan kepada kami [Ma'mar] dari [Hammam] dari [Abu Hurairah] radliallahu 'anhu mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Harta salah seorang diantara kalian (jika tidak dizakati), maka pada hari kiamat menjadi ular yang menyeramkan, pemilik harta itu berusaha menyelamatkan diri namun si ular terus memburunya sambil mengatakan; 'aku adalah hartamu, ' Demi Allah, si ular itu tiada henti memburunya hingga orang yang mempunyai harta membentangkan tangannya dan dia melahapnya.\" Dan Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika pemilik unta tidak memberikan haknya, maka pada hari kiamat unta tersebut melawannya hingga menginjak-injak wajahnya dengan kuku kakinya.\" - Sebagian orang mengatakan bahwa jika seseorang yang mempunyai unta lantas khawatir terkena kewajiban zakat, lalu sehari sebelum haul tiba ia menjualnya dengan unta semisal atau kambing atau sapi, atau dirham dengan niat agar tidak terkena wajib zakat, maka tak ada dosa baginya. Dan dia mengatakan; jika ia menzakati untanya sehari sebelum haul tiba, atau enam hari sebelumnya, maka juga diperbolehkan."
            },
            {
                "number": 6110,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّهُقَالَ اسْتَفْتَى سَعْدُ بْنُ عُبَادَةَ الْأَنْصَارِيُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَذْرٍ كَانَ عَلَى أُمِّهِ تُوُفِّيَتْ قَبْلَ أَنْ تَقْضِيَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْضِهِ عَنْهَاوَقَالَ بَعْضُ النَّاسِ إِذَا بَلَغَتْ الْإِبِلُ عِشْرِينَ فَفِيهَا أَرْبَعُ شِيَاهٍ فَإِنْ وَهَبَهَا قَبْلَ الْحَوْلِ أَوْ بَاعَهَا فِرَارًا وَاحْتِيَالًا لِإِسْقَاطِ الزَّكَاةِ فَلَا شَيْءَ عَلَيْهِ وَكَذَلِكَ إِنْ أَتْلَفَهَا فَمَاتَ فَلَا شَيْءَ فِي مَالِهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Ibnu Syihab] dari [ubaidhullah bin Abdullah bin Utbah] dari [Ibnu Abbas] bahwasanya ia mengatakan, Sa'ad bin Ubadah Al Anshari pernah meminta fatwa Rasulullah Shallallahu'alaihiwasallam tentang nadzar ibunya yang meninggal sebelum menunaikan nadzarnya. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penuhilah nadzarnya\". Sebagian orang mengatakan bahwa jika unta mencapai dua puluh ekor sehingga ia berkewajiban membayar zakat empat ekor kambing, lalu dia menghibahkan unta itu sebelum haul, atau menjualnya dengan niat atau siasat agar tidak terkena wajib zakat, maka tidak ada denda atasnya, demikian pula jika ia menyembunyikannya terus meninggal, maka tidak ada denda dalam hartanya."
            },
            {
                "number": 6111,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الشِّغَارِقُلْتُ لِنَافِعٍ مَا الشِّغَارُ قَالَ يَنْكِحُ ابْنَةَ الرَّجُلِ وَيُنْكِحُهُ ابْنَتَهُ بِغَيْرِ صَدَاقٍ وَيَنْكِحُ أُخْتَ الرَّجُلِ وَيُنْكِحُهُ أُخْتَهُ بِغَيْرِ صَدَاقٍ وَقَالَ بَعْضُ النَّاسِ إِنْ احْتَالَ حَتَّى تَزَوَّجَ عَلَى الشِّغَارِ فَهُوَ جَائِزٌ وَالشَّرْطُ بَاطِلٌ وَقَالَ فِي الْمُتْعَةِ النِّكَاحُ فَاسِدٌ وَالشَّرْطُ بَاطِلٌ وَقَالَ بَعْضُهُمْ الْمُتْعَةُ وَالشِّغَارُ جَائِزٌ وَالشَّرْطُ بَاطِلٌ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya bin Sa'id] dari [ubaidhullah] mengatakan, telah menceritakan kepadaku [Nafi'] dari ['Abdullah] radliallahu 'anhu, Rasulullah Shallallahu'alaihiwasallam melarang nikah syighar. Saya bertanya kepada Nafi'; 'Apa maksud syighar? ' Ia menjawab; 'mengawini anak perempuan seseorang lelaki dengan syarat lelaki tersebut dinikahkan dengan anak perempuannya tanpa mahar, atau menikahi saudara perempuan seorang lelaki dengan syarat lelaki tersebut menikahkannya dengan saudara perempuannya tanpa mahar.' Sebagian orang berpendapat; jika seseorang bersiasat sehingga ia nikah syighar, maka perkawinannya boleh dan syaratnya bathil. Dan ia berkata tentang nikah mut'ah; pernikahannya rusak dan syaratnya bathil. Sedang sebagian lain berpendapat bahwa nikah syighar boleh dan syaratnya bathil."
            },
            {
                "number": 6112,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ حَدَّثَنَا الزُّهْرِيُّ عَنْ الْحَسَنِ وَعَبْدِ اللَّهِ ابْنَيْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ أَبِيهِمَا أَنَّ عَلِيًّا رَضِيَ اللَّهُ عَنْهُقِيلَ لَهُ إِنَّ ابْنَ عَبَّاسٍ لَا يَرَى بِمُتْعَةِ النِّسَاءِ بَأْسًا فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهَا يَوْمَ خَيْبَرَ وَعَنْ لُحُومِ الْحُمُرِ الْإِنْسِيَّةِوَقَالَ بَعْضُ النَّاسِ إِنْ احْتَالَ حَتَّى تَمَتَّعَ فَالنِّكَاحُ فَاسِدٌ وَقَالَ بَعْضُهُمْ النِّكَاحُ جَائِزٌ وَالشَّرْطُ بَاطِلٌ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [ubaidhullah bin Umar] telah menceritakan kepada kami [Az Zuhri] dari [Al Hasan] dan [Abdullah], kedua anak Muhammad bin Ali, dari [ayah keduanya], bahwa di sampaikan kepada [Ali] radliallahu 'anhu; bahwa Ibnu Abbas menganggap nikah mut'ah tidak masalah, maka Ali berkata; 'Rasulullah telah melarangnya pada hari khaibar, dan beliau melarang daging keledai jinak.' Sebagian orang mengatakan; bahwa jika seseorang menyiasati sehingga nikah mut'ah, maka nikahnya rusak, sedang sebagian yang lain mengatakan nikahnya boleh dan syaratnya bathil."
            },
            {
                "number": 6113,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا مَالِكٌ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُمْنَعُ فَضْلُ الْمَاءِ لِيُمْنَعَ بِهِ فَضْلُ الْكَلَإِ",
                "id": "Telah menceritakan kepada kami [Isma'il] telah menceritakan kepada kami [Malik] dari [Abu Az Zanad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh kelebihan air ditahan untuk menahan tumbuhnya rerumputan.\""
            },
            {
                "number": 6114,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ النَّجْشِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Nafi'] dari [Ibnu Umar], Rasulullah Shallallahu'alaihiwasallam melarang (jual beli) najasy (penipuan)."
            },
            {
                "number": 6115,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ رَجُلًا ذَكَرَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ يُخْدَعُ فِي الْبُيُوعِ فَقَالَ إِذَا بَايَعْتَ فَقُلْ لَا خِلَابَةَ",
                "id": "Telah menceritakan kepada kami [Isma'il] telah menceritakan kepada kami [Malik] dari [Abdullah bin Dinar] dari [Abdullah bin Umar] radliallahu 'anhuma; ada seorang laki-laki mengeluhkesahkan dirinya kepada Nabi shallallahu 'alaihi wasallam, karena dirinya sering ditipu dalam jual beli, maka beliau bersabda: \"Jika kamu jual-beli, katakan; 'Namun dengan syarat tak ada penipuan'.\""
            },
            {
                "number": 6116,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ حَدَّثَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ كَانَ عُرْوَةُ يُحَدِّثُ أَنَّهُ سَأَلَ عَائِشَةَ{ وَإِنْ خِفْتُمْ أَنْ لَا تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنْ النِّسَاءِ }قَالَتْ هِيَ الْيَتِيمَةُ فِي حَجْرِ وَلِيِّهَا فَيَرْغَبُ فِي مَالِهَا وَجَمَالِهَا فَيُرِيدُ أَنْ يَتَزَوَّجَهَا بِأَدْنَى مِنْ سُنَّةِ نِسَائِهَا فَنُهُوا عَنْ نِكَاحِهِنَّ إِلَّا أَنْ يُقْسِطُوا لَهُنَّ فِي إِكْمَالِ الصَّدَاقِ ثُمَّ اسْتَفْتَى النَّاسُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدُ فَأَنْزَلَ اللَّهُ{ وَيَسْتَفْتُونَكَ فِي النِّسَاءِ }فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Abul Yaman] telah menceritakan kepada kami [Syu'aib] dari [Az Zuhri] mengatakan, [Urwah] menceritakan; ia bertanya [Aisyah] tentang ayat; 'Jika kalian khawatir tidak bisa berbuat adil terhadap yatimmu, maka nikahilah wanita yang baik-baik bagimu, dua, tiga, atau empat (QS. Annisa'; 3) dia mengatakan; 'yaitu yatim dalam asuhan walinya, dan si wali tersebut kurang menyukai kecantikan dan hartanya, namun tetap akan ia nikahi dengan syarat membayar mahar serendah-rendahnya yang menyalahi adat normal. Maka mereka dilarang menikahi anak-anak yatim tersebut kecuali jika berbuat adil dengan membayar mahar secara sempurna, lantas para sahabat bertanya kepada Rasulullah shallallahu 'alaihi wasallam di kemudian hari, maka Allah menurunkan ayat; 'Mereka meminta fatwa kepadamu,,, dan seterusnya (QS. Annisa' 127), kemudian dia menyebutkan hadits."
            },
            {
                "number": 6117,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَاعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِكُلِّ غَادِرٍ لِوَاءٌ يَوْمَ الْقِيَامَةِ يُعْرَفُ بِهِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Abdullah bin Dinar] dari [Abdullah bin Umar] radliallahu 'anhuma dari Nabi shallallahu 'alaihi wasallam bersabda: \"Setiap pengkhianat diberi bendera pada hari kiamat sebagai tanda pengenalnya.\""
            },
            {
                "number": 6118,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ سُفْيَانَ عَنْ هِشَامٍ عَنْ عُرْوَةَ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا أَنَا بَشَرٌ وَإِنَّكُمْ تَخْتَصِمُونَ إِلَيَّ وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ وَأَقْضِيَ لَهُ عَلَى نَحْوِ مَا أَسْمَعُ فَمَنْ قَضَيْتُ لَهُ مِنْ حَقِّ أَخِيهِ شَيْئًا فَلَا يَأْخُذْ فَإِنَّمَا أَقْطَعُ لَهُ قِطْعَةً مِنْ النَّارِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] dari [Sufyan] dari [Hisyam] dari [Urwah] dari [Zainab binti Ummi Salamah] dari [Ummu Salamah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Saya hanyalah manusia biasa, dan kalian mengadukan sengketa kepadaku, siapa tahu sebagian diantara kalian lebih pandai bersilat lidah dengan alasannya dari sebagian lain, sehingga aku memutuskan sebatas yang aku dengar, maka barangsiapa kuputuskan menang dengan mendzalimi hak saudaranya, janganlah ia mengambilnya, sebab aku akan mengambil sulutan api neraka baginya.\""
            },
            {
                "number": 6119,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُنْكَحُ الْبِكْرُ حَتَّى تُسْتَأْذَنَ وَلَا الثَّيِّبُ حَتَّى تُسْتَأْمَرَ فَقِيلَ يَا رَسُولَ اللَّهِ كَيْفَ إِذْنُهَا قَالَ إِذَا سَكَتَتْوَقَالَ بَعْضُ النَّاسِ إِنْ لَمْ تُسْتَأْذَنْ الْبِكْرُ وَلَمْ تَزَوَّجْ فَاحْتَالَ رَجُلٌ فَأَقَامَ شَاهِدَيْ زُورٍ أَنَّهُ تَزَوَّجَهَا بِرِضَاهَا فَأَثْبَتَ الْقَاضِي نِكَاحَهَا وَالزَّوْجُ يَعْلَمُ أَنَّ الشَّهَادَةَ بَاطِلَةٌ فَلَا بَأْسَ أَنْ يَطَأَهَا وَهُوَ تَزْوِيجٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] telah menceritakan kepada kami [Yahya bin Abi Katsir] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, bersabda: \"Gadis tidak boleh dinikahi hingga dimintai izin, dan janda tidak bleh dinikahi hingga dimintai persetujuannya.\" Ada yang bertanya; 'ya Rasulullah, bagaimana tanda izinnya? ' Nabi menjawab: \"tandanya diam.\" Sebagian orang berpendapat; Jika seorang gadis belum dimintai izin, kemudian seseorang mencari siasat, kemudian dua orang saksi dusta bersaksi bahwa laki-laki tersebut telah menikahinya dengan kerelaannya, dan hakim memutuskannya secara resmi, dan suami tahu bahwa persaksiannya adalah dusta, maka yang demikian tidak mengapa untuk menyetubuhinya, dan termasuk pernikahan yang sah."
            },
            {
                "number": 6120,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ الْقَاسِمِأَنَّ امْرَأَةً مِنْ وَلَدِ جَعْفَرٍ تَخَوَّفَتْ أَنْ يُزَوِّجَهَا وَلِيُّهَا وَهِيَ كَارِهَةٌ فَأَرْسَلَتْ إِلَى شَيْخَيْنِ مِنْ الْأَنْصَارِ عَبْدِ الرَّحْمَنِ وَمُجَمِّعٍ ابْنَيْ جَارِيَةَ قَالَا فَلَا تَخْشَيْنَ فَإِنَّ خَنْسَاءَ بِنْتَ خِذَامٍ أَنْكَحَهَا أَبُوهَا وَهِيَ كَارِهَةٌ فَرَدَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَلِكَقَالَ سُفْيَانُ وَأَمَّا عَبْدُ الرَّحْمَنِ فَسَمِعْتُهُ يَقُولُ عَنْ أَبِيهِ إِنَّ خَنْسَاءَ",
                "id": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Al Qasim]; bahwa seorang wanita dari anak Ja'far merasa ketakutan (waswas) walinya menikahkannya sedang dia tidak suka, maka ia segera mengutus seseorang menemui dua syaikh dari kalangan anshar, [Abdurrahman] dan [Mujamma'], dua anak Jariyah. Maka keduanya berkata; janganlah khawatir, sebab Khansa` binti Khidzam pernah dinikahkan ayahnya sedang dia tidak suka, maka Nabi shallallahu 'alaihi wasallam menolak pernikahannya. [Sufyan] mengatakan; sedang [Abdurrahman] aku mendengarnya berkata; dari [ayahnya] dengan redaksi; Sesungguhnya Khansa'."
            },
            {
                "number": 6121,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَيْبَانُ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُنْكَحُ الْأَيِّمُ حَتَّى تُسْتَأْمَرَ وَلَا تُنْكَحُ الْبِكْرُ حَتَّى تُسْتَأْذَنَ قَالُوا كَيْفَ إِذْنُهَا قَالَ أَنْ تَسْكُتَوَقَالَ بَعْضُ النَّاسِ إِنْ احْتَالَ إِنْسَانٌ بِشَاهِدَيْ زُورٍ عَلَى تَزْوِيجِ امْرَأَةٍ ثَيِّبٍ بِأَمْرِهَا فَأَثْبَتَ الْقَاضِي نِكَاحَهَا إِيَّاهُ وَالزَّوْجُ يَعْلَمُ أَنَّهُ لَمْ يَتَزَوَّجْهَا قَطُّ فَإِنَّهُ يَسَعُهُ هَذَا النِّكَاحُ وَلَا بَأْسَ بِالْمُقَامِ لَهُ مَعَهَا",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syaiban] dari [Yahya] dari [Abu Salamah] dari [Abu Hurairah] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janda tidak boleh dinikahi hingga diajak musyawarah, dan gadis tidak boleh dinikahi hingga dimintai izin.\" Para sahabat bertanya; 'bagaimana tanda izinnya? ' Nabi menjawab; \"jika dia diam.\" Sebagian orang mengatakan; bahwa jika seseorang bersiasat dengan menghadirkan dua orang saksi palsu atas perkawinan seorang janda dengan mengatakan atas persetujuannya, kemudian hakim menetapkan pernikahannya, padahal suami tahu bahwa sebenarnya ia belum menikahinya sama sekali, maka pernikahannya tidak masalah, dan tidak apa tinggal bersama dengannya.'"
            },
            {
                "number": 6122,
                "arab": "حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ ذَكْوَانَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبِكْرُ تُسْتَأْذَنُ قُلْتُ إِنَّ الْبِكْرَ تَسْتَحْيِي قَالَ إِذْنُهَا صُمَاتُهَاوَقَالَ بَعْضُ النَّاسِ إِنْ هَوِيَ رَجُلٌ جَارِيَةً يَتِيمَةً أَوْ بِكْرًا فَأَبَتْ فَاحْتَالَ فَجَاءَ بِشَاهِدَيْ زُورٍ عَلَى أَنَّهُ تَزَوَّجَهَا فَأَدْرَكَتْ فَرَضِيَتْ الْيَتِيمَةُ فَقَبِلَ الْقَاضِي شَهَادَةَ الزُّورِ وَالزَّوْجُ يَعْلَمُ بِبُطْلَانِ ذَلِكَ حَلَّ لَهُ الْوَطْءُ",
                "id": "Telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Ibnu Abi Mulaikah] dari [Dzakwan] dari [Aisyah] radliallahu 'anha mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Gadis dimintai izinnya.\" Saya bertanya; 'Sesungguhnya gadis sering merasa malu untuk menyatakan persetujuannya.' Nabi menjawab; \"tanda izinnya adalah diam.\" Sebagian orang berpendapat bahwa; jika seorang laki-laki tertarik menikahi hamba sahaya yatim atau gadis, lantas anak yatim atau hamba sahaya tadi menolak, lalu si laki-laki mencari siasat dengan menghadirkan dua orang saksi bohong, dengan menyatakan bahwa si laki-laki tadi telah menikahinya dan si perempuan rela, kemudian hakim menerima kesaksian palsu tersebut dan suami mengetahui kebatilan kesaksiannya, maka boleh baginya menyetubuhinya."
            },
            {
                "number": 6123,
                "arab": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحِبُّ الْحَلْوَاءَ وَيُحِبُّ الْعَسَلَ وَكَانَ إِذَا صَلَّى الْعَصْرَ أَجَازَ عَلَى نِسَائِهِ فَيَدْنُو مِنْهُنَّ فَدَخَلَ عَلَى حَفْصَةَ فَاحْتَبَسَ عِنْدَهَا أَكْثَرَ مِمَّا كَانَ يَحْتَبِسُ فَسَأَلْتُ عَنْ ذَلِكَ فَقَالَ لِي أَهْدَتْ لَهَا امْرَأَةٌ مِنْ قَوْمِهَا عُكَّةَ عَسَلٍ فَسَقَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُ شَرْبَةً فَقُلْتُ أَمَا وَاللَّهِ لَنَحْتَالَنَّ لَهُ فَذَكَرْتُ ذَلِكَ لِسَوْدَةَ قُلْتُ إِذَا دَخَلَ عَلَيْكِ فَإِنَّهُ سَيَدْنُو مِنْكِ فَقُولِي لَهُ يَا رَسُولَ اللَّهِ أَكَلْتَ مَغَافِيرَ فَإِنَّهُ سَيَقُولُ لَا فَقُولِي لَهُ مَا هَذِهِ الرِّيحُ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَشْتَدُّ عَلَيْهِ أَنْ يُوجَدَ مِنْهُ الرِّيحُ فَإِنَّهُ سَيَقُولُ سَقَتْنِي حَفْصَةُ شَرْبَةَ عَسَلٍ فَقُولِي لَهُ جَرَسَتْ نَحْلُهُ الْعُرْفُطَ وَسَأَقُولُ ذَلِكِ وَقُولِيهِ أَنْتِ يَا صَفِيَّةُ فَلَمَّا دَخَلَ عَلَى سَوْدَةَ قُلْتُ تَقُولُ سَوْدَةُ وَالَّذِي لَا إِلَهَ إِلَّا هُوَ لَقَدْ كِدْتُ أَنْ أُبَادِرَهُ بِالَّذِي قُلْتِ لِي وَإِنَّهُ لَعَلَى الْبَابِ فَرَقًا مِنْكِ فَلَمَّا دَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ يَا رَسُولَ اللَّهِ أَكَلْتَ مَغَافِيرَ قَالَ لَا قُلْتُ فَمَا هَذِهِ الرِّيحُ قَالَ سَقَتْنِي حَفْصَةُ شَرْبَةَ عَسَلٍ قُلْتُ جَرَسَتْ نَحْلُهُ الْعُرْفُطَ فَلَمَّا دَخَلَ عَلَيَّ قُلْتُ لَهُ مِثْلَ ذَلِكَ وَدَخَلَ عَلَى صَفِيَّةَ فَقَالَتْ لَهُ مِثْلَ ذَلِكَ فَلَمَّا دَخَلَ عَلَى حَفْصَةَ قَالَتْ لَهُ يَا رَسُولَ اللَّهِ أَلَا أَسْقِيكَ مِنْهُ قَالَ لَا حَاجَةَ لِي بِهِ قَالَتْ تَقُولُ سَوْدَةُ سُبْحَانَ اللَّهِ لَقَدْ حَرَمْنَاهُ قَالَتْ قُلْتُ لَهَا اسْكُتِي",
                "id": "Telah menceritakan kepada kami [Ubaid bin Isma'il] telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [ayahnya] dari [Aisyah], mengatakan; Rasulullah Shallallahu'alaihiwasallam sangat menyukai makanan yang manis-manis dan madu. Adalah kebiasaan beliau, jika beliau telah menunaikan sholat 'ashar, maka beliau melewati isteri-isterinya dan mendekati mereka. Maka Suatu kali beliau menemui Hafshah dan berada di sisinya lebih lama daripada kebiasaan beliau pada hari-hari normal. Maka segera aku tanyai beliau mengapa di rumah Hafshah sekian lama tidak seperti hari-hari biasanya. Beliau menjawab: \"Ada seorang wanita kaumnya menghadiahinya sekaleng madu, lantas ia memberinya minum kepada Rasulullah Shallallahu'alaihiwasallam.\" Maka aku mengatakan; 'Demi Allah, kami pasti akan mengerjai beliau.' Maka aku berkata kepada Saudah; 'jika Rasulullah menemuimu, dan ia mendekatimu, katakanlah kepadanya; 'ya Rasulullah, engkau makan buah mighfar? ' tentu beliau akan mengatakan; 'tidak', maka katakan kepadanya; 'lantas bau apa ini? ' Yang demikian karena Rasulullah shallallahu 'alaihi wasallam merasa risih jika didapati bau yang kurang menyedapkan dari tubuhnya. Maka beliau akan mengatakan; 'Hafshah telah memberiku minuman madu.' Maka katakanlah kepadanya; 'Rasa madu itu telah berubah karena ada sesuatu yang dimakan lebah! ' Dan aku akan mengatakan yang sedemikian, dan katakan begitu ya Shafiyah! ' Maka dikala Nabi shallallahu 'alaihi wasallam menemui Saudah, Saudah mengatakan; 'Demi Dzat yang tiada Tuhan selain Dia, nyaris aku terlebih dahulu bertanya kepada Nabi shallallahu 'alaihi wasallam dengan ucapan yang kau ucapkan padaku, dan Nabi sudah berada di pintu karena takut terhadapmu. Dikala Rasulullah shallallahu 'alaihi wasallam mendekat, saya mengatakan; 'ya Rasulullah, Benarkan, engkau telah makan buah mighfar? ' \"tidak\" Jawabnya. Maka aku katakan; 'lantas bau apa ini? ' Nabi menjawab; \"Hafshah telah memberi madu kepadaku.\" Saya mengatakan; 'rasa madu itu telah berubah karena ada tawon yang memakan sesuatu! ' Ketika beliau menemuiku, kukatakan yang demikian. Dan dikala beliau menemui Shafiyah, ia juga mengatakan yang sedemikian. Maka dikala beliau menemui Hafshah, Hafshah bertanya; 'ya Rasulullah, maukah aku beri minum madu? ' Nabi menjawab: \"Aku tidak butuh terhadapnya.\" Lantas Saudah mengatakan; 'Demi Allah, kita telah mengharamkan madu untuknya.' Aisyah berkata; kukatakan; 'diam kamu! '"
            },
            {
                "number": 6124,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَأَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ خَرَجَ إِلَى الشَّأْمِ فَلَمَّا جَاءَ بِسَرْغَ بَلَغَهُ أَنَّ الْوَبَاءَ وَقَعَ بِالشَّأْمِ فَأَخْبَرَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلَا تَقْدَمُوا عَلَيْهِ وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلَا تَخْرُجُوا فِرَارًا مِنْهُ فَرَجَعَ عُمَرُ مِنْ سَرْغَوَعَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَنَّ عُمَرَ إِنَّمَا انْصَرَفَ مِنْ حَدِيثِ عَبْدِ الرَّحْمَنِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Ibnu Syihab] dari [Abdullah bin Amir bin Rabi'ah], Umar bin Khattab radliallahu 'anhu berangkat ke Syam. Ketika dia sampai di suatu kota yang bernama Saragh, dia mendengar berita bahwa wabah sedang menimpa Syam. Maka [Abdurrahman bin Auf] mengabarinya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian mendengar wabah berada di suatu kawasan, janganlah kalian datang kesana, dan jika terjadi di suatu kawasan yang kalian diami, jangan kalian meninggalkannya.\" Spontan Umar meninggalkan kota Saragh. Dan dari [Ibnu Syihab] dari [Salim bin Abdullah], bahwasanya Umar pulang karena hadits Abdurrahman ini."
            },
            {
                "number": 6125,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ حَدَّثَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ حَدَّثَنَا عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّهُ سَمِعَ أُسَامَةَ بْنَ زَيْدٍيُحَدِّثُ سَعْدًا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ الْوَجَعَ فَقَالَ رِجْزٌ أَوْ عَذَابٌ عُذِّبَ بِهِ بَعْضُ الْأُمَمِ ثُمَّ بَقِيَ مِنْهُ بَقِيَّةٌ فَيَذْهَبُ الْمَرَّةَ وَيَأْتِي الْأُخْرَى فَمَنْ سَمِعَ بِهِ بِأَرْضٍ فَلَا يُقْدِمَنَّ عَلَيْهِ وَمَنْ كَانَ بِأَرْضٍ وَقَعَ بِهَا فَلَا يَخْرُجْ فِرَارًا مِنْهُ",
                "id": "Telah menceritakan kepada kami [Abul yaman] telah menceritakan kepada kami [Syu'aib] dari [Az Zuhri] telah menceritakan kepada kami ['Amir bin Sa'd bin Abi Waqqash], ia mendengar [Usamah bin Zaid] menceritakan kepada Sa'd, bahwasanya Rasulullah shallallahu 'alaihi wasallam memperbincangkan suatu penyakit, beliau bersabda: \"Itu adalah sebagai hukuman dan siksaan yang pernah digunakan untuk menyiksa suatu kaum, kemudian masih ada yang tersisa dari penyakit tersbut, sehingga terkadang datang dan pergi, maka siapa mendengar suatu penyakit melanda sebuah negeri, jangan sesekali ia mendatanginya, dan barangsiapa di suatu negeri yang tengah dilanda penyakit, jangan ia mengungsi dengan niat menghindari penyakit itu.\""
            },
            {
                "number": 6126,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ السَّخْتِيَانِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَعُودُ فِي قَيْئِهِ لَيْسَ لَنَا مَثَلُ السَّوْءِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Ayyub As Sakhtiyani] dari [Ikrimah] dari [Ibnu Abbas] radliallahu 'anhuma mengatakan, Nabi shallallahu 'alaihi wasallam bersabda: \"Orang yang menarik kembali pemberian, bagaikan anjing yang menyantap lagi muntahannya, yang kita tak mempunyai perumpamaan lebih buruk daripadanya.\""
            },
            {
                "number": 6127,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَإِنَّمَا جَعَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الشُّفْعَةَ فِي كُلِّ مَا لَمْ يُقْسَمْ فَإِذَا وَقَعَتْ الْحُدُودُ وَصُرِّفَتْ الطُّرُقُ فَلَا شُفْعَةَوَقَالَ بَعْضُ النَّاسِ الشُّفْعَةُ لِلْجِوَارِ ثُمَّ عَمَدَ إِلَى مَا شَدَّدَهُ فَأَبْطَلَهُ وَقَالَ إِنْ اشْتَرَى دَارًا فَخَافَ أَنْ يَأْخُذَ الْجَارُ بِالشُّفْعَةِ فَاشْتَرَى سَهْمًا مِنْ مِائَةِ سَهْمٍ ثُمَّ اشْتَرَى الْبَاقِيَ وَكَانَ لِلْجَارِ الشُّفْعَةُ فِي السَّهْمِ الْأَوَّلِ وَلَا شُفْعَةَ لَهُ فِي بَاقِي الدَّارِ وَلَهُ أَنْ يَحْتَالَ فِي ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad] telah menceritakan kepada kami [Hisyam bin Yusuf] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah] dari [Jabir bin Abdullah] mengatakan, 'hanyasanya Nabi shallallahu 'alaihi wasallam menetapkan syuf'ah untuk suatu yang belum dibagi, namun jika batas-batas tanah dan jalan pekarangan telah ditetapkan, tak ada syuf'ah lagi.' Sebagian orang berpendapat; 'bahwa syuf'ah bagi tetangga', kemudian dia berpegang dengan perkara yang dia perkuat, sehingga ia membatalkannya. Dan dia berkata; Jika seseorang membeli rumah dan khawatir tetangganya menguasainya dengan syuf'ah, maka dia membeli satu saham dari seratus saham yang ada, kemudian ia sendiri membeli saham sisanya, maka si tetangga hanya memperoleh syuf'ah pada satu saham yang pertama, dan tidak berhak syuf'ah pada saham rumah sisanya, dan dia boleh mensiasati hal itu."
            },
            {
                "number": 6128,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سُفْيَانُ عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ سَمِعْتُ عَمْرَو بْنَ الشَّرِيدِ قَالَجَاءَ الْمِسْوَرُ بْنُ مَخْرَمَةَ فَوَضَعَ يَدَهُ عَلَى مَنْكِبِي فَانْطَلَقْتُ مَعَهُ إِلَى سَعْدٍ فَقَالَ أَبُو رَافِعٍ لِلْمِسْوَرِ أَلَا تَأْمُرُ هَذَا أَنْ يَشْتَرِيَ مِنِّي بَيْتِي الَّذِي فِي دَارِي فَقَالَ لَا أَزِيدُهُ عَلَى أَرْبَعِ مِائَةٍ إِمَّا مُقَطَّعَةٍ وَإِمَّا مُنَجَّمَةٍ قَالَ أُعْطِيتُ خَمْسَ مِائَةٍ نَقْدًا فَمَنَعْتُهُ وَلَوْلَا أَنِّي سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْجَارُ أَحَقُّ بِصَقَبِهِ مَا بِعْتُكَهُ أَوْ قَالَ مَا أَعْطَيْتُكَهُقُلْتُ لِسُفْيَانَ إِنَّ مَعْمَرًا لَمْ يَقُلْ هَكَذَا قَالَ لَكِنَّهُ قَالَ لِي هَكَذَا وَقَالَ بَعْضُ النَّاسِ إِذَا أَرَادَ أَنْ يَبِيعَ الشُّفْعَةَ فَلَهُ أَنْ يَحْتَالَ حَتَّى يُبْطِلَ الشُّفْعَةَ فَيَهَبَ الْبَائِعُ لِلْمُشْتَرِي الدَّارَ وَيَحُدُّهَا وَيَدْفَعُهَا إِلَيْهِ وَيُعَوِّضُهُ الْمُشْتَرِي أَلْفَ دِرْهَمٍ فَلَا يَكُونُ لِلشَّفِيعِ فِيهَا شُفْعَةٌ",
                "id": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin Maisarah] aku mendengar [Amru bin Syarid] mengatakan, Miswar bin makhramah datang dan meletakkan tangannya di pundakku. Kemudian aku berangkat bersamanya menuju ke Sa'd. Lantas [Abu Rafi'] mengatakan kepada Miswar; 'Tidakkah engkau suruh orang ini untuk membeli rumahku yang berada di pekaranganku? ' ia berkata; 'Saya tidak menambahnya melebihi empat ratus, baik secara kontan atau kredit.' Abu rafi' mengatakan; 'Aku telah diberi lima ratus secara kontan, namun aku menolaknya, kalaulah aku tidak mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tetangga lebih berhak terhadap dinding tetangganya, \" niscaya aku tidak akan menjualnya kepadamu, -atau ia mengatakan dengan redaksi; 'niscaya tak akan memberikannya kepadamu'.- Saya berkata kepada Ma'mar; Ma'mar tidak mengatakan demikian, namun dia mengatakan kepadaku sedemikian dan mengatakan; Jika seseorang ingin menjual syuf'ah, maka ia boleh melakukan siasat sehingga membatalkan syuf'ah, dan penjual memberikan rumah kepada si pembeli, memberi batasan (waktu dan nilai) dan menyerahkannya kepada si pembeli, dan si pembeli menggantinya dengan seribu dirham, sehingga orang yang mempunyai syuf'ah tidak mempunyai syuf'ah lagi."
            },
            {
                "number": 6129,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِي رَافِعٍأَنَّ سَعْدًا سَاوَمَهُ بَيْتًا بِأَرْبَعِ مِائَةِ مِثْقَالٍ فَقَالَ لَوْلَا أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْجَارُ أَحَقُّ بِصَقَبِهِ لَمَا أَعْطَيْتُكَوَقَالَ بَعْضُ النَّاسِ إِنْ اشْتَرَى نَصِيبَ دَارٍ فَأَرَادَ أَنْ يُبْطِلَ الشُّفْعَةَ وَهَبَ لِابْنِهِ الصَّغِيرِ وَلَا يَكُونُ عَلَيْهِ يَمِينٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin Maisarah] dari [Amru bin Syarid] dari [Abu Rafi'], bahwasanya Sa'd pernah mengajukan penawaran rumah kepadanya seharga empat ratus mitsqal. Lantas Abu rafi' menjawab; 'Kalaulah aku tidak mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tetangga lebih berhak terhadap dindingnya, \" niscaya aku tidak menjualnya kepadamu. Dan sebagian orang berpendapat; Jika seseorang membeli bagian rumah, lantas ia ingin membatalkan syuf'ah, dan ia berikan kepada anak kecilnya, maka ia tak wajib bersumpah."
            },
            {
                "number": 6130,
                "arab": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ قَالَاسْتَعْمَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا عَلَى صَدَقَاتِ بَنِي سُلَيْمٍ يُدْعَى ابْنَ الْلَّتَبِيَّةِ فَلَمَّا جَاءَ حَاسَبَهُ قَالَ هَذَا مَالُكُمْ وَهَذَا هَدِيَّةٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَلَّا جَلَسْتَ فِي بَيْتِ أَبِيكَ وَأُمِّكَ حَتَّى تَأْتِيَكَ هَدِيَّتُكَ إِنْ كُنْتَ صَادِقًا ثُمَّ خَطَبَنَا فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنِّي أَسْتَعْمِلُ الرَّجُلَ مِنْكُمْ عَلَى الْعَمَلِ مِمَّا وَلَّانِي اللَّهُ فَيَأْتِي فَيَقُولُ هَذَا مَالُكُمْ وَهَذَا هَدِيَّةٌ أُهْدِيَتْ لِي أَفَلَا جَلَسَ فِي بَيْتِ أَبِيهِ وَأُمِّهِ حَتَّى تَأْتِيَهُ هَدِيَّتُهُ وَاللَّهِ لَا يَأْخُذُ أَحَدٌ مِنْكُمْ شَيْئًا بِغَيْرِ حَقِّهِ إِلَّا لَقِيَ اللَّهَ يَحْمِلُهُ يَوْمَ الْقِيَامَةِ فَلَأَعْرِفَنَّ أَحَدًا مِنْكُمْ لَقِيَ اللَّهَ يَحْمِلُ بَعِيرًا لَهُ رُغَاءٌ أَوْ بَقَرَةً لَهَا خُوَارٌ أَوْ شَاةً تَيْعَرُ ثُمَّ رَفَعَ يَدَهُ حَتَّى رُئِيَ بَيَاضُ إِبْطِهِ يَقُولُ اللَّهُمَّ هَلْ بَلَّغْتُ بَصْرَ عَيْنِي وَسَمْعَ أُذُنِي",
                "id": "Telah menceritakan kepada kami [Ubaid bin Isma'il], telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [ayahnya], dari [Abu Humaid As Sa'idi] mengatakan, Rasulullah Shallallahu'alaihiwasallam pernah mempekerjakan seorang laki-laki untuk mengelola zakat bani Sulaim yang sering dipanggil dengan nama Ibnu Al Latabiyah, tatkala dia datang, dia menghitungnya dan berkata; 'Ini adalah hartamu dan ini hadiah.' Spontan Rasulullah Shallallahu'alaihiwasallam berujar: \"kenapa kamu tidak duduk-duduk saja di rumah ayahmu atau ibumu sampai hadiahmu datang kepadamu jika kamu jujur.\" Kemudian beliau berpidato di hadapan kami, memuja dan memuji Allah terus bersabda: \"Amma ba'd. Sesungguhnya saya mempekerjakan salah seorang diantara kalian untuk mengumpulkan zakat yang telah Allah kuasakan kepadaku, lantas ia datang dan mengatakan; 'ini hartamu dan ini hadiah yang diberikan kepadaku, ' kenapa dia tidak duduk-duduk saja di rumah ayahnya atau ibunya sampai hadiahnya datang kepadanya? Demi Allah, tidaklah salah seorang diantara kalian mengambil sesuatu yang bukan haknya, selain ia menjumpai Allah pada hari kiamat dengan memikul hak itu, aku tahu salah seorang diantara kalian menjumpai Allah dengan memikul unta yang mendengus, atau sapi yang melenguh, atau kambing yang mengembik.\" Kemudian beliau mengangkat tangannya hingga terlihat putih ketiaknya seraya mengatakan: \"Ya Allah, bukankah aku telah menyampaikan apa yang kulihat dengan mataku dan kudengar dengan dua telingaku?\""
            },
            {
                "number": 6131,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِي رَافِعٍ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَارُ أَحَقُّ بِصَقَبِهِوَقَالَ بَعْضُ النَّاسِ إِنْ اشْتَرَى دَارًا بِعِشْرِينَ أَلْفَ دِرْهَمٍ فَلَا بَأْسَ أَنْ يَحْتَالَ حَتَّى يَشْتَرِيَ الدَّارَ بِعِشْرِينَ أَلْفَ دِرْهَمٍ وَيَنْقُدَهُ تِسْعَةَ آلَافِ دِرْهَمٍ وَتِسْعَ مِائَةِ دِرْهَمٍ وَتِسْعَةً وَتِسْعِينَ وَيَنْقُدَهُ دِينَارًا بِمَا بَقِيَ مِنْ الْعِشْرِينَ الْأَلْفَ فَإِنْ طَلَبَ الشَّفِيعُ أَخَذَهَا بِعِشْرِينَ أَلْفَ دِرْهَمٍ وَإِلَّا فَلَا سَبِيلَ لَهُ عَلَى الدَّارِ فَإِنْ اسْتُحِقَّتْ الدَّارُ رَجَعَ الْمُشْتَرِي عَلَى الْبَائِعِ بِمَا دَفَعَ إِلَيْهِ وَهُوَ تِسْعَةُ آلَافِ دِرْهَمٍ وَتِسْعُ مِائَةٍ وَتِسْعَةٌ وَتِسْعُونَ دِرْهَمًا وَدِينَارٌ لِأَنَّ الْبَيْعَ حِينَ اسْتُحِقَّ انْتَقَضَ الصَّرْفُ فِي الدِّينَارِ فَإِنْ وَجَدَ بِهَذِهِ الدَّارِ عَيْبًا وَلَمْ تُسْتَحَقَّ فَإِنَّهُ يَرُدُّهَا عَلَيْهِ بِعِشْرِينَ أَلْفَ دِرْهَمٍ قَالَ فَأَجَازَ هَذَا الْخِدَاعَ بَيْنَ الْمُسْلِمِينَ وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَبَيْعُ الْمُسْلِمِ لَا دَاءَ وَلَا خِبْثَةَ وَلَا غَائِلَةَ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin Maisarah] dari [Amru bin Syarid] dari [Abu Rafi'] mengatakan, Nabi shallallahu 'alaihi wasallam bersabda: \"tetangga lebih berhak terhadap dinding rumahnya.\" Sebagian orang berpendapat; jika seseorang membeli rumah seharga dua puluh ribu dirham, tidak mengapa baginya untuk mencari siasat dengan cara membeli rumah dengan harga dua puluh ribu dirham, dan membayarkannya sembilan ribu sembilan ratus sembilan puluh sembilan dirham, dan ia membayarnya dengan satu dinar sebagai pembayaran sisa dua puluh ribu dirham. Lantas jika ada orang yang membelinya lagi (penjual pertama), maka ia (pembeli pertama) mengharuskan pembayaran dua puluh ribu dirham penuh, jika tidak, ia tidak berhak menempati rumah tersebut. Jika rumah diminta secara paksa, maka si pembeli pertama mengembalikan uang yang pernah dibayarkan yaitu sebanyak sembilan ribu sembilan ratus sembilan puluh sembilan dirham dirham dan satu dinar."
            },
            {
                "number": 6132,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ عَنْ عَمْرِو بْنِ الشَّرِيدِ أَنَّ أَبَا رَافِعٍسَاوَمَ سَعْدَ بْنَ مَالِكٍ بَيْتًا بِأَرْبَعِ مِائَةِ مِثْقَالٍ وَقَالَ لَوْلَا أَنِّي سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْجَارُ أَحَقُّ بِصَقَبِهِ مَا أَعْطَيْتُكَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Sufyan] mengatakan, Telah menceritakan kepadaku [Ibrahim bin Maisarah] dari [Amru bin Syarid], bahwasanya [Abu Rafi'] pernah mengajukan penawaran rumah keada Sa'd bin Malik seharga empat ratus mitsqal, dan ia mengatakan; 'Kalaulah aku tidak emndengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tetangga lebih berhak teradap dindingnya\" niscaya tidak aku berikan kepadamu."
            },
            {
                "number": 6133,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ ح و حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ قَالَ الزُّهْرِيُّ فَأَخْبَرَنِي عُرْوَةُ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّهَا قَالَتْأَوَّلُ مَا بُدِئَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْوَحْيِ الرُّؤْيَا الصَّادِقَةُ فِي النَّوْمِ فَكَانَ لَا يَرَى رُؤْيَا إِلَّا جَاءَتْ مِثْلَ فَلَقِ الصُّبْحِ فَكَانَ يَأْتِي حِرَاءً فَيَتَحَنَّثُ فِيهِ وَهُوَ التَّعَبُّدُ اللَّيَالِيَ ذَوَاتِ الْعَدَدِ وَيَتَزَوَّدُ لِذَلِكَ ثُمَّ يَرْجِعُ إِلَى خَدِيجَةَ فَتُزَوِّدُهُ لِمِثْلِهَا حَتَّى فَجِئَهُ الْحَقُّ وَهُوَ فِي غَارِ حِرَاءٍ فَجَاءَهُ الْمَلَكُ فِيهِ فَقَالَ اقْرَأْ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ مَا أَنَا بِقَارِئٍ فَأَخَذَنِي فَغَطَّنِي حَتَّى بَلَغَ مِنِّي الْجَهْدُ ثُمَّ أَرْسَلَنِي فَقَالَ اقْرَأْ فَقُلْتُ مَا أَنَا بِقَارِئٍ فَأَخَذَنِي فَغَطَّنِي الثَّانِيَةَ حَتَّى بَلَغَ مِنِّي الْجَهْدُ ثُمَّ أَرْسَلَنِي فَقَالَ اقْرَأْ فَقُلْتُ مَا أَنَا بِقَارِئٍ فَأَخَذَنِي فَغَطَّنِي الثَّالِثَةَ حَتَّى بَلَغَ مِنِّي الْجَهْدُ ثُمَّ أَرْسَلَنِي فَقَالَ{ اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ }حَتَّى بَلَغَ{ عَلَّمَ الْإِنْسَانَ مَا لَمْ يَعْلَمْ }فَرَجَعَ بِهَا تَرْجُفُ بَوَادِرُهُ حَتَّى دَخَلَ عَلَى خَدِيجَةَ فَقَالَ زَمِّلُونِي زَمِّلُونِي فَزَمَّلُوهُ حَتَّى ذَهَبَ عَنْهُ الرَّوْعُ فَقَالَ يَا خَدِيجَةُ مَا لِي وَأَخْبَرَهَا الْخَبَرَ وَقَالَ قَدْ خَشِيتُ عَلَى نَفْسِي فَقَالَتْ لَهُ كَلَّا أَبْشِرْ فَوَاللَّهِ لَا يُخْزِيكَ اللَّهُ أَبَدًا إِنَّكَ لَتَصِلُ الرَّحِمَ وَتَصْدُقُ الْحَدِيثَ وَتَحْمِلُ الْكَلَّ وَتَقْرِي الضَّيْفَ وَتُعِينُ عَلَى نَوَائِبِ الْحَقِّ ثُمَّ انْطَلَقَتْ بِهِ خَدِيجَةُ حَتَّى أَتَتْ بِهِ وَرَقَةَ بْنَ نَوْفَلِ بْنِ أَسَدِ بْنِ عَبْدِ الْعُزَّى بْنِ قُصَيٍّ وَهُوَ ابْنُ عَمِّ خَدِيجَةَ أَخُو أَبِيهَا وَكَانَ امْرَأً تَنَصَّرَ فِي الْجَاهِلِيَّةِ وَكَانَ يَكْتُبُ الْكِتَابَ الْعَرَبِيَّ فَيَكْتُبُ بِالْعَرَبِيَّةِ مِنْ الْإِنْجِيلِ مَا شَاءَ اللَّهُ أَنْ يَكْتُبَ وَكَانَ شَيْخًا كَبِيرًا قَدْ عَمِيَ فَقَالَتْ لَهُ خَدِيجَةُ أَيْ ابْنَ عَمِّ اسْمَعْ مِنْ ابْنِ أَخِيكَ فَقَالَ وَرَقَةُ ابْنَ أَخِي مَاذَا تَرَى فَأَخْبَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا رَأَى فَقَالَ وَرَقَةُ هَذَا النَّامُوسُ الَّذِي أُنْزِلَ عَلَى مُوسَى يَا لَيْتَنِي فِيهَا جَذَعًا أَكُونُ حَيًّا حِينَ يُخْرِجُكَ قَوْمُكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَمُخْرِجِيَّ هُمْ فَقَالَ وَرَقَةُ نَعَمْ لَمْ يَأْتِ رَجُلٌ قَطُّ بِمِثْلِ مَا جِئْتَ بِهِ إِلَّا عُودِيَ وَإِنْ يُدْرِكْنِي يَوْمُكَ أَنْصُرْكَ نَصْرًا مُؤَزَّرًا ثُمَّ لَمْ يَنْشَبْ وَرَقَةُ أَنْ تُوُفِّيَ وَفَتَرَ الْوَحْيُ فَتْرَةً حَتَّى حَزِنَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيمَا بَلَغَنَا حُزْنًا غَدَا مِنْهُ مِرَارًا كَيْ يَتَرَدَّى مِنْ رُءُوسِ شَوَاهِقِ الْجِبَالِ فَكُلَّمَا أَوْفَى بِذِرْوَةِ جَبَلٍ لِكَيْ يُلْقِيَ مِنْهُ نَفْسَهُ تَبَدَّى لَهُ جِبْرِيلُ فَقَالَ يَا مُحَمَّدُ إِنَّكَ رَسُولُ اللَّهِ حَقًّا فَيَسْكُنُ لِذَلِكَ جَأْشُهُ وَتَقِرُّ نَفْسُهُ فَيَرْجِعُ فَإِذَا طَالَتْ عَلَيْهِ فَتْرَةُ الْوَحْيِ غَدَا لِمِثْلِ ذَلِكَ فَإِذَا أَوْفَى بِذِرْوَةِ جَبَلٍ تَبَدَّى لَهُ جِبْرِيلُ فَقَالَ لَهُ مِثْلَ ذَلِكَقَالَ ابْنُ عَبَّاسٍ{ فَالِقُ الْإِصْبَاحِ }ضَوْءُ الشَّمْسِ بِالنَّهَارِ وَضَوْءُ الْقَمَرِ بِاللَّيْلِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari [Uqail] dari Ibnu Syihab -lewat jalur periwayatan lain-Dan Telah menceritakan kepadaku ['Abdullah bin Muhammad] telah menceritakan kepada kami ['Abdurrazaq] telah menceritakan kepada kami [Ma'mar], [Az Zuhri] mengatakan, telah menceritakan kepadaku [Urwah] dari [Aisyah] radliallahu 'anha, ia menceritakan; wahyu pertama-tama yang diturunkan kepada Rasulullah Shallallahu'alaihiwasallam adalah berupa mimpi yang baik ketika tidur, beliau tidak bermimpi selain datang seperti fajar subuh, dan beliau selalu pergi ke goa Hira bertahannus di sana, yaitu beribadah beberapa malam, dan beliau untuk hal tersebut berbekal, kemudian kembali kepada Khadijah agar dia dapat membekali beliau untuk keperluan seperti itu, sampai akhirnya beliau di kejutkan dengan al haq ketika beliau sedang berada di dalam goa Hira`, malaikat datang kepada beliau dan berujar; 'bacalah! ' Nabi shallallahu 'alaihi wasallam berkata kepadanya; \"maka aku menjawab; 'Saya tidak bisa membaca! ' Lalu dia mendekapku dan menutupiku hingga aku kepayahan. kemudian melepasku dan berkata; 'Bacalah! ' aku menjawab; 'Saya tidak bisa membaca! ' Ia mendekapku lagi dan menutupiku untuk kedua kalinya hingga aku kepayahan, kemudian melepasku lagi seraya mengatakan; 'Bacalah! ' saya menjawab; 'Saya tidak bisa membaca.' Maka ia mendekapku dan menutupiku untuk kali ketiganya hingga aku kepayahan, kemudian melepasku lagi dan mengatakan; 'IQRO' BISMI ROBBIKAL LADZII KHOLAQO sampai ayat 'ALLAMAL INSAANA MAA LAM YA'LAM, '\" kemudian beliau pulang dengan menggigil hingga menemui Khadijah dan berkata; \"Selimutilah aku, selimutilah aku!\" maka keluarganya pun menyelimuti beliau, sampai rasa ketakutan beliau menghilang, kemudian beliau berkata: \"ya Khadijah, apa yang terjadi pada diriku?\" beliau menceritakan peristiwa tersebut kepadanya dan berkata; \"Aku mengkhawatirkan diriku\" Maka Khadijah menjawab: 'Sekali-kali tidak, bergembiralah, demi Allah, Allah tidak akan menghinakanmu selama-lamanya, sebab engkau suka menyambung silaturrahim, berkata jujur, menghilangkan kesusahan serta menjamu tamu, serta membela kebenaran! ' Maka Khadijah pergi bersama beliau menemui Waraqah bin naufal bin Asad bin Abdul Uzza bin Qushshay, anak paman Khadijah, atau saudara ayahnya, ia adalah semasa jahiliyah beragama nashrani dan suka menulis kitab suci arabi, ia menulis injil arabi dengan kehendak Allah, dan dia seorang kakek yang cukup umur dan buta. Maka Khadijah berkata kepadanya; 'Wahai anak paman, dengarlah (apa yang dituturkan) anak saudaramu! ' Waraqah bertanya; 'Hai anak saudaraku, apa yang telah kau lihat? ' Maka Nabi shallallahu 'alaihi wasallam mengabarkan apa yang telah beliau lihat, spontan Waraqah mengatakan; 'Ini adalah Namus yang pernah diturunkan kepada Musa, duhai sekiranya ketika itu aku masih gagah perkasa dan masih hidup, ketika kaummu mengusirmu! ' \"Adakah kaumku akan mengusirku?\" Tanya Nabi shallallahu 'alaihi wasallam. Waraqah menjawab; 'Iya, tidak ada seorang pun yang membawa seperti yang kau bawa, melainkan ia akan dimusuhi. Jikalau aku temui hari-harimu, niscaya aku membelamu dengan gigih.' kemudian tak berselang lama Waraqah meninggal dan wahyu berhenti beberapa lama hingga Nabi shallallahu 'alaihi wasallam sedih. Berita yang sampai kepada kami, kesedihan yang beliau alami sedemikian rupa, hingga beliau beberapa kali ingin bunuh diri dengan cara menerjukan diri dari puncak gunung, setiap kali beliau naik puncak gunung untuk menerjunkan dirinya, Jibril menampakkan diri dan mengatakan; 'hai Muhammad, sesungguhnya engkau betul-betul Rasulullah! ' nasehat ini menjadikan hatinya lega dan jiwannya tenang dan pulang. Namun jika sekian lama wahyu tidak turun, jiwanya kembali terguncang, dan setiap kali ia naik puncak gunung untuk bunuh diri, Jibril menampakkan diri dan menasehati semisalnya. Ibnu Abbas mengatakan tentang ayat; 'Faaliqul ishbah' yaitu cahaya matahari ketika siang, dan cahaya bulan ketika malam."
            },
            {
                "number": 6134,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الرُّؤْيَا الْحَسَنَةُ مِنْ الرَّجُلِ الصَّالِحِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنْ النُّبُوَّةِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Ishaq bin Abdullah bin Abi Thalhah] dari [Anas bin Malik], Rasulullah Shallallahu'alaihiwasallam bersabda: \"Mimpi baik yang berasal dari seorang yang shalih adalah satu bagian dari enam atau empat puluh bagian kenabian.\""
            },
            {
                "number": 6135,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا يَحْيَى هُوَ ابْنُ سَعِيدٍ قَالَ سَمِعْتُ أَبَا سَلَمَةَ قَالَ سَمِعْتُ أَبَا قَتَادَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الرُّؤْيَا الصَّادِقَةُ مِنْ اللَّهِ وَالْحُلْمُ مِنْ الشَّيْطَانِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Yahya Ibnu Sa'id] mengatakan, aku pernah mendengar [Abu Salamah] mengatakan; Aku mendengar [Abu Qatadah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Mimpi yang benar adalah dari Allah dan mimpi jelek berasal dari setan.\""
            },
            {
                "number": 6136,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ حَدَّثَنَا اللَّيْثُ حَدَّثَنِي ابْنُ الْهَادِ عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا رَأَى أَحَدُكُمْ رُؤْيَا يُحِبُّهَا فَإِنَّمَا هِيَ مِنْ اللَّهِ فَلْيَحْمَدْ اللَّهَ عَلَيْهَا وَلْيُحَدِّثْ بِهَا وَإِذَا رَأَى غَيْرَ ذَلِكَ مِمَّا يَكْرَهُ فَإِنَّمَا هِيَ مِنْ الشَّيْطَانِ فَلْيَسْتَعِذْ مِنْ شَرِّهَا وَلَا يَذْكُرْهَا لِأَحَدٍ فَإِنَّهَا لَا تَضُرُّهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Yuusf] telah menceritakan kepada kami [Al Laits] telah menceritakan kepada kami [Ibnul Al Had] dari [Abdullah bin Khabbab] dari [Abu Sa'id Al Khudri], ia mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang diantara kalian bermimpi yang ia sukai, sebenarnya mimpi tersebut berasal dari Allah, maka hendaklah ia memuji Allah karenanya dan ceritakanlah, adapun jika ia bermimpi selainnya yang tidak disukai, maka itu berasal dari setan, maka hendaklah ia meminta perlindungan dari keburukannya, dan jangan menceritakannya kepada orang lain, sehingga tidak membahayakannya.\""
            },
            {
                "number": 6137,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَحْيَى بْنِ أَبِي كَثِيرٍ وَأَثْنَى عَلَيْهِ خَيْرًا لَقِيتُهُ بِالْيَمَامَةِ عَنْ أَبِيهِ حَدَّثَنَا أَبُو سَلَمَةَ عَنْ أَبِي قَتَادَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الرُّؤْيَا الصَّالِحَةُ مِنْ اللَّهِ وَالْحُلْمُ مِنْ الشَّيْطَانِ فَإِذَا حَلَمَ فَلْيَتَعَوَّذْ مِنْهُ وَلْيَبْصُقْ عَنْ شِمَالِهِ فَإِنَّهَا لَا تَضُرُّهُوَعَنْ أَبِيهِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي قَتَادَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdullah bin Yahya bin Abi katsir] yang ia memujinya dengan baik, aku menemuinya di Yamamah dari [Ayahnya], telah menceritakan kepada kami [Abu Salamah] dari [Abu Qatadah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Mimpi yang baik adalah berasal dari Allah dan mimpi buruk berasal dari setan, maka jika salah seorang diantara kalian bermimpi buruk, hendaklah meminta perlindungan kepada Allah karenanya dan meludah kesamping kirinya, sehingga mimpi buruknya tidak membahayakannya, \" dan dari [ayahnya], telah menceritakan kepada kami [Abdullah bin Abu Qatadah] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam semisalnya."
            },
            {
                "number": 6138,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا غُنْدَرٌ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ عُبَادَةَ بْنِ الصَّامِتِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنْ النُّبُوَّةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Anas bin Malik] dari [Ubadah bin Ash Shamit] dari Nabi shallallahu 'alaihi wasallam bersabda; \"mimpi seorang mukmin adalah satu bagian dari empat puluh enam bagian kenabian.\""
            },
            {
                "number": 6139,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنْ النُّبُوَّةِوَرَوَاهُ ثَابِتٌ وَحُمَيْدٌ وَإِسْحَاقُ بْنُ عَبْدِ اللَّهِ وَشُعَيْبٌ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Qaza'ah] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Az Zuhri] dari [Sa'id bin Musayyab] dari [Abu Hurairah] radliallahu 'anhu, bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mimpi seorang mukmin adalah bagian dari enam atau empat puluh enam bagian kenabian.\" Dan hadits ini diriwayatkan oleh [Tsabit], [Humaid], [Ishaq bin Abdullah] dan [Syu'aib] dari [Anas] dari Nabi shallallahu 'alaihi wasallam."
            },
            {
                "number": 6140,
                "arab": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ حَمْزَةَ حَدَّثَنِي ابْنُ أَبِي حَازِمٍ وَالدَّرَاوَرْدِيُّ عَنْ يَزِيدَ عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الرُّؤْيَا الصَّالِحَةُ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنْ النُّبُوَّةِ",
                "id": "Telah menceritakan kepadaku [Ibrahim bin Hamzah] telah menceritakan kepadaku [Ibnu Abi Hazim] dan [Darawardi] dari [Yazid] dari ['Abdullah bin Khabbab] dari [Abu Sa'id Al Khudzri], ia mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Mimpi yang baik adalah bagian dari empat puluh enam kenabian.\""
            },
            {
                "number": 6141,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَمْ يَبْقَ مِنْ النُّبُوَّةِ إِلَّا الْمُبَشِّرَاتُ قَالُوا وَمَا الْمُبَشِّرَاتُ قَالَ الرُّؤْيَا الصَّالِحَةُ",
                "id": "Telah menceritakan kepada kami [Abul Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah menceritakan kepadaku [Sa'id bin Musayyab], bahwasanya [Abu Hurairah] menuturkan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kenabian tidak ada lagi selain berita gembira, \" para sahabat bertanya; 'apa maksud kabar gembira? ' Nabi shallallahu 'alaihi wasallam menjawab; \"mimpi yang baik.\""
            },
            {
                "number": 6142,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُأَنَّ أُنَاسًا أُرُوا لَيْلَةَ الْقَدْرِ فِي السَّبْعِ الْأَوَاخِرِ وَأَنَّ أُنَاسًا أُرُوا أَنَّهَا فِي الْعَشْرِ الْأَوَاخِرِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْتَمِسُوهَا فِي السَّبْعِ الْأَوَاخِرِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari [Uqail] dari [Ibnu Syihab] dari [Salim bin Abdullah] dari [Ibnu Umar] radliallahu 'anhu; ada beberapa orang yang diperlihatkan kepada mereka lailatul qadar pada tujuh malam terakhir, sedang sebagian yang lain diperlihatkan kepada mereka pada sepuluh malam terakhir, maka Nabi shallallahu 'alaihi wasallam bersabda: \"carilah pada tujuh malam terakhir.\""
            },
            {
                "number": 6143,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ حَدَّثَنَا جُوَيْرِيَةُ عَنْ مَالِكٍ عَنْ الزُّهْرِيِّ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ وَأَبَا عُبَيْدٍ أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ لَبِثْتُ فِي السِّجْنِ مَا لَبِثَ يُوسُفُ ثُمَّ أَتَانِي الدَّاعِي لَأَجَبْتُهُ",
                "id": "Telah menceritakan kepada kami [Abdullah] telah menceritakan kepada kami [Juwairiyah] dari [Malik] dari [Az Zuhri], bahwasanya [Sa'id bin Musayyab] dan [Abu Ubaid] mengabarkan kepadanya dari [Abu Hurairah] radliallahu 'anhu mengatakan, Rasulullah Shallallahu'alaihiwasallam bersabda; \"kalaulah aku mendekam dalam penjara sekian lama sebagaimana Yusuf, kemudian seorang penyeru mendatangiku, niscaya kupenuhi panggilannya.\""
            },
            {
                "number": 6144,
                "arab": "حَدَّثَنَا عَبْدَانُ أَخْبَرَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ حَدَّثَنِي أَبُو سَلَمَةَ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ رَآنِي فِي الْمَنَامِ فَسَيَرَانِي فِي الْيَقَظَةِ وَلَا يَتَمَثَّلُ الشَّيْطَانُ بِيقَالَ أَبُو عَبْد اللَّهِ قَالَ ابْنُ سِيرِينَ إِذَا رَآهُ فِي صُورَتِهِ",
                "id": "Telah menceritakan kepada kami ['Abdan] telah mengabarkan kepada kami [Abdullah] dari [Yunus] dari [Az Zuhri] telah menceritakan kepadaku [Abu Salamah], bahwasanya [Abu Hurairah] mengatakan, aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa melihatku dalam tidur, maka (seakan-akan) ia melihatku ketika terjaga, (karena) setan tidak bisa menyerupaiku.\" Abu Abdullah mengatakan, Ibnu Sirin mengatakan; 'Maksudnya jika melihat beliau dengan bentuk (asli) beliau.'"
            },
            {
                "number": 6145,
                "arab": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُخْتَارٍ حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي فَإِنَّ الشَّيْطَانَ لَا يَتَخَيَّلُ بِي وَرُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنْ النُّبُوَّةِ",
                "id": "Telah menceritakan kepada kami [Mu'allaa bin Asad] telah menceritakan kepada kami ['Abdul 'Aziz bin Mukhtar] telah menceritakan kepada kami [Tsabit Al Bunani] dari [Anas] radliallahu 'anhu mengatakan, Nabi shallallahu 'alaihi wasallam bersabda: \"Siapa melihatku dalam mimpi, berarti ia telah melihatku, sebab setan tidak bisa menjelma sepertiku, dan mimpi seorang mukmin adalah sebagian dari empat puluh enam bagian kenabian.\""
            },
            {
                "number": 6146,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنَا اللَّيْثُ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ أَخْبَرَنِي أَبُو سَلَمَةَ عَنْ أَبِي قَتَادَةَ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرُّؤْيَا الصَّالِحَةُ مِنْ اللَّهِ وَالْحُلْمُ مِنْ الشَّيْطَانِ فَمَنْ رَأَى شَيْئًا يَكْرَهُهُ فَلْيَنْفِثْ عَنْ شِمَالِهِ ثَلَاثًا وَلْيَتَعَوَّذْ مِنْ الشَّيْطَانِ فَإِنَّهَا لَا تَضُرُّهُ وَإِنَّ الشَّيْطَانَ لَا يَتَرَاءَى بِي",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari [ubaidhullah bin Abi Ja'far] telah mengabarkan kepadaku [Abu Salamah] dari [Abu Qatadah] mengatakan, Nabi Shallallahu'alaihiwasallam bersabda: \"Mimpi yang baik adalah berasal dari Allah, sedang mimpi yang buruk berasal dari setan, maka barangsiapa melihat sesuatu yang tidak disukainya, hendaklah ia meludah ke samping kirinya sebanyak tiga kali, dan mintalah perlindungan dari setan, sesungguhnya mimpinya tersebut tidak akan membahayakannya, dan setan tidak mungkin bisa menyerupaiku.\""
            },
            {
                "number": 6147,
                "arab": "حَدَّثَنَا خَالِدُ بْنُ خَلِيٍّ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ حَدَّثَنِي الزُّبَيْدِيُّ عَنْ الزُّهْرِيِّ قَالَ أَبُو سَلَمَةَ قَالَ أَبُو قَتَادَةَ رَضِيَ اللَّهُ عَنْهُقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ رَآنِي فَقَدْ رَأَى الْحَقَّتَابَعَهُ يُونُسُ وَابْنُ أَخِي الزُّهْرِيِّ",
                "id": "Telah menceritakan kepada kami [Khalid bin Khali] telah menceritakan kepada kami [Muhammad bin Harb] telah menceritakan kepadaku [Az Zubaidi] dari [Az Zuhri], [Abu Salamah] mengatakan; [Abu Qatadah] radliallahu 'anhu mengatakan, Nabi Shallallahu'alaihiwasallam bersabda: \"Barangsiapa melihatku berarti telah melihat yang sebenarnya.\" Hadis ini dikuatkan oleh [Yunus] dan [Ibnu Akhi Az Zuhri]."
            },
            {
                "number": 6148,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ حَدَّثَنَا اللَّيْثُ حَدَّثَنِي ابْنُ الْهَادِ عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ رَآنِي فَقَدْ رَأَى الْحَقَّ فَإِنَّ الشَّيْطَانَ لَا يَتَكَوَّنُنِي",
                "id": "Telah menceritakan kepada kami [Abdullah bin Yusuf] telah menceritakan kepada kami [Al Laits] telah menceritakan kepadaku [Ibnul Al Had] dari [Abdullah bin Khabbab] dari [Abu Sa'id Al Khudzri], ia mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa melihatku, berarti ia telah melihat yang sebenarnya, sebab setan tak bisa menjelma sepertiku.\""
            },
            {
                "number": 6149,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ الْمِقْدَامِ الْعِجْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الطُّفَاوِيُّ حَدَّثَنَا أَيُّوبُ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُعْطِيتُ مَفَاتِيحَ الْكَلِمِ وَنُصِرْتُ بِالرُّعْبِ وَبَيْنَمَا أَنَا نَائِمٌ الْبَارِحَةَ إِذْ أُتِيتُ بِمَفَاتِيحِ خَزَائِنِ الْأَرْضِ حَتَّى وُضِعَتْ فِي يَدِي قَالَ أَبُو هُرَيْرَةَ فَذَهَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنْتُمْ تَنْتَقِلُونَهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Al Miqdam Al 'ijli] telah menceritakan kepada kami [Muhammad bin Abdurrahman Ath Thufawi] telah menceritakan kepada kami [Ayyub] dari [Muhammad] dari [Abu Hurairah] mengatakan, Nabi Shallallahu'alaihiwasallam bersabda: \"Aku diberi kunci-kunci al kalim, aku diberi pertolongan dengan ketakutan yang dihunjamkan kedalam dada musuh-musuhku, ketika aku tidur tadi malam, tiba-tiba aku diberi kunci-kunci perbendaharaan bumi hingga diletakkan dalam tanganku.\" Abu Hurairah mengatakan; 'Rasulullah Shallallahu'alaihiwasallam lantas pergi sedang kalian memindahkannya.' "
            },
            {
                "number": 6150,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُرَانِي اللَّيْلَةَ عِنْدَ الْكَعْبَةِ فَرَأَيْتُ رَجُلًا آدَمَ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنْ أُدْمِ الرِّجَالِ لَهُ لِمَّةٌ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنْ اللِّمَمِ قَدْ رَجَّلَهَا تَقْطُرُ مَاءً مُتَّكِئًا عَلَى رَجُلَيْنِ أَوْ عَلَى عَوَاتِقِ رَجُلَيْنِ يَطُوفُ بِالْبَيْتِ فَسَأَلْتُ مَنْ هَذَا فَقِيلَ الْمَسِيحُ ابْنُ مَرْيَمَ ثُمَّ إِذَا أَنَا بِرَجُلٍ جَعْدٍ قَطَطٍ أَعْوَرِ الْعَيْنِ الْيُمْنَى كَأَنَّهَا عِنَبَةٌ طَافِيَةٌ فَسَأَلْتُ مَنْ هَذَا فَقِيلَ الْمَسِيحُ الدَّجَّالُ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Maslamah] dari [Malik] dari [Nafi'] dari ['Abdullah bin Umar] radliallahu 'anhuma, Rasulullah shallallahu 'alaihi wasallam bersabda: \"tadi malam aku diperlihatkan di dekat Ka'bah, aku melihat seorang laki-laki yang kulitnya kemerah-merahan dengan postur manusia paling rupawan yang pernah kamu lihat, rambutnya memanjang hingga sebahu dengan penampilan paling mengesankan, ia tengah menyisiri rambutnya yang meneteskan air, ia bersandaran diatas kedua kakinya, atau diatas tengkuk kedua kakinya, ia thawaf di baitullah, maka aku bertanya; 'Siapakah orang ini? ' Ada jawaban; 'ia adalah Isa bin maryam.' Kemudian tiba-tiba aku bersama seseorang yang rambutnya sangat keriting, matanya buta sebelah kanan seolah-olah buah anggur yang menjorok, maka aku bertanya; 'Siapakah orang ini? ' Ada jawaban; '(dia) al masih ad dajjal.\""
            },
            {
                "number": 6151,
                "arab": "حَدَّثَنَا يَحْيَى حَدَّثَنَا اللَّيْثُ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ أَنَّ ابْنَ عَبَّاسٍ كَانَ يُحَدِّثُأَنَّ رَجُلًا أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي أُرِيتُ اللَّيْلَةَ فِي الْمَنَامِ وَسَاقَ الْحَدِيثَوَتَابَعَهُ سُلَيْمَانُ بْنُ كَثِيرٍ وَابْنُ أَخِي الزُّهْرِيِّ وَسُفْيَانُ بْنُ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ الزُّبَيْدِيُّ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ أَنَّ ابْنَ عَبَّاسٍ أَوْ أَبَا هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ شُعَيْبٌ وَإِسْحَاقُ بْنُ يَحْيَى عَنْ الزُّهْرِيِّ كَانَ أَبُو هُرَيْرَةَ يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ مَعْمَرٌ لَا يُسْنِدُهُ حَتَّى كَانَ بَعْدُ",
                "id": "Telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Al Laits] dari [Yunus] dari [Ibnu Syihab] dari [ubaidhullah bin Abdullah], [Ibnu 'Abbas] bercerita; bahwa ada seseorang menemui Rasulullah shallallahu 'alaihi wasallam dan berujar; 'Semalam aku diperlihatkan dalam mimpi, ' lalu ia memaparkan hadits tersebut. Dan hadits ini dikuatkan oleh [Sulaiman bin Katsir], [Ibnu Akhi Az Zuhri] dan [Sufyan bin Husain] dari [Az Zuhri] dari [ubaidhullah] dari [Ibnu 'Abbas] dari Nabi shallallahu 'alaihi wasallam. Dan [Az Zubaidi] mengatakan dari [Az Zuhri] dari [ubaidhullah], bahwasa [Ibnu Abbas] atau [Abu Hurairah] dari Nabi Shallallahu'alaihiwasallam. Sedang [Syu'aib] dan [Ishaq bin Yahya] mengatakan dari [Az Zuhri] dari adalah [Abu Hurairah] menceritakan dari Nabi shallallahu 'alaihi wasallam, dan Ma'mar tidak menyandarkannya hingga waktu selanjutnya."
            },
            {
                "number": 6152,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ أَخْبَرَنَا مَالِكٌ عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْخُلُ عَلَى أُمِّ حَرَامٍ بِنْتِ مِلْحَانَ وَكَانَتْ تَحْتَ عُبَادَةَ بْنِ الصَّامِتِ فَدَخَلَ عَلَيْهَا يَوْمًا فَأَطْعَمَتْهُ وَجَعَلَتْ تَفْلِي رَأْسَهُ فَنَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ اسْتَيْقَظَ وَهُوَ يَضْحَكُ قَالَتْ فَقُلْتُ مَا يُضْحِكُكَ يَا رَسُولَ اللَّهِ قَالَ نَاسٌ مِنْ أُمَّتِي عُرِضُوا عَلَيَّ غُزَاةً فِي سَبِيلِ اللَّهِ يَرْكَبُونَ ثَبَجَ هَذَا الْبَحْرِ مُلُوكًا عَلَى الْأَسِرَّةِ أَوْ مِثْلَ الْمُلُوكِ عَلَى الْأَسِرَّةِ شَكَّ إِسْحَاقُ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ فَدَعَا لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ وَضَعَ رَأْسَهُ ثُمَّ اسْتَيْقَظَ وَهُوَ يَضْحَكُ فَقُلْتُ مَا يُضْحِكُكَ يَا رَسُولَ اللَّهِ قَالَ نَاسٌ مِنْ أُمَّتِي عُرِضُوا عَلَيَّ غُزَاةً فِي سَبِيلِ اللَّهِ كَمَا قَالَ فِي الْأُولَى قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ قَالَ أَنْتِ مِنْ الْأَوَّلِينَ فَرَكِبَتْ الْبَحْرَ فِي زَمَانِ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ فَصُرِعَتْ عَنْ دَابَّتِهَا حِينَ خَرَجَتْ مِنْ الْبَحْرِ فَهَلَكَتْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Yusuf], Telah mengabarkan kepada kami [Malik] dari [Ishaq bin Abdullah bin Abu Thalhah], ia mendengar [Anas bin Malik] mengatakan, Rasulullah Shallallahu'alaihiwasallam Pernah menemui Ummu haram binti Milhan yang diperistiri oleh 'Ubadah bin Shamit. Suatu hari beliau shallallahu 'alaihi wasallam menemuinya, dan Ummu Haram memberinya makanan dan mencari kutu di kepalanya. kemudian Rasulullah shallallahu 'alaihi wasallam tertidur, lantas bangun dan tertawa. Kata Ummu Haram; saya bertanya; 'Apa yang menjadikanmu tertawa ya Rasulullah? ' Beliau menjawab: \"Sekian orang dari umatku diperlihatkan kepadaku dalam keadaan berperang fii sabiilillah, mereka mengarungi permukaan lautan sebagai raja-raja diatas permadani, -atau dengan redaksi- seperti raja-raja diatas permadani \"- Ishaq ragu kepastian redaksinya.- Kata Ummu haram; 'ya Rasulullah, doakanlah aku agar Allah menjadikan diriku diantara mereka? ' maka Rasulullah shallallahu 'alaihi wasallam mendoakan untuknya. Kemudian Rasulullah shallallahu 'alaihi wasallam meletakkan kepalanya, kemudian bangun dengan tertawa, maka aku(Ummu Haram) bertanya; 'Apa yang menjadikan dirimu tertawa ya Rasulullah? ' Nabi menjawab; \"ada beberapa manusia dari kalangan umatku menjadi pejuang fii sabilillah, \" dan seterusnya sebagaimana diatas. Ummu Haram berkata; 'ya Rasulullah, doakanlah aku agar Allah menjadikan diriku diantara mereka! ' Nabi bersabda: \"engkau termasuk rombongan pejuang yang pertama.\" Kemudian Ummu Haram mengarungi lautan di zaman pemerintahan Mu'awiyah bin Abu Sufyan, dan hewan tunggangannya terpeleset ketika keluar dari lautan, sehingga Ummu haram meninggal."
            },
            {
                "number": 6153,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ أَنَّ أُمَّ الْعَلَاءِامْرَأَةً مِنْ الْأَنْصَارِ بَايَعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُ أَنَّهُمْ اقْتَسَمُوا الْمُهَاجِرِينَ قُرْعَةً قَالَتْ فَطَارَ لَنَا عُثْمَانُ بْنُ مَظْعُونٍ وَأَنْزَلْنَاهُ فِي أَبْيَاتِنَا فَوَجِعَ وَجَعَهُ الَّذِي تُوُفِّيَ فِيهِ فَلَمَّا تُوُفِّيَ غُسِّلَ وَكُفِّنَ فِي أَثْوَابِهِ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ رَحْمَةُ اللَّهِ عَلَيْكَ أَبَا السَّائِبِ فَشَهَادَتِي عَلَيْكَ لَقَدْ أَكْرَمَكَ اللَّهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا يُدْرِيكِ أَنَّ اللَّهَ أَكْرَمَهُ فَقُلْتُ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ فَمَنْ يُكْرِمُهُ اللَّهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا هُوَ فَوَاللَّهِ لَقَدْ جَاءَهُ الْيَقِينُ وَاللَّهِ إِنِّي لَأَرْجُو لَهُ الْخَيْرَ وَ وَاللَّهِ مَا أَدْرِي وَأَنَا رَسُولُ اللَّهِ مَاذَا يُفْعَلُ بِي فَقَالَتْ وَاللَّهِ لَا أُزَكِّي بَعْدَهُ أَحَدًا أَبَدًاحَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ بِهَذَا وَقَالَ مَا أَدْرِي مَا يُفْعَلُ بِهِ قَالَتْ وَأَحْزَنَنِي فَنِمْتُ فَرَأَيْتُ لِعُثْمَانَ عَيْنًا تَجْرِي فَأَخْبَرْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ذَلِكَ عَمَلُهُ",
                "id": "Telah menceritakan kepada kami [Sa'id bin 'Ufair] telah menceritakan kepadaku [Al Laits] telah menceritakan kepada kami [Uqail] dari [Ibnu Syihab] telah mengabarkan kepadaku [Kharijah bin Zaid bin Tsabit], bahwa [Ummul 'Ala] seorang wanita anshar yang pernah berbai'at kepada Rasulullah Shallallahu'alaihiwasallam mengabarinya; bahwasanya para sahabat membagi-bagi kantong kulit kepada kaum muhajirin, tiba-tiba Utsman bin mazh'un bergegas menemui kami, dan kami tempatkan didalam rumah kami, kemudian ia sakit yang menyebabkan kematiannya. Tatkala ia meninggal, dia dimandikan dan dikafankan dalam kainnya, Rasulullah Shallallahu'alaihiwasallam masuk. Lantas saya bergumam; 'Kiranya rahmat Alalh terlimpah kepadamu hai Abu Saib, dan persaksianku terhadap dirimu, sungguh Allah telah memuliakanmu.' Rasulullah Shallallahu'alaihiwasallam bertanya: \"dari mana kamu tahu bahwa Allah telah memuliakannya?\" Saya menjawab; 'Dengan ayahku sebagai tebusanmu ya Rasulullah, siapakah yang dimuliakan Allah? ' Rasulullah bersabda; \"Adapun dia, demi Allah, kematian telah merenggutnya, demi Allah, sungguh aku berharap ia memperoleh kebaikan, dan demi Allah, saya tidak tahu bagaimana aku diperlakukan nanti sedang aku Rasulullah.\" Kata Ummul 'Ala; Demi Allah, saya sama sekali tidak akan mensucikan seseorang setelahnya selamanya.' Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] dengan isnad ini, dan ia mengatakan; \"Saya tidak tahu, bagaimana aku diperlakukan!\" kata Ummul 'Ala; hal itu menjadikanku sedih sehingga aku tidur dan aku bermimpi melihat 'Utsman mempunyai mata air yang mengalir, dan aku kabarkan kepada Rasulullah Shallallahu'alaihiwasallam, dan beliau bersabda: \"Itulah amalnya.\""
            },
            {
                "number": 6154,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ أَنَّ أَبَا قَتَادَةَ الْأَنْصَارِيَّوَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفُرْسَانِهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الرُّؤْيَا مِنْ اللَّهِ وَالْحُلْمُ مِنْ الشَّيْطَانِ فَإِذَا حَلَمَ أَحَدُكُمْ الْحُلُمَ يَكْرَهُهُ فَلْيَبْصُقْ عَنْ يَسَارِهِ وَلْيَسْتَعِذْ بِاللَّهِ مِنْهُ فَلَنْ يَضُرَّهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Bukair] telah menceritakan kepada kami [Al Laits] dari [Uqail] dari [Ibnu Syihab] dari [Abu Salamah], bahwasanya [Qatadah Al Anshari] dan dia termasuk dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan pejuang penunggang kudanya, mengatakan; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mimpi yang baik adalah berasal dari Allah, sedang mimpi yang buruk berasal dari setan, maka jika salah seorang diantara kalian bermimpi yang tidak disukainya, hendaklah meludah ke sebelah kirinya dan meminta perlindungan kepada Allah, niscaya yang sedemikian itu tidak membahayaknnya.\""
            },
            {
                "number": 6155,
                "arab": "حَدَّثَنَا عَبْدَانُ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا يُونُسُ عَنْ الزُّهْرِيِّ أَخْبَرَنِي حَمْزَةُ بْنُ عَبْدِ اللَّهِ أَنَّ ابْنَ عُمَرَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِقَدَحِ لَبَنٍ فَشَرِبْتُ مِنْهُ حَتَّى إِنِّي لَأَرَى الرِّيَّ يَخْرُجُ مِنْ أَظْفَارِي ثُمَّ أَعْطَيْتُ فَضْلِي يَعْنِي عُمَرَ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ الْعِلْمَ",
                "id": "Telah menceritakan kepada kami ['Abdan] Telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Yunus] dari [Az Zuhri] telah mengabarkan kepadaku [Hamzah bin 'Abdullah], bahwasanya [Ibnu Umar] mengatakan, aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika aku tertidur, aku diberi gelas susu, lantas aku minum sehingga kulihat sungai keluar dari kuku-kuku-ku, kemudian kelebihannya aku berikan kepada Umar.\" Para sahabat bertanya; 'Lantas bagaimana anda takwilkan ya Rasulullah? ' Nabi menjawab; \"itulah ilmu.\""
            },
            {
                "number": 6156,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي حَمْزَةُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِقَدَحِ لَبَنٍ فَشَرِبْتُ مِنْهُ حَتَّى إِنِّي لَأَرَى الرِّيَّ يَخْرُجُ مِنْ أَطْرَافِي فَأَعْطَيْتُ فَضْلِي عُمَرَ بْنَ الْخَطَّابِ فَقَالَ مَنْ حَوْلَهُ فَمَا أَوَّلْتَ ذَلِكَ يَا رَسُولَ اللَّهِ قَالَ الْعِلْمَ",
                "id": "Telah menceritakan kepada kami ['Ali bin Abdullah] telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Ayahku] dari [Abu Shalih] dari [Ibnu Syihab] telah menceritakan kepadaku [Hamzah bin Abdullah bin Umar], bahwasanya ia mendengar [Abdullah bin Umar] radliallahu 'anhuma mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika aku tidur, aku diberi segelas susu, lantas aku meminumnya hingga aku betul-betul melihat sungai dari ujung-ujung jari jemariku, lantas kuberikan kelebihannya kepada Umar bin Khattab.\" Maka para sahabat yang di sekitarnya berujar; 'bagaimana engkau takwilkan Ya Rasulullah? ' Beliau menjawab; \"seperti itulah ilmu.\""
            },
            {
                "number": 6157,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنِي أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي أَبُو أُمَامَةَ بْنُ سَهْلٍ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَمَا أَنَا نَائِمٌ رَأَيْتُ النَّاسَ يُعْرَضُونَ عَلَيَّ وَعَلَيْهِمْ قُمُصٌ مِنْهَا مَا يَبْلُغُ الثَّدْيَ وَمِنْهَا مَا يَبْلُغُ دُونَ ذَلِكَ وَمَرَّ عَلَيَّ عُمَرُ بْنُ الْخَطَّابِ وَعَلَيْهِ قَمِيصٌ يَجُرُّهُ قَالُوا مَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ الدِّينَ",
                "id": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepadaku [Ayahku] dari [Shalih] dari [Ibnu Syihab] mengatakan, telah menceritakan kepadaku [Abu Umamah bin Sahal] bahwasanya ia mendengar [Abu Sa'id Al Khudzri] mengatakan; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika aku tidur, aku melihat manusia diperlihatkan kepadaku sedang mereka memakai baju gamis, ada yang sampai ke dadanya, ada yang sampai lebih bawah daripada itu, dan Umar bin Khattab melewati dengan gamis yang ia seret.\" Para sahabat bertanya; 'Bagaimana anda menakwilkan? ' Rasulullah menjawab: \"Itulah agama!\""
            },
            {
                "number": 6158,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي أَبُو أُمَامَةَ بْنُ سَهْلٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بَيْنَا أَنَا نَائِمٌ رَأَيْتُ النَّاسَ عُرِضُوا عَلَيَّ وَعَلَيْهِمْ قُمُصٌ فَمِنْهَا مَا يَبْلُغُ الثَّدْيَ وَمِنْهَا مَا يَبْلُغُ دُونَ ذَلِكَ وَعُرِضَ عَلَيَّ عُمَرُ بْنُ الْخَطَّابِ وَعَلَيْهِ قَمِيصٌ يَجْتَرُّهُ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ الدِّينَ",
                "id": "Telah menceritakan kepada kami [Sa'id bin 'Ufair] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Uqail] dari [Ibnu Syihab] telah mengabarkan kepadaku [Abu Umamah bin Sahal] dari [Abu Sa'id Al Khudzri] radliallahu 'anhu mengatakan; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika aku tidur, diperlihatkan manusia padaku dan mereka memakai gamis, diantaranya ada yang sampai putting susunya, ada yang dibawahnya, dan Umar diperlihatkan kepadaku sedang menyeret baju gamisnya.\" Para sahabat bertanya; 'bagaimana anda menakwilkan ya Rasulullah? ' Nabi menjawab; \"itulah agama.\""
            },
            {
                "number": 6159,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ قَالَ قَالَ قَيْسُ بْنُ عُبَادٍكُنْتُ فِي حَلْقَةٍ فِيهَا سَعْدُ بْنُ مَالِكٍ وَابْنُ عُمَرَ فَمَرَّ عَبْدُ اللَّهِ بْنُ سَلَامٍ فَقَالُوا هَذَا رَجُلٌ مِنْ أَهْلِ الْجَنَّةِ فَقُلْتُ لَهُ إِنَّهُمْ قَالُوا كَذَا وَكَذَا قَالَ سُبْحَانَ اللَّهِ مَا كَانَ يَنْبَغِي لَهُمْ أَنْ يَقُولُوا مَا لَيْسَ لَهُمْ بِهِ عِلْمٌ إِنَّمَا رَأَيْتُ كَأَنَّمَا عَمُودٌ وُضِعَ فِي رَوْضَةٍ خَضْرَاءَ فَنُصِبَ فِيهَا وَفِي رَأْسِهَا عُرْوَةٌ وَفِي أَسْفَلِهَا مِنْصَفٌ وَالْمِنْصَفُ الْوَصِيفُ فَقِيلَ ارْقَهْ فَرَقِيتُهُ حَتَّى أَخَذْتُ بِالْعُرْوَةِ فَقَصَصْتُهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمُوتُ عَبْدُ اللَّهِ وَهُوَ آخِذٌ بِالْعُرْوَةِ الْوُثْقَى",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad Al Ju'fi] telah menceritakan kepada kami [Harami bin Umarah] telah menceritakan kepada kami [Qurrah bin Khalid] dari [Muhammad bin Sirin] mengatakan, [Qais bin Ubad] mengatakan; aku berada di suatu halaqah yang disana terdapat Sa'd bin malik dan Ibnu Umar, lantas [Abdullah bin Salam] lewat, kemudian mereka mengatakan; 'Ini adalah seorang penghuni surga.' Maka saya katakan kepada Abdullah bahwa mereka telah mengatakan demikian dan demikian. Spontan Abdullah bin Salam mengatakan: 'Subhanallah, tak sepantasnya mereka mengucapkan suatu hal yang mereka tidak mempunyai pengetahuan tentangnya, hanyasanya aku bermimpi seolah-olah ada sebuah tiang yang diletakkan dalam sebuah kebun hijau, kemudian tiang itu ditegakkan disana sedang di ujung tongkat itu terdapat tali dan bagian bawahnya terdapat seorang pelayan, kemudian ada suatu suara yang terdengar; 'naikilah tiang tersebut! ' Maka aku menaikinya hingga aku berhasil mengambil tali. Kejadian ini aku kisahkan kepada Rasulullah Shallallahu'alaihiwasallam, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Abdullah bin Salam meninggal sedang ia memegang tali yang kokoh.\""
            },
            {
                "number": 6160,
                "arab": "حَدَّثَنَا عُبَيْدُ بْنُ إِسْمَاعِيلَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُرِيتُكِ فِي الْمَنَامِ مَرَّتَيْنِ إِذَا رَجُلٌ يَحْمِلُكِ فِي سَرَقَةٍ مِنْ حَرِيرٍ فَيَقُولُ هَذِهِ امْرَأَتُكَ فَأَكْشِفُهَا فَإِذَا هِيَ أَنْتِ فَأَقُولُ إِنْ يَكُنْ هَذَا مِنْ عِنْدِ اللَّهِ يُمْضِهِ",
                "id": "Telah menceritakan kepada kami [Ubaid bin Isma'il] telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [ayahnya] dari [Aisyah] radliallahu 'anha mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kulihat engkau dalam mimpi dua kali, tak tahunya ada seseorang menggendongmu dengan sehelai kain sutera, dan berujar; 'Ini isterimu! ' maka aku singkap, tak tahunya adalah engkau, maka kukatakan; 'Kalaulah ini berasal dari Allah, lakukanlah! '\""
            },
            {
                "number": 6161,
                "arab": "حَدَّثَنَا مُحَمَّدٌ أَخْبَرَنَا أَبُو مُعَاوِيَةَ أَخْبَرَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُرِيتُكِ قَبْلَ أَنْ أَتَزَوَّجَكِ مَرَّتَيْنِ رَأَيْتُ الْمَلَكَ يَحْمِلُكِ فِي سَرَقَةٍ مِنْ حَرِيرٍ فَقُلْتُ لَهُ اكْشِفْ فَكَشَفَ فَإِذَا هِيَ أَنْتِ فَقُلْتُ إِنْ يَكُنْ هَذَا مِنْ عِنْدِ اللَّهِ يُمْضِهِ ثُمَّ أُرِيتُكِ يَحْمِلُكِ فِي سَرَقَةٍ مِنْ حَرِيرٍ فَقُلْتُ اكْشِفْ فَكَشَفَ فَإِذَا هِيَ أَنْتِ فَقُلْتُ إِنْ يَكُ هَذَا مِنْ عِنْدِ اللَّهِ يُمْضِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad] telah mengabarkan kepada kami [Abu Mu'awiyah] telah mengabarkan kepada kami [Hisyam] dari [ayahnya] dari [Aisyah] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"aku melihatmu dalam mimpi sebelum aku menikahimu sebanyak dua kali, kulihat seorang malaikat menggendongmu dalam sebuah kain sutera, maka aku berujar; 'singkaplah kain ini! ' maka malaikat tersebut menyingkapnya, dan ternyata engkau. Maka aku katakan; 'Kalaulah ini benar-benar dari Allah, laksanakanlah! ' Kemudian engkau diperlihatkan dalam mimpiku, ada malaikat yang menggendongmu dalam sehelai kain sutera, maka aku berujar; 'singkaplah kainnya! ' malaikat pun menyingkapnya, dan ternyata engkau, maka kukatakan; 'Kalaulah ini dari Allah, laksanakanlah! '\""
            },
            {
                "number": 6162,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ حَدَّثَنَا اللَّيْثُ حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بُعِثْتُ بِجَوَامِعِ الْكَلِمِ وَنُصِرْتُ بِالرُّعْبِ وَبَيْنَا أَنَا نَائِمٌ أُتِيتُ بِمَفَاتِيحِ خَزَائِنِ الْأَرْضِ فَوُضِعَتْ فِي يَدِيقَالَ أَبُو عَبْد اللَّهِ وَبَلَغَنِي أَنَّ جَوَامِعَ الْكَلِمِ أَنَّ اللَّهَ يَجْمَعُ الْأُمُورَ الْكَثِيرَةَ الَّتِي كَانَتْ تُكْتَبُ فِي الْكُتُبِ قَبْلَهُ فِي الْأَمْرِ الْوَاحِدِ وَالْأَمْرَيْنِ أَوْ نَحْوَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Sa'id bin 'Ufair] Telah menceritakan kepada kami [Al Laits] telah menceritakan kepadaku [Uqail] dari [Ibnu Syihab] telah mengabarkan kepadaku [Sa'id bin Musayyab], bahwasanya [Abu Hurairah] mengatakan, aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku diutus dengan membawa jawami' kalim, dan aku diberi pertolongan dengan rasa takut yang dihunjamkan dalam dada-dada musuhku, dan ketika aku tidur, aku diberi kunci-kunci perbendaharaan bumi, dan diletakkan pada kedua tanganku.\" Abu Abdullah mengatakan, dan sampai berita kepadaku bahwa makna jawami' kalim ialah, Allah menghimpun sekian banyak masalah yang pernah ditulis dalam kitab-kitab suci sebelumnya dalam satu masalah atau dua masalah, atau seperti itu. "
            },
            {
                "number": 6163,
                "arab": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا أَزْهَرُ عَنْ ابْنِ عَوْنٍ ح و حَدَّثَنِي خَلِيفَةُ حَدَّثَنَا مُعَاذٌ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ مُحَمَّدٍ حَدَّثَنَا قَيْسُ بْنُ عُبَادٍ عَنْ عَبْدِ اللَّهِ بْنِ سَلَامٍ قَالَرَأَيْتُ كَأَنِّي فِي رَوْضَةٍ وَوَسَطَ الرَّوْضَةِ عَمُودٌ فِي أَعْلَى الْعَمُودِ عُرْوَةٌ فَقِيلَ لِي ارْقَهْ قُلْتُ لَا أَسْتَطِيعُ فَأَتَانِي وَصِيفٌ فَرَفَعَ ثِيَابِي فَرَقِيتُ فَاسْتَمْسَكْتُ بِالْعُرْوَةِ فَانْتَبَهْتُ وَأَنَا مُسْتَمْسِكٌ بِهَا فَقَصَصْتُهَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ تِلْكَ الرَّوْضَةُ رَوْضَةُ الْإِسْلَامِ وَذَلِكَ الْعَمُودُ عَمُودُ الْإِسْلَامِ وَتِلْكَ الْعُرْوَةُ عُرْوَةُ الْوُثْقَى لَا تَزَالُ مُسْتَمْسِكًا بِالْإِسْلَامِ حَتَّى تَمُوتَ",
                "id": "Telah menceritakan kepadaku ['Abdullah bin Muhammad] telah menceritakan kepada kami [Azhar] dari [Ibnu Aun] -lewat jalur periwayatan lain-dan telah menceritakan kepadaku [Khalifah] telah menceritakan kepada kami [Mu'adz] telah menceritakan kepada kami [Ibnu 'Aun] dari [Muhammad] telah menceritakan kepada kami [Qais bin Ubbad] dari ['Abdullah bin Salam] mengatakan; di sebuah taman atau tengah-tengah taman seolah-olah aku melihat sebuah tiang yang bagian paling atas tiang terdapat tali, kemudian dikatakan kepadaku; 'naikilah! ' aku berkata; 'aku tidak bisa menaikinya! ' lantas seorang pelayan mendatangiku dan mengangkat pakaianku, dan aku dinaikkan, dan aku berpegang erat dengan tali tersebut. Tiba-tiba aku terbangun dalam kondisi masih berpegangan dengan tali itu. Kejadian mimpiku ini kukisahkan kepada Rasulullah Shallallahu'alaihiwasallam, dan beliau bersabda; \"Taman itu maksudnya taman Islam, dan tiang itu maksudnya tiang Islam, dan tali itu maksudnya tali yang kokoh, engkau senantiasa memegang teguh Islam, hingga engkau meninggal.\""
            },
            {
                "number": 6164,
                "arab": "حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ حَدَّثَنَا وُهَيْبٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَرَأَيْتُ فِي الْمَنَامِ كَأَنَّ فِي يَدِي سَرَقَةً مِنْ حَرِيرٍ لَا أَهْوِي بِهَا إِلَى مَكَانٍ فِي الْجَنَّةِ إِلَّا طَارَتْ بِي إِلَيْهِ فَقَصَصْتُهَا عَلَى حَفْصَةَ فَقَصَّتْهَا حَفْصَةُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أَخَاكِ رَجُلٌ صَالِحٌ أَوْ قَالَ إِنَّ عَبْدَ اللَّهِ رَجُلٌ صَالِحٌ",
                "id": "Telah menceritakan kepada kami [Mu'alla bin Asad] telah menceritakan kepada kami [Wuhaib] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] radliallahu 'anhuma, mengatakan; aku bermimpi dalam tidur, seolah-olah di tanganku ada sehelai kain sutera, tidaklah aku berkeinginan menuju suatu tempat dalam surga dengan membawanya melainkan kain itu menerbangkan aku. Maka kukisahkan mimpiku kepada [Hafshah], dan Hafshah mengisahkan kepada Nabi shallallahu 'alaihi wasallam dan beliau bersabda: \"Saudaramu adalah laki-laki Shalih, \" atau beliau bersabda: \"Sesungguhnya Abdullah laki-laki Shalih.\""
            },
            {
                "number": 6165,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَبَّاحٍ حَدَّثَنَا مُعْتَمِرٌ سَمِعْتُ عَوْفًا حَدَّثَنَا مُحَمَّدُ بْنُ سِيرِينَ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اقْتَرَبَ الزَّمَانُ لَمْ تَكَدْ تَكْذِبُ رُؤْيَا الْمُؤْمِنِ وَرُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنْ النُّبُوَّةِ وَمَا كَانَ مِنْ النُّبُوَّةِ فَإِنَّهُ لَا يَكْذِبُقَالَ مُحَمَّدٌ وَأَنَا أَقُولُ هَذِهِ قَالَ وَكَانَ يُقَالُ الرُّؤْيَا ثَلَاثٌ حَدِيثُ النَّفْسِ وَتَخْوِيفُ الشَّيْطَانِ وَبُشْرَى مِنْ اللَّهِ فَمَنْ رَأَى شَيْئًا يَكْرَهُهُ فَلَا يَقُصَّهُ عَلَى أَحَدٍ وَلْيَقُمْ فَلْيُصَلِّ قَالَ وَكَانَ يُكْرَهُ الْغُلُّ فِي النَّوْمِ وَكَانَ يُعْجِبُهُمْ الْقَيْدُ وَيُقَالُ الْقَيْدُ ثَبَاتٌ فِي الدِّينِ وَرَوَى قَتَادَةُ وَيُونُسُ وَهِشَامٌ وَأَبُو هِلَالٍ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَدْرَجَهُ بَعْضُهُمْ كُلَّهُ فِي الْحَدِيثِ وَحَدِيثُ عَوْفٍ أَبْيَنُ وَقَالَ يُونُسُ لَا أَحْسِبُهُ إِلَّا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْقَيْدِ قَالَ أَبُو عَبْد اللَّهِ لَا تَكُونُ الْأَغْلَالُ إِلَّا فِي الْأَعْنَاقِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Shabbah] Telah menceritakan kepada kami [Mu'tamir] aku mendengar [Auf] telah menceritakan kepada kami [Muhammad bin Sirin] bahwasanya ia mendengar [Abu Hurairah] mengatakan, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika Zaman semakin mendekat, mimpi seorang mukmin nyaris tidak bohong, dan mimpi seorang mukmin adalah satu bagian dari empat puluh bagian kenabian, dan apa yang berasal dari kenabian tentu tidaklah bohong.\" Muhammad mengatakan; 'Dan aku katakan sedemikain ini.' Ia juga mengatakan; Ada berita bahwa mimpi ada tiga, sekedar bisikan jiwa, teror dari setan dan kabar gembira dari Allah, maka barangsiapa bermimpi suatu hal yang tak disukainya, jangan menceritakannya kepada seorang pun, hendaklah ia bangun dan mendirikan sholat. Juga Abu Hurairah berkata, Rasulullah juga membenci Al ghull saat tidur (tidur terus menerus) dan beliau terkagum-kagum terhadap keistiqomahan beragama, dan makna al qaid adalah keteguhan beragama. Sedang [Qatadah], [Yunus] dan [Hisyam] serta [Abu Hilal] meriwayatkan dari [Ibnu Sirin] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, dan sebagian mereka memudrajkan keseluruhan hadits ini, dan hadits Ibnu Auf lebih jelas. Sedang Yunus mengatakan; aku tidak mengira hadits tentang Qaid (keteguhan beragama) tersebut kecuali dari Nabi shallallahu 'alaihi wasallam. Dan Abu Abdullah mengatakan; Istilah aghlal (belenggu) tak terjadi selain untuk leher."
            },
            {
                "number": 6166,
                "arab": "حَدَّثَنَا عَبْدَانُ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ عَنْ أُمِّ الْعَلَاءِوَهِيَ امْرَأَةٌ مِنْ نِسَائِهِمْ بَايَعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ طَارَ لَنَا عُثْمَانُ بْنُ مَظْعُونٍ فِي السُّكْنَى حِينَ اقْتَرَعَتْ الْأَنْصَارُ عَلَى سُكْنَى الْمُهَاجِرِينَ فَاشْتَكَى فَمَرَّضْنَاهُ حَتَّى تُوُفِّيَ ثُمَّ جَعَلْنَاهُ فِي أَثْوَابِهِ فَدَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ رَحْمَةُ اللَّهِ عَلَيْكَ أَبَا السَّائِبِ فَشَهَادَتِي عَلَيْكَ لَقَدْ أَكْرَمَكَ اللَّهُ قَالَ وَمَا يُدْرِيكِ قُلْتُ لَا أَدْرِي وَاللَّهِ قَالَ أَمَّا هُوَ فَقَدْ جَاءَهُ الْيَقِينُ إِنِّي لَأَرْجُو لَهُ الْخَيْرَ مِنْ اللَّهِ وَاللَّهِ مَا أَدْرِي وَأَنَا رَسُولُ اللَّهِ مَا يُفْعَلُ بِي وَلَا بِكُمْ قَالَتْ أُمُّ الْعَلَاءِ فَوَاللَّهِ لَا أُزَكِّي أَحَدًا بَعْدَهُ قَالَتْ وَرَأَيْتُ لِعُثْمَانَ فِي النَّوْمِ عَيْنًا تَجْرِي فَجِئْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ ذَاكِ عَمَلُهُ يَجْرِي لَهُ",
                "id": "Telah menceritakan kepada kami ['Abdan] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Kharijah bin Zaid bin tsabit] dari [Ummul 'Alaa`] salah seorang sahabiyah yang pernah ikut berbaiat kepada Rasulullah Shallallahu'alaihiwasallam, mengatakan; Utsman bin mazh'un mendatangi kami dalam sebuah hunian ketika orang anshar membagi-bagi pembagian hunian kaum muhajirin, ia kemudian mengeluhkan sakitnya dan kami merawatnya hingga meninggal. Kemudian kami mengkafaninya dengan bajunya. Rasulullah Shallallahu'alaihiwasallam selanjutnya menemui kami, dan kami berujar; 'Semoga engkau hai Abu Sa`ib, mendapat rahmat Allah, kesaksianku terhadapmu, adalah betul-betul Allah telah memuliakanmu! ' Nabi bertanya; \"dari mana kamu tahu?\" Aku jawab; 'Saya tidak tahu.' Nabi bersabda; \"demi Allah sungguh ia telah menghadapi kematian, dan saya hanya berharap ia memperoleh kebaikan dari Allah, demi Allah, aku tidak tahu padahal aku adalah Rasulullah bagaimana nantinya aku diperlakukan, juga tidak tahu bagaimana kalian diperlakukan.\" Ummul 'Ala` berguman; 'Demi Allah, aku tidak akan mensucikan seseorang setelahnya'. Dia menuturkan kembali; 'dan aku bermimpi melihat Ustman bin mazh'un mempunyai sungai yang mengalir, kemudian aku mendatangi Rasulullah Shallallahu'alaihiwasallam, aku ceritakan mimpiku kepada beliau, dan beliau bersabda: \"Itu pertanda bahwa amalnya terus mengalir baginya.\""
            },
            {
                "number": 6167,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ كَثِيرٍ حَدَّثَنَا شُعَيْبُ بْنُ حَرْبٍ حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ حَدَّثَنَا نَافِعٌ أَنَّ ابْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا حَدَّثَهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَا أَنَا عَلَى بِئْرٍ أَنْزِعُ مِنْهَا إِذْ جَاءَ أَبُو بَكْرٍ وَعُمَرُ فَأَخَذَ أَبُو بَكْرٍ الدَّلْوَ فَنَزَعَ ذَنُوبًا أَوْ ذَنُوبَيْنِ وَفِي نَزْعِهِ ضَعْفٌ فَغَفَرَ اللَّهُ لَهُ ثُمَّ أَخَذَهَا عُمَرُ بْنُ الْخَطَّابِ مِنْ يَدِ أَبِي بَكْرٍ فَاسْتَحَالَتْ فِي يَدِهِ غَرْبًا فَلَمْ أَرَ عَبْقَرِيًّا مِنْ النَّاسِ يَفْرِي فَرْيَهُ حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Katsir] telah menceritakan kepada kami [Syu'aib bin Harb] telah menceritakan kepada kami [Shakhr bin Juwairiyah] telah menceritakan kepada kami [Nafi'], bahwasanya [Ibnu Umar] radliallahu 'anhuma menceritakan kepadanya dengan mengatakan; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika aku berada di sebuah sumur sedang menarik ember, tiba-tiba Abu bakar dan Umar datang, kemudian Abu Bakar menarik seember atau dua ember dan dalam tarikannya terlihat ada kelemahan, Allah pun mengampuninya, kemudian Umar bin Khattab mengambil ember dari tangan Abu Bakar, tiba-tiba embernya berubah menjadi besar, tidak pernah aku melihat seorang jenius yang beramal serius (gigih) seperti kegigihannya, sehingga orang banyak bisa minum dengan kenyang.\""
            },
            {
                "number": 6168,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ عَنْ سَالِمٍ عَنْ أَبِيهِعَنْ رُؤْيَا النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَبِي بَكْرٍ وَعُمَرَ قَالَ رَأَيْتُ النَّاسَ اجْتَمَعُوا فَقَامَ أَبُو بَكْرٍ فَنَزَعَ ذَنُوبًا أَوْ ذَنُوبَيْنِ وَفِي نَزْعِهِ ضَعْفٌ وَاللَّهُ يَغْفِرُ لَهُ ثُمَّ قَامَ ابْنُ الْخَطَّابِ فَاسْتَحَالَتْ غَرْبًا فَمَا رَأَيْتُ مِنْ النَّاسِ مَنْ يَفْرِي فَرْيَهُ حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus], telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Musa bin 'Uqbah] dari [Salim] dari [ayahnya] tentang mimpi Nabi shallallahu 'alaihi wasallam berkaitan dengan Abu Bakar dan Umar, beliau bersabda: \"aku melihat orang-orang berkumpul, kemudian Abu Bakar berdiri dan menarik ember atau dua ember dan dalam tarikannya ada kelemahan, Allah pun mengampuninya, kemudian Umar bin Khattab berdiri dan tiba-tiba ember tersebut berubah menjadi besar, aku tidak pernah melihat seorang jenius yang beramal serius (gigih) seperti kegigihannya, sehingga orang banyak bisa minum dengan kenyang.\""
            },
            {
                "number": 6169,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ حَدَّثَنِي اللَّيْثُ قَالَ حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي سَعِيدٌ أَنَّ أَبَا هُرَيْرَةَ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي عَلَى قَلِيبٍ وَعَلَيْهَا دَلْوٌ فَنَزَعْتُ مِنْهَا مَا شَاءَ اللَّهُ ثُمَّ أَخَذَهَا ابْنُ أَبِي قُحَافَةَ فَنَزَعَ مِنْهَا ذَنُوبًا أَوْ ذَنُوبَيْنِ وَفِي نَزْعِهِ ضَعْفٌ وَاللَّهُ يَغْفِرُ لَهُ ثُمَّ اسْتَحَالَتْ غَرْبًا فَأَخَذَهَا عُمَرُ بْنُ الْخَطَّابِ فَلَمْ أَرَ عَبْقَرِيًّا مِنْ النَّاسِ يَنْزِعُ نَزْعَ عُمَرَ بْنِ الْخَطَّابِ حَتَّى ضَرَبَ النَّاسُ بِعَطَنٍ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Ufair] telah menceritakan kepadaku [Al Laits] mengatakan, telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab] telah mengabarkan kepadaku [Sa'id], bahwasanya [Abu Hurairah] mengabarinya, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika aku tidur, aku bermimpi berada di sebuah sumur dan diatas ada sebuah ember, maka aku menariknya sekehendak Allah, kemudian Ibnu Abu Quhafah mengambilnya, dan menarik seember atau dua ember, dan dalam tarikannya terlihat ada kelemahan, Allah pun mengampuninya, kemudian embernya berubah menjadi besar, dan Umar bin Khattab mengambil ember, dan tidak pernah aku melihat seorang jenius yang beramal serius (gigih) seperti kegigihan Umar bin Al Khaththab, sehingga orang banyak bisa minum dengan kenyang.\""
            },
            {
                "number": 6170,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ هَمَّامٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَا أَنَا نَائِمٌ رَأَيْتُ أَنِّي عَلَى حَوْضٍ أَسْقِي النَّاسَ فَأَتَانِي أَبُو بَكْرٍ فَأَخَذَ الدَّلْوَ مِنْ يَدِي لِيُرِيحَنِي فَنَزَعَ ذَنُوبَيْنِ وَفِي نَزْعِهِ ضَعْفٌ وَاللَّهُ يَغْفِرُ لَهُ فَأَتَى ابْنُ الْخَطَّابِ فَأَخَذَ مِنْهُ فَلَمْ يَزَلْ يَنْزِعُ حَتَّى تَوَلَّى النَّاسُ وَالْحَوْضُ يَتَفَجَّرُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibarhim] telah menceritakan kepada kami ['Abdurrazaq] dari [Ma'mar] dari [Hammam] bahwasanya ia mendengar [Abu Hurairah] radliallahu 'anhu mengatakan; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika aku tidur, aku melihat diriku diatas telaga memberi minum kepada orang-orang, Abu Bakar mendatangiku dan mengambil ember dariku dengan tujuan agar aku bisa istirahat, ia menarik dua tarikan, dan dalam tarikannya ada kelemahan, Allah pun mengampuninya, lantas Umar bin Khattab datang dan mengambilnya, ia tiada henti menarik ember hingga manusia pulang dan telaga terus memancar.\""
            },
            {
                "number": 6171,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ قَالَبَيْنَا نَحْنُ جُلُوسٌ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي فِي الْجَنَّةِ فَإِذَا امْرَأَةٌ تَتَوَضَّأُ إِلَى جَانِبِ قَصْرٍ قُلْتُ لِمَنْ هَذَا الْقَصْرُ قَالُوا لِعُمَرَ بْنِ الْخَطَّابِ فَذَكَرْتُ غَيْرَتَهُ فَوَلَّيْتُ مُدْبِرًا قَالَ أَبُو هُرَيْرَةَ فَبَكَى عُمَرُ بْنُ الْخَطَّابِ ثُمَّ قَالَ أَعَلَيْكَ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ أَغَارُ",
                "id": "Telah menceritakan kepada kami [Sa'id bin 'Ufair] telah menceritakan kepadaku [Al Laits] telah menceritakan kepada kami ['Uqail] dari [Ibnu Syihab] mengatakan, telah mengabarkan kepadaku [Sa'id bin Musayyab], bahwasanya [Abu Hurairah] menuturkan; ketika kami duduk-duduk di dekat Rasulullah Shallallahu'alaihiwasallam, beliau mengatakan: \"ketika aku tidur, kulihat diriku dalam surga, tiba-tiba ada seorang wanita berwudhu disamping istana. Maka saya bertanya; 'milik siapa istana ini? ' Mereka menjawab; 'Milik Umar bin Khattab! ' maka aku ingat kecemburuannya, sehingga aku berbalik ke belakang.\" Kata Abu Hurairah; maka Umar spontan menangis lalu berujar; 'apakah kepadamu, bapak dan ibuku sebagai tebusanmu ya Rasulullah, aku cemburu? '"
            },
            {
                "number": 6172,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلْتُ الْجَنَّةَ فَإِذَا أَنَا بِقَصْرٍ مِنْ ذَهَبٍ فَقُلْتُ لِمَنْ هَذَا فَقَالُوا لِرَجُلٍ مِنْ قُرَيْشٍ فَمَا مَنَعَنِي أَنْ أَدْخُلَهُ يَا ابْنَ الْخَطَّابِ إِلَّا مَا أَعْلَمُ مِنْ غَيْرَتِكَ قَالَ وَعَلَيْكَ أَغَارُ يَا رَسُولَ اللَّهِ",
                "id": "Telah menceritakan kepada kami ['Amru bin Ali], telah menceritakan kepada kami [Mu'tamir bin Sulaiman] telah menceritakan kepada kami ['ubaidhullah bin Umar] dari [Muhammad bin Al Munkadir] dari [Jabir bin Abdullah] mengatakan; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku masuk surga, tak tahunya aku berada di sebuah istana emas. Maka aku bertanya; 'Milik siapakah ini? ' Mereka menjawab; 'Milik seseorang dari Quraisy, ' dan tiada yang menghalangiku untuk memasukinya Hai Ibnul Khattab selain karena aku tahu kecemburuanmu.\" Maka Umar menjawab; 'apakah terhadapmu aku cemburu ya Rasulullah! '"
            },
            {
                "number": 6173,
                "arab": "حَدَّثَنِي يَحْيَى بْنُ بُكَيْرٍ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ أَبَا هُرَيْرَةَ قَالَبَيْنَمَا نَحْنُ جُلُوسٌ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي فِي الْجَنَّةِ فَإِذَا امْرَأَةٌ تَتَوَضَّأُ إِلَى جَانِبِ قَصْرٍ فَقُلْتُ لِمَنْ هَذَا الْقَصْرُ فَقَالُوا لِعُمَرَ فَذَكَرْتُ غَيْرَتَهُ فَوَلَّيْتُ مُدْبِرًا فَبَكَى عُمَرُ وَقَالَ عَلَيْكَ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ أَغَارُ",
                "id": "Telah menceritakan kepadaku [Yahya bin Bukair], telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab] telah mengabarkan kepadaku [Sa'id bin Musayyab], bahwasanya [Abu Hurairah] menuturkan; ketika kami duduk-duduk di sisi Rasulullah Shallallahu'alaihiwasallam, beliau bercerita: \"Ketika aku tidur, aku melihat diriku dalam sebuah taman, tak tahunya ada seorang wanita yang sedang berwudhu disamping istana. Maka saya bertanya; 'milik siapakah ini? ' Mereka menjawab; 'Milik Umar bin Khattab, ' aku teringat kecemburuannya, maka aku segera berbalik ke belakang.\" Umar spontan menangis dan mengatakan; 'apakah kepadamu, bapak dan ibuku sebagai tebusanmu ya Rasulullah, aku cemburu? '"
            },
            {
                "number": 6174,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَا أَنَا نَائِمٌ رَأَيْتُنِي أَطُوفُ بِالْكَعْبَةِ فَإِذَا رَجُلٌ آدَمُ سَبْطُ الشَّعَرِ بَيْنَ رَجُلَيْنِ يَنْطُفُ رَأْسُهُ مَاءً فَقُلْتُ مَنْ هَذَا قَالُوا ابْنُ مَرْيَمَ فَذَهَبْتُ أَلْتَفِتُ فَإِذَا رَجُلٌ أَحْمَرُ جَسِيمٌ جَعْدُ الرَّأْسِ أَعْوَرُ الْعَيْنِ الْيُمْنَى كَأَنَّ عَيْنَهُ عِنَبَةٌ طَافِيَةٌ قُلْتُ مَنْ هَذَا قَالُوا هَذَا الدَّجَّالُ أَقْرَبُ النَّاسِ بِهِ شَبَهًا ابْنُ قَطَنٍ وَابْنُ قَطَنٍ رَجُلٌ مِنْ بَنِي الْمُصْطَلِقِ مِنْ خُزَاعَةَ",
                "id": "Telah menceritakan kepada kami [Abul Yaman] Telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepadaku [Salim bin Abdullah bin Umar], bahwasanya [Abdullah bin Umar] radliallahu 'anhuma mengatakan, Rasulullah Shallallahu'alaihiwasallam bersabda: \"ketika aku tidur, kulihat diriku thawaf di ka'bah, tiba-tiba ada seseorang yang kulitnya sawo matang, berambut lurus diantara dua orang, kepalanya meneteskan air, maka saya bertanya; 'Siapakah ini? ' Mereka menjawab; 'Ini Isa bin Maryam, ' kemudian aku menoleh, tiba-tiba ada seseorang yang kulitnya merah, berbadan besar, rambut kepalanya keriting, matanya buta sebelah kanan, matanya seolah-olah anggur yang menjorok, maka saya bertanya; 'Siapakah ini? ' Mereka menjawab; 'Ini dajjal, ' manusia yang paling mirip dengannya adalah Ibnu Qathan, \" dan Ibnu Qattan adalah seorang laki-laki dari Bani musthaliq dari Khuza'ah."
            }
        ]
    }
}