{
    "status": true,
    "data": {
        "start": 1177,
        "end": 1323,
        "total": 147,
        "book": "darimi",
        "hadits": [
            {
                "number": 1177,
                "arab": " حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا لَيْثٌ هُوَ ابْنُ سَعْدٍ حَدَّثَنَا يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ عَبْدِ اللَّهِ بْنِ رَاشِدٍ الزَّوْفِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُرَّةَ الزَّوْفِيِّ عَنْ خَارِجَةَ بْنِ حُذَافَةَ الْعَدَوِيِّ قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ اللَّهَ قَدْ أَمَدَّكُمْ بِصَلَاةٍ هِيَ خَيْرٌ لَكُمْ مِنْ حُمْرِ النَّعَمِ جَعَلَهُ لَكُمْ فِيمَا بَيْنَ صَلَاةِ الْعِشَاءِ إِلَى أَنْ يَطْلُعَ الْفَجْرُ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Laits] -yaitu Ibnu Sa'd- telah menceritakan kepada kami [Yazid bin Abu Habib] dari [Abdullah bin Rasyid Az Zaufi] dari [Abdullah bin Abu Murrah] dari [Kharijah bin Hudzafah Al 'Adawi] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam keluar menemui kami seraya bersabda: \"Sesungguhnya Allah telah memberikan kepada kalian sholat yang lebih baik daripada unta merah, Allah menjadikannya untuk kalian berada di antara sholat Isya hingga terbit fajar.\" "
            },
            {
                "number": 1178,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ الْأَنْصَارِيُّ أَنَّ مُحَمَّدَ بْنَ يَحْيَى بْنِ حَبَّانَ أَخْبَرَهُ أَنَّ ابْنَ مُحَيْرِيزٍ الْقُرَشِيَّ ثُمَّ الْجُمَحِيَّ أَخْبَرَهُ وَكَانَ يَسْكُنُ بِالشَّامِ وَكَانَ أَدْرَكَ مُعَاوِيَةَ أَنَّ الْمُخْدَجِيَّ رَجُلٌ مِنْ بَنِي كِنَانَةَ أَخْبَرَهُ أَنَّ رَجُلًا مِنْ أَهْلِ الشَّامِ وَكَانَتْ لَهُ صُحْبَةٌ يُكْنَى أَبَا مُحَمَّدٍ أَخْبَرَهُ أَنَّ الْوِتْرَ وَاجِبٌ فَرَاحَ الْمُخْدَجِيُّ إِلَى عُبَادَةَ بْنِ الصَّامِتِ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ عُبَادَةُ كَذَبَ أَبُو مُحَمَّدٍ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ خَمْسُ صَلَوَاتٍ كَتَبَهُنَّ اللَّهُ عَلَى الْعِبَادِ مَنْ أَتَى بِهِنَّ لَمْ يُضَيِّعْ مِنْ حَقِّهِنَّ شَيْئًا اسْتِخْفَافًا بِحَقِّهِنَّ كَانَ لَهُ عِنْدَ اللَّهِ عَهْدٌ أَنْ يُدْخِلَهُ الْجَنَّةَ وَمَنْ لَمْ يَأْتِ بِهِنَّ جَاءَ وَلَيْسَ لَهُ عِنْدَ اللَّهِ عَهْدٌ إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ أَدْخَلَهُ الْجَنَّةَ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Yahya bin Sa'id Al Anshari] bahwa [Muhammad bin Yahya bin Habban] telah mengabarkan kepadanya, bahwa [Ibnu Muhairiz Al Qurasyi Al Jumahi] -ia tinggal di Syam dan pernah bertemu dengan Mu'awiyah- mengabarkan kepadanya, bahwa [Al Mukhdaji] seorang laki-laki dari Bani Kinanah, mengabarkan kepadanya bahwa seorang laki-laki dari penduduk Syam yang biasa dipanggil Abu Muhammad, dan ia adalah seorang sahabat, telah mengabarkan kepadanya bahwa sholat witir adalah wajib. Kemudian Al Mukhdaji pergi menemui 'Ubadah bin Ash Shamit dan menyebutkan hal tersebut kepadanya, ['Ubadah] lantas berkata, \"Abu Muhammad telah berdusta, aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Lima sholat yang telah Allah wajibkan atas para hamba, barangsiapa melakukannya dan tidak menyia-nyiakan haknya sedikitpun karena sikap meremehkan terhadap haknya, maka baginya janji di sisi Allah untuk memasukkannya ke dalam Surga. Dan barangsiapa tidak melakukannya maka ia datang tidak memiliki janji di sisi Allah, apabila Allah menghendaki maka Dia akan menyiksanya dan apabila Allah menghendaki maka Dia akan memasukkannya ke dalam Surga.\" "
            },
            {
                "number": 1179,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ أَبِي سُهَيْلٍ نَافِعِ بْنِ مَالِكٍ عَنْ أَبِيهِ عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ أَنَّ أَعْرَابِيًّا جَاءَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَائِرَ الرَّأْسِ فَقَالَ يَا رَسُولَ اللَّهِ مَاذَا فَرَضَ اللَّهُ عَلَيَّ مِنْ الصَّلَاةِ قَالَ الصَّلَوَاتِ الْخَمْسَ وَالصِّيَامَ فَأَخْبَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَرَائِعِ الْإِسْلَامِ فَقَالَ وَالَّذِي أَكْرَمَكَ لَا أَتَطَوَّعُ شَيْئًا وَلَا أَنْقُصُ مِمَّا فَرَضَ اللَّهُ عَلَيَّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْلَحَ وَأَبِيهِ إِنْ صَدَقَ أَوْ دَخَلَ الْجَنَّةَ وَأَبِيهِ إِنْ صَدَقَ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Abu Suhail Nafi' bin Malik] dari [Ayahnya] dari [Thalhah bin 'ubaidhullah], bahwa seorang Arab badui datang kepada Rasulullah shallallahu 'alaihi wasallam dengan rambut acak-acakan, ia lalu berkata, \"Wahai Rasulullah, sholat apakah yang telah Allah wajibkan kepadaku? Beliau bersabda: \"sholat lima waktu, dan berpuasa.\" Kemudian Rasulullah shallallahu 'alaihi wasallam mengabarkan kepadanya mengenai syari'at-syari'at Islam. Lalu orang tersebut berkata, \"Demi Dzat yang telah memuliakanmu, aku tidak akan melakukan perkara sunah sedikitpun, dan tidak akan mengurangi apa yang telah Allah wajibkan atas diriku.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ia beruntung apabila berkata benar.\" Atau \"Ia akan masuk Surga apabila berkata benar.\""
            },
            {
                "number": 1180,
                "arab": " حَدَّثَنَا عَفَّانُ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَالَ سَمِعْتُ عَاصِمَ بْنَ ضَمْرَةَ قَالَ سَمِعْتُ عَلِيًّا يَقُولُ إِنَّ الْوِتْرَ لَيْسَ بِحَتْمٍ كَالصَّلَاةِ وَلَكِنَّهُ سُنَّةٌ فَلَا تَدَعُوهُ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] ia berkata, saya mendengar ['Ashim bin Dlamrah] ia berkata, saya mendengar [Ali] berkata, \"Sesungguhnya witir tidaklah wajib seperti sholat, ia adalah sunnah, maka janganlah kalian meninggalkannya.\" "
            },
            {
                "number": 1181,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى عَنْ هِقْلِ بْنِ زِيَادٍ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ وِتْرٌ يُحِبُّ الْوِتْرَ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Musa] dari [Hiql bin Ziyad] dari [Hisyam] dari [Ibnu Sirin dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya Allah adalah ganjil dan menyukai witir (sholat ganjil).\""
            },
            {
                "number": 1182,
                "arab": " أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَتْ صَلَاتُهُ مِنْ اللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً يُوتِرُ مِنْهَا بِخَمْسٍ لَا يَجْلِسُ فِي شَيْءٍ مِنْ الْخَمْسِ حَتَّى يَجْلِسَ فِي الْآخِرَةِ فَيُسَلِّمَ",
                "id": "Telah mengabarkan kepada kami [Ja'far bin 'Aun] telah menceritakan kepada kami [Hisyam] dari [Ayahnya] dari [Aisyah], bahwa sholat Rasulullah shallallahu 'alaihi wasallam pada waktu malam adalah tiga belas rakaat, lima rakaat darinya adalah witir, dan pada lima rakaat tersebut beliau tidak duduk kecuali pada rakaat terakhir.\" "
            },
            {
                "number": 1183,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا سُفْيَانُ بْنُ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْتِرْ بِخَمْسٍ فَإِنْ لَمْ تَسْتَطِعْ فَبِثَلَاثٍ فَإِنْ لَمْ تَسْتَطِعْ فَبِوَاحِدَةٍ فَإِنْ لَمْ تَسْتَطِعْ فَأَوْمِ إِيمَاءً أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Sufyan bin Husain] dari [Az Zuhri] dari ['Atha` bin Yazid Al Laitsi] dari [Abu Ayyub Al Anshari] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam berkata kepadaku: \"Lakukan sholat Witir dengan lima rakaat, apabila engkau tidak mampu maka dengan tiga rakaat, dan apabila engkau tidak mampu maka dengan satu rakaat, dan apabila engkau tidak mampu maka lakukan dengan memberi isyarat.\" Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Al Auza'i] dari [Az Zuhri] dari ['Atha` bin Yazid Al Laits] dari [Abu Ayyub Al Anshari] dari Nabi shallallahu 'alaihi wasallam seperti itu.\" "
            },
            {
                "number": 1184,
                "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ سَأَلَ رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ فَقَالَ مَثْنَى مَثْنَى فَإِذَا خَشِيَ أَحَدُكُمْ الصُّبْحَ فَلْيُصَلِّ رَكْعَةً وَاحِدَةً تُوتِرُ مَا قَدْ صَلَّى قِيلَ لِأَبِي مُحَمَّدٍ تَأْخُذُ بِهِ قَالَ نَعَمْ",
                "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Seseorang bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai sholat malam, kemudian beliau bersabda: \"Dua rakaat, dua rakaat. Jika salah seorang dari kalian kawatir dengan datangnya waktu subuh, maka hendaklah ia sholat satu rakaat sebagai witir dari sholat yang telah ia kerjakan.\" Abu Muhammad ditanya, \"Apakah engkau berpendapat dengannya?\" Ia menjawab, \"Ya.\" "
            },
            {
                "number": 1185,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مَا بَيْنَ الْعِشَاءِ إِلَى الْفَجْرِ إِحْدَى عَشْرَةَ رَكْعَةً يُسَلِّمُ فِي كُلِّ رَكْعَتَيْنِ وَيُوتِرُ بِوَاحِدَةٍ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] dari [Ibnu Abu Dzi`b] dari [Az Zuhri] dari ['Urwah] dari [Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melakukan sholat antara Isya dan Subuh sebanyak sebelas rakaat. Beliau mengucapkan salam pada setiap dua rakaat dan melakukan witir dengan satu rakaat.\" "
            },
            {
                "number": 1186,
                "arab": " أَخْبَرَنَا مَالِكُ بْنُ إِسْمَعِيلَ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ بِثَلَاثٍ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ",
                "id": "Telah mengabarkan kepada kami [Malik bin Isma'il] telah menceritakan kepada kami [Israil] dari [Abu Ishaq] dari [Sa'id? bin Jubair] dari [Ibnu Abbas] ia berkata, \"Nabi shallallahu 'alaihi wasallam sholat Witir tiga rakaat dengan membaca SABBIHISMA RABBIKAL A'LAA (Al A'laa) dan QUL YAA AYYUHAL KAAFIRUUN (surat Al Kaafiruun), serta QUL HUWALLAAHU AHAD (surat Al Ikhlash).\" "
            },
            {
                "number": 1187,
                "arab": " أَخْبَرَنَا قَبِيصَةُ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي حَصِينٍ عَنْ يَحْيَى بْنِ وَثَّابٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْ فِي كُلِّ الْوَقْتِ قَدْ أَوْتَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَانْتَهَى وِتْرُهُ إِلَى السَّحَرِ",
                "id": "Telah mengabarkan kepada kami [Qabishah] telah menceritakan kepada kami [Sufyan] dari [Abu Hashin] dari [Yahya bin Watstsab] dari [Masruq] dari [Aisyah] ia berkata, \"Pada setiap waktu Rasulullah shallallahu 'alaihi wasallam telah melakukan witir, dan witir beliau berhenti hingga waktu sahur.\" "
            },
            {
                "number": 1188,
                "arab": " حَدَّثَنَا عَفَّانُ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ الْعَطَّارُ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنِي أَبُو نَضْرَةَ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الْوِتْرِ فَقَالَ أَوْتِرُوا قَبْلَ الْفَجْرِ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Aban bin Yazid Al 'Aththar] telah menceritakan kepadaku [Yahya bin Abu Katsir] telah menceritakan kepadaku [Abu Nadlrah] bahwa [Abu Sa'id Al Khudri] telah menceritakan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam ditanya mengenai sholat Witir, kemudian beliau bersabda: \"Lakukanlah witir sebelum sholat Subuh.\""
            },
            {
                "number": 1189,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ زَكَرِيَّاءُ حَدَّثَنِي عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ بِثَلَاثٍ يَقْرَأُ فِي الْأُولَى بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَفِي الثَّانِيَةِ بِقُلْ يَا أَيُّهَا الْكَافِرُونَ وَفِي الثَّالِثَةِ بِقُلْ هُوَ اللَّهُ أَحَدٌ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abu Usamah] ia berkata, [Zakaria] telah menceritakan kepadaku dari [Abu Ishaq] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata, \"Nabi shallallahu 'alaihi wasallam melakukan witir dengan tiga rakaat, pada rakaat pertama beliau membaca SABBIHISMA RABBIKAL A'LAA (surat Al A'laa), pada rakaat kedua dengan QUL YAA AYYUHAL KAAFIRUUN (surat Al Kaafiruun), dan pada rakaat ketiga dengan QUL HUWALLAAHU AHAD (surat Al Ikhlas).\" "
            },
            {
                "number": 1190,
                "arab": " أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا مَالِكٌ حَدَّثَنِي أَبُو بَكْرِ بْنُ عُمَرَ عَنْ سَعِيدِ بْنِ يَسَارٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ عَلَى الْبَعِيرِ قِيلَ لِأَبِي مُحَمَّدٍ تَقُولُ بِهِ قَالَ نَعَمْ",
                "id": "Telah mengabarkan kepada kami [Marwan bin Muhammad] telah menceritakan kepada kami [Malik] telah menceritakan kepadaku [Abu Bakr] dari [Sa'id bin Yasar] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam pernah melakukan witir di atas unta.\" Abu Muhammad ditanya, \"Apakah engkau berpendapat dengannya?\" Ia menjawab, \"Ya.\" "
            },
            {
                "number": 1191,
                "arab": " حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَبِي الْحَوْرَاءِ السَّعْدِيِّ قَالَ قُلْتُ لِلْحَسَنِ بْنِ عَلِيٍّ مَا تَذْكُرُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حَمَلَنِي عَلَى عَاتِقِهِ فَأَخَذْتُ تَمْرَةً مِنْ تَمْرِ الصَّدَقَةِ فَأَدْخَلْتُهَا فِي فَمِي فَقَالَ أَلْقِهَا أَمَا شَعَرْتَ أَنَّا لَا تَحِلُّ لَنَا الصَّدَقَةُ قَالَ وَكَانَ يَدْعُو بِهَذَا الدُّعَاءِ اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ وَعَافِنِي فِيمَنْ عَافَيْتَ وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ وَبَارِكْ لِي فِيمَا أَعْطَيْتَ وَقِنِي شَرَّ مَا قَضَيْتَ إِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ وَإِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ تَبَارَكْتَ وَتَعَالَيْتَ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَبِي الْحَوْرَاءِ عَنْ الْحَسَنِ بْنِ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ عَلَّمَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَلِمَاتٍ أَقُولُهُنَّ فِي الْقُنُوتِ فِي الْوِتْرِ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Buraid bin Abu Maryam] dari [Abu Al Haura` As Sa'di] ia berkata, \"Aku katakan kepada [Al Hasan bin Ali], \"Apa yang engkau ingat dari Rasulullah shallallahu 'alaihi wasallam?\" Ia berkata, \"Beliau menggendongku di atas pundaknya, kemudian aku mengambil satu buah kurma zakat. Aku lalu masukkannya ke dalam mulutku sehingga beliau pun bersabda: \"Buanglah kurma tersebut, tidakkah engkau merasa bahwa zakat tidak halal bagi kita?\" Dan dahulu beliau berdoa dengan doa ini: \"ALLAAHUMMAHDINII FIIMAN HADAIT, WA 'AAFINII FIIMAN 'AAFAIT, WA TAWALLANII FIIMAN TAWALLAIT, WA BAARIK LII FIIMAA A'THAIT, WA QINII SYARRA MAA QADLAIT, INNAKA TAQDLII WA LAA YUQDLAA 'ALAIK, WA INNAHUU LAA YADZILLU MAN WAALAIT. TABAARAKTA WA TA'AALAIT (Ya Allah, berilah aku petunjuk di antara orang-orang yang Engkau beri petunjuk, dan selamatkanlah aku di antara orang-orang yang Engkau beri keselamatan, uruslah aku di antara orang-orang yang Engkau urus, berkahilah untukku apa yang telah Engkau berikan kepadaku, dan lindungilah aku dari keburukan apa yang telah Engkau putuskan. Sesungguhnya Engkau memutuskan dan tidak diberi keputusan, sesungguhnya tidak akan hina orang yang Engkau tolong dan, Maha Suci Engkau dan Maha Tinggi).\" Telah mengabarkan kepada kami ['ubaidhullah bin Musa] dari [Israil] dari [Abu Ishaq] dari [Buraid bin Abu Maryam] dari [Abu Al Haura`] dari [Al Hasan bin Ali radliallahu 'anhu] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengajarkan kepadaku beberapa kalimat yang aku ucapkan ketika qunut pada sholat Witir… kemudian ia menyebutkan seperti itu.\""
            },
            {
                "number": 1192,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ قَالَ حَدَّثَنِي أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَبِي الْحَوْرَاءِ السَّعْدِيِّ عَنْ الْحَسَنِ بْنِ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ عَلَّمَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَلِمَاتٍ أَقُولُهُنَّ فِي قُنُوتِ الْوِتْرِ اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ وَعَافِنِي فِيمَنْ عَافَيْتَ وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ وَبَارِكْ لِي فِيمَا أَعْطَيْتَ وَقِنِي شَرَّ مَا قَضَيْتَ فَإِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ وَإِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ تَبَارَكْتَ وَتَعَالَيْتَ قَالَ أَبُو مُحَمَّد أَبُو الْحَوْرَاءِ اسْمُهُ رَبِيعَةُ بْنُ شَيْبَانَ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] ia berkata, telah menceritakan kepadaku [Abu Al Ahwash] dari [Abu Ishaq] dari [Buraid bin Abu Maryam] dari [Abu Al Haura` As Sa'di] dari [Al Hasan bin Ali radliallahu 'anhu] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengajariku beberapa kalimat yang aku ucapkan ketika qunut witir, yaitu: \"ALLAAHUMMAHDINII FIIMAN HADAIT, WA 'AAFINII FIIMAN 'AAFAIT, WA TAWALLANII FIIMAN TAWALLAIT, WA BAARIK LII FIIMAA A'THAIT, WA QINII SYARRA MAA QADLAIT, INNAKA TAQDLII WA LAA YUQDLAA 'ALAIK, WA INNAHUU LAA YADZILLU MAN WAALAIT. TABAARAKTA WA TA'AALAIT (Ya Allah, berilah aku petunjuk di antara orang-orang yang Engkau beri petunjuk, dan selamatkanlah aku di antara orang-orang yang Engkau beri keselamatan, uruslah aku di antara orang-orang yang Engkau urus, berkahilah untukku apa yang telah Engkau berikan kepadaku, dan lindungilah aku dari keburukan apa yang telah Engkau putuskan. Sesungguhnya Engkau memutuskan dan tidak diberi keputusan, sesungguhnya tidak akan hina orang yang Engkau tolong dan, Maha Suci Engkau dan Maha Tinggi).\" Abu Muhammad berkata, \"Abu Al Haura` namanya adalah Rabi'ah bin Syaiban.\" "
            },
            {
                "number": 1193,
                "arab": "أَخْبَرَنَا مَرْوَانُ عَنْ عَبْدِ اللَّهِ بْنِ وَهْبٍ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ شُرَيْحِ بْنِ عُبَيْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ عَنْ ثَوْبَانَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ هَذَا السَّهَرَ جَهْدٌ وَثِقَلٌ فَإِذَا أَوْتَرَ أَحَدُكُمْ فَلْيَرْكَعْ رَكْعَتَيْنِ فَإِنْ قَامَ مِنْ اللَّيْلِ وَإِلَّا كَانَتَا لَهُ",
                "id": "Telah mengabarkan kepada kami [Marwan] dari [Abdullah bin Wahb] dari [Mu'awiyah bin Shalih] dari [Syuraih bin 'Ubaid] dari [Abdurrahman bin Jubair bin Nufair] dari [Ayahnya] dari [Tsauban] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya begadang (dalam mentaati Allah) ini sulit dan berat, jika salah seorang di antara kalian melakukan witir, maka hendaknya ia melakukan sholat dua rakaat jika terbangun di malam hari, jika tidak maka kedua rakaat tersebut adalah untuknya.\""
            },
            {
                "number": 1194,
                "arab": " حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ ابْنِ الْمُسَيَّبِ وَأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يَدْعُوَ عَلَى أَحَدٍ أَوْ يَدْعُوَ لِأَحَدٍ قَنَتَ بَعْدَ الرُّكُوعِ فَرُبَّمَا قَالَ إِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ اللَّهُمَّ أَنْجِ الْوَلِيدَ بْنَ الْوَلِيدِ وَسَلَمَةَ بْنَ هِشَامٍ وَعَيَّاشَ بْنَ أَبِي رَبِيعَةَ وَالْمُسْتَضْعَفِينَ مِنْ الْمُؤْمِنِينَ اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ وَاجْعَلْهَا سِنِينَ كَسِنِي يُوسُفَ وَيَجْهَرُ بِذَلِكَ يَقُولُ فِي بَعْضِ صَلَاتِهِ فِي صَلَاةِ الْفَجْرِ اللَّهُمَّ الْعَنْ فُلَانًا وَفُلَانًا لِحَيَّيْنِ مِنْ أَحْيَاءِ الْعَرَبِ فَأَنْزَلَ اللَّهُ تَعَالَى { لَيْسَ لَكَ مِنْ الْأَمْرِ شَيْءٌ أَوْ يَتُوبَ عَلَيْهِمْ أَوْ يُعَذِّبَهُمْ فَإِنَّهُمْ ظَالِمُونَ }",
                "id": "Telah menceritakan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Az Zuhri] dari [Ibnu Al Musayyab] dan [Abu Salamah bin Abdurrahman] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam jika ingin mendoakan keburukan atas seseorang atau mendoakan kebaikan untuk seseorang, maka beliau melakukan qunut setelah rukuk. Barangkali setelah mengucapkan SAMI'ALLAAHU LIMAN HAMIDAH, RABBANAA WA LAKAL HAMDU (Semoga Allah mendengar pujian orang yang memuji-Nya. Ya Rabb kami, kepada-Mu lah segala pujian), beliau berdoa: \"Ya Allah, selamatkan Al Walid bin Al Walid, Salamah bin Hisyam, 'Ayyasy bin Abu Rabi'ah dan orang-orang Mukmin yang lemah. Ya Allah, keraskan siksa-Mu atas Mudlar, timpakahlah kepada mereka masa paceklik sebagaimana paceklik pada masa Yusuf.\" Beliau mengeraskan doa tersebut. Dan beliau mengucapkan pada sebagian sholatnya; sholat subuh: \"Ya Allah, laknatlah Fulan dan Fulan.\" Beliau menyebutkan dua kampung dari kampung-kampung Arab. Kemudian Allah Ta'ala menurunkan ayat: '(Tak ada sedikitpun campur tanganmu dalam urusan mereka itu atau Allah menerima taubat mereka, atau mengazab mereka karena sesungguhnya mereka itu orang-orang yang zalim) ' (Qs. Ali Imran: 128)."
            },
            {
                "number": 1195,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ حَدَّثَنَا عَاصِمٌ قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنْ الْقُنُوتِ فَقَالَ قَبْلَ الرُّكُوعِ قَالَ فَقُلْتُ إِنَّ فُلَانًا زَعَمَ أَنَّكَ قُلْتَ بَعْدَ الرُّكُوعِ قَالَ كَذَبَ ثُمَّ حَدَّثَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَنَتَ شَهْرًا بَعْدَ الرُّكُوعِ يَدْعُو عَلَى حَيٍّ مِنْ بَنِي سُلَيْمٍ",
                "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Tsabit bin Yazid] telah menceritakan kepada kami ['Ashim] ia berkata, aku bertanya kepada [Anas bin Malik] mengenai Qunut, kemudian ia menjawab, \"Sebelum rukuk.\" 'Ashim berkata, \"Kemudian aku katakan, \"Sesungguhnya Fulan mengaku bahwa engkau mengatakan setelah rukuk?\" Anas menjawab, \"Ia berdusta! \" Kemudian Anas menceritakan bahwa Nabi shallallahu 'alaihi wasallam melakukan qunut selama sebulan setelah rukuk, mendoakan kecelakaan atas sebuah kampung dari Bani Sulaim.\" "
            },
            {
                "number": 1196,
                "arab": " حَدَّثَنَا أَبُو الْوَلِيدِ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ بْنِ عَازِبٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْنُتُ فِي الصُّبْحِ حَدَّثَنَا أَبُو نُعَيْمٍ عَنْ شُعْبَةَ بِإِسْنَادِهِ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Syu'bah] dari ['Amru bin Murrah] dari [Ibnu Abu Laila] dari [Al Bara` bin 'Azib], bahwa Nabi shallallahu 'alaihi wasallam melakukan qunut pada sholat Subuh.\" Telah menceritakan kepada kami [Abu Nu'aim] dari [Syu'bah] dengan sanadnya seperti itu.\" "
            },
            {
                "number": 1197,
                "arab": " حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ قَالَ سُئِلَ أَنَسُ بْنُ مَالِكٍ أَقَنَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ الصُّبْحِ قَالَ نَعَمْ فَقِيلَ لَهُ أَوَ قُلْتَ لَهُ قَبْلَ الرُّكُوعِ أَوْ بَعْدَ الرُّكُوعِ قَالَ بَعْدَ الرُّكُوعِ يَسِيرًا قَالَ أَبُو مُحَمَّد أَقُولُ بِهِ وَآخُذُ بِهِ وَلَا أَرَى أَنْ آخُذَ بِهِ إِلَّا فِي الْحَرْبِ",
                "id": "Telah menceritakan kepada kami [Musadddad] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Muhammad] ia berkata, [Anas bin Malik] ditanya, \"Apakah Rasulullah shallallahu 'alaihi wasallam melakukan qunut saat sholat subuh?\" Ia menjawab, \"Ya.\" Kemudian ia ditanya, \"Apakah engkau mengatakan kepadanya sebelum rukuk atau setelah rukuk?\" Anas menjawab, \"Sesaat setelah rukuk.\" Abu Muhammad berkata, \"Aku berpendapat dan beramal dengannya, namun aku tidak mengamalkannya kecuali saat perang.\" "
            },
            {
                "number": 1198,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا عُقْبَةُ بْنُ الْأَصَمِّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَطْعَمُ يَوْمَ الْفِطْرِ قَبْلَ أَنْ يَخْرُجَ وَكَانَ إِذَا كَانَ يَوْمُ النَّحْرِ لَمْ يَطْعَمْ حَتَّى يَرْجِعَ فَيَأْكُلَ مِنْ ذَبِيحَتِهِ حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا هُشَيْمٌ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ حَفْصِ بْنِ عُبَيْدِ اللَّهِ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami ['Uqbah bin Al Asham] telah menceritakan kepada kami [Abdullah bin Buraidah] dari [Ayahnya], bahwa Rasulullah shallallahu 'alaihi wasallam pada hari ?dul fitri makan sebelum keluar (sholat), sedangkan pada hari ?dul adha beliau tidak makan kecuali setelah kembali dari sholat, dan beliau makan dengan daging sembelihannya.\" Telah menceritakan kepada kami ['Amru bin 'Aun] telah menceritakan kepada kami [Husyaim] dari [Muhammad bin Ishaq] dari [Hafsh bin 'ubaidhullah] dari [Anas] dari Nabi shallallahu 'alaihi wasallam dengan hadits seperti itu.\" "
            },
            {
                "number": 1199,
                "arab": " أَخْبَرَنَا يَعْلَى حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَ شَهِدْتُ الصَّلَاةَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي يَوْمِ عِيدٍ فَبَدَأَ بِالصَّلَاةِ قَبْلَ الْخُطْبَةِ بِغَيْرِ أَذَانٍ وَلَا إِقَامَةٍ",
                "id": "Telah mengabarkan kepada kami [Ya'la] telah menceritakan kepada kami [Abdul Malik] dari ['Atha`] dari [Jabir] ia berkata, \"Pada hari raya Id aku menghadiri sholat bersama Rasulullah shallallahu 'alaihi wasallam, beliau memulai sholat sebelum khutbah, tanpa adzan dan iqamah.\" "
            },
            {
                "number": 1200,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنِي ابْنُ عُيَيْنَةَ حَدَّثَنِي أَيُّوبُ السَّخْتِيَانِيُّ قَالَ سَمِعْتُ عَطَاءً يَقُولُ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ أَشْهَدُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ بَدَأَ بِالصَّلَاةِ قَبْلَ الْخُطْبَةِ يَوْمَ الْعِيدِ ثُمَّ خَطَبَ فَرَأَى أَنَّهُ لَمْ يُسْمِعْ النِّسَاءَ فَأَتَاهُنَّ فَذَكَّرَهُنَّ وَوَعَظَهُنَّ وَأَمَرَهُنَّ أَنْ يَتَصَدَّقْنَ وَبِلَالٌ قَابِضٌ بِثَوْبِهِ فَجَعَلَتْ الْمَرْأَةُ تَجِيءُ بِالْخُرْصِ وَالشَّيْءِ ثُمَّ تُلْقِيهِ فِي ثَوْبِ بِلَالٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepadaku [Ibnu 'Uyainah] telah menceritakan kepadaku [Ayyub As Sakhtiyani] ia berkata, aku mendengar ['Atha`] berkata, aku mendengar [Ibnu Abbas] berkata, \"Aku bersaksi atas Rasulullah shallallahu 'alaihi wasallam bahwa pada hari Id beliau memulai sholat sebelum khutbah, baru kemudian beliau berkhutbah. Setelah itu beliau merasa bahwa kaum wanita tidak bisa mendengarkan khutbahnya, maka beliau pun datang menemui mereka, beliau mengingatkan mereka, memberi nasehat dan memerintah agar mereka bersedekah. Sementara Bilal membawa kainnya, lalu seorang wanita datang dengan membawa anting dan sesuatu yang lain, untuk kemudian melemparkannya ke dalam kain yang di bawa oleh Bilal.\" "
            },
            {
                "number": 1201,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنَا الْحَسَنُ بْنُ مُسْلِمٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ شَهِدْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ وَعُثْمَانَ يُصَلُّونَ قَبْلَ الْخُطْبَةِ فِي الْعِيدِ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] telah mengabarkan kepada kami [Al Hasan bin Muslim] dari [Thawus] dari [Ibnu Abbas] ia berkata, \"Aku menyaksikan Nabi shallallahu 'alaihi wasallam, Abu Bakr, Umar dan Utsman melakukan sholat sebelum khutbah pada hari raya.\" "
            },
            {
                "number": 1202,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ حَدَّثَنِي عَدِيُّ بْنُ ثَابِتٍ قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ يُحَدِّثُ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يَوْمَ الْفِطْرِ فَصَلَّى رَكْعَتَيْنِ وَلَمْ يُصَلِّ قَبْلَهَا وَلَا بَعْدَهَا قِيلَ لِأَبِي مُحَمَّدٍ تَقُولُ بِهَذَا قَالَ لِي وَأَوْمَأَ إِي نَعَمْ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepadaku [Adi bin Tsabit] ia berkata, saya mendengar [Sa'id? bin Jubair] menceritakan dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam keluar pada hari Idul fitri, lalu beliau sholat dua rakaat dan tidak mengerjakan sholat baik sebelum atau sesudahnya.\" Abu Muhammad ditanya, \"Apakah engkau berpendapat dengan hal ini?\" Ia lalu berkata kepadaku dengan memberikan isyarat, yakni, \"Ya.\" "
            },
            {
                "number": 1203,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ الْحَجَّاجِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ الْمُؤَذِّنِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَمَّارٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَبِّرُ فِي الْعِيدَيْنِ فِي الْأُولَى سَبْعًا وَفِي الْأُخْرَى خَمْسًا وَكَانَ يَبْدَأُ بِالصَّلَاةِ قَبْلَ الْخُطْبَةِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Al Hajjaj] dari [Abdurrahman bin Sa'd bin 'Ammar bin Sa'd Al Muadzdzin] dari [Abdullah bin Muhammad bin 'Ammar] dari [Ayahnya] dari [Kakeknya] ia berkata, \"Nabi shallallahu 'alaihi wasallam bertakbir pada dua sholat Id, pada rakaat pertama tujuh kali dan pada rakaat kedua lima kali. Dan beliau memulai dengan sholat sebelum khutbah.\" "
            },
            {
                "number": 1204,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْعِيدَيْنِ وَالْجُمُعَةِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ وَرُبَّمَا اجْتَمَعَا فَقَرَأَ بِهِمَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin Muhammad bin Al Muntasyir] dari [Ayahnya] dari [Habib bin Salim] dari [An Nu'man bin Basyir] ia berkata, \"Nabi shallallahu 'alaihi wasallam membaca pada sholat dua hari raya dan sholat Jum'at dengan SABBIHISMA RABBIKAL A'LAA (surat Al A'laa) dan HAL ATAAKA HADIITSUL GHAASYIYAH (surat Al Ghaasyiyah). Jika keduanya bertemu dalam satu hari maka beliau juga membaca kedua surat tersebut.\""
            },
            {
                "number": 1205,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سَلَمَةُ يَعْنِي ابْنَ نُبَيْطٍ حَدَّثَنِي أَبِي أَوْ نُعَيْمُ بْنُ أَبِي هِنْدٍ عَنْ أَبِي قَالَ حَجَجْتُ مَعَ أَبِي وَعَمِّي فَقَالَ لِي أَبِي تَرَى ذَلِكَ صَاحِبَ الْجَمَلِ الْأَحْمَرِ الَّذِي يَخْطُبُ ذَلِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Salamah] -yaitu Ibnu Nubaith- telah menceritakan kepadaku Ayahku, atau [Nu'aim bin Abu Hindun] dari [Ayahku] ia berkata, \"Aku berhaji bersama ayahku dan pamanku, kemudian bapakku berkata kepadaku, \"Apakah engkau melihat pemilik unta merah yang sedang berkhutbah itu? Itu adalah Rasulullah shallallahu 'alaihi wasallam.\" "
            },
            {
                "number": 1206,
                "arab": " أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُوسَى حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ عَنْ هِشَامٍ عَنْ حَفْصَةَ عَنْ أُمِّ عَطِيَّةَ قَالَتْ أَمَرَنَا بِأَبِي هُوَ أَنْ نُخْرِجَ يَوْمَ الْفِطْرِ وَيَوْمَ النَّحْرِ الْعَوَاتِقَ وَذَوَاتِ الْخُدُورِ فَأَمَّا الْحُيَّضُ فَإِنَّهُنَّ يَعْتَزِلْنَ الصَّفَّ وَيَشْهَدْنَ الْخَيْرَ وَدَعْوَةَ الْمُسْلِمِينَ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ فَإِنْ لَمْ يَكُنْ لِإِحْدَاهُنَّ الْجِلْبَابُ قَالَ تُلْبِسُهَا أُخْتُهَا مِنْ جِلْبَابِهَا",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Musa] telah menceritakan kepada kami [Abdul Aziz bin Abdush Shamad] dari [Hisyam] dari [Hafshah] dari [Ummu 'Athiyyah] ia berkata, \"Demi bapakku! Sungguh beliau memerintahkan kami agar pada Idul fitri dan hari Raya Kurban mengeluarkan anak-anak wanita yang baru baligh serta para remaja puteri, adapun para wanita yang sedang haid maka mereka menjauhi shaf dan mereka menyaksikan kebaikan serta doa orang-orang Muslim.\" Ummu Athiyyah berkata, \"Aku lalu bertanya, \"Wahai Rasulullah, bagaimana jika salah seorang di antara mereka tidak memiliki Jilbab?\" Beliau menjawab: \"Hendaklah saudara perempuannya memakaikannya dari jilbab miliknya.\""
            },
            {
                "number": 1207,
                "arab": " أَخْبَرَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَ شَهِدْتُ الصَّلَاةَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي يَوْمِ عِيدٍ فَبَدَأَ بِالصَّلَاةِ قَبْلَ الْخُطْبَةِ ثُمَّ قَامَ مُتَوَكِّئًا عَلَى بِلَالٍ حَتَّى أَتَى النِّسَاءَ فَوَعَظَهُنَّ وَذَكَّرَهُنَّ وَأَمَرَهُنَّ بِتَقْوَى اللَّهِ قَالَ تَصَدَّقْنَ فَذَكَرَ شَيْئًا مِنْ أَمْرِ جَهَنَّمَ فَقَامَتْ امْرَأَةٌ مِنْ سَفِلَةِ النِّسَاءِ سَفْعَاءُ الْخَدَّيْنِ فَقَالَتْ لِمَ يَا رَسُولَ اللَّهِ قَالَ لِأَنَّكُنَّ تُفْشِينَ الشَّكَاءَ وَاللَّعْنَ وَتَكْفُرْنَ الْعَشِيرَ فَجَعَلْنَ يَأْخُذْنَ مِنْ حُلِيِّهِنَّ وَأَقْرَاطِهِنَّ وَخَوَاتِيمِهِنَّ يَطْرَحْنَهُ فِي ثَوْبِ بِلَالٍ يَتَصَدَّقْنَ بِهِ أَخْبَرَنَا أَبُو الْوَلِيدِ حَدَّثَنَا شُعْبَةُ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذَا",
                "id": "Telah mengabarkan kepada kami [Ya'la bin 'Ubaid] telah menceritakan kepada kami [Abdul Malik] dari ['Atha`] dari [Jabir] ia berkata, \"Pada hari Id aku pernah sholat bersama Rasulullah shallallahu 'alaihi wasallam, beliau memulainya dengan sholat sebelum khutbah. Beliau kemudian berdiri dengan bersandar pada Bilal, hingga beliau datang kepada para wanita dan memberi nasehat mereka serta mengingatkan dan memerintahkan agar mereka bertaqwa kepada Allah. Beliau bersabda: \"Bersedekahlah.\" Kemudian beliau menyebutkan sebagian perkara Jahannam. Maka berdirilah seorang wanita dari tengah-tengah mereka yang kedua pipinya kehitam-hitaman. Wanita itu lalu berkata, \"Kenapa wahai Rasulullah? Beliau menjawab: \"Karena kalian banyak mengeluh, banyak melaknat, dan suka ingkar kepada suami.\" Kemudian mereka mengambil sebagian dari perhiasan, anting dan cincin mereka lalu melemparkannya ke dalam kain yang dibawa oleh Bilal sebagai sedekah.\" Telah mengabarkan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Syu'bah] dari [Adi bin Tsabit] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam seperti ini.\" "
            },
            {
                "number": 1208,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ عُثْمَانَ بْنِ الْمُغِيرَةِ عَنْ إِيَاسِ بْنِ أَبِي رَمْلَةَ قَالَ شَهِدْتُ مُعَاوِيَةَ يَسْأَلُ زَيْدَ بْنَ أَرْقَمَ أَشَهِدْتَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِيدَيْنِ اجْتَمَعَا فِي يَوْمٍ قَالَ نَعَمْ قَالَ فَكَيْفَ صَنَعَ قَالَ صَلَّى الْعِيدَ ثُمَّ رَخَّصَ فِي الْجُمُعَةِ فَقَالَ مَنْ شَاءَ أَنْ يُصَلِّيَ فَلْيُصَلِّ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Musa] dari [Israil] dari [Utsman bin Al Mughirah] dari [Iyas bin Abu Ramlah] ia berkata, aku menyaksikan Mu'awiyah bertanya kepada [Zaid bin Arqam], \"Apakah engkau pernah menyaksikan bersama Nabi shallallahu 'alaihi wasallam dua hari raya berkumpul dalam satu hari?\" Zaid menjawab, \"Ya.\" Mu'awiyah bertanya lagi, \"Apa yang beliau lakukan?\" Zaid menjawab, \"Beliau laksanakan sholat Id, lalu memberi keringanan dalam pelaksanakaan sholat jum'at.\" Beliau bersabda: \"Barangsiapa ingin melakukan sholat Jum'at, maka silahkan ia melakukannya! \""
            },
            {
                "number": 1209,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الصَّلْتِ حَدَّثَنَا فُلَيْحٌ عَنْ سَعِيدِ بْنِ الْحَارِثِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ إِلَى الْعِيدِ رَجَعَ فِي طَرِيقٍ آخَرَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ash Shalt] telah menceritakan kepada kami [Fulaih] dari [Sa'id bin Al Harits] dari [Abu Hurairah], bahwa Nabi shallallahu 'alaihi wasallam jika keluar untuk sholat Is, maka beliau akan kembali melalui jalan yang lain.\""
            },
            {
                "number": 1210,
                "arab": " حَدَّثَنَا أَبُو عَاصِمٍ عَنْ زَكَرِيَّا بْنِ إِسْحَقَ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ عَنْ أَبِي مَعْبَدٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا بَعَثَ مُعَاذًا إِلَى الْيَمَنِ قَالَ إِنَّكَ تَأْتِي قَوْمًا أَهْلَ كِتَابٍ فَادْعُهُمْ إِلَى أَنْ يَشْهَدُوا أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ فَإِنْ أَطَاعُوا لَكَ فِي ذَلِكَ فَأَخْبِرْهُمْ أَنَّ اللَّهَ فَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ فَإِنْ هُمْ أَطَاعُوا لَكَ فِي ذَلِكَ فَأَخْبِرْهُمْ أَنَّ اللَّهَ فَرَضَ عَلَيْهِمْ صَدَقَةً فِي أَمْوَالِهِمْ تُؤْخَذُ مِنْ أَغْنِيَائِهِمْ وَتُرَدُّ عَلَى فُقَرَائِهِمْ فَإِنْ هُمْ أَطَاعُوا لَكَ فِي ذَلِكَ فَإِيَّاكَ وَكَرَائِمَ أَمْوَالِهِمْ وَإِيَّاكَ وَدَعْوَةَ الْمَظْلُومِ فَإِنَّهُ لَيْسَ لَهَا مِنْ دُونِ اللَّهِ حِجَابٌ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Zakaria bin Ishaq] dari [Yahya bin Abdullah bin Shaifi] dari [Abu Ma'bad] dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam saat mengutus Mu'adz ke Yaman, beliau bersabda: \"Sesungguhnya engkau akan datang kepada kaum ahli kitab, maka ajaklah mereka untuk bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah, dan Muhammad adalah Rasulullah. Kemudian jika mereka mentaatimu dalam hal itu maka kabarkanlah kepada mereka bahwa Allah mewajibkan atas mereka sholat lima waktu dalam setiap sehari semalam. Kemudian jika mereka mentaatimu dalam hal itu maka kabarkanlah kepada mereka bahwa Allah telah mewajibkan zakat pada harta mereka yang diambil dari orang-orang kaya mereka dan diberikan kepada orang-orang fakir mereka. Kemudian jika mereka mentaatimu dalam hal itu, maka jauhilah harta berharga mereka dan berhati-hatilah engkau terhadap doa orang yang terzhalimi, sesungguhnya tidak ada penghalang baginya dari Allah.\" "
            },
            {
                "number": 1211,
                "arab": " أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ زِيَادٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَيْسَ الْمِسْكِينُ الَّذِي تَرُدُّهُ اللُّقْمَةُ وَاللُّقْمَتَانِ وَالْكِسْرَةُ وَالْكِسْرَتَانِ وَالتَّمْرَةُ وَالتَّمْرَتَانِ وَلَكِنْ الْمِسْكِينُ الَّذِي لَيْسَ لَهُ غِنًى يُغْنِيهِ يَسْتَحْيِي أَنْ يَسْأَلَ النَّاسَ إِلْحَافًا أَوْ لَا يَسْأَلُ النَّاسَ إِلْحَافًا",
                "id": "Telah mengabarkan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin Ziyad] ia berkata, saya mendengar [Abu Hurairah] menceritakan dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Orang miskin bukanlah orang yang tertolak untuk mendapatkan satu atau dua suap makanan, sepotong atau dua potong roti, sebutir atau dua butir kurma. Akan tetapi orang miskin adalah orang yang tidak memiliki sesuatu yang mencukupinya dan malu untuk meminta kepada manusia dengan mendesak, atau orang yang tidak meminta kepada manusia dengan mendesak.\" "
            },
            {
                "number": 1212,
                "arab": " أَخْبَرَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ صَاحِبِ إِبِلٍ وَلَا بَقَرٍ وَلَا غَنَمٍ لَا يُؤَدِّي حَقَّهَا إِلَّا أُقْعِدَ لَهَا يَوْمَ الْقِيَامَةِ بِقَاعٍ قَرْقَرٍ تَطَؤُهُ ذَاتُ الظِّلْفِ بِظِلْفِهَا وَتَنْطَحُهُ ذَاتُ الْقَرْنِ بِقَرْنِهَا لَيْسَ فِيهَا يَوْمَئِذٍ جَمَّاءُ وَلَا مَكْسُورَةُ الْقَرْنِ قَالُوا يَا رَسُولَ اللَّهِ وَمَا حَقُّهَا قَالَ إِطْرَاقُ فَحْلِهَا وَإِعَارَةُ دَلْوِهَا وَمِنْحَتُهَا وَحَلَبُهَا عَلَى الْمَاءِ وَحَمْلٌ عَلَيْهَا فِي سَبِيلِ اللَّهِ",
                "id": "Telah mengabarkan kepada kami [Ya'la bin 'Ubaid] telah menceritakan kepada kami [Abdul Malik] dari [Abu Az Zubair] dari [Jabir] ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Tidaklah pemilik unta, sapi dan kambing yang tidak menunaikan haknya kecuali ia akan didudukkan di hadapan hewan tersebut pada Hari Kiamat di tanah terbuka yang datar, kemudian hewan yang memiliki sepatu akan menginjak dengan sepatunya dan yang memiliki tanduk akan menanduk dengan tanduknya. Pada saat itu tidak ada hewan yang tak bertanduk atau tidak ada hewan yang bertanduk patah.\" Mereka berkata, \"Wahai Rasulullah, apakah hak hewan-hewan tersebut?\" Beliau menjawab: \"Mengawinkan pejantannya, meminjamkan embernya, meminjamkannya (untuk diambil manfaatnya), memeras susunya setelah diberi minum dan memberinya muatan di jalan Allah.\""
            },
            {
                "number": 1213,
                "arab": " حَدَّثَنَا بِشْرُ بْنُ الْحَكَمِ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ صَاحِبِ إِبِلٍ لَا يَفْعَلُ فِيهَا حَقَّهَا إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ أَكْثَرُ مَا كَانَتْ قَطُّ وَأُقْعِدَ لَهَا بِقَاعٍ قَرْقَرٍ تَسْتَنُّ عَلَيْهِ بِقَوَائِمِهَا وَأَخْفَافِهَا وَلَا صَاحِبِ بَقَرٍ لَا يَفْعَلُ فِيهَا حَقَّهَا إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ أَكْثَرُ مَا كَانَتْ قَطُّ وَأُقْعِدَ لَهَا بِقَاعٍ قَرْقَرٍ تَنْطَحُهُ بِقُرُونِهَا وَتَطَؤُهُ بِقَوَائِمِهَا وَلَا صَاحِبِ غَنَمٍ لَا يَفْعَلُ فِيهَا حَقَّهَا إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ أَكْثَرُ مَا كَانَتْ وَأُقْعِدَ لَهَا بِقَاعٍ قَرْقَرٍ تَنْطَحُهُ بِقُرُونِهَا وَتَطَؤُهُ بِأَظْلَافِهَا لَيْسَ فِيهَا جَمَّاءُ وَلَا مَكْسُورَةٌ قَرْنُهَا وَلَا صَاحِبِ كَنْزٍ لَا يَفْعَلُ فِيهِ حَقَّهُ إِلَّا جَاءَ كَنْزُهُ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ يَتْبَعُهُ فَاتِحًا فَاهُ فَإِذَا أَتَاهُ فَرَّ مِنْهُ فَيُنَادِيهِ خُذْ كَنْزَكَ الَّذِي خَبَّأْتَهُ قَالَ فَأَنَا عَنْهُ غَنِيٌّ فَإِذَا رَأَى أَنَّهُ لَا بُدَّ مِنْهُ سَلَكَ يَدَهُ فِي فَمِهِ فَيَقْضِمُهَا قَضْمَ الْفَحْلِ قَالَ أَبُو الزُّبَيْرِ سَمِعْتُ عُبَيْدَ بْنَ عُمَيْرٍ يَقُولُ هَذَا الْقَوْلَ ثُمَّ سَأَلْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ فَقَالَ مِثْلَ قَوْلِ عُبَيْدِ بْنِ عُمَيْرٍ قَالَ وَقَالَ أَبُو الزُّبَيْرِ سَمِعْتُ عُبَيْدَ بْنَ عُمَيْرٍ يَقُولُ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ مَا حَقُّ الْإِبِلِ قَالَ حَلَبُهَا عَلَى الْمَاءِ وَإِعَارَةُ دَلْوِهَا وَإِعَارَةُ فَحْلِهَا وَمَنْحُهَا وَحَمْلٌ عَلَيْهَا فِي سَبِيلِ اللَّهِ أَخْبَرَنَا الْحَسَنُ بْنُ الرَّبِيعِ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ الْأَعْمَشِ عَنْ الْمَعْرُورِ بْنِ سُوَيْدٍ عَنْ أَبِي ذَرٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبَعْضِ هَذَا الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Bisyr bin Al Hakam] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ibnu Juraij] ia berkata, telah mengabarkan kepadaku [Abu Az Zubair] bahwa ia mendengar [Jabir bin Abdullah] berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah pemilik unta yang tidak melakukan haknya melainkan ia akan datang pada hari Kiamat lebih banyak daripada dahulunya dan orang tersebut didudukkan di hadapannya pada tanah terbuka yang datar, hewan-hewan tersebut menyepak pemiliknya dengan kaki dan sepatunya. Dan tidaklah pemilik sapi yang tidak melakukan haknya kecuali melainkan ia akan datang pada hari Kiamat lebih banyak daripada dahulunya dan pemiliknya didudukkan di hadapannya pada tanah terbuka yang datar, hewan tersebut menanduknya dengan tanduknya dan menginjaknya dengan kaki-kakinya. Dan tidaklah pemilik kambing yang tidak melakukan haknya melainkan ia akan datang pada hari Kiamat lebih banyak daripada dahulunya dan pemiliknya di dudukkan di hadapannya pada tanah terbuka yang datar, hewan tersebut menanduknya dengan tanduknya dan menginjaknya dengan sepatu-sepatunya. Pada hari Kiamat tidak ada kambing yang tidak bertanduk dan tidak ada yang bertanduk patah. Dan tidaklah orang yang memiliki barang timbunan yang tidak melakukan haknya melainkan barang timbunannya akan datang pada hari Kiamat sebagai ular botak yang mengikutinya dengan membuka mulutnya. Apabila ular tersebut datang kepadanya, maka ia akan lari darinya, kemudian ular tersebut berseru kepadany, 'Ambillah barang timbunanmu yang telah engkau sembunyikan.' Pemiliknya berkata, 'Aku tidak butuh kepadanya.' Kemudian apabila ia melihat bahwa ia harus mengambilnya, maka ia memasukkan tangannya ke dalam mulutnya, kemudian ular tersebut mematahkannya dengan giginya sebagaimana pejantan menggigit menggunakan giginya.\" [Abu Az Zubair] berkata, \"Saya mendengar ['Ubaid bin 'Umair] mengatakan perkataan ini, maka kami pun bertanya kepada [Jabir bin Abdullah], dan ia juga mengatakan sebagaimana perkataan 'Ubaid bin 'Umair.\" Ibnu Juraij berkata, \" [Abu Az Zubair] berkata, \"Saya mendengar ['Ubaid bin 'Umair] berkata, \"Seorang laki-laki berkata, \"Wahai Rasulullah, apakah hak unta?\" Beliau menjawab: \"Memerahnya setelah memberi minum, meminjamkan embernya, meminjamkan pejantannya, meminjamkan (untuk diambil manfaatnya) dan memberinya muatan di jalan Allah.\" Telah mengabarkan kepada kami [Al Hasan bin Ar Rabi'] telah menceritakan kepada kami [Abu Al Ahwash] dari [Al A'masy] dari [Al Ma'rur bin Suwaid] dari [Abu Dzar] dari Nabi shallallahu 'alaihi wasallam dengan sebagian hadits ini.\" "
            },
            {
                "number": 1214,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ وَإِبْرَاهِيمُ بْنُ صَدَقَةَ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ الصَّدَقَةَ فَكَانَ فِي الْغَنَمِ فِي كُلِّ أَرْبَعِينَ سَائِمَةً شَاةٌ إِلَى عِشْرِينَ وَمِائَةٍ فَإِذَا زَادَتْ فَفِيهَا شَاتَانِ إِلَى مِائَتَيْنِ فَإِذَا زَادَتْ فَفِيهَا ثَلَاثُ شِيَاهٍ إِلَى ثَلَاثِ مِائَةٍ فَإِذَا زَادَتْ شَاةً لَمْ يَجِبْ فِيهَا إِلَّا ثَلَاثُ شِيَاهٍ حَتَّى تَبْلُغَ أَرْبَعَ مِائَةٍ فَإِذَا بَلَغَتْ أَرْبَعَ مِائَةِ شَاةٍ فَفِي كُلِّ مِائَةٍ شَاةٌ وَلَا تُؤْخَذُ فِي الصَّدَقَةِ هَرِمَةٌ وَلَا ذَاتُ عَوَارٍ وَلَا ذَاتُ عَيْبٍ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah menceritakan kepada kami ['Abbad bin Al 'Awwam] dan [Ibrahim bin Shadaqah] dari [Sufyan bin Husain] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam telah menetapkan tentang zakat: \"Pada kambing setiap empat puluh hingga seratus dua puluh ekor yang digembala terdapat satu ekor sebagai zakat, jika ada kelebihan hingga jumlah dua ratus ekor maka zakatnya adalah dua ekor, jika ada kelebihan hingga jumlah tiga ratus ekor maka zakatnya adalah tiga ekor kambing. Jika jumlahlah lebih satu ekor dari jumlah tiga ratus ekor, maka tidak ada zakat hingga penambahan itu hingga sampai jumlah empat ratus. Dan jika telah mencapai empat ratus ekor kambing, maka pada setiap seratus terdapat zakat satu ekor kambing, dan dalam zakat tidak diambil kambing yang tua, bukan kambing yang telah tanggal giginya, atau kambing yang memiliki aib.\" "
            },
            {
                "number": 1215,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْخَوْلَانِيِّ عَنْ الزُّهْرِيِّ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ مَعَ عَمْرِو بْنِ حَزْمٍ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ مِنْ مُحَمَّدٍ النَّبِيِّ إِلَى شُرَحْبِيلَ بْنِ عَبْدِ كُلَالٍ وَالْحَارِثِ بْنِ عَبْدِ كُلَالٍ وَنُعَيْمِ بْنِ عَبْدِ كُلَالٍ فِي أَرْبَعِينَ شَاةً شَاةٌ إِلَى أَنْ تَبْلُغَ عِشْرِينَ وَمِائَةٍ فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ وَاحِدَةً فَفِيهَا شَاتَانِ إِلَى أَنْ تَبْلُغَ مِائَتَيْنِ فَإِذَا زَادَتْ وَاحِدَةً فَفِيهَا ثَلَاثَةٌ إِلَى أَنْ تَبْلُغَ ثَلَاثَ مِائَةٍ فَمَا زَادَ فَفِي كُلِّ مِائَةِ شَاةٍ شَاةٌ حَدَّثَنَا بِشْرُ بْنُ الْحَكَمِ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ لَهُمْ كِتَابًا فَذَكَرَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Sulaiman bin Daud Al Khaulani] dari [Az Zuhri] dari [Abu Bakr bin Muhammad bin 'Amru bin Hazm] dari [Ayahnya] dari [Kakeknya], bahwa Rasulullah shallallahu 'alaihi wasallam telah menulis surat kepada penduduk Yaman yang dibawa bersama 'Amru bin Hazm: \"Bismillaahirrahmaanirrahiim. Dari Muhammad seorang Nabi kepada Syurahbil bin Abdu Kulal, Al Harits bin Abdu Kulal, dan Nu'aim bin Abdu Kulal; pada setiap empat puluh ekor kambing hingga mencapai seratus dua puluh terdapat zakat satu ekor kambing, kemudian apabila melebihi seratus dua puluh hingga dua ratus maka padanya terdapat zakat dua ekor kambing, kemudian apabila lebih dari satu hingga tiga ratus maka padanya terdapat zakat tiga ekor, dan selebihnya maka pada setiap seratus ekor kambing terdapat zakat satu ekor kambing.\" Telah menceritakan kepada kami [Bisyr bin Al Hakam] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Abdullah bin Abu Bakr bin Muhammad bin 'Amru bin Hazm] dari [Ayahnya] dari [Kakeknya], bahwa Nabi shallallahu 'alaihi wasallam telah menulis untuk mereka…kemudian ia menyebutkan seperti itu.\" "
            },
            {
                "number": 1216,
                "arab": " حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ مَسْرُوقٍ وَالْأَعْمَشُ عَنْ إِبْرَاهِيمَ قَالَا قَالَ مُعَاذٌ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ فَأَمَرَنِي أَنْ آخُذَ مِنْ كُلِّ أَرْبَعِينَ بَقَرَةً مُسِنَّةً وَمِنْ كُلِّ ثَلَاثِينَ تَبِيعًا أَوْ تَبِيعَةً",
                "id": "Telah menceritakan kepada kami [Ya'la bin 'Ubaid] telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] dari [Masruq] serta [Al A'masy] dari [Ibrahim] mereka berkata, [Mu'adz] berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutusku ke Yaman dan memerintahkanku untuk mengambil dari setiap empat puluh ekor sapi satu ekor musinnah, dan dari setiap tiga puluh ekor satu tabi' atau tabi'ah.\" "
            },
            {
                "number": 1217,
                "arab": " أَخْبَرَنَا عَاصِمُ بْنُ يُوسُفَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ عَاصِمٍ عَنْ أَبِي وَائِلٍ عَنْ مَسْرُوقٍ عَنْ مُعَاذٍ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ فَأَمَرَنِي أَنْ آخُذَ مِنْ الْبَقَرِ مِنْ ثَلَاثِينَ تَبِيعًا حَوْلِيًّا وَمِنْ أَرْبَعِينَ بَقَرَةً مُسِنَّةً حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ بِنَحْوِهِ",
                "id": "Telah mengabarkan kepada kami ['Ashim bin Yusuf] telah menceritakan kepada kami [Abu Bakr bin 'Ayyasy] dari ['Ashim] dari [Abu Wail] dari [Masruq] dari [Mu'adz] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutusku ke Yaman, kemudian beliau memerintahkanku agar mengambil sapi dari setiap jumlah tiga puluh ekor satu ekor tabi', dan dari setiap empat puluh ekor sapi satu ekor musinnah.\" Telah menceritakan kepada kami [Ahmad bin Yunus] dari [Abu Bakr bin 'Ayyasy] dengan seperti itu.\" "
            },
            {
                "number": 1218,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ وَإِبْرَاهِيمُ بْنُ صَدَقَةَ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ الصَّدَقَةَ فَلَمْ تُخْرَجْ إِلَى عُمَّالِهِ حَتَّى قُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا قُبِضَ أَخَذَهَا أَبُو بَكْرٍ فَعَمِلَ بِهَا مِنْ بَعْدِهِ فَلَمَّا قُبِضَ أَبُو بَكْرٍ أَخَذَهَا عُمَرُ فَعَمِلَ بِهَا مِنْ بَعْدِهِمَا وَلَقَدْ قُتِلَ عُمَرُ وَإِنَّهَا لَمَقْرُونَةٌ بِسَيْفِهِ أَوْ بِوَصِيَّتِهِ وَكَانَ فِي صَدَقَةِ الْإِبِلِ فِي كُلِّ خَمْسٍ شَاةٌ إِلَى خَمْسٍ وَعِشْرِينَ فَإِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ فَفِيهَا بِنْتُ مَخَاضٍ إِلَى خَمْسٍ وَثَلَاثِينَ فَإِنْ لَمْ تَكُنْ بِنْتُ مَخَاضٍ فَابْنُ لَبُونٍ ذَكَرٌ فَإِذَا زَادَتْ فَفِيهَا بِنْتُ لَبُونٍ إِلَى خَمْسٍ وَأَرْبَعِينَ فَإِذَا زَادَتْ فَفِيهَا حِقَّةٌ إِلَى سِتِّينَ فَإِذَا زَادَتْ فَفِيهَا جَذَعَةٌ إِلَى خَمْسٍ وَسَبْعِينَ فَإِذَا زَادَتْ فَفِيهَا بِنْتَا لَبُونٍ إِلَى تِسْعِينَ فَإِذَا زَادَتْ فَفِيهَا حِقَّتَانِ إِلَى عِشْرِينَ وَمِائَةٍ فَإِذَا زَادَتْ فَفِيهَا فِي كُلِّ خَمْسِينَ حِقَّةٌ وَفِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ أَبِي إِسْحَقَ الْفَزَارِيِّ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah menceritakan kepada kami ['Abbad bin Al Awwam] dan [Ibrahim bin Shadaqah] dari [Sufyan bin Husain] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam telah menetapkan hukum zakat, namun belum disampaikan kepada para petugasnya hingga Rasulullah shallallahu 'alaihi wasallam meninggal. Maka ketika beliau telah meninggal catatan tersebut diambil Abu Bakr, dan ia melaksanakannya sepeninggal beliau. Kemudian tatkala Abu Bakr meninggal, maka Umar mengambilnya dan melaksanakannya setelah mereka berdua, dan ketika Umar terbunuh, maka sungguh catatan tersebut disertakan pada pedangnya atau pada wasiatnya. Mengenai zakat unta, maka pada setiap lima ekor hingga dua puluh lima terdapat zakat satu ekor kambing. Jika telah mencapai dua puluh lima hingga tiga puluh lima, maka zakatnya adalah Bintu Makhadl, jika tidak ada Bintu Makhadl maka Ibnu Labun jantan. Jika lebih hingga mencapai jumlah empat puluh lima, maka zakatnya adalah satu ekor Bintu Labun. Jika lebih hingga sejumlah enam puluh, maka zakatnya adalah satu Hiqqah. Jika lebih hingga sejumlah tujuh puluh lima, maka zakatnya adalah Jadza'ah. Jika lebih hingga sejumlah sembilan puluh, maka zakatnya adalah dua ekor Bintu Labun. Jika lebih hingga sejumlah seratus dua puluh, maka zakatnya adalah dua ekor Hiqqah. Jika lebih, maka pada setiap penambahan lima puluh terdapat zakat satu hiqqah, dan setiap empat puluh satu ekor bintu labun.\" Telah menceritakan kepada kami [Muhammad bin 'Uyainah] dari [Abu Ishaq Al Fazari] dari [Sufyan bin Husain] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam seperti itu.\" "
            },
            {
                "number": 1219,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْخَوْلَانِيِّ حَدَّثَنِي الزُّهْرِيُّ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ مَعَ عَمْرِو بْنِ حَزْمٍ إِلَى شُرَحْبِيلَ بْنِ عَبْدِ كُلَالٍ وَالْحَارِثِ بْنِ عَبْدِ كُلَالٍ وَنُعَيْمِ بْنِ عَبْدِ كُلَالٍ إِنَّ فِي كُلِّ خَمْسِ أَوَاقٍ مِنْ الْوَرِقِ خَمْسَةَ دَرَاهِمَ فَمَا زَادَ فَفِي كُلِّ أَرْبَعِينَ دِرْهَمًا دِرْهَمٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ شَيْءٌ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Sulaiman bin Daud Al Khaulani] telah menceritakan kepadaku [Az Zuhri] dari [Abu Bakr bin Muhammad bin 'Amru bin Hazm] dari [Ayahnya] dari [Kakeknya], bahwa Rasulullah shallallahu 'alaihi wasallam menulis surat dititipkan kepada 'Amru bin Hazm untuk ditujukan kepada Syurahbil bin Abdu Kulal, Al Harits bin Abdu Kulal, dan Nu'aim bin Abdu Kulal, yakni bahwa pada setiap lima uqiyah perak terdapat zakat lima dirham, jika ada lebih maka pada setiap empat puluh dirham adalah satu dirham, dan yang kurang dari lima uqiyah tidak ada kewajiban zakat padanya.\" "
            },
            {
                "number": 1220,
                "arab": " أَخْبَرَنَا الْمُعَلَّى بْنُ أَسَدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَفَوْتُ عَنْ صَدَقَةِ الْخَيْلِ وَالرَّقِيقِ هَاتُوا صَدَقَةَ الرِّقَةِ مِنْ كُلِّ أَرْبَعِينَ دِرْهَمًا دِرْهَمٌ وَلَيْسَ فِي تِسْعِينَ وَمِائَةٍ شَيْءٌ حَتَّى تَبْلُغَ مِائَتَيْنِ",
                "id": "Telah mengabarkan kepada kami [Al Mu'alla bin Asad] telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Ishaq] dari ['Ashim bin Dlamrah] dari [Ali] dan ia merafa'kannya kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Aku telah memaafkan dari zakat kuda dan budak. Maka berikanlah zakat perak, pada setiap empat puluh dirham sebanyak satu dirham, dan pada seratus sembilan puluh tidak ada kewajiban zakat, sehingga mencapai dua ratus.\""
            },
            {
                "number": 1221,
                "arab": " أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا شَرِيكٌ عَنْ عُثْمَانَ الثَّقَفِيِّ عَنْ أَبِي لَيْلَى هُوَ الْكِنْدِيُّ عَنْ سُوَيْدِ بْنِ غَفَلَةَ قَالَ أَتَانَا مُصَدِّقُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخَذْتُ بِيَدِهِ فَقَرَأْتُ فِي عَهْدِهِ أَنْ لَا يُجْمَعَ بَيْنَ مُتَفَرِّقٍ وَلَا يُفَرَّقَ بَيْنَ مُجْتَمِعٍ خَشْيَةَ الصَّدَقَةِ",
                "id": "Telah mengabarkan kepada kami [Al Aswad bin 'Amir] telah menceritakan kepada kami [Syarik] dari [Utsman Ats Tsaqafi] dari [Abu Laila] -yaitu Al Kindi- dari [Suwaid bin Ghafalah] ia berkata, \" [Petugas zakat Nabi shallallahu 'alaihi wasallam] datang kepada kami, kemudian aku gandeng tangannya dan aku baca pada perjanjiannya, 'Tidak boleh digabungkan antara hewan yang terpisah, dan tidak boleh dipisahkan antara hewan yang digabungkan karena khawatir membayar zakat.\""
            },
            {
                "number": 1222,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ زَكَرِيَّا عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ عَنْ أَبِي مَعْبَدٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا بَعَثَ مُعَاذًا إِلَى الْيَمَنِ قَالَ إِيَّاكَ وَكَرَائِمَ أَمْوَالِهِمْ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Zakaria] dari [Yahya bin Abdullah bin Shaifi] dari [Abu Ma'bad] mantan budak Ibnu Abbas, dari [Ibnu Abbas], bahwa saat Nabi shallallahu 'alaihi wasallam mengutus Mu'adz ke Yaman, beliau bersabda: \"Jauhilah harta berharga mereka.\""
            },
            {
                "number": 1223,
                "arab": " حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ قَالَ عَبْدُ اللَّهِ بْنُ دِينَارٍ أَخْبَرَنِي قَالَ سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ يُحَدِّثُ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ عَلَى فَرَسِ الْمُسْلِمِ وَلَا عَلَى غُلَامِهِ صَدَقَةٌ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] ia berkata, [Abdullah bin Dinar] telah mengabarkan kepadaku, ia berkata; saya mendengar [Sulaiman bin Yasar] menceritakan dari ['Irak bin Malik] dari [Abu Hurairah], dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang Muslim tidak ada kewajiban mengeluarkan zakat pada kuda dan budaknya.\" "
            },
            {
                "number": 1224,
                "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ سُفْيَانَ عَنْ عَمْرِو بْنِ يَحْيَى عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ وَلَا فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ وَلَا فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ قَالَ أَبُو مُحَمَّد الْوَسْقُ سِتُّونَ صَاعًا وَالصَّاعُ مَنَوَانِ وَنِصْفٌ فِي قَوْلِ أَهْلِ الْحِجَازِ وَأَرْبَعَةُ أَمْنَاءٍ فِي قَوْلِ أَهْلِ الْعِرَاقِ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Musa] dari [Sufyan] dari ['Amru bin Yahya] dari [Ayahnya] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada zakat pada biji-bijian serta kurma yang kurang dari lima wasaq, dan tidak ada zakat pada perak yang kurang dari lima uqiyah, dan tidak ada zakat pada unta yang kurang dari lima dzaud.\" Abu Muhammad berkata, \"Satu wasaq adalah enam puluh sha', dan satu sha' adalah dua setengah Mana (nama timbangan) menurut pendapat penduduk Hijaz, dan empat Mana menurut pendapat penduduk Irak.\" "
            },
            {
                "number": 1225,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ يَحْيَى بْنِ عُمَارَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ مِنْ حَبٍّ وَلَا تَمْرٍ وَلَا فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ وَلَا فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Isma'il bin Umayyah] dari [Muhammad bin Yahya bin Habban] dari [Yahya bin 'Umarah] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada biji-bijian serta kurma yang kurang dari lima wasaq, dan tidak ada zakat pada perak yang kurang dari lima uqiyah, dan tidak ada zakat pada unta yang kurang dari lima dzaud.\" "
            },
            {
                "number": 1226,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْخَوْلَانِيِّ حَدَّثَنِي الزُّهْرِيُّ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ مَعَ عَمْرِو بْنِ حَزْمٍ إِلَى شُرَحْبِيلَ بْنِ عَبْدِ كُلَالٍ وَالْحَارِثِ بْنِ عَبْدِ كُلَالٍ وَنُعَيْمِ بْنِ عَبْدِ كُلَالٍ إِنَّ فِي كُلِّ خَمْسِ أَوَاقٍ مِنْ الْوَرِقِ خَمْسَةَ دَرَاهِمَ فَمَا زَادَ فَفِي كُلِّ أَرْبَعِينَ دِرْهَمًا دِرْهَمٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ شَيْءٌ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Sulaiman bin Daud Al Khaulani] telah menceritakan kepadaku [Az Zuhri] dari [Abu Bakr bin Muhammad bin 'Amru bin Hazm] dari [Ayahnya] dari [Kakeknya], bahwa Rasulullah shallallahu 'alaihi wasallam menulis surat yang dititipkan kepada 'Amru bin Hazm untuk ditujukan kepada Syurahbil bin 'Abdu Kulal, Al Harits bin Abdu Kulal, serta Nu'aim bin Abdu Kulal, bahwa pada setiap lima wasaq perak terdapat zakat lima dirham, jika ada kelebihan maka pada setiap empat puluh dirham terdapat zakat satu dirham, dan yang kurang dari lima wasaq tidak ada zakat padanya.\" "
            },
            {
                "number": 1227,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ زَكَرِيَّا عَنْ الْحَجَّاجِ بْنِ دِينَارٍ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ عَنْ حُجَيَّةَ بْنِ عَدِيٍّ عَنْ عَلِيٍّ أَنَّ الْعَبَّاسَ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي تَعْجِيلِ صَدَقَتِهِ قَبْلَ أَنْ تَحِلَّ فَرَخَّصَ فِي ذَلِكَ قَالَ أَبُو مُحَمَّد آخُذُ بِهِ وَلَا أَرَى فِي تَعْجِيلِ الزَّكَاةِ بَأْسًا",
                "id": "Telah mengabarkan kepada kami [Sa'id? bin Manshur] telah menceritakan kepada kami [Isma'il bin Zakaria] dari [Al Hajjaj bin Dinar] dari [Al Hakam bin 'Utaibah] dari [Hujayyah bin 'Adi] dari [Ali], bahwa Al Abbas bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang hukum menyegerakan dalam memberikan zakat sebelum wajib. Kemudian beliau memberikan keringanan dalam hal tersebut.\" Abu Muhammad berkata, \"Aku mengamalkan hadits tersebut, dan menyegerakan zakat tidak ada masalah.\" "
            },
            {
                "number": 1228,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الطُّفَيْلِ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي حَمْزَةَ عَنْ عَامِرٍ عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ فِي أَمْوَالِكُمْ حَقًّا سِوَى الزَّكَاةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ath Thufail] telah menceritakan kepada kami [Syarik] dari [Abu Hamzah] dari ['Amir] dari [Fatimah binti Qais] ia berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya di dalam harta kalian terdapat hak selain zakat.\""
            },
            {
                "number": 1229,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا إِسْرَائِيلُ حَدَّثَنَا أَبُو الْجُوَيْرِيَةِ الْجَرْمِيُّ أَنَّ مَعْنَ بْنَ يَزِيدَ حَدَّثَهُ قَالَ بَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَأَبِي وَجَدِّي وَخَطَبَ عَلَيَّ فَأَنْكَحَنِي وَخَاصَمْتُ إِلَيْهِ كَانَ أَبِي يَزِيدُ أَخْرَجَ دَنَانِيرَ يَتَصَدَّقُ بِهَا فَوَضَعَهَا عِنْدَ رَجُلٍ فِي الْمَسْجِدِ فَجِئْتُ فَأَخَذْتُهَا فَأَتَيْتُهُ بِهَا فَقَالَ وَاللَّهِ مَا إِيَّاكَ أَرَدْتُ بِهَا فَخَاصَمْتُهُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَكَ مَا نَوَيْتَ يَا يَزِيدُ وَلَكَ يَا مَعْنُ مَا أَخَذْتَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Israil] telah menceritakan kepada kami [Abu Al Juwairiyah Al Jurmi] bahwa [Ma'n bin Yazid] telah menceritakan kepadanya, ia berkata, \"Aku bersama bapak dan kakekku membaiat Rasulullah shallallahu 'alaihi wasallam. Ayahku lalu meminang dan menikahkan aku. Dan aku juga mengajukan perkara kepada Rasulullah shallallahu 'alaihi wasallam; ayahku yang bernama Yazid pernah mengeluarkan beberapa dinar untuk bersedekah, kemudian ia meletakkannya pada seorang laki-laki di masjid. Aku lalu datang dan mengambilnya, kemudian aku membawa uang tersebut kepadanya. Maka ia pun berkata, \"Demi Allah, bukan engkau yang aku inginkan dengan sedekah itu! \" Kemudian aku mengajukan perkara tersebut kepada Rasulullah shallallahu 'alaihi wasallam, beliau pun bersabda: \"Bagimu apa yang telah engkau niatkan wahai Yazid dan untukmu apa yang telah engkau ambil wahai Ma'n.\""
            },
            {
                "number": 1230,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ وَأَبُو نُعَيْمٍ عَنْ سُفْيَانَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ رَيْحَانَ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَحِلُّ الصَّدَقَةُ لِغَنِيٍّ وَلَا لِذِي مِرَّةٍ سَوِيٍّ قَالَ أَبُو مُحَمَّد يَعْنِي قَوِيٍّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dan [Abu Nu'aim] dari [Sufyan] dari [Sa'd bin Ibrahim] dari [Raihan bin Yazid] dari [Abdullah bin 'Amru] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal sedekah bagi orang kaya dan orang sehat yang kuat.\" Abu Muhammad berkata, \"Yaitu orang yang kuat.\" "
            },
            {
                "number": 1231,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شَرِيكٌ عَنْ حَكِيمِ بْنِ جُبَيْرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَأَلَ عَنْ ظَهْرِ غِنًى جَاءَ يَوْمَ الْقِيَامَةِ وَفِي وَجْهِهِ خُمُوشٌ أَوْ كُدُوحٌ أَوْ خُدُوشٌ قِيلَ يَا رَسُولَ اللَّهِ وَمَا الْغِنَى قَالَ خَمْسُونَ دِرْهَمًا أَوْ قِيمَتُهَا مِنْ الذَّهَبِ أَخْبَرَنَا أَبُو عَاصِمٍ وَمُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ حَكِيمِ بْنِ جُبَيْرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Syarik] dari [Hakim bin Jubair] dari [Muhammad bin Abdurrahman bin Yazid] dari [Ayahnya] dari [Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meminta-minta sementara ia memiliki kelebihan, maka pada hari Kiamat ia akan datang dalam keadaan pada wajahnya terdapat luka cakaran.\" Rasulullah shallallahu 'alaihi wasallam ditanya, \"Wahai Rasulullah, berapakah kecukupan tersebut?\" Beliau bersabda: \"Lima puluh dirham, atau emas yang senilai dengannya.\" Telah mengabarkan kepada kami [Abu 'Ashim] dan [Muhammad bin Yusuf] dari [Sufyan] dari [Hakim bin Jubair] dari [Muhammad bin Abdurrahman] dari [Ayahnya] dari [Abdullah] dari Nabi shallallahu 'alaihi wasallam dengan seperti hadits tersebut.\" "
            },
            {
                "number": 1232,
                "arab": " أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي مُحَمَّدُ بْنُ زِيَادٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ قَالَ أَخَذَ الْحَسَنُ تَمْرَةً مِنْ تَمْرِ الصَّدَقَةِ فَجَعَلَهَا فِي فِيهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كِخْ كِخْ أَلْقِهَا أَمَا شَعَرْتَ أَنَّا لَا نَأْكُلُ الصَّدَقَةَ",
                "id": "Telah mengabarkan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepadaku [Muhammad bin Ziyad] ia berkata, saya mendengar [Abu Hurairah] berkata, \"Al Hasan mengambil satu biji dari kurma zakat dan memasukkannya ke dalam mulutnya, maka Nabi shallallahu 'alaihi wasallam pun bersabda: \"Kikh, kikh, buang! Tidakkah engkau merasa bahwa kita tidak makan sedekah?\""
            },
            {
                "number": 1233,
                "arab": " أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا زُهَيْرٌ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى عَنْ عِيسَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِي لَيْلَى قَالَ كُنْتُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَهُ الْحَسَنُ بْنُ عَلِيٍّ فَأَخَذَ تَمْرَةً مِنْ تَمْرِ الصَّدَقَةِ فَانْتَزَعَهَا مِنْهُ وَقَالَ أَمَا عَلِمْتَ أَنَّهُ لَا تَحِلُّ لَنَا الصَّدَقَةُ",
                "id": "Telah mengabarkan kepada kami [Al Aswad bin 'Amir] telah menceritakan kepada kami [Zuhair] dari [Abdullah bin Isa] dari [Isa] dari [Abdurrahman bin Abu Laila] dari [Abu Laila] ia berkata, \"Aku pernah bersama Nabi shallallahu 'alaihi wasallam dan di sisi beliau terdapat Al Hasan bin Ali, kemudian ia mengambil satu biji kurma zakat, maka beliau mengambil kurma tersebut darinya dan berkata: \"Tidakkah engkau mengetahui bahwa sedekah tidak halal bagi kita?\""
            },
            {
                "number": 1234,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ وَهْبِ بْنِ مُنَبِّهٍ عَنْ أَخِيهِ عَنْ مُعَاوِيَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُلْحِفُوا بِي فِي الْمَسْأَلَةِ فَوَاللَّهِ لَا يَسْأَلُنِي أَحَدٌ شَيْئًا فَأُعْطِيَهُ وَأَنَا كَارِهٌ فَيُبَارَكَ لَهُ فِيهِ",
                "id": "Telah mengabarkan kepada kami [Sa'id? bin Manshur] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Amru bin Dinar] dari [Wahb bin Munabbih] dari [Saudaranya] dari [Mu'awiyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mendesakku dalam meminta! Demi Allah, seseorang meminta sesuatu kepadaku kemudian aku memberinya, sementara aku tidak suka, lalu ia diberi berkah di dalamnya.\" "
            },
            {
                "number": 1235,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ حَدَّثَنَا يَزِيدُ هُوَ ابْنُ زُرَيْعٍ أَخْبَرَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ عَنْ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ سَأَلَ النَّاسَ مَسْأَلَةً وَهُوَ عَنْهَا غَنِيٌّ كَانَتْ شَيْنًا فِي وَجْهِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah Ar Raqasyi] telah menceritakan kepada kami [Yazid] -yaitu Ibnu Zurai'- telah mengabarkan kepada kami [Sa'id?] dari [Qatadah] dari [Salim bin Abu Al Ja'd] dari [Ma'dan bin Abu Thalhah] dari [Tsauban] mantan budak Rasulullah shallallahu 'alaihi wasallam, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meminta sesuatu kepada manusia, sementara dirinya tidak memerlukan sesuatu itu, kecuali sesuatu itu akan menjadi aib di wajahnya.\" "
            },
            {
                "number": 1236,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ نَاسًا مِنْ الْأَنْصَارِ سَأَلُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْطَاهُمْ ثُمَّ سَأَلُوهُ فَأَعْطَاهُمْ حَتَّى إِذَا نَفِدَ مَا عِنْدَهُ قَالَ مَا يَكُونُ عِنْدِي مِنْ خَيْرٍ فَلَنْ أَدَّخِرَهُ عَنْكُمْ وَمَنْ يَسْتَعِفَّ يُعِفَّهُ اللَّهُ وَمَنْ يَسْتَغْنِ يُغْنِهِ اللَّهُ وَمَنْ يَتَصَبَّرْ يُصَبِّرْهُ اللَّهُ وَمَا أُعْطِيَ أَحَدٌ عَطَاءً هُوَ خَيْرٌ وَأَوْسَعُ مِنْ الصَّبْرِ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari ['Atha` bin Yazid Al Laitsi] dari [Abu Sa'id Al Khudri], bahwa beberapa orang Anshar meminta kepada Rasulullah shallallahu 'alaihi wasallam kemudian beliau memberi, kemudian mereka meminta meminta lagi dan beliau memberi hingga habis apa yang ada pada beliau. Kemudian beliau bersabda: \"Tidak ada kebaikan yang aku simpan dari kalian, barangsiapa menjaga kehormatan dirinya maka Allah akan jaga kehormatan dirinya, barangsiapa merasa cukup maka Allah akan beri dia kecukupan, barangsiapa berusaha untuk bersabar maka Allah akan menjadikannya bersabar. Dan tidaklah seseorang diberi suatu pemberian yang lebih baik dan lebih luas daripada kesabaran.\""
            },
            {
                "number": 1237,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ قَالَ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ أَنَّهُ قَالَ قَالَ عَبْدُ اللَّهِ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْطِينِي الْعَطَاءَ فَأَقُولُ أَعْطِهِ مَنْ هُوَ أَفْقَرُ إِلَيْهِ مِنِّي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذْهُ وَمَا آتَاكَ اللَّهُ مِنْ هَذَا الْمَالِ وَأَنْتَ غَيْرُ مُشْرِفٍ وَلَا سَائِلٍ فَخُذْهُ وَمَا لَا فَلَا تُتْبِعْهُ نَفْسَكَ أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ عَنْ شُعَيْبِ بْنِ أَبِي حَمْزَةَ عَنْ الزُّهْرِيِّ حَدَّثَنِي السَّائِبُ بْنُ يَزِيدَ أَنَّ حُوَيْطِبَ بْنَ عَبْدِ الْعُزَّى أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ السَّعْدِيِّ أَخْبَرَهُ عَنْ عُمَرَ بِنَحْوِهِ أَخْبَرَنَا أَبُو الْوَلِيدِ حَدَّثَنَا اللَّيْثُ عَنْ بُكَيْرٍ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ ابْنِ السَّعْدِيِّ قَالَ اسْتَعْمَلَنِي عُمَرُ فَذَكَرَ نَحْوًا مِنْهُ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] ia berkata, telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] dari [Salim] bahwa ia berkata, [Abdullah] berkata, aku mendengar [Umar bin Al Khathab] berkata, \"Rasulullah shallallahu 'alaihi wasallam memberiku sebuah pemberian, kemudian aku katakan, \"Berikanlah kepada orang yang lebih membutuhkannya dariku. Lalu beliau berkata: \"Ambillah apa yang Allah berikan kepadamu dari harta ini, sesuatu yang engkau tidak mengharapkan dan tidak memintanya, ambillah! Dan apa yang tidak demikian maka janganlah engkau perturutkan dirimu.\" Telah mengabarkan kepada kami [Al Hakam bin Nafi'] dari [Syu'aib bin Abu Hamzah] dari [Az Zuhri] telah menceritakan kepadaku [As Sa`ib bin Yazid] bahwa [Huwaithib bin Abdul 'Uzza] telah mengabarkan kepadanya, bahwa [Abdullah bin As Suddi] telah mengabarkan kepadanya dari [Umar] seperti itu.\" Telah mengabarkan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Al Laits] dari [Bukair] dari [Busr bin Sa'id] dari [Ibnu As Suddi] ia berkata, \" [Umar] mengangkatku sebagai pegawai ….. kemudian ia menyebutkan hadits seperti itu.\" "
            },
            {
                "number": 1238,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ الْأَوْزَاعِيِّ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَعُرْوَةَ بْنِ الزُّبَيْرِ أَنَّ حَكِيمَ بْنَ حِزَامٍ قَالَ سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَقَالَ يَا حَكِيمُ إِنَّ هَذَا الْمَالَ خَضِرٌ حُلْوٌ فَمَنْ أَخَذَهُ بِسَخَاوَةِ نَفْسٍ بُورِكَ لَهُ فِيهِ وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ وَكَانَ كَالَّذِي يَأْكُلُ وَلَا يَشْبَعُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Al Auza'i] dari [Ibnu Syihab] dari [Sa'id? bin Al Musayyab] dan ['Urwah bin Az Zubair] bahwa [Hakim bin Hizam] berkata, \"Aku meminta kepada Nabi shallallahu 'alaihi wasallam lalu beliau memberiku, kemudian aku meminta kepadanya dan beliau memberiku lagi, kemudian aku meminta kepadanya lalu beliau memberiku lagi, kemudian aku meminta kepadanya lalu beliau bersabda: \"Wahai Hakim, sesungguhnya harta ini adalah hijau dan manis, maka barangsiapa mengambilnya dengan kemurahan hati, maka ia akan diberkahi pada harta tersebut. Dan barangsiapa mengambilnya dengan ketamakan jiwa, maka ia tidak akan diberkahi pada hartanya. Dan ia seperti orang yang makan namun tidak kenyang.\""
            },
            {
                "number": 1239,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي هِشَامٌ عَنْ عُرْوَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ خَيْرُ الصَّدَقَةِ مَا تُصُدِّقَ بِهِ عَنْ ظَهْرِ غِنًى وَلْيَبْدَأْ أَحَدُكُمْ بِمَنْ يَعُولُ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Hisyam] dari ['Urwah] dari [Abu Hurairah] ia berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik sedekah adalah sesuatu yang disedekahkan setelah merasa cukup, dan hendaknya salah seorang di antara kalian memulai dengan orang yang ia tanggung.\""
            },
            {
                "number": 1240,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْيَدُ الْعُلْيَا خَيْرٌ مِنْ الْيَدِ السُّفْلَى قَالَ وَالْيَدُ الْعُلْيَا يَدُ الْمُعْطِي وَالْيَدُ السُّفْلَى يَدُ السَّائِلِ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Hazb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tangan di atas lebih baik daripada tangan yang di bawah.\" Dan beliau bersabda: \"Dan tangan yang di atas adalah tangan orang yang memberi, sedangkan tangan yang di bawah adalah tangan orang yang meminta.\""
            },
            {
                "number": 1241,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ سَمِعْتُ مُوسَى بْنَ طَلْحَةَ يَذْكُرُ عَنْ حَكِيمِ بْنِ حِزَامٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ الصَّدَقَةِ عَنْ ظَهْرِ غِنًى وَالْيَدُ الْعُلْيَا خَيْرٌ مِنْ الْيَدِ السُّفْلَى وَابْدَأْ بِمَنْ تَعُولُ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami ['Amru bin Utsman] ia berkata, saya mendengar [Musa bin Thalhah] menyebutkan hadits dari [Hakim bin Hizam] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik sedekah adalah setelah merasa cukup, dan tangan yang di atas lebih baik daripada tangan yang di bawah, mulailah dari orang yang engkau tanggung.\" "
            },
            {
                "number": 1242,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ قَالَ سُلَيْمَانُ أَخْبَرَنِي قَالَ سَمِعْتُ أَبَا وَائِلٍ يُحَدِّثُ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ أَنَّهَا قَالَتْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَا مَعْشَرَ النِّسَاءِ تَصَدَّقْنَ وَلَوْ مِنْ حُلِيِّكُنَّ وَكَانَ عَبْدُ اللَّهِ خَفِيفَ ذَاتِ الْيَدِ فَجِئْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُهُ فَوَافَقَتْ زَيْنَبَ امْرَأَةٌ مِنْ الْأَنْصَارِ تَسْأَلُ عَمَّا أَسْأَلُ عَنْهُ فَقُلْتُ لِبِلَالٍ سَلْ لِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْنَ أَضَعُ صَدَقَتِي عَلَى عَبْدِ اللَّهِ أَوْ فِي قَرَابَتِي فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَيُّ الزَّيَانِبِ فَقَالَ امْرَأَةُ عَبْدِ اللَّهِ فَقَالَ لَهَا أَجْرَانِ أَجْرُ الْقَرَابَةِ وَأَجْرُ الصَّدَقَةِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah] ia berkata, [Sulaiman] telah mengabarkan kepadaku, ia berkata, saya mendengar [Abu Wail] menceritakan dari ['Amru bin Al Harits] dari [Zainab] isteri Abdullah, bahwa ia berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai para wanita bersedekahlah walaupun dari perhiasan kalian.\" Sementara Abdullah adalah orang yang miskin, kemudian aku datang kepada Rasulullah shallallahu 'alaihi wasallam bertanya kepada beliau.\" Kemudian Zainab berpapasan dengan seorang wanita Anshar yang juga ingin bertanya mengenai apa yang akan aku tanyakan. Kemudian kukatakan kepada Bilal, \"Tanyakanlah kepada Rasulullah shallallahu 'alaihi wasallam, dimanakah aku harus memberikan sedekahku, kepada Abdullah (suamiku) atau kepada kerabatku?\" Kemudian Bilal bertanya kepada Nabi shallallahu 'alaihi wasallam, lantas beliau balik bertanya, \"Zainab yang manakah?\" Bilal menjawab, \"Isteri Abdullah.\" Kemudian beliau bersabda: \"Baginya dua pahala, pahala kekerabatan dan pahala sedekah.\""
            },
            {
                "number": 1243,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ حَدَّثَنَا مَالِكٌ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسٍ قَالَ كَانَ أَبُو طَلْحَةَ أَكْثَرَ أَنْصَارِيٍّ بِالْمَدِينَةِ مَالًا نَخْلًا وَكَانَتْ أَحَبَّ أَمْوَالِهِ إِلَيْهِ بَيْرُحَاءُ وَكَانَتْ مُسْتَقْبِلَةَ الْمَسْجِدِ وَكَانَ يَدْخُلُهَا وَيَشْرَبُ مِنْ مَائِهَا طَيِّبٌ فَقَالَ أَنَسٌ فَلَمَّا أُنْزِلَتْ هَذِهِ الْآيَةُ { لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ } قَالَ إِنَّ أَحَبَّ أَمْوَالِي إِلَيَّ بَيْرُحَاءُ وَإِنَّهَا صَدَقَةٌ لِلَّهِ أَرْجُو بِرَّهَا وَذُخْرَهَا عِنْدَ اللَّهِ فَضَعْهَا يَا رَسُولَ اللَّهِ حَيْثُ شِئْتَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَخٍ ذَلِكَ مَالٌ رَابِحٌ أَوْ رَائِحٌ وَقَدْ سَمِعْتُ مَا قُلْتَ فِيهِ وَإِنِّي أَرَى أَنْ تَجْعَلَهُ فِي الْأَقْرَبِينَ فَقَالَ أَبُو طَلْحَةَ أَفْعَلُ يَا رَسُولَ اللَّهِ فَقَسَّمَهُ أَبُو طَلْحَةَ فِي قَرَابَةِ بَنِي عَمِّهِ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah menceritakan kepada kami [Malik] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas] ia berkata, \"Abu Thalhah adalah orang anshar yang paling banyak hartanya di kota Madinah, yaitu pohon kurma. Harta yang paling ia senangi adalah Bairuha` (kebun kurma) yang menghadap ke masjid. Ia biasa masuk untuk makan (buha) dan meminum airnya yang jernih.\" Anas berkata, \"Kemudian tatkala ayat: '(Kamu sekali-kali tidak sampai kepada kebajikan (yang sempurna), sebelum kamu menafkahkan sehahagian harta yang kamu cintai) ' (Qs. Ali Imran: 92). Abu Thalhah berkata, \"Sungguh, hartaku yang paling aku senangi adalah Bairuha`, dan sesungguhnya kebun tersebut adalah sedekah untuk Allah, aku mengharapkan kebaikan dan simpanan pahalanya di sisi Allah. Maka pergunakan di mana engkau kehendaki wahai Rasul! \" Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Bakh, itu adalah harta yang menguntungkan, sungguh aku telah mendengar apa yang engkau katakan. Namun menurutku, sebaiknya itu engkau berikan kepada para kerabat.\" Kemudian Abu Thalhah berkata, \"Aku akan melakukannya wahai Rasulullah! \" Abu Thalhah lalu membaginya di antara para kerabat anak pamannya.\""
            },
            {
                "number": 1244,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنَا أَبِي عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ هَيَّاجِ بْنِ عِمْرَانَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ مَا خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا أَمَرَنَا فِيهَا بِالصَّدَقَةِ وَنَهَانَا عَنْ الْمُثْلَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] Telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepada kami [Ayahku] dari [Qatadah] dari [Al Hasan] dari [Hayyaj bin Imran] dari [Imran bin Hushain] ia berkata, \"Tidaklah Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada kami kecuali beliau memerintahkan kami untuk bersedekah, dan melarang kami dari mencincang.\" "
            },
            {
                "number": 1245,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي عَمْرُو بْنُ مُرَّةَ قَالَ سَمِعْتُ خَيْثَمَةَ عَنْ عَدِيِّ بْنِ حَاتِمٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ فَإِنْ لَمْ تَجِدُوا فَبِكَلِمَةٍ طَيِّبَةٍ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepada kami ['Amru bin Murrah] ia berkata, saya mendengar [Khaitsamah] dari [Adi bin Hatim] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Takutlah kepada Neraka walaupun hanya dengan sebelah kurma. Jika tidak kalian dapatkan, maka dengan perkataan yang baik.\""
            },
            {
                "number": 1246,
                "arab": " أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ دُحَيْمٌ حَدَّثَنَا سَعِيدُ بْنُ مَسْلَمَةَ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لُبَابَةَ أَنَّ أَبَا لُبَابَةَ أَخْبَرَهُ أَنَّهُ لَمَّا رَضِيَ عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَا رَسُولَ اللَّهِ إِنَّ مِنْ تَوْبَتِي أَنْ أَهْجُرَ دَارَ قَوْمِي وَأُسَاكِنَكَ وَأَنْخَلِعَ مِنْ مَالِي صَدَقَةً لِلَّهِ وَلِرَسُولِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُجْزِي عَنْكَ الثُّلُثُ",
                "id": "Telah mengabarkan kepada kami [Abdurrahman bin Ibrahim Ad Dimasyqi Duhaim] telah menceritakan kepada kami [Sa'id? bin Maslamah] dari [Isma'il bin Umayyah] dari [Az Zuhri] dari [Abdurrahman bin Abu Lubabah] bahwa [Abu Lubabah] telah mengabarkan kepadanya, bahwa tatkala Rasulullah shallallahu 'alaihi wasallam ridla kepadanya, ia berkata, \"Wahai Rasulullah, sesungguhnya di antara bukti dari taubatku adalah meninggalkan kaumku dan tinggal di dekatmu, serta memberikan sebagian dari hartaku sebagai sedekah kepada Allah dan rasul-Nya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Cukup bagimu mensedekahkan sepertiga hartamu.\""
            },
            {
                "number": 1247,
                "arab": " أَخْبَرَنَا يَعْلَى وَأَحْمَدُ بْنُ خَالِدٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ عَنْ مَحْمُودِ بْنِ لَبِيدٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ بَيْنَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَ رَجُلٌ بِمِثْلِ الْبَيْضَةِ مِنْ ذَهَبٍ أَصَابَهَا فِي بَعْضِ الْمَغَازِي قَالَ أَحْمَدُ فِي بَعْضِ الْمَعَادِنِ وَهُوَ الصَّوَابُ فَقَالَ يَا رَسُولَ اللَّهِ خُذْهَا مِنِّي صَدَقَةً فَوَاللَّهِ مَا لِي مَالٌ غَيْرَهَا فَأَعْرَضَ عَنْهُ ثُمَّ جَاءَهُ عَنْ رُكْنِهِ الْأَيْسَرِ فَقَالَ مِثْلَ ذَلِكَ ثُمَّ جَاءَهُ مِنْ بَيْنِ يَدَيْهِ فَقَالَ مِثْلَ ذَلِكَ ثُمَّ قَالَ هَاتِهَا مُغْضَبًا فَحَذَفَهُ بِهَا حَذْفَةً لَوْ أَصَابَهُ لَأَوْجَعَهُ أَوْ عَقَرَهُ ثُمَّ قَالَ يَعْمِدُ أَحَدُكُمْ إِلَى مَالِهِ لَا يَمْلِكُ غَيْرَهُ فَيَتَصَدَّقُ بِهِ ثُمَّ يَقْعُدُ يَتَكَفَّفُ النَّاسَ إِنَّمَا الصَّدَقَةُ عَنْ ظَهْرِ غِنًى خُذْ الَّذِي لَكَ لَا حَاجَةَ لَنَا بِهِ فَأَخَذَ الرَّجُلُ مَالَهُ وَذَهَبَ قَالَ أَبُو مُحَمَّد كَانَ مَالِكٌ يَقُولُ إِذَا جَعَلَ الرَّجُلُ مَالَهُ فِي الْمَسَاكِينِ يَتَصَدَّقُ بِثُلُثِ مَالِهِ",
                "id": "Telah mengabarkan kepada kami [Ya'la] dan [Ahmad bin Khalid] dari [Muhammad bin Ishaq] dari ['Ashim bin Umar bin Qatadah] dari [Mahmud bin Labid] dari [Jabir bin Abdullah] ia berkata, \"Ketika kami bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba ada seorang laki-laki yang datang membawa emas seperti telur yang ia dapatkan di sebagian peperangan.\" Ahmad menyebutkan, 'Pada sebagian barang tambang.' Dan itu adalah yang benar. Laki-laki itu lalu berkata, \"Wahai Rasulullah, ambillah ini dariku sebagai sedekah. Demi Allah, aku tidak memiliki harta selainnya.\" Lalu beliau berpaling darinya, laki-laki itu lalu datang dari sisi kanan beliau dan berkata seperti itu. Kemudian datang lagi dari depan beliau dan berkata seperti itu. Kemudian dalam keadaan marah beliau berkata: \"Berikan.\" Kemudian beliau melemparkan emas tersebut, sekiranya mengenai laki-laki tersebut niscaya akan membuatnya sakit dan terluka. Setelah itu beliau beliau bersabda: \"Salah seorang di antara kalian mengambil hartanya, lalu mensedekahkannya, padahal ia tidak memiliki selainnya. Kemudian ia duduk dan meminta-minta kepada orang. Sesungguhnya sedekah adalah dalam keadaan lebih. Ambillah milikmu, kami tidak membutuhkannya.\" Kemudian orang tersebut mengambil hartanya dan pergi.\" Abu Muhammad berkata, \"Malik berkata, \"Jika seseorang memberikan hartanya untuk orang-orang miskin, maka hendaknya ia bersedekah dari sepertiga hartanya.\""
            },
            {
                "number": 1248,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ قَالَ سَمِعْتُ عُمَرَ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَتَصَدَّقَ فَوَافَقَ ذَلِكَ مَالًا عِنْدِي فَقُلْتُ الْيَوْمَ أَسْبِقُ أَبَا بَكْرٍ إِنْ سَبَقْتُهُ يَوْمًا فَجِئْتُ بِنِصْفِ مَالِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَبْقَيْتَ لِأَهْلِكَ قُلْتُ مِثْلَهُ قَالَ فَأَتَى أَبُو بَكْرٍ بِكُلِّ مَا عِنْدَهُ فَقَالَ يَا أَبَا بَكْرٍ مَا أَبْقَيْتَ لِأَهْلِكَ فَقَالَ أَبْقَيْتُ لَهُمْ اللَّهَ وَرَسُولَهُ فَقُلْتُ لَا أُسَابِقُكَ إِلَى شَيْءٍ أَبَدًا",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hisyam bin Sa'd] dari [Zaid bin Aslam] dari [Ayahnya] ia berkata, aku mendengar [Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami agar bersedekah, dan saat itu bertepatan saat aku mempunyai uang. Maka aku pun berkata, \"Jika hari ini aku bisa bersegera, maka aku akan dapat mendahului Abu Bakar.\" Kemudian aku datang dengan membawa setengah hartaku, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah yang engkau tinggalkan untuk keluargamu?\" Aku lantas menjawab, \"Harta yang sama seperti itu.\" Umar berkata, \"Abu Bakar kemudian datang dengan membawa seluruh yang ia miliki.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Wahai Abu Bakar, apa yang engkau tinggalkan untuk keluargamu?\" Ia menjawab, \"Aku tinggalkan untuk mereka Allah dan Rasul-Nya.\" Maka aku katakan, \"Selamanya aku tidak akan bisa mendahuluimu dalam beramal apapun.\" "
            },
            {
                "number": 1249,
                "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ الْفِطْرِ مِنْ رَمَضَانَ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ عَلَى كُلِّ حُرٍّ وَعَبْدٍ ذَكَرٍ أَوْ أُنْثَى مِنْ الْمُسْلِمِينَ قِيلَ لِأَبِي مُحَمَّدٍ تَقُولُ بِهِ قَالَ مَالِكٌ كَانَ يَقُولُ بِهِ",
                "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Abdullah bin Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah mewajibkan zakat fitrah pada bulan Ramadan satu sha' kurma atau satu sha' gandum atas setiap orang yang merdeka, hamba sahaya, laki-laki atau perempuan dari kalangan Muslimin.\" Abu Muhammad ditanya, \"Apakah engkau berpendapat seperti itu?\" Ia menjawab, \"Malik berpendapat seperti itu.\" "
            },
            {
                "number": 1250,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِزَكَاةِ الْفِطْرِ عَنْ كُلِّ صَغِيرٍ وَكَبِيرٍ حُرٍّ أَوْ عَبْدٍ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ تَمْرٍ قَالَ ابْنُ عُمَرَ فَعَدَلَهُ النَّاسُ بِمُدَّيْنِ مِنْ بُرٍّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk mengeluarkan zakat fitrah dari setiap anak kecil dan orang dewasa, orang merdeka atau hamba sahaya, yakni satu sha' gandum atau satu sha' kurma.\" Ibnu Umar berkata, \"Orang-orang menyamakannya dengan dua mud gandum.\" "
            },
            {
                "number": 1251,
                "arab": " حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ كُنَّا نُخْرِجُ زَكَاةَ الْفِطْرِ إِذْ كَانَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كُلِّ صَغِيرٍ وَكَبِيرٍ حُرٍّ وَمَمْلُوكٍ صَاعًا مِنْ طَعَامٍ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ أَقِطٍ أَوْ صَاعًا مِنْ زَبِيبٍ فَلَمْ يَزَلْ ذَلِكَ كَذَلِكَ حَتَّى قَدِمَ عَلَيْنَا مُعَاوِيَةُ الْمَدِينَةَ حَاجًّا أَوْ مُعْتَمِرًا فَقَالَ إِنِّي أَرَى مُدَّيْنِ مِنْ سَمْرَاءِ الشَّامِ يَعْدِلُ صَاعًا مِنْ التَّمْرِ فَأَخَذَ النَّاسُ بِذَلِكَ قَالَ أَبُو سَعِيدٍ أَمَّا أَنَا فَلَا أَزَالُ أُخْرِجُهُ كَمَا كُنْتُ أُخْرِجُهُ قَالَ أَبُو مُحَمَّد أَرَى صَاعًا مِنْ كُلِّ شَيْءٍ",
                "id": "Telah mengabarkan kepada kami [Utsman bin Umar] telah menceritakan kepada kami [Daud bin Qais] dari ['Iyadl bin Abdullah] dari [Abu Sa'id Al Khudri] ia berkata, \"Saat Rasulullah shallallahu 'alaihi wasallam masih ada mengeluarkan zakat fitrah untuk setiap anak-anak, orang dewasa yang merdeka dan hamba sahaya satu sha' makanan, atau satu sha' kurma, atau satu sha' gandum, atau satu sha' keju, atau satu sha' kismis. Dan tetap seperti itu hingga Mu'awiyah datang kepada kami di Madinah dalam rangka ibadah haji atau umrah. Ia berkata, \"Aku melihat dua mud gandum Syam sama dengan satu sha' kurma.\" Kemudian orang-orang mengambil pendapat itu.\" Abu Sa'id berkata, \"Adapun aku, maka aku masih tetap mengeluarkannya sebagaimana dahulu aku mengeluarkannya.\" Abu Muhammad berkata, \"Menurutku satu sha' itu berlaku untuk semua jenis (makanan).\""
            },
            {
                "number": 1252,
                "arab": " حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدِ بْنِ أَبِي سَرْحٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ كُنَّا نُخْرِجُ زَكَاةَ الْفِطْرِ مِنْ رَمَضَانَ صَاعًا مِنْ طَعَامٍ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ زَبِيبٍ أَوْ صَاعًا مِنْ أَقِطٍ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ سُفْيَانَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ قَالَ كُنَّا نُعْطِي عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Zaid bin Aslam] dari ['Iyadl bin Abdullah bin Sa'd bin Abu Sarh] dari [Abu Sa'id Al Khudri] ia berkata, \"Dahulu kami mengeluarkan zakat fitrah pada bulan Ramadan satu sha' makanan, atau satu sha' kurma, atau satu sha' gandum, atau satu sha' kismis, atau satu sha keju.\" Telah mengabarkan kepada kami ['ubaidhullah bin Musa] dari [Sufyan] dari [Zaid bin Aslam] dari ['Iyadl bin Abdullah] dari [Abu Sa'id] ia berkata, \"Dahulu kami pada masa Nabi shallallahu 'alaihi wasallam memberi.... kemudian ia menyebutkan seperti itu.\""
            },
            {
                "number": 1253,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ خَالِدٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِمَاسَةَ قَالَ سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَدْخُلُ الْجَنَّةَ صَاحِبُ مَكْسٍ قَالَ قَالَ أَبُو مُحَمَّد يَعْنِي عَشَّارًا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Khalid] telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Yazid bin Abu Habib] dari ['Abdurrahman bin Syamasah] ia berkata, aku mendengar ['Uqbah bin 'Amir] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak masuk Surga pemungut pajak.\" Abu Muhammad berkata, \"Yaitu orang yang mengambil berlawanan dengan hukum syari'at.\""
            },
            {
                "number": 1254,
                "arab": " أَخْبَرَنَا عَاصِمُ بْنُ يُوسُفَ حَدَّثَنَا أَبُو بَكْرٍ عَنْ عَاصِمٍ عَنْ أَبِي وَائِلٍ عَنْ مَسْرُوقٍ عَنْ مُعَاذٍ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ فَأَمَرَنِي أَنْ آخُذَ مِنْ الثِّمَارِ مَا سُقِيَ بَعْلًا الْعُشْرَ وَمَا سُقِيَ بِالسَّانِيَةِ فَنِصْفَ الْعُشْرِ",
                "id": "Telah mengabarkan kepada kami ['Ashim bin Yusuf] telah menceritakan kepada kami [Abu Bakr] dari ['Ashim] dari [Abu Wail] dari [Masruq] dari [Mu'adz] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutusku ke Yaman dan memerintahkan agar aku mengambil buah-buahan yang disirami dengan hujan sepersepuluh, dan yang disirami menggunakan tenaga unta seperdua puluh.\" "
            },
            {
                "number": 1255,
                "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَأَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ جُرْحُ الْعَجْمَاءِ جُبَارٌ وَالْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمُسُ",
                "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari [Sa'id bin Al Musayyab] dan [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Luka yang diakibatkan oleh binatang ternak tidak ada jaminannya, orang yang (mati) masuk sumur tidak ada jaminan, dan pada barang terpendam zakatnya adalah seperlima.\" "
            },
            {
                "number": 1256,
                "arab": " أَخْبَرَنَا أَبُو الْيَمَانِ الْحَكَمُ بْنُ نَافِعٍ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ أَبِي حُمَيْدٍ الْأَنْصَارِيِّ ثُمَّ السَّاعِدِيِّ أَنَّهُ أَخْبَرَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَعْمَلَ عَامِلًا عَلَى الصَّدَقَةِ فَجَاءَهُ الْعَامِلُ حِينَ فَرَغَ مِنْ عَمَلِهِ فَقَالَ يَا رَسُولَ اللَّهِ هَذَا الَّذِي لَكُمْ وَهَذَا أُهْدِيَ لِي فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَلَّا قَعَدْتَ فِي بَيْتِ أَبِيكَ وَأُمِّكَ فَنَظَرْتَ أَيُهْدَى لَكَ أَمْ لَا ثُمَّ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشِيَّةً بَعْدَ الصَّلَاةِ عَلَى الْمِنْبَرِ فَتَشَهَّدَ وَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ أَمَّا بَعْدُ مَا بَالُ الْعَامِلِ نَسْتَعْمِلُهُ فَيَأْتِينَا فَيَقُولُ هَذَا مِنْ عَمَلِكُمْ وَهَذَا أُهْدِيَ لِي فَهَلَّا قَعَدَ فِي بَيْتِ أَبِيهِ وَأُمِّهِ فَيَنْظُرَ هَلْ يُهْدَى لَهُ أَمْ لَا وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَا يَغُلُّ أَحَدُكُمْ مِنْهَا شَيْئًا إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ يَحْمِلُهُ عَلَى عُنُقِهِ إِنْ كَانَ بَعِيرًا جَاءَ بِهِ لَهُ رُغَاءٌ وَإِنْ كَانَتْ بَقَرَةً جَاءَ بِهَا لَهَا خُوَارٌ وَإِنْ كَانَتْ شَاةً جَاءَ بِهَا تَيْعَرُ فَقَدْ بَلَّغْتُ قَالَ أَبُو حُمَيْدٍ ثُمَّ رَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ حَتَّى إِنَّا لَنَنْظُرُ إِلَى عُفْرَةِ إِبْطَيْهِ قَالَ أَبُو حُمَيْدٍ وَقَدْ سَمِعَ ذَلِكَ مَعِي مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْدُ بْنُ ثَابِتٍ فَسَلُوهُ",
                "id": "Telah mengabarkan kepada kami [Abu Al Yaman Al Hakam bin Nafi'] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah menceritakan kepadaku ['Urwah bin Az Zubair] dari [Abu Humaid Al Anshari As Sa'idi], bahwa ia mengabarkan kepadanya, bahwa Nabi shallallahu 'alaihi wasallam menggunakan pekerja untuk mengurusi zakat. Kemudian pekerja tersebut datang kepadanya saat pekerjaannya telah selesai. Ia berkata, \"Wahai Rasulullah, ini yang menjadi bagian anda dan yang ini dihadiahkan kepadaku.\" Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Perhatikanlah, jika kamu duduk di rumah bapak dan ibumu, apakah engkau akan mendapatkan hadiah atau tidak?\" Kemudian setelah sholat, Nabi shallallahu 'alaihi wasallam berdiri di atas mimbar seraya mengucapkan syahadat dan memuji Allah dengan pujian yang menjadi milik-Nya. Kemudian beliau bersabda: \"Bagaimana dengan seorang pekerja yang kami pekerjakan, kemudian datang kepada kami dan berkata, 'Ini hasil dari kerja anda dan ini dihadiahkan kepadaku.' Lihatlah, jika engkau duduk di rumah bapak dan ibumu, apakah engkau akan diberi hadiah atau tidak? Demi Dzat yang jiwa Muhammad ada di tangan-Nya, tidaklah seseorang di antara kalian mengambil sesuatupun darinya yang bukan haknya kecuali pada hari Kiamat ia datang dengan membawanya pada lehernya, apabila sesuatu tersebut adalah unta maka ia datang membawanya dengan bersuara unta, apabila sesuatu tersebut adalah sapi maka ia datang membawanya dengan bersuara sapi, dan apabila sesuatu tersebut adalah kambing maka ia datang membawanya dengan suara kambing, sungguh aku telah menyampaikannya.\" Abu Humaid berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam mengangkat kedua tangannya hingga kami melihat putihnya kedua ketiak beliau.\" Abu Humaid berkata, \"Sungguh, Zaid bin Tsabit bersamaku telah mendengar hal itu tersebut dari Nabi shallallahu 'alaihi wasallam, maka tanyakanlah kepada dia.\" "
            },
            {
                "number": 1257,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا هُشَيْمٌ عَنْ دَاوُدَ وَمُجَالِدٍ عَنْ الشَّعْبِيِّ عَنْ جَرِيرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَاءَكُمْ الْمُصَدِّقُ فَلَا يَصْدُرَنَّ عَنْكُمْ إِلَّا وَهُوَ رَاضٍ حَدَّثَنِي مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ أَبِي إِسْحَقَ الْفَزَارِيِّ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ عَامِرٍ عَنْ جَرِيرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Aun] telah mengabarkan kepada kami [Husyaim] dari [Daud] serta [Mujalid] dari [Asy Sya'bi] dari [Jarir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila telah datang kepada kalian petugas pengambil zakat, maka janganlah kembali dari kalian kecuali ia dalam keadaan ridla.\" Telah menceritakan kepadaku [Muhammad bin 'Uyainah] dari [Abu Ishaq Al Fazari] dari [Daud bin Abu Hindun] dari ['Amir] dari [Jarir] dari Nabi shallallahu 'alaihi wasallam seperti itu.\" "
            },
            {
                "number": 1258,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ أَخْبَرَنَا مَالِكٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَمْرِو بْنِ مُعَاذٍ الْأَشْهَلِيِّ عَنْ جَدَّتِهِ يُقَالُ لَهَا حَوَّاءُ قَالَتْ قَالَ رَسُولُ اللَّهِ يَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِسَاءَ الْمُسْلِمَاتِ لَا تَحْقِرَنَّ إِحْدَاكُنَّ لِجَارَتِهَا وَلَوْ كُرَاعُ شَاةٍ مُحَرَّقٌ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah mengabarkan kepada kami [Malik] dari [Zaid bin Aslam] dari ['Amru bin Mu'adz Al Asyhali] dari neneknya yang dipanggil [Hawwa`], ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai para wanita Muslimah, jangan sekali-kali kalian meremehkan untuk berbuat baik kepada tetangganya meskipun hanya dengan betis kambing yang terbakar.\""
            },
            {
                "number": 1259,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا أَبَانُ بْنُ عَبْدِ اللَّهِ الْبَجَلِيُّ حَدَّثَنَا عُثْمَانُ بْنُ أَبِي حَازِمٍ عَنْ صَخْرِ بْنِ الْعَيْلَةِ قَالَ أُخِذَتْ عَمَّةُ الْمُغِيرَةِ بْنِ شُعْبَةَ فَقَدِمَتْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَمَّتَهُ فَقَالَ يَا صَخْرُ إِنَّ الْقَوْمَ إِذَا أَسْلَمُوا أَحْرَزُوا أَمْوَالَهُمْ وَدِمَاءَهُمْ فَادْفَعْهَا إِلَيْهِ وَكَانَ مَاءٌ لِبَنِي سُلَيْمٍ فَأَسْلَمُوا فَسَأَلُوهُ ذَلِكَ فَدَعَانِي فَقَالَ يَا صَخْرُ إِنَّ الْقَوْمَ إِذَا أَسْلَمُوا أَحْرَزُوا أَمْوَالَهُمْ وَدِمَاءَهُمْ فَادْفَعْهَا إِلَيْهِمْ فَدَفَعْتُهُ أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا أَبَانُ بْنُ عَبْدِ اللَّهِ حَدَّثَنِي عُثْمَانُ بْنُ أَبِي حَازِمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ صَخْرٍ أَطْوَلَ مِنْ حَدِيثِ أَبِي نُعَيْمٍ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Aban bin Abdullah Al Bajali] telah menceritakan kepada kami [Utsman bin Abu Hazim] dari [Shakhr bin Al 'Ailah] ia berkata, \"Bibi Al Mughirah bin Syu'bah tertawan dan menghadap Rasulullah shallallahu 'alaihi wasallam, lalu Al Mughirah meminta bibinya kepada Nabi shallallahu 'alaihi wasallam. Maka beliau pun bersabda: \"Wahai Shakhr, sesungguhnya sebuah kaum apabila telah masuk Islam maka mereka telah menjaga harta dan darah mereka, maka serahkan kepadanya.\" Dahulu Bani Sulaim memiliki air, kemudian mereka masuk Islam dan memintanya kepada beliau. Lalu beliau memanggilku bersabda: \"Wahai Shakhr, sesungguhnya sebuah kaum apabila telah masuk Islam maka mereka telah menjaga harta dan darah mereka, maka serahkan kepada mereka.\" Lalu aku menyerahkan air tersebut kepada mereka.\" Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Aban bin Abdullah] telah menceritakan kepadaku [Utsman bin Abu Hazim] dari [Ayahnya] dari kakeknya [Shakhr] dan haditsnya lebih panjang dari hadits Abu Nu'aim.\" "
            },
            {
                "number": 1260,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ الْمُغِيرَةِ عَنْ عِيسَى بْنِ يُونُسَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا تَصَدَّقَ امْرُؤٌ بِصَدَقَةٍ مِنْ كَسْبٍ طَيِّبٍ وَلَا يَقْبَلُ اللَّهُ إِلَّا طَيِّبًا إِلَّا وَضَعَهَا حِينَ يَضَعُهَا فِي كَفِّ الرَّحْمَنِ وَإِنَّ اللَّهَ لَيُرَبِّي لِأَحَدِكُمْ التَّمْرَةَ كَمَا يُرَبِّي أَحَدُكُمْ فَلُوَّهُ أَوْ فَصِيلَهُ حَتَّى تَكُونَ مِثْلَ أُحُدٍ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin Al Mughirah] dari [Isa bin Yunus] dari [Yahya bin Sa'id] dari [Sa'id bin Yasar] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang bersedekah dengan sesuatu yang berasal dari usaha yang baik, dan tidak Allah menerima kecuali yang baik, melainkan ia telah meletakkannya ketika ia meletakkannya di telapak tangan Allah yang Maha Pengasih. Dan sesungguhnya Allah akan mengembangkan satu biji kurma salah seorang dari kalian sebagaimana salah seorang dari kalian mengembangkan anak kuda atau anak unta hingga menjadi seperti gunung Uhud.\""
            },
            {
                "number": 1261,
                "arab": " حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا نَقَصَتْ صَدَقَةٌ مِنْ مَالٍ وَمَا زَادَ اللَّهُ عَبْدًا بِعَفْوٍ إِلَّا عِزًّا وَمَا تَوَاضَعَ أَحَدٌ لِلَّهِ إِلَّا رَفَعَهُ اللَّهُ",
                "id": "Telah mengabarkan kepada kami [Abu Ar Rabi' Az Zahrani] telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Al 'Ala`] dari [Ayahnya] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Harta tidak akan berkurang karena sedekah, dan tidaklah Allah menambahkan bagi seorang hamba karena sikap memberi maaf kecuali kemuliaan, dan tidaklah seseorang merendahkan diri karena Allah melainkan Allah mengangkat derajatnya.\""
            },
            {
                "number": 1262,
                "arab": " أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدَّهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي كُلِّ إِبِلٍ سَائِمَةٍ فِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ لَا تُفَرَّقُ إِبِلٌ عَنْ حِسَابِهَا مَنْ أَعْطَاهَا مُؤْتَجِرًا بِهَا فَلَهُ أَجْرُهَا وَمَنْ مَنَعَهَا فَإِنَّا آخِذُوهَا وَشَطْرَ إِبِلِهِ عَزْمَةٌ مِنْ عَزَمَاتِ اللَّهِ لَا يَحِلُّ لِآلِ مُحَمَّدٍ مِنْهَا شَيْءٌ",
                "id": "Telah mengabarkan kepada kami [An Nadlr bin Syumail] telah menceritakan kepada kami [Bahz bin Hakim] dari [Ayahnya] dari [Kakeknya] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada setiap empat puluh unta yang digembala, zakatnya adalah satu ekor bintu Labun (anak unta yang berumur dua tahun). Unta tidak boleh dipisahkan dari bilangan jumlahnya, barangsiapa memberinya dengan tujuan untuk mendapatkan pahala maka baginya pahalanya, dan barangsiapa menahannya maka kami akan mengambilnya ditambah setengah untanya. Itulah kewajiban di antara kewajiban-kewajiban dari Allah, dan tidak halal bagi keluarga Muhammad sedikitpun darinya.\""
            },
            {
                "number": 1263,
                "arab": " حَدَّثَنَا مُسَدَّدٌ وَأَبُو نُعَيْمٍ قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ هَارُونَ بْنِ رِيَابٍ حَدَّثَنِي كِنَانَةُ بْنُ نُعَيْمٍ عَنْ قَبِيصَةَ بْنِ مُخَارِقٍ الْهِلَالِيِّ قَالَ تَحَمَّلْتُ بِحَمَالَةٍ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُهُ فِيهَا فَقَالَ أَقِمْ يَا قَبِيصَةُ حَتَّى تَأْتِيَنَا الصَّدَقَةُ فَنَأْمُرَ لَكَ بِهَا ثُمَّ قَالَ يَا قَبِيصَةُ إِنَّ الْمَسْأَلَةَ لَا تَحِلُّ إِلَّا لِأَحَدِ ثَلَاثَةٍ رَجُلٍ تَحَمَّلَ حَمَالَةً فَحَلَّتْ لَهُ الْمَسْأَلَةُ فَسَأَلَ حَتَّى يُصِيبَهَا ثُمَّ يُمْسِكَ وَرَجُلٍ أَصَابَتْهُ جَائِحَةٌ فَاجْتَاحَتْ مَالَهُ فَحَلَّتْ لَهُ الْمَسْأَلَةُ فَسَأَلَ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ قَالَ سِدَادًا مِنْ عَيْشٍ وَرَجُلٍ أَصَابَتْهُ فَاقَةٌ حَتَّى يَقُولَ ثَلَاثَةٌ مِنْ ذَوِي الْحِجَى مِنْ قَوْمِهِ قَدْ أَصَابَ فُلَانًا الْفَاقَةُ فَحَلَّتْ لَهُ الْمَسْأَلَةُ فَسَأَلَ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ سِدَادًا مِنْ عَيْشٍ ثُمَّ يُمْسِكَ وَمَا سِوَاهُنَّ مِنْ الْمَسْأَلَةِ سُحْتٌ يَا قَبِيصَةُ يَأْكُلُهَا صَاحِبُهَا سُحْتًا",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Abu Nu'aim] mereka berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Harun bin Riyab] telah menceritakan kepadaku [Kinanah bin Nu'aim] dari [Qabishah bin Mukhariq Al Hilali] ia berkata, \"Aku menanggung sebuah denda, maka aku pun datang menemui Nabi shallallahu 'alaihi wasallam dan menanyakannya kepada beliau, lalu beliau bersabda: \"Tunggulah wahai Qabishah, hingga datang Zakat kepada kami dan kami bisa memberikannya kepada kamu.\" Kemudian beliau bersabda lagi: \"Wahai Qabishah, sesungguhnya meminta-minta tidaklah halal kecuali bagi salah satu dari tiga orang; seseorang yang menanggung denda, ia boleh meminta. Maka hendaklah ia meminta-minta sampai mendapatkannya, kemudian ia menahan diri. Seorang laki-laki yang tertimpa musibah yang menghancurkan hartanya, ia boleh meminta-minta, maka hendaklah ia meminta hingga mendapatkan penopang hidup atau sesuatu yang dapat menutupi kebutuhan hidup. Dan seseorang yang tertimpa kefakiran hingga tiga orang yang berakal sempurna dari kaumnya mengatakan 'Fulan telah tertimpa kefakiran', ia boleh meminta-minta. Maka hendaklah ia meminta-minta sampai mendapatkan penopang hidup atau penutup kebutuhan hidup, kemudian menahan diri. Wahai Qabishah, meminta-minta dari selain itu adalah sesuatu yang dosa, jika ia makan maka itu dosa.\""
            },
            {
                "number": 1264,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ عَنْ عَبَّادِ بْنِ الْعَوَّامِ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ أَيُّوبَ بْنِ بَشِيرٍ عَنْ حَكِيمِ بْنِ حِزَامٍ أَنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّدَقَاتِ أَيُّهَا أَفْضَلُ قَالَ عَلَى ذِي الرَّحِمِ الْكَاشِحِ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Sulaiman] dari ['Abbad bin Al 'Awwam] dari [Sufyan bin Husain] dari [Az Zuhri] dari [Ayyub bin Basyir] dari [Hakim bin Hizam], bahwa seorang laki-laki bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai sedekah apakah yang paling utama?\" Beliau bersabda: \"Sedekah kepada orang yang memiliki hubungan kerabat yang menyembunyikan permusuhannya.\""
            },
            {
                "number": 1265,
                "arab": " أَخْبَرَنَا أَبُو حَاتِمٍ الْبَصْرِيُّ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ أُمِّ الرَّائِحِ بِنْتِ صُلَيْعٍ عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ ذَكَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الصَّدَقَةَ عَلَى الْمِسْكِينِ صَدَقَةٌ وَإِنَّهَا عَلَى ذِي الرَّحِمِ اثْنَتَانِ صَدَقَةٌ وَصِلَةٌ",
                "id": "Telah mengabarkan kepada kami [Abu Hatim Al Bashri] telah menceritakan kepada kami [Ibnu 'Aun] dari [Hafshah binti Sirin] dari [Ummu Ar Raih binti Shulai'] dari [Salman bin 'Amir Adl Dlabbi] ia menyebutkan, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya bersedekah kepada orang miskin hanya sebuah sedekah, dan sedekah kepada orang yang memiliki hubungan kerabat adalah dua pahala; pahala sedekah dan pahala menyambung hubungan kekerabatan.\""
            },
            {
                "number": 1266,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ ابْنِ عُيَيْنَةَ قَالَ وَقَدْ سَمِعْتُهُ مِنَ الثَّوْرِيِّ عَنْ عَاصِمٍ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ الرَّبَابِ عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ يَرْفَعُهُ قَالَ الصَّدَقَةُ عَلَى الْمِسْكِينِ صَدَقَةٌ وَهِيَ عَلَى ذِي الرَّحِمِ اثْنَتَانِ صَدَقَةٌ وَصِلَةٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Ibnu 'Uyainah] ia berkata, aku telah mendengarnya dari [Ats Tsauri] dari ['Ashim] dari [Hafshah binti Sirin] dari [Ar Rabab] dari [Salman bin 'Amir Adl Dabbi] dan ia memarfu'kannya, ia berkata, \"Bersedekah kepada orang miskin bernilai satu sedekah, dan sedekah kepada orang yang memiliki hubungan kerabat mempunyai dua nilai; pahala sedekah dan pahala menyambung hubungan kekerabatan.\""
            },
            {
                "number": 1267,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ عَمْرِو بْنِ قَيْسٍ عَنْ أَبِي إِسْحَقَ عَنْ صِلَةَ بْنِ زُفَرَ قَالَ كُنَّا عِنْدَ عَمَّارِ بْنِ يَاسِرٍ فَأُتِيَ بِشَاةٍ مَصْلِيَّةٍ فَقَالَ كُلُوا فَتَنَحَّى بَعْضُ الْقَوْمِ فَقَالَ إِنِّي صَائِمٌ فَقَالَ عَمَّارُ بْنُ يَاسِرٍ مَنْ صَامَ الْيَوْمَ الَّذِي يُشَكُّ فِيهِ فَقَدْ عَصَى أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari ['Amru bin Qais] dari [Abu Ishaq] dari [Shilah bin Zufar] ia berkata, \"Kami pernah bersama ['Ammar bin Yasir], kemudian ia diberi seekor kambing bakar, lalu ia berkata, \"Makanlah.\" Lalu sebagian orang menjauh dan berkata, \"Aku sedang berpuasa.\" 'Ammar bin Yasir lantas berkata, \"Barangsiapa berpuasa pada hari yang diragukan, sungguh ia telah durhaka kepada Abu Al Qasim shallallahu 'alaihi wasallam.\" "
            },
            {
                "number": 1268,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ حَدَّثَنَا حَاتِمُ بْنُ أَبِي صَغِيرَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ قَالَ أَصْبَحْتُ فِي يَوْمٍ قَدْ أُشْكِلَ عَلَيَّ مِنْ شَعْبَانَ أَوْ مِنْ شَهْرِ رَمَضَانَ فَأَصْبَحْتُ صَائِمًا فَأَتَيْتُ عِكْرِمَةَ فَإِذَا هُوَ يَأْكُلُ خُبْزًا وَبَقْلًا فَقَالَ هَلُمَّ إِلَى الْغَدَاءِ فَقُلْتُ إِنِّي صَائِمٌ فَقَالَ أُقْسِمُ بِاللَّهِ لَتُفْطِرَنَّ فَلَمَّا رَأَيْتُهُ حَلَفَ وَلَا يَسْتَثْنِي تَقَدَّمْتُ فَعَذَّرْتُ وَإِنَّمَا تَسَحَّرْتُ قُبَيْلَ ذَلِكَ ثُمَّ قُلْتُ هَاتِ الْآنَ مَا عِنْدَكَ فَقَالَ حَدَّثَنَا ابْنُ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صُومُوا لِرُؤْيَتِهِ وَأَفْطِرُوا لِرُؤْيَتِهِ فَإِنْ حَالَ بَيْنَكُمْ وَبَيْنَهُ سَحَابٌ فَكَمِّلُوا الْعِدَّةَ ثَلَاثِينَ وَلَا تَسْتَقْبِلُوا الشَّهْرَ اسْتِقْبَالًا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Isma'il bin 'Ulaiyyah] telah menceritakan kepada kami [Hatim bin Abu Shaghirah] dari [Simak bin Harb] ia berkata, \"Aku berpuasa pada hari yang aku masih ragu, apakah bulan Sya'ban atau Ramadan. Maka aku datang menemui Ikrimah, ternyata ia sedang makan roti dan sayur, ia lalu berkata, 'Kemarilah makan siang.' Kemudian aku katakan, \"Aku sedang berpuasa.\" [Ikrimah] berkata lagi, \"Aku bersumpah dengan nama Allah, hendaklah engkau harus berbuka! \" Maka tatkala aku melihatnya bersumpah dan tidak mengucapkan insyaallah, aku maju dan mengungkapkan alasan, \"Sesungguhnya sebelum itu aku telah makan sahur. Sekarang sampaikanlah alasanmu kepadaku.\" Lalu ia berkata, \" [Ibnu Abbas] menceritakan kepada kami, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berpuasalah karena melihatnya (hilal) dan berbukalah karena melihatnya. Jika terdapat awan yang menghalangi kalian untuk melihatnya, maka sempurnakanlah jumlah bulan menjadi tiga puluh hari, dan janganlah kalian menyambut bulan Ramadan dengan berpuasa.\""
            },
            {
                "number": 1269,
                "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ رَمَضَانَ فَقَالَ لَا تَصُومُوا حَتَّى تَرَوْا الْهِلَالَ وَلَا تُفْطِرُوا حَتَّى تَرَوْهُ فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدُرُوا لَهُ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Umar], bahwa Rasulullah shallallahu 'alaihi wasallam menyebut-nyebut tentang bulan Ramadan, beliau bersabda: \"Janganlah kalian berpuasa hingga melihat hilal, dan janganlah berbuka hingga kalian melihatnya. Jika kalian tertutup oleh awan, maka genapkan jumlahnya tiga puluh hari.\""
            },
            {
                "number": 1270,
                "arab": " حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ حَدَّثَنِي مُحَمَّدُ بْنُ زِيَادٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ قَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صُومُوا لِرُؤْيَتِهِ وَأَفْطِرُوا لِرُؤْيَتِهِ فَإِنْ غُمَّ عَلَيْكُمْ الشَّهْرُ فَعُدُّوا ثَلَاثِينَ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepadaku [Muhammad bin Ziyad] ia berkata, aku mendengar [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda, atau Abu Al Qasim shallallahu 'alaihi wasallam bersabda: \"Berpuasalah karena melihatnya dan berbukalah karena melihatnya, jika bulan tertutup oleh kalian maka genapkanlah menjadi tiga puluh hari.\""
            },
            {
                "number": 1271,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو يَعْنِي ابْنَ دِينَارٍ عَنْ مُحَمَّدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ عَجِبَ مِمَّنْ يَتَقَدَّمُ الشَّهْرَ وَيَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَيْتُمُوهُ فَصُومُوا وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا فَإِنْ غُمَّ عَلَيْكُمْ فَأَكْمِلُوا الْعِدَّةَ ثَلَاثِينَ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] telah menceritakan kepada kami [Sufyan] dari ['Amru] -yaitu Ibnu Dinar- dari [Muhammad bin Jubair] dari [Ibnu Abbas], bahwa ia heran terhadap orang yang mendahului bulan Ramadan, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian melihatnya maka berpuasalah dan apabila kalian melihatnya maka berbukalah. Jika kalian terhalang oleh awan maka sempurnakan jumlahnya tiga puluh hari.\""
            },
            {
                "number": 1272,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ سُلَيْمَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ بْنِ إِبْرَاهِيمَ حَدَّثَنِي أَبِي عَنْ أَبِيهِ وَعَمِّهِ عَنْ ابْنِ عُمَرَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَى الْهِلَالَ قَالَ اللَّهُ أَكْبَرُ اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْأَمْنِ وَالْإِيمَانِ وَالسَّلَامَةِ وَالْإِسْلَامِ وَالتَّوْفِيقِ لِمَا يُحِبُّ رَبُّنَا وَيَرْضَى رَبُّنَا وَرَبُّكَ اللَّهُ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin Sulaiman] dari ['Abdurrahman bin Utsman bin Ibrahim] telah menceritakan kepadaku [Ayahku] dari [Ayahnya] dan [Pamannya] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam apabila melihat hilal beliau berkata: \"Allahu akbar! Ya Allah, nampakkan hilal kepada kami dengan aman, iman, keselamatan, Islam dan taufiq untuk melakukan apa yang dicintai dan diridlai Tuhan kami. Tuhan kami dan Tuhan kalian adalah Allah.\""
            },
            {
                "number": 1273,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الرِّفَاعِيُّ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الْعَقَدِيُّ حَدَّثَنَا سُلَيْمَانُ بْنُ سُفْيَانَ الْمَدَنِيُّ عَنْ بِلَالِ بْنِ يَحْيَى بْنِ طَلْحَةَ عَنْ أَبِيهِ عَنْ طَلْحَةَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَى الْهِلَالَ قَالَ اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْأَمْنِ وَالْإِيمَانِ وَالسَّلَامَةِ وَالْإِسْلَامِ رَبِّي وَرَبُّكَ اللَّهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yazid Ar Rifa'i], dan [Ishaq bin Ibrahim] telah menceritakan kepada kami [Al 'Aqadi] telah menceritakan kepada kami [Sulaiman bin Sufyan Al Madani] dari [Bilal bin Yahya bin Thalhah] dari [Ayahnya] dari [Thalhah] ia berkata, \"Nabi shallallahu 'alaihi wasallam apabila melihat hilal mengucapkan: \"Ya Allah, nampakkan hilal kepada kami dengan aman, iman, keselamatan, dan Islam. Tuhan kami dan Tuhan kalian adalah Allah.\""
            },
            {
                "number": 1274,
                "arab": " أَخْبَرَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقَدَّمُوا قَبْلَ رَمَضَانَ يَوْمًا وَلَا يَوْمَيْنِ إِلَّا أَنْ يَكُونَ رَجُلًا كَانَ يَصُومُ صَوْمًا فَلْيَصُمْهُ",
                "id": "Telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mendahului Ramadan dengan berpuasa satu hari dan dua hari, kecuali seseorang yang biasa berpuasa maka hendaknya ia melakukannya.\""
            },
            {
                "number": 1275,
                "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا الشَّهْرُ تِسْعٌ وَعِشْرُونَ فَلَا تَصُومُوا حَتَّى تَرَوْهُ وَلَا تُفْطِرُوا حَتَّى تَرَوْهُ فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدُرُوا لَهُ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya bulan ada dua puluh sembilan hari, janganlah kalian berpuasa hingga melihatnya dan janganlah kalian berbuka hingga melihatnya. Jika kalian terhalangi oleh awan, maka genapkan jumlahnya.\" "
            },
            {
                "number": 1276,
                "arab": " حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ وَهْبٍ عَنْ يَحْيَى بْنِ سَالِمٍ عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ قَالَ تَرَاءَى النَّاسُ الْهِلَالَ فَأَخْبَرْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنِّي رَأَيْتُهُ فَصَامَ وَأَمَرَ النَّاسَ بِالصِّيَامِ",
                "id": "Telah menceritakan kepada kami [Marwan bin Muhammad] dari [Abdullah bin Wahb] dari [Yahya bin Salim] dari [Abu Bakr bin Nafi'] dari [Ayahnya] dari [Ibnu Umar] ia berkata, \"Orang-orang saling melihat hilal, kemudian aku memberitahukan kepada Rasulullah shallallahu 'alaihi wasallam bahwa aku telah melihatnya, kemudian beliau berpuasa dan memerintahkan orang-orang untuk berpuasa.\""
            },
            {
                "number": 1277,
                "arab": " حَدَّثَنِي عِصْمَةُ بْنُ الْفَضْلِ حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ عَنْ زَائِدَةَ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ إِنِّي رَأَيْتُ الْهِلَالَ فَقَالَ أَتَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ قَالَ نَعَمْ قَالَ يَا بِلَالُ نَادِ فِي النَّاسِ فَلْيَصُومُوا غَدًا",
                "id": "Telah menceritakan kepadaku ['Ishmah bin Al Fadll] telah menceritakan kepada kami [Husain Al Ju'fi] dari [Zaidah] dari [Simak] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Seorang Arab dusun datang menemui Nabi shallallahu 'alaihi wasallam dan berkata, \"Aku telah melihat hilal! \" Beliau lalu bersabda: \"Apakah engkau bersaksi bahwa tidak ada Tuhan yang berhak disembah kecuali Allah dan aku adalah Rasulullah?\" Ia menjawab, \"Ya.\" Beliau kemudian bersabda: \"Wahai Bilal, umumkan kepada manusia agar mereka besok berpuasa.\""
            },
            {
                "number": 1278,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ كَانَ أَصْحَابُ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ الرَّجُلُ صَائِمًا فَحَضَرَ الْإِفْطَارُ فَنَامَ قَبْلَ أَنْ يُفْطِرَ لَمْ يَأْكُلْ لَيْلَتَهُ وَلَا يَوْمَهُ حَتَّى يُمْسِيَ وَإِنَّ قَيْسَ بْنَ صِرْمَةَ الْأَنْصَارِيَّ كَانَ صَائِمًا فَلَمَّا حَضَرَ الْإِفْطَارُ أَتَى امْرَأَتَهُ فَقَالَ عِنْدَكِ طَعَامٌ فَقَالَتْ لَا وَلَكِنْ أَنْطَلِقُ فَأَطْلُبُ لَكَ وَكَانَ يَوْمَهُ يَعْمَلُ فَغَلَبَتْهُ عَيْنُهُ وَجَاءَتْ امْرَأَتُهُ فَلَمَّا رَأَتْهُ قَالَتْ خَيْبَةً لَكَ فَلَمَّا انْتَصَفَ النَّهَارُ غُشِيَ عَلَيْهِ فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَزَلَتْ هَذِهِ الْآيَةُ { أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَى نِسَائِكُمْ } فَفَرِحُوا بِهَا فَرَحًا شَدِيدًا { وَكُلُوا وَاشْرَبُوا حَتَّى يَتَبَيَّنَ لَكُمْ الْخَيْطُ الْأَبْيَضُ مِنْ الْخَيْطِ الْأَسْوَدِ }",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Musa] dari [Israil] dari [Abu Ishaq] dari [Al Bara`] ia berkata, \"Para sahabat Muhammad shallallahu 'alaihi wasallam; apabila seseorang berpuasa kemudian datang waktu berbuka, maka ia tidur sebelum berbuka, sehingga ia tidak berbuka sehari semalam hingga masuk pada waktu sore. Sesungguhnya Qais bin Shirmah Al Anshari pernah berpuasa, saat waktu berbuka tiba ia menemui isterinya dan bertanya, \"Apakah engkau memiliki makanan?\" Lalu isterinya mengatakan, \"Tidak, akan tetapi aku akan pergi dan mencari untukmu.\" Karena seharian ia lelah bekerja, maka ia pun tertidur. Maka saat isterinya melihatnya, ia berkata, \"Duhai, merugilah engkau.\" Kemudian tatkala pada pertengahan siang hari Qais bin Shirmah pingsan. Lalu hal itu diceritakan kepada Nabi shallallahu 'alaihi wasallam, kemudian turunlah ayat ini: '(Dihalalkan bagi kamu pada malam hari bulan puasa bercampur dengan isteri-isteri kamu) ' maka mereka sangat senang sekali '(dan makan minumlah hingga terang bagimu benang putih dari benang hitam) ' (Qs. Al Baqarah: 187)."
            },
            {
                "number": 1279,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ حَدَّثَنَا شَرِيكٌ عَنْ حُصَيْنٍ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ لَقَدْ جَعَلْتُ تَحْتَ وِسَادَتِي خَيْطًا أَبْيَضَ وَخَيْطًا أَسْوَدَ فَمَا تَبَيَّنَ لِي شَيْءٌ قَالَ إِنَّكَ لَعَرِيضُ الْوِسَادِ وَإِنَّمَا ذَلِكَ اللَّيْلُ مِنْ النَّهَارِ فِي قَوْلِهِ { وَكُلُوا وَاشْرَبُوا حَتَّى يَتَبَيَّنَ لَكُمْ الْخَيْطُ الْأَبْيَضُ مِنْ الْخَيْطِ الْأَسْوَدِ مِنْ الْفَجْرِ }",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Syarik] dari [Hushain] dari [Asy Sya'bi] dari ['Adi bin Hatim] ia berkata, \"Aku bertanya, \"Wahai Rasulullah, sungguh aku telah meletakkan di bawah bantalku benang putih dan benang hitam, namun tidak ada sesuatupun yang jelas bagiku?\" Beliau bersabda: \"Sungguh engkau sangat tidak faham, sesungguhnya hal itu adalah waktu malam dari waktu siang dalam firman-Nya: '(dan makan minumlah hingga terang bagimu benang putih dari benang hitam, yaitu fajar…) ' (Qs.?Al Baqarah: 187). "
            },
            {
                "number": 1280,
                "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَ تَسَحَّرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ثُمَّ قَامَ إِلَى الصَّلَاةِ قَالَ قُلْتُ كَمْ كَانَ بَيْنَ الْأَذَانِ وَالسُّحُورِ قَالَ قَدْرُ قِرَاءَةِ خَمْسِينَ آيَةً",
                "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas] dari [Zaid bin Tsabit] ia berkata, \"Kami pernah sahur bersama Rasulullah shallallahu 'alaihi wasallam. Kemudian beliau bangkit untuk melakukan sholat.\" Anas berkata, \"Aku lalu bertanya, \"Berapakah waktu antara adzan dan sahur?\" Zaid menjawab, \"Seukuran lima puluh ayat.\""
            },
            {
                "number": 1281,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ شُعْبَةَ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسَحَّرُوا فَإِنَّ فِي السُّحُورِ بَرَكَةً",
                "id": "Telah mengabarkan kepada kami [Sa'id bin 'Amir] dari [Syu'bah] dari [Abdul Aziz bin Shuhaib] dari [Anas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaklah kalian makan sahur, sesungguhnya dalam sahur terdapat berkah.\""
            },
            {
                "number": 1282,
                "arab": " حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا مُوسَى بْنُ عُلَيٍّ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ أَبِي قَيْسٍ مَوْلَى عَمْرِو بْنِ الْعَاصِ قَالَ كَانَ عَمْرُو بْنُ الْعَاصِ يَأْمُرُنَا أَنْ نَصْنَعَ لَهُ الطَّعَامَ يَتَسَحَّرُ بِهِ فَلَا يُصِيبُ مِنْهُ كَثِيرًا فَقُلْنَا لَهُ تَأْمُرُنَا بِهِ وَلَا تُصِيبُ مِنْهُ كَثِيرًا قَالَ إِنِّي لَا آمُرُكُمْ بِهِ أَنِّي أَشْتَهِيهِ وَلَكِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَصْلُ مَا بَيْنَ صِيَامِنَا وَصِيَامِ أَهْلِ الْكِتَابِ أَكْلَةُ السَّحَرِ",
                "id": "Telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Musa bin Ali] ia berkata, aku mendengar [Ayahku] menceritakan dari [Abu Qais] mantan budak 'Amru bin Al 'Ash, ia berkata, \" ['Amru bin Al 'Ash] pernah memerintahkan kami untuk membuatkan makan sahur, namun ia hanya makan sedikit. Lalu kami bertanya kepadanya, \"Anda memerintahkan kami agar membuatnya, tapi anda hanya makan sedikit?\" Ia lantas menjawab, \"Sesungguhnya aku tidak memerintahkannya kepada kalian, aku berselera makan, tetapi aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pemisah antara puasa kita dengan puasa ahli kitab adalah makan sahur.\""
            },
            {
                "number": 1283,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ شُرَحْبِيلَ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ عَنْ يَحْيَى بْنِ أَيُّوبَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَمْ يُبَيِّتْ الصِّيَامَ قَبْلَ الْفَجْرِ فَلَا صِيَامَ لَهُ قَالَ عَبْد اللَّهِ فِي فَرْضِ الْوَاجِبِ أَقُولُ بِهِ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Syurahbil] telah menceritakan kepada kami [Laits bin Sa'd] dari [Yahya bin Ayyub] dari [Abdullah bin Abu Bakr] dari [Salim bin Abdullah bin Umar] dari [Ibnu Umar] dari [Hafshah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa belum meniatkan puasa pada malam hari sebelum fajar, maka tidak ada puasa baginya.\" Abdullah berkata, \"Aku berpendapat bahwa itu dalam puasa wajib.\" "
            },
            {
                "number": 1284,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزَالُ النَّاسُ بِخَيْرٍ مَا عَجَّلُوا الْفِطْرَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan Ats Tsauri] dari [Abu Hazim] dari [Sahl bin Sa'd] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Manusia akan senantiasa berada dalam kebaikan selama mereka menyegerakan berbuka.\""
            },
            {
                "number": 1285,
                "arab": " حَدَّثَنَا عُثْمَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدَةُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَاصِمِ بْنِ عُمَرَ عَنْ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَقْبَلَ اللَّيْلُ وَأَدْبَرَ النَّهَارُ وَغَابَتْ الشَّمْسُ فَقَدْ أَفْطَرْتَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Muhammad] telah menceritakan kepada kami ['Abdah bin Hisyam bin 'Urwah] dari [Ayahnya] dari ['Ashim bin Umar] dari [Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila malam telah datang dan siang telah pergi, kemudian matahari telah tenggelam maka engkau boleh berbuka.\""
            },
            {
                "number": 1286,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ حَدَّثَنَا عَاصِمٌ عَنْ حَفْصَةَ عَنْ الرَّبَابِ الضَّبِّيَّةِ عَنْ عَمِّهَا سَلْمَانَ بْنِ عَامِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَفْطَرَ أَحَدُكُمْ فَلْيُفْطِرْ عَلَى تَمْرٍ فَإِنْ لَمْ يَجِدْ فَلْيُفْطِرْ عَلَى مَاءٍ فَإِنَّ الْمَاءَ طَهُورٌ",
                "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Tsabit bin Yazid] telah menceritakan kepada kami ['Ashim] dari [Hafshah] dari [Ar Rabbab Adl Dlabbiyyah] dari pamannya [Salman bin 'Amir], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian berbuka hendaknya dengan kurma, jika tidak mendapatkannya hendaknya dengan air, karena sesungguhnya air adalah sesuatu yang membersihkan.\""
            },
            {
                "number": 1287,
                "arab": " أَخْبَرَنَا يَعْلَى حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ فَطَّرَ صَائِمًا كُتِبَ لَهُ مِثْلُ أَجْرِهِ إِلَّا أَنَّهُ لَا يَنْقُصُ مِنْ أَجْرِ الصَّائِمِ",
                "id": "Telah mengabarkan kepada kami [Ya'la] telah menceritakan kepada kami [Abdul Malik] dari ['Atha`] dari [Zaid bin Khalid Al Juhani] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa memberi makan orang yang berpuasa (untuk berbuka), maka ia memperoleh pahala orang yang berpuasa tersebut dengan tanpa mengurangi dari pahalanya sedikitpun.\" "
            },
            {
                "number": 1288,
                "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِيَّاكُمْ وَالْوِصَالَ مَرَّتَيْنِ قَالُوا فَإِنَّكَ تُوَاصِلُ قَالَ إِنِّي لَسْتُ مِثْلَكُمْ إِنِّي أَبِيتُ يُطْعِمُنِي رَبِّي وَيَسْقِينِي",
                "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian berpuasa wishal.\" Beliau mengatakannya dua kali. Para sahabat berkata, \"Tetapi kenapa anda melakukan wishal!? Beliau menjawab: \"Sesungguhnya aku tidak seperti kalian, di malam hari aku diberi makan dan minum oleh Tuhanku.\""
            },
            {
                "number": 1289,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُوَاصِلُوا قِيلَ إِنَّكَ تَفْعَلُ ذَاكَ قَالَ إِنِّي لَسْتُ كَأَحَدِكُمْ إِنِّي أُطْعَمُ وَأُسْقَى",
                "id": "Telah menceritakan kepada kami [Sa'id bin Ar Rabi'] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Anas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian melakukan puasa wishal.\" Beliau ditanya, \"Tapi kenapa anda melakukan hal tersebut!? Beliau menjawab: \"Aku tidak seperti kalian, aku diberi makan dan minum.\""
            },
            {
                "number": 1290,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُوَاصِلُوا فَأَيُّكُمْ يُرِيدُ أَنْ يُوَاصِلَ فَلْيُوَاصِلْ إِلَى السَّحَرِ قَالُوا إِنَّكَ تُوَاصِلُ يَا رَسُولَ اللَّهِ قَالَ إِنِّي أَبِيتُ لِي مُطْعِمٌ يُطْعِمُنِي وَيَسْقِينِي",
                "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Yazid bin Abdullah bin Khabab] dari [Abdullah bin Khabab] dari [Abu Sa'id Al Khudri], bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian melakukan puasa wishal, maka siapapun di antara kalian yang ingin melakukan wishal, hendaknya ia melakukannya hingga waktu sahur.\" Para sahabat bertanya, \"Akan tetapi anda melakukan wishal wahai Rasulullah!? Beliau menjawab: \"Sesungguhnya pada malam hari ada yang memberiku makan dan minum.\""
            },
            {
                "number": 1291,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْوِصَالِ فَقَالَ لَهُ رِجَالٌ مِنْ الْمُسْلِمِينَ فَإِنَّكَ تُوَاصِلُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَسْتُ مِثْلَكُمْ إِنِّي أَبِيتُ يُطْعِمُنِي رَبِّي وَيَسْقِينِي فَلَمَّا أَبَوْا أَنْ يَنْتَهُوا عَنْ الْوِصَالِ وَاصَلَ بِهِمْ يَوْمًا ثُمَّ يَوْمًا ثُمَّ رَأَوْا الْهِلَالَ فَقَالَ لَوْ تَأَخَّرَ لَزِدْتُكُمْ كَالْمُنَكِّلِ لَهُمْ حِينَ أَبَوْا أَنْ يَنْتَهُوا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab] telah mengabarkan kepadaku [Abu Salamah bin 'Abdurrahman] bahwa [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang dari melakukan puasa wishal. Lalu ada beberapa orang muslim yang berkata kepada beliau, \"Akan tetapi anda melakukan wishal!? Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku tidak seperti kalian, pada malam hari aku diberi makan dan minum oleh Tuhanku.\" Maka ketika mereka enggan untuk berhenti dari wishal, beliau melakukan wishal bersama mereka satu hari demi satu hari hingga mereka melihat hilal, beliau bersabda: \"Sekiranya hilal itu belum muncul, maka aku akan menambahkannya (puasa wishal) untuk kalian.\" Seakan beliau menantang saat mereka enggan untuk berhenti dari puasa wishal.\""
            },
            {
                "number": 1292,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ حَمْزَةَ بْنَ عَمْرٍو الْأَسْلَمِيَّ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ السَّفَرَ فَمَا تَأْمُرُنِي قَالَ إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Hisyam bin 'Urwah] dari ['Urwah] dari [Aisyah] bahwa Hamzah bin 'Amru Al Aslami bertanya kepada Rasulullah shallallahu 'alaihi wasallam, ia berkata, \"Wahai Rasulullah, sesungguhnya aku ingin bersafar, maka apakah yang anda perintahkan kepadaku?\" Beliau menjawab: \"Jika mau maka berpuasalah, dan jika mau maka berbukalah.\""
            },
            {
                "number": 1293,
                "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ فَصَامَ وَصَامَ النَّاسُ حَتَّى بَلَغَ الْكَدِيدَ ثُمَّ أَفْطَرَ فَأَفْطَرَ النَّاسُ فَكَانُوا يَأْخُذُونَ بِالْأَحْدَثِ فَالْأَحْدَثِ مِنْ فِعْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah bin 'Utbah] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam keluar saat penaklukan Makkah dalam keadaan berpuasa, dan orang-orang pun berpuasa hingga sampai di daerah Kadid, kemudian beliau berbuka dan orang-orang pun berbuka. Mereka mengambil sesuatu yang terbaru, kemudian yang terbaru dari perbuatan Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 1294,
                "arab": " أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ وَأَبُو الْوَلِيدِ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ الْأَنْصَارِيِّ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ عَمْرِو بْنِ الْحَسَنِ يُحَدِّثُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّهُ ذَكَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي سَفَرٍ فَرَأَى زِحَامًا وَرَجُلٌ قَدْ ظُلِّلَ عَلَيْهِ فَقَالَ مَا هَذَا قَالُوا هَذَا صَائِمٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ مِنْ الْبِرِّ الصَّوْمُ فِي السَّفَرِ",
                "id": "Telah mengabarkan kepada kami [Hisyam bin Al Qasim] dan [Abu Al Walid] mereka berkata; telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin 'Abdurrahman Al Anshari] ia berkata, aku mendengar [Muhammad bin 'Amru bin Al Hasan] menceritakan dari [Jabir bin Abdullah] ia menyebutkan, bahwa Nabi shallallahu 'alaihi wasallam ketika berada dalam sebuah perjalanan, beliau melihat kerumunan orang yang di antara mereka ada seorang laki-laki yang dipayungi. Kemudian beliau bertanya: \"Ada apa ini?\" Mereka menjawab, \"Orang ini sedang berpuasa! \" Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Bukan termasuk kebaikan berpuasa ketika dalam perjalanan.\""
            },
            {
                "number": 1295,
                "arab": " أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا يُونُسُ عَنْ الزُّهْرِيِّ عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ عَنْ أُمِّ الدَّرْدَاءِ عَنْ كَعْبِ بْنِ عَاصِمٍ الْأَشْعَرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ مِنْ الْبِرِّ الصِّيَامُ فِي السَّفَرِ",
                "id": "Telah mengabarkan kepada kami [Utsman bin Umar] telah menceritakan kepada kami [Yunus] dari [Az Zuhri] dari [Shafwan bin Abdullah] dari [Ummu Ad Darda`] dari [Ka'b bin 'Ashim Al Asy'ari], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukanlah termasuk dari kebaikan berpuasa ketika dalam perjalanan.\""
            },
            {
                "number": 1296,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا الزُّهْرِيُّ عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ بْنِ صَفْوَانَ عَنْ أُمِّ الدَّرْدَاءِ عَنْ كَعْبِ بْنِ عَاصِمٍ الْأَشْعَرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ مِنْ الْبِرِّ الصِّيَامُ فِي السَّفَرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ahmad] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Az Zuhri] dari [Shafwan bin Abdullah bin Shafwan] dari [Ummu Ad Darda`] dari [Ka'b bin 'Ashim Al Asy'ari] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Bukanlah termasuk dari kebaikan berpuasa ketika dalam perjalanan.\""
            },
            {
                "number": 1297,
                "arab": " حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَاجِرِ عَنْ أَبِي أُمَيَّةَ الضَّمْرِيِّ قَالَ قَدِمْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ سَفَرٍ فَسَلَّمْتُ عَلَيْهِ فَلَمَّا ذَهَبْتُ لِأَخْرُجَ قَالَ انْتَظِرْ الْغَدَاءَ يَا أَبَا أُمَيَّةَ قَالَ فَقُلْتُ إِنِّي صَائِمٌ يَا نَبِيَّ اللَّهِ فَقَالَ تَعَالَ أُخْبِرْكَ عَنْ الْمُسَافِرِ إِنَّ اللَّهَ وَضَعَ عَنْهُ الصِّيَامَ وَنِصْفَ الصَّلَاةِ قَالَ أَبُو مُحَمَّد إِنْ شَاءَ صَامَ وَإِنْ شَاءَ أَفْطَرَ",
                "id": "Telah menceritakan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] dari [Yahya] dari [Abu Qilabah] dari [Abu Al Muhajir] dari [Abu Umayyah Adl Dlamri] ia berkata, \"Aku menghadap Rasulullah shallallahu 'alaihi wasallam saat kembali dari suatu perjalanan, aku lalu memberi salam kepada beliau. Kemudian ketika aku akan keluar, beliau berkata: \"Wahai Abu Umayya, tunggulah hingga makan siang.\" Mu'awiyah berkata, \"Lalu aku menjawab, \"Wahai Nabi Allah, aku sedang berpuasa.\" Kemudian beliau bersabda: \"Kemarilah, aku kabarkan kepadamu mengenai orang yang bersafar. Sesungguhnya Allah telah menggugurkan darinya puasa dan setengah sholat.\" Abu Muhammad berkata, \"Jika mau ia boleh puasa dan jika mau ia boleh berbuka.\" "
            },
            {
                "number": 1298,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ أَنَّ كُلَيْبَ بْنَ ذُهْلٍ الْحَضْرَمِيَّ أَخْبَرَهُ عَنْ عُبَيْدِ بْنِ جُبَيْرٍ قَالَ رَكِبْتُ مَعَ أَبِي بَصْرَةَ الْغِفَارِيِّ سَفِينَةً مِنْ الْفُسْطَاطِ فِي رَمَضَانَ فَدَفَعَ فَقَرَّبَ غَدَاءَهُ ثُمَّ قَالَ اقْتَرِبْ فَقُلْتُ أَلَسْتَ تَرَى الْبُيُوتَ فَقَالَ أَبُو بَصْرَةَ أَرَغِبْتَ عَنْ سُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Yazid Al Muqri`] telah menceritakan kepada kami [Sa'id bin Abu Ayyub] telah menceritakan kepadaku [Yazid bin Abu Habib] bahwa [Kulaib bin Dzuhail Al Hadlrami] mengabarkan kepadanya dari ['Ubaid bin Jubair] berkata, \"Pada bulan Ramadan aku bersama Abu Bashrah Al Ghifari menaiki kapal dari Fusthath. Kemudian ia menyodorkan makan siangnya dan berkata, \"Mendekatlah.\" Aku lalu bertanya, \"Bukanlah engkau telah melihat rumah-rumah?\" [Abu Bashrah] balik bertanya, \"Apakah engkau membenci sunnah Rasulullah shallallahu 'alaihi wasallam?\""
            },
            {
                "number": 1299,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ قَالَ سَمِعْتُ عُمَارَةَ بْنَ عُمَيْرٍ يُحَدِّثُ عَنْ ابْنِ الْمُطَوِّسِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَفْطَرَ يَوْمًا مِنْ شَهْرِ رَمَضَانَ مِنْ غَيْرِ رُخْصَةٍ وَلَا مَرَضٍ فَلَنْ يَقْضِيَهُ صِيَامُ الدَّهْرِ كُلِّهِ وَلَوْ صَامَ الدَّهْرَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Habib bin Abu Tsabit] ia berkata, aku mendengar ['Umarah bin 'Umair] menceritakan dari [Ibnu Al Muthawwis] dari [Ayahnya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berbuka satu hari pada bulan Ramadan bukan karena rukhshah atau sakit, maka tidak akan dapat diganti oleh puasa satu tahun penuh, walaupun ia berpuasa setahun penuh.\""
            },
            {
                "number": 1300,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي حَبِيبُ بْنُ أَبِي ثَابِتٍ قَالَ سَمِعْتُ عُمَارَةَ بْنَ عُمَيْرٍ يُحَدِّثُ عَنْ أَبِي الْمُطَوِّسِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَفْطَرَ يَوْمًا مِنْ رَمَضَانَ مِنْ غَيْرِ رُخْصَةٍ رَخَّصَهُ اللَّهُ لَهُ لَمْ يَقْضِ عَنْهُ صِيَامُ الدَّهْرِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepadaku [Habib bin Abu Tsabit] ia berkata, aku mendengar ['Umarah bin 'Umair] menceritakan dari [Abu Al Muthawwif] dari [Ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa berbuka satu hari pada bulan Ramadan bukan karena keringanan yang Allah berikan, maka tidak akan dapat diganti oleh puasa satu tahun.\""
            },
            {
                "number": 1301,
                "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْهَاشِمِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ فَقَالَ هَلَكْتُ فَقَالَ وَمَا أَهْلَكَكَ قَالَ وَاقَعْتُ امْرَأَتِي فِي شَهْرِ رَمَضَانَ قَالَ فَأَعْتِقْ رَقَبَةً قَالَ لَيْسَ عِنْدِي قَالَ فَصُمْ شَهْرَيْنِ مُتَتَابِعَيْنِ قَالَ لَا أَسْتَطِيعُ قَالَ فَأَطْعِمْ سِتِّينَ مِسْكِينًا قَالَ لَا أَجِدُ قَالَ فَأُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَقٍ فِيهِ تَمْرٌ فَقَالَ أَيْنَ السَّائِلُ تَصَدَّقْ بِهَذَا فَقَالَ أَعَلَى أَفْقَرَ مِنْ أَهْلِي يَا رَسُولَ اللَّهِ فَوَاللَّهِ مَا بَيْنَ لَابَتَيْهَا أَهْلُ بَيْتٍ أَفْقَرَ مِنَّا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَنْتُمْ إِذًا وَضَحِكَ حَتَّى بَدَتْ أَنْيَابُهُ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَجُلًا أَفْطَرَ فِي رَمَضَانَ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al Hasyimi] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Az Zuhri] dari [Humaid bin 'Abdurrahman] dari [Abu Hurairah] ia berkata, \"Seseorang telah datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Aku telah binasa! \" Beliau bertanya: \"Apa yang membinasakanmu?\" Ia menjawab, \"Aku telah menggauli isteriku pada bulan Ramadan.\" Beliau bersabda: \"Bebaskanlah seorang budak.\" Ia berkata, \"Aku tidak memiliki budak.\" Beliau bersabda: \"Berpuasalah dua bulan berturut-turut.\" Ia berkata, \"Aku tidak mampu.\" Beliau bersabda: \"Berilah makan enam puluh orang miskin.\" Ia berkata, \"Aku tidak mendapatkan makanan.\" Abu Hurairah berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam diberi keranjang yang berisi kurma, kemudian beliau berkata: \"Dimanakah orang yang bertanya? Bersedekahlah dengan ini.\" Orang itu lalu berkata, \"Wahai Rasulullah, apakah aku harus bersedekah kepada orang yang lebih fakir dari keluargaku? Demi Allah, tidak ada di antara dua daerah yang berbatu hitam (yaitu Madinah) yang lebih fakir daripada kami.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalau begitu untuk kalian saja.\" Beliau berikan kurma tersebut sambil tertawa hingga nampak gigi-gigi taringnya.\" Telah menceritakan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari [Humaid bin 'Abdurrahman] dari [Abu Hurairah], bahwa seorang laki-laki telah berbuka pada bulan Ramadan.... kemudian ia menyebutkan hadits tersebut.\" "
            },
            {
                "number": 1302,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ سَعِيدٍ الْأَنْصَارِيَّ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ أَخْبَرَهُ أَنَّ مُحَمَّدَ بْنَ جَعْفَرِ بْنِ الزُّبَيْرِ أَخْبَرَهُ أَنَّهُ سَمِعَ عَبَّادَ بْنَ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ أَنَّهُ سَمِعَ عَائِشَةَ تَقُولُ إِنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّهُ احْتَرَقَ فَسَأَلَهُ مَا لَهُ فَقَالَ أَصَابَ أَهْلَهُ فِي رَمَضَانَ فَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِكْتَلٍ يُدْعَى الْعَرَقَ فِيهِ تَمْرٌ فَقَالَ أَيْنَ الْمُحْتَرِقُ فَقَامَ الرَّجُلُ فَقَالَ تَصَدَّقْ بِهَذَا",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Yahya] -yaitu Ibnu Sa'id Al Anshari- bahwa ['Abdurrahman bin Al Qasim] mengabarkan kepadanya, bahwa [Muhammad bin Ja'far bin Az Zubair] mengabarkan kepadanya, bahwa ia mendengar ['Abbad bin Abdullah bin Az Zubair] bahwa ia mendengar [Aisyah] berkata, \"Seorang laki-laki bertanya kepada Nabi shallallahu 'alaihi wasallam, ia mengatakan bahwa ia berhak untuk dibakar (dalam neraka). Maka beliau pun menanyakan hal itu kepadanya, lalu laki-laki tersebut mengabarkan bahwa ia telah menggauli isterinya di bulan Ramadan. Kemudian Nabi shallallahu 'alaihi wasallam diberi satu keranjang yang disebut 'Araq berisi kurma. Beliau lalu berkata, \"Dimanakah orang yang melakukan sesuatu yang mengakibatkan dirinya dibakar di Neraka?\" Kemudian seorang laki-laki berdiri, beliau lalu bersabda: \"Bersedekahlah dengan ini.\""
            },
            {
                "number": 1303,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شَرِيكٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لِامْرَأَةٍ لَا تَصُومِي إِلَّا بِإِذْنِهِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Syarik] dari [Al A'masy] dari [Abu Shalih] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau berkata kepada seorang wanita: \"Janganlah berpuasa kecuali dengan seizinnya.\""
            },
            {
                "number": 1304,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَصُومُ الْمَرْأَةُ يَوْمًا تَطَوُّعًا فِي غَيْرِ رَمَضَانَ وَزَوْجُهَا شَاهِدٌ إِلَّا بِإِذْنِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad] telah menceritakan kepada kami [Sufyan] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang wanita tidak boleh berpuasa sunnah selain Ramadan meskipun sehari, tanpa seizin suaminya jika ia ada di rumah.\" "
            },
            {
                "number": 1305,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ أَبِي الزِّنَادِ عَنْ مُوسَى بْنِ أَبِي عُثْمَانَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَصُومُ الْمَرْأَةُ يَوْمًا وَزَوْجُهَا شَاهِدٌ إِلَّا بِإِذْنِهِ مَعْنَاهُ قَالَ فِي النُّذُورِ تَفِي بِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Abu Az Zinad] dari [Musa bin Abu Utsman] dari [Ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak boleh seorang wanita berpuasa satu hari sementara suaminya hadir kecuali dengan seizinnya.\" Maknanya, beliau bersabda mengenai puasa nadzar yang ia tunaikan.\""
            },
            {
                "number": 1306,
                "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُقَبِّلُ وَهُوَ صَائِمٌ فَقَالَ عُرْوَةُ أَمَا إِنَّهَا لَا تَدْعُو إِلَى خَيْرٍ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah], bahwa Rasulullah shallallahu 'alaihi wasallam pernah mencium saat sedang berpuasa.\" 'Urwah berkata, \"Adapun ia tidak menyeru kepada kebaikan.\" "
            },
            {
                "number": 1307,
                "arab": " أَخْبَرَنَا سَعْدُ بْنُ حَفْصٍ الطَّلْحِيُّ حَدَّثَنَا شَيْبَانُ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُقَبِّلُهَا وَهُوَ صَائِمٌ",
                "id": "Telah mengabarkan kepada kami [Sa'd bin Hafsh Ath Thalhi] telah menceritakan kepada kami [Syaiban] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Umar bin Abdul Aziz] dari ['Urwah] dari [Aisyah], bahwa Nabi shallallahu 'alaihi wasallam pernah menciumnya dalam keadaan berpuasa.\""
            },
            {
                "number": 1308,
                "arab": " حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدٍ الْأَنْصَارِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ هَشِشْتُ فَقَبَّلْتُ وَأَنَا صَائِمٌ فَجِئْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنِّي صَنَعْتُ الْيَوْمَ أَمْرًا عَظِيمًا قَبَّلْتُ وَأَنَا صَائِمٌ قَالَ أَرَأَيْتَ لَوْ مَضْمَضْتَ مِنْ الْمَاءِ قُلْتُ إِذًا لَا يَضِيرُ قَالَ فَفِيمَ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Laits bin Sa'd] dari [Bukair bin Abdullah bin Al Asyaj] dari [Abdul Malik bin Sa'id Al Anshari] dari [Jabir bin Abdullah] dari [Umar bin Al Khathab] ia berkata, \"Aku merasa berhasrat, lalu aku mencium dalam keadaan berpuasa. Kemudian aku datang menemui Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Sungguh, hari ini aku telah melakukan perkara yang besar, aku telah mencium dalam keadaan berpuasa! \" Beliau bersabda: \"Bagaimana pendapatmu apabila engkau berkumur-kumur dengan air?\" Aku menjawab, \"Jika demikian hal itu tidak merusak puasa?\" Beliau balik bertanya, \"Dalam hal apa! '"
            },
            {
                "number": 1309,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ حَدَّثَنَا عَبْدُ الْمَلِكِ يَعْنِي ابْنَ جُرَيْجٍ قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ أَنَّ أَبَا بَكْرٍ أَخْبَرَهُ عَنْ أَبِيهِ أَنَّ أُمَّ سَلَمَةَ وَعَائِشَةَ أَخْبَرتَاهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصْبِحُ جُنُبًا مِنْ أَهْلِهِ ثُمَّ يَصُومُ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] telah menceritakan kepada kami [Abdul Malik] -yaitu Ibnu Juraij- ia berkata, telah mengabarkan kepadaku [Ibnu Syihab] bahwa [Abu Bakr] telah mengabarkan kepadanya dari [Ayahnya] bahwa [Ummu Salamah] dan [Aisyah] telah mengabarkan kepadanya, bahwa Nabi shallallahu 'alaihi wasallam pernah pada pagi hari dalam keadaan junub karena berhubungan dengan isterinya, kemudian beliau berpuasa.\" "
            },
            {
                "number": 1310,
                "arab": " أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا جَرِيرٌ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ نَسِيَ وَهُوَ صَائِمٌ فَأَكَلَ أَوْ شَرِبَ فَلْيُتِمَّ صَوْمَهُ فَإِنَّمَا أَطْعَمَهُ اللَّهُ وَسَقَاهُ",
                "id": "Telah mengabarkan kepada kami [Utsman bin Muhammad] telah menceritakan kepada kami [Jarir] dari [Hisyam bin Hassan] dari [Ibnu Sirin] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa makan dan minum karena lupa hendaklah ia sempurnakan puasanya, sesungguhnya ia diberi makan dan minum Allah.\""
            },
            {
                "number": 1311,
                "arab": " أَخْبَرَنَا أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ مِهْرَانَ الْجَمَّالُ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي ذُبَابٍ عَنْ عَمِّهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَكَلَ أَحَدُكُمْ أَوْ شَرِبَ نَاسِيًا وَهُوَ صَائِمٌ ثُمَّ ذَكَرَ فَلْيُتِمَّ صِيَامَهُ فَإِنَّمَا أَطْعَمَهُ اللَّهُ وَسَقَاهُ قَالَ أَبُو مُحَمَّد أَهْلُ الْحِجَازِ يَقُولُونَ يَقْضِي وَأَنَا أَقُولُ لَا يَقْضِي",
                "id": "Telah mengabarkan kepada kami [Abu Ja'far Muhammad bin Mihran Al Jammal] telah menceritakan kepada kami [Hatim bin Isma'il] dari [Al Harits bin 'Abdurrahman bin Abu Dzubab] dari [Pamannya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian makan atau minum karena lupa, lalu teringat bahwa ia sedang, maka hendaknya ia menyempurnakan puasanya, karena sesungguhnya Allah telah memberinya makan dan minum.\" Abu Muhammad berkata, \"Penduduk Hijaz berpendapat bahwa ia harus mengganti puasanya, sedangkan aku tidak mengatakan ia harus mengganti puasanya.\" "
            },
            {
                "number": 1312,
                "arab": " أَخْبَرَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنِي أَبِي حَدَّثَنِي حُسَيْنٌ الْمُعَلِّمُ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ الْأَوْزَاعِيِّ عَنْ يَعِيشَ بْنِ الْوَلِيدِ عَنْ أَبِيهِ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ عَنْ أَبِي الدَّرْدَاءِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَاءَ فَأَفْطَرَ قَالَ فَلَقِيتُ ثَوْبَانَ بِمَسْجِدِ دِمَشْقَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ صَدَقَ أَنَا صَبَبْتُ لَهُ الْوَضُوءَ قَالَ عَبْد اللَّهِ إِذَا اسْتَقَاءَ",
                "id": "Telah mengabarkan kepada kami [Abdush Shamad bin Abdul Warits] telah menceritakan kepadaku [Ayahku] telah menceritakan kepadaku [Husain Al Mu'allim] dari [Yahya bin Abu Katsir] dari [Al Auza'i] dari [Ya'isy bin Al Walid] dari [Ayahnya] dari [Ma'dan bin Abu Thalhah] dari [Abu Ad Darda`], bahwa Nabi shallallahu 'alaihi wasallam pernah muntah kemudian beliau berbuka.\" Ma'dan bin Abu Thalhah berkata, \"Kemudian aku menemui [Tsauban] di Masjid Damaskus dan aku sebutkan hal tersebut kepadanya, lalu ia berkata, \"Ia benar. Bahkan aku yang menuangkan tempat wudlu beliau.\" Abdullah berkata, \"Hal itu jika sengaja muntah.\""
            },
            {
                "number": 1313,
                "arab": " أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا ذَرَعَ الصَّائِمَ الْقَيْءُ وَهُوَ لَا يُرِيدُهُ فَلَا قَضَاءَ عَلَيْهِ وَإِذَا اسْتَقَاءَ فَعَلَيْهِ الْقَضَاءُ قَالَ عِيسَى زَعَمَ أَهْلُ الْبَصْرَةِ أَنَّ هِشَامًا أَوْهَمَ فِيهِ فَمَوْضِعُ الْخِلَافِ هَا هُنَا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami [Isa bin Yunus] dari [Hisyam bin Hassan] dari [Ibnu Sirin] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila orang yang berpuasa terpaksa untuk muntah sementara ia tidak menginginkannya maka ia tidak wajib mengganti puasanya. Tetapi jika ia sengaja muntah, maka ia wajib untuk mengganti puasanya.\" Isa berkata, \"Penduduk Bashrah mengaku bahwa Hisyam telah salah dalam hadits tersebut, maka di sinilah letak perselisihan itu.\" "
            },
            {
                "number": 1314,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا عَاصِمٌ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ عَنْ شَدَّادِ بْنِ أَوْسٍ قَالَ مَرَرْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَمَانِ عَشْرَةَ خَلَتْ مِنْ رَمَضَانَ فَأَبْصَرَ رَجُلًا يَحْتَجِمُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami ['Ashim] dari [Abdullah bin Yazid] dari [Abu Al Asy'ats Ash Shan'ani] dari [Abu Asma Ar Rahbi] dari [Syaddad bin Aus] ia berkata, \"Aku bersama Rasulullah shallallahu 'alaihi wasallam telah melalui delapan belas hari dari bulan Ramadan, kemudian beliau melihat seorang laki-laki berbekam. Maka beliau pun bersabda: \"Orang yang membekam dan yang dibekam telah batal puasanya.\""
            },
            {
                "number": 1315,
                "arab": " أَخْبَرَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي قِلَابَةَ أَنَّ أَبَا أَسْمَاءَ الرَّحَبِيَّ حَدَّثَهُ أَنَّ ثَوْبَانَ حَدَّثَهُ قَالَ بَيْنَمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْشِي بِالْبَقِيعِ فَإِذَا رَجُلٌ يَحْتَجِمُ فَقَالَ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ قَالَ أَبُو مُحَمَّد أَنَا أَتَّقِي الْحِجَامَةَ فِي الصَّوْمِ فِي رَمَضَانَ",
                "id": "Telah mengabarkan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Abu Qilabah] bahwa [Abu Asma` Ar Rahabi] telah menceritakan kepadanya, bahwa [Tsauban] menceritakan kepadanya, ia berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam sedang berjalan di Baqi', tiba-tiba ada seorang laki-laki yang sedang berbekam. Beliau lalu bersabda: \"Orang yang membekam dan yang dibekam telah batal puasanya.\" Abu Muhammad berkata, \"Saat berpuasa di bulan Ramadan aku menghindari untuk berpekam.\" "
            },
            {
                "number": 1316,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ عَنْ وَاصِلٍ مَوْلَى أَبِي عُيَيْنَةَ عَنْ بَشَّارِ بْنِ أَبِي سَيْفٍ عَنْ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عِيَاضِ بْنِ غُطَيْفٍ عَنْ أَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الصَّوْمُ جُنَّةٌ مَا لَمْ يَخْرِقْهَا قَالَ أَبُو مُحَمَّد يَعْنِي بِالْغِيبَةِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Aun] telah menceritakan kepada kami [Khalid bin Abdullah] dari [Washil] mantan budak Abu 'Uyainah, dari [Basysyar bin Abu Saif] dari [Al Walid bin 'Abdurrahman] dari ['Iyadl bin Ghuthaif] dari [Abu 'Ubaidah bin Al Jarrah] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Puasa adalah tameng selama ia belum melubanginya.\" Abu Muhammad berkata, \"Yaitu dengan menggunjing orang lain.\" "
            },
            {
                "number": 1317,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ النُّعْمَانِ أَبُو النُّعْمَانِ الْأَنْصَارِيُّ حَدَّثَنِي أَبِي عَنْ جَدِّي وَكَانَ جَدِّي قَدْ أُتِيَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَسَحَ عَلَى رَأْسِهِ وَقَالَ لَا تَكْتَحِلْ بِالنَّهَارِ وَأَنْتَ صَائِمٌ اكْتَحِلْ لَيْلًا بِالْإِثْمِدِ فَإِنَّهُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعَرَ قَالَ أَبُو مُحَمَّد لَا أَرَى بِالْكُحْلِ بَأْسًا",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami ['Abdurrahman bin An Nu'man Abu An Nu'man Al Anshari] telah menceritakan kepadaku [Ayahku] dari [Kakekku], bahwa ia pernah dibawa ke hadapan Nabi shallallahu 'alaihi wasallam, kemudian beliau mengusap kepalanya dan berkata: \"Janganlah engkau memakai celak pada siang hari sementara engkau berpuasa, bercelaklah pada malam hari menggunakan Itsmid (sejenis tumbuhan), karena sesungguhnya Itsmid dapat mencerahkan pandangan, dan menumbuhkan rambut.\""
            },
            {
                "number": 1318,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي بَكْرٌ هُوَ ابْنُ مُضَرَ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ يَزِيدَ مَوْلَى سَلَمَةَ بْنِ الْأَكْوَعِ عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ أَنَّهُ قَالَ لَمَّا نَزَلَتْ هَذِهِ الْآيَةُ { وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ } قَالَ كَانَ مَنْ أَرَادَ أَنْ يُفْطِرَ وَيَفْتَدِيَ فَعَلَ حَتَّى نَزَلَتْ الْآيَةُ الَّتِي بَعْدَهَا فَنَسَخَتْهَا",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Bakr] -yaitu Ibnu Mudlar- dari ['Amru bin Al Harits] dari [Yazid] mantan budak Salamah bin Al Akwa', bahwa ia berkata ketika turun ayat ini: '(Dan wajib bagi orang-orang yang berat menjalankannya (jika mereka tidak berpuasa) membayar fidyah, (yaitu): memberi makan seorang miskin) ' (Qs.?Al Baqarah: 184).) [Salamah] berkata, \"Dahulu orang yang hendak berbuka dan membayar fidyah maka boleh ia melakukannya, hingga turunlah ayat yang setelahnya dan menghapus hukum ayat tersebut.\" "
            },
            {
                "number": 1319,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ هَارُونَ ابْنِ ابْنَةِ أُمِّ هَانِئٍ أَوْ ابْنِ ابْنِ أُمِّ هَانِئٍ عَنْ أُمِّ هَانِئٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَهِيَ صَائِمَةٌ فَأُتِيَ بِإِنَاءٍ فَشَرِبَ ثُمَّ نَاوَلَهَا فَشَرِبَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ كَانَ قَضَاءَ رَمَضَانَ فَصُومِي يَوْمًا آخَرَ وَإِنْ كَانَ تَطَوُّعًا فَإِنْ شِئْتِ فَاقْضِيهِ وَإِنْ شِئْتِ فَلَا تَقْضِيهِ",
                "id": "Telah mengabarkan kepada kami [An Nu'man] telah menceritakan kepada kami [Hammad bin Salamah] dari [Simak bin Harb] dari [Harun] anak laki-laki puteri Ummu Hani`, atau anak laki-laki putera Ummu Hani`, dari [Ummu Hani`], bahwa Nabi shallallahu 'alaihi wasallam menemuinya sementara ia dalam keadaan berpuasa. Beliau kemudian diberi suguhan susu lalu meminumnya, beliau kemudian memberikan susu tersebut kepada Ummu Hani` lalu ia meminumnya. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika untuk mengganti puasa Ramadan maka berpuasalah pada hari yang lain, tetapi jika puasa sunnah; jika engkau mau silahkan engkau menggantinya, jika tidak maka tidak perlu engkau menggantinya.\" "
            },
            {
                "number": 1320,
                "arab": " حَدَّثَنَا عُثْمَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا جَرِيرٌ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أُمِّ هَانِئٍ قَالَتْ لَمَّا كَانَ يَوْمُ فَتْحِ مَكَّةَ جَاءَتْ فَاطِمَةُ فَجَلَسَتْ عَنْ يَسَارِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأُمُّ هَانِئٍ عَنْ يَمِينِهِ قَالَتْ فَجَاءَتْ الْوَلِيدَةُ بِإِنَاءٍ فِيهِ شَرَابٌ فَنَاوَلَتْهُ فَشَرِبَ مِنْهُ ثُمَّ نَاوَلَهُ أُمَّ هَانِئٍ فَشَرِبَتْ مِنْهُ ثُمَّ قَالَتْ يَا رَسُولَ اللَّهِ لَقَدْ أَفْطَرْتُ وَكُنْتُ صَائِمَةً فَقَالَ لَهَا أَكُنْتِ تَقْضِينَ شَيْئًا قَالَتْ لَا قَالَ فَلَا يَضُرُّكِ إِنْ كَانَ تَطَوُّعًا قَالَ أَبُو مُحَمَّد أَقُولُ بِهِ إِنْ شَاءَ قَضَى وَإِنْ شَاءَ لَمْ يَقْضِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Muhammad] telah menceritakan kepada kami [Jarir] dari [Yazid bin Abu Ziyad] dari [Abdullah bin Al Harits] dari [Ummu Hani`] ia berkata, \"Pada saat hari penaklukan Makkah Fatimah datang dan duduk di sebelah kiri Rasulullah shallallahu 'alaihi wasallam, sedangkan Ummu Hani` di sebelah kanan beliau. Ummu Hani` berkata, \"Kemudian seorang budak wanita datang membawa bejana berisi minuman, lalu ia memberikannya kepada beliau hingga beliau minum sebagian darinya. Kemudian beliau memberikannya kepada Ummu Hani' dan ia pun meminumnya kemudian berkata, \"Wahai Rasulullah, aku telah berbuka, tadinya aku berpuasa.\" Maka beliau berkata kepadanya: \"Apakah engkau mengqadla` sebagian puasa?\" Ummu Hani` menjawab, \"Tidak.\" Beliau lalu bersabda: \"Apabila hanya puasa sunah maka tidak merugikanmu.\" Abu Muhammad berkata, \"Aku berpendapat dengannya, jika mau ia boleh menggantinya, jika tidak maka tidak perlu menggantinya.\" "
            },
            {
                "number": 1321,
                "arab": " أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دُعِيَ أَحَدُكُمْ إِلَى طَعَامٍ وَهُوَ صَائِمٌ فَلْيَقُلْ إِنِّي صَائِمٌ",
                "id": "Telah mengabarkan kepada [Hajjaj bin Minhal] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian diundang untuk makan padahal ia sedang berpuasa, maka hendaknya ia mengatakan 'aku sedang berpuasa'.\""
            },
            {
                "number": 1322,
                "arab": " أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ حَبِيبٍ الْأَنْصَارِيِّ قَالَ سَمِعْتُ مَوْلَاةً لَنَا يُقَالُ لَهَا لَيْلَى تُحَدِّثُ عَنْ جَدَّتِهَا أُمِّ عُمَارَةَ بِنْتِ كَعْبٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا فَدَعَتْ لَهُ بِطَعَامٍ فَقَالَ لَهَا كُلِي فَقَالَتْ إِنِّي صَائِمَةٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الصَّائِمَ إِذَا أُكِلَ عِنْدَهُ صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ حَتَّى يَفْرُغُوا وَرُبَّمَا قَالَ حَتَّى يَقْضُوا أَكْلَهُمْ",
                "id": "Telah mengabarkan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari [Habib Al Anshari] ia berkata, aku mendengar mantan budak wanita kami yang bernama [Laila] menceritakan dari neneknya [Ummu 'Umarah binti Ka'b], bahwa Nabi shallallahu 'alaihi wasallam datang menemuinya, lalu ia minta agar disuguhkan makanan untuk beliau. Maka beliau berkata kepadanya: \"Makanlah.\" Lalu Ummu Umarah berkata, \"Aku sedang berpuasa.\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang yang berpuasa apabila di sisinya terdapat makanan yang disantap maka Malaikat bershalawat kepadanya hingga mereka selesai makan.\" Dan terkadang beliau mengatakan: \"Hingga mereka menghabiskan makan mereka.\""
            },
            {
                "number": 1323,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ عَنْ سَالِمٍ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَامَ شَهْرًا تَامًّا إِلَّا شَعْبَانَ فَإِنَّهُ كَانَ يَصِلُهُ بِرَمَضَانَ لِيَكُونَا شَهْرَيْنِ مُتَتَابِعَيْنِ وَكَانَ يَصُومُ مِنْ الشَّهْرِ حَتَّى نَقُولَ لَا يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ لَا يَصُومُ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Musa] dari [Israil] dari [Manshur] dari [Salim] dari [Abu Salamah] dari [Ummu Salamah] ia berkata, \"Aku tidak melihat Rasulullah shallallahu 'alaihi wasallam melakukan puasa penuh satu bulan kecuali pada bulan Sya'ban. Karena beliau menyambungnya dengan bulan Ramadan agar menjadi dua bulan berturut-turut. Kadang beliau berpuasa (dalam sebagian bulan) hingga kami berkata 'Beliau tidak pernah berbuka'. Dan kadang beliau berbuka hingga kami berkata 'Beliau tidak pernah berpuasa'.\" "
            }
        ]
    }
}