{
    "status": true,
    "data": {
        "start": 1618,
        "end": 1764,
        "total": 147,
        "book": "darimi",
        "hadits": [
            {
                "number": 1618,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا يَعْقُوبُ بْنُ مُحَمَّدِ بْنِ طَحْلَاءَ عَنْ أَبِي الرِّجَالِ عَنْ أُمِّهِ عَمْرَةَ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَا عَائِشَةُ بَيْتٌ لَا تَمْرَ فِيهِ جِيَاعٌ أَهْلُهُ أَوْ جَاعَ أَهْلُهُ مَرَّتَيْنِ أَوْ ثَلَاثًا",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Maslamah] telah menceritakan kepada kami [Ya'qub bin Muhammad bin Thahla`] dari [Abu Ar Rijal] dari pamannya yaitu ['Amrah] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Aisyah, rumah yang tidak ada (persediaan) kurma di dalamnya adalah rumah yang lapar penghuninya.' -atau penghuninya mengalami kelaparan- Beliau mengucapkan hingga dua atau tiga kali."
            },
            {
                "number": 1619,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَجُوعُ أَهْلُ بَيْتٍ عِنْدَهُمْ التَّمْرُ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari ['Aisyah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak akan kelaparan penghuni rumah yang terdapat (persediaan) kurma didalamnya.\""
            },
            {
                "number": 1620,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا مُصْعَبُ بْنُ سُلَيْمٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ أُهْدِيَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَمْرٌ فَأَخَذَ يُهَدِّيهِ وَقَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ تَمْرًا مُقْعِيًا مِنْ الْجُوعِ قَالَ أَبُو مُحَمَّد يُهَدِّيهِ يَعْنِي يُهْدِي هَاهُنَا وَهَاهُنَا",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Mush'ab bin Sulaim], ia berkata; aku mendengar [Anas bin Malik] berkata; Nabi shallallahu 'alaihi wasallam pernah diberi hadiah kurma, kemudian beliau menghadiahkan kurma tersebut. Anas melanjutkan; Aku melihat Rasulullah shallallahu 'alaihi wasallam makan kurma dengan duduk di atas pantatnya dan mengangkat kedua betisnya karena lapar. Abu Muhammad berkata; \"Yuhaddihi artinya memberikan hadiah ke sana dan ke sini.\""
            },
            {
                "number": 1621,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ عَنْ خَالِدٍ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَامَ وَفِي يَدِهِ رِيحُ غَمَرٍ فَعَرَضَ لَهُ عَارِضٌ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] dari [Khalid] dari [Suhail] dari [Ayahnya] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa ketika tidur di tangannya masih terdapat bau lemak daging, kemudian terjadi sesuatu padanya, maka janganlah ia mencela kecuali kepada dirinya sendiri.\""
            },
            {
                "number": 1622,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا حُمَيْدٌ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِعَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَرَأَى عَلَيْهِ وَضَرًا مِنْ صُفْرَةٍ مَهْيَمْ قَالَ تَزَوَّجْتُ قَالَ أَوْلِمْ وَلَوْ بِشَاةٍ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Humaid] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam bersabda kepada Abdurrahman bin 'Auf, ketika beliau melihat bekas wewangian berwarna kuning: \"Apa ini?\" Abdurrahman menjawab; \"Aku telah menikah.\" Beliau bersabda: \"Buatlah pesta perkawinan walaupun hanya dengan seekor kambing.\""
            },
            {
                "number": 1623,
                "arab": " أَخْبَرَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ الثَّقَفِيِّ عَنْ رَجُلٍ مِنْ ثَقِيفَ أَعْوَرَ قَالَ كَانَ يُقَالُ لَهُ مَعْرُوفٌ أَيْ يُثْنَى عَلَيْهِ خَيْرٌ إِنْ لَمْ يَكُنْ اسْمُهُ زُهَيْرَ بْنَ عُثْمَانَ فَلَا أَدْرِي مَا اسْمُهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْوَلِيمَةُ أَوَّلَ يَوْمٍ حَقٌّ وَالثَّانِيَ مَعْرُوفٌ وَالثَّالِثَ سُمْعَةٌ وَرِيَاءٌ قَالَ قَتَادَةُ وَحَدَّثَنِي رَجُلٌ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ دُعِيَ أَوَّلَ يَوْمٍ فَأَجَابَ وَدُعِيَ الْيَوْمَ الثَّانِيَ فَأَجَابَ وَدُعِيَ الْيَوْمَ الثَّالِثَ فَحَصَبَ الرَّسُولَ وَلَمْ يُجِبْهُ وَقَالَ أَهْلُ سُمْعَةٍ وَرِيَاءٍ",
                "id": "Telah mengabarkan kepada kami ['Affan] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] dari [Al Hasan] dari [Abdullah bin Utsman Ats Tsaqafi] -dari seorang laki-laki penduduk Tsaqif yang buta matanya, ia biasa di sebut-sebut dengan kebaikannya, maksudnya dipuji dengan kebaikan, kalau tidak salah namanya adalah- [Zuhair bin Utsman] -aku tidak tahu siapa nama aslinya- ia berkata; bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Pesta pernikahan (yang di selenggarakan) pada hari pertama adalah hak, hari keduanya adalah kebaikan dan hari ketiganya adalah sum'ah dan riya`.\" Qatadah berkata; telah menceritakan kepadaku seorang laki-laki dari Sa'id bin Al Musayyab bahwa ia diundang (pesta pernikahan) pada hari pertama, lalu ia memenuhi undangan tersebut, dan diundang pada hari kedua, dan dia memenuhi undangan tersebut, ketika di undang pada hari ketiga, ia melempar utusan (orang yang mengundang) dengan kerikil, dan tidak memenuhi undangan tersebut, Sa'id bin Musayyab lalu berkata; \"orang yang melakukan hal ini adalah sum'ah dan riya`.\""
            },
            {
                "number": 1624,
                "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ الزُّهْرِيِّ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَ شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ يُدْعَى إِلَيْهَا الْأَغْنِيَاءُ وَيُتْرَكُ الْمَسَاكِينُ وَمَنْ تَرَكَ الدَّعْوَةَ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ",
                "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] dari [Az Zuhri] dari [Al A'raj] dari [Abu Hurairah] bahwa ia berkata; \"Seburuk-buruk makanan adalah makanan pesta pernikahan, yang hanya mengundang orang-orang kaya, sementara orang-orang miskin ditinggalkan. Barangsiapa tidak memenuhi undangan, sungguh ia telah durhaka kepada Allah dan rasulNya.\""
            },
            {
                "number": 1625,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ سُلَيْمَانَ عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ جَاءَ رَجُلٌ قَدْ صَنَعَ طَعَامًا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي فَدَعَاهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَكَذَا وَأَوْمَأَ إِلَيْهِ بِيَدِهِ قَالَ يَقُولُ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَكَذَا وَأَشَارَ إِلَى عَائِشَةَ قَالَ لَا فَأَعْرَضَ عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَوْمَأَ إِلَيْهِ الثَّانِيَةَ وَأَوْمَأَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْرَضَ عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَوْمَأَ إِلَيْهِ الثَّالِثَةَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهَذِهِ قَالَ نَعَمْ فَانْطَلَقَ مَعَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَائِشَةُ فَأَكَلَا مِنْ طَعَامِهِ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin Sulaiman] dari [Sulaiman bin Al Mughirah] dari [Tsabit] dari [Anas], ia berkata; Seorang laki-laki yang membuat makanan datang kepada Rasulullah shallallahu 'alaihi wasallam datang -maksudnya adalah mengundang beliau- maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah dengan ini?\" Laki-laki itu memberi isyarat dengan tangannya. Anas berkata; Rasulullah shallallahu 'alaihi wasallam bertanya kepadanya: \"Apakah dengan ini?\" beliau menunjuk kepada 'Aisyah. Laki-laki itu berkata; \"Jangan.\" Rasulullah shallallahu 'alaihi wasallam lalu berpaling darinya. Laki-laki itu memberi isyarat yang kedua kalinya dan Rasulullah shallallahu 'alaihi wasallam juga memberi isyarat kepadanya lalu berpaling. Dan orang tersebut memberikan isyarat untuk ketiga kali, kemudian Rasulullah shallallahu 'alaihi wasallam berkata kepadanya: \"Dan wanita ini?\" Orang tersebut berkata; \"Ya.\" Lalu Rasulullah shallallahu 'alaihi wasallam dan 'Aisyah pergi bersamanya dan menyantap makanannya.\""
            },
            {
                "number": 1626,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ أَبِي مَسْعُودٍ قَالَ جَاءَ رَجُلٌ يُقَالُ لَهُ أَبُو شُعَيْبٍ وَكَانَ لَهُ غُلَامٌ لَحَّامٌ فَقَالَ اصْنَعْ لِي طَعَامًا أَدْعُو رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَامِسَ خَمْسَةٍ قَالَ فَدَعَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَامِسَ خَمْسَةٍ فَتَبِعَهُمْ رَجُلٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّكَ دَعَوْتَنَا خَامِسَ خَمْسَةٍ وَهَذَا رَجُلٌ قَدْ تَبِعَنِي فَإِنْ شِئْتَ أَذِنْتَ لَهُ وَإِنْ شِئْتَ تَرَكْتَهُ قَالَ فَأَذِنَ لَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Al A'masy] dari [Abu Wa`il] dari [Abu Mas'ud], ia berkata; \"Seorang laki-laki yang bernama Abu Syu'aib memiliki seorang budak yang pandai memasak daging. Abu Syu'aib berkata kepadanya; \"Buatlah makanan dengan lima porsi, aku ingin mengundang Rasulullah shallallahu 'alaihi wasallam.\" Ia lalu mengundang Rasulullah shallallahu 'alaihi wasallam dengan sejumlah lima porsi. lalu ada seorang laki-laki yang mengikuti beliau, maka Nabi shallallahu 'alaihi wasallam pun bersabda: \"Engkau mengundang kami dengan lima porsi, padahal ada seorang laki-laki (lain) yang ingin ikut. Sekarang terserah kamu, memberi izin atau tidak.\" Abu Mas'ud menjawab, \"lalu Abu Syu'aib memberinya izin.\""
            },
            {
                "number": 1627,
                "arab": " حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا خَالِدٌ عَنْ أَبِي طُوَالَةَ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَعْمَرٍ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ",
                "id": "Telah menceritakan kepada kami ['Amr bin 'Aun] telah menceritakan kepada kami [Khalid] dari [Abu Thuwalah Abdullah bin Abdurrahman bin Ma'mar] dari [Anas], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Keutamaan Aisyah atas wanita-wanita yang lain seperti keutamaan bubur atas seluruh makanan.\""
            },
            {
                "number": 1628,
                "arab": " حَدَّثَنَا عَلِيُّ بْنُ الْمَدِينِيِّ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا عَبْدُ الْكَرِيمِ أَبُو أُمَيَّةَ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ الْحَارِثِ بْنِ نَوْفَلٍ زَوَّجَنِي أَبِي فِي إِمَارَةِ عُثْمَانَ فَدَعَا رَهْطًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ فِيمَنْ دَعَا صَفْوَانُ بْنُ أُمَيَّةَ وَهُوَ شَيْخٌ كَبِيرٌ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ انْهَسُوا اللَّحْمَ نَهْسًا فَإِنَّهُ أَشْهَى وَأَمْرَأُ",
                "id": "Telah menceritakan kepada kami [Ali bin Al Madini] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Abdul Karim Abu Umayyah], ia berkata; [Abdullah bin Al Harits bin Naufal] berkata; Ayahku telah menikahkan diriku pada masa kepemimpinan Utsman. Ketika itu ia mengundang sekelompok dari sahabat Rasulullah shallallahu 'alaihi wasallam. Diantara tamu undangan tersebut terdapat [Shafwan bin Umayyah], ia adalah orang yang tua renta, lalu ia berkata; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Gigitlah daging itu dengan ujung gigi, sesungguhnya hal itu lebih berselera dan lebih nikmat.\""
            },
            {
                "number": 1629,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ عَلِيِّ بْنِ الْأَقْمَرِ حَدَّثَنِي أَبُو جُحَيْفَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا آكُلُ مُتَّكِئًا",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Ali bin Al Aqmar] telah menceritakan kepadaku [Abu Juhaifah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku tidak pernah makan sambil bersandar.\""
            },
            {
                "number": 1630,
                "arab": " أَخْبَرَنَا نُعَيْمُ بْنُ حَمَّادٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُتِيَ بِالْبَاكُورَةِ بِأَوَّلِ الثَّمَرَةِ قَالَ اللَّهُمَّ بَارِكْ لَنَا فِي مَدِينَتِنَا وَفِي ثَمَرَتِنَا وَفِي مُدِّنَا وَفِي صَاعِنَا بَرَكَةً مَعَ بَرَكَةٍ ثُمَّ يُعْطِيهِ أَصْغَرَ مَنْ يَحْضُرُهُ مِنْ الْوِلْدَانِ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim bin Hammad] dari [Abdul Aziz bin Muhammad] dari [Suhail] dari [Ayahnya] dari [Abu Hurairah], ia berkata; Apabila Rasulullah shallallahu 'alaihi wasallam pertama diberi buah, maka beliau mengucapkan: \"Ya Allah, berkahilah kami, Madinah kami, buah kami, mud kami, sha' kami dengan keberkahan yang diiringi dengan keberkahan lainnya.\" Kemudian beliau memberikannya kepada anak paling kecil yang ikut hadir dari kalangan anak-anak.\""
            },
            {
                "number": 1631,
                "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَاءَ خَادِمُ أَحَدِكُمْ بِالطَّعَامِ فَلْيُجْلِسْهُ فَإِنْ أَبَى فَلْيُنَاوِلْهُ",
                "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Isma'il bin Abu Khalid] dari [ayahnya] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila pembantu salah seorang dari kalian datang dengan membawa makanan, hendaknya ia mempersilahkannya duduk, apabila pembantu itu menolak, hendaknya ia mengambilkan makan untuknya.\""
            },
            {
                "number": 1632,
                "arab": " حَدَّثَنَا أَبُو الْوَلِيدِ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ زِيَادٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَتَى أَحَدَكُمْ خَادِمُهُ بِطَعَامِهِ فَلْيُجْلِسْهُ مَعَهُ وَلْيُنَاوِلْهُ لُقْمَةً أَوْ لُقْمَتَيْنِ أَوْ أُكْلَةً أَوْ أُكْلَتَيْنِ فَإِنَّهُ وَلِيَ حَرَّهُ وَدُخَانَهُ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin Ziyad], ia berkata; Aku mendengar [Abu Hurairah] menceritakan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila pembantu salah seorang dari kalian datang dengan membawa makanan, hendaknya ia mempersilahkan duduk bersamanya, jika pembantu itu menolak, hendaknya ia mengambilkan untuknya satu atau dua suap, -atau satu atau dua makan- Karena dialah orang yang mengurusi panas dan asap makanan tersebut.\""
            },
            {
                "number": 1633,
                "arab": " حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحِبُّ الْحَلْوَاءَ وَالْعَسَلَ",
                "id": "Telah menceritakan kepada kami [Farwah bin Abu Al Maghra`] telah menceritakan kepada kami [Ali bin Mushir] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anha, ia berkata; \"Rasulullah shallallahu 'alaihi wasallam menyukai makanan yang manis dan kurma.\""
            },
            {
                "number": 1634,
                "arab": " حَدَّثَنَا قَبِيصَةُ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ سَعِيدِ بْنِ أَبِي الْحُوَيْرِثِ عَنْ ابْنِ عَبَّاسٍ قَالَ خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْبِرَازِ فَقُدِّمَ إِلَيْهِ طَعَامٌ فَقِيلَ لَهُ أَلَا تَوَضَّأُ قَالَ فَقَالَ أُصَلِّي فَأَتَوَضَّأُ قَالَ أَبُو مُحَمَّد إِنَّمَا هُوَ سَعِيدُ بْنُ الْحُوَيْرِثِ حَدَّثَنَا أَبُو نُعَيْمٍ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ سَعِيدِ بْنِ الْحُوَيْرِثِ عَنْ ابْنِ عَبَّاسٍ قَالَ وَسَمِعْتُ أَبَا عَاصِمٍ يُحَدِّثُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ سَعِيدِ بْنِ الْحُوَيْرِثِ عَنْ ابْنِ عَبَّاسٍ بِإِسْنَادِهِ",
                "id": "Telah menceritakan kepada kami [Qabishah] telah menceritakan kepada kami [Sufyan] dari ['Amr bin Dinar] dari [Sa'id bin Abu Al Huwairits] dari [Ibnu Abbas], ia berkata; Sehabis buang hajat, Nabi shallallahu 'alaihi wasallam di beri hidangan, lalu diberitahukan kepada beliau; \"Apakah anda tidak berwudhu?\" Beliau menjawab: \"Apakah aku akan melakukan sholat hingga harus berwudhu?\" Perawi berkata; Abu Muhammad adalah Sa'id bin Al Huwairits, telah menceritakan kepada kami [Abu Nu'aim] dari [Sufyan bin 'Uyainah] dari ['Amr bin Dinar] dari [Sa'id bin Al Huwairits] dari [Ibnu Abbas], ia berkata; aku mendengar [Abu 'Ashim] menceritakan dari [Ibnu Juraij] dari ['Amr bin Dinar] dari [Sa'id bin Al Huwairits] dari [Ibnu Abbas] dengan sanad yang sama."
            },
            {
                "number": 1635,
                "arab": " حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ قَالَ سَمِعْتُ إِبْرَاهِيمَ يُحَدِّثُ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَجْنَبَ فَأَرَادَ أَنْ يَأْكُلَ أَوْ يَنَامَ تَوَضَّأَ",
                "id": "Telah menceritakan kepada kami [Sahl bin Hammad] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam], ia berkata; aku mendengar [Ibrahim] menceritakan dari [Al Aswad] dari ['Aisyah], ia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam junub lalu beliau hendak makan atau minum atau tidur, maka beliau berwudhu.\""
            },
            {
                "number": 1636,
                "arab": "أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّ قَالَ أَوْصَانِي خَلِيلِي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِذَا طَبَخْتَ مَرَقَةً فَأَكْثِرْ مَاءَهَا ثُمَّ انْظُرْ أَهْلَ بَيْتٍ مِنْ جِيرَتِكَ فَاغْرِفْ لَهُمْ مِنْهَا",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syu'bah] dari [Abu Imran Al Jauni] dari [Abdullah bin Ash Shamit] dari [Abu Dzar], ia berkata; Kekasihku shallallahu 'alaihi wasallam telah berwasiat kepadaku, beliau bersabda: \"Apabila kalian memasak kuah, maka perbanyaklah airnya, kemudian perhatikanlah keluarga tetanggamu lalu bagikanlah kepada mereka.\""
            },
            {
                "number": 1637,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ سَعِيدٍ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ عَنْ مُوسَى بْنِ مُحَمَّدِ بْنِ إِبْرَاهِيمَ حَدَّثَنِي أَبِي عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وُضِعَ الطَّعَامُ فَاخْلَعُوا نِعَالَكُمْ فَإِنَّهُ أَرْوَحُ لِأَقْدَامِكُمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Sa'id] telah menceritakan kepada kami [Uqbah bin Khalid] dari [Musa bin Muhammad bin Ibrahim] telah menceritakan kepadaku [bapakku] dari [Anas bin Malik] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila makanan telah dihidangkan maka lepaslah sandal kalian, karena hal itu membuat telapak kaki lebih nyaman.\""
            },
            {
                "number": 1638,
                "arab": " أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُوسَى حَدَّثَنَا جَرِيرٌ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْبُدُوا الرَّحْمَنَ وَأَفْشُوا السَّلَامَ وَأَطْعِمُوا الطَّعَامَ تَدْخُلُوا الْجِنَانَ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Musa] telah menceritakan kepada kami [Jarir] dari ['Atha` bin As Sa`ib] dari [Ayahnya] dari [Abdullah bin 'Amr] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Beribadahlah kepada Allah yang Maha Pengasih, dan tebarkanlah salam serta berilah makan, niscaya kalian akan masuk Surga.\""
            },
            {
                "number": 1639,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَجِيبُوا الدَّاعِيَ إِذَا دُعِيتُمْ قَالَ وَكَانَ عَبْدُ اللَّهِ يَأْتِي الدَّعْوَةَ فِي الْعُرْسِ وَفِي غَيْرِ الْعُرْسِ وَيَأْتِيهَا وَهُوَ صَائِمٌ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penuhilah undangan orang yang mengundang, jika kalian diundang.\" Ibnu Umar berkata; Dan Abdullah biasa mendatangi undangan pesta pernikahan dan selainnya, dan ia mendatanginya meskipun dalam keadaan berpuasa.\""
            },
            {
                "number": 1640,
                "arab": " أَخْبَرَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا الزُّهْرِيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ فَأْرَةٍ وَقَعَتْ فِي سَمْنٍ فَقَالَ أَلْقُوهَا وَمَا حَوْلَهَا وَكُلُوا أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ ابْنِ عُيَيْنَةَ بِإِسْنَادِهِ",
                "id": "Telah mengabarkan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] dari [Maimunah] bahwa Rasulullah shallallahu 'alaihi wasallam ditanya mengenai seekor tikus yang jatuh di atas minyak samin. Beliau bersabda: \"Buanglah tikus tersebut dan apa yang ada disekitarnya, lalu makanlah.\" Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Ibnu 'Uyainah] dengan sanadnya.\""
            },
            {
                "number": 1641,
                "arab": " حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَ سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ فَأْرَةٍ وَقَعَتْ فِي سَمْنٍ فَمَاتَتْ فَقَالَ خُذُوهَا وَمَا حَوْلَهَا فَاطْرَحُوهُ حَدَّثَنَا زَيْدُ بْنُ يَحْيَى حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ قَالَ أَبُو مُحَمَّد إِذَا كَانَ ذَائِبًا أُهَرِيقَ",
                "id": "Telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas], ia berkata; Nabi shallallahu 'alaihi wasallam pernah ditanya mengenai seekor tikus yang terjatuh di atas minyak samin kemudian mati. Beliau menjawab: \"Ambillah tikus tersebut dan apa-apa yang ada di sekitarnya, kemudian buanglah.\" Telah menceritakan kepada kami [Zaid bin Yahya] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] dari [Maimunah] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas. Abu Muhammad mengatakan; \"Apabila mencair maka minyak samin terseut harus di tumpahkan.\""
            },
            {
                "number": 1642,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ حَدَّثَنَا حُصَيْنٌ الْحِمْيَرِيُّ أَخْبَرَنِي أَبُو سَعْدٍ الْخَيْرُ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَكَلَ فَلْيَتَخَلَّلْ فَمَا تَخَلَّلَ فَلْيَلْفِظْهُ وَمَا لَاكَ بِلِسَانِهِ فَلْيَبْتَلِعْ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] telah menceritakan kepada kami [Tsaur bin Yazid] telah menceritakan kepada kami [Hushain Al Himyari] telah mengabarkan kepadaku [Abu Sa'd Al Khair] dari [Abu Hurairah] radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang sehabis makan, hendaknya ia mengeluarkan apa yang ada disela-sela giginya, dan barangsiapa telah mengeluarkan apa yang ada di sela-sela giginya, hendaknya ia membuangnya sementara yang ada di lidah, hendaknya ditelan.\""
            },
            {
                "number": 1643,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ حَدَّثَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُ أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ أُسْرِيَ بِهِ بِإِيلِيَاءَ بِقَدَحَيْنِ مِنْ خَمْرٍ وَلَبَنٍ فَنَظَرَ إِلَيْهِمَا ثُمَّ أَخَذَ اللَّبَنَ فَقَالَ جِبْرِيلُ الْحَمْدُ لِلَّهِ الَّذِي هَدَاكَ لِلْفِطْرَةِ لَوْ أَخَذْتَ الْخَمْرَ غَوَتْ أُمَّتُكَ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Nafi'] telah menceritakan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepadaku [Sa'id bin Al Musayyab] bahwa ia mendengar [Abu Hurairah] berkata; Nabi shallallahu 'alaihi wasallam pernah di beri dua gelas yang berisi arak dan susu di Iliya' pada malam isra`, beliau kemudian melihat keduanya dan mengambil susu. Jibril berkata; segala puji bagi Allah Yang telah menunjukimu kepadamu kesucian, seandainya engkau mengambil arak, niscaya umatmu akan sesat.\""
            },
            {
                "number": 1644,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا ثَابِتٌ عَنْ أَنَسٍ قَالَ كُنْتُ سَاقِيَ الْقَوْمِ فِي مَنْزِلِ أَبِي طَلْحَةَ قَالَ فَنَزَلَ تَحْرِيمُ الْخَمْرِ قَالَ فَأَمَرَ مُنَادِيًا فَنَادَى فَقَالَ أَبُو طَلْحَةَ اخْرُجْ فَانْظُرْ مَا هَذَا فَخَرَجْتُ فَقُلْتُ هَذَا مُنَادٍ يُنَادِي أَلَا إِنَّ الْخَمْرَ قَدْ حُرِّمَتْ فَقَالَ لِيَ اذْهَبْ فَأَهْرِقْهَا قَالَ فَجَرَتْ فِي سِكَكِ الْمَدِينَةِ قَالَ وَكَانَتْ خَمْرُهُمْ يَوْمَئِذٍ الْفَضِيخَ فَقَالَ بَعْضُ الْقَوْمِ قُتِلَ قَوْمٌ وَهِيَ فِي بُطُونِهِمْ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ { لَيْسَ عَلَى الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جُنَاحٌ فِيمَا طَعِمُوا إِذَا مَا اتَّقَوْا وَآمَنُوا } الْآيَةَ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Tsabit] dari [Anas], ia berkata; Ketika aku menuangkan minuman di rumah Abu Thalhah. Anas melanjutkan; tiba-tiba turunlah (ayat) yang mengharamkan khamer. Kemudian beliau memerintahkan seseorang untuk menyeru, ia pun menyeru. Lalu Abu Thalhah berkata; \"Keluarlah dan lihatlah ada apa itu?, \" Akupun keluar, setelah itu aku berkata; \"Itu adalah orang yang menyeru, ketahuilah bahwa khamer telah diharamkan.\" Abu Thalhah berkata kepadaku; \"Pergi dan tumpahkanlah khamer tersebut.\" Anas berkata; \"Berita itu kemudian tersebar ke seantero penjuru Madinah, khamer mereka saat itu adalah fadikh (khmer yang terbuat dari rendaman kurma pentil). Kemudian sebagian orang mengatakan; \"Beberapa orang telah meninggal, sementara perut mereka masih terisi khamer.\" Maka Allah 'azza wajalla menurunkan ayat: Tidak ada dosa bagi orang-orang yang beriman dan mengerjakan amalan yang saleh karena memakan makanan yang telah mereka makan dahulu, apabila mereka bertaqwa serta beriman. QS Al Ma`idah; 93."
            },
            {
                "number": 1645,
                "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا ثُمَّ لَمْ يَتُبْ مِنْهَا حُرِمَهَا فِي الْآخِرَةِ فَلَمْ يُسْقَهَا",
                "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa minum khamer di dunia, kemudian ia tidak bertaubat darinya, maka ia diharamkan darinya di Akherat, dan tidak akan diberi minum darinya.\""
            },
            {
                "number": 1646,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنِي رَبِيعَةُ بْنُ يَزِيدَ عَنْ عَبْدِ اللَّهِ بْنِ الدَّيْلَمِيِّ قَالَ دَخَلْتُ عَلَى عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ فِي حَائِطٍ لَهُ بِالطَّائِفِ يُقَالُ لَهُ الْوَهْطُ فَإِذَا هُوَ مُخَاصِرٌ فَتًى مِنْ قُرَيْشٍ يُزَنُّ ذَلِكَ الْفَتَى بِشُرْبِ الْخَمْرِ فَقُلْتُ خِصَالٌ بَلَغَتْنِي عَنْكَ أَنَّكَ تُحَدِّثُ بِهَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ مَنْ شَرِبَ الْخَمْرَ شَرْبَةً لَمْ تُقْبَلْ لَهُ صَلَاةٌ أَرْبَعِينَ صَبَاحًا فَلَمَّا أَنْ سَمِعَهُ الْفَتَى يَذْكُرُ الْخَمْرَ اخْتَلَجَ يَدَهُ مِنْ يَدِ عَبْدِ اللَّهِ ثُمَّ وَلَّى فَقَالَ عَبْدُ اللَّهِ اللَّهُمَّ إِنِّي لَا أُحِلُّ لِأَحَدٍ أَنْ يَقُولَ عَلَيَّ مَا لَمْ أَقُلْ وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ شَرِبَ الْخَمْرَ شَرْبَةً لَمْ تُقْبَلْ لَهُ صَلَاةٌ أَرْبَعِينَ صَبَاحًا فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ فَلَا أَدْرِي فِي الثَّالِثَةِ أَمْ فِي الرَّابِعَةِ كَانَ حَقًّا عَلَى اللَّهِ أَنْ يَسْقِيَهُ مِنْ رَدْغَةِ الْخَبَالِ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Al Auza'i], ia berkata; telah menceritakan kepadaku [Rabi'ah bin Yazid] dari [Abdullah bin Ad Dailami], ia berkata; aku menemui [Abdullah bin 'Amr bin Al 'Ash] di kebunnya di Thaif, kebun itu disebut Al Wahth. Ternyata ia sedang menahan tangan seorang pemuda dari Quraisy yang dituduh meminum khamer. Aku kemudian berkata; \"Beberapa perkara yang sampai kepadaku bahwa anda menceritakannya dari Rasulullah shallallahu 'alaihi wasallam, bahwa: \"Barangsiapa meminum khamer satu teguk, maka tidak akan diterima sholatnya selama empat puluh hari.\" Ketika pemuda tersebut mendengar ia menyebutkan khamer, maka pemuda itu menarik dari tangan Abdullah, kemudian pergi. Abdullah lalu berkata; \"Ya Allah, sesungguhnya aku tidak mengahalalkan orang yang memfitnahku telah mengucapkan sesuatu yang tidak aku katakan. Sesungguhnya aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa minum seteguk khamer, maka tidak akan diterima sholatnya selama empat puluh hari, apabila ia bertaubat maka Allah menerima taubatnya -Aku tidak tahu, apakah hal itu pada kali ketiga atau keempat-Maka Allah berhak untuk memberinya minuman dari Lumpur penghuni Neraka pada Hari Kiamat.\""
            },
            {
                "number": 1647,
                "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الْحَسَنُ بْنُ أَبِي جَعْفَرٍ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَقْعُدْ عَلَى مَائِدَةٍ يُشْرَبُ عَلَيْهَا الْخَمْرُ",
                "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Al Hasan bin Abu Ja'far] telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa beriman kepada Allah dan Hari Akhir, maka janganlah ia duduk di hidangan yang terdapat khamer.\""
            },
            {
                "number": 1648,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ الْبَصْرِيُّ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ جَابَانَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدْخُلُ الْجَنَّةَ وَلَدُ زِنْيَةٍ وَلَا مَنَّانٌ وَلَا عَاقٌّ وَلَا مُدْمِنُ خَمْرٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir Al Bashri] telah menceritakan kepada kami [Sufyan] dari [Manshur] dari [Salim bin Abu Al Ja'd] dari [Jaban] dari [Abdullah bin 'Amr] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidak akan masuk surga anak hasil zina, orang yang mengungkit pemberiannya, anak durhaka dan pecandu khamer.\""
            },
            {
                "number": 1649,
                "arab": " حَدَّثَنَا أَحْمَدُ بْنُ الْحَجَّاجِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ نُبَيْطِ بْنِ شَرِيطٍ عَنْ جَابَانَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدْخُلُ الْجَنَّةَ عَاقٌّ وَلَا مَنَّانٌ وَلَا مُدْمِنُ خَمْرٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Al Hajjaj] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Syu'bah] dari [Manshur] dari [Salim bin Abu Al Ja'd] dari [Nubaith bin Syarith] dari [Jaban] dari [Abdullah bin 'Amr] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidak akan masuk surga anak durhaka, orang yang mengungkit pemberiannya dan pecandu khamer.\""
            },
            {
                "number": 1650,
                "arab": " أَخْبَرَنَا سُهَيْلُ بْنُ حَمَّادٍ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا سِمَاكٌ قَالَ سَمِعْتُ عَلْقَمَةَ بْنَ وَائِلٍ يُحَدِّثُ عَنْ أَبِيهِ وَائِلٍ أَنَّ سُوَيْدَ بْنَ طَارِقٍ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَمْرِ فَنَهَاهُ عَنْهَا أَنْ يَصْنَعَهَا فَقَالَ إِنَّهَا دَوَاءٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهَا لَيْسَتْ دَوَاءً وَلَكِنَّهَا دَاءٌ",
                "id": "Telah mengabarkan kepada kami [Suhail bin Hammad] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Simak], ia berkata; aku bertanya kepada ['Alqamah bin Wail] dia menceritakan dari ayahnya yaitu [Wail] bahwa Suwaid bin Thariq bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai khamer. Lantas beliau melarang untuk membuatnya. Ia pun berkata; \"Sesungguhnya khamer dapat di jadikan obat.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya khamer bukanlah obat, melainkan penyakit.\""
            },
            {
                "number": 1651,
                "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ عَنْ الْأَوْزَاعِيِّ قَالَ سَمِعْتُ أَبَا كَثِيرٍ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْخَمْرُ فِي هَاتَيْنِ الشَّجَرَتَيْنِ النَّخْلَةِ وَالْعِنَبَةِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] dari [Al Auza'i], ia berkata; aku mendengar [Abu Katsir] berkata; aku mendengar [Abu Hurairah] berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Khamer dapat di buat dari dua pohon ini yaitu pohon kurma dan pohon anggur.\""
            },
            {
                "number": 1652,
                "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الْبِتْعِ قَالَ كُلُّ شَرَابٍ أَسْكَرَ حَرَامٌ",
                "id": "Telah menceritakan kapada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari [Abu Salamah] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah ditanya mengenai Al Bit', Beliau bersabda: \"Semua minuman yang memabukkan adalah haram.\" "
            },
            {
                "number": 1653,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى عَنْ أَبِيهِ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَمُعَاذَ بْنَ جَبَلٍ إِلَى الْيَمَنِ فَقَالَ اشْرَبُوا وَلَا تَشْرَبُوا مُسْكِرًا فَإِنَّ كُلَّ مُسْكِرٍ حَرَامٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Isra`il] dari [Abu Ishaq] dari [Abu Burdah bin Abu Musa] dari [Ayahnya] ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah mengutusku dan Mu'adz bin Jabal ke Yaman, Beliau berkata: \"Minumlah dan janganlah kalian minum sesuatu yang memabukkan, karena sesungguhnya segala yang memabukkan adalah haram.\""
            },
            {
                "number": 1654,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ أَخْبَرَنَا أَبُو أُسَامَةَ حَدَّثَنَا الْوَلِيدُ بْنُ كَثِيرِ بْنِ سِنَانٍ حَدَّثَنِي الضَّحَّاكُ بْنُ عُثْمَانَ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ سَعْدٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَنْهَاكُمْ عَنْ قَلِيلِ مَا أَسْكَرَ كَثِيرُهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah mengabarkan kepada kami [Abu Usamah] telah menceritakan kepada kami [Al Walid bin Katsir bin Sinan] telah menceritakan kepadaku [Adh Dhahhak bin Utsman] dari [Bukair bin Abdullah bin Al Asyajj] dari ['Amir bin Sa'd] dari [Sa'd] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Aku melarang kalian dari sedikit yang banyaknya menyebabkan mabuk.\""
            },
            {
                "number": 1655,
                "arab": " حَدَّثَنَا زَيْدُ بْنُ يَحْيَى حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ عَنْ أَبِي وَهْبٍ الْكَلَاعِيِّ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ أَوَّلَ مَا يُكْفَأُ قَالَ زَيْدٌ يَعْنِي الْإِسْلَامَ كَمَا يُكْفَأُ الْإِنَاءُ كَفْيَ الْخَمْرِ فَقِيلَ فَكَيْفَ يَا رَسُولَ اللَّهِ وَقَدْ بَيَّنَ اللَّهُ فِيهَا مَا بَيَّنَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَمُّونَهَا بِغَيْرِ اسْمِهَا فَيَسْتَحِلُّونَهَا",
                "id": "Telah menceritakan kepada kami [Zaid bin Yahya] telah menceritakan kepada kami [Muhammad bin Rasyid] dari [Abu Wahb Al Kala'i] dari [Al Qasim bin Muhammad] dari ['Aisyah], ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya sesuatu pertama yang ditumpahkan-Zaid berkata; yaitu dalam Islam- seperti membalikkah bejana adalah mrnumpshksn (bejana) khamer.\" Beliau dtanya; \"Bagaimana hal itu terjadi wahai Rasulullah? Padahal Allah telah menjelaskan mengenai khamer sebagaimana yang telah Allah jelaskan?\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mereka menamakannya dengan selain namanya, kemudian mereka menghalalkannya.\""
            },
            {
                "number": 1656,
                "arab": " أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ حَدَّثَنِي أَبُو وَهْبٍ عَنْ مَكْحُولٍ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ عَنْ أَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَّلُ دِينِكُمْ نُبُوَّةٌ وَرَحْمَةٌ ثُمَّ مُلْكٌ وَرَحْمَةٌ ثُمَّ مُلْكٌ أَعْفَرُ ثُمَّ مُلْكٌ وَجَبَرُوتٌ يُسْتَحَلُّ فِيهَا الْخَمْرُ وَالْحَرِيرُ قَالَ أَبُو مُحَمَّد الْأَعْفَرُ شِبْهُ التُّرَابِ لَيْسَ فِيهِ طَمَعٌ",
                "id": "Telah mengabarkan kepada kami [Marwan bin Muhammad] telah menceritakan kepada kami [Yahya bin Hamzah] telah menceritakan kepadaku [Abu Wahb] dari [Makhul] dari [Abu Tsa'labah Al Khusyani] dari [Abu 'Ubaidah bin Al Jarrah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pertama kali dalam agama kalian adalah kenabian dan rahmat, kemudian kerajaan dan rahmat, kemudian kerajaan yang dipimpin dengan keburukan kemudian kerajaan dan keangkuhan serta otoriter, padanya dihalalkan khamer dan kain sutera.\" Abu Muhammad berkata; Al A'far adalah menyerupai debu dan tidak ada harapan padanya."
            },
            {
                "number": 1657,
                "arab": " أَخْبَرَنَا سَهْلُ بْنُ حَمَّادٍ حَدَّثَنَا طُعْمَةُ حَدَّثَنَا عَمْرُو بْنُ بَيَانٍ التَّغْلِبِيُّ عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ بْنِ شُعْبَةَ عَنْ أَبِيهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ بَاعَ الْخَمْرَ فَلْيُشَقِّصْ الْخَنَازِيرَ قَالَ أَبُو مُحَمَّد إِنَّمَا هُوَ عُمَرُ بْنُ بَيَانٍ",
                "id": "Telah mengabarkan kepada kami [Sahl bin Hammad] telah menceritakan kepada kami [Thu'mah] telah menceritakan kepada kami ['Amr bin Bayan At Taghlibi] dari ['Urwah bin Al Mughirah bin Syu'bah] dari [Ayahnya] dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Barangsiapa menjual khamer, sebagaimana ia menghalalkan daging babi.\" Abu Muhammad berkata; sesungguhnya yang benar adalah Umar bin Bayan."
            },
            {
                "number": 1658,
                "arab": " حَدَّثَنَا يَعْلَى عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ وَعْلَةَ قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ عَنْ بَيْعِ الْخَمْرِ فَقَالَ كَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدِيقٌ مِنْ ثَقِيفٍ أَوْ مِنْ دَوْسٍ فَلَقِيَهُ بِمَكَّةَ عَامَ الْفَتْحِ بِرَاوِيَةٍ مِنْ خَمْرٍ يُهْدِيهَا لَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا فُلَانُ أَمَا عَلِمْتَ أَنَّ اللَّهَ تَعَالَى قَدْ حَرَّمَهَا قَالَ فَأَقْبَلَ الرَّجُلُ عَلَى غُلَامِهِ فَقَالَ اذْهَبْ فَبِعْهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَاذَا أَمَرْتَهُ يَا فُلَانُ قَالَ أَمَرْتُهُ بِبَيْعِهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الَّذِي حَرَّمَ شُرْبَهَا حَرَّمَ بَيْعَهَا فَأَمَرَ بِهَا فَأُكْفِئَتْ فِي الْبَطْحَاءِ",
                "id": "Telah menceritakan kepada kami [Ya'la] dari [Muhammad bin Ishaq] dari [Al Qa'qa' bin Hakim] dari [Abdurrahman bin Wa'lah] ia berkata; Aku bertanya kepada [Ibnu Abbas] mengenai penjualan khamer. Ia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah memiliki seorang teman dari Tsaqif atau dari Daus, beliau bertemu dengannya di Makkah pada saat penaklukan kota Makkah, dia membawa geriba berisi khamer yang dihadiahkan kepada beliau. Maka beliau berkata kepadanya: \"Wahai Fulan, tidakkah kamu tahu bahwa Allah Ta'ala telah mengharamkannya?\" Orang itu lalu menghadap kepada budaknya dan berkata; \"Pergi dan juallah khamer tersebut.\" Spontan Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa yang engkau perintahkan kepadanya wahai Fulan?\" Ia berkata; \"Aku memerintahkannya untuk menjualnya.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Dzat Yang mengharamkan untuk meminumnya mengharamkan pula untuk menjualnya.\" Kemudian beliau memerintahkan supaya khamer tersebut ditumpahkan di Bathha`."
            },
            {
                "number": 1659,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو يَعْنِي ابْنَ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ بَلَغَ عُمَرَ أَنَّ سَمُرَةَ بَاعَ خَمْرًا فَقَالَ قَاتَلَ اللَّهُ سَمُرَةَ أَمَا عَلِمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَعَنَ اللَّهُ الْيَهُودَ حُرِّمَتْ عَلَيْهِمْ الشُّحُومُ فَجَمَلُوهَا فَبَاعُوهَا قَالَ سُفْيَانُ جَمَلُوهَا أَذَابُوهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ahmad] telah menceritakan kepada kami [Sufyan] dari ['Amr yaitu Ibnu Dinar] dari [Thawus] dari [Ibnu Abbas] ia berkata; telah sampai berita kepada Umar, bahwa Samurah telah menjual arak. Umar berkata; \"Semoga Allah memerangi Samurah. Tidakkah ia mengetahui bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Semoga Allah melaknat orang-orang Yahudi, lemak telah diharamkan kepada mereka kemudian mereka mencairkannya dan menjualnya.\" Sufyan berkata; \"Jamaluuha artinya mencairkannya.\""
            },
            {
                "number": 1660,
                "arab": " حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَكِرَ فَاجْلِدُوهُ ثُمَّ إِذَا سَكِرَ فَاجْلِدُوهُ ثُمَّ إِذَا سَكِرَ فَاجْلِدُوهُ ثُمَّ إِذَا سَكِرَ فَاضْرِبُوا عُنُقَهُ يَعْنِي فِي الرَّابِعَةِ",
                "id": "Telah menceritakan kepada kami ['Ashim bin Ali] telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Al Harits bin Abdurrahman] dari [Abu Salamah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila ia mabuk maka cambuklah dia, kemudian bila mabuk, cambuklah dia, jika masih mabuk, cambuklah dia, dan apabila masih saja mabuk, maka penggallah lehernya dikeempat kali.\""
            },
            {
                "number": 1661,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ وَلَا يَسْرِقُ السَّارِقُ حِينَ يَسْرِقُ وَهُوَ مُؤْمِنٌ وَلَا يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Al Auza'i] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah berzina orang yang berzina ketika ia berzina ia dalam keadaan beriman, dan tidaklah mencuri orang yang mencuri ketika mencuri ia dalam keadaan beriman, dan tidaklah minum arak ketika meminumnya ia dalam keadaan beriman.\""
            },
            {
                "number": 1662,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ كَانَ يُنْبَذُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السِّقَاءِ فَإِنْ لَمْ يَكُنْ سِقَاءٌ نُبِذَ لَهُ فِي تَوْرٍ مِنْ بِرَامٍ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] dari [Abdul Malik bin Abu Sulaiman] dari [Abu Az Zubair] dari [Jabir] ia berkata; Nabi shallallahu 'alaihi wasallam pernah dibuatkan rendaman khamer di dalam wadah dari kulit. Apabila tidak ada wadah dari kulit, beliau dibuatkan rendamana khamer dalam bejana kecil yang terbuat dari batu.\""
            },
            {
                "number": 1663,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي عَمْرٍو السَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الدَّيْلَمِيِّ عَنْ أَبِيهِ أَنَّ أَبَاهُ أَوْ أَنَّ رَجُلًا مِنْهُمْ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا قَدْ خَرَجْنَا مِنْ حَيْثُ عَلِمْتَ وَنَزَلْنَا بَيْنَ ظَهْرَانَيْ مَنْ قَدْ عَلِمْتَ فَمَنْ وَلِيُّنَا قَالَ اللَّهُ وَرَسُولُهُ قَالُوا يَا رَسُولَ اللَّهِ إِنَّا كُنَّا أَصْحَابَ كَرْمٍ وَخَمْرٍ وَإِنَّ اللَّهَ قَدْ حَرَّمَ الْخَمْرَ فَمَا نَصْنَعُ بِالْكَرْمِ قَالَ اصْنَعُوهُ زَبِيبًا قَالُوا فَمَا نَصْنَعُ بِالزَّبِيبِ قَالَ انْقَعُوهُ فِي الشِّنَانِ انْقَعُوهُ عَلَى غَدَائِكُمْ وَاشْرَبُوهُ عَلَى عَشَائِكُمْ وَانْقَعُوهُ عَلَى عَشَائِكُمْ وَاشْرَبُوهُ عَلَى غَدَائِكُمْ فَإِنَّهُ إِذَا أَتَى عَلَيْهِ الْعَصْرَانِ كَانَ خَلًّا قَبْلَ أَنْ يَكُونَ خَمْرًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] dari [Al Auza'i] dari [Yahya bin Abu 'Amr As Saibani] dari [Abdullah bin Ad Dailami] dari [Ayahnya] bahwa ayahnya atau seorang laki-laki diantara mereka bertanya kepada Nabi shallallahu 'alaihi wasallam, ia berkata; \"Wahai Rasulullah, sesungguhnya kami keluar dari tempat yang telah engkau ketahui dan kami singgah diantara orang-orang yang telah engkau ketahui, maka siapakah penolong-penolong kami?\" Beliau menjawab: \"Allah dan RasulNya.\" Ia berkata lagi; \"Wahai Rasulullah, sesungguhnya kami adalah orang-orang yang memiliki anggur dan khamer, sementara Allah telah mengharamkan khamer, lalu apa yang harus kami perbuat terhadap anggur?\" Beliau menjawab: \"Buatlah menjadi kismis.\" Mereka mengatakan; \"Apa yang harus kami perbuat terhadap kismis?\" Beliau menjawab: \"Rendamlah dalam geriba basah, rendamlah untuk makan siang kalian, dan minumlah untuk makan malam kalian, dan rendamlah untuk makan malam kalian serta minumlah untuk makan siang kalian, karena apabila tiba pagi hari dan senja, ia akan menjadi cuka sebelum menjadi khamer.\""
            },
            {
                "number": 1664,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ عَزْرَةَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ سَأَلْتُ ابْنَ عُمَرَ عَنْ نَبِيذِ الْجَرِّ فَقَالَ حَرَّمَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَقِيتُ ابْنَ عَبَّاسٍ فَأَخْبَرْتُهُ بِقَوْلِ ابْنِ عُمَرَ فَقَالَ صَدَقَ أَبُو عَبْدِ الرَّحْمَنِ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin 'Amir] dari [Sa'id bin 'Arubah] dari [Qatadah] dari ['Azrah] dari [Sa'id bin Jubair], ia berkata; Aku bertanya kepada [Ibnu Umar] mengenai Nabidzul Jarr, Ia menjawab; Rasulullah shallallahu 'alaihi wasallam telah mengharamkannya. Kemudian aku bertemu dengan Ibnu Abbas dan mengabarkan kepadanya mengenai perkataan Ibnu Umar, [Ibnu Abbas] menjawab; \"Abu Abdurrahman benar.\" "
            },
            {
                "number": 1665,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ عَنْ شُعَيْبِ بْنِ أَبِي حَمْزَةَ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَنْتَبِذُوا فِي الدُّبَّاءِ وَالْمُزَفَّتِ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Nafi'] dari [Syu'aib bin Abu Hamzah] dari [Az Zuhri], ia berkata; telah menceritakan kepadaku [Anas bin Malik] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah membuat rendaman (anggur atau kurma) dalam Dubba`dan muzaffat.\" "
            },
            {
                "number": 1666,
                "arab": " أَخْبَرَنَا أَبُو زَيْدٍ حَدَّثَنَا شُعْبَةُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ قَالَ سَمِعْتُ أَبَا الْحَكَمِ قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ أَوْ سَمِعْتُهُ سُئِلَ عَنْ نَبِيذِ الْجَرِّ فَقَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْجَرِّ وَالدُّبَّاءِ وَسَأَلْتُ ابْنَ الزُّبَيْرِ فَقَالَ مِثْلَ قَوْلِ ابْنِ عَبَّاسٍ قَالَ وَقَالَ ابْنُ عَبَّاسٍ مَنْ سَرَّهُ أَنْ يُحَرِّمَ مَا حَرَّمَ اللَّهُ وَرَسُولُهُ أَوْ مَنْ كَانَ مُحَرِّمًا مَا حَرَّمَ اللَّهُ وَرَسُولُهُ فَلْيُحَرِّمْ النَّبِيذَ قَالَ و حَدَّثَنِي أَخِي عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْجَرِّ وَالدُّبَّاءِ وَالْمُزَفَّتِ وَعَنْ الْبُسْرِ وَالتَّمْرِ",
                "id": "Telah mengabarkan kepada kami [Abu Zaid] telah menceritakan kepada kami [Syu'bah] dari [Salamah bin Kuhail], ia berkata; aku mendengar [Abu Al Hakam] berkata; aku bertanya kepada [Ibnu Abbas] atau aku mendengar dia ditanya mengenai Nabidzul jarr, Ibnu Abbas menjawab; \"Rasulullah shallallahu 'alaihi wasallam melarang dari jarr dan Dubba'.\" Kemudian aku bertanya kepada [Ibnu Az Zubair], dia pun mengatakan seperti perkataan [Ibnu Abbas]. Dan Ibnu Abbas berkata; \"Barangsiapa senang mengharamkan apa yang telah diharamkan Allah dan RasulNya, atau barangsiapa menghamkan apa yang telah diharamkan Allah dan RasulNya, hendaknya ia mengharamkan rendaman kurma dan anggur.\" Perawi berkata; telah menceritakan kepadaku [saudaraku] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang dari jarr, dubba' dan muzaffat, serta (rendaman) dari Busr dan tamr. "
            },
            {
                "number": 1667,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا ثَابِتُ بْنُ يَزِيدَ حَدَّثَنَا عَاصِمٌ عَنْ فُضَيْلِ بْنِ زَيْدٍ الرَّقَاشِيِّ أَنَّهُ أَتَى عَبْدَ اللَّهِ بْنَ مُغَفَّلٍ فَقَالَ أَخْبِرْنِي بِمَا يَحْرُمُ عَلَيْنَا مِنْ الشَّرَابِ فَقَالَ الْخَمْرُ قَالَ قُلْتُ هُوَ فِي الْقُرْآنِ قَالَ مَا أُحَدِّثُكَ إِلَّا مَا سَمِعْتُ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَدَأَ بِالِاسْمِ أَوْ قَالَ بِالرِّسَالَةِ قَالَ نَهَى عَنْ الدُّبَّاءِ وَالْحَنْتَمِ وَالنَّقِيرِ",
                "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Tsabit bin Yazid] telah menceritakan kepada kami ['Ashim] dari [Fudhail bin Zaid Ar Raqasyi] bahwa ia pernah menemui [Abdullah bin Mughaffal] lalu berkata; \"Beritahukanlah kepadaku mengenai minuman yang diharamkan atas kita!.\" Abdullah bin Mughaffal menjawab; \"Yaitu khamer.\" Fudhail berkata; saya katakan; \"Apakah hal itu (tercantum) dalam Al Qur'an?\" Abdullah bin Mughaffal menjawab; \"Tidaklah aku menceritakan kepadamu kecuali apa yang telah aku dengar dari Muhammad shallallahu 'alaihi wasallam -Abdullah bin Mughaffal (mengatakan dengan) mendahulukan nama yaitu Muhammad Rasulullah, atau mendahulukan risalah yaitu Rasulullah Muhammad- dia melanjutkan; \"Beliau telah melarang bejana dari dubba', hantam dan naqir.\" "
            },
            {
                "number": 1668,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ وَسَعِيدُ بْنُ عَامِرٍ وَاللَّفْظُ لِيَزِيدَ قَالَا أَخْبَرَنَا هِشَامٌ عَنْ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَنْتَبِذُوا الزَّهْوَ وَالرُّطَبَ جَمِيعًا وَلَا تَنْتَبِذُوا الزَّبِيبَ وَالتَّمْرَ جَمِيعًا وَانْتَبِذُوا كُلَّ وَاحِدٍ مِنْهُمَا عَلَى حِدَتِهِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] dan [Sa'id bin 'Amir] sedangkan redaksi haditsnya dari Yazid, keduanya berkata; telah mengabarkan kepada kami [Hisyam] dari [Yahya] dari [Abdullah bin Abu Qatadah] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Buatlah rendaman dari Zahwu (kurma masak) serta Ruthab (kurma basah) secara bersamaan, dan janganlah membuat rendaman dari Kismis dan tamr (kurma kering) secara bersamaan, dan buatlah rendaman dari salah satunya secara terpisah.\""
            },
            {
                "number": 1669,
                "arab": " حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا شُعْبَةُ عَنْ سِمَاكٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُولُوا الْكَرْمَ وَقُولُوا الْعِنَبَ أَوْ الْحَبَلَةَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Syu'bah] dari [Simak] dari ['Alqamah bin Wail] dari [Ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mengatakan Al Karam, akan tetapi katakanlah anggur atau habalah.\""
            },
            {
                "number": 1670,
                "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ السُّدِّيِّ عَنْ يَحْيَى بْنِ عَبَّادٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ فِي حِجْرِ أَبِي طَلْحَةَ يَتَامَى فَاشْتَرَى لَهُمْ خَمْرًا فَلَمَّا نَزَلَ تَحْرِيمُ الْخَمْرِ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ أَجْعَلُهُ خَلًّا قَالَ لَا فَأَهْرَاقَهُ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Musa] dari [Isra`il] dari [As Suddi] dari [Yahya bin 'Abbad] dari [Anas bin Malik] ia berkata; \"Abu Thalhah memiliki tanggungan anak-anak yatim, kemudian ia membelikan khamer untuk mereka, katika turun pengharaman khamer, ia datang kepada Nabi shallallahu 'alaihi wasallam dan memberitahukan hal itu kepada beliau, lantas Abu Thalhah berkata; \"Apakah aku boleh menjadikannya cuka?\" Beliau bersabda: \"Tidak.\" Setelah itu Abu Thalhah menumpahkannya."
            },
            {
                "number": 1671,
                "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا الزُّهْرِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرِبَ لَبَنًا وَعَنْ يَسَارِهِ أَبُو بَكْرٍ وَعَنْ يَمِينِهِ رَجُلٌ أَعْرَابِيٌّ فَأَعْطَى الْأَعْرَابِيَّ فَضْلَهُ ثُمَّ قَالَ الْأَيْمَنَ فَالْأَيْمَنَ",
                "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepada kami [Az Zuhri] dari [Anas bin Malik] bahwa dia pernah melihat Rasulullah shallallahu 'alaihi wasallam meminum susu, sementara di sebelah kirinya terdapat Abu Bakr dan disebelah kanannya terdapat seorang arab badui, maka beliau memberikan sisanya kepada orang badui tersebut, beliau bersabda: \"(Dari) yang sebelah kanan kemudian yang sebelah kanan.\""
            },
            {
                "number": 1672,
                "arab": " أَخْبَرَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا قَتَادَةُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُشْرَبَ مِنْ فِي السِّقَاءِ",
                "id": "Telah mengabarkan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] telah mengabarkan kepada kami [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam melarang minum (langsung) dari mulut geriba.\""
            },
            {
                "number": 1673,
                "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ عِكْرِمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُشْرَبَ مِنْ فِي السِّقَاءِ",
                "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] dari [Khalid Al Hadzdza`] dari [Ikrimah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang minum (langsung) dari mulut geriba.\" "
            },
            {
                "number": 1674,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ اخْتِنَاثِ الْأَسْقِيَةِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] dari [Ibnu Abu Dzi`b] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Abu Sa'id Al Khudri] bahwa Nabi shallallahu 'alaihi wasallam melarang memotong mulut bejana lalu minum (langsung) darinya.\""
            },
            {
                "number": 1675,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ عَنْ ثُمَامَةَ قَالَ كَانَ أَنَسٌ يَتَنَفَّسُ فِي الْإِنَاءِ مَرَّتَيْنِ أَوْ ثَلَاثًا وَزَعَمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَنَفَّسُ فِي الْإِنَاءِ مَرَّتَيْنِ أَوْ ثَلَاثًا",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami ['Azrah bin Tsabit] dari [Tsumamah] ia berkata; [Anas] bernafas dalam bejana dua atau tiga kali, dan mengira bahwa Rasulullah shallallahu 'alaihi wasallam pernah bernafas dalam bejana dua atau tiga kali (ketika minum).\""
            },
            {
                "number": 1676,
                "arab": " أَخْبَرَنَا إِسْحَقُ بْنُ عِيسَى عَنْ مَالِكٍ عَنْ أَيُّوبَ بْنِ حَبِيبٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي الْمُثَنَّى قَالَ كُنْتُ عِنْدَ مَرْوَانَ فَجَاءَ أَبُو سَعِيدٍ فَقَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنِّي لَا أَرْوَى مِنْ نَفَسٍ وَاحِدٍ قَالَ فَأَبِنْ الْإِنَاءَ عَنْ فِيكَ ثُمَّ تَنَفَّسْ قَالَ إِنِّي أَرَى الْقَذَاةَ قَالَ أَهْرِقْهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Isa] dari [Malik] dari [Ayyub bin Habib] dari [Az Zuhri] dari [Abu Al Mutsanna] ia berkata; aku pernah berada di rumah Marwan, kemudian [Abu Sa'id] datang lalu berkata; seorang laki-laki berkata; \"Wahai Rasulullah, sesungguhnya aku tidak minum dengan satu nafas.\" Beliau lalu bersabda: \"Jauhkanlah bejana dari mulutmu, kemudian bernafaslah.\" Orang tersebut berkata; \"Ternyata setelah itu aku melihat kotoran.\" Beliau bersabda: \"Maka tuangkanlah.\""
            },
            {
                "number": 1677,
                "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ قَالَ حَدَّثَنِي أَبِي أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا بَالَ أَحَدُكُمْ فَلَا يَمَسَّ ذَكَرَهُ بِيَمِينِهِ وَلَا يَسْتَنْجِي بِيَمِينِهِ وَلَا يَتَنَفَّسْ فِي الْإِنَاءِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] dari [Yahya] dari [Abdullah bin Abu Qatadah], ia berkata; telah menceritakan kepadaku [Ayahku] bahwa ia telah mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang diantara kalian kencing, hendaknya ia tidak memegang kemaluannya dengan tangan kanannya dan tidak cebok dengan tangan kanannya, serta janganlah ia bernafas dalam bejana.\""
            },
            {
                "number": 1678,
                "arab": " أَخْبَرَنَا إِسْحَقُ بْنُ عِيسَى حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ عَنْ سَعِيدِ بْنِ الْحَارِثِ الْأَنْصَارِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا مِنْ الْأَنْصَارِ يَعُودُهُ وَجَدْوَلٌ يَجْرِي فَقَالَ إِنْ كَانَ عِنْدَكُمْ مَاءٌ بَاتَ فِي الشَّنِّ وَإِلَّا كَرَعْنَا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Isa] telah menceritakan kepada kami [Fulaih bin Sulaiman] dari [Sa'id bin Al Harits Al Anshari] dari [Jabir bin Abdullah] ia berkata; Nabi shallallahu 'alaihi wasallam datang mengunjungi seorang laki-laki dari kalangan Anshar, sementara sungai kecil mengalir (di dekatnya). Kemudian beliau bersabda: \"Seandainya kalian memiliki air dalam bejana, jika tidak maka kami akan meminumnya (langsung) dengan mulut kami.\""
            },
            {
                "number": 1679,
                "arab": " حَدَّثَنَا مَنْصُورُ بْنُ سَلَمَةَ الْخُزَاعِيُّ حَدَّثَنَا شَرِيكٌ عَنْ عَبْدِ الْكَرِيمِ عَنْ الْبَرَاءِ ابْنِ ابْنَةِ أَنَسٍ عَنْ أَنَسٍ عَنْ أُمِّ سُلَيْمٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرِبَ مِنْ فَمِ قِرْبَةٍ قَائِمًا",
                "id": "Telah menceritakan kepada kami [Manshur bin Salamah Al Khuza'i] telah menceritakan kepada kami [Syarik] dari [Abdul Karim] dari [Al Bara`] cucu Anas, dari [Anas] dari [Ummu Sulaim] bahwa Nabi shallallahu 'alaihi wasallam minum dari mulut geriba sambil berdiri.\""
            },
            {
                "number": 1680,
                "arab": " حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا عِمْرَانُ بْنُ حُدَيْرٍ عَنْ أَبِي الْبَزَرِيِّ يَزِيدَ بْنِ عُطَارِدَ عَنْ ابْنِ عُمَرَ قَالَ كُنَّا نَشْرَبُ وَنَحْنُ قِيَامٌ وَنَأْكُلُ وَنَحْنُ نَسْعَى عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Imran bin Hudair] dari [Abu Al Bazari Yazid bin 'Utharid] dari [Ibnu Umar] ia berkata; \"Pada saman Rasulullah shallallahu 'alaihi wasallam, kami biasa minum sambil berdiri, dan makan sambil berjalan.\" Telah mengabarkan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Hafsh bin Ghiyats] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] sama seperti hadits di atas."
            },
            {
                "number": 1681,
                "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الشُّرْبِ قَائِمًا قَالَ فَسَأَلْتُهُ عَنْ الْأَكْلِ فَقَالَ ذَاكَ أَخْبَثُ",
                "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam melarang minum sambil berdiri.\" Anas berkata; kemudian aku bertanya kepada beliau mengenai makan, beliau bersabda: \"Itu lebih buruk lagi.\""
            },
            {
                "number": 1682,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ الرَّبِيعِ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي زِيَادٍ الطَّحَّانِ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ رَآهُ يَشْرَبُ قَائِمًا قِئْ قَالَ لِمَ قَالَ أَتُحِبُّ أَنْ تَشْرَبَ مَعَ الْهِرِّ قَالَ لَا قَالَ فَقَدْ شَرِبَ مَعَكَ شَرٌّ مِنْهُ الشَّيْطَانُ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin Ar Rabi'] telah menceritakan kepada kami [Syu'bah] dari [Abu Ziyad Ath Thahhan] ia berkata; aku mendengar [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda kepada seorang laki-laki yang beliau lihat sedang minum sambil berdiri: \"Muntahkanlah.\" Orang itu berkata; \"Kenapa?\" Beliau bersabda: \"Apakah kamu senang minum bersama kucing?\" laki-laki itu menjawab; \"Tidak.\" Beliau bersabda: \"Sungguh telah minum bersamamu sesuatu yang lebih buruk dari kucing yaitu Syetan.\""
            },
            {
                "number": 1683,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ عَنْ نَافِعٍ عَنْ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ عَنْ أُمِّ سَلَمَةَ أَنَّهَا أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الَّذِي يَشْرَبُ فِي آنِيَةٍ مِنْ فِضَّةٍ فَإِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Laits bin Sa'd] dari [Nafi'] dari [Zaid bin Abdullah bin Umar] dari [Abdullah bin Abdurrahman bin Abu Bakr] dari [Ummu Salamah] bahwa ia mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa minum dari bejana yang terbuat dari perak, sesungguhnya ia telah menuangkan api Jahannam ke dalam perutnya.\""
            },
            {
                "number": 1684,
                "arab": " حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ مُجَاهِدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَ خَرَجْنَا مَعَ حُذَيْفَةَ إِلَى الْمَدَائِنِ فَاسْتَسْقَى فَأَتَاهُ دِهْقَانٌ بِإِنَاءٍ مِنْ فِضَّةٍ فَرَمَى بِهِ وَجْهَهُ فَقُلْنَا اسْكُتُوا فَإِنَّا إِنْ سَأَلْنَاهُ لَمْ يُحَدِّثْنَا فَلَمَّا كَانَ بَعْدُ قَالَ أَتَدْرُونَ لِمَ رَمَيْتُهُ قُلْنَا لَا قَالَ إِنِّي كُنْتُ نَهَيْتُهُ وَذَكَرَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ الشُّرْبِ فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ وَعَنْ لُبْسِ الْحَرِيرِ وَالدِّيبَاجِ وَقَالَ هُمَا لَهُمْ فِي الدُّنْيَا وَلَكُمْ فِي الْآخِرَةِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Umar] telah menceritakan kepada kami [Ibnu 'Aun] dari [Mujahid] dari [Abdurrahman bin Abu Laila] ia berkata; kami pernah keluar bersama [Hudzaifah] menuju Madain, kemudian dia meminta air minum. Lantas Dihqan datang membawa bejana yang terbuat dari perak. Hudzaifah langsung melempar bejana tersebut ke wajahnya. Kami pun berkata; \"Diamlah kalian, sebab bila kita bertanya kepadanya, maka Hudzaifah tidak akan menceritakan kepada kita. Setelah itu, Hudzaifah berkata: \"Tahukah kalian, kenapa aku melemparnya?\" Kami menjawab: \"Tidak.\" Dia berkata; \"Sesungguhnya aku telah melarangnya....\" Abdurrahman bin Laila kemudian menyebutkan bahwa Nabi shallallahu 'alaihi wasallam telah melarang minum dari bejana yang terbuat dari emas dan perak, dan (melarang) mengenakan sutera dan dibaj (jenis sutera murni). Beliau bersabda: \"Keduanya adalah untuk mereka di dunia dan untuk kalian di Akhirat.\""
            },
            {
                "number": 1685,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ حَدَّثَنِي جَابِرٌ قَالَ حَدَّثَنِي أَبُو حُمَيْدٍ السَّاعِدِيُّ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَبَنٍ فَقَالَ أَلَا خَمَّرْتَهُ وَلَوْ تَعْرِضُ عَلَيْهِ عُودًا",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Abu Az Zubair] telah menceritakan kepadaku [Jabir] ia berkata; telah menceritakan kepadaku [Abu Humaid As Sa'idi] ia berkata; aku datang kepada Rasulullah shallallahu 'alaihi wasallam membawa susu. Kemudian beliau bersabda: \"Tidakkah engkau menutupinya walau hanya menaruh dahan diatasnya?\""
            },
            {
                "number": 1686,
                "arab": " حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ عَنْ خَالِدٍ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِتَغْطِيَةِ الْوَضُوءِ وَإِيكَاءِ السِّقَاءِ وَإِكْفَاءِ الْإِنَاءِ",
                "id": "Telah menceritakan kepada kami ['Amr bin 'Aun] dari [Khalid] dari [Suhail] dari [Ayahnya] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk menutupi (wadah) air untuk berwudhu, mengikat geriba, dan membalikkan bejana (apabila kosong).\""
            },
            {
                "number": 1687,
                "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ أَيُّوبَ بْنِ حَبِيبٍ عَنْ أَبِي الْمُثَنَّى الْجُهَنِيِّ قَالَ قَالَ مَرْوَانُ لِأَبِي سَعِيدٍ الْخُدْرِيِّ هَلْ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ النَّفْخِ فِي الشَّرَابِ قَالَ نَعَمْ",
                "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Ayyub bin Habib] dari [Abu Al Mutsanna Al Juhani] ia berkata; Marwan pernah berkata kepada [Abu Sa'id Al Khudri]; \"Apakah kamu pernah mendengar Rasulullah shallallahu 'alaihi wasallam melarang untuk meniup air minum?\" Dia menjawab; \"Ya.\""
            },
            {
                "number": 1688,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ عَنْ ابْنِ عُيَيْنَةَ عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ النَّفْخِ فِي الشَّرَابِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] dari [Ibnu 'Uyainah] dari [Abdul Karim Al Jazari] dari [Ikrimah] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam melarang meniup air minum.\""
            },
            {
                "number": 1689,
                "arab": " حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ وَسُلَيْمَانُ بْنُ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ عَنْ أَبِي قَتَادَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَاقِي الْقَوْمِ آخِرُهُمْ شُرْبًا",
                "id": "Telah menceritakan kepada kami ['Affan bin Muslim] telah menceritakan kepada kami [Hammad bin Salamah] dan [Sulaiman bin Al Mughirah] dari [Tsabit] dari [Abdullah bin Rabah] dari [Abu Qatadah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang menuangkan air minum adalah orang yang teraikhir minum.\""
            },
            {
                "number": 1690,
                "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبَانُ حَدَّثَنَا يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ قَوْلُ اللَّهِ { لَهُمْ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا } فَقَالَ سَأَلْتَنِي عَنْ شَيْءٍ مَا سَأَلَنِي عَنْهُ أَحَدٌ قَبْلَكَ أَوْ أَحَدٌ مِنْ أُمَّتِي قَالَ هِيَ الرُّؤْيَا الصَّالِحَةُ يَرَاهَا الْمُسْلِمُ أَوْ تُرَى لَهُ",
                "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Aban] telah menceritakan kepada kami [Yahya] dari [Abu Salamah] dari ['Ubadah bin Ash Shamit] ia berkata; aku berkata; \"Wahai Nabiyullah, apakah maksud firman Allah Bagi mereka berita gembira dikehidupan dunia.\" Beliau menjawab: \"Engkau telah menanyakan sesuatu yang belum pernah ditayakan seorangpun sebelummu, atau seorangpun dari umatku.\" Beliau bersabda: \"Itu adalah mimpi baik yang dimimpikan oleh seorang muslim atau diperlihatkan kepadanya.\""
            },
            {
                "number": 1691,
                "arab": " أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ عُبَادَةَ بْنِ الصَّامِتِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُؤْيَا الْمُؤْمِنِ جُزْءٌ مِنْ سِتَّةٍ وَأَرْبَعِينَ جُزْءًا مِنْ النُّبُوَّةِ",
                "id": "Telah mengabarkan kepada kami [Al Aswad bin 'Amir] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Anas] dari ['Ubadah bin Ash Shamit] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Mimpi seorang mukmin merupakan satu bagian dari empat puluh enam bagian kenabian.\""
            },
            {
                "number": 1692,
                "arab": " حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ عَنْ أَبِيهِ عَنْ سِبَاعِ بْنِ ثَابِتٍ عَنْ أُمِّ كُرْزٍ الْكَعْبِيَّةِ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ذَهَبَتْ النُّبُوَّةُ وَبَقِيَتْ الْمُبَشِّرَاتُ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['ubaidhullah bin Abu Yazid] dari [Ayahnya] dari [Siba' bin Tsabit] dari [Ummu Kurz Al Ka'biyyah] ia berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kenabian telah pergi dan yang tersisa adalah kabar gembira.\""
            },
            {
                "number": 1693,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي فَإِنَّ الشَّيْطَانَ لَا يَتَمَثَّلُ مِثْلِي",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Abu Al Ahwash] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa melihatku dalam mimpi, sungguh ia telah melihatku, karena sesungguhnya Syetan tidak dapat menyerupaiku.\""
            },
            {
                "number": 1694,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُصَفَّى حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي قَتَادَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَأَى الْحَقَّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mushaffa] telah menceritakan kepada kami [Muhammad bin Harb] dari [Az Zubaidi] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Qatadah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa melihatku dalam mimpi, maka ia telah melihat kebenaran.\""
            },
            {
                "number": 1695,
                "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرُّؤْيَا الصَّالِحَةُ مِنْ اللَّهِ وَالْحُلْمُ مِنْ الشَّيْطَانِ فَإِذَا حَلَمَ أَحَدُكُمْ حُلْمًا يَخَافُهُ فَلْيَبْصُقْ عَنْ شِمَالِهِ ثَلَاثَ مَرَّاتٍ وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ الشَّيْطَانِ فَإِنَّهَا لَا تَضُرُّهُ",
                "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] dari [Yahya] dari [Abdullah bin Abu Qatadah] dari [Ayahnya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mimpi baik datangnya dari Allah sedangkan mimpi buruk datangnya dari Syetan. Apabila salah seorang dari kalian mimpi buruk yang ia khawatirkan, hendaknya ia meludah ke sebelah kiri sebanyak tiga kali, dan berlindung kepada Allah dari Syetan, sebab hal itu tidak akan membahayakan dirinya.\""
            },
            {
                "number": 1696,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ قَالَ سَمِعْتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ يَقُولُ إِنْ كُنْتُ لَأَرَى الرُّؤْيَا تُمْرِضُنِي فَذَكَرْتُ ذَلِكَ لِأَبِي قَتَادَةَ قَالَ وَأَنَا إِنْ كُنْتُ لَأَرَى الرُّؤْيَا تُمْرِضُنِي حَتَّى سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الرُّؤْيَا الصَّالِحَةُ مِنْ اللَّهِ فَإِذَا رَأَى أَحَدُكُمْ مَا يُحِبُّ فَلْيَحْمَدْ اللَّهَ وَلَا يُحَدِّثْ بِهَا إِلَّا مَنْ يُحِبُّ وَإِذَا رَأَى مَا يَكْرَهُ فَلْيَتْفُلْ عَنْ يَسَارِهِ ثَلَاثًا وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّهَا وَلَا يُحَدِّثْ بِهَا أَحَدًا فَإِنَّهَا لَنْ تَضُرَّهُ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Syu'bah] dari [Abd Rabbih bin Sa'id] ia berkata; aku mendengar [Abu Salamah bin Abdurrahman] berkata; Sungguh aku pernah bermimpi sesuatu yang membuatku sakit, kemudian aku ceritakan kepada [Abu Qatadah]. Abu Qatadah berkata; \"Sungguh aku juga pernah bermimpi yang mmebuatkau sakit, hingga aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mimpi baik datangnya dari Allah, maka apabila salah seorang dari kalian bermimpi sesuatu yang ia senangi hendaknya ia memuji Allah, dan tidak menceritakannya kecuali kepada orang yang ia senangi. Apabila ia bermimpi sesuatu yang tidak ia senangi, hendaknya ia meludah ke sebelah kirinya sebanyak tiga kali dan berlindung kepada Allah dari keburukannya, serta tidak menceritakannya kepada seorangpun, maka hal itu tidak akan membahayakan dirinya.\""
            },
            {
                "number": 1697,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ مَخْلَدِ بْنِ حُسَيْنٍ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرُّؤْيَا ثَلَاثٌ فَالرُّؤْيَا الْحَسَنَةُ بُشْرَى مِنْ اللَّهِ وَالرُّؤْيَا تَحْزِينٌ مِنْ الشَّيْطَانِ وَالرُّؤْيَا مِمَّا يُحَدِّثُ بِهِ الْإِنْسَانُ نَفْسَهُ فَإِذَا رَأَى أَحَدُكُمْ مَا يَكْرَهُهُ فَلَا يُحَدِّثْ بِهِ وَلْيَقُمْ وَلْيُصَلِّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] dari [Makhlad bin Husain] dari [Hisyam] dari [Ibnu Sirin] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mimpi ada tiga, yaitu; mimpi baik yang merupakan kabar gembira dari Allah, dan mimpi menyedihkan yang datangnya dari Syetan, serta mimpi yang terjadi karena ilusi seseorang. Apabila salah seorang dari kalian bermimpi sesuatu yang tidak ia sukai, hendaknya ia tidak menceritakannya dan hendaknya ia berdiri lalu mengerjakan sholat.\""
            },
            {
                "number": 1698,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ مَخْلَدِ بْنِ حُسَيْنٍ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اقْتَرَبَ الزَّمَانُ لَمْ تَكَدْ رُؤْيَا الْمُؤْمِنِ تَكْذِبُ وَأَصْدَقُهُمْ رُؤْيَا أَصْدَقُهُمْ حَدِيثًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] dari [Makhlad bin Husain] dari [Hisyam] dari [Ibnu Sirin] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila zaman telah mendekati (hari Kiamat), nyaris mimpi seorang mukmin tidak (disertai) dengan kebohongan, maka orang yang paling benar mimpinya adalah orang yang paling jujur pembicaraannya.\""
            },
            {
                "number": 1699,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا إِسْرَائِيلُ عَنْ عَبْدِ الْأَعْلَى عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَنْ عَلِيٍّ يَرْفَعُ الْحَدِيثَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَذَبَ فِي حُلْمِهِ كُلِّفَ عَقْدَ شَعِيرَتَيْنِ يَوْمَ الْقِيَامَةِ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Isra`il] dari [Abdul A'la] dari [Abu Abdurrahman] dari [Ali] -yang dirafa'kan sampai kepada Nabi shallallahu 'alaihi wasallam- dia berkata: \"Barangsiapa berbohong dengan mimpinya, maka pada hari Kiamat akan dibebankan kepadanya untuk menghitung biji gandum.\""
            },
            {
                "number": 1700,
                "arab": " أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ دَرَّاجٍ أَبِي السَّمْحِ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصْدَقُ الرُّؤْيَا بِالْأَسْحَارِ",
                "id": "Telah mengabarkan kepada kami [Marwan bin Muhammad] telah menceritakan kepada kami [Abdullah bin Wahb] dari ['Amr bin Al Harits] dari [Darraj Abu As Samh] dari [Al Haitsam] dari [Abu Sa'id Al Khudri], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mimpi yang paling benar adalah pada waktu sahur.\""
            },
            {
                "number": 1701,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ لَا تَقُصُّوا الرُّؤْيَا إِلَّا عَلَى عَالِمٍ أَوْ نَاصِحٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Ibnu Sirin] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah kalian menceritakan mimpi kecuali kepada orang yang berilmui atau orang yang dapat memberikan nasehat.\""
            },
            {
                "number": 1702,
                "arab": " أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ قَالَ سَمِعْتُ وَكِيعَ بْنَ عُدُسٍ يُحَدِّثُ عَنْ عَمِّهِ أَبِي رَزِينٍ الْعُقَيْلِيِّ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الرُّؤْيَا هِيَ عَلَى رِجْلِ طَائِرٍ مَا لَمْ يُحَدَّثْ بِهَا فَإِذَا حُدِّثَ بِهَا وَقَعَتْ",
                "id": "Telah mengabarkan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin 'Atha`] ia berkata; aku mendengar [Waki' bin 'Udus] menceritakan dari pamannya yaitu [Abu Razin Al 'Uqaili] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mimpi tidak tetap keputusannya selama belum diceritakan, apabila telah diceritakan maka akan terjadi.\""
            },
            {
                "number": 1703,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ حَدَّثَنِي الْوَلِيدُ حَدَّثَنِي ابْنُ جَابِرٍ عَنْ خَالِدِ بْنِ اللَّجْلَاجِ وَسَأَلَهُ مَكْحُولٌ أَنْ يُحَدِّثَهُ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ عَائِشٍ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ رَأَيْتُ رَبِّي فِي أَحْسَنِ صُورَةٍ قَالَ فِيمَ يَخْتَصِمُ الْمَلَأُ الْأَعْلَى فَقُلْتُ أَنْتَ أَعْلَمُ يَا رَبِّ قَالَ فَوَضَعَ كَفَّهُ بَيْنَ كَتِفَيَّ فَوَجَدْتُ بَرْدَهَا بَيْنَ ثَدْيَيَّ فَعَلِمْتُ مَا فِي السَّمَوَاتِ وَالْأَرْضِ وَتَلَا { وَكَذَلِكَ نُرِي إِبْرَاهِيمَ مَلَكُوتَ السَّمَوَاتِ وَالْأَرْضِ وَلِيَكُونَ مِنْ الْمُوقِنِينَ }",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mubarak] telah menceritakan kepadaku [Al Walid bin Jabir] dari [Khalid bin Al Lajlaj] dan Makhul telah memintanya agar menceritakan kepadanya, ia berkata; \"Aku mendengar [Abdurrahman bin 'Aisy] berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku bermimpi melihat Tuhanku dalam bentuk yang sebaik-baiknya. Dia berfirman: \"Dalam masalah apakah para Malaikat berselisih?\" Lalu aku katakan: \"Engkau lebih mengetahui wahai Tuhanku.\" Beliau bersabda: \"Kemudian Dia meletakkan telapak tanganNya diantara kedua pundakku sehingga aku merasakan dingin tanganNya diantara kedua dadaku. Lalu aku mengetahui apa yang ada di langit dan bumi.\" Lalu beliau membaca ayat Dan demikianlah Kami perlihatkan kepada Ibrahim tanda-tanda keagungan (Kami yang terdapat) di langit dan bumi dan (Kami memperlihatkannya) agar dia termasuk orang yang yakin.\" QS Al An'am; 75."
            },
            {
                "number": 1704,
                "arab": " أَخْبَرَنَا نُعَيْمُ بْنُ حَمَّادٍ عَنْ عَبْدِ الْحَمِيدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ قُطْبَةَ عَنْ يُوسُفَ عَنْ ابْنِ سِيرِينَ قَالَ مَنْ رَأَى رَبَّهُ فِي الْمَنَامِ دَخَلَ الْجَنَّةَ",
                "id": "Telah mengabarkan kepada kami [Nu'aim bin Hammad] dari [Abdul Hamid bin Abdurrahman] dari [Quthbah] dari [Yusuf] dari [Ibnu Sirin] ia berkata; \"Barangsiapa bermimpi (bertemu) Rabbnya ketika tidur, maka ia akan masuk Surga.\""
            },
            {
                "number": 1705,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنَا إِبْرَاهِيمُ هُوَ ابْنُ سَعْدٍ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بَيْنَا إِذَا أَنَا نَائِمٌ رَأَيْتُ النَّاسَ يُعْرَضُونَ عَلَيَّ وَعَلَيْهِمْ قُمُصٌ مِنْهَا مَا يَبْلُغُ الثُّدِيَّ وَمِنْهَا مَا يَبْلُغُ دُونَ ذَلِكَ وَعُرِضَ عَلَيَّ عُمَرُ بْنُ الْخَطَّابِ وَعَلَيْهِ قَمِيصٌ يَجُرُّهُ فَقَالَ مَنْ حَوْلَهُ فَمَاذَا تَأَوَّلْتَ ذَلِكَ يَا رَسُولَ اللَّهِ قَالَ الدِّينَ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepada kami [Ibrahim yaitu Ibnu Sa'd] dari [Shalih bin Kaisan] dari [Ibnu Syihab] dari [Abu Umamah bin Sahl bin Hunaif] dari [Abu Sa'id Al Khudri] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika aku sedang tidur, aku melihat orang-orang diperlihakan kepadaku, mereka memakai jubah, diantaranya ada yang sampai ke dadanya, dan diantaranya ada yang sampai kurang dari itu, dan tidak lama kemudian ditampakkan kepadaku Umar bin Al Khathab sambil mengenakan jubah yang ia seret.\" Para sahabat yang ada disekitar beliau bertanya; \"Wahai Rasulullah, menurut anda bagaimana tafsir mimpi itu? Beliau menjawab: \"Itu tentang masalah Agama.\""
            },
            {
                "number": 1706,
                "arab": " أَخْبَرَنَا أَبُو عَلِيٍّ الْحَنَفِيُّ حَدَّثَنَا عَبْدُ اللَّهِ هُوَ ابْنُ عُمَرَ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ قَالَ كُنْتُ فِي عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا لِي مَبِيتٌ إِلَّا فِي مَسْجِدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَصْبَحَ يَأْتُونَهُ فَيَقُصُّونَ عَلَيْهِ الرُّؤْيَا قَالَ فَقُلْتُ مَا لِي لَا أَرَى شَيْئًا فَرَأَيْتُ كَأَنَّ النَّاسَ يُحْشَرُونَ فَيُرْمَى بِهِمْ عَلَى أَرْجُلِهِمْ فِي رَكِيٍّ فَأُخِذْتُ فَلَمَّا دَنَا إِلَى الْبِئْرِ قَالَ رَجُلٌ خُذُوا بِهِ ذَاتَ الْيَمِينِ فَلَمَّا اسْتَيْقَظْتُ هَمَّتْنِي رُؤْيَايَ وَأَشْفَقْتُ مِنْهَا فَسَأَلْتُ حَفْصَةَ عَنْهَا فَقَالَتْ نِعْمَ مَا رَأَيْتَ فَقُلْتُ لَهَا سَلِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَتْهُ فَقَالَ نِعْمَ الرَّجُلُ عَبْدُ اللَّهِ لَوْ كَانَ يُصَلِّي مِنْ اللَّيْلِ حَدَّثَنَا مُوسَى بْنُ خَالِدٍ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الْفَزَارِيِّ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ بِهَذَا الْحَدِيثِ قَالَ ابْنُ عُمَرَ وَكُنْتُ إِذَا نِمْتُ لَمْ أَقُمْ حَتَّى أُصْبِحَ قَالَ نَافِعٌ وَكَانَ ابْنُ عُمَرَ يُصَلِّي اللَّيْلَ",
                "id": "Telah mengabarkan kepada kami [Abu Ali Al Hanafi] telah menceritakan kepada kami [Abdullah yaitu Ibnu Umar] dari [Nafi'] bahwa [Ibnu Umar] berkata; Pada zaman Nabi shallallahu 'alaihi wasallam, aku tidak memiliki tempat bermalam kecuali di Masjid Nabi shallallahu 'alaihi wasallam. Pada pagi harinya Nabi shallallahu 'alaihi wasallam biasa didatangi orang-orang yang menceritakan berbagai mimpi kepada beliau. Lalu aku katakan; \"Kenapa aku tidak bermimpi sesuatu?\", Setelah itu aku bermimpi, seakan-akan manusia dikumpulkan, kemudian mereka dilemparkan dengan kaki terjungkir di sebuah sumur, kemudian aku ditangkap, tatkala hamper sampai kesebuah sumur, seorang laki-laki berkata; \"Tologn selamatkanlah ia ke sebelah kanan.\" setelah aku bangun, mimpiku itu membuatku resah dan khawatir. Kemudian kulaporkan mimpiku kepada Hafshah. Hafshah berkata; \"Alangkah indah mimpimu.\" Aku berkata kepadanya; \"Tolong tanyakan mimpiku kepada Nabi shallallahu 'alaihi wasallam.\" Setelah itu Hafshah bertanya kepada beliau, dan beliau bersabda: \"Sebaik-baik lelaki adalah Abdullah, seandainya ia sering melakukan sholat malam.\" Telah menceritakan kepada kami [Musa bin Khalid] dari [Ibrahim bin Muhammad Al Fazari] dari ['ubaidhullah dari [Nafi'] dari [Ibnu Umar] dengan hadits ini. Ibnu Umar mengatakan; \"Dan apabila aku tidur, aku tidak bengun hingga pagi hari.\" Nafi' berkata; \"Dan Ibnu Umar sering melakukan sholat malam.\""
            },
            {
                "number": 1707,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الصَّلْتِ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ ابْنِ عُمَرَ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بَيْنَا أَنَا نَائِمٌ إِذْ أُتِيتُ بِقَدَحٍ مِنْ لَبَنٍ فَشَرِبْتُ مِنْهُ حَتَّى إِنِّي لَأَرَى الرِّيَّ فِي ظُفْرِي أَوْ قَالَ فِي أَظْفَارِي ثُمَّ نَاوَلْتُ فَضْلَهُ عُمَرَ فَقَالُوا يَا رَسُولَ اللَّهِ مَا أَوَّلْتَهُ قَالَ الْعِلْمَ",
                "id": "Telah mengabarkan kepada kami [Muhammad Ash Shalt] telah menceritakan kepada kami [Ibnu Mubarak] dari [Yunus] dari [Az Zuhri] dari [Hamzah bin Abdullah bin Umar] dari [Ibnu Umar], ia berkata; aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Ketika aku tidur, tiba-tiba aku diberi segelas susu, kemudian aku meminum sebagian darinya hingga aku merasa puas sampai ke dalam kukuku -atau beliau berkata- dalam kuku-kukuku, kemudian aku berikan sisanya kepada Umar.\" Para sahabat bertanya; \"Wahai Rasulullah, apa yang anda tafsirkan?\" Beliau bersabda: \"Ilmu.\""
            },
            {
                "number": 1708,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ أَخْبَرَنَا الْوَلِيدُ حَدَّثَنَا ابْنُ جَابِرٍ حَدَّثَنِي مُحَمَّدُ بْنُ قَيْسٍ حَدَّثَنِي بَعْضُ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّبَنُ الْفِطْرَةُ وَالسَّفِينَةُ نَجَاةٌ وَالْجَمَلُ حُزْنٌ وَالْخُضْرَةُ الْجَنَّةُ وَالْمَرْأَةُ خَيْرٌ",
                "id": "Telah mengabarkan kepadaku [Al Hakam bin Al Mubarak] telah mengabarkan kepada kami [Al Walid] telah menceritakan kepada kami [Ibnu Jabir] telah menceritakan kepadaku [Muhammad bin Qais] telah menceritakan kepadaku [sebagian para sahabat] Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Susu adalah fitrah, perahu adalah keberhasilan, unta adalah kesedihan dan warna hijau adalah surga serta wanita adalah kebaikan.\""
            },
            {
                "number": 1709,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا سُلَيْمَانُ هُوَ ابْنُ كَثِيرٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ مِمَّا يَقُولُ لِأَصْحَابِهِ مَنْ رَأَى مِنْكُمْ رُؤْيَا فَلْيَقُصَّهَا عَلَيَّ فَأَعْبُرَهَا لَهُ قَالَ فَجَاءَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ رَأَيْتُ ظُلَّةً بَيْنَ السَّمَاءِ وَالْأَرْضِ تَنْطِفُ عَسَلًا وَسَمْنًا وَرَأَيْتُ أُنَاسًا يَتَكَفَّفُونَ مِنْهَا فَمُسْتَكْثِرٌ وَمُسْتَقِلٌّ وَرَأَيْتُ سَبَبًا وَاصِلًا مِنْ السَّمَاءِ إِلَى الْأَرْضِ فَأَخَذْتَ بِهِ فَعَلَوْتَ فَأَعْلَاكَ اللَّهُ ثُمَّ أَخَذَ بِهِ الَّذِي بَعْدَكَ فَعَلَا فَأَعْلَاهُ اللَّهُ ثُمَّ أَخَذَهُ الَّذِي بَعْدَهُ فَعَلَا فَأَعْلَاهُ اللَّهُ ثُمَّ أَخَذَهُ الَّذِي بَعْدَهُ فَقُطِعَ بِهِ ثُمَّ وُصِلَ فَاتَّصَلَ فَقَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ ائْذَنْ لِي فَأَعْبُرَهَا فَقَالَ اعْبُرْهَا وَكَانَ أَعْبَرَ النَّاسِ لِلرُّؤْيَا بَعْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَمَّا الظُّلَّةُ فَالْإِسْلَامُ وَأَمَّا الْعَسَلُ وَالسَّمْنُ فَالْقُرْآنُ حَلَاوَةُ الْعَسَلِ وَلِينُ السَّمْنِ وَأَمَّا الَّذِينَ يَتَكَفَّفُونَ مِنْهُ فَمُسْتَكْثِرٌ وَمُسْتَقِلٌّ فَهُمْ حَمَلَةُ الْقُرْآنِ فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَبْتَ وَأَخْطَأْتَ فَقَالَ فَمَا الَّذِي أَصَبْتُ وَمَا الَّذِي أَخْطَأْتُ فَأَبَى أَنْ يُخْبِرَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] telah menceritakan kepada kami [Sulaiman yaitu Ibnu Katsir] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] bahwa diantara yang disampaikan Rasulullah shallallahu 'alaihi wasallam kepada para sahabatnya adalah: \"Barangsiapa diantara kalian bermimpi, hendaknya ia menceritakannya kepadaku, hingga aku menafsirkan untuk dirinya.\" Kemudian seorang laki-laki datang dan berkata; \"Wahai Rasulullah, aku bermimpi melihat awan diantara langit dan bumi, awan tersebut meneteskan madu dan mentega. Dan aku melihat beberapa orang mengambil dengan telapak tangannya. Diantara mereka ada yang mengambil banyak dan ada yang mengambil sedikit. Dan aku melihat dari langit sampai ke bumi, kemudian engkau mengambilnya lalu engkau naik ke atas, dan Allah meninggikanmu, setelah itu orang setelahmu mengambilnya, lalu ia naik dan Allah pun meninggikannya, kemudian diambil orang setelahnya lalu ia naik dan Allah meninggikannya, kemudian diambil orang setelahnya lalu diputus, kemudian disambung sehingga tersambung.\" Abu Bakr berkata; \"Wahai Rasulullah, izinkan saya menafsirkannya.\" Beliau bersabda: \"Tafsirkan mimpi terssebut.\" -Abu Bakar adalah sosok yang pandai menafsirkan mimpi setelah Rasulullah shallallahu 'alaihi wasallam- ia berkata; \"Adapun awan tersebut adalah Islam, madu dan mentega adalah Al Qur'an, semanis madu dan selembut mentega. Sedangkan orang-orang yang mengambil dengan telapak tangannya kemudian ada yang mengambil banyak dan ada yang mengambil sedikit, mereka adalah para pembawa Al Qur'an.\" Setelah itu Rasulullah shallallahu 'alaihi wasallam bersabda; \"Engkau benar dan engkau salah.\" Lalu Abu Bakar berkata; \"Apa yang aku tafsirkan dengan benar dan apa yang aku tafsirkan dengan salah?\" Namun Rasulullah shallallahu 'alaihi wasallam enggan memberitahukannya."
            },
            {
                "number": 1710,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بَرِيدَ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَأَيْتُ فِي رُؤْيَايَ هَذِهِ أَنِّي هَزَزْتُ سَيْفًا فَانْقَطَعَ صَدْرُهُ فَإِذَا هُوَ مَا أُصِيبَ مِنْ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ ثُمَّ هَزَزْتُهُ أُخْرَى فَعَادَ كَأَحْسَنِ مَا كَانَ فَإِذَا هُوَ مَا جَاءَ اللَّهُ بِهِ مِنْ الْفَتْحِ وَاجْتِمَاعِ الْمُؤْمِنِينَ وَرَأَيْتُ فِيهَا أَيْضًا بَقَرًا وَاللَّهِ خَيْرٌ فَإِذَا هُوَ النَّفَرُ مِنْ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ وَإِذَا الْخَيْرُ مَا جَاءَ اللَّهُ بِهِ مِنْ الْخَيْرِ وَثَوَابِ الصِّدْقِ الَّذِي آتَانَا بَعْدَ يَوْمِ بَدْرٍ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abu Usamah] dari [Barid] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Aku melihat dalam mimpiku ini, bahwa aku mengayun-ayunkan pedang, hingga patah pada bagian pangkalnya, yang ternyata itu merupakan isyarat tentang apa yang menimpa Kaum Mu'minin pada perang Uhud, lalu aku mengayun-ayunkan kembali pedang tersebut hingga pedang itu kembali menjadi utuh seperti sedia kala, ternyata itu berarti apa yang Allah akan datangkan berupa kemenangan dan bersatunya Kaum Mu'minin dan aku melihat pula dalam mimpiku seekor sapi, yang demi Allah sangat bagus bentuknya, ternyata itu berarti Kaum Mu'minin pada perang Uhud yang akan mendapatkan kebaikan seperti yang Allah datangkan dari kebaikan dan pahala, sebagai janji yang benar yang telah Allah berikan kepada kita pada perang Badar.\""
            },
            {
                "number": 1711,
                "arab": " أَخْبَرَنَا الْحَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَأَيْتُ كَأَنِّي فِي دِرْعٍ حَصِينَةٍ وَرَأَيْتُ بَقَرًا يُنْحَرُ فَأَوَّلْتُ أَنَّ الدِّرْعَ الْمَدِينَةُ وَأَنَّ الْبَقَرَ نَفَرٌ وَاللَّهِ خَيْرٌ وَلَوْ أَقَمْنَا بِالْمَدِينَةِ فَإِذَا دَخَلُوا عَلَيْنَا قَاتَلْنَاهُمْ فَقَالُوا وَاللَّهِ مَا دُخِلَتْ عَلَيْنَا فِي الْجَاهِلِيَّةِ أَفَتُدْخَلُ عَلَيْنَا فِي الْإِسْلَامِ قَالَ فَشَأْنَكُمْ إِذًا وَقَالَتْ الْأَنْصَارُ لِبَعْضٍ رَدَدْنَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأْيَهُ فَجَاءُوا فَقَالُوا يَا رَسُولَ اللَّهِ شَأْنُكَ فَقَالَ الْآنَ إِنَّهُ لَيْسَ لِنَبِيٍّ إِذَا لَبِسَ لَأْمَتَهُ أَنْ يَضَعَهُ حَتَّى يُقَاتِلَ",
                "id": "Telah mengabarkan kepada kami [Al Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku bermimpi seakan saya memakai baju besi yang kuat dan aku juga bermimpi melihat seekor sapi yang disembelih, aku artikan baju besi yang kuat adalah Madinah, sedang makna sapi, demi Allah itu adalah sebuah kebaikan, jika saja kita bermukim di Madinah, lalu mereka (menyerang) kita disana, niscaya kita akan memerangi mereka.\" Para sahabat berkata; \"Wahai Rasulullah, demi Allah kami belum pernah diserang di kota Madinah semasa Jahiliyyah, bagaimana bisa kita diserang pada masa Islam?\" Beliau bersabda: \"Terserah kalian, kalau begitu.\" Lalu orang-orang Anshar berkata; \"Kami telah menolak pendapat Nabi shallallahu'alaihi wasallam', \" Akhirnya mereka datang dan berkata; \"Wahai Rasulullah, kalau begitu terserah anda.\" Beliau bersabda: \"Tidak layak bagi seorang Nabi jika telah memakai baju besi, lalu melepasnya kembali sampai ia berperang.\""
            },
            {
                "number": 1712,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْهَاشِمِيُّ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ رَأَيْتُ فِي الْمَنَامِ امْرَأَةً سَوْدَاءَ ثَائِرَةَ الشَّعْرِ تَفِلَةً أُخْرِجَتْ مِنْ الْمَدِينَةِ فَأُسْكِنَتْ مَهْيَعَةَ فَأَوَّلْتُهَا وَبَاءَ الْمَدِينَةِ يَنْقُلُهَا اللَّهُ إِلَى مَهْيَعَةَ",
                "id": "Telah mengabarkan kepadaku [Sulaiman bin Daud Al Hasyimi] telah menceritakan kepada kami [Ibnu Abu Az Zinad] dari [Musa bin 'Uqbah] dari [Salim bin Abdullah] dari [Ayahnya] ia berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku bermimpi melihat seorang wanita hitam yang berambut acak-acakan tanpa memakai minyak wangi, ia dikeluarkan dari Madinah dan ditempatkan di Mahya'ah (yaitu Juhfah). Maka aku menafsirkannya suatu penyakit yang ada di Madinah, lalu Allah pindahkan ke Mahya'ah.\""
            },
            {
                "number": 1713,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا يَحْيَى بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا عَبِيدَةُ بْنُ الْأَسْوَدِ عَنْ مُجَالِدٍ عَنْ عَامِرٍ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ يَوْمًا مِنْ الْأَيَّامِ إِنِّي رَأَيْتُ فِي الْمَنَامِ أَنَّ رَجُلًا أَتَانِي بِكُتْلَةٍ مِنْ تَمْرٍ فَأَكَلْتُهَا فَوَجَدْتُ فِيهَا نَوَاةً فَآذَتْنِي حِينَ مَضَغْتُهَا ثُمَّ أَعْطَانِي كُتْلَةً أُخْرَى فَقُلْتُ إِنَّ الَّذِي أَعْطَيْتَنِي وَجَدْتُ فِيهَا نَوَاةً آذَتْنِي فَأَكَلْتُهَا فَقَالَ أَبُو بَكْرٍ نَامَتْ عَيْنُكَ يَا رَسُولَ اللَّهِ هَذِهِ السَّرِيَّةُ الَّتِي بَعَثْتَ بِهَا غَنِمُوا مَرَّتَيْنِ كِلْتَاهُمَا وَجَدُوا رَجُلًا يَنْشُدُ ذِمَّتَكَ فَقُلْتُ لِمُجَالِدٍ مَا يَنْشُدُ ذِمَّتَكَ قَالَ يَقُولُ لَا إِلَهَ إِلَّا اللَّهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Yahya bin Abdurrahman] telah menceritakan kepada kami ['Ubaidah bin Al Aswad] dari [Mujalid] dari ['Amir] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam, bahwa suatu hari beliau bersabda: \"Aku bermimpi bahwa seorang laki-laki datang kepadaku dengan membawa sepotong kurma, kemudian aku memakannya lalu mendapatkan biji, laki-laki itu menggangguku ketika aku mengunyahnya. Kemudian ia memberiku sepotong yang lain, lalu aku katakan; \"Sesungguhnya yang engkau berikan kepadaku, telah aku dapatkan padanya biji yang menggangguku, lalu aku memakannya.\" Abu Bakr berkata; \"Semoga anda mendapatkan kelapangan dan kesejahteraan wahai Rasulullah, ini adalah pasukan yang engkau kirim memperoleh rampasan perang dua kali, keduanya mereka dapati seorang laki-laki yang meminta perlindunganmu.\" Kemudian aku katakan kepada Mujahid; \"Apakah maksud meminta perlindunganmu?\" Ia berkata; \"Mengucapkan LAA ILAAHA ILLALLAAH (tidak ada ilah yang berhak disembah selain Allah).\""
            },
            {
                "number": 1714,
                "arab": " أَخْبَرَنَا عُبَيْدُ بْنُ يَعِيشَ حَدَّثَنَا يُونُسُ هُوَ ابْنُ بُكَيْرٍ أَخْبَرَنَا ابْنُ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَتْ امْرَأَةٌ مِنْ أَهْلِ الْمَدِينَةِ لَهَا زَوْجٌ تَاجِرٌ يَخْتَلِفُ فَكَانَتْ تَرَى رُؤْيَا كُلَّمَا غَابَ عَنْهَا زَوْجُهَا وَقَلَّمَا يَغِيبُ إِلَّا تَرَكَهَا حَامِلًا فَتَأْتِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَقُولُ إِنَّ زَوْجِي خَرَجَ تَاجِرًا فَتَرَكَنِي حَامِلًا فَرَأَيْتُ فِيمَا يَرَى النَّائِمُ أَنَّ سَارِيَةَ بَيْتِي انْكَسَرَتْ وَأَنِّي وَلَدْتُ غُلَامًا أَعْوَرَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرٌ يَرْجِعُ زَوْجُكِ عَلَيْكِ إِنْ شَاءَ اللَّهُ تَعَالَى صَالِحًا وَتَلِدِينَ غُلَامًا بَرًّا فَكَانَتْ تَرَاهَا مَرَّتَيْنِ أَوْ ثَلَاثًا كُلُّ ذَلِكَ تَأْتِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَقُولُ ذَلِكَ لَهَا فَيَرْجِعُ زَوْجُهَا وَتَلِدُ غُلَامًا فَجَاءَتْ يَوْمًا كَمَا كَانَتْ تَأْتِيهِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَائِبٌ وَقَدْ رَأَتْ تِلْكَ الرُّؤْيَا فَقُلْتُ لَهَا عَمَّ تَسْأَلِينَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَمَةَ اللَّهِ فَقَالَتْ رُؤْيَا كُنْتُ أُرَاهَا فَآتِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْأَلُهُ عَنْهَا فَيَقُولُ خَيْرًا فَيَكُونُ كَمَا قَالَ فَقُلْتُ فَأَخْبِرِينِي مَا هِيَ قَالَتْ حَتَّى يَأْتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْرِضَهَا عَلَيْهِ كَمَا كُنْتُ أَعْرِضُ فَوَاللَّهِ مَا تَرَكْتُهَا حَتَّى أَخْبَرَتْنِي فَقُلْتُ وَاللَّهِ لَئِنْ صَدَقَتْ رُؤْيَاكِ لَيَمُوتَنَّ زَوْجُكِ وَتَلِدِينَ غُلَامًا فَاجِرًا فَقَعَدَتْ تَبْكِي وَقَالَتْ مَا لِي حِينَ عَرَضْتُ عَلَيْكِ رُؤْيَايَ فَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ تَبْكِي فَقَالَ لَهَا مَا لَهَا يَا عَائِشَةُ فَأَخْبَرْتُهُ الْخَبَرَ وَمَا تَأَوَّلْتُ لَهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَهْ يَا عَائِشَةُ إِذَا عَبَرْتُمْ لِلْمُسْلِمِ الرُّؤْيَا فَاعْبُرُوهَا عَلَى الْخَيْرِ فَإِنَّ الرُّؤْيَا تَكُونُ عَلَى مَا يَعْبُرُهَا صَاحِبُهَا فَمَاتَ وَاللَّهِ زَوْجُهَا وَلَا أُرَاهَا إِلَّا وَلَدَتْ غُلَامًا فَاجِرًا",
                "id": "Telah mengabarkan kepada kami ['Ubaid bin Ya'isy], telah menceritakan kepada kami [Yunus yaitu Ibnu Bukair], telah mengabarkan kepada kami [Ibnu Ishaq] dari [Muhammad bin 'Amr bin 'Atha`] dari [Sulaiman bin Yasar] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata; \"Seorang wanita dari penduduk Madinah memiliki suami seorang pedagang. Wanita itu juga pernah bermimpi. Setiap kali suaminya pergi, suaminya tidak pernah meninggalkannya kecuali dalam keadaan hamil. Kemudian wanita itu datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; \"Sesungguhnya suamiku keluar berdagang dan meninggalkanku dalam keadaan hamil, kemudian aku bermimpi seperti orang tidur yang bermimpi, bahwa tiang rumahku patah dan saya melahirkan anak yang buta.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Itu adalah kebaikan, suamimu akan kembali kepadamu dengan izin Allah ta'ala dalam keadaan baik, dan engkau akan melahirkan anak yang berbakti.\" Wanita tersebut bermimpi hingga dua atau tiga kali, setiap ia bermimpi, ia langsung datang menemui Rasulullah shallallahu 'alaihi wasallam, beliau pun mengatakan hal yang sama kepada wanita itu. Setelah itu suaminya kembali dan wanita itu melahirkan anak laki-laki, Suatu hari wanita itu datang sebagaimana dahulu ia datang, sementara Rasulullah shallallahu 'alaihi wasallam tidak berada di tempat. Sementara dirinya telah mengalami mimpi itu, kemudian aku katakan kepadanya; \"Apa yang pernah engkau tanyakan kepada Rasulullah shallallahu 'alaihi wasallam wahai hamba Allah?\" Wanita itu menjawab; \"Mimpi yang diperlihatkan kepadaku, kemudian aku datang kepada Rasulullah shallallahu 'alaihi wasallam dan bertanya kepada beliau mengenai mimpi tersebut, beliau bersabda: \"Baik.\" Ternyata mimpi itu telah terjadi seperti yang telah beliau ucapkan.\" Aku bertanya; \"Beritahukan kepadaku apa mimpi itu?\" Wanita itu menjawab; \"Nanti setelah Rasulullah shallallahu 'alaihi wasallam datang, hingga aku dapat menyampaikannya kepada beliau sebagaimana dahulu pernah aku sampaikan.\" Demi Allah aku masih tetap menungguinya hingga ia memberitahukan kepadaku. Lalu aku katakan; \"Demi Allah, seandainya mimpimu itu benar niscaya suamimu akan meninggal dan engkau melahirkan anak yang durhaka.\" Lalu wanita tersebut duduk sambil menangis, dan berkata; \"Kenapa aku mendapatkan hal ini ketika menyampaikan mimpiku kepadamu?\" Kemudian Rasulullah shallallahu 'alaihi wasallam masuk, sementara wanita itu masih saja menangis. Beliau bertanya: \"Ada apa dengannya wahai Aisyah?\" Aku memberitahukan berita tersebut kepada beliau, dan apa yang aku tafsirkan kepadanya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tahanlah perkataan itu wahai Aisyah! Apabila engkau menafsirkan (mimpi) seorang muslim untuk muslim lainnya, maka tafsirkanlah dengan kebaikan, karena sesungguhnya mimpi akan terjadi sesuai yang ditafsirkan orang yang menafsirkannya.\" Demi Allah, setelah itu suaminya meninggal dan tidaklah diperlihatkan kepadaku kecuali ia melahirkan anak yang durhaka.\""
            },
            {
                "number": 1715,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الْمُغَلِّسِ عَنْ أَبِي نَجِيحٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَدَرَ عَلَى أَنْ يَنْكِحَ فَلَمْ يَنْكِحْ فَلَيْسَ مِنَّا",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Abu Al Mughallis] dari [Abu Najih] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mampu menikah namun dia tidak menikah, maka dia bukan dari golongan kami.\""
            },
            {
                "number": 1716,
                "arab": " أَخْبَرَنَا يَعْلَى حَدَّثَنَا الْأَعْمَشُ عَنْ عُمَارَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ قَالَ قَالَ عَبْدُ اللَّهِ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَبَابٌ لَيْسَ لَنَا شَيْءٌ فَقَالَ يَا مَعْشَرَ الشَّبَابِ مَنْ اسْتَطَاعَ مِنْكُمْ الْبَاءَةَ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّ الصَّوْمَ لَهُ وِجَاءٌ",
                "id": "Telah mengabarkan keapda kami [Ya'la] telah menceritakan kepada kami [Al A'masy] dari ['Umarah] dari [Abdurrahman bin Yazid], ia berkata; [Abdullah] berkata; kami pernah bersama Rasulullah shallallahu 'alaihi wasallam, kami adalah para pemuda yang tidak memiliki sesuatupun, kemudian beliau bersabda: \"Wahai para pemuda, barangsiapa diantara kalian yang mampu menikah, hendaknya ia menikah, sesungguhnya hal itu lebih menundukkan pandangan dan lebih menjaga kemaluan, dan barangsiapa yang tidak mampu, hendaknya ia berpuasa, sesungguhnya berpuasa adalah benteng baginya.\""
            },
            {
                "number": 1717,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ لَقِيَهُ عُثْمَانُ وَأَنَا مَعَهُ فَقَالَ لَهُ يَا أَبَا عَبْدِ الرَّحْمَنِ هَلْ لَكَ فِي جَارِيَةٍ بِكْرٍ تُذَكِّرُكَ فَقَالَ لَئِنْ قُلْتَ ذَاكَ فَقَدْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَا مَعْشَرَ الشَّبَابِ مَنْ كَانَ يَسْتَطِيعُ مِنْكُمْ الْبَاءَةَ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَمْ يَسْتَطِعْ فَلْيَصُمْ فَإِنَّ الصَّوْمَ لَهُ وِجَاءٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] ia berkata; Utsman pernah bertemu dengannya, sementara aku bersamanya, lalu Utsman berkata; \"Wahai Abu Abdurrahman, apakah engkau mau menikah dengan wanita yang masih perawan dan dapat mengingatkan dirimu?\" Abdullah berkata; \"Jika engkau mengatakan demikian, maka sungguh aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai para pemuda, barangsiapa diantara kalian yang mampu menikah, hendaknya ia menikah, sesungguhnya hal itu lebih menundukkan pandangan dan lebih menjaga kemaluan, barang siapa yang tidak mampu, maka hendaknya ia berpuasa, sesungguhnya berpuasa adalah benteng baginya.\""
            },
            {
                "number": 1718,
                "arab": " أَخْبَرَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّهُ سَمِعَ سَعْدَ بْنَ أَبِي وَقَّاصٍ يَقُولُ لَقَدْ رَدَّ ذَلِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى عُثْمَانَ وَلَوْ أَجَازَ لَهُ التَّبَتُّلَ لَاخْتَصَيْنَا",
                "id": "Telah mengabarkan kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepadaku [Sa'id bin Al Musayyab] bahwa ia mendengar [Sa'd bin Abu Waqqash] berkata; \"Sungguh Rasulullah shallallahu 'alaihi wasallam telah menolak Utsman (bin Mazh'un) untuk hidup membujang, seandainya beliau memperbolehkan baginya hidup membujang, niscaya kami telah mengebiri.\""
            },
            {
                "number": 1719,
                "arab": " أَخْبَرَنَا إِسْحَقُ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ حَدَّثَنَا الْأَشْعَثُ بْنُ عَبْدِ الْمَلِكِ عَنْ الْحَسَنِ عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ قَالَتْ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ التَّبَتُّلِ",
                "id": "Telah mengabarkan kepada kami [Ishaq] telah menceritakan kepada kami [Hammad bin Mas'adah] telah menceritakan kepada kami [Al Asy'ats bin Abdul Malik] dari [Al Hasan] dari [Sa'd bin Hisyam] dari ['Aisyah] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang hidup membujang.\""
            },
            {
                "number": 1720,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ الْحِزَامِيُّ حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ حَدَّثَنِي ابْنُ إِسْحَقَ حَدَّثَنِي الزُّهْرِيُّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ لَمَّا كَانَ مِنْ أَمْرِ عُثْمَانَ بْنِ مَظْعُونٍ الَّذِي كَانَ مِنْ تَرْكِ النِّسَاءِ بَعَثَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا عُثْمَانُ إِنِّي لَمْ أُومَرْ بِالرَّهْبَانِيَّةِ أَرَغِبْتَ عَنْ سُنَّتِي قَالَ لَا يَا رَسُولَ اللَّهِ قَالَ إِنَّ مِنْ سُنَّتِي أَنْ أُصَلِّيَ وَأَنَامَ وَأَصُومَ وَأَطْعَمَ وَأَنْكِحَ وَأُطَلِّقَ فَمَنْ رَغِبَ عَنْ سُنَّتِي فَلَيْسَ مِنِّي يَا عُثْمَانُ إِنَّ لِأَهْلِكَ عَلَيْكَ حَقًّا وَلِعَيْنِكَ عَلَيْكَ حَقًّا قَالَ سَعْدٌ فَوَاللَّهِ لَقَدْ كَانَ أَجْمَعَ رِجَالٌ مِنْ الْمُسْلِمِينَ عَلَى أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ هُوَ أَقَرَّ عُثْمَانَ عَلَى مَا هُوَ عَلَيْهِ أَنْ نَخْتَصِيَ فَنَتَبَتَّلَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Zaid Al Hizami] telah menceritakan kepada kami [Yunus bin Bukair] telah menceritakan kepadaku [Ibnu Ishaq] telah menceritakan kepadaku [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Sa'd bin Abu Waqqash] ia berkata; Ketika terjadi permasalahan Utsman bin Mazh'un yaitu ketika ia tidak ingin menikahi wanita, maka Rasulullah shallallahu 'alaihi wasallam mengirim utusan kepadanya untuk mengatakan: \"Wahai Utsman, sesungguhnya aku tidak diutus dengan membawa ajaran untuk tidak beristeri dan mengurung diri dalam tempat ibadah. Apakah engkau tidak suka terhadap sunahku?\" Ia berkata; \"Tidak wahai Rasulullah.\" Beliau bersabda: \"Sesungguhnya diantara sunahku adalah melakukan sholat dan tidur, berpuasa dan makan, menikah dan menceraikan. Barangsiapa tidak menyukai sunahku, maka bukan dari gologanku. Wahai Utsman, sesungguhnya keluargamu memiliki hak atas dirimu, matamu memiliki hak atas dirimu.\" Sa'd berkata; \"Demi Allah, kaum Muslimin telah bersepakat, apabila Rasulullah shallallahu 'alaihi wasallam menetapkan Utsman dalam kondisinya (tidak menikah), niascaya kami telah mengebiri dan tidak menikah.\""
            },
            {
                "number": 1721,
                "arab": " أَخْبَرَنَا صَدَقَةُ بْنُ الْفَضْلِ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُنْكَحُ النِّسَاءُ لِأَرْبَعٍ لِلدِّينِ وَالْجَمَالِ وَالْمَالِ وَالْحَسَبِ فَعَلَيْكَ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ عَبْدِ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ",
                "id": "Telah mengabarkan kepada kami [Shadaqah bin Al Fadhl] telah mengabarkan kepada kami [Yahya bin Sa'id] dari ['ubaidhullah] dari [Sa'id bin Abu Sa'id] dari [Ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Wanita dinikahi karena empat hal, yaitu; karena agamanya, kecantikannya, hartanya dan keturunannya. Maka carilah yang baik agamanya, niscaya engkau akan beruntung.\" Telah mengabarkan kepada kami [Muhammad bin 'Uyainah] dari [Ali bin Mushir] dari [Abdul Malik] dari ['Atha`] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini."
            },
            {
                "number": 1722,
                "arab": " أَخْبَرَنَا قَبِيصَةُ حَدَّثَنَا سُفْيَانُ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ أَنَّهُ خَطَبَ امْرَأَةً مِنْ الْأَنْصَارِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اذْهَبْ فَانْظُرْ إِلَيْهَا فَإِنَّهُ أَجْدَرُ أَنْ يُؤْدَمَ بَيْنَكُمَا",
                "id": "Telah mengabarkan kepada kami [Qabishah] telah menceritakan kepada kami [Sufyan] dari ['Ashim Al Ahwal] dari [Bakr bin Abdullah Al Muzani] dari [Al Mughirah bin Syu'bah] bahwa ia pernah melamar seorang wanita Anshar, Maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Pergi dan lihatlah dia, karena hal itu lebih melanggengkan diantara kalian berdua.\""
            },
            {
                "number": 1723,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ الْعَبْدِيُّ الْبَصْرِيُّ أَخْبَرَنَا سُفْيَانُ عَنْ يُونُسَ عَنْ الْحَسَنِ قَالَ سَمِعْتُهُ يَقُولُ قَدِمَ عَقِيلُ بْنُ أَبِي طَالِبٍ الْبَصْرَةَ فَتَزَوَّجَ امْرَأَةً مِنْ بَنِي جُشَمٍ فَقَالُوا لَهُ بِالرِّفَاءِ وَالْبَنِينَ فَقَالَ لَا تَقُولُوا ذَلِكَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَانَا عَنْ ذَلِكَ وَأَمَرَنَا أَنْ نَقُولَ بَارَكَ اللَّهُ لَكَ وَبَارَكَ عَلَيْكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir Al 'Abdi Al Bashri] telah mengabarkan kepada kami [Sufyan] dari [Yunus] dari [Al Hasan] ia berkata; Aku mendengar dia berkata; ['Aqil bin Abu Thalib] datang ke Bashrah kemudian menikahi seorang wanita dari Bani Jusyam, Orang-orang pun mengatakan kepadanya; \"Selamat sejahtera.\" Al Hasan berkata; \"Janganlah kalian mengatakan hal itu, sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah melarang kami mengatakan seperti itu, beliau memerintahkan kami suapya mengatakan; \"BAARAKALLAHU LAKA WA BAARAKA 'ALAIKA (semoga Allah memberkahimu dan senantiasa memberkahimu).\""
            },
            {
                "number": 1724,
                "arab": " حَدَّثَنَا نُعَيْمُ بْنُ حَمَّادٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا رَفَّأَ لِإِنْسَانٍ قَالَ بَارَكَ اللَّهُ لَكَ وَبَارَكَ عَلَيْكَ وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
                "id": "Telah menceritakan kepada kami [Nu'aim bin Hammad] telah menceritakan kepada kami [Abdul Aziz] dari [Suhail] dari [Ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bahwa jika beliau mengucapkan selamat kepada seseorang, maka beliau mengatakan: \"BAARAKALLAHU LAKA WA WABAARAKA 'ALAIKUM WA JAMA'A BAINAKUMA FI KHAIR (Semoga Allah memberi berkah kepada kamu disaat senang dan susah, serta mengumpulkan kalian dalam kebaikan.\""
            },
            {
                "number": 1725,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ أَنْ يَخْطُبَ الرَّجُلُ عَلَى خِطْبَةِ أَخِيهِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah] dari [Suhail bin Abu Shalih] dari [Ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bahwa beliau melarang seorang laki-laki meminang (wanita) yang telah dipinang saudaranya."
            },
            {
                "number": 1726,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ عَنْ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَخْطُبُ أَحَدُكُمْ عَلَى خِطْبَةِ أَخِيهِ وَلَا يَبِيعُ عَلَى بَيْعِ أَخِيهِ حَتَّى يَأْذَنَ لَهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami ['Uqbah bin Khalid] dari ['ubaidhullah] ia berkata; telah menceritakan kepadaku [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang diantara kalian meminang (wanita) yang telah dipinang saudaranya, dan janganlah menjual (barang) yang telah dibeli saudaranya, hingga saudaranya memberikan izin.\""
            },
            {
                "number": 1727,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ أَنَّهَا حَدَّثَتْهُ وَكَتَبَهُ مِنْهَا كِتَابًا أَنَّهَا كَانَتْ تَحْتَ رَجُلٍ مِنْ قُرَيْشٍ مِنْ بَنِي مَخْزُومٍ فَطَلَّقَهَا الْبَتَّةَ فَأَرْسَلَتْ إِلَى أَهْلِهِ تَبْتَغِي مِنْهُمْ النَّفَقَةَ فَقَالُوا لَيْسَ لَكِ نَفَقَةٌ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَيْسَ لَكِ نَفَقَةٌ وَعَلَيْكِ الْعِدَّةُ وَانْتَقِلِي إِلَى بَيْتِ أُمِّ شَرِيكٍ وَلَا تُفَوِّتِينَا بِنَفْسِكِ ثُمَّ قَالَ إِنَّ أُمَّ شَرِيكٍ امْرَأَةٌ يَدْخُلُ عَلَيْهَا إِخْوَانُهَا مِنْ الْمُهَاجِرِينَ وَلَكِنْ انْتَقِلِي إِلَى بَيْتِ ابْنِ أُمِّ مَكْتُومٍ فَإِنَّهُ رَجُلٌ أَعْمَى إِنْ وَضَعْتِ ثِيَابَكِ لَمْ يَرَ شَيْئًا وَلَا تُفَوِّتِينَا بِنَفْسِكِ فَانْطَلَقَتْ إِلَى بَيْتِ ابْنِ أُمِّ مَكْتُومٍ فَلَمَّا حَلَّتْ ذَكَرَتْ أَنَّ مُعَاوِيَةَ وَأَبَا جَهْمٍ خَطَبَاهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا مُعَاوِيَةُ فَرَجُلٌ لَا مَالَ لَهُ وَأَمَّا أَبُو جَهْمٍ فَلَا يَضَعُ عَصَاهُ عَنْ عَاتِقِهِ فَأَيْنَ أَنْتُمْ مِنْ أُسَامَةَ فَكَأَنَّ أَهْلَهَا كَرِهُوا ذَلِكَ فَقَالَتْ وَاللَّهِ لَا أَنْكِحُ إِلَّا الَّذِي قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَكَحَتْ أُسَامَةَ قَالَ مُحَمَّدُ بْنُ عَمْرٍو قَالَ مُحَمَّدُ بْنُ إِبْرَاهِيمَ يَا فَاطِمَةُ اتَّقِي اللَّهَ فَقَدْ عَلِمْتِ فِي أَيِّ شَيْءٍ كَانَ هَذَا قَالَ وَقَالَ ابْنُ عَبَّاسٍ قَالَ اللَّهُ تَعَالَى { لَا تُخْرِجُوهُنَّ مِنْ بُيُوتِهِنَّ وَلَا يَخْرُجْنَ إِلَّا أَنْ يَأْتِينَ بِفَاحِشَةٍ مُبَيِّنَةٍ } وَالْفَاحِشَةُ أَنْ تَبْذُوَ عَلَى أَهْلِهَا فَإِذَا فَعَلَتْ ذَلِكَ فَقَدْ حَلَّ لَهُمْ أَنْ يُخْرِجُوهَا",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Muhammad bin 'Amr] dari [Abu Salamah] dari [Fathimah binti Qais] bahwa ia menceritakan kepadanya; \"Abu Salamah pernah mendapatkan surat darinya bahwa dirinya dahulu pernah menjadi isteri seorang laki-laki Quraisy dari Bani Makhzum, kemudian ia mencerainya sekaligus. Kemudian Fathimah mengirimkan utusan kepada keluarga suaminya menuntut nafkah dari mereka. Namun mereka mengatakan; \"Engkau tidak lagi mendapatkan nafkah.\" Ketika hal tersebut sampai kepada Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Egkau tidak lagi mendapatkan nafkah, dan harus menunggu masa iddah, pindahlah ke rumah Ummu Syarik, dan janganlah kamu mengabaikan kami supaya dapat memberitahukan mengenai dirimu.\" Kemudian beliau bersabda: \"Sesungguhnya Ummu Syarik adalah seorang wanita yang sering dikunjungi saudara-saudaranya dari kalangan muhajirin, oleh karena itu pindahlah ke rumah Ibnu Ummi Maktum. Karena ia seorang lelaki buta, apabila engkau menanggalkan pakaianmu, maka ia tidak akan melihat sesuatupun. Dan janganlah engkau mengabaikan kami supaya kami dapat memberitakan mengenai dirimu.\" Kemudian ia pergi ke rumah Ibnu Ummi Maktum, setelah masa 'iddahnya selesai, ia menyebutkan bahwa Mu'awiyah dan Abu Jahm telah melamarnya. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mu'awiyah adalah laki-laki yang tidak memiliki harta, sementara Abu Jahm adalah seseorang yang tidak dapat meletakkan tongkatnya dari pundak. Bagaimana pendapatmu dengan Usamah?\" namun sepertinya keluarga Fathimah tidak menyukai hal itu. Tapi ia berkata; \"Demi Allah, aku tidak akan menikah kecuali dengan orang yang telah dikatakan Rasulullah shallallahu 'alaihi wasallam.\" Kemudian ia menikah dengan Usamah. Muhammad bin 'Amr berkata; Muhammad bin Ibrahim mengatakan (dengan redaksi); \"Wahai Fathimah, bertaqwalah kepada Allah. Sungguh kalian telah mengetahui mengenai hal ini.\" Ibnu Abbas berkata; Allah Ta'ala berfirman: Janganlah kamu keluarkan mereka dari rumah mereka dan janganlah mereka (diizinkan) ke luar kecuali mereka mengerjakan perbuatan keji yang terang.\" QS Ath Thallaq; 1. Perbuatan faisyah adalah berbuat keji kepada keluarganya, apabila ia melakukan hal itu, maka telah halal bagi mereka untuk mengeluarkannya.\""
            },
            {
                "number": 1728,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا دَاوُدُ يَعْنِي ابْنَ أَبِي هِنْدٍ حَدَّثَنَا عَامِرٌ حَدَّثَنَا أَبُو هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ تُنْكَحَ الْمَرْأَةُ عَلَى عَمَّتِهَا وَالْعَمَّةُ عَلَى ابْنَةِ أَخِيهَا أَوْ الْمَرْأَةُ عَلَى خَالَتِهَا أَوْ الْخَالَةُ عَلَى بِنْتِ أُخْتِهَا وَلَا تُنْكَحُ الصُّغْرَى عَلَى الْكُبْرَى وَلَا الْكُبْرَى عَلَى الصُّغْرَى",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Daud yaitu Ibnu Abu Hindun] telah menceritakan kepada kami ['Amir] telah menceritakan kepada kami [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam melarang seorang wanita dinikahi sebagai madu bagi bibinya (dari pihak ayah) dan bibi (dari pihak ayah) menjadi madu bagi anak saudaranya, atau seorang wanita menjadi madu bagi bibinya (dari pihak ibu) atau seorang bibi (dari pihak ibu) menjadi madu bagi anak saudara perempuannya, dan tidak boleh adik perempuan dinikahi sebagai madu bagi kakak perempuannya dan seorang kakak perempuan menjadi madu bagi adik peremuannya.\""
            },
            {
                "number": 1729,
                "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا مَالِكٌ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُجْمَعَ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا وَالْمَرْأَةِ وَخَالَتِهَا",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam melarang seorang wanita dimadu dengan bibinya (dari pihak ayah) dan seorang wanita dimadu dengan bibinya (dari pihak ibu).\""
            },
            {
                "number": 1730,
                "arab": " حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الشِّغَارِ قَالَ مَالِكٌ وَالشِّغَارُ أَنْ يُزَوِّجَ الرَّجُلُ الْآخَرَ ابْنَتَهُ عَلَى أَنْ يُزَوِّجَهُ الْآخَرُ ابْنَتَهُ بِغَيْرِ صَدَاقٍ قِيلَ لِأَبِي مُحَمَّدٍ تَرَى بَيْنَهُمَا نِكَاحًا قَالَ لَا يُعْجِبُنِي",
                "id": "Telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang (nikah) syighar.\" Malik berkata; syighar adalah seorang laki-laki menikahkan orang lain dengan putrinya dengan syarat orang tersebut menikahkannya dengan putrinya tanpa ada mahar.\" Abu Muhammad ditanya; \"Apakah anda melihat diantara mereka terjadi pernikahan?\" Ia berkata; \"Hal itu tidak membuatku heran.\""
            },
            {
                "number": 1731,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ إِبْرَاهِيمَ بْنِ عُمَرَ بْنِ كَيْسَانَ عَنْ أَبِيهِ عَنْ وَهْبِ بْنِ أَبِي مُغِيثٍ حَدَّثَتْنِي أَسْمَاءُ بِنْتُ أَبِي بَكْرٍ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَنْكِحُوا الصَّالِحِينَ وَالصَّالِحَاتِ قَالَ أَبُو مُحَمَّد وَسَقَطَ عَلَيَّ مِنْ الْحَدِيثِ فَمَا تَبِعَهُمْ بَعْدُ فَحَسَنٌ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Ibrahim bin Umar bin Kaisan] dari [bapaknya] dari [Wahb bin Abu Mughits] telah menceritakan kepadaku [Asma` binti Abu Bakr] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Nikahkanlah laki-laki yang shalih dengan wanita yang Shalihah.\" Abu Muhammad berkata; (sebagian) Hadits tersebut gugur dariku, dan apa yang diiringkan kepada mereka adalah baik."
            },
            {
                "number": 1732,
                "arab": " أَخْبَرَنَا مَالِكُ بْنُ إِسْمَعِيلَ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي بُرْدَةَ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نِكَاحَ إِلَّا بِوَلِيٍّ",
                "id": "Telah mengabarkan kepadaku [Malik bin Isma'il] telah menceritakan kepada kami [Isra`il] dari [Abu Ishaq] dari [Abu Burdah] dari [Ayahnya], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak sah pernikahan tanpa seorang wali.\""
            },
            {
                "number": 1733,
                "arab": " حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نِكَاحَ إِلَّا بِوَلِيٍّ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr] telah mengceritakan kepada kami [Syarik] dari [Abu Ishaq] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidak sah pernikahan kecuali dengan seorang wali.\""
            },
            {
                "number": 1734,
                "arab": " حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا امْرَأَةٍ نُكِحَتْ بِغَيْرِ إِذْنِ وَلِيِّهَا فَنِكَاحُهَا بَاطِلٌ فَنِكَاحُهَا بَاطِلٌ فَنِكَاحُهَا بَاطِلٌ فَإِنْ اشْتَجَرُوا قَالَ أَبُو عَاصِمٍ وَقَالَ مَرَّةً فَإِنْ تَشَاجَرُوا فَالسُّلْطَانُ وَلِيُّ مَنْ لَا وَلِيَّ لَهُ فَإِنْ أَصَابَهَا فَلَهَا الْمَهْرُ بِمَا اسْتَحَلَّ مِنْ فَرْجِهَا قَالَ أَبُو عَاصِمٍ أَمْلَاهُ عَلَيَّ سَنَةَ سِتٍّ وَأَرْبَعِينَ وَمِائَةٍ",
                "id": "Telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Sulaiman bin Musa] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda; \"Siapapun wanita yang dinikahkan tanpa seizin walinya, maka nikahnya tidak sah, nikahnya tidak sah, nikahnya tidak sah, walaupun mereka berseteru.\" Abu 'Ashim berkata; Dan sesekali beliau bersabda: \"Apabila mereka saling berseteru, maka penguasa adalah wali bagi orang yang tidak memiliki wali, apabila telah digauli, maka wanita tersebut mendapatkan maharnya karena ia telah menghalalkan farjinya.\" Abu 'Ashim berkata; Ibnu Juraij mendektekannya kepadaku pada tahun seratus empat puluh enam."
            },
            {
                "number": 1735,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ حَدَّثَنِي أَبُو بُرْدَةَ بْنُ أَبِي مُوسَى عَنْ أَبِي مُوسَى قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُسْتَأْمَرُ الْيَتِيمَةُ فِي نَفْسِهَا فَإِنْ سَكَتَتْ فَقَدْ أَذِنَتْ وَإِنْ أَبَتْ لَمْ تُكْرَهْ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Yunus bin Abu Ishaq] telah menceritakan kepadaku [Abu Burdah bin Abu Musa] dari [Abu Musa], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Anak perempuan yatim dimintai pendapatnya terhadap dirinya, apabila ia diam, maka sungguh ia telah mengizinkan dan apabila ia menolak maka tidak boleh dipaksa.\""
            },
            {
                "number": 1736,
                "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُنْكَحُ الثَّيِّبُ حَتَّى تُسْتَأْمَرَ وَلَا تُنْكَحُ الْبِكْرُ حَتَّى تُسْتَأْذَنَ وَإِذْنُهَا الصُّمُوتُ أَخْبَرَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ أَنَّ أَبَا هُرَيْرَةَ حَدَّثَهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepadaku [Yahya] dari [Abu Salamah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang janda tidak dinikahkan hingga dimintai pendapatnya, dan seorang gadis tidak dinikahkan hingga dimintai izinnya dan izinnya adalah diam.\" Telah mengabarkan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Abu Salamah] bahwa [Abu Hurairah] menceritakan kepadanya dari Rasulullah shallallahu 'alaihi wasallam dengan hadits ini."
            },
            {
                "number": 1737,
                "arab": " حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَيِّمُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ تُسْتَأْذَنُ فِي نَفْسِهَا وَإِذْنُهَا صُمَاتُهَا",
                "id": "Telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Abdullah bin Al Fadhl] dari [Nafi' bin Jubair bin Muth'im] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wanita janda lebih berhak terhadap dirinya daripada walinya, dan seorang gadis dimintai izin terhadap dirinya, dan izinnya adalah diam.\""
            },
            {
                "number": 1738,
                "arab": " حَدَّثَنَا إِسْحَقُ بْنُ عِيسَى حَدَّثَنِي مَالِكٌ أَوَّلُ شَيْءٍ سَأَلْتُهُ عَنْهُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْفَضْلِ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُسْتَأْذَنُ الْبِكْرُ وَإِذْنُهَا صُمَاتُهَا",
                "id": "Telah menceritakan kepada kami [Ishaq bin Isa] telah menceritakan kepadaku [Malik] pertama kali yang saya tanyakan kepadanya adalah ia berkata; telah menceritakan kepada kami [Abdullah bin Al Fadhl] dari [Nafi' bin Jubair] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang gadis diminta izin, dan izinnya adalah diam.\""
            },
            {
                "number": 1739,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ مَوْهَبٍ أَخْبَرَنَا نَافِعُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْأَيِّمُ أَمْلَكُ بِأَمْرِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ تُسْتَأْمَرُ فِي نَفْسِهَا وَصَمْتُهَا إِقْرَارُهَا",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepadaku ['ubaidhullah bin Abdurrahman bin Mauhib] telah mengabarkan kepada kami [Nafi' bin Jubair bin Muth'im] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang janda lebih berkuasa terpadap urusannya daripada walinya, dan seorang gadis dimintai pendapatnya mengenai dirinya, dan diamnya adalah tanda setujunya.\""
            },
            {
                "number": 1740,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ أَنَّهُ سَمِعَ الْقَاسِمَ بْنَ مُحَمَّدٍ أَنَّهُ سَمِعَ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ وَمُجَمِّعَ بْنَ يَزِيدَ الْأَنْصَارِيَّيْنِ حَدَّثَاهُ أَنَّ رَجُلًا مِنْهُمْ مِنْ الْأَنْصَارِ يُدْعَى خِذَامًا أَنْكَحَ بِنْتًا لَهُ فَكَرِهَتْ نِكَاحَ أَبِيهَا فَأَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ ذَلِكَ لَهُ فَرَدَّ عَنْهَا نِكَاحَ أَبِيهَا فَنَكَحَتْ أَبَا لُبَابَةَ بْنَ عَبْدِ الْمُنْذِرِ فَذَكَرَ يَحْيَى أَنَّهُ بَلَغَهُ أَنَّهَا كَانَتْ ثَيِّبًا",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Yahya bin Sa'id] bahwa ia mendengar [Al Qasim bin Muhammad] bahwa ia mendengar [Abdurrahman bin Yazid] dan [Mujammi' bin Yazid Al Anshari] mereka berdua telah menceritakan kepadanya, bahwa seorang laki-laki dari Anshar yang disebut Khidzam pernah menikahkan putrinya, ternyata putrinya tidak senang dengan pernikahan ayahnya, lantas putrinya datang menemui Rasulullah shallallahu 'alaihi wasallam dan menceritakan hal tersebut kepada beliau. Beliau pun membatalkan pernikahan ayahnya, kemudian beliau menikah dengan Abu Lubabah bin Abdul Mundzir.\" Yahya menyebutkan; telah sampai kepadanya bahwa wanita tersebut adalah seorang janda."
            },
            {
                "number": 1741,
                "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَبْدِ الرَّحْمَنِ وُمُجَمِّعٍ ابْنَيْ يَزِيدَ ابْنِ جَارِيَةَ أَنَّ خَنْسَاءَ بِنْتَ خِذَامٍ زَوَّجَهَا أَبُوهَا وَهِيَ ثَيِّبٌ فَكَرِهَتْ ذَلِكَ فَأَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَدَّ نِكَاحَهَا",
                "id": "Telah mengabarkan kepada [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Abdurrahman bin Al Qasim] dari [Ayahnya] dari [Abdurrahman] dan [Mujammi'] keduanya anak Yazid bin Jariyah, bahwa Khansa` binti Khidzam telah dinikahkan oleh ayahnya, ia adalah seorang janda, ternyata Khansa' tidak senang dengan hal itu. Lalu ia datang kepada Rasulullah shallallahu 'alaihi wasallam, akhirnya beliau pun membatalkan pernikahannya.\""
            },
            {
                "number": 1742,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ عُقْبَةَ بْنِ عَامِرٍ أَوْ سَمُرَةَ بْنِ جُنْدُبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا امْرَأَةٍ زَوَّجَهَا وَلِيَّانِ لَهَا فَهِيَ لِلْأَوَّلِ مِنْهُمَا وَأَيُّمَا رَجُلٍ بَاعَ بَيْعًا مِنْ رَجُلَيْنِ فَهُوَ لِلْأَوَّلِ مِنْهُمَا حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا قَتَادَةُ عَنْ الْحَسَنِ عَنْ سَمُرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari ['Uqbah bin 'Amir] atau [Samurah bin Jundub] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapapun wanita yang dinikahkan oleh dua orang wali, maka wanita itu untuk wali yang pertama dari keduanya. Dan siapapun laki-laki yang menjual barang dagangannya kepada dua orang, maka barang tersebut untuk orang yang pertama dari keduanya.\" Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] telah mengabarkan kepada kami [Qatadah] dari [Al Hasan] dari [Samurah] dari Rasulullah shallallahu 'alaihi wasallam sama seperti hadits di atas."
            },
            {
                "number": 1743,
                "arab": " أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ الرَّبِيعِ بْنِ سَبْرَةَ أَنَّ أَبَاهُ حَدَّثَهُ أَنَّهُمْ سَارُوا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حِجَّةِ الْوَدَاعِ فَقَالَ اسْتَمْتِعُوا مِنْ هَذِهِ النِّسَاءِ وَالِاسْتِمْتَاعُ عِنْدَنَا التَّزْوِيجُ فَعَرَضْنَا ذَلِكَ عَلَى النِّسَاءِ فَأَبَيْنَ أَنْ لَا نَضْرِبَ بَيْنَنَا وَبَيْنَهُنَّ أَجَلًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ افْعَلُوا فَخَرَجْتُ أَنَا وَابْنُ عَمٍّ لِي مَعَهُ بُرْدٌ وَمَعِي بُرْدٌ وَبُرْدُهُ أَجْوَدُ مِنْ بُرْدِي وَأَنَا أَشَبُّ مِنْهُ فَأَتَيْنَا عَلَى امْرَأَةٍ فَأَعْجَبَهَا شَبَابِي وَأَعْجَبَهَا بُرْدُهُ فَقَالَتْ بُرْدٌ كَبُرْدٍ وَكَانَ الْأَجَلُ بَيْنِي وَبَيْنَهَا عَشْرًا فَبِتُّ عِنْدَهَا تِلْكَ اللَّيْلَةَ ثُمَّ غَدَوْتُ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمٌ بَيْنَ الرُّكْنِ وَالْبَابِ فَقَالَ يَا أَيُّهَا النَّاسُ إِنِّي قَدْ كُنْتُ أَذِنْتُ لَكُمْ فِي الِاسْتِمْتَاعِ مِنْ النِّسَاءِ أَلَا وَإِنَّ اللَّهَ قَدْ حَرَّمَهُ إِلَى يَوْمِ الْقِيَامَةِ فَمَنْ كَانَ عِنْدَهُ مِنْهُنَّ شَيْءٌ فَلْيُخَلِّ سَبِيلَهَا وَلَا تَأْخُذُوا مِمَّا آتَيْتُمُوهُنَّ شَيْئًا",
                "id": "Telah mengabarkan kepada kami [Ja'far bin 'Aun] dari [Abdul Aziz bin Umar bin Abdul Aziz] dari [Ar Rabi' bin Sabrah] bahwa [Ayahnya] telah menceritakan kepadanya, bahwa orang-orang pernah berjalan bersama Rasulullah shallallahu 'alaihi wasallam ketika haji wada', kemudian beliau bersabda: \"Bersenang-senanglah dengan para wanita ini! \" Dan bersenang-senang menurut kami adalah menikahkan (dengan waktu yang ditentukan), kemudian kami menawarkan hal tersebut kepada para wanita, ternyata mereka menolak untuk tidak diberi tempo antara kami dan mereka. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Lakukanlah.\" Kemudian aku keluar bersama anak pamanku, ia membawa burdah (kain yang dipakai untuk menyelimuti badan) dan aku membawa burdah dan burdahnya lebih baik dari burdahku, namun aku lebih muda darinya. Kemudian kami mendatangi seorang wanita, ternyata wanita itu kagum dengan kemudaanku, namun ia kagum dengan kain anak pamanku. Wanita itu berkata; \"Kain burdah seperti kain yang lain.\" Sementara tempo antara diriku dengan dirinya selama sepuluh hari. Kemudian aku bermalam di sisinya pada malam itu. Pada pagi harinya, aku pergi, ternyata Rasulullah shallallahu 'alaihi wasallam sedang berdiri diantara rukun dan pintu Ka'bah. Lalu beliau bersabda: \"Wahai sekalian manusia, sesungguhnya dahulu aku telah mengizinkan kalian untuk menikahi para wanita secara mut'ah. Ketahuilah bahwa Allah telah mengharamkannya hingga Hari Kiamat. Barangsiapa memiliki sesuatu dari mereka, hendaknya ia melepaskannya, dan janganlah mengambil sesuatupun dari apa yang kalian berikan kepada mereka.\" "
            },
            {
                "number": 1744,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ الرَّبِيعِ بْنِ سَبْرَةَ الْجُهَنِيِّ عَنْ أَبِيهِ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نِكَاحِ الْمُتْعَةِ عَامَ الْفَتْحِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Az Zuhri] dari [Ar Rabi' bin Sabrah Al Juhani] dari [Ayahnya] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam telah melarang nikah mut'ah pada saat penaklukan kota Makkah.\""
            },
            {
                "number": 1745,
                "arab": " حَدَّثَنَا مُحَمَّدٌ حَدَّثَنِي ابْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ الْحَسَنِ وَعَبْدِ اللَّهِ عَنْ أَبِيهِمَا قَالَ سَمِعْتُ عَلِيًّا يَقُولُ لِابْنِ عَبَّاسٍ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُتْعَةِ مُتْعَةِ النِّسَاءِ وَعَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ عَامَ خَيْبَرَ",
                "id": "Telah menceritakan kepada kami [Muhammad] telah menceritakan kepadaku [Ibnu 'Uyainah] dari [Az Zuhri] dari [Al Hasan] dan [Abdullah] dari [ayah mereka berdua], ia berkata; aku mendengar [Ali] berkata kepada Ibnu Abbas; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah melarang mut'ah yaitu menikahi wanita secara mut'ah, dan daging keledai jinak ketika perang Khaibar.\""
            },
            {
                "number": 1746,
                "arab": " أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ نُبَيْهِ بْنِ وَهْبٍ عَنْ أَبَانَ بْنِ عُثْمَانَ عَنْ عُثْمَانَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُحْرِمُ لَا يَنْكِحُ وَلَا يُنْكِحُ",
                "id": "Telah mengabarkan kepada kami [Utsman bin Muhammad] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Ayyub bin Musa] dari [Nubaih bin Wahb] dari [Aban bin Utsman] dari [Utsman] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Orang yang berihram tidak boleh menikah dan menikahkan.\""
            },
            {
                "number": 1747,
                "arab": " أَخْبَرَنَا نُعَيْمُ بْنُ حَمَّادٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ هُوَ ابْنُ مُحَمَّدٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ قَالَ سَأَلْتُ عَائِشَةَ كَمْ كَانَ صَدَاقُ أَزْوَاجِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ صَدَاقُهُ لِأَزْوَاجِهِ اثْنَتَيْ عَشْرَةَ أُوقِيَّةً وَنَشًّا وَقَالَتْ أَتَدْرِي مَا النَّشُّ قَالَ قُلْتُ لَا قَالَتْ نِصْفُ أُوقِيَّةٍ فَهَذَا صَدَاقُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَزْوَاجِهِ",
                "id": "Telah mengabarkan kepada kami [Nu'aim bin Hammad] telah menceritakan kepada kami [Abdul Aziz yaitu Ibnu Muhammad] dari [Yazid bin Abdullah] dari [Muhammad bin Ibrahim] dari [Abu Salamah], ia berkata; Aku bertanya kepada ['Aisyah]; \"Berapakah mahar para isteri Rasulullah shallallahu 'alaihi wasallam?, \" 'Aisyah berkata; \"Mahar para isteri beliau adalah dua belas 'uqiyah dan nasy.\" Aisyah melanjutkan; \"Tahukah kamu apakah nasy itu?, \" Aku menjawab; \"Tidak.\" Aisyah berkata; \"Setengah 'Uqiyah. Ini adalah mahar Rasulullah shallallahu 'alaihi wasallam untuk para isterinya.\""
            },
            {
                "number": 1748,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا هُشَيْمٌ عَنْ مَنْصُورِ بْنِ زَاذَانَ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي الْعَجْفَاءِ السُّلَمِيِّ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ خَطَبَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ أَلَا لَا تُغَالُوا فِي صُدُقِ النِّسَاءِ فَإِنَّهَا لَوْ كَانَتْ مَكْرُمَةً فِي الدُّنْيَا أَوْ تَقْوَى عِنْدَ اللَّهِ كَانَ أَوْلَاكُمْ بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَصْدَقَ امْرَأَةً مِنْ نِسَائِهِ وَلَا أُصْدِقَتْ امْرَأَةٌ مِنْ بَنَاتِهِ فَوْقَ اثْنَتَيْ عَشْرَةَ أُوقِيَّةً أَلَا وَإِنَّ أَحَدَكُمْ لَيُغَالِي بِصَدَاقِ امْرَأَتِهِ حَتَّى يَبْقَى لَهَا فِي نَفْسِهِ عَدَاوَةٌ حَتَّى يَقُولَ كَلِفْتُ إِلَيْكِ عَلَقَ الْقِرْبَةِ أَوْ عَرَقَ الْقِرْبَةِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] telah mengabarkan kepada kami [Husyaim] dari [Manshur bin Zadzan] dari [Ibnu Sirin] dari [Abu Al 'Ajfa` As Sulami], ia berkata; Aku mendengar [Umar bin Al Khathab] berkhutbah, ia memuji Allah, kemudian berkata; \"Ketahuilah, janganlah kalian berlebihan dalam mahar wanita, apabila berlebihan dalam mahar merupakan bentuk kemuliaan di dunia atau ketaqwaan di sisi Allah, niscaya yang paling pertama kali melakukannya adalah Rasulullah shallallahu 'alaihi wasallam. Tidaklah beliau memberikan mahar kepada seorangpun dari para isterinya dan tidak seorangpun dari anak-anak wanitanya yang diberi mahar di atas dua belas 'uqiyah. Sungguh salah seorang diantara kalian berlebihan dalam mahar isterinya, hingga tinggallah dalam dirinya permusuhan kepada isterinya, sampai dirinya mengatakan; \"Aku telah menanggung segala sesuatu hingga tali geriba, atau hingga berkeringat seperti geriba berkeringat.\""
            },
            {
                "number": 1749,
                "arab": " حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ أَتَتْ امْرَأَةٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنَّهَا وَهَبَتْ نَفْسَهَا لِلَّهِ وَلِرَسُولِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لِي فِي النِّسَاءِ مِنْ حَاجَةٍ فَقَالَ رَجُلٌ زَوِّجْنِيهَا فَقَالَ أَعْطِهَا ثَوْبًا فَقَالَ لَا أَجِدُ قَالَ أَعْطِهَا وَلَوْ خَاتَمًا مِنْ حَدِيدٍ فَاعْتَلَّ لَهُ فَقَالَ مَا مَعَكَ مِنْ الْقُرْآنِ قَالَ كَذَا وَكَذَا قَالَ فَقَدْ زَوَّجْتُكَهَا عَلَى مَا مَعَكَ مِنْ الْقُرْآنِ",
                "id": "Telah menceritakan kepada kami ['Amr bin 'Aun] telah mengabarkan kepada kami [Hammad bin Zaid] dari [Abu Hazim] dari [Sahl bin Sa'd] ia berkata; \"Seorang wanita datang kepada Nabi shallallahu 'alaihi wasallam lalu berkata; \"Sesungguhnya dirinya telah menghibahkan dirinya untuk Allah dan RasulNya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda; \"Aku tidak memiliki kebutuhan kepada wanita.\" Lantas seorang laki-laki berkata; \"Nikahkanlah aku dengannya.\" Beliau pun bersabda; \"Berilah pakaian (kepada calon isterimu sebagai mahar -pent).\" Laki-laki itu berkata; \"Aku tidak memilikinya.\" Beliau bersabda: \"Berikan kepada (calon isterimu) walaupun hanya cincin dari besi.\" Laki-laki it uterus mengelak. Akhirnya beliau bersabda: \"Apakah kamu hafal Al Qur'an?\" lalu laki-laki itu mengatakan demikian dan demikian. Beliau bersabda: \"Sungguh aku telah menikahkanmu dengan wanita tersebut dengan mahar apa yang kamu hafal dari Al Qur'an.\""
            },
            {
                "number": 1750,
                "arab": " حَدَّثَنَا أَبُو الْوَلِيدِ وَحَجَّاجٌ قَالَا حَدَّثَنَا شُعْبَةُ قَالَ أَنْبَأَنَا أَبُو إِسْحَقَ قَالَ سَمِعْتُ أَبَا عُبَيْدَةَ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ قَالَ عَلَّمَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُطْبَةَ الْحَاجَةِ الْحَمْدُ لِلَّهِ أَوْ إِنَّ الْحَمْدَ لِلَّهِ نَحْمَدُهُ وَنَسْتَعِينُهُ وَنَسْتَغْفِرُهُ وَنَعُوذُ بِاللَّهِ مِنْ شُرُورِ أَنْفُسِنَا مَنْ يَهْدِهِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ ثُمَّ يَقْرَأُ ثَلَاثَ آيَاتٍ { يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسْلِمُونَ } { يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمْ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا } { يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَقُولُوا قَوْلًا سَدِيدًا يُصْلِحْ لَكُمْ أَعْمَالَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَمَنْ يُطِعْ اللَّهَ وَرَسُولَهُ فَقَدْ فَازَ فَوْزًا عَظِيمًا } ثُمَّ يَتَكَلَّمُ بِحَاجَتِهِ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid] dan [Hajjaj] keduanya berkata; telah menceritakan kepada kami [Syu'bah] ia berkata; telah memberitakan kepada kami [Abu Ishaq] ia berkata; Aku mendengar [Abu 'Ubaidah] menceritakan dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam mengajarkan kepada kami khutbah hajah, yaitu; \"Al HAMDULILLAAHI atau INNAL HAMDA LILLAAHI NAHMADUHU WA NASTA'IINUHU WA NASTAGHFIRUHU WA NA'UUDZU BILLAAHI MIN SYURUURI ANFUSINAA, MAN YAHDIHILLAAHU FALAA MUDHILLA LAHU WA MAN YUDHLIL FALAA HAADIYA LAHU. ASYHADU AN LAA ILAAHA ILLALLAAH WA ASYHADU ANNA MUHAMMADAN 'ABDUHU WA RASUULUHU (segala puji bagi Allah, atau sesungguhnya segala puji bagi Allah, kita memujiNya, memohon pertolongan, serta ampunan kepadaNya, dan kita berlindung kepada Allah dari keburukan diri kita, barangsiapa yang Allah beri petunjuk maka tidak ada yang dapat menyesatkannya, dan barangsiapa yang Allah sesatkan maka tidak ada yang dapat memberinya petunjuk. Aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah, dan aku bersaksi bahwa Mummad adalah hamba dan utusanNya.. Kemudian membaca tiga ayat, yaitu; Hai orang-orang yang beriman, bertaqwalah kepada Allah sebenar-benar taqwa kepada-Nya; dan janganlah sekali-kali kamu mati melainkan dalam keadaan beragama Islam. QS Ali Imran; 102. Hai sekalian manusia, bertaqwalah kepada Tuhan-mu yang telah menciptakan kamu dari seorang diri, dan dari padanya, Allah menciptakan isterinya.\" QS An Nisa`; 1. Hai orang-orang yang beriman, bertaqwalah kamu kepada Allah dan katakanlah perkataan yang benar, niscaya Allah memperbaiki bagimu amalan-amalanmu dan mengampuni bagimu dosa-dosamu. Dan barangsiapa mentaati Allah dan Rasul-Nya, maka sesungguhnya ia telah mendapat kemenangan yang besar. QS Al Ahzab; 70-71. Kemudian mengatakan kebutuhannya."
            },
            {
                "number": 1751,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ عَنْ عُقْبَةَ بْنِ عَامِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَحَقَّ الشُّرُوطِ أَنْ تُوفُوا بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Abdul Hamid bin Ja'far] dari [Yazid bin Abu Habib] dari [Martsad bin Abdullah] dari ['Uqbah bin 'Amir] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya syarat yang paling berhak untuk kalian tunaikan adalah yang kalian gunakan untuk menghalalkan kemaluan.\""
            },
            {
                "number": 1752,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ ثَابِتٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى عَلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ صُفْرَةً فَقَالَ مَا هَذِهِ الصُّفْرَةُ قَالَ تَزَوَّجْتُ امْرَأَةً عَلَى وَزْنِ نَوَاةٍ مِنْ ذَهَبٍ قَالَ بَارَكَ اللَّهُ لَكَ أَوْلِمْ وَلَوْ بِشَاةٍ",
                "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari [Tsabit] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam melihat bekas warna kuning (minyak) pada Abdurrahman bin 'Auf, lalu Abdurrahman berkata; Aku telah menikahi seorang wanita dengan mahar emas sebesar satu biji kurma. Beliau mengucapkan; \"BAARAKALLAAHU LAKA (Semoga Allah memberikan keberkahan atasmu) rayakanlah walaupun hanya dengan seekor kambing.\""
            },
            {
                "number": 1753,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دُعِيَ أَحَدُكُمْ إِلَى وَلِيمَةٍ فَلْيُجِبْ قَالَ أَبُو مُحَمَّد يَنْبَغِي أَنْ يُجِيبَ وَلَيْسَ الْأَكْلُ عَلَيْهِ بِوَاجِبٍ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami ['Uqbah bin Khalid] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian diundang ke pesta (pernikahan), hendaknya ia memenuhi undangan tersebut.\" Abu Muhammad berkata; \"Selayaknya ia memenuhi undangan tersebut, sementara makan bukanlah sesuatu yang wajib.\""
            },
            {
                "number": 1754,
                "arab": " حَدَّثَنَا أَبُو الْوَلِيدِ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ النَّضْرِ بْنِ أَنَسٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَتْ لَهُ امْرَأَتَانِ فَمَالَ إِلَى إِحْدَاهُمَا جَاءَ يَوْمَ الْقِيَامَةِ وَشِقُّهُ مَائِلٌ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [An Nadhr bin Anas] dari [Basyir bin Nahik] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa memiliki dua orang isteri, kemudian ia cenderung kepada salah seorang dari keduanya, maka ia akan datang pada Hari Kiamat dalam keadaan sisi sebelahnya miring.\""
            },
            {
                "number": 1755,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَاصِمٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْسِمُ فَيَعْدِلُ وَيَقُولُ اللَّهُمَّ هَذِهِ قِسْمَتِي فِيمَا أَمْلِكُ فَلَا تَلُمْنِي فِيمَا تَمْلِكُ وَلَا أَمْلِكُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ashim] telah menceritakan kepada kami [Hammad bin Salamah] dari [Ayyub] dari [Abu Qilabah] dari [Abdullah bin Yazid Al Khathmi] dari ['Aisyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam membagi serta bersikap adil (terhadap para isterinya), dan beliau mengatakan: \"Ya Allah, ini adalah pembagianku yang aku mampu, maka janganlah Engkau cela aku dalam perkara yang Engkau mampu dan tidak aku mampui.\""
            },
            {
                "number": 1756,
                "arab": " أَخْبَرَنَا إِسْمَعِيلُ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ يُونُسَ بْنِ يَزِيدَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَافَرَ أَقْرَعَ بَيْنَ نِسَائِهِ فَأَيَّتُهُنَّ خَرَجَ سَهْمُهَا خَرَجَ بِهَا مَعَهُ",
                "id": "Telah mengabarkan kepada kami [Isma'il] telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Yunus bin Yazid] dari [Az Zuhri] dari ['Urwah] dari [Aisyah], ia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam hendak bepergian, beliau selalu mengundi diantara para isterinya, siapa diantara mereka yang keluar undiannya, maka beliau pergi bersamanya.\""
            },
            {
                "number": 1757,
                "arab": " أَخْبَرَنَا يَعْلَى حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْبِكْرِ سَبْعٌ وَلِلثَّيِّبِ ثَلَاثٌ",
                "id": "Telah mengabarkan kepada kami [Ya'la] telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Ayyub] dari [Abu Qilabah] dari [Anas bin Malik], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Gadis mendapatkan tujuh hari dan janda mendapatkan tiga hari.\""
            },
            {
                "number": 1758,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرٍ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أَبِيهِ عَنْ أُمِّ سَلَمَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا تَزَوَّجَ أُمَّ سَلَمَةَ أَقَامَ عِنْدَهَا ثَلَاثًا وَقَالَ إِنَّهُ لَيْسَ بِكِ عَلَى أَهْلِكِ هَوَانٌ إِنْ شِئْتِ سَبَّعْتُ لَكِ وَإِنْ سَبَّعْتُ لَكِ سَبَّعْتُ لِسَائِرِ نِسَائِي",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Muhammad bin Abu Syaibah] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] dari [Muhammad bin Abu Bakr] dari [Abdul Malik bin Abu Bakr bin Abdurrahman bin Al Harits bin Hisyam] dari [Ayahnya] dari [Ummu Salamah] bahwa ketika Rasulullah shallallahu 'alaihi wasallam menikahi Ummu Salamah, beliau tinggal di rumahnya selama tiga hari. Beliau bersabda: \"Sesungguhnya tidak ada kehinaan padamu atas keluargamu, apabila engkau mau, maka aku akan memberikan tujuh hari dan memberikan tujuh hari untuk isteri-isteriku yang lain.\""
            },
            {
                "number": 1759,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ سُفْيَانَ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ عَبْدِ اللَّهِ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ تَزَوَّجَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شَوَّالٍ وَأُدْخِلْتُ عَلَيْهِ فِي شَوَّالٍ فَأَيُّ نِسَائِهِ كَانَ أَحْظَى عِنْدَهُ مِنِّي قَالَ وَكَانَتْ تَسْتَحِبُّ أَنْ تُدْخِلَ عَلَى النِّسَاءِ فِي شَوَّالٍ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Musa] dari [Sufyan] dari [Isma'il bin Umayyah] dari [Abdullah bin 'Urwah] dari ['Urwah] dari ['Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam menikahiku pada Bulan Syawal, dan aku berumah tangga pada bulan Syawal. Siapakah diantara isteri beliau yang lebih mendapatkan bagian di sisinya daripada diriku?, \" 'Urwah berkata; \"Beliau sangat senang bila berumah tangga dengan para isterinya (yang baru) di Bulan Syawal."
            },
            {
                "number": 1760,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ عَنْ سَالِمٍ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يَمْنَعُ أَحَدَكُمْ أَنْ يَقُولَ حِينَ يُجَامِعُ أَهْلَهُ بِسْمِ اللَّهِ اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبْ الشَّيْطَانَ مَا رَزَقْتَنَا فَإِنْ قَضَى اللَّهُ وَلَدًا لَمْ يَضُرَّهُ الشَّيْطَانُ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Musa] dari [Isra`il] dari [Manshur] dari [Salim] dari [Kuraib] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah yang menghalangi salah seorang dari kalian ketika menggauli isterinya untuk mengucapkan; BISMILLAAH, ALLAAHUMMA JANNIBNASY SYAITHAAN WA JANNIB ASY SYAITHAANA MAA RAZAQTANAA (Dengan nama Allah, ya Allah, jauhkanlah kami dari syetan dan jauhkanlah syetan dari anak yang Engkau rizkikan kepada kami). Apabila Allah menetapkan untuk memberikan anak kepadanya, maka syetan tidak akan mampu membahayakannya.\""
            },
            {
                "number": 1761,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ الْوَلِيدِ بْنِ كَثِيرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ الْحُصَيْنِ عَنْ عَبْدِ الْمَلِكِ بْنِ عَمْرِو بْنِ قَيْسٍ الْخَطْمِيِّ عَنْ هَرَمِيِّ بْنِ عَبْدِ اللَّهِ قَالَ سَمِعْتُ خُزَيْمَةَ بْنَ ثَابِتٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ لَا يَسْتَحْيِي مِنْ الْحَقِّ لَا تَأْتُوا النِّسَاءَ فِي أَعْجَازِهِنَّ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abu Usamah] dari [Al Walid bin Katsir] dari ['ubaidhullah bin Abdullah bin Al Hushain] dari [Abdul Malik bin 'Amr bin Qais Al Khathmi] dari [Harami bin Abdullah] ia berkata; Aku mendengar [Khuzaimah bin Tsabit] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah tidak malu dari kebenaran, janganlah kalian mendatangi para wanita dari duburnya.\""
            },
            {
                "number": 1762,
                "arab": " حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ الْيَهُودَ قَالُوا لِلْمُسْلِمِينَ مَنْ أَتَى امْرَأَتَهُ وَهِيَ مُدْبِرَةٌ جَاءَ وَلَدُهُ أَحْوَلَ فَأَنْزَلَ اللَّهُ تَعَالَى { نِسَاؤُكُمْ حَرْثٌ لَكُمْ فَأْتُوا حَرْثَكُمْ أَنَّى شِئْتُمْ }",
                "id": "Telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Muhammad bin Al Munkadir] dari [Jabir bin Abdullah] bahwa orang-orang Yahudi berkata kepada kaum Muslimin; \"Barangsiapa mendatangi isterinya dari arah belakang, maka anaknya akan terlahir dalam keadaan juling.\" Maka Allah Ta'ala menurunkan ayat Isteri-isterimu adalah (seperti) Tanah tempat kamu bercocok tanam, maka datangilah tanah tempat bercocok-tanammu itu bagaimana saja kamu kehendaki.\" QS Al Baqarah; 223."
            },
            {
                "number": 1763,
                "arab": " أَخْبَرَنَا قَبِيصَةُ أَخْبَرَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ حَلَّامٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ رَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْرَأَةً فَأَعْجَبَتْهُ فَأَتَى سَوْدَةَ وَهِيَ تَصْنَعُ طِيبًا وَعِنْدَهَا نِسَاءٌ فَأَخْلَيْنَهُ فَقَضَى حَاجَتَهُ ثُمَّ قَالَ أَيُّمَا رَجُلٍ رَأَى امْرَأَةً تُعْجِبُهُ فَلْيَقُمْ إِلَى أَهْلِهِ فَإِنَّ مَعَهَا مِثْلَ الَّذِي مَعَهَا",
                "id": "Telah mengabarkan kepada kami [Qabishah] telah mengabarkan kepada kami [Sufyan] dari [Abu Ishaq] dari [Abdullah bin Hallam] dari [Abdullah bin Mas'ud] ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah melihat seorang wanita yang membuat beliau terpesona, kemudian beliau langsung mendatangi Saudah, sementara dirinya sedang membuat minyak wangi, dan ia bersama beberapa orang wanita, kemudian mereka meninggalkan beliau bersamanya hingga beliau dapat memenuhi hajatnya. Kemudian beliau bersabda: \"Siapapun laki-laki yang melihat seorang wanita yang membuatnya terpesona, hendaknya ia segera mendatangi isterinya, sesungguhnya isterinya memiliki apa yang di miliki oleh wanita tersebut.\""
            },
            {
                "number": 1764,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُطِيعٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا سَيَّارٌ عَنْ الشَّعْبِيِّ حَدَّثَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَلَمَّا قَفَلْنَا تَعَجَّلْتُ فَلَحِقَنِي رَاكِبٌ قَالَ فَالْتَفَتُّ فَإِذَا أَنَا بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِي مَا أَعْجَلَكَ يَا جَابِرُ قَالَ إِنِّي حَدِيثُ عَهْدٍ بِعُرْسٍ قَالَ أَفَبِكْرًا تَزَوَّجْتَهَا أَمْ ثَيِّبًا قَالَ قُلْتُ بَلْ ثَيِّبًا قَالَ فَهَلَّا بِكْرًا تُلَاعِبُهَا وَتُلَاعِبُكَ قَالَ ثُمَّ قَالَ لِي إِذَا قَدِمْتَ فَالْكَيْسَ الْكَيْسَ قَالَ فَلَمَّا قَدِمْنَا ذَهَبْنَا نَدْخُلُ قَالَ أَمْهِلُوا حَتَّى نَدْخُلَ لَيْلًا أَيْ عِشَاءً لِكَيْ تَمْتَشِطَ الشَّعِثَةُ وَتَسْتَحِدَّ الْمُغِيبَةُ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Muthi'] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Sayyar] dari [Asy Sya'bi] telah menceritakan kepada kami [Jabir bin Abdullah] ia berkata; kami bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan, tatkala kami kambali (dari perjalanan), aku terburu-buru kemudian seseorang yang menunggang kendaraan menyusulku dan berbicara, kemudian aku menoleh, ternyata aku dengan Rasulullah shallallahu 'alaihi wasallam, beliau bersabda kepadaku: \"Apa yang menyebabkanmu terburu-buru wahai Jabir?\" Jabir menjawab; \"Sesungguhnya aku baru menikah.\" Beliau bertanya: \"Apakah engkau menikahi gadis atau janda?\" Jabir berkata; Aku menjawab; \"Janda.\" Beliau bersabda: \"Tidakkah engkau menikahi seorang gadis, sehingga engkau dapat bercumbu dengannya dan dia bercumbu denganmu?\" Jabir berkata; kemudian beliau bersabda kepadaku: \"Berharaplah mendapatkan anak, berharaplah mendapatkan anak.\" Jabir berkata; Tatkala kami tiba (di Madinah), kami pun pergi dan segera hendak masuk rumah. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pelan-pelanlah, hingga kita masuk pada malam hari yaitu pada waktu Isya` agar wanita yang rambutnya berantakan menyisir rambutnya dan dan mereka bisa mempersiapkan dirinya.\""
            }
        ]
    }
}