{
    "status": true,
    "data": {
        "start": 2500,
        "end": 2646,
        "total": 147,
        "book": "darimi",
        "hadits": [
            {
                "number": 2500,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ قَالَ كَانَ مُعَاوِيَةُ يُوَرِّثُ الْمُسْلِمَ مِنْ الْكَافِرِ وَلَا يُوَرِّثُ الْكَافِرَ مِنْ الْمُسْلِمِ قَالَ قَالَ مَسْرُوقٌ وَمَا حَدَثَ فِي الْإِسْلَامِ قَضَاءٌ أَحَبُّ إِلَيَّ مِنْهُ قِيلَ لِأَبِي مُحَمَّدٍ تَقُولُ بِهَذَا قَالَ لَا",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Salamah] dari [Dawud] dari [Asy Sya'bi] dari [Masruq] ia berkata; [Mu'awiyah] membolehkan orang muslim mewarisi orang kafir namun tidak membolehkan orang kafir mewarisi orang muslim. Ia melanjutkan; Masruq berkata; Tidak ada satu keputusan dalam Islam yang lebih aku sukai dari pada keputusan ini. Ada yang bertanya kepada Abu Muhammad; Apakah engkau juga mengatakan seperti ini? Ia menjawab; Tidak."
            },
            {
                "number": 2501,
                "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ لَا يَتَوَارَثُ مِلَّتَانِ شَتَّى وَلَا يَحْجُبُ مَنْ لَا يَرِثُ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Anas bin Sirin] ia berkata; [Umar bin Al Khaththab] berkata; Dua pemeluk agama yang berbeda tidak dapat saling mewarisi dan orang yang tidak dapat mewarisi tidak dapat menghalangi ahli waris lain."
            },
            {
                "number": 2502,
                "arab": " حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ حُسَيْنٍ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ أُسَامَةَ بْنِ زَيْدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ وَلَا الْكَافِرُ الْمُسْلِمَ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah menceritakan kepada kami [Abdul A'la] dari [Ma'mar] dari [Az Zuhri] dari [Ali bin Husain] dari [Amr bin Utsman] dari [Usamah bin Zaid] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang muslim tidak dapat mewarisi harta orang kafir dan orang kafir tidak dapat mewarisi harta orang muslim.\""
            },
            {
                "number": 2503,
                "arab": " حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ عَنْ سَعِيدٍ عَنْ أَبِي مَعْشَرٍ عَنْ إِبْرَاهِيمَ قَالَ إِذَا مَاتَ الْمَيِّتُ وَجَبَتْ الْحُقُوقُ لِأَهْلِهَا وَلَمْ يَجْعَلْ لِمَنْ أَسْلَمَ أَوْ أُعْتِقَ قَبْلَ أَنْ يُقْسَمَ الْمِيرَاثُ شَيْئًا",
                "id": "Telah menceritakan kepada kami [Ja'far bin 'Aun] dari [Sa'id] dari [Abu Ma'syar] dari [Ibrahim] ia berkata; Jika seseorang meninggal dunia maka hak-hak wajib diberikan kepada orang-orang yang berhak menerimanya. Sedikit pun bagian harta tidak diberikan kepada orang yang masuk Islam atau orang yang dimerdekakan sebelum warisan dibagikan."
            },
            {
                "number": 2504,
                "arab": " حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ حُسَيْنٍ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ وَلَا الْكَافِرُ الْمُسْلِمَ",
                "id": "Telah menceritakan kepada kami [Amr bin 'Aun] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Ali bin Husain] dari [Amr bin Utsman] dari [Usamah bin Zaid] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Orang muslim tidak dapat mewarisi harta orang kafir dan orang kafir tidak dapat mewarisi harta orang muslim.\""
            },
            {
                "number": 2505,
                "arab": " حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ لَيْسَ لِلْمُكَاتَبِ مِيرَاثٌ مَا بَقِيَ عَلَيْهِ شَيْءٌ مِنْ مُكَاتَبَتِهِ",
                "id": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Al Mughirah] dari [Ibrahim] ia berkata; Mukatab tidak memperoleh warisan selama masih ada sisa pembayaran dari mukatabnya yang belum dilunasi. "
            },
            {
                "number": 2506,
                "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ فِي رَجُلٍ لَهُ بَنُونَ قَدْ أَعْتَقَ مِنْ بَعْضِهِمْ النِّصْفَ وَمِنْ بَعْضِهِمْ الثُّلُثَ وَمِنْ بَعْضٍ الرُّبُعَ قَالَ لَا يَرِثُونَ حَتَّى يُعْتَقُوا",
                "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Abdul Malik] dari ['Atha`] tentang seseorang yang memiliki beberapa budak, sebagian mereka telah ia merdekakan setengah (dari harga budak), sebagian lagi telah ia merdekakan sepertiga (dari harga budak) dan sebagian lainnya telah ia merdekakan seperempat (dari harga budak). Ia berkata; Mereka tidak dapat mewarisi hingga mereka dimerdekakan."
            },
            {
                "number": 2507,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ وَسَعِيدُ بْنُ الْمُغِيرَةِ عَنْ ابْنِ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ حَمَّادٍ عَنْ إِبْرَاهِيمَ فِي رَجُلٍ اشْتَرَى ابْنَهُ فِي مَرَضِهِ قَالَ إِنْ خَرَجَ مِنْ الثُّلُثِ وَرِثَهُ وَإِنْ وَقَعَتْ عَلَيْهِ السِّعَايَةُ لَمْ يَرِثْ",
                "id": "Telah menceritakan kepada kami [Abdul Ja'far Ar Ruqqi] dan [Sa'ib bin Al Mughirah] dari [Ibnu Al Mubarak] dari [Ma'mar] dari [Hammad] dari [Ibrahim] tentang seorang laki-laki yang membeli budaknya pada waktu sakitnya, ia berkata; Jika ia telah membayar sepertiga maka budak itu dapat mewarisinya, namun jika masih melakukan pekerjaan maka ia tidak dapat diwarisi."
            },
            {
                "number": 2508,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ أَبِيهِ عَنْ الشَّعْبِيِّ قَالَ حَدُّ الْمُكَاتَبِ حَدُّ الْمَمْلُوكِ حَتَّى يُعْتَقَ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [ayahnya] dari [Asy Sya'bi] ia berkata; Hukuman bagi mukatab sama dengan hukuman seorang budak hingga ia telah merdeka."
            },
            {
                "number": 2509,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا يُونُسُ عَنْ الزُّهْرِيِّ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَوْلَى أَخٌ فِي الدِّينِ وَنِعْمَةٌ أَحَقُّ النَّاسِ بِمِيرَاثِهِ أَقْرَبُهُمْ مِنْ الْمُعْتِقِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Sa'id bin Abdurrahman] telah menceritakan kepada kami [Yunus] dari [Az Zuhri] ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Mantan budak adalah saudara dalam agama dan anugerah kenikmatan. Orang yang paling berhak dengan warisannya adalah orang yang memerdekakannya yang paling dekat dengannya.\""
            },
            {
                "number": 2510,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا عَبَّادٌ عَنْ عُمَرَ بْنِ عَامِرٍ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ زَيْدِ بْنِ ثَابِتٍ فِي رَجُلٍ تَرَكَ أَبَاهُ وَابْنَ ابْنِهِ فَقَالَ الْوَلَاءُ لِابْنِ الِابْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami ['Abbad] dari [Umar bin Amir] dari [Qatadah] dari [Sa'id bin Al Musayyab] dari [Zaid bin Tsabit] tentang seorang anak laki-laki yang meninggalkan ayah dan anak laki-laki dari anak laki-lakinya, ia berkata; Wala` untuk anak laki-laki dari anak laki-laki. "
            },
            {
                "number": 2511,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا مُعَمَّرٌ حَدَّثَنَا خُصَيْفٌ عَنْ زِيَادِ بْنِ أَبِي مَرْيَمَ أَنَّ امْرَأَةً أَعْتَقَتْ عَبْدًا لَهَا ثُمَّ تُوُفِّيَتْ وَتَرَكَتْ ابْنَهَا وَأَخَاهَا ثُمَّ تُوُفِّيَ مَوْلَاهَا فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْنُ الْمَرْأَةِ وَأَخُوهَا فِي مِيرَاثِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِيرَاثُهُ لِابْنِ الْمَرْأَةِ فَقَالَ أَخُوهَا يَا رَسُولَ اللَّهِ لَوْ أَنَّهُ جَرَّ جَرِيرَةً عَلَى مَنْ كَانَتْ قَالَ عَلَيْكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Mu'ammar] telah menceritakan kepada kami [Khushaif] dari [Ziyad bin Abu Maryam] bahwa seorang perempuan memerdekakan budak miliknya kemudian perempuan itu meninggal dunia dan meninggalkan anak laki-laki dan saudara laki-lakinya. Setelah itu mantan budaknya meninggal dunia. Anak laki-laki dan saudara laki-laki perempuan itu menemui Nabi shallallahu 'alaihi wasallam menanyakan tentang warisan mantan budak tersebut. Maka Nabi shallallahu 'alaihi wasallam: \"Warisannya untuk anak laki-laki perempuan itu.\" Saudara laki-laki perempuan itu berkata; Wahai Rasulullah, seandainya mantan budak itu melakukan kejahatan maka siapa yang menanggung diyat kejahatannya? Beliau menjawab: \"kamu.\""
            },
            {
                "number": 2512,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ حَدَّثَنَا هُشَيْمٌ عَنْ شُعْبَةَ قَالَ سَمِعْتُ الْحَكَمَ وَحَمَّادًا يَقُولَانِ هُوَ لِلِابْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shalt] telah menceritakan kepada kami [Husyaim] dari [Syu'bah] ia berkata; Aku mendengar [Al Hakam] dan [Hammad] keduanya berkata; Warisan itu diberikan kepada anak laki-laki."
            },
            {
                "number": 2513,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْأَشْعَثُ عَنْ الْحَسَنِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ إِلَى الْبَقِيعِ فَرَأَى رَجُلًا يُبَاعُ فَأَتَاهُ فَسَاوَمَ بِهِ ثُمَّ تَرَكَهُ فَرَآهُ رَجُلٌ فَاشْتَرَاهُ فَأَعْتَقَهُ ثُمَّ جَاءَ بِهِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي اشْتَرَيْتُ هَذَا فَأَعْتَقْتُهُ فَمَا تَرَى فِيهِ فَقَالَ هُوَ أَخُوكَ وَمَوْلَاكَ قَالَ مَا تَرَى فِي صُحْبَتِهِ فَقَالَ إِنْ شَكَرَكَ فَهُوَ خَيْرٌ لَهُ وَشَرٌّ لَكَ وَإِنْ كَفَرَكَ فَهُوَ خَيْرٌ لَكَ وَشَرٌّ لَهُ قَالَ مَا تَرَى فِي مَالِهِ قَالَ إِنْ مَاتَ وَلَمْ يَتْرُكْ عَصَبَةً فَأَنْتَ وَارِثُهُ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Al Asy'ats] dari [Al Hasan] bahwa Nabi shallallahu 'alaihi wasallam pernah pergi ke Baqi' kemudian beliau melihat seorang budak laki-laki yang dijual. Beliau mendatangi lalu menawarnya kemudian beliau meninggalkannya. Setelah itu ada seseorang melihatnya lalu membeli dan memerdekakannya. Kemudian ia datang membawa mantan budak tersebut kepada Nabi shallallahu 'alaihi wasallam seraya berkata; Sesungguhnya aku telah membeli budak ini lalu memerdekakannya, apa pendapatmu tentangnya? Nabi shallallahu 'alaihi wasallam menjawab: \"Ia adalah saudaramu dan mantan budakmu.\" Ia bertanya lagi; Apa pendapatmu tentang berteman dengannya? Beliau menjawab: \"Jika ia bisa berterima kasih kepadamu maka itu baik baginya namun buruk bagimu dan jika ia ingkar terhadapmu maka itu baik bagimu namun buruk baginya.\" Ia bertanya lagi; Apa pendapatmu tentang hartanya? Beliau menjawab: \"Jika ia meninggal dunia dan tidak meninggalkan ashabah maka engkau adalah ahli warisnya.\""
            },
            {
                "number": 2514,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا أَشْعَثُ عَنْ الْحَكَمِ وَسَلَمَةَ بْنِ كُهَيْلٍ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ أَنَّ ابْنَةَ حَمْزَةَ أَعْتَقَتْ عَبْدًا لَهَا فَمَاتَ وَتَرَكَ ابْنَتَهُ وَمَوْلَاتَهُ بِنْتَ حَمْزَةَ فَقَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِيرَاثَهُ بَيْنَ ابْنَتِهِ وَمَوْلَاتِهِ بِنْتِ حَمْزَةَ نِصْفَيْنِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Al Asy'ats] dari [Al Hakam] dan [Salamah bin Kuhail] dari [Abdullah bin Syaddad] bahwa anak perempuan Hamzah telah memerdekakan seorang budak laki-laki miliknya lalu mantan budaknya meninggal dunia dan meninggalkan anak perempuan dan tuannya, yakni anak perempuan Hamzah. Maka Rasulullah shallallahu 'alaihi wasallam membagi warisan budak yang telah dimerdekakan tersebut kepada anak perempuannya dan tuannya, masing-masing setengah (bagian)."
            },
            {
                "number": 2515,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْحَكَمِ عَنْ أَبِي الْكَنُودِ عَنْ عَلِيٍّ أَنَّهُ أُتِيَ بِابْنَةٍ وَمَوْلًى فَأَعْطَى الِابْنَةَ النِّصْفَ وَالْمَوْلَى النِّصْفَ قَالَ الْحَكَمُ فَمَنْزِلِي هَذَا نَصِيبُ الْمَوْلَى الَّذِي وَرِثَهُ عَنْ مَوْلَاهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Uyainah] dari [Ali bin Mushir] dari [Ibnu Abu Laila] dari [Al Hakam] dari [Abu Al Kanud] dari [Ali] bahwa ia pernah ditanya tentang seorang anak perempuan dan mantan budak. Maka ia memberikan kepada anak perempuan dan mantan budak tersebut masing-masing setengah. Al Hakam berkata; Menurutku, ini adalah bagian mantan budak yang diwarisi dari orang yang memerdekakannya."
            },
            {
                "number": 2516,
                "arab": " أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُوسَى عَنْ ابْنِ إِدْرِيسَ عَنْ أَشْعَثَ عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُدْلِجٍ أَنَّهُ مَاتَ وَتَرَكَ ابْنَتَهُ وَمَوَالِيَهُ فَأَعْطَى عَلِيٌّ ابْنَتَهُ النِّصْفَ وَمَوَالِيَهُ النِّصْفَ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Musa] dari [Ibnu Idris] dari [Asy'ats] dari [Al Hakam] dari [Abdurrahman bin Mudlij] bahwa ada seorang budak meninggal dunia dan meninggalkan seorang anak perempuan dan orang yang memerdekakannya, maka [Ali] memberikan kepada anak perempuan itu setengah dan kepada para mantan budak ayahnya itu setengah."
            },
            {
                "number": 2517,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ حَدَّثَنَا أَشْعَثُ عَنْ جَهْمِ بْنِ دِينَارٍ عَنْ إِبْرَاهِيمَ أَنَّهُ سُئِلَ عَنْ أُخْتَيْنِ اشْتَرَتْ إِحْدَاهُمَا أَبَاهَا فَأَعْتَقَتْهُ ثُمَّ مَاتَ قَالَ لَهُمَا الثُّلُثَانِ فَرِيضَتُهُمَا فِي كِتَابِ اللَّهِ وَمَا بَقِيَ فَلِلْمُعْتِقَةِ دُونَ الْأُخْرَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Hafsh bin Ghiyats] telah menceritakan kepada kami [Asy'ats] dari [Jahm bin Dinar] dari [Ibrahim] bahwa ia pernah ditanya tentang salah satu dari dua saudara perempuan yang membeli ayahnya lalu memerdekakannya kemudian ayahnya tersebut meninggal dunia. Ia menjawab; Mereka berdua mendapat dua pertiga sebagai bagian yang telah ditetapkan untuk keduanya dalam kitab Allah dan harta yang tersisa adalah untuk yang memerdekakannya bukan untuk yang lain."
            },
            {
                "number": 2518,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا إِسْرَائِيلُ حَدَّثَنَا الْأَشْعَثُ عَنْ الشَّعْبِيِّ فِي امْرَأَةٍ أَعْتَقَتْ أَبَاهَا فَمَاتَ الْأَبُ وَتَرَكَ أَرْبَعَ بَنَاتٍ هِيَ إِحْدَاهُنَّ قَالَ لَيْسَ عَلَيْهِ مِنَّةٌ لَهُنَّ الثُّلُثَانِ وَهِيَ مَعَهُنَّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Isra`il] telah menceritakan kepada kami [Al Asy'ats] dari [Asy Sya'bi] tentang seorang perempuan yang memerdekakan ayahnya, lalu ayah tersebut meninggal dunia dan meninggalkan empat anak perempuan, salah satu dari mereka adalah yang memerdekakannya. Ia menjawab; Ayah tidak boleh melebihkan (bagian), mereka mendapat dua pertiga termasuk yang memerdekakan."
            },
            {
                "number": 2519,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زُهَيْرٌ عَنْ حَيَّانَ بْنِ سَلْمَانَ قَالَ كُنْتُ عِنْدَ سُوَيْدِ بْنِ غَفَلَةَ فَجَاءَهُ رَجُلٌ فَسَأَلَهُ عَنْ فَرِيضَةِ رَجُلٍ تَرَكَ ابْنَتَهُ وَامْرَأَتَهُ قَالَ أَنَا أُنْبِئُكَ قَضَاءَ عَلِيٍّ قَالَ حَسْبِي قَضَاءُ عَلِيٍّ قَالَ قَضَى عَلِيٌّ لِامْرَأَتِهِ الثُّمُنَ وَلِابْنَتِهِ النِّصْفَ ثُمَّ رَدَّ الْبَقِيَّةَ عَلَى ابْنَتِهِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zuhair] dari [Hayyan bin Salman] ia berkata; Ketika aku bersama [Suwaid bin Ghafalah], datang seorang laki-laki dan bertanya kepadanya tentang warisan seseorang yang meninggalkan anak perempuan dan isterinya; Aku beritahukan apakah itu keputusan Ali? Ia menjawab; Menurutku (cukup dengan) keputusan Ali. Ia melanjutkan; [Ali] memutuskan untuk isteri seperdelapan dan anak perempuan setengah kemudian ia mengembalikan sisanya kepada anak perempuan."
            },
            {
                "number": 2520,
                "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ إِسْرَائِيلَ عَنْ أَبِي الْهَيْثَمِ عَنْ إِبْرَاهِيمَ أَنَّ مَوْلَاةً لِإِبْرَاهِيمَ تُوُفِّيَتْ وَتَرَكَتْ مَالًا فَقُلْتُ لِإِبْرَاهِيمَ فَقَالَ إِنَّ لَهَا ذَا قَرَابَةٍ",
                "id": "Telah menceritakan kepada kami [ubaidhullah] dari [Isra`il] dari [Abu Al Haitsam] dari [Ibrahim] bahwa seorang mantan budak perempuan Ibrahim meninggal dunia dan meninggalkan harta. Maka aku menanyakannya kepada Ibrahim, ia pun menjawab; Sesungguhnya ia masih memiliki kekerabatan."
            },
            {
                "number": 2521,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا أَشْعَثُ عَنْ الشَّعْبِيِّ عَنْ عُمَرَ وَعَلِيٍّ وَزَيْدٍ قَالَ وَأَحْسَبُهُ قَدْ ذَكَرَ عَبْدَ اللَّهِ أَيْضًا أَنَّهُمْ قَالُوا الْوَلَاءُ لِلْكُبْرِ يَعْنُونَ بِالْكُبْرِ مَا كَانَ أَقْرَبَ بِأَبٍ أَوْ أُمٍّ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Asy'ats] dari [Asy Sya'bi] dari [Umar], [Ali] dan [Zaid]. Ia berkata; Dan aku mengira juga dikatakan oleh [Abdullah]. Mereka berkata; Wala` untuk yang lebih tua. Menurut mereka, yang dimaksud lebih tua adalah yang lebih dekat dengan ayah atau ibu."
            },
            {
                "number": 2522,
                "arab": " حَدَّثَنَا يَزِيدُ حَدَّثَنَا أَشْعَثُ عَنْ ابْنِ سِيرِينَ عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ قَالَ كُتِبَ إِلَى عُمَرَ فِي شَأْنِ فُكَيْهَةَ بِنْتِ سَمْعَانَ أَنَّهَا مَاتَتْ وَتَرَكَتْ ابْنَ أَخِيهَا لِأَبِيهَا وَأُمِّهَا وَابْنَ أَخِيهَا لِأَبِيهَا فَكَتَبَ عُمَرُ إِنَّ الْوَلَاءَ لِلْكُبْرِ",
                "id": "Telah menceritakan kepada kami [Yazid] telah menceritakan kepada kami [Asy'ats] dari [Ibnu Sirin] dari [Abdullah bin Utbah] ia berkata; Sebuah surat dikirim kepada Umar tentang perihal Fukaihah binti Sam'an yang meninggal dunia dan meninggalkan seorang anak laki-laki dari saudara laki-laki seayah dan seibu serta seorang anak laki-laki dari saudara laki-laki seayah. Maka [Umar] membalas surat tersebut; Sesungguhnya wala` untuk yang lebih tua."
            },
            {
                "number": 2523,
                "arab": " حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ عَنْ الشَّيْبَانِيِّ عَنْ الشَّعْبِيِّ أَنَّ عَلِيًّا وَزَيْدًا قَالَا الْوَلَاءُ لِلْكُبْرِ و قَالَ عَبْدُ اللَّهِ وَشُرَيْحٌ لِلْوَرَثَةِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] dari [Asy Syaibani] dari [Asy Sya'bi] bahwa [Ali] dan [Zaid] berkata; Wala` untuk yang lebih tua. Sementara [Abdullah] dan [Syuraih] berkata; Untuk ahli waris."
            },
            {
                "number": 2524,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ أَشْعَثَ عَنْ الشَّعْبِيِّ قَالَ قَضَى عُمَرُ وَعَبْدُ اللَّهِ وَعَلِيٌّ وَزَيْدٌ لِلْكُبْرِ بِالْوَلَاءِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Uyainah] dari [Ali bin Mushir] dari [Asy'ats] dari [Asy Sya'bi] ia berkata; [Umar], [Abdullah], [Ali] dan [Zaid] memutuskan bahwa wala` untuk yang lebih tua."
            },
            {
                "number": 2525,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَرِيكٌ عَنْ أَشْعَثَ عَنْ ابْنِ سِيرِينَ قَالَ تُوُفِّيَتْ فُكَيْهَةُ بِنْتُ سَمْعَانَ وَتَرَكَتْ ابْنَ أَخِيهَا لِأَبِيهَا وَبَنِي بَنِي أَخِيهَا لِأَبِيهَا وَأُمِّهَا فَوَرَّثَ عُمَرُ بَنِي أَخِيهَا لِأَبِيهَا ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syarik] dari [Asy'ats] dari [Ibnu Sirin] ia berkata; Fukaihah binti Sam'an meninggal dunia dan meninggalkan seorang anak laki-laki dari saudara laki-laki seayah dan anak laki-laki dari anak laki-laki (cucu laki-laki) dari saudara laki-laki seayah dan seibu. Maka [Umar] memberikan warisan kepada anak laki-laki dari saudara laki-laki seayah."
            },
            {
                "number": 2526,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عُمَرَ وَعَلِيٍّ وَزَيْدٍ أَنَّهُمْ قَالُوا الْوَلَاءُ لِلْكُبْرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Abdus Salam bin Harb] dari [Al A'masy] dari [Ibrahim] dari [Umar], [Ali] dan [Zaid] bahwa mereka berkata; Wala` untuk yang lebih tua."
            },
            {
                "number": 2527,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ فِي أَخَوَيْنِ وَرِثَا مَوْلًى كَانَ أَعْتَقَهُ أَبُوهُمَا فَمَاتَ أَحَدُهُمَا وَتَرَكَ وَلَدًا قَالَ كَانَ عَلِيٌّ وَزَيْدٌ وَعَبْدُ اللَّهِ يَقُولُونَ الْوَلَاءُ لِلْكُبْرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Abu 'Awanah] dari [Mughirah] dari [Ibrahim] tentang dua saudara laki-laki yang mewarisi mantan budak yang telah dimerdekakan ayah mereka. Lalu salah seorang dari dua saudara itu meninggal dunia dan meninggalkan seorang anak laki-laki, ia berkata; [Ali], [Zaid] dan [Abdullah] berkata; Wala` untuk yang lebih tua."
            },
            {
                "number": 2528,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ قَالَ سَمِعْتُ مَطَرًا الْوَرَّاقَ يَقُولُ قَالَ عُمَرُ وَعَلِيٌّ الْوَلَاءُ لِلْكُبْرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Hammad bin Zaid] ia berkata; Aku mendengar [Mathar Al Warraq] berkata; [Umar] dan [Ali] berkata; Wala` untuk yang lebih tua."
            },
            {
                "number": 2529,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى عَنْ رَوْحٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ وَابْنِ جُرَيْجٍ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ قَالَ الْوَلَاءُ لِلْكُبْرِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isa] dari [Rauh] dari [Ibnu Juraij] dari ['Atha`] dan Ibnu Juraij juga dari [Ibnu Thawus] dari [ayahnya] ia berkata; Wala` untuk yang lebih tua."
            },
            {
                "number": 2530,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ قَالَ الْوَلَاءُ لِلْكُبْرِ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Musa] dari [Isra`il] dari [Manshur] dari [Ibrahim] ia berkata; Wala` untuk yang lebih tua."
            },
            {
                "number": 2531,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ مُطَرِّفٍ عَنْ الشَّعْبِيِّ وَسُفْيَانُ عَنْ يُونُسَ عَنْ الْحَسَنِ فِي الرَّجُلِ يُوَالِي الرَّجُلَ قَالَا هُوَ بَيْنَ الْمُسْلِمِينَ قَالَ سُفْيَانُ وَكَذَلِكَ نَقُولُ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Mutharrif] dari [Asy Sya'bi] dan Sufyan dari [Yunus] dari [Al Hasan] tentang seseorang menjadikan wali untuk orang lain, keduanya berkata; Ia sama dengan kaum muslimin lainnya. Sufyan berkata; Kami juga berpendapat seperti itu."
            },
            {
                "number": 2532,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ قَالَ سَمِعْتُ تَمِيمًا الدَّارِيَّ يَقُولُ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا السُّنَّةُ فِي الرَّجُلِ مِنْ أَهْلِ الْكُفْرِ يُسْلِمُ عَلَى يَدَيْ رَجُلٍ مِنْ الْمُسْلِمِينَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ أَوْلَى النَّاسِ بِمَحْيَاهُ وَمَمَاتِهِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Abdul Aziz bin Umar bin Abdul Aziz] dari [Abdullah bin Mauhab] ia berkata; Aku pernah mendengar [Tamim Ad Dari] berkata; Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam; Wahai Rasulullah, apa yang sunnah dilakukan terhadap seorang kafir yang masuk Islam di hadapan seorang muslim? Rasulullah shallallahu 'alaihi wasallam menjawab: \"Seseorang itu (orang kafir yang masuk Islam) lebih berhak dengan hidup dan matinya.\""
            },
            {
                "number": 2533,
                "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ قَالَ سُئِلَ عَنْ رَجُلٍ مِنْ أَهْلِ السَّوَادِ أَسْلَمَ عَلَى يَدَيْ رَجُلٍ قَالَ يَعْقِلُ عَنْهُ وَيَرِثُهُ",
                "id": "Telah menceritakan kepada kami [ubaidhullah] dari [Isra`il] dari [Manshur] dari [Ibrahim] ia berkata; Ia pernah ditanya tentang seorang laki-laki dari ahli kegelapan yang masuk Islam di hadapan seseorang? Ia menjawab; Laki-laki membayar diyat orang tersebut dan ia berhak mewarisinya."
            },
            {
                "number": 2534,
                "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا شُعْبَةُ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ تَرِثُ الْمَرْأَةُ مِنْ دِيَةِ زَوْجِهَا فِي الْعَمْدِ وَالْخَطَإِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Syu'bah] dari [Mughirah] dari [Ibrahim] ia berkata; Isteri berhak mewarisi diyat suaminya pada pembunuhan sengaja maupun tidak sengaja."
            },
            {
                "number": 2535,
                "arab": " حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ الدِّيَةُ عَلَى فَرَائِضِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Mughirah] dari [Ibrahim] ia berkata; Diyat dibagikan berdasarkan pembagian yang telah ditetapkan Allah."
            },
            {
                "number": 2536,
                "arab": " حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ قَالَ الدِّيَةُ سَبِيلُهَا سَبِيلُ الْمِيرَاثِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] ia berkata; Cara pembagian diyat sama dengan cara pembagian harta warisan."
            },
            {
                "number": 2537,
                "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حُمَيْدٍ وَدَاوُدَ بْنِ أَبِي هِنْدٍ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ كَتَبَ أَنْ يُوَرَّثَ الْإِخْوَةُ مِنْ الْأُمِّ مِنْ الدِّيَةِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Salamah] dari [Humaid] dan [Dawud bin Abu Hind] bahwa [Umar bin Abdul Aziz] menetapkan bahwa para saudara laki-laki seibu mewarisi diyat."
            },
            {
                "number": 2538,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ الْعَقْلُ مِيرَاثٌ بَيْنَ وَرَثَةِ الْقَتِيلِ عَلَى كِتَابِ اللَّهِ وَفَرَائِضِهِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah bercerita kepadaku [Al Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] ia berkata; Diyat adalah warisan yang dibagikan di antara ahli waris korban yang terbunuh sesuai dengan kitab Allah dan pembagian yang telah ditetapkanNya."
            },
            {
                "number": 2539,
                "arab": " حَدَّثَنَا قَبِيصَةُ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ بَعْضِ وَلَدِ ابْنِ الْحَنَفِيَّةِ عَنْ عَلِيٍّ قَالَ لَقَدْ ظَلَمَ مَنْ لَمْ يُوَرِّثْ الْإِخْوَةَ مِنْ الْأُمِّ مِنْ الدِّيَةِ",
                "id": "Telah menceritakan kepada kami [Qabishah] telah menceritakan kepada kami [Sufyan] dari [Amr bin Dinar] dari [sebagian anak Ibnu Al Hanafiyyah] dari [Ali] ia berkata; Sungguh telah melakukan kezhaliman orang yang tidak memberikan hak waris dari harta diyat kepada para saudara laki-laki seibu."
            },
            {
                "number": 2540,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو خَالِدٍ أَخْبَرَنَا ابْنُ سَالِمٍ عَنْ الشَّعْبِيِّ عَنْ عُمَرَ وَعَلِيٍّ وَزَيْدٍ قَالُوا الدِّيَةُ تُورَثُ كَمَا يُورَثُ الْمَالُ خَطَؤُهُ وَعَمْدُهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abu Khalid] telah mengabarkan kepada kami [Ibnu Salim] dari [Asy Sya'bi] dari [Umar], [Ali] dan [Zaid]. Mereka berkata; Diyat dapat diwarisi sebagaimana harta yang dapat diwarisi, baik diyat pembunuhan yang tidak disengaja maupun yang disengaja."
            },
            {
                "number": 2541,
                "arab": " حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ حَدَّثَنَا إِسْمَعِيلُ عَنْ عَامِرٍ قَالَ كَانَ عَلِيٌّ لَا يُوَرِّثُ الْإِخْوَةَ مِنْ الْأُمِّ وَلَا الزَّوْجَ وَلَا الْمَرْأَةَ مِنْ الدِّيَةِ شَيْئًا قَالَ عَبْد اللَّهِ بَعْضُهُمْ يُدْخِلُ بَيْنَ إِسْمَعِيلَ وَعَامِرٍ رَجُلًا",
                "id": "Telah menceritakan kepada kami [Ja'far bin 'Aun] telah menceritakan kepada kami [Isma'il] dari [Amir] ia berkata; [Ali] tidak memberikan hak waris sedikitpun kepada para saudara laki-laki seibu, suami dan isteri dari diyat. Abdullah berkata; Sebagian mereka memasukkan seseorang (perawi dalam sanad hadits) di antara Isma'il dan Amir."
            },
            {
                "number": 2542,
                "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ زِيَادٍ الْأَعْلَمِ عَنْ الْحَسَنِ قَالَ لَا يُوَرَّثُ الْإِخْوَةُ مِنْ الْأُمِّ مِنْ الدِّيَةِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] dari [Hammad bin Salamah] dari [Ziyad Al A'lam] dari [Al Hasan] ia berkata; Saudara laki-laki seibu tidak dapat mewarisi harta yang berasal dari diyat."
            },
            {
                "number": 2543,
                "arab": " حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ خَارِجَةَ بْنِ زَيْدٍ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَ كُلُّ قَوْمٍ مُتَوَارِثِينَ عَمِيَ مَوْتُهُمْ فِي هَدْمٍ أَوْ غَرَقٍ فَإِنَّهُمْ لَا يَتَوَارَثُونَ يَرِثُهُمْ الْأَحْيَاءُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Ibnu Abu Az Zinad] dari [ayahnya] dari [Kharijah bin Zaid] dari [Zaid bin Tsabit] ia berkata; Setiap orang yang berhak mewarisi (dari harta) yang meninggal dunia karena tertimpa reruntuhan atau tenggelam, maka mereka tidak dapat saling mewarisi. Tetapi ahli waris yang hidup dapat mewarisi mereka."
            },
            {
                "number": 2544,
                "arab": " حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى بْنِ عَتِيقٍ قَالَ قَرَأْتُ فِي بَعْضِ كُتُبِ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ فِي الْقَوْمِ يَقَعُ عَلَيْهِمْ الْبَيْتُ لَا يُدْرَى أَيُّهُمَا مَاتَ قَبْلُ قَالَ لَا يُوَرَّثُ الْأَمْوَاتُ بَعْضُهُمْ مِنْ بَعْضٍ وَيُوَرَّثُ الْأَحْيَاءُ مِنْ الْأَمْوَاتِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin 'Atiq] ia berkata; Aku pernah membaca sebagian surat untuk [Umar bin Abdul Aziz] tentang beberapa orang yang tertimpa reruntuhan rumah, tidak diketahui siapa di antara mereka yang lebih dahulu meninggal dunia. Ia menjawab; Orang-orang yang meninggal dunia tidak dapat saling mewarisi sebagian dengan sebagian lain namun ahli waris yang masih hidup dapat mewarisi orang-orang yang telah meninggal dunia."
            },
            {
                "number": 2545,
                "arab": " حَدَّثَنَا نُعَيْمُ بْنُ حَمَّادٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ حَدَّثَنَا جَعْفَرٌ عَنْ أَبِيهِ أَنَّ أُمَّ كُلْثُومٍ وَابْنَهَا زَيْدًا مَاتَا فِي يَوْمٍ وَاحِدٍ فَالْتَقَتْ الصَّائِحَتَانِ فِي الطَّرِيقِ فَلَمْ يَرِثْ كُلُّ وَاحِدٍ مِنْهُمَا مِنْ صَاحِبِهِ وَأَنَّ أَهْلَ الْحَرَّةِ لَمْ يَتَوَارَثُوا وَأَنَّ أَهْلَ صِفِّينَ لَمْ يَتَوَارَثُوا",
                "id": "Telah menceritakan kepada kami [Nu'aim bin Hammad] dari [Abdul Aziz bin Muhammad] telah menceritakan kepada kami [Ja'far] dari [ayahnya] bahwa Ummu Kultsum dan anak laki-lakinya, Zaid, keduanya meninggal dunia pada hari yang sama. Lalu ada dua orang yang berteriak di jalan bertemu, namun masing-masing dari keduanya tidak dapat mewarisi. Orang-orang yang meninggal dunia pada peristiwa Harrah tidak dapat saling mewarisi dan orang-orang yang meninggal dunia pada peristiwa Shiffin juga tidak dapat saling mewarisi."
            },
            {
                "number": 2546,
                "arab": " أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ أَخْبَرَنَا ابْنُ أَبِي لَيْلَى عَنْ الشَّعْبِيِّ أَنَّ بَيْتًا بِالشَّامِ وَقَعَ عَلَى قَوْمٍ فَوَرَّثَ عُمَرُ بَعْضَهُمْ مِنْ بَعْضٍ",
                "id": "Telah mengabarkan kepada kami [Ja'far bin 'Aun] telah mengabarkan kepada kami [Ibnu Abu Laila] dari [Asy Sya'bi] bahwa di Syam ada sebuah rumah runtuh dan menimpa penghuninya. Maka [Umar] memberikan warisan kepada sebagian mereka dari sebagian lainnya."
            },
            {
                "number": 2547,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ حُرَيْشٍ عَنْ أَبِيهِ عَنْ عَلِيٍّ أَنَّهُ وَرَّثَ أَخَوَيْنِ قُتِلَا بِصِفِّينَ أَحَدَهُمَا مِنْ الْآخَرِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Huraisy] dari [ayahnya] dari [Ali] bahwa ia memberikan hak waris kepada dua orang laki-laki bersaudara yang terbunuh pada peristiwa Shiffin. Salah satu dari mereka dapat mewarisi yang lain."
            },
            {
                "number": 2548,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا حُمَيْدٌ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ أَنَّ رَجُلًا هَلَكَ وَتَرَكَ عَمَّتَهُ وَخَالَتَهُ فَأَعْطَى عُمَرُ الْعَمَّةَ نَصِيبَ الْأَخِ وَأَعْطَى الْخَالَةَ نَصِيبَ الْأُخْتِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Humaid] dari [Bakr bin Abdullah Al Muzani] bahwa ada seorang laki-laki meninggal dunia dan meninggalkan seorang bibi dari pihak ayah dan bibi dari pihak ibu. Maka [Umar] memberikan bagian kepada bibi dari pihak ayah seperti bagian saudara laki-laki dan memberikan kepada bibi dari pihak ibu seperti bagian saudara perempuan."
            },
            {
                "number": 2549,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ قَالَ مَنْ أَدْلَى بِرَحِمٍ أُعْطِيَ بِرَحِمِهِ الَّتِي يُدْلِي بِهَا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] dari [Al A'masy] dari [Ibrahim] ia berkata; Barangsiapa yang mempunyai hubungan satu rahim, maka ia diberikan warisan dengan sebab hubungan satu rahim yang menyebabkan ia terhubung."
            },
            {
                "number": 2550,
                "arab": " حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ قَالَ حَدَّثَنِي أَبُو إِسْحَقَ الشَّيْبَانِيُّ عَنْ الشَّعْبِيِّ فِي رَجُلٍ تَرَكَ عَمَّتَهُ وَابْنَةَ أَخِيهِ قَالَ الْمَالُ لِابْنَةِ أَخِيهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] ia berkata; telah menceritakan kepadaku [Abu Ishaq Asy Syaibani] dari [Asy Sya'bi] tentang seorang laki-laki yang meninggalkan seorang bibi dari pihak ayah dan anak perempuan dari saudara laki-laki, ia berkata; Harta diberikan kepada anak perempuan dari saudara laki-laki."
            },
            {
                "number": 2551,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَرِيكٌ عَنْ لَيْثٍ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْخَالُ وَارِثٌ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syarik] dari [Laits] dari [Muhammad bin Munkadir] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, Beliau bersabda: \"Paman dari pihak ibu adalah ahli waris.\""
            },
            {
                "number": 2552,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ عُبَيْدَةَ عَنْ إِبْرَاهِيمَ أَنَّ عُمَرَ وَعَبْدَ اللَّهِ رَأَيَا أَنْ يُوَرِّثَا خَالًا",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [Ubaidah] dari [Ibrahim] bahwa [Umar] dan [Abdullah] berpendapat bahwa bibi dari pihak ibu dapat mewarisi."
            },
            {
                "number": 2553,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ سُلَيْمَانَ أَبِي إِسْحَقَ عَنْ الشَّعْبِيِّ فِي عَمَّةٍ وَبِنْتِ أَخٍ قَالَ الْمَالُ لِابْنَةِ الْأَخِ حَدَّثَنَا أَبُو نُعَيْمٍ أَخْبَرَنَا حَسَنٌ عَنْ سُلَيْمَانَ عَنْ بَعْضِهِمْ عَنْ إِبْرَاهِيمَ قَالَ لِلْعَمَّةِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [Sulaiman Abu Ishaq] dari [Asy Sya'bi] tentang bibi dari pihak ibu dan anak perempuan dari saudara laki-laki, ia berkata; Harta warisan diberikan kepada anak perempuan dari saudara laki-laki. Telah menceritakan kepada kami [Abu Nu'aim] telah mengabarkan kepada kami [Hasan] dari [Sulaiman] dari [sebagian mereka] dari [Ibrahim] ia berkata; Harta tersebut diberikan kepada bibi dari pihak ayah."
            },
            {
                "number": 2554,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ الشَّيْبَانِيِّ عَنْ الشَّعْبِيِّ فِي بِنْتِ أَخٍ وَعَمَّةٍ قَالَ أَعْطِي الْمَالَ لِابْنَةِ الْأَخِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Asy Syaibani] dari [Asy Sya'bi] tentang anak perempuan dari saudara laki-laki dan bibi dari pihak ayah, ia berkata; Harta diberikan kepada anak perempuan dari saudara laki-laki."
            },
            {
                "number": 2555,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا يُونُسُ عَنْ عَامِرٍ قَالَ كَانَ مَسْرُوقٌ يُنَزِّلُ الْعَمَّةَ بِمَنْزِلَةِ الْأَبِ إِذَا لَمْ يَكُنْ أَبٌ وَالْخَالَةَ بِمَنْزِلَةِ الْأُمِّ إِذَا لَمْ تَكُنْ أُمٌّ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Yunus] dari [Amir] ia berkata; [Masruq] menempatkan bibi dari pihak ayah sama pada kedudukan ayah jika mayit tidak memiliki ayah dan bibi dari pihak ibu pada kedudukan ibu jika mayit tidak memiliki ibu."
            },
            {
                "number": 2556,
                "arab": " حَدَّثَنَا يَعْلَى عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ حَبَّانَ نَسَبَهُ إِلَى جَدِّهِ عَنْ عَمِّهْ وَاسِعِ بْنِ حَبَّانَ قَالَ تُوُفِّيَ ابْنُ الدَّحْدَاحَةِ وَكَانَ أَتِيًّا وَهُوَ الَّذِي لَا يُعْرَفُ لَهُ أَصْلٌ فَكَانَ فِي بَنِي الْعَجْلَانِ وَلَمْ يَتْرُكْ عَقِبًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَاصِمِ بْنِ عَدِيٍّ هَلْ تَعْلَمُونَ لَهُ فِيكُمْ نَسَبًا قَالَ مَا نَعْرِفُهُ يَا رَسُولَ اللَّهِ فَدَعَا ابْنَ أُخْتِهِ فَأَعْطَاهُ مِيرَاثَهُ",
                "id": "Telah menceritakan kepada kami [Ya'la] dari [Muhammad bin Ishaq] dari [Muhammad bin Habban] ia menisbatkan kepada kakeknya dari pamannya [Wasi' bin Habban] ia berkata; Ibnu Ad-Dahdahah meninggal dan ia adalah seorang pendatang yang tidak dikenali asal usul keturunannya, ia tinggal di Bani Al-'Ajlan dan tidak meninggalkan seorang anak. Maka Rasulullah shallallahu 'alaihi wasallam bertanya kepada 'Ashim bin Adi; \"Apakah kalian mengetahui ia memiliki hubungan nasab dengan kalian?\" Ia menjawab; Kami tidak tahu, wahai Rasulullah. Maka beliau memanggil anak laki-laki dari saudara perempuannya dan kepada anak laki-laki dari saudara perempuannya tersebut beliau memberikan harta warisannya."
            },
            {
                "number": 2557,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا أَبُو هَانِئٍ قَالَ سُئِلَ عَامِرٌ عَنْ امْرَأَةٍ أَوْ رَجُلٍ تُوُفِّيَ وَتَرَكَ خَالَةً وَعَمَّةً لَيْسَ لَهُ وَارِثٌ وَلَا رَحِمٌ غَيْرُهُمَا فَقَالَ كَانَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ يُنَزِّلُ الْخَالَةَ بِمَنْزِلَةِ أُمِّهِ وَيُنَزِّلُ الْعَمَّةَ بِمَنْزِلَةِ أَخِيهَا",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Abu Hani`] ia berkata; [Amir] pernah ditanya tentang seorang perempuan atau laki-laki yang meninggal dunia dan meninggalkan seorang bbi dari pihak ibu dan seorang bibi dari pihak ayah. Tidak ada seorang ahli waris dan orang yang satu rahim pun selain mereka berdua. Maka ia berkata; [Abdullah Mas'ud] menempatkan bibi dari pihak ibu pada kedudukan ibu dan bibi dari pihak ayah pada kedudukan saudara laki-laki."
            },
            {
                "number": 2558,
                "arab": " حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ عَنْ عَمْرٍو عَنْ الْحَسَنِ فِي رَجُلٍ اعْتَرَفَ عِنْدَ مَوْتِهِ بِأَلْفِ دِرْهَمٍ لِرَجُلٍ وَأَقَامَ آخَرُ بَيِّنَةً بِأَلْفِ دِرْهَمٍ وَتَرَكَ الْمَيِّتُ أَلْفَ دِرْهَمٍ فَقَالَ الْمَالُ بَيْنَهُمَا نِصْفَيْنِ إِلَّا أَنْ يَكُونَ مُفْلِسًا فَلَا يَجُوزُ إِقْرَارُهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] dari [Amr] dari [Al Hasan] tentang seorang laki-laki ketika meninggal dunia mengaku mempunyai hutang seribu dirham kepada seseorang dan ada orang lain yang memberikan bukti bahwa ia (si mayit) juga mempunyai hutang seribu dirham kepadanya. Sementara si mayit tersebut hanya meninggalkan harta seribu dirham, ia berkata; Harta itu dibagi dua, masing-masing mendapat setengah, kecuali jika si mayit adalah orang yang tidak punya harta maka pengakuannya tidak dibenarkan."
            },
            {
                "number": 2559,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ قَالَ قُلْتُ لِشَرِيكٍ كَيْفَ ذَكَرْتَ فِي الْأَخَوَيْنِ يَدَّعِي أَحَدُهُمَا أَخًا قَالَ يَدْخُلُ عَلَيْهِ فِي نَصِيبِهِ قُلْتُ مَنْ ذَكَرَهُ قَالَ جَابِرٌ عَنْ عَامِرٍ عَنْ عَلِيٍّ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] ia berkata; Aku bertanya kepada [Syarik]; Bagaimana riwayat yang engkau sebutkan tentang dua saudara laki-laki yang salah satunya mengaku sebagai saudara? Ia menjawab; Orang yang mengaku ini masuk dalam bagian saudara. Aku bertanya; Siapa yang meriwayatkannya? Ia menjawab; [Jabir] dari [Amir] dari [Ali]."
            },
            {
                "number": 2560,
                "arab": " حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ الْمُحَارِبِيُّ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ فِي الْإِخْوَةِ يَدَّعِي بَعْضُهُمْ الْأَخَ وَيُنْكِرُ الْآخَرُونَ قَالَ يَدْخُلُ مَعَهُمْ بِمَنْزِلَةِ عَبْدٍ يَكُونُ بَيْنَ الْإِخْوَةِ فَيَعْتِقَ أَحَدُهُمْ نَصِيبَهُ قَالَ وَكَانَ عَامِرٌ وَالْحَكَمُ وَأَصْحَابُهُمَا يَقُولُونَ لَا يَدْخُلُ إِلَّا فِي نَصِيبِ الَّذِي اعْتَرَفَ بِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abdurrahman bin Muhammad Al Muharibi] dari [Al A'masy] dari [Ibrahim] tentang para saudara laki-laki di mana sebagian mereka mengaku sebagai saudara dan sebagian lainnya tidak mengaku sebagai saudara, ia berkata; Saudara yang tidak mengaku sebagai saudara masuk bersama mereka seperti seorang budak yang dimiliki beberapa saudara, lalu salah seorang dari mereka tersebut memerdekakan bagiannya. Ia berkata lagi; [Amir], [Hakam] dan para sahabat mereka berkata; Ia tidak masuk kecuali dalam bagian saudara yang mengaku sebagai saudaranya."
            },
            {
                "number": 2561,
                "arab": " حَدَّثَنَا أَبُو بَكْرٍ عَنْ وَكِيعٍ قَالَ إِذَا كَانَا أَخَوَيْنِ فَادَّعَى أَحَدُهُمَا أَخًا وَأَنْكَرَهُ الْآخَرُ قَالَ كَانَ ابْنُ أَبِي لَيْلَى يَقُولُ هِيَ مِنْ سِتَّةٍ لِلَّذِي لَمْ يَدَّعِ ثَلَاثَةٌ وَلِلْمُدَّعِي سَهْمَانِ وَلِلْمُدَّعَى سَهْمٌ",
                "id": "Telah menceritakan kepada kami [Abu Bakr] dari [Waki'] ia berkata; Jika ada dua orang bersaudara, lalu salah satunya mengaku sebagai saudara dan yang lainnya tidak mengaku sebagai saudara, [Ibnu Abu Laila] berkata; Pembagian warisannya dari enam. Orang yang tidak mengaku mendapat tiga bagian, orang yang mengakui mendapat dua bagian dan orang yang diakui mendapatkan satu bagian."
            },
            {
                "number": 2562,
                "arab": " حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُغِيرَةَ عَنْ حَمَّادٍ فِي الرَّجُلِ يَكُونُ لَهُ ثَلَاثَةُ بَنِينَ فَقَالَ ثُلُثِي لِأَصْغَرِ بَنِيَّ فَقَالَ الْأَوْسَطُ أَنَا أُجِيزُ وَقَالَ الْأَكْبَرُ لَا أُجِيزُ قَالَ هِيَ مِنْ تِسْعَةٍ يُخْرِجُ ثُلُثَهُ فَلَهُ سَهْمُهُ وَسَهْمُ الَّذِي أَجَازَ وَقَالَ حَمَّادٌ يَرُدُّ السَّهْمَ عَلَيْهِمْ جَمِيعًا وَقَالَ عَامِرٌ الَّذِي رَدَّ إِنَّمَا رَدَّ عَلَى نَفْسِهِ",
                "id": "Telah menceritakan kepada kami [Yunus bin Muhammad] telah menceritakan kepada kami [Abu 'Awanah] dari [Mughirah] dari [Hammad] tentang seorang laki-laki yang memiliki tiga orang anak laki-laki. Laki-laki itu pun berkata; Sepertiga hartaku untuk anakku yang bungsu. Anak kedua berkata; Aku membolehkan dan anak yang sulung berkata; Aku tidak membolehkan. Ia menjawab; Pembagian warisan ini dari sembilan. Dikeluarkan sepertiganya, yang tidak membolehkan mendapat bagiannya dan satu bagian untuk yang membolehkan. Hammad berkata; Bagian dikembalikan kepada mereka. Sedangkan [Amir] berkata; Orang yang menolak, sesungguhnya ia menolak atas dirinya sendiri."
            },
            {
                "number": 2563,
                "arab": " حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ شَرِيكٍ عَنْ خَالِدٍ عَنْ ابْنِ سِيرِينَ عَنْ شُرَيْحٍ فِي رَجُلٍ أَقَرَّ بِأَخٍ قَالَ بَيِّنَتُهُ أَنَّهُ أَخُوهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Yahya bin Adam] dari [Syarik] dari [Khalid] dari [Ibnu Sirin] dari [Syuraih] tentang seseorang yang mengaku sebagai saudara mayit, ia berkata; Ia harus menunjukkan bukti bahwa ia adalah saudaranya."
            },
            {
                "number": 2564,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُغِيرَةَ عَنْ الْحَارِثِ الْعُكْلِيِّ فِي رَجُلٍ أَقَرَّ عِنْدَ مَوْتِهِ بِأَلْفِ دِرْهَمٍ مُضَارَبَةً وَأَلْفٍ دَيْنًا وَلَمْ يَدَعْ إِلَّا أَلْفَ دِرْهَمٍ قَالَ يُبْدَأُ بِالدَّيْنِ فَإِنْ فَضَلَ فَضْلٌ كَانَ لِصَاحِبِ الْمُضَارَبَةِ",
                "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Mughirah] dari [Al Harits Al 'Ukli] tentang seseorang yang mengaku ketika hendak meninggal dunia bahwa ia memiliki pinjaman seribu dirham secara mudlarabah dan hutang seribu dirham. Tetapi ia tidak mengaku kecuali seribu dirham saja, ia berkata; Hutang dilunasi dahulu. Jika ada sisa (dari harta), maka diberikan kepada orang yang memberi pinjaman secara mudlarabah. "
            },
            {
                "number": 2565,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ مُطَرِّفٍ عَنْ الشَّعْبِيِّ فِي رَجُلٍ مَاتَ وَتَرَكَ ثَلَاثَ مِائَةِ دِرْهَمٍ وَثَلَاثَةَ بَنِينَ فَجَاءَ رَجُلٌ يَدَّعِي مِائَةَ دِرْهَمٍ عَلَى الْمَيِّتِ فَأَقَرَّ لَهُ أَحَدُهُمْ قَالَ يَدْخُلُ عَلَيْهِمْ بِالْحِصَّةِ ثُمَّ قَالَ الشَّعْبِيُّ مَا أُرَى أَنْ يَكُونَ مِيرَاثًا حَتَّى يُقْضَى الدَّيْنُ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [Mutharrif] dari [Asy Sya'bi] tentang seseorang yang meninggal dunia dan meninggalkan harta senilai tiga ratus dirham dan tiga orang anak laki-laki. Lalu ada seseorang mengakui si mayit berhutang seratus dirham kepadanya. Salah seorang dari anak-anaknya membenarkan pengakuan tersebut. Ia berkata; Hutang itu termasuk dalam bagian mereka yang membenarkan. Kemudian Asy Sya'bi berkata; Aku tidak berpendapat si mayit memiliki warisan hingga hutang dilunasi."
            },
            {
                "number": 2566,
                "arab": " حَدَّثَنَا أَبُو خَيْثَمَةَ مُصْعَبُ بْنُ سَعِيدٍ الْحَرَّانِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ عَنْ الْأَشْعَثِ عَنْ الْحَسَنِ فِي رَجُلٍ هَلَكَ وَتَرَكَ ابْنَيْنِ وَتَرَكَ أَلْفَيْ دِرْهَمٍ فَاقْتَسَمَا الْأَلْفَيْ دِرْهَمٍ وَغَابَ أَحَدُ الِابْنَيْنِ فَجَاءَ رَجُلٌ فَاسْتَحَقَّ عَلَى الْمَيِّتِ أَلْفَ دِرْهَمٍ قَالَ يَأْخُذُ جَمِيعَ مَا فِي يَدِ هَذَا الشَّاهِدِ وَيُقَالُ لَهُ اتَّبِعْ أَخَاكَ الْغَائِبَ وَخُذْ نِصْفَ مَا فِي يَدِهِ",
                "id": "Telah menceritakan kepada kami [Abu Khaitsamah Mush'ab bin Sa'id Al Harrani] telah menceritakan kepada kami [Muhammad bin Abdullah] dari [Al Asy'ats] dari [Al Hasan] tentang seseorang yang meninggal dunia dan meninggalkan dua anak laki-laki dan harta senilai dua ribu dirham. Keduanya pun sepakat untuk membagi dua ribu dirham dan salah satunya pergi. Lalu ada seseorang datang dan menuntut hutang terhadap si mayit senilai seribu dirham. Ia berkata; Ia boleh mengambil semua yang ada di tangan anak laki-laki yang berada di tempat dan dikatakan kepadanya; Cari saudaramu yang pergi tersebut lalu ambil setengah dari apa yang ada di tangannya."
            },
            {
                "number": 2567,
                "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ زِيَادٍ الْأَعْلَمِ عَنْ الْحَسَنِ قَالَ إِذَا أَقَرَّ بَعْضُ الْوَرَثَةِ بِدَيْنٍ فَهُوَ عَلَيْهِ بِحِصَّتِهِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] dari [Hammad bin Salamah] dari [Ziyad Al A'lam] dari [Al Hasan] ia berkata; Jika sebagian ahli waris membenarkan si mayit memiliki hutang maka ahli waris tersebut harus melunasinya."
            },
            {
                "number": 2568,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا ثَابِتُ بْنُ الْوَلِيدِ بْنِ جُمَيْعٍ قَالَ أَخْبَرَنِي أَبِي عَنْ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ كَانَ ابْنُ مَسْعُودٍ يُوَرِّثُ أَهْلَ الْمُرْتَدِّ إِذَا قُتِلَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Tsabit bin Al Walid bin Jumai'] ia berkata; telah mengabarkan kepada kami [ayahku] dari [Al Qasim bin Abdur Rahman] ia berkata; [Ibnu Mas'ud] memberikan hak waris kepada ahli waris orang murtad jika ia terbunuh."
            },
            {
                "number": 2569,
                "arab": " حَدَّثَنَا الْحَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ جَعَلَ مِيرَاثَ الْمُرْتَدِّ لِوَرَثَتِهِ مِنْ الْمُسْلِمِينَ",
                "id": "Telah menceritakan kepada kami [Al Hajjaj bin Minhal] telah menceritakan kepada kami [Abu 'Awanah] dari [Al A'masy] dari [Abu Amr Asy Syaibani] bahwa [Ali bin Abu Thalib] menjadikan warisan orang murtad untuk ahli warisnya dari kaum muslimin."
            },
            {
                "number": 2570,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا الْحَجَّاجُ عَنْ الْحَكَمِ أَنَّ عَلِيًّا قَضَى فِي مِيرَاثِ الْمُرْتَدِّ لِأَهْلِهِ مِنْ الْمُسْلِمِينَ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Al Hajjaj] dari [Al Hakam] bahwa [Ali] memutuskan warisan orang murtad untuk keluarganya dari kaum muslimin."
            },
            {
                "number": 2571,
                "arab": " حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ حَدَّثَنَا عُبَيْدُ اللَّهِ هُوَ ابْنُ عَمْرٍو عَنْ عَبْدِ الْكَرِيمِ عَنْ الْحَكَمِ قَالَ إِذَا قَتَلَ الرَّجُلُ أَخَاهُ عَمْدًا لَمْ يُوَرَّثْ مِنْ مِيرَاثِهِ وَلَا مِنْ دِيَتِهِ فَإِذَا قَتَلَهُ خَطَأً وُرِّثَ مِنْ مِيرَاثِهِ وَلَمْ يُوَرَّثْ مِنْ دِيَتِهِ قَالَ وَكَانَ عَطَاءٌ يَقُولُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Zakariya bin 'Adi] telah menceritakan kepada kami [ubaidhullah] ia adalah Ibnu Amr, dari [Abdul Karim] dari [Al Hakam] ia berkata; Jika seseorang membunuh saudaranya secara sengaja maka ia tidak dapat mewarisi harta warisan darinya dan tidak pula dari diyatnya. Namun jika ia membunuhnya secara tidak sengaja maka ia dapat mewarisi harta warisannya. Tetapi tidak dapat mewarisi diyatnya. Ia berkata lagi; [Atha`] berpendapat seperti itu."
            },
            {
                "number": 2572,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ خِلَاسٍ عَنْ عَلِيٍّ قَالَ رَمَى رَجُلٌ أُمَّهُ بِحَجَرٍ فَقَتَلَهَا فَطَلَبَ مِيرَاثَهُ مِنْ إِخْوَتِهِ فَقَالَ لَهُ إِخْوَتُهُ لَا مِيرَاثَ لَكَ فَارْتَفَعُوا إِلَى عَلِيٍّ فَجَعَلَ عَلَيْهِ الدِّيَةَ وَأَخْرَجَهُ مِنْ الْمِيرَاثِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Uyainah] dari [Ali bin Mushir] dari [Sa'id] dari [Qatadah] dari [Khilas] dari [Ali] ia berkata; Ada seseorang melempar ibunya dengan batu hingga membunuhnya, lalu orang tersebut meminta warisan kepada para saudaranya. Para saudaranya pun berkata kepadanya; Tidak ada warisan bagimu. Lalu mereka mengadukan masalah ini kepada Ali, ia pun memutuskan bahwa orang tersebut wajib membayar diyat dan dikeluarkan dari warisan."
            },
            {
                "number": 2573,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زُهَيْرٌ عَنْ الْحَسَنِ بْنِ الْحُرِّ عَنْ الْحَكَمِ أَنَّ الرَّجُلَ إِذَا قَتَلَ امْرَأَتَهُ خَطَأً أَنَّهُ يُمْنَعُ مِيرَاثَهُ مِنْ الْعَقْلِ وَغَيْرِهِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zuhair] dari [Al Hasan bin Al Hurr] dari [Al Hakam] bahwa jika seseorang membunuh isterinya secara tidak sengaja maka ia tidak dapat mewarisi baik dari harta diyat maupun lainnya."
            },
            {
                "number": 2574,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ لَيْثٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ لَا يَرِثُ الْقَاتِلُ مِنْ الْمَقْتُولِ شَيْئًا",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Laits] dari [Mujahid] dari [Ibnu Abbas] ia berkata; Pembunuh tidak dapat mewarisi sedikit pun dari harta orang yang dibunuh."
            },
            {
                "number": 2575,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ عَنْ ابْنِ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ قَتَادَةَ فِي رَجُلٍ قَذَفَ امْرَأَتَهُ وَجَاءَ بِشُهُودٍ فَرُجِمَتْ قَالَ يَرِثُهَا",
                "id": "Telah menceritakan kepada kami [Sa'id bin Al Mughirah] dari [Ibnu Al Mubarak] dari [Ma'mar] dari [Qatadah] tentang seorang laki-laki yang menuduh isterinya dan ia mendatangkan beberapa saksi lalu isterinya pun dirajam, ia berkata; Suami dapat mewarisi isterinya."
            },
            {
                "number": 2576,
                "arab": " حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ حَمَّادٍ فِي رَجُلٍ جُلِدَ الْحَدَّ أَرَاهُ مَاتَ شَكَّ أَبُو النُّعْمَانِ قَالَ يَتَوَارَثَانِ",
                "id": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Hammad] tentang seorang laki-laki yang dijatuhi hukuman dera, menurutku ia meninggal, Abu An Nu'man ragu, ia berkata; Mereka dapat saling waris mewarisi."
            },
            {
                "number": 2577,
                "arab": " حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ عَامِرٍ عَنْ عَلِيٍّ قَالَ الْقَاتِلُ لَا يَرِثُ وَلَا يَحْجُبُ",
                "id": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Muhammad bin Salim] dari [Amir] dari [Ali] ia berkata; Pembunuh tidak dapat mewarisi dan tidak dapat menghalangi pembagian warisan."
            },
            {
                "number": 2578,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ لَيْثٍ عَنْ أَبِي عَمْرٍو الْعَبْدِيِّ عَنْ عَلِيٍّ قَالَ لَا يُوَرَّثُ الْقَاتِلُ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [Laits] dari [Abu Amr Al 'Abdi] dari [Ali] ia berkata; Pembunuh tidak dapat mewarisi."
            },
            {
                "number": 2579,
                "arab": " حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ حَدَّثَنَا أَبُو بَكْرٍ عَنْ مُطَرِّفٍ عَنْ الشَّعْبِيِّ قَالَ قَالَ عُمَرُ لَا يَرِثُ قَاتِلٌ خَطَأً وَلَا عَمْدًا",
                "id": "Telah menceritakan kepada kami [Zakariya bin Adi] telah menceritakan kepada kami [Abu Bakr] dari [Mutharrif] dari [Asy Sya'bi] ia berkata; [Umar] berkata; Pembunuh tidak berhak mewarisi, baik pembunuhan yang dilakukan secara tidak sengaja maupun secara sengaja."
            },
            {
                "number": 2580,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ لَيْثٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ لَا يَرِثُ الْقَاتِلُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Laits] dari [Thawus] dari [Ibnu Abbas] ia berkata; Pembunuh tidak dapat mewarisi."
            },
            {
                "number": 2581,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ قَالَ إِذَا اجْتَمَعَ نَسَبَانِ وُرِّثَ بِأَكْبَرِهِمَا يَعْنِي الْمَجُوسَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Abdul A'la] dari [Ma'mar] dari [Az Zuhri] ia berkata; Jika dua nasab bergabung maka yang mewarisi adalah nasab yang lebih tua, yakni Majusi."
            },
            {
                "number": 2582,
                "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حَمَّادِ بْنِ أَبِي سُلَيْمَانَ قَالَ يَرِثُ مِنْ الْجَانِبِ الَّذِي يَصْلُحُ وَلَا يَرِثُ مِنْ الْجَانِبِ الَّذِي لَا يَصْلُحُ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin [Muhammad bin Al Minhal]] telah menceritakan kepada kami [Hammad bin Salamah] dari [Hammad bin Abu Sulaiman] ia berkata; Ia mewarisi dari pihak yang pantas dan tidak mewarisi dari pihak yang tidak pantas."
            },
            {
                "number": 2583,
                "arab": " حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا حَمَّادٌ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ رَجُلٍ عَنْ الشَّعْبِيِّ أَنَّ عَلِيًّا وَابْنَ مَسْعُودٍ قَالَا فِي الْمَجُوسِ إِذَا أَسْلَمُوا يَرِثُونَ مِنْ الْقَرَابَتَيْنِ جَمِيعًا",
                "id": "Telah menceritakan kepada kami [Hajjaj] telah menceritakan kepada kami [Hammad] dari [Sufyan Ats Tsauri] dari [seseorang] dari [Asy Sya'bi] bahwa [Ali] dan [Ibnu Mas'ud] keduanya berkata tentang orang Majusi yang masuk Islam; Mereka berhak mewarisi dari dua kerabat semuanya."
            },
            {
                "number": 2584,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ فِي امْرَأَةِ الْأَسِيرِ أَنَّهَا تَرِثُهُ وَيَرِثُهَا",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Ibnu Abu Az Zinad] dari [ayahnya] dari [Umar bin Abdul Aziz] tentang seorang perempuan yang ditawan; Sesungguhnya ia dapat mewarisi suaminya dan suaminya dapat mewarisinya."
            },
            {
                "number": 2585,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ حَدَّثَنِي مَعْمَرٌ عَنْ إِسْحَقَ بْنِ رَاشِدٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ فِي الْأَسِيرِ يُوصِي قَالَ أَجِزْ لَهُ وَصِيَّتَهُ مَا دَامَ عَلَى دِينِهِ لَمْ يَتَغَيَّرْ عَنْ دِينِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Fadlal] telah menceritakan kepada kami [Abdullah bin Al Mubarak] telah menceritakan kepadaku [Ma'mar] dari [Ishaq bin Rasyid] dari [Umar bin Abdul Aziz] tentang tawanan yang berwasiat, ia berkata; Aku membolehkan wasiatnya selama ia masih memeluk agamanya dan tidak berubah dari agamanya tersebut."
            },
            {
                "number": 2586,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ عَنْ شُرَيْحٍ قَالَ يُوَرَّثُ الْأَسِيرُ إِذَا كَانَ فِي أَيْدِي الْعَدُوِّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Dawud] dari [Asy Sya'bi] dari [Syuraih] ia berkata; Orang yang ditawan berhak mewarisi sekalipun ia berada di tangan musuh."
            },
            {
                "number": 2587,
                "arab": " حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا سُفْيَانُ حَدَّثَنِي مَنْ سَمِعَ إِبْرَاهِيمَ يَقُولُ يُوَرَّثُ الْأَسِيرُ",
                "id": "Telah menceritakan kepada kami [Muhammad] ia berkata; Telah menceritakan kepada kami [Sufyan] telah menceritakan kepadaku [orang yang mendengar] [Ibrahim] ia berkata; Orang yang ditawan berhak mewarisi."
            },
            {
                "number": 2588,
                "arab": " حَدَّثَنَا الْمُعَلَّى بْنُ أَسَدٍ حَدَّثَنَا وُهَيْبٌ عَنْ دَاوُدَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ كَانَ لَا يُوَرِّثُ الْأَسِيرَ",
                "id": "Telah menceritakan kepada kami [Al Mu'alla bin Asad] telah menceritakan kepada kami [Wuhaib] dari [Dawud] dari [Sa'id bin Al Musayyab] bahwa ia tidak memberikan hak waris kepada orang yang ditawan."
            },
            {
                "number": 2589,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا الْأَشْعَثُ عَنْ الشَّعْبِيِّ قَالَ كَتَبَ عُمَرُ بْنُ الْخَطَّابِ إِلَى شُرَيْحٍ أَنْ لَا يُوَرِّثَ الْحَمِيلَ إِلَّا بِبَيِّنَةٍ وَإِنْ جَاءَتْ بِهِ فِي خِرَقِهَا",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Al Asy'ats] dari [Asy Sya'bi] ia berkata; [Umar bin Al Khaththab] menulis surat kepada Syuraih, agar ia tidak memberikan hak waris kepada orang yang di bawa ke negeri Islam saat masih kecil kecuali ada bukti sekali pun ia datang dengan membawa kain-kain yang digunakannya saat masih kecil."
            },
            {
                "number": 2590,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ قَالَ وَرِّثْ الْحَمِيلَ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah] dari [Isra`il] dari [Manshur] dari [Ibrahim] ia berkata; Warisilah harta orang yang dibawa ke negeri Islam saat masih kecil."
            },
            {
                "number": 2591,
                "arab": " حَدَّثَنَا أَبُو سَعِيدٍ مِنْ بَنِي أُمَيَّةَ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي مَرْيَمَ عَنْ ضَمْرَةَ وَالْفُضَيْلِ بْنِ فَضَالَةَ وَابْنِ أَبِي عَوْفٍ وَرَاشِدٍ وَعَطِيَّةَ قَالُوا لَا يُوَرَّثُ الْحُمَلَاءُ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id] dari bani Umayah dari [Abu Bakr bin Abdullah bin Abu Maryam] dari [Dlamrah], [Al Fudlail bin Fadlalah], [Ibnu Abu 'Auf], [Rasyid] dan ['Athiyah], mereka berkata; Warisan orang-orang yang dibawa ke negeri Islam saat masih kecil tidak dapat diwarisi."
            },
            {
                "number": 2592,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ قَالَ قَالَ ابْنُ الْمُبَارَكِ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ مُحَمَّدٍ قَالَ ذُكِرَ عِنْدَهُ قَوْلُ مَنْ يَقُولُ فِي الْحَمِيلِ فَأَنْكَرَ ذَلِكَ وَقَالَ قَدْ تَوَارَثَ الْمُهَاجِرُونَ وَالْأَنْصَارُ بِنَسَبِهِمْ الَّذِي كَانَ فِي الْجَاهِلِيَّةِ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Al Mughirah] ia berkata; [Ibnu Al Mubarak] berkata; Telah menceritakan kepada kami [Ibnu 'Aun] dari [Muhammad] ia berkata; Disebutkan kepadanya ucapan orang yang berkata tentang orang yang dibawa ke negeri Islam saat masih kecil. Maka ia pun mengingkari hal itu dan berkata; Orang-orang Muhajirin dan Anshar saling mewarisi karena nasab keturunan mereka yang lahir pada masa jahiliyah."
            },
            {
                "number": 2593,
                "arab": " حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ عَنْ ابْنِ إِدْرِيسَ عَنْ هِشَامٍ عَنْ الْحَسَنِ وَابْنِ سِيرِينَ قَالَا لَا يُوَرَّثُ الْحَمِيلُ إِلَّا بِبَيِّنَةٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dari [Ibnu Idris] dari [Hisyam] dari [Al Hasan] dan [Ibnu Sirin] keduanya berkata; Warisan orang yang dibawa ke negeri Islam saat masih kecil tidak dapat diwarisi kecuali jika ada bukti."
            },
            {
                "number": 2594,
                "arab": " حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا جَرِيرٌ عَنْ لَيْثٍ عَنْ حَمَّادٍ عَنْ إِبْرَاهِيمَ قَالَ لَمْ يَكُنْ أَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ يُوَرِّثُونَ الْحَمِيلَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr] telah menceritakan kepada kami [Jarir] dari [Laits] dari [Hammad] dari [Ibrahim] ia berkata; Abu Bakr, Umar dan Utsman tidak memberikan hak waris kepada orang yang dibawa ke negeri Islam saat masih kecil."
            },
            {
                "number": 2595,
                "arab": " حَدَّثَنَا أَبُو بَكْرٍ حَدَّثَنَا عَبْدُ الرَّحِيمِ الْمُحَارِبِيُّ عَنْ زَائِدَةَ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ قَالَ أَقَرَّتْ امْرَأَةٌ مِنْ مُحَارِبٍ جَلِيبَةٌ بِنَسَبٍ لَهَا جَلِيبٍ فَوَرَّثَهُ عَبْدُ اللَّهِ بْنُ عُتْبَةَ مِنْ أُخْتِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr] telah menceritakan kepada kami [Abdurrahim Al Muharibi] dari [Za`idah] dari [Asy'ats bin Abu Asy Sya'tsa`] ia berkata; Seorang perempuan dari Muharib yang dibawa paksa ke suatu negeri mengaku senasab dengan seseorang yang juga dibawa paksa ke negeri tersebut. Maka [Abdullah bin Utbah] memberikan hak waris kepada laki-laki tersebut dari warisan saudara perempuannya."
            },
            {
                "number": 2596,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ رَجُلٍ قَالَ عِنْدَ فِرَاقِ الدُّنْيَا أَنَا مَوْلَى فُلَانٍ قَالَ يَرِثُ مِيرَاثَهُ لِمَنْ سَمَّى أَنَّهُ مَوْلَاهُ عِنْدَ فِرَاقِ الدُّنْيَا إِلَّا أَنْ يَأْتُوا عَلَيْهِ بِبَيِّنَةٍ بِغَيْرِ ذَلِكَ يَرُدُّونَ بِهِ قَوْلَهُ فَيُرَدُّ مِيرَاثُهُ إِلَى مَا قَامَتْ بِهِ الْبَيِّنَةُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] tentang seseorang yang berkata ketika hendak meninggal dunia; Aku mantan budak fulan. Ia berkata; Warisannya diwariskan kepada orang yang disebutkan bahwa ia adalah majikannya ketika hendak meninggal kecuali mereka menunjukkan bukti yang membantah hal itu. Maka warisan dikembalikan kepada yang terbukti benar."
            },
            {
                "number": 2597,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَرِيكٌ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ الشَّعْبِيِّ عَنْ عَلِيٍّ وَعَبْدِ اللَّهِ قَالَا وَلَدُ الزِّنَا بِمَنْزِلَةِ ابْنِ الْمُلَاعَنَةِ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syarik] dari [Muhammad bin Salim] dari [Asy Sya'bi] dari [Ali] dan [Abdullah] keduanya berkata; Warisan anak zina menempati kedudukan anak wanita yang terkena li'an."
            },
            {
                "number": 2598,
                "arab": " حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا رَوْحٌ عَنْ مُحَمَّدِ بْنِ أَبِي حَفْصَةَ عَنْ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ حُسَيْنٍ أَنَّهُ كَانَ لَا يُوَرِّثُ وَلَدَ الزِّنَا وَإِنْ ادَّعَاهُ الرَّجُلُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Rauh] dari [Muhammad bin Abu Hafshah] dari [Az Zuhri] dari [Ali bin Husain] bahwa ia tidak memberikan hak waris kepada anak zina sekalipun seseorang mengakuinya sebagai anak."
            },
            {
                "number": 2599,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي بَكْرُ بْنُ مُضَرَ عَنْ عَمْرٍو يَعْنِي ابْنَ الْحَارِثِ عَنْ بُكَيْرٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ قَالَ أَيُّمَا رَجُلٍ أَتَى إِلَى غُلَامٍ يَزْعُمُ أَنَّهُ ابْنٌ لَهُ وَأَنَّهُ زَنَى بِأُمِّهِ وَلَمْ يَدَّعِ ذَلِكَ الْغُلَامَ أَحَدٌ فَهُوَ يَرِثُهُ قَالَ بُكَيْرٌ وَسَأَلْتُ عُرْوَةَ عَنْ ذَلِكَ فَقَالَ مِثْلَ قَوْلِ سُلَيْمَانَ بْنِ يَسَارٍ وَقَالَ عُرْوَةُ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Bakr bin Mudlar] dari [Amru] yakni Ibnu Al Harits, dari [Bukair] dari [Sulaiman bin Yasar] ia berkata; Siapa pun orangnya yang mendatangi seorang anak lalu mengaku bahwa ia adalah anaknya dan mengaku bahwa ia telah berzina dengan ibunya, sementara tidak ada seorang pun yang mengaku anak tersebut sebagai anaknya, maka anak tersebut dapat mewarisinya. Bukair berkata; Aku pernah bertanya kepada [Urwah] tentang hal itu. Maka ia menjawab seperti perkataan Sulaiman bin Yasar. Urwah juga berkata; Telah sampai berita kepada kami bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Anak adalah milik pemilik kasur (istri) dan (balasan) lelaki yang berzina adalah batu (dirajam).\""
            },
            {
                "number": 2600,
                "arab": " حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ عَمْرٍو عَنْ الْحَسَنِ قَالَ ابْنُ الْمُلَاعَنَةِ مِثْلُ وَلَدِ الزِّنَا تَرِثُهُ أُمُّهُ وَوَرَثَتُهُ وَرَثَةُ أُمِّهِ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa] dari [Hafsh bin Ghiyats] dari [Amr] dari [Al Hasan] ia berkata; Anak seorang wanita yang terkena li'an sama dengan anak zina. Ibunya dapat mewarisinya dan ahli warisnya adalah ahli waris ibunya."
            },
            {
                "number": 2601,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ عَنْ ابْنِ الْمُبَارَكِ عَنْ مَعْمَرٍ أَوْ يُونُسَ عَنْ الزُّهْرِيِّ فِي أَوْلَادِ الزِّنَا قَالَ يَتَوَارَثُونَ مِنْ قِبَلِ الْأُمَّهَاتِ وَإِنْ وَلَدَتْ تَوْأَمًا فَمَاتَ وَرِثَ السُّدُسَ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Al Mughirah] dari [Ibnu Al Mubarak] dari [Ma'mar] atau [Yunus] dari [Az Zuhri] tentang anak-anak zina, ia berkata; Ahli waris dari jalur keturunan ibu dapat saling mewarisi, jika anak zina memperoleh anak lalu ia meninggal dunia maka anaknya mendapat harta warisan seperenam."
            },
            {
                "number": 2602,
                "arab": " حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ مُغِيرَةَ عَنْ شِبَاكٍ عَنْ إِبْرَاهِيمَ قَالَ لَا يَرِثُ وَلَدُ الزِّنَا لَا يَرِثُ مَنْ لَمْ يُقَمْ عَلَى أَبِيهِ الْحَدُّ أَوْ تُمْلَكُ أُمُّهُ بِنِكَاحٍ أَوْ شِرَاءٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] ia berkata; Telah menceritakan kepada kami [Husyaim] dari [Mughirah] dari [Syibak] dari [Ibrahim] ia berkata; Anak zina tidak dapat mewarisi, tidak dapat mewarisi orang yang ayahnya tidak dijatuhi hukuman atau memiliki ibunya dengan cara dinikahi atau dibeli."
            },
            {
                "number": 2603,
                "arab": " حَدَّثَنَا زَيْدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ رَاشِدٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنَّ لِكُلِّ مُسْتَلْحَقٍ اسْتُلْحِقَ بَعْدَ أَبِيهِ الَّذِي ادَّعَاهُ وَرَثَتُهُ بَعْدَهُ فَقَضَى إِنْ كَانَ مِنْ أَمَةٍ يَمْلِكُهَا يَوْمَ يَطَؤُهَا فَقَدْ لَحِقَ بِمَنْ اسْتَلْحَقَهُ وَلَيْسَ لَهُ مِمَّا قُسِمَ قَبْلَهُ مِنْ الْمِيرَاثِ شَيْءٌ وَمَا أَدْرَكَ مِنْ مِيرَاثٍ لَمْ يُقْسَمْ فَلَهُ نَصِيبُهُ وَلَا يَلْحَقُ إِذَا كَانَ الَّذِي يُدْعَى لَهُ أَنْكَرَهُ وَإِنْ كَانَ مِنْ أَمَةٍ لَا يَمْلِكُهَا أَوْ حُرَّةٍ عَاهَرَهَا فَإِنَّهُ لَا يَلْحَقُ وَلَا يَرِثُ وَإِنْ كَانَ الَّذِي يُدْعَى لَهُ هُوَ ادَّعَاهُ وَهُوَ وَلَدُ زِنَا لِأَهْلِ أُمِّهِ مَنْ كَانُوا حُرَّةً أَوْ أَمَةً",
                "id": "Telah menceritakan kepada kami [Zaid bin Yahya] dari [Muhammad bin Rasyid] dari [Sulaiman bin Musa] dari [Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam pernah memutuskan: \"Bahwa setiap orang yang menasabkan pada dirinya, maka ia dinisbatkan kepada ayahnya yang diakuinya dan ahli warisnya adalah setelahnya.\" Lalu beliau memutuskan: \"Jika ia berasal dari budak wanita yang dimiliki pada hari ia menggaulinya, maka ia mengikuti nasab orang yang diakui sebagai ayahnya dan sedikit pun ia tidak mendapat bagian harta warisan yang telah dibagikan sebelumnya. Sedangkan harta warisan yang belum dibagi, maka ia mendapat bagian darinya. Namun jika orang yang diakui sebagai ayahnya mengingkarinya maka ia tidak berhak mengikuti nasab kepadanya. dan jika ia berasal dari seorang budak yang bukan miliknya atau wanita merdeka yang dizinai maka ia tidak mengikuti nasab dan mendapat warisan. Meskipun orang yang diakui sebagai ayah itu mengakuinya. Ia tetap berstatus anak zina yang mengikuti keluarga ibunya, baik wanita merdeka maupun budak.\""
            },
            {
                "number": 2604,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ عَنْ الْحَسَنِ عَنْ عُمَيْرِ بْنِ يَزِيدَ قَالَ سَأَلْتُ الشَّعْبِيَّ عَنْ مَمْلُوكٍ لِي وَلَدُ زِنًا قَالَ لَا تَبِعْهُ وَلَا تَأْكُلْ ثَمَنَهُ وَاسْتَخْدِمْهُ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] dari [Al Hasan] dari [Umair bin Yazid] ia berkata; Aku pernah bertanya kepada [Asy Sya'bi] tentang budakku yang terlahir dari hasil perzinaan. Ia menjawab; Jangan engkau jual dirinya dan makan uang hasil penjualannya tetapi perbantukanlah ia."
            },
            {
                "number": 2605,
                "arab": " حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ عَنْ سَعِيدٍ عَنْ الزُّهْرِيِّ سُئِلَ عَنْ وَلَدِ زِنَا يَمُوتُ قَالَ إِنْ كَانَ ابْنَ عَرَبِيَّةٍ وَرِثَتْ أُمُّهُ الثُّلُثَ وَجُعِلَ بَقِيَّةُ مَالِهِ فِي بَيْتِ الْمَالِ وَإِنْ كَانَ ابْنَ مَوْلَاةٍ وَرِثَتْ أُمُّهُ الثُّلُثَ وَوَرِثَ مَوَالِيهَا الَّذِينَ أَعْتَقُوهَا مَا بَقِيَ قَالَ مَرْوَانُ سَمِعْتُ مَالِكًا يَقُولُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Marwan bin Muhammad] dari [Sa'id] dari [Az Zuhri] ia ditanya tentang anak zina yang meninggal, ia menjawab; Jika ia adalah anak Arab maka ibunya mendapat sepertiga harta warisan, sedangkan sisanya diserahkan ke Baitul Mal. Jika ia adalah anak budak maka ibunya mendapat sepertiga harta warisan, sedangkan sisa harta tersebut diberikan kepada majikannya yang telah memerdekakan ibunya. Marwan berkata; Aku telah mendengar [Malik] berpendapat seperti itu."
            },
            {
                "number": 2606,
                "arab": " حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبَانَ عَنْ مُوسَى بْنِ مُحَمَّدٍ الْأَنْصَارِيِّ قَالَ حَدَّثَنِي الْحَارِثُ بْنُ حَصِيرَةَ عَنْ زَيْدِ بْنِ وَهْبٍ عَنْ عَلِيٍّ أَنَّهُ قَالَ فِي وَلَدِ الزِّنَا لِأَوْلِيَاءِ أُمِّهِ خُذُوا ابْنَكُمْ تَرِثُونَهُ وَتَعْقِلُونَهُ وَلَا يَرِثُكُمْ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Aban] dari [Musa bin Muhammad Al Anshari] ia berkata; Telah menceritakan kepadaku [Al Harits bin Hashirah] dari [Zaid bin Wahb] dari [Ali] bahwa ia pernah berkata tentang warisan anak zina kepada wali-wali ibunya; Ambillah anak kalian. Kalian memperoleh warisannya dan membayar diyatnya tetapi ia tidak memperoleh warisan dari kalian."
            },
            {
                "number": 2607,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ وَعَبْدُ اللَّهِ بْنُ يَزِيدَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ قَالَ قَالَ عَبْدُ اللَّهِ السَّائِبَةُ يَضَعُ مَالَهُ حَيْثُ شَاءَ قَالَ عَبْدُ اللَّهِ بْنُ يَزِيدَ قَالَ شُعْبَةُ لَمْ يَسْمَعْ هَذَا مِنْ سَلَمَةَ أَحَدٌ غَيْرِي",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] dan [Abdullah bin Zaid] keduanya berkata; Telah menceritakan kepada kami [Syu'bah] dari [Salamah bin Kuhail] dari [Abu Amr Asy Syaibani] ia berkata; [Abdullah] berkata; Budak Sa`ibah menyerahkan hartanya ke mana pun ia mau. Abdullah bin Yazid berkata; Syu'bah berkata; Belum ada satu orang pun yang mendengar hal ini dari Salamah selain diriku. "
            },
            {
                "number": 2608,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ حَدَّثَنَا حَاتِمُ بْنُ وَرْدَانَ عَنْ يُونُسَ عَنْ الْحَسَنِ سُئِلَ عَنْ مِيرَاثِ السَّائِبَةِ فَقَالَ كُلُّ عَتِيقٍ سَائِبَةٌ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah menceritakan kepada kami [Hatim bin Wardan] dari [Yunus] dari [Al Hasan] ketika ia ditanya tentang warisan Sa`ibah, ia pun menjawab; Semua budak yang dimerdekakan adalah sa`ibah. "
            },
            {
                "number": 2609,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا سُلَيْمَانُ عَنْ أَبِي عُثْمَانَ قَالَ قَالَ عُمَرُ الصَّدَقَةُ وَالسَّائِبَةُ لِيَوْمِهِمَا",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Sulaiman] dari [Abu Utsman] ia berkata; [Umar] berkata; Sedekah dan sa`ibah diberikan pada harinya."
            },
            {
                "number": 2610,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زَكَرِيَّا عَنْ عَامِرٍ قَالَ سُئِلَ عَامِرٌ عَنْ الْمَمْلُوكِ يُعْتَقُ سَائِبَةً لِمَنْ وَلَاؤُهُ قَالَ لِلَّذِي أَعْتَقَهُ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zakariya] dari [Amir] ia berkata; Ketika Amir ditanya tentang budak yang dimerdekakan dengan status Sa`ibah, kepada siapakah perwaliannya? Ia menjawab; Untuk orang yang memerdekakannya."
            },
            {
                "number": 2611,
                "arab": " حَدَّثَنَا أَبُو حَاتِمٍ الْبَصْرِيُّ هُوَ رَوْحُ بْنُ أَسْلَمَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَقَ عَنْ أَبِيهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرٍو قَالَ مَاتَ مَوْلًى عَلَى عَهْدِ عُثْمَانَ وَلَيْسَ لَهُ وَالٍ فَأَمَرَ بِمَالِهِ فَأُدْخِلَ بَيْتَ الْمَالِ",
                "id": "Telah menceritakan kepada kami [Abu Hatim Al Bashri] ia adalah Rauh bin Aslam, telah menceritakan kepada kami [Bisyr bin Al Mufadldlal] telah menceritakan kepada kami [Abdurrahman bin Ishaq] dari [ayahnya] dari [Abdurrahman bin Amr] ia berkata; Pada masa pemerintahan [Utsman] ada seorang budak yang tidak memiliki wali meninggal dunia, lalu ia memerintahkan untuk mengambil hartanya dan diserahkan ke Baitul Mal."
            },
            {
                "number": 2612,
                "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا إِسْمَعِيلُ عَنْ عَامِرٍ عَنْ مَسْرُوقٍ فِي رَجُلٍ مَاتَ وَلَمْ يَكُنْ لَهُ مَوْلَى عَتَاقَةٍ قَالَ مَالُهُ حَيْثُ أَوْصَى بِهِ فَإِنْ لَمْ يَكُنْ أَوْصَى فَهُوَ فِي بَيْتِ الْمَالِ",
                "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Isma'il] dari [Amir] dari [Masruq] tentang seseorang yang meninggal dunia namun tidak memiliki majikan yang memerdekakan, ia menjawab; Hartanya tergantung dengan wasiatnya, jika ia tidak berwasiat maka harta itu diserahkan ke Baitul Mal."
            },
            {
                "number": 2613,
                "arab": " حَدَّثَنَا أَبُو سَعِيدِ بْنُ عَمْرٍو عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ عَنْ ضَمْرَةَ وَرَاشِدِ بْنِ سَعْدٍ وَغَيْرِهِمَا قَالُوا فِيمَنْ أُعْتِقَ سَائِبَةً إِنَّ وَلَاءَهُ لِمَنْ أَعْتَقَهُ إِنَّمَا سَيَّبَهُ مِنْ الرِّقِّ وَلَمْ يُسَيِّبْهُ مِنْ الْوَلَاءِ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id bin Amr] dari [Abu Abu Bakr bin Abu Maryam] dari [Dlamrah], [Rasyid bin Sa'd] dan selain keduanya, mereka berkata tentang budak yang dimerdekakan dengan status sa`ibah; Sesungguhnya hak perwaliannya diberikan kepada orang yang memerdekakannya. Karena sesungguhnya ia hanya dibebaskan dari perbudakan namun tidak dibebaskan dari hak perwalian."
            },
            {
                "number": 2614,
                "arab": " حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو دَاوُدَ عَنْ شُعْبَةَ قَالَ أَخْبَرَنِي مَنْصُورٌ عَنْ إِبْرَاهِيمَ وَالشَّعْبِيِّ قَالَا لَا بَأْسَ بِبَيْعِ وَلَاءِ السَّائِبَةِ وَهِبَتِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abu Dawud] dari [Syu'bah] ia berkata; Telah mengabarkan kepadaku [Manshur] dari [Ibrahim] dan [Asy Sya'bi] keduanya berkata; Tidak apa-apa untuk menjual perwalian budak sa`ibah dan pemberiannya."
            },
            {
                "number": 2615,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ الْقَاسِمِ قَالَ أَعْتَقَ رَجُلٌ غُلَامًا سَائِبَةً فَأَتَى عَبْدَ اللَّهِ وَقَالَ إِنِّي أَعْتَقْتُ غُلَامًا لِي سَائِبَةً وَهَذِهِ تَرِكَتُهُ قَالَ هِيَ لَكَ قَالَ لَا حَاجَةَ لِي فِيهَا قَالَ فَضَعْهَا فَإِنَّ هَا هُنَا وَارِثًا كَثِيرًا",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Al Mas'udi] dari [Al Qasim] ia berkata; Ada seseorang yang memerdekakan seorang anak dengan status Sa`ibah, lalu ia mendatangi [Abdullah] dan berkata; Sesungguhnya aku telah memerdekakan seorang anak milikku dengan status sa`ibah dan ini adalah harta yang ditinggalkannya. Ia berkata; Ia menjadi milikmu. Orang itu berkata lagi; Namun aku tidak membutuhkannya. Ia berkata; Kalau begitu biarkanlah ia, karena di sini masih banyak ahli warisnya."
            },
            {
                "number": 2616,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْأَشْعَثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ إِذَا اسْتَهَلَّ الصَّبِيُّ وُرِّثَ وَصُلِّيَ عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Al Asy'ats] dari [Abu Az Zubair] dari [Jabir bin Abdullah] ia berkata; Jika seorang terlahir dalam keadaan menangis, maka ia mendapat warisan dan disholati."
            },
            {
                "number": 2617,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَ إِذَا اسْتَهَلَّ الصَّبِيُّ وَرِثَ وَوُرِثَ وَصُلِّيَ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syarik] dari [Abu Ishaq] dari ['Atha`] dari [Ibnu Abbas] ia berkata; Jika seorang terlahir dalam keadaan menangis maka ia mewarisi, mewariskan dan disholati."
            },
            {
                "number": 2618,
                "arab": " حَدَّثَنَا مَالِكُ بْنُ إِسْمَعِيلَ حَدَّثَنَا إِسْرَائِيلُ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ لَيْسَ مِنْ مَوْلُودٍ إِلَّا يَسْتَهِلُّ وَاسْتِهْلَالُهُ يَعْصِرُ الشَّيْطَانُ بَطْنَهُ فَيَصِيحُ إِلَّا عِيسَى ابْنَ مَرْيَمَ",
                "id": "Telah menceritakan kepada kami [Malik bin Isma'il] telah menceritakan kepada kami [Isra`il] dari [Simak] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; Tidaklah seorang anak yang lahir kecuali dalam keadaan menangis, dan tangisannya itu karena setan menekan (mencubit) perutnya sehingga ia menangis dengan berteriak kecuali Isa bin Maryam."
            },
            {
                "number": 2619,
                "arab": " حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا يَحْيَى هُوَ ابْنُ حَمْزَةَ عَنْ زَيْدِ بْنِ وَاقِدٍ عَنْ مَكْحُولٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَرِثُ الْمَوْلُودُ حَتَّى يَسْتَهِلَّ صَارِخًا وَإِنْ وَقَعَ حَيًّا",
                "id": "Telah menceritakan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Yahya] ia adalah Ibnu Hamzah, dari [Zaid bin Waqid] dari [Makhul] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang anak yang lahir tidak mendapat warisan hingga ia menangis dengan berteriak (menjerit) dan jika ia lahir dalam keadaan hidup.\""
            },
            {
                "number": 2620,
                "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَ إِذَا اسْتَهَلَّ الْمَوْلُودُ صُلِّيَ عَلَيْهِ وَوُرِثَ",
                "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Muhammad bin Ishaq] dari ['Atha`] dari [Jabir] ia berkata; Jika seorang anak terlahir dalam keadaan menangis, maka ia berhak disholati dan mendapat warisan."
            },
            {
                "number": 2621,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ حَدَّثَنَا مَعْنٌ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ قَالَ أَرَى الْعُطَاسَ اسْتِهْلَالًا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad] telah menceritakan kepada kami [Ma'an] dari [Ibnu Abu Dzi`b] dari [Az Zuhri] ia berkata; Aku berpendapat bahwa bersin sebagai tanda anak terlahir dalam keadaan menangis."
            },
            {
                "number": 2622,
                "arab": " حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ لَا يُوَرَّثُ الْمَوْلُودُ حَتَّى يَسْتَهِلَّ وَلَا يُصَلَّى عَلَيْهِ حَتَّى يَسْتَهِلَّ فَإِذَا اسْتَهَلَّ صُلِّيَ عَلَيْهِ وَوُرِّثَ وَكُمِّلَتْ الدِّيَةُ",
                "id": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Mughirah] dari [Ibrahim] ia berkata; Anak yang terlahir tidak mendapat warisan hingga ia terlahir dalam keadaan menangis, tidak disholati hingga ia terlahir dalam keadaan menangis. Maka, jika ia terlahir dalam keadaan menangis, ia berhak disholati, mendapat warisan, dan diyatnya diberikan secara sempurna."
            },
            {
                "number": 2623,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ وَسَأَلْنَاهُ عَنْ السِّقْطِ فَقَالَ لَا يُصَلَّى عَلَيْهِ وَلَا يُصَلَّى عَلَى مَوْلُودٍ حَتَّى يَسْتَهِلَّ صَارِخًا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] dan kami juga bertanya kepadanya tentang anak yang lahir prematur (keguguran), ia menjawab; Anak itu tidak disholati, anak yang lahir tidak wajib disholati hingga ia menangis dengan berteriak."
            },
            {
                "number": 2624,
                "arab": " حَدَّثَنَا هَارُونُ بْنُ مُعَاوِيَةَ عَنْ أَبِي سُفْيَانَ عَنْ مَعْمَرٍ عَنْ قَتَادَةَ قَالَ إِذَا ابْتَاعَ الْمُكَاتَبَانِ أَحَدُهُمَا الْآخَرَ هَذَا هَذَا مِنْ سَيِّدِهِ وَهَذَا هَذَا مِنْ سَيِّدِهِ فَالْبَيْعُ لِلْأَوَّلِ وَيَقُولُ أَهْلُ الْمَدِينَةِ الْوَلَاءُ لِسَيِّدِ الْبَائِعِ وَيَقُولُونَ إِنَّمَا ابْتَاعَ هَذَا مَا عَلَى الْمُكَاتَبِ فَالْوَلَاءُ لِلسَّيِّدِ",
                "id": "Telah menceritakan kepada kami [Harun bin Mu'awiyah] dari [Abu Sufyan] dari [Ma'mar] dari [Qatadah] ia berkata; Jika dua orang budak mukatab saling membeli satu sama lain, budak ini membeli budak itu dari tuannya dan budak itu membeli budak ini dari tuannya maka jual beli adalah yang pertama. Penduduk Madinah berkata; Wala` tetap untuk majikan yang menjual. Mereka berkata; Sesungguhnya budak ini membeli apa yang wajib dilunasi oleh mukatab. Oleh karena itu wala` tetap untuk majikan. "
            },
            {
                "number": 2625,
                "arab": " حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا يَحْيَى عَنْ سَعِيدٍ أَنَّ عُمَرَ قَالَ أَيُّمَا حُرٍّ تَزَوَّجَ أَمَةً فَقَدْ أَرَقَّ نِصْفَهُ وَأَيُّمَا عَبْدٍ تَزَوَّجَ حُرَّةً فَقَدْ أَعْتَقَ نِصْفَهُ قَالَ أَبُو مُحَمَّد يَعْنِي الْوَلَدَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Yahya] dari [Sa'id] bahwa [Umar] berkata; Laki-laki merdeka manapun yang menikahi budak perempuan maka ia telah memerdekakannya setengah. Dan budak manapun yang menikahi perempuan merdeka maka ia telah memerdekakannya setengah. Abu Muhammad berkata; Yakni pada status anaknya."
            },
            {
                "number": 2626,
                "arab": " حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ عَنْ الشَّيْبَانِيِّ عَنْ الشَّعْبِيِّ فِي الْعَبْدِ يَتَزَوَّجُ الْمَرْأَةَ ثُمَّ يُطَلِّقُهَا وَلَهُ مِنْهَا وَلَدٌ قَالَ إِنْ كَانَتْ حُرَّةً فَالنَّفَقَةُ عَلَى أُمِّهِ وَإِنْ كَانَ عَبْدًا يَعْنِي الصَّبِيَّ فَعَلَى مُوَالِيهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] dari [Asy Syaibani] dari [Asy Sya'bi] tentang seorang budak yang menikahi seorang perempuan kemudian menceraikannya sedangkan ia melahirkan anak untuknya. Ia berkata; Jika anak itu perempuan merdeka maka nafkah atas ibunya, dan jika anak itu seorang budak maksudnya budak kecil maka nafkah atas para majikannya."
            },
            {
                "number": 2627,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا زَكَرِيَّا عَنْ عَامِرٍ ح و حَدَّثَنَا جَرِيرٌ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ أَنَّهُمَا قَالَا وَلَاؤُهُ لِمَنْ بَدَأَ بِالْعِتْقِ أَوَّلَ مَرَّةٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Husyaim] telah menceritakan kepada kami [Zakariya] dari [Amir], dalam riwayat hadits lain; Telah menceritakan kepada kami [Jarir] dari [Mughirah] dari [Ibrahim] bahwa mereka berdua berkata; Wala`nya jatuh pada orang yang pertama kali memerdekakan."
            },
            {
                "number": 2628,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يُونُسُ عَنْ الْحَسَنِ ح و حَدَّثَنَا جَرِيرٌ عَنْ أَبَانَ بْنِ تَغْلِبَ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ أَنَّهُمَا قَالَا إِنْ ضَمِنَ كَانَ الْوَلَاءُ لَهُ وَإِنْ اسْتَسْعَى الْعَبْدُ كَانَ الْوَلَاءُ بَيْنَهُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Yunus] dari [Al Hasan], dalam riwayat hadits lain; Telah menceritakan kepada kami [Jarir] dari [Aban bin Taghlib] dari [Al Hakam] dari [Ibrahim] bahwa mereka berdua berkata; Jika ia menjamin maka wala` untuknya, dan jika ia mempekerjakan budak itu maka wala` dibagi di antara mereka."
            },
            {
                "number": 2629,
                "arab": " حَدَّثَنَا يَعْلَى وَأَبُو نُعَيْمٍ قَالَا حَدَّثَنَا زَكَرِيَّا عَنْ عَامِرٍ فِي عَبْدٍ بَيْنَ رَجُلَيْنِ أَعْتَقَ أَحَدُهُمَا نَصِيبَهُ قَالَ يُتَمَّمُ عِتْقُهُ فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ اسْتُسْعِيَ الْعَبْدُ فِي النِّصْفِ بِقِيمَةِ عَدْلٍ وَالْوَلَاءُ لِمَنْ أَعْتَقَ",
                "id": "Telah menceritakan kepada kami [Ya'la] dan [Abu Nu'aim] keduanya berkata; Telah menceritakan kepada kami [Zakariya] dari [Amir] tentang seorang budak yang dimiliki dua orang di mana salah satunya memerdekakan bagiannya, ia berkata; Ia harus menyempurnakan kemerdekaannya. Jika ia tidak memiliki harta maka budak itu harus berusaha untuk menyempurnakan setengahnya dengan nilai (harga) yang adil. Sedangkan wala` untuk orang yang memerdekakan."
            },
            {
                "number": 2630,
                "arab": " حَدَّثَنَا هَارُونُ بْنُ مُعَاوِيَةَ عَنْ أَبِي سُفْيَانَ الْمَعْمَرِيِّ عَنْ مَعْمَرٍ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ فِي عَبْدٍ بَيْنَ رَجُلَيْنِ أَعْتَقَ أَحَدَهُمَا نَصِيبَهُ وَأَمْسَكَهُ الْآخَرُ قَالَ مِيرَاثُهُ بَيْنَهُمَا",
                "id": "Telah menceritakan kepada kami [Harun bin Mu'awiyah] dari [Abu Sufyan Al Ma'mari] dari [Ma'mar] dari [Ibnu Thawus] dari [ayahnya] tentang seorang budak yang dimliki oleh dua orang, lalu salah satunya memerdekakan bagiannya dan yang lain tidak, ia berkata; Warisan budak itu dibagi untuk mereka berdua."
            },
            {
                "number": 2631,
                "arab": " حَدَّثَنَا هَارُونُ عَنْ أَبِي سُفْيَانَ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ قَالَ مِيرَاثُهُ لِلَّذِي أَمْسَكَهُ و قَالَ قَتَادَةُ هُوَ لِلْمُعْتِقِ كُلُّهُ وَثَمَنُهُ عَلَيْهِ وَيَقُولُهُ أَهْلُ الْكُوفَةِ",
                "id": "Telah menceritakan kepada kami [Harun] dari [Abu Sufyan] dari [Ma'mar] dari [Az Zuhri] ia berkata; Warisannya untuk orang yang tidak memerdekakan. [Qatadah] berkata; Seluruh warisan untuk orang yang memerdekakan dan biaya untuk memerdekakannya. Demikian pula yang dikatakan oleh penduduk Kufah."
            },
            {
                "number": 2632,
                "arab": " حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ فِي الرَّجُلِ يَمُوتُ وَيَتْرُكُ مُكَاتَبًا وَلَهُ بَنُونَ وَبَنَاتٌ أَيَكُونُ لِلنِّسَاءِ مِنْ الْوَلَاءِ شَيْءٌ قَالَ تَرِثُ النِّسَاءُ مِمَّا عَلَى ظَهْرِهِ مِنْ مُكَاتَبَتِهِ وَيَكُونُ الْوَلَاءُ لِلرِّجَالِ دُونَ النِّسَاءِ إِلَّا مَا كَاتَبْنَ أَوْ أَعْتَقْنَ",
                "id": "Telah menceritakan kepada kami [Ya'la bin Ubaid] telah menceritakan kepada kami [Abdul Malik] dari ['Atha`] tentang seseorang yang meninggal dunia dan meninggalkan seorang budak mukatab, ia juga memiliki beberapa anak laki-laki dan perempuan, adakah kaum perempuan mendapat wala`, ia menjawab; Kaum perempuan hanya dapat mewarisi apa yang wajib dilunasi budak dari syarat pemerdekaannya. Sementara wala' hanya untuk kaum laki-laki tidak untuk kaum perempuan, kecuali mereka yang memberikan janji pemerdekaan bersyarat atau mereka yang memerdekakan."
            },
            {
                "number": 2633,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا أَبُو سُفْيَانَ عَنْ مَعْمَرٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ تُوُفِّيَ رَجُلٌ وَتَرَكَ مُكَاتَبًا ثُمَّ مَاتَ الْمُكَاتَبُ وَتَرَكَ مَالًا فَجَعَلَ ابْنُ الْمُسَيَّبِ وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ مَا بَقِيَ مِنْ مُكَاتَبَتِهِ بَيْنَ بَنِي مَوْلَاهُ الرِّجَالُ وَالنِّسَاءُ عَلَى مِيرَاثِهِمْ وَمَا فَضَلَ مِنْ الْمَالِ بَعْدَ كِتَابَتِهِ فَلِلرِّجَالِ مِنْهُمْ مِنْ بَنِي مَوْلَاهُ دُونَ النِّسَاءِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Abu Sufyan] dari [Ma'mar] dari [Yahya bin Abu Katsir] ia berkata; Seorang laki-laki meninggal dunia dan meninggalkan seorang budak mukatab, kemudian budak mukatab itu meninggal dunia dan meninggalkan harta. Ibnu Al Musayyab dan Abu Salamah bin Abdurrahman memberikan apa yang tersisa dari syarat pemerdekaannya kepada anak-anak majikannya. Kaum laki-laki dan kaum perempuan berhak atas warisan tersebut, sedangkan apa yang tersisa dari harta setelah pelunasannya, diberikan kepada kaum laki-laki dari anak-anak majikannya dan tidak untuk kaum perempuan dari anak-anak majikannya."
            },
            {
                "number": 2634,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عُمَرَ وَعَلِيٍّ وَزَيْدٍ أَنَّهُمْ قَالُوا الْوَلَاءُ لِلْكُبْرِ وَلَا يَرِثُونَ النِّسَاءَ مِنْ الْوَلَاءِ إِلَّا مَا أَعْتَقْنَ أَوْ كَاتَبْنَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Abdus Salam bin Harb] dari [Al A'masy] dari [Ibrahim] dari [Umar], [Ali] dan [Zaid] bahwa mereka berkata; Wala` untuk yang lebih tua. Mereka tidak mewariskan wala` kepada kaum perempuan kecuali jika mereka memerdekakan atau memberi janji pemerdekaan."
            },
            {
                "number": 2635,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا مُعَاذٌ عَنْ أَشْعَثَ عَنْ الْحَسَنِ قَالَ لَا تَرِثُ النِّسَاءُ مِنْ الْوَلَاءِ إِلَّا مَا أَعْتَقْنَ أَوْ أَعْتَقَ مَنْ أَعْتَقْنَ إِلَّا الْمُلَاعَنَةُ فَإِنَّهَا تَرِثُ مَنْ أَعْتَقَ ابْنُهَا وَالَّذِي انْتَفَى مِنْهُ أَبُوهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Mu'adz] dari [Asy'ats] dari [Al Hasan] ia berkata; Kaum perempuan tidak dapat mewarisi wala` kecuali jika mereka yang memerdekakan atau ia memerdekakan siapa yang mereka merdekakan kecuali anak seorang wanita yang terkena li'an, maka perempuan itu dapat mewarisi orang yang memerdekakan anaknya dan orang yang tidak diakui oleh ayahnya."
            },
            {
                "number": 2636,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّهُ كَانَ يَرِثُ مَوَالِيَ عُمَرَ دُونَ بَنَاتِ عُمَرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Ibnu Wahb] dari [Yunus] dari [Az Zuhri] dari [Salim] dari [ayahnya] bahwa ia pernah memberikan warisan kepada para mantan budak Umar dan tidak diberikan kepada anak-anak perempuan Umar."
            },
            {
                "number": 2637,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ عَنْ خَالِدِ بْنِ عَبْدِ اللَّهِ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ فِي امْرَأَةٍ مَاتَتْ وَتَرَكَتْ بَنِيهَا فَوَرِثُوهَا مَالًا وَمَوَالِيَ ثُمَّ مَاتَ بَنُوهَا قَالَ يَرْجِعُ الْوَلَاءُ إِلَى عَصَبَةِ الْمَرْأَةِ",
                "id": "Telah mengabarkan kepada kami [Amr bin 'Aun] dari [Khalid bin Abdullah] dari [Khalid Al Hadza`] dari [Abu Qilabah] tentang seorang perempuan yang meninggal dunia dan meninggalkan beberapa anak laki-laki, maka mereka mewarisi hartanya dan para budak ibunya, kemudian anak-anaknya meninggal dunia. Ia berkata; Wala` kembali kepada ashabah perempuan tersebut."
            },
            {
                "number": 2638,
                "arab": " حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا يُونُسُ عَنْ الْحَسَنِ أَنَّهُ كَانَ يَقُولُ فِي امْرَأَةٍ مَاتَتْ وَتَرَكَتْ مَوْلًى قَالَ الْوَلَاءُ لِبَنِيهَا فَإِذَا مَاتُوا رَجَعَ إِلَى عَصَبَتِهَا",
                "id": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritaan kepada kami [Wuhaib] telah menceritakan kepada kami [Yunus] dari [Al Hasan] bahwa ia pernah berkata tentang seorang perempuan yang meninggal dunia dan meninggalkan mantan budaknya, ia berkata; Wala` untuk anak laki-lakinya, namun jika mereka meninggal dunia maka wala` kembali kepada ashabah perempuan tersebut."
            },
            {
                "number": 2639,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ أَخْبَرَنَا شُعْبَةُ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ لَيْسَ لِلنِّسَاءِ مِنْ الْوَلَاءِ شَيْءٌ إِلَّا مَا أَعْتَقَتْ هِيَ بِنَفْسِهَا",
                "id": "Telah menceritakan kepada kami [Sa'id bin Amir] telah mengabarkan kepada kami [Syu'bah] dari [Mughirah] dari [Ibrahim] ia berkata; Kaum perempuan tidak mendapatkan hak wala` sedikit pun kecuali yang dimerdekakannya sendiri."
            },
            {
                "number": 2640,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ قَالَ يُحْرِزُ الْوَلَاءَ مَنْ يُحْرِزُ الْمِيرَاثَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abu Usamah] dari [Hisyam] dari [ayahnya] ia berkata; Wala` berhak dimiliki orang yang mendapat hak waris."
            },
            {
                "number": 2641,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو خَالِدٍ حَدَّثَنَا يَحْيَى عَنْ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ أَنَّ امْرَأَةً مِنْ مُحَارِبٍ وَهَبَتْ وَلَاءَ عَبْدِهَا لِنَفْسِهِ فَأَعْتَقَتْهُ فَوَهَبَ وَلَاءَ نَفْسِهِ لِعَبْدِ الرَّحْمَنِ بْنِ عَمْرِو بْنِ حَزْمٍ وَمَاتَتْ فَخَاصَمَتْ الْمَوَالِي إِلَى عُثْمَانَ فَدَعَا عُثْمَانُ الْبَيِّنَةَ عَلَى مَا قَالَ قَالَ فَأَتَى الْبَيِّنَةُ فَقَالَ لَهُ عُثْمَانُ اذْهَبْ فَوَالِ مَنْ شِئْتَ قَالَ أَبُو بَكْرٍ فَوَالَى عَبْدَ الرَّحْمَنِ بْنَ عَمْرِو بْنِ حَزْمٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abu Khalid] telah menceritakan kepada kami [Yahya] dari [Abu Bakr bin Amr bin Hazm] bahwa seorang perempuan dari Muharib memberikan wala` budaknya kepada diri budak tersebut. Lalu perempuan itu memerdekakannya dan budak itu pun memberikan wala` dirinya kepada Abdurrahman bin Amr bin Hazm, sementara perempuan itu meninggal dunia. Para budak lain mengadukan masalah ini kepada Utsman. Maka Utsman meminta bukti atas apa yang ia katakan. (Abu Bakr) berkata; Lalu budak itu menghadirkan bukti. Maka [Utsman] berkata kepadanya; Pergilah dan berikan wala`mu kepada orang yang kamu kehendaki. Abu Bakr berkata; Maka ia menjadikan Abdurrahman bin Amr bin Hazm sebagai wala`nya."
            },
            {
                "number": 2642,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْوَلَاءِ وَعَنْ هِبَتِهِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Abdullah bin Dinar] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang menjual wala` dan menghibahkannya."
            },
            {
                "number": 2643,
                "arab": " حَدَّثَنَا مُسْلِمٌ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دِينَارٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْوَلَاءِ وَعَنْ هِبَتِهِ",
                "id": "Telah menceritakan kepada kami [Muslim] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Abdullah bin Dinar] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam melarang menjual wala` dan menghibahkannya."
            },
            {
                "number": 2644,
                "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ لَا يُبَاعُ الْوَلَاءُ وَلَا يُوهَبُ وَالْوَلَاءُ لِمَنْ أَعْتَقَ",
                "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Abdul Malik] dari ['Atha`] ia berkata; Aku mendengar [Ibnu Abbas] berkata; Wala` tidak boleh dijual dan tidak boleh juga dihibahkan, tetapi wala` itu diberikan kepada orang yang memerdekakan."
            },
            {
                "number": 2645,
                "arab": " حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ عَنْ سَعِيدٍ عَنْ أَبِي مَعْشَرٍ عَنْ إِبْرَاهِيمَ قَالَ قَالَ عَبْدُ اللَّهِ الْوَلَاءُ لُحْمَةٌ كَلُحْمَةِ النَّسَبِ لَا يُبَاعُ وَلَا يُوهَبُ",
                "id": "Telah menceritakan kepada kami [Ja'far bin 'Aun] dari [Sa'id] dari [Abu Ma'syar] dari [Ibrahim] ia berkata; [Abdullah] berkata; Wala` seperti satu keturunan, tidak boleh dijual atau dihibahkan."
            },
            {
                "number": 2646,
                "arab": " حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ الْحَسَنِ وَسَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُمَا كَرِهَا بَيْعَ الْوَلَاءِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] dari [Al Hasan] dan [Sa'ib bin Al Musayyab] bahwa keduanya memakruhkan menjual wala`."
            }
        ]
    }
}