{
    "status": true,
    "data": {
        "start": 1,
        "end": 147,
        "total": 147,
        "book": "darimi",
        "hadits": [
            {
                "number": 1,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَيُؤَاخَذُ الرَّجُلُ بِمَا عَمِلَ فِي الْجَاهِلِيَّةِ قَالَ مَنْ أَحْسَنَ فِي الْإِسْلَامِ لَمْ يُؤَاخَذْ بِمَا كَانَ عَمِلَ فِي الْجَاهِلِيَّةِ وَمَنْ أَسَاءَ فِي الْإِسْلَامِ أُخِذَ بِالْأَوَّلِ وَالْآخِرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Al A'masy] dari [Abu Wa`il] dari [Abdullah], ia berkata; Datang kepada Rasulullah shallallahu 'alaihi wasallam seorang laki-laki lalu berkata: Wahai Rasulullah apakah seseorang akan dihukum atas perbuatan jelek yang dilakukannya pada masa jahiliyah? Rasul pun menjawab: Barang siapa yang berkelakuan baik pada masa Islamnya, ia tidak dihukum atas perbuatan jeleknya dimasa jahiliyah, tetapi barang siapa yang berkelakuan tidak baik (jahat) pada masa Islamnya, dia dihukum (atas dosanya) baik yang lalu ataupun yang selanjutnya. "
            },
            {
                "number": 2,
                "arab": " أَخْبَرَنَا الْوَلِيدُ بْنُ النَّضْرِ الرَّمْلِيُّ عَنْ مَسَرَّةَ بْنِ مَعْبَدٍ مِنْ بَنِي الْحَارِثِ بْنِ أَبِي الْحَرَامِ مِنْ لَخْمٍ عَنْ الْوَضِينِ أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا أَهْلَ جَاهِلِيَّةٍ وَعِبَادَةِ أَوْثَانٍ فَكُنَّا نَقْتُلُ الْأَوْلَادَ وَكَانَتْ عِنْدِي ابْنَةٌ لِي فَلَمَّا أَجَابَتْ وَكَانَتْ مَسْرُورَةً بِدُعَائِي إِذَا دَعَوْتُهَا فَدَعَوْتُهَا يَوْمًا فَاتَّبَعَتْنِي فَمَرَرْتُ حَتَّى أَتَيْتُ بِئْرًا مِنْ أَهْلِي غَيْرَ بَعِيدٍ فَأَخَذْتُ بِيَدِهَا فَرَدَّيْتُ بِهَا فِي الْبِئْرِ وَكَانَ آخِرَ عَهْدِي بِهَا أَنْ تَقُولَ يَا أَبَتَاهُ يَا أَبَتَاهُ فَبَكَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى وَكَفَ دَمْعُ عَيْنَيْهِ فَقَالَ لَهُ رَجُلٌ مِنْ جُلَسَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْزَنْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ كُفَّ فَإِنَّهُ يَسْأَلُ عَمَّا أَهَمَّهُ ثُمَّ قَالَ لَهُ أَعِدْ عَلَيَّ حَدِيثَكَ فَأَعَادَهُ فَبَكَى حَتَّى وَكَفَ الدَّمْعُ مِنْ عَيْنَيْهِ عَلَى لِحْيَتِهِ ثُمَّ قَالَ لَهُ إِنَّ اللَّهَ قَدْ وَضَعَ عَنْ الْجَاهِلِيَّةِ مَا عَمِلُوا فَاسْتَأْنِفْ عَمَلَكَ",
                "id": "Telah mengabarkan kepada kami [Al Walid bin An Nadlr Ar Ramli] dari [Masarrah bin Ma'bad] -dari Bani Al Harits bin Abu Al Haram dari Lakhmin- dari [Al Wadliin] Bahwa seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam lalu berkata: Hai Rasulullah, kami dahulu adalah orang-orang jahiliyah penyembah berhala dan kami membunuh anak-anak kami, ketika itu kami mempunyai anak yang senang apabila saya memanggilnya. Suatu hari saya pun memanggilnya dan dia langsung menyahut dan mengikuti saya. Ketika saya sampai di sebuah sumur keluarga, saya langsung memegang tangannya dan saya ceburkan dia ke sumur, itulah akhir kebersamaan saya dengannya. Dia memanggil 'wahai ayahku, wahai ayahku. ' Rasulullah pun menangis sampai air matanya bercucuran. Lalu seseeorang yang duduk-duduk bersama Rasulullah shallallahu 'alaihi wasallam berkata kepada laki-laki tersebut: kamu telah membuat Rasulullah shallallahu 'alaihi wasallam sedih. Rasulullah shallallahu 'alaihi wasallam berkata kepada orang tersebut: biarkan dia karena dia bertanya tentang sesuatu yang penting yang dihadapinya, kemudian Rasul berkata kepada laki-laki tersebut: Ulangi lagi cerita kamu tadi, lalu dia pun mengulangi ceritanya dan Rasul menangis lagi sampai bercucuran air matanya, membasahi jenggotnya, lalu beliau bersabda: Allah subhanahu wata'ala telah menghapus dosa-dosa yang dilakukan pada masa jahiliyah oleh karena itu mulailah perbuatan kamu dengan lembaran baru yang bersih. "
            },
            {
                "number": 3,
                "arab": " أَخْبَرَنَا هَارُونُ بْنُ مُعَاوِيَةَ عَنْ إِبْرَاهِيمَ بْنِ سُلَيْمَانَ الْمُؤَدِّبِ عَنْ الْأَعْمَشِ عَنْ مُجَاهِدٍ قَالَ حَدَّثَنِي مَوْلَايَ أَنَّ أَهْلَهُ بَعَثُوا مَعَهُ بِقَدَحٍ فِيهِ زُبْدٌ وَلَبَنٌ إِلَى آلِهَتِهِمْ قَالَ فَمَنَعَنِي أَنْ آكُلَ الزُّبْدَ لِمَخَافَتِهَا قَالَ فَجَاءَ كَلْبٌ فَأَكَلَ الزُّبْدَ وَشَرِبَ اللَّبَنَ ثُمَّ بَالَ عَلَى الصَّنَمِ وَهُوَ إِسَافٌ وَنَائِلَةُ قَالَ هَارُونُ كَانَ الرَّجُلُ فِي الْجَاهِلِيَّةِ إِذَا سَافَرَ حَمَلَ مَعَهُ أَرْبَعَةَ أَحْجَارٍ ثَلَاثَةً لِقِدْرِهِ وَالرَّابِعَ يَعْبُدُهُ وَيُرَبِّي كَلْبَهُ وَيَقْتُلُ وَلَدَهُ",
                "id": "Telah mengabarkan kepada kami [Harun bin Mu`awiyah] dari [Ibrahim bin sulaiman Al Mu`addib] dari [Al A'masy] dari [Mujahid], [bekas budakku] menceritakan kepadaku; bahwa keluarganya menitip sebuah wadah yang berisi keju dan susu untuk dipersembahkan kepada tuhan-tuhan mereka, ia berkata; keluargaku melarangku makan keju karena takut kepada tuhan-tuhan tersebut; lalu datanglah seekor anjing, memakan keju dan meminum susu serta kencing di atas patung-patung tersebut yaitu patung Iqaf dan nailah. Harun berkata: pada masa jahiliyah dulu apabila seorang laki-laki hendak bepergian dia akan mengikusertakan empat buah batu, tiga diantaranya untuk menopang\/menegakan priuk (kuali\/bejana) dan yang keempatnya untuk ia sembah, untuk melatih anjingnya, serta untuk membunuh anaknya. "
            },
            {
                "number": 4,
                "arab": " حَدَّثَنَا مُجَاهِدُ بْنُ مُوسَى حَدَّثَنَا رَيْحَانُ هُوَ ابْنُ سَعِيدٍ السَّامِيُّ حَدَّثَنَا عَبَّادٌ هُوَ ابْنُ مَنْصُورٍ عَنْ أَبِي رَجَاءٍ قَالَ كُنَّا فِي الْجَاهِلِيَّةِ إِذَا أَصَبْنَا حَجَرًا حَسَنًا عَبَدْنَاهُ وَإِنْ لَمْ نُصِبْ حَجَرًا جَمَعْنَا كُثْبَةً مِنْ رَمْلٍ ثُمَّ جِئْنَا بِالنَّاقَةِ الصَّفِيِّ فَتَفَاجُّ عَلَيْهَا فَنَحْلُبُهَا عَلَى الْكُثْبَةِ حَتَّى نَرْوِيَهَا ثُمَّ نَعْبُدُ تِلْكَ الْكُثْبَةَ مَا أَقَمْنَا بِذَلِكَ الْمَكَانِ قَالَ أَبُو مُحَمَّد الصَّفِيُّ الْكَثِيرَةُ الْأَلْبَانِ",
                "id": "Telah menceritakan kepada kami [Mujahid bin Musa] telah menceritakan kepada kami [Raihan Ibnu Sa'id As Sami] telah menceritakan kepada kami ['Abbad Ibnu Manshur] dari [Abu Raja`], ia berkata: kami dulu pada masa jahiliyah apabila menemukan batu yang bagus, kami pun menyembahnya dan apabila tidak mendapatkan yang bagus, kami pun mengumpulkan pasir. Kemudian kami mendatangkan onta yang shafi, ketika onta tersebut sudah mengangkanginya kamipun memeras susunya untuk menyirami tumpukan pasir yang kami kumpulkan, kemudian kami menyembah tumpukan pasir tersebut selama kami tinggal di tempat tersebut. Abu Muhammad berkata: onta shafi adalah onta yang banyak susunya. "
            },
            {
                "number": 5,
                "arab": " أَخْبَرَنَا الْحَسَنُ بْنُ الرَّبِيعِ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ قَالَ قَالَ كَعْبٌ نَجِدُهُ مَكْتُوبًا مُحَمَّدٌ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا فَظٌّ وَلَا غَلِيظٌ وَلَا صَخَّابٌ بِالْأَسْوَاقِ وَلَا يَجْزِي بِالسَّيِّئَةِ السَّيِّئَةَ وَلَكِنْ يَعْفُو وَيَغْفِرُ وَأُمَّتُهُ الْحَمَّادُونَ يُكَبِّرُونَ اللَّهَ عَزَّ وَجَلَّ عَلَى كُلِّ نَجْدٍ وَيَحْمَدُونَهُ فِي كُلِّ مَنْزِلَةٍ وَيَتَأَزَّرُونَ عَلَى أَنْصَافِهِمْ وَيَتَوَضَّئُونَ عَلَى أَطْرَافِهِمْ مُنَادِيهِمْ يُنَادِي فِي جَوِّ السَّمَاءِ صَفُّهُمْ فِي الْقِتَالِ وَصَفُّهُمْ فِي الصَّلَاةِ سَوَاءٌ لَهُمْ بِاللَّيْلِ دَوِيٌّ كَدَوِيِّ النَّحْلِ وَمَوْلِدُهُ بِمَكَّةَ وَمُهَاجِرُهُ بِطَابَةَ وَمُلْكُهُ بِالشَّامِ",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin Ar Rabi'] telah menceritakan kepada kami [Abul Ahwash] dari [Al A'masy] dari [Abu Shalih], ia berkata; [Ka'ab] berkata; kami mendapatinya tertulis: Muhammad Rasulullah shallallahu 'alaihi wasallam, beliau tidak kasar tutur katanya, tidak keras wataknya, tidak bersuara keras ketika di pasar, tidak membalas kejelekan dengan kejelekan, tetapi membalasnya dengan memaafkan dan mengampuni, umatnya adalah orang-orang yang selalu bertahmid (memuji Allah) bertakbir (mengagungkan Allah) disetiap tempat yang tinggi \/pendakian, atau peperangan, mereka memuji Allah Subhanahu wa Ta'ala di tiap-tiap rumah, mengenakan sarung pada bagian tengah mereka, berwudlu pada setiap anggota wudlu mereka, panggilan adzan mereka terdengar di langit, shaf mereka pada waktu perang seperti shaf mereka pada waktu sholat, suara mereka (ketika membaca Al Quran dan berdzikir) bagaikan gemuruh suara lebah, tempat kelahiran beliau di Makkah dan tempat hijrahnya di thaabah (Madinah) dan kerajaannya berada di Syam. "
            },
            {
                "number": 6,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي خَالِدٌ هُوَ ابْنُ يَزِيدَ عَنْ سَعِيدٍ هُوَ ابْنُ أَبِي هِلَالٍ عَنْ هِلَالِ بْنِ أُسَامَةَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ ابْنِ سَلَامٍ أَنَّهُ كَانَ يَقُولُ إِنَّا لَنَجِدُ صِفَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّا أَرْسَلْنَاكَ شَاهِدًا وَمُبَشِّرًا وَنَذِيرًا وَحِرْزًا لِلْأُمِّيِّينَ أَنْتَ عَبْدِي وَرَسُولِي سَمَّيْتُهُ الْمُتَوَكِّلَ لَيْسَ بِفَظٍّ وَلَا غَلِيظٍ وَلَا صَخَّابٍ بِالْأَسْوَاقِ وَلَا يَجْزِي بِالسَّيِّئَةِ مِثْلَهَا وَلَكِنْ يَعْفُو وَيَتَجَاوَزُ وَلَنْ أَقْبِضَهُ حَتَّى نُقِيمَ الْمِلَّةَ الْمُتَعَوِّجَةَ بِأَنْ تَشْهَدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ يَفْتَحُ بِهِ أَعْيُنًا عُمْيًا وَآذَانًا صُمًّا وَقُلُوبًا غُلْفًا قَالَ عَطَاءُ بْنُ يَسَارٍ وَأَخْبَرَنِي أَبُو وَاقِدٍ اللَّيْثِيُّ أَنَّهُ سَمِعَ كَعْبًا يَقُولُ مِثْلَ مَا قَالَ ابْنُ سَلَامٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Khalid Ibnu Yazid] dari [Sa'id Ibnu Abu Hilal] dari [Hilal bin Usamah] dari ['Atha' bin Yasar] dari [Ibnu Salam], bahwa ia berkata; kami mendapati sifat Rasulullah shallallahu 'alaihi wasallam 'Sesungguhnya Kami mengutus kamu sebagai saksi, pemberi kabar gembira dan sebagai pemberi peringatan', yang menolong orang ummi, engkau adalah hambaKu RasulKu, Aku menamakannya Al Mutawakkil, tutur katanya tidak kasar dan perangainya tidak keras, tidak berteriak-teriak di pasar dan tidak membalas kejelekan dengan kejelekan, akan tetapi dengan memaafkannya sehingga kami meluruskan agama yang melenceng kepada persaksian bahwa tidak ada tuhan yang berhak disembah selain Allah Subhanahu wa Ta'ala, dengan persaksian tersebut kita dapat membuka mata yang buta, telinga-telinga yang pekak dan hati-hati yang tertutup. ['Atha` bin Yasar] berkata; [Abu waqid Al Laitsi] memberitahukan kepada saya bahwa ia mendengar [Ka'ab] juga berkata seperti apa yang dikatakan Ibnu salam. "
            },
            {
                "number": 7,
                "arab": " أَخْبَرَنَا زَيْدُ بْنُ عَوْفٍ قَالَ وَحَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ ذَكْوَانَ أَبِي صَالِحٍ عَنْ كَعْبٍ فِي السَّطْرِ الْأَوَّلِ مُحَمَّدٌ رَسُولُ اللَّهِ عَبْدِي الْمُخْتَارُ لَا فَظٌّ وَلَا غَلِيظٌ وَلَا صَخَّابٌ فِي الْأَسْوَاقِ وَلَا يَجْزِي بِالسَّيِّئَةِ السَّيِّئَةَ وَلَكِنْ يَعْفُو وَيَغْفِرُ مَوْلِدُهُ بِمَكَّةَ وَهِجْرَتُهُ بِطَيْبَةَ وَمُلْكُهُ بِالشَّامِ وَفِي السَّطْرِ الثَّانِي مُحَمَّدٌ رَسُولُ اللَّهِ أُمَّتُهُ الْحَمَّادُونَ يَحْمَدُونَ اللَّهَ فِي السَّرَّاءِ وَالضَّرَّاءِ يَحْمَدُونَ اللَّهَ فِي كُلِّ مَنْزِلَةٍ وَيُكَبِّرُونَ عَلَى كُلِّ شَرَفٍ رُعَاةُ الشَّمْسِ يُصَلُّونَ الصَّلَاةَ إِذَا جَاءَ وَقْتُهَا وَلَوْ كَانُوا عَلَى رَأْسِ كُنَاسَةٍ وَيَأْتَزِرُونَ عَلَى أَوْسَاطِهِمْ وَيُوَضِّئُونَ أَطْرَافَهُمْ وَأَصْوَاتُهُمْ بِاللَّيْلِ فِي جَوِّ السَّمَاءِ كَأَصْوَاتِ النَّحْلِ",
                "id": "Telah mengabarkan kepada kami [Zaid bin Yusuf] telah menceritakan kepada kami [Abu 'Awanah] dari [Abdul malik bin Umair] dari [Dzakwan Abu Shalih] dari [Ka'ab] bahwa pada alinea pertama tertulis; Muhammad adalah utusan Allah Subhanahu wa Ta'ala, dan hambaKu yang terpilih, tutur katanya tidak kasar, perangainya tidak keras, tidak bersuara lantang di pasar, tidak membalas kejelekan dengan kejelekan akan tetapi membalasnya dengan pemberian maaf dan ampunan, tempat kelahirannya di Makkah dan tempat hijrahnya di Thaibah serta kerajaannya\/kekuasaannya di Syam. Dan pada alenia kedua tertulis, Muhammad utusan Allah Subhanahu wa Ta'ala umatnya adalah orang-orang yang selalu memuji Allah atas segala kemuliaan, para pemantau matahari (untuk mengetahui waktu sholat) menunaikan sholat saat tiba waktunya, meskipun mereka di saat berada pada tempat yang kotor, mengenakan sarung pada bagian tengah, membasuh wudlu pada seluruh anggota wudlu, dan suara mereka di malam hari terdengar di udara bagaikan gemuruh suara lebah (karena kegigihan ibadah dan tangisnya). "
            },
            {
                "number": 8,
                "arab": " أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى حَدَّثَنَا مَعْنُ بْنُ عِيسَى حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ عَنْ أَبِي فَرْوَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ سَأَلَ كَعْبَ الْأَحْبَارِ كَيْفَ تَجِدُ نَعْتَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي التَّوْرَاةِ فَقَالَ كَعْبٌ نَجِدُهُ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ يُولَدُ بِمَكَّةَ وَيُهَاجِرُ إِلَى طَابَةَ وَيَكُونُ مُلْكُهُ بِالشَّامِ وَلَيْسَ بِفَحَّاشٍ وَلَا صَخَّابٍ فِي الْأَسْوَاقِ وَلَا يُكَافِئُ بِالسَّيِّئَةِ السَّيِّئَةَ وَلَكِنْ يَعْفُو وَيَغْفِرُ أُمَّتُهُ الْحَمَّادُونَ يَحْمَدُونَ اللَّهَ فِي كُلِّ سَرَّاءَ وَضَرَّاءَ وَيُكَبِّرُونَ اللَّهَ عَلَى كُلِّ نَجْدٍ يُوَضِّئُونَ أَطْرَافَهُمْ وَيَأْتَزِرُونَ فِي أَوْسَاطِهِمْ يُصَفُّونَ فِي صَلَوَاتِهِمْ كَمَا يُصَفُّونَ فِي قِتَالِهِمْ دَوِيُّهُمْ فِي مَسَاجِدِهِمْ كَدَوِيِّ النَّحْلِ يُسْمَعُ مُنَادِيهِمْ فِي جَوِّ السَّمَاءِ",
                "id": "Telah mengabarkan kepada kami [Mujahid biun Musa] telah menceritakan kepada kami [Ma'n ibnu 'Isa] telah menceritakan kepada kami [Mu'awiyah bin Shalih] dari [Abu Farwah] dari [Ibnu 'Abbas] Radliyallahu'anhu, bahwa ia bertanya kepada Ka'ab Al Ahbar; Bagaimana kamu dapati sifat Rasulullah shallallahu 'alaihi wasallam dalam kitab Taurat?, [Ka'ab] menjawab; kami dapati ia Muhammad bin Abdullah dilahirkan di Makkah, berhijrah ke Thaabah atau Madinah, kerajaannya akan ada di Syam, ia bukan orang keji, ia tidak bersuara keras di pasar, ia tidak membalas kejelekan dengan kejelekan tetapi memaafkan dan mengampuni, umatnya senantiasa memuji. Mereka memuji Allah Subhanahu wa Ta'ala baik dalam keadaan senang atau susah, mereka selalu mengagungkan Allah Subhanahu wa Ta'ala dalam setiap kemenangan, mereka membasuh anggota wudlu mereka, mengenakan kain sarung pada bagian tengah mereka, bereka berbaris dalam sholat seperti berbarisnya mereka dalam peperangan, suara mereka di masjid-masjid mereka seperti gemuruh suara lebah, terdengar suara mu`dzin mereka di angkasa. "
            },
            {
                "number": 9,
                "arab": " أَخْبَرَنَا حَيْوَةُ بْنُ شُرَيْحٍ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ الْمِيثَمِيُّ حَدَّثَنَا بَحِيرُ بْنُ سَعْدٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ الْحَضْرَمِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَقَدْ جَاءَكُمْ رَسُولٌ إِلَيْكُمْ لَيْسَ بِوَهِنٍ وَلَا كَسِلٍ لِيَخْتِنَ قُلُوبًا غُلْفًا وَيَفْتَحَ أَعْيُنًا عُمْيًا وَيُسْمِعَ آذَانًا صُمًّا وَيُقِيمَ أَلْسِنَةً عُوجًا حَتَّى يُقَالَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ",
                "id": "Telah mengabarkan kepada kami [Haiwah bin Syuraih] telah menceritakan kepada kami [Baqiyyah bin Al Walid Al Maitami] telah menceritakan kepada kami [Buhair bin Sa'ad] dari [Khalid bin Ma'dan] dari [Jubair bin Nufair Al Hadlrami]; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Telah datang kepada kalian seorang utusan yang tidak lemah dan juga tidak malas, (diutus untuk) menyadarkan hati-hati yang lalai, membuka mata yang tertutup, dan menjadikan telinga-telinga yang tuli mendengar, meluruskan lisan yang bengkok, sehingga dikatakan; tiada tuhan yang berhak disembah melainkan Allah Subhanahu wa Ta'ala saja. "
            },
            {
                "number": 10,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الْحِزَامِيُّ حَدَّثَنَا إِسْحَقُ بْنُ سُلَيْمَانَ عَنْ عَمْرِو بْنِ أَبِي قَيْسٍ عَنْ عَطَاءٍ قَالَ كَانَ رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهُ إِلَيْهِ حَاجَةٌ فَمَشَى مَعَهُ حَتَّى دَخَلَ قَالَ فَإِحْدَى رِجْلَيْهِ فِي الْبَيْتِ وَالْأُخْرَى خَارِجَهُ كَأَنَّهُ يُنَاجِي فَالْتَفَتَ فَقَالَ أَتَدْرِي مَنْ كُنْتُ أُكَلِّمُ إِنَّ هَذَا مَلَكٌ لَمْ أَرَهُ قَطُّ قَبْلَ يَوْمِي هَذَا اسْتَأْذَنَ رَبَّهُ أَنْ يُسَلِّمَ عَلَيَّ قَالَ إِنَّا آتَيْنَاكَ أَوْ أَنْزَلْنَا الْقُرْآنَ فَصْلًا وَالسَّكِينَةَ صَبْرًا وَالْفُرْقَانَ وَصْلًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yazid Al Hizami] telah menceritakan kepada kami [Ishaq bin Sulaiman] dari ['Amr bin Abu Qais] dari ['Atha`], ia berkata; Salah seorang sahabat Nabi shallallahu 'alaihi wasallam mempunyai keperluan dengan beliau. Ia berjalan bersama beliau, sampai ketika sudah memasuki rumah dan salah satu kaki beliau berada di dalam dan yang lainnya di luar rumah, seakan-akan Rasulullah shallallahu 'alaihi wasallam bercakap-cakap dengan seorang laki-laki, setelah itu beliau menoleh dan berbicara kepada sahabat tersebut: Tahukah anda siapa yang aku ajak bicara? dia adalah malaikat yang aku belum pernah melihatnya sebelum ini, malaikat tersebut meminta izin Rabbnya agar dapat mengucapkan salam kepadaku. Allah berfirman: \"Sesungguhnya kami mendatangimu atau menurunkan Al Qur'an sebagai pemutus perkara dan As Sakinah sebagai kesabaran dan Al Furqon sebagai pedoman. "
            },
            {
                "number": 11,
                "arab": " أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى حَدَّثَنَا رَيْحَانُ هُوَ ابْنُ سَعِيدٍ حَدَّثَنَا عَبَّادٌ هُوَ ابْنُ مَنْصُورٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ عَطِيَّةَ أَنَّهُ سَمِعَ رَبِيعَةَ الْجُرَشِيَّ يَقُولُ أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقِيلَ لَهُ لِتَنَمْ عَيْنُكَ وَلْتَسْمَعْ أُذُنُكَ وَلْيَعْقِلْ قَلْبُكَ قَالَ فَنَامَتْ عَيْنَايَ وَسَمِعَتْ أُذُنَايَ وَعَقَلَ قَلْبِي قَالَ فَقِيلَ لِي سَيِّدٌ بَنَى دَارًا فَصَنَعَ مَأْدُبَةً وَأَرْسَلَ دَاعِيًا فَمَنْ أَجَابَ الدَّاعِيَ دَخَلَ الدَّارَ وَأَكَلَ مِنْ الْمَأْدُبَةِ وَرَضِيَ عَنْهُ السَّيِّدُ وَمَنْ لَمْ يُجِبْ الدَّاعِيَ لَمْ يَدْخُلْ الدَّارَ وَلَمْ يَطْعَمْ مِنْ الْمَأْدُبَةِ وَسَخِطَ عَلَيْهِ السَّيِّدُ قَالَ فَاللَّهُ السَّيِّدُ وَمُحَمَّدٌ الدَّاعِي وَالدَّارُ الْإِسْلَامُ وَالْمَأْدُبَةُ الْجَنَّةُ",
                "id": "Telah mengabarkan kepada kami [Mujahid bin Musa] telah menceritakan kepada kami [Raihan Ibnu Sa'id] telah menceritakan kepada kami ['Abbad Ibnu Mansur] dari [Ayyub] dari [Abu Qilabah] dari ['Athiyah] bahwasanya ia mendengar [Rabi'ah Al Jurasyi] berkata; Nabi shallallahu 'alaihi wasallam didatangkan lalu dikatakan kepada beliau, silahkan mata baginda tidur, telinga baginda mendengar, dan hati baginda berpikir. Beliau berkata: maka mata saya melihat, telinga saya mendengar, dan hati saya berpikir. Ia berkata; saya memperoleh informasi \"Ada seorang Tuan yang membangun rumah, lalu menyediakan jamuan, kemudian ia mengutus seorang untuk mengundang ke jamuan, barang siapa yang menyambut seruan penyeru dan memasuki rumah lalu makan hidangan maka baginda tersebut akan ridla kepadanya. Sebaliknya barang siapa yang tidak menyambut seruan penyeru dan tidak masuk ke rumah serta tidak makan hidangan, maka Tuan akan marah kepadanya. Lalu ia berkata: Tuan tersebut adalah Allah Subhanahu Wa Ta'ala, penyerunya adalah Muhammad shallallahu 'alaihi wasallam, rumahnya adalah Islam, dan hidangannya adalah surga. "
            },
            {
                "number": 12,
                "arab": " أَخْبَرَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ جَعْفَرِ بْنِ مَيْمُونٍ التَّمِيمِيِّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ إِلَى الْبَطْحَاءِ وَمَعَهُ ابْنُ مَسْعُودٍ فَأَقْعَدَهُ وَخَطَّ عَلَيْهِ خَطًّا ثُمَّ قَالَ لَا تَبْرَحَنَّ فَإِنَّهُ سَيَنْتَهِي إِلَيْكَ رِجَالٌ فَلَا تُكَلِّمْهُمْ فَإِنَّهُمْ لَنْ يُكَلِّمُوكَ فَمَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَيْثُ أَرَادَ ثُمَّ جَعَلُوا يَنْتَهُونَ إِلَى الْخَطِّ لَا يُجَاوِزُونَهُ ثُمَّ يَصْدُرُونَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا كَانَ مِنْ آخِرِ اللَّيْلِ جَاءَ إِلَيَّ فَتَوَسَّدَ فَخِذِي وَكَانَ إِذَا نَامَ نَفَخَ فِي النَّوْمِ نَفْخًا فَبَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَوَسِّدٌ فَخِذِي رَاقِدٌ إِذْ أَتَانِي رِجَالٌ كَأَنَّهُمْ الْجِمَالُ عَلَيْهِمْ ثِيَابٌ بِيضٌ اللَّهُ أَعْلَمُ مَا بِهِمْ مِنْ الْجَمَالِ حَتَّى قَعَدَ طَائِفَةٌ مِنْهُمْ عِنْدَ رَأْسِهِ وَطَائِفَةٌ مِنْهُمْ عِنْدَ رِجْلَيْهِ فَقَالُوا بَيْنَهُمْ مَا رَأَيْنَا عَبْدًا أُوتِيَ مِثْلَ مَا أُوتِيَ هَذَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ عَيْنَيْهِ لَتَنَامَانِ وَإِنَّ قَلْبَهُ لَيَقْظَانُ اضْرِبُوا لَهُ مَثَلًا سَيِّدٌ بَنَى قَصْرًا ثُمَّ جَعَلَ مَأْدُبَةً فَدَعَا النَّاسَ إِلَى طَعَامِهِ وَشَرَابِهِ ثُمَّ ارْتَفَعُوا وَاسْتَيْقَظَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ ذَلِكَ فَقَالَ لِي أَتَدْرِي مَنْ هَؤُلَاءِ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ هُمْ الْمَلَائِكَةُ قَالَ وَهَلْ تَدْرِي مَا الْمَثَلُ الَّذِي ضَرَبُوهُ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ الرَّحْمَنُ بَنَى الْجَنَّةَ فَدَعَا إِلَيْهَا عِبَادَهُ فَمَنْ أَجَابَهُ دَخَلَ جَنَّتَهُ وَمَنْ لَمْ يُجِبْهُ عَاقَبَهُ وَعَذَّبَهُ",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin 'Ali] telah menceritakan kepada kami [Abu Usamah] dari [Ja'far bin Maimun At Tamimi] dari [Abu Utsman An Nahdi] Bahwa Rasulullah shallallahu 'alaihi wasallam keluar ke Bathha` dan bersamanya Ibnu Mas'ud Radliyallahu'anhu, lalu Rasulullah shallallahu 'alaihi wasallam pergi menuju Bathaa bersama ibnu Mas'ud, lalu beliau mengajak duduk Ibnu Mas'ud dan membuat satu garis pembatas untuknya. Lalu berkata: Jangan sekali-kali kamu tinggalkan tempat ini, karena beberapa orang laki-laki akan menemuimu yang kamu tidak berbicara kepada mereka, dan mereka pun tidak akan berbicara kepadamu. Lalu Rasulullah shallallahu 'alaihi wasallam meneruskan perjalanannya kemana saja beliau kehendaki. Kemudian sampailah orang-orang tersebut pada garis pembatas dan mereka tidak melewatinya, kemudian mereka pergi menuju Rasulullah shallallahu 'alaihi wasallam. Sampai ketika pada akhir malam beliau mendatangiku lalu tidur dengan menjadikan pahaku sebagai bantalnya, dan beliau apabila tidur terdengar hembusan nafasnya. Tatkala Rasulullah shallallahu 'alaihi wasallam sedang tidur di pahaku datanglah para lelaki seperti dengan paras yang tampan memakai pakaian yang serba putih. Huuh, alangkah indahnya mereka! sehingga segolongan dari mereka duduk di sisi kepala Rasulullah shallallahu 'alaihi wasallam dan segolongan yang lain di sisi kaminya lalu mereka saling berkata: kami belum pernah mendapatkan seorang hamba yang diberi anugerah seperti apa yang diberikan kepada Nabi shallallahu 'alaihi wasallam. Orang ini matanya tertidur tapi hatinya dalam keadaan sadar, buatlah baginya suatu perumpamaan. Baiklah, dia seperti seorang tuan yang membangun sebuah istana, kemudian membuat hidangan lalu mengundang orang-orang untuk makan dan minum, kemudian orang-orang tersebut naik ke langit. Lalu terbangunlah Rasulullah shallallahu 'alaihi wasallam ketika itu lalu beliau berkata kepadaku: tahukah kamu siapa mereka itu? lalu aku menjawab: Allah Subhanahu wa Ta'ala dan Rasul-Nya yang lebih tahu. Lalu beliau berkata: mereka adalah malaikat. Lalu beliau berkata lagi: tahukah anda apa yang diumpamakan? Aku katakan Allah Subhanahu wa Ta'ala dan Rasul-Nya yang lebih tahu beliau menjawab: Ar Rahman membangun surga, lalu menyeru (mengundang) hamba-hamba-Nya kepadanya, barang siapa yang menyambut maka dia akan masuk surga dan barang siapa yang menolak maka dia menghukum dan menyiksanya. "
            },
            {
                "number": 13,
                "arab": " أَخْبَرَنَا نُعَيْمُ بْنُ حَمَّادٍ حَدَّثَنَا بَقِيَّةُ عَنْ بَحِيرٍ عَنْ خَالِدِ بْنِ مَعْدَانَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو السُّلَمِيُّ عَنْ عُتْبَةَ بْنِ عَبْدٍ السُّلَمِيِّ أَنَّهُ حَدَّثَهُمْ وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ رَجُلٌ كَيْفَ كَانَ أَوَّلُ شَأْنِكَ يَا رَسُولَ اللَّهِ قَالَ كَانَتْ حَاضِنَتِي مِنْ بَنِي سَعْدِ بْنِ بَكْرٍ فَانْطَلَقْتُ أَنَا وَابْنٌ لَهَا فِي بَهْمٍ لَنَا وَلَمْ نَأْخُذْ مَعَنَا زَادًا فَقُلْتُ يَا أَخِي اذْهَبْ فَأْتِنَا بِزَادٍ مِنْ عِنْدِ أُمِّنَا فَانْطَلَقَ أَخِي وَمَكَثْتُ عِنْدَ الْبَهْمِ فَأَقْبَلَ طَائِرَانِ أَبْيَضَانِ كَأَنَّهُمَا نَسْرَانِ فَقَالَ أَحَدُهُمَا لِصَاحِبِهِ أَهُوَ هُوَ قَالَ الْآخَرُ نَعَمْ فَأَقْبَلَا يَبْتَدِرَانِي فَأَخَذَانِي فَبَطَحَانِي لِلْقَفَا فَشَقَّا بَطْنِي ثُمَّ اسْتَخْرَجَا قَلْبِي فَشَقَّاهُ فَأَخْرَجَا مِنْهُ عَلَقَتَيْنِ سَوْدَاوَيْنِ فَقَالَ أَحَدُهُمَا لِصَاحِبِهِ ائْتِنِي بِمَاءِ ثَلْجٍ فَغَسَلَ بِهِ جَوْفِي ثُمَّ قَالَ ائْتِنِي بِمَاءِ بَرَدٍ فَغَسَلَ بِهِ قَلْبِي ثُمَّ قَالَ ائْتِنِي بِالسَّكِينَةِ فَذَرَّهُ فِي قَلْبِي ثُمَّ قَالَ أَحَدُهُمَا لِصَاحِبِهِ حُصْهُ فَحَاصَهُ وَخَتَمَ عَلَيْهِ بِخَاتَمِ النُّبُوَّةِ ثُمَّ قَالَ أَحَدُهُمَا لِصَاحِبِهِ اجْعَلْهُ فِي كِفَّةٍ وَاجْعَلْ أَلْفًا مِنْ أُمَّتِهِ فِي كِفَّةٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا أَنَا أَنْظُرُ إِلَى الْأَلْفِ فَوْقِي أُشْفِقُ أَنْ يَخِرَّ عَلَيَّ بَعْضُهُمْ فَقَالَ لَوْ أَنَّ أُمَّتَهُ وُزِنَتْ بِهِ لَمَالَ بِهِمْ ثُمَّ انْطَلَقَا وَتَرَكَانِي قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفَرِقْتُ فَرَقًا شَدِيدًا ثُمَّ انْطَلَقْتُ إِلَى أُمِّي فَأَخْبَرْتُهَا بِالَّذِي لَقِيتُ فَأَشْفَقَتْ أَنْ يَكُونَ قَدْ الْتَبَسَ بِي فَقَالَتْ أُعِيذُكَ بِاللَّهِ فَرَحَلَتْ بَعِيرًا لَهَا فَجَعَلَتْنِي عَلَى الرَّحْلِ وَرَكِبَتْ خَلْفِي حَتَّى بُلْغَتِنَا إِلَى أُمِّي فَقَالَتْ أَدَّيْتُ أَمَانَتِي وَذِمَّتِي وَحَدَّثَتْهَا بِالَّذِي لَقِيتُ فَلَمْ يَرُعْهَا ذَلِكَ وَقَالَتْ إِنِّي رَأَيْتُ حِينَ خَرَجَ مِنِّي يَعْنِي نُورًا أَضَاءَتْ مِنْهُ قُصُورُ الشَّامِ",
                "id": "Telah mengabarkan kepada kami [Nu'aim bin Hammad] telah menceritakan kepada kami [Baqiyyah] dari [Bahir] dari [Khalid bin Ma'dan] telah menceritakan kepada kami ['Abdur Rahman bin 'Amr As Sulami] dari ['Utbah bin 'Abd As Sulami] Bahwa ia menceritakan kepada mereka, dan ia termasuk dari sahabat Rasulullah shallallahu 'alaihi wasallam, seorang laki-laki bertanya kepada Rasulullah shallallahu 'alaihi wasallam: Bagaimanakah perihal awal hidup baginda ya Rasulullah? beliau menjawab: Ibu asuhku ketika itu adalah perempuan Bani Sa'd bin Bakr ketika itu saya dan seorang anak kecil lainnya dari kabilah tersebut sedang menggembala binatang ternak. Karena kami tidak membawa bekal maka saya meminta kepada teman saya tersebut: wahai saudaraku pulanglah dan mintalah bekal kepada ibu kita. Lalu saudaraku pergi dan tinggal saya sendiri menjaga binatang ternak. Tiba-tiba datanglah dua burung yang putih seperti burung elang, salah satunya mengatakan kepada yang lain, apakah betul-betul dia? jawab yang lain; ya! lalu keduanya mengelilingi saya dan menarik saya serta menelentangkan saya, lalu mereka membelah perut saya kemudian mengeluarkan hati saya, membelahnya dan mengeluarkan dua gumpalan hitam. Kemudian berkatalah salah satu diantara keduanya kepada temannya: berikan saya air salju lalu dia pergunakan mencuci perut saya. Kemudian berkata lagi: berikan saya air sejuk\". Dan dia pergunakan mencuci hati saya. Kemudian dia berkata: berikan saya As Sakinah (ketenangan)! lalu dia menaburkannya dihati saya. Kemudian salah satunya berkata kepada temannya: jahitlah dia! lalu dijahitlah dan dia berikan tanda dengan khatam nubuwah (penutup para nabi). Kemudian berkata salah satu kepada temannya: letakkan dia pada salah satu timbangan dan letakkan seribu orang dari umatnya pada satu timbangan. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: ketika itu saya melihat seribu orang di atasku sehingga aku khawatir sebagian dari mereka jatuh menimpaku, lalu orang itu berkata lagi: seandainya umatnya ditimbang dengannya pasti akan lebih berat dia dari umatnya kemudian keduanya pergi meninggalkanku. Rasulullah shallallahu 'alaihi wasallam berkata: saya takut sekali kemudian saya berlari menuju ibu susuku dan saya beritahukan dia tentang apa yang baru saja terjadi padaku. Dia pun khawatir akan terjadi apa-apa terhadapku lalu dia berkata: aku meminta perlindungan Allah Subhanahu wa Ta'ala untukmu. Lalu dia mempersiapkan tunggangannya untuk pergi dan menempatkanku di atas onta dan dia naik di belakangku hingga kami sampai menjumpai ibuku, lalu dia berkata kepada ibuku: aku telah melaksanakan amanat dan beban yang telah dibebankan kepadaku, lalu dia menceritakan apa yang terjadi padaku. Namun hal itu tidak membuatnya gusar, bahkan ibuku menjawab: Dahulu malah saya melihatnya ketika dia baru keluar dari rahimku, yaitu cahaya yang menyinari singgasana Syam. "
            },
            {
                "number": 14,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عِمْرَانَ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا جَعْفَرُ بْنُ عُثْمَانَ الْقُرَشِيُّ عَنْ عُثْمَانَ بْنِ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ عَنْ أَبِي ذَرٍّ الْغِفَارِيِّ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ كَيْفَ عَلِمْتَ أَنَّكَ نَبِيٌّ حَتَّى اسْتَيْقَنْتَ فَقَالَ يَا أَبَا ذَرٍّ أَتَانِي مَلَكَانِ وَأَنَا بِبَعْضِ بَطْحَاءِ مَكَّةَ فَوَقَعَ أَحَدُهُمَا عَلَى الْأَرْضِ وَكَانَ الْآخَرُ بَيْنَ السَّمَاءِ وَالْأَرْضِ فَقَالَ أَحَدُهُمَا لِصَاحِبِهِ أَهُوَ هُوَ قَالَ نَعَمْ قَالَ فَزِنْهُ بِرَجُلٍ فَوُزِنْتُ بِهِ فَوَزَنْتُهُ ثُمَّ قَالَ فَزِنْهُ بِعَشَرَةٍ فَوُزِنْتُ بِهِمْ فَرَجَحْتُهُمْ ثُمَّ قَالَ زِنْهُ بِمِائَةٍ فَوُزِنْتُ بِهِمْ فَرَجَحْتُهُمْ ثُمَّ قَالَ زِنْهُ بِأَلْفٍ فَوُزِنْتُ بِهِمْ فَرَجَحْتُهُمْ كَأَنِّي أَنْظُرُ إِلَيْهِمْ يَنْتَثِرُونَ عَلَيَّ مِنْ خِفَّةِ الْمِيزَانِ قَالَ فَقَالَ أَحَدُهُمَا لِصَاحِبِهِ لَوْ وَزَنْتَهُ بِأُمَّتِهِ لَرَجَحَهَا",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Imran] telah menceritakan kepada kami [Abu Daud] telah menceritakan kepada kami [Ja'far bin Utsman Al Qurasyi] dari [Utsman bin Urwah bin Az Zubair] dari [ayahnya] dari [Abu Dzar Al Ghifari] Radliyallahu'anhu, ia berkata; saya bertanya wahai Rasulullah bagaimana bisa yakin bahwa kamu adalah nabi? nabi menjawab: wahai Abu Dzar dua malaikat datang kepadaku ketika aku sedang berada di suatu lembah di Makkah. Salah satunya turun ke bumi dan yang lainnya berada diantara langit dan bumi. Salah satunya mengatakan kepada temannya: apakah benar-benar dia? lalu temannya menjawab: ya! lalu berkata lagi: kalau begitu timbanglah dia dengan seseorang, maka saya ditimbang dengan sepuluh orang dan saya lebih berat dari pada mereka. Kemudian berkata lagi: \"Timbanglah dia dengan seratus orang\", maka saya pun ditimbang dan saya lebih berat daripada mereka. Lalu berkata lagi: \"Kalau begitu timbanglah dengan seribu orang\", lalu saya pun ditimbang dan saya lebih berat dari mereka. Ketika itu saya seakan-akan melihat mereka berdesak-desakkan karena sempitnya timbangan kemudian salah satu diantara dua malaikat itu berkata kepada temannya: kalaupun dia ditimbang dengan seluruh umatnya maka dia akan tetap lebih berat dari mereka. "
            },
            {
                "number": 15,
                "arab": " أَخْبَرَنَا إِسْمَعِيلُ بْنُ خَلِيلٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنَادِيهِمْ يَا أَيُّهَا النَّاسُ إِنَّمَا أَنَا رَحْمَةٌ مُهْدَاةٌ",
                "id": "Telah mengabarkan kepada kami [Ismail bin Khalil] telah menceritakan kepada kami [Ali bin Mushir] telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih], ia berkata; Nabi shallallahu 'alaihi wasallam pernah memanggil mereka; wahai manusia sesungguhnya saya adalah rahmat dan mendapatkan petunjuk. "
            },
            {
                "number": 16,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ طَرِيفٍ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ حَدَّثَنَا أَبُو حَيَّانَ عَنْ عَطَاءٍ عَنْ ابْنِ عُمَرَ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَأَقْبَلَ أَعْرَابِيٌّ فَلَمَّا دَنَا مِنْهُ قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْنَ تُرِيدُ قَالَ إِلَى أَهْلِي قَالَ هَلْ لَكَ فِي خَيْرٍ قَالَ وَمَا هُوَ قَالَ تَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ قَالَ وَمَنْ يَشْهَدُ عَلَى مَا تَقُولُ قَالَ هَذِهِ السَّلَمَةُ فَدَعَاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ بِشَاطِئِ الْوَادِي فَأَقْبَلَتْ تَخُدُّ الْأَرْضَ خَدًّا حَتَّى قَامَتْ بَيْنَ يَدَيْهِ فَاسْتَشْهَدَهَا ثَلَاثًا فَشَهِدَتْ ثَلَاثًا أَنَّهُ كَمَا قَالَ ثُمَّ رَجَعَتْ إِلَى مَنْبَتِهَا وَرَجَعَ الْأَعْرَابِيُّ إِلَى قَوْمِهِ وَقَالَ إِنْ اتَّبَعُونِي أَتَيْتُكَ بِهِمْ وَإِلَّا رَجَعْتُ فَكُنْتُ مَعَكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Tharif] telah menceritakan kepada kami [Muhammad bin Fudlail] telah menceritakan kepada kami [Abu Hayyan] dari ['Atha`] dari [Ibnu Umar] Radliyallahu'anhu, ia berkata; ketika kami sedang bersama Rasulullah shallallahu 'alaihi wasallam dalam sebuah perjalanan kami bertemu seorang Arab badui dan setelah kami mendekatinya Rasulullah shallallahu 'alaihi wasallam berkata kepadanya: engkau hendak kemana? Arab badui menjawab: aku hendak menemui keluargaku. Lalu Rasul berkata: apakah kamu mau sesuatu kebaikan? dia menjawab: apakah kebaikan itu? Rasulullah shallallahu 'alaihi wasallam bersabda: yaitu kamu bersaksi bahwa tiada tuhan yang berhak disembah kecuali Allah Subhanahu wa Ta'ala dan bersaksi bahwa Muhammad shallallahu 'alaihi wasallam adalah hamba dan RasulNya. Arab badui itu mengatakan: lalu siapa yang membuktikan kebenaran apa yang baginda katakan? Rasul menjawab: pohon Salamah itu, maka Rasul pun memanggilnya sementara pohon tersebut berada di tepi bukit, lalu pohon tersebut menghampiri Rasulullah shallallahu 'alaihi wasallam dengan membelah bumi sampai pohon tersebut sampai di hadapan Rasulullah shallallahu 'alaihi wasallam. Rasul memintanya untuk bersaksi tiga kali. Dia pun bersaksi tiga kali seperti apa yang dikatakan Rasulullah shallallahu 'alaihi wasallam kemudian pohon tersebut pun kembali lagi ke tempat ia tumbuh. Arab badui itu kembali ke kaumnya seraya berucap; sekiranya mereka mengikuti saya, saya akan membawa mereka menemui baginda (Rasulullah shallallahu 'alaihi wasallam), jika tidak saya akan kembali menemui baginda dan tinggal bersama baginda. "
            },
            {
                "number": 17,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْمَعِيلَ بْنِ عَبْدِ الْمَلِكِ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ خَرَجْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ وَكَانَ لَا يَأْتِي الْبَرَازَ حَتَّى يَتَغَيَّبَ فَلَا يُرَى فَنَزَلْنَا بِفَلَاةٍ مِنْ الْأَرْضِ لَيْسَ فِيهَا شَجَرٌ وَلَا عَلَمٌ فَقَالَ يَا جَابِرُ اجْعَلْ فِي إِدَاوَتِكَ مَاءً ثُمَّ انْطَلِقْ بِنَا قَالَ فَانْطَلَقْنَا حَتَّى لَا نُرَى فَإِذَا هُوَ بِشَجَرَتَيْنِ بَيْنَهُمَا أَرْبَعُ أَذْرُعٍ فَقَالَ يَا جَابِرُ انْطَلِقْ إِلَى هَذِهِ الشَّجَرَةِ فَقُلْ يُقَلْ لَكِ الْحَقِي بِصَاحِبَتِكِ حَتَّى أَجْلِسَ خَلْفَكُمَا فَرَجَعَتْ إِلَيْهَا فَجَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَلْفَهُمَا ثُمَّ رَجَعَتَا إِلَى مَكَانِهِمَا فَرَكِبْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَسُولُ اللَّهِ بَيْنَنَا كَأَنَّمَا عَلَيْنَا الطَّيْرُ تُظِلُّنَا فَعَرَضَتْ لَهُ امْرَأَةٌ مَعَهَا صَبِيٌّ لَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنِي هَذَا يَأْخُذُهُ الشَّيْطَانُ كُلَّ يَوْمٍ ثَلَاثَ مِرَارٍ قَالَ فَتَنَاوَلَ الصَّبِيَّ فَجَعَلَهُ بَيْنَهُ وَبَيْنَ مُقَدَّمِ الرَّحْلِ ثُمَّ قَالَ اخْسَأْ عَدُوَّ اللَّهِ أَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اخْسَأْ عَدُوَّ اللَّهِ أَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثًا ثُمَّ دَفَعَهُ إِلَيْهَا فَلَمَّا قَضَيْنَا سَفَرَنَا مَرَرْنَا بِذَلِكَ الْمَكَانِ فَعَرَضَتْ لَنَا الْمَرْأَةُ مَعَهَا صَبِيُّهَا وَمَعَهَا كَبْشَانِ تَسُوقُهُمَا فَقَالَتْ يَا رَسُولَ اللَّهِ اقْبَلْ مِنِّي هَدِيَّتِي فَوَالَّذِي بَعَثَكَ بِالْحَقِّ مَا عَادَ إِلَيْهِ بَعْدُ فَقَالَ خُذُوا مِنْهَا وَاحِدًا وَرُدُّوا عَلَيْهَا الْآخَرَ قَالَ ثُمَّ سِرْنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَنَا كَأَنَّمَا عَلَيْنَا الطَّيْرُ تُظِلُّنَا فَإِذَا جَمَلٌ نَادٌّ حَتَّى إِذَا كَانَ بَيْنَ سِمَاطَيْنِ خَرَّ سَاجِدًا فَحَبَسَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ عَلَيَّ النَّاسَ مَنْ صَاحِبُ الْجَمَلِ فَإِذَا فِتْيَةٌ مِنْ الْأَنْصَارِ قَالُوا هُوَ لَنَا يَا رَسُولَ اللَّهِ قَالَ فَمَا شَأْنُهُ قَالُوا اسْتَنَيْنَا عَلَيْهِ مُنْذُ عِشْرِينَ سَنَةً وَكَانَتْ بِهِ شُحَيْمَةٌ فَأَرَدْنَا أَنْ نَنْحَرَهُ فَنَقْسِمَهُ بَيْنَ غِلْمَانِنَا فَانْفَلَتَ مِنَّا قَالَ بِيعُونِيهِ قَالُوا لَا بَلْ هُوَ لَكَ يَا رَسُولَ اللَّهِ قَالَ أَمَّا لِي فَأَحْسِنُوا إِلَيْهِ حَتَّى يَأْتِيَهُ أَجَلُهُ قَالَ الْمُسْلِمُونَ عِنْدَ ذَلِكَ يَا رَسُولَ اللَّهِ نَحْنُ أَحَقُّ بِالسُّجُودِ لَكَ مِنْ الْبَهَائِمِ قَالَ لَا يَنْبَغِي لِشَيْءٍ أَنْ يَسْجُدَ لِشَيْءٍ وَلَوْ كَانَ ذَلِكَ كَانَ النِّسَاءُ لِأَزْوَاجِهِنَّ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Musa] dari [Isa bin Abdul Malik] dari [Abu Az Zubair] dari [Jabir] Radliyallahu'anhu, ia berkata; saya keluar bersama Rasulullah shallallahu 'alaihi wasallam dalam satu perjalanan dan beliau apabila hendak buang hajat selalu bersembunyi hingga tidak kelihatan. Ketika itu kami sedang berada pada tanah lapang yang luas yang tidak ada pepohonan atau pun tanda kehidupan lalu beliau berkata: wahai Jabir ambillah air dengan bejanamu, dan marilah kita teruskan perjalanan. Kata Jabir, kami terus melanjutkan perjalanan hingga tidak terlihat. Tiba-tiba ada dua pohon yang jarak antara keduanya empat hasta. Beliau bersabda: Tolong kamu dekati pohon itu, ajaklah bicara, niscaya dia menjawab, katakanlah padanya 'temuilah pohon sebelahmu hingga aku bisa duduk di belakang kamu berdua'. Pohon itu mendekati (temannya, pohon sebelahnya) dan Rasulullah shallallahu 'alaihi wasallam duduk di belakang keduanya, kemudian kedua pohon itu kembali ke tempat masing-masing. Selanjutnya kami menaiki tunggangan kami, dan seakan-akan di atas kami ada seekor burung yang menaungi kami, lalu seorang perempuan bersama bayinya mencegat Rasulullah shallallahu 'alaihi wasallam, ia berkata; wahai Rasulullah sesungguhnya anak saya ini selalu diganggu syaitan setiap hari tiga kali. Jabir berkata; lalu Rasulullah shallallahu 'alaihi wasallam mengambil bayi tersebut dan meletakannya di depan kendaraannya lalu beliau berkata; pergilah hai musuh Allah! saya adalah Rasulullah. Rasul mengucapkannya sebanyak tiga kali. Kemudian beliau mengembalikannya kepada perempuan tersebut. Tatkala kami kembali dari perjalanan, kami melewati jalan semula, dan seorang perempuan bersama anaknya telah mencegat kami bersama dua domba yang digiringnya. Kemudian ia berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam terimalah hadiah dari saya ini, demi Dzat yang mengutus baginda dengan benar sungguh syaitan itu tidak datang lagi. \" Beliau berkata: ambilah satu dan kembalikan yang satunya kepadanya. Kemudian kami terus melanjutkan perjalanan dan burung seolah-olah memayungi kami, tiba-tiba ada unta melarikan diri, namun saat ia sampai pada dua rerimbunan pohon, ia langsung merunduk bersujud dan Rasulullah shallallahu 'alaihi wasallam menangkapnya. Rasul bertanya kepada orang-orang: \"Kemarilah hai orang-orang, siapa pemilik unta ini? Maka beberapa pemuda dari kaum Anshar menjawab; ia milik kami wahai Rasulullah, beliau bertanya: apa yang sedang dialaminya? Mereka menjawab; kami telah lelah mengurusnya selama dua puluh tahun dan ia telah mempunyai banyak lemak (sudah menjadi gemuk) maka kami ingin menyembelihnya serta ingin membagikannya diantara anak-anak kami, akan tetapi ia kabur dari kami. Beliau berkata: \"baiklah, kalau begitu jual saja kepada saya. \". Mereka menjawab; \"Ohh, nggak usah baginda, tetapi cukuplah unta itu sebagai (hadiah) untuk baginda. Nabi berujar; \"Okelah, jika ia milik saya maka berlaku baiklah kepadanya, sampai tiba ajalnya. Pada saat itu kaum muslimin berkata; Wahai Rasulullah kami lebih berhak untuk bersujud kepada baginda dari binatang, beliau bersabda: Tidaklah berhak satu (makhluk) bersujud kepada makhluk (lainnya), kalau sekiranya hal itu boleh maka para wanita diperkenankan sujud kepada suami-suami mereka. "
            },
            {
                "number": 18,
                "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا الْأَجْلَحُ عَنْ الذَّيَّالِ بْنِ حَرْمَلَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ أَقْبَلْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى دُفِعْنَا إِلَى حَائِطٍ فِي بَنِي النَّجَّارِ فَإِذَا فِيهِ جَمَلٌ لَا يَدْخُلُ الْحَائِطَ أَحَدٌ إِلَّا شَدَّ عَلَيْهِ فَذَكَرُوا ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَاهُ فَدَعَاهُ فَجَاءَ وَاضِعًا مِشْفَرَهُ عَلَى الْأَرْضِ حَتَّى بَرَكَ بَيْنَ يَدَيْهِ فَقَالَ هَاتُوا خِطَامًا فَخَطَمَهُ وَدَفَعَهُ إِلَى صَاحِبِهِ ثُمَّ الْتَفَتَ فَقَالَ مَا بَيْنَ السَّمَاءِ إِلَى الْأَرْضِ إِلَّا يَعْلَمُ أَنِّي رَسُولُ اللَّهِ إِلَّا عَاصِيَ الْجِنِّ وَالْإِنْسِ",
                "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Al Ajlah] dari [Adz Dzayyal bin Harmalah] dari [Jabir bin Abdullah] Radliyallahu'anhu ia berkata; kami kembali dari bepergian bersama Rasulullah shallallahu 'alaihi wasallam. Sampai kami tiba di satu perkampungan Bani Najjar, tiba-tiba ada seekor unta yang menghalangi setiap orang yang hendak memasuki perkebunan tersebut. Hal itu dilaporkan kepada Rasulullah shallallahu 'alaihi wasallam, maka beliau mendatanginya dan memanggil unta tersebut. Si unta datang dan meletakkan bibirnya di atas bumi hingga bertekuk lutut di hadapan beliau. Kemudian beliau bersabda: ambilkan seutas tali, selanjutnya beliau mengikatnya dengan tali tersebut dan mengembalikannya kepada pemiliknya. Kemudian beliau menengok ke belakang dan bersabda: Tidaklah seseorangpun diantara langit dan bumi melainkan dirinya mengetahui sesungguhnya saya adalah utusan Allah Subhanahu wa Ta'ala kecuali mereka yang durhaka; dari bangsa jin dan manusia. "
            },
            {
                "number": 19,
                "arab": " أَخْبَرَنَا الْحَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ فَرْقَدٍ السَّبَخِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ امْرَأَةً جَاءَتْ بِابْنٍ لَهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنِي بِهِ جُنُونٌ وَإِنَّهُ يَأْخُذُهُ عِنْدَ غَدَائِنَا وَعَشَائِنَا فَيُخَبَّثُ عَلَيْنَا فَمَسَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدْرَهُ وَدَعَا فَثَعَّ ثَعَّةً وَخَرَجَ مِنْ جَوْفِهِ مِثْلُ الْجِرْوِ الْأَسْوَدِ فَسَعَى",
                "id": "Telah mengabarkan kepada kami [Al Hajjaj bin Minhal] telah mencereitakan kepada kami [Hammad bin Salamah] dari [Farqad As Sabakhi] dari [Sa'id bin Jubair] dari [Ibnu Abbas] Radliyallahu'anhu, Bahwa seorang wanita datang membawa anaknya kepada Rasulullah shallallahu 'alaihi wasallam dan berkata: \"Ya Rasulullah, anak saya kemasukkan jin, jin tersebut selalu masuk pada waktu kami sedang makan siang dan makan malam kami, dan menjelek-jelekkan kami. \"Lalu Rasulullah shallallahu 'alaihi wasallam dan mendoakannya. Kemudian ia muntah dan keluar dari mulutnya sesuatu (seperti anak anjing) hitam lalu pergi. "
            },
            {
                "number": 20,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ سَعِيدٍ أَخْبَرَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ الْعَبْدِيُّ عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَأَعْرِفُ حَجَرًا بِمَكَّةَ كَانَ يُسَلِّمُ عَلَيَّ قَبْلَ أَنْ أُبْعَثَ إِنِّي لَأَعْرِفُهُ الْآنَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sa'id] telah mengabarkan kepada kami [Yahya bin Abu Bakr Al 'Abdi] dari [Ibrahim bin Thahman] dari [Simak] dari [Jabir bin Samurah] Radliyallahu'anhu ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Saya benar-benar mengetahui ada sebongkah batu di Makkah yang waktu dulu dia mengucapkan salam kepadaku sebelum aku diutus. Sungguh saya benar-benar mengetahuinya sekarang\". "
            },
            {
                "number": 21,
                "arab": " حَدَّثَنَا فَرْوَةُ حَدَّثَنَا الْوَلِيدُ بْنُ أَبِي ثَوْرٍ الْهَمْدَانِيُّ عَنْ إِسْمَعِيلَ السُّدِّيِّ عَنْ عَبَّادٍ أَبِي يَزِيدَ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ كُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ فَخَرَجْنَا مَعَهُ فِي بَعْضِ نَوَاحِيهَا فَمَرَرْنَا بَيْنَ الْجِبَالِ وَالشَّجَرِ فَلَمْ نَمُرَّ بِشَجَرَةٍ وَلَا جَبَلٍ إِلَّا قَالَ السَّلَامُ عَلَيْكَ يَا رَسُولَ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Farwah] telah menceritakan kepada kami [Al Walid bin Abu Tsaur Al Hamdani] dari [Isma'il As Suddi] dari ['Abbad bin Abu Yazid] dari [Ali bin Abu Thalib] Radliyallahu'anhu ia berkata; Kami bersama Nabi shallallahu 'alaihi wasallam di Makkah. Lalu kami keluar bersamanya maka kami tidak melewati satu pohon atau bukit pun melainkan ia mengucapkan; ASSALAMU 'ALAIKA YA RASULALLAH (keselamatan senantiasa atas baginda wahai Rasulullah). "
            },
            {
                "number": 22,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ شِمْرِ بْنِ عَطِيَّةَ عَنْ رَجُلٍ مِنْ مُزَيْنَةَ أَوْ جُهَيْنَةَ قَالَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْفَجْرَ فَإِذَا هُوَ بِقَرِيبٍ مِنْ مِائَةِ ذِئْبٍ قَدْ أَقْعَيْنَ وُفُودُ الذِّئَابِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَرْضَخُوا لَهُمْ شَيْئًا مِنْ طَعَامِكُمْ وَتَأْمَنُونَ عَلَى مَا سِوَى ذَلِكَ فَشَكَوْا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحَاجَةَ قَالَ فَآذِنُوهُنَّ قَالَ فَآذَنُوهُنَّ فَخَرَجْنَ وَلَهُنَّ عُوَاءٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Syimr bin 'Athiyah] dari [seseorang] dari Muzainah atau Juhainah ia berkata; Rasulullah shallallahu 'alaihi wasallam sholat subuh ternyata beliau berada di dekat seratus serigala yang semuanya sudah pada jongkok. Rasulullah shallallahu 'alaihi wasallam hanya berkata kepada mereka (para sahabat) \" Tolong, lemparkanlah sedikit dari makanan kalian ke gerombolan mereka (serigala) maka makanan kalian yang lain akan aman. \" Lalu mereka mengadu kepada Rasulullah shallallahu 'alaihi wasallam untuk suatu keperluan. Rasul pun bersabda: Beritahukanlah kepada serigala-serigala itu. Maka para sahabat memberitahu gerombolan serigala bahwa mereka mempunyai keperluan sehingga harus lewat. Gerombolan serigala itu dengan sendirinya pergi dengan melolong. "
            },
            {
                "number": 23,
                "arab": " أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي سُفْيَانَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ جَاءَ جِبْرِيلُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ جَالِسٌ حَزِينٌ وَقَدْ تَخَضَّبَ بِالدَّمِ مِنْ فِعْلِ أَهْلِ مَكَّةَ مِنْ قُرَيْشٍ فَقَالَ جِبْرِيلُ يَا رَسُولَ اللَّهِ هَلْ تُحِبُّ أَنْ أُرِيَكَ آيَةً قَالَ نَعَمْ فَنَظَرَ إِلَى شَجَرَةٍ مِنْ وَرَائِهِ فَقَالَ ادْعُ بِهَا فَدَعَا بِهَا فَجَاءَتْ وَقَامَتْ بَيْنَ يَدَيْهِ فَقَالَ مُرْهَا فَلْتَرْجِعْ فَأَمَرَهَا فَرَجَعَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَسْبِي حَسْبِي",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy] dari [Abu Sufyan] dari [Anas bin Malik] ia berkata; Jibril datang kepada Rasulullah shallallahu 'alaihi wasallam ketika beliau sedang duduk sedih berlumuran darah disebabkan perlakuan orang-orang kafir Quraisy Makkah, lalu jibril berkata: wahai Rasulullah apakah baginda ingin saya perlihatkan tanda (kekuasaan Subhanahu wa Ta'ala) Rasul menjawab: 'ya': lalu beliau melihat sebuah pohon di belakangnya, jibril mengatakan: panggillah pohon tersebut, maka beliau memanggilnya dan pohon itu datang serta berdiri di hadapan beliau, kemudian Jibril berkata: \"Perintahkan untuk kembali\". Maka beliau memerintahkannya untuk kembali dan pohon itupun kembali (ke tempat asalnya) Rasulullah berkata: cukup-cukup. "
            },
            {
                "number": 24,
                "arab": " أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا جَرِيرٌ وَأَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي ظَبْيَانَ عَنْ ابْنِ عَبَّاسٍ قَالَ أَتَى رَجُلٌ مِنْ بَنِي عَامِرٍ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أُرِيكَ آيَةً قَالَ بَلَى قَالَ فَاذْهَبْ فَادْعُ تِلْكَ النَّخْلَةَ فَدَعَاهَا فَجَاءَتْ تَنْقُزُ بَيْنَ يَدَيْهِ قَالَ قُلْ لَهَا تَرْجِعْ قَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ارْجِعِي فَرَجَعَتْ حَتَّى عَادَتْ إِلَى مَكَانِهَا فَقَالَ يَا بَنِي عَامِرٍ مَا رَأَيْتُ رَجُلًا كَالْيَوْمِ أَسْحَرَ مِنْهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Jarir] dan [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Zhabyan] dari [Ibnu Abbas] Radliyallahu' anhu ia berkata; Seseorang dari bani 'Amir mendatangi Rasulullah shallallahu 'alaihi wasallam, lalu Rasulullah shallallahu 'alaihi wasallam mengatakan; Sudikah kamu saya perlihatkan kepada kamu satu tanda (kebesaran Allah Subhanahu wa Ta'ala) dia menjawab: ya! Rasul berkata: pergi dan panggil pohon kurma itu, lalu ia memanggilnya dan kurma itu datang dengan melompat ke hadapan beliau, kemudian orang itu berkata; katakan padanya untuk kembali, maka Rasulullah shallallahu 'alaihi wasallam berkata kepada pohon itu: kembalilah, maka pohon itu kembali sehingga sampai ke tempatnya, orang itu menyeru; wahai bani 'Amir saya tidak melihat seorang lelakipun yang lebih pandai menyihir daripada dirinya. "
            },
            {
                "number": 25,
                "arab": " أَخْبَرَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا شُعَيْبُ بْنُ صَفْوَانَ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِي الضُّحَى عَنْ ابْنِ عَبَّاسٍ قَالَ دَعَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَالًا فَطَلَبَ بِلَالٌ الْمَاءَ ثُمَّ جَاءَ فَقَالَ لَا وَاللَّهِ مَا وَجَدْتُ الْمَاءَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَلْ مِنْ شَنٍّ فَأَتَاهُ بِشَنٍّ فَبَسَطَ كَفَّيْهِ فِيهِ فَانْبَعَثَتْ تَحْتَ يَدَيْهِ عَيْنٌ قَالَ فَكَانَ ابْنُ مَسْعُودٍ يَشْرَبُ وَغَيْرُهُ يَتَوَضَّأُ",
                "id": "Telah mengabarkan kepada kami [Ismail bin Ibrahim] telah menceritakan kepada kami [Syuaib bin Shafwan] dari ['Atha` bin As Sa`ib] dari [Abu Al Dluha] dari [Ibnu Abbas] Radliyallahu'anhu ia berkata; Nabi shallallahu 'alaihi wasallam memanggil Bilal, dan Bilal mencari air kemudian datang dan berkata; tidak, demi Allah Subhanahu wa Ta'ala saya tidak mediate air, maka Nabi shallallahu 'alaihi wasallam bertanya: apakah kamu mempunyai wadah air?, lalu ia (Bilal) memberi beliau sebuah wadah air dan beliaupun membentangkan kedua tangan beliau di wadah itu, maka mengalirkan air dari kedua telapak tangan beliau, perawi berkata; Ibnu Mas'ud dan yang lainnya juga meminum dan berwudlu (dari air tersebut). "
            },
            {
                "number": 26,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْأَسْوَدِ بْنِ قَيْسٍ عَنْ نُبَيْحٍ الْعَنَزِيِّ قَالَ قَالَ جَابِرُ بْنُ عَبْدِ اللَّهِ غَزَوْنَا أَوْ سَافَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ يَوْمَئِذٍ بِضْعَةَ عَشَرَ وَمِائَتَانِ فَحَضَرَتْ الصَّلَاةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ فِي الْقَوْمِ مِنْ طَهُورٍ فَجَاءَ رَجُلٌ يَسْعَى بِإِدَاوَةٍ فِيهَا شَيْءٌ مِنْ مَاءٍ لَيْسَ فِي الْقَوْمِ مَاءٌ غَيْرُهُ فَصَبَّهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَدَحٍ ثُمَّ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ انْصَرَفَ وَتَرَكَ الْقَدَحَ فَرَكِبَ النَّاسُ ذَلِكَ الْقَدَحَ وَقَالُوا تَمَسَّحُوا تَمَسَّحُوا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رِسْلِكُمْ حِينَ سَمِعَهُمْ يَقُولُونَ ذَلِكَ فَوَضَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَفَّهُ فِي الْمَاءِ وَالْقَدَحِ وَقَالَ بِسْمِ اللَّهِ ثُمَّ قَالَ أَسْبِغُوا الطُّهُورَ فَوَالَّذِي هُوَ ابْتَلَانِي بِبَصَرِي لَقَدْ رَأَيْتُ الْعُيُونَ عُيُونَ الْمَاءِ تَخْرُجُ مِنْ بَيْنِ أَصَابِعِهِ فَلَمْ يَرْفَعْهَا حَتَّى تَوَضَّئُوا أَجْمَعُونَ",
                "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Al Aswad bin Qais] dari [Nubaih Al 'Anazi] ia berkata; [Jabir bin Abdullah] berkata; Kami pernah berperang atau mengadakan perjalanan bersama Rasulullah shallallahu 'alaihi wasallam. Pada hari itu jumlah kami sebanyak dua ratus sekian orang. Lalu tibalah waktu sholat. Rasulullah shallallahu 'alaihi wasallam bertanya: \"Apakah semua orang dalam keadaan suci?\" Kemudian datang seseorang membawa jerigen kulit berisi air, dan tidak ada air lagi kecuali air tersebut. Kemudian Rasulullah menuangkannya ke dalam bejana (yang lebih besar) kemudian beliau berwudlu dengan sebaik-baik wudlu, lalu beliau berpaling meninggalkan bejana itu. Maka orang-orang berebut mendekati bejana tersebut, seraya mereka berkata; \"Cukup kalian mengusap saja. \" Lalu Rasulullah shallallahu 'alaihi wasallam berkata: \"Maaf beri aku jalan\". Rasul ucapkan demikian ketika beliau mendengar mereka berucap di atas. Selanjutnya Rasulullah shallallahu 'alaihi wasallam meletakkan telapak tangannya di air tersebut seraya berucap: Dengan nama Allah Subhanahu wa Ta'ala, kemudian beliau berkata: Sempurnakan wudlu kalian. (Jabir Radliyallahu'anhu) berkata; Demi Dzat yang tidak mengaburkan penglihatan saya, saya melihat dengan jelas mata air yang keluar dari jari-jari beliau dan beliau tidak mengangkat tangan beliau sampai mereka semua berwudlu. "
            },
            {
                "number": 27,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ وَسَعِيدُ بْنُ الرَّبِيعِ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ وَحُصَيْنٍ سَمِعَا سَالِمَ بْنَ أَبِي الْجَعْدِ يَقُولُ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَ أَصَابَنَا عَطَشٌ فَجَهَشْنَا فَانْتَهَيْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَضَعَ يَدَهُ فِي تَوْرٍ فَجَعَلَ يَفُورُ كَأَنَّهُ عُيُونٌ مِنْ خَلَلِ أَصَابِعِهِ وَقَالَ اذْكُرُوا اسْمَ اللَّهِ فَشَرِبْنَا حَتَّى وَسِعَنَا وَكَفَانَا وَفِي حَدِيثِ عَمْرِو بْنِ مُرَّةَ فَقُلْنَا لِجَابِرٍ كَمْ كُنْتُمْ قَالَ كُنَّا أَلْفًا وَخَمْسَ مِائَةٍ وَلَوْ كُنَّا مِائَةَ أَلْفٍ لَكَفَانَا",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Al Thayalitsi] dan [Sa'id bin Ar Rabi'] keduanya berkata; telah menceritakan kepada kami [Syu'bah] dari [Amr bin Murrah] dan [Hushain] keduanya mendengar [Salim bin Abu Ja'd] berkata; saya mendengar [Jabir bin Abdullah] Radliyallahu'anhu berkata; kami merasa sangat kehausan dan kami berjalan dengan cepat sampai kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau memasukkan tangannya ke periuk kemudian air memancar dari jari-jemari beliau seperti mata air, dan beliau berkata: sebutlah nama Allah Subhanahu wa Ta'ala (maka kamipun menyebut nama Allah Subhanahu wa Ta'ala) dan kami minum sampai kami kenyang dan cukup, Dalam hadits Amru bin Murrah, kami bertanya kepada Jabir Radliyallahu'anhu; berapa jumlah kalian (waktu itu)? ia menjawab; kami berjumlah seribu lima ratus orang, kalaupun sekiranya kami (waktu itu) seratus ribu orang niscaya air itu cukup bagi kami. "
            },
            {
                "number": 28,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ حَدَّثَنَا الْجَعْدُ أَبُو عُثْمَانَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ حَدَّثَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ قَالَ شَكَا أَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَطَشَ فَدَعَا بِعُسٍّ فَصُبَّ فِيهِ مَاءٌ وَوَضَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ فِيهِ قَالَ فَجَعَلْتُ أَنْظُرُ إِلَى الْمَاءِ يَنْبُعُ عُيُونًا مِنْ بَيْنِ أَصَابِعِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ يَسْتَقُونَ حَتَّى اسْتَقَى النَّاسُ كُلُّهُمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah Ar Raqqasyi] telah menceritakan kepada kami [Ja'far bin Sulaiman] telah menceritakan kepada kami [Al Ja'du Abu Utsman] telah menceritakan kepada kami [Anas bin Malik] Radliyallahu'anhu telah menceritakan kepada kami [Jabir bin Abdullah] Radliyallahu'anhu ia berkata; Para sahabat Rasulullah shallallahu 'alaihi wasallam mengadu kepada beliau tentang rasa haus (yang mereka rasakan) lalu beliau meminta bejana yang besar dan dibagikan air ke dalamnya dan Rasulullah shallallahu 'alaihi wasallam meletakkan tangannya di bejana tersebut. Perawi berkata; aku melihat mata air yang memancar dari jari-jemari Rasulullah shallallahu 'alaihi wasallam, orang-orang mengambilnya untuk minum sehingga mereka semuanya dapat meminumnya. "
            },
            {
                "number": 29,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ سَمِعَ عَبْدُ اللَّهِ بِخَسْفٍ فَقَالَ كُنَّا أَصْحَابَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعُدُّ الْآيَاتِ بَرَكَةً وَأَنْتُمْ تَعُدُّونَهَا تَخْوِيفًا إِنَّا بَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَيْسَ مَعَنَا مَاءٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اطْلُبُوا مَنْ مَعَهُ فَضْلُ مَاءٍ فَأُتِيَ بِمَاءٍ فَصَبَّهُ فِي الْإِنَاءِ ثُمَّ وَضَعَ كَفَّهُ فِيهِ فَجَعَلَ الْمَاءُ يَخْرُجُ مِنْ بَيْنِ أَصَابِعِهِ ثُمَّ قَالَ حَيَّ عَلَى الطَّهُورِ الْمُبَارَكِ وَالْبَرَكَةُ مِنْ اللَّهِ تَعَالَى فَشَرِبْنَا و قَالَ عَبْدُ اللَّهِ كُنَّا نَسْمَعُ تَسْبِيحَ الطَّعَامِ وَهُوَ يُؤْكَلُ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Musa] dari [Israil] dari [Mansur] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] ia berkata; Abdullah mendengar tentang gerhana bulan, lalu ia berkata; Kami para sahabat Nabi Muhammad shallallahu 'alaihi wasallam menganggap tanda-tanda (kekuasaan Allah Subhanahu wa Ta'ala) Sebagai suatu keberkahan sementara kalian menganggapnya sebagai sesuatu yang menakutkan. Sesungguhnya ketika kami berada bersama Rasulullah shallallahu 'alaihi wasallam kami tidak memiliki air. Lalu Rasulullah shallallahu 'alaihi wasallam berkata: \"Mintalah kepada yang mempunyai kelebihan air. \" Kemudian didatangkan kepada Rasulullah shallallahu 'alaihi wasallam dan beliau pun menuangkannya ke sebuah bejana, beliau meletakkan telapak tangan ke dalamnya maka terpancarlah air dari jari-jemari Rasulullah shallallahu 'alaihi wasallam dan beliau menyeru: Mari bersegera bersuci yang penuh keberkahan, dan keberkahan itu hanya milik Allah Subhanahu wa Ta'ala, lalu kami meminumnya. Abdullah berkata; Bahkan dulu kami pernah mendengar tasbih suatu makanan padahal ia sedang disantap. "
            },
            {
                "number": 30,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبُو الْجَوَّابِ عَنْ عَمَّارِ بْنِ رُزَيْقٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ زُلْزِلَتْ الْأَرْضُ عَلَى عَهْدِ عَبْدِ اللَّهِ فَأُخْبِرَ بِذَلِكَ فَقَالَ إِنَّا كُنَّا أَصْحَابَ مُحَمَّدٍ نَرَى الْآيَاتِ بَرَكَاتٍ وَأَنْتُمْ تَرَوْنَهَا تَخْوِيفًا بَيْنَا نَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ إِذْ حَضَرَتْ الصَّلَاةُ وَلَيْسَ مَعَنَا مَاءٌ إِلَّا يَسِيرٌ فَدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَاءٍ فِي صَحْفَةٍ وَوَضَعَ كَفَّهُ فِيهِ فَجَعَلَ الْمَاءُ يَنْبَجِسُ مِنْ بَيْنِ أَصَابِعِهِ ثُمَّ نَادَى حَيَّ عَلَى الْوَضُوءِ وَالْبَرَكَةُ مِنْ اللَّهِ فَأَقْبَلَ النَّاسُ فَتَوَضَّئُوا وَجَعَلْتُ لَا هَمَّ لِي إِلَّا مَا أُدْخِلُهُ بَطْنِي لِقَوْلِهِ وَالْبَرَكَةُ مِنْ اللَّهِ فَحَدَّثْتُ بِهِ سَالِمَ بْنَ أَبِي الْجَعْدِ فَقَالَ كَانُوا خَمْسَ عَشْرَةَ مِائَةٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Abu Al Jawwab] dari ['Amar bin Ruzaiq] dari [Al A'masy] dari [Ibrahim] dari [Alqamah] dari [Abdullah] ia berkata; telah terjadi gempa pada masa Abdullah dan kejadian tersebut diberitahukan kepada Abdullah lalu beliau berkata: Kami para sahabat menganggap tanda-tanda (kebesaran Allah Subhanahu wa Ta'ala) sebagai suatu keberkahan, sementara kalian menganggapnya sebagai hal yang menakutkan. Pernah ketika kami sedang bersama Rasulullah shallallahu 'alaihi wasallam dalam sebuah perjalanan, tiba-tiba waktu sholat tiba, sementara kami tidak membawa air kecuali sedikit. Lalu Rasulullah shallallahu 'alaihi wasallam meminta air di bejana yang besar, dan beliau meletakkan telapak tangannya padanya. Secara mengejutkan air memancar diantara jari-jemarinya kemudian beliau menyeru: \"Hai, Kemarilah untuk mengambil air wudhu dan keberkahan dari Allah Subhanahu wa Ta'ala.\" Maka semuanya orang-orang mengambil wudhu sementara saya tidak mempunyai keinginan apa-apa kecuali saya hanya ingin meminumnya dan memasukkan air tersebut ke dalam perut saya karena beliau bersabda: keberkahan dari Allah. Aku ceritakan peristiwa itu kepada [Salim bin Abu Al Ja'd], maka ia berkata; mereka (waktu itu) berjumlah lima belas orang. "
            },
            {
                "number": 31,
                "arab": " أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا مُعَاذُ بْنُ الْعَلَاءِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ إِلَى جِذْعٍ فَلَمَّا اتَّخَذَ الْمِنْبَرَ حَنَّ الْجِذْعُ حَتَّى أَتَاهُ فَمَسَحَهُ",
                "id": "Telah mengabarkan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Mu'adz bin Al 'Ala`] dari [Nafi'] dari [Ibnu Umar] Pada awal mulanya Rasulullah shallallahu 'alaihi wasallam selalu berkhutbah dengan bersandar pada sebatang kayu. Setelah beliau menggunakan mimbar (dan kayu itu tak dipakai lagi), kayu itu merintih sehingga beliau mengelusnya. "
            },
            {
                "number": 32,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ حُمَيْدٍ حَدَّثَنَا تَمِيمُ بْنُ عَبْدِ الْمُؤْمِنِ حَدَّثَنَا صَالِحُ بْنُ حَيَّانَ حَدَّثَنِي ابْنُ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَطَبَ قَامَ فَأَطَالَ الْقِيَامَ فَكَانَ يَشُقُّ عَلَيْهِ قِيَامُهُ فَأُتِيَ بِجِذْعِ نَخْلَةٍ فَحُفِرَ لَهُ وَأُقِيمَ إِلَى جَنْبِهِ قَائِمًا لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَطَبَ فَطَالَ الْقِيَامُ عَلَيْهِ اسْتَنَدَ إِلَيْهِ فَاتَّكَأَ عَلَيْهِ فَبَصُرَ بِهِ رَجُلٌ كَانَ وَرَدَ الْمَدِينَةَ فَرَآهُ قَائِمًا إِلَى جَنْبِ ذَلِكَ الْجِذْعِ فَقَالَ لِمَنْ يَلِيهِ مِنْ النَّاسِ لَوْ أَعْلَمُ أَنَّ مُحَمَّدًا يَحْمَدُنِي فِي شَيْءٍ يَرْفُقُ بِهِ لَصَنَعْتُ لَهُ مَجْلِسًا يَقُومُ عَلَيْهِ فَإِنْ شَاءَ جَلَسَ مَا شَاءَ وَإِنْ شَاءَ قَامَ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ائْتُونِي بِهِ فَأَتَوْهُ بِهِ فَأُمِرَ أَنْ يَصْنَعَ لَهُ هَذِهِ الْمَرَاقِيَ الثَّلَاثَ أَوْ الْأَرْبَعَ هِيَ الْآنَ فِي مِنْبَرِ الْمَدِينَةِ فَوَجَدَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ رَاحَةً فَلَمَّا فَارَقَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجِذْعَ وَعَمَدَ إِلَى هَذِهِ الَّتِي صُنِعَتْ لَهُ جَزِعَ الْجِذْعُ فَحَنَّ كَمَا تَحِنُّ النَّاقَةُ حِينَ فَارَقَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَزَعَمَ ابْنُ بُرَيْدَةَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ سَمِعَ حَنِينَ الْجِذْعِ رَجَعَ إِلَيْهِ فَوَضَعَ يَدَهُ عَلَيْهِ وَقَالَ اخْتَرْ أَنْ أَغْرِسَكَ فِي الْمَكَانِ الَّذِي كُنْتَ فِيهِ فَتَكُونَ كَمَا كُنْتَ وَإِنْ شِئْتَ أَنْ أَغْرِسَكَ فِي الْجَنَّةِ فَتَشْرَبَ مِنْ أَنْهَارِهَا وَعُيُونِهَا فَيَحْسُنُ نَبْتُكَ وَتُثْمِرُ فَيَأْكُلَ أَوْلِيَاءُ اللَّهِ مِنْ ثَمَرَتِكَ وَنَخْلِكَ فَعَلْتُ فَزَعَمَ أَنَّهُ سَمِعَ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَقُولُ لَهُ نَعَمْ قَدْ فَعَلْتُ مَرَّتَيْنِ فَسُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اخْتَارَ أَنْ أَغْرِسَهُ فِي الْجَنَّةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Humaid] telah menceritakan kepada kami [Tamim bin 'Abdul Mukmin] telah menceritakan kepada kami [Shalih bin Hayyan] telah menceritakan kepadaku [Ibnu Buraidah] dari [ayahnya] ia berkata; Pada awal mulanya Nabi shallallahu 'alaihi wasallam apabila berkhutbah dengan berdiri, dan beliau lama sekali berdiri. Maka hal itu sangat memberatkan beliau. Kemudian didatangkan pelepah kurma, tanah dibuat kubangan, dan pohon kurma itu ditancapkannya di samping Nabi shallallahu 'alaihi wasallam agar beliau pergunakan saat berdiri. Jika nabi berkhutbah dan berdiri lama, beliau bersandar pada batang kurma tersebut. Seorang lelaki yang baru datang ke Madinah melihat kejadian ini, yaitu beliau sedang berdiri di samping batang kurma tersebut. Maka si lelaki itu menyampaikan uneg-unegnya kepada orang-orang di sekelilingnya; \"Kalaulah saya tahu bahwa Muhammad akan memujiku karena kulakukan suatu hal yang meringankan bebannya niscaya aku membuatkannya suatu tempat duduk yang dapat beliau pergunakan untuk berdiri, apabila dia suka maka dia dapat duduk dan apabila dia suka dia bisa berdiri di tempat tersebut. \" Lalu perihal tersebut disampaikan kepada Rasulullah shallallahu 'alaihi wasallam dan beliau pun berkata: \"Bawa orang tersebut ke hadapanku\". Lalu orang tersebut didatangkan dan diperintahkannya untuk membuatkan tangga yang memiliki tiga atau empat tangga seperti yang sekarang ada pada mimbar Madinah. Rasulullah shallallahu 'alaihi wasallam merasakan kenyamanan dengan hal itu. Tatkala beliau meninggalkan batang pohon tersebut (yang dulu pernah digunakannya) dan bersandar pada mimbar yang dibuat untuknya, Maka batang pohon kurma itu merasa sedih dan merintih sebagaimana rintihan unta tatkala Rasulullah shallallahu 'alaihi wasallam meninggalkannya. Ibnu Buraidhah berkeyakinan dari ayahnya bahwa Nabi shallallahu 'alaihi wasallam ketika mendengarkan rintihan batang kurma tersebut beliau kembali meletakkan tangannya padanya dan berkata: \"Pilihlah apakah kamu saya tanam kembali di tempat semula atau saya tanam (nanti) di surga sehingga kamu dapat menghisap dari sungai dan mata airnya yang membuat pertumbuhan kamu menjadi baik dan berbuah, dan sehingga para wali Allah Subhanahu wa Ta'ala dapat memakan buah kamu (kurma) maka saya akan melakukannya. \" Ayah Ibnu Buraidah berkeyakinan bahwa dia mendengar dari Nabi shallallahu 'alaihi wasallam, beliau berkata kepada batang kurma tersebut: \"Baik, telah kulakukan (Nabi mengulangi ucapannya dua kali. \" Lalu Nabi shallallahu 'alaihi wasallam di tanya dan beliau menjawab: batang tersebut memilih agar saya menanamnya di surga nanti. "
            },
            {
                "number": 33,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ سُلَيْمَانَ بْنِ كَثِيرٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُومُ إِلَى جِذْعٍ قَبْلَ أَنْ يُجْعَلَ الْمِنْبَرُ فَلَمَّا جُعِلَ الْمِنْبَرُ حَنَّ ذَلِكَ الْجِذْعُ حَتَّى سَمِعْنَا حَنِينَهُ فَوَضَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ عَلَيْهِ فَسَكَنَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] dari [Sulaiman bin Katsir] dari [Az Zuhri] dari [Sa'id bin Al Musayyib] dari [Jabir bin Abdullah] Radliyallahu'anhu berkata; Dahulu Rasulullah shallallahu 'alaihi wasallam selalu berdiri dengan bersandar ke batang kurma sebelum dibuatkan mimbar. Ketika dibuatkan mimbar, batang kurma tersebut merintih sampai kami mendengar rintihannya, lalu Rasulullah shallallahu 'alaihi wasallam meletakkan tangan beliau padanya dan ia pun diam. "
            },
            {
                "number": 34,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ حَفْصِ بْنِ عُبَيْدِ اللَّهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ إِلَى خَشَبَةٍ فَلَمَّا صُنِعَ الْمِنْبَرُ فَجَلَسَ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَنَّتْ حَنِينَ الْعِشَارِ حَتَّى وَضَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ عَلَيْهَا فَسَكَنَتْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] telah menceritakan kepada kami [Sulaiman bin Katsir] dari [Yahya bin Sa'id] dari [Hafs bin ubaidhullah] dari [Jabir bin Abdullah] Radliyallahu'anhu ia berkata; Dahulu Nabi shallallahu 'alaihi wasallam berkhutbah dengan bersandar pada batang kayu, maka tatkala telah dibuatkan mimbar Rasulullah shallallahu 'alaihi wasallam duduk di atasnya, lalu batang kayu tersebut merintih seperti rintihan seekor unta betina, sehingga Rasulullah shallallahu 'alaihi wasallam meletakkan tangan beliau padanya dan ia pun diam. "
            },
            {
                "number": 35,
                "arab": " أَخْبَرَنَا فَرْوَةُ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا عَنْ أَبِيهِ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ أَبِي كَرِبٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ حَنَّتْ الْخَشَبَةُ حَنِينَ النَّاقَةِ الْخَلُوجِ",
                "id": "Telah mengabarkan kepada kami [Farwah] telah menceritakan kepada kami [Yahya bin Zakaria] dari [ayahnya] dari [Abu Ishaq] dari [Sa'id bin Abu Karb] dari [Jabir bin Abdullah] Radliyallahu'anhu ia berkata; Batang kayu itu merintih bagaikan rintihan unta betina yang diambil anaknya. "
            },
            {
                "number": 36,
                "arab": " أَخْبَرَنَا زَكَرِيَّا بْنُ عَدِيٍّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ الطُّفَيْلِ بْنِ أُبَيِّ بْنِ كَعْبٍ عَنْ أَبِيهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي إِلَى جِذْعٍ وَيَخْطُبُ إِلَيْهِ إِذْ كَانَ الْمَسْجِدُ عَرِيشًا فَقَالَ لَهُ رَجُلٌ مِنْ أَصْحَابِهِ أَلَا نَجْعَلُ لَكَ عَرِيشًا تَقُومُ عَلَيْهِ يَرَاكَ النَّاسُ يَوْمَ الْجُمُعَةِ وَتُسْمِعُ مِنْ خُطْبَتِكَ قَالَ نَعَمْ فَصَنَعَ لَهُ الثَّلَاثَ دَرَجَاتٍ هُنَّ اللَّوَاتِي عَلَى الْمِنْبَرِ فَلَمَّا صُنِعَ الْمِنْبَرُ وَوُضِعَ فِي مَوْضِعِهِ الَّذِي وَضَعَهُ فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَلَمَّا جَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُرِيدُ الْمِنْبَرَ مَرَّ عَلَيْهِ فَلَمَّا جَاوَزَهُ خَارَ الْجِذْعُ حَتَّى تَصَدَّعَ وَانْشَقَّ فَرَجَعَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَسَحَهُ بِيَدِهِ حَتَّى سَكَنَ ثُمَّ رَجَعَ إِلَى الْمِنْبَرِ قَالَ فَكَانَ إِذَا صَلَّى صَلَّى إِلَيْهِ فَلَمَّا هُدِمَ الْمَسْجِدُ أَخَذَ ذَلِكَ الْجِذْعَ أُبَيُّ بْنُ كَعْبٍ فَلَمْ يَزَلْ عِنْدَهُ حَتَّى بَلِيَ وَأَكَلَتْهُ الْأَرَضَةُ وَعَادَ رُفَاتًا",
                "id": "Telah mengabarkan kepada kami [Zakaria bin 'Adi] dari [ubaidhullah bin Amr] dari [Abdullah bin Muhammad bin 'Aqil] dari [Ath Thufail bin Ubay bin Ka'ab] dari [ayahnya] Radliyallahu'anhu ia berkata; Dahulu Rasulullah shallallahu 'alaihi wasallam sholat bersandar pada batang kurma dan begitu juga ketika berkhutbah saat masjid masih belum memiliki tempat berteduh. Lalu seorang laki-laki dari sahabat beliau berkata kepadanya; \"Sudikah baginda kami buatkan tempat berteduh (mimbar) dan diletakkanlah mimbar itu di tempat baginda bisa berdiri di atasnya dan orang-orang dapat melihat baginda pada (khutbah) hari jum`at dan mereka dapat mendengarkan kkhutbah baginda. Beliau menjawab: \"Ya, boleh\". Maka dibuatkanlah untuk beliau tiga anak tangga yang berada pada mimbar dan diletakkan di tempat Nabi shallallahu 'alaihi wasallam meletakkannya (batang kurma). Tatkala beliau datang menuju mimbar, beliau melewati batang kurma itu, maka batang kurma itu menangis hingga terbanting dan terbelah. Lalu Rasulullah shallallahu 'alaihi wasallam kembali kepadanya. Beliau mengusapnya dengan tangannya hingga pohon kurma itu tenang kembali dan nabi ke mimbar semula. Dan Nabi jika sholat, ia menghadap pohon itu. Tatkala masjid diruntuhkan Ubai bin Ka'ab mengambil batang kurma itu dan menyimpannya sampai lapuk serta dimakan rayap sampai hancur. "
            },
            {
                "number": 37,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ مُجَالِدٍ عَنْ أَبِي الْوَدَّاكِ عَنْ أَبِي سَعِيدٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ إِلَى لِزْقِ جِذْعٍ فَأَتَاهُ رَجُلٌ رُومِيٌّ فَقَالَ أَصْنَعُ لَكَ مِنْبَرًا تَخْطُبُ عَلَيْهِ فَصَنَعَ لَهُ مِنْبَرًا هَذَا الَّذِي تَرَوْنَ قَالَ فَلَمَّا قَامَ عَلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ حَنَّ الْجِذْعُ حَنِينَ النَّاقَةِ إِلَى وَلَدِهَا فَنَزَلَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَضَمَّهُ إِلَيْهِ فَسَكَنَ فَأُمِرَ بِهِ أَنْ يُحْفَرَ لَهُ وَيُدْفَنَ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Sa'id] telah menceritakan kepada kami [Abu Usamah] dari [Mujalid] dari [Abu Al Waddak] dari [Abu Sa'id] ia berkata; Dahulu Rasulullah shallallahu 'alaihi wasallam berkhutbah dengan bersandar pada sebatang batang kurma, lalu seorang dari Romawi mendatangi beliau dan berkata; Saya akan buatkan mimbar dan baginda dapat berkhutbah di atas, maka dia pun membuatkan mimbar sebagaimana yang kalian lihat ini. Perawi berkata; maka tatkala Nabi shallallahu 'alaihi wasallam berdiri (di mimbar) berkkhutbah, batang kurma itu merintih bagaikan unta betina yang kehilangan anaknya. lalu Rasulullah shallallahu 'alaihi wasallam turun mendekatinya serta memeluknya maka ia pun diam, lalu Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk membuat lubang dan menguburnya. "
            },
            {
                "number": 38,
                "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الصَّعْقُ قَالَ سَمِعْتُ الْحَسَنَ يَقُولُ لَمَّا أَنْ قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ جَعَلَ يُسْنِدُ ظَهْرَهُ إِلَى خَشَبَةٍ وَيُحَدِّثُ النَّاسَ فَكَثُرُوا حَوْلَهُ فَأَرَادَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُسْمِعَهُمْ فَقَالَ ابْنُوا لِي شَيْئًا أَرْتَفِعُ عَلَيْهِ قَالُوا كَيْفَ يَا نَبِيَّ اللَّهِ قَالَ عَرِيشٌ كَعَرِيشِ مُوسَى فَلَمَّا أَنْ بَنَوْا لَهُ قَالَ الْحَسَنُ حَنَّتْ وَاللَّهِ الْخَشَبَةُ قَالَ الْحَسَنُ سُبْحَانَ اللَّهِ هَلْ تُبْتَغَى قُلُوبُ قَوْمٍ سَمِعُوا قَالَ أَبُو مُحَمَّد يَعْنِي هَذَا",
                "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Ash Sh'aq] ia berkata; saya mendengar [Al Hasan] berkata; Tatkala Nabi shallallahu 'alaihi wasallam datang ke Madinah beliau menyandarkan punggungnya pada sebatang pohon sambil memberikan wejangan kepada orang-orang. Lambat laun semakin banyaklah hadirin yang berada di sekeliling beliau. Hal ini menjadikan beliau berniat agar semua -tanpa terkecuali-mendengar ucapannya. Maka beliau shallallahu 'alaihi wasallam sabdakan \"Tolong, buatkan untukku mimbar yang tinggi sebagaimana yang dimiliki Musa! \" Tatkala mereka membuatnya, Batang pohon itu demi Allah -kata Alhasan- merintih. Al Hasan berkata lagi; Maha suci Allah Subhanahu wa Ta'ala, apakah hati orang-orang yang mendengar itu masih bisa diharapkan (patuh)? Abu Muhammad berkata; maksudnya orang-orang yang mendengar (kisah) ini. "
            },
            {
                "number": 39,
                "arab": " أَخْبَرَنَا الْحَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَمَّارِ بْنِ أَبِي عَمَّارٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ إِلَى جِذْعٍ قَبْلَ أَنْ يَتَّخِذَ الْمِنْبَرَ فَلَمَّا اتَّخَذَ الْمِنْبَرَ وَتَحَوَّلَ إِلَيْهِ حَنَّ الْجِذْعُ فَاحْتَضَنَهُ فَسَكَنَ وَقَالَ لَوْ لَمْ أَحْتَضِنْهُ لَحَنَّ إِلَى يَوْمِ الْقِيَامَةِ أَخْبَرَنَا الْحَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ أَنَسٍ بِمِثْلِهِ",
                "id": "Telah mengabarkan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] dari ['Amar bin Abu 'Amar] dari [Ibnu Abbas] Bahwa Nabi shallallahu 'alaihi wasallam dulu pernah berkhutbah bersandar pada sebatang pohon sebelum beliau dibuatkan mimbar. Tatkala beliau dibuatkan mimbar dan beralih padanya, batang pohon itu merintih, hingga beliau memeluknya dan ia diam. Beliau tambahkan: \"Kalau tidak aku peluk niscaya ia menangis sampai hari kiamat. \" Telah mengabarkan kepada kami [Al Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad] dari [Tsabit] dari [Anas bin Malik] Radliyallahu'anhu seperti hadits di atas. "
            },
            {
                "number": 40,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ حَنَّتْ الْخَشَبَةُ الَّتِي كَانَ يَقُومُ عِنْدَهَا فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْهَا فَوَضَعَ يَدَهُ عَلَيْهَا فَسَكَنَتْ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami [Al Mas'udi] dari [Abu Hazim] dari [Sahl bin Sa'id] ia berkata; Batang pohon yang dulu beliau jadikan untuk bersandar saat berdiri merintih, lalu Rasulullah shallallahu 'alaihi wasallam berdiri mendekatinya dan meletakkan tangan beliau padanya, sehingga pohon itu pun diam. "
            },
            {
                "number": 41,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ أَبَانَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ الْمُحَارِبِيُّ عَنْ عَبْدِ الْوَاحِدِ بْنِ أَيْمَنَ الْمَكِّيِّ عَنْ أَبِيهِ قَالَ قُلْتُ لِجَابِرِ بْنِ عَبْدِ اللَّهِ حَدِّثْنِي بِحَدِيثٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعْتَهُ مِنْهُ أَرْوِيهِ عَنْكَ فَقَالَ جَابِرٌ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْخَنْدَقِ نَحْفُرُهُ فَلَبِثْنَا ثَلَاثَةَ أَيَّامٍ لَا نَطْعَمُ طَعَامًا وَلَا نَقْدِرُ عَلَيْهِ فَعَرَضَتْ فِي الْخَنْدَقِ كُدْيَةٌ فَجِئْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذِهِ كُدْيَةٌ قَدْ عَرَضَتْ فِي الْخَنْدَقِ فَرَشَشْنَا عَلَيْهَا الْمَاءَ فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَطْنُهُ مَعْصُوبٌ بِحَجَرٍ فَأَخَذَ الْمِعْوَلَ أَوْ الْمِسْحَاةَ ثُمَّ سَمَّى ثَلَاثًا ثُمَّ ضَرَبَ فَعَادَتْ كَثِيبًا أَهْيَلَ فَلَمَّا رَأَيْتُ ذَلِكَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ يَا رَسُولَ اللَّهِ ايْذَنْ لِي قَالَ فَأَذِنَ لِي فَجِئْتُ امْرَأَتِي فَقُلْتُ ثَكِلَتْكِ أُمُّكِ فَقُلْتُ قَدْ رَأَيْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا لَا صَبْرَ لِي عَلَيْهِ فَهَلْ عِنْدَكِ مِنْ شَيْءٍ فَقَالَتْ عِنْدِي صَاعٌ مِنْ شَعِيرٍ وَعَنَاقٌ قَالَ فَطَحَنَّا الشَّعِيرَ وَذَبَحْنَا الْعَنَاقَ وَسَلَخْتُهَا وَجَعَلْتُهَا فِي الْبُرْمَةِ وَعَجَنْتُ الشَّعِيرَ ثُمَّ رَجَعْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَبِثْتُ سَاعَةً ثُمَّ اسْتَأْذَنْتُهُ الثَّانِيَةَ فَأَذِنَ لِي فَجِئْتُ فَإِذَا الْعَجِينُ قَدْ أَمْكَنَ فَأَمَرْتُهَا بِالْخَبْزِ وَجَعَلْتُ الْقِدْرَ عَلَى الْأَثَاثِي قَالَ أَبُو عَبْدِ الرَّحْمَنِ إِنَّمَا هِيَ الْأَثَافِيُّ وَلَكِنْ هَكَذَا قَالَ ثُمَّ جِئْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنَّ عِنْدَنَا طُعَيِّمًا لَنَا فَإِنْ رَأَيْتَ أَنْ تَقُومَ مَعِي أَنْتَ وَرَجُلٌ أَوْ رَجُلَانِ مَعَكَ فَقَالَ وَكَمْ هُوَ قُلْتُ صَاعٌ مِنْ شَعِيرٍ وَعَنَاقٌ فَقَالَ ارْجِعْ إِلَى أَهْلِكَ وَقُلْ لَهَا لَا تَنْزِعْ الْقِدْرَ مِنْ الْأَثَافِيِّ وَلَا تُخْرِجْ الْخُبْزَ مِنْ التَّنُّورِ حَتَّى آتِيَ ثُمَّ قَالَ لِلنَّاسِ قُومُوا إِلَى بَيْتِ جَابِرٍ قَالَ فَاسْتَحْيَيْتُ حَيَاءً لَا يَعْلَمُهُ إِلَّا اللَّهُ فَقُلْتُ لِامْرَأَتِي ثَكِلَتْكِ أُمُّكِ قَدْ جَاءَكِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَصْحَابِهِ أَجْمَعِينَ فَقَالَتْ أَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلَكَ كَمْ الطَّعَامُ فَقُلْتُ نَعَمْ فَقَالَتْ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَدْ أَخْبَرْتَهُ بِمَا كَانَ عِنْدَنَا قَالَ فَذَهَبَ عَنِّي بَعْضُ مَا كُنْتُ أَجِدُ وَقُلْتُ لَقَدْ صَدَقْتِ فَجَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَخَلَ ثُمَّ قَالَ لِأَصْحَابِهِ لَا تَضَاغَطُوا ثُمَّ بَرَّكَ عَلَى التَّنُّورِ وَعَلَى الْبُرْمَةِ قَالَ فَجَعَلْنَا نَأْخُذُ مِنْ التَّنُّورِ الْخُبْزَ وَنَأْخُذُ اللَّحْمَ مِنْ الْبُرْمَةِ فَنُثَرِّدُ وَنَغْرِفُ لَهُمْ وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَجْلِسْ عَلَى الصَّحْفَةِ سَبْعَةٌ أَوْ ثَمَانِيَةٌ فَإِذَا أَكَلُوا كَشَفْنَا عَنْ التَّنُّورِ وَكَشَفْنَا عَنْ الْبُرْمَةِ فَإِذَا هُمَا أَمْلَأُ مَا كَانَا فَلَمْ نَزَلْ نَفْعَلُ ذَلِكَ كُلَّمَا فَتَحْنَا التَّنُّورَ وَكَشَفْنَا عَنْ الْبُرْمَةِ وَجَدْنَاهُمَا أَمْلَأَ مَا كَانَا حَتَّى شَبِعَ الْمُسْلِمُونَ كُلُّهُمْ وَبَقِيَ طَائِفَةٌ مِنْ الطَّعَامِ فَقَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ النَّاسَ قَدْ أَصَابَتْهُمْ مَخْمَصَةٌ فَكُلُوا وَأَطْعِمُوا فَلَمْ نَزَلْ يَوْمَنَا ذَلِكَ نَأْكُلُ وَنُطْعِمُ قَالَ وَأَخْبَرَنِي أَنَّهُمْ كَانُوا ثَمَانَ مِائَةٍ أَوْ قَالَ ثَلَاثَ مِائَةٍ قَالَ أَيْمَنُ لَا أَدْرِي أَيُّهُمَا قَالَ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Umar bin Abaan] telah menceritakan kepada kami [Abdur Rahman bin Muhammad Al Muharibi] dari [Abdul Wahid bin Aiman Al Makki] dari [ayahnya] ia berkata; aku berkata kepada Jabir bin Abdullah Radliyallahu'anhu: ia berkata; Riwayatkanlah kepadaku sebuah hadits dari Rasulullah shallallahu 'alaihi wasallam yang kamu dengar dari beliau dan dapat saya riwayatkan dari kamu. Jabir berkata; Dahulu kami bersama Rasulullah shallallahu 'alaihi wasallam pada perang Khandaq dan kami sedang menggali parit. Selama tiga hari kami tidak makan dan tidak mampu untuk mendapatkan makanan. Kemudian dalam parit saya menemukan sebongkah tanah yang keras, maka saya pun mendatangi Rasulullah shallallahu 'alaihi wasallam. Saya berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, tanah keras ini telah menghalangi penggalian parit ini, padahal sudah kami siram dengan air\". Lalu Nabi shallallahu 'alaihi wasallam berdiri dengan perut yang diikat dengan batu lalu beliau mengambil cangkul kemudian membaca Bismillah sebanyak tiga kali. Beliau memukulnya lalu menjadikannya debu yang lembut. Ketika saya melihat kondisi Rasulullah shallallahu 'alaihi wasallam yang demikian itu, saya berkata kepada beliau; \"Wahai Rasulullah izinkanlah saya pulang sebentar, lalu beliau mengizinkan saya (untuk pulang sebentar). \" Kemudian saya datangi istri, aku berkata; \"Keadaan betul-betul gawat\". Dan saya berkata kepada istriku; \"Saya telah menyaksikan keadaan Rasulullah shallallahu 'alaihi wasallam yang membuat diri saya tidak dapat menahannya apakah kamu memiliki sesuatu untuk dimakan?\" Ia menjawab; \"Ada, sekedar satu sha` tepung yang masih kasar dan seekor anak kambing betina. \" Jabir berkata: \"Lalu kami menumbuk tepung yang masih kasar itu agar layak dikunyah dan kami sembelih anak kambing, kami kuliti dan kutaruh di periuk. Saya terus mengadon tepung kemudian saya kembali menemui Rasulullah shallallahu 'alaihi wasallam dan diam beberapa saat. Kemudian saya minta izin lagi untuk pulang kedua kalinya. Beliau mengizinkan saya, maka ketika saya menemui isteri saya ternyata adonan gandum telah siap, lalu saya memerintahkan isteri saya untuk membuat roti, dan saya letakkan periuk di atas batu pemasak. Abdurrahman mengatakan; maksudnya adalah di atas tungku\/dapur. Kemudian Jabir berkata; kemudian saya menemui Nabi shallallahu 'alaihi wasallam. lagi, lalu saya katakan kepada beliau: \"Saya punya makanan tak seberapa, aduhai sekiranya baginda mau ya Rasulullah, baginda bisa datang ke rumah saya bersama seseorang atau dua orang saja. \" Beliau bertanya: \"Memangnya berapa banyak makanannya?\" Saya menjawab; \"Sekedar satu sha`gandum dan seekor anak kambing. \" Lalu Rasul berkata: \"Begini saja, pulanglah kamu ke keluargamu dan katakan kepadanya agar jangan mengangkat periuk dari dapur dan jangan mengangkat roti dari panggangannya sampai saya datang. \" Kemudian beliau berkata kepada para sahabat: \"Marilah kita pergi ke rumah Jabir. \" Jabir berkata: \"Saya pun malu dengan malu sangat serius, yang tidak ada yang mengetahui kecuali Allah. \"- (karena nabi mengajak sahabatnya, padahal jumlah masakan tak seberapa banyaknya) --- Saya katakan kepada isteri saya: \"Wah,,, persoalan jadi gawat nich,,, Rasulullah datang dengan para keseluruhan sahabat-sahabatnya. \" Isteri saya berkata: \"Tadi apakah Rasul bertanya kepadamu berapa banyak makanan kita?\". Saya jawab \"Iya, telah kujelaskan \"! lalu isteriku berkata: \"Allah dan Rasul-Nya yang lebih tahu, yang jelas engkau telah melaporkan kepada beliau seberapa banyak makanan yang kita punya\". Jabir berkata; \"Perkataannya isteriku itu menjadikanku tenang dari segala yang saya khawatirkan. \" Lalu saya katakan kepadanya: \"Sungguh adinda benar. \" Nabi shallallahu 'alaihi wasallam kemudian datang dan masuk, lalu mengatakan kepada para sahabatnya \"Awas, jangan kalian berdesak-desakkan ya! \" Kemudian Rasulullah shallallahu 'alaihi wasallam memberkahi panggangan roti dan periuk. Jabir berkata: \"Lalu kami mengambil roti dari panggangan dan daging dari periuk, lalu kami aduk dan kami sendokkan untuk mereka. \" Kemudian Nabi shallallahu 'alaihi wasallam berkata \"Hendaklah masing-masing tujuh atau delapan orang duduk berkumpul pada satu piring, \" Ketika mereka sudah memakannya, kami buka lagi tutup panggangan dan periuk ternyata keduanya masih dalam keadaan penuh seperti semula. Dan keadaan tersebut berlangsung terus-menerus berlangsung sampai seluruh kaum muslimin kenyang dan makanan tersisa tinggal sebagian. Maka berkatalah Rasulullah shallallahu 'alaihi wasallam kepada kami: \"Sesungguhnya orang-orang telah kenyang semua, kini makanlah kamu dan keluargamu! \" Maka pada hari itu kami makan dengan roti dan daging tersebut berkali-kali. Jabir berkata; \"Saya diberitahu bahwa jumlah para sahabat yang makan di rumah jabir sekitar delapan ratus orang atau tiga ratus orang. \" Aiman berkata: saya tidak tahu mana yang benar dari diantara jumlah tersebut. "
            },
            {
                "number": 42,
                "arab": " أَخْبَرَنَا زَكَرِيَّا بْنُ عَدِيٍّ حَدَّثَنَا عُبَيْدُ اللَّهِ هُوَ ابْنُ عَمْرٍو عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ أَمَرَ أَبُو طَلْحَةَ أُمَّ سُلَيْمٍ أَنْ تَجْعَلَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامًا يَأْكُلُ مِنْهُ قَالَ ثُمَّ بَعَثَنِي أَبُو طَلْحَةَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَيْتُهُ فَقُلْتُ بَعَثَنِي إِلَيْكَ أَبُو طَلْحَةَ فَقَالَ لِلْقَوْمِ قُومُوا فَانْطَلَقَ وَانْطَلَقَ الْقَوْمُ مَعَهُ فَقَالَ أَبُو طَلْحَةَ يَا رَسُولَ اللَّهِ إِنَّمَا صَنَعْتُ طَعَامًا لِنَفْسِكَ خَاصَّةً فَقَالَ لَا عَلَيْكَ انْطَلِقْ قَالَ فَانْطَلَقَ وَانْطَلَقَ الْقَوْمُ قَالَ فَجِيءَ بِالطَّعَامِ فَوَضَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ وَسَمَّى عَلَيْهِ ثُمَّ قَالَ ائْذَنْ لِعَشَرَةٍ قَالَ فَأَذِنَ لَهُمْ فَقَالَ كُلُوا بِاسْمِ اللَّهِ فَأَكَلُوا حَتَّى شَبِعُوا ثُمَّ قَامُوا ثُمَّ وَضَعَ يَدَهُ كَمَا صَنَعَ فِي الْمَرَّةِ الْأُولَى وَسَمَّى عَلَيْهِ ثُمَّ قَالَ ائْذَنْ لِعَشَرَةٍ فَأَذِنَ لَهُمْ فَقَالَ كُلُوا بِاسْمِ اللَّهِ فَأَكَلُوا حَتَّى شَبِعُوا ثُمَّ قَامُوا حَتَّى فَعَلَ ذَلِكَ بِثَمَانِينَ رَجُلًا قَالَ وَأَكَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَهْلُ الْبَيْتِ وَتَرَكُوا سُؤْرًا",
                "id": "Telah mengabarkan kepada kami [Zakaria bin 'Adi] telah menceritakan kepada kami [ubaidhullah Ibnu 'Amr] dari [Abdul Malik bin Umair] dari [Abdur Rahman bin Abu Laila] dari [Anas bin Malik] ia berkata; Abu Thalhah memerintahkan kepada Ummu Sulaim agar ia membuatkan untuk Rasulullah shallallahu 'alaihi wasallam makanan yang bisa beliau makan. Ia berkata; kemudian Abu Thalhah mengutusku kepada Rasulullah shallallahu 'alaihi wasallam. Saya temui beliau, kemudian saya berkata; Abu Thalhah mengutus saya kepada baginda, maka beliau menyeru; \"Wahai kaum muslimin, ayo kita berangkat. \" Dan beliau berangkat, maka berangkatlah para sahabat. Perawi berkata; maka didatangkanlah makanan tersebut lalu Rasulullah shallallahu 'alaihi wasallam meletakkan tangan di atasnya dan mendoakan (keberkahan) makanan tersebut dan berkata; \" Berikan kepada sepuluh orang. \" Perawi berkata; maka makanan itu diberikan kepada mereka. Lalu beliau berkata: \"Makanlah dengan menyebut nama Allah Subhanahu wa Ta'ala\". Lalu mereka makan sampai kenyang, kemudian mereka bangkit sehingga beliau dapat melakukan hal itu terhadap delapan puluh orang. Perawi berkata; Rasulullah shallallahu 'alaihi wasallam makan bersama pemilik rumah dan masih menyisakan semangkuk besar. "
            },
            {
                "number": 43,
                "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبَانُ هُوَ الْعَطَّارُ حَدَّثَنَا قَتَادَةُ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَبِي عُبَيْدٍ أَنَّهُ طَبَخَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِدْرًا فَقَالَ لَهُ نَاوِلْنِي الذِّرَاعَ وَكَانَ يُعْجِبُهُ الذِّرَاعُ فَنَاوَلَهُ الذِّرَاعَ ثُمَّ قَالَ نَاوِلْنِي الذِّرَاعَ فَنَاوَلَهُ ذِرَاعًا ثُمَّ قَالَ نَاوِلْنِي الذِّرَاعَ فَقُلْتُ يَا نَبِيَّ اللَّهِ وَكَمْ لِلشَّاةِ مِنْ ذِرَاعٍ فَقَالَ وَالَّذِي نَفْسِي بِيَدِهِ أَنْ لَوْ سَكَتَّ لَأُعْطِيتُ أَذْرُعًا مَا دَعَوْتُ بِهِ",
                "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Abaan Al 'Athar] telah menceritakan kepada kami [Qatadah] dari [Syahr bin Hausyab] dari [Abu Ubaid] Bahwasanya ia memasak satu periuk untuk Nabi shallallahu 'alaihi wasallam. Lalu beliau berkata kepadanya: \"Berikan saya sampilnya\" dan kesukaan beliau adalah daging bagian sampil. Ia pun memberi baginda nabi shallallahu 'alaihi wasallam bagian tulang hasta (sampil). Kemudian beliau berkata: \"Tolong berikan saya daging tulang hasta\" maka ia memberi beliau daging tulang hasta. \" lalu beliau berkata lagi: \"Berikan saya daging tulang belakang\", maka saya berkata; \"Wahai Nabi Allah Subhanahu wa Ta'ala (memang) berapa tulang hasta yang dimiliki seekor kambing?\" beliau menjawab: \"Demi Dzat yang diriku berada dalam genggaman tangan-Nya, jika kamu diam niscaya kamu dapat menyediakan daging tulang hasta sebagaimana yang saya minta. \" "
            },
            {
                "number": 44,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْأَسْوَدِ عَنْ نُبَيْحٍ الْعَنَزِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمُشْرِكِينَ لِيُقَاتِلَهُمْ فَقَالَ أَبِي عَبْدُ اللَّهِ يَا جَابِرُ لَا عَلَيْكَ أَنْ تَكُونَ فِي نَظَّارِي أَهْلِ الْمَدِينَةِ حَتَّى تَعْلَمَ إِلَى مَا يَصِيرُ أَمْرُنَا فَإِنِّي وَاللَّهِ لَوْلَا أَنِّي أَتْرُكُ بَنَاتٍ لِي بَعْدِي لَأَحْبَبْتُ أَنْ تُقْتَلَ بَيْنَ يَدَيَّ قَالَ فَبَيْنَمَا أَنَا فِي النَّظَّارِينَ إِذْ جَاءَتْ عَمَّتِي بِأَبِي وَخَالِي لِتَدْفِنَهُمَا فِي مَقَابِرِنَا فَلَحِقَ رَجُلٌ يُنَادِي إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُكُمْ أَنْ تَرُدُّوا الْقَتْلَى فَتَدْفِنُوهَا فِي مَضَاجِعِهَا حَيْثُ قُتِلَتْ فَرَدَدْنَاهُمَا فَدَفَنَّاهُمَا فِي مَضْجَعِهِمَا حَيْثُ قُتِلَا فَبَيْنَا أَنَا فِي خِلَافَةِ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ إِذْ جَاءَنِي رَجُلٌ فَقَالَ يَا جَابِرُ بْنَ عَبْدِ اللَّهِ لَقَدْ أَثَارَ أَبَاكَ عُمَّالُ مُعَاوِيَةَ فَبَدَا فَخَرَجَ طَائِفَةٌ مِنْهُمْ فَانْطَلَقْتُ إِلَيْهِ فَوَجَدْتُهُ عَلَى النَّحْوِ الَّذِي دَفَنْتُهُ لَمْ يَتَغَيَّرْ إِلَّا مَا لَمْ يَدَعْ الْقَتِيلَ قَالَ فَوَارَيْتُهُ وَتَرَكَ أَبِي عَلَيْهِ دَيْنًا مِنْ التَّمْرِ فَاشْتَدَّ عَلَيَّ بَعْضُ غُرَمَائِهِ فِي التَّقَاضِي فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أَبِي أُصِيبَ يَوْمَ كَذَا وَكَذَا وَإِنَّهُ تَرَكَ عَلَيْهِ دَيْنًا مِنْ التَّمْرِ وَإِنَّهُ قَدْ اشْتَدَّ عَلَيَّ بَعْضُ غُرَمَائِهِ فِي الطَّلَبِ فَأُحِبُّ أَنْ تُعِينَنِي عَلَيْهِ لَعَلَّهُ أَنْ يُنْظِرَنِي طَائِفَةً مِنْ تَمْرِهِ إِلَى هَذَا الصِّرَامِ الْمُقْبِلِ قَالَ نَعَمْ آتِيكَ إِنْ شَاءَ اللَّهُ قَرِيبًا مِنْ وَسَطِ النَّهَارِ قَالَ فَجَاءَ وَمَعَهُ حَوَارِيُّوهُ قَالَ فَجَلَسُوا فِي الظِّلِّ وَسَلَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاسْتَأْذَنَ ثُمَّ دَخَلَ عَلَيْنَا قَالَ وَقَدْ قُلْتُ لِامْرَأَتِي إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَائِيَّ الْيَوْمَ وَسَطَ النَّهَارِ فَلَا يَرَيَنَّكِ وَلَا تُؤْذِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شَيْءٍ وَلَا تُكَلِّمِيهِ فَفَرَشَتْ فِرَاشًا وَوِسَادَةً وَوَضَعَ رَأْسَهُ فَنَامَ فَقُلْتُ لِمَوْلًى لِي اذْبَحْ هَذِهِ الْعَنَاقَ وَهِيَ دَاجِنٌ سَمِينَةٌ فَالْوَحَى وَالْعَجَلَ افْرُغْ مِنْهَا قَبْلَ أَنْ يَسْتَيْقِظَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَعَكَ فَلَمْ نَزَلْ فِيهَا حَتَّى فَرَغْنَا مِنْهَا وَهُوَ نَائِمٌ فَقُلْتُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ يَسْتَيْقِظُ يَدْعُو بِطَهُورِهِ وَأَنَا أَخَافُ إِذَا فَرَغَ أَنْ يَقُومَ فَلَا يَفْرُغَ مِنْ طُهُورِهِ حَتَّى يُوضَعَ الْعَنَاقُ بَيْنَ يَدَيْهِ فَلَمَّا اسْتَيْقَظَ قَالَ يَا جَابِرُ ايْتِنِي بِطَهُورٍ قَالَ نَعَمْ فَلَمْ يَفْرُغْ مِنْ وُضُوئِهِ حَتَّى وُضِعَتْ الْعَنَاقُ بَيْنَ يَدَيْهِ قَالَ فَنَظَرَ إِلَيَّ فَقَالَ كَأَنَّكَ قَدْ عَلِمْتَ حُبَّنَا اللَّحْمِ ادْعُ أَبَا بَكْرٍ ثُمَّ دَعَا حَوَارِيِّيهِ قَالَ فَجِيءَ بِالطَّعَامِ فَوُضِعَ قَالَ فَوَضَعَ يَدَهُ وَقَالَ بِسْمِ اللَّهِ كُلُوا فَأَكَلُوا حَتَّى شَبِعُوا وَفَضَلَ مِنْهَا لَحْمٌ كَثِيرٌ وَقَالَ وَاللَّهِ إِنَّ مَجْلِسَ بَنِي سَلَمَةَ لَيَنْظُرُونَ إِلَيْهِمْ هُوَ أَحَبُّ إِلَيْهِمْ مِنْ أَعْيُنِهِمْ مَا يَقْرَبُونَهُ مَخَافَةَ أَنْ يُؤْذُوهُ ثُمَّ قَامَ وَقَامَ أَصْحَابُهُ فَخَرَجُوا بَيْنَ يَدَيْهِ وَكَانَ يَقُولُ خَلُّوا ظَهْرِي لِلْمَلَائِكَةِ قَالَ فَاتَّبَعْتُهُمْ حَتَّى بَلَغْتُ سَقُفَّةَ الْبَابِ فَأَخْرَجَتْ امْرَأَتِي صَدْرَهَا وَكَانَتْ سَتِيرَةً فَقَالَتْ يَا رَسُولَ اللَّهِ صَلِّ عَلَيَّ وَعَلَى زَوْجِي قَالَ صَلَّى اللَّهُ عَلَيْكِ وَعَلَى زَوْجِكِ ثُمَّ قَالَ ادْعُوا لِي فُلَانًا لِلْغَرِيمِ الَّذِي اشْتَدَّ عَلَيَّ فِي الطَّلَبِ فَقَالَ أَنْسِ جَابِرًا طَائِفَةً مِنْ دَيْنِكَ الَّذِي عَلَى أَبِيهِ إِلَى هَذَا الصِّرَامِ الْمُقْبِلِ قَالَ مَا أَنَا بِفَاعِلٍ قَالَ وَاعْتَلَّ وَقَالَ إِنَّمَا هُوَ مَالُ يَتَامَى فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْنَ جَابِرٌ قَالَ قُلْتُ أَنَا ذَا يَا رَسُولَ اللَّهِ قَالَ كِلْ لَهُ مِنْ الْعَجْوَةِ فَإِنَّ اللَّهَ تَعَالَى سَوْفَ يُوَفِّيهِ فَرَفَعَ رَأْسَهُ إِلَى السَّمَاءِ فَإِذَا الشَّمْسُ قَدْ دَلَكَتْ قَالَ الصَّلَاةُ يَا أَبَا بَكْرٍ قَالَ فَانْدَفَعُوا إِلَى الْمَسْجِدِ فَقُلْتُ لِغَرِيمِي قَرِّبْ أَوْعِيَتَكَ فَكِلْتُ لَهُ مِنْ الْعَجْوَةِ فَوَفَّاهُ اللَّهُ وَفَضَلَ لَنَا مِنْ التَّمْرِ كَذَا وَكَذَا قَالَ فَجِئْتُ أَسْعَى إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَسْجِدِهِ كَأَنِّي شَرَارَةٌ فَوَجَدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ صَلَّى فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي قَدْ كِلْتُ لِغَرِيمِي تَمْرَهُ فَوَفَّاهُ اللَّهُ وَفَضَلَ لَنَا مِنْ التَّمْرِ كَذَا وَكَذَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْنَ عُمَرُ بْنُ الْخَطَّابِ قَالَ فَجَاءَ يُهَرْوِلُ قَالَ سَلْ جَابِرَ بْنَ عَبْدِ اللَّهِ عَنْ غَرِيمِهِ وَتَمْرِهِ قَالَ مَا أَنَا بِسَائِلِهِ قَدْ عَلِمْتُ أَنَّ اللَّهَ سَوْفَ يُوَفِّيهِ إِذْ أَخْبَرْتَ أَنَّ اللَّهَ سَوْفَ يُوَفِّيهِ فَرَدَّدَ عَلَيْهِ وَرَدَّدَ عَلَيْهِ هَذِهِ الْكَلِمَةَ ثَلَاثَ مَرَّاتٍ كُلُّ ذَلِكَ يَقُولُ مَا أَنَا بِسَائِلِهِ وَكَانَ لَا يُرَاجَعُ بَعْدَ الْمَرَّةِ الثَّالِثَةِ فَقَالَ مَا فَعَلَ غَرِيمُكَ وَتَمْرُكَ قَالَ قُلْتُ وَفَّاهُ اللَّهُ وَفَضَلَ لَنَا مِنْ التَّمْرِ كَذَا وَكَذَا فَرَجَعْتُ إِلَى امْرَأَتِي فَقُلْتُ أَلَمْ أَكُنْ نَهَيْتُكِ أَنْ تُكَلِّمِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِي فَقَالَتْ تَظُنُّ أَنَّ اللَّهَ تَعَالَى يُورِدُ نَبِيَّهُ فِي بَيْتِي ثُمَّ يَخْرُجُ وَلَا أَسْأَلُهُ الصَّلَاةَ عَلَيَّ وَعَلَى زَوْجِي",
                "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Al Aswad] dari [Nubaih Al 'Anazi] dari [Jabir bin Abdullah] Radliyallahu'anhu ia berkata; Rasulullah shallallahu 'alaihi wasallam keluar memerangi orang-orang musyrik. Ayah saya (Abdullah) berkata; \"Jangan kamu ikut berangkat perang wahai Jabir, kamu cukup sebagai penduduk Madinah yang tugasnya memantau informasi keadaan pasukan muslimin. Sehingga kamu betul-betul mengetahui bagaimana nasib kita. Saya demi Allah Subhanahu wa Ta'ala, kalaulah bukan karena aku akan meninggalkan anak-anak perempuan sepeninggalku, niscaya saya sangat senang kalau kamu ikut terbunuh di depanku (mati syahid di medan perang). Jabir berkata; Ketika saya berada bersama orang-orang yang tugasnya memantau keadaan dan kepulangan para pasukan, Tiba-tiba bibi saya datang dengan membawa jenazah ayah dan paman saya untuk ia kuburkan keduanya di pemakaman keluarga kami. Lalu ia bertemu seseorang yang berteriak-teriak mengumandangkan; \"Sesungguhnya Nabi shallallahu 'alaihi wasallam memerintahkan kalian untuk mengembalikan orang-orang yang wafat ke tempat ia terbunuh, dan kalian kubur di lokasi ia terbunuh. \" Maka kami segera mengembalikan jenazah ayah dan pamanku di lokasi ia terbunuh. Kami kubur persis di lokasi keduanya terbantai. Kemudian hari, sewaktu saya (Jabir) berada pada masa kekhilafahan Mu'awiyah bin Abu Sufyan Radliyallahu'anhu, tiba-tiba datang seseorang utusan kepada saya. Ia berkata; \"Wahai Jabir bin Abdullah, sungguh para tukang bangunan Mu'awiyah Radliyallahu'anhu saat membongkar pekuburan menemukan (jasad) ayah kamu hingga jasadnya kelihatan. Beberapa tukang bangunan itu ada yang pergi sehingga saya berkesempatan untuk melihat jasad ayahku. Uhh,, Uhh,,,, saya mendapatkan jasad ayahku masih sama persis seperti saya menguburnya, tidak berubah kecuali bekas-bekas orang yang terbunuh. Perawi (Jabir) berkata; maka saya pun menutupinya. Aku masih ingat bahwa ayahku meninggalkan hutang berupa kurma, beberapa orang yang meminjaminya memaksa saya untuk (segera) membayarnya. Lalu saya menemui Rasulullah shallallahu 'alaihi wasallam. Dan saya ungkapkan segala uneg-unegku; \"Wahai Rasulullah shallallahu 'alaihi wasallam sesungguhnya ayah saya meninggal pada satu peperangan, dan sungguh ia telah meninggalkan hutang berupa kurma, dan sungguh para pemilik piutang itu memaksa saya untuk (segera) melunasi hutang-hutang tersebut. Saya sangat senang jika baginda bersedia membantunya siapa tahu ia bersedia menangguhkan (tagihannya) sampai musim panen depan. Beliau berkata: \"Baiklah saya akan berikan kepada kamu insya Allah Subhanahu wa Ta'ala tidak lama lagi siang nanti. \" Perawi (Jabir) berkata; \"Beliau kemudian datang bersama para sahabat setia beliau. \" Perawi (Jabir) berkata; mereka menanti di tempat berteduh dan Rasulullah shallallahu 'alaihi wasallam memberi salam serta meminta izin, kemudian masuk ke rumah kami. Perawi (Jabir) berkata; \"Saya telah mengatakan kepada isteri saya bahwa Rasulullah shallallahu 'alaihi wasallam akan mengunjungi saya pada hari ini setelah lewat pertengahan hari, maka kamu jangan menampakkan diri, jangan menyinggung perasaan Rasulullah shallallahu 'alaihi wasallam dengan sesuatu (apapun) serta jangan pula berbicara kepada beliau. \" Kemudian saya menggelar hamparan dan menyediakan bantal, lalu beliau meletakkan kepalanya dan tidur. Lalu saya memerintahkan hamba sahaya saya; \"Sembelihlah anak kambing betina ini, ia adalah anak kambing yang jinak, banyak dagingnya dan tangkas. Tolong siapkan sebelum Rasulullah shallallahu 'alaihi wasallam bangun, dan jika beliau bangun beliau pasti meminta air untuk bersuci, sedang saya merasa khawatir jika beliau bangun dan selesai bersuci sedangkan daging anak kambing belum tersedia di hadapan beliau. \" Ketika beliau bangun dari tidurnya, maka beliau berkata: \"Wahai Jabir sediakan saya air untuk bersuci, saya menjawab; \"Ya, baiklah. \" Maka sebelum beliau menyelesaikan wudlunya saya letakkan (masakan) daging anak kambing di hadapan beliau. Perawi (Jabir) berkata; \"Beliau memandang saya lalu berkata; sepertinya kamu sudah tahu daging kesukaan kami, panggillah Abu Bakar Radliyallahu'anhu. Kemudian makanan didatangkan serta dihidangkan. Perawi (Jabir) berkata; Kemudian beliau berkata: Sebutlah nama Allah Subhanahu wa Ta'ala (Bismillah) dan makanlah. maka mereka makan sampai mereka kenyang dan tersisa daging yang banyak (dari hidangan tersebut). Perawi (Jabir) berkata; \"Demi Allah Subhanahu wa Ta'ala, sesungguhnya majelis bani Salamah mempunyai penilaian terhadap diri mereka sendiri bahwa nabi shallallahu 'alaihi wasallam lebih mereka cintai daripada mata mereka sendiri yang teramat sangat dekat dengan mereka, karena mereka sangat khawatir kalaulah mereka menyakitinya. Kemudian beliau bangkit berdiri dan begitu juga para sahabatnya, lalu mereka keluar dengan melewati beliau, dan beliau berujar \"Biarkan saya serahkan kelapangan dada saya (urusan saya) pada malaikat. \" Perawi (Jabir) berkata; Lalu saya mengantar kepulangan mereka sampai di papan dekat pintu, maka isteri saya menampakkan dirinya sedikit yang sebelumnya tertutup tabir dan berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, doakanlah untuk diri saya dan juga suami saya. \" Beliau menjawab; \"Semoga Allah Subhanahu wa Ta'ala memberikan shalawat-Nya atas dirimu dan suamimu. \" Lalu beliau berkata: \"Tolong panggilkan saya si fulan (ditujukan kepada orang yang menghutangi yang mendesak saya untuk segera melunasinya) \". Lalu beliau berkata: \"Tangguhkan untuk Jabir Radliyallahu'anhu sebagian hutang yang engkau hutangkan kepada ayahnya hingga musim panen mendatang. \" Dia berkata: \"Saya tidak bisa melakukannya ya Rasulullah! \" Beliau berkata: \"Atau anda kurangi\" dia berkata: \"Harta ini adalah milik orang yatim ya Rasulullah. \" lalu Rasul berkata: \"Mana Jabir?\" Jabir berkata: \"Aku ya Rasulullah\" Lalu Rasul berkata: \"Timbanglah untuknya kurma 'ajuwa (satu jenis kurma yang tumbuh di 'Aliyah Madinah) karena Allah Subhanahu wa Ta'ala pasti akan mencukupinya\", kemudian Rasulullah shallallahu 'alaihi wasallam mengangkat kepalanya ke atas dan ternyata matahari telah tergelincir maka beliau berkata: \"Mari kita sholat ya Abu Bakar Radliyallahu'anhu\", Jabir Radliyallahu'anhu berkata: \"Mereka pun semuanya pergi ke masjid\" lalu saya berkata kepada penghutang: \"Dekatkanlah bejanamu. \" Lalu kutimbangkan untuknya kurma 'ajuwa. Maka Allah Subhanahu wa Ta'ala mencukupkannya dan masih menyisakan kurma untuk kami sebagian. Jabir Radliyallahu'anhu berkata: \"Maka aku bergegas menemui Rasulullah shallallahu 'alaihi wasallam di masjidnya ini, seakan-akan saya orang yang hina, lalu saya dapati Rasulullah shallallahu 'alaihi wasallam selesai sholat, kemudian saya berkata kepada Rasulullah shallallahu 'alaihi wasallam; Sesungguhnya saya sudah menakar kurmanya dan Allah Subhanahu wa Ta'ala mencukupinya, dan tersisa untuk kami segini dan segini. \" Kemudian Rasulullah shallallahu 'alaihi wasallam bertanya: \"Dimana Umar bin Khaththab Radliyallahu'anhu?\" Perawi (Jabir) berkata; Umar datang sambil berlari kecil, maka beliau memerintahkan kepadanya, \"Tolong tanyakan Jabir bin Abdullah Radliyallahu'anhu tentang orang yang menghutangi (ayahnya) dan juga kurma miliknya. \" Umar menjawab; \"Saya tidak perlu menanyakannya dan saya merasa yakin bahwa Allah Subhanahu wa Ta'ala pasti akan memberikan kecukupan kepadanya, yaitu tatkala engkau memberitahukan bahwa Allah Subhanahu wa Ta'ala akan memberikan kecukupan padanya. \" Kemudian diulangi lagi pertanyaan itu kepadanya, maka Umar Radliyallahu'anhu mengulangi jawaban itu tiga kali, semua itu diucapkannya dengan kata; \"Saya tidak perlu menanyakannya. \" Rasulullah shallallahu 'alaihi wasallam tidak mengulangi lagi pertanyaannya setelah ketiga kalinya, maka beliau bertanya: \"Bagaimana keadaan orang yang menghutangi kamu dan juga kurmamu?\" Perawi berkata; Maka saya menjawab; Allah Subhanahu wa Ta'ala telah memberikan kecukupan kepadanya dan telah menyisakan kurma sebanyak begini dan begini. Kemudian saya pulang kepada isteriku dan berkata; \"Bukankah saya telah melarang kamu untuk berbicara dengan Rasulullah shallallahu 'alaihi wasallam di rumah saya?\" ia menjawab; Apakah kamu mengira bahwa Allah Subhanahu wa Ta'ala telah mendatangkan Rasul-Nya di rumah saya ini, lalu pergi tanpa saya memohon kepada beliau untuk bershalawat (mendoakan kesejahteraan) atas diri saya dan suami??. "
            },
            {
                "number": 45,
                "arab": " أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا يَزِيدُ بْنُ أَبِي حَكِيمٍ حَدَّثَنِي الْحَكَمُ بْنُ أَبَانَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ إِنَّ اللَّهَ فَضَّلَ مُحَمَّدًا عَلَى الْأَنْبِيَاءِ وَعَلَى أَهْلِ السَّمَاءِ فَقَالُوا يَا ابْنَ عَبَّاسٍ بِمَ فَضَّلَهُ عَلَى أَهْلِ السَّمَاءِ قَالَ إِنَّ اللَّهَ قَالَ لِأَهْلِ السَّمَاءِ { وَمَنْ يَقُلْ مِنْهُمْ إِنِّي إِلَهٌ مِنْ دُونِهِ فَذَلِكَ نَجْزِيهِ جَهَنَّمَ كَذَلِكَ نَجْزِي الظَّالِمِينَ } الْآيَةَ وَقَالَ اللَّهُ لِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ { إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ } قَالُوا فَمَا فَضْلُهُ عَلَى الْأَنْبِيَاءِ قَالَ قَالَ اللَّهُ عَزَّ وَجَلَّ { وَمَا أَرْسَلْنَا مِنْ رَسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ } الْآيَةَ وَقَالَ اللَّهُ عَزَّ وَجَلَّ لِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ { وَمَا أَرْسَلْنَاكَ إِلَّا كَافَّةً لِلنَّاسِ } فَأَرْسَلَهُ إِلَى الْجِنِّ وَالْإِنْسِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Yazid bin Abu Hakim] telah menceritakan kepadaku [Al Hakam bin Abaan] dari ['Ikrimah] dari [Ibnu Abbas] Radliyallahu'anhu ia berkata; \" Sesungguhnya Allah Subhanahu wa Ta'ala memberikan keutamaan kepada Nabi Muhammad shallallahu 'alaihi wasallam atas Nabi-nabi yang lainnya dan atas penghuni langit. \" lalu mereka bertanya: \"Wahai Ibnu Abbas, keutamaan apa yang diberikan kepada beliau atas penghuni langit?\" Ibnu Abbas menjawab; \"Sesungguhnya Allah Subhanahu wa Ta'ala telah berfirman kepada penghuni langit: Dari Ibnu Abbas berkata: WAMAN YAQUL MINHUM INNII ILAAHUN MIN DUNIHI FADZALIJKA NAJZIIHI JAHANNAMA KADZALIKA NAJZII AZHA-ZHALIMIIN Dan barang siapa diantara mereka mengatakan, sesungguhnya aku adalah tuhan selain dari pada Allah Subhanahu wa Ta'ala, maka orang itu kami beri balasan dengan jahannam, dengan demikian kami memberikan pembalasan kepada orang-orang zhalim. (Qs. Al Anbiya` \/21: 29) Dan Allah Subhanahu wa Ta'ala terhadap dosamu yang telah lalu dan yang akan datang serta menyempurnakan nikmat-Nya atasmu dan memimpin kamu ke jalan yang lurus. ` (Qs. Al Fath \/48: 1. 2) Lalu mereka bertanya, \" Apa keutamaan beliau atas semua Nabi-nabi?\" bin Abbas menjawab, \"Sesungguhnya Allah Subhanahu wa Ta'ala telah berfirman, `Kami tidak mengutus seorang Rasul pun, melainkan dengan bahasa kaumnya, supaya ia dapat memberi penjelasan dengan terang kepada mereka. ` (Qs. Ibraahiim \/14: 4) dan Allah Subhanahu wa Ta'ala berfirman untuk Nabi Muhammad shallallahu 'alaihi wasallam, ` dan Kami tidak mengutus kamu melainkan kepada umat manusia seluruhnya Sebagai pembawa berita gembira dan pemberi peringatan. ` (Qs. As Saba` 34: 28), maka beliau telah diutus kepada bangsa jin dan manusia. "
            },
            {
                "number": 46,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا زَمْعَةُ عَنْ سَلَمَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ جَلَسَ نَاسٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْتَظِرُونَهُ فَخَرَجَ حَتَّى إِذَا دَنَا مِنْهُمْ سَمِعَهُمْ يَتَذَاكَرُونَ فَتَسَمَّعَ حَدِيثَهُمْ فَإِذَا بَعْضُهُمْ يَقُولُ عَجَبًا إِنَّ اللَّهَ اتَّخَذَ مِنْ خَلْقِهِ خَلِيلًا فَإِبْرَاهِيمُ خَلِيلُهُ وَقَالَ آخَرُ مَاذَا بِأَعْجَبَ مِنْ { وَكَلَّمَ اللَّهُ مُوسَى تَكْلِيمًا } وَقَالَ آخَرُ فَعِيسَى كَلِمَةُ اللَّهِ وَرُوحُهُ وَقَالَ آخَرُ وَآدَمُ اصْطَفَاهُ اللَّهُ فَخَرَجَ عَلَيْهِمْ فَسَلَّمَ وَقَالَ قَدْ سَمِعْتُ كَلَامَكُمْ وَعَجَبَكُمْ أَنَّ إِبْرَاهِيمَ خَلِيلُ اللَّهِ وَهُوَ كَذَلِكَ وَمُوسَى نَجِيُّهُ وَهُوَ كَذَلِكَ وَعِيسَى رُوحُهُ وَكَلِمَتُهُ وَهُوَ كَذَلِكَ وَآدَمُ اصْطَفَاهُ اللَّهُ تَعَالَى وَهُوَ كَذَلِكَ أَلَا وَأَنَا حَبِيبُ اللَّهِ وَلَا فَخْرَ وَأَنَا حَامِلُ لِوَاءِ الْحَمْدِ يَوْمَ الْقِيَامَةِ تَحْتَهُ آدَمُ فَمَنْ دُونَهُ وَلَا فَخْرَ وَأَنَا أَوَّلُ شَافِعٍ وَأَوَّلُ مُشَفَّعٍ يَوْمَ الْقِيَامَةِ وَلَا فَخْرَ وَأَنَا أَوَّلُ مَنْ يُحَرِّكُ بِحَلَقِ الْجَنَّةِ وَلَا فَخْرَ فَيَفْتَحُ اللَّهُ فَيُدْخِلُنِيهَا وَمَعِي فُقَرَاءُ الْمُؤْمِنِينَ وَلَا فَخْرَ وَأَنَا أَكْرَمُ الْأَوَّلِينَ وَالْآخِرِينَ عَلَى اللَّهِ وَلَا فَخْرَ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Zam'ah] dari [Salamah] dari ['Ikrimah] dari [Ibnu Abbas] Radliyallahu'anhu ia berkata; Orang-orang dari sahabat Nabi shallallahu 'alaihi wasallam duduk menunggu beliau. Kemudian beliau keluar dan tatkala dekat dengan mereka beliau mendengar mereka sedang menyebut-nyebut nama beliau shallallahu 'alaihi wasallam. Lalu beliau mendengarkan percakapan mereka dengan baik, maka diantara mereka ada yang berkata; \"Sungguh sangat mengherankan bahwasannya Allah Subhanahu wa Ta'ala menjadikan dari makhluk-Nya Sebagai sahabat karib-Nya, dan Ibrahim adalah sahabat karib Allah Subhanahu wa Ta'ala yang lain berkata; Mana yang lebih mengherankan dari ayat, WA KALLAMA ALLAHU MUSA TAKLIIMAA Dan Allah telah berbicara kepada Nabi Musa dengan langsung (Qs. An Nisaa`\/4: 164) sementara yang lainnya lagi berkata; Sedangkan Isa adalah Kalimat Allah Subhanahu wa Ta'ala dan Ruh Nya, yang lainnya pun ikut berkata; Sementara Adam telah disucikan Allah Subhanahu wa Ta'ala. Lalu beliau keluar menemui mereka dan mengucapkan salam, lalu bersabda: \"Saya telah mendengarkan percakapan kalian dan keheranan bahwa Ibrahim adalah sahabat karib Allah Subhanahu wa Ta'ala, dan memang demikian, Musa orang yang diajak langsung berbicara dengan-Nya dan memang demikian, dan Isa adalah Ruh dan Kalimat-Nya dan memang demikian, dan Adam Allah Subhanahu wa Ta'ala telah memilihnya dan memang demikian, ketahuilah bahwa saya adalah habibullah (manusia kecintaan Allah) dan tiada kesombongan, aku adalah pembawa panji pujian di hari kiamat yang membawai Adam dan para nabi sesudahnya dan tiada kesombongan, dan aku adalah orang pertama yang memberi dan yang diberi syafa`at pada hari kiamat dan tidak ada kesombongan, dan saya adalah orang pertama yang menggerakkan tali pintu surga dan tidak ada kesombongan, kemudian Allah Subhanahu wa Ta'ala membukakan pintunya dan memasukkan saya ke dalamnya, saya masuk bersama orang-orang miskin dari kaum muslimin dan tidak ada kesombongan, serta saya adalah orang yang paling mulia dari orang-orang terdahulu dan orang-orang yang datang belakangan di sisi Allah Subhanahu wa Ta'ala dan tidak ada kesombongan\". "
            },
            {
                "number": 47,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ عَنْ مَنْصُورِ بْنِ أَبِي الْأَسْوَدِ عَنْ لَيْثٍ عَنْ الرَّبِيعِ بْنِ أَنَسٍ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا أَوَّلُهُمْ خُرُوجًا وَأَنَا قَائِدُهُمْ إِذَا وَفَدُوا وَأَنَا خَطِيبُهُمْ إِذَا أَنْصَتُوا وَأَنَا مُسْتَشْفِعُكُمْ إِذَا حُبِسُوا وَأَنَا مُبَشِّرُهُمْ إِذَا أَيِسُوا الْكَرَامَةُ وَالْمَفَاتِيحُ يَوْمَئِذٍ بِيَدِي وَأَنَا أَكْرَمُ وَلَدِ آدَمَ عَلَى رَبِّي يَطُوفُ عَلَيَّ أَلْفُ خَادِمٍ كَأَنَّهُمْ بَيْضٌ مَكْنُونٌ أَوْ لُؤْلُؤٌ مَنْثُورٌ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Sulaiman] dari [Mansur bin Abi Al Aswad] dari [Laits] dari [Ar Rabi' bin Anas] dari [Anas] Radliyallahu'anhu ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya adalah orang pertama kali yang bangkit dari kubur di hari berbangkit, saya adalah pemimpin mereka ketika mereka datang, saya adalah juru bicara mereka ketika mereka diam, saya adalah orang yang meminta syafa`at untuk mereka ketika mereka tertahan (di padang mahsyar), saya adalah orang yang memberikan kabar kepada mereka ketika mereka putus asa. Kemuliaan dan kunci-kunci pada hari itu di tangan saya, dan saya adalah anak Adam Alaihis salam yang paling mulia di sisi Tuhanku, berkeliling di samping saya seribu pelayan, seakan-akan mereka adalah permata yang putih atau mutiara yang bertaburan\". "
            },
            {
                "number": 48,
                "arab": " أخبرنا عبد الله بن عبد الحكم المصري حدثنا بكر بن مضر عن جعفر بن ربيعة عن صالح هو ابن عطاء بن خباب مولى بني الدئل عن عطاء بن أبي رباح عن جابر بن عبد الله أن النبي صلى الله عليه وسلم قال أنا قائد المرسلين ولا فخر وأنا خاتم النبيين ولا فخر وأنا أول شافع وأول مشفع ولا فخر",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Abdul Hakam Al Mishri] telah menceritakan kepada kami [Bakar bin Mudlar] dari [Ja'far bin Rabi'ah] dari [Shalih Ibnu 'Atha` bin Khabbab] bekas budak dari bani Al Duil dari ['Atha` bin Abi Rabbah] dari [Jabir bin Abdullah] Radliyallahu'anhu Bahwasannya Nabi shallallahu 'alaihi wasallam. bersabda: \"Saya adalah pemimpin para Rasul, dan tidak ada kesombongan, saya adalah penutup para Nabi dan tidak ada kesombongan, saya adalah orang pertama yang akan memberi syafa`at dan orang pertama yang diberi syafa`at dan tidak ada kesombongan\". "
            },
            {
                "number": 49,
                "arab": " حدثنا محمد بن عباد حدثنا سفيان هو ابن عيينة عن ابن جدعان عن أنس أن النبي صلى الله عليه وسلم قال أنا أول من يأخذ بحلقة باب الجنة فأقعقعها قال أنس كأني أنظر إلى يد رسول الله صلى الله عليه وسلم يحركها وصف لنا سفيان كذا وجمع أبو عبد الله أصابعه وحركها قال وقال له ثابت مسست يد رسول الله صلى الله عليه وسلم بيدك قال نعم قال فأعطنيها أقبلها",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Abbad] telah menceritakan kepada kami [Sufyan Ibnu 'Uyainah] dari [Ibnu Jud'aan] dari [Anas] Bahwasannya Nabi shallallahu 'alaihi wasallam bersabda: Dari Jabir bin Abdillah bahwa nabi shallallahu 'alaihi wasallam bersabda: Saya adalah orang pertama yang memegang tali pintu surga dan saya pun menggerak-gerakkannya. Anas berkata; Seakan-akan saya melihat tangan Rasulullah shallallahu 'alaihi wasallam menggerak-gerakkannya, dan Sufyan menyebut (kisah) demikian juga, dan Abu Abdullah menggenggamkan tangannya dan menggerakkannya, perawi berkata; Tsabit bertanya kepadanya; apakah kamu memegang tangan Rasulullah shallallahu 'alaihi wasallam dengan tangan kamu? Ia menjawab; Bahkan beliau memberikan tangannya kepada saya untuk saya cium. "
            },
            {
                "number": 50,
                "arab": " أخبرنا أحمد بن عبد الله حدثنا حسين بن علي عن زائدة عن المختار بن فلفل عن أنس قال قال رسول الله صلى الله عليه وسلم أنا أول شافع في الجنة",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Husain bin Ali] dari [Zaidah] dari [Al Mukhtar bin Fulful] dari [Anas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Saya adalah orang pertama di surga yang memberi syafa`at. \" "
            },
            {
                "number": 51,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يَزِيدُ هُوَ ابْنُ عَبْدِ اللَّهِ بْنِ الْهَادِ عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنِّي لَأَوَّلُ النَّاسِ تَنْشَقُّ الْأَرْضُ عَنْ جُمْجُمَتِي يَوْمَ الْقِيَامَةِ وَلَا فَخْرَ وَأُعْطَى لِوَاءَ الْحَمْدِ وَلَا فَخْرَ وَأَنَا سَيِّدُ النَّاسِ يَوْمَ الْقِيَامَةِ وَلَا فَخْرَ وَأَنَا أَوَّلُ مَنْ يَدْخُلُ الْجَنَّةَ يَوْمَ الْقِيَامَةِ وَلَا فَخْرَ وَآتِي بَابَ الْجَنَّةِ فَآخُذُ بِحَلْقَتِهَا فَيَقُولُونَ مَنْ هَذَا فَأَقُولُ أَنَا مُحَمَّدٌ فَيَفْتَحُونَ لِي فَأَدْخُلُ فَأَجِدُ الْجَبَّارَ مُسْتَقْبِلِي فَأَسْجُدُ لَهُ فَيَقُولُ ارْفَعْ رَأْسَكَ يَا مُحَمَّدُ وَتَكَلَّمْ يُسْمَعْ مِنْكَ وَقُلْ يُقْبَلْ مِنْكَ وَاشْفَعْ تُشَفَّعْ فَأَرْفَعُ رَأْسِي فَأَقُولُ أُمَّتِي أُمَّتِي يَا رَبِّ فَيَقُولُ اذْهَبْ إِلَى أُمَّتِكَ فَمَنْ وَجَدْتَ فِي قَلْبِهِ مِثْقَالَ حَبَّةٍ مِنْ شَعِيرٍ مِنْ الْإِيمَانِ فَأَدْخِلْهُ الْجَنَّةَ فَأَذْهَبُ فَمَنْ وَجَدْتُ فِي قَلْبِهِ مِثْقَالَ ذَلِكَ أَدْخَلْتُهُمْ الْجَنَّةَ فَأَجِدُ الْجَبَّارَ مُسْتَقْبِلِي فَأَسْجُدُ لَهُ فَيَقُولُ ارْفَعْ رَأْسَكَ يَا مُحَمَّدُ وَتَكَلَّمْ يُسْمَعْ مِنْكَ وَقُلْ يُقْبَلْ مِنْكَ وَاشْفَعْ تُشَفَّعْ فَأَرْفَعُ رَأْسِي فَأَقُولُ أُمَّتِي أُمَّتِي يَا رَبِّ فَيَقُولُ اذْهَبْ إِلَى أُمَّتِكَ فَمَنْ وَجَدْتَ فِي قَلْبِهِ مِثْقَالَ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ الْإِيمَانِ فَأَدْخِلْهُ الْجَنَّةَ فَأَذْهَبُ فَمَنْ وَجَدْتُ فِي قَلْبِهِ مِثْقَالَ ذَلِكَ أَدْخَلْتُهُمْ الْجَنَّةَ وَفُرِغَ مِنْ حِسَابِ النَّاسِ وَأُدْخِلَ مَنْ بَقِيَ مِنْ أُمَّتِي فِي النَّارِ مَعَ أَهْلِ النَّارِ فَيَقُولُ أَهْلُ النَّارِ مَا أَغْنَى عَنْكُمْ أَنَّكُمْ كُنْتُمْ تَعْبُدُونَ اللَّهَ وَلَا تُشْرِكُونَ بِهِ شَيْئًا فَيَقُولُ الْجَبَّارُ فَبِعِزَّتِي لَأَعْتِقَنَّهُمْ مِنْ النَّارِ فَيُرْسِلُ إِلَيْهِمْ فَيَخْرُجُونَ مِنْ النَّارِ وَقَدْ امْتُحِشُوا فَيُدْخَلُونَ فِي نَهَرِ الْحَيَاةِ فَيَنْبُتُونَ فِيهِ كَمَا تَنْبُتُ الْحِبَّةُ فِي غُثَاءِ السَّيْلِ وَيُكْتَبُ بَيْنَ أَعْيُنِهِمْ هَؤُلَاءِ عُتَقَاءُ اللَّهِ فَيُذْهَبُ بِهِمْ فَيَدْخُلُونَ الْجَنَّةَ فَيَقُولُ لَهُمْ أَهْلُ الْجَنَّةِ هَؤُلَاءِ الْجَهَنَّمِيُّونَ فَيَقُولُ الْجَبَّارُ بَلْ هَؤُلَاءِ عُتَقَاءُ الْجَبَّارِ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepada kami [Al Laits] telah menceritakan kepadaku [Yazid Ibnu Abdullah bin Al Had] dari [`Amr bin Abu `Amr] dari [Anas bin Malik] Radliyallahu'anhu ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam: \" Sesungguhnya saya adalah orang pertama yang bumi akan terbelah karena kemuliaanku pada hari kiamat (nanti) dan tidak ada kesombongan, saya orang pertama yang masuk surga pada hari kiamat dan tidak ada kesombongan, dan saya mendekati pintu surga serta memegang talinya, mereka (penjaga surga) bertanya siapakah orang ini? saya menjawab: Saya Muhammad kemudian mereka membukanya untuk saya, lalu saya masuk dan saya mendapatkan Yang Maha Kuasa di hadapan saya maka saya bersujud kepada-Nya. Lalu Dia berfirman: Angkat kepalamu wahai Muhammad, dan bicaralah niscaya akan didengar perkataanmu, memohonlah niscaya akan dikabulkan permohonanmu, berilah syafa'at niscaya kamu dapat memberi syafa'at. Maka saya mengangkat kepala saya dan berkata: Umat saya, umat saya wahai Tuhan saya. Dia berfirman: \"Pergilah kepada umatmu dan barang siapa yang kamu dapati keimanan di hatinya sebesar biji gandum niscaya akan Kumasukkan ke dalam surga. Kemudian saya pergi dan siapa saja yang saya jumpai dalam hatinya sebesar biji tersebut, saya masukkan mereka kedalam surga. Lalu saya mendapatkan Yang Maha Kuasa di hadapan saya, maka saya sujud kepada-Nya. Dia berfirman: Angkatlah kepalamu dan berbicaralah niscaya akan didengar perkataanmu dan katakanlah niscaya akan didengar pula dan berilah syafa'at niscaya kamu dapat memberi syafa'at. Maka saya mengangkat kepala dan saya berkata umatku ya Tuhan kemudian Dia berfirman 'Pergilah kepada umatmu barang siapa yang kamu dapati di hatinya keimanan sebesar biji gandum maka masukkanlah ia ke surga kemudian saya pergi dan barang siapa yang saya dapati di hatinya keimanan sebesar biji tersebut saya masukkan mereka ke surga. ' Selesai sudah penghitungan amal perbuatan semua manusia, dan dimasukkan yang tersisa dari umat saya ke neraka bersama penghuni neraka, maka penghuni neraka berkata; Tidak berguna bagimu bahwa kamu dahulu telah menyembah Allah Subhanahu wa Ta'ala dan kamu tidak menyekutukan-Nya dengan sesuatu. Maka Yang Maha Kuasa berfirman: Dengan keagungan-Ku, Aku akan membebaskan mereka dari api neraka. Kemudian diutus kepada mereka dan dikeluarkanlah mereka dari neraka dalam keadaan terpanggang, lalu mereka dimasukkan ke dalam sungai kehidupan, maka mereka tumbuh sebagaimana tumbuhnya sebuah biji di dalam buih yang mengalir, dan dituliskan pada kening mereka; mereka adalah orang-orang yang dibebaskan Allah Subhanahu wa Ta'ala. Kemudian mereka digiring dan dimasukkan ke dalam surga. Maka penghuni surga berkata kepada mereka; \"Mereka ini adalah penghuni neraka jahannam\". Maka Yang Maha Kuasa berfirman: \"Oh Bukan, mereka itu adalah orang-orang yang dibebaskan oleh Yang Maha Kuasa. \" "
            },
            {
                "number": 52,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي مُعَاوِيَةُ عَنْ يُونُسَ بْنِ مَيْسَرَةَ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ ابْنِ غَنْمٍ قَالَ نَزَلَ جِبْرِيلُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَقَّ بَطْنَهُ ثُمَّ قَالَ جِبْرِيلُ قَلْبٌ وَكِيعٌ فِيهِ أُذُنَانِ سَمِيعَتَانِ وَعَيْنَانِ بَصِيرَتَانِ مُحَمَّدٌ رَسُولُ اللَّهِ الْمُقَفِّي الْحَاشِرُ خُلُقُكَ قَيِّمٌ وَلِسَانُكَ صَادِقٌ وَنَفْسُكَ مُطْمَئِنَّةٌ قَالَ أَبُو مُحَمَّد وَكِيعٌ يَعْنِي شَدِيدًا",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Mu`awiyah] dari [Yunus bin Maisarah] dari [Abu Idris Al Khaulani] dari [Ibnu Ghanm] ia berkata; Jibril Alaihis salam turun kepada Rasulullah dan membelah perutnya, kemudian Jibril berkata 'Hati yang kokoh terdapat di sana dua telinga yang dapat mendengar dan dua mata yang dapat melihat, Muhammad shallallahu 'alaihi wasallam. Rasulullah Al Muqaffa (yang dimuliakan) dan Al Hasyir (yang mengumpulkan), akhlakmu mulia, lidahmu dapat dipercaya dan jiwamu tenang. Abu Muhammad berkata arti kata waki' adalah yang kuat. "
            },
            {
                "number": 53,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي مُعَاوِيَةُ عَنْ عُرْوَةَ بْنِ رُوَيْمٍ عَنْ عَمْرِو بْنِ قَيْسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ أَدْرَكَ بِيَ الْأَجَلَ الْمَرْحُومَ وَاخْتَصَرَ لِيَ اخْتِصَارًا فَنَحْنُ الْآخِرُونَ وَنَحْنُ السَّابِقُونَ يَوْمَ الْقِيَامَةِ وَإِنِّي قَائِلٌ قَوْلًا غَيْرَ فَخْرٍ إِبْرَاهِيمُ خَلِيلُ اللَّهِ وَمُوسَى صَفِيُّ اللَّهِ وَأَنَا حَبِيبُ اللَّهِ وَمَعِي لِوَاءُ الْحَمْدِ يَوْمَ الْقِيَامَةِ وَإِنَّ اللَّهَ عَزَّ وَجَلَّ وَعَدَنِي فِي أُمَّتِي وَأَجَارَهُمْ مِنْ ثَلَاثٍ لَا يَعُمُّهُمْ بِسَنَةٍ وَلَا يَسْتَأْصِلُهُمْ عَدُوٌّ وَلَا يَجْمَعُهُمْ عَلَى ضَلَالَةٍ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Mu`awiyah] dari ['Urwah bin Ruwaim] dari [Amr bin Qais], Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Subhanahu wa Ta'ala telah memberitahuku ajal kematianku yang dikasihani dan Dia memperpendek umurku. \" Maka kita adalah orang-orang yang terakhir namun kita orang-orang pendahulu pada hari kiamat. Saya akan menyatakan sebuah pernyataan dan maaf ini tidak ada kesombongan, Ibrahim adalah sahabat karib Allah Subhanahu wa Ta'ala (khalilullah), Musa adalah pilihan Allah Subhanahu wa Ta'ala dan saya adalah kekasih Allah Subhanahu wa Ta'ala dan bersamaku bendera pujian pada hari kiamat. Sesungguhnya Allah Subhanahu wa Ta'ala telah menjanjikan untuk umat saya dan melindungi mereka dari tiga hal; tidak akan ditimpakan kepada mereka musim paceklik yang mahadahsyat, tidak akan dicerai-beraikan oleh musuh dan tidak akan dikumpulkan dalam kesesatan. "
            },
            {
                "number": 54,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ حَدَّثَنَا مُعَاوِيَةُ بْنُ يَحْيَى حَدَّثَنَا أَرْطَاةُ بْنُ الْمُنْذِرِ عَنْ ضَمْرَةَ بْنِ حَبِيبٍ قَالَ سَمِعْتُ مَسْلَمَةَ السَّكُونِيَّ وَقَالَ غَيْرُ مُحَمَّدٍ سَلَمَةَ السَّكُونِيَّ قَالَ بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ قَالَ قَائِلٌ يَا رَسُولَ اللَّهِ هَلْ أُتِيتَ بِطَعَامٍ مِنْ السَّمَاءِ قَالَ نَعَمْ أُتِيتُ بِطَعَامٍ قَالَ يَا نَبِيَّ اللَّهِ هَلْ كَانَ فِيهِ مِنْ فَضْلٍ قَالَ نَعَمْ قَالَ فَمَا فُعِلَ بِهِ قَالِ رُفِعَ إِلَى السَّمَاءِ وَقَدْ أُوحِيَ إِلَيَّ أَنِّي غَيْرُ لَابِثٍ فِيكُمْ إِلَّا قَلِيلًا ثُمَّ تَلْبَثُونَ حَتَّى تَقُولُوا مَتَى مَتَى ثُمَّ تَأْتُونِي أَفْنَادًا يُفْنِي بَعْضُكُمْ بَعْضًا بَيْنَ يَدَيْ السَّاعَةِ مُوتَانٌ شَدِيدٌ وَبَعْدَهُ سَنَوَاتُ الزَّلَازِلِ",
                "id": "Telah meceritakan kepada kami [Muhammad bin Al Mubarak] telah menceritakan kepada kami [Mu'awiyah bin Yahya] telah menceritakan kepada kami [Arthah bin Al Mundzir] dari [Dlamrah bin Habib] ia berkata saya mendengar Maslamah As Sakuni -menurut ucapan selain Muhammad- [Salamah As Sakuni] ia berkata; Tatkala kami bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba seseorang berkata; \" Wahai Rasulullah shallallahu 'alaihi wasallam, apakah kamu diberikan makanan dari langit? Beliau menjawab: Ya aku diberikan makanan. Ia bertanya kembali; \"Wahai Nabi Allah Subhanahu wa Ta'ala apakah makanan itu masih tersisa?\" Beliau menjawab: \"Ya. \" Ia bertanya lagi, apa yang diperbuat padanya? Beliau menjawab: \"Telah diangkat kembali ke langit, dan telah diwahyukan kepada saya bahwa saya tidak akan lama lagi tinggal bersamamu, kemudian kamu akan terus hidup sampai kamu berkata; \"Kapan, kapan? Lalu kamu datang kepada saya berkelompok-kelompok yang satu sama lain saling menghancurkan, menjelang terjadinya kiamat akan ada kematian yang mengerikan, dan setelahnya datanglah tahun-tahun yang penuh dengan gempa. "
            },
            {
                "number": 55,
                "arab": " أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ عَنْ أَبِي الْعَلَاءِ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِقَصْعَةٍ مِنْ ثَرِيدٍ فَوُضِعَتْ بَيْنَ يَدَيْ الْقَوْمِ فَتَعَاقَبُوهَا إِلَى الظُّهْرِ مِنْ غُدْوَةٍ يَقُومُ قَوْمٌ وَيَجْلِسُ آخَرُونَ فَقَالَ رَجُلٌ لِسَمُرَةَ بْنِ جُنْدُبٍ أَمَا كَانَتْ تُمَدُّ فَقَالَ سَمُرَةُ مِنْ أَيِّ شَيْءٍ تَعْجَبُ مَا كَانَتْ تُمَدُّ إِلَّا مِنْ هَا هُنَا وَأَشَارَ بِيَدِهِ إِلَى السَّمَاءِ",
                "id": "Telah mengabarkan kepada kami [Utsman bin Muhammad] telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Sulaiman At Taimi] dari [Abu Al 'Ala`] dari [Samurah bin Jundud] bahwa Rasulullah shallallahu 'alaihi wasallam diberikan semangkuk besar yang berisi bubur daging, lalu mangkuk itu diletakkan ditengah-tengah kaum, maka mereka saling bergantian untuk melaksanakan sholat zhuhur karena makan siang, sebagian orang berdiri sebagian lagi duduk. Dan seseorang berkata kepada Samurah bin Jundab; apakah makanan ini datang begitu saja? Samurah menjawab; \"Dengan hal apa kamu terheran-heran? Tidaklah didatangkan semangkuk makanan itu kecuali dari sana, sambil ia memberi isyarat dengan tangannya ke arah langit. \" "
            },
            {
                "number": 56,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ سَعِيدٍ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ عَنْ أَشْعَثَ بْنِ سَوَّارٍ عَنْ أَبِي إِسْحَقَ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي لَيْلَةٍ إِضْحِيَانَ وَعَلَيْهِ حُلَّةٌ حَمْرَاءُ فَجَعَلْتُ أَنْظُرُ إِلَيْهِ وَإِلَى الْقَمَرِ قَالَ فَلَهُوَ كَانَ أَحْسَنَ فِي عَيْنِي مِنْ الْقَمَرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sa'id] telah mengabarkan kepada kami [Abdur Rahman bin Muhammad] dari [Asy 'ats bin Shawwar] dari [Abu Ishaq] dari [Jabir bin Samurah] ia berkata; Saya melihat Rasulullah shallallahu 'alaihi wasallam pada malam bulan purnama dan beliau memakai pakaian merah, lalu saya (bergantian) memandang beliau dan memandang bulan. "
            },
            {
                "number": 57,
                "arab": " أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي ثَابِتٍ الزُّهْرِيُّ حَدَّثَنِي إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ ابْنُ أَخِي مُوسَى عَنْ عَمِّهِ مُوسَى بْنِ عُقْبَةَ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْلَجَ الثَّنِيَّتَيْنِ إِذَا تَكَلَّمَ رُئِيَ كَالنُّورِ يَخْرُجُ مِنْ بَيْنِ ثَنَايَاهُ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al Mundzir] telah menceritakan kepada kami [Abdul Aziz bin Abu Tsabit Az Zuhri] telah menceritakan kepadaku [Ismail bin Ibrahim] -anak saudaraku, Musa- dari Pamannya [Musa bin 'Uqbah] dari [Kuraib] dari [Ibnu Abbas] Radliyallahu'anhu ia berkata; Rasulullah shallallahu 'alaihi wasallam mempunyai gigi seri yang renggang, apabila beliau berbicara terlihat seperti ada cahaya yang memancar dari antara kedua gigi seri beliau itu. "
            },
            {
                "number": 58,
                "arab": " أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مِسْعَرٌ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ قَالَ قَالَ ابْنُ عُمَرَ مَا رَأَيْتُ أَحَدًا أَنْجَدَ وَلَا أَجْوَدَ وَلَا أَشْجَعَ وَلَا أَضْوَأَ وَأَوْضَأَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Mis'ar] dari [Abdul Malik bin 'Umair] ia berkata; [Ibnu Umar] berkata; Saya tidak pernah melihat seseorang yang lebih cepat berperang, lebih bersih, lebih berani, dan lebih bersinar dari Rasulullah shallallahu 'alaihi wasallam. "
            },
            {
                "number": 59,
                "arab": " أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ عَنْ أَبِي عُبَيْدَةَ بْنِ مُحَمَّدِ بْنِ عَمَّارِ بْنِ يَاسِرٍ قَالَ قُلْتُ لِلرُّبَيِّعِ بِنْتِ مُعَوِّذِ بْنِ عَفْرَاءَ صِفِي لَنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا بُنَيَّ لَوْ رَأَيْتَهُ رَأَيْتَ الشَّمْسَ طَالِعَةً",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al Mundzir Al Hizami] telah menceritakan kepada kami [ubaidhullah bin Musa] telah menceritakan kepada kami [Usamah bin Zaid] dari [Abu 'Ubaidah bin Muhammad bin 'Ammar bin Yasir] ia berkata; Aku berkata kepada [Ar Rubai' binti Mu'awwidz bin 'Afra`]; Tolong, sifatkanlah kepada saya, (bagaimana) Rasulullah shallallahu 'alaihi wasallam, maka ia berkata; Wahai anakku kalau sekiranya kamu melihat beliau maka seakan kamu melihat matahari yang sedang terbit. "
            },
            {
                "number": 60,
                "arab": " أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا ثَابِتٌ عَنْ أَنَسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَزْهَرَ اللَّوْنِ كَأَنَّ عَرَقَهُ اللُّؤْلُؤُ إِذَا مَشَى تَكَفَّأَ وَمَا مَسِسْتُ حَرِيرَةً وَلَا دِيبَاجَةً أَلْيَنَ مِنْ كَفِّهِ وَلَا شَمِمْتُ رَائِحَةً قَطُّ أَطْيَبُ مِنْ رَائِحَتِهِ مِسْكَةً وَلَا غَيْرَهَا",
                "id": "Telah mengabarkan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] telah mengabarkan kepada kami [Tsabit] dari [Anas] ia berkata; Rasulullah shallallahu 'alaihi wasallam adalah seorang yang berkulit terang seakan-akan keringatnya adalah permata, jika berjalan tegak, dan tidaklah saya menyentuh kain sutera atau kain wool yang lebih halus dari telapak tangan beliau, serta saya tidak pernah sekalipun mencium semerbak wewangian dari minyak misk atau yang lainnya yang lebih wangi dari wanginya beliau. "
            },
            {
                "number": 61,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ خَدَمْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا قَالَ لِي أُفٍّ قَطُّ وَلَا قَالَ لِي لِشَيْءٍ صَنَعْتُهُ لِمَ صَنَعْتَ كَذَا وَكَذَا أَوْ هَلَّا صَنَعْتَ كَذَا وَكَذَا وَقَالَ لَا وَاللَّهِ مَا مَسِسْتُ بِيَدِي دِيبَاجًا وَلَا حَرِيرًا أَلْيَنَ مِنْ يَدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا وَجَدْتُ رِيحًا قَطُّ أَوْ عَرْفًا كَانَ أَطْيَبَ مِنْ عَرْفِ أَوْ رِيحِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'man] telah mengabarkan kepada kami [Hammad bin Zaid] dari [Tsabit] dari [Anas bin Malik] Radliyallahu'anhu ia bercerita; Dahulu saya membantu Rasulullah shallallahu 'alaihi wasallam dan beliau tidak pernah berkata: \"Ah (dasar, Huss, dan bentakan semisal) kepada saya, atau beliau mengatakan atas apa saja yang saya lakukan: \"Mengapa kamu kerjakan begini dan begini?\", atau \"Kamu harus mengerjakan begini dan begini?\" Dan Anas berkata; Tidak, saya tidak pernah menyentuh kain wool kain sutera yang lebih halus dari tangan Rasulullah shallallahu 'alaihi wasallam, dan saya tidak pernah mencium wewangian dan keringat yang lebih wangi dari keringat atau wanginya Rasulullah shallallahu 'alaihi wasallam. "
            },
            {
                "number": 62,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الرِّفَاعِيُّ حَدَّثَنَا أَبُو بَكْرٍ عَنْ حَبِيبِ بْنِ خُدْرَةَ قَالَ حَدَّثَنِي رَجُلٌ مِنْ بَنِي حُرَيْشٍ قَالَ كُنْتُ مَعَ أَبِي حِينَ رَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَاعِزَ بْنَ مَالِكٍ فَلَمَّا أَخَذَتْهُ الْحِجَارَةُ أُرْعِبْتُ فَضَمَّنِي إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَالَ عَلَيَّ مِنْ عَرَقِ إِبْطِهِ مِثْلُ رِيحِ الْمِسْكِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yazid Ar Rifa'i] telah menceritakan kepada kami [Abu Bakar] dari [Habib bin Khadrah] telah menceritakan kepadaku [seseorang dari Bani Huraisy] ia berkata; Dahulu saya bersama ayah saya ketika Rasulullah shallallahu 'alaihi wasallam merajam Ma'iz bin Malik, tatkala bebatuan sudah mengenainya, saya gemetar kemudian Rasulullah shallallahu 'alaihi wasallam mendekap saya, lalu meneteslah keringat dari ketiak beliau yang baunya bagaikan (minyak wangi) misk. "
            },
            {
                "number": 63,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ سَأَلَهُ رَجُلٌ قَالَ أَرَأَيْتَ كَانَ وَجْهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ السَّيْفِ قَالَ لَا مِثْلَ الْقَمَرِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zuhair] dari [Abu Ishaq] dari [Barra`] ia berkata; seseorang bertanya kepadanya; Apakah kamu melihat wajah Rasulullah shallallahu 'alaihi wasallam seperti sebilah pedang? Ia menjawab; \"Tidak, wajah beliau bagaikan bulan. \""
            },
            {
                "number": 64,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شَرِيكٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْرَفُ بِاللَّيْلِ بِرِيحِ الطِّيبِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Syariik] dari [Al A'masy] dari [Ibrahim] ia berkata; \" Rasulullah shallallahu 'alaihi wasallam pada malam hari dikenali dengan bau wanginya. \""
            },
            {
                "number": 65,
                "arab": " أَخْبَرَنَا مَالِكُ بْنُ إِسْمَعِيلَ حَدَّثَنَا إِسْحَقُ بْنُ الْفَضْلِ بْنِ عَبْدِ الرَّحْمَنِ الْهَاشِمِيُّ أَخْبَرَنَا الْمُغِيرَةُ بْنُ عَطِيَّةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَسْلُكْ طَرِيقًا أَوْ لَا يَسْلُكُ طَرِيقًا فَيَتْبَعُهُ أَحَدٌ إِلَّا عَرَفَ أَنَّهُ قَدْ سَلَكَهُ مِنْ طِيبِ عَرْفِهِ أَوْ قَالَ مِنْ رِيحِ عَرَقِهِ",
                "id": "Telah mengabarkan kepada kami [Malik bin isma'il] telah menceritakan kepada kami [Ishaq bin Al Fadl bin AbdurRahman Al Hasyimi] telah mengabarkan kepada kami [Al Mughirah bin 'Athiyah] dari [Abu Zubair] dari [Jabir] Bahwasannya Nabi shallallahu 'alaihi wasallam tidak melewati satu jalan pun atau beliau melewati jalan melainkan beliau dikenal bahwa beliau (baru saja) melewati jalan tersebut dari wangi keringatnya atau ia berkata; dari keringat beliau yang harum. "
            },
            {
                "number": 66,
                "arab": " أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو اللَّيْثِيُّ عَنْ أَبِي سَلَمَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ الْهَدِيَّةَ وَلَا يَقْبَلُ الصَّدَقَةَ فَأَهْدَتْ لَهُ امْرَأَةٌ مِنْ يَهُودِ خَيْبَرَ شَاةً مَصْلِيَّةً فَتَنَاوَلَ مِنْهَا وَتَنَاوَلَ مِنْهَا بِشْرُ بْنُ الْبَرَاءِ ثُمَّ رَفَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ ثُمَّ قَالَ إِنَّ هَذِهِ تُخْبِرُنِي أَنَّهَا مَسْمُومَةٌ فَمَاتَ بِشْرُ بْنُ الْبَرَاءِ فَأَرْسَلَ إِلَيْهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا حَمَلَكِ عَلَى مَا صَنَعْتِ فَقَالَتْ إِنْ كُنْتَ نَبِيًّا لَمْ يَضُرَّكَ شَيْءٌ وَإِنْ كُنْتَ مَلِكًا أَرَحْتُ النَّاسَ مِنْكَ فَقَالَ فِي مَرَضِهِ مَا زِلْتُ مِنْ الْأَكْلَةِ الَّتِي أَكَلْتُ بِخَيْبَرَ فَهَذَا أَوَانُ انْقِطَاعِ أَبْهَرِي",
                "id": "Telah mengabarkan kepada kami [Ja'far bin 'Aun] telah mengabarkan kepada kami [Muhammad bin 'Amr Al Laitsi] dari [Abu Salamah] ia berkata; Dahulu Rasulullah shallallahu 'alaihi wasallam bersedia makan (menerima) hadiah dan tidak mau menerima sedekah, maka seorang wanita Yahudi Khaibar menghadiahkan kepada beliau shallallahu 'alaihi wasallam seekor kambing panggang dan beliau memakannya begitu juga Bisyr bin Barra`, kemudian Nabi shallallahu 'alaihi wasallam mengangkat tangan beliau dan berkata: Sesungguhnya kambing ini memberitahuku bahwasannya dirinya telah (dilumuri) racun. Maka Bisyr bin Al Barra` meninggal, Maka Nabi shallallahu 'alaihi wasallam mengutus seseorang untuk menangkapnya, dan beliau bertanya: Apa yang menyebabkanmu melakukan perbuatan keji ini? Perempuan itu menjawab; \"Apabila engkau benar-benar seorang Nabi niscaya tidak ada yang dapat mencelakakanmu, sebaliknya apabila engkau seorang raja niscaya saya telah membebaskan manusia darimu. \" Beliau berkata di waktu sakitnya: Saya masih merasakan efek makanan yang saya makan ketika di Khaibar, dan ini adalah saat terputusnya tulang punggungku. "
            },
            {
                "number": 67,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ أَخْبَرَنَا شُعَيْبُ بْنُ أَبِي حَمْزَةَ عَنْ الزُّهْرِيِّ قَالَ كَانَ جَابِرُ بْنُ عَبْدِ اللَّهِ يُحَدِّثُ أَنَّ يَهُودِيَّةً مِنْ أَهْلِ خَيْبَرَ سَمَّتْ شَاةً مَصْلِيَّةً ثُمَّ أَهْدَتْهَا لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخَذَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهَا الذِّرَاعَ فَأَكَلَ مِنْهَا وَأَكَلَ الرَّهْطُ مِنْ أَصْحَابِهِ مَعَهُ ثُمَّ قَالَ لَهُمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ارْفَعُوا أَيْدِيَكُمْ وَأَرْسَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَهُودِيَّةِ فَدَعَاهَا فَقَالَ لَهَا أَسَمَمْتِ هَذِهِ الشَّاةَ فَقَالَتْ نَعَمْ وَمَنْ أَخْبَرَكَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْنِي هَذِهِ فِي يَدِيَ الذِّرَاعُ قَالَتْ نَعَمْ قَالَ فَمَاذَا أَرَدْتِ إِلَى ذَلِكَ قَالَتْ قُلْتُ إِنْ كَانَ نَبِيًّا لَمْ يَضُرَّهُ وَإِنْ لَمْ يَكُنْ نَبِيًّا اسْتَرَحْنَا مِنْهُ فَعَفَا عَنْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يُعَاقِبْهَا وَتُوُفِّيَ بَعْضُ أَصْحَابِهِ الَّذِينَ أَكَلُوا مِنْ الشَّاةِ وَاحْتَجَمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى كَاهِلِهِ مِنْ أَجْلِ الَّذِي أَكَلَ مِنْ الشَّاةِ حَجَمَهُ أَبُو هِنْدٍ مَوْلَى بَنِي بَيَاضَةَ بِالْقَرْنِ وَالشَّفْرَةِ وَهُوَ مِنْ بَنِي ثُمَامَةَ وَهُمْ حَيٌّ مِنْ الْأَنْصَارِ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Nafi'] telah mengabarkan kepada kami [Syu'aib bin Abu Hamzah] dari [Az Zuhri] ia berkata; [Jabir bin Abdullah] Radliyallahu'anhu menceritakan; Seorang wanita Yahudi penduduk Khaibar membubuhi racun pada daging kambing panggang dan menghadiahkannya kepada Nabi shallallahu 'alaihi wasallam. Nabi mengambil daging tulang hastanya dan memakannya, dan sebagian sahabatnya juga ikut makan bersamanya. Nabi shallallahu 'alaihi wasallam kontan berkata kepada mereka: \" Angkatlah tangan kalian.\" Kemudian beliau mengutus seseorang untuk menangkap wanita Yahudi tadi dan menginterogasi: \"Kamu melumuri kambing tadi dengan racun?\" Ia menjawab; \"Ya, benar. \" Si wanita bertanya; \"Siapa gerangan yang memberitahukan kepada baginda?\" Nabi menjawab: \"Yang memberitahuku adalah yang ada di tanganku ini, \" -maksudnya tulang sampil--Perempuan itu berkata, \"Betul, memang kububuhi racun, \" beliau bertanya, \" Apa maksudmu melakukan hal itu?\" ia menjawab, \"Aku hanya ingin membuktikan, jika seorang Nabi niscaya tidak mencelakainya dan jikalau bukan, kami terbebas darinya. \" Maka Rasulullah shallallahu 'alaihi wasallam memaafkannya dengan tidak menghukumnya, sedang sebagian sahabat lain yang memakan daging kambing tersebut meninggal dunia. Nabi shallallahu 'alaihi wasallam berbekam pada bagian atas punggung untuk menghilangkan racun yang dimakannya dari daging kambing tersebut. Beliau dibekam oleh Abu Hind, maula Bani Bayadhah, dengan tanduk dan parang, ia dari Bani Tsumamah yaitu daerah bagian dari kaum Anshar. \" "
            },
            {
                "number": 68,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ عَنْ أَبِي هُرَيْرَةَ قَالَ لَمَّا فَتَحْنَا خَيْبَرَ أُهْدِيَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَاةٌ فِيهَا سُمٌّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْمَعُوا لِي مَنْ كَانَ هَا هُنَا مِنْ الْيَهُودِ فَجُمِعُوا لَهُ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي سَائِلُكُمْ عَنْ شَيْءٍ فَهَلْ أَنْتُمْ صَادِقِيَّ عَنْهُ قَالُوا نَعَمْ يَا أَبَا الْقَاسِمِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَبُوكُمْ قَالُوا أَبُونَا فُلَانٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَذَبْتُمْ بَلْ أَبُوكُمْ فُلَانٌ قَالُوا صَدَقْتَ وَبَرَرْتَ فَقَالَ لَهُمْ هَلْ أَنْتُمْ صَادِقِيَّ عَنْ شَيْءٍ إِنْ سَأَلْتُكُمْ عَنْهُ فَقَالُوا نَعَمْ وَإِنْ كَذَبْنَاكَ عَرَفْتَ كَذِبَنَا كَمَا عَرَفْتَ فِي آبَائِنَا فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَنْ أَهْلُ النَّارِ فَقَالُوا نَكُونُ فِيهَا يَسِيرًا ثُمَّ تَخْلُفُونَا فِيهَا قَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اخْسَئُوا فِيهَا وَاللَّهِ لَا نَخْلُفُكُمْ فِيهَا أَبَدًا ثُمَّ قَالَ لَهُمْ هَلْ أَنْتُمْ صَادِقِيَّ عَنْ شَيْءٍ إِنْ سَأَلْتُكُمْ عَنْهُ قَالُوا نَعَمْ قَالَ هَلْ جَعَلْتُمْ فِي هَذِهِ الشَّاةِ سُمًّا قَالُوا نَعَمْ قَالَ مَا حَمَلَكُمْ عَلَى ذَلِكَ قَالُوا أَرَدْنَا إِنْ كُنْتَ كَاذِبًا أَنْ نَسْتَرِيحَ مِنْكَ وَإِنْ كُنْتَ نَبِيًّا لَمْ يَضُرَّكَ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Sa'id bin Abu Sa'id Al Maqburi] dari [Abu Hurairah] Radliyallahu'anhu ia berkata; \"Ketika kami menaklukan Khaibar, Rasulullah shallallahu 'alaihi wasallam diberi hadiah seekor kambing beracun. Rasulullah shallallahu 'alaihi wasallam kontan berkata: ' Tolong kumpulkanlah orang-orang Yahudi yang ada di sini. ' Maka dikumpulkanlah mereka kepada beliau. Lalu Rasulullah shallallahu 'alaihi wasallam berkata: 'Saya akan bertanya kalian tentang sesuatu, apakah kalian akan menjawab dengan jujur? ', mereka menjawab; 'Ya, wahai Abu Qasim (Nabi Muhammad shallallahu 'alaihi wasallam). ' Lalu Rasulullah shallallahu 'alaihi wasallam bertanya: 'Siapakah ayah kalian? ' Mereka menjawab; 'Ayah kami si fulan. ' Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: 'Kalian bohong!, tetapi ayah kalian adalah si fulan. ' Mereka menjawab; 'Baginda benar. ' Lalu beliau berkata kepada mereka: 'Apakah kalian akan jujur jika saya tanya tentang sesuatu? ' Mereka menjawab; 'Ya, dan jika kami berbohong niscaya baginda mengetahuinya, sebagaimana baginda mengetahui ayah-ayah kami. ' Rasulullah shallallahu 'alaihi wasallam bertanya kepada mereka: 'Siapakah penghuni neraka? ' Mereka menjawab; 'Kami berada di dalamnya sebentar dan kemudian baginda menggantikan kami di dalamnya. ' Maka Rasulullah shallallahu 'alaihi wasallam berkata kepada mereka: Terhinalah kalian di dalamnya, demi Allah Subhanahu wa Ta'ala kami tidak akan menggantikan kalian di dalamnya selamanya. Lalu Rasulullah shallallahu 'alaihi wasallam bertanya kepada mereka: Apakah kalian akan berkata jujur terhadap pertanyaan yang akan ku tanyakan kepada kalian?, mereka menjawab; Ya. Beliau berkata: Apakah kalian membubuhi racun pada (daging) kambing tersebut? Mereka menjawab; Ya, beliau bertanya: apa yang menyebabkan kalian berbuat demikian? Mereka menjawab; Kami ingin terbebas jika baginda seorang pembohong dan jika baginda benar seorang Nabi maka (racun itu) tidak bakalan mencelakai baginda. "
            },
            {
                "number": 69,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ ابْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَ مَا سُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا قَطُّ فَقَالَ لَا قَالَ أَبُو مُحَمَّد قَالَ ابْنُ عُيَيْنَةَ إِذَا لَمْ يَكُنْ عِنْدَهُ وَعَدَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Ibnu Al Munkadir] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam tidak pernah diminta sesuatu, lalu beliau menjawab tidak. Abu Muhammad berkata; Ibnu 'Uyainah berkata; Jika permintaan tak dipunyainya, niscaya beliau shallallahu 'alaihi wasallam menjanjikan. "
            },
            {
                "number": 70,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عِمْرَانَ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ عَنْ زَمْعَةَ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَيِيًّا لَا يُسْأَلُ شَيْئًا إِلَّا أَعْطَاهُ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Imran] telah menceritakan kepada kami [Abu Daud Al Thayalitsi] dari [Zam'ah] dari [Abu Hazim] dari [Sahl bin Sa'ad] Radliyallahu'anhu ia berkata; Rasulullah shallallahu 'alaihi wasallam seorang pemalu, dan tidaklah beliau diminta sesuatu melainkan akan memberinya. "
            },
            {
                "number": 71,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ عَنْ رَجُلٍ مِنْ الْعَرَبِ قَالَ زَحَمْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ حُنَيْنٍ وَفِي رِجْلِي نَعْلٌ كَثِيفَةٌ فَوَطِئْتُ بِهَا عَلَى رِجْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَفَحَنِي نَفْحَةً بِسَوْطٍ فِي يَدِهِ وَقَالَ بِسْمِ اللَّهِ أَوْجَعْتَنِي قَالَ فَبِتُّ لِنَفْسِي لَائِمًا أَقُولُ أَوْجَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَبِتُّ بِلَيْلَةٍ كَمَا يَعْلَمُ اللَّهُ فَلَمَّا أَصْبَحْنَا إِذَا رَجُلٌ يَقُولُ أَيْنَ فُلَانٌ قَالَ قُلْتُ هَذَا وَاللَّهِ الَّذِي كَانَ مِنِّي بِالْأَمْسِ قَالَ فَانْطَلَقْتُ وَأَنَا مُتَخَوِّفٌ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّكَ وَطِئْتَ بِنَعْلِكَ عَلَى رِجْلِي بِالْأَمْسِ فَأَوْجَعْتَنِي فَنَفَحْتُكَ نَفْحَةً بِالسَّوْطِ فَهَذِهِ ثَمَانُونَ نَعْجَةً فَخُذْهَا بِهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad bin Abu Khalaf] telah menceritakan kepada kami [Abdurrahman bin Muhammad] dari [Muhammad bin Ishaq] telah menceritakan kepadaku [Abdullah bin Abu Bakar] dari [seseorang dari Arab] ia berkata; Saya berdesakan dengan Rasulullah shallallahu 'alaihi wasallam pada peperangan Hunain dan saya mengenakan sandal besar, lalu saya menginjak kaki Rasulullah shallallahu 'alaihi wasallam. Maka beliau memukul saya dengan cemeti di tangannya sambil berkata: Bismillah kamu telah menyakiti saya. Perawi (laki-laki arab) berkata; di malam harinya saya bergumam sendiri; Saya telah menyakiti Rasulullah shallallahu 'alaihi wasallam. Kemudian saya bermalam waktu itu yang hanya Allah Subhanahu wa Ta'ala mengetahuinya. Pagi harinya, tiba-tiba seseorang bertanya; Mana si fulan?. Perawi (laki-laki arab) berkata; Saya berbisik; Demi Allah Subhanahu wa Ta'ala, orang inilah yang kemarin ada masalah dengan saya. Ia berkata; saya pergi dengan rasa takut. Lalu Rasulullah shallallahu 'alaihi wasallam berkata kepada saya: sungguh kamu kemarin yang menginjak kaki saya dan membuat saya sakit, lalu saya pukul kamu dengan cemeti, maka ini ada delapan puluh domba betina, silahkan ambillah untukmu sebagai gantinya. "
            },
            {
                "number": 72,
                "arab": " أَخْبَرَنَا يَعْقُوبُ بْنُ حُمَيْدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ ابْنِ أَخِي الزُّهْرِيِّ عَنْ الزُّهْرِيِّ قَالَ إِنَّ جِبْرِيلَ قَالَ مَا فِي الْأَرْضِ أَهْلُ عَشَرَةِ أَبْيَاتٍ إِلَّا قَلَّبْتُهُمْ فَمَا وَجَدْتُ أَحَدًا أَشَدَّ إِنْفَاقًا لِهَذَا الْمَالِ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Humaid] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Ibnu Akhi Az Zuhri] dari [Az Zuhri] ia berkata; Jibril Aalaihissalam berkata: Tidaklah di muka bumi ini terdapat pemilik sepuluh gedung kecuali saya (Aalaihissalam) Telah membolak-balikkan mereka, maka saya tidak mendapat seorang pun yang lebih banyak berinfak selain Rasulullah shallallahu 'alaihi wasallam. "
            },
            {
                "number": 73,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى حَدَّثَنَا الْحُسَيْنُ بْنُ وَاقِدٍ عَنْ يَحْيَى بْنِ عُقَيْلٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكْثِرُ الذِّكْرَ وَيُقِلُّ اللَّغْوَ وَيُطِيلُ الصَّلَاةَ وَيُقْصِرُ الْخُطْبَةَ وَلَا يَأْنَفُ وَلَا يَسْتَنْكِفُ أَنْ يَمْشِيَ مَعَ الْأَرْمَلَةِ وَالْمِسْكِينِ فَيَقْضِيَ لَهُمَا حَاجَتَهُمَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Humaid] telah menceritakan kepada kami [Al Fadl bin Musa] telah menceritakan kepada kami [Al Husain bin Waqid] dari [Yahya bin 'Uqail] dari [Abdullah bin Abi Aufa] ia berkata; Nabi shallallahu 'alaihi wasallam selalu memperbanyak dzikir, mengurangi (menghindari) hal sia-sia, memperpanjang sholat, memendekkan khutbah, tidak berbuat kasar, tidak merasa malu berbicara dengan para janda dan orang miskin untuk menyelesaikan urusan mereka. "
            },
            {
                "number": 74,
                "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ قَالَ قَالَ الْعَبَّاسُ رَضِيَ اللَّهُ تَعَالَى عَنْهُ لَأَعْلَمَنَّ مَا بَقَاءُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِينَا فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي رَأَيْتُهُمْ قَدْ آذَوْكَ وَآذَاكَ غُبَارُهُمْ فَلَوْ اتَّخَذْتَ عَرِيشًا تُكَلِّمُهُمْ مِنْهُ فَقَالَ لَا أَزَالُ بَيْنَ أَظْهُرِهِمْ يَطَئُونَ عَقِبِي وَيُنَازِعُونِي رِدَائِي حَتَّى يَكُونَ اللَّهُ هُوَ الَّذِي يُرِيحُنِي مِنْهُمْ قَالَ فَعَلِمْتُ أَنَّ بَقَاءَهُ فِينَا قَلِيلٌ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah mengabarkan kepada kami [Hammad bin Zaid] dari [Ayyub] dari ['Ikrimah] ia berkata; [Abbas] Radliyallahu'anhu berkata; Sungguh saya sangat mengetahui lamanya Rasulullah shallallahu 'alaihi wasallam tinggal bersama kami, perawi (Ikrimah) berkata; Wahai Rasulullah, saya melihat mereka telah menyakiti baginda dan sampai debu-debu mereka juga menyakiti baginda, bagaimana jika saya buatkan tempat berteduh yang baginda gunakan untuk berbicara dengan mereka? beliau menjawab: aku akan tetap akan berada di tengah-tengah mereka, sekalipun mereka menginjak-injak kakiku ini dan menarik selendangku hingga Allah Subhanahu wa Ta'ala yang membebaskan saya dari mereka. Perawi berkata; Maka kami tahu bahwa beliau akan tinggal bersama kami hanya sebentar. "
            },
            {
                "number": 75,
                "arab": " أَخْبَرَنَا زَكَرِيَّا بْنُ عَدِيٍّ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ أُنَيْسِ بْنِ أَبِي يَحْيَى عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ وَنَحْنُ فِي الْمَسْجِدِ عَاصِبًا رَأْسَهُ بِخِرْقَةٍ حَتَّى أَهْوَى نَحْوَ الْمِنْبَرِ فَاسْتَوَى عَلَيْهِ وَاتَّبَعْنَاهُ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لَأَنْظُرُ إِلَى الْحَوْضِ مِنْ مَقَامِي هَذَا ثُمَّ قَالَ إِنَّ عَبْدًا عُرِضَتْ عَلَيْهِ الدُّنْيَا وَزِينَتُهَا فَاخْتَارَ الْآخِرَةَ قَالَ فَلَمْ يَفْطِنْ لَهَا أَحَدٌ غَيْرُ أَبِي بَكْرٍ فَذَرَفَتْ عَيْنَاهُ فَبَكَى ثُمَّ قَالَ بَلْ نَفْدِيكَ بِآبَائِنَا وَأُمَّهَاتِنَا وَأَنْفُسِنَا وَأَمْوَالِنَا يَا رَسُولَ اللَّهِ قَالَ ثُمَّ هَبَطَ فَمَا قَامَ عَلَيْهِ حَتَّى السَّاعَةِ",
                "id": "Telah mengabarkan kepada kami [Zakaria bin 'Adi] telah menceritakan kepada kami [Hatim bin Ismail] dari [Unais bin Abu Yahya] dari [ayahnya] dari [Abu Sa'id Al Khudri] ia berkata; Rasulullah shallallahu 'alaihi wasallam keluar menemui kami di waktu sakit beliau yang menyebabkan kematian beliau. Kami berada di masjid (masjid Nabawi) sambil membalut kepalanya dengan sobekan kain, hingga beliau mendekati mimbar, dan duduk di atasnya. Kami terus mengikuti beliau. Kemudian beliau bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, sungguh saya melihat sebuah telaga dari tempat berdiri saya ini. \" Kemudian beliau berkata: 'Sesungguhnya ada seorang hamba diperlihatkan kepadanya dunia dan perhiasannya, kemudian ia justru memilih akhirat. ' Perawi (Abu Sa'id alkhudzri) berkata: Ketika itu tidak ada seorang pun yang bisa memahami ucapan beliau selain Abu Bakar, maka berlinanglah kedua mata Abu Bakar lalu ia menangis dan berkata; Bahkan kami akan menebusmu dengan ayah-ayah kami, ibu-ibu kami, jiwa kami, dan harta kami, wahai Rasulullah! '. Perawi bercerita; Kemudian beliau turun dari mimbar itu dan tidak pernah berdiri di mimbar itu hingga ajal meninggal. "
            },
            {
                "number": 76,
                "arab": " أَخْبَرَنَا خَلِيفَةُ بْنُ خَيَّاطٍ حَدَّثَنَا بَكْرُ بْنُ سُلَيْمَانَ حَدَّثَنَا ابْنُ إِسْحَقَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ عَلِيِّ بْنِ عَدِيٍّ عَنْ عُبَيْدٍ مَوْلَى الْحَكَمِ بْنِ أَبِي الْعَاصِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ أَبِي مُوَيْهِبَةَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي قَدْ أُمِرْتُ أَنْ أَسْتَغْفِرَ لِأَهْلِ الْبَقِيعِ فَانْطَلِقْ مَعِي فَانْطَلَقْتُ مَعَهُ فِي جَوْفِ اللَّيْلِ فَلَمَّا وَقَفَ عَلَيْهِمْ قَالَ السَّلَامُ عَلَيْكُمْ يَا أَهْلَ الْمَقَابِرِ لِيُهْنِكُمْ مَا أَصْبَحْتُمْ فِيهِ مِمَّا أَصْبَحَ فِيهِ النَّاسُ أَقْبَلَتْ الْفِتَنُ كَقِطْعِ اللَّيْلِ الْمُظْلِمِ يَتْبَعُ آخِرُهَا أَوَّلَهَا الْآخِرَةُ أَشَدُّ مِنْ الْأُولَى ثُمَّ أَقْبَلَ عَلَيَّ فَقَالَ يَا أَبَا مُوَيْهِبَةَ إِنِّي قَدْ أُوتِيتُ بِمَفَاتِيحِ خَزَائِنِ الدُّنْيَا وَالْخُلْدِ فِيهَا ثُمَّ الْجَنَّةُ فَخُيِّرْتُ بَيْنَ ذَلِكَ وَبَيْنَ لِقَاءِ رَبِّي قُلْتُ بِأَبِي أَنْتَ وَأُمِّي خُذْ مَفَاتِيحَ خَزَائِنِ الدُّنْيَا وَالْخُلْدَ فِيهَا ثُمَّ الْجَنَّةَ قَالَ لَا وَاللَّهِ يَا أَبَا مُوَيْهِبَةَ لَقَدْ اخْتَرْتُ لِقَاءَ رَبِّي ثُمَّ اسْتَغْفَرَ لِأَهْلِ الْبَقِيعِ ثُمَّ انْصَرَفَ فَبُدِئَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي وَجَعِهِ الَّذِي مَاتَ فِيهِ",
                "id": "Telah mengabarkan kepada kami [Khalifah bin Khayyat] telah menceritakan kepada kami [Bakar bin Suilaiman] telah menceritakan kepada kami [Ibnu Ishaq] telah menceritakan kepadaku [Abdullah bin Umar bin Ali bin 'Adi] dari ['Ubaid] -bekas budak Al Hakam bin Abu Al 'Ash- dari [Abdullah bin 'Amr] dari [Abu Muiwaihibah] -bekas budak Rasulullah shallallahu 'alaihi wasallam- ia berkata; Rasulullah shallallahu 'alaihi wasallam berkata kepadaku 'Sesungguhnya saya diperintah untuk memintakan ampun bagi penghuni pemakaman Baqi', lalu beliau berangkat bersamaku di tengah malam. Tatkala beliau sudah berdiri menghadap mereka (pemakaman) beliau mengucap: ASSALAMU 'ALAIKUM YAA AHLAL MAQAABIR (semoga kesejahteraan untuk kalian wahai penduduk pemakaman ini). Semoga keadaan kalian sekarang ini lebih selamat bagi kalian daripada keadaan yang dihadapi manusia sekarang. Kini telah menyebar fitnah bagaikan potongan malam yang gelap gulita, penghujungnya mengikuti permulaannya. Dan sungguh hari akhirat lebih sulit daripada kehidupan dunia. Lalu beliau berbalik menghadapku dan berkata: Wahai Abu Muwaihibah, telah diberikan kepadaku kunci-kunci gudang dunia dan keabadian di dalamnya. Kemudian aku diberi kebebasan memilih antara hal itu atau berjumpa dengan Tuhanku. Saya (Abu Muwaihibah) menjawab; Demi ayah serta ibuku sebagai tebusannya, wahai baginda, ambil saja kunci-kunci gudang kehidupan dunia dan keabadian di dalamnya, kemudian surga. Beliau menjawab: 'Tidak, demi Allah wahai Abu Muwaihibah, sesungguhnya saya telah memilih untuk berjumpa dengan Tuhanku. Kemudian beliau memohonkan ampunan untuk penghuni Baqi lalu pergi. "
            },
            {
                "number": 77,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ ابْنِ إِسْحَقَ عَنْ يَعْقُوبَ بْنِ عُتْبَةَ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ عَائِشَةَ قَالَتْ رَجَعَ إِلَيَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ مِنْ جَنَازَةٍ مِنْ الْبَقِيعِ فَوَجَدَنِي وَأَنَا أَجِدُ صُدَاعًا وَأَنَا أَقُولُ وَا رَأْسَاهُ قَالَ بَلْ أَنَا يَا عَائِشَةُ وَا رَأْسَاهُ قَالَ وَمَا ضَرَّكِ لَوْ مُتِّ قَبْلِي فَغَسَّلْتُكِ وَكَفَّنْتُكِ وَصَلَّيْتُ عَلَيْكِ وَدَفَنْتُكِ فَقُلْتُ لَكَأَنِّي بِكَ وَاللَّهِ لَوْ فَعَلْتَ ذَلِكَ لَرَجَعْتَ إِلَى بَيْتِي فَعَرَّسْتَ فِيهِ بِبَعْضِ نِسَائِكَ قَالَتْ فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ بُدِئَ فِي وَجَعِهِ الَّذِي مَاتَ فِيهِ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Mubarak] telah menceritakan kepada kami [Muhammad bin Salamah] dari [Ibnu Ishaq] dari [Ya'qub bin 'Utbah] dari [Ibnu Syihab] dari [ubaidhullah bin Abdullah bin 'Utbah] dari [Aisyah] Radliyallahu'anha ia berkata; Rasulullah shallallahu 'alaihi wasallam, suatu hari pulang kepadaku dari (memakamkan) jenazah di Baqi'. lalu ia mendapati saya sedang sakit kepala dan mengaduh; 'Aduh kepalaku', Beliau berkata: ' Aduh kepalaku wahai Aisyah'. Beliau berkata lagi: 'Apa yang membuat kamu susah jika kamu wafat sebelum saya? ' Sungguh niscaya saya akan memandikanmu dan mengkafani kamu serta akan memakamkanmu. Lalu saya (Aisyah Radliyallahu'anha) berkata; sepertinya itu yang baginda harapkan, demi Allah Subhanahu wa Ta'ala jika baginda melakukan hal itu niscaya baginda akan pulang ke rumahku. Lalu baginda menggauli sebagian isteri baginda di sana. Aisyah Radliyallahu'anha berkata; Rasulullah shallallahu 'alaihi wasallam tersenyum kemudian beliau mulai terserang sakit yang menyebabkan beliau meninggal dunia. "
            },
            {
                "number": 78,
                "arab": " أَخْبَرَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُخْتَارٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ كَعْبٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَرَضِهِ صُبُّوا عَلَيَّ سَبْعَ قِرَبٍ مِنْ سَبْعِ آبَارٍ شَتَّى حَتَّى أَخْرُجَ إِلَى النَّاسِ فَأَعْهَدَ إِلَيْهِمْ قَالَتْ فَأَقْعَدْنَاهُ فِي مِخْضَبٍ لِحَفْصَةَ فَصَبَبْنَا عَلَيْهِ الْمَاءَ صَبًّا أَوْ شَنَنَّا عَلَيْهِ شَنًّا الشَّكُّ مِنْ قِبَلِ مُحَمَّدِ بْنِ إِسْحَقَ فَوَجَدَ رَاحَةً فَخَرَجَ فَصَعِدَ الْمِنْبَرَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَاسْتَغْفَرَ لِلشُّهَدَاءِ مِنْ أَصْحَابِ أُحُدٍ وَدَعَا لَهُمْ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنَّ الْأَنْصَارَ عَيْبَتِي الَّتِي أَوَيْتُ إِلَيْهَا فَأَكْرِمُوا كَرِيمَهُمْ وَتَجَاوَزُوا عَنْ مُسِيئِهِمْ إِلَّا فِي حَدٍّ أَلَا إِنَّ عَبْدًا مِنْ عِبَادِ اللَّهِ قَدْ خُيِّرَ بَيْنَ الدُّنْيَا وَبَيْنَ مَا عِنْدَ اللَّهِ فَاخْتَارَ مَا عِنْدَ اللَّهِ فَبَكَى أَبُو بَكْرٍ وَظَنَّ أَنَّهُ يَعْنِي نَفْسَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رِسْلِكَ يَا أَبَا بَكْرٍ سُدُّوا هَذِهِ الْأَبْوَابَ الشَّوَارِعَ إِلَى الْمَسْجِدِ إِلَّا بَابَ أَبِي بَكْرٍ فَإِنِّي لَا أَعْلَمُ امْرَأً أَفْضَلَ عِنْدِي يَدًا فِي الصُّحْبَةِ مِنْ أَبِي بَكْرٍ",
                "id": "Telah mengabarkan kepada kami [Farwah bin Abu Al Maghra`] telah menceritakan kepada kami [Ibrahim bin Mukhtar] dari [Muhammad bin Ishaq] dari [Muhammad bin Ka'ab] dari ['Urwah] dari ['Aisyah] Radliyallahu'anha ia berkata: Nabi shallallahu 'alaihi wasallam bersabda ketika sakit beliau: \" Siramkanlah kepadaku tujuh ember air dari tujuh sumur yang berbeda-beda, sehingga aku bisa keluar kepada orang-orang untuk memenuhi janji mereka\" perawi berkata: \"Maka kami dudukkan beliau pada bejana milik Hafsah Radliyallahu'anha, kami siramkan atau kami tuangkan air kepadanya -keraguan redaksi kami siramkan atau kami tuangkan ini dari Muhammad bin Ishaq-, maka beliau mendapatkan ketenangan, lalu beliau keluar dan menaiki mimbar; seraya bersabda: \" Kaum Anshar adalah manusia kepercayaan dan penjaga rahasiaku, tempat aku berlindung, kecuali jika mereka benar-benar melanggar hukum. Ingatlah, ada seorang hamba Allah Subhanahu wa Ta'ala diberi kebebasan memilih antara dunia dan apa yang ada di sisi Allah Subhanahu wa Ta'ala, maka ia memilih apa yang ada di sisi Allah Subhanahu wa Ta'ala \" Lalu Abu Bakar Radliyallahu'anhu menangis, ia beranggapan bahwa ucapan nabi shallallahu 'alaihi wasallam itu dialamatkan untuk dirinya. Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Tunggu dulu wahai Abu Bakar, tutuplah pintu-pintu jalan yang menuju ke masjid (Nabawi) kecuali pintu Abu Bakar, karena aku tidak mengenal seorang pun yang lebih utama bagiku dalam persahabatan dan pembelaan daripada Abu Bakar Radliyallahu'anhu\". "
            },
            {
                "number": 79,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ عَنْ سُلَيْمَانَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْ أُوذِنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالصَّلَاةِ فِي مَرَضِهِ فَقَالَ مُرُوا أَبَا بَكْرٍ يُصَلِّي بِالنَّاسِ ثُمَّ أُغْمِيَ عَلَيْهِ فَلَمَّا سُرِّيَ عَنْهُ قَالَ هَلْ أَمَرْتُنَّ أَبَا بَكْرٍ يُصَلِّي بِالنَّاسِ فَقُلْتُ إِنَّ أَبَا بَكْرٍ رَجُلٌ رَقِيقٌ فَلَوْ أَمَرْتَ عُمَرَ فَقَالَ أَنْتُنَّ صَوَاحِبُ يُوسُفَ مُرُوا أَبَا بَكْرٍ يُصَلِّي بِالنَّاسِ فَرُبَّ قَائِلٍ مُتَمَنٍّ وَيَأْبَى اللَّهُ وَالْمُؤْمِنُونَ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin Manshur] telah menceritakan kepada kami [Fulaih bin Sulaiman] dari [Sulaiman bin Abdurrahman] dari [Al Qasim bin Muhammad] dari ['Aisyah] Radliyallahu'anha ia berkata: \"Rasulullah Shallallahu 'Alaihi wa Aallam mengizinkan untuk mengumandangkan adzan sholat, kemudian beliau bersabda: \"Perintahkanlah Abu Bakar untuk mengimami orang-orang\", lalu beliau jatuh pingsan. Ketika beliau siuman, beliau bertanya: \"Apakah aku telah memerintahkan Abu Bakar Radliyallahu'anhu untuk mengimami orang-orang?. Lalu aku (perawi) berkata: \"Bukankah Abu Bakar seorang yang lembut hingga mudah menangis, tidak sebaiknyakah baginda memerintahkan Umar saja?\". Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \" Ah,, Kamu ini seperti saudara-saudara Yusuf saja, perintahkan Abu Bakar untuk mengimami orang-orang, berapa banyak orang yang berangan-angan tetapi Allah Subhaanallahu wa Ta'ala dan orang-orang yang beriman tidak menginginkannya\". "
            },
            {
                "number": 80,
                "arab": " أَخْبَرَنَا عَبْدُ الْوَهَّابِ بْنُ سَعِيدٍ الدِّمَشْقِيُّ حَدَّثَنَا شُعَيْبٌ هُوَ ابْنُ إِسْحَقَ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي يَعِيشُ بْنُ الْوَلِيدِ حَدَّثَنِي مَكْحُولٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَصَابَ أَحَدَكُمْ مُصِيبَةٌ فَلْيَذْكُرْ مُصِيبَتَهُ بِي فَإِنَّهَا مِنْ أَعْظَمِ الْمَصَائِبِ",
                "id": "Telah mengabarkan kepada kami [Abdul Wahab bin Sa'id Ad Dimasyqi] telah menceritakan kepada kami [Syu'aib Ibnu Ishaq], telah menceritakan kepada kami [Al 'Auza'i] telah menceritakan kepadaku [Ya'isy bin Al Walid] telah menceritakan kepadaku [Makhul] Bahwasannya Nabi shallallahu 'alaihi wasallam bersabda: \" Apabila salah seorang diantara kalian terkena musibah, maka bayangkanlah musibah yang menimpanya itu menimpaku, maka itu merupakan musibah yang paling besar\". "
            },
            {
                "number": 81,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا فِطْرٌ عَنْ عَطَاءٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَصَابَ أَحَدَكُمْ مُصِيبَةٌ فَلْيَذْكُرْ مُصَابَهُ بِي فَإِنَّهَا مِنْ أَعْظَمِ الْمَصَائِبِ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Fithr] dari ['Atha`] ia berkata: Rasulullah shallallahu 'alaihi wasallam: \" Jika suatu musibah menimpa seseorang dari kalian maka bayangkanlah musibah itu menimpaku, maka hal itu adalah termasuk musibah yang terbesar\". "
            },
            {
                "number": 82,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ فَاطِمَةَ قَالَتْ يَا أَنَسُ كَيْفَ طَابَتْ أَنْفُسُكُمْ أَنْ تَحْثُوا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التُّرَابَ وَقَالَتْ يَا أَبَتَاهْ مِنْ رَبِّهِ مَا أَدْنَاهْ وَا أَبَتَاهْ جَنَّةُ الْفِرْدَوْسِ مَأْوَاهْ وَا أَبَتَاهْ إِلَى جِبْرِيلَ نَنْعَاهْ وَا أَبَتَاهْ أَجَابَ رَبًّا دَعَاهْ قَالَ حَمَّادٌ حِينَ حَدَّثَ ثَابِتٌ بَكَى و قَالَ ثَابِتٌ حِينَ حَدَّثَ أَنَسٌ بَكَى",
                "id": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari [Tsabit] dari [Anas bin Malik] Radliyallahu'anhu Bahwasannya [Fatimah] Radliyallahu'anha bertanya: \" Wahai Anas, bagaimana dirimu senang menaburkan tanah pada (makam) Rasulullah shallallahu 'alaihi wasallam? Dan Fatimah seraya melantunkan uneg-unegnya: \"Wahai ayahku yang alangkah dekatnya dengan Rabbnya, wahai ayahku yang surga firdaus adalah tempat kembalinya, wahai ayahku yang kepada Jibril 'Aalaihissalam kami memberitahukan kematiannya, wahai ayahku yang dia memenuhi Rabb(nya) ketika memanggilnya\". Hammad Rahimahullah berkata: \"Ketika Tsabit menyampaikan hadits ini, ia menangis\". Tsabit berkata: \"Anas Radliyallahu'anhu ketika menyampaikan hadits ini beliau menangis\". "
            },
            {
                "number": 83,
                "arab": " حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسٍ وَذَكَرَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ شَهِدْتُهُ يَوْمَ دَخَلَ الْمَدِينَةَ فَمَا رَأَيْتُ يَوْمًا قَطُّ كَانَ أَحْسَنَ وَلَا أَضْوَأَ مِنْ يَوْمٍ دَخَلَ عَلَيْنَا فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَشَهِدْتُهُ يَوْمَ مَوْتِهِ فَمَا رَأَيْتُ يَوْمًا كَانَ أَقْبَحَ وَلَا أَظْلَمَ مِنْ يَوْمٍ مَاتَ فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad Salamah] dari [Tsabit] dari [Anas] Radliyallahu'anhu ia mengenang Nabi shallallahu 'alaihi wasallam, \" Aku menyaksikan beliau ketika memasuki Madinah, aku tidak pernah melihat hari yang lebih baik dan lebih cerah daripada hari saat kedatangan Rasulullah shallallahu 'alaihi wasallam ke Madinah, dan aku juga menyaksikan hari wafatnya, maka aku tidak melihat satu hari yang lebih buruk dan lebih gelap daripada hari wafatnya Rasulullah shallallahu 'alaihi wasallam \". "
            },
            {
                "number": 84,
                "arab": " حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا سَعِيدُ بْنُ زَيْدٍ حَدَّثَنَا عَمْرُو بْنُ مَالِكٍ النُّكْرِيُّ حَدَّثَنَا أَبُو الْجَوْزَاءِ أَوْسُ بْنُ عَبْدِ اللَّهِ قَالَ قُحِطَ أَهْلُ الْمَدِينَةِ قَحْطًا شَدِيدًا فَشَكَوْا إِلَى عَائِشَةَ فَقَالَتْ انْظُرُوا قَبْرَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاجْعَلُوا مِنْهُ كِوًى إِلَى السَّمَاءِ حَتَّى لَا يَكُونَ بَيْنَهُ وَبَيْنَ السَّمَاءِ سَقْفٌ قَالَ فَفَعَلُوا فَمُطِرْنَا مَطَرًا حَتَّى نَبَتَ الْعُشْبُ وَسَمِنَتْ الْإِبِلُ حَتَّى تَفَتَّقَتْ مِنْ الشَّحْمِ فَسُمِّيَ عَامَ الْفَتْقِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'man] telah menceritakan kepada kami [Sa'id bin Zaid] telah menceritakan kepada kami [Umar bin Malik An Nukri] telah menceritakan kepada kami [Abu Al Jauza` Aus bin Abdullah], ia berkata: \"Suatu hari penduduk Madinah dilanda kekeringan yang sangat hebat, dan saat itu mereka mengadu kepada [Aisyah] Radliyallahu'anha, kemudian ia berkata: \"Pergilah ke kubur Nabi shallallahu 'alaihi wasallam, buatlah lubang ke arah langit dan jangan sampai ada atap diantaranya dengan langit. Kemudian Abu Al Jauza` melanjutkan kisahnya: \" kemudian masyarakat Madinah melakukan apa yang diperintahkan Aisyah Radliyallahu'anha, setelah itu, turunlah hujan dan rerumputan pun tumbuh dan ternak-ternak menjadi sehat. Karenanya tahun tersebut disebut dengan tahun kemenangan\". "
            },
            {
                "number": 85,
                "arab": " أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ قَالَ لَمَّا كَانَ أَيَّامُ الْحَرَّةِ لَمْ يُؤَذَّنْ فِي مَسْجِدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثًا وَلَمْ يُقَمْ وَلَمْ يَبْرَحْ سَعِيدُ بْنُ الْمُسَيَّبِ مِنْ الْمَسْجِدِ وَكَانَ لَا يَعْرِفُ وَقْتَ الصَّلَاةِ إِلَّا بِهَمْهَمَةٍ يَسْمَعُهَا مِنْ قَبْرِ النَّبِيِّ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah mengabarkan kepada kami [Marwan bin Muhammad] dari [Sa'id bin Abdul Aziz] ia berkata: \" Ketika terjadi musim kering yang dahsyat, tidak ada adzan di masjid Nabawi sebanyak tiga kali, dan tidak pula iqamah. Dan, [Sa'id bin Al Musayyib] tidak keluar dari masjid Nabi shallallahu 'alaihi wasallam. Ia tidak mengetahui waktu sholat kecuali setelah mendengar suara-suara dari arah kubur Nabi shallallahu 'alaihi wasallam. Kemudian ia menyebutkan maknanya. "
            },
            {
                "number": 86,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي خَالِدٌ هُوَ ابْنُ يَزِيدَ عَنْ سَعِيدٍ هُوَ ابْنُ أَبِي هِلَالٍ عَنْ نُبَيْهِ بْنِ وَهْبٍ أَنَّ كَعْبًا دَخَلَ عَلَى عَائِشَةَ فَذَكَرُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ كَعْبٌ مَا مِنْ يَوْمٍ يَطْلُعُ إِلَّا نَزَلَ سَبْعُونَ أَلْفًا مِنْ الْمَلَائِكَةِ حَتَّى يَحُفُّوا بِقَبْرِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضْرِبُونَ بِأَجْنِحَتِهِمْ وَيُصَلُّونَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا أَمْسَوْا عَرَجُوا وَهَبَطَ مِثْلُهُمْ فَصَنَعُوا مِثْلَ ذَلِكَ حَتَّى إِذَا انْشَقَّتْ عَنْهُ الْأَرْضُ خَرَجَ فِي سَبْعِينَ أَلْفًا مِنْ الْمَلَائِكَةِ يَزِفُّونَهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku, [Al Laits] telah menceritakan kepadaku, [Khalid Ibnu Yazid], dari [Sa`id Ibnu Abu Hilal] dari [Nubaih bin Wahb] bahwasanya Ka'ab masuk mengunjungi Aisyah Radliyallahu'anha. Kemudian para sahabat menyebut-nyebut nama Rasulullah shallallahu 'alaihi wasallam, [Ka'ab] berkata: \" Tiada satu hari pun (terlewati) kecuali turun seribu malaikat sehingga mengelilingi makam Nabi shallallahu 'alaihi wasallam, mereka mengepakkan sayapnya dan bershalawat kepada Nabi shallallahu 'alaihi wasallam. Sampai apabila sore hari tiba, mereka naik (ke atas langit,) dan turunlah malaikat semisal dan melakukan perbuatan semisal yang tadi, hingga apabila bumi ini terbelah, Beliau shallallahu 'alaihi wasallam keluar diiringi oleh tujuh puluh ribu malaikat\". "
            },
            {
                "number": 87,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ أَخْبَرَنَا ثَوْرُ بْنُ يَزِيدَ حَدَّثَنِي خَالِدُ بْنُ مَعْدَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرٍو عَنْ عِرْبَاضِ بْنِ سَارِيَةَ قَالَ صَلَّى لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْفَجْرِ ثُمَّ وَعَظَنَا مَوْعِظَةً بَلِيغَةً ذَرَفَتْ مِنْهَا الْعُيُونُ وَوَجِلَتْ مِنْهَا الْقُلُوبُ فَقَالَ قَائِلٌ يَا رَسُولَ اللَّهِ كَأَنَّهَا مَوْعِظَةُ مُوَدِّعٍ فَأَوْصِنَا فَقَالَ أُوصِيكُمْ بِتَقْوَى اللَّهِ وَالسَّمْعِ وَالطَّاعَةِ وَإِنْ كَانَ عَبْدًا حَبَشِيًّا فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ بَعْدِي فَسَيَرَى اخْتِلَافًا كَثِيرًا فَعَلَيْكُمْ بِسُنَّتِي وَسَنَّةِ الْخُلَفَاءِ الرَّاشِدِينَ الْمَهْدِيِّينَ عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ وَإِيَّاكُمْ وَالْمُحْدَثَاتِ فَإِنَّ كُلَّ مُحْدَثَةٍ بِدْعَةٌ و قَالَ أَبُو عَاصِمٍ مَرَّةً وَإِيَّاكُمْ وَمُحْدَثَاتِ الْأُمُورِ فَإِنَّ كُلَّ بِدْعَةٍ ضَلَالَةٌ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] telah mengabarkan kepada kami [Tsaur bin Yazid] telah menceritakan kepadaku [Khalid bin Ma'dan] dari [Abdur Rahman bin 'Amr] dari ['Irbadl bin Sariah] ia berkata; \" Rasulullah shallallahu 'alaihi wasallam sholat subuh bersama kami, kemudian beliau memberikan wejangan dengan wejangan yang sangat dalam hingga air mata (kami) bercucuran dan bergetarlah hati- hati (kami), kemudian seseorang bertanya; \" wahai Rasulullah shallallahu 'alaihi wasallam seakan-akan wejangan ini adalah wejangan penutup (yang engkau berikan), maka berikanlah kami wasiat. Lalu Beliau berkata: \" Aku wasiatkan kepada kalian untuk bertaqwa kepada Allah Subhaanallahu wa Ta'ala dan selalu mendengar dan ta'at (kepada para pemimpin), meskipun ia seorang budak dari Habasyah, sesungguhnya barang siapa diantara kalian yang hidup setelahku niscaya ia melihat perbedaan yang banyak, maka kalian harus mengikuti sunnahku dan sunnah khulafa`urrasyidin yang lurus, gigitlah dengan gigi geraham kalian (peganglah dengan teguh), berhati-hatilah dengan segala sesuatu yang baru (perkara bid`ah), karena sesuatu yang baru itu bid`ah\". Abu 'Ashim berkata: \"Hendaklah kalian berhati-hati terhadap perkara-perkara yang baru (dalam agama), karena setiap bid`ah itu sesat\"."
            },
            {
                "number": 88,
                "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يُونُسَ بْنِ يَزِيدَ عَنْ الزُّهْرِيِّ قَالَ كَانَ مَنْ مَضَى مِنْ عُلَمَائِنَا يَقُولُونَ الِاعْتِصَامُ بِالسُّنَّةِ نَجَاةٌ وَالْعِلْمُ يُقْبَضُ قَبْضًا سَرِيعًا فَنَعْشُ الْعِلْمِ ثَبَاتُ الدِّينِ وَالدُّنْيَا وَفِي ذَهَابِ الْعِلْمِ ذَهَابُ ذَلِكَ كُلِّهِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al `Auza'i] dari [Yunus bin Yazid] dari [Az Zuhri] ia berkata: \"Tak terlewat satu pun dari ulama-ulama kita melainkan mereka berkata: ' Berpegang teguh kepada sunnah merupakan kesuksesan, dan ilmu akan dicabut dengan cepat, penegakkan ilmu itu merupakan penegakkan agama dan dunia, dan dengan hilangnya ilmu maka hilanglah semua itu\"."
            },
            {
                "number": 89,
                "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى بْنِ أَبِي عَمْرٍو السَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الدَّيْلَمِيِّ قَالَ بَلَغَنِي أَنَّ أَوَّلَ الدِّينِ تَرْكًا السُّنَّةُ يَذْهَبُ الدِّينُ سُنَّةً سُنَّةً كَمَا يَذْهَبُ الْحَبْلُ قُوَّةً قُوَّةً",
                "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al `Auza'i] dari [Yahya bin Abu 'Amr As Saibani] dari [Abdullah bin Ad Dailami] ia berkata: \"Telah sampai (kabar) kepadaku bahwa yang paling pertama dari masalah agama yang ditinggalkan adalah sunnah, agama ini akan hilang sunnahnya satu persatu sebagaimana terputusnya seutas tali sedikit demi sedikit\". "
            },
            {
                "number": 90,
                "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ حَسَّانَ قَالَ مَا ابْتَدَعَ قَوْمٌ بِدْعَةً فِي دِينِهِمْ إِلَّا نَزَعَ اللَّهُ مِنْ سُنَّتِهِمْ مِثْلَهَا ثُمَّ لَا يُعِيدُهَا إِلَيْهِمْ إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al `Auza'i] dari [Hassan] ia berkata: \" Tidaklah suatu kaum membuat satu bid`ah dalam agama mereka melainkan Allah Subhaanallahu wa Ta'ala akan mencabut dari sunnah mereka seperti bagian bid`ah (yang mereka perbuat) kemudian Dia tidak mengembalikan lagi sunnah tersebut sampai hari kiamat\". "
            },
            {
                "number": 91,
                "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ قَالَ مَا ابْتَدَعَ رَجُلٌ بِدْعَةً إِلَّا اسْتَحَلَّ السَّيْفَ",
                "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ayyub] dari [Abu Kilabah] ia berkata: \" Tidaklah seorang berbuat bid`ah kecuali ia menghalalkan pedang ditebaskan\". "
            },
            {
                "number": 92,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ قَالَ إِنَّ أَهْلَ الْأَهْوَاءِ أَهْلُ الضَّلَالَةِ وَلَا أَرَى مَصِيرَهُمْ إِلَّا النَّارَ فَجَرِّبْهُمْ فَلَيْسَ أَحَدٌ مِنْهُمْ يَنْتَحِلُ قَوْلًا أَوْ قَالَ حَدِيثًا فَيَتَنَاهَى بِهِ الْأَمْرُ دُونَ السَّيْفِ وَإِنَّ النِّفَاقَ كَانَ ضُرُوبًا ثُمَّ تَلَا { وَمِنْهُمْ مَنْ عَاهَدَ اللَّهَ } { وَمِنْهُمْ مَنْ يَلْمِزُكَ فِي الصَّدَقَاتِ } { وَمِنْهُمْ الَّذِينَ يُؤْذُونَ النَّبِيَّ } فَاخْتَلَفَ قَوْلُهُمْ وَاجْتَمَعُوا فِي الشَّكِّ وَالتَّكْذِيبِ وَإِنَّ هَؤُلَاءِ اخْتَلَفَ قَوْلُهُمْ وَاجْتَمَعُوا فِي السَّيْفِ وَلَا أَرَى مَصِيرَهُمْ إِلَّا النَّارَ قَالَ حَمَّادٌ ثُمَّ قَالَ أَيُّوبُ عِنْدَ ذَا الْحَدِيثِ أَوْ عِنْدَ الْأَوَّلِ وَكَانَ وَاللَّهِ مِنْ الْفُقَهَاءِ ذَوِي الْأَلْبَابِ يَعْنِي أَبَا قِلَابَةَ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Qilabah] ia berkata: \" Sesungguhnya pemuja hawa nafsu adalah orang-orang yang sesat, dan aku tidak melihat akhir perjalanan yang mereka tempuh kecuali neraka. Ujilah mereka itu. Tidak ada seorang pun dari mereka yang menyitir perkataan atau berkata, hingga persoalannya tiada lain adalah pedang. Sesungguhnya kemunafikan sudah menjadi ciri khas mereka. Kemudian ia membaca ayat \"WA MINHUM MAN 'AHADALLAHA' (Dan diantara mereka ada orang yang telah berikrar kepada Allah Subhaanallahu wa Ta'ala) -Qs. At Taubah: 75-, dan ayat \"WA MINHUM MAN YALMIZUKA FIS SHADAQAAT' (Dan diantara mereka ada orang yang mencelamu tentang (pembagian) zakat) -Qs. At Taubah: 58-, dan ayat \"WAMINHUMULLADZINA YU`DZUUNANABIYYA' (Dan diantara mereka 'orang-orang munafik' ada yang menyakiti Nabi shallallahu 'alaihi wasallam) -Qs. Attaubah: 116-,. Kemudian mereka berbeda pendapat dan berselisih, dan akhirnya mereka berkumpul dalam keraguan dan kedustaan,. Sesungguhnya mereka berbeda pendapat dan bersatu dalam gelayut pedang. Dan aku tidak melihat perjalanan mereka kecuali ke neraka\". Hammad berkata: \"Ayyub berkata tentang hadits ini atau hadits awal, demi Allah Subhaanallahu wa Ta'ala, ia termasuk salah seorang pakar fikih yang sangat cerdas, maksudku adalah Abu Qilabah\"."
            },
            {
                "number": 93,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ عَنْ النَّزَّالِ بْنِ سَبْرَةَ قَالَ مَا خَطَبَ عَبْدُ اللَّهِ خُطْبَةً بِالْكُوفَةِ إِلَّا شَهِدْتُهَا فَسَمِعْتُهُ يَوْمًا وَسُئِلَ عَنْ رَجُلٍ يُطَلِّقُ امْرَأَتَهُ ثَمَانِيَةً وَأَشْبَاهِ ذَلِكَ قَالَ هُوَ كَمَا قَالَ ثُمَّ قَالَ إِنَّ اللَّهَ أَنْزَلَ كِتَابَهُ وَبَيَّنَ بَيَانَهُ فَمَنْ أَتَى الْأَمْرَ مِنْ قِبَلِ وَجْهِهِ فَقَدْ بُيِّنَ لَهُ وَمَنْ خَالَفَ فَوَاللَّهِ مَا نُطِيقُ خِلَافَكُمْ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Al Mas'udi] dari [Abdul Malik bin Maisarah] dari [An Nazzal bin Sabrah] ia berkata: Tidaklah [Abdullah] menyampaikan satu khutbah pun di kota Kufah melainkan aku menghadirinya. Suatu hari aku pernah mendengar (ia berhutbah) dan ia ditanya tentang seseorang yang menthalaq (mencerai) isterinya sebanyak delapan kali atau yang seperti itu, maka ia menjawab: \"Telah jatuh apa yang ia katakan\", lalu ia berkata: \"Allah telah menurunkan kitab-Nya dan memberikan penjelasan tentangnya, barang siapa yang melakukan suatu hal yang sesuai dengan yang (datang) dari-Nya, sungguh itu telah dijelaskan kepadanya, tetapi barang siapa yang menyalahi, demi Allah kami tidak mampu melayani tindakan salah kalian\". "
            },
            {
                "number": 94,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ مَيْسَرَةَ قَالَ سَمِعْتُ النَّزَّالَ بْنَ سَبْرَةَ قَالَ شَهِدْتُ عَبْدَ اللَّهِ وَأَتَاهُ رَجُلٌ وَامْرَأَةٌ فِي تَحْرِيمٍ فَقَالَ إِنَّ اللَّهَ قَدْ بَيَّنَ فَمَنْ أَتَى الْأَمْرَ مِنْ قِبَلِ وَجْهِهِ فَقَدْ بُيِّنَ وَمَنْ خَالَفَ فَوَاللَّهِ مَا نُطِيقُ خِلَافَكُمْ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalitsi] telah menceritakan kepada kami [Syu'bah] ia berkata: telah mengabarkan kepada kepadaku [Abdul Malik bin maisarah] ia berkata: aku mendengar [An Nazzal bin Sabrah] berkata: Aku pernah menyaksikan [Abdullah] ketika seorang lelaki dan wanita mendatanginya (untuk menanyakan) hal tentang pengharaman hubungan keduanya, maka ia menjawab: \" Allah telah menurunkan kitab-Nya, barang siapa yang melakukan suatu hal yang sesuai dengan syareat-Nya, sungguh itu telah dijelaskan baginya, tetapi barang siapa yang menyalahi, demi Allah kami tidak mampu menanggung beban penyelewengan kalian\". "
            },
            {
                "number": 95,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا حَفْصٌ عَنْ أَشْعَثَ عَنْ ابْنِ سِيرِينَ أَنَّهُ كَانَ لَا يَقُولُ بِرَأْيِهِ إِلَّا شَيْئًا سَمِعَهُ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Hafsh] dari [`Asy'ats] dari [Ibnu Sirin]: \"Bahwasanya ia tidak pernah berkata dengan pendapatnya kecuali sesuatu yang pernah ia dengar\". "
            },
            {
                "number": 96,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ قَالَ مَا قُلْتُ بِرَأْيِي مُنْذُ ثَلَاثُونَ سَنَةً قَالَ أَبُو هِلَالٍ مُنْذُ أَرْبَعِينَ سَنَةً",
                "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] ia berkata: \" Aku tidak pernah berpendapat dengan pendapatku semata sejak tiga puluh tahun yang lalu. [Abu Hilal] berkata: \"Bahkan sejak empat puluh tahun\". "
            },
            {
                "number": 97,
                "arab": " حَدَّثَنَا مَخْلَدُ بْنُ مَالِكٍ حَدَّثَنَا حَكَّامُ بْنُ سَلْمٍ عَنْ أَبِي خَيْثَمَةَ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ قَالَ سُئِلَ عَطَاءٌ عَنْ شَيْءٍ قَالَ لَا أَدْرِي قَالَ قِيلَ لَهُ أَلَا تَقُولُ فِيهَا بِرَأْيِكَ قَالَ إِنِّي أَسْتَحْيِي مِنْ اللَّهِ أَنْ يُدَانَ فِي الْأَرْضِ بِرَأْيِي",
                "id": "Telah menceritakan kepada kami [Makhlad bin Malik] telah menceritakan kepada kami [Hakkam bin Salm] dari [Abu Khaitsamah] dari [Abdul Aziz bin Rufai'] ia berkata: ['Atho`] ditanya tentang suatu hal, lalu ia menjawab: 'Aku tidak tahu' kemudian seseorang berkata: 'mengapa kamu tidak jawab hal tersebut dengan pendapatmu (saja)? ', ia menjawab: ' Aku malu kepada Allah untuk menjadikan pendapatku sebagai pedoman di muka bumi'.\"."
            },
            {
                "number": 98,
                "arab": " أَخْبَرَنَا إِسْمَعِيلُ بْنُ أَبَانَ حَدَّثَنَا حَاتِمٌ هُوَ ابْنُ إِسْمَعِيلَ عَنْ عِيسَى عَنْ الشَّعْبِيِّ قَالَ إِيَّاكُمْ وَالْمُقَايَسَةَ وَالَّذِي نَفْسِي بِيَدِهِ لَئِنْ أَخَذْتُمْ بِالْمُقَايَسَةِ لَتُحِلُّنَّ الْحَرَامَ وَلَتُحَرِّمُنَّ الْحَلَالَ وَلَكِنْ مَا بَلَغَكُمْ عَنْ مَنْ حَفِظَ مِنْ أَصْحَابِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاعْمَلُوا بِهِ",
                "id": "Telah mengabarkan kepada kmi [Ismail bin Abaan] telah menceritakan kepada kami [Hatim] dari [Isa] dari [As Sya'bi] ia berkata: \" Berhati-hatilah kalian melakukan qiyas dengan semata-mata mengandalkan otak (rasio) semata, demi Dzat yang jiwaku berada di tanganNya, jika kalian melakukannya maka kalian akan menghalalkan yang haram dan mengharamkan yang halal, tetapi berita yang sampai kepada kalian dari para sahabat Muhammad shallallahu 'alaihi wasallam yang pandai agama, kerjakanlah\"."
            },
            {
                "number": 99,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ ابْنِ عَوْنٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ عَلْقَمَةَ قَالَ جَاءَ رَجُلٌ إِلَى عَبْدِ اللَّهِ فَقَالَ إِنَّهُ طَلَّقَ امْرَأَتَهُ الْبَارِحَةَ ثَمَانِيًا قَالَ بِكَلَامٍ وَاحِدٍ قَالَ بِكَلَامٍ وَاحِدٍ قَالَ فَيُرِيدُونَ أَنْ يُبِينُوا مِنْكَ امْرَأَتَكَ قَالَ نَعَمْ قَالَ وَجَاءَهُ رَجُلٌ فَقَالَ إِنَّهُ طَلَّقَ امْرَأَتَهُ مِائَةَ طَلْقَةٍ قَالَ بِكَلَامٍ وَاحِدٍ قَالَ بِكَلَامٍ وَاحِدٍ قَالَ فَيُرِيدُونَ أَنْ يُبِينُوا مِنْكَ امْرَأَتَكَ قَالَ نَعَمْ فَقَالَ عَبْدُ اللَّهِ مَنْ طَلَّقَ كَمَا أَمَرَهُ اللَّهُ فَقَدْ بَيَّنَ اللَّهُ الطَّلَاقَ وَمَنْ لَبَّسَ عَلَى نَفْسِهِ وَكَّلْنَا بِهِ لَبْسَهُ وَاللَّهِ لَا تُلَبِّسُونَ عَلَى أَنْفُسِكُمْ وَنَتَحَمَّلُهُ نَحْنُ هُوَ كَمَا تَقُولُونَ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin 'Amir] dari [Ibnu 'Aun] dari [Muhammad bin Sirin] dari [Alqamah] ia berkata: Seseorang menemui Abdullah, ia menyampaikan uneg-unegnya bahwa ia semalam telah menceraikan isterinya sebanyak delapan kali. Ia (Abdullah) bertanya: 'dengan satu ucapan? ', orang itu menjawab: 'dengan satu ucapan'. Abdullah bertanya: Terus mereka menginginkan agar kamu (menthalaq) ba`in isterimu'?, ia menjawab: 'Ya, benar'. Kemudian ('Alqamah) menceritakan lagi: \" Dan juga pernah Abdullah didatangi seseorang dan menceritakan bahwa ia telah menceraikan isterinya seratus kali'. Abdullah bertanya: 'dengan satu ucapan? ', ia menjawab: 'ya, dengan satu ucapan'. Lalu Abdullah bertanya: 'terus mereka menginginkan agar kamu (menthalaq) ba`in isterimu? ', ia menjawab: 'ya, benar'. Maka [Abdullah] berkata: \" Barang siapa yang menthalaq (isterinya) sesuai dengan cara yang telah Allah jelaskan, sungguh Allah telah menjelaskan thalaq. Sebaliknya barang siapa melakukan tindakan gegabah pada dirinya (tindakan ngawur yang tak ada keterangan), kami pasrahkan kengawuran atau gegabahannya kepadanya, demi Allah, Janganlah sekali-kali kalian melakukan tindakan gegabah diri kalian, sehingga kami merasa kepayahan sebagaimana uneg-uneg yang kalian sampaikan kepadaku ini'\"."
            },
            {
                "number": 100,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ الْقَاسِمِ قَالَ لَأَنْ يَعِيشَ الرَّجُلُ جَاهِلًا بَعْدَ أَنْ يَعْلَمَ حَقَّ اللَّهِ عَلَيْهِ خَيْرٌ لَهُ مِنْ أَنْ يَقُولَ مَا لَا يَعْلَمُ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Harb] telah menceritaklan kepada kami [Hammad bin Zaid] dari [Yahya bin Sa'id] dari [Al Qasim] ia berkata: Seseorang hidup dalam kebodohan setelah ia mengetahui hak Allah atasnya itu lebih baik baginya dari pada ia mengatakan apa yang tidak ia ketahui\". "
            },
            {
                "number": 101,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ ابْنِ عَوْنٍ قَالَ سُئِلَ الْقَاسِمُ عَنْ شَيْءٍ قَدْ سَمَّاهُ فَقَالَ مَا أَضْطَرُّ إِلَى مَشُورَةٍ وَمَا أَنَا مِنْ ذَا فِي شَيْءٍ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin 'Amir] dari [Ibnu 'Aun] ia berkata: \"Pernah [Al Qasim] ditanya tentang suatu hal yang ia ceritakan, maka ia menjawab: ' Aku tidak perlu untuk bermusyawarah, dan itu kuanggap tidak masalah\"."
            },
            {
                "number": 102,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ عَنْ يَحْيَى قَالَ قُلْتُ لِلْقَاسِمِ مَا أَشَدَّ عَلَيَّ أَنْ تُسْأَلَ عَنْ الشَّيْءِ لَا يَكُونُ عِنْدَكَ وَقَدْ كَانَ أَبُوكَ إِمَامًا قَالَ إِنَّ أَشَدَّ مِنْ ذَلِكَ عِنْدَ اللَّهِ وَعِنْدَ مَنْ عَقَلَ عَنْ اللَّهِ أَنْ أُفْتِيَ بِغَيْرِ عِلْمٍ أَوْ أَرْوِيَ عَنْ غَيْرِ ثِقَةٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] dari [Sufyan bin 'Uyainah] dari [Yahya] ia berkata: \"Aku berkata kepada [Al Qasim]: 'Alangkah berat bagiku jika engkau ditanya tentang sesuatu dan engkau tidak mengetahuinya sementara ayahmu adalah seorang imam? '. Ia berkata: 'Yang lebih berat dari hal itu di sisi Allah dan orang-orang yang memahami Allah yaitu aku berfatwa tanpa dasar ilmu atau aku meriwayatkan (satu hadits) dari seorang yang tidak dipercaya'\"."
            },
            {
                "number": 103,
                "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا حَمَّادُ بْنُ يَزِيدَ الْمِنْقَرِيُّ حَدَّثَنِي أَبِي قَالَ جَاءَ رَجُلٌ يَوْمًا إِلَى ابْنِ عُمَرَ فَسَأَلَهُ عَنْ شَيْءٍ لَا أَدْرِي مَا هُوَ فَقَالَ لَهُ ابْنُ عُمَرَ لَا تَسْأَلْ عَمَّا لَمْ يَكُنْ فَإِنِّي سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَلْعَنُ مَنْ سَأَلَ عَمَّا لَمْ يَكُنْ",
                "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Ahmad bin Yazid Al Manqari] telah menceritakan kepadaku [ayahku] ia berkata: \"Pada suatu hari seseorang datang kepada Ibnu umar radliallahu 'anhu, ia menanyakan sesuatu tetapi aku tidak tahu hal apa itu. Kemudian [Ibnu Umar] radliallahu 'anhu berkata: \"Janganlah kamu menanyakan sesuatu yang belum terjadi, karena aku pernah mendengar [Umar bin Khtthab] radliallahu 'anhu melaknat orang yang bertanya suatu hal yang belum terjadi\"."
            },
            {
                "number": 104,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ بَلَغَنَا أَنَّ زَيْدَ بْنَ ثَابِتٍ الْأَنْصَارِيَّ كَانَ يَقُولُ إِذَا سُئِلَ عَنْ الْأَمْرِ أَكَانَ هَذَا فَإِنْ قَالُوا نَعَمْ قَدْ كَانَ حَدَّثَ فِيهِ بِالَّذِي يَعْلَمُ وَالَّذِي يَرَى وَإِنْ قَالُوا لَمْ يَكُنْ قَالَ فَذَرُوهُ حَتَّى يَكُونَ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Nafi'] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] ia berkata: \" [Telah sampai berita] kepada kami bahwa [Zaid bin Tsabit Al `Anshari] radliallahu 'anhu, apabila ia ditanya sesuatu selalu berkata: ' Apakah hal ini sudah terjadi? ', apabila mereka menjawab: 'Ya', sungguh ia menjawab pertanyaan sesuai dengan apa yang ia ketahui, tetapi jika mereka menjawab: 'belum terjadi', maka ia pasti mengatakan: 'tunggulah sampai benar-benar terjadi'\"."
            },
            {
                "number": 105,
                "arab": " أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَبُو هِشَامٍ الْمَخْزُومِيُّ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا دَاوُدُ عَنْ عَامِرٍ قَالَ سُئِلَ عَمَّارُ بْنُ يَاسِرٍ عَنْ مَسْأَلَةٍ فَقَالَ هَلْ كَانَ هَذَا بَعْدُ قَالُوا لَا قَالَ دَعُونَا حَتَّى تَكُونَ فَإِذَا كَانَتْ تَجَشَّمْنَاهَا لَكُمْ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Abu Hisyam Al Makhzumi] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Daud] dari ['Amir] ia berkata: \" ['Ammar bin Yasir] radliallahu 'anhu jika ditanya tentang suatu masalah, maka ia berkata: ' Apakah hal ini sudah terjadi?, mereka menjawab: 'belum', ia berkata: 'biarkanlah sampai hal itu benar-benar terjadi. Apabila telah terjadi kami akan memberikan jawabannya kepada kalian\"."
            },
            {
                "number": 106,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ طَاوُسٍ قَالَ قَالَ عُمَرُ عَلَى الْمِنْبَرِ أُحَرِّجُ بِاللَّهِ عَلَى رَجُلٍ سَأَلَ عَمَّا لَمْ يَكُنْ فَإِنَّ اللَّهَ قَدْ بَيَّنَ مَا هُوَ كَائِنٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad] telah menceritakan kepada kami [Sufyan] dari ['Amr] dari [Thawus] ia berkata: \" [Umar] radliallahu 'anhu berkata (ketika) di atas mimbar: ' Demi Allah aku sangat tidak suka dengan orang yang bertanya sesuatu yang belum terjadi, sebab Allah menjelaskan permasalahan yang terjadi'\"."
            },
            {
                "number": 107,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ عَطَاءٍ عَنْ سَعِيدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ مَا رَأَيْتُ قَوْمًا كَانُوا خَيْرًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا سَأَلُوهُ إِلَّا عَنْ ثَلَاثَ عَشْرَةَ مَسْأَلَةً حَتَّى قُبِضَ كُلُّهُنَّ فِي الْقُرْآنِ مِنْهُنَّ { يَسْأَلُونَكَ عَنْ الشَّهْرِ الْحَرَامِ } { وَيَسْأَلُونَكَ عَنْ الْمَحِيضِ } قَالَ مَا كَانُوا يَسْأَلُونَ إِلَّا عَمَّا يَنْفَعُهُمْ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Muhammad bin Abu Syaibah] telah menceritakan kepada kami [Ibnu Fudlail] dari ['Atho`] dari [Sa'id] dari [Ibnu 'Abbas] radliallahu 'anhu ia berkata: \" Aku tidak pernah melihat suatu kaum yang lebih baik dari pada para sahabat Rasulullah shallallahu 'alaihi wasallam, mereka tidak pernah menanyakan (kepada Nabi shallallahu 'alaihi wasallam) sampai beliau wafat kecuali tentang tiga belas masalah, semuanya ada dalam Al Qur`an. Diantara yang ditanyakan itu adalah: \"YAS`ALUUNAKA ANISSYAHRIL HARAAM\" (Mereka bertanya kepadamu tentang bulan-bulan haram) -Qs. Al Baqarah: 217-, dan \"WA YAS`ALUNAKA ANIL MAHIDL\" (Mereka bertanya kepada kamu tentang haidl) -Qs. Al Baqarah: 222-\"."
            },
            {
                "number": 108,
                "arab": " حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا ابْنُ عَوْنٍ عَنْ عُمَيْرِ بْنِ إِسْحَقَ قَالَ لَمَنْ أَدْرَكْتُ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْثَرُ مِمَّنْ سَبَقَنِي مِنْهُمْ فَمَا رَأَيْتُ قَوْمًا أَيْسَرَ سِيرَةً وَلَا أَقَلَّ تَشْدِيدًا مِنْهُمْ",
                "id": "Telah menceritakan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Ibnu 'Aun] dari ['Umair bin Ishaq] ia berkata: \" Orang-orang yang sempat aku temui dari para sahabat Rasulullah shallallahu 'alaihi wasallam lebih banyak yang telah wafat mendahuluiku, aku tidak pernah dapati satu kaum yang lebih ringan perjalanan hidupnya dan lebih sederhana dalam suatu permasalahan dari pada mereka\"."
            },
            {
                "number": 109,
                "arab": " أَخْبَرَنِي الْعَبَّاسُ بْنُ سُفْيَانَ عَنْ زَيْدِ بْنِ حُبَابٍ أَخْبَرَنِي رَجَاءُ بْنُ أَبِي سَلَمَةَ قَالَ سَمِعْتُ عُبَادَةَ بْنَ نُسَيٍّ الْكِنْدِيَّ وَسُئِلَ عَنْ امْرَأَةٍ مَاتَتْ مَعَ قَوْمٍ لَيْسَ لَهَا وَلِيٌّ فَقَالَ أَدْرَكْتُ أَقْوَامًا مَا كَانُوا يُشَدِّدُونَ تَشْدِيدَكُمْ وَلَا يَسْأَلُونَ مَسَائِلَكُمْ",
                "id": "Telah mengabarkan kepadaku [Al 'Abbas bin Sufyan] dari [Zaid bin Hubab] telah mengabarkan kepadaku [Raja` bin Abu Salamah] ia berkata: \"Aku pernah mendengar ['Ubadah bin Nusai Al Kindi], ia ditanya tentang seorang wanita yang mati di suatu kaum dan tidak memiliki wali, maka ia berkata: ' Telah aku dapati beberapa kaum mereka tidak memiliki sikap keras sekeras kalian, mereka juga tidak menanyakan apa yang kalian tanyakan'\"."
            },
            {
                "number": 110,
                "arab": " أَخْبَرَنَا الْعَبَّاسُ بْنُ سُفْيَانَ أَخْبَرَنَا زَيْدُ بْنُ حُبَابٍ أَخْبَرَنِي رَجَاءُ بْنُ أَبِي سَلَمَةَ حَدَّثَنِي خَالِدُ بْنُ حَازِمٍ عَنْ هِشَامِ بْنِ مُسْلِمٍ الْقُرَشِيِّ قَالَ كُنْتُ مَعَ ابْنِ مُحَيْرِيزٍ بِمَرْجِ الدِّيبَاجِ فَرَأَيْتُ مِنْهُ خَلْوَةً فَسَأَلْتُهُ عَنْ مَسْأَلَةٍ فَقَالَ لِي مَا تَصْنَعُ بِالْمَسَائِلِ قُلْتُ لَوْلَا الْمَسَائِلُ لَذَهَبَ الْعِلْمُ قَالَ لَا تَقُلْ ذَهَبَ الْعِلْمُ إِنَّهُ لَا يَذْهَبُ الْعِلْمُ مَا قُرِئَ الْقُرْآنُ وَلَكِنْ لَوْ قُلْتَ يَذْهَبُ الْفِقْهُ",
                "id": "Telah mengabarkan kepada kami [Al 'Abbas bin Sufyan] telah mengabarkan kepada kami [Zaid bin Hubab] telah mengabarkan kepadaku [Raja` bin Abu Salamah] telah menceritaan kepadaku [Khalid bin Hazim] dari [Hisyam bin Muslim Al Qurasyi] ia berkata: \"Dahulu aku bersama [Ibnu Muhairiz] di hamparan sutra, aku melihatnya sedang sendirian lalu aku menanyakan sesuatu hal, maka ia menanyakan kepadaku: ' Apa yang akan kamu lakukan tentang permasalahan-permasalahan tersebut? 'Aku menjawab: 'Sekiranya tidak ada (pembahasan) masalah-masalah maka akan hilanglah ilmu. Ia pun berkata 'Kamu jangan mengatakan ilmu itu hilang, ilmu tidak akan hilang selama Al- Qur`an dibaca, akan tetapi yang paling tepat kau katakan telah hilang pemahaman terhadapnya'\"."
            },
            {
                "number": 111,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ أَنَّ عُمَرَ قَالَ يَا أَيُّهَا النَّاسُ إِنَّا لَا نَدْرِي لَعَلَّنَا نَأْمُرُكُمْ بِأَشْيَاءَ لَا تَحِلُّ لَكُمْ وَلَعَلَّنَا نُحَرِّمُ عَلَيْكُمْ أَشْيَاءَ هِيَ لَكُمْ حَلَالٌ إِنَّ آخِرَ مَا نَزَلَ مِنْ الْقُرْآنِ آيَةُ الرِّبَا وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يُبَيِّنْهَا لَنَا حَتَّى مَاتَ فَدَعُوا مَا يَرِيبُكُمْ إِلَى مَا لَا يَرِيبُكُمْ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Salamah] dari [Daud] dari [As Sya'bi], bahwasanya [Umar] radliallahhu 'anhu berkata; \"Wahai manusia, kami tidak mengetahui mungkin saja kami memerintah kalian melakukan beberapa hal yang tidak halal bagi kalian, dan mungkin saja kami mengharamkan beberapa hal atas kalian padahal ia halal bagi kalian, sesungguhnya yang terakhir turun dari Al Qur`an adalah ayat (tentang) riba. Dan Rasulullah shallallahu 'alaihi wasallam tidak menjelaskannya kepada kami hingga beliau wafat maka tinggalkanlah apa saja yang membuat kalian ragu dan berpeganglah pada sesuatau yang kalian tidak ragu (padanya).\" "
            },
            {
                "number": 112,
                "arab": " أَخْبَرَنَا سَلْمُ بْنُ جُنَادَةَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ عَمِّهِ قَالَ خَرَجْتُ مِنْ عِنْدِ إِبْرَاهِيمَ فَاسْتَقْبَلَنِي حَمَّادٌ فَحَمَّلَنِي ثَمَانِيَةَ أَبْوَابٍ مَسَائِلَ فَسَأَلْتُهُ فَأَجَابَنِي عَنْ أَرْبَعٍ وَتَرَكَ أَرْبَعًا",
                "id": "Telah mengabarkan kepada kami [Salm bin Junadah] telah menceritakan kepada kami [Ibnu Idris] dari [pamannya] ia berkata: \"Aku baru saja pulang dari majlis [Ibrahim], lalu Hammad menemuiku dan memberi tugas kepadaku delapan permasalahan. Hari selanjutnya kedelapan masalah itu kutanyakan kepadanya, lalu ia menjawab empat permasalahan dan meninggalkan empat permasalahan (lainnya) \". "
            },
            {
                "number": 113,
                "arab": " أَخْبَرَنَا قَبِيصَةُ أَخْبَرَنَا سُفْيَانُ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبْجَرَ عَنْ زُبَيْدٍ قَالَ مَا سَأَلْتُ إِبْرَاهِيمَ عَنْ شَيْءٍ إِلَّا عَرَفْتُ الْكَرَاهِيَةَ فِي وَجْهِهِ",
                "id": "Telah mengabarkan kepada kami [Qabishah] Telah mengabarkan kepada kami [Sufiyan] dari [Abdul Malik bin Abjar] dari [Zubaid] ia berkata: \" Tidaklah aku bertanya kepada [Ibrahim] tentang satu hal kecuali aku melihat tanda ketidaksukaan di wajahnya\"."
            },
            {
                "number": 114,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ عَنْ عُمَرَ بْنِ أَبِي زَائِدَةَ قَالَ مَا رَأَيْتُ أَحَدًا أَكْثَرَ أَنْ يَقُولَ إِذَا سُئِلَ عَنْ شَيْءٍ لَا عِلْمَ لِي بِهِ مِنْ الشَّعْبِيِّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad] telah menceritakan kepada kami [Ishaq bin Mansur] dari [Umar bin Abu Zaidah] ia berkata: \" Aku tidak pernah melihat seorangpun lebih banyak mengatakan: 'aku tidak mempunyai ilmu tentang hal itu' -ketika ia ditanya tentang suatu permasalahan- dibandingkan dengan [As Sya'bi] \"."
            },
            {
                "number": 115,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ أَخْبَرَنَا أَحْمَدُ بْنُ بَشِيرٍ حَدَّثَنَا شُعْبَةُ عَنْ جَعْفَرِ بْنِ إِيَاسٍ قَالَ قُلْتُ لِسَعِيدِ بْنِ جُبَيْرٍ مَا لَكَ لَا تَقُولُ فِي الطَّلَاقِ شَيْئًا قَالَ مَا مِنْهُ شَيْءٌ إِلَّا قَدْ سَأَلْتُ عَنْهُ وَلَكِنِّي أَكْرَهُ أَنْ أُحِلَّ حَرَامًا أَوْ أُحَرِّمَ حَلَالًا",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Sa'id] telah mengabarkan kepada kami [Ahmad bin Basyir] telah menceritakan kepada kami [Syu'bah] dari [Ja'far bin Iyas] ia berkata: \"Aku bertanya kepada [Sa'id bin Jubair] radliallahu 'anhu ' Apa yang membuat engkau tidak mengatakan (mengeluarkan pendapat hukum) tentang thalaq? ia menjawab tidak ada satu pun masalah tentang thalaq kecuali aku pernah menanyakannya, akan tetapi aku khawatir, aku menghalalkan yang haram dan mengharamkan yang halal'\"."
            },
            {
                "number": 116,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ عَطَاءِ بْنِ السَّائِبِ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى يَقُولُ لَقَدْ أَدْرَكْتُ فِي هَذَا الْمَسْجِدِ عِشْرِينَ وَمِائَةً مِنْ الْأَنْصَارِ وَمَا مِنْهُمْ مِنْ أَحَدٍ يُحَدِّثُ بِحَدِيثٍ إِلَّا وَدَّ أَنَّ أَخَاهُ كَفَاهُ الْحَدِيثَ وَلَا يُسْأَلُ عَنْ فُتْيَا إِلَّا وَدَّ أَنَّ أَخَاهُ كَفَاهُ الْفُتْيَا",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari ['Atho`bin As Sa`ib] ia berkata aku pernah mendengar [Abdurrahman bin Abu Laila] mengatakan: \" Sungguh telah kudapati di masjid ini (Nabawi) seratus dua puluh orang dari kaum anshar, tidak ada seorang pun dari mereka yang menceritakan suatu hadits kecuali ia lebih senang jika saudaranya yang mengutarakan hadis, Dan tidaklah ia ditanya tentang satu fatwa hukum melainkan ia lebih senang jika saudaranya yang mengutarakan fatwa\". "
            },
            {
                "number": 117,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ الْحَجَّاجِ قَالَ سَمِعْتُ سُفْيَانَ عَنْ ابْنِ الْمُنْكَدِرِ قَالَ إِنَّ الْعَالِمَ يَدْخُلُ فِيمَا بَيْنَ اللَّهِ وَبَيْنَ عِبَادِهِ فَلْيَطْلُبْ لِنَفْسِهِ الْمَخْرَجَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Al Hajjaj] ia berkata: Aku mendengar [Sufyan] dari [Ibnu Al Munkadir] ia berkata \" Seorang ulama (berada) diantara Allah dan para hambaNya, maka hendaklah ia meminta jalan keluar untuk dirinya\"."
            },
            {
                "number": 118,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ مِسْعَرٍ قَالَ أَخْرَجَ إِلَيَّ مَعْنُ بْنُ عَبْدِ الرَّحْمَنِ كِتَابًا فَحَلَفَ لِي بِاللَّهِ إِنَّهُ خَطُّ أَبِيهِ فَإِذَا فِيهِ قَالَ عَبْدُ اللَّهِ وَالَّذِي لَا إِلَهَ إِلَّا هُوَ مَا رَأَيْتُ أَحَدًا كَانَ أَشَدَّ عَلَى الْمُتَنَطِّعِينَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا رَأَيْتُ أَحَدًا كَانَ أَشَدَّ عَلَيْهِمْ مِنْ أَبِي بَكْرٍ وَإِنِّي لَأَرَى عُمَرَ كَانَ أَشَدَّ خَوْفًا عَلَيْهِمْ أَوْ لَهُمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Qudamah] telah mengabarkan kepada kami [Abu Usamah] dari [Mis'ar] ia berkata: [Ma'an bin Abdur Rahman] pernah menyodorkan kepadaku sebuah kitab dan ia bersumpah dengan kalimat, \"Demi Allah, kitab tersebut adalah hasil tulisan [Ayahnya]. Ternyata dalam kitab tersebut terdapat tulisan ' [Abdullah] berkata; \" Demi Dzat yang tidak ada Tuhan melainkan Dia, aku tidak pernah melihat orang yang sikapnya lebih keras terhadap orang-orang yang suka melampui batas daripada Rasulullah shallallahu'alaihi wasallam, selanjutnya tidak kulihat orang yang lebih keras sikapnya terhadap mereka daripada Abu Bakar radliallahu 'anhu. Dan aku lihat Umar termasuk orang yang paling khawatir terhadap mereka atau bencana yang akan menimpa mereka \"."
            },
            {
                "number": 119,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زَمْعَةُ بْنُ صَالِحٍ عَنْ عُثْمَانَ بْنِ حَاضِرٍ الْأَزْدِيِّ قَالَ دَخَلْتُ عَلَى ابْنِ عَبَّاسٍ فَقُلْتُ أَوْصِنِي فَقَالَ نَعَمْ عَلَيْكَ بِتَقْوَى اللَّهِ وَالِاسْتِقَامَةِ اتَّبِعْ وَلَا تَبْتَدِعْ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zam'ah bin Shalih] dari [Utsman bin Hadlr Al Azdi] ia berkata; \" Aku pernah datang menemui [Ibnu Abbas] radliallahu 'anhu, kemudian aku berkata kepadanya: 'Berikanlah wasiat untukku'. Ia menjawab; Ya, akan aku berikan wasiat untukmu. Bertaqwalah kepada Allah dan bersikaplah istiqomah di jalanNya. Ikutilah sunnah dan jangan membuat bid'ah\"."
            },
            {
                "number": 120,
                "arab": " أَخْبَرَنَا يُوسُفُ بْنُ مُوسَى حَدَّثَنَا أَزْهَرُ عَنْ ابْنِ عَوْنٍ عَنْ ابْنِ سِيرِينَ قَالَ مَا دَامَ عَلَى الْأَثَرِ فَهُوَ عَلَى الطَّرِيقِ",
                "id": "Telah mengabarkan kepada kami [Yusuf bin Musa] telah menceritakan kepada kami [Azhar] dari [Ibnu 'Aun] dari [Ibnu Sirin] ia berkata; \" Selama seseorang di rel atsar, berarti ia berada di atas jalur yang benar\". "
            },
            {
                "number": 121,
                "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي قِلَابَةَ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ تَعَلَّمُوا الْعِلْمَ قَبْلَ أَنْ يُقْبَضَ وَقَبْضُهُ أَنْ يَذْهَبَ أَهْلُهُ أَلَا وَإِيَّاكُمْ وَالتَّنَطُّعَ وَالتَّعَمُّقَ وَالْبِدَعَ وَعَلَيْكُمْ بِالْعَتِيقِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al `Auza'i] dari [Yahya bin Abu Katsir] dari [Abu Qilabah] ia berkata; [Abdullah bin Mas'ud] radliallahu 'anhu berkata; \" Pelajarilah ilmu sebelum ia dicabut. Dan, dicabutnya ilmu dengan cara ulama diwafatkan. Oleh karena itu, tinggalkanlah bid'ah, bersilat lidah dan sikap sering mengada-ada dan melampui batas hingga persoalan menjadi rumit. Dan, berpegang teguhlah kepada sesuatu yang kuno, yaitu sunnah dan atsar (ucapan sahabat) \"."
            },
            {
                "number": 122,
                "arab": " أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُوسَى حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَجْرَؤُكُمْ عَلَى الْفُتْيَا أَجْرَؤُكُمْ عَلَى النَّارِ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Musa] telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Sa'id bin Abu Ayyub] dari ['ubaidhullah bin Abu Ja'far] ia berkata: \"Rasulullah shallallahu 'alaihi wasallam bersabda: ' Siapa yang paling tergesa-gesa dalam mengeluarkan fatwa, ialah yang paling cepat menuju ke neraka'\"."
            },
            {
                "number": 123,
                "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ عَبْدَةَ بْنِ أَبِي لُبَابَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ مَنْ أَحْدَثَ رَأْيًا لَيْسَ فِي كِتَابِ اللَّهِ وَلَمْ تَمْضِ بِهِ سُنَّةٌ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَدْرِ عَلَى مَا هُوَ مِنْهُ إِذَا لَقِيَ اللَّهَ عَزَّ وَجَلَّ",
                "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al `Auza'i] dari ['Abdah bin Abu Lubabah] dari [Ibnu Abbas] radliallahu 'anhu ia berkata: \" Barang siapa yang mengada-adakan pendapat selain dari Kitab Allah dan sunnah Rasulullah shallallahu 'alaihi wasallam, ia tidak tahu bagaimana kondisinya ketika bertemu Allah kelak\"."
            },
            {
                "number": 124,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي سِنَانٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ مَنْ أَفْتَى بِفُتْيَا يُعَمَّى عَلَيْهَا فَإِثْمُهَا عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Abu Sinan] dari [Sa'id bin Jubair] dari [Ibnu Abbas] radliallahu 'anhu ia berkata: \" Barang siapa berfatwa tidak diketahui dasarnya, dosanya dilimpahkan kepadanya\"."
            },
            {
                "number": 125,
                "arab": " أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ حَدَّثَنَا الْحُسَيْنُ بْنُ الْوَلِيدِ عَنْ وُهَيْبٍ عَنْ هِشَامٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ أَنَّهُ كَانَ لَا يُفْتِي فِي الْفَرْجِ بِشَيْءٍ فِيهِ اخْتِلَافٌ",
                "id": "Telah mengabarkan kepada kami [Al Husain bin mansur] telah menceritakan kepada kami [Al Husain bin Al Walid] dari [Wuhaib] dari [Hisyam] dari [Muhammad bin Sirin] Bahwasanya ia tidak pernah berfatwa tentang permasalahan farji (kemaluan) yang masih ada perbedaan pendapat pada masalah tersebut\"."
            },
            {
                "number": 126,
                "arab": " حَدَّثَنَا بِشْرُ بْنُ الْحَكَمِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَ سَأَلْتُهُ عَنْ رَجُلٍ أَدْرَكَهُ رَمَضَانَانِ فَقَالَ أَكَانَ أَوْ لَمْ يَكُنْ قَالَ لَمْ يَكُنْ بَعْدُ فَقَالَ اتْرُكْ بَلِيَّتَهُ حَتَّى تَنْزِلَ قَالَ فَدَلَسْنَا لَهُ رَجُلًا فَقَالَ قَدْ كَانَ فَقَالَ يُطْعِمُ عَنْ الْأَوَّلِ مِنْهُمَا ثَلَاثِينَ مِسْكِينًا لِكُلِّ يَوْمٍ مِسْكِينٌ",
                "id": "Telah mengabarkan kepada kami [Bisyr bin Al Hakam] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari ['Amr bin Maimun] dari [ayahnya] dari [Ibnu Abbas] radliallahu 'anhu: \"Aku pernah bertanya kepadanya (Ibnu Abbas radliallahu 'anhu) tentang seseorang yang mendapati dua bulan ramadhan, lalu ia berkata: ' Apakah sudah terjadi atau belum? ', ia menjawab: 'belum terjadi'. Kemudian ia berkata: 'Tinggalkanlah sampai hal itu terjadi', ia berkata: 'kami menyiasati dengan pura-pura (menghadirkan) seseorang, lalu ia berkata: 'sudah pernah terjadi', maka (Ibnu Abbas) mnjawab: 'Ia harus memberi makan untuk (bulan ramadhan) yang pertama sebanyak tiga puluh orang miskin, setiap harinya satu orang miskin'\"."
            },
            {
                "number": 127,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عِمْرَانَ حَدَّثَنَا إِسْحَقُ بْنُ سُلَيْمَانَ حَدَّثَنَا الْعُمَرِيُّ عَنْ عُبَيْدِ بْنِ جُرَيْجٍ قَالَ كُنْتُ أَجْلِسُ بِمَكَّةَ إِلَى ابْنِ عُمَرَ يَوْمًا وَإِلَى ابْنِ عَبَّاسٍ يَوْمًا فَمَا يَقُولُ ابْنُ عُمَرَ فِيمَا يُسْأَلُ لَا عِلْمَ لِي أَكْثَرُ مِمَّا يُفْتِي بِهِ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Imran] telah menceritakan kepada kami [Ishaq bin Sulaiman] telah menceritakan kepada kami [Al 'Umari] dari ['Ubaid bin Juraij] ia berkata: \"Dahulu sewaktu di Makkah aku selalu duduk di (kajian ilmu) Ibnu Umar radliallahu 'anhu sehari dan di (kajian) Ibnu Abbas di hari lainnya. Dan [Ibnu Umar] ketika ditanya lebih banyak menjawab dengan jawaban: ' Aku tidak tahu' dibandingkan berfatwa dalam masalah tersebut\". "
            },
            {
                "number": 128,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ قَالَ قَالَ عَبْدُ اللَّهِ تَعَلَّمُوا فَإِنَّ أَحَدَكُمْ لَا يَدْرِي مَتَى يُخْتَلُّ إِلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Al A'masy] dari [Abu Wa`il] ia berkata: \" [Abdullah] berkata: ' Hendaklah kalian belajar, karena salah seorang diantara kalian tidak tahu kapan ia diperselisihkan'\"."
            },
            {
                "number": 129,
                "arab": " أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مُوسَى وَعَمْرُو بْنُ زُرَارَةَ عَنْ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ عَنْ أَبِي سُهَيْلٍ قَالَ كَانَ عَلَى امْرَأَتِي اعْتِكَافُ ثَلَاثَةِ أَيَّامٍ فِي الْمَسْجِدِ الْحَرَامِ فَسَأَلْتُ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ وَعِنْدَهُ ابْنُ شِهَابٍ قَالَ قُلْتُ عَلَيْهَا صِيَامٌ قَالَ ابْنُ شِهَابٍ لَا يَكُونُ اعْتِكَافٌ إِلَّا بِصِيَامٍ فَقَالَ لَهُ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ أَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا قَالَ فَعَنْ أَبِي بَكْرٍ قَالَ لَا قَالَ فَعَنْ عُمَرَ قَالَ لَا قَالَ فَعَنْ عُثْمَانَ قَالَ لَا قَالَ عُمَرُ مَا أَرَى عَلَيْهَا صِيَامًا فَخَرَجْتُ فَوَجَدْتُ طَاوُسًا وَعَطَاءَ بْنَ أَبِي رَبَاحٍ فَسَأَلْتُهُمَا فَقَالَ طَاوُسٌ كَانَ ابْنُ عَبَّاسٍ لَا يَرَى عَلَيْهَا صِيَامًا إِلَّا أَنْ تَجْعَلَهُ عَلَى نَفْسِهَا قَالَ وَقَالَ عَطَاءٌ ذَلِكَ رَأْيِي",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Musa] dan ['Amru bin Zurarah] dari [Abdul Aziz bin Muhammad] dari [Abu Suhail] ia berkata; \"Dahulu, isteriku pernah bernadzar untuk beri'tikaf di Masjidil Haram selama tiga hari. Kemudian, aku bertanya kepada Umar bin Abdul Aziz rahimahullahu yang saat itu sedang bersama Syihab. Aku bertanya: 'Apakah ia juga wajib berpuasa? ', Ibnu Syihab menjawab: 'Tidak ada i'itikaf kecuali dilakukan sambil berpuasa'. Saat itu, Umar bin Abdul Aziz rahimahullahu terus bertanya: 'Adakah keterangan yang demikian berasal dari Nabi salallahu 'alihi wa sallam? ' Ia menjawab: 'tidak'. Kemudian, Umar bin Abdul Aziz rahimahullahu bertanya: 'Adakah keterangan dari Abu Bakar radliallahu 'anhu? ' ia menjawab: 'tidak ada', ia bertanya: 'adakah keterangan dari Umar radliallahu 'anhu? ', ia menjawab: 'tidak ada juga' ia bertanya: 'adakah keterangan dari Utsman radliallahu 'anhu? ', ia menjawab: 'tidak ada'. Umar rahimahullahu berkata: 'Menurutku tidak wajib bagi wanita itu untuk berpuasa', Lalu aku keluar dan bertemu Thawus dan 'Atho` bin Abu Rabbah, aku bertanya kepada keduanya. [Thawus] menjawab: 'Dahulu [Ibnu Abbas] radliallahu 'anhu (pernah berfatwa) bahwa wanita tersebut tidak wajib puasa, kecuali jika ia bernadzar untuk berpuasa'. Kemudian `Atha` berkata: 'Begitu juga pendapatku'\". "
            },
            {
                "number": 130,
                "arab": " حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبُو عَقِيلٍ حَدَّثَنَا سَعِيدٌ الْجُرَيْرِيُّ عَنْ أَبِي نَضْرَةَ قَالَ لَمَّا قَدِمَ أَبُو سَلَمَةَ الْبَصْرَةَ أَتَيْتُهُ أَنَا وَالْحَسَنُ فَقَالَ لِلْحَسَنِ أَنْتَ الْحَسَنُ مَا كَانَ أَحَدٌ بِالْبَصْرَةِ أَحَبَّ إِلَيَّ لِقَاءً مِنْكَ وَذَلِكَ أَنَّهُ بَلَغَنِي أَنَّكَ تُفْتِي بِرَأْيِكَ فَلَا تُفْتِ بِرَأْيِكَ إِلَّا أَنْ تَكُونَ سُنَّةٌ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ كِتَابٌ مُنْزَلٌ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Abu 'Aqil] telah menceritakan kepada kami [Sa'id Al Jurairi] dari [Abu Nadlrah] ia berkata: \"Sewaktu [Abu Salamah] datang ke kota Bashrah, aku dan Al Hasan menemuinya, lalu ia berkata kepada Al Hasan: 'Apakah kamu Al Hasan? ', Tidak ada seorang pun yang di kota ini yang lebih ingin aku temui melebihimu', hal itu karena telah sampai kabar kepadaku, bahwa kamu telah berfatwa dengan akalmu. Janganlah kamu berfatwa dengan pendapatmu, kecuali berdasarkan sunnah dari Rasulullah shallallahu 'alaihi wasallam, atau dari Kitab yang telah diturunkan (Al Qur`an) '\". "
            },
            {
                "number": 131,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ حُرَيْثِ بْنِ ظُهَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ أَتَى عَلَيْنَا زَمَانٌ لَسْنَا نَقْضِي وَلَسْنَا هُنَالِكَ وَإِنَّ اللَّهَ قَدْ قَدَّرَ مِنْ الْأَمْرِ أَنْ قَدْ بَلَغْنَا مَا تَرَوْنَ فَمَنْ عَرَضَ لَهُ قَضَاءٌ بَعْدَ الْيَوْمِ فَلْيَقْضِ فِيهِ بِمَا فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ فَإِنْ جَاءَهُ مَا لَيْسَ فِي كِتَابِ اللَّهِ فَلْيَقْضِ بِمَا قَضَى بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنْ جَاءَهُ مَا لَيْسَ فِي كِتَابِ اللَّهِ وَلَمْ يَقْضِ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلْيَقْضِ بِمَا قَضَى بِهِ الصَّالِحُونَ وَلَا يَقُلْ إِنِّي أَخَافُ وَإِنِّي أُرَى فَإِنَّ الْحَرَامَ بَيِّنٌ وَالْحَلَالَ بَيِّنٌ وَبَيْنَ ذَلِكَ أُمُورٌ مُشْتَبِهَةٌ فَدَعْ مَا يَرِيبُكَ إِلَى مَا لَا يَرِيبُكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Al A'masy] dari ['Umarah bin 'Umair] dari [Huraits bin Zhuhair] dari [Abdullah bin Mas'ud] ia berkata: \" Akan datang kepada kami satu zaman, kami bukan orang-orang yang memutuskan dan kami pun waktu itu tidak ada di situ, Dan sesungguhnya Allah sudah mentakdirkan sesuatu yang belum kalian lihat (belum terjadi). Maka barang siapa yang mendapatkan masalah setelah hari ini, hendaklah ia memutuskan sesuai dengan Kitab Allah subhanallahu wa ta'ala, jika masalahnya tidak ada dalam Al Qur`an, hendaklah ia memutuskan sesuai dengan apa yang telah diputuskan Rasulullah shallallahu 'alaihi wasallam. Tetapi jika ia datang kepadanya masalah yang tidak ada dalam Al Qur`an dan keputusan Rasulullah shallallahu 'alaihi wasallam, hendaklah ia memutuskan dengan apa yang telah diputuskan oleh orang-orang yang shalih, dan jangan ia katakan: 'Aku takut', atau berkata: 'Menurutku'. Sesungguhnya perkara yang haram telah jelas dan yang halal itu telah jelas dan diantara keduanya adalah perkara yang mutasyabih (samar-samar). Maka tinggalkan apa yang kalian ragu dan berpegang teguhlah pada sesuatu yang kalian tidak ragu padanya\"."
            },
            {
                "number": 132,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ ابْنِ مَسْعُودٍ قَالَ إِنَّ الَّذِي يُفْتِي النَّاسَ فِي كُلِّ مَا يُسْتَفْتَى لَمَجْنُونٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Al A'masy] dari [Abu Wa`il] dari [Ibnu Mas'ud] ia berkata: \" Orang yang selalu berfatwa dalam setiap permasalahan yang ditanyakan (kepadanya) adalah orang gila\". "
            },
            {
                "number": 133,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ هِشَامٍ عَنْ مُحَمَّدٍ عَنْ حُذَيْفَةَ قَالَ إِنَّمَا يُفْتِي النَّاسَ ثَلَاثَةٌ رَجُلٌ إِمَامٌ أَوْ وَالٍ وَرَجُلٌ يَعْلَمُ نَاسِخَ الْقُرْآنِ مِنْ الْمَنْسُوخِ قَالُوا يَا حُذَيْفَةُ وَمَنْ ذَاكَ قَالَ عُمَرُ بْنُ الْخَطَّابِ أَوْ أَحْمَقُ مُتَكَلِّفٌ",
                "id": "Telah menhabarkan kepada kami [Sa'id bin 'Amir] dari [Hisyam] dari [Muhammad] dari [Hudzaifah] ia berkata: \" Ada tiga golongan manusia yang memberikan fatwa (yaitu): Seorang imam, atau wali (yang mengatur urusan kaum muslimin) atau seorang yang mengetahui nasikh dan mansukh dalam Al Qur`an, mereka bertanya: 'Wahai Hudzaifah, lalu siapakah gerangan dia itu? ', Itu Umar bin Khatthab radliallahu 'anhu, Atau orang bodoh yang memaksakan diri'\"."
            },
            {
                "number": 134,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ أَخْبَرَنَا أَبُو أُسَامَةَ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ مُحَمَّدٍ عَنْ أَبِي عُبَيْدَةَ بْنِ حُذَيْفَةَ قَالَ قَالَ حُذَيْفَةُ إِنَّمَا يُفْتِي النَّاسَ أَحَدُ ثَلَاثَةٍ رَجُلٌ عَلِمَ نَاسِخَ الْقُرْآنِ مِنْ مَنْسُوخِهِ قَالُوا وَمَنْ ذَاكَ قَالَ عُمَرُ بْنُ الْخَطَّابِ قَالَ وَأَمِيرٌ لَا يَجِدُ بُدًّا أَوْ أَحْمَقُ مُتَكَلِّفٌ ثُمَّ قَالَ مُحَمَّدٌ فَلَسْتُ بِوَاحِدٍ مِنْ هَذَيْنِ وَأَرْجُو أَنْ لَا أَكُونَ الثَّالِثَ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Sa'id] telah mengabarkan kepada kami [Abu `Usamah] dari [Hisyam bin Hassan] dari [Muhammad] dari [Abu 'Ubaidah bin Hudzaifah] ia berkata: \" [Hudzaifah] berkata: 'Orang yang berfatwa kepada orang lain adalah salah satu dari tiga golongan: Seorang yang mengetahui nasikh dan mansukh dalam Al Qur`an', mereka bertanya: 'Siapakah ia gerangan? ', Umar bin Khatthab radliallahu 'anhu menyambung: 'atau seorang pemimpin yang tidak takut, atau orang bodoh yang memaksakan diri'\". Kemudian Muhammad berkata: \"Aku bukanlah satu dari dua kriteria (pertama) dan aku berharap tidak menjadi bagian yang ke tiga\"."
            },
            {
                "number": 135,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا حُمَيْدٌ عَنْ أَبِي رَجَاءٍ عَنْ أَبِي الْمُهَلَّبِ أَنَّ أَبَا مُوسَى قَالَ فِي خُطْبَتِهِ مَنْ عَلِمَ عِلْمًا فَلْيُعَلِّمْهُ النَّاسَ وَإِيَّاهُ أَنْ يَقُولَ مَا لَا عِلْمَ لَهُ بِهِ فَيَمْرُقَ مِنْ الدِّينِ وَيَكُونَ مِنْ الْمُتَكَلِّفِينَ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Humaid] dari [Abu Raja`] dari [Abu Al Muhallab]: \" [Abu Musa] radliallahu 'anhu berkata dalam khutbahnya: ' Barang siapa yang mengetahui suatu ilmu, hendaklah ia mengajarkannya kepada manusia, dan berhati-hatilah seseorang yang mengatakan sesuatu yang ia tidak memiliki ilmu tentangnya, ia akan melenceng dari agama dan menjadi orang-orang yang memaksakan diri'\". "
            },
            {
                "number": 136,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ عَنْ خَالِدِ بْنِ عَبْدِ اللَّهِ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِي الْبَخْتَرِيِّ وَزَاذَانَ قَالَا قَالَ عَلِيٌّ وَا بَرْدَهَا عَلَى الْكَبِدِ إِذَا سُئِلْتُ عَمَّا لَا أَعْلَمُ أَنْ أَقُولَ اللَّهُ أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] dari [Khalid bin Abdullah] dari ['Atho` bin As Sa`ib] dari [Abu Al Bakhtari] dan [Zaadzan] keduanya berkata: \" ['Ali] berkata: ' Alangkah sejuknya hati ini, jika aku ditanya tentang sesuatu yang tidak aku ketahui, kemudian aku mengatakan: Allahu a'lam'\"."
            },
            {
                "number": 137,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا عُمَيْرُ بْنُ عَرْفَجَةَ حَدَّثَنَا رَزِينٌ أَبُو النُّعْمَانِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ إِذَا سُئِلْتُمْ عَمَّا لَا تَعْلَمُونَ فَاهْرُبُوا قَالُوا وَكَيْفَ الْهَرَبُ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ تَقُولُونَ اللَّهُ أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami ['Umair bin 'Arfajah] telah menceritakan kepada kami [Razin Abu An Nu'man] dari ['Ali bin Abu Thalib] radliallahu 'anhu ia berkata: \" Apabila kalian ditanya tentang sesuatu yang tidak kalian ketahui maka menghindarlah'. Mereka bertanya: 'Bagaimana cara menghindarnya wahai amirul mu`minin? ', ia menjawab: 'Dengan kalian mengatakan: Allahu a'lam '\". "
            },
            {
                "number": 138,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ حُمَيْدٍ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ مُسْلِمٍ الْبَطِينِ عَنْ عَزْرَةَ التَّمِيمِيِّ قَالَ قَالَ عَلِيٌّ وَا بَرْدَهَا عَلَى الْكَبِدِ ثَلَاثَ مَرَّاتٍ قَالُوا وَمَا ذَلِكَ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ أَنْ يُسْأَلَ الرَّجُلُ عَمَّا لَا يَعْلَمُ فَيَقُولُ اللَّهُ أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Humaid] telah menceritakan kepada kami [Jarir] dari [Mansur] dari [Muslim Al Bathin] dari ['Azrah At Tamimi] ia berkata: \" [Ali] radliallahu 'anhu berkata: ' Alangkah sejuknya hati ini', --beliau mengulangi ucapannya sebanyak tiga kali--, mereka bertanya: 'Apakah hal itu wahai amirul mu`minin? ', ia menjawab: '(ketika) seorang ditanya tentang sesuatu yang tidak ia ketahui lalu ia mengucapkan: Allahu a'lam '\"."
            },
            {
                "number": 139,
                "arab": " أَخْبَرَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ أَنَّ رَجُلًا سَأَلَهُ عَنْ مَسْأَلَةٍ فَقَالَ لَا عِلْمَ لِي بِهَا فَلَمَّا أَدْبَرَ الرَّجُلُ قَالَ ابْنُ عُمَرَ نِعْمَ مَا قَالَ ابْنُ عُمَرَ سُئِلَ عَمَّا لَا يَعْلَمُ فَقَالَ لَا عِلْمَ لِي بِهِ",
                "id": "Telah mengabarkan kepada kami [Farwah bin Abu Al Maghra`] telah mengabarkan kepada kami ['Ali bin Mushir] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Ibnu Umar] radliallahu 'anhu: \"Bahwasanya seorang telah bertanya kepadanya tentang satu masalah, lalu ia berkata: ' Aku tidak mempunyai ilmu tentang hal itu, lalu setelah orang tersebut pergi, Ibnu Umar radliallahu 'anhu berkata: 'Alangkah bagusnya apa yang dikatakan Ibnu Umar radliallahu 'anhu, ia ditanya tentang satu hal yang tidak ia ketahui lalu ia katakan: 'aku tidak memiliki ilmu dalam hal itu'\"."
            },
            {
                "number": 140,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا عَبْدُ اللَّهِ الْعُمَرِيُّ عَنْ نَافِعٍ أَنَّ رَجُلًا أَتَى ابْنَ عُمَرَ يَسْأَلُهُ عَنْ شَيْءٍ فَقَالَ لَا عِلْمَ لِي ثُمَّ الْتَفَتَ بَعْدَ أَنْ قَفَّا الرَّجُلُ فَقَالَ نِعْمَ مَا قَالَ ابْنُ عُمَرَ سُئِلَ عَمَّا لَا يَعْلَمُ فَقَالَ لَا عِلْمَ لِي يَعْنِي ابْنُ عُمَرَ نَفْسَهُ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Maslamah] telah menceritakan kepada kami [Abdullah Al 'Umari] dari [Nafi']: \" Seorang lelaki datang kepada Ibnu Umar radliallahu 'anhu bertanya sesuatu, lalu ia ([Ibnu Umar] radliallahu 'anhu) berkata: 'Aku tidak tahu', Setelah si penanya berpaling, (Ibnu Umar) menoleh dan berkata dalam hati: 'Alangkah bagusnya apa yang dikatakan Ibnu Umar radliallahu 'anhu, ia ditanya tentang sesuatu yang tidak ia ketahui, lalu ia katakan: 'Aku tidak tahu'. "
            },
            {
                "number": 141,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ حُمَيْدٍ حَدَّثَنَا جَرِيرٌ عَنْ مُغِيرَةَ قَالَ كَانَ عَامِرٌ إِذَا سُئِلَ عَنْ شَيْءٍ يَقُولُ لَا أَدْرِي فَإِنْ رُدُّوا عَلَيْهِ قَالَ إِنْ شِئْتَ كُنْتُ حَلَفْتُ لَكَ بِاللَّهِ إِنْ كَانَ لِي بِهِ عِلْمٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Humaid] telah menceritakan kepada kami [Jarir] dari [Mughirah] ia berkata: \"Dahulu ['Amir] jika ditanya tentang sesuatu, ia selalu akan menjawab: 'Aku tidak tahu', tetapi jika mereka memaksa untuk menjawabnya, ia berkata: 'Jika aku mau, maka aku akan bersumpah demi Allah bahwa aku memang tidak tahu'\". "
            },
            {
                "number": 142,
                "arab": " أَخْبَرَنَا يَعْلَى حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ قَالَ قَالَ عَبْدُ اللَّهِ كَيْفَ أَنْتُمْ إِذَا لَبِسَتْكُمْ فِتْنَةٌ يَهْرَمُ فِيهَا الْكَبِيرُ وَيَرْبُو فِيهَا الصَّغِيرُ وَيَتَّخِذُهَا النَّاسُ سُنَّةً فَإِذَا غُيِّرَتْ قَالُوا غُيِّرَتْ السُّنَّةُ قَالُوا وَمَتَى ذَلِكَ يَا أَبَا عَبْدِ الرَّحْمَنِ قَالَ إِذَا كَثُرَتْ قُرَّاؤُكُمْ وَقَلَّتْ فُقَهَاؤُكُمْ وَكَثُرَتْ أُمَرَاؤُكُمْ وَقَلَّتْ أُمَنَاؤُكُمْ وَالْتُمِسَتْ الدُّنْيَا بِعَمَلِ الْآخِرَةِ",
                "id": "Telah mengabarkan kepada kami [Ya'la] telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] ia berkata: \" [Abdullah] pernah berkata: ' Bagaimana sikap kalian jika ditimpa kekacauan, yang tua menjadi pikun, yang kecil tiba-tiba menjadi dewasa, dan manusia menjadikan kekacauan itu sebagai sunnah, dan tiba-tiba telah diubah, mereka katakan: 'sunnah telah diubah! ', mereka bertanya: 'kapan hal itu terjadi wahai Abu Abdur Rahman? ', ia menjawab: 'Ketika telah banyak orang yang bisa membaca, namun sedikit yang ahli fikih (paham maknanya). Banyak orang yang duduk di pemerintahan, namun sedikit yang amanah. Dan dunia dicari dengan ilmu akhirat'\". "
            },
            {
                "number": 143,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ عَنْ خَالِدِ بْنِ عَبْدِ اللَّهِ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ كَيْفَ أَنْتُمْ إِذَا لَبِسَتْكُمْ فِتْنَةٌ يَهْرَمُ فِيهَا الْكَبِيرُ وَيَرْبُو فِيهَا الصَّغِيرُ إِذَا تُرِكَ مِنْهَا شَيْءٌ قِيلَ تُرِكَتْ السُّنَّةُ قَالُوا وَمَتَى ذَاكَ قَالَ إِذَا ذَهَبَتْ عُلَمَاؤُكُمْ وَكَثُرَتْ جُهَلَاؤُكُمْ وَكَثُرَتْ قُرَّاؤُكُمْ وَقَلَّتْ فُقَهَاؤُكُمْ وَكَثُرَتْ أُمَرَاؤُكُمْ وَقَلَّتْ أُمَنَاؤُكُمْ وَالْتُمِسَتْ الدُّنْيَا بِعَمَلِ الْآخِرَةِ وَتُفُقِّهَ لِغَيْرِ الدِّينِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] dari [Khalid bin Abdullah] dari [Yazid bin Abu Ziyad] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] ia berkata: \" Bagaimana sikap kalian jika ditimpa ketidakberesan, yang tua menjadi pikun dan yang kecil menjadi dewasa. Dan jika ketidakberesan itu ditinggal, akan dikatakan: 'sunnah telah ditinggalkan', mereka bertanya: 'Kapan hal itu terjadi? ', ia menjawab: 'Jika telah pergi para ulama` kalian, dan semakin banyak orang-orang bodoh dari kalian, jika semakin banyak orang yang pandai membaca tetapi sedikit yang ahli fikih, dan semakin banyak para pemimpin kalian tetapi sedikit yang amanah, serta dunia sudah dicari dengan amalan akhirat dan ia diperdalam tetapi bukan untuk (kepentingan) agama'\". "
            },
            {
                "number": 144,
                "arab": " أَخْبَرَنَا صَالِحُ بْنُ سُهَيْلٍ مَوْلَى يَحْيَى بْنِ أَبِي زَائِدَةَ حَدَّثَنَا يَحْيَى عَنْ مُجَالِدٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَ لَا يَأْتِي عَلَيْكُمْ عَامٌ إِلَّا وَهُوَ شَرٌّ مِنْ الَّذِي كَانَ قَبْلَهُ أَمَا إِنِّي لَسْتُ أَعْنِي عَامًا أَخْصَبَ مِنْ عَامٍ وَلَا أَمِيرًا خَيْرًا مِنْ أَمِيرٍ وَلَكِنْ عُلَمَاؤُكُمْ وَخِيَارُكُمْ وَفُقَهَاؤُكُمْ يَذْهَبُونَ ثُمَّ لَا تَجِدُونَ مِنْهُمْ خَلَفًا وَيَجِيءُ قَوْمٌ يَقِيسُونَ الْأُمُورَ بِرَأْيِهِمْ",
                "id": "Telah mengabarkan kepada kami [Shalih bin Suhail] -bekas budak Yahya bin Abu Za`idah-, telah menceritakan kepada kami [Yahya] dari [Mujalid] dari [As Sya'bi] dari [Masruq] dari [Abdullah] ia berkata: \" Tidaklah akan datang satu tahun, kecuali tahun tersebut lebih jelek dari sebelumnya, Aku tidak bermaksud mengatakan bahwa suatu tahun lebih baik dari pada tahun lainnya, dan seorang amir (pemimpin) lebih baik dari amir lainnya. Akan tetapi ulama`-ulama`, orang-orang pilihan, dan para ahli fikih kalian telah banyak yang wafat, kemudian kalian tidak mendapatkan ganti mereka, hingga datang orang-orang yang menggunakan qiyas (analogi dalam masalah agama) berdasarkan akal semata\"."
            },
            {
                "number": 145,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ قَالَ سَمِعْتُ دَاوُدَ بْنَ أَبِي هِنْدٍ عَنْ ابْنِ سِيرِينَ قَالَ أَوَّلُ مَنْ قَاسَ إِبْلِيسُ وَمَا عُبِدَتْ الشَّمْسُ وَالْقَمَرُ إِلَّا بِالْمَقَايِيسِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad bin Abu Khalaf] telah menceritakan kepada kami [Yahya bin sulaim] ia berkata: \"Aku pernah mendengar [Daud bin Hindun] dari [Ibnu Sirin] rahimahullahu, ia berkata: ' Yang pertama-tama menggunakan qiyas adalah iblis, dan tidaklah matahari dan bulan disembah melainkan karena alasan qiyas'\"."
            },
            {
                "number": 146,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ أَنَّهُ قَالَ إِنِّي أَخَافُ أَوْ أَخْشَى أَنْ أَقِيسَ فَتَزِلَّ قَدَمِي",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] telah menceritakan kepada kami [Abu 'Awanah] dari [Isma'il bin Abu Khalid] dari [As Sya'bi] dari [Masruq] bahwa ia berkata: \" Aku takut atau khawatir melakukan qiyas lalu tergelincirlah kakiku\"."
            },
            {
                "number": 147,
                "arab": " أَخْبَرَنَا صَدَقَةُ بْنُ الْفَضْلِ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ إِسْمَعِيلَ عَنْ الشَّعْبِيِّ قَالَ وَاللَّهِ لَئِنْ أَخَذْتُمْ بِالْمَقَايِيسِ لَتُحَرِّمُنَّ الْحَلَالَ وَلَتُحِلُّنَّ الْحَرَامَ",
                "id": "Telah mengabarkan kepada kami [Shadaqah bin Al Fadl] telah menceritakan kepada kami [Abu Khalid Al `Ahmar] dari [Isma'il] dari [As Sya'bi] ia berkata: \" Demi Allah jika kalian menggunakan qiyas niscaya kalian akan mengharamkan yang halal dan akan menghalalkan yang haram\"."
            }
        ]
    }
}