{
    "status": true,
    "data": {
        "start": 1765,
        "end": 1911,
        "total": 147,
        "book": "darimi",
        "hadits": [
            {
                "number": 1765,
                "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ الْأَسَدِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ جُدَامَةَ بِنْتِ وَهْبٍ الْأَسَدِيَّةِ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ هَمَمْتُ أَنْ أَنْهَى عَنْ الْغِيلَةِ حَتَّى ذَكَرْتُ أَنَّ فَارِسَ وَالرُّومَ يَصْنَعُونَ ذَلِكَ فَلَا يَضُرُّ أَوْلَادَهُمْ قَالَ أَبُو مُحَمَّد الْغِيلَةُ أَنْ يُجَامِعَهَا وَهِيَ تُرْضِعُ",
                "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Malik] dari [Muhammad bin Abdurrahman bin Naufal Al Asadi] dari ['Urwah] dari [Aisyah] dari [Judamah binti Wahb Al Asadiyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh aku pernah berkeinginan melarang ghilah (menggauli wanita yang tengah menyusui), hingga aku ingat bahwa orang-orang Persia dan Romawi melakukan hal itu namun tidak membahayakan anak-anak mereka.\" Abu Muhammad berkata; ghilah adalah menggauli wanita dalam keadaan menyusui."
            },
            {
                "number": 1766,
                "arab": " حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ مَا ضَرَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَادِمًا قَطُّ وَلَا ضَرَبَ بِيَدِهِ شَيْئًا قَطُّ إِلَّا أَنْ يُجَاهِدَ فِي سَبِيلِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Ja'far bin 'Aun] telah mengabarkan kepada kami [Hisyam bin 'Urwah] dari [Ayahnya] dari ['Aisyah] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam tidak pernah memukul pembantu sama sekali, dan tidak pernah memukul sesuatu dengan tangannya sama sekali kecuali ketika berjihad di jalan Allah.\""
            },
            {
                "number": 1767,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ إِيَاسِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي ذُبَابٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَضْرِبُوا إِمَاءَ اللَّهِ فَجَاءَ عُمَرُ بْنُ الْخَطَّابِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ قَدْ ذَئِرْنَ عَلَى أَزْوَاجِهِنَّ فَرَخَّصَ فِي ضَرْبِهِنَّ فَأَطَافَ بِآلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِسَاءٌ كَثِيرٌ يَشْكُونَ أَزْوَاجَهُنَّ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ طَافَ بِآلِ مُحَمَّدٍ نِسَاءٌ كَثِيرٌ يَشْكُونَ أَزْوَاجَهُنَّ لَيْسَ أُولَئِكَ بِخِيَارِكُمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad bin Abu Khalaf] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Iyas bin Abdullah bin Abu Dzubab] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian memukul hamba wanita Allah.\" Kemudian Umar bin Al Khathab datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; \"Sungguh mereka telah berani kepada suami mereka.\" Lalu beliau memberikan keringanan untuk memukul mereka. Ternyata banyak wanita yang mengelilingi keluarga Rasulullah shallallahu 'alaihi wasallam, mereka mengeluhkan suami-suami mereka. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Sungguh banyak wanita yang mengelilingi keluarga Muhammad, mereka mengeluhkan para suami mereka, padahal mereka bukanlah orang-orang terbaik kalian.\""
            },
            {
                "number": 1768,
                "arab": " أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ زَمَعَةَ قَالَ خَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّاسَ يَوْمًا فَوَعَظَهُمْ فِي النِّسَاءِ فَقَالَ مَا بَالُ الرَّجُلِ يَجْلِدُ امْرَأَتَهُ جَلْدَ الْعَبْدِ وَلَعَلَّهُ يُضَاجِعُهَا فِي آخِرِ يَوْمِهِ",
                "id": "Telah mengabakan kepada kami [Ja'far bin 'Aun] telah mengabarkan kepada kami [Hisyam bin 'Urwah] dari [Ayahnya] dari [Abdullah bin Zama'ah], ia berkata; Suatu hari Rasulullah shallallahu 'alaihi wasallam khutbah dihadapan manusia. Beliau menasehati mereka terhadap para isteri. Beliau bersabda: \"Bagaimana seorang laki-laki mencambuk isterinya seperti mencambuk seorang budak, padahal kemungkinan ia akan menggaulinya pada akhir hari.\""
            },
            {
                "number": 1769,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا الْجُرَيْرِيُّ عَنْ أَبِي الْعَلَاءِ عَنْ نُعَيْمِ بْنِ قَعْنَبٍ عَنْ أَبِي ذَرٍّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْمَرْأَةَ خُلِقَتْ مِنْ ضِلَعٍ فَإِنْ تُقِمْهَا كَسَرْتَهَا فَدَارِهَا فَإِنَّ فِيهَا أَوَدًا وَبُلْغَةً",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah Ar Raqasyi] telah menceritakan kepada kami [Abdul Warits] telah menceritakan kepada kami [Al Jurairi] dari [Abu Al 'Ala`] dari [Nu'aim bin Qa'nab] dari [Abu Dzar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya seorang wanita diciptakan dari tulang rusuk, apabila engkau meluruskannya maka engkau akan mematahkannya, maka bersikaplah lembut kepadanya, sesungguhnya padanya terdapat kebengkokan dan kehidupan yang sepadan.\""
            },
            {
                "number": 1770,
                "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا الْمَرْأَةُ كَالضِّلَعِ إِنْ تُقِمْهَا تَكْسِرْهَا وَإِنْ تَسْتَمْتِعْ تَسْتَمْتِعْ وَفِيهَا عِوَجٌ",
                "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya seorang wanita itu seperti tulang rusuk, apabila engkau meluruskannya, maka engkau akan mematahkannya, dan apabila engkau bersenang-senang dengannya maka engkau dapat bersenang-senang dengannya sekalipun tetap bengkok.\""
            },
            {
                "number": 1771,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْهَاشِمِيُّ عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أَبِي سَعِيدٍ قَالَ سَأَلَ رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْعَزْلِ فَقَالَ أَوَ تَفْعَلُونَ ذَلِكَ فَلَا عَلَيْكُمْ أَنْ لَا تَفْعَلُوا فَإِنَّهُ لَيْسَ مِنْ نَسَمَةٍ قَضَى اللَّهُ تَعَالَى أَنْ تَكُونَ إِلَّا كَانَتْ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Daud Al Hasyimi] dari [Ibrahim bin Sa'd] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah bin 'Utbah] dari [Abu Sa'id] ia berkata; \"Seorang laki-laki bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai 'azl, beliau menjawab: \"Apakah kalian melakukan hal itu? Tidak, kalian tidak boleh melakukan, sesungguhnya tidak ada jiwa yang telah Allah Ta'ala tetapkan melainkan akan terwujud.\""
            },
            {
                "number": 1772,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا ابْنُ عَوْنٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ بِشْرٍ يَرُدُّ الْحَدِيثَ إِلَى أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قُلْنَا يَا رَسُولَ اللَّهِ الرَّجُلُ تَكُونُ لَهُ الْجَارِيَةُ فَيُصِيبُ مِنْهَا وَيَكْرَهُ أَنْ تَحْمِلَ أَفَيَعْزِلُ عَنْهَا وَتَكُونُ عِنْدَهُ الْمَرْأَةُ تُرْضِعُ فَيُصِيبُ مِنْهَا وَيَكْرَهُ أَنْ تَحْمِلَ فَيَعْزِلُ عَنْهَا قَالَ لَا عَلَيْكُمْ أَنْ لَا تَفْعَلُوا فَإِنَّمَا هُوَ الْقَدَرُ قَالَ ابْنُ عَوْنٍ فَذَكَرْتُ ذَلِكَ لِلْحَسَنِ فَقَالَ وَاللَّهِ لَكَأَنَّ هَذَا زَجْرًا وَاللَّهِ لَكَأَنَّ هَذَا زَجْرًا",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan keapada kami [Ibnu 'Aun] dari [Muhammad bin Sirin] dari [Abdurrahman bin Bisyr] ia merefrensikan hadits kepada [Abu Sa'id Al Khudri] ia berkata; \"Kami mengatakan; \"Wahai Rasulullah, seorang laki-laki memiliki budak wanita, kemudian ia menggaulinya dan tidak ingin budaknya hamil, apakah ia boleh melakukan 'azl? dia juga memiliki isteri yang sedang menyusui, kemudian ia menggaulinya dan tidak ingin ia mengandung, maka bolehkan ia melakukan 'azl?\" Beliau menjawab: \"Tidak, janganlah kalian melakukannya, sesungguhnya hal itu merupakan suatu ketetapan.\" Ibnu 'Aun mengatakan; kemudian aku menyebutkan hadits tersebut kepada Al Hasan, ia berkata; \"Demi Allah, seolah-olah hal ini merupakan hardikan, demi Allah seolah-olah ini merupakan suatu hardikan.\""
            },
            {
                "number": 1773,
                "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ أَحَدٌ أَغْيَرَ مِنْ اللَّهِ لِذَلِكَ حَرَّمَ الْفَوَاحِشَ وَلَيْسَ أَحَدٌ أَحَبُّ إِلَيْهِ الْمَدْحُ مِنْ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada sesuatupun yang lebih besar kecemburuannya daripada Allah, oleh karena itu Allah mengharamkan perbuatan keji, dan tidak ada sesuatu pun yang lebih senang dipuji daripada Allah.\""
            },
            {
                "number": 1774,
                "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ حَدَّثَنِي ابْنُ جَابِرِ بْنِ عَتِيكٍ حَدَّثَنِي أَبِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مِنْ الْغَيْرَةِ مَا يُحِبُّ اللَّهُ وَمِنْهَا مَا يُبْغِضُ اللَّهُ فَالْغَيْرَةُ الَّتِي يُحِبُّ اللَّهُ الْغَيْرَةُ فِي الرِّيبَةِ وَالْغَيْرَةُ الَّتِي يُبْغِضُ اللَّهُ الْغَيْرَةُ فِي غَيْرِ رِيبَةٍ",
                "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Muhammad bin Ibrahim] telah menceritakan kepadaku [Ibnu Jabir bin 'Atik] telah menceritakan kepadaku [Ayahku] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Diantara rasa cemburu, ada sesuatu yang Allah cintai dan ada yang Allah benci. Rasa cemburu yang dicintai Allah adalah cemburu ketika terdapat keraguan dan cemburu yang Allah benci adalah cemburu ketika tidak terdapat keraguan.\""
            },
            {
                "number": 1775,
                "arab": " حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ وَرَّادٍ مَوْلَى الْمُغِيرَةِ عَنْ الْمُغِيرَةِ قَالَ بَلَغَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ سَعْدَ بْنَ عُبَادَةَ يَقُولُ لَوْ وَجَدْتُ مَعَهَا رَجُلًا لَضَرَبْتُهَا بِالسَّيْفِ غَيْرَ مُصْفَحٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَعْجَبُونَ مِنْ غَيْرَةِ سَعْدٍ أَنَا أَغَيْرُ مِنْ سَعْدٍ وَاللَّهُ أَغَيْرُ مِنِّي وَلِذَلِكَ حَرَّمَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَلَا شَخْصَ أَغَيْرُ مِنْ اللَّهِ وَلَا أَحَبُّ إِلَيْهِ مِنْ الْمَعَاذِرِ وَلِذَلِكَ بَعَثَ النَّبِيِّينَ مُبَشِّرِينَ وَمُنْذِرِينَ وَلَا شَخْصَ أَحَبُّ إِلَيْهِ الْمَدْحُ مِنْ اللَّهِ وَلِذَلِكَ وَعَدَ الْجَنَّةَ",
                "id": "Telah menceritakan kepada kami [Zakariya bin 'Adi] telah menceritakan kepada kami ['ubaidhullah bin 'Amr] dari [Abdul Malik bin 'Umair] dari [Warrad] mantan budak Al Mughirah, dari [Al Mughirah] ia berkata; telah sampai kepada Rasulullah shallallahu 'alaihi wasallam bahwa Sa'd bin 'Ubadah pernah berkata; \"Seandainya aku mendapatkan bersamanya seorang laki-laki, niscaya aku penggal kepala wanita itu dengan pedang, tidak dengan sisi tumpul melainkan dengan sisi yang tajam.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah kalian heran dengan kecemburuan Sa'd? Aku lebih cemburu daripada Sa'd, dan Allah lebih cemburu daripada diriku, oleh karena itu Allah mangharamkan perbuatan keji yang nampak maupun yang tersembunyi, dan tidak ada yang lebih besar cemburunya daripada Allah, dan tidak ada yang lebih Allah cintai daripada penyampaian alas an, oleh karena itu Allah mengutus para nabi yang memberikan kabar gembira dan peringatan, dan tidak ada yang paling senang kepada pujian daripada Allah, oleh karena itu Allah menjanjikan Surga.\""
            },
            {
                "number": 1776,
                "arab": " حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ أَخْبَرَنَا قَتَادَةُ عَنْ زُرَارَةَ بْنِ أَوْفَى الْعَامِرِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا بَاتَتْ الْمَرْأَةُ هَاجِرَةً لِفِرَاشِ زَوْجِهَا لَعَنَتْهَا الْمَلَائِكَةُ حَتَّى تَرْجِعَ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepada kami [Qatadah] dari [Zurarah bin Aufa Al 'Amiri] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila seorang isteri enggan bermalam dengan meninggalkan kasur suaminya, maka Malaikat melaknatnya hingga ia kembali.\""
            },
            {
                "number": 1777,
                "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ سَهْلِ بْنِ سَعْدٍ أَنَّ عُوَيْمِرًا الْعَجْلَانِيَّ قَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلًا وَجَدَ مَعَ امْرَأَتِهِ رَجُلًا أَيَقْتُلُهُ فَيَقْتُلُونَهُ أَمْ كَيْفَ يَفْعَلُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَنْزَلَ اللَّهُ فِيكَ وَفِي صَاحِبَتِكَ فَاذْهَبْ فَأْتِ بِهَا قَالَ سَهْلٌ فَتَلَاعَنَا وَأَنَا مَعَ النَّاسِ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا فَرَغَا مِنْ تَلَاعُنِهِمَا قَالَ كَذَبْتُ عَلَيْهَا يَا رَسُولَ اللَّهِ إِنْ أَمْسَكْتُهَا فَطَلَّقَهَا ثَلَاثًا قَبْلَ أَنْ يَأْمُرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ابْنُ شِهَابٍ وَكَانَتْ تِلْكَ بَعْدُ سُنَّةَ الْمُتَلَاعِنَيْنِ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ الْأَوْزَاعِيِّ عَنْ ابْنِ شِهَابٍ عَنْ سَهْلِ بْنِ سَعْدٍ أَنَّ عُوَيْمِرًا أَتَى عَاصِمَ بْنَ عَدِيٍّ وَكَانَ سَيِّدَ بَنِي عَجْلَانَ فَذَكَرَ مِثْلَهُ وَلَمْ يَذْكُرْ طَلَّقَهَا ثَلَاثًا",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari [Sahl bin Sa'd] bahwa 'Uwaimir Al 'Ajlani berkata; \"Wahai Rasulullah, bagaimana pendapatmu mengenai seorang suami mendapati laki-laki lain tengah bersama isterinya, apakah suaminya membunuh laki-laki itu hingga orang-orang membunuh dirinya atau bagaimana ia berbuat?\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah telah menurunkan wahyu mengenaimu dan mengenai isterimu, pergilah dan bawalah dia.\" Sahl berkata; \"Kemudian mereka berdua saling melaknat, sementara aku bersama orang-orang di sisi Rasulullah shallallahu 'alaihi wasallam. Tatkala mereka selesai saling melaknat, 'Uwaimir berkata; aku berdusta terhadapnya wahai Rasulullah, apabila aku mempertahankannya, kemudian ia mencerainya tiga kali sebelum Rasulullah shallallahu 'alaihi wasallam memerintahkannya.\" Ibnu Syihab berkata; \"Setelah itu, perkara tersebut menjadi sunnah orang yang saling melaknat (melakukan li'an).\" Telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Al Auza'i] dari [Ibnu Syihab] dari [Sahl bin Sa'd] bahwa 'Uwaimir datang kepada 'Ashim bin 'Adi dan ia adalah pemimpin Bani 'Ajlan,..\" lalu Sahl menyebutkan hadits seperti di atas, namun tidak menyebutkan; \"'Uwaimir mencerainya tiga kali.\""
            },
            {
                "number": 1778,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ يَقُولُ سُئِلْتُ عَنْ الْمُتَلَاعِنَيْنِ فِي إِمَارَةِ مُصْعَبِ بْنِ الزُّبَيْرِ أَيُفَرَّقُ بَيْنَهُمَا فَمَا دَرَيْتُ مَا أَقُولُ قَالَ فَقُمْتُ حَتَّى أَتَيْتُ مَنْزِلَ عَبْدِ اللَّهِ بْنِ عُمَرَ فَقُلْتُ لِلْغُلَامِ اسْتَأْذِنْ لِي عَلَيْهِ فَقَالَ إِنَّهُ قَائِلٌ لَا تَسْتَطِيعُ أَنْ تَدْخُلَ عَلَيْهِ قَالَ فَسَمِعَ ابْنُ عُمَرَ صَوْتِي فَقَالَ ابْنُ جُبَيْرٍ فَقُلْتُ نَعَمْ فَقَالَ ادْخُلْ فَمَا جَاءَ بِكَ هَذِهِ السَّاعَةَ إِلَّا حَاجَةٌ قَالَ فَدَخَلْتُ عَلَيْهِ فَوَجَدْتُهُ وَهُوَ مُفْتَرِشٌ بَرْذَعَةَ رَحْلِهِ مُتَوَسِّدٌ مِرْفَقَةً أَوْ قَالَ نُمْرُقَةً شَكَّ عَبْدُ اللَّهِ حَشْوُهَا لِيفٌ فَقُلْتُ يَا أَبَا عَبْدِ الرَّحْمَنِ الْمُتَلَاعِنَانِ أَيُفَرَّقُ بَيْنَهُمَا قَالَ سُبْحَانَ اللَّهِ نَعَمْ إِنَّ أَوَّلَ مَنْ سَأَلَ عَنْ ذَلِكَ فُلَانٌ فَقَالَ يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْكَ أَرَأَيْتَ لَوْ أَنَّ أَحَدَنَا رَأَى امْرَأَتَهُ عَلَى فَاحِشَةٍ كَيْفَ يَصْنَعُ إِنْ سَكَتَ سَكَتَ عَلَى أَمْرٍ عَظِيمٍ وَإِنْ تَكَلَّمَ فَمِثْلُ ذَلِكَ قَالَ فَسَكَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يُجِبْهُ فَقَامَ لِحَاجَتِهِ فَلَمَّا كَانَ بَعْدَ ذَلِكَ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ الَّذِي سَأَلْتُكَ عَنْهُ قَدْ ابْتُلِيتُ بِهِ قَالَ فَأَنْزَلَ اللَّهُ تَعَالَى هَؤُلَاءِ الْآيَاتِ الَّتِي فِي سُورَةِ النُّورِ { وَالَّذِينَ يَرْمُونَ أَزْوَاجَهُمْ } حَتَّى خَتَمَ هَؤُلَاءِ الْآيَاتِ قَالَ فَدَعَا الرَّجُلَ فَتَلَاهُنَّ عَلَيْهِ وَذَكَّرَهُ بِاللَّهِ وَأَخْبَرَهُ أَنَّ عَذَابَ الدُّنْيَا أَهْوَنُ مِنْ عَذَابِ الْآخِرَةِ فَقَالَ مَا كَذَبْتُ عَلَيْهَا ثُمَّ دَعَا الْمَرَأَةَ فَوَعَظَهَا وَذَكَّرَهَا وَأَخْبَرَهَا أَنَّ عَذَابَ الدُّنْيَا أَهْوَنُ مِنْ عَذَابِ الْآخِرَةِ فَقَالَتْ وَالَّذِي بَعَثَكَ بِالْحَقِّ إِنَّهُ لَكَاذِبٌ فَدَعَا الرَّجُلَ فَشَهِدَ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنْ الصَّادِقِينَ { وَالْخَامِسَةُ أَنَّ لَعْنَةَ اللَّهِ عَلَيْهِ إِنْ كَانَ مِنْ الْكَاذِبِينَ } ثُمَّ أُتِيَ بِالْمَرْأَةِ فَشَهِدَتْ أَرْبَعَ شَهَادَاتٍ بِاللَّهِ إِنَّهُ لَمِنْ الْكَاذِبِينَ { وَالْخَامِسَةَ أَنَّ غَضَبَ اللَّهِ عَلَيْهَا إِنْ كَانَ مِنْ الصَّادِقِينَ } ثُمَّ فَرَّقَ بَيْنَهُمَا",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Abdul Malik bin Sulaiman] ia berkata; aku mendengar [Sa'id bin Jubair] berkata; aku ditanya mengenai dua orang yang saling melakukan li'an pada masa kepemimpinan Mush'ab bin Az Zubair, apakah keduanya dipisahkan?\" Aku tidak tahu apa yang akan aku katakan. Kemudian aku bangkit hingga datang ke rumah [Abdullah bin Umar], aku katakan kepada seorang budak; \"Mintakan aku izin untuk menemuinya! \" Budak itu menjawab; \"Sesungguhnya ia berkata; \"Engkau tidak dapat menemuinya.\" Ketika Ibnu Umar mendengar suaraku, ia berkata; \"Apakah engkau Ibnu Jubair?\" Aku menjawab; \"Ya, benar.\" Ibnu Umar berkata; \"Masuklah, tidaklah engkau datang pada saat-saat demikian ini kecuali ada suatu keperluan.\" Kemudian aku menemuinya dan mendapatinya tengah menghamparkan alas pelana kendaraannya bersandarkan bantal -Abdullah ragu dengan redaksi haditsnya- yang berisi serabut. Kemudian aku berkata; \"Wahai Abu Abdurrahman, apakah dua orang yang saling melakukan li'an dipisahkan antara mereka?\" Ibnu Umar berkata; \"Subhanallah, ya. Sesungguhnya orang pertama yang bertanya mengenai hal itu adalah Fulan, lalu ia berkata; \"Wahai Rasulullah, semoga Allah melimpahkan shalawat dan salam kepadamu, bagaimana pendapat anda apabila salah seorang diantara kami melihat isterinya melakukan perbuatan keji, bagaimana ia harus perbuat? Apabila ia diam maka ia diam terhadap perkara yang besar, namun apabila ia berbicara, maka seperti itu juga.\" Rasulullah shallallahu 'alaihi wasallam diam dan tidak menjawab, lalu beliau bangkit untuk suatu keperluan. Sesaat kemudian orang itu datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; \"Wahai Rasulullah, sesungguhnya yang aku tanyakan kepadamu telah menimpa diriku.\" Ibnu Umar melanjutkan; \"Kemudian Allah Ta'ala menurunkan ayat yang ada dalam surat An Nur: Dan orang-orang yang menuduh isterinya (berzina) \" QS An Nur; 6 hingga selesai. Ibnu Umar melanjutkan; Setelah itu beliau memanggil laki-laki tersebut dan membacakan ayat tersebut kepadanya, beliau mengingatkannya kepada Allah dan mengabarkan kepadanya bahwa adzab dunia lebih ringan daripada adzab akherat. Lalu ia berkata; \"Aku tidak berdusta kepadanya.\" Kemudian beliau memanggil wanita tersebut (isterinya), menasehatinya serta mengingatkannya dan mengabarkan kepadanya bahwa adzab dunia lebih ringan daripada adzab akherat.\" Wanita tersebut (isterinya) berkata; \"Demi Dzat yang mengutusmu dengan kebenaran, sesungguhnya ia telah berdusta.\" Beliau akhirnya memanggil laki-laki tersebut, lalu ia bersumpah empat kali dengan nama Allah bahwa ia merupakan diantara orang-orang yang benar, dan yang kelima bahwa laknat Allah akan menimpa kepadanya apabila merupakan diantara orang-orang yang berdusta, kemudian wanita tersebut didatangkan lalu ia bersumpah empat kali dengan nama Allah, bahwa ia termasuk diantara orang-orang yang dusta, dan kelima kalinya bahwa kemurkaan Allah akan menimpa kepadanya apabila ia merupakan diantara orang-orang yang benar. Kemudian beliau memisahkan mereka berdua.\""
            },
            {
                "number": 1779,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ حَدَّثَنِي مَالِكٌ قَالَ سَمِعْتُ نَافِعًا عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ فَرَّقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ الْمُتَلَاعِنَيْنِ وَأَلْحَقَ الْوَلَدَ بِأُمِّهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah Ar Raqasyi] telah menceritakan kepadaku [Malik], ia berkata; aku mendengar [Nafi'] dari [Abdullah bin Umar], ia berkata; \"Rasulullah shallallahu 'alaihi wasallam memisahkan antara dua orang yang melakukan li'an, dan menisbatkan anak kepada ibunya.\""
            },
            {
                "number": 1780,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا الْحَسَنُ بْنُ صَالِحٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ قَالَ سَمِعْتُ جَابِرًا يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا عَبْدٍ تَزَوَّجَ بِغَيْرِ إِذْنِ مَوَالِيهِ أَوْ أَهْلِهِ فَهُوَ عَاهِرٌ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Al Hasan bin Shalih] dari [Abdullah bin Muhammad bin 'Uqail], ia berkata; aku mendengar [Jabir] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapapun seorang budak yang menikah tanpa seizing tuannya atau keluarganya maka ia adalah pezina.\""
            },
            {
                "number": 1781,
                "arab": " حَدَّثَنَا مَالِكُ بْنُ إِسْمَعِيلَ حَدَّثَنَا مِنْدَلُ بْنُ عَلِيٍّ عَنْ ابْنِ جُرَيْجٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا عَبْدٍ تَزَوَّجَ بِغَيْرِ إِذْنِ مَوَالِيهِ فَهُوَ زَانٍ",
                "id": "Telah menceritakan kepada kami [Malik bin Isma'il] telah menceritakan kepada kami [Mindal bin Ali] dari [Ibnu Juraij] dari [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Siapapun seorang budak yang menikah tanpa seizing tuannya, maka ia adalah pezina.\""
            },
            {
                "number": 1782,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ ابْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ يَرْفَعُهُ قَالَ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Az Zuhri] dari [Ibnu Al Musayyab] dari [Abu Hurairah] dan -ia memarfu'kannya- ia berkata; \"Anak adalah untuk pemilik ranjang dan tidak ada hak bagi pelaku zina (yang menzinahi ibunya -pent).\""
            },
            {
                "number": 1783,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا مَالِكٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْوَلَدُ لِلْفِرَاشِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] telah menceritakan kepada kami [Malik] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Anak adalah untuk pemilik ranjang.\""
            },
            {
                "number": 1784,
                "arab": " حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ حَدَّثَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ أَخْبَرَنِي عُرْوَةُ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ عُتْبَةُ بْنُ أَبِي وَقَّاصٍ عَهِدَ إِلَى أَخِيهِ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنْ يَقْبِضَ إِلَيْهِ ابْنَ وَلِيدَةِ زَمْعَةَ فَقَالَ عُتْبَةُ إِنَّهُ ابْنِي فَلَمَّا قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَمَنَ الْفَتْحِ أَخَذَ سَعْدُ بْنُ أَبِي وَقَّاصٍ ابْنَ وَلِيدَةِ زَمْعَةَ فَإِذَا هُوَ أَشْبَهُ النَّاسِ بِعُتْبَةَ بْنِ أَبِي وَقَّاصٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ لَكَ يَا عَبْدُ بْنَ زَمْعَةَ مِنْ أَجْلِ أَنَّهُ وُلِدَ عَلَى فِرَاشِ أَبِيهِ وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجِبِي مِنْهُ يَا سَوْدَةُ بِنْتَ زَمْعَةَ مِمَّا رَأَى مِنْ شَبَهِهِ بِعُتْبَةَ بْنِ أَبِي وَقَّاصٍ وَسَوْدَةُ بِنْتُ زَمْعَةَ",
                "id": "Telah menceritakan kepada kami [Al Hakam bin Nafi'] telah menceritakan kepada kami [Syu'aib] dari [Az Zuhri] telah mengabarkan kepadaku ['Urwah] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata; 'Utbah bin Abu Waqqash telah berwasiat kepada Sa'd bin Abu Waqqash agar mengambilkan anak sahaya wanita Zam'ah. 'Utbah berkata; \"Sesungguhnya ia adalah anakku.\" Tatkala Nabi shallallahu 'alaihi wasallam dating, yaitu katika penaklukan Makkah, Sa'd bin Abu Waqqash mengambil anak sahaya wanita Zam'ah. Ternyata anaknya mirip dengan 'Utbah bin Abu Waqqash. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Ia milikmu wahai 'Abdu bin Zam'ah, karena ia terlahir di atas kasur ayahmu.\" Nabi shallallahu 'alaihi wasallam berkata: \"Berhijablah darinya wahai Saudah binti Zam'ah.\" Karena beliau melihat kemiripannya dengan 'Utbah bin Abu Waqqash dan Saudah binti Zam'ah.\""
            },
            {
                "number": 1785,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ يُونُسَ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ حِينَ أُنْزِلَتْ آيَةُ الْمُلَاعَنَةِ أَيُّمَا امْرَأَةٍ أَدْخَلَتْ عَلَى قَوْمٍ نَسَبًا لَيْسَ مِنْهُمْ فَلَيْسَتْ مِنْ اللَّهِ فِي شَيْءٍ وَلَمْ يُدْخِلْهَا اللَّهُ جَنَّتَهُ وَأَيُّمَا رَجُلٍ جَحَدَ وَلَدَهُ وَهُوَ يَنْظُرُ إِلَيْهِ احْتَجَبَ اللَّهُ مِنْهُ وَفَضَحَهُ عَلَى رُءُوسِ الْأَوَّلِينَ وَالْآخِرِينَ قَالَ عَبْدُ اللَّهِ قَالَ مُحَمَّدُ بْنُ كَعْبٍ الْقُرَظِيُّ وَسَعِيدٌ يُحَدِّثَهُ هَذَا وَقَدْ بَلَغَنِي هَذَا الْحَدِيثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Yazid bin Abdullah] dari [Abdullah bin Yunus] dari [Sa'id bin Abu Sa'id] dari [Abu Hurairah] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda ketika turun ayat li'an: \"Siapapun seorang wanita yang menasabkan (anaknya) kepada suatu kaum, sementara (anaknya) bukan dari mereka, maka ia bukan termasuk golongan Allah sama sekali, dan Allah tidak akan memasukkannya ke dalam Surga. Dan siapapun laki-laki yang mengingkari anaknya padahal ia tahu bahwa itu adalah anaknya, maka Allah akan menutup diri darinya, dan Allah akan mempermalukannya dihadapan para manusia yang pertama dan yang terakhir.\" [Abdullah] berkata; [Muhammad bin Ka'b Al Qurazhi] berkata; Sa'id telah menceritkan hal ini kepadanya. Hadits ini juga telah sampai kepadaku dari Rasulullah shallallahu 'alaihi wasallam."
            },
            {
                "number": 1786,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ زَيْدٍ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ يَزِيدَ بْنِ الْبَرَاءِ عَنْ أَبِيهِ قَالَ لَقِيتُ عَمِّي وَمَعَهُ رَايَةٌ فَقُلْتُ أَيْنَ تُرِيدُ فَقَالَ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى رَجُلٍ نَكَحَ امْرَأَةَ أَبِيهِ فَأَمَرَنِي أَنْ أَضْرِبَ عُنُقَهُ وَآخُذَ مَالَهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Ja'far Ar Raqqi] telah menceritakan kepada kami ['ubaidhullah bin 'Amr] dari [Zaid] dari ['Adi bin Tsabit] dari [Yazid bin Al Bara`] dari [Ayahnya] ia berkata; Aku berjumpa dengan [pamanku], katika itu ia membawa bendera. Lalu aku berkata; \"Engkau hendak kemana?\" pamanku berkata; \"Aku telah diutus Rasulullah shallallahu 'alaihi wasallam untuk datang kepada seorang laki-laki yang menikahi isteri ayahnya, dan beliau memerintahkanku agar memenggal kepalanya dan mengambil hartanya.\""
            },
            {
                "number": 1787,
                "arab": " حَدَّثَنِي مُعَلَّى بْنُ أَسَدٍ قَالَ حَدَّثَنَا وُهَيْبٌ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ مُحَمَّدِ بْنِ أَبِي مُوسَى عَنْ رَجُلٍ مِنْ الْأَنْصَارِ يُسَمَّى زِيَادًا قَالَ قُلْتُ لِأُبَيِّ بْنِ كَعْبٍ أَرَأَيْتَ لَوْ أَنَّ أَزْوَاجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتْنَ كَانَ يَحِلُّ لَهُ أَنْ يَتَزَوَّجَ قَالَ نَعَمْ إِنَّمَا أَحَلَّ اللَّهُ لَهُ ضَرْبًا مِنْ النِّسَاءِ وَوَصَفَ لَهُ صِفَةً فَقَالَ { لَا يَحِلُّ لَكَ النِّسَاءُ مِنْ بَعْدُ } مِنْ بَعْدِ هَذِهِ الصِّفَةِ",
                "id": "Telah menceritakan kepadaku [Mu'alla bin Asad] ia berkata; telah menceritakan kepada kami [Wuhaib] dari [Daud bin Abu Hindun] dari [Muhammad bin Abu Musa] dari seorang laki-laki dari kalangan Anshar yang bernama [Ziyad] ia berkata; aku berkata kepada [Ubay bin Ka'b]; \"Bagaimana pendapatmu seandainya para isteri Nabi shallallahu 'alaihi wasallam meninggal, apakah boleh beliau menikah lagi?\" Ubay menjawab; \"Ya, sesungguhnya Allah menghalalkan baginya menikahi para wanita.\" Ubay menjelaskan kepadanya lalu berkata; Tidak halal bagimu mengawini perempuan-perempuan sesudah itu. QS Al Ahzab; 52. yaitu setelah ada keterangan ini. "
            },
            {
                "number": 1788,
                "arab": " أَخْبَرَنَا الْمُعَلَّى حَدَّثَنَا وُهَيْبٌ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَائِشَةَ قَالَتْ مَا تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَحَلَّ اللَّهُ لَهُ أَنْ يَتَزَوَّجَ مِنْ النِّسَاءِ مَا شَاءَ",
                "id": "Telah mengabarkan kepada kami [Al Mu'alla] dari [Wuhaib] dari [Ibnu Juraij] dari ['Atha`] dari ['Ubaid bin 'Umair] dari ['Aisyah] ia berkata; \"Tidaklah Rasulullah shallallahu 'alaihi wasallam meninggal hingga Allah menghalalkan baginya untuk menikahi wanita yang beliau kehendaki.\""
            },
            {
                "number": 1789,
                "arab": " حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ شُعَيْبِ بْنِ الْحَبْحَابِ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْتَقَ صَفِيَّةَ وَجَعَلَ عِتْقَهَا صَدَاقَهَا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Hammad bin Zaid] dari [Syu'aib bin Al Habhab] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam memerdekakan Shafiyah dan menjadikan pembebasannya sebagai maharnya.\""
            },
            {
                "number": 1790,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْتَقَ صَفِيَّةَ وَتَزَوَّجَهَا وَجَعَلَ عِتْقَهَا صَدَاقَهَا",
                "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam memerdekakan Shafiyah dan menjadikan pembebasannya sebagai maharnya.\""
            },
            {
                "number": 1791,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا هُشَيْمٌ عَنْ صَالِحِ بْنِ صَالِحِ بْنِ حَيٍّ الْهَمْدَانِيِّ قَالَ كُنْتُ عِنْدَ الشَّعْبِيِّ فَأَتَاهُ رَجُلٌ مِنْ أَهْلِ خُرَاسَانَ فَقَالَ يَا أَبَا عَمْرٍو إِنَّ مَنْ قِبَلَنَا مِنْ أَهْلِ خُرَاسَانَ يَقُولُونَ فِي الرَّجُلِ إِذَا أَعْتَقَ أَمَتَهُ ثُمَّ تَزَوَّجَهَا فَهُوَ كَالرَّاكِبِ بَدَنَتَهُ فَقَالَ الشَّعْبِيُّ حَدَّثَنِي أَبُو بُرْدَةَ بْنُ أَبِي مُوسَى عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةٌ يُؤْتَوْنَ أَجْرَهُمْ مَرَّتَيْنِ رَجُلٌ مِنْ أَهْلِ الْكِتَابِ آمَنَ بِنَبِيِّهِ ثُمَّ أَدْرَكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَآمَنَ بِهِ وَاتَّبَعَهُ وَعَبْدٌ مَمْلُوكٌ أَدَّى حَقَّ اللَّهِ وَحَقَّ مَوَالِيهِ فَلَهُ أَجْرَانِ وَرَجُلٌ كَانَتْ لَهُ أَمَةٌ فَغَذَّاهَا فَأَحْسَنَ غِذَاءَهَا وَأَدَّبَهَا فَأَحْسَنَ تَأْدِيبَهَا فَأَعْتَقَهَا وَتَزَوَّجَهَا فَلَهُ أَجْرَانِ ثُمَّ قَالَ لِلرَّجُلِ خُذْ هَذَا الْحَدِيثَ بِغَيْرِ شَيْءٍ فَقَدْ كَانَ يُرْحَلُ فِيمَا دُونَ هَذَا إِلَى الْمَدِينَةِ قَالَ هُشَيْمٌ أَفَادُونِي بِالْبَصْرَةِ فَأَتَيْتُهُ فَسَأَلْتُهُ عَنْهُ أَخْبَرَنَا سَهْلُ بْنُ حَمَّادٍ عَنْ شُعْبَةَ عَنْ صَالِحِ بْنِ حَيٍّ عَنْ الشَّعْبِيِّ عَنْ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذَا الْحَدِيثِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] telah menceritakan kepada kami [Husyaim] dari [Shalih bin Shalih bin Hay Al Hamdani] ia berkata; aku pernah bersama [Asy Sya'bi], kemudian seorang laki-laki dari penduduk Khurasan datang kepadanya dan berkata; \"Wahai Abu 'Amru, sesungguhnya orang-orang dibelakang kami dari kalangan penduduk Khurasan berkata mengenai seorang laki-laki yang memerdekakan budak wanitanya kemudian menikahinya seperti orang yang menggauli untanya.\" Kemudian [Asy Sya'bi] berkata; telah menceritakan kepadaku [Abu Burdah bin Musa] dari [Ayahnya], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tiga orang yang diberi pahala dua kali, yaitu; laki-laki dari ahli kitab yang beriman kepada nabinya kemudian menjumpai Nabi shallallahu 'alaihi wasallam dan beriman kepadanya serta mengikutinya, seorang budak yang menunaikan hak Allah dan hak tuannya, maka ia mendapatkan dua pahala, serta seorang laki-laki yang memiliki budak wanita kemudian memberinya makan dengan baik dan mendidiknya dengan baik, kemudian membebaskannya serta menikahinya, maka baginya dua pahala.\" Kemudian ia berkata kepada orang tersebut; \"Ambillah hadits ini tanpa imbalan apapun. Sungguh ia telah melakukan perjalanan kurang dari jarak ini menuju Madinah.\" Husyaim berkata; Mereka telah memberikan faedah kepadaku di Bashrah, kemudian aku datang kepadanya dan bertanya mengenai hal itu. Telah mengabarkan kepada kami [Sahl bin Hammad] dari [Syu'bah] dari [Shalih Hay] dari [Asy Sya'bi] dari [Abu Burdah] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam seperti hadits ini."
            },
            {
                "number": 1792,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ فِي رَجُلٍ تَزَوَّجَ امْرَأَةً وَلَمْ يَكُنْ فَرَضَ لَهَا شَيْئًا وَلَمْ يَدْخُلْ بِهَا وَمَاتَ عَنْهَا قَالَ فِيهَا لَهَا صَدَاقُ نِسَائِهَا وَعَلَيْهَا الْعِدَّةُ وَلَهَا الْمِيرَاثُ قَالَ مَعْقِلٌ الْأَشْجَعِيُّ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بِرْوَعَ بِنْتِ وَاشِقٍ امْرَأَةٍ مِنْ بَنِي رُوَاسٍ بِمِثْلِ مَا قَضَيْتَ قَالَ فَفَرِحَ بِذَلِكَ قَالَ مُحَمَّدٌ وَسُفْيَانُ نَأْخُذُ بِهَذَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Manshur] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] mengenai seorang laki-laki yang menikahi seorang wanita dan ia belum menetapkan sesuatupun sebagai maharnya, serta belum menggaulinya, ternyata suaminya meninggal. Abdullah berkata; Dalam masalah itu, wanita tersebut mendapatkan mahar layaknya wanita lain, dan ia juga harus melakukan 'iddah dan mendapatkan warisan.\" [Ma'qil Al Asyja'i] berkata; Rasulullah shallallahu 'alaihi wasallam telah menetapkan kepada Barwa' binti Wasyiq yaitu seorang wanita dari Bani Ruwas, seperti yang telah engkau putuskan. 'Alqamah berkata; kemudian ia senang dengan hal itu. Muhammad dan Sufyan berkata; kami mengambil pendapat ini."
            },
            {
                "number": 1793,
                "arab": " أَخْبَرَنَا إِسْحَقُ حَدَّثَنَا رَوْحٌ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ أَنَّهَا كَانَتْ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِ حَفْصَةَ فَسَمِعَتْ صَوْتَ إِنْسَانٍ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ سَمِعْتُ صَوْتَ إِنْسَانٍ فِي بَيْتِكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُرَاهُ فُلَانًا لِعَمِّ حَفْصَةَ مِنْ الرَّضَاعَةِ قَالَتْ عَائِشَةُ يَا رَسُولَ اللَّهِ وَلَوْ كَانَ فُلَانٌ حَيًّا لِعَمِّهَا مِنْ الرَّضَاعَةِ دَخَلَ عَلَيَّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَمْ يَحْرُمُ مِنْ الرَّضَاعَةِ مَا يَحْرُمُ مِنْ الْوِلَادَةِ",
                "id": "Telah mengabarkan kepada kami [Ishaq] telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Malik] dari [Abdullah bin Abu Bakr bin 'Amr bin Hazm] dari ['Amrah] dari ['Aisyah] bahwa dirinya bersama Nabi shallallahu 'alaihi wasallam di rumah Hafshah, kemudian ia mendengar suara orang. Aisyah berkata; lalu aku berkata; \"Wahai Rasulullah, au mendengar suara seseorang di dalam rumahmu.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku lira ia adalah Fulan, paman Hafshah sepersusuan.\" 'Aisyah berkata; \"Wahai Rasulullah, apabila Fulan masih hidup (ia menyebutkan paman sepersusuannya), bolehkah ia menemuiku?\" Beliau bersabda: \"Ya, sesuatu yang haram karena faktor persusuan adalah haram pula karena kelahiran.\""
            },
            {
                "number": 1794,
                "arab": " أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ قَالَ أَخْبَرَتْنِي عَائِشَةُ أَنَّ عَمَّهَا أَخَا أَبِي الْقُعَيْسِ جَاءَ يَسْتَأْذِنُ عَلَيْهَا بَعْدَمَا ضُرِبَ الْحِجَابُ فَأَبَتْ أَنْ تَأْذَنَ لَهُ حَتَّى يَأْتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْتَأْذِنَهُ فَلَمَّا جَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَتْ ذَلِكَ لَهُ فَقَالَتْ جَاءَ عَمِّي أَخُو أَبِي الْقُعَيْسِ فَرَدَدْتُهُ حَتَّى أَسْتَأْذِنَكَ قَالَ أَوَ لَيْسَ بِعَمِّكِ قَالَتْ إِنَّمَا أَرْضَعَتْنِي الْمَرْأَةُ وَلَمْ يُرْضِعْنِي الرَّجُلُ فَقَالَ إِنَّهُ عَمُّكِ فَلْيَلِجْ عَلَيْكِ قَالَ وَكَانَتْ عَائِشَةُ تَقُولُ يَحْرُمُ مِنْ الرَّضَاعَةِ مَا يَحْرُمُ مِنْ الْوِلَادَةِ",
                "id": "Telah mengabarkan kepada kami [Ja'far bin 'Aun] telah mengabarkan kepada kami [Hisyam bin 'Urwah] dari [Ayahnya] ia berkata; telah mengabarkan kepadaku ['Aisyah] bahwa pamannya yaitu saudara Abu Al Qu'ais datang meminta izin untuk menemuinya setelah turunnya ayat hijab, kemudian 'Aisyah menolak untuk mengizinkannya hingga Rasulullah shallallahu 'alaihi wasallam datang dan meminta izin kepada beliau, setelah Nabi shallallahu 'alaihi wasallam datang, 'Aisyah menyebutkan hal itu kepada beliau dan berkata; \"Pamanku yaitu saudara Abu Al Qu'ais datang, namun aku menolaknya hingga ia meminta izin kepada anda.\" Beliau bersabda: \"Bukankah ia pamanmu?\" Aisyah menjawab; \"Sesungguhnya yang menyusuiku adalah seorang wanita dan tidak disusui orang laki-laki.\" Beliau bersabda: \"Sesungguhnya ia adalah pamanmu, maka ia boleh masuk menemuimu.\" 'Urwah berkata; 'Aisyah melanjutkan; \"Sesungguhnya persusuan itu mengharamkan apa yang diharamkan peranakan.\""
            },
            {
                "number": 1795,
                "arab": " أَخْبَرَنَا صَدَقَةُ بْنُ الْفَضْلِ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مَالِكٍ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَحْرُمُ مِنْ الرَّضَاعَةِ مَا يَحْرُمُ مِنْ الْوِلَادَةِ قَالَ مَالِكٌ وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah mengabarkan kepada kami [Shadaqah bin Al Fadhl] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Malik] telah menceritakan kepadaku [Abdullah bin Dinar] dari [Sulaiman bin Yasar] dari ['Urwah] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Persusuan itu mengharamkan apa yang diharamkan peranakan.\" Dan telah menceritakan kepadaku [Abdullah bin Abu Bakr] dari ['Amrah] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam seperti itu."
            },
            {
                "number": 1796,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُحَرِّمُ الْمَصَّةُ وَالْمَصَّتَانِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] dari ['Urwah] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Satu hisapan dan dua hisapan tidaklah menyebabkannya mahram.\""
            },
            {
                "number": 1797,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي الْخَلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أُمِّ الْفَضْلِ أَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي قَدْ تَزَوَّجْتُ امْرَأَةً وَعِنْدِي أُخْرَى فَزَعَمَتْ الْأُولَى أَنَّهَا أَرْضَعَتْ الْحُدْثَى فَقَالَ لَا تُحَرِّمُ الْإِمْلَاجَةُ وَلَا الْإِمْلَاجَتَانِ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Al Khalil] dari [Abdullah bin Al Harits] dari [Ummu Al Fadhl] bahwa seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; \"Wahai Rasulullah, sesungguhnya aku telah menikahi seorang wanita, dan aku memiliki isteri yang lain, kemudian isteri yang pertama mengaku telah menyusui isteri yang baru.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Satu atau dua hisapan tidaklah menyebabkannya mahram.\""
            },
            {
                "number": 1798,
                "arab": " أَخْبَرَنَا إِسْحَقُ أَخْبَرَنَا رَوْحٌ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ نَزَلَ الْقُرْآنُ بِعَشْرِ رَضَعَاتٍ مَعْلُومَاتٍ يُحَرِّمْنَ ثُمَّ نُسِخْنَ بِخَمْسٍ مَعْلُومَاتٍ فَتُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُنَّ مِمَّا يُقْرَأُ مِنْ الْقُرْآنِ",
                "id": "Telah mengabarkan kepada kami [Ishaq] telah mengabarkan kepada kami [Rauh] telah menceritakan kepada kami [Malik] dari [Abdullah bin Abu Bakr] dari ['Amrah] dari ['Aisyah] ia berkata; \"Al Qur'an turun mengenai susuan yang dapat menyebabkan menjadi muhrim ialah sepuluh kali penyusuan, kemudian hal itu dinasakh (dihapus) dengan lima kali penyusuan saja. Lalu Rasulullah shallallahu 'alaihi wasallam wafat, sementara ayat-ayat Al Qur'an masih tetap di baca seperti itu.\""
            },
            {
                "number": 1799,
                "arab": " حَدَّثَنَا عُثْمَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدَةُ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ حَجَّاجِ بْنِ حَجَّاجٍ الْأَسْلَمِيِّ عَنْ أَبِيهِ أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ مَا يُذْهِبُ عَنِّي مَذَمَّةَ الرَّضَاعِ قَالَ الْغُرَّةُ الْعَبْدُ أَوْ الْأَمَةُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Muhammad] telah menceritakan kepada kami ['Abdah] dari [Hisyam] dari [Ayahnya] dari [Hajjaj bin Hajjaj Al Aslami] dari [Ayahnya] bahwa ia berkata; \"Wahai Rasulullah, apakah yang dapat menghilangkan dariku hak yang disebabkan karena penyusuan?\" Beliau menjawab: \"Denda yaitu budak laki-laki atau perempuan.\""
            },
            {
                "number": 1800,
                "arab": " حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ قَالَ حَدَّثَنِي عُقْبَةُ بْنُ الْحَارِثِ ثُمَّ قَالَ لَمْ يُحَدِّثْنِيهِ وَلَكِنْ سَمِعْتُهُ يُحَدِّثُ الْقَوْمَ قَالَ تَزَوَّجْتُ بِنْتَ أَبِي إِهَابٍ فَجَاءَتْ أَمَةٌ سَوْدَاءُ فَقَالَتْ إِنِّي أَرْضَعْتُكُمَا فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَأَعْرَضَ عَنِّي قَالَ أَبُو عَاصِمٍ قَالَ فِي الثَّالِثَةِ أَوْ الرَّابِعَةِ قَالَ كَيْفَ وَقَدْ قِيلَ وَنَهَاهُ عَنْهَا قَالَ أَبُو عَاصِمٍ وَقَالَ عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي حُسَيْنٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ فَكَيْفَ وَقَدْ قِيلَ وَلَمْ يَقُلْ نَهَاهُ عَنْهَا قَالَ أَبُو مُحَمَّد كَذَا عِنْدَنَا",
                "id": "Telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Ibnu Abu Mulaikah] ia berkata; telah menceritakan kepadaku ['Uqbah bin Al Harits], -Ibnu Abu Mulaikah berkata; 'Uqbah tidak menceritakannya kepadaku, akan tetapi aku mendengar ia menceritakan kepada beberapa orang- ia berkata; aku menikahi putrid Abu Ihab, kemudian seorang budak wanita hitam datang dan berkata; \"Sesungguhnya aku telah menyusui kalian berdua.\" Lalu aku datang kepada Nabi shallallahu 'alaihi wasallam dan menyebutkan hal itu kepada beliau. Maka beliau berpaling dariku.\" Abu 'Ashim berkata; \"Ketiga atau keempat kalinya beliau bersabda: \"Bagaimana lagi, padahal itu telah dikatakan! \" Lalu beliau melarangnya (menikahi) wanita tersebut.\" [Abu 'Ashim] berkata; [Umar bin Sa'id bin Abu Husain] berkata dari [Ibnu Abu Mulaikah]; \"Bagaimana lagi, padahal itu telah dikatakan! \" Dan Umar bin Sa'id tidak menyebutkan; \"Kemudian beliau melarang (menikahi) wanita tersebut).\" Abu Muhammad berkata; \"Demikianlah yang ada pada kami.\""
            },
            {
                "number": 1801,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ عَنْ أَشْعَثَ بْنِ سُلَيْمٍ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَعِنْدَهَا رَجُلٌ فَتَغَيَّرَ وَجْهُهُ وَكَأَنَّهُ كَرِهَ ذَلِكَ فَقُلْتُ إِنَّهُ أَخِي مِنْ الرَّضَاعَةِ فَقَالَ انْظُرْنَ مَا إِخْوَانُكُنَّ فَإِنَّمَا الرَّضَاعَةُ مِنْ الْمَجَاعَةِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah] dari [Asy'ats bin Sulaim] dari [Ayahnya] dari [Masruq] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam menemuinya, sementara di sampingnya terdapat seorang laki-laki, maka wajah beliau berubah sepertinya beliau tidak senang dengan hal itu. kemudian aku berkata; \"Sesungguhnya dia saudara sepersusuanlu.\" Beliau bersabda: \"Lihatlah, siapakah saudara-saudara kalian, sesungguhnya penyusuan itu karena lapar.\""
            },
            {
                "number": 1802,
                "arab": " أَخْبَرَنَا أَبُو الْيَمَانِ الْحَكَمُ بْنُ نَافِعٍ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ جَاءَتْ سَهْلَةُ بِنْتُ سُهَيْلِ بْنِ عَمْرٍو وَكَانَتْ تَحْتَ أَبِي حُذَيْفَةَ بْنِ عُتْبَةَ بْنِ رَبِيعَةَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنَّ سَالِمًا مَوْلَى أَبِي حُذَيْفَةَ يَدْخُلُ عَلَيْنَا وَأَنَا فُضُلٌ وَإِنَّمَا نَرَاهُ وَلَدًا وَكَانَ أَبُو حُذَيْفَةَ تَبَنَّاهُ كَمَا تَبَنَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْدًا فَأَنْزَلَ اللَّهُ تَعَالَى { ادْعُوهُمْ لِآبَائِهِمْ هُوَ أَقْسَطُ عِنْدَ اللَّهِ } فَأَمَرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ ذَلِكَ أَنْ تُرْضِعَ سَالِمًا قَالَ أَبُو مُحَمَّد هَذَا لِسَالِمٍ خَاصَّةً",
                "id": "Telah mengabarkan kepada kami [Abu Al Yaman Al Hakam bin Nafi'] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] ia berkata; [Sahlah binti Suhail bin 'Amr] -ia adalah isteri Abu Hudzaifah bin 'Utbah bin Rabi'ah- datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; \"Sesungguhnya Salim mantan budak Abu Hudzaifah sering menemui kami, sementara aku memakai baju rumah (yang kelihat sebagian tubuhnya -pent), sementara kami mengangkat sebagai anak. Dan Abu Hudzaifah juga mengangkatnya sebagai anak sebagaimana Nabi shallallahu 'alaihi wasallam menganggap Zaid sebagai anak. Kemudian Allah Ta'ala menurunkan ayat: \" Panggilah mereka (anak-anak angkat itu) dengan (memakai) nama bapak-bapak mereka; itulah yang lebih adil pada sisi Allah.\" QS Al Ahzab; 5. Kemudian Nabi shallallahu 'alaihi wasallam memerintahkannya untuk menyusui Salim. Abu Muhammad berkata; \"Ini khusus untuk Salim.\""
            },
            {
                "number": 1803,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي قَيْسٍ عَنْ الْهُزَيْلِ عَنْ عَبْدِ اللَّهِ قَالَ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُحِلَّ وَالْمُحَلَّلَ لَهُ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Abu Qais] dari [Al Hudzail] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam melaknat muhilla dan muhallal lahu.\" "
            },
            {
                "number": 1804,
                "arab": " أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ هِنْدًا أُمَّ مُعَاوِيَةَ امْرَأَةَ أَبِي سُفْيَانَ أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ أَبَا سُفْيَانَ رَجُلٌ شَحِيحٌ وَإِنَّهُ لَا يُعْطِينِي مَا يَكْفِينِي وَبَنِيَّ إِلَّا مَا أَخَذْتُ مِنْهُ وَهُوَ لَا يَعْلَمُ فَهَلْ عَلَيَّ فِي ذَلِكَ جُنَاحٌ فَقَالَ خُذِي مَا يَكْفِيكِ وَوَلَدَكِ بِالْمَعْرُوفِ",
                "id": "Telah mengabarkan kepada kami [Ja'far bin 'Aun] telah mengabarkan kepada kami [Hisyam bin 'Urwah] dari [Ayahnya] dari ['Aisyah] bahwa Hindun ibu Mu'awiyah, isteri Abu Sufyan datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; \"Wahai Rasulullah, sesungguhnya Abu Sufyan adalah orang yang pelit, dan ia tidak memberiku apa yang cukup untukku dan anakku kecuali yang aku ambil darinya, sementara ia tidak mengetahui. Apakah dalam hal itu aku mendapatkan dosa?\" Beliau bersabda: \"Ambillah apa yang cukup bagimu dan anakmu dengan cara yang baik.\""
            },
            {
                "number": 1805,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُكُمْ خَيْرُكُمْ لِأَهْلِهِ وَإِذَا مَاتَ صَاحِبُكُمْ فَدَعُوهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari ['Aisyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik kalian adalah orang yang baik kepada keluarganya, apabila sahabat kalian meninggal, maka biarkanlah (jangan mengungkit-ungkit kejelekannya).\""
            },
            {
                "number": 1806,
                "arab": " أَخْبَرَنَا إِسْمَعِيلُ بْنُ خَلِيلٍ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ تَزَوَّجَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا بِنْتُ سِتِّ سِنِينَ فَقَدِمْنَا الْمَدِينَةَ فَنَزَلْنَا فِي بَنِي الْحَارِثِ بْنِ الْخَزْرَجِ فَوُعِكْتُ فَتَمَرَّقَ رَأْسِي فَأَوْفَى جُمَيْمَةً فَأَتَتْنِي أُمُّ رُومَانَ وَإِنِّي لَفِي أُرْجُوحَةٍ وَمَعِي صَوَاحِبَاتٌ لِي فَصَرَخَتْ بِي فَأَتَيْتُهَا وَمَا أَدْرِي مَا تُرِيدُ فَأَخَذَتْ بِيَدِي حَتَّى أَوْقَفَتْنِي عَلَى بَابِ الدَّارِ وَإِنِّي لَأَنْهَجُ حَتَّى سَكَنَ بَعْضُ نَفَسِي ثُمَّ أَخَذَتْ شَيْئًا مِنْ مَاءٍ فَمَسَحَتْ بِهِ وَجْهِي وَرَأْسِي ثُمَّ أَدْخَلَتْنِي الدَّارَ فَإِذَا نِسْوَةٌ مِنْ الْأَنْصَارِ فِي الْبَيْتِ فَقُلْنَ عَلَى الْخَيْرِ وَالْبَرَكَةِ وَعَلَى خَيْرِ طَائِرٍ فَأَسْلَمَتْنِي إِلَيْهِنَّ فَأَصْلَحْنَ مِنْ شَأْنِي فَلَمْ يَرُعْنِي إِلَّا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضُحًى فَأَسْلَمَتْنِي إِلَيْهِ وَأَنَا يَوْمَئِذٍ بِنْتُ تِسْعِ سِنِينَ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Khalil] telah mengabarkan kepada kami [Ali bin Mushir] dari [Hisyam] dari [Ayahnya] dari ['Aisyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam menikahiku, sementara aku masih berumur enam tahun, kemudian kami datang ke Madinah dan singgah di Bani Al Harits bin Al Khazraj, aku terserang demam hingga menyebabkan rambut kepalaku rontok, lalu Ummu Ruman datang menemiku, katika aku tengah berada dibandulan bersama teman-temanku. Kemudian ia memanggilu dan mendatangiku, aku tidak tahu apa yang dia inginkan. Lalu dia menggandeng tanganku hingga memberhentikanku di depan pintu rumah, sementara diriku masih tersengal-sengal. Setelah aku tenang kembali, Ummu Ruman mengambil sedikit air dan mengusap wajah dan kepalaku. Kemudian ia memasukkanku ke dalam rumah, ternyata di rumah terdapat beberapa orang wanita Anshar. Mereka berkata; \"Semoga dalam keadaan baik dan berkah, dan semoga mendapatkan nasib yang baik.\" Kemudian ia menyerahkanku kepada mereka, lalu mereka membenahi keadaanku dan tidak ada yang membuatkan perhatian kecuali kehadiran Rasulullah shallallahu 'alaihi wasallam pada waktu Dhuha. Kemudian Ummu Ruman menyerahkanku kepada beliau sementara aku masih berumur enam tahun.\""
            },
            {
                "number": 1807,
                "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ طَلَّقَ امْرَأَتَهُ وَهِيَ حَائِضٌ فَذَكَرَ ذَلِكَ عُمَرُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مُرْهُ أَنْ يُرَاجِعَهَا وَيُمْسِكَهَا حَتَّى تَطْهُرَ ثُمَّ تَحِيضَ ثُمَّ تَطْهُرَ ثُمَّ إِنْ شَاءَ أَمْسَكَ وَإِنْ شَاءَ طَلَّقَ قَبْلَ أَنْ يَمَسَّ فَتِلْكَ الْعِدَّةُ الَّتِي أَمَرَ اللَّهُ أَنْ يُطَلَّقَ لَهَا النِّسَاءُ",
                "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Ibnu Umar] bahwa dia menceraikan isterinya ketika haid. Kemudian Umar memberitahukan hal itu kepada Nabi shallallahu 'alaihi wasallam, beliau berkata: \"Perintahkan supaya dia kembali, dan merujiknya hingga isterinya suci kemudian haid, kemudian suci, setelah itu jika berkehendak, maka dia boleh menahannya dan jika berkehendak, maka dia boleh mencerai sebelum menggaulinya. Itulah 'iddah yang Allah perintahkan agar wanita dicerai karenanya.\""
            },
            {
                "number": 1808,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَخْبَرَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ سَمِعْتُ سَالِمًا يَذْكُرُ عَنْ ابْنِ عُمَرَ أَنَّ عُمَرَ قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ طَلَّقَ ابْنُ عُمَرَ امْرَأَتَهُ فَقَالَ مُرْهُ فَلْيُرَاجِعْهَا ثُمَّ لِيُطَلِّقْهَا وَهِيَ طَاهِرٌ قَالَ أَبُو مُحَمَّد رَوَاهُ ابْنُ الْمُبَارَكِ وَوَكِيعٌ أَوْ حَامِلٌ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Musa] telah mengabarkan kepada kami [Sufyan] dari [Muhammad bin Abdurrahman] ia berkata; aku mendengar [Salim] menyebutkankan dari [Ibnu Umar] bahwa [Umar] berkata kepada Nabi shallallahu 'alaihi wasallam ketika Ibnu Umar menceraikan isterinya. Beliau bersabda: \"Perintahkan supaya dia kembali kepada isterinya, setelah itu dia boleh mencerainya ketika isterinya suci.\" Abu Muhammad berkata; [Ibnu Al Mubarak] serta [Waki'] meriwayatkan; \"Atau dalam keadaan hamil.\""
            },
            {
                "number": 1809,
                "arab": " حَدَّثَنَا إِسْمَعِيلُ بْنُ خَلِيلٍ وَإِسْمَعِيلُ بْنُ أَبَانَ قَالَا حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ عَنْ صَالِحِ بْنِ صَالِحٍ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ عُمَرَ قَالَ طَلَّقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَفْصَةَ ثُمَّ رَاجَعَهَا",
                "id": "Telah menceritakan kepada kami [Isma'il bin Khalil] dan [Isma'il bin Aban] keduanya berkata; telah menceritakan kepada kami [Yahya bin Abu Zaidah] dari [Shalih bin Shalih] dari [Salamah bin Kuhail] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dari [Umar], ia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah mencerai Hafshah kemudian merujuknya.\""
            },
            {
                "number": 1810,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ سُلَيْمَانَ عَنْ هُشَيْمٍ عَنْ حُمَيْدٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَلَّقَ حَفْصَةَ ثُمَّ رَاجَعَهَا قَالَ أَبُو مُحَمَّد كَأَنَّ عَلِيَّ بْنَ الْمَدِينِيِّ أَنْكَرَ هَذَا الْحَدِيثَ وَقَالَ لَيْسَ عِنْدَنَا هَذَا الْحَدِيثُ بِالْبَصْرَةِ عَنْ حُمَيْدٍ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin Sulaiman] dari [Husyaim] dari [Humaid] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam pernah mencerai Hafshah kemudian merujuknya.\" Abu Muhammad berkata; \"Seolah-olah Ali bin Al Madini mengingkari hadits ini dan berkata; \"Kami tidak memiliki hadits ini di Bashrah (yang diriwayatkan) dari Humaid.\""
            },
            {
                "number": 1811,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ حَدَّثَنِي الزُّهْرِيُّ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ الْحَكَمُ قَالَ لِي يَحْيَى بْنُ حَمْزَةَ أَفْصِلُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ أَنْ لَا يَمَسَّ الْقُرْآنَ إِلَّا طَاهِرٌ وَلَا طَلَاقَ قَبْلَ إِمْلَاكٍ وَلَا عَتَاقَ حَتَّى يَبْتَاعَ قِيلَ لِأَبِي مُحَمَّدٍ مَنْ سُلَيْمَانُ قَالَ أَحْسَبُ كَاتِبًا مِنْ كُتَّابِ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ",
                "id": "Telah menghabarkan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Sulaiman bin Daud] telah menceritakan kepadaku [Az Zuhri] dari [Abu Bakr bin Muhammad bin 'Amr bin Hazm] dari [Ayahnya] dari [Kakeknya] ia berkata; [Al Hakam] berkata; [Yahya bin Hamzah] berkata kepadaku; \"Aku menerangkan bahwa Rasulullah shallallahu 'alaihi wasallam telah menulis surat kepada penduduk Yaman bahwa tidak boleh menyentuh Al Qur'an kecuali orang yang suci, tidak boleh mencerai sebelum menikah dan tidak dapat membebaskan kecuali setelah membeli.\" Abu Muhammad ditanya; \"Siapakah Sulaiman itu?\" Dia menjawab; \"Aku kira ia adalah sekretaris diantara sekretaris Umar bin Abdul Aziz.\""
            },
            {
                "number": 1812,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ قَالَ سَمِعْتُ عُرْوَةَ بْنَ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْ جَاءَتْ امْرَأَةُ رِفَاعَةَ الْقُرَظِيِّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَهُ أَبُو بَكْرٍ وَخَالِدُ بْنُ سَعِيدِ بْنِ الْعَاصِ عَلَى الْبَابِ يَنْتَظِرُ أَنْ يُؤْذَنَ لَهُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ عِنْدَ رِفَاعَةَ فَطَلَّقَنِي فَبَتَّ طَلَاقِي قَالَ أَتُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ لَا حَتَّى يَذُوقَ عُسَيْلَتَكِ وَتَذُوقِي عُسَيْلَتَهُ فَنَادَى خَالِدُ بْنُ سَعِيدٍ أَبَا بَكْرٍ أَلَا تَرَى مَا تَجْهَرُ بِهِ هَذِهِ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Az Zuhri] ia berkata; aku mendengar ['Urwah bin Az Zubair] dari ['Aisyah] ia berkata; isteri Rifa'ah Al Qurazhi datang kepada Rasulullah shallallahu 'alaihi wasallam, sedangkan Abu Bakr berada di sisi beliau, sementara Khalid bin Sa'id bin Al 'Ash berada di depan pintu, menunggu hingga di izinkan untuk menemui Rasulullah shallallahu 'alaihi wasallam, kemudian isteri Rifa'ah berkata; \"Wahai Rasulullah, sesungguhnya dahulu aku hidup bersama Rifa'ah, kemudian ia menceraiku dengan talak tiga. Beliau bersabda: \"Apakah engkau ingin kembali kepada Rifa'ah? Tidak boleh, hingga ia (suami yang baru) mencicipi madumu dan engkau mencicipi madunya.\" Kemudian Khalid bin Sa'id memanggil Abu Bakr, ia berkata; \"Tidakkah engkau melihat wanita ini berkata kasar di sisi Rasulullah shallallahu 'alaihi wasallam?.\""
            },
            {
                "number": 1813,
                "arab": " حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ طَلَّقَ رِفَاعَةُ رَجُلٌ مِنْ بَنِي قُرَيْظَةَ امْرَأَتَهُ فَتَزَوَّجَهَا عَبْدُ الرَّحْمَنِ بْنُ الزُّبَيْرِ فَدَخَلَتْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ وَاللَّهِ إِنْ مَعَهُ إِلَّا مِثْلُ هُدْبَتِي هَذِهِ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَلَّكِ تُرِيدِينَ أَنْ تَرْجِعِي إِلَى رِفَاعَةَ لَا حَتَّى يَذُوقَ عُسَيْلَتَكِ أَوْ قَالَ تَذُوقِي عُسَيْلَتَهُ",
                "id": "Telah menceritakan kepada kami [Farwah bin Abu Al Maghra`] telah menceritakan kepada kami [Ali bin Mushir] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari ['Aisyah], ia berkata; Rifa'ah seorang laki-laki dari Bani Quraizhah telah mencerai isterinya, kemudian Abdurrahman bin Az Zubair menikahi mantan isteri Rifa'ah, lalu wanita (mantan isteri Rifa'ah) menemui Rasulullah shallallahu 'alaihi wasallam dan berkata; \"Wahai Rasulullah, ia (Abdurrahman bin Zubair) tidak memiliki kemampuan kecuali seperti ujung kainku ini.\" Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Kemungkinan engkau ingin kembali kepada Rifa'ah. Tidak, hingga ia merasakan madumu atau engkau merasakan madunya.\""
            },
            {
                "number": 1814,
                "arab": " أَخْبَرَنَا يَعْلَى حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ قَالَ سَأَلْتُ عَائِشَةَ عَنْ الْخِيَرَةِ فَقَالَتْ قَدْ خَيَّرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفَكَانَ طَلَاقًا",
                "id": "Telah mengabarkan kepada kami [Ya'la] telah menceritakan kepada kami [Isma'il bin Abu Khalid] dari [Asy Sya'bi] dari [Masruq] ia berkata; aku bertanya kepada ['Aisyah] mengenai khiyarah, 'Aisyah menjawab; \"Rasulullah shallallahu 'alaihi wasallam telah memberikan pilihan kepada kami, namun hal itu tidak dianggap sebagai bentuk talak.\" "
            },
            {
                "number": 1815,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي أَسْمَاءَ عَنْ ثَوْبَانَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا امْرَأَةٍ سَأَلَتْ زَوْجَهَا الطَّلَاقَ مِنْ غَيْرِ بَأْسٍ فَحَرَامٌ عَلَيْهَا رَائِحَةُ الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Fadhl] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Qilabah] dari [Abu Asma`] dari [Tsauban], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapapun wanita yang meminta cerai suaminya, bukan karena sesuatu yang menyusahkan, maka haram baginya bau Surga.\""
            },
            {
                "number": 1816,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَحْيَى هُوَ ابْنُ سَعِيدٍ أَنَّ عَمْرَةَ أَخْبَرَتْهُ أَنَّ حَبِيبَةَ بِنْتَ سَهْلٍ تَزَوَّجَهَا ثَابِتُ بْنُ قَيْسِ بْنِ شَمَّاسٍ فَذَكَرَتْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ هَمَّ أَنْ يَتَزَوَّجَهَا وَكَانَتْ جَارَةً لَهُ وَأَنَّ ثَابِتًا ضَرَبَهَا فَأَصْبَحَتْ عَلَى بَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْغَلَسِ وَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فَرَأَى إِنْسَانًا فَقَالَ مَنْ هَذَا قَالَتْ أَنَا حَبِيبَةُ بِنْتُ سَهْلٍ فَقَالَ مَا شَأْنُكِ قَالَتْ لَا أَنَا وَلَا ثَابِتٌ فَأَتَى ثَابِتٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ رَسُولُ اللَّهِ خُذْ مِنْهَا وَخَلِّ سَبِيلَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ عِنْدِي كُلُّ شَيْءٍ أَعْطَانِيهِ فَأَخَذَ مِنْهَا وَقَعَدَتْ عِنْدَ أَهْلِهَا",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Yahya yaitu Ibnu Sa'id] bahwa ['Amrah] telah menceritakan bahwa [Habibah binti Sahl] telah dinikahi Tsabit bin Qais bin Syammas, kemudian ia menyebutkan bahwa Rasulullah shallallahu 'alaihi wasallam dahulu berkeinginan untuk menikahinya, dia adalah tetangga beliau. Suatu ketika Tsabit memukulnya, dan di waktu fajar, ia berada di depan pintu Rasulullah shallallahu 'alaihi wasallam dalam kegelapan, Ketika Rasulullah shallallahu 'alaihi wasallam keluar dan melihat ada seseorang, beliau bersabda bersabda; \"Siapakah ini?\" Habibah menjawab; \"Aku Habibah binti Sahl.\" Beliau bersabda; \"Apa keperluanmu?, \" Habibah berkata; \"Tidak mungkin aku dan Tsabit berkumpul.\" Kemudian Tsabit datang kepada Rasulullah shallallahu 'alaihi wasallam, lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Ambillah dari isterimu dan lepaskanlah dia.\" Habibah berkata; \"Wahai Rasulullah, segala yang ia berikan, ada padaku.\" Kemudian Tsabit mengambil darinya, lalu Habibah tinggal bersama keluarganya.\""
            },
            {
                "number": 1817,
                "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ الزُّبَيْرِ بْنِ سَعِيدٍ رَجُلٍ مِنْ بَنِي عَبْدِ الْمُطَّلِبِ قَالَ بَلَغَنِي حَدِيثٌ عَنْ عَبْدِ اللَّهِ بْنِ عَلِيِّ بْنِ يَزِيدَ بْنِ رُكَانَةَ وَهُوَ فِي قَرْيَةٍ لَهُ فَأَتَيْتُهُ فَسَأَلْتُهُ فَقَالَ حَدَّثَنِي أَبِي عَنْ جَدِّي أَنَّهُ طَلَّقَ امْرَأَتَهُ الْبَتَّةَ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ مَا أَرَدْتَ فَقَالَ وَاحِدَةً قَالَ آللَّهِ قَالَ آللَّهِ قَالَ هُوَ مَا نَوَيْتَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Jarir bin Hazim] dari [Az Zubair bin Sa'id] seorang laki-laki dari Bani Abdul Muththalib, ia berkata; [telah sampai kepadaku] suatu hadits dari [Abdullah bin Ali bin Yazid bin Rukanah] sementara dirinya berada di desanya, kemudian aku datang kepadanya, ia pun berkata; telah menceritakan kepadaku [Ayahku] dari [kakekku] bahwa ia telah menceraikan isterinya sama sekali (talak tiga), kemudian dia datang kepada Nabi shallallahu 'alaihi wasallam dan menceritakan hal itu. Beliau lalu bertanya: \"Apa yang engkau inginkan?\" dia berkata; \"Cerai satu kali.\" Beliau bersabda: \"Demi Allah?\" Ia berkata; \"Demi Allah.\" Beliau berkata: \"Hal itu seperti apa yang engkau niatkan.\""
            },
            {
                "number": 1818,
                "arab": " حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ سَلَمَةَ بْنِ صَخْرٍ الْبَيَاضِيِّ قَالَ كُنْتُ امْرَأً أُصِيبُ مِنْ النِّسَاءِ مَا لَا يُصِيبُ غَيْرِي فَلَمَّا دَخَلَ شَهْرُ رَمَضَانَ خِفْتُ أَنْ أُصِيبَ فِي لَيْلِي شَيْئًا فَيَتَتَابَعَ بِي ذَلِكَ إِلَى أَنْ أُصْبِحَ قَالَ فَتَظَاهَرْتُ إِلَى أَنْ يَنْسَلِخَ فَبَيْنَا هِيَ لَيْلَةً تَخْدُمُنِي إِذْ تَكَشَّفَ لِي مِنْهَا شَيْءٌ فَمَا لَبِثْتُ أَنْ نَزَوْتُ عَلَيْهَا فَلَمَّا أَصْبَحْتُ خَرَجْتُ إِلَى قَوْمِي فَأَخْبَرْتُهُمْ وَقُلْتُ امْشُوا مَعِي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا لَا وَاللَّهِ لَا نَمْشِي مَعَكَ مَا نَأْمَنُ أَنْ يَنْزِلَ فِيكَ الْقُرْآنُ أَوْ أَنْ يَكُونَ فِيكَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقَالَةٌ يَلْزَمُنَا عَارُهَا وَلَنُسْلِمَنَّكَ بِجَرِيرَتِكَ فَانْطَلَقْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَصَصْتُ عَلَيْهِ خَبَرِي فَقَالَ يَا سَلَمَةُ أَنْتَ بِذَاكَ قُلْتُ أَنَا بِذَاكَ قَالَ يَا سَلَمَةُ أَنْتَ بِذَاكَ قُلْتُ أَنَا بِذَاكَ قَالَ يَا سَلَمَةُ أَنْتَ بِذَاكَ قُلْتُ أَنَا بِذَاكَ وَهَا أَنَا صَابِرٌ نَفْسِي فَاحْكُمْ فِيَّ مَا أَرَاكَ اللَّهُ قَالَ فَأَعْتِقْ رَقَبَةً قَالَ فَضَرَبْتُ صَفْحَةَ رَقَبَتِي فَقُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أَصْبَحْتُ أَمْلِكُ رَقَبَةً غَيْرَهَا قَالَ فَصُمْ شَهْرَيْنِ مُتَتَابِعَيْنِ قُلْتُ وَهَلْ أَصَابَنِي الَّذِي أَصَابَنِي إِلَّا فِي الصِّيَامِ قَالَ فَأَطْعِمْ وَسْقًا مِنْ تَمْرٍ سِتِّينَ مِسْكِينًا فَقُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ لَقَدْ بِتْنَا لَيْلَتَنَا وَحْشَى مَا لَنَا طَعَامٌ قَالَ فَانْطَلِقْ إِلَى صَاحِبِ صَدَقَةِ بَنِي زُرَيْقٍ فَلْيَدْفَعْهَا إِلَيْكَ وَأَطْعِمْ سِتِّينَ مِسْكِينًا وَسْقًا مِنْ تَمْرٍ وَكُلْ بَقِيَّتَهُ أَنْتَ وَعِيَالُكَ قَالَ فَأَتَيْتُ قَوْمِي فَقُلْتُ وَجَدْتُ عِنْدَكُمْ الضِّيقَ وَسُوءَ الرَّأْيِ وَوَجَدْتُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّعَةَ وَحُسْنَ الرَّأْيِ وَقَدْ أَمَرَ لِي بِصَدَقَتِكُمْ",
                "id": "Telah menceritakan kepada kami [Zakariya bin 'Adi] telah menceritakan kepada kami [Abdullah bin Idris] dari [Muhammad bin Ishaq] dari [Muhammad bin 'Amr] dari [Sulaiman bin Yasar] dari [Salamah bin Shakhr Al Bayadhi] ia berkata; \"Aku dahulu adalah orang yang sering menggauli isteri tidak seperti orang lain yang menggauli isterinya. Tatkala masuk Bulan Ramadhan, aku sedikit khawatir melakukan jima' pada malam hariku, sehingga hal itu berlanjut hingga pagi hari. Maka aku menzhihar isteriku hingga berlalunya bulan Ramadhan. Pada dustu malam, ia membantuku, tiba-tiba tersingkap sesuatu darinya, tidak lama kemudian aku pun menggaulinya. Pada pagi harinya, aku keluar menuju kepada kaumku dan mengabarkan hal itu kepada mereka, aku berkata; \"Pergilah kalian bersamaku menemui Rasulullah shallallahu 'alaihi wasallam! \" Mereka mengatakan; \"Tidak, demi Allah, kami tidak akan pergi bersamamu. Kami khawatir turun Al Qur'an mengenai dirimu atau terdapat perkataan Rasulullah shallallahu 'alaihi wasallam mengenai dirimu yang aibnya mengenai kami. Sungguh kami menyerahkanmu dengan dosamu sendiri.\" Akhirnya aku pergi menemui Rasulullah shallallahu 'alaihi wasallam dan menceritakan kepada beliau berita mengenaiku. Beliau bersabda: \"Wahai Salamah, apakah engkau melakukan hal ini?\" Aku berkata; \"Aku telah melakukan hal ini.\" Beliau bersabda: \"Wahai Salamah, apakah engkau melakukan hal ini?\" aku menjawab; \"Aku telah melakukan hal ini.\" Beliau bersabda: \"Wahai Salamah, apakah engkau melakukan hal ini?\" Aku menjawab; \"Aku telah melakukan hal ini. Inilah aku yang telah bersabar terhadap diriku, maka putuskanlah terhadap diriku apa yang telah Allah perlihatkan kepada dirimu.\" Beliau bersabda: \"Bebaskanlah budak.\" Salamah berkata; \"Aku menepuk leher belakangku dan berkata; \"Demi Dzat yang mengutusmu dengan kebenaran, tidaklah aku dipagi hari memiliki budak selain dirinya.\" Beliau bersabda: \"Berpuasalah dua bulan berturut-turut! \" Aku berkata; \"Tidaklah aku tertimpa sesuatu yang menimpaku, kecuali ketika aku berpuasa.\" Beliau bersabda: \"Berilah makan satu wasaq kurma enam puluh orang miskin.\" Lalu aku berkata; \"Demi Dzat yang mengutusmu dengan kebenaran, sungguh kami bermalam dalam keadaan tidak memiliki makanan.\" Beliau bersabda: \"Pergilah kepada penjaga Shadaqah Bani Zuraiq, hendaknya ia memberikan kepadamu dan berilah makan enam puluh orang miskin satu wasaq kurma, dan makanlah sisanya bersama keluargamu.\" Salamah berkata; \"Kemudian aku mendatangi kaumku dan berkata; \"Aku dapatkan di sisi kalian kesempitan serta pendapat yang buruk, dan aku dapatkan di sisi Rasulullah shallallahu 'alaihi wasallam kelapangan dan pendapat yang baik, beliau telah memerintahkan agar aku diberi shadaqah kalian.\""
            },
            {
                "number": 1819,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ الشَّعْبِيِّ عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ أَنَّ زَوْجَهَا طَلَّقَهَا ثَلَاثًا فَلَمْ يَجْعَلْ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَفَقَةً وَلَا سُكْنَى قَالَ سَلَمَةُ فَذَكَرْتُ ذَلِكَ لِإِبْرَاهِيمَ فَقَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ لَا نَدَعُ كِتَابَ رَبِّنَا وَسُنَّةَ نَبِيِّهِ بِقَوْلِ امْرَأَةٍ فَجَعَلَ لَهَا السُّكْنَى وَالنَّفَقَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Salamah bin Kuhail] dari [Asy Sya'bi] dari [Fathimah binti Qais] bahwa suaminya telah mencerainya tiga kali dan Nabi shallallahu 'alaihi wasallam tidak memberikan nafkah untuknya dan tidak pula tempat tinggal.\" Salamah berkata; \"Kemudian aku sebutkan hal itu kepada Ibrahim. Dia berkata; \"Umar bin Al Khathab berkata; \"Kami tidak akan meninggalkan Kitab Rabb kami dan Sunnah Nabi kami karena perkataan seorang wanita. Dan ia tetap (berkewajiban) memberikan tempat tinggal dan nafkah.\""
            },
            {
                "number": 1820,
                "arab": " أَخْبَرَنَا يَعْلَى حَدَّثَنَا زَكَرِيَّا عَنْ عَامِرٍ حَدَّثَتْنِي فَاطِمَةُ بِنْتُ قَيْسٍ أَنَّ زَوْجَهَا طَلَّقَهَا ثَلَاثًا فَأَمَرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَعْتَدَّ عِنْدَ ابْنِ عَمِّهَا ابْنِ أُمِّ مَكْتُومٍ",
                "id": "Telah mengabarkan kepada kami [Ya'la] telah menceritakan kepada kami [Zakariya] dari [Amir] telah menceritakan kepadaku [Fathimah binti Qais] bahwa suaminya telah menceraikannya tiga kali, kemudian Nabi shallallahu 'alaihi wasallam memerintahakannya agar ber'iddah di rumah Ibnu Ummi Maktum."
            },
            {
                "number": 1821,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ الْأَشْعَثِ عَنْ الْحَكَمِ وَحَمَّادٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عُمَرَ قَالَ لَا نَدَعُ كِتَابَ رَبِّنَا وَسُنَّةَ نَبِيِّهِ بِقَوْلِ امْرَأَةٍ الْمُطَلَّقَةُ ثَلَاثًا لَهَا السُّكْنَى وَالنَّفَقَةُ أَخْبَرَنَا طَلْقُ بْنُ غَنَّامٍ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عُمَرَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Al Asy'ats] dari [Al Hakam] serta [Hammad] dari [Ibrahim] dari [Al Aswad] dari [Umar], ia berkata; \"Kami tidak akan meninggalkan Kitab Rabb kami dan Sunnah NabiNya Karena perkataan seorang wanita. Wanita yang dicerai tiga kali, baginya mendapatkan tempat tinggal dan nafkah.\" Telah mengabarkan kepada kami [Thalq bin Ghannam] dari [Hafsh bin Ghiyats] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari [Umar] seperti hadits di atas."
            },
            {
                "number": 1822,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا حَفْصٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ قَالَ قَالَ عُمَرُ لَا نُجِيزُ قَوْلَ امْرَأَةٍ فِي دِينِ اللَّهِ الْمُطَلَّقَةُ ثَلَاثًا لَهَا السُّكْنَى وَالنَّفَقَةُ قَالَ أَبُو مُحَمَّد لَا أَرَى السُّكْنَى وَالنَّفَقَةَ لِلْمُطَلَّقَةِ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Muhammad], ia berkata; telah menceritakan kepada kami [Hafsh] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] Ia berkata; [Umar] berkata; \"Kami tidak memperkenankan perkataan seorang wanita dalam agama Allah. Wanita yang dicerai tiga kali, baginya mendapatkan tempat tinggal dan nafkah.\" Abu Muhammad berkata; \"Aku tidak berpendapat tempat tinggal dan nafkah untuk wanita yang dicerai.\""
            },
            {
                "number": 1823,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ أَنَّ سُلَيْمَانَ بْنَ يَسَارٍ أَخْبَرَهُ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ أَخْبَرَهُ أَنَّهُ اجْتَمَعَ هُوَ وَابْنُ عَبَّاسٍ عِنْدَ أَبِي هُرَيْرَةَ فَذَكَرُوا الرَّجُلَ يُتَوَفَّى عَنْ الْمَرْأَةِ فَتَلِدُ بَعْدَهُ بِلَيَالٍ قَلَائِلَ فَقَالَ ابْنُ عَبَّاسٍ حِلُّهَا آخِرُ الْأَجَلَيْنِ وَقَالَ أَبُو سَلَمَةَ إِذَا وَضَعَتْ فَقَدْ حَلَّتْ فَتَرَاجَعَا فِي ذَلِكَ بَيْنَهُمَا فَقَالَ أَبُو هُرَيْرَةَ أَنَا مَعَ ابْنِ أَخِي يَعْنِي أَبَا سَلَمَةَ فَبَعَثُوا كُرَيْبًا مَوْلَى ابْنِ عَبَّاسٍ إِلَى أُمِّ سَلَمَةَ فَسَأَلَهَا فَذَكَرَتْ أُمُّ سَلَمَةَ أَنَّ سُبَيْعَةَ بِنْتَ الْحَارِثِ الْأَسْلَمِيَّةَ مَاتَ عَنْهَا زَوْجُهَا فَنَفِسَتْ بَعْدَهُ بِلَيَالٍ وَأَنَّ رَجُلًا مِنْ بَنِي عَبْدِ الدَّارِ يُكْنَى أَبَا السَّنَابِلِ خَطَبَهَا وَأَخْبَرَهَا أَنَّهَا قَدْ حَلَّتْ فَأَرَادَتْ أَنْ تَتَزَوَّجَ غَيْرَهُ فَقَالَ لَهَا أَبُو السَّنَابِلِ فَإِنَّكِ لَمْ تَحِلِّينَ فَذَكَرَتْ سُبَيْعَةُ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهَا أَنْ تَتَزَوَّجَ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Yahya bin Sa'id] bahwa [Sulaiman bin Yasar] telah mengabarkan kepadanya, bahwa [Abu Salamah bin Abdurrahman] telah mengabarkan kepadanya, bahwa ia dan [Ibnu Abbas] berkumpul di sisi [Abu Hurairah], kemudian mereka menyebutkan seorang laki-laki mati meninggalkan seorang isteri, beberapa malam setelahnya, isterinya melahirkan. Ibnu Abbas berkata; \"Kehalalannya adalah yang paling akhir diantara dua waktu.\" Sementara Abu Salamah berkata; \"Apabila ia melahirkan, maka ia telah halal.\" Dalam hal, mereka berdua saling mendiskusikan. Abu Hurairah berkata; (Dalam masalah ini) aku sependapat dengan anak saudaraku yaitu Abu Salamah.\" Kemudian mereka mengutus [Kuraib] mantan budak Ibnu Abbas kepada Ummu Salamah, lalu ia bertanya kepadanya. [Ummu Salamah] menyebutkan bahwa Subai'ah binti Al Harits Al Aslamiyah ditinggal mati suaminya. Kemudian ia menjalani nifas beberapa malam setelahnya, lalu seorang laki-laki dari Bani Abdud Dar yang dijuluki Abu As Sanabil meminangnya dan mengabarkan kepadanya bahwa ia telah halal. Ternyata Subai'ah ingin menikah dengan selain Abu As Sanabil, Abu As Sanabil berkata kepadanya; \"Sesungguhnya engkau belum halal.\" Kemudian Subai'ah menceritakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, maka beliau memerintahkannya supaya menikah.\""
            },
            {
                "number": 1824,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ كُرَيْبٍ عَنْ أُمِّ سَلَمَةَ قَالَتْ تُوُفِّيَ زَوْجُ سُبَيْعَةَ بِنْتِ الْحَارِثِ فَوَضَعَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِأَيَّامٍ فَأَمَرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَتَزَوَّجَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Yahya bin Sa'id] dari [Sulaiman bin Yasar] dari [Kuraib] dari [Ummu Salamah], ia berkata; \"Suami Subai'ah binti Al Harits telah meninggal, selang beberapa malam setelah suaminya meninggal, ia melahirkan, maka Rasulullah shallallahu 'alaihi wasallam memerintahkannya supaya menikah.\""
            },
            {
                "number": 1825,
                "arab": " أَخْبَرَنَا بِشْرُ بْنُ عُمَرَ الزَّهْرَانِيُّ حَدَّثَنَا أَبُو الْأَحْوَصِ حَدَّثَنَا مَنْصُورٌ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ أَبِي السَّنَابِلِ قَالَ وَضَعَتْ سُبَيْعَةُ بِنْتُ الْحَارِثِ حَمْلَهَا بَعْدَ وَفَاةِ زَوْجِهَا بِبِضْعٍ وَعِشْرِينَ لَيْلَةً فَلَمَّا تَعَلَّتْ مِنْ نِفَاسِهَا تَشَوَّفَتْ فَعِيبَ ذَلِكَ عَلَيْهَا فَذُكِرَ أَمْرُهَا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنْ تَفْعَلْ فَقَدْ انْقَضَى أَجَلُهَا",
                "id": "Telah mengabarkan kepada kami [Bisyr bin Umar Az Zahrani] telah menceritakan kepada kami [Abu Al Ahwash] telah menceritakan kepada kami [Manshur] dari [Ibrahim] dari [Al Aswad] dari [Abu As Sanabil] ia berkata; \"Subai'ah binti Al Harits telah melahirkan dua puluh tiga malam setelah suaminya meninggal. Tatkala ia telah suci dari nifasnya, ia menghias diri. Ternyata dirinya dicela karena hal itu, ketika perkaranya diberitahukan kepada Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila ia melakukan, maka sungguh telah selesai masa (iddah) nya.\""
            },
            {
                "number": 1826,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ أَنَّ سُبَيْعَةَ وَضَعَتْ بَعْدَ وَفَاةِ زَوْجِهَا بِأَيَّامٍ فَتَشَوَّفَتْ فَعَابَ أَبُو السَّنَابِلِ فَسَأَلَتْ أَوْ ذَكَرَتْ أَمْرَهَا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهَا أَنْ تَتَزَوَّجَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Manshur] dari [Ibrahim] dari [Al Aswad] bahwa Subai'ah telah melahirkan beberapa hari setelah suaminya wafat. Kemudian dirinya berhias, ternyata dirinya dicela oleh Abu As Sanabil. Lantas Suba'iah mengadukan atau menyebutkan perkaranya kepada Rasulullah shallallahu 'alaihi wasallam, ternyata beliau memerintahkannya supaya menikah lagi."
            },
            {
                "number": 1827,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُلَيْمَانُ بْنُ كَثِيرٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَوْ تُؤْمِنُ بِاللَّهِ أَنْ تَحِدَّ عَلَى أَحَدٍ فَوْقَ ثَلَاثَةِ أَيَّامٍ إِلَّا عَلَى زَوْجِهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sulaiman bin Katsir] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan hari Akhir atau beriman kepada Allah, berkabung kepada seseorang di atas tiga hari kecuali terhadap suaminya.\""
            },
            {
                "number": 1828,
                "arab": " أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ حُمَيْدِ بْنِ نَافِعٍ قَالَ سَمِعْتُ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ تُحَدِّثُ عَنْ أُمِّ حَبِيبَةَ بِنْتِ أَبِي سُفْيَانَ أَنَّ أَخًا لَهَا مَاتَ أَوْ حَمِيمًا لَهَا فَعَمَدَتْ إِلَى صُفْرَةٍ فَجَعَلَتْ تَمْسَحُ يَدَيْهَا وَقَالَتْ إِنَّمَا أَفْعَلُ هَذَا لِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ لِامْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ تَحِدَّ فَوْقَ ثَلَاثٍ إِلَّا عَلَى زَوْجِهَا فَإِنَّهَا تَحِدُّ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا أَخْبَرَنَا هَاشِمُ بْنُ الْقَاسِمِ أَخْبَرَنَا شُعْبَةُ عَنْ حُمَيْدِ بْنِ نَافِعٍ قَالَ سَمِعْتُ زَيْنَبَ بِنْتَ أُمِّ سَلَمَةَ تُحَدِّثُ عَنْ أُمِّهَا أَوْ امْرَأَةٍ مِنْ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari [Humaid bin Nafi'], ia berkata; aku mendengar [Zainab binti Abu Salamah] menceritakan dari [Ummu Habibah binti Abu Sufyan] bahwa saudaranya -atau sahabatnya, - kemudian ia mengambil minyak wangi berwarna kuning dan mengusapkan ke kedua tangannya, dia berkata; \"Sesungguhnya aku melakukan hal ini karena Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seorang wanita yang beriman kepada Allah dan hari Akhir untuk berkabung melebihi tiga hari, kecuali terhadap suaminya, maka ia berkabung empat bulan sepuluh hari.\" Telah mengabarkan kepada kami [Syu'bah] dari [Humaid bin Nafi'], ia berkata; aku mendengar [Zainab binti Ummu Salamah] menceritakan dari [ibunya] dari para isteri Nabi shallallahu 'alaihi wasallam seperti itu.\""
            },
            {
                "number": 1829,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا زَائِدَةُ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَحِدُّ الْمَرْأَةُ فَوْقَ ثَلَاثَةِ أَيَّامٍ إِلَّا عَلَى زَوْجٍ فَإِنَّهَا تَحِدُّ عَلَيْهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا لَا تَلْبَسُ ثَوْبًا مَصْبُوغًا إِلَّا ثَوْبَ عَصْبٍ وَلَا تَكْتَحِلُ وَلَا تَمَسُّ طِيبًا إِلَّا فِي أَدْنَى طُهْرِهَا إِذَا اغْتَسَلَتْ مِنْ مَحِيضِهَا نُبْذَةً مِنْ كُسْتٍ وَأَظْفَارٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Zaidah] dari [Hisyam bin Hassan] dari [Hafshah binti Sirin] dari [Ummu 'Athiyah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidak boleh seorang wanita berkabung melebihi tiga hari, kecuali terhadap suaminya, maka ia berkabung selama empat bulan sepuluh hari, dan tidak boleh menggunkan pakaian yang berwarna warni, melainkan hanya memakai pakaian yang kasar (kain beludru), dan tidak boleh menggunakan celak mata, dan tidak boleh memakai wewangian kecuali jika masa iddahnya telah habis, maka diperbolehkan baginya memakai qusth dan adzfar (sejenis pohon yang harum baunya).\""
            },
            {
                "number": 1830,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا مَالِكٌ عَنْ سَعْدِ بْنِ إِسْحَقَ بْنِ كَعْبِ بْنِ عُجْرَةَ عَنْ عَمَّتِهِ زَيْنَبَ بِنْتِ كَعْبِ بْنِ عُجْرَةَ أَنَّ الْفُرَيْعَةَ بِنْتَ مَالِكٍ أَخْبَرَتْهَا أَنَّهَا سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَأْذَنَ لَهَا أَنْ تَرْجِعَ إِلَى أَهْلِهَا فَإِنَّ زَوْجِي قَدْ خَرَجَ فِي طَلَبِ أَعْبُدٍ لَهُ أَبَقُوا فَأَدْرَكَهُمْ حَتَّى إِذَا كَانَ بِطَرَفِ الْقَدُومِ قَتَلُوهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْكُثِي فِي بَيْتِكِ حَتَّى يَبْلُغَ الْكِتَابُ أَجَلَهُ فَقُلْتُ إِنَّهُ لَمْ يَدَعْنِي فِي بَيْتٍ أَمْلِكُهُ وَلَا نَفَقَةٍ فَقَالَ امْكُثِي حَتَّى يَبْلُغَ الْكِتَابُ أَجَلَهُ فَاعْتَدَّتْ فِيهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا قَالَتْ فَلَمَّا كَانَ عُثْمَانُ أَرْسَلَ إِلَيَّ فَسَأَلَنِي عَنْ ذَلِكَ فَأَخْبَرْتُهُ فَاتَّبَعَ ذَلِكَ وَقَضَى بِهِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Malik] dari [Sa'd bin Ishaq bin Ka'b bin 'Ujrah] dari bibinya [Zainab binti Ka'an bin Ujrah] bahwa [Al Furai'ah binti Malik], ia telah mengabarkan kepadanya, bahwa ia pernah meminta kepada Rasulullah shallallahu 'alaihi wasallam agar memberinya izin untuk kembali kepada keluarganya. Ia berkata; \"Sesungguhnya suamiku keluar untuk mencari budak-budaknya yang kabur, kemudian ia mendapatkan mereka hingga setelah berada di Tharaf Al Qadum, budak-budaknya membunuhnya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tinggallah di rumahmu hingga 'iddahmu habis sampai batas waktunya.\" Aku berkata; \"Sesungguhnya suamiku tidak meninggalkanku di rumah yang aku miliki, tidak pula ada nafkah.\" Beliau bersabda: \"Tinggallah hingga 'iddah sampai batas waktunya.\" Kemudian ia menjalani 'iddah selama empat bulan sepuluh hari. Furai'ah berkata; Tatkala Utsman mengirim surat kepadaku dan bertanya mengenai hal itu, maka aku mengabarkan kepadanya, setelah itu Utsman mengikuti dan memberikan keputusan dengannya.\""
            },
            {
                "number": 1831,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ طُلِّقَتْ خَالَتِي فَأَرَادَتْ أَنْ تَجُدَّ نَخْلًا لَهَا فَقَالَ لَهَا رَجُلٌ لَيْسَ لَكِ أَنْ تَخْرُجِي قَالَتْ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ اخْرُجِي فَجُدِّي نَخْلَكِ فَلَعَلَّكِ أَنْ تَصَدَّقِي أَوْ تَصْنَعِي مَعْرُوفًا",
                "id": "Telah mengabarkan kepada kami ['Ashim] dari [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir], ia berkata; bibiku telah dicerai dan ia hendak menebang pohon kurma miliknya, lantas seseorang berkata; \"Engkau tidak boleh keluar.\" Bibiku berkata; kemudian aku mendatangi Nabi shallallahu 'alaihi wasallam dan menceritakan hal itu kepada beliau. Beliau bersabda: \"Keluarlah dan potonglah pohon kurmamu, kemungkinan engkau akan bersedekah atau melakukan sesuatu yang terpuji.\""
            },
            {
                "number": 1832,
                "arab": " أَخْبَرَنَا سَهْلُ بْنُ حَمَّادٍ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ أَنَّهَا أَرَادَتْ أَنْ تَشْتَرِيَ بَرِيرَةَ فَأَرَادَ مَوَالِيهَا أَنْ يَشْتَرِطُوا وَلَاءَهَا فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اشْتَرِيهَا فَإِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَ فَاشْتَرَتْهَا فَأَعْتَقَتْهَا وَخَيَّرَهَا مِنْ زَوْجِهَا وَكَانَ حُرًّا وَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِلَحْمٍ فَقَالَ مِنْ أَيْنَ هَذَا قِيلَ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ فَقَالَ هُوَ لَهَا صَدَقَةٌ وَلَنَا هَدِيَّةٌ",
                "id": "Telah mengabarkan kepada kami [Sahl bin Hammad] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah] bahwa ia ingin membeli Barirah, ternyata tuannya memberikan syarat perwaliannya harus milik mereka. 'Aisyah pun mengadukan hal itu kepada Rasulullah shallallahu 'alaihi wasallam. Beliau lalu bersabda: \"Belilah dia, sesungguhnya perwalian adalah milik orang yang memerdekakan.\" Kemudian 'Aisyah membelinya dan membebaskannya. Dan beliau juga pernah memberikan pilihan kepadanya atas suaminya yang juga orang merdeka. Dan Nabi shallallahu 'alaihi wasallam pernah diberi daging, kemudian beliau bertanya: \"Dari mana daging ini?\" Dijawab; \"ini adalah daging yang disedekahkan kepada Barirah.\" Lalu beliau bersabda: \"Baginya adalah sedekah dan bagi kami adalah hadiah.\""
            },
            {
                "number": 1833,
                "arab": " أَخْبَرَنَا إِسْمَعِيلُ بْنُ خَلِيلٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ دَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيَّ فَقَرَّبْتُ إِلَيْهِ طَعَامًا لَيْسَ فِيهِ لَحْمٌ فَقَالَ أَلَمْ أَرَ لَكُمْ قِدْرًا مَنْصُوبَةً قُلْتُ يَا رَسُولَ اللَّهِ هَذَا لَحْمٌ تُصُدِّقَ بِهِ عَلَى بَرِيرَةَ فَأَهْدَتْ لَنَا قَالَ هُوَ عَلَيْهَا صَدَقَةٌ وَهُوَ لَنَا مِنْهَا هَدِيَّةٌ وَكَانَ لَهَا زَوْجٌ فَلَمَّا عُتِقَتْ خُيِّرَتْ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Khalil] telah menceritakan kepada kami [Ali bin Mushir] telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [Abdurrahman bin Al Qasim] dari [Ayahnya] dari ['Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam menemuiku, lalu aku dekatkan makanan yang tidak ada dagingnya, lalu beliau bersabda: \"Bukankah tadi aku melihat kalian memasak (daging) di kuwali?\" Maka saya katakan; \"Wahai Rasulullah, ini adalah daging yang disedekahkan kepada Barirah, dan ia hadiahkan kepada kita.\" Beliau bersabda: \"Daging itu adalah sedekah baginya dan menjadi hadiah bagi kita.\" Dan Barirah dahulunya memiliki suami, kemudian setelah ia di bebaskan, maka ia diberikan pilihan (antara meneruskan atau berpisah).\""
            },
            {
                "number": 1834,
                "arab": " أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ الضَّحَّاكِ عَنْ الْمُغِيرَةِ بْنِ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيِّ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ بَرِيرَةَ حِينَ أَعْتَقَتْهَا عَائِشَةُ كَانَ زَوْجُهَا عَبْدًا فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحُضُّهَا عَلَيْهِ فَجَعَلَتْ تَقُولُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَيْسَ لِي أَنْ أُفَارِقَهُ قَالَ بَلَى قَالَتْ فَقَدْ فَارَقْتُهُ",
                "id": "Telah mengabarkan kepada kami [Abdurrahman bin Adh Dhahhak] dari [Al Mughirah bin Abdurrahman Al Makhzumi] dari [Hisyam bin 'Urwah] dari [Abdurrahman bin Al Qasim] dari [Ayahnya] dari ['Aisyah] bahwa ketika Barirah dibebaskan oleh 'Aisyah, sementara suaminya masih berstatuskan budak, kemudian Rasulullah shallallahu 'alaihi wasallam menganjurkannya agar berbuat baik terhadapnya, maka Barirah berkata kepada Rasulullah shallallahu 'alaihi wasallam; \"Bukankah aku boleh berpisah dengannya?\" Beliau menjawab: \"Benar.\" Ia berkata; \"Sungguh aku telah berpisah darinya.\""
            },
            {
                "number": 1835,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ عَنْ خَالِدٍ يَعْنِي الْحَذَّاءَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ زَوْجَ بَرِيرَةَ كَانَ عَبْدًا يُقَالُ لَهُ مُغِيثٌ كَأَنِّي أَنْظُرُ إِلَيْهِ يَطُوفُ خَلْفَهَا يَبْكِي وَدُمُوعُهُ تَسِيلُ عَلَى لِحْيَتِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْعَبَّاسِ يَا عَبَّاسُ أَلَا تَعْجَبُ مِنْ شِدَّةِ حُبِّ مُغِيثٍ بَرِيرَةَ وَمِنْ شِدَّةِ بُغْضِ بَرِيرَةَ مُغِيثًا فَقَالَ لَهَا لَوْ رَاجَعْتِيهِ فَإِنَّهُ أَبُو وَلَدِكِ فَقَالَتْ يَا رَسُولَ اللَّهِ أَتَأْمُرُنِي قَالَ إِنَّمَا أَنَا شَافِعٌ قَالَتْ لَا حَاجَةَ لِي فِيهِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] telah mengabarkan kepada kami [Khalid bin Abdullah] dari [Khalid yaitu Al Hadzdza`] dari [Ikrimah] dari [Ibnu Abbas] bahwa suami Barirah adalah seorang budak yang bernama Mughits, sepertinya aku melihat dia mengikuti di belakang Barirah dalam keadaan menangis dan air matanya mengalir hingga membasahi jenggotnya. Kemudian Nabi shallallahu 'alaihi wasallam bersabda kepada Al Abbas: \"Wahai Abbas, tidakkah engkau kagum dengan besarnya kecintaan Mughits kepada Barirah dan besarnya kebencian Barirah kepada Mughits?\" Kemudian beliau bersabda kepada Barirah: \"Seandainya engkau kembali kepadanya, sesungguhnya ia adalah ayah dari anakmu.\" Lalu Barirah berkata; \"Wahai Rasulullah, apakah anda memerintahkanku?\" Beliau menjawab: \"Sesungguhnya aku sebagai perantara.\" Ia berkata; \"Aku tidak butuh kepadanya.\""
            },
            {
                "number": 1836,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي زِيَادُ بْنُ سَعْدٍ عَنْ هِلَالِ بْنِ أُسَامَةَ عَنْ أَبِي مَيْمُونَةَ سُلَيْمَانَ مَوْلًى لِأَهْلِ الْمَدِينَةِ قَالَ كُنْتُ عِنْدَ أَبِي هُرَيْرَةَ فَجَاءَتْهُ امْرَأَةٌ فَقَالَتْ إِنَّ زَوْجِي يُرِيدُ أَنْ يَذْهَبَ بِوَلَدِي فَقَالَ أَبُو هُرَيْرَةَ كُنْتُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَتْهُ امْرَأَةٌ فَقَالَتْ إِنَّ زَوْجِي يُرِيدُ أَنْ يَذْهَبَ بِوَلَدِي أَوْ بِابْنِي وَقَدْ نَفَعَنِي وَسَقَانِي مِنْ بِئْرِ أَبِي عِنَبَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَهِمَا أَوْ قَالَ تَسَاهَمَا أَبُو عَاصِمٍ الشَّاكُّ فَجَاءَ زَوْجُهَا فَقَالَ مَنْ يُخَاصِمُنِي فِي وَلَدِي أَوْ فِي ابْنِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا غُلَامُ هَذَا أَبُوكَ وَهَذِهِ أُمُّكَ فَخُذْ بِيَدِ أَيِّهِمَا شِئْتَ وَقَدْ قَالَ أَبُو عَاصِمٍ فَاتْبَعْ أَيَّهُمَا شِئْتَ فَأَخَذَ بِيَدِ أُمِّهِ فَانْطَلَقَتْ بِهِ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] telah menceritakan kepada kami [Ibnu Juraij], ia berkata; telah mengabarkan kepadaku [Ziyad bin Sa'd] dari [Hilal bin Usamah] dari [Abu Maimunah Sulaiman] mantan budak penduduk Madinah, ia berkata; aku pernah berada di rumah Abu Hurairah, kemudian seorang wanita datang kepadanya dan berkata; \"Sesungguhnya suamiku ingin pergi membawa anakku.\" [Abu Hurairah] lalu berkata; \"Aku pernah bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba seorang wanita datang kepada beliau sambil berkata; \"Sesungguhnya suamiku ingin pergi membawa anakku -atau putraku- sementara anakku telah memberi manfaat kepadaku dan selalu mengambilkan air dari sumur Abu 'Inabah.\" Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Hendaknya kalian berdua mengadakan undian.\" -Atau beliau mengatakan: \"Hendaknya kalian saling mengundi.\" Abu 'Ashim ragu mengenai redaksi haditsnya- Kemudian suaminya datang dan berkata; \"Siapakah yang akan melawanku terhadap anakku?\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai anak kecil, ini adalah ayahmu dan ini adalah ibumu, peganglah tangan salah seorang diantara mereka berdua yang engkau kehendaki! \" Anak tersebut akhirnya memegang tangan ibunya, lalu wanita itu pergi dengan anaknya.\""
            },
            {
                "number": 1837,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي مُظَاهِرٌ وَهُوَ ابْنُ أَسْلَمَ أَنَّهُ سَمِعَ الْقَاسِمَ بْنَ مُحَمَّدٍ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْأَمَةِ تَطْلِيقَتَانِ وَقُرْؤُهَا حَيْضَتَانِ قَالَ أَبُو عَاصِمٍ سَمِعْتُهُ مِنْ مُظَاهِرٍ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Muzhahir yaitu Ibnu Aslam] bahwa ia mendengar [Al Qasim bin Muhammad] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Seorang budak memiliki dua kali cerai, dan quru`nya (masa iddahnya) adalah dua kali haid.\" [Abu 'Ashim] berkata; aku mendengarnya dari [Muzhahir]."
            },
            {
                "number": 1838,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا شَرِيكٌ عَنْ قَيْسِ بْنِ وَهْبٍ عَنْ أَبِي الْوَدَّاكِ عَنْ أَبِي سَعِيدٍ وَرَفَعَهُ أَنَّهُ قَالَ فِي سَبَايَا أَوْطَاسٍ لَا تُوطَأُ حَامِلٌ حَتَّى تَضَعَ حَمْلَهَا وَلَا غَيْرُ ذَاتِ حَمْلٍ حَتَّى تَحِيضَ حَيْضَةً",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] telah mengabarkan kepada kami [Syarik] dari [Qais bin Wahb] dari [Abu Al Waddak] dari [Abu Sa'id] -dia telah merafa'kannya- dia berkata mengenai para tawanan wanita Authas; \"Wanita hamil tidak boleh digauli hingga ia melahirkan kandungannya, sedangkan yang tidak hamil, hingga ia mengalami haid satu kali.\""
            },
            {
                "number": 1839,
                "arab": " أَخْبَرَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا حَمَّادٌ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُفِعَ الْقَلَمُ عَنْ ثَلَاثَةٍ عَنْ النَّائِمِ حَتَّى يَسْتَيْقِظَ وَعَنْ الصَّغِيرِ حَتَّى يَحْتَلِمَ وَعَنْ الْمَجْنُونِ حَتَّى يَعْقِلَ وَقَدْ قَالَ حَمَّادٌ أَيْضًا وَعَنْ الْمَعْتُوهِ حَتَّى يَعْقِلَ",
                "id": "Telah mengabarkan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] telah menceritakan kepada kami [Hammad] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Pena diangkat dari tiga orang, yaitu; orang yang tidur hingga terbangun, orang yang masih kecil hingga ia dapat bermimpi (baligh), dan dari orang yang gila hingga berakal.\" Hammad berkata; \"Juga dari orang yang kurang akal hingga ia berakal.\""
            },
            {
                "number": 1840,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ عَنْ عُثْمَانَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِإِحْدَى ثَلَاثٍ بِكُفْرٍ بَعْدَ إِيمَانٍ أَوْ بِزِنًى بَعْدَ إِحْصَانٍ أَوْ يَقْتُلُ نَفْسًا بِغَيْرِ نَفْسٍ فَيُقْتَلُ",
                "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin Sa'id] dari [Abu Umamah bin Sahl bin Hani] dari [Utsman], ia berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal darah seorang muslim kecuali dengan tiga perkara, yaitu; kafir setelah beriman (murtad), berzina setelah menikah, atau membunuh jiwa bukan karena hak, sehingga ia dibunuh.\""
            },
            {
                "number": 1841,
                "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا الْأَعْمَشُ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ دَمُ رَجُلٍ يَشْهَدُ أَنَّ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ إِلَّا أَحَدَ ثَلَاثَةِ نَفَرٍ النَّفْسُ بِالنَّفْسِ وَالثَّيِّبُ الزَّانِي وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ",
                "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Al A'masy] dari [Abdullah bin Murrah] dari [Masruq] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal darah seorang wanita yang bersaksi bahwa tidak ada Ilah yang berhak disembah melainkan Allah dan aku adalah Rasulullah, kecuali salah satu dari tiga orang ini, yaitu; jiwa dibalas dengan jiwa (qishahs), janda yang berzina, orang yang meninggalkan agamanya dan memisahkan diri dari jama'ah kaum muslimin.\""
            },
            {
                "number": 1842,
                "arab": " أَخْبَرَنَا سَعْدُ بْنُ حَفْصٍ حَدَّثَنَا شَيْبَانُ عَنْ أَشْعَثَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ صَفْوَانُ بْنُ أُمَيَّةَ نَائِمًا فِي الْمَسْجِدِ فَأَتَاهُ رَجُلٌ وَهُوَ نَائِمٌ فَاسْتَلَّ رِدَاءَهُ مِنْ تَحْتِ رَأْسِهِ فَنَبِهَ بِهِ فَلَحِقَهُ فَأَخَذَهُ فَانْطَلَقَ بِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ كُنْتُ نَائِمًا فِي الْمَسْجِدِ فَأَتَانِي هَذَا فَاسْتَلَّ رِدَائِي مِنْ تَحْتِ رَأْسِي فَلَحِقْتُهُ فَأَخَذْتُهُ فَأَمَرَ بِقَطْعِهِ فَقَالَ لَهُ صَفْوَانُ يَا رَسُولَ اللَّهِ إِنَّ رِدَائِي لَمْ يَبْلُغْ أَنْ يُقْطَعَ فِيهِ هَذَا قَالَ فَهَلَّا قَبْلَ أَنْ تَأْتِيَنِي بِهِ",
                "id": "Telah mengabarkan kepada kami [Sa'd bin Hafsh] telah menceritakan kepada kami [Syaiban] dari [Asy'ats] dari [Ikrimah] dari [Ibnu Abbas], ia berkata; Shafwan bin Umayyah pernah tidur di masjid, kemudian seorang laki-laki datang kepadanya sementara ia masih tidur, aki-laki itu lalu mengambil selendangnya dari bawah kepalanya. Katika terjaga, dia langsung mengejar laki-laki itu dan berhasil menangkapnya, setelah itu dia membawanya menghadap kepada Rasulullah shallallahu 'alaihi wasallam seraya berkata; \"Wahai Rasulullah, tadi aku tidur di masjid, kemudian orang ini mendatangiku dan mengambil selendangku dari bawah kepalaku. Lalu aku mengejarnya dan berhasil menangkapnya.\" Kemudian beliau memerintahkan agar tangan laki-laki itu dipotong. Ternyata Shafwan berkata; \"Wahai Rasulullah, sesungguhnya tidak sampai harus dipotong tangannya karena selendangku.\" Beliau bersabda: \"Seandainya kamu mengatakannya sebelum kamu membawanya kepadaku.\""
            },
            {
                "number": 1843,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْهَاشِمِيُّ أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ الزُّهْرِيِّ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُقْطَعُ الْيَدُ فِي رُبْعِ دِينَارٍ فَصَاعِدًا",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Daud Al Hasyimi] telah mengabarkan kepada kami [Ibrahim bin Sa'd] dari [Az Zuhri] dari ['Amrah binti Abdurrahman] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tangan dipotong karena mengambil sesuatu yang nilainya seperempat dinar atau lebih.\""
            },
            {
                "number": 1844,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ وَإِسْمَعِيلَ بْنِ أُمَيَّةَ وَعُبَيْدِ اللَّهِ وَمُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَطَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مِجَنٍّ قِيمَتُهُ ثَلَاثَةُ دَرَاهِمَ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Ayyub] dan [Isma'il bin Umayyah] dan ['ubaidhullah] serta [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam memotong tangan pencuri tameng yang nilainya sebesar tiga dirham.\""
            },
            {
                "number": 1845,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ أَنَّ قُرَيْشًا أَهَمَّهُمْ شَأْنُ الْمَرْأَةِ الْمَخْزُومِيَّةِ الَّتِي سَرَقَتْ فَقَالُوا مَنْ يُكَلِّمُ فِيهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا وَمَنْ يَجْتَرِئُ عَلَيْهِ إِلَّا أُسَامَةُ بْنُ زَيْدٍ حِبُّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَلَّمَهُ أُسَامَةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَشْفَعُ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ ثُمَّ قَامَ فَاخْتَطَبَ فَقَالَ إِنَّمَا هَلَكَ الَّذِينَ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمْ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ فِيهِمْ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ وَايْمُ اللَّهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Urwah bin Az Zubair] dari ['Aisyah] bahwa orang-orang Quraisy disibukkan oleh perkara wanita Makhzum yang mencuri, kemudian mereka berkata; \"Siapakah yang akan menjadi jubir kepada Rasulullah shallallahu 'alaihi wasallam mengenai wanita tersebut?\" Orang-orang yang lain mengatakan; \"Sepertinya tidak ada yang berani kecuali Usamah bin Zaid, orang yang dicintai Rasulullah shallallahu 'alaihi wasallam.\" Kemudian Usamah berbicara kepada beliau. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah engkau akan memberikan pertolongan dalam perkara had diantara had-had Allah?\" kemudian beliau berdiri dan berkhutbah, beliau bersabda: 'Sesungguhnya orang-orang sebelum kalian binasa, bahwa jika terdapat orang mulia diantara mereka mencuri, maka mereka membiarkannya dan jika terdapat orang yang lemah diantara mereka mencuri, maka mereka menegakkan hukuman atasnya. Demi Allah apabila Fathimah binti Muhammad mencuri, niscaya aku akan potong tangannya.\""
            },
            {
                "number": 1846,
                "arab": " أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَبِي الْمُنْذِرِ مَوْلَى أَبِي ذَرٍّ عَنْ أَبِي أُمَيَّةَ الْمَخْزُومِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِسَارِقٍ اعْتَرَفَ اعْتِرَافًا لَمْ يُوجَدْ مَعَهُ مَتَاعٌ فَقَالَ مَا إِخَالُكَ سَرَقْتَ قَالَ بَلَى قَالَ مَا إِخَالُكَ سَرَقْتَ قَالَ بَلَى قَالَ فَاذْهَبُوا فَاقْطَعُوا يَدَهُ ثُمَّ جِيئُوا بِهِ فَقَطَعُوا يَدَهُ ثُمَّ جَاءُوا بِهِ فَقَالَ اسْتَغْفِرْ اللَّهَ وَتُبْ إِلَيْهِ فَقَالَ أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فَقَالَ اللَّهُمَّ تُبْ عَلَيْهِ اللَّهُمَّ تُبْ عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Abu Al Mundzir] mantan budak Abu Dzar dari [Abu Umayyah Al Makhzumi] bahwa seorang pencuri yang mengaku telah mencuri dihadapakan kepada Rasulullah shallallahu 'alaihi wasallam, namun tidak didapatkan barang padanya. Kemudian beliau bersabda: \"Aku tidak menyangka engkau mencuri.\" Ia berkata; \"Benar.\" Beliau bersabda: \"Aku tidak menyangka engkau mencuri.\" Ia berkata; \"Benar.\" Beliau bersabda (kepada para sahabatnya): \"Pergilah kalian dan potonglah tangannya, setelah itu bawalah dia kemari.\" Kemudian mereka memotongnya setelah itu mereka membawanya (menghadap beliau), lalu beliau bersabda kepadanya: \"Mohonlah ampunan kepada Allah dan bertaubatlah kepadaNya.\" Orang itu pun mengatakan; \"Aku mohon ampun kepada Allah dan bertaubat kepadaNya.\" Beliau bersabda: \"Ya Allah, terimalah taubatnya, ya Allah, terimalah taubatnya.\""
            },
            {
                "number": 1847,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَحْيَى هُوَ ابْنُ سَعِيدٍ أَنَّ مُحَمَّدَ بْنَ يَحْيَى بْنِ حَبَّانَ أَخْبَرَهُ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Yahya yaitu Ibnu Sa'id] bahwa [Muhammad bin Yahya bin Habban] telah mengabarkan kepadanya dari [Rafi' bin Khadij] ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada had potong tangan karena mengambil buah dan mayang (kurma).\""
            },
            {
                "number": 1848,
                "arab": " حَدَّثَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ رَجُلٍ مِنْ قَوْمِهِ عَنْ رَافِعِ بْنِ خَدِيجٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ",
                "id": "Telah menceritakan kepada kami [Al Husain bin Manshur] telah menceritakan kepada kami [Abu Usamah] dari [Yahya bin Sa'id] dari [Muhammad bin Yahnya bin Hibban] dari [seorang laki-laki] dari kaumnya dari [Rafi' bin Khadij] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidak ada had potong tangan karena mengambil buah dan mayang (kurma).\""
            },
            {
                "number": 1849,
                "arab": " أَخْبَرَنَا إِسْحَقُ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ عَمِّهِ وَاسِعِ بْنِ حَبَّانَ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ رَافِعِ بْنِ خَدِيجٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari pamannya yaitu [Wasi' bin Habban] dari [Rafi' bin Khadij], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada had potong tangan karena mengambil buah dan mayang (kurma).\" Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari [Rafi' bin Khadij] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas."
            },
            {
                "number": 1850,
                "arab": " أَخْبَرَنَا إِسْحَقُ حَدَّثَنَا جَرِيرٌ وَالثَّقَفِيُّ عَنْ يَحْيَى بْنِ سَعِيدٍ أَخْبَرَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ حَبَّانَ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ قَالَ وَهُوَ شَحْمُ النَّخْلِ وَالْكَثَرُ الْجُمَّارُ",
                "id": "Telah mengabarkan kepada kami [Ishaq] telah menceritakan kepadaku [Jarir] serta [Ats Tsaqafi] dari [Yahya bin Sa'id] telah mengabarkan kepadaku [Muhammad bin Yahya bin Habban] dari [Rafi' bin Khadij], ia berkata; Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada had potong tangan karena mengambil buah dan mayang (kurma).\" Rafi' berkata; \"Yaitu kurma yang paling lunak, sedangkan katsar adalah mayang (kurma).\""
            },
            {
                "number": 1851,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ أَبِي مَيْمُونٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا قَطْعَ فِي كَثَرٍ قَالَ أَبُو مُحَمَّد الْقَوْلُ مَا قَالَ أَبُو أُسَامَةَ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin Manshur] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari [Abu Maimun] dari [Rafi' bin Khadij] ia berkata; aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada had potong tangan karena mengambil mayang (kurma).\" Abu Muhammad berkata; \"Perkataan yang benar adalah yang dikatakan oleh Abu Usamah.\""
            },
            {
                "number": 1852,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ قَالَ قَالَ أَبُو الزُّبَيْرِ قَالَ جَابِرٌ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ عَلَى الْمُنْتَهِبِ وَلَا عَلَى الْمُخْتَلِسِ وَلَا عَلَى الْخَائِنِ قَطْعٌ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] ia berkata; [Abu Az Zubair] berkata; [Jabir] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang merampas dan yang menggelapkan harta serta orang yang berkhianat tidak dipotong tangannya.\""
            },
            {
                "number": 1853,
                "arab": " حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِرَجُلٍ قَدْ شَرِبَ خَمْرًا فَضَرَبَهُ بِجَرِيدَتَيْنِ ثُمَّ فَعَلَ أَبُو بَكْرٍ مِثْلَ ذَلِكَ فَلَمَّا كَانَ عُمَرُ اسْتَشَارَ النَّاسَ فَقَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَخَفُّ الْحُدُودِ ثَمَانِينَ قَالَ فَفَعَلَ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Anas] bahwa seorang laki-laki yang meminum khamer dihadapkan kepada Nabi shallallahu 'alaihi wasallam, kemudian beliau mencambuknya dengan dua pelepah kurma, Abu Bakr juga melakukan seperti itu. Setelah Umar berkuasa, maka ia meminta pendapat orang-orang, kemudian Abdurrahman bin 'Auf berkata; \"Had (hukuman) yang paling ringan adalah delapan puluh kali cambukan.\" Anas berkata; \"Kemudian Umar melakukannya hal itu.\""
            },
            {
                "number": 1854,
                "arab": " حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ حَدَّثَنَا عَبْدُ اللَّهِ الدَّانَاجُ حَدَّثَنَا حُضَيْنُ بْنُ الْمُنْذِرِ الرَّقَاشِيُّ قَالَ شَهِدْتُ عُثْمَانَ بْنَ عَفَّانَ وَأُتِيَ بِالْوَلِيدِ بْنِ عُقْبَةَ فَقَالَ عَلِيٌّ جَلَدَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعِينَ وَجَلَدَ أَبُو بَكْرٍ أَرْبَعِينَ وَعُمَرُ ثَمَانِينَ وَكُلٌّ سُنَّةٌ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah mengabarkan kepada kami [Abdul Aziz bin Al Mukhtar] telah menceritakan kepada kami [Abdullah Ad Danaj] telah menceritakan kepada kami [Hudhain bin Al Mundzir Ar Raqasyi], ia berkata; aku menyaksikan Utsman bin 'Affan dan dihadapkan kepadanya Al Walid bin 'Uqbah, kemudian [Ali] berkata; \"Nabi shallallahu 'alaihi wasallam pernah mencambuknya empat puluh kali dan Abu Bakr juga empat puluh kali sementara Umar delapan puluh kali, dan semuanya adalah sunnah.\""
            },
            {
                "number": 1855,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ حَدَّثَنَا يَزِيدُ هُوَ ابْنُ زُرَيْعٍ حَدَّثَنَا مُحَمَّدٌ هُوَ ابْنُ إِسْحَقَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُتْبَةَ بْنِ عُرْوَةَ بْنِ مَسْعُودٍ الثَّقَفِيُّ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا شَرِبَ أَحَدُكُمْ فَاضْرِبُوهُ ثُمَّ إِنْ عَادَ فَاضْرِبُوهُ ثُمَّ إِنْ عَادَ فَاضْرِبُوهُ ثُمَّ إِنْ عَادَ الرَّابِعَةَ فَاقْتُلُوهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah Ar Raqasyi] telah menceritakan kepada kami [Yazid yaitu Ibnu Zurai'] telah menceritakan kepada kami [Muhammad yaitu Ibnu Ishaq] telah menceritakan kepada kami [Abdullah bin 'Utbah bin 'Urwah bin Mas'ud Ats Tsaqafi] dari ['Amr bin Asy Syarid] dari [Ayahnya] ia berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian minum khamer, maka cambuklah dia, apabila ia mengulangi, maka cambuklah dia, apabila ia masih mengulangi, maka cambuklah dia, dan apabila ia tetap mengulangi yang keempat kalinya, maka bunuhlah dia.\""
            },
            {
                "number": 1856,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا سَعِيدٌ هُوَ ابْنُ أَبِي أَيُّوبَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَبْدِ الرَّحْمَنِ هُوَ ابْنُ جَابِرٍ عَنْ أَبِي بُرْدَةَ بْنِ نِيَارٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحِلُّ لِأَحَدٍ أَنْ يَضْرِبَ أَحَدًا فَوْقَ عَشَرَةِ أَسْوَاطٍ إِلَّا فِي حَدٍّ مِنْ حُدُودِ اللَّهِ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami [Sa'id bin Abu Ayyub] telah menceritakan kepadaku [Yazid bin Abu Habib] dari [Bukair bin Abdullah bin Al Asyaj] dari [Sulaiman bin Yasar] dari [Abdurrahman yaitu Ibnu Jabir] dari [Abu Burdah bin Niyar], ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal bagi seseorang untuk mencambuk orang lain lebih dari sepuluh kali, kecuali dalam hukuman diantara hukuman-hukuman (yang ditetapkan) Allah.\""
            },
            {
                "number": 1857,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ أَنَّ رَجُلًا مِنْ أَسْلَمَ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَدَّثَهُ أَنَّهُ زَنَى فَشَهِدَ عَلَى نَفْسِهِ أَنَّهُ زَنَى أَرْبَعًا فَأَمَرَ بِرَجْمِهِ وَكَانَ قَدْ أُحْصِنَ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] telah menceritakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Ibnu Syihab] dari [Abu Salamah] dari [Jabir] bahwa seorang laki-laki dari Aslam datang kepada Nabi shallallahu 'alaihi wasallam, dia lalu menceritakan kepadanya bahwa dia telah berzina. Kemudian ia bersumpah atas dirinya sebanyak empat kali bahwa dirinya telah berzina. Kemudian beliau memerintahkan agar laki-laki itu dirajam, sementara laki-laki itu adalah orang yang telah menikah.\""
            },
            {
                "number": 1858,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ سِمَاكٍ أَنَّهُ سَمِعَ جَابِرَ بْنَ سَمُرَةَ يَقُولُ أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَاعِزِ بْنِ مَالِكٍ رَجُلٍ قَصِيرٍ فِي إِزَارٍ مَا عَلَيْهِ رِدَاءٌ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَّكِئٌ عَلَى وِسَادَةٍ عَلَى يَسَارِهِ فَكَلَّمَهُ فَمَا أَدْرِي مَا يُكَلِّمُهُ بِهِ وَأَنَا بَعِيدٌ مِنْهُ بَيْنِي وَبَيْنَهُ الْقَوْمُ ثُمَّ قَالَ اذْهَبُوا بِهِ فَارْجُمُوهُ ثُمَّ قَالَ رُدُّوهُ فَكَلَّمَهُ أَيْضًا وَأَنَا أَسْمَعُ غَيْرَ أَنَّ بَيْنِي وَبَيْنَهُ الْقَوْمَ فَقَالَ اذْهَبُوا بِهِ فَارْجُمُوهُ ثُمَّ قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَطَبَ وَأَنَا أَسْمَعُهُ ثُمَّ قَالَ كُلَّمَا نَفَرْنَا فِي سَبِيلِ اللَّهِ خَلَفَ أَحَدُهُمْ لَهُ نَبِيبٌ كَنَبِيبِ التَّيْسِ يَمْنَحُ إِحْدَاهُنَّ الْكُثْبَةَ مِنْ اللَّبَنِ وَاللَّهِ لَا أَقْدِرُ عَلَى أَحَدٍ مِنْهُمْ إِلَّا نَكَّلْتُ بِهِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Musa] dari [Isra`il] dari [Simak] bahwa ia mendengar [Jabir bin Samurah] berkata; Ma'iz bin Malik seorang yang memiliki kain sarung yang pendek dan tidak memakai selendang dihadapkan kepada Nabi shallallahu 'alaihi wasallam, sementara Rasulullah shallallahu 'alaihi wasallam bersandar pada bantal di sisi kirinya. Kemudian beliau berbicara kepadanya, aku tidak tahu apa yang beliau bicarakan, sementara aku jauh darinya, sebab antara diriku dan dirinya terdapat beberapa orang. Kemudian beliau bersabda: \"Bawalah dia pergi dan rajamlah dia! \" Kemudian beliau bersabda: \"Suruhlah dia kembali! \" Kemudian beliau berbicara kepadanya dan aku sempat mendengar, hanya saja antara diriku dan dirinya terdapat beberapa orang, kemudian beliau bersabda: \"Bawalah dia pergi dan rajamlah dia! \" Kemudian Nabi shallallahu 'alaihi wasallam berdiri dan berkhutbah, sementara aku mendengarnya, beliau bersabda: \"Setiap kali kita hendak pergi di jalan Allah, masih saja salah seorang dari mereka tidak ikut serta, lalu dia memberikan sesuatu (kepada istrinya -pent) seperti suara kambing pejantan yang sedang terbakar nafsu birahi, Demi Allah, sekiranya saya di berikan kemungkinan, niscaya saya akan memberikan hukuman kepadanya sebagai suatu pelajaran.\""
            },
            {
                "number": 1859,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ وَشِبْلٍ قَالُوا جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَنْشُدُكَ اللَّهَ إِلَّا قَضَيْتَ بَيْنَنَا بِكِتَابِ اللَّهِ فَقَالَ خَصْمُهُ وَكَانَ أَفْقَهَ مِنْهُ صَدَقَ اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ وَأْذَنْ لِي يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْ فَقَالَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى أَهْلِ هَذَا فَزَنَى بِامْرَأَتِهِ فَافْتَدَيْتُ مِنْهُ بِمِائَةِ شَاةٍ وَخَادِمٍ وَإِنِّي سَأَلْتُ رِجَالًا مِنْ أَهْلِ الْعِلْمِ فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي جَلْدَ مِائَةٍ وَتَغْرِيبَ عَامٍ وَأَنَّ عَلَى امْرَأَةِ هَذَا الرَّجْمَ فَقَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ الْمِائَةُ شَاةٍ وَالْخَادِمُ رَدٌّ عَلَيْكَ وَعَلَى ابْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ وَيَا أُنَيْسُ اغْدُ عَلَى امْرَأَةِ هَذَا فَسَلْهَا فَإِنْ اعْتَرَفَتْ فَارْجُمْهَا فَاعْتَرَفَتْ فَرَجَمَهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah bin 'Utbah] dari [Abu Hurairah] serta [Zaid bin Khalid] dan [Syibl] mereka berkata; \"Seorang laki-laki datang kepada Rasulullah shallallahu 'alaihi wasallam seraya berkata; \"Aku bersumpah kepadamu atas nama Allah, putuskanlah perkara diantara kami dengan Kitabullah.\" Kemudian lawannya yang lebih faham daripada dirinya berkata; \"Ia benar, berilah keputusan diantara kami dengan Kitabullah, dan izinkan kami berbicara wahai Rasulullah! \" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Katakanlah! \" ia berkata; \"Sesungguhnya anakku adalah pelayan untuk melayani keperluan isteri orang ini. Ternyata ia berzina dengan isterinya itu, kemudian aku menebus darinya dengan seratus ekor unta serta seorang budak. Dan aku bertanya kepada orang-orang yang berilmu, lalu mereka memberitahukan kepadaku bahwa anakku mendapat hukuman cambuk seratus kali dan di asingkan selama satu tahun, sementara isteri orang ini mendapat hukuman rajam.\" Beliau bersabda: \"Demi Dzat yang jiwaku ada di tanganNya. Sungguh aku akan memberikan keputusan dengan Kitabullah. Seratus ekor kambing dan seorang budak dikembalikan kepadamu, dan anakmu mendapatkan hukuman cambuk seratus kali dan di asingkan selama satu tahun. Wahai Unais, pergilah kepada isteri orang ini, dan tanyakan kepadanya! Apabila ia mengaku, maka rajamlah dia.\" Wanita itupun mengakui perbuatannya, maka Unais merajamnya."
            },
            {
                "number": 1860,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا مُحَمَّدٌ هُوَ ابْنُ إِسْحَقَ بْنِ يَسَارٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ عَنْ أَبِي الْهَيْثَمِ بْنِ نَصْرِ بْنِ دَهْرٍ الْأَسْلَمِيِّ عَنْ أَبِيهِ قَالَ كُنْتُ فِيمَنْ رَجَمَهُ قَالَ أَبُو مُحَمَّد يَعْنِي مَاعِزَ بْنَ مَالِكٍ فَلَمَّا وَجَدَ مَسَّ الْحِجَارَةِ جَزِعَ جَزَعًا شَدِيدًا قَالَ فَذَكَرْنَا ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَهَلَّا تَرَكْتُمُوهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah Ar Raqasyi] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Muhammad bin Ishaq bin Yasar] telah menceritakan kepada kami [Muhammad bin Ibrahim At Taimi] dari [Abu Al Haitsami bin Nashr bin Dahr Al Aslami] dari [Ayahnya] ia berkata; aku termasuk diantara orang yang merajamnya. -Abu Muhammad berkata; yaitu Ma'iz bin Malik- Tatkala dia merasakan lemparan bebatuan, dia sangat gelisah. Nashr bin Dahr Al Aslami berkata; Kemudian kami menyebutkan hal itu kepada Rasulullah shallallahu 'alaihi wasallam. Lalu beliau bersabda: \"Tidakkah kalian meninggalkannya?\""
            },
            {
                "number": 1861,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ عَنْ دَاوُدَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْطَلِقُوا بِمَاعِزِ بْنِ مَالِكٍ فَارْجُمُوهُ فَانْطَلَقْنَا بِهِ إِلَى بَقِيعِ الْغَرْقَدِ فَوَاللَّهِ مَا أَوْثَقْنَاهُ وَلَا حَفَرْنَا لَهُ وَلَكِنْ قَامَ فَرَمَيْنَاهُ بِالْعِظَامِ وَالْخَزَفِ وَالْجَنْدَلِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Yahya bin Abu Zaidah] dari [Daud] dari [Abu Nadhrah] dari [Abu Sa'id Al Khudri] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pergilah kepada Ma'iz bin Malik, dan rajamlah dia.\" Kemudian kami membawanya pergi ke Baqi' yang banyak pohon Gharqadnya. Demi Allah, kami tidak mengikatnya dan tidak pula menguburnya, akan tetapi ia berdiri, kemudian kami melemparinya dengan tulang, potongan bejana serta bebatuan.\""
            },
            {
                "number": 1862,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا بَشِيرُ بْنُ الْمُهَاجِرِ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَهُ رَجُلٌ يُقَالُ لَهُ مَاعِزُ بْنُ مَالِكٍ فَاعْتَرَفَ عِنْدَهُ بِالزِّنَا فَرَدَّهُ ثَلَاثَ مَرَّاتٍ ثُمَّ جَاءَ الرَّابِعَةَ فَاعْتَرَفَ فَأَمَرَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحُفِرَ لَهُ حُفْرَةٌ فَجُعِلَ فِيهَا إِلَى صَدْرِهِ وَأَمَرَ النَّاسَ أَنْ يَرْجُمُوهُ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Basyir bin Al Muhajir] telah menceritakan kepadaku [Abdullah bin Buraidah] dari [Ayahnya] ia berkata; kami pernah duduk-duduk bersama Nabi shallallahu 'alaihi wasallam, kemudian seorang laki-laki yang bernama Ma'iz bin Malik datang kepada beliau dan mengaku bahwa dirinya telah berzina. Namun beliau berpaling darinya sebanyak tiga kali. Akan tetapi dia tetap datang keempat kalinya sambil mengakui perbuatannya. Akhirnya Nabi shallallahu 'alaihi wasallam memerintahkan agar dibuatkan lubang untuknya, kemudian dia diletakkan pada lobang tersebut hingga dada, dan beliau memerintahkan orang-orang agar melemparinya (dengan batu).\""
            },
            {
                "number": 1863,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ الْيَهُودَ جَاءُوا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ مِنْهُمْ وَامْرَأَةٍ قَدْ زَنَيَا فَقَالَ كَيْفَ تَفْعَلُونَ بِمَنْ زَنَى مِنْكُمْ قَالُوا لَا نَجِدُ فِيهَا شَيْئًا فَقَالَ لَهُمْ عَبْدُ اللَّهِ بْنُ سَلَامٍ كَذَبْتُمْ فِي التَّوْرَاةِ الرَّجْمُ { فَأْتُوا بِالتَّوْرَاةِ فَاتْلُوهَا إِنْ كُنْتُمْ صَادِقِينَ } فَجَاءُوا بِالتَّوْرَاةِ فَوَضَعَ مِدْرَاسُهَا الَّذِي يَدْرُسُهَا مِنْهُمْ كَفَّهُ عَلَى آيَةِ الرَّجْمِ فَقَالَ مَا هَذِهِ فَلَمَّا رَأَوْا ذَلِكَ قَالُوا هِيَ آيَةُ الرَّجْمِ فَأَمَرَ بِهِمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُجِمَا قَرِيبًا مِنْ حَيْثُ تُوضَعُ الْجَنَائِزُ عِنْدَ الْمَسْجِدِ قَالَ عَبْدُ اللَّهِ فَرَأَيْتُ صَاحِبَهَا يَجْنَأُ عَلَيْهَا يَقِيهَا الْحِجَارَةَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu Umar] bahwa orang-orang Yahudi datang kepada Rasulullah shallallahu 'alaihi wasallam dengan membawa seorang laki-laki dan perempuan dari kalangan mereka yang berzina. Kemudian beliau bersabda: \"Bagaimana kalian berbuat terhadap orang yang berzina dari kalangan kalian?\" Mereka mengatakan; \"Kami tidak mendapatkan dalam Taurat sesuatupun. Kemudian Abdullah bin Salam berkata kepada mereka; \"Kalian telah berdusta. Dalam taurat terdapat rajam. Datangkanlah Taurat kemudian bacalah, apabila kalian adalah orang-orang yang benar.\" Kemudian mereka mendatangkan Taurat, sementara orang yang mempelajari Taurat dari kalangan mereka meletakkan telapak tangannya pada ayat mengenai rajam. Beliau bertanya; \"Apa ini?\" Tatkala mereka melihat hal itu, mereka berkata; \"Itu adalah ayat rajam.\" Rasulullah shallallahu 'alaihi wasallam pun memerintahkan supaya keduanya dirajam, akhirnya keduanya di rajam dekat dari tempat diletakkannya beberapa jenazah di Masjid. Abdullah berkata; \"Aku melihat laki-laki itu membungkuk diatas wanita tersebut untuk melindunginya dari bebatuan.\""
            },
            {
                "number": 1864,
                "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ عُمَرُ إِنَّ اللَّهَ تَعَالَى بَعَثَ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَقِّ وَأَنْزَلَ عَلَيْهِ الْكِتَابَ وَكَانَ فِيمَا أَنْزَلَ آيَةُ الرَّجْمِ فَقَرَأْنَاهَا وَوَعَيْنَاهَا وَعَقَلْنَاهَا وَرَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَجَمْنَا بَعْدَهُ فَأَخْشَى إِنْ طَالَ بِالنَّاسِ زَمَانٌ أَنْ يَقُولَ الْقَائِلُ لَا نَجِدُ حَدَّ آيَةِ الرَّجْمِ فِي كِتَابِ اللَّهِ وَالرَّجْمُ فِي كِتَابِ اللَّهِ حَقٌّ عَلَى مَنْ زَنَى مِنْ الرِّجَالِ وَالنِّسَاءِ إِذَا أُحْصِنَ إِذَا قَامَتْ عَلَيْهِ الْبَيِّنَةُ أَوْ كَانَ الْحَبَلُ أَوْ الِاعْتِرَافُ",
                "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah bin 'Utbah] dari [Ibnu Abbas], ia berkata; [Umar] berkata; Sesungguhnya Allah Ta'ala telah mengutus Muhammad shallallahu 'alaihi wasallam dengan membawa kebenaran, dan telah menurunkan kepadanya Al Qur'an. Diantara yang Allah turunkan adalah ayat mengenai rajam. Kemudian kami membacanya dan menghafal serta memahaminya. Rasulullah shallallahu 'alaihi wasallam pernah merajam dan kamipun merajam setelah beliau (wafat). Lalu aku khawatir apabila zaman telah berlalu bagi manusia, maka seseorang akan berkata; \"Kami tidak mendapatkan ayat rajam dalam Kitabullah, sementara rajam dalam Kitabullah adalah benar, yaitu bagi laki-laki dan perempuan yang telah menikah, dan telah cukup bukti atau hamil atau mengaku telah berzina.\""
            },
            {
                "number": 1865,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الرِّفَاعِيُّ حَدَّثَنَا الْعَقَدِيُّ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ يُونُسَ بْنِ جُبَيْرٍ يُحَدِّثُ عَنْ كَثِيرِ بْنِ الصَّلْتِ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَ أَشْهَدُ لَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الشَّيْخُ وَالشَّيْخَةُ إِذَا زَنَيَا فَارْجُمُوهُمَا الْبَتَّةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yazid Ar Rifa'i] telah menceritakan kepada kami [Al 'Aqadi] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Yunus bin Jubair] ia menceritakan dari [Katsir bin Ash Shalt] dari [Zaid bin Tsabit], ia berkata; aku bersaksi telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang laki-laki dan perempuan tua apabila berzina, maka rajamlah dia.\""
            },
            {
                "number": 1866,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا بَشِيرُ بْنُ الْمُهَاجِرِ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ كُنْتُ جَالِسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَتْهُ امْرَأَةٌ مِنْ بَنِي غَامِدٍ فَقَالَتْ يَا نَبِيَّ اللَّهِ إِنِّي قَدْ زَنَيْتُ وَإِنِّي أُرِيدُ أَنْ تُطَهِّرَنِي فَقَالَ لَهَا ارْجِعِي فَلَمَّا كَانَ مِنْ الْغَدِ أَتَتْهُ أَيْضًا فَاعْتَرَفَتْ عِنْدَهُ بِالزِّنَا فَقَالَتْ يَا نَبِيَّ اللَّهِ طَهِّرْنِي فَلَعَلَّكَ أَنْ تَرْدُدَنِي كَمَا رَدَدْتَ مَاعِزَ بْنَ مَالِكٍ فَوَاللَّهِ إِنِّي لَحُبْلَى فَقَالَ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ارْجِعِي حَتَّى تَلِدِي فَلَمَّا وَلَدَتْ جَاءَتْ بِالصَّبِيِّ تَحْمِلُهُ فِي خِرْقَةٍ فَقَالَتْ يَا نَبِيَّ اللَّهِ هَذَا قَدْ وَلَدْتُ قَالَ فَاذْهَبِي فَأَرْضِعِيهِ ثُمَّ افْطِمِيهِ فَلَمَّا فَطَمَتْهُ جَاءَتْ بِالصَّبِيِّ فِي يَدِهِ كِسْرَةُ خُبْزٍ فَقَالَتْ يَا نَبِيَّ اللَّهِ قَدْ فَطَمْتُهُ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالصَّبِيِّ فَدُفِعَ إِلَى رَجُلٍ مِنْ الْمُسْلِمِينَ وَأَمَرَ بِهَا فَحُفِرَ لَهَا حُفْرَةٌ فَجُعِلَتْ فِيهَا إِلَى صَدْرِهَا ثُمَّ أَمَرَ النَّاسَ أَنْ يَرْجُمُوهَا فَأَقْبَلَ خَالِدُ بْنُ الْوَلِيدِ بِحَجَرٍ فَرَمَى رَأْسَهَا فَتَلَطَّخَ الدَّمُ عَلَى وَجْنَةِ خَالِدِ بْنِ الْوَلِيدِ فَسَبَّهَا فَسَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبَّهُ إِيَّاهَا فَقَالَ مَهْ يَا خَالِدُ لَا تَسُبَّهَا فَوَالَّذِي نَفْسِي بِيَدِهِ لَقَدْ تَابَتْ تَوْبَةً لَوْ تَابَهَا صَاحِبُ مَكْسٍ لَغُفِرَ لَهُ فَأَمَرَ بِهَا فَصُلِّيَ عَلَيْهَا وَدُفِنَتْ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Basyir bin Al Muhajir] telah menceritakan kepadaku [Abdullah bin Buraidah] dari [Ayahnya] ia berkata; aku duduk di sisi Nabi shallallahu 'alaihi wasallam, tiba-tiba seorang wanita dari Bani Ghamid datang kepada beliau sambil berkata; \"Wahai Nabiyullah, sesungguhnya aku telah berzina, dan aku ingin membersihkan diri.\" Beliau bersabda kepadanya; \"Kembalilah.\" Dihari berikutnya, wanita itu datang lagi sambil mengaku telah berzina, katanya; \"Wahai Nabiyullah, sucikanlah diriku, sepertinya engaku hendak menolakku sebagaimana menolak (pengakuan) Ma'iz bin Malik, demi Allah, sesungguhnya diriku telah hamil (dari perzinahan tersebut).\" Maka Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Kembalilah hingga engkau melahirkan.\" Setelah melahirkan, wanita itu datang membawa seorang bayi yang ia gendong dalam sepotong kain, wanita itu berkata; \"Wahai Nabiyullah, kini aku telah melahirkan.\" Beliau bersabda: \"Pergilah dan susui anak itu hingga kamu menyapihnya! \" Tatkala wanita itu selesai menyapih, ia datang dan di tangan anak tersebut terdapat potongan roti. Lalu ia berkata; \"Wahai Nabiyullah, sungguh aku telah menyapihnya.\" Lalu Nabi shallallahu 'alaihi wasallam memerintahkan agar anak tersebut diserahkan kepada seseorang dari kalangan muslimin, lalu beliau memerintahkan supaya wanita itu dibuatkan lubang, akhirnya ia diletakkan di dalam lubang tersebut hingga dada. Lalu beliau memerintahkan orang-orang agar melemparinya. Sesaat kemudian Khalid bin Al Walid datang dengan batu, lalu ia melempar kepala wanita tersebut hingga darah terpancar ke pelipis Khaid bin Al Walid, ia langsung mengumpatnya. Mendengar umpatan itu Nabi shallallahu 'alaihi wasallam bersabda: \"Tahanlah, wahai Khalid, janganlah engkau mengumpatnya. Demi Dzat yang jiwanya ada di tanganNya. Sungguh ia telah bertaubat dengan taubat yang seandainya pemungut pajak, memungut pajak tidak sesuai dengan syari'at (Islam), niscaya pemungut pajak akan mendapatkan ampunan.\" Kemudian beliau memerintahkan agar wanita tersebut disholatkan dan dikubur."
            },
            {
                "number": 1867,
                "arab": " حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ امْرَأَةً مِنْ جُهَيْنَةَ أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ حُبْلَى مِنْ الزِّنَا فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ حَدًّا فَأَقِمْهُ عَلَيَّ فَدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلِيَّهَا فَقَالَ اذْهَبْ فَأَحْسِنْ إِلَيْهَا فَإِذَا وَضَعَتْ حَمْلَهَا فَأْتِنِي بِهَا فَفَعَلَ فَأَمَرَ بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشُكَّتْ عَلَيْهَا ثِيَابُهَا ثُمَّ أَمَرَ بِهَا فَرُجِمَتْ ثُمَّ صَلَّى عَلَيْهَا فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ أَتُصَلِّي عَلَيْهَا وَقَدْ زَنَتْ فَقَالَ لَقَدْ تَابَتْ تَوْبَةً لَوْ قُسِمَتْ بَيْنَ سَبْعِينَ مِنْ أَهْلِ الْمَدِينَةِ لَوَسِعَتْهُمْ وَهَلْ وَجَدْتَ أَفْضَلَ مِنْ أَنْ جَادَتْ بِنَفْسِهَا لِلَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Abu Qilabah] dari [Abu Al Muhallab] dari [Imran bin Hushain] bahwa seoerang wanita dari Juhainah datang kepada Nabi shallallahu 'alaihi wasallam dalam keadaan hamil karena berzina, dia berkata; \"Wahai Rasulullah, sesungguhnya aku telah melanggar hukum, oleh karena itu tegakkanlah hukuman kepadaku!.\" Rasulullah shallallahu 'alaihi wasallam memanggil walinya dan berkata: \"Pergilah dan uruslah dia dengan baik, apabila telah melahirkan, bawalah ia kepadaku.\" Walinya pun melakukan perintah beliau, setelah itu Rasulullah shallallahu 'alaihi wasallam memerintahkan supaya pakain wanita tersebut diikatkan ke badannya, beliau akhirnya memerintahkan agar wanita tersebut dirajam. Setelah itu beliau mensholatkan jenazah wanita tersebut, Umar berkata; \"Wahai Rasulullah, apakah engkau mensholatkannya, sementara dirinya telah berzina?\" Beliau bersabda: \"Sungguh dirinya telah bertaubat dengan taubat yang seandainya di bagikan diantara tujuh puluh penduduk Madinah, niscaya akan mencukupi mereka semua. Apakah engkau mendapatkan taubat yang lebih baik dari seseorang yang menyerahkan dirinya kepada Allah 'azza wajalla?.\""
            },
            {
                "number": 1868,
                "arab": " حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ وَأَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الْأَمَةِ تَزْنِي وَلَمْ تُحْصَنْ فَقَالَ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا قَالَ مَا أَدْرِي فِي الثَّالِثَةِ أَوْ فِي الرَّابِعَةِ فَبِيعُوهَا وَلَوْ بِضَفِيرٍ",
                "id": "Telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari ['ubaidhullah bin Abdullah bin 'Utbah] dari [Zaid bin Khalid Al Juhani] serta [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam ditanya mengenai seorang budak wanita yang berzina dan belum menikah. Beliau bersabda; \"Apabila ia berzina, maka cambuklah dia, jika masih berzina, maka cambuklah dia, jika masih berzina, maka cambuklah dia.\" Abu Hurairah berkata; Aku tidak tahu beliau mengatakan yang ketiga kali atau keempat kalinya: \"Kemudian juallah dia walaupun hanya senilai tali pelana.\""
            },
            {
                "number": 1869,
                "arab": " أَخْبَرَنَا بِشْرُ بْنُ عُمَرَ الزَّهْرَانِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خُذُوا عَنِّي خُذُوا عَنِّي قَدْ جَعَلَ اللَّهُ لَهُنَّ سَبِيلًا الْبِكْرُ بِالْبِكْرِ وَالثَّيِّبُ بِالثَّيِّبِ الْبِكْرُ جَلْدُ مِائَةٍ وَنَفْيُ سَنَةٍ وَالثَّيِّبُ جَلْدُ مِائَةٍ وَالرَّجْمُ أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا هُشَيْمٌ عَنْ مَنْصُورٍ عَنْ الْحَسَنِ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ",
                "id": "Telah mengabarkan kepada kami [Bisyr bin Umar Az Zahrani] telah menceritakan kepada kami [Hammad bin Salamah] dari [Qatadah] dari [Al Hasan] dari [Haththan bin Abdullah] dari ['Ubadah bin Ash Shamit] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ikutilah semua ajaranku, ikutilah semua ajaranku, sungguh Allah telah menetapkan hukuman bagi seorang wanita, hukuman bagi seorang perawan sesuai hukumannya bagi seorang perawan yaitu di cambuk seratus kali dan di asingkan selama setahun, sedangkan seseorang yang telah menikah, hukumannya juga sesuai dengan orang yang telah menikah yaitu di dera seratus kali dan di rajam.\" Telah mengabarkan kepada kami ['Amr bin 'Aun] telah mengabarkan kepada kami [Husyaim] dari [Manshur] dari [Al Hasan] dari [Hiththan bin Abdullah] dari ['Ubadah bin Ash Shamit] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas."
            },
            {
                "number": 1870,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَمَّادٍ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ عَنْ قَتَادَةَ قَالَ كَتَبَ إِلَيَّ خَالِدُ بْنُ عُرْفُطَةَ عَنْ حَبِيبِ بْنِ سَالِمٍ أَنَّ غُلَامًا كَانَ يُنْبَزُ فُرْفُورًا فَوَقَعَ عَلَى جَارِيَةِ امْرَأَتِهِ فَرُفِعَ إِلَى النُّعْمَانِ بْنِ بَشِيرٍ فَقَالَ لَأَقْضِيَنَّ فِيهِ بِقَضَاءٍ شَافٍ إِنْ كَانَتْ أَحَلَّتْهَا لَهُ جَلَدْتُهُ مِائَةً وَإِنْ كَانَتْ لَمْ تُحِلَّهَا لَهُ رَجَمْتُهُ فَقِيلَ لَهَا زَوْجُكِ فَقَالَتْ إِنِّي قَدْ أَحْلَلْتُهَا لَهُ فَضَرَبَهُ مِائَةً قَالَ يَحْيَى هُوَ مَرْفُوعٌ حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ شُعْبَةَ عَنْ أَبِي بِشْرٍ عَنْ خَالِدِ بْنِ عُرْفُطَةَ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hammad] telah menceritakan kepada kami [Aban bin Yazid] dari [Qatadah] ia berkata; [Khalid bin 'Urfuthah] telah menulis surat kepadaku, dari [Habib bin Salim] bahwa seorang pemuda berjulukan Furfur telah menggauli budak wanita isterinya, Ketika hal itu dilaporkan kepada [An Nu'man bin Basyir], dia berkata; \"Sungguh aku akan memberikan keputusan mengenai pemuda tersebut dengan keputusan yang mencakup. Apabila isterinya telah menghalalkan budak tersebut untuknya, maka aku akan mencambuknya sebanyak seratus kali, dan apabila isterinya tidak menghalalkan budak tersebut untuknya, maka aku akan merajamnya.\" Lalu dikatakan kepada isterinya; \"Suamimu tergantung kepadamu.\" Isterinya berkata; \"Aku telah menghalalkan budak itu baginya.\" Kemudian An Nu'man mencambuknya seratus kali.\" Yahya berkata; \"Hadits tersebut marfu'.\" Telah menceritakan kepada kami [Shadaqah bin Al Fadhl] telah mengabarkan kepada kami [Muhammad bin Ja'far] dari [Syu'bah] dari [Abu Bisyr] dari [Khalid bin 'Urfuthah] dari [Habib bin Salim] dari [An Nu'man bin Basyir] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas."
            },
            {
                "number": 1871,
                "arab": " أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ الدِّمَشْقِيُّ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ مُحَمَّدِ بْنِ الْمُنَكْدِرِ عَنْ ابْنِ خُزَيْمَةَ بْنِ ثَابِتٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أُقِيمَ عَلَيْهِ حَدٌّ غُفِرَ لَهُ ذَلِكَ الذَّنْبُ",
                "id": "Telah mengabarkan kepada kami [Marwan bin Muhammad Ad Dimasyqi] telah menceritakan kepada kami [Ibnu Wahb] dari [Usamah bin Zaid] dari [Muhammad bin Al Munkadir] dari [Ibnu Khuzaimah bin Tsabit] dari [Ayahnya], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa dirinya dijatuhi hukuman terhadap (dosa yang ia perbuat), maka dosanya tersebut akan diampuni.\""
            },
            {
                "number": 1872,
                "arab": " أَخْبَرَنَا سَهْلُ بْنُ حَمَّادٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ امْرَأَةً نَذَرَتْ أَنْ تَحُجَّ فَمَاتَتْ فَجَاءَ أَخُوهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ عَنْ ذَلِكَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ كَانَ عَلَيْهَا دَيْنٌ كُنْتَ قَاضِيَهُ قَالَ نَعَمْ قَالَ فَاقْضُوا اللَّهَ فَاللَّهُ أَحَقُّ بِالْوَفَاءِ",
                "id": "Telah mengabarkan kepada kami [Sahl bin Hammad] telah menceritakan kepada kami [Syu'bah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa seorang wanita bernadzar untuk melakukan haji, ternyata ia meninggal (sebelum berhaji), kemudian saudara laki-lakinya datang kepada Rasulullah shallallahu 'alaihi wasallam dan bertanya mengenai hal itu, beliau bersabda: \"Apabila saudaramu memiliki hutang, apakah engkau akan membayarnya?\" laki-laki itu menjawab; \"Ya.\" Beliau bersabda: \"Bayarlah hutang kepada Allah, sebab Dia lebih berhak untuk ditunaikan hutang-Nya.\""
            },
            {
                "number": 1873,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا حَفْصٌ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ عُمَرَ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ نَذْرًا فِي الْجَاهِلِيَّةِ ثُمَّ جَاءَ الْإِسْلَامُ قَالَ فِ بِنَذْرِكَ ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Hafsh] telah menceritakan kepada kami ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] dari [Umar] ia berkata; \"Wahai Rasulullah, sesungguhnya aku telah bernadzar pada masa Jahiliyah, kemudian Islam datang.\" Beliau bersabda: \"Laksanakanlah nadzarmu.\""
            },
            {
                "number": 1874,
                "arab": " أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ زَحْرٍ عَنْ أَبِي سَعِيدٍ الرُّعَيْنِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ قَالَ نَذَرَتْ أُخْتِي أَنْ تَحُجَّ لِلَّهِ مَاشِيَةً غَيْرَ مُخْتَمِرَةٍ فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مُرْ أُخْتَكَ فَلْتَخْتَمِرْ وَلْتَرْكَبْ وَلْتَصُمْ ثَلَاثَةَ أَيَّامٍ",
                "id": "Telah mengabarkan kepada kami [Ja'far bin 'Aun] telah menceritakan kepada kami [Yahya bin Sa'id] dari ['ubaidhullah bin Zahr] dari [Abu Sa'id Ar Ru'aini] dari [Abdullah bin Malik] dari ['Uqbah bin 'Amir Al Juhani], ia berkata; \"Saudara perempuanku pernah bernadzar pergi haji karena Allah dengan berjalan kaki dan tidak memakai penutup kepala. Setelah aku menceritakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam. beliau bersabda: \"Perintahkanlah kepada sadara perempuanmu agar menutup kepala dan naik kendaraan serta berpuasa tiga hari.\""
            },
            {
                "number": 1875,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا هَمَّامٌ أَخْبَرَنِي قَتَادَةُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ أُخْتَ عُقْبَةَ نَذَرَتْ أَنْ تَمْشِيَ إِلَى الْبَيْتِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ لَغَنِيٌّ عَنْ نَذْرِ أُخْتِكَ لِتَرْكَبْ وَلْتُهْدِ هَدْيًا",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Hammam] telah mengabarkan kepadaku [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] bahwa saudara perempuan 'Uqbah bernadzar berjalan menuju Ka'bah. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah tidak butuh kepada nadzar saudarimu, suruhlah ia naik kendaraan dan menyembelih kurban.\""
            },
            {
                "number": 1876,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَدْرَكَ شَيْخًا يَمْشِي بَيْنَ ابْنَيْهِ فَقَالَ مَا شَأْنُ هَذَا الشَّيْخِ فَقَالَ ابْنَاهُ نَذَرَ أَنْ يَمْشِيَ فَقَالَ ارْكَبْ فَإِنَّ اللَّهَ غَنِيٌّ عَنْكَ وَعَنْ نَذْرِكَ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari ['Amr bin Abu 'Amr] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah menjumpai laki-laki tua yang berjalan sambil dipapah diantara dua orang, kemudian beliau bersabda: \"Ada apa dengan orang tua ini?\" Kedua anaknya menjawab; \"Ia bernadzar untuk berjalan menuju Ka'bah.\" Beliau bersabda: \"Suruhlah ia naik kendaraan, sesungguhnya Allah tidak butuh kepadamu dan kepada nadzarmu.\""
            },
            {
                "number": 1877,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا وَفَاءَ لِنَذْرٍ فِي مَعْصِيَةِ اللَّهِ وَلَا فِيمَا لَا يَمْلِكُ ابْنُ آدَمَ",
                "id": "Telah mengabarkan kepada kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Qilabah] dari [Abu Al Muhallab] dari [Imran bin Hushain] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak wajib menunaikan nadzar dalam rangka bermaksiat kepada Allah, dan apa yang tidak dimiliki oleh manusia.\""
            },
            {
                "number": 1878,
                "arab": " حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ الْأَيْلِيِّ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَذَرَ أَنْ يَطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلَا يَعْصِهِ",
                "id": "Telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Thalhah bin Abdul Malik Al 'Aili] dari [Al Qasim bin Muhammad] dari ['Aisyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bernadzar untuk mentaati Allah, hendaknya ia mentaati-Nya dan barangsiapa bernadzar untuk bermaksiat kepada Allah, janganlah ia bermaksiat kepadaNya.\""
            },
            {
                "number": 1879,
                "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حَبِيبِ بْنِ أَبِي بَقِيَّةَ الْمُعَلِّمِ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ إِنْ فَتَحَ اللَّهُ عَلَيْكَ أَنْ أُصَلِّيَ فِي بَيْتِ الْمَقْدِسِ فَقَالَ صَلِّ هَا هُنَا فَأَعَادَ عَلَيْهِ ثَلَاثَ مَرَّاتٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَأْنُكَ إِذَنْ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] dari [Habib bin Abu Baqiyyah Al Mu'allim] dari ['Atha` bin Abu Rabah] dari [Jabir bin Abdullah] bahwa seorang laki-laki berkata; \"Wahai Rasulullah, sesungguhnya aku telah bernadzar, apabila Allah memberikan kemenangan kepadamu, maka aku akan melakukan sholat di Baitul Maqdis. Beliau bersabda: \"sholatlah di sini.\" Jabir mengulanginya sebanyak tiga kali, akhirnya Nabi shallallahu 'alaihi wasallam bersabda: \"Terserah kamu, kalau demikian.\""
            },
            {
                "number": 1880,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ مَنْصُورٍ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ إِنَّ النَّذْرَ لَا يَرُدُّ شَيْئًا وَإِنَّمَا يُسْتَخْرَجُ بِهِ مِنْ الشَّحِيحِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Aun] telah mengabarkan kepada kami [Abu 'Awanah] dari [Manshur] dari [Abdullah bin Murrah] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya nadzar tidak dapat menolak sesuatupun, sesungguhnya itu dikeluarkan dari orang yang pelit.\""
            },
            {
                "number": 1881,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَدْرَكَ عُمَرَ بْنَ الْخَطَّابِ وَهُوَ يَسِيرُ فِي رَكْبٍ وَهُوَ يَحْلِفُ بِأَبِيهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ فَمَنْ كَانَ حَالِفًا فَلْيَحْلِفْ بِاللَّهِ أَوْ لِيَصْمُتْ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah menceritakan kepada kami [Malik Anas] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam mendapati Umar bin Al Khathab berjalan di atas tunggangannya tengah bersumpah dengan nenek moyangnya. Nmaka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah melarang kalian bersumpah dengan nama bapak-bapak kalian. Barangsiapa bersumpah, hendaknya ia bersumpah dengan nama Allah atau ia diam.\""
            },
            {
                "number": 1882,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَلَفَ عَلَى يَمِينٍ ثُمَّ قَالَ إِنْ شَاءَ اللَّهُ فَقَدْ اسْتَثْنَى",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Hammad bin Salamah] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa bersumpah kemudian berkata; \"Jika Allah menghendaki, \" maka ia telah mengucapkan pengecualian.\""
            },
            {
                "number": 1883,
                "arab": " أَخْبَرَنَا حَجَّاجٌ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَلَفَ عَلَى يَمِينٍ ثُمَّ قَالَ إِنْ شَاءَ اللَّهُ فَهُوَ بِالْخِيَارِ إِنْ شَاءَ فَعَلَ وَإِنْ شَاءَ لَمْ يَفْعَلْ",
                "id": "Telah mengabarkan kepada kami [Hajjaj] telah menceritakan kepada kami [Hammad bin Salamah] telah menceritakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah, kemudian mengucapkan insya Allah, maka ia memiliki pilihan, apabila berkehendak, maka ia melakukannya dan apabila berkehendak, maka ia bolehtidak melakukannya.\""
            },
            {
                "number": 1884,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي بَكْرٍ لَا تُقْسِمْ قَالَ أَبُو مُحَمَّد الْحَدِيثُ فِيهِ طُولٌ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepada kami [Al Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam bersabda kepada Abu Bakr: \"Janganlah engkau bersumpah.\" Abu Muhammad berkata; \"Hadits ini panjang.\""
            },
            {
                "number": 1885,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرٍو هُوَ ابْنُ مُرَّةَ قَالَ سَمِعْتُ رَجُلًا يُقَالُ لَهُ عَبْدُ اللَّهِ بْنُ عَمْرٍو زَمَنَ الْجَمَاجِمِ يُحَدِّثُ قَالَ سَأَلَ رَجُلٌ عَدِيَّ بْنَ حَاتِمٍ فَحَلَفَ أَنْ لَا يُعْطِيَهُ شَيْئًا ثُمَّ قَالَ لَوْلَا أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيَأْتِ الَّذِي هُوَ خَيْرٌ وَلْيُكَفِّرْ عَنْ يَمِينِهِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah] dari ['Amr yaitu Ibnu Hubairah], ia berkata; aku mendengar seorang laki-laki yang bernama [Abdullah bin 'Amr] pada masa tejadinya perang Al Jamajim berkata; \"Seseorang meminta sesuatu kepada ['Adi bin Hatim], namun 'Adi bersumpah untuk tidak akan memberikan sesuatupun. Kemudian ia berkata; \"Seandainya aku tidak mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah, kemudian ia melihat ada sesuatu yang lebih baik darinya, hendaknya ia melakukan yang lebih baik dan membayar kafarah sumpahnya.\""
            },
            {
                "number": 1886,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْفَضْلِ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ حَدَّثَنَا الْحَسَنُ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَبْدَ الرَّحْمَنِ بْنَ سَمُرَةَ لَا تَسْأَلْ الْإِمَارَةَ فَإِنَّكَ إِنْ أُعْطِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا وَإِنْ أُعْطِيتَهَا مِنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا فَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَكَفِّرْ عَنْ يَمِينِكَ وَأْتِ الَّذِي هُوَ خَيْرٌ أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ يُونُسَ عَنْ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ نَحْوَ الْحَدِيثِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Fadhl] telah menceritakan kepada kami [Jarir bin Hazim] telah menceritakan kepada kami [Al Hasan] telah menceritakan kepada kami [Abdurrahman bin Samurah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Abdurrahman bin Samurah, janganlah engkau meminta jabatan, sesungguhnya bila engkau diberi jabatan karena meminta, engkau akan diterlantarkan, namun apabila engkau diberi jabatan dengan tanpa meminta, maka engkau akan ditolong dalam menjalankannya. Dan jika engkau bersumpah, lantas engkau melihat sesuatu yang lebih baik, maka bayarlah kafarah sumpahmu, dan lakukan yang lebih baik.\" Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Yunus] dari [Al Hasan] dari [Abdurrahman bin Samurah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda:....\" kemudian ia menyebutkan hadits seperti di atas."
            },
            {
                "number": 1887,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ الشَّرِيدِ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنَّ عَلَى أُمِّي رَقَبَةً وَإِنَّ عِنْدِي جَارِيَةً سَوْدَاءَ نُوبِيَّةً أَفَتُجْزِئُ عَنْهَا قَالَ ادْعُ بِهَا فَقَالَ أَتَشْهَدِينَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ قَالَتْ نَعَمْ قَالَ أَعْتِقْهَا فَإِنَّهَا مُؤْمِنَةٌ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Hammad bin Salamah] dari [Muhammad bin 'Amr] dari [Abu Salamah] dari [Asy Syarid] ia berkata; aku mendatangi Nabi shallallahu 'alaihi wasallam dan berkata; \"Sesungguhnya ibuku kewajiban membebaskan budak, sementara aku memiliki budak wanita berkulit hitam, apakah sah untuknya?\" Beliau menjawab: \"Panggillah dia! \" kemudian beliau berkata: \"Apakah engkau bersaksi bahwa tidak ada Tuhan yang berhak disembah kecuali Allah?\" Budak itu menjawab; \"Ya.\" Beliau bersabda: \"Bebaskan dia, sesungguhnya ia adalah wanita mukminah.\""
            },
            {
                "number": 1888,
                "arab": " أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمِينُكَ عَلَى مَا صَدَّقَكَ بِهِ صَاحِبُكَ",
                "id": "Telah mengabarkan kepada kami [Utsman bin Muhammad] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Abdullah bin Abu Shalih] dari [Ayahnya] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sumpahmu adalah sesuatu yang dapat meyakinkan sahabatmu.\""
            },
            {
                "number": 1889,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ سُفْيَانَ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَ كَانَتْ يَمِينُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّتِي يَحْلِفُ بِهَا لَا وَمُقَلِّبِ الْقُلُوبِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Musa] dari [Sufyan] dari [Musa bin 'Uqbah] dari [Salim] dari [Ibnu Umar] ia berkata; sumpah Rasulullah shallallahu 'alaihi wasallam yang beliau ucapkan adalah: \"Tidak, demi Dzat yang membolak-balikkan hati.\""
            },
            {
                "number": 1890,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ الْحَارِثِ بْنِ فُضَيْلٍ عَنْ سُفْيَانَ بْنِ أَبِي الْعَوْجَاءِ السُّلَمِيِّ عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أُصِيبَ بِدَمٍ أَوْ خَبْلٍ وَالْخَبْلُ الْجُرْحُ فَهُوَ بِالْخِيَارِ بَيْنَ إِحْدَى ثَلَاثٍ فَإِنْ أَرَادَ الرَّابِعَةَ فَخُذُوا عَلَى يَدَيْهِ بَيْنَ أَنْ يَقْتَصَّ أَوْ يَعْفُوَ أَوْ يَأْخُذَ الْعَقْلَ فَإِنْ أَخَذَ مِنْ ذَلِكَ شَيْئًا ثُمَّ عَدَا بَعْدَ ذَلِكَ فَلَهُ النَّارُ خَالِدًا فِيهَا مُخَلَّدًا",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Muhammad bin Ishaq] dari [Al Harits bin Fudhail] dari [Sufyan bin Abu Al 'Auja` As Sulami] dari [Abu Syuraih Al Khuza'i] ia berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa diuji dengan terbunuhnya jiwa, atau khabl -khabl adalah luka- maka baginya hak untuk memilih salah satu dari tiga hal, apabila ia menginginkan tambahan yang keempat, maka cegahlah dia. Yaitu antara membalas, atau memaafkan, atau mengambil diat. Apabila ia telah mengambil salah satu dari ketiga hal itu, kemudian melampaui batas setelah itu, maka baginya Neraka, ia kekal di dalamnya.\""
            },
            {
                "number": 1891,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ حَدَّثَنِي الزُّهْرِيُّ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ وَكَانَ فِي كِتَابِهِ أَنَّ مَنْ اعْتَبَطَ مُؤْمِنًا قَتْلًا عَنْ بَيِّنَةٍ فَإِنَّهُ قَوَدُ يَدِهِ إِلَّا أَنْ يَرْضَى أَوْلِيَاءُ الْمَقْتُولِ قَالَ أَبُو مُحَمَّد اعْتَبَطَ قَتَلَ مِنْ غَيْرِ عِلَّةٍ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Sulaiman bin Daud] telah menceritakan kepadaku [Az Zuhri] dari [Abu Bakr bin Muhammad bin 'Amr bin Hazm] dari [Ayahnya] dari [Kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam telah menulis surat kepada penduduk Yaman, dan diantara isi suratnya adalah: \"Barangsiapa membunuh seorang mukmin secara lalim dengan tanpa bukti yang jelas, maka ia mendapatkan balasan, kecuali apabila para wali orang yang dibunuh merasa rela.\" Abu Muhammad berkata; \"I'tabatha adalah membunuh tanpa alasan yang hak.\""
            },
            {
                "number": 1892,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ حَدَّثَنَا بُشَيْرُ بْنُ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ قَالَ خَرَجَ عَبْدُ اللَّهِ بْنُ سَهْلٍ أَحَدُ بَنِي حَارِثَةَ إِلَى خَيْبَرَ مَعَ نَفَرٍ مِنْ قَوْمِهِ يُرِيدُونَ الْمِيرَةَ بِخَيْبَرَ قَالَ فَعُدِيَ عَلَى عَبْدِ اللَّهِ فَقُتِلَ فَتُلَّتْ عُنُقُهُ حَتَّى نُخِعَ ثُمَّ طُرِحَ فِي مَنْهَلٍ مِنْ مَنَاهِلِ خَيْبَرَ فَاسْتُصْرِخَ عَلَيْهِ أَصْحَابُهُ فَاسْتَخْرَجُوهُ فَغَيَّبُوهُ ثُمَّ قَدِمُوا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ فَتَقَدَّمَ أَخُوهُ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَكَانَ ذَا قِدَمٍ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَابْنَا عَمِّهِ مَعَهُ حُوَيِّصَةُ بْنُ مَسْعُودٍ وَمُحَيِّصَةُ فَتَكَلَّمَ عَبْدُ الرَّحْمَنِ وَكَانَ أَحْدَثَهُمْ سِنًّا وَهُوَ صَاحِبُ الدَّمِ وَذَا قَدَمٍ فِي الْقَوْمِ فَلَمَّا تَكَلَّمَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكُبْرَ الْكُبْرَ قَالَ فَاسْتَأْخَرَ فَتَكَلَّمَ حُوَيِّصَةُ وَمُحَيِّصَةُ ثُمَّ هُوَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُسَمُّونَ قَاتِلَكُمْ ثُمَّ تَحْلِفُونَ عَلَيْهِ خَمْسِينَ يَمِينًا ثُمَّ نُسَلِّمُهُ إِلَيْكُمْ قَالُوا يَا رَسُولَ اللَّهِ مَا كُنَّا لِنَحْلِفَ عَلَى مَا لَا نَعْلَمُ مَا نَدْرِي مَنْ قَتَلَهُ إِلَّا أَنَّ يَهُودَ عَدُوُّنَا وَبَيْنَ أَظْهُرِهِمْ قُتِلَ قَالَ فَيَحْلِفُونَ لَكُمْ بِاللَّهِ إِنَّهُمْ لَبُرَءَاءُ مِنْ دَمِ صَاحِبِكُمْ ثُمَّ يَبْرَءُونَ مِنْهُ قَالُوا مَا كُنَّا لِنَقْبَلَ أَيْمَانَ يَهُودَ مَا فِيهِمْ أَكْبَرُ مِنْ أَنْ يَحْلِفُوا عَلَى إِثْمٍ قَالَ فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ بِمِائَةِ نَاقَةٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah Ar Raqasyi] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Muhammad bin Ishaq] telah menceritakan kepada kami [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah] ia berkata; Abdullah bin Sahl -salah seorang Bani Haritsah- keluar menuju Khaibar bersama beberapa orang dari kaumnya. Mereka hendak mengambil kurma di Khaibar. Sahl bin Abu Hatsmah berkata; \"Kemudian Abdullah bin Sahl dibunuh dan lehernya dipotong dan dicampakkan ke dalam satu sumur di Khaibar. Kemudian para sahabatnya berteriak meminta tolong, setelah mereka mengeluarkan jasadnya dan menguburkannya, mereka datang menemui Rasulullah shallallahu 'alaihi wasallam di Madinah, lalu saudaranya yaitu Abdurrahman bin Sahl -ia telah lama bersama Rasulullah shallallahu 'alaihi wasallam bersama- bersama dua orang anak pamannya yaitu Huwayyishah dan Muhayyishah menemui beliau, Abdurrahman angkat bicara - ia adalah orang yang paling muda diantara mereka, orang yang memiliki hak terhadap darah tersebut dan orang yang masuk Islam lebih dulu daripada mereka- Tatkala ia berbicara, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaknya orang yang lebih tua yang angkat bicara lebih dulu, Hendaknya orang yang lebih tua yang angkat bicara lebih dulu, \" Sahl bin Abu Hatsmah berkata; \"Kemudian Abdurrahman mundur dan Huwayyishah serta Muhayyishah berbicara, setelah itu ia angkat bicara. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah kalian dapat menyebutkan orang yang membunuh, kemudian kalian bersumpah atasnya sebanyak lima puluh kali, maka kami menyerahkan orang tersebut kepada kalian.\" Mereka berkata; \"Wahai Rasulullah, kami tidak dapat bersumpah terhadap sesuatu yang tidak kami ketahui, kami tidak mengerti siapa yang membunuhnya. Hanya saja orang-orang Yahudi adalah musuh kita, dan orang yang berada di antara mereka akan ia bunuh. Beliau bersabda: \"Apakah mereka bersumpah untuk kalian dengan nama Allah sehingga mereka bebas dari darah sahabat kalian?\" Mereka berkata; \"Sumpah orang-orang Yahudi, tidak ada sesuatu yang lebih besar bagi mereka daripada mereka harus bersumpah atas perbuatan dosa.\" Sahl bin Abu Hatsmah berkata; kemudian Rasulullah shallallahu 'alaihi wasallam menebusnya dengan seratus ekor unta milik beliau."
            },
            {
                "number": 1893,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ حَدَّثَنِي الزُّهْرِيُّ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ وَكَانَ فِي كِتَابِهِ أَنَّ الرَّجُلَ يُقْتَلُ بِالْمَرْأَةِ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Sulaiman bin Daud] telah menceritakan kepadaku [Az Zuhri] dari [Abu Bakr bin Muhammad bin 'Amr bin Hazm] dari [Ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam menulis surat kepada penduduk Yaman, diantara isi suratnya adalah bahwa orang laki-laki dibunuh apabila membunuh wanita."
            },
            {
                "number": 1894,
                "arab": " أَخْبَرَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍ أَنَّ جَارِيَةً رُضَّ رَأْسُهَا بَيْنَ حَجَرَيْنِ فَقِيلَ لَهَا مَنْ فَعَلَ بِكِ هَذَا أَفُلَانٌ أَفُلَانٌ حَتَّى سُمِّيَ الْيَهُودِيُّ فَأَوْمَأَتْ بِرَأْسِهَا فَبُعِثَ إِلَيْهِ فَجِيءَ بِهِ فَاعْتَرَفَ فَأَمَرَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُضَّ رَأْسُهُ بَيْنَ حَجَرَيْنِ",
                "id": "Telah mengabarkan kepada kami ['Affan] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] dari [Anas] bahwa seorang wanita dijepit kepalanya diantara dua bongkah batu. Kemudian ia ditanya; \"Siapakah yang melakukan hal ini kepadamu? Apakah Fulan? Apakah Fulan?, \" Hingga disebutkan seorang Yahudi, wanita itu pun menganggukkan kepalanya. Lalu seorang utusan dikirim untuk menemui orang Yahudi itu, lalu ia didatangkan. Setelah Yahudi itu mengaku, maka Nabi shallallahu 'alaihi wasallam memerintahkan supaya kepalanya dijepit di antara dua bongkah batu.\""
            },
            {
                "number": 1895,
                "arab": " أَخْبَرَنَا إِسْحَقُ أَخْبَرَنَا جَرِيرٌ عَنْ مُطَرِّفٍ عَنْ الشَّعْبِيِّ عَنْ أَبِي جُحَيْفَةَ قَالَ قُلْتُ لِعَلِيٍّ يَا أَمِيرَ الْمُؤْمِنِينَ هَلْ عَلِمْتَ شَيْئًا مِنْ الْوَحْيِ إِلَّا مَا فِي كِتَابِ اللَّهِ تَعَالَى قَالَ لَا وَالَّذِي فَلَقَ الْحَبَّةَ وَبَرَأَ النَّسَمَةَ مَا أَعْلَمُهُ إِلَّا فَهْمًا يُعْطِيهِ اللَّهُ الرَّجُلَ فِي الْقُرْآنِ وَمَا فِي الصَّحِيفَةِ قُلْتُ وَمَا فِي الصَّحِيفَةِ قَالَ الْعَقْلُ وَفِكَاكُ الْأَسِيرِ وَلَا يُقْتَلُ مُسْلِمٌ بِمُشْرِكٍ",
                "id": "Telah mengabarkan kepada kami [Ishaq] telah mengabarkan kepada kami [Jarir] dari [Mutharrif] dari [Asy Sya'bi] dari [Abu Juhaifah] ia berkata; aku berkata kepada [Ali]; \"Wahai amirul mukminin, apakah anda mengetahui sesuatu dari wahyu selain yang ada dalam Kitabullah Ta'ala?\" Dia menjawab; \"Tidak, demi Dzat yang menumbuhkan biji, dan menciptakan jiwa, kecuali pemahaman yang Allah berikan kepada seseorang mengenai Al Qur'an, dan apa yang ada dalam lembaran ini.\" Aku berkata; \"Apa yang ada dalam lembaran tersebut?, \" Dia berkata; \"Isinya adalah diyat, pembebasan tawanan, dan seorang muslim tidak dibunuh lantaran (membunuh) orang musyrik.\""
            },
            {
                "number": 1896,
                "arab": " أَخْبَرَنَا جَعْفَرُ بْنُ عَونٍ عَنْ إِسْمَعِيلَ بْنِ مُسْلِمٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُقَامُ الْحُدُودُ فِي الْمَسَاجِدِ وَلَا يُقَادُ بِالْوَلَدِ الْوَالِدُ",
                "id": "Telah mengabarkan kepada kami [Ja'far bin 'Aun] dari [Isma'il bin Muslim] dari ['Amr bin Dinar] dari [Thawus] dari [Ibnu Abbas] ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Hukuman had tidak boleh ditegakkan di dalam masjid, dan tidak ada qishash orang tua terhadap anaknya.\""
            },
            {
                "number": 1897,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَهُ جَدَعْنَاهُ قَالَ ثُمَّ نَسِيَ الْحَسَنُ هَذَا الْحَدِيثَ وَكَانَ يَقُولُ لَا يُقْتَلُ حُرٌّ بِعَبْدٍ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin 'Amir] dari [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Samurah bin Jundub] bahwa Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa membunuh seorang budak, maka kami akan membunuhnya, dan barangsiapa memotong hidungnya, maka kami akan memotong hidungnya.\" Perawi berkata; kemudian Al Hasan lupa hadits ini, dahulu ia mengatakan; \"Orang yang meredeka tidak dibunuh lantara (membunuh) seorang budak.\""
            },
            {
                "number": 1898,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ الْهَمْدَانِيُّ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عَوْفٍ عَنْ حَمْزَةَ أَبِي عُمَرَ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ الْحَضْرَمِيِّ عَنْ أَبِيهِ وَائِلِ بْنِ حُجْرٍ قَالَ شَهِدْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ أُتِيَ بِالرَّجُلِ الْقَاتِلِ يُقَادُ فِي نِسْعَةٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِوَلِيِّ الْمَقْتُولِ أَتَعْفُو قَالَ لَا قَالَ فَتَأْخُذُ الدِّيَةَ قَالَ لَا قَالَ فَتَقْتُلُهُ قَالَ نَعَمْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّكَ إِنْ عَفَوْتَ عَنْهُ فَإِنَّهُ يَبُوءُ بِإِثْمِكَ وَإِثْمِ صَاحِبِكَ قَالَ فَتَرَكَهُ قَالَ فَأَنَا رَأَيْتُهُ يَجُرُّ نِسْعَتَهُ قَدْ عَفَا عَنْهُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah Al Hamdani] telah menceritakan kepada kami [Abu Usamah] dari ['Auf] dari [Hamzah Abu Umar] dari ['Alqamah bin Wa`il Al Hadhrami] dari ayahnya yaitu [Wa`il bin Hujr] ia berkata; \"Aku menyaksikan Nabi shallallahu 'alaihi wasallam ketika didatangkan seorang pembunuh yang dituntun oleh keluarga terbunuh dalam keadaan terikat. Kemudian Rasulullah shallallahu 'alaihi wasallam bertanya kepada wali korban itu: \"Apakah engkau mema'afkan?\" Ia berkata; \"Tidak.\" Beliau bersabda: \"Apakah engkau meminta tebusan?\" Ia berkata; \"Tidak.\" Beliau bersabda: \"Apakah engkau akan membunuhnya?\" Ia berkata; \"Ya.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya engkau memaafkannya, maka ia akan membawa dosamu dan dosa sahabatmu.\" Wa`il bin Hujr berkata; \"Kemudian wali korban membiarkannya. Wa`il berkata; \"Setelah itu aku melihat orang yang membunuh menarik tali kekangnya dan wali orang yang dibunuh tersebut telah mema'afkannya.\""
            },
            {
                "number": 1899,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ فِرَاسٍ عَنْ الشَّعْبِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْكَبَائِرُ الْإِشْرَاكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ وَقَتْلُ النَّفْسِ شُعْبَةُ الشَّاكُّ أَوْ الْيَمِينُ الْغَمُوسُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Firas] dari [Asy Sya'bi] dari [Abdullah bin 'Amr] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Dosa-dosa besar adalah mensekutukan Allah, durhaka kepada kedua orang tua, dan membunuh jiwa.\" -Syu'bah ragu dengan redaksi haditsnya- Atau sumpah palsu.\""
            },
            {
                "number": 1900,
                "arab": " حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي قِلَابَةَ عَنْ ثَابِتِ بْنِ الضَّحَّاكِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَعْنُ الْمُؤْمِنِ كَقَتْلِهِ وَمَنْ قَتَلَ نَفْسَهُ بِشَيْءٍ فِي الدُّنْيَا عُذِّبَ بِهِ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Abu Qilabah] dari [Tsabit bin Adh Dhahhak] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Melaknat seorang mukmin seperti membunuhnya, barangsiapa bunuh diri dengan sesuatu di Dunia, maka ia disiksa dengan alat tersebut pada Hari Kiamat.\""
            },
            {
                "number": 1901,
                "arab": " حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَتَلَ نَفْسَهُ بِحَدِيدَةٍ فَحَدِيدَتُهُ فِي يَدِهِ يَتَوَجَّأُ بِهَا فِي بَطْنِهِ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا وَمَنْ قَتَلَ نَفْسَهُ بِسُمٍّ فَسُمُّهُ فِي يَدِهِ يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا وَمَنْ تَرَدَّى مِنْ جَبَلٍ فَقَتَلَ نَفْسَهُ فَهُوَ يَتَرَدَّى فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا",
                "id": "Telah menceritakan kepada kami [Ya'la bin 'Ubaid] telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dan barangsiapa bunuh diri dengan (menusuk dirinya dengan) besi, maka besi itu akan ada di tangannya, dan ia akan menghujamkan ke perutnya di neraka jahannam, ia kekal dan abadi di dalamnya selama-lamanya. Barangsiapa menegak racun, hingga meninggal dunia, maka racun tersebut akan berada di tangannya, dan ia akan menegaknya di neraka jahannam, ia kekal serta abadi di dalamnya selama-lamanya. Barangsiapa menjatuhkan diri dari gunung, hingga mmebunuh jiwanya (bunuh diri), maka ia akan jatuh ke neraka jahannam, ia kekal serta abadi di dalamnya selama-lamanya.\""
            },
            {
                "number": 1902,
                "arab": " حَدَّثَنَا مُعَاذُ بْنُ هَانِئٍ حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ قَتَلَ رَجُلٌ رَجُلًا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِيَتَهُ اثْنَيْ عَشَرَ أَلْفًا فَذَلِكَ قَوْلُهُ { وَمَا نَقَمُوا إِلَّا أَنْ أَغْنَاهُمْ اللَّهُ وَرَسُولُهُ مِنْ فَضْلِهِ } بِأَخْذِهِمْ الدِّيَةَ",
                "id": "Telah menceritakan kepada kami [Mu'adz bin Hani`] telah menceritakan kepada kami [Muhammad bin Muslim] telah menceritakan kepada kami ['Amr bin Dinar] dari [Ikrimah] dari [Ibnu Abbas], ia berkata; \"Seorang laki-laki membunuh laki-laki lain pada masa Rasulullah shallallahu 'alaihi wasallam. Kemudian Nabi shallallahu 'alaihi wasallam menetapkan bahwa diyatnya dua belas ribu. Yang demikian itu adalah firman Allah Dan mereka tidak mencela (Allah dan Rasul-Nya), kecuali karena Allah dan Rasul-Nya telah melimpahkan karunia-Nya kepada mereka. QS At Taubah; 74, Yaitu dalam masalah pengambilan diyat."
            },
            {
                "number": 1903,
                "arab": " حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ وَعَلَى أَهْلِ الذَّهَبِ أَلْفُ دِينَارٍ",
                "id": "Telah menceritakan kepada kami [Al Hakam] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Sulaiman bin Daud] ia berkata; telah menceritakan kepadaku [Az Zuhri] dari [Abu Bakr bin Muhammad bin 'Amar bin Hazm] dari [Ayahnya] dari [Kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam telah menulis surat kepada penduduk Yaman: \".... dan atas para pemilik emas seribu dinar.\""
            },
            {
                "number": 1904,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ حَدَّثَنِي الزُّهْرِيُّ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ مِنْ مُحَمَّدٍ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى شُرَحْبِيلَ بْنِ عَبْدِ كُلَالٍ وَالْحَارِثِ بْنِ عَبْدِ كُلَالٍ وَنُعَيْمِ بْنِ عَبْدِ كُلَالٍ قِيَلِ ذِي رُعَيْنٍ وَمَعَافِرَ وَهَمَدَانَ فَكَانَ فِي كِتَابِهِ وَإِنَّ فِي النَّفْسِ الدِّيَةَ مِائَةٌ مِنْ الْإِبِلِ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Sulaiman bin Daud] telah menceritakan kepadaku [Az Zuhri] dari [Abu Bakr bin Muhammad bin 'Amru bin Hazm] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam pernah menulis (surat) kepada penduduk Yaman: \"BISMILLAAHIR RAHMAANIR RAHIIM dari Muhmammad seorang Nabi shallallahu 'alaihi wasallam, kepada Syurahbil bin Abdu Kulal dan Al Harits bin Abdul Kulal serta Nu'aim bin Abdul Kulal di Qail Ru'ain, Ma'afir dan Hamadan..\" -Dan diantara isi surat tersebut adalah- \".... bahwa untuk jiwa, diyatnya seratus ekor unta.\""
            },
            {
                "number": 1905,
                "arab": " حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ حَدَّثَنِي الزُّهْرِيُّ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ وَكَانَ فِي كِتَابِهِ وَفِي الْأَنْفِ إِذَا أُوعِبَ جَدْعُهُ الدِّيَةُ وَفِي اللِّسَانِ الدِّيَةُ وَفِي الشَّفَتَيْنِ الدِّيَةُ وَفِي الْبَيْضَتَيْنِ الدِّيَةُ وَفِي الذَّكَرِ الدِّيَةُ وَفِي الصُّلْبِ الدِّيَةُ وَفِي الْعَيْنَيْنِ الدِّيَةُ وَفِي الرِّجْلِ الْوَاحِدَةِ نِصْفُ الدِّيَةِ وَفِي الْمَأْمُومَةِ ثُلُثُ الدِّيَةِ وَفِي الْجَائِفَةِ ثُلُثُ الدِّيَةِ وَفِي الْمُنَقِّلَةِ خَمْسَ عَشَرَةَ مِنْ الْإِبِلِ",
                "id": "Telah menceritakan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Sulaiman bin Daud] telah menceritakan kepadaku [Az Zuhri] dari [Abu Bakr bin Muhammad bin 'Amr bin Hazm] dari [Ayahnya] dari [Kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam pernah menulis surat kepada penduduk Yaman, dan diantara isi suratnya adalah, \".....untuk hidung apabila dipotong, semuanya adalah satu diyat, untuk lidah satu diyat, untuk dua bibir satu diyat, dua buah pelir satu diyat, penis satu diyat, tulang belakang satu diyat, dua mata satu diyat, satu kaki setengah diyat, luka yang sampai kepada otak, sepertiga diyat, luka dalam sepertiga diyat, tulang retak dan bergeser lima belas unta.\""
            },
            {
                "number": 1906,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ حَجَّاجٍ عَنْ زَيْدِ بْنِ جُبَيْرٍ عَنْ خِشْفِ بْنِ مَالِكٍ عَنْ عَبْدِ اللَّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَعَلَ الدِّيَةَ فِي الْخَطَإِ أَخْمَاسًا",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Hajjaj] dari [Zaid bin Jubair] dari [Khisyf bin Malik] dari [Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam menjadikan diyat karena tidak disengaja adalah akhmas.\" "
            },
            {
                "number": 1907,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الرِّفَاعِيُّ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ عَنْ أَبِيهِ عَنْ قَتَادَةَ عَنْ أَبِي نَضْرَةَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّ عَبْدًا لِأُنَاسٍ فُقَرَاءَ قَطَعَ يَدَ غُلَامٍ لِأُنَاسٍ أَغْنِيَاءَ فَأَتَى أَهْلُهُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهُ لِأُنَاسٍ فُقَرَاءَ فَلَمْ يَجْعَلْ عَلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yazid Ar Rifa'i] telah menceritakan kepadaku [Mu'adz bin Hisyam] dari [Ayahnya] dari [Qatadah] dari [Abu Nadhrah] dari [Imran bin Hushain] bahwa seorang budak orang fakir telah memotong tangan budak orang kaya, kemudian pemiliknya datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; \"Wahai Rasulullah, sesungguhnya budak itu milik orang-orang fakir. Kemudian Nabi shallallahu 'alaihi wasallam tidak memberikan padanya sesuatupun.\""
            },
            {
                "number": 1908,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ حَدَّثَنَا شُعْبَةُ عَنْ غَالِبٍ التَّمَّارِ عَنْ مَسْرُوقِ بْنِ أَوْسٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْأَصَابِعُ سَوَاءٌ قَالَ فَقُلْتُ عَشْرٌ عَشْرٌ قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Nu'aim] telah menceritakan kepada kami [Syu'bah] dari [Ghalib At Tammar] dari [Masruq bin Aus] dari [Abu Musa Al Asy'ari] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Ini dan ini adalah sama.\" Kemudian aku berkata; \"Sepuluh, sepuluh?.\" Beliau bersabda: \"Ya.\""
            },
            {
                "number": 1909,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هَذَا وَهَذَا سَوَاءٌ وَقَالَ بِخِنْصِرِهِ وَإِبْهَامِهِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] dari [Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ini dan ini adalah sama.\" Beliau memberi isyarat dengan menunjukkan jari kelingking dan ibu jari beliau.\""
            },
            {
                "number": 1910,
                "arab": " حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ حَدَّثَنِي الزُّهْرِيُّ حَدَّثَنِي أَبُو بَكْرِ بْنُ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ وَفِي كُلِّ إِصْبَعٍ مِنْ أَصَابِعِ الْيَدِ وَالرِّجْلِ عَشْرٌ مِنْ الْإِبِلِ",
                "id": "Telah menceritakan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Sulaiman bin Daud] telah menceritakan kepadaku [Az Zuhri] telah menceritakan kepadaku [Abu Bakr bin Muhammad bin 'Amr bin Hazm] dari [Ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam menulis surat kepada penduduk Yaman, \".... dan untuk setiap jari dari jari-jari tangan dan kaki sepuluh unta.\""
            },
            {
                "number": 1911,
                "arab": " أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدَةُ عَنْ سَعِيدٍ عَنْ مَطَرٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَوَاضِحِ خَمْسًا خَمْسًا مِنْ الْإِبِلِ",
                "id": "Telah mengabarkan kepada kami [Utsman bin Muhammad] telah menceritakan kepada kami ['Abdah] dari [Sa'id] dari [Mathar] dari ['Amr bin Syu'aib] dari [Ayahnya] dari [Kakeknya], ia berkata; Rasulullah shallallahu 'alaihi wasallam memutuskan untuk luka dalam hingga terlihat tulangnya adalah denda lima, yaitu lima ekor unta.\""
            }
        ]
    }
}