{
    "status": true,
    "data": {
        "start": 1030,
        "end": 1176,
        "total": 147,
        "book": "darimi",
        "hadits": [
            {
                "number": 1030,
                "arab": " أَخْبَرَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةٌ فِي مَسْجِدِي هَذَا أَفْضَلُ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ إِلَّا الْمَسْجِدَ الْحَرَامَ",
                "id": "Telah mengabarkan kepada kami [Musaddad] telah menceritakan kepada kami [Bisyr bin Al Mufadldlal] telah menceritakan kepada kami ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat di masjidku ini lebih baik dari sholat seribu kali di tempat yang lain, kecuali Masjid Al Haram.\""
            },
            {
                "number": 1031,
                "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةٌ فِي مَسْجِدِي هَذَا أَفْضَلُ مِنْ أَلْفِ صَلَاةٍ فِيمَا سِوَاهُ إِلَّا الْمَسْجِدَ الْحَرَامَ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] Telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Az Zuhri] dari [Sa'id? bin Al Musayyab] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"sholat di masjidku ini lebih baik dari sholat seribu kali di tempat yang lain, kecuali Masjid Al Haram.\""
            },
            {
                "number": 1032,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُشَدُّ الرِّحَالُ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ الْكَعْبَةِ وَمَسْجِدِي هَذَا وَمَسْجِدِ الْأَقْصَى",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] Telah menceritakan kepada kami [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh diniatkan bepergian untuk beribadah kecuali ke tiga masjid; Ka'bah, masjidku ini, dan Masjid Al Aqsha.\""
            },
            {
                "number": 1033,
                "arab": " حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ جُنَادَةَ عَنْ مَكْحُولٍ عَنْ أَبِي إِدْرِيسَ عَنْ أَبِي الدَّرْدَاءِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ مَشَى فِي ظُلْمَةِ لَيْلٍ إِلَى صَلَاةٍ آتَاهُ اللَّهُ نُورًا يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Zakaria bin Adi] dari ['ubaidhullah bin 'Amru] dari [Zaid bin Abu Unaisah] dari [Junadah] dari [Makhul] dari [Abu Idris] dari [Abu Ad Darda`] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa berjalan dalam kegelapan malam untuk melaksanakan sholat, maka Allah akan memberikan kepadanya cahaya pada Hari Kiamat.\""
            },
            {
                "number": 1034,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ سَمِعْتُ أَبَا الْأَحْوَصِ يُحَدِّثُ عَنْ ابْنِ الْمُسَيَّبِ أَنَّ أَبَا ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزَالُ اللَّهُ مُقْبِلًا عَلَى الْعَبْدِ مَا لَمْ يَلْتَفِتْ فَإِذَا صَرَفَ وَجْهَهُ انْصَرَفَ عَنْهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] ia berkata, saya mendengar [Abu Al Ahwash] menceritakan dari [Ibnu Al Musayyab] bahwa [Abu Dzar] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah senantiasa menghadap ke arah seorang hamba selama ia tidak menoleh, apabila ia memalingkan wajahnya maka Allah berpaling darinya.\" "
            },
            {
                "number": 1035,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ عَنْ عَلِيٍّ الْأَزْدِيِّ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ اللَّيْثِيِّ عَنْ عَبْدِ اللَّهِ بْنِ حُبْشِيٍّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ أَيُّ الْأَعْمَالِ أَفْضَلُ قَالَ إِيمَانٌ لَا شَكَّ فِيهِ وَجِهَادٌ لَا غُلُولَ فِيهِ وَحَجَّةٌ مَبْرُورَةٌ قِيلَ فَأَيُّ الصَّلَاةِ أَفْضَلُ قَالَ طُولُ الْقِيَامِ قِيلَ فَأَيُّ الصَّدَقَةِ أَفْضَلُ قَالَ جُهْدُ مُقِلٍّ قِيلَ فَأَيُّ الْهِجْرَةِ أَفْضَلُ قَالَ أَنْ تَهْجُرَ مَا حَرَّمَ اللَّهُ عَلَيْكَ قِيلَ فَأَيُّ الْجِهَادِ أَفْضَلُ قَالَ مَنْ جَاهَدَ الْمُشْرِكِينَ بِمَالِهِ وَنَفْسِهِ قِيلَ فَأَيُّ الْقَتْلِ أَشْرَفُ قَالَ مَنْ عُقِرَ جَوَادُهُ وَأُهْرِيقَ دَمُهُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Hajjaj bin Muhammad] ia berkata, [Ibnu Juraij] berkata, telah mengabarkan kepadaku [Utsman bin Abu Sulaiman] dari [Ali Al Azdi] dari ['Ubaid bin 'Umair Al Laitsi] dari [Abdullah bin Hubsyi], bahwa Nabi shallallahu 'alaihi wasallam ditanya, \"Amalan apakah yang paling utama?\" Beliau menjawab: \"Keimanan yang tidak ada keraguan padanya, jihad yang tidak ada kecurangan padanya, dan haji yang mabrur.\" Beliau ditanya lagi, \"sholat apakah yang paling utama?\" Beliau menjawab: \"sholat yang lama.\" Beliau ditanya lagi, \"Sedekah apakah yang paling utama?\" Beliau menjawab: \"Membantu orang miskin.\" Beliau ditanya lagi, \"Hijrah apakah yang paling utama?\" Beliau menjawab: \"Engkau meninggalkan apa yang Allah haramkan kepadamu.\" Beliau ditanya lagi, \"Jihad apakah yang paling utama?\" Beliau menjawab: \"Orang yang memerangi orang-orang musyrik dengan harta dan jiwanya.\" Beliau ditanya lagi, \"Kematian apakah yang paling mulia?\" Beliau menjawab: \"Orang yang kudanya disembelih dan darahnya ditumpahkan (mati syahiud).\""
            },
            {
                "number": 1036,
                "arab": " حَدَّثَنَا عَفَّانُ أَخْبَرَنَا هَمَّامٌ عَنْ أَبِي جَمْرَةَ عَنْ أَبِي بَكْرِ بْنِ أَبِي مُوسَى عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى الْبَرْدَيْنِ دَخَلَ الْجَنَّةَ قِيلَ لِأَبِي مُحَمَّدٍ مَا الْبَرْدَيْنِ قَالَ الْغَدَاةُ وَالْعَصْرُ",
                "id": "Telah menceritakan kepada kami ['Affan] telah mengabarkan kepada kami [Hammam] dari [Abu Jamrah] dari [Abu Bakr bin Abu Musa] dari [Ayahnya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa melakukan sholat bardain maka ia masuk Surga.\" Abu Muhammad ditanya, \"Apakah sholat bardain itu? Ia menjawab, \"Subuh dan asar.\" "
            },
            {
                "number": 1037,
                "arab": " أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي أُسَيْدٍ عَنْ جَدِّهِ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى الصُّبْحَ فَهُوَ فِي جِوَارِ اللَّهِ فَلَا تُخْفِرُوا اللَّهَ فِي جَارِهِ وَمَنْ صَلَّى الْعَصْرَ فَهُوَ فِي جِوَارِ اللَّهِ فَلَا تُخْفِرُوا اللَّهَ فِي جَارِهِ قَالَ أَبُو مُحَمَّد إِذَا أُمِّنَ وَلَمْ يَفِ فَقَدْ غَدَرَ وَأَخْفَرَ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Ibrahim bin Abu Usaid] dari [Kakeknya] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam berkata: \"Barangsiapa melakukan sholat subuh maka ia berada di samping Allah, maka janganlah kalian mencabut janji Allah pada orang yang ada di samping-Nya. Dan barangsiapa melakukan sholat asar maka ia berada di samping Allah, maka janganlah kalian mencabut janji Allah pada orang yang ada di samping-Nya.\" Abu Muhammad berkata, \"Apabila diberi keamanan kemudian tidak menepati janji maka sungguh ia telah mengingkari dan menjabut janji.\""
            },
            {
                "number": 1038,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ كُنَاسَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْأَرْقَمِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا حَضَرَتْ الصَّلَاةُ وَأَرَادَ الرَّجُلُ الْخَلَاءَ فَابْدَأْ بِالْخَلَاءِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Kunasah] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari [Abdullah bin Al Arqam] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika waktu sholat telah tiba lalu ada yang ingin membuang hajat, maka hendaklah ia dahulukan untuk buang hajat.\" "
            },
            {
                "number": 1039,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو خَالِدٍ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُصَلِّيَ الرَّجُلُ مُخْتَصِرًا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abu Khalid] dari [Hisyam] dari [Ibnu Sirin] dan [Abu Hurairah] Ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang seorang laki-laki sholat sambil menahan keinginan untuk buang hajat.\""
            },
            {
                "number": 1040,
                "arab": " أَخْبَرَنَا حَفْصُ بْنُ عُمَرَ الْحَوْضِيُّ حَدَّثَنَا شُعْبَةُ عَنْ سَيَّارٍ أَبِي الْمِنْهَالِ الرِّيَاحِيِّ عَنْ أَبِي بَرْزَةَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْرَهُ النَّوْمَ قَبْلَ الْعِشَاءِ وَالْحَدِيثَ بَعْدَهَا",
                "id": "Telah mengabarkan kepada kami [Hafsh bin Umar Al Haudli] telah menceritakan kepada kami [Syu'bah] dari [Sayyar Abu Al Minhal Ar Riyahi] dari [Abu Barzah] ia berkata, \"Nabi shallallahu 'alaihi wasallam membenci tidur sebelum sholat isya dan berbicara setelahnya.\""
            },
            {
                "number": 1041,
                "arab": " أَخْبَرَنَا بِشْرُ بْنُ ثَابِتٍ الْبَزَّارُ حَدَّثَنَا شُعْبَةُ عَنْ الْمُغِيرَةِ عَنْ الشَّعْبِيِّ عَنْ الْمُحَرَّرِ بْنِ أَبِي هُرَيْرَةَ عَنْ أَبِيهِ قَالَ كُنْتُ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ لَمَّا بَعَثَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَادَى بِأَرْبَعٍ حَتَّى صَهَلَ صَوْتُهُ أَلَا إِنَّهُ لَا يَدْخُلُ الْجَنَّةَ إِلَّا نَفْسٌ مُؤْمِنَةٌ وَلَا يَحُجَّنَّ بَعْدَ الْعَامِ مُشْرِكٌ وَلَا يَطُوفُ بِالْبَيْتِ عُرْيَانٌ وَمَنْ كَانَ بَيْنَهُ وَبَيْنَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَهْدٌ فَإِنَّ أَجَلَهُ إِلَى أَرْبَعَةِ أَشْهُرٍ فَإِذَا مَضَتْ الْأَرْبَعَةُ فَإِنَّ اللَّهَ بَرِيءٌ مِنْ الْمُشْرِكِينَ وَرَسُولُهُ",
                "id": "Telah mengabarkan kepada kami [Bisyr bin Tsabit Al Bazzar] telah menceritakan kepada kami [Syu'bah] dari [Al Mughirah] dari [Asy Sya'bi] dari [Al Muharrir bin Abu Hurairah] dari [Ayahnya] ia berkata, \"Aku bersama [Ali bin Abu Thalib] saat Rasulullah shallallahu 'alaihi wasallam mengutusnya untuk menyerukan empat hal sehingga suaranya serak, yaitu, \"Ketahuilah, tidak akan masuk surga kecuali jiwa mukmin, setelah tahun ini orang musyrik tidak boleh menunaikan ibadah haji, orang yang telanjang tidak boleh melakukan tawaf di Ka'bah, dan barangsiapa memiliki perjanjian antara dirinya dan Rasulullah shallallahu 'alaihi wasallam, maka temponya adalah empat bulan. Jika telah berlalu empat bulan, maka sesungguhnya Allah dan rasulNya berlepas diri dari orang-orang musyrik.\" "
            },
            {
                "number": 1042,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ الْحُمَيْدِيُّ حَدَّثَنَا حَرْمَلَةُ بْنُ عَبْدِ الْعَزِيزِ بْنِ الرَّبِيعِ بْنِ سَبْرَةَ بْنِ مَعْبَدٍ الْجُهَنِيُّ حَدَّثَنِي عَمِّي عَبْدُ الْمَلِكِ بْنُ الرَّبِيعِ بْنِ سَبْرَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلِّمُوا الصَّبِيَّ الصَّلَاةَ ابْنَ سَبْعِ سِنِينَ وَاضْرِبُوهُ عَلَيْهَا ابْنَ عَشْرٍ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Az Zubair Al Humaidi] telah menceritakan kepada kami [Harmalah bin Abdul Aziz bin Ar Rabi' bin Sabrah bin Ma'bad Al Juhani] telah menceritakan kepadaku pamanku [Abdul Malik bin Ar Rabi' bin Sabrah] dari [Ayahnya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ajarkan anak kecil sholat saat berumur tujuh tahun, dan pukullah karena meninggalkannya saat berumur sepuluh tahun\""
            },
            {
                "number": 1043,
                "arab": " أَخْبَرَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا مُوسَى بْنُ عَلِيٍّ قَالَ سَمِعْتُ أَبِي قَالَ سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ قَالَ ثَلَاثُ سَاعَاتٍ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَانَا أَنْ نُصَلِّيَ فِيهِنَّ أَوْ أَنْ نَقْبُرَ فِيهِنَّ مَوْتَانَا حِينَ تَطْلُعُ الشَّمْسُ بَازِغَةً حَتَّى تَرْتَفِعَ وَحِينَ يَقُومُ قَائِمُ الظَّهِيرَةِ حَتَّى تَمِيلَ الشَّمْسُ وَحِينَ تَضَيَّفُ الشَّمْسُ لِلْغُرُوبِ حَتَّى تَغْرُبَ",
                "id": "Telah mengabarkan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Musa bin Ali] ia berkata, saya mendengar [Ayahku] berkata, aku mendengar ['Uqbah bin 'Amir] berkata, \"Ada tiga waktu yang Rasulullah shallallahu 'alaihi wasallam melarang kami mengerjakan sholat, atau menguburkan jenazah di dalamnya; ketika matahari terbit hingga meninggi, saat seseorang berdiri dan matahari tepat di atas kepala hingga condong ke arah barat, dan ketika matahari cenderung untuk tenggelam hingga matahari tersebut tenggelam.\" "
            },
            {
                "number": 1044,
                "arab": " أَخْبَرَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَبِي الْعَالِيَةِ عَنْ ابْنِ عَبَّاسٍ قَالَ حَدَّثَنِي رِجَالٌ مَرْضِيُّونَ فِيهِمْ عُمَرُ بْنُ الْخَطَّابِ وَأَرْضَاهُمْ عِنْدِي عُمَرُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا صَلَاةَ بَعْدَ صَلَاةِ الصُّبْحِ حَتَّى تَطْلُعَ الشَّمْسُ وَلَا صَلَاةَ بَعْدَ صَلَاةِ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ",
                "id": "Telah mengabarkan kepada kami [Affan] telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Abu Al 'Aliyah] dari [Ibnu Abbas] berkata, telah menceritakan kepadaku orang-orang yang diridlai, yang di antarannya adalah [Umar bin Al Khathab] -dan di antara mereka yang paling diridlai menurutku adalah Umar-, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada sholat setelah sholat subuh hingga matahari terbit, dan tidak ada sholat setelah sholat asar hingga Telah memberitakan kepada kami Matahari tenggelam.\"."
            },
            {
                "number": 1045,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ الرَّبِيعِ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَالَ سَمِعْتُ الْأَسْوَدَ بْنَ يَزِيدَ وَمَسْرُوقًا يَشْهَدَانِ عَلَى عَائِشَةَ أَنَّهَا شَهِدَتْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ لَمْ يَكُنْ عِنْدَهَا يَوْمًا إِلَّا صَلَّى هَاتَيْنِ الرَّكْعَتَيْنِ قَالَ أَبُو مُحَمَّد تَعْنِي بَعْدَ الْعَصْرِ",
                "id": "Telah mengabarkan kepada kami [Sa'id? bin Ar Rabi'] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] ia berkata, saya mendengar [Al Aswad bin Yazid] dan [Masruq] bersaksi atas [Aisyah], bahwa ia berkata; ersaksi atas Rasulullah shallallahu 'alaihi wasallam, bahwa tidak sehari pun Rasulullah berada di sisinya kecuali beliau selalu mengerjakan sholat dua rakaat ini.\" Abu Muhammad berkata, \"(Yaitu) dua rakaat setelah asar.\" "
            },
            {
                "number": 1046,
                "arab": " أَخْبَرَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ مَا تَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ بَعْدَ الْعَصْرِ قَطُّ",
                "id": "Telah mengabarkan kepada kami [Farwah bin Abu Al Maghra`] telah menceritakan kepada kami [Ali bin Mushir] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak pernah meninggalkan dua rakaat setelah asar.\" "
            },
            {
                "number": 1047,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عِيسَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ وَعَبْدَ الرَّحْمَنِ بْنَ أَزْهَرَ وَالْمِسْوَرَ بْنَ مَخْرَمَةَ أَرْسَلُوهُ إِلَى عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا اقْرَأْ عَلَيْهَا السَّلَامَ مِنَّا جَمِيعًا وَسَلْهَا عَنْ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ وَقُلْ إِنَّا أُخْبِرْنَا أَنَّكِ تُصَلِّينَهُمَا وَقَدْ بَلَغَنَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهُمَا قَالَ ابْنُ عَبَّاسٍ وَكُنْتُ أَضْرِبُ مَعَ عُمَرَ بْنِ الْخَطَّابِ النَّاسَ عَلَيْهِمَا قَالَ كُرَيْبٌ فَدَخَلْتُ عَلَيْهَا وَبَلَّغْتُهَا مَا أَرْسَلُونِي بِهِ فَقَالَتْ سَلْ أُمَّ سَلَمَةَ فَخَرَجْتُ إِلَيْهِمْ فَأَخْبَرْتُهُمْ بِقَوْلِهَا فَرَدُّونِي إِلَى أُمِّ سَلَمَةَ بِمِثْلِ مَا أَرْسَلُونِي إِلَى عَائِشَةَ فَقَالَتْ أُمُّ سَلَمَةَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْهُمَا ثُمَّ رَأَيْتُهُ يُصَلِّيهِمَا أَمَّا حِينَ صَلَّاهُمَا فَإِنَّهُ صَلَّى الْعَصْرَ ثُمَّ دَخَلَ وَعِنْدِي نِسْوَةٌ مِنْ بَنِي حَرَامٍ مِنْ الْأَنْصَارِ فَصَلَّاهُمَا فَأَرْسَلْتُ إِلَيْهِ الْجَارِيَةَ فَقُلْتُ قُومِي بِجَنْبِهِ فَقُولِي أُمُّ سَلَمَةَ تَقُولُ يَا رَسُولَ اللَّهِ أَلَمْ أَسْمَعْكَ تَنْهَى عَنْ هَاتَيْنِ الرَّكْعَتَيْنِ وَأَرَاكَ تُصَلِّيهِمَا فَإِنْ أَشَارَ بِيَدِهِ فَاسْتَأْخِرِي عَنْهُ قَالَتْ فَفَعَلَتْ الْجَارِيَةُ فَأَشَارَ بِيَدِهِ فَاسْتَأْخَرَتْ عَنْهُ فَلَمَّا انْصَرَفَ قَالَ يَا ابْنَةَ أَبِي أُمَيَّةَ سَأَلْتِ عَنْ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ إِنَّهُ أَتَانِي نَاسٌ مِنْ عَبْدِ الْقَيْسِ بِالْإِسْلَامِ مِنْ قَوْمِهِمْ فَشَغَلُونِي عَنْ الرَّكْعَتَيْنِ اللَّتَيْنِ بَعْدَ الظُّهْرِ فَهُمَا هَاتَانِ سُئِلَ أَبُو مُحَمَّد عَنْ هَذَا الْحَدِيثِ فَقَالَ أَنَا أَقُولُ بِحَدِيثِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَلَاةَ بَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ وَلَا بَعْدَ الْفَجْرِ حَتَّى تَطْلُعَ الشَّمْسُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Isa] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku ['Amru bin Al Harits] dari [Bukair bin Al Asyajj] dari [Kuraib] mantan budak Ibnu Abbas, bahwa Abdullah bin Abbas dan Abdurrahman bin Azhar dan Al Miswar bin Makhramah mengirimnya menemui Aisyah, isteri Nabi shallallahu 'alaihi wasallam. Mereka berkata, \"Sampaikan salam kami kepadanya dan tanyakan kepadanya mengenai dua rakaat setelah sholat asar, dan katakanlah, 'Sesungguhnya kami telah mendapatkan berita bahwa engkau melakukan kedua rakaat tersebut, sementara telah sampai kepada kami bahwa Nabi shallallahu 'alaihi wasallam melarang dari keduanya.' Ibnu Abbas berkata, \"Aku dan Umar bin Al Khathab pernah memukul orang-orang karena mengerjakan hal tersebut (sholat setelah asar).\" Kuraib berkata, \"Kemudian aku menemui Aisyah dan menyampaikan kepadanya apa yang dipesankan kepadaku. Kemudian Aisyah berkata, \"Tanyakanlah kepada Ummu Salamah! \" Kemudian aku keluar menemui orang-orang dan mengabarkan kepada mereka tentang jawaban Aisyah. Dan mereka pun menyuruhku untuk menemui Ummu Salamah sebagaimana mereka mengutusku menemui Aisyah. Kemudian [Ummu Salamah] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam melarang dari keduanya, kemudian aku melihat beliau melakukan keduanya. Adapun ketika beliau melakukan keduanya, maka sesungguhnya beliau telah melakukan sholat asar, kemudian beliau masuk menemuiku sementara di sisiku ada beberapa orang wanita dari Bani Haram dari kaum Anshar, kemudian beliau melakukan sholat dua rakaat tersebut. Maka aku pun mengutus seorang budak wanita kepada beliau, dan aku katakan, \"Berdirilah di samping beliau dan katakan, 'Ummu Salamah bertanya, 'Wahai Rasulullah, bukankah saya telah mendengar anda melarang dari melakukan dua rakaat ini? Tetapi kenapa saya melihat melakukan keduanya? Kemudian apabila beliau memberikan isyarat dengan tangannya maka mundurlah darinya.\" Ummu Salamah berkata, \"Kemudian budak wanita itu pun melakukannya, beliau lalu berisyarat dengan tangannya, sehingga budak wanita itu pun mundur dari beliau. Ketika beliau selesai, beliau mengatakan: \"Wahai anak Abu Umayyah, engkau bertanya mengenai dua rakaat setelah asar, sesungguhnya beberapa orang dari Bani Abdul Qais datang kepadaku bersama kaumnya yang telah masuk Islam, sehingga mereka membuatku sibuk dari mengerjakan dua rakaat setelah zhuhur. Maka dua rakaat itu adalah apa yang aku kerjakan sekarang ini.\" Abu Muhammad ditanya mengenai hadits ini, kemudian ia menjawab, \"Aku berpendapat dengan hadits Umar, dari Nabi shallallahu 'alaihi wasallam: \"Tidak ada sholat setelah sholat asar hingga matahari tenggelam, dan tidak ada sholat setelah sholat subuh hingga matahari terbit.\""
            },
            {
                "number": 1048,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي قَبْلَ الظُّهْرِ رَكْعَتَيْنِ وَبَعْدَ الظُّهْرِ رَكْعَتَيْنِ وَبَعْدَ الْمَغْرِبِ رَكْعَتَيْنِ فِي بَيْتِهِ وَبَعْدَ الْعِشَاءِ رَكْعَتَيْنِ وَبَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ فِي بَيْتِهِ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Malik] dari [Nafi'] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam melakukan sholat dua rakaat sebelum dan sesudah sholat zhuhur, setelah maghrib dua rakaat di rumahnya, setelah isya` dua rakaat dan setelah Jum'at dua rakaat di rumahnya.\""
            },
            {
                "number": 1049,
                "arab": " حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ النُّعْمَانِ بْنِ سَالِمٍ قَالَ سَمِعْتُ عَمْرَو بْنَ أَوْسٍ الثَّقَفِيَّ يُحَدِّثُ عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ عَنْ أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا سَمِعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ عَبْدٍ مُسْلِمٍ يُصَلِّي كُلَّ يَوْمٍ ثِنْتَيْ عَشْرَةَ رَكْعَةً تَطَوُّعًا غَيْرَ الْفَرِيضَةِ إِلَّا لَهُ بَيْتٌ فِي الْجَنَّةِ أَوْ بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ قَالَتْ أُمُّ حَبِيبَةَ مَا بَرِحْتُ أُصَلِّيهِنَّ بَعْدُ وَقَالَ عَمْرٌو مِثْلَهُ وَقَالَ النُّعْمَانُ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari [An Nu'man bin Salim] ia berkata, saya mendengar ['Amru bin Aus Ats Tsaqafi] menceritakan dari ['Anbasah bin Abu Sufyan] dari [Ummu Habibah] isteri Nabi shallallahu 'alaihi wasallam, bahwa ia mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang Muslim melakukan sholat setiap hari dua belas rakaat sunnah bukan wajib, kecuali baginya rumah di surga, atau dibangunkan baginya sebuah rumah di surga.\" Ummu Habibah berkata, \"Setelah itu aku tidak pernah meninggalkannya.\" 'Amru menyebutkan seperti itu, dan An Nu'man juga menyebutkan yang seperti itu.\" "
            },
            {
                "number": 1050,
                "arab": " أَخْبَرَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَدَعُ أَرْبَعًا قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ قَبْلَ الْفَجْرِ",
                "id": "Telah mengabarkan kepada kami [Utsman bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Ibrahim bin Muhammad bin Al Muntasyir] dari [Ayahnya] dari [Aisyah radliallahu 'anha] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak meninggalkan sholat empat rakaat sebelum zhuhur dan dua rakaat sebelum Subuh.\""
            },
            {
                "number": 1051,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْجُرَيْرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ لِمَنْ شَاءَ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Al Jurairi] dari [Abdullah bin Buraidah] dari [Abdullah bin Mughaffal] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Antara dua adzan terdapat sholat, antara dua adzan terdapat sholat, antara dua adzan terdapat sholat bagi orang yang menghendaki.\""
            },
            {
                "number": 1052,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ الرَّبِيعِ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ عَامِرٍ قَالَ سَمِعْتُ أَنَسًا قَالَ كَانَ الْمُؤَذِّنُ يُؤَذِّنُ لِصَلَاةِ الْمَغْرِبِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَقُومُ لُبَابُ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَبْتَدِرُونَ السَّوَارِيَ حَتَّى يَخْرُجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُمْ كَذَلِكَ قَالَ وَقَلَّ مَا كَانَ يَلْبَثُ",
                "id": "Telah mengabarkan kepada kami [Sa'id? bin Ar Rabi'] telah menceritakan kepada kami [Syu'bah] dari ['Amru bin 'Amir] ia berkata, saya mendengar [Anas] berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam seorang muadzin mengumandangkan adzan, lalu para sahabat Rasulullah shallallahu 'alaihi wasallam bersegera menuju tiang-tiang masjid, hingga Rasulullah shallallahu 'alaihi wasallam keluar, sementara mereka dalam keadaan demikian.\" 'Amru berkata, \"Tidak lama kemudian beliau melakukan sholat Maghrib.\" "
            },
            {
                "number": 1053,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ هِشَامٍ عَنْ مُحَمَّدٍ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُخْفِي مَا يَقْرَأُ فِيهِمَا وَذَكَرَتْ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ قَالَ سَعِيدٌ فِي رَكْعَتَيْ الْفَجْرِ",
                "id": "Telah mengabarkan kepada kami [Sa'id? bin 'Amir] dari [Hisyam] dari [Muhammad] dari [Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak mengeraskan apa yang beliau baca pada keduanya. Dan Aisyah menyebutkan; QUL YAA AYYUHAL KAAFIRUUN dan QUL HUWALLAAHU AHAD.\" Sa'id berkata, \"Yakni dalam sholat dua rakaat fajar.\" "
            },
            {
                "number": 1054,
                "arab": " حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ حَدَّثَتْنِي حَفْصَةُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي سَجْدَتَيْنِ خَفِيفَتَيْنِ بَعْدَ مَا يَطْلُعُ الْفَجْرُ وَكَانَتْ سَاعَةً لَا أَدْخُلُ فِيهَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [ubaidhullah] telah menceritakan kepadaku [Nafi'] dari [Ibnu Umar] telah menceritakan kepadaku [Hafshah], bahwa Nabi shallallahu 'alaihi wasallam melakukan sholat dua rakaat ringan setelah terbit fajar. Dan itu adalah waktu yang aku tidak menemui Nabi shallallahu 'alaihi wasallam.\" "
            },
            {
                "number": 1055,
                "arab": " حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَكَتَ الْمُؤَذِّنُ مِنْ أَذَانِ الصُّبْحِ وَبَدَا الصُّبْحُ صَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ قَبْلَ أَنْ تُقَامَ الصَّلَاةُ",
                "id": "Telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Ibnu Umar] dari [Hafshah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata, \"Apabila Muadzin selesai dari mengumandangkan adzan dan waktu subuh telah nampak, maka Rasulullah shallallahu 'alaihi wasallam sholat dua rakaat yang ringan sebelum melaksanakan sholat subuh.\" "
            },
            {
                "number": 1056,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ وَأَخْبَرَتْهُ حَفْصَةُ أَنَّهُ كَانَ يُصَلِّي إِذَا أَضَاءَ الصُّبْحُ رَكْعَتَيْنِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad bin Abu Khalaf] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Amr] dari [Az Zuhri] dari [Salim] dari [Ayahnya], bahwa Nabi shallallahu 'alaihi wasallam melakukan sholat setelah Jum'at dua rakaat, dan Hafshah memberitahukan kepadanya bahwa beliau juga melaksanakan sholat dua rakaat jika waktu subuh pagi telah nampak.\" "
            },
            {
                "number": 1057,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ سَالِمٍ أَبِي النَّضْرِ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى الرَّكْعَتَيْنِ قَبْلَ الْفَجْرِ فَإِنْ كَانَتْ لَهُ حَاجَةٌ كَلَّمَنِي بِهَا وَإِلَّا خَرَجَ إِلَى الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Abdullah bin Idris] dari [Malik bin Anas] dari [Salim Abu An Nadlr] dari [Abu Salamah] dari [Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam jika telah selesai mengerjakan sholat dua rakaat sebelum Fajar; bila beliau mempunyai hajat mengatakannya kepadaku, jika tidak maka beliau langsung keluar untuk sholat subuh.\" "
            },
            {
                "number": 1058,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مَا بَيْنَ الْعِشَاءِ إِلَى الْفَجْرِ إِحْدَى عَشْرَةَ رَكْعَةً يُسَلِّمُ فِي كُلِّ رَكْعَتَيْنِ يُوتِرُ بِوَاحِدَةٍ فَإِذَا سَكَتَ الْمُؤَذِّنُ مِنْ الْأَذَانِ الْأَوَّلِ رَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ اضْطَجَعَ حَتَّى يَأْتِيَهُ الْمُؤَذِّنُ فَيَخْرُجُ مَعَهُ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] dari [Ibnu Abu Dzi`b] dari [Az Zuhri] dari ['Urwah] dari [Aisyah] ia berkata, \"Nabi shallallahu 'alaihi wasallam melakukan sholat antara Isya` hingga fajar sebanyak sebelas rakaat, mengucapkan salam setiap dua rakaat dan witir dengan satu rakaat. Kemudian apabila muadzin telah selesai dari adzan pertama, maka beliau melakukan sholat dua rakaat ringan. Kemudian beliau berbaring hingga datang muadzin dan keluar bersamanya.\" "
            },
            {
                "number": 1059,
                "arab": " حَدَّثَنَا أَبُو عَاصِمٍ عَنْ زَكَرِيَّا بْنِ إِسْحَقَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُقِيمَتْ الصَّلَاةُ فَلَا صَلَاةَ إِلَّا الْمَكْتُوبَةُ أَخْبَرَنَا أَبُو حَفْصٍ عَمْرُو بْنُ عَلِيٍّ الْفَلَّاسُ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ وَرْقَاءَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Abu 'Ashim] dari [Zakaria bin Ishaq] dari ['Amru bin Dinar] dari [Sulaiman bin Yasar] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila telah didirikan sholat maka tidak ada sholat kecuali sholat wajib.\" Telah mengabarkan kepada kami [Abu Hafsh 'Amru bin Ali Al Fallas] telah menceritakan kepada kami [Ghundar] dari [Syu'bah] dari [Warqa`] dari ['Amru bin Dinar] dari ['Atha` bin Yasar] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti hadits itu.\" "
            },
            {
                "number": 1060,
                "arab": " حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ حَفْصِ بْنِ عَاصِمِ بْنِ عُمَرَ عَنْ ابْنِ بُحَيْنَةَ قَالَ أُقِيمَتْ الصَّلَاةُ فَرَأَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يُصَلِّي الرَّكْعَتَيْنِ فَلَمَّا قَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاتَهُ لَاثَ بِهِ النَّاسُ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتُصَلِّي الصُّبْحَ أَرْبَعًا",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari [Sa'd bin Ibrahim] dari [Hafsh bin 'Ashim bin Umar] dari [Ibnu Buhainah] ia berkata, \"Ketika sholat telah didirikan Nabi shallallahu 'alaihi wasallam melihat seorang laki-laki melakukan sholat dua rakaat. Maka ketika Nabi shallallahu 'alaihi wasallam telah selesai dari mengerjakan sholat, orang-orang pun mengelilingi beliau. Lalu Nabi shallallahu 'alaihi wasallam berkata kepada orang tersebut: \"Apakah engkau mengerjakan sholat subuh empat rakaat?\""
            },
            {
                "number": 1061,
                "arab": " حَدَّثَنَا مُسْلِمٌ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أُقِيمَتْ الصَّلَاةُ فَلَا صَلَاةَ إِلَّا الْمَكْتُوبَةُ قَالَ أَبُو مُحَمَّد إِذَا كَانَ فِي بَيْتِهِ فَالْبَيْتُ أَهْوَنُ",
                "id": "Telah menceritakan kepada kami [Muslim] telah menceritakan kepada kami [Hammad bin Salamah] dari ['Amru bin Dinar] dari ['Atha` bin Yasar] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau berkata: \"Jika sholat telah didirikan maka tidak ada sholat kecuali sholat wajib.\" Abu Muhammad berkata, \"Apabila ia sholat di rumahnya, maka (sholat di) rumah adalah lebih ringan.\" "
            },
            {
                "number": 1062,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ بُرْدٍ حَدَّثَنِي سُلَيْمَانُ بْنُ مُوسَى عَنْ مَكْحُولٍ عَنْ كَثِيرِ بْنِ مُرَّةَ الْحَضْرَمِيِّ عَنْ قَيْسٍ الْجُذَامِيِّ عَنْ نُعَيْمِ بْنِ هَمَّارٍ الْغَطَفَانِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ اللَّهُ تَعَالَى ابْنَ آدَمَ صَلِّ لِي أَرْبَعَ رَكَعَاتٍ مِنْ أَوَّلِ النَّهَارِ أَكْفِكَ آخِرَهُ",
                "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Mu'tamir bin Sulaiman] dari [Burd] telah menceritakan kepadaku [Sulaiman bin Musa] dari [Makhul] dari [Katsir bin Murrah Al Hadlrami] dari [Qais Al Judzami] dari [Nu'aim bin Hammar Al Ghathafani] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Allah Ta'ala berfirman: 'Wahai anak Adam, sholatlah untukku empat rakaat sejak awal siang, maka akan Aku cukupi kamu hingga sore hari.\" "
            },
            {
                "number": 1063,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ قَالَ عَمْرُو بْنُ مُرَّةَ أَنْبَأَنِي قَالَ سَمِعْتُ ابْنَ أَبِي لَيْلَى يَقُولُ مَا أَخْبَرَنَا أَحَدٌ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الضُّحَى غَيْرُ أُمِّ هَانِئٍ فَإِنَّهَا ذَكَرَتْ أَنَّهُ يَوْمَ فَتْحِ مَكَّةَ اغْتَسَلَ فِي بَيْتِهَا ثُمَّ صَلَّى ثَمَانَ رَكَعَاتٍ قَالَتْ وَلَمْ أَرَهُ صَلَّى صَلَاةً أَخَفَّ مِنْهَا غَيْرَ أَنَّهُ يُتِمُّ الرُّكُوعَ وَالسُّجُودَ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah] berkata, ['Amru bin Murrah] telah memberitakan kepadaku, ia berkata, \"Aku mendengar [Ibnu Abu Laila] berkata, \"Tidak ada seorangpun yang mengabarkan kepada kami bahwa ia pernah melihat Nabi shallallahu 'alaihi wasallam sholat dluha selain Ummu Hani`. Ia menyebutkan bahwa pada saat penaklukan Makkah Rasulullah mandi di rumahnya, setelah itu beliau sholat delapan rakaat. [Ummu Hani`] berkata, \"Aku belum pernah melihat beliau melaksanakan sholat yang lebih ringan darinya, hanya saja beliau menyempurnakan rukuk dan sujud.\" "
            },
            {
                "number": 1064,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا مَالِكٌ عَنْ أَبِي النَّضْرِ أَنَّ أَبَا مُرَّةَ مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ أَخْبَرَهُ أَنَّهُ سَمِعَ أُمَّ هَانِئٍ بِنْتَ أَبِي طَالِبٍ تُحَدِّثُ أَنَّهَا ذَهَبَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ فَوَجَدَتْهُ يَغْتَسِلُ وَفَاطِمَةُ بِنْتُهُ تَسْتُرُهُ بِثَوْبٍ قَالَتْ فَسَلَّمْتُ عَلَيْهِ وَذَلِكَ ضُحًى فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ هَذِهِ فَقُلْتُ أَنَا أُمُّ هَانِئٍ قَالَتْ فَلَمَّا فَرَغَ مِنْ غُسْلِهِ قَامَ فَصَلَّى ثَمَانَ رَكَعَاتٍ مُلْتَحِفًا فِي ثَوْبٍ وَاحِدٍ ثُمَّ انْصَرَفَ فَقُلْتُ يَا رَسُولَ اللَّهِ زَعَمَ ابْنُ أُمِّي أَنَّهُ قَاتِلٌ رَجُلًا أَجَرْتُهُ فُلَانَ بْنَ هُبَيْرَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَجَرْنَا مَنْ أَجَرْتِ يَا أُمَّ هَانِئٍ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Malik] dari [Abu An Nadlar] bahwa [Abu Murrah] mantan budak 'Uqail bin Abu Thalib mengabarkan kepadanya, bahwa ia mendengar [Ummu Hani` binti Abu Thalib] menceritakan kepadanya, bahwa ia pergi menemui Rasulullah shallallahu 'alaihi wasallam pada saat penaklukan Makkah. Kemudian ia mendapati beliau sedang mandi, sementara anaknya, Fatimah menutupinya dengan kain. Ummu Hani` berkata, \"Kemudian aku mengucapkan salam kepadanya, dan itu terjadi pada waktu dluha. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapakah ini?\" Aku lantas menjawab, \"Saya Ummu Hani`\". Ummu Hani` melanjutkan, \"Selesai mandi beliau berdiri dan mengerjakan sholat delapan rakaat dengan hanya mengenakan satu kain, lalu berlalu. Aku lantas berkata, \"Wahai Rasulullah! Anak laki-laki ibuku mengaku bahwa ia akan membunuh seseorang yang telah aku lindungi, yaitu Fulan bin Hubairah.\" Kemudian beliau berkata: \"Kami telah melindungi orang yang engkau lindungi wahai Ummu Hani`.\""
            },
            {
                "number": 1065,
                "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا شُعْبَةُ عَنْ عَبَّاسٍ الْجُرَيْرِيِّ عَنْ أَبِي عُثْمَانَ عَنْ أَبِي هُرَيْرَةَ قَالَ أَوْصَانِي خَلِيلِي بِثَلَاثٍ لَا أَدَعُهُنَّ حَتَّى أَمُوتَ الْوِتْرِ قَبْلَ أَنْ أَنَامَ وَصَوْمِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَمِنْ الضُّحَى رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Syu'bah] dari [Abbas Al Jurairi] dari [Abu Utsman] dari [Abu Hurairah] ia berkata, \"Kekasihku berwasiat kepadaku dengan tiga perkara agar tidak aku tinggalkan hingga aku meninggal; witir sebelum tidur, berpuasa tiga hari setiap bulan, dan melakukan sholat dluha dua rakaat.\""
            },
            {
                "number": 1066,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ مَا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُبْحَةَ الضُّحَى فِي سَفَرٍ وَلَا حَضَرٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Al Auza'i] dari [Az Zuhri] dari ['Urwah] dari [Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak melakukan sholat dluha pada saat bersafar dan bermukim.\" "
            },
            {
                "number": 1067,
                "arab": " حَدَّثَنَا صَدَقَةُ بْنُ الْفَضْلِ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ حَدَّثَنَا شُعْبَةُ عَنْ الْفُضَيْلِ بْنِ فَضَالَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ أَنَّ أَبَاهُ رَأَى أُنَاسًا يُصَلُّونَ صَلَاةَ الضُّحَى فَقَالَ أَمَا إِنَّهُمْ لَيُصَلُّونَ صَلَاةً مَا صَلَّاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا عَامَّةُ أَصْحَابِهِ",
                "id": "Telah menceritakan kepada kami [Shadaqah bin Al Fadll] telah menceritakan kepada kami [Mu'adz bin Mu'adz] telah menceritakan kepada kami [Syu'bah] dari [Al Fudlail bin Fadlalah] dari [Abdurrahman bin Abu Bakrah], bahwa [ayahnya] melihat beberapa orang melakukan sholat dluha, kemudian ia berkata, \"Sesungguhnya mereka mengerjakan sholat yang tidak pernah dilakukan oleh Rasulullah shallallahu 'alaihi wasallam dan tidak pula para sahabatnya.\" "
            },
            {
                "number": 1068,
                "arab": " أَخْبَرَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا هِشَامٌ الدَّسْتَوَائِيُّ عَنْ الْقَاسِمِ بْنِ عَوْفٍ عَنْ زَيْدِ بْنِ أَرْقَمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ عَلَيْهِمْ وَهُمْ يُصَلُّونَ بَعْدَ طُلُوعِ الشَّمْسِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ الْأَوَّابِينَ إِذَا رَمِضَتْ الْفِصَالُ",
                "id": "Telah mengabarkan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Hisyam Ad Dastawa`i] dari [Al Qasim bin 'Auf] dari [Zaid bin Arqam], bahwa Rasulullah shallallahu 'alaihi wasallam keluar menemui mereka sementara mereka melakukan sholat setelah matahari terbit. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat orang-orang yang taat adalah apabila matahari telah terang (panas).\""
            },
            {
                "number": 1069,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ وَغُنْدَرٌ عَنْ شُعْبَةَ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ عَلِيٍّ الْأَزْدِيِّ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَى وَقَالَ أَحَدُهُمَا رَكْعَتَيْنِ رَكْعَتَيْنِ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Muhammad bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dan [Ghudar] dari [Syu'bah] dari [Ya'la bin 'Atho`] dari [Ali Al Azdi] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat malam dan siang adalah dua dua.\" Salah seorang dari mereka menyebutkan, \"Dua rakaat, dua rakaat.\""
            },
            {
                "number": 1070,
                "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ سَأَلَ رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ فَقَالَ مَثْنَى مَثْنَى فَإِذَا خَشِيَ أَحَدُكُمْ الصُّبْحَ فَلْيُصَلِّ رَكْعَةً وَاحِدَةً تُوتِرُ مَا قَدْ صَلَّى",
                "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Seorang laki-laki bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai sholat malam. Kemudian beliau bersabda: \"Dua, dua. Kemudian apabila salah seorang di antara kalian khawatir datangnya waktu subuh, maka hendaknya ia sholat satu rakaat sebagai witir dari sholat yang telah ia kerjakan.\""
            },
            {
                "number": 1071,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ عَوْفٍ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ عَبْدِ اللَّهِ بْنِ سَلَامَ قَالَ لَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ اسْتَشْرَفَهُ النَّاسُ فَقَالُوا قَدِمَ رَسُولُ اللَّهِ قَدِمَ رَسُولُ اللَّهِ فَخَرَجْتُ فِيمَنْ خَرَجَ فَلَمَّا رَأَيْتُ وَجْهَهُ عَرَفْتُ أَنَّ وَجْهَهُ لَيْسَ بِوَجْهِ كَذَّابٍ فَكَانَ أَوَّلُ مَا سَمِعْتُهُ يَقُولُ يَا أَيُّهَا النَّاسُ أَفْشُوا السَّلَامَ وَأَطْعِمُوا الطَّعَامَ وَصِلُوا الْأَرْحَامَ وَصَلُّوا وَالنَّاسُ نِيَامٌ تَدْخُلُوا الْجَنَّةَ بِسَلَامٍ",
                "id": "Telah mengabarkan kepada kami [Sa'id? bin 'Amir] dari ['Auf] dari [Zurarah bin Aufa] dari [Abdullah bin Salam] ia berkata, \"Tatkala Rasulullah shallallahu 'alaihi wasallam datang ke Madinah, orang-orang menyambut beliau dan berkata, \"Rasulullah telah datang, Rasulullah telah datang! Kemudian aku keluar di antara orang-orang yang keluar itu, maka ketika aku melihat wajahnya aku mengetahui bahwa wajahnya bukanlah wajah seorang pendusta. Dan pertama yang aku dengar beliau mengatakan: \"Wahai manusia, sebarkanlah salam, berilah makan, sambunglah hubungan kekerabatan dan sholatlah saat orang-orang sedang tidur maka kalian akan masuk surga dengan selamat.\" "
            },
            {
                "number": 1072,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ الْأَوْزَاعِيِّ عَنْ هَارُونَ بْنِ رِئَابٍ عَنْ الْأَحْنَفِ بْنِ قَيْسٍ قَالَ دَخَلْتُ مَسْجِدَ دِمَشْقَ فَإِذَا رَجُلٌ يُكْثِرُ الرُّكُوعَ وَالسُّجُودَ قُلْتُ لَا أَخْرُجُ حَتَّى أَنْظُرَ أَعَلَى شَفْعٍ يَدْرِي هَذَا يَنْصَرِفُ أَمْ عَلَى وِتْرٍ فَلَمَّا فَرَغَ قُلْتُ يَا عَبْدَ اللَّهِ أَعَلَى شَفْعٍ تَدْرِي انْصَرَفْتَ أَمْ عَلَى وِتْرٍ فَقَالَ إِنْ لَا أَدْرِي فَإِنَّ اللَّهَ يَدْرِي ثُمَّ قَالَ إِنِّي سَمِعْتُ خَلِيلِي أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ عَبْدٍ يَسْجُدُ لِلَّهِ سَجْدَةً إِلَّا رَفَعَهُ اللَّهُ بِهَا دَرَجَةً وَحَطَّ عَنْهُ بِهَا خَطِيئَةً قُلْتُ مَنْ أَنْتَ رَحِمَكَ اللَّهُ قَالَ أَنَا أَبُو ذَرٍّ قَالَ فَتَقَاصَرَتْ إِلَيَّ نَفْسِي",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] dari [Al Auza'i] dari [Harun bin Riab] dari [Al Ahnaf bin Qais] ia berkata, \"Aku memasuki masjid Damaskus, dan ternyata terdapat seorang laki-laki yang memperbanyak rukuk dan sujud. Maka aku berkata, \"Aku tidak akan keluar hingga melihat apakah orang ini tahu saat ia menyelesaikan sholat dengan jumlah genap atau ganjil? Maka ketika selesai aku katakan, \"Wahai hamba Allah, apakah engkau tahu menyelesaikan sholat dengan jumlah genap atau ganjil? Ia lalu menjawab, \"Apabila aku tidak mengetahui maka sesungguhnya Allah mengetahui.\" Kemudian ia berkata lagi, \"Aku mendengar kekasihku Abu Al Qasim shallallahu 'alaihi wasallam berkata: \"Tidaklah seorang hamba sujud kepada Allah satu kali sujud melainkan Allah mengangkatnya dengan sujud tersebut satu derajat, dan menghapus darinya satu kesalahan.\" Aku lantas bertanya, \"Siapakah anda? Semoga Allah merahmati anda?\" Laki-laki itu menjawab, \" Aku adalah [Abu Dzar].\"?Al Ahnaf bin Qais berkata, \"Maka diriku menganggap kelalaian tersebut berasal dariku.\" "
            },
            {
                "number": 1073,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سَلَمَةُ بْنُ رَجَاءٍ حَدَّثَتْنَا شَعْثَاءُ قَالَتْ رَأَيْتُ ابْنَ أَبِي أَوْفَى صَلَّى رَكْعَتَيْنِ وَقَالَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الضُّحَى رَكْعَتَيْنِ حِينَ بُشِّرَ بِالْفَتْحِ أَوْ بِرَأْسِ أَبِي جَهْلٍ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Salamah bin Raja`] telah menceritakan kepada kami [Sya'tsa`] ia berkata, \"Aku melihat [Ibnu Abu Aufa] melakukan sholat dua rakaat lalu berkata, \"Rasulullah shallallahu 'alaihi wasallam melakukan sholat dluha dua rakaat ketika diberi kabar mengenai kemenangan atau saat dibawanya kepala Abu Jahl.\" "
            },
            {
                "number": 1074,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا إِسْحَقُ الْأَزْرَقُ عَنْ شَرِيكٍ عَنْ حُصَيْنٍ عَنْ الشَّعْبِيِّ عَنْ قَيْسِ بْنِ سَعْدٍ قَالَ أَتَيْتُ الْحِيرَةَ فَرَأَيْتُهُمْ يَسْجُدُونَ لِمَرْزُبَانَ لَهُمْ فَقُلْتُ يَا رَسُولَ اللَّهِ أَلَا نَسْجُدُ لَكَ فَقَالَ لَوْ أَمَرْتُ أَحَدًا لَأَمَرْتُ النِّسَاءَ أَنْ يَسْجُدْنَ لِأَزْوَاجِهِنَّ لِمَا جَعَلَ اللَّهُ عَلَيْهِنَّ مِنْ حَقِّهِمْ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Aun] telah menceritakan kepada kami [Ishaq Al Azraq] dari [Syarik] dari [Hushain] dari [Asy Sya'bi] dari [Qais bin Sa'd] ia berkata, \"Aku datang ke Al Hirah, kemudian aku melihat orang-orang sedang sujud kepada penunggang kuda mereka yang pemberani. Maka aku pun berkata, \"Wahai Rasulullah, tidakkah kami sujud kepadamu?\" Beliau menjawab: \"Seandainya aku boleh memerintahkan seseorang, niscaya aku perintahkan para wanita untuk sujud kepada suami-suami mereka karena hak yang Allah berikan atas mereka.\" "
            },
            {
                "number": 1075,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الْحِزَامِيُّ حَدَّثَنَا حِبَّانُ بْنُ عَلِيٍّ عَنْ صَالِحِ بْنِ حَيَّانَ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ ائْذَنْ لِي فَلِأَسْجُدَ لَكَ قَالَ لَوْ كُنْتُ آمِرًا أَحَدًا أَنْ يَسْجُدَ لِأَحَدٍ لَأَمَرْتُ الْمَرْأَةَ تَسْجُدُ لِزَوْجِهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yazid Al Hizami] telah menceritakan kepada kami [Hibban bin Ali] dari [Shalih bin Hayyan] dari [Ibnu Buraidah] dari [Ayahnya] ia berkata, \"Seorang badui datang kepada Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, izinkan aku untuk sujud kepadamu! \" Beliau berkata: \"Seandainya aku diperbolehkan untuk memerintahkan seseorang sujud kepada orang lain, niscaya aku akan perintahkan seorang wanita untuk bersujud kepada suaminya.\" "
            },
            {
                "number": 1076,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ النَّجْمَ فَسَجَدَ فِيهَا وَلَمْ يَبْقَ أَحَدٌ إِلَّا سَجَدَ إِلَّا شَيْخٌ أَخَذَ كَفًّا مِنْ حَصًى فَرَفَعَهُ إِلَى جَبْهَتِهِ وَقَالَ يَكْفِينِي هَذَا",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Al Aswad] dari [Abdullah bin Mas'ud], bahwa Rasulullah shallallahu 'alaihi wasallam saat membaca surat An Najm beliau sujud, dan tidak ada seorangpun melainkan ia ikut sujud kecuali seorang laki-laki tua, ia mengambil satu genggam pasir kemudian menempelkannya pada kening seraya berkata, 'Ini cukup bagiku'.\""
            },
            {
                "number": 1077,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي خَالِدٌ يَعْنِي ابْنَ يَزِيدَ عَنْ سَعِيدٍ يَعْنِي ابْنَ أَبِي هِلَالٍ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّهُ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا فَقَرَأَ ص فَلَمَّا مَرَّ بِالسَّجْدَةِ نَزَلَ فَسَجَدَ وَسَجَدْنَا مَعَهُ وَقَرَأَهَا مَرَّةً أُخْرَى فَلَمَّا بَلَغَ السَّجْدَةَ تَيَسَّرْنَا لِلسُّجُودِ فَلَمَّا رَآنَا قَالَ إِنَّمَا هِيَ تَوْبَةُ نَبِيٍّ وَلَكِنِّي أَرَاكُمْ قَدْ اسْتَعْدَدْتُمْ لِلسُّجُودِ فَنَزَلَ فَسَجَدَ وَسَجَدْنَا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Khalid] -yaitu Ibnu Yazid- dari [Sa'id] -yaitu Ibnu Abu Hilal- dari ['Iyadl bin Abdullah bin Sa'd] dari [Abu Sa'id Al Khudri], bahwa ia berkata, \"Pada suatu hari Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada kami lalu beliau membaca Surat Shaad. Kemudian ketika sampai pada ayat sajdah beliau turun dan sujud, maka kami ikut sujud bersamanya. Beliau membacanya lagi, kemudian tatkala sampai ayat sajdah kami telah merasa siap untuk sujud. Maka ketika beliau melihat kami, beliau berkata: \"Sesungguhnya itu adalah taubat seorang nabi, akan tetapi aku melihat kalian telah bersiap untuk bersujud.\" Kemudian beliau turun, lalu sujud dan kami pun bersujud.\""
            },
            {
                "number": 1078,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ حَدَّثَنَا إِسْمَعِيلُ هُوَ ابْنُ عُلَيَّةَ حَدَّثَنَا أَيُّوبُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ قَالَ فِي السُّجُودِ فِي ص لَيْسَتْ مِنْ عَزَائِمِ السُّجُودِ وَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ فِيهَا",
                "id": "Telah mengabarkan kepada kami ['Amru bin Zurarah] telah menceritakan kepada kami [Ismail] -yaitu Ibnu 'Ulaiyyah- telah menceritakan kepada kami [Ayyub] dari ['Ikrimah] dari [Ibnu Abbas], bahwa ia berkomentar tentang sujud pada surat Shaad, \"Surat tersebut bukanlah termasuk di antara kewajiban-kewajiban untuk sujud. Tetapi aku melihat Rasulullah shallallahu 'alaihi wasallam bersujud pada surat tersebut.\" "
            },
            {
                "number": 1079,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ قَالَ رَأَيْتُ أَبَا هُرَيْرَةَ يَسْجُدُ فِي إِذَا السَّمَاءُ انْشَقَّتْ فَقِيلَ لَهُ تَسْجُدُ فِي سُورَةٍ مَا يُسْجَدُ فِيهَا فَقَالَ إِنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْجُدُ فِيهَا",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Muhammad bin 'Amru] dari [Abu Salamah] ia berkata, \"Aku melihat [Abu Hurairah] sujud pada IDZAS SAMAA`UN SYAQQAT (surat Al Insyiqaaq).\" Kemudian ia ditanya, \"Apakah anda sujud pada surat yang tidak ada sujud padanya?\" Abu Hurairah menjawab, \"Sesungguhnya aku melihat Rasulullah shallallahu 'alaihi wasallam sujud pada surat tersebut.\" "
            },
            {
                "number": 1080,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ قَالَ رَأَيْتُ أَبَا هُرَيْرَةَ يَسْجُدُ فِي إِذَا السَّمَاءُ انْشَقَّتْ فَقُلْتُ يَا أَبَا هُرَيْرَةَ أَرَاكَ تَسْجُدُ فِي إِذَا السَّمَاءُ انْشَقَّتْ فَقَالَ لَوْ لَمْ أَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ فِيهَا لَمْ أَسْجُدْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Al Auza'i] dari [Yahya] dari [Abu Salamah] ia berkata, \"Aku melihat [Abu Hurairah] sujud pada IDZAS SAMAA`UN SYAQQAT (surat Al Insyiqaaq). Maka aku pun bertanya, \"Wahai Abu Hurairah, aku lihat engkau sujud pada IDZAS SAMAA`UN SYAQQAT?\" Abu Hurairah lalu menjawab, \"Seandainya aku tidak melihat Rasulullah shallallahu 'alaihi wasallam sujud pada surat tersebut maka aku tidak akan sujud.\" "
            },
            {
                "number": 1081,
                "arab": " أَخْبَرَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ فِي إِذَا السَّمَاءُ انْشَقَّتْ",
                "id": "Telah mengabarkan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Sufyan] dari [Yahya bin Sa'id] dari [Abu Bakr bin Muhammad bin 'Amru bin Hazm] dari [Umar bin Abdul Aziz] dari [Abu Bakr bin Abdurrahman bin Al Harits bin Hisyam] dari [Abu Hurairah], bahwa Nabi shallallahu 'alaihi wasallam sujud pada IDZAS SAMAA`UN SYAQQAT (surat Al Insyiqaaq).\""
            },
            {
                "number": 1082,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ عَطَاءِ بْنِ مِينَا عَنْ أَبِي هُرَيْرَةَ قَالَ سَجَدْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِذَا السَّمَاءُ انْشَقَّتْ وَاقْرَأْ بِاسْمِ رَبِّكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] Telah menceritakan kepada kami [Sufyan] dari [Ayyub bin Musa] dari [Atha` bin Mina] dari [Abu Hurairah] ia berkata, \"Kami sujud bersama Rasulullah shallallahu 'alaihi wasallam pada IDZAS SAMAA`UN SYAQQAT (surat Al Insyiqaaq) dan IQRA` BISMIRABBIKA (surat Al 'Alaq).\" "
            },
            {
                "number": 1083,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَ قَرَأْتُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّجْمَ فَلَمْ يَسْجُدْ فِيهَا",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Musa] dari [Ibnu Abu Dzi`b] dari [Yazid bin Abdullah bin Qusaith] dari ['Atha` bin Yasar] dari [Zaid bin Tsabit] ia berkata, \"Aku membaca surat An Najm di sisi Rasulullah shallallahu 'alaihi wasallam, dan beliau tidak sujud padanya.\" "
            },
            {
                "number": 1084,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مَا بَيْنَ الْعِشَاءِ إِلَى الْفَجْرِ إِحْدَى عَشْرَةَ رَكْعَةً يُسَلِّمُ فِي كُلِّ رَكْعَتَيْنِ وَيُوتِرُ بِوَاحِدَةٍ وَيَسْجُدُ فِي سُبْحَتِهِ بِقَدْرِ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً قَبْلَ أَنْ يَرْفَعَ رَأْسَهُ فَإِذَا سَكَتَ الْمُؤَذِّنُ مِنْ الْأَذَانِ الْأَوَّلِ رَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ اضْطَجَعَ حَتَّى يَأْتِيَهُ الْمُؤَذِّنُ فَيَخْرُجَ مَعَهُ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] dari [Ibnu Abu Dzi`b] dari [Az Zuhri] dari ['Urwah] dari [Aisyah] radliallahu 'anha, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melakukan sholat antara sholat Isya hingga subuh sebanyak sebelas rakaat. Beliau mengucapkan salam pada setiap dua rakaat dan melakukan witir satu rakaat, serta sujud pada sholat sunah seukuran salah seorang di antara kalian membaca lima puluh ayat sebelum mengangkat kepalanya. Kemudian apabila muadzin selesai dari adzan (diam) pertama beliau melakukan sholat dua rakaat ringan kemudian berbaring hingga datang muadzin, baru kemudian beliau pergi bersamanya (sholat subuh).\" "
            },
            {
                "number": 1085,
                "arab": " حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ وَوَهْبُ بْنُ جَرِيرٍ قَالَا حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ قَالَ سَأَلْتُ عَائِشَةَ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ فَقَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي ثَلَاثَ عَشْرَةَ رَكْعَةً يُصَلِّي ثَمَانَ رَكَعَاتٍ ثُمَّ يُوتِرُ ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ فَرَكَعَ وَيُصَلِّي رَكْعَتَيْنِ بَيْنَ النِّدَاءِ وَالْإِقَامَةِ مِنْ صَلَاةِ الصُّبْحِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] dan [Wahb bin Jarir] mereka berkata; telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Abu Salamah] ia berkata, \"Aku bertanya [Aisyah] mengenai sholat Rasulullah shallallahu 'alaihi wasallam pada malam hari. Kemudian ia berkata, \"Nabi shallallahu 'alaihi wasallam sholat tiga belas rakaat; beliau sholat delapan rakaat lalu mengerjakan witir. Kemudian beliau mengerjakan sholat dua rakaat dalam keadaan duduk, jika beliau ingin melakukan rukuk, maka beliau berdiri dahulu kemudian rukuk. Beliau juga mengerjakan sholat dua rakaat antara adzan dan iqamah pada saat sholat subuh.\" "
            },
            {
                "number": 1086,
                "arab": " حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ أَنَّهُ طَلَّقَ امْرَأَتَهُ وَأَتَى الْمَدِينَةَ لِبَيْعِ عَقَارِهِ فَيَجْعَلَهُ فِي السِّلَاحِ وَالْكُرَاعِ فَلَقِيَ رَهْطًا مِنْ الْأَنْصَارِ فَقَالُوا أَرَادَ ذَلِكَ سِتَّةٌ مِنَّا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَنَعَهُمْ وَقَالَ أَمَا لَكُمْ فِيَّ أُسْوَةٌ ثُمَّ إِنَّهُ قَدِمَ الْبَصْرَةَ فَحَدَّثَنَا أَنَّهُ لَقِيَ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ فَسَأَلَهُ عَنْ الْوِتْرِ فَقَالَ أَلَا أُحَدِّثُكَ بِأَعْلَمِ النَّاسِ بِوِتْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ بَلَى قَالَ أُمُّ الْمُؤْمِنِينَ عَائِشَةُ فَأْتِهَا فَاسْأَلْهَا ثُمَّ ارْجِعْ إِلَيَّ فَحَدِّثْنِي بِمَا تُحَدِّثُكَ فَأَتَيْتُ حَكِيمَ بْنَ أَفْلَحَ فَقُلْتُ لَهُ انْطَلِقْ مَعِي إِلَى أُمِّ الْمُؤْمِنِينَ عَائِشَةَ قَالَ إِنِّي لَا آتِيهَا إِنِّي نَهَيْتُ عَنْ هَذِهِ الشِّيعَتَيْنِ فَأَبَتْ إِلَّا مُضِيًّا قُلْتُ أَقْسَمْتُ عَلَيْكَ لَمَا انْطَلَقْتَ فَانْطَلَقْنَا فَسَلَّمْنَا فَعَرَفَتْ صَوْتَ حَكِيمٍ فَقَالَتْ مَنْ هَذَا قُلْتُ سَعْدُ بْنُ هِشَامٍ قَالَتْ مَنْ هِشَامٌ قُلْتُ هِشَامُ بْنُ عَامِرٍ قَالَتْ نِعْمَ الْمَرْءُ قُتِلَ يَوْمَ أُحُدٍ قُلْتُ أَخْبِرِينَا عَنْ خُلُقِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ أَلَسْتَ تَقْرَأُ الْقُرْآنَ قُلْتُ بَلَى قَالَتْ فَإِنَّهُ خُلُقُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَرَدْتُ أَنْ أَقُومَ وَلَا أَسْأَلَ أَحَدًا عَنْ شَيْءٍ حَتَّى أَلْحَقَ بِاللَّهِ فَعَرَضَ لِي الْقِيَامُ فَقُلْتُ أَخْبِرِينَا عَنْ قِيَامِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ أَلَسْتَ تَقْرَأُ يَا أَيُّهَا الْمُزَّمِّلُ قُلْتُ بَلَى قَالَتْ فَإِنَّهَا كَانَتْ قِيَامَ رَسُولِ اللَّهِ أُنْزِلَ أَوَّلُ السُّورَةِ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ حَتَّى انْتَفَخَتْ أَقْدَامُهُمْ وَحُبِسَ آخِرُهَا فِي السَّمَاءِ سِتَّةَ عَشَرَ شَهْرًا ثُمَّ أُنْزِلَ فَصَارَ قِيَامُ اللَّيْلِ تَطَوُّعًا بَعْدَ أَنْ كَانَ فَرِيضَةً فَأَرَدْتُ أَنْ أَقُومَ وَلَا أَسْأَلَ أَحَدًا عَنْ شَيْءٍ حَتَّى أَلْحَقَ بِاللَّهِ فَعَرَضَ لِي الْوِتْرُ فَقُلْتُ أَخْبِرِينَا عَنْ وِتْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا نَامَ وَضَعَ سِوَاكَهُ عِنْدِي فَيَبْعَثُهُ اللَّهُ لِمَا شَاءَ أَنْ يَبْعَثَهُ فَيُصَلِّي تِسْعَ رَكَعَاتٍ لَا يَجْلِسُ إِلَّا فِي الثَّامِنَةِ فَيَحْمَدُ اللَّهَ وَيَدْعُو رَبَّهُ ثُمَّ يَقُومُ وَلَا يُسَلِّمُ ثُمَّ يَجْلِسُ فِي التَّاسِعَةِ فَيَحْمَدُ اللَّهَ وَيَدْعُو رَبَّهُ وَيُسَلِّمُ تَسْلِيمَةً يُسْمِعُنَا ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ فَتِلْكَ إِحْدَى عَشْرَةَ رَكْعَةً يَا بُنَيَّ فَلَمَّا أَسَنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحَمَلَ اللَّحْمَ صَلَّى سَبْعَ رَكَعَاتٍ لَا يَجْلِسُ إِلَّا فِي السَّادِسَةِ فَيَحْمَدُ اللَّهَ وَيَدْعُو رَبَّهُ ثُمَّ يَقُومُ وَلَا يُسَلِّمُ ثُمَّ يَجْلِسُ فِي السَّابِعَةِ فَيَحْمَدُ اللَّهَ وَيَدْعُو رَبَّهُ ثُمَّ يُسَلِّمُ تَسْلِيمَةً ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ فَتِلْكَ تِسْعٌ يَا بُنَيَّ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا غَلَبَهُ نَوْمٌ أَوْ مَرَضٌ صَلَّى مِنْ النَّهَارِ ثِنْتَيْ عَشْرَةَ رَكْعَةً وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَخَذَ خُلُقًا أَحَبَّ أَنْ يُدَاوِمَ عَلَيْهِ وَمَا قَامَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةً حَتَّى يُصْبِحَ وَلَا قَرَأَ الْقُرْآنَ كُلَّهُ فِي لَيْلَةٍ وَلَا صَامَ شَهْرًا كَامِلًا غَيْرَ رَمَضَانَ فَأَتَيْتُ ابْنَ عَبَّاسٍ فَحَدَّثْتُهُ فَقَالَ صَدَقَتْكَ أَمَا إِنِّي لَوْ كُنْتُ أَدْخُلُ عَلَيْهَا لَشَافَهْتُهَا مُشَافَهَةً قَالَ فَقُلْتُ أَمَا إِنِّي لَوْ شَعَرْتُ أَنَّكَ لَا تَدْخُلُ عَلَيْهَا مَا حَدَّثْتُكَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [Ayahku] dari [Qatadah] dari [Zurarah bin Aufa] dari [Sa'd bin Hisyam], bahwa ia telah mencerai isterinya lalu datang ke Madinah untuk menjual tanahnya kemudian menjadikannya untuk membeli senjata dan perlengkapan perang. Kemudian ia bertemu dengan beberapa orang Anshar, mereka lalu berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam ada enam orang di antara kami yang menghendaki hal tersebut, kemudian Rasulullah shallallahu 'alaihi wasallam melarang mereka. Beliau mengatakan: \"Bukankah pada diriku terdapat suri tauladan?\" Kemudian laki-laki itu datang ke Bashrah dan menceritakan kepada kami bahwa ia pernah bertemu Abdullah bin Abbas dan bertanya kepadanya mengenai witir. Kemudian Abdullah bin Abbas menjawab, \"Maukah aku ceritakan kepadamu orang yang paling tahu mengenai witir Rasulullah shallallahu 'alaihi wasallam?\" Ia berkata, \"Ya.\" Abdullah bin Abbas berkata, \"Ummul mukminin, [Aisyah]. Datanglah kepadanya dan bertanyalah. Setelah itu kembalilah kepadaku, kamu ceritakan kepadaku apa yang ia ceritakan kepadamu.\" Lalu aku datang kepada Hakim bin Aflah dan berkata kepadanya, \"Pergilah bersamaku menemui Ummul Mukminin, Aisyah.\" Hakim berkata, \"Aku tidak akan datang kepadanya! Sungguh aku telah melarang dari berbicara tentang dua kelompok (yang terlibat dalam peperangan -pent) ini, namun ia (Aisyah) tetap membicarakannya.\" Aku katakan, \"Aku menyumpahmu, sungguh engkau akan pergi.\" Kemudian kamipun pergi dan mengucapkan salam. Ternyata Aisyah mengenal suara Hakim, ia lantas bertanya, \"Siapa ini?\" aku menjawab, \"Sa'd bin Hisyam.\" Ia bertanya lagi, \"Hisyam siapa?\" Aku katakan, \"Hisyam bin 'Amir.\" Aisyah lalu berkata, \"Sebaik-baik orang adalah yang terbunuh pada saat perang Uhud.\" Aku lalu berkata, \"Beritahukan kepada kami bagaimana akhlak Rasulullah shallallahu 'alaihi wasallam?\" Aisyah berkata, \"Bukankah engkau membaca Al Qur'an?\" Aku katakan, \"Ya.\" Aisyah lantas berkata, \"Sesungguhnya itu adalah akhlak Rasulullah shallallahu 'alaihi wasallam.\" Kemudian aku ingin berdiri dan tidak bertanya kepada seorangpun mengenai sesuatu hingga aku bertemu dengan Allah. Kemudian terlintas padaku tentang sholat malam, lalu aku katakan, \"Beritahukan kepada kami mengenai sholat malam Rasulullah! Aisyah berkata, \"Bukankah engkau membaca surat 'YAA AYYUHAL MUZZAMMIL? ' Aku menjawab, \"Ya.\" Aisyah lalu berkata, \"Itulah sholat malam Rasulullah shallallahu 'alaihi wasallam. Telah diturunkan awal surat tersebut kemudian Rasulullah shallallahu 'alaihi wasallam dan para sahabatnya melaksanakan hingga kaki mereka bengkak, dan akhir surat tersebut tertahan di langit selama enam belas bulan, kemudian diturunkan. Lalu sholat malam menjadi sesuatu yang sunah setelah menjadi sesuatu yang wajib.\" Kemudian aku ingin berdiri dan tidak bertanya kepada seorang pun mengenai sesuatu hingga aku bertemu dengan Allah. Kemudian terlintas padaku tentang sholat witir, lalu aku katakan, \"Beritahukan kepada kami mengenai witir Rasulullah shallallahu 'alaihi wasallam?\" Aisyah lalu berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam tidur, beliau meletakkan siwaknya di sisiku, kemudian Allah membangunkannya dengan sekehendak Allah untuk membangunkannya, kemudian beliau melakukan sholat sembilan rakaat dan tidak duduk (untuk tasyahud) kecuali pada rakaat kedelapan. Beliau lalu memuji Allah dan berdoa kepada Tuhannya. Kemudian berdiri dan tidak mengucapkan salam. Kemudian duduk pada rakaat kesembilan, beliau lalu memuji Allah dan berdoa kepada Tuhannya serta mengucapkan salam satu kali, dan beliau memperdengarkannya kepada kami. Setelah itu beliau melakukan sholat dua rakaat dalam keadaan duduk. Itulah sholat sebelas rakaat wahai anakku. Kemudian tatkala Rasulullah shallallahu 'alaihi wasallam telah berumur dan gemuk maka beliau melakukan sholat tujuh rakaat, tidak duduk (untuk tasyahud) kecuali pada rakaat keenam, lalu memuji Allah serta berdoa kepada Tuhannya. Kemudian berdiri dan tidak mengucapkan salam. Kemudian beliau duduk pada rakaat ketujuh lalu memuji Allah dan berdoa kepada Tuhannya, kemudian mengucapkan salam satu kali. Kemudian melakukan sholat dua rakaat dalam keadaan duduk, maka itulah sembilan rakaat wahai anakku. Jika Nabi shallallahu 'alaihi wasallam apabila ketiduran atau sedang sakit, maka beliau melakukan sholat pada siang harinya dua belas rakaat. Rasulullah shallallahu 'alaihi wasallam apabila melakukan suatu pekerjaan, maka beliau senang untuk melakukannya secara kontinyu. Nabi shallallahu 'alaihi wasallam tidak sholat malam hingga pagi hari, tidak membaca Al Qur'an seluruhnya dalam satu malam, dan beliau tidak pernah puasa satu bulan penuh selain pada bulan Ramadhan.\" Kemudian aku datang kepada Ibnu Abbas dan menceritakan hal tersebut, lalu ia berkata, \"Aisyah telah berkata benar kepadamu. Sekiranya aku bisa bertemu dengannya, maka aku akan berbicara secara langsung kepadanya.\" Sa'd berkata, \"Aku lalu berkata, \"Jika aku tahu bahwa engkau enggan menemuinya maka aku tidak akan menceritakan kepadamu.\" "
            },
            {
                "number": 1087,
                "arab": " أَخْبَرَنَا زَيْدُ بْنُ عَوْفٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَفْضَلُ الصَّلَاةِ بَعْدَ الْفَرِيضَةِ الصَّلَاةُ فِي جَوْفِ اللَّيْلِ",
                "id": "Telah mengabarkan kepada kami [Zaid bin 'Auf] telah menceritakan kepada kami [Abu 'Awanah] dari [Abdul Malik bin 'Umair] dari [Muhammad bin Al Muntasyir] dari [Humaid bin Abdurrahman] dari [Abu Hurairah], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"sholat paling utama setelah sholat wajib adalah sholat di tengah malam.\""
            },
            {
                "number": 1088,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَ وَعُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَبْدٍ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَامَ عَنْ حِزْبِهِ أَوْ عَنْ شَيْءٍ مِنْهُ فَقَرَأَهُ فِيمَا بَيْنَ صَلَاةِ الْفَجْرِ وَصَلَاةِ الظُّهْرِ كُتِبَ لَهُ كَأَنَّمَا قَرَأَهُ مِنْ اللَّيْلِ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [As Sa`ib bin Yazid] serta ['ubaidhullah bin Abdurrahman bin Abd] bahwa [Abdurrahman bin 'Abd] berkata, aku mendengar [Umar bin Al Khathab] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa tertidur dari dzikirnya atau sebagian darinya kemudian ia membacanya antara sholat subuh dan sholat zhuhur, maka tercatat baginya seolah-olah ia telah membacanya pada malam hari.\""
            },
            {
                "number": 1089,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْزِلُ اللَّهُ تَعَالَى إِلَى السَّمَاءِ الدُّنْيَا كُلَّ لَيْلَةٍ لِنِصْفِ اللَّيْلِ الْآخِرِ أَوْ لِثُلُثِ اللَّيْلِ الْآخِرِ فَيَقُولُ مَنْ ذَا الَّذِي يَدْعُونِي فَأَسْتَجِيبَ لَهُ مَنْ ذَا الَّذِي يَسْأَلُنِي فَأُعْطِيَهُ مَنْ ذَا الَّذِي يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ حَتَّى يَطْلُعَ الْفَجْرُ أَوْ يَنْصَرِفَ الْقَارِئُ مِنْ صَلَاةِ الْفَجْرِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Ta'ala turun ke langit dunia pada pertengahan malam akhir, atau sepertiga malam terakhir, lalu berfirman: 'Siapa yang berdoa kepada-Ku maka Aku akan mengabulkan baginya, siapakah yang memohon kepada-Ku maka Aku akan memberinya, siapakah yang meminta ampun kepada-Ku maka Aku akan mengampuninya? ' sampai terbit fajar atau orang yang sholat selesai dari sholat subuh.\""
            },
            {
                "number": 1090,
                "arab": " حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ عَنْ شُعَيْبِ بْنِ أَبِي حَمْزَةَ عَنْ الزُّهْرِيِّ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ وَأَبُو عَبْدِ اللَّهِ الْأَغَرُّ صَاحِبَا أَبِي هُرَيْرَةَ أَنَّ أَبَا هُرَيْرَةَ أَخْبَرَهُمَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَنْزِلُ رَبُّنَا تَبَارَكَ اسْمُهُ كُلَّ لَيْلَةٍ حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الْآخِرُ إِلَى السَّمَاءِ الدُّنْيَا فَيَقُولُ مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ مَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ مَنْ يَسْأَلُنِي فَأُعْطِيَهُ حَتَّى الْفَجْرِ",
                "id": "Telah menceritakan kepada kami [Al Hakam bin Nafi'] dari [Syu'aib bin Abu Hamzah] dari [Az Zuhri] telah menceritakan kepadaku [Abu Salamah bin Abdurrahman] dan [Abu Abdullah Al Aghar] dua orang sahabat Abu Hurairah, bahwa [Abu Hurairah] mengabarkan kepada mereka berdua, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tuhan kita Yang Maha Suci nama-Nya turun ke langit dunia pada setiap malam di sepertiga malam terakhir, kemudian berfirman: 'Siapakah yang berdoa kepada-Ku maka Aku akan mengabulkan baginya, siapakah yang memohon kepada-Ku maka Aku akan memberinya, siapakah yang meminta ampun kepada-Ku maka Aku akan mengampuninya? ' hingga terbit fajar.\" "
            },
            {
                "number": 1091,
                "arab": " أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَنْزِلُ اللَّهُ تَعَالَى كُلَّ لَيْلَةٍ إِلَى السَّمَاءِ الدُّنْيَا فَيَقُولُ هَلْ مِنْ سَائِلٍ فَأُعْطِيَهُ هَلْ مِنْ مُسْتَغْفِرٍ فَأَغْفِرَ لَهُ",
                "id": "Telah mengabarkan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] telah menceritakan kepada kami ['Amru bin Dinar] dari [Nafi' bin Jubair bin Muth'im] dari [Ayahnya], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada setiap malam Allah Ta'ala turun ke langit dunia, kemudian berfirman: 'Apakah ada orang yang memohon hingga Aku memberinya? Apakah ada orang yang meminta ampunan hingga Aku mengampuninya?\""
            },
            {
                "number": 1092,
                "arab": " أَخْبَرَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ رِفَاعَةَ بْنِ عَرَابَةَ الْجُهَنِيِّ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا مَضَى مِنْ اللَّيْلِ نِصْفُهُ أَوْ ثُلُثَاهُ هَبَطَ اللَّهُ إِلَى السَّمَاءِ الدُّنْيَا ثُمَّ يَقُولُ لَا أَسْأَلُ عَنْ عِبَادِي غَيْرِي مَنْ ذَا الَّذِي يَسْأَلُنِي فَأُعْطِيَهُ مَنْ ذَا الَّذِي يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ مَنْ ذَا الَّذِي يَدْعُونِي فَأَسْتَجِيبَ لَهُ حَتَّى يَطْلُعَ الْفَجْرُ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ عَنْ عَطَاءِ بْنِ يَسَارٍ أَنَّ رِفَاعَةَ أَخْبَرَهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ",
                "id": "Telah mengabarkan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Hilal bin Abu Maimunah] dari ['Atha` bin Yasar] dari [Rifa'ah bin 'Arabah Al Juhani] ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila telah berlalu setengah malam atau dua pertiga malam Allah turun ke langit dunia, kemudian berfirman: 'Tidak ada yang bertanya mengenai hamba-hambaKu selain diri-Ku, siapakah yang memohon kepada-Ku hingga Aku memberinya, siapakah yang meminta ampunan kepada-Ku hingga Aku mengampuninya? Siapakah yang berdoa kepada-Ku hingga Aku mengabulkannya? ' sehingga terbit fajar.\" Telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Hilal bin Abu Maimunah] dari ['Atha` bin Yasar] bahwa [Rifa'ah] telah mengabarkan kepadanya dari Nabi shallallahu 'alaihi wasallam dengan hadits seperti itu.\" "
            },
            {
                "number": 1093,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ حُمَيْدٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُخْتَارٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَمِّهِ عَبْدِ الرَّحْمَنِ بْنِ يَسَارٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ عَلِيٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ ثُلُثُ اللَّيْلِ أَوْ نِصْفُ اللَّيْلِ فَذَكَرَ النُّزُولَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Humaid] telah menceritakan kepada kami [Ibrahim bin Mukhtar] dari [Muhammad bin Ishaq] dari pamannya [Abdurrahman bin Yasar] dari ['ubaidhullah bin Abu Rafi'] dari [Ali] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila telah datang sepertiga malam atau pertengahan malam…\" kemudian ia menyebutkan hadits mengenai turunnya Allah.\" "
            },
            {
                "number": 1094,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ عَنْ عَطَاءٍ مَوْلَى أُمِّ صُبَيَّةَ عَنْ أَبِي هُرَيْرَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَمَرْتُهُمْ بِالسِّوَاكِ عِنْدَ كُلِّ صَلَاةٍ وَلَأَخَّرْتُ الْعِشَاءَ الْآخِرَةَ إِلَى ثُلُثِ اللَّيْلِ فَإِنَّهُ إِذَا مَضَى ثُلُثُ اللَّيْلِ الْأَوَّلُ هَبَطَ اللَّهُ إِلَى السَّمَاءِ الدُّنْيَا فَلَمْ يَزَلْ هُنَالِكَ حَتَّى يَطْلُعَ الْفَجْرُ يَقُولُ قَائِلٌ أَلَا سَائِلٌ يُعْطَى أَلَا دَاعٍ يُجَابُ أَلَا سَقِيمٌ يَسْتَشْفِي فَيُشْفَى أَلَا مُذْنِبٌ يَسْتَغْفِرُ فَيُغْفَرَ لَهُ أَخْبَرَنَا مُحَمَّدٌ حَدَّثَنَا يَعْقُوبُ حَدَّثَنِي أَبِي عَنْ ابْنِ إِسْحَقَ حَدَّثَنِي عَمِّي عَبْدُ الرَّحْمَنِ بْنُ يَسَارٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ حَدِيثِ أَبِي هُرَيْرَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya] telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Ayahku] dari [Ibnu Ishaq] telah menceritakan kepadaku [Sa'id? bin Abu Sa'id Al Maqburi] dari ['Atha`] mantan budak Ummu Shubayyah, dari [Abu Hurairah] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya tidak memberatkan umatku niscaya akan aku memerintahkan mereka untuk bersiwak (gosok gigi) setiap kali akan melakukan sholat, dan aku akan menunda sholat Isya hingga sepertiga malam. Sesungguhnya apabila telah berlalu sepertiga malam pertama, Allah turun ke langit dunia dan akan tetap berada di sana hingga terbit fajar. Lalu seorang penyeru (Allah) berkata, 'Adakah orang yang memohon sehingga ia diberi? Adakah orang yang berdoa sehingga dikabulkan doanya? Adakah orang sakit yang memohon kesembuhan hingga ia disembuhkan? Adakah orang yang berbuat dosa dan meminta ampun hingga ia diampuni?\" Telah mengabarkan kepada kami [Muhammad] telah menceritakan kepada kami [Ya'qub] telah menceritakan kepadaku [Ayahku] dari [Abu Ishaq] telah menceritakan kepadaku pamanku [Abdurrahman bin Yasar] dari ['ubaidhullah bin Abu Rafi'] mantan budak Rasulullah shallallahu 'alaihi wasallam, dari [Ayahnya] dari [Ali bin Abu Thalib] dari Rasulullah shallallahu 'alaihi wasallam seperti hadits Abu Hurairah.\" "
            },
            {
                "number": 1095,
                "arab": " حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سُفْيَانُ هُوَ ابْنُ عُيَيْنَةَ عَنْ سُلَيْمَانَ الْأَحْوَلِ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ يَتَهَجَّدُ مِنْ اللَّيْلِ قَالَ اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ أَنْتَ مَلِكُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ أَنْتَ الْحَقُّ وَقَوْلُكَ الْحَقُّ وَوَعْدُكَ الْحَقُّ وَلِقَاؤُكَ حَقٌّ وَالْجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ وَالْبَعْثُ حَقٌّ وَالنَّبِيُّونَ حَقٌّ وَمُحَمَّدٌّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَقٌّ اللَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ وَإِلَيْكَ حَاكَمْتُ فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَعْلَنْتُ وَمَا أَسْرَرْتُ أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِكَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Sufyan] -yaitu Ibnu 'Uyainah- dari [Sulaiman Al Ahwal] dari [Thawus] dari [Ibnu Abbas] ia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam sholat tahajjud di malam hari, beliau berdoa: 'ALLAAHUMMA LAKAL HAMDU ANTA NUURUS SAMAAWAATI WAL ARDLI WA MAN FIIHINNA WALAKAL HAMDU ANTA QAYYIMUS SAMAAWAATI WAL ARDLI WA MAN FIIHINNA. WA LAKAL HAMDU ANTA MALIKUS SAMAAWAATI WAL ARDLI WA MAN FIIHINNA, ANTAL HAQQU WA QAULUKAL HAQQU WA WA'DUKAL HAQQU WA LIQAAUKA HAQQUN WAL JANNATU HAQQUN WAN NAARU HAQQUN WAL BA'TSU HAQQUN WAN NABIYUUNA HAQQUN WA MUHAMMADUN shallallahu 'alaihi wasallam HAQQUN. ALLAAHUMMA LAKA ASLAMTU WA BIKA AAMANTU WA 'ALAIKA TAWAKKKALTU, WA ILAIKA ANABTU WA BIKA KHAASHAMTU WA ILAIKA HAAKAMTU, FAGHFIR LII MAA QADDAMTU WA MAA AKHKHARTU WA MAA A'LANTU WA MAA ASRARTU. ANTAL MUQADDIMU WA ANTAL MUAKHKHIRU LAA ILAAHA ILLAA ANTA. WA LAA HAULA WA LAA QUWWATA ILLAA BIKA (Ya Allah, segala puji bagi-Mu, Engkau adalah cayaha langit dan bumi dan orang-orang yang ada di antaranya, segala puji bagi-Mu, Engkau Yang selalu mengatur langit dan bumi dan orang-orang yang ada padanya, segala puji bagi-Mu, Engkau Raja langit dan bumi dan orang-orang yang ada padanya, Engkau adalah Al Haq, perkataan-Mu adalah benar, janji-Mu benar, pertemuan dengan-Mu adalah benar, Surga adalah benar, Neraka adalah benar, pembangkitan adalah benar, para nabi adalah benar, dan Muhammad shallallahu 'alaihi wasallam adalah benar. Ya Allah, kepada-Mu aku berserah diri, dan kepada-Mu aku beriman, kepada-Mu aku bertawakal dan kepada-Mu aku kembali, dengan-Mu aku menghadapi lawan, dan kepada-Mu aku berhukum. Maka ampunilah untukku apa yang telah aku lakukan dan apa yang aku tunda, yang aku perlihatkan dan yang aku sembunyikan. Engkau yang mendahulukan dan mengakhirkan, tidak ada tuhan yang berhak disembah kecuali Engkau dan tidak ada daya serta kekuatan kecuali karena-Mu).\""
            },
            {
                "number": 1096,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ شُعْبَةَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ أَبِي مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ قَرَأَ الْآيَتَيْنِ الْآخِرَتَيْنِ مِنْ سُورَةِ الْبَقَرَةِ فِي لَيْلَةٍ كَفَتَاهُ",
                "id": "Telah menceritakan kepada kami [Sa'id? bin 'Amir] dari [Syu'bah] dari [Manshur] dari [Ibrahim] dari [Abdurrahman bin Yazid] dari [Abu Mas'ud] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Barangsiapa membaca dua ayat terakhir dari surat Al Baqarah pada malam hari, maka keduanya akan memberikan perlindungan kepadanya.\""
            },
            {
                "number": 1097,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَذِنَ اللَّهُ لِشَيْءٍ كَإِذْنِهِ لِنَبِيٍّ يَتَغَنَّى بِالْقُرْآنِ يَجْهَرُ بِهِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah Allah memberikan izin kepada sesuatu seperti Dia memberikan izin kepada seorang Nabi melantunkan Al Qur'an dan mengeraskannya.\""
            },
            {
                "number": 1098,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ قَالَ ابْنُ عُيَيْنَةَ أُرَاهُ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ سَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَا مُوسَى وَهُوَ يَقْرَأُ فَقَالَ لَقَدْ أُوتِيَ هَذَا مِنْ مَزَامِيرِ آلِ دَاوُدَ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Az Zuhri], [Ibnu 'Uyainah] berkata, menurutku dari ['Urwah] dari [Aisyah] ia berkata, \"Nabi shallallahu 'alaihi wasallam mendengar Abu Musa membaca Al-Qur'an, kemudian beliau berkata: \"Sungguh orang ini telah diberi sebagian dari seruling keluarga Daud.\""
            },
            {
                "number": 1099,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو يَعْنِي ابْنَ دِينَارٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي نَهِيكٍ عَنْ سَعْدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ مِنَّا مَنْ لَمْ يَتَغَنَّ بِالْقُرْآنِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad bin Abu Khalaf] telah menceritakan kepada kami [Sufyan] dari ['Amru] -yaitu Ibnu Dinar- dari [Ibnu Abu Mulaikah] dari ['ubaidhullah bin Abu Nuhaik] dari [Sa'd], bahwa Nabi shallallahu 'alaihi wasallam berkata: \"Bukan dari golongan kami orang yang tidak melantunkan Al Qur'an.\""
            },
            {
                "number": 1100,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا أَذِنَ اللَّهُ لِشَيْءٍ مَا أَذِنَ لِنَبِيٍّ يَتَغَنَّى بِالْقُرْآنِ قَالَ أَبُو مُحَمَّد يُرِيدُ بِهِ الِاسْتِغْنَاءَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidaklah Allah memberikan izin kepada sesuatu seperti Dia memberikan izin kepada seorang Nabi untuk melantunkan Al Qur'an.\" Abu Muhammad berkata, \"Yang beliau inginkan adalah merasa cukup.\" "
            },
            {
                "number": 1101,
                "arab": " أَخْبَرَنَا بِشْرُ بْنُ عُمَرَ الزَّهْرَانِيُّ حَدَّثَنَا شُعْبَةُ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ حَفْصِ بْنِ عَاصِمٍ عَنْ أَبِي سَعِيدِ بْنِ الْمُعَلَّى قَالَ مَرَّ بِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلَمْ يَقُلْ اللَّهُ { يَا أَيُّهَا الَّذِينَ آمَنُوا اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ } ثُمَّ قَالَ أَلَا أُعَلِّمُكَ سُورَةً أَعْظَمَ سُورَةٍ مِنْ الْقُرْآنِ قَبْلَ أَنْ أَخْرُجَ مِنْ الْمَسْجِدِ فَلَمَّا أَرَادَ أَنْ يَخْرُجَ قَالَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ وَهِيَ السَّبْعُ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُوتِيتُمْ",
                "id": "Telah mengabarkan kepada kami [Bisyr bin Umar Az Zahrani] telah menceritakan kepada kami [Syu'bah] dari [Khubaib bin Abdurrahman] dari [Hafsh bin 'Ashim] dari [Abu Sa'id bin Al Mu'alla] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melewatiku dan berkata: \"Bukankah Allah berfirman: 'Penuhilah seruan Allah dan seruan Rasul apabila Rasul menyeru kamu'.? (Qs.?Al Anfal: 24) Kemudian beliau bersabda: \"Maukah aku ajarkan kepadamu surat terbesar dari Al Qur'an sebelum aku keluar dari masjid?\" Maka ketika akan keluar beliau mengucapkan: \"Al HAMDU LILLAAHI RABBIL 'AALAMIIN (Surat Al Faatihah), itu adalah As Sab'u Al Matsaani, dan Al Qur'an Al 'Azhiim yang diberikan kepada kalian.\""
            },
            {
                "number": 1102,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَبِي الْعَلَاءِ يَزِيدَ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَفْقَهُ مَنْ قَرَأَ الْقُرْآنَ فِي أَقَلَّ مِنْ ثَلَاثٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Minhal] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Abu Al 'Ala` Yazid bin Abdullah] dari [Abdullah bin 'Amru] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak akan paham orang yang membaca Al Qur'an kurang dari tiga hari.\""
            },
            {
                "number": 1103,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا نُودِيَ بِالْأَذَانِ أَدْبَرَ الشَّيْطَانُ لَهُ ضُرَاطٌ حَتَّى لَا يَسْمَعَ الْأَذَانَ فَإِذَا قُضِيَ الْأَذَانُ أَقْبَلَ فَإِذَا ثُوِّبَ أَدْبَرَ فَإِذَا قُضِيَ التَّثْوِيبُ أَقْبَلَ حَتَّى يَخْطِرَ بَيْنَ الْمَرْءِ وَنَفْسِهِ فَيَقُولُ اذْكُرْ كَذَا اذْكُرْ كَذَا لِمَا لَمْ يَكُنْ يَعْنِي يَذْكُرُ حَتَّى يَظَلَّ الرَّجُلُ إِنْ يَدْرِي كَمْ صَلَّى فَإِذَا لَمْ يَدْرِ أَحَدُكُمْ كَمْ صَلَّى ثَلَاثًا أَمْ أَرْبَعًا فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila diserukan adzan, maka setan lari berpaling darinya dan mengeluarkan kentut hingga ia tidak mendengar adzan. Jika adzan telah selesai maka ia kembali, kemudian apabila dikumandangkan maka ia akan lari lagi. Jika telah selesai dikumandangkan maka ia kembali hingga ia membisikkan antara seseorang dan hatinya, ia katakan, 'Ingatlah ini, ingatlah ini', sesuatu yang sebelumnya tidak pernah terlintas olehnya. Sehingga orang tersebut tidak mengetahui berapa rakaat yang telah ia kerjakan. Kemudian apabila salah seorang di antara kalian tidak mengetahui berapa rakaat yang telah dikerjakannya, tiga atau empat, maka hendaknya ia sujud dua kali ketika ia dalam keadaan duduk.\""
            },
            {
                "number": 1104,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا عَبْدُ الْعَزِيزِ هُوَ ابْنُ أَبِي سَلَمَةَ الْمَاجِشُونُ أَخْبَرَنَا زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا لَمْ يَدْرِ أَحَدُكُمْ أَثَلَاثًا صَلَّى أَمْ أَرْبَعًا فَلْيَقُمْ فَلْيُصَلِّ رَكْعَةً ثُمَّ يَسْجُدُ بَعْدَ ذَلِكَ سَجْدَتَيْنِ فَإِنْ كَانَ صَلَّى خَمْسًا شَفَعَتَا لَهُ صَلَاتَهُ وَإِنْ كَانَ صَلَّى أَرْبَعًا كَانَتَا تَرْغِيمًا لِلشَّيْطَانِ قَالَ أَبُو مُحَمَّد آخُذُ بِهِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abdul Aziz] -yaitu Ibnu Abu Salamah Al Majisyun- telah mengabarkan kepada kami [Zaid bin Aslam] dari ['Atha` bin Yasar] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian tidak mengetahui apakah ia melakukan sholat tiga rakaat atau empat rakaat, maka hendaknya ia berdiri dan sholat satu rakaat, setelah itu sujud dua kali. Jika ia telah mengerjakan lima rakaat maka dua sujud tersebut telah mengembalikannya kepada bilangan genap, dan apabila ia melakukan sholat empat rakaat maka kedua sujud tersebut menjadi sebab kemarahan setan.\" Abu Muhammad berkata, \"Aku berpendapat seperti itu.\" "
            },
            {
                "number": 1105,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا ابْنُ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِحْدَى صَلَاتَيْ الْعَشِيِّ فَصَلَّى رَكْعَتَيْنِ ثُمَّ سَلَّمَ وَقَامَ إِلَى خَشَبَةٍ مُعْتَرِضَةٍ فِي الْمَسْجِدِ فَوَضَعَ يَدَهُ عَلَيْهَا قَالَ يَزِيدُ وَأَرَانَا ابْنُ عَوْنٍ وَوَضَعَ كَفَّيْهِ إِحْدَاهُمَا عَلَى ظَهْرِ الْأُخْرَى وَأَدْخَلَ أَصَابِعَهُ الْعُلْيَا فِي السُّفْلَى وَاضِعًا وَقَامَ كَأَنَّهُ غَضْبَانُ قَالَ فَخَرَجَ السَّرَعَانُ مِنْ النَّاسِ وَجَعَلُوا يَقُولُونَ قُصِرَتْ الصَّلَاةُ قُصِرَتْ الصَّلَاةُ وَفِي الْقَوْمِ أَبُو بَكْرٍ وَعُمَرُ فَلَمْ يَتَكَلَّمَا وَفِي الْقَوْمِ رَجُلٌ طَوِيلُ الْيَدَيْنِ يُسَمَّى ذُو الْيَدَيْنِ فَقَالَ يَا رَسُولَ اللَّهِ أَنَسِيتَ الصَّلَاةَ أَمْ قُصِرَتْ فَقَالَ مَا نَسِيتُ وَلَا قُصِرَتْ الصَّلَاةُ فَقَالَ أَوَ كَذَلِكَ قَالُوا نَعَمْ قَالَ فَرَجَعَ فَأَتَمَّ مَا بَقِيَ ثُمَّ سَلَّمَ وَكَبَّرَ فَسَجَدَ طَوِيلًا ثُمَّ رَفَعَ رَأْسَهُ فَكَبَّرَ وَسَجَدَ مِثْلَ مَا سَجَدَ ثُمَّ رَفَعَ رَأْسَهُ وَانْصَرَفَ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Ibnu 'Aun] dari [Muhammad] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat dari salah satu sholat ?Al 'Asyi (zhuhur dan asar), beliau sholat dua rakaat dan salam. Kemudian beliau berdiri menuju kayu yang membentang di masjid seraya meletakkan tangan di atas kayu tersebut -Yazid berkata, \"Ibnu 'Aun memperlihatkan kepada kami. Ia meletakkan salah satu telapak tangannya di atas punggung tangan yang lainnya, lalu memasukkan jari-jarinya yang di atas pada jari-jari yang di bawah-, beliau berdiri seolah-olah sedang marah.\" Abu Hurairah berkata, \"Lalu ada beberapa orang keluar dengan cepat, mereka mengatakan, 'sholat telah diringkas, sholat telah diringkas.' Padahal di antara para sahabat tersebut terdapat Abu Bakr dan Umar, namun mereka tidak berbicara apa pun. Dan di antara mereka ada seorang laki-laki yang panjang kedua tangannya, ia biasa dipanggil Dzul Yadain, laki-laki itu berkata, \"Wahai Rasulullah, apakah anda lupa sholat atau sholat tersebut diringkas?\" Beliau lalu mengatakan: \"Aku tidak lupa dan sholatnya juga tidak diringkas.\" Setelah itu beliau bertanya: \"Apakah demikian?\" Orang-orang menjawab, \"Ya.\" Abu Hurairah berkata, \"Kemudian beliau kembali dan menyempurnakan sholat yang tersisa, selesai salam beliau takbir dan sujud lama, kemudian mengangkat kepalanya dan sujud seperti sujud yang pertama (lama). Kemudian beliau mengangkat kepalanya dan berlalu pergi.\" "
            },
            {
                "number": 1106,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي ابْنُ الْمُسَيَّبِ وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ وَأَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ وَعُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ أَنَّ أَبَا هُرَيْرَةَ قَالَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الظُّهْرِ أَوْ الْعَصْرِ فَسَلَّمَ فِي رَكْعَتَيْنِ مِنْ إِحْدَاهُمَا فَقَالَ لَهُ ذُو الشِّمَالَيْنِ بْنُ عَبْدِ عَمْرِو بْنِ نَضْلَةَ الْخُزَاعِيُّ وَهُوَ حَلِيفُ بَنِي زُهْرَةَ أَقُصِرَتْ أَمْ نَسِيتَ يَا رَسُولَ اللَّهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ أَنْسَ وَلَمْ تُقْصَرْ فَقَالَ ذُو الشِّمَالَيْنِ قَدْ كَانَ بَعْضُ ذَلِكَ يَا رَسُولَ اللَّهِ فَأَقْبَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى النَّاسِ فَقَالَ أَصَدَقَ ذُو الْيَدَيْنِ قَالُوا نَعَمْ يَا رَسُولَ اللَّهِ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَمَّ الصَّلَاةَ وَلَمْ يُحَدِّثْنِي أَحَدٌ مِنْهُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ فِي تِلْكَ الصَّلَاةِ وَذَلِكَ فِيمَا نُرَى وَاللَّهُ أَعْلَمُ مِنْ أَجْلِ أَنَّ النَّاسَ يَقَّنُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى اسْتَيْقَنَ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Ibnu Al Musayyab] dan [Abu Salamah bin Abdurrahman] dan [Abu Bakr bin Abdurrahman] dan ['ubaidhullah bin Abdullah] bahwa [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melakukan sholat zhuhur atau asar, lalu beliau salam pada rakaat kedua di antara kedua sholat tersebut. Lalu Dzusy Syimalain bin 'Abdu 'Amru bin Nadllah Al Khuza'I -sekutu Bani Zuhrah- berkata, \"Wahai Rasulullah, apakah sholat tersebut diringkas atau anda yang lupa?\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku tidak lupa dan sholat tersebut juga tidak diringkas.\" Kemudian Dzusy Syimalain berkata, \"Wahai Rasulullah, sebagian (yang engkau katakan) itu telah terjadi! \" Kemudian Rasulullah shallallahu 'alaihi wasallam menghadap kepada orang-orang dan berkata: \"Apakah Dzul Yadain berkata jujur?\" Mereka menjawab, \"Benar wahai Rasulullah! \" Rasulullah shallallahu 'alaihi wasallam lalu berdiri menyempurnakan sholat, dan tidak seorangpun di antara mereka menceritakan kepadaku bahwa saat itu Rasulullah shallallahu 'alaihi wasallam sujud dua kali dalam keadaan duduk. Dan hal tersebut dalam perkara yang diperlihatkan kepada kami. Wallahu a'lam, karena orang-orang telah meyakinkan Rasulullah shallallahu 'alaihi wasallam hingga beliau merasa yakin.\""
            },
            {
                "number": 1107,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى الظُّهْرَ خَمْسًا فَقِيلَ لَهُ فَسَجَدَ سَجْدَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Sa'id? bin 'Amir] dari [Syu'bah] dari [Al Hakam] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau pernah melaksanakan sholat zhuhur lima rakaat, kemudian hal itu diberitahukan kepadanya hingga beliau pun sujud dua kali.\" "
            },
            {
                "number": 1108,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ الْأَعْرَجِ عَنْ ابْنِ بُحَيْنَةَ قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ ثُمَّ قَامَ وَلَمْ يَجْلِسْ وَقَامَ النَّاسُ فَلَمَّا قَضَى الصَّلَاةَ نَظَرْنَا تَسْلِيمَهُ فَكَبَّرَ فَسَجَدَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ قَبْلَ أَنْ يُسَلِّمَ ثُمَّ سَلَّمَ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari [Abdurrahman bin Hurmuz Al A'raj] dari [Ibnu Buhainah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat bersama kami dua rakaat, kemudian berdiri dan tidak duduk hingga orang-orang pun berdiri. Ketika beliau menyelesaikan sholat, kami melihat salam beliau, lalu beliau takbir dan sujud dua kali dalam keadaan duduk sebelum mengucapkan salam, kemudian beliau mengucapkan salam.\" "
            },
            {
                "number": 1109,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْفَضْلِ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ مَالِكِ ابْنِ بُحَيْنَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِي الرَّكْعَتَيْنِ مِنْ الظُّهْرِ أَوْ الْعَصْرِ فَلَمْ يَرْجِعْ حَتَّى فَرَغَ مِنْ صَلَاتِهِ ثُمَّ سَجَدَ سَجْدَتَيْ الْوَهْمِ ثُمَّ سَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Fadlal] telah menceritakan kepada kami [Hammad bin Salamah] dari [Yahya bin Sa'id] dari [Abdurrahman Al A'raj] dari [Malik bin Buhainah], bahwa Rasulullah shallallahu 'alaihi wasallam berdiri pada dua rakaat saat mengerjakan sholat zhuhur atau asar, dan tidak kembali (duduk untuk tasyahud) hingga selesai dari sholatnya. Kemudian beliau sahwi dengan dua kali sujud, lalu mengucapkan salam.\" "
            },
            {
                "number": 1110,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ عَنْ الْمَسْعُودِيِّ عَنْ زِيَادِ بْنِ عِلَاقَةَ قَالَ صَلَّى بِنَا الْمُغِيرَةُ بْنُ شُعْبَةَ فَلَمَّا صَلَّى رَكْعَتَيْنِ قَامَ وَلَمْ يَجْلِسْ فَسَبَّحَ بِهِ مَنْ خَلْفَهُ فَأَشَارَ إِلَيْهِمْ أَنْ قُومُوا فَلَمَّا فَرَغَ مِنْ صَلَاتِهِ سَلَّمَ وَسَجَدَ سَجْدَتَيْ السَّهْوِ وَسَلَّمَ وَقَالَ هَكَذَا صَنَعَ بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَزِيدُ يُصَحِّحُونَهُ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] dari [Al Mas'udi] dari [Ziyad bin 'Ilaqah] ia berkata, [Al Mughirah bin Syu'bah] sholat bersama kami, kemudian ketika telah mendapatkan dua rakaat ia berdiri dan tidak duduk (untuk tasyahud), sehingga orang-orang yang di belakangnya mengucapkan tasbih. Tetapi ia memberikan isyarat kepada mereka agar berdiri, maka telah selesai ia mengucapkan salam dan sujud sahwi dengan dua kali sujud, lalu mengucapkan salam seraya mengatakan, \"Demikianlah yang Rasulullah shallallahu 'alaihi wasallam lakukan bersama kami.\" Yazid berkata, \"Orang-orang pun membenarkannya.\" "
            },
            {
                "number": 1111,
                "arab": " حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ مُعَاوِيَةَ بْنِ الْحَكَمِ السُّلَمِيِّ قَالَ بَيْنَا أَنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّلَاةِ إِذْ عَطَسَ رَجُلٌ مِنْ الْقَوْمِ فَقُلْتُ يَرْحَمُكَ اللَّهُ قَالَ فَحَدَّقَنِي الْقَوْمُ بِأَبْصَارِهِمْ فَقُلْتُ وَا ثُكْلَاهُ مَا لَكُمْ تَنْظُرُونَ إِلَيَّ قَالَ فَضَرَبَ الْقَوْمُ بِأَيْدِيهِمْ عَلَى أَفْخَاذِهِمْ فَلَمَّا رَأَيْتُهُمْ يُسْكِتُونَنِي قُلْتُ مَا لَكُمْ تُسْكِتُونَنِي لَكِنِّي سَكَتُّ قَالَ فَلَمَّا انْصَرَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبِأَبِي هُوَ وَأُمِّي مَا رَأَيْتُ مُعَلِّمًا قَبْلَهُ وَلَا بَعْدَهُ أَحْسَنَ تَعْلِيمًا مِنْهُ وَاللَّهِ مَا ضَرَبَنِي وَلَا كَهَرَنِي وَلَا سَبَّنِي وَلَكِنْ قَالَ إِنَّ صَلَاتَنَا هَذِهِ لَا يَصْلُحُ فِيهَا شَيْءٌ مِنْ كَلَامِ النَّاسِ إِنَّمَا هِيَ التَّسْبِيحُ وَالتَّكْبِيرُ وَتِلَاوَةُ الْقُرْآنِ حَدَّثَنَا صَدَقَةُ أَخْبَرَنَا ابْنُ عُلَيَّةَ وَيَحْيَى بْنُ سَعِيدٍ عَنْ حَجَّاجٍ الصَّوَّافِ عَنْ يَحْيَى عَنْ هِلَالٍ عَنْ عَطَاءٍ عَنْ مُعَاوِيَةَ بِنَحْوِهِ",
                "id": "Telah menceritakan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] dari [Yahya] dari [Hilal bin Abu Maimunah] dari ['Atha` bin Yasar] dari [Mu'awiyah bin Al Hakam As Sulami] ia berkata, \"Ketika aku bersama Rasulullah shallallahu 'alaihi wasallam sedang mengerjakan sholat, tiab-tiab ada seseorang yang bersin, lalu aku mengucapkan 'YARHAMUKALLAAH.'\" Mu'awiyah berkata, \"Kemudian orang-orang melihat tajam kepadaku dengan mata mereka. Aku lalu berkata, \"Aduhai, kenapa kalian melihat kepadaku?\" Mu'awiyah berkata, \"Kemudian orang-orang tersebut memukul paha mereka menggunakan tangan mereka. Saat aku melihat, ternyata mereka menyuruhku diam. Maka aku katakan, 'Kenapa kalian menyuruh aku diam? ' Akan tetapi aku telah diam.\" Mu'awiyah berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam selesai sholat, maka debi bapak dan ibuku, aku tidak pernah melihat seorang pengajar sebelum dan setelahnya yang lebih baik dari beliau. Demi Allah! Beliau tidak memukulku, tidak membentak dan tidak mencelaku, akan tetapi beliau berkata: \"Sungguh, sholat kita ini tidak layak jika diselingi dengan perkataan manusia. Sesungguhnya sholat tersebut adalah tasbih, takbir dan membaca Al Qur'an.\" Telah menceritakan kepada kami [Shadaqah] telah mengabarkan kepada kami [Ibnu 'Ulayyah] dan [Yahya bin Sa'd] dari [Hajjaj Ash Shawwaf] dari [Yahya] dari [Hilal] dari ['Atha`] dari [Mu'awiyah] dengan hadits seperti itu.\" "
            },
            {
                "number": 1112,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هِشَامٌ عَنْ يَحْيَى عَنْ ضَمْضَمٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْأَسْوَدَيْنِ فِي الصَّلَاةِ قَالَ يَحْيَى وَالْأَسْوَدَيْنِ الْحَيَّةُ وَالْعَقْرَبُ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Hisyam] dari [Yahya] dari [Dlamdlam] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk membunuh ?Al Aswadaini dalam sholat.\" Yahya berkata, \"Al Aswadaini adalah ular dan kalajengking.\" "
            },
            {
                "number": 1113,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ أَبِي عَمَّارٍ عَنْ عَبْدِ اللَّهِ بْنِ بَابَيْهِ عَنْ يَعْلَى بْنِ أُمَيَّةَ قَالَ قُلْتُ لِعُمَرَ بْنِ الْخَطَّابِ قَالَ اللَّهُ تَعَالَى { أَنْ تَقْصُرُوا مِنْ الصَّلَاةِ إِنْ خِفْتُمْ } فَقَدْ أَمِنَ النَّاسُ قَالَ عَجِبْتُ مِمَّا عَجِبْتَ مِنْهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَقَةٌ تَصَدَّقَ اللَّهُ بِهَا عَلَيْكُمْ فَاقْبَلُوهَا",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Ibnu Abu 'Ammar] dari [Abdullah bin Babaih] dari [Ya'la bin Umayyah] ia berkata, \"Aku katakan kepada [Umar bin Al Khathab, \"Allah Ta'ala berfirman: '(Kamu men-qashar sembahyang(mu), jika kamu takut) ' (Qs. An Nisa: 101). Sementara orang-orang sekarang telah merasa aman?\" Umar menjawab, \"Aku juga pernah heran sebagaimana engkau heran. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Itu adalah sedekah yang telah Allah berikan kepada kalian, maka terimalah sedekah-Nya.\""
            },
            {
                "number": 1114,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِمِنًى رَكْعَتَيْنِ وَأَبُو بَكْرٍ رَكْعَتَيْنِ وَعُمَرُ رَكْعَتَيْنِ وَعُثْمَانُ رَكْعَتَيْنِ صَدْرًا مِنْ إِمَارَتِهِ ثُمَّ أَتَمَّهَا بَعْدَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Al Auza'i] dari [Az Zuhri] dari [Salim] dari [Ayahnya], bahwa Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat dua rakaat di Mina, Abu Bakr dua rakaat, Umar dua rakaat, dan Utsman dua rakaat di awal pemerintahannya, kemudian ia menyempurnakannya setelah itu.\" "
            },
            {
                "number": 1115,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ صَلَّيْنَا الظُّهْرَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ أَرْبَعًا وَصَلَّيْنَا مَعَهُ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Muhammad bin Al Munkadir] dari [Anas bin Malik] ia berkata, \"Di Madinah kami sholat zhuhur bersama Nabi shallallahu 'alaihi wasallam empat rakaat, dan di Dzul Hulaifah kami sholat bersama beliau dua rakaat.\" "
            },
            {
                "number": 1116,
                "arab": " حَدَّثَنَا عُثْمَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ وَمُحَمَّدِ بْنِ الْمُنْكَدِرِ أَنَّهُمَا سَمِعَا أَنَسَ بْنَ مَالِكٍ يَقُولُ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ أَرْبَعًا وَبِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Muhammad] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Ibrahim bin Maisarah] dan [Muhammad bin Al Munkadir] bahwa keduanya mendengar [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat di Madinah empat rakaat dan di Dzul Hulaifah dua rakaat.\" "
            },
            {
                "number": 1117,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ قَالَ سَمِعْتُ الزُّهْرِيَّ يَذْكُرُ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْ إِنَّ الصَّلَاةَ أَوَّلَ مَا فُرِضَتْ رَكْعَتَيْنِ فَأُقِرَّتْ صَلَاةُ السَّفَرِ وَأُتِمَّتْ صَلَاةُ الْحَضَرِ فَقُلْتُ مَا لَهَا كَانَتْ تُتِمُّ الصَّلَاةَ فِي السَّفَرِ قَالَ إِنَّهَا تَأَوَّلَتْ كَمَا تَأَوَّلَ عُثْمَانُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan bin 'Uyainah] ia berkata, aku mendengar [Az Zuhri] menyebutkan dari ['Urwah bin Az Zubair] dari [Aisyah] ia berkata, \"Sesungguhnya sholat pertama kali diwajibkan adalah dua rakaat, kemudian ditetapkan sebagai sholat safar dan sholat disempurnakan ketika bermukim.\" Kemudian aku katakan, \"Kenapa Aisyah menyempurnakan sholat di saat melakukan safar?\" Az Zuhri menjawab, \"Ia mentakwil (memahami tidak seperti zhahirnya hadits) sebagaimana Utsman mentakwil.\""
            },
            {
                "number": 1118,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ يَحْيَى هُوَ ابْنُ أَبِي إِسْحَقَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ خَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلَ يَقْصُرُ حَتَّى قَدِمْنَا مَكَّةَ فَأَقَامَ بِهَا عَشَرَةَ أَيَّامٍ يَقْصُرُ حَتَّى رَجَعَ وَذَلِكَ فِي حَجِّهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Yahya] -yaitu Ibnu Abu Ishaq- dari [Anas bin Malik] ia berkata, \"Kami pernah keluar bersama Nabi shallallahu 'alaihi wasallam, kemudian beliau mengqashar (sholat) hingga kami sampai di Makkah, beliau bermukim di sana selama sepuluh hari, dan beliau tetap mengqashar sholat hingga kembali. Hal itu terjadi pada saat beliau haji.\""
            },
            {
                "number": 1119,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ إِسْمَعِيلَ بْنِ مُحَمَّدٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ السَّائِبِ بْنِ يَزِيدَ عَنْ الْعَلَاءِ بْنِ الْحَضْرَمِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُكْثُ الْمُهَاجِرِ بَعْدَ قَضَاءِ نُسُكِهِ ثَلَاثٌ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Isma'il bin Muhammad] dari [Humaid bin Abdurrahman bin 'Auf] dari [As Sa`ib bin Yazid] dari [Al 'Ala` bin Al Hadlrami] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang hijrah boleh tinggal di Makkah selama tiga hari setelah ibadah hajinya selesai.\" "
            },
            {
                "number": 1120,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا حَفْصٌ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ السَّائِبِ بْنِ يَزِيدَ عَنْ الْعَلَاءِ بْنِ الْحَضْرَمِيِّ قَالَ رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْمُهَاجِرِينَ أَنْ يُقِيمُوا ثَلَاثًا بَعْدَ الصَّدَرِ بِمَكَّةَ قَالَ أَبُو مُحَمَّد أَقُولُ بِهِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Hafsh] telah menceritakan kepada kami [Abdurrahman bin Humaid bin Abdurrahman bin 'Auf] dari [As Sa`ib bin Yazid] dari [Al 'Ala` bin Al Hadlrami] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memberikan rukhshah bagi orang-orang untuk bermukim selama tiga hari setelah sampai di Makkah.\" Abu Muhammad berkata, \"Aku berpendapat seperti itu.\" "
            },
            {
                "number": 1121,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هِشَامٌ الدَّسْتَوَائِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ عَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي عَلَى رَاحِلَتِهِ نَحْوَ الْمَشْرِقِ فَإِذَا أَرَادَ أَنْ يُصَلِّيَ الْمَكْتُوبَةَ نَزَلَ فَاسْتَقْبَلَ الْقِبْلَةَ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Hisyam Ad Dastawai] dari [Yahya bin Abu Katsir] dari [Muhammad bin Abdurrahman bin Tsauban] dari [Jabir], bahwa Rasulullah shallallahu 'alaihi wasallam melakukan sholat di atas kendaraannya menghadap ke timur, apabila beliau hendak melakukan sholat wajib beliau turun dan menghadap ke kiblat.\" "
            },
            {
                "number": 1122,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ حَدَّثَنِي عُقَيْلٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ رَبِيعَةَ أَنَّ عَامِرَ بْنَ رَبِيعَةَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَبِّحُ وَهُوَ عَلَى الرَّاحِلَةِ وَيُومِي بِرَأْسِهِ قِبَلَ أَيِّ وَجْهٍ تَوَجَّهَ وَلَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ ذَلِكَ فِي الصَّلَاةِ الْمَكْتُوبَةِ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah menceritakan kepadaku ['Uqail] dari [Az Zuhri] ia berkata, telah mengabarkan kepadaku [Abdullah bin 'Amir bin Rabi'ah] bahwa ['Amir bin Rabi'ah] berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam melakukan sholat sementara beliau berada di atas kendaraannya, beliau memberikan isyarat menggunakan kepalanya ke arah manapun beliau mengarah, namun Rasulullah shallallahu 'alaihi wasallam tidak pernah melakukan hal itu pada sholat wajib.\" "
            },
            {
                "number": 1123,
                "arab": " أَخْبَرَنَا أَبُو عَلِيٍّ الْحَنَفِيُّ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ أَنَّ أَبَا الطُّفَيْلِ عَامِرَ بْنَ وَاثِلَةَ أَخْبَرَهُ أَنَّ مُعَاذَ بْنَ جَبَلٍ أَخْبَرَهُ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ غَزْوَةِ تَبُوكَ وَكَانَ يَجْمَعُ الصَّلَاةَ فَصَلَّى الظُّهْرَ وَالْعَصْرَ جَمِيعًا ثُمَّ دَخَلَ ثُمَّ خَرَجَ بَعْدَ ذَلِكَ فَصَلَّى الْمَغْرِبَ وَالْعِشَاءَ جَمِيعًا",
                "id": "Telah mengabarkan kepada kami [Abu Ali Al Hanafi] telah menceritakan kepada kami [Malik bin Anas] dari [Abu Az Zubair Al Makki] bahwa [Abu Ath Thufail 'Amir bin Watsilah] telah mengabarkan kepadanya, bahwa [Mu'adz bin Jabal] telah mengabarkan kepadanya, ia berkata, \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam di tahun terjadinya perang Tabuk. Beliau menjamak sholat, beliau kerjakan sholat zhuhur dan asar secara jamak, beliau kemudian masuk dan keluar lagi setelah itu, lalu beliau sholat Maghrib dan Isya secara jamak.\""
            },
            {
                "number": 1124,
                "arab": " حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْخَطْمِيِّ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الْمَغْرِبَ وَالْعِشَاءَ بِجَمْعٍ فَجَمَعَ بَيْنَهُمَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin Sa'id] dari [Adi bin Tsabit] dari [Abdullah bin Yazid Al Khathmi] dari [Abu Ayyub Al Anshari], bahwa Rasulullah shallallahu 'alaihi wasallam melakukan Maghrib serta Isya secara jamak, beliau pun menjamak antara keduanya.\" "
            },
            {
                "number": 1125,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَجْمَعُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ إِذَا جَدَّ بِهِ السَّيْرُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Az Zuhri] dari [Salim] dari [Abdullah bin Umar], bahwa Rasulullah shallallahu 'alaihi wasallam menjamak antara Maghrib dan Isya jika akan segera berangkat (untuk safar).\""
            },
            {
                "number": 1126,
                "arab": " أَخْبَرَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي الْحَكَمُ وَسَلَمَةُ بْنُ كُهَيْلٍ قَالَا صَلَّى بِنَا سَعِيدُ بْنُ جُبَيْرٍ بِجَمْعٍ بِإِقَامَةٍ الْمَغْرِبَ ثَلَاثًا فَلَمَّا سَلَّمَ قَامَ فَصَلَّى رَكْعَتَيْنِ الْعِشَاءَ ثُمَّ حَدَّثَ عَنْ ابْنِ عُمَرَ أَنَّهُ صَنَعَ بِهِمْ فِي ذَلِكَ الْمَكَانِ مِثْلَ ذَلِكَ وَحَدَّثَ ابْنُ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَنَعَ فِي ذَلِكَ الْمَكَانِ مِثْلَ ذَلِكَ حَدَّثَنَا سَعِيدُ بْنُ الرَّبِيعِ قَالَ حَدَّثَنَا شُعْبَةُ بِإِسْنَادِهِ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepadaku [Al Hakam] dan [Salamah bin Kuhail] mereka berkata, \" [Sa'id bin Jubair] sholat bersama kami secara jamak, ia mengerjakan sholat maghrib sebanyak tiga rakaat, setelah salam ia berdiri dan sholat dua rakaat isya. Setelah itu ia menceritakan dari Ibnu Umar, bahwa ia pernah melakukan yang seperti itu bersama mereka di tempat itu juga, dan [Ibnu Umar] menceritakan bahwa Rasulullah shallallahu 'alaihi wasallam juga melakukan hal yang seperti itu di tempat tersebut.\" Telah menceritakan kepada kami [Sa'id? bin Ar Rabi'] ia berkata, telah menceritakan kepada kami [Syu'bah] dengan sanadnya seperti itu.\" "
            },
            {
                "number": 1127,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ عَبْدِ اللَّهِ وَعَمِّهِ عُبَيْدِ اللَّهِ ابْنَيْ كَعْبٍ عَنْ كَعْبِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَقْدَمُ مِنْ سَفَرٍ إِلَّا بِالنَّهَارِ ضُحًى ثُمَّ يَدْخُلُ الْمَسْجِدَ فَيُصَلِّي رَكْعَتَيْنِ ثُمَّ يَجْلِسُ لِلنَّاسِ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Ibnu Syihab] dari [Abdurrahman bin Abdullah bin Ka'b bin Malik] dari ayahnya [Abdullah] dan pamannya ['ubaidhullah] dua anak Ka'b, dari [Ka'b bin Malik], bahwa Rasulullah shallallahu 'alaihi wasallam tidak pernah kembali dari safar melainkan pada siang hari di waktu dluha, beliau kemudian masuk masjid dan sholat dua rakaat, kemudian duduk bersama orang-orang.\" "
            },
            {
                "number": 1128,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ عَنْ شُعَيْبٍ عَنْ الزُّهْرِيِّ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزْوَةً قِبَلَ نَجْدٍ فَوَازَيْنَا الْعَدُوَّ وَصَافَفْنَاهُمْ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي لَنَا فَقَامَ طَائِفَةٌ مِنَّا مَعَهُ وَأَقْبَلَ طَائِفَةٌ عَلَى الْعَدُوِّ فَرَكَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَنْ مَعَهُ رَكْعَةً وَسَجْدَتَيْنِ ثُمَّ انْصَرَفُوا فَكَانُوا مَكَانَ الطَّائِفَةِ الَّتِي لَمْ تُصَلِّ وَجَاءَتْ الطَّائِفَةُ الَّتِي لَمْ تُصَلِّ فَرَكَعَ بِهِمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَةً وَسَجْدَتَيْنِ ثُمَّ سَلَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ كُلُّ رَجُلٍ مِنْ الْمُسْلِمِينَ فَرَكَعَ لِنَفْسِهِ رَكْعَةً وَسَجْدَتَيْنِ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Nafi'] dari [Syu'aib] dari [Az Zuhri] telah mengabarkan kepadaku [Salim bin Abdullah] bahwa [Abdullah bin Umar] berkata, \"Aku pernah mengikuti peperangan bersama Rasulullah shallallahu 'alaihi wasallam menuju Najd, kemudian kami berhadapan dengan musuh dan berbaris untuk menghadapi mereka. Kemudian Rasulullah shallallahu 'alaihi wasallam berdiri melakukan sholat bersama kami. Lalu sekelompok di antara kami bersama beliau dan kelompok yang lain menghadap musuh. Rasulullah shallallahu 'alaihi wasallam sholat dengan satu rukuk dan dua sujud bersama orang-orang yang bersamanya, kemudian mereka pergi menempati posisi kelompok yang belum melakukan sholat. Dan kelompok yang belum sholat datang, kemudian beliau rukuk bersama mereka satu kali dan sujud dua kali. Kemudian beliau mengucapkan salam, lalu setiap orang dari muslimin berdiri dan melakukan rukuk sendiri satu kali dan bersujud dua kali.\" "
            },
            {
                "number": 1129,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ الْأَنْصَارِيِّ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ صَالِحِ بْنِ خَوَّاتٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ فِي صَلَاةِ الْخَوْفِ قَالَ يُصَلِّي الْإِمَامُ بِطَائِفَةٍ وَطَائِفَةٌ مُوَاجِهَةُ الْعَدُوِّ فَيُصَلِّي بِالَّذِينَ مَعَهُ رَكْعَةً وَيَذْهَبُ هَؤُلَاءِ إِلَى مَصَافِّ أَصْحَابِهِمْ وَيَجِيءُ أُولَئِكَ فَيُصَلِّي بِهِمْ رَكْعَةً وَيَقْضُونَ رَكْعَةً لِأَنْفُسِهِمْ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ صَالِحِ بْنِ خَوَّاتٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Yahya bin Sa'id Al Anshari] dari [Al Qasim bin Muhammad] dari [Shalih bin Khawwat] dari [Sahl bin Abu Hatsmah] tentang sholat Khauf, ia berkata, \"Seorang imam melakukan sholat bersama satu kelompok sementara kelompok yang lain menghadapi musuh. Kemudian imam tersebut melakukan sholat bersama orang-orang yang bersamanya satu rakaat, kemudian mereka pergi menuju barisan para sahabat mereka, dan mereka (kelompok yang belum sholat) datang, kemudian imam sholat bersama mereka satu rakaat, sementara mereka menyelesaikan sendiri satu rakaat.\" Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Yahya] dari [Syu'bah] dari [Abdurrahman bin Al Qasim] dari [Ayahnya] dari [Shalih bin Khawwat] dari [Sahl bin Abu Hatsmah] dari Nabi shallallahu 'alaihi wasallam seperti itu.\" "
            },
            {
                "number": 1130,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الْمَقْبُرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِيهِ قَالَ حُبِسْنَا يَوْمَ الْخَنْدَقِ حَتَّى ذَهَبَ هَوِيٌّ مِنْ اللَّيْلِ حَتَّى كُفِينَا وَذَلِكَ قَوْلُ اللَّهِ تَعَالَى { وَكَفَى اللَّهُ الْمُؤْمِنِينَ الْقِتَالَ وَكَانَ اللَّهُ قَوِيًّا عَزِيزًا } فَدَعَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَالًا فَأَمَرَهُ فَأَقَامَ فَصَلَّى الظُّهْرَ فَأَحْسَنَ كَمَا كَانَ يُصَلِّيهَا فِي وَقْتِهَا ثُمَّ أَمَرَهُ فَأَقَامَ الْعَصْرَ فَصَلَّاهَا ثُمَّ أَمَرَهُ فَأَقَامَ الْمَغْرِبَ فَصَلَّاهَا ثُمَّ أَمَرَهُ فَأَقَامَ الْعِشَاءَ فَصَلَّاهَا وَذَلِكَ قَبْلَ أَنْ يَنْزِلَ { فَإِنْ خِفْتُمْ فَرِجَالًا أَوْ رُكْبَانًا }",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] dari [Ibnu Abu Dzi`b] dari [Al Maqburi] dari [Abdurrahman bin Abu Sa'id Al Khudri] dari [Ayahnya] ia berkata, \"Kami tertahan pada saat perang Khandaq hingga berlalu sebagian malam hingga kami dihindarkan dari peperangan, dan hal tersebut sebagaimana yang Allah firmankan: '(Dan Allah menghindarkan orang-orang mukmin dari peperangan. Dan adalah Allah Maha Kuat lagi Maha Perkasa) ' (Qs.?Al Ahzab: 25). Kemudian Nabi shallallahu 'alaihi wasallam memanggil Bilal dan memerintahkannya agar mengumandangkan iqamah. Beliau lalu mengerjakan sholat Zhuhur dan melakukannya dengan baik sebagaimana biasa beliau melakukannya pada waktunya, kemudian memerintahkannya untuk mengumandangkan iqamah sholat Asar, lalu beliau mengerjakan sholat Asar. Kemudian memerintahkannya untuk mengumandangkan iqamah sholat Maghrib, lalu beliau mengerjakan sholat Maghrib, kemudian memerintahkannya untuk mengumandangkan iqamah sholat Isya, lalu beliau mengerjakan sholat Isya. Dan itu sebelum turunnya ayat: '(Jika kamu dalam keadaan takut (bahaya), maka sholatlah sambil berjalan atau berkendaraan…) ' (QS. Al Baqarah: 139)."
            },
            {
                "number": 1131,
                "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا إِسْمَعِيلُ عَنْ قَيْسٍ عَنْ أَبِي مَسْعُودٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ لَيْسَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ مِنْ النَّاسِ وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ فَإِذَا رَأَيْتُمُوهُمَا فَقُومُوا فَصَلُّوا",
                "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Isma'il] dari [Qais] dari [Abu Mas'ud] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya Matahari dan bulan tidak mengalami gerhana karena kematian seseorang, tetapi keduanya adalah dua tanda di antara tanda-tanda kekuasaan Allah, apabila kalian melihatnya maka bangkit dan lakukanlah sholat.\""
            },
            {
                "number": 1132,
                "arab": " أَخْبَرَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ الْمَدِينِيُّ وَمُسَدَّدٌ قَالَا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ عَنْ سُفْيَانَ بْنِ سَعِيدٍ حَدَّثَنِي حَبِيبُ بْنُ أَبِي ثَابِتٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي كُسُوفٍ ثَمَانَ رَكَعَاتٍ فِي أَرْبَعِ سَجَدَاتٍ",
                "id": "Telah mengabarkan kepada kami [Ali bin Abdullah Al Madini] serta [Musaddad] mereka berkata; telah menceritakan kepada kami [Yahya bin Sa'id Al Qaththan] dari [Sufyan bin Sa'id] telah menceritakan kepadaku [Habib bin Abu Tsabit] dari [Thawus] dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam melakukan sholat gerhana delapan rukuk pada empat sujud.\" "
            },
            {
                "number": 1133,
                "arab": " حَدَّثَنَا أَبُو النُّعْمَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ أَنَّ يَهُودِيَّةً دَخَلَتْ عَلَيْهَا فَقَالَتْ أَعَاذَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ فَلَمَّا جَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَأَلَتْهُ أَيُعَذَّبُ النَّاسُ فِي قُبُورِهِمْ قَالَ عَائِذٌ بِاللَّهِ قَالَتْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكِبَ يَوْمًا مَرْكَبًا فَخَسَفَتْ الشَّمْسُ فَجَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَزَلَ ثُمَّ عَمَدَ إِلَى مَقَامِهِ الَّذِي كَانَ يُصَلِّي فِيهِ فَقَامَ النَّاسُ خَلْفَهُ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ فَأَطَالَ الْقِيَامَ وَهُوَ دُونَ الْقِيَامِ الْأَوَّلِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ وَهُوَ دُونَ الرُّكُوعِ الْأَوَّلِ ثُمَّ سَجَدَ سَجْدَتَيْنِ ثُمَّ قَامَ فَفَعَلَ مِثْلَ ذَلِكَ ثُمَّ تَجَلَّتْ الشَّمْسُ فَدَخَلَ عَلَيَّ فَقَالَ إِنِّي أُرَاكُمْ تُفْتَنُونَ فِي قُبُورِكُمْ كَفِتْنَةِ الدَّجَّالِ سَمِعْتُهُ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ",
                "id": "Telah menceritakan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Yahya bin Sa'id] dari ['Amrah binti Abdurrahman] dari [Aisyah], bahwa seorang wanita Yahudi menemuinya dan berkata, \"Semoga Allah melindungimu dari siksa kubur.\" Kemudian tatkala Nabi shallallahu 'alaihi wasallam datang ia bertanya kepada beliau, \"Apakah manusia disiksa dalam kuburan mereka?\" Beliau menjawab: \"Aku berlindung kepada Allah dari siksa kubur.\" Aisyah berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam pernah suatu hari mengendarai kendaraan, kemudian terjadi gerhana matahari. Lalu Nabi shallallahu 'alaihi wasallam datang dan turun dari kendaraannya dan menuju tempat beliau melakukan sholat. Orang-orang lalu berdiri di belakang beliau, beliau lalu berdiri lama, kemudian rukuk dan memperlama rukuknya, kemudian mengangkat kepala dari rukuk dan memperlama berdiri, namun tidak seperti berdirinya yang pertama. Kemudian beliau rukuk lagi dan memperlama rukuknya, namun tidak seperti rukuknya yang pertama, kemudian sujud dua kali, kemudian berdiri dan melakukan seperti itu hingga matahari muncul. Setelah itu beliau menemuiku dan berkata: \"Seseungguhnya aku melihat kalian sedang difitnah dalam kubur kalian seperti fitnah Dajjal.\" Aku mendengar beliau mengucapkan: \"ALLAAHUMMA INNII A'UUDZU BIKA MIN 'ADZAABIL QABRI WA A'UUDZU BIKA MIN 'ADZAABIN NAARI (Ya Allah, aku berlindung kepada-Mu dari siksa kubur, dan aku berlindung kepada-Mu dari siksa neraka).\" "
            },
            {
                "number": 1134,
                "arab": " حَدَّثَنَا أَبُو يَعْقُوبَ يُوسُفُ الْبُوَيْطِيُّ عَنْ مُحَمَّدِ بْنِ إِدْرِيسَ هُوَ الشَّافِعِيُّ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ ابْنِ عَبَّاسٍ قَالَ خَسَفَتْ الشَّمْسُ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَكَى ابْنُ عَبَّاسٍ أَنَّ صَلَاتَهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ فِي كُلِّ رَكْعَةٍ رَكْعَتَيْنِ ثُمَّ خَطَبَهُمْ فَقَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ لَا يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ فَإِذَا رَأَيْتُمْ ذَلِكَ فَافْزَعُوا إِلَى ذِكْرِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Abu Ya'qub Yusuf Al Buwaithi] dari [Muhammad bin Idris Asy Syafi'i] telah menceritakan kepada kami [Malik bin Anas] dari [Zaid bin Aslam] dari ['Atha` bin Yasar] dari [Ibnu Abbas] ia berkata, \"Terjadi gerhana matahari, kemudian Rasulullah shallallahu 'alaihi wasallam melakukan sholat.\" Ibnu Abbas menceritakan bahwa sholat beliau shallallahu 'alaihi wasallam adalah dua rakaat, pada setiap rakaat terdapat dua rukuk. Kemudian beliau berkhutbah kepada mereka dan berkata: \"Sesungguhnya matahari dan bulan adalah dua tanda di antara tanda-tanda kekuasaan Allah. Keduanya tidak mengalami gerhana karena kematian seseorang dan tidak pula karena hidupnya seseorang. Apabila kalian melihat hal tersebut maka bersegeralah untuk berdzikir kepada Allah.\""
            },
            {
                "number": 1135,
                "arab": " قَالَ وَأَخْبَرَنَا مَالِكٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ ح قَالَ وَأَخْبَرَنَا مَالِكٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْ خَسَفَتْ الشَّمْسُ فَصَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَكَتْ أَنَّهُ صَلَّى رَكْعَتَيْنِ فِي كُلِّ رَكْعَةٍ رَكْعَتَيْنِ",
                "id": "Ia berkata; telah mengabarkan kepada kami [Malik] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah]. (dalam jalur lain disebutkan) Ia berkata; telah mengabarkan kepada kami [Malik] dari [Yahya bin Sa'id] dari ['Amrah] dari [Aisyah] ia berkata, \"Telah terjadi gerhana matahari, kemudian Nabi shallallahu 'alaihi wasallam melakukan sholat.\" Aisyah menceritakan bahwa beliau melakukan sholat dua rakaat, dalam setiap rakaat terdapat dua rukuk.\""
            },
            {
                "number": 1136,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ الْمُبَارَكِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ حِينَ كَسَفَتْ الشَّمْسُ بِعَتَاقَةٍ قَالَ حَدَّثَنِي أَبُو حُذَيْفَةَ مُوسَى بْنُ مَسْعُودٍ عَنْ زَائِدَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ فَاطِمَةَ عَنْ أَسْمَاءَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Al Mubarak] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Hisyam bin 'Urwah] dari [Fatimah binti Al Mundzir] dari [Asma` binti Abu Bakr], bahwa saat terjadi gerhana matahari Nabi shallallahu 'alaihi wasallam memerintahkan untuk membebaskan seorang budak.\" Ia (perawi) berkata; telah menceritakan kepadaku [Abu Hudzaifah Musa bin Mas'ud] dari [Zaidah] dari [Hisyam bin 'Urwah] dari [Fatimah] dari [Asma`] dari Nabi shallallahu 'alaihi wasallam, seperti hadits tersebut.\" "
            },
            {
                "number": 1137,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْأَنْصَارِيُّ أَنَّ أَبَا بَكْرِ بْنَ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ أَخْبَرَهُ عَنْ عَبَّادِ بْنِ تَمِيمٍ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ زَيْدٍ يَذْكُرُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ بِالنَّاسِ إِلَى الْمُصَلَّى يَسْتَسْقِي فَاسْتَقْبَلَ الْقِبْلَةَ وَحَوَّلَ رِدَاءَهُ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Yahya bin Sa'id Al Anshari] bahwa [Abu Bakr bin Muhammad 'Amru bin Hazm] mengabarkan kepadanya dari ['Abbad bin Tamim] bahwa ia mendengar [Abdullah bin Zaid] menyebutkan, bahwa Rasulullah shallallahu 'alaihi wasallam keluar bersama orang-orang menuju tanah lapang meminta hujan, beliau lalu menghadap kiblat dan membalikkan selendangnya.\" "
            },
            {
                "number": 1138,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ عَنْ شُعَيْبٍ عَنْ الزُّهْرِيِّ أَخْبَرَنِي عَبَّادُ بْنُ تَمِيمٍ أَنَّ عَمَّهُ أَخْبَرَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ بِالنَّاسِ إِلَى الْمُصَلَّى يَسْتَسْقِي لَهُمْ فَقَامَ فَدَعَا اللَّهَ قَائِمًا ثُمَّ تَوَجَّهَ قِبَلَ الْقِبْلَةِ فَحَوَّلَ رِدَاءَهُ فَأُسْقُوا",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Nafi'] dari [Syu'aib] dari [Az Zuhri] telah mengabarkan kepada kami ['Abbad bin Tamim] bahwa [Pamannya] mengabarkan kepadanya, bahwa Nabi shallallahu 'alaihi wasallam keluar bersama orang-orang menuju tanah lapang meminta turunnya hujan untuk mereka. Beliau berdiri dan berdoa kepada Allah dalam keadaan berdiri, kemudian beliau menghadap Kiblat dan membalikkan selendangnya, maka mereka pun mendapatkan hujan.\" "
            },
            {
                "number": 1139,
                "arab": " حَدَّثَنَا عُثْمَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدَةُ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَرْفَعُ يَدَيْهِ فِي شَيْءٍ مِنْ الدُّعَاءِ إِلَّا فِي الِاسْتِسْقَاءِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Muhammad] Telah menceritakan kepada kami ['Abdah] dari [Sa'id] dari [Qatadah] dari [Anas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak mengangkat kedua tangannya pada doa apapun kecuali saat memohon hujan.\""
            },
            {
                "number": 1140,
                "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَاءَ أَحَدُكُمْ الْجُمُعَةَ فَلْيَغْتَسِلْ",
                "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian datang untuk melakukan sholat Jum'at, maka hendaknya ia mandi.\" "
            },
            {
                "number": 1141,
                "arab": " حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Shafwan bin Sulaim] dari ['Atha` bin Yasar bin Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandi pada hari Jum'at adalah wajib bagi orang yang telah baligh.\" Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Shafwan bin Sulaim] dari ['Atha` bin Yasar] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam seperti itu.\" "
            },
            {
                "number": 1142,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ حَدَّثَنِي أَبُو هُرَيْرَةَ قَالَ بَيْنَمَا عُمَرُ بْنُ الْخَطَّابِ يَخْطُبُ إِذْ دَخَلَ رَجُلٌ فَعَرَّضَ بِهِ عُمَرُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ مَا زِدْتُ أَنْ تَوَضَّأْتُ حِينَ سَمِعْتُ النِّدَاءَ فَقَالَ وَالْوُضُوءَ أَيْضًا أَلَمْ تَسْمَعْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا جَاءَ أَحَدُكُمْ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Al Auza'i] dari [Yahya bin Abu Katsir] dari [Abu Salamah bin Abdurrahman] telah menceritakan kepadaku [Abu Hurairah] ia berkata, \"Ketika Umar bin Al Khaththab sedang khutbah, tiba-tiba ada seorang laki-laki yang masuk ke dalam masjid, Umar kemudian menyindirnya. Maka orang itu pun berkata, \"Wahai Amirul Mukminin, saat mendengar adzan aku tidak sempat melakukan apa pun selain berwudlu! \" [Umar] kemudian menyahut, \"Meskipun itu wudlu. Tidakkah kamu mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian datang untuk melakukan sholat Jum'at, maka hendaknya ia mandi.\""
            },
            {
                "number": 1143,
                "arab": " أَخْبَرَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ الْحَسَنِ عَنْ سَمُرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَوَضَّأَ لِلْجُمُعَةِ فَبِهَا وَنِعْمَتْ وَمَنْ اغْتَسَلَ فَهُوَ أَفْضَلُ",
                "id": "Telah mengabarkan kepada kami ['Affan] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] dari [Al Hasan] dari [Samurah], bahwa Nabi shallallahu 'alaihi wasallam berkata: \"Barangsiapa berwudlu untuk melakukan sholat Jum'at maka wudlu adalah cukup dan baik, dan barangsiapa mandi, maka hal itu adalah lebih baik.\""
            },
            {
                "number": 1144,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ وَدِيعَةَ عَنْ سَلْمَانَ الْفَارِسِيِّ صَاحِبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اغْتَسَلَ يَوْمَ الْجُمُعَةِ فَتَطَهَّرَ بِمَا اسْتَطَاعَ مِنْ طُهْرٍ ثُمَّ ادَّهَنَ مِنْ دُهْنِهِ أَوْ مَسَّ مِنْ طِيبِ بَيْتِهِ ثُمَّ رَاحَ فَلَمْ يُفَرِّقْ بَيْنَ اثْنَيْنِ وَصَلَّى مَا كُتِبَ لَهُ فَإِذَا خَرَجَ الْإِمَامُ أَنْصَتَ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الْأُخْرَى",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Abdul Majid] telah menceritakan kepada kami [Ibnu Abu Dzi`b] dari [Al Maqburi] dari [Ayahnya] dari [Abdullah bin Wadi'ah] dari [Salman Al Farisi] sahabat Rasulullah shallallahu 'alaihi wasallam, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mandi pada hari Jum'at dan bersuci semampunya, kemudian memakai minyak dari minyak yang ada di rumahnya, kemudian pergi (ke masjid) dan tidak memisahkan antara dua orang lalu melaksanakan sholat yang telah diwajibkan baginya, kemudian apabila imam keluar ia diam, maka dosanya antara jum'at tersebut hingga jum'at yang akan datang akan diampuni.\" "
            },
            {
                "number": 1145,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ يَوْمَ الْجُمُعَةِ فِي صَلَاةِ الْغَدَاةِ تَنْزِيلُ السَّجْدَةَ وَهَلْ أَتَى عَلَى الْإِنْسَانِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Sa'd bin Ibrahim] dari [Abdurrahman bin Hurmuz] dari [Abu Hurairah] ia berkata, \"Pada sholat subuh di hari jum'at Nabi shallallahu 'alaihi wasallam membaca surat Tanzil As Sajdah dan HAL ATAA 'ALAL INSAAN (surat Al Insaan).\" "
            },
            {
                "number": 1146,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُتَعَجِّلُ إِلَى الْجُمُعَةِ كَالْمُهْدِي جَزُورًا ثُمَّ الَّذِي يَلِيهِ كَالْمُهْدِي بَقَرَةً ثُمَّ الَّذِي يَلِيهِ كَالْمُهْدِي شَاةً فَإِذَا جَلَسَ الْإِمَامُ عَلَى الْمِنْبَرِ طُوِيَتْ الصُّحُفُ وَجَلَسُوا يَسْتَمِعُونَ الذِّكْرَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Al Auza'i] dari [Yahya] dari [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang bersegera menuju sholat Jum'at seperti orang yang mengorbankan unta, kemudian setelah itu seperti orang yang mengorbankan sapi, kemudian setelah itu seperti orang yang mengorbankan kambing. Maka jika imam berdiri di atas mimbar, lembaranan catatan dilipat dan para Malaikat duduk mendengarkan Dzikir (khutbah).\""
            },
            {
                "number": 1147,
                "arab": " أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ الْأَغَرِّ أَبِي عَبْدِ اللَّهِ صَاحِبِ أَبِي هُرَيْرَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانَ يَوْمُ الْجُمُعَةِ قَعَدَتْ الْمَلَائِكَةُ عَلَى أَبْوَابِ الْمَسْجِدِ فَكَتَبُوا مَنْ جَاءَ إِلَى الْجُمُعَةِ فَإِذَا رَاحَ الْإِمَامُ طَوَتْ الْمَلَائِكَةُ الصُّحُفَ وَدَخَلَتْ تَسْتَمِعُ الذِّكْرَ قَالَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُتَهَجِّرُ إِلَى الْجُمُعَةِ كَالْمُهْدِي بَدَنَةً ثُمَّ كَالْمُهْدِي بَقَرَةً ثُمَّ كَالْمُهْدِي شَاةً ثُمَّ كَالْمُهْدِي بَطَّةً ثُمَّ كَالْمُهْدِي دَجَاجَةً ثُمَّ كَالْمُهْدِي بَيْضَةً",
                "id": "Telah mengabarkan kepada kami [Nashr bin Ali] telah menceritakan kepada kami [Abdul A'la] dari [Ma'mar] dari [Az Zuhri] dari [Al Aghar Abu Abdullah] sahabat Abu Hurairah, dari [Abu Hurairah], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Pada hari Jum'at para Malaikat duduk di atas pintu masjid, kemudian mereka mencatat orang-orang yang mendatangi sholat Jum'at. Jika imam datang maka malaikat melipat lembaran catatan dan mereka masuk masjid untuk mendengarkan Dzikir (khutbah).\" Abu Hurairah berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang bersegera menuju sholat Jum'at seperti orang yang berkurban unta, kemudian seperti orang yang berkurban sapi, kemudian seperti orang yang berkurban kambing, kemudian seperti orang yang berkurban itik, kemudian seperti orang yang berkurban ayam, kemudian seperti orang yang berkurban telur.\""
            },
            {
                "number": 1148,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ مُسْلِمِ بْنِ جُنْدُبٍ عَنْ الزُّبَيْرِ بْنِ الْعَوَّامٍ قَالَ كُنَّا نُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجُمُعَةَ ثُمَّ نَرْجِعُ فَنَتَبَادَرُ الظِّلَّ فِي أُطُمِ بَنِي غَنْمٍ فَمَا هُوَ إِلَّا مَوَاضِعُ أَقْدَامِنَا",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Musa] dari [Ibnu Abu Dzi`b] dari [Muslim bin Jundab] dari [Az Zubair bin Al 'Awwam] ia berkata, \"Kami sholat Jum'at bersama Nabi shallallahu 'alaihi wasallam, kemudian kami kembali dan berlomba menuju bayangan di antara bangunan-bangunan rumah Bani Ghanm, dan kami tidak mendapatkan tempat untuk bernaung kecuali sekadar untuk meletakkan kaki.\" "
            },
            {
                "number": 1149,
                "arab": " أَخْبَرَنَا عَفَّانُ بْنُ مُسْلِمٍ حَدَّثَنَا يَعْلَى بْنُ الْحَارِثِ قَالَ سَمِعْتُ إِيَاسَ بْنَ سَلَمَةَ بْنِ الْأَكْوَعِ يُحَدِّثُ عَنْ أَبِيهِ قَالَ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجُمُعَةَ ثُمَّ نَنْصَرِفُ وَلَيْسَ لِلْحِيطَانِ فَيْءٌ يُسْتَظَلُّ بِهِ",
                "id": "Telah mengabarkan kepada kami ['Affan bin Muslim] Telah menceritakan kepada kami [Ya'la bin Al Harits] ia berkata, saya mendengar [Iyas bin Salamah bin Al Akwa'] menceritakan dari [Ayahnya] ia berkata, \"Kami pernah sholat Jum'at bersama Rasulullah shallallahu 'alaihi wasallam, kemudian beliau pergi (selesai sholat) sementara dinding-dinding tidak lagi memiliki bayangan yang dapat dijadikan naungan.\" "
            },
            {
                "number": 1150,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ حَدَّثَنَا صَدَقَةُ هُوَ ابْنُ خَالِدٍ عَنْ يَحْيَى بْنِ الْحَارِثِ عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ يَرُدُّهُ إِلَى أَوْسِ بْنِ أَوْسٍ يَرُدُّهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ غَسَّلَ وَاغْتَسَلَ يَوْمَ الْجُمُعَةِ ثُمَّ غَدَا وَابْتَكَرَ ثُمَّ جَلَسَ قَرِيبًا مِنْ الْإِمَامِ وَأَنْصَتَ وَلَمْ يَلْغُ حَتَّى يَنْصَرِفَ الْإِمَامُ كَانَ لَهُ بِكُلِّ خُطْوَةٍ يَخْطُوهَا كَعَمَلِ سَنَةٍ صِيَامِهَا وَقِيَامِهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mubarak] telah menceritakan kepada kami [Shadaqah] -yaitu Ibnu Khalid- dari [Yahya bin Al Harits] dari [Abu Al Asy'ats Ash Shan'ani] ia menisbatkannya kepada [Aus bin Aus], ia menisbatkanya kepada Nabi shallallahu 'alaihi wasallam, beliau berkata: \"Barangsiapa mandi pada hari Jum'at kemudian pergi dan bersegera datang ke masjid, kemudian duduk dekat dengan imam, ia diam dan tidak melakukan perbuatan sia-sia hingga imam pergi, maka baginya dengan setiap langkah yang ia lakukan seperti amalan puasa satu tahun dan sholat malam satu tahun.\""
            },
            {
                "number": 1151,
                "arab": " حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ وَالْإِمَامُ يَخْطُبُ فَقَدْ لَغَوْتَ",
                "id": "Telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila engkau mengatakan kepada sahabatmu 'diamlah' sementara imam sedang, berkhutbah maka sungguh engkau telah melakukan perbuatan yang sia-sia.\""
            },
            {
                "number": 1152,
                "arab": " حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ وَالْإِمَامُ يَخْطُبُ فَقَدْ لَغَوْتَ أَخْبَرَنَا الْمُعَلَّى بْنُ أَسَدٍ حَدَّثَنَا وُهَيْبٌ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila engkau mengatakan kepada sahabatmu 'diamlah' sementara imam sedang berkhutbah, maka sungguh engkau telah melakukan perbuatan yang sia-sia.\" Telah mengabarkan kepada kami [Al Mu'alla bin Asad] telah menceritakan kepada kami [Wuhaib] dari [Ma'mar] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti itu.\" "
            },
            {
                "number": 1153,
                "arab": " حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا جَاءَ أَحَدُكُمْ وَالْإِمَامُ يَخْطُبُ أَوْ قَدْ خَرَجَ فَلْيُصَلِّ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari ['Amru bin Dinar] ia berkata, saya mendengar [Jabir bin Abdullah] menceritakan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila salah seorang di antara kalian datang sementara imam sedang berkhutbah, atau telah keluar, maka hendaknya ia melakukan sholat dua rakaat.\""
            },
            {
                "number": 1154,
                "arab": " أَخْبَرَنَا صَدَقَةُ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ عَجْلَانَ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ قَالَ جَاءَ أَبُو سَعِيدٍ وَمَرْوَانُ يَخْطُبُ فَقَامَ يُصَلِّي رَكْعَتَيْنِ فَأَتَاهُ الْحَرَسُ يَمْنَعُونَهُ فَقَالَ مَا كُنْتُ أَتْرُكُهُمَا وَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ بِهِمَا",
                "id": "Telah mengabarkan kepada kami [Shadaqah] telah menceritakan kepada kami [Sufyan] dari [Ibnu 'Ajlan] dari ['Iyadl bin Abdullah] ia berkata, \" [Abu Sa'id] datang saat Marwan sedang berkhutbah, kemudian ia berdiri dan sholat dua rakaat tetapi para penjaga mendatanginya dan melarangnya untuk sholat. Maka Sa'id pun berkata, \"Aku tidak pernah meninggalkan dua rakaat tersebut dan aku melihat Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk melakukan dua rakaat tersebut.\" "
            },
            {
                "number": 1155,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ الرَّبِيعِ هُوَ ابْنُ صَبِيحٍ الْبَصْرِيُّ قَالَ رَأَيْتُ الْحَسَنَ يُصَلِّي رَكْعَتَيْنِ وَالْإِمَامُ يَخْطُبُ وَقَالَ الْحَسَنُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَاءَ أَحَدُكُمْ وَالْإِمَامُ يَخْطُبُ فَلْيُصَلِّ رَكْعَتَيْنِ خَفِيفَتَيْنِ يَتَجَوَّزُ فِيهِمَا قَالَ أَبُو مُحَمَّد أَقُولُ بِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Ar Rabi'] -yaitu Ibnu Shabih Al Bashri- ia berkata, \"Aku melihat Al Hasan melakukan sholat dua rakaat sementara imam sedang berkhutbah. [Al Hasan] berkata, \"Rasulullah shallallahu 'alaihi wasallam shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian datang sementara imam sedang berkhutbah, maka hendaknya ia sholat dua rakaat yang ringan.\" Abu Muhammad berkata, \"Aku berpendapat dengannya.\" "
            },
            {
                "number": 1156,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنِي اللَّيْثُ أَخْبَرَنِي خَالِدٌ يَعْنِي ابْنَ يَزِيدَ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا فَقَرَأَ ص فَلَمَّا مَرَّ بِالسَّجْدَةِ نَزَلَ فَسَجَدَ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepadaku [Al Laits] telah mengabarkan kepadaku [Khalid] -yaitu Ibnu Yazid- dari [Sa'id? bin Abu Hilal] dari ['Iyadl bin Abdullah] dari [Abu Sa'id Al Khudri] ia berkata, \"Suatu hari Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada kami, beliau lalu membaca surat Shaad, saat melewati ayat sajdah beliau turun dan sujud.\" "
            },
            {
                "number": 1157,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ دَخَلَ رَجُلٌ الْمَسْجِدَ يَوْمَ الْجُمُعَةِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَقَالَ أَصَلَّيْتَ قَالَ لَا قَالَ فَصَلِّ رَكْعَتَيْنِ قَالَ أَبُو مُحَمَّد أَقُولُ بِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Ibnu 'Uyainah] dari ['Amru bin Dinar] ia berkata, saya mendengar [Jabir bin Abdullah] berkata, \"Pada hari jum'at ada seorang laki-laki masuk ke dalam masjid saat Rasulullah shallallahu 'alaihi wasallam sedang berkhutbah, kemudian beliau bertanya: \"Apakah engkau telah melakukan sholat?\" orang tersebut menjawab, \"Belum.\" Beliau berkata: \"Lakukanlah sholat dua rakaat.\" Abu Muhammad berkata, \"Aku berpendapat dengannya.\" "
            },
            {
                "number": 1158,
                "arab": " أَخْبَرَنَا الْعَلَاءُ بْنُ عُصَيْمٍ الْجُعْفِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبْجَرَ حَدَّثَنِي أَبِي عَبْدُ الْمَلِكِ بْنُ أَبْجَرَ عَنْ وَاصِلِ بْنِ حَيَّانَ عَنْ أَبِي وَائِلٍ قَالَ خَطَبَنَا عَمَّارُ بْنُ يَاسِرٍ فَأَبْلَغَ وَأَوْجَزَ فَقُلْنَا يَا أَبَا الْيَقْظَانِ لَوْ كُنْتَ نَفَّسْتَ شَيْئًا قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ طُولَ صَلَاةِ الرَّجُلِ وَقِصَرَ خُطْبَتِهِ مَئِنَّةٌ مِنْ فِقْهِهِ فَأَطِيلُوا هَذِهِ الصَّلَاةَ وَاقْصُرُوا هَذِهِ الْخُطَبَ وَإِنَّ مِنْ الْبَيَانِ سِحْرًا",
                "id": "Telah mengabarkan kepada kami [Al 'Ala` bin 'Ushaim Al Ju'fi] telah menceritakan kepada kami [Abdurrahman bin Abdul Malik bin Abjar] telah menceritakan kepadaku ayahku [Abdul Malik bin Abjar] dari [Washil bin Hayyan] dari [Abu Wail] ia berkata, \" [Ammar bin Yasir] berkhutbah di hadapan kami, ia menyampaikan dengan jelas dan ringkas. Kemudian kami katakan, \"Wahai Abu Al Yaqzhan, seandainya engkau sedikit memperpanjang! \" Ia menjawab, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh, panjangnya sholat dan ringkasnya khutbah seorang laki-laki adalah tanda pemahamannya, maka panjangkanlah sholat dan perpendeklah khutbah, dan sesungguhnya di antara penjelasan ada sesuatu yang menyihir.\" "
            },
            {
                "number": 1159,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَتْ صَلَاتُهُ قَصْدًا وَخُطْبَتُهُ قَصْدًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sa'id] telah menceritakan kepada kami [Abu Al Ahwash] dari [Simak] dari [Jabir bin Samurah] ia berkata, \"Aku pernah sholat bersama Nabi shallallahu 'alaihi wasallam, sholat dan khutbah beliau sedang.\" "
            },
            {
                "number": 1160,
                "arab": " حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ خُطْبَتَيْنِ وَهُوَ قَائِمٌ وَكَانَ يَفْصِلُ بَيْنَهُمَا بِجُلُوسٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Bisyr bin Al Mufadldlal] telah menceritakan kepada kami ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar], bahwa Rasulullah shallallahu 'alaihi wasallam berkhutbah dengan dua kali dalam keadaan berdiri, dan beliau memisahkan antara keduanya dengan duduk.\" "
            },
            {
                "number": 1161,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ كَانَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُطْبَتَانِ يَجْلِسُ بَيْنَهُمَا يَقْرَأُ الْقُرْآنَ وَيُذَكِّرُ النَّاسَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Sa'id] telah menceritakan kepada kami [Abu Al Ahwash] dari [Simak] dari [Jabir bin Samurah] ia berkata, \"Nabi shallallahu 'alaihi wasallam memiliki dua khutbah dan beliau duduk di antara keduanya, beliau membaca Al Qur'an serta mengingatkan manusia.\" "
            },
            {
                "number": 1162,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو زُبَيْدٍ حَدَّثَنَا حُصَيْنٌ قَالَ رَأَى عُمَارَةُ بْنُ رُوَيْبَةَ بِشْرَ بْنَ مَرْوَانَ عَلَى الْمِنْبَرِ رَافِعًا يَدَيْهِ فَقَالَ قَبَّحَ اللَّهُ هَذِهِ الْيَدَيْنِ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ وَمَا يُشِيرُ إِلَّا بِأُصْبُعِهِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Zubaid] telah menceritakan kepada kami [Hushain] ia berkata, ['Umarah bin Ruwaibah] melihat Bisyr bin Marwan di atas mimbar dalam keadaan mengangkat kedua tangannya, maka ia pun berkata, \"Semoga Allah memburukkan kedua tangan ini. Sungguh aku melihat Rasulullah shallallahu 'alaihi wasallam berada di atas mimbar dan beliau tidak memberi isyarat kecuali dengan jari-jarinya.\" "
            },
            {
                "number": 1163,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عُمَارَةَ بْنِ رُوَيْبَةَ قَالَ رَأَى بِشْرَ بْنَ مَرْوَانَ رَافِعًا يَدَيْهِ يَدْعُو عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ قَالَ فَسَبَّهُ وَقَالَ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ وَمَا يَقُولُ بِأُصْبُعِهِ إِلَّا هَكَذَا وَأَشَارَ بِالسَّبَّابَةِ عِنْدَ الْخَاصِرَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Hushain bin Abdurrahman] dari ['Umarah bin Ruwaibah] ia berkata, \"'Umarah melihat Bisyr bin Marwan berdoa dengan mengangkat kedua tangannya di atas mimbar pada hari Jum'at.\" Hushain berkata, \"Kemudian 'Umarah mencelanya seraya berkata, 'Sungguh aku telah melihat Rasulullah shallallahu 'alaihi wasallam di atas mimbar dan beliau tidak berkata menggunakan jari-jarinya kecuali seperti ini.' Dan ia memberi isyarat menggunakan jari telunjuk di sisi lambung.\" "
            },
            {
                "number": 1164,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ سُلَيْمَانَ بْنِ كَثِيرٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُومُ إِلَى جِذْعٍ قَبْلَ أَنْ يُجْعَلَ الْمِنْبَرُ فَلَمَّا جُعِلَ الْمِنْبَرُ حَنَّ ذَلِكَ الْجِذْعُ حَتَّى سَمِعْنَا حَنِينَهُ فَوَضَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ عَلَيْهِ فَسَكَنَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] dari [Sulaiman bin Katsir] dari [Az Zuhri] dari [Sa'id? bin Al Musayyab] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam berdiri menuju batang kurma sebelum dibuat menjadi mimbar, kemudian tatkala telah dijadikan mimbar batang tersebut merintih hingga kami mendengar rintihannya. Rasulullah shallallahu 'alaihi wasallam lantas meletakkan tangannya di atas batang tersebut hingga ia pun terdiam.\" "
            },
            {
                "number": 1165,
                "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَمَّارِ بْنِ أَبِي عَمَّارٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ إِلَى جِذْعٍ قَبْلَ أَنْ يَتَّخِذَ الْمِنْبَرَ فَلَمَّا اتَّخَذَ الْمِنْبَرَ تَحَوَّلَ إِلَيْهِ حَنَّ الْجِذْعُ فَاحْتَضَنَهُ فَسَكَنَ وَقَالَ لَوْ لَمْ أَحْتَضِنْهُ لَحَنَّ إِلَى يَوْمِ الْقِيَامَةِ حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] dari ['Ammar bin Abu 'Ammar] dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam berkhutbah menghadap ke arah sebatang pohon kurma sebelum mempunyai mimbar, ketika telah mempunyai mimbar beliau pindah kepadanya hingga batang pohon kurma tersebut merintih, beliau lalu memeluk batang kurma tersebut hingga ia pun diam. Beliau berkata: \"Seandainya aku tidak memeluknya niscaya ia akan merintih hingga hari Kiamat.\" Telah menceritakan kepada kami [Hajjaj] telah menceritakan kepada kami [Hammad] dari [Tsabit] dari [Anas] dari Nabi shallallahu 'alaihi wasallam seperti itu.\" "
            },
            {
                "number": 1166,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ لَمَّا كَثُرَ النَّاسُ بِالْمَدِينَةِ جَعَلَ الرَّجُلُ يَجِيءُ وَالْقَوْمُ يَجِيئُونَ فَلَا يَكَادُونَ أَنْ يَسْمَعُوا كَلَامَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى يَرْجِعُوا مِنْ عِنْدِهِ فَقَالَ لَهُ النَّاسُ يَا رَسُولَ اللَّهِ إِنَّ النَّاسَ قَدْ كَثُرُوا وَإِنَّ الْجَائِيَ يَجِيءُ فَلَا يَكَادُ يَسْمَعُ كَلَامَكَ قَالَ فَمَا شِئْتُمْ فَأَرْسِلْ إِلَى غُلَامٍ لِامْرَأَةٍ مِنْ الْأَنْصَارِ نَجَّارٍ وَإِلَى طَرْفَاءِ الْغَابَةِ فَجَعَلُوا لَهُ مِرْقَاتَيْنِ أَوْ ثَلَاثَةً فَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجْلِسُ عَلَيْهِ وَيَخْطُبُ عَلَيْهِ فَلَمَّا فَعَلُوا ذَلِكَ حَنَّتْ الْخَشَبَةُ الَّتِي كَانَ يَقُومُ عِنْدَهَا فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْهَا فَوَضَعَ يَدَهُ عَلَيْهَا فَسَكَنَتْ ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami [Al Mas'udi] dari [Abu Hazim] dari [Sahl bin Sa'd] ia berkata, \"Tatkala orang-orang telah banyak di Madinah, maka berdatanganlah baik itu perseorangan maupun berkelompok sehingga mereka hampir tidak mendengar perkataan Rasulullah shallallahu 'alaihi wasallam, sampai mereka kembali dari sisi beliau. Kemudian orang-orang berkata kepada beliau, \"Wahai Rasulullah, sesungguhnya orang-orang telah banyak dan selalu ada yang terus datang, hampi-hampir mereka tidak dapat mendengar perkataanmu.\" Beliau berkata: \"Apa yang kalian kehendaki?\" Mereka mengatakan, \"Kirimkan utusan kepada budak seorang wanita anshar yang bekerja sebagai tukang kayu, dan ke Tharfa` Al Ghabah.\" Kemudian mereka membuatkan untuk mereka dua tangga atau tiga tangga. Lalu Rasulullah shallallahu 'alaihi wasallam duduk dan berkhutbah di atasnya. Kemudian tatkala mereka melakukan hal tersebut kayu yang di sisinya Rasulullah shallallahu 'alaihi wasallam berdiri merintih, Rasulullah shallallahu 'alaihi wasallam lantas berdiri menuju kayu tersebut seraya meletakkan tangannya di atasnya hingga ia pun terdiam.\""
            },
            {
                "number": 1167,
                "arab": " أَخْبَرَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا مَالِكٌ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ أَنَّ الضَّحَّاكَ بْنَ قَيْسٍ سَأَلَ النُّعْمَانَ بْنَ بَشِيرٍ الْأَنْصَارِيَّ مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ يَوْمَ الْجُمُعَةِ عَلَى إِثْرِ سُورَةِ الْجُمُعَةِ قَالَ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ",
                "id": "Telah mengabarkan kepada kami [Khalid bin Makhlad] telah menceritakan kepada kami [Malik] dari [Dlamrah bin Sa'id Al Mazini] dari ['ubaidhullah bin Abdullah bin 'Utbah] bahwa [Adl Dlahhak bin Qais] bertanya kepada [An Nu'man bin Basyir Al Anshari], \"Apa yang dibaca Rasulullah shallallahu 'alaihi wasallam pada hari Jum'at setelah surat Al Jumu'ah?\" Ia menjawab, \"HAL ATAAKA HADIITSUL QHAASYIYAH (surat Al Insaan).\""
            },
            {
                "number": 1168,
                "arab": " حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبَانَ حَدَّثَنَا أَبُو أُوَيْسٍ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ الضَّحَّاكِ بْنِ قَيْسٍ الْفِهْرِيِّ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ الْأَنْصَارِيِّ قَالَ سَأَلْنَاهُ مَا كَانَ يَقْرَأُ بِهِمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ مَعَ السُّورَةِ الَّتِي ذُكِرَتْ فِيهَا الْجُمُعَةُ قَالَ كَانَ يَقْرَأُ مَعَهَا هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Aban] telah menceritakan kepada kami [Abu Uwais] dari [Dlamrah bin Sa'id Al Mazini] dari ['ubaidhullah bin Abdullah bin 'Utbah] dari [Adl Dlahhak bin Qais Al Fihri] dari [An Nu'man bin Basyir Al Anshari] ia berkata, \"Kami bertanya kepadanya apa yang dibacakan Nabi shallallahu 'alaihi wasallam kepada mereka pada hari Jum'at bersama surat yang disebutkan di dalamnya ?Al Jumu'ah?\" Ia menjawab, \"Beliau membaca bersamanya HAL ATAAKA HADIITSUL GHAASYIYAH (surat Al Ghaasyiyah).\" "
            },
            {
                "number": 1169,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْعِيدَيْنِ وَالْجُمُعَةِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ وَرُبَّمَا اجْتَمَعَا فَقَرَأَ بِهِمَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin Muhammad bin Al Muntasyir] dari [Ayahnya] dari [Habib bin Salim] dari [An Nu'man bin Basyir] ia berkata, \"Nabi shallallahu 'alaihi wasallam membaca SABBIHISMA RABBIKAL A'LAA dan HAL ATAAKA HADIITSUL GHAASYIYAH pada sholat dua hari raya dan hari Jum'at. Bila kedua hari tersebut bertemu dalam satu hari beliau juga membaca keduanya.\" "
            },
            {
                "number": 1170,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ مَخْلَدِ بْنِ حُسَيْنٍ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ الْتَقَيْتُ أَنَا وَكَعْبٌ فَجَعَلْتُ أُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَعَلَ يُحَدِّثُنِي عَنْ التَّوْرَاةِ حَتَّى أَتَيْنَا عَلَى ذِكْرِ يَوْمِ الْجُمُعَةِ فَقُلْتُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِيهَا لَسَاعَةً لَا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ يُصَلِّي يَسْأَلُ اللَّهَ فِيهَا خَيْرًا إِلَّا أَعْطَاهُ إِيَّاهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Katsir] dari [Makhlad bin Husain] dari [Hisyam] dari [Ibnu Sirin] dari [Abu Hurairah] ia berkata, \"Aku dan Ka'b bertemu, kemudian aku menceritakan dari Rasulullah shallallahu 'alaihi wasallam sementara ia menceritakan dari Taurat, hingga ketika kami menyebutkan hari Jum'at, maka aku katakan, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya padanya ada satu waktu, tidaklah seorang Muslim menepati waktu itu dengan melakukan sholat dan memohon kebaikan kepada Allah, kecuali Allah akan memberikan kepadanya.\""
            },
            {
                "number": 1171,
                "arab": " حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا مُعَاوِيَةُ بْنُ سَلَّامٍ أَخْبَرَنِي زَيْدُ بْنُ سَلَّامٍ أَنَّهُ سَمِعَ أَبَا سَلَّامٍ قَالَ حَدَّثَنِي الْحَكَمُ بْنُ مِينَا أَنَّ ابْنَ عُمَرَ حَدَّثَهُ وَأَبَا هُرَيْرَةَ أَنَّهُمَا سَمِعَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَهُوَ عَلَى أَعْوَادِ مِنْبَرِهِ لَيَنْتَهِيَنَّ أَقْوَامٌ عَنْ وَدَعِهِمْ الْجُمُعَاتِ أَوْ لَيَخْتِمَنَّ اللَّهُ عَلَى قُلُوبِهِمْ ثُمَّ لَيَكُونُنَّ مِنْ الْغَافِلِينَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Mu'awiyah bin Sallam] telah mengabarkan kepadaku [Zaid bin Sallam] bahwa ia mendengar [Abu Sallam] berkata, telah menceritakan kepadaku [Al Hakam bin Mina] bahwa [Ibnu Umar] dan [Abu Hurairah] menceritakan kepadanya, bahwa mereka mendengar Rasulullah shallallahu 'alaihi wasallam bersabda di atas kayu mimbarnya: \"Sungguh orang-orang berhenti dari meninggalkan sholat Jum'at, atau Allah menutup hati mereka, kemudian mereka akan termasuk orang-orang yang lalai.\""
            },
            {
                "number": 1172,
                "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ عَبِيدَةَ بْنِ سُفْيَانَ عَنْ أَبِي الْجَعْدِ الضَّمْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَرَكَ الْجُمُعَةَ تَهَاوُنًا بِهَا طَبَعَ اللَّهُ عَلَى قَلْبِهِ ",
                "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Muhammad bin 'Amru] dari ['ubaidhullah bin Sufyan] dari [Abu Al Ja'd Adl Dlamri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meninggalkan sholat Jum'at karena meremehkannya, maka Allah akan menutup hatinya.\" "
            },
            {
                "number": 1173,
                "arab": " أَخْبَرَنَا عُثْمَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا الْحُسَيْنُ بْنُ عَلِيٍّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ عَنْ أَوْسِ بْنِ أَوْسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَفْضَلَ أَيَّامِكُمْ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ النَّفْخَةُ وَفِيهِ الصَّعْقَةُ فَأَكْثِرُوا عَلَيَّ مِنْ الصَّلَاةِ فِيهِ فَإِنَّ صَلَاتَكُمْ مَعْرُوضَةٌ عَلَيَّ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ كَيْفَ تُعْرَضُ صَلَاتُنَا عَلَيْكَ وَقَدْ أَرَمْتَ يَعْنِي بَلِيتَ قَالَ إِنَّ اللَّهَ حَرَّمَ عَلَى الْأَرْضِ أَنْ تَأْكُلَ أَجْسَادَ الْأَنْبِيَاءِ",
                "id": "Telah mengabarkan kepada kami [Utsman bin Muhammad] telah menceritakan kepada kami [Al Husain bin Ali] dari [Abdurrahman bin Yazid bin Jabir] dari [Abu Al Asy'ats Ash Shan'ani] dari [Aus bin Aus] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda, \"Sesungguhnya hari kalian yang paling utama adalah hari Jum'at, padanya Adam di ciptakan, padanya ia diberi ruh, dan padanya terjadi Ash sha'qah (suara keras yang menyebabkan orang-orang pingsan). Maka perbanyaklah bershalawat kepadaku pada hari itu, sesungguhnya shalawat kalian akan diperlihatkan kepadaku.\" Seorang laki-laki lalu bertanya, \"Wahai Rasulullah, bagaimana shalawat kami diperlihatkan kepadamu, sementara anda telah meninggal? Beliau bersabda: \"Sesungguhnya Allah mengharamkan atas tanah untuk memakan jasad para Nabi.\""
            },
            {
                "number": 1174,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ فِي بَيْتِهِ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Malik] dari [Nafi'] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam melakukan sholat dua rakaat di rumahnya setelah sholat Jum'at.\" "
            },
            {
                "number": 1175,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو يَعْنِي ابْنَ دِينَارٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad bin Abu Khalaf] telah menceritakan kepada kami [Sufyan] dari ['Amru] -yaitu Ibnu Dinar- dari [Ibnu Syihab] dari [Salim] dari [Ayahnya], bahwa Nabi shallallahu 'alaihi wasallam melakukan sholat dua rakaat setelah sholat Jum'at.\" "
            },
            {
                "number": 1176,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَ مِنْكُمْ مُصَلِّيًا بَعْدَ الْجُمُعَةِ فَلْيُصَلِّ بَعْدَهَا أَرْبَعًا قَالَ أَبُو مُحَمَّد أُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ أَوْ أَرْبَعًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Suhail bin Abu Shalih] dari [Ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa di antara kalian mengerjakan sholat setelah Jum'at, maka hendaknya ia melakukan sholat empat rakaat.\" Abu Muhammad berkata, \"Aku melakukan sholat dua rakaat atau empat rakaat setelah sholat Jum'at.\""
            }
        ]
    }
}