{
    "status": true,
    "data": {
        "start": 2353,
        "end": 2499,
        "total": 147,
        "book": "darimi",
        "hadits": [
            {
                "number": 2353,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَدْنَى أَهْلِ الْجَنَّةِ مَنْزِلًا مَنْ يَتَمَنَّى عَلَى اللَّهِ فَيُقَالُ لَهُ لَكَ ذَاكَ وَمِثْلُهُ مَعَهُ إِلَّا أَنَّهُ يُلَقَّى سِوَى كَذَا وَكَذَا فَيُقَالُ لَهُ ذَاكَ لَكَ وَمِثْلُهُ مَعَهُ قَالَ أَبُو سَعِيدٍ الْخُدْرِيُّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيُقَالُ لَهُ ذَاكَ وَعَشْرَةُ أَمْثَالِهِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Muhammad bin Amr] dari [Abu Salamah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya penghuni surga yang paling rendah derajatnya adalah orang yang mempunyai angan-angan kepada Allah. Dikatakan kepadanya; Engkau berhak mendapatkan angan-angan itu dan yang seperti angan-angan itu, ia hanya mengatakan ini dan ini. Dikatakan kepadanya; Engkau berhak mendapatkan itu dan yang seperti itu.\" [Abu Sa'id Al Khudri] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maka dikatakan kepadanya; Itulah milikmu dan sepuluh perkara seperti itu.\""
            },
            {
                "number": 2354,
                "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَبُو حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَهْلَ الْجَنَّةِ لَيَتَرَاءَوْنَ أَهْلَ الْغُرَفِ فِي الْجَنَّةِ كَمَا تَرَوْنَ الْكَوْكَبَ الدُّرِّيَّ فِي السَّمَاءِ قَالَ أَبُو حَازِمٍ فَحَدَّثْتُ بِهَذَا الْحَدِيثِ النُّعْمَانَ بْنَ أَبِي عَيَّاشٍ فَحَدَّثَنِي عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّهُ قَالَ الْكَوْكَبُ الدُّرِّيُّ فِي السَّمَاءِ الشَّرْقِيُّ وَالْغَرْبِيُّ ",
                "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Abu Hazim] dari [Sahal bin Sa'd] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya penghuni surga itu dapat melihat para penghuni ruangan yang ada di surga sebagaimana mereka dapat melihat bintang yang bersinar di langit.\" Abu Hazim berkata; Maka aku ceritakan hadits ini kepada [An Nu'man bin Abu 'Ayyasy] lalu ia menceritakan kepadaku dari [Abu Sa'id Al Khudri] bahwa ia berkata; Bintang yang bersinar di langit baik di timur maupun di barat."
            },
            {
                "number": 2355,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا هِشَامٌ الْقُرْدُوسِيُّ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا فِي الْجَنَّةِ أَحَدٌ إِلَّا لَهُ زَوْجَتَانِ إِنَّهُ لَيَرَى مُخَّ سَاقِهِمَا مِنْ وَرَاءِ سَبْعِينَ حُلَّةً مَا فِيهَا مِنْ عَزَبٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Minhal] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Hisyam Al Qurdusi] dari [Muhammad bin Sirin] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada seorang pun di dalam surga melainkan ia memiliki dua orang isteri. Sesungguhnya ia dapat melihat mulusnya betis kedua isteri itu dari balik tujuh puluh dua hullah (pakaian). Tidak ada seorang pun di dalamnya yang membujang.\" "
            },
            {
                "number": 2356,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هَمَّامٌ حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْخَيْمَةُ دُرَّةٌ مُجَوَّفَةٌ طُولُهَا فِي السَّمَاءِ سِتُّونَ مِيلًا فِي كُلِّ زَاوِيَةٍ مِنْهَا أَهْلٌ لِلْمُؤْمِنِ لَا يَرَاهُمْ الْآخَرُونَ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Hammam] telah menceritakan kepada kami [Abu Imran Al Jauni] dari [Abu Bakr bin Abdullah bin Qais] dari [ayahnya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tenda (di surga) berupa permata besar yang berlubang, tingginya di langit enam puluh mil. Pada setiap sudut dari tenda itu terdapat tempat bagi orang-orang beriman, yang tidak dapat dilihat orang lain.\""
            },
            {
                "number": 2357,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ وَالْقَوَارِيرِيُّ عَنْ مُعَاذِ بْنِ هِشَامٍ عَنْ أَبِيهِ عَنْ عَامِرٍ الْأَحْوَلِ عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْمُؤْمِنَ إِذَا اشْتَهَى الْوَلَدَ فِي الْجَنَّةِ كَانَ حَمْلُهُ وَوَضْعُهُ وَسِنُّهُ فِي سَاعَةٍ كَمَا اشْتَهَى",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yazid] dan [Al Qawariri] dari [Mu'adz bin Hisyam] dari [ayahnya] dari [Amir Al Ahwal] dari [Abu Ash Shiddiq An Naji] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya seorang mukmin di surga apabila menginginkan seorang anak, maka (waktu) kehamilan, melahirkan dan usia anak itu berlangsung dalam sekejap sebagaimana yang ia inginkan.\""
            },
            {
                "number": 2358,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ عَنْ سُفْيَانَ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ قَالَ أُرَاهُ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهْلُ الْجَنَّةِ عِشْرُونَ وَمِائَةُ صَفٍّ ثَمَانُونَ مِنْهَا أُمَّتِي وَأَرْبَعُونَ سَائِرُ النَّاسِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala`] ia berkata; Telah menceritakan kepada kami [Mu'awiyah bin Hisyam] dari [Sufyan] dari ['Alqamah bin Martsad] dari [Sulaiman bin Buraidah] ia berkata; Aku kira dari [ayahnya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penghuni surga itu berjumlah seratus dua puluh barisan, delapan puluh di antaranya adalah umatku, sedangkan empat puluh (barisan) lainnya adalah seluruh umat manusia (yang bukan umatku).\""
            },
            {
                "number": 2359,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا الْجُرَيْرِيُّ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجَنَّةِ بَحْرَ اللَّبَنِ وَبَحْرَ الْعَسَلِ وَبَحْرَ الْخَمْرِ ثُمَّ تَشَقَّقُ مِنْهُ الْأَنْهَارُ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] ia berkata; Telah mengabarkan kepada kami [Al Jurairi] dari [Hakim bin Mu'awiyah] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya di dalam surga terdapat lautan susu, lautan madu dan lautan khamr, kemudian dari lautan itu mengalirlah sungai-sungai.\""
            },
            {
                "number": 2360,
                "arab": " أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ مُحَارِبِ بْنِ دِثَارٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ قَالَ لَمَّا نَزَلَتْ { إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ } قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ نَهْرٌ فِي الْجَنَّةِ حَافَّتَاهُ مِنْ ذَهَبٍ يَجْرِي عَلَى الدُّرِّ وَالْيَاقُوتِ تُرْبَتُهُ أَطْيَبُ مِنْ رِيحِ الْمِسْكِ وَطَعْمُهُ أَحْلَى مِنْ الْعَسَلِ وَمَاؤُهُ أَشَدُّ بَيَاضًا مِنْ الثَّلْجِ",
                "id": "Telah mengabarkan kepada kami [Amr bin 'Aun] telah mengabarkan kepada kami [Abu 'Awanah] dari ['Atha` bin As Sa`ib] dari [Muharib bin Ditsar] ia berkata; Telah menceritakan kepada kami [Abdullah bin Umar] ia berkata; Ketika turun ayat: INNA A'THAINA KAL KAUTSAR (Sesungguhnya Kami telah memberikan kepadamu nikmat yang banyak), Rasulullah shallallahu 'alaihi wasallam bersabda: \"Itu adalah sungai di dalam surga, kedua tepinya terbuat dari emas, airnya mengalir di atas permata dan yaqut, tanahnya lebih wangi dari minyak misik, rasanya lebih manis dari pada madu, dan airnya lebih putih dari pada salju.\""
            },
            {
                "number": 2361,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فِي الْجَنَّةِ شَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ لَا يَقْطَعُهَا وَاقْرَءُوا إِنْ شِئْتُمْ { وَظِلٍّ مَمْدُودٍ }",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Muhammad bin Amr] dari [Abu Salamah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya di dalam surga terdapat sebatang pohon, jika seorang pengendara menyusuri naungannya selama seratus tahun, niscaya ia tidak dapat mencapai ujungnya. Bacalah jika kalian menghendaki: (Dan naungan yang terbentang luas).\""
            },
            {
                "number": 2362,
                "arab": " أَخْبَرَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي الضَّحَّاكِ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجَنَّةِ شَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ لَا يَقْطَعُهَا هِيَ شَجَرَةُ الْخُلْدِ",
                "id": "Telah mengabarkan kepada kami [Abdush Shamad bin Abdul Warits] telah menceritakan kepada kami [Syu'bah] dari [Abu Adl Dlahak] ia berkata; Aku mendengar [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya di dalam surga terdapat sebatang pohon, jika seorang pengendara menyusuri naungannya selama seratus tahun, niscaya ia tidak dapat mencapai ujungnya. Pohon itu adalah pohon Al Khuldi.\""
            },
            {
                "number": 2363,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا عَبَّادٌ هُوَ ابْنُ مَنْصُورٍ قَالَ سَمِعْتُ شَهْرَ بْنَ حَوْشَبٍ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَجْوَةُ مِنْ الْجَنَّةِ وَهِيَ شِفَاءٌ مِنْ السُّمِّ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami ['Abbad] ia adalah Ibnu Manshur, ia berkata; Aku mendengar [Syahar bin Hausyab] berkata; Aku mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kurma 'ajwah itu berasal dari surga, ia adalah penawar racun.\""
            },
            {
                "number": 2364,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا حُمَيْدٌ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجَنَّةِ لَسُوقًا قَالُوا وَمَا هِيَ قَالَ كُثْبَانٌ مِنْ مِسْكٍ يَخْرُجُونَ إِلَيْهَا فَيَجْتَمِعُونَ فِيهَا فَيَبْعَثُ اللَّهُ عَلَيْهِمْ رِيحًا فَتُدْخِلُهُمْ بُيُوتَهُمْ فَيَقُولُ لَهُمْ أَهْلُوهُمْ لَقَدْ ازْدَدْتُمْ بَعْدَنَا حُسْنًا وَيَقُولُونَ لِأَهْلِيهِمْ مِثْلَ ذَلِكَ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْجَبَّارِ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Humaid] dari [Anas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya di dalam surga terdapat sebuah pasar.\" Mereka bertanya; Pasar apa itu? Beliau menjawab: \"Terdapat di dalamnya tumpukan minyak misik. Para penghuni surga mendatanginya dan berkumpul di sana. Lalu Allah mengirim angin kepada mereka dan angin itu menghempaskan mereka masuk ke rumah-rumah mereka. Para penghuni rumah berkata kepada mereka; Sesungguhnya kalian semakin tampan setelah kami. Mereka juga mengatakan demikian.\" Telah menceritakan kepada kami [Sa'id bin Abdul Jabbar] dari [Hammad bin Salamah] dari [Tsabit] dari [Anas] dari Nabi shallallahu 'alaihi wasallam seperti itu."
            },
            {
                "number": 2365,
                "arab": " أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُفَّتْ الْجَنَّةُ بِالْمَكَارِهِ وَحُفَّتْ النَّارُ بِالشَّهَوَاتِ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Anas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Surga itu dikelilingi oleh hal-hal yang tidak disukai dan neraka dikelilingi oleh hal-hal yang disenangi.\""
            },
            {
                "number": 2366,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ قَالَ حَدَّثَنِي مُعَاوِيَةُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ جُبَيْرٍ حَدَّثَهُ عَنْ أَبِيهِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ بَيْنَا أَنَا قَاعِدٌ فِي الْمَسْجِدِ وَحَلْقَةٌ مِنْ فُقَرَاءِ الْمُهَاجِرِينَ قُعُودٌ إِذْ دَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَعَدَ إِلَيْهِمْ فَقُمْتُ إِلَيْهِمْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهُمْ لِيُبْشِرْ فُقَرَاءُ الْمُهَاجِرِينَ بِمَا يَسُرُّ وُجُوهَهُمْ فَإِنَّهُمْ يَدْخُلُونَ الْجَنَّةَ قَبْلَ الْأَغْنِيَاءِ بِأَرْبَعِينَ عَامًا قَالَ فَلَقَدْ رَأَيْتُ أَلْوَانَهُمْ أَسْفَرَتْ قَالَ عَبْدُ اللَّهِ بْنُ عَمْرٍو حَتَّى تَمَنَّيْتُ أَنْ أَكُونَ مَعَهُمْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Shalih] ia berkata; Telah menceritakan kepadaku [Mu'awiyah] bahwa [Abdurrahman bin Jubair] menceritakannya dari ayahnya [Jubair bin Nufair] dari [Abdullah bin Amr] ia berkata; Ketika aku sedang duduk di masjid bersama sekelompok kaum fakir Muhajirin, tiba-tiba Nabi shallallahu 'alaihi wasallam masuk lalu duduk di hadapan mereka, aku pun menghampiri mereka. Nabi shallallahu 'alaihi wasallam bersabda: \"Hendaklah kaum fakir Muhajirin bahagia karena sesuatu yang membuat wajah mereka berseri. Sesungguhnya mereka akan masuk surga empat puluh tahun sebelum orang-orang kaya.\" Ia mengatakan; Lalu aku melihat warna wajah mereka bersinar. Abdullah bin Amr melanjutkan; Hingga aku berandai-andai diriku bersama mereka."
            },
            {
                "number": 2367,
                "arab": " أَخْبَرَنَا الْحَكَمُ بْنُ نَافِعٍ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ سَمِعَهُ يَقُولُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْتَكَتْ النَّارُ إِلَى رَبِّهَا فَقَالَتْ رَبِّ أَكَلَ بَعْضِي بَعْضًا فَأَذِنَ لَهَا بِنَفَسَيْنِ نَفَسٍ فِي الشِّتَاءِ وَنَفَسٍ فِي الصَّيْفِ فَهُوَ أَشَدُّ مَا تَجِدُونَ مِنْ الْحَرِّ وَأَشَدُّ مَا تَجِدُونَ مِنْ الزَّمْهَرِيرِ أَخْبَرَنَا حَجَّاجٌ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَاصِمِ بْنِ بَهْدَلَةَ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Al Hakam bin Nafi'] telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] ia berkata; telah mengabarkan kepadaku [Abu Salamah] dari [Abu Hurairah] bahwa ia mendengarnya berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Neraka mengadu kepada Rabbnya, ia berkata; Ya Rabb, sebagian dariku memakan sebagian yang lain. Maka Dia mengizinkannya memiliki dua nafas; Nafas pada musim dingin dan nafas pada musim panas. Nafas itu lebih panas dari pada hawa yang sangat panas yang kalian rasakan dan lebih dingin dari pada hawa yang sangat dingin yang kalian rasakan.\" Telah mengabarkan kepada kami [Hajjaj] telah menceritakan kepada kami [Hammad bin Salamah] dari ['Ashim bin Bahdalah] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti itu."
            },
            {
                "number": 2368,
                "arab": " أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ أَخْبَرَنَا الْهَجَرِيُّ عَنْ أَبِي عِيَاضٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ نَارَكُمْ هَذِهِ جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنْ نَارِ جَهَنَّمَ",
                "id": "Telah mengabarkan kepada kami [Ja'far bin 'Aun] telah mengabarkan kepada kami [Al Hajari] dari [Abu 'Iyadl] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya (panasnya) api kalian ini (di dunia) adalah satu dari tujuh puluh (1\/70) dari panasnya api neraka jahannam.\" "
            },
            {
                "number": 2369,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ عَجْلَانَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَهْوَنُ النَّاسِ عَذَابًا مَنْ لَهُ نَعْلَانِ يَغْلِي مِنْهُمَا دِمَاغُهُ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Ibnu 'Ajlan] dari [ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Manusia yang paling ringan siksanya adalah orang yang mengenakan sandalnya hingga (panasnya api itu) membuat otaknya mendidih.\""
            },
            {
                "number": 2370,
                "arab": " أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَمَّارِ بْنِ أَبِي عَمَّارٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُلْقَى فِي النَّارِ أَهْلُهَا وَتَقُولُ { هَلْ مِنْ مَزِيدٍ } { هَلْ مِنْ مَزِيدٍ } ثَلَاثًا حَتَّى يَأْتِيَهَا رَبُّهَا فَيَضَعَ قَدَمَهُ عَلَيْهَا فَتُزْوَى وَتَقُولُ قَطْ قَطْ قَطْ",
                "id": "Telah mengabarkan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] dari [Ammar bin Abu Ammar] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penghuni neraka akan dilemparkan ke dalam neraka. Lalu neraka itu mengatakan; Masih adakah tambahan? Ia mengatakannya tiga kali hingga Rabbnya mendatanginya, kemudian meletakkan telapak kakiNya padanya, sehingga ia pun berkumpul (dengan yang lain) dan berkata; Cukup, cukup, cukup.\""
            },
            {
                "number": 2371,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا عَاصِمٌ عَنْ مُوَرِّقٍ الْعِجْلِيِّ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ تَعَلَّمُوا الْفَرَائِضَ وَاللَّحْنَ وَالسُّنَنَ كَمَا تَعَلَّمُونَ الْقُرْآنَ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami ['Ashim] dari [Muwarriq Al 'Ijli] ia berkata; [Umar bin Khaththab] berkata; Pelajarilah faraidl, bahasa Arab dan sunnah sebagaimana kalian mempelajari Al Qur`an."
            },
            {
                "number": 2372,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ قَالَ قَالَ عُمَرُ تَعَلَّمُوا الْفَرَائِضَ فَإِنَّهَا مِنْ دِينِكُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim] ia berkata; [Umar] berkata; Pelajarilah faraidl, karena faraidl itu bagian dari agama kalian."
            },
            {
                "number": 2373,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا يُوسُفُ الْمَاجِشُونُ قَالَ قَالَ ابْنُ شِهَابٍ لَوْ هَلَكَ عُثْمَانُ وَزَيْدٌ فِي بَعْضِ الزَّمَانِ لَهَلَكَ عِلْمُ الْفَرَائِضِ لَقَدْ أَتَى عَلَى النَّاسِ زَمَانٌ وَمَا يَعْلَمُهَا غَيْرُهُمَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Yusuf Al Majisyun] ia berkata; [Ibnu Syihab] berkata; Seandainya Utsman dan Zaid meninggal di suatu masa, niscaya hilanglah ilmu faraidl. Sungguh telah datang masa di mana tidak ada yang mengetahuinya selain mereka berdua."
            },
            {
                "number": 2374,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ الْقَاسِمِ قَالَ قَالَ عَبْدُ اللَّهِ تَعَلَّمُوا الْقُرْآنَ وَالْفَرَائِضَ فَإِنَّهُ يُوشِكُ أَنْ يَفْتَقِرَ الرَّجُلُ إِلَى عِلْمٍ كَانَ يَعْلَمُهُ أَوْ يَبْقَى فِي قَوْمٍ لَا يَعْلَمُونَ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Al Mas'udi] dari [Al Qasim] ia berkata; [Abdullah] berkata; Pelajarilah Al Qur`an dan ilmu faraidl, karena seseorang akan membutuhkan ilmu yang telah ia pelajari, atau ia berada di suatu kaum yang tidak mengetahui."
            },
            {
                "number": 2375,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زِيَادُ بْنُ أَبِي مُسْلِمٍ عَنْ أَبِي الْخَلِيلِ قَالَ قَالَ أَبُو مُوسَى مَنْ عَلِمَ الْقُرْآنَ وَلَمْ يَعْلَمْ الْفَرَائِضَ فَإِنَّ مَثَلَهُ مَثَلُ الْبُرْنُسِ لَا وَجْهَ لَهُ أَوْ لَيْسَ لَهُ وَجْهٌ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Ziyad bin Abu Muslim] dari [Abu Al Khalil] ia berkata; [Abu Musa] berkata; Barangsiapa mempelajari Al Qur`an namun tidak mengetahui ilmu faraidl, maka perumpamaannya seperti burnus yang tidak ada wajah padanya atau tidak memiliki wajah. "
            },
            {
                "number": 2376,
                "arab": " حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ قَالَ قُلْتُ لِعَلْقَمَةَ مَا أَدْرِي مَا أَسْأَلُكَ عَنْهُ قَالَ أَمِتْ جِيرَانَكَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] dari [Al A'masy] dari [Ibrahim] ia berkata; Aku bertanya kepada ['Alqamah]; Aku tidak tahu apa yang harus aku tanyakan kepadamu? Ia mengatakan; Anggap tetanggamu telah meninggal dunia."
            },
            {
                "number": 2377,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ عَنْ الْقَاسِمِ بْنِ الْوَلِيدِ الْهَمْدَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ تَعَلَّمُوا الْفَرَائِضَ وَالطَّلَاقَ وَالْحَجَّ فَإِنَّهُ مِنْ دِينِكُمْ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Muhammad bin Thalhah] dari [Al Qasim bin Al Walid Al Hamdani] dari [Abdullah bin Mas'ud] ia berkata; Pelajarilah (tentang masalah) faraidl, thalaq dan haji, sebab masalah-masalah tersebut adalah bagian dari agama kalian."
            },
            {
                "number": 2378,
                "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ كَثِيرٍ عَنْ الْحَسَنِ قَالَ كَانُوا يُرَغِّبُونَ فِي تَعْلِيمِ الْقُرْآنِ وَالْفَرَائِضِ وَالْمَنَاسِكِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Katsir] dari [Al Hasan] ia berkata; Mereka sangat menganjurkan untuk mempelajari Al Qur`an, faraidl dan manasik haji."
            },
            {
                "number": 2379,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ قَالَ مَنْ قَرَأَ الْقُرْآنَ فَلْيَتَعَلَّمْ الْفَرَائِضَ فَإِنْ لَقِيَهُ أَعْرَابِيٌّ قَالَ يَا مُهَاجِرُ أَتَقْرَأُ الْقُرْآنَ فَإِنْ قَالَ نَعَمْ قَالَ تَفْرِضُ فَإِنْ قَالَ نَعَمْ فَهُوَ زِيَادَةٌ وَخَيْرٌ وَإِنْ قَالَ لَا قَالَ فَمَا فَضْلُكَ عَلَيَّ يَا مُهَاجِرُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Abu Ishaq] dari [Abu Ubaidah] dari [Abdullah] ia berkata; Barangsiapa membaca Al Qur`an, hendaklah ia mempelajari faraidl. Karena, jika ia bertemu dengan seorang Arab desa (badui), ia akan bertanya; Wahai muhajir (pendatang), apakah engkau membaca Al Qur`an? Jika ia menjawab; Ya, ia akan bertanya; Engkau mengerti faraidl? Jika ia menjawab; Ya, maka itu merupakan kelebihan dan kebaikan. Jika ia menjawab; Tidak, ia akan berkata; Engkau tidak lebih utama dariku, wahai muhajir (pendatang)."
            },
            {
                "number": 2380,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ عَنْ الْأَعْمَشِ عَنْ مُسْلِمٍ قَالَ سَأَلْنَا مَسْرُوقًا كَانَتْ عَائِشَةُ تُحْسِنُ الْفَرَائِضَ قَالَ وَالَّذِي لَا إِلَهَ غَيْرُهُ لَقَدْ رَأَيْتُ الْأَكَابِرَ مِنْ أَصْحَابِ مُحَمَّدٍ يَسْأَلُونَهَا عَنْ الْفَرَائِضِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Uqbah bin Khalid] dari [Al A'masy] dari [Muslim] ia berkata; Kami bertanya kepada [Masruq]; Benarkah [Aisyah] ahli dalam faraidl? Ia menjawab; Demi Dzat yang tidak ada tuhan yang haq selain Dia, sungguh aku melihat para tokoh sahabat Muhammad bertanya kepadanya tentang faraidl."
            },
            {
                "number": 2381,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ شُعْبَةَ عَنْ عَاصِمٍ عَنْ أَبِي عُثْمَانَ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ وَعَنْ أَبِي بَكْرَةَ قَالَ شُعْبَةُ هَذَا أَوَّلُ مَنْ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ وَهَذَا تَدَلَّى مِنْ حِصْنِ الطَّائِفِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُمَا حَدَّثَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ ادَّعَى إِلَى غَيْرِ أَبِيهِ وَهُوَ يَعْلَمُ أَنَّهُ غَيْرُ أَبِيهِ فَالْجَنَّةُ عَلَيْهِ حَرَامٌ",
                "id": "Telah mengabarkan kepada kami [Sa'id bin Amir] dari [Syu'bah] dari ['Ashim] dari [Abu Utsman] dari [Sa'd bin Abu Waqqash] dan dari [Abu Bakrah], Syu'bah berkata; Ini adalah orang pertama yang melepaskan anak panah fi sabilillah sedangkan yang ini adalah orang pertama yang turun dari benteng Tha`if untuk bergabung dengan Rasulullah shallallahu 'alaihi wasallam. Sesungguhnya mereka berdua menceritakan bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengakui orang lain sebagai ayah kandungnya, padahal ia tahu bahwa orang itu bukan ayah kandungnya, maka surga haram atasnya.\""
            },
            {
                "number": 2382,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ أَبِي مَعْمَرٍ عَنْ أَبِي بَكْرٍ الصِّدِّيقِ قَالَ كُفْرٌ بِاللَّهِ ادِّعَاءٌ إِلَى نَسَبٍ لَا يُعْرَفُ وَكُفْرٌ بِاللَّهِ تَبَرُّؤٌ مِنْ نَسَبٍ وَإِنْ دَقَّ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ زَكَرِيَّا أَبِي يَحْيَى قَالَ سَمِعْتُ أَبَا وَائِلٍ يُحَدِّثُ عَنْ ابْنِ مَسْعُودٍ نَحْوًا مِنْهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Abdullah bin Murrah] dari [Abu Ma'mar] dari [Abu Bakr Ash Shiddiq] ia berkata; Termasuk perbuatan kufur kepada Allah adalah orang yang mengakui keturunan orang lain yang tidak dikenal dan berlepas diri dari nasabnya, sekali pun itu hal yang sepele. Telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Zakariya Abu Yahya] ia berkata; aku mendengar [Abu Wa`il] menceritakan dari [Ibnu Mas'ud] seperti riwayat itu."
            },
            {
                "number": 2383,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ السَّلُولِيُّ عَنْ جَعْفَرٍ الْأَحْمَرِ عَنْ السَّرِيِّ بْنِ إِسْمَعِيلَ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ قَالَ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُبَايِعَهُ فَجِئْتُ وَقَدْ قُبِضَ وَأَبُو بَكْرٍ قَائِمٌ فِي مَقَامِهِ فَأَطَابَ الثَّنَاءَ وَأَكْثَرَ الْبُكَاءَ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كُفْرٌ بِاللَّهِ انْتِفَاءٌ مِنْ نَسَبٍ وَإِنْ دَقَّ وَادِّعَاءُ نَسَبٍ لَا يُعْرَفُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Ishaq bin Manshur As Saluli] dari [Ja'far Al Ahmar] dari [As Sari bin Isma'il] dari [Qais bin Abu Hazim] ia berkata; Aku datang menemui Nabi shallallahu 'alaihi wasallam untuk melakukan janji setia (baiat) kepada beliau. Kemudian ketika aku datang lagi, beliau telah wafat dan [Abu Bakr] yang menggantikan kepemimpinan beliau. Ia mengucapkan puji-pujian begitu indah dan menangis begitu lama. Lalu ia berkata; Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Termasuk perbuatan kufur kepada Allah adalah mengaku bukan keturunan seseorang (padahal sebenarnya ia anaknya), sekalipun itu hal yang remeh, dan mengakui keturunan orang lain yang tidak dikenal.\""
            },
            {
                "number": 2384,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَهْرَامَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا رَجُلٍ ادَّعَى إِلَى غَيْرِ وَالِدِهِ أَوْ تَوَلَّى غَيْرَ مَوَالِيهِ الَّذِينَ أَعْتَقُوهُ فَإِنَّ عَلَيْهِ لَعْنَةَ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ إِلَى يَوْمِ الْقِيَامَةِ لَا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عَدْلٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Abdul Hamid bin Bahram] dari [Syahr bin Hausyab] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa saja yang mengaku menisbatkan kepada selain ayahnya atau setia kepada orang lain selain tuan yang memerdekakannya, maka ia akan mendapat laknat Allah, malaikat, dan seluruh manusia hingga hari kiamat. Dan tidak akan diterima taubat dan fidyah (tebusan) nya.\" "
            },
            {
                "number": 2385,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شَرِيكٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ قَالَ قَالَ عَبْدُ اللَّهِ كَانَ عُمَرُ إِذَا سَلَكَ بِنَا طَرِيقًا وَجَدْنَاهُ سَهْلًا وَإِنَّهُ قَالَ فِي زَوْجٍ وَأَبَوَيْنِ لِلزَّوْجِ النِّصْفُ وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Syarik] dari [Al A'masy] dari [Ibrahim] ia berkata; [Abdullah] berkata; Apabila Umar berjalan bersama kami di suatu jalan, kami akan mendapatkan kemudahan. [Beliau] berkata tentang masalah (bagian warisan) suami dan kedua orang tua; Suami mendapatkan setengah harta warisan dan ibu mendapatkan sepertiga dari yang tersisa."
            },
            {
                "number": 2386,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا يَزِيدُ الرِّشْكُ قَالَ سَأَلْتُ سَعِيدَ بْنَ الْمُسَيَّبِ عَنْ رَجُلٍ تَرَكَ امْرَأَتَهُ وَأَبَوَيْهِ فَقَالَ قَسَّمَهَا زَيْدُ بْنُ ثَابِتٍ مِنْ أَرْبَعَةٍ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Yazid Ar Risyk] ia berkata; Aku bertanya kepada [Sa'id bin Al Musayyab] tentang seorang laki-laki yang (meninggal dunia dengan) meninggalkan isteri dan kedua orang tuanya. Lalu ia menjawab; [Zaid bin Tsabit] membaginya dari empat. "
            },
            {
                "number": 2387,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ شُعْبَةَ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ أَنَّ عُثْمَانَ بْنَ عَفَّانَ قَالَ فِي امْرَأَةٍ وَأَبَوَيْنِ لِلْمَرْأَةِ الرُّبُعُ وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Amir] dari [Syu'bah] dari [Ayyub] dari [Abu Qilabah] dari [Abu Al Muhallab] bahwa [Utsman bin 'Affan] berkata tentang bagian seorang isteri dan kedua orang tua; Isteri mendapat seperempat dan ibu mendapat sepertiga dari harta yang tersisa."
            },
            {
                "number": 2388,
                "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عُثْمَانَ بْنِ عَفَّانَ أَنَّهُ قَالَ لِلْمَرْأَةِ الرُّبُعُ سَهْمٌ مِنْ أَرْبَعَةٍ وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ سَهْمٌ وَلِلْأَبِ سَهْمَانِ أَخْبَرَنَا حَجَّاجٌ حَدَّثَنَا حَمَّادٌ عَنْ حَجَّاجٍ عَنْ عُمَيْرِ بْنِ سَعِيدٍ أَنَّهُ سَأَلَ الْحَارِثَ الْأَعْوَرَ عَنْ امْرَأَةٍ وَأَبَوَيْنِ فَقَالَ مِثْلَ قَوْلِ عُثْمَانَ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad bin Salamah] dari [Ayyub] dari [Abu Qilabah] dari [Abu Al Muhallab] dari [Utsman bin 'Affan] bahwa ia berkata; Seorang isteri mendapat seperempat bagian dari empat, ibu mendapat sepertiga bagian yang tersisa dan ayah mendapat dua bagian. Telah mengabarkan kepada kami [Hajjaj] telah menceritakan kepada kami [Hammad] dari [Hajjaj] dari [Umair bin [Sa'id] bahwa ia pernah bertanya kepada [Al Harits Al A'war] tentang seorang isteri dan kedua orang tua. Lalu ia menjawab seperti jawaban Utsman."
            },
            {
                "number": 2389,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ زَيْدِ بْنِ ثَابِتٍ أَنَّهُ قَالَ فِي امْرَأَةٍ تَرَكَتْ زَوْجَهَا وَأَبَوَيْهَا لِلزَّوْجِ النِّصْفُ وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Sa'id bin Al Musayyab] dari [Zaid bin Tsabit] bahwa ia berkata tentang seorang isteri yang meninggalkan suami dan kedua orang tuanya; Suami mendapat setengah bagian dan ibu mendapat sepertiga yang tersisa."
            },
            {
                "number": 2390,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ ابْنِ أَبِي لَيْلَى عَنْ عَامِرٍ الشَّعْبِيِّ عَنْ عَلِيٍّ فِي امْرَأَةٍ وَأَبَوَيْنِ قَالَ مِنْ أَرْبَعَةٍ لِلْمَرْأَةِ الرُّبُعُ وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ وَمَا بَقِيَ فَلِلْأَبِ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Musa] dari [Ibnu Abu Laila] dari [Amir Asy Sya'bi] dari [Ali] tentang seorang isteri dan kedua orang tua. Ia mengatakan; Dari empat (asal masalahnya empat), isteri mendapat seperempat, ibu mendapat sepertiga (dari harta) yang tersisa dan yang tersisa lagi untuk ayah."
            },
            {
                "number": 2391,
                "arab": " أَخْبَرَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِيهِ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ عَبْدِ اللَّهِ قَالَ كَانَ يَقُولُ مَا كَانَ اللَّهُ لِيَرَانِي أَنْ أُفَضِّلَ أُمًّا عَلَى أَبٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad] telah menceritakan kepada kami [Sufyan] dari [ayahnya] dari [Al Musayyab bin Rafi'] dari [Abdullah], ia berkata; (Abdullah) pernah berkata; Allah tidak akan senang melihatku jika aku melebihkan bagian ibu atas ayah."
            },
            {
                "number": 2392,
                "arab": " أَخْبَرَنَا سَعِيدُ بْنُ عَامِرٍ أَخْبَرَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ عِكْرِمَةَ قَالَ أَرْسَلَ ابْنُ عَبَّاسٍ إِلَى زَيْدِ بْنِ ثَابِتٍ أَتَجِدُ فِي كِتَابِ اللَّهِ لِلْأُمِّ ثُلُثُ مَا بَقِيَ فَقَالَ زَيْدٌ إِنَّمَا أَنْتَ رَجُلٌ تَقُولُ بِرَأْيِكَ وَأَنَا رَجُلٌ أَقُولُ بِرَأْيِي",
                "id": "Telah mengabarkan kepada kami [Sa'id bin Amir] telah mengabarkan kepada kami [Syu'bah] dari [Al Hakam] dari [Ikrimah] ia berkata; Ibnu Abbas mengirim surat kepada Zaid bin Tsabit; Apakah engkau pernah menemukan dalam kitab Allah; Ibu mendapat sepertiga dari warisan yang tersisa? [Zaid] menjawab; Sesungguhnya engkau adalah orang yang dapat berbicara berdasarkan pendapatmu dan aku juga orang yang dapat berbicara dengan pendapatku."
            },
            {
                "number": 2393,
                "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلِيٍّ قَالَ لِلْأُمِّ ثُلُثُ جَمِيعِ الْمَالِ فِي امْرَأَةٍ وَأَبَوَيْنِ وَفِي زَوْجٍ وَأَبَوَيْنِ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah mengabarkan kepada kami [Abu 'Awanah] dari [Al A'masy] dari [Ibrahim] dari [Ali] ia berkata; Ibu mendapatkan sepetiga dari seluruh harta dalam masalah isteri dan kedua orang tua serta dalam masalah suami dan kedua orang tua."
            },
            {
                "number": 2394,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ أَبِيهِ عَنْ الْفُضَيْلِ بْنِ عَمْرٍو عَنْ إِبْرَاهِيمَ قَالَ خَالَفَ ابْنُ عَبَّاسٍ أَهْلَ الْقِبْلَةِ فِي امْرَأَةٍ وَأَبَوَيْنِ جَعَلَ لِلْأُمِّ الثُّلُثَ مِنْ جَمِيعِ الْمَالِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Ibnu Idris] dari [ayahnya] dari [Al Fudlail bin Amr] dari [Ibrahim] ia berkata; [Ibnu Abbas] menyelisihi pendapat ahlu qiblat dalam masalah isteri dan kedua orang tua, ia menjadikan bagian ibu sepertiga dari seluruh harta."
            },
            {
                "number": 2395,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ الْأَسْوَدِ بْنِ يَزِيدَ قَالَ قَضَى مُعَاذُ بْنُ جَبَلٍ بِالْيَمَنِ فِي بِنْتٍ وَأُخْتٍ فَأَعْطَى الْبِنْتَ النِّصْفَ وَالْأُخْتَ النِّصْفَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan Ats Tsauri] dari [Asy'ats bin Abu Asy Sya'tsa`] dari [Al Aswad bin Yazid] ia berkata; [Mu'adz bin Jabal] memutuskan hukum di Yaman dalam masalah bagian anak perempuan dan saudara perempuan, ia memberikan bagian anak perempuan setengah dan saudara perempuan setengah."
            },
            {
                "number": 2396,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ بْنِ يَزِيدَ أَنَّ ابْنَ الزُّبَيْرِ كَانَ لَا يُوَرِّثُ الْأُخْتَ مِنْ الْأَبِ وَالْأُمِّ مَعَ الْبِنْتِ حَتَّى حَدَّثَهُ الْأَسْوَدُ أَنَّ مُعَاذَ بْنَ جَبَلٍ جَعَلَ لِلْبِنْتِ النِّصْفَ وَلِلْأُخْتِ النِّصْفَ فَقَالَ أَنْتَ رَسُولِي إِلَى عَبْدِ اللَّهِ بْنِ عُتْبَةَ فَأَخْبِرْهُ بِذَاكَ وَكَانَ قَاضِيَهُ بِالْكُوفَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad bin Yazid] bahwa Ibnu Az Zubair tidak menetapkan warisan pada saudara perempuan seayah dan seibu bersama anak perempuan hingga Al Aswad menceritakannya bahwa [Mu'adz bin Jabal] menjadikan anak perempuan mendapat bagian setengah dan saudara perempuan mendapat bagian setengah. Ia pun berkata; Engkau adalah utusanku kepada Abdullah bin Utbah. Kabarkan hal ini kepadanya, ketika itu ia menjabat sebagai hakim di Kufah."
            },
            {
                "number": 2397,
                "arab": " حَدَّثَنَا بِشْرُ بْنُ عُمَرَ قَالَ سَأَلْتُ ابْنَ أَبِي الزِّنَادِ عَنْ رَجُلٍ تَرَكَ بِنْتًا وَأُخْتًا فَقَالَ لِابْنَتِهِ النِّصْفُ وَلِأُخْتِهِ مَا بَقِيَ وَقَالَ أَخْبَرَنِي أَبِي عَنْ خَارِجَةَ بْنِ زَيْدٍ أَنَّ زَيْدَ بْنَ ثَابِتٍ كَانَ يَجْعَلُ الْأَخَوَاتِ مَعَ الْبَنَاتِ عَصَبَةً لَا يَجْعَلُ لَهُنَّ إِلَّا مَا بَقِيَ",
                "id": "Telah menceritakan kepada kami [Bisyr bin Umar] ia berkata; Aku bertanya kepada [Ibnu Abu Az Zinad] tentang seorang laki-laki yang meninggalkan anak perempuan dan saudara perempuan. Ia pun menjawab; Anak perempuan mendapat bagian setengah dan saudara perempuan mendapatkan yang tersisa. Ia juga berkata; Telah mengabarkan kepadaku [ayahnya] dari [Kharijah bin Zaid] bahwa [Zaid bin Tsabit] menjadikan bagian para saudara perempuan bersama para anak perempuan adalah ashabah. Ia tidak memberikan warisan untuk mereka kecuali apa yang tersisa. "
            },
            {
                "number": 2398,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ وَالْأَعْمَشِ عَنْ إِبْرَاهِيمَ فِي زَوْجٍ وَأُمٍّ وَإِخْوَةٍ لِأَبٍ وَأُمٍّ وَإِخْوَةٍ لِأُمٍّ قَالَ كَانَ عُمَرُ وَعَبْدُ اللَّهِ وَزَيْدٌ يُشَرِّكُونَ وَقَالَ عُمَرُ لَمْ يَزِدْهُمْ الْأَبُ إِلَّا قُرْبًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Manshur] dan [Al A'masy] dari [Ibrahim] tentang suami, isteri saudara perempuan seayah seibu dan saudara perempuan seibu. Ia berkata; [Umar], [Abdullah] dan [Zaid] menetapkan musyarrakah bagi mereka. Umar berkata; Ayah tidak menambah mereka kecuali kedekatan. "
            },
            {
                "number": 2399,
                "arab": " حَدَّثَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ أَنَّهُ كَانَ لَا يُشَرِّكُ",
                "id": "Telah menceritakan kepada kami [Muhammad] telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Al Harits] dari [Ali] bahwa ia tidak menetapkan musyarrakah."
            },
            {
                "number": 2400,
                "arab": " أَخْبَرَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي مِجْلَزٍ أَنَّ عُثْمَانَ كَانَ يُشَرِّكُ وَعَلِيٌّ كَانَ لَا يُشَرِّكُ",
                "id": "Telah mengabarkan kepada kami [Muhammad] telah menceritakan kepada kami [Sufyan] dari [Sulaiman At Taimi] dari [Abu Mijlaz] bahwa [Utsman] menetapkan musyarrakah namun [Ali] tidak menetapkan musyarrakah."
            },
            {
                "number": 2401,
                "arab": " حَدَّثَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ ذَكْوَانَ أَنَّ زَيْدًا كَانَ يُشَرِّكُ",
                "id": "Telah menceritakan kepada kami [Muhammad] telah menceritakan kepada kami [Sufyan] dari [Ibnu Dzakwan] bahwa [Zaid] menetapkan musyarrakah."
            },
            {
                "number": 2402,
                "arab": " حَدَّثَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ شُرَيْحٍ أَنَّهُ كَانَ يُشَرِّكُ",
                "id": "Telah menceritakan kepada kami [Muhammad] telah menceritakan kepada kami [Sufyan] dari [Abdul Malik bin Umair] dari [Syuraih] bahwa ia menetapkan musyarrakah."
            },
            {
                "number": 2403,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ حَدَّثَنَا أَبُو شِهَابٍ عَنْ الْحَجَّاجِ عَنْ عَبْدِ الْمَلِكِ بْنِ الْمُغِيرَةِ عَنْ سَعِيدِ بْنِ فَيْرُوزَ عَنْ أَبِيهِ أَنَّ عُمَرَ قَالَ فِي الْمُشَرَّكَةِ لَمْ يَزِدْهُمْ الْأَبُ إِلَّا قُرْبًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shalt] telah menceritakan kepada kami [Abu Syihab] dari [Al Hajjaj] dari [Abdul Malik bin Al Mughirah] dari [Sa'id bin Fairuz] dari [ayahnya] bahwa [Umar] berkata tentang musyarrakah; Ayah tidak menambah mereka kecuali kedekatan."
            },
            {
                "number": 2404,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ الْأَعْوَرِ قَالَ أُتِيَ عَبْدُ اللَّهِ فِي فَرِيضَةِ بَنِي عَمٍّ أَحَدُهُمْ أَخٌ لِأُمٍّ فَقَالَ الْمَالُ أَجْمَعُ لِأَخِيهِ لِأُمِّهِ فَأَنْزَلَهُ بِحِسَابِ أَوْ بِمَنْزِلَةِ الْأَخِ مِنْ الْأَبِ وَالْأُمِّ فَلَمَّا قَدِمَ عَلِيٌّ سَأَلْتُهُ عَنْهَا وَأَخْبَرْتُهُ بِقَوْلِ عَبْدِ اللَّهِ فَقَالَ يَرْحَمُهُ اللَّهُ إِنْ كَانَ لَفَقِيهًا أَمَّا أَنَا فَلَمْ أَكُنْ لِأَزِيدَهُ عَلَى مَا فَرَضَ اللَّهُ لَهُ سَهْمٌ السُّدُسُ ثُمَّ يُقَاسِمُهُمْ كَرَجُلٍ مِنْهُمْ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zuhair] dari [Abu Ishaq] dari [Al Harits Al A'war] ia berkata; [Abdullah] pernah dihadapkan dengan masalah warisan dua anak paman dari pihak ayah. Salah satunya adalah saudara laki-laki seibu. Ia berkata; Harta seluruhnya untuk saudara laki-laki seibu. Ia menempatkan saudara laki-laki seibu dengan hitungan atau pada kedudukan saudara laki-laki seayah dan seibu. Ketika Ali datang, aku bertanya kepadanya tentang masalah ini. Aku juga memberitahukan perkataan Abdullah kepadanya. Maka [dia] menjawab; Semoga Allah merahmatinya, sesungguhnya ia adalah seorang faqih. Sedangkan aku tidak akan menambahkan bagian untuknya atas apa yang telah ditetapkan Allah, yaitu bagian seperenam. Lalu ia membagi harta untuk mereka seperti bagian laki-laki dari mereka."
            },
            {
                "number": 2405,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ أَنَّهُ أُتِيَ فِي ابْنَيْ عَمٍّ أَحَدُهُمَا أَخٌ لِأُمٍّ فَقِيلَ لِعَلِيٍّ إِنَّ ابْنَ مَسْعُودٍ كَانَ يُعْطِيهِ الْمَالَ كُلَّهُ فَقَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ إِنْ كَانَ لَفَقِيهًا وَلَوْ كُنْتُ أَنَا أَعْطَيْتُهُ السُّدُسَ وَمَا بَقِيَ كَانَ بَيْنَهُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Al Harits] dari [Ali] bahwa ia pernah dihadapkan dengan masalah warisan dua anak paman dari pihak ayah, salah satunya adalah saudara laki-laki seibu. Kemudian ketika Ali diberitahukan bahwa Ibnu Mas'ud memberikan kepada saudara laki-laki seibu seluruh harta, maka Ali radliallahu 'anhu berkata; Ia adalah seorang faqih. Seandainya aku yang memutuskan maka aku akan memberikan bagian seperenam untuknya dan yang tersisa dibagikan di antara mereka."
            },
            {
                "number": 2406,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ عَنْ أَبِي قَيْسٍ الْأَوْدِيِّ عَنْ هُزَيْلِ بْنِ شُرَحْبِيلَ قَالَ جَاءَ رَجُلٌ إِلَى أَبِي مُوسَى الْأَشْعَرِيِّ وَإِلَى سَلْمَانَ بْنِ رَبِيعَةَ فَسَأَلَهُمَا عَنْ بِنْتٍ وَبِنْتِ ابْنٍ وَأُخْتٍ لِأُمٍّ وَأَبٍ فَقَالَا لِلِابْنَةِ النِّصْفُ وَمَا بَقِيَ فَلِلْأُخْتِ وَأْتِ ابْنَ مَسْعُودٍ فَإِنَّهُ سَيُتَابِعُنَا فَجَاءَ الرَّجُلُ إِلَى عَبْدِ اللَّهِ فَسَأَلَهُ عَنْ ذَلِكَ فَقَالَ لَقَدْ ضَلَلْتُ إِذًا وَمَا أَنَا مِنْ الْمُهْتَدِينَ وَإِنِّي أَقْضِي بِمَا قَضَى بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلِابْنَةِ النِّصْفُ وَلِابْنَةِ الِابْنِ السُّدُسُ وَمَا بَقِيَ فَلِلْأُخْتِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan Ats Tsauri] dari [Abu Qais Al Audi] dari [Huzail bin Syurahbil] ia berkata; Ada seseorang mendatangi Abu Musa Al Asy'ari dan Salman bin Rabi'ah lalu menanyakan kepada keduanya tentang anak perempuan, anak perempuan dari anak laki-laki dan saudara perempuan seibu dan seayah. Mereka berdua menjawab; Anak perempuan mendapat setengah dan warisan yang tersisa untuk saudara perempuan. Datanglah kepada [Ibnu Mas'ud], tentu ia akan mengikuti pendapat kami. Lalu orang itu datang menemui Abdullah menanyakan tentang hal itu kepadanya. Ia pun mengatakan; Kalau tidak menjawab berarti aku telah tersesat dan tidak termasuk orang-orang yang mendapat petunjuk. Sesungguhnya aku memutuskan sesuatu dengan apa yang pernah diputuskan oleh Rasulullah shallallahu 'alaihi wasallam; Anak perempuan mendapat setengah, anak perempuan dari anak laki-laki mendapat seperenam, dan warisan yang tersisa untuk saudara perempuan."
            },
            {
                "number": 2407,
                "arab": " أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ عَنْ الْأَعْمَشِ عَنْ مُسْلِمٍ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ أَنَّهُ كَانَ يَقُولُ فِي أَخَوَاتٍ لِأَبٍ وَأُمٍّ وَإِخْوَةٍ وَأَخَوَاتٍ لِأَبٍ قَالَ لِلْأَخَوَاتِ لِلْأَبِ وَالْأُمِّ الثُّلُثَانِ وَمَا بَقِيَ فَلِلذُّكُورِ دُونَ الْإِنَاثِ فَقَدِمَ مَسْرُوقٌ الْمَدِينَةَ فَسَمِعَ قَوْلَ زَيْدٍ فِيهَا فَأَعْجَبَهُ فَقَالَ لَهُ بَعْضُ أَصْحَابِهِ أَتَتْرُكُ قَوْلَ عَبْدِ اللَّهِ فَقَالَ إِنِّي أَتَيْتُ الْمَدِينَةَ فَوَجَدْتُ زَيْدَ بْنَ ثَابِتٍ مِنْ الرَّاسِخِينَ فِي الْعِلْمِ قَالَ أَحْمَدُ فَقُلْتُ لِأَبِي شِهَابٍ وَكَيْفَ قَالَ زَيْدٌ فِيهَا قَالَ شَرَّكَ بَيْنَهُمْ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] dari [Al A'masy] dari [Muslim] dari [Masruq] dari [Abdullah] bahwa ia pernah berkata dalam masalah beberapa saudara perempuan seayah dan seibu, beberapa saudara laki-laki dan beberapa saudara perempuan seayah, ia berkata; Beberapa saudara perempuan seayah dan seibu mendapat dua pertiga dan yang tersisa hanya untuk para laki-laki tidak untuk perempuan. Lalu ketika Masruq datang ke Madinah, ia mendengar perkataan [Zaid] dalam masalah itu, ia pun heran, lalu sebagian sahabatnya menanyakannya; Apakah engkau akan meninggalkan perkataan Abdullah? Ia menjawab; Aku datang ke Madinah dan menemukan Zaid bin Tsabit termasuk orang-orang yang mendalam ilmunya. Ahmad berkata; Aku bertanya kepada Abu Syihab; Bagaimana jawabannya itu? Ia menjawab; Ia membagi harta secara musyarrakah di antara mereka."
            },
            {
                "number": 2408,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ عَنْ عِيسَى بْنِ يُونُسَ عَنْ إِسْمَعِيلَ قَالَ ذَكَرْنَا عِنْدَ حَكِيمِ بْنِ جَابِرٍ أَنَّ ابْنَ مَسْعُودٍ قَالَ فِي أَخَوَاتٍ لِأَبٍ وَأُمٍّ وَإِخْوَةٍ وَأَخَوَاتٍ لِأَبٍ أَنَّهُ كَانَ يُعْطِي لِلْأَخَوَاتِ مِنْ الْأَبِ وَالْأُمِّ الثُّلُثَيْنِ وَمَا بَقِيَ فَلِلذُّكُورِ دُونَ الْإِنَاثِ فَقَالَ حَكِيمٌ قَالَ زَيْدُ بْنُ ثَابِتٍ هَذَا مِنْ عَمَلِ الْجَاهِلِيَّةِ أَنْ يَرِثَ الرِّجَالُ دُونَ النِّسَاءِ إِنَّ إِخْوَتَهُنَّ قَدْ رُدُّوا عَلَيْهِنَّ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Al Mughirah] dari [Isa bin Yunus] dari [Isma'il] ia berkata; Kami menyebutkan kepada [Hakim bin Jabir] bahwa [Ibnu Mas'ud] berkata dalam masalah beberapa saudara perempuan seayah dan seibu, beberapa saudara laki-laki dan beberapa saudara perempuan seayah, bahwa ia memberi bagian kepada beberapa saudara peremuan seayah dan seibu dua pertiga, dan yang tersisa untuk para laki-laki saja. Lalu Hakim berkata; [Zaid bin Tsabit] berkata; Hal ini termasuk perbuatan jahiliyah, yaitu memberi hak waris kepada para laki-laki tidak kepada para perempuan. Sesungguhnya (bagian) para saudara laki-laki telah dikembalikan kepada mereka."
            },
            {
                "number": 2409,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ مَعْبَدِ بْنِ خَالِدٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ أَنَّهَا كَانَتْ تُشَرِّكُ بَيْنَ ابْنَتَيْنِ وَابْنَةِ ابْنٍ وَابْنِ ابْنٍ تُعْطِي الِابْنَتَيْنِ الثُّلُثَيْنِ وَمَا بَقِيَ فَشَرِيكُهُمْ وَكَانَ عَبْدُ اللَّهِ لَا يُشَرِّكُ يُعْطِي الذُّكُورَ دُونَ الْإِنَاثِ وَقَالَ الْأَخَوَاتُ بِمَنْزِلَةِ الْبَنَاتِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Ma'bad bin Khalid] dari [Masruq] dari [Aisyah] bahwa ia melakukan musyarrakah di antara dua anak perempuan, anak perempuan dari anak laki-laki dan anak laki-laki dari anak laki-laki; Dua anak perempuan mendapat dua pertiga dan yang tersisa dibagikan secara musyarrakah. Abdullah tidak melakukan musyarrakah, ia memberi bagian para laki-laki tidak kepada para perempuan. Ia berkata; Para saudara perempuan sama kedudukannya dengan para anak perempuan."
            },
            {
                "number": 2410,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي سَهْلٍ عَنْ الشَّعْبِيِّ أَنَّ ابْنَ مَسْعُودٍ كَانَ يَقُولُ فِي بِنْتٍ وَبَنَاتِ ابْنٍ وَابْنِ ابْنٍ إِنْ كَانَتْ الْمُقَاسَمَةُ بَيْنَهُمْ أَقَلَّ مِنْ السُّدُسِ أَعْطَاهُمْ السُّدُسَ وَإِنْ كَانَ أَكْثَرَ مِنْ السُّدُسِ أَعْطَاهُمْ السُّدُسَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Abu Sahl] dari [Asy Sya'bi] bahwa [Ibnu Mas'ud] pernah berkata dalam masalah anak perempuan dan para anak perempuan dari anak laki-laki serta anak laki-laki dari anak laki-laki; Jika pembagian di antara mereka kurang dari seperenam, maka diberkan kepada mereka seperenam dan jika lebih dari seperenam maka diberikan kepada mereka seperenam juga."
            },
            {
                "number": 2411,
                "arab": " حَدَّثَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ أَنَّهُ كَانَ يُشَرِّكُ فَقَالَ لَهُ عَلْقَمَةُ هَلْ أَحَدٌ مِنْهُمْ أَثْبَتُ مِنْ عَبْدِ اللَّهِ فَقَالَ لَا وَلَكِنِّي رَأَيْتُ زَيْدَ بْنَ ثَابِتٍ وَأَهْلَ الْمَدِينَةِ يُشَرِّكُونَ فِي ابْنَتَيْنِ وَبِنْتِ ابْنٍ وَابْنِ ابْنٍ وَأُخْتَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim] dari [Masruq] bahwa ia melakukan musyarrakah. Maka 'Alqamah berkata kepadanya; Adakah orang di antara mereka yang lebih memastikan dari pada Abdullah? Ia menjawab; Tidak ada, akan tetapi aku pernah melihat [Zaid bin Tsabit] dan ulama Madinah membagi harta warisan secara musyarrikah dalam masalah; Dua anak perempuan, seorang anak perempuan dari anak laki-laki, seorang anak laki-laki dari anak laki-laki dan dua saudara perempuan."
            },
            {
                "number": 2412,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ هِشَامٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ شُرَيْحٍ فِي امْرَأَةٍ تَرَكَتْ زَوْجَهَا وَأُمَّهَا وَأُخْتَهَا لِأَبِيهَا وَأُمِّهَا وَأُخْتَهَا لِأَبِيهَا وَإِخْوَتَهَا لِأُمِّهَا جَعَلَهَا مِنْ سِتَّةٍ ثُمَّ رَفَعَهَا فَبَلَغَتْ عَشْرَةً لِلزَّوْجِ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَلِلْأُخْتِ مِنْ الْأَبِ وَالْأُمِّ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَلِلْأُمِّ السُّدُسُ سَهْمٌ وَلِلْإِخْوَةِ مِنْ الْأُمِّ الثُّلُثُ سَهْمَانِ وَلِلْأُخْتِ مِنْ الْأَبِ سَهْمٌ تَكْمِلَةُ الثُّلُثَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Hisyam] dari [Muhammad bin Sirin] dari [Syuraih] dalam masalah seorang isteri yang meninggalkan suami, ibu, saudara perempuan seayah dan seibu, saudara perempuan seayah dan saudara perempuannya seibu. Ia menjadikannya dari enam (asal masalahnya enam) kemudian menambahnya menjadi sepuluh (asal masalahnya menjadi sepuluh). Suami mendapat setengah, yaitu tiga bagian. Saudara perempuan seayah dan seibu mendapat setengah, yaitu tiga bagian. Ibu mendapat seperenam, yaikni tiga bagian. Para saudara laki-laki seibu mendapat sepertiga, yakni dua bagian. Saudara perempuan seayah satu bagian sebagai penyempurna dua pertiga."
            },
            {
                "number": 2413,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ أَشْعَثَ عَنْ الشَّعْبِيِّ أَنَّ عَلِيًّا وَزَيْدًا كَانَا لَا يَحْجُبَانِ بِالْكُفَّارِ وَلَا بِالْمَمْلُوكِينَ وَلَا يُوَرِّثَانِهِمْ شَيْئًا وَكَانَ عَبْدُ اللَّهِ يَحْجُبُ بِالْكُفَّارِ وَبِالْمَمْلُوكِينَ وَلَا يُوَرِّثُهُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Uyainah] dari [Ali bin Mushir] dari [Asy'ats] dari [Asy Sya'bi] bahwa [Ali] dan [Zaid] keduanya tidak menjadikan orang-orang kafir dan para budak sebagai hijab (penghalang) bagi ahli waris lainnya dan keduanya tidak masuk dalam kelompok ahli waris. Sementara [Abdullah] menjadikan orang-orang kafir dan para budak sebagai hijab namun tidak memasukkan mereka dalam kelompok ahli waris."
            },
            {
                "number": 2414,
                "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ أَنَّ عَلِيًّا وَزَيْدًا قَالَا الْمَمْلُوكُونَ وَأَهْلُ الْكِتَابِ لَا يَحْجُبُونَ وَلَا يَرِثُونَ وَقَالَ عَبْدُ اللَّهِ يَحْجُبُونَ وَلَا يَرِثُونَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibrahim] bahwa [Ali] dan [Zaid] berkata; Para budak dan ahlu kitab tidak menghalangi dan tidak dapat menjadi ahli waris. Sedangkan [Abdullah] berkata; Mereka dapat menghalangi, namun tidak dapat menjadi ahli waris."
            },
            {
                "number": 2415,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَحْيَى عَنْ سَعِيدٍ أَنَّ عُمَرَ كَانَ كَتَبَ مِيرَاثَ الْجَدِّ حَتَّى إِذَا طُعِنَ دَعَا بِهِ فَمَحَاهُ ثُمَّ قَالَ سَتَرَوْنَ رَأْيَكُمْ فِيهِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] Telah mengabarkan kepada kami [Yahya] dari [Sa'id] bahwa [Umar] pernah menulis bagian warisan untuk kakek hingga ketika setelah ditikam, ia meminta tulisannya tersebut dan menghapusnya. Kemudian ia berkata; Kalian dapat berpendapat dengan pendapat kalian tentang bagian ini."
            },
            {
                "number": 2416,
                "arab": " أَخْبَرَنَا يَزِيدُ أَخْبَرَنَا أَشْعَثُ عَنْ ابْنِ سِيرِينَ قَالَ قُلْتُ لِعَبِيدَةَ حَدِّثْنِي عَنْ الْجَدِّ فَقَالَ إِنِّي لَأَحْفَظُ فِي الْجَدِّ ثَمَانِينَ قَضِيَّةً مُخْتَلِفَةً",
                "id": "Telah mengabarkan kepada kami [Yazid] telah mengabarkan kepada kami [Asy'ats] dari [Ibnu Sirin] ia berkata; Aku berkata kepada [Abidah]; Ceritakanlah kepadaku tentang bagian kakek. Lalu ia berkata; Sesungguhnya aku hafal delapan puluh masalah yang berbeda tentang bagian warisan kakek."
            },
            {
                "number": 2417,
                "arab": " أَخْبَرَنَا أَبُو غَسَّانَ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ عُبَيْدِ بْنِ عَمْرٍو الْخَارِفِيِّ عَنْ عَلِيٍّ قَالَ أَتَاهُ رَجُلٌ فَسَأَلَهُ عَنْ فَرِيضَةٍ فَقَالَ إِنْ لَمْ يَكُنْ فِيهَا جَدٌّ فَهَاتِهَا",
                "id": "Telah mengabarkan kepada kami [Abu Ghassan] telah menceritakan kepada kami [Isra`il] dari [Abu Ishaq] dari [Ubaid bin Amr Al Kharifi] dari [Ali] ia berkata; Seseorang datang kepadanya lalu bertanya tentang pembagian harta warisan. Maka ia menjawab; Jika di dalam ahli waris tidak ada kakek, maka bagikanlah."
            },
            {
                "number": 2418,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ عُبَيْدِ بْنِ عَمْرٍو قَالَ جَاءَ رَجُلٌ إِلَى عَلِيٍّ فَسَأَلَهُ عَنْ فَرِيضَةٍ فَقَالَ إِنْ لَمْ يَكُنْ فِيهَا جَدٌّ فَهَاتِهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Ubaid bin Amr] ia berkata; Seseorang datang kepada [Ali] menanyakannya tentang pembagian harta warisan. Maka ia menjawab; Jika di dalam ahli waris tidak ada kakek maka bagikanlah."
            },
            {
                "number": 2419,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ السَّخْتِيَانِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ رَجُلٍ مِنْ مُرَادٍ سَمِعَ عَلِيًّا يَقُولُ مَنْ سَرَّهُ أَنْ يَتَقَحَّمَ جَرَاثِيمَ جَهَنَّمَ فَلْيَقْضِ بَيْنَ الْجَدِّ وَالْإِخْوَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Ayyub As Sakhtiyani] dari [Sa'id bin Jubair] dari [seorang laki-laki dari Murad] ia mendengar [Ali] berkata; Barangsiapa yang senang menceburkan diri ke dasar neraka Jahannam, maka silahkan memutuskan masalah warisan antara kakek dan para saudara laki-laki."
            },
            {
                "number": 2420,
                "arab": " أَخْبَرَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا خَالِدٌ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ح وَعَنْ عِكْرِمَةَ أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ جَعَلَ الْجَدَّ أَبًا",
                "id": "Telah mengabarkan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Khalid] dari [Abu Nadlrah] dari [Abu Sa'id Al Khudri], dalam riwayat lain dari [Ikrimah] bahwa [Abu Bakr Ash Shiddiq] menjadikan kakek pada posisi ayah dalam warisan."
            },
            {
                "number": 2421,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ سُلَيْمَانَ الشَّيْبَانِيِّ عَنْ كُرْدُوسٍ عَنْ أَبِي مُوسَى عَنْ أَبِي بَكْرٍ الصِّدِّيقِ أَنَّهُ جَعَلَ الْجَدَّ أَبًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Sulaiman Asy Syaibani] dari [Kurdus] dari [Abu Musa] dari [Abu Bakr Ash Shiddiq] bahwa ia menjadikan kakek pada posisi ayah dalam warisan."
            },
            {
                "number": 2422,
                "arab": " حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ عَنْ الشَّيْبَانِيِّ عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى عَنْ كُرْدُوسٍ عَنْ أَبِي مُوسَى أَنَّ أَبَا بَكْرٍ جَعَلَ الْجَدَّ أَبًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] dari [Asy Syaibani] dari [Abu Burdah bin Abu Musa] dari [Kurdus] dari [Abu Musa] bahwa [Abu Bakr] menjadikan kakek pada posisi ayah dalam warisan."
            },
            {
                "number": 2423,
                "arab": " أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي بُرْدَةَ عَنْ مَرْوَانَ عَنْ عُثْمَانَ أَنَّ أَبَا بَكْرٍ كَانَ يَجْعَلُ الْجَدَّ أَبًا",
                "id": "Telah mengabarkan kepada kami [Al Aswad bin Amir] telah menceritakan kepada kami [Syu'bah] dari [Amr bin Murrah] dari [Abu Burdah] dari [Marwan] dari [Utsman] bahwa [Abu Bakr] menjadikan kakek pada posisi ayah dalam warisan."
            },
            {
                "number": 2424,
                "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى وَمُحَمَّدُ بْنُ يُوسُفَ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي بُرْدَةَ قَالَ لَقِيتُ مَرْوَانَ بْنَ الْحَكَمِ بِالْمَدِينَةِ فَقَالَ يَا ابْنَ أَبِي مُوسَى أَلَمْ أُخْبَرْ أَنَّ الْجَدَّ لَا يُنَزَّلُ فِيكُمْ مَنْزِلَةَ الْأَبِ وَأَنْتَ لَا تُنْكِرُ قَالَ قُلْتُ وَلَوْ كُنْتَ أَنْتَ لَمْ تُنْكِرْ قَالَ مَرْوَانُ فَأَنَا أَشْهَدُ عَلَى عُثْمَانَ بْنِ عَفَّانَ أَنَّهُ شَهِدَ عَلَى أَبِي بَكْرٍ أَنَّهُ جَعَلَ الْجَدَّ أَبًا إِذَا لَمْ يَكُنْ دُونَهُ أَبٌ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Musa] dan [Muhammad bin Yusuf] dari [Isra`il] dari [Abu Ishaq] dari [Abu Burdah] ia berkata; Aku bertemu Marwan bin Al Hakam di Madinah, lalu ia berkata kepadaku; Wahai Ibnu Abu Musa, bukankah telah diberitahukan bahwa menurut kalian, kakek tidak menempati pada posisi ayah dan kamu tidak mengingkarinya? Ia mengatakan; Aku menjawab; Meskipun dulunya engkau tidak akan mengingkari? [Marwan] berkata; Sebab aku menyaksikan bahwasanya [Utsman bin 'Affan] pernah menyaksikan [Abu Bakar] menempatkan kakek pada posisi ayah dalam warisan, jika mayit tidak memiliki ayah."
            },
            {
                "number": 2425,
                "arab": " حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ أَخْبَرَنَا شُعْبَةُ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي نَضْرَةَ وَعَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ أَبَا بَكْرٍ كَانَ يَجْعَلُ الْجَدَّ أَبًا",
                "id": "Telah menceritakan kepada kami [Al Aswad bin Amir] Telah mengabarkan kepada kami [Syu'bah] dari [Khalid Al Hadza`] dari [Abu An Nadlr] dan dari [Ikrimah] dari [Ibnu Abbas] bahwa [Abu Bakr] menjadikan kakek pada posisi ayah dalam warisan."
            },
            {
                "number": 2426,
                "arab": " حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ جَعَلَهُ الَّذِي قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ كُنْتُ مُتَّخِذًا أَحَدًا خَلِيلًا لَاتَّخَذْتُهُ خَلِيلًا وَلَكِنْ أُخُوَّةُ الْإِسْلَامِ أَفْضَلُ يَعْنِي أَبَا بَكْرٍ جَعَلَهُ أَبًا يَعْنِي الْجَدَّ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ayyub] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; [Orang] yang menyebabkan Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seandainya aku boleh menjadikan seseorang sebagai kekasih maka tentu aku akan menjadikannya (Abu Bakar) sebagai kekasih. Tetapi persaudaraan dalam Islam lebih baik.\" Yakni Abu Bakar, ia menjadikannya pada posisi ayah yakni kakek."
            },
            {
                "number": 2427,
                "arab": " حَدَّثَنَا مُسْلِمٌ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ ابْنِ الزُّبَيْرِ أَنَّ أَبَا بَكْرٍ جَعَلَ الْجَدَّ أَبًا",
                "id": "Telah menceritakan kepada kami [Muslim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ayyub] dari [Ibnu Abu Mulaikah] dari [Ibnu Az Zubair] bahwa [Abu Bakr] menjadikan kakek pada posisi ayah dalam warisan."
            },
            {
                "number": 2428,
                "arab": " حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْأَشْعَثُ عَنْ الْحَسَنِ قَالَ إِنَّ الْجَدَّ قَدْ مَضَتْ سُنَّتُهُ وَإِنَّ أَبَا بَكْرٍ جَعَلَ الْجَدَّ أَبًا وَلَكِنَّ النَّاسَ تَحَيَّرُوا",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Al Asy'ats] dari [Al Hasan] ia berkata; Sesungguhnya kakek telah ditetapkan dalam sunnah dan sesungguhnya [Abu Bakr] telah menjadikan kakek pada posisi ayah, tetapi manusia menjadi bingung."
            },
            {
                "number": 2429,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ عَاصِمٍ عَنْ الشَّعْبِيِّ قَالَ إِنَّ أَوَّلَ جَدٍّ وَرِثَ فِي الْإِسْلَامِ عُمَرُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Uyainah] dari [Ali bin Mushir] dari ['Ashim] dari [Asy Sya'bi] ia berkata; Sesungguhnya (posisi seorang) kakek yang pertama kali memperoleh warisan di dalam Islam adalah [Umar]."
            },
            {
                "number": 2430,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ عَاصِمٍ عَنْ الشَّعْبِيِّ قَالَ أَوَّلُ جَدٍّ وَرِثَ فِي الْإِسْلَامِ عُمَرُ فَأَخَذَ مَالَهُ فَأَتَاهُ عَلِيٌّ وَزَيْدٌ فَقَالَا لَيْسَ لَكَ ذَاكَ إِنَّمَا أَنْتَ كَأَحَدِ الْأَخَوَيْنِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari ['Ashim] dari [Asy Sya'bi] ia berkata; (Posisi seorang) kakek yang pertama memperoleh warisan di dalam Islam adalah Umar. Setelah mengambil bagiannya, [Ali] dan] Zaid] datang menemuinya, lalu keduanya berkata; Engkau tidak boleh melakukan hal itu, sesungguhnya posisimu seperti salah seorang dari dua saudara laki-laki."
            },
            {
                "number": 2431,
                "arab": " حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ عِيسَى الْحَنَّاطِ عَنْ الشَّعْبِيِّ قَالَ كَانَ عُمَرُ يُقَاسِمُ بِالْجَدِّ مَعَ الْأَخِ وَالْأَخَوَيْنِ فَإِذَا زَادُوا أَعْطَاهُ الثُّلُثَ وَكَانَ يُعْطِيهِ مَعَ الْوَلَدِ السُّدُسَ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Musa] dari [Isa Al Hannath] dari [Asy Sya'bi] ia berkata; [Umar] membagi harta warisan kepada kakek bersama satu saudara laki-laki dan dua saudara laki-laki. Jika lebih dari dua orang bersaudara, Umar memberi kakek sepertiga. Umar juga memberi seperenam kepada kakek ketika bersama anak."
            },
            {
                "number": 2432,
                "arab": " حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ مَرْوَانَ بْنِ الْحَكَمِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ لَمَّا طُعِنَ اسْتَشَارَهُمْ فِي الْجَدِّ فَقَالَ إِنِّي كُنْتُ رَأَيْتُ فِي الْجَدِّ رَأْيًا فَإِنْ رَأَيْتُمْ أَنْ تَتَّبِعُوهُ فَاتَّبِعُوهُ فَقَالَ لَهُ عُثْمَانُ إِنْ نَتَّبِعْ رَأْيَكَ فَإِنَّهُ رَشَدٌ وَإِنْ نَتَّبِعْ رَأْيَ الشَّيْخِ فَلَنِعْمَ ذُو الرَّأْيِ كَانَ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Hisyam bin Urwah] dari [ayahnya] dari [Marwan bin Al Hakam] bahwa [Umar bin Al Khaththab] ketika tertikam, ia bermusyawarah dengan mereka tentang bagian kakek. Ia berkata; Sesungguhnya aku memiliki pendapat tentang bagian kakek. Jika kalian setuju untuk mengikutinya maka ikutilah pendapatku itu. [Utsman] berkata kepadanya; Jika kami mengikuti pendapatmu, maka sesungguhnya pendapatmu itu benar, namun jika kami mengikuti pendapat asy syaikh (orang yang lebih tua dan faham tentang agamanya), maka ia memang sebaik-baik orang yang memiliki pendapat."
            },
            {
                "number": 2433,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ عُيَيْنَةَ عَنْ عَلِيِّ بْنِ مُسْهِرٍ عَنْ الشَّيْبَانِيِّ عَنْ الشَّعْبِيِّ قَالَ كَتَبَ ابْنُ عَبَّاسٍ إِلَى عَلِيٍّ وَابْنُ عَبَّاسٍ بِالْبَصْرَةِ إِنِّي أُتِيتُ بِجَدٍّ وَسِتَّةِ إِخْوَةٍ فَكَتَبَ إِلَيْهِ عَلِيٌّ أَنْ أَعْطِ الْجَدَّ سُبُعًا وَلَا تُعْطِهِ أَحَدًا بَعْدَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Uyainah] dari [Ali bin Mushir] dari [Asy Syaibani] dari [Asy Sya'bi] ia berkata; Ibnu Abbas menulis surat kepada Ali, saat itu Ibnu Abbas berada di Bashrah; Sesungguhnya aku telah dihadapkan dengan masalah bagian kakek dan enam saudara laki-laki. Maka [Ali] berkata; Berikan kepada kakek seperenam dan jangan engkau berikan seperenam kepada siapa pun setelahnya."
            },
            {
                "number": 2434,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ إِسْمَعِيلَ عَنْ الشَّعْبِيِّ فِي سِتَّةِ إِخْوَةٍ وَجَدٍّ قَالَ أَعْطِ الْجَدَّ السُّدُسَ قَالَ أَبُو مُحَمَّد كَأَنَّهُ يَعْنِي عَلِيًّا الشَّعْبِيُّ يَرْوِيهِ عَنْ عَلِيٍّ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [Isma'il] dari [Asy Sya'bi] tentang masalah enam saudara laki-laki dan kakek, ia berkata; Berikan seperenam kepada kakek. Abu Muhammad berkata; Sepertinya Asy Sya'bi meriwayatkan langsung dari Ali."
            },
            {
                "number": 2435,
                "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ سَلَمَةَ أَنَّ عَلِيًّا كَانَ يَجْعَلُ الْجَدَّ أَخًا حَتَّى يَكُونَ سَادِسًا",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Syu'bah] dari [Amr bin Murrah] dari [Abdullah bin Salamah] bahwa [Ali] menjadikan kakek pada posisi saudara laki-laki dalam warisan selama jumlah saudara enam orang. "
            },
            {
                "number": 2436,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا يُونُسُ عَنْ الْحَسَنِ أَنَّ عَلِيًّا كَانَ يُشَرِّكُ الْجَدَّ مَعَ الْإِخْوَةِ إِلَى السُّدُسِ",
                "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Yunus] dari [Al Hasan] bahwa [Ali] memberikan pembagian warisan secara musyarrakah dalam masalah kakek ketika bersama para saudara laki-laki sebanyak seperenam."
            },
            {
                "number": 2437,
                "arab": " حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ سَلَمَةَ قَالَ كَانَ عَلِيٌّ يُشَرِّكُ بَيْنَ الْجَدِّ وَالْإِخْوَةِ حَتَّى يَكُونَ سَادِسًا",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Syu'bah] dari [Amr bin Murrah] dari [Abdullah bin Salamah] ia berkata; [Ali] membagi harta secara musyarrakah antara kakek dan para saudara laki-laki, sampai berjumlah enam orang."
            },
            {
                "number": 2438,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ قَالَ كَانَ عَلِيٌّ يُشَرِّكُ الْجَدَّ إِلَى سِتَّةٍ مَعَ الْإِخْوَةِ يُعْطِي كُلَّ صَاحِبِ فَرِيضَةٍ فَرِيضَتَهُ وَلَا يُوَرِّثُ أَخًا لِأُمٍّ مَعَ جَدٍّ وَلَا أُخْتًا لِأُمٍّ وَلَا يَزِيدُ الْجَدَّ مَعَ الْوَلَدِ عَلَى السُّدُسِ إِلَّا أَنْ يَكُونَ غَيْرُهُ وَلَا يُقَاسِمُ بِأَخٍ لِأَبٍ مَعَ أَخٍ لِأَبٍ وَأُمٍّ وَإِذَا كَانَتْ أُخْتٌ لِأَبٍ وَأُمٍّ وَأَخٌ لِأَبٍ أَعْطَى الْأُخْتَ النِّصْفَ وَالنِّصْفَ الْآخَرَ بَيْنَ الْجَدِّ وَالْأَخِ نِصْفَيْنِ وَإِذَا كَانُوا إِخْوَةً وَأَخَوَاتٍ شَرَّكَهُمْ مَعَ الْجَدِّ إِلَى السُّدُسِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim] ia berkata; [Ali] pernah membagi harta secara musyarrakah pada kakek ketika bersama enam saudara laki-laki. Setiap orang yang memiliki bagian yang telah ditetapkan mendapatkan bagiannya, namun saudara laki-laki seibu tidak dapat mewarisi bersama kakek, begitu juga saudara perempuan seibu. Ali tidak memberikan bagian kakek bersama anak lebih dari seperenam kecuali jika bersama yang lainnya. Ia tidak memberi bagian untuk kakek dengan saudara laki-laki seayah bersama saudara laki-laki seayah dan seibu. Jika saudara perempuan seayah dan seibu dan saudara laki-laki seayah, ia memberikan saudara perempuan setengah dan setengah lainnya dibagikan kepada kakek dan saudara laki-laki dengan pembagian masing-masing mendapat setengah. Jika mereka beberapa saudara laki-laki dan beberapa saudara perempuan maka ia menggabungkan mereka bersama kakek dalam bagian seperenam."
            },
            {
                "number": 2439,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ عَنْ الْعَبْسِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَعْقِلٍ قَالَ سُئِلَ ابْنُ عَبَّاسٍ عَنْ الْجَدِّ فَقَالَ أَيُّ أَبٍ لَكَ أَكْبَرُ فَقُلْتُ أَنَا آدَمُ قَالَ أَلَمْ تَسْمَعْ إِلَى قَوْلِ اللَّهِ تَعَالَى { يَا بَنِي آدَمَ }",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Sufyan] dari [Al 'Absi] dari [Abdurrahman bin Ma'qil] ia berkata; [Ibnu Abbas] pernah ditanya tentang kakek, lalu ia menjawab; Ayah mana yang lebih tua menurutmu? Aku menjawab; Adam. Ia bertanya lagi; Tidakkah engkau mendengar firman Allah: (Hai bani Adam)."
            },
            {
                "number": 2440,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَعِيلَ بْنِ سُمَيْعٍ عَنْ رَجُلٍ عَنْ ابْنِ عَبَّاسٍ قَالَ لَوَدِدْتُ أَنِّي وَالَّذِينَ يُخَالِفُونِي فِي الْجَدِّ تَلَاعَنَّا أَيُّنَا أَسْوَأُ قَوْلًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Isma'il bin Sumai'] dari [seseorang] dari [Ibnu Abbas] ia berkata; Aku berharap bahwa aku dan orang-orang yang menyelisiku dalam masalah kakek melakukan li'an, untuk mengetahui perkataan siapa yang paling buruk."
            },
            {
                "number": 2441,
                "arab": " حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا ابْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ جَعَلَ الْجَدَّ أَبًا",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ibnu Thawus] dari [ayahnya] dari [Ibnu Abbas] bahwa ia menjadikan kakek pada posisi ayah dalam warisan."
            },
            {
                "number": 2442,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ قَالَ دَخَلْتُ عَلَى شُرَيْحٍ وَعِنْدَهُ عَامِرٌ وَإِبْرَاهِيمُ وَعَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ فِي فَرِيضَةِ امْرَأَةٍ مِنَّا الْعَالِيَةِ تَرَكَتْ زَوْجَهَا وَأُمَّهَا وَأَخَاهَا لِأَبِيهَا وَجَدَّهَا فَقَالَ لِي هَلْ مِنْ أُخْتٍ قُلْتُ لَا قَالَ هَلْ مِنْ أُخْتٍ قُلْتُ لَا قَالَ لِلْبَعْلِ الشَّطْرُ وَلِلْأُمِّ الثُّلُثُ قَالَ فَجَهِدْتُ عَلَى أَنْ يُجِيبَنِي فَلَمْ يُجِبْنِي إِلَّا بِذَلِكَ فَقَالَ إِبْرَاهِيمُ وَعَامِرٌ وَعَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ مَا جَاءَ أَحَدٌ بِفَرِيضَةٍ أَعْضَلَ مِنْ فَرِيضَةٍ جِئْتَ بِهَا قَالَ فَأَتَيْتُ عَبِيدَةَ السَّلْمَانِيَّ وَكَانَ يُقَالُ لَيْسَ بِالْكُوفَةِ أَحَدٌ أَعْلَمَ بِفَرِيضَةٍ مِنْ عَبِيدَةَ وَالْحَارِثِ الْأَعْوَرِ وَكَانَ عَبِيدَةُ يَجْلِسُ فِي الْمَسْجِدِ فَإِذَا وَرَدَتْ عَلَى شُرَيْحٍ فَرِيضَةٌ فِيهَا جَدٌّ رَفَعَهُمْ إِلَى عَبِيدَةَ فَفَرَضَ فَسَأَلْتُهُ فَقَالَ إِنْ شِئْتُمْ نَبَّأْتُكُمْ بِفَرِيضَةِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ فِي هَذَا جَعَلَ لِلزَّوْجِ ثَلَاثَةَ أَسْهُمٍ النِّصْفَ وَلِلْأُمِّ ثُلُثُ مَا بَقِيَ السُّدُسُ مِنْ رَأْسِ الْمَالِ وَلِلْأَخِ سَهْمٌ وَلِلْجَدِّ سَهْمٌ قَالَ أَبُو إِسْحَقَ الْجَدُّ أَبُو الْأَبِ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zuhair] dari [Abu Ishaq] ia berkata; Aku pernah menemui Syuraih, saat itu sedang bersama Amir, Ibrahim dan Abdurrahman bin Abdulah untuk menanyakan masalah bagian (warisan) seorang perempuan yang meninggalkan seorang suami, ibu, saudara laki-laki seayah dan kakeknya. Maka ia bertanya kepadaku; Adakah suadara perempuan? Aku menjawab; Tidak ada. Ia Syuraih berkata; Suami mendapat setengah dan ibu mendapat sepertiga. Ia melanjutkan; Aku terus mendesaknya agar ia menjawab selain jawaban itu, namun ia tidak menjawab selain itu. Maka Ibrahim, Amir dan Abdurrahman bin Abdullah berkata; Tidak ada seorang pun yang datang membawa masalah faraidl yang lebih rumit dari pada masalah faraidl yang engkau bawa. Lalu aku menemui [Abidah As Salmani], ada yang mengatakan bahwa di Kufah tidak ada seorang pun yang lebih mengetahui tentang faraidl dari pada Abidah dan Al Harits Al A'war. Ketika itu Abidah sedang duduk di dalam masjid. Jika ada masalah faraidl yang sulit dipecahkan oleh Syuraih, ia menyuruh mereka kepada Abidah dan ia pun dapat memecahkannya. Aku bertanya kepadanya lalu ia pun menjawab; Jika kalian mau, aku dapat memberitahukan kepada kalian pembagian [Abdullah bin Mas'ud] dalam masalah ini. Ia menjadikan suami mendapat tiga bagian yakni setengah, Ibu mendapat sepertiga dari yang tersisa, yakni seperenam dari harta warisan. Saudara laki-laki mendapat satu bagian dan kakek mendapat satu bagian. Abu Ishaq berkata; Kakek adalah ayahnya ayah."
            },
            {
                "number": 2443,
                "arab": " أَخْبَرَنَا أَبُو النُّعْمَانِ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا يُونُسُ عَنْ الْحَسَنِ أَنَّ زَيْدًا كَانَ يُشَرِّكُ الْجَدَّ مَعَ الْإِخْوَةِ إِلَى الثُّلُثِ",
                "id": "Telah mengabarkan kepada kami [Abu An Nu'man] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Yunus] dari [Al Hasan] bahwa [Zaid] melakukan musyarrakah kepada kakek bersama para saudara laki-laki dalam bagian sepertiga."
            },
            {
                "number": 2444,
                "arab": " حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ زَيْدِ بْنِ ثَابِتٍ أَنَّهُ كَانَ يُقَاسِمُ بِالْجَدِّ مَعَ الْإِخْوَةِ إِلَى الثُّلُثِ ثُمَّ لَا يُنْقِصُهُ",
                "id": "Telah menceritakan kepada kami [Umar bin Hafsh bin Ghiyats] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Al A'masy] dari [Ibrahim] dari [Zaid bin Tsabit] bahwa ia memberi bagian sepertiga kepada kakek (yang ada) bersama para saudara laki-laki kemudian ia tidak pernah menguranginya."
            },
            {
                "number": 2445,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ عَنْ عِيسَى بْنِ يُونُسَ عَنْ إِسْمَعِيلَ قَالَ قَالَ عُمَرُ خُذْ مِنْ أَمْرِ الْجَدِّ مَا اجْتَمَعَ النَّاسُ عَلَيْهِ قَالَ أَبُو مُحَمَّد يَعْنِي قَوْلَ زَيْدٍ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Al Mughirah] dari [Isa bin Yunus] dari [Isma'il] ia berkata; [Umar] berkata; Ambillah keputusan (tentang masalah warisan) kakek yang disepakati oleh orang-orang. Abu Muhammad bierkata; Maksudnya pendapat Zaid."
            },
            {
                "number": 2446,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ هَمَّامٍ عَنْ قَتَادَةَ أَنَّ زَيْدَ بْنَ ثَابِتٍ قَالَ فِي أُخْتٍ وَأُمٍّ وَزَوْجٍ وَجَدٍّ قَالَ جَعَلَهَا مِنْ سَبْعٍ وَعِشْرِينَ لِلْأُمِّ سِتَّةٌ وَلِلزَّوْجِ تِسْعَةٌ وَلِلْجَدِّ ثَمَانِيَةٌ وَلِلْأُخْتِ أَرْبَعَةٌ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Amir] dari [Hammam] dari [Qatadah] bahwa [Zaid bin Tsabit] berkata dalam masalah bagian warisan seorang saudara perempuan, ibu, suami dan kakek. Ia melanjutkan; Ia menjadikan dari dua puluh tujuh (asal masalahnya dalam penghitungan dua puluh tujuh), ibu mendapat enam (bagian), suami mendapat sembilan (bagian), kakek mendapat delapan (bagian), dan seorang saudara perempuan mendapatkan empat (bagian)."
            },
            {
                "number": 2447,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا الْأَشْعَثُ عَنْ ابْنِ سِيرِينَ عَنْ ابْنِ مَسْعُودٍ قَالَ إِنَّ أَوَّلَ جَدَّةٍ أُطْعِمَتْ فِي الْإِسْلَامِ سَهْمًا أَمُّ أَبٍ وَابْنُهَا حَيٌّ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Al Asy'ats] dari [Ibnu Sirin] dari [Ibnu Mas'ud] ia berkata; Sesungguhnya (posisi) nenek yang diberi bagian (warisan) dalam Islam adalah ibu dari seorang ayah, sedang anak laki-lakinya masih hidup."
            },
            {
                "number": 2448,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَرِيكٌ عَنْ لَيْثٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَطْعَمَ جَدَّةً سُدُسًا",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Syarik] dari [Laits] dari [Thawus] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam memberi bagian seperenam untuk nenek."
            },
            {
                "number": 2449,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّ عُمَرَ وَرَّثَ جَدَّةً مَعَ ابْنِهَا",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Ibnu Juraij] dari [Ibrahim bin Maisarah] dari [Sa'id bin Al Musayyab] bahwa [Umar] memberi hak waris kepada nenek ketika bersama anak laki-lakinya."
            },
            {
                "number": 2450,
                "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي مَنْصُورُ بْنُ الْمُعْتَمِرِ قَالَ سَمِعْتُ إِبْرَاهِيمَ قَالَ أَطْعَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَ جَدَّاتٍ سُدُسًا قَالَ قُلْتُ لِإِبْرَاهِيمَ مَنْ هُنَّهْ قَالَ جَدَّتَاكَ مِنْ قِبَلِ أَبِيكَ وَجَدَّتُكَ مِنْ قِبَلِ أُمِّكَ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepadaku [Manshur bin Al Mu'tamir] ia berkata; Aku pernah mendengar [Ibrahim] berkata; Rasulullah shallallahu 'alaihi wasallam memberi bagian seperenam untuk tiga nenek. Ia berkata; Aku bertanya kepada Ibrahim; Siapa mereka. Ia menjawab; Ia adalah dua nenek dari pihak ayahmu dan satu nenek dari pihak ibumu."
            },
            {
                "number": 2451,
                "arab": " حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنِي الْحَسَنُ قَالَ تَرِثُ الْجَدَّةُ وَابْنُهَا حَيٌّ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Yazid bin Ibrahim] ia berkata; Telah memberitakan kepadaku [Al Hasan] ia berkata; Nenek berhak mendapat warisan bila anak laki-lakinya masih hidup."
            },
            {
                "number": 2452,
                "arab": " حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ قَالَ لَا تَرِثُ أُمُّ أَبِ الْأُمِّ ابْنُهَا الَّذِي تُدْلِي بِهِ لَا يَرِثُ فَكَيْفَ تَرِثُ هِيَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Salamah] dari [Dawud] dari [Asy Sya'bi] ia berkata; Ibu dari ayahnya ibu tidak dapat hak waris. Anaknya yang menjadikan ibu dari ayahnya ibu memiliki hubungan dengan mayit tidak dapat hak waris, bagaimana dengannya (apakah menerima warisan)? "
            },
            {
                "number": 2453,
                "arab": "أَخْبَرَنَا أَبُو مَعْمَرٍ عَنْ إِسْمَعِيلَ ابْنِ عُلَيَّةَ عَنْ سَلَمَةَ بْنِ عَلْقَمَةَ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ أَبِي الدَّهْمَاءِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ تَرِثُ الْجَدَّةُ وَابْنُهَا حَيٌّ",
                "id": "Telah mengabarkan kepada kami [Abu Ma'mar] dari [Isma'il bin 'Ulaiyah] dari [Salamah bin 'Alqamah] dari [Humaid bin Hilal] dari [Abu Ad Dahma`] dari [Imran bin Hushain] ia berkata; Nenek berhak mendapat warisan bila anaknya masih hidup."
            },
            {
                "number": 2454,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْأَشْعَثُ عَنْ الزُّهْرِيِّ قَالَ جَاءَتْ إِلَى أَبِي بَكْرٍ جَدَّةٌ أُمُّ أَبٍ أَوْ أُمُّ أُمٍّ فَقَالَتْ إِنَّ ابْنَ ابْنِي أَوْ ابْنَ ابْنَتِي تُوُفِّيَ وَبَلَغَنِي أَنَّ لِي نَصِيبًا فَمَا لِي فَقَالَ أَبُو بَكْرٍ مَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيهَا شَيْئًا وَسَأَسْأَلُ النَّاسَ فَلَمَّا صَلَّى الظُّهْرَ قَالَ أَيُّكُمْ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْجَدَّةِ شَيْئًا فَقَالَ الْمُغِيرَةُ بْنُ شُعْبَةَ أَنَا قَالَ مَاذَا قَالَ أَعْطَاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُدُسًا قَالَ أَيَعْلَمُ ذَاكَ أَحَدٌ غَيْرُكَ فَقَالَ مُحَمَّدُ بْنُ مَسْلَمَةَ صَدَقَ فَأَعْطَاهَا أَبُو بَكْرٍ السُّدُسَ فَجَاءَتْ إِلَى عُمَرَ مِثْلُهَا فَقَالَ مَا أَدْرِي مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا شَيْئًا وَسَأَسْأَلُ النَّاسَ فَحَدَّثُوهُ بِحَدِيثِ الْمُغِيرَةِ بْنِ شُعْبَةَ وَمُحَمَّدِ بْنِ مَسْلَمَةَ فَقَالَ عُمَرُ أَيُّكُمَا خَلَتْ بِهِ فَلَهَا السُّدُسُ فَإِنْ اجْتَمَعْتُمَا فَهُوَ بَيْنَكُمَا",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Al Asy'ats] dari [Az Zuhri] ia berkata; Seorang nenek dari ibunya ayah atau ibunya ibu datang menemui Abu Bakr dan berkata; Sesungguhnya anak laki-laki dari anak laki-lakiku atau anak laki-laki dari anak perempuanku telah meninggal dan telah sampai kepadaku bahwa aku mendapatkan bagian harta warisannya, maka berapakah bagianku? Abu Bakr berkata; Aku belum pernah mendengar Rasulullah shallallahu 'alaihi wasallam memberikan kepada seorang nenek sedikitpun, aku akan bertanya kepada orang lain! Setelah dia selesai melaksanakan sholat dzuhur, dia bertanya: siapakah di antara kalian yang mendengar Rasulullah shallallahu 'alaihi wasallam telah memberikan seorang nenek dari bagian harta warisan? [Maka Al Mughirah bin Syu'bah] berkata: Saya! Dia berkata: Berapa? Al Mughirah menjawab: Rasulullah shallallahu 'alaihi wasallam memberikannya seperenam. Dia bertanya lagi: adakah orang lain selain kamu yang mengetahuinya? Maka [Muhammad bin Maslamah] berkata: Iya, dia benar! Maka Abu Bakar memberikan nenek tersebut seperenam. Kemudian datang kepada Umar seperti yang datang kepada Abu Bakar, lalu Umar berkata: aku tidak mengetahui dan tidak pernah mendengar bahwa Rasulullah shallallahu 'alaihi wasallam memberikan seorang nenek-nenek dari harta warisan, tapi aku akan bertanya kepada orang-orang! Maka mereka memberitahukan kepadanya tentang hadits Al Mughirah bin Syu'bah dan Muhammad bin Maslamah. Maka Umar berkata: siapa yang di antara kalian berdua yang (keberadaannya) sendiri ketika pembagian warisan, maka seperenam itu untuknya, dan apabila berdua maka seperenam untuk kalian berdua."
            },
            {
                "number": 2455,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا الْأَشْعَثُ عَنْ الشَّعْبِيِّ عَنْ عَلِيٍّ وَزَيْدٍ قَالَا إِذَا كَانَتْ الْجَدَّاتُ سَوَاءً وَرِثَ ثَلَاثُ جَدَّاتٍ جَدَّتَا أَبِيهِ أُمُّ أُمِّهِ وَأُمُّ أَبِيهِ وَجَدَّةُ أُمِّهِ فَإِنْ كَانَتْ إِحَدَاهُنَّ أَقْرَبَ فَالسَّهْمُ لِذَوِي الْقُرْبَى",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Asy'ats] dari [Asy Sya'bi] dari [Ali] dan [Zaid] keduanya berkata; Jika beberapa nenek memiliki kedudukan yang sama maka tiga orang nenek mendapat hak waris. Yaitu dua dari nenek ayah; Ibu dari ibunya ayah dan ibu dari ayahnya ayah dan nenek ibunya. Jika salah seorang dari mereka itu lebih dekat, maka bagian diberikan kepada yang terdekat."
            },
            {
                "number": 2456,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ أَشْعَثَ عَنْ الشَّعْبِيِّ عَنْ عَلِيٍّ وَزَيْدٍ أَنَّهُمَا كَانَا لَا يُوَرِّثَانِ الْجَدَّةَ أُمَّ الْأَبِ مَعَ الْأَبِ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [Asy'ats] dari [Asy Sya'bi] dari [Ali] dan [Zaid] bahwa mereka berdua tidak memberikan hak waris kepada nenek, yakni ibu dari ayah, ketika bersama ayah."
            },
            {
                "number": 2457,
                "arab": " حَدَّثَنَا سَعِيدُ بْنُ الْمُغِيرَةِ عَنْ ابْنِ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ أَنَّ عُثْمَانَ كَانَ لَا يُوَرِّثُ الْجَدَّةَ وَابْنُهَا حَيٌّ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Al Mughirah] dari [Ibnu Al Mubarak] dari [Ma'mar] dari [Az Zuhri] bahwa [Utsman] tidak memberi hak waris kepada nenek jika anaknya masih hidup."
            },
            {
                "number": 2458,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْأَشْعَثُ عَنْ ابْنِ سِيرِينَ عَنْ ابْنِ مَسْعُودٍ قَالَ إِنَّ الْجَدَّاتِ لَيْسَ لَهُنَّ مِيرَاثٌ إِنَّمَا هِيَ طُعْمَةٌ أُطْعِمْنَهَا وَالْجَدَّاتُ أَقْرَبُهُنَّ وَأَبْعَدُهُنَّ سَوَاءٌ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Asy'ats] dari [Ibnu Sirin] dari [Ibnu Mas'ud] ia berkata; Sesungguhnya para nenek tidak memiliki hak waris, namun hanya ibarat makanan yang diberikan kepada mereka. Para nenek yang dekat dan yang jauh adalah sama."
            },
            {
                "number": 2459,
                "arab": " أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ الْمُغِيرَةِ عَنْ إِبْرَاهِيمَ قَالَ قَالَ عَبْدُ اللَّهِ تَرِثُ الْجَدَّةُ وَابْنُهَا حَيٌّ",
                "id": "Telah mengabarkan kepada kami [Hajjaj bin Minhal] telah mengabarkan kepada kami [Abu 'Awanah] dari [Al Mughirah] dari [Ibrahim] ia berkata; [Abdullah] berkata; Nenek mendapat warisan jika anaknya masih hidup."
            },
            {
                "number": 2460,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْأَشْعَثُ عَنْ الشَّعْبِيِّ قَالَ جِئْنَ أَرْبَعُ جَدَّاتٍ يَتَسَاوَقْنَ إِلَى مَسْرُوقٍ فَأَلْقَى أَمَّ أَبِ الْأَبِ وَوَرَّثَ ثَلَاثًا جَدَّتَيْ أَبِيهِ أُمَّ أُمِّهِ وَأُمَّ أَبِيهِ وَجَدَّةَ أُمِّهِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Asy'ats] dari [Asy Sya'bi] ia berkata; Empat orang nenek berjalan sambil berdesak-desakan mendatangi [Masruq]. Maka ia (memutuskan) tidak memberikan hak waris kepada satu nenek (ibu dari ayahnya ayah), namun ia memberi hak waris kepada tiga nenek (yang lain); Dua nenek dari ayahnya, yaitu ibu dari ibunya dan ibu dari ayahnya, dan nenek dari ibunya."
            },
            {
                "number": 2461,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شَرِيكٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ اللَّهِ فِي ابْنَةٍ وَابْنَةِ ابْنٍ قَالَ النِّصْفُ وَالسُّدُسُ وَمَا بَقِيَ فَرَدٌّ عَلَى الْبِنْتِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Syarik] dari [Al A'masy] dari [Ibrahim] dari [Abdullah] tentang anak perempuan dan anak perempuan dari anak perempuan (cucu). Ia berkata; Setengah dan seperenam, sedangkan yang tersisa dikembalikan kepada anak perempuan."
            },
            {
                "number": 2462,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ أَنَّهُ أُتِيَ فِي إِخْوَةٍ لِأُمٍّ وَأُمٍّ فَأَعْطَى الْإِخْوَةَ مِنْ الْأُمِّ الثُّلُثَ وَالْأُمَّ سَائِرَ الْمَالِ وَقَالَ الْأُمُّ عَصَبَةُ مَنْ لَا عَصَبَةَ لَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] bahwa ia pernah ditanya tentang saudara laki-laki seibu dan ibu. Maka ia memberikan bagian saudara laki-laki seibu sepertiga dan ibu mendapat (sisa) seluruh harta warisan. Ia berkata lagi; Ibu adalah ashabah orang yang tidak memiliki ashabah."
            },
            {
                "number": 2463,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ أَبِيهِ قَالَ سَأَلْتُ الشَّعْبِيَّ عَنْ رَجُلٍ مَاتَ وَتَرَكَ ابْنَتَهُ لَا يُعْلَمُ لَهُ وَارِثٌ غَيْرُهَا قَالَ لَهَا الْمَالُ كُلُّهُ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [ayahnya] ia berkata; Aku bertanya kepada [Asy Sya'bi] tentang seorang laki-laki yang meninggal dunia dan meninggalkan anak perempuan. Tidak diketahui ada ahli waris lain selain anak perempuan tersebut. Asy Sya'bi berkata; Seluruh harta tersebut untuknya."
            },
            {
                "number": 2464,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ الشَّعْبِيِّ أَنَّ ابْنَ مَسْعُودٍ كَانَ لَا يَرُدُّ عَلَى أَخٍ لِأُمٍّ مَعَ أُمٍّ وَلَا عَلَى جَدَّةٍ إِذَا كَانَ مَعَهَا غَيْرُهَا مَنْ لَهُ فَرِيضَةٌ وَلَا عَلَى ابْنَةِ ابْنٍ مَعَ ابْنَةِ الصُّلْبِ وَلَا عَلَى امْرَأَةٍ وَزَوْجٍ وَكَانَ عَلِيٌّ يَرُدُّ عَلَى كُلِّ ذِي سَهْمٍ إِلَّا الْمَرْأَةَ وَالزَّوْجَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Muhammad bin Salim] dari [Asy Sya'bi] bahwa [Ibnu Mas'ud] tidak mengembalikan sisa harta warisan kepada saudara laki-laki seibu yang ada bersama-sama dengan ibu, tidak mengembalikannya kepada nenek jika bersama ahli waris lain yang memiliki bagian yang sudah ditetapkan, tidak membagikan kepada anak perempuan dari anak laki-laki jika bersama anak perempuan kandung dan tidak membagikan kepada isteri dan suami. Sedangkan [Ali] mengembalikan harta (sisa harta yang telah dibagikan) kepada seluruh orang yang memiliki bagian kecuali isteri dan suami."
            },
            {
                "number": 2465,
                "arab": " أَخْبَرَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ سَالِمٍ عَنْ خَارِجَةَ بْنِ زَيْدٍ عَنْ زَيْدِ بْنِ ثَابِتٍ أَنَّهُ أُتِيَ فِي ابْنَةٍ أَوْ أُخْتٍ فَأَعْطَاهَا النِّصْفَ وَجَعَلَ مَا بَقِيَ فِي بَيْتِ الْمَالِ و قَالَ يَزِيدُ بْنُ هَارُونَ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ الشَّعْبِيِّ عَنْ خَارِجَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad] telah menceritakan kepada kami [Sufyan] ia berkata; telah mengabarkan kepadaku [Muhammad bin Salim] dari [Kharijah bin Zaid] dari [Zaid bin Tsabit] bahwa ia pernah ditanya tentang anak perempuan atau saudara perempuan. Maka ia memberikan setengah kepadanya dan memasukkan warisan yang tersisa ke dalam Baitul Mal. [Yazid bin Harun] berkata; Dari [Muhammad bin Salim] dari [Asy Sya'bi] dari [Kharijah]."
            },
            {
                "number": 2466,
                "arab": " أَخْبَرَنَا مُعَاذُ بْنُ هَانِئٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ قَالَ سَمِعْتُ رَجُلًا سَأَلَ عَطَاءَ بْنَ أَبِي رَبَاحٍ عَنْ وَلَدِ الْمُتَلَاعِنَيْنِ لِمَنْ مِيرَاثُهُ قَالَ لِأُمِّهِ وَأَهْلِهَا",
                "id": "Telah mengabarkan kepada kami [Mu'adz bin Hani] telah menceritakan kepada kami [Ibrahim bin Thahman] ia berkata; Aku mendengar [seseorang] bertanya kepada ['Atha` bin Abu Rabah] tentang anak dari suami isteri yang melakukan li'an untuk siapa warisannya? Ia menjawab; Untuk ibunya dan keluarga ibu."
            },
            {
                "number": 2467,
                "arab": " أَخْبَرَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ أَبِي سَهْلٍ عَنْ الشَّعْبِيِّ قَالَ قَالَ عَلِيٌّ فِي ابْنِ الْمُلَاعَنَةِ تَرَكَ أَخَاهُ لِأُمِّهِ وَأُمَّهُ لِأَخِيهِ السُّدُسُ وَلِأُمِّهِ الثُّلُثُ ثُمَّ يُرَدُّ عَلَيْهِمْ فَيَصِيرُ لِلْأَخِ الثُّلُثُ وَلِلْأُمِّ الثُّلُثَانِ و قَالَ ابْنُ مَسْعُودٍ لِأَخِيهِ السُّدُسُ وَمَا بَقِيَ فَلِلْأُمِّ",
                "id": "Telah mengabarkan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [Abu Sahl] dari [Asy Sya'bi] ia berkata; [Ali] berkata tentang anak dari seorang wanita yang terkena li'an, ia meninggalkan saudara laki-laki seibu dan ibu. Saudara laki-laki mendapat seperenam dan ibu mendapat sepertiga. Kemudian sisa harta warisan dibagikan lagi kepada mereka berdua (saudara laki-laki seibu dan ibu), maka saudara lai-laki mendapat sepertiga dan ibu mendapat dua pertiga (dari sisa harta warisan yang dibagikan kembali). Dalam riwayat lain [Ibnu Mas'ud] berkata; Saudara laki-laki mendapat seperenam dan warisan yang tersisa untuk ibu."
            },
            {
                "number": 2468,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا سَالِمُ بْنُ نُوحٍ عَنْ عُمَرَ بْنِ عَامِرٍ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ زَيْدِ بْنِ ثَابِتٍ فِي مِيرَاثِ ابْنِ الْمُلَاعَنَةِ لِأُمِّهِ الثُّلُثُ وَالثُّلُثَانِ لِبَيْتِ الْمَالِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Salim bin Nuh] dari [Umar bin Amir] dari [Qatadah] dari [Sa'id bin Al Musayyab] dari [Zaid bin Tsabit] tentang warisan anak laki-laki dari seorang wanita yang terkena li'an; Untuk ibu sepertiga dan dua pertiga untuk Baitul Mal."
            },
            {
                "number": 2469,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا سَالِمُ بْنُ نُوحٍ عَنْ عُمَرَ بْنِ عَامِرٍ عَنْ حَمَّادٍ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ اللَّهِ قَالَ مِيرَاثُهُ لِأُمِّهِ تَعْقِلُ عَنْهُ عَصَبَةُ أُمِّهِ و قَالَ قَتَادَةُ عَنْ الْحَسَنِ لِأُمِّهِ الثُّلُثُ وَبَقِيَّةُ الْمَالِ لِعَصَبَةِ أُمِّهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Salim bin Nuh] dari [Umar bin Amir] dari [Hammad] dari [Ibrahim] dari [Abdullah] ia berkata; Warisannya diberikan untuk ibu, sebab yang membayar diyat adalah ashabah ibunya. Dalam riwayat lain [Qatadah] berkata; dari [Al Hasan]; Untuk ibunya sepertiga dan sisa harta untuk ashabah ibu."
            },
            {
                "number": 2470,
                "arab": " أَخْبَرَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا قَتَادَةُ أَنَّ عَلِيًّا وَابْنَ مَسْعُودٍ قَالَا فِي وَلَدِ مُلَاعَنَةٍ تَرَكَ جَدَّتَهُ وَإِخْوَتَهُ لِأُمِّهِ قَالَ لِلْجَدَّةِ الثُّلُثُ وَلِلْإِخْوَةِ الثُّلُثَانِ و قَالَ زَيْدُ بْنُ ثَابِتٍ لِلْجَدَّةِ السُّدُسُ وَلِلْإِخْوَةِ لِلْأُمِّ الثُّلُثُ وَمَا بَقِيَ فَلِبَيْتِ الْمَالِ",
                "id": "Telah mengabarkan kepada kami [Hajjaj bin Al Minhal] telah menceritakan kepada kami [Hammad bin Salamah] telah mengabarkan kepada kami [Qatadah] bahwa [Ali] dan [Ibnu Mas'ud] keduanya berkata tentang anak dari seorang wanita yang terkena li'an, ia meninggalkan nenek dan beberapa saudara laki-laki seibu; Ia berkata; Untuk nenek sepertiga dan untuk para saudara laki-laki seibu dua pertiga. Dalam riwayat lain [Zaid bin Tsabit] berkata; Nenek mendapatkan seperenam, para saudara laki-laki seibu mendapat sepertiga dan harta warisan yang tersisa untuk Baitul Mal."
            },
            {
                "number": 2471,
                "arab": " أَخْبَرَنَا حَجَّاجٌ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا حَجَّاجٌ أَنَّ النَّخَعِيَّ وَالشَّعْبِيَّ قَالَا تَرِثُهُ أُمُّهُ",
                "id": "Telah mengabarkan kepada kami [Hajjaj] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Hajjaj] bahwa [An Nakha'i] dan [Asy Sya'bi] keduanya berkata; Ibunya berhak mendapat warisannya."
            },
            {
                "number": 2472,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عُمَيْرٍ قَالَ كَتَبْتُ إِلَى أَخٍ لِي مِنْ بَنِي زُرَيْقٍ أَسْأَلُهُ لِمَنْ قَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ابْنِ الْمُلَاعَنَةِ فَكَتَبَ إِلَيَّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِهِ لِأُمِّهِ هِيَ بِمَنْزِلَةِ أُمِّهِ وَأَبِيهِ و قَالَ سُفْيَانُ الْمَالُ كُلُّهُ لِلْأُمِّ هِيَ بِمَنْزِلَةِ أَبِيهِ وَأُمِّهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Daud bin Abu Hind] dari [Abdullah bin Ubaid bin Umair] ia berkata; Aku pernah menulis surat kepada [saudara laki-lakiku] dari banu Zuraiq untuk menanyakan keputusan Nabi shallallahu 'alaihi wasallam dalam masalah anak seorang wanita yang terkena li'an, untuk siapa harta itu? (Maka ia membalas suratku); Sesungguhnya Rasulullah shallallahu 'alaihi wasallam memutuskan warisannya diberikan kepada ibunya, ibu itu menempati posisi ibu dan ayahnya. Sufyan berkata; Seluruh harta untuk ibu karena ia menempati posisi ayah dan ibunya."
            },
            {
                "number": 2473,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ ابْنِ أَبِي لَيْلَى عَنْ عَامِرٍ عَنْ عَلِيٍّ وَعَبْدِ اللَّهِ فِي ابْنِ الْمُلَاعَنَةِ قَالَا عَصَبَتُهُ عَصَبَةُ أُمِّهِ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Musa] dari [Ibnu Abu Laila] dari [Amir] dari [Ali] dan [Abdullah] tentang anak seorang wanita yang terkena li'an, keduanya berkata; Ashabahnya adalah ashabah ibunya."
            },
            {
                "number": 2474,
                "arab": " حَدَّثَنَا أَبُو الْوَلِيدِ الْحَلَبِيُّ مُوسَى بْنُ خَالِدٍ حَدَّثَنَا مُعْتَمِرٌ عَنْ يُونُسَ عَنْ الْحَسَنِ أَنَّهُ كَانَ يَقُولُ مِيرَاثُ وَلَدِ الْمُلَاعَنَةِ لِأُمِّهِ قُلْتُ فَإِنْ كَانَ لَهُ أَخٌ مِنْ أُمِّهِ قَالَ لَهُ السُّدُسُ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Al Halabi Musa bin Khalid] telah menceritakan kepada kami [Mu'tamir] dari [Yunus] dari [Al Hasan] bahwa ia berkata; Warisan anak seorang wanita yang terkena li'an untuk ibunya. Aku bertanya; Jika ia memiliki saudara laki-laki dari ibunya? Ia menjawab; Ia (saudara laki-laki) mendapat seperenam."
            },
            {
                "number": 2475,
                "arab": " حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا الزُّهْرِيُّ قَالَ وَلَدُ الْمُلَاعَنَةِ لِأُمِّهِ تَرِثُ فَرِيضَتَهَا مِنْهُ وَسَائِرُ ذَلِكَ فِي بَيْتِ الْمَالِ",
                "id": "Telah menceritakan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepada kami [Az Zuhri] ia berkata; Harta warisan anak seorang wanita yang melakukan li'an berhak diwarisi ibunya. Ibunya memperoleh warisan sesuai dengan bagian yang telah ditetapkan untuknya, sedangkan sisanya dimasukkan ke dalam Baitul Mal."
            },
            {
                "number": 2476,
                "arab": " أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ إِسْرَائِيلَ عَنْ عَبْدِ الْأَعْلَى أَنَّهُ سَمِعَ مُحَمَّدَ بْنَ عَلِيٍّ يُحَدِّثُ عَنْ عَلِيٍّ فِي الرَّجُلِ يَكُونُ لَهُ مَا لِلرَّجُلِ وَمَا لِلْمَرْأَةِ مِنْ أَيِّهِمَا يُوَرَّثُ فَقَالَ مِنْ أَيِّهِمَا بَالَ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Musa] dari [Isra`il] dari [Abdul A'la] bahwa ia mendengar [Muhammad bin Ali] menceritakan dari [Ali] tentang seorang laki-laki yang memiliki alat kelamin laki-laki dan alat kelamin perempuan, sebagai apa statusnya ia mewarisi (laki-laki atau perempuan)? Ia menjawab; Dilihat dari alat kelaminnya yang mengeluarkan kencing (dari situlah ditetapkan statusnya)."
            },
            {
                "number": 2477,
                "arab": " حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا هُشَيْمٌ عَنْ مُغِيرَةَ عَنْ شِبَاكٍ عَنْ الشَّعْبِيِّ عَنْ عَلِيٍّ فِي الْخُنْثَى قَالَ يُوَرَّثُ مِنْ قِبَلِ مَبَالِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Husyaim] dari [Mughirah] dari [Syibak] dari [Asy Sya'bi] dari [Ali] tentang khuntsa, ia berkata; Ia diberi warisan berdasarkan tempat keluarnya air kencing. "
            },
            {
                "number": 2478,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا أَبُو هَانِئٍ قَالَ سُئِلَ عَامِرٌ عَنْ مَوْلُودٍ وُلِدَ وَلَيْسَ بِذَكَرٍ وَلَا أُنْثَى لَيْسَ لَهُ مَا لِلذَّكَرِ وَلَيْسَ لَهُ مَا لِلْأُنْثَى يُخْرِجُ مِنْ سُرَّتِهِ كَهَيْئَةِ الْبَوْلِ وَالْغَائِطِ سُئِلَ عَنْ مِيرَاثِهِ فَقَالَ نِصْفُ حَظِّ الذَّكَرِ وَنِصْفُ حَظِّ الْأُنْثَى",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Abu Hani`] ia berkata; [Amir] pernah ditanya tentang warisan seorang anak yang melahirkan tanpa alat kelamin laki-laki dan alat kelamin perempuan, sementara dari pusarnya keluar sesuatu seperti air kencing dan kotoran. Maka ia menjawab; (Bagian warisannya adalah) setengah dari bagian laki-laki dan setengah dari bagian perempuan."
            },
            {
                "number": 2479,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا عَاصِمٌ عَنْ الشَّعْبِيِّ قَالَ سُئِلَ أَبُو بَكْرٍ عَنْ الْكَلَالَةِ فَقَالَ إِنِّي سَأَقُولُ فِيهَا بِرَأْيِي فَإِنْ كَانَ صَوَابًا فَمِنْ اللَّهِ وَإِنْ كَانَ خَطَأً فَمِنِّي وَمِنْ الشَّيْطَانِ أُرَاهُ مَا خَلَا الْوَالِدَ وَالْوَلَدَ فَلَمَّا اسْتُخْلِفَ عُمَرُ قَالَ إِنِّي لَأَسْتَحْيِي اللَّهَ أَنْ أَرُدَّ شَيْئًا قَالَهُ أَبُو بَكْرٍ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami ['Ashim] dari [Asy Sya'bi] ia berkata; [Abu Bakr] pernah ditanya tentang Al Kalalah. Maka ia menjawab; Sesungguhnya aku akan menjawab tentangnya berdasarkan pendapatku. Jika benar maka itu dari Allah dan jika salah maka itu dariku dan setan. Menurutku Al Kalalah adalah orang yang tidak memiliki ayah dan anak. Ketika [Umar] menjadi khalifah, ia berkata; Sesungguhnya aku malu kepada Allah jika aku menolak sesuatu yang telah dikatakan Abu Bakr. "
            },
            {
                "number": 2480,
                "arab": " حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا سَعِيدٌ هُوَ ابْنُ أَبِي أَيُّوبَ قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ الْيَزَنِيِّ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ أَنَّهُ قَالَ مَا أَعْضَلَ بِأَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ مَا أَعْضَلَتْ بِهِمْ الْكَلَالَةُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami [Sa'id] ia adalah Ibnu Abu Ayyub, ia berkata; Telah menceritakan kepadaku [Yazid bin Abu Habib] dari [Martsad bin Abdullah Al Yazani] dari [Uqbah bin Amir Al Juhani] bahwa ia berkata; Tidak ada suatu pun yang menyulitkan bagi para sahabat Rasulullah shallallahu 'alaihi wasallam seperti kesulitan mereka dalam masalah Al Kalalah."
            },
            {
                "number": 2481,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ الْحَسَنِ بْنِ مُحَمَّدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ الْكَلَالَةُ مَا خَلَا الْوَالِدَ وَالْوَلَدَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Amr bin Dinar] dari [Al Hasan bin Muhammad] dari [Ibnu Abbas] ia berkata; Al Kalalah adalah orang yang tidak memiliki ayah dan anak."
            },
            {
                "number": 2482,
                "arab": " أَخْبَرَنَا مُحَمَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ الْقَاسِمِ بْنِ عَبْدِ اللَّهِ عَنْ سَعْدٍ أَنَّهُ كَانَ يَقْرَأُ هَذِهِ الْآيَةَ { وَإِنْ كَانَ رَجُلٌ يُورَثُ كَلَالَةً أَوْ امْرَأَةٌ وَلَهُ أَخٌ أَوْ أُخْتٌ } لِأُمٍّ",
                "id": "Telah mengabarkan kepada kami [Muhammad] telah menceritakan kepada kami [Sufyan] dari [Ya'la bin 'Atha`] dari [Al Qasim bin Abdullah] dari [Sa'd] bahwa ia membaca ayat ini: (Jika seseorang mati, baik laki-laki maupun perempuan yang tidak meninggalkan ayah dan tidak meninggalkan anak, tetapi mempunyai seorang saudara laki-laki atau seorang saudara perempuan), yakni seibu."
            },
            {
                "number": 2483,
                "arab": " أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا حَيْوَةُ حَدَّثَنَا أَبُو الْأَسْوَدِ مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ أَنَّ عَاصِمَ بْنَ عُمَرَ بْنِ قَتَادَةَ الْأَنْصَارِيَّ أَخْبَرَهُ أَنَّ عُمَرَ بْنَ الْخَطَّابِ الْتَمَسَ مَنْ يَرِثُ ابْنَ الدَّحْدَاحَةِ فَلَمْ يَجِدْ وَارِثًا فَدَفَعَ مَالَ ابْنِ الدَّحْدَاحَةِ إِلَى أَخْوَالِ ابْنِ الدَّحْدَاحَةِ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami [Haiwah] telah menceritakan kepada kami [Abu Al Aswad Muhammad bin Abdurrahman bin Naufal] bahwa ['Ashim bin Umar bin Qatadah Al Anshari] mengabarkan kepadanya bahwa [Umar bin Al Khaththab] mencari orang yang berhak mewarisi Ibnu Ad Dahdahah, namun ia tidak menemukan satu pun ahli waris. Maka ia menyerahkan harta Ibnu Ad Dahdahah kepada para paman Ibnu Ad Dahdahah dari pihak ibu."
            },
            {
                "number": 2484,
                "arab": " أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَمْرِو بْنِ مُسْلِمٍ عَنْ طَاوُسٍ عَنْ عَائِشَةَ قَالَتْ اللَّهُ وَرَسُولُهُ مَوْلَى مَنْ لَا مَوْلَى لَهُ وَالْخَالُ وَارِثُ مَنْ لَا وَارِثَ لَهُ",
                "id": "Telah mengabarkan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Amru bin Muslim] dari [Thawus] dari [A`isyah] ia berkata; Allah dan RasulNya adalah wali bagi orang yang tidak memiliki wali dan paman dari pihak ibu adalah ahli waris bagi orang yang tidak memiliki ahli waris."
            },
            {
                "number": 2485,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ فِرَاسٍ عَنْ الشَّعْبِيِّ عَنْ زِيَادٍ قَالَ أُتِيَ عُمَرُ فِي عَمٍّ لِأُمٍّ وَخَالَةٍ فَأَعْطَى الْعَمَّ لِلْأُمِّ الثُّلُثَيْنِ وَأَعْطَى الْخَالَةَ الثُّلُثَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Firas] dari [Asy Sya'bi] dari [Ziyad] ia berkata; [Umar] pernah ditanya tentang paman seibu dari pihak ayah dan bibi dari pihak ibu. Maka ia memberikan paman seibu dari pihak ayah dua pertiga dan memberikan bibi dari pihak ibu sepertiga dari harta warisan."
            },
            {
                "number": 2486,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ يُونُسَ عَنْ الْحَسَنِ أَنَّ عُمَرَ بْنَ الْخَطَّابِ أَعْطَى الْخَالَةَ الثُّلُثَ وَالْعَمَّةَ الثُّلُثَيْنِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Yunus] dari [Al Hasan] bahwa [Umar bin Al Khaththab] memberikan bibi dari pihak ibu sepertiga dan bibi dari pihak ayah dua pertiga dari harta warisan."
            },
            {
                "number": 2487,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ الْحَسَنِ بْنِ عَمْرٍو عَنْ غَالِبِ بْنِ عَبَّادٍ عَنْ قَيْسِ بْنِ حَبْتَرٍ النَّهْشَلِيِّ قَالَ أُتِيَ عَبْدُ الْمَلِكِ بْنُ مَرْوَانَ فِي خَالَةٍ وَعَمَّةٍ فَقَامَ شَيْخٌ فَقَالَ شَهِدْتُ عُمَرَ بْنَ الْخَطَّابِ أَعْطَى الْخَالَةَ الثُّلُثَ وَالْعَمَّةَ الثُّلُثَيْنِ قَالَ فَهَمَّ أَنْ يَكْتُبَ بِهِ ثُمَّ قَالَ أَيْنَ زَيْدٌ عَنْ هَذَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Al Hasan bin Amr] dari [Ghalib bin 'Abbad] dari [Qais bin Habtar An Nahsyali] ia berkata; Abdul Malik bin Marwan pernah ditanya tentang bibi dari pihak ibu dan bibi dari pihak ayah. Maka ada seseorang [syaikh] berdiri seraya berkata; Aku menyaksikan [Umar bin Al Khaththab] memberikan bagian kepada bibi dari pihak ibu sepertiga dan bibi dari pihak ayah dua pertiga. Ia berkata lagi; Ia berniat menulis keputusannya ini, namun ia berkata; Bagaimana pendapat Zaid tentang hal ini? "
            },
            {
                "number": 2488,
                "arab": " أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ سَالِمٍ عَنْ الشَّعْبِيِّ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَ الْخَالَةُ بِمَنْزِلَةِ الْأُمِّ وَالْعَمَّةُ بِمَنْزِلَةِ الْأَبِ وَبِنْتُ الْأَخِ بِمَنْزِلَةِ الْأَخِ وَكُلُّ رَحِمٍ بِمَنْزِلَةِ رَحِمِهِ الَّتِي يُدْلِي بِهَا إِذَا لَمْ يَكُنْ وَارِثٌ ذُو قَرَابَةٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Muhammad bin Salim] dari [Asy Sya'bi] dari [Masruq] dari [Abdullah] ia berkata; Kedudukan bibi dari pihak ibu sama dengan kedudukan ibu, bibi dari pihak ayah sama dengan ayah, anak perempuan dari saudara laki-laki sama dengan saudara laki-laki dan seluruh dzawul arham sama dengan dzawul arham lainnya yang ditentukan olehnya, mereka memiliki hubungan dengan mayit jika tidak ada ahli waris yang memiliki hubungan kerabat dekat. "
            },
            {
                "number": 2489,
                "arab": "أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هِشَامٌ عَنْ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ قَالَ حَدَّثَنِي الضَّحَّاكُ بْنُ قَيْسٍ أَنَّ عُمَرَ قَضَى فِي أَهْلِ طَاعُونِ عَمَوَاسَ أَنَّهُمْ كَانُوا إِذَا كَانُوا مِنْ قِبَلِ الْأَبِ سَوَاءً فَبَنُو الْأُمِّ أَحَقُّ وَإِذَا كَانَ بَعْضُهُمْ أَقْرَبَ مِنْ بَعْضٍ بِأَبٍ فَهُمْ أَحَقُّ بِالْمَالِ",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Hisyam] dari [Muhammad] dari [Abdullah bin Utbah] ia berkata; telah menceritakan kepadaku [Adl Dlahhak bin Qais] bahwa [Umar] telah memutuskan para orang-orang yang terkena tha'un (lepra) Amawas. Jika mereka yang berasal dari pihak ayah kedudukannya sama, maka para anak laki-laki dari ibu lebih berhak. Jika sebagian mereka lebih dekat dari sebagian yang lain kepada ayah maka mereka lebih berhak mendapat harta warisan."
            },
            {
                "number": 2490,
                "arab": " حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو شِهَابٍ حَدَّثَنِي أَبُو إِسْحَقَ الشَّيْبَانِيُّ عَنْ عُبَيْدِ بْنِ أَبِي الْجَعْدِ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادِ بْنِ الْهَادِ قَالَ أُصِيبَ سَالِمٌ مَوْلَى أَبِي حُذَيْفَةَ يَوْمَ الْيَمَامَةِ فَبَلَغَ مِيرَاثُهُ مِائَتَيْ دِرْهَمٍ فَقَالَ عُمَرُ احْبِسُوهَا عَلَى أُمِّهِ حَتَّى تَأْتِيَ عَلَى آخِرِهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah] telah menceritakan kepada kami [Abu Syihab] telah menceritakan kepadaku [Abu Ishaq Asy Syaibani] dari [Ubaid bin Abu Al Ja'd] dari [Abdullah bin Syaddad bin Al Had] ia berkata; Salim mantan budak Abu Hudzaifah meninggal (terbunuh) dalam perang Yamamah. Harta warisan yang ditinggalkan berjumlah dua ratus dirham. Maka [Umar] berkata; Simpan harta itu untuk ibunya, hingga akhirnya ia (ibu) datang."
            },
            {
                "number": 2491,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْإِخْوَةُ مِنْ الْأُمِّ يَتَوَارَثُونَ دُونَ بَنِي الْعَلَّاتِ يَرِثُ الرَّجُلُ أَخَاهُ لِأَبِيهِ وَأُمِّهِ دُونَ أَخِيهِ لِأَبِيهِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zuhair] dari [Abu Ishaq] dari [Al Harits] dari [Ali] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Para saudara laki-laki seibu dapat saling mewarisi, tidak bagi saudara laki-laki seayah. Seseorang dapat mewarisi saudara laki-laki seayah dan seibu kecuali saudara laki-laki seayah.\""
            },
            {
                "number": 2492,
                "arab": " حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ حَدَّثَنَا شُعْبَةُ عَنْ النُّعْمَانِ بْنِ سَالِمٍ قَالَ قُلْتُ لِابْنِ عُمَرَ أَرَأَيْتَ رَجُلًا تَرَكَ ابْنَ ابْنَتِهِ أَيَرِثُهُ قَالَ لَا",
                "id": "Telah menceritakan kepada kami [Sahal bin Hammad] telah menceritakan kepada kami [Syu'bah] dari [An Nu'man bin Salim] ia berkata; Aku pernah bertanya kepada [Ibnu Umar]; Apa pendapatmu tentang seseorang yang meninggal dunia dan meninggalkan seorang anak laki-laki dari anak perempuan, apakah ia mendapat warisan? Ia menjawab; Tidak."
            },
            {
                "number": 2493,
                "arab": " حَدَّثَنَا يَعْلَى حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ قَالَ قَالَ عَبْدُ اللَّهِ الْأُمُّ عَصَبَةُ مَنْ لَا عَصَبَةَ لَهُ وَالْأُخْتُ عَصَبَةُ مَنْ لَا عَصَبَةَ لَهُ",
                "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Al A'masy] dari [Ibrahim] ia berkata; [Abdullah] pernah berkata; Ibu adalah ashabah bagi orang yang tidak memiliki ashabah. Saudara perempuan juga ashabah bagi orang yang tidak memiliki ashabah."
            },
            {
                "number": 2494,
                "arab": " حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا ابْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا فَمَا بَقِيَ فَهُوَ لِأَوْلَى رَجُلٍ ذَكَرٍ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ibnu Thawus] dari [ayahnya] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Berikan bagian yang sudah ditetapkan kepada orang yang berhak mendapatkannya. Sedangkan harta yang tersisa dibagikan kepada pihak laki-laki yang paling dekat dengan mayit.\""
            },
            {
                "number": 2495,
                "arab": " أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا يَحْيَى أَنَّ سُلَيْمَانَ بْنَ يَسَارٍ أَخْبَرَهُ عَنْ مُحَمَّدِ بْنِ الْأَشْعَثِ أَنَّ عَمَّةً لَهُ تُوُفِّيَتْ يَهُودِيَّةً بِالْيَمَنِ فَذَكَرَ ذَلِكَ لِعُمَرَ بْنِ الْخَطَّابِ فَقَالَ يَرِثُهَا أَقْرَبُ النَّاسِ إِلَيْهَا مِنْ أَهْلِ دِينِهَا",
                "id": "Telah mengabarkan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Yahya] bahwa [Sulaiman bin Yasar] mengabarkan kepadanya dari [Muhammad bin Al Asy'ats] bahwa seorang bibinya meninggal dunia di Yaman dalam keadaan (beragama) yahudi. Lalu ia menceritakan hal itu kepada [Umar bin Al Khaththab], maka ia berkata; Orang yang terdekat dan seagama dengannya adalah yang berhak mewarisinya."
            },
            {
                "number": 2496,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ حَمَّادٍ عَنْ إِبْرَاهِيمَ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ أَهْلُ الشِّرْكِ لَا نَرِثُهُمْ وَلَا يَرِثُونَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Hammad] dari [Ibrahim] ia berkata; [Umar bin Al Khaththab] pernah berkata; Kita tidak berhak mewarisi warisan orang musyrik dan mereka tidak berhak mewarisi kita."
            },
            {
                "number": 2497,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا حَسَنٌ عَنْ عِيسَى الْحَنَّاطِ عَنْ الشَّعْبِيِّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ قَالُوا لَا يَتَوَارَثُ أَهْلُ دِينَيْنِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Hasan] dari [Isa Al Hannath] dari [Asy Sya'bi] bahwa Rasulullah shallallahu 'alaihi wasallam, Abu Bakr dan Umar mengatakan; (Antara) dua pemeluk agama (yang berbeda) tidak bisa saling mewarisi."
            },
            {
                "number": 2498,
                "arab": " حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زُهَيْرٌ عَنْ مُطَرِّفٍ عَنْ عَامِرٍ عَنْ عُمَرَ قَالَ لَا يَتَوَارَثُ أَهْلُ مِلَّتَيْنِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Zuhair] dari [Mutharrif] dari [Amir] dari [Umar] ia berkata; Dua pemeluk agama tidak bisa saling mewarisi."
            },
            {
                "number": 2499,
                "arab": " حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا شَرِيكٌ عَنْ الْأَشْعَثِ عَنْ الْحَسَنِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَرِثُ أَهْلَ الْكِتَابِ وَلَا يَرِثُونَا إِلَّا الرَّجُلُ يَرِثُ عَبْدَهُ أَوْ أَمَتَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Syarik] dari [Al Asy'ats] dari [Al Hasan] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kita tidak berhak mewarisi ahli kitab dan mereka tidak berhak mewarisi kita kecuali seseorang yang mewarisi budak laki-laki atau budak perempuan miliknya.\""
            }
        ]
    }
}