{
    "status": true,
    "data": {
        "start": 1030,
        "end": 1176,
        "total": 147,
        "book": "ibnu-majah",
        "hadits": [
            {
                "number": 1030,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ الزُّهْرِيِّ قَالَسَأَلْتُ السَّائِبَ بْنَ يَزِيدَ مَاذَا سَمِعْتَ فِي سُكْنَى مَكَّةَ قَالَ سَمِعْتُ الْعَلَاءَ بْنَ الْحَضْرَمِيِّ يَقُولُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثًا لِلْمُهَاجِرِ بَعْدَ الصَّدَرِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Hatim bin Isma'il] dari ['Abdurrahman bin Humaid Az Zuhri] ia berkata, \"Aku bertanya kepada [Sa`ib bin Yazid]; apa yang engkau dengar sewaktu tinggal di Makkah?\" ia menjawab, \"Aku mendengar [Al 'Ala Ibnul Hadlrami] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Bagi orang yang hijrah adalah tiga hari semenjak selesainya prosesi ibadah haji (atau umrah). \" "
            },
            {
                "number": 1031,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا أَبُو عَاصِمٍ وَقَرَأْتُهُ عَلَيْهِ أَنْبَأَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ فِي أُنَاسٍ مَعِي قَالَقَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ صُبْحَ رَابِعَةٍ مَضَتْ مِنْ شَهْرِ ذِي الْحِجَّةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Abu 'Ashim] -saya membacakan kepadanya- Telah memberitakan kepada kami [Ibnu Juraij] berkata, telah mengabarkan kepadaku ['Atho`] berkata, telah mengabarkan kepadaku [Jabir Bin Abdullah] -di antara orang-orang yang bersamaku- ia berkata, \"Nabi shallallahu 'alaihi wasallam tiba di Makkah di waktu subuh hari keempat dari berlalunya bulan Dzul Hijjah. \""
            },
            {
                "number": 1032,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَأَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِسْعَةَ عَشَرَ يَوْمًا يُصَلِّي رَكْعَتَيْنِ رَكْعَتَيْنِ فَنَحْنُ إِذَا أَقَمْنَا تِسْعَةَ عَشَرَ يَوْمًا نُصَلِّي رَكْعَتَيْنِ رَكْعَتَيْنِ فَإِذَا أَقَمْنَا أَكْثَرَ مِنْ ذَلِكَ صَلَّيْنَا أَرْبَعًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu Asy Syawarib] berkata, telah menceritakan kepada kami [Abdul Wahid bin Ziyad] berkata, telah menceritakan kepada kami ['Ashim Al Ahwal] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam tinggal selama sembilan belas hari, beliau sholat dua raka'at-dua raka'at. Maka jika kami tinggal selama sembilan belas hari, kami sholat sebanyak dua raka'at-dua raka'at, namun jika tinggal lebih dari itu kami sholat empat raka'at. \""
            },
            {
                "number": 1033,
                "arab": "حَدَّثَنَا أَبُو يُوسُفَ الصَّيْدَلَانِيُّ مُحَمَّدُ بْنُ أَحْمَدَ الرَّقِّيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَامَ بِمَكَّةَ عَامَ الْفَتْحِ خَمْسَ عَشْرَةَ لَيْلَةً يَقْصُرُ الصَّلَاةَ",
                "id": "Telah menceritakan kepada kami [Abu Yusuf Ash Shaidalani Muhammad bin Ahmad Ar Raqqi] berkata, telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Az Zuhri] dari [ubaidhullah bin Abdullah bin Utbah] dari [Ibnu Abbas] berkata, \"Pada tahun pembukaan Makkah Rasulullah shallallahu 'alaihi wasallam menetap di sana selama lima belas hari, dan beliau selalu menqashar sholat. \""
            },
            {
                "number": 1034,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ وَعَبْدُ الْأَعْلَى قَالَا حَدَّثَنَا يَحْيَى بْنُ أَبِي إِسْحَقَ عَنْ أَنَسٍ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمَدِينَةِ إِلَى مَكَّةَ فَصَلَّى رَكْعَتَيْنِ رَكْعَتَيْنِ حَتَّى رَجَعْنَا قُلْتُ كَمْ أَقَامَ بِمَكَّةَ قَالَ عَشْرًا",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Yazid bin Zurai'] dan [Abdul A'la] berdua berkata; telah menceritakan kepada kami [Yahya bin Abu Ishaq] dari [Anas] ia berkata, \"Kami bersama Rasulullah shallallahu 'alaihi wasallam berangkat dari Madinah menuju Makkah, lalu beliau sholat dua raka'at-dua raka'at hingga kami kembali. \" Aku bertanya, \"Berapa hari beliau tinggal di Makkah?\" ia menjawab, \"Sepuluh hari. \""
            },
            {
                "number": 1035,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ الْعَبْدِ وَبَيْنَ الْكُفْرِ تَرْكُ الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Sufyan] dari [Abu Az Zubair] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \" (Pembatas) antara seorang hamba dan kekafiran adalah meninggalkan sholat. \""
            },
            {
                "number": 1036,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ الْبَالِسِيُّ حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ بْنِ شَقِيقٍ حَدَّثَنَا حُسَيْنُ بْنُ وَاقِدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَهْدُ الَّذِي بَيْنَنَا وَبَيْنَهُمْ الصَّلَاةُ فَمَنْ تَرَكَهَا فَقَدْ كَفَرَ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Ibrahim Al Balisi] berkata, telah menceritakan kepada kami [Ali bin Al Hasan bin Syaqiq] berkata, telah menceritakan kepada kami [Husain bin Waqid] berkata, telah menceritakan kepada kami [Abdullah bin Buraidah] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perjanjian antara kita dengan mereka adalah sholat, maka barangsiapa meninggalkannya ia telah kafir. \""
            },
            {
                "number": 1037,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ عَمْرِو بْنِ سَعْدٍ عَنْ يَزِيدَ الرَّقَاشِيِّ عَنْ أَنَسِ بْنِ مَالِكٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ بَيْنَ الْعَبْدِ وَالشِّرْكِ إِلَّا تَرْكُ الصَّلَاةِ فَإِذَا تَرَكَهَا فَقَدْ أَشْرَكَ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim Ad Dimasqi] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Al Auza'i] dari [Amru bin Sa'd] dari [Yazid Ar Raqasyi] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada pembatas antara seorang hamba dengan kesyirikan selain meninggalkan sholat, jika ia meninggalkan sholat maka ia telah kafir. \" "
            },
            {
                "number": 1038,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا الْوَلِيدُ بْنُ بُكَيْرٍ أَبُو جَنَّابٍ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْعَدَوِيُّ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا أَيُّهَا النَّاسُ تُوبُوا إِلَى اللَّهِ قَبْلَ أَنْ تَمُوتُوا وَبَادِرُوا بِالْأَعْمَالِ الصَّالِحَةِ قَبْلَ أَنْ تُشْغَلُوا وَصِلُوا الَّذِي بَيْنَكُمْ وَبَيْنَ رَبِّكُمْ بِكَثْرَةِ ذِكْرِكُمْ لَهُ وَكَثْرَةِ الصَّدَقَةِ فِي السِّرِّ وَالْعَلَانِيَةِ تُرْزَقُوا وَتُنْصَرُوا وَتُجْبَرُوا وَاعْلَمُوا أَنَّ اللَّهَ قَدْ افْتَرَضَ عَلَيْكُمْ الْجُمُعَةَ فِي مَقَامِي هَذَا فِي يَوْمِي هَذَا فِي شَهْرِي هَذَا مِنْ عَامِي هَذَا إِلَى يَوْمِ الْقِيَامَةِ فَمَنْ تَرَكَهَا فِي حَيَاتِي أَوْ بَعْدِي وَلَهُ إِمَامٌ عَادِلٌ أَوْ جَائِرٌ اسْتِخْفَافًا بِهَا أَوْ جُحُودًا لَهَا فَلَا جَمَعَ اللَّهُ لَهُ شَمْلَهُ وَلَا بَارَكَ لَهُ فِي أَمْرِهِ أَلَا وَلَا صَلَاةَ لَهُ وَلَا زَكَاةَ لَهُ وَلَا حَجَّ لَهُ وَلَا صَوْمَ لَهُ وَلَا بِرَّ لَهُ حَتَّى يَتُوبَ فَمَنْ تَابَ تَابَ اللَّهُ عَلَيْهِ أَلَا لَا تَؤُمَّنَّ امْرَأَةٌ رَجُلًا وَلَا يَؤُمَّ أَعْرَابِيٌّ مُهَاجِرًا وَلَا يَؤُمَّ فَاجِرٌ مُؤْمِنًا إِلَّا أَنْ يَقْهَرَهُ بِسُلْطَانٍ يَخَافُ سَيْفَهُ وَسَوْطَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Al Walid bin Bukair Abu Jannab] berkata, telah menceritakan kepadaku [Abdullah bin Muhammad Al 'Adawi] dari [Ali bin Zaid] dari [Sa'id Ibnul Musayyab] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam berkhutbah di hadapan kami, beliau mengatakan: \"Wahai manusia, bertaubatlah kepada Allah sebelum kalian mati, bersegeralah beramal shalih sebelum kalian sibuk, dan sambunglah antara kalian dengan Rabb kalian dengan memperbanyak dzikir kepada-Nya, banyak sedekah dengan sembunyi-sembunyi maupun terang-terangan. Niscaya kalian akan diberi rizki, ditolong dan dicukupi. Ketahuilah, sesungguhnya Allah telah mewajibkan kepada kalian sholat jum'at di tempat berdiriku ini, di hariku ini, di bulanku ini dan di tahunku ini hingga hari kiamat. Barangsiapa meninggalkannya di waktu hidupku atau setelahku, dan dia memiliki imam adil atau bejat, kemudian meremehkan atau menolaknya, maka Allah tidak akan menyatukannya dan urusannya tidak akan diberkahi. Ketahuilah, tidak ada sholat, tidak ada zakat, tidak ada haji, tidak ada puasa, dan tidak ada kebaikan baginya hingga ia bertaubat. Maka barangsiapa bertaubat, Allah akan menerima taubatnya. Ketahuilah, tidak boleh seorang perempuan mengimami laki-laki, orang badui mengimami seorang muhajir dan tidak boleh orang fajir mengimami seorang mukmin, kecuali jika ia memaksanya dengan kekuasaan yang ditakuti pedang dan cambuknya. \""
            },
            {
                "number": 1039,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ أَبُو سَلَمَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ عَنْ أَبِيهِ أَبِي أُمَامَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ قَالَكُنْتُ قَائِدَ أَبِي حِينَ ذَهَبَ بَصَرُهُ فَكُنْتُ إِذَا خَرَجْتُ بِهِ إِلَى الْجُمُعَةِ فَسَمِعَ الْأَذَانَ اسْتَغْفَرَ لِأَبِي أُمَامَةَ أَسْعَدَ بْنِ زُرَارَةَ وَدَعَا لَهُ فَمَكَثْتُ حِينًا أَسْمَعُ ذَلِكَ مِنْهُ ثُمَّ قُلْتُ فِي نَفْسِي وَاللَّهِ إِنَّ ذَا لَعَجْزٌ إِنِّي أَسْمَعُهُ كُلَّمَا سَمِعَ أَذَانَ الْجُمُعَةِ يَسْتَغْفِرُ لِأَبِي أُمَامَةَ وَيُصَلِّي عَلَيْهِ وَلَا أَسْأَلُهُ عَنْ ذَلِكَ لِمَ هُوَ فَخَرَجْتُ بِهِ كَمَا كُنْتُ أَخْرُجُ بِهِ إِلَى الْجُمُعَةِ فَلَمَّا سَمِعَ الْأَذَانَ اسْتَغْفَرَ كَمَا كَانَ يَفْعَلُ فَقُلْتُ لَهُ يَا أَبَتَاهُ أَرَأَيْتَكَ صَلَاتَكَ عَلَى أَسْعَدَ بْنِ زُرَارَةَ كُلَّمَا سَمِعْتَ النِّدَاءَ بِالْجُمُعَةِ لِمَ هُوَ قَالَ أَيْ بُنَيَّ كَانَ أَوَّلَ مَنْ صَلَّى بِنَا صَلَاةَ الْجُمُعَةِ قَبْلَ مَقْدَمِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ مَكَّةَ فِي نَقِيعِ الْخَضَمَاتِ فِي هَزْمٍ مِنْ حَرَّةِ بَنِي بَيَاضَةَ قُلْتُ كَمْ كُنْتُمْ يَوْمَئِذٍ قَالَ أَرْبَعِينَ رَجُلًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Khalaf Abu Salamah] berkata, telah menceritakan kepada kami [Abdul A'la] dari [Muhammad bin Ishaq] dari [Muhamad bin Abu Umamah bin Sahl bin Hunaif] dari bapaknya [Abu Umamah] dari ['Abdurrahman bin Ka'b bin Malik] ia berkata, \"Aku adalah pemandu [bapakku] tatkala penglihatannya telah hilang. Jika aku keluar dengannya untuk sholat Jum'at dan ia mendengar adzan, maka ia memintakan ampun dan berdo`a untuk Abu Umamah As'ad bin Zurarah. Sejenak aku terdiam untuk mendengarkannya, kemudian aku berguman di dalam hatiku, \"Demi Allah, ia (bapakku) adalah orang yang lemah, setiap ia mendengar adzan jum'at dan meminta ampun bagi Abu Umamah aku mendengarnya, namun aku tidak pernah bertanya kenapa ia melakukan hal itu. \" Lalu aku berangkat bersama untuk sholat jum'at sebagaimana biasa, ketika mendengar adzan ia juga meminta ampun sebagaimana yang biasa dilakukannya. Maka aku pun bertanya kepadanya, \"Wahai bapakku, kenapa engkau selalu mendo`akan As'ad bin Zurarah setiap kali engkau mendengar adzan pada hari jum'at?\" ia menjawab, \"Wahai putraku, dia adalah orang yang pertama kali mengimami kami sholat jum'at sebelum kedatangan Rasulullah shallallahu 'alaihi wasallam dari Makkah di Naqi' Al Khadlamat daerah gurun dataran rendah bani Bayadlah. \" Aku bertanya kembali, \"Berapakah jumlah kalian saat itu?\" ia menjawab, \"Empat puluh orang. \" "
            },
            {
                "number": 1040,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ الْمُنْذِرِ حَدَّثَنَا ابْنُ فُضَيْلٍ حَدَّثَنَا أَبُو مَالِكٍ الْأَشْجَعِيُّ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ حُذَيْفَةَ وَعَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَضَلَّ اللَّهُ عَنْ الْجُمُعَةِ مَنْ كَانَ قَبْلَنَا كَانَ لِلْيَهُودِ يَوْمُ السَّبْتِ وَالْأَحَدُ لِلنَّصَارَى فَهُمْ لَنَا تَبَعٌ إِلَى يَوْمِ الْقِيَامَةِ نَحْنُ الْآخِرُونَ مِنْ أَهْلِ الدُّنْيَا وَالْأَوَّلُونَ الْمَقْضِيُّ لَهُمْ قَبْلَ الْخَلَائِقِ",
                "id": "Telah menceritakan kepada kami [Ali Ibnul Mundzir] berkata, telah menceritakan kepada kami [Ibnu Fudlail] berkata, telah menceritakan kepada kami [Abu Malik Al Asyja'i] dari [Rib'I bin Hirasy] dari [Hudzaifah] dan dari [Abu Hazim] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah telah menyesatkan orang-orang sebelum kita di hari jum'at, hari sabtu untuk orang yahudi dan hari ahad untuk orang nashara. Dan mereka akan mengikuti kita hingga hari kiamat, kita terakhir dari penduduk dunia namun pertama dalam penghisaban di akhirat, sebelum mereka. \""
            },
            {
                "number": 1041,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى ابْنُ أَبِي بُكَيْرٍ حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ الْأَنْصَارِيِّ عَنْ أَبِي لُبَابَةَ بْنِ عَبْدِ الْمُنْذِرِ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ يَوْمَ الْجُمُعَةِ سَيِّدُ الْأَيَّامِ وَأَعْظَمُهَا عِنْدَ اللَّهِ وَهُوَ أَعْظَمُ عِنْدَ اللَّهِ مِنْ يَوْمِ الْأَضْحَى وَيَوْمِ الْفِطْرِ فِيهِ خَمْسُ خِلَالٍ خَلَقَ اللَّهُ فِيهِ آدَمَ وَأَهْبَطَ اللَّهُ فِيهِ آدَمَ إِلَى الْأَرْضِ وَفِيهِ تَوَفَّى اللَّهُ آدَمَ وَفِيهِ سَاعَةٌ لَا يَسْأَلُ اللَّهَ فِيهَا الْعَبْدُ شَيْئًا إِلَّا أَعْطَاهُ مَا لَمْ يَسْأَلْ حَرَامًا وَفِيهِ تَقُومُ السَّاعَةُ مَا مِنْ مَلَكٍ مُقَرَّبٍ وَلَا سَمَاءٍ وَلَا أَرْضٍ وَلَا رِيَاحٍ وَلَا جِبَالٍ وَلَا بَحْرٍ إِلَّا وَهُنَّ يُشْفِقْنَ مِنْ يَوْمِ الْجُمُعَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yahya bin Abu Bukair] berkata, telah menceritakan kepada kami [Zuhair bin Muhammad] dari [Abdullah bin Muhammad bin Aqil] dari ['Abdurrahman bin Yazid Al Anshari] dari [Abu Lubabah bin Abdul Mundzir] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Hari jum'at adalah sebaik-baik dan seagung-agung hari. Di sisi Allah ia lebih utama dari idul adha dan idul fitri. Pada hari itu ada lima perkara (besar); pada hari itu Adam dicipta, hari itu ia diturunkan ke bumi, pada hari itu ia diwafatkan, pada hari itu kiamat tiba. Dan pada hari itu tidaklah malaikat, langit, bumi, angin, gunung dan laut kecuali takut karena keagungan hari jum'at. \""
            },
            {
                "number": 1042,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْحُسَيْنُ بْنُ عَلِيٍّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ عَنْ أَوْسِ بْنِ أَوْسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ أَفْضَلِ أَيَّامِكُمْ يَوْمَ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ النَّفْخَةُ وَفِيهِ الصَّعْقَةُ فَأَكْثِرُوا عَلَيَّ مِنْ الصَّلَاةِ فِيهِ فَإِنَّ صَلَاتَكُمْ مَعْرُوضَةٌ عَلَيَّ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ كَيْفَ تُعْرَضُ صَلَاتُنَا عَلَيْكَ وَقَدْ أَرَمْتَ يَعْنِي بَلِيتَ فَقَالَ إِنَّ اللَّهَ حَرَّمَ عَلَى الْأَرْضِ أَنْ تَأْكُلَ أَجْسَادَ الْأَنْبِيَاءِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Al Husain bin Ali] dari ['Abdurrahman bin Jabir] dari [Abu Al Asy'ats Ash Shan'ani] dari [Aus bin Aus] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya hari yang paling utama dari hari-hari kalian adalah hari jum'at, pada hari itu Adam diciptakan, sangkakala ditiup dan di hari itu datang hari kiamat. Maka perbanyaklah shalawat kepadaku pada hari itu, sesungguhnya shalawat kalian akan sampai kepadaku. \" Seorang laki-laki bertanya, \"Wahai Rasulullah, bagaimana shalawat kami bisa sampai kepadamu, sementara engkau telah tiada dan jasadmu telah hancur?\" Beliau menjawab: \"Allah telah mengharamkan bagi bumi untuk makan jasad para Nabi. \""
            },
            {
                "number": 1043,
                "arab": "حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ الْعَدَنِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْجُمُعَةُ إِلَى الْجُمُعَةِ كَفَّارَةُ مَا بَيْنَهُمَا مَا لَمْ تُغْشَ الْكَبَائِرُ",
                "id": "Telah menceritakan kepada kami [Muhriz bin Salamah Al 'Adani] berkata, telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] dari [Al 'Ala] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jum'at hingga jum'at berikutnya adalah penghapus dosa antara keduanya selama dosa besar dijauhi. \""
            },
            {
                "number": 1044,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ الْأَوْزَاعِيِّ حَدَّثَنَا حَسَّانُ بْنُ عَطِيَّةَ حَدَّثَنِي أَبُو الْأَشْعَثِ حَدَّثَنِي أَوْسُ بْنُ أَوْسٍ الثَّقَفِيُّ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ غَسَّلَ يَوْمَ الْجُمُعَةِ وَاغْتَسَلَ وَبَكَّرَ وَابْتَكَرَ وَمَشَى وَلَمْ يَرْكَبْ وَدَنَا مِنْ الْإِمَامِ فَاسْتَمَعَ وَلَمْ يَلْغُ كَانَ لَهُ بِكُلِّ خَطْوَةٍ عَمَلُ سَنَةٍ أَجْرُ صِيَامِهَا وَقِيَامِهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah Ibnul Mubarak] dari [Al Auza'i] berkata, telah menceritakan kepada kami [Hassan bin Athiah] berkata, telah menceritakan kepada kami [Abul Asy'ats] berkata, telah menceritakan kepada kami [Aus bin Ats Tsaqafi] berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membasuh kepala dan seluruh badannya, berangkat di awal waktu dan mendapat awal khutbah, berjalan dan tidak berkendaraan, mendekati imam dan mendengarkan khutbah serta tidak berbuat sia-sia maka setiap langkah akan dihitung sebagai ibadah selama satu tahun dengan pahala puasa dan tahajud. \""
            },
            {
                "number": 1045,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ عَنْ أَبِي إِسْحَقَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَلَى الْمِنْبَرِ مَنْ أَتَى الْجُمُعَةَ فَلْيَغْتَسِلْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Umar bin Ubaid] dari [Abu Ishaq] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda di atas mimbar: \"Barangsiapa menghadiri jum'at hendaklah mandi besar. \""
            },
            {
                "number": 1046,
                "arab": "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ",
                "id": "Telah menceritakan kepada kami [Sahl bin Abu Sahl] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Shofwan bin Sulaiman] dari ['Atho` bin Yasar] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mandi di hari jum'at hukumnya wajib bagi orang yang telah mimpi basah. \""
            },
            {
                "number": 1047,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ أَتَى الْجُمُعَةَ فَدَنَا وَأَنْصَتَ وَاسْتَمَعَ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الْأُخْرَى وَزِيَادَةُ ثَلَاثَةِ أَيَّامٍ وَمَنْ مَسَّ الْحَصَى فَقَدْ لَغَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berwudlu dan membaguskan wudlunya, kemudian menghadiri sholat jum'at, mendekati imam, diam dan mendengarkan khutbah, maka dosanya antara jum'at tersebut hingga jum'at berikutnya akan diampuni, dengan ditambah tiga hari. Dan barangsiapa menyentuh kerikil maka ia telah sia-sia. \""
            },
            {
                "number": 1048,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا إِسْمَعِيلُ بْنُ مُسْلِمٍ الْمَكِّيُّ عَنْ يَزِيدَ الرَّقَاشِيِّ عَنْ أَنَسِ بْنِ مَالِكٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَوَضَّأَ يَوْمَ الْجُمُعَةِ فَبِهَا وَنِعْمَتْ تُجْزِئُ عَنْهُ الْفَرِيضَةُ وَمَنْ اغْتَسَلَ فَالْغُسْلُ أَفْضَلُ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah memberitakan kepada kami [Isma'il bin Muslim Al Makki] dari [Yazid Ar Raqqasyi] dari [Anas bin Malik] Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berwudlu pada hari jum'at, maka itu adalah kebaikan yang dengannya sholat wajib bisa dilaksanakan. Dan barangsiapa mandi, maka mandi itu lebih utama. \""
            },
            {
                "number": 1049,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَسَهْلُ بْنُ أَبِي سَهْلٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانَ يَوْمُ الْجُمُعَةِ كَانَ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ مَلَائِكَةٌ يَكْتُبُونَ النَّاسَ عَلَى قَدْرِ مَنَازِلِهِمْ الْأَوَّلَ فَالْأَوَّلَ فَإِذَا خَرَجَ الْإِمَامُ طَوَوْا الصُّحُفَ وَاسْتَمَعُوا الْخُطْبَةَ فَالْمُهَجِّرُ إِلَى الصَّلَاةِ كَالْمُهْدِي بَدَنَةً ثُمَّ الَّذِي يَلِيهِ كَمُهْدِي بَقَرَةٍ ثُمَّ الَّذِي يَلِيهِ كَمُهْدِي كَبْشٍ حَتَّى ذَكَرَ الدَّجَاجَةَ وَالْبَيْضَةَ زَادَ سَهْلٌ فِي حَدِيثِهِ فَمَنْ جَاءَ بَعْدَ ذَلِكَ فَإِنَّمَا يَجِيءُ بِحَقٍّ إِلَى الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] dan [Sahl bin Abu Sahl] keduanya berkata; telah menceritakan kepada kami [Sufyan bin Uyaniah] dari [Az Zuhri] dari [Sa'id Ibnul Musayyab] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada hari jum'at di setiap pintu masjid ada malaikat yang menulis manusia sesuai kedatangan mereka ke masjid, yang pertama dan seterusnya. Jika imam telah tiba mereka menutup buku catatannya dan mendengarkan khutbah. Orang yang pertama datang ke masjid seperti orang yang bersedekah unta, setelahnya seperti orang yang bersedekah sapi, setelahnya seperti orang yang bersedekah domba, \" hingga beliau menyebutkan ayam dan telur. \" Sahl menambahkan dalam haditsnya, \"Barangsiapa datang setelah itu maka ia datang layaknya orang yang datang untuk sholat. \""
            },
            {
                "number": 1050,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ عَنْ سَعِيدِ بْنِ بَشِيرٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَرَبَ مَثَلَ الْجُمُعَةِ ثُمَّ التَّبْكِيرِ كَنَاحِرِ الْبَدَنَةِ كَنَاحِرِ الْبَقَرَةِ كَنَاحِرِ الشَّاةِ حَتَّى ذَكَرَ الدَّجَاجَةَ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Waki'] dari [Sa'id bin Basyir] dari [Qatadah] dari [Al Hasan] dari [Samurah bin Jundab] berkata, \"Rasulullah shallallahu 'alaihi wasallam membuat perumpamaan hari jum'at, maka barangsiapa bersegera menuju jum'at seperti seorang yang berkurban unta, seperti seorang yang berkurban sapi, seperti orang yang berkurban kambing, hingga beliau menyebutkan seperti orang yang menyembelih ayam. \""
            },
            {
                "number": 1051,
                "arab": "حَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ الْحِمْصِيُّ حَدَّثَنَا عَبْدُ الْمَجِيدِ بْنُ عَبْدِ الْعَزِيزِ عَنْ مَعْمَرٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ قَالَخَرَجْتُ مَعَ عَبْدِ اللَّهِ إِلَى الْجُمُعَةِ فَوَجَدَ ثَلَاثَةً وَقَدْ سَبَقُوهُ فَقَالَ رَابِعُ أَرْبَعَةٍ وَمَا رَابِعُ أَرْبَعَةٍ بِبَعِيدٍ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ النَّاسَ يَجْلِسُونَ مِنْ اللَّهِ يَوْمَ الْقِيَامَةِ عَلَى قَدْرِ رَوَاحِهِمْ إِلَى الْجُمُعَاتِ الْأَوَّلَ وَالثَّانِيَ وَالثَّالِثَ ثُمَّ قَالَ رَابِعُ أَرْبَعَةٍ وَمَا رَابِعُ أَرْبَعَةٍ بِبَعِيدٍ",
                "id": "Telah menceritakan kepada kami [Katsir bin Ubaid Al Himshi] berkata, telah menceritakan kepada kami [Abdul Majid bin Abdul Aziz] dari [Ma'mar] dari [Al A'masy] dari [Ibrahim] dari [Alqamah] ia berkata, \"Aku bersama [Abdullah] berangkat menuju sholat jum'at, kemudian ia menjumpai tiga orang yang telah mendahuluinya, maka ia pun berkata, \"Yang ke empat dari empat, dan tidaklah yang ke empat dari yang empat itu jauh. Sesungguhnya aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jauh-dekatnya kedudukan manusia di sisi Allah pada hari kiamat sesuai dengan perginya mereka menuju sholat jum'at; yang pertama, kedua dan ketiga. \" Kemudian beliau bersabda lagi: \"Yang ke empat dari empat, dan tidaklah yang keempat dari empat itu jauh. \""
            },
            {
                "number": 1052,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ مُوسَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ عَبْدِ اللَّهِ بْنِ سَلَامٍأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَلَى الْمِنْبَرِ فِي يَوْمِ الْجُمُعَةِ مَا عَلَى أَحَدِكُمْ لَوْ اشْتَرَى ثَوْبَيْنِ لِيَوْمِ الْجُمُعَةِ سِوَى ثَوْبِ مِهْنَتِهِحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَيْخٌ لَنَا عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ سَلَامٍ عَنْ أَبِيهِ قَالَ خَطَبَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah mengabarkan kepadaku [Amru bin Al Harits] dari [Yazid bin Abu Habib] dari [Musa bin Sa'id] dari [Muhammad bin Yahya bin Habban Abu Habib] dari [Abdullah bin Salam] Bahwasanya ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda di atas mimbar pada hari jum'at: \"Apa susahnya jika seseorang dari kalian membeli dua baju untuk hari jum'at selain baju kerjanya. \" Telah menceritakan kepada kami [Abu Bakar Ibnu Abu Syaibah] berkata, telah menceritakan kepada kami [salah seorang syaikh kami], dari [Abdul Hamid bin Ja'far] dari [Muhamma bin Yahya bin Habban] dari [Yusuf bin Abdullah bin Salam] dari [Bapaknya] ia berkata, \"Nabi shallallahu 'alaihi wasallam berkhutbah di hadapan kami, lalu beliau menyebutkan hal tersebut. \" "
            },
            {
                "number": 1053,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَمْرُو بْنُ أَبِي سَلَمَةَ عَنْ زُهَيْرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ النَّاسَ يَوْمَ الْجُمُعَةِ فَرَأَى عَلَيْهِمْ ثِيَابَ النِّمَارِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا عَلَى أَحَدِكُمْ إِنْ وَجَدَ سَعَةً أَنْ يَتَّخِذَ ثَوْبَيْنِ لِجُمُعَتِهِ سِوَى ثَوْبَيْ مِهْنَتِهِ",
                "id": "Telah menceritakan kepada kami [Muhamad bin Yahya] berkata, telah menceritakan kepada kami [Amru bin Abu Salamah] dari [Zuhair] dari [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] berkata, \"Pada hari jum'at Nabi shallallahu 'alaihi wasallam berkhutbah di hadapan para sahabat, beliau melihat mereka mengenakan baju wool, maka beliau bersabda: \"Apa susahnya jika salah seorang kalian mendapatkan kemudahan mengambil (membeli) dua baju untuk jum'atnya selain baju kerja. \""
            },
            {
                "number": 1054,
                "arab": "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ وَحَوْثَرَةُ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ عَنْ ابْنِ عَجْلَانَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ وَدِيعَةَ عَنْ أَبِي ذَرٍّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اغْتَسَلَ يَوْمَ الْجُمُعَةِ فَأَحْسَنَ غُسْلَهُ وَتَطَهَّرَ فَأَحْسَنَ طُهُورَهُ وَلَبِسَ مِنْ أَحْسَنِ ثِيَابِهِ وَمَسَّ مَا كَتَبَ اللَّهُ لَهُ مِنْ طِيبِ أَهْلِهِ ثُمَّ أَتَى الْجُمُعَةَ وَلَمْ يَلْغُ وَلَمْ يُفَرِّقْ بَيْنَ اثْنَيْنِ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الْأُخْرَى",
                "id": "Telah menceritakan kepada kami [Sahl bin Abu Sahl] dan [Hautsarah bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Yahya bin Sa'id Al Qaththan] dari [Ibnu Ajlan] dari [Sa'id Al Maqburi] dari [Bapaknya] dari [Abdullah bin Wadi'ah] dari [Abu Dzar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa mandi di hari jum'at dan membaguskan mandinya, lalu bersuci dan membaguskan cara bersucinya, lalu memakai pakaian terbaiknya dan memakai wewangian, setelah itu menghadiri sholat jum'at, tidak melakukan perbuatan sia-sia atau memisahkan antara dua orang, maka akan diampuni semua dosanya antara jum'at tersebut hingga jum'at berikutnya. \""
            },
            {
                "number": 1055,
                "arab": "حَدَّثَنَا عَمَّارُ بْنُ خَالِدٍ الْوَاسِطِيُّ حَدَّثَنَا عَلِيُّ بْنُ غُرَابٍ عَنْ صَالِحِ بْنِ أَبِي الْأَخْضَرِ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ بْنِ السَّبَّاقِ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ هَذَا يَوْمُ عِيدٍ جَعَلَهُ اللَّهُ لِلْمُسْلِمِينَ فَمَنْ جَاءَ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ وَإِنْ كَانَ طِيبٌ فَلْيَمَسَّ مِنْهُ وَعَلَيْكُمْ بِالسِّوَاكِ",
                "id": "Telah menceritakan kepada kami [Ammar bin Khalid Al Wasithi] berkata, telah menceritakan kepada kami [Ali bin Ghurab] dari [Shalih bin Abu Al Akhdlar] dari [Az Zuhri] dari [Ubaid bin As Sabbaq] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya ini adalah hari raya yang telah Allah jadikan bagi kaum muslimin. Barangsiapa menghadiri sholat jum'at hendaklah mandi, jika mempunyai minyak wangi hendaklah mengoleskannya, dan hendaklah kalian bersiwak. \""
            },
            {
                "number": 1056,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ حَدَّثَنِي أَبِي عَنْ سَهْلِ بْنِ سَعْدٍ قَالَمَا كُنَّا نَقِيلُ وَلَا نَتَغَدَّى إِلَّا بَعْدَ الْجُمُعَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] berkata, telah menceritakan kepadaku [Bapakku] dari [Sahl bin Sa'd] ia berkata, \"Kami tidak tidur dan makan ghada (makan di awal siang) kecuali setelah jum'at. \" "
            },
            {
                "number": 1057,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا يَعْلَى بْنُ الْحَارِثِ قَالَ سَمِعْتُ إِيَاسَ بْنَ سَلَمَةَ بْنِ الْأَكْوَعِ عَنْ أَبِيهِ قَالَكُنَّا نُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجُمُعَةَ ثُمَّ نَرْجِعُ فَلَا نَرَى لِلْحِيطَانِ فَيْئًا نَسْتَظِلُّ بِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami ['Abdurrahman bin Mahdi] berkata, telah menceritakan kepada kami [Ya'la Ibnul Harits] berkata; Aku mendengar [Iyas bin Salamah Ibnul Akwa'] dari [Bapaknya] ia berkata, \"Kami pernah sholat jum'at bersama Nabi shallallahu 'alaihi wasallam, kemudian kami pulang dan kami belum mendapati bayangan tembok yang bisa kami jadikan sebagai perlindungan dari terik matahari. \""
            },
            {
                "number": 1058,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ مُؤَذِّنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنِي أَبِي عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّهُ كَانَ يُؤَذِّنُ يَوْمَ الْجُمُعَةِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ الْفَيْءُ مِثْلَ الشِّرَاكِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] berkata, telah menceritakan kepada kami ['Abdurrahman bin Sa'd bin 'Ammar bin Sa'd] -mu`adzin Nabi shallallahu 'alaihi wasallam- berkata, telah menceritakan kepadaku [Bapakku] dari [Bapaknya] dari [Kakeknya] bahwa pada masa Rasulullah shallallahu 'alaihi wasallam ia mengumandangkan adzan di hari jum'at ketika bayangan sudah seperti tali sandal. \" "
            },
            {
                "number": 1059,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ حَدَّثَنَا حُمَيْدٌ عَنْ أَنَسٍ قَالَكُنَّا نُجَمِّعُ ثُمَّ نَرْجِعُ فَنَقِيلُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah] berkata, telah menceritakan kepada kami [Mu'tamir bin Sulaiman] berkata, telah menceritakan kepada kami [Humaid] dari [Anas] ia berkata, \"Kami pergi sholat jum'at kemudian kembali dan tidur siang. \" "
            },
            {
                "number": 1060,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ ح و حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ أَبُو سَلَمَةَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ خُطْبَتَيْنِ يَجْلِسُ بَيْنَهُمَا جَلْسَةً زَادَ بِشْرٌ وَهُوَ قَائِمٌ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah memberitakan kepada kami [Ma'mar] dari [ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Yahya bin Khalaf Abu Salamah] berkata, telah menceritakan kepada kami [Bisyr bin Mufadldlal] dari [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] berkata, \"Nabi shallallahu 'alaihi wasallam khutbah dua kali dan beliau duduk di antara dua khutbah sejenak. \" Bisyr menambahkan, \"beliau dalam kondisi akan berdiri. \""
            },
            {
                "number": 1061,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مُسَاوِرٍ الْوَرَّاقِ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ حُرَيْثٍ عَنْ أَبِيهِ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى الْمِنْبَرِ وَعَلَيْهِ عِمَامَةٌ سَوْدَاءُ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Musawir Al Warraq] dari [Ja'far bin Amru bin Huraits] dari [Bapaknya] ia berkata, \"Nabi shallallahu 'alaihi wasallam berkhutbah di atas mimbar sedang beliau memakai imamah (semacam surban yang diikatkan pada kepala) warna hitam. \""
            },
            {
                "number": 1062,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ الْوَلِيدِ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ قَالَ سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا غَيْرَ أَنَّهُ كَانَ يَقْعُدُ قَعْدَةً ثُمَّ يَقُومُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] dan [Muhammad Ibnul Walid] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Simak bin Harb] ia berkata, \"Aku mendengar [Jabir bin Samurah] berkata, \"Rasulullah shallallahu 'alaihi wasallam berkhutbah dengan berdiri, hanya saja beliau duduk sebentar kemudian berdiri lagi. \""
            },
            {
                "number": 1063,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ فَيَقْرَأُ آيَاتٍ وَيَذْكُرُ اللَّهَ وَكَانَتْ خُطْبَتُهُ قَصْدًا وَصَلَاتُهُ قَصْدًا",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki']. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami ['Abdurrahman bin Mahdi] keduanya berkata; telah menceritakan kepada kami [Sufyan] dari [Simak] dari [Jabir bin Abdullah] ia berkata, \"Nabi shallallahu 'alaihi wasallam berkhutbah dengan berdiri kemudian duduk, setelah itu beliau berdiri lagi membaca beberapa ayat dan berdzikir kepada Allah. Khutbah dan sholat beliau sedang. \" "
            },
            {
                "number": 1064,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ حَدَّثَنِي أَبِي عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَطَبَ فِي الْحَرْبِ خَطَبَ عَلَى قَوْسٍ وَإِذَا خَطَبَ فِي الْجُمُعَةِ خَطَبَ عَلَى عَصًا",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] berkata, telah menceritakan kepada kami ['Abdurrahman bin Sa'd bin Ammar bin Sa'd] berkata, telah menceritakan kepadaku [Bapakku] dari [Bapaknya] dari [Kakeknya] berkata, \"Rasulullah shallallahu 'alaihi wasallam jika berkhutbah dalam peperangan, beliau berpegangan tombak dan jika khutbah di hari jum'at beliau berpegangan tongkat. \" "
            },
            {
                "number": 1065,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ أَبِي غَنِيَّةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِأَنَّهُ سُئِلَ أَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا أَوْ قَاعِدًا قَالَ أَوَمَا تَقْرَأُ{ وَتَرَكُوكَ قَائِمًا }قَالَ أَبُو عَبْد اللَّهِ غَرِيبٌ لَا يُحَدِّثُ بِهِ إِلَّا ابْنُ أَبِي شَيْبَةَ وَحْدَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ibnu Abu Ghaniyyah] dari [Al A'masy] dari [Ibrahim] dari [Alqamah] dari [Abdullah] bahwasanya ia pernah ditanya; apakah Nabi shallallahu 'alaihi wasallam berkhutbah sambil berdiri atau duduk? Ia menjawab: \"Apakah kamu tidak membaca ayat: \" (dan mereka meninggalkanmu dalam keadaan berdiri)?\" Abu Abdullah berkata: \"Ini adalah hadits gharib, dan tidak ada yang meriwatkannya kecuali hanya Abu Syaibah. \" "
            },
            {
                "number": 1066,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ مُحَمَّدِ بْنِ زَيْدِ بْنِ مُهَاجِرٍ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا صَعِدَ الْمِنْبَرَ سَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Amru bin Khalid] berkata, telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Muhammad bin Zaid bin Muhajir] dari [Muhammad bin Munkadir] dari [Jabir bin Abdullah] berkata, \"Nabi shallallahu 'alaihi wasallam apabila naik mimbar selalu mengucapkan salam. \" "
            },
            {
                "number": 1067,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ فَقَدْ لَغَوْتَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Syababah bin Sawwar] dari [Ibnu Abu Dzi'b] dari [Az Zuhri] dari [Sa'id Ibnul Musayyab] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jika engkau mengatakan kepada kawanmu 'diamlah' sementara imam sedang berkhutbah di hari jum'at maka engkau telah sia-sia. \""
            },
            {
                "number": 1068,
                "arab": "حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ الْعَدَنِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أُبَيِّ بْنِ كَعْبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ يَوْمَ الْجُمُعَةِ تَبَارَكَ وَهُوَ قَائِمٌ فَذَكَّرَنَا بِأَيَّامِ اللَّهِ وَأَبُو الدَّرْدَاءِ أَوْ أَبُو ذَرٍّ يَغْمِزُنِي فَقَالَ مَتَى أُنْزِلَتْ هَذِهِ السُّورَةُ إِنِّي لَمْ أَسْمَعْهَا إِلَّا الْآنَ فَأَشَارَ إِلَيْهِ أَنْ اسْكُتْ فَلَمَّا انْصَرَفُوا قَالَ سَأَلْتُكَ مَتَى أُنْزِلَتْ هَذِهِ السُّورَةُ فَلَمْ تُخْبِرْنِي فَقَالَ أُبَيٌّ لَيْسَ لَكَ مِنْ صَلَاتِكَ الْيَوْمَ إِلَّا مَا لَغَوْتَ فَذَهَبَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ وَأَخْبَرَهُ بِالَّذِي قَالَ أُبَيٌّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَقَ أُبَيٌّ",
                "id": "Telah menceritakan kepada kami [Muhriz bin Salamah Al Adani] berkata, telah menceritakan kepada kami [Abdul Aziz bin Muhammad Ad Darawardi] dari [Syarik bin Abdullah bin Abu Namir] dari ['Atho` bin Yasar] dari [Ubai bin Ka'b] berkata, \"Rasulullah shallallahu 'alaihi wasallam pada hari jum'at membaca TABAARAKA sementara beliau berdiri. Beliau juga mengingatkan kami dengan hari-hari Allah. Lalu Abu Darda atau Abu Dzar mencubitku seraya berkata, \"Kapan ayat ini diturunkan, aku belum pernah mendengarnya kecuali sekarang ini? Namun Ubai memberi isyarat agar ia diam. Ketika orang-orang bubar, Abu Darda berkata, \"Aku bertanya kepadamu kapan surat ini diturunkan, namun engkau tidak memberitahukan kepadaku! \" Ubai bin Ka'b berkata, \"Hari ini engkau tidak mendapatkan pahala sholatmu kecuali sesuatu yang telah engkau sia-siakan itu. \" Abu Darda akhirnya menemui Rasulullah shallallahu 'alaihi wasallam dan mengabarkan kepada beliau dengan apa yang dikatakan oleh Ubai, lalu Rasulullah shallallahu 'alaihi wasallam menjawab: \"Ubai benar. \""
            },
            {
                "number": 1069,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ سَمِعَ جَابِرًا وَأَبُو الزُّبَيْرِ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَدَخَلَ سُلَيْكٌ الْغَطَفَانِيُّ الْمَسْجِدَ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَقَالَ أَصَلَّيْتَ قَالَ لَا قَالَ فَصَلِّ رَكْعَتَيْنِ وَأَمَّا عَمْرٌو فَلَمْ يَذْكُرْ سُلَيْكًا",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Amru bin Dinar] dari [Jabir] dan [Abu Az Zubair] ia mendengar [Jabir bin Abdullah] ia berkata, \"Sulaik Al Ghathafani masuk ke dalam masjid sementara Nabi shallallahu 'alaihi wasallam berkhutbah, beliau bersabda: \"Apakah engkau sudah melaksanakan sholat sunnah?\" ia menjawab, \"Belum, \" beliau bersabda: \"sholatlah dua rakaat. \" Sedangkan Amru tidak menyebutkan nama Sulaik. "
            },
            {
                "number": 1070,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ عَجْلَانَ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ قَالَجَاءَ رَجُلٌ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَقَالَ أَصَلَّيْتَ قَالَ لَا قَالَ فَصَلِّ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Sufyan bin Uyainah] dari [Ibnu 'Ajlan] dari ['Iyadl bin Abdullah] dari [Abu Sa'id] ia berkata, \"Seorang laki-laki datang sementara Nabi shallallahu 'alaihi wasallam berkhutbah, kemudian beliau bertanya: \"Apakah kamu sudah sholat? Ia menjawab: \"Belum, \" beliau bersabda: \"sholatlah dua raka'at. \""
            },
            {
                "number": 1071,
                "arab": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ وَعَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَاجَاءَ سُلَيْكٌ الْغَطَفَانِيُّ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَلَّيْتَ رَكْعَتَيْنِ قَبْلَ أَنْ تَجِيءَ قَالَ لَا قَالَ فَصَلِّ رَكْعَتَيْنِ وَتَجَوَّزْ فِيهِمَا",
                "id": "Telah menceritakan kepada kami [Dawud bin Rusyaid] berkata, telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dan [Abu Sufyan] dari [Jabir] keduanya berkata, \"Sulaik Al Ghathafani masuk ke dalam masjid sementara Rasulullah shallallahu 'alaihi wasallam berkhutbah, lalu Nabi shallallahu 'alaihi wasallam bersabda bertanya kepadanya: \"Apakah engkau telah melaksanakan sholat sebelum engkau tiba?\" ia berkata, \"Belum, \" beliau bersabda: \"sholatlah dua raka'at dan ringankanlah. \""
            },
            {
                "number": 1072,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ عَنْ إِسْمَعِيلَ بْنِ مُسْلِمٍ عَنْ الْحَسَنِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَجُلًا دَخَلَ الْمَسْجِدَ يَوْمَ الْجُمُعَةِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَجَعَلَ يَتَخَطَّى النَّاسَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْلِسْ فَقَدْ آذَيْتَ وَآنَيْتَ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami ['Abdurrahman Al Muharibi] dari [Isma'il bin Muslim] dari [Al Hasan] dari [Jabir bin Abdullah] berkata, \"Seorang laki-laki masuk masjid pada hari jum'at sementara Rasulullah shallallahu 'alaihi wasallam berkhutbah. Laki-laki itu melangkahi orang-orang hingga Rasulullah shallallahu 'alaihi wasallam bersabda: \"Duduk! Sungguh engkau telah terlambat dan menyakiti (orang lain). \" "
            },
            {
                "number": 1073,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ عَنْ زَبَّانَ بْنِ فَائِدٍ عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَخَطَّى رِقَابَ النَّاسِ يَوْمَ الْجُمُعَةِ اتُّخِذَ جِسْرًا إِلَى جَهَنَّمَ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Risydin bin Sa'd] dari [Zabban bin Fa`id] dari [Sahl bin Mu'adz bin Anas] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa di hari jum'at melangkahi pundak orang lain, maka akan dibuatkan baginya jembatan ke jahannam. \""
            },
            {
                "number": 1074,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُكَلَّمُ فِي الْحَاجَةِ إِذَا نَزَلَ عَنْ الْمِنْبَرِ يَوْمَ الْجُمُعَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Abu Dawud] berkata, telah menceritakan kepada kami [Jarir bin Hazim] dari [Tsabit] dari [Anas bin Malik] berkata, \"Jika Nabi shallallahu 'alaihi wasallam turun dari mimbar di hari jum'at, beliau diadui tentang hajat kebutuhan. \""
            },
            {
                "number": 1075,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ الْمَدَنِيُّ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ قَالَاسْتَخْلَفَ مَرْوَانُ أَبَا هُرَيْرَةَ عَلَى الْمَدِينَةِ فَخَرَجَ إِلَى مَكَّةَ فَصَلَّى بِنَا أَبُو هُرَيْرَةَ يَوْمَ الْجُمُعَةِ فَقَرَأَ بِسُورَةِ الْجُمُعَةِ فِي السَّجْدَةِ الْأُولَى وَفِي الْآخِرَةِ إِذَا جَاءَكَ الْمُنَافِقُونَ قَالَ عُبَيْدُ اللَّهِ فَأَدْرَكْتُ أَبَا هُرَيْرَةَ حِينَ انْصَرَفَ فَقُلْتُ لَهُ إِنَّكَ قَرَأْتَ بِسُورَتَيْنِ كَانَ عَلِيٌّ يَقْرَأُ بِهِمَا بِالْكُوفَةِ فَقَالَ أَبُو هُرَيْرَةَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِهِمَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Hatim bin Isma'il Al Madani] dari [Ja'far bin Muhammad] dari [Bapaknya] dari [ubaidhullah bin Abu Rafi'] ia berkata, \"Marwan mewakilkan kota Madinah kepada Abu Hurairah, pada suatu hari ia keluar menuju Makkah, kemudian di hari jum'at Abu Hurairah sholat bersama kami. Ia membaca surat Al Jumu'ah di raka'at pertama dan membaca IDZAA JAA`AKAL MUNAAFIQUUN di raka'at terakhir. \" ubaidhullah berkata, \"Ketika Abu Hurairah berlalu pergi aku menjumpainya dan bertanya, \"Engkau membaca dua surat yang pernah Ali baca di Kufah?\" [Abu Hurairah] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam membaca keduanya. \" "
            },
            {
                "number": 1076,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ أَنْبَأَنَا ضَمْرَةُ بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ قَالَكَتَبَ الضَّحَّاكُ بْنُ قَيْسٍ إِلَى النُّعْمَانِ بْنِ بَشِيرٍ أَخْبِرْنَا بِأَيِّ شَيْءٍ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ يَوْمَ الْجُمُعَةِ مَعَ سُورَةِ الْجُمُعَةِ قَالَ كَانَ يَقْرَأُ فِيهَا هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Sufyan] berkata, telah memberitakan kepada kami [Dlamrah bin Sa'id] dari [ubaidhullah bin Abdullah] berkata; Adl Dlahhak bin Qais menulis surat kepada [An Nu'man bin Basyir]; kabarkanlah kepada kami surat apa yang di baca Rasulullah shallallahu 'alaihi wasallam pada hari jum'at, selain surat Al Jumu'ah?\" ia menjawab, \"Di hari jum'at beliau membaca HAL ATAAKA HADIITSUL GHAASYIAH (Sudah datangkah kepadamu berita (tentang) hari pembalasan?) \""
            },
            {
                "number": 1077,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ سَعِيدِ بْنِ سِنَانٍ عَنْ أَبِي الزَّاهِرِيَّةِ عَنْ أَبِي عِنَبَةَ الْخَوْلَانِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الْجُمُعَةِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] dari [Sa'id bin Sinan] dari [Abu Az Zahiriyah] dari [Abu 'Inabah Al Khaulani] berkata, \"Nabi shallallahu 'alaihi wasallam pada hari jum'at membaca SABBIHISMA RABBIKAL A'LAA (Sucikanlah nama Tuhanmu Yang Maha Tinggi) dan HAL ATAAKA HADIITSUL GHAASYIAH (Sudah datangkah kepadamu berita (tentang) hari pembalasan?) \""
            },
            {
                "number": 1078,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا عُمَرُ بْنُ حَبِيبٍ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ وَسَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَدْرَكَ مِنْ الْجُمُعَةِ رَكْعَةً فَلْيَصِلْ إِلَيْهَا أُخْرَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Umar bin Habib] dari [Ibnu Abu Dzi`b] dari [Az Zuhri] dari [Abu Salamah] dan [Sa'id bin Musayyab] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mendapatkan sholat jum'at satu raka'at, maka hendaklah ia genapkan. \" "
            },
            {
                "number": 1079,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَهِشَامُ بْنُ عَمَّارٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَدْرَكَ مِنْ الصَّلَاةِ رَكْعَةً فَقَدْ أَدْرَكَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Hisyam bin Ammar] keduanya berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mendapatkan satu raka'at maka ia telah mendapatkannya. \""
            },
            {
                "number": 1080,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ حَدَّثَنَا يُونُسُ بْنُ يَزِيدَ الْأَيْلِيُّ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَدْرَكَ رَكْعَةً مِنْ صَلَاةِ الْجُمُعَةِ أَوْ غَيْرِهَا فَقَدْ أَدْرَكَ الصَّلَاةَ",
                "id": "Telah menceritakan kepada kami [Amru bin Utsman bin Sa'id bin Katsir bin Dinar Al Himshi] berkata, telah menceritakan kepada kami [Baqiyyah bin Walid] berkata, telah menceritakan kepada kami [Yunus bin Yazid Al Aili] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mendapatkan satu raka'at dari sholat jum'at atau selainnya, maka dia telah mendapatkan sholat. \""
            },
            {
                "number": 1081,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَإِنَّ أَهْلَ قُبَاءَ كَانُوا يُجَمِّعُونَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْجُمُعَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Sa'id bin Abi Maryam] dari [Abdullah bin Umar] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Penduduk Quba melaksanakan sholat jum'at bersama Rasulullah shallallahu 'alaihi wasallam pada hari jum'at. \""
            },
            {
                "number": 1082,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ وَيَزِيدُ بْنُ هَارُونَ وَمُحَمَّدُ بْنُ بِشْرٍ قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو حَدَّثَنِي عُبَيْدَةُ بْنُ سُفْيَانَ الْحَضْرَمِيُّ عَنْ أَبِي الْجَعْدِ الضَّمْرِيِّ وَكَانَ لَهُ صُحْبَةٌ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَرَكَ الْجُمُعَةَ ثَلَاثَ مَرَّاتٍ تَهَاوُنًا بِهَا طُبِعَ عَلَى قَلْبِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Idris] dan [Yazid bin Harun] dan [Muhammad bin Bisyr] mereka berkata; telah menceritakan kepada kami [Muhammad bin Amru] berkata; telah menceritakan kepadaku [Ubaidah bin Sufyan Al Hadlrami] dari [Abul Ja'd Ad Dlamri] -ia pernah bertemu Nabi shallallahu 'alaihi wasallam- Ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meninggalkan jum'at sebanyak tiga kali karena meremehkannya, maka hatinya akan ditutup. \""
            },
            {
                "number": 1083,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا زُهَيْرٌ عَنْ أَسِيدِ بْنِ أَبِي أَسِيدٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ عِيسَى الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ أَسِيدِ بْنِ أَبِي أَسِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَرَكَ الْجُمُعَةَ ثَلَاثًا مِنْ غَيْرِ ضَرُورَةٍ طَبَعَ اللَّهُ عَلَى قَلْبِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] berkata, telah menceritakan kepada kami [Abu Amir] berkata, telah menceritakan kepada kami [Zuhair] dari [Usaid bin Abu Asid]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Isa Al Mishri] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] dari [Ibnu Abu Dzi'b] dari [Asid bin Abu Asid] dari [Abdullah bin Abu Qatadah] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meninggalkan jum'at sebanyak tiga kali tanpa udzur, maka hatinya akan ditutup. \""
            },
            {
                "number": 1084,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مَعْدِيُّ بْنُ سُلَيْمَانَ حَدَّثَنَا ابْنُ عَجْلَانَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا هَلْ عَسَى أَحَدُكُمْ أَنْ يَتَّخِذَ الصُّبَّةَ مِنْ الْغَنَمِ عَلَى رَأْسِ مِيلٍ أَوْ مِيلَيْنِ فَيَتَعَذَّرَ عَلَيْهِ الْكَلَأُ فَيَرْتَفِعَ ثُمَّ تَجِيءُ الْجُمُعَةُ فَلَا يَجِيءُ وَلَا يَشْهَدُهَا وَتَجِيءُ الْجُمُعَةُ فَلَا يَشْهَدُهَا وَتَجِيءُ الْجُمُعَةُ فَلَا يَشْهَدُهَا حَتَّى يُطْبَعَ عَلَى قَلْبِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Ma'di bin Sulaiman] berkata, telah menceritakan kepada kami [Ibnu 'Ajlan] dari [Bapaknya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketahuilah, bisa jadi salah seorang dari kalian membawa sekawanan kambing di ujung (jarak) satu mil atau dua mil, kemudian rerumputan tidak ada sementara matahari semakin tinggi dan tibalah waktu jum'at. Namun ia tidak datang dan tidak menghadirinya, kemudian datang lagi jum'at berikutnya namun ia tidak menghadirinya, kemudian datang lagi jum'at berikutnya namun ia tidak menghadirinya, hingga hatinya ditutup. \""
            },
            {
                "number": 1085,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا نُوحُ بْنُ قَيْسٍ عَنْ أَخِيهِ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَرَكَ الْجُمُعَةَ مُتَعَمِّدًا فَلْيَتَصَدَّقْ بِدِينَارٍ فَإِنْ لَمْ يَجِدْ فَبِنِصْفِ دِينَارٍ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Nuh bin Qais] dari [Saudaranya] dari [Qatadah] dari [Al Hasan] dari [Samurah bin Jundab] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa meninggalkan sholat jum'at dengan sengaja hendaklah bersedekah dengan satu dinar, jika tidak mendapatkannya hendaklah dengan setengahnya. \""
            },
            {
                "number": 1086,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ رَبِّهِ حَدَّثَنَا بَقِيَّةُ عَنْ مُبَشِّرِ بْنِ عُبَيْدٍ عَنْ حَجَّاجِ بْنِ أَرْطَاةَ عَنْ عَطِيَّةَ الْعُوفِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْكَعُ قَبْلَ الْجُمُعَةِ أَرْبَعًا لَا يَفْصِلُ فِي شَيْءٍ مِنْهُنَّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Yazid bin Abdu Rabbih] berkata, telah menceritakan kepada kami [Baqiyyah] dari [Mubassyir bin Ubaid] dari [Hajjaj bin Arthah] dari [Atiyah Al 'Ufi] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat empat raka'at sebelum jum'at secara bersambung. \" "
            },
            {
                "number": 1087,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّهُ كَانَ إِذَا صَلَّى الْجُمُعَةَ انْصَرَفَ فَصَلَّى سَجْدَتَيْنِ فِي بَيْتِهِ ثُمَّ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Nafi'] dari [Abdullah bin Umar] Bahwasanya jika telah selesai sholat jum'at ia sholat dua raka'at di rumah, kemudian ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melakukan hal itu. \""
            },
            {
                "number": 1088,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Sufyan] dari [Amru] dari [Ibnu Syihab] dari [Salim] dari [Bapaknya] berkata, \"Nabi shallallahu 'alaihi wasallam sholat dua raka'at setelah sholat jum'at. \" "
            },
            {
                "number": 1089,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو السَّائِبِ سَلْمُ بْنُ جُنَادَةَ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّيْتُمْ بَعْدَ الْجُمُعَةِ فَصَلُّوا أَرْبَعًا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu As Sa`ib Salm bin Junadah] keduanya berkata; telah menceritakan kepada kami [Abdullah bin Idris] dari [Suhail bin Abu Shalih] dari [bapaknya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian telah selesai dari sholat jum'at, maka sholatlah empat raka'at. \""
            },
            {
                "number": 1090,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا ابْنُ لَهِيعَةَ جَمِيعًا عَنْ ابْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُحَلَّقَ فِي الْمَسْجِدِ يَوْمَ الْجُمُعَةِ قَبْلَ الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Hatim bin Isma'il]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Ibnu Lahi'ah] semuanya dari [Ibnu 'Ajlan] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] berkata, \"Pada hari jum'at Rasulullah shallallahu 'alaihi wasallam melarang membuat halaqah dalam masjid sebelum sholat jum'at selesai. \" "
            },
            {
                "number": 1091,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ عَنْ عَبْدِ اللَّهِ بْنِ وَاقِدٍ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الِاحْتِبَاءِ يَوْمَ الْجُمُعَةِ يَعْنِي وَالْإِمَامُ يَخْطُبُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Mushaffa Al Himshi] berkata, telah menceritakan kepada kami [Baqiyyah] dari [Abdullah bin Waqid] dari [Muhammad bin 'Ajlan] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam duduk ihtiba` di hari jum'at, yaitu ketika imam sedang berkhutbah. \""
            },
            {
                "number": 1092,
                "arab": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى الْقَطَّانُ حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ جَمِيعًا عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ الزُّهْرِيِّ عَنْ السَّائِبِ بْنِ يَزِيدَ قَالَمَا كَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مُؤَذِّنٌ وَاحِدٌ إِذَا خَرَجَ أَذَّنَ وَإِذَا نَزَلَ أَقَامَ وَأَبُو بَكْرٍ وَعُمَرُ كَذَلِكَفَلَمَّا كَانَ عُثْمَانُ وَكَثُرَ النَّاسُ زَادَ النِّدَاءَ الثَّالِثَ عَلَى دَارٍ فِي السُّوقِ يُقَالُ لَهَا الزَّوْرَاءُ فَإِذَا خَرَجَ أَذَّنَ وَإِذَا نَزَلَ أَقَامَ",
                "id": "Telah menceritakan kepada kami [Yusuf Al Qaththan] berkata, telah menceritakan kepada kami [Jarir]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abdullah bin Sa'id] berkata, telah menceritakan kepada kami [Abu Khalid Al Ahmar] semuanya dari [Muhammad bin Ishaq] dari [Az Zuhri] dari [As Sa`ib bin Yazid] ia berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam hanya ada satu adzan, jika beliau keluar adzan dikumandangkan, dan jika beliau turun (dari mimbar) iqamah dikumandangkan. Demikian juga pada masa Abu Bakar dan Umar. Ketika masa Utsman orang-orang semakin banyak, lalu ia menambahkan adzan yang ketiga di suatu rumah di pasar yang disebut Zaura`. Jika ia keluar, adzan dikumandangkan dan jika ia turun (dari mimbar) iqamah dikumandangkan. \""
            },
            {
                "number": 1093,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا الْهَيْثَمُ بْنُ جَمِيلٍ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ أَبَانَ بْنِ تَغْلِبَ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ أَبِيهِ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ عَلَى الْمِنْبَرِ اسْتَقْبَلَهُ أَصْحَابُهُ بِوُجُوهِهِمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Haitsam bin Jamil] berkata, telah menceritakan kepada kami [Ibnu Mubarak] dari [Aban bin Taghlib] dari ['Adiy bin Tsabit] dari [Bapaknya] ia berkata, \"Jika Nabi shallallahu 'alaihi wasallam bangun dari mimbar, maka para sahabat menyambutnya dengan wajah-wajah mereka. \""
            },
            {
                "number": 1094,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فِي الْجُمُعَةِ سَاعَةً لَا يُوَافِقُهَا رَجُلٌ مُسْلِمٌ قَائِمٌ يُصَلِّي يَسْأَلُ اللَّهَ فِيهَا خَيْرًا إِلَّا أَعْطَاهُ وَقَلَّلَهَا بِيَدِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Sufyan bin Uyainah] dari [Ayyub] dari [Muhammad bin Sirin] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya pada hari jum'at ada satu waktu, tidaklah seorang muslim berdiri sholat dan meminta kebaikan kepada Allah pada waktu itu, kecuali Ia akan mengabulkannya, \" dan beliau mensedikitkan waktu itu dengan isyarat tangan. \""
            },
            {
                "number": 1095,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ حَدَّثَنَا كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ الْمُزَنِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي يَوْمِ الْجُمُعَةِ سَاعَةٌ مِنْ النَّهَارِ لَا يَسْأَلُ اللَّهَ فِيهَا الْعَبْدُ شَيْئًا إِلَّا أُعْطِيَ سُؤْلَهُ قِيلَ أَيُّ سَاعَةٍ قَالَ حِينَ تُقَامُ الصَّلَاةُ إِلَى الِانْصِرَافِ مِنْهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Khalid bin Makhlad] berkata, telah menceritakan kepada kami [Katsir bin Abdullah bin Amru bin Auf Al Muzani] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam mengatakan tentang hari jum'at: \"Satu waktu pada siang hari di hari jum'at, tidaklah seorang hamba berdiri memohon sesuatu kepada Allah di dalamnya melainkan Ia akan mengabulkan permintaannya. \" Ditanyakan kepada beliau, \"Kapan itu?\" beliau menjawab: \"Ketika sholat didirikan hingga selesai. \" "
            },
            {
                "number": 1096,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ عَنْ أَبِي النَّضْرِ عَنْ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ سَلَامٍ قَالَقُلْتُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسٌ إِنَّا لَنَجِدُ فِي كِتَابِ اللَّهِ فِي يَوْمِ الْجُمُعَةِ سَاعَةً لَا يُوَافِقُهَا عَبْدٌ مُؤْمِنٌ يُصَلِّي يَسْأَلُ اللَّهَ فِيهَا شَيْئًا إِلَّا قَضَى لَهُ حَاجَتَهُ قَالَ عَبْدُ اللَّهِ فَأَشَارَ إِلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ بَعْضُ سَاعَةٍ فَقُلْتُ صَدَقْتَ أَوْ بَعْضُ سَاعَةٍ قُلْتُ أَيُّ سَاعَةٍ هِيَ قَالَ هِيَ آخِرُ سَاعَاتِ النَّهَارِ قُلْتُ إِنَّهَا لَيْسَتْ سَاعَةَ صَلَاةٍ قَالَ بَلَى إِنَّ الْعَبْدَ الْمُؤْمِنَ إِذَا صَلَّى ثُمَّ جَلَسَ لَا يَحْبِسُهُ إِلَّا الصَّلَاةُ فَهُوَ فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim Ad Dimasyqi] berkata, telah menceritakan kepada kami [Ibnu Abu Fudaik] dari [Adl Dlahhak bin Utsman] dari [Abu An Nadlrah] dari [Abu Salamah] dari [Abdullah bin Salam] berkata; Aku bertanya sementara Rasulullah shallallahu 'alaihi wasallam sedang duduk, \"Dalam Kitabullah kami mendapati satu waktu di hari jum'at, tidaklah seorang mukmin pada waktu itu berdiri sholat dan meminta sesuatu kepada Allah, kecuali Ia akan memenuhinya. \" Abdullah berkata, \"Rasulullah shallallahu 'alaihi wasallam berisyarat kepadaku; \"atau sebagian waktu, \" lalu aku berkata, \"Engkau benar, atau sebagian waktu. Aku tanyakan, \"Kapan waktu itu?\" ia menjawab, \"Di akhir waktu siang hari. \" Aku bertanya, \"Bukankah itu waktu sholat?\" ia menjawab, \"Benar, sesungguhnya seorang hamba yang beriman apabila sholat kemudian duduk, dan tidak ada yang menahannya untuk duduk kecuali karena menunggu sholat, maka ia adalah hitungan sholat. \""
            },
            {
                "number": 1097,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْحَقُ بْنُ سُلَيْمَانَ أَبُو يَحْيَى الرَّازِيُّ عَنْ مُغِيرَةَ بْنِ زِيَادٍ عَنْ عَطَاءٍ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ثَابَرَ عَلَى ثِنْتَيْ عَشْرَةَ رَكْعَةً مِنْ السُّنَّةِ بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ أَرْبَعٍ قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ بَعْدَ الظُّهْرِ وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ وَرَكْعَتَيْنِ قَبْلَ الْفَجْرِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ishaq bin Sulaiman Abu Yahya Ar Razi] dari [Mughirah bin Ziyad] dari ['Atho`] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjaga dua belas raka'at sholat sunnah maka akan dibangunkan baginya rumah di surga; empat raka'at sebelum zhuhur, dua raka'at setelah zhuhur, dua raka'at setelah maghrib, dua raka'at setelah isya dan dua raka'at sebelum fajar. \""
            },
            {
                "number": 1098,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ عَنْ أُمِّ حَبِيبَةَ بِنْتِ أَبِي سُفْيَانَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى فِي يَوْمٍ وَلَيْلَةٍ ثِنْتَيْ عَشْرَةَ رَكْعَةً بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah memberitakan kepada kami [Isma'il bin Abu Kholid] dari [Al Musayyab bin Rafi'] dari [Anbasah bin Abu Sufyan] dari [Ummu Habibah binti Abu Sufyan] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa sholat dua belas raka'at (sholat sunnah) dalam sehari semalam maka akan dibangunkan baginya rumah di surga. \""
            },
            {
                "number": 1099,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ بْنِ الْأَصْبَهَانِيِّ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى فِي يَوْمٍ ثِنْتَيْ عَشْرَةَ رَكْعَةً بُنِيَ لَهُ بَيْتٌ فِي الْجَنَّةِ رَكْعَتَيْنِ قَبْلَ الْفَجْرِ وَرَكْعَتَيْنِ قَبْلَ الظُّهْرِ وَرَكْعَتَيْنِ بَعْدَ الظُّهْرِ وَرَكْعَتَيْنِ أَظُنُّهُ قَالَ قَبْلَ الْعَصْرِ وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ أَظُنُّهُ قَالَ وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ الْآخِرَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Sulaiman bin Al Ashbahani] dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam \"Barangsiapa sholat dalam sehari sebanyak dua belas raka'at, maka akan dibangunkan baginya rumah di surga; dua raka'at sebelum fajar, dua raka'at setelah zhuhur, dua raka'at setelah zhuhur, dua raka'at, aku menduga bahwa beliau mengatakan: \"sebelum ashar, dua raka'at setelah maghrib, dan aku menduga beliau mengatakan: \"dan dua raka'at setelah isya yang akhir. \""
            },
            {
                "number": 1100,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَضَاءَ لَهُ الْفَجْرُ صَلَّى رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Amru bin Dinar] dari [Ibnu Umar] berkata, \"Jika fajar telah meneranginya, Nabi shallallahu 'alaihi wasallam sholat dua raka'at. \" "
            },
            {
                "number": 1101,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَنَسِ بْنِ سِيرِينَ عَنْ ابْنِ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الرَّكْعَتَيْنِ قَبْلَ الْغَدَاةِ كَأَنَّ الْأَذَانَ بِأُذُنَيْهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdah] berkata, telah memberitakan kepada kami [Hammad bin Zaid] dari [Anas bin Sirin] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat dua raka'at sebelum subuh, seakan-akan adzan di kedua telinganya (tidak terlalu lama). \""
            },
            {
                "number": 1102,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ بِنْتِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا نُودِيَ لِصَلَاةِ الصُّبْحِ رَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ قَبْلَ أَنْ يَقُومَ إِلَى الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Nafi'] dari [Ibnu Umar] dari [Hafsh binti Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam jika diseru untuk melaksanakan sholat subuh, beliau sholat dua raka'at dengan ringan sebelum pergi sholat. \""
            },
            {
                "number": 1103,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَوَضَّأَ صَلَّى رَكْعَتَيْنِ ثُمَّ خَرَجَ إِلَى الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abul Ahwash] dari [Abu Ishaq] dari [Al Aswad] dari [Aisyah] ia berkata, \"Jika berwudlu Nabi shallallahu 'alaihi wasallam sholat dua raka'at, kemudian berangkat sholat. \""
            },
            {
                "number": 1104,
                "arab": "حَدَّثَنَا الْخَلِيلُ بْنُ عَمْرٍو أَبُو عَمْرٍو حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الرَّكْعَتَيْنِ عِنْدَ الْإِقَامَةِ",
                "id": "Telah menceritakan kepada kami [Al Khalil bin Amru Abu Amru] berkata, telah menceritakan kepada kami [Syarik] dari [Abu Ishaq] dari [Al Harits] dari [Ali] ia berkata \"Nabi shallallahu 'alaihi wasallam sholat dua raka'at menjelang iqamah. \" "
            },
            {
                "number": 1105,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ وَيَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَا حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ عَنْ يَزِيدَ بْنِ كَيْسَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ فِي الرَّكْعَتَيْنِ قَبْلَ الْفَجْرِ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim Ad Dimasyqi] dan [Ya'qub bin Humaid bin Kasib] keduanya berkata; telah menceritakan kepada kami [Marwan bin Mu'awiyah] dari [Yazid bin Kaisan] dari [Abu Hazim] dari [Abu Hurairah] berkata, \"Nabi shallallahu 'alaihi wasallam membaca QUL YAA AYYUHAL KAAFIRUUN dan QUL HUWA ALLAHU AHAD pada dua raka'at sebelum fajar. \""
            },
            {
                "number": 1106,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ وَمُحَمَّدُ بْنُ عُبَادَةَ الْوَاسِطِيَّانِ قَالَا حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ قَالَرَمَقْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهْرًا فَكَانَ يَقْرَأُ فِي الرَّكْعَتَيْنِ قَبْلَ الْفَجْرِ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sinan] dan [Muhammad bin Ubadah Al Wasithiyani] keduanya berkata; telah menceritakan kepada kami [Abu Ahmad] berkata, telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Mujahid] dari [Ibnu Umar] ia berkata, \"Aku selalu memperhatikan Nabi shallallahu 'alaihi wasallam selama satu bulan, beliau membaca QUL YAA AYYUHAL KAAFIRUUN dan QUL HUWA ALLAHU AHAD pada dua raka'at sebelum fajar. \""
            },
            {
                "number": 1107,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا الْجُرَيْرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي رَكْعَتَيْنِ قَبْلَ الْفَجْرِ وَكَانَ يَقُولُ نِعْمَ السُّورَتَانِ هُمَا يُقْرَأُ بِهِمَا فِي رَكْعَتَيْ الْفَجْرِ قُلْ هُوَ اللَّهُ أَحَدٌ وَقُلْ يَا أَيُّهَا الْكَافِرُونَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah menceritakan kepada kami [Al Jurairi] dari [Abdullah bin Syaqiq] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat dua raka'at sebelum fajar. Beliau mengatakan: \"Itu adalah dua surat yang paling baik, ia dibaca pada dua raka'at sebelum subuh; QUL HUWA ALLAHU AHAD dan QUL YAA AYYUHAL KAAFIRUUN. \""
            },
            {
                "number": 1108,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَزْهَرُ بْنُ الْقَاسِمِ ح و حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ قَالَا حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَقَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أُقِيمَتْ الصَّلَاةُ فَلَا صَلَاةَ إِلَّا الْمَكْتُوبَةُحَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] berkata, telah menceritakan kepada kami [Azhar Ibnul Qasim]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Bakr bin Khalaf Abu Bisyr] berkata, telah menceritakan kepada kami [Rauh bin Ubadah] keduanya berkata; telah menceritakan kepada kami [Zakaria bin Ishaq] dari [Amru bin Dinar] dari ['Atho` bin Yasar] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika iqamah telah dikumandangkan maka tidak ada sholat kecuali sholat wajib. \" Telah menceritakan kepada kami [Mahmud bin Ghailan] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Amru bin Dinar] dari ['Atho` bin Yasar] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits. \""
            },
            {
                "number": 1109,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ عَاصِمٍ عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يُصَلِّي الرَّكْعَتَيْنِ قَبْلَ صَلَاةِ الْغَدَاةِ وَهُوَ فِي الصَّلَاةِ فَلَمَّا صَلَّى قَالَ لَهُ بِأَيِّ صَلَاتَيْكَ اعْتَدَدْتَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari ['Ashim] dari [Abdullah bin Sarjis] berkata, \"Ketika sedang melaksanakan sholat Rasulullah shallallahu 'alaihi wasallam melihat seorang laki-laki sholat dua raka'at sebelum subuh. Ketika selesai sholat, beliau bertanya kepadanya: \"sholat mana yang sudah kamu persiapkan?\""
            },
            {
                "number": 1110,
                "arab": "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ أَبِيهِ عَنْ حَفْصِ بْنِ عَاصِمٍ عَنْ عَبْدِ اللَّهِ بْنِ مَالِكِ بْنِ بُحَيْنَةَ قَالَمَرَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ وَقَدْ أُقِيمَتْ صَلَاةُ الصُّبْحِ وَهُوَ يُصَلِّي فَكَلَّمَهُ بِشَيْءٍ لَا أَدْرِي مَا هُوَ فَلَمَّا انْصَرَفَ أَحَطْنَا بِهِ نَقُولُ لَهُ مَاذَا قَالَ لَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ لِي يُوشِكُ أَحَدُكُمْ أَنْ يُصَلِّيَ الْفَجْرَ أَرْبَعًا",
                "id": "Telah menceritakan kepada kami [Abu Marwan bin Utsman Al Utsmani] berkata, telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Bapaknya] dari [Hafsh bin Ashim] dari [Abdullah bin Malik bin Buhainah] berkata, \"Nabi shallallahu 'alaihi wasallam melewati seorang laki-laki yang sedang mengerjakan sholat padahal iqamah telah dikumandangkan, maka beliau pun berbicara dengannya, namun aku tidak tahu apa yang beliau perbincangkan. Ketika sholat telah selesai, kami mengerumuni seraya bertanya kepadanya, \"Apa yang dikatakan Rasulullah shallallahu 'alaihi wasallam kepadamu?\" ia menjawab, \"Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Hampir-hampir salah seorang dari kalian sholat subuh empat raka'at. \""
            },
            {
                "number": 1111,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ حَدَّثَنَا سَعْدُ بْنُ سَعِيدٍ حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ عَنْ قَيْسِ بْنِ عَمْرٍو قَالَرَأَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يُصَلِّي بَعْدَ صَلَاةِ الصُّبْحِ رَكْعَتَيْنِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَلَاةَ الصُّبْحِ مَرَّتَيْنِ فَقَالَ لَهُ الرَّجُلُ إِنِّي لَمْ أَكُنْ صَلَّيْتُ الرَّكْعَتَيْنِ اللَّتَيْنِ قَبْلَهُمَا فَصَلَّيْتُهُمَا قَالَ فَسَكَتَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Numair] berkata, telah menceritakan kepada kami [Sa'd bin Sa'id] berkata, telah menceritakan kepadaku [Muhammad bin Ibrahim] dari [Qais bin Amru] ia berkata, \"Nabi shallallahu 'alaihi wasallam melihat seorang laki-laki sholat dua raka'at setelah subuh, maka Nabi shallallahu 'alaihi wasallam pun bertanya kepadanya: \"Apakah ada sholat subuh dikerjakan dua kali! \" laki-laki itu menjawab, \"Aku belum mengerjakan dua raka'at sebelum subuh, maka aku mengerjakannya, \" Nabi shallallahu 'alaihi wasallam pun diam. \""
            },
            {
                "number": 1112,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ وَيَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَا حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ عَنْ يَزِيدَ بْنِ كَيْسَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَامَ عَنْ رَكْعَتَيْ الْفَجْرِ فَقَضَاهُمَا بَعْدَ مَا طَلَعَتْ الشَّمْسُ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim] dan [Ya'qub bin Humaid bin Kasib] keduanya berkata; telah menceritakan kepada kami [Marwan bin Mu'awiyah] dari [Yazid bin Kaisan] dari [Abu Hazim] dari [Abu Hurairah] berkata, \"Nabi shallallahu 'alaihi wasallam tertidur hingga tidak mengerjakan dua raka'at sebelum subuh, lalu beliau mengqadla keduanya setelah matahari terbit. \""
            },
            {
                "number": 1113,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ قَابُوسَ عَنْ أَبِيهِ قَالَأَرْسَلَ أَبِي إِلَى عَائِشَةَ أَيُّ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ أَحَبَّ إِلَيْهِ أَنْ يُوَاظِبَ عَلَيْهَا قَالَتْ كَانَ يُصَلِّي أَرْبَعًا قَبْلَ الظُّهْرِ يُطِيلُ فِيهِنَّ الْقِيَامَ وَيُحْسِنُ فِيهِنَّ الرُّكُوعَ وَالسُّجُودَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Jarir] dari [Qabus] dari [Bapaknya] berkata; Bapakku mengutus seseorang untuk bertanya kepada ['Aisyah]; sholat apa yang paling disukai oleh Rasulullah shallallahu 'alaihi wasallam untuk dijadikan sebagai kebiasaan?\" 'Aisyah menjawab, \"Beliau suka mengerjakan empat raka'at sebelum zhuhur, dengan memanjangkan berdiri dan membaguskan rukuk dan sujudnya. \""
            },
            {
                "number": 1114,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ عُبَيْدَةَ بْنِ مُعَتِّبٍ الضَّبِّيِّ عَنْ إِبْرَاهِيمَ عَنْ سَهْمِ بْنِ مِنْجَابٍ عَنْ قَزَعَةَ عَنْ قَرْثَعٍ عَنْ أَبِي أَيُّوبَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي قَبْلَ الظُّهْرِ أَرْبَعًا إِذَا زَالَتْ الشَّمْسُ لَا يَفْصِلُ بَيْنَهُنَّ بِتَسْلِيمٍ وَقَالَ إِنَّ أَبْوَابَ السَّمَاءِ تُفْتَحُ إِذَا زَالَتْ الشَّمْسُ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Ubaidah bin Mu'attib Adl Dlabbi] dari [Ibrahim] dari [Sahm bin Minjab] dari [Qaza'ah] dari [Qartsa'] dari [Abu Ayyub] berkata, \"Nabi shallallahu 'alaihi wasallam melaksanakan sholat sebelum zhuhur empat raka'at apabila matahari telah bergeser, dengan tidak memisahkan antara raka'at dengan salam. Beliau bersabda: \"Sesungguhnya pintu-pintu langit dibuka apabila matahari sudah tergelincir. \""
            },
            {
                "number": 1115,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَزَيْدُ بْنُ أَخْزَمَ وَمُحَمَّدُ بْنُ مَعْمَرٍ قَالُوا حَدَّثَنَا مُوسَى بْنُ دَاوُدَ الْكُوفِيُّ حَدَّثَنَا قَيْسُ بْنُ الرَّبِيعِ عَنْ شُعْبَةَ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا فَاتَتْهُ الْأَرْبَعُ قَبْلَ الظُّهْرِ صَلَّاهَا بَعْدَ الرَّكْعَتَيْنِ بَعْدَ الظُّهْرِقَالَ أَبُو عَبْد اللَّهِ لَمْ يُحَدِّثْ بِهِ إِلَّا قَيْسٌ عَنْ شُعْبَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] dan [Zaid bin Akhzam] dan [Muhammad bin Ma'mar] keduanya berkata; telah menceritakan kepada kami [Musa bin Dawud Al Kufi] berkata, telah menceritakan kepada kami [Qais bin Ar Rabi'] dari [Syu'bah] dari [Khalid Al Hadda] dari [Abdullah bin Syaqiq] dari ['Aisyah] ia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam tidak sempat mengerjakan empat raka'at sebelum zhuhur, beliau menggantinya dengan dua raka'at setelah mengerjakan dua raka'at ba'diah zhuhur. \" Abu Abdullah berkata, \"Tidak ada yang meriwayatkannya kecuali Qais, dari Syu'bah. \""
            },
            {
                "number": 1116,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ قَالَأَرْسَلَ مُعَاوِيَةُ إِلَى أُمِّ سَلَمَةَ فَانْطَلَقْتُ مَعَ الرَّسُولِ فَسَأَلَ أُمَّ سَلَمَةَ فَقَالَتْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَمَا هُوَ يَتَوَضَّأُ فِي بَيْتِي لِلظُّهْرِ وَكَانَ قَدْ بَعَثَ سَاعِيًا وَكَثُرَ عِنْدَهُ الْمُهَاجِرُونَ وَقَدْ أَهَمَّهُ شَأْنُهُمْ إِذْ ضُرِبَ الْبَابُ فَخَرَجَ إِلَيْهِ فَصَلَّى الظُّهْرَ ثُمَّ جَلَسَ يَقْسِمُ مَا جَاءَ بِهِ قَالَتْ فَلَمْ يَزَلْ كَذَلِكَ حَتَّى الْعَصْرِ ثُمَّ دَخَلَ مَنْزِلِي فَصَلَّى رَكْعَتَيْنِ ثُمَّ قَالَ شَغَلَنِي أَمْرُ السَّاعِي أَنْ أُصَلِّيَهُمَا بَعْدَ الظُّهْرِ فَصَلَّيْتُهُمَا بَعْدَ الْعَصْرِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Idris] dari [Yazid bin Abu Ziyad] dari [Abdullah Ibnul Harits] ia berkata, \"Mu'awiyah mengutus seorang utusan menemui Ummu Salamah, maka aku ikut pergi bersama utusan tersebut. Utusan itu bertanya kepada Ummu Salamah, lalu [Ummu Salamah] pun menjawab, \"Ketika Rasulullah shallallahu 'alaihi wasallam berwudlu di rumahku untuk sholat zhuhur, beliau telah mengirim para pengambil zakat, di sisi beliau juga banyak sahabat Muhajirin hingga persoalan mereka menjadikan beliau sibuk. Ketika pintu diketuk beliau keluar dan sholat zhuhur, kemudian beliau duduk dan membagikan harta zakat yang datang kepada beliau. \" Ummu Salamah berkata, \"Beliau masih tersibukkan dengan hal itu hingga datang waktu ashar, setelah itu beliau masuk ke dalam rumahku dan sholat dua raka'at. Beliau kemudian bersabda: \"Persoalan petugas zakat itu telah menyibukkan aku dari mengerjakan dua raka'at setelah zhuhur, maka aku mengerjakannya setelah ashar. \""
            },
            {
                "number": 1117,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الشُّعَيْثِيُّ عَنْ أَبِيهِ عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ عَنْ أُمِّ حَبِيبَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى قَبْلَ الظُّهْرِ أَرْبَعًا وَبَعْدَهَا أَرْبَعًا حَرَّمَهُ اللَّهُ عَلَى النَّارِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah menceritakan kepada kami [Muhammad bin Abdullah Asy Syu'aitsi] dari [Bapaknya] dari [Anbasah bin Abu Sufyan] dari [Ummu Habibah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa sholat sebelum zhuhur empat raka'at dan setelahnya empat raka'at, maka Allah mengharamkannya masuk neraka. \""
            },
            {
                "number": 1118,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ وَأَبِي وَإِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ السَّلُولِيِّ قَالَسَأَلْنَا عَلِيًّا عَنْ تَطَوُّعِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالنَّهَارِ فَقَالَ إِنَّكُمْ لَا تُطِيقُونَهُ فَقُلْنَا أَخْبِرْنَا بِهِ نَأْخُذْ مِنْهُ مَا اسْتَطَعْنَا قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى الْفَجْرَ يُمْهِلُ حَتَّى إِذَا كَانَتْ الشَّمْسُ مِنْ هَا هُنَا يَعْنِي مِنْ قِبَلِ الْمَشْرِقِ بِمِقْدَارِهَا مِنْ صَلَاةِ الْعَصْرِ مِنْ هَا هُنَا يَعْنِي مِنْ قِبَلِ الْمَغْرِبِ قَامَ فَصَلَّى رَكْعَتَيْنِ ثُمَّ يُمْهِلُ حَتَّى إِذَا كَانَتْ الشَّمْسُ مِنْ هَا هُنَا يَعْنِي مِنْ قِبَلِ الْمَشْرِقِ مِقْدَارَهَا مِنْ صَلَاةِ الظُّهْرِ مِنْ هَا هُنَا قَامَ فَصَلَّى أَرْبَعًا وَأَرْبَعًا قَبْلَ الظُّهْرِ إِذَا زَالَتْ الشَّمْسُ وَرَكْعَتَيْنِ بَعْدَهَا وَأَرْبَعًا قَبْلَ الْعَصْرِ يَفْصِلُ بَيْنَ كُلِّ رَكْعَتَيْنِ بِالتَّسْلِيمِ عَلَى الْمَلَائِكَةِ الْمُقَرَّبِينَ وَالنَّبِيِّينَ وَمَنْ تَبِعَهُمْ مِنْ الْمُسْلِمِينَ وَالْمُؤْمِنِينَ قَالَ عَلِيٌّ فَتِلْكَ سِتَّ عَشْرَةَ رَكْعَةً تَطَوُّعُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالنَّهَارِ وَقَلَّ مَنْ يُدَاوِمُ عَلَيْهَاقَالَ وَكِيعٌ زَادَ فِيهِ أَبِي فَقَالَ حَبِيبُ بْنُ أَبِي ثَابِتٍ يَا أَبَا إِسْحَقَ مَا أُحِبُّ أَنَّ لِي بِحَدِيثِكَ هَذَا مِلْءَ مَسْجِدِكَ هَذَا ذَهَبًا",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Sufyan] dan [Bapakku] dan [Isra'il] dari [Abu Ishaq] dari [Ashim bin Dlamrah As Saluli] ia berkata, \"Kami bertanya kepada [Ali] tentang sholat sunnah Rasulullah shallallahu 'alaihi wasallam di waktu siang hari, \" Ali pun menjawab, \"Kalian tidak akan sanggup, \" kami berkata, \"Kabarkanlah, kami akan melakukan semampunya, \" Ali berkata, \"Kebiasaan Nabi shallallahu 'alaihi wasallam apabila hendak melaksanakan sholat fajar (shubuh), beliau menundanya sehingga apabila matahari terbit dari arah sini yaitu dari arah timur, ukurannya seperti sholat Ashar ketika matahari dari arah sini yaitu dari arah barat, maka beliau melaksanakan sholat dua rakaat. Kemudian beliau menunda sehingga apabila matahari terbit dari arah sini yaitu dari arah timur, ukurannya jika dari sholat Dzuhur dari arah sini yaitu dari arah barat, kemudian beliau melaksanakan sholat sunnah empat rakaat, dan empat rakaat sebelum dzuhur apabila matahari telah tergelincir, dan sholat dua rakaat setelah sholat dzuhur, kemudian beliau melaksanakan sholat sunnah sebelum sholat Ashar empat rakaat pada setiap dua rakaat dipisah dengan salam kepada para Malaikat, para Nabi serta orang-orang yang mengikuti mereka dari kaum muslimin dan mukminin.\" Ashim berkata; Ali berkata; \"Itulah enam belas raka'at sholat sunnahnya Nabi shallallahu 'alaihi wasallam di siang hari dan sangat sedikit orang mampu menekuninya.\" Waki' berkata; dalam hadits ini bapakku menambahkan; Habib Bin Abu Tsabit berkata; wahai Abu Ishaq \"Wahai Abu Ishaq aku tidak menyukai kalau saja masjidmu di penuhi dengan emas kalau dibandingkan dengan haditsmu ini.\""
            },
            {
                "number": 1119,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ وَوَكِيعٌ عَنْ كَهْمَسٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ قَالَهَا ثَلَاثًا قَالَ فِي الثَّالِثَةِ لِمَنْ شَاءَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Usamah] dan [Waki'] dari [Kahmas] berkata, telah menceritakan kepada kami [Abdullah bin Buraidah] dari [Abdullah bin Mughaffal] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Antara dua adzan ada sholat, beliau ucapkan itu hingga tiga kali, dan pada kali ketiganya beliau mengatakan: \"Bagi yang mau. \""
            },
            {
                "number": 1120,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عَلِيَّ بْنَ زَيْدِ بْنِ جُدْعَانَ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُإِنْ كَانَ الْمُؤَذِّنُ لَيُؤَذِّنُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَرَى أَنَّهَا الْإِقَامَةُ مِنْ كَثْرَةِ مَنْ يَقُومُ فَيُصَلِّي الرَّكْعَتَيْنِ قَبْلَ الْمَغْرِبِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] berkata; Aku mendengar [Ali bin Zaid bin Jud'an] berkata; Aku mendengar [Anas bin Malik] berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam, ketika seorang mu`adzin mengumandangkan adzan maka kami mengira kalau itu adalah iqamah karena banyaknya orang yang melakukannya (sholat sunnah). Lalu ia sholat dua raka'at sebelum maghrib. \""
            },
            {
                "number": 1121,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ حَدَّثَنَا هُشَيْمٌ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الْمَغْرِبَ ثُمَّ يَرْجِعُ إِلَى بَيْتِي فَيُصَلِّي رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim Ad Dauraqi] berkata, telah menceritakan kepada kami [Husyaim] dari [Khalid Al Hadda] dari [Abdullah bin Syaqiq] dari ['Aisyah] ia berkata, \"Nabi shallallahu 'alaihi wasallam sholat maghrib kemudian kembali ke rumahku dan mengerjakan sholat dua raka'at. \""
            },
            {
                "number": 1122,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ الضَّحَّاكِ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ عَنْ مَحْمُودِ بْنِ لَبِيدٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَنِي عَبْدِ الْأَشْهَلِ فَصَلَّى بِنَا الْمَغْرِبَ فِي مَسْجِدِنَا ثُمَّ قَالَ ارْكَعُوا هَاتَيْنِ الرَّكْعَتَيْنِ فِي بُيُوتِكُمْ",
                "id": "Telah menceritakan kepada kami [Abdul Wahhab bin Adl Dlahhak] berkata, telah menceritakan kepada kami [Isma'il bin 'Ayyasy] dari [Muhammad bin Ishaq] dari ['Ashim bin Umar bin Qatadah] dari [Mahmud bin Labid] dari [Rafi' bin Khadij] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mendatangi kami di Bani Abdul Asyhal, beliau sholat maghrib bersama kami di masjid kami, kemudian beliau bersabda: \"Laksanakanlah dua raka'at ini di rumah-rumah kalian. \""
            },
            {
                "number": 1123,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ وَاقِدٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُؤَمَّلِ بْنِ الصَّبَّاحِ حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ قَالَا حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الْوَلِيدِ حَدَّثَنَا عَاصِمُ بْنُ بَهْدَلَةَ عَنْ زِرٍّ وَأَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الرَّكْعَتَيْنِ بَعْدَ صَلَاةِ الْمَغْرِبِ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Al Azhar] berkata, telah menceritakan kepada kami ['Abdurrahman bin Waqid]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Mu`ammal bin Ash Shabbah] berkata, telah menceritakan kepada kami [Badal bin Muhabbar] keduanya berkata; telah menceritakan kepada kami [Abdul Malik bin Al Walid] berkata, telah menceritakan kepada kami ['Ashim bin Bahdalah] dari [Zir] dan [Abu Wa`il] dari [Abdullah bin Mas'ud] berkata, \"Nabi shallallahu 'alaihi wasallam selalu membaca di dua rakaat setelah maghrib QUL YAA AYYUHAL KAAFIRUUN (Katakanlah: \"Hai orang-orang kafir) dan QUL HUWA ALLAHU AHAD (Katakanlah: \"Dia-lah Allah, Yang Maha Esa). \""
            },
            {
                "number": 1124,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو الْحُسَيْنِ الْعُكْلِيُّ أَخْبَرَنِي عُمَرُ بْنُ أَبِي خَثْعَمٍ الْيَمَامِيُّ أَنْبَأَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَلَّى بَعْدَ الْمَغْرِبِ سِتَّ رَكَعَاتٍ لَمْ يَتَكَلَّمْ بَيْنَهُنَّ بِسُوءٍ عُدِلْنَ لَهُ بِعِبَادَةِ ثِنْتَيْ عَشْرَةَ سَنَةً",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Abul Husain Al 'Ukli] berkata, telah mengabarkan kepadaku [Umar bin Abu Khats'am Al Yamami] berkata, telah memberitakan kepada kami [Yahya bin Abu Katsir] dari [Abu Salamah bin 'Abdurrahman bin 'Auf] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa sholat setelah maghrib enam raka'at, ia tidak berbicara di sela-sela raka'at itu dengan perkataan jelek, maka ia seperti mengerjakan sholat dua belas raka'at selama setahun. \" "
            },
            {
                "number": 1125,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عَبْدِ اللَّهِ بْنِ رَاشِدٍ الزَّوْفِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُرَّةَ الزَّوْفِيِّ عَنْ خَارِجَةَ بْنِ حُذَافَةَ الْعَدَوِيِّ قَالَخَرَجَ عَلَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ اللَّهَ قَدْ أَمَدَّكُمْ بِصَلَاةٍ لَهِيَ خَيْرٌ لَكُمْ مِنْ حُمُرِ النَّعَمِ الْوِتْرُ جَعَلَهُ اللَّهُ لَكُمْ فِيمَا بَيْنَ صَلَاةِ الْعِشَاءِ إِلَى أَنْ يَطْلُعَ الْفَجْرُ",
                "id": "Telah menceritakan kepada kami [Muhmmad bin Rumh Al Mishri] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Yazid bin Abu Habib] dari [Abdullah bin Rasyid Az Zaufi] dari [Abdullah bin Abu Murrah Az Zaufi] dari [Kharijah bin Hudzafah Al 'Adawi] ia berkata \"Nabi shallallahu 'alaihi wasallam mengunjungi kami, lalu beliau bersabda: \"Sesungguhnya Allah telah menetapkan bagi kalian sholat yang lebih baik kalian dari pada unta merah, yakni sholat witir. sholat tersebut Allah jadikan bagi kalian antara sholat isya hingga terbit fajar. \""
            },
            {
                "number": 1126,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ السَّلُولِيِّ قَالَ قَالَ عَلِيُّ بْنُ أَبِي طَالِبٍإِنَّ الْوِتْرَ لَيْسَ بِحَتْمٍ وَلَا كَصَلَاتِكُمْ الْمَكْتُوبَةِ وَلَكِنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْتَرَ ثُمَّ قَالَ يَا أَهْلَ الْقُرْآنِ أَوْتِرُوا فَإِنَّ اللَّهَ وِتْرٌ يُحِبُّ الْوِتْرَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Muhammad bin Ash Shabbah] keduanya berkata; telah menceritakan kepada kami [Abu Bakr bin Ayyasy] dari [Abu Ishaq] dari [Ashim bin Dlamrah As Saluli] ia berkata, \" [Ali bin Abu Thalib] berkata, \"sholat witir tidak wajib dan tidak pula seperti sholat maktubah kalian, hanya saja Rasulullah shallallahu 'alaihi wasallam selalu mengerjakannya, beliau mengatakan: \"Wahai ahli Qur`an, hendaklah kalian sholat witir, sesungguhnya Allah menyukai sholat witir. \""
            },
            {
                "number": 1127,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو حَفْصٍ الْأَبَّارُ عَنْ الْأَعْمَشِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ وِتْرٌ يُحِبُّ الْوِتْرَ أَوْتِرُوا يَا أَهْلَ الْقُرْآنِ فَقَالَ أَعْرَابِيٌّ مَا يَقُولُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ لَكَ وَلَا لِأَصْحَابِكَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Hafs Al Abbar] dari [A'masy] dari [Amru bin Murrah] dari [Abu Ubaidah] dari [Abdullah bin Mas'ud] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya Allah itu ganjil, menyukai yang ganjil, maka laksanakanlah witir wahai ahli Qur'an. \" Kemudian seorang badui berkata, \"Apa yang dikatakan Rasulullah shallallahu 'alaihi wasallam?\" Beliau bersabda: \"Bukan bagimu dan bukan pula bagi teman-temanmu. \""
            },
            {
                "number": 1128,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو حَفْصٍ الْأَبَّارُ حَدَّثَنَا الْأَعْمَشُ عَنْ طَلْحَةَ وَزُبَيْدٍ عَنْ ذَرٍّ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Hafs Al Abbar] dari [A'masy] dari [Thalhah] dan [Zaid] dari [Dzarr] dari [Sa'id bin 'Abdurrahman bin Abza] dari [Bapaknya] dari [Ubai bin Ka'b] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat witir dengan membaca; \"SABBIHISMA RABBIKAL A'LAA (Sucikanlah nama Tuhanmu Yang Maha Tinggi) dan QUL YAA AYYUHAL KAAFIRUUN (Katakanlah: \"Hai orang-orang kafir) serta QUL HUWAALLAHU AHAD (Katakanlah: \"Dia-lah Allah yang Maha Esa) "
            },
            {
                "number": 1129,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ أَبِيهِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌحَدَّثَنَا أَحْمَدُ بْنُ مَنْصُورٍ أَبُو بَكْرٍ قَالَ حَدَّثَنَا شَبَابَةُ قَالَ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ أَبِيهِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Abu Ahmad] berkata, telah menceritakan kepada kami [Yunus bin Abu Ishaq] dari [Bapaknya] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat witir dengan membaca; SABBIHISMA RABBIKAL A'LAA (Sucikanlah nama Tuhanmu Yang Maha Tinggi) dan QUL YAA AYYUHAL KAAFIRUUN (Katakanlah: \"Hai orang-orang kafir) serta QUL HUWAALLAHU AHAD (Katakanlah: \" Dia-lah Allah yang Maha Esa). \" Telah menceritakan kepada kami [Ahmad bin Manshur Abu Bakr] berkata; telah menceritakan kepada kami [Syababah] berkata; telah menceritakan kepada kami [Yunus bin Abu Ishaq] dari [Bapaknya] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits. \""
            },
            {
                "number": 1130,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ وَأَبُو يُوسُفَ الرَّقِّيُّ مُحَمَّدُ بْنُ أَحْمَدَ الصَّيْدَلَانِيُّ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ خُصَيْفٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ جُرَيْجٍ قَالَ سَأَلْنَا عَائِشَةَبِأَيِّ شَيْءٍ كَانَ يُوتِرُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ يَقْرَأُ فِي الرَّكْعَةِ الْأُولَى بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَفِي الثَّانِيَةِ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَفِي الثَّالِثَةِ قُلْ هُوَ اللَّهُ أَحَدٌ وَالْمُعَوِّذَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] dan [Abu Yusuf Ar Raqqi Muhammad bin Ahmad Ash Shaidalani] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Salamah] dari [Khushaif] dari [Abdul Aziz bin Juraij] ia berkata, \"Kami bertanya kepada ['Aisyah]; surat apa yang biasa Rasulullah shallallahu 'alaihi wasallam ketika melaksanakan sholat witir?\" ia menjawab, \"Di raka'at pertama Rasulullah shallallahu 'alaihi wasallam membaca 'SABBIHISMA RABBIKAL A'LAA (Sucikanlah nama Tuhanmu Yang Maha Tinggi), raka'at kedua membaca QUL YAA AYYUHAL KAAFIRUUN (Katakanlah: \"Hai orang-orang kafir) dan raka'at ketiga membaca QUL HUWAALLAHU AHAD (Katakanlah: \"Hai orang-orang kafir) dan AL MU'AWIDZATAIN (Al Falaq dan An Nas). \" "
            },
            {
                "number": 1131,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَنَسِ بْنِ سِيرِينَ عَنْ ابْنِ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنْ اللَّيْلِ مَثْنَى مَثْنَى وَيُوتِرُ بِرَكْعَةٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Anas bin Sirin] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat malam dua raka'at dua raka'at, dan witir dengan satu raka'at. \""
            },
            {
                "number": 1132,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا عَاصِمٌ عَنْ أَبِي مِجْلَزٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى وَالْوِتْرُ رَكْعَةٌ قُلْتُ أَرَأَيْتَ إِنْ غَلَبَتْنِي عَيْنِي أَرَأَيْتَ إِنْ نِمْتُ قَالَ اجْعَلْ أَرَأَيْتَ عِنْدَ ذَلِكَ النَّجْمِ فَرَفَعْتُ رَأْسِي فَإِذَا السِّمَاكُ ثُمَّ أَعَادَ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى وَالْوِتْرُ رَكْعَةٌ قَبْلَ الصُّبْحِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu Asy Syawarib] berkata, telah menceritakan kepada kami [Abdul Wahid bin Ziyad] berkata, telah menceritakan kepada kami [Ashim] dari [Abu Mijlaz] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat malam itu dua raka'at dua raka'at, sedangkan witir satu raka'at. \" Aku bertanya, \"Bagaimana pendapatmu seandainya aku terkalahkan oleh mataku hingga aku tidur?\" ia menjawab, \"Jadikanlah perandaianmu itu pada bintang (maksudnya; tidur), \" aku pun mengangkat kepalaku dan ternyata bintang itu telah nampak. Ibnu Umar mengulangi ucapannya lagi, kemudian ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat malam itu dua raka'at dua raka'at, sedangkan witir adalah satu raka'at sebelum subuh. \""
            },
            {
                "number": 1133,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا الْمُطَّلِبُ بْنُ عَبْدِ اللَّهِ قَالَسَأَلَ ابْنَ عُمَرَ رَجُلٌ فَقَالَ كَيْفَ أُوتِرُ قَالَ أَوْتِرْ بِوَاحِدَةٍ قَالَ إِنِّي أَخْشَى أَنْ يَقُولَ النَّاسُ الْبُتَيْرَاءُ فَقَالَ سُنَّةُ اللَّهِ وَرَسُولِهِ يُرِيدُ هَذِهِ سُنَّةُ اللَّهِ وَرَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim Ad Dimasyqi] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Al Auza'i] berkata, telah menceritakan kepada kami [Al Muthallib bin Abdullah] ia berkata, \"Seorang laki-laki bertanya kepada [Ibnu Umar], \"Berapa rakaat aku harus sholat witir?\" ia menjawab, \"Witirlah satu raka'at, \" laki-laki itu berkata, \"Aku khawatir orang-orang akan mengatakan kepadaku Butaira`, \" Ibnu Umar berkata, \"Sunnah Allah dan Rasul-Nya, \" maksudnya; ini adalah sunnah Allah dan Rasul-Nya shallallahu 'alaihi wasallam. \""
            },
            {
                "number": 1134,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَلِّمُ فِي كُلِّ ثِنْتَيْنِ وَيُوتِرُ بِوَاحِدَةٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Syababah] dari [Ibnu Abu Dzi`b] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengucapkan salam pada setiap dua raka'at dan witir dengan satu raka'at. \""
            },
            {
                "number": 1135,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَبِي الْحَوْرَاءِ عَنْ الْحَسَنِ بْنِ عَلِيٍّ قَالَعَلَّمَنِي جَدِّي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَلِمَاتٍ أَقُولُهُنَّ فِي قُنُوتِ الْوِتْرِ اللَّهُمَّ عَافِنِي فِيمَنْ عَافَيْتَ وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ وَاهْدِنِي فِيمَنْ هَدَيْتَ وَقِنِي شَرَّ مَا قَضَيْتَ وَبَارِكْ لِي فِيمَا أَعْطَيْتَ إِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ إِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ سُبْحَانَكَ رَبَّنَا تَبَارَكْتَ وَتَعَالَيْتَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Syarik] dari [Abu Ishaq] dari [Buraid bin Abu Maryam] dari [Abu Al Haura`] dari [Al Hasan bin Ali] ia berkata, \"Kakekku, Rasulullah shallallahu 'alaihi wasallam mengajariku beberapa kalimat yang aku baca ketika qunut dalam sholat witir; ALLAHUMMA 'AAFANI FIIMAN 'AAFAITA WA TAWALLANII FIIMAN TAWALLAITA WAH DINII FIIMAN HADAITA WAQINII MAA QADLAITA WA BAARIKLII FIIMAA A'THAITA INNAKA TAQDLII WA LAA YUQDLAA 'ALAIKA INNAHU LAA YADZILLU MAN WAA LAITA SUBHAANAKA RABBANAA TABAARAKTA WA TA'AALAIKA. "
            },
            {
                "number": 1136,
                "arab": "حَدَّثَنَا أَبُو عُمَرَ حَفْصُ بْنُ عَمْرٍو حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنِي هِشَامُ بْنُ عَمْرٍو الْفَزَارِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ الْمَخْزُومِيِّ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ فِي آخِرِ الْوِتْرِ اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سُخْطِكَ وَأَعُوذُ بِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ وَأَعُوذُ بِكَ مِنْكَ لَا أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
                "id": "Telah menceritakan kepada kami [Abu Umar Hafsh bin Amru] berkata, telah menceritakan kepada kami [Bahz bin Asad] berkata, telah menceritakan kepada kami [Hammad bin Salamah] berkata, telah menceritakan kepadaku [Hisyam bin Amru Al Fazari] dari ['Abdurrahman bin Harits bin Hisyam Al Makhzumi] dari [Ali bin Abu Thalib] berkata, \"Nabi shallallahu 'alaihi wasallam di akhir sholat witir membaca do'a, \"ALLHUMMA INNI A'UUDZU BI RIDLAAKA MIN SUKHTIKA WA A'UUDZU BI MU'AAFAATIKA MIN 'UQUUBATIKA WA A'UUDZU BIKA MINKA LAA UHSHI TSNAA`AN 'ALAIKA ANTA KAMAA ATSNAITA 'ALAA NAFSIKA (Ya Allah sesungguhnya aku berlindung dengan keridlaan-Mu dari kemurkaan-Mu, dan aku berlindung dengan maaf-Mu dari siksaan-Mu, dan aku berlindung kepada-Mu dari-Mu, aku tidak bisa menghitung pujian kepada-Mu, Engkau sebagaimana Engkau memuji pada diri-Mu. \""
            },
            {
                "number": 1137,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَرْفَعُ يَدَيْهِ فِي شَيْءٍ مِنْ دُعَائِهِ إِلَّا عِنْدَ الِاسْتِسْقَاءِ فَإِنَّهُ كَانَ يَرْفَعُ يَدَيْهِ حَتَّى يُرَى بَيَاضُ إِبْطَيْهِ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Yazid bin Zurai'] berkata, telah menceritakan kepada kami [Sa'id bin Abu Arubah] dari [Qatadah] dari [Anas bin Malik] berkata, \"Nabi Allah shallallahu 'alaihi wasallam tidak pernah mengangkat kedua tangannya ketika berdo`a kecuali pada sholat istisqa`. Beliau mengangkat kedua tangannya hingga terlihat putihnya kedua ketiak beliau. \" "
            },
            {
                "number": 1138,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا عَائِذُ بْنُ حَبِيبٍ عَنْ صَالِحِ بْنِ حَسَّانَ الْأَنْصَارِيِّ عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَعَوْتَ اللَّهَ فَادْعُ بِبَاطِنِ كَفَّيْكَ وَلَا تَدْعُ بِظُهُورِهِمَا فَإِذَا فَرَغْتَ فَامْسَحْ بِهِمَا وَجْهَكَ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] dan [Muhammad bin Ash Shabbah] keduanya berkata; telah menceritakan kepada kami ['A`id bin Habib] dari [Shalih bin Hassan Al Anshari] dari [Muhammad bin Ka'ab Al Qurazhi] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kamu berdo'a kepada Allah gunakanlah bagian dalam telapak tanganmu dan jangan dengan bagian luarnya, jika selesai do`a maka usaplah wajahmu dengan keduanya. \""
            },
            {
                "number": 1139,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ حَدَّثَنَا مَخْلَدُ بْنُ يَزِيدَ عَنْ سُفْيَانَ عَنْ زُبَيْدٍ الْيَامِيِّ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَيِّ بْنِ كَعْبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ فَيَقْنُتُ قَبْلَ الرُّكُوعِ",
                "id": "Telah menceritakan kepada kami [Ali bin Maimun Ar-Raqqi] berkata, telah menceritakan kepada kami [Makhlad bin Yazid] dari [Sufyan] dari [Zubaid Al Yami] dari [Sa'id bin 'Abdurrahman bin Abza] dari [Bapaknya] dari [Ubai bin Ka'b] berkata, \"Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat witir dan qunut sebelum rukuk. \""
            },
            {
                "number": 1140,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا سَهْلُ بْنُ يُوسُفَ حَدَّثَنَا حُمَيْدٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَسُئِلَ عَنْ الْقُنُوتِ فِي صَلَاةِ الصُّبْحِ فَقَالَ كُنَّا نَقْنُتُ قَبْلَ الرُّكُوعِ وَبَعْدَهُ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Sahl bin Yusuf] berkata, telah menceritakan kepada kami [Humaid] dari [Anas bin Malik] ia berkata, \"Ia ditanya tentang qunut dalam sholat subuh?\" maka Anas pun menjawab, \"Kami melakukan qunut sebelum rukuk dan sesudahnya. \""
            },
            {
                "number": 1141,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا أَيُّوبُ عَنْ مُحَمَّدٍ قَالَسَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنْ الْقُنُوتِ فَقَالَ قَنَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ الرُّكُوعِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Abdul Wahhab] berkata, telah menceritakan kepada kami [Ayyub] dari [Muhammad] ia berkata, \"Aku bertanya kepada [Anas bin Malik] tentang qunut, maka ia pun menjawab, \"Rasulullah shallallahu 'alaihi wasallam melakukan qunut setelah rukuk. \""
            },
            {
                "number": 1142,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ أَبِي حُصَيْنٍ عَنْ يَحْيَى بْنِ وَثَّابٍ عَنْ مَسْرُوقٍ قَالَسَأَلْتُ عَائِشَةَ عَنْ وِتْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ مِنْ كُلِّ اللَّيْلِ قَدْ أَوْتَرَ مِنْ أَوَّلِهِ وَأَوْسَطِهِ وَانْتَهَى وِتْرُهُ حِينَ مَاتَ فِي السَّحَرِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Bakr bin Ayyasy] dari [Abu Hushain] dari [Yahya bin Watstsab] dari [Masruq] ia berkata, \"Aku pernah bertanya kepada ['Aisyah] tentang witirnya Rasulullah shallallahu 'alaihi wasallam, lalu ia menjawab, \"Beliau pernah witir di awal malam, tengah malam dan waktu witirnya berakhir di akhir malam, di waktu sahur. \" "
            },
            {
                "number": 1143,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ قَالَمِنْ كُلِّ اللَّيْلِ قَدْ أَوْتَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَوَّلِهِ وَأَوْسَطِهِ وَانْتَهَى وِتْرُهُ إِلَى السَّحَرِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata; telah menceritakan kepada kami [Waki']. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Ashim bin Dlamrah] dari [Ali] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pada setiap malamnya witir di awal malam, tengah malam dan berakhir di akhir malam menjelang sahur. \""
            },
            {
                "number": 1144,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ أَبِي غَنِيَّةَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ خَافَ مِنْكُمْ أَنْ لَا يَسْتَيْقِظَ مِنْ آخِرِ اللَّيْلِ فَلْيُوتِرْ مِنْ أَوَّلِ اللَّيْلِ ثُمَّ لِيَرْقُدْ وَمَنْ طَمِعَ مِنْكُمْ أَنْ يَسْتَيْقِظَ مِنْ آخِرِ اللَّيْلِ فَلْيُوتِرْ مِنْ آخِرِ اللَّيْلِ فَإِنَّ قِرَاءَةَ آخِرِ اللَّيْلِ مَحْضُورَةٌ وَذَلِكَ أَفْضَلُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] berkata, telah menceritakan kepada kami [Ibnu Abu Ghaniah] berkata, telah menceritakan kepada kami [Al A'masy] dari [Abu Sufyan] dari [Jabir] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa di antara kalian khawatir tidak bisa bangun di akhir malam hendaklah ia witir di awal malam kemudian tidur, dan barangsiapa mampu bangun di akhir malam hendaklah ia witir di akhir malam, sebab sholat di akhir malam itu disaksikan. Dan itulah yang lebih afdlal. \""
            },
            {
                "number": 1145,
                "arab": "حَدَّثَنَا أَبُو مُصْعَبٍ أَحْمَدُ بْنُ أَبِي بَكْرٍ الْمَدِينِيُّ وَسُوَيْدُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَامَ عَنْ الْوِتْرِ أَوْ نَسِيَهُ فَلْيُصَلِّ إِذَا أَصْبَحَ أَوْ ذَكَرَهُ",
                "id": "Telah menceritakan kepada kami [Abu Mush'ab Ahmad bin Abu Bakr Al Madini] dan [Suwaid bin Sa'id] berkata; telah menceritakan kepada kami ['Abdurrahman bin Zaid bin Aslam] dari [Bapaknya] dari ['Atho` bin Yasar] dari [Abu Sa'id] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa kehilangan sholat witir karena tidur atau lupa, hendaklah ia kerjakan ketika bangun (subuh) atau teringat. \""
            },
            {
                "number": 1146,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَأَحْمَدُ بْنُ الْأَزْهَرِ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْتِرُوا قَبْلَ أَنْ تُصْبِحُواقَالَ مُحَمَّدُ بْنُ يَحْيَى فِي هَذَا الْحَدِيثِ دَلِيلٌ عَلَى أَنَّ حَدِيثَ عَبْدِ الرَّحْمَنِ وَاهٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] dan [Ahmad Ibnul Azhar] keduanya berkata; telah menceritakan kepada kami [Abdurrazaq] berkata, telah memberitakan kepada kami [Ma'mar] dari [Yahya bin Abu Katsir] dari [Abu Nadlrah] dari [Abu Sa'id] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Witirlah sebelum datang waktu subuh. \" Muhammad bin Yahya berkata, \"Hadits ini menjadi dalil bahwa hadits 'Abdurrahman itu lemah. \""
            },
            {
                "number": 1147,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا الْفِرْيَابِيُّ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْوِتْرُ حَقٌّ فَمَنْ شَاءَ فَلْيُوتِرْ بِخَمْسٍ وَمَنْ شَاءَ فَلْيُوتِرْ بِثَلَاثٍ وَمَنْ شَاءَ فَلْيُوتِرْ بِوَاحِدَةٍ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim bin Ad Dimasyqi] berkata, telah menceritakan kepada kami [Al Firyabi] dari [Al Auza'i] dari [Az Zuhri] dari ['Atho` bin Yazid Al Laitsi] dari [Abu Ayyub Al Anshari] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Witir adalah haq (disyariatkan), barangsiapa berkehendak ia bisa witir lima raka'at, barangsiapa berkehendak ia bisa witir tiga raka'at dan barangsiapa berkehendak ia bisa witir satu raka'at. \""
            },
            {
                "number": 1148,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ قَالَسَأَلْتُ عَائِشَةَ قُلْتُ يَا أُمَّ الْمُؤْمِنِينَ أَفْتِينِي عَنْ وِتْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كُنَّا نُعِدُّ لَهُ سِوَاكَهُ وَطَهُورَهُ فَيَبْعَثُهُ اللَّهُ فِيمَا شَاءَ أَنْ يَبْعَثَهُ مِنْ اللَّيْلِ فَيَتَسَوَّكُ وَيَتَوَضَّأُ ثُمَّ يُصَلِّي تِسْعَ رَكَعَاتٍ لَا يَجْلِسُ فِيهَا إِلَّا عِنْدَ الثَّامِنَةِ فَيَدْعُو رَبَّهُ فَيَذْكُرُ اللَّهَ وَيَحْمَدُهُ وَيَدْعُوهُ ثُمَّ يَنْهَضُ وَلَا يُسَلِّمُ ثُمَّ يَقُومُ فَيُصَلِّي التَّاسِعَةَ ثُمَّ يَقْعُدُ فَيَذْكُرُ اللَّهَ وَيَحْمَدُهُ وَيَدْعُو رَبَّهُ وَيُصَلِّي عَلَى نَبِيِّهِ ثُمَّ يُسَلِّمُ تَسْلِيمًا يُسْمِعُنَا ثُمَّ يُصَلِّي رَكْعَتَيْنِ بَعْدَ مَا يُسَلِّمُ وَهُوَ قَاعِدٌ فَتِلْكَ إِحْدَى عَشْرَةَ رَكْعَةً فَلَمَّا أَسَنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَخَذَ اللَّحْمَ أَوْتَرَ بِسَبْعٍ وَصَلَّى رَكْعَتَيْنِ بَعْدَ مَا سَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Bisyr] berkata, telah menceritakan kepada kami [Sa'id bin Abu Arubah] dari [Qatadah] dari [Zurarah bin Abu Aufa] dari [Sa'd bin Hisyam] ia berkata, \"Aku bertanya kepada ['Aisyah], \"Aku katakan, \"Wahai Ummul mukminin, berilah fatwa kami tentang witirnya Rasulullah shallallahu 'alaihi wasallam! \" ia menjawab, \"Kami menyiapkan siwak dan air wudlu beliau, lalu Allah membangunkannya atas kehendak-Nya kapan beliau harus bangun. Beliau bersiwak dan wudlu, kemudian sholat sembilan raka'at tanpa duduk kecuali pada raka'at ke delapan. Beliau berdo`a, dzikir kepada Allah, memuji dan memohon kepada-Nya. Kemudian beliau berdiri tanpa salam terlebih dahulu, lalu diam berdiri. Setelah itu beliau sholat pada raka'at kesembilan, lalu duduk dan dzikir kepada Allah, memuji, memohon kepada Rabbnya, dan bershalawat atas Nabi-Nya. Kemudian beliau mengucapkan salam dengan suara keras hingga kami mendengarnya, setelah salam itu beliau sholat lagi dua raka'at dalam keadaan duduk. Maka itulah sebelas raka'at. Setelah Rasulullah shallallahu 'alaihi wasallam berusia senja, beliau witir tujuh raka'at dan sholat dua raka'at setelah salam. \""
            },
            {
                "number": 1149,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ زُهَيْرٍ عَنْ مَنْصُورٍ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ أُمِّ سَلَمَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ بِسَبْعٍ أَوْ بِخَمْسٍ لَا يَفْصِلُ بَيْنَهُنَّ بِتَسْلِيمٍ وَلَا كَلَامٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Humaid bin 'Abdurrahman] dari [Zuhair] dari [Mansur] dari [Al Hakam] dari [Miqsam] dari [Ummu Salamah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat witir dengan tujuh atau lima raka'at, dan beliau tidak memisahkannya dengan salam atau perkataan. \" "
            },
            {
                "number": 1150,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ وَإِسْحَقُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا شُعْبَةُ عَنْ جَابِرٍ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي السَّفَرِ رَكْعَتَيْنِ لَا يَزِيدُ عَلَيْهِمَا وَكَانَ يَتَهَجَّدُ مِنْ اللَّيْلِ قُلْتُ وَكَانَ يُوتِرُ قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sinan] dan [Ishaq bin Manshur] keduanya berkata; telah menceritakan kepada kami [Yazid bin Harun] berkata, telah memberitakan kepada kami [Syu'bah] dari [Jabir] dari [Salim] dari [bapaknya] ia berkata, \"Dalam safar Rasulullah shallallahu 'alaihi wasallam sholat dua raka'at tidak lebih, dan beliau selalu sholat malam. \" Aku berkata, \"Beliau juga sholat witir?! Ia menjawab, \"Benar. \""
            },
            {
                "number": 1151,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُوسَى حَدَّثَنَا شَرِيكٌ عَنْ جَابِرٍ عَنْ عَامِرٍ عَنْ ابْنِ عَبَّاسٍ وَابْنِ عُمَرَ قَالَاسَنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ السَّفَرِ رَكْعَتَيْنِ وَهُمَا تَمَامٌ غَيْرُ قَصْرٍ وَالْوِتْرُ فِي السَّفَرِ سُنَّةٌ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Musa] berkata, telah menceritakan kepada kami [Syarik] dari [Jabir] dari [Amir] dari [Ibnu Abbas] dan [Ibnu Umar] keduanya berkata; Rasulullah shallallahu 'alaihi wasallam memberi contoh sholat safar dengan dua raka'at, sempurna dan tidak diringkas. Dan sholat witir dalam perjalanan adalah sunnah. \""
            },
            {
                "number": 1152,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ حَدَّثَنَا مَيْمُونُ بْنُ مُوسَى الْمَرَئِيُّ عَنْ الْحَسَنِ عَنْ أُمِّهِ عَنْ أُمِّ سَلَمَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بَعْدَ الْوِتْرِ رَكْعَتَيْنِ خَفِيفَتَيْنِ وَهُوَ جَالِسٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Hammad bin Mas'adah] berkata, telah menceritakan kepada kami [Maimun bin Musa Al Mara`i] dari [Al Hasan] dari [Ibunya] dari [Ummu Salamah] berkata, \"Setelah witir beliau melaksanakan sholat dua raka'at yang ringan sambil duduk. \" "
            },
            {
                "number": 1153,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا عُمَرُ بْنُ عَبْدِ الْوَاحِدِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ قَالَ حَدَّثَتْنِي عَائِشَةُ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوتِرُ بِوَاحِدَةٍ ثُمَّ يَرْكَعُ رَكْعَتَيْنِ يَقْرَأُ فِيهِمَا وَهُوَ جَالِسٌ فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ فَرَكَعَ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim Ad Dimasyqi] berkata, telah menceritakan kepada kami [Umar bin Abdul Wahid] berkata, telah menceritakan kepada kami [Al Auza'i] dari [Yahya bin Abu Katsir] dari [Abu Salamah] berkata; telah menceritakan kepadaku ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat witir satu raka'at, kemudian beliau mengerjakan sholat dua raka'at sambil membaca sedang beliau duduk, jika akan rukuk beliau bangun kemudian baru rukuk. \" "
            },
            {
                "number": 1154,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ مِسْعَرٍ وَسُفْيَانَ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ قَالَتْمَا كُنْتُ أُلْفِي أَوْ أَلْقَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ آخِرِ اللَّيْلِ إِلَّا وَهُوَ نَائِمٌ عِنْدِيقَالَ وَكِيعٌ تَعْنِي بَعْدَ الْوِتْرِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Mis'ar] dan [Sufyan] dari [Sa'd bin Ibrahim] dari [Abu Salamah bin 'Abdurrahman] dari ['Aisyah] ia berkata, \"Aku tidak pernah mendapati Nabi shallallahu 'alaihi wasallam di akhir malam kecuali dalam keadaan tidur. \" Waki' berkata, \"Yakni setelah sholat witir. \""
            },
            {
                "number": 1155,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى رَكْعَتَيْ الْفَجْرِ اضْطَجَعَ عَلَى شِقِّهِ الْأَيْمَنِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Isma'il bin Ulayyah] dari ['Abdurrahman bin Ishaq] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] ia berkata, \"Nabi shallallahu 'alaihi wasallam jika selesai melaksanakan sholat dua raka'at sebelum fajar, beliau berbaring pada sisi sebelah kanan. \""
            },
            {
                "number": 1156,
                "arab": "حَدَّثَنَا عُمَرُ بْنُ هِشَامٍ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ أَنْبَأَنَا شُعْبَةُ حَدَّثَنِي سُهَيْلُ بْنُ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى رَكْعَتَيْ الْفَجْرِ اضْطَجَعَ",
                "id": "Telah menceritakan kepada kami [Umar bin Hisyam] berkata, telah menceritakan kepada kami [An Nadlr bin Syumail] berkata, telah memberitakan kepada kami [Syu'bah] berkata, telah menceritakan kepadaku [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] ia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam selesai dari dua raka'at fajar, beliau berbaring. \""
            },
            {
                "number": 1157,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ أَبِي بَكْرِ بْنِ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ عَنْ سَعِيدِ بْنِ يَسَارٍ قَالَكُنْتُ مَعَ ابْنِ عُمَرَ فَتَخَلَّفْتُ فَأَوْتَرْتُ فَقَالَ مَا خَلَفَكَ قُلْتُ أَوْتَرْتُ فَقَالَ أَمَا لَكَ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُسْوَةٌ حَسَنَةٌ قُلْتُ بَلَى قَالَ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ عَلَى بَعِيرِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sinan] berkata, telah menceritakan kepada kami ['Abdurrahman bin Mahdi] dari [Malik bin Anas] dari [Abu Bakar bin Umar bin 'Abdurrahman bin Abdullah bin Umar Ibnul Khaththab] dari [Sa'id bin Yasar] ia berkata, \"Aku pernah bersama [Ibnu Umar], lalu aku mengakhirkan diri untuk sholat witir. Hingga Ibnu Umar pun bertanya, \"Kenapa kamu terakhir?\" Aku menjawab, \"Aku sholat witir. \" Ibnu Umar berkata, \"Tidakkah pada diri Rasulullah shallallahu 'alaihi wasallam terdapat teladan baik bagimu?\" Aku menjawab, \"Tentu, \" ia berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam pernah sholat witir di atas kendaraannya. \""
            },
            {
                "number": 1158,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ الْأَسْفَاطِيُّ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا عَبَّادُ بْنُ مَنْصُورٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ عَلَى رَاحِلَتِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yazid Al Asfathi] berkata, telah menceritakan kepada kami [Abu Dawud] berkata, telah menceritakan kepada kami ['Abbad bin Manshur] dari [Ikrimah] dari [Ibnu Abbas] berkata, \"Nabi shallallahu 'alaihi wasallam pernah melaksanakan sholat witir di atas kendaraannya. \""
            },
            {
                "number": 1159,
                "arab": "حَدَّثَنَا أَبُو دَاوُدَ سُلَيْمَانُ بْنُ تَوْبَةَ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ حَدَّثَنَا زَائِدَةُ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَبِي بَكْرٍ أَيَّ حِينٍ تُوتِرُ قَالَ أَوَّلَ اللَّيْلِ بَعْدَ الْعَتَمَةِ قَالَ فَأَنَتَ يَا عُمَرُ فَقَالَ آخِرَ اللَّيْلِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا أَنْتَ يَا أَبَا بَكْرٍ فَأَخَذْتَ بِالْوُثْقَى وَأَمَّا أَنْتَ يَا عُمَرُ فَأَخَذْتَ بِالْقُوَّةِحَدَّثَنَا أَبُو دَاوُدَ سُلَيْمَانُ بْنُ تَوْبَةَ أَنْبَأَنَا مُحَمَّدُ بْنُ عَبَّادٍ حَدَّثَنَا يَحْيَى بْنُ سَلِيمٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي بَكْرٍ فَذَكَرَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Abu Dawud Sulaiman bin Taubah] berkata, telah menceritakan kepada kami [Yahya bin Abu Bukair] berkata, telah menceritakan kepada kami [Za`idah] dari [Abdullah bin Muhammad bin Aqil] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda kepada Abu Bakar: \"Jam berapa kamu witir?\" Abu Bakar menjawab, \"Di awal malam, selepas isya. \" Beliau bersabda: \"Kalau kamu, jam berapa Umar?\" Umar menjawab, \"Di akhir malam. \" Lalu Nabi shallallahu 'alaihi wasallam pun bersabda: \"Adapun kamu wahai Abu Bakar, engkau melakukannya dengan penuh kehati-hatian. Dan engkau wahai Umar, engkau melakukannya dengan penuh kekuatan (yakin). \" Telah menceritakan kepada kami [Abu Dawud Sulaiman bin Taubah] berkata, telah memberitakan kepada kami [Muhammad bin Abbad] berkata, telah menceritakan kepada kami [Yahya bin Salim] dari [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda kepada Abu Bakar, lalu ia menyebutkan sebagaimana dalam hadits. \""
            },
            {
                "number": 1160,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَزَادَ أَوْ نَقَصَ قَالَ إِبْرَاهِيمُ وَالْوَهْمُ مِنِّي فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ أَزِيدَ فِي الصَّلَاةِ شَيْءٌ قَالَ إِنَّمَا أَنَا بَشَرٌ أَنْسَى كَمَا تَنْسَوْنَ فَإِذَا نَسِيَ أَحَدُكُمْ فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ ثُمَّ تَحَوَّلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَجَدَ سَجْدَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Amir bin Zurarah] berkata, telah menceritakan kepada kami [Ali bin Mushir] dari [Al A'masy] dari [Ibrahim] dari [Alqamah] dari [Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat, lalu beliau kelebihan atau kurang dalam raka'at. Ibrahim berkata, \"Keraguan itu sumbernya dariku, \" lalu dikatakan kepada beliau, \"Wahai Rasulullah, apakah engkau menambahkan sesuatu dalam sholat?\" beliau menjawab: \"Aku hanyalah manusia seperti kalian yang terkadang lupa sebagaimana kalian lupa. Jika salah seorang dari kalian lupa, hendaklah ia sujud (sahwi) dengan dua kali sujud dalam keadaan duduk. \" Setelah Nabi shallallahu 'alaihi wasallam bergeser dan sujud dengan dua kali sujud. \""
            },
            {
                "number": 1161,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ هِشَامٍ حَدَّثَنِي يَحْيَى حَدَّثَنِي عِيَاضٌ أَنَّهُسَأَلَ أَبَا سَعِيدٍ الْخُدْرِيَّ فَقَالَ أَحَدُنَا يُصَلِّي فَلَا يَدْرِي كَمْ صَلَّى فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى أَحَدُكُمْ فَلَمْ يَدْرِ كَمْ صَلَّى فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ",
                "id": "Telah menceritakan kepada kami [Amru bin Rafi'] berkata, telah menceritakan kepada kami [Isma'il bin Ulayyah] dari [Hisyam] berkata, telah menceritakan kepadaku [Yahya] dari [Iyadl] Bahwasanya ia pernah bertanya kepada [Abu Sa'id Al Khudri], ia mengatakan, \"Salah seorang dari kami sholat tetapi tidak tahu berapa raka'at yang telah ia kerjakan?\" Abu Sa'di Al Khudri menjawab, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian sholat dan tidak tahu berapa raka'at yang telah ia kerjakan, maka hendaklah ia sujud dua kali sedang ia dalam keadaan duduk. \""
            },
            {
                "number": 1162,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَأَبُو بَكْرِ بْنُ خَلَّادٍ قَالَا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ حَدَّثَنِي الْحَكَمُ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَصَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ خَمْسًا فَقِيلَ لَهُ أَزِيدَ فِي الصَّلَاةِ قَالَ وَمَا ذَاكَ فَقِيلَ لَهُ فَثَنَى رِجْلَهُ فَسَجَدَ سَجْدَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] dan [Abu Bakr bin Khallad] keduanya berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] berkata, telah menceritakan kepadaku [Al Hakam] dari [Ibrahim] dari [Alqamah] dari [Abdullah] ia berkata, \"Nabi shallallahu 'alaihi wasallam sholat zhuhur lima raka'at, lalu katakan kepada beliau, \"Apa sholatnya ditambah?\" beliau bertanya: \"Apakah itu benar?\" lalu dikatakan kepada beliau, kemudian beliau menekuk kakinya dan sujud dua kali. \""
            },
            {
                "number": 1163,
                "arab": "حَدَّثَنَا عُثْمَانُ وَأَبُو بَكْرٍ ابْنَا أَبِي شَيْبَةَ وَهِشَامُ بْنُ عَمَّارٍ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ الْأَعْرَجِ عَنْ ابْنِ بُحَيْنَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى صَلَاةً أَظُنُّ أَنَّهَا الظُّهْرُ فَلَمَّا كَانَ فِي الثَّانِيَةِ قَامَ قَبْلَ أَنْ يَجْلِسَ فَلَمَّا كَانَ قَبْلَ أَنْ يُسَلِّمَ سَجَدَ سَجْدَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Utsman] dan [Abu Bakr] -keduanya anak Abu Syaibah- dan [Hisyam bin Ammar] mereka berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Al A'raj] dari [Ibnu Buhainah] berkata, \"Nabi shallallahu 'alaihi wasallam mengerjakan suatu sholat, aku mengira bahwa itu adalah sholat zhuhur, maka ketika sampai raka'at kedua beliau langsung berdiri tanpa duduk tasyahud. Kemudian sebelum salam beliau sujud (sahwi) dengan dua kali sujud. \""
            },
            {
                "number": 1164,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ نُمَيْرٍ وَابْنُ فُضَيْلٍ وَيَزِيدُ بْنُ هَارُونَ ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ وَيَزِيدُ بْنُ هَارُونَ وَأَبُو مُعَاوِيَةَ كُلُّهُمْ لَهُمْ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ أَنَّ ابْنَ بُحَيْنَةَ أَخْبَرَهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِي ثِنْتَيْنِ مِنْ الظُّهْرِ نَسِيَ الْجُلُوسَ حَتَّى إِذَا فَرَغَ مِنْ صَلَاتِهِ إِلَّا أَنْ يُسَلِّمَ سَجَدَ سَجْدَتَيْ السَّهْوِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ibnu Numair] dan [Ibnu Fudlail] dan [Yazid bin Harun]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Khalid Al Ahmar] dan [Yazid bin Harun] dan [Abu Mu'awiyah] semuanya dari [Yahya bin Sa'id] dari ['Abdurrahman Al A'raj] bahwa [Ibnu Buhainah] mengabarkan kepadanya, bahwa Nabi shallallahu 'alaihi wasallam ketika sholat zhuhur beliau berdiri pada raka'at kedua karena lupa duduk, selesai sholat dan akan salam beliau sujud sahwi dua kali, kemudian salam. \""
            },
            {
                "number": 1165,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ جَابِرٍ عَنْ الْمُغِيرَةِ بْنِ شُبَيْلٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ أَحَدُكُمْ مِنْ الرَّكْعَتَيْنِ فَلَمْ يَسْتَتِمَّ قَائِمًا فَلْيَجْلِسْ فَإِذَا اسْتَتَمَّ قَائِمًا فَلَا يَجْلِسْ وَيَسْجُدْ سَجْدَتَيْ السَّهْوِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Muhammad bin Yusuf] berkata, telah menceritakan kepada kami [Sufyan] dari [Jabir] dari [Al Mughirah bin Syumail] dari [Qais bin Abu Hazim] dari [Al Mughirah bin Syu'bah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian berdiri pada raka'at kedua namun belum sempurna dalam berdirinya, hendaklah ia duduk. Namun jika telah tegak berdiri janganlah duduk, hendaklah ia sujud sahwi dengan dua kali sujud. \""
            },
            {
                "number": 1166,
                "arab": "حَدَّثَنَا أَبُو يُوسُفَ الرَّقِّيُّ مُحَمَّدُ بْنُ أَحْمَدَ الصَّيْدَلَانِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مَكْحُولٍ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا شَكَّ أَحَدُكُمْ فِي الثِّنْتَيْنِ وَالْوَاحِدَةِ فَلْيَجْعَلْهَا وَاحِدَةً وَإِذَا شَكَّ فِي الثِّنْتَيْنِ وَالثَّلَاثِ فَلْيَجْعَلْهَا ثِنْتَيْنِ وَإِذَا شَكَّ فِي الثَّلَاثِ وَالْأَرْبَعِ فَلْيَجْعَلْهَا ثَلَاثًا ثُمَّ لِيُتِمَّ مَا بَقِيَ مِنْ صَلَاتِهِ حَتَّى يَكُونَ الْوَهْمُ فِي الزِّيَادَةِ ثُمَّ يَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ قَبْلَ أَنْ يُسَلِّمَ",
                "id": "Telah menceritakan kepada kami [Abu Yusuf Ar Raqqi Muhammad bin Ahmad Ash Shaidalani] berkata, telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Makhul] dari [Kuraib] dari [Ibnu Abbas] dari ['Abdurrahman bin Auf] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian ragu antara dua raka'at atau satu, hendaklah ia jadikan satu raka'at. Jika ragu antara dua raka'at atau tiga, hendaklah ia jadikan dua. Jika ragu antara tiga atau empat, hendaklah ia jadikan tiga. Setelah itu hendaklah ia menyempurnakan kekurangannya, hingga keraguan itu bertumpu pada sesuatu yang lebih. Kemudian sujud sahwi dua kali dalam keadaan duduk sebelum salam. \""
            },
            {
                "number": 1167,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ ابْنِ عَجْلَانَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا شَكَّ أَحَدُكُمْ فِي صَلَاتِهِ فَلْيُلْغِ الشَّكَّ وَلْيَبْنِ عَلَى الْيَقِينِ فَإِذَا اسْتَيْقَنَ التَّمَامَ سَجَدَ سَجْدَتَيْنِ فَإِنْ كَانَتْ صَلَاتُهُ تَامَّةً كَانَتْ الرَّكْعَةُ نَافِلَةً وَإِنْ كَانَتْ نَاقِصَةً كَانَتْ الرَّكْعَةُ لِتَمَامِ صَلَاتِهِ وَكَانَتْ السَّجْدَتَانِ رَغْمَ أَنْفِ الشَّيْطَانِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Ibnu 'Ajlan] dari [Zaid bin Aslam] dari ['Atho` bin Yasar] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian merasa ragu dalam sholat hendaklah ia hilangkan keraguannya dan kembali pada keyakinan. Jika ia yakin telah sempurna hendaklah sujud sahwi dua kali, jika sholatnya ternyata telah sempurna maka tambahan raka'at itu sebagai nafilah. Namun, jika raka'at sholatnya kurang, maka tambahan itu sebagai penyempurnanya. Dan dua sujud (sahwi) itu akan membuat setan benci. \""
            },
            {
                "number": 1168,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ قَالَ شُعْبَةُ كَتَبَ إِلَيَّ وَقَرَأْتُهُ عَلَيْهِ قَالَ أَخْبَرَنِي إِبْرَاهِيمُ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةً لَا نَدْرِي أَزَادَ أَوْ نَقَصَ فَسَأَلَ فَحَدَّثْنَاهُ فَثَنَى رِجْلَهُ وَاسْتَقْبَلَ الْقِبْلَةَ وَسَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَقَالَ لَوْ حَدَثَ فِي الصَّلَاةِ شَيْءٌ لَأَنْبَأْتُكُمُوهُ وَإِنَّمَا أَنَا بَشَرٌ أَنْسَى كَمَا تَنْسَوْنَ فَإِذَا نَسِيتُ فَذَكِّرُونِي وَأَيُّكُمْ مَا شَكَّ فِي الصَّلَاةِ فَلْيَتَحَرَّ أَقْرَبَ ذَلِكَ مِنْ الصَّوَابِ فَيُتِمَّ عَلَيْهِ وَيُسَلِّمَ وَيَسْجُدَ سَجْدَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Manshur] -Syu'bah berkata; ia menuliskan untukku, lalu aku membacakan di hadapannya- telah mengabarkan kepadaku [Ibrahim] dari [Alqamah] dari [Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat, namun beliau tidak mengetahui apakah jumlah raka'atnya lebih atau tidak, hingga beliau bertanya kami dan kami pun memberitahukannya kepada beliau. Beliau kemudian menekuk kakinya dan menghadap kiblat, lalu sujud dua kali dan salam. Setelah itu beliau menghadap ke arah kami dengan wajahnya dan bersabda: \"Jika terjadi sesuatu dalam sholat pasti aku beritahukan pada kalian, aku hanyalah manusia biasa yang kadang lupa sebagaimana kalian lupa. Maka, jika aku lupa hendaklah kalian ingatkan. Siapa saja dari kalian merasa ragu dalam sholat hendaklah memilih yang paling dekat dengan kebenaran, lalu menyempurnakan, kemudian salam dan sujud dua kali. \" "
            },
            {
                "number": 1169,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ مِسْعَرٍ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا شَكَّ أَحَدُكُمْ فِي الصَّلَاةِ فَلْيَتَحَرَّ الصَّوَابَ ثُمَّ يَسْجُدْ سَجْدَتَيْنِقَالَ الطَّنَافِسِيُّ هَذَا الْأَصْلُ وَلَا يَقْدِرُ أَحَدٌ يَرُدُّهُ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Mis'ar] dari [Manshur] dari [Ibrahim] dari [Alqamah] dari [Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian merasa ragu dalam sholat, hendaklah memilih yang paling benar kemudian sujud dua kali. \" Ath Thanafisi berkata, \"Ini adalah dasar dan tidak ada seorang pun yang menolaknya. \""
            },
            {
                "number": 1170,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَأَبُو كُرَيْبٍ وَأَحْمَدُ بْنُ سِنَانٍ قَالُوا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَهَا فَسَلَّمَ فِي الرَّكْعَتَيْنِ فَقَالَ لَهُ رَجُلٌ يُقَالُ لَهُ ذُو الْيَدَيْنِ يَا رَسُولَ اللَّهِ أَقَصُرَتْ أَمْ نَسِيتَ قَالَ مَا قَصُرَتْ وَمَا نَسِيتُ قَالَ إِذًا فَصَلَّيْتَ رَكْعَتَيْنِ قَالَ أَكَمَا يَقُولُ ذُو الْيَدَيْنِ قَالُوا نَعَمْ فَتَقَدَّمَ فَصَلَّى رَكْعَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ سَجَدَ سَجْدَتَيْ السَّهْوِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Abu Kuraib] dan [Ahmad bin Sinan] mereka berkata; telah menceritakan kepada kami [Abu Usamah] dari [ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam lupa hingga beliau salam pada raka'at kedua. Lalu seorang laki-laki yang bernama Dzul Yadain berkata kepada beliau, \"Wahai Rasulullah, apakah sholatnya diringkas atau memang engkau lupa?\" Beliau menjawab: \"sholatnya tidak diringkas dan aku juga tidak lupa. \" Ia berkata kembali, \"Tetapi kenapa engkau sholat dua raka'at? beliau bersabda: \"Benarkah yang dikatakan Dzul Yadain?\" Para sahabat menjawab, \"Ya. \" Beliau kemudian maju dan sholat dua raka'at dan salam, setelah itu sujud sahwi. \" "
            },
            {
                "number": 1171,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ ابْنِ عَوْنٍ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِحْدَى صَلَاتَيْ الْعَشِيِّ رَكْعَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ قَامَ إِلَى خَشَبَةٍ كَانَتْ فِي الْمَسْجِدِ يَسْتَنِدُ إِلَيْهَا فَخَرَجَ سَرَعَانُ النَّاسِ يَقُولُونَ قَصُرَتْ الصَّلَاةُ وَفِي الْقَوْمِ أَبُو بَكْرٍ وَعُمَرُ فَهَابَاهُ أَنْ يَقُولَا لَهُ شَيْئًا وَفِي الْقَوْمِ رَجُلٌ طَوِيلُ الْيَدَيْنِ يُسَمَّى ذَا الْيَدَيْنِ فَقَالَ يَا رَسُولَ اللَّهِ أَقَصُرَتْ الصَّلَاةُ أَمْ نَسِيتَ فَقَالَ لَمْ تَقْصُرْ وَلَمْ أَنْسَ قَالَ فَإِنَّمَا صَلَّيْتَ رَكْعَتَيْنِ فَقَالَ أَكَمَا يَقُولُ ذُو الْيَدَيْنِ فَقَالُوا نَعَمْ فَقَامَ فَصَلَّى رَكْعَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ سَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Abu Usamah] dari [Ibnu Aun] dari [Ibnu Sirin] dari [Abu Hurairah] ia berkata, \"Pernah bersama kami Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat salah satu sholat yang dilakukan di malam hari (antara maghrib dan isya) dua raka'at lalu salam. Kemudian beliau berdiri menghampiri sebuah kayu yang ada di masjid dan bersandar kepadanya. Orang-orang bergegas keluar seraya berkata, \"sholatnya telah diringkas! \" sementara di antara orang-orang itu ada Abu Bakar dan Umar. Dan keduanya tidak mungkin menyampaikan hal itu kepada beliau (karena keduanya sangat menghormati beliau). Di antara orang-orang itu juga ada seorang laki-laki yang keduanya tangannya panjang, hingga ia disebut Dzul Yadaini (orang yang kedua tangannya panjang), ia berkata, \"Wahai Rasulullah, apakah sholatnya diringkas atau memang engkau lupa?\" Beliau menjawab: \"sholatnya tidak diringkas dan aku juga tidak lupa. \" Dzul Yadaini berkata, \"Tetapi engkau sholat dua raka'at! \" beliau bertanya: \"Apakah benar yang dikatakan oleh Dzul Yadaini?\" para sahabat menjawab, \"Ya, \" maka beliau pun berdiri dan sholat dua raka'at, kemudian salam dan sujud dua kali, setelah itu beliau kembali salam. \""
            },
            {
                "number": 1172,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَأَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ قَالَسَلَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَلَاثِ رَكَعَاتٍ مِنْ الْعَصْرِ ثُمَّ قَامَ فَدَخَلَ الْحُجْرَةَ فَقَامَ الْخِرْبَاقُ رَجُلٌ بَسِيطُ الْيَدَيْنِ فَنَادَى يَا رَسُولَ اللَّهِ أَقَصُرَتْ الصَّلَاةُ فَخَرَجَ مُغْضَبًا يَجُرُّ إِزَارَهُ فَسَأَلَ فَأُخْبِرَ فَصَلَّى تِلْكَ الرَّكْعَةَ الَّتِي كَانَ تَرَكَ ثُمَّ سَلَّمَ ثُمَّ سَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] dan [Ahmad bin Tsabit Al Jahdari] berkata, telah menceritakan kepada kami [Abdul Wahhab] berkata, telah menceritakan kepada kami [Khalid Al Hadzdza`] dari [Abu Qilabah] dari [Abu Muhallab] dari [Imran Ibnul Hushain] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah salam pada raka'at ketiga dalam sholat ashar, lalu beliau berdiri dan masuk kamar. Maka berdirilah Al Khirbaq, seorang laki-laki yang tangannya pendek, ia berkata, \"Wahai Rasulullah, apakah sholatnya diringkas?\" beliau pun keluar dan marah sambil menjinjing kain sarungnya, beliau bertanya tentang hal itu hingga beliau diberitahu tentang hal itu. Kemudian beliau melaksanakan raka'at yang tertinggal lalu salam, kemudian beliau sujud dua kali dan salam kembali. \""
            },
            {
                "number": 1173,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا يُونُسُ بْنُ بَكِيرٍ حَدَّثَنَا ابْنُ إِسْحَقَ حَدَّثَنِي الزُّهْرِيُّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الشَّيْطَانَ يَأْتِي أَحَدَكُمْ فِي صَلَاتِهِ فَيَدْخُلُ بَيْنَهُ وَبَيْنَ نَفْسِهِ حَتَّى لَا يَدْرِيَ زَادَ أَوْ نَقَصَ فَإِذَا كَانَ ذَلِكَ فَلْيَسْجُدْ سَجْدَتَيْنِ قَبْلَ أَنْ يُسَلِّمَ ثُمَّ يُسَلِّمْ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Waki'] berkata, telah menceritakan kepada kami [Yunus bin Bukair] berkata, telah menceritakan kepada kami [Ibnu Ishaq] berkata, telah menceritakan kepadaku [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya setan datang pada salah seorang kalian di saat sholat, lalu setan masuk dan mengganggu sholatnya hingga ia tidak tahu apakah raka'atnya lebih atau kurang. Jika sudah begitu hendaklah ia sujud dua kali sebelum salam, kemudian salam. \""
            },
            {
                "number": 1174,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا يُونُسُ بْنُ بَكِيرٍ حَدَّثَنَا ابْنُ إِسْحَقَ أَخْبَرَنِي سَلَمَةُ بْنُ صَفْوَانَ بْنِ سَلَمَةَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الشَّيْطَانَ يَدْخُلُ بَيْنَ ابْنِ آدَمَ وَبَيْنَ نَفْسِهِ فَلَا يَدْرِي كَمْ صَلَّى فَإِذَا وَجَدَ ذَلِكَ فَلْيَسْجُدْ سَجْدَتَيْنِ قَبْلَ أَنْ يُسَلِّمَ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Waki'] berkata, telah menceritakan kepada kami [Yunus bin Bukair] berkata, telah menceritakan kepada kami [Ibnu Ishaq] berkata, telah mengabarkan kepadaku [Salamah bin Shofwan bin Salamah] dari [Abu Salamah] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya setan masuk antara anak Adam dan hatinya, hingga tidak tahu berapa raka'at yang telah ia kerjakan. Maka jika ia mendapatkan hal seperti itu hendaklah sujud dua kali sebelum salam. \""
            },
            {
                "number": 1175,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَأَنَّ ابْنَ مَسْعُودٍ سَجَدَ سَجْدَتَيْ السَّهْوِ بَعْدَ السَّلَامِ وَذَكَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Khallad] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Manshur] dari [Ibrahim] dari [Alqamah] berkata, \" [Ibnu Mas'ud] pernah sujud sahwi dengan dua kali sujud setelah salam, lalu ia menyebutkan bahwa Nabi shallallahu 'alaihi wasallam melakukan seperti itu. \""
            },
            {
                "number": 1176,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُبَيْدٍ عَنْ زُهَيْرِ بْنِ سَالِمٍ الْعَنْسِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ ثَوْبَانَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي كُلِّ سَهْوٍ سَجْدَتَانِ بَعْدَ مَا يُسَلِّمُ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] dan [Utsman bin Abu Syaibah] keduanya berkata; telah menceritakan kepada kami [Isma'il bin Ayyasy] dari [ubaidhullah bin Ubaid] dari [Zuhair bin Salim Al 'Ansi] dari ['Abdurrahman bin Jubair bin Nufair] dari [Tsauban] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sujud sahwi itu sujud dua kali setelah salam. \""
            }
        ]
    }
}