{
    "status": true,
    "data": {
        "start": 883,
        "end": 1029,
        "total": 147,
        "book": "ibnu-majah",
        "hadits": [
            {
                "number": 883,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ وَمُحَمَّدُ بْنُ فُضَيْلٍ وَأَبُو يَحْيَى التَّيْمِيُّ وَابْنُ الْأَجْلَحِ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَصْلَتَانِ لَا يُحْصِيهِمَا رَجُلٌ مُسْلِمٌ إِلَّا دَخَلَ الْجَنَّةَ وَهُمَا يَسِيرٌ وَمَنْ يَعْمَلُ بِهِمَا قَلِيلٌ يُسَبِّحُ اللَّهَ فِي دُبُرِ كُلِّ صَلَاةٍ عَشْرًا وَيُكَبِّرُ عَشْرًا وَيَحْمَدُ عَشْرًا فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْقِدُهَا بِيَدِهِ فَذَلِكَ خَمْسُونَ وَمِائَةٌ بِاللِّسَانِ وَأَلْفٌ وَخَمْسُ مِائَةٍ فِي الْمِيزَانِ وَإِذَا أَوَى إِلَى فِرَاشِهِ سَبَّحَ وَحَمِدَ وَكَبَّرَ مِائَةً فَتِلْكَ مِائَةٌ بِاللِّسَانِ وَأَلْفٌ فِي الْمِيزَانِ فَأَيُّكُمْ يَعْمَلُ فِي الْيَوْمِ أَلْفَيْنِ وَخَمْسَ مِائَةِ سَيِّئَةٍ قَالُوا وَكَيْفَ لَا يُحْصِيهِمَا قَالَ يَأْتِي أَحَدَكُمْ الشَّيْطَانُ وَهُوَ فِي الصَّلَاةِ فَيَقُولُ اذْكُرْ كَذَا وَكَذَا حَتَّى يَنْفَكَّ الْعَبْدُ لَا يَعْقِلُ وَيَأْتِيهِ وَهُوَ فِي مَضْجَعِهِ فَلَا يَزَالُ يُنَوِّمُهُ حَتَّى يَنَامَ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Isma'il bin 'Ulayyah] dan [Muhammad bin Fudlail] dan [Abu Yahya At Taimi] dan [Ibnul Ajlah] dari ['Atho` bin As Sa`ib] dari [Bapaknya] dari [Abdullah bin Amru] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada dua perkara tidaklah seorang muslim menjaganya kecuali ia akan masuk surga, mudah diamalkan namun sedikit yang melakukannya; bertasbih di setiap usai sholat sepuluh kali, bertakbir sepuluh kali dan bertahmid sepuluh kali. \" Lalu aku melihat Rasulullah shallallahu 'alaihi wasallam menghitung dengan jarinya, maka yang demikian itu menjadi seratus lima puluh di lisan dan seribu lima ratus dalam timbangan. Apabila beranjak ke tempat pembaringannya (tidur), beliau bertasbih, bertahmid dan bertakbir seratus kali, maka itu seratus di lisan dan seribu dalam timbangan. Siapa di antara kalian yang melakukan dua ribu lima ratus kejahatan! \" Mereka berkata, \"Bagaimana jika kami tidak menjaga dua perkara tersebut?\" Rasulullah shallallahu 'alaihi wasallam menjawab, \"Setan akan mendatangi salah seorang di antara kalian dalam sholat, lalu setan berkata; 'ingat ini dan itu' hingga seorang hamba terpisah dan tidak ingat sholatnya. Setan juga akan mendatanginya saat di pembaringannya (tidur). Maka setan senantiasa menidurkannya hingga dia tertidur. \""
            },
            {
                "number": 884,
                "arab": "حَدَّثَنَا الْحُسَيْنُ بْنُ الْحَسَنِ الْمَرْوَزِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ بِشْرِ بْنِ عَاصِمٍ عَنْ أَبِيهِ عَنْ أَبِي ذَرٍّ قَالَقِيلَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرُبَّمَا قَالَ سُفْيَانُ قُلْتُ يَا رَسُولَ اللَّهِ ذَهَبَ أَهْلُ الْأَمْوَالِ وَالدُّثُورِ بِالْأَجْرِ يَقُولُونَ كَمَا نَقُولُ وَيُنْفِقُونَ وَلَا نُنْفِقُ قَالَ لِي أَلَا أُخْبِرُكُمْ بِأَمْرٍ إِذَا فَعَلْتُمُوهُ أَدْرَكْتُمْ مَنْ قَبْلَكُمْ وَفُتُّمْ مَنْ بَعْدَكُمْ تَحْمَدُونَ اللَّهَ فِي دُبُرِ كُلِّ صَلَاةٍ وَتُسَبِّحُونَ وَتُكَبِّرُونَ ثَلَاثًا وَثَلَاثِينَ وَثَلَاثًا وَثَلَاثِينَ وَأَرْبَعًا وَثَلَاثِينَقَالَ سُفْيَانُ لَا أَدْرِي أَيَّتُهُنَّ أَرْبَعٌ",
                "id": "Telah menceritakan kepada kami [Al Husain Ibnul Hasan Al Marwazi] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Bisyr bin Ashim] dari [Bapaknya] dari [Abu Dzar] ia berkata, \"Dikatakan kepada Nabi shallallahu 'alaihi wasallam, dan barangkali Sufyan mengatakan, \"Aku bertanya, \"Wahai Rasulullah, orang-orang kaya banyak pergi dengan membawa pahala! Mereka berkata sebagaimana kami berkata, namun mereka dapat berinfak sementara kami tidak! \" beliau bersabda kepadaku: \"Maukah aku kabarkan kepada kalian suatu perkara yang jika kalian lakukan, maka kalian akan dapat melampaui orang-orang sebelum kalian dan meninggalkan orang-orang setelah kalian? Bertahmidlah kepada Allah setiap selesai sholat tiga puluh tiga kali, bertasbih tiga puluh tiga kali dan bertakbir tiga puluh empat kali. \" Sufyan berkata, \"Aku tidak tahu mana yang harus dibaca empat (tiga puluh empat)?\""
            },
            {
                "number": 885,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ حَبِيبٍ حَدَّثَنَا الْأَوْزَاعِيُّ ح و حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي شَدَّادٌ أَبُو عَمَّارٍ حَدَّثَنِي أَبُو أَسْمَاءَ الرَّحَبِيُّ حَدَّثَنِي ثَوْبَانُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا انْصَرَفَ مِنْ صَلَاتِهِ اسْتَغْفَرَ ثَلَاثَ مَرَّاتٍ ثُمَّ يَقُولُ اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Abdul Hamid bin Habib] berkata, telah menceritakan kepada kami [Al Auza'i]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim Ad Dimasyqi] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Al Auza'i] berkata, telah menceritakan kepadaku [Syaddad Abu Ammar] berkata, telah menceritakan kepadaku [Abu Asma Ar Rahabi] berkata, telah menceritakan kepadaku [Tsauban] berkata, \"Rasulullah shallallahu 'alaihi wasallam jika selesai sholat beliau beranjak seraya mengucapkan istighfar tiga kali, setelah itu beliau mengucapkan: \"ALLAHUMMA ANTAS SALAAM WA MINKAS SALAAM TABAARAKTA YAA DZAL JALAALI WAL IKRAM. \""
            },
            {
                "number": 886,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ عَنْ قَبِيصَةَ بْنِ هُلْبٍ عَنْ أَبِيهِ قَالَأَمَّنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ يَنْصَرِفُ عَنْ جَانِبَيْهِ جَمِيعًا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Al Ahwash] dari [Simak] dari [Qabishah bin Hulaib] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengimami kami, dan beliau berlalu pergi dari sisi kanan dan sisi kiri. \""
            },
            {
                "number": 887,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَا حَدَّثَنَا الْأَعْمَشُ عَنْ عُمَارَةَ عَنْ الْأَسْوَدِ قَالَقَالَ عَبْدُ اللَّهِ لَا يَجْعَلَنَّ أَحَدُكُمْ لِلشَّيْطَانِ فِي نَفْسِهِ جُزْءًا يَرَى أَنَّ حَقًّا لِلَّهِ عَلَيْهِ أَنْ لَا يَنْصَرِفَ إِلَّا عَنْ يَمِينِهِ قَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْثَرُ انْصِرَافِهِ عَنْ يَسَارِهِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki']. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakr bin Khallad] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] keduanya berkata; telah menceritakan kepada kami [Al A'masy] dari [Umarah] dari [Al Aswad] berkata; [Abdullah] berkata, \"Jangan sekali-kali salah seorang dari kalian memberi celah kepada setan dalam dirinya; ia memandang bahwa hak Allah atas dirinya adalah meninggalkan tempat sholat dari sebelah kanannya. Sungguh saya pernah melihat Rasulullah shallallahu 'alaihi wasallam sering meninggalkan tempat sholat dari sebelah kirinya. \""
            },
            {
                "number": 888,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْفَتِلُ عَنْ يَمِينِهِ وَعَنْ يَسَارِهِ فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Bisyr bin Hilal Ash Shawwaf] berkata, telah menceritakan kepada kami [Yazid bin Zura'] dari [Husain Al Mu'allim] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam berpaling ke kanan dan ke kiri dalam sholat. \""
            },
            {
                "number": 889,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْمَلِكِ بْنِ وَاقِدٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ هِنْدٍ بِنْتِ الْحَارِثِ عَنْ أُمِّ سَلَمَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَلَّمَ قَامَ النِّسَاءُ حِينَ يَقْضِي تَسْلِيمَهُ ثُمَّ يَلْبَثُ فِي مَكَانِهِ يَسِيرًا قَبْلَ أَنْ يَقُومَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ahmad bin Abdul Malik bin Waqid] berkata, telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Ibnu Syihab] dari [Hind binti Al Harits] dari [Ummu Salamah] ia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam salam dan sempurna salamnya kaum wanita bangun (untuk pergi), kemudian beliau diam sebentar di tempatnya sebelum pergi. \""
            },
            {
                "number": 890,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا وُضِعَ الْعَشَاءُ وَأُقِيمَتْ الصَّلَاةُ فَابْدَءُوا بِالْعَشَاءِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika makan malam telah terhidang kemudian iqamah dikumandangkan, maka mulailah dengan makan malam. \""
            },
            {
                "number": 891,
                "arab": "حَدَّثَنَا أَزْهَرُ بْنُ مَرْوَانَ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وُضِعَ الْعَشَاءُ وَأُقِيمَتْ الصَّلَاةُ فَابْدَءُوا بِالْعَشَاءِقَالَ فَتَعَشَّى ابْنُ عُمَرَ لَيْلَةً وَهُوَ يَسْمَعُ الْإِقَامَةَ",
                "id": "Telah menceritakan kepada kami [Azhar bin Marwan] berkata, telah menceritakan kepada kami [Abdul Warits] berkata, telah menceritakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika makan malam telah terhidang kemudian iqamah dikumandangkan, maka mulailah dengan makan malam. \" Nafi' berkata, \"Ibnu Umar tetap makan malam meskipun ia mendengar iqamah. \""
            },
            {
                "number": 892,
                "arab": "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ ح و حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ جَمِيَعًا عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا حَضَرَ الْعَشَاءُ وَأُقِيمَتْ الصَّلَاةُ فَابْدَءُوا بِالْعَشَاءِ",
                "id": "Telah menceritakan kepada kami [Sahl bin Abu Sahl] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] semuanya dari [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika makan malam telah terhidang dan iqamhan dikumandangkan, maka dahulukanlah makan malam. \""
            },
            {
                "number": 893,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي الْمَلِيحِ قَالَخَرَجْتُ فِي لَيْلَةٍ مَطِيرَةٍ فَلَمَّا رَجَعْتُ اسْتَفْتَحْتُ فَقَالَ أَبِي مَنْ هَذَا قَالَ أَبُو الْمَلِيحِ قَالَ لَقَدْ رَأَيْتُنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْحُدَيْبِيَةِ وَأَصَابَتْنَا سَمَاءٌ لَمْ تَبُلَّ أَسَافِلَ نِعَالِنَا فَنَادَى مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلُّوا فِي رِحَالِكُمْ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Khalid Al Hadzdza`] dari [Abu Al Malih] berkata; Aku keluar di malam yang penuh hujan, ketika pulang aku langsung meminta untuk dibukakan pintu. Bapakku bertanya, \"Siapa itu?\" \"Abu Al Malih, \" jawabku. [Bapakku] berkata, \"Pada hari Hudaibiah aku pernah bersama Rasulullah shallallahu 'alaihi wasallam, lalu kami kehujanan namun tidak sampai membasahi sandal kami, kemudian berserulah utusan Rasulullah shallallahu 'alaihi wasallam, \"sholatlah di rumah-rumah kalian. \""
            },
            {
                "number": 894,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنَادِي مُنَادِيهِ فِي اللَّيْلَةِ الْمَطِيرَةِ أَوْ اللَّيْلَةِ الْبَارِدَةِ ذَاتِ الرِّيحِ صَلُّوا فِي رِحَالِكُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menyeru penyerunya di malam yang penuh hujan, atau malam yang dingin berangin agar menyerukan; \"sholatlah di rumah-rumah kalian. \""
            },
            {
                "number": 895,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْوَهَّابِ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ عَنْ عَبَّادِ بْنِ مَنْصُورٍ قَالَ سَمِعْتُ عَطَاءً يُحَدِّثُ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ فِي يَوْمِ جُمُعَةٍ يَوْمِ مَطَرٍ صَلُّوا فِي رِحَالِكُمْ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Abdul Wahhab] berkata, telah menceritakan kepada kami [Adl Dlahhak bin Makhlad] dari [Abbad bin Mashur] berkata; aku mendengar ['Atho`] menceritakan dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda di hari jum'at yang hujan: \"sholatlah di rumah-rumah kalian. \""
            },
            {
                "number": 896,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ الْمُهَلَّبِيُّ حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍأَنَّ ابْنَ عَبَّاسٍ أَمَرَ الْمُؤَذِّنَ أَنْ يُؤَذِّنَ يَوْمَ الْجُمُعَةِ وَذَلِكَ يَوْمٌ مَطِيرٌ فَقَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ ثُمَّ قَالَ نَادِ فِي النَّاسِ فَلْيُصَلُّوا فِي بُيُوتِهِمْ فَقَالَ لَهُ النَّاسُ مَا هَذَا الَّذِي صَنَعْتَ قَالَ قَدْ فَعَلَ هَذَا مَنْ هُوَ خَيْرٌ مِنِّيتَأْمُرُنِي أَنْ أُخْرِجَ النَّاسَ مِنْ بُيُوتِهِمْ فَيَأْتُونِي يَدُوسُونَ الطِّينَ إِلَى رُكَبِهِمْ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah] berkata, telah menceritakan kepada kami [Abbad bin Abbad Al Muhallibi] berkata, telah menceritakan kepada kami [Ashim Al Ahwal] dari [Abdullah Ibnul Harits bin Naifal] bahwa [Ibnu Abbas] memerintahkan kepada mu`adzdzin untuk adzan di hari jum'at yang penuh hujan, lalu ia menyerukan, \"ALLAHU AKBAR, ALLAHU AKBAR, ASYHADU AN LAA ILAAHA ILLA ALLAHU, ASYHADU ANNA MUHAMMADAN RASUULULLAH. \" Kemudian Ibnu Abbas berkata, \"Serukanlah kepada manusia agar mereka sholat di rumah-rumah mereka. \" hingga orang-orang pun berkata kepadanya, \"Apa-apaan yang engkau lakukan ini?\" Ibnu Abbas menjawab, \"Orang yang lebih baik dariku telah melakukan ini, tapi kenapa kalian menyuruhku agar mengeluarkan manusia dari rumah mereka (untuk sholat di hari yang penuh hujan), hingga mereka mendatangiku berjalan di atas tanah yang becek. \""
            },
            {
                "number": 897,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ أَبِيهِ قَالَكُنَّا نُصَلِّي وَالدَّوَابُّ تَمُرُّ بَيْنَ أَيْدِينَا فَذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مِثْلُ مُؤَخِّرَةِ الرَّحْلِ تَكُونُ بَيْنَ يَدَيْ أَحَدِكُمْ فَلَا يَضُرُّهُ مَنْ مَرَّ بَيْنَ يَدَيْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Umar bin Ubaid] dari [Simak bin Harb] dari [Musa bin Thalhah] dari [Bapaknya] berkata; Kami sholat sementara hewan-hewan tunggangan melintas di hadapan kami, lalu hal itu diceritakan kepada Rasulullah shallallahu 'alaihi wasallam, beliau pun bersabda: \"Itu seperti pelana yang ada di hadapan salah seorang dari kalian, maka tidak apa-apa jika ada yang melintas di hadapannya. \" "
            },
            {
                "number": 898,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُخْرَجُ لَهُ حَرْبَةٌ فِي السَّفَرِ فَيَنْصِبُهَا فَيُصَلِّي إِلَيْهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Abdullah bin Raja` Al Makki] dari [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Dalam sebuah perjalanan Nabi shallallahu 'alaihi wasallam diberi sebuah tombak kecil, lalu beliau menancapkannya dan sholat menghadap ke arahnya. \""
            },
            {
                "number": 899,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ قَالَتْكَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَصِيرٌ يُبْسَطُ بِالنَّهَارِ وَيَحْتَجِرُهُ بِاللَّيْلِ يُصَلِّي إِلَيْهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Bisyr] dari [ubaidhullah bin Umar] berkata, telah menceritakan kepadaku [Sa'id bin Abu Sa'id] dari [Abu Salamah bin 'Abdurrahman] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mempunyai tikar yang dibentangkan di siang hari, dan menggulungnya (seperti batu) di malam hari, lalu sholat menghadap ke arahnya. \""
            },
            {
                "number": 900,
                "arab": "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ حَدَّثَنَا حُمَيْدُ بْنُ الْأَسْوَدِ حَدَّثَنَا إِسْمَعِيلُ بْنُ أُمَيَّةَ ح و حَدَّثَنَا عَمَّارُ بْنُ خَالِدٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ أَبِي عَمْرِو بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حُرَيْثٍ عَنْ جَدِّهِ حُرَيْثِ بْنِ سُلَيْمٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ فَلْيَجْعَلْ تِلْقَاءَ وَجْهِهِ شَيْئًا فَإِنْ لَمْ يَجِدْ فَلْيَنْصِبْ عَصًا فَإِنْ لَمْ يَجِدْ فَلْيَخُطَّ خَطًّا ثُمَّ لَا يَضُرُّهُ مَا مَرَّ بَيْنَ يَدَيْهِ",
                "id": "Telah menceritakan kepada kami [Bakr bin Khalaf Abu Bisyr] berkata, telah menceritakan kepada kami [Humaid Ibnul Aswad] berkata, telah menceritakan kepada kami [Isma'il bin Umayyah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ammar bin Khalid] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Isma'il bin Umayyah] dari [Abu Amru bin Muhammad bin Amru bin Huraits] dari Kakeknya [Huraits bin Sulaim] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika salah seorang dari kalian sholat hendaklah meletakkan sesuatu di depannya, jika tidak mendapatkan sesuatu hendaklah menancapkan tongkat, dan jika tidak mendapatkan hendaklah membuat garis. Setelah itu tidak akan membahayakannya apa-apa yang melintas di depannya. \""
            },
            {
                "number": 901,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ سَالِمٍ أَبِي النَّضْرِ عَنْ بُسْرِ بْنِ سَعِيدٍ قَالَأَرْسَلُونِي إِلَى زَيْدِ بْنِ خَالِدٍ أَسْأَلُهُ عَنْ الْمُرُورِ بَيْنَ يَدَيْ الْمُصَلِّي فَأَخْبَرَنِي عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَأَنْ يَقُومَ أَرْبَعِينَ خَيْرٌ لَهُ مِنْ أَنْ يَمُرَّ بَيْنَ يَدَيْهِقَالَ سُفْيَانُ فَلَا أَدْرِي أَرْبَعِينَ سَنَةً أَوْ شَهْرًا أَوْ صَبَاحًا أَوْ سَاعَةً",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Salim Abu An Nadlr] dari [Busr bin Sa'id] berkata; Kaumku mengutusku menemui [Zaid bin Khalid], lalu aku bertanya kepadanya tentang hukum melintas di depan orang yang sholat. Maka ia pun memberiku kabar dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sekiranya seseorang berdiri selama empat puluh, maka itu lebih baik daripada ia melintas di depan orang yang sholat. \" Sufyan berkata, \"Aku tidak tahu, apakah itu empat puluh tahun, atau empat puluh bulan, atau empat puluh pagi, atau empat puluh saat. \""
            },
            {
                "number": 902,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ سَالِمٍ أَبِي النَّضْرِ عَنْ بُسْرِ بْنِ سَعِيدٍأَنَّ زَيْدَ بْنَ خَالِدٍ أَرْسَلَ إِلَى أَبِي جُهَيْمٍ الْأَنْصَارِيِّ يَسْأَلُهُ مَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّجُلِ يَمُرُّ بَيْنَ يَدَيْ الرَّجُلِ وَهُوَ يُصَلِّي فَقَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَوْ يَعْلَمُ أَحَدُكُمْ مَا لَهُ أَنْ يَمُرَّ بَيْنَ يَدَيْ أَخِيهِ وَهُوَ يُصَلِّي كَانَ لَأَنْ يَقِفَ أَرْبَعِينَ قَالَ لَا أَدْرِي أَرْبَعِينَ عَامًا أَوْ أَرْبَعِينَ شَهْرًا أَوْ أَرْبَعِينَ يَوْمًا خَيْرٌ لَهُ مِنْ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Sufyan] dari [Salim Abu An Nadlr] dari [Busr bin Sa'id] bahwa Zaid bin Khalid mengutus seseorang kepada [Abu Juhaim Al Anshari] untuk bertanya kepadanya; apa yang engkau dengar dari Rasulullah shallallahu 'alaihi wasallam tentang seorang laki-laki yang melintas di depan orang yang sholat. Lalu ia menjawab, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Sekiranya salah seorang dari kalian tahu apa yang akan menimpanya ketika melintas di depan orang yang sedang sholat, maka ia berdiri selama empat puluh -ia berkata, \"Aku tidak tahu apakah itu empat puluh tahun, atau empat puluh bulan atau empat puluh hari, \"- lebih baik baginya daripada melintas di depannya. \""
            },
            {
                "number": 903,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَوْهِبٍ عَنْ عَمِّهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ يَعْلَمُ أَحَدُكُمْ مَا لَهُ فِي أَنْ يَمُرَّ بَيْنَ يَدَيْ أَخِيهِ مُعْتَرِضًا فِي الصَّلَاةِ كَانَ لَأَنْ يُقِيمَ مِائَةَ عَامٍ خَيْرٌ لَهُ مِنْ الْخَطْوَةِ الَّتِي خَطَاهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki'] dari [ubaidhullah bin 'Abdurrahman bin Mauhib] dari [Pamannya] dari [Abu Hurairah] ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Sekiranya salah seorang dari kalian tahu apa yang akan menimpanya ketika melintas di depan saudaranya yang sedang sholat, maka berdiri selama seratus tahun adalah lebih baik daripada melangkahkan kaki (melintasinya). \""
            },
            {
                "number": 904,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِعَرَفَةَ فَجِئْتُ أَنَا وَالْفَضْلُ عَلَى أَتَانٍ فَمَرَرْنَا عَلَى بَعْضِ الصَّفِّ فَنَزَلْنَا عَنْهَا وَتَرَكْنَاهَا ثُمَّ دَخَلْنَا فِي الصَّفِّ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [ubaidhullah bin Abdullah] dari [Ibnu Abbas] berkata, \"Nabi shallallahu 'alaihi wasallam sholat di Arafah, lalu aku dan Al Fadll datang dengan menunggang himar, kami melintas di depan sebagian shaf. Lalu kami turun dan masuk ke dalam shaf, sementara himar kami tinggalkan begitu saja. \""
            },
            {
                "number": 905,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ هُوَ قَاصُّ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ أَبِيهِ عَنْ أُمِّ سَلَمَةَ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي حُجْرَةِ أُمِّ سَلَمَةَ فَمَرَّ بَيْنَ يَدَيْهِ عَبْدُ اللَّهِ أَوْ عُمَرُ بْنُ أَبِي سَلَمَةَ فَقَالَ بِيَدِهِ فَرَجَعَ فَمَرَّتْ زَيْنَبُ بِنْتُ أُمِّ سَلَمَةَ فَقَالَ بِيَدِهِ هَكَذَا فَمَضَتْ فَلَمَّا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هُنَّ أَغْلَبُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki'] dari [Usamah bin Zaid] dari [Muhammad bin Qais] -ia adalah Qash Umar bin Abdul Aziz- dari [Bapaknya] dari [Ummu Salamah] ia berkata, \"Nabi shallallahu 'alaihi wasallam sholat di kamar Ummu Salamah, lalu Abdullah atau Umar bin Abu Salamah melintas di hadapan beliau. Maka beliau bersabda dengan isyarat tangannya hingga ia pun kembali. Setelah itu Zainab binti Ummu Salamah lewat dan beliau juga bersabda dengan tangannya seperti ini, hingga iapun kembali lagi. Ketika Rasulullah shallallahu 'alaihi wasallam selesai sholat, beliau bersabda: \"Mereka (wanita) lebih sering (berbuat maksiat dan menyimpang). \""
            },
            {
                "number": 906,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا قَتَادَةُ حَدَّثَنَا جَابِرُ بْنُ زَيْدٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَقْطَعُ الصَّلَاةَ الْكَلْبُ الْأَسْوَدُ وَالْمَرْأَةُ الْحَائِضُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Khallad Al Bahili] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah menceritakan kepada kami [Qatadah] berkata, telah menceritakan kepada kami [Jabir bin Zaid] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Yang memutus sholat adalah anjing hitam dan wanita haid. \""
            },
            {
                "number": 907,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ أَبُو طَالِبٍ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنَا أَبِي عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَقْطَعُ الصَّلَاةَ الْمَرْأَةُ وَالْكَلْبُ وَالْحِمَارُ",
                "id": "Telah menceritakan kepada kami [Zaid bin Akhzam Abu Thalib] berkata, telah menceritakan kepada kami [Mu'adz bin Hisyam] berkata, telah menceritakan kepada kami [Bapakku] dari [Qatadah] dari [Zurarah bin Aufa] dari [Sa'd bin Hisyam] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Yang memutus sholat adalah wanita, anjing dan himar. \""
            },
            {
                "number": 908,
                "arab": "حَدَّثَنَا جَمِيلُ بْنُ الْحَسَنِ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَقْطَعُ الصَّلَاةَ الْمَرْأَةُ وَالْكَلْبُ وَالْحِمَارُ",
                "id": "Telah menceritakan kepada kami [Jamil Ibnul Hasan] berkata, telah menceritakan kepada kami [Abdul A'la] berkata, telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Abdullah bin Mughaffal] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Yang memutus sholat adalah wanita, anjing dan himar. \""
            },
            {
                "number": 909,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَقْطَعُ الصَّلَاةَ إِذَا لَمْ يَكُنْ بَيْنَ يَدَيْ الرَّجُلِ مِثْلُ مُؤَخِّرَةِ الرَّحْلِ الْمَرْأَةُ وَالْحِمَارُ وَالْكَلْبُ الْأَسْوَدُ قَالَ قُلْتُ مَا بَالُ الْأَسْوَدِ مِنْ الْأَحْمَرِ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا سَأَلْتَنِي فَقَالَ الْكَلْبُ الْأَسْوَدُ شَيْطَانٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] dari [Syu'bah] dari [Humaid bin Hilal] dari [Abdullah bin Ash Shamit] dari [Abu Dzar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika di depan orang yang sholat tidak ada sesuatu seperti pelana, maka yang akan memutuskan sholat adalah wanita, himar dan anjing hitam, \" Abdullah bin Ash Shamit berkata, \"Aku bertanya, \"Kenapa harus anjing hitam dan tidak merah?\" Abu Dzar menjawab: \"Aku pernah bertanya Rasulullah shallallahu 'alaihi wasallam sebagaimana yang engkau tanyakan kepadaku, beliau menjawab: \"Anjing hitam adalah setan. \" "
            },
            {
                "number": 910,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا يَحْيَى أَبُو الْمُعَلَّى عَنْ الْحَسَنِ الْعُرَنِيِّ قَالَذُكِرَ عِنْدَ ابْنِ عَبَّاسٍ مَا يَقْطَعُ الصَّلَاةَ فَذَكَرُوا الْكَلْبَ وَالْحِمَارَ وَالْمَرْأَةَ فَقَالَ مَا تَقُولُونَ فِي الْجَدْيِ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي يَوْمًا فَذَهَبَ جَدْيٌ يَمُرُّ بَيْنَ يَدَيْهِ فَبَادَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقِبْلَةَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah] berkata, telah memberitakan kepada kami [Hammad bin Zaid] berkata, telah menceritakan kepada kami [Yahya bin Al Mu'alla] dari [Al Hasan Al 'Urani] ia berkata, \"Disebut-sebut di sisi Ibnu Abbas sesuatu yang dapat memutuskan sholat, mereka menyebutkan anjing, himar dan wanita. Maka [Ibnu Abbas] pun berkata, \"Kalian tidak menyebut anak kambing! Sungguh, suatu hari Rasulullah shallallahu 'alaihi wasallam sholat, lalu seekor anak kambing melintas dan Rasulullah shallallahu 'alaihi wasallam segera mendahuluinya ke arah kiblat (hingga kambing itu lewat di belakang beliau). \""
            },
            {
                "number": 911,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ ابْنِ عَجْلَانَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى أَحَدُكُمْ فَلْيُصَلِّ إِلَى سُتْرَةٍ وَلْيَدْنُ مِنْهَا وَلَا يَدَعْ أَحَدًا يَمُرُّ بَيْنَ يَدَيْهِ فَإِنْ جَاءَ أَحَدٌ يَمُرُّ فَلْيُقَاتِلْهُ فَإِنَّهُ شَيْطَانٌ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Ibnu 'Ajlan] dari [Zaid bin Aslam] dari ['Abdurrahman bin Abu Sa'id] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian sholat, hendaklah menghadap ke sutrah dan mendekatinya. Jangan membiarkan seseorang melintas di depannya, jika ada seseorang yang melintasinya hendaklah ia bunuh sebab dia adalah setan. \""
            },
            {
                "number": 912,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ الْحَمَّالُ وَالْحَسَنُ بْنُ دَاوُدَ الْمُنْكَدِرِيُّ قَالَا حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ عَنْ صَدَقَةَ بْنِ يَسَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلَا يَدَعْ أَحَدًا يَمُرُّ بَيْنَ يَدَيْهِ فَإِنْ أَبَى فَلْيُقَاتِلْهُ فَإِنَّ مَعَهُ الْقَرِينَو قَالَ الْمُنْكَدِرِيُّ فَإِنَّ مَعَهُ الْعُزَّى",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah Al Hammal] dan [Al Hasan bin Dawud Al Munkadiri] keduanya berkata; telah menceritakan kepada kami [Ibnu Abu Fudaik] dari [Adl Dlahhak bin Utsman] dari [Shodaqoh bin Yasar] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian sholat maka jangan membiarkan seorang pun melintas di depannya, jika ia enggan maka bunuhlah sebab ia membawa qarin (setan). \" Al Munkadiri menyebutkan, \"Sesungguhnya ia bersama Al 'Uzza. \""
            },
            {
                "number": 913,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي مِنْ اللَّيْلِ وَأَنَا مُعْتَرِضَةٌ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ كَاعْتِرَاضِ الْجِنَازَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] berkata, \"Nabi shallallahu 'alaihi wasallam sholat malam sementara aku berbaring antara beliau dan arah kiblat seperti jenazah. \""
            },
            {
                "number": 914,
                "arab": "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ وَسُوَيْدُ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي قِلَابَةَ عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ عَنْ أُمِّهَا قَالَتْكَانَ فِرَاشُهَا بِحِيَالِ مَسْجَدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Bakr bin Khalaf] dan [Suwaid bin Sa'id] keduanya berkata; telah menceritakan kepada kami [Yazid bin Zurai'] berkata, telah menceritakan kepada kami [Khalid Al Hadzdza`] dari [Abu Qilabah] dari [Zainab binti Abu Salamah] dari [Ibunya] ia berkata, \"Letak tempat tidurnya berhadapan dengan tempat sujud Rasulullah shallallahu 'alaihi wasallam. \""
            },
            {
                "number": 915,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ عَنْ الشَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ قَالَ حَدَّثَتْنِي مَيْمُونَةُ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَأَنَا بِحِذَائِهِ وَرُبَّمَا أَصَابَنِي ثَوْبُهُ إِذَا سَجَدَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abbad Ibnul Awwam] dari [Asy Syaibani] dari [Abdullah bin Syaddad] berkata; [Maimunah] isteri Nabi shallallahu 'alaihi wasallam menceritakan kepadaku, ia berkata, \"Nabi shallallahu 'alaihi wasallam sholat sedang aku berada di kakinya. Dan bisa jadi kain beliau mengenaiku di saat beliau sujud. \""
            },
            {
                "number": 916,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنِي أَبُو الْمِقْدَامِ عَنْ مُحَمَّدِ بْنِ كَعْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُصَلَّى خَلْفَ الْمُتَحَدِّثِ وَالنَّائِمِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ismail] berkata, telah menceritakan kepada kami [Zaid bin Al Hubab] berkata, telah menceritakan kepadaku [Abul Miqdam] dari [Muhammad bin Ka'b] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang sholat di belakang orang yang berhadats dan orang tidur. \" "
            },
            {
                "number": 917,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُنَا أَنْ لَا نُبَادِرَ الْإِمَامَ بِالرُّكُوعِ وَالسُّجُودِ وَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا سَجَدَ فَاسْجُدُوا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Ubaid] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Nabi shallallahu 'alaihi wasallam mengajarkan kami agar tidak mendahului imam ketika rukuk dan sujud; jika imam takbir maka takbirlah dan jika imam sujud maka sujudlah. \""
            },
            {
                "number": 918,
                "arab": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ وَسُوَيْدُ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا مُحَمَّدُ بْنُ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا يَخْشَى الَّذِي يَرْفَعُ رَأْسَهُ قَبْلَ الْإِمَامِ أَنْ يُحَوِّلَ اللَّهُ رَأْسَهُ رَأْسَ حِمَارٍ",
                "id": "Telah menceritakan kepada kami [Humaid bin Mas'adah] dan [Suwaid bin Sa'id] keduanya berkata; telah menceritakan kepada kami [Hammad bin Zaid] berkata, telah menceritakan kepada kami [Muhammad bin Ziyad] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak takutkah orang yang mengangkat kepalanya sebelum imam, Allah akan merubah kepalanya menjadi kepala himar. \""
            },
            {
                "number": 919,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبُو بَدْرٍ شُجَاعُ بْنُ الْوَلِيدِ عَنْ زِيَادِ بْنِ خَيْثَمَةَ عَنْ أَبِي إِسْحَقَ عَنْ دَارِمٍ عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي قَدْ بَدَّنْتُ فَإِذَا رَكَعْتُ فَارْكَعُوا وَإِذَا رَفَعْتُ فَارْفَعُوا وَإِذَا سَجَدْتُ فَاسْجُدُوا وَلَا أُلْفِيَنَّ رَجُلًا يَسْبِقُنِي إِلَى الرُّكُوعِ وَلَا إِلَى السُّجُودِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Abu Badr Syuja' bin Al Walid] dari [Ziyad bin Khaitsamah] dari [Abu Ishaq] dari [Darim] dari [Sa'id bin Abu Burdah] dari [Abu Burdah] dari [Abu Musa] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku telah lanjut usia, jika aku rukuk maka rukuklah, jika aku mengangkat kepala maka angkatlah kepala kalian, dan jika aku sujud maka sujudlah. Aku tidak ingin ada orang yang mendahului aku dalam rukuk dan sujud. \""
            },
            {
                "number": 920,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ عَجْلَانَ ح و حَدَّثَنَا أَبُو بِشْرٍ بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ عَجْلَانَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ ابْنِ مُحَيْرِيزٍ عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُبَادِرُونِي بِالرُّكُوعِ وَلَا بِالسُّجُودِ فَمَهْمَا أَسْبِقْكُمْ بِهِ إِذَا رَكَعْتُ تُدْرِكُونِي بِهِ إِذَا رَفَعْتُ وَمَهْمَا أَسْبِقْكُمْ بِهِ إِذَا سَجَدْتُ تُدْرِكُونِي بِهِ إِذَا رَفَعْتُ إِنِّي قَدْ بَدَّنْتُ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan] dari [Ibnu 'Ajlan]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bisyr bakr bin Khalaf] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu 'Ajlan] dari [Muhammad bin Yahya bin Habban] dari [Ibnu Muhairiz] dari [Mu'awiyah bin Abu Sufyan] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jangan kalian mendahuluiku dalam rukuk dan sujud. Karena segala rukuk yang lebih dahulu kulakukan sebelum kalian, bisa kalian lakukan saat aku tengah mengangkat rukuk. Dan segala sujud yang lebih dahulu kulakukan sebelum kalian, bisa kalian lakukan saat aku mengangkat sujud. Sungguh aku telah tua dan lemah. \" "
            },
            {
                "number": 921,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ بْنِ الْهُدَيْرِ التَّيْمِيُّ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ مِنْ الْجَفَاءِ أَنْ يُكْثِرَ الرَّجُلُ مَسْحَ جَبْهَتِهِ قَبْلَ الْفَرَاغِ مِنْ صَلَاتِهِ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim Ad Dimasyqi] berkata, telah menceritakan kepada kami [Ibnu Abu Fudaik] berkata, telah menceritakan kepada kami [Harun bin Abdullah bin Al Hudair At Taimi] dari [Al A'raj] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Termasuk perkara yang sia-sia adalah memperbanyak mengusap keningnya sebelum selesai dari sholatnya. \""
            },
            {
                "number": 922,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا أَبُو قُتَيْبَةَ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ وَإِسْرَائِيلُ بْنُ يُونُسَ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُفَقِّعْ أَصَابِعَكَ وَأَنْتَ فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Abu Qutaibah] berkata, telah menceritakan kepada kami [Yunus bin Abu Ishaq] dan [Isra'il bin Yunus] dari [Abu Ishaq] dari [Al Harits] dari [Ali] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kamu membunyikan jari-jarimu sementara kamu sedang sholat. \""
            },
            {
                "number": 923,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ سُفْيَانُ بْنُ زِيَادٍ الْمُؤَدِّبُ حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ عَنْ الْحَسَنِ بْنِ ذَكْوَانَ عَنْ عَطَاءٍ عَنْ أَبِي هُرَيْرَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُغَطِّيَ الرَّجُلُ فَاهُ فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id Sufyan bin Ziyad Al Mu`addib] berkata, telah menceritakan kepada kami [Muhammad bin Rasyid] dari [Al Hasan bin Dzakwan] dari ['Atho`] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang seseorang menutup mulutnya ketika sholat. \""
            },
            {
                "number": 924,
                "arab": "حَدَّثَنَا عَلْقَمَةُ بْنُ عَمْرٍو الدَّارِمِيُّ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ كَعْبِ بْنِ عُجْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا قَدْ شَبَّكَ أَصَابِعَهُ فِي الصَّلَاةِ فَفَرَّجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَصَابِعِهِ",
                "id": "Telah menceritakan kepada kami [Alqamah bin Amru Ad Darimi] berkata, telah menceritakan kepada kami [Abu Bakr bin Ayyasy] dari [Muhammad bin 'Ajlan] dari [Sa'id Al Maqburi] dari [Ka'ab bin Ujrah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melihat seorang laki-laki menganyam jemarinya dalam sholat, maka Rasulullah shallallahu 'alaihi wasallam pun membuka jemarinya. \""
            },
            {
                "number": 925,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَضَعْ يَدَهُ عَلَى فِيهِ وَلَا يَعْوِي فَإِنَّ الشَّيْطَانَ يَضْحَكُ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Hafsh bin Ghiyats] dari [Abdullah bin Sa'id Al Maqburi] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian menguap hendaklah meletakkan tangan pada mulut dan jangan bersuara, sebab setan tertawa karenanya. \""
            },
            {
                "number": 926,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ عَنْ شَرِيكٍ عَنْ أَبِي الْيَقْظَانِ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ أَبِيهِ عَنْ جَدِّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبُزَاقُ وَالْمُخَاطُ وَالْحَيْضُ وَالنُّعَاسُ فِي الصَّلَاةِ مِنْ الشَّيْطَانِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Al Fadll bin Dukain] dari [Syarik] dari [Abul Yaqdhan] dari ['Adi bin Tsabit] dari [Bapaknya] dari [Kakeknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ludah, ingus, haid dan kantuk dalam sholat datang dari setan. \""
            },
            {
                "number": 927,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ وَجَعْفَرُ بْنُ عَوْنٍ عَنْ الْإِفْرِيقِيِّ عَنْ عِمْرَانَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةٌ لَا تُقْبَلُ لَهُمْ صَلَاةٌ الرَّجُلُ يَؤُمُّ الْقَوْمَ وَهُمْ لَهُ كَارِهُونَ وَالرَّجُلُ لَا يَأْتِي الصَّلَاةَ إِلَّا دِبَارًا يَعْنِي بَعْدَ مَا يَفُوتُهُ الْوَقْتُ وَمَنْ اعْتَبَدَ مُحَرَّرًا",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami ['Abdah bin Sulaiman] dan [Ja'far bin Aun] dari [Al Ifriqi] dari [Imran] dari [Abdullah bin Amru] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tiga golongan yang sholatnya tidak diterima; seseorang yang mengimami suatu kaum sementara mereka tidak menyukainya, orang yang tidak melaksanakan sholat kecuali telah habis waktunya, dan orang yang memperbudak orang merdeka. \""
            },
            {
                "number": 928,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ هَيَّاجِ حَدَّثَنَا يَحْيَى بْنُ عَبْدِ الرَّحْمَنِ الْأَرْحَبِيُّ حَدَّثَنَا عُبَيْدَةُ بْنُ الْأَسْوَدِ عَنْ الْقَاسِمِ بْنِ الْوَلِيدِ عَنْ الْمِنْهَالِ بْنِ عَمْرٍو عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ثَلَاثَةٌ لَا تَرْتَفِعُ صَلَاتُهُمْ فَوْقَ رُءُوسِهِمْ شِبْرًا رَجُلٌ أَمَّ قَوْمًا وَهُمْ لَهُ كَارِهُونَ وَامْرَأَةٌ بَاتَتْ وَزَوْجُهَا عَلَيْهَا سَاخِطٌ وَأَخَوَانِ مُتَصَارِمَانِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Umar bin Hayyaj] berkata, telah menceritakan kepada kami [Yahya bin 'Abdurrahman Al Arhabi] berkata, telah menceritakan kepada kami [Ubaidah bin Al Aswad] dari [Al Qasim bin Al Walid] dari [Al Minhal bin Amru] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Tiga golongan yang sholatnya tidak akan di angkat meski satu jengkal dari kepalanya; seseorang yang mengimami suatu kaum sementara mereka tidak menyukainya, seorang perempuan yang bermalam sementara suaminya marah kepadanya, dan dua bersaudara yang saling bermusuhan. \""
            },
            {
                "number": 929,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الرَّبِيعُ بْنُ بَدْرٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَمْرِو بْنِ جَرَادٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اثْنَانِ فَمَا فَوْقَهُمَا جَمَاعَةٌ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Ar Rabi' bin Badr] dari [Bapaknya] dari Kakeknya [Amru bin Jarad] dari [Abu Musa Al Asy'ari] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang atau lebih adalah jama'ah. \""
            },
            {
                "number": 930,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا عَاصِمٌ عَنْ الشَّعْبِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَبِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنْ اللَّيْلِ فَقُمْتُ عَنْ يَسَارِهِ فَأَخَذَ بِيَدِي فَأَقَامَنِي عَنْ يَمِينِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu Asy Syawarib] berkata, telah menceritakan kepada kami [Abdul Wahid bin Ziyad] berkata, telah menceritakan kepada kami [Ashim] dari [Asy Sya'bi] dari [Ibnu Abbas] ia berkata, \"Aku menginap di tempat bibiku, Maimunah. Kemudian Nabi shallallahu 'alaihi wasallam bangun dan sholat malam, lalu aku ikut dan berdiri di sisi kirinya, namun beliau meraihku dan meletakkan di sisi kanannya. \""
            },
            {
                "number": 931,
                "arab": "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ حَدَّثَنَا الضَّحَّاكُ بْنُ عُثْمَانَ حَدَّثَنَا شُرَحْبِيلُ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الْمَغْرِبَ فَجِئْتُ فَقُمْتُ عَنْ يَسَارِهِ فَأَقَامَنِي عَنْ يَمِينِهِ",
                "id": "Telah menceritakan kepada kami [Bakr bin Khalaf Abu Biysr] berkata, telah menceritakan kepada kami [Abu Bakr Al Hanafi] berkata, telah menceritakan kepada kami [Adl Dlahhak bin Utsman] berkata, telah menceritakan kepada kami [Syurahbil] ia berkata, \"Aku mendengar [Jabir bin Abdullah], ia berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat maghrib, lalu aku datang dan berdiri di sisi kirinya, namun beliau memposisikan aku di sisi kanannya. \""
            },
            {
                "number": 932,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ اللَّهِ بْنِ الْمُخْتَارِ عَنْ مُوسَى بْنِ أَنَسٍ عَنْ أَنَسٍ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِامْرَأَةٍ مِنْ أَهْلِهِ وَبِي فَأَقَامَنِي عَنْ يَمِينِهِ وَصَلَّتْ الْمَرْأَةُ خَلْفَنَا",
                "id": "telah menceritakan kepada kami [Nashr bin Ali] berkata, telah menceritakan kepada kami [Bapakku] berkata, telah menceritakan kepada kami [Syu'bah] dari [Abdullah Ibnul Mukhtar] dari [Musa bin Anas] dari [Anas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat denganku dan seorang wanita dari isterinya, lalu beliau memposisikan aku di sisi kanannya dan wanita di belakang kami. \""
            },
            {
                "number": 933,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ أَبِي مَعْمَرٍ عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْسَحُ مَنَاكِبَنَا فِي الصَّلَاةِ وَيَقُولُ لَا تَخْتَلِفُوا فَتَخْتَلِفَ قُلُوبُكُمْ لِيَلِيَنِّي مِنْكُمْ أُولُوا الْأَحْلَامِ وَالنُّهَى ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Sufyan bin Uyainah] dari [Al A'masy] dari [Umarah bin Umair] dari [Abu Ma'mar] dari [Abu Mas'ud Al Anshari] ia berkata, \"Ketika sholat Rasulullah shallallahu 'alaihi wasallam memegang pundak kami, lalu beliau bersabda: \"Janganlah kalian berselisih hingga hati kalian akan berselisih. Hendaklah yang di belakangku orang yang paling paham, kemudian orang yang di bawahnya kemudian orang yang di bawahnya. \" "
            },
            {
                "number": 934,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا حُمَيْدٌ عَنْ أَنَسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحِبُّ أَنْ يَلِيَهُ الْمُهَاجِرُونَ وَالْأَنْصَارُ لِيَأْخُذُوا عَنْهُ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Juhani] berkata, telah menceritakan kepada kami [Abdul Wahhab] berkata, telah menceritakan kepada kami [Humaid] dari [Anas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menyukai jika orang yang di belakangnya adalah kaum Muhajirin dan Anshar hingga mereka dapat menjaganya. \""
            },
            {
                "number": 935,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ عَنْ أَبِي الْأَشْهَبِ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى فِي أَصْحَابِهِ تَأَخُّرًا فَقَالَ تَقَدَّمُوا فَأْتَمُّوا بِي وَلْيَأْتَمَّ بِكُمْ مَنْ بَعْدَكُمْ لَا يَزَالُ قَوْمٌ يَتَأَخَّرُونَ حَتَّى يُؤَخِّرَهُمْ اللَّهُ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Ibnu Abu Za`idah] dari [Abu Al Asyhab] dari [Abu Nadlrah] dari [Abu Sa'id] berkata, \"Rasulullah shallallahu 'alaihi wasallam melihat pada sahabatnya orang-orang yang suka memilih shaf terakhir, maka beliau pun bersabda: \"Maju dan ikutilah aku, dan hendaklah orang-orang di belakang mengikuti kalian, akan senantiasa ada suatu kaum berlambat-lambat hingga Allah mengakhirkan mereka pada hari kiamat. \""
            },
            {
                "number": 936,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَصَاحِبٌ لِي فَلَمَّا أَرَدْنَا الِانْصِرَافَ قَالَ لَنَا إِذَا حَضَرَتْ الصَّلَاةُ فَأَذِّنَا وَأَقِيمَا وَلْيَؤُمَّكُمَا أَكْبَرُكُمَا",
                "id": "Telah menceritakan kepada kami [Bisyr bin Hilal Ash Shawwaf] berkata, telah menceritakan kepada kami [Yazid bin Zurai'] dari [Khalid Al Hadzdza`] dari [Abu Qilabah] dari [malik Ibnul Huwairits] ia berkata, \"Aku bersama dengan seorang temanku datang menemui Nabi shallallahu 'alaihi wasallam, maka ketika kami akan pergi beliau bersabda kepada kami: \"Jika waktu sholat tiba, maka adzan dan iqamahlah kalian, dan hendaklah yang paling besar dari kalian menjadi imam. \""
            },
            {
                "number": 937,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ إِسْمَعِيلَ بْنِ رَجَاءٍ قَالَ سَمِعْتُ أَوْسَ بْنَ ضَمْعَجٍ قَالَ سَمِعْتُ أَبَا مَسْعُودٍ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَؤُمُّ الْقَوْمَ أَقْرَؤُهُمْ لِكِتَابِ اللَّهِ فَإِنْ كَانَتْ قِرَاءَتُهُمْ سَوَاءً فَلْيَؤُمَّهُمْ أَقْدَمُهُمْ هِجْرَةً فَإِنْ كَانَتْ الْهِجْرَةُ سَوَاءً فَلْيَؤُمَّهُمْ أَكْبَرُهُمْ سِنًّا وَلَا يُؤَمَّ الرَّجُلُ فِي أَهْلِهِ وَلَا فِي سُلْطَانِهِ وَلَا يُجْلَسْ عَلَى تَكْرِمَتِهِ فِي بَيْتِهِ إِلَّا بِإِذْنٍ أَوْ بِإِذْنِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Isma'il bin Raja`] Ia berkata; aku mendengar [Aus bin Dlam'aj] ia berkata; aku mendengar [Abu Mas'ud] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaknya yang menjadi imam pada suatu kaum yang paling banyak hafalan Al Qur'annya. Jika mereka sama dalam hafalan, maka yang paling dulu hijrah. Dan jika mereka sama dalam hijrah, maka yang paling tua. Seseorang tidak boleh diimami dalam keluarga dan kekuasaannya, serta tidak boleh duduk pada tempat khusus miliknya kecuali dengan izin darinya. \" "
            },
            {
                "number": 938,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ سُلَيْمَانَ أَخُو فُلَيْحٍ حَدَّثَنَا أَبُو حَازِمٍ قَالَكَانَ سَهْلُ بْنُ سَعْدٍ السَّاعِدِيُّ يُقَدِّمُ فِتْيَانَ قَوْمِهِ يُصَلُّونَ بِهِمْ فَقِيلَ لَهُ تَفْعَلُ وَلَكَ مِنْ الْقِدَمِ مَا لَكَ قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْإِمَامُ ضَامِنٌ فَإِنْ أَحْسَنَ فَلَهُ وَلَهُمْ وَإِنْ أَسَاءَ يَعْنِي فَعَلَيْهِ وَلَا عَلَيْهِمْ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Sa'id bin Sulaiman] berkata, telah menceritakan kepada kami [Abdul Hamid bin Sulaiman] -saudara Fulaih- berkata, telah menceritakan kepada kami [Abu Hazim] ia berkata, \" [Sahl bin Sa'ad As Sa'idi] menunjuk seorang anak muda menjadi imam sholat bersama mereka, maka dikatakan kepadanya, \"Kamu melakukan hal itu, sedangkan kamu lebih dahulu masuk Islam! \" Ia menjawab, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Imam itu orang yang bertanggung jawab. Jika ia berlaku benar maka kebaikan itu baginya dan bagi mereka. Tetapi jika salah, maka kesalahan itu untuk dirinya dan bukan untuk mereka. \""
            },
            {
                "number": 939,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ أُمِّ غُرَابٍ عَنْ امْرَأَةٍ يُقَالُ لَهَا عَقِيلَةُ عَنْ سَلَامَةَ بِنْتِ الْحُرِّ أُخْتِ خَرَشَةَ قَالَتْسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَأْتِي عَلَى النَّاسِ زَمَانٌ يَقُومُونَ سَاعَةً لَا يَجِدُونَ إِمَامًا يُصَلِّي بِهِمْ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki'] dari [Ummu Ghurab] dari Seorang wanita yang disebut dengan nama [Aqilah], dari [Salamah binti Al Hur] saudara perempuan Kharasyah, ia berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Akan datang suatu masa pada manusia, mereka berdiri beberapa saat namun tidak mendapatkan seorang imam yang mengimami mereka. \""
            },
            {
                "number": 940,
                "arab": "حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ الْعَدَنِيُّ حَدَّثَنَا ابْنُ أَبِي حَازِمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ عَنْ أَبِي عَلِيٍّ الْهَمْدَانِيِّأَنَّهُ خَرَجَ فِي سَفِينَةٍ فِيهَا عُقْبَةُ بْنُ عَامِرٍ الْجُهَنِيُّ فَحَانَتْ صَلَاةٌ مِنْ الصَّلَوَاتِ فَأَمَرْنَاهُ أَنْ يَؤُمَّنَا وَقُلْنَا لَهُ إِنَّكَ أَحَقُّنَا بِذَلِكَ أَنْتَ صَاحِبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَبَى فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَمَّ النَّاسَ فَأَصَابَ فَالصَّلَاةُ لَهُ وَلَهُمْ وَمَنْ انْتَقَصَ مِنْ ذَلِكَ شَيْئًا فَعَلَيْهِ وَلَا عَلَيْهِمْ",
                "id": "Telah menceritakan kepada kami [Muhriz bin Salamah Al Adani] berkata, telah menceritakan kepada kami [Ibnu Abu Hazim] dari ['Abdurrahman bin Harmalah] dari [Abu Ali Al Hamdani] Bahwasanya ia pernah bepergian dengan menggunakan kapal yang di dalamnya terdapat [uqbah bin Amir Al Juhani], lalu waktu sholat tiba hingga kami menyuruhnya untuk menjadi imam bagi kami, kami katakan padanya, \"Engkau lebih berhak untuk itu, engkau adalah sahabat Rasulullah shallallahu 'alaihi wasallam, \" namun ia menolak. Ia lalu berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjadi imam bagi manusia, jika benar maka pahalanya untuknya dan untuk mereka. Namun jika tidak, maka ia menanggung dosanya dan tidak bagi mereka. \""
            },
            {
                "number": 941,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا إِسْمَعِيلُ عَنْ قَيْسٍ عَنْ أَبِي مَسْعُودٍ قَالَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي لَأَتَأَخَّرُ فِي صَلَاةِ الْغَدَاةِ مِنْ أَجْلِ فُلَانٍ لِمَا يُطِيلُ بِنَا فِيهَا قَالَ فَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطُّ فِي مَوْعِظَةٍ أَشَدَّ غَضَبًا مِنْهُ يَوْمَئِذٍ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ مِنْكُمْ مُنَفِّرِينَ فَأَيُّكُمْ مَا صَلَّى بِالنَّاسِ فَلْيُجَوِّزْ فَإِنَّ فِيهِمْ الضَّعِيفَ وَالْكَبِيرَ وَذَا الْحَاجَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Bapakku] berkata, telah menceritakan kepada kami [Isma'il] dari [Qais] dari [Abu Mas'ud] ia berkata, \"Seorang laki-laki menemui Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, aku berlambat-lambat menghadiri sholat subuh karena si Fulan panjang dalam bacaannya, \" Abu Mas'ud berkata, \"Aku tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam memberi nasihat dengan kemarahan sebagaimana hari itu, beliau bersabda: \"Wahai manusia sekalian, sesungguhnya di antara kalian ada orang-orang yang menjadikan manusia lari! Siapa saja dari kalian sholat bersama orang banyak hendaklah memperingan sholatnya, sebab di antara mereka ada orang lemah, orang tua dan orang yang mempunyai keperluan. \""
            },
            {
                "number": 942,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ وَحُمَيْدُ بْنُ مَسْعَدَةَ قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ أَنْبَأَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوجِزُ وَيُتِمُّ الصَّلَاةَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah] dan [Humaid bin Mas'adah] keduanya berkata; telah menceritakan kepada kami [Hammad bin Zaid] berkata, telah memberitakan kepada kami [Abdul Aziz bin Shuhaib] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memperingan sholat meskipun sempurna. \""
            },
            {
                "number": 943,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَصَلَّى مُعَاذُ بْنُ جَبَلٍ الْأَنْصَارِيُّ بِأَصْحَابِهِ صَلَاةَ الْعِشَاءِ فَطَوَّلَ عَلَيْهِمْ فَانْصَرَفَ رَجُلٌ مِنَّا فَصَلَّى فَأُخْبِرَ مُعَاذٌ عَنْهُ فَقَالَ إِنَّهُ مُنَافِقٌ فَلَمَّا بَلَغَ ذَلِكَ الرَّجُلَ دَخَلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ مَا قَالَ لَهُ مُعَاذٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتُرِيدُ أَنْ تَكُونَ فَتَّانًا يَا مُعَاذُ إِذَا صَلَّيْتَ بِالنَّاسِ فَاقْرَأْ بِالشَّمْسِ وَضُحَاهَا وَسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَاللَّيْلِ إِذَا يَغْشَى وَاقْرَأْ بِاسْمِ رَبِّكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Abu Az Zubair] dari [Jabir] ia berkata, \"Mu'adz bin Jabal Al Anshari melaksanakan sholat isya bersama sahabatnya, ia memanjangkan sholat hingga ada seorang laki-laki dari kami keluar dan sholat sendirian. Mu'adz diberi kabar tentang laki-laki itu hingga dia berkata, \"Ia orang munafik. \" Ketika ucapan Mu'adz itu sampai kepada laki-laki tersebut, ia pun mendatangi Rasulullah shallallahu 'alaihi wasallam dan mengabarkan apa yang diucapkan oleh Mu'adz. Maka Nabi shallallahu 'alaihi wasallam pun bersabda: \"Wahai Mu'adz, apakah engkau akan menciptakan fitnah! Jika engkau sholat bersama manusia maka bacalah: WASY SYAMSI WA DLUHAHA, SABBIHISMA RABBIKAL A'LA dan WAL LAILI IDZA YAGHSYA. Bacalah BISMI RABBIKA. \""
            },
            {
                "number": 944,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ قَالَ سَمِعْتُ عُثْمَانَ بْنَ أَبِي الْعَاصِ يَقُولُكَانَ آخِرُ مَا عَهِدَ إِلَيَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ أَمَّرَنِي عَلَى الطَّائِفِ قَالَ لِي يَا عُثْمَانُ تَجَاوَزْ فِي الصَّلَاةِ وَاقْدِرْ النَّاسَ بِأَضْعَفِهِمْ فَإِنَّ فِيهِمْ الْكَبِيرَ وَالصَّغِيرَ وَالسَّقِيمَ وَالْبَعِيدَ وَذَا الْحَاجَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Isma'il bin Ulayyah] dari [Muhammad bin Ishaq] dari [Sa'id bin Abu Hind] dari [Mutharrif bin Abdullah bin Asy Syakhkhir] berkata; aku mendengar [Utsman bin Abu Al Ash] berkata, \"Ketika Nabi shallallahu 'alaihi wasallam mengutusku ke Tha`if, terakhir kali yang beliau katakan kepadaku adalah: \"Wahai Utsman, ringankanlah sholatmu, ukurlah manusia dengan orang yang paling lemah dari mereka. Sebab di antara mereka ada orang tua, anak kecil, orang sakit, musafir dan orang yang punya keperluan. \""
            },
            {
                "number": 945,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ إِسْمَعِيلَ حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ حَدَّثَنَا يَحْيَى حَدَّثَنَا شُعْبَةُ حَدَّثَنَا عَمْرُو بْنُ مُرَّةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ حَدَّثَ عُثْمَانُ بْنُ أَبِي الْعَاصِأَنَّ آخِرَ مَا قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَمَمْتَ قَوْمًا فَأَخِفَّ بِهِمْ",
                "id": "Telah menceritakan kepada kami [Ali bin Isma'il] berkata, telah menceritakan kepada kami [Amru bin Ali] berkata, telah menceritakan kepada kami [Yahya] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah menceritakan kepada kami [Amru bin Murrah] dari [Sa'id Ibnul Musayyab] berkata, [Utsman bin Abu Al 'Ash] menceritakan bahwa terakhir yang dikatakan oleh Rasulullah shallallahu 'alaihi wasallam kepadaku adalah: \"Jika engkau mengimami suatu kaum, maka ringankanlah. \""
            },
            {
                "number": 946,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَأَدْخُلُ فِي الصَّلَاةِ وَإِنِّي أُرِيدُ إِطَالَتَهَا فَأَسْمَعُ بُكَاءَ الصَّبِيِّ فَأَتَجَوَّزُ فِي صَلَاتِي مِمَّا أَعْلَمُ لِوَجْدِ أُمِّهِ بِبُكَائِهِ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Abdul A'la] berkata, telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika sholat aku ingin memanjangkannya, namun aku mendengar tangisan anak kecil hingga aku mempercepatnya, sebab aku tahu kegundahan hati sang ibu karena tangisan bayinya. \""
            },
            {
                "number": 947,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي كَرِيمَةَ الْحَرَّانِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عُلَاثَةَ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ الْحَسَنِ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَأَسْمَعُ بُكَاءَ الصَّبِيِّ فَأَتَجَوَّزُ فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Ismail bin Abu karimah Al Harrani] berkata, telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Abdullah bin 'Ulatsah] dari [Hisyam bin Hassan] dari [Al Hasan] dari [Utsman bin Abul 'Ash] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku mendengar tangisan bayi, maka akupun mempercepat sholat. \""
            },
            {
                "number": 948,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عُمَرُ بْنُ عَبْدِ الْوَاحِدِ وَبِشْرُ بْنُ بَكْرٍ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَأَقُومُ فِي الصَّلَاةِ وَأَنَا أُرِيدُ أَنْ أُطَوِّلَ فِيهَا فَأَسْمَعُ بُكَاءَ الصَّبِيِّ فَأَتَجَوَّزُ كَرَاهِيَةَ أَنْ يَشُقَّ عَلَى أُمِّهِ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim] berkata, telah menceritakan kepada kami [Umar bin Abdul Wahid] dan [Biysr bin Bakr] dari [Al Auza'i] dari [Yahya bin Abu Katsir] dari [Abdullah bin Abu Qatadah] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh aku dalam keadaan sholat dan aku ingin memanjangkan sholatku, namun aku mendengar suara tangisan bayi hingga aku memperingan sholatku khawatir memperberat hati sang ibu. \""
            },
            {
                "number": 949,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ عَنْ جَابِرِ بْنِ سَمُرَةَ السُّوَائِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا تَصُفُّونَ كَمَا تَصُفُّ الْمَلَائِكَةُ عِنْدَ رَبِّهَا قَالَ قُلْنَا وَكَيْفَ تَصُفُّ الْمَلَائِكَةُ عِنْدَ رَبِّهَا قَالَ يُتِمُّونَ الصُّفُوفَ الْأُوَلَ وَيَتَرَاصُّونَ فِي الصَّفِّ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Al A'masy] dari [Al Musayyab bin Rafi'] dari [Tamim bin Tharafah] dari [Jabir bin Samurah As Suwa`i] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak maukah kalian membuat barisan sholat sebagaimana barisannya para malaikat di hadapan Rabbnya?\" Jabir berkata, \"Kami bertanya, \"Bagaimana para malaikat membuat barisan di hadapan Rabbnya?\" beliau menjawab: \"Mereka menyempurnakan barisan pertama dan rapat dalam barisannya. \""
            },
            {
                "number": 950,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ ح و حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا أَبِي وَبِشْرُ بْنُ عُمَرَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَوُّوا صُفُوفَكُمْ فَإِنَّ تَسْوِيَةَ الصُّفُوفِ مِنْ تَمَامِ الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Nashr bin Ali] dari [Bapakku] dan [Bisyr bin Umar] keduanya berkata; telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Luruskanlah barisan kalian, sebab lurusnya barisan termasuk kesempurnaan sholat. \""
            },
            {
                "number": 951,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ أَنَّهُ سَمِعَ النُّعْمَانَ بْنَ بَشِيرٍ يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَوِّي الصَّفَّ حَتَّى يَجْعَلَهُ مِثْلَ الرُّمْحِ أَوْ الْقِدْحِ قَالَ فَرَأَى صَدْرَ رَجُلٍ نَاتِئًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَوُّوا صُفُوفَكُمْ أَوْ لَيُخَالِفَنَّ اللَّهُ بَيْنَ وُجُوهِكُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah menceritakan kepada kami [Simak bin Harb] Bahwasanya ia mendengar [An Nu'man bin Basyir] berkata, \"Rasulullah shallallahu 'alaihi wasallam meluruskan barisan seakan beliau menjadikannya seperti tombak atau anak panah. \" An Nu'man berkata, \"Suatu ketika beliau melihat dada seorang laki-laki menonjol ke depan, maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: Luruskanlah barisan kalian, atau Allah akan menceraikan antara wajah kalian! \""
            },
            {
                "number": 952,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى الَّذِينَ يَصِلُونَ الصُّفُوفَ وَمَنْ سَدَّ فُرْجَةً رَفَعَهُ اللَّهُ بِهَا دَرَجَةً",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Isma'il bin Ayyasy] berkata, telah menceritakan kepada kami [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah dan para malaikat-Nya bershalawat bagi orang-orang yang menyambung barisan sholat, maka barangsiapa menutup celah dalam barisan tersebut Allah akan mengangkat derajatnya. \""
            },
            {
                "number": 953,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا هِشَامٌ الدَّسْتُوَائِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ عِرْبَاضِ بْنِ سَارِيَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَسْتَغْفِرُ لِلصَّفِّ الْمُقَدَّمِ ثَلَاثًا وَلِلثَّانِي مَرَّةً",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah memberitakan kepada kami [Hisyam Ad Dastuwa`i] dari [Yahya bin Abu Katsir] dari [Muhammad bin Ibrahim] dari [Khalid bin Ma'dan] dari [Irbadl bin Sariyah] berkata, \"Rasulullah shallallahu 'alaihi wasallam memintakan ampun bagi orang-orang yang ada di barisan pertama tiga kali dan barisan kedua satu kali. \""
            },
            {
                "number": 954,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ طَلْحَةَ بْنَ مُصَرِّفٍ يَقُولُ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ عَوْسَجَةَ يَقُولُ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى الصَّفِّ الْأَوَّلِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dan [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] berkata; aku mendengar [Thalhah bin Musharrif] berkata; aku mendengar ['Abdurrahman bin Aujasah] berkata; aku mendengar [Al Bara` bin Azib] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah dan para malaikat-Nya memintakan ampun bagi orang-orang yang ada di barisan pertama. \""
            },
            {
                "number": 955,
                "arab": "حَدَّثَنَا أَبُو ثَوْرٍ إِبْرَاهِيمُ بْنُ خَالِدٍ حَدَّثَنَا أَبُو قَطَنٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ خِلَاسٍ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ يَعْلَمُونَ مَا فِي الصَّفِّ الْأَوَّلِ لَكَانَتْ قُرْعَةٌ",
                "id": "Telah menceritakan kepada kami [Abu Tsaur Ibrahim bin Khalid] berkata, telah menceritakan kepada kami [Abu Qathan] berkata, telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Khilas] dari [Abu Rafi'] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya orang-orang tahu apa yang ada dalam barisan pertama sungguh mereka akan berundi. \""
            },
            {
                "number": 956,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَلْقَمَةَ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى الصَّفِّ الْأَوَّلِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mushaffa Al Himshi] berkata, telah menceritakan kepada kami [Anas bin 'Iyadl] berkata, telah menceritakan kepada kami [Muhammad bin Amru bin Alqamah] dari [Ibrahim bin 'Abdurrahman bin 'Auf] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah dan para Malaikat-Nya mengucapkan shalawat kepada orang-orang yang berada dalam shaf awal. \""
            },
            {
                "number": 957,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ و عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ صُفُوفِ النِّسَاءِ آخِرُهَا وَشَرُّهَا أَوَّلُهَا وَخَيْرُ صُفُوفِ الرِّجَالِ أَوَّلُهَا وَشَرُّهَا آخِرُهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah] berkata, telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Al 'Ala] dari [Bapaknya] dari [Abu Hurairah] dan (menurut jalur yang lain) dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik shaf wanita adalah yang paling akhir dan yang paling buruk adalah yang paling depan. Dan sebaik-baik shaf laki-laki adalah yang paling depan dan yang paling buruk adalah yang paling belakang. \""
            },
            {
                "number": 958,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ صُفُوفِ الرِّجَالِ مُقَدَّمُهَا وَشَرُّهَا مُؤَخَّرُهَا وَخَيْرُ صُفُوفِ النِّسَاءِ مُؤَخَّرُهَا وَشَرُّهَا مُقَدَّمُهَا",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abdullah bin Muhammad bin Aqil] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik shaf laki-laki adalah yang paling depan dan yang paling buruk adalah yang paling belakang. Dan sebaik-baik shaf wanita adalah yang paling akhir dan yang paling buruk adalah yang paling depan. \""
            },
            {
                "number": 959,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ أَبُو طَالِبٍ حَدَّثَنَا أَبُو دَاوُدَ وَأَبُو قُتَيْبَةَ قَالَا حَدَّثَنَا هَارُونُ بْنُ مُسْلِمٍ عَنْ قَتَادَةَ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَبِيهِ قَالَكُنَّا نُنْهَى أَنْ نَصُفَّ بَيْنَ السَّوَارِي عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنُطْرَدُ عَنْهَا طَرْدًا",
                "id": "Telah menceritakan kepada kami [Zaid bin Akhzam Abu Thalib] berkata, telah menceritakan kepada kami [Abu Dawud] dan [Abu Qutaibah] keduanya berkata; telah menceritakan kepada kami [Harun bin Muslim] dari [Qatadah] dari [Mu'awiyah bin Qurrah] dari [Bapaknya] ia berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam kami dilarang membuat shaf antara tiang-tiang, maka kamipun meninggalkannya. \" "
            },
            {
                "number": 960,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُلَازِمُ بْنُ عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ بَدْرٍ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَلِيِّ بْنِ شَيْبَانَ عَنْ أَبِيهِ عَلِيِّ بْنِ شَيْبَانَ وَكَانَ مِنْ الْوَفْدِ قَالَخَرَجْنَا حَتَّى قَدِمْنَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَايَعْنَاهُ وَصَلَّيْنَا خَلْفَهُ ثُمَّ صَلَّيْنَا وَرَاءَهُ صَلَاةً أُخْرَى فَقَضَى الصَّلَاةَ فَرَأَى رَجُلًا فَرْدًا يُصَلِّي خَلْفَ الصَّفِّ قَالَ فَوَقَفَ عَلَيْهِ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ انْصَرَفَ قَالَ اسْتَقْبِلْ صَلَاتَكَ لَا صَلَاةَ لِلَّذِي خَلْفَ الصَّفِّ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Mulazim bin Amru] dari [Abdullah bin Badr] berkata, telah menceritakan kepadaku ['Abdurrahman bin Ali bin Syaiban] dari bapaknya [Ali bin Syaiban] -ia adalah seorang utusan- ia berkata, \"Kami berangkat hingga akhirnya sampai di hadapan Nabi shallallahu 'alaihi wasallam, kemudian kami membai'at dan sholat di belakangnya. Setelah itu kami mengerjakan sholat yang lain di belakang beliau, dan selesai sholat beliau melihat seorang laki-laki sholat sendirian di belakang shaf. \" Ali bin Syaibah berkata, \"Ketika berlalu pergi Nabi shallallahu 'alaihi wasallam berhenti di sisi orang itu, beliau bersabda: \"Ulangilah sholatmu, sebab tidak ada sholat bagi orang yang sholat sendirian di belakang shaf. \""
            },
            {
                "number": 961,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ حُصَيْنٍ عَنْ هِلَالِ بْنِ يَسَافٍ قَالَأَخَذَ بِيَدِي زِيَادُ بْنُ أَبِي الْجَعْدِ فَأَوْقَفَنِي عَلَى شَيْخٍ بِالرَّقَّةِ يُقَالُ لَهُ وَابِصَةُ بْنُ مَعْبَدٍ فَقَالَ صَلَّى رَجُلٌ خَلْفَ الصَّفِّ وَحْدَهُ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُعِيدَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Idris] dari [Hushain] dari [Hilal bin Yasaf] berkata; Ziyad bin Abu Al Ja'd memegang tanganku dan menempatkan aku di sisi seorang syaikh di Riqqah yang biasa disebut dengan nama [Wabishah bin Ma'bad]. Ia kemudian berkata, \"Ada seorang laki-laki sholat sendirian di belakang shaf, lalu Nabi shallallahu 'alaihi wasallam memerintahkan kepadanya untuk mengulangi sholat. \""
            },
            {
                "number": 962,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ حَدَّثَنَا سُفْيَانُ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ عُثْمَانَ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى مَيَامِنِ الصُّفُوفِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Mu'awiyah bin Hisyam] berkata, telah menceritakan kepada kami [Sufyan] dari [Usamah bin Zaid] dari [Utsman bin Urwah] dari [Urwah] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah dan para Malaikat-Nya mengucapkan shalawat kepada orang-orang yang berada dalam shaf bagian kanan. \""
            },
            {
                "number": 963,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ مِسْعَرٍ عَنْ ثَابِتِ بْنِ عُبَيْدٍ عَنْ ابْنِ الْبَرَاءِ بْنِ عَازِبٍ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَكُنَّا إِذَا صَلَّيْنَا خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مِسْعَرٌ مِمَّا نُحِبُّ أَوْ مِمَّا أُحِبُّ أَنْ نَقُومَ عَنْ يَمِينِهِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Mis'ar] dari [Tsabit bin Ubaid] dari [Ibnul Bara` bin Azib] dari [Al Bara` bin Azib] ia berkata, \"Jika kami sholat di belakang Rasulullah shallallahu 'alaihi wasallam, Mis'ar berkata, \"Kami suka, atau ia menyebutkan, \"aku suka berdiri di sebelah kanannya. \""
            },
            {
                "number": 964,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي الْحُسَيْنِ أَبُو جَعْفَرٍ حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ الْكِلَابِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو الرَّقِّيُّ عَنْ لَيْثِ بْنِ أَبِي سَلِيمٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقِيلَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مَيْسَرَةَ الْمَسْجِدِ تَعَطَّلَتْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ عَمَّرَ مَيْسَرَةَ الْمَسْجِدِ كُتِبَ لَهُ كِفْلَانِ مِنْ الْأَجْرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abul Husain Abu Ja'far] berkata, telah menceritakan kepada kami [Amru bin Utsman Al Kilabi] berkata, telah menceritakan kepada kami [ubaidhullah bin Amru Ar Raqqi] dari [Laits bin Abu Salim] dari [Nafi'] dari [Ibnu Umar] ia berkata; dikatakan kepada Nabi shallallahu 'alaihi wasallam; \"Sesungguhnya bagian kiri masjid menjadi kosong\". Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memakmurkan bagian kiri masjid maka akan ditulis baginya dua pahala. \""
            },
            {
                "number": 965,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍ أَنَّهُ قَالَلَمَّا فَرَغَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ طَوَافِ الْبَيْتِ أَتَى مَقَامَ إِبْرَاهِيمَ فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ هَذَا مَقَامُ أَبِينَا إِبْرَاهِيمَ الَّذِي قَالَ اللَّهُ{ وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى }قَالَ الْوَلِيدُ فَقُلْتُ لِمَالِكٍ أَهَكَذَا قَرَأَ وَاتَّخِذُوا قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Al Abbas bin Utsman Ad Dimasyqi] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Malik bin Anas] dari [Ja'far bin Muhammad] dari [Bapaknya] dari [Jabir] Bahwasanya ia berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam selesai thawaf di Ka'bah, beliau mendatangi Maqam Ibrahim. Umar berkata, \"Wahai Rasulullah, ini adalah Maqam bapak kita Ibrahim yang Allah telah berfirman: \" (Dan jadikanlah sebahagian maqam Ibrahim tempat sholat). \" Al Walid berkata, \"Aku berkata kepada Malik, \"'dan jadikanlah' apakah demikian ia membaca?\" ia menjawab, \"Ya. \""
            },
            {
                "number": 966,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا هُشَيْمٌ عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ عُمَرُقُلْتُ يَا رَسُولَ اللَّهِ لَوْ اتَّخَذْتَ مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى فَنَزَلَتْ{ وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى }",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah menceritakan kepada kami [Husyaim] dari [Humaid Ath Thawil] dari [Anas bin Malik] ia berkata, \" [Umar] berkata, \"Aku berkata, \"Wahai Rasulullah, sekiranya engkau jadikan maqam Ibrahim sebagai tempat sholat, \" lalu turunlah ayat; \" (Dan jadikanlah sebahagian maqam Ibrahim tempat sholat). \""
            },
            {
                "number": 967,
                "arab": "حَدَّثَنَا عَلْقَمَةُ بْنُ عَمْرٍو الدَّارِمِيُّ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَصَلَّيْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ بَيْتِ الْمَقْدِسِ ثَمَانِيَةَ عَشَرَ شَهْرًا وَصُرِفَتْ الْقِبْلَةُ إِلَى الْكَعْبَةِ بَعْدَ دُخُولِهِ إِلَى الْمَدِينَةِ بِشَهْرَيْنِ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى إِلَى بَيْتِ الْمَقْدِسِ أَكْثَرَ تَقَلُّبَ وَجْهِهِ فِي السَّمَاءِ وَعَلِمَ اللَّهُ مِنْ قَلْبِ نَبِيِّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ يَهْوَى الْكَعْبَةَ فَصَعِدَ جِبْرِيلُ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُتْبِعُهُ بَصَرَهُ وَهُوَ يَصْعَدُ بَيْنَ السَّمَاءِ وَالْأَرْضِ يَنْظُرُ مَا يَأْتِيهِ بِهِ فَأَنْزَلَ اللَّهُ{ قَدْ نَرَى تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ }الْآيَةَ فَأَتَانَا آتٍ فَقَالَ إِنَّ الْقِبْلَةَ قَدْ صُرِفَتْ إِلَى الْكَعْبَةِ وَقَدْ صَلَّيْنَا رَكْعَتَيْنِ إِلَى بَيْتِ الْمَقْدِسٍ وَنَحْنُ رُكُوعٌ فَتَحَوَّلْنَا فَبَنَيْنَا عَلَى مَا مَضَى مِنْ صَلَاتِنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا جِبْرِيلُ كَيْفَ حَالُنَا فِي صَلَاتِنَا إِلَى بَيْتِ الْمَقْدِسِ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ }",
                "id": "Telah menceritakan kepada kami [Alqamah bin Amru Ad Darimi] berkata, telah menceritakan kepada kami [Abu Bakr bin Ayyasy] dari [Abu Ishaq] dari [Al Bara`] berkata, \"Kami sholat bersama Rasulullah shallallahu 'alaihi wasallam menghadap Baitul Maqdis selama delapan belas bulan, kemudian kiblat dialihkan ke Ka'bah kira-kira dua bulan setelah beliau di Madinah. Ketika sholat, Rasulullah shallallahu 'alaihi wasallam sering menghadapkan wajahnya ke langit, dan Allah tahu bahwa hati Nabi-Nya shallallahu 'alaihi wasallam cenderung ke Ka'bah. Lalu Jibril naik ke langit dan beliau terus memandanginya dengan matanya, beliau menunggu apa yang akan Allah perintahkan kepada Jibril. Maka Allah menurunkan ayat: \" (Sungguh Kami (sering) melihat mukamu menengadah ke langit). \" Lalu datanglah seorang pembawa berita kepada kami, ia mengatakan, \"Kiblat telah dialihkan ke Ka'bah, waktu itu kami telah sholat dua raka'at menghadap Baitul Maqdis, maka kami pun mengalihkan kiblat kami dan tetap menyempurnakan sholat (tidak membatalkan). \" Rasulullah shallallahu 'alaihi wasallam bertanya kepada Malaikat Jibril: \"Wahai Jibril, bagaimana dengan sholat kami ketika masih menghadap Baitul Maqdis?\" Maka Allah Azza wa Jala menurunkan ayat: \" (dan Allah tidak akan menyia-nyiakan imanmu. Sesungguhnya Allah Maha Pengasih lagi Maha Penyayang kepada manusia). \""
            },
            {
                "number": 968,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْأَزْدِيُّ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى النَّيْسَابُورِيُّ قَالَ حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ قَالَا حَدَّثَنَا أَبُو مَعْشَرٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ قِبْلَةٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya Al Azdi] berkata, telah menceritakan kepada kami [Hasyim bin Al Qasim]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Yahya An Naisaburi] ia berkata; telah menceritakan kepada kami [Ashim bin Ali] keduanya berkata; telah menceritakan kepada kami [Abu Ma'syar] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Antara timur dan barat adalah arah kiblat. \""
            },
            {
                "number": 969,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ وَيَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَا حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ كَثِيرِ بْنِ زَيْدٍ عَنْ الْمُطَّلِبِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَخَلَ أَحَدُكُمْ الْمَسْجِدَ فَلَا يَجْلِسْ حَتَّى يَرْكَعَ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Al Mundzir Al Hizami] dan [Ya'qub bin Humaid bin Kasib] keduanya berkata; telah menceritakan kepada kami [Ibnu Abu Fudaik] dari [Katsir bin Zaid] dari [Al Muththalib bin Abdullah] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian masuk masjid, maka janganlah duduk hingga ia sholat dua raka'at. \""
            },
            {
                "number": 970,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ عَنْ أَبِي قَتَادَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَخَلَ أَحَدُكُمْ الْمَسْجِدَ فَلْيُصَلِّ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ",
                "id": "Telah menceritakan kepada kami [Al Abbas bin Utsman] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Malik bin Anas] dari [Amir bin Abdullah bin Az Zubair] dari [Amru bin Sulaim Az Zuraqqi] dari [Abu Qatadah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian masuk masjid hendaklah sholat dua raka'at sebelum ia duduk. \""
            },
            {
                "number": 971,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ الْغَطَفَانِيِّ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ الْيَعْمُرِيِّأَنَّ عُمَرَ بْنَ الْخَطَّابِ قَامَ يَوْمَ الْجُمُعَةِ خَطِيبًا أَوْ خَطَبَ يَوْمَ الْجُمُعَةِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ إِنَّكُمْ تَأْكُلُونَ شَجَرَتَيْنِ لَا أُرَاهُمَا إِلَّا خَبِيثَتَيْنِ هَذَا الثُّومُ وَهَذَا الْبَصَلُ وَلَقَدْ كُنْتُ أَرَى الرَّجُلَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوجَدُ رِيحُهُ مِنْهُ فَيُؤْخَذُ بِيَدِهِ حَتَّى يُخْرَجَ إِلَى الْبَقِيعِ فَمَنْ كَانَ آكِلَهَا لَا بُدَّ فَلْيُمِتْهَا طَبْخًا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Isma'il bin Ulayyah] dari [Sa'id bin Abu Arubah] dari [Qatadah] dari [Salim bin Abu Al Ju'd Al Ghathafani] dari [Ma'dan bin Abu Thalhah Al Ya'muri] berkata, \" [Umar Ibnul Khaththab] berdiri khutbah di hari jum'at, atau berkhutbah pada hari jum'at. Ia bertahmid dan memuji Allah, kemudian berkata, \"Wahai manusia, kalian makan dua macam tumbuhan; bawang merah dan bawang putih, aku tidak melihatnya kecuali sesuatu yang kotor. Sungguh, pada masa Rasulullah shallallahu 'alaihi wasallam aku pernah mendapati seorang laki-laki yang mengeluarkan bau itu (bawang), lalu tangannya ditarik dan dibawa ke Bagi'. Maka barangsiapa memakannya hendaklah ia menghilangkan baunya dengan memasaknya. \""
            },
            {
                "number": 972,
                "arab": "حَدَّثَنَا أَبُو مَرْوَانَ الْعُثْمَانِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ الثُّومِ فَلَا يُؤْذِينَا بِهَا فِي مَسْجِدِنَا هَذَاقَالَ إِبْرَاهِيمُ وَكَانَ أَبِي يَزِيدُ فِيهِ الْكُرَّاثَ وَالْبَصَلَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي أَنَّهُ يَزِيدُ عَلَى حَدِيثِ أَبِي هُرَيْرَةَ فِي الثُّومِ",
                "id": "Telah menceritakan kepada kami [Abu Marwan Al Utsmani] berkata, telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Ibnu Syihab] dari [Sa'id Ibnul Musayyab] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa makan tumbuhan ini, maka janganlah ia menyakiti kami di masjid kami ini. \" Ibrahim berkata, \"Bapakku menambahkan al Kurrats (bawang bakung) dan al Bashal (bawang merah) dalam hadits Nabi shallallahu 'alaihi wasallam tersebut. Yakni menambahi dari hadits Abu Hurairah yang berbicara tentang bawang. \""
            },
            {
                "number": 973,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَجَاءٍ الْمَكِّيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ شَيْئًا فَلَا يَأْتِيَنَّ الْمَسْجِدَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah menceritakan kepada kami [Abdullah bin Raja` Al Makki] dari [ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa makan sesuatu dari tumbuhan ini (bawang putih), maka jangan sekali-kali datang ke masjid. \""
            },
            {
                "number": 974,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ الطَّنَافِسِيُّ قَالَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَأَتَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَسْجِدَ قُبَاءَ يُصَلِّي فِيهِ فَجَاءَتْ رِجَالٌ مِنْ الْأَنْصَارِ يُسَلِّمُونَ عَلَيْهِ فَسَأَلْتُ صُهَيْبًا وَكَانَ مَعَهُ كَيْفَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرُدُّ عَلَيْهِمْ قَالَ كَانَ يُشِيرُ بِيَدِهِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad Ath Thanafisi] berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Zaid bin Aslam] dari [Abdullah bin Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam datang ke masjid Quba dan sholat di dalamnya. Kemudian datang beberapa laki-laki Anshar seraya memberi salam kepadanya. Aku bertanya kepada Shuhaib bagaimana Rasulullah shallallahu 'alaihi wasallam menjawab salam mereka, sebab ia waktu itu sedang bersamanya. Ia berkata, \"Beliau hanya berisyarat dengan tangannya. \" "
            },
            {
                "number": 975,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَبَعَثَنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحَاجَةٍ ثُمَّ أَدْرَكْتُهُ وَهُوَ يُصَلِّي فَسَلَّمْتُ عَلَيْهِ فَأَشَارَ إِلَيَّ فَلَمَّا فَرَغَ دَعَانِي فَقَالَ إِنَّكَ سَلَّمْتَ عَلَيَّ آنِفًا وَأَنَا أُصَلِّي",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh Al Mishri] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Abu Zubair] dari [Jabir] ia berkata, \"Nabi shallallahu 'alaihi wasallam mengutusku untuk suatu keperluan, kemudian ketika kembali aku mendapati beliau sedang sholat, aku memberi salam kepada beliau, namun beliau hanya memberi isyarat kepadaku. Tatkala selesai, beliau memanggilku dan bersabda: \"Kamu memanggilku tadi, aku masih sholat. \" "
            },
            {
                "number": 976,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ قَالَكُنَّا نُسَلِّمُ فِي الصَّلَاةِ فَقِيلَ لَنَا إِنَّ فِي الصَّلَاةِ لَشُغْلًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Ad Darimi] berkata, telah menceritakan kepada kami [An Nadlr bin Syumail] berkata, telah menceritakan kepada kami [Yunus bin Abu Ishaq] dari [Abu Ishaq] dari [Abu Al Ahwash] dari [Abdullah] ia berkata, \"Ketika sholat kami memberi sholat, \" lalu dikatakan kepada kami: \"Sesungguhnya dalam sholat ada kesibukan. \""
            },
            {
                "number": 977,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا أَشْعَثُ بْنُ سَعِيدٍ أَبُو الرَّبِيعِ السَّمَّانُ عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ عَنْ أَبِيهِ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَتَغَيَّمَتْ السَّمَاءُ وَأَشْكَلَتْ عَلَيْنَا الْقِبْلَةُ فَصَلَّيْنَا وَأَعْلَمْنَا فَلَمَّا طَلَعَتْ الشَّمْسُ إِذَا نَحْنُ قَدْ صَلَّيْنَا لِغَيْرِ الْقِبْلَةِ فَذَكَرْنَا ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَنْزَلَ اللَّه{ فَأَيْنَمَا تُوَلُّوا فَثَمَّ وَجْهُ اللَّهِ }",
                "id": "Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Abu Dawud] berkata, telah menceritakan kepada kami [Asy'ats bin Sa'id Abu Rabi' As Samman] dari [Ashim bin ubaidhullah] dari [Abdullah bin Amir bin Rabi'ah] dari [Bapaknya] ia berkata, \"Kami bersama Rasulullah shallallahu 'alaihi wasallam dalam perjalanan, sementara langit mendung dan menyulitkan kami untuk mengetahui arah kiblat. Ketika matahari terbit, kami mengetahui bahwa kami telah salah sholat bukan menghadap kiblat. Kemudian hal itu kami ceritakan kepada Nabi shallallahu 'alaihi wasallam, maka Allah pun menurunkan ayat: \" (Kemana saja kalian menghadap, maka di situlah wajah Allah). \""
            },
            {
                "number": 978,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ طَارِقِ بْنِ عَبْدِ اللَّهِ الْمُحَارِبِيِّ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّيْتَ فَلَا تَبْزُقَنَّ بَيْنَ يَدَيْكَ وَلَا عَنْ يَمِينِكَ وَلَكِنْ ابْزُقْ عَنْ يَسَارِكَ أَوْ تَحْتَ قَدَمِكَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Manshur] dari [Rabi' bin Hirasy] dari [Thariq bin Abdullah Al Muharibi] Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila kamu sholat, maka janganlah kamu membuang ludah di hadapan atau samping kananmu, akan tetapi meludahlah ke kiri atau di bawah kakimu. \" "
            },
            {
                "number": 979,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ الْقَاسِمِ بْنِ مِهْرَانَ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى نُخَامَةً فِي قِبْلَةِ الْمَسْجِدِ فَأَقْبَلَ عَلَى النَّاسِ فَقَالَ مَا بَالُ أَحَدِكُمْ يَقُومُ مُسْتَقْبِلَهُ يَعْنِي رَبَّهُ فَيَتَنَخَّعُ أَمَامَهُ أَيُحِبُّ أَحَدُكُمْ أَنْ يُسْتَقْبَلَ فَيُتَنَخَّعَ فِي وَجْهِهِ إِذَا بَزَقَ أَحَدُكُمْ فَلْيَبْزُقَنَّ عَنْ شِمَالِهِ أَوْ لِيَقُلْ هَكَذَا فِي ثَوْبِهِثُمَّ أَرَانِي إِسْمَعِيلُ يَبْزُقُ فِي ثَوْبِهِ ثُمَّ يَدْلُكُهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Isma'il bin Ulayyah] dari [Al Qasim bin Mihran] dari [Abu Rafi'] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melihat dahak di kiblat masjid, lalu beliau menghadap ke arah orang-orang dan bersabda: \"Kenapa salah seorang dari kalian berdiri di hadapan-Nya (Rabbnya) dan berdahak di depan-Nya? Apakah kalian suka jika seseorang berdiri di hadapannya kemudian meludah di depan mukanya? Jika salah seorang dari kalian ingin meludah hendaklah melakukannya di sebelah kirinya, atau membuang di kainnya seperti ini, \" Isma'il kemudian memperagakan kepadaku dengan meludah dalam kain miliknya, setelah itu menggosoknya. \""
            },
            {
                "number": 980,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ وَعَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ قَالَا حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ عَاصِمٍ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَأَنَّهُ رَأَى شَبَثَ بْنَ رِبْعِيٍّ بَزَقَ بَيْنَ يَدَيْهِ فَقَالَ يَا شَبَثُ لَا تَبْزُقْ بَيْنَ يَدَيْكَ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَنْهَى عَنْ ذَلِكَ وَقَالَ إِنَّ الرَّجُلَ إِذَا قَامَ يُصَلِّي أَقْبَلَ اللَّهُ عَلَيْهِ بِوَجْهِهِ حَتَّى يَنْقَلِبَ أَوْ يُحْدِثَ حَدَثَ سُوءٍ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari] dan [Abdullah bin Amir bin Zurarah] keduanya berkata; telah menceritakan kepada kami [Abu Bakr bin 'Ayyasy] dari [Ashim] dari [Abu Wa`il] dari [Hudzaifah] Bahwasanya ia melihat Syabats bin Rabi'i membuang dahak di hadapannya, ia lalu berkata, \"Hai Syabats, janganlah kamu meludah di hadapanmu, sesungguhnya Rasulullah shallallahu 'alaihi wasallam melarang perbuatan itu, beliau bersabda: \"Jika seseorang sholat, Allah menemuinya dengan wajah-Nya hingga ia selesai sholat atau berhadats yang buruk (membatalkan sholat). \" "
            },
            {
                "number": 981,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ وَعَبْدَةُ بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَزَقَ فِي ثَوْبِهِ وَهُوَ فِي الصَّلَاةِ ثُمَّ دَلَكَهُ",
                "id": "Telah menceritakan kepada kami [Zaid bin Akhzam] dan ['Abdah bin Abdullah] keduanya berkata; telah menceritakan kepada kami [Abdu Ash Shamad] berkata, telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam meludah di kainnya kemudian menggosoknya, padahal beliau dalam keadaan sholat. \" "
            },
            {
                "number": 982,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ مَسَّ الْحَصَى فَقَدْ لَغَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengusap kerikil maka ia telah sia-sia. \""
            },
            {
                "number": 983,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ وَعَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ قَالَا حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنِي أَبُو سَلَمَةَ قَالَ حَدَّثَنِي مُعَيْقِيبٌ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَسْحِ الْحَصَى فِي الصَّلَاةِ إِنْ كُنْتَ فَاعِلًا فَمَرَّةً وَاحِدَةً",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shbbah] dan [Abdurrahman bin Ibrahim] keduanya berkata; telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Al Auza'i] berkata, telah menceritakan kepadaku [Yahya bin Abu Katsir] berkata, telah menceritakan kepada kami [Abu Salamah] berkata; telah menceritakan kepadaku [Mu'aiqib] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda berkenaan dengan hukum mengusap kerikil dalam sholat: \"Jika engkau harus melakukannya, maka cukup sekali saja. \""
            },
            {
                "number": 984,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي الْأَحْوَصِ اللَّيْثِيِّ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ أَحَدُكُمْ إِلَى الصَّلَاةِ فَإِنَّ الرَّحْمَةَ تُوَاجِهُهُ فَلَا يَمْسَحْ بِالْحَصَى",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] dan [Muhammad bin Ash Shabbah] keduanya berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Abul Ahwash Al Laitsi] dari [Abu Dzar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian berdiri melaksanakan sholat, sesungguhnya rahmat sedang menuju kepada dirinya, maka janganlah mengusap kerikil. \""
            },
            {
                "number": 985,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ عَنْ الشَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ حَدَّثَتْنِي مَيْمُونَةُ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى الْخُمْرَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abbad Ibnul Awwam] dari [Asy Syaibani] dari [Abdullah bin Syaddad] berkata, telah menceritakan kepadaku [Maimunah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat di atas tikar kecil. \""
            },
            {
                "number": 986,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ عَنْ أَبِي سَعِيدٍ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى حَصِيرٍ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] dari [Abu Sa'id] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat di atas tikar. \""
            },
            {
                "number": 987,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنِي زَمْعَةُ بْنُ صَالِحٍ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَصَلَّى ابْنُ عَبَّاسٍ وَهُوَ بِالْبَصْرَةِ عَلَى بِسَاطِهِ ثُمَّ حَدَّثَ أَصْحَابَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي عَلَى بِسَاطِهِ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah menceritakan kepadaku [Zam'ah bin Shalih] dari [Amru bin Dinar] ia berkata, \"Ketika di Bashrah, [Ibnu Abbas sholat] di atas karpet. Kemudian para sahabatnya menceritakan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam juga sholat di atas karpet. \""
            },
            {
                "number": 988,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الدَّرَاوَرْدِيُّ عَنْ إِسْمَعِيلَ بْنِ أَبِي حَبِيبَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ قَالَجَاءَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِنَا فِي مَسْجِدِ بَنِي عَبْدِ الْأَشْهَلِ فَرَأَيْتُهُ وَاضِعًا يَدَيْهِ عَلَى ثَوْبِهِ إِذَا سَجَدَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdul Aziz bin Muhammad Ad Darawardi] dari [Isma'il bin Abu Habibah] dari [Abdullah bin 'Abdurrahman] ia berkata, \"Nabi shallallahu 'alaihi wasallam mendatangi kami dan sholat bersama kami di masjid Bani Abdul Asyhal, dan aku melihatnya meletakkan tangan di atas kainnya ketika sujud. \""
            },
            {
                "number": 989,
                "arab": "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي أُوَيْسٍ أَخْبَرَنِي إِبْرَاهِيمُ بْنُ إِسْمَعِيلَ الْأَشْهَلِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَابِتِ بْنِ الصَّامِتِ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي بَنِي عَبْدِ الْأَشْهَلِ وَعَلَيْهِ كِسَاءٌ مُتَلَفِّفٌ بِهِ يَضَعُ يَدَيْهِ عَلَيْهِ يَقِيهِ بَرْدَ الْحَصَى",
                "id": "Telah menceritakan kepada kami [Ja'far bin Musafir] berkata, telah menceritakan kepada kami [Isma'il bin Abu Uwais] berkata, telah mengabarkan kepadaku [Ibrahim bin Isma'il Al Asyhali] dari [Abdullah bin 'Abdurrahman bin Tsabit bin Ash Shamit] dari [Bapaknya] dari [Kakeknya] berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat di Bani Abdul Asyhal dengan berselimut kain, dan beliau meletakkan tangannya di atas kain tersebut agar terhindar dari dinginnya pasir. \" "
            },
            {
                "number": 990,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبٍ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ غَالِبٍ الْقَطَّانِ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكُنَّا نُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شِدَّةِ الْحَرِّ فَإِذَا لَمْ يَقْدِرْ أَحَدُنَا أَنْ يُمَكِّنَ جَبْهَتَهُ بَسَطَ ثَوْبَهُ فَسَجَدَ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim bin Habib] berkata, telah menceritakan kepada kami [Biysr Ibnul Mufadldlal] dari [Ghalib bin Al Qaththan] dari [Bakr bin Abdullah] dari [Anas bin Malik] ia berkata, \"Kami pernah sholat bersama Nabi shallallahu 'alaihi wasallam di waktu yang sangat panas. Jika salah seorang dari kami tidak kuat meletakkan keningnya langsung ke pasir, maka ia membentangkan kain dan sujud di atasnya. \""
            },
            {
                "number": 991,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَهِشَامُ بْنُ عَمَّارٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Hisyam bin Ammar] keduanya berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagi laki-laki bertasbih dan bagi wanita menepukkan tangan. \""
            },
            {
                "number": 992,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَسَهْلُ بْنُ أَبِي سَهْلٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] dan [Sahl bin Abu Sahl] keduanya berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Abu Hazim] dari [Sahl bin Sa'd As Sa'idi] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagi laki-laki bertasbih dan bagi wanita menepukkan tangan. \""
            },
            {
                "number": 993,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ وَعُبَيْدُ اللَّهِ عَنْ نَافِعٍأَنَّهُ كَانَ يَقُولُ قَالَ ابْنُ عُمَرَ رَخَّصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلنِّسَاءِ فِي التَّصْفِيقِ وَلِلرِّجَالِ فِي التَّسْبِيحِ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] berkata, telah menceritakan kepada kami [Yahya bin Sulaim] dari [Isma'il bin Umayyah] dan [ubaidhullah] dari [Nafi'] ia berkata; [Ibnu Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam memberi rukhsah (keringanan) bagi para wanita dengan menepuk tangan dan bagi lelaki dengan bertasbih. \""
            },
            {
                "number": 994,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ النُّعْمَانِ بْنِ سَالِمٍ عَنْ ابْنِ أَبِي أَوْسٍ قَالَكَانَ جَدِّي أَوْسٌ أَحْيَانًا يُصَلِّي فَيُشِيرُ إِلَيَّ وَهُوَ فِي الصَّلَاةِ فَأُعْطِيهِ نَعْلَيْهِ وَيَقُولُ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي نَعْلَيْهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ghundar] dari [Syu'bah] dari [An Nu'man bin Salim] dari [Ibnu Abu Aus] ia berkata, \" [Aus] kakekku, terkadang dalam sholat ia berisyarat kepadaku, lalu aku ambilkan sandal miliknya. Lalu berkata, \"Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam sholat dengan mengenakan sandal. \""
            },
            {
                "number": 995,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي حَافِيًا وَمُنْتَعِلًا",
                "id": "Telah menceritakan kepada kami [Bisyr bin Hilal Ash Shawwaf] berkata, telah menceritakan kepada kami [Yazid bin Zurai'] dari [Husain Al MuAllim] dari [Amru bin Syu'aib] dari [Bapaknya] dari [kakeknya] ia berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam sholat dengan sandal dan terkadang tidak. \""
            },
            {
                "number": 996,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَلَقَدْ رَأَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي النَّعْلَيْنِ وَالْخُفَّيْنِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Yahya bin Adam] berkata, telah menceritakan kepada kami [Zuhair] dari [Abu Ishaq] dari [Alqamah] dari [Abdullah] ia berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam sholat dengan menggunakan sandal dan khuf. \""
            },
            {
                "number": 997,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ مُعَاذٍ الضَّرِيرُ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ وَأَبُو عَوَانَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمِرْتُ أَنْ لَا أَكُفَّ شَعَرًا وَلَا ثَوْبًا",
                "id": "Telah menceritakan kepada kami [Bisyr bin Mu'adz Adl Dlarir] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dan [Abu Awanah] dari [Amru bin Dinar] dari [Thawus] dari [Ibnu Abbas] ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Aku diperintahkan agar tidak menahan rambut dan kain. \""
            },
            {
                "number": 998,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَأُمِرْنَا أَلَّا نَكُفَّ شَعَرًا وَلَا ثَوْبًا وَلَا نَتَوَضَّأَ مِنْ مَوْطَإٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Abdullah bin Idris] dari [A'masy] dari [Abu Wa`il] dari [Abdullah] ia berkata, \"Kami diperintah untuk tidak menahan rambut dan kain saat sujud. Dan kami tidak diperintahkan untuk mengulang wudlu apabila menginjak kotoran. \""
            },
            {
                "number": 999,
                "arab": "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ عَنْ شُعْبَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي مُخَوَّلُ بْنُ رَاشِدٍ قَالَ سَمِعْتُ أَبَا سَعْدٍ رَجُلًا مِنْ أَهْلِ الْمَدِينَةِ يَقُولُرَأَيْتُ أَبَا رَافِعٍ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى الْحَسَنَ بْنَ عَلِيٍّ وَهُوَ يُصَلِّي وَقَدْ عَقَصَ شَعْرَهُ فَأَطْلَقَهُ أَوْ نَهَى عَنْهُ وَقَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُصَلِّيَ الرَّجُلُ وَهُوَ عَاقِصٌ شَعَرَهُ",
                "id": "Telah menceritakan kepada kami [Bakr bin Khalaf] berkata, telah menceritakan kepada kami [Khalid Ibnul Harits] dari [Syu'bah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah menceritakan kepadaku [Mukhawwal bin Rasyid] berkata; Aku mendengar [Abu Sa'id] -seorang laki-laki dari Madinah- berkata; Aku melihat [Abu Rafi'] mantan budak Rasulullah shallallahu 'alaihi wasallam, ia pernah melihat Hasan bin Ali sholat dengan menyanggul rambut kemudian melepasnya, atau ia melarang hal hal demikian itu. Ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang seseorang sholat dengan menyanggul rambutnya. \""
            },
            {
                "number": 1000,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَرْفَعُوا أَبْصَارَكُمْ إِلَى السَّمَاءِ أَنْ تَلْتَمِعَ يَعْنِي فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Thalhah bin Yahya] dari [Yunus] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mengangkat pandangan kalian ke atas langit hingga mata kalian buta. \" -Yakni dalam sholat-. "
            },
            {
                "number": 1001,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا بِأَصْحَابِهِ فَلَمَّا قَضَى الصَّلَاةَ أَقْبَلَ عَلَى الْقَوْمِ بِوَجْهِهِ فَقَالَ مَا بَالُ أَقْوَامٍ يَرْفَعُونَ أَبْصَارَهُمْ إِلَى السَّمَاءِ حَتَّى اشْتَدَّ قَوْلُهُ فِي ذَلِكَ لَيَنْتَهُنَّ عَنْ ذَلِكَ أَوْ لَيَخْطَفَنَّ اللَّهُ أَبْصَارَهُمْ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Abdul A'la] berkata, telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas bin Malik] ia berkata, \"Pernah suatu hari Rasulullah shallallahu 'alaihi wasallam sholat bersama sahabatnya, selesai sholat beliau menghadap ke arah orang-orang dan bersabda: \"Kenapa orang-orang suka mengangkat mata mereka ke langit -hingga suara beliau meninggi- mereka segera mengakhiri perbuatannya itu atau Allah akan menyambar mata mereka. \""
            },
            {
                "number": 1002,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ عَنْ جَابِرِ بْنِ سَمُرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيَنْتَهِيَنَّ أَقْوَامٌ يَرْفَعُونَ أَبْصَارَهُمْ إِلَى السَّمَاءِ أَوْ لَا تَرْجِعُ أَبْصَارُهُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami ['Abdurrahman] berkata, telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Al Musayyab bin Rafi'] dari [Tamim bin Tharafah] dari [Jabir bin Samurah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Orang-orang itu segera mengakhiri perbuatannya mengangkat mata ke langit atau mata mereka tidak akan kembali lagi. \""
            },
            {
                "number": 1003,
                "arab": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ وَأَبُو بَكْرِ بْنُ خَلَّادٍ قَالَا حَدَّثَنَا نُوحُ بْنُ قَيْسٍ حَدَّثَنَا عَمْرُو بْنُ مَالِكٍ عَنْ أَبِي الْجَوْزَاءِ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَتْ امْرَأَةٌ تُصَلِّي خَلْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَسْنَاءُ مِنْ أَحْسَنِ النَّاسِ فَكَانَ بَعْضُ الْقَوْمِ يَسْتَقْدِمُ فِي الصَّفِّ الْأَوَّلِ لِئَلَّا يَرَاهَا وَيَسْتَأْخِرُ بَعْضُهُمْ حَتَّى يَكُونَ فِي الصَّفِّ الْمُؤَخَّرِ فَإِذَا رَكَعَ قَالَ هَكَذَا يَنْظُرُ مِنْ تَحْتِ إِبْطِهِ فَأَنْزَلَ اللَّهُ{ وَلَقَدْ عَلِمْنَا الْمُسْتَقْدِمِينَ مِنْكُمْ وَلَقَدْ عَلِمْنَا الْمُسْتَأْخِرِينَ }فِي شَأْنِهَا",
                "id": "Telah menceritakan kepada kami [Humaid bin Mas'adah] dan [Abu Bakr bin Khallad] keduanya berkata; telah menceritakan kepada kami [Nuh bin Qais] berkata, telah menceritakan kepada kami [Amru bin Malik] dari [Abul Jauza`] dari [Ibnu Abbas] ia berkata, \"Seorang wanita pernah sholat di belakang Nabi shallallahu 'alaihi wasallam -ia adalah wanita tercantik-. Sebagian sahabat maju ke barisan depan agar tidak dapat melihatnya, sementara sebagian sahabat yang lain sengaja mundur ke barisan belakang. Maka ketika rukuk (orang yang di barisan belakang), Ibnu Abbas berkata, \"Seperti ini -yakni melihat dari bawah ketiaknya-. Maka Allah pun menurunkan ayat: \" (Dan sungguh Kami telah mengetahui orang-orang yang terdepan di antara kalian dan sungguh Kami telah mengetahui orang-orang yang di belakang), \" dalam perkara wanita tersebut. \" "
            },
            {
                "number": 1004,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَهِشَامُ بْنُ عَمَّارٍ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَأَتَى رَجُلٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَحَدُنَا يُصَلِّي فِي الثَّوْبِ الْوَاحِدِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَ كُلُّكُمْ يَجِدُ ثَوْبَيْنِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Hisyam bin Ammar] keduanya berkata; berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Sa'id Ibnul Musayyab] dari [Abu Hurairah] ia berkata, \"Seorang laki-laki datang menemui Nabi shallallahu 'alaihi wasallam dan berkata, \"Salah seorang dari kami sholat dengan hanya mengenakan satu kain?\" beliau bersabda: \"Apakah kalian semua mempunyai dua kain?\""
            },
            {
                "number": 1005,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ حَدَّثَنِي أَبُو سَعِيدٍ الْخُدْرِيُّأَنَّهُ دَخَلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي فِي ثَوْبٍ وَاحِدٍ مُتَوَشِّحًا بِهِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Umar bin Ubaid] dari [A'masy] dari [Abu Sufyan] dari [Jabir] berkata, telah menceritakan kepadaku [Abu Sa'id Al Khudlri] bahwasanya ia pernah mengunjungi Rasulullah shallallahu 'alaihi wasallam, ketika itu beliau sholat dengan mengenakan satu kain yang diselempangkan. \" "
            },
            {
                "number": 1006,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي ثَوْبٍ وَاحِدٍ مُتَوَشِّحًا بِهِ وَاضِعًا طَرَفَيْهِ عَلَى عَاتِقَيْهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki'] dari [Hisyam bin Urwah] dari [Bapaknya] dari [Umar bin Abu Salamah] ia berkata, \"Aku pernah Rasulullah shallallahu 'alaihi wasallam sholat dengan mengenakan satu kain, beliau menyelempangkan dan meletakkan ujungnya pada kedua pundak. \""
            },
            {
                "number": 1007,
                "arab": "حَدَّثَنَا أَبُو إِسْحَقَ الشَّافِعِيُّ إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ الْعَبَّاسِ حَدَّثَنَا مُحَمَّدُ بْنُ حَنْظَلَةَ بْنِ مُحَمَّدِ بْنِ عَبَّادٍ الْمَخْزُومِيُّ عَنْ مَعْرُوفِ بْنِ مُشْكَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَيْسَانَ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِالْبِئْرِ الْعُلْيَا فِي ثَوْبٍ",
                "id": "Telah menceritakan kepada kami [Abu Ishaq Asy Syafi'I Ibrahim bin Muhammad bin Al Abbas] berkata, telah menceritakan kepada kami [Muhammad bin Hanzhalah bin Abbad Al Makhzumi] dari [Ma'ruf bin Musykan] dari ['Abdurrahman bin Kaisan] dari [Bapaknya] ia berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam sholat dengan mengenakan satu kain di Bi`rul 'Ulya. \""
            },
            {
                "number": 1008,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا عَمْرُو بْنُ كَثِيرٍ حَدَّثَنَا ابْنُ كَيْسَانَ عَنْ أَبِيهِ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الظُّهْرَ وَالْعَصْرَ فِي ثَوْبٍ وَاحِدٍ مُتَلَبِّبًا بِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Bisyr] berkata, telah menceritakan kepada kami [Amru bin Katsir] dari [Ibnu Kaisan] dari [Bapaknya] ia berkata, \"Aku pernah melihat Nabi shallallahu 'alaihi wasallam sholat zhuhur dan ashar dengan mengenakan satu kain mutalabbiban (mengumpulkan ujungnya di depan dada). \""
            },
            {
                "number": 1009,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَرَأَ ابْنُ آدَمَ السَّجْدَةَ فَسَجَدَ اعْتَزَلَ الشَّيْطَانُ يَبْكِي يَقُولُ يَا وَيْلَهُ أُمِرَ ابْنُ آدَمَ بِالسُّجُودِ فَسَجَدَ فَلَهُ الْجَنَّةُ وَأُمِرْتُ بِالسُّجُودِ فَأَبَيْتُ فَلِي النَّارُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika anak Adam membaca ayat sajadah kemudian sujud, maka setan menjauh sambil menangis, ia berkata, \"Duhai malangnya, anak Adam diperintahkan sujud lalu ia sujud, maka ia pun masuk surga. sementara aku diperintah sujud namun aku menolak, maka aku pun masuk neraka. \""
            },
            {
                "number": 1010,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ بْنِ خُنَيْسٍ عَنْ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ قَالَ قَالَ لِي ابْنُ جُرَيْجٍ يَا حَسَنُ أَخْبَرَنِي جَدُّكَ عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ عَنْ ابْنِ عَبَّاسٍ قَالَكُنْتُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَاهُ رَجُلٌ فَقَالَ إِنِّي رَأَيْتُ الْبَارِحَةَ فِيمَا يَرَى النَّائِمُ كَأَنِّي أُصَلِّي إِلَى أَصْلِ شَجَرَةٍ فَقَرَأْتُ السَّجْدَةَ فَسَجَدْتُ فَسَجَدَتْ الشَّجَرَةُ لِسُجُودِي فَسَمِعْتُهَا تَقُولُ اللَّهُمَّ احْطُطْ عَنِّي بِهَا وِزْرًا وَاكْتُبْ لِي بِهَا أَجْرًا وَاجْعَلْهَا لِي عِنْدَكَ ذُخْرًا قَالَ ابْنُ عَبَّاسٍ فَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ السَّجْدَةَ فَسَجَدَ فَسَمِعْتُهُ يَقُولُ فِي سُجُودِهِ مِثْلَ الَّذِي أَخْبَرَهُ الرَّجُلُ عَنْ قَوْلِ الشَّجَرَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Khallad Al Bahili] berkata, telah menceritakan kepada kami [Muhammad bin Yazid bin Khunais] dari [Al Hasan bin Muhammad bin ubaidhullah bin Abu Yazid] ia berkata; [Ibnu Juraij] berkata kepadaku, \"Wahai Hasan, [kakekmu] telah mengabarkan kepadaku dari [Ibnu Abbas], bahwa ia pernah berkata, \"Aku bersama Nabi shallallahu 'alaihi wasallam, tiba-tiba datang seorang laki-laki kepada beliau dan berkata, \"Semalam aku bermimpi seakan-akan aku sholat di bawah pohon, aku membaca ayat sajadah lalu bersujud. Tiba-tiba pohon itu ikut sujud karena sujudku. Dan aku mendengar pohon itu mengatakan, \"Ya Allah, dengan sujud ini hapuskanlah dosaku, tulislah pahala untukku, serta jadikanlah itu di sisi-Mu sebagai simpanan. \" Ibnu Abbas berkata: \"Lalu aku melihat Rasulullah shallallahu 'alaihi wasallam membaca ayat sajadah lalu sujud, dan aku mendengar beliau berdo`a dalam sujudnya seperti do`a yang diucapkan oleh pohon, sebagaimana yang dikabarkan oleh laki-laki itu. \" "
            },
            {
                "number": 1011,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَمْرٍو الْأَنْصَارِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْأُمَوِيُّ عَنْ ابْنِ جُرَيْجٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ عَنْ الْأَعْرَجِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ عَلِيٍّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَجَدَ قَالَ اللَّهُمَّ لَكَ سَجَدْتُ وَبِكَ آمَنْتُ وَلَكَ أَسْلَمْتُ أَنْتَ رَبِّي سَجَدَ وَجْهِي لِلَّذِي شَقَّ سَمْعَهُ وَبَصَرَهُ تَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ",
                "id": "Telah menceritakan kepada kami [Ali bin Amru Al Anshari] berkata, telah menceritakan kepada kami [Yahya bin Sa'id Al Umawi] dari [Ibnu Juraij] dari [Musa bin Uqbah] dari [Abdullah Ibnul Fadll] dari [Al A'raj] dari [ubaidhullah bin Abu Rafi'] dari [Ali] berkata, \"Nabi shallallahu 'alaihi wasallam jika sujud membaca: ALLAHUMMA AAMANTU WA LAKA ASLAMTU ANTA RABBI SAJADA WAJHII LILLADZII SYAQQA SA'AHUU WA BASHARAHUU TABAARAKA ALLAHU AHSANUL KHAALIGIIN. \""
            },
            {
                "number": 1012,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ ابْنِ أَبِي هِلَالٍ عَنْ عُمَرَ الدِّمَشْقِيِّ عَنْ أُمِّ الدَّرْدَاءِ قَالَتْ حَدَّثَنِي أَبُو الدَّرْدَاءِأَنَّهُ سَجَدَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِحْدَى عَشْرَةَ سَجْدَةً مِنْهُنَّ النَّجْمُ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya Al Mishri] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah mengabarkan kepadaku [Amru Ibnul Harits] dari [Ibnu Abu Hilal] dari [Umar Ad Dimasyqi] dari [Ummu Darda] ia berkata, \" [Abu Darda] menceritakan kepadaku bahwa ia pernah sujud bersama Nabi shallallahu 'alaihi wasallam sebanyak sebelas kali, salah satunya adalah dalam surat An Najm. \""
            },
            {
                "number": 1013,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ الدِّمَشْقِيُّ حَدَّثَنَا عُثْمَانُ بْنُ فَائِدٍ حَدَّثَنَا عَاصِمُ بْنُ رَجَاءِ بْنِ حَيْوَةَ عَنْ الْمَهْدِيِّ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عُبَيْدَةَ بْنِ خَاطِرٍ قَالَ حَدَّثَتْنِي عَمَّتِي أُمُّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ قَالَسَجَدْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِحْدَى عَشْرَةَ سَجْدَةً لَيْسَ فِيهَا مِنْ الْمُفَصَّلِ شَيْءٌ الْأَعْرَافُ وَالرَّعْدُ وَالنَّحْلُ وَبَنِي إِسْرَائِيلَ وَمَرْيَمُ وَالْحَجُّ وَسَجْدَةُ الْفُرْقَانِ وَسُلَيْمَانُ سُورَةِ النَّمْلِ وَالسَّجْدَةُ وَفِي ص وَسَجْدَةُ الْحَوَامِيمِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Sulaiman bin 'Abdurrahman Ad Dimasyqi] berkata, telah menceritakan kepada kami [Utsman bin Fa`id] berkata, telah menceritakan kepada kami [Ashim bin Raja` bin Haiwah] dari [Al Mahdi bin 'Abdurrahman bin Abidah bin Khathir] berkata; berkata, telah menceritakan kepadaku bibiku [Ummu Darda] dari [Abu Darda] ia berkata, \"Aku pernah sujud sajadah bersama Nabi shallallahu 'alaihi wasallam sebanyak sebelas kali, seluruhnya tidak terdapat dalam surat Al Mufashshal; Al A'raf, Ar Ra'd, An Nahl, Bani Isra'il, Maryam, Al Hajj, Al Furqan, Sulaiman dalam surat An Naml, sajadah dalam surat Shaad, dan sajdah surat Al Hawamim. \""
            },
            {
                "number": 1014,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ عَنْ نَافِعِ بْنِ يَزِيدَ حَدَّثَنَا الْحَارِثُ بْنُ سَعِيدٍ الْعُتَقِيُّ عَنْ عَبْدِ اللَّهِ بْنِ مُنَيْنٍ مِنْ بَنِي عَبْدِ كِلَالٍ عَنْ عَمْرِو بْنِ الْعَاصِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْرَأَهُ خَمْسَ عَشْرَةَ سَجْدَةً فِي الْقُرْآنِ مِنْهَا ثَلَاثٌ فِي الْمُفَصَّلِ وَفِي الْحَجِّ سَجْدَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Ibnu Abu Maryam] dari [Nafi' bin Yazid] berkata, telah menceritakan kepada kami [Al Harits bin Sa'id Al 'Utaqi] dari [Abdullah bin Munain] -seorang dari Bani Abdu Kilal- dari [Amru bin Al 'Ash] bahwasanya Rasulullah shallallahu 'alaihi wasallam membacakan kepadanya lima belas ayat sajadah dalam Al Qur'an; di antaranya tiga dalam Al Mufashshal dan dua dalam di Surat Al Hajj. \" "
            },
            {
                "number": 1015,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ عَطَاءِ بْنِ مِينَاءَ عَنْ أَبِي هُرَيْرَةَ قَالَسَجَدْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِذَا السَّمَاءُ انْشَقَّتْ وَاقْرَأْ بِاسْمِ رَبِّكَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ayyub bin Musa] dari ['Atho` bin Mina] dari [Abu Hurairah] ia berkata, \"Kami sujud sajdah bersama Rasulullah shallallahu 'alaihi wasallam pada ayat IDZAS SAMAA`UN SYAQQAT (Apabila langit terbelah) dan IQRA` BISMIRABBIKA (Bacalah dengan (menyebut) nama Tuhanmu). \""
            },
            {
                "number": 1016,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ فِي إِذَا السَّمَاءُ انْشَقَّتْقَالَ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ هَذَا الْحَدِيثُ مِنْ حَدِيثِ يَحْيَى بْنِ سَعِيدٍ مَا سَمِعْتُ أَحَدًا يَذْكُرُهُ غَيْرَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Yahya bin Sa'id] dari [Abu Bakr bin Muhammad bin Amru bin Hazm] dari [Umar bin Abdul Aziz] dari [Abu Bakr bin 'Abdurrahman bin Ibnul Harits bin Hisyam] dari [Abu Hurairah] berkata, \"Nabi shallallahu 'alaihi wasallam sujud pada ayat; IDZAS SAMAA`UN SYAQQAT (Apabila langit terbelah). \" Abu Bakr bin Abu Syaibah berkata, \"Ini adalah hadits yang berasal dari Yahya bin Sa'id, dan aku tidak mendengar seorang pun yang menyebutkannya selain dia. \""
            },
            {
                "number": 1017,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَجُلًا دَخَلَ الْمَسْجِدَ فَصَلَّى وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَاحِيَةٍ مِنْ الْمَسْجِدِ فَجَاءَ فَسَلَّمَ فَقَالَ وَعَلَيْكَ فَارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ فَرَجَعَ فَصَلَّى ثُمَّ جَاءَ فَسَلَّمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ وَعَلَيْكَ فَارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ بَعْدُ قَالَ فِي الثَّالِثَةِ فَعَلِّمْنِي يَا رَسُولَ اللَّهِ قَالَ إِذَا قُمْتَ إِلَى الصَّلَاةِ فَأَسْبِغْ الْوُضُوءَ ثُمَّ اسْتَقْبِلْ الْقِبْلَةَ فَكَبِّرْ ثُمَّ اقْرَأْ مَا تَيَسَّرَ مَعَكَ مِنْ الْقُرْآنِ ثُمَّ ارْكَعْ حَتَّى تَطْمَئِنَّ رَاكِعًا ثُمَّ ارْفَعْ حَتَّى تَطْمَئِنَّ قَائِمًا ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا ثُمَّ ارْفَعْ رَأْسَكَ حَتَّى تَسْتَوِيَ قَاعِدًا ثُمَّ افْعَلْ ذَلِكَ فِي صَلَاتِكَ كُلِّهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Numair] dari [ubaidhullah bin Umar] dari [Sa'id bin Abu Sa'id] dari [Abu Hurairah] berkata, \"Seorang laki-laki masuk ke dalam masjid dan sholat, sementara Rasulullah shallallahu 'alaihi wasallam berada di sudut masjid. laki-laki itu kemudian datang seraya mengucapkan salam, tetapi Nabi bersabda: \"Kembali dan sholatlah, sebab engkau belum sholat. \" Laki-laki itu pun kembali sholat, lalu kembali menemui beliau dan mengucapkan sholat kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Kembali dan sholatlah, sebab engkau belum sholat. \" Dan pada kali ketiganya ia berkata, \"Wahai Rasulullah, ajarkanlah kepadaku. \" Beliau bersabda: \"Jika engkau sholat maka sempurnakanlah wudlu dan menghadaplah ke arah kiblat. Kemudian takbir dan bacalah ayat al Qur'an yang mudah menurut kamu, kemudian rukuklah hingga engkau tenang, kemudian berdirilah hingga engkau tegak berdiri, kemudian sujudlah hingga engkau tenang, kemudian angkatlah kepalamu hingga engkau tegak duduk. Dan lakukanlah hal seperti dalam semua sholatmu. \""
            },
            {
                "number": 1018,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ قَالَسَمِعْتُ أَبَا حُمَيْدٍ السَّاعِدِيَّ فِي عَشْرَةٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِمْ أَبُو قَتَادَةَ فَقَالَ أَبُو حُمَيْدٍ أَنَا أَعْلَمُكُمْ بِصَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا لِمَ فَوَاللَّهِ مَا كُنْتَ بِأَكْثَرِنَا لَهُ تَبَعَةً وَلَا أَقْدَمَنَا لَهُ صُحْبَةً قَالَ بَلَى قَالُوا فَاعْرِضْ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ إِلَى الصَّلَاةِ كَبَّرَ ثُمَّ رَفَعَ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا مَنْكِبَيْهِ وَيَقِرَّ كُلُّ عُضْوٍ مِنْهُ فِي مَوْضِعِهِ ثُمَّ يَقْرَأُ ثُمَّ يُكَبِّرُ وَيَرْفَعُ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا مَنْكِبَيْهِ ثُمَّ يَرْكَعُ وَيَضَعُ رَاحَتَيْهِ عَلَى رُكْبَتَيْهِ مُعْتَمِدًا لَا يَصُبُّ رَأْسَهُ وَلَا يُقْنِعُ مُعْتَدِلًا ثُمَّ يَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ وَيَرْفَعُ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا مَنْكِبَيْهِ حَتَّى يَقِرَّ كُلُّ عَظْمٍ إِلَى مَوْضِعِهِ ثُمَّ يَهْوِي إِلَى الْأَرْضِ وَيُجَافِي بَيْنَ يَدَيْهِ عَنْ جَنْبَيْهِ ثُمَّ يَرْفَعُ رَأْسَهُ وَيَثْنِي رِجْلَهُ الْيُسْرَى فَيَقْعُدُ عَلَيْهَا وَيَفْتَخُ أَصَابِعَ رِجْلَيْهِ إِذَا سَجَدَ ثُمَّ يَسْجُدُ ثُمَّ يُكَبِّرُ وَيَجْلِسُ عَلَى رِجْلِهِ الْيُسْرَى حَتَّى يَرْجِعَ كُلُّ عَظْمٍ مِنْهُ إِلَى مَوْضِعِهِ ثُمَّ يَقُومُ فَيَصْنَعُ فِي الرَّكْعَةِ الْأُخْرَى مِثْلَ ذَلِكَ ثُمَّ إِذَا قَامَ مِنْ الرَّكْعَتَيْنِ رَفَعَ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا مَنْكِبَيْهِ كَمَا صَنَعَ عِنْدَ افْتِتَاحِ الصَّلَاةِ ثُمَّ يُصَلِّي بَقِيَّةَ صَلَاتِهِ هَكَذَا حَتَّى إِذَا كَانَتْ السَّجْدَةُ الَّتِي يَنْقَضِي فِيهَا التَّسْلِيمُ أَخَّرَ إِحْدَى رِجْلَيْهِ وَجَلَسَ عَلَى شِقِّهِ الْأَيْسَرِ مُتَوَرِّكًا قَالُوا صَدَقْتَ هَكَذَا كَانَ يُصَلِّي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Abu Ashim] berkata, telah menceritakan kepada kami [Abdul Hamid bin Ja'far] berkata, telah menceritakan kepada kami [Muhammad bin Amru bin 'Atho`] berkata; aku mendengar [Abu Humaid As Sa'idi] -ia adalah seorang dari sepuluh orang sahabat Rasulullah shallallahu 'alaihi wasallam yang sedang berkumpul- di antara mereka juga ada [Abu Qatadah], ia berkata, \"Aku adalah orang yang paling tahu tentang sholat Rasulullah shallallahu 'alaihi wasallam daripada kalian semua, \" mereka bertanya, \"Bagaimana bisa! Demi Allah, tidaklah engkau lebih banyak mengikuti Rasulullah ketimbang kami, dan tidak lebih dahulu bertemu dengan beliau daripada kami?\" Abu Qatadah menjawab, \"Benar. \" Mereka berkata, \"Maka jelaskanlah (kepada kami), \" Abu Qatadah berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam berdiri sholat, beliau takbir dan mengangkat kedua tangannya hingga sejajar dengan kedua pundak dan setiap organ tubuh kembali ke tempatnya. Kemudian beliau meletakkan dua telapak tangannya dan bertumpu pada lutut, seimbang tidak mengangkat atau pun menurunkan kepalanya. Kemudian beliau mengucapkan; SAMI'A ALLAHU LIMAN HAMIDAHU seraya mengangkat kedua tangannya hingga sejajar dengan kedua pundak dan setiap tulang kembali ke tempatnya. Setelah itu beliau turun ke bumi (sujud) dan menjauhkan kedua tangannya dari lambung, kemudian beliau mengangkat kepala dan membentangkan kaki kiri dan duduk di atasnya -beliau juga melenturkan jari-jari kakinya dan mengarahkan menghadap kiblat ketika sujud-, kemudian beliau sujud, kemudian takbir dan duduk di atas kaki kiri hingga setai tulang kembali ke asalnya. Setelah itu beliau bangun dan melakukan seperti itu pada raka'at yang lain. kemudian jika berdiri dari raka'at kedua, beliau mengangkat kedua tangannya sejajar dengan kedua pundak sebagaimana ketika beliau memulai sholat (Takbiratul Ikram). Kemudian beliau melakukan sisa sholatnya seperti itu, hingga ketika sampai pada sujud terakhir sebelum salam beliau mengakhirkan salah satu kakinya dan duduk tawarruk pada sisi kiri. \" Mereka berkata, \"Engkau benar, begitulah Rasulullah shallallahu 'alaihi wasallam sholat. \""
            },
            {
                "number": 1019,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ حَارِثَةَ بْنِ أَبِي الرِّجَالِ عَنْ عَمْرَةَ قَالَتْسَأَلْتُ عَائِشَةَ كَيْفَ كَانَتْ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَوَضَّأَ فَوَضَعَ يَدَيْهِ فِي الْإِنَاءِ سَمَّى اللَّهَ وَيُسْبِغُ الْوُضُوءَ ثُمَّ يَقُومُ مُسْتَقْبِلَ الْقِبْلَةِ فَيُكَبِّرُ وَيَرْفَعُ يَدَيْهِ حِذَاءَ مَنْكِبَيْهِ ثُمَّ يَرْكَعُ فَيَضَعُ يَدَيْهِ عَلَى رُكْبَتَيْهِ وَيُجَافِي بِعَضُدَيْهِ ثُمَّ يَرْفَعُ رَأْسَهُ فَيُقِيمُ صُلْبَهُ وَيَقُومُ قِيَامًا هُوَ أَطْوَلُ مِنْ قِيَامِكُمْ قَلِيلًا ثُمَّ يَسْجُدُ فَيَضَعُ يَدَيْهِ تُجَاهَ الْقِبْلَةِ وَيُجَافِي بِعَضُدَيْهِ مَا اسْتَطَاعَ فِيمَا رَأَيْتُ ثُمَّ يَرْفَعُ رَأْسَهُ فَيَجْلِسُ عَلَى قَدَمِهِ الْيُسْرَى وَيَنْصِبُ الْيُمْنَى وَيَكْرَهُ أَنْ يَسْقُطَ عَلَى شِقِّهِ الْأَيْسَرِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Haritsah bin Abu Rijal] dari [Amrah] ia berkata, \"Aku bertanya kepada ['Aisyah], \"Bagaimana sholat Rasulullah shallallahu 'alaihi wasallam?\" 'Aisyah menjawab, \"Nabi shallallahu 'alaihi wasallam apabila berwudlu, beliau meletakkan kedua tangannya dalam bejana, membaca basmallah, dan menyempurnakan wudlunya. Lalu beliau berdiri menghadap kiblat, bertakbir dan mengangkat kedua tangannya sejajar dengan kedua bahunya. Beliau rukuk dan meletakkan kedua tangannya di atas kedua lututnya. Kemudian menjauhkan kedua tangannya dari lambung, beliau mengangkat kepalanya hingga punggungnya lurus, dan beliau berdiri lebih lama dari berdirinya kalian. Setelah itu beliau sujud dan meletakkan kedua tangannya menghadap kiblat seraya menjauhkan keduanya dari lambung semampunya sebagaimana yang aku lihat. Setelah itu beliau mengangkat kepalanya dan duduk di atas kaki kiri dan menegakkan kaki kanan, dan beliau tidak suka condong ke sebelah kiri. \" "
            },
            {
                "number": 1020,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَرِيكٌ عَنْ زُبَيْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عُمَرَ قَالَصَلَاةُ السَّفَرِ رَكْعَتَانِ وَالْجُمُعَةُ رَكْعَتَانِ وَالْعِيدُ رَكْعَتَانِ تَمَامٌ غَيْرُ قَصْرٍ عَلَى لِسَانِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Syarik] dari [Zubaid] dari ['Abdurrahman bin Abu Laila] dari [Umar] ia berkata, \"sholat safar itu dua raka'at, jum'at dua raka'at, dan ied dua raka'at, sempurna tanpa meringkas sebagaimana sabda Muhammad shallallahu 'alaihi wasallam. \""
            },
            {
                "number": 1021,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ أَنْبَأَنَا يَزِيدُ بْنُ زِيَادِ بْنِ أَبِي الْجَعْدِ عَنْ زُبَيْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَ عَنْ عُمَرَ قَالَصَلَاةُ السَّفَرِ رَكْعَتَانِ وَصَلَاةُ الْجُمُعَةِ رَكْعَتَانِ وَالْفِطْرُ وَالْأَضْحَى رَكْعَتَانِ تَمَامٌ غَيْرُ قَصْرٍ عَلَى لِسَانِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Muhammad bin Bisyr] berkata, telah memberitakan kepada kami [Yazid bin Ziyad bin Abu Al Ju'd] dari [Zubaid] dari ['Abdurrahman bin Abu Laila] dari [Ka'b bin Ujrah] dari [Umar] ia berkata, \"sholat safar itu dua raka'at, jum'at dua raka'at, idul fitri dan idul adha dua raka'at, sempurna tanpa meringkas sebagaimana sabda Muhammad shallallahu 'alaihi wasallam. \""
            },
            {
                "number": 1022,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ أَبِي عَمَّارٍ عَنْ عَبْدِ اللَّهِ بْنِ بَابَيْهِ عَنْ يَعْلَى بْنِ أُمَيَّةَ قَالَسَأَلْتُ عُمَرَ بْنَ الْخَطَّابِ قُلْتُ لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَقْصُرُوا مِنْ الصَّلَاةِ إِنْ خِفْتُمْ أَنْ يَفْتِنَكُمْ الَّذِينَ كَفَرُوا وَقَدْ أَمِنَ النَّاسُ فَقَالَ عَجِبْتُ مِمَّا عَجِبْتَ مِنْهُ فَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَقَالَ صَدَقَةٌ تَصَدَّقَ اللَّهُ بِهَا عَلَيْكُمْ فَاقْبَلُوا صَدَقَتَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Idris] dari [Ibnu Juraij] dari [Ibnu Abu Ammar] dari [Abdullah bin Babaih] dari [Ya'la bin Umayyah] ia berkata, \"Aku bertanya kepada Umar bin Al Khaththab, aku katakan, \" (maka tidaklah mengapa kamu men-qashar sembahyang (mu), jika kamu takut diserang orang-orang kafir), sekarang bagaimana padahal manusia sudah merasa aman?\" Umar lalu menjawab, \"Aku pernah merasa heran sebagaimana yang engkau alami, kemudian aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang hal itu, beliau menjawab: \"Itu adalah sedekah yang Allah sedekahkan kepada kalian, maka terimalah sedekah tersebut. \""
            },
            {
                "number": 1023,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أُمَيَّةَ بْنِ عَبْدِ اللَّهِ بْنِ خَالِدٍأَنَّهُ قَالَ لِعَبْدِ اللَّهِ بْنِ عُمَرَ إِنَّا نَجِدُ صَلَاةَ الْحَضَرِ وَصَلَاةَ الْخَوْفِ فِي الْقُرْآنِ وَلَا نَجِدُ صَلَاةَ السَّفَرِ فَقَالَ لَهُ عَبْدُ اللَّهِ إِنَّ اللَّهَ بَعَثَ إِلَيْنَا مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا نَعْلَمُ شَيْئًا فَإِنَّمَا نَفْعَلُ كَمَا رَأَيْنَا مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Ibnu Syihab] dari [Abdullah bin Abu Bakr bin 'Abdurrahman] dari [Umayyah bin Abdullah bin Khalid] ia berkata kepada [Abdullah bin Umar], \"Dalam Al Quran kami mendapati ada sholat hadlr dan sholat khauf, tetapi kami tidak mendapatkan sholat safar?\" lalu Abdullah menjawab, \"Allah mengutus Muhammad shallallahu 'alaihi wasallam kepada kami sedang kami tidak mengetahui apa-apa, maka kami melakukan sebagaimana kami melihat Rasulullah shallallahu 'alaihi wasallam melakukannya. \" "
            },
            {
                "number": 1024,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ بِشْرِ بْنِ حَرْبٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَرَجَ مِنْ هَذِهِ الْمَدِينَةِ لَمْ يَزِدْ عَلَى رَكْعَتَيْنِ حَتَّى يَرْجِعَ إِلَيْهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah] berkata, telah memberitakan kepada kami [Hammad bin Zaid] dari [Bisyr bin Harb] dari [Ibnu Umar] ia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam keluar dari kota Madinah, beliau tidak pernah sholat lebih dari dua raka'at hingga beliau kembali. \""
            },
            {
                "number": 1025,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ وَجُبَارَةُ بْنُ الْمُغَلِّسِ قَالَا حَدَّثَنَا أَبُو عَوَانَةَ عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَافْتَرَضَ اللَّهُ الصَّلَاةَ عَلَى لِسَانِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَضَرِ أَرْبَعًا وَفِي السَّفَرِ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhamad bin Abdul Malik bin Abu Asy Syawarib] dan [Jubarah bin Al Mughallas] keduanya berkata; telah menceritakan kepada kami [Abu Awanah] dari [Bukair bin Al Akhnas] dari [Mujahid] dari [Ibnu Abbas] ia berkata, \"Allah telah menetapkan bahwa sholat di saat tidak bepergian sebanyak empat raka'at dan dua raka'at saat perjalanan, melalui lisan Nabi kalian shallallahu 'alaihi wasallam. \""
            },
            {
                "number": 1026,
                "arab": "حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ الْعَدَنِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ إِبْرَاهِيمَ بْنِ إِسْمَعِيلَ عَنْ عَبْدِ الْكَرِيمِ عَنْ مُجَاهِدٍ وَسَعِيدِ بْنِ جُبَيْرٍ وَعَطَاءِ بْنِ أَبِي رَبَاحٍ وَطَاوُسٍ أَخْبَرُوهُ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ أَخْبَرَهُمْأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَجْمَعُ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ فِي السَّفَرِ مِنْ غَيْرِ أَنْ يُعْجِلَهُ شَيْءٌ وَلَا يَطْلُبَهُ عَدُوُّ وَلَا يَخَافَ شَيْئًا",
                "id": "Telah menceritakan kepada kami [Muhriz bin Salamah Al Adani] berkata, telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] dari [Ibrahim bin Isma'il] dari [Abdul Karim] dari [Mujahid] dan [Sa'id bin Jubair] dan ['Atho` bin Abu Rabah] dan [Thawus] mereka mengabarkan kepadanya dari [Ibnu Abbas] bahwasanya mereka mengabarkan, bahwa Rasulullah shallallahu 'alaihi wasallam menjamak sholat maghrib dan isya, bukan karena sakit, atau diburu musuh atau karena takut sesuatu. \""
            },
            {
                "number": 1027,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ أَبِي الطُّفَيْلِ عَنْ مُعَاذِ بْنِ جَبَلٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ بَيْنَ الظُّهْرِ وَالْعَصْرِ وَالْمَغْرِبِ وَالْعِشَاءِ فِي غَزْوَةِ تَبُوكَ فِي السَّفَرِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abu Az Zubair] dari [Abu Ath Thufail] dari [Mu'adz bin Jabal] berkata, \"Nabi shallallahu 'alaihi wasallam menjamak antara zhuhur dan asar, maghrib dan isya dalam perjalanan perang Tabuk. \""
            },
            {
                "number": 1028,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا أَبُو عَامِرٍ عَنْ عِيسَى بْنِ حَفْصِ بْنِ عَاصِمِ بْنِ عُمَرَ بْنِ الْخَطَّابِ حَدَّثَنِي أَبِي قَالَكُنَّا مَعَ ابْنِ عُمَرَ فِي سَفَرٍ فَصَلَّى بِنَا ثُمَّ انْصَرَفْنَا مَعَهُ وَانْصَرَفَ قَالَ فَالْتَفَتَ فَرَأَى أُنَاسًا يُصَلُّونَ فَقَالَ مَا يَصْنَعُ هَؤُلَاءِ قُلْتُ يُسَبِّحُونَ قَالَ لَوْ كُنْتُ مُسَبِّحًا لَأَتْمَمْتُ صَلَاتِي يَا ابْنَ أَخِي إِنِّي صَحِبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَزِدْ عَلَى رَكْعَتَيْنِ فِي السَّفَرِ حَتَّى قَبَضَهُ اللَّهُ ثُمَّ صَحِبْتُ أَبَا بَكْرٍ فَلَمْ يَزِدْ عَلَى رَكْعَتَيْنِ ثُمَّ صَحِبْتُ عُمَرَ فَلَمْ يَزِدْ عَلَى رَكْعَتَيْنِ ثُمَّ صَحِبْتُ عُثْمَانَ فَلَمْ يَزِدْ عَلَى رَكْعَتَيْنِ حَتَّى قَبَضَهُمْ اللَّهُ وَاللَّهُ يَقُولُ{ لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ }",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Khallad Al Bahili] berkata, telah menceritakan kepada kami [Abu Amir] dari [Isa bin Hafsh bin Ashim bin Umar Ibnul Khaththab] berkata, telah menceritakan kepadaku [Bapakku] ia berkata, \"Kami bersama [Ibnu Umar] dalam sebuah perjalanan, lalu ia sholat bersama kami, kemudian kami beranjak pergi bersamanya. \" Ia berkata lagi, \"Ibnu Umar menoleh dan melihat beberapa orang melaksanakan sholat, lalu Ibnu Umar bertanya, \"Apa yang dilakukan oleh orang-orang itu?\" aku menjawab, \"Mereka melaksanakan sholat sunnah. \" Ibnu Umar berkata, \"Wahai putera saudaraku, jika aku melaksanakan sholat sunnah maka akan aku sempurnakan. Aku pernah menemani Rasulullah shallallahu 'alaihi wasallam, dan beliau tidak pernah melebihkan dari dua raka'at ketika safar hingga Allah mewafatkannya. Kemudian aku menemani Abu Bakar, dan ia juga tidak melebihkan dari dua raka'at. Kemudian aku menemani Umar, dan ia juga tidak melebihkan dari dua raka'at. Kemudian aku menemani Utsman, dan ia juga tidak melebihkan dari dua raka'at hingga Allah mewafatkannya. Demi Allah, ia mengatakan, \"Sungguh pada diri Rasulullah shallallahu 'alaihi wasallam ada teladan yang baik. \""
            },
            {
                "number": 1029,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ قَالَ سَأَلْتُ طَاوُسًا عَنْ السُّبْحَةِ فِي السَّفَرِ وَالْحَسَنُ بْنُ مُسْلِمِ بْنِ يَنَّاقٍ جَالِسٌ عِنْدَهُ فَقَالَ حَدَّثَنِي طَاوُسٌ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ يَقُولُفَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْحَضَرِ وَصَلَاةَ السَّفَرِ فَكُنَّا نُصَلِّي فِي الْحَضَرِ قَبْلَهَا وَبَعْدَهَا وَكُنَّا نُصَلِّي فِي السَّفَرِ قَبْلَهَا وَبَعْدَهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Khallad] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Usamah bin Zaid] berkata; aku bertanya kepada Thawus tentang sholat sunah dalam safar -waktu itu [Hasan bin Muslim bin Yannaq] sedang duduk di sisinya-, ia berkata, \"Aku mendengar [Thawus] mengatakan, bahwa ia mendengar [Ibnu Abbas] berkata, \"Rasulullah shallallahu 'alaihi wasallam mewajibkan kami untuk melaksanakan sholat hadlr (sholat dalam kondisi mukim dan tidak dalam perjalanan) dan sholat safar, maka selalu melaksanakan sholat sunah sebelum dan sesudahnya (sholat wajib) baik dalam kondisi mukim atau pun safar. \""
            }
        ]
    }
}