{
    "status": true,
    "data": {
        "start": 1177,
        "end": 1323,
        "total": 147,
        "book": "ibnu-majah",
        "hadits": [
            {
                "number": 1177,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُوسَى التَّيْمِيُّ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ مَوْلَى الْأَسْوَدِ بْنِ سُفْيَانَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ عَنْ أَبِي هُرَيْرَةَ قَالَخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الصَّلَاةِ وَكَبَّرَ ثُمَّ أَشَارَ إِلَيْهِمْ فَمَكَثُوا ثُمَّ انْطَلَقَ فَاغْتَسَلَ وَكَانَ رَأْسُهُ يَقْطُرُ مَاءً فَصَلَّى بِهِمْ فَلَمَّا انْصَرَفَ قَالَ إِنِّي خَرَجْتُ إِلَيْكُمْ جُنُبًا وَإِنِّي نَسِيتُ حَتَّى قُمْتُ فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Humaid bin Kasib] berkata, telah menceritakan kepada kami [Abdullah bin Musa At Taimi] dari [Usamah bin Zaid] dari [Abdullah bin Yazid] mantan budak Al Aswad bin Sufyan, dari [Muhammad bin 'Abdurrahman bin Tsauban] dari [Abu Hurairah] ia berkata, \"Nabi shallallahu 'alaihi wasallam keluar sholat dan takbir, namun beliau memberi isyarat kepada para sahabat agar mereka diam di tempat. Kemudian beliau pergi dan mandi, beliau sholat bersama mereka sementara rambutnya masih basah dengan air. Setelah selesai sholat beliau bersabda: \"Aku keluar kepada kalian dalam keadaan junub, namun aku lupa hingga sholat didirikan. \""
            },
            {
                "number": 1178,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا الْهَيْثَمُ بْنُ خَارِجَةَ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَصَابَهُ قَيْءٌ أَوْ رُعَافٌ أَوْ قَلَسٌ أَوْ مَذْيٌ فَلْيَنْصَرِفْ فَلْيَتَوَضَّأْ ثُمَّ لِيَبْنِ عَلَى صَلَاتِهِ وَهُوَ فِي ذَلِكَ لَا يَتَكَلَّمُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Al Haitsam bin Kharijah] berkata, telah menceritakan kepada kami [Isma'il bin 'Ayyasy] dari [Ibnu Juraij] dari [Ibnu Abu Mulaikah] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa terkena muntah, atau mimisan, atau muntahan atau madzi, hendaknya ia pergi berwudlu. Kemudian tetap melaksanakan sholat dalam kondisi seperti itu, dan tidak berbicara. \" "
            },
            {
                "number": 1179,
                "arab": "حَدَّثَنَا عُمَرُ بْنُ شَبَّةَ بْنِ عَبِيدَةَ بْنِ زَيْدٍ حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ الْمُقَدَّمِيُّ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ فَأَحْدَثَ فَلْيُمْسِكْ عَلَى أَنْفِهِ ثُمَّ لِيَنْصَرِفْحَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنَا عُمَرُ بْنُ قَيْسٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Umar bin Syabbah bin 'Abidah bin Zaid] berkata, telah menceritakan kepada kami [Umar bin 'Ali Al Muqaddami] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika salah seorang dari kalian sholat kemudian berhadats, maka hendaklah ia pegang hidungnya dan pergi. \" Telah menceritakan kepada kami [Harmalah bin Yahya] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah menceritakan kepada kami [Umar bin Qais] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits. \" "
            },
            {
                "number": 1180,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ ابْنِ بُرَيْدَةَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَكَانَ بِيَ النَّاصُورُ فَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّلَاةِ فَقَالَ صَلِّ قَائِمًا فَإِنْ لَمْ تَسْتَطِعْ فَقَاعِدًا فَإِنْ لَمْ تَسْتَطِعْ فَعَلَى جَنْبٍ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Ibrahim bin Thahman] dari [Husain Al Mu'allim] dari [Ibnu Buraidah] dari [Imran bin Hushain] berkata, \"Aku mengalami sakit wasir, maka aku bertanya kepada Nabi shallallahu 'alaihi wasallam tentang pelaksanaan sholat, beliau bersabda: \"sholatlah dengan berdiri, jika tidak mampu hendaklah dengan duduk, jika tidak mampu hendaklah dengan berbaring. \""
            },
            {
                "number": 1181,
                "arab": "حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ الْوَاسِطِيُّ حَدَّثَنَا إِسْحَقُ الْأَزْرَقُ عَنْ سُفْيَانَ عَنْ جَابِرٍ عَنْ أَبِي حَرِيزٍ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى جَالِسًا عَلَى يَمِينِهِ وَهُوَ وَجِعٌ",
                "id": "Telah menceritakan kepada kami [Abdul Hamid bin Bayan Al Wasithi] berkata, telah menceritakan kepada kami [Ishaq Al Azraq] dari [Sufyan] dari [Jabir] dari [Abu Hariz] dari [Wa`il bin Hujr] ia berkata, \"Aku melihat Nabi shallallahu 'alaihi wasallam sholat sambil duduk pada bagian sebelah kanan ketika sakit. \" "
            },
            {
                "number": 1182,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْوَالَّذِي ذَهَبَ بِنَفْسِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مَاتَ حَتَّى كَانَ أَكْثَرُ صَلَاتِهِ وَهُوَ جَالِسٌ وَكَانَ أَحَبُّ الْأَعْمَالِ إِلَيْهِ الْعَمَلَ الصَّالِحَ الَّذِي يَدُومُ عَلَيْهِ الْعَبْدُ وَإِنْ كَانَ يَسِيرًا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Al Ahwash] dari [Abu Ishaq] dari [Abu Salamah] dari [Ummu Salamah] ia berkata, \"Demi Dzat yang mencabut jiwa shallallahu 'alaihi wasallam, beliau tidak meninggal hingga kebanyakan sholat yang beliau lakukan adalah dengan duduk, dan amalan yang paling beliau sukai adalah amal shalih yang dikerjakan secara rutin oleh seorang hamba meskipun sepele. \""
            },
            {
                "number": 1183,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ الْوَلِيدِ بْنِ أَبِي هِشَامٍ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ وَهُوَ قَاعِدٌ فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ قَدْرَ مَا يَقْرَأُ إِنْسَانٌ أَرْبَعِينَ آيَةً",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Isma'il bin Ulayyah] dari [Al Walid bin Abu Hisyam] dari [Abu Bakr bin Muhammad] dari [Amrah] dari ['Aisyah] ia berkata, \"Nabi shallallahu 'alaihi wasallam membaca dalam kondisi duduk, maka ketika akan rukuk beliau berdiri sekadar orang membaca empat puluh ayat. \""
            },
            {
                "number": 1184,
                "arab": "حَدَّثَنَا أَبُو مَرْوَانَ الْعُثْمَانِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي شَيْءٍ مِنْ صَلَاةِ اللَّيْلِ إِلَّا قَائِمًا حَتَّى دَخَلَ فِي السِّنِّ فَجَعَلَ يُصَلِّي جَالِسًا حَتَّى إِذَا بَقِيَ عَلَيْهِ مِنْ قِرَاءَتِهِ أَرْبَعُونَ آيَةً أَوْ ثَلَاثُونَ آيَةً قَامَ فَقَرَأَهَا وَسَجَدَ",
                "id": "Telah menceritakan kepada kami [Abu Marwan Al Utsmani] berkata, telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] dari [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] ia berkata, \"Aku tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam sholat di malam hari kecuali dengan berdiri, hingga ketika telah tua beliau sholat dengan duduk. Maka ketika bacaan beliau masih tersisa antara empat puluh atau tiga puluh ayat, beliau berdiri dan membacanya dengan berdiri lalu sujud. \""
            },
            {
                "number": 1185,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ عَنْ حُمَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ الْعُقَيْلِيِّ قَالَسَأَلْتُ عَائِشَةَ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ فَقَالَتْ كَانَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا وَلَيْلًا طَوِيلًا قَاعِدًا فَإِذَا قَرَأَ قَائِمًا رَكَعَ قَائِمًا وَإِذَا قَرَأَ قَاعِدًا رَكَعَ قَاعِدًا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Mu'adz bin Mu'adz] dari [Humaid] dari [Abdullah bin Syaqiq Al Uqaili] berkata; Aku bertanya kepada ['Aisyah] tentang sholatnya Rasulullah shallallahu 'alaihi wasallam di waktu malam, maka ia pun menjawab, \"Beliau kadang sholat malam yang panjang dengan berdiri, dan kadang sholat malam yang panjang dengan duduk. Jika beliau membaca dengan berdiri maka beliau rukuk dengan berdiri, dan jika beliau membaca dengan duduk maka beliau rukuk dengan duduk. \""
            },
            {
                "number": 1186,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا قُطْبَةُ عَنْ الْأَعْمَشِ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ بَابَاهُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ وَهُوَ يُصَلِّي جَالِسًا فَقَالَ صَلَاةُ الْجَالِسِ عَلَى النِّصْفِ مِنْ صَلَاةِ الْقَائِمِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yahya bin Adam] berkata, telah menceritakan kepada kami [Quthbah] dari [Al A'masy] dari [Habib bin Abu Tsabit] dari [Abdullah bin Babah] dari [Abdullah bin Amru] bahwa Nabi shallallahu 'alaihi wasallam pernah melewatinya, sedangkan waktu itu ia sholat dengan duduk. Maka beliau bersabda: \"sholat dengan duduk pahalanya separuh dari orang yang sholat dengan berdiri. \""
            },
            {
                "number": 1187,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا بِشْرُ بْنُ عُمَرَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ حَدَّثَنِي إِسْمَعِيلُ بْنُ مُحَمَّدِ بْنِ سَعْدٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فَرَأَى أُنَاسًا يُصَلُّونَ قُعُودًا فَقَالَ صَلَاةُ الْقَاعِدِ عَلَى النِّصْفِ مِنْ صَلَاةِ الْقَائِمِ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Bisyr bin Umar] berkata, telah menceritakan kepada kami [Abdullah bin Ja'far] berkata, telah menceritakan kepadaku [Isma'il bin Muhammad bin Sa'd] dari [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam keluar dan melihat manusia sholat dengan duduk, maka beliau pun bersabda: \"sholat dengan duduk pahalanya separuh dari orang yang sholat dengan berdiri. \""
            },
            {
                "number": 1188,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الصَّوَّافُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّهُسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرَّجُلِ يُصَلِّي قَاعِدًا قَالَ مَنْ صَلَّى قَائِمًا فَهُوَ أَفْضَلُ وَمَنْ صَلَّى قَاعِدًا فَلَهُ نِصْفُ أَجْرِ الْقَائِمِ وَمَنْ صَلَّى نَائِمًا فَلَهُ نِصْفُ أَجْرِ الْقَاعِدِ",
                "id": "Telah menceritakan kepada kami [Bisyr bin Hilal Ash Shawwaf] berkata, telah menceritakan kepada kami [Yazid bin Zurai'] dari [Husain Al Mu'allim] dari [Abdullah bin Buraid] dari [Imran bin Hushain] Bahwasanya ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang seorang laki-laki yang sholat dengan duduk, beliau bersabda: \"Barangsiapa sholat dengan berdiri maka itu lebih utama, dan barangsiapa sholat dengan duduk maka ia akan mendapatkan setengah dari pahala orang yang sholat dengan berdiri. Dan barangsiapa sholat dengan berbaring maka ia akan mendapatkan setengah dari pahala orang yang sholat dengan duduk. \""
            },
            {
                "number": 1189,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ وَوَكِيعٌ عَنْ الْأَعْمَشِ ح و حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْلَمَّا مَرِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَضَهُ الَّذِي مَاتَ فِيهِ وَقَالَ أَبُو مُعَاوِيَةَ لَمَّا ثَقُلَ جَاءَ بِلَالٌ يُؤْذِنُهُ بِالصَّلَاةِ فَقَالَ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ قُلْنَا يَا رَسُولَ اللَّهِ إِنَّ أَبَا بَكْرٍ رَجُلٌ أَسِيفٌ تَعْنِي رَقِيقٌ وَمَتَى مَا يَقُومُ مَقَامَكَ يَبْكِي فَلَا يَسْتَطِيعُ فَلَوْ أَمَرْتَ عُمَرَ فَصَلَّى بِالنَّاسِ فَقَالَ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ فَإِنَّكُنَّ صَوَاحِبَاتُ يُوسُفَ قَالَتْ فَأَرْسَلْنَا إِلَى أَبِي بَكْرٍ فَصَلَّى بِالنَّاسِ فَوَجَدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ نَفْسِهِ خِفَّةً فَخَرَجَ إِلَى الصَّلَاةِ يُهَادَى بَيْنَ رَجُلَيْنِ وَرِجْلَاهُ تَخُطَّانِ فِي الْأَرْضِ فَلَمَّا أَحَسَّ بِهِ أَبُو بَكْرٍ ذَهَبَ لِيَتَأَخَّرَ فَأَوْمَى إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ مَكَانَكَ قَالَ فَجَاءَ حَتَّى أَجْلَسَاهُ إِلَى جَنْبِ أَبِي بَكْرٍ فَكَانَ أَبُو بَكْرٍ يَأْتَمُّ بِالنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ يَأْتَمُّونَ بِأَبِي بَكْرٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dan [Waki'] dari [Al A'masy]. (dalam jalur lain disebutkan); Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah] ia berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam sakit yang membawanya kepada kematian, Abu Mu'awiyah berkata, \"Ketika sakit beliau semakin parah, Bilal datang kepada beliau memberitahukan datangnya waktu sholat, maka beliau bersabda: \"Suruhlah Abu Bakar, dan perintahkan kepadanya agar sholat bersama orang-orang. \" Kami berkata, \"Wahai Rasulullah, Abu Bakar itu seorang laki-laki yang hatinya sangat lembut, jika ia menggantikanmu maka ia pasti menangis, bagaimana jika Umar saja yang engkau perintahkan untuk sholat bersama orang-orang?\" beliau bersabda: \"Suruhlah Abu Bakar, dan perintahkan kepadanya agar sholat bersama orang-orang. Sesungguhnya kalian (isteri-isteri nabi) seperti sahabat Yusuf, \" 'Aisyah berkata, \"Lalu kami mengutus seseorang kepada Abu Bakar hingga ia pun sholat bersama manusia. Rasulullah shallallahu 'alaihi wasallam kemudian mendapatkan sedikit kesegaran pada tubuhnya, beliau keluar untuk sholat dengan dipapah oleh dua orang, sementara kedua kaki beliau berjalan di atas tanah. Ketika Abu bakar merasakan kehadiran beliau, maka ia berniat mundur ke belakang. Namun Nabi shallallahu 'alaihi wasallam memberi isyarat agar ia tetap sholat pada tempatnya. \" Abu Mu'awiyah berkata, \"Beliau pun datang, dan beliau didudukkan di sisi Abu Bakar. Abu Bakar bermakmum kepada Nabi shallallahu 'alaihi wasallam, sementara orang-orang bermakmum kepada Abu Bakar. \""
            },
            {
                "number": 1190,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَا بَكْرٍ أَنْ يُصَلِّيَ بِالنَّاسِ فِي مَرَضِهِ فَكَانَ يُصَلِّي بِهِمْ فَوَجَدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خِفَّةً فَخَرَجَ وَإِذَا أَبُو بَكْرٍ يَؤُمُّ النَّاسَ فَلَمَّا رَآهُ أَبُو بَكْرٍ اسْتَأْخَرَ فَأَشَارَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْ كَمَا أَنْتَ فَجَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِذَاءَ أَبِي بَكْرٍ إِلَى جَنْبِهِ فَكَانَ أَبُو بَكْرٍ يُصَلِّي بِصَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ يُصَلُّونَ بِصَلَاةِ أَبِي بَكْرٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Numair] dari [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] ia berkata, \"Di saat sakitnya, Rasulullah shallallahu 'alaihi wasallam memerintahkan Abu Bakar untuk sholat bersama manusia. Abu Bakar pun sholat bersama mereka, ketika Rasulullah shallallahu 'alaihi wasallam mendapatkan kekuatan pada tubuhnya beliau keluar untuk sholat, sementara Abu Bakar sedang mengimami manusia. Maka tatkala Abu Bakar melihat kehadiran beliau, ia berniat mundur ke belakang, namun Rasulullah shallallahu 'alaihi wasallam memberi isyarat agar ia tetap di tempatnya. Rasulullah shallallahu 'alaihi wasallam kemudian duduk di sisi Abu Bakar, Abu Bakar mengikuti sholat Rasulullah shallallahu 'alaihi wasallam sementara orang-orang mengikuti sholat Abu Bakar. \""
            },
            {
                "number": 1191,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ مِنْ كِتَابِهِ فِي بَيْتِهِ قَالَ سَلَمَةُ بْنُ نُبَيْطٍ أَنْبَأَنَا عَنْ نُعَيْمِ بْنِ أَبِي هِنْدٍ عَنْ نُبَيْطِ بْنِ شَرِيطٍ عَنْ سَالِمِ بْنِ عُبَيْدٍ قَالَأُغْمِيَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَرَضِهِ ثُمَّ أَفَاقَ فَقَالَ أَحَضَرَتْ الصَّلَاةُ قَالُوا نَعَمْ قَالَ مُرُوا بِلَالًا فَلْيُؤَذِّنْ وَمُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ ثُمَّ أُغْمِيَ عَلَيْهِ فَأَفَاقَ فَقَالَ أَحَضَرَتْ الصَّلَاةُ قَالُوا نَعَمْ قَالَ مُرُوا بِلَالًا فَلْيُؤَذِّنْ وَمُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ ثُمَّ أُغْمِيَ عَلَيْهِ فَأَفَاقَ فَقَالَ أَحَضَرَتْ الصَّلَاةُ قَالُوا نَعَمْ قَالَ مُرُوا بِلَالًا فَلْيُؤَذِّنْ وَمُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ فَقَالَتْ عَائِشَةُ إِنَّ أَبِي رَجُلٌ أَسِيفٌ إِذَا قَامَ ذَلِكَ الْمَقَامَ يَبْكِي لَا يَسْتَطِيعُ فَلَوْ أَمَرْتَ غَيْرَهُ ثُمَّ أُغْمِيَ عَلَيْهِ فَأَفَاقَ فَقَالَ مُرُوا بِلَالًا فَلْيُؤَذِّنْ وَمُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ فَإِنَّكُنَّ صَوَاحِبُ يُوسُفَ أَوْ صَوَاحِبَاتُ يُوسُفَ قَالَ فَأُمِرَ بِلَالٌ فَأَذَّنَ وَأُمِرَ أَبُو بَكْرٍ فَصَلَّى بِالنَّاسِ ثُمَّ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَدَ خِفَّةً فَقَالَ انْظُرُوا لِي مَنْ أَتَّكِئُ عَلَيْهِ فَجَاءَتْ بَرِيرَةُ وَرَجُلٌ آخَرُ فَاتَّكَأَ عَلَيْهِمَا فَلَمَّا رَآهُ أَبُو بَكْرٍ ذَهَبَ لِيَنْكِصَ فَأَوْمَأَ إِلَيْهِ أَنْ اثْبُتْ مَكَانَكَ ثُمَّ جَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى جَلَسَ إِلَى جَنْبِ أَبِي بَكْرٍ حَتَّى قَضَى أَبُو بَكْرٍ صَلَاتَهُ ثُمَّ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُبِضَقَالَ أَبُو عَبْد اللَّهِ هَذَا حَدِيثٌ غَرِيبٌ لَمْ يُحَدِّثْ بِهِ غَيْرُ نَصْرِ بْنِ عَلِيٍّ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah memberitakan kepada kami [Abdullah bin Dawud] -dalam kitabnya yang ada di rumahnya- berkata, telah memberitakan kepada kami [Salamah bin Nubaith] dari [Nu'aim bin Abu Hindun] dari [Nubaith bin Syarith] dari [Salim bin Ubaid] ia berkata, \"Di saat sakit Rasulullah shallallahu 'alaihi wasallam pingsan kemudian tersadar, beliau bertanya: \"Apakah waktu sholat sudah masuk?\" Para sahabat menjawab, \"Sudah, \" beliau bersabda: \"Perintahkanlah Bilal mengumandangkan adzan, dan perintahkan Abu Bakar agar mengimami orang-orang. \" Kemudian beliau pingsan dan sadar kembali, beliau lalu bertanya: \"Apakah waktu sholat sudah masuk?\" para sahabat menjawab: \"Sudah, \" beliau bersabda: \"Perintahkanlah Bilal mengumandangkan adzan, dan perintahkan Abu Bakar agar mengimami orang-orang. \" Kemudian beliau pingsan dan sadar kembali, beliau lalu bertanya: \"Apakah waktu sholat sudah masuk?\" para sahabat menjawab: \"Sudah, \" beliau bersabda: \"Perintahkanlah Bilal mengumandangkan adzan, dan perintahkan Abu Bakar agar mengimami orang-orang. \" 'Aisyah lalu berkata, \"Sesungguhnya ayahku adalah seorang lelaki yang lembut hatinya, jika dia menempati kedudukan itu, dia akan menangis dan tidak mampu (membaca), cobalah engkau perintahkan yang lain\". Kemudian beliau pingsan dan tersadar, beliau bersabda: \"Perintahkanlah Bilal mengumandangkan adzan, dan perintahkan Abu Bakar untuk mengimami orang-orang. Sesungguhnya kalian adalah sahabat-sahabat Yusuf atau sahabat-sahabat perempuan Yusuf. \" Salim bin Ubaid berkata, \"Bilal pun diperintahkan hingga ia adzan, dan Abu Bakar juga diperintahkan hingga ia pun mengimami orang-orang. Setelah itu Rasulullah shallallahu 'alaihi wasallam merasa lebih baik, beliau bersabda: \"Lihatlah aku, siapa yang bisa aku jadikan sebagai sandaran?\" Lalu datanglah Barirah dan seorang laki-laki lain, kemudian beliau bersandar kepada keduanya. Tatkala Abu Bakar melihatnya, dia bergeser ke belakang, tetapi beliau memberi isyarat kepadanya; tetaplah di tempatmu. \" Kemudian Rasulullah shallallahu 'alaihi wasallam datang dan duduk di samping Abu Bakar, hingga Abu Bakar menyelesaikan sholatnya. Setelah itu Rasulullah shallallahu 'alaihi wasallam wafat. \" Abu Abdullah berkata: \"Hadits ini gharib, dan tidak ada yang meriwayatkannya selain Nasr bin Ali. \""
            },
            {
                "number": 1192,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ الْأَرْقَمِ بْنِ شُرَحْبِيلَ عَنْ ابْنِ عَبَّاسٍ قَالَلَمَّا مَرِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَضَهُ الَّذِي مَاتَ فِيهِ كَانَ فِي بَيْتِ عَائِشَةَ فَقَالَ ادْعُوا لِي عَلِيًّا قَالَتْ عَائِشَةُ يَا رَسُولَ اللَّهِ نَدْعُو لَكَ أَبَا بَكْرٍ قَالَ ادْعُوهُ قَالَتْ حَفْصَةُ يَا رَسُولَ اللَّهِ نَدْعُو لَكَ عُمَرَ قَالَ ادْعُوهُ قَالَتْ أُمُّ الْفَضْلِ يَا رَسُولَ اللَّهِ نَدْعُو لَكَ الْعَبَّاسَ قَالَ نَعَمْ فَلَمَّا اجْتَمَعُوا رَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأْسَهُ فَنَظَرَ فَسَكَتَ فَقَالَ عُمَرُ قُومُوا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ جَاءَ بِلَالٌ يُؤْذِنُهُ بِالصَّلَاةِ فَقَالَ مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ فَقَالَتْ عَائِشَةُ يَا رَسُولَ اللَّهِ إِنَّ أَبَا بَكْرٍ رَجُلٌ رَقِيقٌ حَصِرٌ وَمَتَى لَا يَرَاكَ يَبْكِي وَالنَّاسُ يَبْكُونَ فَلَوْ أَمَرْتَ عُمَرَ يُصَلِّي بِالنَّاسِ فَخَرَجَ أَبُو بَكْرٍ فَصَلَّى بِالنَّاسِ فَوَجَدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَفْسِهِ خِفَّةً فَخَرَجَ يُهَادَى بَيْنَ رَجُلَيْنِ وَرِجْلَاهُ تَخُطَّانِ فِي الْأَرْضِ فَلَمَّا رَآهُ النَّاسُ سَبَّحُوا بِأَبِي بَكْرٍ فَذَهَبَ لِيَسْتَأْخِرَ فَأَوْمَأَ إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْ مَكَانَكَ فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَلَسَ عَنْ يَمِينِهِ وَقَامَ أَبُو بَكْرٍ فَكَانَ أَبُو بَكْرٍ يَأْتَمُّ بِالنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ يَأْتَمُّونَ بِأَبِي بَكْرٍ قَالَ ابْنُ عَبَّاسٍ وَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْقِرَاءَةِ مِنْ حَيْثُ كَانَ بَلَغَ أَبُو بَكْرٍقَالَ وَكِيعٌ وَكَذَا السُّنَّةُ قَالَ فَمَاتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَرَضِهِ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dari [Isra'il] dari [Abu Ishaq] dari [Al Arqam Abu Isa Syurahbil] dari [Ibnu Abbas] ia berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam sakit yang membawanya pada kematian, beliau sedang berada di rumah 'Aisyah. Beliau bersabda, \"Panggillah Ali untuk menghadapku, \" 'Aisyah berkata, \"Wahai Rasulullah, bagaimana jika kami panggilkan Abu Bakar?\" beliau menjawab: \"Panggilkan dia. \" Hafshah berkata, \"Wahai Rasulullah, bagaimana jika kami panggilkan Umar?\" \"Panggilkan dia. \" Ummu Al Fadll berkata, \"Wahai Rasulullah, bagaimana jika kami panggilkan Al Abbas?\" beliau menjawab: \"Ya. \" Maka ketika semuanya telah berkumpul, Rasulullah shallallahu 'alaihi wasallam mengangkat kepalanya. Beliau memandangi mereka lalu diam. Umar pun berkata, \"Berdirilah kalian semua untuk Rasulullah shallallahu 'alaihi wasallam. \" Kemudian Bilal datang memberitahukan Rasulullah bahwa waktu sholat telah tiba. Beliau lalu bersabda: \"Perintahkanlah Abu Bakar untuk mengimami orang-orang sholat, \" 'Aisyah berkata, \"Wahai Rasulullah, sesungguhnya Abu Bakar seorang laki-laki yang hatinya lemah dan tidak akan sanggup membaca (ayat Al Qur`an), ia selalu menangis jika melihatmu hingga orang-orang ikut menangis. Bagaimana jika Umar saja yang menjadi Imam sholat bagi orang-orang?\" Lalu Abu Bakar keluar dan sholat bersama manusia, sementara Rasulullah shallallahu 'alaihi wasallam juga mendapatkan kesegaran pada tubuhnya hingga beliau pun keluar sholat dengan dipapah oleh dua orang laki-laki, sedangkan kedua kaki beliau berjalan di atas tanah. Ketika orang-orang melihat kehadiran Rasulullah, mereka mengucapkan tasbih untuk (mengingatkan) Abu Bakar, hingga ia pun mundur ke belakang. Akan tetapi Nabi shallallahu 'alaihi wasallam justru berisyarat agar ia tetap di tempatnya. Rasulullah shallallahu 'alaihi wasallam kemudian datang dan duduk di sisi kanannya, Abu Bakar berdiri. Abu Bakar mengikuti berimam kepada Nabi shallallahu 'alaihi wasallam, dan orang-orang berimam kepada Abu Bakar. \" Ibnu Abbas berkata, \"Nabi shallallahu 'alaihi wasallam membaca ayat terakhir yang dibaca oleh Abu Bakar. \" Waki' berkata, \"Seperti inilah sunnah. \" Ibnu Abbas berkata, \"Lalu Rasulullah shallallahu 'alaihi wasallam wafat di saat sakitnya itu. \""
            },
            {
                "number": 1193,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ حُمَيْدٍ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ عَنْ حَمْزَةَ بْنِ الْمُغِيرَةِ بْنِ شُعْبَةَ عَنْ أَبِيهِقَالَ تَخَلَّفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْتَهَيْنَا إِلَى الْقَوْمِ وَقَدْ صَلَّى بِهِمْ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ رَكْعَةً فَلَمَّا أَحَسَّ بِالنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَهَبَ يَتَأَخَّرُ فَأَوْمَأَ إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتِمَّ الصَّلَاةَ قَالَ وَقَدْ أَحْسَنْتَ كَذَلِكَ فَافْعَلْ",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] berkata, telah menceritakan kepada kami [Ibnu Abu Adi] dari [Humaid] dari [Bukair bin Abdullah] dari [Hamzah Ibnul Mughirah bin Syu'bah] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam datang terlambat hingga kami pun terlambat datang pada orang-orang, sementara mereka telah sholat satu raka'at bersama 'Abdurrahman bin Auf. Maka ketika 'Abdurrahman bin Auf merasakan kehadiran Nabi shallallahu 'alaihi wasallam ia mundur ke belakang, namun Nabi shallallahu 'alaihi wasallam berisyarat agar ia menyempurnakan sholatnya. Beliau bersabda: \"Engkau sudah tepat, lakukanlah seperti itu. \""
            },
            {
                "number": 1194,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْاشْتَكَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَخَلَ عَلَيْهِ نَاسٌ مِنْ أَصْحَابِهِ يَعُودُونَهُ فَصَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسًا فَصَلَّوْا بِصَلَاتِهِ قِيَامًا فَأَشَارَ إِلَيْهِمْ أَنْ اجْلِسُوا فَلَمَّا انْصَرَفَ قَالَ إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَارْفَعُوا وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam merasakan sakit, lalu para sahabat masuk mengunjunginya. Nabi shallallahu 'alaihi wasallam sholat dengan duduk sedangkan para sahabat sholat mengikuti beliau dengan berdiri, hingga beliau pun berisyarat kepada mereka agar sholat dengan duduk. Ketika selesai beliau bersabda: \"Hanyasanya dijadikannya imam agar diikuti, jika ia rukuk maka rukuklah, jika ia mengangkat kepala maka angkatlah dan jika ia sholat dengan duduk maka sholatlah dengan duduk. \""
            },
            {
                "number": 1195,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صُرِعَ عَنْ فَرَسٍ فَجُحِشَ شِقُّهُ الْأَيْمَنُ فَدَخَلْنَا نَعُودُهُ وَحَضَرَتْ الصَّلَاةُ فَصَلَّى بِنَا قَاعِدًا وَصَلَّيْنَا وَرَاءَهُ قُعُودًا فَلَمَّا قَضَى الصَّلَاةَ قَالَ إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ وَإِذَا سَجَدَ فَاسْجُدُوا وَإِذَا صَلَّى قَاعِدًا فَصَلُّوا قُعُودًا أَجْمَعِينَ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam jatuh dari atas kuda hingga tubuh bagian kanannya terluka. Kami mengunjunginya, lalu waktu pun sholat tiba. Beliau sholat bersama kami dengan duduk, dan kami juga sholat di belakangnya dengan duduk. Beliau bersabda: \"Hanyasanya dijadikannya imam agar diikuti, jika ia takbir maka takbirlah, jika ia rukuk maka rukuklah, dan jika ia mengucapkan; SAMI'A ALLAHU LIMAN HAMIDAHU maka ucapkanlah; RABBANA LAKAL HAMDU. Jika ia sujud maka sujudlah, dan jika ia sholat dengan duduk maka sholatlah dengan duduk. \""
            },
            {
                "number": 1196,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا هُشَيْمُ بْنُ بَشِيرٍ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ وَإِنْ صَلَّى قَائِمًا فَصَلُّوا قِيَامًا وَإِنْ صَلَّى قَاعِدًا فَصَلُّوا قُعُودًا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Husyaim bin Basyir] dari [Umar bin Abu Salamah] dari [Bapaknya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hanyasanya dijadikannya imam agar diikuti, jika ia takbir maka takbirlah, jika ia rukuk maka rukuklah, dan jika ia mengucapkan; SAMI'A ALLAHU LIMAN HAMIDAHU maka ucapkanlah; RABBANA WA LAKAL HAMDU. Jika sholat dengan berdiri maka sholatlah dengan berdiri, dan jika sholat dengan duduk maka sholatlah dengan duduk. \" "
            },
            {
                "number": 1197,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ الْمِصْرِيُّ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَاشْتَكَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّيْنَا وَرَاءَهُ وَهُوَ قَاعِدٌ وَأَبُو بَكْرٍ يُكَبِّرُ يُسْمِعُ النَّاسَ تَكْبِيرَهُ فَالْتَفَتَ إِلَيْنَا فَرَآنَا قِيَامًا فَأَشَارَ إِلَيْنَا فَقَعَدْنَا فَصَلَّيْنَا بِصَلَاتِهِ قُعُودًا فَلَمَّا سَلَّمَ قَالَ إِنْ كِدْتُمْ أَنْ تَفْعَلُوا فِعْلَ فَارِسَ وَالرُّومِ يَقُومُونَ عَلَى مُلُوكِهِمْ وَهُمْ قُعُودٌ فَلَا تَفْعَلُوا ائْتَمُّوا بِأَئِمَّتِكُمْ إِنْ صَلَّى قَائِمًا فَصَلُّوا قِيَامًا وَإِنْ صَلَّى قَاعِدًا فَصَلُّوا قُعُودًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh Al Mishri] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Abu Az Zubair] dari [Jabir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengeluh sakit, kami pun sholat di belakangnya sementara beliau sholat dengan duduk. Kemudian Abu Bakar bertakbir dengan takbir Rasulullah agar manusia dapat mendengarnya, beliau berpaling ke arah kami hingga beliau melihat kami sedang sholat dengan berdiri, beliau lalu berisyarat (agar kami sholat dengan duduk), maka kami pun sholat dengan duduk mengikuti beliau. Selesai salam beliau bersabda: \"Janganlah kalian mengikuti perbuatan orang-orang Faris dan Rum, mereka berdiri sementara raja-raja mereka duduk. Ikutilah imam-imam kalian, jika ia sholat dengan berdiri maka sholatlah dengan berdiri, dan jika ia sholat dengan duduk maka sholatlah dengan duduk. \""
            },
            {
                "number": 1198,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ وَحَفْصُ بْنُ غِيَاثٍ وَيَزِيدُ بْنُ هَارُونَ عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ سَعْدِ بْنِ طَارِقٍ قَالَقُلْتُ لِأَبِي يَا أَبَتِ إِنَّكَ قَدْ صَلَّيْتَ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ وَعَلِيٍّ هَاهُنَا بِالْكُوفَةِ نَحْوًا مِنْ خَمْسِ سِنِينَ فَكَانُوا يَقْنُتُونَ فِي الْفَجْرِ فَقَالَ أَيْ بُنَيَّ مُحْدَثٌ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Idris] dan [Hafsh bin Ghiyats] dan [Yazid bin Harun] dari [Abu Malik Al Asyja'i Sa'd bin Thariq] berkata; Aku berkata kepada [bapakku], \"Wahai bapakku, engkau pernah sholat di belakang Rasulullah shallallahu 'alaihi wasallam, Abu Bakar, Umar, Utsman dan Ali di Kufah ini selama lima puluh tahun, apakah mereka melakukan qunut pada waktu sholat subuh?\" ia menjawab, \"Wahai putraku, itu adalah perkara baru. \""
            },
            {
                "number": 1199,
                "arab": "حَدَّثَنَا حَاتِمُ بْنُ بَكْرٍ الضَّبِّيُّ حَدَّثَنَا مُحَمَّدُ بْنُ يَعْلَى زُنْبُورٌ حَدَّثَنَا عَنْبَسَةُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ نَافِعٍ عَنْ أَبِيهِ عَنْ أُمِّ سَلَمَةَ قَالَتْنُهِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْقُنُوتِ فِي الْفَجْرِ",
                "id": "Telah menceritakan kepada kami [Hatim bin Bakr Adl Dlabbi] berkata, telah menceritakan kepada kami [Muhammad bin Ya'la Zunbur] berkata, telah menceritakan kepada kami ['Anbasah bin 'Abdurrahman] dari [Abdullah bin Nafi'] dari [Bapaknya] dari [Ummu Salamah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam dilarang untuk melakukan qunut dalam sholat subuh. \" "
            },
            {
                "number": 1200,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْنُتُ فِي صَلَاةِ الصُّبْحِ يَدْعُو عَلَى حَيٍّ مِنْ أَحْيَاءِ الْعَرَبِ شَهْرًا ثُمَّ تَرَكَ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Yazid bin Zurai'] berkata, telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam melakukan qunut dalam sholat subuh mendo`akan salah satu suku arab selama sebulan, kemudian meninggalkannya. \""
            },
            {
                "number": 1201,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَلَمَّا رَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأْسَهُ مِنْ صَلَاةِ الصُّبْحِ قَالَ اللَّهُمَّ أَنْجِ الْوَلِيدَ بْنَ الْوَلِيدِ وَسَلَمَةَ بْنَ هِشَامٍ وَعَيَّاشَ بْنَ أَبِي رَبِيعَةَ وَالْمُسْتَضْعَفِينَ بِمَكَّةَ اللَّهُمَّ اشْدُدْ وَطْأَتَكَ عَلَى مُضَرَ وَاجْعَلْهَا عَلَيْهِمْ سِنِينَ كَسِنِي يُوسُفَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Sa'id Ibnul Musayyab] dari [Abu Hurairah] ia berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam mengangkat kepalanya dalam sholat subuh, beliau mengucapkan: \"Ya Allah, selamatkanlah Al Walid Ibnul Walid, Salamah bin Hisyam, Ayyasy bin Abu Rabi'ah dan orang-orang lemah yang berada di Makkah. Ya Allah, keraskanlah hukuman-Mu kepada Mudlar dan jadikanlah untuk mereka paceklik sebagaimana paceklik yang terjadi di masa Yusuf. \""
            },
            {
                "number": 1202,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الصَّبَّاحِ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مَعْمَرٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ ضَمْضَمِ بْنِ جَوْسٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْأَسْوَدَيْنِ فِي الصَّلَاةِ الْعَقْرَبِ وَالْحَيَّةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Muhammad bin Ash Shahhab] keduanya berkata; telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ma'mar] dari [Yahya bin Abu Katsir] dari [Dlamdlam bin Jaus] dari [Abu Hurairah] berkata, \"Nabi shallallahu 'alaihi wasallam memerintahkan untuk membunuh al aswadain dalam sholat; yakni kalajengking dan ular. \""
            },
            {
                "number": 1203,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ الْأَوْدِيُّ وَالْعَبَّاسُ بْنُ جَعْفَرٍ قَالَا حَدَّثَنَا عَلِيُّ بْنُ ثَابِتٍ الدَّهَّانُ حَدَّثَنَا الْحَكَمُ بْنُ عَبْدِ الْمَلِكِ عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عَائِشَةَ قَالَتْلَدَغَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَقْرَبٌ وَهُوَ فِي الصَّلَاةِ فَقَالَ لَعَنَ اللَّهُ الْعَقْرَبَ مَا تَدَعُ الْمُصَلِّيَ وَغَيْرَ الْمُصَلِّي اقْتُلُوهَا فِي الْحِلِّ وَالْحَرَمِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Utsman bin Hakim Al Audi] dan [Al Abbas bin Ja'far] keduanya berkata; telah menceritakan kepada kami [Ali bin Tsabit Ad Dahhan] berkata, telah menceritakan kepada kami [Al Hakam bin Abdul Malik] dari [Qatadah] dari [Sa'id Ibnul Musayyab] dari ['Aisyah] ia berkata, \"Ketika dalam keadaan sholat seekor kalajengking menyengat Nabi shallallahu 'alaihi wasallam, lalu beliau bersabda: \"Semoga Allah melaknat kalajengking, ia selalu menggigit orang yang sholat maupun yang tidak, bunuhlah mereka baik di wilayah hil (di luar wilayah haram) atau pun wilayah haram. \""
            },
            {
                "number": 1204,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا الْهَيْثَمُ بْنُ جَمِيلٍ حَدَّثَنَا مِنْدَلٌ عَنْ ابْنِ أَبِي رَافِعٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَتَلَ عَقْرَبًا وَهُوَ فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Al Haitsam bin Jamil] berkata, telah menceritakan kepada kami [Mindal] dari [Ibnu Abu Rafi'] dari [Bapaknya] dari [Kakeknya] berkata, \"Nabi shallallahu 'alaihi wasallam membunuh kalajengking, padahal beliau dalam sholat. \" "
            },
            {
                "number": 1205,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ حَفْصِ بْنِ عَاصِمٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ صَلَاتَيْنِ عَنْ الصَّلَاةِ بَعْدَ الْفَجْرِ حَتَّى تَطْلُعَ الشَّمْسُ وَبَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdullah bin Numair] dan [Abu Usamah] dari [ubaidhullah bin Umar] dari [Khubaib bin 'Abdurrahman] dari [Hafsh bin Ashim] dari [Abu Hurairah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang dua sholat; sholat setelah fajar hingga matahari terbit dan sholat setelah atsar hingga matahari terbenam. \""
            },
            {
                "number": 1206,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ يَعْلَى التَّيْمِيُّ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ قَزَعَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا صَلَاةَ بَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ وَلَا صَلَاةَ بَعْدَ الْفَجْرِ حَتَّى تَطْلُعَ الشَّمْسُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yahya bin Ya'la At Taimi] dari [Abdul Malik bin Umair] dari [Qaza'ah] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada sholat setelah ashar hingga matahari terbenam, dan tidak dan sholat setelah subuh hingga matahari terbit. \""
            },
            {
                "number": 1207,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَبِي الْعَالِيَةِ عَنْ ابْنِ عَبَّاسٍ قَالَشَهِدَ عِنْدِي رِجَالٌ مَرْضِيُّونَ فِيهِمْ عُمَرُ بْنُ الْخَطَّابِ وَأَرْضَاهُمْ عِنْدِي عُمَرُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا صَلَاةَ بَعْدَ الْفَجْرِ حَتَّى تَطْلُعَ الشَّمْسُ وَلَا صَلَاةَ بَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Qatadah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Affan] berkata, telah menceritakan kepada kami [Hammam] berkata, telah menceritakan kepada kami [Qatadah] dari [Abul Aliyah] dari [Ibnu Abbas] ia berkata, \"Beberapa orang yang diridhai bersaksi di sisiku, di antara mereka ada [Umar Ibnul Khaththab], dan menurutku orang yang paling diridhai dari mereka semua adalah Umar. Mereka bersaksi bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada sholat setelah fajar hingga matahari terbit dan sholat setelah ashar hingga matahari terbenam. \""
            },
            {
                "number": 1208,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ يَزِيدَ بْنِ طَلْقٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْبَيْلَمَانِيِّ عَنْ عَمْرِو بْنِ عَبَسَةَ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ هَلْ مِنْ سَاعَةٍ أَحَبُّ إِلَى اللَّهِ مِنْ أُخْرَى قَالَ نَعَمْ جَوْفُ اللَّيْلِ الْأَوْسَطُ فَصَلِّ مَا بَدَا لَكَ حَتَّى يَطْلُعَ الصُّبْحُ ثُمَّ انْتَهِ حَتَّى تَطْلُعَ الشَّمْسُ وَمَا دَامَتْ كَأَنَّهَا حَجَفَةٌ حَتَّى تُبَشْبِشَ ثُمَّ صَلِّ مَا بَدَا لَكَ حَتَّى يَقُومَ الْعَمُودُ عَلَى ظِلِّهِ ثُمَّ انْتَهِ حَتَّى تَزِيغَ الشَّمْسُ فَإِنَّ جَهَنَّمَ تُسْجَرُ نِصْفَ النَّهَارِ ثُمَّ صَلِّ مَا بَدَا لَكَ حَتَّى تُصَلِّيَ الْعَصْرَ ثُمَّ انْتَهِ حَتَّى تَغْرُبَ الشَّمْسُ فَإِنَّهَا تَغْرُبُ بَيْنَ قَرْنَيْ الشَّيْطَانِ وَتَطْلُعُ بَيْنَ قَرْنَيْ الشَّيْطَانِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ghundar] dari [Syu'bah] dari [Ya'la bin Atha] dari [Yazid bin Thalq] dari ['Abdurrahman Ibnul Bailamani] dari [Amru bin Anbasah] ia berkata, \"Aku menemui Rasulullah shallallahu 'alaihi wasallam dan bertanya, \"Apakah ada satu waktu yang lebih disukai oleh Allah dari waktu yang lain?\" beliau menjawab: \"Ya, pertengahan malam, maka sholatlah semampumu hingga datang waktu subuh, setelah itu berhentilah (dari mengerjakan sholat) hingga matahari terbit, dan selagi matahari seperti perisai sampai memancar terang (terik menyengat), kemudian sholatlah sekehendak kamu sampai  tongkat berdiri tegak diatas bayangnya, kemudian berhentilah sampai matahari bergeser, karena  sesungguhnya jahannam di kobarkan pada perengahan hari. Kemudian sholatlah sekehendak kamu sampai kamu melaksanakan sholat ashar, kemudian berhentilah sampai matahari terbenam, karena sesungguhnya matahari terbenam diantara dua tanduk setan dan terbit diantara dua tanduk setan."
            },
            {
                "number": 1209,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ دَاوُدَ الْمُنْكَدِرِيُّ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ عَنْ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَسَأَلَ صَفْوَانُ بْنُ الْمُعَطَّلِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي سَائِلُكَ عَنْ أَمْرٍ أَنْتَ بِهِ عَالِمٌ وَأَنَا بِهِ جَاهِلٌ قَالَ وَمَا هُوَ قَالَ هَلْ مِنْ سَاعَاتِ اللَّيْلِ وَالنَّهَارِ سَاعَةٌ تُكْرَهُ فِيهَا الصَّلَاةُ قَالَ نَعَمْ إِذَا صَلَّيْتَ الصُّبْحَ فَدَعْ الصَّلَاةَ حَتَّى تَطْلُعَ الشَّمْسُ فَإِنَّهَا تَطْلُعُ بِقَرْنَيْ الشَّيْطَانِ ثُمَّ صَلِّ فَالصَّلَاةُ مَحْضُورَةٌ مُتَقَبَّلَةٌ حَتَّى تَسْتَوِيَ الشَّمْسُ عَلَى رَأْسِكَ كَالرُّمْحِ فَإِذَا كَانَتْ عَلَى رَأْسِكَ كَالرُّمْحِ فَدَعْ الصَّلَاةَ فَإِنَّ تِلْكَ السَّاعَةَ تُسْجَرُ فِيهَا جَهَنَّمُ وَتُفْتَحُ فِيهَا أَبْوَابُهَا حَتَّى تَزِيغَ الشَّمْسُ عَنْ حَاجِبِكَ الْأَيْمَنِ فَإِذَا زَالَتْ فَالصَّلَاةُ مَحْضُورَةٌ مُتَقَبَّلَةٌ حَتَّى تُصَلِّيَ الْعَصْرَ ثُمَّ دَعْ الصَّلَاةَ حَتَّى تَغِيبَ الشَّمْسُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Dawud Al Munkadir] berkata, telah menceritakan kepada kami [Ibnu Abu Fudaik] dari [Adl Dlahhaq bin Utsman] dari [Al Maqburi] dari [Abu Hurairah] ia berkata, \"Shafwan Ibnul Mu'aththal bertanya kepada Rasulullah shallallahu 'alaihi wasallam, ia berkata, \"Wahai Rasulullah, aku ingin bertanya kepadamu sesuatu yang engkau ketahui dan tidak aku ketahui, \" beliau bersabda: \"Apa itu?\" ia berkata, \"Apakah pada waktu siang dan malam ada waktu-waktu yang seseorang tidak boleh sholat di dalamnya?\" beliau bersabda: \"Ya, jika engkau telah selesai dari sholat subuh, maka tinggalkanlah sholat hingga matahari terbit, sebab ia terbit antara dua tanduk setan. Setelah itu sholatlah, sebab sholat pada waktu itu dihadiri dan diterima hingga matahari berdiri tegak di atas kepalamu seperti tombak. Jika matahari telah tegak di atas kepalamu sebagaimana tombak maka tinggalkanlah sholat, sebab pada waktu itu jahannam sedang menyala-nyala dan semua pintunya terbuka hingga matahari bergeser dari alis matamu yang sebelah kanan. Jika matahari telah bergeser maka sholat pada waktu itu disaksikan dan diterima hingga engkau mengerjakan sholat ashar. Setelah itu tinggalkanlah sholat hingga matahari terbenam. \""
            },
            {
                "number": 1210,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ الصُّنَابِحِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الشَّمْسَ تَطْلُعُ بَيْنَ قَرْنَيْ الشَّيْطَانِ أَوْ قَالَ يَطْلُعُ مَعَهَا قَرْنَا الشَّيْطَانِ فَإِذَا ارْتَفَعَتْ فَارَقَهَا فَإِذَا كَانَتْ فِي وَسَطِ السَّمَاءِ قَارَنَهَا فَإِذَا دَلَكَتْ أَوْ قَالَ زَالَتْ فَارَقَهَا فَإِذَا دَنَتْ لِلْغُرُوبِ قَارَنَهَا فَإِذَا غَرَبَتْ فَارَقَهَا فَلَا تُصَلُّوا هَذِهِ السَّاعَاتِ الثَّلَاثَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] berkata, telah memberitakan kepada kami [Abdurrazaq] berkata, telah memberitakan kepada kami [Ma'mar] dari [Zaid bin Aslam] dari ['Atho` bin Yasar] dari [Abu Abdullah Ash Shunabihi] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya matahari terbit antara dua tanduk setan, atau beliau mengatakan: \"terbit bersamaan dengan dua tanduk setan. Jika matahari telah meninggi ia memisahkan diri darinya, dan jika matahari berada di tengah langit ia kembali mendekatinya. Jika bergeser, atau beliau mengatakan: \"condong, ia kembali memisahkan diri darinya, jika matahari hampir tenggelam ia kembali mendekatinya, dan jika matahari terbenam ia memisahkan dirinya. Maka janganlah kalian sholat di tiga waktu ini. \""
            },
            {
                "number": 1211,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ عَبْدِ اللَّهِ بْنِ بَابَيْهِ عَنْ جُبَيْرِ بْنِ مُطْعِمٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا بَنِي عَبْدِ مَنَافٍ لَا تَمْنَعُوا أَحَدًا طَافَ بِهَذَا الْبَيْتِ وَصَلَّى أَيَّةَ سَاعَةٍ شَاءَ مِنْ اللَّيْلِ وَالنَّهَارِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Abu Az Zubair] dari [Abdullah bin Babaih] dari [Jubair bin Muth'im] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Bani Abdu Manaf, janganlah kalian halangi seorang pun thawaf di rumah ini (Ka'bah), \" Dan beliau sholat di siang dan malam hari pada waktu kapan pun yang beliau kehendaki. \""
            },
            {
                "number": 1212,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ عَاصِمٍ عَنْ زِرٍّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَلَّكُمْ سَتُدْرِكُونَ أَقْوَامًا يُصَلُّونَ الصَّلَاةَ لِغَيْرِ وَقْتِهَا فَإِنْ أَدْرَكْتُمُوهُمْ فَصَلُّوا فِي بُيُوتِكُمْ لِلْوَقْتِ الَّذِي تَعْرِفُونَ ثُمَّ صَلُّوا مَعَهُمْ وَاجْعَلُوهَا سُبْحَةً",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Abu Bakr bin Ayyasy] dari [Ashim] dari [Zir] dari [Abdullah bin Mas'ud] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semoga kalian nanti mendapati orang-orang yang mengerjakan sholat di luar waktunya, jika kalian mendapati mereka maka sholatlah di rumah-rumah kalian pada waktu yang telah kalian ketahui, setelah itu sholatlah bersama mereka sebagai sholat tathawwu' (tambahan). \""
            },
            {
                "number": 1213,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلِّ الصَّلَاةَ لِوَقْتِهَا فَإِنْ أَدْرَكْتَ الْإِمَامَ يُصَلِّي بِهِمْ فَصَلِّ مَعَهُمْ وَقَدْ أَحْرَزْتَ صَلَاتَكَ وَإِلَّا فَهِيَ نَافِلَةٌ لَكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Abu Imran Al Jauni] dari [Abdullah bin Ash Shamit] dari [Abu Dzar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Kerjakanlah sholat pada waktunya, jika engkau mendapatkan imam sholat bersama orang-orang maka bergabunglah bersama mereka, maka kamu telah menjaga sholatmu. Jika tidak (mendapatkan imam sholat bersama orang-orang pada waktunya), maka itu (sholat bersamanya di luar waktu) adalah tambahan bagimu. \""
            },
            {
                "number": 1214,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ أَبِي الْمُثَنَّى عَنْ أَبِي أُبَيٍّ ابْنِ امْرَأَةِ عُبَادَةَ بْنِ الصَّامِتِ يَعْنِي عَنْ عُبَادَةَ بْنِ الصَّامِتِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَيَكُونُ أُمَرَاءُ تَشْغَلُهُمْ أَشْيَاءُ يُؤَخِّرُونَ الصَّلَاةَ عَنْ وَقْتِهَا فَاجْعَلُوا صَلَاتَكُمْ مَعَهُمْ تَطَوُّعًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Abu Ahmad] berkata, telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Manshur] dari [Hilal bin Yasaf] dari [Abul Mutsanna] dari [Abu Ubai] -anak dari istri Ubadah bin Shamit- dari [Ubadah bin Ash Shamit] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Akan datang para pemimpin yang disibukkan urusan-urusan hingga mereka mengakhirkan sholat dari waktunya, maka jadikanlah sholat kalian bersama mereka sebagai tathawwu'. \""
            },
            {
                "number": 1215,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا جَرِيرٌ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ الْخَوْفِ أَنْ يَكُونَ الْإِمَامُ يُصَلِّي بِطَائِفَةٍ مَعَهُ فَيَسْجُدُونَ سَجْدَةً وَاحِدَةً وَتَكُونُ طَائِفَةٌ مِنْهُمْ بَيْنَهُمْ وَبَيْنَ الْعَدُوِّ ثُمَّ يَنْصَرِفُ الَّذِينَ سَجَدُوا السَّجْدَةَ مَعَ أَمِيرِهِمْ ثُمَّ يَكُونُونَ مَكَانَ الَّذِينَ لَمْ يُصَلُّوا وَيَتَقَدَّمُ الَّذِينَ لَمْ يُصَلُّوا فَيُصَلُّوا مَعَ أَمِيرِهِمْ سَجْدَةً وَاحِدَةً ثُمَّ يَنْصَرِفُ أَمِيرُهُمْ وَقَدْ صَلَّى صَلَاتَهُ وَيُصَلِّي كُلُّ وَاحِدٍ مِنْ الطَّائِفَتَيْنِ بِصَلَاتِهِ سَجْدَةً لِنَفْسِهِ فَإِنْ كَانَ خَوْفٌ أَشَدَّ مِنْ ذَلِكَ فَرِجَالًا أَوْ رُكْبَانًاقَالَ يَعْنِي بِالسَّجْدَةِ الرَّكْعَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Jarir] dari [ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda tentang sholat khauf: \"Hendaklah Imam sholat bersama sekelompok orang lalu sujud sekali, sementara satu kelompok lagi berdiri antara mereka menghadap musuh. Kemudian kelompok yang telah mendapatkan satu sujud bersama pemimpinnya pindah ke tempat kelompok yang belum melaksanakan sholat, kelompok yang belum sholat itu kemudian maju dan sholat bersama pemimpinnya hingga mendapatkan satu sujud. Pemimpin (Imam) itu kemudian berlalu pergi karena telah mengerjakan sholatnya (dengan sempurna), sementara setiap kelompok tersebut menyempurnakan sholat mereka sendiri-sendiri. Jika rasa takut melebihi dari kadar tersebut maka hendaklah melakukannya dengan berjalan atau berkendaraan. \" Ibnu Umar berkata, \"Yakni sujud untuk raka'at. \""
            },
            {
                "number": 1216,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ الْأَنْصَارِيُّ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ صَالِحِ بْنِ خَوَّاتٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَأَنَّهُ قَالَ فِي صَلَاةِ الْخَوْفِ قَالَ يَقُومُ الْإِمَامُ مُسْتَقْبِلَ الْقِبْلَةِ وَتَقُومُ طَائِفَةٌ مِنْهُمْ مَعَهُ وَطَائِفَةٌ مِنْ قِبَلِ الْعَدُوِّ وَوُجُوهُهُمْ إِلَى الصَّفِّ فَيَرْكَعُ بِهِمْ رَكْعَةً وَيَرْكَعُونَ لِأَنْفُسِهِمْ وَيَسْجُدُونَ لِأَنْفُسِهِمْ سَجْدَتَيْنِ فِي مَكَانِهِمْ ثُمَّ يَذْهَبُونَ إِلَى مُقَامِ أُولَئِكَ وَيَجِيءُ أُولَئِكَ فَيَرْكَعُ بِهِمْ رَكْعَةً وَيَسْجُدُ بِهِمْ سَجْدَتَيْنِ فَهِيَ لَهُ ثِنْتَانِ وَلَهُمْ وَاحِدَةٌ ثُمَّ يَرْكَعُونَ رَكْعَةً وَيَسْجُدُونَ سَجْدَتَيْنِقَالَ مُحَمَّدُ بْنُ بَشَّارٍ فَسَأَلْتُ يَحْيَى بْنَ سَعِيدٍ الْقَطَّانَ عَنْ هَذَا الْحَدِيثِ فَحَدَّثَنِي عَنْ شُعْبَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ صَالِحِ بْنِ خَوَّاتٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ يَحْيَى بْنِ سَعِيدٍ قَالَ قَالَ لِي يَحْيَى اكْتُبْهُ إِلَى جَنْبِهِ وَلَسْتُ أَحْفَظُ الْحَدِيثَ وَلَكِنْ مِثْلُ حَدِيثِ يَحْيَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Yahya bin Sa'id Al Qaththan] berkata, telah menceritakan kepadaku [Yahya bin Sa'id Al Anshari] dari [Al Qasim bin Muhammad] dari [Sholih bin Khawwat] dari [Sahl bin Abu Hatsmah] Bahwasanya ia pernah berkata tentang sholat khauf, ia mengatakan, \"Imam menghadap ke arah kiblat, satu kelompok berdiri bersamanya dan kelompok lain ke arah musuh, sementara wajah mereka menghadap ke arah shaf. Imam rukuk sekali bersama mereka, lalu mereka rukuk dan sujud dua kali di tempat mereka berada secara sendiri-sendiri. Setelah itu mereka pergi menempati tempat kelompok (yang belum sholat), kemudian kelompok yang belum sholat itu datang hingga imam rukuk satu kali, dan sujud dua kali bersama mereka. Dengan demikian maka imam mendapatkan dua kali rukuk sementara mereka satu kali rukuk, lalu mereka rukuk satu kali lagi dan sujud dua kali. \" [Muhammad bin Basysyar] berkata, \"Aku bertanya kepada [Yahya bin Sa'id Al Qaththan] tentang hadits ini, maka ia menceritakan kepadaku dari [Syu'bah] dari ['Abdurrahman Ibnul Qasim] dari [Bapaknya] dari [Shalih bin Khawwat] dari [Sahl bin Abu Hatsmah] dari Nabi shallallahu 'alaihi wasallam sebagaimana hadits Yahya bin Sa'id. \" Ia berkata; Yahya berkata kepadaku, \"Tulislah hadits tersebut di sisinya, aku bukan seorang yang hafal hadits, tetapi seperti hadits Yahya. \""
            },
            {
                "number": 1217,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِأَصْحَابِهِ صَلَاةَ الْخَوْفِ فَرَكَعَ بِهِمْ جَمِيعًا ثُمَّ سَجَدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالصَّفُّ الَّذِينَ يَلُونَهُ وَالْآخَرُونَ قِيَامٌ حَتَّى إِذَا نَهَضَ سَجَدَ أُولَئِكَ بِأَنْفُسِهِمْ سَجْدَتَيْنِ ثُمَّ تَأَخَّرَ الصَّفُّ الْمُقَدَّمُ حَتَّى قَامُوا مُقَامَ أُولَئِكَ وَتَخَلَّلَ أُولَئِكَ حَتَّى قَامُوا مُقَامَ الصَّفِّ الْمُقَدَّمِ فَرَكَعَ بِهِمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمِيعًا ثُمَّ سَجَدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالصَّفُّ الَّذِي يَلُونَهُ فَلَمَّا رَفَعُوا رُءُوسَهُمْ سَجَدَ أُولَئِكَ سَجْدَتَيْنِ وَكُلُّهُمْ قَدْ رَكَعَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَجَدَ طَائِفَةٌ بِأَنْفُسِهِمْ سَجْدَتَيْنِ وَكَانَ الْعَدُوُّ مِمَّا يَلِي الْقِبْلَةَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah] berkata, telah menceritakan kepada kami [Abdul Warits bin Sa'id] berkata, telah menceritakan kepada kami [Ayyub] dari [Abu Az Zubair] dari [Jabir bin Abdullah] berkata, \"Nabi shallallahu 'alaihi wasallam sholat khauf bersama para sahabatnya, beliau rukuk bersama mereka semua. Kemudian beliau sujud bersama shaf yang berada di belakangnya (shaf paling depan), sementara yang lain tetap berdiri. Hingga ketika beliau bangkit mereka tetap meneruskan sujud dua kali sendiri-sendiri. Kemudian shaf yang paling depan mundur ke belakang menempati tempat mereka (kelompok yang ada di barisan kedua). Kemudian kelompok (kedua) tersebut maju melalui celah-celah hingga menempati posisi shaf pertama. Nabi shallallahu 'alaihi wasallam kemudian rukuk bersama mereka semua, selanjutnya Rasulullah shallallahu 'alaihi wasallam sujud bersama shaf yang berada di belakangnya. Maka ketika mereka mengangkat kepala, mereka sujud kembali dua kali, hingga semua kelompok telah rukuk bersama Nabi shallallahu 'alaihi wasallam. Dan kelompok tersebut sujud dua kali sendiri-sendiri, sementara musuh ada di arah kiblat. \" "
            },
            {
                "number": 1218,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ أَبِي مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ مِنْ النَّاسِ فَإِذَا رَأَيْتُمُوهُ فَقُومُوا فَصَلُّوا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Bapakku] berkata, telah menceritakan kepada kami [Isma'il bin Abu Khalid] dari [Qais bin Abu Hazm] dari [Abu Mas'ud] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya matahari dan bulan tidaklah terbit karena kematian seorang manusia, jika kalian melihatnya maka berdiri dan sholatlah. \" "
            },
            {
                "number": 1219,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَأَحْمَدُ بْنُ ثَابِتٍ وَجَمِيلُ بْنُ الْحَسَنِ قَالُوا حَدَّثَنَا عَبْدُ الْوَهَّابِ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي قِلَابَةَ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَانْكَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجَ فَزِعًا يَجُرُّ ثَوْبَهُ حَتَّى أَتَى الْمُسْجِدَ فَلَمْ يَزَلْ يُصَلِّي حَتَّى انْجَلَتْ ثُمَّ قَالَ إِنَّ أُنَاسًا يَزْعُمُونَ أَنَّ الشَّمْسَ وَالْقَمَرَ لَا يَنْكَسِفَانِ إِلَّا لِمَوْتِ عَظِيمٍ مِنْ الْعُظَمَاءِ وَلَيْسَ كَذَلِكَ إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ فَإِذَا تَجَلَّى اللَّهُ لِشَيْءٍ مِنْ خَلْقِهِ خَشَعَ لَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ahmad bin Tsabit] dan [Jamil bin Al Hasan] mereka berkata; telah menceritakan kepada kami [Abdul Wahhab] dari [Khalid Al Hadzdza] dari [Abu Qilabah] dari [An Nu'man bin Basysyar] ia berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam terjadi gerhana, lalu Beliau keluar tergesa-gesa sambil menjinjing kainnya hingga tiba di masjid. Beliau tetap melaksanakan sholat hingga gerhana berakhir, setelah itu beliau bersabda: \"Orang-orang mengklaim bahwa tidak akan terjadi gerhana matahari dan bulan kecuali karena kematian salah seorang pembesar, padahal tidak seperti itu. Matahari dan bulan tidak terjadi gerhana karena kematian atau hidupnya seseorang, Maka jika Allah menampakkan kepada salah satu dari hamba-Nya, maka ia akan tunduk kepada-Nya. \" "
            },
            {
                "number": 1220,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْكَسَفَتْ الشَّمْسُ فِي حَيَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمَسْجِدِ فَقَامَ فَكَبَّرَ فَصَفَّ النَّاسُ وَرَاءَهُ فَقَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِرَاءَةً طَوِيلَةً ثُمَّ كَبَّرَ فَرَكَعَ رُكُوعًا طَوِيلًا ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ ثُمَّ قَامَ فَقَرَأَ قِرَاءَةً طَوِيلَةً هِيَ أَدْنَى مِنْ الْقِرَاءَةِ الْأُولَى ثُمَّ كَبَّرَ فَرَكَعَ رُكُوعًا طَوِيلًا هُوَ أَدْنَى مِنْ الرُّكُوعِ الْأَوَّلِ ثُمَّ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ ثُمَّ فَعَلَ فِي الرَّكْعَةِ الْأُخْرَى مِثْلَ ذَلِكَ فَاسْتَكْمَلَ أَرْبَعَ رَكَعَاتٍ وَأَرْبَعَ سَجَدَاتٍ وَانْجَلَتْ الشَّمْسُ قَبْلَ أَنْ يَنْصَرِفَ ثُمَّ قَامَ فَخَطَبَ النَّاسَ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ فَإِذَا رَأَيْتُمُوهُمَا فَافْزَعُوا إِلَى الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Amru bin As Sarh Al Mishri] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] berkata, telah mengabarkan kepadaku [Urwah bin Az Zubair] dari ['Aisyah] berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam terjadi gerhana matahari, maka Rasulullah shallallahu 'alaihi wasallam berangkat menuju masjid. Beliau berdiri dan takbir, sementara orang-orang membuat shaf di belakangnya. Rasulullah shallallahu 'alaihi wasallam membaca bacaan yang panjang, kemudian takbir, lalu rukuk dengan rukuk yang panjang, kemudian mengangkat kepalanya. Beliau mengucapkan: \"RABBANA WA LAKAL HAMDU. Kemudian beliau kembali berdiri dan membaca bacaan yang panjang, namun lebih pendek dari bacaan yang pertama. Kemudian takbir, lalu rukuk dan memperpanjang rukuknya, namun lebih pendek dari rukuk yang pertama. Kemudian mengucapkan: \"SAMI'A ALLAHU LIMAN HAMIDAH RABBANAA WA LAKAL HAMDU. Kemudian beliau mengerjakan raka'at yang lain (kedua) seperti itu. Dengan begitu beliau telah menyempurnakan empat raka'at dan empat sujud, sementara matahari mulai muncul sebelum beliau bergeser. Setelah itu beliau berdiri dan berkhutbah di hadapan orang-orang, beliau memuji Allah sebagaimana mestinya, lalu mengatakan: \"Sesungguhnya matahari dan bulan adalah dua tanda dari tanda-tanda (kekuasaan) Allah, keduanya tidak gerhana karena kematian atau lahirnya seseorang, jika kalian melihatnya (gerhana) maka laksanakanlah sholat. \""
            },
            {
                "number": 1221,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ الْأَسْوَدِ بْنِ قَيْسٍ عَنْ ثَعْلَبَةَ بْنِ عِبَادٍ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْكُسُوفِ فَلَا نَسْمَعُ لَهُ صَوْتًا",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Muhammad bin Isma'il] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Al Aswad bin Qais] dari [Tsa'labah bin 'Ibad] dari [Samurah bin Jundab] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah sholat gerhana bersama kami, dan kami tidak mendengar beliau bersuara. \" "
            },
            {
                "number": 1222,
                "arab": "حَدَّثَنَا مُحْرِزُ بْنُ سَلَمَةَ الْعَدَنِيُّ قَالَ حَدَّثَنَا نَافِعُ بْنُ عُمَرَ الْجُمَحِيُّ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ قَالَتْصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْكُسُوفِ فَقَامَ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ فَقَامَ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ ثُمَّ رَفَعَ ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ ثُمَّ رَفَعَ فَقَامَ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ فَقَامَ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ ثُمَّ رَفَعَ ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ ثُمَّ انْصَرَفَ فَقَالَ لَقَدْ دَنَتْ مِنِّي الْجَنَّةُ حَتَّى لَوْ اجْتَرَأْتُ عَلَيْهَا لَجِئْتُكُمْ بِقِطَافٍ مِنْ قِطَافِهَا وَدَنَتْ مِنِّي النَّارُ حَتَّى قُلْتُ أَيْ رَبِّ وَأَنَا فِيهِمْ قَالَ نَافِعٌ حَسِبْتُ أَنَّهُ قَالَ وَرَأَيْتُ امْرَأَةً تَخْدِشُهَا هِرَّةٌ لَهَا فَقُلْتُ مَا شَأْنُ هَذِهِ قَالُوا حَبَسَتْهَا حَتَّى مَاتَتْ جُوعًا لَا هِيَ أَطْعَمَتْهَا وَلَا هِيَ أَرْسَلَتْهَا تَأْكُلُ مِنْ خِشَاشِ الْأَرْضِ",
                "id": "Telah menceritakan kepada kami [Muhriz bin Salamah Al Adani] berkata; telah menceritakan kepada kami [Nafi' bin Umar Al Juhami] dari [Ibnu Abu Mulaikah] dari [Asma binti Abu Bakr] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat gerhana, beliau berdiri dan memperpanjang berdirinya, kemudian rukuk dan memperpanjang rukuknya, kemudian berdiri dan memperpanjang berdirinya, kemudian rukuk dan memperpanjang rukuknya, setelah itu beliau mengangkat (kepala) kemudian sujud dan memperpanjang sujudnya, kemudian mengangkat (kepala) kemudian sujud dan memperpanjang sujudnya, kemudian mengangkat kepala berdiri dan memperpanjang berdirinya, kemudian rukuk dan memperpanjang rukuknya, kemudian mengangkat kepala berdiri dan memperpanjang berdirinya, kemudian rukuk dan memperpanjang rukuknya, kemudian mengangkat kepalanya, kemudian sujud dan memperpanjang sujudnya, kemudian mengangkat kepalanya, kemudian sujud dan memperpanjang sujudnya. Setelah itu beliau bergeser dan bersabda: \"Surga telah dekat denganku, sekiranya aku berani sungguh akan aku ambilkan untuk kalian buah dari buah-buahan surga. Dan neraka telah dekat denganku hingga aku berkata: \"Wahai Rabb, aku masih bersama mereka! \" Nafi' berkata, \"Menurutku beliau mengatakan: \"Aku melihat seorang wanita yang dicakar-cakar oleh kucing miliknya. Aku bertanya: \"Ada apa dengan wanita ini?\" mereka menjawab, \"Wanita itu telah menahannya, kucing itu mati karena lapar. Ia tidak memberi makan dan tidak membiarkannya pergi untuk makan serangga bumi. \""
            },
            {
                "number": 1223,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ وَمُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ هِشَامِ بْنِ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ كِنَانَةَ عَنْ أَبِيهِ قَالَأَرْسَلَنِي أَمِيرٌ مِنْ الْأُمَرَاءِ إِلَى ابْنِ عَبَّاسٍ أَسْأَلُهُ عَنْ الصَّلَاةِ فِي الِاسْتِسْقَاءِ فَقَالَ ابْنُ عَبَّاسٍ مَا مَنَعَهُ أَنْ يَسْأَلَنِي قَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَوَاضِعًا مُتَبَذِّلًا مُتَخَشِّعًا مُتَرَسِّلًا مُتَضَرِّعًا فَصَلَّى رَكْعَتَيْنِ كَمَا يُصَلِّي فِي الْعِيدِ وَلَمْ يَخْطُبْ خُطْبَتَكُمْ هَذِهِ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] dan [Muhammad bin Isma'il] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Hisyam bin Ishaq bin Abdullah bin Kinanah] dari [Bapaknya] ia berkata, \"Salah seorang pemimpin mengirimku menemui [Ibnu Abbas] untuk menanyakan kepadanya tentang sholat istisqa`, Ibnu Abbas pun berkata, \"Apa yang menghalanginya bertanya langsung kepadaku?\" ia berkata lagi: \"Rasulullah shallallahu 'alaihi wasallam keluar dengan penuh tawadlu', memakai baju biasa, khusyu', perlahan-lahan dan menunduk. Lalu Beliau sholat dua raka'at sebagaimana sholat 'ied, namun beliau tidak berkhutbah seperti khutbah kalian ini. \""
            },
            {
                "number": 1224,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ قَالَ سَمِعْتُ عَبَّادَ بْنَ تَمِيمٍ يُحَدِّثُ أَبِي عَنْ عَمِّهِأَنَّهُ شَهِدَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ إِلَى الْمُصَلَّى لِيَسْتَسْقِي فَاسْتَقْبَلَ الْقِبْلَةَ وَقَلَبَ رِدَاءَهُ وَصَلَّى رَكْعَتَيْنِحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَمِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ قَالَ سُفْيَانُ عَنْ الْمَسْعُودِيِّ قَالَ سَأَلْتُ أَبَا بَكْرِ بْنَ مُحَمَّدِ بْنِ عَمْرٍو أَجَعَلَ أَعْلَاهُ أَسْفَلَهُ أَوْ الْيَمِينَ عَلَى الشِّمَالِ قَالَ لَا بَلْ الْيَمِينَ عَلَى الشِّمَالِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah menceritakan kepada kami [Sufyan] dari [Abdullah bin Bakr] berkata; aku mendengar [Abbad bin Tamim] -menceritakan kepada bapakku- dari [Pamannya] bahwasanya ia bersaksi, bahwa Nabi shallallahu 'alaihi wasallam pernah keluar untuk sholat istisqa`, beliau menghadap kiblat, lalu membalik selendangnya dan sholat dua raka'at. \" Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Sufyan] dari [Yahya bin Sa'id] dari [Abu Bakr bin Muhammad bin Amru bin Hazm] dari [Abbad bin Tamim] dari [Pamannya] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits. Sufyan menyebutkan dari Al Mas'udi ia berkata, \"Aku bertanya kepada Abu Bakr bin Muhammad bin Amru, \"Apakah beliau menjadikan bagian atas pada bagian bawahnya, atau bagian kanan pada bagian kirinya?\" ia menjawab, \"Tidak, tetapi bagian kanan pada bagian kiri. \" "
            },
            {
                "number": 1225,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ وَالْحَسَنُ بْنُ أَبِي الرَّبِيعِ قَالَا حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ النُّعْمَانَ يُحَدِّثُ عَنْ الزُّهْرِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا يَسْتَسْقِي فَصَلَّى بِنَا رَكْعَتَيْنِ بِلَا أَذَانٍ وَلَا إِقَامَةٍ ثُمَّ خَطَبَنَا وَدَعَا اللَّهَ وَحَوَّلَ وَجْهَهُ نَحْوَ الْقِبْلَةِ رَافِعًا يَدَيْهِ ثُمَّ قَلَبَ رِدَاءَهُ فَجَعَلَ الْأَيْمَنَ عَلَى الْأَيْسَرِ وَالْأَيْسَرَ عَلَى الْأَيْمَنِ",
                "id": "Telah menceritakan kepada kami [Ahmad Ibnul Azhar] dan [Al Hasan bin Abu Rabi'] keduanya berkata; telah menceritakan kepada kami [Wahb bin Jarir] berkata, telah menceritakan kepada kami [Bapakku] berkata; aku mendengar [An Nu'man] menceritakan dari [Az Zuhri] dari [Humaid bin 'Abdurrahman] dari [Abu Hurairah] ia berkata, \"Pada suatu hari Rasulullah shallallahu 'alaihi wasallam keluar sholat istisqa`, beliau sholat dua raka'at bersama kami tanpa adzan dan iqamah, kemudian beliau berkhutbah di hadapan kami dan berdo`a kepada Allah, beliau mengarahkan wajahnya ke arah kiblat seraya mengangkat kedua tangannya. Setelah itu beliau membalik selendangnya, menjadikan bagian kanan pada bagian kiri dan bagian kiri pada bagian kanan. \""
            },
            {
                "number": 1226,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ شُرَحْبِيلَ بْنِ السِّمْطِأَنَّهُ قَالَ لِكَعْبٍ يَا كَعْبُ بْنَ مُرَّةَ حَدِّثْنَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاحْذَرْ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ اسْتَسْقِ اللَّهَ فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ فَقَالَ اللَّهُمَّ اسْقِنَا غَيْثًا مَرِيئًا مَرِيعًا طَبَقًا عَاجِلًا غَيْرَ رَائِثٍ نَافِعًا غَيْرَ ضَارٍّ قَالَ فَمَا جَمَّعُوا حَتَّى أُجِيبُوا قَالَ فَأَتَوْهُ فَشَكَوْا إِلَيْهِ الْمَطَرَ فَقَالُوا يَا رَسُولَ اللَّهِ تَهَدَّمَتْ الْبُيُوتُ فَقَالَ اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا قَالَ فَجَعَلَ السَّحَابُ يَنْقَطِعُ يَمِينًا وَشِمَالًا",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Amru bin Murrah] dari [Salim bin Abul Ju'd] dari [Surahbil bin As Sibth] bahwasanya ia berkata kepada Ka'b, \"Wahai Ka'b bin Murrah, ceritakanlah sebuah hadits Rasulullah shallallahu 'alaihi wasallam kepada kami, dan hati-hatilah engkau (dalam menyampaikan hadits), \" [Ka'b bin Murrah] berkata, \"Seorang laki-laki datang menemui Nabi shallallahu 'alaihi wasallam seraya berkata, \"Wahai Rasulullah, beristisqa`lah engkau kepada Allah! \" Rasulullah shallallahu 'alaihi wasallam lalu mengangkat keduanya dan mengucapkan: \"ALLAHUMMAS QINAA GHAITSAN MARII`AN MARII'AN THABAQAN 'AAJILAN GHAIRA RA`ITSIN NAAFI'AN GHAIRA DLAARRIN (Ya Allah, berilah kepada kami hujan yang tenang dan merata, menyegarkan tubuh dan menyuburkan tanaman, segera dan tidak ditunda-tunda, bermanfaat dan tidak membahayakan). \" Ka'b bin Murrah berkata, \"Belum genap satu minggu mereka pun mendapatkan hujan. \" Ka'b bin Murrah berkata, \"Lalu mereka mendatangi beliau lagi dan mengeluhkan perihal hujan, mereka mengatakan, \"Wahai Rasulullah, banyak rumah yang hancur (karena hujan)! \" maka beliau pun mengucapkan: \"ALLAHUMMA HAWAALAINAA WA LAA 'ALAINAA (Ya Allah, hujanilah sekitar kami dan jangan atas kami). \" Ka'b bin Murrah berkata, \"Maka mendung pun terbelah ke kanan dan ke kiri. \""
            },
            {
                "number": 1227,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي الْقَاسِمِ أَبُو الْأَحْوَصِ حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ حَدَّثَنَا حُصَيْنٌ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ ابْنِ عَبَّاسٍ قَالَجَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ لَقَدْ جِئْتُكَ مِنْ عِنْدِ قَوْمٍ مَا يَتَزَوَّدُ لَهُمْ رَاعٍ وَلَا يَخْطِرُ لَهُمْ فَحْلٌ فَصَعِدَ الْمِنْبَرَ فَحَمِدَ اللَّهَ ثُمَّ قَالَ اللَّهُمَّ اسْقِنَا غَيْثًا مُغِيثًا مَرِيئًا طَبَقًا مَرِيعًا غَدَقًا عَاجِلًا غَيْرَ رَائِثٍ ثُمَّ نَزَلَ فَمَا يَأْتِيهِ أَحَدٌ مِنْ وَجْهٍ مِنْ الْوُجُوهِ إِلَّا قَالُوا قَدْ أُحْيِينَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abul Qasim Abul Ahwash] berkata, telah menceritakan kepada kami [Al Hasan Ibnur Rabi'] berkata, telah menceritakan kepada kami [Abdullah bin Idris] berkata, telah menceritakan kepada kami [Hushain] dari [Habib bin Abu Tsabit] dari [Ibnu Abbas] ia berkata, \"Seorang arab dusun datang menemui Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, aku datang dari kaumku, para penggembala tidak bisa lagi membekali mereka (dengan susu), dan unta jantan tidak lagi membahayakan mereka (karena lemah)! \" Lalu beliau naik mimbar memuji Allah seraya mengucapkan: \"ALLAHUMMASQINAA GHAITSAN MUGHITSAN MARII`AN MARII'AN THABAQAN GHADAQAN 'AAJILAN GHAIRAA`TSIN (Ya Allah, berilah kami hujan yang tenang dan merata, menyegarkan tubuh dan menyuburkan tanaman, melimpah, segera dan tidak ditunda-tunda). \" Setelah itu beliau turun dari mimbar, dan tidaklah seseorang datang kecuali mengucapkan, \"Kami telah mendapatkan kehidupan. \""
            },
            {
                "number": 1228,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا مُعْتَمِرٌ عَنْ أَبِيهِ عَنْ بَرَكَةَ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَسْقَى حَتَّى رَأَيْتُ أَوْ رُئِيَ بَيَاضُ إِبْطَيْهِقَالَ مُعْتَمِرٌ أُرَاهُ فِي الِاسْتِسْقَاءِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Affan] berkata, telah menceritakan kepada kami [Mu'tamir] dari [Bapaknya] dari [Barakah] dari [Basyir bin Nahik] dari [Abu Hurairah] berkata, \"Nabi shallallahu 'alaihi wasallam sholat istisqa` meminta hujan hingga aku melihat putihnya ketiak beliau. \" Mu'tamir berkata, \"Menurutku, hal itu terjadi pada waktu sholat istisqa`. \""
            },
            {
                "number": 1229,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا أَبُو عَقِيلٍ عَنْ عُمَرَ بْنِ حَمْزَةَ حَدَّثَنَا سَالِمٌ عَنْ أَبِيهِ قَالَرُبَّمَا ذَكَرْتُ قَوْلَ الشَّاعِرِ وَأَنَا أَنْظُرُ إِلَى وَجْهِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ فَمَا نَزَلَ حَتَّى جَيَّشَ كُلُّ مِيزَابٍ بِالْمَدِينَةِ فَأَذْكُرُ قَوْلَ الشَّاعِرِ وَأَبْيَضَ يُسْتَسْقَى الْغَمَامُ بِوَجْهِهِثِمَالُ الْيَتَامَى عِصْمَةٌ لِلْأَرَامِلِوَهُوَ قَوْلُ أَبِي طَالِبٍ",
                "id": "Telah menceritakan kepada kami [Ahmad Ibnul Azhar] berkata, telah menceritakan kepada kami [Abu An Nadlr] berkata, telah menceritakan kepada kami [Abu Aqil] dari [Umar bin Hamzah] berkata, telah menceritakan kepada kami [Salim] dari [Bapaknya] ia berkata, \"Aku ingat perkataan sya'ir ketika memperhatikan wajah Rasulullah shallallahu 'alaihi wasallam di atas mimbar, dan beliau tidak turun dari atas mimbar kecuali semua saluran air di Madinah penuh dengan air. Aku mengingat perkataan sya'ir, \"Orang yang berkulit putih (Rasulullah), dengan wajahnya hujan di minta, penyantun anak yatim dan pelindung kaum janda. \" Itu adalah ucapan Abu Thalib. "
            },
            {
                "number": 1230,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ عَنْ عَطَاءٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُأَشْهَدُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى قَبْلَ الْخُطْبَةِ ثُمَّ خَطَبَ فَرَأَى أَنَّهُ لَمْ يُسْمِعْ النِّسَاءَ فَأَتَاهُنَّ فَذَكَّرَهُنَّ وَوَعَظَهُنَّ وَأَمَرَهُنَّ بِالصَّدَقَةِ وَبِلَالٌ قَائِلٌ بِيَدَيْهِ هَكَذَا فَجَعَلَتْ الْمَرْأَةُ تُلْقِي الْخُرْصَ وَالْخَاتَمَ وَالشَّيْءَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Sufyan bin Uyainah] dari [Ayyub] dari ['Atho`] berkata; aku mendengar [Ibnu Abbas] berkata, \"Aku bersaksi atas Rasulullah shallallahu 'alaihi wasallam bahwa beliau sholat sebelum khutbah, setelah itu berkhutbah. Beliau merasa bahwa suaranya tidak dapat didengar oleh kaum wanita, maka beliau pun mendatangi mereka seraya mengingatkan, memberi tausiah dan memerintahkan mereka untuk bersedekah. Bilal berkata dengan isyarat tangannya seperti ini, hingga kaum wanita pun memberikan anting, cincin dan sesuatu yang lain. \""
            },
            {
                "number": 1231,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ عَنْ الْحَسَنِ بْنِ مُسْلِمٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى يَوْمَ الْعِيدِ بِغَيْرِ أَذَانٍ وَلَا إِقَامَةٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Khallad Al Bahili] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] dari [Al Hasan bin Muslim] dari [Thawus] dari [Ibnu Abbas] berkata, \"Nabi shallallahu 'alaihi wasallam pada hari ied melaksanakan sholat tanpa adzan dan iqamah. \""
            },
            {
                "number": 1232,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِسْمَعِيلَ بْنِ رَجَاءٍ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ و عَنْ قَيْسِ بْنِ مُسْلِمٍ عَنْ طَارِقِ بْنِ شِهَابٍ عَنْ أَبِي سَعِيدٍ قَالَأَخْرَجَ مَرْوَانُ الْمِنْبَرَ يَوْمَ الْعِيدِ فَبَدَأَ بِالْخُطْبَةِ قَبْلَ الصَّلَاةِ فَقَامَ رَجُلٌ فَقَالَ يَا مَرْوَانُ خَالَفْتَ السُّنَّةَ أَخْرَجْتَ الْمِنْبَرَ يَوْمَ عِيدٍ وَلَمْ يَكُنْ يُخْرَجُ بِهِ وَبَدَأْتَ بِالْخُطْبَةِ قَبْلَ الصَّلَاةِ وَلَمْ يَكُنْ يُبْدَأُ بِهَا فَقَالَ أَبُو سَعِيدٍ أَمَّا هَذَا فَقَدْ قَضَى مَا عَلَيْهِ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ رَأَى مُنْكَرًا فَاسْتَطَاعَ أَنْ يُغَيِّرَهُ بِيَدِهِ فَلْيُغَيِّرْهُ بِيَدِهِ فَإِنْ لَمْ يَسْتَطِعْ فَبِلِسَانِهِ فَإِنْ لَمْ يَسْتَطِعْ بِلِسَانِهِ فَبِقَلْبِهِ وَذَلِكَ أَضْعَفُ الْإِيمَانِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Isma'il bin Raja`] dari [Bapaknya] dari [Abu Sa'id]. (dalam jalur lain disebutkan) Dari [Qais bin Muslim] dari [Thariq bin Syihab] dari [Abu Sa'id] berkata; Marwan mengeluarkan mimbar di hari ied dan memulai khutbah sebelum melaksanakan sholat, maka seorang laki-laki berdiri dan berkata, \"Wahai Marwan, engkau telah menyelisihi sunnah! Engkau keluarkan mimbar padahal ia belum pernah dikeluarkan sebelumnya, dan engkau memulai dengan khutbah padahal itu belum pernah dilakukan sebelumnya. \" Lalu Abu Sa'id berkata, \"Adapun orang ini, sungguh ia telah melaksanakan apa yang aku dengar dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa melihat kemungkaran dan mampu untuk mengubah dengan tangannya hendaklah ia ubah dengan tangannya. Jika tidak mampu hendaklah dengan lisannya, jika tidak mampu dengan tangan hendaklah dengan hatinya. Dan itu adalah selemah-lemah iman. \""
            },
            {
                "number": 1233,
                "arab": "حَدَّثَنَا حَوْثَرَةُ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ أَبُو بَكْرٍ ثُمَّ عُمَرُ يُصَلُّونَ الْعِيدَ قَبْلَ الْخُطْبَةِ",
                "id": "Telah menceritakan kepada kami [Hautsarah bin Muhammad] berkata, telah menceritakan kepada kami [Abu Usamah] berkata, telah menceritakan kepada kami [ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Nabi shallallahu 'alaihi wasallam, Abu Bakar dan Umar melaksanakan sholat ied sebelum khutbah. \""
            },
            {
                "number": 1234,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ مُؤَذِّنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنِي أَبِي عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُكَبِّرُ فِي الْعِيدَيْنِ فِي الْأُولَى سَبْعًا قَبْلَ الْقِرَاءَةِ وَفِي الْآخِرَةِ خَمْسًا قَبْلَ الْقِرَاءَةِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] berkata, telah menceritakan kepada kami ['Abdurrahman bin Sa'd bin Ammar bin Sa'd] -mu`adzin Rasulullah shallallahu 'alaihi wasallam- berkata, telah menceritakan kepadaku [Bapakku] dari [Bapaknya] dari [Kakeknya] berkata, \"Pada hari raya Rasulullah shallallahu 'alaihi wasallam bertakbir pada raka'at pertama sebanyak tujuh kali sebelum bacaan, dan pada raka'at kedua sebanyak lima kali. \" "
            },
            {
                "number": 1235,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَعْلَى عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبَّرَ فِي صَلَاةِ الْعِيدَيْنِ سَبْعًا وَخَمْسًا",
                "id": "Telah menceritakan kepada kami [Abu Kuraib Muhammad bin Al 'Ala] berkata, telah menceritakan kepada kami [Abdullah bin Mubarak] dari [Abdullah bin 'Abdurrahman bin Ya'la] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] berkata, \"Nabi shallallahu 'alaihi wasallam bertakbir sebanyak tujuh dan lima kali dalam sholat iedain (idul fitri dan idul adha). \""
            },
            {
                "number": 1236,
                "arab": "حَدَّثَنَا أَبُو مَسْعُودٍ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عَقِيلٍ حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ عَثْمَةَ حَدَّثَنَا كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبَّرَ فِي الْعِيدَيْنِ سَبْعًا فِي الْأُولَى وَخَمْسًا فِي الْآخِرَةِ",
                "id": "Telah menceritakan kepada kami [Abu Mas'ud Muhammad bin Abdullah bin 'Ubaid bin Aqil] berkata, telah menceritakan kepada kami [Muhammad bin Khalid bin 'Atsmah] berkata, telah menceritakan kepada kami [Katsir bin Abdullah bin Amru bin 'Auf] dari [Bapaknya] dari [Kakeknya] berkata, \"Rasulullah shallallahu 'alaihi wasallam bertakbir di dua sholat ied sebanyak tujuh kali di raka'at pertama dan lima kali di raka'at terakhir. \""
            },
            {
                "number": 1237,
                "arab": "حَدَّثَنَا حَرْمَلَةُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي ابْنُ لَهِيعَةَ عَنْ خَالِدِ بْنِ يَزِيدَ وَعُقَيْلٌ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبَّرَ فِي الْفِطْرِ وَالْأَضْحَى سَبْعًا وَخَمْسًا سِوَى تَكْبِيرَتَيْ الرُّكُوعِ",
                "id": "Telah menceritakan kepada kami [Harmalah bin Yahya] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah mengabarkan kepadaku [Ibnu Lahi'ah] dari [Khalid bin Yazid] dan [Uqail] dari [Ibnu Syihab] dari [Urwah] dari ['Aisyah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bertakbir pada sholat idul fitri dan adha sebanyak tujuh dan lima kali, selain dua takbir rukuk. \""
            },
            {
                "number": 1238,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الْعِيدَيْنِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Sufyan bin Uyainah] dari [Ibrahim bin Muhammad Ibnul Muntasyir] dari [Bapaknya] dari [Habib bin Salim] dari [An Nu'man bin Basyir] berkata, \"Rasulullah shallallahu 'alaihi wasallam membaca SABBIHISMA RABBIKAL A'LAA (Sucikanlah nama Tuhanmu Yang Maha Tinggi) dan HAL ATAAKA HADIITSUL GHAASYIYAH (Sudah datangkah kepadamu berita (tentang) hari pembalasan?) dalam dua sholat ied. \""
            },
            {
                "number": 1239,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ قَالَخَرَجَ عُمَرُ يَوْمَ عِيدٍ فَأَرْسَلَ إِلَى أَبِي وَاقِدٍ اللَّيْثِيِّ بِأَيِّ شَيْءٍ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي مِثْلِ هَذَا الْيَوْمِ قَالَ بِقَافْ وَاقْتَرَبَتْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Sufyan] dari [Dlamrah bin Sa'id] dari [ubaidhullah bin Abdullah] berkata, \"Pada hari ied Umar keluar, lalu ia mengutus utusan kepada Abu Waqid untuk menanyakan surat apa yang dibaca Nabi shallallahu 'alaihi wasallam di hari ied. [Abu Waqid berkata], \"Beliau membaca QAAF dan WAQTARABAT. \""
            },
            {
                "number": 1240,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا وَكِيعُ بْنُ الْجَرَّاحِ حَدَّثَنَا مُوسَى بْنُ عُبَيْدَةَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ كَانَ يَقْرَأُ فِي الْعِيدَيْنِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Khallad Al Bahili] berkata, telah menceritakan kepada kami [Waki' bin Al Jarrah] berkata, telah menceritakan kepada kami [Musa bin 'Ubaidah] dari [Muhammad bin Amru bin 'Atho`] dari [Ibnu Abbas] berkata, \"Nabi shallallahu 'alaihi wasallam membaca SABBIHISMA RABBIKAL A'LAA (Sucikanlah nama Tuhanmu Yang Maha Tinggi) dan HAL ATAAKA HADIITSUL GHAASYIYAH (Sudah datangkah kepadamu berita (tentang) hari pembalasan?) dalam dua sholat ied. \""
            },
            {
                "number": 1241,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا وَكِيعٌ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ قَالَ رَأَيْتُ أَبَا كَاهِلٍ وَكَانَتْ لَهُ صُحْبَةٌ فَحَدَّثَنِي أَخِي عَنْهُ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى نَاقَةٍ وَحَبَشِيٌّ آخِذٌ بِخِطَامِهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Waki'] dari [Isma'il bin Abu Khalid] berkata; Aku melihat Abu Kahil -ia pernah bersahabat dengan Rasulullah-, [saudaraku] pernah menceritakan hadits kepadaku dari [Abu Kahil], ia berkata, \"Aku melihat Nabi shallallahu 'alaihi wasallam berkhutbah di atas unta, sementara seorang Habsyi memegang tali kekangnya. \""
            },
            {
                "number": 1242,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ عَائِذٍ هُوَ أَبُو كَاهِلٍ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى نَاقَةٍ حَسْنَاءَ وَحَبَشِيٌّ آخِذٌ بِخِطَامِهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Muhammad bin Ubaid] berkata, telah menceritakan kepada kami [Isma'il bin Abu Khalid] dari [Qais bin 'A`idz] -yakni Abu Kahil- ia berkata, \"Aku melihat Nabi shallallahu 'alaihi wasallam berkhutbah di atas unta yang bagus, sementara seorang Habsyi memegang tali kekangnya. \""
            },
            {
                "number": 1243,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سَلَمَةَ بْنِ نُبَيْطٍ عَنْ أَبِيهِأَنَّهُ حَجَّ فَقَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى بَعِيرِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki'] dari [Salamah bin Nubaith] dari [Bapaknya] Bahwasanya ia pernah melaksanakan haji, ia berkata, \"Aku melihat Nabi shallallahu 'alaihi wasallam berkhutbah di atas untanya. \""
            },
            {
                "number": 1244,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ الْمُؤَذِّنِ حَدَّثَنِي أَبِي عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَبِّرُ بَيْنَ أَضْعَافِ الْخُطْبَةِ يُكْثِرُ التَّكْبِيرَ فِي خُطْبَةِ الْعِيدَيْنِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] berkata, telah menceritakan kepada kami ['Abdurrahman bin Sa'd bin 'Ammar bin Sa'a] -mu`adzin Rasulullah shallallahu 'alaihi wasallam- berkata, telah menceritakan kepadaku [Bapakku] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Nabi shallallahu 'alaihi wasallam bertakbir di tengah-tengah khutbah, beliau memperbanyak takbir pada khutbah dua hari raya. \" "
            },
            {
                "number": 1245,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ أَخْبَرَنِي أَبُو سَعِيدٍ الْخُدْرِيُّ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ يَوْمَ الْعِيدِ فَيُصَلِّي بِالنَّاسِ رَكْعَتَيْنِ ثُمَّ يُسَلِّمُ فَيَقِفُ عَلَى رِجْلَيْهِ فَيَسْتَقْبِلُ النَّاسَ وَهُمْ جُلُوسٌ فَيَقُولُ تَصَدَّقُوا تَصَدَّقُوا فَأَكْثَرُ مَنْ يَتَصَدَّقُ النِّسَاءُ بِالْقُرْطِ وَالْخَاتَمِ وَالشَّيْءِ فَإِنْ كَانَتْ حَاجَةٌ يُرِيدُ أَنْ يَبْعَثَ بَعْثًا يَذْكُرُهُ لَهُمْ وَإِلَّا انْصَرَفَ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Abu Usamah] berkata, telah menceritakan kepada kami [Dawud bin Qais] dari ['Iyadh bin Abdullah] berkata, telah mengabarkan kepadaku [Abu Sa'id Al Khudri] ia berkata, \"Pada hari ied Rasulullah shallallahu 'alaihi wasallam keluar dan sholat dua raka'at bersama manusia kemudian salam. Setelah itu beliau berdiri di atas kedua kakinya, beliau menghadap ke arah manusia yang sedang duduk seraya bersabda: \"Bersedekahlah kalian, bersedekahlah kalian, bersedekahlah kalian, \" maka yang paling banyak bersedekah adalah kaum wanita, dengan anting, cincin dan sesuatu. \" Jika ada suatu keperluan untuk mengirim pasukan, beliau menyebutkannya kepada mereka, dan jika tidak maka beliau langsung pergi berlalu. \" "
            },
            {
                "number": 1246,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا أَبُو بَحْرٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ مُسْلِمٍ الْخَوْلَانِيُّ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فِطْرٍ أَوْ أَضْحَى فَخَطَبَ قَائِمًا ثُمَّ قَعَدَ قَعْدَةً ثُمَّ قَامَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Abu Bahr] berkata, telah menceritakan kepada kami [Isma'il bin Muslim Al Khaulani] berkata, telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam keluar pada hari raya idul fitri atau adha, beliau lalu berkhutbah dengan berdiri, kemudian duduk sejenak, kemudian bangun. \" "
            },
            {
                "number": 1247,
                "arab": "حَدَّثَنَا هَدِيَّةُ بْنُ عَبْدِ الْوَهَّابِ وَعَمْرُو بْنُ رَافِعٍ الْبَجَلِيُّ قَالَا حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ قَالَحَضَرْتُ الْعِيدَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِنَا الْعِيدَ ثُمَّ قَالَ قَدْ قَضَيْنَا الصَّلَاةَ فَمَنْ أَحَبَّ أَنْ يَجْلِسَ لِلْخُطْبَةِ فَلْيَجْلِسْ وَمَنْ أَحَبَّ أَنْ يَذْهَبَ فَلْيَذْهَبْ",
                "id": "Telah menceritakan kepada kami [Hadiyyah bin Abdul Wahhab] dan [Amru bin Rafi' Al Bajali] keduanya berkata; telah menceritakan kepada kami [Al Fadll bin Musa] berkata, telah menceritakan kepada kami [Ibnu Juraij] dari ['Atho`] dari [Abdullah bin As Sa`ib] ia berkata, \"Aku pernah menghadiri sholat ied bersama Rasulullah shallallahu 'alaihi wasallam, beliau sholat 'ied bersama kami kemudian bersabda: \"Kita telah selesai melaksanakan sholat, maka barangsiapa ingin duduk mendengar khutbah hendaklah ia duduk, dan barangsiapa ingin pergi hendaklah ia pergi. \" "
            },
            {
                "number": 1248,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا شُعْبَةُ حَدَّثَنِي عَدِيُّ بْنُ ثَابِتٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فَصَلَّى بِهِمْ الْعِيدَ لَمْ يُصَلِّ قَبْلَهَا وَلَا بَعْدَهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah menceritakan kepadaku [Adi bin Tsabit] dari [Sa'id bin Jubair] dari [Ibnu Abbas] berkata, \"Rasulullah shallallahu 'alaihi wasallam berangkat dan melaksanakan sholat ied bersama para sahabat, namun beliau tidak mengerjakan sholat (sunnah) sebelum dan sesudahnya. \""
            },
            {
                "number": 1249,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الطَّائِفِيُّ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يُصَلِّ قَبْلَهَا وَلَا بَعْدَهَا فِي عِيدٍ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Abdullah bin 'Abdurrahman Ath Tha`ifi] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] berkata, \"Di hari ied Nabi shallallahu 'alaihi wasallam tidak sholat baik sebelum maupun sesudahnya. \""
            },
            {
                "number": 1250,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا الْهَيْثَمُ بْنُ جَمِيلٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو الرَّقِّيِّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُصَلِّي قَبْلَ الْعِيدِ شَيْئًا فَإِذَا رَجَعَ إِلَى مَنْزِلِهِ صَلَّى رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Al Haitsam bin Jamil] dari [ubaidhullah bin Amru Ar Raqi] berkata, telah menceritakan kepada kami [Abdullah bin Muhammad bin Aqil] dari ['Atho` bin Yasar] dari [Abu Sa'id Al Khudri] berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak melaksanakan sholat apapun sebelum sholat ied, dan jika telah sampai di rumahnya beliau sholat dua raka'at. \""
            },
            {
                "number": 1251,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ حَدَّثَنِي أَبِي عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْرُجُ إِلَى الْعِيدِ مَاشِيًا وَيَرْجِعُ مَاشِيًا",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] berkata, telah menceritakan kepada kami ['Abdurrahman bin Sa'd bin 'Ammar bin Sa'd] berkata, telah menceritakan kepadaku [Bapakku] dari [Bapaknya] dari [Kakeknya] berkata, \"Nabi shallallahu 'alaihi wasallam berangkat menuju sholat ied dengan berjalan, demikian juga ketika kembali. \""
            },
            {
                "number": 1252,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ الْعُمَرِيُّ عَنْ أَبِيهِ وَعُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ إِلَى الْعِيدِ مَاشِيًا وَيَرْجِعُ مَاشِيًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami ['Abdurrahman bin Abdullah Al Umari] dari [Bapaknya] dan [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam berangkat menuju sholat ied dengan berjalan, demikian juga ketika kembali. \" "
            },
            {
                "number": 1253,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ قَالَإِنَّ مِنْ السُّنَّةِ أَنْ يُمْشَى إِلَى الْعِيدِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Abu Dawud] berkata, telah menceritakan kepada kami [Zuhair] dari [Abu Ishaq] dari [Al Harits] dari [Ali] ia berkata, \"Termasuk dari sunnah adalah berjalan kaki menuju sholat ied. \""
            },
            {
                "number": 1254,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْخَطَّابِ حَدَّثَنَا مِنْدَلٌ عَنْ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْتِي الْعِيدَ مَاشِيًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah menceritakan kepada kami [Abdul Aziz bin Al Khaththab] berkata, telah menceritakan kepada kami [Mindal] dari [Muhammad bin ubaidhullah bin Abu Rafi'] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mendatangi sholat ied dengan berjalan kaki. \""
            },
            {
                "number": 1255,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَعْدِ بْنِ عَمَّارِ بْنِ سَعْدٍ أَخْبَرَنِي أَبِي عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ إِلَى الْعِيدَيْنِ سَلَكَ عَلَى دَارِ سَعِيدِ بْنِ أَبِي الْعَاصِ ثُمَّ عَلَى أَصْحَابِ الْفَسَاطِيطِ ثُمَّ انْصَرَفَ فِي الطَّرِيقِ الْأُخْرَى طَرِيقِ بَنِي زُرَيْقٍ ثُمَّ يَخْرُجُ عَلَى دَارِ عَمَّارِ بْنِ يَاسِرٍ وَدَارِ أَبِي هُرَيْرَةَ إِلَى الْبَلَاطِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] berkata, telah menceritakan kepada kami ['Abdurrahman bin Sa'd bin Ammar bin Sa'd] berkata, telah mengabarkan kepadaku [Bapakku] dari [Bapaknya] dari [Kakeknya] berkata, \"Jika Nabi shallallahu 'alaihi wasallam berangkat menuju sholat idul fitri dan idul adha, beliau melintasi depan rumah Sa'id bin Abu Al 'Ash, kemudian melintasi para penghuni tenda, kemudian pergi ke jalan yang lain, yaitu jalan bani Zuraiq dan keluar melalui rumah Ammar bin Yasir, rumah Abu Hurairah hingga ke Al Balath (nama tempat). \" "
            },
            {
                "number": 1256,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا أَبُو قُتَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّهُ كَانَ يَخْرُجُ إِلَى الْعِيدِ فِي طَرِيقٍ وَيَرْجِعُ فِي أُخْرَى وَيَزْعُمُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Abu Qutaibah] berkata, telah menceritakan kepada kami [Abdullah bin Umar] dari [Nafi'] dari [Ibnu Umar] bahwasanya ia berangkat menuju 'ied melalui satu jalan, dan kembali dengan jalan lain. Dan ia meyakini bahwa Rasulullah shallallahu 'alaihi wasallam melakukan itu. \""
            },
            {
                "number": 1257,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ الْأَزْهَرِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْخَطَّابِ حَدَّثَنَا مِنْدَلٌ عَنْ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْتِي الْعِيدَ مَاشِيًا وَيَرْجِعُ فِي غَيْرِ الطَّرِيقِ الَّذِي ابْتَدَأَ فِيهِ",
                "id": "Telah menceritakan kepada kami [Ahmad Ibnul Azhar] berkata, telah menceritakan kepada kami [Abdul Aziz Ibnul Khaththab] berkata, telah menceritakan kepada kami [Mindal] dari [Muhammad bin ubaidhullah bin Abu Rafi'] dari [bapaknya] dari [Kakeknya] berkata, \"Nabi shallallahu 'alaihi wasallam berangkat sholat ied dengan berjalan kaki, dan beliau kembali pulang dengan menggunakan jalur lain. \""
            },
            {
                "number": 1258,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ حَدَّثَنَا أَبُو تُمَيْلَةَ عَنْ فُلَيْحِ بْنِ سُلَيْمَانَ عَنْ سَعِيدِ بْنِ الْحَارِثِ الزُّرَقِيِّ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ إِلَى الْعِيدِ رَجَعَ فِي غَيْرِ الطَّرِيقِ الَّذِي أَخَذَ فِيهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Humaid] berkata, telah menceritakan kepada kami [Abu Tumailah] dari [Fulaih bin Sulaim] dari [Sa'id bin Al Harits Az Zuraqi] dari [Abu Hurairah] berkata, \"Jika Nabi shallallahu 'alaihi wasallam keluar menuju sholat ied, maka beliau kembali pulang dengan jalur lain. \""
            },
            {
                "number": 1259,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا شَرِيكٌ عَنْ مُغِيرَةَ عَنْ عَامِرٍ قَالَشَهِدَ عِيَاضٌ الْأَشْعَرِيُّ عِيدًا بِالْأَنْبَارِ فَقَالَ مَا لِي لَا أَرَاكُمْ تُقَلِّسُونَ كَمَا كَانَ يُقَلَّسُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] berkata, telah menceritakan kepada kami [Syarik] dari [Mughirah] dari [Amir] ia berkata, \" ['Iyadl Al Asy'ari] menghadiri sholat ied di Al Ambar, ia lalu berkata, \"Kenapa aku tidak melihat kalian memukul rebana, sebagaimana pernah dilakukan pula di sisi Rasulullah shallallahu 'alaihi wasallam?\" "
            },
            {
                "number": 1260,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا أَبُو نُعَيْمٍ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ عَامِرٍ عَنْ قَيْسِ بْنِ سَعْدٍ قَالَمَا كَانَ شَيْءٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا وَقَدْ رَأَيْتُهُ إِلَّا شَيْءٌ وَاحِدٌ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُقَلَّسُ لَهُ يَوْمَ الْفِطْرِقَالَ أَبُو الْحَسَنِ بْنُ سَلَمَةَ الْقَطَّانُ حَدَّثَنَا ابْنُ دِيزِيلَ حَدَّثَنَا آدَمُ حَدَّثَنَا شَيْبَانُ عَنْ جَابِرٍ عَنْ عَامِرٍ ح وَحَدَّثَنَا إِسْرَائِيلُ عَنْ جَابِرٍ ح وَحَدَّثَنَا إِبْرَاهِيمُ بْنُ نَصْرٍ حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ عَامِرٍ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Abu Nu'aim] dari [Isra'il] dari [Abu Ishaq] dari [Amir] dari [Qais bin Sa'd] ia berkata; Segala sesuatu yang terjadi di masa Rasulullah shallallahu 'alaihi wasallam aku telah menyaksikannya, kecuali satu hal. Yakni, pada hari idul fitri Rasulullah shallallahu 'alaihi wasallam di sambut dengan rebana. \" Abul Hasan bin Salamah Al Qaththan berkata; telah menceritakan kepada kami Ibnu Dizil, berkata; telah menceritakan kepada kami Adam, berkata; telah menceritakan kepada kami Syaiban, berkata; Jabir dari Amir. (dalam jalur lain disebutkan) Telah menceritakan kepada kami Isra'il dari Jabir. (dalam jalur lain disebutkan) Telah menceritakan kepada kami Ibrahim bin Nashr, berkata; telah menceritakan kepada kami Abu Nu'aim, berkata; telah menceritakan kepada kami Syarik, dari Ishaq, dari Amir sebagaimana dalam hadits. \""
            },
            {
                "number": 1261,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ ح و حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَا حَدَّثَنَا الْأَوْزَاعِيُّ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْدُو إِلَى الْمُصَلَّى فِي يَوْمِ الْعِيدِ وَالْعَنَزَةُ تُحْمَلُ بَيْنَ يَدَيْهِ فَإِذَا بَلَغَ الْمُصَلَّى نُصِبَتْ بَيْنَ يَدَيْهِ فَيُصَلِّي إِلَيْهَا وَذَلِكَ أَنَّ الْمُصَلَّى كَانَ فَضَاءً لَيْسَ فِيهِ شَيْءٌ يُسْتَتَرُ بِهِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Isa bin Yunus]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] keduanya berkata; telah menceritakan kepada kami [Al Auza'i] berkata, telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar] berkata, \"Di pagi menjelang siang Rasulullah shallallahu 'alaihi wasallam berangkat melaksanakan sholat ied, sementara beliau membawa tombak kecil. Ketika sampai di tempat lapang, tombak kecil itu ditancapkan di hadapannya kemudian beliau sholat menghadapnya. Hal itu karena tanah lapang adalah tempat yang terbuka dan tidak ada sesuatu yang menutupinya. \""
            },
            {
                "number": 1262,
                "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى يَوْمَ عِيدٍ أَوْ غَيْرَهُ نُصِبَتْ الْحَرْبَةُ بَيْنَ يَدَيْهِ فَيُصَلِّي إِلَيْهَا وَالنَّاسُ مِنْ خَلْفِهِقَالَ نَافِعٌ فَمِنْ ثَمَّ اتَّخَذَهَا الْأُمَرَاءُ",
                "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] berkata, telah menceritakan kepada kami [Ali bin Mushir] dari [Ubaidulah] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Jika Nabi shallallahu 'alaihi wasallam sholat di hari ied atau selainnya, beliau menancapkan tombak kecil di depannya, lalu beliau sholat menghadapnya sementara orang-orang di belakangnya. \" Nafi' berkata, \"Hal itu juga dilakukan oleh para umara (pemimpin-pemimpin). \" "
            },
            {
                "number": 1263,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلَالٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الْعِيدَ بِالْمُصَلَّى مُسْتَتِرًا بِحَرْبَةٍ",
                "id": "Telah menceritakan kepada kami [Harun bin Sa'id Al Aili] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah mengabarkan kepadaku [Sulaiman bin Bilal] dari [Yahya bin Sa'id] dari [Anas bin Malik] berkata, \"Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat 'ied di tanah lapang dengan menjadikan tombak sebagai satirnya. \" "
            },
            {
                "number": 1264,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَ قَالَتْأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُخْرِجَهُنَّ فِي يَوْمِ الْفِطْرِ وَالنَّحْرِ قَالَ قَالَتْ أُمُّ عَطِيَّةَ فَقُلْنَا أَرَأَيْتَ إِحْدَاهُنَّ لَا يَكُونُ لَهَا جِلْبَابٌ قَالَ فَلْتُلْبِسْهَا أُخْتُهَا مِنْ جِلْبَابِهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Usamah] dari [Hisyam bin Hassan] dari [Hafshah binti Sirin] dari [Ummu Athiah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan agar kami mengeluarkan mereka di hari raya idul fitri dan idul adha. \" Ia berkata, \"Ummu Athiah berkata, \"kami bertanya, \"Bagaimana pendapat tuan jika salah seorang dari kami tidak mempunyai jilbab?\" beliau menjawab: \"Hendaklah saudara wanitanya memakaikan dari jilbab miliknya. \""
            },
            {
                "number": 1265,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ ابْنِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْرِجُوا الْعَوَاتِقَ وَذَوَاتِ الْخُدُورِ لِيَشْهَدْنَ الْعِيدَ وَدَعْوَةَ الْمُسْلِمِينَ وَلْيَجْتَنِبَنَّ الْحُيَّضُ مُصَلَّى النَّاسِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Sufyan] dari [Ayyub] dari [Ibnu Sirin] dari [Ummu Athiah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Keluarkanlah para wanita-wanita belia (gadis) dan wanita berhijab untuk menghadiri sholat ied dan do`a kaum muslimin. Dan jauhkanlah wanita haid dari tempat sholat. \""
            },
            {
                "number": 1266,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ حَدَّثَنَا حَجَّاجُ بْنُ أَرْطَاةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُخْرِجُ بَنَاتِهِ وَنِسَاءَهُ فِي الْعِيدَيْنِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] berkata, telah menceritakan kepada kami [Hafsh bin Ghiyats] berkata, telah menceritakan kepada kami [Hajjaj bin Arthah] dari ['Abdurrahman bin Abis] dari [Ibnu Abbas] berkata, \"Nabi shallallahu 'alaihi wasallam mengajak anak-anak wanita dan isteri-isterinya di dua hari ied. \""
            },
            {
                "number": 1267,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا إِسْرَائِيلُ عَنْ عُثْمَانَ بْنِ الْمُغِيرَةِ عَنْ إِيَاسِ بْنِ أَبِي رَمْلَةَ الشَّامِيِّ قَالَسَمِعْتُ رَجُلًا سَأَلَ زَيْدَ بْنَ أَرْقَمَ هَلْ شَهِدْتَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِيدَيْنِ فِي يَوْمٍ قَالَ نَعَمْ قَالَ فَكَيْفَ كَانَ يَصْنَعُ قَالَ صَلَّى الْعِيدَ ثُمَّ رَخَّصَ فِي الْجُمُعَةِ ثُمَّ قَالَ مَنْ شَاءَ أَنْ يُصَلِّيَ فَلْيُصَلِّ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Abu Ahmad] berkata, telah menceritakan kepada kami [Isra'il] dari [Utsman Ibnul Mughirah] dari [Iyas bin Abu Armalah Asy Syami] berkata; Aku mendengar seorang laki-laki bertanya kepada [Zaid bin Arqam], \"Apakah kamu bersama Rasulullah shallallahu 'alaihi wasallam pernah menyaksikan dua hari raya dalam satu hari?\" ia menjawab, \"Ya, \" laki-laki itu berkata, \"Lalu apa yang dilakukan oleh Rasulullah?\" ia menjawab, \"Beliau melaksanakan sholat ied dan memberikan keringanan untuk melaksanakan sholat jum'at, setelah itu beliau mengatakan: \"Barangsiapa ingin melaksanakan sholat (jum'at), silahkan mengerjakannya.\""
            },
            {
                "number": 1268,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ حَدَّثَنَا شُعْبَةُ حَدَّثَنِي مُغِيرَةُ الضَّبِّيُّ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ أَبِي صَالِحٍ عَنْ ابْنِ عَبَّاسٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ اجْتَمَعَ عِيدَانِ فِي يَوْمِكُمْ هَذَا فَمَنْ شَاءَ أَجْزَأَهُ مِنْ الْجُمُعَةِ وَإِنَّا مُجَمِّعُونَ إِنْ شَاءَ اللَّهُحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ رَبِّهِ حَدَّثَنَا بَقِيَّةُ حَدَّثَنَا شُعْبَةُ حَدَّثَنِي مُغِيرَةُ الضَّبِّيُّ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mushaffa Al Himshi] berkata, telah menceritakan kepada kami [Baqiyyah] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah menceritakan kepadaku [Mughirah Adl Dlabbi] dari [Abdul Aziz bin Rafi'] dari [Abu Shalih] dari [Ibnu Abbas] dari Rasulullah shallallahu 'alaihi wasallam, bahwasanya beliau bersabda: \"Pada hari kalian ini telah terkumpul dua hari raya, barangsiapa berkehendak, ia tidak perlu lagi sholat jum'at, namun kami akan melaksanakannya, jika Allah menghendaki. \" Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Yazid bin Abdu Rabbih] berkata, telah menceritakan kepada kami [Baqiyyah] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah menceritakan kepadaku [Mughirah Adl Dlabbi] dari [Abdul Aziz bin Rufai'] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits. \""
            },
            {
                "number": 1269,
                "arab": "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ حَدَّثَنَا مِنْدَلُ بْنُ عَلِيٍّ عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَاجْتَمَعَ عِيدَانِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِالنَّاسِ ثُمَّ قَالَ مَنْ شَاءَ أَنْ يَأْتِيَ الْجُمُعَةَ فَلْيَأْتِهَا وَمَنْ شَاءَ أَنْ يَتَخَلَّفَ فَلْيَتَخَلَّفْ",
                "id": "Telah menceritakan kepada kami [Jubarah bin Al Mughallis] berkata, telah menceritakan kepada kami [Mindal bin Ali] dari [Abdul Aziz bin Umar] dari [Nafi'] dari [Ibnu Umar] dia berkata, \"Dua hari raya terkumpul menjadi satu pada masa Rasulullah shallallahu 'alaihi wasallam, Rasulullah shallallahu 'alaihi wasallam kemudian sholat bersama orang-orang, lalu bersabda: \"Barangsiapa ingin mendatangi jum'at hendaklah ia mendatanginya, dan barangsiapa ingin meninggalkannya hendaklah ia tinggalkan. \" "
            },
            {
                "number": 1270,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا عِيسَى بْنُ عَبْدِ الْأَعْلَى بْنِ أَبِي فَرْوَةَ قَالَ سَمِعْتُ أَبَا يَحْيَى عُبَيْدَ اللَّهِ التَّيْمِيَّ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ قَالَأَصَابَ النَّاسَ مَطَرٌ فِي يَوْمِ عِيدٍ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِهِمْ فِي الْمَسْجِدِ",
                "id": "Telah menceritakan kepada kami [Al 'Abbas bin Utsman Ad Dimasyqi] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Isa bin Abdul A'la bin Abu Farwah] ia berkata; Aku mendengar [Abu Yahya ubaidhullah At Taimi] menceritakan hadits dari [Abu Hurairah] ia berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam orang-orang diguyur hujan di hari raya, maka beliau pun sholat bersama mereka di masjid. \" "
            },
            {
                "number": 1271,
                "arab": "حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدٍ حَدَّثَنَا نَائِلُ بْنُ نَجِيحٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ زِيَادٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُلْبَسَ السِّلَاحُ فِي بِلَادِ الْإِسْلَامِ فِي الْعِيدَيْنِ إِلَّا أَنْ يَكُونُوا بِحَضْرَةِ الْعَدُوِّ",
                "id": "Telah menceritakan kepada kami [Abdul Quddus bin Muhammad] berkata, telah menceritakan kepada kami [Na`il bin Najih] berkata, telah menceritakan kepada kami [Isma'il bin Ziyad] dari [Ibnu Juraij] dari ['Atho`] dari [Ibnu Abbas] berkata, \"Nabi shallallahu 'alaihi wasallam melarang menenteng senjata di negeri-negeri Islam pada dua hari raya, kecuali mereka berhadapan dengan musuh. \""
            },
            {
                "number": 1272,
                "arab": "حَدَّثَنَا جُبَارَةُ بْنُ الْمُغَلِّسِ حَدَّثَنَا حَجَّاجُ بْنُ تَمِيمٍ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلُ يَوْمَ الْفِطْرِ وَيَوْمَ الْأَضْحَى",
                "id": "Telah menceritakan kepada kami [Jubarah Al Mughallis] berkata, telah menceritakan kepada kami [Hajjaj bin Tamim] dari [Maimun bin Mihran] dari [Ibnu Abbas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam mandi pada hari raya idul Fitri dan idul adha. \""
            },
            {
                "number": 1273,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا يُوسُفُ بْنُ خَالِدٍ حَدَّثَنَا أَبُو جَعْفَرٍ الْخَطْمِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُقْبَةَ بْنِ الْفَاكِهِ بْنِ سَعْدٍ عَنْ جَدِّهِ الْفَاكِهِ بْنِ سَعْدٍ وَكَانَتْ لَهُ صُحْبَةٌأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْتَسِلُ يَوْمَ الْفِطْرِ وَيَوْمَ النَّحْرِ وَيَوْمَ عَرَفَةَوَكَانَ الْفَاكِهُ يَأْمُرُ أَهْلَهُ بِالْغُسْلِ فِي هَذِهِ الْأَيَّامِ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Yusuf bin Khalid] berkata, telah menceritakan kepada kami [Abu Ja'far Al Khathmi] dari ['Abdurrahman bin Uqbah Ibnul Fakih bin Sa'd] dari kakeknya [Al Fakih bin Sa'd] -ia seorang sahabat Nabi- berkata, \"Rasulullah shallallahu 'alaihi wasallam selalu mandi di hari idul fitri, idul adha dan hari Arafah, \" dan Al Fakih sendiri selalu memerintahkan keluarganya untuk mandi pada hari-hari itu. \""
            },
            {
                "number": 1274,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ الضَّحَّاكِ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنَا صَفْوَانُ بْنُ عَمْرٍو عَنْ يَزِيدَ بْنِ خُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍأَنَّهُ خَرَجَ مَعَ النَّاسِ يَوْمَ فِطْرٍ أَوْ أَضْحَى فَأَنْكَرَ إِبْطَاءَ الْإِمَامِ وَقَالَ إِنْ كُنَّا لَقَدْ فَرَغْنَا سَاعَتَنَا هَذِهِ وَذَلِكَ حِينَ التَّسْبِيحِ",
                "id": "Telah menceritakan kepada kami [Abdul Wahhab bin Adl Dlahhak] berkata, telah menceritakan kepada kami [Isma'il bin 'Ayyasy] berkata, telah menceritakan kepada kami [Shafwan bin Amru] dari [Yazid bin Khumair] dari [Abdullah bin Busr] Bahwasanya ia (Abdullah) bersama orang-orang berangkat pada hari raya idul Fitri, atau idul adha, ia mencela keterlambatan imam seraya mengatakan, \"Seharusnya kita telah selesai pada saat ini, dan itu tatkala tasbih. \""
            },
            {
                "number": 1275,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَنْبَأَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَنَسِ بْنِ سِيرِينَ عَنْ ابْنِ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنْ اللَّيْلِ مَثْنَى مَثْنَى",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah] berkata, telah memberitakan kepada kami [Hammad bin Zaid] dari [Anas bin Sirin] dari [Ibnu Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam sholat malam dua raka'at-dua raka'at. \""
            },
            {
                "number": 1276,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Al Laits bin Sa'd] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat malam itu dua raka'at-dua raka'at. \""
            },
            {
                "number": 1277,
                "arab": "حَدَّثَنَا سَهْلُ بْنُ أَبِي سَهْلٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ وَعَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ و عَنْ ابْنِ أَبِي لَبِيدٍ عَنْ أَبِي سَلَمَةَ عَنْ ابْنِ عُمَرَ و عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عُمَرَ قَالَسُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ فَقَالَ يُصَلِّي مَثْنَى مَثْنَى فَإِذَا خَافَ الصُّبْحَ أَوْتَرَ بِوَاحِدَةٍ",
                "id": "Telah menceritakan kepada kami [Sahl bin Abu Sahl] berkata, telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Salim] dari [Bapaknya] dan dari [Abdullah bin Dinar] dari [Ibnu Umar]. (dalam jalur lain disebutkan) dari [Ibnu Abu Labid] dari [Abu Salamah] dari [Ibnu Umar]. (dalam jalur lain disebutkan pula) dari [Amru bin Dinar] dari [Thawus] dari [Ibnu Umar] ia berkata, \"Nabi shallallahu 'alaihi wasallam ditanya tentang sholat malam, maka beliau pun menjawab: \"Hendaklah sholat dua raka'at-dua raka'at, jika khawatir datang subuh hendaklah witir satu raka'at. \""
            },
            {
                "number": 1278,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا عَثَّامُ بْنُ عَلِيٍّ عَنْ الْأَعْمَشِ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِاللَّيْلِ رَكْعَتَيْنِ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Waki'] berkata, telah menceritakan kepada kami [Atstsam bin Ali] dari [Al A'masy] dari [Habib bin Abu Tsabit] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata, \"Nabi shallallahu 'alaihi wasallam sholat malam dua raka'at-dua raka'at. \""
            },
            {
                "number": 1279,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَأَبُو بَكْرِ بْنُ خَلَّادٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ أَنَّهُ سَمِعَ عَلِيًّا الْأَزْدِيَّ يُحَدِّثُ أَنَّهُ سَمِعَ ابْنَ عُمَرَ يُحَدِّثُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ صَلَاةُ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَى",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki']. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Basysyar] dan [Abu Bakr bin Khallad] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] keduanya berkata; telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin 'Atho`] Bahwasanya ia mendengar [Ali Al Azdi] menceritakan, bahwasanya ia mendengar [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"sholat di waktu malam dan siang hari dua raka'at-dua raka'at. \""
            },
            {
                "number": 1280,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ رُمْحٍ أَنْبَأَنَا ابْنُ وَهْبٍ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ أُمِّ هَانِئٍ بِنْتِ أَبِي طَالِبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ صَلَّى سُبْحَةَ الضُّحَى ثَمَانِيَ رَكَعَاتٍ ثُمَّ سَلَّمَ مِنْ كُلِّ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad bin Rumh] berkata, telah memberitakan kepada kami [Ibnu Wahb] dari [Iyadl bin Abdullah] dari [Makhramah bin Sulaiman] dari [Kuraib] mantan pelayan Ibnu Abbas, dari [Ummu Hani` binti Abu Thalib] berkata, \"Pada pembukaan kota Makkah Rasulullah shallallahu 'alaihi wasallam sholat sunnah Dluha delapan raka'at, kemudian beliau salam pada setiap dua raka'at. \""
            },
            {
                "number": 1281,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ إِسْحَقَ الْهَمْدَانِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ أَبِي سُفْيَانَ السَّعْدِيِّ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ فِي كُلِّ رَكْعَتَيْنِ تَسْلِيمَةٌ",
                "id": "Telah menceritakan kepada kami [Harun bin Ishaq Al Hamdani] berkata, telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Abu Sufyan As Sa'di] dari [Abu Nadlrah] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Pada setiap dua raka'at ada salam. \""
            },
            {
                "number": 1282,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ حَدَّثَنَا شُعْبَةُ حَدَّثَنِي عَبْدُ رَبِّهِ بْنُ سَعِيدٍ عَنْ أَنَسِ بْنِ أَبِي أَنَسٍ عَنْ عَبْدِ اللَّهِ بْنِ نَافِعِ ابْنِ الْعَمْيَاءِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ الْمُطَّلِبِ يَعْنِي ابْنَ أَبِي وَدَاعَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى وَتَشَهَّدُ فِي كُلِّ رَكْعَتَيْنِ وَتَبَاءَسُ وَتَمَسْكَنُ وَتُقْنِعُ وَتَقُولُ اللَّهُمَّ اغْفِرْ لِي فَمَنْ لَمْ يَفْعَلْ ذَلِكَ فَهِيَ خِدَاجٌ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Syababah bin Sawwar] berkata, telah menceritakan kepada kami [Syu'bah] berkata, telah menceritakan kepadaku [Abdu Rabbih bin Sa'id] dari [Anas bin Abu Anas] dari [Abdullah bin Nafi' bin Al 'Amya] dari [Abdullah bin Al Harits] dari [Al Muthallib] -yaitu Ibnu Abu Wada'ah- ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat malam itu dua raka'at-dua raka'at, dan bertasyahud pada setiap dua raka'at. Hendaklah berlaku tunduk, butuh dan berqana'ah. Dan hendaklah engkau ucapkan, \"Ya Allah, ampunilah aku, \" barangsiapa tidak melakukannya, maka tidak sempurna. \" "
            },
            {
                "number": 1283,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ رَمَضَانَ وَقَامَهُ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Bisyr] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berpuasa dan sholat (malam) di bulan ramadhan karena iman dan mengharap pahala, maka dosanya yang lalu akan diampuni. \""
            },
            {
                "number": 1284,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا مَسْلَمَةُ بْنُ عَلْقَمَةَ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ الْجُرَشِيِّ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ الْحَضْرَمِيِّ عَنْ أَبِي ذَرٍّ قَالَصُمْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَضَانَ فَلَمْ يَقُمْ بِنَا شَيْئًا مِنْهُ حَتَّى بَقِيَ سَبْعُ لَيَالٍ فَقَامَ بِنَا لَيْلَةَ السَّابِعَةِ حَتَّى مَضَى نَحْوٌ مِنْ ثُلُثِ اللَّيْلِ ثُمَّ كَانَتْ اللَّيْلَةُ السَّادِسَةُ الَّتِي تَلِيهَا فَلَمْ يَقُمْهَا حَتَّى كَانَتْ الْخَامِسَةُ الَّتِي تَلِيهَا ثُمَّ قَامَ بِنَا حَتَّى مَضَى نَحْوٌ مِنْ شَطْرِ اللَّيْلِ فَقُلْتُ يَا رَسُولَ اللَّهِ لَوْ نَفَّلْتَنَا بَقِيَّةَ لَيْلَتِنَا هَذِهِ فَقَالَ إِنَّهُ مَنْ قَامَ مَعَ الْإِمَامِ حَتَّى يَنْصَرِفَ فَإِنَّهُ يَعْدِلُ قِيَامَ لَيْلَةٍ ثُمَّ كَانَتْ الرَّابِعَةُ الَّتِي تَلِيهَا فَلَمْ يَقُمْهَا حَتَّى كَانَتْ الثَّالِثَةُ الَّتِي تَلِيهَا قَالَ فَجَمَعَ نِسَاءَهُ وَأَهْلَهُ وَاجْتَمَعَ النَّاسُ قَالَ فَقَامَ بِنَا حَتَّى خَشِينَا أَنْ يَفُوتَنَا الْفَلَاحُ قِيلَ وَمَا الْفَلَاحُ قَالَ السُّحُورُ قَالَ ثُمَّ لَمْ يَقُمْ بِنَا شَيْئًا مِنْ بَقِيَّةِ الشَّهْرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu Asy Syawarib] berkata, telah menceritakan kepada kami [Maslamah bin Alqamah] dari [Dawud bin Abu Hind] dari [Al Walid bin 'Abdurrahman Al Jurasyi] dari [Jubair bin Nufair Al Hadlrami] dari [Abu Dzar] ia berkata, \"Kami puasa ramadhan bersama Rasulullah shallallahu 'alaihi wasallam, namun beliau tidak sholat malam sekalipun, hingga tersisa tujuh hari dari bulan tersebut. Beliau sholat malam bersama kami pada malam ke tujuh hingga lewat dari seperti malam. Pada malam ke enam beliau tidak sholat hingga masuk malam ke lima di hari berikutnya. Beliau lalu sholat malam bersama kami hingga lewat pertengahan malam. Aku berkata, \"Wahai Rasulullah, bagaimana jika sisa malam ini kita manfaatkan untuk sholat nafilah?\" beliau bersabda: \"Barangsiapa sholat bersama imam hingga selesai, sesungguhnya hal itu telah menyamai sholat satu malam penuh. \" Kemudian pada malam ke empat hari berikutnya beliau tidak sholat hingga masuk malam ke tiga di hari berikutnya. \" Abu Dzar berkata, \"Beliau mengumpulkan semua isteri dan keluarganya, dan orang-orang pun ikut berkumpul. \" Abu Dzar berkata, \"Beliau sholat bersama kami hingga kami khawatir kehilangan Al Falah, \" dikatakan kepadanya, \"Al Falah itu apa?\" ia menjawab, \"Sahur. \" Abu Dzar berkata, \"Setelah itu beliau tidak lagi sholat bersama kami hingga akhir bulan. \""
            },
            {
                "number": 1285,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ وَعُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ نَصْرِ بْنِ عَلِيٍّ الْجَهْضَمِيِّ عَنْ النَّضْرِ بْنِ شَيْبَانَ ح و حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ وَالْقَاسِمُ بْنُ الْفَضْلِ الْحُدَّانِيُّ كِلَاهُمَا عَنْ النَّضْرِ بْنِ شَيْبَانَ قَالَ لَقِيتُ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ فَقُلْتُ حَدِّثْنِي بِحَدِيثٍ سَمِعْتَهُ مِنْ أَبِيكَ يَذْكُرُهُ فِي شَهْرِ رَمَضَانَ قَالَ نَعَمْ حَدَّثَنِي أَبِيأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ شَهْرَ رَمَضَانَ فَقَالَ شَهْرٌ كَتَبَ اللَّهُ عَلَيْكُمْ صِيَامَهُ وَسَنَنْتُ لَكُمْ قِيَامَهُ فَمَنْ صَامَهُ وَقَامَهُ إِيمَانًا وَاحْتِسَابًا خَرَجَ مِنْ ذُنُوبِهِ كَيَوْمِ وَلَدَتْهُ أُمُّهُ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dan ['ubaidhullah bin Musa] berkata, telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] dari [Nadlr bin Syaiban]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Abu Dawud] berkata, telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] dan [Qasim bin Fadhl Al Huddani] keduanya dari [Nadlr bin Syaiban] ia berkata, \"Aku menemui [Abu Salamah bin 'Abdurrahman], aku lalu berkata, \"Riwayatkanlah satu hadits yang engkau dengar dari ayahmu berkenaan dengan bulan ramadhan, \" ia berkata, \"Ya, [bapakku] telah menceritakan kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam menyebut-nyebut bulan ramadhan, beliau bersabda: \" (ramadhan) adalah bulan yang Allah mewajibkan kalian berpuasa, dan aku sunnahkan sholat di malam harinya. Barangsiapa berpuasa di siangnya dan bangun di malamnya karena iman dan mengharap pahala, maka dosa-dosanya akan keluar seperti pada hari dilahirkan oleh ibunya. \""
            },
            {
                "number": 1286,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْقِدُ الشَّيْطَانُ عَلَى قَافِيَةِ رَأْسِ أَحَدِكُمْ بِاللَّيْلِ بِحَبْلٍ فِيهِ ثَلَاثُ عُقَدٍ فَإِنْ اسْتَيْقَظَ فَذَكَرَ اللَّهَ انْحَلَّتْ عُقْدَةٌ فَإِذَا قَامَ فَتَوَضَّأَ انْحَلَّتْ عُقْدَةٌ فَإِذَا قَامَ إِلَى الصَّلَاةِ انْحَلَّتْ عُقَدُهُ كُلُّهَا فَيُصْبِحُ نَشِيطًا طَيِّبَ النَّفْسِ قَدْ أَصَابَ خَيْرًا وَإِنْ لَمْ يَفْعَلْ أَصْبَحَ كَسِلًا خَبِيثَ النَّفْسِ لَمْ يُصِبْ خَيْرًا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada malam hari setan mengikat kepala salah seorang dari kalian dengan tiga ikatan, jika ia bangun dan berdzikir kepada Allah akan terlepas satu ikatan. Jika ia bangun dan berwudlu maka akan terlepas satu ikatan lagi. Jika ia berdiri sholat maka akan terbuka semua ikatannya. Dan pada pagi harinya ia akan menjadi bersemangat, berfikir positif dan telah mendapatkan kebaikan. Namun jika tidak, pada pagi harinya ia akan menjadi tidak bersemangat, berfikir negative dan tidak mendapatkan kebaikan. \""
            },
            {
                "number": 1287,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَذُكِرَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ نَامَ لَيْلَةً حَتَّى أَصْبَحَ قَالَ ذَلِكَ الشَّيْطَانُ بَالَ فِي أُذُنَيْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Jarir] dari [Manshur] dari [Abu Wa`il] dari [Abdullah] ia berkata, \"Disebutkan di sisi Rasulullah shallallahu 'alaihi wasallam seorang laki-laki yang tidur hingga datang waktu subuh, maka beliau pun bersabda: \"Setan telah mengencingi telinganya. \""
            },
            {
                "number": 1288,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ أَنْبَأَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَكُنْ مِثْلَ فُلَانٍ كَانَ يَقُومُ اللَّيْلَ فَتَرَكَ قِيَامَ اللَّيْلِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah] berkata, telah memberitakan kepada kami [Al Walid bin Muslim] dari [Al Auza'i] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Abdullah bin Amru] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kamu seperti si fulan, ia bangun malam tetapi tidak mengerjakan sholat malam. \" "
            },
            {
                "number": 1289,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ وَالْحَسَنُ بْنُ مُحَمَّدِ بْنِ الصَّبَّاحِ وَالْعَبَّاسُ بْنُ جَعْفَرٍ وَمُحَمَّدُ بْنُ عَمْرٍو الْحَدَثَانِيُّ قَالُوا حَدَّثَنَا سُنَيْدُ بْنُ دَاوُدَ حَدَّثَنَا يُوسُفُ بْنُ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ أُمُّ سُلَيْمَانَ بْنِ دَاوُدَ لِسُلَيْمَانَ يَا بُنَيَّ لَا تُكْثِرْ النَّوْمَ بِاللَّيْلِ فَإِنَّ كَثْرَةَ النَّوْمِ بِاللَّيْلِ تَتْرُكُ الرَّجُلَ فَقِيرًا يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Muhammad] [Al Hasan bin Muhammad bin Ash Shabbah] dan [Al Abbas bin Ja'far] dan [Muhammad bin Amru Al Hadatsani] mereka berkata; telah menceritakan kepada kami [Sunaid bin Dawud] berkata, telah menceritakan kepada kami [Yusuf bin Muhammad bin Al Munkadir] dari [Bapaknya] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ibunya Sulaiman bin Daud berkata kepada Sulaiman, \"Wahai anakku, janganlah memperbanyak tidur di malam hari, sesungguhnya banyak tidur di malam hari akan menjadikan seorang laki-laki fakir pada hari kiamat. \""
            },
            {
                "number": 1290,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُحَمَّدٍ الطَّلْحِيُّ حَدَّثَنَا ثَابِتُ بْنُ مُوسَى أَبُو يَزِيدَ عَنْ شَرِيكٍ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَثُرَتْ صَلَاتُهُ بِاللَّيْلِ حَسُنَ وَجْهُهُ بِالنَّهَارِ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Muhammad Ath Thalhi] berkata, telah menceritakan kepada kami [Tsabit bin Musa Abu Yazid] dari [Syarik] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memperbanyak sholat di malam hari, maka wajahnya akan berseri-seri di siang hari. \""
            },
            {
                "number": 1291,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَابْنُ أَبِي عَدِيٍّ وَعَبْدُ الْوَهَّابِ وَمُحَمَّدُ بْنُ جَعْفَرٍ عَنْ عَوْفِ بْنِ أَبِي جَمِيلَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ عَبْدِ اللَّهِ بْنِ سَلَامٍ قَالَلَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ انْجَفَلَ النَّاسُ إِلَيْهِ وَقِيلَ قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجِئْتُ فِي النَّاسِ لِأَنْظُرَ إِلَيْهِ فَلَمَّا اسْتَبَنْتُ وَجْهَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَرَفْتُ أَنَّ وَجْهَهُ لَيْسَ بِوَجْهِ كَذَّابٍ فَكَانَ أَوَّلَ شَيْءٍ تَكَلَّمَ بِهِ أَنْ قَالَ يَا أَيُّهَا النَّاسُ أَفْشُوا السَّلَامَ وَأَطْعِمُوا الطَّعَامَ وَصَلُّوا بِاللَّيْلِ وَالنَّاسُ نِيَامٌ تَدْخُلُوا الْجَنَّةَ بِسَلَامٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dan [Ibnu Abu 'Adi] dan [Abdul Wahhab] dan [Muhammad Ja'far] dari ['Auf bin Abu Jamilah] dari [Zurarah bin Aufa] dari [Abdullah bin Salam] ia berkata, \"Tatkala Rasulullah shallallahu 'alaihi wasallam datang ke Madinah, orang-orang berlari menuju ke arahnya. Ketika diumumkan \"Rasulullah shallallahu 'alaihi wasallam telah tiba, \" maka aku pun mendatangi kerumunan orang-orang itu untuk melihat beliau. Ketika aku dapat melihat dengan jelas wajah Rasulullah shallallahu 'alaihi wasallam, aku dapat mengetahui bahwa wajah beliau bukanlah wajah seorang pendusta, dan pertama kali yang beliau ucapkan adalah: \"Wahai manusia, sebarkanlah salam, berilah makanan, dan sholatlah di malam hari ketika orang-orang tidur, maka kalian akan masuk surga dengan selamat. \""
            },
            {
                "number": 1292,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا شَيْبَانُ أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عَلِيِّ بْنِ الْأَقْمَرِ عَنْ الْأَغَرِّ عَنْ أَبِي سَعِيدٍ وَأَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اسْتَيْقَظَ الرَّجُلُ مِنْ اللَّيْلِ وَأَيْقَظَ امْرَأَتَهُ فَصَلَّيَا رَكْعَتَيْنِ كُتِبَا مِنْ الذَّاكِرِينَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتِ",
                "id": "Telah menceritakan kepada kami [Al 'Abbas bin Utsman Ad Dimasyqi] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Syaiban Abu Mu'awiyah] dari [Al 'Amasy] dari [Ali bin Al Aqmar] dari [Al Aghar] dari [Abu Sa'id] dan [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika seorang laki-laki bangun di malam hari kemudian membangunkan isterinya hingga keduanya sholat dua raka'at, maka akan ditulis sebagai orang yang selalu banyak mengingat Allah. \""
            },
            {
                "number": 1293,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ ثَابِتٍ الْجَحْدَرِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ عَجْلَانَ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَحِمَ اللَّهُ رَجُلًا قَامَ مِنْ اللَّيْلِ فَصَلَّى وَأَيْقَظَ امْرَأَتَهُ فَصَلَّتْ فَإِنْ أَبَتْ رَشَّ فِي وَجْهِهَا الْمَاءَ رَحِمَ اللَّهُ امْرَأَةً قَامَتْ مِنْ اللَّيْلِ فَصَلَّتْ وَأَيْقَظَتْ زَوْجَهَا فَصَلَّى فَإِنْ أَبَى رَشَّتْ فِي وَجْهِهِ الْمَاءَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Tsabit Al Jahdari] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu 'Ajlan] dari [Al Qa'qa' bin Hakim] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semoga Allah memberi rahmat seorang laki-laki yang bangun malam kemudian sholat, lalu membangunkan isterinya kemudian sholat. Jika isterinya enggan ia memercikkan air di wajahnya. Dan semoga Allah memberi rahmat seorang wanita yang bangun malam kemudian sholat, lalu membangunkan suaminya kemudian sholat. Jika suaminya enggan ia memercikkan air di wajahnya. \""
            },
            {
                "number": 1294,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ بَشِيرِ بْنِ ذَكْوَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا أَبُو رَافِعٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ السَّائِبِ قَالَقَدِمَ عَلَيْنَا سَعْدُ بْنُ أَبِي وَقَّاصٍ وَقَدْ كُفَّ بَصَرُهُ فَسَلَّمْتُ عَلَيْهِ فَقَالَ مَنْ أَنْتَ فَأَخْبَرْتُهُ فَقَالَ مَرْحَبًا بِابْنِ أَخِي بَلَغَنِي أَنَّكَ حَسَنُ الصَّوْتِ بِالْقُرْآنِ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ هَذَا الْقُرْآنَ نَزَلَ بِحُزْنٍ فَإِذَا قَرَأْتُمُوهُ فَابْكُوا فَإِنْ لَمْ تَبْكُوا فَتَبَاكَوْا وَتَغَنَّوْا بِهِ فَمَنْ لَمْ يَتَغَنَّ بِهِ فَلَيْسَ مِنَّا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Ahmad bin Basyir bin Dzakwan Ad Dimasyqi] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Abu Rafi'] dari [Ibnu Abu Mulaikah] dari ['Abdurrahman bin As Sa`ib] ia berkata, \" [Sa'd bin Abu Waqash] datang menemui kami sementara matanya telah buta, maka aku pun mengucapkan salam kepadanya, ia berkata, \"Siapa kamu?\" maka aku pun kabarkan kepadanya (siapa kami). Ia pun berkata, \"Selamat datang wahai anak saudaraku, telah sampai kepadaku bahwa suaramu bagus ketika membaca Al Qur`an. Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Al Qur`an turun dengan kesedihan, jika kalian membacanya maka bacalah dengan menangis, jika kalian tidak bisa menangis maka berpura-puralah untuk menangis. Dan lagukanlah dalam membaca, barangsiapa tidak melagukannya maka ia bukan dari golongan kami. \""
            },
            {
                "number": 1295,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ أَنَّهُ سَمِعَ عَبْدَ الرَّحْمَنِ بْنَ سَابِطٍ الْجُمَحِيَّ يُحَدِّثُ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْأَبْطَأْتُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةً بَعْدَ الْعِشَاءِ ثُمَّ جِئْتُ فَقَالَ أَيْنَ كُنْتِ قُلْتُ كُنْتُ أَسْتَمِعُ قِرَاءَةَ رَجُلٍ مِنْ أَصْحَابِكَ لَمْ أَسْمَعْ مِثْلَ قِرَاءَتِهِ وَصَوْتِهِ مِنْ أَحَدٍ قَالَتْ فَقَامَ وَقُمْتُ مَعَهُ حَتَّى اسْتَمَعَ لَهُ ثُمَّ الْتَفَتَ إِلَيَّ فَقَالَ هَذَا سَالِمٌ مَوْلَى أَبِي حُذَيْفَةَ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ فِي أُمَّتِي مِثْلَ هَذَا",
                "id": "Telah menceritakan kepada kami [Al Abbas bin Utsman Ad Dimasyqi] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Hanzhalah bin Abu Sufyan] Bahwasanya ia mendengar ['Abdurrahman bin Sabith Al Jumahi] menceritakan dari ['Aisyah] -isteri Nabi shallallahu 'alaihi wasallam- ia berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam aku datang terlambat pada malam hari setelah isya, setelah aku datang, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dari mana kamu?\" aku menjawab, \"Aku mendengar suara bacaan Al Qur`an seorang laki-laki dari sahabatmu, dan aku belum pernah mendengar suara sebagus itu. \" 'Aisyah berkata, \"Beliau lalu bangun dan aku pun ikut bangun bersamanya, beliau mendengar suaranya lalu menoleh ke arahku, beliau bersabda: \"Ini adalah Salim, mantan budak Abu Hudzaifah. Segala puji bagi Allah yang telah menjadikan dalam umatku orang seperti ini. \""
            },
            {
                "number": 1296,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ مُعَاذٍ الضَّرِيرُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الْمَدَنِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ إِسْمَعِيلَ بْنِ مُجَمِّعٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ أَحْسَنِ النَّاسِ صَوْتًا بِالْقُرْآنِ الَّذِي إِذَا سَمِعْتُمُوهُ يَقْرَأُ حَسِبْتُمُوهُ يَخْشَى اللَّهَ",
                "id": "Telah menceritakan kepada kami [Bisyr bin Mu'adz Adl Dlarir] berkata, telah menceritakan kepada kami [Abdullah bin Ja'far Al Madani] berkata, telah menceritakan kepada kami [Ibrahim bin Isma'il bin Mujammi'] dari [Abu Zubair] dari [Jabir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang yang paling baik suaranya dalam membaca Al Qur`an adalah orang yang apabila kalian mendengarnya sedang membaca (Al Qur`an), kalian mengiranya ia takut kepada Allah. \""
            },
            {
                "number": 1297,
                "arab": "حَدَّثَنَا رَاشِدُ بْنُ سَعِيدِ بْنِ رَاشِدٍ الرَّمْلِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا إِسْمَعِيلُ بْنُ عُبَيْدِ اللَّهِ عَنْ مَيْسَرَةَ مَوْلَى فَضَالَةَ عَنْ فَضَالَةَ بْنِ عُبَيْدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَلَّهُ أَشَدُّ أَذَنًا إِلَى الرَّجُلِ الْحَسَنِ الصَّوْتِ بِالْقُرْآنِ يَجْهَرُ بِهِ مِنْ صَاحِبِ الْقَيْنَةِ إِلَى قَيْنَتِهِ",
                "id": "Telah menceritakan kepada kami [Rasyid bin Sa'id bin Rasyid Ar Ramli] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Al Auza'i] berkata, telah menceritakan kepada kami [Isma'il bin ubaidhullah] dari [Maisarah] -mantan pelayan Fadlalah bin Ubaid- dari [Fadlalah bin Ubaid] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah lebih mudah dalam memberi izin bagi orang yang bacaan Al Qur`annya bagus untuk mengeraskan suaranya dari seorang pemilik budak kepada budaknya (untuk melagu). \""
            },
            {
                "number": 1298,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَسْجِدَ فَسَمِعَ قِرَاءَةَ رَجُلٍ فَقَالَ مَنْ هَذَا فَقِيلَ عَبْدُ اللَّهِ بْنُ قَيْسٍ فَقَالَ لَقَدْ أُوتِيَ هَذَا مِنْ مَزَامِيرِ آلِ دَاوُدَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah memberitakan kepada kami [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam masuk ke dalam masjid, beliau mendengar bacaan Al Qur`an seorang laki-laki. Beliau bertanya: \"Siapa ini?\" dikatakan, \"Dia adalah Abdullah bin Qais. \" Beliau bersabda: \"Orang ini telah diberi seruling dari seruling keluarga Dawud. \""
            },
            {
                "number": 1299,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ جَعْفَرٍ قَالَا حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ طَلْحَةَ الْيَامِيَّ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ عَوْسَجَةَ قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ يُحَدِّثُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيِّنُوا الْقُرْآنَ بِأَصْوَاتِكُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dan [Muhammad bin Ja'far] keduanya berkata; telah menceritakan kepada kami [Syu'bah] berkata; Aku mendengar [Thalhah Al Yami] berkata; Aku mendengar ['Abdurrahman bin 'Aujasah] berkata; Aku mendengar [Al Barra bin 'Azib] menceritakan, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hiasilah Al Qur`an dengan suara kalian. \""
            },
            {
                "number": 1300,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَنْبَأَنَا يُونُسُ بْنُ يَزِيدَ عَنْ ابْنِ شِهَابٍ أَنَّ السَّائِبَ بْنَ يَزِيدَ وَعُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ أَخْبَرَاهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَامَ عَنْ حِزْبِهِ أَوْ عَنْ شَيْءٍ مِنْهُ فَقَرَأَهُ فِيمَا بَيْنَ صَلَاةِ الْفَجْرِ وَصَلَاةِ الظُّهْرِ كُتِبَ لَهُ كَأَنَّمَا قَرَأَهُ مِنْ اللَّيْلِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Amru bin As Sarh Al Mishri] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah memberitakan kepada kami [Yunus bin Yazid] dari [Ibnu Syihab] bahwa [As Sa`ib bin Yazid] dan [ubaidhullah bin Abdullah] keduanya mengabarkan kepadanya dari ['Abdurrahman bin Abdul Qari] ia berkata; Aku mendengar [Umar Ibnul Khaththab] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa tertidur hingga tidak membaca wirit atau sesuatu darinya, kemudian ia baca antara sholat subuh dan sholat zhuhur, maka akan dituliskan baginya seakan-akan ia melakukannya di waktu malam. \""
            },
            {
                "number": 1301,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ الْحَمَّالُ حَدَّثَنَا الْحُسَيْنُ بْنُ عَلِيٍّ الْجُعْفِيُّ عَنْ زَائِدَةَ عَنْ سُلَيْمَانَ الْأَعْمَشِ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ عَبْدَةَ بْنِ أَبِي لُبَابَةَ عَنْ سُوَيْدِ بْنِ غَفَلَةَ عَنْ أَبِي الدَّرْدَاءِيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَتَى فِرَاشَهُ وَهُوَ يَنْوِي أَنْ يَقُومَ فَيُصَلِّيَ مِنْ اللَّيْلِ فَغَلَبَتْهُ عَيْنُهُ حَتَّى يُصْبِحَ كُتِبَ لَهُ مَا نَوَى وَكَانَ نَوْمُهُ صَدَقَةً عَلَيْهِ مِنْ رَبِّهِ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah Al Hammal] berkata, telah menceritakan kepada kami [Husain bin Ali Al Ju'fi] dari [Za`idah] dari [Sulaiman Al A'masy] dari [Habib bin Abu Tsabit] dari [Abdah bin Abu Lubabah] dari [Suwaid bin Ghaflah] dari [Abu Darda] dan sanadnya sampai kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa beranjak tidur dengan niat untuk bangun dan sholat malam, namun kantuk mengalahkannya hingga tiba pagi, maka akan ditulis baginya apa yang dia niatkan, dan tidurnya dihitung sebagai sedekah dari Rabbnya. \""
            },
            {
                "number": 1302,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَعْلَى الطَّائِفِيِّ عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ أَوْسٍ عَنْ جَدِّهِ أَوْسِ بْنِ حُذَيْفَةَ قَالَقَدِمْنَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي وَفْدِ ثَقِيفٍ فَنَزَّلُوا الْأَحْلَافَ عَلَى الْمُغِيرَةِ بْنِ شُعْبَةَ وَأَنْزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَنِي مَالِكٍ فِي قُبَّةٍ لَهُ فَكَانَ يَأْتِينَا كُلَّ لَيْلَةٍ بَعْدَ الْعِشَاءِ فَيُحَدِّثُنَا قَائِمًا عَلَى رِجْلَيْهِ حَتَّى يُرَاوِحَ بَيْنَ رِجْلَيْهِ وَأَكْثَرُ مَا يُحَدِّثُنَا مَا لَقِيَ مِنْ قَوْمِهِ مِنْ قُرَيْشٍ وَيَقُولُ وَلَا سَوَاءَ كُنَّا مُسْتَضْعَفِينَ مُسْتَذَلِّينَ فَلَمَّا خَرَجْنَا إِلَى الْمَدِينَةِ كَانَتْ سِجَالُ الْحَرْبِ بَيْنَنَا وَبَيْنَهُمْ نُدَالُ عَلَيْهِمْ وَيُدَالُونَ عَلَيْنَا فَلَمَّا كَانَ ذَاتَ لَيْلَةٍ أَبْطَأَ عَنْ الْوَقْتِ الَّذِي كَانَ يَأْتِينَا فِيهِ فَقُلْتُ يَا رَسُولَ اللَّهِ لَقَدْ أَبْطَأْتَ عَلَيْنَا اللَّيْلَةَ قَالَ إِنَّهُ طَرَأَ عَلَيَّ حِزْبِي مِنْ الْقُرْآنِ فَكَرِهْتُ أَنْ أَخْرُجَ حَتَّى أُتِمَّهُقَالَ أَوْسٌ فَسَأَلْتُ أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ تُحَزِّبُونَ الْقُرْآنَ قَالُوا ثَلَاثٌ وَخَمْسٌ وَسَبْعٌ وَتِسْعٌ وَإِحْدَى عَشْرَةَ وَثَلَاثَ عَشْرَةَ وَحِزْبُ الْمُفَصَّلِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Abdullah bin 'Abdurrahman bin Ya'la Ath Tha`ifi] dari [Utsman bin Abdullah bin Aus] dari kakeknya [Aus bin Khudzaifah] ia berkata, \"Kami mendatangi Rasulullah shallallahu 'alaihi wasallam dalam rombongan utusan Bani Tsaqif, kemudian rombongan kabilah itu singgah menemui Al Mughirah bin Syu'bah, sementara Rasulullah shallallahu 'alaihi wasallam menempatkan Bani Malik di kubah miliknya. Beliau mendatangi kami setiap malam setelah isya, kemudian menceritakan hadits sambil berdiri di atas kedua kakinya sehingga berganti-gantian di antara kedua kakinya. Paling banyak yang beliau ceritakan adalah apa yang ia alami dari kaumnya, Quraisy. Beliau bersabda: \"Tidaklah sama, kami orang-orang yang lemah dan terhina, tatkala keluar ke Madinah peperangan silih berganti di antara kami dan mereka, kami mengalahkan mereka dan mereka mengalahkan kami. \" Tatkala suatu malam beliau terlambat dari waktu kedatangannya kepada kami, aku pun bertanya, \"Wahai Rasulullah, pada malam ini engkau terlambat datang kepada kami. \" Beliau bersabda: \"Sungguh, telah datang padaku bagianku dari Al Qur'an, maka aku tidak ingin keluar hingga menyempurnakannya. \" Aus berkata, \"Aku bertanya kepada para sahabat Rasulullah shallallahu 'alaihi wasallam; bagaimanakah kalian menggolong-golongkan Al Qur'an? Mereka menjawab: \"Tiga, lima, tujuh, sembilan, sebelas, tiga belas dan hizbul mufashshal. \""
            },
            {
                "number": 1303,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ يَحْيَى بْنِ حَكِيمِ بْنِ صَفْوَانَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَجَمَعْتُ الْقُرْآنَ فَقَرَأْتُهُ كُلَّهُ فِي لَيْلَةٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أَخْشَى أَنْ يَطُولَ عَلَيْكَ الزَّمَانُ وَأَنْ تَمَلَّ فَاقْرَأْهُ فِي شَهْرٍ فَقُلْتُ دَعْنِي أَسْتَمْتِعْ مِنْ قُوَّتِي وَشَبَابِي قَالَ فَاقْرَأْهُ فِي عَشْرَةٍ قُلْتُ دَعْنِي أَسْتَمْتِعْ مِنْ قُوَّتِي وَشَبَابِي قَالَ فَاقْرَأْهُ فِي سَبْعٍ قُلْتُ دَعْنِي أَسْتَمْتِعْ مِنْ قُوَّتِي وَشَبَابِي فَأَبَى",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Khallad Al Bahili] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] dari [Ibnu Abu Mulaikah] dari [Yahya bin Hakim bin Shafwan] dari [Abdullah bin Amru] berkata; Aku mengumpulkan Al Qur`an dan membaca semuanya dalam semalam, maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Aku khawatir terlalu lama hingga engkau menjadi bosan, bacalah dalam satu bulan. \" Aku menjawab, \"Biarkanlah aku enjoi dengan kemampuan dan masa mudaku. \" Beliau bersabda: \"Bacalah dalam sepuluh hari, \" aku menjawab, \"Biarkanlah aku enjoi dengan kemampuan dan masa mudaku. \" Beliau bersabda: \"Bacalah dalam tujuh hari, \" aku menjawab, \"Biarkanlah aku enjoi dengan kemampuan dan masa mudaku, \" namun beliau tidak setuju. \""
            },
            {
                "number": 1304,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَمْ يَفْقَهْ مَنْ قَرَأَ الْقُرْآنَ فِي أَقَلَّ مِنْ ثَلَاثٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakr bin Khallad] berkata, telah menceritakan kepada kami [Khalid Ibnul Harits] berkata, telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Yazid bin Abdullah bin Asy Syikhkhir] dari [Abdullah bin Amru] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak akan dapat memahami orang yang membaca Al Qur`an kurang dari tiga hari. \""
            },
            {
                "number": 1305,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ حَدَّثَنَا قَتَادَةُ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ قَالَتْلَا أَعْلَمُ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ الْقُرْآنَ كُلَّهُ حَتَّى الصَّبَاحِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Muhammad bin Bisyr] berkata, telah menceritakan kepada kami [Sa'id bin Abu Arubah] berkata, telah menceritakan kepada kami [Qatadah] dari [Zurarah bin Aufa] dari [Sa'd bin Hisyam] dari ['Aisyah] ia berkata, \"Aku tidak pernah melihat Nabi Allah shallallahu 'alaihi wasallam membaca Al Qur`an hingga datang waktu subuh. \""
            },
            {
                "number": 1306,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا وَكِيعٌ حَدَّثَنَا مِسْعَرٌ عَنْ أَبِي الْعَلَاءِ عَنْ يَحْيَى بْنِ جَعْدَةَ عَنْ أُمِّ هَانِئٍ بِنْتِ أَبِي طَالِبٍ قَالَتْكُنْتُ أَسْمَعُ قِرَاءَةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ وَأَنَا عَلَى عَرِيشِي",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Mis'ar] dari [Abu Al 'Ala] dari [Yahya bin Ja'dah] dari [Ummu Hani` binti Abu Thalib] ia berkata, \"Aku mendengar bacaan Al Qur`an Nabi shallallahu 'alaihi wasallam di malam hari, sementara aku berada di atas bangsalku. \" "
            },
            {
                "number": 1307,
                "arab": "حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ قُدَامَةَ بْنِ عَبْدِ اللَّهِ عَنْ جَسْرَةَ بِنْتِ دَجَاجَةَ قَالَتْ سَمِعْتُ أَبَا ذَرٍّ يَقُولُقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِآيَةٍ حَتَّى أَصْبَحَ يُرَدِّدُهَا وَالْآيَةُ{ إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ }",
                "id": "Telah menceritakan kepada kami [Bakr bin Khalaf Abu Bisyr] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Qudamah bin Abdullah] dari [Jasrah binti Dajajah] ia berkata; Aku mendengar [Abu Dzar] berkata, \"Nabi shallallahu 'alaihi wasallam berdiri membaca ayat dan diulang-ulang, yakni ayat; \" (Jika Engkau menyiksa mereka, maka sesungguhnya mereka adalah hamba-hamba Engkau, dan jika Engkau mengampuni mereka, maka sesungguhnya Engkaulah Yang Maha Perkasa lagi Maha Bijaksana). \""
            },
            {
                "number": 1308,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ الْمُسْتَوْرِدِ بْنِ الْأَحْنَفِ عَنْ صِلَةَ بْنِ زُفَرَ عَنْ حُذَيْفَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فَكَانَ إِذَا مَرَّ بِآيَةِ رَحْمَةٍ سَأَلَ وَإِذَا مَرَّ بِآيَةِ عَذَابٍ اسْتَجَارَ وَإِذَا مَرَّ بِآيَةٍ فِيهَا تَنْزِيهٌ لِلَّهِ سَبَّحَ",
                "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Sa'd bin Ubaidah] dari [Al Mustaurid Ibnul Ahnaf] dari [Shillah bin Zufar] dari [Hudzaifah] berkata, \"Jika Nabi shallallahu 'alaihi wasallam, kemudian membaca ayat yang berkenaan dengan rahmat beliau meminta, jika membaca ayat yang berkenaan dengan siksa beliau minta perlindungan, dan jika membaca ayat yang mensucikan Allah beliau bertasbih. \""
            },
            {
                "number": 1309,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ هَاشِمٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ ثَابِتٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِي لَيْلَى قَالَصَلَّيْتُ إِلَى جَنْبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي مِنْ اللَّيْلِ تَطَوُّعًا فَمَرَّ بِآيَةِ عَذَابٍ فَقَالَ أَعُوذُ بِاللَّهِ مِنْ النَّارِ وَوَيْلٌ لِأَهْلِ النَّارِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ali bin Hasyim] dari [Ibnu Abu Laila] dari [Tsabit] dari ['Abdurrahman bin Abu Laila] dari [Abu Laila] ia berkata, \"Aku sholat di samping Rasulullah shallallahu 'alaihi wasallam yang sedang sholat malam untuk thathawu', ketika beliau membaca satu ayat yang berkenaan dengan siksa beliau bersabda: \"Aku berlindung kepada Allah dari neraka dan dari Wail yang diperuntukkan bagi penghuni neraka. \""
            },
            {
                "number": 1310,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ قَتَادَةَ قَالَسَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنْ قِرَاءَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ كَانَ يَمُدُّ صَوْتَهُ مَدًّا",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] berkata, telah menceritakan kepada kami ['Abdurrahman bin Mahdi] berkata, telah menceritakan kepada kami [Jarir bin Hazim] dari [Qatadah] ia berkata, \"Aku bertanya kepada [Anas bin Malik] tentang bacaan Nabi shallallahu 'alaihi wasallam, ia menjawab, \"Beliau memanjangkan suaranya. \""
            },
            {
                "number": 1311,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ بُرْدِ بْنِ سِنَانٍ عَنْ عُبَادَةَ بْنِ نُسَيٍّ عَنْ غُضَيْفِ بْنِ الْحَارِثِ قَالَأَتَيْتُ عَائِشَةَ فَقُلْتُ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَجْهَرُ بِالْقُرْآنِ أَوْ يُخَافِتُ بِهِ قَالَتْ رُبَّمَا جَهَرَ وَرُبَّمَا خَافَتَ قُلْتُ اللَّهُ أَكْبَرُ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ فِي هَذَا الْأَمْرِ سَعَةً",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Isma'il bin 'Ulayyah] dari [Burd bin Sinan] dari [Ubadah bin Nusay] dari [Ghudlaif bin Al Harits] ia berkata, \"Aku mendatangi ['Aisyah] dan bertanya; apakah Rasulullah shallallahu 'alaihi wasallam mengeraskan bacaan Al Qur'annya, atau membacanya dengan pelan? Ia menjawab: \"Kadang dengan keras dan kadang dengan pelan. \" Aku berkata, \"Maha Besar Allah, segala puji bagi Allah, yang telah menjadikan urusan ini luas. \" "
            },
            {
                "number": 1312,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ سُلَيْمَانَ الْأَحْوَلِ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَهَجَّدَ مِنْ اللَّيْلِ قَالَ اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ أَنْتَ قَيَّامُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ أَنْتَ مَالِكُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ أَنْتَ الْحَقُّ وَوَعْدُكَ حَقٌّ وَقَوْلُكَ حَقٌّ وَلِقَاؤُكَ حَقٌّ وَالْجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ وَالسَّاعَةُ حَقٌّ وَالنَّبِيُّونَ حَقٌّ وَمُحَمَّدٌ حَقٌّ اللَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ وَإِلَيْكَ حَاكَمْتُ فَاغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَ وَلَا إِلَهَ غَيْرُكَ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِكَحَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا سُلَيْمَانُ بْنُ أَبِي مُسْلِمٍ الْأَحْوَلُ خَالُ ابْنِ أَبِي نَجِيحٍ سَمِعَ طَاوُسًا عَنْ ابْنِ عَبَّاسٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ مِنْ اللَّيْلِ لِلتَّهَجُّدِ فَذَكَرَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Sulaiman Al Ahwal] dari [Thawus] dari [Ibnu Abbas] ia berkata, \"Jika sholat malam Rasulullah shallallahu 'alaihi wasallam membaca: \"ALLAHUMMA LAKAL HAMDU ANTA NUURUS SAMAWAATI WAL ARDLI WA MAN FIHINNA WA LAKAL HAMDU ANTA QAYYAAMUS SAMAWAATI WAL ARDLI WA MAN FIHINNA WA LAKAL HAMDU ANTA MAALIKUS SAMAWAATI WAL ARDLI WA MAN FIHINNA WA LAKAL HAMDU ANTAL HAQQU WA WA'DUKA HAQQUN WA QAULUKA HAQQUN WA LIQAA`UKA HAQQUN WA JANNATU HAQQUN WANNARU HAQQUN WAS SAA'ATU HAQQUN WANNABIYYUUNA HAQQUN WA MUHAMMADUN HAQQUN ALLAHUMMA LAKA ASLAMTU WA BIKA AAMANTU WA 'ALAIKA TAWAKKALTU WA ILAIKA ANABTU WA BIKA KHAASHAMTU WA ILAIKA HAAKAMTU FAGHFIRLI MAA QADDAMTU WA MAA ASRARTU WA MAA A'LANTU ANTAL MUQADDIM WA ANTAL MU`AKHKHIR LAA ILAAHA ILLA ANTA WA LAA HAULA WA LAA QUWWATA ILLA BIKA. \" Telah menceritakan kepada kami [Abu Bakr bin Khallad Al Bahili] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] berkata, telah menceritakan kepada kami [Sulaiman bin Abu Muslim Al Ahwal] -paman Ibnu Abu Najih- mendengar [Thawus] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam jika bangun malam untuk tahajjud, lalu ia menyebutkan sebagaimana dalam hadits. \""
            },
            {
                "number": 1313,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ حَدَّثَنِي أَزْهَرُ بْنُ سَعِيدٍ عَنْ عَاصِمِ بْنِ حُمَيْدٍ قَالَسَأَلْتُ عَائِشَةَ مَاذَا كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْتَتِحُ بِهِ قِيَامَ اللَّيْلِ قَالَتْ لَقَدْ سَأَلْتَنِي عَنْ شَيْءٍ مَا سَأَلَنِي عَنْهُ أَحَدٌ قَبْلَكَ كَانَ يُكَبِّرُ عَشْرًا وَيَحْمَدُ عَشْرًا وَيُسَبِّحُ عَشْرًا وَيَسْتَغْفِرُ عَشْرًا وَيَقُولُ اللَّهُمَّ اغْفِرْ لِي وَاهْدِنِي وَارْزُقْنِي وَعَافِنِي وَيَتَعَوَّذُ مِنْ ضِيقِ الْمُقَامِ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Zaid bin Al Hubab] dari [Mu'awiyah bin Shalih] berkata, telah menceritakan kepadaku [Azhar bin Sa'id] dari ['Ashim bin Humaid] ia berkata, \"Aku bertanya kepada ['Aisyah]; \"Dengan apakah Nabi shallallahu 'alaihi wasallam membuka sholat malamnya? ia menjawab: \"Kamu telah menanyakan kepadaku sesuatu yang tidak pernah ditanyakan oleh orang lain sebelumnya. Beliau bertakbir sepuluh kali, bertahmid sepuluh kali, bertasbih sepuluh kali, beristighfar sepuluh kali lalu berdo'a; \"Ya Allah, ampunilah aku, tunjukkanlah aku, limpahkanlah rizki kepadaku, berilah kesehatan pada diriku, \" dan beliau juga berlindung dari sempitnya tempat berdiri pada hari kiamat. \""
            },
            {
                "number": 1314,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عُمَرَ حَدَّثَنَا عُمَرُ بْنُ يُونُسَ الْيَمَامِيُّ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالَسَأَلْتُ عَائِشَةَ بِمَ كَانَ يَسْتَفْتِحُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاتَهُ إِذَا قَامَ مِنْ اللَّيْلِ قَالَتْ كَانَ يَقُولُ اللَّهُمَّ رَبَّ جِبْرَئِيلَ وَمِيكَائِيلَ وَإِسْرَافِيلَ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنْ الْحَقِّ بِإِذْنِكَ إِنَّكَ لَتَهْدِي إِلَى صِرَاطٍ مُسْتَقِيمٍقَالَ عَبْدُ الرَّحْمَنِ بْنُ عُمَرَ احْفَظُوهُ جِبْرَئِيلَ مَهْمُوزَةً فَإِنَّهُ كَذَا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Umar] berkata, telah menceritakan kepada kami [Umar bin Yunus Al Yamami] berkata, telah menceritakan kepada kami [Ikrimah bin Ammar] berkata, telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Abu Salamah bin 'Abdurrahman] ia berkata, \"Aku tanyakan kepada ['Aisyah]; ketika sholat malam bagaimana Nabi shallallahu 'alaihi wasallam membuka sholatnya?\" ia berkata, \"Beliau membaca; ALLAHUMMA RABBA JIBRA`IIL WA MIKAA`IL WA ISRAAFIIL FAATHIRAS SAMAWAATI WAL ARDLI 'AALIMAL GHAIBI WASY SYAHADAHI ANTA TAHKUMU BAINA 'IBAADIKA FIIMAA KAANUU FIIHI YAKHTALIFUUN IHDINII LIMAKHTULIFA FIIHI MINAL HAQQI BI IDZNIKA INNAKA LATAHDI ILAA SHIRAATHIN MUSTAQIIMIN. \" 'Abdurrahman bin Umar berkata, \"Biarkanlah dengan lafazh JIBRA`IIL (dengan kata kerja mahmuz), sebab seperti itulah lafadz asli dari Nabi shallallahu 'alaihi wasallam. \""
            },
            {
                "number": 1315,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَبَابَةُ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ ح و حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ وَهَذَا حَدِيثُ أَبِي بَكْرٍ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مَا بَيْنَ أَنْ يَفْرُغَ مِنْ صَلَاةِ الْعِشَاءِ إِلَى الْفَجْرِ إِحْدَى عَشْرَةَ رَكْعَةً يُسَلِّمُ فِي كُلِّ اثْنَتَيْنِ وَيُوتِرُ بِوَاحِدَةٍ وَيَسْجُدُ فِيهِنَّ سَجْدَةً بِقَدْرِ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً قَبْلَ أَنْ يَرْفَعَ رَأْسَهُ فَإِذَا سَكَتَ الْمُؤَذِّنُ مِنْ الْأَذَانِ الْأَوَّلِ مِنْ صَلَاةِ الصُّبْحِ قَامَ فَرَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Syababah] dari [Ibnu Abu Dzi`b] dari [Az Zuhri] dari [Urwah] dari ['Aisyah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim Ad Dimasyqi] berkata, telah menceritakan kepada kami [Al Walid] berkata, telah menceritakan kepada kami [Al Auza'i] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] -dan ini adalah hadits Abu Bakr- ia berkata, \"Selepas waktu isya hingga fajar Nabi shallallahu 'alaihi wasallam sholat sebanyak sebelas raka'at. Pada setiap dua raka'at beliau salam dan witir dengan satu raka'at, dan pada setiap raka'at tersebut beliau sujud sekadar salah seorang dari kalian membaca lima puluh ayat sebelum mengangkat kepalanya. Jika mu`adzin diam setelah mengumandangkan adzan pertama pada sholat subuh, beliau berdiri dan sholat dua raka'at ringan. \""
            },
            {
                "number": 1316,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنْ اللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] berkata, \"Nabi shallallahu 'alaihi wasallam sholat malam sebanyak tiga belas raka'at. \""
            },
            {
                "number": 1317,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي مِنْ اللَّيْلِ تِسْعَ رَكَعَاتٍ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari] berkata, telah menceritakan kepada kami [Abu Al Ahwash] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah] berkata, \"Nabi shallallahu 'alaihi wasallam sholat malam sebanyak sembilan raka'at. \""
            },
            {
                "number": 1318,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مَيْمُونٍ أَبُو عُبَيْدٍ الْمَدِينِيُّ حَدَّثَنَا أَبِي عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ أَبِي إِسْحَقَ عَنْ عَامِرٍ الشَّعْبِيِّ قَالَسَأَلْتُ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ وَعَبْدَ اللَّهِ بْنَ عُمَرَ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ فَقَالَا ثَلَاثَ عَشْرَةَ رَكْعَةً مِنْهَا ثَمَانٍ وَيُوتِرُ بِثَلَاثٍ وَرَكْعَتَيْنِ بَعْدَ الْفَجْرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid bin Maimun Abu Ubaid Al Madani] berkata, telah menceritakan kepada kami [Bapakku] dari [Muhammad bin Ja'far] dari [Musa bin Uqbah] dari [Abu Ishaq] dari [Amir bin Sya'bi] ia berkata, \"Aku bertanya kepada [Abdullah bin Abbas] dan [Abdullah bin Umar] tentang sholat Rasulullah shallallahu 'alaihi wasallam pada waktu malam. Maka keduanya menjawab, \"Tiga belas raka'at; delapan raka'at tahajjud dan tiga raka'at sholat witir, ditambah dua raka'at sholat setelah fajar. \""
            },
            {
                "number": 1319,
                "arab": "حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ عَاصِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعِ بْنِ ثَابِتٍ الزُّبَيْرِيُّ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَبِيهِ أَنَّ عَبْدَ اللَّهِ بْنَ قَيْسِ بْنِ مَخْرَمَةَ أَخْبَرَهُ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ قَالَقُلْتُ لَأَرْمُقَنَّ صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّيْلَةَ قَالَ فَتَوَسَّدْتُ عَتَبَتَهُ أَوْ فُسْطَاطَهُ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ رَكْعَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ ثُمَّ رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ رَكْعَتَيْنِ ثُمَّ أَوْتَرَ فَتِلْكَ ثَلَاثَ عَشْرَةَ رَكْعَةً",
                "id": "Telah menceritakan kepada kami [Abdus Salam bin Ashim] berkata, telah menceritakan kepada kami [Abdullah bin Nafi' bin Tsabit Az Zubairi] berkata, telah menceritakan kepada kami [Malik bin Anas] dari [Abdullah bin Abu Bakr] dari [Bapaknya] bahwa [Abdullah bin Qais bin Makhramah] mengabarkan kepadanya dari [Zaid bin Khalid Al Juhani] ia berkata, \"Sungguh, aku akan mengamati bagaimana sholat Rasulullah shallallahu 'alaihi wasallam di malam hari. \" Ia berkata, \"Maka aku pun memanjat lotengnya, beliau bangun dan sholat dua raka'at ringan, kemudian dua raka'at panjang, kemudian panjang, kemudian panjang. Setelah itu beliau sholat dua raka'at namun tidak sebagaimana dua raka'at sebelumnya, kemudian sholat dua raka'at namun tidak sebagaimana dua raka'at sebelumnya, kemudian sholat dua raka'at namun tidak sebagaimana dua raka'at sebelumnya. Setelah itu sholat dua raka'at dan witir. Maka genaplah tiga belas raka'at. \""
            },
            {
                "number": 1320,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا مَعْنُ بْنُ عِيسَى حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ ابْنِ عَبَّاسٍ أَخْبَرَهُأَنَّهُ نَامَ عِنْدَ مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ خَالَتُهُ قَالَ فَاضْطَجَعْتُ فِي عَرْضِ الْوِسَادَةِ وَاضْطَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَهْلُهُ فِي طُولِهَا فَنَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا انْتَصَفَ اللَّيْلُ أَوْ قَبْلَهُ بِقَلِيلٍ أَوْ بَعْدَهُ بِقَلِيلٍ اسْتَيْقَظَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ بِيَدِهِ ثُمَّ قَرَأَ الْعَشْرَ آيَاتٍ مِنْ آخِرِ سُورَةِ آلِ عِمْرَانَ ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقَةٍ فَتَوَضَّأَ مِنْهَا فَأَحْسَنَ وُضُوءَهُ ثُمَّ قَامَ يُصَلِّي قَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ فَقُمْتُ فَصَنَعْتُ مِثْلَ مَا صَنَعَ ثُمَّ ذَهَبْتُ فَقُمْتُ إِلَى جَنْبِهِ فَوَضَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ الْيُمْنَى عَلَى رَأْسِي وَأَخَذَ أُذُنِي الْيُمْنَى يَفْتِلُهَا فَصَلَّى رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ أَوْتَرَ ثُمَّ اضْطَجَعَ حَتَّى جَاءَهُ الْمُؤَذِّنُ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ خَرَجَ إِلَى الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Khallad Al Bahili] berkata, telah menceritakan kepada kami [Ma'n bin Isa] berkata, telah menceritakan kepada kami [Malik bin Anas] dari [Makhramah bin Sulaiman] dari [Kuraib] -mantan budak Ibnu Abbas- dari [Ibnu Abbas] ia mengabarkan kepadanya, bahwa ia pernah tidur di rumah Maimunah, isteri Nabi shallallahu 'alaihi wasallam -Maimunah adalah bibinya- ia berkata, \"Aku berbaring di bantal bagian sisinya, sementara Nabi shallallahu 'alaihi wasallam dan isterinya di bagian tengahnya. Hingga pada pertengahan malam atau kurang sedikit, atau lewat tengah malam atau lebih sedikit, Nabi shallallahu 'alaihi wasallam bangun seraya mengusap mukanya dengan kedua tangan sambil membaca sepuluh ayat terakhir surat Ali Imran. Setelah itu beliau berdiri menuju girbah (bejana) kulit yang tergantung, beliau wudlu darinya dan membaguskan wudlunya kemudian melaksanakan sholat. \" Abdullah bin Abbas berkata, \"Kemudian aku bangun dan melakukan sebagaimana yang beliau lakukan, aku berjalan dan berdiri di sisinya. Rasulullah shallallahu 'alaihi wasallam kemudian meletakkan tangan kanannya di kepalaku meraih daun telinga, beliau menggeser posisiku. Setelah itu beliau sholat dua raka'at, kemudian dua raka'at, kemudian dua raka'at, kemudian dua raka'at, kemudian dua raka'at, kemudian dua raka'at, kemudian witir. Lalu beliau berbaring hingga tukang adzannya mendatanginya, beliau lalu sholat dua raka'at ringan baru kemudian keluar untuk melaksanakan sholat (subuh). \""
            },
            {
                "number": 1321,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ الْوَلِيدِ قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ يَزِيدَ بْنِ طَلْقٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْبَيْلَمَانِيِّ عَنْ عَمْرِو بْنِ عَبَسَةَ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ مَنْ أَسْلَمَ مَعَكَ قَالَ حُرٌّ وَعَبْدٌ قُلْتُ هَلْ مِنْ سَاعَةٍ أَقْرَبُ إِلَى اللَّهِ مِنْ أُخْرَى قَالَ نَعَمْ جَوْفُ اللَّيْلِ الْأَوْسَطُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Muhammad bin Basysyar] dan [Muhammad Ibnul Walid] mereka berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin 'Atho`] dari [Yazid bin Thalq] dari ['Abdurrahman bin Al Bailani] dari [Amru bin Abasah] ia berkata, \"Aku mendatangi Rasulullah shallallahu 'alaihi wasallam dan kukatakan kepadanya, \"Wahai Rasulullah, siapakah yang akan selamat bersamamu? ' beliau menjawab: \"Orang merdeka dan budak, \" aku bertanya lagi, \"Apakah ada satu waktu yang paling dekat kepada Allah dari waktu yang lainnya?\" beliau menjawab: \"Ya, pertengahan malam. \""
            },
            {
                "number": 1322,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنَامُ أَوَّلَ اللَّيْلِ وَيُحْيِي آخِرَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [ubaidhullah] dari [Isra'il] dari [Abu Ishaq] dari [Al Aswad] dari ['Aisyah] berkata, \"Rasulullah shallallahu 'alaihi wasallam tidur di awal waktu dan sholat di akhir malamnya. \""
            },
            {
                "number": 1323,
                "arab": "حَدَّثَنَا أَبُو مَرْوَانَ مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ وَيَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ قَالَا حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ وَأَبِي عَبْدِ اللَّهِ الْأَغَرِّ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَنْزِلُ رَبُّنَا تَبَارَكَ وَتَعَالَى حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الْآخِرُ كُلَّ لَيْلَةٍ فَيَقُولُ مَنْ يَسْأَلُنِي فَأُعْطِيَهُ مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ مَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ حَتَّى يَطْلُعَ الْفَجْرُ فَلِذَلِكَ كَانُوا يَسْتَحِبُّونَ صَلَاةَ آخِرِ اللَّيْلِ عَلَى أَوَّلِهِ",
                "id": "Telah menceritakan kepada kami [Abu Marwan Muhammad bin Utsman Al Ustsmani] dan [Ya'qub bin Humaid bin Kasib] keduanya berkata; telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Ibnu Syihab] dari [Abu Salamah] dan [Abu Abdullah Al Aghar] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada setiap malam Rabb kita Tabaaraka wa Ta'ala turun pada sepertiga malam akhir, lalu Ia berfirman: \"Siapa yang meminta kepada-Ku maka Aku akan memberinya, siapa yang berdo`a kepada-Ku maka Aku akan mengabulkannya, dan siapa yang meminta ampun kepada-Ku maka Aku akan mengampuninya, \" hal itu hingga terbit fajar. \" Maka mereka lebih suka sholat di akhir malam daripada di awal malam. \""
            }
        ]
    }
}