{
    "status": true,
    "data": {
        "start": 865,
        "end": 1008,
        "total": 144,
        "book": "malik",
        "hadits": [
            {
                "number": 865,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ بَلَغَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّهُ قَالَمَا ظَهَرَ الْغُلُولُ فِي قَوْمٍ قَطُّ إِلَّا أُلْقِيَ فِي قُلُوبِهِمْ الرُّعْبُ وَلَا فَشَا الزِّنَا فِي قَوْمٍ قَطُّ إِلَّا كَثُرَ فِيهِمْ الْمَوْتُ وَلَا نَقَصَ قَوْمٌ الْمِكْيَالَ وَالْمِيزَانَ إِلَّا قُطِعَ عَنْهُمْ الرِّزْقُ وَلَا حَكَمَ قَوْمٌ بِغَيْرِ الْحَقِّ إِلَّا فَشَا فِيهِمْ الدَّمُ وَلَا خَتَرَ قَوْمٌ بِالْعَهْدِ إِلَّا سَلَّطَ اللَّهُ عَلَيْهِمْ الْعَدُوَّ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa telah sampai kepadanya dari [Abdullah bin Abbas] ia berkata; \"Tidaklah ghulul menyebar pada suatu kaum, kecuali akan ditimpakan kepada mereka rasa ketakutan. Tidaklah perzinaan itu tersebar pada suatu kaum, kecuali akan banyak kematian menimpa mereka. Tidaklah suatu kaum mengurangi takaran dan timbangan kecuali akan diputus rizki kepada mereka. Tidaklah suatu kaum berhukum kepada selain Al Haq kecuali akan tersebar pembunuhan. Dan tidaklah suatu kamu mengkhianati janji kecuali Allah akan menguasakan musuh atas mereka.\""
            },
            {
                "number": 866,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَوَدِدْتُ أَنِّي أُقَاتِلُ فِي سَبِيلِ اللَّهِ فَأُقْتَلُ ثُمَّ أُحْيَا فَأُقْتَلُ ثُمَّ أُحْيَا فَأُقْتَلُفَكَانَ أَبُو هُرَيْرَةَ يَقُولُ ثَلَاثًا أَشْهَدُ بِاللَّهِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, sungguh aku ingin berperang di jalan Allah hingga terbunuh, lalu aku dihidupkan kembali dan terbunuh, kemudian aku dihidupkan kembali dan terbunuh.\" Abu Hurairah mengatakannya sampai tiga kali; \"Saya bersaksi, demi Allah.\""
            },
            {
                "number": 867,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَضْحَكُ اللَّهُ إِلَى رَجُلَيْنِ يَقْتُلُ أَحَدُهُمَا الْآخَرَ كِلَاهُمَا يَدْخُلُ الْجَنَّةَ يُقَاتِلُ هَذَا فِي سَبِيلِ اللَّهِ فَيُقْتَلُ ثُمَّ يَتُوبُ اللَّهُ عَلَى الْقَاتِلِ فَيُقَاتِلُ فَيُسْتَشْهَدُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Ta'ala tertawa terhadap dua orang laki-laki, salah satu di antara keduanya membunuh yang lain. Tapi keduanya masuk syurga. Yang satu berperang di jalan Allah lalu terbunuh, kemudian Allah menerima taubat seorang pembunuh, lalu pembunuh tersebut berjihad dan terbunuh.\""
            },
            {
                "number": 868,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَا يُكْلَمُ أَحَدٌ فِي سَبِيلِ اللَّهِ وَاللَّهُ أَعْلَمُ بِمَنْ يُكْلَمُ فِي سَبِيلِهِ إِلَّا جَاءَ يَوْمَ الْقِيَامَةِ وَجُرْحُهُ يَثْعَبُ دَمًا اللَّوْنُ لَوْنُ دَمٍ وَالرِّيحُ رِيحُ الْمِسْكِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, tidaklah seseorang terluka di jalan Allah -dan Allah lebih tahu siapa yang terluka di jalan Nya-, kecuali dia akan datang pada Hari Kiamat sedang lukanya tersebut mengalirkan darah segar, warnanya warna darah namun baunya bau kasturi.\""
            },
            {
                "number": 869,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ كَانَ يَقُولُاللَّهُمَّ لَا تَجْعَلْ قَتْلِي بِيَدِ رَجُلٍ صَلَّى لَكَ سَجْدَةً وَاحِدَةً يُحَاجُّنِي بِهَا عِنْدَكَ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] dari [Umar bin Khattab] ia berdo'a: \"Ya Allah, janganlah Kau jadikan kematianku pada tangan seorang laki-laki yang menunaikan sholat kepada-Mu meskipun hanya sekali sujud, yang dengan hal itu aku akan berhujah di depan-Mu pada hari kiamat.\""
            },
            {
                "number": 870,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ أَنَّهُ قَالَجَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنْ قُتِلْتُ فِي سَبِيلِ اللَّهِ صَابِرًا مُحْتَسِبًا مُقْبِلًا غَيْرَ مُدْبِرٍ أَيُكَفِّرُ اللَّهُ عَنِّي خَطَايَايَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَمْ فَلَمَّا أَدْبَرَ الرَّجُلُ نَادَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ أَمَرَ بِهِ فَنُودِيَ لَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ قُلْتَ فَأَعَادَ عَلَيْهِ قَوْلَهُ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَمْ إِلَّا الدَّيْنَ كَذَلِكَ قَالَ لِي جِبْرِيلُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Abu Sa'id Al Maqburi] dari [Abdullah bin Abu Qatadah] dari [Bapaknya] berkata; \"Seorang laki-laki menemui Rasulullah shallallahu 'alaihi wasallam dan bertanya, \"Wahai Rasulullah, jika saya terbunuh di jalan Allah dalam keadaan sabar mengharap ridla-Nya, terus maju tanpa lari dari peperangan, apakah Allah akan mengampuni dosa-dosaku'. Rasulullah shallallahu 'alaihi wasallam bersabda: 'Ya benar'. Tatkala lelaki tadi pergi, Rasulullah memanggilnya kembali, atau memerintahkan seseorang untuk memanggilnya. Beliau bertanya kepadanya: \"Apa yang telah kamu katakan tad?\" laki-laki itu lalu mengulangi ucapannya. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Ya, kecuali hutang. Hal itulah yang dikatakan JIbril kepadaku'.\""
            },
            {
                "number": 871,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي النَّضْرِ مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ أَنَّهُ بَلَغَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِشُهَدَاءِ أُحُدٍ هَؤُلَاءِ أَشْهَدُ عَلَيْهِمْ فَقَالَ أَبُو بَكْرٍ الصِّدِّيقُ أَلَسْنَا يَا رَسُولَ اللَّهِ بِإِخْوَانِهِمْ أَسْلَمْنَا كَمَا أَسْلَمُوا وَجَاهَدْنَا كَمَا جَاهَدُوا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَلَى وَلَكِنْ لَا أَدْرِي مَا تُحْدِثُونَ بَعْدِي فَبَكَى أَبُو بَكْرٍ ثُمَّ بَكَى ثُمَّ قَالَ أَئِنَّا لَكَائِنُونَ بَعْدَكَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Nadlr] mantan budak 'Umar bin 'ubaidhullah, telah sampai kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam berkata kepada para syuhada' Uhud: \"Mereka adalah orang-orang yang telah saya saksikan kematiannya.\" Abu Bakar Ash Shiddiq bertanya; \"Wahai Rasulullah, bukankah kami saudara-saudara mereka juga, kami masuk Islam sebagaimana mereka masuk Islam, dan berjihad sebagaimana mereka berjihad?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Benar, tapi saya tidak tahu apa yang akan kalian lakukan sepeninggalku?\" Abu Bakar menangis, dan beliau juga menangis. Abu Bakar berkata; \"Apakah kami akan menjadi orang-orang yang seperti itu setelah engkau?\""
            },
            {
                "number": 872,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسًا وَقَبْرٌ يُحْفَرُ بِالْمَدِينَةِ فَاطَّلَعَ رَجُلٌ فِي الْقَبْرِ فَقَالَ بِئْسَ مَضْجَعُ الْمُؤْمِنِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِئْسَ مَا قُلْتَ فَقَالَ الرَّجُلُ إِنِّي لَمْ أُرِدْ هَذَا يَا رَسُولَ اللَّهِ إِنَّمَا أَرَدْتُ الْقَتْلَ فِي سَبِيلِ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا مِثْلَ لِلْقَتْلِ فِي سَبِيلِ اللَّهِ مَا عَلَى الْأَرْضِ بُقْعَةٌ هِيَ أَحَبُّ إِلَيَّ أَنْ يَكُونَ قَبْرِي بِهَا مِنْهَا ثَلَاثَ مَرَّاتٍ يَعْنِي الْمَدِينَةَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata; \"Rasulullah shallallahu 'alaihi wasallam sedang duduk-duduk, sementara kuburan yang ada di Madinah sedang digali. Ada seseorang mengamati kuburan tersebut sambil berkata; \"Alangkah buruknya pembaringan seorang mukmin.\" Rasulullah shallallahu 'alaihi wasallam lantas bersabda: \"Alangkah jeleknya apa yang kamu katakan itu.\" Lelaki itu berkata; 'Wahai Rasulullah, bukan itu yang aku maksud. Tetapi orang-orang yang meninggal di jalan Allah.\" Rasulullah shallallahu 'alaihi wasallam bersabda: 'Kematian di medan perang itu tidak ada bandingannya. Tidak ada satu jengkal tanah pun di bumi ini yang lebih aku sukai untuk menjadi kuburanku kecuali darinya.\" -tiga kali- maksudnya adalah di kota Madinah.\""
            },
            {
                "number": 873,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ كَانَ يَقُولُاللَّهُمَّ إِنِّي أَسْأَلُكَ شَهَادَةً فِي سَبِيلِكَ وَوَفَاةً بِبَلَدِ رَسُولِكَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Zaid bin Aslam] bahwa [Umar bin Khattab] pernah berdo'a: \"Ya Allah, saya meminta kepada-Mu mati syahid di jalan-Mu, dan wafat di negeri Rasul-Mu.\""
            },
            {
                "number": 874,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ عُمَرَ بْنَ الْخَطَّابِ قَالَكَرَمُ الْمُؤْمِنِ تَقْوَاهُ وَدِينُهُ حَسَبُهُ وَمُرُوءَتُهُ خُلُقُهُ وَالْجُرْأَةُ وَالْجُبْنُ غَرَائِزُ يَضَعُهَا اللَّهُ حَيْثُ شَاءَ فَالْجَبَانُ يَفِرُّ عَنْ أَبِيهِ وَأُمِّهِ وَالْجَرِيءُ يُقَاتِلُ عَمَّا لَا يَئُوبُ بِهِ إِلَى رَحْلِهِ وَالْقَتْلُ حَتْفٌ مِنْ الْحُتُوفِ وَالشَّهِيدُ مَنْ احْتَسَبَ نَفْسَهُ عَلَى اللَّهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa [Umar bin Khattab] berkata; \"Kemuliaan seorang mukmin adalah ketaqwaannya, agamanya adalah kehormatannya, wibawanya adalah akhlaknya, sedangkan keberanian dan jiwa pengecut adalah adalah naluri yang Allah tanamkan kepada siapa yang Ia kehendaki. Orang yang takut akan lari dari membela bapak dan ibunya, sedang orang yang berani akan berperang membela sesuatu yang tidak akan dibawa ke dalam rumahnya. Gugur dalam peperangan adalah salah satu jenis kematian, sedangkan syahid adalah orang yang menyerahkan jiwanya kepada Allah.\""
            },
            {
                "number": 875,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ عُمَرَ بْنَ الْخَطَّابِ غُسِّلَ وَكُفِّنَ وَصُلِّيَ عَلَيْهِ وَكَانَ شَهِيدًا يَرْحَمُهُ اللَّهُ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Umar bin Khattab dimandikan, lalu dikafani dan disholatkan, padahal dia adalah seorang syahid, mudah-mudahan Allah merahmatinya.\""
            },
            {
                "number": 876,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ عُمَرَ بْنَ الْخَطَّابِكَانَ يَحْمِلُ فِي الْعَامِ الْوَاحِدِ عَلَى أَرْبَعِينَ أَلْفِ بَعِيرٍ يَحْمِلُ الرَّجُلَ إِلَى الشَّامِ عَلَى بَعِيرٍ وَيَحْمِلُ الرَّجُلَيْنِ إِلَى الْعِرَاقِ عَلَى بَعِيرٍ فَجَاءَهُ رَجُلٌ مِنْ أَهْلِ الْعِرَاقِ فَقَالَ احْمِلْنِي وَسُحَيْمًا فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ نَشَدْتُكَ اللَّهَ أَسُحَيْمٌ زِقٌّ قَالَ لَهُ نَعَمْ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] berkata, \"Dalam setahun [Umar bin Khattab] bisa membawa empat puluh ribu unta, yang mana seekor unta membawa seorang lelaki ke syam, dan seekor unta membawa dua orang laki-laki ke Irak. Lalu seorang warga Irak mendatanginya dan berkata; \"Bawalah aku dan Suhaim.\" Maka Umar bin Khattab berkata; \"Aku bersumpah dengan nama Allah atas kamu, apakah suhaim itu tempat air yang terbuat dari kulit?\" laki-laki itu menjawab; \"Ya.\""
            },
            {
                "number": 877,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا ذَهَبَ إِلَى قُبَاءٍ يَدْخُلُ عَلَى أُمِّ حَرَامٍ بِنْتِ مِلْحَانَ فَتُطْعِمُهُ وَكَانَتْ أُمُّ حَرَامٍ تَحْتَ عُبَادَةَ بْنِ الصَّامِتِ فَدَخَلَ عَلَيْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا فَأَطْعَمَتْهُ وَجَلَسَتْ تَفْلِي فِي رَأْسِهِ فَنَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا ثُمَّ اسْتَيْقَظَ وَهُوَ يَضْحَكُ قَالَتْ فَقُلْتُ مَا يُضْحِكُكَ يَا رَسُولَ اللَّهِ قَالَ نَاسٌ مِنْ أُمَّتِي عُرِضُوا عَلَيَّ غُزَاةً فِي سَبِيلِ اللَّهِ يَرْكَبُونَ ثَبَجَ هَذَا الْبَحْرِ مُلُوكًا عَلَى الْأَسِرَّةِ أَوْ مِثْلَ الْمُلُوكِ عَلَى الْأَسِرَّةِ يَشُكُّ إِسْحَقُ قَالَتْ فَقُلْتُ لَهُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ فَدَعَا لَهَا ثُمَّ وَضَعَ رَأْسَهُ فَنَامَ ثُمَّ اسْتَيْقَظَ يَضْحَكُ قَالَتْ فَقُلْتُ لَهُ يَا رَسُولَ اللَّهِ مَا يُضْحِكُكَ قَالَ نَاسٌ مِنْ أُمَّتِي عُرِضُوا عَلَيَّ غُزَاةً فِي سَبِيلِ اللَّهِ مُلُوكًا عَلَى الْأَسِرَّةِ أَوْ مِثْلَ الْمُلُوكِ عَلَى الْأَسِرَّةِ كَمَا قَالَ فِي الْأُولَى قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ فَقَالَ أَنْتِ مِنْ الْأَوَّلِينَ قَالَ فَرَكِبَتْ الْبَحْرَ فِي زَمَانِ مُعَاوِيَةَ فَصُرِعَتْ عَنْ دَابَّتِهَا حِينَ خَرَجَتْ مِنْ الْبَحْرِ فَهَلَكَتْ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam pergi ke Quba, beliau menemui Ummu Haram binti Milhan, lalu Ummu Haram menyuguhi beliau makanan, Ummu Haram adalah isteri 'Ubadah bin Shamit. Pada suatu hari Rasulullah shallallahu 'alaihi wasallam menemuinya, lalu ia memberi makanan kepada beliau. Ummu Haram kemudian duduk menyangga kepala Rasulullah shallallahu 'alaihi wasallam hingga beliau tertidur. Kemudian beliau bangun sambil tertawa, Ummu Haram berkata, \"Aku lalu bertanya, \"Wahai Rasulullah, apa yang membuat anda tertawa?\" Beliau menjawab: \"Telah diperlihatkan kepadaku beberapa orang dari umatku yang berperang di jalan Allah, mereka unggul di atas lautan laksana para raja di atas dipan.\" atau \"Seperti raja-raja di atas dipan.\" -Ishaq ragu akan hal ini- Ummu Haram berkata; \"Aku lalu bertanya kepada Rasulullah, 'Wahai Rasulullah, doakanlah agar aku termasuk dari mereka.\" Beliau lantas mendoakan Ummu Haram dan kembali melerakkan kepalanya untuk tidur. Kemudian beliau bangun dan tertawa, Ummu Haram bertanya, \"Wahai Rasulullah, apa yang membuat anda tertawa?\" beliau menjawab; \"Telah diperlihatkan kepadaku sekelompok orang dari umatku yang berjuang di jalan Allah, mereka seperti para raja di atas dipan.\" atau \"Seperti raja-raja yang berada di atas dipan…sebagaimana yang disabdakan pertama tadi. Ummu Haram berkata; \"Wahai Rasulullah, berdoalah agar aku termasuk dari mereka.\" Beliau bersabda: \"Kamu termasuk orang-orang yang pertama dari mereka.\" Anas bin Malik berkata; \"Ummu Haram mengarungi lautan pada masa Mu'awiyah, lalu ketika hendak menepi ke pantai, dia terlempar dari kendaraannya dan meninggal dunia.\""
            },
            {
                "number": 878,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَحْبَبْتُ أَنْ لَا أَتَخَلَّفَ عَنْ سَرِيَّةٍ تَخْرُجُ فِي سَبِيلِ اللَّهِ وَلَكِنِّي لَا أَجِدُ مَا أَحْمِلُهُمْ عَلَيْهِ وَلَا يَجِدُونَ مَا يَتَحَمَّلُونَ عَلَيْهِ فَيَخْرُجُونَ وَيَشُقُّ عَلَيْهِمْ أَنْ يَتَخَلَّفُوا بَعْدِي فَوَدِدْتُ أَنِّي أُقَاتِلُ فِي سَبِيلِ اللَّهِ فَأُقْتَلُ ثُمَّ أُحْيَا فَأُقْتَلُ ثُمَّ أُحْيَا فَأُقْتَلُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Abu Shalih As-Saman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seandainya tidak khawatir memberatkan umatku, sungguh aku tidak ingin tertinggal dari pasukan yang keluar untuk jihad di jalan Allah, tapi aku stidak menemukan sesuatu yang dapat aku persiapkan untuk mereka, dan mereka juga tidak mendapatkan sesuatu pun yang dapat mereka bawa hingga mereka dapat keluar berperang. Berat perasaan mereka untuk tidak ikut perang setelah kepergianku. Sungguh, ingin sekali aku berperang di jalan Allah hingga terbunuh, kemudian dihidupkan dan terbunuh, kemudian dihidupkan dan terbunuh."
            },
            {
                "number": 879,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ قَالَلَمَّا كَانَ يَوْمُ أُحُدٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يَأْتِينِي بِخَبَرِ سَعْدِ بْنِ الرَّبِيعِ الْأَنْصَارِيِّ فَقَالَ رَجُلٌ أَنَا يَا رَسُولَ اللَّهِ فَذَهَبَ الرَّجُلُ يَطُوفُ بَيْنَ الْقَتْلَى فَقَالَ لَهُ سَعْدُ بْنُ الرَّبِيعِ مَا شَأْنُكَ فَقَالَ لَهُ الرَّجُلُ بَعَثَنِي إِلَيْكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِآتِيَهُ بِخَبَرِكَ قَالَ فَاذْهَبْ إِلَيْهِ فَاقْرَأْهُ مِنِّي السَّلَامَ وَأَخْبِرْهُ أَنِّي قَدْ طُعِنْتُ اثْنَتَيْ عَشْرَةَ طَعْنَةً وَأَنِّي قَدْ أُنْفِذَتْ مَقَاتِلِي وَأَخْبِرْ قَوْمَكَ أَنَّهُ لَا عُذْرَ لَهُمْ عِنْدَ اللَّهِ إِنْ قُتِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَوَاحِدٌ مِنْهُمْ حَيٌّ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata, \"Saat terjadi perang uhud Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang dapat memberitahuku tentang keadaan Sa'ad bin Rabi' Al Anshari? ' lalu ada seorang lelaki berkata; \"Saya, wahai Rasulullah! \" laki-laki itu lantas pergi mencari Sa'ad di antara para syuhada'. Sa'ad bin Rabi' bertanya; \"Sedang apa kamu?\" Laki-laki itu menjawab; \"Rasulullah shallallahu 'alaihi wasallam mengutusku kepadamu supaya aku mendapatkan khabar tentangmu.\" Sa'd berkata; \"Pergilah kepada beliau, sampaikan salam dariku dan kabarkan kepada beliau bahwa aku mendapat luka tusukan sebanyak dua belas tusukan. Aku merasa bahwa kematianku telah dekat. Kabarkanlah kepada kaummu bahwa tidak ada udzur bagi mereka di sisi Allah, jika Rasulullah shallallahu 'alaihi wasallam terbunuh sementara salah satu dari mereka masih ada yang hidup.\""
            },
            {
                "number": 880,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَغَّبَ فِي الْجِهَادِ وَذَكَرَ الْجَنَّةَ وَرَجُلٌ مِنْ الْأَنْصَارِ يَأْكُلُ تَمَرَاتٍ فِي يَدِهِ فَقَالَ إِنِّي لَحَرِيصٌ عَلَى الدُّنْيَا إِنْ جَلَسْتُ حَتَّى أَفْرُغَ مِنْهُنَّ فَرَمَى مَا فِي يَدِهِ فَحَمَلَ بِسَيْفِهِ فَقَاتَلَ حَتَّى قُتِلَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata, \"Rasulullah shallallahu 'alaihi wasallam selalu memotivasi para sahabat untuk berjihad dan mengingatkan mereka akan keindahan syurga. Saat itu ada seorang laki-laki Anshar sedang makan beberapa biji kurma yang ada di tangannya, laki-laki itu lalu berkata; \"Saya termasuk orang yang tamak terhadap dunia, jika saya sampai menghabiskan kurma ini.\" Laki-laki itu kemudian membuang kurma yang ada di tangannya seraya meraih pedang dan maju untuk berperang hingga terbunuh.\""
            },
            {
                "number": 881,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُعَاذِ بْنِ جَبَلٍ أَنَّهُ قَالَالْغَزْوُ غَزْوَانِ فَغَزْوٌ تُنْفَقُ فِيهِ الْكَرِيمَةُ وَيُيَاسَرُ فِيهِ الشَّرِيكُ وَيُطَاعُ فِيهِ ذُو الْأَمْرِ وَيُجْتَنَبُ فِيهِ الْفَسَادُ فَذَلِكَ الْغَزْوُ خَيْرٌ كُلُّهُ وَغَزْوٌ لَا تُنْفَقُ فِيهِ الْكَرِيمَةُ وَلَا يُيَاسَرُ فِيهِ الشَّرِيكُ وَلَا يُطَاعُ فِيهِ ذُو الْأَمْرِ وَلَا يُجْتَنَبُ فِيهِ الْفَسَادُ فَذَلِكَ الْغَزْوُ لَا يَرْجِعُ صَاحِبُهُ كَفَافًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Mu'adz bin Jabal] berkata; \"Perang itu ada dua macam; perang yang didanai dengan harta yang berharga (halal), bagi orang-orang yang bergabung dimudahkan, panglima ditaati, dan dijauhinya segala bentuk pengrusakan, maka itulah perang yang semuanya bernilai kebaikan. Adapun perang yang di dalamnya: tidak diinfakkannya harta yang berharga, orang-orang yang bergabung tidak dimudahkannya, panglima tidak ditaati, dan segala bentuk pengrusakan tidak dijauhi, maka perang semacam itu tidak akan bermanfaat bagi bala tentaranya.\""
            },
            {
                "number": 882,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْخَيْلُ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada ubun-ubun kuda terdapat kebaikan hingga Hari Kiamat.\""
            },
            {
                "number": 883,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَابَقَ بَيْنَ الْخَيْلِ الَّتِي قَدْ أُضْمِرَتْ مِنْ الْحَفْيَاءِ وَكَانَ أَمَدُهَا ثَنِيَّةَ الْوَدَاعِ وَسَابَقَ بَيْنَ الْخَيْلِ الَّتِي لَمْ تُضَمَّرْ مِنْ الثَّنِيَّةِ إِلَى مَسْجِدِ بَنِي زُرَيْقٍ وَأَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ كَانَ مِمَّنْ سَابَقَ بِهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mempertandingkan kuda yang telah dipersiapkan untuk pacuan dari Haifa' hingga Tsaniyyatul Wada'. Beliau juga pernah mempertandingkan kuda yang tidak dipersiapkan untuk pacuan, dimulai dari Tsaniyyah sampai ke masjid Bani Zuraiq. Dan Abdullah bin Umar termasuk salah seorang pemenangnya.\""
            },
            {
                "number": 884,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ يَقُولُلَيْسَ بِرِهَانِ الْخَيْلِ بَأْسٌ إِذَا دَخَلَ فِيهَا مُحَلِّلٌ فَإِنْ سَبَقَ أَخَذَ السَّبَقَ وَإِنْ سُبِقَ لَمْ يَكُنْ عَلَيْهِ شَيْءٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa ia mendengar [Sa'id bin Musayyab] berkata, \"Tidak mengapa pacuan kuda dilakukan apabila ada penghalalnya. Jika dia menang maka dia berhak mengambil taruhan, dan jika kalah maka dia tidak wajib membayar sesuatupun.\""
            },
            {
                "number": 885,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُئِيَ وَهُوَ يَمْسَحُ وَجْهَ فَرَسِهِ بِرِدَائِهِ فَسُئِلَ عَنْ ذَلِكَ فَقَالَ إِنِّي عُوتِبْتُ اللَّيْلَةَ فِي الْخَيْلِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata, \"Rasulullah shallallahu 'alaihi wasallam bermimpi sedang mengusap wajah kudanya dengan selendangnya. Ketika ditanyakan tentang hal itu, beliau menjawab; \"Tadi malam aku diberi diteguran tentang kuda.\""
            },
            {
                "number": 886,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ خَرَجَ إِلَى خَيْبَرَ أَتَاهَا لَيْلًا وَكَانَ إِذَا أَتَى قَوْمًا بِلَيْلٍ لَمْ يُغِرْ حَتَّى يُصْبِحَ فَلَمَّا أَصْبَحَ خَرَجَتْ يَهُودُ بِمَسَاحِيهِمْ وَمَكَاتِلِهِمْ فَلَمَّا رَأَوْهُ قَالُوا مُحَمَّدٌ وَاللَّهِ مُحَمَّدٌ وَالْخَمِيسُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُ أَكْبَرُ خَرِبَتْ خَيْبَرُ إِنَّا إِذَا نَزَلْنَا بِسَاحَةِ قَوْمٍ{ فَسَاءَ صَبَاحُ الْمُنْذَرِينَ }",
                "id": "Telah menceritakan kepadaku dari Malik dari [Humaid Ath Thawil] dari [Anas bin Malik] berkata, \"Tatkala Rasulullah shallallahu 'alaihi wasallam keluar ke Khaibar, beliau memasuki kota itu pada waktu malam. Jika beliau mendatangi suatu kaum pada malam hari, beliau tidak akan menyerang mereka hingga terbit fajar. Tatkala pagi hari, orang-orang Yahudi keluar membawa cangkul dan keranjang mereka. Ketika mereka melihat Rasulullah shallallahu 'alaihi wasallam, mereka berkata; \"Muhammad! Demi Allah, Muhammad dan tentaranya (datang)! \" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allahu Akbar, hancurlah Khaibar, jika kami memasuki halaman suatu kaum niscaya '(…Maka amat buruklah pagi hari yang dialami oleh orang-orang yang diperingatkan itu) '.\" (Qs. Ash Shaffaat: 177) "
            },
            {
                "number": 887,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَنْفَقَ زَوْجَيْنِ فِي سَبِيلِ اللَّهِ نُودِيَ فِي الْجَنَّةِ يَا عَبْدَ اللَّهِ هَذَا خَيْرٌ فَمَنْ كَانَ مِنْ أَهْلِ الصَّلَاةِ دُعِيَ مِنْ بَابِ الصَّلَاةِ وَمَنْ كَانَ مِنْ أَهْلِ الْجِهَادِ دُعِيَ مِنْ بَابِ الْجِهَادِ وَمَنْ كَانَ مِنْ أَهْلِ الصَّدَقَةِ دُعِيَ مِنْ بَابِ الصَّدَقَةِ وَمَنْ كَانَ مِنْ أَهْلِ الصِّيَامِ دُعِيَ مِنْ بَابِ الرَّيَّانِ فَقَالَ أَبُو بَكْرٍ الصِّدِّيقُ يَا رَسُولَ اللَّهِ مَا عَلَى مَنْ يُدْعَى مِنْ هَذِهِ الْأَبْوَابِ مِنْ ضَرُورَةٍ فَهَلْ يُدْعَى أَحَدٌ مِنْ هَذِهِ الْأَبْوَابِ كُلِّهَا قَالَ نَعَمْ وَأَرْجُو أَنْ تَكُونَ مِنْهُمْ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Humaid bin Abdurrahman bin 'Auf] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menginfakkan sepasang barang di jalan Allah, maka di surga ia akan diseru, 'Wahai Abdullah, ini adalah sebuah kebaikan.' Bila dia ahli sholat maka dia akan dipanggil dari pintu sholat. Bila dia ahli jihad, maka dia akan dipanggil dari pintu jihad. Bila dia ahli sedekah, maka akan dipanggil dari pintu sedekah. Bila dia ahli puasa, maka dia akan dipanggil dari pintu Ar Rayyan.\" Abu Bakar Ash Shiddiq berkata; \"Wahai Rasulullah, jika seseorang dipanggil dari salah satu pintu dari pintu-pintu yang ada, itu sebuah kepastian, namun mungkinkah jika seseorang dipanggil dari keseluruhan pintu yang ada? Nabi menjawab, \"Itu sangat mungkin, dan aku yakin engkau di antara mereka yang dipanggil dari kesemua pintunya.\""
            },
            {
                "number": 888,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ أَنَّهُ بَلَغَهُأَنَّ عَمْرَو بْنَ الْجَمُوحِ وَعَبْدَ اللَّهِ بْنَ عَمْرٍو الْأَنْصَارِيَّيْنِ ثُمَّ السَّلَمِيَّيْنِ كَانَا قَدْ حَفَرَ السَّيْلُ قَبْرَهُمَا وَكَانَ قَبْرُهُمَا مِمَّا يَلِي السَّيْلَ وَكَانَا فِي قَبْرٍ وَاحِدٍ وَهُمَا مِمَّنْ اسْتُشْهِدَ يَوْمَ أُحُدٍ فَحُفِرَ عَنْهُمَا لِيُغَيَّرَا مِنْ مَكَانِهِمَا فَوُجِدَا لَمْ يَتَغَيَّرَا كَأَنَّهُمَا مَاتَا بِالْأَمْسِ وَكَانَ أَحَدُهُمَا قَدْ جُرِحَ فَوَضَعَ يَدَهُ عَلَى جُرْحِهِ فَدُفِنَ وَهُوَ كَذَلِكَ فَأُمِيطَتْ يَدُهُ عَنْ جُرْحِهِ ثُمَّ أُرْسِلَتْ فَرَجَعَتْ كَمَا كَانَتْ وَكَانَ بَيْنَ أُحُدٍ وَبَيْنَ يَوْمَ حُفِرَ عَنْهُمَا سِتٌّ وَأَرْبَعُونَ سَنَةً",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdurrahman bin Abu Sha'sha'ah] telah sampai kepadanya bahwa kuburan 'Amru bin Jamuh dan Abdullah bin 'Amru -keduanya dari Anshar dari Bani Salam- rusak akibat hujan yang merendamnya. Hal itu karena kuburan berada di area banjir, keduanya dikubur dalam satu liang, dan mereka termasuk kurban yang terbunuh dalam perang uhud. Lalu digalilah kuburan mereka untuk dipindahkan, namun jasad keduanya tidak berubah sama sekali, seakan-akan keduanya baru meninggal kemarin. Salah seorang dari mereka terluka dan melerakkan tangannya pada lukanya, lalu ia dikuburkan dalam kondisi seperti itu. Setelah digali, tangannya berusaha untuk diluruskan namun tidak bisa (kembali ke tempatnya semula) . Padahal jarak antara perang uhud dan saat penggalian itu dilakukan adalah empat puluh enam tahun.\""
            },
            {
                "number": 889,
                "arab": "حَدَّثَنِي عَنْ مَالِك عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ أَنَّهُ قَالَ قَدِمَ عَلَى أَبِي بَكْرٍ الصِّدِّيقِ مَالٌ مِنْ الْبَحْرَيْنِ فَقَالَمَنْ كَانَ لَهُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأْيٌ أَوْ عِدَةٌ فَلْيَأْتِنِي فَجَاءَهُ جَابِرُ بْنُ عَبْدِ اللَّهِ فَحَفَنَ لَهُ ثَلَاثَ حَفَنَاتٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Rabi'ah bin Abu Abdurrahman] berkata; \"Harta ghanimah dari Bahrain tiba di hadapan Abu Bakar Ash Shiddiq, lalu ia berkata; 'Barangsiapa mempunyai janji di sisi Rasulullah shallallahu 'alaihi wasallam, maka hendaklah ia datang kemari.\" Lalu Jabir bin Abdullah datang menemuinya, lalu Abu Bakar memberinya tiga genggam harta.\""
            },
            {
                "number": 890,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّ سَعْدَ بْنَ عُبَادَةَ اسْتَفْتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أُمِّي مَاتَتْ وَعَلَيْهَا نَذْرٌ وَلَمْ تَقْضِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْضِهِ عَنْهَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari ['ubaidhullah bin Abdullah bin 'Utbah bin Mas'ud] dari [Abdullah bin Abbas] berkata, \"Sa'ad bin Ubadah meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam, \"Ibuku telah meninggal sedang dia masih mempunyai nadzar yang belum dia tunaikan, \" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tunaikanlah nadzarnya.\""
            },
            {
                "number": 891,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ عَمَّتِهِأَنَّهَا حَدَّثَتْهُ عَنْ جَدَّتِهِ أَنَّهَا كَانَتْ جَعَلَتْ عَلَى نَفْسِهَا مَشْيًا إِلَى مَسْجِدِ قُبَاءٍ فَمَاتَتْ وَلَمْ تَقْضِهِ فَأَفْتَى عَبْدُ اللَّهِ بْنُ عَبَّاسٍ ابْنَتَهَا أَنْ تَمْشِيَ عَنْهَاقَالَ يَحْيَى و سَمِعْت قَوْله تَعَالَى يَقُولُ لَا يَمْشِي أَحَدٌ عَنْ أَحَدٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar] dari bibinya bahwa ia menceritakan dari Neneknya bahwasanya ia pernah bernadzar untuk berjalan hingga ke masjid Quba, namun ia meninggal sebelum menunaikan nadzarnya. Lalu [Abdullah bin Abbas] memerintahkan anak perempuannya untuk berjalan hingga ke masjid Quba menggantikan ibunya.\" Yahya berkata, \"Aku mendengar Malik berkata; \"Seseorang tidak layak berjalan untuk menggantikan (nadzar) orang lain.\""
            },
            {
                "number": 892,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي حَبِيبَةَ قَالَقُلْتُ لِرَجُلٍ وَأَنَا حَدِيثُ السِّنِّ مَا عَلَى الرَّجُلِ أَنْ يَقُولَ عَلَيَّ مَشْيٌ إِلَى بَيْتِ اللَّهِ وَلَمْ يَقُلْ عَلَيَّ نَذْرُ مَشْيٍ فَقَالَ لِي رَجُلٌ هَلْ لَكَ أَنْ أُعْطِيَكَ هَذَا الْجِرْوَ لِجِرْوِ قِثَّاءٍ فِي يَدِهِ وَتَقُولُ عَلَيَّ مَشْيٌ إِلَى بَيْتِ اللَّهِ قَالَ فَقُلْتُ نَعَمْ فَقُلْتُهُ وَأَنَا يَوْمَئِذٍ حَدِيثُ السِّنِّ ثُمَّ مَكَثْتُ حَتَّى عَقَلْتُ فَقِيلَ لِي إِنَّ عَلَيْكَ مَشْيًا فَجِئْتُ سَعِيدَ بْنَ الْمُسَيَّبِ فَسَأَلْتُهُ عَنْ ذَلِكَ فَقَالَ لِي عَلَيْكَ مَشْيٌ فَمَشَيْتُقَالَ مَالِك وَهَذَا الْأَمْرُ عِنْدَنَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Habibah] berkata; \"Aku berkata kepada seseorang, padahal waktu itu aku masih kecil, \"Tidak boleh seseorang mengatakan 'Saya wajibkan atas diriku untuk berjalan ke Baitullah', dan tidak mengatakan 'Saya bernadzar untuk berjalan'.\" Lalu ada seorang laki-laki berkata kepadaku, \"Apakah kamu bersedia menerima buah ini -sambil menunjukkan buah mentimun-, dengan syarat kamu mengatakan 'Wajib bagiku untuk berjalan hingga ke Baitullah'?\" Abdullah bin Abu Habibah berkata; \"Ya.\" Hal itu saya katakan ketika aku masih kecil, ketika aku telah dewasa dan bisa berfikir, maka dikatakanlah kepadaku, \"Engkau mempunyai kewajiban untuk berjalan (menepati nadzar) .\" Maka aku pun mendatangi [Sa'id Ibnul Musayyab] dan bertanya mengenai hal itu. Dia menjawab; 'Wajib bagimu untuk menepati nadzarmu', maka aku pun berjalan hingga ke Baitullah.\" Malik berkata; \"Inilah pendapat kami.\""
            },
            {
                "number": 893,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عُرْوَةَ بْنِ أُذَيْنَةَ اللَّيْثِيِّ أَنَّهُ قَالَخَرَجْتُ مَعَ جَدَّةٍ لِي عَلَيْهَا مَشْيٌ إِلَى بَيْتِ اللَّهِ حَتَّى إِذَا كُنَّا بِبَعْضِ الطَّرِيقِ عَجَزَتْ فَأَرْسَلَتْ مَوْلًى لَهَا يَسْأَلُ عَبْدَ اللَّهِ بْنَ عُمَرَ فَخَرَجْتُ مَعَهُ فَسَأَلَ عَبْدَ اللَّهِ بْنَ عُمَرَ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ مُرْهَا فَلْتَرْكَبْ ثُمَّ لْتَمْشِ مِنْ حَيْثُ عَجَزَتْقَالَ يَحْيَى و سَمِعْت قَوْله تَعَالَى يَقُولُ وَنَرَى عَلَيْهَا مَعَ ذَلِكَ الْهَدْيَ و حَدَّثَنِي عَنْ مَالِك أَنَّهُ بَلَغَهُ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ وَأَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ كَانَا يَقُولَانِ مِثْلَ قَوْلِ عَبْدِ اللَّهِ بْنِ عُمَرَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Urwah bin Udzainah Al Laitsi] berkata; \"Saya keluar bersama nenekku yang mempunyai hutang nadzar berjalan hingga ke Baitullah, hingga ketika sampai setengah perjalanan ia merasa lemah. Lalu ia mengutus budaknya untuk bertanya kepada Abdullah bin Umar, dan aku ikut bersama budak itu menemui Abdullah bin Umar. [Abdullah bin Umar] menjawab; 'Suruhlah nenek tadi berkendaraan, setelah itu ulangilah pada waktu lain dengan berjalan dari tempat di mana dia berhenti.\" Yahya berkata; \"Saya mendengar Malik berkata; 'Menurut pendapat kami, di samping itu dia harus menggantinya dengan sembelihan.\" Telah menceritakan kepadaku dari Malik bahwa telah sampai berita kepadanya, bahwa Sa'id bin Musayyab dan Abu Salamah berpendapat sebagaimana pendapat Abdullah bin 'Umar."
            },
            {
                "number": 894,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ قَالَكَانَ عَلَيَّ مَشْيٌ فَأَصَابَتْنِي خَاصِرَةٌ فَرَكِبْتُ حَتَّى أَتَيْتُ مَكَّةَ فَسَأَلْتُ عَطَاءَ بْنَ أَبِي رَبَاحٍ وَغَيْرَهُ فَقَالُوا عَلَيْكَ هَدْيٌ فَلَمَّا قَدِمْتُ الْمَدِينَةَ سَأَلْتُ عُلَمَاءَهَا فَأَمَرُونِي أَنْ أَمْشِيَ مَرَّةً أُخْرَى مِنْ حَيْثُ عَجَزْتُ فَمَشَيْتُقَالَ يَحْيَى و سَمِعْت قَوْله تَعَالَى يَقُولُ فَالْأَمْرُ عِنْدَنَا فِيمَنْ يَقُولُ عَلَيَّ مَشْيٌ إِلَى بَيْتِ اللَّهِ أَنَّهُ إِذَا عَجَزَ رَكِبَ ثُمَّ عَادَ فَمَشَى مِنْ حَيْثُ عَجَزَ فَإِنْ كَانَ لَا يَسْتَطِيعُ الْمَشْيَ فَلْيَمْشِ مَا قَدَرَ عَلَيْهِ ثُمَّ لْيَرْكَبْ وَعَلَيْهِ هَدْيُ بَدَنَةٍ أَوْ بَقَرَةٍ أَوْ شَاةٍ إِنْ لَمْ يَجِدْ إِلَّا هِيَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata; \"Aku bernadzar untuk berjalan kaki, tetapi kemudian aku terkena sakit pinggang sehingga aku naik kendaraan sampai tiba di Makkah. Aku lalu bertanya kepada [Atha bin Abu Rabah] dan yang lainnya. Mereka menjawab; 'Kamu wajib menyembelih hewan.\" Ketika tiba di Madinah, aku bertanya kepada para ulama' yang ada di sana. Mereka juga menyuruhku untuk berjalan sekali lagi dari tempat di mana aku berhenti karena kelelahan. Maka aku lalu melaksanakan perintah tersebut.\" Yahya berkata; \"Saya telah mendengar Malik berkata, \"Menurut pendapat kami tentang orang yang berkata 'Wajib bagiku untuk berjalan ke Ka'bah', maka jika memang ia tidak mampu, ia boleh berkendaraan. Kemudian ia kembali dan berjalan dari tempat semua saat ia merasakan kelelahan. Jika dia tidak mampu berjalan lagi maka hendaknya ia tetap berjalan semampunya, lalu berkendaraan. Baru kemudian ia wajib menyembelih unta, atau sapi atau kambing jika memang tidak mampu kecuali hanya itu.\""
            },
            {
                "number": 895,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ حُمَيْدِ بْنِ قَيْسٍ وَثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ أَنَّهُمَا أَخْبَرَاهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَحَدُهُمَا يَزِيدُ فِي الْحَدِيثِ عَلَى صَاحِبِهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا قَائِمًا فِي الشَّمْسِ فَقَالَ مَا بَالُ هَذَا فَقَالُوا نَذَرَ أَنْ لَا يَتَكَلَّمَ وَلَا يَسْتَظِلَّ مِنْ الشَّمْسِ وَلَا يَجْلِسَ وَيَصُومَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرُوهُ فَلْيَتَكَلَّمْ وَلْيَسْتَظِلَّ وَلْيَجْلِسْ وَلْيُتِمَّ صِيَامَهُقَالَ مَالِك وَلَمْ أَسْمَعْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ بِكَفَّارَةٍ وَقَدْ أَمَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتِمَّ مَا كَانَ لِلَّهِ طَاعَةً وَيَتْرُكَ مَا كَانَ لِلَّهِ مَعْصِيَةً",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Humaid bin Qais] dan [Tsaur bin Zaid Ad Dili] bahwa keduanya mengabarkan kepadanya suatu hadits dari Rasulullah shallallahu 'alaihi wasallam, lalu salah seorang dari keduanya menambahi keterangan sahabatnya, bahwa Rasulullah shallallahu 'alaihi wasallam pernah melihat seseorang berdiri di bawah terik matahari. Beliau bertanya: \"Untuk apa dia lakukan ini?\" Mereka menjawab; \"Dia telah bernadzar untuk tidak berbicara dan tidak berteduh dari terik matahari serta tidak pula duduk sambil berpuasa.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Suruhlah dia untuk berbicara, berteduh, duduk dan melanjutkan puasanya.\" Malik berkata; \"Saya tidak mendengar Rasulullah shallallahu 'alaihi wasallam menyuruhnya untuk membayar kafarat, \" Rasulullah shallallahu 'alaihi wasallam menyuruhnya untuk menyempurnakan janji kepada Allah berupa ketaatan (puasa) dan meninggalkan janji kepada Allah berupa kemaksiatan (nadzar di luar kemampuan) .\""
            },
            {
                "number": 896,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ أَنَّهُ سَمِعَهُ يَقُولُ أَتَتْ امْرَأَةٌ إِلَى عَبْدِ اللَّهِ بْنِ عَبَّاسٍفَقَالَتْ إِنِّي نَذَرْتُ أَنْ أَنْحَرَ ابْنِي فَقَالَ ابْنُ عَبَّاسٍ لَا تَنْحَرِي ابْنَكِ وَكَفِّرِي عَنْ يَمِينِكِ فَقَالَ شَيْخٌ عِنْدَ ابْنِ عَبَّاسٍ وَكَيْفَ يَكُونُ فِي هَذَا كَفَّارَةٌ فَقَالَ ابْنُ عَبَّاسٍ إِنَّ اللَّهَ تَعَالَى قَالَ{ وَالَّذِينَ يُظَاهِرُونَ }مِنْكُمْ{ مِنْ نِسَائِهِمْ }ثُمَّ جَعَلَ فِيهِ مِنْ الْكَفَّارَةِ مَا قَدْ رَأَيْتَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Al Qasim bin Muhammad] Bahwasanya ia mendengarnya berkata, \"Seorang wanita menemui Abdullah bin Abbas dan berkata; \"Saya telah bernadzar untuk menyembelih anakku.\" [Ibnu Abbas] lalu berkata; \"Jangan kamu sembelih anakmu, dan bayarlah denda atas sumpahmu.\" Kemudian orang tua yang berada di sisi Ibnu Abbas berkata, \"Bagaimana bisa dia harus membayar kafarah? ' Ibnu Abbas menjawab; \"Allah Ta'ala berfirman: '(Dan orang-orang yang melakukan zhihar di antara kalian terhadap isteri-isteri mereka) ' (Qs. Al Mujadilah: 3) kemudian Allah menetapkan kafarah padanya sebagaimana yang kamu ketahui.\""
            },
            {
                "number": 897,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ الْأَيْلِيِّ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ ابْنِ الصِّدِّيقِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلَا يَعْصِهِقَالَ يَحْيَى و سَمِعْت قَوْله تَعَالَى يَقُولُ مَعْنَى قَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلَا يَعْصِهِ أَنْ يَنْذِرَ الرَّجُلُ أَنْ يَمْشِيَ إِلَى الشَّامِ أَوْ إِلَى مِصْرَ أَوْ إِلَى الرَّبَذَةِ أَوْ مَا أَشْبَهَ ذَلِكَ مِمَّا لَيْسَ لِلَّهِ بِطَاعَةٍ إِنْ كَلَّمَ فُلَانًا أَوْ مَا أَشْبَهَ ذَلِكَ فَلَيْسَ عَلَيْهِ فِي شَيْءٍ مِنْ ذَلِكَ شَيْءٌ إِنْ هُوَ كَلَّمَهُ أَوْ حَنِثَ بِمَا حَلَفَ عَلَيْهِ لِأَنَّهُ لَيْسَ لِلَّهِ فِي هَذِهِ الْأَشْيَاءِ طَاعَةٌ وَإِنَّمَا يُوَفَّى لِلَّهِ بِمَا لَهُ فِيهِ طَاعَةٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Thalhah bin Abdul Malik Al Aili] dari [Al Qasim bin Muhammad bin Ash-Shiddiq] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bernadzar untuk taat kepada Allah, maka hendaklah ia lakukan. Barangsiapa bernadzar untuk bermaksiat kepada-Nya, maka janganlah ia dilakukan.\" Yahya berkata; \"Saya mendengar Malik berkata; Makna sabda Rasulullah shallallahu 'alaihi wasallam \"Barangsiapa bernadzar untuk bermaksiat kepada-Nya, maka janganlah ia melakukannya, \" yakni jika seseorang bernadzar untuk berjalan ke negeri Syam, atau ke Mesir, atau ke Rabadzah, atau ke tempat lain yang tidak ada nilai ketaatan kepada Allah, atau jika dia mengajak bicara kepada seseorang atau selainnya. Maka tidak ada kewajiban baginya dari hal itu; jika dia memberi tahu seseorang atau mengingkari janji tersebut, karena hal ini tidak ada nilai ketaatan. Janji Allah itu harus ditepati jika ada nilai ketaatan di dalamnya.\""
            },
            {
                "number": 898,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ أَنَّهَا كَانَتْ تَقُولُلَغْوُ الْيَمِينِ قَوْلُ الْإِنْسَانِ لَا وَاللَّهِ لَا وَاللَّهِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] Ummul Mukminin, ia berkata; \"Sumpah yang tidak dianggap adalah ucapan seseorang, \"Tidak, Demi Allah, tidak, Demi Allah.\""
            },
            {
                "number": 899,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ كَانَ يَقُولُمَنْ قَالَ وَاللَّهِ ثُمَّ قَالَ إِنْ شَاءَ اللَّهُ ثُمَّ لَمْ يَفْعَلْ الَّذِي حَلَفَ عَلَيْهِ لَمْ يَحْنَثْ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata; \"Barangsiapa berkata; 'Demi Allah, ' kemudian dia berkata 'INSYA AllAH' (jika Allah menghendaki), kemudian dia tidak melaksanakan sumpah tersebut maka dia tidak termasuk orang yang melanggar sumpah.\""
            },
            {
                "number": 900,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَلَفَ بِيَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيُكَفِّرْ عَنْ يَمِينِهِ وَلْيَفْعَلْ الَّذِي هُوَ خَيْرٌ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: \"Barangsiapa bersumpah dengan suatu sumpah, lalu dia melihat hal lain yang lebih baik dari apa yang ia sumpahkan, maka hendaknya dia membayar denda atas sumpahnya tersebut lalu melaksanakan hal yang lebih baik tersebut.\""
            },
            {
                "number": 901,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ كَانَ يَقُولُمَنْ حَلَفَ بِيَمِينٍ فَوَكَّدَهَا ثُمَّ حَنِثَ فَعَلَيْهِ عِتْقُ رَقَبَةٍ أَوْ كِسْوَةُ عَشَرَةِ مَسَاكِينَ وَمَنْ حَلَفَ بِيَمِينٍ فَلَمْ يُؤَكِّدْهَا ثُمَّ حَنِثَ فَعَلَيْهِ إِطْعَامُ عَشَرَةِ مَسَاكِينَ لِكُلِّ مِسْكِينٍ مُدٌّ مِنْ حِنْطَةٍ فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلَاثَةِ أَيَّامٍ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] ia berkata; \"Barangsiapa bersumpah dengan suatu sumpah, lalu ia menguatkan sumpah tersebut kemudian melanggarnya, maka wajib baginya memerdekakan budak atau memberi pakaian kepada sepuluh orang miskin. Barangsiapa bersumpah dengan suatu sumpah dan ia tidak menguatkan sumpah tersebut, lalu melanggarnya maka wajib baginya memberi makan sepuluh orang miskin, setiap orang mendapat satu mud gandum. Dan bagi yang tidak mendapatkannya, hendaklah ia berpuasa selama tiga hari.\""
            },
            {
                "number": 902,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّهُ كَانَ يُكَفِّرُ عَنْ يَمِينِهِ بِإِطْعَامِ عَشَرَةِ مَسَاكِينَ لِكُلِّ مِسْكِينٍ مُدٌّ مِنْ حِنْطَةٍ وَكَانَ يَعْتِقُ الْمِرَارَ إِذَا وَكَّدَ الْيَمِينَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] bahwasanya ia pernah membayar denda atas sumpahnya dengan memberi makan kepada sepuluh orang miskin, setiap orang miskin mendapat satu mud gandum. Dan jika menegaskan sumpahnya maka ia memerdekakan seorang budak.\""
            },
            {
                "number": 903,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ أَنَّهُ قَالَأَدْرَكْتُ النَّاسَ وَهُمْ إِذَا أَعْطَوْا فِي كَفَّارَةِ الْيَمِينِ أَعْطَوْا مُدًّا مِنْ حِنْطَةٍ بِالْمُدِّ الْأَصْغَرِ وَرَأَوْا ذَلِكَ مُجْزِئًا عَنْهُمْ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sulaiman bin Yasar] ia berkata; \"Saya mendapati orang-orang yang jika mereka memberikan kafarat atas sumpah, maka mereka akan memberikan satu mud gandum dengan ukuran mud yang lebih kecil, dan mereka anggap hal itu sudah cukup.\""
            },
            {
                "number": 904,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَدْرَكَ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ وَهُوَ يَسِيرُ فِي رَكْبٍ وَهُوَ يَحْلِفُ بِأَبِيهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ يَنْهَاكُمْ أَنْ تَحْلِفُوا بِآبَائِكُمْ فَمَنْ كَانَ حَالِفًا فَلْيَحْلِفْ بِاللَّهِ أَوْ لِيَصْمُتْو حَدَّثَنِي عَنْ مَالِك أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ لَا وَمُقَلِّبِ الْقُلُوبِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam mendapati Umar bin Khaththab bersumpah dengan bapaknya saat sedang berjalan dalam satu rombongan. Rasulullah Shalla Allahu 'alaihi wa sallam kemudian bersabda: \"Sesungguhnya Allah telah melarang kalian untuk bersumpah atas nama bapak-bapak kalian. Barangsiapa bersumpah hendaklah ia bersumpah atas nama Allah, atau kalau tidak lebih baik diam.\" Telah menceritakan kepadaku dari Malik bahwa telah sampai kepadanya, bahwa Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: \"Tidak, demi Dzat yang membolak-balikkan hati.\""
            },
            {
                "number": 905,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عُثْمَانَ بْنِ حَفْصِ بْنِ عُمَرَ بْنِ خَلْدَةَ عَنْ ابْنِ شِهَابٍ أَنَّهُ بَلَغَهُأَنَّ أَبَا لُبَابَةَ بْنَ عَبْدِ الْمُنْذِرِ حِينَ تَابَ اللَّهُ عَلَيْهِ قَالَ يَا رَسُولَ اللَّهِ أَهْجُرُ دَارَ قَوْمِي الَّتِي أَصَبْتُ فِيهَا الذَّنْبَ وَأُجَاوِرُكَ وَأَنْخَلِعُ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُجْزِيكَ مِنْ ذَلِكَ الثُّلُثُ",
                "id": "Telah menceritakan kepadaku dari Malik dari ['Utsman bin Hafsh bin 'Umar bin Khaldah] dari [Ibnu Syihab] bahwa telah sampai kepadanya, bahwa tatkala Allah menerima taubat Abu Lubabah bin Abdul Mundzir, ia berkata; \"Wahai Rasulullah, aku akan meninggalkan kampungku yang penuh dengan dosa, aku ingin tinggal dekat anda, dan aku akan menyerahkan hartaku sebagai bentuk sedekah kepada Allah dan rasul-Nya.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Cukuplah kamu bersedekah dengan sepertiga.\" "
            },
            {
                "number": 906,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ مَنْصُورِ بْنِ عَبْدِ الرَّحْمَنِ الْحَجَبِيِّ عَنْ أُمِّهِ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ رَضِيَ اللَّهُ عَنْهَاأَنَّهَا سُئِلَتْ عَنْ رَجُلٍ قَالَ مَالِي فِي رِتَاجِ الْكَعْبَةِ فَقَالَتْ عَائِشَةُ يُكَفِّرُهُ مَا يُكَفِّرُ الْيَمِينَقَالَ مَالِك فِي الَّذِي يَقُولُ مَالِي فِي سَبِيلِ اللَّهِ ثُمَّ يَحْنَثُ قَالَ يَجْعَلُ ثُلُثَ مَالِهِ فِي سَبِيلِ اللَّهِ وَذَلِكَ لِلَّذِي جَاءَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَمْرِ أَبِي لُبَابَةَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ayyub bin Musa] dari [Manshur bin Abdurrahman Al Hajabi] dari [Ibunya] dari ['Aisyah] Ummul Mukminin radliallahu 'anha tatkala dia ditanya tentang seseorang yang telah berkata; \"Hartaku telah berada di gerbang Ka'bah (menyedekahkannya) .\" 'Aisyah menjawab, \"Dia harus membayar denda sebagaimana dia membayar denda sumpah.\" Malik berkata mengenai orang yang berkata, 'Hartaku ada di jalan Allah', lalu dia melanggar, \"Dia harus mengeluarkan sepertiga hartanya di jalan Allah, yang demikian itu sebagaimana yang terjadi pada Abu Lubabah.\""
            },
            {
                "number": 907,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ عُبَيْدِ بْنِ فَيْرُوزٍ عَنْ الْبَرَاءِ بْنِ عَازِبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ مَاذَا يُتَّقَى مِنْ الضَّحَايَا فَأَشَارَ بِيَدِهِ وَقَالَ أَرْبَعًا وَكَانَ الْبَرَاءُ يُشِيرُ بِيَدِهِ وَيَقُولُ يَدِي أَقْصَرُ مِنْ يَدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَرْجَاءُ الْبَيِّنُ ظَلْعُهَا وَالْعَوْرَاءُ الْبَيِّنُ عَوَرُهَا وَالْمَرِيضَةُ الْبَيِّنُ مَرَضُهَا وَالْعَجْفَاءُ الَّتِي لَا تُنْقِي",
                "id": "Telah menceritakan kepadaku Yazid dari Malik dari ['Amru bin Al Harits] dari ['Ubaid bin Fairuz] dari [Barra bin 'Azib] berkata, \"Rasulullah shallallahu 'alaihi wasallam ditanya, 'Apa yang harus dijauhi untuk hewan kurban? ' Beliau memberikan isyarat dengan tangannya lantas bersabda: \"Ada empat.\" Barra' lalu memberikan isyarat juga dengan tangannya dan berkata; \"Tanganku lebih pendek daripada tangan Rasulullah shallallahu 'alaihi wasallam: (empat perkara tersebut adalah) hewan yang jelas-jelas pincang kakinya, hewan yang jelas butanya, hewan yang sakit dan hewan yang kurus dan lemah yang tidak ada dagingnya.\""
            },
            {
                "number": 908,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ يَتَّقِي مِنْ الضَّحَايَا وَالْبُدْنِ الَّتِي لَمْ تُسِنَّ وَالَّتِي نَقَصَ مِنْ خَلْقِهَاقَالَ مَالِك وَهَذَا أَحَبُّ مَا سَمِعْتُ إِلَيَّ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] menjauhi hewan kurban yang belum cukup umur dan unta yang masih kecil. Malik berkata; \"Ini yang aku sukai dari apa yang pernah aku dengar.\""
            },
            {
                "number": 909,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَضَحَّى مَرَّةً بِالْمَدِينَةِ قَالَ نَافِعٌ فَأَمَرَنِي أَنْ أَشْتَرِيَ لَهُ كَبْشًا فَحِيلًا أَقْرَنَ ثُمَّ أَذْبَحَهُ يَوْمَ الْأَضْحَى فِي مُصَلَّى النَّاسِ قَالَ نَافِعٌ فَفَعَلْتُ ثُمَّ حُمِلَ إِلَى عَبْدِ اللَّهِ بْنِ عُمَرَ فَحَلَقَ رَأْسَهُ حِينَ ذُبِحَ الْكَبْشُ وَكَانَ مَرِيضًا لَمْ يَشْهَدْ الْعِيدَ مَعَ النَّاسِ قَالَ نَافِعٌ وَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يَقُولُ لَيْسَ حِلَاقُ الرَّأْسِ بِوَاجِبٍ عَلَى مَنْ ضَحَّى وَقَدْ فَعَلَهُ ابْنُ عُمَرَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] pernah menyembelih binatang kurban di Madinah. Nafi' berkata; \"Dia lalu menyuruhku untuk membelikan kambing jantan yang bertanduk. Kemudian aku menyembelihnya pada hari Idul adha di tempat sholat orang-orang.\" Nafi' melanjutkan, \"Kemudian aku melaksanakannya, binatang tersebut lalu dibawa kepada Abdullah bin Umar. Dia memotong rambutnya saat kambing tersebut disembelih, sebab waktu itu ia sedang sakit hingga tidak bisa mengikuti sholat idul adha bersama orang-orang. Nafi' berkata; \"Abdullah bin Umar pernah berkata; 'Orang yang berkurban tidak wajib mencukur rambutnya.\" Namun Ibnu Umar melakuakannya."
            },
            {
                "number": 910,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ أَنَّ أَبَا بُرْدَةَ بْنَ نِيَارٍذَبَحَ ضَحِيَّتَهُ قَبْلَ أَنْ يَذْبَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْأَضْحَى فَزَعَمَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ أَنْ يَعُودَ بِضَحِيَّةٍ أُخْرَى قَالَ أَبُو بُرْدَةَ لَا أَجِدُ إِلَّا جَذَعًا يَا رَسُولَ اللَّهِ قَالَ وَإِنْ لَمْ تَجِدْ إِلَّا جَذَعًا فَاذْبَحْ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari [Busyair bin Yasar] bahwa [Abu Burdah bin Niyar] telah menyembelih kurbannya sebelum Rasulullah Shalla Allahu 'alaihi wa sallam menyembelih kurban pada hari Idul adha. Abu Burdah beranggapan bahwa Rasulullah Shalla Allahu 'alaihi wa sallam menyuruhnya untuk mengulang kembali. Maka Abu Burdah pun berkata; \"Wahai Rasulullah, aku tidak mempunyai kecuali hanya seekor kambing?\" Rasulullah Shalla Allahu 'alaihi wa sallam) bersabda: \"Jika kamu tidak mempunyai kecuali hanya seekor jadza' (kambing yang masuk umur dua tahun), maka sembelihlah.\""
            },
            {
                "number": 911,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَبَّادِ بْنِ تَمِيمٍ أَنَّ عُوَيْمِرَ بْنَ أَشْقَرَذَبَحَ ضَحِيَّتَهُ قَبْلَ أَنْ يَغْدُوَ يَوْمَ الْأَضْحَى وَأَنَّهُ ذَكَرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهُ أَنْ يَعُودَ بِضَحِيَّةٍ أُخْرَى",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Abbad bin Tamim] bahwa [Uwaimir bin Asyqar] telah menyembelih kurbannya sebelum sholat Idul adha. Lalu dia menyampaikan hal tersebut kepada Rasulullah Shalla Allahu 'alaihi wa sallam, hingga beliau menyuruhnya untuk menyembelih lagi.\""
            },
            {
                "number": 912,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَكْلِ لُحُومِ الضَّحَايَا بَعْدَ ثَلَاثَةِ أَيَّامٍ ثُمَّ قَالَ بَعْدُ كُلُوا وَتَصَدَّقُوا وَتَزَوَّدُوا وَادَّخِرُوا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zubair Al Maki] dari [Jabir bin Abdullah] berkata, \"Rasulullah Shalla Allahu 'alaihi wa sallam melarang untuk makan daging kurban setelah tiga hari, setelah itu beliau bersabda: \"Makanlah kalian, sedekahkanlah, berbekallah dengannya dan simpanlah sisanya.\""
            },
            {
                "number": 913,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ عَبْدِ اللَّهِ بْنِ وَاقِدٍ أَنَّهُ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ لُحُومِ الضَّحَايَا بَعْدَ ثَلَاثٍقَالَ عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ فَذَكَرْتُ ذَلِكَ لِعَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ فَقَالَتْ صَدَقَ سَمِعْتُ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَقُولُ دَفَّ نَاسٌ مِنْ أَهْلِ الْبَادِيَةِ حَضْرَةَ الْأَضْحَى فِي زَمَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ادَّخِرُوا لِثَلَاثٍ وَتَصَدَّقُوا بِمَا بَقِيَ قَالَتْ فَلَمَّا كَانَ بَعْدَ ذَلِكَ قِيلَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ كَانَ النَّاسُ يَنْتَفِعُونَ بِضَحَايَاهُمْ وَيَجْمُلُونَ مِنْهَا الْوَدَكَ وَيَتَّخِذُونَ مِنْهَا الْأَسْقِيَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا ذَلِكَ أَوْ كَمَا قَالَ قَالُوا نَهَيْتَ عَنْ لُحُومِ الضَّحَايَا بَعْدَ ثَلَاثٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا نَهَيْتُكُمْ مِنْ أَجْلِ الدَّافَّةِ الَّتِي دَفَّتْ عَلَيْكُمْ فَكُلُوا وَتَصَدَّقُوا وَادَّخِرُوا يَعْنِي بِالدَّافَّةِ قَوْمًا مَسَاكِينَ قَدِمُوا الْمَدِينَةَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdullah bin Abu Bakar] dari [Abdullah bin Waqid] ia berkata; \"Rasulullah Shalla Allahu 'alaihi wa sallam melarang memakan daging kurban setelah tiga hari.\" Abdulah bin Abu Bakar berkata; \"Kemudian hal itu aku sampaikan kepada ['Amrah binti Abdurrahman] ia berkata; 'Benar, aku telah mendengar ['Aisyah], isteri Nabi Shalla Allahu 'alaihi wa sallam berkata; 'Pada masa Rasulullah shallallahu 'alaihi wasallam sekelompok orang-orang Badui memukul rebana menyambut kehadiran hari Idul adha, lalu Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: 'Simpanlah daging kurban untuk tiga hari dan sedekahkanlah sisanya.' Aisyah berkata; \"Setelah itu ada yang bertanya kepada Rasulullah Shalla Allahu 'alaihi wa sallam; 'Orang-orang telah memanfaatkan binatang kurban tersebut dengan menghilangkan lemaknya dan menjadikan (kulit-kulitnya) sebagai tempat air?\" Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: 'Kenapa begitu?\" atau yang semisal itu. Mereka pun menjawab, \"Anda telah melarang daging kurban setelah tiga hari.\" Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: 'Saya melarang kalian karena adanya orang-orang yang datang. Makanlah daging tersebut, sedekahkanlah dan simpanlah sisanya, untuk diberikan pada kaum miskin yang datang ke Madinah.\""
            },
            {
                "number": 914,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّهُ قَدِمَ مِنْ سَفَرٍ فَقَدَّمَ إِلَيْهِ أَهْلُهُ لَحْمًا فَقَالَ انْظُرُوا أَنْ يَكُونَ هَذَا مِنْ لُحُومِ الْأَضْحَى فَقَالُوا هُوَ مِنْهَا فَقَالَ أَبُو سَعِيدٍ أَلَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهَا فَقَالُوا إِنَّهُ قَدْ كَانَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَكَ أَمْرٌ فَخَرَجَ أَبُو سَعِيدٍ فَسَأَلَ عَنْ ذَلِكَ فَأُخْبِرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَهَيْتُكُمْ عَنْ لُحُومِ الْأَضْحَى بَعْدَ ثَلَاثٍ فَكُلُوا وَتَصَدَّقُوا وَادَّخِرُوا وَنَهَيْتُكُمْ عَنْ الِانْتِبَاذِ فَانْتَبِذُوا وَكُلُّ مُسْكِرٍ حَرَامٌ وَنَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا وَلَا تَقُولُوا هُجْرًايَعْنِي لَا تَقُولُوا سُوءًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Rabi'ah bin Abu Abdurrahman] dari [Abu Sa'id Al Khudri] Bahwa ia baru datang dari suatu perjalanan, lalu keluarganya menyuguhkan daging kepadanya. Abu Sa'id lalu berkata; \"Lihatlah ini, apakah ini daging kurban?\" Mereka menjawab; \"Ya, ini adalah daging kurban.\" Abu Sa'id berkata; \"Bukankah Rasulullah shallallahu 'alaihi wasallam telah melarangnya?\" Mereka menjawab; \"Telah ada perintah yang lain dari Rasulullah Shalla Allahu 'alaihi wa sallam setelah kepergianmu.\" Abu Sa'id lalu keluar dan bertanya mengenai hal itu, kemudian dia diberi tahu bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya telah melarang kalian memakan daging kurban setelah tiga hari, sekarang makanlah, sedekahkanlah dan simpanlah sisanya. Saya juga telah melarang kalian menyimpan perasan anggur, sekarang lakukan hal itu, dan setiap yang memabukkan itu haram. Saya juga telah melarang kalian untuk berziarah kubur, sekarang ziarahlah dan janganlah kalian mengatakan ucapan yang jelek (saat berziarah) .\""
            },
            {
                "number": 915,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ أَنَّهُ قَالَنَحَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْحُدَيْبِيَةِ الْبَدَنَةَ عَنْ سَبْعَةٍ وَالْبَقَرَةَ عَنْ سَبْعَةٍ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zubair Al Maki] dari [Jabir bin Abdullah] ia berkata; \"Pada peristiwa Hudaibiyah kami pernah berkurban bersama Rasulullah shallallahu 'alaihi wasallam; satu ekor unta untuk tujuh orang dan satu sapi untuk tujuh orang.\""
            },
            {
                "number": 916,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عُمَارَةَ بْنِ صَيَّادٍ أَنَّ عَطَاءَ بْنَ يَسَارٍ أَخْبَرَهُ أَنَّ أَبَا أَيُّوبَ الْأَنْصَارِيَّ أَخْبَرَهُ قَالَكُنَّا نُضَحِّي بِالشَّاةِ الْوَاحِدَةِ يَذْبَحُهَا الرَّجُلُ عَنْهُ وَعَنْ أَهْلِ بَيْتِهِ ثُمَّ تَبَاهَى النَّاسُ بَعْدُ فَصَارَتْ مُبَاهَاةً",
                "id": "Telah menceritakan kepadaku dari Malik dari ['Umarah bin Shayyad] bahwa ['Atha bin Yassar] mengabarkan kepadanya bahwa [Abu Ayyub Al Anshari] mengabarkan kepadanya, ia berkata, \"Kami pernah berkurban satu ekor kambing untuk satu orang dan keluarganya, setelah itu orang-orang saling berbangga-bangga dan berlaku sombong.\""
            },
            {
                "number": 917,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ أَنَّهُ قَالَمَا نَحَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْهُ وَعَنْ أَهْلِ بَيْتِهِ إِلَّا بَدَنَةً وَاحِدَةً أَوْ بَقَرَةً وَاحِدَةًقَالَ مَالِك لَا أَدْرِي أَيَّتَهُمَا قَالَ ابْنُ شِهَابٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] berkata; \"Rasulullah shallallahu 'alaihi wasallam tidak pernah menyembelih untuk dirinya dan keluarganya kecuali satu ekor unta atau satu ekor sapi.\" Malik berkata; \"Saya tidak tahu yang mana yang dikatakan oleh Ibnu Syihab.\""
            },
            {
                "number": 918,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَالْأَضْحَى يَوْمَانِ بَعْدَ يَوْمِ الْأَضْحَىو حَدَّثَنِي عَنْ مَالِك أَنَّهُ بَلَغَهُ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ مِثْلُ ذَلِكَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] berkata; \"Menyembelih bisa dilakukan hingga dua hari setelah hari Idul adha.\" Telah menceritakan kepadaku dari Malik Bahwasanya telah sampai kepadanya, dari Ali bin Abu Thalib seperti hadits tersebut.\""
            },
            {
                "number": 919,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَلَمْ يَكُنْ يُضَحِّي عَمَّا فِي بَطْنِ الْمَرْأَةِقَالَ مَالِك الضَّحِيَّةُ سُنَّةٌ وَلَيْسَتْ بِوَاجِبَةٍ وَلَا أُحِبُّ لِأَحَدٍ مِمَّنْ قَوِيَ عَلَى ثَمَنِهَا أَنْ يَتْرُكَهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] tidak pernah berkurban untuk sesuatu yang masih di dalam perut ibunya.\" Malik berkata; \"Kurban hukumnya sunnah dan tidak wajib, namun saya tidak suka bagi orang yang mampu membelinya tapi dia meninggalkannya.\""
            },
            {
                "number": 920,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّهُ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ إِنَّ نَاسًا مِنْ أَهْلِ الْبَادِيَةِ يَأْتُونَنَا بِلُحْمَانٍ وَلَا نَدْرِي هَلْ سَمَّوْا اللَّهَ عَلَيْهَا أَمْ لَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمُّوا اللَّهَ عَلَيْهَا ثُمَّ كُلُوهَاقَالَ مَالِك وَذَلِكَ فِي أَوَّلِ الْإِسْلَامِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Hisyam bin Urwah] dari [Bapaknya] berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah ditanya; 'Wahai Rasulullah, sekelompok orang Badui datang kepada kami dengan membawa daging kurban, namun kami tidak tahu apakah mereka membaca basmalah ketika menyembelih atau tidak?\" Rasulullah shallallahu 'alaihi wasallam menjawab: 'Bacalah basmalah, lalu makanlah.\" Malik berkata; \"Hal tersebut terjadi pada awal permulaan Islam.\""
            },
            {
                "number": 921,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ الْمَخْزُومِيَّأَمَرَ غُلَامًا لَهُ أَنْ يَذْبَحَ ذَبِيحَةً فَلَمَّا أَرَادَ أَنْ يَذْبَحَهَا قَالَ لَهُ سَمِّ اللَّهَ فَقَالَ لَهُ الْغُلَامُ قَدْ سَمَّيْتُ فَقَالَ لَهُ سَمِّ اللَّهَ وَيْحَكَ قَالَ لَهُ قَدْ سَمَّيْتُ اللَّهَ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ عَيَّاشٍ وَاللَّهِ لَا أَطْعَمُهَا أَبَدًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa [Abdullah bin 'Ayyas bin Abu Rabi'ah Al Makhzumi] menyuruh budaknya untuk menyembelih binatang, dan tatkala budaknya akan menyembelihnya dia berkata kepadanya, \"Bacalah basmallah! \" Budaknya tersebut menjawab; \"Saya telah membacanya.\" Abdullah berkata lagi, \"Celaka kami, bacalah basmallah! \" Budak tersebut menjawab lagi; \"Saya telah membacanya.\" Abdullah bin Ayyas berkata kepadanya; \"Demi Allah, selamanya aku tidak akan memakannya.\""
            },
            {
                "number": 922,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍأَنَّ رَجُلًا مِنْ الْأَنْصَارِ مِنْ بَنِي حَارِثَةَ كَانَ يَرْعَى لِقْحَةً لَهُ بِأُحُدٍ فَأَصَابَهَا الْمَوْتُ فَذَكَّاهَا بِشِظَاظٍ فَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَقَالَ لَيْسَ بِهَا بَأْسٌ فَكُلُوهَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Zaid bin Aslam] dari [Atha' bin Yasar] berkata, \"Seorang laki-laki Anshar dari Bani Haritsah pernah mengembalakan unta perahan di padang uhud, unta tersebut lalu mati hingga ia menyembelihnya dengan kayu yang tajam. Rasulullah shallallahu 'alaihi wasallam lalu ditanya tentang hal itu, beliau menjawab; \"Itu tidak mengapa, makanlah daging tersebut.\""
            },
            {
                "number": 923,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ رَجُلٍ مِنْ الْأَنْصَارِ عَنْ مُعَاذِ بْنِ سَعْدٍ أَوْ سَعْدِ بْنِ مُعَاذٍأَنَّ جَارِيَةً لِكَعْبِ بْنِ مَالِكٍ كَانَتْ تَرْعَى غَنَمًا لَهَا بِسَلْعٍ فَأُصِيبَتْ شَاةٌ مِنْهَا فَأَدْرَكَتْهَا فَذَكَّتْهَا بِحَجَرٍ فَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَقَالَ لَا بَأْسَ بِهَا فَكُلُوهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Seorang Anshar] dari [Mu'adz bin Sa'ad] atau Sa'ad bin Mu'adz berkata, \"Mantan budak Ka'ab bin Malik mengembalakan kambing di Sal'. Lalu ada seekor kambing yang hampir mati, ia lalu menyembelihnya dengan batu. Tatkala Rasulullah shallallahu 'alaihi wasallam ditanya tentang hal itu, beliau menjawab; \"Itu tidak apa-apa, makanlah dagingnya.\""
            },
            {
                "number": 924,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ثَوْرِ بْنِ زَيْدٍ الدِّيلِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّهُ سُئِلَ عَنْ ذَبَائِحِ نَصَارَى الْعَرَبِ فَقَالَ لَا بَأْسَ بِهَا وَتَلَا هَذِهِ الْآيَةَ{ وَمَنْ يَتَوَلَّهُمْ مِنْكُمْ فَإِنَّهُ مِنْهُمْ }و حَدَّثَنِي عَنْ مَالِك أَنَّهُ بَلَغَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ كَانَ يَقُولُ مَا فَرَى الْأَوْدَاجَ فَكُلُوهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Tsaur bin Zaid Ad-Dili] dari [Abdullah bin Abbas] Bahwasanya ia pernah ditanya tentang sembelihan orang Nasrani Arab. Ibnu Abbas lalu menjawab, \"Itu tidak apa-apa.\" kemudian dia membaca ayat ini: '(Barangsiapa yang menjadikan mereka (orang-orang Nasrani) sebagai wali bagi kalian maka sesungguhnya dia bagian dari mereka) ' (Qs. Al Maidah: 51) Telah menceritakan kepadaku dari Malik telah sampai kepadanya bahwa Abdullah bin Abbas berkata; \"Sesuatu yang dapat memutuskan urat leher binatang, maka makanlah dagingnya.\""
            },
            {
                "number": 925,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ كَانَ يَقُولُمَا ذُبِحَ بِهِ إِذَا بَضَعَ فَلَا بَأْسَ بِهِ إِذَا اضْطُرِرْتَ إِلَيْهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] berkata; \"Binatang yang disembelih bila telah terputus uratnya, maka hal itu diperbolehkan untuk dimakan apabila kamu membutuhkannya.\""
            },
            {
                "number": 926,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي مُرَّةَ مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ أَنَّهُ سَأَلَ أَبَا هُرَيْرَةَعَنْ شَاةٍ ذُبِحَتْ فَتَحَرَّكَ بَعْضُهَا فَأَمَرَهُ أَنْ يَأْكُلَهَاثُمَّ سَأَلَ عَنْ ذَلِكَ زَيْدَ بْنَ ثَابِتٍ فَقَالَ إِنَّ الْمَيْتَةَ لَتَتَحَرَّكُ وَنَهَاهُ عَنْ ذَلِكَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari [Abu Murrah] mantan budak 'Aqil bin Abu Thalib, dia bertanya kepada [Abu Hurairah] tentang kambing yang telah disembelih namun sebagian badannya masih bergerak. Abu Hurairah lalu menyuruhnya untuk tetap memakannya. Abu Murrah menanyakan lagi kepada [Zaid bin Tsabit], Lalu Zaid menjawab; 'Bangkai itu adalah binatang yang disembelih namun tetap bergerak, ' lalu dia melarang untuk memakannya."
            },
            {
                "number": 927,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّهُ كَانَ يَقُولُإِذَا نُحِرَتْ النَّاقَةُ فَذَكَاةُ مَا فِي بَطْنِهَا فِي ذَكَاتِهَا إِذَا كَانَ قَدْ تَمَّ خَلْقُهُ وَنَبَتَ شَعَرُهُ فَإِذَا خَرَجَ مِنْ بَطْنِ أُمِّهِ ذُبِحَ حَتَّى يَخْرُجَ الدَّمُ مِنْ جَوْفِهِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] ia berkata; \"Jika unta disembelih, maka janin yang ada di dalam unta tersebut hukumnya sama dengan unta yang telah disembelih, dengan syarat janin tersebut telah sempurna dan tumbuh rambutnya. Jika telah keluar dari perut induknya maka harus disembelih hingga keluar darah dari kerongkongannya.\""
            },
            {
                "number": 928,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ اللَّيْثِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ كَانَ يَقُولُذَكَاةُ مَا فِي بَطْنِ الذَّبِيحَةِ فِي ذَكَاةِ أُمِّهِ إِذَا كَانَ قَدْ تَمَّ خَلْقُهُ وَنَبَتَ شَعَرُهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yazid bin Abdullah bin Qusaith Al Laitsi] dari [Sa'id bin Musayyab] ia berkata; \"Hukum janin yang ada di dalam perut induknya sama dengan induknya jika disembelih. Hal tersebut jika janin itu telah sempurna dan tumbuh rambutnya.\""
            },
            {
                "number": 929,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ أَنَّهُ قَالَرَمَيْتُ طَائِرَيْنِ بِحَجَرٍ وَأَنَا بِالْجُرْفِ فَأَصَبْتُهُمَا فَأَمَّا أَحَدُهُمَا فَمَاتَ فَطَرَحَهُ عَبْدُ اللَّهِ بْنُ عُمَرَ وَأَمَّا الْآخَرُ فَذَهَبَ عَبْدُ اللَّهِ بْنُ عُمَرَ يُذَكِّيهِ بِقَدُومٍ فَمَاتَ قَبْلَ أَنْ يُذَكِّيَهُ فَطَرَحَهُ عَبْدُ اللَّهِ أَيْضًا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] ia berkata; \"Saya pernah melempar dua burung dengan batu, saat itu saya sedang berada di lereng bukit. Batu itu mengenai keduanya sehingga salah satu dari keduanya mati. [Abdullah bin Umar] membuang bangkai itu sedangkan (yang lain) Abdullah bin Umar membawanya hendak menyembelihnya dengan kapak namun burung itu mati sebelum disembelih sehingga Ibnu Umar membuangnya juga.\""
            },
            {
                "number": 930,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّهُ كَانَ يَقُولُ فِي الْكَلْبِ الْمُعَلَّمِ كُلْ مَا أَمْسَكَ عَلَيْكَ إِنْ قَتَلَ وَإِنْ لَمْ يَقْتُلْ و حَدَّثَنِي عَنْ مَالِك أَنَّهُ سَمِعَ نَافِعًا يَقُولُ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ وَإِنْ أَكَلَ وَإِنْ لَمْ يَأْكُلْ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] ia berkata tentang anjing yang terlatih; \"Makanlah binatang tangkapannya, baik yang telah terbunuh ataupun belum.\" Telah menceritakan kepadaku dari Malik bahwa ia mendengar Nafi' berkata; \"Abdullah bin Umar berkata; 'Baik buruan tersebut telah dimakan ataupun belum.\""
            },
            {
                "number": 931,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي هُرَيْرَةَ سَأَلَ عَبْدَ اللَّهِ بْنَ عُمَرَ عَمَّا لَفَظَ الْبَحْرُ فَنَهَاهُ عَنْ أَكْلِهِ قَالَ نَافِعٌ ثُمَّ انْقَلَبَ عَبْدُ اللَّهِفَدَعَا بِالْمُصْحَفِ فَقَرَأَ{ أُحِلَّ لَكُمْ صَيْدُ الْبَحْرِ وَطَعَامُهُ }قَالَ نَافِعٌ فَأَرْسَلَنِي عَبْدُ اللَّهِ بْنُ عُمَرَ إِلَى عَبْدِ الرَّحْمَنِ بْنِ أَبِي هُرَيْرَةَ إِنَّهُ لَا بَأْسَ بِأَكْلِهِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] bahwa Abdurrahman bin Abu Hurairah bertanya kepada [Abdullah bin Umar] tentang binatang yang dimuntahkan dari laut. Ibnu Umar melarang untuk dimakan. Nafi' berkata; \"Abdullah minta untuk diambilkan sebuah mushaf lantas dia membaca sebuah ayat, \"Telah dihalalkan bagimu buruan laut beserta makanannya.\" Nafi' berkata; \"Abdullah bin Umar mengutusku kepada Abdurrahman bin Abu Hurairah untuk mengatakan bahwa binatang tersebut halal dimakan.\""
            },
            {
                "number": 932,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ سَعْدٍ الْجَارِيِّ مَوْلَى عُمَرَ بْنِ الْخَطَّابِ أَنَّهُ قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عُمَرَعَنْ الْحِيتَانِ يَقْتُلُ بَعْضُهَا بَعْضًا أَوْ تَمُوتُ صَرَدًا فَقَالَ لَيْسَ بِهَا بَأْسٌقَالَ سَعْدٌ ثُمَّ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ فَقَالَ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Zaid bin Aslam] dari [Sa'ad Al Jaari] mantan budak Umar bin Khattab, berkata; \"Saya bertanya kepada [Abdullah bin Umar] tentang sekelompok ikan paus yang saling bunuh, atau ikan paus yang mati kedinginan.\" Ibnu Umar menjawab; \"Itu tidak apa-apa.\" Sa'ad berkata; \"Saya lalu bertanya lagi kepada [Abdullah bin 'Amr bin Ash] namun dia juga menjawab sebagaimana ucapan Ibnu Umar.\""
            },
            {
                "number": 933,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ ثَابِتٍأَنَّهُمَا كَانَا لَا يَرَيَانِ بِمَا لَفَظَ الْبَحْرُ بَأْسًا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] dan [Zaid bin Tsabit] bahwa keduanya menganggap binatang yang mati terdampar dari laut itu halal untuk dimakan.\""
            },
            {
                "number": 934,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ نَاسًا مِنْ أَهْلِ الْجَارِ قَدِمُوا فَسَأَلُوا مَرْوَانَ بْنَ الْحَكَمِ عَمَّا لَفَظَ الْبَحْرُ فَقَالَ لَيْسَ بِهِ بَأْسٌ وَقَالَ اذْهَبُوا إِلَى زَيْدِ بْنِ ثَابِتٍ وَأَبِي هُرَيْرَةَفَاسْأَلُوهُمَا عَنْ ذَلِكَ ثُمَّ ائْتُونِي فَأَخْبِرُونِي مَاذَا يَقُولَانِ فَأَتَوْهُمَا فَسَأَلُوهُمَا فَقَالَا لَا بَأْسَ بِهِفَأَتَوْا مَرْوَانَ فَأَخْبَرُوهُ فَقَالَ مَرْوَانُ قَدْ قُلْتُ لَكُمْ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zinad] dari [Abu Salamah bin Abdurrahman] bahwa sekelompok orang datang kepada [Marwan bin Al Hakam], mereka bertanya tentang binatang yang mati terdampar dari laut?\" Marwan bin Al Hakam menjawab; \"Hal itu tidak masalah.\" Marwan lalu berkata, \"Pergilah kalian kepada [Zaid bin Tsabit] dan [Abu Hurairah], tanyakanlah hal itu kepadanya, setelah itu kabarkanlah jawabannya kepadaku.\" Mereka kemudian mendatangi keduanya dan menanyakan hal tersebut. Keduanya menjawab; \"Itu tidak masalah.\" Setelah itu mereka mendatangi Marwan dan memberitahukan tentang jawaban tersebut. Marwan berkata; \"Jawaban tersebut sama dengan yang aku katakan kepada kalian.\""
            },
            {
                "number": 935,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَكْلُ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِ حَرَامٌ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Abu Idris Al Khaulani] dari [Abu Tsa'labah Al Khusyani] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Memakan setiap binatang buas yang bertaring hukumnya haram.\""
            },
            {
                "number": 936,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ إِسْمَعِيلَ بْنِ أَبِي حَكِيمٍ عَنْ عَبِيدَةَ بْنِ سُفْيَانَ الْحَضْرَمِيِّ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَكْلُ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِ حَرَامٌقَالَ مَالِك وَهُوَ الْأَمْرُ عِنْدَنَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Isma'il bin Abu Hakim] dari [Abidah bin Sufyan Al Hadlrami] dari [Abu Hurairah] bahwa Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: \" Memakan setiap binatang buas yang bertaring hukumnya haram.\" Malik berkata; \"Itu adalah pendapat yang kami pegang.\""
            },
            {
                "number": 937,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّهُ قَالَمَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَاةٍ مَيِّتَةٍ كَانَ أَعْطَاهَا مَوْلَاةً لِمَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَفَلَا انْتَفَعْتُمْ بِجِلْدِهَا فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا مَيْتَةٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا حُرِّمَ أَكْلُهَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Ubaidillah bin Abdullah bin Uthbah bin Mas'ud] dari [Abdullah bin Abbas] berkata; \"Rasulullah Shalla Allahu 'alaihi wa sallam melewati seekor bangkai kambing yang pernah dia berikan kepada mantan budak Maimunah, isteri Nabi Shalla Allahu 'alaihi wa sallam. Beliau bertanya: 'Apakah kalian tidak memanfaatkan kulitnya? ' Mereka mengatakan; 'Wahai Rasulullah, binatang itu telah menjadi bangkai.' Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: 'Yang diharamkan itu memakannya.\""
            },
            {
                "number": 938,
                "arab": "و حَدَّثَنِي مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ ابْنِ وَعْلَةَ الْمِصْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دُبِغَ الْإِهَابُ فَقَدْ طَهَرَ",
                "id": "Telah menceritakan kepadaku Malik dari [Zaid bin Aslam] dari [Ibnu Wa'lah Al Mishri] dari [Abdullah bin Abbas] bahwa Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: \"Jika kulit bangkai telah disamak maka itu menjadi suci.\""
            },
            {
                "number": 939,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ عَنْ أُمِّهِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ أَنْ يُسْتَمْتَعَ بِجُلُودِ الْمَيْتَةِ إِذَا دُبِغَتْ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yazid bin Abdullah bin Qusaith] dari [Muhammad bin Abdurrahman bin Tsauban] dari [Ibunya] dari ['Aisyah] isteri Nabi Shalla Allahu 'alaihi wa sallam, ia berkata, \"Rasulullah Shalla Allahu 'alaihi wa sallam menyuruh memanfaatkan kulit bangkai apabila telah disamak."
            },
            {
                "number": 940,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ رَجُلٍ مِنْ بَنِي ضَمْرَةَ عَنْ أَبِيهِ أَنَّهُ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْعَقِيقَةِ فَقَالَ لَا أُحِبُّ الْعُقُوقَ وَكَأَنَّهُ إِنَّمَا كَرِهَ الْاسْمَ وَقَالَ مَنْ وُلِدَ لَهُ وَلَدٌ فَأَحَبَّ أَنْ يَنْسُكَ عَنْ وَلَدِهِ فَلْيَفْعَلْ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Zaid bin Aslam] dari [seseorang dari Bani Dlamrah] dari [Bapaknya] ia berkata; \"Rasulullah Shalla Allahu 'alaihi wa sallam pernah ditanya tentang hukum aqiqah. Beliau menjawab; 'Saya tidak suka aqiqah (seakan-akan beliau membenci penamaan tersebut) .'\" Beliau bersabda: \"Barangsiapa dikaruniai seorang anak, lantas dia berkeinginan untuk menyembelih kambing untuk anaknya maka laksanakanlah.\""
            },
            {
                "number": 941,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ أَنَّهُ قَالَوَزَنَتْ فَاطِمَةُ بِنْتُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَعَرَ حَسَنٍ وَحُسَيْنٍ وَزَيْنَبَ وَأُمِّ كُلْثُومٍ فَتَصَدَّقَتْ بِزِنَةِ ذَلِكَ فِضَّةً",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ja'far bin Muhammad] dari [Bapaknya] ia berkata; \" [Fatimah] puteri Rasulullah Shalla Allahu 'alaihi wa sallam pernah menimbang rambut Hasan, Husain, Zainab dan Ummu Kultsum, lalu mensedekahkan perak yang sama dengan berat timbangan rambut tersebut.\""
            },
            {
                "number": 942,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ أَنَّهُ قَالَوَزَنَتْ فَاطِمَةُ بِنْتُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَعَرَ حَسَنٍ وَحُسَيْنٍ فَتَصَدَّقَتْ بِزِنَتِهِ فِضَّةً",
                "id": "Telah menceritakan kepadaku dari Malik dari [Rabi'ah bin Abu Abdurrahman] dari [Muhammad bin Ali bin Al Husain] berkata; \" [Fatimah] puteri Rasulullah Shalla Allahu 'alaihi wa sallam menimbang rambut Hasan dan Husain, lalu ia bersedekah perak yang sama dengan berat timbangan rambut tersebut.\""
            },
            {
                "number": 943,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَلَمْ يَكُنْ يَسْأَلُهُ أَحَدٌ مِنْ أَهْلِهِ عَقِيقَةً إِلَّا أَعْطَاهُ إِيَّاهَا وَكَانَ يَعُقُّ عَنْ وَلَدِهِ بِشَاةٍ شَاةٍ عَنْ الذُّكُورِ وَالْإِنَاثِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] berkata, \"Tidak seorang pun dari keluarga Abdullah bin Umar meminta kambing untuk dijadikan aqiqah kecuali ia memberikannya. [Ibnu Umar] beraqiqah untuk anak-anaknya dengan seekor kambing; baik untuk anak laki-laki maupun anak perempuan."
            },
            {
                "number": 944,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ أَنَّهُ قَالَ سَمِعْتُ أَبِييَسْتَحِبُّ الْعَقِيقَةَ وَلَوْ بِعُصْفُورٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Rabi'ah bin Abu Abdurrahman] dari [Muhammad bin Ibrahim bin Al Harits At-Taimi] berkata; \"Aku mendengar [Bapakku] menganjurkan aqiqah walaupun dengan seekor burung.\""
            },
            {
                "number": 945,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ هِشَامِ بْنِ عُرْوَةَ أَنَّ أَبَاهُ عُرْوَةَ بْنَ الزُّبَيْرِكَانَ يَعُقُّ عَنْ بَنِيهِ الذُّكُورِ وَالْإِنَاثِ بِشَاةٍ شَاةٍ",
                "id": "Telah menceritakan kepada kami dari Malik dari [Hisyam bin Urwah] bahwa bapaknya [Urwah bin Zubair] mengaqiqahi anak laki-laki dan perempuannya masing-masing dengan seekor kambing.\""
            },
            {
                "number": 946,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ بَلَغَهُ أَنَّ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ كَتَبَ إِلَى زَيْدِ بْنِ ثَابِتٍيَسْأَلُهُ عَنْ الْجَدِّ فَكَتَبَ إِلَيْهِ زَيْدُ بْنُ ثَابِتٍ إِنَّكَ كَتَبْتَ إِلَيَّ تَسْأَلُنِي عَنْ الْجَدِّ وَاللَّهُ أَعْلَمُ وَذَلِكَ مِمَّا لَمْ يَكُنْ يَقْضِي فِيهِ إِلَّا الْأُمَرَاءُ يَعْنِي الْخُلَفَاءَ وَقَدْ حَضَرْتُ الْخَلِيفَتَيْنِ قَبْلَكَ يُعْطِيَانِهِ النِّصْفَ مَعَ الْأَخِ الْوَاحِدِ وَالثُّلُثَ مَعَ الْاثْنَيْنِ فَإِنْ كَثُرَتْ الْإِخْوَةُ لَمْ يُنَقِّصُوهُ مِنْ الثُّلُثِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] bahwa telah sampai kepadanya, bahwa Mu'awiyah bin Abu Sufyan menulis surat kepada [Zaid bin Tsabi] menanyakan tentang bagian waris untuk seorang kakek. Zaid bin Tsabit lalu mengirim balasannya; \"Kamu telah menulis surat kepadaku dengan menanyakan tentang bagian kakek dari harta warisan. Maka Allah yang lebih tahu, sebab yang demikian itu belum ada yang memutuskan kecuali para Amir yakni para khulafa'. Saya pernah hidup semasa dengan dua Khalifah sebelummu, yang [keduanya] telah memberikan bagian untuk kakek setengah bersama satu saudara laki-laki dan sepertiga jika bersama dua saudara laki-laki. Jika saudara laki-laki itu banyak jumlahnya maka hal tersebut tidak mengurangi sepertiga dari bagiannya."
            },
            {
                "number": 947,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ أَنَّ عُمَرَ بْنَ الْخَطَّابِفَرَضَ لِلْجَدِّ الَّذِي يَفْرِضُ النَّاسُ لَهُ الْيَوْمَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Qabishah bin Dzu`aib] bahwa [Umar bin Khattab] menentukan bagian warisan untuk kakek sebagaimana yang ditentukan oleh manusia sekarang ini.\""
            },
            {
                "number": 948,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عُثْمَانَ بْنِ إِسْحَقَ بْنِ خَرَشَةَ عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ أَنَّهُ قَالَ جَاءَتْ الْجَدَّةُ إِلَى أَبِي بَكْرٍ الصِّدِّيقِتَسْأَلُهُ مِيرَاثَهَا فَقَالَ لَهَا أَبُو بَكْرٍ مَا لَكِ فِي كِتَابِ اللَّهِ شَيْءٌ وَمَا عَلِمْتُ لَكِ فِي سُنَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا فَارْجِعِي حَتَّى أَسْأَلَ النَّاسَ فَسَأَلَ النَّاسَ فَقَالَ الْمُغِيرَةُ بْنُ شُعْبَةَ حَضَرْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَاهَا السُّدُسَ فَقَالَ أَبُو بَكْرٍ هَلْ مَعَكَ غَيْرُكَ فَقَامَ مُحَمَّدُ بْنُ مَسْلَمَةَ الْأَنْصَارِيُّ فَقَالَ مِثْلَ مَا قَالَ الْمُغِيرَةُ فَأَنْفَذَهُ لَهَا أَبُو بَكْرٍ الصِّدِّيقُ ثُمَّ جَاءَتْ الْجَدَّةُ الْأُخْرَى إِلَى عُمَرَ بْنِ الْخَطَّابِ تَسْأَلُهُ مِيرَاثَهَا فَقَالَ لَهَا مَا لَكِ فِي كِتَابِ اللَّهِ شَيْءٌ وَمَا كَانَ الْقَضَاءُ الَّذِي قُضِيَ بِهِ إِلَّا لِغَيْرِكِ وَمَا أَنَا بِزَائِدٍ فِي الْفَرَائِضِ شَيْئًا وَلَكِنَّهُ ذَلِكَ السُّدُسُ فَإِنْ اجْتَمَعْتُمَا فَهُوَ بَيْنَكُمَا وَأَيَّتُكُمَا خَلَتْ بِهِ فَهُوَ لَهَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari ['Utsman bin Ishaq bin Kharasyah] dari [Qabishah bin Dzu`aib] ia berkata, \"Seorang nenek menemui Abu Bakar Ash Shidiq untuk menanyakan tentang harta waris yang menjadi bagiannya. Abu Bakar lalu berkata kepadanya; \"Saya tidak mendapatkan dalam Al Qur'an atau As Sunnah Rasulullah shallallahu 'alaihi wasallam bagian untukmu, maka kembalilah sehingga saya bertanya kepada kaum muslimin.\" Kemudian Abu Bakar bertanya kepada orang-orang, lalu [Al Mughirah bin Syu'bah] berkata; \"Saya pernah hadir dalam majelis Rasulullah Shalla Allahu 'alaihi wa sallam, Beliau memberikan bagian untuk seorang nenek seperenam dari harta warisan.\" Abu Bakar bertanya; \"Apakah ada saksi yang lain selain kamu?\" [Muhammad bin Maslamah Al Anshari] berdiri seraya mengatakan sebagaimana yang diucapkan Al Mughirah. Abu Bakar Ash Shiddiq lalu memberlakukan hal itu kepada nenek tersebut. Lalu seorang nenek yang lainnya datang menemui Umar bin Khattab dan menanyakan harta warisan yang menjadi bagiannya. Umar pun berkata kepada nenek tersebut, \"Tidak ada bagian untukmu dalam kitab Allah dan juga tidak ada ketentuan yang telah diputuskan kecuali untuk selainmu. Saya tidak ingin menambah sesuatupun bagian untuk seseorang dalam masalah waris, tapi saya kira bagiannya adalah seperenam. Jika kamu berdua, maka harus membagi di antara keduanya, namun jika salah satu di antara kamu meninggal dunia maka semua bagian itu untuk dia yang masih hidup.\""
            },
            {
                "number": 949,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ أَنَّهُ قَالَ أَتَتْ الْجَدَّتَانِ إِلَى أَبِي بَكْرٍ الصِّدِّيقِفَأَرَادَ أَنْ يَجْعَلَ السُّدُسَ لِلَّتِي مِنْ قِبَلِ الْأُمِّ فَقَالَ لَهُ رَجُلٌ مِنْ الْأَنْصَارِ أَمَا إِنَّكَ تَتْرُكُ الَّتِي لَوْ مَاتَتْ وَهُوَ حَيٌّ كَانَ إِيَّاهَا يَرِثُ فَجَعَلَ أَبُو بَكْرٍ السُّدُسَ بَيْنَهُمَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Al Qasim bin Muhammad] berkata; \"Dua nenek menemui Abu Bakar Ash Shiddiq. Kemudian [Abu Bakar] hendak memberikan bagian seperenam untuk nenek dari pihak ibu, lalu ada seorang lelaki Anshar bertanya; 'Bagaimana kamu meninggalkan seorang nenek, yang jika dia mati sedangkan kerabatnya masih hidup maka (kerabat tersebut) mendapatkan semua harta nenek tersebut.' Abu Bakar lalu memberikan seperenam untuk dibagi di antara keduanya.\""
            },
            {
                "number": 950,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ أَنَّ أَبَا بَكْرِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍكَانَ لَا يَفْرِضُ إِلَّا لِلْجَدَّتَيْنِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdu Rabbih bin Sa'id] bahwa [Abu Bakar bin Abdurrahman bin Al Harits bin Hisyam] tidak memberikan (bagian seperenam) kecuali untuk dua orang nenek."
            },
            {
                "number": 951,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَ أَنَّ عُمَرَ بْنَ الْخَطَّابِسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْكَلَالَةِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْفِيكَ مِنْ ذَلِكَ الْآيَةُ الَّتِي أُنْزِلَتْ فِي الصَّيْفِ آخِرَ سُورَةِ النِّسَاءِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Zaid bin Aslam] bahwa [Umar bin Khattab] pernah bertanya kepada Rasulullah Shalla Allahu 'alaihi wa sallam mengenai kalalah. Rasulullah Shalla Allahu 'alaihi wa sallam lalu bersabda kepadanya: \"Cukup bagimu mengenai hal itu dengan sebuah ayat yang diturunkan saat musim panas' yaitu di akhir surat An Nisa'.\" "
            },
            {
                "number": 952,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَنْظَلَةَ الزُّرَقِيِّ أَنَّهُ أَخْبَرَهُ عَنْ مَوْلًى لِقُرَيْشٍ كَانَ قَدِيمًا يُقَالُ لَهُ ابْنُ مِرْسَى أَنَّهُ قَالَ كُنْتُ جَالِسًا عِنْدَ عُمَرَ بْنِ الْخَطَّابِفَلَمَّا صَلَّى الظُّهْرَ قَالَ يَا يَرْفَا هَلُمَّ ذَلِكَ الْكِتَابَ لِكِتَابٍ كَتَبَهُ فِي شَأْنِ الْعَمَّةِ فَنَسْأَلَ عَنْهَا وَنَسْتَخْبِرَ عَنْهَا فَأَتَاهُ بِهِ يَرْفَا فَدَعَا بِتَوْرٍ أَوْ قَدَحٍ فِيهِ مَاءٌ فَمَحَا ذَلِكَ الْكِتَابَ فِيهِ ثُمَّ قَالَ لَوْ رَضِيَكِ اللَّهُ وَارِثَةً أَقَرَّكِ لَوْ رَضِيَكِ اللَّهُ أَقَرَّكِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Muhammad bin Abu Bakar bin Muhammad bin 'Amru bin Hazm] dari [Abdurrahman bin Handzalah Az Zuraqi] bahwa ia mengabarkan kepadanya, dari [mantan budak seorang laki-laki Quraisy] -dahulu ia dipanggil dengan nama Ibnu Mirsa- ia berkata; \"Aku pernah duduk di samping [Umar bin Khattab] . Ketika sholat zhuhur selesai ia berkata; 'Wahai Yarfa, bawalah kitab itu kemari -sebuah kitab yang ia tulis untuk bagian bibi dalam waris-. Kami lalu bertanya minta penjelasan tentang kitab tersebut. Yarfa kemudian membawakan kitab tersebut, Umar lantas minta diambilkan sebuah bejana atau periuk yang berisi air, lalu Umar menghapus tulisan tersebut. Umar kemudian berkata, \"Jika Allah meridlai kamu (seorang bibi) menjadi ahli waris, niscaya Allah akan menetapkannya. Jika Allah meridlai kamu, niscaya Allah akan menetapkannya.\""
            },
            {
                "number": 953,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرِ بْنِ حَزْمٍ أَنَّهُ سَمِعَ أَبَاهُ كَثِيرًا يَقُولُ كَانَ عُمَرُ بْنُ الْخَطَّابِ يَقُولُعَجَبًا لِلْعَمَّةِ تُورَثُ وَلَا تَرِثُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Muhammad bin Abu Bakar bin Hazm] bahwa ia mendengar [Bapaknya] sering berkata; \" [Umar bin Khattab] pernah mengatakan; 'Sungguh mengherankan bagi seorang bibi, dia dapat mewariskan hartanya tetapi tidak mendapatkan harta warisan (dari kerabatnya) .\""
            },
            {
                "number": 954,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عَلِيِّ بْنِ حُسَيْنِ بْنِ عَلِيٍّ عَنْ عُمَرَ بْنِ عُثْمَانَ بْنِ عَفَّانَ عَنْ أُسَامَةَ بْنِ زَيْدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَرِثُ الْمُسْلِمُ الْكَافِرَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Ali bin Husain bin Ali] dari ['Umar bin 'Utsman bin 'Affan] dari ['Usamah bin Zaid] bahwa Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: \"Orang muslim tidak dapat mewariskan hartanya kepada orang kafir.\""
            },
            {
                "number": 955,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عَلِيِّ بْنِ حُسَيْنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ أَنَّهُ أَخْبَرَهُإِنَّمَا وَرِثَ أَبَا طَالِبٍ عَقِيلٌ وَطَالِبٌ وَلَمْ يَرِثْهُ عَلِيٌّ قَالَ فَلِذَلِكَ تَرَكْنَا نَصِيبَنَا مِنْ الشِّعْبِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Ali bin Husain bin Ali bin Abu Thalib] bahwa ia mengabarkan kepadanya, bahwa 'Aqil dan Thalib telah mewarisi harta dari Abu Thalib, sedang Ali tidak mewarisi hartanya. Ali bin Husain berkata; \"Maka dari itu, kami tidak mengambil bagian kami berupa tanah yang ada di lembah.\""
            },
            {
                "number": 956,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ أَنَّ مُحَمَّدَ بْنَ الْأَشْعَثِ أَخْبَرَهُ أَنَّ عَمَّةً لَهُ يَهُودِيَّةً أَوْ نَصْرَانِيَّةً تُوُفِّيَتْ وَأَنَّ مُحَمَّدَ بْنَ الْأَشْعَثِ ذَكَرَ ذَلِكَ لِعُمَرَ بْنِ الْخَطَّابِوَقَالَ لَهُ مَنْ يَرِثُهَا فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ يَرِثُهَا أَهْلُ دِينِهَاثُمَّ أَتَى عُثْمَانَ بْنَ عَفَّانَ فَسَأَلَهُ عَنْ ذَلِكَ فَقَالَ لَهُ عُثْمَانُ أَتُرَانِي نَسِيتُ مَا قَالَ لَكَ عُمَرُ بْنُ الْخَطَّابِ يَرِثُهَا أَهْلُ دِينِهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sulaiman bin Yasar] bahwa [Muhammad bin Al Asy'ats] mengabarkan kepadanya bahwa bibinya yang beragama Yahudi atau Nasrani telah meninggal. Muhammad bin Al Asy'ats lalu menceritakan hal itu kepada Umar bin Khattab dan bertanya kepadanya, \"Siapa yang akan mendapatkan harta warisannya?\" ' [Umar bin Khattab] menjawab; \"Yang akan mendapatkan warisannya adalah orang yang seagama dengannya\". Kemudian dia mendatangi [Utsman bin Affan] untuk menanyakan hal itu juga, Utsman balik bertanya; \"Apakah kamu lupa dengan apa yang dikatakan Umar bin Khattab, bahwa yang mendapatkan warisan adalah orang yang seagama dengannya?\""
            },
            {
                "number": 957,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ إِسْمَعِيلَ بْنِ أَبِي حَكِيمٍ أَنَّ نَصْرَانِيًّا أَعْتَقَهُ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ هَلَكَ قَالَ إِسْمَعِيلُفَأَمَرَنِي عُمَرُ بْنُ عَبْدِ الْعَزِيزِ أَنْ أَجْعَلَ مَالَهُ فِي بَيْتِ الْمَالِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Isma'il bin Abu Hakim] berkata, \"Seorang Nasrani yang telah dibebaskan oleh Umar bin Abdul Aziz meninggal dunia. Isma'il berkata; \"Lalu [Umar bin Abdul Aziz] memerintahkan kepadaku agar memberikan semua hartanya ke Baitul Mal.\""
            },
            {
                "number": 958,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ غَيْرِ وَاحِدٍ مِنْ عُلَمَائِهِمْأَنَّهُ لَمْ يَتَوَارَثْ مَنْ قُتِلَ يَوْمَ الْجَمَلِ وَيَوْمَ صِفِّينَ وَيَوْمَ الْحَرَّةِ ثُمَّ كَانَ يَوْمَ قُدَيْدٍ فَلَمْ يُوَرَّثْ أَحَدٌ مِنْ صَاحِبِهِ شَيْئًا إِلَّا مَنْ عُلِمَ أَنَّهُ قُتِلَ قَبْلَ صَاحِبِهِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Rabi'ah bin Abu Abdurrahman] dari beberapa ulama mereka, bahwa orang-orang yang terbunuh dalam perang Jamal, perang Shiffin dan perang Harrah tidak dapat saling mewarisi. Adapun pada perang Qudaid, tidak seorangpun yang mewarisi harta temannya kecuali jika diketahui bahwa dia terbunuh sebelum temannya.\""
            },
            {
                "number": 959,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَخْطُبُ أَحَدُكُمْ عَلَى خِطْبَةِ أَخِيهِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Muhammad bin Yahya bin Habban] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: \"Janganlah salah seorang dari kalian melamar pinangan saudaranya.\""
            },
            {
                "number": 960,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَخْطُبُ أَحَدُكُمْ عَلَى خِطْبَةِ أَخِيهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: \"Janganlah salah seorang dari kalian melamar pinangan saudaranya.\""
            },
            {
                "number": 961,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِأَنَّهُ كَانَ يَقُولُ فِي قَوْلِ اللَّهِ تَبَارَكَ وَتَعَالَى{ وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا عَرَّضْتُمْ بِهِ مِنْ خِطْبَةِ النِّسَاءِ أَوْ أَكْنَنْتُمْ فِي أَنْفُسِكُمْ عَلِمَ اللَّهُ أَنَّكُمْ سَتَذْكُرُونَهُنَّ وَلَكِنْ لَا تُوَاعِدُوهُنَّ سِرًّا إِلَّا أَنْ تَقُولُوا قَوْلًا مَعْرُوفًا }أَنْ يَقُولَ الرَّجُلُ لِلْمَرْأَةِ وَهِيَ فِي عِدَّتِهَا مِنْ وَفَاةِ زَوْجِهَا إِنَّكِ عَلَيَّ لَكَرِيمَةٌ وَإِنِّي فِيكِ لَرَاغِبٌ وَإِنَّ اللَّهَ لَسَائِقٌ إِلَيْكِ خَيْرًا وَرِزْقًا وَنَحْوَ هَذَا مِنْ الْقَوْلِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdurrahman bin Qasim] dari [Bapaknya] bahwa dia berkata mengenai firman Allah Ta'ala: '(Dan tidak ada dosa bagi kamu meminang wanita-wanita itu dengan sindiran atau kamu menyembunyikan (keinginan mengawini mereka) dalam hatimu. Allah mengetahui bahwa kamu akan menyebut-nyebut mereka, dalam pada itu janganlah kamu mengadakan janji kawin dengan mereka secara rahasia, kecuali sekedar mengucapkan (kepada mereka) perkataan yang ma'ruf) ' (Qs. Al Baqarah: 235) yaitu seorang laki-laki yang berkata kepada seorang wanita yang masih berada pada masa iddah dari kematian suaminya, 'Kamu begitu mulia bagiku, saya ada rasa cinta terhadapmu, semoga Allah menuntunmu kepada kebaikan dan jalan rezki', atau ucapan lain yang semisalnya."
            },
            {
                "number": 962,
                "arab": "حَدَّثَنِي مَالِك عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْأَيِّمُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ تُسْتَأْذَنُ فِي نَفْسِهَا وَإِذْنُهَا صُمَاتُهَا",
                "id": "Telah menceritakan kepadaku Malik dari [Abdullah bin Al Fadl] dari [Nafi' bin Jubair bin Muth'im] dari [Abdullah bin 'Abbas] bahwa Rasulullah Shalla Allahu 'alaihi wa sallam bersabda: \"Seorang janda itu lebih berhak memilih suami daripada walinya sedang seorang gadis harus dimintai persetujuannya, dan tanda persetujuannya adalah sikap diamnya.\""
            },
            {
                "number": 963,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَتْهُ امْرَأَةٌ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي قَدْ وَهَبْتُ نَفْسِي لَكَ فَقَامَتْ قِيَامًا طَوِيلًا فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ زَوِّجْنِيهَا إِنْ لَمْ تَكُنْ لَكَ بِهَا حَاجَةٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ عِنْدَكَ مِنْ شَيْءٍ تُصْدِقُهَا إِيَّاهُ فَقَالَ مَا عِنْدِي إِلَّا إِزَارِي هَذَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ أَعْطَيْتَهَا إِيَّاهُ جَلَسْتَ لَا إِزَارَ لَكَ فَالْتَمِسْ شَيْئًا فَقَالَ مَا أَجِدُ شَيْئًا قَالَ الْتَمِسْ وَلَوْ خَاتَمًا مِنْ حَدِيدٍ فَالْتَمَسَ فَلَمْ يَجِدْ شَيْئًا فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ مَعَكَ مِنْ الْقُرْآنِ شَيْءٌ فَقَالَ نَعَمْ مَعِي سُورَةُ كَذَا وَسُورَةُ كَذَا لِسُوَرٍ سَمَّاهَا فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَنْكَحْتُكَهَا بِمَا مَعَكَ مِنْ الْقُرْآنِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Hazm bin Dinar] dari [Sahal bin Sa'ad As Sa'idi] berkata, \"Seorang wanita datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, saya telah menyerahkan diriku sepenuhnya kepada anda.\" Beliau lalu berdiri lama, hingga ada seorang laki-laki berdiri seraya mengatakan, \"Wahai Rasulullah, jika anda tidak berkenan dengannya, maka nikahkanlah aku dengannya.\" Rasulullah Shalla Allahu 'alaihi wa sallam lalu bertanya kepada laki-laki tersebut: \"Apakah kamu mempunyai sesuatu yang dapat dijadikan mahar untuknya?\" laki-laki itu menjawab; \"Saya tidak mempunyai sesuatu kecuali kain sarung ini.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kamu memberikan kain sarung itu padanya, maka kamu akan duduk tanpa sarung. Carilah yang lain.\" Laki-laki itu mengadu; \"Saya tidak mempunyai sesuatupun.\" Beliau bersabda lagi: \"Carilah walau hanya sekedar cincin besi! .\" Laki-laki itu lalu mencari namun tidak mendapatkannya. Rasulullah shallallahu 'alaihi wasallam bertanya: \"Apakah kamu mempunyai hafalan dari Al Qur'an?\" laki-laki itu menjawab; \"Ya, saya telah hafal surat ini dan ini.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Maka aku nikahkah kamu dengan wanita itu, dengan mahar apa yang telah engkau hafal dari surat Al-Qur'an.\""
            },
            {
                "number": 964,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِأَيُّمَا رَجُلٍ تَزَوَّجَ امْرَأَةً وَبِهَا جُنُونٌ أَوْ جُذَامٌ أَوْ بَرَصٌ فَمَسَّهَا فَلَهَا صَدَاقُهَا كَامِلًا وَذَلِكَ لِزَوْجِهَا غُرْمٌ عَلَى وَلِيِّهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] ia berkata; [Umar bin Khattab] berkata; \"Laki-laki mana saja yang menikahi wanita yang terkena gila, atau lepra, atau kusta, lalu ia menyetubuhinya, maka wanita itu berhak mendapatkan mahar secara penuh. Dan hal itu berakibat walinya yang wajib menanggung hutang atas suaminya.\""
            },
            {
                "number": 965,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ ابْنَةَ عُبَيْدِ اللَّهِ بْنِ عُمَرَ وَأُمُّهَا بِنْتُ زَيْدِ بْنِ الْخَطَّابِ كَانَتْ تَحْتَ ابْنٍ لِعَبْدِ اللَّهِ بْنِ عُمَرَ فَمَاتَ وَلَمْ يَدْخُلْ بِهَا وَلَمْ يُسَمِّ لَهَا صَدَاقًا فَابْتَغَتْ أُمُّهَا صَدَاقَهَا فَقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَلَيْسَ لَهَا صَدَاقٌ وَلَوْ كَانَ لَهَا صَدَاقٌ لَمْ نُمْسِكْهُ وَلَمْ نَظْلِمْهَا فَأَبَتْ أُمُّهَا أَنْ تَقْبَلَ ذَلِكَفَجَعَلُوا بَيْنَهُمْ زَيْدَ بْنَ ثَابِتٍ فَقَضَى أَنْ لَا صَدَاقَ لَهَا وَلَهَا الْمِيرَاثُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] berkata, \"Puteri ubaidhullah bin Umar - ibunya adalah puteri Zaid bin Al Khattab- adalah isteri dari puteranya Abdullah bin Umar, lalu ia (putera Abdullah bin Umar) meninggal dunia dan belum sempat menyetubuhinya serta belum disebutkan maharnya. Maka ibu dari isterinya menginginkan mahar puterinya, [Abdullah bin Umar] lalu berkata; \"Tidak ada mahar baginya, sekiranya ia berhak tentu kami tidak akan menahan mahar tersebut atau berbuat zhalim kepadanya.\" Ibunya merasa keberatan menerima keputusan itu, lalu orang-orang mengambil seseorang yang bisa menjadi penengah, yaitu Zaid bin Tsabit. Lalu [Zaid] memutuskan bahwa wanita tersebut tidak mendapatkan mahar, tetapi ia mendapatkan warisan.\""
            },
            {
                "number": 966,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّ عُمَرَ بْنَ الْخَطَّابِقَضَى فِي الْمَرْأَةِ إِذَا تَزَوَّجَهَا الرَّجُلُ أَنَّهُ إِذَا أُرْخِيَتْ السُّتُورُ فَقَدْ وَجَبَ الصَّدَاقُ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] bahwa [Umar bin Khattab] memberi putusan tentang wanita yang telah dinikahi oleh seorang laki-laki: \"Jika tirai telah diturunkan, maka mahar wajib dibayarkan.\""
            },
            {
                "number": 967,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ أَنَّ زَيْدَ بْنَ ثَابِتٍ كَانَ يَقُولُإِذَا دَخَلَ الرَّجُلُ بِامْرَأَتِهِ فَأُرْخِيَتْ عَلَيْهِمَا السُّتُورُ فَقَدْ وَجَبَ الصَّدَاقُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] bahwa [Zaid bin Tsabit] berkata; \"Jika seorang laki-laki menemui isterinya dan tirai telah diturunkan, maka mahar wajib dibayarkan.\""
            },
            {
                "number": 968,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ الْمَخْزُومِيِّ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تَزَوَّجَ أُمَّ سَلَمَةَ وَأَصْبَحَتْ عِنْدَهُ قَالَ لَهَا لَيْسَ بِكِ عَلَى أَهْلِكِ هَوَانٌ إِنْ شِئْتِ سَبَّعْتُ عِنْدَكِ وَسَبَّعْتُ عِنْدَهُنَّ وَإِنْ شِئْتِ ثَلَّثْتُ عِنْدَكِ وَدُرْتُ فَقَالَتْ ثَلِّثْ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abdullah bin Abu Bakar bin Muhammad bin 'Amru bin Hazm] dari [Abdul Malik bin Abu Bakar bin Abdurrahman bin Al Harits bin Hisyam Al Makhzumi] dari [Bapaknya] berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam menikahi Ummu Salamah dan telah bersama, beliau berkata kepadanya: \"Tidak ada peremehan atas keluargamu. Jika kamu mau, saya akan tinggal selama tujuh hari untukmu dan tujuh hari untuk isteriku yang lain. dan jika kamu mau, saya akan tinggal selama tiga hari bersamamu, lalu saya menggilir.\" Ummu salamah lantas menjawab, \"Berikan aku tiga hari.\""
            },
            {
                "number": 969,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ كَانَ يَقُولُلِلْبِكْرِ سَبْعٌ وَلِلثَّيِّبِ ثَلَاثٌقَالَ مَالِك وَذَلِكَ الْأَمْرُ عِنْدَنَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Humaid Ath Thawil] dari [Anas bin Malik] berkata; \"Bagi seorang gadis tujuh hari, sedangkan bagi seorang janda cukup tiga hari.\" Malik berkata; \"Itulah pendapat yang kami pakai.\""
            },
            {
                "number": 970,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ الْمِسْوَرِ بْنِ رِفَاعَةَ الْقُرَظِيِّ عَنْ الزُّبَيْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الزَّبِيرِأَنَّ رِفَاعَةَ بْنَ سِمْوَالٍ طَلَّقَ امْرَأَتَهُ تَمِيمَةَ بِنْتَ وَهْبٍ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثًا فَنَكَحَتْ عَبْدَ الرَّحْمَنِ بْنَ الزَّبِيرِ فَاعْتَرَضَ عَنْهَا فَلَمْ يَسْتَطِعْ أَنْ يَمَسَّهَا فَفَارَقَهَا فَأَرَادَ رِفَاعَةُ أَنْ يَنْكِحَهَا وَهُوَ زَوْجُهَا الْأَوَّلُ الَّذِي كَانَ طَلَّقَهَا فَذَكَرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَهَاهُ عَنْ تَزْوِيجِهَا وَقَالَ لَا تَحِلُّ لَكَ حَتَّى تَذُوقَ الْعُسَيْلَةَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Al Miswar bin Rifa'ah Al Quradli] dari [Zubair bin Abdurrahman bin Zubair] berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam Rifa'ah bin Simwal mentalak isterinya yang bernama Tamimah binti Wahab sebanyak tiga kali. Kemudian bekas isterinya menikah dengan Abdurrahman bin Zubair. Namun Abdurrahman mempunyai masalah karena tidak mampu menyetubuhinya, sehingga ia kembali mencerikan Tamimah. Maka Rifa'ah ingin menikahinya kembali, karena dia adalah suami pertama yang pernah menceraikannya. Lalu hal itu disampaikan kepada Rasulullah shallallahu 'alaihi wasallam, namun beliau melarangnya seraya bersabda: \"Tidak halal bagimu untuk menikahinya lagi, hingga ia merasakan nikmatnya madu laki-laki yang lain (bersetubuh) .\""
            },
            {
                "number": 971,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهَا سُئِلَتْ عَنْ رَجُلٍ طَلَّقَ امْرَأَتَهُ الْبَتَّةَ فَتَزَوَّجَهَا بَعْدَهُ رَجُلٌ آخَرُ فَطَلَّقَهَا قَبْلَ أَنْ يَمَسَّهَا هَلْ يَصْلُحُ لِزَوْجِهَا الْأَوَّلِ أَنْ يَتَزَوَّجَهَا فَقَالَتْ عَائِشَةُ لَا حَتَّى يَذُوقَ عُسَيْلَتَهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Al Qasim bin Muhammad] dari ['Aisyah] isteri Nabi shallallahu 'alaihi wasallam, dia pernah ditanya tentang laki-laki yang menceraikan isterinya dengan thalaq ba'in (thalaq tiga), kemudian ada laki-laki lain menikahinya dan mencerikannya lagi sebelum melakukan persetubuhan dengannya. Maka apakah boleh bagi suaminya yang pertama untuk menikahinya lagi? 'Aisyah menjawab; \"Tidak boleh, hingga suaminya (yang kedua) dapat merasakan nikmatnya hubungan intim dengannya.\""
            },
            {
                "number": 972,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُجْمَعُ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا وَلَا بَيْنَ الْمَرْأَةِ وَخَالَتِهَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh menikahi seorang perempuan bersamaan dengan bibinya dari pihak bapak dan tidak boleh menikahi perempuan bersamaan dengan bibinya dari pihak ibunya.\""
            },
            {
                "number": 973,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ كَانَ يَقُولُيُنْهَى أَنْ تُنْكَحَ الْمَرْأَةُ عَلَى عَمَّتِهَا أَوْ عَلَى خَالَتِهَا وَأَنْ يَطَأَ الرَّجُلُ وَلِيدَةً وَفِي بَطْنِهَا جَنِينٌ لِغَيْرِهِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] berkata; \"Tidak boleh menyatukan wanita dengan bibinya dari pihak bapaknya atau dari pihak ibunya. Tidak boleh juga seseorang menyetubuhi isterinya yang sedang mengandung janin orang lain.\""
            },
            {
                "number": 974,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ قَالَ سُئِلَ زَيْدُ بْنُ ثَابِتٍعَنْ رَجُلٍ تَزَوَّجَ امْرَأَةً ثُمَّ فَارَقَهَا قَبْلَ أَنْ يُصِيبَهَا هَلْ تَحِلُّ لَهُ أُمُّهَا فَقَالَ زَيْدُ بْنُ ثَابِتٍ لَا الْأُمُّ مُبْهَمَةٌ لَيْسَ فِيهَا شَرْطٌ وَإِنَّمَا الشَّرْطُ فِي الرَّبَائِبِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Yahya bin Sa'id] berkata; \" [Zaid bin Tsabit] ditanya tentang seseorang yang menikahi wanita kemudian menceraikannya sebelum menyetubuhinya, apakah ibunya halal untuk dinikahi?\" Zaid bin Tsabit menjawab; \"Tidak boleh. Karena setatus ibu tidak dirinci, dan tidak ada syarat padanya. Adapun yang disebutkan syaratnya adalah pada anak tiri.\""
            },
            {
                "number": 975,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الشِّغَارِوَالشِّغَارُ أَنْ يُزَوِّجَ الرَّجُلُ ابْنَتَهُ عَلَى أَنْ يُزَوِّجَهُ الْآخَرُ ابْنَتَهُ لَيْسَ بَيْنَهُمَا صَدَاقٌ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Nafi'] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang tentang nikah Syighar. Syighar adalah seseorang yang menikahkan puterinya dengan orang lain dengan syarat orang tersebut menikahkan puterinya dengan dirinya tanpa mahar antara keduanya.\""
            },
            {
                "number": 976,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَبْدِ الرَّحْمَنِ وَمُجَمِّعٍ ابْنَيْ يَزِيدَ بْنِ جَارِيَةَ الْأَنْصَارِيِّ عَنْ خَنْسَاءَ بِنْتِ خِدَامٍ الْأَنْصَارِيَّةِأَنَّ أَبَاهَا زَوَّجَهَا وَهِيَ ثَيِّبٌ فَكَرِهَتْ ذَلِكَ فَأَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَدَّ نِكَاحَهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdurrahman bin Al Qasim] dari [Bapaknya] dari [Abdurrahman] dan [Mujamma'] keduanya adalah anak Yazid bin Jariyah Al Anshari, dari Khansa binti Khidam Al Anshariyah waktu itu ia adalah seorang janda, lalu bapaknya menikahkannya tetapi ia tidak mau menerima pernikahan tersebut. Lalu ia menemui Rasulullah shallallahu 'alaihi wasallam hingga beliau membatalkan pernikahan tersebut.\""
            },
            {
                "number": 977,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ أَنَّ عُمَرَ بْنَ الْخَطَّابِأُتِيَ بِنِكَاحٍ لَمْ يَشْهَدْ عَلَيْهِ إِلَّا رَجُلٌ وَامْرَأَةٌ فَقَالَ هَذَا نِكَاحُ السِّرِّ وَلَا أُجِيزُهُ وَلَوْ كُنْتُ تَقَدَّمْتُ فِيهِ لَرَجَمْتُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zubair Al Maki] berkata, \"Pernah dihadapkan kepada Umar Ibnul Khattab suatu pernikahan yang hanya disaksikan oleh seorang laki-laki dan seorang wanita, maka [Umar] berkata, \"Ini adalah nikah sirri, saya tidak membolehkannya. Sekiranya saya menemukannya, niscaya saya akan merajamnya.\""
            },
            {
                "number": 978,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَعَنْ سُلَيْمَانَ بْنِ يَسَارٍأَنَّ طُلَيْحَةَ الْأَسَدِيَّةَ كَانَتْ تَحْتَ رُشَيْدٍ الثَّقَفِيِّ فَطَلَّقَهَا فَنَكَحَتْ فِي عِدَّتِهَا فَضَرَبَهَا عُمَرُ بْنُ الْخَطَّابِ وَضَرَبَ زَوْجَهَا بِالْمِخْفَقَةِ ضَرَبَاتٍ وَفَرَّقَ بَيْنَهُمَا ثُمَّ قَالَ عُمَرُ بْنُ الْخَطَّابِ أَيُّمَا امْرَأَةٍ نَكَحَتْ فِي عِدَّتِهَا فَإِنْ كَانَ زَوْجُهَا الَّذِي تَزَوَّجَهَا لَمْ يَدْخُلْ بِهَا فُرِّقَ بَيْنَهُمَا ثُمَّ اعْتَدَّتْ بَقِيَّةَ عِدَّتِهَا مِنْ زَوْجِهَا الْأَوَّلِ ثُمَّ كَانَ الْآخَرُ خَاطِبًا مِنْ الْخُطَّابِ وَإِنْ كَانَ دَخَلَ بِهَا فُرِّقَ بَيْنَهُمَا ثُمَّ اعْتَدَّتْ بَقِيَّةَ عِدَّتِهَا مِنْ الْأَوَّلِ ثُمَّ اعْتَدَّتْ مِنْ الْآخَرِ ثُمَّ لَا يَجْتَمِعَانِ أَبَدًاقَالَ مَالِك وَقَالَ سَعِيدُ بْنُ الْمُسَيَّبِ وَلَهَا مَهْرُهَا بِمَا اسْتَحَلَّ مِنْهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Sa'id Ibnul Musayyab] dari [Sulaiman bin Yasar] berkata, \"Thulaihah Al Asadiyah adalah isteri Rusyaid Ats Tsaqafi, tetapi kemudian ia menceraikannya. Thulaihah kemudian menikah pada masa iddahnya. ' [Umar Ibnul Khattab] lantas memukulnya, demikianjuga dengan suaminya, ia memukul Thulaihah dengan cambuk berkali-kali. Umar kemudian memisahkan antara Thulaihah dengan suaminya (yang kedua) . Setelah itu ia berkata, \"Wanita mana saja yang menikah pada masa iddahnya, jika suaminya yang menikahinya belum menyetubuhinya maka keduanya harus dipisahkan, lalu ia harus melanjutkan sisa masa iddahnya dari suami yang pertama. Dan suami yang kedua itu setatusnya sebagai pelamar saja. Tetapi jika ia (suami kedua) telah menggaulinya, maka keduanya dipisahkan, lalu Isterinya melakukan iddah pada sisa masa iddahnya dari suaminya yang pertama kemudian ditambah dengan iddah dari suaminya yang kedua, dan keduanya tidak boleh bersama lagi untuk selamanya.\" Malik berkata; \"Sa'id Ibnul Musayyab berkata; 'Perempuan tersebut berhak mendapatkan mahar (dari suami kedua), karena ia telah mensetubuhinya.\""
            },
            {
                "number": 979,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ كَانَ يَقُولُلَا تُنْكَحُ الْأَمَةُ عَلَى الْحُرَّةِ إِلَّا أَنْ تَشَاءَ الْحُرَّةُ فَإِنْ طَاعَتْ الْحُرَّةُ فَلَهَا الثُّلُثَانِ مِنْ الْقَسْمِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id Ibnul Musayyab] ia berkata; \"Hamba sahaya tidak boleh dinikahi untuk dimadu dengan wanita merdeka, kecuali jika wanita merdeka tersebut ridla. Jika wanita merdeka tadi menyetujui maka dia berhak mendapatkan dua pertiga dalam pembagian.\""
            },
            {
                "number": 980,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَنْ زَيْدِ بْنِ ثَابِتٍأَنَّهُ كَانَ يَقُولُ فِي الرَّجُلِ يُطَلِّقُ الْأَمَةَ ثَلَاثًا ثُمَّ يَشْتَرِيهَا إِنَّهَا لَا تَحِلُّ لَهُ حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Abu Abdurrahman] dari [Zaid bin Tsabit] Bahwasanya ia berkata tentang seorang laki-laki yang mentalak budak wanitanya dengan talak tiga, kemudian membelinya kembali, \"Budak wanita itu tidak halal baginya sehingga ia menikah dengan laki-laki lain."
            },
            {
                "number": 981,
                "arab": "و حَدَّثَنِي عَنْ مَالِك أَنَّهُ سَأَلَ ابْنَ شِهَابٍعَنْ رَجُلٍ كَانَتْ تَحْتَهُ أَمَةٌ مَمْلُوكَةٌ فَاشْتَرَاهَا وَقَدْ كَانَ طَلَّقَهَا وَاحِدَةً فَقَالَ تَحِلُّ لَهُ بِمِلْكِ يَمِينِهِ مَا لَمْ يَبُتَّ طَلَاقَهَا فَإِنْ بَتَّ طَلَاقَهَا فَلَا تَحِلُّ لَهُ بِمِلْكِ يَمِينِهِ حَتَّى تَنْكِحَ زَوْجًا غَيْرَهُ",
                "id": "Telah menceritakan kepadaku dari Malik Bahwasanya ia pernah bertanya kepada [Ibnu Syihab] tentang laki-laki yang mempunyai isteri seorang budak, lalu ia membelinya setelah ia mentalaknya dengan talak satu. Ibnu Syihab menjawab, \"Budak itu tetap halal baginya karena status kepemilikan budak, selama ia tidak menjatuhkan talak ba'in. Tetapi jika ia telah menjatuhkan talak ba'in, maka tidak halal baginya walau statusnya sebagai budak miliknya, hal itu hingga budak tersebut menikah dengan laki-laki lain.\""
            },
            {
                "number": 982,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَنْ أَبِيهِ أَنَّ عُمَرَ بْنَ الْخَطَّابِسُئِلَ عَنْ الْمَرْأَةِ وَابْنَتِهَا مِنْ مِلْكِ الْيَمِينِ تُوطَأُ إِحْدَاهُمَا بَعْدَ الْأُخْرَى فَقَالَ عُمَرُ مَا أُحِبُّ أَنْ أَخْبُرَهُمَا جَمِيعًا وَنَهَى عَنْ ذَلِكَ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari ['ubaidhullah bin Abdullah bin 'Utbah bin Mas'ud] dari [Bapaknya] bahwasanya [Umar bin Khattab] ditanya tentang seorang budak wanita dan puterinya, yang telah disetubuhi salah satunya setelah yang lainnya juga. Umar berkata; \"Saya tidak suka jika menggauli keduanya.\" 'Umar Ibnul Khattab melarang perbuatan tersebut."
            },
            {
                "number": 983,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ أَنَّ رَجُلًا سَأَلَ عُثْمَانَ بْنَ عَفَّانَعَنْ الْأُخْتَيْنِ مِنْ مِلْكِ الْيَمِينِ هَلْ يُجْمَعُ بَيْنَهُمَا فَقَالَ عُثْمَانُ أَحَلَّتْهُمَا آيَةٌ وَحَرَّمَتْهُمَا آيَةٌ فَأَمَّا أَنَا فَلَا أُحِبُّ أَنْ أَصْنَعَ ذَلِكَقَالَ فَخَرَجَ مِنْ عِنْدِهِ فَلَقِيَ رَجُلًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ عَنْ ذَلِكَ فَقَالَ لَوْ كَانَ لِي مِنْ الْأَمْرِ شَيْءٌ ثُمَّ وَجَدْتُ أَحَدًا فَعَلَ ذَلِكَ لَجَعَلْتُهُ نَكَالًا قَالَ ابْنُ شِهَابٍ أُرَاهُ عَلِيَّ بْنَ أَبِي طَالِبٍ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Qabishah bin Dzu`aib] bahwa ada seorang laki-laki bertanya kepada [Utsman bin Affan] tentang dua perempuan yang bersaudara berada di bawah kepemilikan seseorang, apakah keduanya boleh digauli? Utsman menjawab; \"Ayat Al Qur'an telah menghalalkan keduanya, namun ada juga ayat lain mengharamkan keduanya (untuk digauli) . Tetapi aku sendiri tidak suka untuk melakukan hal itu (menggauli dua-duanya) .\" Qabishah berkata; \"Laki-laki tersebut kemudian keluar meninggalkan kediaman Utsman dan berjumpa dengan [seorang sahabat] Nabi shallallahu 'alaihi wasallam, lalu ia tanyakan hal itu kepadanya. Sahabat itu lalu menjawab, \"Sekiranya aku mempunyai wewenang dalam hal itu, lalu aku mendapati orang yang melakukannya niscaya aku akan memberinya hukuman.\" Ibnu Syihab berkata; \"Menurutku sahabat tersebut adalah Ali bin Abu Thalib.\""
            },
            {
                "number": 984,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْمُجَبَّرِ أَنَّهُ قَالَ وَهَبَ سَالِمُ بْنُ عَبْدِ اللَّهِلِابْنِهِ جَارِيَةً فَقَالَ لَا تَقْرَبْهَا فَإِنِّي قَدْ أَرَدْتُهَا فَلَمْ أَنْشَطْ إِلَيْهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abdurrahman bin Al Mujabbar] berkata; \" [Salim bin Abdullah] pernah memberikan hadiah berupa budak wanita kepada anak laki-lakinya sambil mengatakan, \"Kamu jangan mendekatinya, aku ingin menggaulinya, hanya saja aku belum bernafsu terhadapnya.\""
            },
            {
                "number": 985,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ أَبَا نَهْشَلِ بْنَ الْأَسْوَدِ قَالَ لِلْقَاسِمِ بْنِ مُحَمَّدٍإِنِّي رَأَيْتُ جَارِيَةً لِي مُنْكَشِفًا عَنْهَا وَهِيَ فِي الْقَمَرِ فَجَلَسْتُ مِنْهَا مَجْلِسَ الرَّجُلِ مِنْ امْرَأَتِهِ فَقَالَتْ إِنِّي حَائِضٌ فَقُمْتُ فَلَمْ أَقْرَبْهَا بَعْدُ أَفَأَهَبُهَا لِابْنِي يَطَؤُهَا فَنَهَاهُ الْقَاسِمُ عَنْ ذَلِكَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] bahwa Abu Nahsyal bin Al Aswad berkata kepada [Al Qasim bin Muhammad], \"Saya melihat pakaian budak wanitaku tersingkap, lalu aku mendudukinya layaknya seorang suami menduduki isterinya (posisi senggama) . Lantas ia berkata, \"Saya sedang haid! \" Aku lalu berdiri dan tidak mendekatinya setelah itu, maka apakah aku boleh memberikan budak tersebut kepada anakku supaya menyetubuhinya?\" Tetapi Al Qasim melarangnya."
            },
            {
                "number": 986,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ إِبْرَاهِيمَ بْنِ أَبِي عَبْلَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ مَرْوَانَأَنَّهُ وَهَبَ لِصَاحِبٍ لَهُ جَارِيَةً ثُمَّ سَأَلَهُ عَنْهَا فَقَالَ قَدْ هَمَمْتُ أَنْ أَهَبَهَا لِابْنِي فَيَفْعَلُ بِهَا كَذَا وَكَذَا فَقَالَ عَبْدُ الْمَلِكِ لَمَرْوَانُ كَانَ أَوْرَعَ مِنْكَ وَهَبَ لِابْنِهِ جَارِيَةً ثُمَّ قَالَ لَا تَقْرَبْهَا فَإِنِّي قَدْ رَأَيْتُ سَاقَهَا مُنْكَشِفَةً",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibrahim bin Abu 'Ablah] dari [Abdul Malik bin Marwan] bahwa dia pernah memberi hadiah kepada sahabatnya seorang budak wanita. Kemudian dia bertanya tentang perihal budak wanita tersebut, sahabatnya lalu berkata, \"Aku punya keinginan untuk memberikan budak tersebut kepada anakku hingga dia dapat melakukan ini dan itu.\" Abdul Malik berkata; \"Sungguh [Marwan] lebih wara' (menjaga diri) darimu, dia pernah memberikan budak perempuan kepada anaknya seraya berkata; \"Kamu jangan mendekati budak wanita itu, karena aku pernah melihat betisnya tersingkap.\""
            },
            {
                "number": 987,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ قَالَ{ الْمُحْصَنَاتُ مِنْ النِّسَاءِ }هُنَّ أُولَاتُ الْأَزْوَاجِ وَيَرْجِعُ ذَلِكَ إِلَى أَنَّ اللَّهَ حَرَّمَ الزِّنَا",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Sa'id bin Musayyab] ia berkata; \"Yang dimaksud dengan '(Perempuan-perempuan yang menjaga kehormatan) ' adalah perempuan-perempuan yang memiliki suami. Demikian ini karena Allah mengharamkan hukum zina.\""
            },
            {
                "number": 988,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ وَبَلَغَهُ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ أَنَّهُمَا كَانَا يَقُولَانِإِذَا نَكَحَ الْحُرُّ الْأَمَةَ فَمَسَّهَا فَقَدْ أَحْصَنَتْهُقَالَ مَالِك وَكُلُّ مَنْ أَدْرَكْتُ كَانَ يَقُولُ ذَلِكَ تُحْصِنُ الْأَمَةُ الْحُرَّ إِذَا نَكَحَهَا فَمَسَّهَا فَقَدْ أَحْصَنَتْهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] telah sampai kepadanya, dari [Al Qasim bin Muhammad] keduanya berkata; \"Jika seorang laki-laki merdeka menikahi budak wanita lalu menyetubuhinya, maka budak itu telah menjaga kehormatannya.\" Malik berkata; \"Hampir semua orang yang saya temui mengatakan, 'budak wanita itu menjaga kehormatan laki-laki merdeka; yaitu jika ia menikahi lalu menggaulinya, maka artinya budak itu budak tersebut telah menjaga kehormatannya.\""
            },
            {
                "number": 989,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ وَالْحَسَنِ ابْنَيْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ عَنْ أَبِيهِمَا عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ وَعَنْ أَكْلِ لُحُومِ الْحُمُرِ الْإِنْسِيَّةِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Ibnu Syihab] dari [Abdullah] dan [Hasan] keduanya adalah anak Muhammad bin Ali bin Abu Thalib, dari [Bapaknya] dari [Ali bin Abu Thalib] berkata, \"Pada perang Khaibar Rasulullah shallallahu 'alaihi wasallam melarang nikah mut'ah makan daging keledai jinak."
            },
            {
                "number": 990,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِأَنَّ خَوْلَةَ بِنْتَ حَكِيمٍ دَخَلَتْ عَلَى عُمَرَ بْنِ الْخَطَّابِ فَقَالَتْ إِنَّ رَبِيعَةَ بْنَ أُمَيَّةَ اسْتَمْتَعَ بِامْرَأَةٍ فَحَمَلَتْ مِنْهُ فَخَرَجَ عُمَرُ بْنُ الْخَطَّابِ فَزِعًا يَجُرُّ رِدَاءَهُ فَقَالَ هَذِهِ الْمُتْعَةُ وَلَوْ كُنْتُ تَقَدَّمْتُ فِيهَا لَرَجَمْتُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Urwah bin Zubair] bahwa Khaulah binti Hakim menemui Umar bin Khattab dan berkata; \"Rabi'ah bin Umayyah telah menikah secara mut'ah dengan seorang wanita, lalu wanita itu hamil! \" [Umar bin Khattab] kemudian keluar dengan membawa selendangnya, lalu ia berkata, 'Ini adalah Nikah mut'ah, sekiranya aku mendapatinya, maka akan aku rajam.\""
            },
            {
                "number": 991,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك أَنَّهُ سَمِعَ رَبِيعَةَ بْنَ أَبِي عَبْدِ الرَّحْمَنِ يَقُولُيَنْكِحُ الْعَبْدُ أَرْبَعَ نِسْوَةٍقَالَ مَالِك وَهَذَا أَحْسَنُ مَا سَمِعْتُ فِي ذَلِكَ",
                "id": "Telah menceritakan kepadaku Yazid dari Malik telah mendengar [Rabi'ah bin Abu Abdurrahman] ia berkata; \"Seorang budak itu boleh menikahi empat wanita.\" Malik berkata; \"Pendapat ini adalah pendapat yang paling baik yang telah saya dengar dalam masalah itu.\""
            },
            {
                "number": 992,
                "arab": "حَدَّثَنِي مَالِك عَنْ ابْنِ شِهَابٍ أَنَّهُ بَلَغَهُأَنَّ نِسَاءً كُنَّ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسْلِمْنَ بِأَرْضِهِنَّ وَهُنَّ غَيْرُ مُهَاجِرَاتٍ وَأَزْوَاجُهُنَّ حِينَ أَسْلَمْنَ كُفَّارٌ مِنْهُنَّ بِنْتُ الْوَلِيدِ بْنِ الْمُغِيرَةِ وَكَانَتْ تَحْتَ صَفْوَانَ بْنِ أُمَيَّةَ فَأَسْلَمَتْ يَوْمَ الْفَتْحِ وَهَرَبَ زَوْجُهَا صَفْوَانُ بْنُ أُمَيَّةَ مِنْ الْإِسْلَامِ فَبَعَثَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْنَ عَمِّهِ وَهْبَ بْنَ عُمَيْرٍ بِرِدَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَانًا لِصَفْوَانَ بْنِ أُمَيَّةَ وَدَعَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْإِسْلَامِ وَأَنْ يَقْدَمَ عَلَيْهِ فَإِنْ رَضِيَ أَمْرًا قَبِلَهُ وَإِلَّا سَيَّرَهُ شَهْرَيْنِ فَلَمَّا قَدِمَ صَفْوَانُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرِدَائِهِ نَادَاهُ عَلَى رُءُوسِ النَّاسِ فَقَالَ يَا مُحَمَّدُ إِنَّ هَذَا وَهْبَ بْنَ عُمَيْرٍ جَاءَنِي بِرِدَائِكَ وَزَعَمَ أَنَّكَ دَعَوْتَنِي إِلَى الْقُدُومِ عَلَيْكَ فَإِنْ رَضِيتُ أَمْرًا قَبِلْتُهُ وَإِلَّا سَيَّرْتَنِي شَهْرَيْنِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْزِلْ أَبَا وَهْبٍ فَقَالَ لَا وَاللَّهِ لَا أَنْزِلُ حَتَّى تُبَيِّنَ لِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَلْ لَكَ تَسِيرُ أَرْبَعَةَ أَشْهُرٍ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِبَلَ هَوَازِنَ بِحُنَيْنٍ فَأَرْسَلَ إِلَى صَفْوَانَ بْنِ أُمَيَّةَ يَسْتَعِيرُهُ أَدَاةً وَسِلَاحًا عِنْدَهُ فَقَالَ صَفْوَانُ أَطَوْعًا أَمْ كَرْهًا فَقَالَ بَلْ طَوْعًا فَأَعَارَهُ الْأَدَاةَ وَالسِّلَاحَ الَّذِي عِنْدَهُ ثُمَّ خَرَجَ صَفْوَانُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ كَافِرٌ فَشَهِدَ حُنَيْنًا وَالطَّائِفَ وَهُوَ كَافِرٌ وَامْرَأَتُهُ مُسْلِمَةٌ وَلَمْ يُفَرِّقْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَهُ وَبَيْنَ امْرَأَتِهِ حَتَّى أَسْلَمَ صَفْوَانُ وَاسْتَقَرَّتْ عِنْدَهُ امْرَأَتُهُ بِذَلِكَ النِّكَاحِو حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ أَنَّهُ قَالَ كَانَ بَيْنَ إِسْلَامِ صَفْوَانَ وَبَيْنَ إِسْلَامِ امْرَأَتِهِ نَحْوٌ مِنْ شَهْرَيْنِ قَالَ ابْنُ شِهَابٍ وَلَمْ يَبْلُغْنَا أَنَّ امْرَأَةً هَاجَرَتْ إِلَى اللَّهِ وَرَسُولِهِ وَزَوْجُهَا كَافِرٌ مُقِيمٌ بِدَارِ الْكُفْرِ إِلَّا فَرَّقَتْ هِجْرَتُهَا بَيْنَهَا وَبَيْنَ زَوْجِهَا إِلَّا أَنْ يَقْدَمَ زَوْجُهَا مُهَاجِرًا قَبْلَ أَنْ تَنْقَضِيَ عِدَّتُهَا",
                "id": "Telah menceritakan kepadaku Malik dari [Ibnu Syihab] telah sampai kepadanya, bahwa para wanita pada masa Rasulullah shallallahu 'alaihi wasallam telah masuk Islam di tanah kelahirannya dan mereka tidak termasuk orang yang berhijrah. Ketika mereka masuk Islam, suami-suami mereka masih dalam keadaan kafir. Di antara mereka adalah puteri Al Walid bin Mughirah. Ia adalah isteri Shafwan bin Umayyah, lalu ia masuk Islam pada waktu Fathu Makkah, sedangkan suaminya, Shafwan bin Umayyah belum mau masuk Islam. Rasulullah shallallahu 'alaihi wasallam mengutus keponakannya, Wahab bin Umair kepadanya dengan membawa selendang Rasulullah shallallahu 'alaihi wasallam sebagai bentuk jaminan keamanan untuk Shafwan bin Umayyah. Rasulullah shallallahu 'alaihi wasallam kemudian mengajaknya masuk Islam dan menginginkan agar ia menemui beliau. Jika ia setuju dengan hal itu maka ia akan menerimanya, jika tidak setuju maka beliau akan memberi waktu dua bulan.\" Tatkala Shafwan menghadap Rasulullah shallallahu 'alaihi wasallam dengan membawa selendang beliau, dia memanggil Rasulullah shallallahu 'alaihi wasallam di depan para tokoh. Ia mengatakan, \"Wahai Muhammad, Wahab bin Umair telah menemuiku dengan membawa selendangmu, dia menyatakan bahwa engkau menyuruh agar aku menghadapmu, jika aku menyetujui hal tersebut maka pasti aku terima. Jika tidak, kamu akan memberi waktu penangguhan selama dua bulan?\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Abu Wahab, turunlah (dari kendaraan) .\" Dia menjawab; \"Tidak, Demi Allah, saya tidak akan turun hingga engkau menjelaskannya kepadaku.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Bahkan penangguhanmu selama empat bulan.\" Selanjutnya Rasulullah shallallahu 'alaihi wasallam berangkat menghadapi Hawazin di daerah Hunain. Beliau mengirim utusan kepada Shafwan bin Umayyah untuk meminjam peralatan perang dan senjata miliknya.\" Shafwan berkata; \"Berdasarkan paksaan atau kerelaan.\" Beliau menjawab; \"Kerelaan.\" Lalu Shafwan meminjamkan peralatan perang dan senjata miliknya. Kemudian Shafwan pun ikut berangkat bersama Rasulullah shallallahu 'alaihi wasallam, sementara ia masih dalam keadaan kafir. Ia pernah mengikuti peperangan Hunain dan Tha'if. Waktu itu dia masih kafir sedang isterinya telah masuk Islam, tetapi Rasulullah shallallahu 'alaihi wasallam tidak memisahkan antara ia dan isterinya hingga Shafwan masuk Islam, dan isterinya masih mengakuinya dengan pernikahan yang lama.\" Telah menceritakan kepadaku dari Malik dari Ibnu Syihab berkata; \"Jarak waktu antara Islamnya Shafwan dan Islamnya isterinya itu sekitar dua bulan.\" Ibnu Syihab berkata; \"Tidak ada kabar yang sampai kepada kami, bahwa jika seorang perempuan berhijrah kepada Allah dan Rasul-Nya sedang suaminya kafir dan masih menetap di Darul Kufr, kecuali hijrahnya akan menjadi pemisah antara dirinya dengan suaminya, kecuali jika suaminya datang untuk berhijrah sebelum habis masa iddah isterinya.\""
            },
            {
                "number": 993,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍأَنَّ أُمَّ حَكِيمٍ بِنْتَ الْحَارِثِ بْنِ هِشَامٍ وَكَانَتْ تَحْتَ عِكْرِمَةَ بْنِ أَبِي جَهْلٍ فَأَسْلَمَتْ يَوْمَ الْفَتْحِ وَهَرَبَ زَوْجُهَا عِكْرِمَةُ بْنُ أَبِي جَهْلٍ مِنْ الْإِسْلَامِ حَتَّى قَدِمَ الْيَمَنَ فَارْتَحَلَتْ أُمُّ حَكِيمٍ حَتَّى قَدِمَتْ عَلَيْهِ بِالْيَمَنِ فَدَعَتْهُ إِلَى الْإِسْلَامِ فَأَسْلَمَ وَقَدِمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ فَلَمَّا رَآهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَثَبَ إِلَيْهِ فَرِحًا وَمَا عَلَيْهِ رِدَاءٌ حَتَّى بَايَعَهُفَثَبَتَا عَلَى نِكَاحِهِمَا ذَلِكَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] ia bahwa: \"Ummu Hakim binti Al Harits bin Hisyam adalah isteri Ikrimah bin Abu Jahl, lalu dia masuk Islam pada waktu Fathu Makkah sedang suaminya, Ikrimah bin Abu Jahl kabur karena tidak mau masuk Islam, sehingga ia (Ikrimah) sampai ke kota Yaman. Ummu Hakim lantas menyusulnya hingga ke Yaman, lalu ia mengajak suaminya masuk ke dalam Islam. Akhirnya Ikrimah pun masuk Islam, ia lalu menemui Rasulullah shallallahu 'alaihi wasallam saat terjadi pembukaan kota Makkah. Tatkala Rasulullah shallallahu 'alaihi wasallam melihatnya, beliau menyambutnya dengan gembira, sementara Ikrimah tidak membawa selendang (sebagai tanda jaminan) hingga ia membaiat Rasulullah shallallahu 'alaihi wasallam. Setelah itu beliau menetapkan kembali pernikahan mereka berdua.\""
            },
            {
                "number": 994,
                "arab": "و حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَوْفٍ جَاءَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِهِ أَثَرُ صُفْرَةٍ فَسَأَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ أَنَّهُ تَزَوَّجَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمْ سُقْتَ إِلَيْهَا فَقَالَ زِنَةَ نَوَاةٍ مِنْ ذَهَبٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْلِمْ وَلَوْ بِشَاةٍ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Humaid Ath Thawil] dari [Anas bin Malik] berkata, \"Abdurrahman bin 'Auf menemui Rasulullah shallallahu 'alaihi wasallam, sementara pada dirinya terdapat waran kuning bekas za'faran. Sehingga Rasulullah shallallahu 'alaihi wasallam menanyakan sebabnya, lalu dia memberitahukan bahwa dirinya baru saja menikah. Rasulullah shallallahu 'alaihi wasallam bertanya: \"Berapa mahar yang kamu berikan kepadanya?\" 'Abdurrahman menjawab; \"Emas sebesar biji kurma.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Adakanlah walimah walau hanya dengan menyembelih seekor kambing\"."
            },
            {
                "number": 995,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ قَالَ لَقَدْ بَلَغَنِيأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُولِمُ بِالْوَلِيمَةِ مَا فِيهَا خُبْزٌ وَلَا لَحْمٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] berkata; \"Telah sampai kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam pernah mengadakan walimah, sementara di dalamnya tidak terdapat roti maupun daging sama sekali.\""
            },
            {
                "number": 996,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دُعِيَ أَحَدُكُمْ إِلَى وَلِيمَةٍ فَلْيَأْتِهَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] dari [Abdullah bin 'Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang di antara kalian diundang untuk mendatangi acara walimah, hendaklah dia mendatanginya.\""
            },
            {
                "number": 997,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ كَانَ يَقُولُشَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ يُدْعَى لَهَا الْأَغْنِيَاءُ وَيُتْرَكُ الْمَسَاكِينُ وَمَنْ لَمْ يَأْتِ الدَّعْوَةَ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Al A'raj] dari [Abu Hurairah] ia berkata; \"Seburuk-buruk makanan ialah makanan walimah yang di dalamnya hanya diundang orang-orang kaya, tanpa orang-orang miskin. Barangsiapa tidak mendatangi undangan walimah, berarti dia telah bermaksiat kepada Allah dan Rasul-Nya.\""
            },
            {
                "number": 998,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُإِنَّ خَيَّاطًا دَعَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِطَعَامٍ صَنَعَهُ قَالَ أَنَسٌ فَذَهَبْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى ذَلِكَ الطَّعَامِ فَقَرَّبَ إِلَيْهِ خُبْزًا مِنْ شَعِيرٍ وَمَرَقًا فِيهِ دُبَّاءٌ قَالَ أَنَسٌ فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَتَبَّعُ الدُّبَّاءَ مِنْ حَوْلِ الْقَصْعَةِفَلَمْ أَزَلْ أُحِبُّ الدُّبَّاءَ بَعْدَ ذَلِكَ الْيَوْمِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ishaq bin Abdullah bin Abu Thalhah] Bahwasanya ia mendengar [Anas bin Malik] ia berkata; \"Seorang penjahit mengundang Rasulullah shallallahu 'alaihi wasallam menghadiri masakan yang telah buat.\" Anas berkata; \"Aku lalu pergi bersama beliau menghadiri undangan tersebut. Beliau dipersilahkan menikmati hidangan berupa roti dari gandum beserta kuah yang di dalamnya terdapat sejenis labu.\" Anas melanjutkan, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam mencari-cari labu tersebut di dalam nampan kuah tersebut. Maka semenjak hari itu, sayapun menyukai sejenis labu.\""
            },
            {
                "number": 999,
                "arab": "حَدَّثَنِي يَحْيَى عَنْ مَالِك عَنْ زَيْدِ بْنِ أَسْلَمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا تَزَوَّجَ أَحَدُكُمْ الْمَرْأَةَ أَوْ اشْتَرَى الْجَارِيَةَ فَلْيَأْخُذْ بِنَاصِيَتِهَا وَلْيَدْعُ بِالْبَرَكَةِ وَإِذَا اشْتَرَى الْبَعِيرَ فَلْيَأْخُذْ بِذِرْوَةِ سَنَامِهِ وَلْيَسْتَعِذْ بِاللَّهِ مِنْ الشَّيْطَانِ",
                "id": "Telah menceritakan kepadaku Yahya dari Malik dari [Zaid bin Aslam] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang di antara kalian menikahi seorang wanita atau membeli budak wanita, hendaklah dia memegang ubun-ubunnya dan berdo'a agar diberkahi oleh Allah Ta'ala. Apabila salah seorang di antara kalian membeli seekor unta, hendaklah dia memegang bagian atas punuknya dan berlindung kepada Allah Ta'ala dari kejahatan setan.\""
            },
            {
                "number": 1000,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّأَنَّ رَجُلًا خَطَبَ إِلَى رَجُلٍ أُخْتَهُ فَذَكَرَ أَنَّهَا قَدْ كَانَتْ أَحْدَثَتْ فَبَلَغَ ذَلِكَ عُمَرَ بْنَ الْخَطَّابِ فَضَرَبَهُ أَوْ كَادَ يَضْرِبُهُ ثُمَّ قَالَ مَا لَكَ وَلِلْخَبَرِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Abu Az Zubair Al Maki] berkata, \"Seorang lelaki melamar seorang wanita melalui saudaranya. Saudara wanita itu memberitahukan bahwa saudara wanitanya dahulu pernah berzina. Hal itu disampaikan kepada [Umar bin Khattab], maka dipukullah saudara laki-laki perempuan itu, atau hampir saja dia dipukul. Kemudian Umar berkata; \"Apa urusanmu memberi kabar itu?\""
            },
            {
                "number": 1001,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ وَعُرْوَةَ بْنَ الزُّبَيْرِكَانَا يَقُولَانِ فِي الرَّجُلِ يَكُونُ عِنْدَهُ أَرْبَعُ نِسْوَةٍ فَيُطَلِّقُ إِحْدَاهُنَّ الْبَتَّةَ أَنَّهُ يَتَزَوَّجُ إِنْ شَاءَ وَلَا يَنْتَظِرُ أَنْ تَنْقَضِيَ عِدَّتُهَاو حَدَّثَنِي عَنْ مَالِك عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ وَعُرْوَةَ بْنَ الزُّبَيْرِ أَفْتَيَا الْوَلِيدَ بْنَ عَبْدِ الْمَلِكِ عَامَ قَدِمَ الْمَدِينَةَ بِذَلِكَ غَيْرَ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ قَالَ طَلَّقَهَا فِي مَجَالِسَ شَتَّى",
                "id": "Telah menceritakan kepadaku dari Malik dari [Rabi'ah bin Abu Abdurrahman] bahwa [Al Qasim bin Muhammad] dan [Urwah bin Zubair] berkata mengenai seorang laki-laki yang memiliki empat isteri, lalu ia menceraikan salah satu isterinya dengan talak tiga: \"Dia boleh menikah lagi sesuai kehendaknya tanpa harus menunggu 'iddah isterinya selesai.\" Telah menceritakan kepadaku dari Malik dari Rabi'ah bin Abu Abdurrahman bahwa Al Qasim bin Muhammad dan Urwah bin Zubair menfatwakan demikian kepada Al Walid bin Abdul Malik ketika dia datang ke Madinah, hanya saja Al Qasim bin Muhammad mengatakan, \"Talaklah ia dalam beberapa majlis (tidak dengan talak tiga sekaligus) .\""
            },
            {
                "number": 1002,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ قَالَثَلَاثٌ لَيْسَ فِيهِنَّ لَعِبٌ النِّكَاحُ وَالطَّلَاقُ وَالْعِتْقُ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Sa'id bin Musayyab] berkata; \"Ada tiga perkara yang tidak ada kata 'main-main' di dalamnya; nikah, talak dan membebaskan hamba sahaya.\""
            },
            {
                "number": 1003,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ عَنْ رَافِعِ بْنِ خَدِيجٍأَنَّهُ تَزَوَّجَ بِنْتَ مُحَمَّدِ بْنِ مَسْلَمَةَ الْأَنْصَارِيِّ فَكَانَتْ عِنْدَهُ حَتَّى كَبِرَتْ فَتَزَوَّجَ عَلَيْهَا فَتَاةً شَابَّةً فَآثَرَ الشَّابَّةَ عَلَيْهَا فَنَاشَدَتْهُ الطَّلَاقَ فَطَلَّقَهَا وَاحِدَةً ثُمَّ أَمْهَلَهَا حَتَّى إِذَا كَادَتْ تَحِلُّ رَاجَعَهَا ثُمَّ عَادَ فَآثَرَ الشَّابَّةَ فَنَاشَدَتْهُ الطَّلَاقَ فَطَلَّقَهَا وَاحِدَةً ثُمَّ رَاجَعَهَا ثُمَّ عَادَ فَآثَرَ الشَّابَّةَ فَنَاشَدَتْهُ الطَّلَاقَ فَقَالَ مَا شِئْتِ إِنَّمَا بَقِيَتْ وَاحِدَةٌ فَإِنْ شِئْتِ اسْتَقْرَرْتِ عَلَى مَا تَرَيْنَ مِنْ الْأُثْرَةِ وَإِنْ شِئْتِ فَارَقْتُكِ قَالَتْ بَلْ أَسْتَقِرُّ عَلَى الْأُثْرَةِ فَأَمْسَكَهَا عَلَى ذَلِكَ وَلَمْ يَرَ رَافِعٌ عَلَيْهِ إِثْمًا حِينَ قَرَّتْ عِنْدَهُ عَلَى الْأُثْرَةِ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] dari [Rafi' bin Khudaij] bahwa dia menikahi anak gadis Muhammad bin Maslamah Al Anshari. (gadis itu) tinggal bersamanya sampai tua. Kemudian Rafi' menikah lagi dengan seorang gadis yang masih muda. Ternyata dia lebih mengutamakan sang gadis itu daripada (isterinya yang lama) . Sehingga isterinya yang lama menggugat cerai kepadanya. Lalu Rafi' menceraikannya dengan talak satu, dia berlaku baik dan lembut kepada (isterinya yang lama) hingga menjelang masa iddahnya habis, ia ruju' kembali. Setelah ruju', dia masih memperlakukannya sama seperti semula (lebih mengutamakan isteri mudanya) sehingga (isteri lamanya) menggugat cerai, maka jatuhlah talak dua. Kemudian dia ruju' kembali, namun dia tetap mengulangi tindakannya dengan mengutamakan yang gadis sehingga isteri tuanya menggugat cerai. Rafi' bin Khudaij berkata; \"Sekarang terserah kamu, jatah talak hanya tinggal satu. Jika kamu mau, kamu boleh tetap tinggal dan menerima apa adanya. Jika tidak, saya akan menceraikanmu.\" (wanita itu) berkata; \"Saya akan tetap tinggal walau kamu berlaku demikian.\" Akhirnya Rafi' tidak jadi menceraikan isterinya. Rafi' tidak melihat bahwa hal itu berdosa ketika dia menetapkannya untuk tetap tinggal (isteri lamanya) dengan perlakuan yang demikian."
            },
            {
                "number": 1004,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِقَالَ لَهُ الْبَتَّةُ مَا يَقُولُ النَّاسُ فِيهَا قَالَ أَبُو بَكْرٍ فَقُلْتُ لَهُ كَانَ أَبَانُ بْنُ عُثْمَانَ يَجْعَلُهَا وَاحِدَةً فَقَالَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ لَوْ كَانَ الطَّلَاقُ أَلْفًا مَا أَبْقَتْ الْبَتَّةُ مِنْهَا شَيْئًا مَنْ قَالَ الْبَتَّةَ فَقَدْ رَمَى الْغَايَةَ الْقُصْوَى",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Abu Bakar bin Hazm] bahwa [Umar bin Abdul Aziz] berkata kepadanya; \"Apa yang dikatakan orang-orang tentang talaq ba'in?\" Abu bakar menjawab; \" [Aban bin Utsman] menganggapnya sebagai talak satu.\" Umar bin Abdul Aziz pun berkata; \"Kalau seandainya talak dibolehkan sampai seribu kali, niscaya tidak akan tersisa talak bain sedikitpun. Barangsiapa mengatakan talak ba'in, berarti dia telah sampai pada batas akhir.\""
            },
            {
                "number": 1005,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ ابْنِ شِهَابٍ أَنَّ مَرْوَانَ بْنَ الْحَكَمِكَانَ يَقْضِي فِي الَّذِي يُطَلِّقُ امْرَأَتَهُ الْبَتَّةَ أَنَّهَا ثَلَاثُ تَطْلِيقَاتٍقَالَ مَالِك وَهَذَا أَحَبُّ مَا سَمِعْتُ إِلَيَّ فِي ذَلِكَ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Ibnu Syihab] bahwa [Marwan bin Al Hakam] memberi putusan bahwa suami yang menceraikan isterinya dengan talak ba'in, maka itu adalah talak tiga. Malik berkata; \"Ini adalah pendapat yang paling saya sukai.\""
            },
            {
                "number": 1006,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ يَقُولُ فِي الْخَلِيَّةِ وَالْبَرِيَّةِ إِنَّهَا ثَلَاثُ تَطْلِيقَاتٍ كُلُّ وَاحِدَةٍ مِنْهُمَا",
                "id": "Telah menceritakan kepadaku dari Malik dari [Nafi'] bahwa [Abdullah bin Umar] mengatakan tentang khaliyyah dan bariyyah, \"Kedua-duanya adalah talak tiga.\" "
            },
            {
                "number": 1007,
                "arab": "و حَدَّثَنِي عَنْ مَالِك عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍأَنَّ رَجُلًا كَانَتْ تَحْتَهُ وَلِيدَةٌ لِقَوْمٍ فَقَالَ لِأَهْلِهَا شَأْنَكُمْ بِهَا فَرَأَى النَّاسُ أَنَّهَا تَطْلِيقَةٌ وَاحِدَةٌ",
                "id": "Telah menceritakan kepadaku dari Malik dari [Yahya bin Sa'id] dari [Al Qasim bin Muhammad] berkata, \"Seorang lelaki yang mempunyai isteri dari suatu kaum. Kemudian dia berkata kepada keluarga isteri; \"Tentang dia terserah kalian.\" Maka orang-orang menganggap itu sebagai talak satu."
            },
            {
                "number": 1008,
                "arab": "و حَدَّثَنِي عَنْ مَالِك أَنَّهُ سَمِعَ ابْنَ شِهَابٍيَقُولُ فِي الرَّجُلِ يَقُولُ لِامْرَأَتِهِ بَرِئْتِ مِنِّي وَبَرِئْتُ مِنْكِ إِنَّهَا ثَلَاثُ تَطْلِيقَاتٍ بِمَنْزِلَةِ الْبَتَّةِ",
                "id": "Telah menceritakan kepadaku dari Malik bahwa ia mendengar [Ibnu Syihab] berkata tentang seorang suami yang berkata kepada isterinya; 'Kamu berlepas diri dariku dan saya berlepas diri darimu', ucapan itu kedudukannya sama dengan talak tiga.\""
            }
        ]
    }
}