{
    "status": true,
    "data": {
        "start": 3279,
        "end": 3427,
        "total": 149,
        "book": "muslim",
        "hadits": [
            {
                "number": 3279,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ زَكَرِيَّاءَ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَ جَاءَ رَجُلٌ مِنْ بَنِي النَّبِيتِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا أَحْمَدُ بْنُ جَنَابٍ الْمِصِّيصِيُّ حَدَّثَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ عَنْ زَكَرِيَّاءَ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَجَاءَ رَجُلٌ مِنْ بَنِي النَّبِيتِ قَبِيلٍ مِنْ الْأَنْصَارِ فَقَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّكَ عَبْدُهُ وَرَسُولُهُ ثُمَّ تَقَدَّمَ فَقَاتَلَ حَتَّى قُتِلَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَمِلَ هَذَا يَسِيرًا وَأُجِرَ كَثِيرًا",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah] dari [Zakaria] dari [Abu Ishaq] dari [Al Barra] dia berkata, \"Seorang laki-laki dari Bani Nabit datang kepada Nabi shallallahu 'alaihi wasallam.\" (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Janab Al Mishshishi] telah menceritakan kepada kami [Isa] -yaitu Ibnu Yunus- dari [Zakaria] dari [Abu Ishaq] dari [Al Bara] dia berkata, \"Seorang laki-laki dari Bani Nabit dari kabilah Anshar datang seraya berkata, \"Saya bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah, dan sesungguhnya kamu adalah hamba dan utusan-Nya. Kemudian laki-laki itu maju bertempur hingga meninggal, maka Nabi shallallahu 'alaihi wasallam bersabda: \"(Orang ini) sedekit beramal, namun diganjar dengan pahala yang banyak.\""
            },
            {
                "number": 3280,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ النَّضْرِ بْنِ أَبِي النَّضْرِ وَهَارُونُ بْنُ عَبْدِ اللَّهِ وَمُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ قَالُوا حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا سُلَيْمَانُ وَهُوَ ابْنُ الْمُغِيرَةِ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُسَيْسَةَ عَيْنًا يَنْظُرُ مَا صَنَعَتْ عِيرُ أَبِي سُفْيَانَ فَجَاءَ وَمَا فِي الْبَيْتِ أَحَدٌ غَيْرِي وَغَيْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا أَدْرِي مَا اسْتَثْنَى بَعْضَ نِسَائِهِ قَالَ فَحَدَّثَهُ الْحَدِيثَ قَالَ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَكَلَّمَ فَقَالَ إِنَّ لَنَا طَلِبَةً فَمَنْ كَانَ ظَهْرُهُ حَاضِرًا فَلْيَرْكَبْ مَعَنَا فَجَعَلَ رِجَالٌ يَسْتَأْذِنُونَهُ فِي ظُهْرَانِهِمْ فِي عُلْوِ الْمَدِينَةِ فَقَالَ لَا إِلَّا مَنْ كَانَ ظَهْرُهُ حَاضِرًا فَانْطَلَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ حَتَّى سَبَقُوا الْمُشْرِكِينَ إِلَى بَدْرٍ وَجَاءَ الْمُشْرِكُونَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُقَدِّمَنَّ أَحَدٌ مِنْكُمْ إِلَى شَيْءٍ حَتَّى أَكُونَ أَنَا دُونَهُ فَدَنَا الْمُشْرِكُونَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُومُوا إِلَى جَنَّةٍ عَرْضُهَا السَّمَوَاتُ وَالْأَرْضُ قَالَ يَقُولُ عُمَيْرُ بْنُ الْحُمَامِ الْأَنْصَارِيُّ يَا رَسُولَ اللَّهِ جَنَّةٌ عَرْضُهَا السَّمَوَاتُ وَالْأَرْضُ قَالَ نَعَمْ قَالَ بَخٍ بَخٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يَحْمِلُكَ عَلَى قَوْلِكَ بَخٍ بَخٍ قَالَ لَا وَاللَّهِ يَا رَسُولَ اللَّهِ إِلَّا رَجَاءَةَ أَنْ أَكُونَ مِنْ أَهْلِهَا قَالَ فَإِنَّكَ مِنْ أَهْلِهَا فَأَخْرَجَ تَمَرَاتٍ مِنْ قَرَنِهِ فَجَعَلَ يَأْكُلُ مِنْهُنَّ ثُمَّ قَالَ لَئِنْ أَنَا حَيِيتُ حَتَّى آكُلَ تَمَرَاتِي هَذِهِ إِنَّهَا لَحَيَاةٌ طَوِيلَةٌ قَالَ فَرَمَى بِمَا كَانَ مَعَهُ مِنْ التَّمْرِ ثُمَّ قَاتَلَهُمْ حَتَّى قُتِلَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Nadlr bin Abu Nadlr] dan [Harun bin Abdullah] dan [Muhammad bin Rafi'] dan [Abd bin Humaid] dan lafadz mereka saling berdekatan, mereka berkata; telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Sulaiman] -yaitu Ibnu Al Mughirah- dari [Tsabit] dari [Anas bin Malik] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengutus Busaisah sebagai mata-mata, mengintai gerak-gerik kafilah Abu Sufyan. Busaisah lalu datang sedangkan di rumah tidak ada seorangpun selain saya dan Rasulullah shallallahu 'alaihi wasallam.\" Anas berkata, \"Saya tidak tahu apakah beliau mengistimewakan sebagian dari isterinya (untuk mendengar berita rahasia).\" Anas melanjutkan, \"Lantas Busaisah menyampaikan laporannya. Kemudian Rasulullah shallallahu 'alaihi wasallam keluar sambil bersabda: \"Kita berangkat sekarang untuk suatu tujuan, siapa yang telah siap kendaraannya, maka berangkatlah bersama kami.\" Lantas beberapa orang laki-laki meminta izin kepada beliau untuk mengambil kendaraannya di luar kota Madinah, namun beliau bersabda: \"Tidak, cukup orang-orang yang kendaraanya telah siap saja.\" Kemudian Rasulullah shallallahu 'alaihi wasallam dan para sahabatnya berangkat sehingga mereka lebih dahulu tiba di Badar daripada kaum Musyrikin. Tidak lama kemudian kaum Musyrikin tiba, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian bertindak sebelum ada perintah dariku.\" Ketika kaum Musyrikin semakin dekat, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Majulah kalian ke surga, yang luasnya seluas langit dan bumi.\" Anas berkata, \"Tiba-tiba 'Umair bin Al Hammam Al Anshari berkata, \"Ya Rasulullah, surga yang luasnya seluas langit dan bumi!\" Beliau menjawab: \"Ya.\" 'Umair berkata, \"Wah, wah..!\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mengapa kamu mengatakan wah...wah..?\" Umair menjawab, \"Tidak, demi Allah wahai Rasulullah, saya mengharap semoga saya menjadi penghuninya.\" Beliau bersabda: \"Ya, sesungguhnya kamu termasuk dari penghuninya.\" Kemudian dia mengeluarkan kurma dari dalam sakunya dan memakannya sebagian. Sesudah itu dia berkata, \"Sungguh kehidupan yang lama bagiku, seandainya aku menghabiskan kurmaku ini.\" Anas berkata, \"Maka kurma yang masih tersisa di tangannya ia lemparkan begitu saja kemudian dia bertempur hingga gugur.\""
            },
            {
                "number": 3281,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَاللَّفْظُ لِيَحْيَى قَالَ قُتَيْبَةُ حَدَّثَنَا و قَالَ يَحْيَى أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ أَبِي وَهُوَ بِحَضْرَةِ الْعَدُوِّ يَقُولُاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَبْوَابَ الْجَنَّةِ تَحْتَ ظِلَالِ السُّيُوفِ فَقَامَ رَجُلٌ رَثُّ الْهَيْئَةِ فَقَالَ يَا أَبَا مُوسَى آنْتَ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ هَذَا قَالَ نَعَمْقَالَ فَرَجَعَ إِلَى أَصْحَابِهِ فَقَالَ أَقْرَأُ عَلَيْكُمْ السَّلَامَ ثُمَّ كَسَرَ جَفْنَ سَيْفِهِ فَأَلْقَاهُ ثُمَّ مَشَى بِسَيْفِهِ إِلَى الْعَدُوِّ فَضَرَبَ بِهِ حَتَّى قُتِلَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dan [Qutaibah bin Sa'id] dan ini adalah lafadz Yahya, Qutaibah berkata; telah menceritakan kepada kami, dan Yahya berkata; telah mengabarkan kepada kami [Ja'far bin Sulaiman] dari [Abu Imran Al Jauni] dari [Abu Bakar bin Abdullah bin Qais] dari ayahnya dia berkata, \"Saya pernah mendengar [ayahku] ketika dia sedang berhadapan dengan musuh, dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya pintu-pintu surga terletak di bawah bayangan pedang.\" Tiba-tiba seorang laki-laki berdiri sambil menangis, katanya, \"Hai Abu Musa, apakah anda pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda seperti itu?\" dia menjawab, \"Ya.\" Kakeknya Qais berkata, \"Kemudian dia kembali menemui kawan-kawannya seraya berkata, \"Saya menyampaikan salam buat kalian.\" Kemudian dia mengeluarkan pedang dari sarungnya lalu membuang sarung pedangnya, dengan pedang terhunus, dia lalu berjalan menemui musuh dan berperang dengan pedangnya hingga terbunuh.\""
            },
            {
                "number": 3282,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَجَاءَ نَاسٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا أَنْ ابْعَثْ مَعَنَا رِجَالًا يُعَلِّمُونَا الْقُرْآنَ وَالسُّنَّةَ فَبَعَثَ إِلَيْهِمْ سَبْعِينَ رَجُلًا مِنْ الْأَنْصَارِ يُقَالُ لَهُمْ الْقُرَّاءُ فِيهِمْ خَالِي حَرَامٌ يَقْرَءُونَ الْقُرْآنَ وَيَتَدَارَسُونَ بِاللَّيْلِ يَتَعَلَّمُونَ وَكَانُوا بِالنَّهَارِ يَجِيئُونَ بِالْمَاءِ فَيَضَعُونَهُ فِي الْمَسْجِدِ وَيَحْتَطِبُونَ فَيَبِيعُونَهُ وَيَشْتَرُونَ بِهِ الطَّعَامَ لِأَهْلِ الصُّفَّةِ وَلِلْفُقَرَاءِ فَبَعَثَهُمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْهِمْ فَعَرَضُوا لَهُمْ فَقَتَلُوهُمْ قَبْلَ أَنْ يَبْلُغُوا الْمَكَانَ فَقَالُوا اللَّهُمَّ بَلِّغْ عَنَّا نَبِيَّنَا أَنَّا قَدْ لَقِينَاكَ فَرَضِينَا عَنْكَ وَرَضِيتَ عَنَّا قَالَ وَأَتَى رَجُلٌ حَرَامًا خَالَ أَنَسٍ مِنْ خَلْفِهِ فَطَعَنَهُ بِرُمْحٍ حَتَّى أَنْفَذَهُ فَقَالَ حَرَامٌ فُزْتُ وَرَبِّ الْكَعْبَةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَصْحَابِهِ إِنَّ إِخْوَانَكُمْ قَدْ قُتِلُوا وَإِنَّهُمْ قَالُوا اللَّهُمَّ بَلِّغْ عَنَّا نَبِيَّنَا أَنَّا قَدْ لَقِينَاكَ فَرَضِينَا عَنْكَ وَرَضِيتَ عَنَّا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Hatim] telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad] telah mengabarkan kepada kami [Tsabit] dari [Anas bin Malik] dia berkata, \"Serombongan orang datang kepada Nabi shallallahu 'alaihi wasallam, lalu mereka berkata, \"Kirimkanlah bersama kami beberapa orang untuk mengajarkan Al Qur'an dan As Sunnah kepada kami.\" Maka beliau mengirim tujuh puluh orang laki-laki dari golongan Anshar, mereka di namakan Al Qurra (ahli dalam membaca Al-Qur'an). Mereka adalah orang-orang yang menjauhi perkara haram, selalu membaca dan mempelajari Al-Qur'an di malam hari, sedangkan di siang hari mereka mengangkut air ke masjid sehingga bisa digunakan untuk bersuci. Selain itu mereka juga mencari kayu bakar, setelah dijual, mereka gunakan uangnya untuk membeli makanan untuk ahli suffah dan orang-orang fakir. Nabi shallallahu 'alaihi wasallam lalu mengutus mereka menyertai rombongan tersebut. Di tengah perjalanan mereka diserang oleh rombongan tersebut, dan akhirnya mereka dibunuh sebelum sampai ke tempat tujuan. Namun mereka sempat berdo'a: \"Ya Allah, sampaikanlah kabar kami kepada Nabi kami, bahwa kami telah bertemu dengan-Mu. Kami ridla dengan-Mu dan Engkau ridla dengan kami.\" Anas melanjutkan, \"Ketika itu ada seseorang yang membuntuti Haram -paman Anas- dari belakang, rupanya Haram dapat menikamnya dengan tombak hingga ia berhasil membunuhnya. Setelah itu Haram berkata, \"Saya telah menang demi Rabb pemilik Ka'bah.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepada para sahabatnya: \"Sesungguhnya saudara-saudara kalian telah terbunuh, dan (sebelum terbunuh) mereka sempat berkata, \"Ya Allah, sampaikanlah kabar kami kepada Nabi kami, bahwa kami telah bertemu dengan-Mu. Kami ridla dengan-Mu dan Engkau ridla dengan kami'.\""
            },
            {
                "number": 3283,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ عَنْ ثَابِتٍ قَالَ قَالَ أَنَسٌعَمِّيَ الَّذِي سُمِّيتُ بِهِ لَمْ يَشْهَدْ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَدْرًا قَالَ فَشَقَّ عَلَيْهِ قَالَ أَوَّلُ مَشْهَدٍ شَهِدَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غُيِّبْتُ عَنْهُ وَإِنْ أَرَانِيَ اللَّهُ مَشْهَدًا فِيمَا بَعْدُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيَرَانِي اللَّهُ مَا أَصْنَعُ قَالَ فَهَابَ أَنْ يَقُولَ غَيْرَهَا قَالَ فَشَهِدَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أُحُدٍ قَالَ فَاسْتَقْبَلَ سَعْدُ بْنُ مُعَاذٍ فَقَالَ لَهُ أَنَسٌ يَا أَبَا عَمْرٍو أَيْنَ فَقَالَ وَاهًا لِرِيحِ الْجَنَّةِ أَجِدُهُ دُونَ أُحُدٍ قَالَ فَقَاتَلَهُمْ حَتَّى قُتِلَ قَالَ فَوُجِدَ فِي جَسَدِهِ بِضْعٌ وَثَمَانُونَ مِنْ بَيْنِ ضَرْبَةٍ وَطَعْنَةٍ وَرَمْيَةٍ قَالَ فَقَالَتْ أُخْتُهُ عَمَّتِيَ الرُّبَيِّعُ بِنْتُ النَّضْرِ فَمَا عَرَفْتُ أَخِي إِلَّا بِبَنَانِهِ وَنَزَلَتْ هَذِهِ الْآيَةُ{ رِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ فَمِنْهُمْ مَنْ قَضَى نَحْبَهُ وَمِنْهُمْ مَنْ يَنْتَظِرُ وَمَا بَدَّلُوا تَبْدِيلًا }قَالَ فَكَانُوا يُرَوْنَ أَنَّهَا نَزَلَتْ فِيهِ وَفِي أَصْحَابِهِ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Sulaiman bin Al Mughirah] dari [Tsabit] dia berkata; [Anas] berkata, \"Bahwa pamanku yang bernama seperti namaku tidak ikut perang bersama Rasulullah shallallahu 'alaihi wasallam ketika perang Badr.\" Anas berkata, \"Dengan perasaan menyesal dia berkata, \"Saya tidak hadir disaat pertempuran pertama kali yang diikuti Rasulullah shallallahu 'alaihi wasallam, jika Allah masih memberikan kesempatan kepadaku untuk berjuang bersama Rasulullah shallallahu 'alaihi wasallam setelah itu, sungguh Allah akan melihat apa yang akan saya perbuat.\" -sepertinya dia akan mengucapkan sesuatu selainnya- Anas berkata, \"Kemudian dia ikut serta bersama Rasulullah shallallahu 'alaihi wasallam pada perang uhud.\" Anas melanjutkan, \"Ketika Sa'ad bin Mu'adz menghampirinya, Anas bertanya kepadanya, 'Wahai Abu Amru, mau kemana anda? ' dia menjawab, 'Harumnya surga sudah aku cium dibalik gunung uhud.\" Anas bin Malik melanjutkan, \"Kemudian dia (pamanku) memerangi mereka (musuh) hingga terbunuh.\" Anas bin Malik berkata, \"Pada sekujur tubuhnya didapati delapan puluh lebih luka bekas sabetan pedang, tikaman tombak dan hujaman anak panah.\" Anas berkata, \"Maka saudara perempuannya -yaitu bibiku yang bernama Rubayi' binti An Nadlr- berkata, 'Saya tidak mengenali saudara laki-laki saya kecuali lewat jari jemarinya.' Kemudian turunlah ayat: '(Di antara orang-orang mukmin itu ada orang-orang yang menepati apa yang telah mereka janjikan kepada Allah; Maka di antara mereka ada yang gugur. dan di antara mereka ada (pula) yang menunggu- nunggu dan mereka tidak merubah (janjinya) '. (Qs. Al Ahzaab: 23). Anas berkata, \"Menurut mereka bahwa ayat tersebut turun berkenaan dengan dia dan para sahabat beliau yang lain.\""
            },
            {
                "number": 3284,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ قَالَ سَمِعْتُ أَبَا وَائِلٍ قَالَ حَدَّثَنَا أَبُو مُوسَى الْأَشْعَرِيُّأَنَّ رَجُلًا أَعْرَابِيًّا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ الرَّجُلُ يُقَاتِلُ لِلْمَغْنَمِ وَالرَّجُلُ يُقَاتِلُ لِيُذْكَرَ وَالرَّجُلُ يُقَاتِلُ لِيُرَى مَكَانُهُ فَمَنْ فِي سَبِيلِ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ أَعْلَى فَهُوَ فِي سَبِيلِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basysyar] dan ini adalah lafadz Ibnu Mutsanna, keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari ['Amru bin Murrah] dia berkata; saya pernah mendengar [Abu Wail] berkata; telah menceritakan kepada kami [Abu Musa Al Asy'ari], bahwa seorang laki-laki pedalaman datang kepada Nabi shallallahu 'alaihi wasallam seraya berkata, \"Wahai Rasulullah, ada seorang laki-laki yang berperang demi mendapatkan ghanimah, ada seorang laki-laki yang berperang supaya dirinya dikenal sebagai pahlawan, ada pula seorang laki-laki yang berperang agar dirinya dihormati, maka siapakah yang disebut berjuang di jalan Allah?\" maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berjuang untuk menegakkan kalimat Allah setinggi-tingginya, maka itulah yang disebut berjuang di jalan Allah.\""
            },
            {
                "number": 3285,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَابْنُ نُمَيْرٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ الْعَلَاءِ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرُونَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ أَبِي مُوسَى قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرَّجُلِ يُقَاتِلُ شَجَاعَةً وَيُقَاتِلُ حَمِيَّةً وَيُقَاتِلُ رِيَاءً أَيُّ ذَلِكَ فِي سَبِيلِ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ هِيَ الْعُلْيَا فَهُوَ فِي سَبِيلِ اللَّهِو حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ أَبِي مُوسَى قَالَ أَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْنَا يَا رَسُولَ اللَّهِ الرَّجُلُ يُقَاتِلُ مِنَّا شَجَاعَةً فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ibnu Numair] dan [Ishaq bin Ibrahim] dan [Muhammad bin Al 'Ala], Ishaq berkata; telah mengabarkan kepada kami, dan yang lainnya berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Syaqiq] dari [Abu Musa] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah ditanya mengenai seorang laki-laki yang berperang supaya dikatakan pemberani, berjuang karena membela kesukuan dan berjuang karena ingin dipuji, maka manakah yang disebut berjuang di jalan Allah?\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Barangsiapa berjuang untuk menegakkan kalimat Allah setinggi-tingginya, maka itulah yang disebut berjuang di jalan Allah.\" Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Isa bin Yunus] telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] dari [Abu Musa] dia berkata, \"Kami pernah mendatangi Rasulullah shallallahu 'alaihi wasallam, lalu kami bertanya, \"Wahai Rasulullah, di antara kami ada seseorang yang berjuang karena ingin dikatakan pemberani …\" kemudian dia menyebutkan hadits seperti di atas.\""
            },
            {
                "number": 3286,
                "arab": "و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّأَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْقِتَالِ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ فَقَالَ الرَّجُلُ يُقَاتِلُ غَضَبًا وَيُقَاتِلُ حَمِيَّةً قَالَ فَرَفَعَ رَأْسَهُ إِلَيْهِ وَمَا رَفَعَ رَأْسَهُ إِلَيْهِ إِلَّا أَنَّهُ كَانَ قَائِمًا فَقَالَ مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ هِيَ الْعُلْيَا فَهُوَ فِي سَبِيلِ اللَّهِ",
                "id": "Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Jarir] dari [Manshur] dari [Abu wail] dari [Abu Musa Al Asy'ari], bahwa seorang laki-laki bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang jihad di jalan Allah, dia berkata, \"Ada seseorang yang berjuang karena marah (balas dendam) dan berjuang karena membela kesukuan.\" Abu Musa berkata, \"Lalu dia mengangkat kepalanya menatap beliau, dan tidaklah dia mengangkat kepala melainkan saat itu karena beliau berdiri.\" Kemudian beliau menjawab: \"Barangsiapa berjuang untuk menegakkan kalimat Allah, maka itulah fi sabilillah.\""
            },
            {
                "number": 3287,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا ابْنُ جُرَيْجٍ حَدَّثَنِي يُونُسُ بْنُ يُوسُفَ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ قَالَتَفَرَّقَ النَّاسُ عَنْ أَبِي هُرَيْرَةَ فَقَالَ لَهُ نَاتِلُ أَهْلِ الشَّامِ أَيُّهَا الشَّيْخُ حَدِّثْنَا حَدِيثًا سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ أَوَّلَ النَّاسِ يُقْضَى يَوْمَ الْقِيَامَةِ عَلَيْهِ رَجُلٌ اسْتُشْهِدَ فَأُتِيَ بِهِ فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا قَالَ فَمَا عَمِلْتَ فِيهَا قَالَ قَاتَلْتُ فِيكَ حَتَّى اسْتُشْهِدْتُ قَالَ كَذَبْتَ وَلَكِنَّكَ قَاتَلْتَ لِأَنْ يُقَالَ جَرِيءٌ فَقَدْ قِيلَ ثُمَّ أُمِرَ بِهِ فَسُحِبَ عَلَى وَجْهِهِ حَتَّى أُلْقِيَ فِي النَّارِ وَرَجُلٌ تَعَلَّمَ الْعِلْمَ وَعَلَّمَهُ وَقَرَأَ الْقُرْآنَ فَأُتِيَ بِهِ فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا قَالَ فَمَا عَمِلْتَ فِيهَا قَالَ تَعَلَّمْتُ الْعِلْمَ وَعَلَّمْتُهُ وَقَرَأْتُ فِيكَ الْقُرْآنَ قَالَ كَذَبْتَ وَلَكِنَّكَ تَعَلَّمْتَ الْعِلْمَ لِيُقَالَ عَالِمٌ وَقَرَأْتَ الْقُرْآنَ لِيُقَالَ هُوَ قَارِئٌ فَقَدْ قِيلَ ثُمَّ أُمِرَ بِهِ فَسُحِبَ عَلَى وَجْهِهِ حَتَّى أُلْقِيَ فِي النَّارِ وَرَجُلٌ وَسَّعَ اللَّهُ عَلَيْهِ وَأَعْطَاهُ مِنْ أَصْنَافِ الْمَالِ كُلِّهِ فَأُتِيَ بِهِ فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا قَالَ فَمَا عَمِلْتَ فِيهَا قَالَ مَا تَرَكْتُ مِنْ سَبِيلٍ تُحِبُّ أَنْ يُنْفَقَ فِيهَا إِلَّا أَنْفَقْتُ فِيهَا لَكَ قَالَ كَذَبْتَ وَلَكِنَّكَ فَعَلْتَ لِيُقَالَ هُوَ جَوَادٌ فَقَدْ قِيلَ ثُمَّ أُمِرَ بِهِ فَسُحِبَ عَلَى وَجْهِهِ ثُمَّ أُلْقِيَ فِي النَّارِو حَدَّثَنَاه عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا الْحَجَّاجُ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ ابْنِ جُرَيْجٍ حَدَّثَنِي يُونُسُ بْنُ يُوسُفَ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ قَالَ تَفَرَّجَ النَّاسُ عَنْ أَبِي هُرَيْرَةَ فَقَالَ لَهُ نَاتِلٌ الشَّامِىُّ وَاقْتَصَّ الْحَدِيثَ بِمِثْلِ حَدِيثِ خَالِدِ بْنِ الْحَارِثِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Habib Al Haritsi] telah menceritakan kepada kami [Khalid bin Al Harits] telah menceritakan kepada kami [Ibnu Juraij] telah menceritakan kepadaku [Yunus bin Yusuf] dari [Sulaiman bin Yasar] dia berkata, \"Orang-orang berpencar dari hadapan [Abu Hurairah], setelah itu Natil, seorang penduduk Syam, bertanya, \"Wahai Syaikh, ceritakanlah kepada kami hadits yang pernah kamu dengar dari Rasulullah shallallahu 'alaihi wasallam!\" dia menjawab, \"Ya, saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya manusia yang pertama kali dihisap pada hari Kiamat ialah seseorang yang mati syahid, lalu diperlihatkan kepadanya kenikmatan sehingga ia mengetahuinya dengan jelas, lantas Dia bertanya: 'Apa yang telah kamu lakukan di dunia wahai hamba-Ku? Dia menjawab: 'Saya berjuang dan berperang demi Engkau ya Allah sehingga saya mati syahid.' Allah berfirman: 'Dusta kamu, sebenarnya kamu berperang bukan karena untuk-Ku, melainkan agar kamu disebut sebagai orang yang berani. Kini kamu telah menyandang gelar tersebut.' Kemudian diperintahkan kepadanya supaya dicampakkan dan dilemparkan ke dalam neraka. Dan didatangkan pula seseorang yang belajar Al-Qur'an dan mengajarkannya, lalu diperlihatkan kepadanya kenikmatan sehingga ia mengetahuinya dengan jelas, Allah bertanya: 'Apa yang telah kamu perbuat? ' Dia menjawab, 'Saya telah belajar ilmu dan mengajarkannya, saya juga membaca Al Qur'an demi Engkau.' Allah berfirman: 'Kamu dusta, akan tetapi kamu belajar ilmu dan mengajarkannya serta membaca Al Qur'an agar dikatakan seorang yang mahir dalam membaca, dan kini kamu telah dikatakan seperti itu, kemudian diperintahkan kepadanya supaya dia dicampakkan dan dilemparkan ke dalam neraka. Dan seorang laki-laki yang di beri keluasan rizki oleh Allah, kemudian dia menginfakkan hartanya semua, lalu diperlihatkan kepadanya kenikmatan sehingga ia mengetahuinya dengan jelas.' Allah bertanya: 'Apa yang telah kamu perbuat dengannya? ' dia menjawab, 'Saya tidak meninggalkannya sedikit pun melainkan saya infakkan harta benda tersebut di jalan yang Engkau ridlai.\" Allah berfirman: 'Dusta kamu, akan tetapi kamu melakukan hal itu supaya kamu dikatakan seorang yang dermawan, dan kini kamu telah dikatakan seperti itu.' Kemudian diperintahkan kepadanya supaya dia dicampakkan dan dilemparkan ke dalam neraka.\" Dan telah menceritakan kepadaku [Ali bin Khasyram] telah mengabarkan kepada kami [Al Hajjaj] -yaitu Ibnu Muhammad- dari [Ibnu Juraij] telah menceritakan kepadaku [Yunus bin Yusuf] dari [Sulaiman bin Yasar] dia berkata, \"Orang-orang berpencar dari hadapan [Abu Hurairah], lantas Natil As Syami …kemudian dia menyebutkan hadits tersebut seperti haditsnya Khalid bin Al Harits.\""
            },
            {
                "number": 3288,
                "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ أَبُو عَبْدِ الرَّحْمَنِ حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ عَنْ أَبِي هَانِئٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ غَازِيَةٍ تَغْزُو فِي سَبِيلِ اللَّهِ فَيُصِيبُونَ الْغَنِيمَةَ إِلَّا تَعَجَّلُوا ثُلُثَيْ أَجْرِهِمْ مِنْ الْآخِرَةِ وَيَبْقَى لَهُمْ الثُّلُثُ وَإِنْ لَمْ يُصِيبُوا غَنِيمَةً تَمَّ لَهُمْ أَجْرُهُمْ",
                "id": "Telah menceritakan kepada kami [Abd bin Humaid] telah menceritakan kepada kami [Abdullah bin Yazid Abu Abdurrahman] telah menceritakan kepada kami [Haiwah bin Syuraih] dari [Abu Hani`] dari [Abu Abdurrahman Al Hubuli] dari [Abdullah bin 'Amru] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang berperang di jalan Allah kemudian ia mengambil bagiannya dari harta ghanimah, melainkan sepertiga pahalanya telah terkurangi di akhirat kelak, namun jika dia tidak mengambil harta ghanimah tersebut, maka pahalanya menjadi sempurna.\""
            },
            {
                "number": 3289,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا نَافِعُ بْنُ يَزِيدَ حَدَّثَنِي أَبُو هَانِئٍ حَدَّثَنِي أَبُو عَبْدِ الرَّحْمَنِ الْحُبُلِيُّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ غَازِيَةٍ أَوْ سَرِيَّةٍ تَغْزُو فَتَغْنَمُ وَتَسْلَمُ إِلَّا كَانُوا قَدْ تَعَجَّلُوا ثُلُثَيْ أُجُورِهِمْ وَمَا مِنْ غَازِيَةٍ أَوْ سَرِيَّةٍ تُخْفِقُ وَتُصَابُ إِلَّا تَمَّ أُجُورُهُمْ",
                "id": "Telah menceritakan kepadaku [Muhammad bin Sahl At Tamimi] telah menceritakan kepada kami [Ibnu Abu Maryam] telah mengabarkan kepada kami [Nafi' bin Yazid] telah menceritakan kepadaku [Abu Hani`] telah menceritakan kepadaku [Abu Abdurrahman Al Hubuli] dari [Abdullah bin 'Amru] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang yang berperang lalu dia memperoleh ghanimah dan mengambil (haknya), melainkan dia telah mengambil sepertiga dari pahalanya, dan tidaklah seseorang yang berperang dan mendapatkan ghanimah, namun ia tidak mengambil (haknya), melainkan pahalanya masih tetap sempurna.\""
            },
            {
                "number": 3290,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ حَدَّثَنَا مَالِكٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا الْأَعْمَالُ بِالنِّيَّةِ وَإِنَّمَا لِامْرِئٍ مَا نَوَى فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَتَزَوَّجُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ حَدَّثَنَا حَمَّادُ ابْنُ زَيْدٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَبُو خَالِدٍ الْأَحْمَرُ سُلَيْمَانُ بْنُ حَيَّانَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا حَفْصٌ يَعْنِي ابْنَ غِيَاثٍ وَيَزِيدُ بْنُ هَارُونَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ الْهَمْدَانِيُّ حَدَّثَنَا ابْنُ الْمُبَارَكِ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ كُلُّهُمْ عَنْ يَحْيَى بْنِ سَعِيدٍ بِإِسْنَادِ مَالِكٍ وَمَعْنَى حَدِيثِهِ وَفِي حَدِيثِ سُفْيَانَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ عَلَى الْمِنْبَرِ يُخْبِرُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab] telah menceritakan kepada kami [Malik] dari [Yahya bin Sa'id] dari [Muhammad bin Ibrahim] dari ['Alqamah bin Waqash] dari [Umar bin Khattab] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya amalan itu tergantung dengan niatnya, dan sesungguhnya ia akan mendapatkan sesuatu yang diniatkannya, barangsiapa hijrahnya untuk Allah dan Rasul-Nya, maka hijrahnya untuk Allah dan Rasul-Nya, dan barangsiapa hijrahnya untuk memperoleh dunia atau seorang wanita yang akan dinikahinya, maka hijrahnya sesuai dengan apa yang diniatkannya.\" Dan telah menceritakan kepada kami [Muhammad bin Rumh bin Muhajir] telah mengabarkan kepada kami [Laits]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Ar Rabi' Al Ataki] telah menceritakan kepada kami [Hammad bin Zaid]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul Wahhab] -yaitu Ats Tsaqafi-. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Abu Khalid Al Ahmar Sulaiman bin Hayyan]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Hafsh] -yaitu Ibnu Ghiyats- dan [Zaid bin Harun]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Al 'Ala Al Hamdani] telah menceritakan kepada kami [Ibnu Mubarak]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] semuanya dari [Yahya bin Sa'id] dengan sanad makna seperti riwayat Malik. Dan dalam haditsnya Sufyan disebutkan, 'Saya mendengar Umar bin Khattab di atas mimbar mengabarkan dari Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3291,
                "arab": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا ثَابِتٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ طَلَبَ الشَّهَادَةَ صَادِقًا أُعْطِيَهَا وَلَوْ لَمْ تُصِبْهُ",
                "id": "Telah menceritakan kepada kami [Syaiban bin Farruh] telah menceritakan kepada kami [Hammad bin Salamah] telah menceritakan kepada kami [Tsabit] dari [Anas bin Malik] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memohon syahadah (mati dalam keadaan syahid) dengan sungguh-sungguh, maka sungguh ia akan diberi pahala seperti pahala mati syahid meskipun ia tidak mati syahid.\""
            },
            {
                "number": 3292,
                "arab": "حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ بْنُ يَحْيَى وَاللَّفْظُ لِحَرْمَلَةَ قَالَ أَبُو الطَّاهِرِ أَخْبَرَنَا و قَالَ حَرْمَلَةُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنِي أَبُو شُرَيْحٍ أَنَّ سَهْلَ بْنَ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ حَدَّثَهُ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ سَأَلَ اللَّهَ الشَّهَادَةَ بِصِدْقٍ بَلَّغَهُ اللَّهُ مَنَازِلَ الشُّهَدَاءِ وَإِنْ مَاتَ عَلَى فِرَاشِهِوَلَمْ يَذْكُرْ أَبُو الطَّاهِرِ فِي حَدِيثِهِ بِصِدْقٍ",
                "id": "Telah menceritakan kepadaku [Abu At Thahir] dan [Harmalah bin Yahya] dan ini adalah lafadz Harmalah, Abu At Thahir berkata; telah mengabarkan kepada kami, sedangkan Harmalah mengatakan; telah menceritakan kepada kami [Abdullah bin Wahb] telah menceritakan kepadaku [Abu Syuraikh] bahwa [Sahl bin Abu Umamah bin Sahl bin Hunaif] telah menceritakan kepadanya dari [ayahnya] dari [kakeknya], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengharapkan mati syahid dengan sungguh-sungguh, maka Allah akan mengangkatnya sampai ke derajat para syuhada' meski ia meninggal dunia di atas tempat tidur.\" Dan dalam hadits yang diriwayatkan Abu At Thahir tidak menyebutkan, 'Dengan sungguh-sungguh.'"
            },
            {
                "number": 3293,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ سَهْمٍ الْأَنْطَاكِيُّ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ وُهَيْبٍ الْمَكِّيِّ عَنْ عُمَرَ بْنِ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ مَاتَ وَلَمْ يَغْزُ وَلَمْ يُحَدِّثْ بِهِ نَفْسَهُ مَاتَ عَلَى شُعْبَةٍ مِنْ نِفَاقٍقَالَ ابْنُ سَهْمٍ قَالَ عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ فَنُرَى أَنَّ ذَلِكَ كَانَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdurrahman bin Sahm Al Anthaki] telah mengabarkan kepada kami [Abdullah bin Mubarak] dari [Wuhaib Al Makki] dari [Umar bin Muhammad bin Al Munkadir] dari [Sumayyi] dari [Abu Shalih] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meninggal sedang ia belum pernah ikut berperang atau belum pernah meniatkan dirinya untuk berperang, maka ia mati di atas cabang kemunafikan.\" Ibnu Sahm berkata; Abdullah bin Mubarak berkata, \"Lantas kami diberi pendapat bahwa hal itu berlaku di masa Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3294,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَكُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزَاةٍ فَقَالَ إِنَّ بِالْمَدِينَةِ لَرِجَالًا مَا سِرْتُمْ مَسِيرًا وَلَا قَطَعْتُمْ وَادِيًا إِلَّا كَانُوا مَعَكُمْ حَبَسَهُمْ الْمَرَضُو حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو سَعِيدٍ الْأَشَجُّ قَالَا حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ كُلُّهُمْ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّ فِي حَدِيثِ وَكِيعٍ إِلَّا شَرِكُوكُمْ فِي الْأَجْرِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] dia berkata.\"Kami pernah ikut berperang bersama Nabi shallallahu 'alaihi wasallam dalam suatu peperangan, ketika itu beliau bersabda: \"Ada beberapa orang laki-laki di Madinah yang mereka tidak ikut serta dalam peperangan, biasanya jika kalian pergi berperang sedangkan kalian melewati suatu lembah, mereka tetap turut bersama-sama kamu, namun mereka sekarang terhalang karena sakit.\" Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Mu'awiyah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Abu Sa'id Al Asyaj] keduanya berkata; telah menceritakan kepada kami [Waki']. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Isa bin Yunus] semuanya dari [Al A'masy] dengan sanad ini, namun dalam haditsnya Waki' disebutkan; \"Melainkan mereka juga mendapatkan pahala seperti kalian.\""
            },
            {
                "number": 3295,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْخُلُ عَلَى أُمِّ حَرَامٍ بِنْتِ مِلْحَانَ فَتُطْعِمُهُ وَكَانَتْ أُمُّ حَرَامٍ تَحْتَ عُبَادَةَ بْنِ الصَّامِتِ فَدَخَلَ عَلَيْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا فَأَطْعَمَتْهُ ثُمَّ جَلَسَتْ تَفْلِي رَأْسَهُ فَنَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ اسْتَيْقَظَ وَهُوَ يَضْحَكُ قَالَتْ فَقُلْتُ مَا يُضْحِكُكَ يَا رَسُولَ اللَّهِ قَالَ نَاسٌ مِنْ أُمَّتِي عُرِضُوا عَلَيَّ غُزَاةً فِي سَبِيلِ اللَّهِ يَرْكَبُونَ ثَبَجَ هَذَا الْبَحْرِ مُلُوكًا عَلَى الْأَسِرَّةِ أَوْ مِثْلَ الْمُلُوكِ عَلَى الْأَسِرَّةِ يَشُكُّ أَيَّهُمَا قَالَ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ فَدَعَا لَهَا ثُمَّ وَضَعَ رَأْسَهُ فَنَامَ ثُمَّ اسْتَيْقَظَ وَهُوَ يَضْحَكُ قَالَتْ فَقُلْتُ مَا يُضْحِكُكَ يَا رَسُولَ اللَّهِ قَالَ نَاسٌ مِنْ أُمَّتِي عُرِضُوا عَلَيَّ غُزَاةً فِي سَبِيلِ اللَّهِ كَمَا قَالَ فِي الْأُولَى قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ قَالَ أَنْتِ مِنْ الْأَوَّلِينَ فَرَكِبَتْ أُمُّ حَرَامٍ بِنْتُ مِلْحَانَ الْبَحْرَ فِي زَمَنِ مُعَاوِيَةَ فَصُرِعَتْ عَنْ دَابَّتِهَا حِينَ خَرَجَتْ مِنْ الْبَحْرِ فَهَلَكَتْ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; saya bacakan di hadapan [Malik]; dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik], bahwa Rasulullah shallallahu 'alaihi wasallam pernah menemui Ummu Haram binti Milhan -isteri Ubadah bin Shamit- kemudian ia menghidangkan makanan untuk beliau. Setelah itu Ummu Haram menyisir rambut Ummu Haram hingga Rasulullah shallallahu 'alaihi wasallam tertidur, tiba-tiba beliau terbangun sambil tertawa.\" Ummu Haram berkata, \"Apa yang menyebabkanmu tertawa wahai Rasulullah?\" beliau bersabda: 'Sekelompok umatku diperlihatkan Allah Ta'ala kepadaku, mereka berperang di jalan Allah mengarungi lautan dengan kapal, yaitu para raja di atas singgasana atau bagaikan para raja di atas singgasana.\" -perawi ragu antara keduanya- Ummu Haram berkata: \"Wahai Rasulullah, do'akanlah semoga saya termasuk di antara mereka.\" Kemudian beliau mendo'akannya. Setelah itu beliau meletakkan kepalanya hingga tertidur. Tiba-tiba beliau terbangun sambil tertawa.\" Ummu Haram berkata, \"Lalu saya bertanya: \"Wahai Rasulullah, apa yang membuatmu tertawa?\" beliau menjawab: \"Sekelompok umatku diperlihatkan Allah Ta'ala kepadaku, mereka berperang di jalan Allah…\" -sebagaimana sabda beliau yang pertama- Ummu Haram berkata; lalu saya berkata, \"Wahai Rasulullah, do'akanlah saya semoga termasuk di antara mereka!\" Beliau bersabda: \"Kamu termasuk dari rombongan pertama.\" Pada masa (pemerintahan) Mu'awiyah, Ummu Haram turut dalam pasukan Islam berlayar ke lautan (untuk berperang di jalan Allah), ketika mendarat, dia terjatuh dari kendaraannya hingga meninggal dunia.\""
            },
            {
                "number": 3296,
                "arab": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أُمِّ حَرَامٍ وَهِيَ خَالَةُ أَنَسٍ قَالَتْأَتَانَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا فَقَالَ عِنْدَنَا فَاسْتَيْقَظَ وَهُوَ يَضْحَكُ فَقُلْتُ مَا يُضْحِكُكَ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي قَالَ أُرِيتُ قَوْمًا مِنْ أُمَّتِي يَرْكَبُونَ ظَهْرَ الْبَحْرِ كَالْمُلُوكِ عَلَى الْأَسِرَّةِ فَقُلْتُ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ قَالَ فَإِنَّكِ مِنْهُمْ قَالَتْ ثُمَّ نَامَ فَاسْتَيْقَظَ أَيْضًا وَهُوَ يَضْحَكُ فَسَأَلْتُهُ فَقَالَ مِثْلَ مَقَالَتِهِ فَقُلْتُ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ قَالَ أَنْتِ مِنْ الْأَوَّلِينَ قَالَ فَتَزَوَّجَهَا عُبَادَةُ بْنُ الصَّامِتِ بَعْدُ فَغَزَا فِي الْبَحْرِ فَحَمَلَهَا مَعَهُ فَلَمَّا أَنْ جَاءَتْ قُرِّبَتْ لَهَا بَغْلَةٌ فَرَكِبَتْهَا فَصَرَعَتْهَا فَانْدَقَّتْ عُنُقُهَاو حَدَّثَنَاه مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ وَيَحْيَى بْنُ يَحْيَى قَالَا أَخْبَرَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ ابْنِ حَبَّانَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ خَالَتِهِ أُمِّ حَرَامٍ بِنْتِ مِلْحَانَ أَنَّهَا قَالَتْ نَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا قَرِيبًا مِنِّي ثُمَّ اسْتَيْقَظَ يَتَبَسَّمُ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا أَضْحَكَكَ قَالَ نَاسٌ مِنْ أُمَّتِي عُرِضُوا عَلَيَّ يَرْكَبُونَ ظَهْرَ هَذَا الْبَحْرِ الْأَخْضَرِ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ حَمَّادِ بْنِ زَيْدٍ و حَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ جَعْفَرٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُا أَتَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْنَةَ مِلْحَانَ خَالَةَ أَنَسٍ فَوَضَعَ رَأْسَهُ عِنْدَهَا وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ إِسْحَقَ بْنِ أَبِي طَلْحَةَ وَمُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ",
                "id": "Telah menceritakan kepada kami [Khalaf bin Hisyam] telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari [Anas bin Malik] dari [Ummu Haram] -dia adalah bibinya Anas- dia berkata, \"Suatu hari Nabi shallallahu 'alaihi wasallam menemui kami, ketika beliau bersada disamping kami tiba-tiba beliau terbangun sambil tertawa, maka saya bertanya, \"Demi ayah dan Ibuku, sebenarnya apa yang membuat anda tertawa wahai Rasulullah?\" beliau menjawab: \"Diperlihatkan kepadaku, sekelompok dari ummatku yang berperang mengarungi lautan sebagaimana para raja di atas singgasana.\" Lantas saya berkata, \"Do'akanlah semoga saya termasuk di antara kelompok tersebut!\" Beliau bersabda: \"Kamu termasuk di antara mereka.\" Ummu Haram melanjutkan, \"Kemudian beliau tidur lagi, tidak lama setelah itu tiba-tiba beliau terbangun sambil tertawa, maka saya bertanya, dan beliau pun menjawab sebagaimana jawaban beliau yang pertama. Maka saya berkata, \"Do'akanlah semoga saya termasuk di antara kelompok tersebut!\" Beliau bersabda: \"Kamu termasuk dari kelompok yang pertama.\" Anas berkata, \"Setelah itu dia menikah dengan Ubadah bin Shamit, lalu dia bersama suaminya ikut serta dalam peperangan di lautan, ketika hampir mendarat dia menaiki kendaraannya dan terpelanting hingga lehernya terbentur hingga mengakibatkan kematiannya.\" Dan telah menceritakan kepada kami [Muhammad bin Rumh Ibnu Muhajir] dan [Yahya bin Yahya] keduanya berkata; telah mengabarkan kepada kami [Laits] dari [Yahya bin Sa'id] dari [Ibnu Habban] dari [Anas bin Malik] dari bibinya, [Ummu Haram binti Milhan], bahwa dia berkata, \"Pada suatu hari Rasulullah shallallahu 'alaihi wasallam tertidur di dekatku, tiba-tiba beliau terbangun sambil tertawa.\" Ummu Haram melanjutkan, \"Lantas saya berkata, \"Apa yang membuatmu tertawa wahai Rasulullah?\" beliau menjawab: \"Diperlihatkan kepadaku sekelompok dari ummatku yang berperang di laut hijau ini…lalu dia menyebutkan seperti hadits riwayat [Hammad bin Zaid] dan telah menceritakan kepadaku [Yahya bin Ayyub] dan [Qutaibah] dan [Ibnu Hujr] mereka berkata; telah menceritakan kepada kami [Isma'il] -yaitu Ibnu Ja'far- dari [Abdullah bin Abdurrahman] bahwa dia pernah mendengar [Anas bin Malik] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah menemui puterinya Milhan -yaitu bibinya Anas- kemudian beliau menaruh kepalanya di sisi binti Milhan …lalu dia melanjutkan hadits tersebut semakna dengan hadits Ishaq bin Abu Thalhah dan Muhammad bin Yahya bin Habban.\""
            },
            {
                "number": 3297,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ بَهْرَامٍ الدَّارِمِيُّ حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا لَيْثٌ يَعْنِي ابْنَ سَعْدٍ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ مَكْحُولٍ عَنْ شُرَحْبِيلَ بْنِ السِّمْطِ عَنْ سَلْمَانَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ رِبَاطُ يَوْمٍ وَلَيْلَةٍ خَيْرٌ مِنْ صِيَامِ شَهْرٍ وَقِيَامِهِ وَإِنْ مَاتَ جَرَى عَلَيْهِ عَمَلُهُ الَّذِي كَانَ يَعْمَلُهُ وَأُجْرِيَ عَلَيْهِ رِزْقُهُ وَأَمِنَ الْفَتَّانَحَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شُرَيْحٍ عَنْ عَبْدِ الْكَرِيمِ بْنِ الْحَارِثِ عَنْ أَبِي عُبَيْدَةَ بْنِ عُقْبَةَ عَنْ شُرَحْبِيلَ بْنِ السِّمْطِ عَنْ سَلْمَانَ الْخَيْرِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ اللَّيْثِ عَنْ أَيُّوبَ بْنِ مُوسَى",
                "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman bin Bahram Ad Darimi] telah menceritakan kepada kami [Abu Al Walid At Thayalisi] telah menceritakan kepada kami [Laits] -yaitu Ibnu Sa'd- dari [Ayyub bin Musa] dari [Makhul] dari [Syurahbil bin As Simth] dari [Salman] dia berkata, \"Saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ribath (berjaga-jaga di perbatasan) sehari semalam lebih baik daripada puasa dan sholat malam sebulan penuh, jika dia meninggal maka amalannya senantiasa mengalir sebagaimana yang pernah dia amalkan, mengalir pula rizkinya dan terbebas dari fitnah.\" Telah menceritakan kepada kami [Abu At Thahir] telah mengabarkan kepada kami [Ibnu Wahb] dari [Abdurrahman bin Syuraih] dari [Abdul Karim bin Al Harits] dari [Abu 'Ubaidah bin 'Uqbah] dari [Syurahbil bin As Simth] dari [Salman Al Khair] dari Rasulullah shallallahu 'alaihi wasallam semakna dengan haditsnya Laits dari Ayyub bin Musa.\""
            },
            {
                "number": 3298,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ وَجَدَ غُصْنَ شَوْكٍ عَلَى الطَّرِيقِ فَأَخَّرَهُ فَشَكَرَ اللَّهُ لَهُ فَغَفَرَ لَهُ وَقَالَ الشُّهَدَاءُ خَمْسَةٌ الْمَطْعُونُ وَالْمَبْطُونُ وَالْغَرِقُ وَصَاحِبُ الْهَدْمِ وَالشَّهِيدُ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; saya bacakan di hadapan [Malik]; dari [Sumaiy] dari [Abu Shalih] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika laki-laki sedang berjalan dan menemukan ranting berduri di tengah jalan, kemudian dia menyingkirkan ranting tersebut hingga Allah pun bersyukur kepadanya lalu mengampuni dosa-dosanya.\" Lalu beliau bersabda: \"Syuhada' itu ada lima macam; meninggal karena penyakit kolera, orang yang meninggal karena sakit perut, orang yang tenggelam, orang yang meninggal karena reruntuhan, dan orang yang syahid karena berjuang di jalan Allah 'azza wajalla.\""
            },
            {
                "number": 3299,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا تَعُدُّونَ الشَّهِيدَ فِيكُمْ قَالُوا يَا رَسُولَ اللَّهِ مَنْ قُتِلَ فِي سَبِيلِ اللَّهِ فَهُوَ شَهِيدٌ قَالَ إِنَّ شُهَدَاءَ أُمَّتِي إِذًا لَقَلِيلٌ قَالُوا فَمَنْ هُمْ يَا رَسُولَ اللَّهِ قَالَ مَنْ قُتِلَ فِي سَبِيلِ اللَّهِ فَهُوَ شَهِيدٌ وَمَنْ مَاتَ فِي سَبِيلِ اللَّهِ فَهُوَ شَهِيدٌ وَمَنْ مَاتَ فِي الطَّاعُونِ فَهُوَ شَهِيدٌ وَمَنْ مَاتَ فِي الْبَطْنِ فَهُوَ شَهِيدٌقَالَ ابْنُ مِقْسَمٍ أَشْهَدُ عَلَى أَبِيكَ فِي هَذَا الْحَدِيثِ أَنَّهُ قَالَ وَالْغَرِيقُ شَهِيدٌ و حَدَّثَنِي عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ الْوَاسِطِيُّ حَدَّثَنَا خَالِدٌ عَنْ سُهَيْلٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّ فِي حَدِيثِهِ قَالَ سُهَيْلٌ قَالَ عُبَيْدُ اللَّهِ بْنُ مِقْسَمٍ أَشْهَدُ عَلَى أَخِيكَ أَنَّهُ زَادَ فِي هَذَا الْحَدِيثِ وَمَنْ غَرِقَ فَهُوَ شَهِيدٌ و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا بَهْزٌ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا سُهَيْلٌ بِهَذَا الْإِسْنَادِ وَفِي حَدِيثِهِ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ مِقْسَمٍ عَنْ أَبِي صَالِحٍ وَزَادَ فِيهِ وَالْغَرِقُ شَهِيدٌ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Jarir] dari [Suhail] dari [ayahnya] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa yang dimaksud orang yang mati syahid di antara kalian?\" para sahabat menjawab, \"Wahai Rasulullah, orang yang meninggal karena berjuang di jalan Allah itulah orang yang mati syahid.\" Beliau bersabda: \"Kalau begitu, sedikit sekali jumlah ummatku yang mati syahid.\" Para sahabat berkata, \"Lantas siapakah mereka ya Rasulullah?\" beliau bersabda: \"Barangsiapa terbunuh di jalan Allah maka dialah syahid, dan siapa yang mati di jalan Allah juga syahid, siapa yang mati karena penyakit kolera juga syahid, siapa yang mati karena sakit perut juga syahid.\" [Ibnu Miqsam] berkata, \"Saya bersaksi atas [bapakmu] mengenai hadits ini, bahwa beliau juga berkata, \"Orang yang meninggal karena tenggelam juga syahid.\" Dan telah menceritakan kepadaku [Abdul Hamid bin Bayan Al Wasithi] telah menceritakan kepada kami [Khalid] dari [Suhail] dengan sanad seperti ini, namun dalam haditsnya disebutkan; [Suhail] berkata; [ubaidhullah bin Miqsam] berkata, \"Saya bersaksi atas saudara laki-lakimu bahwa dalam hadits ini dia menambahkan, \"Barangsiapa meninggal karena tenggelam, maka ia syahid.\" Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Suhail] dengan sanad ini, dan dalam haditsnya dia menyebutkan; telah mengabarkan kepadaku ['ubaidhullah bin Miqsam] dari [Abu Shalih] dan dia juga menambahkan, \"Dan orang yang meninggal karena tenggelam juga syahid.\""
            },
            {
                "number": 3300,
                "arab": "حَدَّثَنَا حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ حَدَّثَنَا عَاصِمٌ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ قَالَتْ قَالَ لِي أَنَسُ بْنُ مَالِكٍبِمَ مَاتَ يَحْيَى بْنُ أَبِي عَمْرَةَ قَالَتْ قُلْتُ بِالطَّاعُونِ قَالَتْ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الطَّاعُونُ شَهَادَةٌ لِكُلِّ مُسْلِمٍو حَدَّثَنَاه الْوَلِيدُ بْنُ شُجَاعٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ عَاصِمٍ فِي هَذَا الْإِسْنَادِ بِمِثْلِهِ",
                "id": "Telah menceritakan kepada kami [Hamid bin Umar Al Bakrawi] telah menceritakan kepada kami [Abdul Wahid] -yaitu Ibnu Ziyad- telah menceritakan kepada kami ['Ashim] dari [Hafshah binti Sirin] dia berkata; [Anas bin Malik] pernah berkata kepadaku, \"Sebab apakah Yahya bin 'Amrah meninggal dunia?\" Hafshah berkata, \"Saya menjawab, \"Karena penyakit kolera.\" Hafshah melanjutkan, \"Lantas Anas berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penyakit kolera dapat menjadikan mati syahid bagi setiap muslim.\" Dan telah menceritakan kepada kami [Al Walid bin Syuja'] telah menceritakan kepada kami [Ali bin Mushir] dari ['Ashim] dengan sanad seperti ini.\""
            },
            {
                "number": 3301,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ أَبِي عَلِيٍّ ثُمَامَةَ بْنِ شُفَيٍّ أَنَّهُ سَمِعَ عُقْبَةَ بْنَ عَامِرٍ يَقُولُاسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ يَقُولُ{ وَأَعِدُّوا لَهُمْ مَا اسْتَطَعْتُمْ مِنْ قُوَّةٍ }أَلَا إِنَّ الْقُوَّةَ الرَّمْيُ أَلَا إِنَّ الْقُوَّةَ الرَّمْيُ أَلَا إِنَّ الْقُوَّةَ الرَّمْيُ",
                "id": "Telah menceritakan kepada kami [Harun bin Ma'ruf] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Amru bin Al Harits] dari [Abu Ali Tsumamah bin Syufayi] bahwa dia mendengar ['Uqbah bin 'Amir] berkata, \"Saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam menyampaikan ketika beliau di atas mimbar: '(Dan siapkanlah untuk menghadapi mereka kekuatan apa saja yang kamu sanggupi) ' (Qs. Al Anfaal: 60), ketahuilah sesungguhnya kekuatan itu adalah melempar, ketahuilah sesungguhnya kekuatan itu adalah melempar, ketahuilah sesungguhnya kekuatan itu adalah melempar.\""
            },
            {
                "number": 3302,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ أَبِي عَلِيٍّ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ سَتُفْتَحُ عَلَيْكُمْ أَرَضُونَ وَيَكْفِيكُمُ اللَّهُ فَلَا يَعْجِزُ أَحَدُكُمْ أَنْ يَلْهُوَ بِأَسْهُمِهِو حَدَّثَنَاه دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا الْوَلِيدُ عَنْ بَكْرِ بْنِ مُضَرَ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ أَبِي عَلِيٍّ الْهَمْدَانِيِّ قَالَ سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "id": "Telah menceritakan kepada kami [Harun bin Ma'ruf] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku ['Amru bin Al Harits] dari [Abu 'Ali] dari ['Uqbah bin 'Amir] dia berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalian akan menaklukkan banyak negeri dan Allah akan menyempurnakan (janji-Nya) kepada kalian, karena itu janganlah kalian bosan berlatih memanah.\" Dan telah menceritakan kepada kami [Daud bin Rusyaid] telah menceritakan kepada kami [Al Walid] dari [Bakr bin Mudlar] dari [Amru bin Al Harits] dari [Abu Ali Al Hamdani] dia berkata; saya pernah mendengar ['Uqbah bin 'Amir] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas.\""
            },
            {
                "number": 3303,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ أَخْبَرَنَا اللَّيْثُ عَنْ الْحَارِثِ بْنِ يَعْقُوبَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِمَاسَةَ أَنَّ فُقَيْمًا اللَّخْمِيَّ قَالَ لِعُقْبَةَ بْنِ عَامِرٍ تَخْتَلِفُ بَيْنَ هَذَيْنِ الْغَرَضَيْنِ وَأَنْتَ كَبِيرٌ يَشُقُّ عَلَيْكَقَالَ عُقْبَةُ لَوْلَا كَلَامٌ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ أُعَانِيهِ قَالَ الْحَارِثُ فَقُلْتُ لِابْنِ شَمَاسَةَ وَمَا ذَاكَ قَالَ إِنَّهُ قَالَ مَنْ عَلِمَ الرَّمْيَ ثُمَّ تَرَكَهُ فَلَيْسَ مِنَّا أَوْ قَدْ عَصَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rumh bin Al Muhajir] telah mengabarkan kepada kami [Al Laits] dari [Al Harits bin Ya'qub] dari [Abdurrahman bin Syimamah] bahwa Fuqaim Al Lakhmi berkata kepada ['Uqbah bin 'Amir], \"Kamu selalu bersungguh-sungguh antara dua target ini sedangkan kamu telah lanjut usia dan telah berat (sudah lemah).\" 'Uqbah berkata, \"Seandainya saya pernah mendengar sabda Rasulullah shallallahu 'alaihi wasallam niscaya saya tidak akan menjaganya.\" Lantas saya bertanya kepada Ibnu Syamasah, \"Apa yang disabdakan beliau itu?\" dia menjawab, \"Beliau bersabda: \"Tidak termasuk dari golongan kami -atau dia telah durhaka- siapa saja yang mengetahui ilmu memanah namun ia meninggalkannya.\""
            },
            {
                "number": 3304,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ وَأَبُو الرَّبِيعِ الْعَتَكِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالُوا حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي أَسْمَاءَ عَنْ ثَوْبَانَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي ظَاهِرِينَ عَلَى الْحَقِّ لَا يَضُرُّهُمْ مَنْ خَذَلَهُمْ حَتَّى يَأْتِيَ أَمْرُ اللَّهِ وَهُمْ كَذَلِكَوَلَيْسَ فِي حَدِيثِ قُتَيْبَةَ وَهُمْ كَذَلِكَ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] dan [Abu Ar Rabi' Al 'Ataki] dan [Qutaibah bin Sa'id] mereka berkata; telah menceritakan kepada kami [Hammad] -yaitu Ibnu Zaid- dari [Ayyub] dari [Abu Qilabah] dari [Abu Asma'] dari [Tsauban] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Senantiasa ada sekelompok ummatku yang dimenangkan atas kebenaran, tidak akan membahayakannya orang yang memusuhinya hingga hari Kiamat sedangkan mereka tetap seperti itu.\" Namun dalam hadits Qutaibah tidak disebutkan, \"Sedangkan mereka tetap sepperti itu.\""
            },
            {
                "number": 3305,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا وَكِيعٌ وَعَبْدَةُ كِلَاهُمَا عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ وَاللَّفْظُ لَهُ حَدَّثَنَا مَرْوَانُ يَعْنِي الْفَزَارِيَّ عَنْ إِسْمَعِيلَ عَنْ قَيْسٍ عَنْ الْمُغِيرَةِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَنْ يَزَالَ قَوْمٌ مِنْ أُمَّتِي ظَاهِرِينَ عَلَى النَّاسِ حَتَّى يَأْتِيَهُمْ أَمْرُ اللَّهِ وَهُمْ ظَاهِرُونَو حَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنِي إِسْمَعِيلُ عَنْ قَيْسٍ قَالَ سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِمِثْلِ حَدِيثِ مَرْوَانَ سَوَاءً",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki']. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Waki'] dan ['Abdah] keduanya dari [Isma'il bin Abu Khalid]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Abu 'Umar] dan ini adalah lafadz dia, telah menceritakan kepada kami [Marwan] -yaitu Al Fazari- dari [Isma'il] dari [Qais] dari [Al Mughirah] dia berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Senantiasa ada sekelompok kaum dari ummatku yang dimenangkan atas manusia sehingga datang keputusan Allah (hari Kiamat).\" Dan telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepadaku [Isma'il] dari [Qais] dia berkata; saya mendengar [Al Mughirah bin Syu'bah] berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda seperti haditsnya Marwan.\""
            },
            {
                "number": 3306,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَنْ يَبْرَحَ هَذَا الدِّينُ قَائِمًا يُقَاتِلُ عَلَيْهِ عِصَابَةٌ مِنْ الْمُسْلِمِينَ حَتَّى تَقُومَ السَّاعَةُ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Simak bin Harb] dari [Jabir bin Samurah] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Agama ini akan senantiasa menang selagi masih ada sekelompok kaum Muslimin yang berperang (di jalan Allah) hingga datang hari Kiamat.\""
            },
            {
                "number": 3307,
                "arab": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ وَحَجَّاجُ بْنُ الشَّاعِرِ قَالَا حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُاسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي يُقَاتِلُونَ عَلَى الْحَقِّ ظَاهِرِينَ إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "Telah menceritakan kepadaku [Harun bin Abdullah] dan [Hajjaj bin As Sya'ir] keduanya berkata; telah menceritakan kepada kami [Hajjaj bin Muhammad] dia berkata; [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Abu Az Zubair] bahwa dia pernah mendengar [Jabir bin Abdullah] berkata, \"Saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Senantiasa ada sekelompok dari ummatku yang selalu menang memperjuangkan kebenaran sampai hari Kiamat.\""
            },
            {
                "number": 3308,
                "arab": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ أَنَّ عُمَيْرَ بْنَ هَانِئٍ حَدَّثَهُ قَالَ سَمِعْتُ مُعَاوِيَةَ عَلَى الْمِنْبَرِ يَقُولُاسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي قَائِمَةً بِأَمْرِ اللَّهِ لَا يَضُرُّهُمْ مَنْ خَذَلَهُمْ أَوْ خَالَفَهُمْ حَتَّى يَأْتِيَ أَمْرُ اللَّهِ وَهُمْ ظَاهِرُونَ عَلَى النَّاسِ",
                "id": "Telah menceritakan kepada kami [Manshur bin Abu Muzahim] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Abdurrahman bin Yazid bin Jabir] bahwa ['Umair bin Hani`] menceritakan kepadanya, dia berkata, \"Saya mendengar [Mu'awiyah] berkata di atas mimbar, \"Saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan senantiasa ada sekelompok dari ummatku yang menegakkan perintah Allah, tidak ada yang membahayakannya orang yang menghinakan atau menyelisihi mereka sampai datangnya hari Kiamat, dan mereka akan selalu menang atas manusia.\""
            },
            {
                "number": 3309,
                "arab": "و حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا كَثِيرُ بْنُ هِشَامٍ حَدَّثَنَا جَعْفَرٌ وَهُوَ ابْنُ بُرْقَانَ حَدَّثَنَا يَزِيدُ بْنُ الْأَصَمِّ قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ ذَكَرَ حَدِيثًا رَوَاهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ أَسْمَعْهُ رَوَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى مِنْبَرِهِ حَدِيثًا غَيْرَهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ يُرِدْ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ وَلَا تَزَالُ عِصَابَةٌ مِنْ الْمُسْلِمِينَ يُقَاتِلُونَ عَلَى الْحَقِّ ظَاهِرِينَ عَلَى مَنْ نَاوَأَهُمْ إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "Dan telah menceritakan kepadaku [Ishaq bin Manshur] telah mengabarkan kepada kami [Katsir bin Hasyim] telah menceritakan kepada kami [Ja'far] -yaitu Ibnu Burqan- telah menceritakan kepada kami [Yazid bin Al Asham] dia berkata; saya pernah mendengar [Mu'awiyah bin Abu Sufyan] menyebutkan hadits yang ia riwayatkan dari Nabi shallallahu 'alaihi wasallam, saya belum pernah mendengar dia meriwayatkan sebuah hadits dari mimbar beliau selain hadits tersebut. Mu'awiyah berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa Allah kehendaki untuk menjadi baik, maka Allah akan pahamkan ia dalam masalah agama. Dan senantiasa ada sekelompok dari kaum Muslimin yang memperjuangkan kebenaran dan selalu menang atas orang yang memusuhinya sampai hari Kiamat.\""
            },
            {
                "number": 3310,
                "arab": "حَدَّثَنِي أَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ وَهْبٍ حَدَّثَنَا عَمِّي عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ شِمَاسَةَ الْمَهْرِيُّ قَالَ كُنْتُ عِنْدَ مَسْلَمَةَ بْنِ مُخَلَّدٍ وَعِنْدَهُ عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ فَقَالَ عَبْدُ اللَّهِ لَا تَقُومُ السَّاعَةُ إِلَّا عَلَى شِرَارِ الْخَلْقِ هُمْ شَرٌّ مِنْ أَهْلِ الْجَاهِلِيَّةِ لَا يَدْعُونَ اللَّهَ بِشَيْءٍ إِلَّا رَدَّهُ عَلَيْهِمْ فَبَيْنَمَا هُمْ عَلَى ذَلِكَ أَقْبَلَ عُقْبَةُ بْنُ عَامِرٍ فَقَالَ لَهُ مَسْلَمَةُ يَا عُقْبَةُ اسْمَعْ مَا يَقُولُ عَبْدُ اللَّهِ فَقَالَ عُقْبَةُ هُوَ أَعْلَمُ وَأَمَّا أَنَافَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَزَالُ عِصَابَةٌ مِنْ أُمَّتِي يُقَاتِلُونَ عَلَى أَمْرِ اللَّهِ قَاهِرِينَ لِعَدُوِّهِمْ لَا يَضُرُّهُمْ مَنْ خَالَفَهُمْ حَتَّى تَأْتِيَهُمْ السَّاعَةُ وَهُمْ عَلَى ذَلِكَ فَقَالَ عَبْدُ اللَّهِ أَجَلْ ثُمَّ يَبْعَثُ اللَّهُ رِيحًا كَرِيحِ الْمِسْكِ مَسُّهَا مَسُّ الْحَرِيرِ فَلَا تَتْرُكُ نَفْسًا فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ الْإِيمَانِ إِلَّا قَبَضَتْهُ ثُمَّ يَبْقَى شِرَارُ النَّاسِ عَلَيْهِمْ تَقُومُ السَّاعَةُ",
                "id": "Telah menceritakan kepadaku [Ahmad bin Abdurrahman bin Wahb] telah menceritakan kepada kami pamanku [Abdullah bin Wahb] telah menceritakan kepada kami ['Amru Al Harits] telah menceritakan kepadaku [Yazid bin Abu Habib] telah menceritakan kepadaku [Abdurrahman bin Syimamah Al Mahri] dia berkata, \"Ketika saya berada di tempat Maslamah bin Mukhallad yang saat itu ada [Abdullah bin 'Amru bin Al 'Ash]. Abdullah berkata, \"Hari Kiamat itu tidak akan menimpa kecuali atas makhluk yang paling jahat. Mereka lebih jahat daripada orang-orang yang hidup di masa jahiliyah. Tidaklah mereka memohon sesuatu kepada Allah kecuali Dia pasti akan menolaknya (tidak mengabulkannya).\" Ketika mereka bercakap-cakap demikian, tiba-tiba datanglah [Uqbah bin 'Amir]. Maka Maslamah berkata kepadanya, \"Wahai Uqbah, dengarkanlah apa yang dikatakan Abdullah.\" Lantas 'Uqbah berkata, \"Dia lebih mengetahui. Adapun saya, sesungguhnya saya juga pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Akan senantiasa ada dari umatku satu kelompok yang berperang di atas perkara Allah, mereka mengalahkan musuh-musuh mereka, dan orang-orang yang menyelisihi mereka tidak akan dapat membahayakan mereka sedikitpun hingga datang hari kiamat sedangkan mereka masih dalam keadaan seperti itu.\" Abdullah pun menimpali, \"Benar.\" Kemudian Allah mengirim sebuah angin yang baunya seperti bau misk dan lembutnya seperti lembut sutera, tidaklah ia melewati seseorang yang di dalam hatinya terdapat keimanan meskipun hanya seberat biji benih, kecuali ia pasti akan diwafatkannya. Maka tinggallah orang-orang jahat saja, lalu terjadilah hari kiamat.\""
            },
            {
                "number": 3311,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ أَبِي عُثْمَانَ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزَالُ أَهْلُ الْغَرْبِ ظَاهِرِينَ عَلَى الْحَقِّ حَتَّى تَقُومَ السَّاعَةُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Husyaim] dari [Daud bin Abu Hind] dari [Abu 'Utsman] dari [Sa'd bin Abu Waqqash] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang-orang Maghrib (Syam) akan terus nampak di atas kebenaran hingga datang hari kiamat\"."
            },
            {
                "number": 3312,
                "arab": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَافَرْتُمْ فِي الْخِصْبِ فَأَعْطُوا الْإِبِلَ حَظَّهَا مِنْ الْأَرْضِ وَإِذَا سَافَرْتُمْ فِي السَّنَةِ فَأَسْرِعُوا عَلَيْهَا السَّيْرَ وَإِذَا عَرَّسْتُمْ بِاللَّيْلِ فَاجْتَنِبُوا الطَّرِيقَ فَإِنَّهَا مَأْوَى الْهَوَامِّ بِاللَّيْلِ",
                "id": "Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Jarir] dari [Suhail] dari [ayahnya] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian melalui padang rumput yang subur maka berilah haknya unta (merumput) dari rerumputan di bumi, dan bila kamu berjalan di musim kemarau maka percepatlah perjalananmu (agar cepat sampai tujuan). Dan bila kamu istirahat dalam perjalanan malam hari maka jauhilah jalan raya, karena jalan raya itu tempat lewat serangga-serangga waktu malam.\""
            },
            {
                "number": 3313,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا سَافَرْتُمْ فِي الْخِصْبِ فَأَعْطُوا الْإِبِلَ حَظَّهَا مِنْ الْأَرْضِ وَإِذَا سَافَرْتُمْ فِي السَّنَةِ فَبَادِرُوا بِهَا نِقْيَهَا وَإِذَا عَرَّسْتُمْ فَاجْتَنِبُوا الطَّرِيقَ فَإِنَّهَا طُرُقُ الدَّوَابِّ وَمَأْوَى الْهَوَامِّ بِاللَّيْلِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdul Aziz] -yaitu Ibnu Muhammad- dari [Suhail] dari [ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian melewati padang rumput maka biarkanlah unta kalian memakan makanan di muka bumi, jika kalian mengadakan perjalanan di musim kemarau maka percepatlah perjalananmu (agar cepat sampai tujuan). Dan bila kamu istirahat dalam perjalanan malam hari, jauhilah jalan raya, karena jalan raya itu tempat lewat hewan melata dan serangga-serangga di waktu malam.\""
            },
            {
                "number": 3314,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ وَإِسْمَعِيلُ بْنُ أَبِي أُوَيْسٍ وَأَبُو مُصْعَبٍ الزُّهْرِيُّ وَمَنْصُورُ بْنُ أَبِي مُزَاحِمٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالُوا حَدَّثَنَا مَالِكٌ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ وَاللَّفْظُ لَهُ قَالَ قُلْتُ لِمَالِكٍ حَدَّثَكَ سُمَيٌّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ السَّفَرُ قِطْعَةٌ مِنْ الْعَذَابِ يَمْنَعُ أَحَدَكُمْ نَوْمَهُ وَطَعَامَهُ وَشَرَابَهُ فَإِذَا قَضَى أَحَدُكُمْ نَهْمَتَهُ مِنْ وَجْهِهِ فَلْيُعَجِّلْ إِلَى أَهْلِهِ قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab] dan [Isma'il bin Abu Uwais] dan [Abu Mus'ab Az Zuhri] dan [Manshur bin Abu Muzahim] dan [Qutaibah bin Sa'id], mereka berkata; telah menceritakan kepada kami [Malik]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dan ini adalah lafadz dari dia, dia berkata; saya pernah bertanya kepada [Malik], \"Apakah [Sumaiy] pernah menceritakan kepadamu dari [Abu Shalih] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perjalanan itu setengah dari siksaan, sebab ia dapat mencegah salah seorang kalian dari tidurnya, makannya dan minumnya, oleh karena itu jika urusan kalian telah selesai, segeralah kembali kepada keluargamu.\" Malik menjawab, \"Betul.\""
            },
            {
                "number": 3315,
                "arab": "حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ هَمَّامٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَطْرُقُ أَهْلَهُ لَيْلًا وَكَانَ يَأْتِيهِمْ غُدْوَةً أَوْ عَشِيَّةًو حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا إِسْحَقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ كَانَ لَا يَدْخُلُ",
                "id": "Telah menceritakan kepadaku [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Yazid bin Harun] dari [Hammam] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam tidak pernah mendatangi (tiba dari perjalanan) keluarganya di malam hari, namun beliau datang ke keluarganya di pagi hari atau di petang hari.\" Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Abdush Shamad bin Abdul Warits] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas, hanya saja ia menyebutkan, \"Beliau tidak pernah masuk (menemui) ….\""
            },
            {
                "number": 3316,
                "arab": "حَدَّثَنِي إِسْمَعِيلُ بْنُ سَالِمٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا سَيَّارٌ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَاللَّفْظُ لَهُ حَدَّثَنَا هُشَيْمٌ عَنْ سَيَّارٍ عَنْ الشَّعْبِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزَاةٍ فَلَمَّا قَدِمْنَا الْمَدِينَةَ ذَهَبْنَا لِنَدْخُلَ فَقَالَ أَمْهِلُوا حَتَّى نَدْخُلَ لَيْلًا أَيْ عِشَاءً كَيْ تَمْتَشِطَ الشَّعِثَةُ وَتَسْتَحِدَّ الْمُغِيبَةُ",
                "id": "Telah menceritakan kepadaku [Isma'il bin Salim] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Sayyar]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Yahya bin Yahya] dan ini adalah lafadz dia, telah menceritakan kepada kami [Husyaim] dari [Yasar] dari [As Sya'bi] dari [Jabir bin Abdullah] dia berkata, \"Kami pernah berperang bersama Nabi shallallahu 'alaihi wasallam, setelah kami tiba di Madinah, kami bermaksud hendak segera pulang ke rumah kami masing-masing. Namun beliau bersabda: \"Tunggulah dahulu hingga hari agak senja, sisirlah dahulu rambut kalian yang kusut, berilah kesempatan kepada keluarga kalian untuk bersiap-siap dan berhias (untuk menyambut kedatangan kalian).\""
            },
            {
                "number": 3317,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي عَبْدُ الصَّمَدِ حَدَّثَنَا شُعْبَةُ عَنْ سَيَّارٍ عَنْ عَامِرٍ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَدِمَ أَحَدُكُمْ لَيْلًا فَلَا يَأْتِيَنَّ أَهْلَهُ طُرُوقًا حَتَّى تَسْتَحِدَّ الْمُغِيبَةُ وَتَمْتَشِطَ الشَّعِثَةُو حَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا سَيَّارٌ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepadaku [Abdush Shamad] telah menceritakan kepada kami [Syu'bah] dari [Yasar] dari ['Amir] dari [Jabir] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian tiba (dari perjalanan) janganlah kalian pulang ke rumah keluargamu tengah malam, supaya keluarga yang ditinggalkan dapat bersiap-siap dan menyisir rambut (menyambut kedatanganmu).\" Dan telah menceritakan kepadaku [Yahya bin Habib] telah menceritakan kepada kami [Rauh bin 'Ubadah] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Sayyar] dengan sanad seperti ini.\""
            },
            {
                "number": 3318,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ عَنْ الشَّعْبِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَطَالَ الرَّجُلُ الْغَيْبَةَ أَنْ يَأْتِيَ أَهْلَهُ طُرُوقًاو حَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ حَدَّثَنَا رَوْحٌ حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Muhammad] -yaitu Ibnu Ja'far- telah menceritakan kepada kami [Syu'bah] dari ['Ashim] dari [Sya'bi] dari [Jabir bin Abdullah] dia berkata, \"Jika seorang laki-laki lama meninggalkan rumah, maka Rasulullah shallallahu 'alaihi wasallam melarangnya untuk masuk rumah (saat kembali) di waktu malam.\" Dan telah menceritakan kepadaku [Yahya bin Habib] telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Syu'bah] dengan sanad ini.\""
            },
            {
                "number": 3319,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ مُحَارِبٍ عَنْ جَابِرٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَطْرُقَ الرَّجُلُ أَهْلَهُ لَيْلًا يَتَخَوَّنُهُمْ أَوْ يَلْتَمِسُ عَثَرَاتِهِمْو حَدَّثَنِيهِ مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ بِهَذَا الْإِسْنَادِ قَالَ عَبْدُ الرَّحْمَنِ قَالَ سُفْيَانُ لَا أَدْرِي هَذَا فِي الْحَدِيثِ أَمْ لَا يَعْنِي أَنْ يَتَخَوَّنَهُمْ أَوْ يَلْتَمِسَ عَثَرَاتِهِمْ و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي قَالَا جَمِيعًا حَدَّثَنَا شُعْبَةُ عَنْ مُحَارِبٍ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَرَاهَةِ الطُّرُوقِ وَلَمْ يَذْكُرْ يَتَخَوَّنُهُمْ أَوْ يَلْتَمِسُ عَثَرَاتِهِمْ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Muharib] dari [Jabir] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang seorang laki-laki mengetuk pintu rumah isterinya (saat kembali dari perjalanan) di waktu malam dengan maksud hendak memergoki atau mencari-cari kesalahan mereka.\" Dan telah menceritakan kepadaku [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdurrahman] telah menceritakan kepada kami [Sufyan] dengan sanad ini. [Abdurrahman] berkata; [Sufyan] berkata, \"Saya tidak tahu pernyataan ini ada dalam hadits ini atau tidak, yakni kalimat 'dengan maksud untuk memergoki mereka atau mencari-cari kesalahan mereka'. Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [ubaidhullah bin Mu'adz] telah menceritakan kepada kami [ayahku] semuanya berkata; telah menceritakan kepada kami [Syu'bah] dari [Muharib] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau membenci seseorang pulang tengah malam (secara tiba-tiba), dan tidak menyebutkan, 'Untuk memergoki mereka atau mencari-cari kesalahan mereka'.\""
            },
            {
                "number": 3320,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ أَخْبَرَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ هَمَّامِ بْنِ الْحَارِثِ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُرْسِلُ الْكِلَابَ الْمُعَلَّمَةَ فَيُمْسِكْنَ عَلَيَّ وَأَذْكُرُ اسْمَ اللَّهِ عَلَيْهِ فَقَالَ إِذَا أَرْسَلْتَ كَلْبَكَ الْمُعَلَّمَ وَذَكَرْتَ اسْمَ اللَّهِ عَلَيْهِ فَكُلْ قُلْتُ وَإِنْ قَتَلْنَ قَالَ وَإِنْ قَتَلْنَ مَا لَمْ يَشْرَكْهَا كَلْبٌ لَيْسَ مَعَهَا قُلْتُ لَهُ فَإِنِّي أَرْمِي بِالْمِعْرَاضِ الصَّيْدَ فَأُصِيبُ فَقَالَ إِذَا رَمَيْتَ بِالْمِعْرَاضِ فَخَزَقَ فَكُلْهُ وَإِنْ أَصَابَهُ بِعَرْضِهِ فَلَا تَأْكُلْهُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim Al Hanzhali] telah mengabarkan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari [Hammam bin Al Harits] dari ['Adi bin Hatim] dia berkata; saya bertanya, \"Wahai Rasulullah, saya pernah melepas anjing pemburu yang terlatih lalu ia menangkap buruan untukku setelah saya menyebut nama Allah ketika melepasnya?\" Jawab Rasulullah shallallahu 'alaihi wasallam: \"Apabila kamu melepas anjing pemburu yang terlatih setelah kamu menyebut nama Allah ketika melepasnya, makanlah tangkapannya.\" Aku bertanya, \"Bagaimana jika buruan itu mati?\" beliau menjawab: \"Meskipun mati, selama tidak ada anjing lain yang menyertainya menangkap.\" Saya bertanya lagi, \"Bagaimana jika saya melempar buruan dengan Mi'radl dan mengenainya?\" Beliau menjawab: \"Apabila kamu melempar dengan Mi'radl dan dapat mengoyaknya maka makanlah buruanmu itu. Namun jika jika yang mengenai adalah pada bagian yang tumpul maka jangan kamu makan.\" "
            },
            {
                "number": 3321,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ بَيَانٍ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ إِنَّا قَوْمٌ نَصِيدُ بِهَذِهِ الْكِلَابِ فَقَالَ إِذَا أَرْسَلْتَ كِلَابَكَ الْمُعَلَّمَةَ وَذَكَرْتَ اسْمَ اللَّهِ عَلَيْهَا فَكُلْ مِمَّا أَمْسَكْنَ عَلَيْكَ وَإِنْ قَتَلْنَ إِلَّا أَنْ يَأْكُلَ الْكَلْبُ فَإِنْ أَكَلَ فَلَا تَأْكُلْ فَإِنِّي أَخَافُ أَنْ يَكُونَ إِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ وَإِنْ خَالَطَهَا كِلَابٌ مِنْ غَيْرِهَا فَلَا تَأْكُلْ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ibnu Fudlail] dari [Bayan] dari [Asy Sya'bi] dari ['Adi bin Hatim] dia berkata, \"Saya pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam, \"Saya katakan, 'Kami ini suatu kaum yang biasa hidup berburu dengan menggunakan anjing-anjing ini. Bagaimana itu? ' Nabi shallallahu 'alaihi wasallam menjawab: \"Apabila kamu melepas anjingmu yang terlatih dengan menyebut nama Allah, maka makanlah hasilnya sekalipun buruan itu mati dalam tangkapannya. Kecuali jika anjing-anjing itu memakan tangkapannya maka janganlah kamu makan pula, karena aku khawatir dia (anjing-anjing tersebut) menangkap buruan itu untuknya sendiri. Atau, jika ada anjing lain yang menyertainya menangkap (buruan tersebut), maka jangan kamu makan.\""
            },
            {
                "number": 3322,
                "arab": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمِعْرَاضِ فَقَالَ إِذَا أَصَابَ بِحَدِّهِ فَكُلْ وَإِذَا أَصَابَ بِعَرْضِهِ فَقَتَلَ فَإِنَّهُ وَقِيذٌ فَلَا تَأْكُلْ وَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْكَلْبِ فَقَالَ إِذَا أَرْسَلْتَ كَلْبَكَ وَذَكَرْتَ اسْمَ اللَّهِ فَكُلْ فَإِنْ أَكَلَ مِنْهُ فَلَا تَأْكُلْ فَإِنَّهُ إِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ قُلْتُ فَإِنْ وَجَدْتُ مَعَ كَلْبِي كَلْبًا آخَرَ فَلَا أَدْرِي أَيُّهُمَا أَخَذَهُ قَالَ فَلَا تَأْكُلْ فَإِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِو حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ وَأَخْبَرَنِي شُعْبَةُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ قَالَ سَمِعْتُ الشَّعْبِيَّ يَقُولُ سَمِعْتُ عَدِيَّ بْنَ حَاتِمٍ يَقُولُا سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمِعْرَاضِ فَذَكَرَ مِثْلَهُ و حَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ حَدَّثَنَا غُنْدَرٌ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ وَعَنْ نَاسٍ ذَكَرَ شُعْبَةُ عَنْ الشَّعْبِيِّ قَالَ سَمِعْتُ عَدِيَّ بْنَ حَاتِمٍ قَالَ سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمِعْرَاضِ بِمِثْلِ ذَلِكَ",
                "id": "Dan telah menceritakan kepada kami ['ubaidhullah bin Mu'adz Al 'Anbari] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari [Abdullah bin Abu As Safar] dari [Asy Sya'bi] dari ['Adi bin Hatim] dia berkata, \"Saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai Mi'radl, beliau lalu bersabda: \"Jika yang mengenai adalah bagian tajamnya maka makanlah, namun jika yang mengenai adalah bagian yang tumpul maka itu adalah binatang yang mati karena pukulan, maka jangan kamu makan.\" Lalu saya juga bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai anjing buruan, beliau menjawab: \"Jika kamu melepas anjing buruanmu setelah menyebut nama Allah, maka makanlah buruan tersebut, selagi anjing buruanmu tidak memakannya.\" Dan telah menceritakan kepadaku [Yahya bin Ayyub] telah menceritakan kepada kami [Ibnu 'Ulayyah] berkata; dan telah mengabarkan kepadaku, [Syu'bah] dari [Abdullah bin Abu As Safar] berkata; saya telah mendengar [Asy Sya'bi] berkata; saya mendengar dari ['Adi bin Hatim] berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang mi'radl, lalu menyebutkan sama di atas. Dan telah menceritakan kepadaku [Abu Bakar bin Nafi' Al 'Abdi] telah menceritakan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Abdullah bin Abu As Safar] dan dari orang-orang yang disebutkan [Syu'bah] dari [Asy Sya'bi] berkata; saya mendengar dari ['Adi bin Hatim] berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang mi'radl, seperti di atas."
            },
            {
                "number": 3323,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا زَكَرِيَّاءُ عَنْ عَامِرٍ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ مَا أَصَابَ بِحَدِّهِ فَكُلْهُ وَمَا أَصَابَ بِعَرْضِهِ فَهُوَ وَقِيذٌ وَسَأَلْتُهُ عَنْ صَيْدِ الْكَلْبِ فَقَالَ مَا أَمْسَكَ عَلَيْكَ وَلَمْ يَأْكُلْ مِنْهُ فَكُلْهُ فَإِنَّ ذَكَاتَهُ أَخْذُهُ فَإِنْ وَجَدْتَ عِنْدَهُ كَلْبًا آخَرَ فَخَشِيتَ أَنْ يَكُونَ أَخَذَهُ مَعَهُ وَقَدْ قَتَلَهُ فَلَا تَأْكُلْ إِنَّمَا ذَكَرْتَ اسْمَ اللَّهِ عَلَى كَلْبِكَ وَلَمْ تَذْكُرْهُ عَلَى غَيْرِهِو حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا زَكَرِيَّاءُ بْنُ أَبِي زَائِدَةَ بِهَذَا الْإِسْنَادِ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Zakaria] dari ['Amir] dari [Adi bin Hatim] dia berkata, \"Saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang buruan yang mati dengan senjata Mi'radl.\" Beliau pun menjawab: \"Jika yang mengenai adalah pada bagian yang tajam maka makanlah, namun jika yang mengenai adalah pada sisi yang tumpul maka itu adalah buruan yang mati karena pukulan.\" Kemudian saya bertanya kepada beliau tentang anjing buruan, beliau menjawab: \"Apa yang ditangkap anjing itu sedangkan ia tidak memakannya, maka makanlah buruan tersebut sebab kamu telah menyembelih dengan cara yang syar'i, jika kamu mendapatinya bersama anjing yang lain, maka di khawatirkan yang membunuh buruan tersebut adalah anjing yang lain, maka janganlah kamu memakan buruan itu. Hanyasanya kamu menyebut nama Allah untuk anjingmu bukan untuk anjing yang lain.\" Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Isa bin Yunus] telah menceritakan kepada kami [Zakaria bin Abu Zaidah] dengan sanad ini."
            },
            {
                "number": 3324,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ بْنِ عَبْدِ الْحَمِيدِ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ حَدَّثَنَا الشَّعْبِيُّ قَالَ سَمِعْتُ عَدِيَّ بْنَ حَاتِمٍ وَكَانَ لَنَا جَارًا وَدَخِيلًا وَرَبِيطًا بِالنَّهْرَيْنِأَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُرْسِلُ كَلْبِي فَأَجِدُ مَعَ كَلْبِي كَلْبًا قَدْ أَخَذَ لَا أَدْرِي أَيُّهُمَا أَخَذَ قَالَ فَلَا تَأْكُلْ فَإِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِو حَدَّثَنَا مَحَمَّدُ بْنُ الْوَلِيدِ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Walid bin Abdul Hamid] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Sa'id bin Masruq] telah menceritakan kepada kami [As Sya'bi] dia berkata; saya pernah mendengar ['Adi bin Hatim] -saat kami berada di Nahrain kami bertetangga dekat dengannya-, bahwa dia pernah bertanya kepada Nabi shallallahu 'alaihi wasallam, katanya, \"Saya pernah melepas anjing buruanku, ternyata ia menangkap buruan dengan anjing yang lain, saya tidak tahu yang manakah anjing yang telah menangkap binatang tersebut.\" Beliau bersabda: \"Janganlah kamu memakannya, karena kamu membacakan bismillah untuk anjingmu bukan untuk anjing yang lain.\" Dan telah menceritakan kepada kami [Muhammad bin Al Walid] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [As Sya'bi] dari ['Adi bin Hatim] dari Nabi shallallahu 'alaihi wasallam seperti itu.\""
            },
            {
                "number": 3325,
                "arab": "حَدَّثَنِي الْوَلِيدُ بْنُ شُجَاعٍ السَّكُونِيُّ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ عَاصِمٍ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرْسَلْتَ كَلْبَكَ فَاذْكُرْ اسْمَ اللَّهِ فَإِنْ أَمْسَكَ عَلَيْكَ فَأَدْرَكْتَهُ حَيًّا فَاذْبَحْهُ وَإِنْ أَدْرَكْتَهُ قَدْ قَتَلَ وَلَمْ يَأْكُلْ مِنْهُ فَكُلْهُ وَإِنْ وَجَدْتَ مَعَ كَلْبِكَ كَلْبًا غَيْرَهُ وَقَدْ قَتَلَ فَلَا تَأْكُلْ فَإِنَّكَ لَا تَدْرِي أَيُّهُمَا قَتَلَهُ وَإِنْ رَمَيْتَ سَهْمَكَ فَاذْكُرْ اسْمَ اللَّهِ فَإِنْ غَابَ عَنْكَ يَوْمًا فَلَمْ تَجِدْ فِيهِ إِلَّا أَثَرَ سَهْمِكَ فَكُلْ إِنْ شِئْتَ وَإِنْ وَجَدْتَهُ غَرِيقًا فِي الْمَاءِ فَلَا تَأْكُلْ",
                "id": "Telah menceritakan kepadaku [Al Walid bin Syuja' As Sakuni] telah menceritakan kepada kami [Ali bin Mushir] dari ['Ashim] dari [As Sya'bi] dari ['Adi bin Hatim] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah bersabda kepadaku: \"Apabila kamu melepaskan anjing buruan maka sebutlah nama Allah, jika ia mendapatkan hewan buruan yang masih hidup maka sembelihlah dia, jika ia mendapatkan hewan buruan telah mati, sedangkan ia tidak memakannya, maka makanlah hewan buruan tersebut. Namun jika ternyata ia bersama dengan anjing yang lain, dan membawa hewan buruan yang telah mati, maka janganlah kamu memakannya, sebab kamu tidak mengetahui manakah di antara keduanya yang membunuh hewan buruan itu. Apabila kamu melempar anak panahmu, maka sebutlah nama Allah, jika kamu mendapatkan bekas tusukan anak panahmu (pada hewan buruan), jika kamu mau makanlah ia, namun jika kamu dapati hewan buruan tersebut mati tenggelam, maka janganlah kamu memakannya.\""
            },
            {
                "number": 3326,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا عَاصِمٌ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّيْدِ قَالَ إِذَا رَمَيْتَ سَهْمَكَ فَاذْكُرْ اسْمَ اللَّهِ فَإِنْ وَجَدْتَهُ قَدْ قَتَلَ فَكُلْ إِلَّا أَنْ تَجِدَهُ قَدْ وَقَعَ فِي مَاءٍ فَإِنَّكَ لَا تَدْرِي الْمَاءُ قَتَلَهُ أَوْ سَهْمُكَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ayyub] telah menceritakan kepada kami [Abdullah bin Mubarak] telah mengabarkan kepada kami ['Ashim] dari [As Sya'bi] dari ['Adi bin Hatim] dia berkata, \"Saya pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan, beliau menjawab: \"Apabila kamu memanah maka sebutlah nama Allah, jika kamu mendapatinya telah terbunuh maka makanlah (hewan buruan tersebut), kecuali jika kamu dapati ia tenggelam di air, sebab kamu tidak tahu apakah air itu yang membunuhnya ataukah panahmu.\""
            },
            {
                "number": 3327,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ حَيْوَةَ بْنِ شُرَيْحٍ قَالَ سَمِعْتُ رَبِيعَةَ بْنَ يَزِيدَ الدِّمَشْقِيَّ يَقُولُ أَخْبَرَنِي أَبُو إِدْرِيسَ عَائِذُ اللَّهِ قَالَ سَمِعْتُ أَبَا ثَعْلَبَةَ الْخُشَنِيَّ يَقُولُاأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا بِأَرْضِ قَوْمٍ مِنْ أَهْلِ الْكِتَابِ نَأْكُلُ فِي آنِيَتِهِمْ وَأَرْضِ صَيْدٍ أَصِيدُ بِقَوْسِي وَأَصِيدُ بِكَلْبِي الْمُعَلَّمِ أَوْ بِكَلْبِي الَّذِي لَيْسَ بِمُعَلَّمٍ فَأَخْبِرْنِي مَا الَّذِي يَحِلُّ لَنَا مِنْ ذَلِكَ قَالَ أَمَّا مَا ذَكَرْتَ أَنَّكُمْ بِأَرْضِ قَوْمٍ مِنْ أَهْلِ الْكِتَابِ تَأْكُلُونَ فِي آنِيَتِهِمْ فَإِنْ وَجَدْتُمْ غَيْرَ آنِيَتِهِمْ فَلَا تَأْكُلُوا فِيهَا وَإِنْ لَمْ تَجِدُوا فَاغْسِلُوهَا ثُمَّ كُلُوا فِيهَا وَأَمَّا مَا ذَكَرْتَ أَنَّكَ بِأَرْضِ صَيْدٍ فَمَا أَصَبْتَ بِقَوْسِكَ فَاذْكُرْ اسْمَ اللَّهِ ثُمَّ كُلْ وَمَا أَصَبْتَ بِكَلْبِكَ الْمُعَلَّمِ فَاذْكُرْ اسْمَ اللَّهِ ثُمَّ كُلْ وَمَا أَصَبْتَ بِكَلْبِكَ الَّذِي لَيْسَ بِمُعَلَّمٍ فَأَدْرَكْتَ ذَكَاتَهُ فَكُلْو حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا الْمُقْرِئُ كِلَاهُمَا عَنْ حَيْوَةَ بِهَذَا الْإِسْنَادِ نَحْوَ حَدِيثِ ابْنِ الْمُبَارَكِ غَيْرَ أَنَّ حَدِيثَ ابْنِ وَهْبٍ لَمْ يَذْكُرْ فِيهِ صَيْدَ الْقَوْسِ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari] telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Haiwah bin Syuraih] dia berkata; saya mendengar [Rabi'ah bin Yazid Ad Dimasyqi] berkata; telah mengabarkan kepadaku [Abu Idris 'Aidzullah] dia berkata; saya mendengar [Abu Tsa'labah Al Khusani] berkata, \"Saya pernah mendatangi Rasulullah shallallahu 'alaihi wasallam seraya bertanya, 'Wahai Rasulullah, kami tinggal di negeri ahli kitab, dan kami memakan dengan menggunakan periuk mereka, sedangkan penghidupan mereka adalah berburu. Saya juga berburu dengan menggunakan panah dan anjing yang sudah terlatih dan juga belum terlatih, oleh karena itu beritahukanlah kepada kami sesuatu yang halal dari yang demikian itu?\" beliau menjawab: \"Adapun keadaanmu yang tinggal di negeri ahli kitab dan makan dengan piring-piring mereka, maka seandainya kamu bisa mendapatkan piring-piring selain piring mereka, maka janganlah menggunakan piring mereka. Namun jika kamu tidak mendapatkan piring selain piring mereka, basuhlah piring mereka dan makanlah dengan menggunakan piring tersebut. Adapun keadaanmu yang tinggal di negeri mereka yang mata pencahariannya berburu, jika kamu berburu dengan menggunakan panahmu, sebutlah nama Allah terlebih dahulu kemudian makanlah hasil buruan tersebut, dan jika kamu menangkap hewan buruan dengan menggunakan anjing pelatih, sebutlah nama Allah terlebih dahulu kemudian makanlah hasil buruan tersebut, dan jika kamu menangkap hewan buruan dengan menggunakan anjing yang tidak terlatih dan kamu masih sempat menyembelihnya, maka makanlah hewan buruan tersebut.\" Dan telah menceritakan kepadaku [Abu At Thahir] telah mengabarkan kepada kami [Ibnu Wahb]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Al Muqri`] keduanya dari [Haiwah] dengan sanad ini seperti hadits Ibnu Mubarak, namun dalam hadits Ibnu Wahab dia tidak menyebutkan, 'Berburu dengan menggunakan panah'.\""
            },
            {
                "number": 3328,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ حَدَّثَنَا أَبُو عَبْدِ اللَّهِ حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ عَنْ أَبِي ثَعْلَبَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا رَمَيْتَ بِسَهْمِكَ فَغَابَ عَنْكَ فَأَدْرَكْتَهُ فَكُلْهُ مَا لَمْ يُنْتِنْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Mihran Ar Razi] telah menceritakan kepada kami [Abu Abdullah Hammad bin Khalid Al Hiyyath] dari [Mu'awiyah bin Shalih] dari [Abdurrahman bin Jubair] dari [ayahnya] dari [Abu Tsa'labah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika hewan buruan yang kamu panah hilang kemudian kamu mendapatinya kembali, maka makanlah buruan tersebut selagi belum membusuk.\""
            },
            {
                "number": 3329,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ حَدَّثَنَا مَعْنُ بْنُ عِيسَى حَدَّثَنِي مُعَاوِيَةُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ عَنْ أَبِي ثَعْلَبَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الَّذِي يُدْرِكُ صَيْدَهُ بَعْدَ ثَلَاثٍ فَكُلْهُ مَا لَمْ يُنْتِنْو حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ الْعَلَاءِ عَنْ مَكْحُولٍ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثَهُ فِي الصَّيْدِ ثُمَّ قَالَ ابْنُ حَاتِمٍ حَدَّثَنَا ابْنُ مَهْدِيٍّ عَنْ مُعَاوِيَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ وَأَبِي الزَّاهِرِيَّةِ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ بِمِثْلِ حَدِيثِ الْعَلَاءِ غَيْرَ أَنَّهُ لَمْ يَذْكُرْ نُتُونَتَهُ وَقَالَ فِي الْكَلْبِ كُلْهُ بَعْدَ ثَلَاثٍ إِلَّا أَنْ يُنْتِنَ فَدَعْهُ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Ahmad bin Abu Khalaf] telah menceritakan kepada kami [Ma'n bin Isa] telah menceritakan kepadaku [Mu'awiyah] dari [Abdurrahman bin Jubair bin Nufair] dari [ayahnya] dari [Abu Tsa'labah] dari Nabi shallallahu 'alaihi wasallam mengenai orang yang mendapati hewan buruannya setelah tiga hari, maka beliau menyuruh untuk memakannya selagi belum membusuk.\" Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Mu'awiyah bin Shalih] dari [Al 'Ala] dari [Makhul] dari [Abu Tsa'labah Al Khusani] dari Nabi shallallahu 'alaihi wasallam pada haditsnya mengenai hewan buruan, kemudian [Ibnu Hatim] berkata; telah menceritakan kepada kami [Ibnu Mahdi] dari [Mu'awiyah] dari [Abdurrahman bin Jubair] dan [Abu Az Zahiriyah] dari [Jubair bin Nufair] dari [Abu Tsa'labah Al Khusani] seperti Al 'Ala namun dia tidak menyebutkan, 'Selagi belum membusuk', dan dia menyebutkan mengenai anjing pemburu, \"Makanlah walaupun telah berlalu tiga hari kecuali jika telah membusuk, maka tinggalkanlah.\""
            },
            {
                "number": 3330,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَابْنُ أَبِي عُمَرَ قَالَ إِسْحَقُ أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي إِدْرِيسَ عَنْ أَبِي ثَعْلَبَةَ قَالَنَهَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنْ السَّبُعِزَادَ إِسْحَقُ وَابْنُ أَبِي عُمَرَ فِي حَدِيثِهِمَا قَالَ الزُّهْرِيُّ وَلَمْ نَسْمَعْ بِهَذَا حَتَّى قَدِمْنَا الشَّامَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ishaq bin Ibrahim] dan [Ibnu Abu Umar], Ishaq berkata; telah mengabarkan kepada kami, sedangkan yang dua mengatakan; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari [Abu Idris] dari [Abu Tsa'labah] dia berkata, \"Nabi shallallahu 'alaihi wasallam melarang memakan binatang buas yang bertaring.\" Ishaq dan Ibnu Abu Umar menambahkan dalam haditsnya, Az Zuhri berkata, \"Kami tidak mendengar hadits ini hingga kami tiba di negeri Syam.\""
            },
            {
                "number": 3331,
                "arab": "و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ أَنَّهُ سَمِعَ أَبَا ثَعْلَبَةَ الْخُشَنِيَّ يَقُولُانَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِقَالَ ابْنُ شِهَابٍ وَلَمْ أَسْمَعْ ذَلِكَ مِنْ عُلَمَائِنَا بِالْحِجَازِ حَتَّى حَدَّثَنِي أَبُو إِدْرِيسَ وَكَانَ مِنْ فُقَهَاءِ أَهْلِ الشَّامِ",
                "id": "Dan telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari Ibnu Shihab dari [Abu Idris Al Khaulani] bahwa dia mendengar [Abu Tsa'labah Al Khusni] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang memakan setiap binatang buas yang bertaring.\" Ibnu Shihab berkata, \"Saya belum pernah mendengar hadits tersebut dari ulama-ulama kami di Hijaz hingga Abu Idris menceritakan kepadaku, sedangkan dia termasuk dari ulama negeri Syam.\""
            },
            {
                "number": 3332,
                "arab": "و حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنَا عَمْرٌو يَعْنِي ابْنَ الْحَارِثِ أَنَّ ابْنَ شِهَابٍ حَدَّثَهُ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِو حَدَّثَنِيهِ أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ وَابْنُ أَبِي ذِئْبٍ وَعَمْرُو بْنُ الْحَارِثِ وَيُونُسُ بْنُ يَزِيدَ وَغَيْرُهُمْ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ عَنْ عَبْدِ الرَّزَّاقِ عَنْ مَعْمَرٍ ح و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا يُوسُفُ بْنُ الْمَاجِشُونِ ح و حَدَّثَنَا الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ كُلُّهُمْ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ مِثْلَ حَدِيثِ يُونُسَ وَعَمْرٍو كُلُّهُمْ ذَكَرَ الْأَكْلَ إِلَّا صَالِحًا وَيُوسُفَ فَإِنَّ حَدِيثَهُمَا نَهَى عَنْ كُلِّ ذِي نَابٍ مِنْ السَّبُعِ",
                "id": "Dan telah menceritakan kepadaku [Harun bin Sa'id Al Aili] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepada kami ['Amru] -yaitu Ibnu Al Harits- bahwa [Ibnu Syihab] telah mengabarkan kepadanya dari [Abu Idris Al Khaulani] dari [Abu Tsa'labah Al Khusyani], bahwa Rasulullah shallallahu 'alaihi wasallam melarang memakan setiap binatang buas yang bertaring.\" Dan telah menceritakan kepada kami [Abu At Thahir] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Malik bin Anas] dan [Ibnu Abu Dzi`ib] dan ['Amru bin Harits] dan [Yunus bin Yazid] serta yang lain. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Muhammad bin Rafi'] dan ['Abdu bin Khumaid] dan ['Abdurrazaq] dari [Ma'mar]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Yusuf bin Majisyun]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Al Khulwani] dan ['Abdu bin Khumaid] dari [Ya'qub bin Ibrahim bin Sa'ad] telah menceritakan kepada kami [Ayahku] dari [Shalih] mereka semua dari [Az Zuhri] dengan sanad ini seperti hadits Yunus dan 'Amru, semuanya menyebutkan Al Aklu (memakan), kecuali Shalih dan Yusuf. Dalam hadits keduanya disebutkan, 'Beliau melarang memakan setiap binatang buas yang bertaring'.\""
            },
            {
                "number": 3333,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ مَهْدِيٍّ عَنْ مَالِكٍ عَنْ إِسْمَعِيلَ بْنِ أَبِي حَكِيمٍ عَنْ عَبِيدَةَ بْنِ سُفْيَانَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ ذِي نَابٍ مِنْ السِّبَاعِ فَأَكْلُهُ حَرَامٌو حَدَّثَنِيهِ أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Abdurrahman] -yaitu Ibnu Mahdi- dari [Malik] dari [Isma'il bin Abu Hakim] dari ['Abidah bin Sufyan] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Setiap binatang buas yang bertaring, maka memakannya adalah haram.\" Dan telah menceritakan kepadaku [Abu At Thahir] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Malik bin Anas] dengan sanad seperti ini.\""
            },
            {
                "number": 3334,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ ابْنِ عَبَّاسٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِ وَعَنْ كُلِّ ذِي مِخْلَبٍ مِنْ الطَّيْرِو حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz Al 'Anbari] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Maimun bin Mihran] dari [Ibnu Abbas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang memakan setiap binatang buas yang bertaring, dan setiap jenis burung yang mempunyai kuku untuk mencengkeram.\" Dan telah menceritakan kepadaku [Hajjaj bin As Sya'ir] telah menceritakan kepada kami [Sahl bin Hammad] telah menceritakan kepada kami [Syu'bah] dengan sanad seperti ini.\""
            },
            {
                "number": 3335,
                "arab": "و حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ حَدَّثَنَا أَبُو عَوَانَةَ حَدَّثَنَا الْحَكَمُ وَأَبُو بِشْرٍ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِ وَعَنْ كُلِّ ذِي مِخْلَبٍ مِنْ الطَّيْرِو حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ أَبِي بِشْرٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا هُشَيْمٌ قَالَ أَبُو بِشْرٍ أَخْبَرَنَا عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ ابْنِ عَبَّاسٍ قَالَ نَهَى ح و حَدَّثَنِي أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ ابْنِ عَبَّاسٍ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ شُعْبَةَ عَنْ الْحَكَمِ",
                "id": "Dan telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Sulaiman bin Daud] telah menceritakan kepada kami [Abu 'Awanah] telah menceritakan kepada kami [Al Hakam] dan [Abu Bisyr] dari [Maimun bin Mihran] dari [Ibnu Abbas], bahwa Rasulullah shallallahu 'alaihi wasallam melarang (memakan) dari setiap bintang buas yang bertaring dan setiap jenis burung yang memiliki kuku untuk mencengkeram.\" Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Husyaim] dari [Abu Bisyr]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Husyaim], [Abu Bisyr] berkata; telah mengabarkan kepada kami dari [Maimun bin Mihran] dari [Ibnu Abbas] dia berkata, \"Beliau melarang ….\" (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Abu Kamil Al Jahdari] telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Maimun bin Mihran] dari [Ibnu Abbas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang…seperti hadits Syu'bah dari Al Hakam.\""
            },
            {
                "number": 3336,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ ح و حَدَّثَنَاه يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَبَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمَّرَ عَلَيْنَا أَبَا عُبَيْدَةَ نَتَلَقَّى عِيرًا لِقُرَيْشٍ وَزَوَّدَنَا جِرَابًا مِنْ تَمْرٍ لَمْ يَجِدْ لَنَا غَيْرَهُ فَكَانَ أَبُو عُبَيْدَةَ يُعْطِينَا تَمْرَةً تَمْرَةً قَالَ فَقُلْتُ كَيْفَ كُنْتُمْ تَصْنَعُونَ بِهَا قَالَ نَمَصُّهَا كَمَا يَمَصُّ الصَّبِيُّ ثُمَّ نَشْرَبُ عَلَيْهَا مِنْ الْمَاءِ فَتَكْفِينَا يَوْمَنَا إِلَى اللَّيْلِ وَكُنَّا نَضْرِبُ بِعِصِيِّنَا الْخَبَطَ ثُمَّ نَبُلُّهُ بِالْمَاءِ فَنَأْكُلُهُ قَالَ وَانْطَلَقْنَا عَلَى سَاحِلِ الْبَحْرِ فَرُفِعَ لَنَا عَلَى سَاحِلِ الْبَحْرِ كَهَيْئَةِ الْكَثِيبِ الضَّخْمِ فَأَتَيْنَاهُ فَإِذَا هِيَ دَابَّةٌ تُدْعَى الْعَنْبَرَ قَالَ قَالَ أَبُو عُبَيْدَةَ مَيْتَةٌ ثُمَّ قَالَ لَا بَلْ نَحْنُ رُسُلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي سَبِيلِ اللَّهِ وَقَدْ اضْطُرِرْتُمْ فَكُلُوا قَالَ فَأَقَمْنَا عَلَيْهِ شَهْرًا وَنَحْنُ ثَلَاثُ مِائَةٍ حَتَّى سَمِنَّا قَالَ وَلَقَدْ رَأَيْتُنَا نَغْتَرِفُ مِنْ وَقْبِ عَيْنِهِ بِالْقِلَالِ الدُّهْنَ وَنَقْتَطِعُ مِنْهُ الْفِدَرَ كَالثَّوْرِ أَوْ كَقَدْرِ الثَّوْرِ فَلَقَدْ أَخَذَ مِنَّا أَبُو عُبَيْدَةَ ثَلَاثَةَ عَشَرَ رَجُلًا فَأَقْعَدَهُمْ فِي وَقْبِ عَيْنِهِ وَأَخَذَ ضِلَعًا مِنْ أَضْلَاعِهِ فَأَقَامَهَا ثُمَّ رَحَلَ أَعْظَمَ بَعِيرٍ مَعَنَا فَمَرَّ مِنْ تَحْتِهَا وَتَزَوَّدْنَا مِنْ لَحْمِهِ وَشَائِقَ فَلَمَّا قَدِمْنَا الْمَدِينَةَ أَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْنَا ذَلِكَ لَهُ فَقَالَ هُوَ رِزْقٌ أَخْرَجَهُ اللَّهُ لَكُمْ فَهَلْ مَعَكُمْ مِنْ لَحْمِهِ شَيْءٌ فَتُطْعِمُونَا قَالَ فَأَرْسَلْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُ فَأَكَلَهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Khaitsamah] dari [Abu Az Zubair] dari [Jabir] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengirim kami dengan Abu Ubaidah sebagai komandannya, untuk menghadang kafilah dagang Quraisy. Kami hanya dibekali dengan sekarung kurma, dan tidak ada lagi selain itu. Karena itu, Abu Ubaidah membagi-bagikannya kepada kami sebuah demi sebuah.\" Abu Az Zubair berkata, \"Lantas saya berkata, \"Apa yang dapat kalian perbuat dengan sebuah kurma itu?\" Jabir menjawab, \"Kami menghisap-hisapnya seperti bayi. Kemudian kami meminum air. Hal itu sudah cukup bagi kami untuk sehari sampai malam. Pernah juga kami gugurkan dedaunan dengan tongkat, kemudian kami siram dengan air lalu kami memakannya. Setelah kami sampai di pantai lautan, kami dihadapkan dengan suatu pemandangan yang tampaknya seperti gundukan air, ketika kami hampiri ternyata itu adalah hewan laut yang disebut 'anbar (sejenis ikan yang panjang dan besar kepalanya).\" Jabir berkata, \"Lalu Abu Ubaidah berkata, \"Itu adalah bangkai.\" kemudian dia melanjutkan, \"Namun tidak mengapa, kita adalah utusan Rasulullah shallallahu 'alaihi wasallam yang mengembang tugas fi sabilillah dan kalian dalam keadaan terpaksa, karena itu kalian boleh memakannya.\" Jabir berkata, \"Kami menetap di tempat itu selama sebulan, dan jumlah kami semuanya ada tiga ratus orang, dan kami menjadi gemuk semuanya (karena makan daging itu).\" Jabir melanjutkan, \"Sungguh kami telah mengetahui, saat itu kami mengambil minyaknya dari rongga matanya dan menampungnya dengan tempayan besar. Kemudian kami potong-potong dagingnya seperti memotong seekor lembu. Kemudian Abu Ubaidah memanggil tiga belas prajurit untuk masuk ke rongga mata ikan, lalu mereka mengambil kerangkanya dan menegakkannya, kemudian unta kami yang paling besar disuruh berjalan di bawah kerangka ikan tersebut. Kami lalu ambil daging ikan itu sebagai perbekalan kami dan untuk kami masak. Setelah kami tiba di Madinah, kami menemui Rasulullah shallallahu 'alaihi wasallam dan memberitahukan hal itu kepada beliau, maka beliau bersabda: \"Itu adalah rizki yang diberikan Allah kepada kalian, apakah kalian membawa sedikit dagingnya untuk kami makan?\" Jabir berkata, \"Lantas kami kirimkan daging tersebut kepada Rasulullah shallallahu 'alaihi wasallam lalu beliau memakannya.\""
            },
            {
                "number": 3337,
                "arab": "حَدَّثَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ حَدَّثَنَا سُفْيَانُ قَالَ سَمِعَ عَمْرٌو جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُابَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ ثَلَاثُ مِائَةِ رَاكِبٍ وَأَمِيرُنَا أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ نَرْصُدُ عِيرًا لِقُرَيْشٍ فَأَقَمْنَا بِالسَّاحِلِ نِصْفَ شَهْرٍ فَأَصَابَنَا جُوعٌ شَدِيدٌ حَتَّى أَكَلْنَا الْخَبَطَ فَسُمِّيَ جَيْشَ الْخَبَطِ فَأَلْقَى لَنَا الْبَحْرُ دَابَّةً يُقَالُ لَهَا الْعَنْبَرُ فَأَكَلْنَا مِنْهَا نِصْفَ شَهْرٍ وَادَّهَنَّا مِنْ وَدَكِهَا حَتَّى ثَابَتْ أَجْسَامُنَا قَالَ فَأَخَذَ أَبُو عُبَيْدَةَ ضِلَعًا مِنْ أَضْلَاعِهِ فَنَصَبَهُ ثُمَّ نَظَرَ إِلَى أَطْوَلِ رَجُلٍ فِي الْجَيْشِ وَأَطْوَلِ جَمَلٍ فَحَمَلَهُ عَلَيْهِ فَمَرَّ تَحْتَهُ قَالَ وَجَلَسَ فِي حَجَاجِ عَيْنِهِ نَفَرٌ قَالَ وَأَخْرَجْنَا مِنْ وَقْبِ عَيْنِهِ كَذَا وَكَذَا قُلَّةَ وَدَكٍ قَالَ وَكَانَ مَعَنَا جِرَابٌ مِنْ تَمْرٍ فَكَانَ أَبُو عُبَيْدَةَ يُعْطِي كُلَّ رَجُلٍ مِنَّا قَبْضَةً قَبْضَةً ثُمَّ أَعْطَانَا تَمْرَةً تَمْرَةً فَلَمَّا فَنِيَ وَجَدْنَا فَقْدَهُ",
                "id": "Telah menceritakan kepada kami [Abdul Jabbar bin Al 'Ala] telah mengabarkan kepada kami [Sufyan] dia berkata; ['Amru] pernah mendengar [Jabir bin Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam mengirim kami beserta tiga ratus prajurit penunggang kuda yang dipimpin oleh Abu 'Ubaidah bin Jarrah untuk mengintai kafilah dagang orang-orang Quraisy, maka kami bermukim di pantai selama setengah bulan hingga kami kelaparan. Kami kemudian memakan al Khabath (dedaunan) yang terjatuh dari pohonnya, sehingga kami pun disebut dengan pasukan al Khabath. Kemudian laut mendamparkan seekor ikan besar yang disebut Al 'Anbar kepada kami, kami lalu memakannya dan mengambil minyaknya hingga stamina kami pulih dan kuat kembali.\" Jabir menurutkan, \"Kemudian Abu Ubaidah mengambil tulang rusuknya dan mendirikannya, setelah itu dia menyuruh orang yang paling tinggi di antara kami dan yang paling tinggi untanya untuk berjalan lewat bawah rongga tersebut (tulang ikan tersebut).\" Jabir melanjutkan, \"Beberapa orang juga ada yang masuk ke rongga matanya.\" Jabir berkata, \"kemudian kami mengambil daging dari rongga matanya tersebut begini dan begini, yaitu sedikit dari minyaknya.\" Jabir berkata, \"Ketika itu kami juga membawa sekantong kurma, dan Abu 'Ubaidah memberi kurma segenggam-segenggam kepada setiap prajurit, hingga pernah hanya memberi kami satu biji kurma-satu biji kurma, ketika kurma tersebut habis kamipun mendapatkan gantinya (bangkai ikan).\""
            },
            {
                "number": 3338,
                "arab": "و حَدَّثَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ حَدَّثَنَا سُفْيَانُ قَالَ سَمِعَ عَمْرٌو جَابِرًايَقُولُ فِي جَيْشِ الْخَبَطِ إِنَّ رَجُلًا نَحَرَ ثَلَاثَ جَزَائِرَ ثُمَّ ثَلَاثًا ثُمَّ نَهَاهُ أَبُو عُبَيْدَةَ",
                "id": "Dan telah menceritakan kepada kami ['Abdul Jabar bin Al 'Ala] telah mencerikan kepada kami [Sufyan] dia berkata; ['Amru] pernah mendengar [Jabir] berkata tentang Jaisul Khabath, \"Seorang laki-laki menyembelih tiga ekor unta kemudian menyembelih tiga unta lagi, setelah itu Abu 'Ubaidah melarangnya.\" "
            },
            {
                "number": 3339,
                "arab": "و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدَةُ يَعْنِي ابْنَ سُلَيْمَانَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ وَهْبِ بْنِ كَيْسَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَبَعَثَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ ثَلَاثُ مِائَةٍ نَحْمِلُ أَزْوَادَنَا عَلَى رِقَابِنَا",
                "id": "Dan telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami ['Abdah] -yaitu Ibnu Sulaiman- dari [Hisyam bin 'Urwah] dari [Wahb bin Kaisan] dari [Jabir bin Abdullah] dia berkata, \"Nabi shallallahu 'alaihi wasallam pernah mengirim kami dengan jumlah tiga ratus prajurit, dan kami membawa perbekalan di atas tunggangan kami.\""
            },
            {
                "number": 3340,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ أَبِي نُعَيْمٍ وَهْبِ بْنِ كَيْسَانَ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ أَخْبَرَهُ قَالَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً ثَلَاثَ مِائَةٍ وَأَمَّرَ عَلَيْهِمْ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ فَفَنِيَ زَادُهُمْ فَجَمَعَ أَبُو عُبَيْدَةَ زَادَهُمْ فِي مِزْوَدٍ فَكَانَ يُقَوِّتُنَا حَتَّى كَانَ يُصِيبُنَا كُلَّ يَوْمٍ تَمْرَةٌو حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا الْوَلِيدُ يَعْنِي ابْنَ كَثِيرٍ قَالَ سَمِعْتُ وَهْبَ بْنَ كَيْسَانَ يَقُولُ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُا بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً أَنَا فِيهِمْ إِلَى سِيفِ الْبَحْرِ وَسَاقُوا جَمِيعًا بَقِيَّةَ الْحَدِيثِ كَنَحْوِ حَدِيثِ عَمْرِو بْنِ دِينَارٍ وَأَبِي الزُّبَيْرِ غَيْرَ أَنَّ فِي حَدِيثِ وَهْبِ بْنِ كَيْسَانَ فَأَكَلَ مِنْهَا الْجَيْشُ ثَمَانِيَ عَشْرَةَ لَيْلَةً و حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو الْمُنْذِرِ الْقَزَّازُ كِلَاهُمَا عَنْ دَاوُدَ بْنِ قَيْسٍ عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْثًا إِلَى أَرْضِ جُهَيْنَةَ وَاسْتَعْمَلَ عَلَيْهِمْ رَجُلًا وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِهِمْ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Malik bin Anas] dari [Abu Nu'aim Wahb bin Kaisan] bahwa [Jabir bin Abdullah] telah mengabarkan kepadanya, dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengirim kami beserta tiga ratus prajurit yang dipimpin oleh Abu 'Ubaidah bin Jarrah. Ketika kehabisan bekal, maka Abu 'Ubaidah mengumpulkan perbekalan mereka dalam satu wadah, kemudian ia memberi makan kami dengan satu biji kurma setiap harinya.\" Dan telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami [Al Walid] -yaitu Ibnu Katsir- dia berkata; saya mendengar [Wahb bin Kaisan] berkata; saya mendengar [Jabir bin Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengirim pasukan untuk suatu ekspedisi, sedangkan kami termasuk dari tentara tersebut, hingga kami tiba di pantai… kemudian mereka melanjutkan hadits tersebut sebagaimana hadits 'Amru bin Dinar dan Abu Az Zubair, namun dalam hadits Wahb bin Kaisan disebutkan, 'Kemudian tentara tersebut makan (dari daging binatang itu) selama delapan belas hari.\" Dan telah menceritakan kepadaku [Hajjaj bin As Sya'ir] telah menceritakan kepada kami [Utsman bin 'Umar]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Abu Al Mundzir Al Qazzaz] keduanya dari [Daud bin Qais] dari ['ubaidhullah bin Miqsam] dari [Jabir bin Abdullah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengirim (pasukan) menuju negeri Juhainah dengan dipimpin oleh seorang laki-laki…kemudian dia melanjutkan hadits tersebut sebagaimana hadits mereka.\""
            },
            {
                "number": 3341,
                "arab": "و حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ كِلَاهُمَا عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَنَّ أَبَا إِدْرِيسَ أَخْبَرَهُ أَنَّ أَبَا ثَعْلَبَةَ قَالَحَرَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لُحُومَ الْحُمُرِ الْأَهْلِيَّةِ",
                "id": "Dan telah menceritakan kepada kami [Al Hasan bin 'Ali Al Hulwani] dan [Abd bin Humaid] keduanya dari [Ya'qub bin Ibrahim bin Sa'd] telah menceritakan kepada kami [ayahku] dari [Shalih] dari [Ibnu Shihab] bahwa [Abu Idris] telah mengabarkan kepadanya, bahwa [Abu Tsa'labah] telah berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang memakan daging keledai jinak.\""
            },
            {
                "number": 3342,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ حَدَّثَنِي نَافِعٌ وَسَالِمٌ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَكْلِ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami ['ubaidhullah] telah menceritakan kepadaku [Nafi'] dan [Salim] dari [Ibnu Umar], bahwa Rasulullah shallallahu 'alaihi wasallam melarang makan daging keledai jinak.\""
            },
            {
                "number": 3343,
                "arab": "و حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي نَافِعٌ قَالَ قَالَ ابْنُ عُمَرَ ح و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا أَبِي وَمَعْنُ بْنُ عِيسَى عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ الْحِمَارِ الْأَهْلِيِّ يَوْمَ خَيْبَرَ وَكَانَ النَّاسُ احْتَاجُوا إِلَيْهَا",
                "id": "Dan telah menceritakan kepadaku [Harun bin Abdullah] telah menceritakan kepada kami [Muhammad bin Bakar] telah menceritakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Nafi'] dia berkata; [Ibnu Umar] berkata; (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [ayahku] dan [Ma'n bin Isa] dari [Malik bin Anas] dari [Nafi'] dari [Ibnu Umar] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang makan daging keledai jinak pada waktu perang Khaibar, sebab ketika itu orang-orang membutuhkan keledai jinak (untuk mengangkut barang).\""
            },
            {
                "number": 3344,
                "arab": "و حَدَّثَنَا أَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ حَدَّثَنَا سُلَيْمَانُ الشَّيْبَانِيُّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى يَقُولُاأَصَابَتْنَا مَجَاعَةٌ لَيَالِيَ خَيْبَرَ فَلَمَّا كَانَ يَوْمُ خَيْبَرَ وَقَعْنَا فِي الْحُمُرِ الْأَهْلِيَّةِ فَانْتَحَرْنَاهَا فَلَمَّا غَلَتْ بِهَا الْقُدُورُ نَادَى مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ اكْفَئُوا الْقُدُورَ وَلَا تَأْكُلُوا مِنْ لُحُومِ الْحُمُرِ شَيْئًا قَالَ فَقَالَ نَاسٌ إِنَّمَا نَهَى عَنْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَنَّهَا لَمْ تُخَمَّسْ وَقَالَ آخَرُونَ نَهَى عَنْهَا أَلْبَتَّةَ",
                "id": "Dan telah menceritakan kepada kami [Abu Kamil Fudlail bin Husain] telah menceritakan kepada kami [Abdul Wahid yaitu Ibnu Ziyad] telah menceritakan kepada kami [Sulaiman As Syaibani] dia berkata; saya mendengar [Abdullah bin Abu Aufa] berkata, \"Ketika beberapa malam kami berada di Khaibar, kami pernah merasa sangat lapar, kemudian kami menangkap seekor keledai jinak dan menyembelihnya. Tatkala periuk kami telah mendidih, tiba-tiba seorang penyeru yang ternyata adalah utusan Rasulullah shallallahu 'alaihi wasallam berseru, katanya, \"Tumpahkanlah periuk kalian, dan janganlah kalian makan daging keledai sedikit pun.\" Abdullah bin Abu Aufa berkata, \"Kemudian orang-orang mengatakan bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang makan daging keledai sebab ia sangat langka. Sedangkan yang lain mengatakan bahwa beliau melarangnya secara qath'I (benar-benar dilarang).\""
            },
            {
                "number": 3345,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَدِيٍّ وَهُوَ ابْنُ ثَابِتٍ قَالَ سَمِعْتُ الْبَرَاءَ وَعَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى يَقُولَانِأَصَبْنَا حُمُرًا فَطَبَخْنَاهَا فَنَادَى مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اكْفَئُوا الْقُدُورَ",
                "id": "Telah menceritakan kepada kami ['Ubaidillah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari ['Adi] -yaitu Ibnu Tsabit- dia berkata; saya mendengar [Al Barra] dan [Abdullah bin Abu Aufa] keduanya berkata, \"Kami pernah menangkap seekor keledai dan hendak memasaknya, tiba-tiba seorang penyeru yang ternyata utusan Rasulullah shallallahu 'alaihi wasallam berkata, \"Tumpahkanlah periuk kalian.\""
            },
            {
                "number": 3346,
                "arab": "و حَدَّثَنَا أَبُو كُرَيْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَبُو كُرَيْبٍ حَدَّثَنَا ابْنُ بِشْرٍ عَنْ مِسْعَرٍ عَنْ ثَابِتِ بْنِ عُبَيْدٍ قَالَ سَمِعْتُ الْبَرَاءَ يَقُولُانُهِينَا عَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ",
                "id": "Dan telah menceritakan kepada kami [Abu Kuraib] dan [Ishaq bin Ibrahim], [Abu Kuraib] berkata; telah menceritakan kepada kami [Ibnu Bisyr] dari [Mis'ar] dari [Tsabit bin 'Ubaid] dia berkata; saya mendengar [Al Barra] berkata, \"Kami telah dilarang makan daging keledai jinak.\""
            },
            {
                "number": 3347,
                "arab": "و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ عَاصِمٍ عَنْ الشَّعْبِيِّ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُلْقِيَ لُحُومَ الْحُمُرِ الْأَهْلِيَّةِ نِيئَةً وَنَضِيجَةً ثُمَّ لَمْ يَأْمُرْنَا بِأَكْلِهِو حَدَّثَنِيهِ أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا حَفْصٌ يَعْنِي ابْنَ غِيَاثٍ عَنْ عَاصِمٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ",
                "id": "Dan telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Jarir] dari ['Ashim] dari [As Sya'bi] dari [Al Barra bin 'Azib] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk membuang daging keledai jinak yang kami masak, baik yang belum matang atau yang sudah matang, setelah itu beliau juga tidak memerintahkan kami untuk memakannya.\" Dan telah menceritakan kepadaku [Abu Sa'id Al Asyaj] telah menceritakan kepada kami [Hafsh] -yaitu Ibnu Ghiyats- dari ['Ashim] dengan sanad seperti ini.\""
            },
            {
                "number": 3348,
                "arab": "و حَدَّثَنِي أَحْمَدُ بْنُ يُوسُفَ الْأَزْدِيُّ حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي عَنْ عَاصِمٍ عَنْ عَامِرٍ عَنْ ابْنِ عَبَّاسٍ قَالَلَا أَدْرِي إِنَّمَا نَهَى عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَجْلِ أَنَّهُ كَانَ حَمُولَةَ النَّاسِ فَكَرِهَ أَنْ تَذْهَبَ حَمُولَتُهُمْ أَوْ حَرَّمَهُ فِي يَوْمِ خَيْبَرَ لُحُومَ الْحُمُرِ الْأَهْلِيَّةِ",
                "id": "Dan telah menceritakan kepadaku [Ahmad bin Yusuf Al Azdi] telah menceritakan kepada kami [Umar bin Hafsh bin Ghiyast] telah menceritakan kepada kami [Bapakku] dari [Ashim] dari [Amir] dari [Ibnu Abbas] ia berkata, \"Aku tidak tahu, Rasulullah shallallahu 'alaihi wasallam melarang dari memakannya apakah karena ia adalah alat transportasi sehingga beliau tidak ingin ia punah, atau beliau telah mengharamkannya pada hari khaibar (daging keledai jinak).\""
            },
            {
                "number": 3349,
                "arab": "و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَنَسٍ قَالَلَمَّا فَتَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْبَرَ أَصَبْنَا حُمُرًا خَارِجًا مِنْ الْقَرْيَةِ فَطَبَخْنَا مِنْهَا فَنَادَى مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا إِنَّ اللَّهَ وَرَسُولَهُ يَنْهَيَانِكُمْ عَنْهَا فَإِنَّهَا رِجْسٌ مِنْ عَمَلِ الشَّيْطَانِ فَأُكْفِئَتْ الْقُدُورُ بِمَا فِيهَا وَإِنَّهَا لَتَفُورُ بِمَا فِيهَا",
                "id": "Dan telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Ayyub] dari [Muhammad] dari [Anas] dia berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam menaklukkan Khaibar, kami menangkap keledai di luar kota lalu kami memasaknya. Tiba-tiba datang pesuruh Rasulullah shallallahu 'alaihi wasallam berseru, 'Perhatian! Sesungguhnya Allah dan Rasul-Nya melarang kalian semua memasak daging keledai, karena daging keledai itu najis, sesungguhnya itu termasuk perbuatan setan.' Maka salah seorang menumpahkan periuk sehingga isinya tertumpah.\""
            },
            {
                "number": 3350,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ الضَّرِيرُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَلَمَّا كَانَ يَوْمُ خَيْبَرَ جَاءَ جَاءٍ فَقَالَ يَا رَسُولَ اللَّهِ أُكِلَتْ الْحُمُرُ ثُمَّ جَاءَ آخَرُ فَقَالَ يَا رَسُولَ اللَّهِ أُفْنِيَتْ الْحُمُرُ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَا طَلْحَةَ فَنَادَى إِنَّ اللَّهَ وَرَسُولَهُ يَنْهَيَانِكُمْ عَنْ لُحُومِ الْحُمُرِ فَإِنَّهَا رِجْسٌ أَوْ نَجِسٌ قَالَ فَأُكْفِئَتْ الْقُدُورُ بِمَا فِيهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Minhal Ad Dlarir] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Hisyam bin Hasan] dari [Muhammad bin Sirin] dari [Anas bin Malik] dia berkata, \"Ketika penaklukan Khaibar, tiba-tiba seseorang datang seraya berkata, \"Wahai Rasulullah, daging keledai telah di makan!\" Tidak lama kemudian, datang lagi seseorang seraya berkata, \"Wahai Rasulullah, keledai hampir punah!\" Maka Rasulullah shallallahu 'alaihi wasallam memerintahkan Abu Thalhah, lalu dia menyeru, \"Sesungguhnya Allah dan Rasul-Nya melarang kalian memasak daging keledai, karena daging keledai itu najis termasuk perbuatan setan.\" Anas melanjutkan, \"Kemudian periuk-periuk yang ada di tumpahkan hingga isinya tertumpah.\""
            },
            {
                "number": 3351,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَأَبُو الرَّبِيعِ الْعَتَكِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ وَاللَّفْظُ لِيَحْيَى قَالَ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرَانِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ وَأَذِنَ فِي لُحُومِ الْخَيْلِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Abu Ar rabi' Al 'Ataki] dan [Qutaibah bin Sa'id] dan ini adalah lafadz Yahya, Yahya berkata; telah mengabarkan kepada kami, sedangkan yang dua mengatakan; telah menceritakan kepada kami [Hammad bin Ziad] dari ['Amru bin Dinar] dari [Muhammad bin Ali] dari [Jabir bin Abdullah], bahwa ketika perang Khaibar, Rasulullah shallallahu 'alaihi wasallam melarang makan daging keledai jinak dan membolehkan memakan daging kuda.\""
            },
            {
                "number": 3352,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُاأَكَلْنَا زَمَنَ خَيْبَرَ الْخَيْلَ وَحُمُرَ الْوَحْشِ وَنَهَانَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْحِمَارِ الْأَهْلِيِّو حَدَّثَنِيهِ أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ ح و حَدَّثَنِي يَعْقُوبُ الدَّوْرَقِيُّ وَأَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ قَالَا حَدَّثَنَا أَبُو عَاصِمٍ كِلَاهُمَا عَنْ ابْنِ جُرَيْجٍ بِهَذَا الْإِسْنَادِ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Abu Az Zubair] bahwa dia mendengar [Jabir bin Abdullah] berkata, \"Pada waktu perang Khaibar kami pernah memakan daging kuda dan keledai liar, dan Nabi shallallahu 'alaihi wasallam melarang kami makan daging keledai jinak.\" Dan telah menceritakan kepadaku [Abu At Thahir] telah mengabarkan kepada kami [Ibnu Wahb]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Ya'qub Ad Dauraqi] dan [Ahmad bin Utsman An Naufali] keduanya berkata; telah menceritakan kepada kami [Abu 'Ashim] keduanya dari [Ibnu Juraij] dengan sanad ini.\""
            },
            {
                "number": 3353,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي وَحَفْصُ بْنُ غِيَاثٍ وَوَكِيعٌ عَنْ هِشَامٍ عَنْ فَاطِمَةَ عَنْ أَسْمَاءَ قَالَتْنَحَرْنَا فَرَسًا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكَلْنَاهُو حَدَّثَنَاه يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ كِلَاهُمَا عَنْ هِشَامٍ بِهَذَا الْإِسْنَادِ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [ayahku] dan [Hafsh bin Ghiyats] dan [Waki'] dari [Hisyam] dari [Fatimah] dari [Asma] dia berkata, \"Kami pernah menyembelih seekor kuda pada zaman Rasulullah shallallahu 'alaihi wasallam, lalu kami memakan dagingnya.\" Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Mu'awiyah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Usamah] keduanya dari [Hisyam] dengan sanad ini.\""
            },
            {
                "number": 3354,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى وَيَحْيَى بْنُ أَيُّوبَ وَقُتَيْبَةُ وَابْنُ حُجْرٍ عَنْ إِسْمَعِيلَ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ أَنَّهُ سَمِعَ ابْنَ عُمَرَ يَقُولُاسُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الضَّبِّ فَقَالَ لَسْتُ بِآكِلِهِ وَلَا مُحَرِّمِهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dan [Yahya bin Ayyub] dan [Qutaibah] dan [Ibnu Hujr] dari [Isma'il], [Yahya bin Yahya] berkata; telah mengabarkan kepada kami [Isma'il bin Ja'far] dari [Abdullah bin Dinar] bahwa dia mendengar [Ibnu Umar] berkata, \"Nabi shallallahu 'alaihi wasallam pernah ditanya mengenai daging biawak, beliau menjawab: \"Saya tidak memakannya dan juga tidak mengharamkannya.\""
            },
            {
                "number": 3355,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَسَأَلَ رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ الضَّبِّ فَقَالَ لَا آكُلُهُ وَلَا أُحَرِّمُهُ",
                "id": "Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Muhammad bin Rumh] telah mengabarkan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar] dia berkata, \"Seorang laki-laki bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai makan daging biawak, beliau lalu menjawab: \"Saya tidak memakannya dan juga tidak mengharamkannya.\""
            },
            {
                "number": 3356,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَسَأَلَ رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ عَنْ أَكْلِ الضَّبِّ فَقَالَ لَا آكُلُهُ وَلَا أُحَرِّمُهُو حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ بِمِثْلِهِ فِي هَذَا الْإِسْنَادِ و حَدَّثَنَاه أَبُو الرَّبِيعِ وَقُتَيْبَةُ قَالَا حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ كِلَاهُمَا عَنْ أَيُّوبَ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ ح و حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ ح و حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا شُجَاعُ بْنُ الْوَلِيدِ قَالَ سَمِعْتُ مُوسَى بْنَ عُقْبَةَ ح و حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الْأَيْلِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي أُسَامَةُ كُلُّهُمْ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الضَّبِّ بِمَعْنَى حَدِيثِ اللَّيْثِ عَنْ نَافِعٍ غَيْرَ أَنَّ حَدِيثَ أَيُّوبَ أُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِضَبٍّ فَلَمْ يَأْكُلْهُ وَلَمْ يُحَرِّمْهُ وَفِي حَدِيثِ أُسَامَةَ قَالَ قَامَ رَجُلٌ فِي الْمَسْجِدِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] dia berkata, \"Seorang laki-laki bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang daging biawak saat beliau di atas mimbar. Beliau menjawab: \"Saya tidak memakannya dan juga tidak mengharamkannya.\" Dan telah menceritakan kepada kami [ubaidhullah bin Sa'id] telah menceritakan kepada kami [Yahya] dari [ubaidhullah] dengan sanad ini seperti hadits di atas.\" Dan telah menceritakan kepada kami [Abu Ar rabi'] dan [Qutaibah] keduanya berkata; telah menceritakan kepada kami [Hammad]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Isma'il] keduanya dari [Ayyub]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Malik bin Mighwal]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Harun bin Abdullah] telah mengabarkan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Syuja' bin Al Walid] dia berkata; saya mendengar [Musa bin 'Uqbah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Harun bin Sa'id Al Aili] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Usamah] semuanya dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam mengenai daging biawak, beliau tidak memakannya dan tidak pula mengharamkannya.\" Dan dalam haditsnya Usamah, dia menyebutkan, \"Seorang laki-laki berdiri dalam Masjid, sedangkan Rasulullah shallallahu 'alaihi wasallam berada di atas mimbar.\""
            },
            {
                "number": 3357,
                "arab": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ تَوْبَةَ الْعَنْبَرِيِّ سَمِعَ الشَّعْبِيَّ سَمِعَ ابْنَ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ مَعَهُ نَاسٌ مِنْ أَصْحَابِهِ فِيهِمْ سَعْدٌ وَأُتُوا بِلَحْمِ ضَبٍّ فَنَادَتْ امْرَأَةٌ مِنْ نِسَاءِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ لَحْمُ ضَبٍّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُوا فَإِنَّهُ حَلَالٌ وَلَكِنَّهُ لَيْسَ مِنْ طَعَامِيو حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ تَوْبَةَ الْعَنْبَرِيِّ قَالَ قَالَ لِي الشَّعْبِيُّ أَرَأَيْتَ حَدِيثَ الْحَسَنِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَاعَدْتُ ابْنَ عُمَرَ قَرِيبًا مِنْ سَنَتَيْنِ أَوْ سَنَةٍ وَنِصْفٍ فَلَمْ أَسْمَعْهُ رَوَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرَ هَذَا قَالَ كَانَ نَاسٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِمْ سَعْدٌ بِمِثْلِ حَدِيثِ مُعَاذٍ",
                "id": "Dan telah menceritakan kepada kami [ubaidhullah bin Mua'dz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari [Taubah Al 'Anbari] dia mendengar [Sya'bi] bahwa dia mendengar [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam bersama dengan para sahabatnya, termasuk di dalamnya adalah Sa'd. Lalu dihidangkan daging biawak untuk mereka, tiba-tiba seorang wanita dari isteri Nabi shallallahu 'alaihi wasallam menyeru, \"Itu adalah daging biawak.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Makanlah karena daging itu adalah halal, namun ia tidak dari makanan yang biasa saya makan.\" Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Taubah Al 'Anbari] dia berkata; [As Sya'bi] pernah berkata kepadaku, \"Bagaimana pendapatmu mengenai hadits Al Hasan dari Nabi shallallahu 'alaihi wasallam? Padahal saya pernah mendampingi [Ibnu Umar] kurang lebih dua tahun atau setahun setengah, namun saya tidak pernah mendengar dia meriwayatkan dari Nabi shallallahu 'alaihi wasallam selain hadits ini.\" Dia menjawab, \"Sekelompok orang dari sahabat Nabi shallallahu 'alaihi wasallam yang di antaranya adalah Sa'd…seperti hadits Mu'adz.\""
            },
            {
                "number": 3358,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَدَخَلْتُ أَنَا وَخَالِدُ بْنُ الْوَلِيدِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْتَ مَيْمُونَةَ فَأُتِيَ بِضَبٍّ مَحْنُوذٍ فَأَهْوَى إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ فَقَالَ بَعْضُ النِّسْوَةِ اللَّاتِي فِي بَيْتِ مَيْمُونَةَ أَخْبِرُوا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَا يُرِيدُ أَنْ يَأْكُلَ فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ فَقُلْتُ أَحَرَامٌ هُوَ يَا رَسُولَ اللَّهِ قَالَ لَا وَلَكِنَّهُ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ قَالَ خَالِدٌ فَاجْتَرَرْتُهُ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْظُرُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] berkata; saya telah bacakan di hadapan [Malik]; dari [Ibnu Syihab] dari [Abu Umamah bin Sahl bin Hunaif] dari [Abdullah bin Abbas] dia berkata, \"Saya dan Khalid bersama-sama dengan Rasulullah shallallahu 'alaihi wasallam datang ke rumah Maimunah, lalu dia menghidangkan kepada kami daging biawak yang telah dibakar, Rasulullah shallallahu 'alaihi wasallam lalu mengulurkan tangannya untuk mengambil daging tersebut, tiba-tiba sebagian dari wanita yang berada di rumah Maimunah berkata, \"Beritahukanlah kepada Rasulullah shallallahu 'alaihi wasallam tentang hidangan yang hendak dimakan oleh beliau.\" Karena itu, beliau menarik tangannya. Lantas saya bertanya, \"Apakah daging tersebut haram wahai Rasulullah?\" beliau menjawab: \"Tidak, tetapi karena ia tidak ada di negeri kaumku, maka saya merasa jijik untuk memakannya.\" Khalid berkata, \"Lalu saya ambil daging tersebut dan saya memakannya, sedangkan Rasulullah shallallahu 'alaihi wasallam melihat.\""
            },
            {
                "number": 3359,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ وَحَرْمَلَةُ جَمِيعًا عَنْ ابْنِ وَهْبٍ قَالَ حَرْمَلَةُ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ الْأَنْصَارِيِّ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ أَخْبَرَهُ أَنَّ خَالِدَ بْنَ الْوَلِيدِ الَّذِي يُقَالُ لَهُ سَيْفُ اللَّهِ أَخْبَرَهُأَنَّهُ دَخَلَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى مَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ خَالَتُهُ وَخَالَةُ ابْنِ عَبَّاسٍ فَوَجَدَ عِنْدَهَا ضَبًّا مَحْنُوذًا قَدِمَتْ بِهِ أُخْتُهَا حُفَيْدَةُ بِنْتُ الْحَارِثِ مِنْ نَجْدٍ فَقَدَّمَتْ الضَّبَّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ قَلَّمَا يُقَدَّمُ إِلَيْهِ طَعَامٌ حَتَّى يُحَدَّثَ بِهِ وَيُسَمَّى لَهُ فَأَهْوَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ إِلَى الضَّبِّ فَقَالَتْ امْرَأَةٌ مِنْ النِّسْوَةِ الْحُضُورِ أَخْبِرْنَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَا قَدَّمْتُنَّ لَهُ قُلْنَ هُوَ الضَّبُّ يَا رَسُولَ اللَّهِ فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ فَقَالَ خَالِدُ بْنُ الْوَلِيدِ أَحَرَامٌ الضَّبُّ يَا رَسُولَ اللَّهِ قَالَ لَا وَلَكِنَّهُ لَمْ يَكُنْ بِأَرْضِ قَوْمِي فَأَجِدُنِي أَعَافُهُ قَالَ خَالِدٌ فَاجْتَرَرْتُهُ فَأَكَلْتُهُ وَرَسُولُ اللَّهِ يَنْظُرُ فَلَمْ يَنْهَنِيو حَدَّثَنِي أَبُو بَكْرِ بْنُ النَّضْرِ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ عَبْدٌ أَخْبَرَنِي و قَالَ أَبُو بَكْرٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ أَخْبَرَهُ أَنَّ خَالِدَ بْنَ الْوَلِيدِ أَخْبَرَهُ أَنَّهُ دَخَلَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى مَيْمُونَةَ بِنْتِ الْحَارِثِ وَهِيَ خَالَتُهُ فَقُدِّمَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَحْمُ ضَبٍّ جَاءَتْ بِهِ أُمُّ حُفَيْدٍ بِنْتُ الْحَارِثِ مِنْ نَجْدٍ وَكَانَتْ تَحْتَ رَجُلٍ مِنْ بَنِي جَعْفَرٍ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَأْكُلُ شَيْئًا حَتَّى يَعْلَمَ مَا هُوَ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ يُونُسَ وَزَادَ فِي آخِرِ الْحَدِيثِ وَحَدَّثَهُ ابْنُ الْأَصَمِّ عَنْ مَيْمُونَةَ وَكَانَ فِي حَجْرِهَا و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ عَنْ ابْنِ عَبَّاسٍ قَالَ أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِي بَيْتِ مَيْمُونَةَ بِضَبَّيْنِ مَشْوِيَّيْنِ بِمِثْلِ حَدِيثِهِمْ وَلَمْ يَذْكُرْ يَزِيدَ بْنَ الْأَصَمِّ عَنْ مَيْمُونَةَ و حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنَا أَبِي عَنْ جَدِّي حَدَّثَنِي خَالِدُ بْنُ يَزِيدَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي هِلَالٍ عَنْ ابْنِ الْمُنْكَدِرِ أَنَّ أَبَا أُمَامَةَ بْنَ سَهْلٍ أَخْبَرَهُ عَنْ ابْنِ عَبَّاسٍ قَالَ أُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي بَيْتِ مَيْمُونَةَ وَعِنْدَهُ خَالِدُ بْنُ الْوَلِيدِ بِلَحْمِ ضَبٍّ فَذَكَرَ بِمَعْنَى حَدِيثِ الزُّهْرِيِّ",
                "id": "Dan telah menceritakan kepadaku [Abu At Thahir] dan [Harmalah] semuanya dari [Ibnu Wahb]. [Harmalah] mengatakan; telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu bin Syihab] dari [Abu Umamah bin Sahl bin Hunaif Al Anshari] bahwa [Abdullah bin Abbas] pernah mengabarkan kepadanya bahwa [Khalid bin Walid] yang di juluki dengan pedang Allah telah mengabarkan kepadanya; bahwa dia bersama dengan Rasulullah shallallahu 'alaihi wasallam pernah menemui Maimunah isteri Nabi shallallahu 'alaihi wasallam -dia adalah bibinya Khalid dan juga bibinya Ibnu Abbas- lantas dia mendapati daging biawak yang telah di bakar, kiriman dari saudara perempuanya yaitu Hufaidah binti Al Harits dari Najd, lantas daging Biawak tersebut disuguhkan kepada Rasulullah shallallahu 'alaihi wasallam. Sangat jarang beliau disuguhi makanan hingga beliau diberitahu nama makanan yang disuguhkan, ketika Rasulullah shallallahu 'alaihi wasallam hendak mengambil daging biawak tersebut, seorang wanita dari beberapa wanita yang ikut hadir berkata, \"Beritahukanlah kepada Rasulullah shallallahu 'alaihi wasallam mengenai daging yang kalian suguhkan!\" Kami lalu mengatakan, \"Itu adalah daging biawak, wahai Rasulullah!\" Seketika itu juga Rasulullah shallallahu 'alaihi wasallam mengangkat tangannya, Khalid bin Walid pun berkata, \"Wahai Rasulullah, apakah daging biawak itu haram?\" Beliau menjawab: \"Tidak, namun di negeri kaumku tidak pernah aku jumpai daging tersebut, maka aku enggan (memakannya).\" Khalid berkata, \"Lantas aku mendekatkan daging tersebut dan memakannya, sementara Rasulullah melihatku dan tidak melarangnya.\" Telah menceritakan kepadaku [Abu Bakr bin An Nadlr] dan [Abdurrahman bin Humaid], Abd berkata; telah mengabarkan kepadaku, dan Abu Bakr berkata; telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd] telah menceritakan kepada kami [Ayahku] dari [Shalih bin Kaisan] dari [Ibnu Syihab] dari [Abu Umamah bin Sahl] dari [Ibnu Abbas] dia mengabarkan kepadanya, bahwa [Khalid bin Walid] mengabarkan kepadanya, bahwa ia pernah bersama Rasulullah shallallahu 'alaihi wasallam masuk ke rumah Maimunah binti Al Harits -Maimunah adalah bibinya Khalid-, lalu Rasulullah shallallahu 'alaihi wasallam disuguhi daging biawak, hasil pemberian Ummu Hufaidl dari Najd, sementara Ummu Hufaidl adalah isteri seorang laki-laki bani Ja'far. Sudah menjadi kebiasaan Rasulullah shallallahu 'alaihi wasallam, beliau tidak mau menyantap hidangan hingga beliau mengetahui hidangan tersebut…kemudian perawi menyebutkan sebagaimana haditsnya Yunus. Dan ia menambahkan di akhir hadits. Dan telah menceritakan kepadanya [Ibnu Al Asham] dari [Maimunah], sedangkan ia (Ibnu Al Asham) termasuk dari anak asuhnya.\" Dan telah menceritakan kepada kami [Abd bin Humaid] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Umamah bin Sahl bin Hunaif] dari [Ibnu Abbas] dia berkata, \"Nabi shallallahu 'alaihi wasallam pernah disuguhi dua daging biawak panggang, ketika itu kami berada di rumah Maimunah…sebagaimana hadits mereka, namun ia tidak menyebutkan nama Yazid bin Al Asham dari Maimunah.\" Dan telah menceritakan kepada kami [Abdul Malik bin Syu'aib bin Al Laits] telah menceritakan kepada kami [Ayahku] dari [Kakekku] telah menceritakan kepadaku [Khalid bin Yazid] telah menceritakan kepadaku [Sa'id bin Abu Hilal] dari [Ibnu Al Munkadir] bahwa [Abu Umamah bin Sahl] telah mengabarkan kepadanya dari [Ibnu Abbas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah disuguhi daging biawak, ketika itu beliau tengah berada di rumah Maimunah, sedangkan di samping beliau ada Khalid bin Walid …lalu perawi menyebutkan hadits yang semakna dengan hadits Zuhri.\""
            },
            {
                "number": 3360,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَأَبُو بَكْرِ بْنُ نَافِعٍ قَالَ ابْنُ نَافِعٍ أَخْبَرَنَا غُنْدَرٌ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُاأَهْدَتْ خَالَتِي أَمُّ حُفَيْدٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمْنًا وَأَقِطًا وَأَضُبًّا فَأَكَلَ مِنْ السَّمْنِ وَالْأَقِطِ وَتَرَكَ الضَّبَّ تَقَذُّرًا وَأُكِلَ عَلَى مَائِدَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَوْ كَانَ حَرَامًا مَا أُكِلَ عَلَى مَائِدَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Basysyar] dan [Abu Bakar bin Nafi'], [Ibnu Nafi'] berkata; telah mengabarkan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dia berkata; saya mendengar [Ibnu Abbas] berkata, \"Bibiku, Ummu Hufaid, pernah menghadiahkan minyak samin, susu kering dan daging biawak kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau memakan minyak samin dan susu kering, dan meninggalkan daging biawak karena merasa jijik. Namun daging tersebut pernah dihidangkan (dimakan) di atas meja makan Rasulullah shallallahu 'alaihi wasallam, seandainya hal itu haram, tentu ia tidak akan terhidang (dimakan) di meja makan Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3361,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الشَّيْبَانِيِّ عَنْ يَزِيدَ بْنِ الْأَصَمِّ قَالَدَعَانَا عَرُوسٌ بِالْمَدِينَةِ فَقَرَّبَ إِلَيْنَا ثَلَاثَةَ عَشَرَ ضَبًّا فَآكِلٌ وَتَارِكٌ فَلَقِيتُ ابْنَ عَبَّاسٍ مِنْ الْغَدِ فَأَخْبَرْتُهُ فَأَكْثَرَ الْقَوْمُ حَوْلَهُ حَتَّى قَالَ بَعْضُهُمْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا آكُلُهُ وَلَا أَنْهَى عَنْهُ وَلَا أُحَرِّمُهُ فَقَالَ ابْنُ عَبَّاسٍ بِئْسَ مَا قُلْتُمْ مَا بُعِثَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مُحِلًّا وَمُحَرِّمًا إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَمَا هُوَ عِنْدَ مَيْمُونَةَ وَعِنْدَهُ الْفَضْلُ بْنُ عَبَّاسٍ وَخَالِدُ بْنُ الْوَلِيدِ وَامْرَأَةٌ أُخْرَى إِذْ قُرِّبَ إِلَيْهِمْ خُوَانٌ عَلَيْهِ لَحْمٌ فَلَمَّا أَرَادَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَأْكُلَ قَالَتْ لَهُ مَيْمُونَةُ إِنَّهُ لَحْمُ ضَبٍّ فَكَفَّ يَدَهُ وَقَالَ هَذَا لَحْمٌ لَمْ آكُلْهُ قَطُّ وَقَالَ لَهُمْ كُلُوا فَأَكَلَ مِنْهُ الْفَضْلُ وَخَالِدُ بْنُ الْوَلِيدِ وَالْمَرْأَةُ وَقَالَتْ مَيْمُونَةُ لَا آكُلُ مِنْ شَيْءٍ إِلَّا شَيْءٌ يَأْكُلُ مِنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ali bin Musyhir] dari [Asy Syaibani] dari [Yazid bin Al Asham] dia berkata, \"Kami pernah diundang pesta perkawinan ketika di Madinah, lalu dihidangkan kepada kami tiga belas ekor daging biawak, maka di antara kami ada yang memakannya dan ada pula yang tidak memakannya. Keesokan harinya saya mendatangi [Ibnu Abbas] dan memberitahukan kepadanya, sedangkan di samping dia ada sekelompok kaum, hingga sebagian kaum tersebut berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya tidak memakannya, tidak melarang dan mengharamkan untuk memakannya.\" Ibnu Abbas pun berkata, \"Sungguh jelek apa yang kalian katakan, Nabi shallallahu 'alaihi wasallam tidak diutus melainkan untuk menghalalkan atau mengharamkan. Ketika Rasulullah shallallahu 'alaihi wasallam di rumah Maimunah, sedangkan di sisi beliau ada Fadl bin Abbas, Khalid bin Walid dan seorang wanita, mereka disuguhi daging dalam tempayan besar, sewaktu Nabi shallallahu 'alaihi wasallam hendak memakannya, maka Maimunah berkata kepada beliau, \"Itu adalah daging biawak.\" Maka beliau pun menarik tangannya seraya bersabda: \"Saya belum pernah sama sekali memakan daging ini.\" Beliau juga bersabda kepada mereka (yang ada di situ): \"Makanlah daging tersebut.\" Maka Al Fadll dan Khalid serta seorang wanita pun memakannya. Maimunah juga berkata, \"Saya tidak akan memakan sesuatu melainkan jika Rasulullah shallallahu 'alaihi wasallam memakannya.\""
            },
            {
                "number": 3362,
                "arab": "و حَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا مَعْقِلٌ عَنْ أَبِي الزُّبَيْرِ قَالَ سَأَلْتُ جَابِرًا عَنْ الضَّبِّ فَقَالَ لَا تَطْعَمُوهُ وَقَذِرَهُ وَقَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يُحَرِّمْهُإِنَّ اللَّهَ عَزَّ وَجَلَّ يَنْفَعُ بِهِ غَيْرَ وَاحِدٍ فَإِنَّمَا طَعَامُ عَامَّةِ الرِّعَاءِ مِنْهُ وَلَوْ كَانَ عِنْدِي طَعِمْتُهُ",
                "id": "Dan telah menceritakan kepadaku [Salamah bin Syabib] telah menceritakan kepada kami [Al Hasan bin A'yan] telah menceritakan kepada kami [Ma'qil] dari [Abu Az Zubair] dia berkata, \"Saya bertanya kepada [Jabir] mengenai daging biawak, dia menjawab, \"Jangan memakannya, karena ia termasuk makanan yang menjijikkan.\" Dan dia juga berkata, \"Namun [Umar bin Khatthab] pernah berkata, \"Sesungguhnya Nabi shallallahu 'alaihi wasallam tidak mengharamkannya, dan dengannya Allah Azza Wa Jalla tidak hanya memberi manfa'at untuk satu jenis saja, hanyasanya ia adalah makanannya para pengembala, sekiranya ia ada di sini, niscaya saya telah memakannya.\""
            },
            {
                "number": 3363,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ دَاوُدَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنَّا بِأَرْضٍ مَضَبَّةٍ فَمَا تَأْمُرُنَا أَوْ فَمَا تُفْتِينَا قَالَ ذُكِرَ لِي أَنَّ أُمَّةً مِنْ بَنِي إِسْرَائِيلَ مُسِخَتْ فَلَمْ يَأْمُرْ وَلَمْ يَنْهَقَالَ أَبُو سَعِيدٍ فَلَمَّا كَانَ بَعْدَ ذَلِكَ قَالَ عُمَرُ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَيَنْفَعُ بِهِ غَيْرَ وَاحِدٍ وَإِنَّهُ لَطَعَامُ عَامَّةِ هَذِهِ الرِّعَاءِ وَلَوْ كَانَ عِنْدِي لَطَعِمْتُهُ إِنَّمَا عَافَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepadaku [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Daud] dari [Abu Nadlrah] dari [Abu Sa'id] dia berkata, \"Seorang laki-laki bertanya, \"Wahai Rasulullah, sesungguhnya saya hidup di negeri yang banyak biawaknya, maka apa kiranya yang anda perintahkan kepada kami?\" Atau, \"Berilah kami fatwa mengenainya!\" Beliau bersabda: 'Telah disebutkan kepadaku bahwa anak cucu Bani Israil telah dirubah bentuknya menjadi hewan.' Beliau tidak memerintahkan kami (memakannya) dan tidak pula melarangnya.\" [Abu Sa'id] berkata, \"Beberapa saat setelah itu, [Umar bin Khattab] berkata, \"Sungguh, dengannya Allah benar-benar memberi manfaat tidak hanya untuk satu golongan, dia adalah makanan kebanyakan para pengembala ini. Sekiranya daging tersebut ada di sini niscaya saya telah memakannya, Rasulullah shallallahu 'alaihi wasallam memberi keringanan untuk daging itu.\""
            },
            {
                "number": 3364,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي يَعْفُورٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى قَالَغَزَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبْعَ غَزَوَاتٍ نَأْكُلُ الْجَرَادَو حَدَّثَنَاه أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ وَابْنُ أَبِي عُمَرَ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ عَنْ أَبِي يَعْفُورٍ بِهَذَا الْإِسْنَادِ قَالَ أَبُو بَكْرٍ فِي رِوَايَتِهِ سَبْعَ غَزَوَاتٍ و قَالَ إِسْحَقُ سِتَّ و قَالَ ابْنُ أَبِي عُمَرَ سِتَّ أَوْ سَبْعَ و حَدَّثَنَاه مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ ح و حَدَّثَنَا ابْنُ بَشَّارٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ كِلَاهُمَا عَنْ شُعْبَةَ عَنْ أَبِي يَعْفُورٍ بِهَذَا الْإِسْنَادِ وَقَالَ سَبْعَ غَزَوَاتٍ",
                "id": "Telah menceritakan kepada kami [Abu Kamil Al Jahdari] telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Ya'fur] dari ['Abdullah bin Abu Aufa] dia berkata, \"Kami berperang bersama Rasulullah shallallahu 'alaihi wasallam dalam tujuh peperangan, di mana kami pernah memakan belalang.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Ishaq bin Ibrahim] dan [Ibnu Abu 'Umar] semunya dari [Ibnu 'Uyaianah] dari [Abu Ya'fur] dengan isnad ini. Abu Bakar menyebutkan dalam riwayatnya, \"Tujuh peperangan.\" Dan Ishaq menyebutkan, \"Enam peperangan.\" Dan Ibnu Umar menyebutkan, \"Enam atau tujuh peperangan.\" Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Ibnu Abu 'Adi]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Basysyar] dari [Muhammad bin Ja'far] keduanya dari [Syu'bah] dari [Abu Ya'fur] dengan isnad ini. Dia berkata, \"Tujuh kali.\""
            },
            {
                "number": 3365,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ هِشَامِ بْنِ زَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَمَرَرْنَا فَاسْتَنْفَجْنَا أَرْنَبًا بِمَرِّ الظَّهْرَانِ فَسَعَوْا عَلَيْهِ فَلَغَبُوا قَالَ فَسَعَيْتُ حَتَّى أَدْرَكْتُهَا فَأَتَيْتُ بِهَا أَبَا طَلْحَةَ فَذَبَحَهَا فَبَعَثَ بِوَرِكِهَا وَفَخِذَيْهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَيْتُ بِهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَبِلَهُو حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ ح و حَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ كِلَاهُمَا عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ وَفِي حَدِيثِ يَحْيَى بِوَرِكِهَا أَوْ فَخِذَيْهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Hisyam bin Zaid] dari [Anas bin Malik] dia berkata, \"Pada suatu ketika kami lewat di Marru Zhahran (nama tempat), tiba-tiba kami dikagetkan oleh seekor kelinci, lalu kami kejar kelinci tersebut sampai mereka kelelahan.\" Anas melanjutkan, \"Saya juga turut mengejarnya sampai dapat, lantas saya membawanya kepada Abu Thalhah, kemudian dia menyembelihnya dan mengirimkan kedua pahanya kepada Rasulullah shallallahu 'alaihi wasallam. Aku lalu membawanya ke hadapan Rasulullah shallallahu 'alaihi wasallam dan beliau pun menerimanya.\" Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Yahya bin Sa'id]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Yahya bin Habib] telah menceritakan kepada kami [Khalid] -yaitu Ibnu Al Harits- keduanya dari [Syu'bah] dengan isnad ini. Dan dalam hadits Yahya disebutkan, \"Dengan kedua pahanya.\""
            },
            {
                "number": 3366,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا كَهْمَسٌ عَنْ ابْنِ بُرَيْدَةَ قَالَرَأَى عَبْدُ اللَّهِ بْنُ الْمُغَفَّلِ رَجُلًا مِنْ أَصْحَابِهِ يَخْذِفُ فَقَالَ لَهُ لَا تَخْذِفْ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَكْرَهُ أَوْ قَالَ يَنْهَى عَنْ الْخَذْفِ فَإِنَّهُ لَا يُصْطَادُ بِهِ الصَّيْدُ وَلَا يُنْكَأُ بِهِ الْعَدُوُّ وَلَكِنَّهُ يَكْسِرُ السِّنَّ وَيَفْقَأُ الْعَيْنَ ثُمَّ رَآهُ بَعْدَ ذَلِكَ يَخْذِفُ فَقَالَ لَهُ أُخْبِرُكَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَكْرَهُ أَوْ يَنْهَى عَنْ الْخَذْفِ ثُمَّ أَرَاكَ تَخْذِفُ لَا أُكَلِّمُكَ كَلِمَةً كَذَا وَكَذَاحَدَّثَنِي أَبُو دَاوُدَ سُلَيْمَانُ بْنُ مَعْبَدٍ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا كَهْمَسٌ بِهَذَا الْإِسْنَادِ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz Al 'Anbari] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Kahmas] dari [Ibnu Buraidah] dia berkata, \" [Abdullah bin Mughafal] melihat seorang laki-laki dari sahabatnya sedang melempar (dengan ketapel). Lalu Abdullah berkata kepadanya, \"Janganlah kamu melempar! sebab Rasulullah shallallahu 'alaihi wasallam membenci hal itu -atau dia berkata-, beliau melarang melempar, karena hal itu tidak akan mematikan buruan dan tidak pula mengalahkan musuh, tetapi hal itu hanya bisa mematahkan gigi dan membutakan mata.\" Setelah itu Abdullah melihat laki-laki itu melempar lagi, lantas dia berkata kepadanya, \"Saya pernah memberitahukan kepadamu bahwa Rasulullah shallallahu 'alaihi wasallam membenci hal itu -atau melarang dari melempar-, kemudian saya lihat kamu melakukannya lagi. Sungguh, saya tidak akan mengatakan hal ini lagi seperti ini dan ini.\" Dan telah menceritakan kepadaku [Abu Daud Sulaiman bin Ma'bad] telah menceritakan kepada kami [Utsman bin Umar] telah mengabarkan kepada kami [Kahmas] dengan sanad seperti ini.\""
            },
            {
                "number": 3367,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ عُقْبَةَ بْنِ صُهْبَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَذْفِ قَالَ ابْنُ جَعْفَرٍ فِي حَدِيثِهِ وَقَالَ إِنَّهُ لَا يَنْكَأُ الْعَدُوَّ وَلَا يَقْتُلُ الصَّيْدَ وَلَكِنَّهُ يَكْسِرُ السِّنَّ وَيَفْقَأُ الْعَيْنَ و قَالَ ابْنُ مَهْدِيٍّ إِنَّهَا لَا تَنْكَأُ الْعَدُوَّ وَلَمْ يَذْكُرْ تَفْقَأُ الْعَيْنَ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] dan [Abdurrahman bin Mahdi] keduanya berkata; telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari ['Uqbah bin Shahban] dari [Abdullah bin Mughaffal] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang melempar (buruan dengan batu atau kerikil).\" Ibnu Ja'far menyebutkan dalam haditsnya, \"Sesungguhnya itu tidak dapat mengalahkan musuh dan tidak pula membunuh hewan buruan, itu hanya dapat mematahkan gigi dan membutakan mata.\" Dan Ibnu Mahdi menyebutkan, \"Hal itu tidak dapat mengalahkan musuh.\" Dan tidak menyebutkan, \"Membutakan mata.\""
            },
            {
                "number": 3368,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ أَيُّوبَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ أَنَّ قَرِيبًا لِعَبْدِ اللَّهِ بْنِ مُغَفَّلٍ خَذَفَ قَالَ فَنَهَاهُ وَقَالَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْخَذْفِ وَقَالَ إِنَّهَا لَا تَصِيدُ صَيْدًا وَلَا تَنْكَأُ عَدُوًّا وَلَكِنَّهَا تَكْسِرُ السِّنَّ وَتَفْقَأُ الْعَيْنَ قَالَ فَعَادَ فَقَالَ أُحَدِّثُكَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهُ ثُمَّ تَخْذِفُ لَا أُكَلِّمُكَ أَبَدًاو حَدَّثَنَاه ابْنُ أَبِي عُمَرَ حَدَّثَنَا الثَّقَفِيُّ عَنْ أَيُّوبَ بِهَذَا الْإِسْنَادِ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Isma'il bin Ulayyah] dari [Ayyub] dari [Sa'id bin Jubair], bahwa sahabat karib [Abdullah bin Mughaffal] sedang melempar, lantas dia melarang sahabatnya tersebut seraya berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam melarang ini (melempar dengan batu), beliau bersabda: \"Sesungguhnya itu tidak dapat membunuh hewan buruan dan tidak pula dapat mengalahkan musuh, ia hanya dapat mematahkan gigi dan membutakan mata.\" Sa'id bin Jubair berkata, \"Ketika sahabatnya tersebut mengulangi perbuatannya, maka Abdullah bin Mughaffal pun berkata, \"Aku sampaikan bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari perbuatan ini namun kamu masih mengulanginya lagi, sungguh aku tidak akan mengajakmu berbicara lagi!\" Dan telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [At Tsaqafi] dari [Ayyub] dengan isnad seperti ini.\""
            },
            {
                "number": 3369,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ ابْنُ عُلَيَّةَ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْأَشْعَثِ عَنْ شَدَّادِ بْنِ أَوْسٍ قَالَثِنْتَانِ حَفِظْتُهُمَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذَّبْحَ وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ فَلْيُرِحْ ذَبِيحَتَهُو حَدَّثَنَاه يَحْيَى بْنُ يَحْيَى حَدَّثَنَا هُشَيْمٌ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ نَافِعٍ حَدَّثَنَا غُنْدَرٌ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ سُفْيَانَ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ عَنْ مَنْصُورٍ كُلُّ هَؤُلَاءِ عَنْ خَالِدٍ الْحَذَّاءِ بِإِسْنَادِ حَدِيثِ ابْنِ عُلَيَّةَ وَمَعْنَى حَدِيثِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Isma'il bin 'Ulayyah] dari [Khalid Al Khaddza`] dari [Abu Qilabah] dari [Abu Al Asy'ats] dari [Syaddad bin Aus] dia berkata, \"Dua perkara yang selalu saya ingat dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya Allah telah mewajibkan supaya selalu bersikap baik terhadap setiap sesuatu, jika kamu membunuh maka bunuhlah dengan cara yang baik, jika kamu menyembelih maka sembelihlah dengan cara yang baik, tajamkan pisaumu dan senangkanlah hewan sembelihanmu.\" Dan telah menceritakan kepada kami [Yahya bin Yahya] telah menceritakan kepada kami [Husyaim]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Abdul Wahhab At Tsaqafi]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Bakar bin Nafi'] telah menceritakan kepada kami [Ghundar] telah menceritakan kepada kami [Syu'bah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abdullah bin Abdurrahman Ad Darimi] telah mengabarkan kepada kami [Muhammad bin Yusuf] dari [Sufyan]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Jarir] dari [Manshur] mereka semua dari [Khalid Al Khaddza`] dengan sanad dan makna yang sama dengan hadits Ibnu 'Ulayyah.\""
            },
            {
                "number": 3370,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ هِشَامَ بْنَ زَيْدِ بْنِ أَنَسِ بْنِ مَالِكٍ قَالَ دَخَلْتُ مَعَ جَدِّي أَنَسِ بْنِ مَالِكٍ دَارَ الْحَكَمِ بْنِ أَيُّوبَ فَإِذَا قَوْمٌ قَدْ نَصَبُوا دَجَاجَةً يَرْمُونَهَا قَالَفَقَالَ أَنَسٌ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُصْبَرَ الْبَهَائِمُو حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ ح و حَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ ح و حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو أُسَامَةَ كُلُّهُمْ عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dia berkata; saya mendengar [Hisyam bin Zaid bin Anas bin Malik] dia berkata, \"Saya bersama kakekku, [Anas bin Malik], datang ke rumah Al Hakam bin Ayyub, ternyata saya dapati kaum di sana menjadikan ayam sebagai sasaran memanah. Maka Anas berkata, \"Rasulullah shallallahu 'alaihi wasallam telah melarang menjadikan binatang sebagai sasaran memanah.\" Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Yahya bin Sa'id] dan [Abdurrahman bin Mahdi]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Yahya bin Habib] telah menceritakan kepada kami [Khalid bin Al Harits]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abu Usamah] mereka semua dari [Syu'bah] dengan isnad ini.\""
            },
            {
                "number": 3371,
                "arab": "و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَدِيٍّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَتَّخِذُوا شَيْئًا فِيهِ الرُّوحُ غَرَضًاو حَدَّثَنَاه مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ شُعْبَةَ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Dan telah menceritakan kepada kami [ubaidhullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari ['Adi] dari [Sa'id bin Jubair] dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mengambil sesuatu yang bernyawa sebagai sasaran (menembak).\" Dan telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Muhammad bin Ja'far] dan [Abdurrahman bin Mahdi] dari [Syu'bah] dengan isnad seperti ini.\""
            },
            {
                "number": 3372,
                "arab": "و حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ وَأَبُو كَامِلٍ وَاللَّفْظُ لِأَبِي كَامِلٍ قَالَا حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَمَرَّ ابْنُ عُمَرَ بِنَفَرٍ قَدْ نَصَبُوا دَجَاجَةً يَتَرَامَوْنَهَا فَلَمَّا رَأَوْا ابْنَ عُمَرَ تَفَرَّقُوا عَنْهَا فَقَالَ ابْنُ عُمَرَ مَنْ فَعَلَ هَذَا إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ مَنْ فَعَلَ هَذَا",
                "id": "Dan telah menceritakan kepada kami [Syaiban bin Farruh] dan [Abu Kamil] sedangkan lafadznya dari Abu Kamil, keduanya berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dia berkata, \"Ibnu Umar pernah melewati sekelompok orang yang menjadikan seekor ayam sebagai sasaran memanah, saat melihat Ibnu Umar maka mereka lari berpencar, lantas [Ibnu Umar] berkata, \"Siapakah yang melakukan hal ini? Sesungguhnya Rasulullah shallallahu 'alaihi wasallam melaknat orang yang melakukan hal ini.\""
            },
            {
                "number": 3373,
                "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا أَبُو بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ مَرَّ ابْنُ عُمَرَ بِفِتْيَانٍ مِنْ قُرَيْشٍ قَدْ نَصَبُوا طَيْرًا وَهُمْ يَرْمُونَهُ وَقَدْ جَعَلُوا لِصَاحِبِ الطَّيْرِ كُلَّ خَاطِئَةٍ مِنْ نَبْلِهِمْ فَلَمَّا رَأَوْا ابْنَ عُمَرَ تَفَرَّقُوافَقَالَ ابْنُ عُمَرَ مَنْ فَعَلَ هَذَا لَعَنْ اللَّهُ مَنْ فَعَلَ هَذَا إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ مَنْ اتَّخَذَ شَيْئًا فِيهِ الرُّوحُ غَرَضًا",
                "id": "Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Abu Bisyr] dari [Sa'id bi Jubair] dia berkata, \"Suatu ketika [Ibnu Umar] melewati beberapa pemuda orang Quraisy yang mengurung seekor burung untuk sasaran memanah. Mereka membayar kepada pemilik burung setiap panahan yang tidak mengena. Tatkala mereka melihat Ibnu Umar, mereka lari berpencar. Lantas Ibnu Umar berkata, \"Siapakah yang melakukan perbuatan ini? Allah telah melaknat orang yang melakukan hal ini. Sungguh, Rasulullah shallallahu 'alaihi wasallam mengutuk orang yang menjadikan makhluk bernyawa sebagai sasaran (menembak).\""
            },
            {
                "number": 3374,
                "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ ح و حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُانَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُقْتَلَ شَيْءٌ مِنْ الدَّوَابِّ صَبْرًا",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Abd bin Humaid] telah mengabarkan kepada kami [Muhammad bin Bakr] telah mengabarkan kepada kami [Ibnu Juraij]. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Harun bin Abdullah] telah menceritakan kepada kami [Hajjaj bin Muhammad] dia berkata; [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Abu Az Zubair] bahwa dia mendengar [Jabir bin Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang menjadikan binatang bernyawa sebagai sasaran (menembak).\""
            },
            {
                "number": 3375,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا الْأَسْوَدُ بْنُ قَيْسٍ ح و حَدَّثَنَاه يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ عَنْ الْأَسْوَدِ بْنِ قَيْسٍ حَدَّثَنِي جُنْدَبُ بْنُ سُفْيَانَ قَالَشَهِدْتُ الْأَضْحَى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَعْدُ أَنْ صَلَّى وَفَرَغَ مِنْ صَلَاتِهِ سَلَّمَ فَإِذَا هُوَ يَرَى لَحْمَ أَضَاحِيَّ قَدْ ذُبِحَتْ قَبْلَ أَنْ يَفْرُغَ مِنْ صَلَاتِهِ فَقَالَ مَنْ كَانَ ذَبَحَ أُضْحِيَّتَهُ قَبْلَ أَنْ يُصَلِّيَ أَوْ نُصَلِّيَ فَلْيَذْبَحْ مَكَانَهَا أُخْرَى وَمَنْ كَانَ لَمْ يَذْبَحْ فَلْيَذْبَحْ بِاسْمِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Al Aswad bin Qais]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abu Khaitsamah] dari [Al Aswad bin Qais] telah menceritakan kepadaku [Jundab bin Sufyan] dia berkata, \"Saya pernah ikut hadir sholat Idul adha bersama Rasulullah shallallahu 'alaihi wasallam, tidak lama setelah selesai sholat, beliau melihat daging kurban yang telah disembelih, maka beliau bersabda: \"Siapa yang menyembelih hewan kurban sebelum sholat, hendaknya ia mengulanginya sebagai gantinya. Dan siapa yang belum menyembelih hendaknya menyembelih dengan menyebut nama Allah.\""
            },
            {
                "number": 3376,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ سَلَّامُ بْنُ سُلَيْمٍ عَنْ الْأَسْوَدِ بْنِ قَيْسٍ عَنْ جُنْدَبِ بْنِ سُفْيَانَ قَالَشَهِدْتُ الْأَضْحَى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا قَضَى صَلَاتَهُ بِالنَّاسِ نَظَرَ إِلَى غَنَمٍ قَدْ ذُبِحَتْ فَقَالَ مَنْ ذَبَحَ قَبْلَ الصَّلَاةِ فَلْيَذْبَحْ شَاةً مَكَانَهَا وَمَنْ لَمْ يَكُنْ ذَبَحَ فَلْيَذْبَحْ عَلَى اسْمِ اللَّهِو حَدَّثَنَاه قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَابْنُ أَبِي عُمَرَ عَنْ ابْنِ عُيَيْنَةَ كِلَاهُمَا عَنْ الْأَسْوَدِ بْنِ قَيْسٍ بِهَذَا الْإِسْنَادِ وَقَالَا عَلَى اسْمِ اللَّهِ كَحَدِيثِ أَبِي الْأَحْوَصِ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Al Ahwash Sallam bin Sulaim] dari [Al Aswad bin Qais] dari [Jundab bin Sufyan] dia berkata, \"Saya pernah ikut sholat idul adha bersama Rasulullah shallallahu 'alaihi wasallam. Setelah beliau selesai sholat bersama orang-orang, beliau melihat ada seekor kambing yang telah disembelih, lantas beliau bersabda: \"Barangsiapa menyembelih sebelum sholat, hendaknya ia mengulangi sembelihannya lagi sebagai pengganti. Dan barangsiapa belum menyembelih hendaknya menyembelih dengan nama Allah.\" Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abu 'Awanah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Ibnu Abu Umar] dari [Ibnu 'Uyainah] keduanya dari [Al Aswad bin Qais] dengan isnad ini, keduanya menyebutkan, 'Atas nama Allah, ' seperti hadits Abu Al Ahwash.\""
            },
            {
                "number": 3377,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ الْأَسْوَدِ سَمِعَ جُنْدَبًا الْبَجَلِيَّ قَالَشَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى يَوْمَ أَضْحًى ثُمَّ خَطَبَ فَقَالَ مَنْ كَانَ ذَبَحَ قَبْلَ أَنْ يُصَلِّيَ فَلْيُعِدْ مَكَانَهَا وَمَنْ لَمْ يَكُنْ ذَبَحَ فَلْيَذْبَحْ بِاسْمِ اللَّهِحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari [Al Aswad] bahwa dia mendengar [Jundab Al Bajali] berkata, \"Saya pernah ikut sholat idul adha bersama Rasulullah shallallahu 'alaihi wasallam, kemudian beliau berkhutbah: \"Barangsiapa menyembelih sebelum sholat hendaknya ia mengulanginya, dan barangsiapa belum menyembelih hendaknya dengan menyebut nama Allah.\" Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basyar] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dengan isnad seperti ini.\""
            },
            {
                "number": 3378,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ عَنْ مُطَرِّفٍ عَنْ عَامِرٍ عَنْ الْبَرَاءِ قَالَضَحَّى خَالِي أَبُو بُرْدَةَ قَبْلَ الصَّلَاةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِلْكَ شَاةُ لَحْمٍ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ عِنْدِي جَذَعَةً مِنْ الْمَعْزِ فَقَالَ ضَحِّ بِهَا وَلَا تَصْلُحُ لِغَيْرِكَ ثُمَّ قَالَ مَنْ ضَحَّى قَبْلَ الصَّلَاةِ فَإِنَّمَا ذَبَحَ لِنَفْسِهِ وَمَنْ ذَبَحَ بَعْدَ الصَّلَاةِ فَقَدْ تَمَّ نُسُكُهُ وَأَصَابَ سُنَّةَ الْمُسْلِمِينَ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Khalid bin Abdullah] dari [Mutharif] dari ['Amir] dari [Al Barra`] dia berkata, \"Pamanku, Abu Burdah, pernah menyembelih sebelum melaksanakan sholat idul adha, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Itu adalah kambing yang disembelih untuk dagingnya.\" Pamanku berkata, \"Ya Rasulullah, aku punya memiliki seekor kambing muda.\" Beliau bersabda: \"Sembelihlah, dan ini hanya khusus kamu bukan untuk yang lain.\" Kemudian beliau melanjutkan sabdanya: \"Barangsiapa berkurban sebelum sholat (idul adha), dia hanya menyembelih untuk dirinya sendiri, dan barangsiapa menyembelih setelah sholat (idul adha), maka sempurnalah ibadahnya dan dia telah melaksanakan sunnah kaum Muslimin dengan tepat.\""
            },
            {
                "number": 3379,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا هُشَيْمٌ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ عَنْ الْبَرَاءِ بْنِ عَازِبٍأَنَّ خَالَهُ أَبَا بُرْدَةَ بْنَ نِيَارٍ ذَبَحَ قَبْلَ أَنْ يَذْبَحَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ هَذَا يَوْمٌ اللَّحْمُ فِيهِ مَكْرُوهٌ وَإِنِّي عَجَّلْتُ نَسِيكَتِي لِأُطْعِمَ أَهْلِي وَجِيرَانِي وَأَهْلَ دَارِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعِدْ نُسُكًا فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ عِنْدِي عَنَاقَ لَبَنٍ هِيَ خَيْرٌ مِنْ شَاتَيْ لَحْمٍ فَقَالَ هِيَ خَيْرُ نَسِيكَتَيْكَ وَلَا تَجْزِي جَذَعَةٌ عَنْ أَحَدٍ بَعْدَكَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ دَاوُدَ عَنْ الشَّعْبِيِّ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ فَقَالَ لَا يَذْبَحَنَّ أَحَدٌ حَتَّى يُصَلِّيَ قَالَ فَقَالَ خَالِي يَا رَسُولَ اللَّهِ إِنَّ هَذَا يَوْمٌ اللَّحْمُ فِيهِ مَكْرُوهٌ ثُمَّ ذَكَرَ بِمَعْنَى حَدِيثِ هُشَيْمٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Husyaim] dari [Daud] dari [Asy Sya'bi] dari [Al Barra` bin 'Azib], bahwa pamannya, Abu Burdah bin Niyar, telah menyembelih hewan kurban sebelum Nabi shallallahu 'alaihi wasallam berkurban, maka dia berkata, \"Wahai Rasulullah, sesungguhnya hari ini adalah hari dibagikannya daging (kurban), dan hari makan-makan. Oleh karena itu, saya berkeinginan untuk berkurban lebih dahulu supaya saya dapat memberi makan keluarga dan para tetanggaku.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ulangilah kurbanmu.\" Dia berkata, \"Wahai Rasulullah, sesungguhnya saya memiliki kambing yang belum cukup umur, dan dia lebih baik daripada dua ekor kambing.\" Beliau menjawab: \"Itu adalah sebaik-baik kurban yang kamu lakukan, dan jangan sampai ada lagi orang yang berkurban dengan Jad'ah setelah kamu.\" Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Ibn Abu 'Adi] dari [Daud] dari [As Sya'bi] dari [Al Barra` bin 'Azib] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah berkhutbah pada hari raya Qurban, lalu beliau bersabda: \"Janganlah salah seorang dari kalian berkurban hingga selesai sholat.\" Barra` berkata, \"Lantas pamanku berkata, \"Wahai Rasulullah, sesungguhnya hari ini adalah hari dibagikannya daging kurban, dan hari makan-makan…, kemudian dia menyebutkan hadits yang serupa dengan hadits Husyaim.\""
            },
            {
                "number": 3380,
                "arab": "و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ ح و حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا زَكَرِيَّاءُ عَنْ فِرَاسٍ عَنْ عَامِرٍ عَنْ الْبَرَاءِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى صَلَاتَنَا وَوَجَّهَ قِبْلَتَنَا وَنَسَكَ نُسُكَنَا فَلَا يَذْبَحْ حَتَّى يُصَلِّيَ فَقَالَ خَالِي يَا رَسُولَ اللَّهِ قَدْ نَسَكْتُ عَنْ ابْنٍ لِي فَقَالَ ذَاكَ شَيْءٌ عَجَّلْتَهُ لِأَهْلِكَ فَقَالَ إِنَّ عِنْدِي شَاةً خَيْرٌ مِنْ شَاتَيْنِ قَالَ ضَحِّ بِهَا فَإِنَّهَا خَيْرُ نَسِيكَةٍ",
                "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdullah bin Numair]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Zakaria] dari [Firas] dari ['Amir] dari [Al Barra`] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa sholat sebagaimana sholat kami dengan menghadapkan kiblat kami dan beribadah sebagaimana ibadah kami, hendaknya ia tidak menyembelih hewan kurban hingga ia selesai sholat.\" Lantas pamanku berkata, \"Wahai Rasulullah, saya telah menyembelih dari binatang kurban milik puteraku.\" Beliau bersabda: \"Itu adalah sesuatu yang kamu segerakan untuk keluargamu.\" Pamanku berkata, \"Namun saya masih memliki seekor kambing yang lebih baik daripada dua ekor kambing.\" Beliau bersabda: \"Sembelihlah ia, karena ia termasuk dari sebaik-baik ibadah.\""
            },
            {
                "number": 3381,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ زُبَيْدٍ الْإِيَامِيِّ عَنْ الشَّعْبِيِّ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَوَّلَ مَا نَبْدَأُ بِهِ فِي يَوْمِنَا هَذَا نُصَلِّي ثُمَّ نَرْجِعُ فَنَنْحَرُ فَمَنْ فَعَلَ ذَلِكَ فَقَدْ أَصَابَ سُنَّتَنَا وَمَنْ ذَبَحَ فَإِنَّمَا هُوَ لَحْمٌ قَدَّمَهُ لِأَهْلِهِ لَيْسَ مِنْ النُّسُكِ فِي شَيْءٍ وَكَانَ أَبُو بُرْدَةَ بْنُ نِيَارٍ قَدْ ذَبَحَ فَقَالَ عِنْدِي جَذَعَةٌ خَيْرٌ مِنْ مُسِنَّةٍ فَقَالَ اذْبَحْهَا وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ زُبَيْدٍ سَمِعَ الشَّعْبِيَّ عَنْ الْبَرَاءِ بْنِ عَازِبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَهَنَّادُ بْنُ السَّرِيِّ قَالَا حَدَّثَنَا أَبُو الْأَحْوَصِ ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ جَرِيرٍ كِلَاهُمَا عَنْ مَنْصُورٍ عَنْ الشَّعْبِيِّ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ بَعْدَ الصَّلَاةِ ثُمَّ ذَكَرَ نَحْوَ حَدِيثِهِمْ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Ibnu Basyar] sedangkan lafadznya dari Ibnu Mutsanna, keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Zubaid Al Iyyami] dari [As Sya'bi] dari [Al Barra` bin 'Azib] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pekerjaan yang mula-mula kita lakukan hari ini ialah sholat. Sesudah sholat, kita pulang lalu menyembelih kurban. Siapa yang melakukan seperti itu, sesungguhnya dia melaksanakan sunnahku dengan tepat. Namun siapa menyembelih kurban sebelum sholat ied, itu hanya merupakan daging yang biasa diberikan kepada keluarganya, dan tidak merupakan kurban sama sekali.\" Ketika itu Abu Burdah bin Niyar telah menyembelih hewan kurban, lalu dia berkata, \"saya memiliki seekor kambing muda yang lebih baik dari kambing biasa.\" Lantas beliau bersabda: \"Sembelihlah ia, dan jangan sampai ada lagi orang yang menyembelih Jad'ah setelahmu.\" Dan telah menceritakan kepada kami ['ubaidhullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari [Zubaid] bahwa dia mendengar [Sya'bi] dari [Al Barra` bin 'Azib] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas.\" Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Hannad bin As Sarri] keduanya berkata; telah menceritakan kepada kami [Abu Al Ahwash]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Ishaq bin Ibrahim] semuanya dari [Jarir] keduanya dari [Manshur] dari [As Sya'bi] dari [Al Barra` bin 'Azib] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah berkhutbah pada hari raya kurban setelah melakukan sholat…kemudian dia menyebutkan sebagaimana hadits mereka.\""
            },
            {
                "number": 3382,
                "arab": "و حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ حَدَّثَنَا أَبُو النُّعْمَانِ عَارِمُ بْنُ الْفَضْلِ حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ عَنْ الشَّعْبِيِّ حَدَّثَنِي الْبَرَاءُ بْنُ عَازِبٍ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي يَوْمِ نَحْرٍ فَقَالَ لَا يُضَحِّيَنَّ أَحَدٌ حَتَّى يُصَلِّيَ قَالَ رَجُلٌ عِنْدِي عَنَاقُ لَبَنٍ هِيَ خَيْرٌ مِنْ شَاتَيْ لَحْمٍ قَالَ فَضَحِّ بِهَا وَلَا تَجْزِي جَذَعَةٌ عَنْ أَحَدٍ بَعْدَكَ",
                "id": "Dan telah menceritakan kepadaku [Ahmad bin Sa'id bin Shakhr Ad Darimi] telah menceritakan kepada kami [Abu Nu'man 'Arim bin Al Fadl] telah menceritakan kepada kami [Abdul Wahid] -yaitu Ibnu Ziyad- telah menceritakan kepada kami ['Ashim Al Ahwal] dari [As Sya'bi] telah menceritakan kepadaku [Al Barra` bin 'Azib] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah berkhutbah pada hari idul adha, sabdanya: \"Janganlah salah seorang dari kalian menyembelih hewan kurban hingga selesai sholat (ied).\" Lantas seorang laki-laki berkata, \"Saya memiliki kambing dewasa yang lebih bagus dari pada dua ekor kambing biasa.\" Beliau bersabda: \"Berkurbanlah dengannya, dan setelahmu tidak boleh lagi seseorang berkurban dengan Jad'ah (kambing usia enam bulan sampai satu tahun).\""
            },
            {
                "number": 3383,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سَلَمَةَ عَنْ أَبِي جُحَيْفَةَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَذَبَحَ أَبُو بُرْدَةَ قَبْلَ الصَّلَاةِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبْدِلْهَا فَقَالَ يَا رَسُولَ اللَّهِ لَيْسَ عِنْدِي إِلَّا جَذَعَةٌ قَالَ شُعْبَةُ وَأَظُنُّهُ قَالَ وَهِيَ خَيْرٌ مِنْ مُسِنَّةٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْعَلْهَا مَكَانَهَا وَلَنْ تَجْزِيَ عَنْ أَحَدٍ بَعْدَكَو حَدَّثَنَاه ابْنُ الْمُثَنَّى حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَبُو عَامِرٍ الْعَقَدِيُّ حَدَّثَنَا شُعْبَةُ بِهَذَا الْإِسْنَادِ وَلَمْ يَذْكُرْ الشَّكَّ فِي قَوْلِهِ هِيَ خَيْرٌ مِنْ مُسِنَّةٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad] -yaitu Ibnu Ja'far- telah menceritakan kepada kami [Syu'bah] dari [Salamah] dari [Abu Juhaifah] dari [Al Barra` bin 'Azib] dia berkata, \"Abu Burdah pernah menyembelih hewan kurban sebelum sholat (Ied), lantas Nabi shallallahu 'alaihi wasallam bersabda: \"Gantilah (berkurbanlah lagi).\" Dia berkata, \"Wahai Rasulullah, saya tidak memiliki lagi selain Jad'ah (kambing usia enam bulan sampai setahun)!\" Syu'bah berkata, \"Menurutku dia juga mengatakan: \"Dan dia lebih bagus daripada musinnah (kambing usia satu tahun lebih).\" Lantas Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sembelihlah ia sebagai ganti (dari kurbanmu), dan tidak boleh untuk orang setelahmu.\" Dan telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepadaku [Wahb bin Jarir]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Abu 'Amir Al 'Aqadi] telah menceritakan kepada kami [Syu'bah] dengan isnad ini, namun dia tidak menyebutkan akan adanya keraguan dalam perkataannya yaitu, \"Ia lebih baik daripada musinnah (kambing yang berusia satu tahun lebih).\""
            },
            {
                "number": 3384,
                "arab": "و حَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ جَمِيعًا عَنْ ابْنِ عُلَيَّةَ وَاللَّفْظُ لِعَمْرٍو قَالَ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ مَنْ كَانَ ذَبَحَ قَبْلَ الصَّلَاةِ فَلْيُعِدْ فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ هَذَا يَوْمٌ يُشْتَهَى فِيهِ اللَّحْمُ وَذَكَرَ هَنَةً مِنْ جِيرَانِهِ كَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَّقَهُ قَالَ وَعِنْدِي جَذَعَةٌ هِيَ أَحَبُّ إِلَيَّ مِنْ شَاتَيْ لَحْمٍ أَفَأَذْبَحُهَا قَالَ فَرَخَّصَ لَهُ فَقَالَ لَا أَدْرِي أَبَلَغَتْ رُخْصَتُهُ مَنْ سِوَاهُ أَمْ لَا قَالَ وَانْكَفَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى كَبْشَيْنِ فَذَبَحَهُمَا فَقَامَ النَّاسُ إِلَى غُنَيْمَةٍ فَتَوَزَّعُوهَا أَوْ قَالَ فَتَجَزَّعُوهَاحَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا أَيُّوبُ وَهِشَامٌ عَنْ مُحَمَّدٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى ثُمَّ خَطَبَ فَأَمَرَ مَنْ كَانَ ذَبَحَ قَبْلَ الصَّلَاةِ أَنْ يُعِيدَ ذِبْحًا ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ و حَدَّثَنِي زِيَادُ بْنُ يَحْيَى الْحَسَّانِيُّ حَدَّثَنَا حَاتِمٌ يَعْنِي ابْنَ وَرْدَانَ حَدَّثَنَا أَيُّوبُ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أَضْحًى قَالَ فَوَجَدَ رِيحَ لَحْمٍ فَنَهَاهُمْ أَنْ يَذْبَحُوا قَالَ مَنْ كَانَ ضَحَّى فَلْيُعِدْ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِهِمَا",
                "id": "Dan telah menceritakan kepadaku [Yahya bin Ayyub] dan ['Amru An Naqid] serta [Zuhair bin Harb] semuanya dari [Ibnu 'Ulayyah] sedangkan lafadznya dari Amru, dia berkata; telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Ayyub] dari [Muhammad] dari [Anas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda pada hari idul adha: \"Barangsiapa menyembelih hewan kurban sebelum sholat Ied, hendaknya ia mengulanginya lagi.\" Tiba-tiba seorang laki-laki berdiri seraya berkata, \"Wahai Rasulullah, bukannya ini adalah hari-hari dibagikannya daging kurban!\" Kemudian menyebutkan kebutuhan tetangganya akan daging, dan seakan Rasulullah shallallahu 'alaihi wasallam pun membenarkannya.\" Laki-laki itu berkata, \"Saya memiliki Jad'ah yang lebih saya sukai dari pada dua ekor kambing biasa, maka apakah saya harus menyembelihnya?\" Anas berkata, \"Maka beliau memberi keringanan kepadanya (untuk berkurban dengan Jad'ah).\" Anas berkata, \"Saya tidak tahu, apakah keringanan tersebut khusus untuk dirinya atau untuk yang lain juga.\" Anas berkata lagi, \"Kemudian Rasulullah shallallahu 'alaihi wasallam kembali menuju dua ekor kambing dan menyembelihnya, maka orang-orang sama mengambil kambingnya masing-masing, setelah itu mereka membagi-bagikan dagingnya.\" Telah menceritakan kepada kami [Muhammad bin 'Ubaid Al 'Ubari] telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Ayyub] dan [Hisyam] dari [Muhammad] dari [Anas bin Malik], bahwa Rasulullah shallallahu 'alaihi wasallam sholat kemudian berkhutbah, lalu beliau memerintahkan bagi siapa yang telah berkurban sebelum sholat ied, untuk mengulangi kurbannya…kemudian dia menyebutkan seperti hadits Ibnu 'Ulayyah.\" Dan telah menceritakan kepadaku [Ziyad bin Yahya Al Hassani] telah menceritakan kepada kami [Hatim] -yaitu Ibnu Wardan- telah menceritakan kepada kami [Ayyub] dari [Muhammad bin Sirin] dari [Anas bin Malik] dia berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam sedang berkhutbah pada hari raya adha, tiba-tiba beliau mencium bau daging (yang baru disembelih), maka beliau melarang mereka untuk menyembelih terlebih dahulu, sabdanya: \"Barang siapa terlanjur berkurban, hendaknya ia mengulangi kurbannya..., kemudian dia menyebutkan seperti hadits keduanya.\" "
            },
            {
                "number": 3385,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَذْبَحُوا إِلَّا مُسِنَّةً إِلَّا أَنْ يَعْسُرَ عَلَيْكُمْ فَتَذْبَحُوا جَذَعَةً مِنْ الضَّأْنِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kamu sembelih hewan untuk berkurban, melainkan hewan yang telah dewasa (Musinnah). Jika itu sulit kamu peroleh, sebelihlah jadz'ah.\" "
            },
            {
                "number": 3386,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُاصَلَّى بِنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ بِالْمَدِينَةِ فَتَقَدَّمَ رِجَالٌ فَنَحَرُوا وَظَنُّوا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ نَحَرَ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ نَحَرَ قَبْلَهُ أَنْ يُعِيدَ بِنَحْرٍ آخَرَ وَلَا يَنْحَرُوا حَتَّى يَنْحَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Muhammad bin Bakar] telah mengabarkan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Abu Az Zubair] bahwa dia mendengar [Jabir bin Abdullah] berkata, \"Nabi shallallahu 'alaihi wasallam pernah sholat idul adha bersama kami di Madinah, lalu para laki-laki menyembelih (hewan kurban), sebab mereka menyangka bahwa Nabi shallallahu 'alaihi wasallam telah menyembelih (hewan kurban). Nabi shallallahu 'alaihi wasallam kemudian memerintahkan bagi mereka yang telah menyembelih sebelum sholat untuk mengulangi kurbannya, dan mereka tidak menyembelihnya hingga Nabi shallallahu 'alaihi wasallam menyembelihnya terlebih dahulu.\""
            },
            {
                "number": 3387,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِى حَبِيبٍ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ بْنِ عَامِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَاهُ غَنَمًا يَقْسِمُهَا عَلَى أَصْحَابِهِ ضَحَايَا فَبَقِيَ عَتُودٌ فَذَكَرَهُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ضَحِّ بِهِ أَنْتَ قَالَ قُتَيْبَةُ عَلَى صَحَابَتِهِ",
                "id": "Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits]. (dalam jalur lain disebtkan) Telah menceritakan kepada kami [Muhammad bin Rumh] telah mengabarkan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari [Abu Al Khair] dari ['Uqbah bin 'Amir], bahwa Rasulullah shallallahu 'alaihi wasallam pernah memberikan kambing kepadanya supaya dia membagikannya kepada para sahabatnya. Setelah itu tidak ada yang tersisa melainkan seekor kambing yang masih muda, lantas dia memberitahukannya kepada Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Berkurbanlah dengannya.\" Qutaibah menyebutkan, \"Atas para sahabatnya.\""
            },
            {
                "number": 3388,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ هِشَامٍ الدَّسْتَوَائِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ بَعْجَةَ الْجُهَنِيِّ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ قَالَقَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِينَا ضَحَايَا فَأَصَابَنِي جَذَعٌ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّهُ أَصَابَنِي جَذَعٌ فَقَالَ ضَحِّ بِهِو حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ حَسَّانَ أَخْبَرَنَا مُعَاوِيَةُ وَهُوَ ابْنُ سَلَّامٍ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ أَخْبَرَنِي بَعْجَةُ بْنُ عَبْدِ اللَّهِ أَنَّ عُقْبَةَ بْنَ عَامِرٍ الْجُهَنِيَّ أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَسَمَ ضَحَايَا بَيْنَ أَصْحَابِهِ بِمِثْلِ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Yazid bin Harun] dari [Hisyam Ad Datawa`i] dari [Yahya bin Abu Katsir] dari [Ba'jah Al Juhani] dari ['Uqbah bin 'Amir Al Juhani] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah membagi-bagikan hewan kurban kepada kami. Saya mendapat seekor kambing muda. Lalu kukatakan kepada Rasulullah shallallahu 'alaihi wasallam, \"Wahai Rasulullah, saya mendapat kambing muda!\" Beliau bersabda: \"Berkurbanlah dengan itu!\" Dan telah menceritakan kepadaku [Abdullah bin Abdurrahman Ad Darimi] telah menceritakan kepada kami [Yahya] -yaitu Ibnu Hasan- telah mengabarkan kepada kami [Mu'awiyah] -yaitu Ibnu Sallam- telah menceritakan kepadaku [Yahya bin Abu Katsir] telah mengabarkan kepadaku [Ba'jah bin Abdullah] bahwa ['Uqbah bin 'Amir Al Juhani] mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam pernah membagi-bagikan hewan kurban untuk para sahabatnya, sebagaimana makna hadits di atas.\""
            },
            {
                "number": 3389,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَضَحَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ ذَبَحَهُمَا بِيَدِهِ وَسَمَّى وَكَبَّرَ وَوَضَعَ رِجْلَهُ عَلَى صِفَاحِهِمَا",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Anas] dia berkata; Nabi shallallahu 'alaihi wasallam pernah berkurban dengan dua domba putih yang bertanduk, beliau menyembelih dengan tangannya sendiri sambil menyebut (nama Allah) dan bertakbir, dengan meletakkan kaki beliau dekat pangkal leher domba tersebut.\""
            },
            {
                "number": 3390,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَكِيعٌ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ قَالَ وَرَأَيْتُهُ يَذْبَحُهُمَا بِيَدِهِ وَرَأَيْتُهُ وَاضِعًا قَدَمَهُ عَلَى صِفَاحِهِمَا قَالَ وَسَمَّى وَكَبَّرَو حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي قَتَادَةُ قَالَ سَمِعْتُ أَنَسًا يَقُولُا ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ قَالَ قُلْتُ آنْتَ سَمِعْتَهُ مِنْ أَنَسٍ قَالَ نَعَمْ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ وَيَقُولُ بِاسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Waki'] dari [Syu'bah] dari [Qatadah] dari [Anas] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah berkurban dua ekor domba putih yang bertanduk.\" Anas melanjutkan, \"Saya melihat beliau menyembelih keduanya dengan tangan beliau sendiri sambil membaca basmalah dan takbir, dan dengan menginjakkan kaki di pangkal leher domba itu.\" Dan telah menceritakan kepada kami [Yahya bin Habib] telah menceritakan kepada kami [Khalid] -yaitu Ibnu Al Harits- telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepadaku [Qatadah] dia berkata; saya mendengar [Anas] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah berkurban...seperti hadits di atas.\" Syu'bah berkata, \"Lalu saya bertanya, \"Apakah kamu sendiri yang mendengar dari Anas?\" dia menjawab, \"Ya.\" Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Sa'id] dari [Qatadah] dari [Anas] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas, namun dia menyebutkan, \"Dengan mengucapkan bisimillah dan Allhu akbar.\""
            },
            {
                "number": 3391,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ قَالَ حَيْوَةُ أَخْبَرَنِي أَبُو صَخْرٍ عَنْ يَزِيدَ بْنِ قُسَيْطٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِكَبْشٍ أَقْرَنَ يَطَأُ فِي سَوَادٍ وَيَبْرُكُ فِي سَوَادٍ وَيَنْظُرُ فِي سَوَادٍ فَأُتِيَ بِهِ لِيُضَحِّيَ بِهِ فَقَالَ لَهَا يَا عَائِشَةُ هَلُمِّي الْمُدْيَةَ ثُمَّ قَالَ اشْحَذِيهَا بِحَجَرٍ فَفَعَلَتْ ثُمَّ أَخَذَهَا وَأَخَذَ الْكَبْشَ فَأَضْجَعَهُ ثُمَّ ذَبَحَهُ ثُمَّ قَالَ بِاسْمِ اللَّهِ اللَّهُمَّ تَقَبَّلْ مِنْ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَمِنْ أُمَّةِ مُحَمَّدٍ ثُمَّ ضَحَّى بِهِ",
                "id": "Telah menceritakan kepada kami [Harun bin Ma'ruf] telah menceritakan kepada kami [Abdullah bin Wahb] dia berkata; [Haiwah] berkata; telah mengabarkan kepadaku [Abu Shahr] dari [Yazid in Qusaith] dari ['Urwah bin Zubair] dari ['Aisyah], bahwa Rasulullah shallallahu 'alaihi wasallam pernah menyuruh untuk diambilkan dua ekor domba bertanduk yang di kakinya berwarna hitam, perutnya terdapat belang hitam, dan di kedua matanya terdapat belang hitam. Kemudian domba tersebut di serahkan kepada beliau untuk dikurbankan, lalu beliau bersabda kepada 'Aisyah: \"Wahai 'Aisyah, bawalah pisau kemari.\" Kemudian beliau bersabda: \"Asahlah pisau ini dengan batu.\" Lantas 'Aisyah melakukan apa yang di perintahkan beliau, setelah di asah, beliau mengambilnya dan mengambil domba tersebut dan membaringkannya lalu beliau menyembelihnya.\" Kemudian beliau mengucapkan: \"Dengan nama Allah, ya Allah, terimalah ini dari Muhammad, keluarga Muhammad, dan ummat Muhammad.\" Kemudian beliau berkurban dengannya.\""
            },
            {
                "number": 3392,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ حَدَّثَنِي أَبِي عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قُلْتُيَا رَسُولَ اللَّهِ إِنَّا لَاقُو الْعَدُوِّ غَدًا وَلَيْسَتْ مَعَنَا مُدًى قَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْجِلْ أَوْ أَرْنِي مَا أَنْهَرَ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ فَكُلْ لَيْسَ السِّنَّ وَالظُّفُرَ وَسَأُحَدِّثُكَ أَمَّا السِّنُّ فَعَظْمٌ وَأَمَّا الظُّفُرُ فَمُدَى الْحَبَشَةِ قَالَ وَأَصَبْنَا نَهْبَ إِبِلٍ وَغَنَمٍ فَنَدَّ مِنْهَا بَعِيرٌ فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِهَذِهِ الْإِبِلِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَإِذَا غَلَبَكُمْ مِنْهَا شَيْءٌ فَاصْنَعُوا بِهِ هَكَذَاو حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ أَبِيهِ عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذِي الْحُلَيْفَةِ مِنْ تِهَامَةَ فَأَصَبْنَا غَنَمًا وَإِبِلًا فَعَجِلَ الْقَوْمُ فَأَغْلَوْا بِهَا الْقُدُورَ فَأَمَرَ بِهَا فَكُفِئَتْ ثُمَّ عَدَلَ عَشْرًا مِنْ الْغَنَمِ بِجَزُورٍ وَذَكَرَ بَاقِيَ الْحَدِيثِ كَنَحْوِ حَدِيثِ يَحْيَى بْنِ سَعِيدٍ و حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَعِيلَ بْنِ مُسْلِمٍ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ عَبَايَةَ عَنْ جَدِّهِ رَافِعٍ ثُمَّ حَدَّثَنِيهِ عُمَرُ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ أَبِيهِ عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ عَنْ جَدِّهِ قَالَ قُلْنَا يَا رَسُولَ اللَّهِ إِنَّا لَاقُو الْعَدُوِّ غَدًا وَلَيْسَ مَعَنَا مُدًى فَنُذَكِّي بِاللِّيطِ وَذَكَرَ الْحَدِيثَ بِقِصَّتِهِ وَقَالَ فَنَدَّ عَلَيْنَا بَعِيرٌ مِنْهَا فَرَمَيْنَاهُ بِالنَّبْلِ حَتَّى وَهَصْنَاهُ و حَدَّثَنِيهِ الْقَاسِمُ بْنُ زَكَرِيَّاءَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ عَنْ زَائِدَةَ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ بِهَذَا الْإِسْنَادِ الْحَدِيثَ إِلَى آخِرِهِ بِتَمَامِهِ وَقَالَ فِيهِ وَلَيْسَتْ مَعَنَا مُدًى أَفَنَذْبَحُ بِالْقَصَبِ و حَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ بْنِ عَبْدِ الْحَمِيدِ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعٍ عَنْ رَافِعِ بْنِ خَدِيجٍ أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِنَّا لَاقُو الْعَدُوِّ غَدًا وَلَيْسَ مَعَنَا مُدًى وَسَاقَ الْحَدِيثَ وَلَمْ يَذْكُرْ فَعَجِلَ الْقَوْمُ فَأَغْلَوْا بِهَا الْقُدُورَ فَأَمَرَ بِهَا فَكُفِئَتْ وَذَكَرَ سَائِرَ الْقِصَّةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna Al 'Anazi] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] telah menceritakan kepadaku [ayahku] dari ['Abayah bin Rifa'ah bin Rafi' bin Khadij] dari [Rafi' bin Khadij] ia berkata, \"Aku berkata kepada Rasulullah, 'Besok kita akan bertemu musuh, sementara kita tidak lagi mempunyai pisau tajam? ' Beliau menjawab: \"Sembelihlah dengan sesuatu yang dapat mengalirkan darah, sebutlah nama Allah lalu makanlah, kecuali dengan gigi dan kuku. Aku jelaskan kepada kalian; gigi itu sejenis tulang, sedangkan kuku adalah alat yang biasa digunakan oleh bangsa Habsyah (untuk menyembelih).\" Kami lalu mendapatkan rampasan unta dan kambing, saat ada salah satu unta tersebut yang kabur, maka seorang laki-laki melemparnya dengan anak panah, hingga dapat menangkapnya kembali. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya di antara unta-unta ini ada yang liar sebagaimana binatang buas, jika kalian merasa susah dibuatnya, maka lakukanlah seperti itu.\" Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan bin Sa'id bin Masruq] dari [ayahnya] dari ['Abayah bin Rifa'ah bin Rafi' bin Khadij] dari [Rafi' bin Khadij] dia berkata, \"Saya pernah bersama Rasulullah shallallahu 'alaihi wasallam ketika di Dzul Khulaifah, dari arah Tihamah, lalu kami mendapatkan rampasan kambing dan unta, maka orang-orang pun bersegera mendidihkan air dalam kuwali, namun beliau memerintahkan supaya kuwali tersebut ditumpahkan, kemudian beliau menjadikan sepuluh kambing setara dengan satu ekor unta...kemudian perawi menyebutkan sisa hadits tersebut sebagaimana hadits Yahya bin Sa'id.\" Dan telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Isma'il bin Muslim] dari [Sa'id bin Masruq] dari ['Abayah] dari kakeknya [Rafi'] kemudian menceritakan kepadaku [Umar bin Sa'id bin Masruq] dari [Ayahnya] dari [Abayah bin Rifa'ah bin Rafi' bin Khadij] dari [Kakeknya] dia berkata, \"Kami berkata, \"Wahai Rasulullah, sesungguhnya esok hari kita akan bertemu musuh, sementara kami tidak memiliki pisau, maka kami menyembelihnya dengan dahan (yang tajam)...Kemudian ia menyebutkan hadits tersebut dengan kisahnya, ia menambahkan, \"Kemudian seekor unta kami kabur, kami pun langsung melesatkan anak panah hingga unta tersebut terjatuh.\" Dan telah menceritakan kepadaku [Al Qasim bin Zakaria] telah menceritakan kepada kami [Husain bin Ali] dari [Za`idah] dari [Sa'id bin Masruq] dengan sanad hadits ini hingga yang terakhir secara sempurna, ia menyebutkan dalam haditsnya, \"Sementara kami tidak memiliki pisau, apakah kami boleh menyembelihnya dengan kayu?\" Dan telah menceritakan kepada kami [Muhammad bin Al Walid bin Abdul hamid] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Sa'id bin Masruq] dari ['Abayah bin Rifa'ah bin Rafi'] dari [Rafi' bi Khadij] bahwa dia berkata, \"Wahai Rasulullah, sesungguhnya esok hari kita akan bertemu musuh, sementara kita tidak memiliki pisau (untuk menyembelih hewan sembelihan).... lalu ia menyebutkan hadits tersebut, namun ia tidak menyebutkan, \"Lalu para sahabat bersegera untuk mendidihkan air dalam kuwali, namun beliau memerintahkan supaya kuwali tersebut di tumpahkan...lalu ia menyebutkan semua kisah dalam hadits tersebut.\""
            },
            {
                "number": 3393,
                "arab": "حَدَّثَنِي عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا الزُّهْرِيُّ عَنْ أَبِي عُبَيْدٍ قَالَشَهِدْتُ الْعِيدَ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ فَبَدَأَ بِالصَّلَاةِ قَبْلَ الْخُطْبَةِ وَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَانَا أَنْ نَأْكُلَ مِنْ لُحُومِ نُسُكِنَا بَعْدَ ثَلَاثٍ",
                "id": "Telah menceritakan kepadaku [Abdul Jabar bin Al 'Ala`] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Az Zuhri] dari [Abu 'Ubaid] dia berkata, \"Saya pernah mengikuti sholat idul adha bersama [Ali bin Abu Thalib], dia memulai sholat terlebih dahulu sebelum khutbah seraya berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam melarang kita memakan daging kurban setelah tiga hari.\""
            },
            {
                "number": 3394,
                "arab": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي أَبُو عُبَيْدٍ مَوْلَى ابْنِ أَزْهَرَ أَنَّهُ شَهِدَ الْعِيدَ مَعَ عُمَرَ بْنِ الْخَطَّابِ قَالَ ثُمَّ صَلَّيْتُ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ فَصَلَّى لَنَا قَبْلَ الْخُطْبَةِ ثُمَّ خَطَبَ النَّاسَ فَقَالَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ نَهَاكُمْ أَنْ تَأْكُلُوا لُحُومَ نُسُكِكُمْ فَوْقَ ثَلَاثِ لَيَالٍ فَلَا تَأْكُلُواو حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ ح و حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ كُلُّهُمْ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah menceritakan kepadaku [Harmalah bin Yahya] telah mengabarkan kepada kami [Ibnu Wahb] telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] telah menceritakan kepadaku [Abu 'Ubaid] bekas budak Ibnu Azhar, bahwa dia pernah menghadiri sholat 'idul adha bersama-sama Umar bin Khaththab.\" Abu Ubaid berkata, \"Aku juga pernah sholat bersama [Ali bin Abu Thalib], dia sholat sebelum khutbah. Setelah itu ia berkhutbah di hadapan orang-orang, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam melarang kalian memakan daging kurban sesudah tiga hari, jika lebih dari tiga hari, maka janganlah kalian mamakannya.'\" Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami sepupuku [Ibnu Syihab]. (dalam jalur lain disebtkan) Telah menceritakan kepada kami [Hasan Al Khulwani] telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [ayahku] dari [Shalih]. (dalam jalur lain disebtkan) Telah menceritakan kepada kami [Abd bin Humaid] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] semuanya dari [Az Zuhri] dengan isnad seperti ini.\""
            },
            {
                "number": 3395,
                "arab": "و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رُمْحٍ أَخْبَرَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا يَأْكُلْ أَحَدٌ مِنْ لَحْمِ أُضْحِيَّتِهِ فَوْقَ ثَلَاثَةِ أَيَّامٍو حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ أَخْبَرَنَا الضَّحَّاكُ يَعْنِي ابْنَ عُثْمَانَ كِلَاهُمَا عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ اللَّيْثِ",
                "id": "Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits]. (dalam jalur lain disebtkan) Telah menceritakan kepadaku [Muhammad bin Rumh] telah mengabarkan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, bahawa beliau bersabda: \"Janganlah salah seorang dari kalian memakan daging kurban setelah tiga hari.\" Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij]. (dalam jalur lain disebtkan) Telah menceritakan kepadaku [Muhammad bin Rafi'] telah menceritakan kepada kami [Ibnu Abu Fudaik] telah mengabarkan kepada kami [Adl Dlahak] -yaitu Ibnu Utsman- keduanya dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam seperti hadits Laits.\""
            },
            {
                "number": 3396,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ أَخْبَرَنَا رَوْحٌ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ عَبْدِ اللَّهِ بْنِ وَاقِدٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ لُحُومِ الضَّحَايَا بَعْدَ ثَلَاثٍقَالَ عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ فَذَكَرْتُ ذَلِكَ لِعَمْرَةَ فَقَالَتْ صَدَقَ سَمِعْتُ عَائِشَةَ تَقُولُ دَفَّ أَهْلُ أَبْيَاتٍ مِنْ أَهْلِ الْبَادِيَةِ حَضْرَةَ الْأَضْحَى زَمَنَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ادَّخِرُوا ثَلَاثًا ثُمَّ تَصَدَّقُوا بِمَا بَقِيَ فَلَمَّا كَانَ بَعْدَ ذَلِكَ قَالُوا يَا رَسُولَ اللَّهِ إِنَّ النَّاسَ يَتَّخِذُونَ الْأَسْقِيَةَ مِنْ ضَحَايَاهُمْ وَيَجْمُلُونَ مِنْهَا الْوَدَكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا ذَاكَ قَالُوا نَهَيْتَ أَنْ تُؤْكَلَ لُحُومُ الضَّحَايَا بَعْدَ ثَلَاثٍ فَقَالَ إِنَّمَا نَهَيْتُكُمْ مِنْ أَجْلِ الدَّافَّةِ الَّتِي دَفَّتْ فَكُلُوا وَادَّخِرُوا وَتَصَدَّقُوا",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim Al Hanzhali] telah mengabarkan kepada kami [Rauh] telah menceritakan kepada kami [Malik] dari [Abdullah bin Abu Bakar] dari [Abdullah bin Waqid] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang makan daging binatang kurban setelah tiga hari.\" [Abdullah bin Abu Bakar] berkata, \"kemudian saya memberitahukan hal itu kepada ['Amrah], lantas 'Amrah berkata, \"Dia benar, saya juga pernah mendengar ['Aisyah] berkata, \"Para penduduk kampung mempercepat langkahnya dan bersegera menghadiri idul adha di zaman Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Simpanlah (daging kurban tersebut) hingga tiga hari, setelah itu sedekahkanlah yang masih tersisa.\" Setelah hal itu berlalu, orang-orang berkata, \"Wahai Rasulullah, sesungguhnya orang-orang memanfaatkan dari kurban, mereka mencairkan lemaknya dan darinya mereka membuat geriba.\" Beliau bersabda: \"Ada apa dengan hal itu?\" Mereka berkata, \"Engkau telah melarang memakan daging kurban setelah lewat tiga hari.\" Beliau bersabda: \"Sesungguhnya saya melarang sekelompok orang yang datang terburu-buru, oleh karena itu makan, simpan dan bersedekahlah.\""
            },
            {
                "number": 3397,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ أَكْلِ لُحُومِ الضَّحَايَا بَعْدَ ثَلَاثٍ ثُمَّ قَالَ بَعْدُ كُلُوا وَتَزَوَّدُوا وَادَّخِرُوا",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata; saya bacakan di hadapan [Malik]; dari [Abu Az Zubair] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau melarang makan daging kurban setelah tiga hari, kemudian beliau bersabda: \"Makan dan simpanlah sebagai perbekalan kalian.\""
            },
            {
                "number": 3398,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكُنَّا لَا نُمْسِكُ لُحُومَ الْأَضَاحِيِّ فَوْقَ ثَلَاثٍ فَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَتَزَوَّدَ مِنْهَا وَنَأْكُلَ مِنْهَا يَعْنِي فَوْقَ ثَلَاثٍو حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرٍو عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَ كُنَّا نَتَزَوَّدُهَا إِلَى الْمَدِينَةِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Zakaria bin 'Adi] dari [Ubaidillah bin 'Amru] dari [Zaid bin Abu Unaisah] dari ['Atha bin Abu Rabah] dari [Jabir bin Abdullah] dia berkata, \"Kami tidak menyimpan daging kurban setelah tiga hari, lantas Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk menyimpannya sebagai perbekalan, dan kami pun memakan daging tersebut setelah tiga hari.\" Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Sufyan bin Uyainah] dari ['Amru] dari ['Atha] dari [Jabir] dia berkata, \"Kami menyimpannya untuk perbekalan ke Madinah pada masa Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3399,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَهْلَ الْمَدِينَةِ لَا تَأْكُلُوا لُحُومَ الْأَضَاحِيِّ فَوْقَ ثَلَاثٍ و قَالَ ابْنُ الْمُثَنَّى ثَلَاثَةِ أَيَّامٍ فَشَكَوْا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ لَهُمْ عِيَالًا وَحَشَمًا وَخَدَمًا فَقَالَ كُلُوا وَأَطْعِمُوا وَاحْبِسُوا أَوْ ادَّخِرُوا قَالَ ابْنُ الْمُثَنَّى شَكَّ عَبْدُ الْأَعْلَى",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abdul A'la] dari [Al Jurairi] darii [Abu Nadlrah] dari [Abu Sa'id Al Khudri]. (dalam jalur lain disebtkan) Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Abu Nadlrah] dari [Abu Sa'id Al Khudri] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai penduduk Madinah, janganlah kalian memakan daging kurban setelah tiga.\" Ibnu Mutsanna menyebutkan, \"Setelah tiga hari.\" Lantas mereka mengadu kepada Rasulullah shallallahu 'alaihi wasallam bahwa mereka memiliki keluarga, para pembantu dan para pelayan.\" Beliau lalu bersabda: \"(Jika demikian) makan, berikan dan tahanlah, \" Atau, \"Simpanlah.\" Ibnu Mutsanna berkata, \"Abdul A'la merasa ragu.\""
            },
            {
                "number": 3400,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ عَنْ سَلَمَةَ بْنِ الْأَكْوَعِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ ضَحَّى مِنْكُمْ فَلَا يُصْبِحَنَّ فِي بَيْتِهِ بَعْدَ ثَالِثَةٍ شَيْئًا فَلَمَّا كَانَ فِي الْعَامِ الْمُقْبِلِ قَالُوا يَا رَسُولَ اللَّهِ نَفْعَلُ كَمَا فَعَلْنَا عَامَ أَوَّلَ فَقَالَ لَا إِنَّ ذَاكَ عَامٌ كَانَ النَّاسُ فِيهِ بِجَهْدٍ فَأَرَدْتُ أَنْ يَفْشُوَ فِيهِمْ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] telah mengabarkan kepada kami [Abu 'Ashim] dari [Yazid bin Abu Ubaid] dari [Salamah bin Al Akwa'], bahwa Rasulullah shallallahu 'alaihi wasallam: \"Siapa dari kalian menyembelih kurban, maka hendaklah ia tidak menyisakan (menyimpan) di rumahnya setelah tiga hari.\" Pada tahun berikutnya mereka bertanya, \"Wahai Rasulullah, apakah kami mesti melakukan sebagaimana yang kami lakukan tahun lalu?\" Beliau menjawab: \"Tidak, sesungguhnya tahun lalu orang-orang berada dalam keadaan susah hingga saya menginginkan agar daging hewan kurban ini bisa merata dirasakan oleh mereka.\""
            },
            {
                "number": 3401,
                "arab": "و حَدَّثَنِي إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا أَبُو مُسْهِرٍ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ حَدَّثَنِي الزُّبَيْدِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ عَنْ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ أَصْلِحْ هَذَا اللَّحْمَ قَالَ فَأَصْلَحْتُهُ فَلَمْ يَزَلْ يَأْكُلُ مِنْهُ حَتَّى بَلَغَ الْمَدِينَةَو حَدَّثَنِيهِ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ بِهَذَا الْإِسْنَادِ وَلَمْ يَقُلْ فِي حَجَّةِ الْوَدَاعِ",
                "id": "Dan telah menceritakan kepadaku [Ishaq bin Manshur] telah mengabarkan kepada kami [Abu Mushir] telah menceritakan kepada kami [Yahya bin Hamzah] telah menceritakan kepadaku [Az Zubaidi] dari [Abdurrahman bin Jubair bin Nufair] dari [ayahnya] dari [Tsauban] bekas budak Rasulullah shallallahu 'alaihi wasallam, dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku ketika haji Wada': \"Simpanlah daging ini untuk perbekalan.\" Tsauban berkata, \"Lalu saya pun menyimpannya sebagai perbekalan, dan beliau masih tetap memakan perbekalan tersebut hingga sampai tiba di Madinah.\" Dan telah menceritakan kepadaku [Abdullah bin Abdurrahman Ad Darimi] telah mengabarkan kepada kami [Muhammad bin Al Mubarak] telah menceritakan kepada kami [Yahya bin Hamzah] dengan isnad ini, hanya saja ia tidak menyebutkan, \"Ketika haji Wada'.\""
            },
            {
                "number": 3402,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ قَالَ أَبُو بَكْرٍ عَنْ أَبِي سِنَانٍ و قَالَ ابْنُ الْمُثَنَّى عَنْ ضِرَارِ بْنِ مُرَّةَ عَنْ مُحَارِبٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ حَدَّثَنَا ضِرَارُ بْنُ مُرَّةَ أَبُو سِنَانٍ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَيْتُكُمْ عَنْ زِيَارَةِ الْقُبُورِ فَزُورُوهَا وَنَهَيْتُكُمْ عَنْ لُحُومِ الْأَضَاحِيِّ فَوْقَ ثَلَاثٍ فَأَمْسِكُوا مَا بَدَا لَكُمْ وَنَهَيْتُكُمْ عَنْ النَّبِيذِ إِلَّا فِي سِقَاءٍ فَاشْرَبُوا فِي الْأَسْقِيَةِ كُلِّهَا وَلَا تَشْرَبُوا مُسْكِرًاو حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ عَنْ سُفْيَانَ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُنْتُ نَهَيْتُكُمْ فَذَكَرَ بِمَعْنَى حَدِيثِ أَبِي سِنَانٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Muhammad bin Al Mutsanna] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Fudlail], [Abu Bakar] berkata; dari [Abu Sinan], dan [Ibnu Al Mutsanna] berkata; dari [Dlirar bin Murrah] dari [Muharib] dari [Ibnu Buraidah] dari [ayahnya]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Muhammad bin Fudlail] telah menceritakan kepada kami [Dlirar bin Murrah Abu Sinan] dari [Muharib bin Ditsar] dari [Abdullah bin Buraidah] dari [ayahnya] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku pernah melarang kalian berziarah kubur, sekarang berziarahlah. Saya juga pernah melarang kalian makan daging kurban setelah tiga hari, sekarang simpanlah untuk keperluan kalian. Dan saya juga pernah melarang kalian meminum anggur kecuali jika dalam bejana minum, sekarang minumlah dalam semua bejana kalian, tetapi jangan sekali-kali kamu minum yang memabukkan.\" Dan telah menceritakan kepadaku [Hajjaj bin Sya'ir] telah menceritakan kepada kami [Adl Dlahak bin Makhlad] dari [Sufyan] dari ['Alqamah bin Martsad] dari [Ibnu Buraidah] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku pernah melarang kalian…kemudian ia menyebutkan hadits Abu Sinan.\""
            },
            {
                "number": 3403,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالَ يَحْيَى أَخْبَرَنَا و قَالَ الْآخَرُونَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ عَبْدٌ أَخْبَرَنَا و قَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ ابْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا فَرَعَ وَلَا عَتِيرَةَ زَادَ ابْنُ رَافِعٍ فِي رِوَايَتِهِ وَالْفَرَعُ أَوَّلُ النِّتَاجِ كَانَ يُنْتَجُ لَهُمْ فَيَذْبَحُونَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] dan [Abu Bakar bin Abu Syaibah] dan ['Amru An Naqid] dan [Zuhair bin Harb], Yahya berkata; telah mengabarkan kepada kami, dan yang lain mengatakan; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam. (dalam jalur lain disebutkan) Telah menceritakan kepadaku [Muhammad bin Rafi'] dan [Abd bin Humaid], Abd berkata; telah mengabarkan kepada kami, dan Ibnu Rafi' berkata; telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Ibnu Musayyab] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada fara' dan Atirah.\" Ibnu Rafi' menambahkan dalam riwayatnya, \"Fara' adalah anak unta yang pertama kali dilahirkan yang disembelih untuk sesembahan.\" "
            },
            {
                "number": 3404,
                "arab": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ الْمَكِّيُّ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ سَمِعَ سَعِيدَ بْنَ الْمُسَيَّبِ يُحَدِّثُ عَنْ أُمِّ سَلَمَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا دَخَلَتْ الْعَشْرُ وَأَرَادَ أَحَدُكُمْ أَنْ يُضَحِّيَ فَلَا يَمَسَّ مِنْ شَعَرِهِ وَبَشَرِهِ شَيْئًاقِيلَ لِسُفْيَانَ فَإِنَّ بَعْضَهُمْ لَا يَرْفَعُهُ قَالَ لَكِنِّي أَرْفَعُهُ",
                "id": "Telah menceritakan kepada kami [Ibnu Abu Umar Al Makki] telah menceritakan kepada kami [Sufyan] dari [Abdurrahman bin Humaid bin Abdurrahman bin 'Auf] bahwa dia mendengar [Sa'id bin Musayyab] menceritakan dari [Ummu Salamah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jika telah tiba sepuluh (dzul Hijjah) dan salah seorang dari kalian hendak berkurban, maka janganlah mencukur rambut atau memotong kuku sedikitpun.\" Dikatakan kepada [Sufyan], \"Sebagian orang tidak memarfu'kan (hadits ini)?\" Sufyan menjawab, \"Akan tetapi saya memarfu'kannya.\""
            },
            {
                "number": 3405,
                "arab": "و حَدَّثَنَاه إِسْحَقُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا سُفْيَانُ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أُمِّ سَلَمَةَ تَرْفَعُهُقَالَ إِذَا دَخَلَ الْعَشْرُ وَعِنْدَهُ أُضْحِيَّةٌ يُرِيدُ أَنْ يُضَحِّيَ فَلَا يَأْخُذَنَّ شَعْرًا وَلَا يَقْلِمَنَّ ظُفُرًا",
                "id": "Dan telah menceritakan kepada kami [Ishaq bin Ibrahim] telah mengabarkan kepada kami [Sufyan] telah menceritakan kepadaku [Abdurrahman bin Humaid bin Abdurrahman bin 'Auf] dari [Sa'id bin Musayyab] dari [Ummu Salamah] dan dimarfu'kan kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika (Salah seorang) telah masuk sepuluh (Dzul Hijjah), sedangkan ia memiliki hewan kurban yang hendak dikurbankan, maka jangan sekali-kali ia mencukur rambut atau memotong kuku.\""
            },
            {
                "number": 3406,
                "arab": "و حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنِي يَحْيَى بْنُ كَثِيرٍ الْعَنْبَرِيُّ أَبُو غَسَّانَ حَدَّثَنَا شُعْبَةُ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ عُمَرَ بْنِ مُسْلِمٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أُمِّ سَلَمَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا رَأَيْتُمْ هِلَالَ ذِي الْحِجَّةِ وَأَرَادَ أَحَدُكُمْ أَنْ يُضَحِّيَ فَلْيُمْسِكْ عَنْ شَعْرِهِ وَأَظْفَارِهِو حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ الْهَاشِمِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ عُمَرَ أَوْ عَمْرِو بْنِ مُسْلِمٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ",
                "id": "Dan telah menceritakan kepadaku [Hajjaj bin Sya'ir] telah menceritakan kepadaku [Yahya bin Katsir Al 'Anbari Abu Ghassan] telah menceritakan kepada kami [Syu'bah] dari [Malik bin Anas] dari [Umar bin Muslim] dari [Sa'id bin Musayyab] dari [Ummu Salamah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jika kalian telah melihat hilal sepuluh Dzul Hijjah, dan salah seorang dari kalian hendak berkurban, hendaknya ia tidak mencukur rambut dan tidak memotong kuku terlebih dahulu.\" Dan telah menceritakan kepada kami [Ahmad bin Abdullah bin Al Hakam Al Hasyimi] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Malik bin Anas] dari [Umar] atau 'Amru bin Muslim dengan sanad ini, seperti hadits tersebut.\""
            },
            {
                "number": 3407,
                "arab": "و حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو اللَّيْثِيُّ عَنْ عُمَرَ بْنِ مُسْلِمِ بْنِ عَمَّارِ بْنِ أُكَيْمَةَ اللَّيْثِيِّ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ يَقُولُ سَمِعْتُ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ لَهُ ذِبْحٌ يَذْبَحُهُ فَإِذَا أُهِلَّ هِلَالُ ذِي الْحِجَّةِ فَلَا يَأْخُذَنَّ مِنْ شَعْرِهِ وَلَا مِنْ أَظْفَارِهِ شَيْئًا حَتَّى يُضَحِّيَحَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرٍو حَدَّثَنَا عَمْرُو بْنُ مُسْلِمِ بْنِ عَمَّارٍ اللَّيْثِيُّ قَالَ كُنَّا فِي الْحَمَّامِ قُبَيْلَ الْأَضْحَى فَاطَّلَى فِيهِ نَاسٌ فَقَالَ بَعْضُ أَهْلِ الْحَمَّامِ إِنَّ سَعِيدَ بْنَ الْمُسَيَّبِ يَكْرَهُ هَذَا أَوْ يَنْهَى عَنْهُ فَلَقِيتُ سَعِيدَ بْنَ الْمُسَيَّبِ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ يَا ابْنَ أَخِي هَذَا حَدِيثٌ قَدْ نُسِيَ وَتُرِكَ حَدَّثَتْنِي أُمُّ سَلَمَةَ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ مُعَاذٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو و حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى وَأَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَخِي ابْنِ وَهْبٍ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي حَيْوَةُ أَخْبَرَنِي خَالِدُ بْنُ يَزِيدَ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ عَنْ عُمَرَ بْنِ مُسْلِمٍ الْجُنْدَعِيِّ أَنَّ ابْنَ الْمُسَيَّبِ أَخْبَرَهُ أَنَّ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُ وَذَكَرَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِهِمْ",
                "id": "Dan telah menceritakan kepadaku [ubaidhullah bin Mu'adz Al 'Anbari] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Muhammad bin 'Amru Al Laitsi] dari [Umar bin Muslim bin 'Ammar bin Ukaimah Al Laitsi] dia berkata; saya mendengar [Sa'id bin Musayyab] berkata; saya mendengar [Ummu Salamah] isteri Nabi shallallahu 'alaihi wasallam berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memiliki hewan kurban, hendaknya ia berkurban jika hilal sepuluh Dzul Hujjah telah terlihat jelas, janganlah ia mencukur rambut dan memotong kuku terlebih dahulu walau sedikit hingga ia selesai berkurban.\" Telah menceritakan kepadaku [Al Hasan bin Ali Al Khulwani] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepadaku [Muhammad bin 'Amru] telah menceritakan kepada kami ['Amru bin Muslim bin 'Ammar Al Laitsi] dia berkata, \"Kami pernah berada di tempat pemandian menjelang idul adha, sedangkan sebagian orang ada yang mencukur ketiaknya dengan pisau cukur, maka sebagian orang di tempat pemandian berkata, \"Sesungguhnya Sa'id bin Musayyab membenci hal itu, atau ia melarang hal itu.\" Lantas aku menemui Sa'id bin Musayyab dan memberitahukan hal itu kepadanya, ia menjawab, \"Wahai keponakanku, hadits ini telah dilupakan, atau ditinggalkan.\" Telah menceritakan kepadaku [Ummu Salamah], isteri Nabi shallallahu 'alaihi wasallam, dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda semakna dengan hadits Mu'adz dari Muhammad bin 'Amru.\" Dan telah menceritakan kepadaku [Harmalah bin Yahya] dan [Ahmad bin Abdurrahman Akhi Ibnu Syihab] keduanya berkata; telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku [Haiwah] telah mengabarkan kepadaku [Khalid bin Yazid] dari [Sa'id bin Abu Hilal] dari [Umar bin Muslim Al Junda'i] bahwa [Ibnu Musayyab] telah mengabarkan kepadanya, bahwa [Ummu Salamah] isteri Nabi shallallahu 'alaihi wasallam, telah mengabarkan kepadanya, lalu ia menyebutkan Nabi shallallahu 'alaihi wasallam semakna dengan hadits mereka.\""
            },
            {
                "number": 3408,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَسُرَيْجُ بْنُ يُونُسَ كِلَاهُمَا عَنْ مَرْوَانَ قَالَ زُهَيْرٌ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ حَدَّثَنَا مَنْصُورُ بْنُ حَيَّانَ حَدَّثَنَا أَبُو الطُّفَيْلِ عَامِرُ بْنُ وَاثِلَةَ قَالَكُنْتُ عِنْدَ عَلِيِّ بْنِ أَبِي طَالِبٍ فَأَتَاهُ رَجُلٌ فَقَالَ مَا كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسِرُّ إِلَيْكَ قَالَ فَغَضِبَ وَقَالَ مَا كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسِرُّ إِلَيَّ شَيْئًا يَكْتُمُهُ النَّاسَ غَيْرَ أَنَّهُ قَدْ حَدَّثَنِي بِكَلِمَاتٍ أَرْبَعٍ قَالَ فَقَالَ مَا هُنَّ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ قَالَ لَعَنَ اللَّهُ مَنْ لَعَنَ وَالِدَهُ وَلَعَنَ اللَّهُ مَنْ ذَبَحَ لِغَيْرِ اللَّهِ وَلَعَنَ اللَّهُ مَنْ آوَى مُحْدِثًا وَلَعَنَ اللَّهُ مَنْ غَيَّرَ مَنَارَ الْأَرْضِ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Suraij bin Yunus] keduanya dari [Marwan], [Zuhair] berkata; telah menceritakan kepada kami [Marwan bin Mu'awiyah Al Fazari] telah menceritakan kepada kami [Manshur bin Hayyan] telah menceritakan kepada kami [Abu At Thufail 'Amir bin Wastilah] dia berkata, \"Saya berada di samping [Ali bin Abu Thalib], tiba-tiba seorang laki-laki datang menemuinya seraya berkata, \"Apakah Nabi shallallahu 'alaihi wasallam pernah menyampaikan suatu rahasia kepadamu (yang tidak diberitahukan kepada manusia)?\" Abu Thufail berkata, \"Ali pun marah seraya berkata, \"Tidaklah Nabi shallallahu 'alaihi wasallam menyampaikan suatu rahasia kepadaku dan tidak menyampaikannya kepada manusia, kecuali bahwa beliau pernah menyampaikan empat hal kepadaku.\" Abu Thufail berkata, \"Laki-laki tersebut bertanya, \"Apakah empat perkara itu wahai Amirul Mukminin?\" Abu Thufail melanjutkan, \"Ali lalu menjawab, \"Allah melaknat orang yang melaknat orang tuanya, melaknat orang yang menyembelih untuk selain Allah, melaknat orang yang menyembunyikan penjahat dan melaknat orang yang memindah batas tanah.\""
            },
            {
                "number": 3409,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ سُلَيْمَانُ بْنُ حَيَّانَ عَنْ مَنْصُورِ بْنِ حَيَّانَ عَنْ أَبِي الطُّفَيْلِ قَالَقُلْنَا لِعَلِيِّ بْنِ أَبِي طَالِبٍ أَخْبِرْنَا بِشَيْءٍ أَسَرَّهُ إِلَيْكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا أَسَرَّ إِلَيَّ شَيْئًا كَتَمَهُ النَّاسَ وَلَكِنِّي سَمِعْتُهُ يَقُولُ لَعَنَ اللَّهُ مَنْ ذَبَحَ لِغَيْرِ اللَّهِ وَلَعَنَ اللَّهُ مَنْ آوَى مُحْدِثًا وَلَعَنَ اللَّهُ مَنْ لَعَنَ وَالِدَيْهِ وَلَعَنَ اللَّهُ مَنْ غَيَّرَ الْمَنَارَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Khalid Al Ahmar Sulaiman bin Hayyan] dari [Manshur bin Hayyan] dari [Abu At Thufail] dia berkata; saya berkata kepada [Ali bin Abu Thalib], \"Beritahukanlah kepadaku sesuatu yang pernah dirahasiakan Rasulullah shallallahu 'alaihi wasallam kepadamu!\" Ali menjawab, \"Beliau tidak pernah merahasiakan kepadaku sesuatu pun dari manusia, akan tetapi saya mendengar beliau bersabda: \"Allah mengutuk orang yang menyembelih untuk selain Allah, dan mengutuk orang yang melindungi tindak kejahatan, mengutuk orang yang mencaci kedua orang tuanya, dan mengutuk orang yang memindahkan tanda batas tanah.\""
            },
            {
                "number": 3410,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ الْقَاسِمَ بْنَ أَبِي بَزَّةَ يُحَدِّثُ عَنْ أَبِي الطُّفَيْلِ قَالَسُئِلَ عَلِيٌّ أَخَصَّكُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَيْءٍ فَقَالَ مَا خَصَّنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَيْءٍ لَمْ يَعُمَّ بِهِ النَّاسَ كَافَّةً إِلَّا مَا كَانَ فِي قِرَابِ سَيْفِي هَذَا قَالَ فَأَخْرَجَ صَحِيفَةً مَكْتُوبٌ فِيهَا لَعَنَ اللَّهُ مَنْ ذَبَحَ لِغَيْرِ اللَّهِ وَلَعَنَ اللَّهُ مَنْ سَرَقَ مَنَارَ الْأَرْضِ وَلَعَنَ اللَّهُ مَنْ لَعَنَ وَالِدَهُ وَلَعَنَ اللَّهُ مَنْ آوَى مُحْدِثًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] dan ini adalah lafadz Ibnu Mutsanna, keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dia berkata; saya mendengar [Al Qasim bin Abu Bazzah] menceritakan dari [Abu Thufail] dia berkata, \" [Ali] pernah ditanya, \"Apakah Rasulullah shallallahu 'alaihi wasallam merahasiakan kepadamu dengan sesuatu?\" dia menjawab, \"Rasulullah shallallahu 'alaihi wasallam tidak pernah merahasiakan sesuatu pun yang tidak diumumkan kepada manusia, kecuali mengenai sesuatu yang ada dalam sarung pedangku ini.\" Abu Thufail berkata, \"Kemudian Ali mengeluarkan lembaran yang bertuliskan: \"Allah mengutuk orang yang menyembelih untuk selain Allah, mengutuk orang yang memindah batas tanah, mengutuk orang yang mencaci maki orang tuanya dan mengutuk orang yang melindungi pelaku kejahatan.\""
            },
            {
                "number": 3411,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ أَخْبَرَنَا حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ ابْنِ جُرَيْجٍ حَدَّثَنِي ابْنُ شِهَابٍ عَنْ عَلِيِّ بْنِ حُسَيْنِ بْنِ عَلِيٍّ عَنْ أَبِيهِ حُسَيْنِ بْنِ عَلِيٍّ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَأَصَبْتُ شَارِفًا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَغْنَمٍ يَوْمَ بَدْرٍ وَأَعْطَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَارِفًا أُخْرَى فَأَنَخْتُهُمَا يَوْمًا عِنْدَ بَابِ رَجُلٍ مِنْ الْأَنْصَارِ وَأَنَا أُرِيدُ أَنْ أَحْمِلَ عَلَيْهِمَا إِذْخِرًا لِأَبِيعَهُ وَمَعِي صَائِغٌ مِنْ بَنِي قَيْنُقَاعَ فَأَسْتَعِينَ بِهِ عَلَى وَلِيمَةِ فَاطِمَةَ وَحَمْزَةُ بْنُ عَبْدِ الْمُطَّلِبِ يَشْرَبُ فِي ذَلِكَ الْبَيْتِ مَعَهُ قَيْنَةٌ تُغَنِّيهِ فَقَالَتْ أَلَا يَا حَمْزُ لِلشُّرُفِ النِّوَاءِفَثَارَ إِلَيْهِمَا حَمْزَةُ بِالسَّيْفِ فَجَبَّ أَسْنِمَتَهُمَا وَبَقَرَ خَوَاصِرَهُمَا ثُمَّ أَخَذَ مِنْ أَكْبَادِهِمَا قُلْتُ لِابْنِ شِهَابٍ وَمِنْ السَّنَامِ قَالَ قَدْ جَبَّ أَسْنِمَتَهُمَا فَذَهَبَ بِهَا قَالَ ابْنُ شِهَابٍ قَالَ عَلِيٌّ فَنَظَرْتُ إِلَى مَنْظَرٍ أَفْظَعَنِي فَأَتَيْتُ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَهُ زَيْدُ بْنُ حَارِثَةَ فَأَخْبَرْتُهُ الْخَبَرَ فَخَرَجَ وَمَعَهُ زَيْدٌ وَانْطَلَقْتُ مَعَهُ فَدَخَلَ عَلَى حَمْزَةَ فَتَغَيَّظَ عَلَيْهِ فَرَفَعَ حَمْزَةُ بَصَرَهُ فَقَالَ هَلْ أَنْتُمْ إِلَّا عَبِيدٌ لِآبَائِي فَرَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَهْقِرُ حَتَّى خَرَجَ عَنْهُمْو حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنِي عَبْدُ الرَّزَّاقِ أَخْبَرَنِي ابْنُ جُرَيْجٍ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya At Tamimi] telah mengabarkan kepada kami [Hajjaj bin Muhammad] dari [Ibnu Juraij] telah menceritakan kepadaku [Ibnu Syihab] dari [Ali bin Husain bin Ali] dari ayahnya [Husain bin Ali] dari [Ali bin Abu Thalib] dia berkata, \"Dahulu saya pernah mendapatkan satu ekor unta dari hasil rampasan perang Badr bersama Rasulullah shallallahu 'alaihi wasallam, lalu Rasulullah shallallahu 'alaihi wasallam menambahku lagi dengan satu ekor unta. Suatu hari saya menambatkan kedua hewan tersebut di depan pintu rumah milik orang Anshar, aku ingin membawa idzkhir dan meletakkannya di atas kedua punggung hewan tersebut untuk saya jual, sedangkan aku bersama seorang laki-laki penjual emas dari Bani Qainuqa`. Dan hasil dari penjualan itu akan aku pergunakan untuk menyelenggarakan pesta pernikahan Fatimah. Ternyata dalam rumah tersebut terdapat Hamzah bin Abdul Mutthalib sedang meminum minuman keras, dia sedang dihibur oleh seorang penyanyi perempuan yang dalam salah satu nyanyiannya terselip kata-kata, \"Wahai Hamzah, ingatlah pada unta-unta yang montok.\" Maka Hamzah pun berdiri dengan membawa pedang terhunus. Lalu dia memotong punuk kedua unta tersebut, lalu membelah perutnya dan mengambil hati yang ada di dalamnya.\" Saya lalu bertanya kepada Ibnu Syihab, \"Dan dua punuknya?\" dia menjawab, \"Dan dia telah memotong kedua punuk unta tersebut.\" Ibnu Syihab berkata, \"Ali berkata, \"Saya melihat pemandangan yang mengejutkan bagiku, lantas saya langsung mendatangi Nabi shallallahu 'alaihi wasallam, dan di samping beliau terdapat Zaid bin Haritsah. Lalu saya memberitahukan kepada beliau apa yang terjadi. Setelah itu beliau keluar bersama Zaid bin Tsabit, dan saya pun ikut bersama beliau. Kemudian beliau menemui Hamzah dan memarahinya. Ternyata Hamzah memandangi beliau sambil berkata, \"Kalian ini tidak lain hanyalah para budak bapakku.\" Akhirnya Rasulullah shallallahu 'alaihi wasallam kembali pulang dan meninggalkan mereka.\" Dan telah menceritakan kepada kami ['Abd bin Humaid] telah mengabarkan kepadaku [Abdurrazaq] telah mengabarkan kepadaku [Ibnu Juraij] dengan isnad seperti ini.\""
            },
            {
                "number": 3412,
                "arab": "و حَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَقَ أَخْبَرَنَا سَعِيدُ بْنُ كَثِيرِ بْنِ عُفَيْرٍ أَبُو عُثْمَانَ الْمِصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنِي يُونُسُ بْنُ يَزِيدَ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عَلِيُّ بْنُ حُسَيْنِ بْنِ عَلِيٍّ أَنَّ حُسَيْنَ بْنَ عَلِيٍّ أَخْبَرَهُ أَنَّ عَلِيًّا قَالَكَانَتْ لِي شَارِفٌ مِنْ نَصِيبِي مِنْ الْمَغْنَمِ يَوْمَ بَدْرٍ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَانِي شَارِفًا مِنْ الْخُمُسِ يَوْمَئِذٍ فَلَمَّا أَرَدْتُ أَنْ أَبْتَنِيَ بِفَاطِمَةَ بِنْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاعَدْتُ رَجُلًا صَوَّاغًا مِنْ بَنِي قَيْنُقَاعَ يَرْتَحِلُ مَعِيَ فَنَأْتِي بِإِذْخِرٍ أَرَدْتُ أَنْ أَبِيعَهُ مِنْ الصَّوَّاغِينَ فَأَسْتَعِينَ بِهِ فِي وَلِيمَةِ عُرْسِي فَبَيْنَا أَنَا أَجْمَعُ لِشَارِفَيَّ مَتَاعًا مِنْ الْأَقْتَابِ وَالْغَرَائِرِ وَالْحِبَالِ وَشَارِفَايَ مُنَاخَانِ إِلَى جَنْبِ حُجْرَةِ رَجُلٍ مِنْ الْأَنْصَارِ وَجَمَعْتُ حِينَ جَمَعْتُ مَا جَمَعْتُ فَإِذَا شَارِفَايَ قَدْ اجْتُبَّتْ أَسْنِمَتُهُمَا وَبُقِرَتْ خَوَاصِرُهُمَا وَأُخِذَ مِنْ أَكْبَادِهِمَا فَلَمْ أَمْلِكْ عَيْنَيَّ حِينَ رَأَيْتُ ذَلِكَ الْمَنْظَرَ مِنْهُمَا قُلْتُ مَنْ فَعَلَ هَذَا قَالُوا فَعَلَهُ حَمْزَةُ بْنُ عَبْدِ الْمُطَّلِبِ وَهُوَ فِي هَذَا الْبَيْتِ فِي شَرْبٍ مِنْ الْأَنْصَارِ غَنَّتْهُ قَيْنَةٌ وَأَصْحَابَهُ فَقَالَتْ فِي غِنَائِهَا أَلَا يَا حَمْزُ لِلشُّرُفِ النِّوَاءِفَقَامَ حَمْزَةُ بِالسَّيْفِ فَاجْتَبَّ أَسْنِمَتَهُمَا وَبَقَرَ خَوَاصِرَهُمَا فَأَخَذَ مِنْ أَكْبَادِهِمَا فَقَالَ عَلِيٌّ فَانْطَلَقْتُ حَتَّى أَدْخُلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَهُ زَيْدُ بْنُ حَارِثَةَ قَالَ فَعَرَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي وَجْهِيَ الَّذِي لَقِيتُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لَكَ قُلْتُ يَا رَسُولَ اللَّهِ وَاللَّهِ مَا رَأَيْتُ كَالْيَوْمِ قَطُّ عَدَا حَمْزَةُ عَلَى نَاقَتَيَّ فَاجْتَبَّ أَسْنِمَتَهُمَا وَبَقَرَ خَوَاصِرَهُمَا وَهَا هُوَ ذَا فِي بَيْتٍ مَعَهُ شَرْبٌ قَالَ فَدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرِدَائِهِ فَارْتَدَاهُ ثُمَّ انْطَلَقَ يَمْشِي وَاتَّبَعْتُهُ أَنَا وَزَيْدُ بْنُ حَارِثَةَ حَتَّى جَاءَ الْبَابَ الَّذِي فِيهِ حَمْزَةُ فَاسْتَأْذَنَ فَأَذِنُوا لَهُ فَإِذَا هُمْ شَرْبٌ فَطَفِقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلُومُ حَمْزَةَ فِيمَا فَعَلَ فَإِذَا حَمْزَةُ مُحْمَرَّةٌ عَيْنَاهُ فَنَظَرَ حَمْزَةُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ صَعَّدَ النَّظَرَ إِلَى رُكْبَتَيْهِ ثُمَّ صَعَّدَ النَّظَرَ فَنَظَرَ إِلَى سُرَّتِهِ ثُمَّ صَعَّدَ النَّظَرَ فَنَظَرَ إِلَى وَجْهِهِ فَقَالَ حَمْزَةُ وَهَلْ أَنْتُمْ إِلَّا عَبِيدٌ لِأَبِي فَعَرَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ ثَمِلٌ فَنَكَصَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى عَقِبَيْهِ الْقَهْقَرَى وَخَرَجَ وَخَرَجْنَا مَعَهُو حَدَّثَنِيهِ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ قُهْزَاذَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُثْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Dan telah menceritakan kepadaku [Abu Bakar bin Ishaq] telah mengabarkan kepada kami [Sa'id bin Katsir bin 'Ufair Abu Utsman Al Mishri] telah menceritakan kepada kami [Abdullah bin Wahb] telah menceritakan kepadaku [Yunus bin Yazid] dari [Ibnu Syihab] telah mengabarkan kepadaku ['Ali bin Husain bin Ali] bahwa [Husain bin Ali] mengabarkan kepadanya, bahwa [Ali] berkata, \"Dahulu saya pernah memiliki seekor unta dari hasil pembagian harta rampasan perang Badr, pada hari itu pula Rasulullah shallallahu 'alaihi wasallam memberikan seekor unta dari bagian seperlima. Ketika hendak membina rumah tangga dengan Fatimah -puteri Rasulullah shallallahu 'alaihi wasallam- saya telah mengikat janji dengan seorang tukang emas dari Bani Qainuqa' untuk pergi bersamaku sambil membawa idzkir (semacam tumbuhan) yang akan saya jual, dan uang hasil penjualan itu dapat saya pergunakan untuk penyelenggaraan pernikahan saya. Pada saat mempersiapkan barang-barang bagi keperluan kedua unta tersebut, seperti pelana, karung dan tali. Saat itu kedua unta saya terikat di samping rumah seorang Anshar, dan ternyata saya mendapati kedua unta saya -setelah mempersiapkan barang-barang yang perlu dipersiapkan- sudah terpotong punuknya, terbelah perutnya dan telah terambil hatinya. Kedua mataku tidak kuasa melihat pemandangan itu, lalu saya bertanya, \"Siapakah yang melakukan semua ini?\" orang-orang menjawab, \"Hamzah bin Abdul Mutthalib, dan dia sekarang berada di rumah ini bersama-sama dengan orang-orang Anshar yang suka meminum minuman keras. Dia dan teman-temannya sedang dihibur oleh seorang penyanyi perempuan yang dalam salah satu nyanyiannya terselip kata-kata, 'Wahai Hamzah, ingatlah pada unta-unta yang montok.' Maka Hamzah pun berdiri dengan membawa pedang terhunus. Lalu dia memotong punuk kedua unta tersebut dan ia belah perut keduanya kemudian hati keduanya di ambil.\" Ali berkata, \"Kemudian saya langsung pergi menemui Rasulullah shallallahu 'alaihi wasallam yang pada saat itu beliau sedang duduk bersama Zaid bin Haritsah.\" Ali berkata, \"Melihat raut mukaku, ternyata Rasulullah shallallahu 'alaihi wasallam tahu akan peristiwa yang terjadi.\" Maka Rasulullah shallallahu 'alaihi wasallam bertanya: \"Apa yang terjadi denganmu?\" saya menjawab, \"Wahai Rasulullah, demi Allah belum pernah seumur hidupku melihat kejadian seperti hari ini. Hamzah telah menyerang kedua untaku, dia telah memotong punuknya dan membelah isi perutnya. Sekarang dia berada di rumah bersama teman-temannya yang suka meminum minuman keras.\" Ali berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam mengambil jubahnya. Setelah mengenakannya beliau berangkat ke rumah yang disebutkannya itu dengan berjalan kaki, sementara saya dan Zaid mengikutinya dari belakang. Sesampainya di depan pintu rumah yang di dalamnya ada Hamzah, Rasulullah shallallahu 'alaihi wasallam meminta izin masuk. Para penghuni rumah pun memberikan izin masuk. Ternyata mereka adalah para peminum minuman keras. Lalu Rasulullah shallallahu 'alaihi wasallam mulai mencela Hamzah terhadap apa yang telah diperbuatnya. Pada saat itu, kedua mata Hamzah memerah dan dia juga mulai mengamati Rasulullah shallallahu 'alaihi wasallam dari kedua lutut naik ke pusar dan akhirnya ke wajah beliau. Kemudian Hamzah berkata, \"Kalian ini tidak lain hanyalah para budak bapakku.\" Akhirnya Rasulullah shallallahu 'alaihi wasallam mengetahui bahwa Hamzah sedang mabuk berat. Lalu beliau mundur ke belakang dan keluar. Melihat itu kami pun pergi keluar mengikuti beliau.\" Dan telah menceritakan kepadaku [Muhammad bin Abdullah Al Quhzadza] telah menceritakan kepadaku [Abdullah bin Utsman] dari [Abdullah bin Mubarak] dari [Yunus] dari [Az Zuhri] dengan sanad seperti ini.\""
            },
            {
                "number": 3413,
                "arab": "حَدَّثَنِي أَبُو الرَّبِيعِ سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ أَخْبَرَنَا ثَابِتٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكُنْتُ سَاقِيَ الْقَوْمِ يَوْمَ حُرِّمَتْ الْخَمْرُ فِي بَيْتِ أَبِي طَلْحَةَ وَمَا شَرَابُهُمْ إِلَّا الْفَضِيخُ الْبُسْرُ وَالتَّمْرُ فَإِذَا مُنَادٍ يُنَادِي فَقَالَ اخْرُجْ فَانْظُرْ فَخَرَجْتُ فَإِذَا مُنَادٍ يُنَادِي أَلَا إِنَّ الْخَمْرَ قَدْ حُرِّمَتْ قَالَ فَجَرَتْ فِي سِكَكِ الْمَدِينَةِ فَقَالَ لِي أَبُو طَلْحَةَ اخْرُجْ فَاهْرِقْهَا فَهَرَقْتُهَا فَقَالُوا أَوْ قَالَ بَعْضُهُمْ قُتِلَ فُلَانٌ قُتِلَ فُلَانٌ وَهِيَ فِي بُطُونِهِمْ قَالَ فَلَا أَدْرِي هُوَ مِنْ حَدِيثِ أَنَسٍ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ لَيْسَ عَلَى الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جُنَاحٌ فِيمَا طَعِمُوا إِذَا مَا اتَّقَوْا وَآمَنُوا وَعَمِلُوا الصَّالِحَاتِ }",
                "id": "Telah menceritakan kepadaku [Abu Ar Rabi' Sulaiman bin Daud Al 'Ataki] telah menceritakan kepada kami [Hammad] -yaitu Ibnu Zaid- telah mengabarkan kepada kami [Tsabit] dari [Anas bin Malik] dia berkata, \"Saya pernah menuangkan khamer kepada sekelompok kaum di rumah Abu Thalhah ketika khamer diharamkan, dan saat itu mereka tidak minum kecuali dari Fadlih (minuman keras yang terbuat dari perasan kurma), kurma muda dan kurma masak. Tiba-tiba ada seseorang yang berseru, lantas Abu Thalhah berkata, \"Keluarlah dan lihatlah apa yang terjadi.\" Ternyata seseorang berseru, katanya, \"Tidakkah khamer telah diharamkan.\" Anas berkata, \"Kemudian berita itu tersebar ke seluruh Kota Madinah, lantas Abu Thalhah berkata kepadaku, \"Keluar dan baunglah.\" Maka saya langsung menumpahkannya. Saat itu orang-orang berkata, atau sebagian dari mereka berkata, \"Seseorang telah meninggal, sedangkan khamer tersebut masih dalam perut mereka.\" -Tsabit berkata; \"Namun saya tidak mengetahui apakah itu termasuk dari hadits Anas- Maka Allah Azza Wa Jalla berfirman: '(Tidak ada dosa bagi orang-orang yang beriman dan mengerjakan amalan shalih karena memakan makanan yang telah mereka makan dahulu, apabila mereka bertaqwa dan beriman serta beramal shalih …) ' (? Qs. Al Maidah: 93)."
            },
            {
                "number": 3414,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنَا ابْنُ عُلَيَّةَ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ قَالَ سَأَلُوا أَنَسَ بْنَ مَالِكٍ عَنْ الْفَضِيخِ فَقَالَمَا كَانَتْ لَنَا خَمْرٌ غَيْرَ فَضِيخِكُمْ هَذَا الَّذِي تُسَمُّونَهُ الْفَضِيخَ إِنِّي لَقَائِمٌ أَسْقِيهَا أَبَا طَلْحَةَ وَأَبَا أَيُّوبَ وَرِجَالًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِنَا إِذْ جَاءَ رَجُلٌ فَقَالَ هَلْ بَلَغَكُمْ الْخَبَرُ قُلْنَا لَا قَالَ فَإِنَّ الْخَمْرَ قَدْ حُرِّمَتْ فَقَالَ يَا أَنَسُ أَرِقْ هَذِهِ الْقِلَالَ قَالَ فَمَا رَاجَعُوهَا وَلَا سَأَلُوا عَنْهَا بَعْدَ خَبَرِ الرَّجُلِ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Ayyub] telah menceritakan kepada kami [Ibnu Ulayyah] telah mengabarkan kepada kami [Abdul Aziz bun Shuhaib] dia berkata, \"Orang-orang bertanya kepada [Anas bin Malik] mengenai minuman campuran kurma muda.\" Dia menjawab, \"Ketika itu kami tidak memiliki khamer selain minuman campuran kurma sebagaimana yang kalian namakan dengan Al Fadlikh. Ketika aku sedang menuangkan campuran kurma tersebut kepada Abu Thalhah, Abu Ayyub dan beberapa orang dari sahabat Rasulullah shallallahu 'alaihi wasallam di rumah kami, tiba-tiba seorang laki-laki datang sambil berkata, \"Apakah telah sampai kepada kalian suatu berita?\" kami menjawab, \"Belum.\" Dia berkata, \"Sesungguhnya Khamer telah diharamkan.\" Maka Abu Thalhah berkata, \"Wahai Anas, tumpahkanlah wadah ini.\" Anas berkata, \"Setelah laki-laki tersebut menyampaikan berita, maka mereka kembali dan tidak lagi bertanya-tanya lagi tentang hukumnya.\""
            },
            {
                "number": 3415,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ وَأَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ قَالَإِنِّي لَقَائِمٌ عَلَى الْحَيِّ عَلَى عُمُومَتِي أَسْقِيهِمْ مِنْ فَضِيخٍ لَهُمْ وَأَنَا أَصْغَرُهُمْ سِنًّا فَجَاءَ رَجُلٌ فَقَالَ إِنَّهَا قَدْ حُرِّمَتْ الْخَمْرُ فَقَالُوا اكْفِئْهَا يَا أَنَسُ فَكَفَأْتُهَا قَالَ قُلْتُ لِأَنَسٍ مَا هُوَ قَالَ بُسْرٌ وَرُطَبٌ قَالَ فَقَالَ أَبُو بَكْرِ بْنُ أَنَسٍ كَانَتْ خَمْرَهُمْ يَوْمَئِذٍقَالَ سُلَيْمَانُ وَحَدَّثَنِي رَجُلٌ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ قَالَ ذَلِكَ أَيْضًا حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ قَالَ قَالَ أَنَسٌ كُنْتُ قَائِمًا عَلَى الْحَيِّ أَسْقِيهِمْ بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ غَيْرَ أَنَّهُ قَالَ فَقَالَ أَبُو بَكْرِ بْنُ أَنَسٍ كَانَ خَمْرَهُمْ يَوْمَئِذٍ وَأَنَسٌ شَاهِدٌ فَلَمْ يُنْكِرْ أَنَسٌ ذَاكَ و قَالَ ابْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ قَالَ حَدَّثَنِي بَعْضُ مَنْ كَانَ مَعِي أَنَّهُ سَمِعَ أَنَسًا يَقُولُا كَانَ خَمْرَهُمْ يَوْمَئِذٍ",
                "id": "Dan telah menceritakan kepada kami [Yahya bin Ayyub] telah menceritakan kepada kami [Ibnu Ulayyah] dia berkata; dan telah mengabarkan kepada kami [Sulaiman At Taimi] telah menceritakan kepada kami [Anas bin Malik] dia berkata, \"Saya pernah menjadi pelayan yang bertugas menuangkan minuman kepada paman-pamanku, ketika itu saya menuangkan Fadlikh (perasan dari kurma muda) kepada mereka, saat itu aku adalah orang yang termuda di antara mereka, tiba-tiba seorang laki-laki datang sambil berkata, \"Sesungguhnya khamer telah diharamkan.\" Lantas mereka berkata, \"Wahai Anas, buanglah!\" Lalu saya menumpahkannya. Sulaiman berkata, \"Saya bertanya kepada Anas, \"Minuman apakah itu?\" Anas menjawab, \"Busyr (kurma muda) dan ruthab (kurma masak).\" Perawi berkata, \"Lalu Abu Bakar bin Anas berkata, \"Saat itu khamer mereka adalah Al Fadlih (minuman dari campuran kurma).\" [Sulaiman] berkata, \" [seorang laki-laki] menceritakan kepadaku dari [Anas bin Malik], bahwa dia berkata seperti itu juga.\" Telah menceritakan kepadaku [Muhammad bin Abdul A'la] telah menceritakan kepadaku [Al Mu'tamir] dari [ayahnya] dia berkata; [Anas] berkata, \"Saya pernah menjadi pelayan di suatu kaum untuk menuangkan minuman kepada mereka...seperti hadits Ibnu Ulayyah, hanya saja ia menyebutkan, \"Abu Bakar bin Anas mengatakan, \"Khamer mereka saat itu adalah Al Fadlikh (terbuat dari campuran kurma).\" Anas adalah orang yang saat itu menyaksikannya, maka ia pun tidak mengingkarinya.\" [Ibnu Abdul A'la] berkata; telah menceritakan kepadaku [Al Mu'tamir] dari [ayahnya] dia berkata; telah menceritakan kepadaku [sebagian orang yang bersamaku] bahwa dia pernah mendengar [Anas] berkata, \"Saat itu khamer mereka adalah Al Fadlikh.\""
            },
            {
                "number": 3416,
                "arab": "و حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ وَأَخْبَرَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكُنْتُ أَسْقِي أَبَا طَلْحَةَ وَأَبَا دُجَانَةَ وَمُعَاذَ بْنَ جَبَلٍ فِي رَهْطٍ مِنْ الْأَنْصَارِ فَدَخَلَ عَلَيْنَا دَاخِلٌ فَقَالَ حَدَثَ خَبَرٌ نَزَلَ تَحْرِيمُ الْخَمْرِ فَأَكْفَأْنَاهَا يَوْمَئِذٍ وَإِنَّهَا لَخَلِيطُ الْبُسْرِ وَالتَّمْرِقَالَ قَتَادَةُ وَقَالَ أَنَسُ بْنُ مَالِكٍ لَقَدْ حُرِّمَتْ الْخَمْرُ وَكَانَتْ عَامَّةُ خُمُورِهِمْ يَوْمَئِذٍ خَلِيطَ الْبُسْرِ وَالتَّمْرِ و حَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِيُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالُوا أَخْبَرَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ إِنِّي لَأَسْقِي أَبَا طَلْحَةَ وَأَبَا دُجَانَةَ وَسُهَيْلَ بْنَ بَيْضَاءَ مِنْ مَزَادَةٍ فِيهَا خَلِيطُ بُسْرٍ وَتَمْرٍ بِنَحْوِ حَدِيثِ سَعِيدٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ayyub] telah menceritakan kepada kami [Ibnu 'Ulayyah], dia berkata; dan telah mengabarkan kepada kami [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [Anas bin Malik] dia berkata, \"Aku pernah menuangkan (minuman) untuk Abu Thalhah, Abu Dujanah dan Mu'adz bin Jabal disekumpulan orang-orang Anshar, tiba-tiba seseorang masuk menemui kami sambil berseru, \"Ada kabar baru! khamer telah diharamkan.\" Seketika itu kami langsung menumpahkannya, sedangkan khamer waktu itu terbuat dari campuran busr (kurma muda) dan tamr (kurma kering).\" [Qatadah] berkata, \" [Anas bin Malik] berkata, \"Sungguh, khamer telah diharamkan, sedangkan pada umumnya khamer waktu itu terbuat dari campuran busr dan tamr.\" Dan telah menceritakan kepada kami [Abu Ghassan Al Misma'i] dan [Muhammad bin Al Mutsanna] dan [Ibnu Basyar] mereka berkata; telah mengabarkan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [Ayahku] dari [Qatadah] dari [Anas bin Malik] dia berkata, \"Sungguh, saya pernah menuangkan (minuman) campuran busr dan tamr kepada Abu Thalhah, Abu Dujanah dan Suhail bin Baidla` dari geriba besar....sebaimana haditsnya Sa'id.\""
            },
            {
                "number": 3417,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ أَنَّ قَتَادَةَ بْنَ دِعَامَةَ حَدَّثَهُ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُاإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُخْلَطَ التَّمْرُ وَالزَّهْوُ ثُمَّ يُشْرَبَ وَإِنَّ ذَلِكَ كَانَ عَامَّةَ خُمُورِهِمْ يَوْمَ حُرِّمَتْ الْخَمْرُ",
                "id": "Dan telah menceritakan kepadaku [Abu Thahir Ahmad bin 'Amru bin Sarh] telah mengabarkan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku ['Amru bin Al Harits] bahwa [Qatadah bin Di'amah] telah menceritakan kepadanya, bahwa dia pernah mendengar [Anas bin Malik] berkata, \"Sesugguhnya Rasulullah shallallahu 'alaihi wasallam melarang minuman dengan mencapur antara kurma masak dengan kurma muda, sebab hal itu adalah awal kali khamer diharamkan.\""
            },
            {
                "number": 3418,
                "arab": "و حَدَّثَنِي أَبُو الطَّاهِرِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ قَالَكُنْتُ أَسْقِي أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ وَأَبَا طَلْحَةَ وَأُبَيَّ بْنَ كَعْبٍ شَرَابًا مِنْ فَضِيخٍ وَتَمْرٍ فَأَتَاهُمْ آتٍ فَقَالَ إِنَّ الْخَمْرَ قَدْ حُرِّمَتْ فَقَالَ أَبُو طَلْحَةَ يَا أَنَسُ قُمْ إِلَى هَذِهِ الْجَرَّةِ فَاكْسِرْهَا فَقُمْتُ إِلَى مِهْرَاسٍ لَنَا فَضَرَبْتُهَا بِأَسْفَلِهِ حَتَّى تَكَسَّرَتْ",
                "id": "Dan telah menceritakan kepadaku [Abu At Thahir] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Malik bin Anas] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] bahwa dia berkata, \"Saya pernah menuangkan minuman dari Fadlikh (minuman yang terbuat dari campuran kurma muda) dan Tamr (minuman yang terbuat dari kurma) kepada Abu Ubaidah bin Jarrah, Abu Thalhah dan Ubay bin Ka'ab, tiba-tiba seseorang datang kepada mereka sambil berkata, \"Sesungguhnya khamer telah diharamkan.\" Lantas Abu Thalhah berkata, \"Wahai Anas, berdirilah! Ambil dan pecahlah bejana (khamer) ini.\" Kemudian saya mengambil gentong milik kami dan saya pukul bawahnya hingga pecah.\""
            },
            {
                "number": 3419,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو بَكْرٍ يَعْنِي الْحَنَفِيَّ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ حَدَّثَنِي أَبِي أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ يَقُولُالَقَدْ أَنْزَلَ اللَّهُ الْآيَةَ الَّتِي حَرَّمَ اللَّهُ فِيهَا الْخَمْرَ وَمَا بِالْمَدِينَةِ شَرَابٌ يُشْرَبُ إِلَّا مِنْ تَمْرٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abu Bakar] -yaitu Al Hanafi- telah menceritakan kepada kami [Abdul Hamid bin Ja'far] telah menceritakan kepadaku [ayahku] bahwa dia pernah mendengar [Anas bin Malik] berkata, \"Sesungguhnya Allah telah menurunkan ayat tentang pengharaman khamer, ketika itu di Madinah tidak ada khamer kecuali yang terbuat dari tamr (kurma).\""
            },
            {
                "number": 3420,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ ح و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ السُّدِّيِّ عَنْ يَحْيَى بْنِ عَبَّادٍ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الْخَمْرِ تُتَّخَذُ خَلًّا فَقَالَ لَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Yahya] telah mengabarkan kepada kami [Abdurrahman bin Mahdi]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dari [As Suddi] dari [Yahya bin 'Abbad] dari [Anas], bahwa Nabi shallallahu 'alaihi wasallam pernah ditanya mengenai khamer yang dibuat cuka, maka beliau bersabda: \"Jangan.\""
            },
            {
                "number": 3421,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ وَاللَّفْظُ لِابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِ وَائِلٍ الْحَضْرَمِيِّ أَنَّ طَارِقَ بْنَ سُوَيْدٍ الْجُعْفِيَّسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَمْرِ فَنَهَاهُ أَوْ كَرِهَ أَنْ يَصْنَعَهَا فَقَالَ إِنَّمَا أَصْنَعُهَا لِلدَّوَاءِ فَقَالَ إِنَّهُ لَيْسَ بِدَوَاءٍ وَلَكِنَّهُ دَاءٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] dan ini adalah lafadz Ibnu Al Mutsanna, keduanya berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Simak bin Harb] dari ['Alqamah bin Wa`il] dari ayahnya [Wa`il Al Hadlrami] bahwa Thariq bin Suwaid Al Ju'fi pernah bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai khamer, maka beliau pun melarangnya atau benci membuatnya.\" Lalu dia berkata, \"Saya membuatnya hanya untuk obat.\" Maka beliau bersabda: \"Khamer itu bukanlah obat, akan tetapi ia adalah penyakit.\""
            },
            {
                "number": 3422,
                "arab": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا الْحَجَّاجُ بْنُ أَبِي عُثْمَانَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ أَنَّ أَبَا كَثِيرٍ حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْخَمْرُ مِنْ هَاتَيْنِ الشَّجَرَتَيْنِ النَّخْلَةِ وَالْعِنَبَةِ",
                "id": "Telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Isma'il bin Ibrahim] telah mengabarkan kepada kami [Al Hajjaj bin Abu Utsman] telah menceritakan kepadaku [Yahya bin Abu Katsir] bahwa [Abu Katsir] telah menceritakan kepadanya dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Khamer itu bisa terbuat dari dua macam pohon ini; kurma dan anggur.\""
            },
            {
                "number": 3423,
                "arab": "و حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا أَبُو كَثِيرٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُاسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْخَمْرُ مِنْ هَاتَيْنِ الشَّجَرَتَيْنِ النَّخْلَةِ وَالْعِنَبَةِ",
                "id": "Dan telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepada kami [Abu Katsir] dia berkata; saya mendengar [Abu Hurairah] berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Khamer itu bisa terbuat dari dua macam pohon ini; kurma dan anggur.\""
            },
            {
                "number": 3424,
                "arab": "و حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ الْأَوْزَاعِيِّ وَعِكْرِمَةَ بْنِ عَمَّارٍ وَعُقْبَةَ بْنِ التَّوْأَمِ عَنْ أَبِي كَثِيرٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْخَمْرُ مِنْ هَاتَيْنِ الشَّجَرَتَيْنِ الْكَرْمَةِ وَالنَّخْلَةِوَفِي رِوَايَةِ أَبِي كُرَيْبٍ الْكَرْمِ وَالنَّخْلِ",
                "id": "Dan telah menceritakan kepada kami [Zuhair bin Harb] dan [Abu Kuraib] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Al Auza'i] dan [Ikrimah bin 'Ammar] dan ['Uqbah bi At Tau`am] dari [Abu Katsir] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: Khamer itu bisa terbuat dari dua jenis pohon ini; anggur dan kurma.\" Dan dalam riwayatnya Abu Kuraib juga menyebutkan, \"Pohon anggur dan pohon kurma.\""
            },
            {
                "number": 3425,
                "arab": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ سَمِعْتُ عَطَاءَ بْنَ أَبِي رَبَاحٍ حَدَّثَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُخْلَطَ الزَّبِيبُ وَالتَّمْرُ وَالْبُسْرُ وَالتَّمْرُ",
                "id": "Telah menceritakan kepada kami [Syaiban bin Farruh] telah menceritakan kepada kami [Jarir bin Hazim] saya mendengar ['Atha bin Abu Rabah] telah menceritakan kepada kami [Jabir bin Abdullah Al Anshari], bahwa Nabi shallallahu 'alaihi wasallam melarang mencampur antara anggur dengan kurma masak, kurma muda dengan kurma masak (untuk dibuat perasan).\""
            },
            {
                "number": 3426,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى أَنْ يُنْبَذَ التَّمْرُ وَالزَّبِيبُ جَمِيعًا وَنَهَى أَنْ يُنْبَذَ الرُّطَبُ وَالْبُسْرُ جَمِيعًا",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari ['Atha bin Abu Rabah] dari [Jabir bin Abdullah Al Anshari] dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau melarang membuat perasan kurma dengan anggur menjadi satu, dan melarang membuat perasan kurma segar (matang) dengan kurma muda menjadi satu.\""
            },
            {
                "number": 3427,
                "arab": "و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ جُرَيْجٍ ح و حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَمُحَمَّدُ بْنُ رَافِعٍ وَاللَّفْظُ لِابْنِ رَافِعٍ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ قَالَ لِي عَطَاءٌ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَجْمَعُوا بَيْنَ الرُّطَبِ وَالْبُسْرِ وَبَيْنَ الزَّبِيبِ وَالتَّمْرِ نَبِيذًا",
                "id": "Dan telah menceritakan kepadaku [Muhammad bin Hatim] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ishaq bin Ibrahim] dan [Muhammad bin Rafi'] dan ini adalah lafadz Ibnu Rafi', keduanya berkata; telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ibnu Juraij] dia berkata; ['Atha] pernah berkata; saya pernah mendengar [Jabir bin Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mencampur antara perasan ruthab (kurma segar) dengan busr (kurma muda) dan antara perasan anggur dengan tamr (kurma masak).\""
            }
        ]
    }
}