{
    "status": true,
    "data": {
        "start": 150,
        "end": 298,
        "total": 149,
        "book": "nasai",
        "hadits": [
            {
                "number": 150,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ إِلَى الْمَقْبُرَةِ فَقَالَ السَّلَامُ عَلَيْكُمْ دَارَ قَوْمٍ مُؤْمِنِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَاحِقُونَ وَدِدْتُ أَنِّي قَدْ رَأَيْتُ إِخْوَانَنَا قَالُوا يَا رَسُولَ اللَّهِ أَلَسْنَا إِخْوَانَكَ قَالَ بَلْ أَنْتُمْ أَصْحَابِي وَإِخْوَانِي الَّذِينَ لَمْ يَأْتُوا بَعْدُ وَأَنَا فَرَطُهُمْ عَلَى الْحَوْضِ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ تَعْرِفُ مَنْ يَأْتِي بَعْدَكَ مِنْ أُمَّتِكَ قَالَ أَرَأَيْتَ لَوْ كَانَ لِرَجُلٍ خَيْلٌ غُرٌّ مُحَجَّلَةٌ فِي خَيْلٍ بُهْمٍ دُهْمٍ أَلَا يَعْرِفُ خَيْلَهُ قَالُوا بَلَى قَالَ فَإِنَّهُمْ يَأْتُونَ يَوْمَ الْقِيَامَةِ غُرًّا مُحَجَّلِينَ مِنْ الْوُضُوءِ وَأَنَا فَرَطُهُمْ عَلَى الْحَوْضِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Al 'Alla bin Abdurrahman] dari [Bapaknya] dari [Abu Hurairah Radliyallahu'anhu] bahwa Rasulullah shallallahu 'alaihi wasallam keluar dari pekuburan, lantas beliau mengucapkan, \" Assalamu'alaikum wahai penghuni negeri kaum mukmin. Kami insya Allah akan menyusul kalian. Aku ingin melihat saudara-saudaraku!\" mereka berkata, \"Wahai Rasulullah, Bukankah kita semua ini bersaudara?\" beliau menjawab, \"Ya, kalian adalah sahabat dan saudaraku dan tidak akan datang lagi setelah ini. Aku akan mendahului kalian menuju Haudl.\" Mereka berkata, Wahai Rasulullah shallallahu 'alaihi wasallam! bagaimana engkau tahu orang-orang setelah engkau dari umatmu?\" beliau bersabda: \"Apakah kamu tahu kalau seseorang mempunyai seekor kuda yang ada putih-putihnya di ujung kepalanya yang berada di antara kuda-kuda yang hitam pekat? Bukankah ia akan mengenali kuda-kudanya?\" mereka berkata, \"Ya, tentu.\" Beliau meneruskan sabdanya: \"Mereka akan datang pada hari kiamat dengan wajah bersinar di wajahnya dari bekas wudlu, dan aku tidak mendahului mereka masuk ke dalam telaga (Haudl).\""
            },
            {
                "number": 151,
                "arab": "أَخْبَرَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ الْمَسْرُوقِيُّ قَالَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ قَالَ حَدَّثَنَا رَبِيعَةُ بْنُ يَزِيدَ الدِّمَشْقِيُّ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ وَأَبِي عُثْمَانَ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ الْحَضْرَمِيِّ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ صَلَّى رَكْعَتَيْنِ يُقْبِلُ عَلَيْهِمَا بِقَلْبِهِ وَوَجْهِهِ وَجَبَتْ لَهُ الْجَنَّةُ",
                "id": "Telah mengabarkan kepada kami [Musa bin Abdurrahman Al Masruqi] dia berkata; telah menceritakan kepada kami [Zaid bin Al Hubab] dia berkata; telah menceritakan kepada kami [Mu'awiyah bin Shalih] dia berkata; telah menceritakan kepada kami [Rabi'ah bin Yazid Ad-Dimasqy] dari [Abu Idris Al Khaulani] dan [Abu Usman] dari [Jubair bin Nufair Al Hadhrami] dari [Uqbah bin Amir Al juhaini], dia mengatakan bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \" Barangsiapa berwudlu dan memperbaiki wudlunya kemudian sholat dua raka'at, menghadap kepadanya dengan hati dan wajahnya, wajib baginya surga.\""
            },
            {
                "number": 152,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ عَنْ أَبِي حَصِينٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ قَالَ قَالَ عَلِيٌّكُنْتُ رَجُلًا مَذَّاءً وَكَانَتْ ابْنَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَحْتِي فَاسْتَحْيَيْتُ أَنْ أَسْأَلَهُ فَقُلْتُ لِرَجُلٍ جَالِسٍ إِلَى جَنْبِي سَلْهُ فَسَأَلَهُ فَقَالَ فِيهِ الْوُضُوءُ",
                "id": "Telah mengabarkan kepada kami [Hannad bin As Sari] dari [Abu Bakr bin 'Ayyasy] dari [Abu Hashin] dari [Abu Abdurrahman] dia berkata; [Ali] berkata, \"Aku laki-laki yang gampang keluar Madzi-nya, dan anak perempuan Nabi shallallahu 'alaihi wasallam adalah istriku, maka aku malu bertanya kepada beliau. Lalu aku bertanya kepada orang yang berada di sampingku, 'Tanyakanlah hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam\" lantas diapun bertanya kepada Rasulullah shallallahu 'alaihi wasallam, dan beliau berkata: ' Harus wudlu'.\""
            },
            {
                "number": 153,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَخْبَرَنَا جَرِيرٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَقُلْتُ لِلْمِقْدَادِ إِذَا بَنَى الرَّجُلُ بِأَهْلِهِ فَأَمْذَى وَلَمْ يُجَامِعْ فَسَلْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَإِنِّي أَسْتَحِي أَنْ أَسْأَلَهُ عَنْ ذَلِكَ وَابْنَتُهُ تَحْتِي فَسَأَلَهُ فَقَالَ يَغْسِلُ مَذَاكِيرَهُ وَيَتَوَضَّأُ وُضُوءَهُ لِلصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah mengabarkan kepada kami [Jarir] dari [Hisyam bin Urwah] dari [Bapaknya] dari [Ali] Radliyallahu'anhu, dia berkata; \"Aku berkata kepada Miqdad, \"Bila seseorang mendatangi istrinya lalu keluar madzinya dan belum bersetubuh, tolong tanyakanlah hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam. Aku malu untuk bertanya kepada beliau tentang hal tersebut, karena anak perempuannya adalah istriku\". Kemudian dia bertanya dan Rasulullah shallallahu 'alaihi wasallam bersabda; \"Hendaklah ia mencuci kemaluannya dan berwudlu sebagaimana wudlu untuk sholat'.\""
            },
            {
                "number": 154,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ عَطَاءٍ عَنْ عَائِشِ بْنِ أَنَسٍ أَنَّ عَلِيًا قَالَكُنْتُ رَجُلًا مَذَّاءً فَأَمَرْتُ عَمَّارَ بْنَ يَاسِرٍ يَسْأَلُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَجْلِ ابْنَتِهِ عِنْدِي فَقَالَ يَكْفِي مِنْ ذَلِكَ الْوُضُوءُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Amru] dari ['Atha] dari ['Aisy bin Anas] bahwasannya [Ali] berkata; \"Aku laki-laki yang gampang keluar Madzi-nya, maka aku menyuruh 'Ammar bin Yasir bertanya kepada Rasulullah shallallahu 'alaihi wasallam karena anak perempuannya adalah istriku. Lalu beliau shallallahu 'alaihi wasallam bersabda: \" Cukup dari yang demikian itu dengan berwudlu.\" "
            },
            {
                "number": 155,
                "arab": "أَخْبَرَنَا عُثْمَانُ بْنُ عَبْدِ اللَّهِ قَالَ أَنْبَأَنَا أُمَيَّةُ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ أَنَّ رَوْحَ بْنَ الْقَاسِمِ حَدَّثَهُ عَنْ ابْنِ أَبِي نُجَيْحٍ عَنْ عَطَاءٍ عَنْ إِيَاسِ بْنِ خَلِيفَةَ عَنْ رَافِعِ بْنِ خَدِيجٍأَنَّ عَلِيًّا أَمَرَ عَمَّارًا أَنْ يَسْأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمَذْيِ فَقَالَ يَغْسِلُ مَذَاكِيرَهُ وَيَتَوَضَّأُ",
                "id": "Telah mengabarkan kepada kami [Usman bin Abdullah] dia berkata, telah memberitakan kepada kami [Umayyah] dia berkata, telah menceritakan kepada kami [Yazid bin Zuro'i] bahwa [Rauh bin Al Qosim] telah menceritakannya dari [Ibnu Abu Nujaih] dari ['Atho] dari [Iyas bin Khalifah] dari [Rafi' bin Khadij] bahwa Ali pernah menyuruh Amar untuk menanyakan tentang Madzi kepada Rasulullah shallallahu 'alaihi wasallam, beliau menjawab: \"Hendaknya ia mencuci kemaluannya lalu berwudlu'.\""
            },
            {
                "number": 156,
                "arab": "أَخْبَرَنَا عُتْبَةُ بْنُ عَبْدِ اللَّهِ الْمَرْوَزِيُّ عَنْ مَالِكٍ وَهُوَ ابْنُ أَنَسٍ عَنْ أَبِي النَّضْرِ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ الْمِقْدَادِ بْنِ الْأَسْوَدِأَنَّ عَلِيًّا أَمَرَهُ أَنْ يَسْأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرَّجُلِ إِذَا دَنَا مِنْ أَهْلِهِ فَخَرَجَ مِنْهُ الْمَذْيُ مَاذَا عَلَيْهِ فَإِنَّ عِنْدِي ابْنَتَهُ وَأَنَا أَسْتَحِي أَنْ أَسْأَلَهُ فَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَقَالَ إِذَا وَجَدَ أَحَدُكُمْ ذَلِكَ فَلْيَنْضَحْ فَرْجَهُ وَيَتَوَضَّأْ وُضُوءَهُ لِلصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami ['Utbah bin Abdullah Al Marwazi] dari [Malik yaitu Ibnu Anas] dari [Abu Nadhr] dari [Sulaiman bin Yasar] dari [Miqad bin Al Aswad], bahwa Ali memerintahkannya untuk bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang orang yang ingin mendekati istrinya, tetapi keluarlah air madzi, apakah yang harus ia perbuat? Anak perempuan nabi adalah istriku, sehingga aku malu menanyakan hal tersebut, dan beliau menjawab, \" Bila salah seorang dari kalian mendapatkan seperti itu, hendaklah ia memercikkan kemaluannya dengan air, lalu berwudlu sebagai mana wudlu sholat.\""
            },
            {
                "number": 157,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعَلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ قَالَ أَخْبَرَنِي سُلَيْمَانُ قَالَ سَمِعْتُ مُنْذِرًا عَنْ مُحَمَّدِ بْنِ عَلِيٍّ عَنْ عَلِيٍّ قَالَاسْتَحْيَيْتُ أَنْ أَسْأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمَذْيِ مِنْ أَجْلِ فَاطِمَةَ فَأَمَرْتُ الْمِقْدَادَ بْنَ الْأَسْوَدِ فَسَأَلَهُ فَقَالَ فِيهِ الْوُضُوءُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] dari [Syu'bah] dia berkata; Telah mengabarkan kepadaku [Sulaiman] dia berkata; Saya mendengar [Mundzir] dari [Muhammad bin Ali] dari [Ali] dia berkata; \"Aku malu bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang madzi karena Fatimah, jadi aku menyuruh Miqdad bin Al Aswad untuk bertanya. Lalu dia bertanya, dan Rasulullah shallallahu 'alaihi wasallam menjawab: Mengenai hal itu, maka ia harus wudlu.\""
            },
            {
                "number": 158,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ أَنَّهُ سَمِعَ زِرَّ بْنَ حُبَيْشٍ يُحَدِّثُ قَالَأَتَيْتُ رَجُلًا يُدْعَى صَفْوَانَ بْنَ عَسَّالٍ فَقَعَدْتُ عَلَى بَابِهِ فَخَرَجَ فَقَالَ مَا شَأْنُكَ قُلْتُ أَطْلُبُ الْعِلْمَ قَالَ إِنَّ الْمَلَائِكَةَ تَضَعُ أَجْنِحَتَهَا لِطَالِبِ الْعِلْمِ رِضًا بِمَا يَطْلُبُ فَقَالَ عَنْ أَيِّ شَيْءٍ تَسْأَلُ قُلْتُ عَنْ الْخُفَّيْنِ قَالَ كُنَّا إِذَا كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ أَمَرَنَا أَنْ لَا نَنْزِعَهُ ثَلَاثًا إِلَّا مِنْ جَنَابَةٍ وَلَكِنْ مِنْ غَائِطٍ وَبَوْلٍ وَنَوْمٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] telah menceritakan kepada kami [Syu'bah] dari ['Ashim] bahwasannya dia mendengar [Zirr bin Hubaisy] berkata; \"Aku datang kepada seseorang yang biasa dipanggil [Shafwan bin Assal], dan aku duduk di depan pintunya. Kemudian dia keluar dan berkata, 'Ada apa denganmu? ' Aku menjawab, 'Aku ingin menuntut ilmu'. Ia berkata, para malaikat meletakkan sayap-sayapnya kepada para pemburu ilmu, sebagai tanda keridhaan terhadap mereka'. Lalu dia berkata, ' kamu mau tanya masalah apa? ' Aku berkata, 'tentang dua sepatu khuf.' Dia menjawab, 'Dulu jika kami dalam perjalanan bersama Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk tidak melepasnya selama tiga hari, kecuali karena junub. Akan tetapi (boleh tidak lepas) karena buang air besar atau buang air kecil atau tertidur'.\""
            },
            {
                "number": 159,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَإِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَا حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ عَنْ زِرٍّ قَالَقَالَ صَفْوَانُ بْنُ عَسَّالٍ كُنَّا إِذَا كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ أَمَرَنَا أَنْ لَا نَنْزِعَهُ ثَلَاثًا إِلَّا مِنْ جَنَابَةٍ وَلَكِنْ مِنْ غَائِطٍ وَبَوْلٍ وَنَوْمٍ",
                "id": "Telah mengabarkan kepada kami [Amru bin Ali] dan [Ismail bin Mas'ud] keduanya berkata; telah menceritakan kepada kami [Yazid bin Zura'i] berkata; telah menceritakan kepada kami [Syu'bah] dari ['Ashim] dari [Zirr] berkata; [Shafwan bin Assal] berkata, \"kami dulu bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan, dan beliau memerintahkan kami untuk tidak melepas sepatu (khuf) selama tiga hari kecuali karena junub. Akan tetapi boleh kalau karena buang air besar dan buang air kecil, atau dari tidur.\""
            },
            {
                "number": 160,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ ح و أَخْبَرَنِي مُحَمَّدُ بْنُ مَنْصُورٍ عَنْ سُفْيَانَ قَالَ حَدَّثَنَا الزُّهْرِيُّ قَالَ أَخْبَرَنِي سَعِيدٌ يَعْنِي ابْنَ الْمُسَيَّبِ وَعَبَّادُ بْنُ تَمِيمٍ عَنْ عَمِّهِ وَهُوَ عَبْدُ اللَّهِ بْنُ زَيْدٍ قَالَشُكِيَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الرَّجُلُ يَجِدُ الشَّيْءَ فِي الصَّلَاةِ قَالَ لَا يَنْصَرِفْ حَتَّى يَجِدَ رِيحًا أَوْ يَسْمَعَ صَوْتًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Sufyan] dari [Az-Zuhri]. Dari jalur periwayatan yang lain juga disebutkan; dan Telah mengabarkan kepadaku [Muhammad bin Manshur] dari [Sufyan] berkata; telah menceritakan kepada kami [Az-Zuhri] berkata; Telah mengabarkan kepada ku [Sa'id yaitu Ibnu Musayyab] dan ['Abbad bin Tamim] dari pamannya yaitu [Abdullah bin Zaid] dia berkata; \"Diadukan kepada Rasulullah shallallahu 'alaihi wasallam tentang seorang laki-laki yang mendapati sesuatu ketika sedang sholat?\" Beliau bersabda: \" Janganlah keluar (dari sholat) hingga ia mencium bau atau mendengar suara (kentut).\""
            },
            {
                "number": 161,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ وَحُمَيْدُ بْنُ مَسْعَدَةَ قَالَا حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ مَنَامِهِ فَلَا يُدْخِلْ يَدَهُ فِي الْإِنَاءِ حَتَّى يُفْرِغَ عَلَيْهَا ثَلَاثَ مَرَّاتٍ فَإِنَّهُ لَا يَدْرِي أَيْنَ بَاتَتْ يَدُهُ",
                "id": "Telah mengabarkan kepada kami [Ismail bin Mas'ud] dan [Humaid bin Mas'adah] keduanya berkata; telah menceritakan kepada kami [Yazid bin Zura'i] berkata; telah menceritakan kepada kami [Ma'mar] dari [Az-Zuhri] dari [Abu Salamah] dari [Abu Hurairah] Radliyallahu'anhu, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda; \" Apabila salah seorang dari kalian bangun dari tidurnya, janganlah memasukkan tangannya ke bejana air sehingga dia menuangkan ke tangannya sebanyak tiga kali, karena dia tidak tahu dimana tangannya berada (pada waktu dia tidur).\""
            },
            {
                "number": 162,
                "arab": "أَخْبَرَنَا بِشْرُ بْنُ هِلَالٍ قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ أَيُّوبَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا نَعَسَ الرَّجُلُ وَهُوَ فِي الصَّلَاةِ فَلْيَنْصَرِفْ لَعَلَّهُ يَدْعُو عَلَى نَفْسِهِ وَهُوَ لَا يَدْرِي",
                "id": "Telah mengabarkan kepada kami [Bisyir bin Hilal] dia berkata; telah menceritakan kepada kami [Abdul Warits] dari [Ayyub] dari [Hisyam bin Urwah] dari [Bapaknya] dari [Aisyah Radliyallahu'anha] dia berkata; Bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \" Apabila seseorang mengantuk dalam sholatnya hendaklah ia menghentikan, karena mungkin dia berdo'a untuk kecelakaan (kebinasaan) bagi dirinya sendiri sedang dia tidak menyadarinya!\""
            },
            {
                "number": 163,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مَعْنٌ أَنْبَأَنَا مَالِكٌ ح وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ أَنْبَأَنَا مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ أَنَّهُ سَمِعَ عُرْوَةَ بْنَ الزُّبَيْرِ يَقُولُ دَخَلْتُ عَلَى مَرْوَانَ بْنِ الْحَكَمِ فَذَكَرْنَا مَا يَكُونُ مِنْهُ الْوُضُوءُ فَقَالَ مَرْوَانُ مِنْ مَسِّ الذَّكَرِ الْوُضُوءُ فَقَالَ عُرْوَةُ مَا عَلِمْتُ ذَلِكَ فَقَالَ مَرْوَانُ أَخْبَرَتْنِي بُسْرَةُ بِنْتُ صَفْوَانَأَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا مَسَّ أَحَدُكُمْ ذَكَرَهُ فَلْيَتَوَضَّأْ",
                "id": "Telah mengabarkan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Ma'an] Telah memberitakan kepada kami [Malik] dan [Al Harits bin Miskin] telah dibacakan kepadanya dan saya mendengarnya dari [Ibnu Qasim] berkata; Telah memberitakan kepada kami [Malik] dari [Abdullah bin Abu Bakr bin Muhammad bin Amr bin Hazim] bahwasannya dia mendengar [Urwah bin zubair] berkata; \"Aku menemui Marwan bin Hakam, lalu kami menyebutkan hal yang mengharuskan untuk berwudlu. Lalu Marwan berkata, menyentuh kemaluan\". Urwah berkata, \"Aku tidak tahu hal tersebut. Lalu [Marwan] berkata lagi, Telah mengabarkan kepadaku ' [Busrah binti Shafwan] bahwa dia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda, \" Apabila salah seorang dari kalian menyentuh kemaluannya, hendaklah ia berwudlu.\""
            },
            {
                "number": 164,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ الْمُغِيرَةِ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ سَعِيدٍ عَنْ شُعَيْبٍ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ أَنَّهُ سَمِعَ عُرْوَةَ بْنَ الزُّبَيْرِ يَقُولُ ذَكَرَ مَرْوَانُ فِي إِمَارَتِهِ عَلَى الْمَدِينَةِ أَنَّهُ يُتَوَضَّأُ مِنْ مَسِّ الذَّكَرِ إِذَا أَفْضَى إِلَيْهِ الرَّجُلُ بِيَدِهِ فَأَنْكَرْتُ ذَلِكَ وَقُلْتُ لَا وُضُوءَ عَلَى مَنْ مَسَّهُ فَقَالَ مَرْوَانُ أَخْبَرَتْنِي بُسْرَةُ بِنْتُ صَفْوَانَأَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ مَا يُتَوَضَّأُ مِنْهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيُتَوَضَّأُ مِنْ مَسِّ الذَّكَرِقَالَ عُرْوَةُ فَلَمْ أَزَلْ أُمَارِي مَرْوَانَ حَتَّى دَعَا رَجُلًا مِنْ حَرَسِهِ فَأَرْسَلَهُ إِلَى بُسْرَةَ فَسَأَلَهَا عَمَّا حَدَّثَتْ مَرْوَانَ فَأَرْسَلَتْ إِلَيْهِ بُسْرَةُ بِمِثْلِ الَّذِي حَدَّثَنِي عَنْهَا مَرْوَانُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Muhammad bin Al Mughirah] dia berkata; telah menceritakan kepada kami [Usman bin Sa'id] dari [Syu'aib] dari [Az-Zuhri] dia berkata; Telah mengabarkan kepadaku [Abdullah bin Abu Bakr bin Amr bin Hazim] bahwasannya dia mendengar [Urwah bin Zubair] berkata; \"Marwan menyebutkan pada masa pemerintahannya di Madinah, bahwa hendaklah berwudlu karena memegang kemaluan dengan tangannya. Aku mengingkarinya dan aku mengatakan, 'tidak ada wudlu bagi yang menyentuhnya! ' lalu [Marwan] berkata, ['Busrah bin Shafwan] mengabarkan kepadaku bahwa dia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda, \" Hendaklah berwudlu karena menyentuh kemaluan.\" Urwah berkata, \"Tapi aku masih saja mendebat Marwan hingga dia memanggil seorang pengawalnya. dia mengutus kepada Busrah untuk menanyakan tentang hal yang dia kabarkan kepada Marwan, Kemudian Busrah mengabarkan seperti apa yang telah di kabarkan oleh Marwan kepadaku.\""
            },
            {
                "number": 165,
                "arab": "أَخْبَرَنَا هَنَّادٌ عَنْ مُلَازِمٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَدْرٍ عَنْ قَيْسِ بْنِ طَلْقِ بْنِ عَلِيٍّ عَنْ أَبِيهِ قَالَخَرَجْنَا وَفْدًا حَتَّى قَدِمْنَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَايَعْنَاهُ وَصَلَّيْنَا مَعَهُ فَلَمَّا قَضَى الصَّلَاةَ جَاءَ رَجُلٌ كَأَنَّهُ بَدَوِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ مَا تَرَى فِي رَجُلٍ مَسَّ ذَكَرَهُ فِي الصَّلَاةِ قَالَ وَهَلْ هُوَ إِلَّا مُضْغَةٌ مِنْكَ أَوْ بَضْعَةٌ مِنْكَ",
                "id": "Telah mengabarkan kepada kami [Hannad] dari [Mulazim] dia berkata; telah menceritakan kepada kami [Abdullah bin Badr] dari [Qais bin Thalq bin Ali] dari [Bapaknya] dia berkata; \"Kami keluar (dari daerah kami) hingga kami sampai kepada Rasulullah shallallahu 'alaihi wasallam. Lalu kami berbaiat kepadanya dan sholat bersamanya. Setelah selesai sholat datanglah seseorang yang kelihatannya seorang badui, dia berkata, 'Wahai Rasulullah shallallahu 'alaihi wasallam, Apa pendapat engkau tentang orang yang menyentuh kemaluannya ketika sholat? ' Rasulullah shallallahu 'alaihi wasallam menjawab, ' Bukankah itu hanya bagian dari dagingmu? '"
            },
            {
                "number": 166,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ قَالَ أَنْبَأَنَا ابْنُ الْهَادِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ الْقَاسِمِ عَنْ عَائِشَةَ قَالَتْإِنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيُصَلِّي وَإِنِّي لَمُعْتَرِضَةٌ بَيْنَ يَدَيْهِ اعْتِرَاضَ الْجَنَازَةِ حَتَّى إِذَا أَرَادَ أَنْ يُوتِرَ مَسَّنِي بِرِجْلِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Al Hakam] dari [Syu'aib] dari [Laits] dia berkata; Telah memberitakan kepada kami [Ibnu Had] dari [Abdurrahman bin Qasim] dari [Al Qasim] dari [Aisyah] dia berkata; \" Jika Rasulullah shallallahu 'alaihi wasallam sholat dan aku berbaring di depannya laksana mayat, apabila beliau ingin melakukan sholat witir, beliau menyentuhku dengan kakinya.\""
            },
            {
                "number": 167,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ سَمِعْتُ الْقَاسِمَ بْنَ مُحَمَّدٍ يُحَدِّثُ عَنْ عَائِشَةَ قَالَتْلَقَدْ رَأَيْتُمُونِي مُعْتَرِضَةً بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فَإِذَا أَرَادَ أَنْ يَسْجُدَ غَمَزَ رِجْلِي فَضَمَمْتُهَا إِلَيَّ ثُمَّ يَسْجُدُ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; telah menceritakan kepada kami [Yahya] dari ['ubaidhullah] berkata; Saya mendengar [Al Qasim bin Muhammad] berkata; dari [Aisyah] dia berkata; \" Kalian telah mengetahui bahwa aku berbaring di depan Rasulullah shallallahu 'alaihi wasallam padahal Rasulullah shallallahu 'alaihi wasallam sedang sholat. Apabila beliau hendak sujud, maka beliau meraba kakiku, lalu aku menarik kakiku, kemudian beliau sujud.\""
            },
            {
                "number": 168,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ أَبِي النَّضْرِ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْكُنْتُ أَنَامُ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرِجْلَايَ فِي قِبْلَتِهِ فَإِذَا سَجَدَ غَمَزَنِي فَقَبَضْتُ رِجْلَيَّ فَإِذَا قَامَ بَسَطْتُهُمَا وَالْبُيُوتُ يَوْمِئِذٍ لَيْسَ فِيهَا مَصَابِيحُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Abu Nadhr] dari [Abu Salamah] dari [Aisyah] dia berkata; \" Aku pernah tidur di depan Rasulullah shallallahu 'alaihi wasallam dan kedua kakiku berada di kiblatnya. Apabila sujud beliau menyentuh kakiku dan apabila beliau berdiri aku membentangkan lagi kedua kakiku, lalu aku menarik kedua kakiku, dan saat itu di dalamnya tidak ada lampunya.\""
            },
            {
                "number": 169,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ وَنُصَيْرُ بْنُ الْفَرَجِ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْفَقَدْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَجَعَلْتُ أَطْلُبُهُ بِيَدِي فَوَقَعَتْ يَدِي عَلَى قَدَمَيْهِ وَهُمَا مَنْصُوبَتَانِ وَهُوَ سَاجِدٌ يَقُولُ أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ وَأَعُوذُ بِكَ مِنْكَ لَا أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Al Mubarak] dan [Nushair bin Al Faraj] dan lafazh ini darinya, keduanya berkata; telah menceritakan kepada kami [Abu Usamah] dari [ubaidhullah bin Umar] dari [Muhammad bin Yahya bin Habbad] dari [Al A'raj] dari [Abu Hurairah] dari [Aisyah] dia berkata; \"Pada suatu malam aku kehilangan Rasulullah shallallahu 'alaihi wasallam dan aku mencari-carinya dengan kedua tanganku. Lalu kedua tanganku menyentuh kedua kakinya yang berdiri tegak, sedangkan beliau sedang dalam keadaan sujud. Beliau mengucapkan (do'a), ' aku berlindung dengan ridha-Mu dari murka-Mu dan berlindung dengan sikap pemaaf-Mu dari siksa-Mu, dan berlindung dengan-Mu dari Engkau. Aku tidak bisa menghitung pujian kepada Engkau sebagaimana Engkau memuji diri-Mu sendiri'.\""
            },
            {
                "number": 170,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سُفْيَانَ قَالَ أَخْبَرَنِي أَبُو رَوْقٍ عَنْ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُقَبِّلُ بَعْضَ أَزْوَاجِهِ ثُمَّ يُصَلِّي وَلَا يَتَوَضَّأُقَالَ أَبُو عَبْد الرَّحْمَنِ لَيْسَ فِي هَذَا الْبَابِ حَدِيثٌ أَحْسَنُ مِنْ هَذَا الْحَدِيثِ وَإِنْ كَانَ مُرْسَلًا وَقَدْ رَوَى هَذَا الْحَدِيثَ الْأَعْمَشُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَ يَحْيَى الْقَطَّانُ حَدِيثُ حَبِيبٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ هَذَا وَحَدِيثُ حَبِيبٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ تُصَلِّ وَإِنْ قَطَرَ الدَّمُ عَلَى الْحَصِيرِ لَا شَيْءَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dari [Yahya bin Sa'id] dari [Sufyan] dia berkata; Telah mengabarkan kepadaku [Abu Rauq] dari [Ibrahim At-Taimi] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah mencium sebagian istrinya, kemudian sholat tanpa berwudlu lagi. Abu Abdurrahman berkata; tidak ada dalam bab ini sebuah hadits yang lebih baik dari hadist ini, walaupun hadits ini Mursal. Hadits ini telah diriwayatkan oleh [Al A'masy] dari [Habib bin Abu Tsabit] dari [Urwah] dari [Aisyah]. Yahya Al Qathan berkata; \"Ini adalah hadits Habib, dari Urwah dari Aisyah. "
            },
            {
                "number": 171,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا إِسْمَعِيلُ وَعَبْدُ الرَّزَّاقِ قَالَا حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ قَارِظٍ عَنْ أَبِي هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ تَوَضَّئُوا مِمَّا مَسَّتْ النَّارُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah memberitakan kepada kami [Ismail] dan [Abdurrazzak] keduanya berkata; telah menceritakan kepada kami [Ma'mar] dari [Az-Zuhri] dari [Umar bin Abdul Aziz] dari [Ibrahim bin Abdullah bin Qarizh] dari [Abu Hurairah] dia berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: ' Berwudlulah kalian karena memakan sesuatu yang disentuh (dimasak dengan) api'.\" "
            },
            {
                "number": 172,
                "arab": "أَخْبَرَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ قَالَ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ حَرْبٍ قَالَ حَدَّثَنِي الزُّبَيْدِيُّ عَنْ الزُّهْرِيِّ أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ قَارِظٍ أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ تَوَضَّئُوا مِمَّا مَسَّتْ النَّارُ",
                "id": "Telah mengabarkan kepada kami [Hisyam bin Abdul Malik] dia berkata; telah menceritakan kepada kami [Muhammad yaitu Ibnu Harb] berkata; telah menceritakan kepadaku [Az-Zubaidi] dari [Az-Zuhri] sesungguhnya [Umar bin Abdul Aziz] Telah mengabarkan kepadanya bahwasannya [Abdullah bin Qarizh] Telah mengabarkan kepadanya bahwa [Abu Hurairah] berkata; 'Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda': \" Berwudlulah kalian dari -makanan sesuatu - yang disentuh (dimasak dengan) api'.\""
            },
            {
                "number": 173,
                "arab": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا إِسْحَقُ بْنُ بَكْرٍ وَهُوَ ابْنُ مُضَرَ قَالَ حَدَّثَنِي أَبِي عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ بَكْرِ بْنِ سَوَادَةَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ بْنِ قَارِظٍ قَالَرَأَيْتُ أَبَا هُرَيْرَةَ يَتَوَضَّأُ عَلَى ظَهْرِ الْمَسْجِدِ فَقَالَ أَكَلْتُ أَثْوَارَ أَقِطٍ فَتَوَضَّأْتُ مِنْهَا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ بِالْوُضُوءِ مِمَّا مَسَّتْ النَّارُ",
                "id": "Telah mengabarkan kepada kami [Ar-Rabi' bin Sulaiman] dia berkata; telah menceritakan kepada kami [Ishaq bin Bakr yaitu Ibnu Mudlar] dia berkata; telah menceritakan kepadaku [Bapakku] dari [Ja'far bin Rabi'ah] dari [Bakr bin Sawadah] dari [Muhammad bin Muslim] dari [Umar bin Abdul 'Aziz] dari [Abdullah bin Ibrahim bin Qarizh] dia berkata; \"Aku melihat [Abu Hurairah] berwudlu di belakang masjid, lalu dia berkata, 'Aku memakan sepotong daging sapi lalu berwudlu karenanya, aku mendengar Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk berwudlu karena (memakan sesuatu yang dimasak) dengan api'.\""
            },
            {
                "number": 174,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ قَالَ حَدَّثَنَا أَبِي عَنْ حُسَيْنٍ الْمُعَلِّمِ قَالَ حَدَّثَنِي يَحْيَىَ بْنُ أَبِي كَثِيرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرٍو الْأَوْزَاعِيِّ أَنَّهُ سَمِعَ الْمُطَّلِبَ بْنَ عَبْدِ اللَّهِ بْنِ حَنْطَبٍ يَقُولُقَالَ ابْنُ عَبَّاسٍ أَتَوَضَّأُ مِنْ طَعَامٍ أَجِدُهُ فِي كِتَابِ اللَّهِ حَلَالًا لِأَنَّ النَّارَ مَسَّتْهُ فَجَمَعَ أَبُو هُرَيْرَةَ حَصًى فَقَالَ أَشْهَدُ عَدَدَ هَذَا الْحَصَى أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَوَضَّئُوا مِمَّا مَسَّتْ النَّارُ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Ya'qub] dia berkata; telah menceritakan kepada kami [Abdu Shamad bin Abdul Warits] berkata; telah menceritakan kepada kami [Bapakku] dari [Husain Al Mu'allim] berkata; telah menceritakan kepadaku [Yahya bin Abu Katsir] dari [Abdurrahman bin Amr Al Auza'i] bahwasannya dia mendengar [Al Muthallib bin Abdullah bin Hanthab] berkata; Ibnu Abbas berkata: \"Apakah aku harus wudlu karena (makan) makanan halal yang aku dapati di dalam Al-Qur'an karena di sentuh (dimasak dengan) api?\" lalu [Abu Hurairah] mengambil kerikil dan berkata, \"Aku bersaksi sebanyak kerikil-kerikil ini, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \" Berwudlulah kalian karena memakan makanan yang dimasak dengan api'.\""
            },
            {
                "number": 175,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ يَحْيَى بْنِ جَعْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرٍو عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَوَضَّئُوا مِمَّا مَسَّتْ النَّارُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basyar] berkata; telah menceritakan kepada kami [Ibnu Abu Adi] dari [Syu'bah] dari [Amr bin Dinar] dari [Yahya bin Ja'dah] dari [Abdullah bin Umar] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \" Berwudlulah kalian karena memakan sesuatu yang di sentuh (dimasak dengan) api.\""
            },
            {
                "number": 176,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا أَنْبَأَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ يَحْيَى بْنِ جَعْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ مُحَمَّدٌ الْقَارِيُّ عَنْ أَبِي أَيُّوبَ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّئُوا مِمَّا غَيَّرَتْ النَّارُ",
                "id": "Telah mengabarkan kepada kami [Amr bin Ali] dan [Muhammad bin Basyar] keduanya berkata; Telah memberitakan kepada kami [Ibnu Abu Adi] dari [Syu'bah] dari [Amr bin Dinar] dari [Yahya bin Ja'dah] dari [Abdullah bin 'Amru]. [Muhammad Al Qari] berkata; dari [Abu Ayyub] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Berwudlulah karena (memakan) sesuatu yang di rubah (dimasak, diolah dengan) api.\""
            },
            {
                "number": 177,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ وَهَارُونُ بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا حَرَمِيٌّ وَهُوَ ابْنُ عُمَارَةَ بْنِ أَبِي حَفْصَةَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَمِعْتُ يَحْيَى بْنَ جَعْدَةَ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو الْقَارِيِّ عَنْ أَبِي طَلْحَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَوَضَّئُوا مِمَّا غَيَّرَتْ النَّارُ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Sa'id] dan [Harun bin Abdullah] keduanya berkata; telah menceritakan kepada kami [Harami yaitu Ibnu 'Umarah bin Abu Hafshah] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Amr bin Dinar] berkata; \"Saya telah mendengar [Yahya bin Ja'dah] berkata; dari [Abdullah bin Amr Al Qari] dari [Abu Thalhah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \" Berwudlulah kalian karena (memakan) sesuatu yang di rubah (dimasak, diolah dengan) api.\""
            },
            {
                "number": 178,
                "arab": "أَخْبَرَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا الزُّبَيْدِيُّ قَالَ أَخْبَرَنِي الزُّهْرِيُّ أَنَّ عَبْدَ الْمَلِكِ بْنَ أَبِي بَكْرٍ أَخْبَرَهُ أَنَّ خَارِجَةَ بْنَ زَيْدِ بْنِ ثَابِتٍ أَخْبَرَهُ أَنَّ زَيْدَ بْنَ ثَابِتٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ تَوَضَّئُوا مِمَّا مَسَّتْ النَّارُ",
                "id": "Telah mengabarkan kepada kami [Hisyam bin Abdul Malik] dia berkata; telah menceritakan kepada kami [Muhammad] berkata; telah menceritakan kepada kami [Az-Zubaidi] berkata; Telah mengabarkan kepadaku [Az-Zuhri] bahwasanya [Abdul Malik bin Abu Bakar] Telah mengabarkan kepadanya bahwa [Kharijah bin Zaid bin Tsabit] Telah mengabarkan kepadanya, Bahwa [Zaid bin Tsabit] berkata: \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \" Berwudlulah karena (memakan) sesuatu yang disentuh (dimasak, dipanggang dengan) api'.\""
            },
            {
                "number": 179,
                "arab": "أَخْبَرَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ قَالَ حَدَّثَنَا ابْنُ حَرْبٍ قَالَ حَدَّثَنَا الزُّبَيْدِيُّ عَنْ الزُّهْرِيِّ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ أَخْبَرَهُ عَنْ أَبِي سُفْيَانَ بْنِ سَعِيدِ بْنِ الْأَخْنَسِ بْنِ شَرِيقٍ أَنَّهُ أَخْبَرَهُأَنَّهُ دَخَلَ عَلَى أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ خَالَتُهُ فَسَقَتْهُ سَوِيقًا ثُمَّ قَالَتْ لَهُ تَوَضَّأْ يَا ابْنَ أُخْتِي فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَوَضَّئُوا مِمَّا مَسَّتْ النَّارُ",
                "id": "Telah mengabarkan kepada kami [Hisyam bin Abdul Malik] dia berkata; telah menceritakan kepada kami [Ibnu Harb] berkata; telah menceritakan kepada kami [Az-Zubaidi] dari [Az-Zuhri] bahwasannya [Abu Salamah bin Abdurrahman] Telah mengabarkan kepadaku dari [Abu Sufyan bin Sa'id bin Al-Akhnas bin Syariq], bahwa dia menemui [Ummu Habibah] -istri Rasulullah shallallahu 'alaihi wasallam dan dia adalah bibi dari ibunya- lalu memberi sawik (makanan dari tepung gandum), kemudian berkata kepadanya, \"Berwudlulah wahai keponakanku, karena Rasulullah shallallahu 'alaihi wasallam bersabda: ' Berwudlulah dari sesuatu yang terpanggang oleh api'.\""
            },
            {
                "number": 180,
                "arab": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ قَالَ حَدَّثَنَا إِسْحَقُ بْنُ بَكْرِ بْنِ مُضَرَ قَالَ حَدَّثَنِي بَكْرُ بْنُ مُضَرَ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ بَكْرِ بْنِ سَوَادَةَ عَنْ مُحَمَّدِ بْنِ مُسْلِمِ بْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي سُفْيَانَ بْنِ سَعِيدِ بْنِ الْأَخْنَسِ أَنَّ أُمَّ حَبِيبَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ لَهُوَشَرِبَ سَوِيقًا يَا ابْنَ أُخْتِي تَوَضَّأْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ تَوَضَّئُوا مِمَّا مَسَّتْ النَّارُ",
                "id": "Telah mengabarkan kepada kami [Ar-Rabi' bin Sulaiman bin Daud] dia berkata; telah menceritakan kepada kami [Ishaq bin Bakr bin Mudlar] berkata; telah menceritakan kepadaku [Bakr bin Mudlar] dari [Ja'far bin Rabi'ah] dari [Bakr bin Sawadah] dari [Muhammad bin Muslim bin Syihab] dari [Abu Salamah bin Abdurrahman] dari [Abu Sufyan bin Sa'id bin Al Akhnas bin Syariq], bahwa [Ummu Habibah] -istri Rasulullah shallallahu 'alaihi wasallam -berkata kepadanya, -dan Abu Sufyan baru saja makan sawik (makanan dari tepung gandum) -: \"Wahai keponakanku! Berwudlulah, karena aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \" Berwudlulah karena memakan sesuatu yang disentuh oleh (dimasak dengan) api'.\""
            },
            {
                "number": 181,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَلَ كَتِفًا فَجَاءَهُ بِلَالٌ فَخَرَجَ إِلَى الصَّلَاةِ وَلَمْ يَمَسَّ مَاءً",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Yahya] dari [Ja'far bin Muhammad] dari [Bapaknya] dari [Ali bin Husain] dari [Zainab bin Ummu Salamah] dari [Ummu Salamah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah makan daging bagian paha, lalu datang Bilal, kemudian beliau keluar untuk sholat dan beliau tidak berwudlu lagi. "
            },
            {
                "number": 182,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ مُحَمَّدِ بْنِ يُوسُفَ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ قَالَدَخَلْتُ عَلَى أُمِّ سَلَمَةَ فَحَدَّثَتْنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصْبِحُ جُنُبًا مِنْ غَيْرِ احْتِلَامٍ ثُمَّ يَصُومُ وَحَدَّثَنَا مَعَ هَذَا الْحَدِيثِ أَنَّهَا حَدَّثَتْهُ أَنَّهَا قَرَّبَتْ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَنْبًا مَشْوِيًّا فَأَكَلَ مِنْهُ ثُمَّ قَامَ إِلَى الصَّلَاةِ وَلَمْ يَتَوَضَّأْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] berkata; telah menceritakan kepada kami [Ibnu Juraij] dari [Muhammad bin Yusuf] dari [Sulaiman bin Yasar] dia berkata; \"Aku pernah menemui [Ummu Salamah] lalu beliau menceritakan kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam pernah bangun subuh dalam keadaan junub bukan karena mimpi. Beliau lalu berpuasa -selain Sulaiman bin Yasar menceritai kami hadits ini, namun Ummu Salamah memberitahukan kepadanya- bahwa dia menghidangkan kepada beliau shallallahu 'alaihi wasallam daging bagian pundak (paha) yang di bakar. Beliau memakannya, lalu beliau sholat tanpa berwudlu lagi.\""
            },
            {
                "number": 183,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ يُوسُفَ عَنْ ابْنِ يَسَارٍ عَنْ ابْنِ عَبَّاسٍ قَالَشَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَلَ خُبْزًا وَلَحْمًا ثُمَّ قَامَ إِلَى الصَّلَاةِ وَلَمْ يَتَوَضَّأْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] berkata; telah menceritakan kepada kami [Ibnu Juraij] berkata; telah menceritakan kepadaku [Muhammad bin Yusuf] dari [Ibnu Yasar] dari [Ibnu Abbas] dia berkata; \"Aku melihat Rasulullah shallallahu 'alaihi wasallam memakan roti dan daging, kemudian melaksanakan sholat tanpa berwudlu lagi.\""
            },
            {
                "number": 184,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ قَالَ حَدَّثَنَا شُعَيْبٌ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَكَانَ آخِرَ الْأَمْرَيْنِ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَرْكُ الْوُضُوءِ مِمَّا مَسَّتْ النَّارُ",
                "id": "Telah mengabarkan kepada kami [Amr bin Manshur] dia berkata; telah menceritakan kepada kami [Ali bin 'Ayyas] berkata; telah menceritakan kepada kami [Syu'aib] dari [Muhammad bin Munkadir] berkata; \"Saya mendengar [Jabir bin Abdullah] berkata; \"Salah satu dari dua hal yang ditinggalkan oleh Rasulullah shallallahu 'alaihi wasallam adalah tidak berwudlu karena memakan sesuatu yang disentuh oleh (dimasak dengan) api.\""
            },
            {
                "number": 185,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ مَوْلَى بَنِي حَارِثَةَ أَنَّ سُوَيْدَ بْنَ النُّعْمَانِ أَخْبَرَهُأَنَّهُ خَرَجَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ خَيْبَرَ حَتَّى إِذَا كَانُوا بِالصَّهْبَاءِ وَهِيَ مِنْ أَدْنَى خَيْبَرَ صَلَّى الْعَصْرَ ثُمَّ دَعَا بِالْأَزْوَادِ فَلَمْ يُؤْتَ إِلَّا بِالسَّوِيقِ فَأَمَرَ بِهِ فَثُرِّيَ فَأَكَلَ وَأَكَلْنَا ثُمَّ قَامَ إِلَى الْمَغْرِبِ فَتَمَضْمَضَ وَتَمَضْمَضْنَا ثُمَّ صَلَّى وَلَمْ يَتَوَضَّأْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] telah dibacakan kepadanya dan saya mendengarnya lafazh ini darinya, dari [Ibnu Al Qasim] dia berkata; telah menceritakan kepadaku [Malik] dari [Yahya bin Sa'id] dari [Busyair bin Yasar] -budak Bani Haritsah- bahwa [Suwaid bin Nu'man] telah mengabarkan kepadanya, bahwa ia pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam pada tahun perang khaibar ke daerah Shahban' - daerah di Khaibar yang paling rendah - lalu beliau mengerjakan sholat Ashar. Kemudian beliau minta dibawakan perbekalan, maka tidak ada yang bisa dibawa kecuali sawiq. Lalu beliau menyuruh untuk melunakkannya, beliau segera berdiri untuk melaksanakan sholat maghrib, lalu beliau berkumur dan kamipun ikut berkumur, kemudian beliau sholat tanpa berwudlu. "
            },
            {
                "number": 186,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرِبَ لَبَنًا ثُمَّ دَعَا بِمَاءٍ فَتَمَضْمَضَ ثُمَّ قَالَ إِنَّ لَهُ دَسَمًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al -Laits] dari [Uqail] dari [Zuhri] dari [Ubaidillah bin Abdullah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam meminum susu kemudian meminta air untuk berkumur. Lalu beliau bersabda, \"Susu itu mengandung lemak.\" "
            },
            {
                "number": 187,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَغَرِّ وَهوَ ابْنُ الصَّبَّاحِ عَنْ خَلِيفَةَ بْنِ حُصَيْنٍ عَنْ قَيْسِ بْنِ عَاصِمٍأَنَّهُ أَسْلَمَ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَغْتَسِلَ بِمَاءٍ وَسِدْرٍ",
                "id": "Telah mengabarkan kepada kami [Amr bin Ali] telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Al Aghar yaitu Ibnu Shabah] dari [Khalifah bin Hushain] dari [Qais bin 'Ashim] bahwa dia masuk Islam, maka Rasulullah shallallahu 'alaihi wasallam menyuruhnya mandi dengan air dan sidr (Daun Bidara). "
            },
            {
                "number": 188,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُإِنَّ ثُمَامَةَ بْنَ أُثَالٍ الْحَنَفِيَّ انْطَلَقَ إِلَى نَجْلٍ قَرِيبٍ مِنْ الْمَسْجِدِ فَاغْتَسَلَ ثُمَّ دَخَلَ الْمَسْجِدَ فَقَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ يَا مُحَمَّدُ وَاللَّهِ مَا كَانَ عَلَى الْأَرْضِ وَجْهٌ أَبْغَضَ إِلَيَّ مِنْ وَجْهِكَ فَقَدْ أَصْبَحَ وَجْهُكَ أَحَبَّ الْوُجُوهِ كُلِّهَا إِلَيَّ وَإِنَّ خَيْلَكَ أَخَذَتْنِي وَأَنَا أُرِيدُ الْعُمْرَةَ فَمَاذَا تَرَى فَبَشَّرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمَرَهُ أَنْ يَعْتَمِرَ مُخْتَصَرٌ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al-Laits] dari [Sa'id bin Abu Sa'id] bahwa beliau mendengar [Abu Hurairah] berkata; \" Tsumamah bin Utsal Al Hanafi pergi ke tempat air mengalir dekat masjid untuk mandi, kemudian masuk ke dalam masjid dan berkata \" Aku bersaksi bahwa tiada tuhan yang diibadahi selain Allah, tidak ada sekutu baginya dan aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya. Wahai Muhammad! Demi Allah di muka bumi ini, dulu tidak ada wajah yang paling aku benci melainkan wajahmu, dan sekarang wajahmu menjadi wajah yang paling aku cintai. Kudamu akan membawaku dan aku ingin umrah. Bagaimana pendapatmu?\" Rasulullah shallallahu 'alaihi wasallam memberikan kabar gembira kepadanya dan menyuruhnya umrah.\"-Demikian cerita ini secara ringkas- "
            },
            {
                "number": 189,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ مُحَمَّدٍ قَالَ حَدَّثَنِي شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَالَ سَمِعْتُ نَاجِيَةَ بْنَ كَعْبٍ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُأَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أَبَا طَالِبٍ مَاتَ فَقَالَ اذْهَبْ فَوَارِهِ قَالَ إِنَّهُ مَاتَ مُشْرِكًا قَالَ اذْهَبْ فَوَارِهِ فَلَمَّا وَارَيْتُهُ رَجَعْتُ إِلَيْهِ فَقَالَ لِي اغْتَسِلْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dari [Muhammad] dia berkata; telah menceritakan kepadaku [Syu'bah] dari [Abu Ishaq] berkata; saya mendengar [Najiah bin Ka'ab] dari [Ali] Radliyallahu'anhu bahwa dia datang kepada Rasulullah shallallahu 'alaihi wasallam untuk mengabarkan bahwa Abu Thalib meninggal dunia! Beliau bersabda, \" Pergilah ke sana dan kuburlah\" Ali berkata; dia mati dalam keadaan musyrik. Rasul bersabda; \"pergilah ke sana dan kuburlah\" Ali berkata, \"Setelah selesai menguburnya aku pulang, lalu beliau shallallahu 'alaihi wasallam bersabda kepadaku; 'Mandilah. '\""
            },
            {
                "number": 190,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ الْحَسَنَ يُحَدِّثُ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا جَلَسَ بَيْنَ شُعَبِهَا الْأَرْبَعِ ثُمَّ اجْتَهَدَ فَقَدْ وَجَبَ الْغُسْلُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Qatadah] berkata; \"saya mendengar [Hasan] berkata; dari [Abu Rafi'] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \" Apabila telah duduk di antara dua tangan dan dua kaki (bersetubuh), kemudian bersungguh-sungguh, telah wajib mandi baginya.\""
            },
            {
                "number": 191,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ بْنِ إِسْحَقَ الْجَوْزَجَانِيُّ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ قَالَ حَدَّثَنَا أَشْعَثُ بْنُ عَبْدِ الْمَلِكِ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَعَدَ بَيْنَ شُعَبِهَا الْأَرْبَعِ ثُمَّ اجْتَهَدَ فَقَدْ وَجَبَ الْغُسْلُقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا خَطَأٌ وَالصَّوَابُ أَشْعَثُ عَنْ الْحَسَنِ عَنْ أَبِي هُرَيْرَةَ وَقَدْ رَوَى الْحَدِيثَ عَنْ شُعْبَةَ النَّضْرُ بْنُ شُمَيْلٍ وَغَيْرُهُ كَمَا رَوَاهُ خَالِدٌ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Ya'qub bin Ishaq Al Jauzajani] dia berkata; Telah menceritakan kepada kami [Abdullah bin Yusuf] dia berkata; Telah menceritakan kepada kami [Isa bin Yunus] dia berkata; Telah menceritakan kepada kami [Asy'ats bin Abdul Malik] dari [Ibnu Sirin] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \" Apabila telah duduk di antara dua tangan dan dua kaki kemudian bersungguh-sungguh, telah wajib mandi baginya.\" Abu Abdurrahman berkata; Yang ini salah, yang benar adalah, Asy'ats dari Al Hasan dari Abu Hurairah. Telah meriwayatkan hadis ini, An-Nadlr bin Syumail, Khalid, dan yang lainnya dari Syu'bah. "
            },
            {
                "number": 192,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَعَلِيُّ بْنُ حُجْرٍ وَاللَّفْظُ لِقُتَيْبَةَ قَالَ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ عَنْ الرُّكَيْنِ بْنِ الرَّبِيعِ عَنْ حُصَيْنِ بْنِ قَبِيصَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَكُنْتُ رَجُلًا مَذَّاءً فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَأَيْتَ الْمَذْيَ فَاغْسِلْ ذَكَرَكَ وَتَوَضَّأْ وُضُوءَكَ لِلصَّلَاةِ وَإِذَا فَضَخْتَ الْمَاءَ فَاغْتَسِلْ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dan [Ali bin Hujr] lafazh ini dari Qutaibah dia berkata; Telah menceritakan kepada kami [Abidah bin Humaid] dari [Rukain bin Rabi'] dari [Husain bin Qabishah] dari [Ali] Radliyallahu'anhu berkata; \"Aku laki-laki yang sering mengeluarkan madzi. Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \" Apabila kamu melihat madzi, maka cucilah kemaluanmu dan berwudlulah seperti wudlu untuk sholat. Jika kamu mengeluarkan air mani, mandilah.\""
            },
            {
                "number": 193,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ عَنْ زَائِدَةَ ح و أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لَهُ أَنْبَأَنَا أَبُو الْوَلِيدِ حَدَّثَنَا زَائِدَةُ عَنْ الرُّكَيْنِ بْنِ الرَّبِيعِ بْنِ عَمِيلَةَ الْفَزَارِيِّ عَنْ حُصَيْنِ بْنِ قَبِيصَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَكُنْتُ رَجُلًا مَذَّاءً فَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِذَا رَأَيْتَ الْمَذْيَ فَتَوَضَّأْ وَاغْسِلْ ذَكَرَكَ وَإِذَا رَأَيْتَ فَضْخَ الْمَاءِ فَاغْتَسِلْ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Sa'id] dia berkata; Telah memberitakan kepada kami [Abdurrahman] dari [Zaidah], dan Telah mengabarkan kepada kami [Ishaq bin Ibrahim] lafazh ini darinya, Telah mengabarkan kepada kami [Abu Walid] Telah menceritakan kepada kami [Zaidah] dari [Rukain bin Rabi' bin 'Amilah Al Fajariy] dari [Husain bin Qabishah] dari [Ali] Radliyallahu'anhu dia berkata; \"Aku laki-laki yang sering mengeluarkan madzi, maka aku bertanya Rasulullah shallallahu 'alaihi wasallam, lalu beliau bersabda kepadaku: \" Apabila kamu melihat madzi, berwudlulah seperti wudlu untuk sholat, kemudian cuci kemaluanmu. Jika kamu melihat keluarnya air mani, mandilah.\""
            },
            {
                "number": 194,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدَةُ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ أُمَّ سُلَيْمٍ سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمَرْأَةِ تَرَى فِي مَنَامِهَا مَا يَرَى الرَّجُلُ قَالَ إِذَا أَنْزَلَتْ الْمَاءَ فَلْتَغْتَسِلْ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah menceritakan kepada kami ['Abdah] dia berkata; Telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas], bahwa Ummu Sulaim bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang perempuan yang bermimpi seperti mimpinya laki-laki? Maka beliau menjawab, \" Apabila ia mengeluarkan mani. Maka hendaklah mandi.\""
            },
            {
                "number": 195,
                "arab": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ عَنْ مُحَمَّدِ بْنِ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ أَنَّ عَائِشَةَ أَخْبَرَتْهُأَنَّ أُمَّ سُلَيْمٍ كَلَّمَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَائِشَةُ جَالِسَةٌ فَقَالَتْ لَهُ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ لَا يَسْتَحْيِي مِنْ الْحَقِّ أَرَأَيْتَ الْمَرْأَةَ تَرَى فِي النَّوْمِ مَا يَرَى الرَّجُلُ أَفَتَغْتَسِلُ مِنْ ذَلِكَ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَمْ قَالَتْ عَائِشَةُ فَقُلْتُ لَهَا أُفٍّ لَكِ أَوَ تَرَى الْمَرْأَةُ ذَلِكَ فَالْتَفَتَ إِلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ تَرِبَتْ يَمِينُكِ فَمِنْ أَيْنَ يَكُونُ الشَّبَهُ",
                "id": "Telah mengabarkan kepada kami [Katsir bin 'Ubaid] dari [Muhammad bin Harb] dari [Az-Zubaidi] dari [Az-Zuhri] dari [Urwah] bahwa [Aisyah] mengabarkan kepadanya, sesungguhnya Ummu Sulaim berbincang-bincang dengan Rasulullah shallallahu 'alaihi wasallam dan aku sedang duduk, kemudian Ummu Sulaim berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, Allah tidak malu sedikitpun dari kebenaran, jadi apa pendapat engkau bila ada perempuan yang bermimpi seperti mimpinya laki-laki? Apakah dia harus mandi?\" Rasulullah shallallahu 'alaihi wasallam menjawab, \" Ya.\" Aisyah berkata; \"Aku bertanya kepada Ummu Sulaim. 'Ah, apakah perempuan juga bermimpi demikian! ' Lalu Rasulullah shallallahu 'alaihi wasallam menengok kepadaku dan berkata, \"Ah, kamu ini bagaimana, lalu dari manakah anak bisa mirip orang tuanya itu?\""
            },
            {
                "number": 196,
                "arab": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ قَالَ حَدَّثَنَا يَحْيَى عَنْ هِشَامٍ قَالَ أَخْبَرَنِي أَبِي عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَأَنَّ امْرَأَةً قَالَتْ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ لَا يَسْتَحْيِي مِنْ الْحَقِّ هَلْ عَلَى الْمَرْأَةِ غُسْلٌ إِذَا هِيَ احْتَلَمَتْ قَالَ نَعَمْ إِذَا رَأَتْ الْمَاءَ فَضَحِكَتْ أُمُّ سَلَمَةَ فَقَالَتْ أَتَحْتَلِمُ الْمَرْأَةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَفِيمَ يُشْبِهُهَا الْوَلَدُ",
                "id": "Telah mengabarkan kepada kami [Syu'aib bin Yusuf] dia berkata; Telah menceritakan kepada kami [Yahya] dari [Hisyam] dia berkata; Telah mengabarkan kepadaku [Bapakku] dari [Zainab bin Salamah] dari [Ummu Salamah] bahwa seorang perempuan berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, Allah tidak Malu sedikitpun dari kebenaran, apakah seorang perempuan wajib mandi apabila ia bermimpi?\" Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \" Ya, jika dia melihat mani. Maka Ummu Salamah tertawa dan bertanya; Apakah wanita bermimpi basah juga? Beliau shallallahu 'alaihi wasallam menjawab: \"Kalau tidak, lalu dari mana anak itu dapat menyerupainya (mirip dengannya)?\""
            },
            {
                "number": 197,
                "arab": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ شُعْبَةَ قَالَ سَمِعْتُ عَطَاءً الْخُرَاسَانِيَّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ خَوْلَةَ بِنْتِ حَكِيمٍ قَالَتْسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمَرْأَةِ تَحْتَلِمُ فِي مَنَامِهَا فَقَالَ إِذَا رَأَتْ الْمَاءَ فَلْتَغْتَسِلْ",
                "id": "Telah mengabarkan kepada kami [Yusuf bin Sa'id] dia berkata; Telah menceritakan kepada kami [Hajaj] dari [Syu'bah] dia berkata; Saya mendengar [Atha' Al Khurasani] dari [Sa'id bin Musayyab] dari [Khaulah bin Hakim] dia berkata; \"Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang perempuan yang bermimpi? Lalu beliau bersabda: \" Apabila ia melihat air (Mani), maka hendaklah ia mandi'.\""
            },
            {
                "number": 198,
                "arab": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ عَنْ سُفْيَانَ عَنْ عَمْرٍو عَنْ عَبْدِ الرَّحْمَنِ بْنِ السَّائِبِ عَنْ عَبْدِ الرَّحْمَنِ ابْنِ سُعَادٍ عَنْ أَبِي أَيُّوبَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمَاءُ مِنْ الْمَاءِ",
                "id": "Telah mengabarkan kepada kami [Abdul Jabar bin Al 'Alla] dari [Sufyan] dari [Amr] dari [Abdurrahman bin As-Saib] dari [Abdurrahman bin Su'ad] dari [Abu Ayyub] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \" Air (Mandi Junub) itu adalah karena (keluarnya Mani) \""
            },
            {
                "number": 199,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدَةُ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَاءُ الرَّجُلِ غَلِيظٌ أَبْيَضُ وَمَاءُ الْمَرْأَةِ رَقِيقٌ أَصْفَرُ فَأَيُّهُمَا سَبَقَ كَانَ الشَّبَهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah memberitakan kepada kami [Abdah] dia berkata; Telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Mani laki-laki itu kental dan berwarna putih, sedangkan mani perempuan itu encer dan berwarna kuning. Maka diantara keduanya yang lebih kuat itulah yang mirip atau menyerupai (dengan anaknya).\""
            },
            {
                "number": 200,
                "arab": "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ قَالَ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَبْدِ اللَّهِ الْعَدَوِيُّ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنِي هِشَامُ بْنُ عُرْوَةَ عَنْ عُرْوَةَ عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ مِنْ بَنِي أَسَدِ قُرَيْشٍأَنَّهَا أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ أَنَّهَا تُسْتَحَاضُ فَزَعَمَتْ أَنَّهُ قَالَ لَهَا إِنَّمَا ذَلِكَ عِرْقٌ فَإِذَا أَقْبَلَتْ الْحَيْضَةُ فَدَعِي الصَّلَاةَ وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ الدَّمَ ثُمَّ صَلَّى",
                "id": "Telah mengabarkan kepada kami ['Imran bin Yazid] dia berkata; telah menceritakan kepada kami [Ismail bin Abdullah Al 'Adawi] berkata; telah menceritakan kepada kami [Al Auza'i] berkata; telah menceritakan kepada kami [Yahya bin Sa'id] berkata; telah menceritakan kepadaku [Hisyam bin Urwah] dari [Urwah] dari [Fatimah binti Qais] -dari Bani Asad Qiraisy- bahwa dia pernah datang kepada Rasulullah shallallahu 'alaihi wasallam dan mengatakan bahwa dirinya sedang istihadhah (mengeluarkan darah penyakit). Ia menyangka bahwa Rasulullah shallallahu 'alaihi wasallam telah bersabda kepadanya: \" Itu darah penyakit. Apabila datang haid maka tinggalkan sholat, dan apabila telah selesai maka mandilah dan kerjakanlah sholat.\""
            },
            {
                "number": 201,
                "arab": "أَخْبَرَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ حَدَّثَنَا سَهْلُ بْنُ هَاشِمٍ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَقْبَلَتْ الْحَيْضَةُ فَاتْرُكِي الصَّلَاةَ وَإِذَا أَدْبَرَتْ فَاغْتَسِلِي",
                "id": "Telah mengabarkan kepada kami [Hisyam bin 'Ammar] dia berkata; Telah menceritakan kepada kami [Sahal bin Hasyim] berkata; Telah menceritakan kepada kami [Al Auza'i] dari [Zuhri] dari ['Urwah] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \" Apabila datang haid maka tinggalkanlah sholat, dan apabila telah berhenti maka mandilah.\""
            },
            {
                "number": 202,
                "arab": "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ قَالَ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنَا الزُّهْرِيُّ عَنْ عُرْوَةَ وَعَمْرَةَ عَنْ عَائِشَةَ قَالَتْاسْتُحِيضَتْ أُمُّ حَبِيبَةَ بِنْتُ جَحْشٍ سَبْعَ سِنِينَ فَاشْتَكَتْ ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ هَذِهِ لَيْسَتْ بِالْحَيْضَةِ وَلَكِنْ هَذَا عِرْقٌ فَاغْتَسِلِي ثُمَّ صَلِّي",
                "id": "Telah mengabarkan kepada kami ['Imran bin Yazid] dia berkata; Telah menceritakan kepada kami [Ismail bin Abdullah] berkata; Telah menceritakan kepada kami [Al Auza'i] berkata; Telah menceritakan kepada kami [Az-Zuhri] dari ['Urwah] dan ['Amrah] dari [Aisyah] dia berkata; \"Ummu Habibah binti Jahsyi mengalami istihadhah selama tujuh tahun maka ia mengadu kepada Rasulullah shallallahu 'alaihi wasallam tentang hal tersebut. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \" Ini bukan haid, tetapi darah penyakit. Maka mandilah kemudian sholatlah.\""
            },
            {
                "number": 203,
                "arab": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ قَالَ أَخْبَرَنِي النُّعْمَانُ وَالْأَوْزَاعِيُّ وَأَبُو مُعَيْدٍ وَهُوَ حَفْصُ بْنُ غَيْلَانَ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ وَعَمْرَةُ بْنْتُ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ قَالَتْاسْتُحِيضَتْ أُمُّ حَبِيبَةَ بِنْتُ جَحْشٍ امْرَأَةُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَهِيَ أُخْتُ زَيْنَبَ بِنْتِ جَحْشٍ فَاسْتَفْتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ هَذِهِ لَيْسَتْ بِالْحَيْضَةِ وَلَكِنْ هَذَا عِرْقٌ فَإِذَا أَدْبَرَتْ الْحَيْضَةُ فَاغْتَسِلِي وَصَلِّي وَإِذَا أَقْبَلَتْ فَاتْرُكِي لَهَا الصَّلَاةَ قَالَتْ عَائِشَةُ فَكَانَتْ تَغْتَسِلُ لِكُلِّ صَلَاةٍ وَتُصَلِّي وَكَانَتْ تَغْتَسِلُ أَحْيَانًا فِي مِرْكَنٍ فِي حُجْرَةِ أُخْتِهَا زَيْنَبَ وَهِيَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَنَّ حُمْرَةَ الدَّمِ لَتَعْلُو الْمَاءَ وَتَخْرُجُ فَتُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا يَمْنَعُهَا ذَلِكَ مِنْ الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Ar Rabi' bin Sulaiman bin Daud] dia berkata; Telah menceritakan kepada kami [Abdullah bin Yusuf] berkata; Telah menceritakan kepada kami [Al Haitsam bin Humaid] telah mengabarkan kepadaku [An-Nu'man] dan [Al Auzai] dan [Abu Mu'aid yaitu Hafs bin Ghailan] dari [Az-Zuhri] berkata; Telah mengabarkan kepadaku ['Urwan bin Zubair] dan [Amrah binti Abdurrahman] dari [Aisyah] dia berkata: \" Ummu Habibah binti Jahsy -istri Abdurrahman bin Auf, saudari Zainab binti Jahsy- mengalami istihadah, maka ia meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam tentang hal tersebut. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya, \" Ini bukan haid, tetapi darah penyakit. Apabila selesai haid maka mandi dan kerjakanlah sholat, dan jika datang haid maka tinggalkanlah sholat.\" Aisyah berkata, Dia (Ummu Habibah) selalu mandi untuk setiap sholat, lalu dia sholat. Kadang dia mandi di tempat mencuci pakaian di dalam kamar saudaranya (Zainab), dan dia tinggal bersama Rasulullah shallallahu 'alaihi wasallam, hingga merahnya darah mengalahkan air. Dia keluar untuk sholat bersama Rasulullah shallallahu 'alaihi wasallam, dan beliau shallallahu 'alaihi wasallam tidak mencegahnya untuk melaksanakan sholat karena hal itu.\""
            },
            {
                "number": 204,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ وَعَمْرَةَ عَنْ عَائِشَةَأَنَّ أُمَّ حَبِيبَةَ خَتَنَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَحْتَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ اسْتُحِيضَتْ سَبْعَ سِنِينَ اسْتَفْتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ هَذِهِ لَيْسَتْ بِالْحَيْضَةِ وَلَكِنْ هَذَا عِرْقٌ فَاغْتَسِلِي وَصَلِّي",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; Telah menceritakan kepada kami [Ibnu Wahab] dari [Amr bin Al Harits] dari [Ibnu Syihab] dari ['Urwah] dan [Amrah] dari [Aisyah] bahwa Ummu Habibah -saudari istri Rasulullah shallallahu 'alaihi wasallam dari istri Abdurrahman bin Auf- mengalami istihadhah selama tujuh tahun, maka dia meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau bersabda kepadanya: \" Ini bukan darah haid, tetapi darah penyakit. Maka mandi dan sholatlah.\""
            },
            {
                "number": 205,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْاسْتَفْتَتْ أُمُّ حَبِيبَةَ بِنْتُ جَحْشٍ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أُسْتَحَاضُ فَقَالَ إِنَّمَا ذَلِكَ عِرْقٌ فَاغْتَسِلِي وَصَلِّي فَكَانَتْ تَغْتَسِلُ لِكُلِّ صَلَاةٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; Telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Urwah] dari [Aisyah] dia berkata; \"Ummu Habibah binti Jahsy meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam, \"Wahai Rasulullah shallallahu 'alaihi wasallam! Aku mengalami istihadhah?\" Beliau bersabda: \" Itu darah penyakit, maka mandi dan sholatlah\" Lalu Ummu Habibah selalu mandi jika akan sholat. "
            },
            {
                "number": 206,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ أُمَّ حَبِيبَةَ سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الدَّمِ قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا رَأَيْتُ مِرْكَنَهَا مَلْآنَ دَمًا فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْكُثِي قَدْرَ مَا كَانَتْ تَحْبِسُكِ حَيْضَتُكِ ثُمَّ اغْتَسِلِيأَخْبَرَنَا قُتَيْبَةُ مَرَّةً أُخْرَى وَلَمْ يَذْكُرْ جَعْفَرًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; Telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari [Ja'far bin Rabi'ah] dari ['Irak bin Malik] dari ['Urwah] dari [Aisyah] bahwa Ummu Habibah bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang darah? Aisyah Radliyallahu'anha berkata; \"Aku melihat tempatnya mencuci pakaian penuh dengan darah. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \" Tetapkanlah sesuai masa\/waktu haid yang biasa kamu alami kemudian mandilah.\" Dan telah mengabarkan kepada kami lagi Qutaibah tanpa menyebutkan Ja'far. "
            },
            {
                "number": 207,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ أُمِّ سَلَمَةَتَعْنِي أَنَّ امْرَأَةً كَانَتْ تُهَرَاقُ الدَّمَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَفْتَتْ لَهَا أُمُّ سَلَمَةَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِتَنْظُرْ عَدَدَ اللَّيَالِي وَالْأَيَّامِ الَّتِي كَانَتْ تَحِيضُ مِنْ الشَّهْرِ قَبْلَ أَنْ يُصِيبَهَا الَّذِي أَصَابَهَا فَلْتَتْرُكْ الصَّلَاةَ قَدْرَ ذَلِكَ مِنْ الشَّهْرِ فَإِذَا خَلَّفَتْ ذَلِكَ فَلْتَغْتَسِلْ ثُمَّ لِتَسْتَثْفِرْ ثُمَّ لِتُصَلِّي",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Nafi'] dari [Sulaiman bin Yasar] dari [Ummu Salamah] -ia bermaksud- ada seseorang perempuan yang mengalami pendarahan pada zaman Rasulullah shallallahu 'alaihi wasallam, lalu dia (Ummu Salamah) memintakan fatwa kepada Rasulullah shallallahu 'alaihi wasallam? Beliau bersabda, \" Hendaklah kamu menghitung malam dan hari (jadwal) yang biasa kamu haid setiap bulannya. Selama kamu masih berada di hari kebiasaan kamu haid pada setiap bulannya maka tinggalkanlah seukuran malam\/hari tersebut dalam setiap bulannya. Bila hal itu selesai maka mandilah, kemudian letakkan kain pada tempat haid, dan kerjakan sholat.\" "
            },
            {
                "number": 208,
                "arab": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا إِسْحَقُ بْنُ بَكْرٍ قَالَ حَدَّثَنِي أَبِي عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَأَنَّ أُمَّ حَبِيبَةَ بِنْتَ جَحْشٍ الَّتِي كَانَتْ تَحْتَ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَأَنَّهَا اسْتُحِيضَتْ لَا تَطْهُرْ فَذُكِرَ شَأْنُهَا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّهَا لَيْسَتْ بِالْحَيْضَةِ وَلَكِنَّهَا رَكْضَةٌ مِنْ الرَّحِمِ فَلْتَنْظُرْ قَدْرَ قَرْئِهَا الَّتِي كَانَتْ تَحِيضُ لَهَا فَلْتَتْرُكْ الصَّلَاةَ ثُمَّ تَنْظُرْ مَا بَعْدَ ذَلِكَ فَلْتَغْتَسِلْ عِنْدَ كُلِّ صَلَاةٍ",
                "id": "Telah mengabarkan kepada kami [Ar Rabi' bin Sulaiman bin Daud bin Ibrahim] dia berkata; Telah menceritakan kepada kami [Ishaq bin Bakr] berkata; Telah menceritakan kepadaku [Ayahku] dari [Yazid bin Abdullah] dari [Abu Bakar bin Muhammad] dari [Amrah] dari [Aisyah] bahwa Ummu Habibah binti Jahsy -istri Abdurrahman bin Auf- mengalami istihadhah dan tidak suci, maka dia mengadukan keadaannya kepada Rasulullah shallallahu 'alaihi wasallam. Beliau shallallahu 'alaihi wasallam lalu bersabda kepadanya, \" Ini bukan haid, tetapi hentakan dari rahim. Jadi mandilah dan kerjakanlah sholat. Lalu lihat kebiasaan masa haid, kemudian tinggalkan sholat, dan lihat apa yang terjadi setelah itu. Kemudian mandilah pada setiap akan mengerjakan sholat.\" "
            },
            {
                "number": 209,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عَمْرَةَ عَنْ عَائِشَةَأَنَّ أُمَّ حَبِيبَةَ بِنْتَ جَحْشٍ كَانَتْ تُسْتَحَاضُ سَبْعَ سِنِينَ فَسَأَلَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَيْسَتْ بِالْحَيْضَةِ إِنَّمَا هُوَ عِرْقٌ فَأَمَرَهَا أَنْ تَتْرُكَ الصَّلَاةَ قَدْرَ أَقْرَائِهَا وَحَيْضَتِهَا وَتَغْتَسِلَ وَتُصَلِّيَ فَكَانَتْ تَغْتَسِلُ عِنْدَ كُلِّ صَلَاةٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; Telah menceritakan kepada kami [Sufyan] dari [Az-Zuhri] dari ['Amrah] dari [Aisyah] bahwa Ummu Habibah binti Jahsy mengalami istihadhah (mengeluarkan darah penyakit) selama tujuh tahun, maka ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang hal tersebut. Beliau lalu berkata, \" Itu bukan haid, tetapi darah penyakit.\" Lalu beliau memerintahkannya untuk meninggalkan sholat menurut waktu kebiasaan haidnya, lalu mandi serta tetap sholat, dan harus mandi pada setiap sholat.\" "
            },
            {
                "number": 210,
                "arab": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ عَنْ الْمُنْذِرِ بْنِ الْمُغِيرَةِ عَنْ عُرْوَةَأَنَّ فَاطِمَةَ بِنْتَ أَبِي حُبَيْشٍ حَدَّثَتْ أَنَّهَا أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَكَتْ إِلَيْهِ الدَّمَ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا ذَلِكَ عِرْقٌ فَانْظُرِي إِذَا أَتَاكِ قُرْؤُكِ فَلَا تُصَلِّ فَإِذَا مَرَّ قُرْؤُكِ فَتَطَهَّرِي ثُمَّ صَلِّي مَا بَيْنَ الْقُرْءِ إِلَى الْقُرْءِ هَذَا الدَّلِيلُ عَلَى أَنَّ الْأَقْرَاءَ حَيْضٌقَالَ أَبُو عَبْد الرَّحْمَنِ وَقَدْ رَوَى هَذَا الْحَدِيثَ هِشَامُ بْنُ عُرْوَةَ عَنْ عُرْوَةَ وَلَمْ يَذْكُرْ فِيهِ مَا ذَكَرَ الْمُنْذِرُ",
                "id": "Telah mengabarkan kepada kami [Isa bin Hammad] dia berkata; Telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari [Bukair bin Abdullah] dari [Al Mundziri bin Al Mughirah] dari ['Urwah] bahwa [Fatimah binti Hubaisy] menceritakan dirinya pernah datang kepada Rasulullah shallallahu 'alaihi wasallam untuk mengadukan pendarahannya. Rasulullah shallallahu 'alaihi wasallam lalu bersabda kepadanya: \" Itu darah penyakit. Perhatikan waktu kebiasaan haidmu, jika datang maka jangan sholat dan jika Telah berlalu maka bersuci dan sholatlah antara waktu haid yang satu ke waktu haid yang lain.\" Ini adalah dalil bahwa Haidh itu memiliki waktu-waktu tertentu. Abu Abdurrahman berkata; dan telah meriwayatkan pula terhadap hadits ini Hisyam bin 'Urwah dari 'Urwah tetapi dia tidak menyebutkan sebagaimana yang telah disebutkan oleh Al Mundzir. "
            },
            {
                "number": 211,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَخْبَرَنَا عَبْدَةُ وَوَكِيعٌ وَأَبُو مُعَاوِيَةَ قَالُوا حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْجَاءَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنِّي امْرَأَةٌ أُسْتَحَاضُ فَلَا أَطْهُرُ أَفَأَدَعُ الصَّلَاةَ قَالَ لَا إِنَّمَا ذَلِكَ عِرْقٌ وَلَيْسَ بِالْحَيْضَةِ فَإِذَا أَقْبَلَتْ الْحَيْضَةُ فَدَعِي الصَّلَاةَ وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ الدَّمَ وَصَلِّي",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah mengabarkan kepada kami [Abdah], [Waki'] dan [Abu Mu'awiyah] mereka berkata; telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] dia berkata: \"Fatimah binti Abu Hubaisy datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Aku perempuan yang sedang mengalami istihadhah, dan aku tidak bersuci. Apakah aku harus meninggalkan sholat?\" Beliau bersabda, \" Tidak, itu darah penyakit, bukan haid. Bila datang haid, tinggalkanlah sholat, dan jika sudah selesai haid maka cucilah darah itu darimu dan sholatlah.\" "
            },
            {
                "number": 212,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ شُعْبَةُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ امْرَأَةً مُسْتَحَاضَةً عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِيلَ لَهَا أَنَّهُ عِرْقٌ عَانِدٌ فَأُمِرَتْ أَنْ تُؤَخِّرَ الظُّهْرَ وَتُعَجِّلَ الْعَصْرَ وَتَغْتَسِلَ لَهُمَا غُسْلًا وَاحِدًا وَتُؤَخِّرَ الْمَغْرِبَ وَتُعَجِّلَ الْعِشَاءَ وَتَغْتَسِلَ لَهُمَا غُسْلًا وَاحِدًا وَتَغْتَسِلَ لِصَلَاةِ الصُّبْحِ غُسْلًا وَاحِدًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basyar] dia berkata; Telah menceritakan kepada kami [Muhammad], [Syu'bah] berkata; dari [Abdurrahman bin Qasim] dari [Ayahnya] dari [Aisyah] Radliyallahu'anha, bahwa ada seorang perempuan yang sedang istihadhah pada zaman Rasulullah shallallahu 'alaihi wasallam, maka dikatakan kepadanya bahwa itu adalah darah penyakit yang tidak wajar. Ia lalu diperintahkan mengakhirkan sholat zhuhur dan memajukan sholat Ashar, serta mandi satu kali untuk dua sholat tersebut. Juga mengakhirkan sholat Maghrib dan memajukan sholat Isya' serta mandi satu kali untuk dua sholat, kemudian mandi satu kali untuk sholat Subuh.\""
            },
            {
                "number": 213,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِفِي حَدِيثِ أَسْمَاءَ بِنْتِ عُمَيْسٍ حِينَ نُفِسَتْ بِذِي الْحُلَيْفَةِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي بَكْرٍ مُرْهَا أَنْ تَغْتَسِلَ وَتُهِلَّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Qudamah] dia berkata; Telah menceritakan kepada kami [Jarir] dari [Yahya bin Sa'id] dari [Ja'far bin Muhammad] dari [Ayahnya] dari [Jabir bin Abdullah] didalam haditsnya. Asma' binti Umais ketika ia sedang nifas di Dzul Hulaifah, Rasulullah shallallahu 'alaihi wasallam berkata kepada Abu Bakar: \" Suruh ia mandi lalu berihram (dan mengucap talbiyah).\" "
            },
            {
                "number": 214,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ مُحَمَّدٍ وَهُوَ ابْنُ عَمْرِو بْنِ عَلْقَمَةَ بْنِ وَقَّاصٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ فَاطِمَةَ بِنْتِ أَبِي حُبَيْشٍأَنَّهَا كَانَتْ تُسْتَحَاضُ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ دَمُ الْحَيْضِ فَإِنَّهُ دَمٌ أَسْوَدُ يُعْرَفُ فَأَمْسِكِي عَنْ الصَّلَاةِ فَإِذَا كَانَ الْآخَرُ فَتَوَضَّئِي فَإِنَّمَا هُوَ عِرْقٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Muhammad yaitu Ibnu Amr bin 'Alqamah bin Waqqash] dari [Ibnu Syihab] dari [Urwan bin Zubair] dari [Fatimah binti Abu Hubaisy] bahwa dia mengalami istihadhah, maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \" Apabila darah itu adalah darah haid, maka darahnya berwarna hitam yang sudah dikenal, maka tinggalkanlah sholat. Jika bukan demikian maka berwudlulah, karena itu hanya darah penyakit.\""
            },
            {
                "number": 215,
                "arab": "قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ هَذَا مِنْ كِتَابِهِ أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ مِنْ حِفْظِهِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ فَاطِمَةَ بِنْتَ أَبِي حُبَيْشٍ كَانَتْ تُسْتَحَاضُ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ دَمَ الْحَيْضِ دَمٌ أَسْوَدُ يُعْرَفُ فَإِذَا كَانَ ذَلِكَ فَأَمْسِكِي عَنْ الصَّلَاةِ وَإِذَا كَانَ الْآخَرُ فَتَوَضَّئِي وَصَلِّيقَالَ أَبُو عَبْد الرَّحْمَنِ قَدْ رَوَى هَذَا الْحَدِيثَ غَيْرُ وَاحِدٍ لَمْ يَذْكُرْ أَحَدٌ مِنْهُمْ مَا ذَكَرَهُ ابْنُ أَبِي عَدِيٍّ وَاللَّهُ تَعَالَى أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] Telah menceritakan kepada kami [Ibnu Abu 'Adi] -ini dari bukunya- Telah mengabarkan kepada kami Muhammad bin Al Mutsanna Telah menceritakan kepada kami Ibnu Abu 'Adi -dari Hafalannya- dia berkata; Telah menceritakan kepada kami [Muhammad bin Amr] dari [Ibnu Syihab] dari ['Urwah] dari [Aisyah] bahwa Fatimah binti Hubaisy mengalami istihadhah, sehingga Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya, \" Bila darah itu adalah darah haid, darahnya hitam dan sudah dikenal, maka tinggalkanlah sholat. Jika selain itu, berwudlulah dan kerjakanlah sholat.\" Abu Abdurrahman berkata; \"Telah banyak yang meriwayatkan hadits ini, dan mereka tidak menyebutkan sebagaimana yang telah disebutkan oleh Ibnu Abu 'Adi, Wallahu Ta'ala A'lam. "
            },
            {
                "number": 216,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ قَالَ حَدَّثَنَا حَمَّادٌ وَهُوَ ابْنُ زَيْدٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْاسْتُحِيضَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ فَسَأَلَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أُسْتَحَاضُ فَلَا أَطْهُرُ أَفَأَدَعُ الصَّلَاةَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا ذَلِكَ عِرْقٌ وَلَيْسَتْ بِالْحَيْضَةِ فَإِذَا أَقْبَلَتْ الْحَيْضَةُ فَدَعِي الصَّلَاةَ وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ أَثَرَ الدَّمِ وَتَوَضَّئِي فَإِنَّمَا ذَلِكَ عِرْقٌ وَلَيْسَتْ بِالْحَيْضَةِ قِيلَ لَهُ فَالْغُسْلُ قَالَ ذَلِكَ لَا يَشُكُّ فِيهِ أَحَدٌقَالَ أَبُو عَبْد الرَّحْمَنِ لَا أَعْلَمُ أَحَدًا ذَكَرَ فِي هَذَا الْحَدِيثِ وَتَوَضَّئِي غَيْرَ حَمَّادِ بْنِ زَيْدٍ وَقَدْ رَوَى غَيْرُ وَاحِدٍ عَنْ هِشَامٍ وَلَمْ يَذْكُرْ فِيهِ وَتَوَضَّئِي",
                "id": "Telah mengabarkan kepada kami [Yahya bin Habib bin 'Araby] dia berkata; telah menceritakan kepada kami [Hammad Yaitu Ibnu Zaid] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] Radliyallhu'anha bahwa Fatimah binti Hubaisy mengalami istihadhah, maka ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam, \" Wahai Rasulullah shallallahu 'alaihi wasallam! Aku sedang istihadhah, maka aku tidak bersuci. Apakah aku harus meninggalkan sholat?\" Rasulullah shallallahu 'alaihi wasallam berkata, \" Itu darah penyakit, bukan haid. Bila sedang haid maka tinggalkanlah sholat, dan jika sudah selesai dari haid maka cucilah bekas darah darimu dan berwudlulah, karena itu hanya darah penyakit, bukan haid.\" Beliau ditanya, \"Bagaimana dengan mandi?, maka beliau menjawab, \"Tidak seorangpun meragukan hal itu.\" Abu Abdurrahman berkata; \"saya tidak mengetahui seorangpun yang menyebutkan dalam hadits ini lafadz 'wa tawadha'i' (dan berwudlulah) selain Hammad bin Yazid, padahal telah banyak yang meriwayatkan hadits ini dari Hisyam, tapi mereka tidak menyebutkan di dalamnya lafadz 'Wa tawadha'i'. "
            },
            {
                "number": 217,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَتْ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ يَا رَسُولَ اللَّهِ لَا أَطْهُرُ أَفَأَدَعُ الصَّلَاةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا ذَلِكَ عِرْقٌ وَلَيْسَتْ بِالْحَيْضَةِ فَإِذَا أَقْبَلَتْ الْحَيْضَةُ فَدَعِي الصَّلَاةَ فَإِذَا ذَهَبَ قَدْرُهَا فَاغْسِلِي عَنْكِ الدَّمَ وَصَلِّي",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Hisyam bin 'Urwah] dari [Ayahnya], dari [Aisyah Radliyallahu'nha] dia berkata; \"Fatimah binti Abu Hubaisy berkata, 'Wahai Rasulullah shallallahu 'alaihi wasallam, aku tidak suci. Apakah aku harus meninggalkan sholat?\" Beliau shallallahu 'alaihi wasallam menjawab, \" Itu hanya darah penyakit, bukan darah haid. Bila datang waktu haid maka tinggalkanlah sholat, dan jika telah selesai waktu kebiasaan haid, maka cucilah (bersihkanlah) tempat darah itu dan sholatlah.\" "
            },
            {
                "number": 218,
                "arab": "أَخْبَرَنَا أَبُو الْأَشْعَثِ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ سَمِعْتُ هِشَامَ بْنَ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ بِنْتَ أَبِي حُبَيْشٍ قَالَتْ يَا رَسُولَ اللَّهِ إِنِّي لَا أَطْهُرُ أَفَأَتْرُكُ الصَّلَاةَ قَالَ لَا إِنَّمَا هُوَ عِرْقٌ قَالَ خَالِدٌ فِيمَا قَرَأْتُ عَلَيْهِ وَلَيْسَتْ بِالْحَيْضَةِ فَإِذَا أَقْبَلَتْ الْحَيْضَةُ فَدَعِي الصَّلَاةَ وَإِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ الدَّمَ وَصَلِّي",
                "id": "Telah mengabarkan kepada kami [Abu Al Asy'ats] dia berkata; telah menceritakan kepada kami [Khalid bin Al Harits] berkata; \"Saya mendengar dari [Hisyam bin 'Urwah] dari [Ayahnya], dari [Aisyah] Radliyallahu'anha bahwa Fatimah binti Abu Hubaisy berkata: \"Wahai Rasulullah shallallahu 'alaihi wasallam, aku tidak suci, jadi apakah aku harus meninggalkan sholat?\" Beliau shallallahu 'alaihi wasallam menjawab, \" Tidak, itu hanya darah penyakit, -Khalid berkomentar setelah ku ungkapkan kepadanya perihal `arq, \"`arq bukan darah haid. Jadi bila datang waktu haid maka tinggalkanlah sholat dan jika telah selesai waktu kebiasaan haid maka cucilah (tempat) keluarnya darah itu dan sholatlah.\" "
            },
            {
                "number": 219,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ بُكَيْرٍ أَنَّ أَبَا السَّائِبِ أَخْبَرَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَغْتَسِلْ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ وَهُوَ جُنُبٌ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Daud] dan [Harits bin Miskin] telah dibacakan kepadanya dan saya mendengar lafazhnya dari dia, dari [Ibnu Wahab] dari [Amr bin Al Harits] dari [Bukair] berkata; [Abu Saib] telah mengabarkan kepadanya bahwasannya dia telah mendengar [Abu Hurairah] berkata; telah bersabda Rasulullah shallallahu 'alaihi wasallam \"Janganlah salah seorang dari kalian mandi junub dalam air yang tergenang.\" "
            },
            {
                "number": 220,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ الْمُقْرِي عَنْ سُفْيَانَ عَنْ أَبِي الزِّنَادِ عَنْ مُوسَى بْنِ أَبِي عُثْمَانَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبُولَنَّ أَحَدُكُمْ فِي الْمَاءِ الرَّاكِدِ ثُمَّ يَغْتَسِلُ مِنْهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Yazid Al Muqri] dari [Sufyan] dari [Abu Zinad] dari [Musa bin Abu Utsman] dari [Ayahnya] dari [Abu Hurairah] dia berkata; bahwa Rasulullah shallallahu 'alaihi wasallam bersabda, \" Janganlah salah seorang dari kalian buang air kecil dalam air yang diam (tergenang), kemudian mandi di situ.\" "
            },
            {
                "number": 221,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ هِشَامٍ قَالَ حَدَّثَنَا مَخْلَدٌ عَنْ سُفْيَانَ عَنْ أَبِي الْعَلَاءِ عَنْ عُبَادَةَ بْنِ نُسَيٍّ عَنْ غُضَيْفِ بْنِ الْحَارِثِأَنَّهُ سَأَلَ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَيُّ اللَّيْلِ كَانَ يَغْتَسِلُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ رُبَّمَا اغْتَسَلَ أَوَّلَ اللَّيْلِ وَرُبَّمَا اغْتَسَلَ آخِرَهُ قُلْتُ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ فِي الْأَمْرِ سَعَةً",
                "id": "Telah mengabarkan kepada kami [Amr bin Hisyam] dia berkata; telah menceritakan kepada kami [Makhlad] dari [Sufyan] dari [Abu Al 'Allaa'i] dari ['Ubaidah bin Nusay] dari [Ghudhaif bin Al Harits] bahwa dia pernah bertanya kepada Aisyah Radliyallhu'anha, \"Kapan Rasulullah shallallahu 'alaihi wasallam mandi di malam hari?\" [Aisyah] menjawab, \" Beliau kadang mandi pada permulaan malam, namun kadang pula pada akhir malam.\" Aku berkata, \"Segala puji bagi Allah yang telah menjadikan kelonggaran dalam masalah ini.\""
            },
            {
                "number": 222,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ بُرْدٍ عَنْ عُبَادَةَ بْنِ نُسَيٍّ عَنْ غُضَيْفِ بْنِ الْحَارِثِ قَالَدَخَلْتُ عَلَى عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا فَسَأَلْتُهَا قُلْتُ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلُ مِنْ أَوَّلِ اللَّيْلِ أَوْ مِنْ آخِرِهِ قَالَتْ كُلَّ ذَلِكَ رُبَّمَا اغْتَسَلَ مِنْ أَوَّلِهِ وَرُبَّمَا اغْتَسَلَ مِنْ آخِرِهِ قُلْتُ الْحَمْدُ لِلَّهِ الَّذِي جَعَلَ فِي الْأَمْرِ سَعَةً",
                "id": "Telah mengabarkan kepada kami [Yahya bin Habib bin 'Araby] dia berkata; telah menceritakan kepada kami [Hammad] dari [Burd] dari ['Ubadah bin Nusay] dari [Ghudaif bin Al Harits] dia berkata: \"Aku masuk menemui Aisyah Radliyallahu'anha, lalu aku bertanya kepadanya, 'Rasulullah shallallahu 'alaihi wasallam mandi pada permulaan malam atau pada akhir malam? ' [Aisyah] menjawab, 'Pada setiap waktu itu. Kadang ia mandi pada permulaan malam dan kadang pada akhir malam.\" Aku berkata, 'Segala puji bagi Allah yang telah menjadikan kelonggaran dalam masalah ini.\""
            },
            {
                "number": 223,
                "arab": "أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنِي يَحْيَى بْنُ الْوَلِيدِ قَالَ حَدَّثَنِي مُحِلُّ بْنُ خَلِيفَةَ قَالَ حَدَّثَنِي أَبُو السَّمْحِ قَالَكُنْتُ أَخْدُمُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ إِذَا أَرَادَ أَنْ يَغْتَسِلَ قَالَ وَلِّنِي قَفَاكَ فَأُوَلِّيهِ قَفَايَ فَأَسْتُرُهُ بِهِ",
                "id": "Telah mengabarkan kepada kami [Mujahid bin Musa] dia berkata; telah menceritakan kepada kami [Abdurrahman bin Mahdi] berkata; telah menceritakan kepadaku [Yahya bin Al Walid] dia berkata; telah menceritakan kepadaku [Muhil bin Khalifah] berkata; telah menceritakan kepadaku [Abu As-Samh] berkata; \"Aku pernah melayani Rasulullah shallallahu 'alaihi wasallam. Jika beliau hendak mandi, maka beliau berkata, 'Palingkan mukamu dariku'. Maka akupun memalingkan mukaku darinya dan menutupi beliau.\""
            },
            {
                "number": 224,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ عَنْ مَالِكٍ عَنْ سَالِمٍ عَنْ أَبِي مُرَّةَ مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ عَنْ أُمِّ هَانِئٍ رَضِيَ اللَّهُ عَنْهَاأَنَّهَا ذَهَبَتْ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ فَوَجَدَتْهُ يَغْتَسِلُ وَفَاطِمَةُ تَسْتُرُهُ بِثَوْبٍ فَسَلَّمَتْ فَقَالَ مَنْ هَذَا قُلْتُ أُمُّ هَانِئٍ فَلَمَّا فَرَغَ مِنْ غُسْلِهِ قَامَ فَصَلَّى ثَمَانِيَ رَكَعَاتٍ فِي ثَوْبٍ مُلْتَحِفًا بِهِ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dari [Abdurrahman] dari [Malik] dari [Salim] dari [Abu Murrah] -budak Aqil bin Abu Thalib- dari [Ummu Hani Radliyallhu'anha] bahwa dia pernah pergi kepada Rasulullah shallallahu 'alaihi wasallam pada hari penaklukkan kota Makkah dan aku mendapati beliau sedang mandi, sedangkan Fatimah menutupinya dengan kain, lantas dia memberi salam. Rasulullah shallallahu 'alaihi wasallam lalu berkata, \"Siapa?\" Aku katakana, \"Ummu Hani.\" Setelah selesai mandi beliau bangkit lalu sholat delapan raka'at dengan kain yang diselimutkan di badannya.\" "
            },
            {
                "number": 225,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ مُوسَى الْجُهَنِيِّ قَالَأُتِيَ مُجَاهِدٌ بِقَدَحٍ حَزَرْتُهُ ثَمَانِيَةَ أَرْطَالٍ فَقَالَ حَدَّثَتْنِي عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْتَسِلُ بِمِثْلِ هَذَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ubaid] dia berkata; telah menceritakan kepada kami [Yahya bin Zakaria bin Abu Zaidah] dari [Musa Al Juhani] dia berkata; bahwa [Mujahid] dibawakan ember -aku perkirakan (kapasitasnya) delapan rithl-, maka ia mengatakan bahwa [Aisyah Radliyallahu'anha] pernah menceritakan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam mandi dengan air yang seperti ini. "
            },
            {
                "number": 226,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بَكْرِ بْنِ حَفْصٍ سَمِعْتُ أَبَا سَلَمَةَ يَقُولُدَخَلْتُ عَلَى عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا وَأَخُوهَا مِنْ الرَّضَاعَةِ فَسَأَلَهَا عَنْ غُسْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَعَتْ بِإِنَاءٍ فِيهِ مَاءٌ قَدْرَ صَاعٍ فَسَتَرَتْ سِتْرًا فَاغْتَسَلَتْ فَأَفْرَغَتْ عَلَى رَأْسِهَا ثَلَاثًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul 'Ala] berkata; telah menceritakan kepada kami [Khalid] berkata; telah menceritakan kepada kami [Syu'bah] dari [Abu Bakr bin Hafsh] aku mendengar [Abu Salamah] berkata; \"Saya menemui [Aisyah] Radliyallahu'anha dan aku adalah saudara Aisyah sepersusuan. Lalu ia bertanya kepadanya tentang mandinya Rasulullah shallallahu 'alaihi wasallam? Maka ia meminta dibawakan bejana berisi air seukuran satu sha', lalu ia menutup diri dan mandi, dan beliau mandi menyiramkan ke kepalanya tiga kali.\""
            },
            {
                "number": 227,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلُ فِي الْقَدَحِ وَهُوَ الْفَرَقُ وَكُنْتُ أَغْتَسِلُ أَنَا وَهُوَ فِي إِنَاءٍ وَاحِدٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Urwah] dari [Aisyah] dia berkata: \"Rasulullah shallallahu 'alaihi wasallam dahulu mandi di ember -al faraq- dan aku mandi beliau dalam satu bejana.\""
            },
            {
                "number": 228,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ اللَّهِ بْنِ جَبْرٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ بِمَكُّوكٍ وَيَغْتَسِلُ بِخَمْسَةِ مَكَاكِيَّ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nushr] dia berkata; telah memberitakan kepada kami [Abdullah] berkata; telah menceritakan kepada kami [Syu'bah] dari [Abdullah bin Jubair] berkata; \"Saya mendengar [Anas bin Malik] berkata; \"Rasulullah shallallahu 'alaihi wasallam berwudlu dengan satu makkuk, dan bila mandi maka beliau menggunakan lima makkuk.\""
            },
            {
                "number": 229,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي جَعْفَرٍ قَالَتَمَارَيْنَا فِي الْغُسْلِ عِنْدَ جَابِرِ بْنِ عَبْدِ اللَّهِ فَقَالَ جَابِرٌ يَكْفِي مِنْ الْغُسْلِ مِنْ الْجَنَابَةِ صَاعٌ مِنْ مَاءٍ قُلْنَا مَا يَكْفِي صَاعٌ وَلَا صَاعَانِ قَالَ جَابِرٌ قَدْ كَانَ يَكْفِي مَنْ كَانَ خَيْرًا مِنْكُمْ وَأَكْثَرَ شَعْرًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dia berkata; telah menceritakan kepada kami [Abu Al Ahwash] dari [Abu Ishaq] dari [Abu Ja'far] berkata; \"Kami berdebat dalam masalah mandi dengan Jabir bin Abdullah, dia berkata; ' Dalam mandi junub cukup satu sha? ' Kami katakan bahwa tidak cukup hanya dengan satu atau dua sha. [Jabir] berkata, \"Satu sha' telah mencukupi bagi orang yang lebih baik dan lebih tebal rambutnya (Rasulullah shallallahu 'alaihi wasallam daripada kalian.\""
            },
            {
                "number": 230,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ ح وَأَنْبَأَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ وَابْنُ جُرَيْجٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ وَهُوَ قَدْرُ الْفَرَقِ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah menceritakan kepada kami [Abdullah] dari [Ma'mar] dari [Az-Zuhri]. Dalam jalur periwayatan yang lain disebutkan; Dan telah memberitakan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [Abdur Razak] berkata; Telah memberitakan kepada kami [Ma'mar] dan [Ibnu Juraij] dari [Az-Zuhri] dari ['Urwah] dari [Aisyah] Radliyallahu'anha, dia berkata; \" Aku pernah mandi bersama Rasulullah shallallahu 'alaihi wasallam dari satu bejana, dan bejana itu seukuran satu faraq.\" "
            },
            {
                "number": 231,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ هِشَامِ بْنِ عُرْوَةَ ح وَأَنْبَأَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَغْتَسِلُ وَأَنَا مِنْ إِنَاءٍ وَاحِدٍ نَغْتَرِفُ مِنْهُ جَمِيعًا",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; Telah memberitakan kepada kami [Abdullah] dari [Hisyam bin 'Urwah] dan Telah memberitakan kepada kami [Qutaibah] dari [Malik] dari [Hisyam bin Urwah] dari [Bapaknya] dari [Aisyah] Radliyallahu'anha dia berkata; \" Rasulullah shallallahu 'alaihi wasallam mandi bersamaku dari satu bejana. Kami menyiduk air dari bejana tersebut bersama-sama.\""
            },
            {
                "number": 232,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ الْقَاسِمِ قَالَ سَمِعْتُ الْقَاسِمَ يُحَدِّثُ عَنْ عَائِشَةَ قَالَتْكُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ مِنْ الْجَنَابَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Syu'bah] dia berkata; telah menceritakan kepadaku [Abdurrahman bin Al Qasim] dia berkata; saya mendengar [Al Qasim] diceritakan dari [Aisyah] dia berkata, \" Aku dan Rasulullah shallallahu 'alaihi wasallam mandi junub bersama dari satu bejana.\""
            },
            {
                "number": 233,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْلَقَدْ رَأَيْتُنِي أُنَازِعُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْإِنَاءَ أَغْتَسِلُ أَنَا وَهُوَ مِنْهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami ['Abidah bin Humaid] dari [Manshur] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] Radliyallahu'anha dia berkata, \" Seingatku aku pernah berebut bejana air bersama Rasulullah shallallahu 'alaihi wasallam. Aku dan beliau shallallahu 'alaihi wasallam mandi dari bejana tersebut.\""
            },
            {
                "number": 234,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي مَنْصُورٌ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ",
                "id": "Telah mengabarkan kepada kami [Amr bin Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Sufyan] berkata; telah menceritakan kepadaku [Manshur] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] Radliyallhu'anha dia berkata, \" Aku pernah mandi bersama Rasulullah shallallahu 'alaihi wasallam dari satu bejana.\""
            },
            {
                "number": 235,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ مُوسَى عَنْ سُفْيَانَ عَنْ عَمْرٍو عَنْ جَابِرِ بْنِ زَيْدٍ عَنْ ابْنِ عَبَّاسٍ قَالَ أَخْبَرَتْنِي خَالَتِي مَيْمُونَةُأَنَّهَا كَانَتْ تَغْتَسِلُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Musa] dari [Sufyan] dari [Amr] dari [Jabir bin Zaid] dari [Ibnu Abbas] dia berkata; \"Bibiku - [Maimunah] - memberitahukan bahwa dia pernah mandi bersama Rasulullah shallallahu 'alaihi wasallam dari satu bejana.\""
            },
            {
                "number": 236,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ سَعِيدِ بْنِ يَزِيدَ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ هُرْمُزَ الْأَعْرَجَ يَقُولُ حَدَّثَنِي نَاعِمٌ مَوْلَى أُمِّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ أُمَّ سَلَمَةَ سُئِلَتْ أَتَغْتَسِلُ الْمَرْأَةُ مَعَ الرَّجُلِ قَالَتْ نَعَمْ إِذَا كَانَتْ كَيِّسَةً رَأَيْتُنِي وَرَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَغْتَسِلُ مِنْ مِرْكَنٍ وَاحِدٍ نُفِيضُ عَلَى أَيْدِينَا حَتَّى نُنْقِيَهُمَا ثُمَّ نُفِيضَ عَلَيْهَا الْمَاءَ قَالَ الْأَعْرَجُ لَا تَذْكُرُ فَرْجًا وَلَا تَبَالَهُ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah menceritakan kepada kami [Abdullah] dari [Said bin Yazid] dia berkata; Saya mendengar [Abdurrahman bin Hurmuz Al A'raj] berkata; telah menceritakan kepadaku [Na'im] -budak Ummu Salamah Radliyallahu'anha bahwa [Ummu Salamah] pernah ditanya, \"Apakah perempuan boleh mandi bersama suaminya? Ia menjawab, \"Ya, jika perempuannya berakal dan cepat paham. Aku dan Rasulullah shallallahu 'alaihi wasallam pernah mandi bersama dari satu wadah. Kami mengguyur air ke tangan-tangan kami hingga kami membersihkannya, kemudian kami siramkan air kepada dua tangan kami.\" "
            },
            {
                "number": 237,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ دَاوُدَ الْأَوْدِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَلَقِيتُ رَجُلًا صَحِبَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا صَحِبَهُ أَبُو هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَرْبَعَ سِنِينَ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَمْتَشِطَ أَحَدُنَا كُلَّ يَوْمٍ أَوْ يَبُولَ فِي مُغْتَسَلِهِ أَوْ يَغْتَسِلَ الرَّجُلُ بِفَضْلِ الْمَرْأَةِ وَالْمَرْأَةُ بِفَضْلِ الرَّجُلِ وَلْيَغْتَرِفَا جَمِيعًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Daud Al Audi] dari [Humaid bin Abdurrahman], dia berkata; \"Aku berjumpa dengan [seseorang] yang bersahabat dengan Rasulullah shallallahu 'alaihi wasallam selama empat tahun, sebagaimana halnya Abu Hurairah Radliyallahu'anhu yang berkawan dengan nabi shallallahu 'alaihi wasallam selama itu pula, dia berkata; ' Rasulullah shallallahu 'alaihi wasallam melarang salah seorang dari kita menyisir rambut tiap hari atau buang air kecil pada tempat mandinya, atau seseorang mandi dengan air sisa mandi istrinya atau sebaliknya, namun ciduklah air itu bersama-sama.\" "
            },
            {
                "number": 238,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ عَنْ مُحَمَّدٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ ح و أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عَاصِمٍ عَنْ مُعَاذَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءِ وَاحِدٍ يُبَادِرُنِي وَأُبَادِرُهُ حَتَّى يَقُولَ دَعِي لِي وَأَقُولُ أَنَا دَعْ لِي قَالَ سُوَيْدٌ يُبَادِرُنِي وَأُبَادِرُهُ فَأَقُولُ دَعْ لِي دَعْ لِي",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basyar] dari [Muhammad] dia berkata; telah menceritakan kepada kami [Syu'bah] dari ['Ashim] dan Telah mengabarkan kepada kami [Suwaid bin Nashr] Telah memberitakan kepada kami [Abdullah] dari ['Ashim] dari [Mu'adzah] dari [Aisyah] Radliyallahu'anha dia berkata; \" Aku pernah mandi bersama Rasulullah shallallahu 'alaihi wasallam dari satu bejana. Beliau mendahuluiku dan aku pun mendahului beliau, hingga beliau berkata, 'Tinggalkan untukku'. Aku juga berkata, 'Tinggalkan untukku'. beliau mendahuluiku dan aku mendahului beliau, lalu aku katakan, 'Tinggalkan untukku, tinggalkan untukku.\""
            },
            {
                "number": 239,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ أُمِّ هَانِئٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْتَسَلَ هُوَ وَمَيْمُونَةُ مِنْ إِنَاءٍ وَاحِدٍ فِي قَصْعَةٍ فِيهَا أَثَرُ الْعَجِينِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basyar] dia berkata; telah menceritakan kepada kami [Abdurrahman] berkata; telah menceritakan kepada kami [Ibrahim bin Nafi'] dari [Ibnu Abu Nujaih] dari [Mujahid] dari [Ummu Hani'] bahwa Rasulullah shallallahu 'alaihi wasallam mandi bersama Maimunah dari satu bejana yang ada sisa adonan.\""
            },
            {
                "number": 240,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ مَنْصُورٍ عَنْ سُفْيَانَ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ رَافِعٍ عَنْ أُمِّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَا زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ أَشُدُّ ضَفْرَ رَأْسِي أَفَأَنْقُضُهَا عِنْدَ غَسْلِهَا مِنْ الْجَنَابَةِ قَالَ إِنَّمَا يَكْفِيكِ أَنْ تَحْثِي عَلَى رَأْسِكِ ثَلَاثَ حَثَيَاتٍ مِنْ مَاءٍ ثُمَّ تُفِيضِينَ عَلَى جَسَدِكِ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Manshur] dari [Sufyan] dari [Ayyub bin Musa] dari [Sa'id bin Abu Sa'id] dari [Abdullah bin Rafi'] dari [Ummu Salamah] Radliyallahu'anha -salah satu istri Rasulullah shallallahu 'alaihi wasallam- dia berkata, \"Aku pernah bertanya kepada beliau, 'Wahai Rasulullah shallallahu 'alaihi wasallam! Aku mengikat (rambut) kepalaku, apakah aku harus menguraikannya saat mandi junub? ' Beliau shallallahu 'alaihi wasallam menjawab, ' Cukup dengan menyiramkan air ke kepalamu tiga kali, kemudian siramkan ke badanmu.\""
            },
            {
                "number": 241,
                "arab": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا أَشْهَبُ عَنْ مَالِكٍ أَنَّ ابْنَ شِهَابٍ وَهِشَامَ بْنَ عُرْوَةَ حَدَّثَاهُ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ حَجَّةِ الْوَدَاعِ فَأَهْلَلْتُ بِالْعُمْرَةِ فَقَدِمْتُ مَكَّةَ وَأَنَا حَائِضٌ فَلَمْ أَطُفْ بِالْبَيْتِ وَلَا بَيْنَ الصَّفَا وَالْمَرْوَةِ فَشَكَوْتُ ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ انْقُضِي رَأْسَكِ وَامْتَشِطِي وَأَهِلِّي بِالْحَجِّ وَدَعِي الْعُمْرَةَ فَفَعَلْتُ فَلَمَّا قَضَيْنَا الْحَجَّ أَرْسَلَنِي مَعَ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ إِلَى التَّنْعِيمِ فَاعْتَمَرْتُ فَقَالَ هَذِهِ مَكَانُ عُمْرَتِكِقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ لَمْ يَرْوِهِ أَحَدٌ إِلَّا أَشْهَبُ",
                "id": "Telah mengabarkan kepada kami [Yunus bin Abdul A'la] dia berkata; telah menceritakan kepada kami [Asyhab] dari [Malik] bahwa [Ibnu Syihab] dan [Hisyam bin Urwah] keduanya berkata kepadanya; dari [Urwah] dari [Aisyah] Radliyallahu'anha, dia berkata; \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam pada tahun haji wada'. Aku berihram untuk umrah, lalu datang ke Makkah padahal aku sedang haid, maka aku tidak thawaf di Ka'bah dan tidak sa'i antara Shafa dan Marwah. Kemudian aku mengadu kepada Rasulullah shallallahu 'alaihi wasallam, dan beliau pun bersabda, ' Lepaskan kepangan rambut kepalamu, lalu sisirlah. Kemudian berihram untuk haji dan tinggalkan umrah'. Akupun melakukannya, dan setelah selesai haji beliau mengutusku dan Abdurrahman bin Abu Bakar (saudaraku) ke Tan'im, lalu aku berihram. Beliau kemudian berkata kepadaku, 'Ini tempat umrahmu.\" Abu Abdurrahman berkata; \"Ini Hadits gharib (asing), hadits Malik dari Hisyam bin Urwah tidak seorangpun yang meriwayatkannya kecuali Asyhab. "
            },
            {
                "number": 242,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا حُسَيْنٌ عَنْ زَائِدَةَ قَالَ حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَتْنِي عَائِشَةُ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا اغْتَسَلَ مِنْ الْجَنَابَةِ وُضِعَ لَهُ الْإِنَاءُ فَيَصُبُّ عَلَى يَدَيْهِ قَبْلَ أَنْ يُدْخِلَهُمَا الْإِنَاءَ حَتَّى إِذَا غَسَلَ يَدَيْهِ أَدْخَلَ يَدَهُ الْيُمْنَى فِي الْإِنَاءِ ثُمَّ صَبَّ بِالْيُمْنَى وَغَسَلَ فَرْجَهُ بِالْيُسْرَى حَتَّى إِذَا فَرَغَ صَبَّ بِالْيُمْنَى عَلَى الْيُسْرَى فَغَسَلَهُمَا ثُمَّ تَمَضْمَضَ وَاسْتَنْشَقَ ثَلَاثًا ثُمَّ يَصُبُّ عَلَى رَأْسِهِ مِلْءَ كَفَّيْهِ ثَلَاثَ مَرَّاتٍ ثُمَّ يُفِيضُ عَلَى جَسَدِهِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] dia berkata; telah menceritakan kepada kami [Husain] dari [Zaidah] berkata; telah menceritakan kepada kami [Atha' bin Saib] berkata; telah menceritakan kepadaku [Abu Salamah bin Abdurrahman] berkata; telah menceritakan kepadaku [Aisyah] Radliyallahu'anha bahwa jika Rasulullah shallallahu 'alaihi wasallam mandi junub, maka diletakkannya bejana air lalu beliau menyiram kedua tangannya sebelum memasukkannya ke dalam bejana. Bila beliau sudah mencuci kedua tangannya, maka beliau memasukkan tangan kanannya kedalam bejana dan menyiramkan dengan tangan kanannya dan mencuci kemaluannya dengan tangan kirinya. Setelah selesai, maka beliau menyiramkan dengan tangan kanannya ke tangan kirinya, lalu mencuci keduanya, kemudian berkumur dan memasukkan air ke hidung tiga kali, menyiramkan air sepenuh telapak tangannya ke kepalanya tiga kali, dan menyiram seluruh badannya.\" "
            },
            {
                "number": 243,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَزِيدُ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِي سَلَمَةَ قَالَسَأَلْتُ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا عَنْ غُسْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْجَنَابَةِ فَقَالَتْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُفْرِغُ عَلَى يَدَيْهِ ثَلَاثًا ثُمَّ يَغْسِلُ فَرْجَهُ ثُمَّ يَغْسِلُ يَدَيْهِ ثُمَّ يُمَضْمِضُ وَيَسْتَنْشِقُ ثُمَّ يُفْرِغُ عَلَى رَأْسِهِ ثَلَاثًا ثُمَّ يُفِيضُ عَلَى سَائِرِ جَسَدِهِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] dia berkata; telah menceritakan kepada kami [Yazid] berkata; telah menceritakan kepada kami [Syu'bah] dari [Atha' bin Sa'ib] dari [Abu Salamah] berkata; \"Aku bertanya kepada Aisyah Radliyallahu'anha tentang mandi junub Rasulullah shallallahu 'alaihi wasallam? [Aisyah] lalu menjawab, \" Beliau shallallahu 'alaihi wasallam menyiramkan air ke kedua tangannya tiga kali, kemudian mencuci kemaluannya, lalu mencuci kedua tangannya, berkumur, memasukkan air ke hidung, menyiramkan air ke kepalanya tiga kali, kemudian menyiramkan air ke seluruh tubuhnya.\""
            },
            {
                "number": 244,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ أَنْبَأَنَا النَّضْرُ قَالَ أَنْبَأَنَا شُعْبَةُ قَالَ أَنْبَأَنَا عَطَاءُ بْنُ السَّائِبِ قَالَ سَمِعْتُ أَبَا سَلَمَةَأَنَّهُ دَخَلَ عَلَى عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا فَسَأَلَهَا عَنْ غُسْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْجَنَابَةِ فَقَالَتْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُؤْتَى بِالْإِنَاءِ فَيَصُبُّ عَلَى يَدَيْهِ ثَلَاثًا فَيَغْسِلُهُمَا ثُمَّ يَصُبُّ بِيَمِينِهِ عَلَى شِمَالِهِ فَيَغْسِلُ مَا عَلَى فَخِذَيْهِ ثُمَّ يَغْسِلُ يَدَيْهِ وَيَتَمَضْمَضُ وَيَسْتَنْشِقُ وَيَصُبُّ عَلَى رَأْسِهِ ثَلَاثًا ثُمَّ يُفِيضُ عَلَى سَائِرِ جَسَدِهِ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] Telah memberitakan kepada kami [An-Nadhr] dia berkata; Telah memberitakan kepada kami [Syu'bah] berkata; Telah memberitakan kepada kami ['Atha bin Saib] berkata; \"Saya mendengar [Abu Salamah] dia pernah datang kepada Aisyah dan bertanya tentang mandi junub Rasulullah shallallahu 'alaihi wasallam? [Aisyah] lalu menjawab, \"Beliau shallallahu 'alaihi wasallam dibawakan bejana; beliau menyiramkan air ke kedua tangannya tiga kali, kemudian mencuci kedua tangannya, kemudian menyiramkan dengan tangan kanannya ke tangan kirinya, lantas mencuci apa yang ada di kedua pahanya, kemudian mencuci kedua tangannya dan berkumur serta memasukkan air ke hidung, kemudian menyiramkan air ke kepalanya tiga kali, lalu menyiramkan air ke seluruh tubuhnya.\""
            },
            {
                "number": 245,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالَوَصَفَتْ عَائِشَةُ غُسْلَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْجَنَابَةِ قَالَتْ كَانَ يَغْسِلُ يَدَيْهِ ثَلَاثًا ثُمَّ يُفِيضُ بِيَدِهِ الْيُمْنَى عَلَى الْيُسْرَى فَيَغْسِلُ فَرْجَهُ وَمَا أَصَابَهُ قَالَ عُمَرُ وَلَا أَعْلَمُهُ إِلَّا قَالَ يُفِيضُ بِيَدِهِ الْيُمْنَى عَلَى الْيُسْرَى ثَلَاثَ مَرَّاتٍ ثُمَّ يَتَمَضْمَضُ ثَلَاثًا وَيَسْتَنْشِقُ ثَلَاثًا وَيَغْسِلُ وَجْهَهُ ثَلَاثًا ثُمَّ يُفِيضُ عَلَى رَأْسِهِ ثَلَاثًا ثُمَّ يَصُبُّ عَلَيْهِ الْمَاءَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [Umar bin 'Ubaid] dari [Atha bin Saib] dari [Abu Salamah bin Abdurrahman] dia berkata; \" [Aisyah] menyifati (menerangkan) cara mandi Rasulullah shallallahu 'alaihi wasallam, dia berkata, 'Beliau mencuci kedua tangannya tiga kali, kemudian menyiramkan dengan tangan kanannya ke tangan kirinya, lantas mencuci kemaluannya dan yang mengenainya Umar berkata; \"Yang saya ketahui beliau menyiramkan dengan tangan kanannya ke tangan kirinya tiga kali-kemudian berkumur tiga kali serta memasukkan air ke hidung tiga kali, membasuh mukanya tiga kali, kemudian beliau menyiramkan air ke kepalanya tiga kali lalu menyiram seluruh tubuhnya. "
            },
            {
                "number": 246,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا اغْتَسَلَ مِنْ الْجَنَابَةِ بَدَأَ فَغَسَلَ يَدَيْهِ ثُمَّ تَوَضَّأَ كَمَا يَتَوَضَّأُ لِلصَّلَاةِ ثُمَّ يُدْخِلُ أَصَابِعَهُ الْمَاءَ فَيُخَلِّلُ بِهَا أُصُولَ شَعْرِهِ ثُمَّ يَصُبُّ عَلَى رَأْسِهِ ثَلَاثَ غُرَفٍ ثُمَّ يُفِيضُ الْمَاءَ عَلَى جَسَدِهِ كُلِّهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Hisyam bin Urwah] dari [Bapaknya] Dari [Aisyah] Radliyallahu'anha, apabila Rasulullah shallallahu 'alaihi wasallam mandi junub, maka beliau mulai dengan mencuci kedua tangannya, kemudian berwudlu seperti untuk sholat, kemudian memasukkan jari-jarinya kedalam air lalu membersihkan celah-celah pangkal rambutnya dengan jari-jarinya, lantas menyiramkan air ke kepalanya dengan cidukan tiga kali, kemudian menyiramkan air ke seluruh tubuhnya. "
            },
            {
                "number": 247,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ أَنْبَأَنَا يَحْيَى قَالَ أَنْبَأَنَا هِشَامُ بْنُ عُرْوَةَ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَتْنِي عَائِشَةُ رَضِيَ اللَّهُ عَنْهَاعَنْ غُسْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْجَنَابَةِ أَنَّهُ كَانَ يَغْسِلُ يَدَيْهِ وَيَتَوَضَّأُ وَيُخَلِّلُ رَأْسَهُ حَتَّى يَصِلَ إِلَى شَعْرِهِ ثُمَّ يُفْرِغُ عَلَى سَائِرِ جَسَدِهِ",
                "id": "Telah mengabarkan kepada kami [Amr bin Ali] dia berkata; Telah memberitakan kepada kami [Yahya] dia berkata; Telah memberitakan kepada kami [Hisyam bin Urwah] dia berkata; telah mengabarkan kepadaku [Bapakku] dia berkata; telah menceritakan kepadaku [Aisyah] Radliyallahu'anha tentang mandi junub Rasulullah shallallahu 'alaihi wasallam, 'Beliau mencuci tangannya lalu berwudlu dan menyela-nyela kepalanya hingga rambutnya, kemudian menyiramkan air ke seluruh badannya.\""
            },
            {
                "number": 248,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُشَرِّبُ رَأْسَهُ ثُمَّ يَحْثِي عَلَيْهِ ثَلَاثًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Yazid] dia berkata; Telah menceritakan kepada kami [Sufyan] dari [Hisyam bin Urwah] dari [Bapaknya] dari [Aisyah] Radliyallahu'anha bahwa Rasulullah shallallahu 'alaihi wasallam mengairi kepalanya kemudian menyiramnya tiga kali.\" "
            },
            {
                "number": 249,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ سُلَيْمَانَ بْنِ صُرَدٍ عَنْ جُبَيْرِ بْنِ مُطْعِمٍ قَالَتَمَارَوْا فِي الْغُسْلِ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بَعْضُ الْقَوْمِ إِنِّي لَأَغْسِلُ كَذَا وَكَذَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا أَنَا فَأُفِيضُ عَلَى رَأْسِي ثَلَاثَ أَكُفٍّ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; Telah menceritakan kepada kami [Abu Ahwash] dari [Abu Ishaq] dari [Sulaiman bin Shurd] dari [Jubair bin Muth'im] berkata; \"Orang-orang berdebat di hadapan Rasulullah shallallahu 'alaihi wasallam dalam masalah mandi; sebagian berkata, 'Aku menyiramkannya seperti ini. ' Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \" Aku menyiram kepalaku dengan tiga (cidukan) telapak tangan.\" "
            },
            {
                "number": 250,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ وَهُوَ ابْنُ صَفِيَّةَ عَنْ أُمِّهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ امْرَأَةً سَأَلْتِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ غُسْلِهَا مِنْ الْمَحِيضِ فَأَخْبَرَهَا كَيْفَ تَغْتَسِلُ ثُمَّ قَالَ خُذِي فِرْصَةً مِنْ مَسْكٍ فَتَطَهَّرِي بِهَا قَالَتْ وَكَيْفَ أَتَطَهَّرُ بِهَا فَاسْتَتَرَ كَذَا ثُمَّ قَالَ سُبْحَانَ اللَّهِ تَطَهَّرِي بِهَا قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا فَجَذَبْتُ الْمَرْأَةَ وَقُلْتُ تَتَّبِعِينَ بِهَا أَثَرَ الدَّمِ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Muhammad bin Abdurrahman] dia berkata; Telah menceritakan kepada kami [Sufyan] dari [Manshur yaitu Ibnu Shafiyyah] dari [Ibunya] dari [Aisyah] Radliyallhu'anha bahwa ada seorang perempuan bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang mandi seorang perempuan dari haidnya? Maka Rasulullah shallallahu 'alaihi wasallam mengajarkan cara mandi dari haid. Kemudian beliau bersabda: \" Ambil sepotong kapas (yang sudah diberi) minyak wangi misik dan bersucilah dengannya.\" Lalu dia bertanya, \"Bagaimana aku bersuci dengannya\" Beliaupun segera bersembunyi dan bersabda, \"Subhaanallah! Bersucilah dengannya.\" Aisyah Radliyallahu'anha berkata; Maka aku menariknya dan kukatakan kepadanya; 'kamu usap-usap dengan kapas itu sisa-sisa darahnya. '"
            },
            {
                "number": 251,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ قَالَ حَدَّثَنَا أَبِي أَنْبَأَنَا الْحَسَنُ وَهُوَ ابْنُ صَالِحٍ عَنْ أَبِي إِسْحَقَ ح و حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَتَوَضَّأُ بَعْدَ الْغُسْلِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Utsman bin Hakim] dia berkata; Telah menceritakan kepada kami [Bapakku] Telah memberitakan kepada kami [Al Hasan yaitu Ibnu Shalih] dari [Abu Ishaq], dan telah menceritakan kepada kami [Amr bin Ali] dia berkata; Telah menceritakan kepada kami [Abdurrahman] berkata; Telah menceritakan kepada kami [Syarik] dari [Abu Ishaq] dari [Al Aswad] dari [Aisyah] Radliyallahu'anha dia berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak berwudlu lagi setelah mandi wajib.\""
            },
            {
                "number": 252,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا عِيسَى عَنْ الْأَعْمَشِ عَنْ سَالِمٍ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَ حَدَّثَتْنِي خَالَتِي مَيْمُونَةُ قَالَتْأَدْنَيْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غُسْلَهُ مِنْ الْجَنَابَةِ فَغَسَلَ كَفَّيْهِ مَرَّتَيْنِ أَوْ ثَلَاثًا ثُمَّ أَدْخَلَ بِيَمِينِهِ فِي الْإِنَاءِ فَأَفْرَغَ بِهَا عَلَى فَرْجِهِ ثُمَّ غَسَلَهُ بِشِمَالِهِ ثُمَّ ضَرَبَ بِشِمَالِهِ الْأَرْضَ فَدَلَكَهَا دَلْكًا شَدِيدًا ثُمَّ تَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ ثُمَّ أَفْرَغَ عَلَى رَأْسِهِ ثَلَاثَ حَثَيَاتٍ مِلْءَ كَفِّهِ ثُمَّ غَسَلَ سَائِرَ جَسَدِهِ ثُمَّ تَنَحَّى عَنْ مَقَامِهِ فَغَسَلَ رِجْلَيْهِ قَالَتْ ثُمَّ أَتَيْتُهُ بِالْمِنْدِيلِ فَرَدَّهُ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr] dia berkata; Telah memberitakan kepada kami [Isa] dari [Al A'masy] dari [Salim] dari [Kuraib] dari [Ibnu Abbas] dia berkata; Telah menceritakan kepadaku sepupuku - [Maimunah] - dia berkata; ' Aku mendekat kepada Rasulullah shallallahu 'alaihi wasallam saat beliau mandi junub; beliau mencuci kedua telapak tangannya dua kali atau tiga kali, kemudian memasukkan tangannya kedalam bejana, lalu menuangkan air ke kemaluannya dan mencuci dengan tangan kirinya, lalu memukulkan tangan kirinya ke tanah dan menggosok-gosoknya dengan kuat, kemudian beliau berwudlu sebagaimana wudlu untuk sholat. Selanjutnya beliau menyiramkan air sepenuh telapak tangan ke kepalanya sebanyak tiga kali, dan membasuh seluruh badannya. Kemudian berpindah dari tempat mandinya, lalu membasuh kakinya.\" Dia berkata, \"Aku membawakan handuk, namun beliau menolaknya.\""
            },
            {
                "number": 253,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ أَيُّوبَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ الْأَعْمَشِ عَنْ سَالِمٍ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْتَسَلَ فَأُتِيَ بِمِنْدِيلٍ فَلَمْ يَمَسَّهُ وَجَعَلَ يَقُولُ بِالْمَاءِ هَكَذَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya bin Ayyub bin Ibrahim] dia berkata; Telah menceritakan kepada kami [Abdullah bin Idris] dari [Al A'masy] dari [Salim] dari [Kuraib] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam mandi, kemudian di bawakan handuk untuknya. Namun beliau tidak mengelap (badan) nya dengan handuk tersebut. Beliau katakan 'cukuplah air di badan ini dilap dengan tangan'. "
            },
            {
                "number": 254,
                "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ سُفْيَانَ بْنِ حَبِيبٍ عَنْ شُعْبَةَ ح و حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى وَعَبْدُ الرَّحْمَنِ عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ عَمْرٌو كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَأْكُلَ أَوْ يَنَامَ وَهُوَ جُنُبٌ تَوَضَّأَ زَادَ عَمْرٌو فِي حَدِيثِهِ وُضُوءَهُ لِلصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dari [Sufyan bin Habib] dari [Syu'bah], dan telah menceritakan kepada kami [Amr bin Ali] dia berkata; Telah menceritakan kepada kami [Yahya] dan [Abdurrahman] dari [Syu'bah] dari [Al Hakam] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] Radliyallahu'anha, dia berkata, \"Nabi shallallahu 'alaihi wasallam -pada lafazh lain Rasulullah shallallahu 'alaihi wasallam - bila ingin makan atau tidur ketika sedang junub, maka beliau berwudlu. Amr menambahkan, \"seperti wudlu untuk sholat.\""
            },
            {
                "number": 255,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مُحَمَّدٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يَنَامَ وَهُوَ جُنُبٌ تَوَضَّأَ وَإِذَا أَرَادَ أَنْ يَأْكُلَ غَسَلَ يَدَيْهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ubaid bin Muhammad] dia berkata; Telah menceritakan kepada kami [Abdullah bin Al Mubarak] dari [Yunus] dari [Az-Zuhri] dari [Abu Salamah] dari [Aisyah Radliyallahu'anha], bahwa apabila Rasulullah shallallahu 'alaihi wasallam hendak tidur sedangkan beliau dalam keadaan junub, maka beliau berwudlu, dan bila hendak makan beliau hanya mencuci keduanya tangannya. "
            },
            {
                "number": 256,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَنَامَ وَهُوَ جُنُبٌ تَوَضَّأَ وَإِذَا أَرَادَ أَنْ يَأْكُلَ أَوْ يَشْرَبَ قَالَتْ غَسَلَ يَدَيْهِ ثُمَّ يَأْكُلُ أَوْ يَشْرَبُ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; Telah memberitakan kepada kami [Abdullah] dari [Yunus] dari [Az-Zuhri] dari [Abu Salamah] dari [Aisyah Radliyallahu'anha], dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam ingin tidur dan beliau sedang junub, maka beliau berwudlu, dan bila ingin makan atau minum (Aisyah) berkata, \"Beliau mencuci kedua tangannya, kemudian makan atau minum.\""
            },
            {
                "number": 257,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَرَادَ أَنْ يَنَامَ وَهُوَ جُنُبٌ تَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِ قَبْلَ أَنْ يَنَامَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dia berkata; Telah menceritakan kepada kami [Al-Laits] dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman] dari [Aisyah] Radliyallahu'anha, dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam ingin tidur padahal beliau sedang junub, maka beliau berwudlu seperti wudlu untuk sholat sebelum tidur.\""
            },
            {
                "number": 258,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ عُمَرَ قَالَ يَا رَسُولَ اللَّهِ أَيَنَامُ أَحَدُنَا وَهُوَ جُنُبٌ قَالَ إِذَا تَوَضَّأَ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Sa'id] dia berkata; Telah menceritakan kepada kami [Yahya] dari [ubaidhullah] dia berkata; Telah mengabarkan kepadaku [Nafi'] dari [Abdullah bin Umar] bahwa Umar pernah bertanya, \"Wahai Rasulullah shallallahu 'alaihi wasallam! Apakah salah seorang dari kami boleh tidur bila sedang junub?\" Beliau menjawab, \"Jika ia telah wudlu.\""
            },
            {
                "number": 259,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَذَكَرَ عُمَرُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ تُصِيبُهُ الْجَنَابَةُ مِنْ اللَّيْلِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأْ وَاغْسِلْ ذَكَرَكَ ثُمَّ نَمْ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Abdullah bin Dinar] dari [Ibnu Umar] dia berkata; \"Umar berkata kepada Rasulullah shallallahu 'alaihi wasallam bahwa dirinya pada suatu malam pernah mengalami junub? Lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya, ' Berwudlu dan cucilah kemaluannya, kemudian tidurlah.\""
            },
            {
                "number": 260,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ قَالَ أَنْبَأَنَا شُعْبَةُ ح وَأَنْبَأَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ وَاللَّفْظُ لَهُ عَنْ عَلِيِّ بْنِ مُدْرِكٍ عَنْ أَبِي زُرْعَةَ عَنْ عَبْدِ اللَّهِ بْنِ نُجَيٍّ عَنْ أَبِيهِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ صُورَةٌ وَلَا كَلْبٌ وَلَا جُنُبٌ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah menceritakan kepada kami [Hisyam bin Abdul Malik] dia berkata; Telah memberitakan kepada kami [Syu'bah], dan Telah memberitakan kepada kami [ubaidhullah bin Sa'id] dia berkata; Telah menceritakan kepada kami [Yahya] dari [Syu'bah] dan lafazh ini darinya, dari [Ali bin Mudrik] dari [Abu Zur'ah] dari [Abdullah bin Nujay] dari [Bapaknya] dari [Ali] Radliyallahu'anhu dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \" Malaikat tidak akan masuk ke dalam rumah yang di dalamnya ada gambar, anjing dan orang yang sedang junub.\""
            },
            {
                "number": 261,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَاصِمٍ عَنْ أَبِي الْمُتَوَكِّلِ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَرَادَ أَحَدُكُمْ أَنْ يَعُودَ تَوَضَّأَ",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Huraits] dia berkata; Telah menceritakan kepada kami [Sufyan] dari ['Ashim] dari [Abu Al Mutawakkil] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \" Apabila salah seorang dari kalian hendak mengulangi (bersetubuh), berwudlulah.\""
            },
            {
                "number": 262,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لِإِسْحَقَ قَالَا حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَافَ عَلَى نِسَائِهِ فِي لَيْلَةٍ بِغُسْلٍ وَاحِدٍ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dan [Ya'qub bin Ibrahim] lafazh ini dari Ishaq, keduanya berkata; Telah menceritakan kepada kami [Ismail bin Ibrahim] dari [Humaid At- Thawil] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam menggilir istri-istrinya dalam satu malam dengan satu kali mandi. "
            },
            {
                "number": 263,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَطُوفُ عَلَى نِسَائِهِ فِي غُسْلٍ وَاحِدٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ubaid] dia berkata; Telah menceritakan kepada kami [Abdullah bin Mubarak] dia berkata; Telah memberitakan kepada kami [Ma'mar] dari [Qatadah] dari [Anas bin Malik], bahwa Rasulullah shallallahu 'alaihi wasallam menggilir istrinya dengan satu kali mandi. "
            },
            {
                "number": 264,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ شُعْبَةَ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ سَلَمَةَ قَالَأَتَيْتُ عَلِيًّا أَنَا وَرَجُلَانِ فَقَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ مِنْ الْخَلَاءِ فَيَقْرَأُ الْقُرْآنَ وَيَأْكُلُ مَعَنَا اللَّحْمَ وَلَمْ يَكُنْ يَحْجُبُهُ عَنْ الْقُرْآنِ شَيْءٌ لَيْسَ الْجَنَابَةَ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr] dia berkata; Telah memberitakan kepada kami [Ismail bin Ibrahim] dari [Syu'bah] dari [Amr bin Murrah] dari [Abdullah bin Salamah] dia berkata; \"Aku dan dua orang laki-laki mendatangi Ali, maka kemudian [Ali] berkata; Rasulullah shallallahu 'alaihi wasallam keluar dari kamar mandi WC, kemudian beliau membaca Al Qur'an, dan makan daging bersama kami, tidak ada yang menghalangi beliau dari membaca Al Qur'an, selain junub. "
            },
            {
                "number": 265,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ أَبُو يُوسُفَ الصَّيْدَلَانِيُّ الرِّقِّيُّ قَالَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ سَلَمَةَ عَنْ عَلِيٍّ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ الْقُرْآنَ عَلَى كُلِّ حَالٍ لَيْسَ الْجَنَابَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ahmad Abu Yusuf As-Shailadani Ar-Riqqi] berkata; Telah menceritakan kepada kami [Isa bin Yunus] berkata; Telah menceritakan kepada kami [Al- A'masy] dari [Amr bin Murrah] dari [Abdullah bin Salamah] dari [Ali] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam selalu membaca Al-Qur'an di setiap saat, kecuali ketika junub.\""
            },
            {
                "number": 266,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ الشَّيْبَانِيِّ عَنْ أَبِي بُرْدَةَ عَنْ حُذَيْفَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا لَقِيَ الرَّجُلَ مِنْ أَصْحَابِهِ مَاسَحَهُ وَدَعَا لَهُ قَالَ فَرَأَيْتُهُ يَوْمًا بُكْرَةً فَحِدْتُ عَنْهُ ثُمَّ أَتَيْتُهُ حِينَ ارْتَفَعَ النَّهَارُ فَقَالَ إِنِّي رَأَيْتُكَ فَحِدْتَ عَنِّي فَقُلْتُ إِنِّي كُنْتُ جُنُبًا فَخَشِيتُ أَنْ تَمَسَّنِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْمُسْلِمَ لَا يَنْجُسُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah memberitakan kepada kami [Jarir] dari [As-Syaibani] dari [Abu Burdah] dari [Hudzaifah] berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam bertemu dengan sahabatnya, maka beliau bersalaman dan mendoakannya. Kemudian Hudzaifah berkata, \"Pada suatu hari aku bertemu dengan beliau shallallahu 'alaihi wasallam, maka aku segera menghindar darinya. Kemudian aku mendatanginya saat matahari telah tinggi, dan beliau shallallahu 'alaihi wasallam berkata kepadaku, 'Aku melihatmu terburu-buru menghindar dariku? ' Aku berkata, \"Aku sedang junub. Aku khawatir engkau menyentuhku! ' Beliau lalu bersabda: ' Orang muslim itu tidak najis.\""
            },
            {
                "number": 267,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَخْبَرَنَا يَحْيَى قَالَ حَدَّثَنَا مِسْعَرٌ قَالَ حَدَّثَنِي وَاصِلٌ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقِيَهُ وَهُوَ جُنُبٌ فَأَهْوَى إِلَيَّ فَقُلْتُ إِنِّي جُنُبٌ فَقَالَ إِنَّ الْمُسْلِمَ لَا يَنْجُسُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] dia berkata; Telah mengabarkan kepada kami [Yahya] berkata; Telah menceritakan kepada kami [Mis'ar] berkata; Telah menceritakan kepadaku [Washil] dari [Abu Wa'il] dari [Hudzaifah] bahwa Nabi shallallahu 'alaihi wasallam berjumpa dengannya, sedangkan dia dalam keadaan junub. Hudzaifah berkata, \"Beliau mendekat kepadaku dengan cepat, maka aku katakan bahwa aku sedang junub. Beliau shallallahu 'alaihi wasallam lalu bersabda; \" Orang muslim tidak najis\". "
            },
            {
                "number": 268,
                "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ حَدَّثَنَا بِشْرٌ وَهُوَ ابْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا حُمَيْدٌ عَنْ بَكْرٍ عَنْ أَبِي رَافِعٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقِيَهُ فِي طَرِيقٍ مِنْ طُرُقِ الْمَدِينَةِ وَهُوَ جُنُبٌ فَانْسَلَّ عَنْهُ فَاغْتَسَلَ فَفَقَدَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا جَاءَ قَالَ أَيْنَ كُنْتَ يَا أَبَا هُرَيْرَةَ قَالَ يَا رَسُولَ اللَّهِ إِنَّكَ لَقِيتَنِي وَأَنَا جُنُبٌ فَكَرِهْتُ أَنْ أُجَالِسَكَ حَتَّى أَغْتَسِلَ فَقَالَ سُبْحَانَ اللَّهِ إِنَّ الْمُؤْمِنَ لَا يَنْجُسُ",
                "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dia berkata; Telah menceritakan kepada kami [Bisyr yaitu Ibnu Al Mufadlal] dia berkata; Telah menceritakan kepada kami [Humaid] dari [Bakr] dari [Abu Rafi'] dari [Abu Hurairah], bahwa Nabi shallallahu 'alaihi wasallam berjumpa dengannya di sebuah jalan di Madinah, sedangkan dia (Abu Hurairah) dalam keadaan junub. Dia pun segera mengelak dari Rasulullah shallallahu 'alaihi wasallam dan segera mandi. Rasulullah shallallahu 'alaihi wasallam mencari-carinya dan setelah Abu Hurairah datang beliau segera bertanya kepadanya, \"Dimana kamu tadi wahai Abu Hurairah?\" Abu Hurairah menjawab, \"Wahai Rasulullah shallallahu 'alaihi wasallam, engkau menjumpaiku sedangkan aku dalam keadaan junub. Aku tidak suka duduk bersama engkau hingga aku mandi!\" Beliau bersabda: \" Maha suci Allah. Orang mukmin itu tidak najis.\""
            },
            {
                "number": 269,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ يَزِيدَ بْنَ كَيْسَانَ قَالَ حَدَّثَنِي أَبُو حَازِمٍ قَالَ قَالَ أَبُو هُرَيْرَةَبَيْنَمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ إِذْ قَالَ يَا عَائِشَةُ نَاوِلِينِي الثَّوْبَ فَقَالَتْ إِنِّي لَا أُصَلِّي قَالَ إِنَّهُ لَيْسَ فِي يَدِكِ فَنَاوَلَتْهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Yazid bin Kaisan] dia berkata; Telah menceritakan kepadaku [Abu Hazim] dia berkata; [Abu Hurairah] berkata; \" Tatkala Rasulullah shallallahu 'alaihi wasallam di masjid, tiba-tiba beliau bersabda, 'Wahai Aisyah, ambilkan baju. ' Aisyah menjawab, 'Aku tidak sholat (sedang tidak suci). ' Beliau bersabda, \"Haid tidak di tanganmu.\" Lalu diapun mengambilkannya.\""
            },
            {
                "number": 270,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ عَبِيدَةَ عَنْ الْأَعْمَشِ ح و أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ ثَابِتِ بْنِ عُبَيْدٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاوِلِينِي الْخُمْرَةَ مِنْ الْمَسْجِدِ قَالَتْ إِنِّي حَائِضٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَتْ حَيْضَتُكِ فِي يَدِكِأَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ مِثْلَهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Said] dari [Abidah] dari [Al A'masy], dan Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Tsabit bin Ubaid] dari [Al Qasim bin Muhammad] dari [Aisyah] Radliyallahu'anha, dia mengatakan bahwa Rasulullah shallallahu 'alaihi wasallam bersabda, \"Ambilkan tikar kecil dari masjid.\" Aisyah berkata, \"Aku sedang haid.\" Rasulullah shallallahu 'alaihi wasallam bersabda, \"Haidmu tidak di tanganmu.\" Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dengan sanad seperti ini juga. "
            },
            {
                "number": 271,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ عَنْ سُفْيَانَ عَنْ مَنْبُوذٍ عَنْ أُمِّهِ أَنَّ مَيْمُونَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضَعُ رَأْسَهُ فِي حَجْرِ إِحْدَانَا فَيَتْلُو الْقُرْآنَ وَهِيَ حَائِضٌ وَتَقُومُ إِحْدَانَا بِالْخُمْرَةِ إِلَى الْمَسْجِدِ فَتَبْسُطُهَا وَهِيَ حَائِضٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dari [Sufyan] dari [Manbudz] dari [Ibunya] bahwa [Maimunah] berkata; \" Rasulullah shallallahu 'alaihi wasallam meletakkan kepalanya di kamar salah satu dari kami (istri-istri Nabi shallallahu 'alaihi wasallam dan beliau membaca Al-Qur'an, dan Maimunah sedang haid. Salah satu dari kami (istri-istri Nabi shallallahu 'alaihi wasallam bangkit membawa tikar ke masjid, lalu menggelarnya, padahal dia sedang haid.\" "
            },
            {
                "number": 272,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَعَلِيُّ بْنُ حُجْرٍ وَاللَّفْظُ لَهُ أَنْبَأَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ أُمِّهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ رَأْسُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجْرِ إِحْدَانَا وَهِيَ حَائِضٌ وَهُوَ يَتْلُو الْقُرْآنَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dan [Ali bin Hujr] Lafazh ini darinya, telah memberitakan kepada kami [Sufyan] dari [Manshur] dari [Ibunya] dari [Aisyah] Radliyallahu'anha, dia berkata, \" Kepala Rasulullah shallallahu 'alaihi wasallam berada di kamar salah satu dari kami yang sedang haid, dan beliau membaca Al-Qur'an.\""
            },
            {
                "number": 273,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي مَنْصُورٌ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُومِئُ إِلَيَّ رَأْسَهُ وَهُوَ مُعْتَكِفٌ فَأَغْسِلُهُ وَأَنَا حَائِضٌ",
                "id": "Telah mengabarkan kepada kami [Amr bin Ali] dia berkata; Telah menceritakan kepada kami [Yahya] berkata; Telah menceritakan kepada kami [Sufyan] berkata; Telah menceritakan kepadaku [Manshur] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] Radliyallahu'anha, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah melongokkan (menjulurkan) kepalanya kepadaku padahal beliau sedang i'tikaf, maka aku membasuhnya, padahal aku sedang haid.\" "
            },
            {
                "number": 274,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ وَذَكَرَ آخَرُ عَنْ أَبِي الْأَسْوَدِ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُخْرِجُ إِلَيَّ رَأْسَهُ مِنْ الْمَسْجِدِ وَهُوَ مُجَاوِرٌ فَأَغْسِلُهُ وَأَنَا حَائِضٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; Telah menceritakan kepada kami [Ibnu Wahab] dari [Amr bin Al Harits], dan yang lainnya menyebutkan dari [Abu Al Aswad] dari [Urwah] dari [Aisyah] Radliyallahu'anha, dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengeluarkan kepalanya kepadaku dari dalam masjid, karena masjidnya bersebelahan, maka aku membasuhnya padahal aku sedang haid. "
            },
            {
                "number": 275,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكُنْتُ أُرَجِّلُ رَأْسَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا حَائِضٌأَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ ح وَأَنْبَأَنَا عَلِيُّ بْنُ شُعَيْبٍ قَالَ حَدَّثَنَا مَعْنٌ قَالَ حَدَّثَنَا مَالِكٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا مِثْلَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Hisyam bin Urwah] dari [Bapaknya] dari [Aisyah] Radliyallahu'anha, dia berkata, \" Aku pernah menyisir rambut Rasulullah shallallahu 'alaihi wasallam, padahal aku sedang haid.\" Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik], dan Telah memberitakan kepada kami [Ali bin Syu'aib] dia berkata; telah menceritakan kepada kami [Ma'an] berkata; telah menceritakan kepada kami [Malik] dari [Az-Zuhri] dari [Urwah] dari [Aisyah] Radliyallahu'anha seperti itu juga. "
            },
            {
                "number": 276,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ الْمِقْدَامِ بْنِ شُرَيْحِ بْنِ هَانِئٍ عَنْ أَبِيهِ عَنْ شُرَيْحٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا سَأَلْتُهَاهَلْ تَأْكُلُ الْمَرْأَةُ مَعَ زَوْجِهَا وَهِيَ طَامِثٌ قَالَتْ نَعَمْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُونِي فَآكُلُ مَعَهُ وَأَنَا عَارِكٌ وَكَانَ يَأْخُذُ الْعَرْقَ فَيُقْسِمُ عَلَيَّ فِيهِ فَأَعْتَرِقُ مِنْهُ ثُمَّ أَضَعُهُ فَيَأْخُذُهُ فَيَعْتَرِقُ مِنْهُ وَيَضَعُ فَمَهُ حَيْثُ وَضَعْتُ فَمِي مِنْ الْعَرْقِ وَيَدْعُو بِالشَّرَابِ فَيُقْسِمُ عَلَيَّ فِيهِ قَبْلَ أَنْ يَشْرَبَ مِنْهُ فَآخُذُهُ فَأَشْرَبُ مِنْهُ ثُمَّ أَضَعُهُ فَيَأْخُذُهُ فَيَشْرَبُ مِنْهُ وَيَضَعُ فَمَهُ حَيْثُ وَضَعْتُ فَمِي مِنْ الْقَدَحِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; Telah menceritakan kepada kami [Yazid yaitu Ibnu Miqdam bin Syuraih bin Hani'] dari [Bapaknya] dari [Syuraih] dari [Aisyah] Radliyallahu'anha aku (perawi) bertanya kepadanya, \"Apakah perempuan boleh makan bersama dengan suaminya jika dia sedang datang haid?\" Dia (Aisyah) berkata, \"Ya, boleh. Rasulullah shallallahu 'alaihi wasallam pernah memanggilku, lalu aku makan bersama beliau, padahal aku sedang haid. Beliau shallallahu 'alaihi wasallam mengambil daging dan membaginya kepadaku. Lantas aku segera memakannya, dan aku menaruhnya. Lalu Rasulullah shallallahu 'alaihi wasallam mengambilnya dan memakannya. Beliau meletakkan mulutnya di daging tempat aku meletakkan mulutku tadi. Lalu beliau meminta air minum dan membaginya kepadaku sebelum beliau meminumnya. Lalu beliau mengambil dan meminumnya, kemudian meletakkannya. Kemudian beliau mengambil dan meminumnya, dan beliau meletakkan mulutnya di tempat aku meletakkan mulutku pada gelas tadi, \""
            },
            {
                "number": 277,
                "arab": "أَخْبَرَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الْوَزَّانُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ الْأَعْمَشِ عَنْ الْمِقْدَامِ بْنِ شُرَيْحٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضَعُ فَاهُ عَلَى الْمَوْضِعِ الَّذِي أَشْرَبُ مِنْهُ فَيَشْرَبُ مِنْ فَضْلِ سُؤْرِي وَأَنَا حَائِضٌ",
                "id": "Telah mengabarkan kepada kami [Ayyub bin Muhammad Al Wazzan] dia berkata; Telah menceritakan kepada kami [Abdullah bin Ja'far] dia berkata; Telah menceritakan kepada kami [ubaidhullah bin Amr] dari [Al A'masy] dari [Al Miqdam bin Syuraih] dari [Bapaknya] dari [Aisyah] Radliyallahu'anha dia berkata, \"Rasulullah shallallahu 'alaihi wasallam meletakkan mulutnya di tempat aku meletakkan mulutku ketika aku meminumnya, dan beliau juga meminum sisa minumku, padahal aku sedang haid.\" "
            },
            {
                "number": 278,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مِسْعَرٍ عَنْ الْمِقْدَامِ بْنِ شُرَيْحٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا تَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنَاوِلُنِي الْإِنَاءَ فَأَشْرَبُ مِنْهُ وَأَنَا حَائِضٌ ثُمَّ أُعْطِيهِ فَيَتَحَرَّى مَوْضِعَ فَمِي فَيَضَعُهُ عَلَى فِيهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dia berkata; Telah menceritakan kepada kami [Sufyan] dari [Mis'ar] dari [Al Miqdam bi Syuraih] dari [Bapaknya] dia berkata; Saya mendengar [Aisyah] Radliyallahu'anha berkata; \" Rasulullah shallallahu 'alaihi wasallam memberikan gelas kepadaku, lalu aku minum darinya, padahal aku sedang haid. Kemudian aku berikan kepadanya, maka beliau mencari bekas tempat mulutku lalu meletakkan mulutnya di situ.\""
            },
            {
                "number": 279,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا مِسْعَرٌ وَسُفْيَانُ عَنْ الْمِقْدَامِ بْنِ شُرَيْحٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكُنْتُ أَشْرَبُ وَأَنَا حَائِضٌ وَأُنَاوِلُهُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَضَعُ فَاهُ عَلَى مَوْضِعِ فِيَّ فَيَشْرَبُ وَأَتَعَرَّقُ الْعَرْقَ وَأَنَا حَائِضٌ وَأُنَاوِلُهُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَضَعُ فَاهُ عَلَى مَوْضِعِ فِيَّ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] dia berkata; Telah menceritakan kepada kami [Waki'] dia berkata; Telah menceritakan kepada kami [Mis'ar] dan [Sufyan] dari [Al Miqdam bin Syuraih] dari [Bapaknya] dari [Aisyah] Radliyallahu'anha, dia berkata, \" Aku pernah minum dalam keadaan haid lalu -sisa minum- aku berikan kepada Nabi shallallahu 'alaihi wasallam, maka beliau meletakkan mulutnya di tempat mulutku, lalu beliau minum. Aku juga pernah menggigit daging dalam keadaan haid, lalu -sisa daging- aku berikan kepada Nabi shallallahu 'alaihi wasallam, maka beliau meletakkan mulutnya di tempat mulutku tadi.\" "
            },
            {
                "number": 280,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا هِشَامٌ ح وَأَنْبَأَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَا حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ وَاللَّفْظُ لَهُ قَالَ حَدَّثَنِي أَبِي عَنْ يَحْيَى قَالَ حَدَّثَنَا أَبُو سَلَمَةَ أَنَّ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ حَدَّثَتْهُ أَنَّ أُمَّ سَلَمَةَ حَدَّثَتْهَا قَالَتْبَيْنَمَا أَنَا مُضْطَجِعَةٌ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْخَمِيلَةِ إِذْ حِضْتُ فَانْسَلَلْتُ فَأَخَذْتُ ثِيَابَ حَيْضَتِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَفِسْتِ قُلْتُ نَعَمْ فَدَعَانِي فَاضْطَجَعْتُ مَعَهُ فِي الْخَمِيلَةِ",
                "id": "Telah mengabarkan kepada kami [Ismail bin Mas'ud] dia berkata; Telah menceritakan kepada kami [Khalid] berkata; Telah menceritakan kepada kami [Hisyam] dan Telah memberitakan kepada kami [ubaidhullah bin Sa'id] dan [Ishaq bin Ibrahim] keduanya berkata; Telah menceritakan kepada kami [Mu'adz bin Hisyam] lafazh ini darinya, dia berkata; Telah menceritakan kepadaku [Bapakku] dari [Yahya] dia berkata; Telah menceritakan kepada kami [Abu Salamah] bahwa [Zainab binti Abu Salamah] berkata kepadanya, sesungguhnya [Ummu Salamah] berkata; \" Ketika aku sedang berbaring (tidur) bersama Rasulullah shallallahu 'alaihi wasallam didalam selimut, tiba-tiba aku haid, maka aku keluar perlahan-lahan, kemudian mengambil pakaian (yang biasa dipakai) haid. Rasulullah shallallahu 'alaihi wasallam bertanya, \"Apakah kamu sedang haid?\" Aku menjawab, 'Ya'. Beliau lalu memanggilku, kami berbaring (tidur) bersama dalam satu selimut.\""
            },
            {
                "number": 281,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ جَابِرِ بْنِ صُبْحٍ قَالَ سَمِعْتُ خِلَاسًا يُحَدِّثُ عَنْ عَائِشَةَ قَالَتْكُنْتُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيتُ فِي الشِّعَارِ الْوَاحِدِ وَأَنَا طَامِثٌ أَوْ حَائِضٌ فَإِنْ أَصَابَهُ مِنِّي شَيْءٌ غَسَلَ مَكَانَهُ وَلَمْ يَعْدُهُ وَصَلَّى فِيهِ ثُمَّ يَعُودُ فَإِنْ أَصَابَهُ مِنِّي شَيْءٌ فَعَلَ مِثْلَ ذَلِكَ وَلَمْ يَعْدُهُ وَصَلَّى فِيهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Jabir bin Shubhi] dia berkata; Saya mendengar [Khilas] berkata; dari [Aisyah] dia berkata; \" Aku pernah tidur bersama Rasulullah shallallahu 'alaihi wasallam dalam satu selimut, padahal aku sedang haid. Jika beliau terkena sesuatu dariku, maka beliau membasuh tempat yang terkena tadi dan tidak melebihinya, kemudian beliau sholat dengan selimut tadi, lalu beliau kembali lagi. Jika beliau terkena sesuatu dariku maka dia melakukan seperti yang tadi tidak melebihinya, lalu sholat dengan kondisi seperti itu.\" "
            },
            {
                "number": 282,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ عَمْرِو بْنِ شُرَحْبِيلَ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ إِحْدَانَا إِذَا كَانَتْ حَائِضًا أَنْ تَشُدَّ إِزَارَهَا ثُمَّ يُبَاشِرُهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; Telah menceritakan kepada kami [Abu Al Ahwash] dari [Abu Ishaq] dari [Amr bin Syurahbil] dari [Aisyah] dia berkata; bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan salah satu dari kami yang sedang haid untuk mengikat kainnya, kemudian beliau mempergaulinya (selain hubungan intim, jimak). "
            },
            {
                "number": 283,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْكَانَتْ إِحْدَانَا إِذَا حَاضَتْ أَمَرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَتَّزِرَ ثُمَّ يُبَاشِرُهَا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah memberitakan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] dia berkata; \" Apabila salah satu dari kami sedang haid, maka Rasulullah shallallahu 'alaihi wasallam memerintahkannya untuk memakai kain, kemudian beliau mempergaulinya (selain hubungan intim, jimak).\""
            },
            {
                "number": 284,
                "arab": "أَخْبَرَنَا الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ عَنْ يُونُسَ وَاللَّيْثِ عَنْ ابْنِ شِهَابٍ عَنْ حَبِيبٍ مَوْلَى عُرْوَةَ عَنْ بُدَيَّةَ وَكَانَ اللَّيْثُ يَقُولُ نَدَبَةَ مَوْلَاةُ مَيْمُونَةَ عَنْ مَيْمُونَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُبَاشِرُ الْمَرْأَةُ مِنْ نِسَائِهِ وَهِيَ حَائِضٌ إِذَا كَانَ عَلَيْهَا إِزَارٌ يَبْلُغُ أَنْصَافَ الْفَخِذَيْنِ وَالرُّكُبَتَيْنِ فِي حَدِيثِ اللَّيْثِ مُحْتَجِزَةً بِهِ",
                "id": "Telah mengabarkan kepada kami [Al Harits bin Miskin] telah dibacakan kepadanya dan saya mendengarnya dari [Ibnu Wahab] dari [Yunus] dan [Al Laits] dari [Ibnu Syihab] dari [Habib] -budak Urwah- dari [Budayah] -dan menurut Al Laits ia adalah budak Maimunah yang fasih- dari [Maimunah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mempergauli salah satu istrinya yang sedang haid apabila memakai kain yang sampai ke tengah kedua pahanya dan kedua lututnya. Di dalam hadits Al-Laits (dikatakan) sebagai penghalangnya.\""
            },
            {
                "number": 285,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِثٍ عَنْ أَنَسٍقَالَ كَانَتْ الْيَهُودُ إِذَا حَاضَتْ الْمَرْأَةُ مِنْهُمْ لَمْ يُؤَاكِلُوهُنَّ وَلَمْ يُشَارِبُوهُنَّ وَلَمْ يُجَامِعُوهُنَّ فِي الْبُيُوتِ فَسَأَلُوا نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ وَيَسْأَلُونَكَ عَنْ الْمَحِيضِ قُلْ هُوَ أَذًى }الْآيَةَ فَأَمَرَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُؤَاكِلُوهُنَّ وَيُشَارِبُوهُنَّ وَيُجَامِعُوهُنَّ فِي الْبُيُوتِ وَأَنْ يَصْنَعُوا بِهِنَّ كُلَّ شَيْءٍ مَا خَلَا الْجِمَاعَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah menceritakan kepada kami [Sulaiman bin Harb] dia berkata; Telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Anas] dia berkata; Bahwa orang Yahudi apabila ada istri mereka sedang haid, maka mereka tidak mengajak makan bersama, tidak mempergaulinya, dan tidak berkumpul bersamanya di rumah. Mereka bertanya kepada Nabi Allah shallallahu 'alaihi wasallam tentang hal itu? Lalu Allah Azza wa Jalla menurunkan ayat \" Mereka bertanya kepadamu tentang haid. Katakanlah, (Hai Muhammad) bahwa itu adalah penyakit… (Qs. Al-Baqarah (2): 222) lalu Rasulullah shallallahu 'alaihi wasallam memerintahkan mereka untuk ikut makan bersama, mempergaulinya, berkumpul dengan mereka di rumah, dan untuk berbuat apa saja selain bersetubuh. "
            },
            {
                "number": 286,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ عَبْدِ الْحَمِيدِ عَنْ مُقْسَمٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّجُلِ يَأْتِي امْرَأَتَهُ وَهِيَ حَائِضٌ يَتَصَدَّقُ بِدِينَارٍ أَوْ بِنِصْفِ دِينَارٍ",
                "id": "Telah mengabarkan kepada kami [Amr bin Ali] dia berkata; Telah menceritakan kepada kami [Yahya] dari [Syu'bah] dari [Al Hakam] dari [Abdul Hamid] dari [Muqsim] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda tentang seorang laki-laki yang menggauli istrinya dalam keadaan haid, \"Bersedekah dengan satu Dinar atau setengah Dinar.\""
            },
            {
                "number": 287,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نُرَى إِلَّا الْحَجَّ فَلَمَّا كَانَ بِسَرِفَ حِضْتُ فَدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَبْكِي فَقَالَ مَا لَكِ أَنَفِسْتِ فَقُلْتُ نَعَمْ قَالَ هَذَا أَمَرٌ كَتَبَهُ اللَّهُ عَزَّ وَجَلَّ عَلَى بَنَاتِ آدَمَ فَاقْضِي مَا يَقْضِي الْحَاجُّ غَيْرَ أَنَّ لَا تَطُوفِي بِالْبَيْتِ وَضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نِسَائِهِ بِالْبَقَرِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah memberitakan kepada kami [Sufyan] dari [Abdurrahman bin Al Qasim] dari [Bapaknya] dari [Aisyah] dia berkata; \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam yang kami tidak kelihatannya kecuali untuk haji. Setelah di Sarif, aku mendapat haid. Kemudian Rasulullah shallallahu 'alaihi wasallam masuk -menemuiku- dan aku menangis. Beliau lalu bertanya, 'Ada apa denganmu? Apakah kamu sedang haid? ' Aku menjawab, 'Ya. ' Beliau berkata ' Ini suatu perkara yang telah Allah Azza wa Jalla tetapkan bagi kaum wanita, jadi kerjakanlah apa yang dikerjakan oleh orang yang haji, selain thawaf di Ka'bah'. Kemudian Rasulullah shallallahu 'alaihi wasallam berkurban sapi untuk para istrinya.\""
            },
            {
                "number": 288,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ وَاللَّفْظُ لَهُ قَالُوا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنِي أَبِي قَالَأَتَيْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ فَسَأَلْنَاهُ عَنْ حَجَّةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَدَّثَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ لِخَمْسٍ بَقِينَ مِنْ ذِي الْقَعْدَةِ وَخَرَجْنَا مَعَهُ حَتَّى إِذَا أَتَى ذَا الْحُلَيْفَةِ وَلَدَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ مُحَمَّدَ بْنَ أَبِي بَكْرٍ فَأَرْسَلَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ أَصْنَعُ قَالَ اغْتَسِلِي وَاسْتَثْفِرِي ثُمَّ أَهِلِّي",
                "id": "Telah mengabarkan kepada kami [Amr bin Ali] dan [Muhammad bin Al Mutsanna] dan [Ya'qub bin Ibrahim] lafazh ini darinya, mereka berkata; Telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; Telah menceritakan kepada kami [Ja'far bin Muhammad] dia berkata; Telah menceritakan kepadaku [Bapakku] dia berkata; \"Kami datang kepada [Jabir bin Abdullah] dan menanyakan tentang hajinya Nabi shallallahu 'alaihi wasallam? Dia lalu menceritakan kepada kami bahwa Rasulullah shallallahu 'alaihi wasallam keluar pada tanggal dua puluh lima Dzul Qa'dah, \"Kami keluar bersama beliau hingga Dzul Hulaifah dan di situ Asma bin Umais melahirkan Muhammad bin Abu Bakar. Lalu ia mengirim seseorang kepada Rasulullah shallallahu 'alaihi wasallam untuk bertanya, 'Apa yang harus kuperbuat? ' Rasulullah shallallahu 'alaihi wasallam berkata, ' Mandilah dan letakkan kain di tempat keluarnya darah, kemudian ihramlah.\""
            },
            {
                "number": 289,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ قَالَ حَدَّثَنِي أَبُو الْمِقْدَامِ ثَابِتٌ الْحَدَّادُ عَنْ عَدِيِّ بْنِ دِينَارٍ قَالَسَمِعْتُ أُمَّ قَيْسٍ بِنْتَ مِحْصَنٍ أَنَّهَا سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ دَمِ الْحَيْضِ يُصِيبُ الثَّوْبَ قَالَ حُكِّيهِ بِضِلَعٍ وَاغْسِلِيهِ بِمَاءٍ وَسِدْرٍ",
                "id": "Telah mengabarkan kepada kami [ubaidhullah bin Sa'id] dia berkata; Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] dia berkata; Telah menceritakan kepadaku [Abu Miqdam Tsabit Al Haddad] dari [Adi bin Dinar] dia berkata; Saya mendengar [Ummu Qais binti Mihshan] bahwa dia pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang darah yang mengenai baju? Beliau shallallahu 'alaihi wasallam menjawab, \" Kerok dengan tulang, lalu cuci dengan air dan sidr (daun bidara).\""
            },
            {
                "number": 290,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ عَنْ حَمَّادِ بْنِ زَيْدٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ فَاطِمَةَ بِنْتِ الْمُنْذِرِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ وَكَانَتْ تَكُونُ فِي حَجْرِهَاأَنَّ امْرَأَةً اسْتَفْتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ دَمِ الْحَيْضِ يُصِيبُ الثَّوْبَ فَقَالَ حُتِّيهِ ثُمَّ اقْرُصِيهِ بِالْمَاءِ ثُمَّ انْضَحِيهِ وَصَلِّي فِيهِ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Habib bin Arabi] dari [Hammad bin Zaid] dari [Hisyam bin Urwah] dari [Fathimah binti Al Mundzir] dari [Asma' binti Abu Bakr] -dia ada di kamarnya- bahwa seorang perempuan meminta fatwa Rasulullah shallallahu 'alaihi wasallam tentang darah haid yang menodai baju? Beliau lalu berkata, ' Gosok dan keroklah dengan kuku, kemudian percikilah dengan air, lalu sholatlah dengan kain tersebut.\""
            },
            {
                "number": 291,
                "arab": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سُوَيْدِ بْنِ قَيْسٍ عَنْ مُعَاوِيَةَ بْنِ حُدَيْجٍ عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَأَنَّهُ سَأَلَ أُمَّ حَبِيبَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي الثَّوْبِ الَّذِي كَانَ يُجَامِعُ فِيهِ قَالَتْ نَعَمْ إِذَا لَمْ يَرَ فِيهِ أَذًى",
                "id": "Telah mengabarkan kepada kami [Isa bin Hammad] dia berkata; Telah menceritakan kepada kami [Al-Laits] dari [Yazid bin Abu Habib] dari [Suwaid bin Qais] dari [Mu'awiyah bin Hudaij] dari [Mu'awiyah bin Abu Sufyan] bahwa ia pernah bertanya kepada [Ummu Habibah] -istri Nabi shallallahu 'alaihi wasallam- \"Apakah Rasulullah shallallahu 'alaihi wasallam sholat dengan mengenakan pakaian yang dipakai untuk bersetubuh?\" Ia menjawab, \"Ya, jika beliau tidak melihat kotoran (mani) pada baju tersebut.\""
            },
            {
                "number": 292,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عَمْرِو بْنِ مَيْمُونٍ الْجَزَرِيِّ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَائِشَةَ قَالَتْكُنْتُ أَغْسِلُ الْجَنَابَةَ مِنْ ثَوْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَخْرُجُ إِلَى الصَّلَاةِ وَإِنَّ بُقَعَ الْمَاءِ لَفِي ثَوْبِهِ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; Telah memberitakan kepada kami [Abdullah] dari [Amr bin Maimun Al Jazari] dari [Sulaiman bin Yasar] dari [Aisyah] dia berkata, \" Aku mencuci bekas junub (mani) dari baju Rasulullah shallallahu 'alaihi wasallam, lalu beliau keluar untuk sholat dan baju tersebut masih ada bekas air mani.\""
            },
            {
                "number": 293,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَبِي هَاشِمٍ عَنْ أَبِي مِجْلَزٍ عَنْ الْحَارِثِ بْنِ نَوْفَلٍ عَنْ عَائِشَةَ قَالَتْكُنْتُ أَفْرُكُ الْجَنَابَةَ وَقَالَتْ مَرَّةً أُخْرَى الْمَنِيَّ مِنْ ثَوْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; Telah menceritakan kepada kami [Hammad] dari [Abu Hasyim] dari [Abu Mijlaz] dari [Al Harits bin Naufal] dari [Aisyah] dia berkata; ' Aku pernah mengerok bekas junub -pada kesempatan lain dia berkata, \"menggosok mani\"- dari baju Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 294,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ قَالَ حَدَّثَنَا بَهْزٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ الْحَكَمُ أَخْبَرَنِي عَنْ إِبْرَاهِيمَ عَنْ هَمَّامِ بْنِ الْحَارِثِ أَنَّ عَائِشَةَ قَالَتْلَقَدْ رَأَيْتُنِي وَمَا أَزِيدُ عَلَى أَنْ أَفْرُكَهُ مِنْ ثَوْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Amr bin Yazid] dia berkata; Telah menceritakan kepada kami [Bahaz] dia berkata; Telah menceritakan kepada kami [Syu'bah] berkata; Telah mengabarkan kepadaku [Al Hakam] dari [Ibrahim] dari [Hammam bin Al Harits] bahwa [Aisyah] berkata; \" Sepengetahuanku, tidak lebih aku hanya menggosok mani dari baju Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 295,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ أَنْبَأَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ هَمَّامٍ عَنْ عَائِشَةَ قَالَتْكُنْتُ أَفْرُكُهُ مِنْ ثَوْبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Husain bin Huraits] Telah memberitakan kepada kami [Sufyan] dari [Manshur] dari [Ibrahim] dari [Hammam] dari [Aisyah] dia berkata; \" Aku pernah menggosoknya (mani) dari baju Rasulullah shallallahu 'alaihi wasallam.\" "
            },
            {
                "number": 296,
                "arab": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ هَمَّامٍ عَنْ عَائِشَةَ قَالَتْكُنْتُ أَرَاهُ فِي ثَوْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَحُكُّهُ",
                "id": "Telah mengabarkan kepada kami [Syu'aib bin Yusuf] dari [Yahya bin Sa'id] dari [Al A'masy] dari [Ibrahim] dari [Hammam] dari [Aisyah] dia berkata; \" Aku melihat mani pada baju Rasulullah shallallahu 'alaihi wasallam, lalu aku menggosoknya.\""
            },
            {
                "number": 297,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ أَبِي مَعْشَرٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْلَقَدْ رَأَيْتُنِي أَفْرُكُ الْجَنَابَةَ مِنْ ثَوْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; Telah menceritakan kepada kami [Hammad bin Zaid] dari [Hisyam bin Hasan] dari [Abu Ma'syar] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] dia berkata; \" Seingatku aku pernah menggosok mani dari baju Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 298,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ كَامِلٍ الْمَرْوَزِيُّ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْلَقَدْ رَأَيْتُنِي أَجِدُهُ فِي ثَوْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَحُتُّهُ عَنْهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Kamil Al Marwazi] Telah menceritakan kepada kami [Husyaim] dari [Mughirah] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] dia berkata; \" Seingatku aku dapati mani pada baju Rasulullah shallallahu 'alaihi wasallam, maka aku menggosoknya.\""
            }
        ]
    }
}