{
    "status": true,
    "data": {
        "start": 4471,
        "end": 4619,
        "total": 149,
        "book": "nasai",
        "hadits": [
            {
                "number": 4471,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ صَفْوَانَ بْنِ يَعْلَى عَنْ أَبِيهِ قَالَغَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ فَاسْتَأْجَرْتُ أَجِيرًا فَقَاتَلَ أَجِيرِي رَجُلًا فَعَضَّ الْآخَرُ فَسَقَطَتْ ثَنِيَّتُهُ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَأَهْدَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] telah memberitakan kepada kami [Sufyan] dari [Ibnu Juraij] dari ['Atho`] dari [Shafwan bin Ya'la] dari [ayahya], dia berkata; \"Saya berperang bersama Rasulullah shallallahu 'alaihi wasallam dalam perang Tabuk kemudian saya menyewa orang upahan kemudian orang upahanku tersebut berkelahi dengan seorang laki-laki, kemudian orang lain tersebut menggigit hingga gigi serinya lepas, kemudian dia mendatangi Nabi shallallahu 'alaihi wasallam dan menceritakan hal tersebut kepada beliau. Kemudian Nabi shallallahu 'alaihi wasallam membatalkannya dan tidak memberinya diyat. "
            },
            {
                "number": 4472,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عَطَاءٌ عَنْ صَفْوَانَ بْنِ يَعْلَى عَنْ يَعْلَى بْنِ أُمَيَّةَ قَالَغَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَيْشَ الْعُسْرَةِ وَكَانَ أَوْثَقَ عَمَلٍ لِي فِي نَفْسِي وَكَانَ لِي أَجِيرٌ فَقَاتَلَ إِنْسَانًا فَعَضَّ أَحَدُهُمَا إِصْبَعَ صَاحِبِهِ فَانْتَزَعَ إِصْبَعَهُ فَأَنْدَرَ ثَنِيَّتَهُ فَسَقَطَتْ فَانْطَلَقَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَهْدَرَ ثَنِيَّتَهُ وَقَالَ أَفَيَدَعُ يَدَهُ فِي فِيكَ تَقْضَمُهَا أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ فِي حَدِيثِ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ عَطَاءٍ عَنْ ابْنِ يَعْلَى عَنْ أَبِيهِ بِمِثْلِ الَّذِي عَضَّ فَنَدَرَتْ ثَنِيَّتُهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا دِيَةَ لَكَ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Ibnu 'Ulayyah] telah memberitakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku ['Atho`] dari [Shafwan bin Ya'la] dari [Ya'la bin Umayyah], dia berkata; \"Saya perang bersama Rasulullah shallallahu 'alaihi wasallam pada saat terdapat pasukan 'usrah. Itu adalah amalanku yang paling kuat (menghujam) dalam diriku, saya memiliki orang upahan, kemudian dia berkelahi dengan seseorang kemudian salah seorang dari mereka menggigit jari sahabatnya, kemudian dia menarik jarinya hingga melepaskan gigi serinya dan terjatuh. Kemudian dia pergi kepada Nabi shallallahu 'alaihi wasallam. Lalu beliau membatalkannya dan tidak memberikan diyatnya, beliau bersabda: \"Apakah dia akan membiarkan tangannya kau gigit dalam mulutmu?\" Telah mengabarkan kepada kami [Suwaid bin Nashr] dalam hadits [Abdullah bin Al Mubarak] dari [Syu'bah] dari [Qatadah] dari ['Atho`] dari [Ibnu Ya'la] dari [ayahnya] seperti (hadits tentang) orang yang menggigit kemudian gigi serinya tercabut, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada diyat bagimu.\""
            },
            {
                "number": 4473,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ عَنْ عَطَاءٍ عَنْ صَفْوَانَ بْنِ يَعْلَى ابْنِ مُنْيَةَأَنَّ أَجِيرًا لِيَعْلَى ابْنِ مُنْيَةَ عَضَّ آخَرُ ذِرَاعَهُ فَانْتَزَعَهَا مِنْ فِيهِ فَرَفَعَ ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ سَقَطَتْ ثَنِيَّتُهُ فَأَبْطَلَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ أَيَدَعُهَا فِي فِيكَ تَقْضَمُهَا كَقَضْمِ الْفَحْلِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] telah memberitakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [ayahku] dari [Qatadah] dari [Budail bin Maisarah] dari ['Atho`] dari [Shafwan bin Ya'la bin Munyah] bahwa seorang pekerja upahan milik Ya'la bin Munyah telah digigit hastanya oleh seseorang, kemudian dia menariknya dari mulut. Kemudian orang tersebut melaporkan perkara tersebut kepada Nabi shallallahu 'alaihi wasallam. Sedang gigi serinya telah tanggal. Kemudian Rasulullah shallallahu 'alaihi wasallam membatalkannya dan tidak memberi diyat. Beliau bersabda: 'Apakah ia akan membiarkan tangannya engkau gigit dalam mulutmu seperti pejantan yang sedang menggigit?\""
            },
            {
                "number": 4474,
                "arab": "أَخْبَرَنِي أَبُو بَكْرِ بْنُ إِسْحَقَ قَالَ حَدَّثَنَا أَبُو الْجَوَّابِ قَالَ حَدَّثَنَا عَمَّارٌ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ الْحَكَمِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ صَفْوَانَ بْنِ يَعْلَىأَنَّ أَبَاهُ غَزَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ فَاسْتَأْجَرَ أَجِيرًا فَقَاتَلَ رَجُلًا فَعَضَّ الرَّجُلُ ذِرَاعَهُ فَلَمَّا أَوْجَعَهُ نَتَرَهَا فَأَنْدَرَ ثَنِيَّتَهُ فَرُفِعَ ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَعْمِدُ أَحَدُكُمْ فَيَعَضُّ أَخَاهُ كَمَا يَعَضُّ الْفَحْلُ فَأَبْطَلَ ثَنِيَّتَهُ",
                "id": "Telah mengabarkan kepada kami [Abu Bakar bin Ishaq] telah menceritakan kepada kami [Abu Al Jawwab] telah menceritakan kepada kami ['Ammar] dari [Muhammad bin Abdur Rahman bin Abu Laila] dari [Al Hakam] dari [Muhammad bin Muslim] dari [Shafwan bin Ya'la] bahwa ayahnya melakukan perang bersama Rasulullah shallallahu 'alaihi wasallam dalam perang Tabuk, dia menyewa orang upahan, kemudian orang upahan tersebut berkelahi dengan laki-laki lain. Lalu laki-laki tersebut menggigit hastanya, kemudian tatkala dia merasa sakit dia menariknya hingga mencabut gigi seri laki-laki tersebut. Kemudian hal tersebut dilaporkan kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau bersabda: \"Salah seorang diantara kalian pergi dan menggigit saudaranya seperti pejantan sedang menggigit.\" Maka beliau membatalkan gigi seri tersebut (tidak memberi diyat). "
            },
            {
                "number": 4475,
                "arab": "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ عَنْ عَبِيدَةَ بْنِ مُسَافِعٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَبَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْسِمُ شَيْئًا أَقْبَلَ رَجُلٌ فَأَكَبَّ عَلَيْهِ فَطَعَنَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعُرْجُونٍ كَانَ مَعَهُ فَخَرَجَ الرَّجُلُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعَالَ فَاسْتَقِدْ قَالَ بَلْ قَدْ عَفَوْتُ يَا رَسُولَ اللَّهِ",
                "id": "Telah mengabarkan kepada kami [Wahb bin Bayan] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku ['Amru bin Al Harits] dari [Bukair bin Abdullah] dari ['Ubaidah bin Musafi'] dari [Abu Sa'id Al Khudri], dia berkata; \"Ketika Rasulullah shallallahu 'alaihi wasallam membagi sesuatu, datanglah seseorang mendesak-desak beliau, lalu Rasulullah shallallahu 'alaihi wasallam menusuknya dengan dahan pohon kurma yang beliau bawa, lalu orang itu keluar dan Rasulullah shallallahu 'alaihi wasallam bersabda: \" Kemari dan balaslah.\" Dia berkata; \"Aku sudah maafkan wahai Rasulullah.\""
            },
            {
                "number": 4476,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سَعِيدٍ الرِّبَاطِيُّ قَالَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ أَنْبَأَنَا أَبِي قَالَ سَمِعْتُ يَحْيَى يُحَدِّثُ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ عَنْ عَبِيدَةَ بْنِ مُسَافِعٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَبَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْسِمُ شَيْئًا إِذْ أَكَبَّ عَلَيْهِ رَجُلٌ فَطَعَنَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعُرْجُونٍ كَانَ مَعَهُ فَصَاحَ الرَّجُلُ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعَالَ فَاسْتَقِدْ قَالَ بَلْ عَفَوْتُ يَا رَسُولَ اللَّهِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sa'id Ar Ribathi] telah menceritakan kepada kami [Wahb bin Jarir] telah memberitakan kepada kami [ayahku], ia berkata; saya mendengar [Yahya] menceritakan dari [Bukair bin Abdullah] dari ['Ubaidah bin Musafi'] dari [Abu Sa'id Al Khudri], ia berkata; ketika Rasulullah shallallahu 'alaihi wasallam membagi sesuatu, datanglah seseorang dan menyibukkannya, lalu Rasulullah shallallahu 'alaihi wasallam menusuknya dengan dahan pohon kurma yang beliau bawa, lalu orang itu berteriak kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \" Kemari dan balaslah.\" Ia berkata; aku sudah maafkan wahai Rasulullah."
            },
            {
                "number": 4477,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ أَنْبَأَنَا عُبَيْدُ اللَّهِ عَنْ إِسْرَائِيلَ عَنْ عَبْدِ الْأَعْلَى أَنَّهُ سَمِعَ سَعِيدَ بْنَ جُبَيْرٍ يَقُولُ أَخْبَرَنِي ابْنُ عَبَّاسٍأَنَّ رَجُلًا وَقَعَ فِي أَبٍ كَانَ لَهُ فِي الْجَاهِلِيَّةِ فَلَطَمَهُ الْعَبَّاسُ فَجَاءَ قَوْمُهُ فَقَالُوا لَيَلْطِمَنَّهُ كَمَا لَطَمَهُ فَلَبِسُوا السِّلَاحَ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَعِدَ الْمِنْبَرَ فَقَالَ أَيُّهَا النَّاسُ أَيُّ أَهْلِ الْأَرْضِ تَعْلَمُونَ أَكْرَمُ عَلَى اللَّهِ عَزَّ وَجَلَّ فَقَالُوا أَنْتَ فَقَالَ إِنَّ الْعَبَّاسَ مِنِّي وَأَنَا مِنْهُ لَا تَسُبُّوا مَوْتَانَا فَتُؤْذُوا أَحْيَاءَنَا فَجَاءَ الْقَوْمُ فَقَالُوا يَا رَسُولَ اللَّهِ نَعُوذُ بِاللَّهِ مِنْ غَضَبِكَ اسْتَغْفِرْ لَنَا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] telah memberitakan kepada kami ['ubaidhullah] dari [Israil] dari [Abdul A'la] bahwa dia mendengar [Sa'id bin Jubair] berkata; telah mengabarkan kepadaku [Ibnu Abbas] bahwa seseorang mencela ayahnya pada zaman Jahiliyah kemudian Al Abbas menamparnya, lalu kaumnya datang dan berkata; \"Sungguh dia akan menamparnya sebagaimana dia menamparnya.\" Kemudian mereka menghunus senjata, lalu hal tersebut sampai kepada Nabi shallallahu 'alaihi wasallam kemudian beliau naik mimbar dan bersabda: \"Wahai manusia, siapakah penduduk bumi yang engkau ketahui paling mulia di sisi Allah 'azza wajalla?\" mereka mengatakan; \"Tuan.\" Lalu beliau bersabda: 'Sesungguhnya Al Abbas adalah bagian dariku sedang aku bagian darinya, janganlah kalian mencela orang-orang yang telah mati di antara kita, sehingga menyakiti orang yang masih hidup diantara kita.\" Kemudian datanglah kaum tersebut dan berkata; \"Wahai Rasulullah, kami berlindung kepada Allah dari kemurkaan Tuan, mintakanlah ampunan untuk kami.\""
            },
            {
                "number": 4478,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ قَالَ حَدَّثَنِي الْقَعْنَبِيُّ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ هِلَالٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَكُنَّا نَقْعُدُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ فَإِذَا قَامَ قُمْنَا فَقَامَ يَوْمًا وَقُمْنَا مَعَهُ حَتَّى لَمَّا بَلَغَ وَسَطَ الْمَسْجِدِ أَدْرَكَهُ رَجُلٌ فَجَبَذَ بِرِدَائِهِ مِنْ وَرَائِهِ وَكَانَ رِدَاؤُهُ خَشِنًا فَحَمَّرَ رَقَبَتَهُ فَقَالَ يَا مُحَمَّدُ احْمِلْ لِي عَلَى بَعِيرَيَّ هَذَيْنِ فَإِنَّكَ لَا تَحْمِلُ مِنْ مَالِكَ وَلَا مِنْ مَالِ أَبِيكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا وَأَسْتَغْفِرُ اللَّهَ لَا أَحْمِلُ لَكَ حَتَّى تُقِيدَنِي مِمَّا جَبَذْتَ بِرَقَبَتِي فَقَالَ الْأَعْرَابِيُّ لَا وَاللَّهِ لَا أُقِيدُكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَلِكَ ثَلَاثَ مَرَّاتٍ كُلُّ ذَلِكَ يَقُولُ لَا وَاللَّهِ لَا أُقِيدُكَ فَلَمَّا سَمِعْنَا قَوْلَ الْأَعْرَابِيِّ أَقْبَلْنَا إِلَيْهِ سِرَاعًا فَالْتَفَتَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ عَزَمْتُ عَلَى مَنْ سَمِعَ كَلَامِي أَنْ لَا يَبْرَحَ مَقَامَهُ حَتَّى آذَنَ لَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِرَجُلٍ مِنْ الْقَوْمِ يَا فُلَانُ احْمِلْ لَهُ عَلَى بَعِيرٍ شَعِيرًا وَعَلَى بَعِيرٍ تَمْرًا ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْصَرِفُوا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ali bin Maimun] telah menceritakan kepadaku [Al Qa'nabi] telah menceritakan kepadaku [Muhammad bin Hilal] dari [ayahnya] dari [Abu Hurairah], dia berkata; \"Kami duduk bersama Rasulullah shallallahu 'alaihi wasallam di masjid, jika beliau berdiri maka kami berdiri bersamanya, pada suatu hari beliau berdiri dan kami berdiri bersama beliau hingga ketika beliau sampai di tengah masjid, seseorang mengejar beliau dan menarik selendang beliau dari belakang, padahal selendang beliau tebal sehingga menjadikan leher beliau memerah. Dia berkata; \"Wahai Muhammad, bawakan makanan untukku di atas dua untaku ini karena sesungguhnya engkau tidak membawa hartamu dan harta ayahmu.\" Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak, aku akan meminta ampunan Allah, aku tidak akan membawakan untukmu hingga engkau membalasku dengan apa yang engkau tarik pada leherku, \" Lalu seorang badui berkata, \"Tidak, demi Allah, aku tidak akan membalasmu.\" Lalu Rasulullah shallallahu 'alaihi wasallam mengatakan hal itu sebanyak tiga kali, setiap beliau mengatakannya dia menjawab tidak, demi Allah aku tidak akan membalasmu, ketika kami mendengar perkataan orang badui itu kami mendatanginya dengan cepat lalu Rasulullah shallallahu 'alaihi wasallam menoleh kearah kami dan bersabda: \" aku ingin siapa saja yang mendengar perkataanku agar tidak beranjak dari tempatnya hingga aku ijinkan, \" lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepada seseorang dari kami: \"hai fulan bawakanlah gandum untuknya keatas satu unta dan kurma ke atas unta yang lain\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pergilah kalian.\""
            },
            {
                "number": 4479,
                "arab": "أَخْبَرَنَا مُؤَمَّلُ بْنُ هِشَامٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبُو مَسْعُودٍ سَعِيدُ بْنُ إِيَاسٍ الْجُرَيْرِيُّ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي فِرَاسٍ أَنَّ عُمَرَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقِصُّ مِنْ نَفْسِهِ",
                "id": "Telah mengabarkan kepada kami [Muammal bin Hisyam] telah menceritakan kepada kami [Isma'il bin Ibrahim] telah menceritakan kepada kami [Abu Mas'ud Sa'id bin Iyas Al Jurairi] dari [Abu Nadhrah] dari [Abu Firas] bahwa [Umar] berkata; \"Aku melihat Rasulullah shallallahu 'alaihi wasallam meminta qishash untuk diri beliau.\""
            },
            {
                "number": 4480,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ أَبَا جَهْمِ بْنَ حُذَيْفَةَ مُصَدِّقًا فَلَاحَّهُ رَجُلٌ فِي صَدَقَتِهِ فَضَرَبَهُ أَبُو جَهْمٍ فَأَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ الْقَوَدُ يَا رَسُولَ اللَّهِ فَقَالَ لَكُمْ كَذَا وَكَذَا فَلَمْ يَرْضَوْا بِهِ فَقَالَ لَكُمْ كَذَا وَكَذَا فَرَضُوا بِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي خَاطِبٌ عَلَى النَّاسِ وَمُخْبِرُهُمْ بِرِضَاكُمْ قَالُوا نَعَمْ فَخَطَبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ هَؤُلَاءِ أَتَوْنِي يُرِيدُونَ الْقَوَدَ فَعَرَضْتُ عَلَيْهِمْ كَذَا وَكَذَا فَرَضُوا قَالُوا لَا فَهَمَّ الْمُهَاجِرُونَ بِهِمْ فَأَمَرَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَكُفُّوا فَكَفُّوا ثُمَّ دَعَاهُمْ قَالَ أَرَضِيتُمْ قَالُوا نَعَمْ قَالَ فَإِنِّي خَاطِبٌ عَلَى النَّاسِ وَمُخْبِرُهُمْ بِرِضَاكُمْ قَالُوا نَعَمْ فَخَطَبَ النَّاسَ ثُمَّ قَالَ أَرَضِيتُمْ قَالُوا نَعَمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdur Razzaq] dari [Ma'mar] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] bahwa Nabi shallallahu 'alaihi wasallam mengutus Abu Jahm bin Hudzaifah sebagai pengurus shadaqah, kemudian terdapat seorang laki-laki yang terus mendesak dalam meminta shadaqah, sehingga Abu Jahm memukulnya, kemudian orang-orang mendatangi Nabi shallallahu 'alaihi wasallam dan berkata; \"Kami meminta balasan wahai Rasulullah, \" Beliau bersabda: \"Maukah Kalian mendapatkan ini dan itu?\" Namun mereka tidak ridha, lalu beliau bersabda: \"kalian mendapatkan ini dan itu, \" lalu mereka ridha. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku akan berkhutbah kepada manusia dan akan aku kabari mereka dengan keridhaan kalian, \" Mereka menjawab; \"Ya.\" Lalu Nabi shallallahu 'alaihi wasallam berkhutbah dan beliau bersabda: \" Sesungguhnya mereka mendatangiku ingin memintaku balasan, lalu aku tawarkan kepada mereka ini dan itu, lalu mereka ridho, \" Mereka berkata; \"Tidak.\" Maka orang-orang muhajirin hendak melawan mereka, lalu Rasulullah shallallahu 'alaihi wasallam menyuruh mereka untuk menahan hal itu, dan mereka menahannya, lalu beliau memanggil mereka dan bersabda: \" Apakah kalian ridha, \" mereka menjawab iya, beliau bersabda: \" aku akan berkhutbah di hadapan manusia dan mengabarkan mereka akan keridhaan kalian, \" kemudian beliau berkhutbah di hadapan manusia dan bersabda: \"Apakah kalian ridha, \" mereka menjawab; \"Ya.\""
            },
            {
                "number": 4481,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ عَنْ هِشَامِ بْنِ زَيْدٍ عَنْ أَنَسٍأَنَّ يَهُودِيًّا رَأَى عَلَى جَارِيَةٍ أَوْضَاحًا فَقَتَلَهَا بِحَجَرٍ فَأُتِيَ بِهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِهَا رَمَقٌ فَقَالَ أَقَتَلَكِ فُلَانٌ فَأَشَارَ شُعْبَةُ بِرَأْسِهِ يَحْكِيهَا أَنْ لَا فَقَالَ أَقَتَلَكِ فُلَانٌ فَأَشَارَ شُعْبَةُ بِرَأْسِهِ يَحْكِيهَا أَنْ لَا قَالَ أَقْتَلَكِ فُلَانٌ فَأَشَارَ شُعْبَةُ بِرَأْسِهِ يَحْكِيهَا أَنْ نَعَمْ فَدَعَا بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَتَلَهُ بَيْنَ حَجَرَيْنِ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] telah menceritakan kepada kami [Khalid] dari [Syu'bah] dari [Hisyam bin Zaid] dari [Anas] bahwa seorang Yahudi melihat perhiasan yang dipakai oleh seorang wanita, kemudian dia membunuhnya dengan batu. Lalu wanita tersebut dihadapkan kepada Nabi shallallahu 'alaihi wasallam dalam keadaan masih bernyawa. Kemudian beliau bertanya: 'Apakah yang membunuhmu adalah Fulan? Syu'bah memberi isyarat menceritakan mengenai wanita tersebut yang menjawab; tidak. Beliau bersabda: \"Apakah yang membunuhmu adalah Fulan?\" Syu'bah memberi isyarat menceritakan mengenai wanita tersebut yang menjawab; tidak. Beliau bersabda: \"Apakah yang membunuhmu adalah Fulan?\" Syu'bah memberi isyarat menceritakan mengenai wanita tersebut yang menjawab; ya. Kemudian beliau meminta agar orang tersebut dihadapkan kepada beliau, lalu beliau membunuhnya di antara dua batu."
            },
            {
                "number": 4482,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا أَبُو خَالِدٍ عَنْ إِسْمَعِيلَ عَنْ قَيْسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ سَرِيَّةً إِلَى قَوْمٍ مِنْ خَثْعَمَ فَاسْتَعْصَمُوا بِالسُّجُودِ فَقُتِلُوا فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنِصْفِ الْعَقْلِ وَقَالَ إِنِّي بَرِيءٌ مِنْ كُلِّ مُسْلِمٍ مَعَ مُشْرِكٍ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا لَا تَرَاءَى نَارَاهُمَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Abu Khalid] dari [Isma'il] dari [Qois] bahwa Rasulullah shallallahu 'alaihi wasallam mengirim pasukan kepada suatu kaum dari Khats'am lalu mereka berlindung dengan melakukan sujud, lalu mereka dibunuh, kemudian Rasulullah shallallahu 'alaihi wasallam menetapkan dengan setengah diyat dan bersabda: \"Sesungguhnya aku berlepas diri dari setiap muslim bersama seorang musyrik, \" kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \" Ketahuilah api keduanya tidak akan saling melihat.\""
            },
            {
                "number": 4483,
                "arab": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ سُفْيَانَ عَنْ عَمْرٍو عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ فِي بَنِي إِسْرَائِيلَ الْقِصَاصُ وَلَمْ تَكُنْ فِيهِمْ الدِّيَةُ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ كُتِبَ عَلَيْكُمْ الْقِصَاصُ فِي الْقَتْلَى الْحُرُّ بِالْحُرِّ وَالْعَبْدُ بِالْعَبْدِ وَالْأُنْثَى بِالْأُنْثَى إِلَى قَوْلِهِ فَمَنْ عُفِيَ لَهُ مِنْ أَخِيهِ شَيْءٌ فَاتِّبَاعٌ بِالْمَعْرُوفِ وَأَدَاءٌ إِلَيْهِ بِإِحْسَانٍ }فَالْعَفْوُ أَنْ يَقْبَلَ الدِّيَةَ فِي الْعَمْدِ وَاتِّبَاعٌ بِمَعْرُوفٍ يَقُولُ يَتَّبِعُ هَذَا بِالْمَعْرُوفِ وَأَدَاءٌ إِلَيْهِ بِإِحْسَانٍ وَيُؤَدِّي هَذَا بِإِحْسَانٍ ذَلِكَ تَخْفِيفٌ مِنْ رَبِّكُمْ وَرَحْمَةٌ مِمَّا كُتِبَ عَلَى مَنْ كَانَ قَبْلَكُمْ إِنَّمَا هُوَ الْقِصَاصُ لَيْسَ الدِّيَةَ",
                "id": "[Al Harits bin Miskin] berkata dengan membacakan riwayat dan saya mendengar dari [Sufyan] dari ['Amru] dari [Mujahid] dari [Ibnu Abbas], dia berkata; dahulu pada Bani Israil terdapat hukum qishas namun tidak ada diyat pada mereka, lalu Allah Azza wa jalla menurunkan ayat: (Hai orang-orang yang beriman, diwajibkan atas kamu qishash berkenaan dengan orang-orang yang dibunuh; orang merdeka dengan orang merdeka, hamba dengan hamba, dan wanita dengan wanita. Maka barangsiapa yang mendapat suatu pema'afan dari saudaranya, hendaklah (yang mema'afkan) mengikuti dengan cara yang baik, dan hendaklah (yang diberi ma'af) membayar (diat) kepada yang memberi ma'af dengan cara yang baik (pula)). Pemberian maaf itu adalah menerima diyat pada pembunuhan dengan sengaja, dan hendaklah (yang mema'afkan) mengikuti dengan cara yang baik, dan hendaklah (yang diberi ma'af) membayar (diat) kepada yang memberi ma'af dengan cara yang baik (pula)), serta melaksanakan ini dengan kebaikan. Yang demikian itu adalah suatu keringanan dari Tuhan kamu dan suatu rahmat dari apa yang diwajibkan atas kaum sebelum kalian, sesungguhnya hal tersebut adalah qishas bukan diyat."
            },
            {
                "number": 4484,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَلِيُّ بْنُ حَفْصٍ قَالَ حَدَّثَنَا وَرْقَاءُ عَنْ عَمْرٍو عَنْ مُجَاهِدٍ قَالَ{ كُتِبَ عَلَيْكُمْ الْقِصَاصُ فِي الْقَتْلَى الْحُرُّ بِالْحُرِّ }قَالَ كَانَ بَنُو إِسْرَائِيلَ عَلَيْهِمْ الْقِصَاصُ وَلَيْسَ عَلَيْهِمْ الدِّيَةُ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ عَلَيْهِمْ الدِّيَةَ فَجَعَلَهَا عَلَى هَذِهِ الْأُمَّةِ تَخْفِيفًا عَلَى مَا كَانَ عَلَى بَنِي إِسْرَائِيلَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isma'il bin Ibrahim] telah menceritakan kepada kami [Ali bin Hafsh] telah menceritakan kepada kami [Warqa`] dari ['Amru] dari [Mujahid], dia berkata; \"Diwajibkan atas kamu qishaash berkenaan dengan orang-orang yang dibunuh; orang merdeka dengan orang merdeka. Mujahid berkata; \"Dahulu Bani Israil memiliki kewajiban qishas namun mereka tidak memiliki kewjiban membayar diyat, lalu Allah Azza wa jalla menurunkan ayat tentang diyat kepada mereka dan menjadikannya sebagai keringanan bagi umat atas apa yang dahulu terjadi pada Bani Israil.\""
            },
            {
                "number": 4485,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ وَهُوَ ابْنُ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيُّ عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ عَنْ أَنَسٍ قَالَأُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قِصَاصٍ فَأَمَرَ فِيهِ بِالْعَفْوِ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami [Abdur Rahman] telah menceritakan kepada kami [Abdullah yaitu Ibnu Bakr bin Abdullah Al Muzani] dari ['Atho` bin Abu Maimunah] dari [Anas], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam dihadapkan pada perkara mengenai qishash kemudian beliau memerintahkan agar memberikan maaf.\" "
            },
            {
                "number": 4486,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ وَبَهْزُ بْنُ أَسَدٍ وَعَفَّانُ بْنُ مُسْلِمٍ قَالُوا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ الْمُزَنِيُّ قَالَ حَدَّثَنَا عَطَاءُ بْنُ أَبِي مَيْمُونَةَ وَلَا أَعْلَمُهُ إِلَّا عَنْ أَنَسِ بْنِ مَالِكٍ قَالَمَا أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شَيْءٍ فِيهِ قِصَاصٌ إِلَّا أَمَرَ فِيهِ بِالْعَفْوِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abdur Rahman bin Mahdi] dan [Bahz bin Asad] serta ['Affan bin Muslim], telah menceritakan kepada kami [Abdullah bin Bakr Al Muzani] telah menceritakan kepada kami ['Atho` bin Abu Maimunah] dan saya tidak mengetahui kecuali dari [Anas bin Malik], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam dihadapkan pada perkara mengenai qishash hanya saja beliau memerintahkan agar memberikan maaf.\""
            },
            {
                "number": 4487,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَشْعَثَ قَالَ حَدَّثَنَا أَبُو مُسْهِرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ وَهُوَ ابْنُ عَبْدِ اللَّهِ بْنِ سَمَاعَةَ قَالَ أَنْبَأَنَا الْأَوْزَاعِيُّ قَالَ أَخْبَرَنِي يَحْيَى قَالَ حَدَّثَنِي أَبُو سَلَمَةَ قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِمَّا أَنْ يُقَادَ وَإِمَّا أَنْ يُفْدَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdur Rahman bin Asy'ats] telah menceritakan kepada kami [Abu Mushir] telah menceritakan kepada kami [Isma'il yaitu Ibnu Abdullah bin Sama'ah] telah menceritakan kepada kami [Al Auza'I] telah menceritakan kepadaku [Yahya] telah menceritakan kepadaku [Abu Salamah] telah menceritakan kepadaku [Abu Hurairah], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang dibunuh sedang dia memiliki keluarga maka dia (bisa) memilih salah satu dari dua pandangan yang terbaik, dibalaskan untuknya atau diberi diyat.\""
            },
            {
                "number": 4488,
                "arab": "أَخْبَرَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ بْنِ مَزْيَدَ قَالَ أَخْبَرَنِي أَبِي قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي أَبُو سَلَمَةَ قَالَ حَدَّثَنَا أَبُو هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِمَّا أَنْ يُقَادَ وَإِمَّا أَنْ يُفْدَى",
                "id": "Telah menceritakan kepada kami [Al Abbas bin Al Walid bin Mazid] telah menceritakan kepadaku [ayahku] telah menceritakan kepada kami [Al Auza'I] telah menceritakan kepadaku [Yahya bin Abu Katsir] telah menceritakan kepadaku [Abu Salamah] telah menceritakan kepada kami [Abu Hurairah], dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang dibunuh sedang dia memiliki keluarga maka dia (bisa) memilih salah satu dari dua pandangan yang terbaik, dibalaskan untuknya atau diberi diyat.\""
            },
            {
                "number": 4489,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ قَالَ أَنْبَأَنَا ابْنُ عَائِذٍ قَالَ حَدَّثَنَا يَحْيَى هُوَ ابْنُ حَمْزَةَ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي أَبُو سَلَمَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قُتِلَ لَهُ قَتِيلٌمُرْسَلٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Ibrahim bin Muhammad] telah menceritakan kepada kami [Ibnu 'Aidz] telah menceritakan kepada kami [Yahya yaitu Ibnu Hamzah] telah menceritakan kepada kami [Al Auza'I] telah menceritakan kepada kami [Yahya bin Abu Katsir] telah menceritakan kepadaku [Abu Salamah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang dibunuh sedang dia memiliki keluarga...\" secara mursal."
            },
            {
                "number": 4490,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنِي حِصْنٌ قَالَ حَدَّثَنِي أَبُو سَلَمَةَ ح وَأَنْبَأَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ حَدَّثَنَا الْوَلِيدُ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي حِصْنٌ أَنَّهُ سَمِعَ أَبَا سَلَمَةَ يُحَدِّثُ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَعَلَى الْمُقْتَتِلِينَ أَنْ يَنْحَجِزُوا الْأَوَّلَ فَالْأَوَّلَ وَإِنْ كَانَتْ امْرَأَةٌ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami [Al Walid] dari [Al Auza'I] telah menceritakan kepadaku [Hishn] telah menceritakan kepadaku [Abu Salamah]. Dalam jalur lain disebutkan: telah menceritakan kepada kami [Al Husain bin Huraits] telah menceritakan kepada kami [Al Walid] telah menceritakan kepadaku [Al Auza'I] telah menceritakan kepadaku [Hishn] bahwa dia mendengar [Abu Salamah] menceritakan dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \" Kepada keluarga pembunuh dan yang terbunuh hendaknya saling memaafkan masing-masing kerabatnya meskipun dia seorang wanita.\""
            },
            {
                "number": 4491,
                "arab": "أَخْبَرَنَا هِلَالُ بْنُ الْعَلَاءِ بْنِ هِلَالٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ قَالَ أَنْبَأَنَا سُلَيْمَانُ بْنُ كَثِيرٍ قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قُتِلَ فِي عِمِّيَّا أَوْ رِمِّيَّا تَكُونُ بَيْنَهُمْ بِحَجَرٍ أَوْ سَوْطٍ أَوْ بِعَصًا فَعَقْلُهُ عَقْلُ خَطَإٍ وَمَنْ قَتَلَ عَمْدًا فَقَوَدُ يَدِهِ فَمَنْ حَالَ بَيْنَهُ وَبَيْنَهُ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ لَا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عَدْلٌ",
                "id": "Telah menceritakan kepada kami [Hilal bin Al 'Ala` bin Hilal] telah menceritakan kepada kami [Sa'id bin Sulaiman] telah menceritakan kepada kami [Sulaiman bin Katsir] telah menceritakan kepada kami ['Amru bin Dinar] dari [Thawus] dari [Ibnu Abbas], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang terbunuh karena sesuatu yang tidak jelas atau menjadi sasaran lemparan batu, cambuk atau tongkat, maka diyatnya adalah diyat pembunuhan secara tidak sengaja, dan barangsiapa yang membunuh secara sengaja maka ia dibalas, barangsiapa yang menghalanginya maka dia akan mendapatkan laknat Allah, malaikat dan seluruh manusia. Tidak diterima darinya taubat ataupun fidyah.\""
            },
            {
                "number": 4492,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ كَثِيرٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍيَرْفَعُهُ قَالَ مَنْ قُتِلَ فِي عِمِّيَّةٍ أَوْ رِمِّيَّةٍ بِحَجَرٍ أَوْ سَوْطٍ أَوْ عَصًا فَعَقْلُهُ عَقْلُ الْخَطَإِ وَمَنْ قُتِلَ عَمْدًا فَهُوَ قَوَدٌ وَمَنْ حَالَ بَيْنَهُ وَبَيْنَهُ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ لَا يَقْبَلُ اللَّهُ مِنْهُ صَرْفًا وَلَا عَدْلًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ma'mar] telah menceritakan kepada kami [Muhammad bin Katsir] telah menceritakan kepada kami [Sulaiman bin Katsir] dari ['Amru bin Dinar] dari [Thawus] dari [Ibnu Abbas] dan dia memarfu'kannya, dia berkata; \"Barangsiapa yang terbunuh karena sesuatu yang tidak jelas atau menjadi sasaran lemparan batu, cambuk atau tongkat maka diyatnya adalah diyat pembunuhan secara tidak sengaja, dan barangsiapa yang membunuh secara sengaja maka ia dibalas, barangsiapa yang menghalanginya maka ia akan mendapatkan laknat Allah, malaikat dan seluruh manusia, Allah tidak menerima darinya taubat ataupun fidyah.\""
            },
            {
                "number": 4493,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَيُّوبَ السَّخْتِيَانِيِّ عَنْ الْقَاسِمِ بْنِ رَبِيعَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَتِيلُ الْخَطَإِ شِبْهِ الْعَمْدِ بِالسَّوْطِ أَوْ الْعَصَا مِائَةٌ مِنْ الْإِبِلِ أَرْبَعُونَ مِنْهَا فِي بُطُونِهَا أَوْلَادُهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abdur Rahman] telah menceritakan kepada kami [Syu'bah] dari [Ayyub As Sakhtiyani] dari [Al Qasim bin Rabi'ah] dari [Abdullah bin 'Amru] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda; \"Orang yang terbunuh karena tidak sengaja adalah mirip dengan orang yang terbunuh karena disiksa dengan cambuk, atau tongkat diyatnya adalah seratus unta, empat puluh di antaranya sedang bunting.\" "
            },
            {
                "number": 4494,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يُونُسُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ الْقَاسِمِ بْنِ رَبِيعَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ يَوْمَ الْفَتْحِمُرْسَلٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il bin Ibrahim] telah menceritakan kepada kami [Yunus] telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Al Qasim bin Rabi'ah] bahwa Rasulullah shallallahu 'alaihi wasallam berkhutbah pada saat penaklukan Mekkah. Hadits mursal."
            },
            {
                "number": 4495,
                "arab": "أَخْبَرَنِي يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ قَالَ أَنْبَأَنَا حَمَّادٌ عَنْ خَالِدٍ يَعْنِي الْحَذَّاءَ عَنْ الْقَاسِمِ بْنِ رَبِيعَةَ عَنْ عُقْبَةَ بْنِ أَوْسٍ عَنْ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَا وَإِنَّ قَتِيلَ الْخَطَإِ شِبْهِ الْعَمْدِ مَا كَانَ بِالسَّوْطِ وَالْعَصَا مِائَةٌ مِنْ الْإِبِلِ أَرْبَعُونَ فِي بُطُونِهَا أَوْلَادُهَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Habib bin 'Arabi] telah menceritakan kepada kami [Hammad] dari [Khalid yaitu Al Hadzdza`] dari [Al Qasim bin Rabi'ah] dari ['Uqbah bin Aus] dari [Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketahuilah sesungguhnya orang yang terbunuh karena tidak sengaja adalah mirip dengan orang yang terbunuh karena disiksa dengan cambuk, dan tongkat. Diyatnya adalah seratus ekor unta, empat puluh di antaranya sedang bunting.\""
            },
            {
                "number": 4496,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَامِلٍ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ خَالِدٍ عَنْ الْقَاسِمِ بْنِ رَبِيعَةَ عَنْ عُقْبَةَ بْنِ أَوْسٍ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَخَطَبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فَتْحِ مَكَّةَ فَقَالَ أَلَا وَإِنَّ قَتِيلَ الْخَطَإِ شِبْهِ الْعَمْدِ بِالسَّوْطِ وَالْعَصَا وَالْحَجَرِ مِائَةٌ مِنْ الْإِبِلِ فِيهَا أَرْبَعُونَ ثَنِيَّةً إِلَى بَازِلِ عَامِهَا كُلُّهُنَّ خَلِفَةٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Kamil] telah menceritakan kepada kami [Husyaim] dari [Khalid] dari [Al Qasim bin Rabi'ah] dari ['Uqbah bin Aus] dari [seorang sahabat] Nabi shallallahu 'alaihi wasallam, dia berkata; Nabi shallallahu 'alaihi wasallam berkhutbah pada saat penaklukan Mekkah, kemudian beliau bersabda: \"Ingatlah, bahwa orang yang terbunuh karena tidak sengaja adalah mirip orang yang terbunuh karena disiksa dengan cambuk, tongkat, dan batu. Diyatnya adalah seratus ekor unta, padanya terdapat empat puluh ekor unta yang berumur enam hingga delapan tahun yang seluruhnya bunting.\" "
            },
            {
                "number": 4497,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ عَنْ ابْنِ أَبِي عَدِيٍّ عَنْ خَالِدٍ عَنْ الْقَاسِمِ عَنْ عُقْبَةَ بْنِ أَوْسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَا إِنَّ قَتِيلَ الْخَطَإِ قَتِيلَ السَّوْطِ وَالْعَصَا فِيهِ مِائَةٌ مِنْ الْإِبِلِ مُغَلَّظَةٌ أَرْبَعُونَ مِنْهَا فِي بُطُونِهَا أَوْلَادُهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] dari [Ibnu Abu 'Adi] dari [Khalid] dari [Al Qasim] dari ['Uqbah bin Aus] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketahuilah bahwa orang yang terbunuh karena ketidak sengajaan adalah mirip dengan orang yang terbunuh karena disiksa dengan cambuk dan tongkat, padanya terdapat diyat seratus ekor unta yang ditekankan, empat puluh di antaranya sedang bunting.\""
            },
            {
                "number": 4498,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ الْقَاسِمِ بْنِ رَبِيعَةَ عَنْ يَعْقُوبَ بْنِ أَوْسٍ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا دَخَلَ مَكَّةَ يَوْمَ الْفَتْحِ قَالَ أَلَا وَإِنَّ كُلَّ قَتِيلِ خَطَإِ الْعَمْدِ أَوْ شِبْهِ الْعَمْدِ قَتِيلِ السَّوْطِ وَالْعَصَا مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلَادُهَا",
                "id": "Telah menceritakan kepada kami [Isma'il bin Mas'ud] telah menceritakan kepada kami [Bisyr bin Al Mufadhdhal] dari [Khalid Al Hadzdza`] dari [Al Qasim bin Rabi'ah] dari [Ya'qub bin Aus] dari [seorang laki-laki] dari sahabat Nabi shallallahu 'alaihi wasallam bahwa Rasulullah shallallahu 'alaihi wasallam tatkala memasuki Mekkah pada saat penaklukan Mekkah bersabda: \"Ingatlah, Sesungguhnya orang yang terbunuh karena ketidak sengajaan atau yang mirip dengan terbunuh karena disiksa dengan cambuk dan tongkat, sebagian diyatnya adalah empat puluh ekor unta yang lagi bunting.\""
            },
            {
                "number": 4499,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ قَالَ حَدَّثَنَا يَزِيدُ قَالَ حَدَّثَنَا خَالِدٌ عَنْ الْقَاسِمِ بْنِ رَبِيعَةَ عَنْ يَعْقُوبَ بْنِ أَوْسٍ أَنَّ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا قَدِمَ مَكَّةَ عَامَ الْفَتْحِ قَالَ أَلَا وَإِنَّ قَتِيلَ الْخَطَإِ الْعَمْدِ قَتِيلَ السَّوْطِ وَالْعَصَا مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلَادُهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Bazi'] telah menceritakan kepada kami [Yazid] telah menceritakan kepada kami [Khalid] dari [Al Qasim bin Rabi'ah] dari [Ya'qub bin Aus] bahwa [seorang laki-laki] dari sahabat Nabi shallallahu 'alaihi wasallam telah menceritakan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam ketika tiba di Mekkah pada saat penaklukan Mekkah, beliau bersabda: \"Ketahuilah, sesungguhnya orang yang terbunuh karena ketidak sengajaan adalah (seperti) orang yang terbunuh karena disiksa dengan cambuk dan tongkatSebagian diyatnya empat puluh ekor unta yang lagi bunting.\""
            },
            {
                "number": 4500,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ قَالَ أَنْبَأَنَا يَزِيدُ عَنْ خَالِدٍ عَنْ الْقَاسِمِ بْنِ رَبِيعَةَ عَنْ يَعْقُوبَ بْنِ أَوْسٍ أَنَّ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ عَامَ الْفَتْحِ قَالَ أَلَا وَإِنَّ قَتِيلَ الْخَطَإِ الْعَمْدِ قَتِيلَ السَّوْطِ وَالْعَصَا مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلَادُهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Bazi'] telah menceritakan kepada kami [Yazid] dari [Khalid] dari [Al Qasim bin Rabi'ah] dari [Ya'qub bin Aus] bahwa [salah seorang sahabat] Nabi shallallahu 'alaihi wasallam bercerita kepadanya bahwa Nabi shallallahu 'alaihi wasallam datang ke Mekkah pada saat penaklukan Mekkah, beliau bersabda: \"Ketahuilah, sesungguhnya orang yang terbunuh karena ketidak sengajaan adalah (seperti) orang yang terbunuh (karena disiksa) dengan cambuk dan tongkat. Sebagian dari (diyat) nya adalah empat puluh ekor unta yang lagi bunting.\""
            },
            {
                "number": 4501,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا ابْنُ جُدْعَانَ سَمِعَهُ مِنْ الْقَاسِمِ بْنِ رَبِيعَةَ عَنْ ابْنِ عُمَرَ قَالَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فَتْحِ مَكَّةَ عَلَى دَرَجَةِ الْكَعْبَةِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَقَالَ الْحَمْدُ لِلَّهِ الَّذِي صَدَقَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ أَلَا إِنَّ قَتِيلَ الْعَمْدِ الْخَطَإِ بِالسَّوْطِ وَالْعَصَا شِبْهِ الْعَمْدِ فِيهِ مِائَةٌ مِنْ الْإِبِلِ مُغَلَّظَةٌ مِنْهَا أَرْبَعُونَ خَلِفَةً فِي بُطُونِهَا أَوْلَادُهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Ibnu Jud'an], dia mendengarnya dari [Al Qasim bin Rabi'ah] dari [Ibnu Umar], dia berkata; \"Pada hari penaklukan Mekkah, Rasulullah shallallahu 'alaihi wasallam berdiri di depan Ka'bah, lalu beliau bertahmid kepada Allah dan memujiNya, beliau bersabda: \"Segala puji bagi Allah yang telah memenuhi janjiNya, menolong hambaNya menghancurkan pasukan sekutu sendirian, ketahuilah, bahwa orang yang terbunuh karena tidak sengaja dengan cambuk dan tongkat adalah menyerupai orang yang terbunuh karena disiksa. Padanya terdapat diyat seratus ekor unta yang ditekankan, empat puluh ekor unta diantaranya sedang bunting.\""
            },
            {
                "number": 4502,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا سَهْلُ بْنُ يُوسُفَ قَالَ حَدَّثَنَا حُمَيْدٌ عَنْ الْقَاسِمِ بْنِ رَبِيعَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْخَطَأُ شِبْهُ الْعَمْدِ يَعْنِي بِالْعَصَا وَالسَّوْطِ مِائَةٌ مِنْ الْإِبِلِ مِنْهَا أَرْبَعُونَ فِي بُطُونِهَا أَوْلَادُهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Sahl bin Yusuf] telah menceritakan kepada kami [Humaid] dari [Al Qasim bin Rabi'ah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"(Terbunuh) karena ketidak sengajaan yang menyerupai terbunuh karena disiksa dengan tongkat dan cambuk, diyatnya adalah seratus ekor unta, di antaranya terdapat empat puluh ekor yang sedang bunting.\""
            },
            {
                "number": 4503,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ رَاشِدٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قُتِلَ خَطَأً فَدِيَتُهُ مِائَةٌ مِنْ الْإِبِلِ ثَلَاثُونَ بِنْتَ مَخَاضٍ وَثَلَاثُونَ بِنْتَ لَبُونٍ وَثَلَاثُونَ حِقَّةً وَعَشَرَةُ بَنِي لَبُونٍ ذُكُورٍ قَالَ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَوِّمُهَا عَلَى أَهْلِ الْقُرَى أَرْبَعَ مِائَةِ دِينَارٍ أَوْ عِدْلَهَا مِنْ الْوَرِقِ وَيُقَوِّمُهَا عَلَى أَهْلِ الْإِبِلِ إِذَا غَلَتْ رَفَعَ فِي قِيمَتِهَا وَإِذَا هَانَتْ نَقَصَ مِنْ قِيمَتِهَا عَلَى نَحْوِ الزَّمَانِ مَا كَانَ فَبَلَغَ قِيمَتُهَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَيْنَ الْأَرْبَعِ مِائَةِ دِينَارٍ إِلَى ثَمَانِ مِائَةِ دِينَارٍ أَوْ عِدْلِهَا مِنْ الْوَرِقِ قَالَ وَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ مَنْ كَانَ عَقْلُهُ فِي الْبَقَرِ عَلَى أَهْلِ الْبَقَرِ مِائَتَيْ بَقَرَةٍ وَمَنْ كَانَ عَقْلُهُ فِي الشَّاةِ أَلْفَيْ شَاةٍ وَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الْعَقْلَ مِيرَاثٌ بَيْنَ وَرَثَةِ الْقَتِيلِ عَلَى فَرَائِضِهِمْ فَمَا فَضَلَ فَلِلْعَصَبَةِ وَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَعْقِلَ عَلَى الْمَرْأَةِ عَصَبَتُهَا مَنْ كَانُوا وَلَا يَرِثُونَ مِنْهُ شَيْئًا إِلَّا مَا فَضَلَ عَنْ وَرَثَتِهَا وَإِنْ قُتِلَتْ فَعَقْلُهَا بَيْنَ وَرَثَتِهَا وَهُمْ يَقْتُلُونَ قَاتِلَهَا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Muhammad bin Rasyid] dari [Sulaiman bin Musa] dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang terbunuh karena kesalahan maka diyatnya adalah seratus ekor unta, tiga puluh unta yang berumur dua tahun, tiga puluh unta betina yang berusia tiga tahun, tiga puluh unta yang berusia empat tahun, dan sepuluh unta jantan yang berumur tiga tahun.\" Dia berkata; \"Rasulullah shallallahu 'alaihi wasallam menaksir harganya untuk penduduk kota, empat ratus dinar atau yang setara dengannya dari uang perak. Sedang untuk para pemilik unta apabila harganya naik maka beliau menaikkan harganya dan apabila turun maka beliau menurunkan harganya sesuai dengan zamannya yang berlaku (pasarannya). Pada zaman Rasulullah shallallahu 'alaihi wasallam, nilai diyatnya mencapai antara empat ratus dinar hingga delapan ratus dinar atau yang setara dengannya dari uang perak.\" Dia berkata lagi; \"Rasulullah shallallahu 'alaihi wasallam menetapkan bahwa orang yang diyatnya dengan sapi, maka atas pemilik sapi diyatnya adalah dua ratus ekor sapi. Dan barang siapa yang diyatnya dengan kambing maka diyatnya adalah seribu kambing. Dan Rasulullah shallallahu 'alaihi wasallam telah memutuskan bahwa diyat adalah warisan antar ahli waris orang yang terbunuh sesuai dengan faraidhnya. Sedangkan kelebihannya adalah untuk 'ashabah (kerabat dari pihak ayah).\"Rasulullah shallallahu 'alaihi wasallam menetapkan atas seorang wanita, hendaknya salah seorang dari 'ashabahnya membayarkan diyatnya dan mereka tidak mewarisi darinya sesuatupun kecuali yang tersisa dari para pewaris wanita tersebut. Dan apabila wanita tersebut dibunuh maka diyatnya dibagi diantara para pewarisnya, dan mereka boleh membunuh orang yang membunuh wanita tersebut.\""
            },
            {
                "number": 4504,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ حَجَّاجٍ عَنْ زَيْدِ بْنِ جُبَيْرٍ عَنْ خِشْفِ بْنِ مَالِكٍ قَالَ سَمِعْتُ ابْنَ مَسْعُودٍ يَقُولُقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِيَةَ الْخَطَإِ عِشْرِينَ بِنْتَ مَخَاضٍ وَعِشْرِينَ ابْنَ مَخَاضٍ ذُكُورًا وَعِشْرِينَ بِنْتَ لَبُونٍ وَعِشْرِينَ جَذَعَةً وَعِشْرِينَ حِقَّةً",
                "id": "Telah mengabarkan kepada kami [Ali bin Sa'id bin Masruq] telah menceritakan kepada kami [Yahya bin Zakariya bin Abu Zaidah] dari [Hajjaj] dari [Zaid bin Jubair] dari [Khisyf bin Malik], dia berkata; \"Saya mendengar [Ibnu Mas'ud] berkata; \"Rasulullah shallallahu 'alaihi wasallam memutuskan diyat membunuh karena tidak sengaja dua puluh unta betina yang berumur dua tahun dan dua puluh unta jantan yang berumur dua tahun, dua puluh unta betina yang berumur tiga tahun dan dua puluh unta betina yang berumur lima tahun dan dua puluh unta betina yang berumur empat tahun.\""
            },
            {
                "number": 4505,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ مُعَاذِ بْنِ هَانِئٍ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ ح و أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا مُعَاذُ بْنُ هَانِئٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَتَلَ رَجُلٌ رَجُلًا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِيَتَهُ اثْنَيْ عَشَرَ أَلْفًا وَذَكَرَ قَوْلَهُ{ إِلَّا أَنْ أَغْنَاهُمْ اللَّهُ وَرَسُولُهُ مِنْ فَضْلِهِ }فِي أَخْذِهِمْ الدِّيَةَوَاللَّفْظُ لِأَبِي دَاوُدَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dari [Mu'adz bin Hani`] telah menceritakan kepadaku [Muhammad bin Muslim] telah menceritakan kepada kami ['Amru bin Dinar]. Dalam jalur lain disebutkan: Telah mengabarkan kepada kami [Abu Daud] telah menceritakan kepada kami [Mu'adz bin Hani`] telah menceritakan kepada kami [Muhammad bin Muslim] dari ['Amru bin Dinar] dari [Ikrimah] dari [Ibnu Abbas], dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam ada seseorang yang membunuh seorang laki-laki. Lalu Nabi shallallahu 'alaihi wasallam menjadikan diyatnya dua belas ribu, seraya menyebut firmanNya: (kecuali jika Allah dan rasulNya mencukupkan dari keutamaanNya) pada pengambilan diyat mereka.\" lafadz ini milik Abu Dawud."
            },
            {
                "number": 4506,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَيْمُونٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ عِكْرِمَةَ سَمِعْنَاهُ مَرَّةً يَقُولُ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِاثْنَيْ عَشَرَ أَلْفًا يَعْنِي فِي الدِّيَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Maimun] telah menceritakan kepada kami [Sufyan] dari ['Amru] dari [Ikrimah], suatu kali kami mendengarnya berkata; dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam telah memutuskan dengan dua belas ribu dalam masalah diyat.\""
            },
            {
                "number": 4507,
                "arab": "أَخْبَرَنَا عِيسَى بْنُ يُونُسَ قَالَ حَدَّثَنَا ضَمْرَةُ عَنْ إِسْمَعِيلَ بْنِ عَيَّاشٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَقْلُ الْمَرْأَةِ مِثْلُ عَقْلِ الرَّجُلِ حَتَّى يَبْلُغَ الثُّلُثَ مِنْ دِيَتِهَا",
                "id": "Telah mengabarkan kepada kami [Isa bin Yunus] telah menceritakan kepada kami [Dhamrah] dari [Isma'il bin 'Ayyasy] dari [Ibnu Juraij] dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Diyat seorang wanita seperti diyat seorang laki-laki hingga mencapai sepertiga dari diyatnya.\""
            },
            {
                "number": 4508,
                "arab": "أَخْبَرَنَا عُمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ مُحَمَّدِ بْنِ رَاشِدٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى وَذَكَرَ كَلِمَةً مَعْنَاهَا عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَقْلُ أَهْلِ الذِّمَّةِ نِصْفُ عَقْلِ الْمُسْلِمِينَ وَهُمْ الْيَهُودُ وَالنَّصَارَى",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] telah menceritakan kepada kami [Abdur Rahman] dari [Muhammad bin Rasyid] dari [Sulaiman bin Musa] dan dia menyebutkan sebuah kalimat yang maknanya dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Diyat ahli dzimmah adalah setengah diyat orang muslim, mereka (ahlu dzimmah) adalah Yahudi dan Nasrani. "
            },
            {
                "number": 4509,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَقْلُ الْكَافِرِ نِصْفُ عَقْلِ الْمُؤْمِنِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Amru bin As Sarh] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Usamah bin Zaid] dari ['Amru bin Syu'aib] dari [ayahnya] dari [Abdullah bin 'Amru] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Diyat orang kafir adalah setengah diyat orang muslim.\""
            },
            {
                "number": 4510,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ عَنْ يَحْيَى عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمُكَاتَبِ يُقْتَلُ بِدِيَةِ الْحُرِّ عَلَى قَدْرِ مَا أَدَّى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Ali bin Al Mubarak] dari [Yahya] dari [Ikrimah] dari [Ibnu Abbas], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memutuskan bahwa diyat bagi budak mukatab (budak yang mengadakan perjanjian pembebasan dirinya dengan tuannya) apabila dibunuh adalah (seperti) diyat orang yang merdeka sesuai dengan kadar yang telah ia ditunaikan. "
            },
            {
                "number": 4511,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ الطَّائِفِيُّ قَالَ حَدَّثَنَا مُعَاوِيَةُ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي الْمُكَاتَبِ أَنْ يُودَى بِقَدْرِ مَا عَتَقَ مِنْهُ دِيَةَ الْحُرِّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'ubaidhullah bin Yazid] telah menceritakan kepada kami [Utsman bin Abdur Rahman Ath Thaifi] telah menceritakan kepada kami [Mu'awiyah] dari [Yahya bin Abu Katsir] dari [Ikrimah] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam memutuskan diyat bagi budak mukatab adalah (seperti) diyat orang yang merdeka sesuai dengan kadar (harga) kebebasannya. "
            },
            {
                "number": 4512,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَعْلَى عَنْ الْحَجَّاجِ الصَّوَّافِ عَنْ يَحْيَى عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمُكَاتَبِ يُودَى بِقَدْرِ مَا أَدَّى مِنْ مُكَاتَبَتِهِ دِيَةَ الْحُرِّ وَمَا بَقِيَ دِيَةَ الْعَبْدِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il bin Ibrahim] telah menceritakan kepada kami [Ya'la] dari [Al Hajjaj As Shawwaf] dari [Yahya] dari [Ikrimah] dari [Ibnu Abbas], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memutuskan bagi budak mukatab untuk diberi diyat orang yang merdeka sesuai dengan kadar kebebasannya.\""
            },
            {
                "number": 4513,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عِيسَى بْنِ النَّقَّاشِ قَالَ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ هَارُونَ قَالَ أَنْبَأَنَا حَمَّادٌ عَنْ قَتَادَةَ عَنْ خِلَاسٍ عَنْ عَلِيٍّ وَعَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُكَاتَبُ يَعْتِقُ بِقَدْرِ مَا أَدَّى وَيُقَامُ عَلَيْهِ الْحَدُّ بِقَدْرِ مَا عَتَقَ مِنْهُ وَيَرِثُ بِقَدْرِ مَا عَتَقَ مِنْهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isa bin An Naqqasy] telah menceritakan kepada kami [Yazid yaitu Ibnu Harun] telah menceritakan kepada kami [Hammad] dari [Qatadah] dari [Khilas] dari [Ali] dan dari [Ayyub] dari [Ikrimah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Orang mukatab bebas sesuai dengan apa yang telah ia tunaikan dan diterapkan hukuman atasnya sesuai dengan kadar kebebasannya dan mewarisi sesuai dengan kadar kebebasannya.\""
            },
            {
                "number": 4514,
                "arab": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الْأَشْعَثِيُّ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ وَعَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ مُكَاتَبًا قُتِلَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ أَنْ يُودَى مَا أَدَّى دِيَةَ الْحُرِّ وَمَالًا دِيَةَ الْمَمْلُوكِ",
                "id": "Telah menceritakan kepada kami [Al Qasim bin Zakariya bin Dinar] telah menceritakan kepada kami [Sa'id bin 'Amru Al Asy'atsi] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Ikrimah] dan dari [Yahya bin Abu Katsir] dari [Ikrimah] dari [Ibnu Abbas] bahwa terdapat orang mukatab yang terbunuh pada masa Rasulullah shallallahu 'alaihi wasallam lalu beliau memerintahkan agar diberi diyat orang yang merdeka sesuai dengan apa yang telah ia tunaikan dan harta sebagai diyat seorang budak. "
            },
            {
                "number": 4515,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ وَإِبْرَاهِيمُ بْنُ يُونُسَ بْنِ مُحَمَّدٍ قَالَا حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى قَالَ حَدَّثَنَا يُوسُفُ بْنُ صُهَيْبٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِأَنَّ امْرَأَةً حَذَفَتْ امْرَأَةً فَأَسْقَطَتْ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي وَلَدِهَا خَمْسِينَ شَاةً وَنَهَى يَوْمَئِذٍ عَنْ الْخَذْفِأَرْسَلَهُ أَبُو نَعِيمٍ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dan [Ibrahim bin Yunus bin Muhammad], mereka berkata; telah menceritakan kepada kami ['ubaidhullah bin Musa] telah menceritakan kepada kami [Yusuf bin Shuhaib] dari [Abdullah bin Buraidah] dari [ayahnya] bahwa seorang wanita memukul wanita lain hingga mengalami keguguran, lalu Rasulullah shallallahu 'alaihi wasallam menetapkan (diyat) untuk anaknya dengan limapuluh ekor kambing, dan pada hari itu beliau melarang bermain ketapel. Hadits ini dimursalkan oleh Abu Na'im."
            },
            {
                "number": 4516,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ يَحْيَى قَالَ حَدَّثَنَا أَبُو نَعِيمٍ قَالَ حَدَّثَنَا يُوسُفُ بْنُ صُهَيْبٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَأَنَّ امْرَأَةً خَذَفَتْ امْرَأَةً فَأَسْقَطَتْ الْمَخْذُوفَةُ فَرُفِعَ ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلَ عَقْلَ وَلَدِهَا خَمْسَ مِائَةٍ مِنْ الْغُرِّ وَنَهَى يَوْمَئِذٍ عَنْ الْخَذْفِقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا وَهْمٌ وَيَنْبَغِي أَنْ يَكُونَ أَرَادَ مِائَةً مِنْ الْغُرِّ وَقَدْ رُوِيَ النَّهْيُ عَنْ الْخَذْفِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Yahya] telah menceritakan kepada kami [Abu Na'im] telah menceritakan kepada kami [Yusuf bin Shuhaib] telah menceritakan kepadaku [Abdullah bin Buraidah] bahwa seorang wanita melempar wanita lain menggunakan ketapel sehigga ia keguguran karena terkena ketapel tersebut kemudian hal tersebut diangkat kepada Nabi shallallahu 'alaihi wasallam lalu beliau menjadikan diyat anaknya lima ratus budak, dan beliau melarang dari bermain ketapel. Abu Abdur Rahman berkata; hal ini adalah suatu kesalahan selayaknya yang beliau inginkan adalah seratus budak. Dan telah diriwayatkan larangan dari bermain ketapel dari Abdullah bin Buraidah dari Abdullah bin Mughaffal. "
            },
            {
                "number": 4517,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَزِيدُ قَالَ أَنْبَأَنَا كَهْمَسٌ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍأَنَّهُ رَأَى رَجُلًا يَخْذِفُ فَقَالَ لَا تَخْذِفْ فَإِنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَنْهَى عَنْ الْخَذْفِ أَوْ يَكْرَهُ الْخَذْفَ شَكَّ كَهْمَسٌ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] telah menceritakan kepada kami [Yazid] telah mengabarkan kepada kami [Kahmas] dari [Abdullah bin Buraidah] dari [Abdullah bin Mughaffal] bahwa dia melihat seorang laki-laki yang bermain ketapel kemudian dia berkata; \"Janganlah bermain ketapel sesungguhnya Nabi shallallahu 'alaihi wasallam melarang dari bermain ketapel atau tidak suka bermain ketapel.\" Kahmas merasa ragu. "
            },
            {
                "number": 4518,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ عَمْرٍو عَنْ طَاوُسٍأَنَّ عُمَرَ اسْتَشَارَ النَّاسَ فِي الْجَنِينِ فَقَالَ حَمَلُ بْنُ مَالِكٍ قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْجَنِينِ غُرَّةًقَالَ طَاوُسٌ إِنَّ الْفَرَسَ غُرَّةٌ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] telah menceritakan kepada kami [Hammad] dari ['Amru] dari [Thawus] bahwa Umar meminta pendapat orang-orang mengenai janin, lalu [Hamal bin Malik] berkata; \"Rasulullah shallallahu 'alaihi wasallam telah memutuskan (diyat) untuk seorang janin adalah ghurrah (seorang budak).\" Thawus berkata; \"Sesungguhnya kuda terasuk ghurrah.\""
            },
            {
                "number": 4519,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ ابْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَنِينِ امْرَأَةٍ مِنْ بَنِي لِحْيَانَ سَقَطَ مَيِّتًا بِغُرَّةِ عَبْدٍ أَوْ أَمَةٍ ثُمَّ إِنَّ الْمَرْأَةَ الَّتِي قَضَى عَلَيْهَا بِالْغُرَّةِ تُوُفِّيَتْ فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَنَّ مِيرَاثَهَا لِبَنِيهَا وَزَوْجِهَا وَأَنَّ الْعَقْلَ عَلَى عَصَبَتِهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari [Ibnu Al Musayyab] dari [Abu Hurairah], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memutuskan (diyat) untuk janin seorang wanita dari Bani Lihyan yang gugur dan mati dengan ghurrah yaitu budak laki-laki atau wanita. Kemudian wanita yang diputuskan membayar ghurrah tersebut meninggal maka beliau memutuskan bahwa warisannya adalah untuk anak-anaknya dan suaminya, sedangkan diyat menjadi tanggungan ashabahnya.\""
            },
            {
                "number": 4520,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ وَسَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَاقْتَتَلَتْ امْرَأَتَانِ مِنْ هُذَيْلٍ فَرَمَتْ إِحْدَاهُمَا الْأُخْرَى بِحَجَرٍ وَذَكَرَ كَلِمَةً مَعْنَاهَا فَقَتَلَتْهَا وَمَا فِي بَطْنِهَا فَاخْتَصَمُوا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ دِيَةَ جَنِينِهَا غُرَّةٌ عَبْدٌ أَوْ وَلِيدَةٌ وَقَضَى بِدِيَةِ الْمَرْأَةِ عَلَى عَاقِلَتِهَا وَوَرَّثَهَا وَلَدَهَا وَمَنْ مَعَهُمْ فَقَالَ حَمَلُ بْنُ مَالِكِ بْنِ النَّابِغَةِ الْهُذَلِيُّ يَا رَسُولَ اللَّهِ كَيْفَ أُغَرَّمُ مَنْ لَا شَرِبَ وَلَا أَكَلْ وَلَا نَطَقَ وَلَا اسْتَهَلَّ فَمِثْلُ ذَلِكَ يُطَلَّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا هَذَا مِنْ إِخْوَانِ الْكُهَّانِ مِنْ أَجْلِ سَجْعِهِ الَّذِي سَجَعَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Amru bin As Sarh] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Abu Salamah] dan [Sa'id bin Al Musayyab] dari [Abu Hurairah] bahwa dia berkata; \"Dua orang wanita dari Hudzail berkelahi, kemudian salah seorang dari mereka melempar dengan batu. Dan ia menyebutkan suatu kalimat yang maknanya adalah; dia membunuhnya beserta kandungannya. Kemudian mereka (membawa) permasalahan tersebut kepada Rasulullah shallallahu 'alaihi wasallam kemudian Rasulullah shallallahu 'alaihi wasallam memutuskan bahwa diyat janinnya adalah ghurrah yaitu budak laki-laki atau perempuan. Dan beliau memutuskan diyat seorang wanita menjadi tanggungan ashabahnya dan orang yang bersama mereka. Dan beliau menjadikan anaknya sebagai pewarisnya. Hamal bin Malik bin An Nabighah Al Hudzali berkata; \"Wahai Rasulullah, bagaimana saya menanggung denda orang yang tidak makan dan minum, tidak berbicara serta menangis? (bukankah) yang seperti ini (termasuk) sesuatu yang dibatalkan?\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya (bayi) ini termasuk di antara saudara dukun karena kalimat sajak yang ia ucapkan.\""
            },
            {
                "number": 4521,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ امْرَأَتَيْنِ مِنْ هُذَيْلٍ فِي زَمَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَتْ إِحْدَاهُمَا الْأُخْرَى فَطَرَحَتْ جَنِينَهَا فَقَضَى فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِغُرَّةٍ عَبْدٍ أَوْ وَلِيدَةٍ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Amru bin As Sarh] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Malik] dari [Ibnu Syihab] dari [Abu Salamah bin Abdur Rahman] dari [Abu Hurairah] bahwa pada zaman Rasulullah shallallahu 'alaihi wasallam ada dua orang wanita dari Hudzail yang salah seorang di antaranya melempar yang lainnya hingga janinnya gugur, kemudian Rasulullah shallallahu 'alaihi wasallam memutuskan untuk membayar denda berupa budak laki-laki atau perempuan. "
            },
            {
                "number": 4522,
                "arab": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي الْجَنِينِ يُقْتَلُ فِي بَطْنِ أُمِّهِ بِغُرَّةٍ عَبْدٍ أَوْ وَلِيدَةٍ فَقَالَ الَّذِي قَضَى عَلَيْهِ كَيْفَ أُغَرَّمُ مَنْ لَا شَرِبَ وَلَا أَكَلْ وَلَا اسْتَهَلَّ وَلَا نَطَقَ فَمِثْلُ ذَلِكَ يُطَلَّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا هَذَا مِنْ الْكُهَّانِ",
                "id": "Telah berkata [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar dari [Ibnu Al Qasim] telah menceritakan kepadaku [Malik] dari [Ibnu Syihab] dari [Sa'id bin Al Musayyab] bahwa Rasulullah shallallahu 'alaihi wasallam memutuskan diyat dalam perkara janin yang terbunuh di dalam perut ibunya berupa seorang budak laki-laki atau perempuan. Kemudian orang yang diputuskan untuk membayar denda berkata; \"Bagaimana saya menanggung denda orang yang tidak minum, tidak makan dan tidak menangis serta tidak berbicara? (bukankah) yang seperti itu termasuk sesuatu yang dibatalkan?\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya (janin) ini termasuk dukun.\""
            },
            {
                "number": 4523,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ قَالَ حَدَّثَنَا خَلَفٌ وَهُوَ ابْنُ تَمِيمٍ قَالَ حَدَّثَنَا زَائِدَةُ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَأَنَّ امْرَأَةً ضَرَبَتْ ضَرَّتَهَا بِعَمُودِ فُسْطَاطٍ فَقَتَلَتْهَا وَهِيَ حُبْلَى فَأُتِيَ فِيهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى عَصَبَةِ الْقَاتِلَةِ بِالدِّيَةِ وَفِي الْجَنِينِ غُرَّةً فَقَالَ عَصَبَتُهَا أَدِي مَنْ لَا طَعِمَ وَلَا شَرِبَ وَلَا صَاحَ فَاسْتَهَلَّ فَمِثْلُ هَذَا يُطَلَّ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسَجْعٌ كَسَجْعِ الْأَعْرَابِ",
                "id": "Telah mengabarkan kepada kami [Ali bin Muhammad bin Ali] telah menceritakan kepada kami [Khalaf yaitu Ibnu Tamim] telah menceritakan kepada kami [Zaidah] dari [Manshur] dari [Ibrahim] dari ['Ubaid bin Nudhailah] dari [Al Mughirah bin Syu'bah] bahwa seorang wanita memukul madunya dengan tiang tenda sehingga ia membunuhnya padahal madunya tersebut tengah hamil. Kemudian permasalahan tersebut dihadapkan kepada Nabi shallallahu 'alaihi wasallam kemudian Rasulullah shallallahu 'alaihi wasallam memutuskan kepada 'ashabah wanita yang membunuh agar membayar diyat, sedang diyat untuk janin berupa seorang budak. Kemudian 'ashabah wanita tersebut mengatakan; \"Apakah saya menanggung denda orang yang tidak makan, tidak minum dan tidak berteriak serta menangis? Maka yang seperti ini (seharusnya) dibatalkan. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Apakah ini sajak seperti sajaknya orang-orang badui?\""
            },
            {
                "number": 4524,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ الْخُزَاعِيِّ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَضَرَبَتْ امْرَأَةٌ ضَرَّتَهَا بِعَمُودِ الْفُسْطَاطِ وَهِيَ حُبْلَى فَقَتَلَتْهَا فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِيَةَ الْمَقْتُولَةِ عَلَى عَصَبَةِ الْقَاتِلَةِ وَغُرَّةً لِمَا فِي بَطْنِهَا فَقَالَ رَجُلٌ مِنْ عَصَبَةِ الْقَاتِلَةِ أَنَغْرَمُ دِيَةَ مَنْ لَا أَكَلْ وَلَا شَرِبَ وَلَا اسْتَهَلَّ فَمِثْلُ ذَلِكَ يُطَلَّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسَجْعٌ كَسَجْعِ الْأَعْرَابِ فَجَعَلَ عَلَيْهِمْ الدِّيَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Qudamah] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari ['Ubaid bin Nudhailah Al Khuza'I] dari [Al Mughirah bin Syu'bah], dia berkata; seorang wanita memukul madunya yang sedang hamil dengan tiang tenda hingga dia membunuhnya. Kemudian Rasulullah shallallahu 'alaihi wasallam menjadikan diyat wanita yang dibunuh ditanggung oleh 'ashabah wanita yang membunuh dan denda berupa seorang budak untuk janin yang ada dalam perutnya. Kemudian seorang laki-laki dari 'ashabah wanita yang membunuh berkata; \"Apakah kami menanggung denda orang yang tidak makan, tidak minum dan tidak menangis? Hal seperti itu adalah sesuatu yang dibatalkan.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah ini sajak seperti sajak orang-orang badui?\" Kemudian beliau menjadikan mereka menanggung diyat. "
            },
            {
                "number": 4525,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَأَنَّ ضَرَّتَيْنِ ضَرَبَتْ إِحْدَاهُمَا الْأُخْرَى بِعَمُودِ فُسْطَاطٍ فَقَتَلَتْهَا فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالدِّيَةِ عَلَى عَصَبَةِ الْقَاتِلَةِ وَقَضَى لِمَا فِي بَطْنِهَا بِغُرَّةٍ فَقَالَ الْأَعْرَابِيُّ تُغَرِّمُنِي مَنْ لَا أَكَلْ وَلَا شَرِبَ وَلَا صَاحَ فَاسْتَهَلَّ فَمِثْلُ ذَلِكَ يُطَلَّ فَقَالَ سَجْعٌ كَسَجْعِ الْجَاهِلِيَّةِ وَقَضَى لِمَا فِي بَطْنِهَا بِغُرَّةٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysysar] telah menceritakan kepada kami [Abdur Rahman] telah menceritakan kepada kami [Sufyan] dari [Manshur] dari [Ibrahim] dari ['Ubaid bin Nudhailah] dari [Al Mughirah bin Syu'bah] bahwa salah seorang dari dua orang wanita yang dimadu memukul madunya dengan tiang tenda sehingga ia membunuhnya, kemudian Rasulullah shallallahu 'alaihi wasallam memutuskan agar 'ashabah wanita yang membunuh membayar diyat, dan memutuskan bagi janin yang ada di perutnya dengan denda berupa seorang budak. Kemudian seorang badui berkata; \"Tuan bebankan denda kepadaku untuk orang yang tidak makan, tidak minum, tidak berteriak dan tidak menangis, hal seperti itu adalah sesuatu yang dibatalkan.\" Kemudian beliau bersabda: \"Ini adalah sajak seperti sajak jahiliyah.\" Dan beliau memutuskan bahwa bagi janin yang ada dalam perutnya dengan denda seorang budak."
            },
            {
                "number": 4526,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي زَائِدَةَ عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَضَرَبَتْ امْرَأَةٌ مِنْ بَنِي لِحْيَانَ ضَرَّتَهَا بِعَمُودِ الْفُسْطَاطِ فَقَتَلَتْهَا وَكَانَ بِالْمَقْتُولَةِ حَمْلٌ فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى عَصَبَةِ الْقَاتِلَةِ بِالدِّيَةِ وَلِمَا فِي بَطْنِهَا بِغُرَّةٍ",
                "id": "Telah mengabarkan kepada kami [Ali bin Sa'id bin Masruq] telah menceritakan kepada kami [Yahya bin Abu Zaidah] dari [Israil] dari [Manshur] dari [Ibrahim] dari ['Ubaid bin Nudhailah] dari [Al Mughirah bin Syu'bah], dia berkata; \"Seorang wanita dari Bani Lihyan memukul madunya dengan tiang kemah sehingga dia membunuhnya, padahal wanita yang terbunuh tersebut sedang hamil. Kemudian Rasulullah shallallahu 'alaihi wasallam memutuskan denda menjadi tanggungan 'ashabah wanita yang membunuh, sedang denda untuk janin yang ada dalam perutnya adalah berupa seorang budak.\""
            },
            {
                "number": 4527,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ شُعْبَةَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَأَنَّ امْرَأَتَيْنِ كَانَتَا تَحْتَ رَجُلٍ مِنْ هُذَيْلٍ فَرَمَتْ إِحْدَاهُمَا الْأُخْرَى بِعَمُودِ فُسْطَاطٍ فَأَسْقَطَتْ فَاخْتَصَمَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا كَيْفَ نَدِي مَنْ لَا صَاحَ وَلَا اسْتَهَلَّ وَلَا شَرِبَ وَلَا أَكَلْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسَجْعٌ كَسَجْعِ الْأَعْرَابِ فَقَضَى بِالْغُرَّةِ عَلَى عَاقِلَةِ الْمَرْأَةِ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] telah menceritakan kepada kami [Abdullah] dari [Syu'bah] dari [Manshur] dari [Ibrahim] dari ['Ubaid bin Nudhailah] dari [Al Mughirah bin Syu'bah] bahwa dua orang wanita isteri seorang laki-laki dari Hudzail, salah seorang dari mereka melempar wanita yang lain dengan tiang kemah, sehingga menyebabkan kandungannya gugur. Kemudian mereka menghadapkan permasalahan tersebut kepada Nabi shallallahu 'alaihi wasallam, mereka berkata; \"Bagaimana kami menanggung denda orang yang tidak berteriak dan menangis, tidak minum dan tidak makan? Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Apakah ini sajak seperti sajak orang-orang badui?\" lalu beliau memutuskan denda berupa seorang budak menjadi tanggungan 'ashabah wanita yang membunuh. "
            },
            {
                "number": 4528,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ قَالَ سَمِعْتُ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نُضَيْلَةَ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَأَنَّ رَجُلًا مِنْ هُذَيْلٍ كَانَ لَهُ امْرَأَتَانِ فَرَمَتْ إِحْدَاهُمَا الْأُخْرَى بِعَمُودِ الْفُسْطَاطِ فَأَسْقَطَتْ فَقِيلَ أَرَأَيْتَ مَنْ لَا أَكَلْ وَلَا شَرِبَ وَلَا صَاحَ فَاسْتَهَلَّ فَقَالَ أَسَجْعٌ كَسَجْعِ الْأَعْرَابِ فَقَضَى فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ وَجُعِلَتْ عَلَى عَاقِلَةِ الْمَرْأَةِأَرْسَلَهُ الْأَعْمَشُ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Daud] telah menceritakan kepada kami [Syu'bah] dari [Manshur], dia berkata; \"Saya mendengar [Ibrahim] dari ['Ubaid bin Nudhailah] dari [Al Mughirah bin Syu'bah] bahwa seorang laki-laki dari Hudzail memiliki dua orang isteri, kemudian salah seorang dari mereka melempar yang lainnya dengan tiang kemah, sehingga ia menggugurkan kandungannya. Kemudian dikatakan; \"Bagaimana pendapatmu mengenai orang yang tidak makan, tidak minum, tidak berteriak dan tidak menangis?\" Kemudian beliau bersabda: \"Apakah ini sajak seperti sajak orang-orang badui?\" lalu Rasulullah shallallahu 'alaihi wasallam memutuskan untuk membayar denda berupa seorang budak dan dibebankan kepada 'ashabah wanita yang membunuh. Hadits tersebut dimursalkan oleh Al A'masy. "
            },
            {
                "number": 4529,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا مُصْعَبٌ قَالَ حَدَّثَنَا دَاوُدُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ قَالَضَرَبَتْ امْرَأَةٌ ضَرَّتَهَا بِحَجَرٍ وَهِيَ حُبْلَى فَقَتَلَتْهَا فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا فِي بَطْنِهَا غُرَّةً وَجَعَلَ عَقْلَهَا عَلَى عَصَبَتِهَا فَقَالُوا نُغَرَّمُ مَنْ لَا شَرِبَ وَلَا أَكَلْ وَلَا اسْتَهَلَّ فَمِثْلُ ذَلِكَ يُطَلَّ فَقَالَ أَسَجْعٌ كَسَجْعِ الْأَعْرَابِ هُوَ مَا أَقُولُ لَكُمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Mush'ab] telah menceritakan kepada kami [Daud] dari [Al A'masy] dari [Ibrahim], dia berkata; seorang wanita telah memukul madunya yang sedang hamil dengan batu hingga membunuhnya, kemudian Rasulullah shallallahu 'alaihi wasallam menetapkan denda untuk janin yang dikandungnya berupa seorang budak, dan membebankan dendanya kepada 'ashabah wanita yang membunuh. Kemudian mereka berkata; \"Apakah kami menanggung denda orang yang tidak makan, tidak minum, dan tidak menangis? Hal seperti itu adalah sesuatu yang dibatalkan.\" Kemudian beliau bersabda: \"Apakah ini sajak seperti sajak orang-orang badui? Keputusannya adalah apa yang saya katakan.\" "
            },
            {
                "number": 4530,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ قَالَ حَدَّثَنَا عَمْرٌو عَنْ أَسْبَاطَ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَتْ امْرَأَتَانِ جَارَتَانِ كَانَ بَيْنَهُمَا صَخَبٌ فَرَمَتْ إِحْدَاهُمَا الْأُخْرَى بِحَجَرٍ فَأَسْقَطَتْ غُلَامًا قَدْ نَبَتَ شَعْرُهُ مَيْتًا وَمَاتَتْ الْمَرْأَةُ فَقَضَى عَلَى الْعَاقِلَةِ الدِّيَةَ فَقَالَ عَمُّهَا إِنَّهَا قَدْ أَسْقَطَتْ يَا رَسُولَ اللَّهِ غُلَامًا قَدْ نَبَتَ شَعْرُهُ فَقَالَ أَبُو الْقَاتِلَةِ إِنَّهُ كَاذِبٌ إِنَّهُ وَاللَّهِ مَا اسْتَهَلَّ وَلَا شَرِبَ وَلَا أَكَلْ فَمِثْلُهُ يُطَلَّ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسَجْعٌ كَسَجْعِ الْجَاهِلِيَّةِ وَكِهَانَتِهَا إِنَّ فِي الصَّبِيِّ غُرَّةً قَالَ ابْنُ عَبَّاسٍ كَانَتْ إِحْدَاهُمَا مُلَيْكَةَ وَالْأُخْرَى أُمَّ غَطِيفٍ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Utsman bin Hakim] telah menceritakan kepada kami ['Amru] dari [Asbath] dari [Simak] dari [Ikrimah] dari [Ibn Abbas], dia berkata; ada dua orang wanita yang bertetangga, diantara keduanya terjadi percecokan lalu salah seorang dari mereka melempar yang lainnya dengan batu hingga menggugurkan anaknya yang telah tumbuh rambutnya, dan wanita itupun mati, lalu ditetapkan atas 'ashabah agar membayar diyat, pamannya berkata; \"Sesungguhnya dia telah mengugurkan seorang anak yang telah tumbuh rambutnya wahai Rasulullah.\" Lalu ayah wanita yang membunuh berkata; \"Dia berdusta, sungguh demi Allah, anak itu tidak menangis, tidak makan dan tidak minum. Maka hal seperti ini adalah sesuatu yang dibatalkan.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Apakah ini sebuah sajak seperti sajak orang-orang Jahiliyah dan perdukunannya? Sesungguhnya denda untuk seorang bayi berupa seorang budak, \" Ibnu Abbas berkata; \"Salah satunya bernama Mulaikah dan yang lainnya adalah Ummi Ghathif.\""
            },
            {
                "number": 4531,
                "arab": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ قَالَ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا يَقُولُكَتَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى كُلِّ بَطْنٍ عُقُولَةً وَلَا يَحِلُّ لِمَوْلًى أَنْ يَتَوَلَّى مُسْلِمًا بِغَيْرِ إِذْنِهِ",
                "id": "Telah mengabarkan kepada kami [Al Abbas bin Abdul 'Azhim] telah menceritakan kepada kami [Adh Dhahhak bin Makhlad] dari [Ibnu Juraij], dia berkata; telah menceritakan kepadaku [Abu Az Zubair] bahwa dia mendengar [Jabir] berkata; \"Rasulullah shallallahu 'alaihi wasallam menetapkan diyat atas setiap perut dan tidak halal bagi seorang tuan untuk menisbatkan seorang muslim sebagai budaknya yang telah dimerdekakan tanpa seizinnya.\""
            },
            {
                "number": 4532,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ وَمُحَمَّدُ بْنُ مُصَفَّى قَالَا حَدَّثَنَا الْوَلِيدُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَطَبَّبَ وَلَمْ يُعْلَمْ مِنْهُ طِبٌّ قَبْلَ ذَلِكَ فَهُوَ ضَامِنٌأَخْبَرَنِي مَحْمُودُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا الْوَلِيدُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ جَدِّهِ مِثْلَهُ سَوَاءً",
                "id": "Telah mengabarkan kepadaku ['Amru bin Utsman] dan [Muhammad bin Mushaffa], mereka berkata; telah menceritakan kepada kami [Al Walid] dari [Ibnu Juraij] dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakekknya], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang mengobati dan dia tidak mengetahui ilmunya sebelum itu maka dia yang bertanggung jawab.\" Telah menceritakan kepadaku [Mahmud bin Khalid] telah menceritakan kepadaku [Al Walid] dari [Ibn Juraij] dari [Amru bin Syu'aib] dari [kakekknya] sama seperti itu."
            },
            {
                "number": 4533,
                "arab": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ أَبْجَرَ عَنْ إِيَادِ بْنِ لَقِيطٍ عَنْ أَبِي رِمْثَةَ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ أَبِي فَقَالَ مَنْ هَذَا مَعَكَ قَالَ ابْنِي أَشْهَدُ بِهِ قَالَ أَمَا إِنَّكَ لَا تَجْنِي عَلَيْهِ وَلَا يَجْنِي عَلَيْكَ",
                "id": "Telah mengabarkan kepadaku [Harun bin Abdullah] telah menceritakan kepada kami [Sufyan] telah menceritakan kepadaku [Abdul Malik bin Abjar] dari [Iyad bin Laqith] dari [Abu Rimtsah], dia berkata; \"Saya bersama ayahku datang kepada Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Siapa ini yang bersamamu?\" ayahku berkata; \"Anakku, saya bersaksi dengannya.\" Beliau bersabda: \"Sesungguhnya dia tidak dihukum karena kejahatanmu dan engkau tidak dihukum karena kejahatannya.\""
            },
            {
                "number": 4534,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَشْعَثَ عَنْ الْأَسْوَدِ بْنِ هِلَالٍ عَنْ ثَعْلَبَةَ بْنِ زَهْدَمٍ الْيَرْبُوعِيِّ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فِي أُنَاسٍ مِنْ الْأَنْصَارِ فَقَالُوا يَا رَسُولَ اللَّهِ هَؤُلَاءِ بَنُو ثَعْلَبَةَ بْنِ يَرْبُوعٍ قَتَلُوا فُلَانًا فِي الْجَاهِلِيَّةِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهَتَفَ بِصَوْتِهِ أَلَا لَا تَجْنِي نَفْسٌ عَلَى الْأُخْرَى",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Bisyr bin As Sari] telah menceritakan kepada kami [Sufyan] dari [Asy'ats] dari [Al Aswad bin Hilal] dari [Tsa'labah bin Zahdam Al Yarbu'i], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam berkhutbah diantara orang-orang Anshar, kemudian mereka berkata; \"Wahai Rasulullah mereka adalah Bani Tsa'labah bin Yarbu', mereka membunuh fulan pada masa Jahiliyah.\" Lalu Nabi shallallahu 'alaihi wasallam berbisik: \"Ketahuilah sebuah jiwa tidak dihukum karena kejahatan jiwa yang lain.\""
            },
            {
                "number": 4535,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ عَنْ سُفْيَانَ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ الْأَسْوَدِ بْنِ هِلَالٍ عَنْ ثَعْلَبَةَ بْنِ زَهْدَمٍ قَالَانْتَهَى قَوْمٌ مِنْ بَنِي ثَعْلَبَةَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَخْطُبُ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هَؤُلَاءِ بَنُو ثَعْلَبَةَ بْنِ يَرْبُوعٍ قَتَلُوا فُلَانًا رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَجْنِي نَفْسٌ عَلَى أُخْرَى",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] telah menceritakan kepada kami [Mu'awiyah bin Hisyam] dari [Sufyan] dari [Asy'ats bin Abu Asy Asya'tsa`] dari [Al Aswad bin Hilal] dari [Tsa'labah bin Zahdam] beberapa orang dari Bani Tsa'labah datang kepada Nabi shallallahu 'alaihi wasallam yang sedang berkhutbah, kemudian seseorang berkata; \"Wahai Rasulullah, orang-orang Bani Tsa'labah bin Yarbu' telah membunuh Fulan dari kalangan sahabat Nabi shallallahu 'alaihi wasallam, kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Sebuah jiwa tidak dihukum karena kejahatan jiwa yang lain.\""
            },
            {
                "number": 4536,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ قَالَ سَمِعْتُ الْأَسْوَدَ بْنَ هِلَالٍ يُحَدِّثُ عَنْ رَجُلٍ مِنْ بَنِي ثَعْلَبَةَ بْنِ يَرْبُوعٍأَنَّ نَاسًا مِنْ بَنِي ثَعْلَبَةَ أَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هَؤُلَاءِ بَنُو ثَعْلَبَةَ بْنِ يَرْبُوعٍ قَتَلُوا فُلَانًا رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَجْنِي نَفْسٌ عَلَى أُخْرَى",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Daud] telah menceritakan kepada kami [Syu'bah] dari [Asy'ats bin Abu Asy Sya' tsa`], saya mendengar [Al Aswad bin Hilal] bercerita dari [seseorang dari Bani Tsa'labah bin Yarbu'] bahwa beberapa orang dari Bani Tsa'labah mendatangi Nabi shallallahu 'alaihi wasallam, kemudian seorang laki-laki berkata; \"Wahai Rasulullah, mereka adalah Bani Tsa'labah bin Yarbu', mereka telah membunuh seseorang dari sahabat Nabi shallallahu 'alaihi wasallam. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Sebuah jiwa tidak dihukum karena kejahatan jiwa yang lain.\""
            },
            {
                "number": 4537,
                "arab": "أَخْبَرَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا أَبُو عَتَّابٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْأَشْعَثِ بْنِ سُلَيْمٍ عَنْ الْأَسْوَدِ بْنِ هِلَالٍ وَكَانَ قَدْ أَدْرَكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ رَجُلٍ مِنْ بَنِي ثَعْلَبَةَ بْنِ يَرْبُوعٍأَنَّ نَاسًا مِنْ بَنِي ثَعْلَبَةَ أَصَابُوا رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا رَسُولَ اللَّهِ هَؤُلَاءِ بَنُو ثَعْلَبَةَ قَتَلَتْ فُلَانًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَجْنِي نَفْسٌ عَلَى أُخْرَىقَالَ شُعْبَةُ أَيْ لَا يُؤْخَذُ أَحَدٌ بِأَحَدٍ وَاللَّهُ تَعَالَى أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami [Abu Daud] telah menceritakan kepada kami [Abu 'Attab] telah menceritakan kepada kami [Syu'bah] dari [Al Asy'ats bin Sulaim] dari [Al Aswad bin Hilal] dan dia telah mengetahui Nabi shallallahu 'alaihi wasallam, dari [seseorang dari Bani Tsa'labah bin Yarbu'] bahwa beberapa orang dari Bani Tsa'labah membunuh seorang sahabat Nabi shallallahu 'alaihi wasallam, kemudian seorang laki-laki dari kalangan sahabat Rasulullah shallallahu 'alaihi wasallam berkata; \"Wahai Rasulullah, mereka adalah Bani Tsa'labah, mereka telah membunuh Fulan.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebuah jiwa tidak dihukum karena kejahatan jiwa yang lain.\" Syu'bah berkata; \"Yaitu tidak dihukum seseorang karena orang lain.\" Wallahu 'alam. "
            },
            {
                "number": 4538,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْأَشْعَثِ بْنِ سُلَيْمٍ عَنْ أَبِيهِ عَنْ رَجُلٍ مِنْ بَنِي ثَعْلَبَةَ بْنِ يَرْبُوعٍ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَتَكَلَّمُ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هَؤُلَاءِ بَنُو ثَعْلَبَةَ بْنِ يَرْبُوعٍ الَّذِينَ أَصَابُوا فُلَانًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَعْنِي لَا تَجْنِي نَفْسٌ عَلَى نَفْسٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu 'Awanah] dari [Al Asy'ats bin Sulaim] dari [ayahnya] dari [seseorang dari Bani Tsa'labah bin Yarbu'], dia berkata; \"Saya datang menemui Nabi shallallahu 'alaihi wasallam ketika beliau sedang berbicara. Kemudian seseorang berkata; \"Wahai Rasulullah, mereka adalah Bani Tsa'labah bin Yarbu' yang telah membunuh Fulan. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak, sebuah jiwa tidak dihukum karena kejahatan jiwa yang lain.\""
            },
            {
                "number": 4539,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ فِي حَدِيثِهِ عَنْ أَبِي الْأَحْوَصِ عَنْ أَشْعَثَ عَنْ أَبِيهِ عَنْ رَجُلٍ مِنْ بَنِي يَرْبُوعٍ قَالَأَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُكَلِّمُ النَّاسَ فَقَامَ إِلَيْهِ نَاسٌ فَقَالُوا يَا رَسُولَ اللَّهِ هَؤُلَاءِ بَنُو فُلَانٍ الَّذِينَ قَتَلُوا فُلَانًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَجْنِي نَفْسٌ عَلَى أُخْرَى",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari] dalam haditsnya dari [Abu Al Ahwash] dari [Al Asy'ats] dari [ayahnya] dari [seorang laki-laki dari Bani Yarbu'], dia berkata; \"Saya datang menemui Nabi shallallahu 'alaihi wasallam ketika beliau sedang berbicara dengan orang-orang, kemudian beberapa orang menemui beliau dan berkata; \"Wahai Rasulullah, mereka adalah Bani Fulan yang telah membunuh Fulan. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebuah jiwa tidak dihukum karena kejahatan jiwa yang lain.\""
            },
            {
                "number": 4540,
                "arab": "أَخْبَرَنَا يُوسُفُ بْنُ عِيسَى قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى قَالَ أَنْبَأَنَا يَزِيدُ وَهُوَ ابْنُ زِيَادِ بْنِ أَبِي الْجَعْدِ عَنْ جَامِعِ بْنِ شَدَّادٍ عَنْ طَارِقٍ الْمُحَارِبِيِّأَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ هَؤُلَاءِ بَنُو ثَعْلَبَةَ الَّذِينَ قَتَلُوا فُلَانًا فِي الْجَاهِلِيَّةِ فَخُذْ لَنَا بِثَأْرِنَا فَرَفَعَ يَدَيْهِ حَتَّى رَأَيْتُ بَيَاضَ إِبْطَيْهِ وَهُوَ يَقُولُ لَا تَجْنِي أُمٌّ عَلَى وَلَدٍ مَرَّتَيْنِ",
                "id": "Telah mengabarkan kepada kami [Yusuf bin Isa] telah menceritakan kepada kami [Al Fadhl bin Musa] telah menceritakan kepada kami [Yazid yaitu Ibnu Ziyad bin Abu Al Ja'di] dari [Jami' bin Syaddad] dari [Thariq Al Muharibi] bahwa seseorang berkata; \"Wahai Rasulullah, mereka adalah Bani Tsa'labah yang membunuh Fulan pada masa Jahiliyah, maka lakukanlah pembalasan untuk kami, lalu beliau mengangkat tangan beliau hingga terlihat putih ketiaknya, beliau bersabda: \"Tidaklah seorang anak dihukum karena kejahatan ibunya, \" sebanyak dua kali."
            },
            {
                "number": 4541,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ قَالَ أَنْبَأَنَا ابْنُ عَائِذٍ قَالَ حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ قَالَ أَخْبَرَنِي الْعَلَاءُ وَهُوَ ابْنُ الْحَارِثِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي الْعَيْنِ الْعَوْرَاءِ السَّادَّةِ لِمَكَانِهَا إِذَا طُمِسَتْ بِثُلُثِ دِيَتِهَا وَفِي الْيَدِ الشَّلَّاءِ إِذَا قُطِعَتْ بِثُلُثِ دِيَتِهَا وَفِي السِّنِّ السَّوْدَاءِ إِذَا نُزِعَتْ بِثُلُثِ دِيَتِهَا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Ibrahim bin Muhammad] telah menceritakan kepada kami [Ibnu 'Aidz] telah menceritakan kepada kami [Al Haitsam bin Humaid] telah menceritakan kepadaku [Al 'Ala` yaitu Ibnu Al Harits] dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam menetapkan diyat untuk mata yang cacat sebelah apabila tidak bisa melihat dengan sepertiga diyatnya, dan untuk tangan yang lumpuh jika terpotong dengan sepertiga diyatnya, pada gigi hitam apabila terlepas dengan sepertiga diyatnya."
            },
            {
                "number": 4542,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مُعَاوِيَةَ قَالَ حَدَّثَنَا عَبَّادٌ عَنْ حُسَيْنٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْأَسْنَانِ خَمْسٌ مِنْ الْإِبِلِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Mu'awiyah] telah menceritakan kepada kami ['Abbad] dari [Husain] dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Diyat untuk gigi adalah lima ekor unta.\""
            },
            {
                "number": 4543,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا حَفْصُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ مَطَرٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَسْنَانُ سَوَاءٌ خَمْسًا خَمْسًا",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Manshur] telah menceritakan kepada kami [Hafsh bin Abdur Rahman] telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dari [Mathar] dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Gigi diyatnya sama, yaitu lima, lima.\""
            },
            {
                "number": 4544,
                "arab": "أَخْبَرَنَا أَبُو الْأَشْعَثِ قَالَ حَدَّثَنَا خَالِدٌ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ مَسْرُوقِ بْنِ أَوْسٍ عَنْ أَبِي مُوسَىعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْأَصَابِعِ عَشْرٌ عَشْرٌ",
                "id": "Telah mengabarkan kepada kami [Abu Al Asy'ats] telah menceritakan kepada kami [Khalid] dari [Sa'id] dari [Qatadah] dari [Masruq bin Aus] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Diyat jari-jari adalah sepuluh, sepuluh.\""
            },
            {
                "number": 4545,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ غَالِبٍ التَّمَّارِ عَنْ مَسْرُوقِ بْنِ أَوْسٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْأَصَابِعُ سَوَاءٌ عَشْرًا",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Sa'id] dari [Ghalib At Tammar] dari [Masruq bin Aus] dari [Abu Musa Al Asy'ari] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jari-jari diyatnya sama, yaitu sepuluh.\""
            },
            {
                "number": 4546,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا حَفْصٌ وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ الْبَلْخِيُّ عَنْ سَعِيدٍ عَنْ غَالِبٍ التَّمَّارِ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ مَسْرُوقِ بْنِ أَوْسٍ عَنْ أَبِي مُوسَى قَالَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الْأَصَابِعَ سَوَاءٌ عَشْرًا عَشْرًا مِنْ الْإِبِلِ",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Manshur] telah menceritakan kepada kami [Hafsh yaitu Ibnu Abdur Rahman Al Balkhi] dari [Sa'id] dari [Ghalib At Tammar] dari [Humaid bin Hilal] dari [Masruq bin Aus] dari [Abu Musa], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam menetapkan bahwa diyat untuk jari-jari adalah sama, yaitu sepuluh unta, sepuluh unta.\""
            },
            {
                "number": 4547,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِأَنَّهُ لَمَّا وُجِدَ الْكِتَابُ الَّذِي عِنْدَ آلِ عَمْرِو بْنِ حَزْمٍ الَّذِي ذَكَرُوا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ لَهُمْ وَجَدُوا فِيهِ وَفِيمَا هُنَالِكَ مِنْ الْأَصَابِعِ عَشْرًا عَشْرًا",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Manshur] telah menceritakan kepada kami [Abdullah bin Numair] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sa'id bin Al Musayyab] bahwa tatkala ditemukan catatan yang ada pada keluarga 'Amru bin Hazm yang mereka sebutkan bahwa catatan tersebut ditulis oleh Rasulullah shallallahu 'alaihi wasallam untuk mereka, mereka dapatkan isinya dan di antara isinya adalah diyat untuk jari-jari adalah sepuluh sepuluh."
            },
            {
                "number": 4548,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنِي قَتَادَةُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَاعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هَذِهِ وَهَذِهِ سَوَاءٌ يَعْنِي الْخِنْصَرَ وَالْإِبْهَامَ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepadaku [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] radliallahu 'anhuma dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Ini dan ini adalah sama.\" yaitu jari kelingking dan ibu jari."
            },
            {
                "number": 4549,
                "arab": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍفَهَذِهِ وَهَذِهِ سَوَاءٌ الْإِبْهَامُ وَالْخِنْصَرُ",
                "id": "Telah mengabarkan kepada kami [Nashr bin Ali] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] ['Ikrimah] dari [Ibnu 'Abbas], dia berkata; \"Ini dan ini adalah sama (diyatnya) \", yaitu ibu jari dan jari kelingking."
            },
            {
                "number": 4550,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَالْأَصَابِعُ عَشْرٌ عَشْرٌ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari ['Ikrimah] dari [Ibnu 'Abbas], dia berkata; \"Jari-jari diyatnya adalah sepuluh-sepuluh.\""
            },
            {
                "number": 4551,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ عَنْ عَمْرِو بْنِ شُعَيْبٍ أَنَّ أَبَاهُ حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَلَمَّا افْتَتَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ قَالَ فِي خُطْبَتِهِ وَفِي الْأَصَابِعِ عَشْرٌ عَشْرٌ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Mas'ud] telah menceritakan kepada kami [Khalid bin Al Harits] telah menceritakan kepada kami [Husain Al Mu'allim] dari ['Amru bin Syu'aib] bahwa [ayahnya] telah menceritakan kepadanya dari [Abdullah bin 'Amru], dia berkata; \"Ketika Rasulullah shallallahu 'alaihi wasallam membuka Mekkah beliau bersabda dalam khutbahnya: \"Diyat untuk jari-jari adalah sepuluh-sepuluh.\""
            },
            {
                "number": 4552,
                "arab": "أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ الْهَيْثَمِ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ حَدَّثَنَا هَمَّامٌ قَالَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ وَابْنُ جُرَيْجٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي خُطْبَتِهِ وَهُوَ مُسْنِدٌ ظَهْرَهُ إِلَى الْكَعْبَةِ الْأَصَابِعُ سَوَاءٌ",
                "id": "Telah mengabarkan kepadaku [Abdullah bin Al Haitsam] telah menceritakan kepada kami [Hajjaj] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Husain Al Mu'allim] dan [Ibnu Juraij] dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Nabi shallallahu 'alaihi wasallam bersabda dalam khutbahnya seraya menyandarkan punggungnya ke ka'bah: \"Jari-jari adalah sama.\""
            },
            {
                "number": 4553,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ عَنْ عَمْرِو بْنِ شُعَيْبٍ أَنَّ أَبَاهُ حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَلَمَّا افْتَتَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ قَالَ فِي خُطْبَتِهِ وَفِي الْمَوَاضِحِ خَمْسٌ خَمْسٌ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] telah menceritakan kepada kami [Khalid bin Al Harits] telah menceritakan kepada kami [Husain Al Mu'allim] dari ['Amru bin Syu'aib] bahwa [ayahnya] telah menceritakan kepadanya dari [Abdullah bin 'Amru], dia berkata; \"Tatkala Rasulullah shallallahu 'alaihi wasallam membuka Mekkah beliau bersabda dalam khutbahnya: \"Untuk luka-luka yang menampakkan tulang diyatnya lima, lima.\""
            },
            {
                "number": 4554,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ كِتَابًا فِيهِ الْفَرَائِضُ وَالسُّنَنُ وَالدِّيَاتُ وَبَعَثَ بِهِ مَعَ عَمْرِو بْنِ حَزْمٍ فَقُرِئَتْ عَلَى أَهْلِ الْيَمَنِ هَذِهِ نُسْخَتُهَا مِنْ مُحَمَّدٍ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى شُرَحْبِيلَ بْنِ عَبْدِ كُلَالٍ وَنُعَيْمِ بْنِ عَبْدِ كُلَالٍ وَالْحَارِثِ بْنِ عَبْدِ كُلَالٍ قَيْلِ ذِيِ رُعَيْنٍ وَمَعَافِرَ وَهَمْدَانَ أَمَّا بَعْدُ وَكَانَ فِي كِتَابِهِ أَنَّ مَنْ اعْتَبَطَ مُؤْمِنًا قَتْلًا عَنْ بَيِّنَةٍ فَإِنَّهُ قَوَدٌ إِلَّا أَنْ يَرْضَى أَوْلِيَاءُ الْمَقْتُولِ وَأَنَّ فِي النَّفْسِ الدِّيَةَ مِائَةً مِنْ الْإِبِلِ وَفِي الْأَنْفِ إِذَا أُوعِبَ جَدْعُهُ الدِّيَةُ وَفِي اللِّسَانِ الدِّيَةُ وَفِي الشَّفَتَيْنِ الدِّيَةُ وَفِي الْبَيْضَتَيْنِ الدِّيَةُ وَفِي الذَّكَرِ الدِّيَةُ وَفِي الصُّلْبِ الدِّيَةُ وَفِي الْعَيْنَيْنِ الدِّيَةُ وَفِي الرِّجْلِ الْوَاحِدَةِ نِصْفُ الدِّيَةِ وَفِي الْمَأْمُومَةِ ثُلُثُ الدِّيَةِ وَفِي الْجَائِفَةِ ثُلُثُ الدِّيَةِ وَفِي الْمُنَقِّلَةِ خَمْسَ عَشْرَةَ مِنْ الْإِبِلِ وَفِي كُلِّ أُصْبُعٍ مِنْ أَصَابِعِ الْيَدِ وَالرِّجْلِ عَشْرٌ مِنْ الْإِبِلِ وَفِي السِّنِّ خَمْسٌ مِنْ الْإِبِلِ وَفِي الْمُوضِحَةِ خَمْسٌ مِنْ الْإِبِلِ وَأَنَّ الرَّجُلَ يُقْتَلُ بِالْمَرْأَةِ وَعَلَى أَهْلِ الذَّهَبِ أَلْفُ دِينَارٍخَالَفَهُ مُحَمَّدُ بْنُ بَكَّارِ بْنِ بِلَالٍ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Manshur] telah menceritakan kepada kami [Al Hakam bin Musa] telah menceritakan kepada kami [Yahya bin Hamzah] dari [Sulaiman bin Daud] telah menceritakan kepadaku [Az Zuhri] dari [Abu Bakar bin Muhammad bin 'Amru bin Hazm] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam menulis surat kepada penduduk Yaman yang berisi tentang berbagai kewajiban, sunnah-sunnah, dan diyat. Beliau mengutus 'Amru bin Hazm untuk mengantar surat tersebut. Kemudian surat tersebut dibacakan di hadapan penduduk Yaman. Inilah naskahnya; \"Dari Muhammad, Nabi shallallahu 'alaihi wasallam, kepada Syurahbil bin Abdu Kulal dan Nu'aim bin Abdu Kulal, serta Al Harits bin Abdu Kulal Qail Dzu ru'ain, Ma'afir, dan Hamdan; adapun selanjutnya.... Dan di antara isi surat tersebut adalah bahwa, \"Barang siapa membunuh seorang mukmin secara lalim dengan adanya bukti maka ia mendapatkan balasan, kecuali apabila para wali orang yang dibunuh merasa rela. Untuk sebuah nyawa satu diyat yaitu seratus ekor unta, hidung apabila dipotong semuanya adalah satu diyat, untuk lidah satu diyat, untuk dua bibir satu diyat, dua buah pelir satu diyat, penis satu diyat, tulang belakang satu diyat, dua mata satu diyat, satu kaki setengah diyat, luka yang sampai kepada otak sepertiga diyat, luka dalam sepertiga diyat, tulang retak dan bergeser lima belas unta, dan untuk setiap jari tangan dan kaki sepuluh unta, untuk gigi lima unta, untuk luka yang menampakkan tulang lima unta. Dan seseorang dibunuh akibat membunuh seorang wanita, bagi pemilik emas diyatnya adalah seribu dinar.\" Muhammad bin Bakkar bin Bilal menyelisihi hal tersebut. "
            },
            {
                "number": 4555,
                "arab": "أَخْبَرَنَا الْهَيْثَمُ بْنُ مَرْوَانَ بْنِ الْهَيْثَمِ بْنِ عِمْرَانَ الْعَنْسِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارِ بْنِ بِلَالٍ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ أَرْقَمَ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى أَهْلِ الْيَمَنِ بِكِتَابٍ فِيهِ الْفَرَائِضُ وَالسُّنَنُ وَالدِّيَاتُ وَبَعَثَ بِهِ مَعَ عَمْرِو بْنِ حَزْمٍ فَقُرِئَ عَلَى أَهْلِ الْيَمَنِ هَذِهِ نُسْخَتُهُ فَذَكَرَ مِثْلَهُ إِلَّا أَنَّهُ قَالَ وَفِي الْعَيْنِ الْوَاحِدَةِ نِصْفُ الدِّيَةِ وَفِي الْيَدِ الْوَاحِدَةِ نِصْفُ الدِّيَةِ وَفِي الرِّجْلِ الْوَاحِدَةِ نِصْفُ الدِّيَةِقَالَ أَبُو عَبْد الرَّحْمَنِ وَهَذَا أَشْبَهُ بِالصَّوَابِ وَاللَّهُ أَعْلَمُ وَسُلَيْمَانُ بْنُ أَرْقَمَ مَتْرُوكُ الْحَدِيثِ وَقَدْ رَوَى هَذَا الْحَدِيثَ يُونُسُ عَنْ الزُّهْرِيِّ مُرْسَلًا",
                "id": "Telah mengabarkan kepada kami [Al Haitsam bin Marwan bin Al Haitsam bin Imran Al 'Ansi] telah menceritakan kepada kami [Muhammad bin Bakkar bin Bilal] telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Sulaiman bin Arqam] telah menceritakan kepadaku [Az Zuhri] dari [Abu Bakar bin Muhammad bin 'Amru bin Hazm] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam menulis surat kepada pendudukYaman yang isinya berbagai kewajiban, sunnah-sunnah dan diyat. Beliau mengirimnya bersama 'Amru bin Hazm, kemudian dibacakan kepada penduduk Yaman, inilah naskahnya, beliau menyebutkan seperti itu hanya saja beliau bersabda: \"Untuk satu mata setengah diyat, satu tangan setengah diyat, dan satu kaki setengah diyat.\" Abu Abdur Rahman berkata; \"Ini lebih mendekati kebenaran. Wallahu a'lam. Sulaiman bin Arqam adalah orang yang ditinggalkan haditsnya, dan hadits ini telah diriwayatkan oleh Yunus dari Az Zuhri secara mursal.\""
            },
            {
                "number": 4556,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ عَنْ ابْنِ شِهَابٍ قَالَقَرَأْتُ كِتَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي كَتَبَ لِعَمْرِو بْنِ حَزْمٍ حِينَ بَعَثَهُ عَلَى نَجْرَانَ وَكَانَ الْكِتَابُ عِنْدَ أَبِي بَكْرِ بْنِ حَزْمٍ فَكَتَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا بَيَانٌ مِنْ اللَّهِ وَرَسُولِهِ{ يَا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ وَكَتَبَ الْآيَاتِ مِنْهَا حَتَّى بَلَغَ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ }ثُمَّ كَتَبَ هَذَا كِتَابُ الْجِرَاحِ فِي النَّفْسِ مِائَةٌ مِنْ الْإِبِلِ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Amru bin As Sarh] telah menceritakan kepada kami [Ibnu Wahb] telah menceritakan kepadaku [Yunus bin Yazid] dari [Ibnu Syihab], dia berkata; \"Saya membaca surat Rasulullah shallallahu 'alaihi wasallam yang beliau tulis untuk 'Amru bin Hazm ketika beliau mengutusnya ke Najran, dan surat tersebut ada pada Abu Bakar bin Hazm. Rasulullah shallallahu 'alaihi wasallam menulis: \"Ini adalah penjelasan dari Allah dan RasulNya, Hai orang-orang yang beriman, penuhilah aqad-aqad itu.....\" beliau menulis beberapa ayat hingga sampai pada firmanNya: \"Sesungguhnya Allah amat cepat hisabNya.\" Kemudian beliau menulis: \"Ini adalah catatan mengenai hal luka, untuk sebuah nyawa seratus unta....\" seperti itu.\""
            },
            {
                "number": 4557,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ الْوَاحِدِ قَالَ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا سَعِيدٌ وَهُوَ ابْنُ عَبْدِ الْعَزِيزِ عَنْ الزُّهْرِيِّ قَالَجَاءَنِي أَبُو بَكْرِ بْنُ حَزْمٍ بِكِتَابٍ فِي رُقْعَةٍ مِنْ أَدَمٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا بَيَانٌ مِنْ اللَّهِ وَرَسُولِهِ{ يَا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ }فَتَلَا مِنْهَا آيَاتٍ ثُمَّ قَالَ فِي النَّفْسِ مِائَةٌ مِنْ الْإِبِلِ وَفِي الْعَيْنِ خَمْسُونَ وَفِي الْيَدِ خَمْسُونَ وَفِي الرِّجْلِ خَمْسُونَ وَفِي الْمَأْمُومَةِ ثُلُثُ الدِّيَةِ وَفِي الْجَائِفَةِ ثُلُثُ الدِّيَةِ وَفِي الْمُنَقِّلَةِ خَمْسَ عَشْرَةَ فَرِيضَةً وَفِي الْأَصَابِعِ عَشْرٌ عَشْرٌ وَفِي الْأَسْنَانِ خَمْسٌ خَمْسٌ وَفِي الْمُوضِحَةِ خَمْسٌ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdul Wahid] telah menceritakan kepada kami [Marwan bin Muhammad] telah menceritakan kepada kami [Sa'id yaitu Ibnu Abdul Aziz] dari [Az Zuhri], dia berkata; \"Telah datang kepadaku [Abu Bakar bin Hazm] membawa surat dalam secarik kulit, dari Rasulullah shallallahu 'alaihi wasallam: \"Ini adalah penjelasan dari Allah dan RasulNya, \"Hai orang-orang yang beriman, penuhilah aqad-aqad itu.....\" beliau membaca beberapa ayat kenudian bersabda; \"Untuk sebuah nyawa seratus unta, untuk mata lima puluh unta, untuk satu tangan lima puluh, satu kaki lima puluh, luka hingga ke otak sepertiga diyat, luka dalam sepertiga diyat, tulang retak dan bergeser lima belas unta, dan untuk jari-jari sepuluh-sepuluh, untuk gigi lima, lima, luka yang menampakkan tulang lima.\""
            },
            {
                "number": 4558,
                "arab": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ قَالَالْكِتَابُ الَّذِي كَتَبَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَمْرِو بْنِ حَزْمٍ فِي الْعُقُولِ إِنَّ فِي النَّفْسِ مِائَةً مِنْ الْإِبِلِ وَفِي الْأَنْفِ إِذَا أُوعِيَ جَدْعًا مِائَةً مِنْ الْإِبِلِ وَفِي الْمَأْمُومَةِ ثُلُثُ النَّفْسِ وَفِي الْجَائِفَةِ مِثْلُهَا وَفِي الْيَدِ خَمْسُونَ وَفِي الْعَيْنِ خَمْسُونَ وَفِي الرِّجْلِ خَمْسُونَ وَفِي كُلِّ إِصْبَعٍ مِمَّا هُنَالِكَ عَشْرٌ مِنْ الْإِبِلِ وَفِي السِّنِّ خَمْسٌ وَفِي الْمُوضِحَةِ خَمْسٌ",
                "id": "Telah mengabarkan kepada kami [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar dari [Ibnu Al Qasim] telah menceritakan kepadaku [Malik] dari [Abdullah bin Abu Bakar bin Muhammad bin 'Amru bin Hazm] dari [ayahnya], dia berkata; \"Surat yang ditulis Rasulullah shallallahu 'alaihi wasallam untuk 'Amru bin Hazm mengenai diyat adalah; sesungguhnya untuk nyawa seratus unta, hidung apabila dipotong semuanya seratus unta, luka yang sampai ke otak sepertiga, luka dalam seperti itu (sepertiga juga), dan untuk satu tangan lima puluh, satu mata lima puluh, satu kaki lima puluh, dan untuk setiap jari sepuluh unta, satu gigi lima dan untuk luka yang menampakkan tulang lima.\" "
            },
            {
                "number": 4559,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبَانُ قَالَ حَدَّثَنَا يَحْيَى عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ أَعْرَابِيًّا أَتَى بَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَلْقَمَ عَيْنَهُ خُصَاصَةَ الْبَابِ فَبَصُرَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَوَخَّاهُ بِحَدِيدَةٍ أَوْ عُودٍ لِيَفْقَأَ عَيْنَهُ فَلَمَّا أَنْ بَصُرَ انْقَمَعَ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَا إِنَّكَ لَوْ ثَبَتَّ لَفَقَأْتُ عَيْنَكَ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Manshur] telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Aban] telah menceritakan kepada kami [Yahya] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] bahwa seorang badui datang ke pintu Rasulullah shallallahu 'alaihi wasallam kemudian meletakkan matanya pada celah pintu, kemudian Rasulullah shallallahu 'alaihi wasallam melihatnya dan beliau menuju kepadanya dengan membawa besi atau kayu untuk mencongkel matanya, kemudian tatkala orang itu melihat maka ia menarik matanya. Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya jika engkau tidak bergerak sungguh saya akan mencongkel matamu.\""
            },
            {
                "number": 4560,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ أَنَّ سَهْلَ بْنَ سَعْدٍ السَّاعِدِيَّ أَخْبَرَهُأَنَّ رَجُلًا اطَّلَعَ مِنْ جُحْرٍ فِي بَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِدْرَى يَحُكُّ بِهَا رَأْسَهُ فَلَمَّا رَآهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ عَلِمْتُ أَنَّكَ تَنْظُرُنِي لَطَعَنْتُ بِهِ فِي عَيْنِكَ إِنَّمَا جُعِلَ الْإِذْنُ مِنْ أَجْلِ الْبَصَرِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] bahwa [Sahl bin Sa'd As Sa'idi] telah mengabarkan kepadanya bahwa seorang laki-laki mengintip dari lubang pintu Rasulullah shallallahu 'alaihi wasallam padahal Rasulullah shallallahu 'alaihi wasallam sedang membawa sisir untuk menggaruk kepalanya. Tatkala Rasulullah shallallahu 'alaihi wasallam melihatnya beliau bersabda: \"Jika saya mengetahui bahwa engkau melihatku, sungguh aku akan menusukkan ini ke matamu, sesungguhnya diperintahkan untuk meminta izin agar mata (tidak melihat siapa yang di dalam).\""
            },
            {
                "number": 4561,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ النَّضْرِ بْنِ أَنَسٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اطَّلَعَ فِي بَيْتِ قَوْمٍ بِغَيْرِ إِذْنِهِمْ فَفَقَئُوا عَيْنَهُ فَلَا دِيَةَ لَهُ وَلَا قِصَاصَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [ayahku] dari [Qatadah] dari [An Nadhr bin Anas] dari [Basyir bin Nahik] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barang siapa yang mengintip ke rumah suatu kaum tanpa seizin mereka kemudian mereka mencongkel matanya maka tidak ada diyat baginya dan tidak ada pembalasan.\""
            },
            {
                "number": 4562,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَنَّ امْرَأً اطَّلَعَ عَلَيْكَ بِغَيْرِ إِذْنٍ فَخَذَفْتَهُ فَفَقَأْتَ عَيْنَهُ مَا كَانَ عَلَيْكَ حَرَجٌ وَقَالَ مَرَّةً أُخْرَى جُنَاحٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] telah menceritakan kepada kami [Sufyan] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: 'Apabila seseorang mengintipmu tanpa izin kemudian engkau melemparnya dan mencungkil matanya maka engkau tidak mendapatkan dosa.\" Dan pada kali lain beliau mengatakan: \"Dosa.\""
            },
            {
                "number": 4563,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مُصْعَبٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّهُ كَانَ يُصَلِّي فَإِذَا بِابْنٍ لِمَرْوَانَ يَمُرُّ بَيْنَ يَدَيْهِ فَدَرَأَهُ فَلَمْ يَرْجِعْ فَضَرَبَهُ فَخَرَجَ الْغُلَامُ يَبْكِي حَتَّى أَتَى مَرْوَانَ فَأَخْبَرَهُ فَقَالَ مَرْوَانُ لِأَبِي سَعِيدٍ لِمَ ضَرَبْتَ ابْنَ أَخِيكَ قَالَ مَا ضَرَبْتُهُ إِنَّمَا ضَرَبْتُ الشَّيْطَانَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا كَانَ أَحَدُكُمْ فِي صَلَاةٍ فَأَرَادَ إِنْسَانٌ يَمُرُّ بَيْنَ يَدَيْهِ فَيَدْرَؤُهُ مَا اسْتَطَاعَ فَإِنْ أَبَى فَلْيُقَاتِلْهُ فَإِنَّهُ شَيْطَانٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Mush'ab] telah menceritakan kepada kami [Muhammad bin Al Mubarak] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Shafwan bin Sulaim] dari ['Atho` bin Yasar] dari [Abu Sa'id Al Khudri] bahwa dia pernah melakukan sholat kemudian tiba-tiba anak Marwan lewat di depannya, kemudian dia menghalanginya namun anak tersebut tidak mundur kemudian dia memukulnya. Lalu anak itu keluar dalam keadaan menangis hingga datang kepada Marwan, dan memberitahukan kepadanya. Lalu Marwan berkata kepada Abu Sa'id; \"Kenapa engkau memukul anak saudaraku?\" Dia berkata; \"Saya tidak memukulnya, sesungguhnya saya memukul syetan. Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila seseorang diantara kalian melakukan sholat kemudian ada orang yang ingin lewat di hadapannya lalu ia mencegahnya semampunya, apabila orang tersebut mengabaikan maka hendaknya ia memeranginya karena itu adalah syetan.\""
            },
            {
                "number": 4564,
                "arab": "حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ لَفْظًا قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍقَالَ أَمَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبْزَى أَنْ أَسْأَلَ ابْنَ عَبَّاسٍ عَنْ هَاتَيْنِ الْآيَتَيْنِ{ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ }فَسَأَلْتُهُ فَقَالَ لَمْ يَنْسَخْهَا شَيْءٌ وَعَنْ هَذِهِ الْآيَةِ{ وَالَّذِينَ لَا يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلَا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ }قَالَ نَزَلَتْ فِي أَهْلِ الشِّرْكِ",
                "id": "Telah menceritakan kepada kami Abu Abdur Rahman secara lafazh, dia berkata; telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad] telah menceritakan kepada kami [Syu'bah] dari [Manshur] dari [Sa'id bin Jubair], dia berkata; \"Saya diperintahkan oleh Abdur Rahman bin Abza untuk bertanya kepada [Ibnu Abbas] mengenai dua ayat ini: Barang siapa yang membunuh seorang mukmin dengan sengaja maka balasannya adalah Neraka Jahannam. Maka dia berkata; \"Tidak ada sesuatupun yang menghapusnya. Dan mengenai ayat ini: Dan orang-orang yang tidak menyembah tuhan yang lain beserta Allah dan tidak membunuh jiwa yang diharamkan Allah (membunuhnya) kecuali dengan (alasan) yang benar. Dia berkata; \"Ayat tersebut turun mengenai ahli syirik.\" "
            },
            {
                "number": 4565,
                "arab": "أَخْبَرَنَا أَزْهَرُ بْنُ جَمِيلٍ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْمُغِيرَةِ بْنِ النَّعْمَانِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَاخْتَلَفَ أَهْلُ الْكُوفَةِ فِي هَذِهِ الْآيَةِ{ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا }فَرَحَلْتُ إِلَى ابْنِ عَبَّاسٍ فَسَأَلْتُهُ فَقَالَ نَزَلَتْ فِي آخِرِ مَا أُنْزِلَتْ وَمَا نَسَخَهَا شَيْءٌ",
                "id": "Telah mengabarkan kepada kami [Azhar bin Jamil] telah menceritakan kepada kami [Khalid bin Al Harits] telah menceritakan kepada kami [Syu'bah] dari [Al Mughirah bin An Na'man] dari [Sa'id bin Jubair], dia berkata; \"Penduduk Kufah berselisih mengenai ayat ini: Barang siapa yang membunuh seorang mukmin dengan sengaja.....Kemudian saya pergi menemui [Ibnu Abbas] dan bertanya kepadanya, kemudian dia berkata; \"Ayat tersebut diturunkan di akhir ayat yang diturunkan dan tidak ada sesuatupun yang menghapusnya.\""
            },
            {
                "number": 4566,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي الْقَاسِمُ بْنُ أَبِي بَزَّةَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَقُلْتُ لِابْنِ عَبَّاسٍ هَلْ لِمَنْ قَتَلَ مُؤْمِنًا مُتَعَمِّدًا مِنْ تَوْبَةٍ قَالَ لَا وَقَرَأْتُ عَلَيْهِ الْآيَةَ الَّتِي فِي الْفُرْقَانِ{ وَالَّذِينَ لَا يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلَا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ }قَالَ هَذِهِ آيَةٌ مَكِّيَّةٌ نَسَخَتْهَا آيَةٌ مَدَنِيَّةٌ{ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ }",
                "id": "Telah mengabarkan kepada kami ['Amru bin Ali] telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Ibnu Juraij] telah menceritakan kepadaku [Al Qasim bin Abu Bazzah] dari [Sa'id bin Jubair], dia berkata; \"Saya berkata kepada [Ibnu Abbas]; \"Apakah ada taubat bagi orang yang membunuh seorang mukmin secara sengaja?\" Dia berkata; \"Tidak.\" Dan saya membacakan kepadanya ayat yang ada dalam surat Al Furqan: Dan orang-orang yang tidak menyembah tuhan yang lain beserta Allah dan tidak membunuh jiwa yang diharamkan Allah (membunuhnya) kecuali dengan (alasan) yang benar. Dia berkata; \"Ini adalah ayat Makkiyah dan dihapus oleh ayat Madaniyah. Yaitu: Barang siapa yang membunuh seorang mukmin dengan sengaja maka balasannya adalah Neraka Jahannam"
            },
            {
                "number": 4567,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمَّارٍ الدُّهْنِيِّ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِأَنَّ ابْنَ عَبَّاسٍ سُئِلَ عَمَّنْ قَتَلَ مُؤْمِنًا مُتَعَمِّدًا ثُمَّ تَابَ وَآمَنَ وَعَمِلَ صَالِحًا ثُمَّ اهْتَدَى فَقَالَ ابْنُ عَبَّاسٍ وَأَنَّى لَهُ التَّوْبَةُ سَمِعْتُ نَبِيَّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَجِيءُ مُتَعَلِّقًا بِالْقَاتِلِ تَشْخَبُ أَوْدَاجُهُ دَمًا يَقُولُ سَلْ هَذَا فِيمَ قَتَلَنِي ثُمَّ قَالَ وَاللَّهِ لَقَدْ أَنْزَلَهَا وَمَا نَسَخَهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] telah menceritakan kepada kami [Sufyan] dari ['Ammar Ad Duhni] dari [Salim bin Abu Al Ja'd] bahwa [Ibnu Abbas] ditanya mengenai orang yang membunuh orang mukmin dengan sengaja kemudian bertaubat, beriman dan melakukan amal Shalih kemudian mendapatkan petunjuk. Maka Ibnu Abbas berkata; Terlambat baginya taubat, Saya mendengar Nabi kalian shallallahu 'alaihi wasallam bersabda: \"Ia akan datang bergantung kepada orang yang membunuh sedang urat lehernya bercucuran darah, dia berkata; \"Tanyakan kepada orang ini, kenapa dia membunuhku.\" Kemudian dia berkata; \"Demi Allah, sungguh Dia telah menurunkannya dan tidak menghapusnya.\""
            },
            {
                "number": 4568,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا النَّضْرُ بْنُ شُمَيْلٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرٍ قَالَ سَمِعْتُ أَنَسًا يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَنَسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْكَبَائِرُ الشِّرْكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ وَقَتْلُ النَّفْسِ وَقَوْلُ الزُّورِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami [An Nadhr bin Syumail] telah menceritakan kepada kami [Syu'bah] dari ['ubaidhullah bin Abu Bakar], dia berkata; \"Saya mendengar [Anas] berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda:... Disebutkan dari jalur lain: Telah menceritakan kepada kami [Muhammad bin Abdul A'la] telah menceritakan kepada kami [Khalid], ia berkata; telah menceritakan kepada kami [Syu'bah] dari ['ubaidhullah bin Abu Bakar] dari [Anas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Dosa-dosa besar adalah; mensekutukan Allah, durhaka kepada kedua orang tua, membunuh jiwa, dan perkataan palsu.\""
            },
            {
                "number": 4569,
                "arab": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ قَالَ أَنْبَأَنَا ابْنُ شُمَيْلٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَنْبَأَنَا فِرَاسٌ قَالَ سَمِعْتُ الشَّعْبِيَّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْكَبَائِرُ الْإِشْرَاكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ وَقَتْلُ النَّفْسِ وَالْيَمِينُ الْغَمُوسُ",
                "id": "Telah mengabarkan kepada kami ['Abdah bin Abdur Rahim] telah menceritakan kepada kami [Ibnu Syumail] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Firas], dia berkata; \"Saya mendengar [Asy Sya'bi] dari [Abdullah bin 'Amru] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: 'Dosa-dosa besar adalah: mensekutukan Allah, durhaka kepada kedua orang tua, membunuh jiwa, dan sumpah palsu.\""
            },
            {
                "number": 4570,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَ حَدَّثَنَا إِسْحَقُ الْأَزْرَقُ عَنْ الْفُضَيْلِ بْنِ غَزْوَانَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزْنِي الْعَبْدُ حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ وَلَا يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ وَلَا يَسْرِقُ وَهُوَ مُؤْمِنٌ وَلَا يَقْتُلُ وَهُوَ مُؤْمِنٌ",
                "id": "Telah mengabarkan kepada kami [Abdur Rahman bin Muhammad bin Sallam] telah menceritakan kepada kami [Ishaq Al Azraq] dari [Al Fudhail bin Ghazwan] dari [Ikrimah] dari [Ibnu Abbas], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang hamba berzina ketika dia berzina sementara dirinya dalam keadaan beriman, dan tidaklah ia minum Khamr ketika dia meminumnya sedang dia dalam keadaan beriman, tidaklah dia mencuri sedang dia dalam keadaan beriman dan tidaklah ia membunuh ketika dia dalam keadaan beriman.\""
            },
            {
                "number": 4571,
                "arab": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ الْقَعْقَاعِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ وَلَا يَسْرِقُ السَّارِقُ حِينَ يَسْرِقُ وَهُوَ مُؤْمِنٌ وَلَا يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ وَلَا يَنْتَهِبُ نُهْبَةً ذَاتَ شَرَفٍ يَرْفَعُ النَّاسُ إِلَيْهَا أَبْصَارَهُمْ وَهُوَ مُؤْمِنٌ",
                "id": "Telah mengabarkan kepada kami [Ar Rabi' bin Sulaiman] telah menceritakan kepada kami [Syu'bah bin Al Laits] telah menceritakan kepada kami [Al Laits] dari [Ibnu 'Ajlan] dari [Al Qa'qa'] dari [Abu Shalih] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Tidaklah pezina itu berzina ketika dia dalam keadaan beriman, dan tidaklah pencuri itu mencuri ketika dia dalam keadaan beriman, tidaklah dia meminum khamr ketika meminumnya sedangkan dia dalam keadaan beriman, dan tidaklah dia merampas suatu rampasan yang berharga dan menjadi daya tarik manusia ketika dia dalam keadaan beriman.\""
            },
            {
                "number": 4572,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ ح وَأَنْبَأَنَا أَحْمَدُ بْنُ سَيَّارٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ عَنْ أَبِي حَمْزَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ أَحْمَدُ فِي حَدِيثِهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ وَلَا يَسْرِقُ حِينَ يَسْرِقُ وَهُوَ مُؤْمِنٌ وَلَا يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُ وَهُوَ مُؤْمِنٌ ثُمَّ التَّوْبَةُ مَعْرُوضَةٌ بَعْدُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Syu'bah] dari [Sulaiman]. Disebutkan dari jalur lain: Telah menceritakan kepada kami [Ahmad bin Sayyar] telah menceritakan kepada kami [Abdullah bin Utsman] dari [Abu Hamzah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam... dan Ahmad berkata di dalam haditsnya; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah pezina itu berzina ketika dia dalam keadaan beriman, dan tidaklah pencuri itu mencuri ketika dia dalam keadaan beriman, tidaklah dia meminum khamr ketika meminumnya sedangkan dia dalam keadaan beriman, kemudian taubah terbentang setelah itu.\" "
            },
            {
                "number": 4573,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى الْمَرْوَزِيُّ أَبُو عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ عَنْ أَبِي حَمْزَةَ عَنْ يَزِيدَ وَهُوَ ابْنُ أَبِي زِيَادٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَلَا يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ وَلَا يَسْرِقُ وَهُوَ مُؤْمِنٌ وَلَا يَشْرَبُ الْخَمْرَ وَهُوَ مُؤْمِنٌ وَذَكَرَ رَابِعَةً فَنَسِيتُهَا فَإِذَا فَعَلَ ذَلِكَ خَلَعَ رِبْقَةَ الْإِسْلَامِ مِنْ عُنُقِهِ فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya Al Marwazi Abu Ali] telah menceritakan kepada kami [Abdullah bin Utsman] dari [Abu Hamzah] dari [Yazid yaitu Ibnu Abu Ziyad] dari [Abu Shalih] dari [Abu Hurairah], dia berkata \"Tidaklah pezina itu berzina ketika dia dalam keadaan beriman, dan tidaklah pencuri itu mencuri ketika dia dalam keadaan beriman, tidaklah dia meminum khamr ketika meminumnya sedangkan dia dalam keadaan beriman, kemudian beliau menyebutkan yang keempat tetapi saya lupa.\"Apabila dia melakukan hal tersebut berarti dia telah melepas tali Islam dari lehernya, kemudian apabila dia bertaubat maka Allah menerima taubatnya.\""
            },
            {
                "number": 4574,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ الْمُخَرَّمِيُّ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا الْأَعْمَشُ ح وَأَنْبَأَنَا أَحْمَدُ بْنُ حَرْبٍ عَنْ أَبِي مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ اللَّهُ السَّارِقَ يَسْرِقُ الْبَيْضَةَ فَتُقْطَعُ يَدُهُ وَيَسْرِقُ الْحَبْلَ فَتُقْطَعُ يَدُهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Al Mubarak Al Mukharrami] telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy]. Disebutkan dalam jalur lain: Telah menceritakan kepada kami [Ahmad bin Harb] dari [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] radliallahu 'anhu, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \" Allah melaknat pencuri yang mencuri telur hingga tangannya dipotong dan mencuri tali hingga tangannya dipotong.\""
            },
            {
                "number": 4575,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ قَالَ حَدَّثَنِي صَفْوَانُ بْنُ عَمْرٍو قَالَ حَدَّثَنِي أَزْهَرُ بْنُ عَبْدِ اللَّهِ الْحَرَازِيُّ عَنْ النُّعْمَانِ بْنِ بَشِيرٍأَنَّهُ رَفَعَ إِلَيْهِ نَفَرٌ مِنْ الْكَلَاعِيِّينَ أَنَّ حَاكَةً سَرَقُوا مَتَاعًا فَحَبَسَهُمْ أَيَّامًا ثُمَّ خَلَّى سَبِيلَهُمْ فَأَتَوْهُ فَقَالُوا خَلَّيْتَ سَبِيلَ هَؤُلَاءِ بِلَا امْتِحَانٍ وَلَا ضَرْبٍ فَقَالَ النُّعْمَانُ مَا شِئْتُمْ إِنْ شِئْتُمْ أَضْرِبْهُمْ فَإِنْ أَخْرَجَ اللَّهُ مَتَاعَكُمْ فَذَاكَ وَإِلَّا أَخَذْتُ مِنْ ظُهُورِكُمْ مِثْلَهُ قَالُوا هَذَا حُكْمُكَ قَالَ هَذَا حُكْمُ اللَّهِ عَزَّ وَجَلَّ وَرَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] telah menceritakan kepada kami [Baqiyah bin Al Walid] telah menceritakan kepadaku [Shafwan bin 'Amru] telah menceritakan kepadaku [Azhar bin Abdullah Al Harazi] dari [An Nu'man bin Basyir] bahwa beberapa orang Kala' (kabilah dari Yaman) mengadu kepadanya bahwa orang-orang Hakah mencuri harta. Lalu dia memenjarakan mereka beberapa hari kemudian membebaskanya, mereka (orang-orang Kala') menemuinya dan berkata engkau membebaskannya tanpa engkau uji atau engkau pukul? lalu Nu'man berkata; terserah kalian, jika kalian mau maka aku akan memukul mereka, jika saja Allah mengembalikan harta kalian maka itulah milik kalian namun jika tidak aku akan melakukan seperti yang aku lakukan pada mereka, mereka berkata; \"Inikah hukummu?\" Dia berkata; \"Ini adalah hukum Allah Azza wa jalla dan RasulNya shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 4576,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ أَخْبَرَنِي ابْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَبَسَ نَاسًا فِي تُهْمَةٍ",
                "id": "Telah mengabarkan kepada kami [Abdur Rahman bin Muhammad bin Sallam] telah menceritakan kepada kami [Abu Usamah], ia berkata; telah menceritakan kepadaku [Ibnu Al Mubarak] dari [Ma'mar] dari [Bahz bin Hakim] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam memenjarakan beberapa orang Karena sebuah tuduhan."
            },
            {
                "number": 4577,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَبَسَ رَجُلًا فِي تُهْمَةٍ ثُمَّ خَلَّى سَبِيلَهُ",
                "id": "Telah mengabarkan kepada kami [Ali bin Sa'id bin Masruq] telah menceritakan kepada kami [Abdullah bin Al Mubarak] dari [Ma'mar] dari [Bahz bin Hakim] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam memenjarakan seseorang karena sebuah tuduhan kemudian melepaskannya."
            },
            {
                "number": 4578,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَبِي الْمُنْذِرِ مَوْلَى أَبِي ذَرٍّ عَنْ أَبِي أُمَيَّةَ الْمَخْزُومِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِلِصٍّ اعْتَرَفَ اعْتِرَافًا وَلَمْ يُوجَدْ مَعَهُ مَتَاعٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا إِخَالُكَ سَرَقْتَ قَالَ بَلَى قَالَ اذْهَبُوا بِهِ فَاقْطَعُوهُ ثُمَّ جِيئُوا بِهِ فَقَطَعُوهُ ثُمَّ جَاءُوا بِهِ فَقَالَ لَهُ قُلْ أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فَقَالَ أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ قَالَ اللَّهُمَّ تُبْ عَلَيْهِ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] telah menceritakan kepada kami [Abdullah bin Al Mubarak] dari [Hammad bin Salamah] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Abu Al Mundzir], budak Abu Dzar yang sudah dimerdekakan, dari [Abu Umayyah Al Makhzumi] bahwa dihadapkan kepada Rasulullah shallallahu 'alaihi wasallam seorang pencuri yang memberikan sebuah pengakuan, padahal tidak didapatkan barang bersamanya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Saya kira engkau tidak mencuri.\" Kemudian orang tersebut mengatakan; \"Benar (saya mencuri). Beliau bersabda: \"Bawalah orang ini dan potonglah tangannya.\" Kemudian mereka memotongnya lalu dihadapkan kembali kepada beliau. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Katakanlah, saya meminta ampun kepada Allah dan bertaubat kepadaNya.\" Maka orang tersebut mengatakan; \"Saya meminta ampun kepada Allah dan bertaubat kepadaNya.\" Beliau bersabda: \"Ya Allah, terimalah taubatnya.\""
            },
            {
                "number": 4579,
                "arab": "أَخْبَرَنَا هِلَالُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ عَطَاءٍ عَنْ صَفْوَانَ بْنِ أُمَيَّةَأَنَّ رَجُلًا سَرَقَ بُرْدَةً لَهُ فَرَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِقَطْعِهِ فَقَالَ يَا رَسُولَ اللَّهِ قَدْ تَجَاوَزْتُ عَنْهُ فَقَالَ أَبَا وَهْبٍ أَفَلَا كَانَ قَبْلَ أَنْ تَأْتِيَنَا بِهِ فَقَطَعَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Hilal bin Al 'Ala`] telah menceritakan kepadaku [ayahku] telah menceritakan kepada kami [Yazid bin Zurai'] dari [Sa'id] dari [Qatadah] dari ['Atho`] dari [Shafwan bin Umayyah] bahwa seorang laki-laki telah mencuri selendangnya, kemudian dia melaporkannya kepada Nabi shallallahu 'alaihi wasallam lalu beliau memerintahkannya untuk memotong tangannya. Kemudian Shafwan berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam saya telah memaafkannya.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Abu Wahb, Kenapa engkau tidak mengatakannya sebelum engkau datang kepada kami?\" kemudian Rasulullah shallallahu 'alaihi wasallam memotong tangannya. "
            },
            {
                "number": 4580,
                "arab": "أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ حَنْبَلٍ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ عَطَاءٍ عَنْ طَارِقِ بْنِ مُرَقَّعٍ عَنْ صَفْوَانَ بْنِ أُمَيَّةَأَنَّ رَجُلًا سَرَقَ بُرْدَةً فَرَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِقَطْعِهِ فَقَالَ يَا رَسُولَ اللَّهِ قَدْ تَجَاوَزْتُ عَنْهُ قَالَ فَلَوْلَا كَانَ هَذَا قَبْلَ أَنْ تَأْتِيَنِي بِهِ يَا أَبَا وَهْبٍ فَقَطَعَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepadaku [Abdullah bin Ahmad bin Muhammad bin Hanbal] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari ['Atho`] dari [Thariq bin Muraqqa'] dari [Shafwan bin Umayyah] bahwa seorang laki-laki telah mencuri selendangnya, kemudian dia melaporkannya kepada Nabi shallallahu 'alaihi wasallam lalu beliau memerintahkan agar dipotong tangannya. Lalu Shafwan berkata; \"Wahai Rasulullah, saya telah memaafkannya.\" Beliau bersabda: \"Andaikan hal ini terjadi sebelum engkau membawanya kepadaku wahai Abu Wahb?\" Kemudian Rasulullah memotong tangannya. "
            },
            {
                "number": 4581,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ نُعَيْمٍ قَالَ أَنْبَأَنَا حِبَّانُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍأَنَّ رَجُلًا سَرَقَ ثَوْبًا فَأُتِيَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِقَطْعِهِ فَقَالَ الرَّجُلُ يَا رَسُولَ اللَّهِ هُوَ لَهُ قَالَ فَهَلَّا قَبْلَ الْآنَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hatim bin Nu'aim] telah menceritakan kepada kami [Hibban] telah menceritakan kepada kami [Abdullah] dari [Al Auza'i] telah menceritakan kepadaku ['Atho`bin Abu Rabah] bahwa seorang laki-laki mencuri pakaian, lalu dia dihadapkan kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau memerintahkan untuk memotong tangannya. Seorang laki-laki berkata; \"Wahai Rasulullah, itu adalah miliknya, beliau bersabda: \" Kenapa kamu tidak mengatakannya sebelum ini.\""
            },
            {
                "number": 4582,
                "arab": "أَخْبَرَنِي هِلَالُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا حُسَيْنٌ قَالَ حَدَّثَنَا زُهَيْرٌ قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ هُوَ ابْنُ أَبِي بَشِيرٍ قَالَ حَدَّثَنِي عِكْرِمَةُ عَنْ صَفْوَانَ بْنِ أُمَيَّةَأَنَّهُ طَافَ بِالْبَيْتِ وَصَلَّى ثُمَّ لَفَّ رِدَاءً لَهُ مِنْ بُرْدٍ فَوَضَعَهُ تَحْتَ رَأْسِهِ فَنَامَ فَأَتَاهُ لِصٌّ فَاسْتَلَّهُ مِنْ تَحْتِ رَأْسِهِ فَأَخَذَهُ فَأَتَى بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ هَذَا سَرَقَ رِدَائِي فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسَرَقْتَ رِدَاءَ هَذَا قَالَ نَعَمْ قَالَ اذْهَبَا بِهِ فَاقْطَعَا يَدَهُ قَالَ صَفْوَانُ مَا كُنْتُ أُرِيدُ أَنْ تُقْطَعَ يَدُهُ فِي رِدَائِي فَقَالَ لَهُ فَلَوْ مَا قَبْلَ هَذَاخَالَفَهُ أَشْعَثُ بْنُ سَوَّارٍ",
                "id": "Telah mengabarkan kepadaku [Hilal bin Al 'Ala`] telah menceritakan kepada kami [Husain] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Abdul Malik yaitu Ibnu Abu Basyir] telah menceritakan kepadaku [Ikrimah] dari [Shafwan bin Umayyah] bahwa dia melakukan Thawaf di Ka'bah dan melakukan sholat kemudian melipat selendangnya dan meletakkannya di bawah kepala kemudian tidur. Lalu datanglah seorang pencuri kepadanya dan mengambil selendang tersebut dari bawah kepalanya. Shafwan menangkapnya dan membawanya kepada Nabi shallallahu 'alaihi wasallam. Dia berkata; \"Orang ini telah mencuri selendangku. Kemudian Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Apakah engkau mencuri selendang ini?\" orang tersebut mengatakan; \"Ya.\" Beliau bersabda: \"Pergilah bawalah orang ini pergi dan potonglah tangannya.\" Shafwan berkata; \"Saya tidak menginginkan tangannya dipotong karena selendangku.\" Kemudian beliau bersabda: \"Seandainya engkau katakan sebelum ini.\" Asy'ats bin Sawwar menyelisihi hal ini. "
            },
            {
                "number": 4583,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ هِشَامٍ يَعْنِي ابْنَ أَبِي خِيَرَةَ قَالَ حَدَّثَنَا الْفَضْلُ يَعْنِي ابْنَ الْعَلَاءِ الْكُوفِيَّ قَالَ حَدَّثَنَا أَشْعَثُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ صَفْوَانُ نَائِمًا فِي الْمَسْجِدِ وَرِدَاؤُهُ تَحْتَهُ فَسُرِقَ فَقَامَ وَقَدْ ذَهَبَ الرَّجُلُ فَأَدْرَكَهُ فَأَخَذَهُ فَجَاءَ بِهِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِقَطْعِهِ قَالَ صَفْوَانُ يَا رَسُولَ اللَّهِ مَا بَلَغَ رِدَائِي أَنْ يُقْطَعَ فِيهِ رَجُلٌ قَالَ هَلَّا كَانَ هَذَا قَبْلَ أَنْ تَأْتِيَنَا بِهِقَالَ أَبُو عَبْد الرَّحْمَنِ أَشْعَثُ ضَعِيفٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hisyam yaitu Ibnu Abu Khiyarah] telah menceritakan kepada kami [Al Fadhl yaitu Ibnu Al 'Ala` Al Kufi] telah menceritakan kepada kami [Asy'ats] dari [Ikrimah] dari [Ibnu Abbas], dia berkata; \"Shafwan pernah tidur di masjid sedang selendangnya berada di bawahnya kemudian selendang terebut dicuri. Dia kemudian bangun tetapi orang yang mencuri telah pergi. Lalu dia mengejarnya dan menangkapnya serta membawanya kepada Nabi shallallahu 'alaihi wasallam. Lalu beliau memerintahkannya agar dipotong tangannya. Shafwan berkata; \"Wahai Rasulullah, selendangku tidaklah sampai membuat orang tersebut harus dipotong tangannya.\" Maka beliau bersabda: \"Kenapa ini tidak terjadi sebelum engkau membawanya kepadaku?\" Abu Abdur Rahman berkata; Asy'ats adalah lemah. "
            },
            {
                "number": 4584,
                "arab": "أَخْبَرَنِي أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ قَالَ حَدَّثَنَا عَمْرٌو عَنْ أَسْبَاطٍ عَنْ سِمَاكٍ عَنْ حُمَيْدٍ ابْنِ أُخْتِ صَفْوَانَ عَنْ صَفْوَانَ بْنِ أُمَيَّةَ قَالَكُنْتُ نَائِمًا فِي الْمَسْجِدِ عَلَى خَمِيصَةٍ لِي ثَمَنُهَا ثَلَاثُونَ دِرْهَمًا فَجَاءَ رَجُلٌ فَاخْتَلَسَهَا مِنِّي فَأُخِذَ الرَّجُلُ فَأُتِيَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِهِ لِيُقْطَعَ فَأَتَيْتُهُ فَقُلْتُ أَتَقْطَعُهُ مِنْ أَجْلِ ثَلَاثِينَ دِرْهَمًا أَنَا أَبِيعُهُ وَأُنْسِئُهُ ثَمَنَهَا قَالَ فَهَلَّا كَانَ هَذَا قَبْلَ أَنْ تَأْتِيَنِي بِهِ",
                "id": "Telah mengabarkan kepadaku [Ahmad bin Utsman bin Hakim] telah menceritakan kepada kami ['Amru] dari [Asbath] dari [Simak] dari [Humaid] anak saudara wanita Shafwan dari [Shafwan bin Umayyah], dia berkata; \"Saya pernah tidur di masjid di atas bajuku yang harganya tiga puluh dirham, kemudian datang seorang laki-laki dan mencurinya dariku. Lalu orang tersebut ditangkap dan dibawa kepada Nabi shallallahu 'alaihi wasallam. Beliau memerintahkan agar tangannya dipotong, Lalu saya mendatangi beliau seraya berkata; \"Apakah Tuan akan memotongnya karena tiga puluh dirham? saya menjualnya dan menghutangkan harganya. Beliau bersabda: \"Kenapa hal ini tidak terjadi (kau katakana) sebelum engkau membawanya kepadaku?\""
            },
            {
                "number": 4585,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحِيمِ قَالَ حَدَّثَنَا أَسَدُ بْنُ مُوسَى قَالَ حَدَّثَنَا وَذَكَرَ حَمَّادُ بْنُ سَلَمَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ صَفْوَانَ بْنِ أُمَيَّةَأَنَّهُ سُرِقَتْ خَمِيصَتُهُ مِنْ تَحْتِ رَأْسِهِ وَهُوَ نَائِمٌ فِي مَسْجِدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخَذَ اللِّصَّ فَجَاءَ بِهِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِقَطْعِهِ فَقَالَ صَفْوَانُ أَتَقْطَعُهُ قَالَ فَهَلَّا قَبْلَ أَنْ تَأْتِيَنِي بِهِ تَرَكْتَهُ",
                "id": "Telah mengkhabarkan kepada kami [Muhammad bin Abdullah bin Abdur Rahim], dia berkata; telah menceritakan kepada kami [Asad bin Musa], dia berkata; telah menceritakan dan menyebutkan kepada kami [Hammad bin Salamah] dari ['Amr bin Dinar] dari [Thawus] dari [Shafwan bin Umayyah] bahwa pakaiannya dicuri dari kepalanya ketika dia sedang tidur di masjid Nabi shallallahu 'alaihi wasallam. Kemudian dia menangkap pencuri tersebut dan membawanya kepada Nabi shallallahu 'alaihi wasallam, lalu beliau memerintahkan agar dipotong tangannya. Kemudian Shafwan berkata; \"Apakah Tuan akan memotong tangannya?\" Beliau bersabda: \"Tidakkah engkau membiarkannya sebelum engkau membawanya kepadaku?\" "
            },
            {
                "number": 4586,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ هَاشِمٍ قَالَ حَدَّثَنَا الْوَلِيدُ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَعَافَوْا الْحُدُودَ قَبْلَ أَنْ تَأْتُونِي بِهِ فَمَا أَتَانِي مِنْ حَدٍّ فَقَدْ وَجَبَ",
                "id": "Telah mengkhabarkan kepada kami [Muhammad bin Hasyim], dia berkata; telah menceritakan kepada kami [Al Walid], dia berkata; telah menceritakan kepada kami [Ibnu Juraij] dari ['Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Saling memaafkanlah kalian dari hukuman sebelum kalian mendatangiku karena hukuman yang telah sampai kepadaku wajib dilaksanakan.\""
            },
            {
                "number": 4587,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ امْرَأَةً مَخْزُومِيَّةً كَانَتْ تَسْتَعِيرُ الْمَتَاعَ فَتَجْحَدُهُ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَطْعِ يَدِهَا",
                "id": "Telah mengkhabarkan kepada kami [Mahmud bin Ghailan], dia berkata; telah menceritakan kepada kami [Abdur Razzaq], dia berkata; telah memberitakan kepada kami [Ma'mar] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar radliallahu 'anhuma] bahwa seorang wanita dari Bani Makhzum meminjam barang, lalu dia mengingkarinya, kemudian Nabi shallallahu 'alaihi wasallam memerintahkan untuk memotong tangannya."
            },
            {
                "number": 4588,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَكَانَتْ امْرَأَةٌ مَخْزُومِيَّةٌ تَسْتَعِيرُ مَتَاعًا عَلَى أَلْسِنَةِ جَارَاتِهَا وَتَجْحَدُهُ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَطْعِ يَدِهَا",
                "id": "Telah mengkhabarkan kepada kami [Ishaq bin Ibrahim], dia berkata; telah memberitakan kepada kami [Abdur Razzaq], dia berkata; telah memberitakan kepada kami [Ma'mar] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar radliallahu 'anhuma], dia berkata; \"Ada seorang wanita Makhzum yang meminjam barang melalui lisan beberapa wanita tetangganya, lalu dia mengingkarinya. Kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan agar tangannya dipotong.\" "
            },
            {
                "number": 4589,
                "arab": "أَخْبَرَنَا عُثْمَانُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي الْحَسَنُ بْنُ حَمَّادٍ قَالَ حَدَّثَنَا عَمْرُو بْنُ هَاشِمٍ الْجَنْبِيُّ أَبُو مَالِكٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَاأَنَّ امْرَأَةً كَانَتْ تَسْتَعِيرُ الْحُلِيَّ لِلنَّاسِ ثُمَّ تُمْسِكُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِتَتُبْ هَذِهِ الْمَرْأَةُ إِلَى اللَّهِ وَرَسُولِهِ وَتَرُدَّ مَا تَأْخُذُ عَلَى الْقَوْمِ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُمْ يَا بِلَالُ فَخُذْ بِيَدِهَا فَاقْطَعْهَا",
                "id": "Telah mengkhabarkan kepada kami [Utsman bin Abdullah], dia berkata; telah menceritakan kepadaku [Al Hasan bin Hammad], dia berkata; telah menceritakan kepada kami ['Amr bin Hasyim Al Janbi Abu Malik] dari ['ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar radliallahu 'anhuma] bahwa ada seorang wanita meminjam perhiasan milik orang kemudian ia menahannya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wanita ini hendaknya bertaubat kepada Allah dan RasulNya serta mengembalikan apa yang telah dia ambil dari orang-orang tersebut.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berdirilah wahai Bilal ambil tangannya lalu potonglah.\""
            },
            {
                "number": 4590,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْدَانَ بْنِ عِيسَى قَالَ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ قَالَ حَدَّثَنَا مَعْقِلٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ امْرَأَةً مِنْ بَنِي مَخْزُومٍ سَرَقَتْ فَأُتِيَ بِهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَاذَتْ بِأُمِّ سَلَمَةَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ كَانَتْ فَاطِمَةَ بِنْتَ مُحَمَّدٍ لَقَطَعْتُ يَدَهَا فَقُطِعَتْ يَدُهَا",
                "id": "Telah mengkhabarkan kepada kami [Muhammad bin Ma'dan bin Isa], dia berkata; telah menceritakan kepada kami [Al Hasan bin Al A'yan], dia berkata; telah menceritakan kepada kami [Ma'qil] dari [Abu Az Zubair] dari [Jabir] bahwa seorang wanita dari Bani Makhzum mencuri, kemudian dihadapkan kepada Nabi shallallahu 'alaihi wasallam. Kemudian dia meminta perlindungan kepada Ummu Salamah. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seandainya dia adalah Fathimah binti Muhammad niscaya akan saya potong tangannya.\" Kemudian tangan wanita tersebut dipotong. "
            },
            {
                "number": 4591,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ سَعِيدِ بْنِ يَزِيدَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِأَنَّ امْرَأَةً مِنْ بَنِي مَخْزُومٍ اسْتَعَارَتْ حُلِيًّا عَلَى لِسَانِ أُنَاسٍ فَجَحَدَتْهَا فَأَمَرَ بِهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُطِعَتْأَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ قَالَ حَدَّثَنَا هَمَّامٌ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ دَاوُدَ بْنِ أَبِي عَاصِمٍ أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ حَدَّثَهُ نَحْوَهُ",
                "id": "Telah mengkhabarkan kepada kami [Muhammad bin Al Mutsanna], dia berkata; telah menceritakan kepada kami [Mu'adz bin Hisyam], dia berkata; telah menceritakan kepada kami [ayahku] dari [Qatadah] dari [Sa'id bin Yazid] dari [Sa'id bin Al Musayyab] bahwa seorang wanita dari Bani Makhzum meminjam perhiasan melalui lisan orang-orang, kemudian dia mengingkarinya. Lalu Nabi shallallahu 'alaihi wasallam memerintahkan untuk memotong tangannya. Telah mengkhabarkan kepada kami [Muhammad bin Al Mutsanna], dia berkata; telah menceritakan kepada kami [Abdus Shamad], dia berkata; telah menceritakan kepada kami [Hammam], dia berkata; telah menceritakan kepada kami [Qatadah] dari [Dawud bin Abu 'Ashim] bahwa [Sa'id bin Al Musayyab] bercerita kepadanya semisal itu."
            },
            {
                "number": 4592,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا سُفْيَانُ قَالَكَانَتْ مَخْزُومِيَّةٌ تَسْتَعِيرُ مَتَاعًا وَتَجْحَدُهُ فَرُفِعَتْ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكُلِّمَ فِيهَا فَقَالَ لَوْ كَانَتْ فَاطِمَةَ لَقَطَعْتُ يَدَهَاقِيلَ لِسُفْيَانَ مَنْ ذَكَرَهُ قَالَ أَيُّوبُ بْنُ مُوسَى عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ إِنْ شَاءَ اللَّهُ تَعَالَى",
                "id": "Telah mengkhabarkan kepada kami [Ishaq bin Ibrahim], dia berkata; telah memberitakan kepada kami [Sufyan], ia berkata; \"Ada seorang wanita Makhzum yang meminjam barang dan dia mengingkarinya. Kemudian dia dilaporkan kepada Rasulullah shallallahu 'alaihi wasallam dan dibicarakan mengenai wanita tersebut. Kemudian beliau bersabda: \"Sendainya dia adalah Fathimah niscaya saya potong tangannya.\" Dikatakan kepada Sufyan; 'Siapakah yang menyebutkannya?\" Dia berkata; \" [Ayyub bin Musa] dari [Az Zuhri] dari ['Urwah] dari [Aisyah] insya Allah Ta'ala.\" "
            },
            {
                "number": 4593,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ امْرَأَةً سَرَقَتْ فَأُتِيَ بِهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا مَنْ يَجْتَرِئُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا أَنْ يَكُونَ أُسَامَةَ فَكَلَّمُوا أُسَامَةَ فَكَلَّمَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أُسَامَةُ إِنَّمَا هَلَكَتْ بَنُو إِسْرَائِيلَ حِينَ كَانُوا إِذَا أَصَابَ الشَّرِيفُ فِيهِمْ الْحَدَّ تَرَكُوهُ وَلَمْ يُقِيمُوا عَلَيْهِ وَإِذَا أَصَابَ الْوَضِيعُ أَقَامُوا عَلَيْهِ لَوْ كَانَتْ فَاطِمَةَ بِنْتَ مُحَمَّدٍ لَقَطَعْتُهَا",
                "id": "Telah mengkhabarkan kepada kami [Muhammad bin Manshur], dia berkata; telah menceritakan kepada kami [Sufyan] dari [Ayyub bin Musa] dari [Az Zuhri] dari ['Urwah] dari [Aisyah] bahwa ada seorang wanita yang mencuri kemudian dia dihadapkan kepada Nabi shallallahu 'alaihi wasallam, kemudian mereka berkata; \"Tidak ada orang yang berani berbicara kepada Rasulullah shallallahu 'alaihi wasallam kecuali Usamah. Kemudian mereka berbicara kepada Usamah. Maka Usamahpun berbicara kepada beliau. Nabi shallallahu 'alaihi wasallam kemudian bersabda: \"Wahai Usamah, sesungguhnya orang-orang Bani Israil binasa ketika orang mulia di antara mereka terkena hukuman had, mereka membiarkannya dan tidak menegakkan hukuman kepadanya, dan apabila hukuman tersebut mengenai orang yang rendah maka mereka menegakkan hukuman atasnya. Seandainya dia adalah Fathimah binti Muhammad niscaya saya akan memotong tangannya.\""
            },
            {
                "number": 4594,
                "arab": "أَخْبَرَنَا رِزْقُ اللَّهِ بْنُ مُوسَى قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَارِقٍ فَقَطَعَهُ قَالُوا مَا كُنَّا نُرِيدُ أَنْ يَبْلُغَ مِنْهُ هَذَا قَالَ لَوْ كَانَتْ فَاطِمَةَ لَقَطَعْتُهَا",
                "id": "Telah mengkhabarkan kepada kami [Rizqullah bin Musa], dia berkata; telah menceritakan kepada kami [Sufyan] dari [Ayyub bin Musa] dari [Az Zuhri] dari ['Urwah] dari [Aisyah], dia berkata; Telah dihadapkan seorang pencuri kepada Nabi shallallahu 'alaihi wasallam kemudian beliau memotong tangannya. Mereka mengatakan; \"Kami tidak ingin hal ini terjadi padanya.\" Beliau bersabda: \"Seandainya dia adalah Fathimah niscaya saya akan memotong tangannya.\""
            },
            {
                "number": 4595,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ سَعِيدِ بْنِ مَسْرُوقٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ امْرَأَةً سَرَقَتْ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا مَا نُكَلِّمُهُ فِيهَا مَا مِنْ أَحَدٍ يُكَلِّمُهُ إِلَّا حِبُّهُ أُسَامَةُ فَكَلَّمَهُ فَقَالَ يَا أُسَامَةُ إِنَّ بَنِي إِسْرَائِيلَ هَلَكُوا بِمِثْلِ هَذَا كَانَ إِذَا سَرَقَ فِيهِمْ الشَّرِيفُ تَرَكُوهُ وَإِنْ سَرَقَ فِيهِمْ الدُّونُ قَطَعُوهُ وَإِنَّهَا لَوْ كَانَتْ فَاطِمَةَ بِنْتَ مُحَمَّدٍ لَقَطَعْتُهَا",
                "id": "Telah mengkhabarkan kepada kami [Ali bin Sa'id bin Masruq], dia berkata; telah menceritakan kepada kami [Yahya bin Zakariya bin Abu Zaidah] dari [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['Urwah] dari [Aisyah] bahwa pada zaman Rasulullah shallallahu 'alaihi wasallam ada seorang wanita yang mencuri, kemudian orang-orang berkata; \"Kami tidak akan berbicara kepada beliau mengenainya, tidak ada seorangpun yang bias berbicara kepada beliau kecuali orang yang dicintai beliau yaitu Usamah. Kemudian Usamah berbicara kepada beliau. Beliau bersabda: \"Wahai Usamah, sesungguhnya Bani Israil binasa karena kejadian seperti ini. Apabila ada orang mulia di antara mereka mencuri maka mereka membiarkannya tapi apabila ada orang rendah di antara mereka mencuri, mereka memotong tangannya. Sesungguhnya apabila dia adalah Fathimah binti Muhammad niscaya saya potong tangannya.\""
            },
            {
                "number": 4596,
                "arab": "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ قَالَ أَخْبَرَنِي أَبِي عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْاسْتَعَارَتْ امْرَأَةٌ عَلَى أَلْسِنَةِ أُنَاسٍ يُعْرَفُونَ وَهِيَ لَا تُعْرَفُ حُلِيًّا فَبَاعَتْهُ وَأَخَذَتْ ثَمَنَهُ فَأُتِيَ بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَعَى أَهْلُهَا إِلَى أُسَامَةَ بْنِ زَيْدٍ فَكَلَّمَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا فَتَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُكَلِّمُهُ ثُمَّ قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَشْفَعُ إِلَيَّ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ فَقَالَ أُسَامَةُ اسْتَغْفِرْ لِي يَا رَسُولَ اللَّهِ ثُمَّ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشِيَّتَئِذٍ فَأَثْنَى عَلَى اللَّهِ عَزَّ وَجَلَّ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنَّمَا هَلَكَ النَّاسُ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ الشَّرِيفُ فِيهِمْ تَرَكُوهُ وَإِذَا سَرَقَ الضَّعِيفُ فِيهِمْ أَقَامُوا عَلَيْهِ الْحَدَّ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَا ثُمَّ قَطَعَ تِلْكَ الْمَرْأَةَ",
                "id": "Telah mengkhabarkan kepada kami [Imran bin Bakkar], dia berkata; telah menceritakan kepada kami [Bisyr bin Syu'aib], dia berkata; telah mengkhabarkan kepadaku [ayahku] dari [Az Zuhri] dari ['Urwah] dari [Aisyah], dia berkata; \"Seorang wanita meminjam perhiasan melalui lisan orang-orang yang dikenal sedang dia tidak dikenal. Lalu dia jual perhiasan tersebut dan ia ambil uangnya. Kemudian dia dihadapkan kepada Rasulullah shallallahu 'alaihi was sallam. Lalu keluarganya berusaha menemui Usamah bin Zaid. Usamah kemudian berbicara kepada Rasulullah shallallahu 'alaihi was sallam tentang wanita tersebut. Maka meronalah wajah Rasulullah shallallahu 'alaihi was sallam sementara Usamah berbicara. Kemudian Rasulullah shallallahu 'alaihi was sallam bersabda; \"Apakah kamu hendak meminta syafa'at (keringanan) kepadaku atas hokum yang ditetapkan Allah?\" Usamah berkata; \"Mohonkanlah ampunan untukku, wahai Rasul Allah.\" Sontak Rasulullah shallallahu 'alaihi was sallam berdiri lalu memuji pada Alloh 'azza wajalla dengan pujian yang menjadi hakNya kemudian bersabda, \"Amma ba'du, Sesungguhnya orang-orang sebelum kalian binasa karena apabila ada orang yang mulia di antara mereka mencuri mereka membiarkannya, sedang apabila orang yang lemah di antara mereka mencuri mereka tegakkan had (hukuman) atasnya. Demi Dzat yang jiwa Muhammad ada di tanganNya, seandainya Fathimah binti Muhammad mencuri niscaya aku potong tangannya.\" Lalu dipotonglah tangan wanita tersebut."
            },
            {
                "number": 4597,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ قُرَيْشًا أَهَمَّهُمْ شَأْنُ الْمَخْزُومِيَّةِ الَّتِي سَرَقَتْ فَقَالُوا مَنْ يُكَلِّمُ فِيهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا وَمَنْ يَجْتَرِئُ عَلَيْهِ إِلَّا أُسَامَةُ بْنُ زَيْدٍ حِبُّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَلَّمَهُ أُسَامَةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَشْفَعُ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ ثُمَّ قَامَ فَخَطَبَ فَقَالَ إِنَّمَا هَلَكَ الَّذِينَ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمْ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ فِيهِمْ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ وَايْمُ اللَّهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَا",
                "id": "Telah mengkhabarkan kepada kami [Qutaibah], dia berkata; telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Urwah] dari [Aisyah] bahwa orang-orang Quraisy disibukkan oleh perkara wanita Makhzum yang mencuri, kemudian mereka berkata; \"Siapakah yang akan berbicara kepada Rasulullah shallallahu 'alaihi wasallam?\" Orang-orang berkata; \"Tidak ada yang berani kecuali Usamah bin Zaid, orang yang dicintai Rasulullah shallallahu 'alaihi wasallam.\" Kemudian Usamah berbicara kepada beliau. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah engkau akan memberikan pertolongan dalam perkara had di antara had-had Allah?\" kemudian beliau berdiri lalu berkhutbah, beliau bersabda: \"Sesungguhnya orang-orang sebelum kalian binasa karena apabila terdapat orang mulia di antara mereka yang mencuri maka mereka membiarkannya sedang apabila terdapat orang yang lemah di antara mereka mencuri maka mereka menegakkan hukuman atasnya. Demi Allah apabila Fathimah binti Muhammad mencuri niscaya saya potong tangannya.\" "
            },
            {
                "number": 4598,
                "arab": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ إِسْحَقَ قَالَ حَدَّثَنَا أَبُو الْجَوَّابِ قَالَ حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْسَرَقَتْ امْرَأَةٌ مِنْ قُرَيْشٍ مِنْ بَنِي مَخْزُومٍ فَأُتِيَ بِهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا مَنْ يُكَلِّمُهُ فِيهَا قَالُوا أُسَامَةُ بْنُ زَيْدٍ فَأَتَاهُ فَكَلَّمَهُ فَزَبَرَهُ وَقَالَ إِنَّ بَنِي إِسْرَائِيلَ كَانُوا إِذَا سَرَقَ فِيهِمْ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ الْوَضِيعُ قَطَعُوهُ وَالَّذِي نَفْسِي بِيَدِهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُهَا",
                "id": "Telah mengkhabarkan kepada kami [Abu Bakar bin Ishaq], dia berkata; telah menceritakan kepada kami [Abu Al Jawwab], dia berkata; telah menceritakan kepada kami ['Ammar bin Ruzaiq] dari [Muhammad bin Abdur Rahman bin Abu Laila] dari [Isma'il bin Umayyah] dari [Muhammad bin Muslim] dari ['Urwah] dari [Aisyah], dia berkata; \"Ada seorang wanita dari suku Quraisy dari Bani Makhzum mencuri lalu dihadapkan kepada Nabi shallallahu 'alaihi wasallam, kemudian mereka berkata; \"Siapakah yang berbicara kepada beliau mengenainya? Yang lainnya mengatakan; \"Usamah bin Zaid.\" Kemudian Usamah datang dan berbicara kepada beliau. Kemudian beliau menghardiknya seraya bersabda: \"Sesungguhnya Bani Isroil, apabila ada orang mulia di antara mereka mencuri maka mereka membiarkannya sedang apabila ada orang yang rendah di antara mereka mencuri, mereka menegakkan hukuman atasnya. Demi Allah, apabila Fathimah binti Muhammad mencuri niscaya saya potong tangannya.\" "
            },
            {
                "number": 4599,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ جَبَلَةَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى بْنِ أَعْيَنَ قَالَ حَدَّثَنَا أَبِي عَنْ إِسْحَقَ بْنِ رَاشِدٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ قُرَيْشًا أَهَمَّهُمْ شَأْنُ الْمَخْزُومِيَّةِ الَّتِي سَرَقَتْ فَقَالُوا مَنْ يُكَلِّمُ فِيهَا قَالُوا مَنْ يَجْتَرِئُ عَلَيْهِ إِلَّا أُسَامَةُ بْنُ زَيْدٍ حِبُّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَلَّمَهُ أُسَامَةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا هَلَكَ الَّذِينَ مَنْ قَبْلِكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمْ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ فِيهِمْ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ وَايْمُ اللَّهِ لَوْ سَرَقَتْ فَاطِمَةُ بِنْتُ مُحَمَّدٍ لَقَطَعْتُ يَدَهَا",
                "id": "Telah mengkhabarkan kepada kami [Muhammad bin Jabalah], dia berkata; telah menceritakan kepada kami [Muhammad bin Musa bin A'yan], ia berkata; telah menceritakan kepada kami [ayahku] dari [Ishaq bin Rasyid] dari [Az Zuhri] dari ['Urwah] dari [Aisyah] bahwa orang-orang Quraisy disibukkan oleh perkara wanita Makhzum yang mencuri, kemudian mereka berkata; \"Siapakah yang akan berbicara kepada Rasulullah shallallahu 'alaihi wasallam?\" Orang-orang yang lain mengatakan; \"Tidak ada yang berani kecuali Usamah bin Zaid orang yang dicintai Rasulullah shallallahu 'alaihi wasallam.\" Kemudian Usamah berbicara kepada beliau. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya orang-orang sebelum kalian binasa karena apabila terdapat orang mulia di antara mereka yang mencuri maka mereka membiarkannya sedang apabila terdapat orang yang lemah di antara mereka mencuri maka mereka menegakkan hukuman atasnya. Demi Allah, apabila Fathimah binti Muhammad mencuri niscaya saya potong tangannya.\""
            },
            {
                "number": 4600,
                "arab": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ أَخْبَرَهُ عَنْ عَائِشَةَأَنَّ امْرَأَةً سَرَقَتْ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ الْفَتْحِ فَأُتِيَ بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَلَّمَهُ فِيهَا أُسَامَةُ بْنُ زَيْدٍ فَلَمَّا كَلَّمَهُ تَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَشْفَعُ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ فَقَالَ لَهُ أُسَامَةُ اسْتَغْفِرْ لِي يَا رَسُولَ اللَّهِ فَلَمَّا كَانَ الْعَشِيُّ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَثْنَى عَلَى اللَّهِ عَزَّ وَجَلَّ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ أَمَّا بَعْدُ إِنَّمَا هَلَكَ النَّاسُ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمْ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ فِيهِمْ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ ثُمَّ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ قَطَعْتُ يَدَهَا",
                "id": "Telah mengkhabarkan kepada kami [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, dari [Ibnu Wahb], dia berkata; telah mengkhabarkan kepadaku [Yunus] dari [Ibnu Syihab] bahwa [Urwah bin Az Zubair] telah mengkhabarkan kepadanya dari [Aisyah] bahwa seorang wanita mencuri pada zaman Rasulullah shallallahu 'alaihi wasallam pada saat terjadi perang penaklukan Mekkah. Kemudian dia dihadapkan kepada Rasulullah shallallahu 'alaihi wasallam. Lalu Usamah bin Zaid berbicara kepada beliau mengenai wanita tersebut. Setelah Usamah berbicara wajah Rasulullah shallallahu 'alaihi wasallam berubah dan beliau bersabda: \"Apakah kamu akan memberikan pertolongan dalam permasalahan hukuman di antara hukuman-hukuman Allah?\" Usamah berkata; \"Mintakanlah ampunan untukku wahai Rasulullah!\" Kemudian setelah sore hari Rasulullah shallallahu 'alaihi wasallam berdiri kemudian memuji Allah 'azza wajalla dengan pujian yang menjadi hakNya kemudian bersabda: \"Sesungguhnya orang-orang sebelum kalian binasa karena apabila ada orang mulia di antara mereka yang mencuri maka mereka membiarkannya sedang apabila ada orang yang lemah di antara mereka mencuri maka mereka menegakkan hukuman atasnya. Demi Allah, apabila Fathimah binti Muhammad mencuri niscaya saya potong tangannya.\""
            },
            {
                "number": 4601,
                "arab": "أَخْبَرَنَا سُوَيْدٌ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِأَنَّ امْرَأَةً سَرَقَتْ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ الْفَتْحِ مُرْسَلٌ فَفَزِعَ قَوْمُهَا إِلَى أُسَامَةَ بْنِ زَيْدٍ يَسْتَشْفِعُونَهُ قَالَ عُرْوَةُ فَلَمَّا كَلَّمَهُ أُسَامَةُ فِيهَا تَلَوَّنَ وَجْهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَتُكَلِّمُنِي فِي حَدٍّ مِنْ حُدُودِ اللَّهِ قَالَ أُسَامَةُ اسْتَغْفِرْ لِي يَا رَسُولَ اللَّهِ فَلَمَّا كَانَ الْعَشِيُّ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطِيبًا فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنَّمَا هَلَكَ النَّاسُ قَبْلَكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمْ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ فِيهِمْ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَا ثُمَّ أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِ تِلْكَ الْمَرْأَةِ فَقُطِعَتْ فَحَسُنَتْ تَوْبَتُهَا بَعْدَ ذَلِكَقَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا وَكَانَتْ تَأْتِينِي بَعْدَ ذَلِكَ فَأَرْفَعُ حَاجَتَهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengkhabarkan kepada kami [Suwaid], dia berkata; telah memberitakan kepada kami [Abdullah] dari [Yunus] dari [Az Zuhri], dia berkata; telah mengkhabarkan kepadaku ['Urwah bin Az Zubair] bahwa seorang wanita pada zaman Rasulullah shallallahu 'alaihi wasallam mencuri pada saat terjadi perang Penaklukan Mekkah, Kemudian kaumnya datang kepada Usamah bin Zaid meminta pertolongan kepadanya. Urwah berkata; \"Kemudian tatkala Usamah berbicara kepadanya mengenai wanita tersebut wajah Rasulullah shallallahu 'alaihi wasallam berubah dan beliau bersabda: \"Apakah engkau mengajakku bicara mengenai hukuman di antara hukuman-hukuman Allah?\" Usamah berkata; \"Mintakanlah ampunan untukku wahai Rasulullah! Kemudian tatkala sore hari Rasulullah shallallahu 'alaihi wasallam berdiri dan berkhutbah, beliau memuji Allah dengan pujian yang menjadi hakNya. Kemudian beliau bersabda: \"Adapun selanjutnya, sesungguhnya orang-orang sebelum kalian binasa karena apabila ada orang mulia diantara mereka yang mencuri maka mereka membiarkannya dan apabila ada orang lemah di antara mereka yang mencuri maka mereka menegakkan hukuman kepadanya. Demi Dzat, yang jiwa Muhammad ada di tanganNya, seandainya Fathimah binti Muhammad mencuri niscaya saya potong tangannya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan agar tangan wanita tersebut dipotong. Kemudian setelah itu dia memperbaiki taubatnya. [Aisyah radliallahu 'anha] berkata; \"Setelah itu dia datang kepadaku dan saya laporkan keperluannya kepada Rasulullah shallallahu 'alaihi wasallam.\" "
            },
            {
                "number": 4602,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عِيسَى بْنِ يَزِيدَ قَالَ حَدَّثَنِي جَرِيرُ بْنُ يَزِيدَ أَنَّهُ سَمِعَ أَبَا زُرْعَةَ بْنَ عَمْرِو بْنِ جَرِيرٍ يُحَدِّثُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدٌّ يُعْمَلُ فِي الْأَرْضِ خَيْرٌ لِأَهْلِ الْأَرْضِ مِنْ أَنْ يُمْطَرُوا ثَلَاثِينَ صَبَاحًا",
                "id": "Telah mengkhabarkan kepada kami [Suwaid bin Nashr], dia berkata; telah memberitakan kepada kami [Abdullah] dari [Isa bin Yazid], dia berkata; telah menceritakan kepadaku [Jarir bin Yazid] bahwa dia mendengar [Abu Zur'ah bin 'Amr bin Jarir] menceritakan bahwa dia mendengar [Abu Hurairah] berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hukuman yang dilakukan di dunia lebih baik bagi penduduk bumi daripada mereka dihujani selama tiga puluh hari setiap pagi.\""
            },
            {
                "number": 4603,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ قَالَ أَنْبَأَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ عَنْ جَرِيرِ بْنِ يَزِيدَ عَنْ أَبِي زُرْعَةَ قَالَ قَالَ أَبُو هُرَيْرَةَإِقَامَةُ حَدٍّ بِأَرْضٍ خَيْرٌ لِأَهْلِهَا مِنْ مَطَرِ أَرْبَعِينَ لَيْلَةً",
                "id": "Telah mengkhabarkan kepada kami ['Amr bin Zurarah], dia berkata; telah memberitakan kepada kami [Isma'il], dia berkata; telah menceritakan kepada kami [Yunus bin 'Ubaid] dari [Jarir bin Yazid] dari [Abu Zur'ah], dia berkata; [Abu Hurairah] berkata; \"Menegakkan hukuman di bumi lebih baik bagi penduduknya daripada hujan selama empat puluh malam.\""
            },
            {
                "number": 4604,
                "arab": "أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مَخْلَدٌ قَالَ حَدَّثَنَا حَنْظَلَةُ قَالَ سَمِعْتُ نَافِعًا قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُقَطَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مِجَنٍّ قِيمَتُهُ خَمْسَةُ دَرَاهِمَ كَذَا قَالَ",
                "id": "Telah mengkhabarkan kepada kami [Abdul Hamid bin Muhammad], dia berkata; telah menceritakan kepada kami [Makhlad], dia berkata; telah menceritakan kepada kami [Hanzhalah], dia berkata; \"Saya mendengar [Nafi'] berkata; \"Saya mendengar [Abdullah bin Umar] berkata; \"Rasulullah shallallahu 'alaihi wasallam memotong tangan pencuri tameng yang harganya lima dirham.\" Begitulah ia berkata. "
            },
            {
                "number": 4605,
                "arab": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ حَدَّثَنَا حَنْظَلَةُ أَنَّ نَافِعًا حَدَّثَهُمْ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَقَطَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مِجَنٍّ ثَمَنُهُ ثَلَاثَةُ دَرَاهِمَقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا الصَّوَابُ",
                "id": "Telah mengkhabarkan kepada kami [Yunus bin Abdul A'la], dia berkata; telah menceritakan kepada kami [Ibnu Wahb], dia berkata; telah menceritakan kepada kami [Hanzhalah] bahwa [Nafi'] menceritakan kepada mereka bahwa [Abdullah bin Umar] berkata; \"Rasulullah shallallahu 'alaihi wasallam memotong tangan karena mencuri tameng yang harganya tiga dirham.\" Abu Abdur Rahman berkata; \"Ini adalah yang benar.\" "
            },
            {
                "number": 4606,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطَعَ فِي مِجَنٍّ ثَمَنُهُ ثَلَاثَةُ دَرَاهِمَ",
                "id": "Telah mengkhabarkan kepada kami [Qutaibah] dari [Malik] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam memotong tangan pencuri tameng yang harganya tiga dirham. "
            },
            {
                "number": 4607,
                "arab": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ حَدَّثَنِي إِسْمَعِيلُ بْنُ أُمَيَّةَ أَنَّ نَافِعًا حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ حَدَّثَهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطَعَ يَدَ سَارِقٍ سَرَقَ تُرْسًا مِنْ صُفَّةِ النِّسَاءِ ثَمَنُهُ ثَلَاثَةُ دَرَاهِمَ",
                "id": "Telah mengkhabarkan kepada kami [Yusuf bin Sa'id], dia berkata; telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij], dia berkata; telah menceritakan kepadaku [Isma'il bin Umayyah] bahwa [Nafi'] telah bercerita kepadanya bahwa [Abdullah bin Umar] telah menceritakan kepadanya bahwa Nabi shallallahu 'alaihi wasallam memotong tangan pencuri yang pencuri tameng dari rak kaum wanita yang harganya tiga dirham."
            },
            {
                "number": 4608,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ عَنْ سُفْيَانَ عَنْ أَيُّوبَ وَإِسْمَعِيلُ بْنُ أُمَيَّةَ وَعَبْدُ اللَّهِ وَمُوسَى بْنُ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطَعَ فِي مِجَنٍّ قِيمَتُهُ ثَلَاثَةُ دَرَاهِمَ",
                "id": "Telah mengkhabarkan kepadaku [Muhammad bin Isma'il bin Ibrahim], dia berkata; telah menceritakan kepada kami [Abu Nu'aim] dari [Sufyan] dari [Ayyub] dan [Isma'il bin Umayyah] dan [Abdullah] serta [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam memotong tangan pencuri tameng yang harganya tiga dirham. "
            },
            {
                "number": 4609,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ قَالَ حَدَّثَنَا أَبُو عَلِيٍّ الْحَنَفِيُّ قَالَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطَعَ فِي مِجَنٍّقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا خَطَأٌ",
                "id": "Telah mengkhabarkan kepada kami [Abdullah bin Ash Shabbah], dia berkata; telah menceritakan kepada kami [Abu Ali Al Hanafi], dia berkata; telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam memotong tangan pencuri tameng. Abu Abdurrahman berkata; \"Hadits ini salah.\""
            },
            {
                "number": 4610,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْوَلِيدِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَقَطَعَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فِي مِجَنٍّ قِيمَتُهُ خَمْسَةُ دَرَاهِمَهَذَا الصَّوَابُ",
                "id": "Telah mengkhabarkan kepada kami [Ahmad bin Nashr], dia berkata; telah menceritakan kepada kami [Abdullah bin Al Walid], dia berkata; telah menceritakan kepada kami [Sufyan] dari [Syu'bah] dari [Qatadah] dari [Anas], dia berkata; Abu Bakar radliallahu 'anhu memotong tangan pencuri tameng yang harganya lima dirham. Ini adalah yang benar."
            },
            {
                "number": 4611,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ أَبِي دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَنَسًا يَقُولُسَرَقَ رَجُلٌ مِجَنًّا عَلَى عَهْدِ أَبِي بَكْرٍ فَقُوِّمَ خَمْسَةَ دَرَاهِمَ فَقُطِعَ",
                "id": "Telah mengkhabarkan kepada kami [Muhammad bin Al Mutsanna] dari [Abu Daud], dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Qatadah], dia berkata; \"Saya mendengar [Anas] berkata; \"Seorang laki-laki mencuri tameng pada zaman Abu Bakar, lalu barang tersebut dinilai seharga lima dirham. Maka dipotonglah tangan pencuri tersebut.\""
            },
            {
                "number": 4612,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ عَنْ حَفْصِ بْنِ حَسَّانَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاقَطَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رُبْعِ دِينَارٍ",
                "id": "Telah mengkhabarkan kepada kami [Qutaibah], dia berkata; telah menceritakan kepada kami [Ja'far bin Sulaiman] dari [Hafsh bin Hassan] dari [Az Zuhri] dari ['Urwah] dari [Aisyah radliallahu 'anha]; \"Rasulullah shallallahu 'alaihi wasallam memotong tangan pencuri barang yang harganya empat dinar.\""
            },
            {
                "number": 4613,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا حِبَّانُ بْنُ مُوسَى قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ قَالَ قَالَتْ عَمْرَةُ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُقْطَعُ يَدُ السَّارِقِ فِي رُبْعِ دِينَارٍ",
                "id": "Telah mengkhabarkan kepada kami [Muhammad bin Hatim], dia berkata; telah memberitakan kepada kami [Hibban bin Musa], dia berkata; telah menceritakan kepada kami [Abdullah] dari [Yunus] dari [Az Zuhri], dia berkata; telah berkata ['Amrah] dari [Aisyah radliallahu 'anha] dari Rasulullah shallallahu 'alaihi wasallam; dipotong tangan pencuri barang senilai seperempat dinar."
            },
            {
                "number": 4614,
                "arab": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ وَعَمْرَةَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُقْطَعُ يَدُ السَّارِقِ فِي رُبْعِ دِينَارٍ فَصَاعِدًا",
                "id": "Telah berkata [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, dari [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] dari ['Urwah] dan ['Amrah] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dipotong tangan pencuri yang mencuri barang senilai seperempat dinar ke atas.\""
            },
            {
                "number": 4615,
                "arab": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ عَنْ سَعِيدٍ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عَمْرَةَ عَنْ عَائِشَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُقْطَعُ يَدُ السَّارِقِ فِي رُبْعِ دِينَارٍ فَصَاعِدًا",
                "id": "Telah mengkhabarkan kepada kami [Al Hasan bin Muhammad], dia berkata; telah menceritakan kepada kami [Abdul Wahhab] dari [Sa'id] dari [Ma'mar] dari [Az Zuhri] dari ['Amrah] dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Dipotong tangan pencuri yang mencuri barang senilai seperempat dinar ke atas.\""
            },
            {
                "number": 4616,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ مَعْمَرٍ عَنْ ابْنِ شِهَابٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْتُقْطَعُ الْيَدُ فِي رُبْعِ دِينَارٍ فَصَاعِدًا",
                "id": "Telah mengkhabarkan kepada kami [Suwaid bin Nashr], dia berkata; telah memberitakan kepada kami [Abdullah] dari [Ma'mar] dari [Ibnu Syihab] dari ['Amrah] dari [Aisyah], dia berkata; \"Dipotong tangan pencuri sesuatu seharga seperempat dinar ke atas.\" "
            },
            {
                "number": 4617,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَقُتَيْبَةُ بْنُ سَعِيدٍ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُتَيْبَةُ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْطَعُ فِي رُبْعِ دِينَارٍ فَصَاعِدًا",
                "id": "Telah mengkhabarkan kepada kami [Ishaq bin Ibrahim] dan [Qutaibah bin Sa'id] dari [Sufyan] dari [Az Zuhri] dari ['Amrah] dari [Aisyah], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam berkata, Qutaibah berkata; \"Nabi shallallahu 'alaihi wasallam memotong tangan pencuri barang seharga seperempat dinar ke atas.\""
            },
            {
                "number": 4618,
                "arab": "أَخْبَرَنِي يَزِيدُ بْنُ مُحَمَّدِ بْنِ فُضَيْلٍ قَالَ أَنْبَأَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبَانُ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُقْطَعُ يَدُ السَّارِقِ فِي رُبْعِ دِينَارٍ فَصَاعِدًا",
                "id": "Telah mengkhabarkan kepadaku [Yazid bin Muhammad bin Fudhail], dia berkata; telah memberitakan kepada kami [Muslim bin Ibrahim], dia berkata; telah menceritakan kepada kami [Aban], dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari ['Amrah] dari [Aisyah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Dipotong tangan pencuri sesuatu seharga seperempat dinar ke atas.\""
            },
            {
                "number": 4619,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ أَنَّهَا سَمِعَتْ عَائِشَةَ تَقُولُيُقْطَعُ فِي رُبْعِ دِينَارٍ فَصَاعِدًاقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا الصَّوَابُ مِنْ حَدِيثِ يَحْيَى",
                "id": "Telah mengkhabarkan kepada kami [Suwaid bin Nashr], dia berkata; telah memberitakan kepada kami [Abdullah] dari [Yahya bin Sa'id] dari ['Amrah] bahwa dia mendengar [Aisyah] berkata; \"Dipotong tangan pencuri sesuatu seharga seperempat dinar ke atas.\" Abu Abdur Rahman berkata; \"Ini adalah yang benar dari hadits Yahya.\""
            }
        ]
    }
}