{
    "status": true,
    "data": {
        "start": 1342,
        "end": 1490,
        "total": 149,
        "book": "nasai",
        "hadits": [
            {
                "number": 1342,
                "arab": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ وَعَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ حُذَيْفَةَ قَالَاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَضَلَّ اللَّهُ عَزَّ وَجَلَّ عَنْ الْجُمُعَةِ مَنْ كَانَ قَبْلَنَا فَكَانَ لِلْيَهُودِ يَوْمُ السَّبْتِ وَكَانَ لِلنَّصَارَى يَوْمُ الْأَحَدِ فَجَاءَ اللَّهُ عَزَّ وَجَلَّ بِنَا فَهَدَانَا لِيَوْمِ الْجُمُعَةِ فَجَعَلَ الْجُمُعَةَ وَالسَّبْتَ وَالْأَحَدَ وَكَذَلِكَ هُمْ لَنَا تَبَعٌ يَوْمَ الْقِيَامَةِ وَنَحْنُ الْآخِرُونَ مِنْ أَهْلِ الدُّنْيَا وَالْأَوَّلُونَ يَوْمَ الْقِيَامَةِ الْمَقْضِيُّ لَهُمْ قَبْلَ الْخَلَائِقِ",
                "id": "Telah mengabarkan kepada kami [Washil bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Ibnu Fudhail] dari [Abu Malik Al Asyja'i] dari [Abu Hazim] dari [Abu Hurairah] dan dari [Rib'i bin Hirasy] dari [Hudzaifah] mereka berdua berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Allah Azza wa Jalla tidak menghadiahkan hari jumat kepada orang-orang sebelum kita, sehingga orang-orang Yahudi memperoleh hari Sabtu, dan orang-orang Nasrani memperoleh hari Ahad. Kemudian Allah Azza wa Jalla membawa kita dan memberi petunjuk kepada kita untuk memperoleh hari jumat, Sehingga jadilah yang Ia tetapkan hari suci yaitu hari Jum'at, Sabtu dan Ahad. Mereka (Yahudi dan Nasrani) mengikuti kita pada hari kiamat, sementara kita adalah orang terkahir dari penduduk dunia dan orang-orang pertama pada hari kiamat. Hal itu diputuskan bagi mereka sebelum makhluk-makhluk.\" "
            },
            {
                "number": 1343,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ عَبِيدَةَ بْنِ سُفْيَانَ الْحَضْرَمِيِّ عَنْ أَبِي الْجَعْدِ الضَّمْرِيِّ وَكَانَتْ لَهُ صُحْبَةٌعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَرَكَ ثَلَاثَ جُمَعٍ تَهَاوُنًا بِهَا طَبَعَ اللَّهُ عَلَى قَلْبِهِ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Muhammad bin 'Amr] dari ['Abidah bin Sufyan Al Hadhrami] dari [Abul Ja'd Adh-Dhamri] -dia pernah menemani Rasulullah Shalallahu 'Alaihi Wa Sallam- dari Nabi Shalallahu 'Alaihi Wa Sallam, beliau Shalallahu 'Alaihi Wa Sallam bersabda: \"Barangsiapa meninggalkan sholat Jum'at selama tiga kali karena meremehkan, Allah menutup hatinya.\" "
            },
            {
                "number": 1344,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا حَبَّانُ قَالَ حَدَّثَنَا أَبَانُ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ الْحَضْرَمِيِّ بْنِ لَاحِقٍ عَنْ زَيْدٍ عَنْ أَبِي سَلَّامٍ عَنْ الْحَكَمِ بْنِ مِينَاءَ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ وَابْنَ عُمَرَ يُحَدِّثَانِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَهُوَ عَلَى أَعْوَادِ مِنْبَرِهِ لَيَنْتَهِيَنَّ أَقْوَامٌ عَنْ وَدْعِهِمْ الْجُمُعَاتِ أَوْ لَيَخْتِمَنَّ اللَّهُ عَلَى قُلُوبِهِمْ وَلَيَكُونُنَّ مِنْ الْغَافِلِينَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ma'mar] dia berkata; telah menceritakan kepada kami [Habban] dia berkata; telah menceritakan kepada kami [Aban] dia berkata; telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Al Hadhrami bin Lahiq] dari [Zaid] dari [Abu Sallam] dari [Al Hakam bin Mina] bahwasanya ia mendengar [Ibnu 'Abbas] dan [Ibnu 'Umar] menceritakan bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda -beliau di atas mimbar kayunya- \"Kaum-kaum itu tetap saja menghentikan kewajiban (sholat) Jum'at-nya, atau Allah menutup hati mereka dan menjadikannya orang-orang yang lalai!.\" "
            },
            {
                "number": 1345,
                "arab": "أَخْبَرَنِي مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنِي الْمُفَضَّلُ بْنُ فَضَالَةَ عَنْ عَيَّاشِ بْنِ عَبَّاسٍ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ حَفْصَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَوَاحُ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ",
                "id": "Telah mengabarkan kepadaku [Mahmud bin Ghailan] dia berkata; telah menceritakan kepada kami [Al Walid bin Muslim] dia berkata; telah menceritakan kepadaku [Al Mufadhdhal bin Fadhalah] dari ['Ayyasy bin 'Abbas] dari [Bukair bin Al Asyaj] dari [Nafi'] dari [Ibnu 'Umar] dari [Hafshah] -istri Nabi Shalallahu 'Alaihi Wa Sallam- bahwa Nabi Shallallahu 'Alahi Wa Sallam bersabda: \"Mendatangi sholat Jum'at hukumnya wajib bagi setiap (muslim) yang sudah baligh (dewasa).\" "
            },
            {
                "number": 1346,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ قُدَامَةَ بْنِ وَبَرَةَ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَرَكَ الْجُمُعَةَ مِنْ غَيْرِ عُذْرٍ فَلْيَتَصَدَّقْ بِدِينَارٍ فَإِنْ لَمْ يَجِدْ فَبِنِصْفِ دِينَارٍ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] dia berkata; telah menceritakan kepada kami [Yazid bin Harun] dia berkata; telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Qudamah bin Wabarah] dari [Samurah bin Jundub] dia berkata; Rasulullah Shalallahu 'Alaihi Wa sallam bersabda: \"Barangsiapa yang meninggalkan sholat jum'at tanpa ada udzur (alasan yang dibenarkan), hendaklah dia bersedekah dengan satu dinar, jika dia tidak bisa maka dengan setengah dinar."
            },
            {
                "number": 1347,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْأَعْرَجُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ عَلَيْهِ السَّلَام وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُخْرِجَ مِنْهَا",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Yunus] dari [Az Zuhri] dia berkata; telah menceritakan kepada kami ['Abdurrahman Al A'raj] bahwasanya ia mendengar [Abu Hurairah] berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Hari terbaik ketika matahari terbit adalah hari Jum'at. hari itu Nabi Adam dicipta, hari itu dia dimasukkan ke surga, dan hari itu pula ia dikeluarkan dari surga.\" "
            },
            {
                "number": 1348,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ عَنْ أَوْسِ بْنِ أَوْسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ مِنْ أَفْضَلِ أَيَّامِكُمْ يَوْمَ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ عَلَيْهِ السَّلَام وَفِيهِ قُبِضَ وَفِيهِ النَّفْخَةُ وَفِيهِ الصَّعْقَةُ فَأَكْثِرُوا عَلَيَّ مِنْ الصَّلَاةِ فَإِنَّ صَلَاتَكُمْ مَعْرُوضَةٌ عَلَيَّ قَالُوا يَا رَسُولَ اللَّهِ وَكَيْفَ تُعْرَضُ صَلَاتُنَا عَلَيْكَ وَقَدْ أَرَمْتَ أَيْ يَقُولُونَ قَدْ بَلِيتَ قَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ قَدْ حَرَّمَ عَلَى الْأَرْضِ أَنْ تَأْكُلَ أَجْسَادَ الْأَنْبِيَاءِ عَلَيْهِمْ السَّلَام",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] dia berkata; telah menceritakan kepada kami [Husain Al Ju'fi] dari ['Abdurrahman bin Yazid bin Jabir] dari [Abul Asy'ats Ash Shan'ani] dari [Aus bin Aus] dari Nabi Shalallahu 'Alaihi Wa Sallam beliau bersabda: \"Hari kalian yang paling utama adalah hari Jum'at -karena- pada hari itu Nabi Adam dicipta, pada hari itu beliau diwafatkan, pada hari itu ditiupnya terompet (menjelang kiamat), dan pada hari (mereka) dijadikan pingsan. Maka perbanyaklah shalawat kepadaku -karena- shalawat kalian disampaikan kepadaku.\" Mereka (para sahabat) berkata; \"Wahai Rasulullah Shalallahu 'Alaihi Wa Sallam, bagaimana mungkin shalawat kami bisa disampaikan kepada engkau, sedangkan engkau telah meninggal? -atau mereka berkata; \"Telah hancur (tulangnya) \"- Beliau Shalallahu 'Alaihi Wa Sallam lalu berkata: \"Allah Azza wa Jalla mengharamkan tanah untuk memakan jasad para Nabi 'Alaihimus Salam.\" "
            },
            {
                "number": 1349,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ أَنَّ سَعِيدَ بْنَ أَبِي هِلَالٍ وَبُكَيْرَ بْنَ الْأَشَجِّ حَدَّثَاهُ عَنْ أَبِي بَكْرِ بْنِ الْمُنْكَدِرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْغُسْلُ يَوْمَ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ وَالسِّوَاكُ وَيَمَسُّ مِنْ الطِّيبِ مَا قَدَرَ عَلَيْهِ إِلَّا أَنَّ بُكَيْرًا لَمْ يَذْكُرْ عَبْدَ الرَّحْمَنِ وَقَالَ فِي الطِّيبِ وَلَوْ مِنْ طِيبِ الْمَرْأَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dari ['Amr bin Al Harits] bahwasanya [Sa'id bin Abu Hilal] dan [Bukair bin Al Asyaj] menceritakan kepadanya dari [Abu Bakar bin Al Munkadir] dari ['Amr bin Sulaim] dari ['Abdurrahman Bin Abu Sa'id] dari [bapaknya] bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Mandi pada hari Jum'at -hukumnya- wajib bagi setiap orang yang sudah bermimpi (baligh), juga bersiwak dan memakai wewangian secukupnya.\" Tetapi dari jalur lain Bukair tidak menyebutkan nama Abdurrahman dan mengenai wewangian dia berkata; walaupun dengan wewangian yang biasa dipakai perempuan.'"
            },
            {
                "number": 1350,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا جَاءَ أَحَدُكُمْ الْجُمُعَةَ فَلْيَغْتَسِلْ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Nafi'] dari [Ibnu 'Umar] Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Apabila salah seorang dari kalian menghadiri sholat Jum'at, hendaklah mandi (terlebih dahulu).\""
            },
            {
                "number": 1351,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ غُسْلُ يَوْمِ الْجُمُعَةِ وَاجِبٌ عَلَى كُلِّ مُحْتَلِمٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Shafwan bin Sulaim] dari ['Atha bin Yasar] dari [Abu Sa'id Al Khudri] bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Mandi pada hari Jum'at -hukumnya- wajib bagi orang yang baligh (dewasa).\" "
            },
            {
                "number": 1352,
                "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ حَدَّثَنَا بِشْرٌ قَالَ حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى كُلِّ رَجُلٍ مُسْلِمٍ فِي كُلِّ سَبْعَةِ أَيَّامٍ غُسْلُ يَوْمٍ وَهُوَ يَوْمُ الْجُمُعَةِ",
                "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dia berkata; telah menceritakan kepada kami [Bisyr] dia berkata; telah menceritakan kepada kami [Dawud bin Abu Hind] dari [Abu Az Zubair] dari [Jabir] dia berkata; Rasulullah Shallallahu 'Alahi Wa Sallam bersabda: \"Setiap laki-laki muslim pada tiap tujuh hari wajib mandi dalam satu harinya, yaitu pada hari Jum'at.\" "
            },
            {
                "number": 1353,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ عَنْ الْوَلِيدِ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلَاءِ أَنَّهُ سَمِعَ الْقَاسِمَ بْنَ مُحَمَّدِ بْنِ أَبِي بَكْرٍأَنَّهُمْ ذَكَرُوا غُسْلَ يَوْمِ الْجُمُعَةِ عِنْدَ عَائِشَةَ فَقَالَتْ إِنَّمَا كَانَ النَّاسُ يَسْكُنُونَ الْعَالِيَةَ فَيَحْضُرُونَ الْجُمُعَةَ وَبِهِمْ وَسَخٌ فَإِذَا أَصَابَهُمْ الرَّوْحُ سَطَعَتْ أَرْوَاحُهُمْ فَيَتَأَذَّى بِهَا النَّاسُ فَذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَوَ لَا يَغْتَسِلُونَ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Khalid] dari [Al Walid] dia berkata; telah menceritakan kepada kami ['Abdullah bin Al 'Ala] bahwasanya ia mendengar [Al Qasim bin Muhammad bin Abu Bakr], mereka menyebutkan tentang mandi pada hari Jum'at kepada [Aisyah], ia berkata, \"Orang-orang yang tinggal ditempat tinggi (bukit) menghadiri sholat Jum'at dalam keadaan kotor, sehingga bila ada tiupan angin maka baunya menyebar dan mengganggu orang lain. Hal tersebut diberitahukan kepada Rasulullah Shalallahu 'Alaihi Wa Sallam, maka beliau Shalallahu 'Alaihi Wa Sallam bersabda: \"Kenapa mereka tidak mandi.\" "
            },
            {
                "number": 1354,
                "arab": "أَخْبَرَنَا أَبُو الْأَشْعَثِ عَنْ يَزِيدَ بْنِ زُرَيْعٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَوَضَّأَ يَوْمَ الْجُمُعَةِ فَبِهَا وَنِعْمَتْ وَمَنْ اغْتَسَلَ فَالْغُسْلُ أَفْضَلُقَالَ أَبُو عَبْد الرَّحْمَنِ الْحَسَنُ عَنْ سَمُرَةَ كِتَابًا وَلَمْ يَسْمَعْ الْحَسَنُ مِنْ سَمُرَةَ إِلَّا حَدِيثَ الْعَقِيقَةِ وَاللَّهُ تَعَالَى أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami [Abul Asy'ats] dari [Yazid bin Zurai'] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Al Hasan] dari [Samurah] dia berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Barangsiapa berwudhu pada hari Jum'at, maka itu baik, dan barangsiapa mandi -pada hari Jum'at- maka itu lebih utama.\" Abu Abdurrahman berkata; dari Al Hasan dari Samurah lewat tulisan, karena Al Hasan belum pernah mendengar langsung dari Samurah kecuali Hadist tentang 'aqiqah. Wallahu Ta'ala? lam."
            },
            {
                "number": 1355,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ وَهَارُونُ بْنُ مُحَمَّدِ بْنِ بَكَّارِ بْنِ بِلَالٍ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا أَبُو مُسْهِرٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ عَنْ يَحْيَى بْنِ الْحَارِثِ عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ عَنْ أَوْسِ بْنِ أَوْسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ غَسَّلَ وَاغْتَسَلَ وَغَدَا وَابْتَكَرَ وَدَنَا مِنْ الْإِمَامِ وَلَمْ يَلْغُ كَانَ لَهُ بِكُلِّ خُطْوَةٍ عَمَلُ سَنَةٍ صِيَامُهَا وَقِيَامُهَا",
                "id": "Telah mengabarkan kepada kami ['Amr bin Manshur] dan [Harun bin Muhammad bin Bakkar bin Bilal] -dan lafadz ini miliknya- mereka berdua berkata; telah menceritakan kepada kami [Abu Mushir] dia berkata; telah menceritakan kepada kami [Sa'id bin 'Abdul 'Aziz] dari [Yahya bin Al Harits] dari [Abul Asy'ats Ash-Shan'ani] dari [Aus bin Aus] dari Nabi Shalallahu 'Alaihi Wa Sallam, beliau bersabda: \"Barangsiapa menggauli istrinya dan mandi, lalu ia segera berangkat (ke masjid) sedini mungkin serta mendekat kepada imam, dan ia tidak melakukan hal yang sia-sia, setiap langkahnya laksana amalan satu tahun disertai puasa dan sholat malamnya.\""
            },
            {
                "number": 1356,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ عُمَرَ بْنَ الْخَطَّابِ رَأَى حُلَّةً فَقَالَ يَا رَسُولَ اللَّهِ لَوْ اشْتَرَيْتَ هَذِهِ فَلَبِسْتَهَا يَوْمَ الْجُمُعَةِ وَلِلْوَفْدِ إِذَا قَدِمُوا عَلَيْكَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لَا خَلَاقَ لَهُ فِي الْآخِرَةِ ثُمَّ جَاءَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلُهَا فَأَعْطَى عُمَرَ مِنْهَا حُلَّةً فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ كَسَوْتَنِيهَا وَقَدْ قُلْتَ فِي حُلَّةِ عُطَارِدٍ مَا قُلْتَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ أَكْسُكَهَا لِتَلْبَسَهَا فَكَسَاهَا عُمَرُ أَخًا لَهُ مُشْرِكًا بِمَكَّةَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Nafi'] dari ['Abdullah bin 'Umar] bahwa Umar bin Khattab melihat kain sutera, maka ia berkata, \"Wahai Rasulullah Shalallahu 'Alaihi Wa Sallam, bagaimana kalau membeli ini dan mengenakannya saat hari Jum'at, juga saat ada utusan yang datang kepadamu?\" Beliau Shalallahu 'Alaihi Wa Sallam lalu bersabda: \"Ini hanya dipakai oleh orang yang tidak mempunyai bagian pada hari akhir.\" Kemudian dia (Umar) datang lagi kepada Rasulullah Shalallahu 'Alaihi Wa Sallam seperti semula, lalu Rasulullah Shalallahu 'Alaihi Wa Sallam memberikan sutera tersebut kepadanya. Umar lalu berkata; \"Wahai Rasulullah Shalallahu 'Alaihi Wa Sallam, apakah engkau memerintahkanku agar memakainya, padahal engkau telah mengatakan (larangan) tentang sutera mewah itu?\" Lalu Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Aku memberimu bukan untuk dipakai.\" Lalu Umar memberikannya kepada saudaranya di Makkah yang masih musyrik. "
            },
            {
                "number": 1357,
                "arab": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ سَوَّارٍ قَالَ حَدَّثَنَا اللَّيْثُ قَالَ حَدَّثَنَا خَالِدٌ عَنْ سَعِيدٍ عَنْ أَبِي بَكْرِ بْنِ الْمُنْكَدِرِ أَنَّ عَمْرَو بْنَ سُلَيْمٍ أَخْبَرَهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِيهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْغُسْلَ يَوْمَ الْجُمُعَةِ عَلَى كُلِّ مُحْتَلِمٍ وَالسِّوَاكَ وَأَنْ يَمَسَّ مِنْ الطِّيبِ مَا يَقْدِرُ عَلَيْهِ",
                "id": "Telah mengabarkan kepadaku [Harun bin 'Abdullah] dia berkata; telah menceritakan kepada kami [Al Hasan bin Sawwar] dia berkata; telah menceritakan kepada kami [Al Laits] dia berkata; telah menceritakan kepada kami [Khalid] dari [Sa'id] dari [Abu Bakr bin Al Munkadir] bahwasanya ['Amru bin Sulaim] mengabarkan kepadanya dari ['Abdurrahman bin Abu Sa'id] dari [bapaknya] dari Rasulullah Shalallahu 'Alaihi Wa Sallam, beliau bersabda: \"Mandi pada hari Jum'at wajib atas setiap orang yang baligh, juga siwak serta memakai parfum sesuai yang dimilikinya.\""
            },
            {
                "number": 1358,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرٍ قَالَ حَدَّثَنَا الْوَلِيدُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ أَنَّهُ سَمِعَ أَبَا الْأَشْعَثِ حَدَّثَهُ أَنَّهُ سَمِعَ أَوْسَ بْنَ أَوْسٍ صَاحِبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اغْتَسَلَ يَوْمَ الْجُمُعَةِ وَغَسَلَ وَغَدَا وَابْتَكَرَ وَمَشَى وَلَمْ يَرْكَبْ وَدَنَا مِنْ الْإِمَامِ وَأَنْصَتَ وَلَمْ يَلْغُ كَانَ لَهُ بِكُلِّ خُطْوَةٍ عَمَلُ سَنَةٍ",
                "id": "Telah mengabarkan kepadaku ['Amr bin 'Utsman bin Sa'id bin Katsir] dia berkata; telah menceritakan kepada kami [Al Walid] dari ['Abdurrahman bin Yazid bin Jabir] bahwasanya ia mendengar [Abul Asy'ats] menceritakan kepadanya ia mendengar [Aus bin Aus] -sahabat Rasulullah Shalallahu 'Alaihi Wa Sallam- berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: 'Barangsiapa mandi pada hari Jum'at dan berwudhu, lalu sedini mungkin berangkat dengan berjalan kaki tidak naik kendaraan, dan mendekat kepada imam lalu ia diam tanpa berbuat perbuatan yang sia-sia, tiap langkahnya laksana amalan (ibadah) satu tahun.\""
            },
            {
                "number": 1359,
                "arab": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيِّ بْنِ نَصْرٍ عَنْ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ الْأَغَرِّ أَبِي عَبْدِ اللَّهِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانَ يَوْمُ الْجُمُعَةِ قَعَدَتْ الْمَلَائِكَةُ عَلَى أَبْوَابِ الْمَسْجِدِ فَكَتَبُوا مَنْ جَاءَ إِلَى الْجُمُعَةِ فَإِذَا خَرَجَ الْإِمَامُ طَوَتْ الْمَلَائِكَةُ الصُّحُفَ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُهَجِّرُ إِلَى الْجُمُعَةِ كَالْمُهْدِي بَدَنَةً ثُمَّ كَالْمُهْدِي بَقَرَةً ثُمَّ كَالْمُهْدِي شَاةً ثُمَّ كَالْمُهْدِي بَطَّةً ثُمَّ كَالْمُهْدِي دَجَاجَةً ثُمَّ كَالْمُهْدِي بَيْضَةً",
                "id": "Telah mengabarkan kepada kami [Nashr bin 'Ali bin Nashr] dari ['Abdul A'la] dia berkata; telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Aghar Abu 'Abdullah] dari [Abu Hurairah] bahwa Nabi Shalallahu 'Alaihi Wa Sallam bersabda: \"Bila datang hari Jum'at, para malaikat duduk di pintu-pintu masjid untuk mencatat siapa yang menghadiri sholat Jum'at. Bila imam telah keluar (berkhutbah), maka malaikat menutup lembaran-lembarannya (buku catatan amal kebaikan).\" Abu Hurairah berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: 'Orang yang bersegera ke masjid seperti orang yang berkurban dengan seekor unta, yang datang setelahnya seperti berkurban dengan seekor sapi, orang yang datang setelahnya seperti berkurban dengan seekor kambing, yang datang setelahnya seperti berkurban dengan seekor bebek, yang datang setelahnya seperti berkurban dengan seekor ayam, dan yang datang setelahnya seperti berkurban dengan sebutir telur.\" "
            },
            {
                "number": 1360,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا الزُّهْرِيُّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ يَوْمُ الْجُمُعَةِ كَانَ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ مَلَائِكَةٌ يَكْتُبُونَ النَّاسَ عَلَى مَنَازِلِهِمْ الْأَوَّلَ فَالْأَوَّلَ فَإِذَا خَرَجَ الْإِمَامُ طُوِيَتْ الصُّحُفُ وَاسْتَمَعُوا الْخُطْبَةَ فَالْمُهَجِّرُ إِلَى الصَّلَاةِ كَالْمُهْدِي بَدَنَةً ثُمَّ الَّذِي يَلِيهِ كَالْمُهْدِي بَقَرَةً ثُمَّ الَّذِي يَلِيهِ كَالْمُهْدِي كَبْشًا حَتَّى ذَكَرَ الدَّجَاجَةَ وَالْبَيْضَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dia berkata; telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] -sampai kepada Nabi Shalallahu 'Alaihi Wa Sallam- \"Pada hari Jum'at tiap-tiap pintu masjid ada malaikatnya yang mencatat orang-orang sesuai posisi mereka, yang pertama kemudian selanjutnya. Bila imam keluar (dari rumah lalu masuk masjid) maka malaikat menutup lembaran-lembarannya. Lalu mereka mendengarkan khutbah, maka orang yang bersegera ke masjid seperti orang yang berkurban dengan seekor unta, kemudian yang datang selanjutnya seperti orang yang berkurban dengan seekor sapi, lalu yang datang setelahnya seperti orang yang berkurban dengan seekor kambing.. hingga beliau menyebutkan ayam dan telur.\" "
            },
            {
                "number": 1361,
                "arab": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَقْعُدُ الْمَلَائِكَةُ يَوْمَ الْجُمُعَةِ عَلَى أَبْوَابِ الْمَسْجِدِ يَكْتُبُونَ النَّاسَ عَلَى مَنَازِلِهِمْ فَالنَّاسُ فِيهِ كَرَجُلٍ قَدَّمَ بَدَنَةً وَكَرَجُلٍ قَدَّمَ بَقَرَةً وَكَرَجُلٍ قَدَّمَ شَاةً وَكَرَجُلٍ قَدَّمَ دَجَاجَةً وَكَرَجُلٍ قَدَّمَ عُصْفُورًا وَكَرَجُلٍ قَدَّمَ بَيْضَةً",
                "id": "Telah mengabarkan kepada kami [Ar Rabi' bin Sulaiman] dia berkata; telah menceritakan kepada kami [Syu'aib bin Al Laits] dia berkata; telah memberitakan kepada kami [Al Laits] dari [Ibnu 'Ajlan] dari [Sumayya] dari [Abu Shalih] dari [Abu Hurairah] dari Rasulullah Shalallahu 'Alaihi Wa Sallam, beliau bersabda: \"Para malaikat duduk di pintu-pintu masjid untuk mencatat orang-orang sesuai kedudukan mereka. Ada yang laksana berkurban dengan seekor unta, ada yang laksana berkurban dengan seekor sapi, ada yang laksana berkurban dengan seekor ayam, ada yang laksana berkurban dengan seekor burung, ada yang laksana berkurban dengan sebutir telur.\""
            },
            {
                "number": 1362,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ ثُمَّ رَاحَ فَكَأَنَّمَا قَرَّبَ بَدَنَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً وَمَنْ رَاحَ فِي السَّاعَةِ الْخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً فَإِذَا خَرَجَ الْإِمَامُ حَضَرَتْ الْمَلَائِكَةُ يَسْتَمِعُونَ الذِّكْرَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Sumayya] dari [Abu Shalih] dari [Abu Hurairah] bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Barangsiapa mandi pada hari Jum'at sebagaimana mandi junub, kemudian berangkat (ke masjid), ia laksana berkurban dengan seekor unta, barangsiapa yang berangkat di urutan kedua, ia seperti orang yang berkurban dengan seekor sapi. Lalu orang yang datang pada urutan ketiga, seperti orang yang berkurban dengan seekor kambing, orang yang datang pada urutan keempat seperti orang yang berkurban dengan seekor ayam, dan yang datang urutan kelima seperti orang yang berkurban dengan sebutir telur. Jika imam keluar (berkhutbah) maka para malaikat datang untuk mendengarkan khutbah.\""
            },
            {
                "number": 1363,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الْأَسْوَدِ بْنِ عَمْرٍو وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ الْجُلَاحِ مَوْلَى عَبْدِ الْعَزِيزِ أَنَّ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَوْمُ الْجُمُعَةِ اثْنَتَا عَشْرَةَ سَاعَةً لَا يُوجَدُ فِيهَا عَبْدٌ مُسْلِمٌ يَسْأَلُ اللَّهَ شَيْئًا إِلَّا آتَاهُ إِيَّاهُ فَالْتَمِسُوهَا آخِرَ سَاعَةٍ بَعْدَ الْعَصْرِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Sawwad bin Al Aswad bin 'Amr] dan [Al Harits bin Miskin] secara baca dan aku mendengarnya, lafazh ini darinya, dari [Ibnu Wahb] dari ['Amr bin Al Harits] dari [Al Julah] -budak 'Abdul 'Aziz- bahwasanya ia mendengar [Abu Salamah bin 'Abdurrahman] menceritakan kepadanya dari [Jabir bin 'Abdullah] dari Rasulullah Shalallahu 'Alaihi Wa Sallam, beliau bersabda: \"Pada hari Jum'at ada dua belas jam, dan tak ada seorang hamba pun yang meminta sesuatu kepada Allah pada jam-jam itu kecuali Allah akan memberinya. Jadi, carilah waktu tersebut pada akhir waktu Ashar.\" "
            },
            {
                "number": 1364,
                "arab": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا حَسَنُ بْنُ عَيَّاشٍ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجُمُعَةَ ثُمَّ نَرْجِعُ فَنُرِيحُ نَوَاضِحَنَا قُلْتُ أَيَّةَ سَاعَةٍ قَالَ زَوَالُ الشَّمْسِ",
                "id": "Telah mengabarkan kepadaku [Harun bin 'Abdullah] dia berkata; telah menceritakan kepadaku [Yahya bin Adam] dia berkata; telah menceritakan kepada kami [Hasan bin 'Ayyasy] dia berkata; telah menceritakan kepada kami [Ja'far bin Muhammad] dari [bapaknya] dari [Jabir bin 'Abdullah] dia berkata; \"Kami pernah sholat Jum'at bersama Rasulullah Shalallahu 'Alaihi Wa Sallam, kemudian kami pulang untuk mengistirahatkan hewan-hewan -yang kami pakai- kerja. Aku bertanya, \"Pada saat kapan?\" Ia menjawab, 'Ketika matahari tergelincir.\" "
            },
            {
                "number": 1365,
                "arab": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ عَنْ يَعْلَى بْنِ الْحَارِثِ قَالَ سَمِعْتُ إِيَاسَ بْنَ سَلَمَةَ بْنِ الْأَكْوَعِ يُحَدِّثُ عَنْ أَبِيهِ قَالَكُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجُمُعَةَ ثُمَّ نَرْجِعُ وَلَيْسَ لِلْحِيطَانِ فَيْءٌ يُسْتَظَلُّ بِهِ",
                "id": "Telah mengabarkan kepada kami [Syu'aib bin Yusuf] dia berkata; telah memberitakan kepada kami ['Abdurrahman] dari [Ya'la bin Al Harits] dia berkata; aku mendengar [Iyas bin Salamah bin Al Akwa'] menceritakan dari [bapaknya] dia berkata; \"Kami sholat Jum'at bersama Rasulullah Shallallahu 'Alahi Wa Sallam, kemudian kami pulang, dan tembok sudah tidak mempunyai bayangan untuk berteduh.\""
            },
            {
                "number": 1366,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَأَنَّ الْأَذَانَ كَانَ أَوَّلُ حِينَ يَجْلِسُ الْإِمَامُ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ فَلَمَّا كَانَ فِي خِلَافَةِ عُثْمَانَ وَكَثُرَ النَّاسُ أَمَرَ عُثْمَانُ يَوْمَ الْجُمُعَةِ بِالْأَذَانِ الثَّالِثِ فَأُذِّنَ بِهِ عَلَى الزَّوْرَاءِ فَثَبَتَ الْأَمْرُ عَلَى ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku [As Saib bin Yazid] bahwa pada masa Rasulullah Shalallahu 'Alaihi Wa Sallam, Abu Bakar, dan Umar, adzan pertama -pada hari Jum'at - dilakukan ketika imam telah duduk diatas mimbar, Sedangkan pada masa Utsman jumlah manusia telah bertambah banyak, sehingga Usman perintahkan pada hari Jum'at untuk adzan yang ketiga, lalu dikumandangkan di Zaura'. Dan hal ini menjadi tradisi yang terus dilestarikan. "
            },
            {
                "number": 1367,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَنَّ السَّائِبَ بْنَ يَزِيدَ أَخْبَرَهُ قَالَإِنَّمَا أَمَرَ بِالتَّأْذِينِ الثَّالِثِ عُثْمَانُ حِينَ كَثُرَ أَهْلُ الْمَدِينَةِ وَلَمْ يَكُنْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرُ مُؤَذِّنٍ وَاحِدٍ وَكَانَ التَّأْذِينُ يَوْمَ الْجُمُعَةِ حِينَ يَجْلِسُ الْإِمَامُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya bin 'Abdullah] dia berkata; telah menceritakan kepada kami [Ya'qub] dia berkata; [bapakku] telah menceritakan kepada kami dari [Shalih] dari [Ibnu Syihab] bahwasanya [As Saib bin Yazid] mengabarkan kepadanya dia berkata; \"Yang menyuruh adzan tiga kali adalah Utsman, saat penduduk Madinah bertambah banyak. Sedangkan pada masa Rasulullah Shalallahu 'Alaihi Wa Sallam hanya satu adzan, dan adzan pada hari Jum'at dikumandangkan ketika imam telah duduk.\""
            },
            {
                "number": 1368,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ عَنْ الزُّهْرِيِّ عَنْ السَّائِبِ بْنِ يَزِيدَ قَالَكَانَ بِلَالٌ يُؤَذِّنُ إِذَا جَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ فَإِذَا نَزَلَ أَقَامَ ثُمَّ كَانَ كَذَلِكَ فِي زَمَنِ أَبِي بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Al Mu'tamir] dari [bapaknya] dari [Az Zuhri] dari [As Saib bin Yazid] dia berkata; \"Bilal mengumandangkan adzan saat Rasulullah Shalallahu 'Alaihi Wa Sallam telah duduk diatas mimbarnya, pada hari Jum'at. Bila beliau turun, ia segera menegakkan sholat, begitu pula pada zaman Abu Bakar dan Umar Radliallahu? nhuma.\" "
            },
            {
                "number": 1369,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا جَاءَ أَحَدُكُمْ وَقَدْ خَرَجَ الْإِمَامُ فَلْيُصَلِّ رَكْعَتَيْنِقَالَ شُعْبَةُ يَوْمَ الْجُمُعَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Syu'bah] dari ['Amr bin Dinar] dia berkata; aku mendengar [Jabir bin 'Abdullah] berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda, 'Apabila salah seorang dari kalian datang (ke masjid) pada hari Jum'at, padahal imam telah keluar (untuk berkhutbah), sholatlah dua rakaat.\""
            },
            {
                "number": 1370,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الْأَسْوَدِ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ أَنَّ أَبَا الزُّبَيْرِ أَخْبَرَهُ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَطَبَ يَسْتَنِدُ إِلَى جِذْعِ نَخْلَةٍ مِنْ سَوَارِي الْمَسْجِدِ فَلَمَّا صُنِعَ الْمِنْبَرُ وَاسْتَوَى عَلَيْهِ اضْطَرَبَتْ تِلْكَ السَّارِيَةُ كَحَنِينِ النَّاقَةِ حَتَّى سَمِعَهَا أَهْلُ الْمَسْجِدِ حَتَّى نَزَلَ إِلَيْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاعْتَنَقَهَا فَسَكَتَتْ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Sawwad bin Al Aswad] dia berkata; telah memberitakan kepada kami [Ibnu Wahb] dia berkata; telah memberitakan kepada kami [Ibnu Juraij] bahwasanya [Abu Az Zubair] mengabarkan kepadanya bahwasanya ia mendengar [Jabir bin 'Abdullah] berkata; \"Pada awal mulanya Rasulullah Shalallahu 'Alaihi Wa Sallam apabila menyampaikan khutbah, beliau bersandar ke batang pohon kurma yang termasuk tiang masjid. Setelah dibuatkan mimbar dan beliau jadikan tempat berdiri, merintihlah pohon kurma tersebut seperti suara rintihan unta betina, hingga didengar oleh orang-orang yang ada di masjid. Rasulullah Shalallahu 'Alaihi Wa Sallam lantas menghampirinya, memeluknya, maka ia pun terdiam.\" "
            },
            {
                "number": 1371,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي عُبَيْدَةَ عَنْ كَعْبِ بْنِ عُجْرَةَ قَالَدَخَلَ الْمَسْجِدَ وَعَبْدُ الرَّحْمَنِ ابْنُ أُمِّ الْحَكَمِ يَخْطُبُ قَاعِدًا فَقَالَ انْظُرُوا إِلَى هَذَا يَخْطُبُ قَاعِدًا وَقَدْ قَالَ اللَّهُ عَزَّ وَجَلَّ{ وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا }",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Abdullah bin Al Hakam] dia berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Manshur] dari ['Amr bin Murrah] dari [Abu 'Ubaidah] dari [Ka'b bin 'Ujrah] dia berkata; \"Aku masuk ke masjid, dan Abdurrahman bin Ummu Hakam sedang khutbah sambil duduk.\" Lalu Ka'ab berkata; \"Lihatlah orang ini yang sedang khutbah sambil duduk! Padahal Allah Azza wa Jalla berfirman: \"Dan apabila mereka melihat perniagaan atau permainan, mereka bubar untuk menuju kepadanya dan mereka tinggalkan kamu sedang berdiri (berkhutbah) '. (Qs. Al Jumu'ah (62): 11).\""
            },
            {
                "number": 1372,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ قَالَ حَدَّثَنِي عُمَرُ بْنُ عَبْدِ الْوَاحِدِ قَالَ سَمِعْتُ يَحْيَى بْنَ الْحَارِثِ يُحَدِّثُ عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ عَنْ أَوْسِ بْنِ أَوْسٍ الثَّقَفِيِّعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ غَسَّلَ وَاغْتَسَلَ وَابْتَكَرَ وَغَدَا وَدَنَا مِنْ الْإِمَامِ وَأَنْصَتَ ثُمَّ لَمْ يَلْغُ كَانَ لَهُ بِكُلِّ خُطْوَةٍ كَأَجْرِ سَنَةٍ صِيَامِهَا وَقِيَامِهَا",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Khalid] dia berkata; telah menceritakan kepadaku ['Umar bin 'Abdul Wahid] dia berkata; aku mendengar [Yahya bin Al Harits] menceritakan dari [Abul Asy'ats Ash-Shan'ani] dari [Aus bin Aus Ats-Tsaqafi] dari Nabi Shalallahu 'Alaihi Wa Sallam beliau bersabda: \"Barangsiapa menggauli istrinya dan mandi pada hari Jum'at, lalu pergi sedini mungkin dan mendekat kepada imam, serta ia tidak melakukan hal yang sia-sia, setiap langkahnya laksana ibadah satu tahun, berikut puasa dan sholat malamnya.\""
            },
            {
                "number": 1373,
                "arab": "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ صَالِحٍ عَنْ أَبِي الزَّاهِرِيَّةِ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ قَالَكُنْتُ جَالِسًا إِلَى جَانِبِهِ يَوْمَ الْجُمُعَةِ فَقَالَ جَاءَ رَجُلٌ يَتَخَطَّى رِقَابَ النَّاسِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْ اجْلِسْ فَقَدْ آذَيْتَ",
                "id": "Telah mengabarkan kepada kami [Wahb bin Bayan] dia berkata; telah memberitakan kepada kami [Ibnu Wahb] dia berkata; aku mendengar [Mu'awiyah bin Shalih] dari [Abu Az Zahiriyah] dari ['Abdullah bin Busr] dia berkata; \"Aku pernah duduk disampingnya pada hari Jum'at, lalu ia berkata; 'Ada seorang laki-laki datang dengan melangkahi pundak orang-orang (jamaah), maka Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: 'Duduklah, kamu telah mengganggu.\""
            },
            {
                "number": 1374,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ وَيُوسُفُ بْنُ سَعِيدٍ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُجَاءَ رَجُلٌ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ فَقَالَ لَهُ أَرَكَعْتَ رَكْعَتَيْنِ قَالَ لَا قَالَ فَارْكَعْ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al Hasan] dan [Yusuf bin Sa'id] -dan lafadz ini miliknya- mereka berdua berkata; telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] dia berkata; telah mengabarkan kepadaku ['Amr bin Dinar] bahwasanya ia mendengar [Jabir bin 'Abdullah] berkata; \"Ada seorang laki-laki datang, sementara Nabi Shalallahu 'Alaihi Wa Sallam sedang berada diatas mimbar pada hari Jum'at, maka beliau bertanya: 'Sudahkah kamu sholat dua rakaat? ' Ia menjawab, 'Belum'. Beliau bersabda: 'sholatlah'."
            },
            {
                "number": 1375,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَالَ لِصَاحِبِهِ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ أَنْصِتْ فَقَدْ لَغَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] dari Nabi Shalallahu 'Alaihi Wa Sallam, beliau bersabda: \"Barangsiapa pada hari Jum'at berkata kepada temannya, \"Diamlah\" padahal imam sedang khutbah, ia telah berbuat sia-sia.\""
            },
            {
                "number": 1376,
                "arab": "أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ قَالَ حَدَّثَنِي أَبِي عَنْ جَدِّي قَالَ حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ عَبْدِ اللَّهِ بْنِ إِبْرَاهِيمَ بْنِ قَارِظٍ وَعَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُمَا حَدَّثَاهُ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ فَقَدْ لَغَوْتَ",
                "id": "Telah mengabarkan kepada kami ['Abdul Malik bin Syu'aib bin Al Laits bin Sa'd] dia berkata; [bapakku] telah menceritakan kepadaku dari [kakekku] dia berkata; telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab] dari ['Umar bin 'Abdul 'Aziz] dari ['Abdullah bin Ibrahim bin Qarizh] dan dari [Sa'id bin Al Musayyab] mereka berdua menceritakan kepadanya, bahwa [Abu Hurairah] berkata; \"Aku mendengar Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: 'jika kamu berkata kepada temanmu; \"Diamlah\" padahal imam sedang khutbah, ia telah berbuat sia-sia.\""
            },
            {
                "number": 1377,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي مَعْشَرٍ زِيَادِ بْنِ كُلَيْبٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ الْقَرْثَعِ الضَّبِّيِّ وَكَانَ مِنْ الْقُرَّاءِ الْأَوَّلِينَ عَنْ سَلْمَانَ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ رَجُلٍ يَتَطَهَّرُ يَوْمَ الْجُمُعَةِ كَمَا أُمِرَ ثُمَّ يَخْرُجُ مِنْ بَيْتِهِ حَتَّى يَأْتِيَ الْجُمُعَةَ وَيُنْصِتُ حَتَّى يَقْضِيَ صَلَاتَهُ إِلَّا كَانَ كَفَّارَةً لِمَا قَبْلَهُ مِنْ الْجُمُعَةِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Jarir] dari [Manshur] dari [Abu Ma'syar Ziyad bin Kulaib] dari [Ibrahim] dari ['Alqamah] dari [Al Qartsa' Adh Dhabi] dan dia termasuk generasi pertama para Qurra', dari [Salman] dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda bersabda kepadaku: 'Tidak ada seorangpun yang bersuci pada hari Jum'at sebagaimana yang diperintahkan, lalu keluar dari rumahnya hingga datang ke masjid, kemudian diam hingga selesai sholat, melainkan itu semua akan menjadi kafarat (penghapus) bagi dosanya satu Jum'at sebelumnya'.\""
            },
            {
                "number": 1378,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ أَبَا إِسْحَقَ يُحَدِّثُ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَلَّمَنَا خُطْبَةَ الْحَاجَةِ الْحَمْدُ لِلَّهِ نَسْتَعِينُهُ وَنَسْتَغْفِرُهُ وَنَعُوذُ بِاللَّهِ مِنْ شُرُورِ أَنْفُسِنَا وَسَيِّئَاتِ أَعْمَالِنَا مَنْ يَهْدِهِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ ثُمَّ يَقْرَأُ ثَلَاثَ آيَاتٍ{ يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسْلِمُونَ }{ يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمْ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالًا كَثِيرًا وَنِسَاءً وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا }{ يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَقُولُوا قَوْلًا سَدِيدًا }قَالَ أَبُو عَبْد الرَّحْمَنِ أَبُو عُبَيْدَةَ لَمْ يَسْمَعْ مِنْ أَبِيهِ شَيْئًا وَلَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ وَلَا عَبْدُ الْجَبَّارِ بْنُ وَائِلِ بْنِ حُجْرٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] mereka berdua berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] dia berkata; telah menceritakan kepada kami [Syu'bah] dia berkata; aku mendengar [Abu Ishaq] menceritakan dari [Abu 'Ubaidah] dari ['Abdullah] dari Nabi Shalallahu 'Alaihi Wa Sallam. Abdullah berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam telah mengajarkan Khutbah Hajah kepada kami, yaitu, 'Segala puji bagi Allah, kita memohon pertolongan dan ampunan kepadanya, berlindung kepadanya dari kejahatan jiwa kami dan kejelekan perbuatan-perbuatan kami. Barang siapa yang diberikan petunjuk oleh Allah, maka tidak akan ada yang bisa menyesatkannya. Barangsiapa yang telah Allah sesatkan, maka tidak akan ada yang bisa memberinya petunjuk. Aku bersaksi tiada tuhan (yang berhak disembah) kecuali Allah, dan aku bersaksi bahwa Muhammad adalah hamba dan utusannya'. Kemudian beliau membaca tiga ayat berikut ini: 'Wahai orang-orang yang beriman, bertakwalah kepada Allah dengan sebenar-benar takwa kepadanya, dan janganlah kamu mati melainkan dalam keadaan beragama Islam'. (Qs. Ali 'Imran (3): 102). 'Hai kalian manusia, bertakwalah kepada tuhanmu yang telah menciptakanmu dari diri yang satu, dan daripadanya Allah menciptakan istrinya, dan daripada keduanya Allah memperkembangbiakan laki-laki dan perempuan yang banyak, dan bertakwalah kepada Allah dengan (mempergunakan) nama-Nya kamu saling meminta satu dengan yang lain, dan (periharalah) hubungan Silaturrahim. Sesungguhnya Allah selalu menjaga dan mengawasimu'.\"(Qs. An-Nisaa'(4): 1). 'Hai orang-orang yang beriman, bertakwalah kepada Allah dan katakanlah perkataan yang benar'.\"(Qs. Al Ahzaab (33): 70). Abu Abdurrahman berkata; Abu Ubaidah tidak pernah mendengar dari Bapaknya sedikitpun, demikian juga Abdurrahman bin Abdullah bin Mas'ud dan Abdul Jabbar bin Wa'il bin Hujr. "
            },
            {
                "number": 1379,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَخَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِذَا رَاحَ أَحَدُكُمْ إِلَى الْجُمُعَةِ فَلْيَغْتَسِلْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Nafi'] dari [Ibnu 'Umar] dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam berkhutbah kepada kami, 'Apabila salah seorang dari kalian hendak pergi sholat jum'at, hendaklah dia mandi'.\""
            },
            {
                "number": 1380,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ إِبْرَاهِيمَ بْنِ نَشِيطٍ أَنَّهُ سَأَلَ ابْنَ شِهَابٍ عَنْ الْغُسْلِ يَوْمَ الْجُمُعَةِ فَقَالَ سُنَّةٌ وَقَدْ حَدَّثَنِي بِهِ سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَكَلَّمَ بِهَا عَلَى الْمِنْبَرِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dari [Ibrahim bin Nasyith] bahwasanya dia bertanya kepada [Ibnu Syihab] mengenai mandi pada hari Jum'at, maka dia menjawab; itu adalah sunnah dan sungguh telah menceritakan kepadaku [Salim bin 'Abdullah] dari [bapaknya] bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam mengatakannya diatas mimbar."
            },
            {
                "number": 1381,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ وَهُوَ قَائِمٌ عَلَى الْمِنْبَرِ مَنْ جَاءَ مِنْكُمْ الْجُمُعَةَ فَلْيَغْتَسِلْقَالَ أَبُو عَبْد الرَّحْمَنِ مَا أَعْلَمُ أَحَدًا تَابَعَ اللَّيْثَ عَلَى هَذَا الْإِسْنَادِ غَيْرَ ابْنِ جُرَيْجٍ وَأَصْحَابُ الزُّهْرِيِّ يَقُولُونَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ بَدَلَ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Abdullah bin 'Abdullah] dari ['Abdullah bin 'Umar] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: -diatas mimbar-, \"Barang siapa hendak berangkat sholat Jum'at, maka mandilah.\" Abu Abdurrahman berkata; 'Tidak seorang pun dalam hal ini yang mengikuti Al Laits selain [Ibnu Juraij], dan [para sahabat]. [Az Zuhri] mengatakan; dari [Salim bin Abdullah] dari [Bapaknya] sebagai pengganti Abdullah bin Abdullah bin Umar."
            },
            {
                "number": 1382,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ عَجْلَانَ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُجَاءَ رَجُلٌ يَوْمَ الْجُمُعَةِ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ بِهَيْئَةٍ بَذَّةٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَلَّيْتَ قَالَ لَا قَالَ صَلِّ رَكْعَتَيْنِ وَحَثَّ النَّاسَ عَلَى الصَّدَقَةِ فَأَلْقَوْا ثِيَابًا فَأَعْطَاهُ مِنْهَا ثَوْبَيْنِ فَلَمَّا كَانَتْ الْجُمُعَةُ الثَّانِيَةُ جَاءَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَحَثَّ النَّاسَ عَلَى الصَّدَقَةِ قَالَ فَأَلْقَى أَحَدَ ثَوْبَيْهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَ هَذَا يَوْمَ الْجُمُعَةِ بِهَيْئَةٍ بَذَّةٍ فَأَمَرْتُ النَّاسَ بِالصَّدَقَةِ فَأَلْقَوْا ثِيَابًا فَأَمَرْتُ لَهُ مِنْهَا بِثَوْبَيْنِ ثُمَّ جَاءَ الْآنَ فَأَمَرْتُ النَّاسَ بِالصَّدَقَةِ فَأَلْقَى أَحَدَهُمَا فَانْتَهَرَهُ وَقَالَ خُذْ ثَوْبَكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Yazid] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Ibnu 'Ajlan] dari ['Iyadh bin 'Abdullah] dia berkata; aku mendengar [Abu Sa'id Al Khudri] berkata; \"Pada hari Jum'at, ada seseorang datang ke masjid dengan lusuh; ketika Rasulullah shallallahu 'alaihi wasallam khutbah, Rasulullah shallallahu 'alaihi wasallam menegurnya, 'Apakah kamu sudah sholat? ' Ia menjawab, 'belum'. Lalu Rasulullah shallallahu 'alaihi wasallam berkata kepadanya: 'sholatlah dua rakaat'. Kemudian beliau menganjurkan orang-orang untuk sedekah. Orang-orang pun segera melemparkan baju-bajunya, lalu beliau memberikan kepadanya dua baju. Pada hari Jum'at berikutnya datang lagi, dan saat itu Rasulullah shallallahu 'alaihi wasallam juga sedang khutbah, dan beliau shallallahu 'alaihi wasallam menganjurkan untuk sedekah.\" Abu Sa'id Al Khudri berkata, \"lalu ia (laki-laki tersebut) melemparkan salah satu bajunya, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: 'Orang ini datang pada hari Jum'at dengan penampilan yang lusuh, aku menyuruh orang-orang untuk bersedekah, maka mereka melemparkan baju. Dan aku perintahkan agar memberinya dua baju. Kemudian sekarang dia dia datang lagi, dan aku menyuruh orang-orang untuk bersedekah, namun ia melemparkan salah satu bajunya'. Rasulullah shallallahu 'alaihi wasallam menghardiknya sambil berkata, 'Ambil bajumu! '"
            },
            {
                "number": 1383,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَبَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ جَاءَ رَجُلٌ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّيْتَ قَالَ لَا قَالَ قُمْ فَارْكَعْ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari ['Amr bin Dinar] dari [Jabir bin 'Abdullah] dia berkata; \"Pada saat Rasulullah shallallahu 'alaihi wasallam Khutbah pada hari Jum'at tiba-tiba ada seorang laki-laki yang datang, lalu beliau bersabda: 'Apakah kamu sudah sholat? ' ia menjawab; 'Belum'. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: 'Berdiri dan sholatlah.'\""
            },
            {
                "number": 1384,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا أَبُو مُوسَى إِسْرَائِيلُ بْنُ مُوسَى قَالَ سَمِعْتُ الْحَسَنَ يَقُولُ سَمِعْتُ أَبَا بَكْرَةَ يَقُولُلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ وَالْحَسَنُ مَعَهُ وَهُوَ يُقْبِلُ عَلَى النَّاسِ مَرَّةً وَعَلَيْهِ مَرَّةً وَيَقُولُ إِنَّ ابْنِي هَذَا سَيِّدٌ وَلَعَلَّ اللَّهَ أَنْ يُصْلِحَ بِهِ بَيْنَ فِئَتَيْنِ مِنْ الْمُسْلِمِينَ عَظِيمَتَيْنِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dia berkata; telah menceritakan kepada kami [Sufyan] dia berkata; telah menceritakan kepada kami [Abu Musa Isra'il bin Musa] dia berkata; aku mendengar [Al Hasan] berkata; aku mendengar [Abu Bakrah] berkata; \"Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam di atas mimbar, dan Hasan bersamanya. Beliau kadang menghadap manusia, dan kadang menghadap ke arah Hasan, lalu bersabda: 'Cucuku ini adalah Sayyid (Pemimpin). Semoga Allah mendamaikan dua kelompok besar kaum muslimin dengan perantaranya'.\""
            },
            {
                "number": 1385,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا هَارُونُ بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا عَلِيٌّ وَهُوَ ابْنُ الْمُبَارَكِ عَنْ يَحْيَى عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ ابْنَةِ حَارِثَةَ بْنِ النُّعْمَانِ قَالَتْحَفِظْتُ ق وَالْقُرْآنِ الْمَجِيدِ مِنْ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Harun bin Isma'il] dia berkata; telah menceritakan kepada kami ['Ali bin Al Mubarak] dari [Yahya] dari [Muhammad bin 'Abdurrahman] dari [Bintu Haritsah bin An Nu'man] dia berkata; \"Aku hafal surat Qaaf Wal Qura'anil Majid dari lisan Rasulullah shallallahu 'alaihi wasallam saat itu beliau sedang berada di atas mimbar pada hari Jum'at.\""
            },
            {
                "number": 1386,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ حُصَيْنٍأَنَّ بِشْرَ بْنَ مَرْوَانَ رَفَعَ يَدَيْهِ يَوْمَ الْجُمُعَةِ عَلَى الْمِنْبَرِ فَسَبَّهُ عُمَارَةُ بْنُ رُوَيْبَةَ الثَّقَفِيُّ وَقَالَ مَا زَادَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى هَذَا وَأَشَارَ بِإِصْبَعِهِ السَّبَّابَةِ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] dia berkata; telah menceritakan kepada kami [Waki'] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Hushain] bahwasanya Bisyr bin Marwan mengangkat tangannya pada hari Jum'at diatas mimbar, maka ['Umarah bin Ruwaibah Ats-Tsaqafi] mencelanya dan berkata; \"Rasulullah shallallahu 'alaihi wasallam tidak lebih dari ini.\" Ia mengisyaratkan dengan telunjuknya."
            },
            {
                "number": 1387,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ حُسَيْنِ بْنِ وَاقِدٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فَجَاءَ الْحَسَنُ وَالْحُسَيْنُ رَضِيَ اللَّهُ عَنْهُمَا وَعَلَيْهِمَا قَمِيصَانِ أَحْمَرَانِ يَعْثُرَانِ فِيهِمَا فَنَزَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَطَعَ كَلَامَهُ فَحَمَلَهُمَا ثُمَّ عَادَ إِلَى الْمِنْبَرِ ثُمَّ قَالَ صَدَقَ اللَّهُ{ إِنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌ }رَأَيْتُ هَذَيْنِ يَعْثُرَانِ فِي قَمِيصَيْهِمَا فَلَمْ أَصْبِرْ حَتَّى قَطَعْتُ كَلَامِي فَحَمَلْتُهُمَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul 'Aziz] dia berkata; telah menceritakan kepada kami [Al Fadhl bin Musa] dari [Husain bin Waqid] dari ['Abdullah bin Buraidah] dari [bapaknya] dia berkata; Rasulullah shallallahu 'alaihi wasallam sedang khutbah, lalu datang Hasan dan Husain radliallahu 'anhuma yang memakai baju merah. Keduanya lalu terjatuh, Rasulullah shallallahu 'alaihi wasallam turun dari mimbar dan menggendong keduanya lalu kembali ke mimbar dengan berkata: \"Maha benar Allah atas firman-Nya: 'Sesungguhnya hartamu dan anak-anakmu hanyalah sebagai cobaan'. (Qs. Al Anfaal (8): 28). Aku melihat kedua anak ini terjatuh dalam kedua bajunya, maka aku tidak sabar hingga aku memotong pembicaraanku lalu aku menggendong keduanya.\""
            },
            {
                "number": 1388,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ غَزْوَانَ قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى عَنْ الْحُسَيْنِ بْنِ وَاقِدٍ قَالَ حَدَّثَنِي يَحْيَى بْنُ عُقَيْلٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكْثِرُ الذِّكْرَ وَيُقِلُّ اللَّغْوَ وَيُطِيلُ الصَّلَاةَ وَيُقَصِّرُ الْخُطْبَةَ وَلَا يَأْنَفُ أَنْ يَمْشِيَ مَعَ الْأَرْمَلَةِ وَالْمِسْكِينِ فَيَقْضِيَ لَهُ الْحَاجَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul 'Aziz bin Ghazwan] dia berkata; telah memberitakan kepada kami [Al Fadhl bin Musa] dari [Al Husain bin Waqid] dia berkata; telah menceritakan kepadaku [Yahya bin 'Uqail] dia berkata; aku mendengar ['Abdullah bin Abu Aufa] berkata; \"Rasulullah shallallahu 'alaihi wasallam selalu memperbanyak dzikir dan sedikit melakukan perbuatan sia-sia. Beliau juga memperpanjang sholat dan mempersingkat khutbah, serta tidak sungkan untuk berjalan bersama para janda dan orang-orang miskin lalu memenuhi kebutuhannya.\""
            },
            {
                "number": 1389,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَجَالَسْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا رَأَيْتُهُ يَخْطُبُ إِلَّا قَائِمًا وَيَجْلِسُ ثُمَّ يَقُومُ فَيَخْطُبُ الْخُطْبَةَ الْآخِرَةَ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah menceritakan kepada kami [Syarik] dari [Simak] dari [Jabir bin Samurah] dia berkata; \"Aku pernah duduk bersama Rasulullah shallallahu 'alaihi wasallam dan aku tidak pernah melihatnya khutbah kecuali dengan berdiri, lalu duduk, kemudian berdiri lagi untuk khutbah yang terakhir.\""
            },
            {
                "number": 1390,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ الْخُطْبَتَيْنِ وَهُوَ قَائِمٌ وَكَانَ يَفْصِلُ بَيْنَهُمَا بِجُلُوسٍ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Bisyr bin Al Mufadladlal] dia berkata; telah menceritakan kepada kami ['ubaidhullah] dari [Nafi'] dari ['Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam menyampaikan dua khutbah sambil berdiri, dan memisahkan keduanya dengan duduk."
            },
            {
                "number": 1391,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ قَالَ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ قَالَ حَدَّثَنَا إِسْرَائِيلُ قَالَ حَدَّثَنَا سِمَاكٌ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ قَائِمًا ثُمَّ يَقْعُدُ قِعْدَةً لَا يَتَكَلَّمُ ثُمَّ يَقُومُ فَيَخْطُبُ خُطْبَةً أُخْرَى فَمَنْ حَدَّثَكُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ قَاعِدًا فَقَدْ كَذَبَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Bazi'] dia berkata; telah menceritakan kepada kami [Yazid bin Zurai'] dia berkata; telah menceritakan kepada kami [Isra'il] dia berkata; telah menceritakan kepada kami [Simak] dari [Jabir bin Samurah] dia berkata; \"Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam khutbah pada hari Jum'at dalam keadaan berdiri, kemudian duduk sejenak tanpa berbicara, lalu berdiri lagi untuk menyampaikan khutbah yang terakhir. Barangsiapa menceritakan kepadamu bahwa Rasulullah shallallahu 'alaihi wasallam menyampaikan khutbah dalam keadaan duduk, ia berdusta.\""
            },
            {
                "number": 1392,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ عَنْ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ وَيَقْرَأُ آيَاتٍ وَيَذْكُرُ اللَّهَ عَزَّ وَجَلَّ وَكَانَتْ خُطْبَتُهُ قَصْدًا وَصَلَاتُهُ قَصْدًا",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dari ['Abdurrahman] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Simak] dari [Jabir bin Samurah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam menyampaikan khutbah dalam keadaan berdiri, kemudian duduk, lalu berdiri dan membaca beberapa ayat serta berdzikir kepada Allah Azza wa Jalla. Khutbah beliau sederhana (tidak lama dan tidak sebentar) dan sholatnya juga sederhana (tidak lama dan tidak sebentar)."
            },
            {
                "number": 1393,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ مَيْمُونٍ قَالَ حَدَّثَنَا الْفِرْيَابِيُّ قَالَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْزِلُ عَنْ الْمِنْبَرِ فَيَعْرِضُ لَهُ الرَّجُلُ فَيُكَلِّمُهُ فَيَقُومُ مَعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى يَقْضِيَ حَاجَتَهُ ثُمَّ يَتَقَدَّمُ إِلَى مُصَلَّاهُ فَيُصَلِّي",
                "id": "Telah mengabarkan kepadaku [Muhammad bin 'Ali bin Maimun] dia berkata; telah menceritakan kepada kami [Al Firyabi] dia berkata; telah menceritakan kepada kami [Jarir bin Hazim] dari [Tsabit Al Bannani] dari [Anas] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah turun dari mimbar, tiba-tiba seseorang menghadangnya dan berbicara kepada beliau, lalu Nabi shallallahu 'alaihi wasallam mengajaknya berbicara dan menyelesaikan kebutuhannya, setelah itu beliau maju ketempat sholatnya dan sholat."
            },
            {
                "number": 1394,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ زُبَيْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَ قَالَ عُمَرُصَلَاةُ الْجُمُعَةِ رَكْعَتَانِ وَصَلَاةُ الْفِطْرِ رَكْعَتَانِ وَصَلَاةُ الْأَضْحَى رَكْعَتَانِ وَصَلَاةُ السَّفَرِ رَكْعَتَانِ تَمَامٌ غَيْرُ قَصْرٍ عَلَى لِسَانِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ أَبُو عَبْد الرَّحْمَنِ عَبْدُ الرَّحْمَنِ بْنُ أَبِي لَيْلَى لَمْ يَسْمَعْ مِنْ عُمَرَ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah menceritakan kepada kami [Syarik] dari [Zubaid] dari ['Abdurrahman bin Abu Laila] dia berkata; ['Umar] berkata; \"sholat Jum'at dua raka'at, sholat Idul Fitri dua raka'at, dan sholat Safar dua raka'at. Itu semua adalah sempurna, bukan qashar (diringkas) menurut lisan Rasulullah shallallahu 'alaihi wasallam.\" Abu Abdurrahman berkata; Abdurrahman bin Abu Laila tidak mendengar dari Umar."
            },
            {
                "number": 1395,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ قَالَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي مُخَوَّلٌ قَالَ سَمِعْتُ مُسْلِمًا الْبَطِينَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ يَوْمَ الْجُمُعَةِ فِي صَلَاةِ الصُّبْحِ الم تَنْزِيلُ وَ هَلْ أَتَى عَلَى الْإِنْسَانِ وَفِي صَلَاةِ الْجُمُعَةِ بِسُورَةِ الْجُمُعَةِ وَالْمُنَافِقِينَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la Ash-Shan'ani] dia berkata; telah menceritakan kepada kami [Khalid bin Al Harits] dia berkata; telah menceritakan kepada kami [Syu'bah] dia berkata; telah mengabarkan kepadaku [Makhawwal] dia berkata; Aku mendengar [Muslim Al Bathin] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam pada hari Jum'at saat sholat Subuh membaca Alif Lam Mim Tanziil (surat As-Sajadah) dan Hal Ataa 'Alal Insaan (surah Al Insaan). Sedangkan pada sholat Jum'at beliau membaca surah Al Jumu'ah dan surah Al Munaafiquun."
            },
            {
                "number": 1396,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ قَالَ أَخْبَرَنِي مَعْبَدُ بْنُ خَالِدٍ عَنْ زَيْدِ بْنِ عُقْبَةَ عَنْ سَمُرَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي صَلَاةِ الْجُمُعَةِ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] dari [Syu'bah] dia berkata; telah mengabarkan kepadaku [Ma'bad bin Khalid] dari [Zaid bin 'Uqbah] dari [Samurah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam membaca surah Al A'laa dan Al Ghaasyiyah dalam sholat Jum'at.\""
            },
            {
                "number": 1397,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِأَنَّ الضَّحَّاكَ بْنَ قَيْسٍ سَأَلَ النُّعْمَانَ بْنَ بَشِيرٍ مَاذَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ يَوْمَ الْجُمُعَةِ عَلَى إِثْرِ سُورَةِ الْجُمُعَةِ قَالَ كَانَ يَقْرَأُ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Dhamrah bin Sa'id] dari ['ubaidhullah bin 'Abdullah] bahwasanya Adh Dhahhak bin Qais bertanya kepada [An Nu'man bin Basyir] \"Apa yang dibaca Rasulullah shallallahu 'alaihi wasallam pada hari Jum'at, sesudah membaca surah Al Jumu'ah?\" Ia menjawab: \"Beliau membaca surah Al Ghaasyiyah (Hal ataaka hadiitsul ghasyiyah).\""
            },
            {
                "number": 1398,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ أَنَّ إِبْرَاهِيمَ بْنَ مُحَمَّدِ بْنِ الْمُنْتَشِرِ أَخْبَرَهُ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْجُمُعَةِ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَ هَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ وَرُبَّمَا اجْتَمَعَ الْعِيدُ وَالْجُمُعَةُ فَيَقْرَأُ بِهِمَا فِيهِمَا جَمِيعًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] dari [Syu'bah] bahwasanya [Ibrahim bin Muhammad bin Al Muntasyir] mengabarkan kepadanya, dia berkata; Aku mendengar [bapakku] menceritakan dari [Habib bin Salim] dari [An Nu'man bin Basyir] dia berkata; Dalam sholat Jum'at, Rasulullah shallallahu 'alaihi wasallam membaca surah Al A'laa dan Al Ghasyiyah. Kadang hari raya bertepatan pada hari Jum'at, maka beliau membaca surah tersebut dalam kedua sholat tersebut.\""
            },
            {
                "number": 1399,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ وَمُحَمَّدُ بْنُ مَنْصُورٍ وَاللَّفْظُ لَهُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَدْرَكَ مِنْ صَلَاةِ الْجُمُعَةِ رَكْعَةً فَقَدْ أَدْرَكَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dan [Muhammad bin Manshur] -dan lafadz ini miliknya- dari [Sufyan] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa yang mendapatkan satu raka'at sholat jum'at maka ia telah mendapatkan sholat jum'at tersebut.\""
            },
            {
                "number": 1400,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى أَحَدُكُمْ الْجُمُعَةَ فَلْيُصَلِّ بَعْدَهَا أَرْبَعًا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Jarir] dari [Suhail] dari [bapaknya] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian mengerjakan sholat Jum'at, hendaklah dia sholat setelahnya empat raka'at.\""
            },
            {
                "number": 1401,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يُصَلِّي بَعْدَ الْجُمُعَةِ حَتَّى يَنْصَرِفَ فَيُصَلِّيَ رَكْعَتَيْنِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Nafi'] dari [Ibnu 'Umar] Bahwa Rasulullah shallallahu 'alaihi wasallam tidak mengerjakan sholat setelah sholat jum'at hingga beliau pulang lalu sholat dua raka'at."
            },
            {
                "number": 1402,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ فِي بَيْتِهِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami ['Abdurrazzaq] dia berkata; telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [bapaknya], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam sholat dua raka'at di rumahnya setelah sholat Jum'at.\""
            },
            {
                "number": 1403,
                "arab": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ عَنْ يَزِيدَ وَهُوَ ابْنُ هَارُونَ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّهُ كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ يُطِيلُ فِيهِمَا وَيَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُهُ",
                "id": "Telah mengabarkan kepada kami ['Abdah bin 'Abdullah] dari [Yazid bin Harun] dia berkata; telah memberitakan kepada kami [Syu'bah] dari [Ayyub] dari [Nafi'] dari [Ibnu 'Umar] bahwa dia sholat dua raka'at setelah sholat jum'at, dan dia memanjangkan sholatnya. Ibnu Umar berkata; Rasulullah shallallahu 'alaihi wasallam mengerjakan demikian."
            },
            {
                "number": 1404,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا بَكْرٌ يَعْنِي ابْنَ مُضَرَ عَنْ ابْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَأَتَيْتُ الطُّورَ فَوَجَدْتُ ثَمَّ كَعْبًا فَمَكَثْتُ أَنَا وَهُوَ يَوْمًا أُحَدِّثُهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيُحَدِّثُنِي عَنْ التَّوْرَاةِ فَقُلْتُ لَهُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُهْبِطَ وَفِيهِ تِيبَ عَلَيْهِ وَفِيهِ قُبِضَ وَفِيهِ تَقُومُ السَّاعَةُ مَا عَلَى الْأَرْضِ مِنْ دَابَّةٍ إِلَّا وَهِيَ تُصْبِحُ يَوْمَ الْجُمُعَةِ مُصِيخَةً حَتَّى تَطْلُعَ الشَّمْسُ شَفَقًا مِنْ السَّاعَةِ إِلَّا ابْنَ آدَمَ وَفِيهِ سَاعَةٌ لَا يُصَادِفُهَا مُؤْمِنٌ وَهُوَ فِي الصَّلَاةِ يَسْأَلُ اللَّهَ فِيهَا شَيْئًا إِلَّا أَعْطَاهُ إِيَّاهُ فَقَالَ كَعْبٌ ذَلِكَ يَوْمٌ فِي كُلِّ سَنَةٍ فَقُلْتُ بَلْ هِيَ فِي كُلِّ جُمُعَةٍ فَقَرَأَ كَعْبٌ التَّوْرَاةَ ثُمَّ قَالَ صَدَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ فِي كُلِّ جُمُعَةٍفَخَرَجْتُ فَلَقِيتُ بَصْرَةَ بْنَ أَبِي بَصْرَةَ الْغِفَارِيَّ فَقَالَ مِنْ أَيْنَ جِئْتَ قُلْتُ مِنْ الطُّورِ قَالَ لَوْ لَقِيتُكَ مِنْ قَبْلِ أَنْ تَأْتِيَهُ لَمْ تَأْتِهِ قُلْتُ لَهُ وَلِمَ قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُعْمَلُ الْمَطِيُّ إِلَّا إِلَى ثَلَاثَةِ مَسَاجِدَ الْمَسْجِدِ الْحَرَامِ وَمَسْجِدِي وَمَسْجِدِ بَيْتِ الْمَقْدِسِ فَلَقِيتُ عَبْدَ اللَّهِ بْنَ سَلَامٍ فَقُلْتُ لَوْ رَأَيْتَنِي خَرَجْتُ إِلَى الطُّورِ فَلَقِيتُ كَعْبًا فَمَكَثْتُ أَنَا وَهُوَ يَوْمًا أُحَدِّثُهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيُحَدِّثُنِي عَنْ التَّوْرَاةِ فَقُلْتُ لَهُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُهْبِطَ وَفِيهِ تِيبَ عَلَيْهِ وَفِيهِ قُبِضَ وَفِيهِ تَقُومُ السَّاعَةُ مَا عَلَى الْأَرْضِ مِنْ دَابَّةٍ إِلَّا وَهِيَ تُصْبِحُ يَوْمَ الْجُمُعَةِ مُصِيخَةً حَتَّى تَطْلُعَ الشَّمْسُ شَفَقًا مِنْ السَّاعَةِ إِلَّا ابْنَ آدَمَ وَفِيهِ سَاعَةٌ لَا يُصَادِفُهَا عَبْدٌ مُؤْمِنٌ وَهُوَ فِي الصَّلَاةِ يَسْأَلُ اللَّهَ شَيْئًا إِلَّا أَعْطَاهُ إِيَّاهُ قَالَ كَعْبٌ ذَلِكَ يَوْمٌ فِي كُلِّ سَنَةٍ فَقَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ كَذَبَ كَعْبٌ قُلْتُ ثُمَّ قَرَأَ كَعْبٌ فَقَالَ صَدَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ فِي كُلِّ جُمُعَةٍ فَقَالَ عَبْدُ اللَّهِ صَدَقَ كَعْبٌ إِنِّي لَأَعْلَمُ تِلْكَ السَّاعَةَ فَقُلْتُ يَا أَخِي حَدِّثْنِي بِهَا قَالَ هِيَ آخِرُ سَاعَةٍ مِنْ يَوْمِ الْجُمُعَةِ قَبْلَ أَنْ تَغِيبَ الشَّمْسُ فَقُلْتُ أَلَيْسَ قَدْ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يُصَادِفُهَا مُؤْمِنٌ وَهُوَ فِي الصَّلَاةِ وَلَيْسَتْ تِلْكَ السَّاعَةَ صَلَاةٌ قَالَ أَلَيْسَ قَدْ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ صَلَّى وَجَلَسَ يَنْتَظِرُ الصَّلَاةَ لَمْ يَزَلْ فِي صَلَاتِهِ حَتَّى تَأْتِيَهُ الصَّلَاةُ الَّتِي تُلَاقِيهَا قُلْتُ بَلَى قَالَ فَهُوَ كَذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Bakr bin Mudhar] dari [Ibnul Had] dari [Muhammad bin Ibrahim] dari [Abu Salamah bin 'Abdurrahman] dari [Abu Hurairah] dia berkata; \"Aku pernah datang ke (bukit) Thur dan aku mendapati Ka'ab di sana. Lalu aku dan dia menginap di sana selama satu hari. Aku menceritakan hadits dari Rasulullah Shalallahu 'Alaihi Wa Sallam kepadanya, sementara dia menceritakan Taurat kepadaku. Aku berkata kepadanya 'Rasulullah Shalallahu 'Alaihi Wa Sallam pernah bersabda: \"Sebaik-baik hari selama matahari terbit adalah hari Jum'at. Pada hari itu nabi Adam diciptakan, pada hari itu beliau diturunkan, pada hari itu beliau diterima taubatnya, pada hari itu pula beliau wafat, dan pada hari itu pula kiamat akan terjadi. Semua hewan di muka bumi berada di pagi hari Jum'at dalam keadaan mengoptimalkan pendengarannya hingga terbitnya matahari karena takut akan datangnya hari kiamat kecuali manusia. Pada hari Jum 'at ada suatu waktu yang tidaklah seorang mukmin pun yang berdoa ketika sholatnya meminta sesuatu kepada Allah bertepatan waktu itu, kecuali Allah akan mengabulkannya\".' Ka'ab lalu berkata; 'Waktu itu hanya ada dalam satu hari di setiap tahun'. Lalu kukatakan, 'Bahkan waktu itu ada pada setiap hari Jum'at'. Lantas Ka'ab membaca Taurat. Kemudian berkata; 'Rasulullah Shalallahu 'Alaihi Wa Sallam benar, hari itu ada pada setiap hari Jum'at'. Lalu aku keluar dan berjumpa dengan [Bashrah bin Abu Bashrah Al Ghifari], dan dia berkata; 'Kamu datang dari mana? ' Aku menjawab, 'Dari thur'. Ia berkata; 'Kalau saja aku berjumpa denganmu sebelum kamu datang ke Thur, maka kamu tidak akan mendatanginya'. Aku bertanya kepadanya; 'Mengapa bisa begitu? ' Ia menjelaskan; 'Aku pernah mendengar Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Tidak dipersiapkan kendaraan (perjalanan) kecuali ketiga masjid, yaitu Masjidil Haram, masjidku ini, dan masjid Baitul Maqdis\". Aku juga berjumpa dengan Abdullah bin Salam, kukatakan bahwa aku keluar dari Thur dan berjumpa dengan Ka'ab, lalu aku dan dan dia menginap di sana selama satu hari, dan aku menceritakan hadits dari Rasulullah Shalallahu 'Alaihi Wa Sallam kepadanya, sedangkan dia menceritakan Taurat kepadaku, kemudian aku berkata kepadanya bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam pernah bersabda: 'Sebaik-baik hari matahari terbit adalah hari Jum'at. Pada hari itu nabi Adam diciptakan, pada hari itu beliau diturunkan, pada hari itu beliau diterima taubatnya, pada hari itu beliau wafat, dan pada hari itu pula kiamat terjadi. Semua hewan di muka bumi berada di pagi hari Jum'at dalam keadaan mengoptimalkan pendengarannya hingga terbitnya matahari kecuali manusia. Di hari Jum'at ada suatu waktu, yang ketika itu tidaklah seorang mukmin pun yang berdoa di dalam sholatnya dan meminta sesuatu kepada Allah bertepatan dengan waktu itu kecuali Allah akan mengabulkannya\".'Ka'ab lalu berkata, 'Waktu ada pada satu hari di setiap tahun'. [Abdullah bin Salam] kemudian mengatakan bahwa Ka'ab telah berdusta, maka kukatakan bahwa Ka'ab membaca Taurat kemudian berkata, 'Rasulullah benar, hari itu ada pada setiap Jum'at'. kemudian Abdullah bin Salam berkata, 'Ka'ab benar, dan aku sangat mengetahui tentang waktu itu! Aku memohon kepadanya, 'Wahai saudaraku, beritakanlah hal itu kepadaku? ' Ia menjawab, 'Waktu itu adalah waktu terakhir pada hari Jum'at, sebelum matahari terbenam'. Kemudian aku menyanggahnya dengan bertanya, Bukankah kamu mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidaklah seorang mukmin berdoa bertepatan dengan waktu tersebut dalam sholatnya?\" Bukankah waktu itu adalah saat masih sholat? ' dia menjawab dengan bertanya juga, 'Bukankah kamu juga mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Barangsiapa sholat lalu duduk untuk menunggu sholat, maka ia senantiasa dihitung dalam keadaan sholat hingga datang waktu sholat berikutnya?\" 'Aku menjawab 'Ya'. Ia berkata, 'Maka hal tersebut juga seperti itu.'"
            },
            {
                "number": 1405,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ خَالِدٍ عَنْ رَبَاحٍ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي سَعِيدٌ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجُمُعَةِ سَاعَةً لَا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ يَسْأَلُ اللَّهَ فِيهَا شَيْئًا إِلَّا أَعْطَاهُ إِيَّاهُ",
                "id": "Telah mengabarkan kepadaku [Muhammad bin Yahya bin 'Abdullah] dia berkata; telah menceritakan kepada kami [Ahmad bin Hanbal] dia berkata; telah menceritakan kepada kami [Ibrahim bin Khalid] dari [Rabah] dari [Ma'mar] dari [Az Zuhri] dia berkata; telah menceritakan kepadaku [Sa'id] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Pada hari Jum'at ada suatu waktu yang bila seorang muslim meminta sesuatu kepada Allah bertepatan dengan waktu tersebut, Allah pasti memberinya.\""
            },
            {
                "number": 1406,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ قَالَ أَنْبَأَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فِي الْجُمُعَةِ سَاعَةً لَا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ قَائِمٌ يُصَلِّي يَسْأَلُ اللَّهَ عَزَّ وَجَلَّ شَيْئًا إِلَّا أَعْطَاهُ إِيَّاهُ قُلْنَا يُقَلِّلُهَا يُزَهِّدُهَاقَالَ أَبُو عَبْد الرَّحْمَنِ لَا نَعْلَمُ أَحَدًا حَدَّثَ بِهَذَا الْحَدِيثِ غَيْرَ رَبَاحٍ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ إِلَّا أَيُّوبَ بْنَ سُوَيْدٍ فَإِنَّهُ حَدَّثَ بِهِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ وَأَبِي سَلَمَةَ وَأَيُّوبُ بْنُ سُوَيْدٍ مَتْرُوكُ الْحَدِيثِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin Zurarah] dia berkata; telah memberitakan kepada kami [Isma'il] dari [Ayyub] dari [Muhammad] dari [Abu Hurairah] dia berkata; bahwa Abu Al Qasim shallallahu 'alaihi wasallam bersabda: \"Pada hari Jum'at ada waktu yang bila ada seorang muslim sholat dan meminta sesuatu kepada Allah bertepatan dengan waktu itu, Allah Azza wa Jaalla pasti memberinya.\" Abu Abdurrahman berkata; 'Kami tidak mengetahui seorangpun yang menceritakan Hadist ini selain Rabah dari Ma'mar dari Az Zuhri. Juga Ayyub bin Suwaid yang menceritakan hal ini dari Yunus dari Az Zuhri dari Sa? d dan Abu Salamah. Ayyub bin Suwaid orangnya matrukul Hadist."
            },
            {
                "number": 1407,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ عَنْ ابْنِ أَبِي عَمَّارٍ عَنْ عَبْدِ اللَّهِ بْنِ بَابَيْهِ عَنْ يَعْلَى بْنِ أُمَيَّةَ قَالَقُلْتُ لِعُمَرَ بْنِ الْخَطَّابِ{ لَيْسَ عَلَيْكُمْ جُنَاحٌ أَنْ تَقْصُرُوا مِنْ الصَّلَاةِ إِنْ خِفْتُمْ أَنْ يَفْتِنَكُمْ الَّذِينَ كَفَرُوا }فَقَدْ أَمِنَ النَّاسُ فَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ عَجِبْتُ مِمَّا عَجِبْتَ مِنْهُ فَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَقَالَ صَدَقَةٌ تَصَدَّقَ اللَّهُ بِهَا عَلَيْكُمْ فَاقْبَلُوا صَدَقَتَهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami ['Abdullah bin Idris] dia berkata; telah memberitakan kepada kami [Ibnu Juraij] dari [Ibnu Abu 'Ammar] dari ['Abdullah bin Babaih] dari [Ya'la bin Umayyah] dia berkata;? ku pernah bertanya kepada ['Umar bin Al Khaththab] tentang ayat, 'Tidaklah apa-apa bagi kalian untuk mengqashar\/meringkas sholat jika kalian takut (khawatir) diserang orang-orang kafir'. (Qs. An-Nisaa' (4): 101), bukankah sekarang manusia sudah merasa aman?!\" Lalu Umar menjawab, \"Aku juga heran seperti kamu, dan aku juga pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam seperti itu? Beliau menjawab: 'Itu sedekah yang Allah sedekahkan kepada kalian, maka terimalah sedekah-Nya'.\""
            },
            {
                "number": 1408,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أُمَيَّةَ بْنِ عَبْدِ اللَّهِ بْنِ خَالِدٍأَنَّهُ قَالَ لِعَبْدِ اللَّهِ بْنِ عُمَرَ إِنَّا نَجِدُ صَلَاةَ الْحَضَرِ وَصَلَاةَ الْخَوْفِ فِي الْقُرْآنِ وَلَا نَجِدُ صَلَاةَ السَّفَرِ فِي الْقُرْآنِ فَقَالَ لَهُ ابْنُ عُمَرَ يَا ابْنَ أَخِي إِنَّ اللَّهَ عَزَّ وَجَلَّ بَعَثَ إِلَيْنَا مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا نَعْلَمُ شَيْئًا وَإِنَّمَا نَفْعَلُ كَمَا رَأَيْنَا مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Abdullah bin Abu Bakr bin 'Abdurrahman] dari ['Umayyah bin 'Abdullah bin Khalid] bahwasanya ia pernah berkata kepada ['Abdullah bin 'Umar]; \"Kami telah mendapati sholat saat mukim dan sholat saat takut (perang) di dalam Al Qur'an, tetapi kami tidak mendapati di dalamnya tentang sholat dalam perjalanan (safar)?\" Ibnu Umar lalu berkata kepadanya; \"Wahai saudaraku, Allah Azza wa Jalla telah mengutus Muhammad shallallahu 'alaihi wasallam dalam keadaan kita tidak mengetahui apa-apa, dan kita tidak melakukan apa-apa selain apa yang dilakukan oleh Muhammad shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 1409,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ مَنْصُورِ بْنِ زَاذَانَ عَنْ ابْنِ سِيرِينَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ مَكَّةَ إِلَى الْمَدِينَةِ لَا يَخَافُ إِلَّا رَبَّ الْعَالَمِينَ يُصَلِّي رَكْعَتَيْنِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Husyaim] dari [Manshur bin Zadzan] dari [Ibnu Sirin] dari [Ibnu 'Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam keluar dari Makkah menuju Madinah tanpa takut kecuali kepada Tuhan semesta alam, dan beliau mengerjakan sholat dua raka'at."
            },
            {
                "number": 1410,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ ابْنِ عَبَّاسٍ قَالَكُنَّا نَسِيرُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ مَكَّةَ وَالْمَدِينَةِ لَا نَخَافُ إِلَّا اللَّهَ عَزَّ وَجَلَّ نُصَلِّي رَكْعَتَيْنِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Ibnu 'Aun] dari [Muhammad] dari [Ibnu 'Abbas] dia berkata; \"Kami pernah bepergian bersama Rasulullah shallallahu 'alaihi wasallam di antara Makkah dan Madinah tanpa takut kecuali kepada Allah Azza wa Jalla, lalu kami sholat dua raka'at."
            },
            {
                "number": 1411,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ بْنِ خُمَيْرٍ قَالَ سَمِعْتُ حَبِيبَ بْنَ عُبَيْدٍ يُحَدِّثُ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ ابْنِ السِّمْطِ قَالَرَأَيْتُ عُمَرَ بْنَ الْخَطَّابِ يُصَلِّي بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ فَسَأَلْتُهُ عَنْ ذَلِكَ فَقَالَ إِنَّمَا أَفْعَلُ كَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْعَلُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [An Nadhr bin Syumail] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Yazid bin Khumair] dia berkata; Aku mendengar [Habib bin 'Ubaid] menceritakan dari [Jubair bin Nufair] dari [Ibnu As Simthi] dia berkata; \"Aku melihat [Umar bin Khaththab] sholat dua raka'at di Dzilhulaifah, maka aku tanyakan tentang hal itu lalu dia menjawab; Aku tidak melakukannya melainkan hanya karena aku melihat Rasulullah shallallahu 'alaihi wasallam melakukannya'.\""
            },
            {
                "number": 1412,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ يَحْيَى بْنِ أَبِي إِسْحَقَ عَنْ أَنَسٍ قَالَخَرَجْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمَدِينَةِ إِلَى مَكَّةَ فَلَمْ يَزَلْ يَقْصُرُ حَتَّى رَجَعَ فَأَقَامَ بِهَا عَشْرًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Yahya bin Abu Ishaq] dari [Anas] dia berkata; \"Aku pernah berangkat bersama Rasulullah shallallahu 'alaihi wasallam dari Madinah menuju Makkah, dan beliau senantiasa mengqashar\/meringkas sholat hingga beliau kembali. Kemudian beliau menetap di Makkah selama sepuluh hari.\""
            },
            {
                "number": 1413,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحَسَنِ بْنِ شَقِيقٍ قَالَ أَبِي أَنْبَأَنَا أَبُو حَمْزَةَ وَهُوَ السُّكَّرِيُّ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَصَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السَّفَرِ رَكْعَتَيْنِ وَمَعَ أَبِي بَكْرٍ رَكْعَتَيْنِ وَمَعَ عُمَرَ رَكْعَتَيْنِ رَضِيَ اللَّهُ عَنْهُمَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Ali bin Al Hasan bin Syaqiq]; berkata [bapakku]; telah memberitakan kepada kami [Abu Hamzah As Sukkari] dari [Manshur] dari [Ibrahim] dari ['Alqamah] dari ['Abdullah] dia berkata; \"Aku pernah sholat dua raka'at bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan. Aku juga sholat dua raka'at ketika bersama Abu Bakar Radliallahu? nhu dan juga ketika bersama Umar Radliallahu? nhuma."
            },
            {
                "number": 1414,
                "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ سُفْيَانَ وَهُوَ ابْنُ حَبِيبٍ عَنْ شُعْبَةَ عَنْ زُبَيْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عُمَرَ قَالَصَلَاةُ الْجُمُعَةِ رَكْعَتَانِ وَالْفِطْرِ رَكْعَتَانِ وَالنَّحْرِ رَكْعَتَانِ وَالسَّفَرِ رَكْعَتَانِ تَمَامٌ غَيْرُ قَصْرٍ عَلَى لِسَانِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dari [Sufyan bin Habib] dari [Syu'bah] dari [Zubaid] dari ['Abdurrahman bin Abu Laila] dari ['Umar] dia berkata; \"sholat Jum'at dua raka'at, sholat Idul Fitri dua raka'at, sholat Idul Adha dua raka? t, dan juga safar dua raka'at. Itu semua (dilaksanakan) sempurna bukan qashar, menurut lisan Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 1415,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ وَهْبٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنِي أَبُو عَبْدِ الرَّحِيمِ قَالَ حَدَّثَنِي زَيْدٌ عَنْ أَيُّوبَ وَهُوَ ابْنُ عَائِذٍ عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ عَنْ مُجَاهِدٍ أَبِي الْحَجَّاجِ عَنْ ابْنِ عَبَّاسٍ قَالَفُرِضَتْ صَلَاةُ الْحَضَرِ عَلَى لِسَانِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعًا وَصَلَاةُ السَّفَرِ رَكْعَتَيْنِ وَصَلَاةُ الْخَوْفِ رَكْعَةً",
                "id": "Telah mengabarkan kepadaku [Muhammad bin Wahb] dia berkata; telah menceritakan kepada kami [Muhammad bin Salamah] dia berkata; telah menceritakan kepadaku [Abu 'Abdurrahim] dia berkata; telah menceritakan kepadaku [Zaid] dari [Ayyub bin 'Aidz] dari [Bukair bin Al Akhnas] dari [Mujahid Abul Hajjaj] dari [Ibnu 'Abbas] dia berkata; \"sholat empat raka'at diwajibkan bagi yang bermukim, melalui lisan Nabi shallallahu 'alaihi wasallam. Adapun sholat safar adalah dua raka'at dan sholat Khauf dilaksanakan satu raka'at.\""
            },
            {
                "number": 1416,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ مَاهَانَ قَالَ حَدَّثَنَا الْقَاسِمُ بْنُ مَالِكٍ عَنْ أَيُّوبَ بْنِ عَائِذٍ عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَإِنَّ اللَّهَ عَزَّ وَجَلَّ فَرَضَ الصَّلَاةَ عَلَى لِسَانِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَضَرِ أَرْبَعًا وَفِي السَّفَرِ رَكْعَتَيْنِ وَفِي الْخَوْفِ رَكْعَةً",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Mahan] dia berkata; telah menceritakan kepada kami [Al Qasim bin Malik] dari [Ayyub bin 'Aidz] dari [Bukair bin Al Akhnas] dari [Mujahid] dari [Ibnu 'Abbas] dia berkata; \"Allah Azza wa Jalla mewajibkan sholat empat raka'at melalui lisan Nabi shallallahu 'alaihi wasallam saat mukim. Ketika dalam perjalanan dua raka'at dan ketika dalam keadaan khauf (takut) satu raka'at.\""
            },
            {
                "number": 1417,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى فِي حَدِيثِهِ عَنْ خَالِدِ بْنِ الْحَارِثِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ مُوسَى وَهُوَ ابْنُ سَلَمَةَ قَالَقُلْتُ لِابْنِ عَبَّاسٍ كَيْفَ أُصَلِّي بِمَكَّةَ إِذَا لَمْ أُصَلِّ فِي جَمَاعَةٍ قَالَ رَكْعَتَيْنِ سُنَّةَ أَبِي الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dalam haditsnya dari [Khalid bin Al Harits] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dia berkata; Aku mendengar [Musa bin Salamah] berkata; \"Aku berkata kepada [Ibnu Abbas], 'Bagaimana cara kami sholat di Makkah bila aku tidak sholat berjama'ah? ' Ia menjawab, \"Dua raka'at. Itulah sunnah Abu Al Qasim shallallahu 'alaihi wasallam'.\""
            },
            {
                "number": 1418,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا سَعِيدٌ قَالَ حَدَّثَنَا قَتَادَةُ أَنَّ مُوسَى بْنَ سَلَمَةَ حَدَّثَهُمْأَنَّهُ سَأَلَ ابْنَ عَبَّاسٍ قُلْتُ تَفُوتُنِي الصَّلَاةُ فِي جَمَاعَةٍ وَأَنَا بِالْبَطْحَاءِ مَا تَرَى أَنْ أُصَلِّيَ قَالَ رَكْعَتَيْنِ سُنَّةَ أَبِي الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Yazid bin Zurai'] dia berkata; telah menceritakan kepada kami [Sa'id] dia berkata; telah menceritakan kepada kami [Qatadah] bahwasanya [Musa bin Salamah] menceritakan kepada meraka bahwa dia pernah bertanya kepada [Ibnu Abbas], \"Aku berkata, 'Aku ketinggalan -sholat- berjama'ah saat di Bathha', maka apa pendapatmu tentang caraku mengerjakan sholat? ' Ia menjawab; 'sholat dua raka'at. Itu adalah Sunnah Abu Al Qasim shallallahu 'alaihi wasallam'.\""
            },
            {
                "number": 1419,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ حَارِثَةَ بْنِ وَهْبٍ الْخُزَاعِيِّ قَالَصَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى آمَنَ مَا كَانَ النَّاسُ وَأَكْثَرَهُ رَكْعَتَيْنِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abul Ahwash] dari [Abu Ishaq] dari [Haritsah bin Wahb Al Khuza'i] dia berkata; \"Aku pernah sholat dua raka'at bersama Rasulullah shallallahu 'alaihi wasallam di Mina -saat itu kondisi manusia sangat aman dan banyak-.\""
            },
            {
                "number": 1420,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ ح وَأَنْبَأَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ أَخْبَرَنِي أَبُو إِسْحَقَ عَنْ حَارِثَةَ بْنِ وَهْبٍ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى أَكْثَرَ مَا كَانَ النَّاسُ وَآمَنَهُ رَكْعَتَيْنِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; telah menceritakan kepada kami [Syu'bah] dia berkata; telah menceritakan kepada kami [Abu Ishaq]. Dan diriwayatkan pula dari jalur lain, telah memberitakan kepada kami ['Amru bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; telah menceritakan kepada kami [Sufyan] dia berkata; telah mengabarkan kepadaku [Abu Ishaq] dari [Haritsah bin Wahb] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah sholat dua raka'at bersama kami di Mina, saat itu kondisi manusia sangat banyak dan aman.\""
            },
            {
                "number": 1421,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ بُكَيْرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي سُلَيْمَانَ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ قَالَصَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى وَمَعَ أَبِي بَكْرٍ وَعُمَرَ رَكْعَتَيْنِ وَمَعَ عُثْمَانَ رَكْعَتَيْنِ صَدْرًا مِنْ إِمَارَتِهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Bukair] dari [Muhammad bin 'Abdullah bin Abu Sulaiman] dari [Anas bin Malik] ia berkata; \"Aku pernah sholat bersama Rasulullah shallallahu 'alaihi wasallam di Mina. Juga pernah bersama Abu Bakar, Umar, dan Utsman pada awal pemerintahannya.\""
            },
            {
                "number": 1422,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ عَنْ الْأَعْمَشِ قَالَ حَدَّثَنَا إِبْرَاهِيمُ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ يَزِيدَ ح وَأَنْبَأَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ قَالَصَلَّيْتُ بِمِنًى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami ['Abdul Wahid] dari [Al A'masy] dia berkata; telah menceritakan kepada kami [Ibrahim] dia berkata; aku mendengar ['Abdurrahman bin Yazid] dan diriwayatkan pula dari jalur lain, telah memberitakan kepada kami [Mahmud bin Ghailan] dia berkata; telah menceritakan kepada kami [Yahya bin Adam] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Ibrahim] dari ['Abdurrahman bin Yazid] dari ['Abdullah radliallahu 'anhu] dia berkata; \"Aku pernah sholat dua raka'at bersama Rasulullah shallallahu 'alaihi wasallam di Mina.\""
            },
            {
                "number": 1423,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ قَالَ حَدَّثَنَا عِيسَى عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ قَالَصَلَّى عُثْمَانُ بِمِنًى أَرْبَعًا حَتَّى بَلَغَ ذَلِكَ عَبْدَ اللَّهِ فَقَالَ لَقَدْ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Khusyram] dia berkata; telah menceritakan kepada kami ['Isa] dari [Al A'masy] dari [Ibrahim] dari ['Abdurrahman bin Yazid] dia berkata; \"Aku pernah sholat empat raka'at bersama Utsman di Mina. Hal tersebut sampai kepada [Abdullah], maka ia berkata; 'Aku pernah sholat dua raka'at bersama Rasulullah shallallahu 'alaihi wasallam'.\""
            },
            {
                "number": 1424,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ أَنْبَأَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَصَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى رَكْعَتَيْنِوَمَعَ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ رَكْعَتَيْنِ وَمَعَ عُمَرَ رَضِيَ اللَّهُ عَنْهُ رَكْعَتَيْنِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dia berkata; telah memberitakan kepada kami [Yahya] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu 'Umar] dia berkata; \"Aku pernah sholat dua raka'at bersama Rasulullah shallallahu 'alaihi wasallam di Mina. Aku juga sholat dua raka'at bersama Abu Bakar Radliallahu? nhu dan Umar Radliallahu? nhu.\""
            },
            {
                "number": 1425,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى رَكْعَتَيْنِوَصَلَّاهَا أَبُو بَكْرٍ رَكْعَتَيْنِ وَصَلَّاهَا عُمَرُ رَكْعَتَيْنِ وَصَلَّاهَا عُثْمَانُ صَدْرًا مِنْ خِلَافَتِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku ['ubaidhullah bin 'Abdullah bin 'Umar] dari [bapaknya] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah sholat dua raka'at di Mina. Abu Bakar dan Umar juga sholat dua raka'at di tempat tersebut, serta Utsman pada awal pemerintahannya.\""
            },
            {
                "number": 1426,
                "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ قَالَ حَدَّثَنَا يَزِيدُ قَالَ أَنْبَأَنَا يَحْيَى بْنُ أَبِي إِسْحَقَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمَدِينَةِ إِلَى مَكَّةَ فَكَانَ يُصَلِّي بِنَا رَكْعَتَيْنِ حَتَّى رَجَعْنَا قُلْتُ هَلْ أَقَامَ بِمَكَّةَ قَالَ نَعَمْ أَقَمْنَا بِهَا عَشْرًا",
                "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dia berkata; telah menceritakan kepada kami [Yazid] dia berkata; telah memberitakan kepada kami [Yahya bin Abu Ishaq] dari [Anas bin Malik] dia berkata; \"Kami pernah berangkat bersama Rasulullah shallallahu 'alaihi wasallam dari Madinah ke Makkah, dan beliau mengerjakan sholat dua raka'at hingga kami pulang.\" Saya bertanya, \"Apakah beliau bermukim di Makkah?\" Anas menjawab; \"Ya, kami menetap di Makkah selama sepuluh hari."
            },
            {
                "number": 1427,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ الْأَسْوَدِ الْبَصْرِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ رَبِيعَةَ عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَامَ بِمَكَّةَ خَمْسَةَ عَشَرَ يُصَلِّي رَكْعَتَيْنِ رَكْعَتَيْنِ",
                "id": "Telah mengabarkan kepada kami ['Abdurrahman bin Al Aswad Al Bashri] dia berkata; telah menceritakan kepada kami [Muhammad bin Rabi'ah] dari ['Abdul Humaid bin Ja'far] dari [Yazid bin Abu Habib] dari ['Irak bin Malik] dari ['ubaidhullah bin 'Abdullah] dari [Ibnu 'Abbas] Rasulullah shallallahu 'alaihi wasallam pernah menetap di Makkah selama lima belas hari (hari) dan beliau mengerjakan sholat dua raka'at, dua raka'at."
            },
            {
                "number": 1428,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ زَنْجُوَيْهِ عَنْ عَبْدِ الرَّزَّاقِ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي إِسْمَعِيلُ بْنُ مُحَمَّدِ بْنِ سَعْدٍ أَنَّ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ أَخْبَرَهُ أَنَّ السَّائِبَ بْنَ يَزِيدَ أَخْبَرَهُ أَنَّهُ سَمِعَ الْعَلَاءَ بْنَ الْحَضْرَمِيِّ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْكُثُ الْمُهَاجِرُ بَعْدَ قَضَاءِ نُسُكِهِ ثَلَاثًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul Malik bin Zanjuwaih] dari ['Abdurrazzaq] dari [Ibnu Juraij] dia berkata; telah mengabarkan kepadaku [Isma'il bin Muhammad bin Sa'ad] telah mengabarkan kepadanya [Humaid bin 'Abdurrahman] telah mengabarkan kepadanya [As Saib bin Yazid] bahwasa ia mendengar [Al 'Ala bin Al Hadhrami] berkata; Rasulullah bersabda: \"Orang yang hijrah menetap (di Makkah) selama tiga hari setelah selesai melaksanakan ibadah haji.\""
            },
            {
                "number": 1429,
                "arab": "أَخْبَرَنَا أَبُو عَبْد الرَّحْمَنِ قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ فِي حَدِيثِهِ عَنْ سُفْيَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ عَنْ السَّائِبِ بْنِ يَزِيدَ عَنْ الْعَلَاءِ بْنِ الْحَضْرَمِيِّ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْكُثُ الْمُهَاجِرُ بِمَكَّةَ بَعْدَ نُسُكِهِ ثَلَاثًا",
                "id": "Telah mengabarkan kepada kami Abu 'Abdurrahman, berkata [Al Harits bin Miskin]; secara baca dan aku mendengar Hadistnya dari [Sufyan] dari ['Abdurrahman bin Humaid] dari [As Saib bin Yazid] dari [Al 'Ala bin Al Hadhrami] dia berkata; bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang hijrah menetap di Makkah selama tiga hari setelah melaksanakan ibadah haji.\""
            },
            {
                "number": 1430,
                "arab": "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى الصُّوفِيُّ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا الْعَلَاءُ بْنُ زُهَيْرٍ الْأَزْدِيُّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْأَسْوَدِ عَنْ عَائِشَةَأَنَّهَا اعْتَمَرَتْ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمَدِينَةِ إِلَى مَكَّةَ حَتَّى إِذَا قَدِمَتْ مَكَّةَ قَالَتْ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي قَصَرْتَ وَأَتْمَمْتُ وَأَفْطَرْتَ وَصُمْتُ قَالَ أَحْسَنْتِ يَا عَائِشَةُ وَمَا عَابَ عَلَيَّ",
                "id": "Telah mengabarkan kepadaku [Ahmad bin Yahya Ash Shufi] dia berkata; telah menceritakan kepada kami [Abu Nu'aim] dia berkata; telah menceritakan kepada kami [Al 'Alaa bin Zuhair Al Azdi] dia berkata; telah menceritakan kepada kami ['Abdurrahman bin Al Aswad] dari ['Aisyah] bahwasanya ia melaksanakan umrah bersama Rasulullah Shalallahu 'Alaihi Wa Sallam dari Madinah ke Makkah. Tatkala sampai di Makkah Aisyah berkata; Wahai Rasulullah, demi Bapak dan Ibuku, bagaimana engkau mengqashar sholat padahal aku menyempurnakan sholatku, dan engkau berbuka sedangkan aku berpuasa? Rasulullah Shalallahu 'Alaihi Wa sallam menjawab: Engkau telah berbuat baik wahai ' Aisyah, namun aku pun tidak tercela."
            },
            {
                "number": 1431,
                "arab": "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا الْعَلَاءُ بْنُ زُهَيْرٍ قَالَ حَدَّثَنَا وَبَرَةُ بْنُ عَبْدِ الرَّحْمَنِ قَالَكَانَ ابْنُ عُمَرَ لَا يَزِيدُ فِي السَّفَرِ عَلَى رَكْعَتَيْنِ لَا يُصَلِّي قَبْلَهَا وَلَا بَعْدَهَا فَقِيلَ لَهُ مَا هَذَا قَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ",
                "id": "Telah mengabarkan kepadaku [Ahmad bin Yahya] dia berkata; telah menceritakan kepada kami [Abu Nu'aim] dia berkata; telah menceritakan kepada kami [Al 'Ala bin Zuhair] dia berkata; telah menceritakan kepada kami [Wabarah bin 'Abdurrahman] dia berkata; \"sholat Ibnu Umar dalam Safar (perjalanan) tidak pernah melebihi dua raka'at, dan dia tidak mengerjakan sholat sunnah sesudah maupun sebelumnya. Lalu [Ibnu Umar] ditanya, \"Apa ini? ' Ia menjawab; 'Begitulah, aku melihat Rasulullah shallallahu 'alaihi wasallam melakukannya'.\""
            },
            {
                "number": 1432,
                "arab": "أَخْبَرَنِي نُوحُ بْنُ حَبِيبٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا عِيسَى بْنُ حَفْصِ بْنِ عَاصِمٍ قَالَ حَدَّثَنِي أَبِي قَالَكُنْتُ مَعَ ابْنِ عُمَرَ فِي سَفَرٍ فَصَلَّى الظُّهْرَ وَالْعَصْرَ رَكْعَتَيْنِ ثُمَّ انْصَرَفَ إِلَى طِنْفِسَةٍ لَهُ فَرَأَى قَوْمًا يُسَبِّحُونَ قَالَ مَا يَصْنَعُ هَؤُلَاءِ قُلْتُ يُسَبِّحُونَ قَالَ لَوْ كُنْتُ مُصَلِّيًا قَبْلَهَا أَوْ بَعْدَهَا لَأَتْمَمْتُهَا صَحِبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ لَا يَزِيدُ فِي السَّفَرِ عَلَى الرَّكْعَتَيْنِ وَأَبَا بَكْرٍ حَتَّى قُبِضَ وَعُمَرَ وَعُثْمَانَ رَضِيَ اللَّهُ عَنْهُمْ كَذَلِكَ",
                "id": "Telah mengabarkan kepadaku [Nuh bin Habib] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; telah menceritakan kepada kami ['Isa bin Hafsh bin 'Ashim] dia berkata; [bapakku] telah menceritakan kepadaku, dia berkata; \"Aku pernah bersama [Ibnu Umar] dalam suatu perjalanan. Dia mengerjakan sholat Zhuhur dan Ashar dua raka'at, kemudian pergi ke tikarnya. Setelah itu ia melihat suatu kaum yang sedang bertasbih, maka dia berkata, 'Apa yang sedang mereka perbuat? ' Aku menjawab, 'Mereka sedang bertasbih'. Dia berkata lagi, 'Seandainya aku sholat sebelum dan sesudahnya, maka aku pasti menyempurnakannya. Aku pernah menemani Rasulullah shallallahu 'alaihi wasallam, dan beliau dalam perjalanan tidak pernah sholat lebih dari dua raka'at. Begitu pula Abu Bakar hingga wafat, Umar, serta Utsman Radliallahu? nhum'.\""
            },
            {
                "number": 1433,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ يُونُسَ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ تَعَالَى لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ وَلَكِنَّ اللَّهَ عَزَّ وَجَلَّ يُخَوِّفُ بِهِمَا عِبَادَهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Hammad] dari [Yunus] dari [Al Hasan] dari [Abu Bakrah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Matahari dan Bulan adalah dua tanda dari tanda-tanda kebesaran Allah Ta'ala. Keduanya tidak mengalami gerhana karena kematian atau kelahiran seseorang, tetapi Allah Azza wa Jalla menakut-nakuti hamba-Nya dengan keduanya'.\""
            },
            {
                "number": 1434,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا أَبُو هِشَامٍ هُوَ الْمُغِيرَةُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا أَبُو مَسْعُودٍ الْجُرَيْرِيُّ عَنْ حَيَّانَ بْنِ عُمَيْرٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ قَالَبَيْنَا أَنَا أَتَرَامَى بِأَسْهُمٍ لِي بِالْمَدِينَةِ إِذْ انْكَسَفَتْ الشَّمْسُ فَجَمَعْتُ أَسْهُمِي وَقُلْتُ لَأَنْظُرَنَّ مَا أَحْدَثَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي كُسُوفِ الشَّمْسِ فَأَتَيْتُهُ مِمَّا يَلِي ظَهْرَهُ وَهُوَ فِي الْمَسْجِدِ فَجَعَلَ يُسَبِّحُ وَيُكَبِّرُ وَيَدْعُو حَتَّى حُسِرَ عَنْهَا قَالَ ثُمَّ قَامَ فَصَلَّى رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Mubarak] dia berkata; telah menceritakan kepada kami [Abu Hasyim Al Mughirah bin Salamah] dia berkata; telah menceritakan kepada kami [Wuhaib] dia berkata; telah menceritakan kepada kami [Abu Mas'ud Al Jurairi] dari [Hayyan bin 'Umari] dia berkata; telah menceritakan kepada kami ['Abdurrahman bin Samurah] dia berkata; \"Ketika aku melemparkan anak panahku di Madinah, tiba-tiba terjadi gerhana Matahari, maka aku mengumpulkan anak panah tersebut lalu berkata; 'Aku akan memperhatikan apa yang diperbuat oleh Rasulullah shallallahu 'alaihi wasallam saat terjadi gerhana Matahari'. Aku mendatangi beliau dari belakangnya ketika beliau di Masjid. Beliau bertasbih, bertakbir, dan berdo'a hingga selesai gerhana.\" Ia berkata; \"kemudian beliau berdiri dan sholat dua rakaat dengan empat kali sujud.\""
            },
            {
                "number": 1435,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ حَدَّثَهُ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ تَعَالَى فَإِذَا رَأَيْتُمُوهُمَا فَصَلُّوا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah memberitakan kepada kami [Ibnu Wahb] dari ['Umar bin Al Harits] bahwasanya ['Abdurrahman bin Al Qasim] menceritakan kepadanya dari [bapaknya] dari ['Abdullah bin 'Umar] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Matahari dan bulan tidak akan terjadi karena kelahiran atau kematian seseorang, tetapi keduanya adalah dua tanda dari tanda-tanda kebesaran Allah Ta'ala. Jika kalian melihat kedua gerhana tersebut maka sholatlah.\""
            },
            {
                "number": 1436,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى عَنْ إِسْمَعِيلَ قَالَ حَدَّثَنِي قَيْسٌ عَنْ أَبِي مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ عَزَّ وَجَلَّ فَإِذَا رَأَيْتُمُوهُمَا فَصَلُّوا",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; telah menceritakan kepada kami [Yahya] dari [Isma'il] dia berkata; telah menceritakan kepadaku [Qais] dari [Abu Mas'ud] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Matahari dan bulan tidak akan terjadi karena kelahiran atau kematian seseorang, tetapi keduanya adalah dua tanda diantara tanda-tanda kebesaran Allah Azza wa Jalla. Jika kalian melihat kedua gerhana tersebut, maka sholatlah.\""
            },
            {
                "number": 1437,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ كَامِلٍ الْمَرْوَزِيُّ عَنْ هُشَيْمٍ عَنْ يُونُسَ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ عَزَّ وَجَلَّ وَإِنَّهُمَا لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ فَإِذَا رَأَيْتُمُوهُمَا فَصَلُّوا حَتَّى تَنْجَلِيَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Kamil Al Marwazi] dari [Husyaim] dari [Yunus] dari [Al Hasan] dari [Abu Bakrah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: 'Matahari dan bulan tidak akan terjadi karena kelahiran atau kematian seseorang, tetapi keduanya adalah dua tanda diantara tanda-tanda kebesaran Allah Azza wa Jalla. Jika kalian melihat kedua gerhana tersebut, maka sholatlah hingga terang lagi'.\""
            },
            {
                "number": 1438,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَا حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا أَشْعَثُ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ قَالَكُنَّا جُلُوسًا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَسَفَتْ الشَّمْسُ فَوَثَبَ يَجُرُّ ثَوْبَهُ فَصَلَّى رَكْعَتَيْنِ حَتَّى انْجَلَتْ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dan [Muhammad bin 'Abdul A'la] mereka berdua berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Asy'ats] dari [Al Hasan] dari [Abu Bakrah] dia berkata; \"ketika kami duduk bersama Nabi shallallahu 'alaihi wasallam, tiba-tiba terjadi gerhana Matahari. Beliau lalu beranjak sambil menarik bajunya, kemudian mengerjakan sholat hingga terang kembali.\""
            },
            {
                "number": 1439,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدٍ قَالَ حَدَّثَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْخَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُنَادِيًا يُنَادِي أَنْ الصَّلَاةَ جَامِعَةً فَاجْتَمَعُوا وَاصْطَفُّوا فَصَلَّى بِهِمْ أَرْبَعَ رَكَعَاتٍ فِي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Utsman bin Sa'id] dia berkata; telah menceritakan kepada kami [Al Walid] dari [Al Auza'i] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] dia berkata; \" Telah terjadi gerhana matahari pada masa Rasulullah shallallahu 'alaihi wasallam, lalu Nabi shallallahu 'alaihi wasallam memerintahkan mu'adzin untuk menyeru 'Ash sholatu Jami'ah' (marilah kita bersama tegakkan sholat), maka orang-orang berkumpul dan menyusun barisan, kemudian beliau sholat dua rakaat bersama mereka, dengan empat kali ruku' dan empat kali sujud.\""
            },
            {
                "number": 1440,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ خَلِيٍّ قَالَ حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ عَنْ أَبِيهِ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكَسَفَتْ الشَّمْسُ فِي حَيَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمَسْجِدِ فَقَامَ فَكَبَّرَ وَصَفَّ النَّاسُ وَرَاءَهُ فَاسْتَكْمَلَ أَرْبَعَ رَكَعَاتٍ وَأَرْبَعَ سَجَدَاتٍ وَانْجَلَتْ الشَّمْسُ قَبْلَ أَنْ يَنْصَرِفَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Khalid bin Khali] dia berkata; telah menceritakan kepada kami [Bisyr bin Syu'aib] dari [bapaknya] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku ['Urwah bin Az Zubair] bahwasanya ['Aisyah] -istri Nabi shallallahu 'alaihi wasallam- berkata; \"-Ketika- terjadi gerhana pada masa Rasulullah shallallahu 'alaihi wasallam, beliau keluar menuju Masjid, kemudian berdiri dan bertakbir, maka orang-orang membuat shaf di belakang beliau. Beliau sholat empat kali ruku' dan empat kali sujud, sementara gerhana telah terang (usai) sebelum beliau selesai sholat.\""
            },
            {
                "number": 1441,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ عَنْ إِسْمَعِيلَ ابْنِ عُلَيَّةَ قَالَ حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى عِنْدَ كُسُوفِ الشَّمْسِ ثَمَانِيَ رَكَعَاتٍ وَأَرْبَعَ سَجَدَاتٍوَعَنْ عَطَاءٍ مِثْلُ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dari [Isma'il bin 'Ulayyah] dia berkata; telah menceritakan kepada kami [Sufyan Ats-Tsauri] dari [Habib bin Abu Tsabit] dari [Thawus] dari [Ibnu 'Abbas] bahwa ketika terjadi gerhana Matahari Rasulullah Shalallahu 'Alaihi Wa sallam sholat dengan delapan kali ruku dan empat kali sujud. Dari [Atha] juga demikian."
            },
            {
                "number": 1442,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنَا حَبِيبُ بْنُ أَبِي ثَابِتٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى فِي كُسُوفٍ فَقَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثُمَّ سَجَدَ وَالْأُخْرَى مِثْلُهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dari [Yahya] dari [Sufyan] dia berkata; telah menceritakan kepada kami [Habib bin Abu Tsabit] dari [Thawus] dari [Ibnu 'Abbas] dari Nabi Shalallahu 'Alaihi Wa Sallam, bahwa ketika terjadi gerhana beliau sholat. Beliau membaca ayat kemudian ruku, lalu membaca lagi kemudian ruku, lalu membaca lagi kemudian ruku, lalu membaca lagi kemudian ruku, setelah itu beliau sujud. Pada raka'at selanjutnya beliau melakukan seperti itu juga."
            },
            {
                "number": 1443,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدٍ قَالَ حَدَّثَنَا الْوَلِيدُ عَنْ ابْنِ نَمِرٍ وَهُوَ عَبْدُ الرَّحْمَنِ بْنُ نَمِرٍ عَنْ الزُّهْرِيِّ عَنْ كَثِيرِ بْنِ عَبَّاسٍ ح وَأَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي كَثِيرُ بْنُ عَبَّاسٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى يَوْمَ كَسَفَتْ الشَّمْسُ أَرْبَعَ رَكَعَاتٍ فِي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Utsman bin Sa'id] dia berkata; telah menceritakan kepada kami [Al Walid] dari [Ibnu Namir 'Abdurrahman bin Namir] dari [Az Zuhri] dari [Katsir bin 'Abbas]. Demikian juga diriwayatkan dari jalur lain, telah mengabarkan kepadaku ['Amru bin 'Utsman] dia berkata; telah menceritakan kepada kami [Al Walid] dari [Al Auza'i] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku [Katsir bin 'Abbas] dari ['Abdullah bin 'Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam pernah sholat pada hari terjadinya gerhana Matahari dengan empat kali ruku' dan empat kali sujud dalam dua rakaat."
            },
            {
                "number": 1444,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ قَالَ سَمِعْتُ عُبَيْدَ بْنَ عُمَيْرٍ يُحَدِّثُ قَالَ حَدَّثَنِي مَنْ أُصَدِّقُ فَظَنَنْتُ أَنَّهُ يُرِيدُ عَائِشَةَ أَنَّهَا قَالَتْكَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ بِالنَّاسِ قِيَامًا شَدِيدًا يَقُومُ بِالنَّاسِ ثُمَّ يَرْكَعُ ثُمَّ يَقُومُ ثُمَّ يَرْكَعُ ثُمَّ يَقُومُ ثُمَّ يَرْكَعُ فَرَكَعَ رَكْعَتَيْنِ فِي كُلِّ رَكْعَةٍ ثَلَاثَ رَكَعَاتٍ رَكَعَ الثَّالِثَةَ ثُمَّ سَجَدَ حَتَّى إِنَّ رِجَالًا يَوْمَئِذٍ يُغْشَى عَلَيْهِمْ حَتَّى إِنَّ سِجَالَ الْمَاءِ لَتُصَبُّ عَلَيْهِمْ مِمَّا قَامَ بِهِمْ يَقُولُ إِذَا رَكَعَ اللَّهُ أَكْبَرُ وَإِذَا رَفَعَ رَأْسَهُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَلَمْ يَنْصَرِفْ حَتَّى تَجَلَّتْ الشَّمْسُ فَقَامَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَقَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ وَلَكِنْ آيَتَانِ مِنْ آيَاتِ اللَّهِ يُخَوِّفُكُمْ بِهِمَا فَإِذَا كَسَفَا فَافْزَعُوا إِلَى ذِكْرِ اللَّهِ عَزَّ وَجَلَّ حَتَّى يَنْجَلِيَا",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; Telah menceritakan kepada kami [Ibnu 'Ulayyah] dia berkata; Telah mengabarkan kepadaku [Ibnu Juraij] dari ['Atha] dia berkata; Aku mendengar ['Ubaid bin 'Umair] bercerita, dia berkata; Telah menceritakan kepadaku orang yang aku percayai, -aku mengira dia adalah [Aisyah] - dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam pernah terjadi gerhana matahari. Maka Nabi shallallahu 'alaihi wasallam sholat bersama orang-orang dengan berdiri yang lama sekali, lalu beliau ruku', berdiri lagi, ruku lagi, berdiri lagi lalu ruku lagi. Beliau mengerjakan sholat dua raka'at dimana setiap rakaat tiga kali ruku'. Beliau ruku pada ketiga kalinya, lalu sujud. Beberapa orang ketika itu jatuh tidak sadarkan diri, karena lamanya beliau berdiri bersama mereka, sehingga dituangkan air seember keatas tubuh mereka. Apabila beliau ruku' maka beliau mengucapkan Allahu Akbar, dan apabila beliau bangkit dari ruku beliau mengucapkan: 'Sami'allah huliman hamidah'. Beliau tidak bangkit sampai matahari terang kembali. Lalu beliau berdiri, bertahmid dan memuji Allah kemudian bersabda: 'Matahari dan bulan tidak terjadi gerhana karena kematian atau kelahiran seseorang akan tetapi keduanya adalah dua tanda dari tanda-tanda kebesaran Allah Ta'ala, yang dengannya Allah memberi peringatan kepada kalian. Apabila keduanya mengalami gerhana maka segeralah kalian mengingat Allah Azza Wa Jalla (sholat) hingga terang kembali.'"
            },
            {
                "number": 1445,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ فِي صَلَاةِ الْآيَاتِ عَنْ عَطَاءٍ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى سِتَّ رَكَعَاتٍ فِي أَرْبَعِ سَجَدَاتٍقُلْتُ لِمُعَاذٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا شَكَّ وَلَا مِرْيَةَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah menceritakan kepada kami [Mu'adz bin Hisyam] dia berkata; [Bapakku] telah menceritakan kepadaku dari [Qatadah] -mengenai sholat gerhana- dari ['Atha] dari ['Ubaid bin 'Umair] dari ['Aisyah] bahwasanya Nabi shallallahu 'alaihi wasallam sholat dengan enam kali ruku' dan empat kali sujud. Aku berkata kepada Mua'adz, Apakah ini dari Nabi shallallahu 'alaihi wasallam? Dia menjawab; 'Tidak diragukan lagi.'"
            },
            {
                "number": 1446,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ ابْنِ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْخَسَفَتْ الشَّمْسُ فِي حَيَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ فَكَبَّرَ وَصَفَّ النَّاسُ وَرَاءَهُ فَاقْتَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِرَاءَةً طَوِيلَةً ثُمَّ كَبَّرَ فَرَكَعَ رُكُوعًا طَوِيلًا ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ ثُمَّ قَامَ فَاقْتَرَأَ قِرَاءَةً طَوِيلَةً هِيَ أَدْنَى مِنْ الْقِرَاءَةِ الْأُولَى ثُمَّ كَبَّرَ فَرَكَعَ رُكُوعًا طَوِيلًا هُوَ أَدْنَى مِنْ الرُّكُوعِ الْأَوَّلِ ثُمَّ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ ثُمَّ سَجَدَ ثُمَّ فَعَلَ فِي الرَّكْعَةِ الْأُخْرَى مِثْلَ ذَلِكَ فَاسْتَكْمَلَ أَرْبَعَ رَكَعَاتٍ وَأَرْبَعَ سَجَدَاتٍ وَانْجَلَتْ الشَّمْسُ قَبْلَ أَنْ يَنْصَرِفَ ثُمَّ قَامَ فَخَطَبَ النَّاسَ فَأَثْنَى عَلَى اللَّهِ عَزَّ وَجَلَّ بِمَا هُوَ أَهْلُهُ ثُمَّ قَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ تَعَالَى لَا يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ فَإِذَا رَأَيْتُمُوهُمَا فَصَلُّوا حَتَّى يُفْرَجَ عَنْكُمْ وَقَالَ رَسُولُ اللَّه صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَيْتُ فِي مَقَامِي هَذَا كُلَّ شَيْءٍ وُعِدْتُمْ لَقَدْ رَأَيْتُمُونِي أَرَدْتُ أَنْ آخُذَ قِطْفًا مِنْ الْجَنَّةِ حِينَ رَأَيْتُمُونِي جَعَلْتُ أَتَقَدَّمُ وَلَقَدْ رَأَيْتُ جَهَنَّمَ يَحْطِمُ بَعْضُهَا بَعْضًا حِينَ رَأَيْتُمُونِي تَأَخَّرْتُ وَرَأَيْتُ فِيهَا ابْنَ لُحَيٍّ وَهُوَ الَّذِي سَيَّبَ السَّوَائِبَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dari [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku ['Urwah bin Az Zubair] dari ['Aisyah] dia berkata; \"Pada masa hidup Rasulullah shallallahu 'alaihi wasallam, terjadi gerhana matahari. Beliau berdiri dan bertakbir, lalu orang-orang menyusun barisan di belakangnya. Beliau membaca bacaan yang panjang. Kemudian beliau bertakbir lalu ruku' dengan ruku' yang lama pula, lalu mengangkat kepalanya sambil mengucapkan; 'Sami' Allahu Liman Hamidah, Rabbana Wa Lakal Hamdu'. Kemudian beliau bangun lalu membaca bacaan yang panjang, namun lebih pendek dari yang pertama. Kemudian bertakbir dan ruku' dengan ruku' yang lama, namun lebih pendek dari yang pertama. Lalu beliau mengucapkan; 'Sami' Allahu Liman Hamidah, Rabbana Wa Lakal Hamdu', kemudian sujud. Selanjutnya Rasulullah shallallahu 'alaihi wasallam juga melakukan hal yang seperti itu pada rakaat berikutnya, maka lengkaplah menjadi empat kali ruku dan empat kali sujud. Dan matahari pun telah terang kembali sebelum beliau bangkit. Kemudian beliau berdiri dan menyampaikan khutbah kepada orang-orang. Beliau memuji Allah Azza Wa Jalla dengan sesuatu yang telah menjadi hak-Nya, lalu bersabda: 'Matahari dan bulan adalah dua tanda dari kebesaran Allah Ta'ala. Keduanya tidak terjadi gerhana karena kematian atau kelahiran seseorang. Jika kalian melihat gerhana tersebut, maka sholatlah hingga disingkapkan (diperlihatkan) kembali'. Lalu Rasulullah shallallahu 'alaihi wasallam melanjutkan sabdanya: 'Pada tempatku ini aku melihat semua yang dijanjikan kepada kalian. Kalian telah melihat bahwa aku ingin memetik sesuatu dari surga ketika kalian melihat aku maju. Sungguh aku telah melihat neraka Jahannam bertumpang tindih sebagiannya pada sebagian lagi ketika kalian melihatku mundur, dan aku melihat Abu Luhaiy bersada disana, dan dia adalah orang yang membiarkan unta Saibah'.\""
            },
            {
                "number": 1447,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْخَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنُودِيَ الصَّلَاةُ جَامِعَةٌ فَاجْتَمَعَ النَّاسُ فَصَلَّى بِهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعَ رَكَعَاتٍ فِي رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah menceritakan kepada kami [Al Walid bin Muslim] dari [Al Auza'i] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam pernah terjadi gerhana matahari, lalu diserukan; 'Ash-sholatu Jami'ah' (mari kita dirikan sholat bersama), maka manusia berkumpul. Lalu beliau sholat bersama mereka empat ruku' dan empat sujud dalam dua rakaat.\""
            },
            {
                "number": 1448,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْخَسَفَتْ الشَّمْسُ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالنَّاسِ فَقَامَ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ قَامَ فَأَطَالَ الْقِيَامَ وَهُوَ دُونَ الْقِيَامِ الْأَوَّلِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ وَهُوَ دُونَ الرُّكُوعِ الْأَوَّلِ ثُمَّ رَفَعَ فَسَجَدَ ثُمَّ فَعَلَ ذَلِكَ فِي الرَّكْعَةِ الْأُخْرَى مِثْلَ ذَلِكَ ثُمَّ انْصَرَفَ وَقَدْ تَجَلَّتْ الشَّمْسُ فَخَطَبَ النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ لَا يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ فَإِذَا رَأَيْتُمْ ذَلِكَ فَادْعُوا اللَّهَ عَزَّ وَجَلَّ وَكَبِّرُوا وَتَصَدَّقُوا ثُمَّ قَالَ يَا أُمَّةَ مُحَمَّدٍ مَا مِنْ أَحَدٍ أَغْيَرُ مِنْ اللَّهِ عَزَّ وَجَلَّ أَنْ يَزْنِيَ عَبْدُهُ أَوْ تَزْنِيَ أَمَتُهُ يَا أُمَّةَ مُحَمَّدٍ وَاللَّهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلًا وَلَبَكَيْتُمْ كَثِيرًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Hisyam bin 'Urwah] dari [bapaknya] dari ['Aisyah] dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam pernah terjadi gerhana matahari, maka Rasulullah shallallahu 'alaihi wasallam sholat bersama orang-orang. Beliau berdiri dan memperlama berdirinya, kemudian ruku' dan memperlama ruku'nya. Kemudian bangkit lagi dan memperlama berdirinya, namun lebih pendek daripada yang pertama. Lalu ruku' dan memperlama ruku'nya, namun lebih pendek dari ruku' yang pertama. Kemudian mengangkat (kepalanya dari ruku'), lalu sujud. Beliau juga melakukan hal tersebut pada raka'at berikutnya. Beliau lalu beranjak, dan matahari telah terang kembali. Kemudian beliau berkhutbah di hadapan orang-orang. Beliau memuji dan menyanjung-Nya, lalu bersabda: 'Matahari dan bulan adalah dua tanda diantara tanda-tanda kebesaran Allah Ta'ala. Keduanya tidak mengalami gerhana karena kematian atau kelahiran seseorang. Jika kalian melihat dua gerhana tersebut, maka berdoalah kepada Allah Azza wa Jalla, bertakbir, lalu bersedekahlah'. Kemudian ia melanjutkan sabdanya: 'Wahai umat Muhammad! Tidak ada seorangpun yang melebihi cemburu dari Allah Azza wa Jalla bila ada hambanya yang berzina. Wahai umat Muhammad! Demi Allah, kalau kalian mengetahui apa yang aku ketahui, pasti kalian akan sedikit tertawa dan sering menangis.\""
            },
            {
                "number": 1449,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ ابْنِ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ عَمْرَةَ حَدَّثَتْهُ أَنَّ عَائِشَةَ حَدَّثَتْهَاأَنَّ يَهُودِيَّةً أَتَتْهَا فَقَالَتْ أَجَارَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ قَالَتْ عَائِشَةُ يَا رَسُولَ اللَّهِ إِنَّ النَّاسَ لَيُعَذَّبُونَ فِي الْقُبُورِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَائِذًا بِاللَّهِ قَالَتْ عَائِشَةُ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مَخْرَجًا فَخَسَفَتْ الشَّمْسُ فَخَرَجْنَا إِلَى الْحُجْرَةِ فَاجْتَمَعَ إِلَيْنَا نِسَاءٌ وَأَقْبَلَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَلِكَ ضَحْوَةً فَقَامَ قِيَامًا طَوِيلًا ثُمَّ رَكَعَ رُكُوعًا طَوِيلًا ثُمَّ رَفَعَ رَأْسَهُ فَقَامَ دُونَ الْقِيَامِ الْأَوَّلِ ثُمَّ رَكَعَ دُونَ رُكُوعِهِ ثُمَّ سَجَدَ ثُمَّ قَامَ الثَّانِيَةَ فَصَنَعَ مِثْلَ ذَلِكَ إِلَّا أَنَّ رُكُوعَهُ وَقِيَامَهُ دُونَ الرَّكْعَةِ الْأُولَى ثُمَّ سَجَدَ وَتَجَلَّتْ الشَّمْسُ فَلَمَّا انْصَرَفَ قَعَدَ عَلَى الْمِنْبَرِ فَقَالَ فِيمَا يَقُولُ إِنَّ النَّاسَ يُفْتَنُونَ فِي قُبُورِهِمْ كَفِتْنَةِ الدَّجَّالِ قَالَتْ عَائِشَةُ كُنَّا نَسْمَعُهُ بَعْدَ ذَلِكَ يَتَعَوَّذُ مِنْ عَذَابِ الْقَبْرِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dari [Ibnu Wahab] dari ['Amru bin Al Harits] dari [Yahya bin Sa'id] bahwasanya ['Amrah] menceritakan kepadanya bahwasanya ['Aisyah] menceritakan kepadanya bahwa ada orang Yahudi datang kepadanya, lalu ia berkata kepadanya; \"Semoga Allah melindungimu dari siksa kubur!\" Kemudian Aisyah berkata kepada Rasulullah shallallahu 'alaihi wasallam: \"Wahai Rasulullah shallallahu 'alaihi wasallam menjawab: 'Wahai Rasulullah shallallahu 'alaihi wasallam, apakah pada saat didalam kubur manusia akan disiksa? ' Rasulullah shallallahu 'alaihi wasallam menjawab: 'Berlindunglah kepada Allah! ' Aisyah berkata; 'Lalu Nabi shallallahu 'alaihi wasallam keluar, -ternyata- terjadi gerhana matahari, maka kami masuk ke kamar, dan para wanita berkumpul kepada kami. Rasulullah shallallahu 'alaihi wasallam muncul dengan menghadap kepada kami, dan hal itu saat waktu Dluha.' Lalu beliau berdiri lama, kemudian ruku' dengan ruku' yang lama juga. Lalu mengangkat kepalanya dan berdiri tapi lebih singkat dari berdiri yang pertama. Kemudian ruku' lebih singkat dari ruku' yang pertama, lalu sujud. Kemudian berdiri yang kedua dan melakukan hal yang sama, kecuali ruku' dan berdirinya lebih singkat dari yang pertama, kemudian sujud, dan matahari telah terang kembali. Setelah selesai beliau duduk di atas mimbar, lalu bersabda: 'Manusia diuji dalam kubur mereka, seperti fitnah Dajjal'.\"Lalu Aisyah berkata; 'Kami mendengar beliau meminta perlindungan dari siksa kubur setelah itu.'"
            },
            {
                "number": 1450,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ هُوَ الْأَنْصَارِيُّ قَالَ سَمِعْتُ عَمْرَةَ قَالَتْ سَمِعْتُ عَائِشَةَ تَقُولُجَاءَتْنِي يَهُودِيَّةٌ تَسْأَلُنِي فَقَالَتْ أَعَاذَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ فَلَمَّا جَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ يَا رَسُولَ اللَّهِ أَيُعَذَّبُ النَّاسُ فِي الْقُبُورِ فَقَالَ عَائِذًا بِاللَّهِ فَرَكِبَ مَرْكَبًا يَعْنِي وَانْخَسَفَتْ الشَّمْسُ فَكُنْتُ بَيْنَ الْحُجَرِ مَعَ نِسْوَةٍ فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ مَرْكَبِهِ فَأَتَى مُصَلَّاهُ فَصَلَّى بِالنَّاسِ فَقَامَ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ رَأْسَهُ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ رَأْسَهُ فَأَطَالَ الْقِيَامَ ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ ثُمَّ قَامَ قِيَامًا أَيْسَرَ مِنْ قِيَامِهِ الْأَوَّلِ ثُمَّ رَكَعَ أَيْسَرَ مِنْ رُكُوعِهِ الْأَوَّلِ ثُمَّ رَفَعَ رَأْسَهُ فَقَامَ أَيْسَرَ مِنْ قِيَامِهِ الْأَوَّلِ ثُمَّ رَكَعَ أَيْسَرَ مِنْ رُكُوعِهِ الْأَوَّلِ ثُمَّ رَفَعَ رَأْسَهُ فَقَامَ أَيْسَرَ مِنْ قِيَامِهِ الْأَوَّلِ فَكَانَتْ أَرْبَعَ رَكَعَاتٍ وَأَرْبَعَ سَجَدَاتٍ وَانْجَلَتْ الشَّمْسُ فَقَالَ إِنَّكُمْ تُفْتَنُونَ فِي الْقُبُورِ كَفِتْنَةِ الدَّجَّالِ قَالَتْ عَائِشَةُ فَسَمِعْتُهُ بَعْدَ ذَلِكَ يَتَعَوَّذُ مِنْ عَذَابِ الْقَبْرِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dia berkata; Telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; Telah menceritakan kepada kami [Yahya bin Sa'id Al Anshari] dia berkata; Aku mendengar ['Amrah] berkata; Aku mendengar ['Aisyah] berkata; Ada seorang Yahudi datang kepadaku, lalu berkata; \"Semoga Allah melindungimu dari siksa kubur\". Setelah Rasulullah shallallahu 'alaihi wasallam datang, aku berkata kepadanya'Wahai Rasulullah shallallahu 'alaihi wasallam, apakah pada saat di dalam kubur manusia akan disiksa? ' Rasulullah shallallahu 'alaihi wasallam menjawab: \"Berlindunglah kepada Allah!\" Lalu beliau naik kendaraannya, kemudian terjadi gerhana matahari. Aku sedang di kamar bersama para wanita, lalu Rasulullah shallallahu 'alaihi wasallam datang dari kendaraannya dan masuk ke tempat sholatnya, kemudian sholat bersama orang-orang. Lantas beliau berdiri, kemudian ruku' dalam waktu yang lama. Lalu mengangkat kepalanya dan berdiri dalam waktu yang lama. Kemudian beliau ruku' dalam waktu yang lama, lalu beliau mengangkat kepalanya dan berdiri dalam waktu yang lama. Kemudian sujud dalam waktu yang lama, dan berdiri lagi tetapi lebih singkat dari berdirinya yang pertama. Lalu ruku' dengan ruku' yang lebih singkat dari ruku' yang pertama, kemudian mengangkat kepalanya dan berdiri lagi tapi lebih singkat dari berdiri yang pertama. Kemudian ruku' lagi yang lebih singkat dari ruku' yang pertama, kemudian mengangkat kepalanya dan berdiri tapi lebih ringan dari yang pertama. sholatnya empat kali ruku' dan empat kali sujud, dan matahari telah terang. Setelah itu beliau bersabda: ' kalian akan diuji dalam kubur, seperti fitnah Dajjal. Lalu Aisyah berkata; 'Kami mendengar beliau memohon perlindungan dari siksa kubur setelah itu.'"
            },
            {
                "number": 1451,
                "arab": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ قَالَ أَنْبَأَنَا ابْنُ عُيَيْنَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي كُسُوفٍ فِي صُفَّةِ زَمْزَمَ أَرْبَعَ رَكَعَاتٍ فِي أَرْبَعِ سَجَدَاتٍ",
                "id": "Telah mengabarkan kepada kami ['Abdah bin 'Abdurrahim] dia berkata; Telah memberitakan kepada kami [Ibnu 'Uyainah] dari [Yahya bin Sa'id] dari ['Amrah] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam sholat gerhana di beranda sumur Zamzam dengan empat kali ruku' dan empat kali sujud."
            },
            {
                "number": 1452,
                "arab": "أَخْبَرَنِي مَحْمُودُ بْنُ خَالِدٍ عَنْ مَرْوَانَ قَالَ حَدَّثَنِي مُعَاوِيَةُ بْنُ سَلَّامٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَخَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ فَنُودِيَ الصَّلَاةُ جَامِعَةٌ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالنَّاسِ رَكْعَتَيْنِ وَسَجْدَةً ثُمَّ قَامَ فَصَلَّى رَكْعَتَيْنِ وَسَجْدَةًقَالَتْ عَائِشَةُ مَا رَكَعْتُ رُكُوعًا قَطُّ وَلَا سَجَدْتُ سُجُودًا قَطُّ كَانَ أَطْوَلَ مِنْهُ خَالَفَهُ مُحَمَّدُ بْنُ حِمْيَرَ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Khalid] dari [Marwan] dia berkata; Telah menceritakan kepadaku [Mu'awiyah bin Sallam] dia berkata; Telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Abu Salamah bin 'Abdurrahman] dari ['Abdullah bin 'Amru] dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam pernah terjadi gerhana matahari. Beliau memerintahkan untuk menyeru dengan kalimat; 'Ash sholatul Jami'ah (mari kita tegakkan sholat bersama-sama). Lalu Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat dua kali ruku' dan dua kali sujud dengan orang-orang. Kemudian beliau berdiri dan sholat dengan satu kali sujud. Lalu Aisyah berkata; 'Aku belum pernah melakukan ruku' dan sujud yang lebih lama darinya'.\" Muhammad bin Humair menyelisihinya."
            },
            {
                "number": 1453,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ عُثْمَانَ قَالَ حَدَّثَنَا ابْنُ حِمْيَرَ عَنْ مُعَاوِيَةَ بْنِ سَلَّامٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي طُعْمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَكَسَفَتْ الشَّمْسُ فَرَكَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ وَسَجْدَتَيْنِ ثُمَّ قَامَ فَرَكَعَ رَكْعَتَيْنِ وَسَجْدَتَيْنِ ثُمَّ جُلِّيَ عَنْ الشَّمْسِ وَكَانَتْ عَائِشَةُ تَقُولُ مَا سَجَدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُجُودًا وَلَا رَكَعَ رُكُوعًا أَطْوَلَ مِنْهُخَالَفَهُ عَلِيُّ بْنُ الْمُبَارَكِ",
                "id": "Telah mengabarkan kepada kami [Yahya bin 'Utsman] dia berkata; Telah menceritakan kepada kami [Ibnu Hamir] dari [Mu'awiyah bin Sallam] dari [Yahya bin Abu Katsir] dari [Abu Thu'mah] dari ['Abdullah bin 'Amru] dia berkata; \"Saat matahari mengalami gerhana, Rasulullah shallallahu 'alaihi wasallam sholat dua kali ruku' dan dua kali sujud, kemudian bangun lagi dan ruku' lagi dua kali serta sujud dua kali. Setelah itu matahari terang.\" Saat itu Aisyah berkata; 'Rasulullah shallallahu 'alaihi wasallam belum pernah sujud dan ruku' yang lebih lama darinya.' Ali bin Al Mubarak menyelisihinya."
            },
            {
                "number": 1454,
                "arab": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ إِسْحَقَ قَالَ حَدَّثَنَا أَبُو زَيْدٍ سَعِيدُ بْنُ الرَّبِيعِ قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي أَبُو حَفْصَةَ مَوْلَى عَائِشَةَ أَنَّ عَائِشَةَ أَخْبَرَتْهُ أَنَّهُلَمَّا كَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ وَأَمَرَ فَنُودِيَ أَنَّ الصَّلَاةَ جَامِعَةٌ فَقَامَ فَأَطَالَ الْقِيَامَ فِي صَلَاتِهِ قَالَتْ عَائِشَةُ فَحَسِبْتُ قَرَأَ سُورَةَ الْبَقَرَةِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ قَامَ مِثْلَ مَا قَامَ وَلَمْ يَسْجُدْ ثُمَّ رَكَعَ فَسَجَدَ ثُمَّ قَامَ فَصَنَعَ مِثْلَ مَا صَنَعَ رَكْعَتَيْنِ وَسَجْدَةً ثُمَّ جَلَسَ وَجُلِّيَ عَنْ الشَّمْسِ",
                "id": "Telah mengabarkan kepada kami [Abu Bakr bin Ishaq] dia berkata; Telah menceritakan kepada kami [Abu Zaid Sa'id bin Ar-Rabi'] dia berkata; Telah menceritakan kepada kami ['Ali bin Al Mubarak] dari [Yahya bin Abu Katsir] dia berkata; Telah menceritakan kepadaku [Abu Hafshah] -budak 'Aisyah- bahwasanya ['Aisyah] mengabarkan kepadanya bahwa pada masa Rasulullah shallallahu 'alaihi wasallam terjadi gerhana matahari, maka beliau berwudlu lalu memerintahkan untuk menyeru, 'Ash-sholatul Jami'ah'. Lalu beliau berdiri dan memperlama berdirinya saat sholat.\" Kemudian Aisyah berkata; 'Aku memperkirakan beliau membaca surah Al-Baqarah, kemudian beliau ruku' dengan ruku' yang lama, lalu mengucapakan Sami' Allahu Liman Hamidah. Kemudian beliau berdiri seperti berdirinya semula tanpa sujud, lalu ruku' lagi dan sujud lagi. Kemudian berdiri dan berbuat seperti yang diperbuat pada dua ruku' dan satu kali sujud yang pertama. Lantas beliau duduk, sedangkan matahari telah terang.'"
            },
            {
                "number": 1455,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ بْنِ عَبْدِ الْعَظِيمِ قَالَ حَدَّثَنِي إِبْرَاهِيمُ سَبَلَانُ قَالَ حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ الْمُهَلَّبِيُّ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَكَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ فَصَلَّى لِلنَّاسِ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ قَامَ فَأَطَالَ الْقِيَامَ وَهُوَ دُونَ الْقِيَامِ الْأَوَّلِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ وَهُوَ دُونَ الرُّكُوعِ الْأَوَّلِ ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ ثُمَّ رَفَعَ ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ وَهُوَ دُونَ السُّجُودِ الْأَوَّلِ ثُمَّ قَامَ فَصَلَّى رَكْعَتَيْنِ وَفَعَلَ فِيهِمَا مِثْلَ ذَلِكَ ثُمَّ سَجَدَ سَجْدَتَيْنِ يَفْعَلُ فِيهِمَا مِثْلَ ذَلِكَ حَتَّى فَرَغَ مِنْ صَلَاتِهِ ثُمَّ قَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ وَإِنَّهُمَا لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ فَإِذَا رَأَيْتُمْ ذَلِكَ فَافْزَعُوا إِلَى ذِكْرِ اللَّهِ عَزَّ وَجَلَّ وَإِلَى الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'ubaidhullah bin 'Abdul 'Azhim] dia berkata; Telah menceritakan kepadaku [Ibrahim Sabalan] dia berkata; Telah menceritakan kepada kami ['Abbad bin 'Abbad Al Muhallabi] dari [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam pernah terjadi gerhana matahari, lalu Rasulullah sholat bersama orang orang. Beliau berdiri dan memperlama berdirinya, kemudian ruku' dan memperlama ruku'nya. Kemudian bangkit lagi dan memperlama berdirinya, namun lebih singkat dari berdiri yang pertama. Kemudian ruku' dan memperlama ruku'nya, namun lebih singkat dari ruku' yang pertama. Kemudian sujud dan memperlama sujudnya, lalu mengangkat (kepalanya dari ruku'), lalu sujud namun lebih singkat dari sujud yang pertama. Kemudian berdiri sholat dua rakaat. Beliau melakukan hal yang lama pada rakaat berikutnya, sampai selesai sholatnya. Setelah itu Beliau bersabda: 'Matahari dan bulan adalah dua tanda diantara tanda-tanda kebesaran Allah Ta'ala. Keduanya tidak mengalami gerhana karena kematian atau kelahiran seseorang. Jika kalian melihat kedua gerhana tersebut, maka segeralah berdzikir kepada Allah Azza wa Jalla dan kerjakanlah sholat '.\""
            },
            {
                "number": 1456,
                "arab": "أَخْبَرَنَا هِلَالُ بْنُ الْعَلَاءِ بْنِ هِلَالٍ قَالَ حَدَّثَنَا الْحُسَيْنُ بْنُ عَيَّاشٍ قَالَ حَدَّثَنَا زُهَيْرٌ قَالَ حَدَّثَنَا الْأَسْوَدُ بْنُ قَيْسٍ قَالَ حَدَّثَنِي ثَعْلَبَةُ بْنُ عَبَّادٍ الْعَبْدِيُّ مِنْ أَهْلِ الْبَصْرَةِأَنَّهُ شَهِدَ خُطْبَةً يَوْمًا لِسَمُرَةَ بْنِ جُنْدُبٍ فَذَكَرَ فِي خُطْبَتِهِ حَدِيثًا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَمُرَةُ بْنُ جُنْدُبٍ بَيْنَا أَنَا يَوْمًا وَغُلَامٌ مِنْ الْأَنْصَارِ نَرْمِي غَرَضَيْنِ لَنَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا كَانَتْ الشَّمْسُ قِيدَ رُمْحَيْنِ أَوْ ثَلَاثَةٍ فِي عَيْنِ النَّاظِرِ مِنْ الْأُفُقِ اسْوَدَّتْ فَقَالَ أَحَدُنَا لِصَاحِبِهِ انْطَلِقْ بِنَا إِلَى الْمَسْجِدِ فَوَاللَّهِ لَيُحْدِثَنَّ شَأْنُ هَذِهِ الشَّمْسِ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أُمَّتِهِ حَدَثًا قَالَ فَدَفَعْنَا إِلَى الْمَسْجِدِ قَالَ فَوَافَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ خَرَجَ إِلَى النَّاسِ قَالَ فَاسْتَقْدَمَ فَصَلَّى فَقَامَ كَأَطْوَلِ قِيَامٍ قَامَ بِنَا فِي صَلَاةٍ قَطُّ مَا نَسْمَعُ لَهُ صَوْتًا ثُمَّ رَكَعَ بِنَا كَأَطْوَلِ رُكُوعٍ مَا رَكَعَ بِنَا فِي صَلَاةٍ قَطُّ مَا نَسْمَعُ لَهُ صَوْتًا ثُمَّ سَجَدَ بِنَا كَأَطْوَلِ سُجُودٍ مَا سَجَدَ بِنَا فِي صَلَاةٍ قَطُّ لَا نَسْمَعُ لَهُ صَوْتًا ثُمَّ فَعَلَ ذَلِكَ فِي الرَّكْعَةِ الثَّانِيَةِ مِثْلَ ذَلِكَ قَالَ فَوَافَقَ تَجَلِّي الشَّمْسِ جُلُوسَهُ فِي الرَّكْعَةِ الثَّانِيَةِ فَسَلَّمَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَشَهِدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَشَهِدَ أَنَّهُ عَبْدُ اللَّهِ وَرَسُولُهُ مُخْتَصَرٌ",
                "id": "Telah mengabarkan kepada kami [Hilal bin Al 'Ala bin Hilal] dia berkata; Telah menceritakan kepada kami [Al Husain bin 'Ayyasy] dia berkata; Telah menceritakan kepada kami [Zuhair] dia berkata; Telah menceritakan kepada kami [Al Aswad bin Qais] dia berkata; Telah menceritakan kepadaku [Tsa'labah bin 'Abbad Al 'Abdi] -dari penduduk Bashrah- bahwasanya suatu hari ia menyaksikan khutbah [Samurah bin Jundub], didalam khutbahnya dia menyebutkan sebuah Hadits dari Rasulullah shallallahu 'alaihi wasallam, dia berkata; \"Tatkala kami dan seorang anak kecil melemparkan tombak kami pada dua sasaran di masa Rasulullah, tiba-tiba matahari -yang kelihatannya berada seukuran dua tombak atau tiga tombak- diatas kami berwarna hitam. Lalu salah seorang diantara kami berkata; 'Mari kita pergi ke masjid bersama kami, demi Allah kita akan melihat Rasulullah shallallahu 'alaihi wasallam dalam menyikapi keadaan seperti ini. Samurah berkata; 'Maka kami pun ingin pergi ke masjid'. Dia berkata lagi; 'Kami mendapatkan Rasulullah shallallahu 'alaihi wasallam sedang keluar menuju sekumpulan manusia. Kemudian beliau maju, lalu sholat dengan memperlama berdirinya, sepertinya sholat ini yang paling paling panjang beliau lakukan bersama kami, dan kami tidak mendengar suara dari beliau. Kemudian beliau ruku' dengan ruku' yang panjang dan kami tidak mendengar suara dari beliau, kemudian beliau sujud dengan sujud yang panjang yang belum pernah beliau lakukan sebelumnya bersama kami, dan kamipun tidak mendengar suara dari beliau. Dan beliau melakukan hal yang sama pada raka'at kedua. Dia berkata; 'Duduk beliau pada raka'at kedua bersamaan dengan terangnya matahari.' Kemudian beliau mengucapkan salam dan memuji Allah, bersaksi bahwa tiada ilah yang berhak disembah selainNya dan bersaksi bahwa beliau utusanNya. (secara ringkas)."
            },
            {
                "number": 1457,
                "arab": "و أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ أَنَّ جَدَّهُ عُبَيْدَ اللَّهِ بْنَ الْوَازِعِ حَدَّثَهُ قَالَ حَدَّثَنَا أَيُّوبُ السَّخْتِيَانِيُّ عَنْ أَبِي قِلَابَةَ عَنْ قَبِيصَةَ بْنِ مُخَارِقٍ الْهِلَالِيِّ قَالَكَسَفَتْ الشَّمْسُ وَنَحْنُ إِذْ ذَاكَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ فَخَرَجَ فَزِعًا يَجُرُّ ثَوْبَهُ فَصَلَّى رَكْعَتَيْنِ أَطَالَهُمَا فَوَافَقَ انْصِرَافُهُ انْجِلَاءَ الشَّمْسِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ وَإِنَّهُمَا لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ فَإِذَا رَأَيْتُمْ مِنْ ذَلِكَ شَيْئًا فَصَلُّوا كَأَحْدَثِ صَلَاةٍ مَكْتُوبَةٍ صَلَّيْتُمُوهَا",
                "id": "Dan telah mengabarkan kepada kami [Ibrahim bin Ya'qub] dia berkata; Telah menceritakan kepada kami ['Amru bin 'Ashim] bahwasanya kakeknya ['ubaidhullah bin Al Wazi'] menceritakan kepadanya, dia berkata; Telah menceritakan kepada kami [Ayyub As Sakhtiyani] dari [Abu Qilabah] dari [Qabishah bin Mukhariq Al Hilali] dia berkata; Telah terjadi gerhana matahari dan pada waktu itu kami berada di Madinah bersama Rasulullah shallallahu 'alaihi wasallam. Maka beliau keluar dengan rasa takut sambil menarik bajunya, lalu sholat dua raka'at dengan memanjangkan keduanya. Beliau selesai sholat bersamaan dengan terangnya matahari kembali. Lalu beliau memuji Allah kemudian berkata: \"Matahari dan bulan adalah dua tanda dari tanda-tanda kebesaran Allah keduanya tidak mengalami gerhana karena kematian seseorang atau kelahiran seseorang, apabila kalian melihat yang demikian, maka sholatlah seperti sholat wajib yang kalian lakukan.\""
            },
            {
                "number": 1458,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُعَاذٌ وَهُوَ ابْنُ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَبِي قِلَابَةَ عَنْ قَبِيصَةَ الْهِلَالِيِّأَنَّ الشَّمْسَ انْخَسَفَتْ فَصَلَّى نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ رَكْعَتَيْنِ حَتَّى انْجَلَتْ ثُمَّ قَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَنْخَسِفَانِ لِمَوْتِ أَحَدٍ وَلَكِنَّهُمَا خَلْقَانِ مِنْ خَلْقِهِ وَإِنَّ اللَّهَ عَزَّ وَجَلَّ يُحْدِثُ فِي خَلْقِهِ مَا شَاءَ وَإِنَّ اللَّهَ عَزَّ وَجَلَّ إِذَا تَجَلَّى لِشَيْءٍ مِنْ خَلْقِهِ يَخْشَعُ لَهُ فَأَيُّهُمَا حَدَثَ فَصَلُّوا حَتَّى يَنْجَلِيَ أَوْ يُحْدِثَ اللَّهُ أَمْرًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; Telah menceritakan kepada kami [Mu'adz bin Hisyam] dia berkata; [Bapakku] telah menceritakan kepadaku dari [Qatadah] dari [Abu Qilabah] dari [Qabishah Al Hilali], matahari mengalami gerhana maka Nabi Shallalahu 'Alaihi Wa Sallam sholat dua raka'at dua raka'at hingga matahari terang kembali. Kemudian beliau bersabda: \" Matahari dan bulan tidak mengalami gerhana karena kematian seseorang akan tetapi keduanya adalah dua tanda dari tanda-tanda kebesaran Allah. Allah Azza Wa Jalla berbuat sesuatu terhadap ciptaan-Nya sesuai dengan kehendak-NYA. Dan Dia apabila menampakkan sebagian dari ciptaan-NYA maka akan membuat takut kepada-NYA, mana saja di antara keduanya mengalami gerhana maka sholatlah kalian hingga terang kembali atau Allah memutuskan perkara.\""
            },
            {
                "number": 1459,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ مُعَاذِ بْنِ هِشَامٍ قَالَ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَبِي قِلَابَةَ عَنْ النُّعْمَانِ بْنِ بَشِيرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا خَسَفَتْ الشَّمْسُ وَالْقَمَرُ فَصَلُّوا كَأَحْدَثِ صَلَاةٍ صَلَّيْتُمُوهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dari [Mu'adz bin Hisyam] dia berkata; [Bapakku] telah menceritakan kepadaku dari [Qatadah] dari [Abu Qilabah] dari [An Nu'man bin Basyir] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila matahari dan bulan mengalami gerhana maka sholatlah kalian sebagaimana sholat wajib yang kalian lakukan.\""
            },
            {
                "number": 1460,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ الْقَاسِمِ عَنْ مَالِكٍ قَالَ حَدَّثَنِي زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَخَسَفَتْ الشَّمْسُ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ مَعَهُ فَقَامَ قِيَامًا طَوِيلًا قَرَأَ نَحْوًا مِنْ سُورَةِ الْبَقَرَةِ قَالَ ثُمَّ رَكَعَ رُكُوعًا طَوِيلًا ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلًا وَهُوَ دُونَ الْقِيَامِ الْأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلًا وَهُوَ دُونَ الرُّكُوعِ الْأَوَّلِ ثُمَّ سَجَدَ ثُمَّ قَامَ قِيَامًا طَوِيلًا وَهُوَ دُونَ الْقِيَامِ الْأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلًا وَهُوَ دُونَ الرُّكُوعِ الْأَوَّلِ ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلًا وَهُوَ دُونَ الْقِيَامِ الْأَوَّلِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلًا وَهُوَ دُونَ الرُّكُوعِ الْأَوَّلِ ثُمَّ سَجَدَ ثُمَّ انْصَرَفَ وَقَدْ تَجَلَّتْ الشَّمْسُ فَقَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ لَا يَخْسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ فَإِذَا رَأَيْتُمْ ذَلِكَ فَاذْكُرُوا اللَّهَ عَزَّ وَجَلَّ قَالُوا يَا رَسُولَ اللَّهِ رَأَيْنَاكَ تَنَاوَلْتَ شَيْئًا فِي مَقَامِكَ هَذَا ثُمَّ رَأَيْنَاكَ تَكَعْكَعْتَ قَالَ إِنِّي رَأَيْتُ الْجَنَّةَ أَوْ أُرِيتُ الْجَنَّةَ فَتَنَاوَلْتُ مِنْهَا عُنْقُودًا وَلَوْ أَخَذْتُهُ لَأَكَلْتُمْ مِنْهُ مَا بَقِيَتْ الدُّنْيَا وَرَأَيْتُ النَّارَ فَلَمْ أَرَ كَالْيَوْمِ مَنْظَرًا قَطُّ وَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ قَالُوا لِمَ يَا رَسُولَ اللَّهِ قَالَ بِكُفْرِهِنَّ قِيلَ يَكْفُرْنَ بِاللَّهِ قَالَ يَكْفُرْنَ الْعَشِيرَ وَيَكْفُرْنَ الْإِحْسَانَ لَوْ أَحْسَنْتَ إِلَى إِحْدَاهُنَّ الدَّهْرَ ثُمَّ رَأَتْ مِنْكَ شَيْئًا قَالَتْ مَا رَأَيْتُ مِنْكَ خَيْرًا قَطُّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; Telah menceritakan kepada kami [Ibnul Qasim] dari [Malik] dia berkata; Telah menceritakan kepadaku [Zaid bin Aslam] dari ['Atha bin Yasar] dari ['Abdullah bin 'Abbas] dia berkata; \"Telah terjadi gerhana matahari, maka Rasulullah shallallahu 'alaihi wasallam sholat bersama orang-orang. Beliau berdiri lama dengan membaca surat yang sepadan dengan surah Al Baqarah.\" Kemudian Abdullah berkata lagi; 'Kemudian beliau ruku' dengan ruku' yang lama, lalu mengangkat kepalanya dan berdiri (lagi), tapi lebih singkat dari yang pertama. Kemudian ruku' dengan ruku' yang lama tapi lebih singkat dari ruku' yang pertama. Lalu beliau mengangkat (kepalanya) dan berdiri lagi dengan lama, namun lebih singkat dari yang pertama. Kemudian beliau ruku' dengan ruku' yang lama, namun lebih singkat dari ruku' yang pertama. Lalu beliau sujud dan pergi sedangkan matahari telah terang. Setelah itu beliau shallallahu 'alaihi wasallam bersabda: 'Matahari dan Bulan adalah dua tanda diantara tanda-tanda kebesaran Allah Ta'ala. Keduanya tidak mengalami gerhana karena kematian atau kelahiran seseorang. Jika kalian melihat gerhana tersebut, maka berdzikirlah kepada Allah Azza Wa Jalla.' Para sahabat berkata; 'Wahai Rasulullah shallallahu 'alaihi wasallam, kami melihat engkau menggapai sesuatu pada posisimu ini, kemudian kami melihatmu juga mundur? ' Beliau bersabda: 'Aku melihat surga -atau diperlihatkan kepadaku surga. Seandainya aku mengambil sesuatu dari surga, maka kamu pasti akan memakannya, lalu tak akan tersisa lagi dunia ini. Aku juga melihat neraka. Aku belum melihat pandangan yang lebih menakutkan dari ini dan aku melihat kebanyakan penghuninya adalah wanita.' Para sahabat berkata; 'Wahai Rasulullah shallallahu 'alaihi wasallam, kenapa bisa begitu? ' Beliau menjawab: 'Karena kekufuran mereka'. -Dalam riwayat lain: Karena mereka kufur kepada Allah? - Beliau meneruskan lagi: 'Mereka juga kufur terhadap kebaikan suami dan kufur terhadap kebaikan. Seandainya kamu berbuat baik kepada salah seorang dari mereka (wanita) sepanjang masa, Lalu dia melihat suatu (keburukan) pada dirimu', Maka dia akan berkata: 'Aku tidak melihat suatu kebaikanpun pada dirimu! '"
            },
            {
                "number": 1461,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا الْوَلِيدُ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ نَمِرٍ أَنَّهُ سَمِعَ الزُّهْرِيَّ يُحَدِّثُ عَنْ عُرْوَةَ عَنْ عَائِشَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى أَرْبَعَ رَكَعَاتٍ فِي أَرْبَعِ سَجَدَاتٍ وَجَهَرَ فِيهَا بِالْقِرَاءَةِ كُلَّمَا رَفَعَ رَأْسَهُ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah memberitakan kepada kami [Al Walid] dia berkata; Telah menceritakan kepada kami ['Abdurrahman bin Namir] bahwasanya ia mendengar [Az Zuhri] bercerita dari ['Urwah] dari ['Aisyah] Rasulullah shallallahu 'alaihi wasallam, bahwa beliau pernah sholat (gerhana) dengan empat kali ruku' dan empat kali sujud. Beliau juga mengeraskan bacaannya. Tiap kali beliau mengangkat kepalanya, beliau mengucapkan: 'Sami'allahu Liman Hamidah, Rabbana Wa Lakal Hamdu (Allah mendengar siapa yang memuji-Nya, wahai Tuhan kami, segala puji untuk-Mu) '.\""
            },
            {
                "number": 1462,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَسْوَدِ بْنِ قَيْسٍ عَنْ ابْنِ عَبَّادٍ رَجُلٍ مِنْ بَنِي عَبْدِ الْقَيْسِ عَنْ سَمُرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِهِمْ فِي كُسُوفِ الشَّمْسِ لَا نَسْمَعُ لَهُ صَوْتًا",
                "id": "Telah mengabarkan kepada kami ['Amru bin Manshur] dia berkata; Telah menceritakan kepada kami [Abu Nu'aim] dia berkata; Telah menceritakan kepada kami [Sufyan] dari [Al Aswad bin Qais] dari [Ibnu 'Abbad] -seorang laki-laki dari Bani 'Abdul Qais- dari [Samurah] bahwa Nabi Shalallahu 'Alaihi Wa Sallam sholat bersama mereka ketika terjadi gerhana matahari dan kami tidak mendengar suaranya.\""
            },
            {
                "number": 1463,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْمِسْوَرِ الزُّهْرِيُّ قَالَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَكَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ فَأَطَالَ قَالَ شُعْبَةُ وَأَحْسَبُهُ قَالَ فِي السُّجُودِ نَحْوَ ذَلِكَ وَجَعَلَ يَبْكِي فِي سُجُودِهِ وَيَنْفُخُ وَيَقُولُ رَبِّ لَمْ تَعِدْنِي هَذَا وَأَنَا أَسْتَغْفِرُكَ لَمْ تَعِدْنِي هَذَا وَأَنَا فِيهِمْ فَلَمَّا صَلَّى قَالَ عُرِضَتْ عَلَيَّ الْجَنَّةُ حَتَّى لَوْ مَدَدْتُ يَدِي تَنَاوَلْتُ مِنْ قُطُوفِهَا وَعُرِضَتْ عَلَيَّ النَّارُ فَجَعَلْتُ أَنْفُخُ خَشْيَةَ أَنْ يَغْشَاكُمْ حَرُّهَا وَرَأَيْتُ فِيهَا سَارِقَ بَدَنَتَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَأَيْتُ فِيهَا أَخَا بَنِي دُعْدُعٍ سَارِقَ الْحَجِيجِ فَإِذَا فُطِنَ لَهُ قَالَ هَذَا عَمَلُ الْمِحْجَنِ وَرَأَيْتُ فِيهَا امْرَأَةً طَوِيلَةً سَوْدَاءَ تُعَذَّبُ فِي هِرَّةٍ رَبَطَتْهَا فَلَمْ تُطْعِمْهَا وَلَمْ تَسْقِهَا وَلَمْ تَدَعْهَا تَأْكُلُ مِنْ خَشَاشِ الْأَرْضِ حَتَّى مَاتَتْ وَإِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ فَإِذَا انْكَسَفَتْ إِحْدَاهُمَا أَوْ قَالَ فَعَلَ أَحَدُهُمَا شَيْئًا مِنْ ذَلِكَ فَاسْعَوْا إِلَى ذِكْرِ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah mengabarkan kepada kami ['Abdullah bin Muhammad bin 'Abdurrahman bin Al Miswar Az Zuhri] dia berkata; telah menceritakan kepada kami [Ghundar] dari [Syu'bah] dari ['Atha bin As Saib] dari [bapaknya] dari ['Abdullah bin 'Amru] dia berkata; \"Saat terjadi gerhana matahari pada masa Rasulullah shallallahu 'alaihi wasallam, beliau mengerjakan sholat. Beliau memperlama berdirinya, kemudian ruku' dan memperlama ruku'nya, kemudian berdiri lagi dan memperlama berdirinya.\" Syu'bah (perawi) berkata; \"Aku mengira bahwa dia mengatakan tentang sujud Rasulullah shallallahu 'alaihi wasallam juga demikian. Beliau menangis saat sujud dan meniup sambil mengucapkan, 'Wahai Rabbku, ini jangan terjadi sedangkan kami masih memohon ampun kepada-Mu! Janganlah hal ini terjadi di saat aku masih berada di tengah-tengah mereka! ' Setelah selesai sholat beliau bersabda: 'Surga diperlihatkan kepadaku, hingga kalau tanganku dijulurkan maka aku pasti bisa memetik sesuatu darinya. Neraka juga telah diperlihatkan kepadaku, maka aku meniupnya karena khawatir panasnya akan menimpa kalian. Di dalamnya aku melihat seorang pencuri dua unta betina Rasulullah shallallahu 'alaihi wasallam dan melihat saudaranya Bani Du'du', orang yang mencuri orang yang haji, dan jika ia ditanya tentang curiannya maka ia berkata; \"Ini perbuatan tongkat \". Aku juga melihat seorang perempuan yang tinggi dan hitam, yang disiksa karena seekor kucing yang diikatnya, tanpa memberinya makan dan minum, serta tidak membiarkannya mencari makan sendiri dari serangga-serangga bumi, sehingga akhirnya kucing itu mati'. Beliau bersabda: `Matahari dan bulan tidak mengalami gerhana karena kematian atau kelahiran seseorang. Jika kalian melihat salah satunya - atau beliau berkata: Salah satunya mengalami gerhana maka segeralah berdzikir kepada Allah Azza wa Jalla '.\""
            },
            {
                "number": 1464,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرٍ عَنْ الْوَلِيدِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ نَمِرٍ أَنَّهُ سَأَلَ الزُّهْرِيَّ عَنْ سُنَّةِ صَلَاةِ الْكُسُوفِ فَقَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْكَسَفَتْ الشَّمْسُ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا فَنَادَى أَنْ الصَّلَاةَ جَامِعَةً فَاجْتَمَعَ النَّاسُ فَصَلَّى بِهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَبَّرَ ثُمَّ قَرَأَ قِرَاءَةً طَوِيلَةً ثُمَّ كَبَّرَ فَرَكَعَ رُكُوعًا طَوِيلًا مِثْلَ قِيَامِهِ أَوْ أَطْوَلَ ثُمَّ رَفَعَ رَأْسَهُ وَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ قَرَأَ قِرَاءَةً طَوِيلَةً هِيَ أَدْنَى مِنْ الْقِرَاءَةِ الْأُولَى ثُمَّ كَبَّرَ فَرَكَعَ رُكُوعًا طَوِيلًا هُوَ أَدْنَى مِنْ الرُّكُوعِ الْأَوَّلِ ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ كَبَّرَ فَسَجَدَ سُجُودًا طَوِيلًا مِثْلَ رُكُوعِهِ أَوْ أَطْوَلَ ثُمَّ كَبَّرَ فَرَفَعَ رَأْسَهُ ثُمَّ كَبَّرَ فَسَجَدَ ثُمَّ كَبَّرَ فَقَامَ فَقَرَأَ قِرَاءَةً طَوِيلَةً هِيَ أَدْنَى مِنْ الْأُولَى ثُمَّ كَبَّرَ ثُمَّ رَكَعَ رُكُوعًا طَوِيلًا هُوَ أَدْنَى مِنْ الرُّكُوعِ الْأَوَّلِ ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ قَرَأَ قِرَاءَةً طَوِيلَةً وَهِيَ أَدْنَى مِنْ الْقِرَاءَةِ الْأُولَى فِي الْقِيَامِ الثَّانِي ثُمَّ كَبَّرَ فَرَكَعَ رُكُوعًا طَوِيلًا دُونَ الرُّكُوعِ الْأَوَّلِ ثُمَّ كَبَّرَ فَرَفَعَ رَأْسَهُ فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ كَبَّرَ فَسَجَدَ أَدْنَى مِنْ سُجُودِهِ الْأَوَّلِ ثُمَّ تَشَهَّدَ ثُمَّ سَلَّمَ فَقَامَ فِيهِمْ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَنْخَسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ وَلَكِنَّهُمَا آيَتَانِ مِنْ آيَاتِ اللَّهِ فَأَيُّهُمَا خُسِفَ بِهِ أَوْ بِأَحَدِهِمَا فَافْزَعُوا إِلَى اللَّهِ عَزَّ وَجَلَّ بِذِكْرِ الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Utsman bin Sa'id bin Katsir] dari [Al Walid] dari ['Abdurrahman bin Namir] bahwasanya ia bertanya kepada [Az Zuhri] mengenai sunnah sholat Kusuf, maka dia berkata; telah mengabarkan kepadaku ['Urwah bin Az Zubair] dari ['Aisyah] dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam pernah terjadi gerhana matahari, beliau berwudlu lalu memerintahkan untuk menyeru, \"Ash-shalaatu Jami'ah.\"Orang-orang pun segera berkumpul, dan Rasulullah sholat bersama mereka. Beliau takbir, kemudian membaca bacaan yang lama. Beliau takbir lagi, kemudian ruku' dengan ruku' yang lama, seperti lamanya berdiri atau lebih. Kemudian beliau mengangkat kepalanya dari ruku' sambil mengucapkan: \"Sami'allahu liman hamidah.\" Kemudian beliau membaca bacaan yang lama, namun lebih pendek dari yang pertama. Lalu takbir lagi, kemudian ruku' dengan ruku' yang lama, namun lebih pendek dari yang pertama. Kemudian mengangkat kepalanya dari ruku' sambil mengucapkan, \"Sami'allahu liman hamidah.\" Kemudian takbir lagi dan sujud dengan sujud yang lama, seperti lamanya ruku' atau lebih. Kemudian takbir dan mengangkat kepalanya, lalu takbir dan sujud lagi, kemudian takbir lagi dan berdiri dengan membaca bacaan yang panjang, namun lebih pendek dari yang pertama. Kemudian takbir lagi dan ruku' dengan ruku' yang lama, namun lebih pendek dari yang pertama. Kemudian mengangkat kepalanya dari ruku' sambil mengucapkan, \"Sami'allahu liman hamidah.\" Kemudian beliau membaca bacaan yang panjang, namun lebih pendek dari yang pertama saat berdiri yang kedua. Kemudian beliau takbir lalu ruku' dengan ruku' yang panjang, namun masih lebih pendek dari ruku' yang pertama. Kemudian takbir lagi dan mengangkat kepalanya sambil mengucapkan, \"Sami'allahu liman hamidah.\" Lalu takbir lagi dan sujud lagi dengan sujud yang lebih pendek dari yang pertama, kemudian tasyahhud (membaca dua kalimat syahadat) dan mengucapkan salam. Setelah itu beliau bangkit ketengah-tengah mereka dan memuji Allah. lalu bersabda: \"Matahari dan bulan tidak mengalami gerhana karena kematian atau kelahiran seseorang, tetapi keduanya adalah tanda diantara tanda-tanda kebesaran Allah. Jadi mana saja dari keduanya mengalami gerhana, maka segeralah mengingat Allah Azza wa Jalla dengan sholat.\""
            },
            {
                "number": 1465,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا مُوسَى بْنُ دَاوُدَ قَالَ حَدَّثَنَا نَافِعُ بْنُ عُمَرَ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ قَالَتْصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْكُسُوفِ فَقَامَ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ ثُمَّ رَفَعَ ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ ثُمَّ قَامَ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ فَأَطَالَ الْقِيَامَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ ثُمَّ رَفَعَ ثُمَّ سَجَدَ فَأَطَالَ السُّجُودَ ثُمَّ رَفَعَ ثُمَّ انْصَرَفَ",
                "id": "Telah mengabarkan kepadaku [Ibrahim bin Ya'qub] dia berkata; telah menceritakan kepada kami [Musa bin Dawud] dia berkata; telah menceritakan kepada kami [Nafi' bin 'Umar] dari [Ibnu Abu Mulaikah] dari [Asma binti Abu Bakr] dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam pernah sholat saat terjadi gerhana. Beliau berdiri dan memperlama berdirinya kemudian ruku' dan memperlama ruku'nya. Kemudian bangkit lagi dan memperlama berdirinya. Kemudian ruku' dan memperlama ruku'nya. lalu mengangkat (kepalanya dari ruku') dan sujud dalam waktu yang lama, kemudian mengangkat kepalanya dari sujud, dan sujud lagi dengan sujud yang lama juga. Kemudian beliau berdiri dan memperlama berdirinya, kemudian ruku' dan memperlama ruku'nya. Lalu bangkit lagi dan memperlama berdirinya. Kemudian ruku' dan memperlama ruku'nya, lalu mengangkat (kepalanya dari ruku') dan sujud dalam waktu yang lama, kemudian mengangkat kepalanya dari sujud. Kemudian sujud lagi dengan sujud yang lama juga, lalu mengangkatnya, kemudian selesai (salam).\""
            },
            {
                "number": 1466,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ ابْنِ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ عَمْرَةَ حَدَّثَتْهُ أَنَّ عَائِشَةَ قَالَتْإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مَخْرَجًا فَخُسِفَ بِالشَّمْسِ فَخَرَجْنَا إِلَى الْحُجْرَةِ فَاجْتَمَعَ إِلَيْنَا نِسَاءٌ وَأَقْبَلَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَلِكَ ضَحْوَةً فَقَامَ قِيَامًا طَوِيلًا ثُمَّ رَكَعَ رُكُوعًا طَوِيلًا ثُمَّ رَفَعَ رَأْسَهُ فَقَامَ دُونَ الْقِيَامِ الْأَوَّلِ ثُمَّ رَكَعَ دُونَ رُكُوعِهِ ثُمَّ سَجَدَ ثُمَّ قَامَ الثَّانِيَةَ فَصَنَعَ مِثْلَ ذَلِكَ إِلَّا أَنَّ قِيَامَهُ وَرُكُوعَهُ دُونَ الرَّكْعَةِ الْأُولَى ثُمَّ سَجَدَ وَتَجَلَّتْ الشَّمْسُ فَلَمَّا انْصَرَفَ قَعَدَ عَلَى الْمِنْبَرِ فَقَالَ فِيمَا يَقُولُ إِنَّ النَّاسَ يُفْتَنُونَ فِي قُبُورِهِمْ كَفِتْنَةِ الدَّجَّالِ مُخْتَصَرٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dari [Ibnu Wahb] dari ['Amru bin Al Harits] dari [Yahya bin Sa'id] bahwasanya ['Amrah] menceritakan kepadanya bahwasanya ['Aisyah] berkata; \"Nabi shallallahu 'alaihi wasallam pernah keluar tiba-tiba terjadi gerhana matahari. Kami lalu keluar menuju kamar, dan para wanita berkumpul di sekitar kami. Rasulullah shallallahu 'alaihi wasallam datang kepada kami, dan saat itu pada waktu Dluha. Lalu beliau berdiri lama, kemudian ruku' dengan ruku' yang lama, lalu mengangkat kepalanya dan berdiri lagi tapi lebih singkat dari berdiri yang pertama. Kemudian ruku' dengan ruku' yang lebih singkat dari ruku' yang pertama, lalu sujud. Kemudian berdiri yang kedua, dan melakukan hal yang sama, namun ruku' dan berdirinya lebih pendek dari rakaat pertama. Kemudian sujud, dan matahari telah terang kembali. Setelah selesai beliau duduk di atas mimbar lalu bersabda: 'Manusia diuji dalam kubur mereka, seperti fitnah Dajjal '.\" (secara ringkas)."
            },
            {
                "number": 1467,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدَةُ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْخَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ فَصَلَّى فَأَطَالَ الْقِيَامَ جِدًّا ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ جِدًّا ثُمَّ رَفَعَ فَأَطَالَ الْقِيَامَ جِدًّا وَهُوَ دُونَ الْقِيَامِ الْأَوَّلِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ وَهُوَ دُونَ الرُّكُوعِ الْأَوَّلِ ثُمَّ سَجَدَ ثُمَّ رَفَعَ رَأْسَهُ فَأَطَالَ الْقِيَامَ وَهُوَ دُونَ الْقِيَامِ الْأَوَّلِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ وَهُوَ دُونَ الرُّكُوعِ الْأَوَّلِ ثُمَّ رَفَعَ فَأَطَالَ الْقِيَامَ وَهُوَ دُونَ الْقِيَامِ الْأَوَّلِ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ وَهُوَ دُونَ الرُّكُوعِ الْأَوَّلِ ثُمَّ سَجَدَ فَفَرَغَ مِنْ صَلَاتِهِ وَقَدْ جُلِّيَ عَنْ الشَّمْسِ فَخَطَبَ النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ فَإِذَا رَأَيْتُمْ ذَلِكَ فَصَلُّوا وَتَصَدَّقُوا وَاذْكُرُوا اللَّهَ عَزَّ وَجَلَّ وَقَالَ يَا أُمَّةَ مُحَمَّدٍ إِنَّهُ لَيْسَ أَحَدٌ أَغْيَرَ مِنْ اللَّهِ عَزَّ وَجَلَّ أَنْ يَزْنِيَ عَبْدُهُ أَوْ أَمَتُهُ يَا أُمَّةَ مُحَمَّدٍ لَوْ تَعْلَمُونَ مَا أَعْلَمُ لَضَحِكْتُمْ قَلِيلًا وَلَبَكَيْتُمْ كَثِيرًا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami ['Abdah] dia berkata; telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [bapaknya] dari ['Aisyah] dia berkata; \"Pada masa Rasulullah Shalallahu 'Alaihi Wa Sallam pernah terjadi gerhana matahari, lalu Rasulullah berdiri dan sholat. Beliau berdiri lama sekali. kemudian ruku' dan ruku'nya lama sekali. Lalu bangkit lagi dan memperlama berdirinya, namun lebih singkat dari berdiri yang pertama, kemudian ruku' dan memperlama ruku'nya, namun lebih singkat dari ruku' yang pertama. Kemudian ia mengangkat (kepalanya dari ruku') dan sujud. Lalu beliau melakukan hal tersebut pada rakaat berikutnya. Kemudian beliau beranjak dan matahari telah terang kembali. Setelah itu beliau berkhutbah kepada manusia; Beliau memuji Allah dan menyanjung-Nya; lalu bersabda: 'Matahari dan bulan tidak mengalami gerhana karena kematian atau kelahiran seseorang. Jika kalian melihat kedua gerhana tersebut, maka sholatlah, bersedakahlah dan berdzikirlah kepada Allah'. Kemudian beliau melanjutkan sabdanya: `Wahai umat Muhammad! Tidak ada seorangpun yang lebih cemburu dari Allah Azza wa Jalla bila ada hamba-Nya yang berzina atau ada hamba perempuan-Nya yang berzina. Wahai umat Muhammad! Demi Allah, seandainya kalian mengetahui apa yang aku ketahui, maka kalian pasti akan sedikit tertawa dan banyak menangis '.\""
            },
            {
                "number": 1468,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ عَنْ سُفْيَانَ عَنْ الْأَسْوَدِ بْنِ قَيْسٍ عَنْ ثَعْلَبَةَ بْنِ عَبَّادٍ عَنْ سَمُرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ حِينَ انْكَسَفَتْ الشَّمْسُ فَقَالَ أَمَّا بَعْدُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] dia berkata; telah menceritakan kepada kami [Abu Dawud Al Ja'fari] dari [Sufyan] dari [Al Aswad bin Qais] dari [Tsa'labah bin 'Abbad] dari [Samurah]; \"Nabi Shalallahu 'Alaihi Wa Sallam berkhutbah ketika terjadi gerhana matahari dengan mengucapkan: 'Amma Ba'du'."
            },
            {
                "number": 1469,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ قَالَ حَدَّثَنَا يُونُسُ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ قَالَكُنَّا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْكَسَفَتْ الشَّمْسُ فَقَامَ إِلَى الْمَسْجِدِ يَجُرُّ رِدَاءَهُ مِنْ الْعَجَلَةِ فَقَامَ إِلَيْهِ النَّاسُ فَصَلَّى رَكْعَتَيْنِ كَمَا يُصَلُّونَ فَلَمَّا انْجَلَتْ خَطَبَنَا فَقَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ يُخَوِّفُ بِهِمَا عِبَادَهُ وَإِنَّهُمَا لَا يَنْكَسِفَانِ لِمَوْتِ أَحَدٍ فَإِذَا رَأَيْتُمْ كُسُوفَ أَحَدِهِمَا فَصَلُّوا وَادْعُوا حَتَّى يَنْكَشِفَ مَا بِكُمْ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dia berkata; telah menceritakan kepada kami [Yazid bin Zurai'] dia berkata; telah menceritakan kepada kami [Yunus] dari [Al Hasan] dari [Abu Bakrah] dia berkata; \"Kami berada di samping Rasulullah shallallahu 'alaihi wasallam, tiba-tiba terjadi gerhana matahari, maka beliau segera berdiri menuju masjid, dan menarik selendangnya karena tergesa-gesa. Lalu orang-orang pun segera berdiri di sisinya dan beliau mengerjakan sholat dua rakaat sebagaimana mereka juga melakukannya. Setelah matahari terang, beliau berkhutbah di hadapan kami seraya bersabda: \"Matahari dan bulan tidak mengalami gerhana karena kematian atau kelahiran seseorang, tetapi keduanya merupakan tanda diantara tanda-tanda kebesaran Allah untuk menakut-nakuti hamba-Nya. Jika kalian melihat kedua gerhana tersebut, maka sholatlah dan berdoalah hingga gerhana tersingkap dari kalian (nampak kembali).\""
            },
            {
                "number": 1470,
                "arab": "أَخْبَرَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ الْمَسْرُوقِيُّ عَنْ أَبِي أُسَامَةَ عَنْ بُرَيْدٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَخَسَفَتْ الشَّمْسُ فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَزِعًا يَخْشَى أَنْ تَكُونَ السَّاعَةُ فَقَامَ حَتَّى أَتَى الْمَسْجِدَ فَقَامَ يُصَلِّي بِأَطْوَلِ قِيَامٍ وَرُكُوعٍ وَسُجُودٍ مَا رَأَيْتُهُ يَفْعَلُهُ فِي صَلَاتِهِ قَطُّ ثُمَّ قَالَ إِنَّ هَذِهِ الْآيَاتِ الَّتِي يُرْسِلُ اللَّهُ لَا تَكُونُ لِمَوْتِ أَحَدٍ وَلَا لِحَيَاتِهِ وَلَكِنَّ اللَّهَ يُرْسِلُهَا يُخَوِّفُ بِهَا عِبَادَهُ فَإِذَا رَأَيْتُمْ مِنْهَا شَيْئًا فَافْزَعُوا إِلَى ذِكْرِهِ وَدُعَائِهِ وَاسْتِغْفَارِهِ",
                "id": "Telah mengabarkan kepada kami [Musa bin 'Abdurrahman Al Masruqi] dari [Abu Usamah] dari [Buraid] dari [Abu Burdah] dari [Abu Musa] dia berkata; \"Saat terjadi gerhana matahari Nabi shallallahu 'alaihi wasallam berdiri dengan rasa takut, beliau khawatir akan terjadi kiamat. Beliau mendatangi masjid, lalu berdiri, ruku', dan sujud dengan waktu yang lama. Aku belum pernah melihat beliau melakukan hal itu dalam sholatnya. Kemudian beliau bersabda: \"Ini adalah tanda-tanda kebesaran Allah yang Dia kirimkan bukan karena kematian ataupun kelahiran seseorang, telapi Allah mengirimnya untuk menakut-nakuti hamba-Nya. Jika kalian melihatnya, maka segeralah berdzikir dan berdoa serta meminta ampunan kepada-Nya.\""
            },
            {
                "number": 1471,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَجَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَتْ الْمَوَاشِي وَانْقَطَعَتْ السُّبُلُ فَادْعُ اللَّهَ عَزَّ وَجَلَّ فَدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمُطِرْنَا مِنْ الْجُمُعَةِ إِلَى الْجُمُعَةِ فَجَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ تَهَدَّمَتْ الْبُيُوتُ وَانْقَطَعَتْ السُّبُلُ وَهَلَكَتْ الْمَوَاشِي فَقَالَ اللَّهُمَّ عَلَى رُءُوسِ الْجِبَالِ وَالْآكَامِ وَبُطُونِ الْأَوْدِيَةِ وَمَنَابِتِ الشَّجَرِ فَانْجَابَتْ عَنْ الْمَدِينَةِ انْجِيَابَ الثَّوْبِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Syarik bin 'Abdullah bin Abu Namir] dari [Anas bin Malik] dia berkata; \"Ada seorang lelaki datang kepada Rasulullah Shalallahu 'Alaihi Wa Sallam, lalu berkata; 'Wahai Rasulullah, binatang ternak telah binasa dan jalan-jalan telah terputus, maka berdoalah kepada Allah Azza wa Jalla. Kemudian Rasulullah shallallahu 'alaihi wasallam berdoa, maka turunlah hujan dari hari Jum'at ke Jum'at berikutnya.\" Lalu datang seorang lelaki kepada Rasulullah Shalallahu 'Alaihi Wa Sallam dan berkata; ' Wahai Rasulullah Shalallahu 'Alaihi Wa Sallam, rumah-rumah telah hancur. jalan-jalan telah terputus, dan binatang ternak telah binasa'. Kemudian Rasulullah Shalallahu 'Alaihi Wa Sallam berdoa: ' Ya Allah, turunkan hujan itu di atas puncak gunung, bukit, di tengah-tengah lembah, serta di tempat tumbuhnya pepohonan'. Maka awan pun menjauh dari Madinah bagaikan lepasnya baju (dari badan).\""
            },
            {
                "number": 1472,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ أَبِي بَكْرِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ عَبَّادِ بْنِ تَمِيمٍ قَالَ سُفْيَانُ فَسَأَلْتُ عَبْدَ اللَّهِ بْنَ أَبِي بَكْرٍ فَقَالَ سَمِعْتُهُ مِنْ عَبَّادِ بْنِ تَمِيمٍ يُحَدِّثُ أَبِي أَنَّ عَبْدَ اللَّهِ بْنَ زَيْدٍ الَّذِي أُرِيَ النِّدَاءَ قَالَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ إِلَى الْمُصَلَّى يَسْتَسْقِي فَاسْتَقْبَلَ الْقِبْلَةَ وَقَلَبَ رِدَاءَهُ وَصَلَّى رَكْعَتَيْنِقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا غَلَطٌ مِنْ ابْنِ عُيَيْنَةَ وَعَبْدُ اللَّهِ بْنُ زَيْدٍ الَّذِي أُرِيَ النِّدَاءَ هُوَ عَبْدُ اللَّهِ بْنُ زَيْدِ بْنِ عَبْدِ رَبِّهِ وَهَذَا عَبْدُ اللَّهِ بْنُ زَيْدِ بْنِ عَاصِمٍ",
                "id": "Telah mengabarkan kepadaku [Muhammad bin Manshur] dia berkata; telah menceritakan kepada kami [Sufyan] dia berkata; telah menceritakan kepada kami [Al Mas'udi] dari [Abu Bakr bin 'Amru bin Hazm] dari ['Abbad bin Tamim], [Sufyan] berkata; 'Aku bertanya kepada ['Abdullah bin Abu Bakr] lalu dia menjawab; 'Aku mendengarnya dari ['Abbad bin Tamim]; Bapakku menceritakan bahwa ['Abdullah bin Zaid] -orang yang bermimpi tentang adzan-berkata; \" Rasulullah Shalallahu 'Alaihi Wa Sallam suatu hari keluar menuju tempat sholat untuk meminta hujan. Beliau menghadap kiblat dan membalik selendangnya, lalu sholat dua rakaat.\" Abu Abdurrahman berkata; \"Ini kesalahan dari Ibnu Uyainah, Abdullah bin Zaid yang mimpi tentang adzan- adalah Abdullah bin Zaid bin Abdu Rabbih, sedangkan ini adalah Abdullah bin Zaid bin Ashim.\""
            },
            {
                "number": 1473,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى عَنْ عَبْدِ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ هِشَامِ بْنِ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ كِنَانَةَ عَنْ أَبِيهِ قَالَأَرْسَلَنِي فُلَانٌ إِلَى ابْنِ عَبَّاسٍ أَسْأَلُهُ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الِاسْتِسْقَاءِ فَقَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَضَرِّعًا مُتَوَاضِعًا مُتَبَذِّلًا فَلَمْ يَخْطُبْ نَحْوَ خُطْبَتِكُمْ هَذِهِ فَصَلَّى رَكْعَتَيْنِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] dan [Muhammad bin Al Mutsanna] dari ['Abdurrahman] dari [Sufyan] dari [Hisyam bin Ishaq bin 'Abdullah bin Kinanah] dari [Bapaknya] dia berkata; \"Seseorang mengutusku menemui [Ibnu Abbas], dan aku bertanya kepadanya tentang cara sholat Istisqa' Rasulullah Shalallahu 'Alaihi Wa Sallam?, maka ia menjawab; 'Rasulullah Shalallahu 'Alaihi Wa Sallam keluar dengan merendahkan diri, tawadlu, serta berpakaian sederhana. Beliau tidak berkhutbah seperti kalian. Lalu beliau sholat dua rakaat'.\""
            },
            {
                "number": 1474,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ عَنْ عُمَارَةَ بْنِ غَزِيَّةَ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَسْقَى وَعَلَيْهِ خَمِيصَةٌ سَوْدَاءُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami ['Abdul 'Aziz] dari ['Umarah bin Ghaziyyah] dari ['Abbad bin Tamim] dari ['Abdullah bin Zaid] bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam memohon hujan, dan beliau mengenakan pakaian hitam."
            },
            {
                "number": 1475,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مُحَمَّدٍ قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ هِشَامِ بْنِ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ كِنَانَةَ عَنْ أَبِيهِ قَالَسَأَلْتُ ابْنَ عَبَّاسٍ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الِاسْتِسْقَاءِ فَقَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَبَذِّلًا مُتَوَاضِعًا مُتَضَرِّعًا فَجَلَسَ عَلَى الْمِنْبَرِ فَلَمْ يَخْطُبْ خُطْبَتَكُمْ هَذِهِ وَلَكِنْ لَمْ يَزَلْ فِي الدُّعَاءِ وَالتَّضَرُّعِ وَالتَّكْبِيرِ وَصَلَّى رَكْعَتَيْنِ كَمَا كَانَ يُصَلِّي فِي الْعِيدَيْنِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Ubaid bin Muhammad] dia berkata; telah menceritakan kepada kami [Hatim bin Isma'il] dari [Hisyam bin Ishaq bin 'Abdullah bin Kinanah] dari [Bapaknya] dia berkata; \"Aku bertanya kepada [Ibnu 'Abbas] tentang cara sholat Istisqa' Rasulullah Shalallahu 'Alaihi Wa Sallam, maka ia menjawab; 'Rasulullah Shalallahu 'Alaihi Wa Sallam keluar dengan berpakaian sederhana dan tawadlu, serta merendahkan diri. Lalu beliau duduk di atas mimbar dan tidak berkhutbah seperti kalian, namun beliau senantiasa berdoa dan merendahkan diri serta bertakbir. Kemudian sholat dua rakaat sebagaimana beliau sholat pada dua hari raya'.\""
            },
            {
                "number": 1476,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا الْوَلِيدُ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ عَبَّادِ بْنِ تَمِيمٍ أَنَّ عَمَّهُ حَدَّثَهُأَنَّهُ خَرَجَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَسْقِي فَحَوَّلَ رِدَاءَهُ وَحَوَّلَ لِلنَّاسِ ظَهْرَهُ وَدَعَا ثُمَّ صَلَّى رَكْعَتَيْنِ فَقَرَأَ فَجَهَرَ",
                "id": "Telah mengabarkan kepadaku ['Amru bin 'Utsman] dia berkata; telah menceritakan kepada kami [Al Walid] dari [Ibnu Abu Dzi'b] dari [Az Zuhri] dari ['Abbad bin Tamim], [pamannya] menceritakan kepadanya bahwa dia pernah berangkat bersama Rasulullah Shalallahu 'Alaihi Wa Sallam untuk memohon hujan. Beliau memindahkan posisi selendangnya dan membalik punggungnya (membelakangi) manusia. Kemudian berdoa dan sholat dua rakaat. Beliau membaca (ayat Al Qur'an) dengan suara yang keras.\""
            },
            {
                "number": 1477,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَمِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَسْقَى وَصَلَّى رَكْعَتَيْنِ وَقَلَبَ رِدَاءَهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Sufyan] dari ['Abdullah bin Abu Bakr] dari ['Abbad bin Tamim] dari [pamannya], bahwa Nabi Shalallahu 'Alaihi Wa Sallam pernah meminta hujan, Beliau sholat dua raka'at serta membalik selendangnya."
            },
            {
                "number": 1478,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ أَنَّهُ سَمِعَ عَبَّادَ بْنَ تَمِيمٍ يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ زَيْدٍ يَقُولُخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَسْقَى وَحَوَّلَ رِدَاءَهُ حِينَ اسْتَقْبَلَ الْقِبْلَةَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari ['Abdullah bin Abu Bakr] bahwasanya ia mendengar ['Abbad bin Tamim] berkata; \"Aku mendengar ['Abdullah bin Zaid] berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam keluar, lalu Beliau meminta hujan dan merubah posisi selendangnya saat menghadap kiblat.\""
            },
            {
                "number": 1479,
                "arab": "أَخْبَرَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ أَبُو تَقِيٍّ الْحِمْصِيُّ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ شُعَيْبٍ عَنْ الزُّهْرِيِّ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَمِّهِأَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الِاسْتِسْقَاءِ اسْتَقْبَلَ الْقِبْلَةَ وَقَلَبَ الرِّدَاءَ وَرَفَعَ يَدَيْهِ",
                "id": "Telah mengabarkan kepada kami [Hisyam bin 'Abdul Malik Abu Taqiyyul Himshi] dia berkata; telah menceritakan kepada kami [Baqiyyah] dari [Syu'aib] dari [Az Zuhri] dari ['Abbad bin Tamim] dari [pamannya] bahwasanya ia pernah melihat Rasulullah Shalallahu 'Alaihi Wa Sallam menghadap kiblat saat meminta hujan dan membalik selendangnya, serta mengangkat kedua tangannya."
            },
            {
                "number": 1480,
                "arab": "أَخْبَرَنِي شُعَيْبُ بْنُ يُوسُفَ عَنْ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَرْفَعُ يَدَيْهِ فِي شَيْءٍ مِنْ الدُّعَاءِ إِلَّا فِي الِاسْتِسْقَاءِ فَإِنَّهُ كَانَ يَرْفَعُ يَدَيْهِ حَتَّى يُرَى بَيَاضُ إِبْطَيْهِ",
                "id": "Telah mengabarkan kepadaku [Syu'aib bin Yusuf] dari [Yahya bin Sa'id Al Qaththan] dari [Sa'id] dari [Qatadah] dari ' [Anas bin Malik] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam tidak mengangkat kedua tangannya sedikitpun saat berdoa, kecuali saat meminta hujan. Beliau shallallahu 'alaihi wasallam mengangkat kedua tangannya hingga nampak ketiaknya yang putih.\""
            },
            {
                "number": 1481,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ خَالِدِ بْنِ يَزِيدَ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ عَنْ عُمَيْرٍ مَوْلَى آبِي اللَّحْمِ عَنْ آبِي اللَّحْمِأَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ أَحْجَارِ الزَّيْتِ يَسْتَسْقِي وَهُوَ مُقْنِعٌ بِكَفَّيْهِ يَدْعُو",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Khalid bin Yazid] dari [Sa'id bin Abu Hilal] dari [Yazid bin 'Abdullah] dari ['Umair] -budak Abu Al Lahm- dari [Abu Al Lahm] bahwa dia pernah melihat Rasulullah Shalallahu 'Alaihi Wa Sallam berada di Ahjaruz Zait (suatu tempat di Madinah) sedang meminta hujan. Beliau berdo? dengan mengangkat telapak tangannya."
            },
            {
                "number": 1482,
                "arab": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ سَعِيدٍ وَهُوَ الْمَقْبُرِيُّ عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ سَمِعَهُ يَقُولُبَيْنَا نَحْنُ فِي الْمَسْجِدِ يَوْمَ الْجُمُعَةِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ النَّاسَ فَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ تَقَطَّعَتْ السُّبُلُ وَهَلَكَتْ الْأَمْوَالُ وَأَجْدَبَ الْبِلَادُ فَادْعُ اللَّهَ أَنْ يَسْقِيَنَا فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ حِذَاءَ وَجْهِهِ فَقَالَ اللَّهُمَّ اسْقِنَا فَوَاللَّهِ مَا نَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمِنْبَرِ حَتَّى أُوسِعْنَا مَطَرًا وَأُمْطِرْنَا ذَلِكَ الْيَوْمَ إِلَى الْجُمُعَةِ الْأُخْرَى فَقَامَ رَجُلٌ لَا أَدْرِي هُوَ الَّذِي قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَسْقِ لَنَا أَمْ لَا فَقَالَ يَا رَسُولَ اللَّهِ انْقَطَعَتْ السُّبُلُ وَهَلَكَتْ الْأَمْوَالُ مِنْ كَثْرَةِ الْمَاءِ فَادْعُ اللَّهَ أَنْ يُمْسِكَ عَنَّا الْمَاءَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا وَلَكِنْ عَلَى الْجِبَالِ وَمَنَابِتِ الشَّجَرِ قَالَ وَاللَّهِ مَا هُوَ إِلَّا أَنْ تَكَلَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذَلِكَ تَمَزَّقَ السَّحَابُ حَتَّى مَا نَرَى مِنْهُ شَيْئًا",
                "id": "Telah mengabarkan kepada kami ['Isa bin Hammad] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Sa'id Al Maqburi] dari [Syarik bin 'Abdullah bin Abu Namir] dari [Anas bin Malik], bahwasanya dia (Syarik) mendengar Anas berkata; \"Ketika kami sedang di masjid pada hari Jum'at dan Rasulullah Shalallahu 'Alaihi Wa Sallam sedang menyampaikan khutbah kepada manusia, tiba-tiba ada seorang lelaki yang berdiri dan berkata; 'Wahai Rasulullah, jalan-jalan telah terputus, harta benda telah binasa, dan negeri telah paceklik, maka berdoalah kepada Allah agar Dia menurunkan hujan kepada kami'. Lalu Rasulullah Shalallahu 'Alaihi Wa Sallam mengangkat kedua tangannya sejajar dengan wajahnya sambil mengucapkan: 'Ya Alllah, turunkan hujan kepada kami'. Demi Allah, sebelum Rasulullah shallallahu 'alaihi wasallam sempat turun dari mimbarnya, kami sudah diguyur hujan. Kami diberi hujan pada hari itu sampai Jum'at berikutnya. Lalu ada orang lelaki, -aku tidak tahu apakah dia yang telah berkata kepada Rasulullah shallallahu 'alaihi wasallam 'Berilah kami hujan' atau bukan- berkata; 'Wahai Rasulullah, jalan-jalan telah terputus dan harta benda telah hancur karena melimpahnya air, maka berdoalah kepada Allah agar Dia menahan air itu dari kami'. Lalu Rasulullah shallallahu 'alaihi wasallam berdoa: 'Ya Allah (turunkanlah hujan) di sekitar kami dan jangan atas kami, tetapi di gunung-gunung dan di tempat-tempat tumbuhnya pepohonan'.\" Anas berkata; \"Demi Allah, tidaklah Rasulullah shallallahu 'alaihi wasallam mengatakan demikian kecuali awan itu telah berpencar hingga kami tidak melihatnya sedikitpun.\""
            },
            {
                "number": 1483,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنِي أَبُو هِشَامٍ الْمُغِيرَةُ بْنُ سَلَمَةَ قَالَ حَدَّثَنِي وُهَيْبٌ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُمَّ اسْقِنَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepadaku [Abu Hisyam Al Mughirah bin Salamah] dia berkata; telah menceritakan kepadaku [Wuhaib] dia berkata; Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Anas bin Malik], bahwa Nabi Shalallahu 'Alaihi Wa Sallam bersabda: \"Ya Allah turunkanlah hujan kepada kami.\""
            },
            {
                "number": 1484,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ بْنَ عُمَرَ وَهُوَ الْعُمَرِيُّ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ فَقَامَ إِلَيْهِ النَّاسُ فَصَاحُوا فَقَالُوا يَا نَبِيَّ اللَّهِ قَحَطَتْ الْمَطَرُ وَهَلَكَتْ الْبَهَائِمُ فَادْعُ اللَّهَ أَنْ يَسْقِيَنَا قَالَ اللَّهُمَّ اسْقِنَا اللَّهُمَّ اسْقِنَا قَالَ وَايْمُ اللَّهِ مَا نَرَى فِي السَّمَاءِ قَزَعَةً مِنْ سَحَابٍ قَالَ فَأَنْشَأَتْ سَحَابَةٌ فَانْتَشَرَتْ ثُمَّ إِنَّهَا أُمْطِرَتْ وَنَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى وَانْصَرَفَ النَّاسُ فَلَمْ تَزَلْ تَمْطُرُ إِلَى يَوْمِ الْجُمُعَةِ الْأُخْرَى فَلَمَّا قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ صَاحُوا إِلَيْهِ فَقَالُوا يَا نَبِيَّ اللَّهِ تَهَدَّمَتْ الْبُيُوتُ وَتَقَطَّعَتْ السُّبُلُ فَادْعُ اللَّهَ أَنْ يَحْبِسَهَا عَنَّا فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا فَتَقَشَّعَتْ عَنْ الْمَدِينَةِ فَجَعَلَتْ تَمْطُرُ حَوْلَهَا وَمَا تَمْطُرُ بِالْمَدِينَةِ قَطْرَةً فَنَظَرْتُ إِلَى الْمَدِينَةِ وَإِنَّهَا لَفِي مِثْلِ الْإِكْلِيلِ",
                "id": "Telah mengabarkan kepada kami [Muhammad ibn 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Al Mu'tamir] dia berkata; aku mendengar ['ubaidhullah bin 'Umar Al 'Umari] dari [Tsabit] dari [Anas bin Malik] dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam pernah khutbah pada hari Jum'at, maka orang-orang segera berkumpul dan berteriak kepadanya dengan berkata; 'Wahai Nabi Allah, hujan telah terputus dan binatang ternak telah binasa, maka berdoalah kepada Allah agar Dia menurunkan hujan kepada kami'. Beliau Shalallahu 'Alaihi Wa Sallam lalu berdoa: `Ya Allah, berilah kami hujan. Ya Allah, berilah kami hujan'. Anas berkata; \"Demi Allah, kami tidak melihat setitik awan pun di langit.\" Dia melanjutkan lagi, \"Lalu awan muncul dan bertebaran, kemudian menurunkan hujan. Setelah itu Rasulullah turun dari mimbar, kemudian sholat. Manusia pun bubar, sedangkan hujan belum reda sampai dengan Jum'at berikutnya. Ketika Rasulullah shallallahu 'alaihi wasallam berdiri untuk khutbah, orang-orang berteriak kepadanya dengan berkata; 'Wahai Nabi Allah, rumah-rumah telah hancur dan jalan-jalan telah terputus, maka berdoalah agar Dia menahan hujan dari kami'. Rasulullah shallallahu 'alaihi wasallam tersenyum, lalu berdoa: `Ya Allah (berilah hujan) di sekitar kami dan jangan di atas kami'. Maka terhentilah hujan itu di Madinah, dan hujan hanya turun di sekitarnya. Di Madinah tidak turun setetes pun, aku melihat Madinah laksana di kelilingi awan.\""
            },
            {
                "number": 1485,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَجُلًا دَخَلَ الْمَسْجِدَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمٌ يَخْطُبُ فَاسْتَقْبَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمًا وَقَالَ يَا رَسُولَ اللَّهِ هَلَكَتْ الْأَمْوَالُ وَانْقَطَعَتْ السُّبُلُ فَادْعُ اللَّهَ أَنْ يُغِيثَنَا فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ ثُمَّ قَالَ اللَّهُمَّ أَغِثْنَا اللَّهُمَّ أَغِثْنَا قَالَ أَنَسٌ وَلَا وَاللَّهِ مَا نَرَى فِي السَّمَاءِ مِنْ سَحَابَةٍ وَلَا قَزَعَةٍ وَمَا بَيْنَنَا وَبَيْنَ سَلْعٍ مِنْ بَيْتٍ وَلَا دَارٍ فَطَلَعَتْ سَحَابَةٌ مِثْلُ التُّرْسِ فَلَمَّا تَوَسَّطَتْ السَّمَاءَ انْتَشَرَتْ وَأَمْطَرَتْ قَالَ أَنَسٌ وَلَا وَاللَّهِ مَا رَأَيْنَا الشَّمْسَ سَبْتًا قَالَ ثُمَّ دَخَلَ رَجُلٌ مِنْ ذَلِكَ الْبَابِ فِي الْجُمُعَةِ الْمُقْبِلَةِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمٌ يَخْطُبُ فَاسْتَقْبَلَهُ قَائِمًا فَقَالَ يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ وَسَلَّمَ عَلَيْكَ هَلَكَتْ الْأَمْوَالُ وَانْقَطَعَتْ السُّبُلُ فَادْعُ اللَّهَ أَنْ يُمْسِكَهَا عَنَّا فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ فَقَالَ اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا اللَّهُمَّ عَلَى الْآكَامِ وَالظِّرَابِ وَبُطُونِ الْأَوْدِيَةِ وَمَنَابِتِ الشَّجَرِ قَالَ فَأَقْلَعَتْ وَخَرَجْنَا نَمْشِي فِي الشَّمْسِقَالَ شَرِيكٌ سَأَلْتُ أَنَسًا أَهُوَ الرَّجُلُ الْأَوَّلُ قَالَ لَا",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah menceritakan kepada kami [Isma'il bin Ja'far] dia berkata; telah menceritakan kepada kami [Syarik bin 'Abdullah] dari [Anas bin Malik]; \"Ada seorang lelaki yang datang kepada Rasulullah Shalallahu 'Alaihi Wa Sallam, sedangkan beliau sedang khutbah sambil berdiri, lalu dia menghadap kepada beliau sambil berdiri lantas berkata; 'Wahai Rasulullah, harta benda telah hancur dan jalan-jalan telah terputus, maka berdoalah kepada Allah Azza wa Jalla agar Dia menolong kami'. Kemudian Rasulullah Shalallahu 'Alaihi Wa Sallam mengangkat kedua tangannya dan berdoa: 'Ya Allah, tolonglah kami. Ya Allah, tolonglah kami'.\" Anas berkata; \"Tidak, demi Allah, kami tidak melihat awan di langit, juga tidak ada mendung, padahal tidak ada rumah di antara kami dan gunung Sala' (sebuah gunung di Madinah), lalu muncul awan laksana perisai, dan setelah awan berada di tengah-tengah langit maka awan itu menyebar, sehingga turun menjadi hujan. Demi Allah, kami tidak melihat matahari selama satu pekan.\" Anas melanjutkan, \"Kemudian pada hari Jum'at berikutnya seorang lelaki datang kepada Rasulullah Shalallahu 'Alaihi Wa Sallam dari pintu tadi ketika beliau Shalallahu 'Alaihi Wa Sallam sedang khutbah sambil berdiri, lalu orang tadi berkata; 'Wahai Rasulullah Shalallahu 'Alaihi Wa Sallam, harta benda telah hancur dan jalan-jalan telah terputus, maka berdoalah kepada Allah agar Dia menahan hujan dari kami'. Lalu Rasulullah Shalallahu 'Alaihi Wa Sallam mengangkat kedua tangannya sambil berdoa, 'Ya Allah (turunkan hujan) di sekitar kami dan jangan di atas kami. Ya Allah, turunkan di bukit-bukit, gunung-gunung, lubuk lembah, serta di tempat tumbuhnya pepohonan'. Maka awan pun lenyap, lalu kami keluar dan berjalan di bawah teriknya matahari.\" Syarik berkata; \"Aku bertanya kepada Anas; `Apakah dia lelaki yang pertama tadi? ' la menjawab, 'Bukan'.\""
            },
            {
                "number": 1486,
                "arab": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ عَنْ ابْنِ أَبِي ذِئْبٍ وَيُونُسَ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عَبَّادُ بْنُ تَمِيمٍ أَنَّهُ سَمِعَ عَمَّهُ وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا يَسْتَسْقِي فَحَوَّلَ إِلَى النَّاسِ ظَهْرَهُ يَدْعُو اللَّهَ وَيَسْتَقْبِلُ الْقِبْلَةَ وَحَوَّلَ رِدَاءَهُ ثُمَّ صَلَّى رَكْعَتَيْنِ قَالَ ابْنُ أَبِي ذِئْبٍ فِي الْحَدِيثِ وَقَرَأَ فِيهِمَا",
                "id": "Telah berkata [Al Harits bin Miskin] dalam bentuk baca dan aku mendengarnya dari [Ibnu Wahb] dari [Ibnu Abu Dzi'b] dan [Yunus] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku ['Abbad bin Tamim] bahwasanya ia mendengar [pamannya] -seorang sahabat Rasulullah Shalallahu 'Alaihi Wa Sallam- dia berkata; \"Pada suatu hari Rasulullah Shalallahu 'Alaihi Wa Sallam keluar untuk meminta hujan, lalu beliau membalik punggungnya (membelakangi manusia) dan berdoa sambil menghadap kiblat. Beliau juga membalik selendangnya, kemudian sholat dua rakaat.\" Ibnu Abu Dzi'ib berkata; 'Dan membaca surat dalam dua rakaat tersebut.'"
            },
            {
                "number": 1487,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ يَحْيَى عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يَسْتَسْقِي فَصَلَّى رَكْعَتَيْنِ وَاسْتَقْبَلَ الْقِبْلَةَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Yahya] dari [Abu Bakr bin Muhammad] dari ['Abbad bin Tamim] dari ['Abdullah bin Zaid] bahwa Nabi Shalallahu 'Alaihi Wa Sallam keluar untuk sholat Istisqa', lalu sholat dua rakaat dan menghadap kiblat."
            },
            {
                "number": 1488,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ هِشَامِ بْنِ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ كِنَانَةَ عَنْ أَبِيهِ قَالَأَرْسَلَنِي أَمِيرٌ مِنْ الْأُمَرَاءِ إِلَى ابْنِ عَبَّاسٍ أَسْأَلُهُ عَنْ الِاسْتِسْقَاءِ فَقَالَ ابْنُ عَبَّاسٍ مَا مَنَعَهُ أَنْ يَسْأَلَنِي خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَوَاضِعًا مُتَبَذِّلًا مُتَخَشِّعًا مُتَضَرِّعًا فَصَلَّى رَكْعَتَيْنِ كَمَا يُصَلِّي فِي الْعِيدَيْنِ وَلَمْ يَخْطُبْ خُطْبَتَكُمْ هَذِهِ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] dia berkata; telah menceritakan kepada kami [Waki'] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Hisyam bin Ishaq bin 'Abdullah bin Kinanah] dari [bapaknya] dia berkata; \"Seorang amir mengutusku kepada Ibnu 'Abbas untuk menanyakan tentang sholat Istisqa, maka [Ibnu 'Abbas] berkata; \"Seorang amir (pemimpin) mengutusku kepada Ibnu Abbas, untuk bertanya kepadanya tentang cara sholat lstisqa' Rasulullah Shalallahu 'Alaihi Wa Sallam? la menjawab, 'Apa yang menghalanginya untuk bertanya kepadaku? Rasulullah Shalallahu 'Alaihi Wa Sallam keluar dengan tawadhu', berpakaian sederhana, khusyu', dan merendahkan diri. Lalu sholat dua rakaat sebagaimana sholat dua hari raya, dan beliau tidak berkhutbah seperti khutbah kalian ini'.\""
            },
            {
                "number": 1489,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَمِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ فَاسْتَسْقَى فَصَلَّى رَكْعَتَيْنِ جَهَرَ فِيهِمَا بِالْقِرَاءَةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'] dia berkata; telah menceritakan kepada kami [Yahya bin Adam] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Dzi'b] dari [Az Zuhri] dari ['Abbad bin Tamim] dari [pamannya] bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam pernah keluar untuk memohon hujan, maka beliau sholat dua rakaat dan membaca (ayat Al Qur'an) dengan suara yang keras pada dua rakaat tersebut."
            },
            {
                "number": 1490,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مِسْعَرٍ عَنْ الْمِقْدَامِ بْنِ شُرَيْحٍ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أُمْطِرَ قَالَ اللَّهُمَّ اجْعَلْهُ صَيِّبًا نَافِعًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Mis'ar] dari [Al Miqdam bin Syuraih] dari [bapaknya] dari ['Aisyah] bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam bila turun hujan, maka beliau mengucapkan: \"Ya, Allah jadikanlah hujan ini bermanfaat.\""
            }
        ]
    }
}