{
    "status": true,
    "data": {
        "start": 2236,
        "end": 2384,
        "total": 149,
        "book": "nasai",
        "hadits": [
            {
                "number": 2236,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ حَفْصَةَ قَالَتْلَا صِيَامَ لِمَنْ لَمْ يُجْمِعْ الصِّيَامَ قَبْلَ الْفَجْرِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Sufyan] dari [Az Zuhri] dari [Hamzah bin 'Abdullah bin 'Umar] dari [Hafshah] dia berkata; \"Tidak ada puasa bagi orang yang tidak berniat sebelum terbit fajar.\""
            },
            {
                "number": 2237,
                "arab": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ عَائِشَةَ وَحَفْصَةَ مِثْلَهُلَا يَصُومُ إِلَّا مَنْ أَجْمَعَ الصِّيَامَ قَبْلَ الْفَجْرِ",
                "id": "Berkata [Al Harits bin Miskin] secara baca dan aku mendengarnya dari [Ibnul Qasim] dia berkata; telah menceritakan kepadaku [Malik] dari [Ibnu Syihab] dari ['Aisyah] dan [Hafshah] dengan hadits yang sama; \"Tidak -dianggap- berpuasa kecuali orang yang berniat puasa sebelum terbit fajar.\""
            },
            {
                "number": 2238,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَإِذَا لَمْ يُجْمِعْ الرَّجُلُ الصَّوْمَ مِنْ اللَّيْلِ فَلَا يَصُمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Al Mu'tamir] dia berkata; aku mendengar ['ubaidhullah] dari [Nafi'] dari [Ibnu 'Umar] dia berkata; \"Jika seseorang belum berniat puasa dari waktu malam, ia tidak boleh berpuasa.\""
            },
            {
                "number": 2239,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَمْرِو بْنِ أَوْسٍ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَبُّ الصِّيَامِ إِلَى اللَّهِ عَزَّ وَجَلَّ صِيَامُ دَاوُدَ عَلَيْهِ السَّلَام كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا وَأَحَبُّ الصَّلَاةِ إِلَى اللَّهِ عَزَّ وَجَلَّ صَلَاةُ دَاوُدَ عَلَيْهِ السَّلَام كَانَ يَنَامُ نِصْفَ اللَّيْلِ وَيَقُومُ ثُلُثَهُ وَيَنَامُ سُدُسَهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari ['Amru bin Dinar] dari ['Amru bin Aus] bahwasanya ia mendengar ['Abdullah bin 'Amru bin Al 'Ash] berkata; \"Puasa yang paling dicintai oleh Allah -Azza wa Jalla- yaitu puasa Nabi Daud Alaihis Salam, ia berpuasa sehari dan berbuka sehari, dan sholat yang paling dicintai oleh Allah -Azza wa Jalla- yaitu sholat Nabi Daud Alaihis Salam, ia tidur setengah malamnya, bangun sepertiganya dan tidur seperenamnya.\""
            },
            {
                "number": 2240,
                "arab": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ قَالَ حَدَّثَنَا يَعْقُوبُ عَنْ جَعْفَرٍ عَنْ سَعِيدٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُفْطِرُ أَيَّامَ الْبِيضِ فِي حَضَرٍ وَلَا سَفَرٍ",
                "id": "Telah mengabarkan kepada kami [Al Qasim bin Zakaria] dia berkata; telah menceritakan kepada kami ['ubaidhullah] dia berkata; telah menceritakan kepada kami [Ya'qub] dari [Ja'far] dari [Sa'id] dari [Ibnu 'Abbas] dia berkata; \"Rasulullah Shallallahu'alaihi wa Sallam tidak berbuka pada hari Bidl (tiga belas, empat belas dan lima belas setiap bulan hijriyah) baik ketika mukim maupun ketika safar.\""
            },
            {
                "number": 2241,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ حَتَّى نَقُولَ لَا يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ مَا يُرِيدُ أَنْ يَصُومَ وَمَا صَامَ شَهْرًا مُتَتَابِعًا غَيْرَ رَمَضَانَ مُنْذُ قَدِمَ الْمَدِينَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Muhammad] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam membiasakan berpuasa hingga kita mengatakan; \"Beliau tidak pernah berbuka.\" Dan beliau sering tidak puasa hingga kita mengatakan; \"Beliau tidak ingin berpuasa, dan tidak berpuasa satu bulan berturut-turut selain ramadhan sejak tiba di Madinah.\""
            },
            {
                "number": 2242,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ عَنْ خَالِدٍ قَالَ حَدَّثَنَا سَعِيدٌ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ قَالَتْلَا أَعْلَمُ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ الْقُرْآنَ كُلَّهُ فِي لَيْلَةٍ وَلَا قَامَ لَيْلَةً حَتَّى الصَّبَاحِ وَلَا صَامَ شَهْرًا قَطُّ كَامِلًا غَيْرَ رَمَضَانَ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dari [Khalid] dia berkata; telah menceritakan kepada kami [Sa'id] dia berkata; telah menceritakan kepada kami [Qatadah] dari [Zurarah bin Aufa] dari [Sa'd bin Hisyam] dari ['Aisyah] dia berkata; \"Aku tidak pernah mengetahui Nabi shallallahu 'alaihi wasallam membaca Al Qur'an semuanya dalam semalam, tidak pernah melakukan sholat malam hingga menjelang pagi dan tidak pula berpuasa sama sekali sebulan penuh kecuali di bulan ramadhan.\""
            },
            {
                "number": 2243,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَسَأَلْتُ عَائِشَةَ عَنْ صِيَامِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كَانَ يَصُومُ حَتَّى نَقُولَ قَدْ صَامَ وَيُفْطِرُ حَتَّى نَقُولَ قَدْ أَفْطَرَ وَمَا صَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَهْرًا كَامِلًا مُنْذُ قَدِمَ الْمَدِينَةَ إِلَّا رَمَضَانَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Hammad] dari [Ayyub] dari ['Abdullah bin Syaqiq] dia berkata; Aku bertanya kepada ['Aisyah] mengenai puasa Nabi shallallahu 'alaihi wasallam, dia berkata; \"Beliau sering berpuasa hingga kami mengatakan; 'Sungguh beliau telah berpuasa, dan beliau sering berbuka hingga kami mengatakan; 'Sungguh beliau telah berbuka, ' Rasulullah shallallahu 'alaihi wasallam tidak pernah berpuasa sebulan penuh sejak tiba di Madinah kecuali di bulan ramadhan.\""
            },
            {
                "number": 2244,
                "arab": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي مَالِكٌ وَعَمْرُو بْنُ الْحَارِثِ وَذَكَرَ آخَرَ قَبْلَهُمَا أَنَّ أَبَا النَّضْرِ حَدَّثَهُمْ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ حَتَّى نَقُولَ مَا يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ مَا يَصُومُ وَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شَهْرٍ أَكْثَرَ صِيَامًا مِنْهُ فِي شَعْبَانَ",
                "id": "Telah mengabarkan kepada kami [Ar Rabi' bin Sulaiman bin Dawud] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku [Malik] dan ['Amru bin Al Harits] dan menyebutkan yang lainnya sebelum mereka berdua, bahwasanya [Abu An Nadhr] menceritakan kepada mereka dari [Abu Salamah] dari ['Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam berpuasa hingga kami mengatakan; \"Beliau sering tidak berbuka, \" dan beliau sering berbuka hingga kami mengatakan; \"Beliau tidak berpuasa, \" dan tidak pula aku melihat Rasulullah shallallahu 'alaihi wasallam dalam sebulan yang paling banyak puasanya dibanding bulan Sya'ban.\""
            },
            {
                "number": 2245,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ مَنْصُورٍ قَالَ سَمِعْتُ سَالِمَ بْنَ أَبِي الْجَعْدِ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَصُومُ شَهْرَيْنِ مُتَتَابِعَيْنِ إِلَّا شَعْبَانَ وَرَمَضَانَ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] dia berkata; telah menceritakan kepada kami [Abu Dawud] dia berkata; telah memberitakan kepada kami [Syu'bah] dari [Manshur] dia berkata; Aku mendengar [Salim bin Abul Ja'dari] dari [Abu Salamah] dari [Ummu Salamah] bahwa Rasulullah shallallahu 'alaihi wasallam tidak pernah berpuasa dua bulan berturut-turut kecuali bulan Sya'ban dan ramadhan.\""
            },
            {
                "number": 2246,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْوَلِيدِ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ تَوْبَةَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ لَمْ يَكُنْ يَصُومُ مِنْ السَّنَةِ شَهْرًا تَامًّا إِلَّا شَعْبَانَ وَيَصِلُ بِهِ رَمَضَانَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Walid] dia berkata; telah menceritakan kepada kami [Muhammad] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Taubah] dari [Muhammad bin Ibrahim] dari [Abu Salamah] dari [Ummu Salamah] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau tidak berpuasa sebulan penuh dalam setahun, kecuali bulan Sya'ban dan beliau menyambungnya dengan bulan ramadhan.\""
            },
            {
                "number": 2247,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ هِشَامٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ ابْنِ إِسْحَقَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ شَعْبَانَ إِلَّا قَلِيلًا",
                "id": "Telah mengabarkan kepadaku ['Amr bin Hisyam] dia berkata; telah menceritakan kepada kami [Muhammad bin Salamah] dari [Ibnu Ishaq] dari [Yahya bin Sa'id] dari [Abu Salamah] dari ['Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam berpuasa di bulan Sya'ban hanya beberapa hari.\""
            },
            {
                "number": 2248,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا بَقِيَّةُ قَالَ حَدَّثَنَا بَحِيرٌ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ أَنَّ عَائِشَةَ قَالَتْإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَصُومُ شَعْبَانَ كُلَّهُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Utsman] dia berkata; telah menceritakan kepada kami [Baqiyyah] dia berkata; telah menceritakan kepada kami [Bahir] dari [Khalid bin Ma'dan] dari [Jubair bin Nufair] bahwasanya ['Aisyah] berkata; \" Rasulullah shallallahu 'alaihi wasallam berpuasa di bulan Sya'ban satu bulan penuh.\""
            },
            {
                "number": 2249,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ عَنْ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا ثَابِتُ بْنُ قَيْسٍ أَبُو الْغُصْنِ شَيْخٌ مِنْ أَهْلِ الْمَدِينَةِ قَالَ حَدَّثَنِي أَبُو سَعِيدٍ الْمَقْبُرِيُّ قَالَ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّكَ تَصُومُ حَتَّى لَا تَكَادَ تُفْطِرُ وَتُفْطِرُ حَتَّى لَا تَكَادَ أَنْ تَصُومَ إِلَّا يَوْمَيْنِ إِنْ دَخَلَا فِي صِيَامِكَ وَإِلَّا صُمْتَهُمَا قَالَ أَيُّ يَوْمَيْنِ قُلْتُ يَوْمَ الِاثْنَيْنِ وَيَوْمَ الْخَمِيسِ قَالَ ذَانِكَ يَوْمَانِ تُعْرَضُ فِيهِمَا الْأَعْمَالُ عَلَى رَبِّ الْعَالَمِينَ فَأُحِبُّ أَنْ يُعْرَضَ عَمَلِي وَأَنَا صَائِمٌ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dari ['Abdurrahman] dia berkata; telah menceritakan kepada kami [Tsabit bin Qais Abu Al Ghushn] - seorang Syaikh dari penduduk Madinah - dia berkata; telah menceritakan kepadaku [Abu Sa'id Al Maqburi] dia berkata; telah menceritakan kepadaku [Usamah bin Zaid] dia berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, sering engkau berpuasa hingga hampir tidak berbuka dan sering juga engkau berbuka hingga hampir tidak berpuasa, kecuali dua hari, jika keduanya telah masuk dalam puasamu, jika tidak, engkau berpuasa di dua hari itu.\" Beliau bertanya: \"Dua hari yang mana?\" Aku menjawab; \"Hari senin dan hari kamis.\" Beliau bersabda: \"Itu adalah dua hari yang dalam keduanya amal perbuatan diperlihatkan kepada Rabb semesta alam, aku senang amalku diperlihatkan ketika aku sedang berpuasa.\""
            },
            {
                "number": 2250,
                "arab": "أَخْبَرَنِي حَاجِبُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا الْحَارِثُ بْنُ عَطِيَّةَ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ الْأَبَدَ فَلَا صَامَ",
                "id": "Telah mengabarkan kepadaku [Hajib bin Sulaiman] dia berkata; telah menceritakan kepada kami [Al Harits bin 'Athiyyah] dia berkata; telah menceritakan kepada kami [Al Auza'i] dari ['Atha bin Abu Rabah] dari ['Abdullah bin 'Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang berpuasa selama-lamanya, ia -dianggap- tidak berpuasa.\""
            },
            {
                "number": 2251,
                "arab": "حَدَّثَنَا عِيسَى بْنُ مُسَاوِرٍ عَنْ الْوَلِيدِ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ أَخْبَرَنِي عَطَاءٌ عَنْ عَبْدِ اللَّهِ ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنَا عَطَاءٌ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ الْأَبَدَ فَلَا صَامَ وَلَا أَفْطَرَ",
                "id": "Telah mengabarkan kepada kami ['Isa bin Musawir] dari [Al Walid] dia berkata; telah menceritakan kepada kami [Al Auza'i] dia berkata; telah mengabarkan kepadaku ['Atha] dari ['Abdullah] demikian juga diriwayatkan dari jalur lainnya, dan telah memberitakan kepada kami [Muhammad bin 'Abdullah] dia berkata; telah menceritakan kepadaku [Al Walid] dari [Al Auza'i] dia berkata; telah menceritakan kepada kami ['Atha] dari ['Abdullah bin 'Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang berpuasa selama-lamanya, ia -dianggap- tidak berpuasa dan tidak juga berbuka.\""
            },
            {
                "number": 2252,
                "arab": "أَخْبَرَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ قَالَ حَدَّثَنَا أَبِي وَعُقْبَةُ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنِي عَطَاءٌ قَالَ حَدَّثَنِي مَنْ سَمِعَ ابْنَ عُمَرَ يَقُولُقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ الْأَبَدَ فَلَا صَامَ",
                "id": "Telah mengabarkan kepada kami [Al 'Abbas bin Al Walid] dia berkata; [bapakku] dan ['Uqbah] telah menceritakan kepada kami dari [Al Auza'i] dia berkata; telah menceritakan kepadaku ['Atha] dia berkata; telah menceritakan kepadaku [orang yang telah mendengar] [Ibnu 'Umar] berkata; bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang berpuasa selama-lamanya, ia -dianggap- tidak berpuasa.\""
            },
            {
                "number": 2253,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى قَالَ حَدَّثَنَا أَبِي عَنْ الْأَوْزَاعِيِّ عَنْ عَطَاءٍ قَالَ حَدَّثَنِي مَنْ سَمِعَ ابْنَ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَامَ الْأَبَدَ فَلَا صَامَ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Ya'qub] dia berkata; telah menceritakan kepada kami [Muhammad bin Musa] dia berkata; [bapakku] telah menceritakan kepada kami, dari [Al Auza'i] dari ['Atha] dia berkata; telah menceritakan kepadaku [orang] yang mendengar [Ibnu 'Umar] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang berpuasa selama-lamanya, ia -dianggap- tidak berpuasa.\""
            },
            {
                "number": 2254,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ قَالَ حَدَّثَنَا ابْنُ عَائِذٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ الْأَوْزَاعِيِّ عَنْ عَطَاءٍ أَنَّهُ حَدَّثَهُ قَالَ حَدَّثَنِي مَنْ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ الْأَبَدَ فَلَا صَامَ وَلَا أَفْطَرَأَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ قَالَ ابْنُ جُرَيْجٍ سَمِعْتُ عَطَاءً أَنَّ أَبَا الْعَبَّاسِ الشَّاعِرَ أَخْبَرَهُ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ قَالَ بَلَغَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنِّي أَصُومُ أَسْرُدُ الصَّوْمَ وَسَاقَ الْحَدِيثَ قَالَ قَالَ عَطَاءٌ لَا أَدْرِي كَيْفَ ذَكَرَ صِيَامَ الْأَبَدِ لَا صَامَ مَنْ صَامَ الْأَبَدَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Ibrahim bin Muhammad] dia berkata; telah menceritakan kepada kami [Ibnu 'Aidz] dia berkata; telah menceritakan kepada kami [Yahya] dari [Al Auza'i] dari ['Atha] bahwasanya ia menceritakan kepadanya dia berkata; telah menceritakan kepadaku [orang] yang mendengar ['Abdullah bin 'Amr bin Al 'Ash] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang berpuasa selama-lamanya, ia -dianggap- tidak berpuasa dan tidak juga berbuka.\" Telah mengabarkan kepadaku [Ibrahim bin Al Hasan] dia berkata; Telah menceritakan kepada kami [Hajjaj bin Muhammad] dia berkata; [Ibnu Juraij] berkata; Aku mendengar [Atha'], - [Al Abbas ahli sya'ir] telah mengabarkan kepadanya- bahwa dia mendengar [Abdullah bin Amru bin Al Ash] berkata; \"Telah sampai berita kepada Nabi shallallahu 'alaihi wasallam bahwa aku berpuasa, berpuasa terus-menerus. Ia menyebutkan hadits tersebut. Ia berkata; Atha' mengatakan; \"Aku tidak tahu bagaimana ia menyebutkan puasa selama-lamanya, 'Tidak dianggap puasa bagi orang yang berpuasa selama-lamanya.\""
            },
            {
                "number": 2255,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا إِسْمَعِيلُ عَنْ الْجُرَيْرِيِّ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ أَخِيهِ مُطَرِّفٍ عَنْ عِمْرَانَ قَالَقِيلَ يَا رَسُولَ اللَّهِ إِنَّ فُلَانًا لَا يُفْطِرُ نَهَارًا الدَّهْرَ قَالَ لَا صَامَ وَلَا أَفْطَرَ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah memberitakan kepada kami [Isma'il] dari [Al Jurairi] dari [Yazid bin 'Abdullah bin Asy Syakhkhir] dari saudaranya [Mutharrif] dari ['Imran] dia berkata; seseorang bertanya; \"Wahai Rasulullah shallallahu 'alaihi wasallam, si fulan tidak berbuka di siang hari terus-menerus sepanjang masa?\" Beliau bersabda: \"Ia -dianggap- tidak berpuasa dan tidak berbuka.\""
            },
            {
                "number": 2256,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ هِشَامٍ قَالَ حَدَّثَنَا مَخْلَدٌ عَنْ الْأَوْزَاعِيِّ عَنْ قَتَادَةَ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ أَخْبَرَنِي أَبِيأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذُكِرَ عِنْدَهُ رَجُلٌ يَصُومُ الدَّهْرَ قَالَ لَا صَامَ وَلَا أَفْطَرَ",
                "id": "Telah mengabarkan kepadaku ['Amr bin Hisyam] dia berkata; telah menceritakan kepada kami [Makhlad] dari [Al Auza'i] dari [Qatadah] dari [Mutharrif bin 'Abdullah bin Asy Syakhkhir]; [bapakku] telah mengabarkan kepadaku bahwasanya ia mendengar Rasulullah shallallahu 'alaihi wasallam ketika disebutkan kepadanya tentang seseorang yang berpuasa sepanjang masa, beliau bersabda: \"Ia -dianggap- tidak berpuasa dan tidak berbuka.\""
            },
            {
                "number": 2257,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ مُطَرِّفَ بْنَ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ يُحَدِّثُ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي صَوْمِ الدَّهْرِ لَا صَامَ وَلَا أَفْطَرَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Abu Dawud] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dia berkata; aku mendengar [Mutharrif bin 'Abdullah bin Asy Syakhkhir] menceritakan dari [bapaknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda tentang puasa Dahr (puasa sepanjang masa): \"Dia tidak dihitung berpuasa dan tidak berbuka.\""
            },
            {
                "number": 2258,
                "arab": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى قَالَ أَنْبَأَنَا أَبُو هِلَالٍ قَالَ حَدَّثَنَا غَيْلَانُ وَهُوَ ابْنُ جَرِيرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ وَهُوَ ابْنُ مَعْبَدٍ الزِّمَّانِيُّ عَنْ أَبِي قَتَادَةَ عَنْ عُمَرَ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَرَرْنَا بِرَجُلٍ فَقَالُوا يَا نَبِيَّ اللَّهِ هَذَا لَا يُفْطِرُ مُنْذُ كَذَا وَكَذَا فَقَالَ لَا صَامَ وَلَا أَفْطَرَ",
                "id": "Telah mengabarkan kepadaku [Harun bin 'Abdullah] dia berkata; telah menceritakan kepada kami [Al Hasan bin Musa] dia berkata; telah memberitakan kepada kami [Abu Hilal] dia berkata; telah menceritakan kepada kami [Ghailan bin Jarir] dia berkata; telah menceritakan kepada kami ['Abdullah bin Ma'bad Az Zamani] dari [Abu Qatadah] dari ['Umar] dia berkata; Kami pernah bersama Rasulullah shallallahu 'alaihi wasallam, lalu kami melewati seseorang. Kemudian mereka berkata; \"Wahai Nabi Allah, orang ini tidak berbuka sejak hari ini dan ini?\" beliau bersabda: \"Ia -dianggap- tidak berpuasa dan tidak berbuka.\""
            },
            {
                "number": 2259,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ غَيْلَانَ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ مَعْبَدٍ الزِّمَّانِيَّ عَنْ أَبِي قَتَادَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ صَوْمِهِ فَغَضِبَ فَقَالَ عُمَرُ رَضِينَا بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ رَسُولًا وَسُئِلَ عَمَّنْ صَامَ الدَّهْرَ فَقَالَ لَا صَامَ وَلَا أَفْطَرَ أَوْ مَا صَامَ وَمَا أَفْطَرَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Muhammad] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Ghailan] bahwasanya ia mendengar ['Abdullah bin Ma'bad Az Zamani] dari [Abu Qatadah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah ditanya tentang puasa beliau. Beliau marah. Lalu Umar berkata; \"Kami rela Allah sebagai Rabb, Islam sebagai agama dan Muhammad sebagai Rasul\", lalu beliau ditanya tentang orang yang berpuasa dahr, beliau menjawab: \"Dia -dianggap- tidak berpuasa dan tidak berbuka. Atau ia tidak berpuasa dan tidak berbuka.\""
            },
            {
                "number": 2260,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ حَمْزَةَ بْنَ عَمْرٍو الْأَسْلَمِيَّ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ أَسْرُدُ الصَّوْمَ أَفَأَصُومُ فِي السَّفَرِ قَالَ صُمْ إِنْ شِئْتَ أَوْ أَفْطِرْ إِنْ شِئْتَ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Habib bin 'Arabi] dia berkata; telah menceritakan kepada kami [Hammad] dari [Hisyam] dari [bapaknya] dari ['Aisyah] bahwasanya Hamzah bin 'Amru Al Aslami bertanya kepada Rasulullah shallallahu 'alaihi wasallam, ia berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, aku adalah orang yang terus-menerus berpuasa, apakah aku -boleh- berpuasa saat dalam bepergian?\" Beliau bersabda: \"Berpuasalah jika engkau menghendaki dan berbukalah jika engkau menghendaki.\""
            },
            {
                "number": 2261,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ أَبِي عَمَّارٍ عَنْ عَمْرِو بْنِ شُرَحْبِيلَ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقِيلَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ يَصُومُ الدَّهْرَ قَالَ وَدِدْتُ أَنَّهُ لَمْ يَطْعَمْ الدَّهْرَ قَالُوا فَثُلُثَيْهِ قَالَ أَكْثَرَ قَالُوا فَنِصْفَهُ قَالَ أَكْثَرَ ثُمَّ قَالَ أَلَا أُخْبِرُكُمْ بِمَا يُذْهِبُ وَحَرَ الصَّدْرِ صَوْمُ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Abu 'Ammar] dari ['Amru bin Syurahbil] dari [salah seorang sahabat Nabi shallallahu 'alaihi wasallam], ia berkata; Dikatakan kepada Nabi shallallahu 'alaihi wasallam bahwa ada seseorang berpuasa Dahr (puasa sepanjang waktu) \" Beliau bersabda: \"Aku senang jika ia puasa tidak selamanya.\" Mereka bertanya; \"Dua pertiganya?\" Beliau menjawab: \"Masih terlalu banyak.\" Mereka bertanya; \"Setengahnya.\" Beliau menjawab: \"Masih terlalu banyak.\" Kemudian beliau bersabda: \"Maukah kuberitahukan kepada kalian dengan sesuatu yang bisa menghilangkan kemarahan dada? Puasa tiga hari setiap bulan.\""
            },
            {
                "number": 2262,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي عَمَّارٍ عَنْ عَمْرِو بْنِ شُرَحْبِيلَ قَالَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ مَا تَقُولُ فِي رَجُلٍ صَامَ الدَّهْرَ كُلَّهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدِدْتُ أَنَّهُ لَمْ يَطْعَمْ الدَّهْرَ شَيْئًا قَالَ فَثُلُثَيْهِ قَالَ أَكْثَرَ قَالَ فَنِصْفَهُ قَالَ أَكْثَرَ قَالَ أَفَلَا أُخْبِرُكُمْ بِمَا يُذْهِبُ وَحَرَ الصَّدْرِ قَالُوا بَلَى قَالَ صِيَامُ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al 'Ala'] dia berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dia berkata; telah menceritakan kepada kami [Al A'masy] dari [Abu 'Ammar] dari ['Amru bin Syurahbil] dia berkata; Seseorang datang menemui Rasulullah shallallahu 'alaihi wasallam, lalu ia bertanya; \"Wahai Rasulullah shallallahu 'alaihi wasallam, bagaimana pendapat engkau tentang orang yang berpuasa Dahr (puasa setiap hari)?\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Malah aku senang jika ia tidak makan sedikitpun selamanya.\" Ia bertanya; \"Dua pertiganya?\" Beliau menjawab: \"Masih terlalu banyak.\" Ia bertanya; \"Setengahnya.\" Beliau menjawab: \"Masih terlalu banyak.\" Beliau bersabda: \"Maukah kuberitahukan kepada kalian dengan sesuatu yang bisa menghilangkan kemarahan dada?\" Mereka menjawab; \"Ya.\" Beliau bersabda: \"Puasa tiga hari setiap bulan.\""
            },
            {
                "number": 2263,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ غَيْلَانَ بْنِ جَرِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ الزِّمَّانِيِّ عَنْ أَبِي قَتَادَةَ قَالَ قَالَ عُمَرُيَا رَسُولَ اللَّهِ كَيْفَ بِمَنْ يَصُومُ الدَّهْرَ كُلَّهُ قَالَ لَا صَامَ وَلَا أَفْطَرَ أَوْ لَمْ يَصُمْ وَلَمْ يُفْطِرْ قَالَ يَا رَسُولَ اللَّهِ كَيْفَ بِمَنْ يَصُومُ يَوْمَيْنِ وَيُفْطِرُ يَوْمًا قَالَ أَوَ يُطِيقُ ذَلِكَ أَحَدٌ قَالَ فَكَيْفَ بِمَنْ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا قَالَ ذَلِكَ صَوْمُ دَاوُدَ عَلَيْهِ السَّلَام قَالَ فَكَيْفَ بِمَنْ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمَيْنِ قَالَ وَدِدْتُ أَنِّي أُطِيقُ ذَلِكَ قَالَ ثُمَّ قَالَ ثَلَاثٌ مِنْ كُلِّ شَهْرٍ وَرَمَضَانُ إِلَى رَمَضَانَ هَذَا صِيَامُ الدَّهْرِ كُلِّهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Hammad] dari [Ghailan bin Jarir] dari ['Abdullah bin Ma'bad Az Zamani] dari [Abu Qatadah] dia berkata; [Umar] bertanya; \"Wahai Rasulullah shallallahu 'alaihi wasallam, bagaimana dengan orang yang berpuasa Dahr (puasa sepanjang hari)?\" Beliau Nabi shallallahu 'alaihi wasallam menjawab: \"Ia -dianggap- tidak berpuasa dan tidak berbuka, atau belum berpuasa dan belum berbuka.\" Ia bertanya; \"Bagaimana dengan orang yang berpuasa dua hari dan berbuka sehari?\" Beliau menjawab: \"Apakah ada seorang yang mampu melakukan hal itu?\" Ia bertanya; \"Lalu bagaimana dengan orang yang berpuasa sehari dan berbuka sehari?\" Beliau menjawab: \"Itu adalah puasa Nabi Daud -alahissalam-.\" Ia bertanya; \"Bagaimana orang yang berpuasa sehari dan berbuka dua hari?\" Beliau menjawab: \"Aku senang jika aku mampu melakukan hal itu.\" Ia berkata; \"Kemudian beliau bersabda: \"Tiga hari setiap bulan dan ramadhan hingga ramadhan berikutnya, ini adalah -sama dengan- puasa Dahr.\""
            },
            {
                "number": 2264,
                "arab": "قَالَ وَفِيمَا قَرَأَ عَلَيْنَا أَحْمَدُ بْنُ مَنِيعٍ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا حُصَيْنٌ وَمُغِيرَةُ عَنْ مُجَاهِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ الصِّيَامِ صِيَامُ دَاوُدَ عَلَيْهِ السَّلَام كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا",
                "id": "Telah berkata -dan sebagaimana yang telah dibacakan kepada kami oleh [Ahmad bin Mani'] - dia berkata; telah menceritakan kepada kami [Husyaim] dia berkata; telah memberitakan kepada kami [Hushain] dan [Mughirah] dari [Mujahid] dari ['Abdullah bin 'Amr] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Puasa yang paling utama ialah pasa Nabi Daud -alaihissalam-, ia berpuasa sehari dan berbuka sehari.\""
            },
            {
                "number": 2265,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مُغِيرَةَ عَنْ مُجَاهِدٍ قَالَ قَالَ لِي عَبْدُ اللَّهِ بْنُ عَمْرٍوأَنْكَحَنِي أَبِي امْرَأَةً ذَاتَ حَسَبٍ فَكَانَ يَأْتِيهَا فَيَسْأَلُهَا عَنْ بَعْلِهَا فَقَالَتْ نِعْمَ الرَّجُلُ مِنْ رَجُلٍ لَمْ يَطَأْ لَنَا فِرَاشًا وَلَمْ يُفَتِّشْ لَنَا كَنَفًا مُنْذُ أَتَيْنَاهُ فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ائْتِنِي بِهِ فَأَتَيْتُهُ مَعَهُ فَقَالَ كَيْفَ تَصُومُ قُلْتُ كُلَّ يَوْمٍ قَالَ صُمْ مِنْ كُلِّ جُمُعَةٍ ثَلَاثَةَ أَيَّامٍ قُلْتُ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ قَالَ صُمْ يَوْمَيْنِ وَأَفْطِرْ يَوْمًا قَالَ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ قَالَ صُمْ أَفْضَلَ الصِّيَامِ صِيَامَ دَاوُدَ عَلَيْهِ السَّلَام صَوْمُ يَوْمٍ وَفِطْرُ يَوْمٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ma'mar] dia berkata; telah menceritakan kepada kami [Yahya bin Hammad] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Mughirah] dari [Mujahid] dia berkata; ['Abdullah bin 'Amr] berkata kepadaku; \"Bapakku menikahkan diriku dengan wanita yang memiliki keturunan yang mulia. Suatu kali bapakku menemuinya dan bertanya tentang suaminya. Wanita itu mengatakan; Sebaik laki-laki adalah yang tidak pernah menggauli kami di tempat tidur dan tidak pernah meneliti dada kami (mencumbui atau berdekatan) sejak kami datang kepadanya'.\" Lalu ia menuturkan hal itu kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Bawalah ia kemari.\" Lalu aku datang bersamanya, lalu beliau bertanya: \"Bagaimana cara engkau berpuasa?\" Aku menjawab; \"Setiap hari.\" Beliau bersabda: \"Berpuasalah setiap Jum'at tiga hari.\" Aku berkata; \" aku mampu dari itu!\" Beliau bersabda: \"Berpuasalah dua hari dan berbukalah sehari.\" Ia berkata; \" aku mampu lebih dari itu!\" Beliau bersabda: \"Berpuasalah dengan puasa yang paling utama, puasa Nabi Daud -alaihissalam-, berpuasa sehari dan berbuka sehari.\""
            },
            {
                "number": 2266,
                "arab": "أَخْبَرَنَا أَبُو حَصِينٍ عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ عَبْدِ اللَّهِ بْنِ يُونُسَ قَالَ حَدَّثَنَا عَبْثَرٌ قَالَ حَدَّثَنَا حُصَيْنٌ عَنْ مُجَاهِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَزَوَّجَنِي أَبِي امْرَأَةً فَجَاءَ يَزُورُهَا فَقَالَ كَيْفَ تَرَيْنَ بَعْلَكِ فَقَالَتْ نِعْمَ الرَّجُلُ مِنْ رَجُلٍ لَا يَنَامُ اللَّيْلَ وَلَا يُفْطِرُ النَّهَارَ فَوَقَعَ بِي وَقَالَ زَوَّجْتُكَ امْرَأَةً مِنْ الْمُسْلِمِينَ فَعَضَلْتَهَا قَالَ فَجَعَلْتُ لَا أَلْتَفِتُ إِلَى قَوْلِهِ مِمَّا أَرَى عِنْدِي مِنْ الْقُوَّةِ وَالِاجْتِهَادِ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَكِنِّي أَنَا أَقُومُ وَأَنَامُ وَأَصُومُ وَأُفْطِرُ فَقُمْ وَنَمْ وَصُمْ وَأَفْطِرْ قَالَ صُمْ مِنْ كُلِّ شَهْرٍ ثَلَاثَةَ أَيَّامٍ فَقُلْتُ أَنَا أَقْوَى مِنْ ذَلِكَ قَالَ صُمْ صَوْمَ دَاوُدَ عَلَيْهِ السَّلَام صُمْ يَوْمًا وَأَفْطِرْ يَوْمًا قُلْتُ أَنَا أَقْوَى مِنْ ذَلِكَ قَالَ اقْرَأْ الْقُرْآنَ فِي كُلِّ شَهْرٍ ثُمَّ انْتَهَى إِلَى خَمْسَ عَشْرَةَ وَأَنَا أَقُولُ أَنَا أَقْوَى مِنْ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Abu Hushain 'Abdullah bin Ahmad bin 'Abdullah bin Yunus] dia berkata; telah menceritakan kepada kami ['Abtsar] dia berkata; telah menceritakan kepada kami [Hushain] dari [Mujahid] dari ['Abdullah bin 'Amru] dia berkata; Bapakku menikahkanku dengan seorang wanita, lalu ia datang mengunjunginya (wanita itu), kemudian ia bertanya; \"Bagaimana pendapatmu tentang suamimu?\" Wanita itu menjawab; \"Sebaik-baik laki-laki adalah dari seorang laki-laki yang ia tidak pernah tidur malam dan tidak pernah berbuka di siang hari.\" Lalu ia berbicara dengan suara tinggi kepadaku. Ia berkata; \"Aku nikahkan kamu dengan seorang wanita dari kaum muslimin, namun kamu menyepelekan -tidak menggauli layaknya seorang istri-.\" Ia berkata; \"Kemudian aku tidak memperhatikan perkataannya, karena aku melihat kekuatan dan kesungguhan pada diriku. Lalu berita itu sampai kepada Nabi shallallahu 'alaihi wasallam, hingga beliau menegur seraya bersabda: \"Tetapi aku bangun malam dan tidur, berpuasa dan berbuka, bangun malam dan tidurlah, berpuasa dan berbukalah.\" Beliau bersabda: \"Berpuasalah tiga hari setiap bulan.\" Aku berkata; \"Aku masih kuat -melakukan- lebih dari itu.\" Beliau bersabda: \"Berpuasalah seperti puasanya Nabi Daud -alaihis-salam-, berpuasalah sehari dan berbukalah sehari.\" Aku berkata; \"Aku masih kuat -melakukan- lebih dari itu!\" Beliau bersabda: \"Bacalah Al Qur'an setiap bulan.\" Kemudian selepas dari lima belas hari aku berkata; \"Aku masih kuat melakukan lebih dari itu.\""
            },
            {
                "number": 2267,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ قَالَ حَدَّثَنَا أَبُو إِسْمَعِيلَ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ أَنَّ أَبَا سَلَمَةَ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ قَالَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُجْرَتِي فَقَالَ أَلَمْ أُخْبَرْ أَنَّكَ تَقُومُ اللَّيْلَ وَتَصُومُ النَّهَارَ قَالَ بَلَى قَالَ فَلَا تَفْعَلَنَّ نَمْ وَقُمْ وَصُمْ وَأَفْطِرْ فَإِنَّ لِعَيْنِكَ عَلَيْكَ حَقًّا وَإِنَّ لِجَسَدِكَ عَلَيْكَ حَقًّا وَإِنَّ لِزَوْجَتِكَ عَلَيْكَ حَقًّا وَإِنَّ لِضَيْفِكَ عَلَيْكَ حَقًّا وَإِنَّ لِصَدِيقِكَ عَلَيْكَ حَقًّا وَإِنَّهُ عَسَى أَنْ يَطُولَ بِكَ عُمُرٌ وَإِنَّهُ حَسْبُكَ أَنْ تَصُومَ مِنْ كُلِّ شَهْرٍ ثَلَاثًا فَذَلِكَ صِيَامُ الدَّهْرِ كُلِّهِ وَالْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا قُلْتُ إِنِّي أَجِدُ قُوَّةً فَشَدَّدْتُ فَشُدِّدَ عَلَيَّ قَالَ صُمْ مِنْ كُلِّ جُمُعَةٍ ثَلَاثَةَ أَيَّامٍ قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ فَشَدَّدْتُ فَشُدِّدَ عَلَيَّ قَالَ صُمْ صَوْمَ نَبِيِّ اللَّهِ دَاوُدَ عَلَيْهِ السَّلَام قُلْتُ وَمَا كَانَ صَوْمُ دَاوُدَ قَالَ نِصْفُ الدَّهْرِ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Durusta] dia berkata; telah menceritakan kepada kami [Abu Isma'il] dia berkata; telah menceritakan kepada kami [Yahya bin Abu Katsir] bahwasanya [Abu Salamah] menceritakan kepadanya bahwasanya ['Abdullah] berkata; Rasulullah shallallahu 'alaihi wasallam masuk ke kamarku, lalu beliau bersabda: \"Aku memperoleh berita bahwa kamu bangun di malam hari dan berpuasa di siang hari, benar?\" Ia menjawab; \"Benar.\" Beliau bersabda: \"Janganlah sekali-kali kamu lakukan -hal itu-; namun tidur dan bangunlah, berpuasa dan berbukalah. Karena kedua matamu memiliki hak atas dirimu, tubuhmu memiliki hak atas dirimu, istrimu memiliki hak atas dirimu, tamumu memiliki hak atas dirimu dan temanmu memiliki hak atas dirimu. Sungguh, semoga umurmu akan panjang dan cukup bagimu berpuasa tiga hari dalam setiap bulan, itulah puasa Dahr dan suatu kebaikan akan dibalas dengan sepuluh kali lipatnya.\" Aku berkata; \"Sungguh aku masih kuat - melakukan lebih dari itu-?\" Aku bersikap keras dan beliau pun bersikap keras kepadaku. Beliau bersabda: \"Berpuasalah tiga hari setiap Jum'at.\" Aku berkata; \" aku masih kuat melakukan lebih banyak dari itu!\" Aku bersikap keras dan beliau pun bersikap keras kepadaku. Beliau bersabda: \"Berpuasalah seperti puasanya Nabi Daud -Alaihissalam-.\" Aku berkata; \"Bagaimana puasa Nabi Daud?\" Beliau bersabda: \"Itu sama artinya dengan puasa setengah jaman.\""
            },
            {
                "number": 2268,
                "arab": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ قَالَذُكِرَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ يَقُولُ لَأَقُومَنَّ اللَّيْلَ وَلَأَصُومَنَّ النَّهَارَ مَا عِشْتُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْتَ الَّذِي تَقُولُ ذَلِكَ فَقُلْتُ لَهُ قَدْ قُلْتُهُ يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنَّكَ لَا تَسْتَطِيعُ ذَلِكَ فَصُمْ وَأَفْطِرْ وَنَمْ وَقُمْ وَصُمْ مِنْ الشَّهْرِ ثَلَاثَةَ أَيَّامٍ فَإِنَّ الْحَسَنَةَ بِعَشْرِ أَمْثَالِهَا وَذَلِكَ مِثْلُ صِيَامِ الدَّهْرِ قُلْتُ فَإِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ قَالَ صُمْ يَوْمًا وَأَفْطِرْ يَوْمَيْنِ فَقُلْتُ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ يَا رَسُولَ اللَّهِ قَالَ فَصُمْ يَوْمًا وَأَفْطِرْ يَوْمًا وَذَلِكَ صِيَامُ دَاوُدَ وَهُوَ أَعْدَلُ الصِّيَامِ قُلْتُ فَإِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا أَفْضَلَ مِنْ ذَلِكَقَالَ عَبْدُ اللَّهِ بْنُ عَمْرٍو لَأَنْ أَكُونَ قَبِلْتُ الثَّلَاثَةَ الْأَيَّامَ الَّتِي قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَبُّ إِلَيَّ مِنْ أَهْلِي وَمَالِي",
                "id": "Telah mengabarkan kepada kami [Ar Rabi' bin Sulaiman] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku [Sa'id bin Al Musayyab] dan [Abu Salamah bin 'Abdurrahman] bahwasanya ['Abdullah bin 'Amr bin Al 'Ash] berkata; Diberitahukan kepada Nabi shallallahu 'alaihi wasallam bahwa ia berkata; \"Sungguh aku benar-benar akan bangun di malam hari -untuk beribadah- dan sungguh aku benar-benar akan berpuasa di siang hari selama aku masih hidup.\" beliau bersabda: 'Apakah kamu yang mengatakan hal itu? ' Aku katakan kepada beliau; 'Sungguh akulah yang telah mengatakannya, wahai Rasulullah shallallahu 'alaihi wasallam! ' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sungguh engkau tidak akan mampu melakukan hal itu, berpuasa dan berbukalah, tidur dan bangunlah dan berpuasalah tiga hari dalam sebulan, karena kebaikan akan dibalas dengan sepuluh kali lipatnya dan hal itu seperti berpuasa sepanjang masa.' Aku berkata; 'Sungguh aku masih mampu melakukan lebih dari itu, wahai Rasulullah shallallahu 'alaihi wasallam! ' Beliau bersabda: 'Berpuasalah sehari dan berbukalah dua hari.' Aku berkata; 'Sungguh aku mampu melakukan lebih dari itu, wahai Rasulullah shallallahu 'alaihi wasallam! ' Beliau bersabda: 'Berpuasalah sehari dan berbukalah sehari, itu adalah puasa Nabi Daud dan itu adalah puasa yang lebih adil.' 'Sungguh aku mampu melakukan lebih dari itu.' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidak ada yang lebih utama daripada itu.' Abdullah bin Amru berkata; 'Sungguh aku menerima tiga hari yang Rasulullah shallallahu 'alaihi wasallam sabdakan lebih aku cintai dari keluarga dan hartaku! '"
            },
            {
                "number": 2269,
                "arab": "أَخْبَرَنِي أَحْمَدُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ وَهُوَ ابْنُ سَلَمَةَ عَنْ ابْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالَدَخَلْتُ عَلَى عَبْدِ اللَّهِ بْنِ عَمْرٍو قُلْتُ أَيْ عَمِّ حَدِّثْنِي عَمَّا قَالَ لَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَا ابْنَ أَخِي إِنِّي قَدْ كُنْتُ أَجْمَعْتُ عَلَى أَنْ أَجْتَهِدَ اجْتِهَادًا شَدِيدًا حَتَّى قُلْتُ لَأَصُومَنَّ الدَّهْرَ وَلَأَقْرَأَنَّ الْقُرْآنَ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ فَسَمِعَ بِذَلِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَانِي حَتَّى دَخَلَ عَلَيَّ فِي دَارِي فَقَالَ بَلَغَنِي أَنَّكَ قُلْتَ لَأَصُومَنَّ الدَّهْرَ وَلَأَقْرَأَنَّ الْقُرْآنَ فَقُلْتُ قَدْ قُلْتُ ذَلِكَ يَا رَسُولَ اللَّهِ قَالَ فَلَا تَفْعَلْ صُمْ مِنْ كُلِّ شَهْرٍ ثَلَاثَةَ أَيَّامٍ قُلْتُ إِنِّي أَقْوَى عَلَى أَكْثَرَ مِنْ ذَلِكَ قَالَ فَصُمْ مِنْ الْجُمُعَةِ يَوْمَيْنِ الِاثْنَيْنِ وَالْخَمِيسَ قُلْتُ فَإِنِّي أَقْوَى عَلَى أَكْثَرَ مِنْ ذَلِكِ قَالَ فَصُمْ صِيَامَ دَاوُدَ عَلَيْهِ السَّلَام فَإِنَّهُ أَعْدَلُ الصِّيَامِ عِنْدَ اللَّهِ يَوْمًا صَائِمًا وَيَوْمًا مُفْطِرًا وَإِنَّهُ كَانَ إِذَا وَعَدَ لَمْ يُخْلِفْ وَإِذَا لَاقَى لَمْ يَفِرَّ",
                "id": "Telah mengabarkan kepadaku [Ahmad bin Bakkar] dia berkata; telah menceritakan kepada kami [Muhammad bin Salamah] dari [Ibnu Ishaq] dari [Muhammad bin Ibrahim] dari [Abu Salamah bin 'Abdurrahman] dia berkata; aku masuk menemui ['Abdullah bin 'Amru] aku berkata; \"Wahai pamanku ceritakan kepadaku apa yang telah Rasulullah shallallahu'alaihiwasallam sabdakan kepadamu! Dia menjawab; 'Wahai keponakanku, sungguh aku telah berniat untuk bersungguh-sungguh hingga aku mengatakan; Sungguh aku benar-benar akan berpuasa Dahr (sepanjang masa), dan sungguh aku akan membaca Al Qur'an setiap hari dan malam. Lalu Rasulullah Shallallahu 'Alahi Wa Sallam mendengar hal itu, kemudian beliau datang menemuiku di rumah dan berkata: 'Telah sampai kepadaku bahwa kamu mengatakan sungguh akan berpuasa sepanjang masa, dan membaca Al Qur'an. Aku katakan kepada beliau; 'Sungguh akulah yang telah mengatakannya, wahai Rasulullah shallallahu 'alaihi wasallam! ' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Jangan kamu lakukan!, berpuasalah tiga hari dalam setiap bulan.' Aku berkata; 'Sungguh aku masih mampu melakukan lebih dari itu.' Beliau bersabda: 'Berpuasalah dua hari dalam seminggu yaitu hari senin dan kamis.' Aku berkata; 'Sungguh aku mampu melakukan lebih dari itu! ' Beliau bersabda: 'Berpuasalah dengan puasa Nabi Daud dan itu adalah puasa yang lebih adil di sisi Allah, yaitu berpuasa sehari dan berbuka sehari, apabila berjanji tidak pernah mengingkari, dan apabila bertemu musuh tidak pernah lari.'"
            },
            {
                "number": 2270,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ زِيَادِ بْنِ فَيَّاضٍ سَمِعْتُ أَبَا عِيَاضٍ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ صُمْ يَوْمًا وَلَكَ أَجْرُ مَا بَقِيَ قَالَ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ قَالَ صُمْ يَوْمَيْنِ وَلَكَ أَجْرُ مَا بَقِيَ قَالَ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ قَالَ صُمْ ثَلَاثَةَ أَيَّامٍ وَلَكَ أَجْرُ مَا بَقِيَ قَالَ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ قَالَ صُمْ أَرْبَعَةَ أَيَّامٍ وَلَكَ أَجْرُ مَا بَقِيَ قَالَ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ قَالَ صُمْ أَفْضَلَ الصِّيَامِ عِنْدَ اللَّهِ صَوْمَ دَاوُدَ عَلَيْهِ السَّلَام كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah memberitakan kepada kami [Muhammad] dia berkata; telah memberitakan kepada kami [Syu'bah] dari [Ziyad bin Fayyadl]; aku mendengar [Abu 'Iyadl] menceritakan dari ['Abdullah bin 'Amru] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya; \"Berpuasalah sehari dan bagimu pahala hari yang tersisa.\" Dia berkata; ' aku masih mampu melakukan lebih dari itu! ' Beliau bersabda: 'Berpuasalah dua hari dan bagimu pahala yang tersisa.' Dia berkata; ' aku masih mampu melakukan lebih dari itu! ' Beliau bersabda: 'Berpuasalah tiga hari dan bagimu pahala yang tersisa.' Dia berkata; ' aku mampu melakukan lebih dari itu.' Beliau bersabda: 'Berpuasalah empat hari dan bagimu pahala hari yang tersisa.' Dia berkata; ' aku mampu melakukan lebih dari itu.' Beliau bersabda: 'Berpuasalah dengan berpuasa yang paling utama di sisi Allah; puasa Nabi Daud -alaihissalam-, ia berpuasa sehari dan berbuka sehari.'"
            },
            {
                "number": 2271,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ قَالَ حَدَّثَنَا أَبُو الْعَلَاءِ عَنْ مُطَرِّفٍ عَنْ ابْنِ أَبِي رَبِيعَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَذَكَرْتُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّوْمَ فَقَالَ صُمْ مِنْ كُلِّ عَشَرَةِ أَيَّامٍ يَوْمًا وَلَكَ أَجْرُ تِلْكَ التِّسْعَةِ فَقُلْتُ إِنِّي أَقْوَى مِنْ ذَلِكَ قَالَ صُمْ مِنْ كُلِّ تِسْعَةِ أَيَّامٍ يَوْمًا وَلَكَ أَجْرُ تِلْكَ الثَّمَانِيَةِ قُلْتُ إِنِّي أَقْوَى مَنْ ذَلِكَ قَالَ فَصُمْ مِنْ كُلِّ ثَمَانِيَةِ أَيَّامٍ يَوْمًا وَلَكَ أَجْرُ تِلْكَ السَّبْعَةِ قُلْتُ إِنِّي أَقْوَى مِنْ ذَلِكَ قَالَ فَلَمْ يَزَلْ حَتَّى قَالَ صُمْ يَوْمًا وَأَفْطِرْ يَوْمًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Al Mu'tamir] dari [bapaknya], dia berkata; telah menceritakan kepada kami [Abul 'Ala] dari [Mutharrif] dari [Ibnu Abu Rabi'ah] dari ['Abdullah bin 'Amru] dia berkata; Aku menyebutkan kepada Nabi shallallahu 'alaihi wasallam tentang puasa, lalu beliau bersabda: \"Dari sepuluh hari berpuasalah sehari dan bagimu pahala sembilan hari yang tersisa.\" Aku berkata; 'Aku mampu melakukan lebih dari itu.' Beliau bersabda: 'Dari sembilan hari berpuasalah sehari dan bagimu pahala delapan hari yang tersisa.' Aku berkata; 'aku mampu melakukan lebih dari itu.' Beliau bersabda: 'Dari delapan hari berpuasalah sehari dan bagimu pahala tujuh hari yang tersisa.' Aku berkata; 'aku mampu melakukan lebih dari itu.' Dia mengatakan, beliau tetap seperti hingga beliau bersabda: \"Berpuasalah sehari dan berbukalah sehari.\""
            },
            {
                "number": 2272,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَزِيدُ قَالَ حَدَّثَنَا حَمَّادٌ ح و أَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا عَبْدُ الْأَعْلَى قَالَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ شُعَيْبِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ أَبِيهِ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صُمْ يَوْمًا وَلَكَ أَجْرُ عَشَرَةِ فَقُلْتُ زِدْنِي فَقَالَ صُمْ يَوْمَيْنِ وَلَكَ أَجْرُ تِسْعَةٍ قُلْتُ زِدْنِي قَالَ صُمْ ثَلَاثَةَ أَيَّامٍ وَلَكَ أَجْرُ ثَمَانِيَةٍقَالَ ثَابِتٌ فَذَكَرْتُ ذَلِكَ لِمُطَرِّفٍ فَقَالَ مَا أُرَاهُ إِلَّا يَزْدَادُ فِي الْعَمَلِ وَيَنْقُصُ مِنْ الْأَجْرِ وَاللَّفْظُ لِمُحَمَّدٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isma'il bin Ibrahim] dia berkata; telah menceritakan kepada kami [Yazid] dia berkata; telah menceritakan kepada kami [Hammad]. Demikian juga telah diriwayatkan dari jalur yang lainnya, dan telah mengabarkan kepadaku [Zakaria bin Yahya] dia berkata; telah menceritakan kepada kami ['Abdul A'la] dia berkata; telah menceritakan kepada kami [Hammad] dari [Tsabit] dari [Syu'aib bin 'Abdullah bin 'Amru] dari [bapaknya], dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku; \"Berpuasalah sehari dan bagimu pahala sepuluh hari.\" Aku berkata; 'Tambahkanlah untukku.' beliau bersabda: 'Berpuasalah dua hari dan bagimu pahala sembilan hari yang tersisa.' Aku berkata; 'Berpuasalah tiga hari, dan bagimu pahala delapan hari.' Tsabit berkata; Lalu hal itu diberitahukan kepada Mutharrif, ia berkata; \"Tidaklah aku melihatnya kecuali amalan yang bertambah namun pahalanya berkurang.\" Dan lafadz ini pada Imam Muhammad."
            },
            {
                "number": 2273,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ عَنْ أَسْبَاطٍ عَنْ مُطَرِّفٍ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ أَبِي الْعَبَّاسِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ بَلَغَنِي أَنَّكَ تَقُومُ اللَّيْلَ وَتَصُومُ النَّهَارَ قُلْتُ يَا رَسُولَ اللَّهِ مَا أَرَدْتُ بِذَلِكَ إِلَّا الْخَيْرَ قَالَ لَا صَامَ مَنْ صَامَ الْأَبَدَ وَلَكِنْ أَدُلُّكَ عَلَى صَوْمِ الدَّهْرِ ثَلَاثَةُ أَيَّامٍ مِنْ الشَّهْرِ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ قَالَ صُمْ خَمْسَةَ أَيَّامٍ قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ قَالَ فَصُمْ عَشْرًا فَقُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ قَالَ صُمْ صَوْمَ دَاوُدَ عَلَيْهِ السَّلَام كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًاأَخْبَرَنَا عَلِيُّ بْنُ الْحُسَيْنِ قَالَ حَدَّثَنَا أُمَيَّةُ عَنْ شُعْبَةَ عَنْ حَبِيبٍ قَالَ حَدَّثَنِي أَبُو الْعَبَّاسِ وَكَانَ رَجُلًا مِنْ أَهْلِ الشَّامِ وَكَانَ شَاعِرًا وَكَانَ صَدُوقًا عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَاقَ الْحَدِيثَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Ubaid] dari [Asbath] dari [Mutharrif] dari [Habib bin Abu Tsabit] dari [Abul 'Abbas] dari ['Abdullah bin 'Amru] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Telah sampai berita kepadaku bahwa kamu bangun di malam hari -untuk beribadah- dan berpuasa di siang hari?\" Aku berkata; 'Wahai Rasulullah shallallahu 'alaihi wasallam, tidak ada yang kumaksud dari hal itu kecuali kebaikan! ' Beliau bersabda: 'Tidak -dianggap- berpuasa bagi orang yang berpuasa selamanya, tetapi aku tunjukkan kepadamu tentang puasa Dahr; yaitu tiga hari dalam sebulan.' Aku berkata; 'Wahai Rasulullah shallallahu 'alaihi wasallam, ' aku mampu melakukan lebih dari itu! ' Beliau bersabda: 'Berpuasalah lima hari.' Aku berkata; ' aku mampu melakukan lebih dari itu.' Beliau bersabda: 'Berpuasalah sepuluh hari.' Aku berkata; ' aku mampu melakukan lebih dari itu.' Beliau bersabda: 'Berpuasalah seperti puasa Nabi Daud -alaihissalam-, ia berpuasa sehari dan berbuka sehari.' Telah mengabarkan kepada kami [Ali bin Al Husain] ia berkata; telah menceritakan kepada kami [Umayyah] dari [Syu'bah] dari [Habib] ia berkata; telah menceritakan kepadaku [Abu Al Abbas] dia adalah salah satu penduduk Syam, ahli sya'ir, dan ia adalah orang yang terpercaya dari [Abdullah bin Amru] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku; -kemudian dia menyebutkan hadits di atas.-"
            },
            {
                "number": 2274,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي حَبِيبُ بْنُ أَبِي ثَابِتٍ قَالَ سَمِعْتُ أَبَا الْعَبَّاسِ هُوَ الشَّاعِرُ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَبْدَ اللَّهِ بْنَ عَمْرٍو إِنَّكَ تَصُومُ الدَّهْرَ وَتَقُومُ اللَّيْلَ وَإِنَّكَ إِذَا فَعَلْتَ ذَلِكَ هَجَمَتْ الْعَيْنُ وَنَفِهَتْ لَهُ النَّفْسُ لَا صَامَ مَنْ صَامَ الْأَبَدَ صَوْمُ الدَّهْرِ ثَلَاثَةُ أَيَّامٍ مِنْ الشَّهْرِ صَوْمُ الدَّهْرِ كُلِّهِ قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ قَالَ صُمْ صَوْمَ دَاوُدَ كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا وَلَا يَفِرُّ إِذَا لَاقَى",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] telah menceritakan kepada kami [Syu'bah] dia berkata; telah mengabarkan kepadaku [Habib bin Abu Tsabit] dia berkata; aku mendengar [Abul 'Abbas Asy Sya'ir] menceritakan dari ['Abdullah bin 'Amru] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Wahai Abdullah bin Amru, kamu berpuasa Dahr dan bangun di malam hari -untuk beribadah-. jika kamu melakukan hal itu, mata akan bertambah rusak dan jiwa akan lemah. Tidak -dianggap- berpuasa orang yang melakukan puasa abad (selamanya), puasa Dahr yaitu tiga hari dalam sebulan, hal itu sama dengan puasa Dahr seluruhnya.\" Aku berkata; ' aku mampu melakukan lebih dari itu.' Beliau bersabda: 'Berpuasalah seperti puasa Nabi Daud, ia berpuasa sehari dan berbuka sehari dan dia tidak lari jika berjumpa musuh.'"
            },
            {
                "number": 2275,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ أَبِي الْعَبَّاسِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَأْ الْقُرْآنَ فِي شَهْرٍ قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ فَلَمْ أَزَلْ أَطْلُبُ إِلَيْهِ حَتَّى قَالَ فِي خَمْسَةِ أَيَّامٍ وَقَالَ صُمْ ثَلَاثَةَ أَيَّامٍ مِنْ الشَّهْرِ قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكِ فَلَمْ أَزَلْ أَطْلُبُ إِلَيْهِ حَتَّى قَالَ صُمْ أَحَبَّ الصِّيَامِ إِلَى اللَّهِ عَزَّ وَجَلَّ صَوْمَ دَاوُدَ كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Muhammad] dia berkata; telah menceritakan kepada kami [Syu'bah] dari ['Amru bin Dinar] dari [Abul 'Abbas] dari ['Abdullah bin 'Amru] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bacalah Al Qur'an dalam sebulan.\" Aku berkata; ' aku mampu melakukan lebih dari itu.' Aku selalu meminta kepada beliau, hingga beliau bersabda setelah lima hari, beliau bersabda: 'Berpuasalah tiga hari dalam sebulan.' Aku meminta kepada beliau, hingga akhirnya beliau bersabda: 'Berpuasalah dengan puasa yang paling dicintai oleh Allah -Azza wa Jalla-; yaitu puasa Nabi Daud, ia berpuasa sehari dan berbuka sehari.'"
            },
            {
                "number": 2276,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ سَمِعْتُ عَطَاءً يَقُولُ إِنَّ أَبَا الْعَبَّاسِ الشَّاعِرَ أَخْبَرَهُ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ قَالَبَلَغَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنِّي أَصُومُ أَسْرُدُ الصَّوْمَ وَأُصَلِّي اللَّيْلَ فَأَرْسَلَ إِلَيْهِ وَإِمَّا لَقِيَهُ قَالَ أَلَمْ أُخْبَرْ أَنَّكَ تَصُومُ وَلَا تُفْطِرُ وَتُصَلِّي اللَّيْلَ فَلَا تَفْعَلْ فَإِنَّ لِعَيْنِكَ حَظًّا وَلِنَفْسِكَ حَظًّا وَلِأَهْلِكَ حَظًّا وَصُمْ وَأَفْطِرْ وَصَلِّ وَنَمْ وَصُمْ مِنْ كُلِّ عَشَرَةِ أَيَّامٍ يَوْمًا وَلَكَ أَجْرُ تِسْعَةٍ قَالَ إِنِّي أَقْوَى لِذَلِكَ يَا رَسُولَ اللَّهِ قَالَ صُمْ صِيَامَ دَاوُدَ إِذًا قَالَ وَكَيْفَ كَانَ صِيَامُ دَاوُدَ يَا نَبِيَّ اللَّهِ قَالَ كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا وَلَا يَفِرُّ إِذَا لَاقَى قَالَ وَمَنْ لِي بِهَذَا يَا نَبِيَّ اللَّهِ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al Hasan] dia berkata; telah menceritakan kepada kami [Hajjaj] dia berkata; [Ibnu Juraij] berkata; aku mendengar ['Atha] berkata; [Abul 'Abbas Asy Sya'ir] mengabarkan kepadanya bahwasanya ia mendengar ['Abdullah bin 'Amru bin Al 'Ash] berkata; \"Telah sampai berita kepada Nabi shallallahu 'alaihi wasallam bahwa aku berpuasa terus-menerus dan melakukan sholat malam.\" (Abbas assyair katakan), Beliau lantas mengutus seseorang untuk menemuinya -atau beliau bertemu dengannya-, dan bertanya: 'Aku peroleh kabar bahwa kamu berpuasa dan tidak berbuka serta melaksanakan sholat malam? Janganlah engkau lakukan, sungguh matamu memiliki bagian, jiwamu memiliki bagian dan keluargamu memiliki bagian; berpuasa dan berbukalah, sholat dan tidurlah, berpuasalah setiap sepuluh hari sekali dan bagimu pahala sembilan harinya.' Ia berkata; 'Sungguh aku mampu melakukan lebih dari itu, wahai Rasulullah shallallahu 'alaihi wasallam! ' Beliau bersabda: '-Jika begitu- berpuasalah seperti puasa Nabi Daud.' Ia bertanya; 'Bagaimana puasa Nabi Daud, wahai Nabi Allah? ' Beliau bersabda: 'Ia berpuasa sehari dan berbuka sehari dan tidak lari jika berjumpa dengan musuh.' Abdullah berkata; 'Siapakah aku dihadapan hal ini, wahai Nabi Allah? '"
            },
            {
                "number": 2277,
                "arab": "أَخْبَرَنَا زَكَرِيَّاءُ بْنُ يَحْيَى قَالَ حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ قَالَ أَنْبَأَنَا خَالِدٌ عَنْ خَالِدٍ وَهُوَ الْحَذَّاءُ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمَلِيحِ قَالَ دَخَلْتُ مَعَ أَبِيكَ زَيْدٍ عَلَى عَبْدِ اللَّهِ بْنِ عَمْرٍو فَحَدَّثَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذُكِرَ لَهُ صَوْمِي فَدَخَلَ عَلَيَّ فَأَلْقَيْتُ لَهُ وِسَادَةَ أَدَمٍ رَبْعَةً حَشْوُهَا لِيفٌ فَجَلَسَ عَلَى الْأَرْضِ وَصَارَتْ الْوِسَادَةُ فِيمَا بَيْنِي وَبَيْنَهُ قَالَ أَمَا يَكْفِيكَ مِنْ كُلِّ شَهْرٍ ثَلَاثَةُ أَيَّامٍ قُلْتُ يَا رَسُولَ اللَّهِ قَالَ خَمْسًا قُلْتُ يَا رَسُولَ اللَّهِ قَالَ سَبْعًا قُلْتُ يَا رَسُولَ اللَّهِ قَالَ تِسْعًا قُلْتُ يَا رَسُولَ اللَّهِ قَالَ إِحْدَى عَشْرَةَ قُلْتُ يَا رَسُولَ اللَّهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَوْمَ فَوْقَ صَوْمِ دَاوُدَ شَطْرَ الدَّهْرِ صِيَامُ يَوْمٍ وَفِطْرُ يَوْمٍ",
                "id": "Telah mengabarkan kepada kami [Zakaria bin Yahya] dia berkata; telah menceritakan kepada kami [Wahb bin Baqiyyah] dia berkata; telah memberitakan kepada kami [Khalid] dari [Khalid Al Hadza'] dari [Abu Qilabah] dari [Abu Al Malih] dia berkata; aku masuk bersama bapakmu yaitu Zaid menemui ['Abdullah bin 'Amru]. Lalu ia bercerita bahwa Rasulullah shallallahu 'alaihi wasallam telah diberitahu tentang puasaku. Lalu beliau masuk menemuiku, kemudian kuberikan bantal kulit yang berukuran sedang dan berisi sabut. Beliau duduk di atas tanah sedangkan bantal tersebut berada di antara diriku dan beliau. Beliau bersabda: \"Tidakkah cukup bagimu (berpuasa) tiga hari dalam sebulan?\" Aku berkata; 'Wahai Rasulullah shallallahu 'alaihi wasallam! ' Beliau bersabda: 'Lima hari? ' Aku berkata; 'Wahai Rasulullah shallallahu 'alaihi wasallam! ' Beliau bersabda: 'Tujuh hari.' Aku berkata; 'Wahai Rasulullah shallallahu 'alaihi wasallam! ' Beliau bersabda: 'Sembilan.' Aku berkata; 'Wahai Rasulullah shallallahu 'alaihi wasallam! ' Beliau bersabda: 'Sebelas.' Aku berkata: 'Wahai Rasulullah shallallahu 'alaihi wasallam! ' Nabi shallallahu 'alaihi wasallam bersabda: 'Tidak ada puasa -yang kebaikannya- melebihi puasa Nabi Daud, Itu dihitung setengah masa, berpuasa sehari dan berbuka sehari.'"
            },
            {
                "number": 2278,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنِي شُعْبَةُ عَنْ زِيَادِ بْنِ فَيَّاضٍ قَالَ سَمِعْتُ أَبَا عِيَاضٍ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ عَمْرٍوقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صُمْ مِنْ الشَّهْرِ يَوْمًا وَلَكَ أَجْرُ مَا بَقِيَ قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ قَالَ فَصُمْ يَوْمَيْنِ وَلَكَ أَجْرُ مَا بَقِيَ قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ قَالَ فَصُمْ ثَلَاثَةَ أَيَّامٍ وَلَكَ أَجْرُ مَا بَقِيَ قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ قَالَ صُمْ أَرْبَعَةَ أَيَّامٍ وَلَكَ أَجْرُ مَا بَقِيَ قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ الصَّوْمِ صَوْمُ دَاوُدَ كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al Hasan] dia berkata; telah menceritakan kepada kami [Hajjaj bin Muhammad] dia berkata; telah menceritakan kepadaku [Syu'bah] dari [Ziyad bin Fayyadl] dia berkata; Aku mendengar [Abu 'Iyadl] berkata; ['Abdullah bin 'Amru] berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: 'Berpuasalah sehari dalam sebulan, dan bagimu pahala hari-hari yang tersisa.' Aku berkata; ' aku masih kuat melakukan dari itu.' Beliau bersabda: 'Berpuasalah dua hari -dalam sebulan- dan bagimu pahala hari-hari yang tersisa.' Aku berkata; ' aku mampu melakukan lebih dari itu.' Beliau bersabda: 'Berpuasalah tiga hari, dan bagimu pahala hari yang tersisa.' Aku berkata; ' aku masih kuat lebih dari itu.' Beliau bersabda: 'Berpuasalah empat hari, dan bagimu pahala hari-hari yang tersisa.' Aku berkata; ' aku masih kuat lebih dari itu.' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Puasa yang paling utama adalah puasa Nabi Daud, ia berpuasa sehari dan berbuka sehari.'"
            },
            {
                "number": 2279,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي حَرْمَلَةَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي ذَرٍّ قَالَأَوْصَانِي حَبِيبِي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثَةٍ لَا أَدَعُهُنَّ إِنْ شَاءَ اللَّهُ تَعَالَى أَبَدًا أَوْصَانِي بِصَلَاةِ الضُّحَى وَبِالْوَتْرِ قَبْلَ النَّوْمِ وَبِصِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah menceritakan kepada kami [Isma'il] dia berkata; telah menceritakan kepada kami [Muhammad bin Abu Harmalah] dari ['Atha bin Yasar] dari [Abu Dzar] dia berkata; \"Kekasihku shallallahu 'alaihi wasallam berwasiat tiga hal kepadaku -insya Allah Ta'ala tidak akan ku tinggalkan selamanya-. Beliau berwasiat kepadaku agar melakukan sholat Dluha, sholat witir sebelum tidur dan puasa tiga hari setiap bulan.\""
            },
            {
                "number": 2280,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحَسَنِ قَالَ سَمِعْتُ أَبِي قَالَ أَنْبَأَنَا أَبُو حَمْزَةَ عَنْ عَاصِمٍ عَنْ الْأَسْوَدِ بْنِ هِلَالٍ عَنْ أَبِي هُرَيْرَةَ قَالَأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثٍ بِنَوْمٍ عَلَى وِتْرٍ وَالْغُسْلِ يَوْمَ الْجُمُعَةِ وَصَوْمِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Ali bin Al Hasan] dia berkata; aku mendengar [bapakku] berkata; telah memberitakan kepada kami [Abu Hamzah] dari ['Ashim] dari [Al Aswad bin Hilal] dari [Abu Hurairah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memerintahkanku dalam tiga hal: Tidur setelah melakukan sholat witir, mandi pada hari jum'at dan puasa tiga hari setiap bulan.\""
            },
            {
                "number": 2281,
                "arab": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا أَبُو كَامِلٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَاصِمِ بْنِ بَهْدَلَةَ عَنْ رَجُلٍ عَنْ الْأَسْوَدِ بْنِ هِلَالٍ عَنْ أَبِي هُرَيْرَةَ قَالَأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَكْعَتَيْ الضُّحَى وَأَنْ لَا أَنَامَ إِلَّا عَلَى وِتْرٍ وَصِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ",
                "id": "Telah mengabarkan kepada kami [Zakaria bin Yahya] dia berkata; telah menceritakan kepada kami [Abu Kamil] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari ['Ashim bin Bahdalah] dari [seorang laki-laki], dari [Al Aswad bin Hilal] dari [Abu Hurairah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memerintahkanku dalam tiga hal: Tidur setelah melakukan sholat witir, mandi pada hari jum'at dan puasa tiga hari setiap bulan.\""
            },
            {
                "number": 2282,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ عَاصِمٍ عَنْ الْأَسْوَدِ بْنِ هِلَالٍ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَوْمٍ عَلَى وَتْرٍ وَالْغُسْلِ يَوْمَ الْجُمُعَةِ وَصِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi']; telah menceritakan kepada kami [Abu An Nadhr]; telah menceritakan kepada kami [Abu Mu'awiyah] dari ['Ashim] dari [Al Aswad bin Hilal] dari [Abu Hurairah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memerintahkanku dalam tiga hal: Tidur setelah melakukan sholat witir, mandi pada hari jum'at dan puasa tiga hari setiap bulan.\""
            },
            {
                "number": 2283,
                "arab": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى قَالَ حَدَّثَنَا عَبْدُ الْأَعْلَى قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ أَبِي عُثْمَانَ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ شَهْرُ الصَّبْرِ وَثَلَاثَةُ أَيَّامٍ مِنْ كُلِّ شَهْرٍ صَوْمُ الدَّهْرِ",
                "id": "Telah mengabarkan kepada kami [Zakaria bin Yahya] dia berkata; telah menceritakan kepada kami ['Abdul A'la] dia berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Abu 'Utsman] bahwasanya [Abu Hurairah] berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bulan kesabaran (puasa ramadhan) dan -berpuasa- tiga hari dalam sebulan; -sama dengan- puasa Dahr.\""
            },
            {
                "number": 2284,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ الْحَسَنِ اللَّانِيُّ بِالْكُوفَةِ عَنْ عَبْدِ الرَّحِيمِ وَهُوَ ابْنُ سُلَيْمَانَ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ أَبِي عُثْمَانَ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ ثَلَاثَةَ أَيَّامٍ مِنْ الشَّهْرِ فَقَدْ صَامَ الدَّهْرَ كُلَّهُ ثُمَّ قَالَ صَدَقَ اللَّهُ فِي كِتَابِهِ{ مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا }",
                "id": "Telah mengabarkan kepada kami ['Ali bin Al Hasan Al Laniy] di Kufah, dari ['Abdurrahim bin Sulaiman] dari ['Ashim Al Ahwal] dari [Abu 'Utsman] dari [Abu Dzarr] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang berpuasa tiga hari setiap bulan, sungguh ia -sama dengan- telah berpuasa Dahr seluruhnya.\" Kemudian ia berkata; 'Maha benar Allah -terhadap apa yang ada- di dalam kitab-Nya, Barangsiapa membawa amal yang baik, baginya (pahala) sepuluh kali lipat amalnya.' (Qs. Al An'am 6: 160)."
            },
            {
                "number": 2285,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ قَالَ أَنْبَأَنَا حِبَّانُ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ عَاصِمٍ عَنْ أَبِي عُثْمَانَ عَنْ رَجُلٍ قَالَ أَبُو ذَرٍّسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ صَامَ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ فَقَدْ تَمَّ صَوْمُ الشَّهْرِ أَوْ فَلَهُ صَوْمُ الشَّهْرِ شَكَّ عَاصِمٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Hatim] dia berkata; telah memberitakan kepada kami [Hibban] dia berkata; telah memberitakan kepada kami ['Abdullah] dari ['Ashim] dari [Abu 'Utsman] dari [seorang laki-laki], dia berkata; [Abu Dzarr] berkata; \"Barangsiapa berpuasa tiga hari dalam setiap bulan, telah sempurna puasanya dalam sebulan, atau ia telah mendapatkan pahala puasa sebulan.\" Ashim merasa ragu."
            },
            {
                "number": 2286,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ أَنَّ مُطَرِّفًا حَدَّثَهُ أَنَّ عُثْمَانَ بْنَ أَبِي الْعَاصِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ صِيَامٌ حَسَنٌ ثَلَاثَةُ أَيَّامٍ مِنْ الشَّهْرِأَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى قَالَ أَنْبَأَنَا أَبُو مُصْعَبٍ عَنْ مُغِيرَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ قَالَ عُثْمَانُ بْنُ أَبِي الْعَاصِ نَحْوَهُ مُرْسَلٌ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari [Sa'id bin Abu Hind] bahwasanya [Mutharrif] menceritakan kepadanya, bahwasanya ['Utsman bin Abul 'Ash] berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Puasa yang baik adalah tiga hari dalam sebulan'.\" Telah mengabarkan kepada kami [Zakaria bin Yahya] dia berkata; telah memberitakan kepada kami [Abu Mush'ab] dari [Mughirah bin Abdurrahman] dari [Abdullah bin Sa'id bin Abu Hindun] dari [Muhammad bin Ishaq] dari [Sa'id bin Abu Hindun] berkata; [Utsman bin Abul Ash] seperti itu juga secara mursal."
            },
            {
                "number": 2287,
                "arab": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ شَرِيكٍ عَنْ الْحُرِّ بْنِ صَيَّاحٍ قَالَ سَمِعْتُ ابْنَ عُمَرَ يَقُولُكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ",
                "id": "Telah mengabarkan kepada kami [Yusuf bin Sa'id] dia berkata; telah menceritakan kepada kami [Hajjaj] dari [Syarik] dari [Al Hurr bin Shayyah] dia berkata; aku mendengar [Ibnu 'Umar] berkata; \"Nabi shallallahu 'alaihi wasallam berpuasa tiga hari setiap bulan.\""
            },
            {
                "number": 2288,
                "arab": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ قَالَ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ عَنْ شَرِيكٍ عَنْ الْحُرِّ بْنِ صَيَّاحٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَصُومُ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ يَوْمَ الِاثْنَيْنِ مِنْ أَوَّلِ الشَّهْرِ وَالْخَمِيسِ الَّذِي يَلِيهِ ثُمَّ الْخَمِيسِ الَّذِي يَلِيهِ",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin Muhammad Az Za'farani] dia berkata; telah menceritakan kepada kami [Sa'id bin Sulaiman] dari [Syarik] dari [Al Hurr bin Shayyah] dari [Ibnu 'Umar] bahwasanya Rasulullah shallallahu 'alaihi wasallam berpuasa tiga hari dalam sebulan; hari Senin di awal bulan, hari Kamis berikutnya, kemudian hari Kamis berikutnya lagi."
            },
            {
                "number": 2289,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ قَالَ حَدَّثَنَا خَلَفُ بْنُ تَمِيمٍ عَنْ زُهَيْرٍ عَنْ الْحُرِّ بْنِ الصَّيَّاحِ قَالَ سَمِعْتُ هُنَيْدَةَ الْخُزَاعِيَّ قَالَدَخَلْتُ عَلَى أُمِّ الْمُؤْمِنِينَ سَمِعْتُهَا تَقُولُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ مِنْ كُلِّ شَهْرٍ ثَلَاثَةَ أَيَّامٍ أَوَّلَ اثْنَيْنِ مِنْ الشَّهْرِ ثُمَّ الْخَمِيسَ ثُمَّ الْخَمِيسَ الَّذِي يَلِيهِ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Muhammad bin 'Ali] dia berkata; telah menceritakan kepada kami [Khalaf bin Tamim] dari [Zuhair] dari [Al Hurr bin Shayyah] dia berkata; aku mendengar [Hunaidah Al Khuza'i] berkata; aku masuk menemui [Ummul Mu'minin], dan aku mendengar ia berkata; \"Rasulullah shallallahu 'alaihi wasallam berpuasa tiga hari setiap bulan; hari Senin pertama dari bulan itu, kemudian hari Kamis, kemudian hari Kamis berikutnya.\""
            },
            {
                "number": 2290,
                "arab": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ أَبِي النَّضْرِ قَالَ حَدَّثَنِي أَبُو النَّضْرِ قَالَ حَدَّثَنَا أَبُو إِسْحَقَ الْأَشْجَعِيُّ كُوفِيٌّ عَنْ عَمْرِو بْنِ قَيْسٍ الْمُلَائِيِّ عَنْ الْحُرِّ بْنِ الصَّيَّاحِ عَنْ هُنَيْدَةَ بْنِ خَالِدٍ الْخُزَاعِيِّ عَنْ حَفْصَةَ قَالَتْأَرْبَعٌ لَمْ يَكُنْ يَدَعُهُنَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صِيَامَ عَاشُورَاءَ وَالْعَشْرَ وَثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَرَكْعَتَيْنِ قَبْلَ الْغَدَاةِ",
                "id": "Telah mengabarkan kepada kami [Abu Bakr bin Abu An Nadhr] dia berkata; telah menceritakan kepadaku [Abu An Nadhr] dia berkata; telah menceritakan kepada kami [Abu Ishaq Al Asyja'i Al Kufi] dari ['Amr bin Qais Al Mula'i] dari [Al Hurr bin Ash-Shayyah] dari [Hunaidah bin Khalid Al Khuza'i] dari [Hafshah] dia berkata; \"Empat hal yang tidak pernah ditinggalkan oleh Rasulullah shallallahu 'alaihi wasallam; puasa 'Asyura, puasa sepuluh hari, puasa tiga hari dalam setiap bulan dan dua raka'at sebelum Subuh.\""
            },
            {
                "number": 2291,
                "arab": "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى عَنْ أَبِي نُعَيْمٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْحُرِّ بْنِ الصَّيَّاحِ عَنْ هُنَيْدَةَ بْنِ خَالِدٍ عَنْ امْرَأَتِهِ عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَصُومُ تِسْعًا مِنْ ذِي الْحِجَّةِ وَيَوْمَ عَاشُورَاءَ وَثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ أَوَّلَ اثْنَيْنِ مِنْ الشَّهْرِ وَخَمِيسَيْنِ",
                "id": "Telah mengabarkan kepadaku [Ahmad bin Yahya] dari [Abu Nu'aim] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Al Hurr bin Ash-Shayyah] dari [Hunaidah bin Khalid] dari [istrinya], dari sebagian istri Nabi shallallahu 'alaihi wasallam bahwa Rasulullah shallallahu 'alaihi wasallam berpuasa sembilan hari dari bulan Dzulhijjah, hari 'Asyura dan tiga hari dalam setiap bulan, yaitu hari Senin pertama dari bulan itu dan dua hari kamis (berikutnya)."
            },
            {
                "number": 2292,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُثْمَانَ بْنِ أَبِي صَفْوَانَ الثَّقَفِيُّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْحُرِّ بْنِ الصَّيَّاحِ عَنْ هُنَيْدَةَ بْنِ خَالِدٍ عَنْ امْرَأَتِهِ عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ الْعَشْرَ وَثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ الِاثْنَيْنِ وَالْخَمِيسَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Utsman bin Abu Shafwan Ats-Tsaqafi] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Al Hurr bin Ash-Shayyah] dari [Hunaidah bin Khalid] dari [istrinya], dari [sebagian istri] Nabi shallallahu 'alaihi wasallam, mereka berkata; \"Nabi shallallahu 'alaihi wasallam berpuasa sepuluh hari dan tiga hari dalam setiap bulan, yaitu hari Senin dan Kamis.\""
            },
            {
                "number": 2293,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ عَنْ هُنَيْدَةَ الْخُزَاعِيِّ عَنْ أُمِّهِ عَنْ أُمِّ سَلَمَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُ بِصِيَامِ ثَلَاثَةِ أَيَّامٍ أَوَّلِ خَمِيسٍ وَالِاثْنَيْنِ وَالِاثْنَيْنِ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Sa'id Al Jauhari] dia berkata; telah menceritakan kepada kami [Muhammad bin Fudhail] dari [Al Hasan bin 'Abdullah] dari [Hunaidah Al Khuza'i] dari [ibunya] dari [Ummu Salamah] dia berkata; Rasulullah shallallahu 'alaihi wasallam menyuruh berpuasa tiga hari yaitu Kamis pertama kemudian hari Senin dan hari Senin berikutnya."
            },
            {
                "number": 2294,
                "arab": "أَخْبَرَنَا مَخْلَدُ بْنُ الْحَسَنِ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ أَبِي إِسْحَقَ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صِيَامُ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ صِيَامُ الدَّهْرِ وَأَيَّامُ الْبِيضِ صَبِيحَةَ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ",
                "id": "Telah mengabarkan kepada kami [Makhlad bin Al Hasan] dia berkata; telah menceritakan kepada kami ['ubaidhullah] dari [Zaid bin Abu Unaisah] dari [Abu Ishaq] dari [Jarir bin 'Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Puasa tiga hari setiap bulan adalah puasa Dahr dan puasa hari-hari Bidh (putih cerah karena sinar rembulan), adalah waktu pagi tanggal tiga belas, empat belas dan lima belas.\""
            },
            {
                "number": 2295,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا حَبَّانُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ أَبِي هُرَيْرَةَ قَالَجَاءَ أَعْرَابِيٌّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَرْنَبٍ قَدْ شَوَاهَا فَوَضَعَهَا بَيْنَ يَدَيْهِ فَأَمْسَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَأْكُلْ وَأَمَرَ الْقَوْمَ أَنْ يَأْكُلُوا وَأَمْسَكَ الْأَعْرَابِيُّ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يَمْنَعُكَ أَنْ تَأْكُلَ قَالَ إِنِّي صَائِمٌ ثَلَاثَةَ أَيَّامٍ مِنْ الشَّهْرِ قَالَ إِنْ كُنْتَ صَائِمًا فَصُمْ الْغُرَّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ma'mar] dia berkata; telah menceritakan kepada kami [Habban] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari ['Abdul Malik bin 'Umair] dari [Musa bin Thalhah] dari [Abu Hurairah] dia berkata; \"Seorang Badui datang kepada Nabi Shallallahu 'Alahi Wa Sallam dengan membawa seekor kelinci yang di panggang, dia meletakkannya di hadapan Rasulullah Shallallahu 'Alahi Wa Sallam, namun Rasulullah Shallallahu 'Alahi Wa Sallam diam dan tidak memakannya, beliau menyuruh orang-orang untuk memakannya, demikian juga orang badui itu tidak memakannya. Kemudian Rasulullah Shallallahu 'Alahi Wa Sallam bersabda kepadanya: 'Apa yang melarang kamu untuk memakannya? Dia menjdawab; 'Aku sedang berpuasa tiga hari dalam sebulan.' Beliau bersabda: 'Apabila kamu berpuasa berpuasalah pada hari - hari Bidl (tanggal 13, 14, 15)."
            },
            {
                "number": 2296,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى عَنْ فِطْرٍ عَنْ يَحْيَى بْنِ سَامٍ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ أَبِي ذَرٍّ قَالَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَصُومَ مِنْ الشَّهْرِ ثَلَاثَةَ أَيَّامٍ الْبِيضَ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul 'Aziz] dia berkata; telah memberitakan kepada kami [Al Fudhail bin Musa] dari [Fithr] dari [Yahya bin Sam] dari [Musa bin Thalhah] dari [Abu Dzarr] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami agar berpuasa tiga hari Bidh dalam sebulan; yaitu -tanggal- tiga belas, empat belas dan lima belas.\""
            },
            {
                "number": 2297,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْأَعْمَشِ قَالَ سَمِعْتُ يَحْيَى بْنَ سَامٍ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ أَبِي ذَرٍّ قَالَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَصُومَ مِنْ الشَّهْرِ ثَلَاثَةَ أَيَّامٍ الْبِيضَ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Yazid] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Al A'masy] dia berkata; aku mendengar [Yahya bin Sam] dari [Musa bin Thalhah] dari [Abu Dzarr] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami agar berpuasa tiga hari Bidl dalam sebulan; yaitu -tanggal- tiga belas, empat belas dan lima belas.\""
            },
            {
                "number": 2298,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْأَعْمَشِ قَالَ سَمِعْتُ يَحْيَى بْنَ سَامٍ عَنْ مُوسَى بْنِ طَلْحَةَ قَالَسَمِعْتُ أَبَا ذَرٍّ بِالرَّبَذَةِ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صُمْتَ شَيْئًا مِنْ الشَّهْرِ فَصُمْ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Yazid] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Al A'masy] dia berkata; aku mendengar [Yahya bin Sam] dari [Musa bin Thalhah] dia berkata; aku mendengar [Abu Dzarr] di Ar Rabdzah berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: 'Jika engkau ingin berpuasa beberapa dalam sebulan, berpuasalah -tanggal- tiga belas, empat belas dan lima belas'.\""
            },
            {
                "number": 2299,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ عَنْ سُفْيَانَ عَنْ بَيَانِ بْنِ بِشْرٍ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ ابْنِ الْحَوْتَكِيَّةِ عَنْ أَبِي ذَرٍّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ عَلَيْكَ بِصِيَامِ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا خَطَأٌ لَيْسَ مِنْ حَدِيثِ بَيَانٍ وَلَعَلَّ سُفْيَانَ قَالَ حَدَّثَنَا اثْنَانِ فَسَقَطَ الْأَلِفُ فَصَارَ بَيَانٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dari [Sufyan] dari [Bayan bin Bisyr] dari [Musa bin Thalhah] dari [Ibnul Hautakiyyah] dari [Abu Dzarr] bahwa Nabi shallallahu 'alaihi wasallam bersabda kepada seseorang: \"Hendaklah kamu berpuasa -tanggal- tiga belas, empat belas dan lima belas.\" Abu Abdurrahman berkata; (Sanad) ini salah, Hadits ini bukan dari Bayan, Mungkin Sufyan berkata; Telah menceritakan kepada kami (dua orang), namun Alifnya hilang, menjadi Bayan."
            },
            {
                "number": 2300,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا رَجُلَانِ مُحَمَّدٌ وَحَكِيمٌ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ ابْنِ الْحَوْتَكِيَّةِ عَنْ أَبِي ذَرٍّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ رَجُلًا بِصِيَامِ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Sufyan] dia berkata; telah menceritakan kepada kami dua orang laki-laki - [Muhammad] dan [Hakim] - dari [Musa bin Thalhah] dari [Ibnul Hautakiyyah] dari [Abu Dzarr] bahwa Nabi shallallahu 'alaihi wasallam memerintahkan seseorang agar berpuasa -tanggal- tiga belas, empat belas dan lima belas.\""
            },
            {
                "number": 2301,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ عَنْ بَكْرٍ عَنْ عِيسَى عَنْ مُحَمَّدٍ عَنْ الْحَكَمِ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ ابْنِ الْحَوْتَكِيَّةِ قَالَ قَالَ أَبِيجَاءَ أَعْرَابِيٌّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ أَرْنَبٌ قَدْ شَوَاهَا وَخُبْزٌ فَوَضَعَهَا بَيْنَ يَدَيْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ إِنِّي وَجَدْتُهَا تَدْمَى فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَصْحَابِهِ لَا يَضُرُّ كُلُوا وَقَالَ لِلْأَعْرَابِيِّ كُلْ قَالَ إِنِّي صَائِمٌ قَالَ صَوْمُ مَاذَا قَالَ صَوْمُ ثَلَاثَةِ أَيَّامٍ مِنْ الشَّهْرِ قَالَ إِنْ كُنْتَ صَائِمًا فَعَلَيْكَ بِالْغُرِّ الْبِيضِ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَقَالَ أَبُو عَبْد الرَّحْمَنِ الصَّوَابُ عَنْ أَبِي ذَرٍّ وَيُشْبِهُ أَنْ يَكُونَ وَقَعَ مِنْ الْكُتَّابِ ذَرٌّ فَقِيلَ أَبِي",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Utsman bin Hakim] dari [Bakr] dari ['Isa] dari [Muhammad] dari [Al Hakam] dari [Musa bin Thalhah] dari [Ibnul Hautakiyyah] dia berkata; [bapakku] berkata; \"Seorang Badui datang kepada Nabi Shallallahu 'Alahi Wa Sallam dengan membawa seekor kelinci yang telah di panggang dan roti, lalu dia meletakkannya di hadapan Rasulullah Shallallahu 'Alahi Wa Sallam sambil berkata; 'Aku mendapatkannya dalam keadaan berdarah, kemudian Rasulullah Shallallahu 'Alahi Wa Sallam bersabda kepada para sahabatnya, tidak mengapa, makanlah oleh kalian semua, juga beliau berkata kepada orang badui: 'makanlah' dia berkata; 'Aku sedang puasa.' Beliau bertanya: 'Puasa apa? ' dia menjawab; 'Puasa tiga hari dalam sebulan. Beliau bersabda: \"Apabila kamu berpuasa, berpuasalah pada hari-hari Bidl yaitu tanggal 13, 14, dan 15.\" Abu Abdurrahman berkata; 'Yang benar adalah dari Abu Dzar, sepertinya telah jatuh dari para juru tulis kalimat Dzar, menjadi (Bapakku)."
            },
            {
                "number": 2302,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَعْلَى عَنْ طَلْحَةَ بْنِ يَحْيَى عَنْ مُوسَى بْنِ طَلْحَةَ قَالَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَرْنَبٍ قَدْ شَوَاهَا رَجُلٌ فَلَمَّا قَدَّمَهَا إِلَيْهِ قَالَ يَا رَسُولَ اللَّهِ إِنِّي قَدْ رَأَيْتُ بِهَا دَمًا فَتَرَكَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَأْكُلْهَا وَقَالَ لِمَنْ عِنْدَهُ كُلُوا فَإِنِّي لَوْ اشْتَهَيْتُهَا أَكَلْتُهَا وَرَجُلٌ جَالِسٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ادْنُ فَكُلْ مَعَ الْقَوْمِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي صَائِمٌ قَالَ فَهَلَّا صُمْتَ الْبِيضَ قَالَ وَمَا هُنَّ قَالَ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isma'il bin Ibrahim] dia berkata; telah menceritakan kepada kami [Ya'la] dari [Thalhah bin Yahya] dari [Musa bin Thalhah] dia berkata; \"Nabi Shallallahu 'Alahi Wa Sallam diberi seekor kelinci yang di panggang oleh seseorang.\" Tatkala kelinci itu dihidangkan kepada beliau, orang yang membawanya tadi berkata; 'Aku melihat kelinci itu berdarah, Nabi pun tidak jadi memakannya, beliau berkata: 'Siapa saja yang mau makan, silahkan, jika aku berselera aku pun sudah memakannya. Diantara mereka ada seseorang yang duduk saja. Kemudian Nabi shallallahu 'alaihi wasallam berkata: 'Mendekatlah kamu dan makanlah bersama orang-orang! ' Dia berkata; 'Wahai Rasulullah shallallahu 'alaihi wasallam Aku sedang puasa'. Nabi shallallahu 'alaihi wasallam bersabda kepadanya: 'Kalau begitu berpuasalah pada hari - hari Bidl. Dia bertanya: Apakah hari-hari Bidl itu? Beliau menjawab: Tanggal 13, 14, dan 15.'"
            },
            {
                "number": 2303,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ قَالَ أَنْبَأَنَا أَنَسُ بْنُ سِيرِينَ عَنْ رَجُلٍ يُقَالُ لَهُ عَبْدُ الْمَلِكِ يُحَدِّثُ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ بِهَذِهِ الْأَيَّامِ الثَّلَاثِ الْبِيضِ وَيَقُولُ هُنَّ صِيَامُ الشَّهْرِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] dari [Syu'bah] dia berkata; telah memberitakan kepada kami [Anas bin Sirin] dari seorang lelaki yang bernama ['Abdul Malik] dia menceritakan dari [bapaknya] bahwa Rasulullah shallallahu 'alaihi wasallam telah menyuruh berpuasa pada tiga hari Bidl ini, dan beliau bersabda: 'Itu adalah puasa sebulan.'"
            },
            {
                "number": 2304,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ قَالَ حَدَّثَنَا حَبَّانُ قَالَ حَدَّثَنَا هَمَّامٌ قَالَ حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ قَالَ حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ قُدَامَةَ بْنِ مِلْحَانَ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا بِصَوْمِ أَيَّامِ اللَّيَالِي الْغُرِّ الْبِيضِ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ma'mar] dia berkata; telah menceritakan kepada kami [Habban] dia berkata; telah menceritakan kepada kami [Hammam] dia berkata; telah menceritakan kepada kami [Anas bin Sirin] dia berkata; telah menceritakan kepadaku ['Abdul Malik bin Qudamah bin Milhan] dari [bapaknya], dia berkata; bahwa Nabi shallallahu 'alaihi wasallam menyuruh kami berpuasa pada tiga hari Bidl. Yaitu tanggal 13, 14, 15."
            },
            {
                "number": 2305,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنِي سَيْفُ بْنُ عُبَيْدِ اللَّهِ مِنْ خِيَارِ الْخَلْقِ قَالَ حَدَّثَنَا الْأَسْوَدُ بْنُ شَيْبَانَ عَنْ أَبِي نَوْفَلِ بْنِ أَبِي عَقْرَبٍ عَنْ أَبِيهِ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّوْمِ فَقَالَ صُمْ يَوْمًا مِنْ الشَّهْرِ قُلْتُ يَا رَسُولَ اللَّهِ زِدْنِي زِدْنِي قَالَ تَقُولُ يَا رَسُولَ اللَّهِ زِدْنِي زِدْنِي يَوْمَيْنِ مِنْ كُلِّ شَهْرٍ قُلْتُ يَا رَسُولَ اللَّهِ زِدْنِي زِدْنِي إِنِّي أَجِدُنِي قَوِيًّا فَقَالَ زِدْنِي زِدْنِي أَجِدُنِي قَوِيًّا فَسَكَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى ظَنَنْتُ أَنَّهُ لَيَرُدُّنِي قَالَ صُمْ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dia berkata; telah menceritakan kepadaku [Saif bin 'ubaidhullah] dari orang yang ahlaknya baik, dia berkata; telah menceritakan kepada kami [Al Aswad bin Syaiban] dari [Abu Naufal bin Abu 'Aqrab] dari [bapaknya] dia berkata; Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang puasa? Lalu beliau menjawab: \"Puasalah sehari dalam sebulan.\" Aku berkata; 'Wahai Rasulullah shallallahu 'alaihi wasallam, tambahkanlah untukku, tambahkanlah untukku! ' Beliau bersabda: 'Kamu mengatakan, 'Wahai Rasulullah, tambahkanlah untukku, tambahkanlah untukku? ', Dua hari setiap bulan.' Aku berkata; 'Wahai Rasulullah, tambahkanlah untukku, tambahkanlah untukku, sungguh aku masih kuat.' Beliau bersabda: 'Kamu mengatakan tambahkanlah untukku, tambahkanlah untukku, sungguh aku masih kuat.' Lalu Rasulullah diam hingga aku mengira bahwa beliau menolak -permintaan- ku. Kemudian beliau bersabda: 'Berpuasalah tiga hari pada setiap bulan.'"
            },
            {
                "number": 2306,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَنْبَأَنَا الْأَسْوَدُ بْنُ شَيْبَانَ عَنْ أَبِي نَوْفَلِ بْنِ أَبِي عَقْرَبٍ عَنْ أَبِيهِأَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّوْمِ فَقَالَ صُمْ يَوْمًا مِنْ كُلِّ شَهْرٍ وَاسْتَزَادَهُ قَالَ بِأَبِي أَنْتَ وَأُمِّي أَجِدُنِي قَوِيًّا فَزَادَهُ قَالَ صُمْ يَوْمَيْنِ مِنْ كُلِّ شَهْرٍ فَقَالَ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ إِنِّي أَجِدُنِي قَوِيًّا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أَجِدُنِي قَوِيًّا إِنِّي أَجِدُنِي قَوِيًّا فَمَا كَادَ أَنْ يَزِيدَهُ فَلَمَّا أَلَحَّ عَلَيْهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صُمْ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ",
                "id": "Telah mengabarkan kepada kami ['Abdurrahman bin Muhammad bin Sallam] dia berkata; telah menceritakan kepada kami [Yazid bin Harun] dia berkata; telah memberitakan kepada kami [Al Aswad bin Syaiban] dari [Abu Naufal bin Abu 'Aqrab] dari [bapaknya], ia bertanya kepada Nabi shallallahu 'alaihi wasallam tentang puasa, beliau bersabda: \"Berpuasalah sehari setiap bulan.\" Namun ia minta tambah, seraya berkata; 'Bapak dan ibuku sebagai tebusannya, aku masih kuat -melakukan lebih dari itu-.' Lalu beliau menambahinya seraya bersabda: 'Berpuasalah dua hari setiap bulan.' ia berkata; 'Bapak dan ibuku sebagai tebusannya, wahai Rasulullah, sungguh aku masih kuat! ' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sungguh aku masih kuat, sungguh aku masih kuat.' Hampir saja beliau tidak menambahkan untuknya. Setelah ia mendesak terus, Rasulullah shallallahu 'alaihi wasallam bersabda: 'Berpuasalah tiga hari setiap bulan.'"
            },
            {
                "number": 2307,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَمَّارٍ الْمَوْصِلِيُّ عَنْ الْمُعَافَى عَنْ زَكَرِيَّا بْنِ إِسْحَقَ الْمَكِّيِّ قَالَ حَدَّثَنَا يَحْيَى بْنُ عَبْدِ اللَّهِ بْنِ صَيْفِىٍّ عَنْ أَبِي مَعْبَدٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِمُعَاذٍ حِينَ بَعَثَهُ إِلَى الْيَمَنِ إِنَّكَ تَأْتِي قَوْمًا أَهْلَ كِتَابٍ فَإِذَا جِئْتَهُمْ فَادْعُهُمْ إِلَى أَنْ يَشْهَدُوا أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ فَإِنْ هُمْ أَطَاعُوكَ بِذَلِكَ فَأَخْبِرْهُمْ أَنَّ اللَّهَ عَزَّ وَجَلَّ فَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي يَوْمٍ وَلَيْلَةٍ فَإِنْ هُمْ يَعْنِي أَطَاعُوكَ بِذَلِكَ فَأَخْبِرْهُمْ أَنَّ اللَّهَ عَزَّ وَجَلَّ فَرَضَ عَلَيْهِمْ صَدَقَةً تُؤْخَذُ مِنْ أَغْنِيَائِهِمْ فَتُرَدُّ عَلَى فُقَرَائِهِمْ فَإِنْ هُمْ أَطَاعُوكَ بِذَلِكَ فَاتَّقِ دَعْوَةَ الْمَظْلُومِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin 'Ammar Al Maushuli] dari [Al Mu'afa] dari [Zakariy bin Ishaq Al Makki] dia berkata; telah menceritakan kepada kami [Yahya bin 'Abdullah bin Shafiy] dari [Abu Ma'bad] dari [Ibnu 'Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada Mu'adz ketika beliau mengutusnya ke Yaman: \"Engkau akan menemui kaum ahli kitab. Jika engkau datang kepada mereka, serulah agar mereka bersaksi bahwa tiada ilah (sesembahan) yang berhak disembah kecuali Allah dan Muhammad adalah utusan Allah. Jika mereka menaati dalam hal itu, beritahukanlah kepada mereka bahwa Allah -Azza wa Jalla- telah mewajibkan atas mereka sholat lima waktu dalam sehari semalam. Jika mereka -artinya: menaatimu- dalam hal itu, beritahukanlah bahwa Allah -Azza wa Jalla- telah mewajibkan atas mereka sedekah yang diambil dari orang-orang kaya di antara mereka, lalu diberikan kepada orang-orang fakir di antara mereka. Jika mereka menaati dalam hal itu, takutlah terhadap doa orang yang dizhalimi.\""
            },
            {
                "number": 2308,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ بَهْزَ بْنَ حَكِيمٍ يُحَدِّثُ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقُلْتُ يَا نَبِيَّ اللَّهِ مَا أَتَيْتُكَ حَتَّى حَلَفْتُ أَكْثَرَ مِنْ عَدَدِهِنَّ لِأَصَابِعِ يَدَيْهِ أَنْ لَا آتِيَكَ وَلَا آتِيَ دِينَكَ وَإِنِّي كُنْتُ امْرَأً لَا أَعْقِلُ شَيْئًا إِلَّا مَا عَلَّمَنِي اللَّهُ عَزَّ وَجَلَّ وَرَسُولُهُ وَإِنِّي أَسْأَلُكَ بِوَحْيِ اللَّهِ بِمَا بَعَثَكَ رَبُّكَ إِلَيْنَا قَالَ بِالْإِسْلَامِ قُلْتُ وَمَا آيَاتُ الْإِسْلَامِ قَالَ أَنْ تَقُولَ أَسْلَمْتُ وَجْهِي إِلَى اللَّهِ وَتَخَلَّيْتُ وَتُقِيمَ الصَّلَاةَ وَتُؤْتِيَ الزَّكَاةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Mu'tamir] dia berkata; Aku mendengar [Bahz bin Hakim] menceritakan dari [bapaknya] dari [kakeknya], dia berkata; Aku berkata; \"Wahai Nabi Allah, tidaklah aku datang menemuimu hingga aku bersumpah lebih dari bilangan mereka (jari-jari tangannya), untuk tidak mendatangimu dan tidak memeluk agamamu. Sungguh, dahulu aku adalah seorang yang tidak mengetahui sedikit pun kecuali apa yang Allah -Azza wa Jalla- dan Rasul-Nya ajarkan kepadaku, dan sungguh aku bertanya kepadamu atas nama wahyu Allah, dengan apa Rabbmu mengutusmu kepada kami?\" Beliau menjawab: 'Dengan Islam.' Aku bertanya; 'Apakah tanda-tanda Islam? ' Beliau bersabda: 'Hendaklah engkau mengucapkan; 'Aku menyerahkan wajahku kepada Allah dan membuang semua bentuk sesembahan selain kepada-Nya', mendirikan sholat dan menunaikan zakat.'"
            },
            {
                "number": 2309,
                "arab": "أَخْبَرَنَا عِيسَى بْنُ مُسَاوِرٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبِ بْنِ شَابُورَ عَنْ مُعَاوِيَةَ بْنِ سَلَّامٍ عَنْ أَخِيهِ زَيْدِ بْنِ سَلَّامٍ أَنَّهُ أَخْبَرَهُ عَنْ جَدِّهِ أَبِي سَلَّامٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غُنْمٍ أَنَّ أَبَا مَالِكٍ الْأَشْعَرِيَّ حَدَّثَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِسْبَاغُ الْوُضُوءِ شَطْرُ الْإِيمَانِ وَالْحَمْدُ لِلَّهِ تَمْلَأُ الْمِيزَانَ وَالتَّسْبِيحُ وَالتَّكْبِيرُ يَمْلَأُ السَّمَوَاتِ وَالْأَرْضَ وَالصَّلَاةُ نُورٌ وَالزَّكَاةُ بُرْهَانٌ وَالصَّبْرُ ضِيَاءٌ وَالْقُرْآنُ حُجَّةٌ لَكَ أَوْ عَلَيْكَ",
                "id": "Telah mengabarkan kepada kami ['Isa bin Musawir] dia berkata; telah menceritakan kepada kami [Muhammad bin Syu'aib bin Syabur] dari [Mu'awiyah bin Sallam] dari saudaranya [Zaid bin Sallam] bahwasanya ia telah mengabarkan kepadanya, dari kakeknya [Abu Sallam] dari ['Abdurrahman bin Ghunam], [Abu Malik Al Asy'ari] menceritakan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Menyempurnakan wudlu adalah separuh dari iman, kalimat Alhamdulillah mengisi -penuh- timbangan, tasbih dan takbir mengisi -penuh- langit dan bumi, sholat adalah cahaya, zakat adalah bukti, kesabaran adalah cahaya dan Al Qur'an adalah hujjah yang membela atau justeru hujjah yang menuntut dirimu.\""
            },
            {
                "number": 2310,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ قَالَ أَنْبَأَنَا خَالِدٌ عَنْ ابْنِ أَبِي هِلَالٍ عَنْ نُعَيْمٍ الْمُجْمِرِ أَبِي عَبْدِ اللَّهِ قَالَ أَخْبَرَنِي صُهَيْبٌ أَنَّهُ سَمِعَ مِنْ أَبِي هُرَيْرَةَ وَمِنْ أَبِي سَعِيدٍ يَقُولَانِخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا فَقَالَ وَالَّذِي نَفْسِي بِيَدِهِ ثَلَاثَ مَرَّاتٍ ثُمَّ أَكَبَّ فَأَكَبَّ كُلُّ رَجُلٍ مِنَّا يَبْكِي لَا نَدْرِي عَلَى مَاذَا حَلَفَ ثُمَّ رَفَعَ رَأْسَهُ فِي وَجْهِهِ الْبُشْرَى فَكَانَتْ أَحَبَّ إِلَيْنَا مِنْ حُمْرِ النَّعَمِ ثُمَّ قَالَ مَا مِنْ عَبْدٍ يُصَلِّي الصَّلَوَاتِ الْخَمْسَ وَيَصُومُ رَمَضَانَ وَيُخْرِجُ الزَّكَاةَ وَيَجْتَنِبُ الْكَبَائِرَ السَّبْعَ إِلَّا فُتِّحَتْ لَهُ أَبْوَابُ الْجَنَّةِ فَقِيلَ لَهُ ادْخُلْ بِسَلَامٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin 'Abdul Hakim] dari [Syu'aib] dari [Al Laits] dia berkata; telah memberitakan kepada kami [Khalid] dari [Ibnu Abu Hilal] dari [Nu'aim Al Mujmir Abu 'Abdullah] dia berkata; telah mengabarkan kepadaku [Shuhaib] bahwasanya ia mendengar dari [Abu Hurairah] dan [Abu Sa'id] mereka berkata; Rasulullah shallallahu 'alaihi wasallam berkhutbah pada suatu hari, beliau bersabda: \"Demi jiwaku yang berada ditanganNya, \" sebanyak tiga kali, lalu beliau mengisak tangis, dan diantara kami pun mulai menangis, kami tidak mengetahui atas apa beliau bersumpah lalu beliau mengangkat kepalanya dan tampak di wajahnya kegembiraan, hal itu lebih kami sukai daripada unta merah (harta terbaik), kemudian beliau bersabda: 'Tidaklah seorang hamba melaksanakan sholat lima waktu, berpuasa ramadhan, mengeluarkan zakat dan ia menjauhi tujuh buah dosa besar kecuali akan dibukakan untuknya pintu-pintu surga dan dikatakan padanya masuklah dengan keselamatan.'"
            },
            {
                "number": 2311,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرٍ قَالَ حَدَّثَنَا أَبِي عَنْ شُعَيْبٍ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَنْفَقَ زَوْجَيْنِ مِنْ شَيْءٍ مِنْ الْأَشْيَاءِ فِي سَبِيلِ اللَّهِ دُعِيَ مِنْ أَبْوَابِ الْجَنَّةِ يَا عَبْدَ اللَّهِ هَذَا خَيْرٌ لَكَ وَلِلْجَنَّةِ أَبْوَابٌ فَمَنْ كَانَ مِنْ أَهْلِ الصَّلَاةِ دُعِيَ مِنْ بَابِ الصَّلَاةِ وَمَنْ كَانَ مِنْ أَهْلِ الْجِهَادِ دُعِيَ مِنْ بَابِ الْجِهَادِ وَمَنْ كَانَ مِنْ أَهْلِ الصَّدَقَةِ دُعِيَ مِنْ بَابِ الصَّدَقَةِ وَمَنْ كَانَ مِنْ أَهْلِ الصِّيَامِ دُعِيَ مِنْ بَابِ الرَّيَّانِ قَالَ أَبُو بَكْرٍ هَلْ عَلَى مَنْ يُدْعَى مِنْ تِلْكَ الْأَبْوَابِ مِنْ ضَرُورَةٍ فَهَلْ يُدْعَى مِنْهَا كُلِّهَا أَحَدٌ يَا رَسُولَ اللَّهِ قَالَ نَعَمْ وَإِنِّي أَرْجُو أَنْ تَكُونَ مِنْهُمْ يَعْنِي أَبَا بَكْرٍ",
                "id": "Telah mengabarkan kepadaku ['Amr bin 'Utsman bin Sa'id bin Katsir] dia berkata; [bapakku] telah menceritakan kepada kami dari [Syu'aib] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku [Humaid bin 'Abdurrahman] bahwasanya [Abu Hurairah] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang menafkahkan sesuatu yaang berpasang-pasangan di jalan Allah, akan dipanggil dari pintu-pintu surga, 'Wahai hamba Allah, ini lebih baik bagimu'. Dan surga memiliki pintu-pintu; barangsiapa yang termasuk rajin mengerjakan sholat, akan dipanggil dari pintu sholat; barangsiapa yang termasuk rajin jihad, akan dipanggil dari pintu jihad; barangsiapa yang termasuk rajin bersedekah, akan dipanggil dari pintu sedekah; dan barangsiapa yang termasuk rajin berpuasa, akan dipanggil dari pintu Ar-Rayyan.\" Abu Bakar Ash-Shidiq berkata; 'Jika seseorang dipanggil dari salah satu diantara pintu-pintu itu, itu sebuah kepastian (tidak aneh), namun apakah ada seseorang yang dipanggil dari semua pintu-pintu itu, Wahai Rasulullah? ' Beliau bersabda: 'Ya, dan aku berharap agar engkau termasuk di antara mereka.'"
            },
            {
                "number": 2312,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ فِي حَدِيثِهِ عَنْ أَبِي مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ الْمَعْرُورِ بْنِ سُوَيْدٍ عَنْ أَبِي ذَرٍّ قَالَجِئْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ جَالِسٌ فِي ظِلِّ الْكَعْبَةِ فَلَمَّا رَآنِي مُقْبِلًا قَالَ هُمْ الْأَخْسَرُونَ وَرَبِّ الْكَعْبَةِ فَقُلْتُ مَا لِي لَعَلِّي أُنْزِلَ فِيَّ شَيْءٌ قُلْتُ مَنْ هُمْ فِدَاكَ أَبِي وَأُمِّي قَالَ الْأَكْثَرُونَ أَمْوَالًا إِلَّا مَنْ قَالَ هَكَذَا وَهَكَذَا وَهَكَذَا حَتَّى بَيْنَ يَدَيْهِ وَعَنْ يَمِينِهِ وَعَنْ شِمَالِهِ ثُمَّ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَا يَمُوتُ رَجُلٌ فَيَدَعُ إِبِلًا أَوْ بَقَرًا لَمْ يُؤَدِّ زَكَاتَهَا إِلَّا جَاءَتْ يَوْمَ الْقِيَامَةِ أَعْظَمَ مَا كَانَتْ وَأَسْمَنَهُ تَطَؤُهُ بِأَخْفَافِهَا وَتَنْطَحُهُ بِقُرُونِهَا كُلَّمَا نَفِدَتْ أُخْرَاهَا أُعِيدَتْ أُولَاهَا حَتَّى يُقْضَى بَيْنَ النَّاسِ",
                "id": "Telah mengabarkan kepada kami [Hannad bin As Sari] dalam haditsnya dari [Abu Mu'awiyah] dari [Al A'masy] dari [Al Ma'rur bin Suwaid] dari [Abu Dzarr] dia berkata; Aku pernah datang menemui Nabi shallallahu 'alaihi wasallam dan beliau sedang duduk di bawah naungan Ka'bah. Setelah melihatku datang, beliau bersabda: \"Mereka adalah orang-orang yang merugi, demi Pemelihara Ka'bah.\" aku bertanya-tanya; 'Apa yang terjadi padaku? Barangkali telah diturunkan sesuatu tentang diriku! ' Aku bertanya; 'Siapakah mereka, sungguh bapak dan ibuku sebagai tebusannya? ' Beliau bersabda: 'Orang yang banyak hartanya, kecuali orang yang mengatakan begini, begini dan begini, hingga di hadapannya, samping kanan dan samping kirinya.' Kemudian beliau bersabda: 'Demi Dzat yang jiwaku berada di tangan-Nya. Tidaklah seorang meninggal, lalu ia meninggalkan unta atau sapi yang belum ditunaikan zakatnya, kecuali akan datang pada hari Kiamat lebih besar dan lebih gemuk dari sebelumnya, menginjakkan dengan tapak kakinya dan menyeruduknya dengan tanduknya. Setiap kali yang terakhir selesai, diulang lagi yang pertama, hingga diputuskan perkara di hadapan manusia.'"
            },
            {
                "number": 2313,
                "arab": "أَخْبَرَنَا مُجَاهِدُ بْنُ مُوسَى قَالَ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ جَامِعِ بْنِ أَبِي رَاشِدٍ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ رَجُلٍ لَهُ مَالٌ لَا يُؤَدِّي حَقَّ مَالِهِ إِلَّا جُعِلَ لَهُ طَوْقًا فِي عُنُقِهِ شُجَاعٌ أَقْرَعُ وَهُوَ يَفِرُّ مِنْهُ وَهُوَ يَتْبَعُهُ ثُمَّ قَرَأَ مِصْدَاقَهُ مِنْ كِتَابِ اللَّهِ عَزَّ وَجَلَّ{ مُحَمَّد بْن مَاجَةَ وَلَا تَحْسَبَنَّ مُحَمَّد بْن مَاجَةَ الَّذِينَ يَبْخَلُونَ بِمَا آتَاهُمْ اللَّهُ مِنْ فَضْلِهِ هُوَ خَيْرًا لَهُمْ بَلْ هُوَ شَرٌّ لَهُمْ سَيُطَوَّقُونَ مَا بَخِلُوا بِهِ يَوْمَ الْقِيَامَةِ }الْآيَةَ",
                "id": "Telah mengabarkan kepada kami [Mujahid bin Musa] dia berkata; telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Jami' bin Abu Rasyid] dari [Abu Wa'il] dari ['Abdullah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang memiliki harta yang ia tidak menunaikan hak hartanya, melainkan akan dijadikan untuknya ular botak sebagai kalung di lehernya, ia berlari terbirit-birit darinya namun ular tersebut terus mengikutinya.\" Kemudian beliau membaca pembenarannya dari Kitabullah -Azza wa Jalla-, 'Sekali-kali janganlah orang-orang yang bakhil dengan harta yang Allah berikan kepada mereka dari karunia-Nya menyangka bahwa kebakhilan baik bagi mereka. Sebenarnya kebakhilan itu adalah buruk bagi mereka. Harta yang mereka bakhilkan itu dikalungkan kelak di lehernya di hari kiamat...\". (QS. Ali Imraan 3: 180)"
            },
            {
                "number": 2314,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ أَبِي عَمْرٍو الْغُدَانِيِّ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَيُّمَا رَجُلٍ كَانَتْ لَهُ إِبِلٌ لَا يُعْطِي حَقَّهَا فِي نَجْدَتِهَا وَرِسْلِهَا قَالُوا يَا رَسُولَ اللَّهِ مَا نَجْدَتُهَا وَرِسْلُهَا قَالَ فِي عُسْرِهَا وَيُسْرِهَا فَإِنَّهَا تَأْتِي يَوْمَ الْقِيَامَةِ كَأَغَذِّ مَا كَانَتْ وَأَسْمَنِهِ وَآشَرِهِ يُبْطَحُ لَهَا بِقَاعٍ قَرْقَرٍ فَتَطَؤُهُ بِأَخْفَافِهَا إِذَا جَاءَتْ أُخْرَاهَا أُعِيدَتْ عَلَيْهِ أُولَاهَا فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ حَتَّى يُقْضَى بَيْنَ النَّاسِ فَيَرَى سَبِيلَهُ وَأَيُّمَا رَجُلٍ كَانَتْ لَهُ بَقَرٌ لَا يُعْطِي حَقَّهَا فِي نَجْدَتِهَا وَرِسْلِهَا فَإِنَّهَا تَأْتِي يَوْمَ الْقِيَامَةِ أَغَذَّ مَا كَانَتْ وَأَسْمَنَهُ وَآشَرَهُ يُبْطَحُ لَهَا بِقَاعٍ قَرْقَرٍ فَتَنْطَحُهُ كُلُّ ذَاتِ قَرْنٍ بِقَرْنِهَا وَتَطَؤُهُ كُلُّ ذَاتِ ظِلْفٍ بِظِلْفِهَا إِذَا جَاوَزَتْهُ أُخْرَاهَا أُعِيدَتْ عَلَيْهِ أُولَاهَا فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ حَتَّى يُقْضَى بَيْنَ النَّاسِ فَيَرَى سَبِيلَهُ وَأَيُّمَا رَجُلٍ كَانَتْ لَهُ غَنَمٌ لَا يُعْطِي حَقَّهَا فِي نَجْدَتِهَا وَرِسْلِهَا فَإِنَّهَا تَأْتِي يَوْمَ الْقِيَامَةِ كَأَغَذِّ مَا كَانَتْ وَأَكْثَرِهِ وَأَسْمَنِهِ وَآشَرِهِ ثُمَّ يُبْطَحُ لَهَا بِقَاعٍ قَرْقَرٍ فَتَطَؤُهُ كُلُّ ذَاتِ ظِلْفٍ بِظِلْفِهَا وَتَنْطَحُهُ كُلُّ ذَاتِ قَرْنٍ بِقَرْنِهَا لَيْسَ فِيهَا عَقْصَاءُ وَلَا عَضْبَاءُ إِذَا جَاوَزَتْهُ أُخْرَاهَا أُعِيدَتْ عَلَيْهِ أُولَاهَا فِي يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ حَتَّى يُقْضَى بَيْنَ النَّاسِ فَيَرَى سَبِيلَهُ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Yazid bin Zurai'] dia berkata; telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dia berkata; telah menceritakan kepada kami [Qatadah] dari [Abu 'Amru Al Ghudani] bahwasanya [Abu Hurairah] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapakah orangnya yang memiliki unta, ia tidak memberikan haknya saat najdah-nya dan rislah-nya?\" -Mereka bertanya; 'Wahai Rasulullah! Apa itu najdah dan rislah?\" Beliau menjawab: 'Saat sulitnya dan saat lapangnya.'- sungguh akan datang pada hari Kiamat, lebih cepat dari sebelumnya, lebih gemuk dan lebih runcing. Ia (si pemilik) ditelungkupkan di tempat yang luas, lalu diinjak dengan tapak kakinya. Jika yang terakhir telah datang gilirannya, diulang lagi mulai yang pertamanya, dalam sehari yang kadarnya lima puluh ribu tahun, hingga diputuskan perkara di hadapan manusia, lalu ia melihat jalannya. Siapakah orangnya yang memiliki sapi, ia tidak memberikan haknya saat najdahnya dan rislahnya, akan datang pada hari kiamat lebih cepat dari sebelumnya, lebih gemuk dan lebih runcing. Ia ditelungkupkan di tempat yang luas, lalu setiap yang memiliki tanduk menyeruduknya dengan tanduknya dan setiap yang memiliki kuku telapak kaki menginjaknya dengan kuku telapak kakinya. Jika yang terakhir telah melewatinya diulang lagi yang pertamanya dalam sehari yang kadarnya lima puluh ribu tahun, hingga diputuskan perkara di hadapan manusia, lalu ia melihat jalannya. Dan siapakah orang yang memiliki kambing, ia tidak memberikan haknya dalam najdah dan rislah, sungguh akan datang pada hari Kiamat lebih cepat dari sebelumnya, lebih banyak, lebih gemuk dan lebih runcing. Ia ditelungkupkan di tempat yang luas, lalu setiap yang memiliki kuku menginjaknya dengan kukunya dan setiap yang memiliki tanduk menyeruduknya dengan tanduknya. Tidak ada yang bengkok tanduknya dan tidak ada yang pecah. Jika yang terakhir telah melewatinya diulang lagi yang pertamanya dalam sehari yang kadarnya lima puluh ribu tahun, hingga diputuskan perkara di hadapan manusia, lalu ia melihat jalannya.'"
            },
            {
                "number": 2315,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَنْ أَبِي هُرَيْرَةَ قَالَلَمَّا تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاسْتُخْلِفَ أَبُو بَكْرٍ بَعْدَهُ وَكَفَرَ مَنْ كَفَرَ مِنْ الْعَرَبِ قَالَ عُمَرُ لِأَبِي بَكْرٍ كَيْفَ تُقَاتِلُ النَّاسَ وَقَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ فَمَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ إِلَّا بِحَقِّهِ وَحِسَابُهُ عَلَى اللَّهِ فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ لَأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلَاةِ وَالزَّكَاةِ فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ وَاللَّهِ لَوْ مَنَعُونِي عِقَالًا كَانُوا يُؤَدُّونَهُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَاتَلْتُهُمْ عَلَى مَنْعِهِقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ فَوَاللَّهِ مَا هُوَ إِلَّا أَنْ رَأَيْتُ اللَّهَ شَرَحَ صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ فَعَرَفْتُ أَنَّهُ الْحَقُّ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku ['ubaidhullah bin 'Abdullah bin 'Utbah bin Mas'ud] dari [Abu Hurairah] dia berkata; Setelah Rasulullah shallallahu 'alaihi wasallam wafat, lalu -kekhalifahan- sesudahnya digantikan oleh Abu Bakar, namun orang kafir dari bangsa Arab mengingkarinya. [Umar] berkata kepada Abu Bakar; \"Bagaimana caramu memerangi manusia, sedangkan Rasulullah shallallahu 'alaihi wasallam telah bersabda: 'Aku diperintahkan untuk memerangi manusia hingga mereka mengatakan, La Ilaaha Ilallah (tidak ada Ilah yang berhak disembah kecuali Allah) '. Barangsiapa yang mengatakan, 'La Ilaaha Ilallah', berarti ia telah memelihara harta dan jiwanya dariku kecuali dengan haknya dan hisabnya atas Allah'.' [Abu Bakar] -radliallahu 'anhu- berkata; 'Sungguh benar-benar aku akan perangi orang yang memisahkan antara sholat dan zakat. zakat adalah hak harta. Demi Allah, andaikata mereka menghalangiku untuk mengambil zakat unta yang dahulu mereka berikan kepada Rasulullah shallallahu 'alaihi wasallam, niscaya akan aku perangi mereka karena hal itu.' Umar -radliallahu 'anhu- berkata; 'Demi Allah, tidak ada hal lain kecuali aku melihat Allah telah melapangkan dada Abu Bakar untuk berperang, aku mengetahui bahwa hal itu adalah suatu kebenaran.'"
            },
            {
                "number": 2316,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ قَالَ حَدَّثَنِي أَبِي عَنْ جَدِّي قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي كُلِّ إِبِلٍ سَائِمَةٍ فِي كُلِّ أَرْبَعِينَ ابْنَةُ لَبُونٍ لَا يُفَرَّقُ إِبِلٌ عَنْ حِسَابِهَا مَنْ أَعْطَاهَا مُؤْتَجِرًا فَلَهُ أَجْرُهَا وَمَنْ أَبَى فَإِنَّا آخِذُوهَا وَشَطْرَ إِبِلِهِ عَزْمَةٌ مِنْ عَزَمَاتِ رَبِّنَا لَا يَحِلُّ لِآلِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهَا شَيْءٌ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dia berkata; Telah menceritakan kepada kami [Yahya] dia berkata; Telah menceritakan kepada kami [Bahz bin Hakim] dia berkata; [Bapakku] telah menceritakan kepadaku dari [kakekku], dia berkata; Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Pada setiap empat puluh ekor unta yang dilepas, (mencari makan sendiri), zakatnya satu ekor unta Ibnatu labun (unta yang umurnya memasuki tahun ketiga). Tidak boleh dipisahkan unta itu untuk mengurangi perhitungan zakat. Barangsiapa memberinya karena mengharap pahala, ia akan mendapat pahalanya. Barangsiapa menolak untuk mengeluarkannya, kami akan mengambilnya beserta setengah hartanya, karena keputusan Rabb kami. Tidak halal bagi keluarga Muhammad memakan harta (zakat) sedikitpun.\""
            },
            {
                "number": 2317,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي عَمْرُو بْنُ يَحْيَى ح و أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ عَنْ عَبْدِ الرَّحْمَنِ عَنْ سُفْيَانَ وَشُعْبَةَ وَمَالِكٍ عَنْ عَمْرِو بْنِ يَحْيَى عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ وَلَا فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ وَلَا فِيمَا دُونَ خَمْسَةِ أَوَاقٍ صَدَقَةٌ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dia berkata; Telah menceritakan kepada kami [Sufyan] dia berkata; Telah menceritakan kepadaku ['Amru bin Yahya], demikian juga diriwayatkan dari jalur lainnya, dan telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] dari ['Abdurrahman] dari [Sufyan] dan [Syu'bah] dan [Malik] dari ['Amru bin Yahya] dari [bapaknya] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada biji-bijian yang kurang dari lima wasaq, tidak ada zakat pada unta yang kurang dari lima dzaud (ekor) dan tidak ada zakat pada perak yang kurang dari lima uqiyah.\""
            },
            {
                "number": 2318,
                "arab": "أَخْبَرَنَا عِيسَى بْنُ حَمَّادٍ قَالَ أَنْبَأَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرِو بْنِ يَحْيَى بْنِ عُمَارَةَ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِيمَا دُونَ خَمْسَةِ ذَوْدٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوَاقٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ",
                "id": "Telah mengabarkan kepada kami ['Isa bin Hammad] dia berkata; Telah memberitakan kepada kami [Al Laits] dari [Yahya bin Sa'id] dari ['Amru bin Yahya bin 'Umarah] dari [bapaknya] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada unta yang kurang dari lima dzaud (ekor), tidak ada zakat pada perak yang kurang dari lima uqiyah dan tidak ada zakat pada biji-bijian yang kurang dari lima wasaq.\""
            },
            {
                "number": 2319,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا الْمُظَفَّرُ بْنُ مُدْرِكٍ أَبُو كَامِلٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ أَخَذْتُ هَذَا الْكِتَابَ مِنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَنَسِ بْنِ مَالِكٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ أَبَا بَكْرٍكَتَبَ لَهُمْ إِنَّ هَذِهِ فَرَائِضُ الصَّدَقَةِ الَّتِي فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمُسْلِمِينَ الَّتِي أَمَرَ اللَّهُ عَزَّ وَجَلَّ بِهَا رَسُولَهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَنْ سُئِلَهَا مِنْ الْمُسْلِمِينَ عَلَى وَجْهِهَا فَلْيُعْطِ وَمَنْ سُئِلَ فَوْقَ ذَلِكَ فَلَا يُعْطِ فِيمَا دُونَ خَمْسٍ وَعِشْرِينَ مِنْ الْإِبِلِ فِي كُلِّ خَمْسِ ذَوْدٍ شَاةٌ فَإِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ فَفِيهَا بِنْتُ مَخَاضٍ إِلَى خَمْسٍ وَثَلَاثِينَ فَإِنْ لَمْ تَكُنْ بِنْتُ مَخَاضٍ فَابْنُ لَبُونٍ ذَكَرٌ فَإِذَا بَلَغَتْ سِتًّا وَثَلَاثِينَ فَفِيهَا بِنْتُ لَبُونٍ إِلَى خَمْسٍ وَأَرْبَعِينَ فَإِذَا بَلَغَتْ سِتَّةً وَأَرْبَعِينَ فَفِيهَا حِقَّةٌ طَرُوقَةُ الْفَحْلِ إِلَى سِتِّينَ فَإِذَا بَلَغَتْ إِحْدَى وَسِتِّينَ فَفِيهَا جَذَعَةٌ إِلَى خَمْسٍ وَسَبْعِينَ فَإِذَا بَلَغَتْ سِتًّا وَسَبْعِينَ فَفِيهَا بِنْتَا لَبُونٍ إِلَى تِسْعِينَ فَإِذَا بَلَغَتْ إِحْدَى وَتِسْعِينَ فَفِيهَا حِقَّتَانِ طَرُوقَتَا الْفَحْلِ إِلَى عِشْرِينَ وَمِائَةٍ فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ فَفِي كُلِّ أَرْبَعِينَ بِنْتُ لَبُونٍ وَفِي كُلِّ خَمْسِينَ حِقَّةٌ فَإِذَا تَبَايَنَ أَسْنَانُ الْإِبِلِ فِي فَرَائِضِ الصَّدَقَاتِ فَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْجَذَعَةِ وَلَيْسَتْ عِنْدَهُ جَذَعَةٌ وَعِنْدَهُ حِقَّةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ الْحِقَّةُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنْ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ حِقَّةٌ وَعِنْدَهُ جَذَعَةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيُعْطِيهِ الْمُصَّدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ إِنْ اسْتَيْسَرَتَا لَهُ وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ وَعِنْدَهُ بِنْتُ لَبُونٍ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنْ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ ابْنَةِ لَبُونٍ وَلَيْسَتْ عِنْدَهُ إِلَّا حِقَّةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيُعْطِيهِ الْمُصَّدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ ابْنَةِ لَبُونٍ وَلَيْسَتْ عِنْدَهُ بِنْتُ لَبُونٍ وَعِنْدَهُ بِنْتُ مَخَاضٍ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنْ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمَا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ ابْنَةِ مَخَاضٍ وَلَيْسَ عِنْدَهُ إِلَّا ابْنُ لَبُونٍ ذَكَرٌ فَإِنَّهُ يُقْبَلُ مِنْهُ وَلَيْسَ مَعَهُ شَيْءٌ وَمَنْ لَمْ يَكُنْ عِنْدَهُ إِلَّا أَرْبَعٌ مِنْ الْإِبِلِ فَلَيْسَ فِيهَا شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا وَفِي صَدَقَةِ الْغَنَمِ فِي سَائِمَتِهَا إِذَا كَانَتْ أَرْبَعِينَ فَفِيهَا شَاةٌ إِلَى عِشْرِينَ وَمِائَةٍ فَإِذَا زَادَتْ وَاحِدَةً فَفِيهَا شَاتَانِ إِلَى مِائَتَيْنِ فَإِذَا زَادَتْ وَاحِدَةً فَفِيهَا ثَلَاثُ شِيَاهٍ إِلَى ثَلَاثِ مِائَةٍ فَإِذَا زَادَتْ فَفِي كُلِّ مِائَةٍ شَاةٌ وَلَا يُؤْخَذُ فِي الصَّدَقَةِ هَرِمَةٌ وَلَا ذَاتُ عَوَارٍ وَلَا تَيْسُ الْغَنَمِ إِلَّا أَنْ يَشَاءَ الْمُصَّدِّقُ وَلَا يُجْمَعُ بَيْنَ مُتَفَرِّقٍ وَلَا يُفَرَّقُ بَيْنَ مُجْتَمِعٍ خَشْيَةَ الصَّدَقَةِ وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ فَإِذَا كَانَتْ سَائِمَةُ الرَّجُلِ نَاقِصَةً مِنْ أَرْبَعِينَ شَاةً وَاحِدَةٌ فَلَيْسَ فِيهَا شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا وَفِي الرِّقَةِ رُبْعُ الْعُشْرِ فَإِنْ لَمْ تَكُنْ إِلَّا تِسْعِينَ وَمِائَةَ دِرْهَمٍ فَلَيْسَ فِيهَا شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Mubarak] dia berkata; Telah menceritakan kepada kami [Al Muzhaffar bin Mudrik Abu Kamil] dia berkata; Telah menceritakan kepada kami [Hammad bin Salamah] dia berkata; Aku mengambil kitab ini dari [Tsumamah bin 'Abdullah bin Anas bin Malik] dari [Anas bin Malik] bahwasanya [Abu Bakr] menulis untuk mereka; \" Ini adalah kewajiban zakat yang Rasulullah shallallahu 'alaihi wasallam wajibkan atas kaum muslimin, Allah -Azza wa Jalla- perintahkan Rasul-Nya shallallahu 'alaihi wasallam untuk menunaikannya. Barangsiapa di antara kaum muslimin dimintai zakat tersebut berdasarkan aturannya, hendaklah ia memberikannya; dan barangsiapa yang dimintai lebih dari itu, maka janganlah ia memberikannya. Unta yang kurang dari dua puluh lima ekor, pada setiap kelipatan lima ekor zakatnya satu ekor kambing. Jika mencapai dua puluh lima ekor hingga tiga puluh lima ekor unta, zakatnya seekor unta betina yang umurnya telah menginjak tahun kedua. Jika tidak ada, zakatnya seekor unta jantan yang umurnya telah menginjak tahun ketiga. Jika mencapai tiga puluh enam hingga empat puluh lima ekor unta, zakatnya seekor anak unta betina yang umurnya telah menginjak tahun ketiga. Jika telah mencapai empat puluh enam sampai enam puluh ekor unta, zakatnya seekor anak unta betina yang umurnya telah masuk tahun keempat dan bisa dikawini unta jantan. Jika telah mencapai enampuluh satu hingga tujuh puluh lima ekor unta, zakatnya seekor unta betina yang umurnya telah masuk tahun kelima. Jika mencapai tujuh puluh enam hingga sembilan puluh ekor unta, zakatnya dua ekor anak unta betina yang umurnya telah menginjak tahun kedua. Jika telah mencapai sembilan puluh satu hingga seratus dua puluh ekor unta, zakatnya dua ekor unta betina yang umurnya telah masuk tahun keempat dan dapat dikawini unta jantan. Jika telah melebihi seratus dua puluh ekor unta, maka setiap empat puluh ekor zakatnya seekor anak unta betina yang umurnya masuk tahun ketiga dan setiap lima puluh ekor, zakatnya seekor unta betina yang umurnya masuk tahun keempat. Jika umur unta-unta yang menjadi kewajiban zakat berbeda-beda, maka barangsiapa yang jumlah untanya telah mewajibkannya untuk mengeluarkan seekor unta betina yang umurnya masuk tahun kelima, padahal ia tidak memilikinya dan yang ia miliki adalah unta betina yang umurnya masuk tahun keempat, maka ia boleh mengeluarkan seekor anak unta yang umurnya masuk tahun keempat ditambah dua ekor kambing jika hal itu -dirasa- mudah baginya, atau ditambah dua puluh dirham. Barangsiapa yang jumlah untanya telah wajib mengeluarkan seekor unta betina yang umurnya masuk tahun keempat, padahal ia tidak memilikinya dan ia memiliki unta betina yang umurnya masuk tahun kelima, maka ia boleh mengeluarkan seekor anak unta yang umurnya masuk tahun kelima, dan petugas zakat memberikan kepadanya dua puluh dirham atau dua kambing jika hal itu -dirasa- mudah baginya. Barangsiapa yang jumlah untanya telah mewajibkannya mengeluarkan seekor unta betina yang umurnya masuk tahun keempat, padahal ia tidak memilikinya dan ia hanya memiliki unta betina yang umurnya masuk tahun ketiga, maka ia boleh mengeluarkan seekor anak unta yang umurnya masuk tahun ketiga ditambah dua ekor kambing, jika hal itu -dirasa- mudah baginya, atau ditambah dua puluh dirham. Barangsiapa yang jumlah untanya telah mewajibkannya mengeluarkan seekor unta betina yang umurnya masuk tahun ketiga, padahal ia tidak memilikinya dan ia memilikinya dan ia memiliki unta betina yang umurnya masuk tahun keempat, maka ia boleh mengeluarkan seekor anak unta yang umurnya masuk tahun keempat dan petugas zakat memberikan kepadanya dua puluh dirham atau dua ekor kambing. Barangsiapa yang jumlah untanya telah mewajibkannya mengeluarkan seekor unta betina yang umurnya masuk tahun ketiga, padahal ia tidak memilikinya dan ia hanya memiliki unta betina yang umurnya masuk tahun kedua, maka ia boleh mengeluarkan seekor unta yang umurnya masuk tahun kedua ditambah dua ekor kambing jika hal itu -dirasa- mudah baginya, atau ditambah dua puluh dirham. Barangsiapa yang jumlah untanya telah mewajibkannya mengeluarkan seekor unta betina yang umurnya masuk tahun kedua, padahal ia tidak memilikinya dan ia memiliki unta jantan yang umurnya masuk tahun ketiga, maka ia boleh mengeluarkan seekor anak unta jantan yang umurnya masuk tahun ketiga dan tidak perlu ditambah yang lain. Barangsiapa yang tidak memiliki unta kecuali hanya empat ekor, tidak wajib atasnya zakat kecuali bila pemiliknya menginginkan. Mengenai zakat kambing yang dilepas mencari makan sendiri, jika mencapai empat puluh ekor hingga seratus dua puluh ekor kambing, zakatnya satu ekor kambing. Jika lebih dari seratus dua puluh hingga dua ratus ekor kambing, zakatnya dua ekor kambing. Jika lebih dari dua ratus hingga tiga ratus ekor kambing, zakatnya tiga ekor kambing. Jika lebih dari tiga ratus ekor kambing, maka setiap seratus ekor zakatnya seekor kambing. Tidak boleh dikeluarkan untuk zakat hewan yang tua dan yang cacat dan tidak boleh dikeluarkan yang jantan kecuali jika pemiliknya menghendaki. Tidak boleh dikumpulkan antara hewan-hewan ternak yang terpisah dan tidak boleh dipisahkan antara hewan-hewan ternak yang terkumpul karena takut mengeluarkan zakat. Hewan ternak kumpulan dari dua orang, pada waktu zakat harus kembali dibagi rata antara keduanya. Jika kambing yang dilepas mencari makan sendiri kurang satu ekor dari empat puluh ekor, maka tidak ada zakatnya, kecuali jika pemiliknya menghendakinya. Tentang zakat perak, setiap dua ratus dirham zakatnya seperempat puluhnya (dua setengah persen). Jika hanya seratus sembilan puluh dirham, maka tidak ada zakatnya, kecuali jika pemiliknya menghendakinya.\""
            },
            {
                "number": 2320,
                "arab": "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ قَالَ حَدَّثَنَا شُعَيْبٌ قَالَ حَدَّثَنِي أَبُو الزِّنَادِ مِمَّا حَدَّثَهُ عَبْدُ الرَّحْمَنِ الْأَعْرَجُ مِمَّا ذَكَرَ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يُحَدِّثُ بِهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَأْتِي الْإِبِلُ عَلَى رَبِّهَا عَلَى خَيْرِ مَا كَانَتْ إِذَا هِيَ لَمْ يُعْطِ فِيهَا حَقَّهَا تَطَؤُهُ بِأَخْفَافِهَا وَتَأْتِي الْغَنَمُ عَلَى رَبِّهَا عَلَى خَيْرِ مَا كَانَتْ إِذَا لَمْ يُعْطِ فِيهَا حَقَّهَا تَطَؤُهُ بِأَظْلَافِهَا وَتَنْطَحُهُ بِقُرُونِهَا قَالَ وَمِنْ حَقِّهَا أَنْ تُحْلَبَ عَلَى الْمَاءِ أَلَا لَا يَأْتِيَنَّ أَحَدُكُمْ يَوْمَ الْقِيَامَةِ بِبَعِيرٍ يَحْمِلُهُ عَلَى رَقَبَتِهِ لَهُ رُغَاءٌ فَيَقُولُ يَا مُحَمَّدُ فَأَقُولُ لَا أَمْلِكُ لَكَ شَيْئًا قَدْ بَلَّغْتُ أَلَا لَا يَأْتِيَنَّ أَحَدُكُمْ يَوْمَ الْقِيَامَةِ بِشَاةٍ يَحْمِلُهَا عَلَى رَقَبَتِهِ لَهَا يُعَارٌ فَيَقُولُ يَا مُحَمَّدُ فَأَقُولُ لَا أَمْلِكُ لَكَ شَيْئًا قَدْ بَلَّغْتُ قَالَ وَيَكُونُ كَنْزُ أَحَدِهِمْ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ يَفِرُّ مِنْهُ صَاحِبُهُ وَيَطْلُبُهُ أَنَا كَنْزُكَ فَلَا يَزَالُ حَتَّى يُلْقِمَهُ أُصْبُعَهُ",
                "id": "Telah mengabarkan kepada kami ['Imran bin Bukair] dia berkata; Telah menceritakan kepada kami ['Ali bin 'Abbas] dia berkata; Telah menceritakan kepada kami [Syu'aib] dia berkata; Telah menceritakan kepadaku [Abu Az Zinad] dari apa-apa yang diceritakan oleh ['Abdurrahman Al A'raj] dari apa-apa yang disebutkan, bahwasanya ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Unta akan mendatangi pemiliknya -pada hari Kiamat- dengan kondisi yang lebih baik dari sebelumnya. Jika ia tidak memberikan haknya, unta itu menginjaknya dengan tapak kakinya dan kambing mendatangi pemiliknya dengan kondisi yang lebih baik dari sebelumnya. Jika dia tidak memberikan haknya, kambing itu menginjaknya dengan kuku-kuku telapak kakinya dan menyeruduknya dengan tanduknya, -Beliau bersabda: - Di antara haknya ialah agar ia dibawa ke tempat air. Ketahuilah, janganlah sekali-kali salah seorang di antara kalian datang pada hari Kiamat dengan membawa seekor unta yang dibawa di atas lehernya, unta itu memiliki suara keras, lalu ia berkata; 'Wahai Muhammad'. Maka kukatakan; 'Aku tidak memiliki suatu tanggungan pun untukmu, sungguh telah kusampaikan'. Ketahuilah, janganlah sekali-kali salah seorang di antara kalian datang pada hari Kiamat dengan membawa seekor kambing yang ia bawa di atas lehernya. Kambing itu memiliki suara keras, lalu ia berkata; 'Wahai Muhammad'. Maka kukatakan; 'Aku tidak memiliki suatu tanggungan pun untukmu, sungguh telah kusampaikan'. Beliau bersabda: 'Harta simpanan salah seorang di antara mereka (jika tidak dikeluarkan zakatnya), pada hari Kiamat adalah ular yang berkepala putih (karena banyak racunnya), pemiliknya lari darinya dan ular itu menuntutnya; 'Akulah harta simpananmu', hal tersebut terus seperti itu hingga ular itu menelan jari-jarinya.'"
            },
            {
                "number": 2321,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ بَهْزَ بْنَ حَكِيمٍ يُحَدِّثُ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي كُلِّ إِبِلٍ سَائِمَةٍ مِنْ كُلِّ أَرْبَعِينَ ابْنَةُ لَبُونٍ لَا تُفَرَّقُ إِبِلٌ عَنْ حِسَابِهَا مَنْ أَعْطَاهَا مُؤْتَجِرًا لَهُ أَجْرُهَا وَمَنْ مَنَعَهَا فَإِنَّا آخِذُوهَا وَشَطْرَ إِبِلِهِ عَزْمَةً مِنْ عَزَمَاتِ رَبِّنَا لَا يَحِلُّ لِآلِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهَا شَيْءٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin 'Abdul A'la] dia berkata; Telah menceritakan kepada kami [Mu'tamir] dia berkata; Aku mendengar [Bahaz bin Hakim] menceritakan dari [bapaknya] dari [kakeknya], dia berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Pada setiap unta yang dilepas mencari makan sendiri, setiap empat puluh ekor zakatnya satu ekor unta betina yang umurnya masuk tahun ketiga. Unta tidak boleh dipisahkan untuk mengurangi perhitungan zakat. Barangsiapa memberinya karena mengharap pahala, ia akan mendapat pahalanya. Barangsiapa menolak untuk mengeluarkannya, kami akan mengambilnya beserta setengah hartanya karena keputusan Rabb kami. Tidak halal bagi keluarga Muhammad shallallahu 'alaihi wasallam darinya sedikitpun.\""
            },
            {
                "number": 2322,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا مُفَضَّلٌ وَهُوَ ابْنُ مُهَلْهَلٍ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ مَسْرُوقٍ عَنْ مُعَاذٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَهُ إِلَى الْيَمَنِ وَأَمَرَهُ أَنْ يَأْخُذَ مِنْ كُلِّ حَالِمٍ دِينَارًا أَوْ عِدْلَهُ مَعَافِرَ وَمِنْ الْبَقَرِ مِنْ ثَلَاثِينَ تَبِيعًا أَوْ تَبِيعَةً وَمِنْ كُلِّ أَرْبَعِينَ مُسِنَّةً",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Rafi'] dia berkata; Telah menceritakan kepada kami [Yahya bin Adam] dia berkata; Telah menceritakan kepada kami [Mufadldlal bin Muhalhal] dari [Al A'masy] dari [Syaqiq] dari [Masruq] dari [Mu'adz] bahwa Rasulullah shallallahu 'alaihi wasallam mengutusnya ke negeri Yaman, dan memerintahkannya untuk mengambil (zakat) dari setiap orang yang telah baligh sebesar satu dinar, atau yang sebanding dengan nilai itu berupa kain dari Yaman, dan dari setiap tiga puluh ekor sapi -zakatnya- seekor sapi yang berumur satu tahun lebih yang jantan atau betina, dan setiap empat puluh ekor sapi -zakatnya- seekor sapi betina berumur dua tahun lebih."
            },
            {
                "number": 2323,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَعْلَى وَهُوَ ابْنُ عُبَيْدٍ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ مَسْرُوقٍ وَالْأَعْمَشُ عَنْ إِبْرَاهِيمَ قَالَا قَالَ مُعَاذٌبَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ فَأَمَرَنِي أَنْ آخُذَ مِنْ كُلِّ أَرْبَعِينَ بَقَرَةً ثَنِيَّةً وَمِنْ كُلِّ ثَلَاثِينَ تَبِيعًا وَمِنْ كُلِّ حَالِمٍ دِينَارًا أَوْ عِدْلَهُ مَعَافِرَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] dia berkata; Telah menceritakan kepada kami [Ya'la bin 'Ubaid] dia berkata; Telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] dari [Masruq] dan [Al A'masy] dari [Ibrahim] mereka berdua berkata; [Mu'adz] berkata; \"Rasulullah shallallahu 'alaihi wasallam mengutusku ke negeri Yaman, lalu beliau memerintahku untuk mengambil dari setiap empat puluh ekor sapi -zakatnya- seekor anak sapi betina berumur dua tahun lebih, dari setiap tiga puluh ekor sapi -zakatnya- seekor sapi jantan yang berumur setahun lebih, serta dari setiap orang yang baligh diambil (jizyah) satu dinar atau yang sebanding dengan nilai pakaian dari Yaman.\""
            },
            {
                "number": 2324,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ مَسْرُوقٍ عَنْ مُعَاذٍ قَالَلَمَّا بَعَثَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ أَمَرَهُ أَنْ يَأْخُذَ مِنْ كُلِّ ثَلَاثِينَ مِنْ الْبَقَرِ تَبِيعًا أَوْ تَبِيعَةً وَمِنْ كُلِّ أَرْبَعِينَ مُسِنَّةً وَمِنْ كُلِّ حَالِمٍ دِينَارًا أَوْ عِدْلَهُ مَعَافِرَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Harb] dia berkata; Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Ibrahim] dari [Masruq] dari [Mu'adz] dia berkata; \"Setelah Rasulullah shallallahu 'alaihi wasallam mengutusnya ke negeri Yaman, beliau memerintahnya untuk mengambil (zakat) dari setiap tiga puluh ekor sapi seekor anak sapi yang berumur setahun lebih yang jantan atau yang betina, dan setiap empat puluh ekor sapi, seekor sapi betina berumur dua tahun lebih serta dari setiap orang yang telah baligh diambil (jizyah) satu dinar atau yang sebanding dengan nilai pakaian dari Yaman.\""
            },
            {
                "number": 2325,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ الطُّوسِيُّ قَالَ حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ قَالَ حَدَّثَنِي سُلَيْمَانُ الْأَعْمَشُ عَنْ أَبِي وَائِلِ بْنِ سَلَمَةَ عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ بَعَثَنِي إِلَى الْيَمَنِ أَنْ لَا آخُذَ مِنْ الْبَقَرِ شَيْئًا حَتَّى تَبْلُغَ ثَلَاثِينَ فَإِذَا بَلَغَتْ ثَلَاثِينَ فَفِيهَا عِجْلٌ تَابِعٌ جَذَعٌ أَوْ جَذَعَةٌ حَتَّى تَبْلُغَ أَرْبَعِينَ فَإِذَا بَلَغَتْ أَرْبَعِينَ فَفِيهَا بَقَرَةٌ مُسِنَّةٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur Ath Thusi] dia berkata; Telah menceritakan kepada kami [Ya'qub] dia berkata; [Bapakku] telah menceritakan kepada kami dari [Ibnu Ishaq] dia berkata; Telah menceritakan kepadaku [Sulaiman Al A'masy] dari [Abu Wa'il bin Salamah] dari [Mu'adz bin Jabal] dia berkata; \"Ketika Rasulullah shallallahu 'alaihi wasallam mengutusku ke negeri Yaman, beliau menyuruhku untuk tidak mengambil (zakat) dari sapi sedikitpun hingga mencapai tiga puluh ekor. Jika sudah mencapai tiga puluh ekor, maka zakatnya seekor anak sapi yang berumur satu tahun lebih, baik yang jantan atau betina. Apabila mencapai empat puluh, maka zakatnya satu ekor sapi yang sudah berumur dua tahun lebih.\""
            },
            {
                "number": 2326,
                "arab": "أَخْبَرَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى عَنْ ابْنِ فُضَيْلٍ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ صَاحِبِ إِبِلٍ وَلَا بَقَرٍ وَلَا غَنَمٍ لَا يُؤَدِّي حَقَّهَا إِلَّا وُقِفَ لَهَا يَوْمَ الْقِيَامَةِ بِقَاعٍ قَرْقَرٍ تَطَؤُهُ ذَاتُ الْأَظْلَافِ بِأَظْلَافِهَا وَتَنْطَحُهُ ذَاتُ الْقُرُونِ بِقُرُونِهَا لَيْسَ فِيهَا يَوْمَئِذٍ جَمَّاءُ وَلَا مَكْسُورَةُ الْقَرْنِ قُلْنَا يَا رَسُولَ اللَّهِ وَمَاذَا حَقُّهَا قَالَ إِطْرَاقُ فَحْلِهَا وَإِعَارَةُ دَلْوِهَا وَحَمْلٌ عَلَيْهَا فِي سَبِيلِ اللَّهِ وَلَا صَاحِبِ مَالٍ لَا يُؤَدِّي حَقَّهُ إِلَّا يُخَيَّلُ لَهُ يَوْمَ الْقِيَامَةِ شُجَاعٌ أَقْرَعُ يَفِرُّ مِنْهُ صَاحِبُهُ وَهُوَ يَتَّبِعُهُ يَقُولُ لَهُ هَذَا كَنْزُكَ الَّذِي كُنْتَ تَبْخَلُ بِهِ فَإِذَا رَأَى أَنَّهُ لَا بُدَّ لَهُ مِنْهُ أَدْخَلَ يَدَهُ فِي فِيهِ فَجَعَلَ يَقْضَمُهَا كَمَا يَقْضَمُ الْفَحْلُ",
                "id": "Telah mengabarkan kepada kami [Washil bin 'Abdul A'la] dari [Ibnu Fudhail] dari ['Abdul Malik bin Abu Sulaiman] dari [Abu Az Zubair] dari [Jabir bin 'Abdullah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada seorang pun dari pemilik unta, sapi dan kambing yang tidak menunaikan haknya melainkan akan dibangkitkan pada hari Kiamat, ditelungkupkan di tempat yang luas. Setiap yang memiliki kuku telapak kaki akan menginjaknya dengan kuku-kuku telapak kakinya dan setiap yang memiliki tanduk akan menyeruduk dengan tanduknya. Di antara binatang-binatang tersebut tidak ada yang bengkok dan tidak ada yang pecah tanduknya.\" Kami bertanya; 'Wahai Rasulullah shallallahu 'alaihi wasallam! Apa haknya? ' Beliau menjawab: 'Meminjamkan pejantannya, meminjamkan untuk mengambil air dari sumur dan membawa muatan di atasnya pada jalan Allah. Dan tidak ada pemilik harta yang tidak menunaikan haknya melainkan akan dibuatkan untuk dirinya pada hari Kiamat seperti ular yang berkepala putih (karena banyak racunnya), yang pemiliknya lari darinya namun ular tersebut terus mengikutinya seraya mengatakan; 'Inilah harta simpananmu yang kamu bakhil dengannya'. Ketika ia melihat bahwa hal itu sudah menjadi keharusan untuknya, ia memasukkan tangan ke mulutnya, lalu ia segera menggigitnya seperti hewan pejantan menggigit.'"
            },
            {
                "number": 2327,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ النَّسَائِيُّ قَالَ أَنْبَأَنَا شُرَيْحُ بْنُ النُّعْمَانِ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ بْنِ أَنَسِ بْنِ مَالِكٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ أَبَا بَكْرٍ رَضِيَ اللَّهُ عَنْهُ كَتَبَ لَهُ أَنَّ هَذِهِ فَرَائِضُ الصَّدَقَةِ الَّتِي فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمُسْلِمِينَ الَّتِي أَمَرَ اللَّهُ بِهَا رَسُولَهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَنْ سُئِلَهَا مِنْ الْمُسْلِمِينَ عَلَى وَجْهِهَا فَلْيُعْطِهَا وَمَنْ سُئِلَ فَوْقَهَا فَلَا يُعْطِهِ فِيمَا دُونَ خَمْسٍ وَعِشْرِينَ مِنْ الْإِبِلِ فِي خَمْسِ ذَوْدٍ شَاةٌ فَإِذَا بَلَغَتْ خَمْسًا وَعِشْرِينَ فَفِيهَا بِنْتُ مَخَاضٍ إِلَى خَمْسٍ وَثَلَاثِينَ فَإِنْ لَمْ تَكُنِ ابْنَةُ مَخَاضٍ فَابْنُ لَبُونٍ ذَكَرٌ فَإِذَا بَلَغَتْ سِتَّةً وَثَلَاثِينَ فَفِيهَا بِنْتُ لَبُونٍ إِلَى خَمْسٍ وَأَرْبَعِينَ فَإِذَا بَلَغَتْ سِتَّةً وَأَرْبَعِينَ فَفِيهَا حِقَّةٌ طَرُوقَةُ الْفَحْلِ إِلَى سِتِّينَ فَإِذَا بَلَغَتْ إِحْدَى وَسِتِّينَ فَفِيهَا جَذَعَةٌ إِلَى خَمْسَةٍ وَسَبْعِينَ فَإِذَا بَلَغَتْ سِتَّةً وَسَبْعِينَ فَفِيهَا ابْنَتَا لَبُونٍ إِلَى تِسْعِينَ فَإِذَا بَلَغَتْ إِحْدَى وَتِسْعِينَ فَفِيهَا حِقَّتَانِ طَرُوقَتَا الْفَحْلِ إِلَى عِشْرِينَ وَمِائَةٍ فَإِذَا زَادَتْ عَلَى عِشْرِينَ وَمِائَةٍ فَفِي كُلِّ أَرْبَعِينَ ابْنَةُ لَبُونٍ وَفِي كُلِّ خَمْسِينَ حِقَّةٌ فَإِذَا تَبَايَنَ أَسْنَانُ الْإِبِلِ فِي فَرَائِضِ الصَّدَقَاتِ فَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْجَذَعَةِ وَلَيْسَتْ عِنْدَهُ جَذَعَةٌ وَعِنْدَهُ حِقَّةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ الْحِقَّةُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنْ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ إِلَّا جَذَعَةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيُعْطِيهِ الْمُصَّدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَلَيْسَتْ عِنْدَهُ وَعِنْدَهُ ابْنَةُ لَبُونٍ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنْ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ بِنْتِ لَبُونٍ وَلَيْسَتْ عِنْدَهُ إِلَّا حِقَّةٌ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيُعْطِيهِ الْمُصَّدِّقُ عِشْرِينَ دِرْهَمًا أَوْ شَاتَيْنِ وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ بِنْتِ لَبُونٍ وَلَيْسَتْ عِنْدَهُ بِنْتُ لَبُونٍ وَعِنْدَهُ بِنْتُ مَخَاضٍ فَإِنَّهَا تُقْبَلُ مِنْهُ وَيَجْعَلُ مَعَهَا شَاتَيْنِ إِنْ اسْتَيْسَرَتَا لَهُ أَوْ عِشْرِينَ دِرْهَمًا وَمَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ ابْنَةِ مَخَاضٍ وَلَيْسَتْ عِنْدَهُ إِلَّا ابْنُ لَبُونٍ ذَكَرٌ فَإِنَّهُ يُقْبَلُ مِنْهُ وَلَيْسَ مَعَهُ شَيْءٌ وَمَنْ لَمْ يَكُنْ عِنْدَهُ إِلَّا أَرْبَعَةٌ مِنْ الْإِبِلِ فَلَيْسَ فِيهَا شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا وَفِي صَدَقَةِ الْغَنَمِ فِي سَائِمَتِهَا إِذَا كَانَتْ أَرْبَعِينَ فَفِيهَا شَاةٌ إِلَى عِشْرِينَ وَمِائَةٍ فَإِذَا زَادَتْ وَاحِدَةً فَفِيهَا شَاتَانِ إِلَى مِائَتَيْنِ فَإِذَا زَادَتْ وَاحِدَةً فَفِيهَا ثَلَاثُ شِيَاهٍ إِلَى ثَلَاثِ مِائَةٍ فَإِذَا زَادَتْ وَاحِدَةً فَفِي كُلِّ مِائَةٍ شَاةٌ وَلَا تُؤْخَذُ فِي الصَّدَقَةِ هَرِمَةٌ وَلَا ذَاتُ عَوَارٍ وَلَا تَيْسُ الْغَنَمِ إِلَّا أَنْ يَشَاءَ الْمُصَّدِّقُ وَلَا يُجْمَعُ بَيْنَ مُتَفَرِّقٍ وَلَا يُفَرَّقُ بَيْنَ مُجْتَمِعٍ خَشْيَةَ الصَّدَقَةِ وَمَا كَانَ مِنْ خَلِيطَيْنِ فَإِنَّهُمَا يَتَرَاجَعَانِ بَيْنَهُمَا بِالسَّوِيَّةِ وَإِذَا كَانَتْ سَائِمَةُ الرَّجُلِ نَاقِصَةً مِنْ أَرْبَعِينَ شَاةً وَاحِدَةً فَلَيْسَ فِيهَا شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا وَفِي الرِّقَةِ رُبْعُ الْعُشْرِ فَإِنْ لَمْ يَكُنْ الْمَالُ إِلَّا تِسْعِينَ وَمِائَةً فَلَيْسَ فِيهِ شَيْءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا",
                "id": "Telah mengabarkan kepada kami ['Abdullah bin Fadhalah bin Ibrahim An Nasaa'i] dia berkata; Telah memberitakan kepada kami [Syuraih bin An Nu'man] dia berkata; Telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsumamah bin 'Abdullah bin Anas bin Malik] dari [Anas bin Malik] bahwasanya [Abu Bakr] -radliallahu 'anhu- menulis untuknya; \" ini adalah kewajiban zakat yang Rasulullah shallallahu 'alaihi wasallam wajibkan atas kaum muslimin, yang Allah perintahkan Rasul-Nya shallallahu 'alaihi wasallam untuk menunaikannya. Barangsiapa di antara kaum muslimin yang dimintai zakat tersebut berdasarkan aturannya, hendaklah ia memberikannya; dan barangsiapa yang dimintai lebih dari itu, janganlah ia memberikannya: Unta yang kurang dari dua puluh lima ekor, pada setiap kelipatan lima ekor zakatnya satu ekor kambing. Jika mencapai dua puluh lima ekor hingga tiga puluh lima ekor, zakatnya seekor unta betina yang umurnya telah menginjak tahun kedua. Jika tidak ada, zakatnya seekor unta jantan yang umurnya telah menginjak tahun ketiga. Jika mencapai tiga puluh enam hingga empat puluh lima ekor unta, zakatnya seekor anak unta betina yang umurnya telah menginjak tahun ketiga. Jika telah mencapai empat puluh enam sampai enam puluh ekor unta, zakatnya seekor anak unta betina yang umurnya telah masuk tahun keempat dan bisa dikawini unta jantan. Jika telah mencapai enam puluh satu hingga tujuh puluh lima ekor unta, zakatnya seekor unta betina yang umurnya telah masuk tahun kelima. Jika telah mencapai tujuh puluh enam hingga sembilan puluh ekor unta, zakatnya dua ekor anak unta betina yang umurnya telah menginjak tahun kedua. Jika telah mencapai sembilan puluh satu hingga seratus dua puluh ekor unta, zakatnya dua ekor unta betina yang umurnya telah masuk tahun keempat dan dapat dikawini unta jantan. Jika telah melebihi seratus dua puluh ekor unta, maka setiap empat puluh ekor zakatnya seekor anak unta betina yang umurnya masuk tahun ketiga; dan setiap lima puluh ekor, zakatnya seekor unta betina yang umurnya masuk tahun keempat. Jika umur unta-unta yang menjadi kewajiban zakat berbeda-beda, barangsiapa yang jumlah untanya telah wajib mengeluarkan seekor unta betina yang umurnya masuk tahun kelima, namun ia tidak memilikinya dan ia hanya memiliki unta betina yang umurnya masuk tahun keempat, maka ia boleh mengeluarkan seekor anak unta yang umurnya masuk tahun keempat ditambah dua ekor kambing jika hal itu -dirasa- mudah baginya, atau ditambah dua puluh dirham. Barangsiapa yang jumlah untanya telah wajib mengeluarkan seekor unta betina yang umurnya masuk tahun keempat, padahal ia tidak memilikinya dan ia memiliki unta betina yang umurnya masuk tahun kelima, maka ia boleh mengeluarkan seekor anak unta yang umurnya masuk tahun kelima dan petugas zakat memberikan kepadanya dua puluh dirham atau dua ekor kambing jika hal itu -dirasa- mudah baginya. Barangsiapa yang jumlah untanya telah wajib mengeluarkan zakat seekor unta betina yang umurnya masuk tahun keempat, namun ia tidak memilikinya dan ia memiliki unta betina yang umurnya masuk tahun ketiga, maka ia boleh mengeluarkan seekor anak unta yang umurnya masuk tahun ketiga ditambah dua ekor kambing jika hal itu -dirasa- mudah baginya, atau ditambah dua puluh dirham. Barangsiapa yang jumlah untanya telah wajib mengeluarkan zakat seekor unta betina yang umurnya masuk tahun ketiga, padahal ia tidak memilikinya dan ia memiliki unta betina yang umurnya masuk tahun keempat, maka ia boleh mengeluarkan seekor anak unta yang umurnya masuk tahun keempat dan petugas zakat memberikan kepadanya dua puluh dirham atau dua ekor kambing. Barangsiapa yang jumlah untanya telah mewajibkan mengeluarkan seekor unta betina yang umurnya masuk tahun ketiga, padahal ia tidak memilikinya dan ia memiliki unta betina yang umurnya masuk tahun kedua, maka ia boleh mengeluarkan seekor unta yang umurnya masuk tahun kedua ditambah dua ekor kambing jika hal itu -dirasa- mudah baginya, atau ditambah dua puluh dirham. Barangsiapa yang jumlah untanya telah mewajibkannya mengeluarkan seekor unta betina yang umurnya masuk tahun kedua, padahal ia tidak memilikinya dan ia memiliki unta jantan yang umurnya masuk tahun ketiga, maka ia boleh mengeluarkan seekor unta jantan yang umurnya masuk tahun ketiga dan tidak perlu ditambah yang lain. Barangsiapa yang tidak memiliki unta kecuali hanya empat ekor, tidak wajib atasnya zakat kecuali bila pemiliknya. Mengenai zakat kambing yang dilepas mencari makan sendiri, jika mencapai empat puluh ekor hingga seratus dua puluh ekor kambing, zakatnya satu ekor kambing. Jika lebih dari seratus dua puluh hingga dua ratus ekor kambing, zakatnya dua ekor kambing. Jika lebih dua ratus hingga tiga ratus ekor kambing, zakatnya tiga ekor kambing. Jika lebih dari tiga ratus ekor kambing, maka setiap seratus ekor zakatnya seekor kambing. Tidak boleh dikeluarkan untuk zakat hewan yang tua dan cacat dan tidak boleh dikeluarkan yang jantan, kecuali jika pemiliknya menghendaki. Tidak boleh dikumpulkan antara hewan-hewan ternak yang terpisah dan tidak boleh dipisahkan antara hewan-hewan ternak yang terkumpul karena takut mengeluarkan zakat. Hewan ternak kumpulan dari dua orang, pada waktu zakat haru kembali di bagi rata antara keduanya. Jika kambing yang dilepas mencari makan sendiri kurang satu ekor dari empat puluh ekor, maka tidak ada zakatnya, kecuali jika pemiliknya menghendaki. Tentang zakat perak, setiap dua ratus dirham zakatnya seperempat puluhnya (dua setengah persen). Jika hanya seratus sembilan ratus dirham, maka tidak ada zakatnya, kecuali jika pemiliknya menghendakinya.\""
            },
            {
                "number": 2328,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ الْمَعْرُورِ بْنِ سُوَيْدٍ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ صَاحِبِ إِبِلٍ وَلَا بَقَرٍ وَلَا غَنَمٍ لَا يُؤَدِّي زَكَاتَهَا إِلَّا جَاءَتْ يَوْمَ الْقِيَامَةِ أَعْظَمَ مَا كَانَتْ وَأَسْمَنَهُ تَنْطَحُهُ بِقُرُونِهَا وَتَطَؤُهُ بِأَخْفَافِهَا كُلَّمَا نَفِدَتْ أُخْرَاهَا أَعَادَتْ عَلَيْهِ أُولَاهَا حَتَّى يُقْضَى بَيْنَ النَّاسِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Mubarak] dia berkata; Telah menceritakan kepada kami [Waki'] dia berkata; Telah menceritakan kepada kami [Al A'masy] dari [Al Ma'rur bin Suwaid] dari [Abu Dzarr] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada seorang pun dari pemilik unta, sapi dan kambing yang tidak mau menunaikan zakatnya, kecuali akan datang pada hari Kiamat binatang itu lebih besar dan lebih gemuk dari sebelumnya, ia menyeruduknya dengan tanduknya dan menginjak orang itu dengan tapak kakinya. Setiap kali yang terakhir selesai diulang lagi yang pertamanya, hingga perkaranya diputuskan di hadapan manusia.\""
            },
            {
                "number": 2329,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ هُشَيْمٍ عَنْ هِلَالِ بْنِ خَبَّابٍ عَنْ مَيْسَرَةَ أَبِي صَالِحٍ عَنْ سُوَيْدِ بْنِ غَفَلَةَ قَالَأَتَانَا مُصَدِّقُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَيْتُهُ فَجَلَسْتُ إِلَيْهِ فَسَمِعْتُهُ يَقُولُ إِنَّ فِي عَهْدِي أَنْ لَا نَأْخُذَ رَاضِعَ لَبَنٍ وَلَا نَجْمَعَ بَيْنَ مُتَفَرِّقٍ وَلَا نُفَرِّقَ بَيْنَ مُجْتَمِعٍ فَأَتَاهُ رَجُلٌ بِنَاقَةٍ كَوْمَاءَ فَقَالَ خُذْهَا فَأَبَى",
                "id": "Telah mengabarkan kepada kami [Hannad bin As Sariy] dari [Husyaim] dari [Hilal bin Khabbab] dari [Maisarah Abu Shalih] dari [Suwaid bin Ghaflah] dia berkata; [Petugas pengambil zakat utusan Nabi shallallahu 'alaihi wasallam] datang kepada kami, lalu aku menemuinya, duduk di sampingnya dan mendengarkan ia berkata; \" Dalam perjanjianku agar kita tidak mengambil hewan yang masih menyusu dari induknya, tidak mengumpulkan antara hewan-hewan ternak yang terpisah dan memisahkan antara hewan-hewan ternak yang terkumpul.\" Lalu datang kepadanya seseorang dengan membawa unta yang besar punuknya seraya berkata; 'Ambillah unta ini! ' namun petugas zakat itu menolak.\""
            },
            {
                "number": 2330,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ زَيْدِ بْنِ يَزِيدَ يَعْنِي ابْنَ أَبِي الزَّرْقَاءِ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ سَاعِيًا فَأَتَى رَجُلًا فَآتَاهُ فَصِيلًا مَخْلُولًا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثْنَا مُصَدِّقَ اللَّهِ وَرَسُولِهِ وَإِنَّ فُلَانًا أَعْطَاهُ فَصِيلًا مَخْلُولًا اللَّهُمَّ لَا تُبَارِكْ فِيهِ وَلَا فِي إِبِلِهِ فَبَلَغَ ذَلِكَ الرَّجُلَ فَجَاءَ بِنَاقَةٍ حَسْنَاءَ فَقَالَ أَتُوبُ إِلَى اللَّهِ عَزَّ وَجَلَّ وَإِلَى نَبِيِّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ بَارِكْ فِيهِ وَفِي إِبِلِهِ",
                "id": "Telah mengabarkan kepada kami [Harun bin Zaid bin Yazid bin Abu Az Zarqa'] dia berkata; [Bapakku] telah menceritakan kepada kami, dia berkata; Telah menceritakan kepada kami [Sufyan] dari ['Ashim bin Kulaib] dari [bapaknya] dari [Wail bin Hujr] bahwa Nabi shallallahu 'alaihi wasallam mengutus seorang petugas pengambil zakat, lalu ia mendatangi seseorang dan orang itu memberikan seekor anak unta sapihan yang kurus, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Kami telah mengutus seorang petugas pengambil zakat utusan Allah dan Rasul-Nya, dan sungguh si fulan telah memberikan kepadanya seekor anak unta sapihan yang kurus. Ya Allah, janganlah Engkau berikan berkah kepadanya dan jangan pula kepada untanya.\" Lalu berita itu sampai kepada orang tersebut, maka ia datang dengan membawa unta yang baik seraya berkata; 'Aku bertaubat kepada Allah -Azza wa Jalla- dan kepada Nabi-Nya shallallahu 'alaihi wasallam, ' Nabi shallallahu 'alaihi wasallam bersabda: 'Ya Allah, berikan berkah kepadanya dan kepada untanya.'"
            },
            {
                "number": 2331,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ قَالَ حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ عَمْرُو بْنُ مُرَّةَ أَخْبَرَنِي قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَتَاهُ قَوْمٌ بِصَدَقَتِهِمْ قَالَ اللَّهُمَّ صَلِّ عَلَى آلِ فُلَانٍ فَأَتَاهُ أَبِي بِصَدَقَتِهِ فَقَالَ اللَّهُمَّ صَلِّ عَلَى آلِ أَبِي أَوْفَى",
                "id": "Telah mengabarkan kepada kami ['Amru bin Yazid] dia berkata; telah menceritakan kepada kami [Bahz bin Asad] dia berkata; telah menceritakan kepada kami [Syu'bah] dia berkata; ['Amru bin Murrah] telah mengabarkan kepadaku, dia berkata; Aku mendengar ['Abdullah bin Abu Aufa] berkata; Rasulullah shallallahu 'alaihi wasallam ketika didatangi oleh suatu kaum dengan mambawa zakat mereka, beliau berdo'a: \"Ya Allah berilah rahmat atas keluarga si fulan.\" Lalu Abu Aufa datang kepada beliau dengan membawa zakatnya, maka beliau berdo'a: 'Ya Allah berilah rahmat kepada keluarga Abu Aufa.'"
            },
            {
                "number": 2332,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ وَاللَّفْظُ لَهُ قَالَا حَدَّثَنَا يَحْيَى عَنْ مُحَمَّدِ بْنِ أَبِي إِسْمَعِيلَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلَالٍ قَالَ قَالَ جَرِيرٌأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاسٌ مِنْ الْأَعْرَابِ فَقَالُوا يَا رَسُولَ اللَّهِ يَأْتِينَا نَاسٌ مِنْ مُصَدِّقِيكَ يَظْلِمُونَ قَالَ أَرْضُوا مُصَدِّقِيكُمْ قَالُوا وَإِنْ ظَلَمَ قَالَ أَرْضُوا مُصَدِّقِيكُمْ ثُمَّ قَالُوا وَإِنْ ظَلَمَ قَالَ أَرْضُوا مُصَدِّقِيكُمْقَالَ جَرِيرٌ فَمَا صَدَرَ عَنِّي مُصَدِّقٌ مُنْذُ سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا وَهُوَ رَاضٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] - dan lafadz ini miliknya - mereka berdua berkata; telah menceritakan kepada kami [Yahya] dari [Muhammad bin Isma'il] dari ['Abdurrahman bin Hilal] dia berkata; [Jarir] berkata; Sekelompok orang dari Arab badui datang menemui Nabi shallallahu 'alaihi wasallam, lalu mereka berkata; \"Wahai Rasulullah! Sekelompok orang datang dari petugas pengambil zakat utusanmu berbuat zhalim.\" Beliau bersabda: 'Buatlah para petugas pengambil zakat yang mengambil zakat kalian merasa ridla.' Mereka bertanya; 'Meskipun berbuat zhalim? ' Beliau bersabda: 'Buatlah para petugas pengambil zakat yang mengambil zakat kalian, merasa ridla.' Mereka bertanya; 'Meskipun berbuat zhalim? ' Beliau bersabda: 'Buatlah para petugas pengambil zakat yang mengambil zakat kalian merasa ridla.' Jarir berkata; 'Tidak pernah seorang petugas pengambil zakat kembali dari tempatku sejak aku mendengar Rasulullah shallallahu 'alaihi wasallam kecuali dia merasa ridla.'"
            },
            {
                "number": 2333,
                "arab": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا إِسْمَعِيلُ هُوَ ابْنُ عُلَيَّةَ قَالَ أَنْبَأَنَا دَاوُدُ عَنْ الشَّعْبِيِّ قَالَ قَالَ جَرِيرٌقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَتَاكُمْ الْمُصَّدِّقُ فَلْيَصْدُرْ وَهُوَ عَنْكُمْ رَاضٍ",
                "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub] dia berkata; telah menceritakan kepada kami [Isma'il bin 'Ulayyah] dia berkata; telah memberitakan kepada kami [Dawud] dari [Asy Sya'bi] dia berkata; [Jarir] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika datang kepada kalian petugas pengambil zakat, jadikanlah ia kembali dalam keadaan ridla terhadap kalian.\""
            },
            {
                "number": 2334,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَقَ عَنْ عَمْرِو بْنِ أَبِي سُفْيَانَ عَنْ مُسْلِمِ بْنِ ثَفِنَةَ قَالَاسْتَعْمَلَ ابْنُ عَلْقَمَةَ أَبِي عَلَى عِرَافَةِ قَوْمِهِ وَأَمَرَهُ أَنْ يُصَدِّقَهُمْ فَبَعَثَنِي أَبِي إِلَى طَائِفَةٍ مِنْهُمْ لِآتِيَهُ بِصَدَقَتِهِمْ فَخَرَجْتُ حَتَّى أَتَيْتُ عَلَى شَيْخٍ كَبِيرٍ يُقَالُ لَهُ سَعْرٌ فَقُلْتُ إِنَّ أَبِي بَعَثَنِي إِلَيْكَ لِتُؤَدِّيَ صَدَقَةَ غَنَمِكَ قَالَ ابْنَ أَخِي وَأَيُّ نَحْوٍ تَأْخُذُونَ قُلْتُ نَخْتَارُ حَتَّى إِنَّا لَنَشْبُرُ ضُرُوعَ الْغَنَمِ قَالَ ابْنَ أَخِي فَإِنِّي أُحَدِّثُكَ أَنِّي كُنْتُ فِي شِعْبٍ مِنْ هَذِهِ الشِّعَابِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَنَمٍ لِي فَجَاءَنِي رَجُلَانِ عَلَى بَعِيرٍ فَقَالَا إِنَّا رَسُولَا رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْكَ لِتُؤَدِّيَ صَدَقَةَ غَنَمِكَ قَالَ قُلْتُ وَمَا عَلَيَّ فِيهَا قَالَا شَاةٌ فَأَعْمِدُ إِلَى شَاةٍ قَدْ عَرَفْتُ مَكَانَهَا مُمْتَلِئَةٍ مَحْضًا وَشَحْمًا فَأَخْرَجْتُهَا إِلَيْهِمَا فَقَالَ هَذِهِ الشَّافِعُ وَالشَّافِعُ الْحَائِلُ وَقَدْ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَأْخُذَ شَافِعًا قَالَ فَأَعْمِدُ إِلَى عَنَاقٍ مُعْتَاطٍ وَالْمُعْتَاطُ الَّتِي لَمْ تَلِدْ وَلَدًا وَقَدْ حَانَ وِلَادُهَا فَأَخْرَجْتُهَا إِلَيْهِمَا فَقَالَا نَاوِلْنَاهَا فَرَفَعْتُهَا إِلَيْهِمَا فَجَعَلَاهَا مَعَهُمَا عَلَى بَعِيرِهِمَا ثُمَّ انْطَلَقَاأَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا رَوْحٌ قَالَ حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَقَ قَالَ حَدَّثَنِي عَمْرُو بْنُ أَبِي سُفْيَانَ قَالَ حَدَّثَنِي مُسْلِمُ بْنُ ثَفِنَةَ أَنَّ ابْنَ عَلْقَمَةَ اسْتَعْمَلَ أَبَاهُ عَلَى صَدَقَةِ قَوْمِهِ وَسَاقَ الْحَدِيثَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Mubarak] dia berkata; telah menceritakan kepada kami [Waki'] dia berkata; telah menceritakan kepada kami [Zakariya bin Ishaq] dari ['Amru bin Abu Sufyan] dari [Muslim bin Tsafinah] dia berkata; Ibnu Al Qomah menugaskan bapakku untuk menjadi pemimpin kaumnya dan menyuruhnya untuk mengambil zakat mereka. Muslim berkata; 'Lalu ayahku mengutusku kepada sebuah kaum agar aku mengambil zakat mereka.' Kemudian aku keluar hingga menemui seorang yang telah tua bernama [Si'ir], aku katakan; ayahku mengutusku kepadamu agar kamu menunaikan zakat kambingmu. (orang tua itu) berkata; wahai anak saudaraku! kambing seperti apa yang akan kalian ambil? aku berkata; Biarkan aku memilih sampai aku bisa mengukur susu kambingmu. Dia berkata; 'Wahai anak saudaraku, aku akan memberitahumu bahwa ketika aku berada di sebuah bukit bersama kambing-kambingku pada masa Nabi shallallahu 'alaihi wasallam, tiba-tiba datang kepadaku dua orang laki-laki yang mengendarai unta dan berkata; 'Kami adalah utusan Nabi shallallahu 'alaihi wasallam yang datang kepadamu agar kamu menunaikan zakat kambingmu, aku berkata; 'Apa yang wajib aku keluarkan darinya? ' (Keduanya) berkata; 'Seekor kambing.' Lalu aku pergi menuju seekor kambing, yang aku melihatnya telah mengandung dan gemuk, lalu aku mengeluarkannya kepada mereka. [Keduanya] berkata; 'Ini adalah kambing yang sedang hamil, padahal Rasulullah shallallahu 'alaihi wasallam melarang kami untuk mengambil kambing yang hamil. (orang tua itu) berkata; 'Lalu aku menuju 'anaq (kambing betina yang berumur enam bulan hingga satu tahun) yang mu'tath, dia berkata; Mu'tath adalah kambing yang tidak bisa melahirkan anak (karena gemuk) padahal sudah masanya untuk bisa melahirkan anak, lalu aku mengeluarkannya kepada mereka dan keduanya berkata; 'Berikan kepada kami, maka aku memberikannya kepada mereka hingga keduanya menaikkannya ke atas unta mereka lalu keduanya pergi. Telah mengabarkan kepada kami [Harun bin Abdullah] dia berkata; Telah menceritakan kepada kami [Rauh] dia berkata; telah menceritakan kepada kami [Zakaria bin Ishaq] dia berkata; Telah menceritakan kepadaku [Amru bin Abu Sufyan] dia berkata; Telah menceritakan kepadaku [Muslim bin Tsafinah] bahwa Ibnu Al Qomah menugaskan bapakku untuk menjadi pemimpin kaumnya dan menyuruhnya untuk mengambil zakat mereka.- kemudian dia menyampaikan hadits diatas.-"
            },
            {
                "number": 2335,
                "arab": "أَخْبَرَنِي عِمْرَانُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ قَالَ حَدَّثَنَا شُعَيْبٌ قَالَ حَدَّثَنِي أَبُو الزِّنَادِ مِمَّا حَدَّثَهُ عَبْدُ الرَّحْمَنِ الْأَعْرَجُ مِمَّا ذَكَرَ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يُحَدِّثُ قَالَ وَقَالَ عُمَرُأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِصَدَقَةٍ فَقِيلَ مَنَعَ ابْنُ جَمِيلٍ وَخَالِدُ بْنُ الْوَلِيدِ وَعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يَنْقِمُ ابْنُ جَمِيلٍ إِلَّا أَنَّهُ كَانَ فَقِيرًا فَأَغْنَاهُ اللَّهُ وَأَمَّا خَالِدُ بْنُ الْوَلِيدِ فَإِنَّكُمْ تَظْلِمُونَ خَالِدًا قَدْ احْتَبَسَ أَدْرَاعَهُ وَأَعْتُدَهُ فِي سَبِيلِ اللَّهِ وَأَمَّا الْعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ عَمُّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهِيَ عَلَيْهِ صَدَقَةٌ وَمِثْلُهَا مَعَهَاأَخْبَرَنَا أَحْمَدُ بْنُ حَفْصٍ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ مُوسَى قَالَ حَدَّثَنِي أَبُو الزِّنَادِ عَنْ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَ أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِصَدَقَةٍ مِثْلَهُ سَوَاءً",
                "id": "Telah mengabarkan kepadaku ['Imran bin Bakkar] dia berkata; telah menceritakan kepada kami ['Ali bin 'Ayyasy] dia berkata; telah menceritakan kepada kami [Syu'aib] dia berkata; telah menceritakan kepadaku [Abu Az Zinad] dari apa-apa yang diceritakan kepadanya oleh ['Abdurrahman Al A'raj] disebutkan bahwasanya ia mendengar [Abu Hurairah] berkata; [Umar] berkata Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk mengambil zakat, lalu dikatakan; \"Ibnu Jamil, Khalid bin Al Walid dan Abbas bin Abdul Muthalib tidak mau memberikannya.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidaklah Ibnu Jamil merasa enggan untuk membayarnya, hanya saja dahulu ia fakir lalu Allah menjadikan ia kaya. Sedangkan Khalid bin Al Walid, sungguh kalian telah menzhalimi Khalid, ia telah mewakafkan baju besi dan peralatan perangnya di jalan Allah. Sedangkan Al Abbas bin Abdul Muthalib, paman Rasulullah shallallahu 'alaihi wasallam, dia berkewajiban membayar zakat dan zakat yang sama bersamaan dengannya.' Telah mengabarkan kepada kami [Ahmad bin Hafsh] dia berkata; Telah menceritakan kepada kami [Bapakku] dia berkata; Telah menceritakan kepada kami [Ibrahim bin Thahman] dari [Musa] dia berkata; Telah menceritakan kepadaku [Abu Zinad] dari [Abdurrahman] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk mengambil zakat sama seperti diatas."
            },
            {
                "number": 2336,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ وَمَحْمُودُ بْنُ غَيْلَانَ قَالَا حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ الْأَسْوَدِ عَنْ عَبْدِ اللَّهِ بْنِ هِلَالٍ الثَّقَفِيِّ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ كِدْتُ أُقْتَلُ بَعْدَكَ فِي عَنَاقٍ أَوْ شَاةٍ مِنْ الصَّدَقَةِ فَقَالَ لَوْلَا أَنَّهَا تُعْطَى فُقَرَاءَ الْمُهَاجِرِينَ مَا أَخَذْتُهَا",
                "id": "Telah mengabarkan kepada kami ['Amru bin Manshur] dan [Mahmud bin Ghailan] mereka berdua berkata; Telah menceritakan kepada kami [Abu Nu'aim] dia berkata; Telah menceritakan kepada kami [Sufyan] dari [Ibrahim bin Maisarah] dari ['Utsman bin 'Abdullah bin Al Aswad] dari ['Abdullah bin Hilal Ats Tsaqafi] dia berkata; Seseorang datang kepada Nabi shallallahu 'alaihi wasallam lalu ia berkata hampir saja aku terbunuh setelahmu karena zakat seekor kambing betina, lalu beliau bersabda: \"Kalau bukan karena (untuk diberikan) orang-orang Muhajirin yang fakir maka aku tidak akan mengambilnya.\""
            },
            {
                "number": 2337,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ وَسُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ عَلَى الْمُسْلِمِ فِي عَبْدِهِ وَلَا فَرَسِهِ صَدَقَةٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Mubarak] dia berkata; telah menceritakan kepada kami [Waki'] dari [Syu'bah] dan [Sufyan] dari ['Abdullah bin Dinar] dari [Sulaiman bin Yasar] dari ['Irak bin Malik] dari [Abu Hurairah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Tidak wajib zakat atas seorang muslim pada budak dan kudanya'.\""
            },
            {
                "number": 2338,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ حَرْبٍ الْمَرْوَزِيُّ قَالَ حَدَّثَنَا مُحْرِزُ بْنُ الْوَضَّاحِ عَنْ إِسْمَعِيلَ وَهُوَ ابْنُ أُمَيَّةَ عَنْ مَكْحُولٍ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا زَكَاةَ عَلَى الرَّجُلِ الْمُسْلِمِ فِي عَبْدِهِ وَلَا فَرَسِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Ali bin Harb Al Marwazi] dia berkata; telah menceritakan kepada kami [Muhriz bin Al Wadldlah] dari [Isma'il bin Umayyah] dari [Makhul] dari ['Irak bin Malik] dari [Abu Hurairah] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak wajib zakat atas seorang muslim pada budak dan kudanya.\""
            },
            {
                "number": 2339,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا أَيُّوبُ بْنُ مُوسَى عَنْ مَكْحُولٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِي هُرَيْرَةَيَرْفَعُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ عَلَى الْمُسْلِمِ فِي عَبْدِهِ وَلَا فِي فَرَسِهِ صَدَقَةٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dia berkata; Telah menceritakan kepada kami [Sufyan] dia berkata; Telah menceritakan kepada kami [Ayyub bin Musa] dari [Makhul] dari [Sulaiman bin Yasar] dari ['Irak bin Malik] dari [Abu Hurairah] dia menyandarkannya kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak wajib zakat atas seseorang muslim pada budak dan kudanya.\""
            },
            {
                "number": 2340,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ خُثَيْمٍ قَالَ حَدَّثَنَا أَبِي عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ عَلَى الْمَرْءِ فِي فَرَسِهِ وَلَا فِي مَمْلُوكِهِ صَدَقَةٌ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dia berkata; telah menceritakan kepada kami [Yahya] dari [Khutsaim] dia berkata; [bapakku] telah menceritakan kepada kami dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak wajib zakat atas seseorang pada kuda dan budaknya.\""
            },
            {
                "number": 2341,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ عَلَى الْمُسْلِمِ فِي عَبْدِهِ وَلَا فِي فَرَسِهِ صَدَقَةٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] secara baca, dan aku mendengarnya, lafazh ini miliknya, dari [Ibnul Qasim] dia berkata; telah menceritakan kepadaku [Malik] dari ['Abdullah bin Dinar] dari [Sulaiman bin Yasar] dari ['Irak bin Malik] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak wajib zakat atas seseorang pada kuda dan budaknya.\""
            },
            {
                "number": 2342,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ خُثَيْمِ بْنِ عِرَاكِ بْنِ مَالِكٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ عَلَى الْمُسْلِمِ صَدَقَةٌ فِي غُلَامِهِ وَلَا فِي فَرَسِهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Hammad] dari [Khutsaim bin 'Irak bin Malik] dari [bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak wajib zakat atas seseorang pada kuda dan budaknya.\""
            },
            {
                "number": 2343,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ عَنْ حَمَّادٍ قَالَ حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ سَعِيدٍ عَنْ عَمْرِو بْنِ يَحْيَى عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوَاقٍ صَدَقَةٌ وَلَا فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوْسُقٍ صَدَقَةٌ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Habib bin 'Arabi] dari [Hammad] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari ['Amru bin Yahya] dari [bapaknya] dari [Abu Sa'id Al Khudri] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada perak yang kurang dari lima ekor uqiyah, tidak ada zakat pada unta yang kurang dari lima ekor dan tidak ada zakat pada (biji-bijian) yang kurang dari lima wasaq.\""
            },
            {
                "number": 2344,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ عَنْ مَالِكٍ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ الْمَازِنِيُّ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِيمَا دُونَ خَمْسِ أَوْسُقٍ مِنْ التَّمْرِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنْ الْوَرِقِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ مِنْ الْإِبِلِ صَدَقَةٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah memberitakan kepada kami [Ibnul Qasim] dari [Malik] dia berkata; telah menceritakan kepadaku [Muhammad bin 'Abdullah bin 'Abdurrahman bin Abu Sha'sha'ah Al Mazini] dari [bapaknya] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada kurma yang kurang dari lima wasaq, tidak ada zakat pada perak yang kurang dari lima uqiyah dan tidak ada zakat pada unta yang kurang dari lima ekor.\""
            },
            {
                "number": 2345,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ الْوَلِيدِ بْنِ كَثِيرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ عَنْ يَحْيَى بْنِ عُمَارَةَ وَعَبَّادِ بْنِ تَمِيمٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا صَدَقَةَ فِيمَا دُونَ خَمْسِ أَوْسَاقٍ مِنْ التَّمْرِ وَلَا فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنْ الْوَرِقِ صَدَقَةٌ وَلَا فِيمَا دُونَ خَمْسِ ذَوْدٍ مِنْ الْإِبِلِ صَدَقَةٌ",
                "id": "Telah mengabarkan kepada kami [Harun bin 'Abdullah] dia berkata; telah menceritakan kepada kami [Abu Usamah] dari [Al Walid bin Katsir] dari [Muhammad bin 'Abdurrahman bin Abu Sha'sha'ah] dari [Yahya bin 'Umarah] dan ['Abbad bin Tamim] dari [Abu Sa'id Al Khudri] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada kurma yang kurang dari lima wasaq, tidak ada zakat pada perak yang kurang dari lima uqiyah dan tidak ada zakat pada unta yang kurang dari lima ekor.\" "
            },
            {
                "number": 2346,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ الطُّوسِيُّ قَالَ حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنَا أَبِي قَالَ حَدَّثَنَا ابْنُ إِسْحَقَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ حِبَّانَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ وَكَانَا ثِقَةً عَنْ يَحْيَى بْنِ عُمَارَةَ بْنِ أَبِي حَسَنٍ وَعَبَّادِ بْنِ تَمِيمٍ وَكَانَا ثِقَةً عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنْ الْوَرِقِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسٍ مِنْ الْإِبِلِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur Ath-Thusi] dia berkata; telah menceritakan kepada kami [Ya'qub] dia berkata; [Bapakku] telah menceritakan kepada kami, dia berkata; Telah menceritakan kepada kami [Ibnu Ishaq] dia berkata; Telah menceritakan kepadaku [Muhammad bin Yahya bin Hibban] dan [Muhammad bin 'Abdullah bin 'Abdurrahman bin Abu Sha'sha'ah] -dan mereka berdua adalah tsiqah- dari [Yahya bin 'Umarah bin Abu Hasan] dan ['Abbad bin Tamim] -dan mereka berdua adalah tsiqah- dari [Abu Sa'id Al Khudri] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada perak yang kurang dari lima uqiyah dan tidak ada zakat pada unta yang kurang dari lima ekor dan tidak ada zakat pada (biji-bijian) yang kurang dari lima wasaq.\""
            },
            {
                "number": 2347,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلَانَ قَالَ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ عَفَوْتُ عَنْ الْخَيْلِ وَالرَّقِيقِ فَأَدُّوا زَكَاةَ أَمْوَالِكُمْ مِنْ كُلِّ مِائَتَيْنِ خَمْسَةً",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Ghailan] dia berkata; telah menceritakan kepada kami [Abu Usamah] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari ['Ashim bin Dhamrah] dari ['Ali] radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh aku telah membebaskan diri dari -kewajiban mengeluarkan sedekah- kuda dan budak, maka tunaikanlah zakat harta kalian dari setiap dua ratus (dirham) lima dirham.\""
            },
            {
                "number": 2348,
                "arab": "أَخْبَرَنَا حُسَيْنُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا ابْنُ نُمَيْرٍ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ عَفَوْتُ عَنْ الْخَيْلِ وَالرَّقِيقِ وَلَيْسَ فِيمَا دُونَ مِائَتَيْنِ زَكَاةٌ",
                "id": "Telah mengabarkan kepada kami [Husain bin Manshur] dia berkata; telah menceritakan kepada kami [Ibnu Numair] dia berkata; telah menceritakan kepada kami [Al A'masy] dari [Abu Ishaq] dari ['Ashim bin Dhamrah] dari ['Ali] radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh aku telah membebaskan diri dari -kewajiban mengeluarkan sedekah- kuda dan budak, dan tidak ada zakat pada harta yang kurang dari dua ratus dirham.\""
            },
            {
                "number": 2349,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ حُسَيْنٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ امْرَأَةً مِنْ أَهْلِ الْيَمَنِ أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِنْتٌ لَهَا فِي يَدِ ابْنَتِهَا مَسَكَتَانِ غَلِيظَتَانِ مِنْ ذَهَبٍ فَقَالَ أَتُؤَدِّينَ زَكَاةَ هَذَا قَالَتْ لَا قَالَ أَيَسُرُّكِ أَنْ يُسَوِّرَكِ اللَّهُ عَزَّ وَجَلَّ بِهِمَا يَوْمَ الْقِيَامَةِ سِوَارَيْنِ مِنْ نَارٍ قَالَ فَخَلَعَتْهُمَا فَأَلْقَتْهُمَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ هُمَا لِلَّهِ وَلِرَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ قَالَ سَمِعْتُ حُسَيْنًا قَالَ حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ قَالَ جَاءَتْ امْرَأَةٌ وَمَعَهَا بِنْتٌ لَهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي يَدِ ابْنَتِهَا مَسَكَتَانِ نَحْوَهُ مُرْسَلٌ قَالَ أَبُو عَبْد الرَّحْمَنِ خَالِدٌ أَثْبَتُ مِنْ الْمُعْتَمِرِ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Khalid] dari [Husain] dari ['Amru bin Syu'aib] dari [bapaknya] dari [kakeknya] bahwa seorang wanita dari negeri Yaman datang kepada Rasulullah shallallahu 'alaihi wasallam bersama puterinya yang mengenakan dua gelang ditangannya berukuran besar terbuat dari emas, lalu beliau bertanya: \"Apakah kamu telah mengeluarkan zakat gelang ini?\" Ia menjawab; 'Tidak.' Beliau bersabda: 'Apakah kamu senang pada hari Kiamat nanti Allah -Azza wa Jalla- akan menggelangimu dengan dua gelang dari api neraka? ' Ibnu Amru berkata; 'Maka ia segera melepas kedua gelang tersebut dan melemparkannya kepada Rasulullah shallallahu 'alaihi wasallam, seraya berkata; 'Kedua gelang itu untuk Allah dan Rasul-Nya.' Telah mengabarkan kepada kami Muhammad bin Abdul A'la dia berkata; telah menceritakan kepada kami Al Mu'tamir bin Sulaiman dia berkata; Aku mendengar Husain berkata; Telah menceritakan kepada kami Amru bin Syu'aib dia berkata; Telah datang kepada Rasulullah shallallahu 'alaihi wasallam seorang wanita bersama puterinya yang mengenakan dua gelang ditangannya, -sebagaimana Hadits di atas secara mursal. Abu Abdurrahman berkata; Khalid lebih kuat dibanding Al Mu'tamir."
            },
            {
                "number": 2350,
                "arab": "أَخْبَرَنَا الْفَضْلُ بْنُ سَهْلٍ قَالَ حَدَّثَنَا أَبُو النَّضْرِ هَاشِمُ بْنُ الْقَاسِمِ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الَّذِي لَا يُؤَدِّي زَكَاةَ مَالِهِ يُخَيَّلُ إِلَيْهِ مَالُهُ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ لَهُ زَبِيبَتَانِ قَالَ فَيَلْتَزِمُهُ أَوْ يُطَوِّقُهُ قَالَ يَقُولُ أَنَا كَنْزُكَ أَنَا كَنْزُكَ",
                "id": "Telah mengabarkan kepada kami [Al Fadhl bin Sahl] dia berkata; Telah menceritakan kepada kami [Abu An Nadhr Hasyim bin Al Qasim] dia berkata; Telah menceritakan kepada kami ['Abdul 'Aziz bin 'Abdullah bin Abu Salamah] dari ['Abdullah bin Dinar] dari [Ibnu 'Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Orang yang tidak mau menunaikan zakat hartanya, pada hari Kiamat hartanya itu diubah seperti ular berkepala putih (karena banyak racunnya) yang memiliki dua titik hitam di atas matanya atau dua taringnya.\" -Ibnu Umar berkata- Lalu ular itu mengikutinya -atau mengulanginya, ia menuturkan-, ular itu berkata; 'Akulah harta simpananmu, akulah harta simpananmu'.'"
            },
            {
                "number": 2351,
                "arab": "أَخْبَرَنَا الْفَضْلُ بْنُ سَهْلٍ قَالَ حَدَّثَنَا حَسَنُ بْنُ مُوسَى الْأَشْيَبُ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ الْمَدَنِيُّ عَنْ أَبِيهِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ آتَاهُ اللَّهُ عَزَّ وَجَلَّ مَالًا فَلَمْ يُؤَدِّ زَكَاتَهُ مُثِّلَ لَهُ مَالُهُ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ لَهُ زَبِيبَتَانِ يَأْخُذُ بِلِهْزِمَتَيْهِ يَوْمَ الْقِيَامَةِ فَيَقُولُ أَنَا مَالُكَ أَنَا كَنْزُكَ ثُمَّ تَلَا هَذِهِ الْآيَةَ{ وَلَا يَحْسَبَنَّ الَّذِينَ يَبْخَلُونَ بِمَا آتَاهُمْ اللَّهُ مِنْ فَضْلِهِ }الْآيَةَ",
                "id": "Telah mengabarkan kepada kami [Al Fadhl bin Sahl] dia berkata; Telah menceritakan kepada kami [Hasan bin Musa Al Asyyab] dia berkata; Telah menceritakan kepada kami ['Abdurrahman bin 'Abdullah bin Dinar Al Madani] dari [bapaknya] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang diberi harta oleh Allah -Azza wa Jalla-, lalu ia tidak menunaikan zakatnya, maka hartanya akan diubah pada hari Kiamat seperti seekor ular berkepala putih (karena banyak racunnya) serta memiliki dua titik hitam di atas matanya atau dua taring, memangsa dengan kedua tulang rahangnya pada hari Kiamat, lalu mengatakan, 'Akulah harta simpananmu, akulah harta simpananmu'.\" Kemudian membaca ayat ini: 'Janganlah sekali-kali orang-orang yang bakhil dengan harta yang Allah berikan kepada mereka dari karunia-Nya menyangka....' dan seterusnya."
            },
            {
                "number": 2352,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ يَحْيَى بْنِ عُمَارَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسَاقٍ مِنْ حَبٍّ أَوْ تَمْرٍ صَدَقَةٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Mubarak] dia berkata; Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Isma'il bin Umayyah] dari [Muhammad bin Yahya bin Habban] dari [Yahya bin 'Umarah] dari [Abu Sa'id Al Khudri] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada biji-bijian atau kurma yang kurang dari lima wasaq.\""
            },
            {
                "number": 2353,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا رَوْحُ بْنُ الْقَاسِمِ قَالَ حَدَّثَنِي عَمْرُو بْنُ يَحْيَى بْنِ عُمَارَةَ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَحِلُّ فِي الْبُرِّ وَالتَّمْرِ زَكَاةٌ حَتَّى تَبْلُغَ خَمْسَةَ أَوْسُقٍ وَلَا يَحِلُّ فِي الْوَرِقِ زَكَاةٌ حَتَّى تَبْلُغَ خَمْسَةَ أَوَاقٍ وَلَا يَحِلُّ فِي إِبِلٍ زَكَاةٌ حَتَّى تَبْلُغَ خَمْسَ ذَوْدٍ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Yazid bin Zurai'] dia berkata; Telah menceritakan kepada kami [Rauh bin Al Qasim] dia berkata; Telah menceritakan kepadaku ['Amru bin Yahya bin 'Umarah] dari [bapaknya] dari [Abu Sa'id Al Khudri] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak halal mengeluarkan zakat pada gandum dan kurma hingga mencapai lima wasaq, tidak halal mengeluarkan zakat pada perak hingga mencapai lima uqiyah dan tidak halal mengeluarkan zakat pada unta hingga mencapai lima ekor.\""
            },
            {
                "number": 2354,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ يَحْيَى بْنِ عُمَارَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِي حَبٍّ وَلَا تَمْرٍ صَدَقَةٌ حَتَّى تَبْلُغَ خَمْسَةَ أَوْسُقٍ وَلَا فِيمَا دُونَ خَمْسٍ ذَوْدٍ وَلَا فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Isma'il bin Umayyah] dari [Muhammad bin Yahya bin Habban] dari [Yahya bin 'Umarah] dari [Abu Sa'id Al Khudri] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada biji-bijian dan kurma hingga mencapai lima wasaq, tidak ada zakat pada unta yang kurang dari lima ekor dan tidak ada pula zakat pada perak yang kurang dari lima uqiyah.\""
            },
            {
                "number": 2355,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا إِدْرِيسُ الْأَوْدِيُّ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي الْبَخْتَرِيِّ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Mubarak] dia berkata; telah menceritakan kepada kami [Waki'] dia berkata; telah menceritakan kepada kami [Idris Al Audi] dari ['Amru bin Murrah] dari [Abu Al Bukhtari] dari [Abu Sa'id Al Khudri] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada zakat pada perak yang kurang dari lima uqiyah.\""
            },
            {
                "number": 2356,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدَةَ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ يَحْيَى بْنِ سَعِيدٍ وَعُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ عَمْرِو بْنِ يَحْيَى عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ صَدَقَةٌ وَلَا فِيمَا دُونَ خَمْسِ ذَوْدٍ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ صَدَقَةٌ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Abdah] dia berkata; telah menceritakan kepada kami [Hammad] dari [Yahya bin Sa'id] dan ['ubaidhullah bin 'Umar] dari ['Amru bin Yahya] dari [bapaknya] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada zakat pada perak yang kurang dari lima uqiyah, tidak ada zakat pada unta yang kurang dari lima ekor dan tidak ada zakat pada biji-bijian yang kurang dari lima wasaq.\""
            },
            {
                "number": 2357,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ سَعِيدِ بْنِ الْهَيْثَمِ أَبُو جَعْفَرٍ الْأَيْلِيُّ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيمَا سَقَتْ السَّمَاءُ وَالْأَنْهَارُ وَالْعُيُونُ أَوْ كَانَ بَعْلًا الْعُشْرُ وَمَا سُقِيَ بِالسَّوَانِي وَالنَّضْحِ نِصْفُ الْعُشْرِ",
                "id": "Telah mengabarkan kepada kami [Harun bin Sa'id bin Al Haitsam Abu Ja'far Al Aili] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Salim] dari [bapaknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tanaman yang disiram dengan air hujan, sungai dan mata air atau tanaman yang hanya hidup dengan air hujan, zakatnya sepersepuluh; dan tanaman yang disiram dengan tenaga manusia atau binatang zakatnya separuh dari sepersepuluh (seperduapuluh).\""
            },
            {
                "number": 2358,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ سَوَّادِ بْنِ الْأَسْوَدِ بْنِ عَمْرٍو وَأَحْمَدُ بْنُ عَمْرٍو وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ قَالَ حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ أَنَّ أَبَا الزُّبَيْرِ حَدَّثَهُ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيمَا سَقَتْ السَّمَاءُ وَالْأَنْهَارُ وَالْعُيُونُ الْعُشْرُ وَفِيمَا سُقِيَ بِالسَّانِيَةِ نِصْفُ الْعُشْرِ",
                "id": "Telah mengabarkan kepadaku ['Amr bin Sawwad bin Al Aswad bin 'Amr] dan [Ahmad bin 'Amru] dan [Al Harits bin Miskin] secara baca dan aku mendengarnya dari [Ibnu Wahb] dia berkata; Telah menceritakan kepada kami ['Amru bin Al Harits] bahwasanya [Abu Az Zubair] menceritakan kepadanya bahwasanya dia mendengar [Jabir bin 'Abdullah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tanaman yang disiram dengan air hujan, sungai dan mata air atau tanaman yang hanya hidup dengan air hujan, zakatnya sepersepuluh; dan tanaman yang disiram dengan tenaga manusia atau binatang zakatnya separuh dari sepersepuluh (seperduapuluh).\""
            },
            {
                "number": 2359,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي بَكْرٍ وَهُوَ ابْنُ عَيَّاشٍ عَنْ عَاصِمٍ عَنْ أَبِي وَائِلٍ عَنْ مُعَاذٍ قَالَبَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَمَنِ فَأَمَرَنِي أَنْ آخُذَ مِمَّا سَقَتْ السَّمَاءُ الْعُشْرَ وَفِيمَا سُقِيَ بِالدَّوَالِي نِصْفَ الْعُشْرِ",
                "id": "Telah mengabarkan kepada kami [Hannad bin As Sari] dari [Abu Bakr bin 'Ayyasy] dari ['Ashim] dari [Abu Wa'il] dari [Mu'adz] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengutusku ke negeri Yaman, lalu beliau memerintahkanku untuk mengambil sepersepuluh hasil tanaman yang disiram dengan air hujan dan separuh dari sepersepuluh (seperduapuluh) hasil tanaman yang disiram dengan tenaga manusia.\""
            },
            {
                "number": 2360,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ جَعْفَرٍ قَالَا حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ خُبَيْبَ بْنَ عَبْدِ الرَّحْمَنِ يُحَدِّثُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَسْعُودِ بْنِ نِيَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ قَالَ أَتَانَا وَنَحْنُ فِي السُّوقِ فَقَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَرَصْتُمْ فَخُذُوا وَدَعُوا الثُّلُثَ فَإِنْ لَمْ تَأْخُذُوا أَوْ تَدَعُوا الثُّلُثَ شَكَّ شُعْبَةُ فَدَعُوا الرُّبُعَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; Telah menceritakan kepada kami [Yahya bin Sa'id] dan [Muhammad bin Ja'far] mereka berdua berkata; Telah menceritakan kepada kami [Syu'bah] dia berkata; Aku mendengar [Khubaib bin 'Abdurrahman] menceritakan dari ['Abdurrahman bin Mas'ud bin Niyar] dia berkata; [Sahl bin Abu Hatsmah] datang kepada kami, sedangkan kami sedang berada di pasar, lalu dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian memperkirakan buah yang masih berada di atas pohon dengan taksiran, maka ambillah dan sisakanlah sepertiganya. Jika kalian tidak meninggalkan sepertiganya -Syu'bah merasa ragu- maka tinggalkanlah seperempatnya.\""
            },
            {
                "number": 2361,
                "arab": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ قَالَ حَدَّثَنِي عَبْدُ الْجَلِيلِ بْنُ حُمَيْدٍ الْيَحْصَبِيُّ أَنَّ ابْنَ شِهَابٍ حَدَّثَهُ قَالَ حَدَّثَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍفِي الْآيَةِ الَّتِي قَالَ اللَّهُ عَزَّ وَجَلَّ{ وَلَا تَيَمَّمُوا الْخَبِيثَ مِنْهُ تُنْفِقُونَ }قَالَ هُوَ الْجُعْرُورُ وَلَوْنُ حُبَيْقٍ فَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُؤْخَذَ فِي الصَّدَقَةِ الرُّذَالَةُ",
                "id": "Telah mengabarkan kepada kami [Yunus bin 'Abdul A'la] dan [Al Harits bin Miskin] secara baca dan aku mendengarnya dari [Ibnu Wahb] dia berkata; telah menceritakan kepadaku ['Abdul Jalil bin Humaid Al Yahshabi] bahwasanya [Ibnu Syihab] menceritakan kepadanya, dia berkata; telah menceritakan kepadaku [Abu Umamah bin Sahl bin Hunaif] tentang ayat yang Allah -Azza wa Jalla- firmankan: \"Dan janganlah kamu memilih yang buruk-buruk lalu kamu menafkahkan daripadanya.\" Ia berkata; 'Yaitu kurma yang jelek dan warna yang tidak segar, Rasulullah shallallahu 'alaihi wasallam melarang diambilkan sesuatu yang hina (jelek, kasar, kualitas rendahan) pada zakat.'"
            },
            {
                "number": 2362,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا يَحْيَى عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ قَالَ حَدَّثَنِي صَالِحُ بْنُ أَبِي عَرِيبٍ عَنْ كَثِيرِ بْنِ مُرَّةَ الْخَضْرَمِيِّ عَنْ عَوْفِ بْنِ مَالِكٍ قَالَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِيَدِهِ عَصًا وَقَدْ عَلَّقَ رَجُلٌ قِنْوَ حَشَفٍ فَجَعَلَ يَطْعَنُ فِي ذَلِكَ الْقِنْوِ فَقَالَ لَوْ شَاءَ رَبُّ هَذِهِ الصَّدَقَةِ تَصَدَّقَ بِأَطْيَبَ مِنْ هَذَا إِنَّ رَبَّ هَذِهِ الصَّدَقَةِ يَأْكُلُ حَشَفًا يَوْمَ الْقِيَامَةِ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; Telah memberitakan kepada kami [Yahya] dari ['Abdul Hamid bin Ja'far] dia berkata; Telah menceritakan kepadaku [Shalih bin Abu 'Arib] dari [Katsir bin Murrah Al Khadrami] dari ['Auf bin Malik] dia berkata; Rasulullah shallallahu 'alaihi wasallam keluar dengan memegang tongkat dan seseorang telah menggantungkan ikatan kurma yang paling jelek, lalu beliau mencela ikatan tersebut, kemudian bersabda: \"Ohh, kalaulah saja pemilik zakat ini mengeluarkan zakat yang lebih baik dari ini…Oh, pemilik zakat ini akan memakan kurma yang paling jelek pada hari Kiamat.\""
            },
            {
                "number": 2363,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ الْأَخْنَسِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ اللُّقَطَةِ فَقَالَ مَا كَانَ فِي طَرِيقٍ مَأْتِيٍّ أَوْ فِي قَرْيَةٍ عَامِرَةٍ فَعَرِّفْهَا سَنَةً فَإِنْ جَاءَ صَاحِبُهَا وَإِلَّا فَلَكَ وَمَا لَمْ يَكُنْ فِي طَرِيقٍ مَأْتِيٍّ وَلَا فِي قَرْيَةٍ عَامِرَةٍ فَفِيهِ وَفِي الرِّكَازِ الْخُمْسُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari ['ubaidhullah bin Al Akhnas] dari [Amru bin Syuaib] dari [ayahnya] dari [kakeknya] dia berkata; Rasulullah shallallahu 'alaihi wasallam ditanya tentang barang temuan, beliau bersabda: \"Jika ia berada di jalan yang sering dilalui ataupun di desa yang ramai penduduknya maka umumkanlah selama setahun, barangkali pemiliknya datang namun jika tidak maka ia menjadi milikmu, dan jika tidak pada jalan yang dilalui atau tidak di desa yang ramai penduduknya maka di dalamnya atau pada harta karun zakatnya seperlima.\""
            },
            {
                "number": 2364,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ وَأَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعَجْمَاءُ جُرْحُهَا جُبَارٌ وَالْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمُسُأَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدٍ وَعُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ عَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam. Demikian juga diriwayatkan dari jalur lainnya, telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah memberitakan kepada kami [Abdul Razaq] berkata; Telah menceritakan kepada kami [Ma'mar] dari [Sa'id] dan [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Luka akibat binatang ternak tidak ada tanggungan -bagi pemiliknya-, sumur yang digali lalu menyebabkan orang lain tersungkur ke dalamnya tidak ada tanggungan -bagi pemiliknya-, tanah yang digali untuk mencari barang tambang lalu orang lain tersungkur ke dalamnya tidak ada tanggungan -bagi pemiliknya- dan pada harta karun zakatnya seperlima.\" Telah mengabarkan kepada kami [Yunus bin Abdul A'la] dia berkata; Telah menceritakan kepada kami [Ibnu Wahb] berkata; Telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Sa'id] dan [ubaidhullah bin Abdullah] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam seperti itu juga."
            },
            {
                "number": 2365,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدٍ وَأَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ جُرْحُ الْعَجْمَاءِ جُبَارٌ وَالْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمْسُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Ibnu Syihab] dari [Sa'id] dan [Abu Salamah] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kerusakan akibat binatang ternak tidak ada tanggungan -bagi pemiliknya-, sumur yang digali lalu menyebabkan orang lain tersungkur ke dalamnya tidak ada tanggungan -bagi pemiliknya-, tanah digali untuk mencari barang tambang lalu orang lain tersungkur ke dalamnya tidak ada tanggungan -bagi pemiliknya- dan pada harta karun zakatnya seperlima.\""
            },
            {
                "number": 2366,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هُشَيْمٌ أَنْبَأَنَا مَنْصُورٌ وَهِشَامٌ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبِئْرُ جُبَارٌ وَالْعَجْمَاءُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَفِي الرِّكَازِ الْخُمْسُ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Husyaim] telah memberitakan kepada kami [Manshur] dan [Hisyam] dari [Ibnu Sirin] dari [Abu Hurairah] radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sumur yang digali lalu menyebabkan orang lain tersungkur ke dalamnya tidak ada tanggungan -bagi pemiliknya-, kerusakan akibat binatang ternak tidak ada tanggungan -bagi pemiliknya-, tanah yang digali untuk mencari barang tambang lalu orang lain tersungkur ke dalamnya tidak ada tanggungan -bagi pemiliknya- dan pada harta karun zakatnya seperlima.\""
            },
            {
                "number": 2367,
                "arab": "أَخْبَرَنِي الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ عَنْ مُوسَى بْنِ أَعْيَنَ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَجَاءَ هِلَالٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعُشُورِ نَحْلٍ لَهُ وَسَأَلَهُ أَنْ يَحْمِيَ لَهُ وَادِيًا يُقَالُ لَهُ سَلَبَةُ فَحَمَى لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَلِكَ الْوَادِيَفَلَمَّا وَلِيَ عُمَرُ بْنُ الْخَطَّابِ كَتَبَ سُفْيَانُ بْنُ وَهْبٍ إِلَى عُمَرَ بْنِ الْخَطَّابِ يَسْأَلُهُ فَكَتَبَ عُمَرُ إِنْ أَدَّى إِلَيَّ مَا كَانَ يُؤَدِّي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عُشْرِ نَحْلِهِ فَاحْمِ لَهُ سَلَبَةَ ذَلِكَ وَإِلَّا فَإِنَّمَا هُوَ ذُبَابُ غَيْثٍ يَأْكُلُهُ مَنْ شَاءَ",
                "id": "Telah mengabarkan kepadaku [Al Mughirah bin 'Abdurrahman] dia berkata; Telah menceritakan kepada kami [Ahmad bin Abu Syu'aib] dari [Musa bin A'yan] dari ['Amr bin Al Harits] dari ['Amru bin Syuaib] dari [ayahnya] dari [kakeknya] ia berkata; \"Hilal datang menemui Rasulullah shallallahu 'alaihi wasallam dengan membawa sepersepuluh madunya dan meminta kepada beliau untuk menjaga lembah -yang dinamakan Salabah-, maka Rasulullah shallallahu 'alaihi wasallam menjaga lembah tersebut untuknya. Saat Umar bin Khaththab menjadi khalifah, Sufyan bin Wahb menulis surat kepada Umar menanyakan tentangnya, \" maka Umar menulis; 'Jika dia memberikan kepadaku zakat yang dahulu ia berikan kepada Rasulullah shallallahu 'alaihi wasallam berupa seperpuluh kurmanya, maka jagalah lebah Salabah tersebut untuknya. Jika tidak, maka itu hanyalah kurma yang mengikuti curah hujan dan yang dimakan oleh orang yang menginginkannya.\""
            },
            {
                "number": 2368,
                "arab": "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى عَنْ عَبْدِ الْوَارِثِ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَفَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ رَمَضَانَ عَلَى الْحُرِّ وَالْعَبْدِ وَالذَّكَرِ وَالْأُنْثَى صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ فَعَدَلَ النَّاسُ بِهِ نِصْفَ صَاعٍ مِنْ بُرٍّ",
                "id": "Telah mengabarkan kepada kami ['Imran bin Musa] dari ['Abdul Warits] dia berkata; Telah menceritakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu 'Umar] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mewajibkan zakat ramadhan atas orang merdeka, budak dan wanita sebesar satu sha' kurma atau satu sha' sya'ir (gandum), lalu orang-orang menyamakannya dengan setengah sha' burr (tepung).\""
            },
            {
                "number": 2369,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَفَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَقَةَ الْفِطْرِ عَلَى الذَّكَرِ وَالْأُنْثَى وَالْحُرِّ وَالْمَمْلُوكِ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ قَالَ فَعَدَلَ النَّاسُ إِلَى نِصْفِ صَاعٍ مِنْ بُرٍّ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; Telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Nafi'] dari [Ibnu 'Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam mewajibkan zakat fitrah atas laki-laki, wanita, orang merdeka dan budak sebesar satu sha' kurma atau satu sha' gandum.\" Ibnu Umar berkata; 'Lalu orang-orang menyamakannya dengan setengah sha' burr.'"
            },
            {
                "number": 2370,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَفَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ رَمَضَانَ عَلَى كُلِّ صَغِيرٍ وَكَبِيرٍ حُرٍّ وَعَبْدٍ ذَكَرٍ وَأُنْثَى صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; Telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Ibnu 'Umar] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mewajibkan zakat ramadhan atas setiap anak kecil dan orang tua, orang merdeka dan budak, laki-laki dan wanita sebesar satu sha' kurma atau satu sha' gandum.\""
            },
            {
                "number": 2371,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَضَ زَكَاةَ الْفِطْرِ مِنْ رَمَضَانَ عَلَى النَّاسِ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ عَلَى كُلِّ حُرٍّ أَوْ عَبْدٍ ذَكَرٍ أَوْ أُنْثَى مِنْ الْمُسْلِمِينَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] secara baca dan aku mendengarnya, lafazh ini miliknya, dari [Ibnul Qasim] dia berkata; Telah menceritakan kepadaku [Malik] dari [Nafi'] dari [Ibnu 'Umar] bahwa Rasulullah shallallahu 'alaihi wasallam mewajibkan zakat fitrah dari bulan ramadhan atas manusia sebesar satu sha' kurma atau satu sha' gandum, atas setiap orang merdeka atau budak, laki-laki atau wanita dari kaum muslimin."
            },
            {
                "number": 2372,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ مُحَمَّدِ بْنِ السَّكَنِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَهْضَمٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ عُمَرَ بْنِ نَافِعٍ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ قَالَفَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَكَاةَ الْفِطْرِ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ عَلَى الْحُرِّ وَالْعَبْدِ وَالذَّكَرِ وَالْأُنْثَى وَالصَّغِيرِ وَالْكَبِيرِ مِنْ الْمُسْلِمِينَ وَأَمَرَ بِهَا أَنْ تُؤَدَّى قَبْلَ خُرُوجِ النَّاسِ إِلَى الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Muhammad bin As Sakan] dia berkata; telah menceritakan kepada kami [Muhammad bin Jahdham] dia berkata; Telah menceritakan kepada kami [Isma'il bin Ja'far] dari ['Umar bin Nafi'] dari [bapaknya] dari [Ibnu 'Umar] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mewajibkan zakat fitrah sebesar satu sha' kurma atau satu sha' gandum atas orang merdeka dan budak, laki-laki dan wanita, anak kecil dan orang tua dari kaum muslimin dan memerintahkannya agar ditunaikan sebelum orang-orang berangkat melaksanakan sholat.\""
            },
            {
                "number": 2373,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عِيسَى قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَفَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَقَةَ الْفِطْرِ عَلَى الصَّغِيرِ وَالْكَبِيرِ وَالذَّكَرِ وَالْأُنْثَى وَالْحُرِّ وَالْعَبْدِ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami ['Isa] dia berkata; Telah menceritakan kepada kami ['Ubaidulah] dari [Nafi'] dari [Ibnu 'Umar] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mewajibkan zakat fitrah atas anak kecil dan orang tua, laki-laki dan wanita, orang merdeka dan budak sebesar satu sha' kurma atau satu sha' gandum.\""
            },
            {
                "number": 2374,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ عَنْ الْقَاسِمِ بْنِ مُخَيْمِرَةَ عَنْ عَمْرِو بْنِ شُرَحْبِيلَ عَنْ قَيْسِ بْنِ سَعْدِ بْنِ عُبَادَةَ قَالَكُنَّا نَصُومُ عَاشُورَاءَ وَنُؤَدِّي زَكَاةَ الْفِطْرِ فَلَمَّا نَزَلَ رَمَضَانُ وَنَزَلَتْ الزَّكَاةُ لَمْ نُؤْمَرْ بِهِ وَلَمْ نُنْهَ عَنْهُ وَكُنَّا نَفْعَلُهُ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; Telah menceritakan kepada kami [Yazid bin Zurai'] dia berkata; Telah memberitakan kepada kami [Syu'bah] dari [Al Hakim bin 'Utaibah] dari [Al Qasim bin Mukhaimirah] dari ['Amru bin Syurahbil] dari [Qais bin Saad bin Ubadah] dia berkata; \"Kami dahulu berpuasa 'Asyura dan menunaikan zakat fitrah. Setelah turun ayat tentang ramadhan dan kewajiban zakat, kami tidak diperintah menunaikannya dan tidak pula dilarang, namun kami terus melaksanakannya.\""
            },
            {
                "number": 2375,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ الْقَاسِمِ بْنِ مُخَيْمِرَةَ عَنْ أَبِي عَمَّارٍ الْهَمْدَانِيِّ عَنْ قَيْسِ بْنِ سَعْدٍ قَالَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِصَدَقَةِ الْفِطْرِ قَبْلَ أَنْ تَنْزِلَ الزَّكَاةُ فَلَمَّا نَزَلَتْ الزَّكَاةُ لَمْ يَأْمُرْنَا وَلَمْ يَنْهَنَا وَنَحْنُ نَفْعَلُهُقَالَ أَبُو عَبْد الرَّحْمَنِ أَبُو عَمَّارٍ اسْمُهُ عَرِيبُ بْنُ حُمَيْدٍ وَعَمْرُو بْنُ شُرَحْبِيلَ يُكْنَى أَبَا مَيْسَرَةَ وَسَلَمَةُ بْنُ كُهَيْلٍ خَالَفَ الْحَكَمَ فِي إِسْنَادِهِ وَالْحَكَمُ أَثْبَتُ مِنْ سَلَمَةَ بْنِ كُهَيْلٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Mubarak] dia berkata; Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Salamah bin Kuhail] dari [Al Qasim bin Mukhaimirah] dari [Abu 'Ammar Al Hamdani] dari [Qais bin Sa'd] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk menunaikan zakat fitrah sebelum turun ayat tentang kewajiban zakat. Setelah turun ayat tentang zakat, beliau tidak memerintahkan dan tidak melarangnya, namun kami terus melaksanakannya.\" Abdurrahman berkata; Abu 'Ammar namanya adalah 'Arib bin Humaid dan 'Amru bin Syurahbil biasa dipanggil dengan Abu Maisarah. Salamah bin kuhail menyelisihi Al Hakam di dalam sanadnya, dan Al Hakam lebih kuat dibanding Salamah bin Kuhail."
            },
            {
                "number": 2376,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا خَالِدٌ وَهُوَ ابْنُ الْحَارِثِ قَالَ حَدَّثَنَا حُمَيْدٌ عَنْ الْحَسَنِ قَالَ قَالَ ابْنُ عَبَّاسٍ وَهُوَ أَمِيرُ الْبَصْرَةِفِي آخِرِ الشَّهْرِ أَخْرِجُوا زَكَاةَ صَوْمِكُمْ فَنَظَرَ النَّاسُ بَعْضُهُمْ إِلَى بَعْضٍ فَقَالَ مَنْ هَاهُنَا مِنْ أَهْلِ الْمَدِينَةِ قُومُوا فَعَلِّمُوا إِخْوَانَكُمْ فَإِنَّهُمْ لَا يَعْلَمُونَ أَنَّ هَذِهِ الزَّكَاةَ فَرَضَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى كُلِّ ذَكَرٍ وَأُنْثَى حُرٍّ وَمَمْلُوكٍ صَاعًا مِنْ شَعِيرٍ أَوْ تَمْرٍ أَوْ نِصْفَ صَاعٍ مِنْ قَمْحٍ فَقَامُواخَالَفَهُ هِشَامٌ فَقَالَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; Telah menceritakan kepada kami [Khalid bin Al Harits] dia berkata; Telah menceritakan kepada kami [Humaid] dari [Al Hasan] dia berkata; Pada akhir bulan [Ibnu 'Abbas] -yang waktu itu dia memimpin kota Bashrah- berkata; \"Keluarkanlah zakat puasa kalian!\". Orang-orang pun saling memandang satu sama lainnya, Ibnu Abbas melanjutkan; 'Adakah disini penduduk Madinah, berdirilah kalian dan beritahukanlah kepada sahabat-sahabat kalian karena mereka tidak mengetahui bahwa zakat ini adalah zakat yang diwajibkan Rasulullah shallallahu 'alaihi wasallam kepada setiap laki-laki maupun perempuan, orang merdeka ataupun budak, satu sha' gandum atau kurma, atau setengah sha' tepung, maka tunaikanlah. Hisyam menyelisihinya, dia berkata; 'Dari Muhammad bin Sirin.'"
            },
            {
                "number": 2377,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ مَيْمُونٍ عَنْ مَخْلَدٍ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ عَنْ ابْنِ عَبَّاسٍ قَالَذَكَرَ فِي صَدَقَةِ الْفِطْرِ قَالَ صَاعًا مِنْ بُرٍّ أَوْ صَاعًا مِنْ تَمْرِ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ سُلْتٍ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Maimun] dari [Makhlad] dari [Hisyam] dari [Ibnu Sirin] dari [Ibnu 'Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam menyebutkan zakat fitrah beliau bersabda; 'Satu sha', tepung atau kurma atau gandum atau sejenis gandum -yang berwarna putih tak berkulit-.\""
            },
            {
                "number": 2378,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ أَبِي رَجَاءٍ قَالَسَمِعْتُ ابْنَ عَبَّاسٍ يَخْطُبُ عَلَى مِنْبَرِكُمْ يَعْنِي مِنْبَرَ الْبَصْرَةِ يَقُولُ صَدَقَةُ الْفِطْرِ صَاعٌ مِنْ طَعَامٍقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا أَثْبَتُ الثَّلَاثَةِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; Telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Abu Raja'] dia berkata; \"Aku mendengar [Ibnu 'Abbas] berkhutbah di atas mimbar kalian -yaitu mimbar Bashrah- mengatakan; 'Zakat fitrah sebesar satu sha' makanan'.\" Abu Abdurrahman berkata; 'Hadits ini lebih kuat dari ketiga Hadits lainnya.'"
            },
            {
                "number": 2379,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ حَرْبٍ قَالَ حَدَّثَنَا مُحْرِزُ بْنُ الْوَضَّاحِ عَنْ إِسْمَعِيلَ وَهُوَ ابْنُ أُمَيَّةَ عَنْ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي ذُبَابٍ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي سَرْحٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَفَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَقَةَ الْفِطْرِ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ أَقِطٍ",
                "id": "Telah mengabarkan kepadaku [Muhammad bin 'Ali bin Harb] dia berkata; Telah menceritakan kepada kami [Muhriz bin Al Wadhdhah] dari [Isma'il bin Umayyah] dari [Al Harits bin 'Abdurrahman bin Abu Dzubab] dari ['Iyadl bin 'Abdullah bin Abu Sarh] dari [Abu Sa'id Al Khudri] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mewajibkan zakat fitrah sebesar satu sha' gandum, satu sha' kurma atau satu sha' susu kering.\""
            },
            {
                "number": 2380,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي سَرْحٍ عَنْ أَبِي سَعِيدٍ قَالَكُنَّا نُخْرِجُ زَكَاةَ الْفِطْرِ إِذْ كَانَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَاعًا مِنْ طَعَامٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ زَبِيبٍ أَوْ صَاعًا مِنْ أَقِطٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Mubarak] dia berkata; Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Zaid bin Aslam] dari ['Iyadh bin 'Abdullah bin Abu Sarh] dari [Abu Sa'id] dia berkata; \"Kami mengeluarkan zakat fitrah ketika Rasulullah shallallahu 'alaihi wasallam masih ada di antara kami sebesar satu sha' makanan, satu sha' gandum, satu sha' kurma, satu sha'anggur kering atau satu sha' susu kering.\""
            },
            {
                "number": 2381,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ وَكِيعٍ عَنْ دَاوُدَ بْنِ قَيْسٍ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ قَالَكُنَّا نُخْرِجُ صَدَقَةَ الْفِطْرِ إِذْ كَانَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَاعًا مِنْ طَعَامٍ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ أَقِطٍ فَلَمْ نَزَلْ كَذَلِكَ حَتَّى قَدِمَ مُعَاوِيَةُ مِنْ الشَّامِ وَكَانَ فِيمَا عَلَّمَ النَّاسَ أَنَّهُ قَالَ مَا أَرَى مُدَّيْنِ مِنْ سَمْرَاءِ الشَّامِ إِلَّا تَعْدِلُ صَاعًا مِنْ هَذَا قَالَ فَأَخَذَ النَّاسُ بِذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Hannad bin As Sariy] dari [Waki'] dari [Dawud bin Qais] dari ['Iyadh bin 'Abdullah] dari [Abu Sa'id] dia berkata; \"Kami mengeluarkan zakat fitrah ketika Rasulullah shallallahu 'alaihi wasallam masih ada di antara kami sebesar satu sha' makanan, satu sha' kurma, satu sha' gandum atau satu sha' susu kering. Kami terus melaksanakan seperti itu hingga Mu'awiyah datang dari Syam. Dan di antara yang ia ajarkan kepada orang-orang adalah: Ia berkata; \"Kami tidak melihat dua mud gandum Syam kecuali menyamai satu sha' dari ini.\" Abu Sa'id berkata; 'Maka orang-orang mengambil pendapat tersebut'."
            },
            {
                "number": 2382,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ عَجْلَانَ قَالَ سَمِعْتُ عِيَاضَ بْنَ عَبْدِ اللَّهِ يُخْبِرُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَلَمْ نُخْرِجْ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ زَبِيبٍ أَوْ صَاعًا مِنْ دَقِيقٍ أَوْ صَاعًا مِنْ أَقِطٍ أَوْ صَاعًا مِنْ سُلْتٍ ثُمَّ شَكَّ سُفْيَانُ فَقَالَ دَقِيقٍ أَوْ سُلْتٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dia berkata; Telah menceritakan kepada kami [Sufyan] dari [Ibnu 'Ajlan] dia berkata; Aku mendengar ['Iyadh bin 'Abdullah] mengabarkan dari [Abu Sa'id Al Khudri] dia berkata; \"Kami tidak pernah mengeluarkan zakat fitrah di zaman Rasulullah shallallahu 'alaihi wasallam kecuali satu sha' kurma, satu sha' gandum, satu sha' anggur kering, satu sha' tepung, satu sha' susu kering atau satu sha' sejenis gandum -yang berwarna putih tak berkulit-.\""
            },
            {
                "number": 2383,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ حَدَّثَنَا حُمَيْدٌ عَنْ الْحَسَنِ أَنَّ ابْنَ عَبَّاسٍخَطَبَ بِالْبَصْرَةِ فَقَالَ أَدُّوا زَكَاةَ صَوْمِكُمْ فَجَعَلَ النَّاسُ يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ فَقَالَ مَنْ هَاهُنَا مِنْ أَهْلِ الْمَدِينَةِ قُومُوا إِلَى إِخْوَانِكُمْ فَعَلِّمُوهُمْ فَإِنَّهُمْ لَا يَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَضَ صَدَقَةَ الْفِطْرِ عَلَى الصَّغِيرِ وَالْكَبِيرِ وَالْحُرِّ وَالْعَبْدِ وَالذَّكَرِ وَالْأُنْثَى نِصْفَ صَاعِ بُرٍّ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ شَعِيرٍقَالَ الْحَسَنُ فَقَالَ عَلِيٌّ أَمَّا إِذَا أَوْسَعَ اللَّهُ فَأَوْسِعُوا أَعْطُوا صَاعًا مِنْ بُرٍّ أَوْ غَيْرِهِ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; Telah menceritakan kepada kami [Yazid bin Harun] dia berkata; Telah menceritakan kepada kami [Humaid] dari [Al Hasan] bahwasanya [Ibnu 'Abbas] berkhutbah di Bashrah dia berkata; \"Tunaikanlah zakat puasa kalian!\". Orang-orangpun saling memandang satu sama lainnya, Ibnu Abbas melanjutkan; 'Adakah disini penduduk Madinah?, berdirilah kalian dan beritahukanlah kepada sahabat-sahabat kalian karena mereka tidak mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam telah mewajibkan zakat fitrah kepada yang kecil maupun yang dewasa, orang merdeka ataupun budak, laki-laki maupun perempuan setengah sha' tepung atau satu sha' kurma, atau gandum. Al Hasan berkata; Ali berkata; 'Adapun Jika Allah melapangkan kalian, berbuat lapangkanlah kalian, keluarkanlah satu sha' tepung atau yang lainnya.'"
            },
            {
                "number": 2384,
                "arab": "أَخْبَرَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا حُسَيْنٌ عَنْ زَائِدَةَ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي رَوَّادٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ النَّاسُ يُخْرِجُونَ عَنْ صَدَقَةِ الْفِطْرِ فِي عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَاعًا مِنْ شَعِيرٍ أَوْ تَمْرٍ أَوْ سُلْتٍ أَوْ زَبِيبٍ",
                "id": "Telah mengabarkan kepada kami [Musa bin 'Abdurrahman] dia berkata; Telah menceritakan kepada kami [Husain] dari [Zaidah] dia berkata; Telah menceritakan kepada kami ['Abdul 'Aziz bin Abu Rawwad] dari [Nafi'] dari [Ibnu 'Umar] dia berkata; \"Dahulu orang-orang mengeluarkan zakat fitrah di zaman Nabi shallallahu 'alaihi wasallam sebesar satu sha' gandum, kurma, atau sejenis gandum -yang berwarna putih tak berkulit- atau anggur kering.\""
            }
        ]
    }
}