{
    "status": true,
    "data": {
        "start": 3875,
        "end": 4023,
        "total": 149,
        "book": "nasai",
        "hadits": [
            {
                "number": 3875,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ عَنْ يُونُسَ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ قَالَ جَرِيرٌبَايَعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ وَأَنْ أَنْصَحَ لِكُلِّ مُسْلِمٍ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim], ia berkata; telah menceritakan kepada kami [Ibnu Ulayyah] dari [Yunus] dari ['Amr bin Sa'id] dari [Abu Zur'ah bin 'Amr bin Jarir], [Jarir] berkata; saya membaiat Nabi shallallahu 'alaihi wasallam untuk mendengar dan mentaati dan menasehati setiap muslim. "
            },
            {
                "number": 3876,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ سَمِعَ جَابِرًا يَقُولُلَمْ نُبَايِعْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمَوْتِ إِنَّمَا بَايَعْنَاهُ عَلَى أَنْ لَا نَفِرَّ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Abu Az Zubair], ia mendengar [Jabir] berkata; kami tidak membait Rasulullah shallallahu 'alaihi wasallam untuk mati, sesungguhnya kami membaiat beliau untuk tidak lari dari perang. "
            },
            {
                "number": 3877,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ قَالَ قُلْتُ لِسَلَمَةَ بْنِ الْأَكْوَعِعَلَى أَيِّ شَيْءٍ بَايَعْتُمْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْحُدَيْبِيَةِ قَالَ عَلَى الْمَوْتِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Hatim bin Isma'il] dari [Yazid bin Abu 'Ubaid], ia berkata; saya berkata kepada [Salamah bin Al Akwa']; untuk sesuatu apakah kalian membaiat Nabi shallallahu 'alaihi wasallam pada hari di Hudaibiyah? Ia berkata; untuk mati. "
            },
            {
                "number": 3878,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ ابْنِ شِهَابٍ أَنَّ عَمْرَو بْنَ عَبْدِ الرَّحْمَنِ بْنِ أُمَيَّةَ ابْنَ أَخِي يَعْلَى بْنِ أُمَيَّةَ حَدَّثَهُ أَنَّ أَبَاهُ أَخْبَرَهُ أَنَّ يَعْلَى بْنَ أُمَيَّةَ قَالَجِئْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَبِي أُمَيَّةَ يَوْمَ الْفَتْحِ فَقُلْتُ يَا رَسُولَ اللَّهِ بَايِعْ أَبِي عَلَى الْهِجْرَةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُبَايِعُهُ عَلَى الْجِهَادِ وَقَدْ انْقَطَعَتْ الْهِجْرَةُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin 'Amr bin As Sarh], ia berkata; telah menceritakan kepada kami [Ibnu Wahb], ia berkata; telah mengabarkan kepadaku ['Amr bin Al Harits] dari [Ibnu Syihab] bahwa ['Amr bin Abdurrahman bin Umayyah] anak saudara Ya'la bin Umayyah bahwa [ayahnya] mengabarkan kepadanya bahwa [Ya'la bin Umayyah] berkata; aku mendatangi Rasulullah shallallahu 'alaihi wasallam bersama Abu Umayyah ketika hari penaklukan Mekkah lalu aku berkata; wahai Rasulullah baitlah ayahku berhijrah, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku membaitnya untuk berjihad karena hijrah telah terputus.\""
            },
            {
                "number": 3879,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ قَالَ حَدَّثَنِي عَمِّي قَالَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي أَبُو إِدْرِيسَ الْخَوْلَانِيُّ أَنَّ عُبَادَةَ بْنَ الصَّامِتِ قَالَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَحَوْلَهُ عِصَابَةٌ مِنْ أَصْحَابِهِ تُبَايِعُونِي عَلَى أَنْ لَا تُشْرِكُوا بِاللَّهِ شَيْئًا وَلَا تَسْرِقُوا وَلَا تَزْنُوا وَلَا تَقْتُلُوا أَوْلَادَكُمْ وَلَا تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ وَلَا تَعْصُونِي فِي مَعْرُوفٍ فَمَنْ وَفَّى فَأَجْرُهُ عَلَى اللَّهِ وَمَنْ أَصَابَ مِنْكُمْ شَيْئًا فَعُوقِبَ بِهِ فَهُوَ لَهُ كَفَّارَةٌ وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا ثُمَّ سَتَرَهُ اللَّهُ فَأَمْرُهُ إِلَى اللَّهِ إِنْ شَاءَ عَفَا عَنْهُ وَإِنْ شَاءَ عَاقَبَهُخَالَفَهُ أَحْمَدُ بْنُ سَعِيدٍ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'd bin Ibrahim bin Sa'd], ia berkata; telah menceritakan kepadaku [pamanku], ia berkata; telah menceritakan kepada kami [ayahku] dari [Shalih] dari [Ibnu Syihab], ia berkata; telah menceritakan kepadaku [Abu Idris Al Khaulani] bahwa ['Ubadah bin Ash Shamit] berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda dan disekitarnya terdapat beberapa orang sahabatnya: \"Apakah kalian membaitku untuk tidka mensekutukan Sesuatu dengan Allah, tidak mencuri, tidak berzina tidak membunuh anak kalian, tidak berbuat dusta yang mereka ada-adakan antara tangan dan kaki kalian, tidak mendurhakaiku dalam perkara yang ma'ruf. Dan barang siapa yang melakukan sebagian dari hal tersebut kemudian Allah menutupinya maka perkaranya kembali kepada Allah, apabila Allah menghendaki maka Allah memaafkannya dan apabila Allah menghendaki maka Allah menghukumnya.\" Ahmad bin Sa'id menyelisihi hal tersebut. "
            },
            {
                "number": 3880,
                "arab": "أَخْبَرَنِي أَحْمَدُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنَا أَبِي عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ الْحَارِثِ بْنِ فُضَيْلٍ أَنَّ ابْنَ شِهَابٍ حَدَّثَهُ عَنْ عُبَادَةَ بْنِ الصَّامِتِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَا تُبَايِعُونِي عَلَى مَا بَايَعَ عَلَيْهِ النِّسَاءُ أَنْ لَا تُشْرِكُوا بِاللَّهِ شَيْئًا وَلَا تَسْرِقُوا وَلَا تَزْنُوا وَلَا تَقْتُلُوا أَوْلَادَكُمْ وَلَا تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ وَلَا تَعْصُونِي فِي مَعْرُوفٍ قُلْنَا بَلَى يَا رَسُولَ اللَّهِ فَبَايَعْنَاهُ عَلَى ذَلِكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَنْ أَصَابَ بَعْدَ ذَلِكَ شَيْئًا فَنَالَتْهُ عُقُوبَةٌ فَهُوَ كَفَّارَةٌ وَمَنْ لَمْ تَنَلْهُ عُقُوبَةٌ فَأَمْرُهُ إِلَى اللَّهِ إِنْ شَاءَ غَفَرَ لَهُ وَإِنْ شَاءَ عَاقَبَهُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sa'id], ia berkata; telah menceritakan kepada kami [Ya'qub], ia berkata; telah menceritakan kepada kami [ayahku] dari [Shaleh bin Kaisan] dari [Al Harits bin Fudhail] bahwa [Ibnu Syihab] menceritakan kepadanya dari ['Ubadah bin Ash Shamit] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidakkah kalian membaitku sebagaimana para wanita membaitku, agar tidak akan menyekutukan Allah, tidak akan mencuri, tidak akan berzina, tidak akan membunuh anak-anak kalian, tidak akan berbuat dusta yang kalian ada-adakan antara tangan dan kaki kalian dan tidak akan mendurhakaiku dalam urusan yang baik.\" Maka kami mengatakan; ya, wahai Rasulullah. Kemudian kami membait beliau untuk hal tersebut. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang setelah itu melakukan sesuatu kemudian mendapatkan hukuman maka hal tersebut merupakan kafarah, dan barang siapa yang belum mendapatkan hukuman maka urusannya kembali kepada Allah, apabila Allah menghendaki maka Allah akan mengampuninya dan apabila Allah menghendaki maka Allah menghukumnya.\" "
            },
            {
                "number": 3881,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي جِئْتُ أُبَايِعُكَ عَلَى الْهِجْرَةِ وَلَقَدْ تَرَكْتُ أَبَوَيَّ يَبْكِيَانِ قَالَ ارْجِعْ إِلَيْهِمَا فَأَضْحِكْهُمَا كَمَا أَبْكَيْتَهُمَا",
                "id": "Telah mengabarkan kepada kami [Yahya bin Habib bin 'Arabi], ia berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari ['Atho` bin As Saib] dari [ayahnya] dari [Abdullah bin 'Amr] bahwa seseorang datang kepada Nabi shallallahu 'alaihi wasallam kemudian berkata; saya datang berbaiat kepadamu untuk berhijrah dan sungguh saya telah meninggalkan kedua orangtuaku yang menangis, beliau bersabda: \"Kembalilah kepada keduanya buatlah mereka tertawa seperti engkau membuat mereka menangis.\""
            },
            {
                "number": 3882,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي سَعِيدٍأَنَّ أَعْرَابِيًّا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْهِجْرَةِ فَقَالَ وَيْحَكَ إِنَّ شَأْنَ الْهِجْرَةِ شَدِيدٌ فَهَلْ لَكَ مِنْ إِبِلٍ قَالَ نَعَمْ قَالَ فَهَلْ تُؤَدِّي صَدَقَتَهَا قَالَ نَعَمْ قَالَ فَاعْمَلْ مِنْ وَرَاءِ الْبِحَارِ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ لَنْ يَتِرَكَ مِنْ عَمَلِكَ شَيْئًا",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Huraits], ia berkata; telah menceritakan kepada kami [Al Walid bin Muslim], ia berkata; telah menceritakan kepada kami [Al Auza'i] dari [Az Zuhri] dari ['Atho` bin Yazid Al Laitsi] dari [Abu Sa'id] bahwa Seorang badui bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hijrah, kemudian beliau bersabda: \"Sesungguhnya perkara hijrah sangatlah keras, apakah engkau memiliki onta?\" Ia berkata; ya. beliau bersabda: \"Apakah engkau telah menunaikan sedekah?\" Ia berkata; ya. beliau bersabda: \"Beramallah dibalik lautan sesungguhnya Allah 'azza wajalla tidak akan meninggalkan sesuatupun dari amalanmu.\""
            },
            {
                "number": 3883,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَيُّ الْهِجْرَةِ أَفْضَلُ قَالَ أَنْ تَهْجُرَ مَا كَرِهَ رَبُّكَ عَزَّ وَجَلَّ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْهِجْرَةُ هِجْرَتَانِ هِجْرَةُ الْحَاضِرِ وَهِجْرَةُ الْبَادِي فَأَمَّا الْبَادِي فَيُجِيبُ إِذَا دُعِيَ وَيُطِيعُ إِذَا أُمِرَ وَأَمَّا الْحَاضِرُ فَهُوَ أَعْظَمُهُمَا بَلِيَّةً وَأَعْظَمُهُمَا أَجْرًا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah bin Al Hakam], ia berkata; telah menceritakan kepada kami [Muhammad bin Ja'far], ia berkata; telah menceritakan kepada kami [Syu'bah] dari ['Amr bin Murrah] dari [Abdullah bin Al Harits] dari [Abu Katsir] dari [Abdullah bin 'Amr], ia berkata; seseorang berkata; wahai Rasulullah; hijrah apa yang paling utama, beliau menjawab: \"Engkau meninggalkan apa yang Tuhanmu Azza wa jalla benci, \" dan Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hijrah itu ada dua yaitu hijrah orang yang hadir dan yang tinggal di pelosok, adapun yang tinggal di pelosok maka ia akan menjawab jika diseru, ia akan taat jika diperintah, sedangkan hijrah orang yang hadir maka hal itu Adalah yang paling besar cobaan dan pahalanya.\""
            },
            {
                "number": 3884,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا مُبَشِّرُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا سُفْيَانُ بْنُ حُسَيْنٍ عَنْ يَعْلَى بْنِ مُسْلِمٍ عَنْ جَابِرِ بْنِ زَيْدٍ قَالَ قَالَ ابْنُ عَبَّاسٍإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ كَانُوا مِنْ الْمُهَاجِرِينَ لِأَنَّهُمْ هَجَرُوا الْمُشْرِكِينَ وَكَانَ مِنْ الْأَنْصَارِ مُهَاجِرُونَ لِأَنَّ الْمَدِينَةَ كَانَتْ دَارَ شِرْكٍ فَجَاءُوا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ الْعَقَبَةِ",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Manshur], ia berkata; telah menceritakan kepada kami [Mubasysyir bin Abdullah], ia berkata; telah menceritakan kepada kami [Sufyan bin Husain] dari [Ya'la bin Muslim] dari [Jabir bin Zaid], ia berkata; [Ibnu Abbas] berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam, Abu Bakar dan Umar adalah termasuk kaum Muhajirin karena mereka meninggalkan kaum musyrikin, dan diantara kaum Anshar ada kaum Muhajirin karena Madinah dahulu adalah wilayah syirik, lalu mereka menemui Rasulullah shallallahu 'alaihi wasallam ketika malam Aqobah."
            },
            {
                "number": 3885,
                "arab": "أَخْبَرَنِي هَارُونُ بْنُ مُحَمَّدِ بْنِ بَكَّارِ بْنِ بِلَالٍ عَنْ مُحَمَّدٍ وَهُوَ ابْنُ عِيسَى بْنِ سُمَيْعٍ قَالَ حَدَّثَنَا زَيْدُ بْنُ وَاقِدٍ عَنْ كَثِيرِ بْنِ مُرَّةَ أَنَّ أَبَا فَاطِمَةَ حَدَّثَهُأَنَّهُ قَالَ يَا رَسُولَ اللَّهِ حَدِّثْنِي بِعَمَلٍ أَسْتَقِيمُ عَلَيْهِ وَأَعْمَلُهُ قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْكَ بِالْهِجْرَةِ فَإِنَّهُ لَا مِثْلَ لَهَا",
                "id": "Telah mengabarkan kepada kami [Harun bin Muhammad bin Bakkar bin Bilal] dari [Muhammad yaitu Ibnu Isa bin Sumai'], ia berkata; telah menceritakan kepada kami [Zaid bin Waqid] dari [Katsir bin Marrah] bahwa [Abu Fathimah] telah menceritakan bahwa ia berkata; wahai Rasulullah, beritahukan kepadaku suatu amalan yang aku bisa beristiqomah dalam mengamalkannya, Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Hendaknya engkau hijrah karena sesungguhnya tidak ada yang menyamainya.\""
            },
            {
                "number": 3886,
                "arab": "أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ عَنْ عَمْرِو بْنِ عَبْدِ الرَّحْمَنِ بْنِ أُمَيَّةَ أَنَّ أَبَاهُ أَخْبَرَهُ أَنَّ يَعْلَى قَالَجِئْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَبِي يَوْمَ الْفَتْحِ فَقُلْتُ يَا رَسُولَ اللَّهِ بَايِعْ أَبِي عَلَى الْهِجْرَةِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُبَايِعُهُ عَلَى الْجِهَادِ وَقَدْ انْقَطَعَتْ الْهِجْرَةُ",
                "id": "Telah mengabarkan kepada kami [Abdul Malik bin Syu'aib bin Al Laits] dari [ayahnya] dari [kakeknya], ia berkata; telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab] dari ['Amr bin Abdurrahman bin Umayyah] bahwa [ayahnya] telah memberitakan kepadanya bahwa [Ya'la] berkata; saya datang kepada Rasulullah shallallahu 'alaihi wasallam bersama ayahku pada saat penaklukan Mekkah kemudian saya katakan; wahai Rasulullah baitlah ayahku untuk berhijrah! Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya baiat dia untuk berhijrah Karena hijrah telah terputus.\""
            },
            {
                "number": 3887,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ دَاوُدَ قَالَ حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ قَالَ حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ صَفْوَانَ بْنِ أُمَيَّةَ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّهُمْ يَقُولُونَ إِنَّ الْجَنَّةَ لَا يَدْخُلُهَا إِلَّا مُهَاجِرٌ قَالَ لَا هِجْرَةَ بَعْدَ فَتْحِ مَكَّةَ وَلَكِنْ جِهَادٌ وَنِيَّةٌ فَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا",
                "id": "Telah mengabarkan kepadaku [Muhammad bin Daud], ia berkata; telah menceritakan kepada kami [Mu'alla bin Asad], ia berkata; telah menceritakan kepada kami [Wuhaib bin Khalid] dari [Abdullah bin Thawus] dari [ayahnya] dari [Shofwan bin Umayyah] ia berkata; saya berkata; wahai Rasulullah sungguh mereka mengatakan; sesungguhnya Surga tidak ada yang memasukinya kecuali orang Muhajir, beliau bersabda \"Tidak ada hijrah setelah penaklukan Mekkah namun hanya jihad dan niat, jika kalian diperintah untuk berangkat berjihad maka berangkatlah.\""
            },
            {
                "number": 3888,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ قَالَ حَدَّثَنِي مَنْصُورٌ عَنْ مُجَاهِدٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ لَا هِجْرَةَ وَلَكِنْ جِهَادٌ وَنِيَّةٌ فَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur], ia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan], ia berkata; telah menceritakan kepadaku [Manshur] dari [Mujahid] dari [Thawus] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda pada saat penaklukan Mekkah: \"Tidak ada hijrah, akan tetapi jihad dan niat. Apabila kalian diperintah untuk berangkat berjihad maka berangkatlah.\""
            },
            {
                "number": 3889,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ عَنْ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ يَحْيَى بْنِ هَانِئٍ عَنْ نُعَيْمِ بْنِ دَجَاجَةَ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُلَا هِجْرَةَ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali] dari [Abdurrahman], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Yahya bin Hani`] dari [Nu'aim bin Dajajah] ia berkata; saya mendengar [Umar bin Khathab] berkata; tidak ada hijrah setelah wafatnya Rasulullah shallallahu 'alaihi wasallam."
            },
            {
                "number": 3890,
                "arab": "أَخْبَرَنَا عِيسَى بْنُ مُسَاوِرٍ قَالَ حَدَّثَنَا الْوَلِيدُ عَنْ عَبْدِ اللَّهِ بْنِ الْعَلَاءِ بْنِ زَبْرٍ عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ وَقْدَانَ السَّعْدِيِّ قَالَوَفَدْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي وَفْدٍ كُلُّنَا يَطْلُبُ حَاجَةً وَكُنْتُ آخِرَهُمْ دُخُولًا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي تَرَكْتُ مَنْ خَلْفِي وَهُمْ يَزْعُمُونَ أَنَّ الْهِجْرَةَ قَدْ انْقَطَعَتْ قَالَ لَا تَنْقَطِعُ الْهِجْرَةُ مَا قُوتِلَ الْكُفَّارُ",
                "id": "Telah mengabarkan kepada kami [Isa bin Musawir], ia berkata; telah menceritakan kepada kami [Al Walid] dari [Abdullah bin Al 'Ala` bin Zabr] dari [Busr bin 'ubaidhullah] dari [Abu Idris Al Khaulani] dari [Abdullah bin Waqdan As Sa'dan As Sa'di], ia berkata; saya menjadi utusan kepada Rasulullah shallallahu 'alaihi wasallam dalam sekelompok utusan yang semuanya menuntut suatu kebutuhan, dan saya adalah orang terakhir yang menemui Rasulullah shallallahu 'alaihi wasallam, kemudian saya katakan; wahai Rasulullah, sesungguhnya saya meninggalkan orang-orang di belakangku dan mereka mengklaim bahwa hijrah telah terputus. beliau bersabda: \" Hijrah tidak terputus selama orang-orang kafir masih diperangi.\""
            },
            {
                "number": 3891,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلَاءِ بْنِ زَبْرٍ قَالَ حَدَّثَنِي بُسْرُ بْنُ عُبَيْدِ اللَّهِ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ حَسَّانَ بْنِ عَبْدِ اللَّهِ الضَّمْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ السَّعْدِيِّ قَالَوَفَدْنَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَخَلَ أَصْحَابِي فَقَضَى حَاجَتَهُمْ وَكُنْتُ آخِرَهُمْ دُخُولًا فَقَالَ حَاجَتُكَ فَقُلْتُ يَا رَسُولَ اللَّهِ مَتَى تَنْقَطِعُ الْهِجْرَةُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَنْقَطِعُ الْهِجْرَةُ مَا قُوتِلَ الْكُفَّارُ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Khalid], ia berkata; telah menceritakan kepada kami [Marwan bin Muhammad], ia berkata; telah menceritakan kepada kami [Abdullah bin Al 'Ala`bin Zubr], ia berkata; telah menceritakan kepadaku [Busr bin 'ubaidhullah] dari [Abu Idris Al Khaulani] dari [Hassan bin Abdullah Adh Dhamri] dari [Abdullah bin As Sa'di], ia berkata; kami menjadi utusan kepada Rasulullah shallallahu 'alaihi wasallam kemudian para sahabatku menemui Rasulullah shallallahu 'alaihi wasallam dan menunaikan keperluannya, sedangkan saya adalah orang yang terakhir masuknya. Kemudian beliau bersabda: \"Apakah keperluanmu?\" Saya katakan; wahai Rasulullah, kapankah hijrah terputus? Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hijrah tidak terputus selama orang-orang kafir masih diperangi.\" "
            },
            {
                "number": 3892,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ عَنْ جَرِيرٍ عَنْ مُغِيرَةَ عَنْ أَبِي وَائِلٍ وَالشَّعْبِيِّ قَالَا قَالَ جَرِيرٌأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ لَهُ أُبَايِعُكَ عَلَى السَّمْعِ وَالطَّاعَةِ فِيمَا أَحْبَبْتُ وَفِيمَا كَرِهْتُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَ تَسْتَطِيعُ ذَلِكَ يَا جَرِيرُ أَوَ تُطِيقُ ذَلِكَ قَالَ قُلْ فِيمَا اسْتَطَعْتُ فَبَايَعَنِي وَالنُّصْحِ لِكُلِّ مُسْلِمٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Qudamah] dari [Jarir] dari [Mughirah] dari [Abu Wail] dan [Asy Sya'bi] mereka berkata; [Jarir] berkata; saya datang kepada Nabi shallallahu 'alaihi wasallam, dan berkata kepadanya; saya berbai'at kepadamu untuk mendengar dan taat dalam perkara yang saya senangi dan perkara yang saya benci. Nabi shallallahu 'alaihi wasallam bersabda: \" Apakah engkau mampu melakukan hal itu wahai Jarij?\" Beliau bersabda: \"Katakan dalam perkara yang saya mampu.\" Maka beliau membai'at saya untuk menasehati setiap muslim."
            },
            {
                "number": 3893,
                "arab": "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ عَنْ أَبِي وَائِلٍ عَنْ جَرِيرٍ قَالَبَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى إِقَامِ الصَّلَاةِ وَإِيتَاءِ الزَّكَاةِ وَالنُّصْحِ لِكُلِّ مُسْلِمٍ وَعَلَى فِرَاقِ الْمُشْرِكِأَخْبَرَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ مُحَمَّدٍ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ الرَّبِيعِ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ أَبِي نُخَيْلَةَ عَنْ جَرِيرٍ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ نَحْوَهُ",
                "id": "Telah mengabarkan kepada kami [Bisyr bin Khalid], ia berkata; telah menceritakan kepada kami [Ghundar] dari [Syu'bah] dari [Sulaiman] dari [Abu Wail] dari [Jarir], ia berkata; saya berbai'at kepada Rasulullah shallallahu 'alaihi wasallam untuk mendirikan sholat, membayar zakat dan menasehati setiap orang muslim, serta meninggalkan orang musyrik. Telah mengabarkan kepadaku [Muhammad bin Yahya bin Muhammad], Ia berkata; telah menceritakan kepada kami [Al Hasan bin Ar Rabi'], ia berkata; telah menceritakan kepada kami [Abu Al Ahwash] dari [Al A'masy] dari [Abu Wail] dari [Abu Nukhailah] dari [Jarir], ia berkata; saya datang kepada Rasulullah shallallahu 'alaihi wasallam...kemudian ia menyebutkan hadits seperti itu. "
            },
            {
                "number": 3894,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ أَبِي نُخَيْلَةَ الْبَجَلِيِّ قَالَ قَالَ جَرِيرٌأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُبَايِعُ فَقُلْتُ يَا رَسُولَ اللَّهِ ابْسُطْ يَدَكَ حَتَّى أُبَايِعَكَ وَاشْتَرِطْ عَلَيَّ فَأَنْتَ أَعْلَمُ قَالَ أُبَايِعُكَ عَلَى أَنْ تَعْبُدَ اللَّهَ وَتُقِيمَ الصَّلَاةَ وَتُؤْتِيَ الزَّكَاةَ وَتُنَاصِحَ الْمُسْلِمِينَ وَتُفَارِقَ الْمُشْرِكِينَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Qudamah], ia berkata; telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Abu Wail] dari [Abu Nukhailah Al Bajili], ia berkata; [Jarir] berkata; saya datang kepada Nabi shallallahu 'alaihi wasallam dan beliau sedang membai'at. Kemudian saya katakan; wahai Rasulullah, hamparkan tanganmu hingga saya berbai'at kepadamu dan memintalah syarat kepadaku, engkau lebih mengetahui. beliau bersabda: \" Saya bai'at engkau untuk beribadah kepada Allah, mendirikan sholat, menunaikan zakat, saling menasehati diantara orang-orang muslim, dan meninggalkan orang-orang musyrik.\""
            },
            {
                "number": 3895,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا غُنْدَرٌ قَالَ أَنْبَأَنَا مَعْمَرٌ قَالَ أَنْبَأَنَا ابْنُ شِهَابٍ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ قَالَ سَمِعْتُ عُبَادَةَ بْنَ الصَّامِتِ قَالَبَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَهْطٍ فَقَالَ أُبَايِعُكُمْ عَلَى أَنْ لَا تُشْرِكُوا بِاللَّهِ شَيْئًا وَلَا تَسْرِقُوا وَلَا تَزْنُوا وَلَا تَقْتُلُوا أَوْلَادَكُمْ وَلَا تَأْتُوا بِبُهْتَانٍ تَفْتَرُونَهُ بَيْنَ أَيْدِيكُمْ وَأَرْجُلِكُمْ وَلَا تَعْصُونِي فِي مَعْرُوفٍ فَمَنْ وَفَّى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَعُوقِبَ فِيهِ فَهُوَ طَهُورُهُ وَمَنْ سَتَرَهُ اللَّهُ فَذَاكَ إِلَى اللَّهِ إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ غَفَرَ لَهُ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim], ia berkata; telah menceritakan kepada kami telah menceritakan kepada kami [Ghundar], ia berkata; telah memberitakan kepada kami [Ma'mar], ia berkata; telah memberitakan kepada kami [Ibnu Syihab] dari [Abu Idris Al Khaulani], ia berkata; saya mendengar ['Ubadah bin Ash Shamit], ia berkata; saya membai'at Rasulullah shallallahu 'alaihi wasallam dalam sekelompok orang, kemudian beliau bersabda: \"Saya membai'at kalian untuk tidak mensekutukan Allah dengan sesuatu. Tidak mencuri, tidak berzina tidak membunuh anak-anak kalian tidak melakukan kedustaan yang kalian ada- adakan diantara ke dua tangannya di antara kedua tangan dan kaki kami dan tidak berbuat durha kepadaku dalam perkara yang baik, barang siapa diantara kalian menunaikannya maka pahala kepada Allah. Barang siapa yang melakukan sesuatu dari hal tersebut kemudian dihukum maka hal tersebut merupakan pencuci baginya, dan barang siapa Allah tutupi dirinya maka hal tersebut kembali kepada Allah, apabila Allah menghendaki maka Allah akan mengadzabnya dan apabila Allah menghendaki maka Allah mengampuninya.\" "
            },
            {
                "number": 3896,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أُمِّ عَطِيَّةَ قَالَتْلَمَّا أَرَدْتُ أَنْ أُبَايِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ امْرَأَةً أَسْعَدَتْنِي فِي الْجَاهِلِيَّةِ فَأَذْهَبُ فَأُسْعِدُهَا ثُمَّ أَجِيئُكَ فَأُبَايِعُكَ قَالَ اذْهَبِي فَأَسْعِدِيهَا قَالَتْ فَذَهَبْتُ فَسَاعَدْتُهَا ثُمَّ جِئْتُ فَبَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Ayyub] dari [Muhammad] dari [Ummu 'Athiyah], ia berkata; tatkala saya ingin membai'at Rasulullah shallallahu 'alaihi wasallam saya katakan; wahai Rasulullah, sesungguhnya terdapat seorang wanita yang membantuku melakukan ratapan pada masa jahiliyah lalu saya pergi untuk membantunya melakukan ratapan, kemudian saya datang kepadamu untuk berbai'at. Beliau bersabda: \"Pergilah dan bantulah dia melakukan ratapan.\" Kemudian saya pergi dan membantu melakukan ratapan kemudian saya datang dan membai'at Rasulullah shallallahu 'alaihi wasallam. "
            },
            {
                "number": 3897,
                "arab": "أَخْبَرَنَا الْحَسَنُ بْنُ أَحْمَدَ قَالَ حَدَّثَنَا أَبُو الرَّبِيعِ قَالَ أَنْبَأَنَا حَمَّادٌ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ مُحَمَّدٍ عَنْ أُمِّ عَطِيَّةَ قَالَتْأَخَذَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيْعَةَ عَلَى أَنْ لَا نَنُوحَ",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin Ahmad], ia berkata; telah menceritakan kepada kami [Abu Ar Rabi'], ia berkata; telah memberitakan kepada kami [Hammad], ia berkata; telah menceritakan kepada kami [Ayyub] dari [Muhammad] dari [Ummu 'Athiyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam mengambil bai'at dari kami agar tidak melakukan ratapan."
            },
            {
                "number": 3898,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ أُمَيْمَةَ بِنْتِ رُقَيْقَةَ أَنَّهَا قَالَتْأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نِسْوَةٍ مِنْ الْأَنْصَارِ نُبَايِعُهُ فَقُلْنَا يَا رَسُولَ اللَّهِ نُبَايِعُكَ عَلَى أَنْ لَا نُشْرِكَ بِاللَّهِ شَيْئًا وَلَا نَسْرِقَ وَلَا نَزْنِيَ وَلَا نَأْتِيَ بِبُهْتَانٍ نَفْتَرِيهِ بَيْنَ أَيْدِينَا وَأَرْجُلِنَا وَلَا نَعْصِيكَ فِي مَعْرُوفٍ قَالَ فِيمَا اسْتَطَعْتُنَّ وَأَطَقْتُنَّ قَالَتْ قُلْنَا اللَّهُ وَرَسُولُهُ أَرْحَمُ بِنَا هَلُمَّ نُبَايِعْكَ يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَا أُصَافِحُ النِّسَاءَ إِنَّمَا قَوْلِي لِمِائَةِ امْرَأَةٍ كَقَوْلِي لِامْرَأَةٍ وَاحِدَةٍ أَوْ مِثْلُ قَوْلِي لِامْرَأَةٍ وَاحِدَةٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar], ia berkata; telah menceritakan kepada kami [Abdurrahman], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Muhammad bin Al Munkadir] dari [Umaimah binti Ruqaiqah] bahwa ia berkata; saya datang kepada Nabi shallallahu 'alaihi wasallam diantara beberapa wanita Anshar, kami berbai'at kepadanya dan berkata; wahai Rasulullah, kami berbai'a kepadamu untuk tidak mensekutukan Allah dengan sesuatu, tidak mencuri, tidak berzina, tidak melakukan kedustaan yang diadakan diantara kedua tangan dan kaki kami, tidak mendurhakaimu dalam perkara yang baik. Beliau bersabda: \"Dalam perkara yang kalian mampu.\" Ia berkata; maka kami katakan; Allah dan RasulullahNya lebih sayang kepada kami. Mari kami baiat engkau wahai Rasulullah. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya saya tidak bersalaman dengan wanita. Sesungguhnya perkataanku kepada seratus orang wanita seperti perkataanku kepada satu orang wanita atau seperti perkataanku kepada satu orang wanita.\""
            },
            {
                "number": 3899,
                "arab": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ رَجُلٍ مِنْ يُقَالُ الشَّرِيدِ لَهُ كَانَ عَمْرٌو عَنْ أَبِيهِ قَالَفِي وَفْدِ وَفْدِ ثَقِيفٍ رَجُلٌ مَجْذُومٌ فَأَرْسَلَ إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ارْجِعْ فَقَدْ بَايَعْتُكَ",
                "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub], ia berkata; telah menceritakan kepada kami [Husyaim] dari [Ya'la bin 'Atho`] dari seorang laki-laki yang dipanggil dari yuqal asy syarid lahu, ['Amr] berkata dari [Ayahnya] berkata; di antara utusan orang-orang Tsaqif terdapat seorang laki-laki yang mengidap penyakit lepra kemudian Rasulullah shallallahu 'alaihi wasallam mengirimkan utusan kepadanya dan bersabda: \"Kembalilah, sungguh saya telah membai'atmu.\""
            },
            {
                "number": 3900,
                "arab": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ قَالَ حَدَّثَنَا عُمَرُ بْنُ يُونُسَ عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ عَنْ الْهِرْمَاسِ بْنِ زِيَادٍ قَالَمَدَدْتُ يَدِي إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا غُلَامٌ لِيُبَايِعَنِي فَلَمْ يُبَايِعْنِي",
                "id": "Telah mengabarkan kepada kami [Abdurrahman bin Muhammad bin Sallam], ia berkata; telah menceritakan kepada kami [Umar bin Yunus] dari [Ikrimah bin 'Ammar] dari [Al Hirmas bin Ziyad], ia berkata; saya mengulurkan tanganku kepada Nabi shallallahu 'alaihi wasallam dan ketika itu saya adalah seorang anak kecil, agar saya membai'at beliau namun beliau tidak menerimaku."
            },
            {
                "number": 3901,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَجَاءَ عَبْدٌ فَبَايَعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْهِجْرَةِ وَلَا يَشْعُرُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ عَبْدٌ فَجَاءَ سَيِّدُهُ يُرِيدُهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعْنِيهِ فَاشْتَرَاهُ بِعَبْدَيْنِ أَسْوَدَيْنِ ثُمَّ لَمْ يُبَايِعْ أَحَدًا حَتَّى يَسْأَلَهُ أَعَبْدٌ هُوَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Abu Az Zubair] dari [Jabir], ia berkata; telah datang seorang budak kemudian ia membai'at Nabi shallallahu 'alaihi wasallam untuk berhijrah dan Nabi shallallahu 'alaihi wasallam tidak merasakan bahwa ia adalah budak kemudian tuannya datang hendak mengambilnya. Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Juallah ia kepadaku.\" Kemudian beliau membelinya dengan dua budak hitam. Kemudian beliau tidak membai'at seseorang hingga bertanya kepadanya apakah ia seorang budak? "
            },
            {
                "number": 3902,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ أَعْرَابِيًّا بَايَعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْإِسْلَامِ فَأَصَابَ الْأَعْرَابِيَّ وَعْكٌ بِالْمَدِينَةِ فَجَاءَ الْأَعْرَابِيُّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَقِلْنِي بَيْعَتِي فَأَبَى ثُمَّ جَاءَهُ فَقَالَ أَقِلْنِي بَيْعَتِي فَأَبَى فَخَرَجَ الْأَعْرَابِيُّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا الْمَدِينَةُ كَالْكِيرِ تَنْفِي خَبَثَهَا وَتَنْصَعُ طِيبَهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Muhammad bin Al Munkadir] dari [Jabir bin Abdullah] bahwa seorang badui membai'at Rasulullah shallallahu 'alaihi wasallam untuk masuk Islam. Kemudian orang badui tersebut tertimpa penyakit demam di Madinah kemudian orang badui tersebut kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; wahai Rasulullah, batalkan bai'atku, kemudian beliau menolak, kemudian ia datang kepada beliau dan berkata; batalkan bai'atku. Kemudian beliau menolak, lalu orang badui tersebut keluar. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Madinah seperti alat peniup api tukang besi yang menghilangkan kotoran serta memurnikan yang baiknya.\""
            },
            {
                "number": 3903,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ عَنْ سَلَمَةَ بْنِ الْأَكْوَعِأَنَّهُ دَخَلَ عَلَى الْحَجَّاجِ فَقَالَ يَا ابْنَ الْأَكْوَعِ ارْتَدَدْتَ عَلَى عَقِبَيْكَ وَذَكَرَ كَلِمَةً مَعْنَاهَا وَبَدَوْتَ قَالَ لَا وَلَكِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَذِنَ لِي فِي الْبُدُوِّ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Hatim bin Isma'il] dari [Yazid bin Abu 'Ubaid] dari [Salamah bin Al Akwa'] bahwa ia menemui Al Hajjaj, kemudian ia berkata; wahai anak Al Akwa', engkau telah keluar dari negeri hijrah. Dan ia menyebutkan suatu kata yang maknanya adalah; dan engkau telah tinggal di pelosok. Salamah berkata; tidak akan tetapi Rasulullah shallallahu 'alaihi wasallam telah mengizinkanku untuk tinggal di pelosok. "
            },
            {
                "number": 3904,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ ح و أَخْبَرَنِي عَلِيُّ بْنُ حُجْرٍ عَنْ إِسْمَعِيلَ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَكُنَّا نُبَايِعُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ ثُمَّ يَقُولُ فِيمَا اسْتَطَعْتَ وَقَالَ عَلِيٌّ فِيمَا اسْتَطَعْتُمْ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Abdullah bin Dinar], telah menceritakan serta mengabarkan kepadaku [Ali bin Hujr] dari [Isma'il] dari [Abdullah bin Dinar] dari [Ibnu Umar], ia berkata; dahulu kami membai'at Rasulullah shallallahu 'alaihi wasallam untuk mendengar dan taat, kemudian beliau bersabda: \"Dalam perkara yang engkau mampu.\" Dan Ali mengatakan; dalam perkara yang kalian mampu. "
            },
            {
                "number": 3905,
                "arab": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَكُنَّا حِينَ نُبَايِعُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ يَقُولُ لَنَا فِيمَا اسْتَطَعْتُمْ",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin Muhammad], ia berkata; telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij], ia berkata; telah mengabarkan kepadaku [Musa bin 'Uqbah] dari [Abdullah bin Dinar] dari [Ibnu Umar], ia berkata; kami ketika membai'at Rasulullah shallallahu 'alaihi wasallam untuk mendengar dan taat. beliau bersabda kepada kami: \"Dalam perkara yang kalian mampu. "
            },
            {
                "number": 3906,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ حَدَّثَنَا سَيَّارٌ عَنْ الشَّعْبِيِّ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ قَالَبَايَعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّمْعِ وَالطَّاعَةِ فَلَقَّنَنِي فِيمَا اسْتَطَعْتَ وَالنُّصْحِ لِكُلِّ مُسْلِمٍ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim], ia berkata; telah menceritakan kepada kami [Husyaim], ia berkata; telah menceritakan kepada kami [Sayyar] dari [Asy Sya'bi] dari [Jarir bin Abdullah], ia berkata; saya membai'at Rasulullah shallallahu 'alaihi wasallam untuk mendengar dan taat, kemudian beliau membisikkan kepadaku: \"Dalam perkara yang engaku mampu\". Serta menasehati setiap muslim. "
            },
            {
                "number": 3907,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ أُمَيْمَةَ بِنْتِ رُقَيْقَةَ قَالَتْبَايَعْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نِسْوَةٍ فَقَالَ لَنَا فِيمَا اسْتَطَعْتُنَّ وَأَطَقْتُنَّ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Muhammad bin Al Munkadir] dari [Umaimah binti Ruqaiqah], ia berkata; kami berbai'at kepada Rasulullah shallallahu 'alaihi wasallam diantara beberapa orang wanita, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dalam perkara yang kalian mampu.\""
            },
            {
                "number": 3908,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ زَيْدِ بْنِ وَهْبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ رَبِّ الْكَعْبَةِ قَالَانْتَهَيْتُ إِلَى عَبْدِ اللَّهِ بْنِ عَمْرٍو وَهُوَ جَالِسٌ فِي ظِلِّ الْكَعْبَةِ وَالنَّاسُ عَلَيْهِ مُجْتَمِعُونَ قَالَ فَسَمِعْتُهُ يَقُولُ بَيْنَا نَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ إِذْ نَزَلْنَا مَنْزِلًا فَمِنَّا مَنْ يَضْرِبُ خِبَاءَهُ وَمِنَّا مَنْ يَنْتَضِلُ وَمِنَّا مَنْ هُوَ فِي جَشْرَتِهِ إِذْ نَادَى مُنَادِي النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةُ جَامِعَةٌ فَاجْتَمَعْنَا فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَطَبَنَا فَقَالَ إِنَّهُ لَمْ يَكُنْ نَبِيٌّ قَبْلِي إِلَّا كَانَ حَقًّا عَلَيْهِ أَنْ يَدُلَّ أُمَّتَهُ عَلَى مَا يَعْلَمُهُ خَيْرًا لَهُمْ وَيُنْذِرَهُمْ مَا يَعْلَمُهُ شَرًّا لَهُمْ وَإِنَّ أُمَّتَكُمْ هَذِهِ جُعِلَتْ عَافِيَتُهَا فِي أَوَّلِهَا وَإِنَّ آخِرَهَا سَيُصِيبُهُمْ بَلَاءٌ وَأُمُورٌ يُنْكِرُونَهَا تَجِيءُ فِتَنٌ فَيُدَقِّقُ بَعْضُهَا لِبَعْضٍ فَتَجِيءُ الْفِتْنَةُ فَيَقُولُ الْمُؤْمِنُ هَذِهِ مُهْلِكَتِي ثُمَّ تَنْكَشِفُ ثُمَّ تَجِيءُ فَيَقُولُ هَذِهِ مُهْلِكَتِي ثُمَّ تَنْكَشِفُ فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يُزَحْزَحَ عَنْ النَّارِ وَيُدْخَلَ الْجَنَّةَ فَلْتُدْرِكْهُ مَوْتَتُهُ وَهُوَ مُؤْمِنٌ بِاللَّهِ وَالْيَوْمِ الْآخِرِ وَلْيَأْتِ إِلَى النَّاسِ مَا يُحِبُّ أَنْ يُؤْتَى إِلَيْهِ وَمَنْ بَايَعَ إِمَامًا فَأَعْطَاهُ صَفْقَةَ يَدِهِ وَثَمَرَةَ قَلْبِهِ فَلْيُطِعْهُ مَا اسْتَطَاعَ فَإِنْ جَاءَ أَحَدٌ يُنَازِعُهُ فَاضْرِبُوا رَقَبَةَ الْآخَرِ فَدَنَوْتُ مِنْهُ فَقُلْتُ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ هَذَا قَالَ نَعَمْ وَذَكَرَ الْحَدِيثَ",
                "id": "Telah mengabarkan kepada kami [Hannad bin As Sarri] dari [Abu Mu'awiyah] dari [Al A'masy] dari [Zaid bin wahb] dari [Abdurrahman bin Abdu Rabbil Ka'bah], ia berkata; saya sampai kepada [Abdullah bin 'Amr] dan ia dalam keadaan duduk di bawah naungan Ka'bah dan orang-orang berkumpul mengerumuninya. Abdurrahman berkata; saya mendengar ia berkata; ketika kami bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu safar kemudian kami singgah disuatu tempat, diantara kami ada yang mendirikan tenda, dan diantara kami ada yang berlomba memanah, serta diantara kami ada yang sedang mengeluarkan kuda menuju tempat merumput, tiba- tiba penyeru Rasulullah shallallahu 'alaihi wasallam menyeru; sholat berjama'ah! Maka kami berkumpul lalu Rasulullah shallallahu 'alaihi wasallam berdiri dan berkhutbah kepada kami, beliau bersabda: \"Sesungguhnya sesungguhnya tidak ada seorangpun nabi sebelumku melainkan ia akan menunjukkan umatnya kepada apa yang ia ketahui sebagai kebaikan untuk mereka, dan memperingatkan mereka terhadap apa yang ia ketahui sebagai keburukan bagi mereka dan umat kalian ini dijadikan keselamatannya dari apa yang membahakan agama ada dipermulaan mereka dan orang terakhir diantara mereka akan tertimpa bencana dan perkara-perkara yang mereka ingkari. Akan datang berbagai fitnah kemudian sebagian mereka mendorong sebagian yang lain, kemudian datang sebuah fitnah lalu seorang mukmin akan mengatakan; inilah kebinasaanku, kemudian fitnah tersebut hilang kemudian datang lalu ia berkata; ini adalah kebinasaanku, kemudian fitnah tersebut hilang. Barang siapa diantara kalian yang ingin dijauhkan dari Neraka dan masuk Surga maka hendaknya kematian menjemputnya dalam keadaan beriman kepada Allah dan Hari Akhir, dan hendaknya ia memberikan kepada manusia apa yang ia senang untuk diberikan kepadanya. Barang siapa yang membai'at seorang imam kemudian ia memberikan tangannya serta buah hatinya maka hendaknya ia mentaatinya sesuai dengan kemampuannya, kemudian apabila ada orang yang merebutnya maka penggallahnya.\" Kemudian saya mendekat kepada beliau dan berkata; apakah engkau mendengar Rasulullah shallallahu 'alaihi wasallam mengatakan hal ini? Maka ia berkata; ya. Dan ia menyebutkan hadits tersebut."
            },
            {
                "number": 3909,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ يَحْيَى بْنِ حُصَيْنٍ قَالَ سَمِعْتُ جَدَّتِي تَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي حَجَّةِ الْوَدَاعِ وَلَوْ اسْتُعْمِلَ عَلَيْكُمْ عَبْدٌ حَبَشِيٌّ يَقُودُكُمْ بِكِتَابِ اللَّهِ فَاسْمَعُوا لَهُ وَأَطِيعُوا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] berkata; telah menceritakan kepada kami [Khalid], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Yahya bin Hushain], ia berkata; saya mendengar [nenekku] berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda pada saat haji wada': \"Apabila seorang budak Habasyah diangkat menjadi pemimpin kalian ia memimpin dengan Kitab Allah maka dengarkan dan taatlah kepadanya.\""
            },
            {
                "number": 3910,
                "arab": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ أَنَّ زِيَادَ بْنَ سَعْدٍ أَخْبَرَهُ أَنَّ ابْنَ شِهَابٍ أَخْبَرَهُ أَنَّ أَبَا سَلَمَةَ أَخْبَرَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَطَاعَنِي فَقَدْ أَطَاعَ اللَّهَ وَمَنْ عَصَانِي فَقَدْ عَصَى اللَّهَ وَمَنْ أَطَاعَ أَمِيرِي فَقَدْ أَطَاعَنِي وَمَنْ عَصَى أَمِيرِي فَقَدْ عَصَانِي",
                "id": "Telah mengabarkan kepada kami [Yusuf bin Sa'id], ia berkata; telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] bahwa [Ziyad bin Sa'd] telah mengabarkan kepadanya bahwa [Ibnu Syihab] telah mengabarkan kepadanya bahwa [Abu Salamah] telah mengabarkan kepadanya bahwa ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Barang siapa yang mentaatiku maka sungguh ia telah mentaati Allah dan barang siapa yang mendurhakai amirku maka sungguh ia telah mendurhakaiku.\""
            },
            {
                "number": 3911,
                "arab": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي يَعْلَى بْنُ مُسْلِمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ{ يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ }قَالَ نَزَلَتْ فِي عَبْدِ اللَّهِ بْنِ حُذَافَةَ بْنِ قَيْسِ بْنِ عَدِيٍّ بَعَثَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَرِيَّةٍ",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin Muhammad], ia berkata; telah menceritakan kepada kami [Hajjaj], ia berkata; [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Ya'la bin Muslim] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ayat hai orang-orang yang beriman taatilah Allah dan taatilah rasulNya ia berkata; ayat ini turun mengenai Abdullah bin Hudzafah bin Qois bin 'Adi, Rasulullah shallallahu 'alaihi wasallam mengirimnya pada suatu ekspedisi."
            },
            {
                "number": 3912,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدٍ قَالَ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ قَالَ حَدَّثَنَا بَحِيرٌ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ أَبِي بَحْرِيَّةَ عَنْ مُعَاذِ بْنِ جَبَلٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْغَزْوُ غَزْوَانِ فَأَمَّا مَنْ ابْتَغَى وَجْهَ اللَّهِ وَأَطَاعَ الْإِمَامَ وَأَنْفَقَ الْكَرِيمَةَ وَاجْتَنَبَ الْفَسَادَ فَإِنَّ نَوْمَهُ وَنُبْهَتَهُ أَجْرٌ كُلُّهُ وَأَمَّا مَنْ غَزَا رِيَاءً وَسُمْعَةً وَعَصَى الْإِمَامَ وَأَفْسَدَ فِي الْأَرْضِ فَإِنَّهُ لَا يَرْجِعُ بِالْكَفَافِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Utsman bin Sa'id], ia berkata; telah menceritakan kepada kami [Baqiyah bin Al Walid], ia berkata; telah menceritakan kepada kami [Bahir] dari [Khalid bin Ma'dan] dari [Abu Bahriyah] dari [Mu'adz bin Jabal] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Perang ada dua, adapun orang yang mengharapkan wajah Allah dan mentaati pemimpin serta menafkahkan hartanya yang berharga serta menjauhi kerusakan maka tidur dan terjaganya seluruhnya adalah pahala, adapun orang yang berperang agar dilihat dan didengar orang serta mendurhakai pemimpin dan membuat kerusakan di muka bumi maka sesungguhnya ia tidak kembali membawa manfaat.\" "
            },
            {
                "number": 3913,
                "arab": "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ قَالَ حَدَّثَنَا شُعَيْبٌ قَالَ حَدَّثَنِي أَبُو الزِّنَادِ مِمَّا حَدَّثَهُ عَبْدُ الرَّحْمَنِ الْأَعْرَجُ مِمَّا ذَكَرَ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يُحَدِّثُعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا الْإِمَامُ جُنَّةٌ يُقَاتَلُ مِنْ وَرَائِهِ وَيُتَّقَى بِهِ فَإِنْ أَمَرَ بِتَقْوَى اللَّهِ وَعَدَلَ فَإِنَّ لَهُ بِذَلِكَ أَجْرًا وَإِنْ أَمَرَ بِغَيْرِهِ فَإِنَّ عَلَيْهِ وِزْرًا",
                "id": "Telah mengabarkan kepada kami [Imran bin Bakkar], ia berkata; telah menceritakan kepada kami [Ali bin 'Ayyasy], ia berkata; telah menceritakan kepada kami [Syu'aib], ia berkata; telah menceritakan kepadaku [Abu Az Zinad] dari apa yang telah diceritakan kepadanya oleh [Abdurrahman Al A'raj], diantara apa yang ia sebutkan bahwa ia mendengar [Abu Hurairah] menceritakan dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya seorang imam adalah perisai dilakukan perang dari belakannya dan ia dijadikan sebagai pelindung. Apabila ia memerintahkan untuk bertakwa kepada Allah dan berbuat adil maka dengan hal itu ia mendapatkan pahala sedangkan apabila tidak demikian maka hal itu menjadi dosa baginya.\" "
            },
            {
                "number": 3914,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ سَأَلْتُ سُهَيْلَ بْنَ أَبِي صَالِحٍ قُلْتُ حَدَّثَنَا عَمْرٌو عَنْ الْقَعْقَاعِ عَنْ أَبِيكَ قَالَ أَنَا سَمِعْتُهُ مِنَ الَّذِي حَدَّثَ أَبِي حَدَّثَهُ رَجُلٌ مِنْ أَهْلِ الشَّامِ يُقَالُ لَهُ عَطَاءُ بْنُ يَزِيدَ عَنْ تَمِيمٍ الدَّارِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا الدِّينُ النَّصِيحَةُ قَالُوا لِمَنْ يَا رَسُولَ اللَّهِ قَالَ لِلَّهِ وَلِكِتَابِهِ وَلِرَسُولِهِ وَلِأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur], ia berkata; telah menceritakan kepada kami [Sufyan], ia berkata; saya bertanya kepada [Suhail bin Abu Shalih], saya mengatakan; telah menceritakan kepada kami ['Amr] dari [Al Qa'qa'] dari [ayahmu] ia berkata; saya mendengarnya dari orang yang menceritakan kepada ayahku, telah menceritakan kepadanya seorang laki-laki dari penduduk Syam yang dipanggil ['Atho` bin Yazid] dari [Tamim Ad Dari], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya agama adalah nasehat, orang-orang bertanya; untuk siapa wahai Rasulullah? beliau bersabda: \"Untuk Allah, KitabNya, RasulNya dan para pemimpin orang muslim serta mereka secara umum.\""
            },
            {
                "number": 3915,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ عَطَاءِ بْنِ يَزِيدَ عَنْ تَمِيمٍ الدَّارِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا الدِّينُ النَّصِيحَةُ قَالُوا لِمَنْ يَا رَسُولَ اللَّهِ قَالَ لِلَّهِ وَلِكِتَابِهِ وَلِرَسُولِهِ وَلِأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim], ia berkata; telah memberitakan kepada kami [Abdurrahman], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Suhail bin Abu Shalih] dari ['Atho` bin Yazid] dari [Tamim Ad Dari], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Untuk Allah, KitabNya, RasulNya dan para pemimpin orang muslim serta mereka secara umum.\""
            },
            {
                "number": 3916,
                "arab": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ اللَّيْثِ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الدِّينَ النَّصِيحَةُ إِنَّ الدِّينَ النَّصِيحَةُ إِنَّ الدِّينَ النَّصِيحَةُ قَالُوا لِمَنْ يَا رَسُولَ اللَّهِ قَالَ لِلَّهِ وَلِكِتَابِهِ وَلِرَسُولِهِ وَلِأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ",
                "id": "Telah mengabarkan kepada kami [Ar Rabi' bin Sulaiman], ia berkata; telah menceritakan kepada kami [Syu'aib bin Al Laits], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Ibnu 'Ajlan] dari [Zaid bin Aslam] dari [Al Qa'qa' bin Hakim] dari [Abu Shaleh] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya agama itu adalah nasehat, sesungguhnya agama itu adalah nasehat, sesungguhnya agama itu adalah nasehat.\" Para sahabat bertanya untuk siapa wahai Rasulullah? Beliau menjawab: \" Untuk Allah, kitabNya, rasulNya, dan para pemimpin kaum muslimin serta mereka secara umum.\""
            },
            {
                "number": 3917,
                "arab": "أَخْبَرَنَا عَبْدُ الْقُدُّوسِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الْكَبِيرِ بْنِ شُعَيْبِ بْنِ الْحَبْحَابِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَهْضَمٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ ابْنِ عَجْلَانَ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ وَعَنْ سُمَيٍّ وَعَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الدِّينُ النَّصِيحَةُ قَالُوا لِمَنْ يَا رَسُولَ اللَّهِ قَالَ لِلَّهِ وَلِكِتَابِهِ وَلِرَسُولِهِ وَلِأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ",
                "id": "Telah mengabarkan kepada kami [Abdul Quddus bin Muhammad bin Abdul Kabir bin Syu'aib bin Al Habhab], ia berkata; telah menceritakan kepada kami [Muhammad Jahdham], ia berkata; telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Ibnu 'Ajlan] dari [Al Qa'qa' bin Hakim] dan dari [Sumai] serta ['ubaidhullah bin Miqsam] dari [Abu Shaleh] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Agama itu adalah nasehat, sesungguhnya agama itu adalah nasehat, sesungguhnya agama itu adalah nasehat.\" "
            },
            {
                "number": 3918,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا مُعَمَّرُ بْنُ يَعْمَرَ قَالَ حَدَّثَنِي مُعَاوِيَةُ بْنُ سَلَّامٍ قَالَ حَدَّثَنِي الزُّهْرِيُّ قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ وَالٍ إِلَّا وَلَهُ بِطَانَتَانِ بِطَانَةٌ تَأْمُرُهُ بِالْمَعْرُوفِ وَتَنْهَاهُ عَنْ الْمُنْكَرِ وَبِطَانَةٌ لَا تَأْلُوهُ خَبَالًا فَمَنْ وُقِيَ شَرَّهَا فَقَدْ وُقِيَ وَهُوَ مِنْ الَّتِي تَغْلِبُ عَلَيْهِ مِنْهُمَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya bin Abdullah], ia berkata; telah menceritakan kepada kami [Mu'ammar bin Ya'mar], ia berkata; telah menceritakan kepadaku [Mu'awiyah bin Sallam], ia berkata; telah menceritakan kepadaku [Az Zuhri], ia berkata; telah menceritakan kepadaku [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada seorang pemimpinpun kecuali ia memiliki dua orang teman karib, seorang teman yang menyuruhnya berbuat kebaikan dan melarangnya dari perbuatan mungkar, dan seorang teman yang mengajaknya berbuat kerusakan, maka barangsiapa yang terjaga dari keburukannya maka ia telah terjaga dan ia termasuk diantara yang menang diantara keduanya.\""
            },
            {
                "number": 3919,
                "arab": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي سَعِيدٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا بَعَثَ اللَّهُ مِنْ نَبِيٍّ وَلَا اسْتَخْلَفَ مِنْ خَلِيفَةٍ إِلَّا كَانَتْ لَهُ بِطَانَتَانِ بِطَانَةٌ تَأْمُرُهُ بِالْخَيْرِ وَبِطَانَةٌ تَأْمُرُهُ بِالشَّرِّ وَتَحُضُّهُ عَلَيْهِ وَالْمَعْصُومُ مَنْ عَصَمَ اللَّهُ عَزَّ وَجَلَّ",
                "id": "Telah mengabarkan kepada kami [Yunus bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Ibnu Wahb], ia berkata; telah memberitakan kepadaku [Yunus] dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman] dari [Abu Sa'id] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Tidaklah Allah mengutus seorang nabi dan tidak mengangkat pemimpin setelahnya kecuali ia memiliki dua orang sahabat karib, seorang teman yang menyuruhnya berbuat kebaikan, dan teman yang menyuruhnya melakukan keburukan serta menganjurkannya. Orang yang terlindungi adalah orang yang Allah 'azza wajalla lindungi.\""
            },
            {
                "number": 3920,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ عَنْ صَفْوَانَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي أَيُّوبَ أَنَّهُ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا بُعِثَ مِنْ نَبِيٍّ وَلَا كَانَ بَعْدَهُ مِنْ خَلِيفَةٍ إِلَّا وَلَهُ بِطَانَتَانِ بِطَانَةٌ تَأْمُرُهُ بِالْمَعْرُوفِ وَتَنْهَاهُ عَنْ الْمُنْكَرِ وَبِطَانَةٌ لَا تَأْلُوهُ خَبَالًا فَمَنْ وُقِيَ بِطَانَةَ السُّوءِ فَقَدْ وُقِيَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdullah bin Abdul Hakam] dari [Syu'aib] dari [Al Laits] dari ['ubaidhullah bin Abu Ja'far] dari [Shafwan] dari [Abu Salamah] dari [Abu Ayyub] ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada Nabi yang diutus atau seorangpun dari khalifah setelahnya kecuali ia memiliki dua orang teman karib, seorang teman yang menyuruhnya kepada perbuatan baik dan melarangnya dari perbuatan mungkar, dan seorang teman yang mengajaknya kepada kerusakan, maka barangsiapa yang terjaga dari keburukannya berarti ia telah terjaga.\""
            },
            {
                "number": 3921,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا بَقِيَّةُ قَالَ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ ابْنِ أَبِي حُسَيْنٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ قَالَ سَمِعْتُ عَمَّتِي تَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ وَلِيَ مِنْكُمْ عَمَلًا فَأَرَادَ اللَّهُ بِهِ خَيْرًا جَعَلَ لَهُ وَزِيرًا صَالِحًا إِنْ نَسِيَ ذَكَّرَهُ وَإِنْ ذَكَرَ أَعَانَهُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Utsman], ia berkata; telah menceritakan kepada kami [Baqiyah], ia berkata; telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Ibnu Abu Husain] dari [Al Qosim bin Muhammad] ia berkata; saya mendengar [bibiku] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa diantara kalian yang mengurusi suatu pekerjaan lalu Allah inginkan kebaikan padanya maka Allah akan menjadikan untuknya pembantu yang shaleh, jika ia lupa maka ia mengingatkannya, jika ia ingat maka ia akan membantunya.\""
            },
            {
                "number": 3922,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ زُبَيْدٍ الْإِيَامِيِّ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَنْ عَلِيٍّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ جَيْشًا وَأَمَّرَ عَلَيْهِمْ رَجُلًا فَأَوْقَدَ نَارًا فَقَالَ ادْخُلُوهَا فَأَرَادَ نَاسٌ أَنْ يَدْخُلُوهَا وَقَالَ الْآخَرُونَ إِنَّمَا فَرَرْنَا مِنْهَا فَذَكَرُوا ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِلَّذِينَ أَرَادُوا أَنْ يَدْخُلُوهَا لَوْ دَخَلْتُمُوهَا لَمْ تَزَالُوا فِيهَا إِلَى يَوْمِ الْقِيَامَةِ وَقَالَ لِلْآخَرِينَ خَيْرًا وَقَالَ أَبُو مُوسَى فِي حَدِيثِهِ قَوْلًا حَسَنًا وَقَالَ لَا طَاعَةَ فِي مَعْصِيَةِ اللَّهِ إِنَّمَا الطَّاعَةُ فِي الْمَعْرُوفِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dan [Muhammad bin Basysyar] mereka berkata; telah menceritakan kepada kami [Muhammad] telah menceritakan kepada kami [Syu'bah] dari [Zubaid Al Iyami] dari [Sa'd bin 'Ubaidah] dari [Abu Abdurrahman] dari [Ali] bahwa Rasulullah shallallahu 'alaihi wasallam telah mengirim pasukan dan menunjuk seseorang menjadi pemimpin bagi mereka. Kemudian orang tersebut membakar api dan mengatakan; masuklah kalian ke dalamnya, kemudian ada beberapa orang yang hendak memasukinya sedang yang lainnya berkata; sesungguhnya kita lari dari api. Kemudian mereka menyebutkan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau bersabda kepada orang yang hendak memasukinya: \"Apabila kalian memasukinya maka kalian akan tetap ada padanya hingga hari Kiamat.\" Dan beliau mengatakan kebaikan kepada orang yang lain. Abu Musa dalam haditsnya mengatakan; perkataan yang baik. Beliau bersabda: \"Tidak ada ketaatan dalam bermaksiat kepada Allah, sesungguhnya ketaatan hanya dalam perkara yang baik.\""
            },
            {
                "number": 3923,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمَرْءِ الْمُسْلِمِ السَّمْعُ وَالطَّاعَةُ فِيمَا أَحَبَّ وَكَرِهَ إِلَّا أَنْ يُؤْمَرَ بِمَعْصِيَةٍ فَإِذَا أُمِرَ بِمَعْصِيَةٍ فَلَا سَمْعَ وَلَا طَاعَةَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari ['ubaidhullah bin Abu Ja'far] dari [Nafi'] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Wajib bagi seorang muslim mendengar dan taat dalam perkara yang ia sukai dan ia benci kecuali jika ia diperintah untuk berbuat maksiat, jika ia diperintah untuk berbuat maksiat maka tidak ada kewajiban mendengar dan taat.\""
            },
            {
                "number": 3924,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ عَنْ أَبِي حَصِينٍ عَنْ الشَّعْبِيِّ عَنْ عَاصِمٍ الْعَدَوِيِّ عَنْ كَعْبِ بْنِ عُجْرَةَ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ تِسْعَةٌ فَقَالَ إِنَّهُ سَتَكُونُ بَعْدِي أُمَرَاءُ مَنْ صَدَّقَهُمْ بِكَذِبِهِمْ وَأَعَانَهُمْ عَلَى ظُلْمِهِمْ فَلَيْسَ مِنِّي وَلَسْتُ مِنْهُ وَلَيْسَ بِوَارِدٍ عَلَيَّ الْحَوْضَ وَمَنْ لَمْ يُصَدِّقْهُمْ بِكَذِبِهِمْ وَلَمْ يُعِنْهُمْ عَلَى ظُلْمِهِمْ فَهُوَ مِنِّي وَأَنَا مِنْهُ وَهُوَ وَارِدٌ عَلَيَّ الْحَوْضَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yahya] dari [Sufyan] dari [Abu Hashin] dari [Asy Sya'bi] dari ['Ashim Al 'Adawi] dari [Ka'ab bin 'Ujrah] ia berkatal Rasulullah shallallahu 'alaihi wasallam keluar menemui kami, ketika itu kami sembilan orang, lalu beliau bersabda: \" Sesungguhnya akan ada setelahku para penguasa, barang siapa yang mempercayai kedustaan mereka dan membantu kezhaliman mereka, maka ia bukan termasuk golonganku dan aku bukan darinya, ia tidak akan menemuiku di telaga, dan barangsiapa yang tidak mempercayai kedustaan mereka dan tidak membantu kezhaliman mereka maka ia adalah termasuk golonganku dan aku bagian darinya, ia akan datang menemuiku di telaga.\""
            },
            {
                "number": 3925,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَقَ قَالَ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ عَبْدِ الْوَهَّابِ قَالَ حَدَّثَنَا مِسْعَرٌ عَنْ أَبِي حَصِينٍ عَنْ الشَّعْبِيِّ عَنْ عَاصِمٍ الْعَدَوِيِّ عَنْ كَعْبِ بْنِ عُجْرَةَ قَالَخَرَجَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ تِسْعَةٌ خَمْسَةٌ وَأَرْبَعَةٌ أَحَدُ الْعَدَدَيْنِ مِنْ الْعَرَبِ وَالْآخَرُ مِنْ الْعَجَمِ فَقَالَ اسْمَعُوا هَلْ سَمِعْتُمْ أَنَّهُ سَتَكُونُ بَعْدِي أُمَرَاءُ مَنْ دَخَلَ عَلَيْهِمْ فَصَدَّقَهُمْ بِكَذِبِهِمْ وَأَعَانَهُمْ عَلَى ظُلْمِهِمْ فَلَيْسَ مِنِّي وَلَسْتُ مِنْهُ وَلَيْسَ يَرِدُ عَلَيَّ الْحَوْضَ وَمَنْ لَمْ يَدْخُلْ عَلَيْهِمْ وَلَمْ يُصَدِّقْهُمْ بِكَذِبِهِمْ وَلَمْ يُعِنْهُمْ عَلَى ظُلْمِهِمْ فَهُوَ مِنِّي وَأَنَا مِنْهُ وَسَيَرِدُ عَلَيَّ الْحَوْضَ",
                "id": "Telah mengabarkan kepada kami [Harun bin Ishaq], ia berkata; telah menceritakan kepada kami [Muhammad yaitu Ibnu Abdul Wahhab], ia berkata; telah menceritakan kepada kami [Mis'ar] dari [Abu Hashin] dari [Asy Sya'bi] dari ['Ashim Al 'Adawi] dari [Ka'b bin 'Ujrah], ia berkata; Rasulullah shallallahu 'alaihi wasallam keluar kepada kami dan kami berjumlah sembilan, lima dan empat, salah satu dari dua kelompok dari Arab dan yang lainnya dari orang selain Arab. Kemudian beliau bersabda: \"Apakah kalian pernah mendengar bahwa akan ada setelahku para pemimpin, barang siapa yang menemui mereka dan membenarkan kedustaan mereka serta membantu kezhaliman mereka maka ia bukan termasuk golonganku dan aku bukan darinya. Ia tidak akan menemuiku di telaga, serta tidak menemui mereka dan barang siapa yang tidak mempercayai kedustaan mereka dan tidak membantu kezhaliman mereka maka ia termasuk golonganku dan aku bagian darinya, ia akan menemuiku di telaga.\""
            },
            {
                "number": 3926,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ طَارِقِ بْنِ شِهَابٍأَنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ وَضَعَ رِجْلَهُ فِي الْغَرْزِ أَيُّ الْجِهَادِ أَفْضَلُ قَالَ كَلِمَةُ حَقٍّ عِنْدَ سُلْطَانٍ جَائِرٍ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur], ia berkata; telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dari ['Alqamah bin Martsad] dari [Thariq bin Syihab] bahwa seorang laki bertanya kepada Rasulullah shallallahu 'alaihi wasallam dan ia telah meletakkan kakinya di batang kayu yang ditancapkan di tanah; jihad apakah yang paling utama? Beliau bersabda: \"Perkataan yang benar dihadapan penguasa yang zhalim.\""
            },
            {
                "number": 3927,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَكُنَّا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَجْلِسٍ فَقَالَ بَايِعُونِي عَلَى أَنْ لَا تُشْرِكُوا بِاللَّهِ شَيْئًا وَلَا تَسْرِقُوا وَلَا تَزْنُوا وَقَرَأَ عَلَيْهِمْ الْآيَةَ فَمَنْ وَفَّى مِنْكُمْ{ فَأَجْرُهُ عَلَى اللَّهِ }وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَسَتَرَ اللَّهُ عَلَيْهِ فَهُوَ إِلَى اللَّهِ عَزَّ وَجَلَّ إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ غَفَرَ لَهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Abu Idris Al Khaulani] dari ['Ubadah bin Ash Shamit], ia berkata; kami pernah bersama Nabi shallallahu 'alaihi wasallam dalam suatu majelis kemudian beliau bersabda: \"Berbai'atlah kepadaku untuk tidak mensekutukan Allah dengan sesuatu, tidak mencuri, dan tidak berzina.\" Kemudian beliau membacakan sebuah ayat. Barang siapa yang memenuhinya diantara kalian maka pahalanya menjadi tanggungan Allah dan barang siapa yang melakukan sesuatu dari hal tersebut kemudian Allah 'azza wajalla menutupinya maka apabila Allah menghendaki maka Allah akan mengampuninya.\""
            },
            {
                "number": 3928,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ آدَمَ بْنِ سُلَيْمَانَ عَنْ ابْنِ الْمُبَارَكِ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّكُمْ سَتَحْرِصُونَ عَلَى الْإِمَارَةِ وَإِنَّهَا سَتَكُونُ نَدَامَةً وَحَسْرَةً فَنِعْمَتِ الْمُرْضِعَةُ وَبِئْسَتْ الْفَاطِمَةُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Adam bin Sulaiman] dari [Ibnu Al Mubarak] dari [Ibnu Abi Dzi'b] dari [Sa'id Al Maqri] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya kalian akan bersaing untuk mendapatkan kekuasaan, dan sesungguhnya ia akan penyesalan dan kerugian, maka sungguh nikmat awal kepemimpinan dan sungguh buruk akhir kepemimpinan tersebut.\""
            },
            {
                "number": 3929,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ قَالَ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْعَقِيقَةِ فَقَالَ لَا يُحِبُّ اللَّهُ عَزَّ وَجَلَّ الْعُقُوقَ وَكَأَنَّهُ كَرِهَ الِاسْمَ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا نَسْأَلُكَ أَحَدُنَا يُولَدُ لَهُ قَالَ مَنْ أَحَبَّ أَنْ يَنْسُكَ عَنْ وَلَدِهِ فَلْيَنْسُكْ عَنْهُ عَنْ الْغُلَامِ شَاتَانِ مُكَافَأَتَانِ وَعَنْ الْجَارِيَةِ شَاةٌقَالَ دَاوُدُ سَأَلْتُ زَيْدَ بْنَ أَسْلَمَ عَنْ الْمُكَافَأَتَانِ قَالَ الشَّاتَانِ الْمُشَبَّهَتَانِ تُذْبَحَانِ جَمِيعًا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman], ia berkata; telah menceritakan kepada kami [Abu Nu'aim], ia berkata; telah menceritakan kepada kami [Daud bin Qais] dari ['Amr bin Syu'aib] dari [ayahnya] dari [kakeknya], ia berkata; Rasulullah shallallahu 'alaihi wasallam ditanya mengenai aqiqah, kemudian beliau bersabda: \"Sesungguhnya Allah 'azza wajalla membenci sifat durhaka.\" Sepertinya beliau membenci nama tersebut. Orang yang bertanya mengatakan; sesungguhnya kami bertanya kepadamu mengenai seseorang diantara kami terlahirkan anaknya. beliau bersabda: \"Barang siapa yang ingin menyembelih untuk anaknya maka hendaknya ia menyembelih untuknya, untuk anak laki-laki dua kambing dan untuk anak wanita satu kambing.\" Abu Daud berkata; saya bertanya kepada Zaid bin Aslam mengenai kata mukaafa ataani, ia berkata; dua kambing yang sama dan disembelih bersama."
            },
            {
                "number": 3930,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ قَالَ حَدَّثَنَا الْفَضْلُ عَنْ الْحُسَيْنِ بْنِ وَاقِدٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَقَّ عَنْ الْحَسَنِ وَالْحُسَيْنِ",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Huraits], ia berkata; telah menceritakan kepada kami [Al Fadhl] dari [Al Husain bin Waqid] dari [Abdullah bin Buraidah] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam melakukan aqiqah untuk Al Hasan dan Al Husain. "
            },
            {
                "number": 3931,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا أَيُّوبُ وَحَبِيبٌ وَيُونُسُ وَقَتَادَةُ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْغُلَامِ عَقِيقَةٌ فَأَهْرِيقُوا عَنْهُ دَمًا وَأَمِيطُوا عَنْهُ الْأَذَى",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna], ia berkata; telah menceritakan kepada kami [Affan], ia berkata; telah menceritakan kepada kami [Hammad bin Salamah], ia berkata; telah menceritakan kepada kami [Ayyub] dan [Habib] dan [Yunus] serta [Qatadah] dari [Muhammad bin Sirin] dari [Salman bin 'Amir Adh Dhabbi] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Untuk anak laki-laki terdapat aqiqah maka alirkanlah darah dan hilangkanlah darinya gangguan.\""
            },
            {
                "number": 3932,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ قَيْسِ بْنِ سَعْدٍ عَنْ عَطَاءٍ وَطَاوُسٍ وَمُجَاهِدٍ عَنْ أُمِّ كُرْزٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْغُلَامِ شَاتَانِ مُكَافَأَتَانِ وَفِي الْجَارِيَةِ شَاةٌ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman], ia berkata; telah menceritakan kepada kami ['Affan], ia berkata; telah menceritakan kepada kami [Hammad] dari [Qais bin Sa'd] dari ['Atho`] dan [Thawus] serta [Mujahid] dari [Ummi Kurz] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda mengenai aqiqah seorang anak laki-laki: \"Dua ekor kambing yang sama, sedang untuk seorang anak perempuan adalah seekor kambing.\""
            },
            {
                "number": 3933,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ قَالَ عَمْرٌو عَنْ عَطَاءٍ عَنْ حَبِيبَةَ بِنْتِ مَيْسَرَةَ عَنْ أُمِّ كُرْزٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَنْ الْغُلَامِ شَاتَانِ مُكَافَأَتَانِ وَعَنْ الْجَارِيَةِ شَاةٌ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id], ia berkata; telah menceritakan kepada kami [Sufyan], ia berkata; ['Amr] berkata dari ['Atho`] dari [Habibah binti Maisarah] dari [Ummu Kurz] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Untuk anak laki-laki dua ekor kambing yang sama, dan untuk anak wanita satu kambing.\""
            },
            {
                "number": 3934,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عُبَيْدِ اللَّهِ وَهُوَ ابْنُ أَبِي يَزِيدَ عَنْ سِبَاعِ بْنِ ثَابِتٍ عَنْ أُمِّ كُرْزٍ قَالَتْأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحُدَيْبِيَةِ أَسْأَلُهُ عَنْ لُحُومِ الْهَدْيِ فَسَمِعْتُهُ يَقُولُ عَلَى الْغُلَامِ شَاتَانِ وَعَلَى الْجَارِيَةِ شَاةٌ لَا يَضُرُّكُمْ ذُكْرَانًا كُنَّ أَمْ إِنَاثًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Sufyan] dari ['ubaidhullah yaitu Ibnu Abu Yazid] dari [Siba' bin Tsabit] dari [Ummu Kurz], ia berkata; saya datang kepada Nabi shallallahu 'alaihi wasallam di Hudaibiyah bertanya kepadanya mengenai daging hewan kurban, saya mendengar beliau bersabda: \"Untuk anak laki-laki dua kambing dan anak wanita satu kambing, tidak masalah atas kalian apakah kambing tersebut jantan atau betina.\""
            },
            {
                "number": 3935,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ عَنْ سِبَاعِ بْنِ ثَابِتٍ عَنْ أُمِّ كُرْزٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَنْ الْغُلَامِ شَاتَانِ وَعَنْ الْجَارِيَةِ شَاةٌ لَا يَضُرُّكُمْ ذُكْرَانًا كُنَّ أَمْ إِنَاثًا",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yahya], ia berkata; telah menceritakan kepada kami [Ibnu Juraij], ia berkata; telah menceritakan kepadaku ['ubaidhullah bin Abu Yazid] dari [Siba' bin Tsabit] dari [Ummu Kurz] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Untuk anak laki-laki dua kambing dan untuk anak wanita satu kambing, tidak masalah atas kalian apakah kambing tersebut jantan atau betina.\" "
            },
            {
                "number": 3936,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنِي إِبْرَاهِيمُ هُوَ ابْنُ طَهْمَانَ عَنْ الْحَجَّاجِ بْنِ الْحَجَّاجِ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَعَقَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْحَسَنِ وَالْحُسَيْنِ رَضِيَ اللَّهُ عَنْهُمَا بِكَبْشَيْنِ كَبْشَيْنِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Hafsh bin Abdullah], ia berkata; telah menceritakan kepadaku [ayahku], ia berkata; telah menceritakan kepadaku [Ibrahim yaitu Ibnu Thahman] dari [Al Hajjaj bin Al Hajjaj] dari [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam melakukan aqiqah untuk Al Hasan dan Al Husain radliallahu 'anhuma dengan dua ekor kambing dua ekor kambing."
            },
            {
                "number": 3937,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَا حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ عَنْ سَعِيدٍ أَنْبَأَنَا قَتَادَةُ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدُبٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ غُلَامٍ رَهِينٌ بِعَقِيقَتِهِ تُذْبَحُ عَنْهُ يَوْمَ سَابِعِهِ وَيُحْلَقُ رَأْسُهُ وَيُسَمَّىأَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا قُرَيْشُ بْنُ أَنَسٍ عَنْ حَبِيبِ بْنِ الشَّهِيدِ قَالَ لِي مُحَمَّدُ بْنُ سِيرِينَ سَلْ الْحَسَنَ مِمَّنْ سَمِعَ حَدِيثَهُ فِي الْعَقِيقَةِ فَسَأَلْتُهُ عَنْ ذَلِكَ فَقَالَ سَمِعْتُهُ مِنْ سَمُرَةَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali] dan [Muhammad bin Abdul A'la], mereka berkata; telah menceritakan kepada kami [Yazid yaitu Ibnu Zurai'] dari [Sa'id], telah memberitakan kepada kami [Qatadah] dari [Al Hasan] dari [Samurah bin Jundub] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Setiap anak laki-laki tergadai dengan aqiqahnya, disembelihkan untuknya pada hari ketujuh dan dicukur kepalanya serta diberi nama.\" Telah mengabarkan kepada kami [Harun bin Abdullah], ia berkata; telah menceritakan kepada kami [Quraisy bin Anas] dari [Habib bin Asy Syahid], telah berkata kepadaku Muhammad bin Sirin; tanyakan kepada [Al Hasan] dari manakah ia mendengar haditsnya mengenai aqiqah. Kemudian saya bertanya kepadanya mengenai hal tersebut, lalu ia berkata; saya mendengarnya dari [Samurah]. "
            },
            {
                "number": 3938,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا فَرَعَ وَلَا عَتِيرَةَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada fara' (anak hewan pertama yang dipersembahkan untuk berhala) dan tidak ada 'atirah (hewan persembahan pada tanggal sepuluh bulan Rajab).\""
            },
            {
                "number": 3939,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثْتُ أَبَا إِسْحَقَ عَنْ مَعْمَرٍ وَسُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَقَالَ أَحَدُهُمَا نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْفَرَعِ وَالْعَتِيرَةِ وَقَالَ الْآخَرُ لَا فَرَعَ وَلَا عَتِيرَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna], ia berkata; telah menceritakan kepada kami [Abu Daud], ia berkata; telah menceritakan kepada kami [Syu'bah], ia berkata; telah menceritakan kepadaku [Abu Ishaq] dari [Ma'mar] dan [Sufyan] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah], salah seorang dari mereka berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari fara' (anak hewan pertama yang dipersembahkan untuk berhala) dan 'atirah (hewan persembahan pada tanggal sepuluh bulan Rajab). Sedang yang lain mengatakan; Tidak ada fara' (anak hewan pertama yang dipersembahkan untuk berhala) dan tidak ada 'atirah (hewan persembahan pada tanggal sepuluh bulan Rajab)."
            },
            {
                "number": 3940,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ قَالَ حَدَّثَنَا مُعَاذٌ وَهُوَ ابْنُ مُعَاذٍ قَالَ حَدَّثَنَا ابْنُ عَوْنٍ قَالَ حَدَّثَنَا أَبُو رَمْلَةَ قَالَ أَنْبَأَنَا مِخْنَفُ بْنُ سُلَيْمٍ قَالَبَيْنَا نَحْنُ وُقُوفٌ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَةَ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ عَلَى أَهْلِ بَيْتٍ فِي كُلِّ عَامٍ أَضْحَاةً وَعَتِيرَةًقَالَ مُعَاذٌ كَانَ ابْنُ عَوْنٍ يَعْتِرُ أَبْصَرَتْهُ عَيْنِي فِي رَجَبٍ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Zurarah], ia berkata; telah menceritakan kepada kami [Mu'adz yaitu Ibnu Mu'adz], ia berkata; telah menceritakan kepada kami [Ibnu 'Aun], ia berkata; telah menceritakan kepada kami [Abu Ramlah], ia berkata; telah memberitakan kepada kami [Mikhnaf bin Sulaim], ia berkata; ketika kami sedang berdiri bersama Nabi shallallahu 'alaihi wasallam di Arafah, beliau bersabda: \"Wahai manusia, sesungguhnya ahli bait pada setiap tahun menyembelih kurban dan sembelihan pada bulan Rajab.\" Mu'adz berkata; Ibnu 'Aun pernah menyembelih pada bulan Rajab dan saya melihat dengan kedua mataku."
            },
            {
                "number": 3941,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ بْنِ إِسْحَقَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ أَبُو عَلِيٍّ الْحَنَفِيُّ قَالَ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ قَالَ سَمِعْتُ عَمْرَو بْنَ شُعَيْبِ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ أَبِيهِ عَنْ أَبِيهِ وَزَيْدِ بْنِ أَسْلَمَ قَالُوايَا رَسُولَ اللَّهِ الْفَرَعَ قَالَ حَقٌّ فَإِنْ تَرَكْتَهُ حَتَّى يَكُونَ بَكْرًا فَتَحْمِلَ عَلَيْهِ فِي سَبِيلِ اللَّهِ أَوْ تُعْطِيَهُ أَرْمَلَةً خَيْرٌ مِنْ أَنْ تَذْبَحَهُ فَيَلْصَقَ لَحْمُهُ بِوَبَرِهِ فَتُكْفِئَ إِنَاءَكَ وَتُولِهُ نَاقَتَكَ قَالُوا يَا رَسُولَ اللَّهِ فَالْعَتِيرَةُ قَالَ الْعَتِيرَةُ حَقٌّقَالَ أَبُو عَبْد الرَّحْمَنِ أَبُو عَلِيٍّ الْحَنَفِيُّ هُمْ أَرْبَعَةُ إِخْوَةٍ أَحَدُهُمْ أَبُو بَكْرٍ وَبِشْرٌ وَشَرِيكٌ وَآخَرُ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Ya'qub bin Ishaq], ia berkata; telah menceritakan kepada kami ['ubaidhullah bin Abdul Majid Abu Ali Al Hanafi], ia berkata; telah menceritakan kepada kami [Dawud bin Qais] berkata; saya mendengar [Amr bin Syu'aib bin Muhammad bin Abdullah bin 'Amr] dari [ayahnya] dan [Zaid bin Aslam] mereka berkata; wahai Rasulullah, bagaimana pendapat anda mengenai fara'? beliau bersabda: \"Itu adalah hak, jika engkau membiarkannya hingga menjadi unta remaja, lalu engkau membawanya di jalan Allah atau engkau memberikan kepada seorang janda adalah lebih baik daripada engkau menyembelihnya, lalu dagingnya menempel dengan bulunya dan engkau penuhi bejanamu, serta engkau mengagetkan untamu dengan kematian anaknya, \" mereka berkata; wahai Rasulullah, bagaimana dengan 'athirah? Beliau bersabda: \" 'Athiroh itu adalah hak.\" Abu Abdurrahman Abu Ali Al Hanafi berkata; mereka adalah empat bersaudara salah satunya adalah Abu Bakar, Bisyr, Syarik dan yang lainnya."
            },
            {
                "number": 3942,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ الْمُبَارَكِ عَنْ يَحْيَى وَهُوَ ابْنُ زُرَارَةَ بْنِ كُرَيْمِ بْنِ الْحَارِثِ بْنِ عَمْرٍو الْبَاهِلِيُّ قَالَ سَمِعْتُ أَبِي يَذْكُرُ أَنَّهُ سَمِعَ جَدَّهُ الْحَارِثَ بْنَ عَمْرٍو يُحَدِّثُأَنَّهُ لَقِيَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ وَهُوَ عَلَى نَاقَتِهِ الْعَضْبَاءِ فَأَتَيْتُهُ مِنْ أَحَدِ شِقَّيْهِ فَقُلْتُ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي اسْتَغْفِرْ لِي فَقَالَ غَفَرَ اللَّهُ لَكُمْ ثُمَّ أَتَيْتُهُ مِنْ الشِّقِّ الْآخَرِ أَرْجُو أَنْ يَخُصَّنِي دُونَهُمْ فَقُلْتُ يَا رَسُولَ اللَّهِ اسْتَغْفِرْ لِي فَقَالَ بِيَدِهِ غَفَرَ اللَّهُ لَكُمْ فَقَالَ رَجُلٌ مِنْ النَّاسِ يَا رَسُولَ اللَّهِ الْعَتَائِرُ وَالْفَرَائِعُ قَالَ مَنْ شَاءَ عَتَرَ وَمَنْ شَاءَ لَمْ يَعْتِرْ وَمَنْ شَاءَ فَرَّعَ وَمَنْ شَاءَ لَمْ يُفَرِّعْ فِي الْغَنَمِ أُضْحِيَّتُهَا وَقَبَضَ أَصَابِعَهُ إِلَّا وَاحِدَةًأَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا يَحْيَى بْنُ زُرَارَةَ السَّهْمِيُّ قَالَ حَدَّثَنِي أَبِي عَنْ جَدِّهِ الْحَارِثِ بْنِ عَمْرٍو ح وَأَنْبَأَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ قَالَ حَدَّثَنِي يَحْيَى بْنُ زُرَارَةَ السَّهْمِيُّ قَالَ حَدَّثَنِي أَبِي عَنْ جَدِّهِ الْحَارِثِ بْنِ عَمْرٍو أَنَّهُ لَقِيَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ فَقُلْتُ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ وَأُمِّي اسْتَغْفِرْ لِي فَقَالَ غَفَرَ اللَّهُ لَكُمْ وَهُوَ عَلَى نَاقَتِهِ الْعَضْبَاءِ ثُمَّ اسْتَدَرْتُ مِنْ الشِّقِّ الْآخَرِ وَسَاقَ الْحَدِيثَ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nahs], ia berkata; telah memberitakan kepada kami [Abdullah yaitu Ibnu Al Mubarak] dari [Yahya yaitu Ibnu Zurarah bin Kuraim bin Al Harits bin 'Amr Al Bahili], ia berkata; saya mendengar [ayahku] menyebutkan bahwa ia mendengar [kakeknya yaitu Al Harits bin 'Amr] menceritakan bahwa ia berjumpa dengan Rasulullah shallallahu 'alaihi wasallam pada saat haji wada' dan beliau berada di atas ontanya yang berwarna Abu- Abu, kemudian saya mendatangi beliau dari salah satu sisi dan berkata; wahai Rasulullah, engkau ditebus dengan ayah dan ibuku, mintakan ampunan untukku. Kemudian beliau bersabda: \" Semoga Allah mengampuni kalian.\" Kemudian saya mendatanginya dari sisi yang lain, berharap beliau mengkhuskan saya tanpa mereka. Saya katakan; wahai Rasulullah, mintakan ampunan untukku. Kemudian beliau bersabda menggunakan tangannya: \" Semoga Allah mengampuni kalian.\" Kemudian seorang laki-laki berkata; wahai Rasulullah, bagaimana dengan 'atirah dan fara'? beliau bersabda: \"Barang siapa yang menginginkan maka ia menyembelih 'atirah dan barang siapa yang menginginkan maka ia tidak menyembelih 'atirah. Dan barang siapa yang menginginkan maka ia menyembelih fara' dan barang siapa yang menginginkan maka ia tidak menyembelih fara'. Dalam kambing terdapat kurbannya.\" Dan beliau mengenggam jari-jarinya kecuali satu. Telah mengabarkan kepadaku [Harun bin Abdullah], ia berkata; telah menceritakan kepadaku [Affan], ia berkata; telah menceritakan kepada kami [Yahya bin Zurarah As Sahmi], ia berkata; telah menceritakan kepadaku [ayahku] dari [kakekku yaitu Al Harits bin 'Amr]. telah menceritakan dan memberitakan kepadaku [Harun bin Abdullah], ia berkata; telah menceritakan kepada kami [Hisyam bin Abdul Malik], ia berkata; telah menceritakan kepadaku [Yahya bin Zurarah As Sahmi], ia berkata; telah menceritakan kepadaku [ayahku] dari [kakekku yaitu Al Harits bin 'Amr] bahwa ia bertemu dengan Rasulullah shallallahu 'alaihi wasallam pada saat haji wada' kemudian berkata; wahai Rasulullah, engkau ditebus dengan ayah dan ibuku, mintakan ampunan untukku. Kemudian beliau bersabda: \" Semoga Allah mengampuni kalian.\" Kemudian saya memutar dari sisi yang lain... kemudian ia menyebutkan hadits tersebut. "
            },
            {
                "number": 3943,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ ابْنِ عَوْنٍ قَالَ حَدَّثَنَا جَمِيلٌ عَنْ أَبِي الْمَلِيحِ عَنْ نُبَيْشَةَ قَالَذُكِرَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُنَّا نَعْتِرُ فِي الْجَاهِلِيَّةِ قَالَ اذْبَحُوا لِلَّهِ عَزَّ وَجَلَّ فِي أَيِّ شَهْرٍ مَا كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna], ia berkata; telah menceritakan kepada kami [Ibnu Abu Adi] dari [Ibnu 'Aun], ia berkata; telah menceritakan kepada kami [Jamil] dari [Abu Al Malih] dari [Nubaisyah], ia berkata; disebutkan kepada Nabi shallallahu 'alaihi wasallam... ia berkata; kami menyembelih 'atirah pada masa jahiliyah. Beliau bersabda: \"Sembelihlah untuk Allah 'azza wajalla pada bulan apa saja, berbuat baiklah kepada Allah dan berilah makan kepada orang lain.\" "
            },
            {
                "number": 3944,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا بِشْرٌ وَهُوَ ابْنُ الْمُفَضَّلِ عَنْ خَالِدٍ وَرُبَّمَا قَالَ عَنْ أَبِي الْمَلِيحِ وَرُبَّمَا ذَكَرَ أَبَا قِلَابَةَ عَنْ نُبَيْشَةَ قَالَنَادَى رَجُلٌ وَهُوَ بِمِنًى فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نَعْتِرُ عَتِيرَةً فِي الْجَاهِلِيَّةِ فِي رَجَبٍ فَمَا تَأْمُرُنَا يَا رَسُولَ اللَّهِ قَالَ اذْبَحُوا فِي أَيِّ شَهْرٍ مَا كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا قَالَ إِنَّا كُنَّا نُفْرِعُ فَرَعًا فَمَا تَأْمُرُنَا قَالَ فِي كُلِّ سَائِمَةٍ فَرَعٌ تَغْذُوهُ مَاشِيَتُكَ حَتَّى إِذَا اسْتَحْمَلَ ذَبَحْتَهُ وَتَصَدَّقْتَ بِلَحْمِهِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Bisyr yaitu Ibnu Al Mufadhdhal] dari [Khalid], terkadang ia berkata; dari [Abu Al Malih] dan terkadang ia menyebutkan [Abu Qilabah] dari [Nubaisyah], ia berkata; seseorang menyeru di Mina dan berkata; wahai Rasulullah, sesungguhnya dahulu kami menyembelih 'atirah pada masa jahiliyah pada Bulan Rajab. Maka apakah yang anda perintahkan wahai Rasulullah? beliau bersabda: \"Sembelihlah pada bulan apa saja, dan berbuat baiklah kepada Allah 'azza wajalla, dan berilah makan.\" beliau bersabda: \"Dalam setiap saimah (kambing yang berumur lehih dari setahun) terdapat fara', hewan ternakmu memberinya makan hingga apabila telah kuat untuk hamil maka engaku sembelih kambing tersebut dan bersedekah dengan dagingnya.\""
            },
            {
                "number": 3945,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمَلِيحِ وَأَحْسَبُنِي قَدْ سَمِعْتُهُ مِنْ أَبِي الْمَلِيحِ عَنْ نُبَيْشَةَ رَجُلٍ مِنْ هُذَيْلٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنِّي كُنْتُ نَهَيْتُكُمْ عَنْ لُحُومِ الْأَضَاحِيِّ فَوْقَ ثَلَاثٍ كَيْمَا تَسَعَكُمْ فَقَدْ جَاءَ اللَّهُ عَزَّ وَجَلَّ بِالْخَيْرِ فَكُلُوا وَتَصَدَّقُوا وَادَّخِرُوا وَإِنَّ هَذِهِ الْأَيَّامَ أَيَّامُ أَكْلٍ وَشُرْبٍ وَذِكْرِ اللَّهِ عَزَّ وَجَلَّ فَقَالَ رَجُلٌ إِنَّا كُنَّا نَعْتِرُ عَتِيرَةً فِي الْجَاهِلِيَّةِ فِي رَجَبٍ فَمَا تَأْمُرُنَا قَالَ اذْبَحُوا لِلَّهِ عَزَّ وَجَلَّ فِي أَيِّ شَهْرٍ مَا كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نُفْرِعُ فَرَعًا فِي الْجَاهِلِيَّةِ فَمَا تَأْمُرُنَا قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي كُلِّ سَائِمَةٍ مِنْ الْغَنَمِ فَرَعٌ تَغْذُوهُ غَنَمُكَ حَتَّى إِذَا اسْتَحْمَلَ ذَبَحْتَهُ وَتَصَدَّقْتَ بِلَحْمِهِ عَلَى ابْنِ السَّبِيلِ فَإِنَّ ذَلِكَ هُوَ خَيْرٌ",
                "id": "Telah mengabarkan kepada kami [Abdullah bin Muhammad Abdurrahman], ia berkata; telah menceritakan kepada kami [Ghundar] dari [Syu'bah] dari [Khalid] dari [Abu Qilabah] dari [Abu Al Malih] dan yakin telah mendengarnya dari Abu Al Malih dari [Nubaisyah] yaitu seorang laki-laki dari Hudzail dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya saya pernah melarang dari menyimpan daging kurban lebih dari tiga hari, agar boleh bagi kalian maka Allah 'azza wajalla telah datang dengan kebaikan, makan dan bersedekahlah serta simpanlah. Dan sesungguhnya hari-hari ini adalah hari-hari makan dan minum serta berdzikir kepada Allah 'azza wajalla pada bulan apa saja. Berbuatlah baik kepada Allah 'azza wajalla dan berilah makan.\" Kemudian seorang laki-laki berkata; wahai Rasulullah, dahulu kami menyembelih anak hewan yang pertama pada masa jahiliyah, maka apakah yang anda perintahkan kepada kami? Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dalam setiap kambing yang berumur lebih dari satu tahun terdapat anak pertama yang disembelih yang diberi makan oleh kambingmu hingga apabila telah siap untuk hamil maka engkau menyembelihnya dan mensedekahkan dagingnya untuk orang yang diperjalanan, maka hal tersebut adalah lebih baik."
            },
            {
                "number": 3946,
                "arab": "أَخْبَرَنَا أَبُو الْأَشْعَثِ أَحْمَدُ بْنُ الْمِقْدَامِ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ زُرَيْعٍ قَالَ أَنْبَأَنَا خَالِدٌ عَنْ أَبِي الْمَلِيحِ عَنْ نُبَيْشَةَ قَالَنَادَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ فَقَالَ إِنَّا كُنَّا نَعْتِرُ عَتِيرَةً يَعْنِي فِي الْجَاهِلِيَّةِ فِي رَجَبٍ فَمَا تَأْمُرُنَا قَالَ اذْبَحُوهَا فِي أَيِّ شَهْرٍ كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا قَالَ إِنَّا كُنَّا نُفْرِعُ فَرَعًا فِي الْجَاهِلِيَّةِ قَالَ فِي كُلِّ سَائِمَةٍ فَرَعٌ حَتَّى إِذَا اسْتَحْمَلَ ذَبَحْتَهُ وَتَصَدَّقْتَ بِلَحْمِهِ فَإِنَّ ذَلِكَ هُوَ خَيْرٌ",
                "id": "Telah mengabarkan kepada kami [Abu Al Asy'ats Ahmad bin Al Miqdad], ia berkata; telah menceritakan kepada kami [Yazid yaitu Ibnu Zurai'], ia berkata; telah memberitakan kepada kami [Khalid] dari [Abu Al Malih] dari [Nubaisyah], ia berkata; seorang laki-laki menyeru kepada Nabi shallallahu 'alaihi wasallam kemudian ia berkata; wahai Rasulullah, kami dahulu menyembelih pada sepuluh pertama bulan Rajab pada masa jahiliyah, maka apakah yang anda perintahkan kepada kami? Beliau bersabda: \"Sembelihlah pada bulan apa saja, dan berbuat baiklah kepada Allah 'azza wajalla, serta berilah makan.\" Orang tersebut berkata; sesungguhnya dahulu pada masa jahiliyah kami menyembelih anak hewan yang pertama. Beliau bersabda: \"Pada setiap kambing yang berumur lebih dari satu tahun terdapat anak pertama yang disembelih hingga apabila telah siap untuk hamil engkau menyembelihnya dan bersedekah dengan dagingnya, sesungguhnya hal tersebut adalah lebih baik. "
            },
            {
                "number": 3947,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ عَنْ ابْنِ عُلَيَّةَ عَنْ خَالِدٍ قَالَ حَدَّثَنِي أَبُو قِلَابَةَ عَنْ أَبِي الْمَلِيحِ فَلَقِيتُ أَبَا الْمَلِيحِ فَسَأَلْتُهُ فَحَدَّثَنِي عَنْ نُبَيْشَةَ الْهُذَلِيِّ قَالَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نَعْتِرُ عَتِيرَةً فِي الْجَاهِلِيَّةِ فَمَا تَأْمُرُنَا قَالَ اذْبَحُوا لِلَّهِ عَزَّ وَجَلَّ فِي أَيِّ شَهْرٍ مَا كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dari [Ibnu 'Ulayyah] dari [Khalid], ia berkata; telah menceritakan kepadaku [Abu Qilabah] dari [Abu Al Malih] kemudian Saya bertemu dengan Abu Al Malih dan bertanya kepadanya. Kemudian ia menceritakan kepadaku dari [Nusyaibah Al Hudzali], ia berkata; berkata seorang laki-laki; wahai Rasulullah, sesungguhnya kami dahulu menyembelih hewan di awal bulan Rajab pada masa jahiliyah, maka apakah yang anda perintahkan kepada kami? Beliau bersabda: \"Sembelihlah untuk 'azza wajalla pada bulan apa saja dan berbuatlah baik kepada Allah 'azza wajalla, dan berilah makanan. "
            },
            {
                "number": 3948,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ وَكِيعِ بْنِ عُدُسٍ عَنْ عَمِّهِ أَبِي رَزِينٍ لَقِيطِ بْنِ عَامِرٍ الْعُقَيْلِيِّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نَذْبَحُ ذَبَائِحَ فِي الْجَاهِلِيَّةِ فِي رَجَبٍ فَنَأْكُلُ وَنُطْعِمُ مَنْ جَاءَنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا بَأْسَ بِهِقَالَ وَكِيعُ بْنُ عُدُسٍ فَلَا أَدَعُهُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Abdurrahman], ia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Ya'la bin 'Atho`] dari [Waki' bin 'Adas] dari pamannya yaitu [Abu Razin Laqith bin 'Amir Al 'Uqali], ia berkata; saya berkata; wahai Rasulullah, sesungguhnya dahulu kami menyembelih sembelihan-sembelihan pada masa jahiliyah di Bulan Rajab, kemudian kami makan dan memberi makan orang yang datang kepada kami. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hal tersebut tidak mengapa.\" Waki' bin 'Adas berkata; saya tidak meninggalkannya. "
            },
            {
                "number": 3949,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ عَلَى شَاةٍ مَيِّتَةٍ مُلْقَاةٍ فَقَالَ لِمَنْ هَذِهِ فَقَالُوا لِمَيْمُونَةَ فَقَالَ مَا عَلَيْهَا لَوْ انْتَفَعَتْ بِإِهَابِهَا قَالُوا إِنَّهَا مَيْتَةٌ فَقَالَ إِنَّمَا حَرَّمَ اللَّهُ عَزَّ وَجَلَّ أَكْلَهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] dari [Maimun] bahwa Nabi shallallahu 'alaihi wasallam pernah melewati seekor kambing yang mati yang terbuang, kemudian beliau bersabda: \"Milik siapakah ini?\" mereka berkata; milik Maimunah. Lalu beliau bersabda: \"Tidak ada dosa baginya apabila ia memanfaatkan kulitnya.\" Mereka berkata; sesungguh itu adalah bangkai. Kemudian beliau bersabda: \"Sesungguhnya Allah 'azza wajalla hanya mengharamkan untuk memakannya.\""
            },
            {
                "number": 3950,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَمَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَاةٍ مَيِّتَةٍ كَانَ أَعْطَاهَا مَوْلَاةً لِمَيْمُونَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هَلَّا انْتَفَعْتُمْ بِجِلْدِهَا قَالُوا يَا رَسُولَ اللَّهِ إِنَّهَا مَيْتَةٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا حُرِّمَ أَكْلُهَا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] dengan membacakan riwayat dan saya mendengar, lafazhnya adalah lafazh Al Harits, dari [Ibnu Al Qasim], ia berkata; telah menceritakan kepadaku [Malik] dari [Ibnu Syihab] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam melewati seekor kambing yang telah mati, yang dahulunya beliau berikan kepada maula Maimunah isteri Nabi shallallahu 'alaihi wasallam. Kemudian beliau bersabda: \"Tidakkah kalian memanfaatkan kulitnya? Mereka berkata; wahai Rasulullah, itu adalah bangkai. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya yang diharamkan hanya memakannya.\""
            },
            {
                "number": 3951,
                "arab": "أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ خَالِدٍ الْقَطَّانُ الرَّقِّيُّ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ قَالَ أَخْبَرَنِي عَطَاءٌ مُنْذُ حِينٍ عَنْ ابْنِ عَبَّاسٍ أَخْبَرَتْنِي مَيْمُونَةُأَنَّ شَاةً مَاتَتْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَّا دَفَعْتُمْ إِهَابَهَا فَاسْتَمْتَعْتُمْ بِهِ",
                "id": "Telah mengabarkan kepada kami [Abdurrahman bin Khalid Al Qaththan Ar Raqqi], ia berkata; telah menceritakan kepada kami [Hajjaj], ia berkata; telah berkata; [Ibnu Juraij] telah mengabarkan kepadaku ['Amr bin Dinar], ia berkata; telah memberitakan kepadaku ['Atho`] sejak beberapa saat dari [Ibnu Abbas] telah mengabarkan kepadaku [Maimunah] bahwa terdapat sesekor kambing mati, kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Tidaklah kalian berikan kulitnya kemudian kalian menikmatinya? "
            },
            {
                "number": 3952,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ عَنْ سُفْيَانَ عَنْ عَمْرٍو عَنْ عَطَاءٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ قَالَمَرَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَاةٍ لِمَيْمُونَةَ مَيِّتَةٍ فَقَالَ أَلَّا أَخَذْتُمْ إِهَابَهَا فَدَبَغْتُمْ فَانْتَفَعْتُمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dari [Sufyan] dari ['Amr] dari ['Atho`], ia berkata; saya mendengar [Ibnu Abbas] berkata; Nabi shallallahu 'alaihi wasallam melewati seekor kambing milik Maimunah yang telah mati, kemudian beliau bersabda: \"Tidakkah kalian ambil kulitnya, kemudian kalian samak dan kalian manfaatkan?\""
            },
            {
                "number": 3953,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ الشَّعْبِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ سَوْدَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْمَاتَتْ شَاةٌ لَنَا فَدَبَغْنَا مَسْكَهَا فَمَا زِلْنَا نَنْبِذُ فِيهَا حَتَّى صَارَتْ شَنًّا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul Aziz bin Abu Rizmah], ia berkata; telah memberitakan kepada kami [Al Fadhl bin Musa] dari [Isma'il bin Abu Khalid] dari [Asy Sya'bi] dari [Ikrimah] dari [Ibnu Abbas] dari [Saudah] isteri Nabi shallallahu 'alaihi wasallam, ia berkata; kambing kami telah mati kemudian kami menyamak kulitnya dan kami masih terus membuat rendaman anggur padanya hingga menjadi geriba yang basah."
            },
            {
                "number": 3954,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ وَعَلِيُّ بْنُ حُجْرٍ عَنْ سُفْيَانَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ ابْنِ وَعْلَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا إِهَابٍ دُبِغَ فَقَدْ طَهُرَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dan [Ali bin Hujr] dari [Sufyan] dari [Zaid bin Aslam] dari [Ibnu Wa'lah] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kulit apapun apabila telah disamak maka telah menjadi suci.\""
            },
            {
                "number": 3955,
                "arab": "أَخْبَرَنِي الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ قَالَ حَدَّثَنَا إِسْحَقُ بْنُ بَكْرٍ وَهُوَ ابْنُ مُضَرَ قَالَ حَدَّثَنِي أَبِي عَنْ جَعْفَرِ بْنِ رَبِيعَةَ أَنَّهُ سَمِعَ أَبَا الْخَيْرِ عَنْ ابْنِ وَعْلَةَ أَنَّهُ سَأَلَ ابْنَ عَبَّاسٍ فَقَالَإِنَّا نَغْزُو هَذَا الْمَغْرِبَ وَإِنَّهُمْ أَهْلُ وَثَنٍ وَلَهُمْ قِرَبٌ يَكُونُ فِيهَا اللَّبَنُ وَالْمَاءُ فَقَالَ ابْنُ عَبَّاسٍ الدِّبَاغُ طَهُورٌ قَالَ ابْنُ وَعْلَةَ عَنْ رَأْيِكَ أَوْ شَيْءٌ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَلْ عَنْ رَسُولِ اللَّهِ",
                "id": "Telah mengabarkan kepada kami [Ar Rabi' bin Sulaiman bin Daud], ia berkata; telah menceritakan kepada kami [Ishaq bin Bakr yaitu Ibnu Mudhar], ia berkata; telah menceritakan kepadaku [ayahku] dari [Ja'far bin Rabi'ah] bahwa ia mendengar [Abu Al Khair] dari [Ibnu Wa'lah] bahwa ia bertanya kepada [Ibnu Abbas], ia berkata; Sesungguhnya kami memerangi Negeri Maghrib ini dan mereka adalah para penyembah berhala, dan mereka memiliki beberapa geriba yang berisi susu dan air. Kemudian Ibnu Abbas berkata; samak mensucikan. Ibnu Wa'lah berkata; apakah itu berasal dari pendapatmu atau sesuatu yang engkau dengar dari Rasulullah shallallahu 'alaihi wasallam? Ibnu Abbas berkata; melainkan dari Rasulullah shallallahu 'alaihi wasallam. "
            },
            {
                "number": 3956,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورِ بْنِ جَعْفَرٍ النَّيْسَابُورِيُّ قَالَ حَدَّثَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْسُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ جُلُودِ الْمَيْتَةِ فَقَالَ دِبَاغُهَا طَهُورُهَا",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Manshur bin Ja'far An Naisaburi], ia berkata; telah menceritakan kepada kami [Al Husain bin Muhammad], ia berkata; telah menceritakan kepada kami [Syarik] dari [Al A'masy] dari ['Umarah bin 'Umair] dari [Al Aswad] dari [Aisyah], ia berkata; Nabi shallallahu 'alaihi wasallam ditanya mengenai kulit binatang yang telah mati. Kemudian beliau bersabda: \"Penyamakannya adalah pensuciannya.\""
            },
            {
                "number": 3957,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ قَالَ حَدَّثَنَا عَمِّي قَالَ حَدَّثَنَا شَرِيكٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ جُلُودِ الْمَيْتَةِ فَقَالَ دِبَاغُهَا ذَكَاتُهَا",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'd bin Ibrahim bin Sa'd], ia berkata; telah menceritakan kepada kami [pamanku], ia berkata; telah menceritakan kepada kami [Syarik] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari [Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam ditanya mengenai kult bangkai. Kemudian beliau bersabda: \"Penyamakannya adalah pensuciannya.\""
            },
            {
                "number": 3958,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنَا مَالِكُ بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا إِسْرَائِيلُ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَاةُ الْمَيْتَةِ دِبَاغُهَا",
                "id": "Telah mengabarkan kepadaku [Ibrahim bin Ya'qub], ia berkata; telah menceritakan kepada kami [Malik bin Isma'il], ia berkata; telah menceritakan kepada kami [Israil] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari [Aisyah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penyembelihan bangkai adalah penyemakannya.\" "
            },
            {
                "number": 3959,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ وَاللَّيْثُ بْنُ سَعْدٍ عَنْ كَثِيرِ بْنِ فَرْقَدٍ أَنَّ عَبْدَ اللَّهِ بْنَ مَالِكِ بْنِ حُذَافَةَ حَدَّثَهُ عَنْ الْعَالِيَةِ بِنْتِ سُبَيْعٍ أَنَّ مَيْمُونَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَتْهَاأَنَّهُ مَرَّ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رِجَالٌ مِنْ قُرَيْشٍ يَجُرُّونَ شَاةً لَهُمْ مِثْلَ الْحِصَانِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَخَذْتُمْ إِهَابَهَا قَالُوا إِنَّهَا مَيْتَةٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُطَهِّرُهَا الْمَاءُ وَالْقَرَظُ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Daud] dari [Ibnu Wahb], ia berkata; telah mengabarkan kepadaku ['Amr bin Al Harits] dan [Al Laits bin Sa'd] dari [Katsir bin Farqad] bahwa [Abdullah bin Malik bin Hudzafah] telah menceritakan kepadanya dari [Al 'Aliyah binti Subai'] bahwa [Maimunah] istri Nabi shallallahu 'alaihi wasallam telah menceritakan kepadanya bahwa orang-orang Quraisy lewat didepan Rasulullah shallallahu 'alaihi wasallam dengan menyeret kambing mereka yang seperti kuda, lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepada mereka: \"Andai saja kalian mengambil kulitnya.\" Mereka berkata; wahai Rasulullah, sungguh itu adalah bangkai, lalu Rasulullah shallallahu alaihi wa sallam bersabda: \"Air dan daun akasia akan mensucikannya.\" "
            },
            {
                "number": 3960,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ ابْنِ أَبِي لَيْلَى عَنْ عَبْدِ اللَّهِ بْنِ عُكَيْمٍ قَالَقُرِئَ عَلَيْنَا كِتَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا غُلَامٌ شَابٌّ أَنْ لَا تَنْتَفِعُوا مِنْ الْمَيْتَةِ بِإِهَابٍ وَلَا عَصَبٍ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud], ia berkata; telah menceritakan kepada kami [Bisyr yaitu Ibnu Al Mufadhdhal], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibnu Abu Laila] dari [Abdullah bin 'Ukaim], ia berkata; telah dibacakan kepada kami surat Rasulullah shallallahu 'alaihi wasallam sedang saya adalah seorang pemuda: \"Janganlah kalian memanfaatkan dari bangkai baik kulit yang belum disamak ataupun uratnya.\""
            },
            {
                "number": 3961,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ عَبْدِ اللَّهِ بْنِ عُكَيْمٍ قَالَكَتَبَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ لَا تَسْتَمْتِعُوا مِنْ الْمَيْتَةِ بِإِهَابٍ وَلَا عَصَبٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Qudamah], ia berkata; telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Al Hakam] dari [Abdurrahman bin Abu Laila] dari [Abdullah bin 'Ukaim], ia berkata; Rasulullah shallallahu 'alaihi wasallam menulis surat kepada kami: \"\"Janganlah kalian menikmati dari bangkai baik kulit yang belum disamak ataupun uratnya.\""
            },
            {
                "number": 3962,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ هِلَالٍ الْوَزَّانِ عَنْ عَبْدِ اللَّهِ بْنِ عُكَيْمٍ قَالَكَتَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى جُهَيْنَةَ أَنْ لَا تَنْتَفِعُوا مِنْ الْمَيْتَةِ بِإِهَابٍ وَلَا عَصَبٍقَالَ أَبُو عَبْد الرَّحْمَنِ أَصَحُّ مَا فِي هَذَا الْبَابِ فِي جُلُودِ الْمَيْتَةِ إِذَا دُبِغَتْ حَدِيثُ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ وَاللَّهُ تَعَالَى أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr], ia berkata; telah menceritakan kepada kami [Syarik] dari [Hilal Al Wazzan] dari [Abdullah bin 'Ukaim], ia berkata; Rasulullah shallallahu 'alaihi wasallam menulis surat kepada penduduk Juhainah: \"Janganlah kalian memanfaatkan dari bangkai baik kulit baik kulit yang belum disamak ataupun uratnya.\" Abdurrahman berkata; yang paling shahih dalam bab ini mengenai kulit bangkai yang telah disamak adalah hadits Az Zuhri dari 'ubaidhullah bin Abdullah dari Ibnu Abbas dari Maimunah. Wallahu a'lam. "
            },
            {
                "number": 3963,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا بِشْرُ بْنُ عُمَرَ قَالَ حَدَّثَنَا مَالِكٌ ح وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ عَنْ أُمِّهِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ أَنْ يُسْتَمْتَعَ بِجُلُودِ الْمَيْتَةِ إِذَا دُبِغَتْ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Bisyr bin Umar], ia berkata; telah menceritakan kepada kami [Malik] dan [Harits bin Miskin] dengan membacakan riwayat dan saya mendengar dari [Ibnu Al Qasim], ia berkata; telah menceritakan kepadaku [Malik] dari [Yazid bin Abdullah bin Qusaith] dari [Muhammad bin Abdurrahman bin Tsauban] dari [ibunya] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan agar kulit bangkai dinikmati apabila telah disamak."
            },
            {
                "number": 3964,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ عَنْ يَحْيَى عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ جُلُودِ السِّبَاعِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dari [Yahya] dari [Ibnu Abu 'Arubah] dari [Qatadah] dari [Abu Al Malih] dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam melarang dari kulit binatang buas."
            },
            {
                "number": 3965,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ بَحِيرٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْحَرِيرِ وَالذَّهَبِ وَمَيَاثِرِ النُّمُورِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Utsman], ia berkata; telah menceritakan kepada kami [Baqiyah] dari [Bahir] dari [Khalid bin Ma'dan] dari [Al Miqdam bin Ma'dikarib], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari sutra, emas, dan menghamparkan kulit harimau untuk duduk."
            },
            {
                "number": 3966,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ بَحِيرٍ عَنْ خَالِدٍ قَالَ وَفَدَ الْمِقْدَامُ بْنُ مَعْدِيكَرِبَ عَلَى مُعَاوِيَةَ فَقَالَ لَهُأَنْشُدُكَ بِاللَّهِ هَلْ تَعْلَمُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ لُبُوسِ جُلُودِ السِّبَاعِ وَالرُّكُوبِ عَلَيْهَا قَالَ نَعَمْ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Utsman], ia berkata; telah menceritakan kepada kami [Baqiyah] dari [Bahir] dari [Khalid], ia berkata; [Al Miqdam bin Ma'dikarib] datang kepada [Mu'awiyah] sebagai utusan kemudian berkata; saya bersumpah kepada Allah dan bertanya kepadamu, apakah engkau mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam melarang memakai kulit binatang buas dan menaikinya? Ia berkata; ya."
            },
            {
                "number": 3967,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ الْفَتْحِ وَهُوَ بِمَكَّةَ يَقُولُ إِنَّ اللَّهَ عَزَّ وَجَلَّ وَرَسُولَهُ حَرَّمَ بَيْعَ الْخَمْرِ وَالْمَيْتَةِ وَالْخِنْزِيرِ وَالْأَصْنَامِ فَقِيلَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ شُحُومَ الْمَيْتَةِ فَإِنَّهُ يُطْلَى بِهَا السُّفُنُ وَيُدَّهَنُ بِهَا الْجُلُودُ وَيَسْتَصْبِحُ بِهَا النَّاسُ فَقَالَ لَا هُوَ حَرَامٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ ذَلِكَ قَاتَلَ اللَّهُ الْيَهُودَ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَمَّا حَرَّمَ عَلَيْهِمْ الشُّحُومَ جَمَّلُوهُ ثُمَّ بَاعُوهُ فَأَكَلُوا ثَمَنَهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari ['Atho` bin Abu Rabah] dari [Jabir bin Abdullah] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam pada tahun penaklukan Mekkah dan ia berada di Mekkah, beliau bersabda: \"Sesungguhnya Allah 'azza wajalla dan rasulNya telah mengharamkan menjual minuman keras, bangkai, babi, serta berhala.\" Kemudian beliau ditanya; wahai Rasulullah, bagaimana pendapatmu mengenai lemak bangkai, sesungguhnya lemak tersebut dapat digunakan untuk mengecat kapal, dan maminyaki kulit serta digunakan orang untuk penerangan. Maka beliau bersabda: \"Tidak, itu adalah haram.\" Pada saat itu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semoga Allah memerangi orang-orang Yahudi, sesungguhnya Allah 'azza wajalla tatkala mengharamkan lemak atas mereka maka mereka mencairkannya kemudian menjualnya dan memakan harganya.\""
            },
            {
                "number": 3968,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَأُبْلِغَ عُمَرُ أَنَّ سَمُرَةَ بَاعَ خَمْرًا قَالَ قَاتَلَ اللَّهُ سَمُرَةَ أَلَمْ يَعْلَمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَاتَلَ اللَّهُ الْيَهُودَ حُرِّمَتْ عَلَيْهِمْ الشُّحُومُ فَجَمَّلُوهَاقَالَ سُفْيَانُ يَعْنِي أَذَابُوهَا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Sufyan] dari ['Amr] dari [Thawus] dari [Ibnu Abbas], ia berkata; telah disampaikan kepada [Umar] bahwa Samurah telah menjual minuman keras, maka ia berkata; semoga Allah memerangi Samurah. Tidakkah ia mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semoga Allah memerangi orang-orang yahudi, telah diharamkan lemak atas mereka kemudian mereka mencairkannya.\" Sufyan berkata; yaitu mencairkannya."
            },
            {
                "number": 3969,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَأَنَّ فَأْرَةً وَقَعَتْ فِي سَمْنٍ فَمَاتَتْ فَسُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلْقُوهَا وَمَا حَوْلَهَا وَكُلُوهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] dari [Maimunah] bahwa seekor tikus terjatuh di dalam mentega kemudian mati. Kemudian Nabi shallallahu 'alaihi wasallam ditanya mengenai hal tersebut, lalu beliau bersabda: \"Buanglah tikus tersebut dan yang ada di sekitarnya dan makanlah mentega tersebut.\""
            },
            {
                "number": 3970,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ وَمُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ النَّيْسَابُورِيُّ عَنْ عَبْدِ الرَّحْمَنِ عَنْ مَالِكٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ فَأْرَةٍ وَقَعَتْ فِي سَمْنٍ جَامِدٍ فَقَالَ خُذُوهَا وَمَا حَوْلَهَا فَأَلْقُوهُ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim Ad Duraqi] dan [Muhammad bin Yahya bin Abdullah An Naisaburi] dari [Abdurrahman] dari [Malik] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] dari [Maimunah] bahwa Nabi shallallahu 'alaihi wasallam ditanya mengenai tikus yang jatuh di dalam mentega, maka beliau bersabda: \"Ambillah tikus tersebut dan yang ada di sekitarnya kemudian buanglah.\" "
            },
            {
                "number": 3971,
                "arab": "أَخْبَرَنَا خُشَيْشُ بْنُ أَصْرَمَ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ بُوذُوَيْهِ أَنَّ مَعْمَرًا ذَكَرَهُ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ سُئِلَ عَنْ الْفَأْرَةِ تَقَعُ فِي السَّمْنِ فَقَالَ إِنْ كَانَ جَامِدًا فَأَلْقُوهَا وَمَا حَوْلَهَا وَإِنْ كَانَ مَائِعًا فَلَا تَقْرَبُوهُ",
                "id": "Telah mengabarkan kepada kami [Khusyaisy bin Ashram], ia berkata; telah menceritakan kepada kami [Abdur Razzaq], ia berkata; telah memberitakan kepadaku [Abdurrahman bin Budzuwaih] bahwa [Ma'mar] menyebutkannya dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] dari [Maimunah] dari Nabi shallallahu 'alaihi wasallam bahwa beliau ditanya mengenai tikus yang jatuh di dalam mentega, maka beliau bersabda: 'Apabila mentega itu beku maka buanglah tikus tersebut dan yang ada disekitarnya dan apabila mentega itu cair maka janganlah kalian mendekatinya.\""
            },
            {
                "number": 3972,
                "arab": "أَخْبَرَنَا سَلَمَةُ بْنُ أَحْمَدَ بْنِ سُلَيْمِ بْنِ عُثْمَانَ الْفَوْزِيُّ قَالَ حَدَّثَنَا جَدِّي الْخَطَّابُ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حِمْيَرَ قَالَ حَدَّثَنَا ثَابِثُ بْنُ عَجْلَانَ قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ يَقُولُ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِعَنْزٍ مَيِّتَةٍ فَقَالَ مَا كَانَ عَلَى أَهْلِ هَذِهِ الشَّاةِ لَوْ انْتَفَعُوا بِإِهَابِهَا",
                "id": "Telah mengabarkan kepada kami [Salamah bin Ahmad bin Sulaim bin Utsman Al Fauzi], ia berkata; telah menceritakan kepada kami [kakekku yaitu Al Khathab], ia berkata; telah menceritakan kepada kami [Muhammad bin Humair], ia berkata; telah menceritakan kepada kami [Tsabit bin 'Ajlan], ia berkata; saya mendengar [Sa'id bin Jubair] berkata; saya mendengar [Ibnu Abbas] berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam pernah melewati kambing betina yang telah mati, kemudian beliau bersabda: \"Tidak berdosa atas pemilik kambing ini seandainya mereka memanfaatkan kulitnya.\""
            },
            {
                "number": 3973,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ قَالَ حَدَّثَنِي سَعِيدُ بْنُ خَالِدٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا وَقَعَ الذُّبَابُ فِي إِنَاءِ أَحَدِكُمْ فَلْيَمْقُلْهُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yahya], ia berkata; telah menceritakan kepada kami [Ibnu Abu Dzi`b], ia berkata; telah menceritakan kepadaku [Sa'id bin Khalid] dari [Abu Salamah] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila seekor lalat jatuh dalam bejana salah seorang diantara kalian maka hendaknya ia membenamkannya ke dalam air.\" "
            },
            {
                "number": 3974,
                "arab": "أَخْبَرَنَا الْإِمَامُ أَبُو عَبْدِ الرَّحْمَنِ النَّسَائِيُّ بِمِصْرَ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ سُوَيْدِ بْنِ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ عَاصِمٍ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍأَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّيْدِ فَقَالَ إِذَا أَرْسَلْتَ كَلْبَكَ فَاذْكُرْ اسْمَ اللَّهِ عَلَيْهِ فَإِنْ أَدْرَكْتَهُ لَمْ يَقْتُلْ فَاذْبَحْ وَاذْكُرْ اسْمَ اللَّهِ عَلَيْهِ وَإِنْ أَدْرَكْتَهُ قَدْ قَتَلَ وَلَمْ يَأْكُلْ فَكُلْ فَقَدْ أَمْسَكَهُ عَلَيْكَ فَإِنْ وَجَدْتَهُ قَدْ أَكَلَ مِنْهُ فَلَا تَطْعَمْ مِنْهُ شَيْئًا فَإِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ وَإِنْ خَالَطَ كَلْبُكَ كِلَابًا فَقَتَلْنَ فَلَمْ يَأْكُلْنَ فَلَا تَأْكُلْ مِنْهُ شَيْئًا فَإِنَّكَ لَا تَدْرِي أَيُّهَا قَتَلَ",
                "id": "Telah mengabarkan kepada kami Imam Abu Abdurrahman An Nasai di Mesir dengan membacakan riwayat dan saya mendengar, dari [Suwaid bin Nashr], ia berkata; telah memberitakan kepada kami [Abdullah bin Al Mubarak] dari ['Ashim] dari [Asy Sya'bi] dari ['Adi bin Hatim] bahwa ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan maka beliau bersabda: 'Apabila engkau melepaskan anjingmu maka sebutlah nama Allah padanya, kemudian apabila engkau mendapatinya belum membunuh maka sembelihlah dan sebutlah nama Allah padanya. Namun apabila ia telah membunuh dan belum memakan buruan maka makanlah sungguh ia telah menangkap untukmu. Apabila engkau mendapatinya telah memakan sebagiannya maka janganlah engkau memakan sedikitpun dari buruan tersebut, karena sesungguhnya anjing tersebut menangkap untuk dirinya sendiri. Dan apabila anjingmu bercampur dengan anjing- anjing yang lain kemudian membunuh buruan dan anjing- anjing tersebut tidak makan sesuatupun darinya maka sesungguhnya engkau tidak mengetahui anjing yang manakah yang membunuh.\""
            },
            {
                "number": 3975,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ عَنْ زَكَرِيَّا عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ مَا أَصَبْتَ بِحَدِّهِ فَكُلْ وَمَا أَصَبْتَ بِعَرْضِهِ فَهُوَ وَقِيذٌ وَسَأَلْتُهُ عَنْ الْكَلْبِ فَقَالَ إِذَا أَرْسَلْتَ كَلْبَكَ فَأَخَذَ وَلَمْ يَأْكُلْ فَكُلْ فَإِنَّ أَخْذَهُ ذَكَاتُهُ وَإِنْ كَانَ مَعَ كَلْبِكَ كَلْبٌ آخَرُ فَخَشِيتَ أَنْ يَكُونَ أَخَذَ مَعَهُ فَقَتَلَ فَلَا تَأْكُلْ فَإِنَّكَ إِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr], ia berkata; telah menceritakan kepada kami [Abdullah] dari [Zakariya] dari [Asy Sya'bi] dari [Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan dengan anak panah tanpa mata panah, maka beliau bersabda: \"Apa yang engkau kenai dengan bagian yang tajam maka makanlah dan apa yang engkau kenai dengan bagian yang tumpul maka itu adalah hewan yang mati karena terkena benda tumpul.\" Dan saya bertanya kepada beliau mengenai anjing, maka beliau bersabda: \"Apabila engkau melepaskan anjingmu kemudian ia menangkap dan tidak memakannya maka makanlah karena sesungguhnya tangkapannya adalah penyembelihannya, apabila terdapat anjing lain bersama dengan anjingmu kemudian kamu khawatir anjing tersebut menangkap bersamanya dan membunuh buruan tersebut maka janganlah engkau memakannya karena sesunggunya engkau hanya menyebutkan nama Allah pada anjingmu dan tidak menyebutkan nama Allah pada anjing yang lain.\""
            },
            {
                "number": 3976,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا أَبُو عَبْدِ الصَّمَدِ عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ قَالَ حَدَّثَنَا مَنْصُورٌ عَنْ إِبْرَاهِيمَ عَنْ هَمَّامِ بْنِ الْحَارِثِ عَنْ عَدِيِّ بْنِ حَاتِمٍأَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أُرْسِلُ الْكَلْبَ الْمُعَلَّمَ فَيَأْخُذُ فَقَالَ إِذَا أَرْسَلْتَ الْكَلْبَ الْمُعَلَّمَ وَذَكَرْتَ اسْمَ اللَّهِ عَلَيْهِ فَأَخَذَ فَكُلْ قُلْتُ وَإِنْ قَتَلَ قَالَ وَإِنْ قَتَلَ قُلْتُ أَرْمِي بِالْمِعْرَاضِ قَالَ إِذَا أَصَابَ بِحَدِّهِ فَكُلْ وَإِذَا أَصَابَ بِعَرْضِهِ فَلَا تَأْكُلْ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud], ia berkata; telah menceritakan kepada kami [Abu Abdush Shamad Abdul 'Aziz bin Abdush Shamad], ia berkata; telah menceritakan kepada kami [Manshur] dari [Ibrahim] dari [Hammam bin Al Harits] dari [Adi bin Hatim] bahwa ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam, ia berkata; saya mengirimkan anjing yang telah dilatih kemudian ia menangkap buruan. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila engkau mengirim anjing yang telah dilatih dan telah engkau sebutkan nama Allah padanya kemudian ia menangkap buruan maka makanlah.\" Saya katakan; walaupun ia telah membunuh buruan? Beliau bersabda: \"walaupun ia telah membunuhnya.\" Saya katakan; Apakah saya boleh memanah dengan anak panah yang tumpul? Beliau bersabda: \"Apabila ia mengenai dengannya bagian tajamnya maka makanlah dan apabila ia mengenai dengan bagian yang tumpul maka jangan engkau makan.\" "
            },
            {
                "number": 3977,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ عُبَيْدِ بْنِ مُحَمَّدٍ الْكُوفِيُّ الْمُحَارِبِيُّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ حَيْوَةَ بْنِ شُرَيْحٍ قَالَ سَمِعْتُ رَبِيعَةَ بْنَ يَزِيدَ يَقُولُ أَنْبَأَنَا أَبُو إِدْرِيسَ عَائِذُ اللَّهِ قَالَ سَمِعْتُ أَبَا ثَعْلَبَةَ الْخُشَنِيَّ يَقُولُقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا بِأَرْضِ صَيْدٍ أَصِيدُ بِقَوْسِي وَأَصِيدُ بِكَلْبِي الْمُعَلَّمِ وَبِكَلْبِي الَّذِي لَيْسَ بِمُعَلَّمٍ فَقَالَ مَا أَصَبْتَ بِقَوْسِكَ فَاذْكُرْ اسْمَ اللَّهِ عَلَيْهِ وَكُلْ وَمَا أَصَبْتَ بِكَلْبِكَ الْمُعَلَّمِ فَاذْكُرْ اسْمَ اللَّهِ وَكُلْ وَمَا أَصَبْتَ بِكَلْبِكَ الَّذِي لَيْسَ بِمُعَلَّمٍ فَأَدْرَكْتَ ذَكَاتَهُ فَكُلْ",
                "id": "Telah mengabarkan kepadaku [Muhammad bin 'Ubaid bin Muhammad Al Kufi Al Muharibi], ia berkata; telah menceritakan kepada kami [Abdullah bin Al Mubarak] dari [Haiwah bin Syuraih], ia berkata; saya mendengar [Rabi'ah bin Yazid] berkata; telah memberitakan kepada kami [Abu Idris 'Aidzullah], ia berkata; saya mendengar [Abu Tsa'labah Al Khusyani] berkata; saya berkata; wahai Rasulullah, sesungguhnya kami berada di lahan perburuan, saya berburu menggunakan busurku dan berburu dengan anjingku yang telah terlatih dan anjingku yang belum terlatih. Maka beliau bersabda: \"Apa yang engkau kenai dengan busurmu maka sebutlah nama Allah padanya dan makanlah, dan apa yang engkau kenai dengan anjingmu yang terlatih maka sebutlah nama Allah dan makanlah, dan apa yang engkau kenai dengan anjingmu yang belum terlatih kemudian engkau sempat menyembelihnya maka makanlah.\""
            },
            {
                "number": 3978,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ زُنْبُورٍ أَبُو صَالِحٍ الْمَكِّيُّ قَالَ حَدَّثَنَا فُضَيْلُ بْنُ عِيَاضٍ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ هَمَّامِ بْنِ الْحَارِثِ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أُرْسِلُ كِلَابِي الْمُعَلَّمَةَ فَيُمْسِكْنَ عَلَيَّ فَآكُلُ قَالَ إِذَا أَرْسَلْتَ كِلَابَكَ الْمُعَلَّمَةَ فَأَمْسَكْنَ عَلَيْكَ فَكُلْ قُلْتُ وَإِنْ قَتَلْنَ قَالَ وَإِنْ قَتَلْنَ قَالَ مَا لَمْ يَشْرَكْهُنَّ كَلْبٌ مِنْ سِوَاهُنَّ قُلْتُ أَرْمِي بِالْمِعْرَاضِ فَيَخْزِقُ قَالَ إِنْ خَزَقَ فَكُلْ وَإِنْ أَصَابَ بِعَرْضِهِ فَلَا تَأْكُلْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Zunbur Abu Shaleh Al Makki], ia berkata; telah menceritakan kepada kami [Fudhail bin 'Iyadh] dari [Manshur] dari [Ibrahim] dari [Hammam bin Al Harits] dari ['Adi bin Hatim], ia berkata; saya berkata; wahai Rasulullah, saya mengirim anjing- anjingku yang telah terlatih, kemudian mereka menangkap untukku, apakah saya boleh memakannya? Beliau bersabda: \"Apabila engkau mengirim anjing- anjing yang telah terlatih kemudian mereka menangkap untukmu maka makanlah.\" Saya katakan; walaupun anjing - anjing tersebut membunuh? Beliau bersabda: \"Walaupun anjing- anjing tersebut membunuh.\" Beliau bersabda: \"Selama tidak ada anjing lain yang ikut bersama mereka.\" Saya katakan; bolehkah saya memanah menggunakan anak panah yang tidka bermata kemudian menancap padanya? Beliau bersabda: \"Apabila menancap maka makanlah, dan apabila mengenai dengan bagian yang tumpul maka janganlah engkau makan.\""
            },
            {
                "number": 3979,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ قَالَ حَدَّثَنَا مُوسَى بْنُ أَعْيَنَ عَنْ مَعْمَرٍ عَنْ عَاصِمِ بْنِ سُلَيْمَانَ عَنْ عَامِرٍ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍأَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّيْدِ فَقَالَ إِذَا أَرْسَلْتَ كَلْبَكَ فَخَالَطَتْهُ أَكْلُبٌ لَمْ تُسَمِّ عَلَيْهَا فَلَا تَأْكُلْ فَإِنَّكَ لَا تَدْرِي أَيَّهَا قَتَلَهُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Yahya bin Al Harits], ia berkata; telah menceritakan kepada kami [Ahmad bin Abu Syu'aib], ia berkata; telah menceritakan kepada kami [Musa bin A'yan] dari [Ma'mar] dari ['Ashim bin Sulaiman] dari ['Amir Asy Sya'bi] dari ['Adi bin Hatim] bahwa Ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan, maka beliau bersabda: \"Apabila engkau mengirim anjingmu kemudian ada anjing- anjing lain yang bercampur dengannya dan engkau belum menyebut nama Allah padanya maka janganlah engkau makan, karena sesungguhnya engkau tidak tahu aniing manakah yang membunuhnya.\""
            },
            {
                "number": 3980,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا زَكَرِيَّا وَهُوَ ابْنُ أَبِي زَائِدَةَ قَالَ حَدَّثَنَا عَامِرٌ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْكَلْبِ فَقَالَ إِذَا أَرْسَلْتَ كَلْبَكَ فَسَمَّيْتَ فَكُلْ وَإِنْ وَجَدْتَ كَلْبًا آخَرَ مَعَ كَلْبِكَ فَلَا تَأْكُلْ فَإِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Yahya], ia berkata; telah menceritakan kepada kami [Zakariya yaitu Ibnu Abu Zaidah], ia berkata; telah menceritakan kepada kami ['Amir] dari ['Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai anjing. Kemudian beliau bersabda: \"Apabila engkau mengirimkan anjingmu maka sebutkan nama Allah dan makanlah, dan apabila engkau dapati anjing yang lain bersama dengan anjingmu maka janganlah engkau makan, karena sesungguhnya engkau hanya menyebut nama Allah pada anjingmu saja, dan tidak menyebutnya pada anjing yang lain.\""
            },
            {
                "number": 3981,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ قَالَ حَدَّثَنَا مُحَمَّدٌ وَهُوَ ابْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ قَالَ حَدَّثَنَا الشَّعْبِيُّ عَنْ عَدِيِّ بْنِ حَاتِمٍ وَكَانَ لَنَا جَارًا وَدَخِيلًا وَرَبِيطًا بِالنَّهْرَيْنِأَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُرْسِلُ كَلْبِي فَأَجِدُ مَعَ كَلْبِي كَلْبًا قَدْ أَخَذَ لَا أَدْرِي أَيَّهُمَا أَخَذَ قَالَ لَا تَأْكُلْ فَإِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِأَخْبَرَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ قَالَ حَدَّثَنَا عَنْ الشَّعْبِيِّ عَنْ عَدِيٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Abdullah bin Al Hakam], ia berkata; telah menceritakan kepada kami [Muhammad yaitu Ibnu Ja'far], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Sa'id bin Masruq], ia berkata; telah menceritakan kepada kami [Asy Sya'bi] dari ['Adi bin Hatim] dan ia adalah tetangga kami, orang yang bercampur dengan kami dan senantiasa tinggal di Nahrain, bahwa ia bertanya kepada Nabi shallallahu 'alaihi wasallam, ia berkata; saya mengirim ajingku dan saya dapati anjing lain bersamanya yang telah menangkap buruan, saya tidak tahu manakah diantara keduanya yang menangkap. Beliau bersabda: \"Janganlah engkau memakannya karena engkau hanya menyebutkan nama Allah pada anjingmu saja dan tidak menyebutkannya pada anjing yang lain.\" telah mengabarkan kepada kami [Ahmad bin Abdullah bin Al Hakam], ia berkata; telah menceritakan kepada kami [Muhammad], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Al Hakam], ia berkata; ia telah menceritakan kepada kami [Asy Sya'bi] dari ['Adi] dari Nabi shallallahu 'alaihi wasallam dengan hadits yang sama Seperti itu."
            },
            {
                "number": 3982,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو الْغَيْلَانِيُّ الْبَصْرِيُّ قَالَ حَدَّثَنَا بَهْزٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ عَنْ عَامِرٍ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ أُرْسِلُ كَلْبِي قَالَ إِذَا أَرْسَلْتَ كَلْبَكَ فَسَمَّيْتَ فَكُلْ وَإِنْ أَكَلَ مِنْهُ فَلَا تَأْكُلْ فَإِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ وَإِذَا أَرْسَلْتَ كَلْبَكَ فَوَجَدْتَ مَعَهُ غَيْرَهُ فَلَا تَأْكُلْ فَإِنَّكَ إِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin 'ubaidhullah bin 'Amr Al Ghailani Al Bashri], ia berkata; telah menceritakan kepada kami [Bahz], ia berkata; telah menceritakan kepada kami [Syu'bah], ia berkata; telah menceritakan kepada kami [Abdullah bin Abu As Safar] dari ['Amir Asy Sya'bi] dari ['Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam, saya katakan; saya mengirimkan anjingku. Beliau bersabda: \"Apabila engkau mengirim anjingmu dan engkau sebutkan nama Allah maka makanlah dan apabila ia memakan sebagian darinya maka jangan engakau makan, karena ia menangkap untuk dirinya dan apabila engkau mengirim anjingmu kemudian engkau dapati anjing lain bersamanya maka janganlah engkau makan, karena sesungguhnya engkau hanya menyebutkan nama Allah pada anjingmu saja dan tidak menyebutkannya pada selainnya."
            },
            {
                "number": 3983,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا أَبُو دَاوُدَ عَنْ شُعْبَةَ عَنْ ابْنِ أَبِي السَّفَرِ عَنْ الشَّعْبِيِّ وَعَنْ الْحَكَمِ عَنْ الشَّعْبِيِّ وَعَنْ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ أُرْسِلُ كَلْبِي فَأَجِدُ مَعَ كَلْبِي كَلْبًا آخَرَ لَا أَدْرِي أَيَّهُمَا أَخَذَ قَالَ لَا تَأْكُلْ فَإِنَّمَا سَمَّيْتَ عَلَى كَلْبِكَ وَلَمْ تُسَمِّ عَلَى غَيْرِهِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Abu Daud] dari [Syu'bah] dari [Ibnu Abu As Safar] dari [Asy Sya'bi]. Dan dari [Al Hakam] dari [Asy Sya'bi]. Juga dari [Sa'id bin Masruq] dari [Asy Sya'bi] dari ['Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam, saya katakan; saya mengirimkan anjingku kemuidian saya dapati anjing yang lain bersama anjingku, saya tidak tahu anjing yang manakah yang menangkap buruan tersebut. Beliau bersabda: \"Janganlah engkau makan, karena sesungguhnya engkau menyebutkan nama Allah pada anjingmu dan tidak menyebutkan pada selainnya."
            },
            {
                "number": 3984,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ هَارُونَ أَنْبَأَنَا زَكَرِيَّا وَعَاصِمٌ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ مَا أَصَابَ بِحَدِّهِ فَكُلْ وَمَا أَصَابَ بِعَرْضِهِ فَهُوَ وَقِيذٌ قَالَ وَسَأَلْتُهُ عَنْ كَلْبِ الصَّيْدِ فَقَالَ إِذَا أَرْسَلْتَ كَلْبَكَ وَذَكَرْتَ اسْمَ اللَّهِ عَلَيْهِ فَكُلْ قُلْتُ وَإِنْ قَتَلَ قَالَ وَإِنْ قَتَلَ فَإِنْ أَكَلَ مِنْهُ فَلَا تَأْكُلْ وَإِنْ وَجَدْتَ مَعَهُ كَلْبًا غَيْرَ كَلْبِكَ وَقَدْ قَتَلَهُ فَلَا تَأْكُلْ فَإِنَّكَ إِنَّمَا ذَكَرْتَ اسْمَ اللَّهِ عَزَّ وَجَلَّ عَلَى كَلْبِكَ وَلَمْ تَذْكُرْ عَلَى غَيْرِهِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman], ia berkata; telah menceritakan kepada kami [Yazid yaitu Ibnu Harun], telah memberitakan kepada kami [Zakariya] dan ['Ashim] dari [Asy Sya'bi] dari ['Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan dengan anak panah tanpa mata panah, maka beliau bersabda: \"Apa yang engkau kenai dengan bagian yang tajam maka makanlah dan apa yang engkau kenai dengan bagian yang tumpul maka itu adalah hewan yang mati karena terkena benda tumpul.\" Dan saya bertanya kepada beliau mengenai anjing pemburu, maka beliau bersabda: \"Apabila engkau mengirimkan anjingmu dan menyebut nama Allah padanya maka makanlah.\" Saya katakan; walaupun ia membunuhnya? Beliau bersabda: \"Walaupun ia membunuhnya, apabila ia makan sebagian darinya maka janganlah engkau makan, dan jika engkau dapati bersamanya terdapat anjing lain selain anjingmu dan ia telah membunuhnya maka jangan engkau makan karena sesungguhnya engkau hanya menyebutkan nama Allah 'azza wajalla pada anjingmu dan tidak engkau sebutkan pada anjing yang lain.\""
            },
            {
                "number": 3985,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ قَالَ حَدَّثَنَا مُوسَى بْنُ أَعْيَنَ عَنْ مَعْمَرٍ عَنْ عَاصِمِ بْنِ سُلَيْمَانَ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ الطَّائِيِّأَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّيْدِ قَالَ إِذَا أَرْسَلْتَ كَلْبَكَ فَذَكَرْتَ اسْمَ اللَّهِ عَلَيْهِ فَقَتَلَ وَلَمْ يَأْكُلْ فَكُلْ وَإِنْ أَكَلَ مِنْهُ فَلَا تَأْكُلْ فَإِنَّمَا أَمْسَكَهُ عَلَيْهِ وَلَمْ يُمْسِكْ عَلَيْكَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Yahya bin Al Harits], ia berkata; telah menceritakan kepada kami [Ahmad bin Abu Syu'aib], ia berkata; telah menceritakan kepada kami [Musa bin A'yan] dari [Ma'mar] dari ['Ashim bin Sulaiman] dari [Asy Sya'bi] dari ['Adi bin Hatim Ath Tha'i] bahwa Ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan, beliau bersabda: \"Apabila engkau mengirim anjingmu dan engkau sebutkan nama Allah padanya kemudian ia membunuh dan tidak makan maka makanlah, dan apabila ia makan sebagian darinya maka jangan engkau makan, karena sesungguhnya ia menangkap untuk dirinya dan tidak menangkap untukmu.\""
            },
            {
                "number": 3986,
                "arab": "أَخْبَرَنَا كَثِيرُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي ابْنُ السَّبَّاقِ قَالَ أَخْبَرَتْنِي مَيْمُونَةُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ جِبْرِيلُ عَلَيْهِ السَّلَام لَكِنَّا لَا نَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلَا صُورَةٌ فَأَصْبَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ فَأَمَرَ بِقَتْلِ الْكِلَابِ حَتَّى إِنَّهُ لَيَأْمُرُ بِقَتْلِ الْكَلْبِ الصَّغِيرِ",
                "id": "Telah mengabarkan kepada kami [Katsir bin 'Ubaid], ia berkata; telah menceritakan kepada kami [Muhammad bin Harb] dari [Az Zubaidi] dari [Az Zuhri], ia berkata; telah mengabarkan kepadaku [Ibnu As Sabbaq], ia berkata; telah mengabarkan kepadaku [Maimunah] bahwa Jibril berkata kepada Rasulullah shallallahu 'alaihi wasallam; kami tidak memasuki rumah yang padanya terdapat anjing dan gambar. Kemudian pada pagi hari tersebut Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk membunuh anjing hingga beliau memerintahkan untuk membunuh anjing kecil. "
            },
            {
                "number": 3987,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْكِلَابِ غَيْرَ مَا اسْتَثْنَى مِنْهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk membunuh anjing tanpa terkecuali. "
            },
            {
                "number": 3988,
                "arab": "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ قَالَ قَالَ ابْنُ شِهَابٍ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَافِعًا صَوْتَهُ يَأْمُرُ بِقَتْلِ الْكِلَابِ فَكَانَتْ الْكِلَابُ تُقْتَلُ إِلَّا كَلْبَ صَيْدٍ أَوْ مَاشِيَةٍ",
                "id": "Telah mengabarkan kepada kami [Wahb bin Bayan], ia berkata; telah menceritakan kepada kami [Ibnu Wahb], ia berkata; telah mengabarkan kepadaku [Yunus], ia berkata; [Ibnu Syihab] berkata; telah menceritakan kepadaku [Salim bin Abdullah] dari [ayahnya], ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam meninggikan suaranya memerintahkan untuk membunuh anjing, maka semua anjing dibunuh kecuali anjing pemburu dan anjing penjaga hewan ternak. "
            },
            {
                "number": 3989,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ عَمْرٍو عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْكِلَابِ إِلَّا كَلْبَ صَيْدٍ أَوْ كَلْبَ مَاشِيَةٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Hammad] dari ['Amr] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk membunuh seluruh anjing kecuali anjing pemburu dan anjing penjaga hewan ternak."
            },
            {
                "number": 3990,
                "arab": "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا يُونُسُ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْلَا أَنَّ الْكِلَابَ أُمَّةٌ مِنْ الْأُمَمِ لَأَمَرْتُ بِقَتْلِهَا فَاقْتُلُوا مِنْهَا الْأَسْوَدَ الْبَهِيمَ وَأَيُّمَا قَوْمٍ اتَّخَذُوا كَلْبًا لَيْسَ بِكَلْبِ حَرْثٍ أَوْ صَيْدٍ أَوْ مَاشِيَةٍ فَإِنَّهُ يَنْقُصُ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌ",
                "id": "Telah mengabarkan kepada kami [Imran bin Musa], ia berkata; telah menceritakan kepada kami [Yazid bin Zurai'], ia berkata; telah menceritakan kepada kami [Yunus] dari [Al Hasan] dari [Abdullah bin Mughaffal], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jikalau anjing itu bukan umat diantara umat niscaya saya akan memerintahkan untuk membunuhnya, bunuhlah anjing yang hitam pekat, siapapun orang yang mengambil anjing yang bukan anjing penjaga kebun atau anjing pemburu atau penjaga hewan ternak maka sesungguhnya akan berkurang dari pahalanya setiap hari sebanyak satu qirath. "
            },
            {
                "number": 3991,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ وَيَحْيَى بْنُ سَعِيدٍ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ عَليِّ بْنِ مُدْرِكٍ عَنْ أَبِي زُرْعَةَ عَنْ عَبْدِ اللَّهِ بْنِ نُجَيٍّ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمَلَائِكَةُ لَا تَدْخُلُ بَيْتًا فِيهِ صُورَةٌ وَلَا كَلْبٌ وَلَا جُنُبٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar], ia berkata; telah menceritakan kepada kami [Muhammad] dan [Yahya bin Sa'id] mereka berkata; telah menceritakan kepada kami [Syu'bah] dari [Ali bin Mudrik] dari [Abu Zur'ah] dari [Abdullah bin Nuji] dari [Ayahnya] dari [Ali bin Abu Thalib] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Malaikat tidak masuk rumah yang padanya terdapat gambar dan anjing serta orang yang junub.\""
            },
            {
                "number": 3992,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ وَإِسْحَقُ بْنُ مَنْصُورٍ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ أَبِي طَلْحَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلَا صُورَةٌ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dan [Ishaq bin Manshur] dari [Sufyan] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] dari [Abu Thalhah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Malaikat tidak masuk rumah yang padanya terdapat anjing dan gambar.\""
            },
            {
                "number": 3993,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ خَالِدِ بْنِ خَلِيٍّ قَالَ حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ عَنْ أَبِيهِ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي ابْنُ السَّبَّاقِ عَنْ ابْنِ عَبَّاسٍ قَالَ أَخْبَرَتْنِي مَيْمُونَةُ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصْبَحَ يَوْمًا وَاجِمًا فَقَالَتْ لَهُ مَيْمُونَةُ أَيْ رَسُولَ اللَّهِ لَقَدْ اسْتَنْكَرْتُ هَيْئَتَكَ مُنْذُ الْيَوْمَ فَقَالَ إِنَّ جِبْرِيلَ عَلَيْهِ السَّلَام كَانَ وَعَدَنِي أَنْ يَلْقَانِي اللَّيْلَةَ فَلَمْ يَلْقَنِي أَمَا وَاللَّهِ مَا أَخْلَفَنِي قَالَ فَظَلَّ يَوْمَهُ كَذَلِكَ ثُمَّ وَقَعَ فِي نَفْسِهِ جَرْوُ كَلْبٍ تَحْتَ نَضَدٍ لَنَا فَأَمَرَ بِهِ فَأُخْرِجَ ثُمَّ أَخَذَ بِيَدِهِ مَاءً فَنَضَحَ بِهِ مَكَانَهُ فَلَمَّا أَمْسَى لَقِيَهُ جِبْرِيلُ عَلَيْهِ السَّلَام فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ كُنْتَ وَعَدْتَنِي أَنْ تَلْقَانِي الْبَارِحَةَ قَالَ أَجَلْ وَلَكِنَّا لَا نَدْخُلُ بَيْتًا فِيهِ كَلْبٌ وَلَا صُورَةٌ قَالَ فَأَصْبَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ ذَلِكَ الْيَوْمِ فَأَمَرَ بِقَتْلِ الْكِلَابِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Khalid bin Khali], ia berkata; telah menceritakan kepada kami [Bisyr bin Syu'aib] dari [ayahnya] dari [Az Zuhri], ia berkata; telah mengabarkan kepadaku [Ibnu As Sibaq] dari [Ibnu Abbas], ia berkata; telah mengabarkan kepadaku [Maimunah] isteri Nabi shallallahu 'alaihi wasallam bahwa Rasulullah shallallahu 'alaihi wasallam sangat bersedih di pagi hari, kemudian Maimunah berkata kepadanya; wahai Rasulullah, sungguh saya tidak mengetahui keadaan anda sejak hari ini. Beliau bersabda: \"Sesungguhnya Jibril 'alaihis salam telah berjanji untuk menemuiku pada malam ini, kemudian Ia tidak menemuiku. Demi Allah ia tidak pernah mengingkari janjinya kepadaku.\" Ibnu Abbas berkata; Beliau selama seharian dalam keadaan demikian, kemudian beliau teringat anjing kecil di bawah ranjang kami. Kemudian beliau memerintahkan agar anjing tersebut dikeluarkan, maka anjing tersebut dikeluarkan. Kemudian beliau mengambil air dengan tangannya dan mempercici tempat anjing tersebut. Kemudian pada sore harinya beliau berjumpa dengan Jibril 'alaihis salam. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Sungguh engkau telah berjanji kepadaku untuk menemuiku tadi malam.\" Jibril berkata; benar. Akan tetapi kami tidak memasuki rumah padanya terdapat anjing dan gambar. Ibnu Abbas berkata; kemudian pada pagi harinya Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk membunuh Anjing. "
            },
            {
                "number": 3994,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرِ بْنِ سُوَيْدٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ وَهُوَ ابْنُ الْمُبَارَكِ عَنْ حَنْظَلَةَ قَالَ سَمِعْتُ سَالِمًا يُحَدِّثُ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اقْتَنَى كَلْبًا نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِ إِلَّا ضَارِيًا أَوْ صَاحِبَ مَاشِيَةٍ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr bin Suwaid], ia berkata; telah memberitakan kepada kami [Abdullah yaitu Ibnu Al Mubarak] dari [Hanzhalah], ia berkata; saya mendengar [Salim] menceritakan dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang memelihara anjing maka telah berkurang dari pahalanya setiap hari dua sebanyak dua qirath kecuali anjing pemburu atau anjing penjaga hewan ternak.\""
            },
            {
                "number": 3995,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرِ بْنِ إِيَاسِ بْنِ مُقَاتِلِ بْنِ مُشَمْرِجِ بْنِ خَالِدٍ السَّعْدِيُّ عَنْ إِسْمَعِيلَ وَهُوَ ابْنُ جَعْفَرٍ عَنْ يَزِيدَ وَهُوَ ابْنُ خُصَيْفَةَ قَالَ أَخْبَرَنِي السَّائِبُ بْنُ يَزِيدَأَنَّهُ وَفَدَ عَلَيْهِمْ سُفْيَانُ بْنُ أَبِي زُهَيْرٍ الشَّنَائِيُّ وَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اقْتَنَى كَلْبًا لَا يُغْنِي عَنْهُ زَرْعًا وَلَا ضَرْعًا نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ قُلْتُ يَا سُفْيَانُ أَنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ وَرَبِّ هَذَا الْمَسْجِدِ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr bin Iyas bin Muqatil bin Musyamrij bin Khalid As Sa'di] dari [Isma'il yaitu Ibnu Ja'far] dari [Yazid yaitu Ibnu Khushaifah], ia berkata; telah mengabarkan kepadaku [As Saib bin Yazid] bahwa telah datang sebagai utusan kepada mereka Sufyan bin Abu Zuhair Asy Syanai dan ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang memelihara anjing tidak ia manfaatkan untuk menjaga tanaman dan hewan ternak maka telah berkurang dari pahala amalannya Setiap hari sebanyak dua qirath. Saya bertanya; wahai Sufyan, apakah engkau mendengar hal ini dari Rasulullah shallallahu 'alaihi wasallam? Ia berkata; ya, demi Tuhan masjid ini. "
            },
            {
                "number": 3996,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ سَمِعَهُ يَقُولُإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَمْسَكَ كَلْبًا إِلَّا كَلْبًا ضَارِيًا أَوْ كَلْبَ مَاشِيَةٍ نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang menahan anjing kecuali anjing pemburu dan anjing penjaga hewan ternak maka telh berkurng dari pahalanya setiap hari sebanyak dua qirath. "
            },
            {
                "number": 3997,
                "arab": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ عَنْ سُفْيَانَ قَالَ حَدَّثَنَا الزُّهْرِيُّ عَنْ سَالِمٍ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اقْتَنَى كَلْبًا إِلَّا كَلْبَ صَيْدٍ أَوْ مَاشِيَةٍ نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِ",
                "id": "Telah mengabarkan kepada kami [Abdul Jabbar bin Al 'Ala`] dari [Sufyan], ia berkata; telah menceritakan kepada kami [Az Zuhri] dari [Salim] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: 'Barang siapa yang memelihara anjing selain anjing pemburu dan penjaga hewan ternak maka telah berkurang dari pahalanya setiap hari sebanyak dua qirath.\""
            },
            {
                "number": 3998,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى وَابْنُ أَبِي عَدِيٍّ وَمُحَمَّدُ بْنُ جَعْفَرٍ عَنْ عَوْفٍ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اتَّخَذَ كَلْبًا إِلَّا كَلْبَ صَيْدٍ أَوْ مَاشِيَةٍ أَوْ زَرْعٍ نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar], ia berkata; telah menceritakan kepada kami [Yahya] dan [Ibnu Abu 'Adi] dan [Muhammad bin Ja'far] dari ['Auf] dari [Al Hasan] dari [Abdullah bin Mughaffal] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barang siapa yang mengambil anjing selain anjing pemburu dan anjing penjaga hewan ternak dan tanaman maka telah berkurang dari pahalanya setiap hari sebanyak satu qirath.\" "
            },
            {
                "number": 3999,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اتَّخَذَ كَلْبًا إِلَّا كَلْبَ صَيْدٍ أَوْ زَرْعٍ أَوْ مَاشِيَةٍ نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Abdur Razzaq], ia berkata; telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"\"Barang siapa yang mengambil anjing selain anjing pemburu dan anjing penjaga hewan tanaman dan ternak maka telah berkurang dari amalannya setiap hari sebanyak satu qirath.\" "
            },
            {
                "number": 4000,
                "arab": "أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ قَالَ أَنْبَأَنَا ابْنُ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اقْتَنَى كَلْبًا لَيْسَ بِكَلْبِ صَيْدٍ وَلَا مَاشِيَةٍ وَلَا أَرْضٍ فَإِنَّهُ يَنْقُصُ مِنْ أَجْرِهِ قِيرَاطَانِ كُلَّ يَوْمٍ",
                "id": "Telah mengabarkan kepada kami [Wahb bin Bayan], ia berkata; telah menceritakan kepada kami [Ibnu Wahb], ia berkata; telah menceritakan kepadaku [Yunus], ia berkata; telah memberitakan kepada kami [Ibnu Syihab] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Barang siapa yang memelihara anjing yang bukan anjing pemburu dan anjing penjaga hewan ternak dan kebun maka akan berkurang dari pahalanya setiap hari sebanyak dua qirath.\" "
            },
            {
                "number": 4001,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ جَعْفَرٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي حَرْمَلَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اقْتَنَى كَلْبًا إِلَّا كَلْبَ مَاشِيَةٍ أَوْ كَلْبَ صَيْدٍ نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌقَالَ عَبْدُ اللَّهِ وَقَالَ أَبُو هُرَيْرَةَ أَوْ كَلْبَ حَرْثٍ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr], ia berkata; telah menceritakan kepada kami [Isma'il yaitu Ibnu Ja'far], ia berkata; telah menceritakan kepada kami [Muhammad bin Abu Harmalah] dari [Salim bin Abdullah] dari [Ayahnya], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"\"Barang siapa yang memeliha anjing kecuali anjing penjaga hewan ternak, pemburu maka telah berkurang dari pahalanya setiap hari sebanyak satu qirath. Berkata Abdullah dan berkata Abu Hurairah; atau anjing penjaga tanaman\" "
            },
            {
                "number": 4002,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ أَنَّهُ سَمِعَ أَبَا مَسْعُودٍ عُقْبَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari [Abu Bakar bin Abdurrahman bin Al Harits bin Hisyam] bahwa ia mendengar [Abu Mas'ud 'Uqbah] berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari harga anjing dan memberi upah pelacur serta bayaran dukun."
            },
            {
                "number": 4003,
                "arab": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَنْبَأَنَا مَعْرُوفُ بْنُ سُوَيْدٍ الْجُذَامِيُّ أَنَّ عَلِيَّ بْنَ رَبَاحٍ اللَّخْمِيَّ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ ثَمَنُ الْكَلْبِ وَلَا حُلْوَانُ الْكَاهِنِ وَلَا مَهْرُ الْبَغِيِّ",
                "id": "Telah mengabarkan kepada kami [Yunus bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Ibnu Wahb], ia berkata; telah memberitakan kepada kami [Ma'ruf bin Suwaid Al Judzami] bahwa [Ali bin Radbah Al Lakhmi] telah menceritakan kepada kepadanya bahwa ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Tidak halal harga anjing, bayaran dukun dan upah pezina.\""
            },
            {
                "number": 4004,
                "arab": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ عَنْ يَحْيَى عَنْ مُحَمَّدِ بْنِ يُوسُفَ عَنْ السَّائِبِ بْنِ يَزِيدَ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرُّ الْكَسْبِ مَهْرُ الْبَغِيِّ وَثَمَنُ الْكَلْبِ وَكَسْبُ الْحَجَّامِ",
                "id": "Telah mengabarkan kepada kami [Syu'aib bin Yusuf] dari [Yahya] dari [Muhammad bin Yusuf] dari [As Saib bin Yazid] dari [Rafi' bin Khadij], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seburuk-buruk pekerjaan adalah upah pelacur, harga anjing dan profesi tukang bekam.\""
            },
            {
                "number": 4005,
                "arab": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ الْمِقْسَمِيُّ قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَمَنِ السِّنَّوْرِ وَالْكَلْبِ إِلَّا كَلْبَ صَيْدٍقَالَ أَبُو عَبْد الرَّحْمَنِ وَحَدِيثُ حَجَّاجٍ عَنْ حَمَّادِ بْنِ سَلَمَةَ لَيْسَ هُوَ بِصَحِيحٍ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Al Hasan Al Miqsami], ia berkata; telah menceritakan kepada kami [Hajjaj bin Muhammad] dari [Hammad bin Salamah] dari [Abu Az Zubair] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari harga kucing dan anjing kecuali anjing pemburu. Abu Abdurrahman berkata; dan hadits Hajjaj dari Hammad bin Salamah tidak shahih. "
            },
            {
                "number": 4006,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا ابْنُ سَوَاءٍ قَالَ حَدَّثَنَا سَعِيدٌ عَنْ أَبِي مَالِكٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ لِي كِلَابًا مُكَلَّبَةً فَأَفْتِنِي فِيهَا قَالَ مَا أَمْسَكَ عَلَيْكَ كِلَابُكَ فَكُلْ قُلْتُ وَإِنْ قَتَلْنَ قَالَ وَإِنْ قَتَلْنَ قَالَ أَفْتِنِي فِي قَوْسِي قَالَ مَا رَدَّ عَلَيْكَ سَهْمُكَ فَكُلْ قَالَ وَإِنْ تَغَيَّبَ عَلَيَّ قَالَ وَإِنْ تَغَيَّبَ عَلَيْكَ مَا لَمْ تَجِدْ فِيهِ أَثَرَ سَهْمٍ غَيْرَ سَهْمِكَ أَوْ تَجِدْهُ قَدْ صَلَّ يَعْنِي قَدْ أَنْتَنَقَالَ ابْنُ سَوَاءٍ وَسَمِعْتُهُ مِنْ أَبِي مَالِكٍ عُبَيْدِ اللَّهِ بْنِ الْأَخْنَسِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Ibnu Sawa`], ia berkata; telah menceritakan kepada kami [Sa'id] dari [Abu Malik] dari ['Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; wahai Rasulullah, sesungguhnya saya memiliki beberapa ekor anjing yang terlatih, maka berilah saya fatwa mengenainya! Beliau bersabda: \"Apa yang ditangkap anjing-anjingmu untukmu makanlah.\" Saya katakan; walaupun mereka membunuh buruan? Beliau bersabda: \"Walaupun mereka membunuh buruan.\" Ia berkata; berilah saya fatwa mengenai busurku. Beliau bersabda: \"Apa yang dibawa kembali oleh anak panahmu untukmu maka makanlah.\" Ia berkata; walaupun tidak kelihatan olehku? Beliau bersabda: \" Walaupun tidak kelihatan olehmu selama engkau tidak mendapati bekas anak panah selain anak panahmu atau engkau mendapatinya telah membusuk.\" [Ibnu Sawa`] berkata; saya mendengarnya dari [Abu Malik 'ubaidhullah bin Al Akhnas] dari ['Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] dari Nabi shallallahu 'alaihi wasallam. "
            },
            {
                "number": 4007,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ عَنْ زَائِدَةَ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَبَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذِي الْحُلَيْفَةِ مِنْ تِهَامَةَ فَأَصَابُوا إِبِلًا وَغَنَمًا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أُخْرَيَاتِ الْقَوْمِ فَعَجَّلَ أَوَّلُهُمْ فَذَبَحُوا وَنَصَبُوا الْقُدُورَ فَدُفِعَ إِلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِالْقُدُورِ فَأُكْفِئَتْ ثُمَّ قَسَّمَ بَيْنَهُمْ فَعَدَلَ عَشْرًا مِنْ الشَّاءِ بِبَعِيرٍ فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ نَدَّ بَعِيرٌ وَلَيْسَ فِي الْقَوْمِ إِلَّا خَيْلٌ يَسِيرَةٌ فَطَلَبُوهُ فَأَعْيَاهُمْ فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ اللَّهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِهَذِهِ الْبَهَائِمِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَمَا غَلَبَكُمْ مِنْهَا فَاصْنَعُوا بِهِ هَكَذَا",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman], ia berkata; telah menceritakan kepada kami [Husain bin Ali] dari [Zaidah] dari [Sa'id bin Masruq] dari ['Abayah bin Rifa'ah bin Rafi'] dari [Rafi' bin Khadij], ia berkata; ketika kami bersama Rasulullah shallallahu 'alaihi wasallam di Dzul Hulaifah dari Mekkah mereka mendapatkan unta dan kambing, sedangkan Rasulullah shallallahu 'alaihi wasallam berada pada beberapa kelompok orang yang terlambat, kemudian orang yang pertama bersegera menyembelih dan meletakkan kuali, kemudian Rasulullah shallallahu 'alaihi wasallam terdorong untuk menuju kepada mereka kemudian beliau memerintahkan agar isi kuali dikeluarkan, kemudian beliau membagi diantara mereka, dan menyamakan sepuluh kambing dengan satu unta. Ketika mereka dalam keadaan demikian, tiba-tiba terdapat unta yang lepas, mereka tidak memiliki kecuali kuda yang tidak kencang larinya. Mereka mencarinya dan lelah karenanya, kemudin seorang laki-laki memanahnya dengan anak panah kemudian Allah menahan unta tersebut. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya binatang-binatang ini memiliki binanatang-binatang yang menjadi liar, seperti liarnya binatang liar, maka apa yang kalian mampu lakukan terhadapnya maka lakukanlah.\" "
            },
            {
                "number": 4008,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ مَنِيعٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ قَالَ أَخْبَرَنِي عَاصِمٌ الْأَحْوَلُ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّيْدِ فَقَالَ إِذَا رَمَيْتَ سَهْمَكَ فَاذْكُرْ اسْمَ اللَّهِ عَزَّ وَجَلَّ فَإِنْ وَجَدْتَهُ قَدْ قُتِلَ فَكُلْ إِلَّا أَنْ تَجِدَهُ قَدْ وَقَعَ فِي مَاءٍ وَلَا تَدْرِي الْمَاءُ قَتَلَهُ أَوْ سَهْمُكَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Mani'], ia berkata; telah menceritakan kepada kami [Abdullah bin Al Mubarak], ia berkata; telah mengabarkan kepadaku ['Ashim Al Ahwali] dari [Asy Sya'bi] dari ['Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam shallallahu 'alaihi wasallam mengenai hewan buruan, kemudian beliau bersabda: \"Apabila engkau melepaskan anak panahmu maka sebutlah nama Allah 'azza wajalla, kemudian apabila engkau mendapatinya telah terbunuh maka makanlah, kecuali engkau dapati dia telah terjatuh dalam air, dan engkau tidak mengetahui apakah air tersebut yang membuatnya mati atau anak panahmu.\""
            },
            {
                "number": 4009,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ قَالَ حَدَّثَنَا مُوسَى بْنُ أَعْيَنَ عَنْ مَعْمَرٍ عَنْ عَاصِمِ بْنِ سُلَيْمَانَ عَنْ عَامِرٍ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍأَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّيْدِ فَقَالَ إِذَا أَرْسَلْتَ سَهْمَكَ وَكَلْبَكَ وَذَكَرْتَ اسْمَ اللَّهِ فَقَتَلَ سَهْمُكَ فَكُلْ قَالَ فَإِنْ بَاتَ عَنِّي لَيْلَةً يَا رَسُولَ اللَّهِ قَالَ إِنْ وَجَدْتَ سَهْمَكَ وَلَمْ تَجِدْ فِيهِ أَثَرَ شَيْءٍ غَيْرَهُ فَكُلْ وَإِنْ وَقَعَ فِي الْمَاءِ فَلَا تَأْكُلْ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Yahya bin Al Harits], ia berkata; telah menceritakan kepada kami [Ahmad bin Abu Syu'aib], ia berkata; telah menceritakan kepada kami [Musa bin A'yan] dari [Ma'mar] dari ['Ashim bin Sulaiman] dari ['Amir Asy Sya'bi] dari ['Adi bin Hatim] bahwa ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan, maka beliau bersabda: \"Apabila engkau melepas anak panah dan anjingmu dan menyebutkan nama Allah kemudian anak panahmu membunuh maka makanlah.\" Adi berkata: walaupun telah bermalam satu malam wahai Rasulullah? Beliau bersabda: \"Apabila engkau mendapatkan anak panahmu dan tidak mendapatkan padanya bekas sesuatu selainnya maka makanlah, dan apabila terjatuh ke dalam air maka janganlah engkau makan.\""
            },
            {
                "number": 4010,
                "arab": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا هُشَيْمٌ قَالَ أَنْبَأَنَا أَبُو بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا أَهْلُ الصَّيْدِ وَإِنَّ أَحَدَنَا يَرْمِي الصَّيْدَ فَيَغِيبُ عَنْهُ اللَّيْلَةَ وَاللَّيْلَتَيْنِ فَيَبْتَغِي الْأَثَرَ فَيَجِدُهُ مَيِّتًا وَسَهْمُهُ فِيهِ قَالَ إِذَا وَجَدْتَ السَّهْمَ فِيهِ وَلَمْ تَجِدْ فِيهِ أَثَرَ سَبُعٍ وَعَلِمْتَ أَنَّ سَهْمَكَ قَتَلَهُ فَكُلْ",
                "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub], ia berkata; telah menceritakan kepada kami [Husyaim], ia berkata; telah memberitakan kepada kami [Abu Bisyr] dari [Sa'id bin Jubair] dari ['Adi bin Hatim], ia berkata; saya katakan; wahai Rasulullah, sesungguhnya kami adalah orang-orang yang biasa berburu, dan salah seorang diantara kami memanah hewan buruan kemudian menghilang darinya satu malam dan dua malam. Kemudian ia mencarinya, dan mendapatinya telah mati dan anak panahnya berada padanya. Beliau bersabda: \"Apabila ia mendapati anak panahnya padanya dan tidak mendapati padanya bekas binatang buas dan ia mengetahui bahwa anak panahnya telah membunuhnya maka makanlah.\""
            },
            {
                "number": 4011,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى وَإِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَا حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ عَدِيِّ بْنِ حَاتِمٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا رَأَيْتَ سَهْمَكَ فِيهِ وَلَمْ تَرَ فِيهِ أَثَرًا غَيْرَهُ وَعَلِمْتَ أَنَّهُ قَتَلَهُ فَكُلْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la] dan [Isma'il bin Mas'ud] mereka berkata; telah menceritakan kepada kami [Khalid] dari [Syu'bah] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari ['Adi bin Hatim] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila engkau melihat anak panahmu ada padanya dan engkau tidakmelihat padanya bekas selainnya dan engkau tahu bahwa anak panah tersebut telah membunuhnya maka makanlah.\""
            },
            {
                "number": 4012,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَرْمِي الصَّيْدَ فَأَطْلُبُ أَثَرَهُ بَعْدَ لَيْلَةٍ قَالَ إِذَا وَجَدْتَ فِيهِ سَهْمَكَ وَلَمْ يَأْكُلْ مِنْهُ سَبُعٌ فَكُلْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la], ia berkata; telah menceritakan kepada kami telah menceritakan kepada kami [Khalid], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Abdul Malik bin Maisarah] dari [Sa'id bin Jubair] dari ['Adi bin Hatim], ia berkata; saya katakan; wahai Rasulullah, saya memanah hewan buruanku kemudian saya mencari jejaknya setelah satu malam, Beliau bersabda: \" Apabila engkau dapatkan padanya anak panahmu, dan tidak ada hewan buas yang memakannya maka makanlah.\" "
            },
            {
                "number": 4013,
                "arab": "أَخْبَرَنِي أَحْمَدُ بْنُ خَالِدٍ الْخَلَّالُ قَالَ حَدَّثَنَا مَعْنٌ قَالَ أَنْبَأَنَا مُعَاوِيَةُ وَهُوَ ابْنُ صَالِحٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ عَنْ أَبِي ثَعْلَبَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الَّذِي يُدْرِكُ صَيْدَهُ بَعْدَ ثَلَاثٍ فَلْيَأْكُلْهُ إِلَّا أَنْ يُنْتِنَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Khalid Al Khalal], ia berkata; telah menceritakan kepada kami [Ma'n], ia berkata; telah memberitakan kepada kami [Mu'awiyah yaitu Ibnu Shalih] dari [Abdurrahman bin Jubair bin Nufair] dari [ayahnya] dari [Abu Tsa'labah] dari Nabi shallallahu 'alaihi wasallam mengenai orang yang menjumpai hewan buruan buruannya setelah tiga hari, beliau bersabda: \"Hendaknya ia memakannya kecuali apabila telah membusuk.\""
            },
            {
                "number": 4014,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ عَنْ سِمَاكٍ قَالَ سَمِعْتُ مُرِّيَّ بْنَ قَطَرِيٍّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أُرْسِلُ كَلْبِي فَيَأْخُذُ الصَّيْدَ وَلَا أَجِدُ مَا أُذَكِّيهِ بِهِ فَأُذَكِّيهِ بِالْمَرْوَةِ وَالْعَصَا قَالَ أَهْرِقْ الدَّمَ بِمَا شِئْتَ وَاذْكُرْ اسْمَ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la], ia berkata; telah menceritakan kepada kami [Khalid] dari [Syu'bah] dari [Simak], ia berkata; saya mendengar [Murri bin Qathari] dari ['Adi bin Hatim], ia berkata; saya berkata; wahai Rasulullah, saya mengirim anjingku kemudian ia menangkap hewan buruan, dan saya tidak mendapatkan Sesuatu untuk menyembelihnya, kemudian saya menyembelihnya dengan batu putih yang dibuat seperti pisau dan sebuah tongkat. Beliau bersabda: \"Alirkanlah darah dengan apa yang engkau kehendaki, dan sebutlah nama Allah 'azza wajalla.\""
            },
            {
                "number": 4015,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ عَنْ جَرِيرٍ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ هَمَّامٍ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُرْسِلُ الْكِلَابَ الْمُعَلَّمَةَ فَتُمْسِكُ عَلَيَّ فَآكُلُ مِنْهُ قَالَ إِذَا أَرْسَلْتَ الْكِلَابَ يَعْنِي الْمُعَلَّمَةَ وَذَكَرْتَ اسْمَ اللَّهِ فَأَمْسَكْنَ عَلَيْكَ فَكُلْ قُلْتُ وَإِنْ قَتَلْنَ قَالَ وَإِنْ قَتَلْنَ مَا لَمْ يَشْرَكْهَا كَلْبٌ لَيْسَ مِنْهَا قُلْتُ وَإِنِّي أَرْمِي الصَّيْدَ بِالْمِعْرَاضِ فَأُصِيبُ فَآكُلُ قَالَ إِذَا رَمَيْتَ بِالْمِعْرَاضِ وَسَمَّيْتَ فَخَزَقَ فَكُلْ وَإِذَا أَصَابَ بِعَرْضِهِ فَلَا تَأْكُلْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Qudamah] dari [Jarir] dari [Manshur] dari [Ibrahim] dari [Hammam] dari ['Adi bin Hatim], ia berkata; saya mengatakan; wahai Rasulullah, sesungguhnya saya mengirimkan beberapa ekor anjing yang terlatih, kemudian mereka menangkap buruan untukku, lalu saya memakan sebagian darinya. Beliau bersabda: \"Apabila engkau mengirim anjing-anjingmu yang terlatih dan engkau menyebutkan nama Allah kemudian mereka menangkap buruan untukmu maka makanlah.\" Saya katakan; walaupun mereka membunuhnya? Beliau bersabda: \"Walaupun mereka membunuhnya selama tidak ada anjing selainnya yang ikut serta. Saya katakan; dan saya memanah hewan buruanku dengan anak panah tanpa mata panah, kemudian saya mengenai buruan, dan memakannya. Beliau bersabda: \"Apabila engkau memanah dengan anak panah yang tak bermata panah dan engkau telah menyebutkan nama Allah dan anak panah tersebut menusuk maka makanlah, dan apabila mengenai dengan bagian tumpunya maka jangan engkau makan.\""
            },
            {
                "number": 4016,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ عَنْ الشَّعْبِيِّ قَالَ سَمِعْتُ عَدِيَّ بْنَ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمِعْرَاضِ فَقَالَ إِذَا أَصَابَ بِحَدِّهِ فَكُلْ وَإِذَا أَصَابَ بِعَرْضِهِ فَقُتِلَ فَإِنَّهُ وَقِيذٌ فَلَا تَأْكُلْ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Ali], ia berkata; telah menceritakan kepada kami [Muhammad bin Ja'far], ia berkata; telah menceritakan kepada kami [Syu'bah], ia berkata; telah menceritakan kepada kami [Abdullah bin Abu As Safar] dari [Asy Sya'bi], ia berkata; saya mendengar ['Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai anak panah tanpa mata. Kemudian beliau bersabda: \"Apabila ia mengenai dengan bagian tajamnya maka makanlah dan apabila mengenai dengan bagian tumpulnya kemudian terbunuh maka sesungguhnya buruan tersebut merupakan hewan yang mati karena benda tumpul, maka jangan engkau makan.\""
            },
            {
                "number": 4017,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مُحَمَّدٍ الذَّرَّاعُ قَالَ حَدَّثَنَا أَبُو مُحْصَنٍ قَالَ حَدَّثَنَا حُصَيْنٌ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ إِذَا أَصَابَ بِحَدِّهِ فَكُلْ وَإِذَا أَصَابَ بِعَرْضِهِ فَلَا تَأْكُلْ",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Muhammad Adz Dzarra'], ia berkata; telah menceritakan kepada kami [Abu Muhshan], ia berkata; telah menceritakan kepada kami [Hushain] dari [Asy Sya'bi] dari ['Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan dengan anak panah tanpa mata panah, kemudian beliau bersabda: \"Apabila mengenai dengan bagian yang tajam maka makanlah, dan apabila mengenai dengan bagian yang tumpul maka jangan engkau makan.\""
            },
            {
                "number": 4018,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ وَغَيْرُهُ عَنْ زَكَرِيَّا عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ مَا أَصَبْتَ بِحَدِّهِ فَكُلْ وَمَا أَصَابَ بِعَرْضِهِ فَهُوَ وَقِيذٌ",
                "id": "Telah mengabarkan kepada kami [Ali bin Hujr], ia berkata; telah memberitakan kepada kami [Isa bin Yunus] dan yang lainnya dari [Zakariya] dari [Asy Sya'bi] dari ['Adi bin Hatim], ia berkata; saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan buruan dengan anak panah tanpa mata panah, maka beliau bersabda: \"Apa yang engkau kenai dengan bagian tajamnya maka makanlah dan apa yang engkau kenai dengan bagian tumpulnya maka itu adalah hewan yang mati karena benda tumpul.\""
            },
            {
                "number": 4019,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ أَبِي مُوسَى ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي مُوسَى عَنْ وَهْبِ بْنِ مُنَبِّهٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ سَكَنَ الْبَادِيَةَ جَفَا وَمَنْ اتَّبَعَ الصَّيْدَ غَفَلَ وَمَنْ اتَّبَعَ السُّلْطَانَ افْتُتِنَوَاللَّفْظُ لِابْنِ الْمُثَنَّى",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim], ia berkata; telah memberitakan kepada kami [Abdurrahman] dari [Sufyan] dari [Abu Musa], telah menceritakan dan memberitakan kepada kami [Muhammad bin Al Mutsanna] dari [Abdurrahman], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Abu Musa] dari [Wahb bin Munabbih] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa yang tinggal di pelosok maka ia hidup keras, barangsiapa yang mengikuti hewan buruan ia akan lalai, barangsiapa yang mengikuti kemauan penguasa maka ia akan terfitnah, \" lafazh ini milik Ibn Al Mutsanna."
            },
            {
                "number": 4020,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ الْبَحْرَانِيُّ قَالَ حَدَّثَنَا حَبَّانُ وَهُوَ ابْنُ هِلَالٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ أَبِي هُرَيْرَةَ قَالَجَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَرْنَبٍ قَدْ شَوَاهَا فَوَضَعَهَا بَيْنَ يَدَيْهِ فَأَمْسَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَأْكُلْ وَأَمَرَ الْقَوْمَ أَنْ يَأْكُلُوا وَأَمْسَكَ الْأَعْرَابِيُّ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يَمْنَعُكَ أَنْ تَأْكُلَ قَالَ إِنِّي أَصُومُ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ قَالَ إِنْ كُنْتَ صَائِمًا فَصُمْ الْغُرَّ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ma'mar Al Bahrani], ia berkata; telah menceritakan kepada kami [Habban yaitu Ibnu Hilal], ia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Abdul Malik bin 'Umair] dari [Musa bin Thalhah] dari [Abu Hurairah], ia berkata; telah datang seorang badui kepada Nabi shallallahu 'alaihi wasallam membawa kelinci yang telah ia baker, kemudian ia meletakkannya dihadapan beliau. Kemudian Rasulullah shallallahu 'alaihi wasallam menahan diri tidak memakannya, dan beliau memerintahkan orang-orang agar memakannya, dan orang badui tersebut menahan untuk makan. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Apa yang menghalangimu untuk makan?\" Ia berkata; sesungguhnya Saya sedang berpuasa tiga hari dari setiap bulan. Beliau bersabda: \"Apabila engkau berpuasa maka berpuasalah tanggal tiga belas, empat belas dan lima belas.\" "
            },
            {
                "number": 4021,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ حَكِيمِ بْنِ جُبَيْرٍ وَعَمْرِو بْنِ عُثْمَانَ وَمُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ ابْنِ الْحَوْتَكِيَّةِ قَالَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ مَنْ حَاضِرُنَا يَوْمَ الْقَاحَةِ قَالَ قَالَ أَبُو ذَرٍّ أَنَا أُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَرْنَبٍ فَقَالَ الرَّجُلُ الَّذِي جَاءَ بِهَا إِنِّي رَأَيْتُهَا تَدْمَى فَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَأْكُلْ ثُمَّ إِنَّهُ قَالَ كُلُوا فَقَالَ رَجُلٌ إِنِّي صَائِمٌ قَالَ وَمَا صَوْمُكَ قَالَ مِنْ كُلِّ شَهْرٍ ثَلَاثَةُ أَيَّامٍ قَالَ فَأَيْنَ أَنْتَ عَنْ الْبِيضِ الْغُرِّ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur], ia berkata; telah menceritakan kepada kami [Sufyan] dari [Hakim bin Jubair] dan ['Amr bin Utsman] dan [Muhammad bin Abdurrahman] dari [Musa bin Thalhah] dari [Ibnu Al Hautakiyah], ia berkata; Umar radliallahu 'anhu berkata; siapakah yang hadir bersama kami pada saat kejadian di Al Qahah? Ibnu Al Hautakiyah berkata; [Abu Dzar] berkata; Rasulullah shallallahu 'alaihi wasallam diberi seekor kelinci, kemudian seorang laki-laki yang membawanya berkata; sesungguhnya saya melihatnya bercucuran darah. Nabi shallallahu 'alaihi wasallam tidak memakannya kemudian beliau bersabda: \"Makanlah kalian.\" Kemudian seseorang berkata; saya berpuasa. Beliau bersabda: \"Apakah puasamu?\" Ia berkata; puasa tiga hari setiap bulan. Beliau bersabda: \"Dimana engkau dari hari bidh? Yaitu tiga belas, empat belas dan lima belas?\""
            },
            {
                "number": 4022,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ عَنْ هِشَامٍ وَهُوَ ابْنُ زَيْدٍ قَالَ سَمِعْتُ أَنَسًا يَقُولُأَنْفَجْنَا أَرْنَبًا بِمَرِّ الظَّهْرَانِ فَأَخَذْتُهَا فَجِئْتُ بِهَا إِلَى أَبِي طَلْحَةَ فَذَبَحَهَا فَبَعَثَنِي بِفَخِذَيْهَا وَوَرِكَيْهَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَبِلَهُ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud], ia berkata; telah menceritakan kepada kami [Khalid] dari [Syu'bah] dari [Hisyam yaitu Ibnu Zaid], ia berkata; saya mendengar [Anas] berkata; kami mengeluarkan kelinci dari tempatnya di Marrizh Zhahran, kemudian Saya mengambilnya, lalu saya bewa kepada Abu Thalhah dan ia menyembelihnya. Kemudian ia mengutusku membawa dua paha kelinci tersebut serta dua pangkal pahanya kepada Rasulullah shallallahu 'alaihi wasallam, dan beliau menerimanya."
            },
            {
                "number": 4023,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَفْصٌ عَنْ عَاصِمٍ وَدَاوُدَ عَنْ الشَّعْبِيِّ عَنْ ابْنِ صَفْوَانَ قَالَأَصَبْتُ أَرْنَبَيْنِ فَلَمْ أَجِدْ مَا أُذَكِّيهِمَا بِهِ فَذَكَّيْتُهُمَا بِمَرْوَةٍ فَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَأَمَرَنِي بِأَكْلِهِمَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah], ia berkata; telah menceritakan kepada kami [Hafsh] dari ['Ashim] dan [Daud] dari [Asy Sya'bi] dari [Ibnu Shafwan], ia berkata; saya mendapatkan dua kelinci dan tidak mendapatkan sesuatu untuk menyembelihnya, kemudian saya menyembelih menggunakan batu putih yang dibentuk seperti pisau. Lalu saya bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai hal tersebut dan beliau memerintahkanku untuk memakannya."
            }
        ]
    }
}