{
    "status": true,
    "data": {
        "start": 1491,
        "end": 1639,
        "total": 149,
        "book": "nasai",
        "hadits": [
            {
                "number": 1491,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ سَوَّادِ بْنِ الْأَسْوَدِ بْنِ عَمْرٍو قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُ عَزَّ وَجَلَّ مَا أَنْعَمْتُ عَلَى عِبَادِي مِنْ نِعْمَةٍ إِلَّا أَصْبَحَ فَرِيقٌ مِنْهُمْ بِهَا كَافِرِينَ يَقُولُونَ الْكَوْكَبُ وَبِالْكَوْكَبِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin Sawwad bin Al Aswad bin 'Amr] dia berkata; telah memberitakan kepada kami [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dia berkata; telah mengabarkan kepadaku ['ubaidhullah bin 'Abdullah bin 'Utbah] dari [Abu Hurairah] dia berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Allah Azza wa Jalla berfirman: 'Tidaklah Aku menganugerahkan suatu nikmat kepada hamba-hambaku melainkan sebagian mereka ada yang kufur, mereka berkata; \"Ini terjadi dengan sebab bintang-bintang!\""
            },
            {
                "number": 1492,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ قَالَمُطِرَ النَّاسُ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلَمْ تَسْمَعُوا مَاذَا قَالَ رَبُّكُمْ اللَّيْلَةَ قَالَ مَا أَنْعَمْتُ عَلَى عِبَادِي مِنْ نِعْمَةٍ إِلَّا أَصْبَحَ طَائِفَةٌ مِنْهُمْ بِهَا كَافِرِينَ يَقُولُونَ مُطِرْنَا بِنَوْءِ كَذَا وَكَذَا فَأَمَّا مَنْ آمَنَ بِي وَحَمِدَنِي عَلَى سُقْيَايَ فَذَاكَ الَّذِي آمَنَ بِي وَكَفَرَ بِالْكَوْكَبِ وَمَنْ قَالَ مُطِرْنَا بِنَوْءِ كَذَا وَكَذَا فَذَاكَ الَّذِي كَفَرَ بِي وَآمَنَ بِالْكَوْكَبِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Shalih bin Kaisan] dari ['ubaidhullah bin 'Abdullah] dari [Zaid bin Khalid Al Juhani] dia berkata; \"Pada masa Rasulullah Shalallahu 'Alaihi Wa Sallam, hujan turun, maka beliau bersabda: 'Apakah tadi malam kalian tidak mendengar perkataan Rabb kalian? Dia berfirman, \"Tidaklah Aku menganugerahkan suatu nikmat kepada hamba-hamba-Ku melainkan sebagian mereka ada yang kufur dengan nikmat tersebut, mereka berkata; `Kami diberi hujan dengan sebab bintang ini dan itu. Sedangkan orang yang beriman kepada-Ku, ia memuji-Ku karena air yang Aku turunkan, maka itulah orang yang beriman kepada-Ku dan kufur terhadap bintang-bintang. Sedangkan orang yang berkata; 'Kami diberi hujan dengan sebab bintang ini dan itu' adalah orang yang kufur kepada-Ku dan beriman kepada bintang-bintang'.\""
            },
            {
                "number": 1493,
                "arab": "أَخْبَرَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ عَنْ سُفْيَانَ عَنْ عَمْرٍو عَنْ عَتَّابِ بْنِ حُنَيْنٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَمْسَكَ اللَّهُ عَزَّ وَجَلَّ الْمَطَرَ عَنْ عِبَادِهِ خَمْسَ سِنِينَ ثُمَّ أَرْسَلَهُ لَأَصْبَحَتْ طَائِفَةٌ مِنْ النَّاسِ كَافِرِينَ يَقُولُونَ سُقِينَا بِنَوْءِ الْمِجْدَحِ",
                "id": "Telah mengabarkan kepada kami ['Abdul Jabbar bin Al 'Ala] dari [Sufyan] dari ['Amr] dari ['Attab bin Hunain] dari [Abu Sa'id Al Khudri] dia berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam: \"Seandainya Allah menahan hujan kepada para hambanya selama lima tahun, kemudian mengirimkannya, maka pasti sebagian manusia akan kafir sambil mengatakan; 'kami diberi hujan karena bintang Mijdah.' Ket. Bintang Mijdah: Nama sebuah bintang yang dikenal oleh kalangan orang-orang sebagai lambang turunnya hujan."
            },
            {
                "number": 1494,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا حُمَيْدٌ عَنْ أَنَسٍ قَالَقَحَطَ الْمَطَرُ عَامًا فَقَامَ بَعْضُ الْمُسْلِمِينَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي يَوْمِ جُمُعَةٍ فَقَالَ يَا رَسُولَ اللَّهِ قَحَطَ الْمَطَرُ وَأَجْدَبَتْ الْأَرْضُ وَهَلَكَ الْمَالُ قَالَ فَرَفَعَ يَدَيْهِ وَمَا نَرَى فِي السَّمَاءِ سَحَابَةً فَمَدَّ يَدَيْهِ حَتَّى رَأَيْتُ بَيَاضَ إِبْطَيْهِ يَسْتَسْقِي اللَّهَ عَزَّ وَجَلَّ قَالَ فَمَا صَلَّيْنَا الْجُمُعَةَ حَتَّى أَهَمَّ الشَّابَّ الْقَرِيبَ الدَّارِ الرُّجُوعُ إِلَى أَهْلِهِ فَدَامَتْ جُمُعَةٌ فَلَمَّا كَانَتْ الْجُمُعَةُ الَّتِي تَلِيهَا قَالُوا يَا رَسُولَ اللَّهِ تَهَدَّمَتْ الْبُيُوتُ وَاحْتَبَسَ الرُّكْبَانُ قَالَ فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِسُرْعَةِ مَلَالَةِ ابْنِ آدَمَ وَقَالَ بِيَدَيْهِ اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا فَتَكَشَّطَتْ عَنْ الْمَدِينَةِ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah menceritakan kepada kami [Isma'il] dia berkata; telah menceritakan kepada kami [Humaid] dari [Anas] dia berkata; '\"Hujan pernah tidak turun selama satu tahun, maka sebagian kaum muslim datang kepada Rasulullah shallallahu 'alaihi wasallam pada hari Jum'at. Mereka berkata; 'Wahai Rasulullah, hujan telah terhenti, bumi telah menjadi tandus, dan harta benda telah hancur'. Lalu Rasulullah Shalallahu 'Alaihi Wa Sallam mengangkat kedua tangannya. Kami tidak melihat awan di langit. Lalu beliau menjulurkan tangannya (hingga kami melihat putihnya ketiak beliau Shalallahu 'Alaihi Wa Sallam) untuk meminta hujan kepada Allah Azza wa Jalla.\" Anas berkata; \"Kami belum (selesai) sholat Jum'at, namun seseorang yang tinggal dekat dengan masjid sudah merasa sulit untuk pulang ke keluarganya (karena derasnya hujan penerj). Hal tersebut berlangsung sampai hari Jum'at berikutnya. Pada hari Jum'at berikutnya orang-orang berkata kepada Rasulullah shallallahu 'alaihi wasallam, 'Wahai Rasulullah, rumah-rumah telah hancur dan kendaraan tak bisa berjalan Anas berkata; \"Rasulullah shallallahu 'alaihi wasallam tersenyum karena cepatnya rasa bosan anak Adam, lalu beliau bersabda: `Ya Allah (turunkanlah hujan) disekitar kami dan jangan di atas kami'. Lalu awan atau hujan itu menjauh dari Madinah.\""
            },
            {
                "number": 1495,
                "arab": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ أَنْبَأَنَا أَبُو عَمْرٍو الْأَوْزَاعِيُّ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَأَصَابَ النَّاسُ سَنَةٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ فَقَامَ أَعْرَابِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ هَلَكَ الْمَالُ وَجَاعَ الْعِيَالُ فَادْعُ اللَّهَ لَنَا فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ وَمَا نَرَى فِي السَّمَاءِ قَزَعَةً وَالَّذِي نَفْسِي بِيَدِهِ مَا وَضَعَهَا حَتَّى ثَارَ سَحَابٌ أَمْثَالُ الْجِبَالِ ثُمَّ لَمْ يَنْزِلْ عَنْ مِنْبَرِهِ حَتَّى رَأَيْتُ الْمَطَرَ يَتَحَادَرُ عَلَى لِحْيَتِهِ فَمُطِرْنَا يَوْمَنَا ذَلِكَ وَمِنْ الْغَدِ وَالَّذِي يَلِيهِ حَتَّى الْجُمُعَةِ الْأُخْرَى فَقَامَ ذَلِكَ الْأَعْرَابِيُّ أَوْ قَالَ غَيْرُهُ فَقَالَ يَا رَسُولَ اللَّهِ تَهَدَّمَ الْبِنَاءُ وَغَرِقَ الْمَالُ فَادْعُ اللَّهَ لَنَا فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ فَقَالَ اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا فَمَا يُشِيرُ بِيَدِهِ إِلَى نَاحِيَةٍ مِنْ السَّحَابِ إِلَّا انْفَرَجَتْ حَتَّى صَارَتْ الْمَدِينَةُ مِثْلَ الْجَوْبَةِ وَسَالَ الْوَادِي وَلَمْ يَجِئْ أَحَدٌ مِنْ نَاحِيَةٍ إِلَّا أَخْبَرَ بِالْجَوْدِ",
                "id": "Telah mengabarkan kepada kami [Mahmud bin Khalid] dia berkata; telah menceritakan kepada kami [Al Walid bin Muslim] dia berkata; telah memberitakan kepada kami [Abu 'Amr Al Auza'i] dari [Ishaq bin 'Abdullah] dari [Anas bin Malik] dia berkata; \"Pada masa Rasulullah shallallahu 'alaihi wasallam terjadi paceklik selama satu tahun. Ketika Rasulullah sedang khutbah pada hari Jum'at, tiba-tiba seorang Badui berdiri lalu berkata; 'Wahai Rasulullah shallallahu 'alaihi wasallam, harta benda hancur dan keluarga kelaparan, maka berdoalah kepada Allah untuk kami'. Lalu Rasulullah shallallahu 'alaihi wasallam mengangkat kedua tangannya, dan saat itu kami tidak melihat gumpalan awan di langit. Demi Dzat yang jiwaku ada di tangan-Nya, Rasulullah Shalallahu 'Alaihi Wa Sallam belum meletakkan tangannya kembali, namun awan telah menggumpal laksana gunung. Ketika beliau masih di mimbarnya, kami melihat hujan telah turun hingga menetes ke jenggotnya. Kami diguyur hujan pada hari itu dan besoknya, hingga sampai hari Jum'at berikutnya. Lalu orang Badui itu berdiri atau orang lain kemudian berkata; Wahai Rasulullah Shalallahu 'Alaihi Wa Sallam, bangunan telah hancur dan harta benda telah tenggelam, maka berdoalah kepada Allah untuk kami. Lalu Rasulullah shallallahu 'alaihi wasallam mengangkat kedua tangannya sambil mengucapkan, Ya Allah (turunkanlah hujan) di sekitar kami dan jangan di atas kami'. Tidaklah Rasulullah shallallahu 'alaihi wasallam mengisyaratkan dengan tangannya ke sudut awan itu, melainkan awan itu berpencar sehingga Madinah menjadi cerah laksana kota yang dikelilingi suatu lingkaran. Lembah-lembah telah mengalir airnya dan tak ada orang yang datang ke Madinah dari arah mana saja melainkan ia akan menceritakan tentang hujan yang telah turun dengan sangat lebat.\""
            },
            {
                "number": 1496,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَشْعَثِ بْنِ أَبِي الشَّعْثَاءِ عَنْ الْأَسْوَدِ بْنِ هِلَالٍ عَنْ ثَعْلَبَةَ بْنِ زَهْدَمٍ قَالَكُنَّا مَعَ سَعِيدِ بْنِ الْعَاصِي بِطَبَرِسْتَانَ وَمَعَنَا حُذَيْفَةُ بْنُ الْيَمَانِ فَقَالَ أَيُّكُمْ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ فَقَالَ حُذَيْفَةُ أَنَا فَوَصَفَ فَقَالَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ بِطَائِفَةٍ رَكْعَةً صَفٍّ خَلْفَهُ وَطَائِفَةٍ أُخْرَى بَيْنَهُ وَبَيْنَ الْعَدُوِّ فَصَلَّى بِالطَّائِفَةِ الَّتِي تَلِيهِ رَكْعَةً ثُمَّ نَكَصَ هَؤُلَاءِ إِلَى مَصَافِّ أُولَئِكَ وَجَاءَ أُولَئِكَ فَصَلَّى بِهِمْ رَكْعَةً",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah menceritakan kepada kami [Waqi'] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Al Asy'ats bin Abu Asy Sya'tsa] dari [Al Aswad bin Hilal] dari [Tsa'labah bin Zahdam] dia berkata; kami bersama Sa'id bin Al 'Ashi di Thabristan dan bersama kami [Hudzaifah bin Al Yaman], Sa'id bertanya; 'Siapakah diantara kalian yang pernah sholat khauf bersama Rasulullah Shalallahu 'Alaihi Wa Sallam? ' Hudzaifah menjawab; 'Aku', Lalu dia menggambarkan sholat Khaufnya Rasulullah Shalallahu 'Alaihi Wa Sallam dengan berkata; 'Rasulullah Shalallahu 'Alaihi Wa Sallam mengerjakan sholat Khauf bersama suatu kelompok satu rakaat dengan satu shaf jamaah di belakangnya, dan kelompok yang lain berhadapan dengan musuh. Lalu beliau sholat dengan kelompok lainnya (yang tadi berhadapan dengan musuh) satu rakaat juga. Kemudian mereka (yang sholat bersama beliau) mundur dan menuju kelompok yang tadinya berhadapan dengan musuh, lalu kelompok tadi datang kemudian sholat bersama Rasulullah Shalallahu 'Alaihi Wa Sallam satu rakaat.\""
            },
            {
                "number": 1497,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي أَشْعَثُ بْنُ سُلَيْمٍ عَنْ الْأَسْوَدِ بْنِ هِلَالٍ عَنْ ثَعْلَبَةَ بْنِ زَهْدَمٍ قَالَكُنَّا مَعَ سَعِيدِ بْنِ الْعَاصِي بِطَبَرِسْتَانَ فَقَالَ أَيُّكُمْ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ فَقَالَ حُذَيْفَةُ أَنَا فَقَامَ حُذَيْفَةُ فَصَفَّ النَّاسُ خَلْفَهُ صَفَّيْنِ صَفًّا خَلْفَهُ وَصَفًّا مُوَازِيَ الْعَدُوِّ فَصَلَّى بِالَّذِي خَلْفَهُ رَكْعَةً ثُمَّ انْصَرَفَ هَؤُلَاءِ إِلَى مَكَانِ هَؤُلَاءِ وَجَاءَ أُولَئِكَ فَصَلَّى بِهِمْ رَكْعَةً وَلَمْ يَقْضُواأَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنِي الرُّكَيْنُ بْنُ الرَّبِيعِ عَنْ الْقَاسِمِ بْنِ حَسَّانَ عَنْ زَيْدِ بْنِ ثَابِتٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ صَلَاةِ حُذَيْفَةَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Sufyan] dia berkata; telah menceritakan kepadaku [Asy'ats bin Sulaim] dari [Al Aswad bin Hilal] dari [Tsa'labah bin Zahdam] dia berkata; \"Kami pernah bersama Said bin Al Ash di Thibristan. Aku berkata, `Siapakah di antara kalian yang pernah sholat Khauf bersama Rasulullah Shalallahu 'Alaihi Wa Sallam? ' [Hudzaifah bin Al Yaman] berkata; 'Aku'. lalu ia berdiri dan menyuruh jamaah untuk berbaris menjadi dua baris di belakangnya. Satu baris di belakangnya dan yang satu lagi berhadapan dengan musuh. Dia mengerjakan sholat satu rakaat dengan barisan yang berada di belakangnya, kemudian mereka (yang di belakangnya) pergi menuju barisan yang berhadapan dengan musuh, dan mereka datang kepadanya lalu sholat satu rakaat, dan mereka tidak mengqadhanya'.\" Telah mengabarkan kepada kami ['Amru bin Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; Telah menceritakan kepada kami [Sufyan] dia berkata; Telah menceritakan kepadaku [Ar Rukain bin Rabi'] dari [Al Qasim bin Hasan] dari [Zaid bin Tsabit] dari Nabi Shalallahu 'Alaihi Wa Sallam, sebagaimana sholatnya Hudzaifah.'"
            },
            {
                "number": 1498,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَفَرَضَ اللَّهُ الصَّلَاةَ عَلَى لِسَانِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَضَرِ أَرْبَعًا وَفِي السَّفَرِ رَكْعَتَيْنِ وَفِي الْخَوْفِ رَكْعَةً",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Bukair bin Al Akhnas] dari [Mujahid] dari [Ibnu 'Abbas] dia berkata; \"Allah telah mewajibkan sholat lewat lisan Nabi kalian Shalallahu 'Alaihi Wa Sallam, dalam keadaan bermukim empat rakaat, dalam perjalanan dua rakaat, dan dalam keadaan khauf\/takut (perang) satu rakaat.\""
            },
            {
                "number": 1499,
                "arab": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرٍ عَنْ مُحَمَّدٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ قَالَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَامَ النَّاسُ مَعَهُ فَكَبَّرَ وَكَبَّرُوا ثُمَّ رَكَعَ وَرَكَعَ أُنَاسٌ مِنْهُمْ ثُمَّ سَجَدَ وَسَجَدُوا ثُمَّ قَامَ إِلَى الرَّكْعَةِ الثَّانِيَةِ فَتَأَخَّرَ الَّذِينَ سَجَدُوا مَعَهُ وَحَرَسُوا إِخْوَانَهُمْ وَأَتَتْ الطَّائِفَةُ الْأُخْرَى فَرَكَعُوا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَجَدُوا وَالنَّاسُ كُلُّهُمْ فِي صَلَاةٍ يُكَبِّرُونَ وَلَكِنْ يَحْرُسُ بَعْضُهُمْ بَعْضًا",
                "id": "Telah mengabarkan kepadaku ['Amr bin 'Utsman bin Sa'id bin Katsir] dari [Muhammad] dari [Az Zubaidi] dari [Az Zuhri] dari ['ubaidhullah bin 'Abdullah bin 'Utbah] bahwasanya ['Abdullah bin 'Abbas] berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam berdiri dan orang-orang ikut berdiri bersamanya. Beliau lalu bertakbir dan mereka pun ikut bertakbir bersamanya. Lalu beliau ruku', dan sebagian ikut ruku'. Kemudian beliau sujud, dan (sebagian) juga ikut sujud. Kemudian beliau berdiri ke rakaat yang kedua, dan orang-orang yang ikut sujud tadi mundur lalu menjaga saudara-saudara mereka yang sedang sholat. Setelah itu datang barisan yang lain, mereka segera ruku' dan sujud bersama Nabi Shalallahu 'Alaihi Wa Sallam. Semuanya mengerjakan sholat bersama-sama; mereka bertakbir, namun sebagian mereka menjaga sebagian yang lain."
            },
            {
                "number": 1500,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَمِّي قَالَ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ قَالَ حَدَّثَنِي دَاوُدُ بْنُ الْحُصَيْنِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَمَا كَانَتْ صَلَاةُ الْخَوْفِ إِلَّا سَجْدَتَيْنِ كَصَلَاةِ أَحْرَاسِكُمْ هَؤُلَاءِ الْيَوْمَ خَلْفَ أَئِمَّتِكُمْ هَؤُلَاءِ إِلَّا أَنَّهَا كَانَتْ عُقَبًا قَامَتْ طَائِفَةٌ مِنْهُمْ وَهُمْ جَمِيعًا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَجَدَتْ مَعَهُ طَائِفَةٌ مِنْهُمْ ثُمَّ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَامُوا مَعَهُ جَمِيعًا ثُمَّ رَكَعَ وَرَكَعُوا مَعَهُ جَمِيعًا ثُمَّ سَجَدَ فَسَجَدَ مَعَهُ الَّذِينَ كَانُوا قِيَامًا أَوَّلَ مَرَّةٍ فَلَمَّا جَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِينَ سَجَدُوا مَعَهُ فِي آخِرِ صَلَاتِهِمْ سَجَدَ الَّذِينَ كَانُوا قِيَامًا لِأَنْفُسِهِمْ ثُمَّ جَلَسُوا فَجَمَعَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالتَّسْلِيمِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'd bin Ibrahim] dia berkata; [pamanku] telah menceritakan kepada kami, dia berkata; [bapakku] telah menceritakan kepada kami, dari [Ibnu Ishaq] dia berkata; telah menceritakan kepadaku [Dawud bin Al Hushain] dari ['Ikrimah] dari [Ibnu 'Abbas] dia berkata; \"sholat Khauf itu dua kali sujud, seperti sholatnya penjaga-penjaga kalian pada hari ini, di belakang pemimpin-pemimpin mereka, tetapi mereka melakukannya secara bergantian; semuanya berdiri bersama Rasulullah shallallahu 'alaihi wasallam, sebagian dari mereka ikut sujud bersamanya (dan sebagian yang lain tetap berdiri), kemudian Rasulullah shallallahu 'alaihi wasallam berdiri dan mereka semuanya ikut berdiri bersamanya. Tatkala beliau ruku', mereka semuanya ikut ruku'. Jika beliau sujud, maka sebagian yang berdiri tadi ikut sujud bersama beliau. Setelah Rasulullah Shalallahu 'Alaihi Wa Sallam duduk bersama orang yang sujud bersamanya di akhir sholat, maka orang-orang yang berdiri tadi sujud lalu mereka duduk. Kemudian mereka semua mengucapkan salam bersama Rasulullah Shalallahu 'Alaihi Wa Sallam secara bersama-sama."
            },
            {
                "number": 1501,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ يَزِيدَ بْنِ رُومَانَ عَنْ صَالِحِ بْنِ خَوَّاتٍ عَمَّنْ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ ذَاتِ الرِّقَاعِ صَلَاةَ الْخَوْفِأَنَّ طَائِفَةً صَفَّتْ مَعَهُ وَطَائِفَةٌ وِجَاهَ الْعَدُوِّ فَصَلَّى بِالَّذِينَ مَعَهُ رَكْعَةً ثُمَّ ثَبَتَ قَائِمًا وَأَتَمُّوا لِأَنْفُسِهِمْ ثُمَّ انْصَرَفُوا فَصَفُّوا وِجَاهَ الْعَدُوِّ وَجَاءَتْ الطَّائِفَةُ الْأُخْرَى فَصَلَّى بِهِمْ الرَّكْعَةَ الَّتِي بَقِيَتْ مِنْ صَلَاتِهِ ثُمَّ ثَبَتَ جَالِسًا وَأَتَمُّوا لِأَنْفُسِهِمْ ثُمَّ سَلَّمَ بِهِمْ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Yazid bin Ruman] dari [Shalih bin Khawwat] dari [orang yang pernah melaksanakan sholat Khauf] bersama Rasulullah Shalallahu 'Alaihi Wa Sallam pada perang Dzatur Riqa', bahwa ada sekelompok orang yang berbaris bersamanya, dan kelompok lain berhadapan dengan musuh. Rasulullah sholat satu rakaat bersama orang-orang yang bersamanya, kemudian tetap berdiri, sedangkan mereka menyempurnakan sholatnya sendirian. Lalu mereka pergi dan berbaris berhadapan dengan musuh. Kemudian datang kelompok lainnya, lalu Rasulullah shallallahu 'alaihi wasallam mengerjakan sisa sholatnya bersama mereka (yang tadinya berhadapan dengan musuh), kemudian beliau tetap saja duduk sedangkan mereka menyempurnakan sholatnya sendirian. Setelah itu Rasulullah mengucapkan salam bersama mereka."
            },
            {
                "number": 1502,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ عَنْ يَزِيدَ بْنِ زُرَيْعٍ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِإِحْدَى الطَّائِفَتَيْنِ رَكْعَةً وَالطَّائِفَةُ الْأُخْرَى مُوَاجِهَةُ الْعَدُوِّ ثُمَّ انْطَلَقُوا فَقَامُوا فِي مَقَامِ أُولَئِكَ وَجَاءَ أُولَئِكَ فَصَلَّى بِهِمْ رَكْعَةً أُخْرَى ثُمَّ سَلَّمَ عَلَيْهِمْ فَقَامَ هَؤُلَاءِ فَقَضَوْا رَكْعَتَهُمْ وَقَامَ هَؤُلَاءِ فَقَضَوْا رَكْعَتَهُمْ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dari [Yazid bin Zurai'] dia berkata; telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [bapaknya] bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam sholat satu rakaat dengan salah satu dari dua kelompok, sedangkan kelompok yang lain berhadapan dengan musuh. Kemudian kelompok yang sholat bersama Rasulullah pergi menuju posisi kelompok yang berhadapan dengan musuh, lalu mereka (yang berhadapan dengan musuh) menuju Rasulullah. Beliau sholat untuk rakaat selanjutnya bersama mereka, kemudian salam. Setelah itu mereka berdiri untuk menyempurnakan rakaatnya. Mereka (yang berhadapan dengan musuh) juga menyempurnakan rakaatnya."
            },
            {
                "number": 1503,
                "arab": "أَخْبَرَنِي كَثِيرُ بْنُ عُبَيْدٍ عَنْ بَقِيَّةَ عَنْ شُعَيْبٍ قَالَ حَدَّثَنِي الزُّهْرِيُّ قَالَ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَغَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِبَلَ نَجْدٍ فَوَازَيْنَا الْعَدُوَّ وَصَافَفْنَاهُمْ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِنَا فَقَامَتْ طَائِفَةٌ مِنَّا مَعَهُ وَأَقْبَلَ طَائِفَةٌ عَلَى الْعَدُوِّ فَرَكَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَنْ مَعَهُ رَكْعَةً وَسَجَدَ سَجْدَتَيْنِ ثُمَّ انْصَرَفُوا فَكَانُوا مَكَانَ أُولَئِكَ الَّذِينَ لَمْ يُصَلُّوا وَجَاءَتْ الطَّائِفَةُ الَّتِي لَمْ تُصَلِّ فَرَكَعَ بِهِمْ رَكْعَةً وَسَجْدَتَيْنِ ثُمَّ سَلَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ كُلُّ رَجُلٍ مِنْ الْمُسْلِمِينَ فَرَكَعَ لِنَفْسِهِ رَكْعَةً وَسَجْدَتَيْنِ",
                "id": "Telah mengabarkan kepadaku [Katsir bin 'Ubaid] dari [Baqiyyah] dari [Syu'aib] dia berkata; telah menceritakan kepadaku [Az Zuhri] dia berkata; telah menceritakan kepada kami [Salim bin 'Abdullah] dari [bapaknya] dia berkata; \"Aku pernah berperang bersama Rasulullah Shalallahu 'Alaihi Wa Sallam di arah Najed. Kami bertemu musuh, maka beliau menyuruh kami berbaris, lalu beliau sholat bersama kami. Sebagian dari kami berdiri bersamanya dan sebagian yang lain menghadap ke arah musuh. Kemudian beliau Shalallahu 'Alaihi Wa Sallam ruku' satu kali, dan ikut ruku' pula orang yang bersamanya, lalu beliau sujud dua kali, kemudian mereka pergi menuju kelompok yang belum sholat. Setelah itu datanglah kelompok yang belum sholat, lalu Rasulullah ruku' satu kali dan sujud dua kali bersama mereka. Kemudian beliau mengucapkan salam, dan berdirilah semua kaum muslimin dan semuanya ruku' satu kali dan sujud dua kali sendiri-sendiri.\""
            },
            {
                "number": 1504,
                "arab": "أَخْبَرَنِي عِمْرَانُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ قَالَ أَنْبَأَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ عَنْ الْعَلَاءِ وَأَبِي أَيُّوبَ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ قَامَ فَكَبَّرَ فَصَلَّى خَلْفَهُ طَائِفَةٌ مِنَّا وَطَائِفَةٌ مُوَاجِهَةَ الْعَدُوِّ فَرَكَعَ بِهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَةً وَسَجَدَ سَجْدَتَيْنِ ثُمَّ انْصَرَفُوا وَلَمْ يُسَلِّمُوا وَأَقْبَلُوا عَلَى الْعَدُوِّ فَصَفُّوا مَكَانَهُمْ وَجَاءَتْ الطَّائِفَةُ الْأُخْرَى فَصَفُّوا خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى بِهِمْ رَكْعَةً وَسَجْدَتَيْنِ ثُمَّ سَلَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ أَتَمَّ رَكْعَتَيْنِ وَأَرْبَعَ سَجَدَاتٍ ثُمَّ قَامَتْ الطَّائِفَتَانِ فَصَلَّى كُلُّ إِنْسَانٍ مِنْهُمْ لِنَفْسِهِ رَكْعَةً وَسَجْدَتَيْنِقَالَ أَبُو بَكْرِ بْنُ السُّنِّيِّ الزُّهْرِيُّ سَمِعَ مِنْ ابْنِ عُمَرَ حَدِيثَيْنِ وَلَمْ يَسْمَعْ هَذَا مِنْهُ",
                "id": "Telah mengabarkan kepadaku ['Imran bin Bakkar] dia berkata; telah menceritakan kepada kami [Muhammad bin Al Mubarak] dia berkata; telah memberitakan kepada kami [Al Haitsam bin Humaid] dari [Al 'Ala] dan [Abu Ayyub] dari [Az Zuhri] dari ['Abdullah bin 'Umar] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah sholat Khauf. Beliau berdiri lalu bertakbir, maka sekelompok dari kami membuat barisan di belakangnya, sedangkan sekelompok yang lain menghadapi musuh. Kemudian beliau ruku' satu kali dan sujud dua kali bersama mereka. Lalu mereka pergi untuk menghadapi musuh, dan mereka belum salam. Kemudian kelompok yang belum sholat (yang menghadap ke musuh) berbaris di belakang Rasulullah, lalu beliau sholat bersama mereka dengan satu kali ruku' dan dua kali sujud. Kemudian beliau mengucapkan salam dan telah menyempurnakan sholatnya dengan dua kali ruku' dan empat kali sujud. Kedua kelompok tadi lalu berdiri dan semuanya sholat sendiri-sendiri dengan satu kali ruku' dan dua kali sujud.\" Abu Bakr bin As Suni; Az Zuhri mendengar dua Hadist dari Ibnu Umar, dan dia tidak mendengar Hadist ini dari Ibnu Umar."
            },
            {
                "number": 1505,
                "arab": "أَخْبَرَنَا عَبْدُ الْأَعْلَى بْنُ وَاصِلِ بْنِ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ سُفْيَانَ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ فِي بَعْضِ أَيَّامِهِ فَقَامَتْ طَائِفَةٌ مَعَهُ وَطَائِفَةٌ بِإِزَاءِ الْعَدُوِّ فَصَلَّى بِالَّذِينَ مَعَهُ رَكْعَةً ثُمَّ ذَهَبُوا وَجَاءَ الْآخَرُونَ فَصَلَّى بِهِمْ رَكْعَةً ثُمَّ قَضَتْ الطَّائِفَتَانِ رَكْعَةً رَكْعَةً",
                "id": "Telah mengabarkan kepada kami ['Abdul A'la bin Washil bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Yahya bin Adam] dari [Sufyan] dari [Musa bin 'Uqbah] dari [Nafi'] dari [Ibnu 'Umar] dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam mengerjakan sholat Khauf pada sebagian hari-harinya (peperangan). Sebagian kelompok berdiri bersamanya dan sebagian lain menghadap kearah musuh. Lalu beliau sholat satu rakaat dengan orang-orang yang bersamanya, lalu mereka pergi (menempati posisi yang menghadap kearah musuh) sedangkan kelompok (yang menghadap ke musuh) menempati (posisi yang baru sholat), dan Rasulullah sholat satu rakaat bersama mereka. Setelah itu kedua kelompok tersebut menyempurnakan satu rakaat satu rakaat.\""
            },
            {
                "number": 1506,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا إِسْمَعِيلُ قَالَ حَدَّثَنَا حُمَيْدٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَ لِأَهْلِ الْجَاهِلِيَّةِ يَوْمَانِ فِي كُلِّ سَنَةٍ يَلْعَبُونَ فِيهِمَا فَلَمَّا قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ قَالَ كَانَ لَكُمْ يَوْمَانِ تَلْعَبُونَ فِيهِمَا وَقَدْ أَبْدَلَكُمْ اللَّهُ بِهِمَا خَيْرًا مِنْهُمَا يَوْمَ الْفِطْرِ وَيَوْمَ الْأَضْحَى",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah memberitakan kepada kami [Isma'il] dia berkata; telah menceritakan kepada kami [Humaid] dari [Anas bin Malik] dia berkata; \"Orang-orang Jahiliyah mempunyai dua hari dalam setiap tahun untuk bermain-main. Setelah Rasulullah Shalallahu 'Alaihi Wa Sallam datang ke Madinah, beliau Shalallahu 'Alaihi Wa Sallam bersabda: 'Kalian dahulu mempunyai dua hari untuk bermain-main, sungguh Allah telah menggantinya dengan yang lebih baik dari keduanya, yakni hari (raya) Fitri dan hari (raya) Adha (Kurban) '.\""
            },
            {
                "number": 1507,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنَا أَبُو بِشْرٍ عَنْ أَبِي عُمَيْرِ بْنِ أَنَسٍ عَنْ عُمُومَةٍ لَهُأَنَّ قَوْمًا رَأَوْا الْهِلَالَ فَأَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهُمْ أَنْ يُفْطِرُوا بَعْدَ مَا ارْتَفَعَ النَّهَارُ وَأَنْ يَخْرُجُوا إِلَى الْعِيدِ مِنْ الْغَدِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Syu'bah] dia berkata; telah menceritakan kepada kami [Abu Bisyr] dari [Abu 'Umair bin Anas] dari [bibinya], bahwa ada suatu kaum yang melihat hilal (bulan Sabit, masuknya bulan Syawal), lalu mereka datang kepada Rasulullah Shalallahu 'Alaihi Wa Sallam. Kemudian beliau Shalallahu 'Alaihi Wa Sallam memerintahkan mereka untuk berbuka puasa setelah hari agak siang dan keluar ke tempat sholat Id (hari raya) besoknya."
            },
            {
                "number": 1508,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ قَالَ حَدَّثَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ حَفْصَةَ قَالَتْكَانَتْ أُمُّ عَطِيَّةَ لَا تَذْكُرُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا قَالَتْ بِأَبَا فَقُلْتُ أَسَمِعْتِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ كَذَا وَكَذَا فَقَالَتْ نَعَمْ بِأَبَا قَالَ لِيَخْرُجْ الْعَوَاتِقُ وَذَوَاتُ الْخُدُورِ وَالْحُيَّضُ وَيَشْهَدْنَ الْعِيدَ وَدَعْوَةَ الْمُسْلِمِينَ وَلْيَعْتَزِلْ الْحُيَّضُ الْمُصَلَّى",
                "id": "Telah mengabarkan kepada kami ['Amr bin Zurarah] dia berkata; telah menceritakan kepada kami [Isma'il] dari [Ayyub] dari [Hafshah] dia berkata; \"Tidaklah [Ummu Athiyyah] menyebut Rasulullah Shalallahu 'Alaihi Wa Sallam melainkan dia berkata; 'Biaba (bapakku jadi jaminan) '. Maka aku bertanya kepadanya; 'Apakah engkau pernah mendengar Rasulullah Shalallahu 'Alaihi Wa Sallam menyebutkan hal ini dan itu? ' Dia menjawab, 'Ya, bapakku jadi jaminan. Beliau pernah bersabda; \"Hendaknya perempuan yang tidak dipingit dan perempuan yang dipingit, serta perempuan yang sedang haid keluar untuk menyaksikan hari raya dan seruan kaum muslim, dan perempuan yang sedang haid hendaknya menjauh dari tempat sholat.\""
            },
            {
                "number": 1509,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ قَالَلَقِيتُ أُمَّ عَطِيَّةَ فَقُلْتُ لَهَا هَلْ سَمِعْتِ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَتْ إِذَا ذَكَرَتْهُ قَالَتْ بِأَبَا قَالَ أَخْرِجُوا الْعَوَاتِقَ وَذَوَاتِ الْخُدُورِ فَيَشْهَدْنَ الْعِيدَ وَدَعْوَةَ الْمُسْلِمِينَ وَلْيَعْتَزِلْ الْحُيَّضُ مُصَلَّى النَّاسِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Ayyub] dari [Muhammad] dia berkata; \"Aku pernah berjumpa [Ummu Athiyyah], lalu aku bertanya kepadanya; 'Apakah engkau pernah mendengarnya dari Rasulullah Shalallahu 'Alaihi Wa Sallam yang mana Ummu Athiyah bila mengingatnya dia berkata; \"Bapakku jadi jaminannya\" Beliau bersabda: 'Hendaknya perempuan yang tidak dipingit dan perempuan yang dipingit keluar untuk menyaksikan hari raya dan seruan kaum muslim, dan perempuan yang sedang haid hendaknya menjauh dari tempat sholat.'"
            },
            {
                "number": 1510,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ عَنْ ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ وَعَمْرُو بْنُ الْحَارِثِ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَوَجَدَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ حُلَّةً مِنْ إِسْتَبْرَقٍ بِالسُّوقِ فَأَخَذَهَا فَأَتَى بِهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ ابْتَعْ هَذِهِ فَتَجَمَّلْ بِهَا لِلْعِيدِ وَالْوَفْدِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا هَذِهِ لِبَاسُ مَنْ لَا خَلَاقَ لَهُ أَوْ إِنَّمَا يَلْبَسُ هَذِهِ مَنْ لَا خَلَاقَ لَهُ فَلَبِثَ عُمَرُ مَا شَاءَ اللَّهُ ثُمَّ أَرْسَلَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجُبَّةِ دِيبَاجٍ فَأَقْبَلَ بِهَا حَتَّى جَاءَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ قُلْتَ إِنَّمَا هَذِهِ لِبَاسُ مَنْ لَا خَلَاقَ لَهُ ثُمَّ أَرْسَلْتَ إِلَيَّ بِهَذِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعْهَا وَتُصِبْ بِهَا حَاجَتَكَ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Dawud] dari [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku [Yunus bin Yazid] dan ['Amr bin Al Harits] dari [Ibnu Syihab] dari [Salim] dari [bapaknya] dia berkata; \"Umar bin Khaththab Radliallahu? nhu pernah mendapatkan jubah dari sutra di pasar, lalu ia mengambilnya dan membawanya kepada Rasulullah Shalallahu 'Alaihi Wa Sallam. Kemudian Umar berkata; `Wahai Rasulullah Shalallahu 'Alaihi Wa Sallam, belilah ini lalu berhiaslah dengannya untuk hari raya atau untuk menyambut tamu yang datang'. Beliau menjawab, Ini pakaian orang yang tidak mempunyai bagian di akhirat atau ini adalah pakaian yang dikenakan kepada orang yang tidak mempunyai bagian di akhirat '. Lalu Umar berdiam diri selama waktu yang dikehendaki oleh Allah. Kemudian Rasulullah shallallahu 'alaihi wasallam mengirimkan baju sutra halus, maka ia menghadap beliau. Ketika sampai kepada beliau shallallahu 'alaihi wasallam, ia berkata; `Wahai Rasulullah, engkau mengatakan bahwa ini adalah pakaian orang yang tidak mempunyai bagian, tetapi mengapa engkau mengirimkan baju sutra ini kepadaku? Rasulullah Shalallahu 'Alaihi Wa Sallam lalu berkata: `Juallah. Kamu bisa memenuhi kebutuhanmu dari hasil menjual pakaian tersebut'.\""
            },
            {
                "number": 1511,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ الْأَشْعَثِ عَنْ الْأَسْوَدِ بْنِ هِلَالٍ عَنْ ثَعْلَبَةَ بْنِ زَهْدَمٍأَنَّ عَلِيًّا اسْتَخْلَفَ أَبَا مَسْعُودٍ عَلَى النَّاسِ فَخَرَجَ يَوْمَ عِيدٍ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّهُ لَيْسَ مِنْ السُّنَّةِ أَنْ يُصَلَّى قَبْلَ الْإِمَامِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] dia berkata; telah memberitakan kepada kami ['Abdurrahman] dari [Sufyan] dari [Al Asy'ats] dari [Al Aswad bin Hilal] dari [Tsa'labah bin Zahdam] bahwa Ali mengangkat [Abu Mas'ud] sebagai wakilnya, lalu ia keluar pada hari raya, kemudian berkata; \"Wahai manusia, bukan termasuk Sunnah seseorang mengerjakan sholat sebelum imam.\""
            },
            {
                "number": 1512,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي عِيدٍ قَبْلَ الْخُطْبَةِ بِغَيْرِ أَذَانٍ وَلَا إِقَامَةٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari ['Abdul Malik bin Abu Sulaiman] dari ['Atha] dari [Jabir] dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam sholat hari raya bersama kami sebelum khutbah, tanpa adzan dan iqamah.\""
            },
            {
                "number": 1513,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُثْمَانَ قَالَ حَدَّثَنَا بَهْزٌ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي زُبَيْدٌ قَالَ سَمِعْتُ الشَّعْبِيَّ يَقُولُ حَدَّثَنَا الْبَرَاءُ بْنُ عَازِبٍ عِنْدَ سَارِيَةٍ مِنْ سَوَارِي الْمَسْجِدِ قَالَخَطَبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ فَقَالَ إِنَّ أَوَّلَ مَا نَبْدَأُ بِهِ فِي يَوْمِنَا هَذَا أَنْ نُصَلِّيَ ثُمَّ نَذْبَحَ فَمَنْ فَعَلَ ذَلِكَ فَقَدْ أَصَابَ سُنَّتَنَا وَمَنْ ذَبَحَ قَبْلَ ذَلِكَ فَإِنَّمَا هُوَ لَحْمٌ يُقَدِّمُهُ لِأَهْلِهِ فَذَبَحَ أَبُو بُرْدَةَ بْنُ دِينَارٍ فَقَالَ يَا رَسُولَ اللَّهِ عِنْدِي جَذَعَةٌ خَيْرٌ مِنْ مُسِنَّةٍ قَالَ اذْبَحْهَا وَلَنْ تُوفِيَ عَنْ أَحَدٍ بَعْدَكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Utsman] dia berkata; telah menceritakan kepada kami [Bahz] dia berkata; telah menceritakan kepada kami [Syu'bah] dia berkata; telah mengabarkan kepadaku [Zubaid] dia berkata; aku mendengar [Asy Sya'bi] berkata; telah menceritakan kepada kami [Al Barra' bin 'Azib] saat berada (bersandar) di salah satu tiang masjid dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam pernah khutbah saat hari raya Kurban dengan bersabda: 'Yang pertama kali kita lakukan pada hari ini adalah mengerjakan sholat, kemudian menyembelih. Barangsiapa melakukan hal itu, maka ia sesuai dengan Sunnah kami, dan barangsiapa menyembelih sebelum sholat, maka itu hanya daging biasa yang disuguhkan untuk keluarganya'. Abu Burdah bin Dinar pun menyembelih, lalu ia berkata; 'Wahai Rasulullah Shalallahu 'Alaihi Wa Sallam, aku mempunyai Jadza'ah yang lebih baik dari musinnah! Rasulullah Shalallahu 'Alaihi Wa Sallam menjawab: `Sembelihlah, dan hal itu tidak mencukupi salah seorang setelah kamu (tidak boleh dilakukan) '. "
            },
            {
                "number": 1514,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدَةُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا كَانُوا يُصَلُّونَ الْعِيدَيْنِ قَبْلَ الْخُطْبَةِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami ['Abdah bin Sulaiman] dia berkata; telah menceritakan kepada kami ['ubaidhullah] dari [Nafi'] dari [Ibnu 'Umar] bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam, Abu Bakar, dan Umar Radliallahu? nhum mengerjakan sholat dua hari raya sebelum khutbah."
            },
            {
                "number": 1515,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُخْرِجُ الْعَنَزَةَ يَوْمَ الْفِطْرِ وَيَوْمَ الْأَضْحَى يُرْكِزُهَا فَيُصَلِّي إِلَيْهَا",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami ['Abdurrazzaq] dia berkata; telah memberitakan kepada kami [Ma'mar] dari [Ayyub] dari [Nafi'] dari [Ibnu 'Umar] bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam keluar pada hari Idul Fitri dan Idul Adha dengan membawa tombak, lalu beliau menancapkannya, kemudian sholat menghadap ke arahnya."
            },
            {
                "number": 1516,
                "arab": "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى قَالَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا سُفْيَانُ بْنُ سَعِيدٍ عَنْ زُبَيْدٍ الْأَيَامِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى ذَكَرَهُ عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَصَلَاةُ الْأَضْحَى رَكْعَتَانِ وَصَلَاةُ الْفِطْرِ رَكْعَتَانِ وَصَلَاةُ الْمُسَافِرِ رَكْعَتَانِ وَصَلَاةُ الْجُمُعَةِ رَكْعَتَانِ تَمَامٌ لَيْسَ بِقَصْرٍ عَلَى لِسَانِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami ['Imran bin Musa] dia berkata; telah menceritakan kepada kami [Yazid bin Zurai'] dia berkata; telah menceritakan kepada kami [Sufyan bin Sa'id] dari [Zubaid Al Ayami] dari ['Abdurrahman bin Abu Laila] menyebutkannya dari ['Umar bin Al Khaththab radliallahu 'anhu] dia berkata; \"sholat Idul Adha dua rakaat, sholat Idul Fitri dua rakaat, sholat musafir dua rakaat, dan sholat Jum'at dua rakaat. Semua itu sempurna, bukan qashar (diringkas) menurut sabda Rasulullah shallallahu 'alaihi wasallam."
            },
            {
                "number": 1517,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ أَنْبَأَنَا سُفْيَانُ قَالَ حَدَّثَنِي ضَمْرَةُ بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ قَالَخَرَجَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ يَوْمَ عِيدٍ فَسَأَلَ أَبَا وَاقِدٍ اللَّيْثِيَّ بِأَيِّ شَيْءٍ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي هَذَا الْيَوْمِ فَقَالَ بِقَافْ وَاقْتَرَبَتْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dia berkata; telah memberitakan kepada kami [Sufyan] dia berkata; telah menceritakan kepadaku [Dhamrah bin Sa'id] dari ['ubaidhullah bin 'Abdullah] dia berkata; \"[Umar] radliallahu 'anhu keluar pada hari raya, lalu ia bertanya kepada Abu Waqid AI Laitsi, 'Surat apakah yang dibaca Rasulullah shallallahu 'alaihi wasallam pada hari seperti ini'? ' la menjawab; `Surah Qaaf dan Iqtarobat (Al Qamar) '.\""
            },
            {
                "number": 1518,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الْعِيدَيْنِ وَيَوْمِ الْجُمُعَةِ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ وَرُبَّمَا اجْتَمَعَا فِي يَوْمٍ وَاحِدٍ فَيَقْرَأُ بِهِمَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Ibrahim bin Muhammad bin Al Muntasyir] dari [bapaknya] dari [Habib bin Salim] dari [An Nu'man bin Basyir] dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam membaca surat Al A'laa dan Al Ghaasyiyah ketika sholat Jum'at. Kadang hari raya dan Jum'at berkumpul dalam satu hari, maka beliau membaca keduanya.\""
            },
            {
                "number": 1519,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ سَمِعْتُ أَيُّوبَ يُخْبِرُ عَنْ عَطَاءٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُأَشْهَدُ أَنِّي شَهِدْتُ الْعِيدَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَدَأَ بِالصَّلَاةِ قَبْلَ الْخُطْبَةِ ثُمَّ خَطَبَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dia berkata; telah menceritakan kepada kami [Sufyan] dia berkata; Aku mendengar [Ayyub] mengabarkan dari ['Atha] dia berkata; Aku mendengar [Ibnu 'Abbas] berkata; \"Aku bersaksi bahwa aku pernah ikut sholat hari raya bersama Rasulullah Shalallahu 'Alaihi Wa Sallam. Beliau memulai sholat sebelum khutbah, kemudian berkhutbah.\""
            },
            {
                "number": 1520,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ مَنْصُورٍ عَنْ الشَّعْبِيِّ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ بَعْدَ الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abul Ahwash] dari [Manshur] dari [Asy Sya'bi] dari [Al Barra' bin 'Azib] dia berkata; \"Rasulullah Shallallahu'alaihiwasallam berkhutbah kepada kami pada hari raya Kurban setelah sholat.\""
            },
            {
                "number": 1521,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ أَيُّوبَ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الْعِيدَ قَالَ مَنْ أَحَبَّ أَنْ يَنْصَرِفَ فَلْيَنْصَرِفْ وَمَنْ أَحَبَّ أَنْ يُقِيمَ لِلْخُطْبَةِ فَلْيُقِمْ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya bin Ayyub] dia berkata; telah menceritakan kepada kami [Al Fadhl bin Musa] dia berkata; telah menceritakan kepada kami [Ibnu Juraij] dari ['Atha] dari ['Abdullah bin As Saib] bahwa Nabi Shalallahu 'Alaihi Wa Sallam pernah sholat Id, dan beliau bersabda: \"Barangsiapa ingin pulang, maka hendaklah ia pulang, dan barangsiapa ingin tetap tinggal untuk mendengar khutbah maka hendaklah ia tetap tinggal mendengarkannya.\""
            },
            {
                "number": 1522,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادٍ عَنْ أَبِيهِ عَنْ أَبِي رِمْثَةَ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dia berkata; telah menceritakan kepada kami ['ubaidhullah bin Iyad] dari [bapaknya] dari [Abu Rimtsah] dia berkata; \"Aku melihat Rasulullah Shalallahu 'Alaihi Wa Sallam berkhutbah dengan memakai dua selendang yang berwarna hijau.\""
            },
            {
                "number": 1523,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ قَالَ أَخْبَرَنِي إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ أَخِيهِ عَنْ أَبِي كَاهِلٍ الْأَحْمَسِيِّ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ عَلَى نَاقَةٍ وَحَبَشِيٌّ آخِذٌ بِخِطَامِ النَّاقَةِ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; telah menceritakan kepada kami [Ibnu Abu Zaidah] dia berkata; telah mengabarkan kepadaku [Isma'il bin Abu Khalid] dari [saudaranya] dari [Abu Kahil Al Ahmasi] dia berkata; \"Aku pernah melihat Nabi Shalallahu 'Alaihi Wa Sallam menyampaikan khutbah di atas untanya, dan seorang Habsyi yang memegangi tali kekang untanya.\""
            },
            {
                "number": 1524,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكٍ قَالَسَأَلْتُ جَابِرًا أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا ثُمَّ يَقْعُدُ قَعْدَةً ثُمَّ يَقُومُ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Simak] dia berkata; \"Aku pernah bertanya kepada [Jabir], 'Apakah Rasulullah Shalallahu 'Alaihi Wa Sallam khutbah sambil berdiri? ' la menjawab; \"Rasulullah Shalallahu 'Alaihi Wa Sallam berkhutbah sambil berdiri, kemudian duduk sebentar, lalu berdiri lagi'.\""
            },
            {
                "number": 1525,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ قَالَ حَدَّثَنَا عَطَاءٌ عَنْ جَابِرٍ قَالَشَهِدْتُ الصَّلَاةَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي يَوْمِ عِيدٍ فَبَدَأَ بِالصَّلَاةِ قَبْلَ الْخُطْبَةِ بِغَيْرِ أَذَانٍ وَلَا إِقَامَةٍ فَلَمَّا قَضَى الصَّلَاةَ قَامَ مُتَوَكِّئًا عَلَى بِلَالٍ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَوَعَظَ النَّاسَ وَذَكَّرَهُمْ وَحَثَّهُمْ عَلَى طَاعَتِهِ ثُمَّ مَالَ وَمَضَى إِلَى النِّسَاءِ وَمَعَهُ بِلَالٌ فَأَمَرَهُنَّ بِتَقْوَى اللَّهِ وَوَعَظَهُنَّ وَذَكَّرَهُنَّ وَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ حَثَّهُنَّ عَلَى طَاعَتِهِ ثُمَّ قَالَ تَصَدَّقْنَ فَإِنَّ أَكْثَرَكُنَّ حَطَبُ جَهَنَّمَ فَقَالَتْ امْرَأَةٌ مِنْ سَفِلَةِ النِّسَاءِ سَفْعَاءُ الْخَدَّيْنِ بِمَ يَا رَسُولَ اللَّهِ قَالَ تُكْثِرْنَ الشَّكَاةَ وَتَكْفُرْنَ الْعَشِيرَ فَجَعَلْنَ يَنْزِعْنَ قَلَائِدَهُنَّ وَأَقْرُطَهُنَّ وَخَوَاتِيمَهُنَّ يَقْذِفْنَهُ فِي ثَوْبِ بِلَالٍ يَتَصَدَّقْنَ بِهِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dia berkata; telah menceritakan kepada kami ['Abdul Malik bin Abu Sulaiman] dia berkata; telah menceritakan kepada kami ['Atha] dari [Jabir] dia berkata; \"Aku pernah sholat Id bersama Rasulullah Shalallahu 'Alaihi Wa Sallam. Beliau memulainya dengan sholat, sebelum khutbah tanpa adzan dan iqamah Setelah selesai sholat beliau berdiri dengan bersandar kepada Bilal, lalu beliau memuji Allah dan menyanjung-Nya, kemudian menasihati, memperingatkan, dan menganjurkan mereka untuk menaatinya. Selanjutnya beliau dan bilal bergeser dan beralih ke arah para perempuan, lalu memerintahkan mereka untuk bertakwa kepada Allah, dan menasihati serta memperingatkannya. kemudian beliau memuji dan menyanjung-Nya, serta menganjurkan mereka untuk menaatinya. Setelah itu beliau bersabda: \"Bersedekahlah kalian, karena sebagian besar kalian adalah bahan bakar api neraka.\" Lalu ada seorang perempuan biasa bangkit berdiri -dengan pipi yang memerah- berkata; \"Apa penyebabnya wahai Rasulullah shallallahu 'alaihi wasallam?\" Beliau bersabda: \"Kalian banyak mengeluh dan mengingkari kebaikan suami.\" Lalu mereka segera melepaskan kalung, anting, serta cincin mereka dan melemparkannya ke kain (yang dibentangkan) Bilal sebagai sedekah."
            },
            {
                "number": 1526,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ عَنْ دَاوُدَ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْرُجُ يَوْمَ الْفِطْرِ وَيَوْمَ الْأَضْحَى إِلَى الْمُصَلَّى فَيُصَلِّي بِالنَّاسِ فَإِذَا جَلَسَ فِي الثَّانِيَةِ وَسَلَّمَ قَامَ فَاسْتَقْبَلَ النَّاسَ بِوَجْهِهِ وَالنَّاسُ جُلُوسٌ فَإِنْ كَانَتْ لَهُ حَاجَةٌ يُرِيدُ أَنْ يَبْعَثَ بَعْثًا ذَكَرَهُ لِلنَّاسِ وَإِلَّا أَمَرَ النَّاسَ بِالصَّدَقَةِ قَالَ تَصَدَّقُوا ثَلَاثَ مَرَّاتٍ فَكَانَ مِنْ أَكْثَرِ مَنْ يَتَصَدَّقُ النِّسَاءُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami ['Abdul 'Aziz] dari [Dawud] dari ['Iyadh bin 'Abdullah] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam pada hari Idul Fitri dan Idul Adha ke Mushalla (lapangan tempat sholat) lalu Beliau sholat bersama manusia. Bila beliau telah duduk pada rakaat kedua maka beliau mengucapkan salam, kemudian menghadap kepada manusia dengan wajahnya, sedangkan manusia duduk. Bila beliau mempunyai suatu keperluan, yakni hendak mengutus pasukan, maka beliau menyebutkannya, dan jika tidak ada keperluan maka beliau memerintahkan manusia untuk sedekah dengan bersabda \"Bersedekahlah.\" Beliau mengucapkannya sebanyak tiga kali. Sebagian besar yang bersedekah adalah wanita."
            },
            {
                "number": 1527,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ ابْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قُلْتَ لِصَاحِبِكَ أَنْصِتْ وَالْإِمَامُ يَخْطُبُ فَقَدْ لَغَوْتَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] secara baca dan aku mendengarnya lafazh ini darinya dari [Ibnul Qasim] dia berkata; telah menceritakan kepadaku [Malik] dari [Ibnu Syihab] dari [Ibnul Musayyab] dari [Abu Hurairah] Bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Jika kamu berkata kepada temanmu, 'Diamlah' ketika imam sedang khutbah, maka kamu telah berbuat sia-sia.\""
            },
            {
                "number": 1528,
                "arab": "أَخْبَرَنَا عُتْبَةُ بْنُ عَبْدِ اللَّهِ قَالَ أَنْبَأَنَا ابْنُ الْمُبَارَكِ عَنْ سُفْيَانَ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي خُطْبَتِهِ يَحْمَدُ اللَّهَ وَيُثْنِي عَلَيْهِ بِمَا هُوَ أَهْلُهُ ثُمَّ يَقُولُ مَنْ يَهْدِهِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْهُ فَلَا هَادِيَ لَهُ إِنَّ أَصْدَقَ الْحَدِيثِ كِتَابُ اللَّهِ وَأَحْسَنَ الْهَدْيِ هَدْيُ مُحَمَّدٍ وَشَرُّ الْأُمُورِ مُحْدَثَاتُهَا وَكُلُّ مُحْدَثَةٍ بِدْعَةٌ وَكُلُّ بِدْعَةٍ ضَلَالَةٌ وَكُلُّ ضَلَالَةٍ فِي النَّارِ ثُمَّ يَقُولُ بُعِثْتُ أَنَا وَالسَّاعَةُ كَهَاتَيْنِ وَكَانَ إِذَا ذَكَرَ السَّاعَةَ احْمَرَّتْ وَجْنَتَاهُ وَعَلَا صَوْتُهُ وَاشْتَدَّ غَضَبُهُ كَأَنَّهُ نَذِيرُ جَيْشٍ يَقُولُ صَبَّحَكُمْ مَسَّاكُمْ ثُمَّ قَالَ مَنْ تَرَكَ مَالًا فَلِأَهْلِهِ وَمَنْ تَرَكَ دَيْنًا أَوْ ضَيَاعًا فَإِلَيَّ أَوْ عَلَيَّ وَأَنَا أَوْلَى بِالْمُؤْمِنِينَ",
                "id": "Telah mengabarkan kepada kami ['Utbah bin 'Abdullah] dia berkata; telah memberitakan kepada kami [Ibnul Mubarak] dari [Sufyan] dari [Ja'far bin Muhammad] dari [bapaknya] dari [Jabir bin 'Abdullah] dia berkata; \"Apabila Rasulullah Shalallahu 'Alaihi Wa Sallam berkhutbah, maka beliau memuji dan menyanjung Allah dengan hal-hal yang menjadi hak-Nya, kemudian bersabda: 'Barangsiapa telah diberi petunjuk oleh Allah, maka tidak ada yang bisa menyesatkannya. Barangsiapa telah disesatkan oleh Allah, maka tidak ada yang bisa memberikan petunjuk kepadanya. Sebenar-benar perkataan adalah kitabullah (Al Qur'an), sebaik-baik petunjuk adalah petunjuk Muhammad shallallahu 'alaihi wasallam, dan sejelek jelek perkara adalah hal-hal yang baru, setiap hal yang baru adalah bid'ah dan setiap bid'ah adalah sesat, dan setiap kesesatan di dalam neraka'. Kemudian beliau bersabda lagi, 'Ketika aku diutus, jarak antara aku dan hari Kiamat seperti jarak dua jari ini'. Bila beliau menyebutkan hari Kiamat maka kedua pipinya memerah, suaranya meninggi, dan amarahnya bertambah, seolah-olah beliau memperingatkan pasukan. Beliau bersabda: 'Hati-hati pada pagi kalian dan sorenya'. Barangsiapa meninggalkan harta, maka itu buat keluarganya dan barangsiapa meninggalkan utang atau sesuatu yang hilang maka itu tanggunganku. Aku adalah wali bagi orang-orang yang beriman '.\""
            },
            {
                "number": 1529,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ قَالَ حَدَّثَنِي عِيَاضٌ عَنْ أَبِي سَعِيدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْرُجُ يَوْمَ الْعِيدِ فَيُصَلِّي رَكْعَتَيْنِ ثُمَّ يَخْطُبُ فَيَأْمُرُ بِالصَّدَقَةِ فَيَكُونُ أَكْثَرَ مَنْ يَتَصَدَّقُ النِّسَاءُ فَإِنْ كَانَتْ لَهُ حَاجَةٌ أَوْ أَرَادَ أَنْ يَبْعَثَ بَعْثًا تَكَلَّمَ وَإِلَّا رَجَعَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Dawud bin Qais] dia berkata; telah menceritakan kepada kami ['Iyadh] dari [Abu Sa'id] bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam keluar pada hari raya, lalu sholat dua rakaat. Kemudian beliau berkhutbah, memerintahkan manusia untuk sedekah, maka sebagian besar yang bersedekah adalah wanita. Jika beliau mempunyai pasukan atau hendak mengutus seseorang maka beliau berbicara, dan jika tidak ada maka beliau pulang."
            },
            {
                "number": 1530,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا يَزِيدُ وَهُوَ ابْنُ هَارُونَ قَالَ أَنْبَأَنَا حُمَيْدٌ عَنْ الْحَسَنِأَنَّ ابْنَ عَبَّاسٍ خَطَبَ بِالْبَصْرَةِ فَقَالَ أَدُّوا زَكَاةَ صَوْمِكُمْ فَجَعَلَ النَّاسُ يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ فَقَالَ مَنْ هَاهُنَا مِنْ أَهْلِ الْمَدِينَةِ قُومُوا إِلَى إِخْوَانِكُمْ فَعَلِّمُوهُمْ فَإِنَّهُمْ لَا يَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَضَ صَدَقَةَ الْفِطْرِ عَلَى الصَّغِيرِ وَالْكَبِيرِ وَالْحُرِّ وَالْعَبْدِ وَالذَّكَرِ وَالْأُنْثَى نِصْفَ صَاعٍ مِنْ بُرٍّ أَوْ صَاعًا مِنْ تَمْرٍ أَوْ شَعِيرٍ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Hujr] dia berkata; telah menceritakan kepada kami [Yazid bin Harun] dia berkata; telah memberitakan kepada kami [Humaid] dari [Al Hasan] bahwasanya [Ibnu 'Abbas] pernah khutbah di Bashrah, dia berkata; \"Tunaikanlah zakat puasa kalian.\" Orang-orangpun saling melihat satu sama lain. Lalu ia pun berkata; \"Siapakah orang Madinah yang bersama kalian di sini? Bangkitlah kepada saudara kalian lalu ajarilah, karena mereka tidak mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam telah mewajibkan zakat fitri atas anak kecil dan orang dewasa, yang merdeka dan hamba sahaya, lelaki dan perempuan, sebanyak setengah Sha' gandum atau satu Sha' kurma atau sya'ir (jenis gandum).\""
            },
            {
                "number": 1531,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ مَنْصُورٍ عَنْ الشَّعْبِيِّ عَنْ الْبَرَاءِ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ بَعْدَ الصَّلَاةِ ثُمَّ قَالَ مَنْ صَلَّى صَلَاتَنَا وَنَسَكَ نُسُكَنَا فَقَدْ أَصَابَ النُّسُكَ وَمَنْ نَسَكَ قَبْلَ الصَّلَاةِ فَتِلْكَ شَاةُ لَحْمٍ فَقَالَ أَبُو بُرْدَةَ بْنُ نِيَارٍ يَا رَسُولَ اللَّهِ وَاللَّهِ لَقَدْ نَسَكْتُ قَبْلَ أَنْ أَخْرُجَ إِلَى الصَّلَاةِ عَرَفْتُ أَنَّ الْيَوْمَ يَوْمُ أَكْلٍ وَشُرْبٍ فَتَعَجَّلْتُ فَأَكَلْتُ وَأَطْعَمْتُ أَهْلِي وَجِيرَانِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِلْكَ شَاةُ لَحْمٍ قَالَ فَإِنَّ عِنْدِي جَذَعَةً خَيْرٌ مِنْ شَاتَيْ لَحْمٍ فَهَلْ تُجْزِي عَنِّي قَالَ نَعَمْ وَلَنْ تُجْزِيَ عَنْ أَحَدٍ بَعْدَكَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abul Ahwash] dari [Manshur] dari [Asy Sya'bi] dari [Al Barra'] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam khutbah pada hari raya Kurban setelah sholat, lalu bersabda: 'Barangsiapa sholat (seperti) sholat kami, dan berkurban (seperti) kurban kami, maka ia telah berkurban dengan benar, dan barangsiapa berkurban sebelum sholat, maka itu hanya daging kambing (bukan kurban) '. Abu Burdah bin Niyar berkata, 'Wahai Rasulullah demi Allah, aku telah menyembelih (kurban) sebelum keluar untuk sholat (id), karena aku mengetahui bahwa hari ini adalah hari (untuk) makan dan minum, maka aku menyegerakan menyembelih (kurban) lalu aku makan dan aku berikan kepada keluarga dan tetanggaku, \" maka Rasulullah bersabda: \"Itu adalah daging kambing (bukan kurban) '.\" Abu Burdah berkata; \"Sesungguhnya aku mempunyai jadza'ah yang lebih baik dari dua kambing daging, maka apakah itu mencukupi bagiku (sebagai gantinya)? Nabi menjawab: \"Ya, \" tetapi ia tidak mencukupi bagi seorang setelahmu.\""
            },
            {
                "number": 1532,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَكُنْتُ أُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَتْ صَلَاتُهُ قَصْدًا وَخُطْبَتُهُ قَصْدًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abul Ahwash] dari [Simak] dari [Jabir bin Samurah] dia berkata; \"Aku pernah sholat bersama Rasulullah Shalallahu 'Alaihi Wa Sallam. sholat beliau sederhana dan khutbahnya juga sederhana.\" (Tidak terlalu cepat dan tidak terlalu panjang)."
            },
            {
                "number": 1533,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا ثُمَّ يَقْعُدُ قَعْدَةً لَا يَتَكَلَّمُ فِيهَا ثُمَّ قَامَ فَخَطَبَ خُطْبَةً أُخْرَى فَمَنْ خَبَّرَكَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ قَاعِدًا فَلَا تُصَدِّقْهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Simak] dari [Jabir bin Samurah] dia berkata; \"Aku pernah melihat Rasulullah Shalallahu 'Alaihi Wa Sallam khutbah pada hari Jum'at sambil berdiri, kemudian duduk sejenak tanpa berbicara. Kemudian berdiri lagi untuk menyampaikan khutbah yang kedua. Barangsiapa menceritakan kepadamu bahwa Nabi shallallahu 'alaihi wasallam menyampaikan khutbah sambil duduk maka janganlah kamu mempercayainya.\""
            },
            {
                "number": 1534,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ قَائِمًا ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ وَيَقْرَأُ آيَاتٍ وَيَذْكُرُ اللَّهَ وَكَانَتْ خُطْبَتُهُ قَصْدًا وَصَلَاتُهُ قَصْدًا",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Simak] dari [Jabir bin Samurah] dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam menyampaikan khutbah sambil berdiri, kemudian duduk, lalu berdiri dan membaca beberapa ayat serta berdzikir kepada Allah. Khutbah beliau sederhana (tidak lama dan tidak sebentar), dan sholatnya juga sederhana (tidak lama dan tidak sebentar).\""
            },
            {
                "number": 1535,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا أَبُو تُمَيْلَةَ عَنْ الْحُسَيْنِ بْنِ وَاقِدٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَبَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يَخْطُبُ إِذْ أَقْبَلَ الْحَسَنُ وَالْحُسَيْنُ عَلَيْهِمَا السَّلَام عَلَيْهِمَا قَمِيصَانِ أَحْمَرَانِ يَمْشِيَانِ وَيَعْثُرَانِ فَنَزَلَ وَحَمَلَهُمَا فَقَالَ صَدَقَ اللَّهُ إِنَّمَا أَمْوَالُكُمْ وَأَوْلَادُكُمْ فِتْنَةٌ رَأَيْتُ هَذَيْنِ يَمْشِيَانِ وَيَعْثُرَانِ فِي قَمِيصَيْهِمَا فَلَمْ أَصْبِرْ حَتَّى نَزَلْتُ فَحَمَلْتُهُمَا",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; telah menceritakan kepada kami [Abu Tumailah] dari [Al Husain bin Waqid] dari [Ibnu Buraidah] dari [bapaknya] dia berkata; \"Pada saat Rasulullah Shalallahu 'Alaihi Wa Sallam khutbah di atas mimbar, tiba-tiba Hasan dan Husain Radliallahu? nhuma datang dengan memakai baju merah. Keduanya berjalan, lalu terjatuh. Maka Rasulullah Shalallahu 'Alaihi Wa Sallam turun dari mimbar, lalu menggendong keduanya, kemudian bersabda: `Allah Maha Benar (firman-Nya), 'Sesungguhnya hartamu dan anak-anakmu adalah fitnah'. (Qs. Al Anfaal (8): 28). Aku melihat dua anak ini terjatuh dalam kedua bajunya, maka aku tidak sabar hingga aku turun lalu kugendong keduanya'.\""
            },
            {
                "number": 1536,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَابِسٍ قَالَسَمِعْتُ ابْنَ عَبَّاسٍ قَالَ لَهُ رَجُلٌ شَهِدْتَ الْخُرُوجَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ وَلَوْلَا مَكَانِي مِنْهُ مَا شَهِدْتُهُ يَعْنِي مِنْ صِغَرِهِ أَتَى الْعَلَمَ الَّذِي عِنْدَ دَارِ كَثِيرِ بْنِ الصَّلْتِ فَصَلَّى ثُمَّ خَطَبَ ثُمَّ أَتَى النِّسَاءَ فَوَعَظَهُنَّ وَذَكَّرَهُنَّ وَأَمَرَهُنَّ أَنْ يَتَصَدَّقْنَ فَجَعَلَتْ الْمَرْأَةُ تُهْوِي بِيَدِهَا إِلَى حَلَقِهَا تُلْقِي فِي ثَوْبِ بِلَالٍ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Sufyan] dia berkata; telah menceritakan kepada kami ['Abdurrahman bin 'Abis] dia berkata; \"Aku pernah mendengar seseorang berkata kepada [lbnu Abbas], 'Apakah engkau pernah ikut keluar bersama Rasulullah Shalallahu 'Alaihi Wa Sallam? ' la menjawab, `Ya pernah, kalaulah bukan karena posisiku (yang masih kerabat) dan usiaku yang masih kecil, maka aku tidak bisa ikut. Beliau mendatangi bendera yang berada di rumah Katsir bin Ash-Shalt, lalu beliau mengerjakan sholat kemudian menyampaikan khutbah. -Beliau- lalu mendatangi, menasihati, mengingatkan, dan memerintahkan para wanita untuk bersedekah. Maka para wanita pun melepaskan kalung-kalungnya dan melemparkannya ke baju (kain) Bilal'.\""
            },
            {
                "number": 1537,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْأَشَجُّ قَالَ حَدَّثَنَا ابْنُ إِدْرِيسَ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ عَدِيٍّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يَوْمَ الْعِيدِ فَصَلَّى رَكْعَتَيْنِ لَمْ يُصَلِّ قَبْلَهَا وَلَا بَعْدَهَا",
                "id": "Telah mengabarkan kepada kami ['Abdullah bin Sa'id Al Asyaj] dia berkata; telah menceritakan kepada kami [Ibnu Idris] dia berkata; telah memberitakan kepada kami [Syu'bah] dari ['Adi] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas], bahwa Nabi Shalallahu 'Alaihi Wa Sallam keluar pada hari raya, lalu beliau sholat dua rakaat tanpa mengerjakan sholat apapun sebelum maupun sesudahnya."
            },
            {
                "number": 1538,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَ حَدَّثَنَا حَاتِمُ بْنُ وَرْدَانَ عَنْ أَيُّوبَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أَضْحًى وَانْكَفَأَ إِلَى كَبْشَيْنِ أَمْلَحَيْنِ فَذَبَحَهُمَا",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] dia berkata; telah menceritakan kepada kami [Hatim bin Wardan] dari [Ayyub] dari [Muhammad bin Sirin] dari [Anas bin Malik], dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam menyampaikan khutbah kepada kami pada hari raya Kurban, lalu beliau menuju kepada dua kambing yang putih, kemudian menyembelihnya.\""
            },
            {
                "number": 1539,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ عَنْ شُعَيْبٍ عَنْ اللَّيْثِ عَنْ كَثِيرِ بْنِ فَرْقَدٍ عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَذْبَحُ أَوْ يَنْحَرُ بِالْمُصَلَّى",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin 'Abdul Hakim] dari [Syu'aib] dari [Al Laits] dari [Katsir bin Farqad] dari [Nafi'], ['Abdullah bin 'Umar] mengabarkan kepadanya, bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam menyembelih di tempat sholat hari raya."
            },
            {
                "number": 1540,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ قُدَامَةَ عَنْ جَرِيرٍ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ قُلْتُ عَنْ أَبِيهِ قَالَ نَعَمْ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْجُمُعَةِ وَالْعِيدِ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ وَإِذَا اجْتَمَعَ الْجُمُعَةُ وَالْعِيدُ فِي يَوْمٍ قَرَأَ بِهِمَا",
                "id": "Telah mengabarkan kepadaku [Muhammad bin Qudamah] dari [Jarir] dari [Ibrahim bin Muhammad bin Al Muntasyir], -aku berkata-; 'Dari [bapaknya]? ' dia berkata; 'Benar'- dari [Habib bin Salim] dari [An Nu'man bin Basyir] dia berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam pada sholat Jum'at dan sholat 'Id membaca surah Al A'laa dan Al Ghaasyiyah. Bila terjadi hari raya dan Jum'at dalam satu hari, maka beliau membaca keduanya.\""
            },
            {
                "number": 1541,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا إِسْرَائِيلُ عَنْ عُثْمَانَ بْنِ الْمُغِيرَةِ عَنْ إِيَاسِ بْنِ أَبِي رَمْلَةَ قَالَسَمِعْتُ مُعَاوِيَةَ سَأَلَ زَيْدَ بْنَ أَرْقَمَ أَشَهِدْتَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِيدَيْنِ قَالَ نَعَمْ صَلَّى الْعِيدَ مِنْ أَوَّلِ النَّهَارِ ثُمَّ رَخَّصَ فِي الْجُمُعَةِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami ['Abdurrahman bin Mahdi] dia berkata; telah menceritakan kepada kami [Israil] dari ['Utsman bin Al Mughirah] dari [Iyas bin Abu Ramlah] dia berkata; aku mendengar Mu'awiyah bertanya kepada [Zaid bin Arqam], 'Apakah engkau pernah mengerjakan sholat dua hari raya bersama Rasulullah shallallahu 'alaihi wasallam? ' la menjawab, `Ya, beliau shallallahu 'alaihi wasallam mengerjakan sholat hari raya pada permulaan slang (pagi hari), lalu beliau memberi rukhsah kewajiban jumat (boleh melakukannya, boleh juga tidak) '.\" "
            },
            {
                "number": 1542,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ قَالَ حَدَّثَنِي وَهْبُ بْنُ كَيْسَانَ قَالَاجْتَمَعَ عِيدَانِ عَلَى عَهْدِ ابْنِ الزُّبَيْرِ فَأَخَّرَ الْخُرُوجَ حَتَّى تَعَالَى النَّهَارُ ثُمَّ خَرَجَ فَخَطَبَ فَأَطَالَ الْخُطْبَةَ ثُمَّ نَزَلَ فَصَلَّى وَلَمْ يُصَلِّ لِلنَّاسِ يَوْمَئِذٍ الْجُمُعَةَ فَذُكِرَ ذَلِكَ لِابْنِ عَبَّاسٍ فَقَالَ أَصَابَ السُّنَّةَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami ['Abdul Hamid bin Ja'far] dia berkata; telah menceritakan kepadaku [Wahb bin Kaisan] dia berkata; \"Pada masa Ibnu Zubair, pernah terjadi dua hari raya (hari raya & Jum'at) dalam satu hari. Ibnu Zubair mengakhirkan keluar untuk sholat 'Id agak siang, lalu ia keluar dan menyampaikan khutbah dengan khutbah yang lama. Kemudian ia turun dan mengerjakan sholat. Pada hari itu ia tidak mengerjakan sholat Jum'at bersama manusia. Hal tersebut diceritakan kepada [Ibnu Abbas], dan dia mengatakan bahwa Ibnu Zubair sudah melakukan sesuai dengan Sunnah.\""
            },
            {
                "number": 1543,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَعِنْدَهَا جَارِيَتَانِ تَضْرِبَانِ بِدُفَّيْنِ فَانْتَهَرَهُمَا أَبُو بَكْرٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعْهُنَّ فَإِنَّ لِكُلِّ قَوْمٍ عِيدًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dia berkata; telah menceritakan kepada kami [Muhammad Ja'far] dari [Ma'mar] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] dia berkata; \"Bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam masuk ke tempatnya dan di sisinya ada dua anak perempuan yang sedang menabuh dua rebana, maka Abu Bakar membentak kedua budak tadi'. Lalu Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: 'Biarkan saja mereka, sesungguhnya bagi tiap-tiap kaum mempunyai hari raya.'"
            },
            {
                "number": 1544,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ آدَمَ عَنْ عَبْدَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْجَاءَ السُّودَانُ يَلْعَبُونَ بَيْنَ يَدَيْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي يَوْمِ عِيدٍ فَدَعَانِي فَكُنْتُ أَطَّلِعُ إِلَيْهِمْ مِنْ فَوْقِ عَاتِقِهِ فَمَا زِلْتُ أَنْظُرُ إِلَيْهِمْ حَتَّى كُنْتُ أَنَا الَّتِي انْصَرَفْتُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Adam] dari ['Abdah] dari [Hisyam] dari [bapaknya] dari ['Aisyah] dia berkata; \"Beberapa orang hitam datang lalu bermain di depan Rasulullah Shalallahu 'Alaihi Wa Sallam pada hari raya. Beliau lalu memanggilku, dan saat itu aku melihat dari atas pundak beliau. Aku terus melihat mereka sampai akhirnya aku pergi meninggalkan mereka."
            },
            {
                "number": 1545,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ قَالَ حَدَّثَنَا الْوَلِيدُ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتُرُنِي بِرِدَائِهِ وَأَنَا أَنْظُرُ إِلَى الْحَبَشَةِ يَلْعَبُونَ فِي الْمَسْجِدِ حَتَّى أَكُونَ أَنَا أَسْأَمُ فَاقْدُرُوا قَدْرَ الْجَارِيَةِ الْحَدِيثَةِ السِّنِّ الْحَرِيصَةِ عَلَى اللَّهْوِ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Khasyram] dia berkata; telah menceritakan kepada kami [Al Walid] dia berkata; telah menceritakan kepada kami [Al Auza'i] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] dia berkata; \"Aku pernah melihat Rasulullah Shalallahu 'Alaihi Wa Sallam menutupiku dengan serbannya, dan aku melihat orang-orang Habasyah bermain di masjid, hingga aku merasa bosan. Maka, lihatlah dan jagalah dua anak perempuan kecil yang senang bermain.\""
            },
            {
                "number": 1546,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مُوسَى قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَدَخَلَ عُمَرُ وَالْحَبَشَةُ يَلْعَبُونَ فِي الْمَسْجِدِ فَزَجَرَهُمْ عُمَرُ رَضِيَ اللَّهُ عَنْهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعْهُمْ يَا عُمَرُ فَإِنَّمَا هُمْ بَنُو أَرْفِدَةَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Musa] dia berkata; telah menceritakan kepada kami [Al Walid bin Muslim] dia berkata; telah menceritakan kepada kami [Al Auza'i] dia berkata; telah menceritakan kepadaku [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] dia berkata; \"Umar masuk dan orang-orang Habasyah sedang bermain-main di masjid, maka Umar Radliallahu? nhum menghardiknya. Rasulullah Shalallahu 'Alaihi Wa Sallam kemudian bersabda: 'Biarkanlah mereka wahai Umar! Mereka hanyalah Bani Arfidah'.\""
            },
            {
                "number": 1547,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ أَنَّهُ حَدَّثَهُ أَنَّ عَائِشَةَ حَدَّثَتْهُأَنَّ أَبَا بَكْرٍ الصِّدِّيقَ دَخَلَ عَلَيْهَا وَعِنْدَهَا جَارِيَتَانِ تَضْرِبَانِ بِالدُّفِّ وَتُغَنِّيَانِ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسَجًّى بِثَوْبِهِ وَقَالَ مَرَّةً أُخْرَى مُتَسَجٍّ ثَوْبَهُ فَكَشَفَ عَنْ وَجْهِهِ فَقَالَ دَعْهُمَا يَا أَبَا بَكْرٍ إِنَّهَا أَيَّامُ عِيدٍ وَهُنَّ أَيَّامُ مِنًى وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ بِالْمَدِينَةِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Hafsh bin 'Abdullah] dia berkata; [bapakku] telah menceritakan kepadaku, dia berkata; telah menceritakan kepada kami [Ibrahim bin Thahman] dari [Malik bin Anas] dari [Az Zuhri] dari ['Urwah] bahwa ia menceritakan kepadanya, ['Aisyah] telah menceritakan kepadanya, Abu Bakr Ash Shiddiq masuk kepadanya dan di sisinya ada dua anak perempuan kecil yang sedang menabuh rebana sambil bernyanyi, sedangkan Rasulullah Shalallahu 'Alaihi Wa Sallam dalam keadaan berselimut dengan bajunya -dalam lafazh lain; menutup diri dengan bajunya-lalu beliau menyingkap wajahnya dan bersabda; 'Biarkanlah mereka wahai Abu Bakr! Sesungguhnya ini adalah hari raya yang juga merupakan hari-hari Mina.' Saat itu Rasulullah Shalallahu 'Alaihi Wa Sallam berada di Madinah."
            },
            {
                "number": 1548,
                "arab": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ قَالَ حَدَّثَنَا جُوَيْرِيَةُ بْنُ أَسْمَاءَ عَنْ الْوَلِيدِ بْنِ أَبِي هِشَامٍ عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلُّوا فِي بُيُوتِكُمْ وَلَا تَتَّخِذُوهَا قُبُورًا",
                "id": "Telah mengabarkan kepada kami [Al 'Abbas bin 'Abdul 'Azhim] dia berkata; telah menceritakan kepada kami ['Abdullah bin Muhammad bin Asma'] dia berkata; telah menceritakan kepada kami [Juwairiyah bin Asma'] dari [Al Walid bin Abu Hisyam] dari [Nafi'] bahwasanya ['Abdullah bin 'Umar] berkata; \"Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: `sholatlah kalian (sholat sunah) di rumah-rumah kalian dan janganlah kalian menjadikan rumah-rumah kalian seperti kuburan'.\""
            },
            {
                "number": 1549,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ سَمِعْتُ مُوسَى بْنَ عُقْبَةَ قَالَ سَمِعْتُ أَبَا النَّضْرِ يُحَدِّثُ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْدِ بْنِ ثَابِتٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اتَّخَذَ حُجْرَةً فِي الْمَسْجِدِ مِنْ حَصِيرٍ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا لَيَالِيَ حَتَّى اجْتَمَعَ إِلَيْهِ النَّاسُ ثُمَّ فَقَدُوا صَوْتَهُ لَيْلَةً فَظَنُّوا أَنَّهُ نَائِمٌ فَجَعَلَ بَعْضُهُمْ يَتَنَحْنَحُ لِيَخْرُجَ إِلَيْهِمْ فَقَالَ مَا زَالَ بِكُمْ الَّذِي رَأَيْتُ مِنْ صُنْعِكُمْ حَتَّى خَشِيتُ أَنْ يُكْتَبَ عَلَيْكُمْ وَلَوْ كُتِبَ عَلَيْكُمْ مَا قُمْتُمْ بِهِ فَصَلُّوا أَيُّهَا النَّاسُ فِي بُيُوتِكُمْ فَإِنَّ أَفْضَلَ صَلَاةِ الْمَرْءِ فِي بَيْتِهِ إِلَّا الصَّلَاةَ الْمَكْتُوبَةَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] dia berkata; telah menceritakan kepada kami ['Affan bin Muslim] dia berkata; telah menceritakan kepada kami [Wuhaib] dia berkata; Aku mendengar [Musa bin 'Uqbah] berkata; aku mendengar [Abu An Nadhr] menceritakan dari [Busr bin Sa'id] dari [Zaid bin Tsabit] bahwa Nabi Shalallahu 'Alaihi Wa Sallam membuat ruangan khusus dari tikar di dalam masjid. Beliau sholat malam di dalamnya hingga orang-orang berkumpul kepadanya, kemudian suaranya tak terdengar selama semalam, maka orang-orang pun mengira bahwa beliau tertidur, maka sebagian mereka berdehem-dehem supaya beliau keluar. Kemudian Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Aku senantiasa melihat perbuatan kalian hingga aku khawatir hal itu akan diwajibkan kepada kalian. Kalau sampai diwajibkan kepada kalian, maka kalian tidak mampu melakukannya. Wahai manusia, sholatlah di rumah-rumah kalian. Sesungguhnva sholat seseorang yang paling utama adalah di rumahnya, kecuali sholat wajib.\""
            },
            {
                "number": 1550,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ أَنْبَأَنَا إِبْرَاهِيمُ بْنُ أَبِي الْوَزِيرِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْفِطْرِيُّ عَنْ سَعْدِ بْنِ إِسْحَقَ بْنِ كَعْبِ بْنِ عُجْرَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْمَغْرِبِ فِي مَسْجِدِ بَنِي عَبْدِ الْأَشْهَلِ فَلَمَّا صَلَّى قَامَ نَاسٌ يَتَنَفَّلُونَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْكُمْ بِهَذِهِ الصَّلَاةِ فِي الْبُيُوتِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah memberitakan kepada kami [Ibrahim bin Abul Wazir] dia berkata; telah menceritakan kepada kami [Muhammad bin Musa Al fitri] dari [Sa'd bin Ishaq bin Ka'b bin 'Ujrah] dari [bapaknya] dari [kakeknya], dia berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam melaksanakan sholat maghrib di masjid Bani Abdul Asyhal, ketika beliau selesai sholat, para sahabat mulai sholat sunnah, kemudian Nabi Shalallahu 'Alaihi Wa Sallam bersabda: \"Hendaknya kalian melaksanakan sholat ini dirumah.\""
            },
            {
                "number": 1551,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ زُرَارَةَ عَنْ سَعْدِ بْنِ هِشَامٍأَنَّهُ لَقِيَ ابْنَ عَبَّاسٍ فَسَأَلَهُ عَنْ الْوَتْرِ فَقَالَ أَلَا أُنَبِّئُكَ بِأَعْلَمِ أَهْلِ الْأَرْضِ بِوَتْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ قَالَ عَائِشَةُ ائْتِهَا فَسَلْهَا ثُمَّ ارْجِعْ إِلَيَّ فَأَخْبِرْنِي بِرَدِّهَا عَلَيْكَ فَأَتَيْتُ عَلَى حَكِيمِ بْنِ أَفْلَحَ فَاسْتَلْحَقْتُهُ إِلَيْهَا فَقَالَ مَا أَنَا بِقَارِبِهَا إِنِّي نَهَيْتُهَا أَنْ تَقُولَ فِي هَاتَيْنِ الشِّيعَتَيْنِ شَيْئًا فَأَبَتْ فِيهَا إِلَّا مُضِيًّا فَأَقْسَمْتُ عَلَيْهِ فَجَاءَ مَعِي فَدَخَلَ عَلَيْهَا فَقَالَتْ لِحَكِيمٍ مَنْ هَذَا مَعَكَ قُلْتُ سَعْدُ بْنُ هِشَامٍ قَالَتْ مَنْ هِشَامٌ قُلْتُ ابْنُ عَامِرٍ فَتَرَحَّمَتْ عَلَيْهِ وَقَالَتْ نِعْمَ الْمَرْءُ كَانَ عَامِرًا قَالَ يَا أُمَّ الْمُؤْمِنِينَ أَنْبِئِينِي عَنْ خُلُقِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ أَلَيْسَ تَقْرَأُ الْقُرْآنَ قَالَ قُلْتُ بَلَى قَالَتْ فَإِنَّ خُلُقَ نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقُرْآنُ فَهَمَمْتُ أَنْ أَقُومَ فَبَدَا لِي قِيَامُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا أُمَّ الْمُؤْمِنِينَ أَنْبِئِينِي عَنْ قِيَامِ نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ أَلَيْسَ تَقْرَأُ هَذِهِ السُّورَةَ يَا أَيُّهَا الْمُزَّمِّلُ قُلْتُ بَلَى قَالَتْ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ افْتَرَضَ قِيَامَ اللَّيْلِ فِي أَوَّلِ هَذِهِ السُّورَةِ فَقَامَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابُهُ حَوْلًا حَتَّى انْتَفَخَتْ أَقْدَامُهُمْ وَأَمْسَكَ اللَّهُ عَزَّ وَجَلَّ خَاتِمَتَهَا اثْنَيْ عَشَرَ شَهْرًا ثُمَّ أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ التَّخْفِيفَ فِي آخِرِ هَذِهِ السُّورَةِ فَصَارَ قِيَامُ اللَّيْلِ تَطَوُّعًا بَعْدَ أَنْ كَانَ فَرِيضَةً فَهَمَمْتُ أَنْ أَقُومَ فَبَدَا لِي وَتْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا أُمَّ الْمُؤْمِنِينَ أَنْبِئِينِي عَنْ وَتْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ كُنَّا نُعِدُّ لَهُ سِوَاكَهُ وَطَهُورَهُ فَيَبْعَثُهُ اللَّهُ عَزَّ وَجَلَّ لِمَا شَاءَ أَنْ يَبْعَثَهُ مِنْ اللَّيْلِ فَيَتَسَوَّكُ وَيَتَوَضَّأُ وَيُصَلِّي ثَمَانِيَ رَكَعَاتٍ لَا يَجْلِسُ فِيهِنَّ إِلَّا عِنْدَ الثَّامِنَةِ يَجْلِسُ فَيَذْكُرُ اللَّهَ عَزَّ وَجَلَّ وَيَدْعُو ثُمَّ يُسَلِّمُ تَسْلِيمًا يُسْمِعُنَا ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ بَعْدَ مَا يُسَلِّمُ ثُمَّ يُصَلِّي رَكْعَةً فَتِلْكَ إِحْدَى عَشْرَةَ رَكْعَةً يَا بُنَيَّ فَلَمَّا أَسَنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَخَذَ اللَّحْمَ أَوْتَرَ بِسَبْعٍ وَصَلَّى رَكْعَتَيْنِ وَهُوَ جَالِسٌ بَعْدَ مَا سَلَّمَ فَتِلْكَ تِسْعُ رَكَعَاتٍ يَا بُنَيَّ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى صَلَاةً أَحَبَّ أَنْ يَدُومَ عَلَيْهَا وَكَانَ إِذَا شَغَلَهُ عَنْ قِيَامِ اللَّيْلِ نَوْمٌ أَوْ مَرَضٌ أَوْ وَجَعٌ صَلَّى مِنْ النَّهَارِ اثْنَتَيْ عَشْرَةَ رَكْعَةً وَلَا أَعْلَمُ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ الْقُرْآنَ كُلَّهُ فِي لَيْلَةٍ وَلَا قَامَ لَيْلَةً كَامِلَةً حَتَّى الصَّبَاحَ وَلَا صَامَ شَهْرًا كَامِلًا غَيْرَ رَمَضَانَفَأَتَيْتُ ابْنَ عَبَّاسٍ فَحَدَّثْتُهُ بِحَدِيثِهَا فَقَالَ صَدَقَتْ أَمَا إِنِّي لَوْ كُنْتُ أَدْخُلُ عَلَيْهَا لَأَتَيْتُهَا حَتَّى تُشَافِهَنِي مُشَافَهَةً قَالَ أَبُو عَبْد الرَّحْمَنِ كَذَا وَقَعَ فِي كِتَابِي وَلَا أَدْرِي مِمَّنْ الْخَطَأُ فِي مَوْضِعِ وَتْرِهِ عَلَيْهِ السَّلَامُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sa'id] dari [Qatadah] dari [Zurarah] dari [Sa'ad bin Hisyam] bahwa dia pernah berjumpa dengan lbnu Abbas, dia bertanya kepadanya tentang sholat witir. Lalu ia menjawab; \"Maukah kamu aku beri tahu penghuni bumi yang paling mengetahui tentang sholat witir Rasulullah Shalallahu 'Alaihi Wa Sallam?\" Dia menjawab; \"Ya, mau.\" lbnu Abbas berkata; \"Dia adalah [Aisyah]. Datangi dan tanyakanlah hal itu kepadanya, dan kembalilah kepadaku untuk memberitahukan jawabannya kepadaku.\" Kemudian dia (Hisyam) datang kepada Hakim bin Aflah untuk meminta menemaninya datang kepada Aisyah. Lalu ia menjawab, 'Aku bukan tak mau mendekatinya. Aku pernah melarangnya untuk berbicara sesuatu tentang dua kelompok yang bertengkar, namun ia menolaknya, ia terus saja melakukan!\" Lalu ia (Hisyam) bersumpah kepadanya, dan akhirnya dia mau datang kepada Aisyah bersamanya. Lalu ia masuk ke tempat Aisyah. Kemudian Aisyah bertanya kepada Hakim, \"Siapa yang bersamamu?\" la menjawab; \"Sa'ad bin Hisyam.\" la bertanya lagi, \" Hisyam yang mana?\" la menjawab; \"Anaknya Amir.\" Lalu ia mendoakan baginya dan berkata, \"Sebaik-baik lelaki adalah`Amir!\" Hakim bertanya, \"Wahai Ummul Mukminin, kabarkanlah kepadaku tentang akhlak Rasulullah Shalallahu 'Alaihi Wa Sallam?\" Aisyah menjawab, \"Bukankah kamu membaca Al Qur'an?\" Hakim menjawab, \"Ya.\" Aisyah lalu berkata, \"Akhlak Nabi Allah Shalallahu 'Alaihi Wa Sallam adalah Al Qur'an.\" Aku ingin berdiri (pamit pulang), namun timbul keinginan untuk mengetahui cara Rasulullah Shalallahu 'Alaihi Wa Sallam melakukan sholat malam, maka ia bertanya lagi, \"Wahai Ummul Mukminin! Kabarkanlah kepadaku tentang sholat malam Rasulullah Shalallahu 'Alaihi Wa Sallam?\" Aisyah menjawab; \"Bukankah kamu membaca surah Al Muzammil?\" Hakim menjawab, \"Ya.\" Aisyah berkata; \"Allah Azza wa Jalla mewajibkan sholat malam pada permulaan surah ini, lalu Rasulullah bersama para sahabatnya menegakkan sholat malam dengan sekuat tenaga sampai telapak kaki mereka membengkak. Kemudian Allah Azza wa Jalla menahannya -yang ujungnya dua belas bulan- lalu menurunkan keringanannya pada akhir surah ini (Al Muzammil), sehingga sholat malam yang semula hukumnya wajib menjadi sunnah.\" Aku ingin berdiri, namun aku juga ingin mengetahui sholat witir Rasulullah Shalallahu 'Alaihi Wa Sallam, maka aku bertanya; \"Wahai Ummul Mukminin! Kabarkanlah kepadaku tentang sholat witir Rasulullah Shalallahu 'Alaihi Wa Sallam?\" Aisyah menerangkan, \"Kami mempersiapkan siwak dan air wudlunya, lalu Allah Azza wa Jalla membangunkannya sekehendakNya pada malam hari, kemudian beliau bersiwak dan berwudlu lalu mengerjakan sholat delapan rakaat tanpa ada duduk, kecuali pada rakaat kedelapan. Beliau berdzikir kepada Allah Azza wa Jalla dan berdoa kepada-Nya, lalu mengucapkan salam dengan salam yang terdengar oleh kami. Kemudian beliau sholat dua rakaat sambil duduk- setelah salam, dan sholat lagi satu rakaat, sehingga berjumlah sebelas rakaat. Wahai anakku, setelah Rasulullah Shalallahu 'Alaihi Wa Sallam mencapai umur senja dan mulai gemuk, beliau mengerjakan witir tujuh rakaat, lalu sholat dua rakaat sambil duduk setelah salam, sehingga semuanya menjadi sembilan rakaat. Wahai anakku, bila Rasulullah Shalallahu 'Alaihi Wa Sallam mengerjakan suatu sholat, maka beliau senang untuk melakukannya secara terus-menerus. Bila beliau berhalangan untuk sholat malam karena ketiduran atau sakit, maka beliau mengerjakan sholat dua belas rakaat pada siang harinya. Aku tidak mengetahui bahwa Nabi Allah pernah membaca Al Qur'an seluruhnya dalam satu malam. Aku juga tidak mengetahui bahwa beliau sholat malam secara sempurna hingga pagi, dan aku pun tidak mengetahui bahwa beliau berpuasa satu bulan penuh selain pada bulan ramadhan.\" Lalu ia (Hisyam) datang kepada Ibnu Abbas dan menceritakan hal tersebut kepadanya. Dia mengomentarinya dengan berkata; \"Beliau (Aisyah) benar. Seandainya aku yang masuk (datang) kepadanya pasti aku akan menemuinya sehingga dia (Aisyah) berbicara langsung kepadaku.\" Abu Abdurrahman berkata, \"Begitulah yang tertera dalam kitabku! Aku tidak mengetahui ini kesalahan siapa, dalam posisi witir beliau shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 1552,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Ibnu Syihab] dari [Humaid bin 'Abdurrahman] dari [Abu Hurairah], bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Barangsiapa sholat (malam) pada bulan Ramadhan karena iman dan mengharap pahala, maka dosa-dosanya yang telah lalu akan diampuni.\""
            },
            {
                "number": 1553,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ أَبُو بَكْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ قَالَ حَدَّثَنَا جُوَيْرِيَةُ عَنْ مَالِكٍ قَالَ قَالَ الزُّهْرِيُّ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Isma'il Abu Bakr] dia berkata; telah menceritakan kepada kami ['Abdullah bin Muhammad bin Asma'] dia berkata; telah menceritakan kepada kami [Juwairiyah] dari [Malik] dia berkata; berkata [Az Zuhri]; telah mengabarkan kepadaku [Abu Salamah bin 'Abdurrahman] dan [Humaid bin 'Abdurrahman] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa sholat (malam) pada bulan Ramadhan karena iman dan mengharap pahala, maka dosa-dosanya yang telah lalu akan diampuni.\""
            },
            {
                "number": 1554,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي الْمَسْجِدِ ذَاتَ لَيْلَةٍ وَصَلَّى بِصَلَاتِهِ نَاسٌ ثُمَّ صَلَّى مِنْ الْقَابِلَةِ وَكَثُرَ النَّاسُ ثُمَّ اجْتَمَعُوا مِنْ اللَّيْلَةِ الثَّالِثَةِ أَوْ الرَّابِعَةِ فَلَمْ يَخْرُجْ إِلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا أَصْبَحَ قَالَ قَدْ رَأَيْتُ الَّذِي صَنَعْتُمْ فَلَمْ يَمْنَعْنِي مِنْ الْخُرُوجِ إِلَيْكُمْ إِلَّا أَنِّي خَشِيتُ أَنْ يُفْرَضَ عَلَيْكُمْ وَذَلِكَ فِي رَمَضَانَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Ibnu Syihab] dari ['Urwah] dari ['Aisyah], bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam pada suatu malam mengerjakan sholat di masjid, dan orang-orang pun ikut sholat dengan beliau. Kemudian besoknya Rasulullah sholat lagi dan orang-orang yang ikut pun bertambah banyak. Lalu orang-orang berkumpul pada malam yang ketiga -atau keempat- namun beliau tidak keluar kepada mereka. Pada pagi harinya beliau bersabda: \"Aku telah mengetahui apa yang kalian perbuat. Tidak ada yang menghalangiku untuk keluar kepada kalian melainkan aku khawatir hal tersebut akan diwajibkan kepada kalian.\" Dan hal itu terjadi pada bulan Ramadhan."
            },
            {
                "number": 1555,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ الْفُضَيْلِ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِي ذَرٍّ قَالَصُمْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَمَضَانَ فَلَمْ يَقُمْ بِنَا حَتَّى بَقِيَ سَبْعٌ مِنْ الشَّهْرِ فَقَامَ بِنَا حَتَّى ذَهَبَ ثُلُثُ اللَّيْلِ ثُمَّ لَمْ يَقُمْ بِنَا فِي السَّادِسَةِ فَقَامَ بِنَا فِي الْخَامِسَةِ حَتَّى ذَهَبَ شَطْرُ اللَّيْلِ فَقُلْتُ يَا رَسُولَ اللَّهِ لَوْ نَفَّلْتَنَا بَقِيَّةَ لَيْلَتِنَا هَذِهِ قَالَ إِنَّهُ مَنْ قَامَ مَعَ الْإِمَامِ حَتَّى يَنْصَرِفَ كَتَبَ اللَّهُ لَهُ قِيَامَ لَيْلَةٍ ثُمَّ لَمْ يُصَلِّ بِنَا وَلَمْ يَقُمْ حَتَّى بَقِيَ ثَلَاثٌ مِنْ الشَّهْرِ فَقَامَ بِنَا فِي الثَّالِثَةِ وَجَمَعَ أَهْلَهُ وَنِسَاءَهُ حَتَّى تَخَوَّفْنَا أَنْ يَفُوتَنَا الْفَلَاحُقُلْتُ وَمَا الْفَلَاحُ قَالَ السُّحُورُ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dia berkata; telah menceritakan kepada kami [Muhammad bin Al Fudhail] dari [Dawud bin Abu Hind] dari [Al Walid bin 'Abdurrahman] dari [Jubair bin Nufair] dari [Abu Dzarr] dia berkata; \"Kami puasa ramadhan bersama Rasulullah Shalallahu 'Alaihi Wa Sallam, dan beliau tidak bangun (sholat malam) bersama kami hingga tinggal tujuh hari dari bulan ramadhan. Lalu beliau bangun bersama kami hingga lewat sepertiga malam, kemudian pada malam keenam menjelang akhir Ramadhan beliau tidak bangun (malam)! Maka setelah malam kelima, beliau bangun bersama kami hingga hampir lewat separuh malam. Kami berkata kepada beliau, 'Wahai Rasulullah, bagaimana jika engkau sholat sunnah bersama kami malam ini? ' Beliau menjawab: 'Jika seseorang sholat bersama imam hingga usai, maka Allah menuliskan baginya pahala menegakkan sholat malam'. Kemudian beliau tidak bangun (guna sholat malam) bersama kami. Ketika bulan (Ramadhan) tinggal tiga hari lagi, beliau bangun untuk sholat malam bersama kami, lalu mengumpulkan keluarga dan para istrinya hingga kami khawatir kehilangan Al Falah ini.\" Aku lalu bertanya; \"Apakah (Al Falah) itu?\" Ia menjawab; \"Waktu sahur\"."
            },
            {
                "number": 1556,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ أَخْبَرَنِي مُعَاوِيَةُ بْنُ صَالِحٍ قَالَ حَدَّثَنِي نُعَيْمُ بْنُ زِيَادٍ أَبُو طَلْحَةَ قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ عَلَى مِنْبَرِ حِمْصَيَقُولُ قُمْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شَهْرِ رَمَضَانَ لَيْلَةَ ثَلَاثٍ وَعِشْرِينَ إِلَى ثُلُثِ اللَّيْلِ الْأَوَّلِ ثُمَّ قُمْنَا مَعَهُ لَيْلَةَ خَمْسٍ وَعِشْرِينَ إِلَى نِصْفِ اللَّيْلِ ثُمَّ قُمْنَا مَعَهُ لَيْلَةَ سَبْعٍ وَعِشْرِينَ حَتَّى ظَنَنَّا أَنْ لَا نُدْرِكَ الْفَلَاحَ وَكَانُوا يُسَمُّونَهُ السُّحُورَ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] dia berkata; telah menceritakan kepada kami [Zaid bin Al Hubab] dia berkata; telah mengabarkan kepadaku [Mu'awiyah bin Shalih] dia berkata; telah menceritakan kepadaku [Nu'aim bin Ziyad Abu Thalhah] dia berkata; \"Aku mendengar [Nu'man bin Basyir] berkata di atas mimbar di daerah Himsh, 'Kami bangun untuk sholat malam bersama Rasulullah Shalallahu 'Alaihi Wa Sallam di bulan ramadhan pada malam dua puluh tiga sampai sepertiga malam pertama. Kemudian kami bangun (sholat malam) lagi bersama beliau pada malam kedua puluh lima sampai pertengahan malam. Kemudian kami bangun (sholat malam) lagi bersama beliau pada malam kedua puluh tujuh hingga kami mengira bahwa kami tidak mendapatkan kemenangan itu'. Mereka menamakan kemenangan (Al Falah) itu dengan sahur.\""
            },
            {
                "number": 1557,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا نَامَ أَحَدُكُمْ عَقَدَ الشَّيْطَانُ عَلَى رَأْسِهِ ثَلَاثَ عُقَدٍ يَضْرِبُ عَلَى كُلِّ عُقْدَةٍ لَيْلًا طَوِيلًا أَيْ ارْقُدْ فَإِنْ اسْتَيْقَظَ فَذَكَرَ اللَّهَ انْحَلَّتْ عُقْدَةٌ فَإِنْ تَوَضَّأَ انْحَلَّتْ عُقْدَةٌ أُخْرَى فَإِنْ صَلَّى انْحَلَّتْ الْعُقَدُ كُلُّهَا فَيُصْبِحُ طَيِّبَ النَّفْسِ نَشِيطًا وَإِلَّا أَصْبَحَ خَبِيثَ النَّفْسِ كَسْلَانَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Yazid] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dia berkata; bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Apabila salah seorang dari kalian tidur, maka syethan mengikat tiga ikatan di atas kepalanya; tiap ikatan (buhul) diikat dengan kata, 'Malam masih panjang' yakni tidurlah. Jika ia bangun lalu berdzikir kepada Allah, maka lepaslah satu ikatan. Jika ia berwudhu, maka lepaslah ikatan lainnya, dan jika ia mengerjakan sholat maka lepaslah semua ikatannya, sehingga pada pagi harinya ia berjiwa lapang dan bersemangat. Sedangkan jika ia tidak melakukan hal tersebut (bangun, berwudhu, dan sholat malam), maka pada pagi harinya jiwanya akan buruk dan malas.\""
            },
            {
                "number": 1558,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَذُكِرَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ نَامَ لَيْلَةً حَتَّى أَصْبَحَ قَالَ ذَاكَ رَجُلٌ بَالَ الشَّيْطَانُ فِي أُذُنَيْهِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Jarir] dari [Manshur] dari [Abu Wa'il] dari ['Abdullah] dia berkata; Diceritakan kepada Rasulullah Shalallahu 'Alaihi Wa Sallam bahwa ada seorang lelaki yang tidur semalaman hingga pagi, maka beliau bersabda: \"Syaithan telah mengencingi kedua telinga laki-laki itu.\""
            },
            {
                "number": 1559,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ قَالَ حَدَّثَنَا مَنْصُورٌ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِأَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ إِنَّ فُلَانًا نَامَ عَنْ الصَّلَاةِ الْبَارِحَةَ حَتَّى أَصْبَحَ قَالَ ذَاكَ شَيْطَانٌ بَالَ فِي أُذُنَيْهِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami ['Abdul 'Aziz bin 'Abdush Shamad] dia berkata; telah menceritakan kepada kami [Manshur] dari [Abu Wa'il] dari ['Abdullah] Bahwa seorang laki-laki berkata; \"Wahai Rasulullah, tadi malam si Fulan tidur hingga pagi dan meninggalkan sholat. Beliau Shalallahu 'Alaihi Wa Sallam bersabda: Syaithan telah mengencingi kedua telinga orang itu."
            },
            {
                "number": 1560,
                "arab": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا يَحْيَى عَنْ ابْنِ عَجْلَانَ قَالَ حَدَّثَنِي الْقَعْقَاعُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَحِمَ اللَّهُ رَجُلًا قَامَ مِنْ اللَّيْلِ فَصَلَّى ثُمَّ أَيْقَظَ امْرَأَتَهُ فَصَلَّتْ فَإِنْ أَبَتْ نَضَحَ فِي وَجْهِهَا الْمَاءَ وَرَحِمَ اللَّهُ امْرَأَةً قَامَتْ مِنْ اللَّيْلِ فَصَلَّتْ ثُمَّ أَيْقَظَتْ زَوْجَهَا فَصَلَّى فَإِنْ أَبَى نَضَحَتْ فِي وَجْهِهِ الْمَاءَ",
                "id": "Telah mengabarkan kepada kami [Ya'qub bin Ibrahim] dia berkata; telah menceritakan kepada kami [Yahya] dari [Ibnu 'Ajlan] dia berkata; telah menceritakan kepadaku [Al Qa'qa'] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Allah merahmati seorang pemuda yang bangun untuk sholat dimalam hari, lalu ia membangunkan istrinya untuk sholat, jika ia enggan maka ia memercikkan air diwajahnya, dan Allah merahmati seorang istri yang bangun untuk sholat dimalam hari lalu ia membangunkan suaminya untuk sholat, jika ia enggan maka ia memercikkan air kewajahnya.\""
            },
            {
                "number": 1561,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ حُسَيْنٍ أَنَّ الْحُسَيْنَ بْنَ عَلِيٍّ حَدَّثَهُ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَرَقَهُ وَفَاطِمَةَ فَقَالَ أَلَا تُصَلُّونَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا أَنْفُسُنَا بِيَدِ اللَّهِ فَإِذَا شَاءَ أَنْ يَبْعَثَهَا بَعَثَهَا فَانْصَرَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ قُلْتُ لَهُ ذَلِكَ ثُمَّ سَمِعْتُهُ وَهُوَ مُدْبِرٌ يَضْرِبُ فَخِذَهُ وَيَقُولُ{ وَكَانَ الْإِنْسَانُ أَكْثَرَ شَيْءٍ جَدَلًا }",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Az Zuhri] dari ['Ali bin Husain] bahwasanya [Al Husain bin 'Ali] menceritakan kepadanya dari ['Ali bin Abu Thalib], bahwa Nabi Shalallahu 'Alaihi Wa Sallam pernah mendatangi dia dan Fatimah pada malam hari, lalu beliau bersabda: \"Tidakkah kalian sholat (malam)?\" Aku menjawab; `'Wahai Rasulullah, jiwa-jiwa kami ada di tangan Allah, jadi jika Dia hendak membangunkannya maka Dia akan membangunkannya.\" Kemudian beliau pergi ketika kuucapkan hal itu, dan aku mendengar beliau pergi sambil memukul pahanya dan bergumam dengan membaca ayat, 'Dan manusia adalah makhluk yang paling banyak membantah.\" (Qs. AI Kahfi (18): 54) "
            },
            {
                "number": 1562,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ قَالَ حَدَّثَنَا عَمِّي قَالَ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ قَالَ حَدَّثَنِي حَكِيمُ بْنُ حَكِيمِ بْنِ عَبَّادِ بْنِ حُنَيْفٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمِ بْنِ شِهَابٍ عَنْ عَلِيِّ بْنِ حُسَيْنٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى فَاطِمَةَ مِنْ اللَّيْلِ فَأَيْقَظَنَا لِلصَّلَاةِ ثُمَّ رَجَعَ إِلَى بَيْتِهِ فَصَلَّى هَوِيًّا مِنْ اللَّيْلِ فَلَمْ يَسْمَعْ لَنَا حِسًّا فَرَجَعَ إِلَيْنَا فَأَيْقَظَنَا فَقَالَ قُومَا فَصَلِّيَا قَالَ فَجَلَسْتُ وَأَنَا أَعْرُكُ عَيْنِي وَأَقُولُ إِنَّا وَاللَّهِ مَا نُصَلِّي إِلَّا مَا كَتَبَ اللَّهُ لَنَا إِنَّمَا أَنْفُسُنَا بِيَدِ اللَّهِ فَإِنْ شَاءَ أَنْ يَبْعَثَنَا بَعَثَنَا قَالَ فَوَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَقُولُ وَيَضْرِبُ بِيَدِهِ عَلَى فَخِذِهِ مَا نُصَلِّي إِلَّا مَا كَتَبَ اللَّهُ لَنَا{ وَكَانَ الْإِنْسَانُ أَكْثَرَ شَيْءٍ جَدَلًا }",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'd bin Ibrahim bin Sa'd] dia berkata; [pamanku] telah menceritakan kepada kami, dia berkata; [bapakku] telah menceritakan kepada kami dari [Ibnu Ishaq] dia berkata; telah menceritakan kepadaku [Hakim bin Hakim bin 'Abbad bin Hunaif] dari [Muhammad bin Muslim bin Syihab] dari ['Ali bin Husain] dari [bapaknya] dari kakeknya yaitu ['Ali bin Abu Thalib] dia berkata; Nabi Shalallahu 'Alaihi Wa Sallam pernah mendatangi dirinya dan Fatimah pada malam hari, lalu beliau bersabda: \"Tidakkah kalian sholat (malam) '?\" Aku menjawab, \"Wahai Rasulullah, jiwa-jiwa kami ada di tangan Allah, jadi jika Dia hendak membangunkannya maka Dia akan membangunkannya.\" Kemudian beliau pergi ketika kuucapkan hal itu, dan aku mendengar beliau pergi sambil memukul pahanya dan bergumam dengan membaca ayat, \"Dan manusia adalah makhluk yang paling banyak membantah.\" (Qs. AI Kahfi (18): 54)."
            },
            {
                "number": 1563,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ هُوَ ابْنُ عَوْفٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ الصِّيَامِ بَعْدَ شَهْرِ رَمَضَانَ شَهْرُ اللَّهِ الْمُحَرَّمُ وَأَفْضَلُ الصَّلَاةِ بَعْدَ الْفَرِيضَةِ صَلَاةُ اللَّيْلِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dia berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Humaid bin 'Abdurrahman bin 'Auf] dari [Abu Hurairah] dia berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Puasa yang paling utama setelah puasa ramadhan adalah puasa di bulan Muharram, dan sholat yang paling utama setelah sholat wajib adalah sholat malam.\""
            },
            {
                "number": 1564,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ جَعْفَرِ بْنِ أَبِي وَحْشِيَّةَ أَنَّهُ سَمِعَ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ الصَّلَاةِ بَعْدَ الْفَرِيضَةِ قِيَامُ اللَّيْلِ وَأَفْضَلُ الصِّيَامِ بَعْدَ رَمَضَانَ الْمُحَرَّمُأَرْسَلَهُ شُعْبَةُ بْنُ الْحَجَّاجِ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Abu Bisyr Ja'far bin Abu Wahsyiyyah] bahwasanya ia mendengar [Humaid bin 'Abdurrahman] berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"sholat yang paling utama setelah sholat wajib adalah sholat malam, dan puasa yang paling utama setelah puasa ramadhan adalah puasa Muharram.\" Hadist ini dimursalkan oleh Syu'bah bin Hajaj."
            },
            {
                "number": 1565,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ قَالَ سَمِعْتُ رِبْعِيًّا عَنْ زَيْدِ بْنِ ظَبْيَانَ رَفَعَهُ إِلَى أَبِي ذَرٍّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ثَلَاثَةٌ يُحِبُّهُمْ اللَّهُ عَزَّ وَجَلَّ رَجُلٌ أَتَى قَوْمًا فَسَأَلَهُمْ بِاللَّهِ وَلَمْ يَسْأَلْهُمْ بِقَرَابَةٍ بَيْنَهُ وَبَيْنَهُمْ فَمَنَعُوهُ فَتَخَلَّفَهُمْ رَجُلٌ بِأَعْقَابِهِمْ فَأَعْطَاهُ سِرًّا لَا يَعْلَمُ بِعَطِيَّتِهِ إِلَّا اللَّهُ عَزَّ وَجَلَّ وَالَّذِي أَعْطَاهُ وَقَوْمٌ سَارُوا لَيْلَتَهُمْ حَتَّى إِذَا كَانَ النَّوْمُ أَحَبَّ إِلَيْهِمْ مِمَّا يُعْدَلُ بِهِ نَزَلُوا فَوَضَعُوا رُءُوسَهُمْ فَقَامَ يَتَمَلَّقُنِي وَيَتْلُو آيَاتِي وَرَجُلٌ كَانَ فِي سَرِيَّةٍ فَلَقُوا الْعَدُوَّ فَانْهَزَمُوا فَأَقْبَلَ بِصَدْرِهِ حَتَّى يُقْتَلَ أَوْ يُفْتَحَ لَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Muhammad] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Manshur] dia berkata; aku mendengar [Rib'iyy] dari [Zaid bin Zhabyan] -dan dia merafa'kannya sampai [Abu Dzarr] -; Ada tiga orang yang Allah mencintai mereka 1). Seseorang yang mendatangi rombongan dan meminta mereka dengan menyebut nama Allah, ia meminta rombongan itu padahal tidak ada hubungan kekerabatan, namun mereka tidak mau memberi. Lantas ada salah seorang dari rombongan itu melambatkan diri. Dengan menyembunyikan rahasia, orang tadi lantas memberi si peminta, sehingga tidak seorang pun mengetahui pemberiannya selain Allah dan orang pun tidak tahu apa yang diberikannya 2). Sebuah rombongan yang berjalan di malam hari, hingga saat waktu tidur lebih mereka cintai daripada yang lain, mereka singgah dan mereka letakkan kepala mereka, namun ada seseorang yang justru mencari keutamaan dengan merendahkan diri kepada-Ku dan membaca ayat-ayat-Ku 3). Seseorang yang mengikuti ekspedisi militer, rombongan pasukannya menyerang musuh lantas mereka terpukul mundur, namun dalam kondisi ini, ia justru menghadang musuh hingga terbunuh atau mendapat kemenangan."
            },
            {
                "number": 1566,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ الْبَصْرِيُّ عَنْ بِشْرٍ هُوَ ابْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَشْعَثَ بْنِ سُلَيْمٍ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ قَالَ قُلْتُ لِعَائِشَةَأَيُّ الْأَعْمَالِ أَحَبُّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ الدَّائِمُ قُلْتُ فَأَيُّ اللَّيْلِ كَانَ يَقُومُ قَالَتْ إِذَا سَمِعَ الصَّارِخَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Ibrahim Al Bashri] dari [Bisyr bin Al Mufadldlal] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Asy'ats bin Muslim] dari [bapaknya] dari [Masruq] dia berkata; Aku berkata kepada ['Aisyah] 'Amalan apakah yang paling disukai Rasulullah Shalallahu 'Alaihi Wa Sallam? ' la menjawab; `Yang terus menerus (dilakukan) '. Aku bertanya lagi; 'Kapan (waktu) Rasulullah bangun untuk sholat malam? ' Ia menjawab; `Bila mendengar ayam berkokok'.\""
            },
            {
                "number": 1567,
                "arab": "أَخْبَرَنَا عِصْمَةُ بْنُ الْفَضْلِ قَالَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ قَالَ حَدَّثَنَا الْأَزْهَرُ بْنُ سَعِيدٍ عَنْ عَاصِمِ بْنِ حُمَيْدٍ قَالَسَأَلْتُ عَائِشَةَ بِمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَفْتِحُ قِيَامَ اللَّيْلِ قَالَتْ لَقَدْ سَأَلْتَنِي عَنْ شَيْءٍ مَا سَأَلَنِي عَنْهُ أَحَدٌ قَبْلَكَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَبِّرُ عَشْرًا وَيَحْمَدُ عَشْرًا وَيُسَبِّحُ عَشْرًا وَيُهَلِّلُ عَشْرًا وَيَسْتَغْفِرُ عَشْرًا وَيَقُولُ اللَّهُمَّ اغْفِرْ لِي وَاهْدِنِي وَارْزُقْنِي وَعَافِنِي أَعُوذُ بِاللَّهِ مِنْ ضِيقِ الْمَقَامِ يَوْمَ الْقِيَامَةِ",
                "id": "Telah mengabarkan kepada kami ['Ishmah bin Al Fadhl] dia berkata; telah menceritakan kepada kami [Zaid bin Al Hubab] dari [Mu'awiyah bin Shalih] dia berkata; telah menceritakan kepada kami [Al Azhar bin Sa'id] dari ['Ashim bin Humaid] dia berkata; Aku bertanya kepada ['Aisyah], \"Bagaimana Rasulullah memulai sholat malam?\" Aisyah berkata; \"Engkau telah bertanya tentang sesuatu yang tidak pernah ditanyakan oleh seorang pun sebelumnya. Rasulullah Shalallahu 'Alaihi Wa Sallam bertakbir sepuluh kali, bertahmid sepuluh kali, bertasbih sepuluh kali, bertahlil sepuluh kali, dan beristighfar (memohon ampunan) sepuluh kali. Lalu beliau mengucapkan doa: 'Ya Allah, ampunilah aku, berilah aku petunjuk, berilah aku rezeki dan kesehatan. Aku berlindung kepada-Mu dari sempitnya tempat pada hari Kiamat nanti'.\""
            },
            {
                "number": 1568,
                "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ عَنْ مَعْمَرٍ وَالْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ رَبِيعَةَ بْنِ كَعْبٍ الْأَسْلَمِيِّ قَالَكُنْتُ أَبِيتُ عِنْدَ حُجْرَةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكُنْتُ أَسْمَعُهُ إِذَا قَامَ مِنْ اللَّيْلِ يَقُولُ سُبْحَانَ اللَّهِ رَبِّ الْعَالَمِينَ الْهَوِيَّ ثُمَّ يَقُولُ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ الْهَوِيَّ",
                "id": "Telah mengabarkan kepada kami [Suwaid bin Nashr] dia berkata; telah memberitakan kepada kami ['Abdullah] dari [Ma'mar] dan [Al Auza'i] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Rabi'ah bin Ka'b Al Aslami] dia berkata; \"Aku pernah menginap di kamar Nabi Shalallahu 'Alaihi Wa Sallam, sehingga bila beliau bangun malam kami mendengarnya. Beliau mengucapkan: `Subhanallahi rabbil 'alamin (Maha Suci Allah, Tuhan semesta alam) ' beberapa lama, kemudian mengucapkan: `Subhanallahi wa bihamdih (Maha Suci Allah dan segala puji bagi-Nya) ' juga beberapa lama.\""
            },
            {
                "number": 1569,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَحْوَلِ يَعْنِي سُلَيْمَانَ بْنَ أَبِي مُسْلِمٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ مِنْ اللَّيْلِ يَتَهَجَّدُ قَالَ اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ أَنْتَ قَيَّامُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ أَنْتَ مَلِكُ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ وَلَكَ الْحَمْدُ أَنْتَ حَقٌّ وَوَعْدُكَ حَقٌّ وَالْجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ وَالسَّاعَةُ حَقٌّ وَالنَّبِيُّونَ حَقٌّ وَمُحَمَّدٌ حَقٌّ لَكَ أَسْلَمْتُ وَعَلَيْكَ تَوَكَّلْتُ وَبِكَ آمَنْتُ ثُمَّ ذَكَرَ قُتَيْبَةُ كَلِمَةً مَعْنَاهَا وَبِكَ خَاصَمْتُ وَإِلَيْكَ حَاكَمْتُ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَعْلَنْتُ أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Al Ahwal Sulaiman bin Abu Muslim] dari [Thawus] dari [Ibnu 'Abbas] dia berkata; \"Apabila Rasulullah Shalallahu 'Alaihi Wa Sallam bangun malam, maka beliau mengerjakan sholat tahajjud. Beliau mengucapkan: 'Ya Allah, segala puji bagi-Mu. Engkaulah (pemberi) cahaya langit dan bumi serta penghuninya. Segala puji bagi-Mu, Engkau pengatur langit dan bumi serta penghuninya. Segala puji bagi-Mu, Engkaulah penguasa langit dan bumi serta penghuninya. Segala puji bagi-Mu, Engkau benar, dan janji-Mu benar, surga itu benar, neraka itu benar, hari Kiamat itu benar, para nabi itu benar, dan Muhammad itu benar. Kepada-Mulah aku memasrahkan diri dan kepada Engkau aku bertawakal. Kepada Engkaulah aku beriman. Kemudian Qutaibah menyebutkan kalimat yang artinya, 'kepada Engkaulah aku mengadu, dan kepada Engkaulah aku berhukum. Ampunilah dosa-dosaku yang telah lalu dan yang akan datang serta yang terang-terangan. Engkaulah Yang paling dahulu dan Engkaulah yang paling Akhir. Tiada Tuhan (yang berhak disembah) kecuali Engkau, tiada daya dan kekuatan kecuali dengan (pertolongan) Allah'.\""
            },
            {
                "number": 1570,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ عَنْ مَالِكٍ قَالَ حَدَّثَنِي مَخْرَمَةُ بْنُ سُلَيْمَانَ عَنْ كُرَيْبٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ أَخْبَرَهُأَنَّهُ بَاتَ عِنْدَ مَيْمُونَةَ أُمِّ الْمُؤْمِنِينَ وَهِيَ خَالَتُهُ فَاضْطَجَعَ فِي عَرْضِ الْوِسَادَةِ وَاضْطَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَهْلُهُ فِي طُولِهَا فَنَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا انْتَصَفَ اللَّيْلُ أَوْ قَبْلَهُ قَلِيلًا أَوْ بَعْدَهُ قَلِيلًا اسْتَيْقَظَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَلَسَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ بِيَدِهِ ثُمَّ قَرَأَ الْعَشْرَ الْآيَاتِ الْخَوَاتِيمَ مِنْ سُورَةِ آلِ عِمْرَانَ ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقَةٍ فَتَوَضَّأَ مِنْهَا فَأَحْسَنَ وُضُوءَهُ ثُمَّ قَامَ يُصَلِّي قَالَ عَبْدُ اللَّهِ بْنُ عَبَّاسٍ فَقُمْتُ فَصَنَعْتُ مِثْلَ مَا صَنَعَ ثُمَّ ذَهَبْتُ فَقُمْتُ إِلَى جَنْبِهِ فَوَضَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ الْيُمْنَى عَلَى رَأْسِي وَأَخَذَ بِأُذُنِي الْيُمْنَى يَفْتِلُهَا فَصَلَّى رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ رَكْعَتَيْنِ ثُمَّ أَوْتَرَ ثُمَّ اضْطَجَعَ حَتَّى جَاءَهُ الْمُؤَذِّنُ فَصَلَّى رَكْعَتَيْنِ خَفِيفَتَيْنِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah memberitakan kepada kami [Ibnul Qasim] dari [Malik] dia berkata; telah menceritakan kepadaku [Makhramah bin Sulaiman] dari [Kuraib] bahwasanya ['Abdullah bin 'Abbas] mengabarkan kepadanya, bahwa dia pernah bermalam di rumah bibinya Maimunah (istri Nabi shallallahu 'alaihi wasallam), lalu dia berbaring di atas bantal, sementara Rasulullah shallallahu 'alaihi wasallam dan keluarganya berbaring di (tikar) yang panjang. Nabi shallallahu 'alaihi wasallam tidur hingga tengah malam -sebelum atau sesudahnya sedikit-, Rasulullah shallallahu 'alaihi wasallam bangun, terus duduk dan mengusap mukanya dengan tangan, lalu membaca sepuluh ayat terakhir surah Ali Imran. Setelah itu beliau pergi ke bejana air yang tergantung, lalu berwudlu dengan air itu. Beliau memperbagus wudlunya, kemudian mengerjakan sholat. Abdullah bin Abbas berkata; 'Aku berdiri, lalu aku mengerjakan seperti apa yang dikerjakan beliau. Kemudian aku pergi ke samping beliau, beliau memegang kepalaku dengan tangan kanannya seraya menyentil telingaku. Setelah itu beliau sholat dua raka'at, lalu dua raka'at, dua raka'at, dua raka'at, lalu dua raka'at, dan dua raka'at lagi. Kemudian mengerjakan sholat witir. Setelah itu beliau berbaring, sampai datang muadzin, lalu berdiri mengerjakan sholat dua raka'at yang ringan."
            },
            {
                "number": 1571,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ الْمُثَنَّى عَنْ عَبْدِ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ وَالْأَعْمَشِ وَحُصَيْنٍ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَامَ مِنْ اللَّيْلِ يَشُوصُ فَاهُ بِالسِّوَاكِ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dan [Muhammad bin Al Mutsanna] dari ['Abdurrahman] dari [Sufyan] dari [Manshur] dan [Al A'masy] dan [Hushain] dari [Abu Wa'il] dari [Hudzaifah] bahwa Nabi Shalallahu 'Alaihi Wa Sallam apabila bangun untuk sholat malam beliau menggosok mulutnya dengan siwak.'"
            },
            {
                "number": 1572,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا خَالِدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ حُصَيْنٍ قَالَ سَمِعْتُ أَبَا وَائِلٍ يُحَدِّثُ عَنْ حُذَيْفَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ مِنْ اللَّيْلِ يَشُوصُ فَاهُ بِالسِّوَاكِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Khalid] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Hushain] dia berkata; Aku mendengar [Abu Wa'il] menceritakan dari [Hudzaifah] dia berkata; Nabi Shalallahu 'Alaihi Wa Sallam apabila bangun untuk sholat malam, beliau menggosok mulutnya dengan siwak.'"
            },
            {
                "number": 1573,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ عَنْ إِسْحَقَ بْنِ سُلَيْمَانَ عَنْ أَبِي سِنَانٍ عَنْ أَبِي حَصِينٍ عَنْ شَقِيقٍ عَنْ حُذَيْفَةَ قَالَكُنَّا نُؤْمَرُ بِالسِّوَاكِ إِذَا قُمْنَا مِنْ اللَّيْلِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dari [Ishaq bin Sulaiman] dari [Abu Sinan] dari [Abu Hashin] dari [Syaqiq] dari [Hudzafah] dia berkata; \"Apabila kami bangun untuk sholat malam, kami diperintahkan untuk bersiwak.\""
            },
            {
                "number": 1574,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ قَالَ أَنْبَأَنَا إِسْرَائِيلُ عَنْ أَبِي حَصِينٍ عَنْ شَقِيقٍ قَالَكُنَّا نُؤْمَرُ إِذَا قُمْنَا مِنْ اللَّيْلِ أَنْ نَشُوصَ أَفْوَاهَنَا بِالسِّوَاكِ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] dia berkata; telah menceritakan kepada kami ['ubaidhullah] dia berkata; telah memberitakan kepada kami [Israil] dari [Abu Hashin] dari [Syaqiq] dia berkata; \"Kami diperintahkan menggosok mulut kami dengan siwak bila hendak sholat malam.\""
            },
            {
                "number": 1575,
                "arab": "أَخْبَرَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ قَالَ أَنْبَأَنَا عُمَرُ بْنُ يُونُسَ قَالَ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ قَالَسَأَلْتُ عَائِشَةَ بِأَيِّ شَيْءٍ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْتَتِحُ صَلَاتَهُ قَالَتْ كَانَ إِذَا قَامَ مِنْ اللَّيْلِ افْتَتَحَ صَلَاتَهُ قَالَ اللَّهُمَّ رَبَّ جِبْرِيلَ وَمِيكَائِيلَ وَإِسْرَافِيلَ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ اللَّهُمَّ اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنْ الْحَقِّ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ",
                "id": "Telah mengabarkan kepada kami [Al 'Abbas bin 'Abdul 'Azhim] dia berkata; telah memberitakan kepada kami ['Umar bin Yunus] dia berkata; telah menceritakan kepada kami ['Ikrimah bin 'Ammar] dia berkata; telah menceritakan kepadaku [Yahya bin Abu Katsir] dia berkata; telah menceritakan kepadaku [Abu Salamah bin 'Abdurrahman] dia berkata; \"Aku pernah bertanya kepada [Aisyah]; `Dengan apa Rasulullah Shalallahu 'Alaihi Wa Sallam memulai sholat malam? ' la menjawab; `Apabila bangun malam maka beliau memulai sholat dengan mengucapkan doa: `Ya Allah, Tuhan Jibril, Mikail, dan Israfil, Sang pencipta langit dan bumi, Maha mengetahui hal-hal yang gaib dan yang nampak, Engkau menghukumi di antara hamba-hambaMu dalam perselisihan mereka. Ya Allah, tunjukilah aku kepada kebenaran yang banyak diperselisihkan. Sesungguhnya Engkau memberi petunjuk kepada siapa saja yang Engkau kehendaki menuju jalan yang benar'."
            },
            {
                "number": 1576,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقُلْتُ وَأَنَا فِي سَفَرٍ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاللَّهِ لَأَرْقُبَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِصَلَاةٍ حَتَّى أَرَى فِعْلَهُ فَلَمَّا صَلَّى صَلَاةَ الْعِشَاءِ وَهِيَ الْعَتَمَةُ اضْطَجَعَ هَوِيًّا مِنْ اللَّيْلِ ثُمَّ اسْتَيْقَظَ فَنَظَرَ فِي الْأُفُقِ فَقَالَ{ رَبَّنَا مَا خَلَقْتَ هَذَا بَاطِلًا حَتَّى بَلَغَ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ }ثُمَّ أَهْوَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى فِرَاشِهِ فَاسْتَلَّ مِنْهُ سِوَاكًا ثُمَّ أَفْرَغَ فِي قَدَحٍ مِنْ إِدَاوَةٍ عِنْدَهُ مَاءً فَاسْتَنَّ ثُمَّ قَامَ فَصَلَّى حَتَّى قُلْتُ قَدْ صَلَّى قَدْرَ مَا نَامَ ثُمَّ اضْطَجَعَ حَتَّى قُلْتُ قَدْ نَامَ قَدْرَ مَا صَلَّى ثُمَّ اسْتَيْقَظَ فَفَعَلَ كَمَا فَعَلَ أَوَّلَ مَرَّةٍ وَقَالَ مِثْلَ مَا قَالَ فَفَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَ مَرَّاتٍ قَبْلَ الْفَجْرِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah memberitakan kepada kami [Ibnu Wahb] dari [Yunus] dari [Ibnu Syihab] dia berkata; telah menceritakan kepadaku [Humaid bin 'Abdurrahman bin 'Auf] bahwa [seseorang dari shahabat] Nabi Shalallahu 'Alaihi Wa Sallam berkata; \"Aku pernah berkata -ketika aku dalam suatu perjalanan bersama Rasulullah shallallahu 'alaihi wasallam- `Demi Allah, aku akan mengawasi sholat Rasulullah shallallahu 'alaihi wasallam hingga aku bisa melihat -cara sholat beliau. Setelah Rasulullah mengerjakan sholat lsya' -yakni sholat 'Atamah beliau berbaring beberapa lama pada malam itu, kemudian bangun lalu memandang ke ufuk (langit), sambil membaca ayat: 'Ya Tuhan kami, tidaklah Engkau menciptakan hal ini dengan sia-sia...hingga ayat, 'Sesungguhnva engkau tidak mengingkari janji\" (Qs. Ali `lmraan (3): 191-194). Kemudian beliau menjulurkan tangannya ke kasur lalu mengeluarkan siwak. lalu beliau menuangkan air dari ember yang ada padanya, kemudian bersiwak. Selanjutnya beliau berdiri dan mengerjakan sholat. Sampai aku berkata; `Beliau mengerjakan sholat seukuran tidurnya'. Kemudian berbaring hingga aku berkata, 'Beliau tidur seukuran sholatnva'. Kemudian beliau bangun lalu mengerjakan seperti yang dikerjakan pada pertama kali, lalu bersabda seperti yang beliau sabdakan sebelumnya. Rasulullah Shalallahu 'Alaihi Wa Sallam mengerjakan hal tersebut tiga kali sebelum terbit Fajar."
            },
            {
                "number": 1577,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا يَزِيدُ قَالَ أَنْبَأَنَا حُمَيْدٌ عَنْ أَنَسٍ قَالَمَا كُنَّا نَشَاءُ أَنْ نَرَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي اللَّيْلِ مُصَلِّيًا إِلَّا رَأَيْنَاهُ وَلَا نَشَاءُ أَنْ نَرَاهُ نَائِمًا إِلَّا رَأَيْنَاهُ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [Yazid] dia berkata; telah memberitakan kepada kami [Humaid] dari [Anas] dia berkata; \"Tidaklah kami berkehendak untuk melihat Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat melainkan pasti kami bisa melihatnya. Dan tidaklah kami berkehendak untuk melihat Rasulullah tidur melainkan kami pasti bisa melihatnya.\""
            },
            {
                "number": 1578,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ عَنْ أَبِيهِ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ أَنَّ يَعْلَى بْنَ مَمْلَكٍ أَخْبَرَهُأَنَّهُ سَأَلَ أُمَّ سَلَمَةَ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ كَانَ يُصَلِّي الْعَتَمَةَ ثُمَّ يُسَبِّحُ ثُمَّ يُصَلِّي بَعْدَهَا مَا شَاءَ اللَّهُ مِنْ اللَّيْلِ ثُمَّ يَنْصَرِفُ فَيَرْقُدُ مِثْلَ مَا صَلَّى ثُمَّ يَسْتَيْقِظُ مِنْ نَوْمِهِ ذَلِكَ فَيُصَلِّي مِثْلَ مَا نَامَ وَصَلَاتُهُ تِلْكَ الْآخِرَةُ تَكُونُ إِلَى الصُّبْحِ",
                "id": "Telah mengabarkan kepada kami [Harun bin 'Abdullah] dia berkata; telah menceritakan kepada kami [Hajjaj] dia berkata; berkata [Ibnu Juraij] dari [bapaknya], telah mengabarkan kepadaku [Ibnu Abu Mulaikah] bahwasanya [Ya'la bin Mamlak] mengabarkan kepadanya bahwasanya ia bertanya kepada [Ummu Salamah] tentang sholat Nabi Shalallahu 'Alaihi Wa Sallam, maka ia menjawab; \"Beliau Shalallahu 'Alaihi Wa Sallaw sholat isya' kemudian bertasbih. Setelah itu beliau sholat lagi sebagaimana yang dikehendaki-Nya di waktu malam, lalu beliau pulang dan tidur yang lamanya sebagaimana beliau sholat. Kemudian beliau bangun kembali dan sholat yang lamanya sebagaimana beliau tidur tadi. sholat ini adalah sholat malam beliau yang terakhir hingga subuh.\""
            },
            {
                "number": 1579,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ عَنْ يَعْلَى بْنِ مَمْلَكٍأَنَّهُ سَأَلَ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قِرَاءَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَنْ صَلَاتِهِ فَقَالَتْ مَا لَكُمْ وَصَلَاتَهُ كَانَ يُصَلِّي ثُمَّ يَنَامُ قَدْرَ مَا صَلَّى ثُمَّ يُصَلِّي قَدْرَ مَا نَامَ ثُمَّ يَنَامُ قَدْرَ مَا صَلَّى حَتَّى يُصْبِحَ ثُمَّ نَعَتَتْ لَهُ قِرَاءَتَهُ فَإِذَا هِيَ تَنْعَتُ قِرَاءَةً مُفَسَّرَةً حَرْفًا حَرْفًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari ['Abdullah bin 'ubaidhullah bin Abu Mulaikah] dari [Ya'la bin Mamlak] bahwasanya ia bertanya kepada [Ummu Salamah] -istri Nabi Shalallahu 'Alaihi Wa Sallam- tentang bacaan dan sholat beliau Shalallahu 'Alaihi Wa Sallam. Maka Ummu Salamah menjawab; 'Ada apa dengan sholat Rasulullah Shalallahu 'Alaihi Wa Sallam? Beliau sholat, kemudian tidur yang lamanya sebagaimana sholatnya. Lalu beliau beliau sholat lagi seukuran tidurnya tadi, kemudian tidur lagi seukuran sholatnya hingga shubuh. Ummu Salamah juga menyifati bacaan Nabi Shalallahu 'Alaihi Wa Sallam, ia menyifatinya dengan bacaan yang bisa terdengar dengan jelas huruf demi huruf.\""
            },
            {
                "number": 1580,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَمْرِو بْنِ أَوْسٍ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَبُّ الصِّيَامِ إِلَى اللَّهِ عَزَّ وَجَلَّ صِيَامُ دَاوُدَ عَلَيْهِ السَّلَام كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا وَأَحَبُّ الصَّلَاةِ إِلَى اللَّهِ صَلَاةُ دَاوُدَ كَانَ يَنَامُ نِصْفَ اللَّيْلِ وَيَقُومُ ثُلُثَهُ وَيَنَامُ سُدُسَهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Sufyan] dari ['Amr bin Dinar] dari ['Amru bin Aus] bahwasanya ia mendengar ['Abdullah bin 'Amru bin Al 'Ash] berkata; Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Puasa yang paling dicintai Allah Azza wa Jalla adalah puasa Nabi Daud? laihis Salam, beliau berpuasa sehari dan berbuka sehari. sholat yang paling dicintai Allah Azza wa Jalla adalah sholat Nabi Daud, beliau tidur separuh malam lalu bangun (untuk sholat) pada sepertiganya, lalu tidur lagi pada seperenamnya.\""
            },
            {
                "number": 1581,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ حَرْبٍ قَالَ حَدَّثَنَا مُعَاذُ بْنُ خَالِدٍ قَالَ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتَيْتُ لَيْلَةَ أُسْرِيَ بِي عَلَى مُوسَى عَلَيْهِ السَّلَام عِنْدَ الْكَثِيبِ الْأَحْمَرِ وَهُوَ قَائِمٌ يُصَلِّي فِي قَبْرِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Ali bin Harb] dia berkata; telah menceritakan kepada kami [Mu'adz bin Khalid] dia berkata; telah memberitakan kepada kami [Hammad bin Salamah] dari [Sulaiman At Taimi] dari [Tsabit] dari [Anas bin Malik]. Nabi Shalallahu 'Alaihi Wa Sallam bersabda: \"Pada malam Isra Mi'raj aku datang kepada Musa 'Alaihi Salam di bukit pasir merah, dan dia sedang sholat di dalam kuburannya.\""
            },
            {
                "number": 1582,
                "arab": "أَخْبَرَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ سُلَيْمَانَ التَّيْمِيِّ وَثَابِتٍ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتَيْتُ عَلَى مُوسَى عَلَيْهِ السَّلَام عِنْدَ الْكَثِيبِ الْأَحْمَرِ وَهُوَ قَائِمٌ يُصَلِّيقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا أَوْلَى بِالصَّوَابِ عِنْدَنَا مِنْ حَدِيثِ مُعَاذِ بْنِ خَالِدٍ وَاللَّهُ تَعَالَى أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami [Al 'Abbas bin Muhammad] dia berkata; telah menceritakan kepada kami [Yunus bin Muhammad] dia berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Sulaiman At Taimi] dan [Tsabit] dari [Anas] Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Aku datang kepada Musa 'Alaihis Salam di bukit pasir merah, dan dia sedang sholat.\" Abu Abdurrahman berkata; 'Menurut kami Hadist ini lebih shahih dari pada Hadits Mu'adz bin Khalid. Wallahu Ta'ala A'lam."
            },
            {
                "number": 1583,
                "arab": "أَخْبَرَنِي أَحْمَدُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا حَبَّانُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ أَنْبَأَنَا ثَابِتٌ وَسُلَيْمَانُ التَّيْمِيُّ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَرَرْتُ عَلَى قَبْرِ مُوسَى عَلَيْهِ السَّلَام وَهُوَ يُصَلِّي فِي قَبْرِهِ",
                "id": "Telah mengabarkan kepadaku [Ahmad bin Sa'id] dia berkata; telah menceritakan kepada kami [Habban] dia berkata; telah menceritakan kepada kami [Hammad bin Salamah] dia berkata; telah memberitakan kepada kami [Tsabit] dan [Sulaiman At Taimi] dari [Anas] bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam bersabda: \"Aku pernah melewati kuburan Nabi Musa Alaihis Salam, dan dia sedang sholat di kuburannya.\""
            },
            {
                "number": 1584,
                "arab": "أَخْبَرَنَا عَلِيُّ بْنُ خَشْرَمٍ قَالَ حَدَّثَنَا عِيسَى عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَرْتُ لَيْلَةَ أُسْرِيَ بِي عَلَى مُوسَى عَلَيْهِ السَّلَام وَهُوَ يُصَلِّي فِي قَبْرِهِ",
                "id": "Telah mengabarkan kepada kami ['Ali bin Khasyram] dia berkata; telah menceritakan kepada kami ['Isa] dari [Sulaiman At Taimi] dari [Anas bin Malik] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku melewati Musa Alaihis Salam, pada malam aku diisra'kan (diperjalankan) dan dia sedang sholat di kuburannya.\""
            },
            {
                "number": 1585,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا مُعْتَمِرٌ عَنْ أَبِيهِ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ أُسْرِيَ بِهِ مَرَّ عَلَى مُوسَى عَلَيْهِ السَّلَام وَهُوَ يُصَلِّي فِي قَبْرِهِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdul A'la] dia berkata; telah menceritakan kepada kami [Mu'tamir] dari [Bapaknya] dari [Anas] bahwa Rasulullah Shalallahu 'Alaihi Wa Sallam saat malam diisra'kan melewati Musa? laihis Salam, dan dia sedang sholat di kuburannya.\""
            },
            {
                "number": 1586,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ وَإِسْمَعِيلُ بْنُ مَسْعُودٍ قَالَا حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ أَبِي قَالَ سَمِعْتُ أَنَسًا يَقُولُ أَخْبَرَنِي بَعْضُ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةَ أُسْرِيَ بِهِ مَرَّ عَلَى مُوسَى عَلَيْهِ السَّلَام وَهُوَ يُصَلِّي فِي قَبْرِهِ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Habib bin 'Arabi] dan [Isma'il bin Mas'ud], mereka berdua berkata; telah menceritakan kepada kami [Mu'tamir] dia berkata; Aku mendengar [bapakku] berkata; Aku mendengar [Anas] berkata; telah mengabarkan kepadaku [sebagian sahabat] Nabi shallallahu 'alaihi wasallam bahwa ketika Nabi shallallahu 'alaihi wasallam diisra'kan beliau melewati Musa? laihis Salam, dan dia sedang sholat di kuburannya.\""
            },
            {
                "number": 1587,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سُلَيْمَانَ عَنْ أَنَسٍ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْلَةَ أُسْرِيَ بِي مَرَرْتُ عَلَى مُوسَى وَهُوَ يُصَلِّي فِي قَبْرِهِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Sulaiman] dari [Anas] dari [sebagian Sahabat Nabi shallallahu 'alaihi wasallam] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Pada saat malam diisra'kan aku melewati Musa? laihis Salam, dan dia sedang sholat di kuburannya.\""
            },
            {
                "number": 1588,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرٍ قَالَ حَدَّثَنَا أَبِي وَبَقِيَّةُ قَالَا حَدَّثَنَا ابْنُ أَبِي حَمْزَةَ قَالَ حَدَّثَنِي الزُّهْرِيُّ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابِ بْنِ الْأَرَتِّ عَنْ أَبِيهِ وَكَانَ قَدْ شَهِدَ بَدْرًا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهُ رَاقَبَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّيْلَةَ كُلَّهَا حَتَّى كَانَ مَعَ الْفَجْرِ فَلَمَّا سَلَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ صَلَاتِهِ جَاءَهُ خَبَّابٌ فَقَالَ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي لَقَدْ صَلَّيْتَ اللَّيْلَةَ صَلَاةً مَا رَأَيْتُكَ صَلَّيْتَ نَحْوَهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَجَلْ إِنَّهَا صَلَاةُ رَغَبٍ وَرَهَبٍ سَأَلْتُ رَبِّي عَزَّ وَجَلَّ فِيهَا ثَلَاثَ خِصَالٍ فَأَعْطَانِي اثْنَتَيْنِ وَمَنَعَنِي وَاحِدَةً سَأَلْتُ رَبِّي عَزَّ وَجَلَّ أَنْ لَا يُهْلِكَنَا بِمَا أَهْلَكَ بِهِ الْأُمَمَ قَبْلَنَا فَأَعْطَانِيهَا وَسَأَلْتُ رَبِّي عَزَّ وَجَلَّ أَنْ لَا يُظْهِرَ عَلَيْنَا عَدُوًّا مِنْ غَيْرِنَا فَأَعْطَانِيهَا وَسَأَلْتُ رَبِّي أَنْ لَا يَلْبِسَنَا شِيَعًا فَمَنَعَنِيهَا",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Utsman bin Sa'id bin Katsir] dia berkata; [bapakku] dan [Baqiyyah] telah menceritakan kepada kami, mereka berkata; telah menceritakan kepada kami [Ibnu Abu Hamzah] dia berkata; telah menceritakan kepadaku [Az Zuhri] dia berkata; telah mengabarkan kepadaku ['ubaidhullah bin 'Abdullah bin Al Harits bin Naufal] dari ['Abdullah bin Khabbab bin Al Arat] dari [Bapaknya] -seorang peserta perang badr bersama Rasulullah shallallahu 'alaihi wasallam- bahwa dia pernah memperhatikan cara sholat Rasulullah shallallahu 'alaihi wasallam pada semua waktu malamnya hingga Fajar. Setelah Rasulullah selesai sholat, Khabbab datang kepada beliau, lalu berkata; \"Wahai Rasulullah shallallahu 'alaihi wasallam, bapak ibuku jadi jaminan, engkau telah mengerjakan sholat yang belum pernah aku lihat engkau mengerjakan sebelumnya!\" Rasulullah shallallahu 'alaihi wasallampun menjawab: \"Ya, itu adalah sholat yang penuh perasaan antara harap dan khawatir. Aku meminta kepada Rabbku tiga perkara, Dia memberiku dua perkara dan yang satu Dia menolaknya. Aku meminta kepada Rabbku Azza wa Jalla agar tidak membinasakan kita dengan bencana yang telah menyebabkan binasanya umat-umat sebelum kita, dan Allah memberikannya kepadaku. Aku juga meminta kepada Raabku Azza wa Jalla agar tidak menjadikan musuh menguasai (menang) atas kita, dan Dia juga memberikannya. Aku juga meminta agar Dia tidak mencerai beraikan kita sehingga terpisah-pisah menjadi beberapa kelompok (yang saling bertentangan), tetapi Dia tidak memberikannya.\""
            },
            {
                "number": 1589,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي يَعْفُورٍ عَنْ مُسْلِمٍ عَنْ مَسْرُوقٍ قَالَ قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَاكَانَ إِذَا دَخَلَتْ الْعَشْرُ أَحْيَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّيْلَ وَأَيْقَظَ أَهْلَهُ وَشَدَّ الْمِئْزَرَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Yazid] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Abu Ya'fur] dari [Muslim] dari [Masruq] dia berkata; ['Aisyah] berkata; \"Bila telah masuk tanggal sepuluh (ramadhan) maka Rasulullah shallallahu 'alaihi wasallam menghidupkan malam. Beliau membangunkan keluarganya dan mengikat kainnya (menjauhi istri).\""
            },
            {
                "number": 1590,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا زُهَيْرٌ عَنْ أَبِي إِسْحَقَ قَالَ أَتَيْتُ الْأَسْوَدَ بْنَ يَزِيدَ وَكَانَ لِي أَخًا صَدِيقًافَقُلْتُ يَا أَبَا عَمْرٍو حَدِّثْنِي مَا حَدَّثَتْكَ بِهِ أُمُّ الْمُؤْمِنِينَ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَتْ كَانَ يَنَامُ أَوَّلَ اللَّيْلِ وَيُحْيِي آخِرَهُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin 'Abdullah bin Al Mubarak] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Zuhair] dari [Abu Ishaq] dia berkata; \"Aku datang kepada [Al Aswad bin Yazid] -dia adalah teman sekaligus saudara bagiku- lalu berkata; 'Wahai Abu Amru, ceritakan kepadaku apa yang telah diceritakan oleh [Aisyah] kepadamu tentang sholat Rasulullah shallallahu 'alaihi wasallam? ' la menjawab; 'Aisyah berkata; \"Rasulullah tidur pada awal malam dan menghidupkan akhir malam dengan ibadah.\""
            },
            {
                "number": 1591,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَقَ قَالَ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْلَا أَعْلَمُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ الْقُرْآنَ كُلَّهُ فِي لَيْلَةٍ وَلَا قَامَ لَيْلَةً حَتَّى الصَّبَاحَ وَلَا صَامَ شَهْرًا كَامِلًا قَطُّ غَيْرَ رَمَضَانَ",
                "id": "Telah mengabarkan kepada kami [Harun bin Ishaq] dia berkata; telah menceritakan kepada kami ['Abdah bin Sulaiman] dari [Sa'id] dari [Qatadah] dari [Zurarah bin Aufa] dari [Sa'ad bin Hisyam] dari ['Aisyah] Radliallahu? nha dia berkata; \"Aku tidak tahu bahwa Rasulullah shallallahu 'alaihi wasallam pernah membaca Al Qur'an seluruhnya dalam satu malam. Aku juga tidak tahu bahwa beliau sholat malam secara sempurna hingga pagi, dan aku pun tidak tahu bahwa beliau berpuasa satu bulan sempurna selain bulan ramadhan.\""
            },
            {
                "number": 1592,
                "arab": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ عَنْ يَحْيَى عَنْ هِشَامٍ قَالَ أَخْبَرَنِي أَبِي عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَعِنْدَهَا امْرَأَةٌ فَقَالَ مَنْ هَذِهِ قَالَتْ فُلَانَةُ لَا تَنَامُ فَذَكَرَتْ مِنْ صَلَاتِهَا فَقَالَ مَهْ عَلَيْكُمْ بِمَا تُطِيقُونَ فَوَاللَّهِ لَا يَمَلُّ اللَّهُ عَزَّ وَجَلَّ حَتَّى تَمَلُّوا وَلَكِنَّ أَحَبَّ الدِّينِ إِلَيْهِ مَا دَاوَمَ عَلَيْهِ صَاحِبُهُ",
                "id": "Telah mengabarkan kepada kami [Syu'aib bin Yusuf] dari [Yahya] dari [Hisyam] dia berkata; [bapakku] telah mengabarkan kepadaku dari ['Aisyah] bahwa Nabi shallallahu 'alaihi wasallam masuk ke tempatnya dan di sisinya ada seorang perempuan. lalu beliau berkata; \"Siapa ini\" \" Aisyah menjawab; \"Dia Fulanah, dia tidak tidur.\" Lalu Aisyah menceritakan tentang sholatnya. Rasulullah bersabda: \"Cukup, kalian seharusnya mengerjakan sholat semampunya. Demi Allah, Allah tidak pernah bosan hingga kalian yang bosan. Akan tetapi sebaik-baik agama (amalan) adalah yang dilakukan secara kontinyu oleh pelakunya.\""
            },
            {
                "number": 1593,
                "arab": "أَخْبَرَنَا عِمْرَانُ بْنُ مُوسَى عَنْ عَبْدِ الْوَارِثِ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْمَسْجِدَ فَرَأَى حَبْلًا مَمْدُودًا بَيْنَ سَارِيَتَيْنِ فَقَالَ مَا هَذَا الْحَبْلُ فَقَالُوا لِزَيْنَبَ تُصَلِّي فَإِذَا فَتَرَتْ تَعَلَّقَتْ بِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُلُّوهُ لِيُصَلِّ أَحَدُكُمْ نَشَاطَهُ فَإِذَا فَتَرَ فَلْيَقْعُدْ",
                "id": "Telah mengabarkan kepada kami ['Imran bin Musa] dari ['Abdul Warits] dia berkata; telah menceritakan kepada kami ['Abdul 'Aziz] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam masuk ke dalam masjid, dan beliau melihat seutas tali menjulur di antara dua tiang, maka beliau berkata: \"Tali apa ini?\" Mereka menjawab; \"Talinya Zainab. Bila ia letih ketika sedang sholat, maka ia berpegangan dengan tali itu.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Lepaskanlah tali itu. Hendaknva salah seorang dari kalian sholat pada saat segar, dan bila letih maka hendaknya ia duduk.\""
            },
            {
                "number": 1594,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ مَنْصُورٍ وَاللَّفْظُ لَهُ عَنْ سُفْيَانَ عَنْ زِيَادِ بْنِ عِلَاقَةَ قَالَ سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ يَقُولُقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى تَوَرَّمَتْ قَدَمَاهُ فَقِيلَ لَهُ قَدْ غَفَرَ اللَّهُ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ قَالَ أَفَلَا أَكُونُ عَبْدًا شَكُورًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] dan [Muhammad bin Manshur] -dan lafadz ini miliknya- dari [Sufyan] dari [Ziyad bin 'Ilaqah] dia berkata; Aku mendengar [Al Mughirah bin Syu'bah] berkata; \"Nabi shallallahu 'alaihi wasallam sholat malam hingga kedua kakinya bengkak, lalu dikatakan kepadanya, `Bukankah dosa-dosa engkau yang telah lewat dan yang akan datang telah diampuni! ' Beliau berkata: 'Apakah aku tidak boleh menjadi hamba yang bersyukur?\"'"
            },
            {
                "number": 1595,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا صَالِحُ بْنُ مِهْرَانَ وَكَانَ ثِقَةً قَالَ حَدَّثَنَا النُّعْمَانُ بْنُ عَبْدِ السَّلَامِ عَنْ سُفْيَانَ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي حَتَّى تَزْلَعَ يَعْنِي تَشَقَّقُ قَدَمَاهُ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Shalih bin Mihran] -dan dia adalah seorang yang tsiqah- dia berkata; telah menceritakan kepada kami [An Nu'man bin 'Abdus Salam] dari [Sufyan] dari ['Ashim bin Kulaib] dari [Bapaknya] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat hingga kedua kakinya pecah-pecah.\""
            },
            {
                "number": 1596,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ بُدَيْلٍ وَأَيُّوبُ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي لَيْلًا طَوِيلًا فَإِذَا صَلَّى قَائِمًا رَكَعَ قَائِمًا وَإِذَا صَلَّى قَاعِدًا رَكَعَ قَاعِدًا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Hammad] dari [Budail] dan [Ayyub] dari ['Abdullah bin Syaqiq] dari ['Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah sholat malam beberapa lama, dan jika beliau sholat (diawali) dengan berdiri maka beliau juga ruku' dengan berdiri, dan jika sholatnya (diawali) dengan duduk maka beliau juga ruku' dengan duduk.\""
            },
            {
                "number": 1597,
                "arab": "أَخْبَرَنَا عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ قَالَ أَنْبَأَنَا وَكِيعٌ قَالَ حَدَّثَنِي يَزِيدُ بْنُ إِبْرَاهِيمَ عَنْ ابْنِ سِيرِينَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي قَائِمًا وَقَاعِدًا فَإِذَا افْتَتَحَ الصَّلَاةَ قَائِمًا رَكَعَ قَائِمًا وَإِذَا افْتَتَحَ الصَّلَاةَ قَاعِدًا رَكَعَ قَاعِدًا",
                "id": "Telah mengabarkan kepada kami ['Abdah bin 'Abdurrahim] dia berkata; telah memberitakan kepada kami [Waki'] dia berkata; telah menceritakan kepadaku [Yazid bin Ibrahim] dari [Ibnu Sirin] dari ['Abdullah bin Syaqiq] dari ['Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah sholat dengan berdiri, juga dengan duduk. Jika beliau mengawali sholatnya dengan berdiri maka beliau ruku' dengan berdiri, sedangkan jika beliau mengawali sholatnya dengan duduk maka beliau ruku' dengan duduk.\""
            },
            {
                "number": 1598,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا ابْنُ الْقَاسِمِ عَنْ مَالِكٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ يَزِيدَ وَأَبُو النَّضْرِ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي وَهُوَ جَالِسٌ فَيَقْرَأُ وَهُوَ جَالِسٌ فَإِذَا بَقِيَ مِنْ قِرَاءَتِهِ قَدْرَ مَا يَكُونُ ثَلَاثِينَ أَوْ أَرْبَعِينَ آيَةً قَامَ فَقَرَأَ وَهُوَ قَائِمٌ ثُمَّ رَكَعَ ثُمَّ سَجَدَ ثُمَّ يَفْعَلُ فِي الرَّكْعَةِ الثَّانِيَةِ مِثْلَ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dia berkata; telah menceritakan kepada kami [Ibnul Qasim] dari [Malik] dia berkata; telah menceritakan kepadaku ['Abdullah bin Yazid] dan [Abu An Nadlar] dari [Abu Salamah] dari ['Aisyah] bahwa Nabi shallallahu 'alaihi wasallam pernah sholat sambil duduk dan membaca surah sambil duduk. Jika bacaannya tersisa sekitar tiga puluh atau empat puluh ayat, maka beliau berdiri lalu membacanya sambil berdiri, kemudian ruku' dan sujud. Lalu pada rakaat kedua beliau juga melakukan hal seperti itu."
            },
            {
                "number": 1599,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى جَالِسًا حَتَّى دَخَلَ فِي السِّنِّ فَكَانَ يُصَلِّي وَهُوَ جَالِسٌ يَقْرَأُ فَإِذَا غَبَرَ مِنْ السُّورَةِ ثَلَاثُونَ أَوْ أَرْبَعُونَ آيَةً قَامَ فَقَرَأَ بِهَا ثُمَّ رَكَعَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami ['Isa bin Yunus] dia berkata; telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [Bapaknya] dari ['Aisyah] dia berkata; \"Aku belum pernah melihat Rasulullah shallallahu 'alaihi wasallam sholat sambil duduk, kecuali saat umurnya sudah tua. Beliau juga mengerjakan sholat sambil duduk saat membaca Al Qur'an. Jika bacaan Al Qur'an tinggal tiga puluh atau empat puluh ayat, maka beliau berdiri lalu membaca surat sambil berdiri, lalu ruku'.\""
            },
            {
                "number": 1600,
                "arab": "أَخْبَرَنَا زِيَادُ بْنُ أَيُّوبَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ أَبِي هِشَامٍ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ وَهُوَ قَاعِدٌ فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ قَدْرَ مَا يَقْرَأُ إِنْسَانٌ أَرْبَعِينَ آيَةً",
                "id": "Telah mengabarkan kepada kami [Ziyad bin Ayyub] dia berkata; telah menceritakan kepada kami [Ibnu 'Ulayyah] dia berkata; telah menceritakan kepada kami [Al Walid bin Abu Hisyam] dari [Abu Bakr bin Muhammad] dari ['Amrah] dari ['Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam membaca (Al Qur'an dalam sholat) sambil duduk, dan bila hendak ruku' maka beliau berdiri seukuran membaca empat puluh ayat.\""
            },
            {
                "number": 1601,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ عَنْ عَبْدِ الْأَعْلَى قَالَ حَدَّثَنَا هِشَامٌ عَنْ الْحَسَنِ عَنْ سَعْدِ بْنِ هِشَامِ بْنِ عَامِرٍ قَالَقَدِمْتُ الْمَدِينَةَ فَدَخَلْتُ عَلَى عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ مَنْ أَنْتَ قُلْتُ أَنَا سَعْدُ بْنُ هِشَامِ بْنِ عَامِرٍ قَالَتْ رَحِمَ اللَّهُ أَبَاكَ قُلْتُ أَخْبِرِينِي عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ وَكَانَ قُلْتُ أَجَلْ قَالَتْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بِاللَّيْلِ صَلَاةَ الْعِشَاءِ ثُمَّ يَأْوِي إِلَى فِرَاشِهِ فَيَنَامُ فَإِذَا كَانَ جَوْفُ اللَّيْلِ قَامَ إِلَى حَاجَتِهِ وَإِلَى طَهُورِهِ فَتَوَضَّأَ ثُمَّ دَخَلَ الْمَسْجِدَ فَيُصَلِّي ثَمَانِيَ رَكَعَاتٍ يُخَيَّلُ إِلَيَّ أَنَّهُ يُسَوِّي بَيْنَهُنَّ فِي الْقِرَاءَةِ وَالرُّكُوعِ وَالسُّجُودِ وَيُوتِرُ بِرَكْعَةٍ ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ ثُمَّ يَضَعُ جَنْبَهُ فَرُبَّمَا جَاءَ بِلَالٌ فَآذَنَهُ بِالصَّلَاةِ قَبْلَ أَنْ يُغْفِيَ وَرُبَّمَا يُغْفِي وَرُبَّمَا شَكَكْتُ أَغْفَى أَوْ لَمْ يُغْفِ حَتَّى يُؤْذِنَهُ بِالصَّلَاةِ فَكَانَتْ تِلْكَ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أَسَنَّ وَلُحِمَ فَذَكَرَتْ مِنْ لَحْمِهِ مَا شَاءَ اللَّهُ قَالَتْ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِالنَّاسِ الْعِشَاءَ ثُمَّ يَأْوِي إِلَى فِرَاشِهِ فَإِذَا كَانَ جَوْفُ اللَّيْلِ قَامَ إِلَى طَهُورِهِ وَإِلَى حَاجَتِهِ فَتَوَضَّأَ ثُمَّ يَدْخُلُ الْمَسْجِدَ فَيُصَلِّي سِتَّ رَكَعَاتٍ يُخَيَّلُ إِلَيَّ أَنَّهُ يُسَوِّي بَيْنَهُنَّ فِي الْقِرَاءَةِ وَالرُّكُوعِ وَالسُّجُودِ ثُمَّ يُوتِرُ بِرَكْعَةٍ ثُمَّ يُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ ثُمَّ يَضَعُ جَنْبَهُ وَرُبَّمَا جَاءَ بِلَالٌ فَآذَنَهُ بِالصَّلَاةِ قَبْلَ أَنْ يُغْفِيَ وَرُبَّمَا أَغْفَى وَرُبَّمَا شَكَكْتُ أَغْفَى أَمْ لَا حَتَّى يُؤْذِنَهُ بِالصَّلَاةِ قَالَتْ فَمَا زَالَتْ تِلْكَ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Ali] dari ['Abdul A'la] dia berkata; telah menceritakan kepada kami [Hisyam] dari [Al Hasan] dari [Sa'ad bin Hisyam bin 'Amir] dia berkata; \"Aku datang ke Madinah lalu aku menemui [Aisyah] Radliallahu? nha, kemudian ia berkata; 'Siapa kamu? ' Aku menjawab; 'Sa'ad bin Hisyam bin Amir'. ia lalu berkata; 'Semoga Allah memberikan rahmat kepada ayahmu! ' Aku berkata lagi, 'Kabarkanlah kepadaku tentang cara sholat Rasulullah shallallahu 'alaihi wasallam? ' la menjawab; `Rasulullah shallallahu 'alaihi wasallam dulu begini dan begitu'. Aku berkata; \"Tentu'. Aisyah berkata; 'Rasulullah shallallahu 'alaihi wasallam sholat Isya' pada malam hari, kemudian kembali ke tempat tidurnya, lalu tidur. Pada tengah malam beliau bangun untuk hajatnya dan bersuci, lalu berwudlu dan masuk ke masjid, kemudian sholat delapan rakaat. Terbayang olehku bahwa beliau menyamakan (lama) bacaannya dan ruku' serta sujudnya. Setelah itu sholat witir satu rakaat, kemudian sholat dua rakaat sambil duduk. Kemudian beliau berbaring miring. Kadangkala Bilal datang dan mengumandangkan adzan untuk sholat sebelum beliau tidur atau sedang tidur. Mungkin juga aku ragu apakah beliau sudah tidur atau belum tidur! hingga Bilal mengumandangkan adzan untuk sholat. Begitulah cara Rasulullah shallallahu 'alaihi wasallam sholat hingga beliau tua dan bertambah gemuk.' Aisyah menceritakan daging (gemuk) nya Rasulullah shallallahu 'alaihi wasallam masya Allah. dia berkata; 'Rasulullah shallallahu 'alaihi wasallam sholat Isya' bersama para sahabat kemudian kembali ke tempat tidurnya. Pada tengah malam beliau bangun ke tempat bersucinya dan hajatnya, lalu berwudhu, kemudian masuk ke masjid lalu sholat enam rakaat. Terbayang olehku bahwa beliau menyamakan bacaannya, ruku'nya, serta sujudnya. Beliau juga sholat witir satu rakaat. Kemudian sholat dua rakaat sambil duduk, lalu berbaring miring. Kadangkala Bilal datang lalu mengumandangkan adzan untuk sholat sebelum beliau tidur atau sedang tidur. Aku juga ragu apakah beliau sudah tidur? Hingga Bilal mengumandangkan adzan untuk sholat.' Aisyah berkata; 'Maka senantiasa seperti itulah cara sholat Rasulullah shallallahu 'alaihi wasallam.'"
            },
            {
                "number": 1602,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ عَنْ حَدِيثِ أَبِي عَاصِمٍ قَالَ حَدَّثَنَا عُمَرُ بْنُ أَبِي زَائِدَةَ قَالَ حَدَّثَنِي أَبُو إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْتَنِعُ مِنْ وَجْهِي وَهُوَ صَائِمٌ وَمَا مَاتَ حَتَّى كَانَ أَكْثَرُ صَلَاتِهِ قَاعِدًا ثُمَّ ذَكَرَتْ كَلِمَةً مَعْنَاهَا إِلَّا الْمَكْتُوبَةَ وَكَانَ أَحَبُّ الْعَمَلِ إِلَيْهِ مَا دَامَ عَلَيْهِ الْإِنْسَانُ وَإِنْ كَانَ يَسِيرًاخَالَفَهُ يُونُسُ رَوَاهُ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ أُمِّ سَلَمَةَ",
                "id": "Telah mengabarkan kepada kami ['Amr bin 'Ali] tentang hadits [Abu 'Ashim], dia berkata; telah menceritakan kepada kami ['Umar bin Abu Zaidah] dia berkata; telah menceritakan kepadaku [Abu Ishaq] dari [Al Aswad] dari ['Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam tetap saja menciumku, padahal beliau sedang puasa, dan Tidaklah beliau meninggal sehingga kebanyakan sholat Rasulullah adalah sambil duduk.\" -Kemudian ia menyebutkan suatu kalimat yang maknanya adalah-: kecuali sholat wajib (beliau kerjakan sambil berdiri), dan perbuatan yang paling dicintai adalah yang dilakukan secara kontinyu oleh seseorang, walaupun sedikit. Yunus menyelisihi Hadits ini, dia meriwayatkan dari Abu Ishaq dari Al Aswad dari Ummu Salamah."
            },
            {
                "number": 1603,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ سَلْمٍ الْبَلْخِيُّ قَالَ حَدَّثَنَا النَّضْرُ قَالَ أَنْبَأَنَا يُونُسُ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ أُمِّ سَلَمَةَ قَالَتْمَا قُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى كَانَ أَكْثَرُ صَلَاتِهِ جَالِسًا إِلَّا الْمَكْتُوبَةَخَالَفَهُ شُعْبَةُ وَسُفْيَانُ وَقَالَا عَنْ أَبِي إِسْحَقَ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Salim Al Balkhi] dia berkata; telah menceritakan kepada kami [An Nadlar] dia berkata; telah memberitakan kepada kami [Yunus] dari [Abu Ishaq] dari [Al Aswad] dari [Ummu Salamah] dia berkata; \"Tidaklah Rasulullah shallallahu 'alaihi wasallam wafat hingga kebanyakan sholatnya adalah dilaksanakan sambil duduk, kecuali sholat wajib.\" Syu'bah dan Sufyan menyelisihi Hadits tersebut, mereka berdua berkata; 'Dari Abu Ishaq dari Abu Salamah dari Ummu Salamah.'"
            },
            {
                "number": 1604,
                "arab": "أَخْبَرَنَا إِسْمَعِيلُ بْنُ مَسْعُودٍ حَدَّثَنَا خَالِدٌ عَنْ شُعْبَةَ عَنْ أَبِي إِسْحَقَ قَالَ سَمِعْتُ أَبَا سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْمَا مَاتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى كَانَ أَكْثَرُ صَلَاتِهِ قَاعِدًا إِلَّا الْفَرِيضَةَ وَكَانَ أَحَبُّ الْعَمَلِ إِلَيْهِ أَدْوَمَهُ وَإِنْ قَلَّ",
                "id": "Telah mengabarkan kepada kami [Isma'il bin Mas'ud] telah menceritakan kepada kami [Khalid] dari [Syu'bah] dari [Abu Ishaq] dia berkata; Aku mendengar [Abu Salamah] dari [Ummu Salamah] dia berkata; \"Tidaklah Rasulullah shallallahu 'alaihi wasallam wafat hingga kebanyakan sholatnya adalah sambil duduk, kecuali sholat fardlu. Perbuatan yang paling dicintai adalah yang dilakukan secara kontinyu, walaupun sedikit.\""
            },
            {
                "number": 1605,
                "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الصَّمَدِ قَالَ حَدَّثَنَا يَزِيدُ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي سَلَمَةَ عَنْ أُمِّ سَلَمَةَ قَالَتْوَالَّذِي نَفْسِي بِيَدِهِ مَا مَاتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى كَانَ أَكْثَرُ صَلَاتِهِ قَاعِدًا إِلَّا الْمَكْتُوبَةَ وَكَانَ أَحَبُّ الْعَمَلِ إِلَيْهِ مَا دَاوَمَ عَلَيْهِ وَإِنْ قَلَّخَالَفَهُ عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ فَرَوَاهُ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ",
                "id": "Telah mengabarkan kepada kami ['Abdullah bin 'Abdush Shamad] dia berkata; telah menceritakan kepada kami [Yazid] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Abu Salamah] dari [Ummu Salamah] dia berkata; \"Demi Dzat yang jiwaku berada di tangan-Nya, tidaklah Rasulullah shallallahu 'alaihi wasallam wafat hingga sholatnya sering dilakukan sambil duduk, kecuali sholat wajib. Perbuatan yang sangat dicintai beliau adalah yang dilakukan secara kontinyu, walaupun- jumlahnya- sedikit.\" Utsman bin Abu Sulaiman menyelisihinya, dia meriwayatkan dari Abu Salamah, dari Aisyah."
            },
            {
                "number": 1606,
                "arab": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ عَنْ حَجَّاجٍ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ أَنَّ أَبَا سَلَمَةَ أَخْبَرَهُ أَنَّ عَائِشَةَ أَخْبَرَتْهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَمُتْ حَتَّى كَانَ يُصَلِّي كَثِيرًا مِنْ صَلَاتِهِ وَهُوَ جَالِسٌ",
                "id": "Telah mengabarkan kepada kami [Al Hasan bin Muhammad] dari [Hajjaj] dari [Ibnu Juraij] dia berkata; telah mengabarkan kepadaku ['Utsman bin Abu Sulaiman] [Abu Salamah] mengabarkan kepadanya bahwasanya ['Aisyah] mengabarkan kepadanya; Rasulullah shallallahu 'alaihi wasallam tidak wafat hingga sering melakukan sholatnya sambil duduk."
            },
            {
                "number": 1607,
                "arab": "أَخْبَرَنَا أَبُو الْأَشْعَثِ عَنْ يَزِيدَ بْنِ زُرَيْعٍ قَالَ أَنْبَأَنَا الْجُرَيْرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَقُلْتُ لِعَائِشَةَ هَلْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَهُوَ قَاعِدٌ قَالَتْ نَعَمْ بَعْدَ مَا حَطَمَهُ النَّاسُ",
                "id": "Telah mengabarkan kepada kami [Abul Asy'ats] dari [Yazid bin Zurai'] dia berkata; telah memberitakan kepada kami [Al Jurairi] dari ['Abdullah bin Syaqiq] dia berkata; \"Aku bertanya kepada [Aisyah], `Apakah Rasulullah shallallahu 'alaihi wasallam pernah sholat sambil duduk? ' lalu Aisyah menjawab; `Ya, ketika beliau telah lanjut usia'.\""
            },
            {
                "number": 1608,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ السَّائِبِ بْنِ يَزِيدَ عَنْ الْمُطَّلِبِ بْنِ أَبِي وَدَاعَةَ عَنْ حَفْصَةَ قَالَتْمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي سُبْحَتِهِ قَاعِدًا قَطُّ حَتَّى كَانَ قَبْلَ وَفَاتِهِ بِعَامٍ فَكَانَ يُصَلِّي قَاعِدًا يَقْرَأُ بِالسُّورَةِ فَيُرَتِّلُهَا حَتَّى تَكُونَ أَطْوَلَ مِنْ أَطْوَلَ مِنْهَا",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dari [Malik] dari [Ibnu Syihab] dari [As Saib bin Yazid] dari [Al Muththalib bin Abu Wada'ah] dari [Hafshah] dia berkata; \"Aku tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam sholat sunnah sambil duduk, hingga menjelang setahun sebelum beliau walat, (saat itu) beliau sering sholat sambil duduk, membaca surah Al Qur'an dengan tartil, sampai-sampai beliau memperlama dalam membacanya.\""
            },
            {
                "number": 1609,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ قَالَ حَدَّثَنَا مَنْصُورٌ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ أَبِي يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي جَالِسًا فَقُلْتُ حُدِّثْتُ أَنَّكَ قُلْتَ إِنَّ صَلَاةَ الْقَاعِدِ عَلَى النِّصْفِ مِنْ صَلَاةِ الْقَائِمِ وَأَنْتَ تُصَلِّي قَاعِدًا قَالَ أَجَلْ وَلَكِنِّي لَسْتُ كَأَحَدٍ مِنْكُمْ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dia berkata; telah menceritakan kepada kami [Yahya] dari [Sufyan] dia berkata; telah menceritakan kepada kami [Manshur] dari [Hilal bin Yasaf] dari [Abu Yahya] dari ['Abdullah bin 'Amru] dia berkata; \"Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam sholat sambil duduk, maka aku berkata kepada beliau; 'Aku pernah mendapatkan hadits dari engkau, bahwa engkau bersabda: \"sholat orang sambil duduk (mendapatkan) setengah (pahala) dari sholat yang dilakukan sambil berdiri. Dan engkau sholat sambil duduk.\" Beliau shallallahu 'alaihi wasallam menjawab: `Ya, tetapi aku tidak seperti salah satu dari kalian.\""
            },
            {
                "number": 1610,
                "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ عَنْ سُفْيَانَ بْنِ حَبِيبٍ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الَّذِي يُصَلِّي قَاعِدًا قَالَ مَنْ صَلَّى قَائِمًا فَهُوَ أَفْضَلُ وَمَنْ صَلَّى قَاعِدًا فَلَهُ نِصْفُ أَجْرِ الْقَائِمِ وَمَنْ صَلَّى نَائِمًا فَلَهُ نِصْفُ أَجْرِ الْقَاعِدِ",
                "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dari [Sufyan bin Habib] dari [Husain Al Mu'allim] dari ['Abdullah bin Buraidah] dari ['Imran bin Hushain] dia berkata; \"Aku pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang orang yang sholat sambil duduk, lalu beliau bersabda: \"Barangsiapa sholat dengan berdiri maka itu lebih utama. Barangsiapa sholat dengan duduk maka baginya setengah pahala dari pahala sholat yang dilakukan dengan berdiri. Barangsiapa sholat dengan tiduran maka baginya setengah pahala dari pahala sholat Yang dilakukan dengan duduk.\""
            },
            {
                "number": 1611,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ عَنْ حَفْصٍ عَنْ حُمَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مُتَرَبِّعًاقَالَ أَبُو عَبْد الرَّحْمَنِ لَا أَعْلَمُ أَحَدًا رَوَى هَذَا الْحَدِيثَ غَيْرَ أَبِي دَاوُدَ وَهُوَ ثِقَةٌ وَلَا أَحْسِبُ هَذَا الْحَدِيثَ إِلَّا خَطَأً وَاللَّهُ تَعَالَى أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami [Harun bin 'Abdullah] dia berkata; telah menceritakan kepada kami [Abu Dawud Al Ja'fari] dari [Hafsh] dari [Humaid] dari ['Abdullah bin Syaqiq] dari ['Aisyah] dia berkata; 'Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam sholat sambil duduk dengan kaki bersilang di bawah paha (mutarabi').\" Abu Abdurrahman berkata; 'Aku tidak mengetahui seorangpun yang meriwayatkan hadits ini selain Abu Dawud dan ia adalah terpercaya dan aku menganggap hadits salah. Wallahu Ta'ala A'lam."
            },
            {
                "number": 1612,
                "arab": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَيْسٍ قَالَسَأَلْتُ عَائِشَةَ كَيْفَ كَانَتْ قِرَاءَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ يَجْهَرُ أَمْ يُسِرُّ قَالَتْ كُلُّ ذَلِكَ قَدْ كَانَ يَفْعَلُ رُبَّمَا جَهَرَ وَرُبَّمَا أَسَرَّ",
                "id": "Telah mengabarkan kepada kami [Syu'aib bin Yusuf] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dari [Mu'awiyah bin Shalih] dari ['Abdullah bin Abu Qais] dia berkata; \"Aku pernah bertanya kepada [Aisyah] tentang cara Rasulullah shallallahu 'alaihi wasallam membaca (Al Qur'an) di malam hari, `Beliau membacanya dengan bersuara keras atau pelan (tanpa bersuara)? ' Aisyah menjawab; 'Semuanya pernah dilakukan beliau. Kadang beliau membacanya dengan suara keras dan kadang membacanya dengan pelan (tanpa bersuara) '.\""
            },
            {
                "number": 1613,
                "arab": "أَخْبَرَنَا هَارُونُ بْنُ مُحَمَّدِ بْنِ بَكَّارِ بْنِ بِلَالٍ قَالَ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ سُمَيْعٍ قَالَ حَدَّثَنَا زَيْدٌ يَعْنِي ابْنَ وَاقِدٍ عَنْ كَثِيرِ بْنِ مُرَّةَ أَنَّ عُقْبَةَ بْنَ عَامِرٍ حَدَّثَهُمْأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الَّذِي يَجْهَرُ بِالْقُرْآنِ كَالَّذِي يَجْهَرُ بِالصَّدَقَةِ وَالَّذِي يُسِرُّ بِالْقُرْآنِ كَالَّذِي يُسِرُّ بِالصَّدَقَةِ",
                "id": "Telah mengabarkan kepada kami [Harun bin Muhammad bin Bakkar bin Bilal] dia berkata; telah menceritakan kepada kami [Muhammad bin Sumai'] dia berkata; telah menceritakan kepada kami [Zaid bin Waqid] dari [Katsir bin Murrah] bahwasanya ['Uqbah bin 'Amir] menceritakan kepada mereka; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang membaca Al Qur'an dengan mengeraskan suaranya seperti orang yang menampakkan sedekah, dan orang yang memelankan suaranya dalam membaca Al Qur 'an seperti orang yang menyembunyikan sedekahnya.\""
            },
            {
                "number": 1614,
                "arab": "أَخْبَرَنَا الْحُسَيْنُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ الْمُسْتَوْرِدِ بْنِ الْأَحْنَفِ عَنْ صِلَةَ بْنِ زُفَرَ عَنْ حُذَيْفَةَ قَالَصَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةً فَافْتَتَحَ الْبَقَرَةَ فَقُلْتُ يَرْكَعُ عِنْدَ الْمِائَةِ فَمَضَى فَقُلْتُ يَرْكَعُ عِنْدَ الْمِائَتَيْنِ فَمَضَى فَقُلْتُ يُصَلِّي بِهَا فِي رَكْعَةٍ فَمَضَى فَافْتَتَحَ النِّسَاءَ فَقَرَأَهَا ثُمَّ افْتَتَحَ آلَ عِمْرَانَ فَقَرَأَهَا يَقْرَأُ مُتَرَسِّلًا إِذَا مَرَّ بِآيَةٍ فِيهَا تَسْبِيحٌ سَبَّحَ وَإِذَا مَرَّ بِسُؤَالٍ سَأَلَ وَإِذَا مَرَّ بِتَعَوُّذٍ تَعَوَّذَ ثُمَّ رَكَعَ فَقَالَ سُبْحَانَ رَبِّيَ الْعَظِيمِ فَكَانَ رُكُوعُهُ نَحْوًا مِنْ قِيَامِهِ ثُمَّ رَفَعَ رَأْسَهُ فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَكَانَ قِيَامُهُ قَرِيبًا مِنْ رُكُوعِهِ ثُمَّ سَجَدَ فَجَعَلَ يَقُولُ سُبْحَانَ رَبِّيَ الْأَعْلَى فَكَانَ سُجُودُهُ قَرِيبًا مِنْ رُكُوعِهِ",
                "id": "Telah mengabarkan kepada kami [Al Husain bin Manshur] dia berkata; telah menceritakan kepada kami ['Abdullah bin Numair] dia berkata; telah menceritakan kepada kami [Al A'masy] dari [Sa'd bin 'Ubaidah] dari [Al Mustaurid bin Al Ahnaf] dari [Shilah bin Zufar] dari [Hudzaifah] dia berkata; \"Aku pernah sholat dengan Rasulullah shallallahu 'alaihi wasallam pada suatu malam, beliau memulainya dengan membaca surah Al Baqarah. Lalu aku berkata dalam hatiku; -Mungkin- beliau akan ruku' pada ayat ke seratus. Namun beliau malah meneruskannya'. Aku berkata dalam hatiku, '-Mungkin- beliau akan ruku' saat dua ratus ayat, namun beliau malah meneruskannya'. Aku berkata dalam hatiku, 'Beliau sholat dengan surat Al Baqarah dalam satu rakaat. Kemudian beliau meneruskan (sholatnya), dan memulainya dengan membaca surah An Nisaa'. Beliau membacanya (hingga selesai), kemudian memulai lagi dengan surah Ali 'Imraan, dan beliau membacanya (hingga selesai) dengan perlahan-perlahan. Jika beliau menjumpai ayat tasbih maka beliau bertasbih (memuji Allah), jika beliau menjumpai ayat yang menganjurkan untuk meminta maka beliau pun meminta (kepada Allah), dan jika beliau menjumpai ayat yang berkenaan dengan memohon perlindungan maka beliau memohon perlindungan. Kemudian beliau ruku dengan membaca subhana rabbiyal 'azhimi (Maha Suci Tuhanku yang Maha Agung), yang (karenanya) ruku beliau sama dengan (lamanya) berdiri. Kemudian beliau mengangkat kepalanya, lalu mengucapkan Sami'allahu liman Hamidah (Allah Maha Mendengar orang yang memuji-Nya). Dan (lamanya) berdiri beliau sama dengan (lamanya) beliau ruku'. Kemudian beliau sujud dengan membaca subhana rabbiyal a'laa (Maha Suci Tuhanku Yang Maha Tinggi). Sujud beliau sama dengan (lamanya) ruku' beliau.\""
            },
            {
                "number": 1615,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا النَّضْرُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ ثِقَةٌ قَالَ حَدَّثَنَا الْعَلَاءُ بْنُ الْمُسَيَّبِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ طَلْحَةَ بْنِ يَزِيدَ الْأَنْصَارِيِّ عَنْ حُذَيْفَةَأَنَّهُ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَمَضَانَ فَرَكَعَ فَقَالَ فِي رُكُوعِهِ سُبْحَانَ رَبِّيَ الْعَظِيمِ مِثْلَ مَا كَانَ قَائِمًا ثُمَّ جَلَسَ يَقُولُ رَبِّ اغْفِرْ لِي رَبِّ اغْفِرْ لِي مِثْلَ مَا كَانَ قَائِمًا ثُمَّ سَجَدَ فَقَالَ سُبْحَانَ رَبِّيَ الْأَعْلَى مِثْلَ مَا كَانَ قَائِمًا فَمَا صَلَّى إِلَّا أَرْبَعَ رَكَعَاتٍ حَتَّى جَاءَ بِلَالٌ إِلَى الْغَدَاةِقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا الْحَدِيثُ عِنْدِي مُرْسَلٌ وَطَلْحَةُ بْنُ يَزِيدَ لَا أَعْلَمُهُ سَمِعَ مِنْ حُذَيْفَةَ شَيْئًا وَغَيْرُ الْعَلَاءِ بْنِ الْمُسَيَّبِ قَالَ فِي هَذَا الْحَدِيثِ عَنْ طَلْحَةَ عَنْ رَجُلٍ عَنْ حُذَيْفَةَ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; telah memberitakan kepada kami [An Nadlar bin Muhammad Al Marwazi] -seorang yang tsiqah- dia berkata; telah menceritakan kepada kami [Al 'Ala bin Al Musayyab] dari ['Amru bin Murrah] dari [Thalhah bin Yazid Al Anshari] dari [Hudzaifah] bahwa ia pernah sholat dengan Rasulullah shallallahu 'alaihi wasallam di bulan ramadhan, beliau ruku' dengan membaca subhana rabbiyal 'azhimi (Maha Suci Tuhanku Yang Maha Agung), yang (lamanya) ruku' beliau sama dengan (lamanya) berdiri beliau. Kemudian beliau duduk dan membaca rabbighfirli, rabighfirli (Ya Tuhanku, ampunilah aku. Ya Tuhanku, ampunilah aku), yang (lamanya) duduk beliau sama dengan (lamanya) berdiri. Kemudian beliau sujud dan membaca subhana rabbiyal a'laa (Maha Suci Tuhanku Yang Maha Tinggi), yang (lamanya) sujud beliau sama dengan (lamanya) berdiri. Tidaklah beliau sholat kecuali hanya empat rakaat, hingga Bilal datang untuk sholat Subuh.\" Abu Abdurrahman berkata; 'Menurutku Hadist ini mursal, aku tidak mengetahui bahwa Thalhah bin Yazid telah mendengar dari Hudzaifah. Karena telah berkata Al 'Alla bin Musayyab mengenai Hadist ini dari seseorang, dari Hudzaifah.'"
            },
            {
                "number": 1616,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَعَبْدُ الرَّحْمَنِ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ أَنَّهُ سَمِعَ عَلِيًّا الْأَزْدِيَّ أَنَّهُ سَمِعَ ابْنَ عُمَرَ يُحَدِّثُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَىأَبُو عَبْد الرَّحْمَنِ هَذَا الْحَدِيثُ عِنْدِي خَطَأٌ وَاللَّهُ تَعَالَى أَعْلَمُ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Muhammad bin Ja'far] dan ['Abdurrahman], mereka berkata; telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin 'Atha] bahwasanya ia mendengar ['Ali Al Azdi] telah mendengar [Ibnu 'Umar] menceritakan dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"sholat (sunah) malam dan siang hari adalah dua rakaat-dua rakaat. Abu Abdurrahman berkata; 'Menurutku Hadist ini salah. Wallahu Ta'ala? lam."
            },
            {
                "number": 1617,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ حَبِيبٍ عَنْ طَاوُسٍ قَالَ قَالَ ابْنُ عُمَرَسَأَلَ رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ فَقَالَ مَثْنَى مَثْنَى فَإِذَا خَشِيتَ الصُّبْحَ فَوَاحِدَةٌ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Qudamah] dia berkata; telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Habib] dari [Thawus] dia berkata; berkata [Ibnu 'Umar]; \"Ada seorang laki-laki bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang sholat malam? Lalu beliau bersabda: \"Dua rakaat-dua rakaat. Jika kamu khawatir akan segera datang waktu Subuh maka (cukup) satu rakaat.\""
            },
            {
                "number": 1618,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ وَمُحَمَّدُ بْنُ صَدَقَةَ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ عَنْ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Utsman] dan [Muhammad bin Shadaqah] mereka berkata; telah menceritakan kepada kami [Muhammad bin Harb] dari [Az Zubaidi] dari [Az Zuhri] dari [Salim] dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"sholat malam itu dua rakaat-dua rakaat. Jika kamu khawatir akan segera Subuh maka sholat witirlah satu rakaat.\""
            },
            {
                "number": 1619,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي لَبِيدٍ عَنْ أَبِي سَلَمَةَ عَنْ ابْنِ عُمَرَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يُسْأَلُ عَنْ صَلَاةِ اللَّيْلِ فَقَالَ مَثْنَى مَثْنَى فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِرَكْعَةٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Manshur] dia berkata; telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Labid] dari [Abu Salamah] dari [Ibnu 'Umar] dia berkata; \"Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam saat di atas mimbar ditanya tentang sholat malam? Lalu beliau menjawab: \"Dua rakaat-dua rakaat. Jika kamu khawatir akan segera Subuh maka sholatlah witir satu rakaaat.\""
            },
            {
                "number": 1620,
                "arab": "أَخْبَرَنَا مُوسَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ قَالَ حَدَّثَنَا زُهَيْرٌ قَالَ حَدَّثَنَا الْحَسَنُ بْنُ الْحُرِّ قَالَ حَدَّثَنَا نَافِعٌ أَنَّ ابْنَ عُمَرَ أَخْبَرَهُمْأَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ قَالَ مَثْنَى مَثْنَى فَإِنْ خَشِيَ أَحَدُكُمْ الصُّبْحَ فَلْيُوتِرْ بِوَاحِدَةٍ",
                "id": "Telah mengabarkan kepada kami [Musa bin Sa'id] dia berkata; telah menceritakan kepada kami [Ahmad bin 'Abdullah bin Yunus] dia berkata; telah menceritakan kepada kami [Zuhair] dia berkata; telah menceritakan kepada kami [Al Hasan bin Al Hurr] dia berkata; telah menceritakan kepada kami [Nafi'] bahwasanya [Ibnu 'Umar] mengabarkan kepada mereka, seorang lelaki bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang sholat malam? Lalu beliau menjawab: \"Dua rakaat-dua rakaat. Jika salah seorang dari kalian khawatir akan segera Subuh maka sholatlah witir satu rakaat.\""
            },
            {
                "number": 1621,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu 'Umar] beliau bersabda: \"sholat malam itu dua rakaat-dua rakaat. Jika kamu khawatir akan segera Subuh maka sholatlah witir satu rakaat.\""
            },
            {
                "number": 1622,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ الْمُغِيرَةِ قَالَ حَدَّثَنَا عُثْمَانُ عَنْ شُعَيْبٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَسَأَلَ رَجُلٌ مِنْ الْمُسْلِمِينَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ صَلَاةُ اللَّيْلِ فَقَالَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Muhammad bin Al Mughirah] dia berkata; telah menceritakan kepada kami ['Utsman] dari [Syu'aib] dari [Az Zuhri] dari [Salim] dari [Ibnu 'Umar] dia berkata; \"Seorang lelaki bertanya kepada Rasulullah shallallahu 'alaihi wasallam, 'Bagaimana cara sholat malam? Lalu beliau menjawab: \"Dua rakaat-dua rakaat. Jika salah seorang dari kalian khawatir akan segera Subuh maka sholatlah witir satu rakaat.\""
            },
            {
                "number": 1623,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ عَنْ عَمِّهِ قَالَ أَخْبَرَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ أَخْبَرَهُأَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خَشِيتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya] dia berkata; telah menceritakan kepada kami [Ya'qub bin Ibrahim] dia berkata; telah menceritakan kepada kami keponakanku [Ibnu Syihab] dari [pamannya] dia berkata; telah mengabarkan kepadaku [Humaid bin 'Abdurrahman] bahwasanya ['Abdullah bin 'Umar] mengabarkan kepadanya; \"Seorang lelaki bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang sholat malam? Lalu Rasulullah shallallahu 'alaihi wasallam menjawab: \"Dua rakaat-dua rakaat. Jika karena khawatir akan segera Subuh maka sholatlah witir satu rakaat.\""
            },
            {
                "number": 1624,
                "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ الْهَيْثَمِ قَالَ حَدَّثَنَا حَرْمَلَةُ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ أَنَّ ابْنَ شِهَابٍ حَدَّثَهُ أَنَّ سَالِمَ بْنَ عَبْدِ اللَّهِ وَحُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَاهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَقَامَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ صَلَاةُ اللَّيْلِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Al Haitsam] dia berkata; telah menceritakan kepada kami [Harmalah] dia berkata; telah menceritakan kepada kami [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku ['Amru bin Al Harits], [Ibnu Syihab] menceritakan kepadanya bahwasanya [Salim bin 'Abdullah] dan [Humaid bin 'Abdurrahman] menceritakan kepadanya dari ['Abdullah bin 'Umar] dia berkata; \"Ada seorang lelaki berdiri lalu bertanya; `Wahai Rasulullah, bagaimanakah cara sholat malam? ' Rasulullah shallallahu 'alaihi wasallam menjawab: 'Dua rakaat-dua rakaat, Jika kamu khawatir akan segera subuh maka sholatlah witir satu raka'at.'"
            },
            {
                "number": 1625,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمٍ وَهُوَ ابْنُ ضَمْرَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَأَوْتَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ يَا أَهْلَ الْقُرْآنِ أَوْتِرُوا فَإِنَّ اللَّهَ عَزَّ وَجَلَّ وِتْرٌ يُحِبُّ الْوِتْرَ",
                "id": "Telah mengabarkan kepada kami [Hannad bin As Sari] dari [Abu Bakr bin 'Ayyasy] dari [Abu Ishaq] dari ['Ashim bin Dhamrah] dari ['Ali radliallahu 'anhu] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat witir, kemudian bersabda: 'Wahai ahli Al Qur'an! Kerjakanlah sholat witir, karena Allah Azza wa Jalla ganjil (Esa) dan mencintai yang ganjil'.\""
            },
            {
                "number": 1626,
                "arab": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ عَنْ أَبِي نُعَيْمٍ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَالْوِتْرُ لَيْسَ بِحَتْمٍ كَهَيْئَةِ الْمَكْتُوبَةِ وَلَكِنَّهُ سُنَّةٌ سَنَّهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah mengabarkan kepadaku [Muhammad bin Isma'il bin Ibrahim] dari [Abu Nu'aim] dari [Sufyan] dari [Abu Ishaq] dari ['Ashim bin Dhamrah] dari ['Ali radliallahu 'anhu] dia berkata; \"sholat witir tidak harus seperti sholat wajib, tetapi witir adalah sunnah yang disunnahkan oleh Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 1627,
                "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ سَلْمٍ وَمُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحَسَنِ بْنِ شَقِيقٍ عَنْ النَّضْرِ بْنِ شُمَيْلٍ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ أَبِي شِمْرٍ عَنْ أَبِي عُثْمَانَ عَنْ أَبِي هُرَيْرَةَ قَالَأَوْصَانِي خَلِيلِي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثٍ النَّوْمِ عَلَى وِتْرٍ وَصِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَرَكْعَتَيْ الضُّحَى",
                "id": "Telah mengabarkan kepada kami [Sulaiman bin Salim] dan [Muhammad bin 'Ali bin Al Hasan bin Syaqiq] dari [An Nadlar bin Syumail] dia berkata; telah memberitakan kepada kami [Syu'bah] dari [Abu Syimr] dari [Abu 'Utsman] dari [Abu Hurairah] dia berkata; \"Kekasihku (Rasulullah) mewasiatkan tiga perkara kepadaku, yaitu sholat witir sebelum tidur, puasa tiga hari di setiap bulan, dan sholat Dluha dua rakaat.\""
            },
            {
                "number": 1628,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ ثُمَّ ذَكَرَ كَلِمَةً مَعْنَاهَا عَنْ عَبَّاسٍ الْجُرَيْرِيِّ قَالَ سَمِعْتُ أَبَا عُثْمَانَ عَنْ أَبِي هُرَيْرَةَ قَالَأَوْصَانِي خَلِيلِي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثٍ الْوِتْرِ أَوَّلَ اللَّيْلِ وَرَكْعَتَيْ الْفَجْرِ وَصَوْمِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Basysyar] dia berkata; telah menceritakan kepada kami [Muhammad] dia berkata; [Syu'bah] -kemudian dia menyebutkan kalimat yang maknanya- dari ['Abbas Al Jurairi] dia berkata; Aku mendengar [Abu 'Utsman] dari [Abu Hurairah] dia berkata; \"Kekasihku (Rasulullah) mewasiatkan tiga perkara kepadaku, yaitu sholat witir pada permulaan malam, sholat (sunnah) Fajar dua rakaat, dan puasa tiga hari pada setiap bulan.\""
            },
            {
                "number": 1629,
                "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ مُلَازِمِ بْنِ عَمْرٍو قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بَدْرٍ عَنْ قَيْسِ بْنِ طَلْقٍ قَالَزَارَنَا أَبِي طَلْقُ بْنُ عَلِيٍّ فِي يَوْمٍ مِنْ رَمَضَانَ فَأَمْسَى بِنَا وَقَامَ بِنَا تِلْكَ اللَّيْلَةَ وَأَوْتَرَ بِنَا ثُمَّ انْحَدَرَ إِلَى مَسْجِدٍ فَصَلَّى بِأَصْحَابِهِ حَتَّى بَقِيَ الْوِتْرُ ثُمَّ قَدَّمَ رَجُلًا فَقَالَ لَهُ أَوْتِرْ بِهِمْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا وِتْرَانِ فِي لَيْلَةٍ",
                "id": "Telah mengabarkan kepada kami [Hannad bin As Sari] dari [Mulazim bin 'Amr] dia berkata; telah menceritakan kepadaku ['Abdullah bin Badr] dari [Qais bin Thalq] dia berkata; \"Ayahku [Thalq bin Ali] mengunjungi kami pada bulan ramadhan, dan dia bersama kami sampai sore. Pada hari itu dia sholat malam bersama kami, lalu sholat witir bersama kami. Kemudian berangkat ke masjid dan sholat bersama para sahabatnya hingga sisa sholat witir saja. Kemudian dia memerintahkan seseorang untuk maju sambil berkata kepadanya; 'sholatlah witir bersama mereka, karena aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada dua witir dalam satu malam.\""
            },
            {
                "number": 1630,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُحَمَّدٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ بْنِ يَزِيدَ قَالَسَأَلْتُ عَائِشَةَ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ كَانَ يَنَامُ أَوَّلَ اللَّيْلِ ثُمَّ يَقُومُ فَإِذَا كَانَ مِنْ السَّحَرِ أَوْتَرَ ثُمَّ أَتَى فِرَاشَهُ فَإِذَا كَانَ لَهُ حَاجَةٌ أَلَمَّ بِأَهْلِهِ فَإِذَا سَمِعَ الْأَذَانَ وَثَبَ فَإِنْ كَانَ جُنُبًا أَفَاضَ عَلَيْهِ مِنْ الْمَاءِ وَإِلَّا تَوَضَّأَ ثُمَّ خَرَجَ إِلَى الصَّلَاةِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Al Mutsanna] dia berkata; telah menceritakan kepada kami [Muhammad] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Al Aswad bin Yazid] dia berkata; Aku bertanya kepada ['Aisyah] tentang -cara- sholat Rasulullah shallallahu 'alaihi wasallam? Lalu ia menjawab; 'Beliau tidur pada permulaan malam, kemudian bangun. Jika waktu sudah mendekati Subuh maka beliau mengerjakan sholat witir, kemudian kembali ke tempat tidurnya. Bila beliau punya hajat terhadap istrinya maka beliau bersetubuh dengan istrinya, dan jika beliau mendengar adzan maka beliau segera beranjak. Jika beliau dalam keadaan junub, beliau menyiram diri dengan air (mandi) sedangkan jika tidak junub maka beliau hanya berwudlu kemudian keluar untuk sholat'.\""
            },
            {
                "number": 1631,
                "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ أَبِي حَصِينٍ عَنْ يَحْيَى بْنِ وَثَّابٍ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْأَوْتَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَوَّلِهِ وَآخِرِهِ وَأَوْسَطِهِ وَانْتَهَى وِتْرُهُ إِلَى السَّحَرِ",
                "id": "Telah mengabarkan kepada kami [Ishaq bin Manshur] dia berkata; telah menceritakan kepada kami ['Abdurrahman] dari [Sufyan] dari [Abu Hishn] dari [Yahya bin Watstsab] dari [Masruq] dari ['Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat witir pada permulaan malam, akhir, dan pertengahan malam. Beliau selesai sholat witir setelah menjelang Subuh.\""
            },
            {
                "number": 1632,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ قَالَمَنْ صَلَّى مِنْ اللَّيْلِ فَلْيَجْعَلْ آخِرَ صَلَاتِهِ وِتْرًا فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ بِذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Al Laits] dari [Nafi'] bahwasanya [Ibnu 'Umar] berkata; \"Barangsiapa mengerjakan sholat malam, maka jadikanlah di akhir sholatnya dengan sholat witir, karena Rasulullah shallallahu 'alaihi wasallam memerintahkan hal tersebut.\""
            },
            {
                "number": 1633,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا مُحَمَّدٌ وَهُوَ ابْنُ الْمُبَارَكِ قَالَ حَدَّثَنَا مُعَاوِيَةُ وَهُوَ ابْنُ سَلَّامِ بْنِ أَبِي سَلَّامٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ أَخْبَرَنِي أَبُو نَضْرَةَ الْعَوَقِيُّ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ يَقُولُسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْوِتْرِ فَقَالَ أَوْتِرُوا قَبْلَ الصُّبْحِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Fadlalah bin Ibrahim] dia berkata; telah memberitakan kepada kami [Muhammad bin Al Mubarak] dia berkata; telah menceritakan kepada kami [Mu'awiyah bin Sallam bin Abu Sallam] dari [Yahya bin Abu Katsir] dia berkata; telah mengabarkan kepadaku [Abu Nadlrah Al 'Awaqi] bahwasanya ia mendengar [Abu Sa'id Al Khudri] berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah ditanya tentang sholat witir? Lalu beliau menjawab: 'sholatlah witir sebelum datang Subuh'.\""
            },
            {
                "number": 1634,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ قَالَ حَدَّثَنَا أَبُو إِسْمَعِيلَ الْقَنَّادُ قَالَ حَدَّثَنَا يَحْيَى وَهُوَ ابْنُ أَبِي كَثِيرٍ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَوْتِرُوا قَبْلَ الْفَجْرِ",
                "id": "Telah mengabarkan kepada kami [Yahya bin Durusta] dia berkata; telah menceritakan kepada kami [Abu Isma'il Al Qannad] dia berkata; telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Abu Nadlrah] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"sholatlah witir sebelum Subuh.\""
            },
            {
                "number": 1635,
                "arab": "أَخْبَرَنَا يَحْيَى بْنُ حَكِيمٍ قَالَ حَدَّثَنَا ابْنُ أَبِي عِديٍّ عَنْ شُعْبَةَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِأَنَّهُ كَانَ فِي مَسْجِدِ عَمْرِو بْنِ شُرَحْبِيلَ فَأُقِيمَتْ الصَّلَاةُ فَجَعَلُوا يَنْتَظِرُونَهُ فَجَاءَ فَقَالَ إِنِّي كُنْتُ أُوتِرُ قَالَ وَسُئِلَ عَبْدُ اللَّهِ هَلْ بَعْدَ الْأَذَانِ وِتْرٌ قَالَ نَعَمْ وَبَعْدَ الْإِقَامَةِ وَحَدَّثَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَامَ عَنْ الصَّلَاةِ حَتَّى طَلَعَتْ الشَّمْسُ ثُمَّ صَلَّى",
                "id": "Telah mengabarkan kepada kami [Yahya bin Hakim] dia berkata; telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Syu'bah] dari [Ibrahim bin Muhammad bin Al Muntasyir] dari [Bapaknya] bahwa dia pernah berada di masjid Amru bin Syurahbil, lalu dikumandangkanlah adzan untuk sholat, maka mereka pun menunggunya (Abdullah). Kemudian dia datang dan berkatas \"Aku tadi sedang sholat witir.\" la (Muntasyir) berkata; ['Abdullah] pun ditanya; 'Apakah ada sholat witir setelah adzan? ' la menjawab; `Ya, ada. Juga setelah iqamah'. Kemudian ia menyampaikan hadits dari Nabi shallallahu 'alaihi wasallam, bahwa beliau pernah tertidur dari sholat (Subuh) hingga matahari terbit, kemudian beliau mengerjakan sholat.\""
            },
            {
                "number": 1636,
                "arab": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ الْأَخْنَسِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ عَلَى الرَّاحِلَةِ",
                "id": "Telah mengabarkan kepada kami ['ubaidhullah bin Sa'id] dia berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari ['ubaidhullah bin Al Akhnas] dari [Nafi'] dari [Ibnu 'Umar] bahwa Nabi shallallahu 'alaihi wasallam melaksanakan witir di atas unta tunggangannya."
            },
            {
                "number": 1637,
                "arab": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ قَالَ حَدَّثَنَا زُهَيْرٌ عَنْ الْحَسَنِ بْنِ الْحُرِّ عَنْ نَافِعٍأَنَّ ابْنَ عُمَرَ كَانَ يُوتِرُ عَلَى بَعِيرِهِ وَيَذْكُرُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ",
                "id": "Telah mengabarkan kepada kami [Ibrahim bin Ya'qub] dia berkata; telah mengabarkan kepadaku ['Abdullah bin Muhammad bin 'Ali] dia berkata; telah menceritakan kepada kami [Zuhair] dari [Al Hasan bin Al Hurr] dari [Nafi'] bahwasanya [Ibnu 'Umar] melaksanakan witir di atas untanya, dan dia berkata; Bahwa Nabi shallallahu 'alaihi wasallam pernah melakukan demikian."
            },
            {
                "number": 1638,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا مَالِكٌ عَنْ أَبِي بَكْرِ بْنِ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ عَنْ سَعِيدِ بْنِ يَسَارٍ قَالَ قَالَ لِي ابْنُ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوتِرُ عَلَى الْبَعِيرِ",
                "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Malik] dari [Abu Bakr bin 'Umar bin 'Abdurrahman bin 'Abdullah bin 'Umar bin Al Khaththab] dari [Sa'id bin Yasar] dia berkata; [Ibnu 'Umar] berkata kepadaku; \"Rasulullah shallallahu 'alaihi wasallam pernah melaksanakan witir di atas untanya.\""
            },
            {
                "number": 1639,
                "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي التَّيَّاحِ عَنْ أَبِي مِجْلَزٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْوِتْرُ رَكْعَةٌ مِنْ آخِرِ اللَّيْلِ",
                "id": "Telah mengabarkan kepada kami [Muhammad bin Yahya bin 'Abdullah] dia berkata; telah menceritakan kepada kami [Wahb bin Jarir] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Abu At Tayyah] dari [Abu Mijlaz] dari [Ibnu 'Umar] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Witir itu satu raka? t pada akhir malam.\""
            }
        ]
    }
}