{
    "status": true,
    "data": {
        "start": 1306,
        "end": 1450,
        "total": 145,
        "book": "tirmidzi",
        "hadits": [
            {
                "number": 1306,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى السِّينَانِيُّ أَخْبَرَنَا شَرِيكٌ عَنْ شُعْبَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يُحَرِّمْ الْمُزَارَعَةَ وَلَكِنْ أَمَرَ أَنْ يَرْفُقَ بَعْضُهُمْ بِبَعْضٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَحَدِيثُ رَافِعٍ فِيهِ اضْطِرَابٌ يُرْوَى هَذَا الْحَدِيثُ عَنْ رَافِعِ بْنِ خَدِيجٍ عَنْ عُمُومَتِهِ وَيُرْوَى عَنْهُ عَنْ ظُهَيْرِ بْنِ رَافِعٍ وَهُوَ أَحَدُ عُمُومَتِهِ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْهُ عَلَى رِوَايَاتٍ مُخْتَلِفَةٍ وَفِي الْبَاب عَنْ زَيْدِ بْنِ ثَابِتٍ وَجَابِرٍ رَضِيَ اللَّهُ عَنْهُمَا",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan], telah mengabarkan kepada kami [Al Fadlal bin Musa As Sinani], telah mengabarkan kepada kami [Syarik] dari [Syu'bah] dari [Amru bin Dinar] dari [Thawus] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam tidak mengharamkan muzara'ah namun beliau memerintahkan untuk menjadi teman sebagian mereka dengan sebagian yang lain. Abu Isa berkata; Hadits ini hasan shahih sedangkan hadits Rafi' terdapat kegoncangan di dalamnya. Hadits ini diriwayatkan dari Rafi' bin Khadij dari paman-pamannya dan diriwayatkan darinya juga dari Zhuhair bin Rafi', ia adalah salah seorang pamannya, hadits ini juga diriwayatkan darinya melalui jalur periwayatan yang berbeda. Dalam hal ini ada hadits serupa dari Zaid bin Tsabit dan Jabir radliallahu 'anhuma."
            },
            {
                "number": 1307,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ سَعِيدٍ الْكِنْدِيُّ الْكُوفِيُّ أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ عَنْ الْحَجَّاجِ عَنْ زَيْدِ بْنِ جُبَيْرٍ عَنْ خَشْفِ بْنِ مَالِكٍ قَال سَمِعْتُ ابْنَ مَسْعُودٍ قَالَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي دِيَةِ الْخَطَإِ عِشْرِينَ بِنْتَ مَخَاضٍ وَعِشْرِينَ بَنِي مَخَاضٍ ذُكُورًا وَعِشْرِينَ بِنْتَ لَبُونٍ وَعِشْرِينَ جَذَعَةً وَعِشْرِينَ حِقَّةًقَالَ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَخْبَرَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ وَأَبُو خَالِدٍ الْأَحْمَرُ عَنْ الْحَجَّاجِ بْنِ أَرْطَاةَ نَحْوَهُ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ مَسْعُودٍ لَا نَعْرِفُهُ مَرْفُوعًا إِلَّا مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ عَنْ عَبْدِ اللَّهِ مَوْقُوفًا وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ إِلَى هَذَا وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَقَ وَقَدْ أَجْمَعَ أَهْلُ الْعِلْمِ عَلَى أَنَّ الدِّيَةَ تُؤْخَذُ فِي ثَلَاثِ سِنِينَ فِي كُلِّ سَنَةٍ ثُلُثُ الدِّيَةِ وَرَأَوْا أَنَّ دِيَةَ الْخَطَإِ عَلَى الْعَاقِلَةِ وَرَأَى بَعْضُهُمْ أَنَّ الْعَاقِلَةَ قَرَابَةُ الرَّجُلِ مِنْ قِبَلِ أَبِيهِ وَهُوَ قَوْلُ مَالِكٍ وَالشَّافِعِيِّ و قَالَ بَعْضُهُمْ إِنَّمَا الدِّيَةُ عَلَى الرِّجَالِ دُونَ النِّسَاءِ وَالصِّبْيَانِ مِنْ الْعَصَبَةِ يُحَمَّلُ كُلُّ رَجُلٍ مِنْهُمْ رُبُعَ دِينَارٍ وَقَدْ قَالَ بَعْضُهُمْ إِلَى نِصْفِ دِينَارٍ فَإِنْ تَمَّتْ الدِّيَةُ وَإِلَّا نُظِرَ إِلَى أَقْرَبِ الْقَبَائِلِ مِنْهُمْ فَأُلْزِمُوا ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ali bin Sa'id Al Kindi Al Kufi], telah mengabarkan kepada kami [Ibnu Abu Za`idah] dari [Al Hajjaj] dari [Zaid bin Jubair] dari [Khasyf bin Malik] ia berkata; Aku mendengar [Ibnu Mas'ud] berkata; Rasulullah shallallahu 'alaihi wasallam menetapkan hukum diyat bagi orang yang salah sebesar dua puluh unta betina berumur dua tahun, dua puluh unta jantan berumur dua tahun, dua puluh unta betina berumur tiga tahun, dua puluh unta betina berumur lima tahun dan dua puluh unta betina berumur empat tahun. Ia mengatakan; Dalam hal ini ada hadits serupa dari Abdullah bin Amr. Telah mengabarkan kepada kami [Abu Hisyam Ar Rifa'i], telah mengabarkan kepada kami [Ibnu Abu Za`idah] dan [Abu Khalid Al Ahmar] dari [Al Hajjaj bin Arthah] seperti itu. Abu Isa berkata; Hadits Ibnu Mas'ud tidak kami ketahui secara marfu' kecuali dari jalur ini dan telah diriwayatkan dari Abdullah secara mauquf. Sebagian ulama berpendapat seperti itu, ini menjadi pendapat Ahmad dan Ishaq, namun sebagian ulama bersepakat bahwa diyat diambil selama tiga tahun, setiap tahun dibayar sepertiga diyat. Mereka berpendapat bahwa diyat bagi orang yang salah dikenakan terhadap anak yang mencapai masa dewasa, sebagian mereka berpendapat bahwa anak yang mencapai masa dewasa menyamai seorang laki-laki dari jalur ayahnya. Ini menjadi pendapat Malik dan Asy Syafi'i. Sebagian mereka berpendapat; Sesungguhnya diyat hanya dikenakan terhadap orang laki-laki, tidak kepada perempuan dan anak-anak dari keturunan. Setiap orang laki-laki dari mereka dikenakan seperempat dinar. Sebagian mereka berpendapat; Setengah dinar, jika telah sempurna diyatnya kecuali dilihat dari kabilah yang paling dekat dari mereka, maka mereka berhak membayarnya."
            },
            {
                "number": 1308,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ أَخْبَرَنَا حَبَّانُ وَهُوَ ابْنُ هِلَالٍ حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ أَخْبَرَنَا سُلَيْمَانُ بْنُ مُوسَى عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَتَلَ مُؤْمِنًا مُتَعَمِّدًا دُفِعَ إِلَى أَوْلِيَاءِ الْمَقْتُولِ فَإِنْ شَاءُوا قَتَلُوا وَإِنْ شَاءُوا أَخَذُوا الدِّيَةَ وَهِيَ ثَلَاثُونَ حِقَّةً وَثَلَاثُونَ جَذَعَةً وَأَرْبَعُونَ خَلِفَةً وَمَا صَالَحُوا عَلَيْهِ فَهُوَ لَهُمْ وَذَلِكَ لِتَشْدِيدِ الْعَقْلِقَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ بْنِ عَمْرٍو حَدِيثٌ حَسَنٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Ad Darimi], telah mengabarkan kepada kami [Habban], ia adalah Ibnu Hilal telah menceritakan kepada kami [Muhammad bin Rasyid] telah mengabarkan kepada kami [Sulaiman bin Musa] dari [Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang membunuh seorang mukmin secara sengaja, maka ia diserahkan kepada wali dari orang yang dibunuh, jika mereka mau boleh membunuhnya, dan jika mereka mau boleh mengambil diyatnya sebesar tiga puluh unta betina berumur empat tahun, tiga puluh unta betina berumur lima tahun atau empat puluh unta betina yang bunting, adapun jika mereka berdamai dengannya maka itu hak mereka, hal itu merupakan bentuk diat (hukuman yang berat).\" Abu Isa berkata; Hadits Abdullah bin Amr adalah hadits hasan gharib."
            },
            {
                "number": 1309,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُعَاذُ بْنُ هَانِئٍ حَدَّثَنَا مُحَمَّدُ بْنُ مُسْلِمٍ الطَّائِفِيُّ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ جَعَلَ الدِّيَةَ اثْنَيْ عَشَرَ أَلْفًاحَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عِكْرِمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ وَلَمْ يَذْكُرْ فِيهِ عَنْ ابْنِ عَبَّاسٍ وَفِي حَدِيثِ ابْنِ عُيَيْنَةَ كَلَامٌ أَكْثَرُ مِنْ هَذَا قَالَ أَبُو عِيسَى وَلَا نَعْلَمُ أَحَدًا يَذْكُرُ فِي هَذَا الْحَدِيثِ عَنْ ابْنِ عَبَّاسٍ غَيْرَ مُحَمَّدِ بْنِ مُسْلِمٍ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَقَ وَرَأَى بَعْضُ أَهْلِ الْعِلْمِ الدِّيَةَ عَشْرَةَ آلَافٍ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ و قَالَ الشَّافِعِيُّ لَا أَعْرِفُ الدِّيَةَ إِلَّا مِنْ الْإِبِلِ وَهِيَ مِائَةٌ مِنْ الْإِبِلِ أَوْ قِيمَتُهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Mu'adz bin Hani`], telah menceritakan kepada kami [Muhammad bin Muslim Ath Tha`ifi] dari [Amr bin Dinar] dari [Ikrimah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam bahwa beliau menetapkan diyat sebesar dua belas ribu. Telah menceritakan kepada kami [Sa'id bin Abdurrahman Al Makhzumi], telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Amru bin Dinar] dari [Ikrimah] dari Nabi shallallahu 'alaihi wasallam seperti itu namun tidak disebutkan di dalamnya dari Ibnu Abbas. Dalam Ibnu Uyainah terdapat komentar lebih banyak dari hadits ini. Abu Isa berkata; Kami tidak mengetahui seorang pun menyebutkan tentang hadits ini dari Ibnu Abbas selain Muhammad bin Muslim. Hadits ini diamalkan oleh sebagian ulama dan juga merupakan pendapat Ahmad dan Ishaq. Sedangkan sebagian ulama berpendapat bahwa diyat sebesar sepuluh ribu dirham, ini menjadi pendapat Sufyan Ats Tsauri dan ulama Kufah. Adapun Asy Syafi'i berkata; Aku tidak mengetahui diyat kecuali dari unta yaitu sebesar seratus ekor unta atau seharga dengannya."
            },
            {
                "number": 1310,
                "arab": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ أَخْبَرَنَا حُسَيْنٌ الْمُعَلِّمُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْمَوَاضِحِ خَمْسٌ خَمْسٌقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ أَنَّ فِي الْمُوضِحَةِ خَمْسًا مِنْ الْإِبِلِ",
                "id": "Telah menceritakan kepada kami [Humaid bin Mas'adah], telah mengabarkan kepada kami [Yazid bin Zurai'] telah mengabarkan kepada kami [Husain Al Mu'allim] dari [Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Nabi shallallahu 'alaihi wasallam bersabda tentang luka-luka yang menampakkan tulang: \"Diyatnya lima, lima.\" Abu Isa berkata; Hadits ini hasan dan diamalkan oleh para ulama dan merupakan pendapat Sufyan Ats Tsauri, Asy Syafi'i, Ahmad dan Ishaq bahwa untuk luka-luka yang menampakkan tulang adalah sebesar lima ekor unta."
            },
            {
                "number": 1311,
                "arab": "حَدَّثَنَا أَبُو عَمَّارٍ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ الْحُسَيْنِ بْنِ وَاقِدٍ عَنْ يَزِيدَ بْنِ عَمْرٍو النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي دِيَةِ الْأَصَابِعِ الْيَدَيْنِ وَالرِّجْلَيْنِ سَوَاءٌ عَشْرٌ مِنْ الْإِبِلِ لِكُلِّ أُصْبُعٍقَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ أَبِي مُوسَى وَعَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ وَبِهِ يَقُولُ سُفْيَانُ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَقُ",
                "id": "Telah menceritakan kepada kami [Abu Ammar], telah menceritakan kepada kami [Al Fadlal bin Musa] dari [Al Husain bin Waqid] dari [Yazid bin Amr An Nahwi] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda tentang diyat jari-jari kedua tangan dan kaki: \"Diyatnya sama yaitu sebesar sepuluh ekor unta pada setiap jari.\" Abu Isa berkata; Dalam hal ini ada hadits serupa dari Abu Musa dan Abdullah bin Amr. Abu Isa berkata; Hadits Ibnu Abbas adalah hadits hasan shahih gharib dari jalur ini dan diamalkan oleh para ulama dan juga merupakan pendapat Sufyan, Asy Syafi'i, Ahmad dan Ishaq."
            },
            {
                "number": 1312,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ جَعْفَرٍ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هَذِهِ وَهَذِهِ سَوَاءٌ يَعْنِي الْخِنْصَرَ وَالْإِبْهَامَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Yahya bin Sa'id] dan [Muhammad bin Ja'far] keduanya berkata; Telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ini dan ini adalah sama, yakni jari kelingking dan ibu jari.\" Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 1313,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ حَدَّثَنَا أَبُو السَّفَرِ قَالَدَقَّ رَجُلٌ مِنْ قُرَيْشٍ سِنَّ رَجُلٍ مِنْ الْأَنْصَارِ فَاسْتَعْدَى عَلَيْهِ مُعَاوِيَةَ فَقَالَ لِمُعَاوِيَةَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّ هَذَا دَقَّ سِنِّي قَالَ مُعَاوِيَةُ إِنَّا سَنُرْضِيكَ وَأَلَحَّ الْآخَرُ عَلَى مُعَاوِيَةَ فَأَبْرَمَهُ فَلَمْ يُرْضِهِ فَقَالَ لَهُ مُعَاوِيَةُ شَأْنَكَ بِصَاحِبِكَ وَأَبُو الدَّرْدَاءِ جَالِسٌ عِنْدَهُ فَقَالَ أَبُو الدَّرْدَاءِ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَمِعَتْهُ أُذُنَايَ وَوَعَاهُ قَلْبِي يَقُولُ مَا مِنْ رَجُلٍ يُصَابُ بِشَيْءٍ فِي جَسَدِهِ فَيَتَصَدَّقُ بِهِ إِلَّا رَفَعَهُ اللَّهُ بِهِ دَرَجَةً وَحَطَّ عَنْهُ بِهِ خَطِيئَةًقَالَ الْأَنْصَارِيُّ أَأَنْتَ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَمِعَتْهُ أُذُنَايَ وَوَعَاهُ قَلْبِي قَالَ فَإِنِّي أَذَرُهَا لَهُ قَالَ مُعَاوِيَةُ لَا جَرَمَ لَا أُخَيِّبُكَ فَأَمَرَ لَهُ بِمَالٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَلَا أَعْرِفُ لِأَبِي السَّفَرِ سَمَاعًا مِنْ أَبِي الدَّرْدَاءِ وَأَبُو السَّفَرِ اسْمُهُ سَعِيدُ بْنُ أَحْمَدَ وَيُقَالُ ابْنُ يُحْمِدَ الثَّوْرِيُّ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad], telah menceritakan kepada kami [Abdullah bin Al Mubarak], telah menceritakan kepada kami [Yunus bin Abu Ishaq] telah menceritakan kepada kami [Abu As Safar] ia berkata; Orang Quraisy memukul gigi orang Anshar, lalu ia melaknat dan meminta pertolongan kepada Mu'wiyah. Ia pun berkata kepada Mu'awiyah; Wahai Amirul Mukminin, sesungguhnya orang ini telah memukul gigiku. Mu'awiyah berkata; Sesungguhnya kami meridlaimu. Yang lain mendesak Mu'awiyah dan menyampaikan kepadanya namun ia tidak meridlainya, Mu'awiyah pun berkata kepadanya; Urusanmu dengan temanmu. Saat itu Abu Ad Darda` duduk di sebelahnya, [Abu Ad Darda`] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam, ia melanjutkan; Kedua telingaku mendengar dan hatiku memperhatikan, beliau bersabda: \"Tidaklah seseorang yang terkena sesuatu pada tubuhnya lalu ia bersedekah dengannya (tidak menuntutnya), melainkan Allah akan mengangkatnya beberapa derajat dan menghapuskan kesalahan-kesalahannya.\" Orang Anshar itu bertanya; Benarkah engkau mendengarnya dari Rasulullah shallallahu 'alaihi wasallam? Ia menjawab; Kedua telingaku mendengar dan hatiku memperhatikannya. Ia berkata; Aku memaafkannya. Mu'awiyah berkata; Pasti aku tidak akan mengecewakanmu. Lalu ia menyuruh memberikan harta kepadanya. Abu Isa berkata; Hadits ini gharib tidak kami ketahui kecuali dari jalur ini dan aku tidak tahu Abu As Safar memiliki hadits yang didengar dari Abu Ad Darda`. Abu As Safar bernama Sa'id bin Ahmad dan ia dipanggil Ibnu Yuhmida Ats Tsauri."
            },
            {
                "number": 1314,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَخَرَجَتْ جَارِيَةٌ عَلَيْهَا أَوْضَاحٌ فَأَخَذَهَا يَهُودِيٌّ فَرَضَخَ رَأْسَهَا بِحَجَرٍ وَأَخَذَ مَا عَلَيْهَا مِنْ الْحُلِيِّ قَالَ فَأُدْرِكَتْ وَبِهَا رَمَقٌ فَأُتِيَ بِهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ قَتَلَكِ أَفُلَانٌ قَالَتْ بِرَأْسِهَا لَا قَالَ فَفُلَانٌ حَتَّى سُمِّيَ الْيَهُودِيُّ فَقَالَتْ بِرَأْسِهَا أَيْ نَعَمْ قَالَ فَأُخِذَ فَاعْتَرَفَ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُضِخَ رَأْسُهُ بَيْنَ حَجَرَيْنِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَقَ و قَالَ بَعْضُ أَهْلِ الْعِلْمِ لَا قَوَدَ إِلَّا بِالسَّيْفِ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr], telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Anas] ia berkata; Seorang budak perempuan keluar dengan memakai perhiasan yang terbuat dari perak, lalu perhiasan itu ditarik oleh seorang yahudi sambil memukul kepala perempuan tersebut dengan batu lalu mengambil perhiasannya. Wanita tersebut ditemukan dalam keadaan pingsan, lalu dibawa menghadap kepada Rasulullah shallallahu 'alaihi wasallam, maka Nabi bertanya, apakah kamu dibunuh oleh si fulan? Wanita itu menjawab, Tidak, dengan menggunakan isyarat kepalanya (menggelengkan kepala), Nabi bertanya lagi, apakah si fulan? Hingga disebutkan nama seorang yahudi, lalu wanita itu menjawab, Iya, dengan menggunakan isyarat kepalanya. Lalu, orang yahudi tersebut dipanggil, dan ia pun mengakui atas perbuatannya. Lalu, Nabi memerintahkan untuk mengqishasnya, dengan membenturkan kepalanya di antara dua buah batu. Abu Isa berkata, \"Hadits ini hasan shahih, dan sebagian ulama menjadikannya sebagai landasan amal, ini merupakan pendapat Ahmad dan Ishaq. Ada sebagian ulama yang mengatakan, tidak ada balasan baginya kecuali dengan pedang."
            },
            {
                "number": 1315,
                "arab": "حَدَّثَنَا أَبُو سَلَمَةَ يَحْيَى بْنُ خَلَفٍ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ قَالَا حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَزَوَالُ الدُّنْيَا أَهْوَنُ عَلَى اللَّهِ مِنْ قَتْلِ رَجُلٍ مُسْلِمٍحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو نَحْوَهُ وَلَمْ يَرْفَعْهُ قَالَ أَبُو عِيسَى وَهَذَا أَصَحُّ مِنْ حَدِيثِ ابْنِ أَبِي عَدِيٍّ قَالَ وَفِي الْبَاب عَنْ سَعْدٍ وَابْنِ عَبَّاسٍ وَأَبِي سَعِيدٍ وَأَبِي هُرَيْرَةَ وَعُقْبَةَ بْنِ عَامِرٍ وَابْنِ مَسْعُودٍ وَبُرَيْدَةَ قَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ بْنِ عَمْرٍو هَكَذَا رَوَاهُ ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَوَى مُحَمَّدُ بْنُ جَعْفَرٍ وَغَيْرُ وَاحِدٍ عَنْ شُعْبَةَ عَنْ يَعْلَى بْنِ عَطَاءٍ فَلَمْ يَرْفَعْهُ وَهَكَذَا رَوَى سُفْيَانُ الثَّوْرِيُّ عَنْ يَعْلَى بْنِ عَطَاءٍ مَوْقُوفًا وَهَذَا أَصَحُّ مِنْ الْحَدِيثِ الْمَرْفُوعِ",
                "id": "Telah menceritakan kepada kami [Abu Salamah Yahya bin Khalaf] dan [Muhammad bin Abdullah bin Bazi'] keduanya berkata; Telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Syu'bah] dari [Ya'la bin 'Atha`] dari [ayahnya] dari [Abdullah bin Amr] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sungguh, hancurnya dunia bagi Allah lebih ringan dari pada pembunuhan seorang muslim.\" Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin 'Atha`] dari [ayahnya] dari [Abdullah bin Amru] seperti itu namun ia tidak memarfu'kannya. Abu 'Isa berkata; Hadits ini lebih shahih dari Hadits Ibnu Abu 'Adi. Ia mengatakan; Dalam hal ini ada hadits serupa dari Sa'd, Ibnu Abbas, Abu Sa'id Abu Hurairah, Uqbah bin Amir, Ibnu Mas'ud dan Buraidah. Abu 'Isa berkata; Hadits Abdullah bin Amru adalah seperti ini, Ibnu Abu Adi meriwayatkannya dari Syu'bah dari Ya'la bin 'Atha` dari ayahnya dari Abdullah bin Amr dari Nabi shallallahu 'alaihi wasallam. Muhammad bin Ja'far dan lainnya juga meriwayatkan dari Syu'bah dari Ya'la bin 'Atha` namun ia tidak memarfu'kannya. Demikian juga Sufyan Ats Tsauri meriwayatkan dari Ya'la bin 'Atha` secara mauquf dan riwayat ini lebih shahih dari pada hadits yang marfu'."
            },
            {
                "number": 1316,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا شُعْبَةُ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَوَّلَ مَا يُحْكَمُ بَيْنَ الْعِبَادِ فِي الدِّمَاءِقَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ حَدِيثٌ حَسَنٌ صَحِيحٌ وَهَكَذَا رَوَى غَيْرُ وَاحِدٍ عَنْ الْأَعْمَشِ مَرْفُوعًا وَرَوَى بَعْضُهُمْ عَنْ الْأَعْمَشِ وَلَمْ يَرْفَعُوهُ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan], telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Syu'bah] dari [Al A'masy] dari [Abu Wa`il] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya yang pertama kali akan diputuskan di antara para hamba adalah masalah darah (qishas).\" Abu 'Isa berkata; Hadits Abdullah adalah hadits hasan shahih, demikianlah banyak perawi meriwayatkan dari Al A'masy secara marfu', namun sebagian mereka meriwayatkan dari Al A'masy dan tidak memarfu'kannya."
            },
            {
                "number": 1317,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَوَّلَ مَا يُقْضَى بَيْنَ الْعِبَادِ فِي الدِّمَاءِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib], telah menceritakan kepada kami [Waki'] dari [Al A'masy] dari [Abu Wa`il] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya yang pertama kali akan diputuskan di antara para hamba adalah masalah darah (qishas).\""
            },
            {
                "number": 1318,
                "arab": "حَدَّثَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ الْحُسَيْنِ بْنِ وَاقِدٍ عَنْ يَزِيدَ الرَّقَاشِيِّ حَدَّثَنَا أَبُو الْحَكَمِ الْبَجَلِيُّ قَال سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ وَأَبَا هُرَيْرَةَ يَذْكُرَانِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَنَّ أَهْلَ السَّمَاءِ وَأَهْلَ الْأَرْضِ اشْتَرَكُوا فِي دَمِ مُؤْمِنٍ لَأَكَبَّهُمْ اللَّهُ فِي النَّارِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَأَبُو الْحَكَمِ الْبَجَلِيُّ هُوَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي نُعْمٍ الْكُوفِيُّ",
                "id": "Telah menceritakan kepada kami [Al Husain bin Huraits], telah menceritakan kepada kami [Al Fadlal bin Musa] dari [Al Husain bin Waqid] dari [Yazid Ar Raqasyi], telah menceritakan kepada kami [Abu Al Hakam Al Bajali] ia berkata; Aku mendengar [Abu Sa'id Al Khudri] dan [Abu Hurairah] keduanya menyebutkan dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Seandainya penduduk langit dan penduduk bumi bersekutu untuk membunuh seorang mukmin, niscaya Allah akan menjerumuskan mereka ke neraka.\" Abu 'Isa berkata; Hadits ini gharib, Abu Al Hakam Al Bajali adalah Abdurrahman bin Abu Nu'm Al Kufi."
            },
            {
                "number": 1319,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنَا الْمُثَنَّى بْنُ الصَّبَّاحِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ سُرَاقَةَ بْنِ مَالِكِ بْنِ جُعْشَمٍ قَالَحَضَرْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقِيدُ الْأَبَ مِنْ ابْنِهِ وَلَا يُقِيدُ الِابْنَ مِنْ أَبِيهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ مِنْ حَدِيثِ سُرَاقَةَ إِلَّا مِنْ هَذَا الْوَجْهِ وَلَيْسَ إِسْنَادُهُ بِصَحِيحٍ رَوَاهُ إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ الْمُثَنَّى بْنِ الصَّبَّاحِ وَالْمُثَنَّى بْنُ الصَّبَّاحِ يُضَعَّفُ فِي الْحَدِيثِ وَقَدْ رَوَى هَذَا الْحَدِيثَ أَبُو خَالِدٍ الْأَحْمَرُ عَنْ الْحَجَّاجِ بْنِ أَرْطَاةَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عَمْرِو بْنِ شُعَيْبٍ مُرْسَلًا وَهَذَا حَدِيثٌ فِيهِ اضْطِرَابٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ أَنَّ الْأَبَ إِذَا قَتَلَ ابْنَهُ لَا يُقْتَلُ بِهِ وَإِذَا قَذَفَ ابْنَهُ لَا يُحَدُّ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr], telah menceritakan kepada kami [Isma'il bin 'Ayyasy] telah menceritakan kepada kami [Al Mutsanna bin Ash Shabbah] dari [Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] dari [Suraqah bin Malik bin Ju'syam] ia berkata; Aku menyaksikan Rasulullah shallallahu 'alaihi wasallam menetapkan qishash untuk bapak karena dibunuh anaknya, namun tidak mengqishash untuk anak karena dibunuh bapaknya. Abu 'Isa berkata; Hadits ini tidak kami ketahui dari Suraqah kecuali dari jalur ini dan sanadnya tidak shahih, Isma'il bin 'Ayyasy meriwayatkan dari Al Mutsanna bin Ash Shabbah sedangkan Al Mutsanna bin Ash Shabbah didla'ifkan dalam periwayatan hadits. Dan [Abu Khalid Al Ahmar] telah meriwayatkan hadits ini dari [Al Hajjaj bin Arthah] dari [Amru bin Syu'aib] dari [ayahnya] dari [kakeknya] dari [Umar] dari Nabi shallallahu 'alaihi wasallam. Hadits ini juga telah diriwayatkan dari Amru bin Syu'aib secara mursal dan dalam hadits ini terdapat kegoncangan serta hadits ini menjadi pedoman amal menurut para ulama bahwa seorang bapak jika membunuh anaknya, ia tidak dibunuh dan jika menuduh anaknya berzina, ia tidak dijatuhi hukuman had."
            },
            {
                "number": 1320,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ عَنْ الْحَجَّاجِ بْنِ أَرْطَاةَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يُقَادُ الْوَالِدُ بِالْوَلَدِ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id Al Asyajj], telah menceritakan kepada kami [Abu Khalid Al Ahmar] dari [Al Hajjaj bin Arthah] dari [Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] dari [Umar bin Al Khaththab] ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang bapak tidak dijatuhi hukuman dengan membunuh anaknya.\""
            },
            {
                "number": 1321,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ إِسْمَعِيلَ بْنِ مُسْلِمٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُقَامُ الْحُدُودُ فِي الْمَسَاجِدِ وَلَا يُقْتَلُ الْوَالِدُ بِالْوَلَدِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ بِهَذَا الْإِسْنَادِ مَرْفُوعًا إِلَّا مِنْ حَدِيثِ إِسْمَعِيلَ بْنِ مُسْلِمٍ وَإِسْمَعِيلُ بْنُ مُسْلِمٍ الْمَكِّيُّ قَدْ تَكَلَّمَ فِيهِ بَعْضُ أَهْلِ الْعِلْمِ مِنْ قِبَلِ حِفْظِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Isma'il bin Muslim] dari [Amr bin Dinar] dari [Thawus] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Hukuman tidak boleh dilaksanakan di dalam masjid, dan seorang bapak tidak boleh dihukum bunuh (qishas) karena membunuh anaknya.\" Abu 'Isa berkata; Hadits ini tidak kami ketahui dengan sanad ini secara marfu' kecuali dari Hadits Isma'il bin Muslim dan Isma'il bin Muslim Al Makki telah dicela oleh sebagian ulama dari segi hafalannya."
            },
            {
                "number": 1322,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ إِلَّا بِإِحْدَى ثَلَاثٍ الثَّيِّبُ الزَّانِي وَالنَّفْسُ بِالنَّفْسِ وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِقَالَ وَفِي الْبَاب عَنْ عُثْمَانَ وَعَائِشَةَ وَابْنِ عَبَّاسٍ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ مَسْعُودٍ حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Hannad], telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abdullah bin Murrah] dari [Masruq] dari [Abdullah bin Mas'ud] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal darah seorang muslim yang bersaksi bahwa tidak ada sesembahan yang haq selain Allah dan aku adalah utusan Allah kecuali salah satu dari tiga orang; Orang tua yang berzina, jiwa dibalas dengan jiwa (orang yang membunuh orang lain), dan orang yang murtad dari agamanya memisahkan diri dari jama'ah muslimin.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Utsman, A`isyah dan Ibnu Abbas. Abu 'Isa berkata; Hadits Ibnu Mas'ud adalah hadits shahih."
            },
            {
                "number": 1323,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مَعْدِيُّ بْنُ سُلَيْمَانَ هُوَ الْبَصْرِيُّ عَنْ ابْنِ عَجْلَانَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَا مَنْ قَتَلَ نَفْسًا مُعَاهِدًا لَهُ ذِمَّةُ اللَّهِ وَذِمَّةُ رَسُولِهِ فَقَدْ أَخْفَرَ بِذِمَّةِ اللَّهِ فَلَا يُرَحْ رَائِحَةَ الْجَنَّةِ وَإِنَّ رِيحَهَا لَيُوجَدُ مِنْ مَسِيرَةِ سَبْعِينَ خَرِيفًاقَالَ وَفِي الْبَاب عَنْ أَبِي بَكْرَةَ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Ma'di bin Sulaiman], ia adalah Al Bashri, dari [Ibnu 'Ajlan] dari [ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ketahuilah, barangsiapa membunuh seseorang yang terikat janji dengan kaum muslimin dan memiliki jaminan keamanan dari Allah dan RasulNya, maka ia telah melanggar perlindungan Allah dan ia tidak akan mencium bau surga, dan sesungguhnya baunya dapat dicium sejauh perjalanan tujuh puluh masa.\" Abu 'Isa berkata; Hadits Abu Hurairah adalah hadits hasan shahih. Dan diriwayatkan juga melalui banyak jalur dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam."
            },
            {
                "number": 1324,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ عَنْ أَبِي سَعْدٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدَى الْعَامِرِيَّيْنِ بِدِيَةِ الْمُسْلِمِينَ وَكَانَ لَهُمَا عَهْدٌ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَأَبُو سَعْدٍ الْبَقَّالُ اسْمُهُ سَعِيدُ بْنُ الْمَرْزُبَانِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib], telah menceritakan kepada kami [Yahya bin Adam] dari [Abu Bakr bin 'Ayyasy] dari [Abu Sa'd] dari [Ikrimah] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam membayar diyat dua orang banu Amir sebesar diyat kaum muslimin, ketika itu keduanya terikat perjanjian dari Rasulullah shallallahu 'alaihi wasallam. Abu 'Isa berkata; Hadits ini gharib tidak kami ketahui kecuali dari jalur ini. Abu Sa'id Al Baqqal bernama Sa'id bin Marzuban."
            },
            {
                "number": 1325,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ وَيَحْيَى بْنُ مُوسَى قَالَا حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنِي أَبُو سَلَمَةَ حَدَّثَنِي أَبُو هُرَيْرَةَ قَالَلَمَّا فَتَحَ اللَّهُ عَلَى رَسُولِهِ مَكَّةَ قَامَ فِي النَّاسِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ وَمَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِمَّا أَنْ يَعْفُوَ وَإِمَّا أَنْ يَقْتُلَقَالَ وَفِي الْبَاب عَنْ وَائِلِ بْنِ حُجْرٍ وَأَنَسٍ وَأَبِي شُرَيْحٍ خُوَيْلِدِ بْنِ عَمْرٍو",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] dan [Yahya bin Musa] keduanya berkata; Telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepadaku [Yahya bin Abu Katsir] telah menceritakan kepadaku [Abu Salamah] telah menceritakan kepadaku [Abu Hurairah] ia berkata; Ketika Allah menaklukan Makkah atas RasulNya, beliau berdiri di hadapan manusia lalu beliau memuji Allah dan memujaNya kemudian beliau bersabda: \"Dan barangsiapa yang memiliki keluarga yang terbunuh maka ia memiliki dua pilihan yang baik, boleh ia memaafkan atau membunuh.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Wa`il bin Hujr, Anas, Abu Syuraih Khuwailid bin Amr."
            },
            {
                "number": 1326,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ عَنْ أَبِي شُرَيْحٍ الْكَعْبِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ حَرَّمَ مَكَّةَ وَلَمْ يُحَرِّمْهَا النَّاسُ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَسْفِكَنَّ فِيهَا دَمًا وَلَا يَعْضِدَنَّ فِيهَا شَجَرًا فَإِنْ تَرَخَّصَ مُتَرَخِّصٌ فَقَالَ أُحِلَّتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنَّ اللَّهَ أَحَلَّهَا لِي وَلَمْ يُحِلَّهَا لِلنَّاسِ وَإِنَّمَا أُحِلَّتْ لِي سَاعَةً مِنْ نَهَارٍ ثُمَّ هِيَ حَرَامٌ إِلَى يَوْمِ الْقِيَامَةِ ثُمَّ إِنَّكُمْ مَعْشَرَ خُزَاعَةَ قَتَلْتُمْ هَذَا الرَّجُلَ مِنْ هُذَيْلٍ وَإِنِّي عَاقِلُهُ فَمَنْ قُتِلَ لَهُ قَتِيلٌ بَعْدَ الْيَوْمِ فَأَهْلُهُ بَيْنَ خِيرَتَيْنِ إِمَّا أَنْ يَقْتُلُوا أَوْ يَأْخُذُوا الْعَقْلَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَحَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَرَوَاهُ شَيْبَانُ أَيْضًا عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ مِثْلَ هَذَا وَرُوِي عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قُتِلَ لَهُ قَتِيلٌ فَلَهُ أَنْ يَقْتُلَ أَوْ يَعْفُوَ أَوْ يَأْخُذَ الدِّيَةَ وَذَهَبَ إِلَى هَذَا بَعْضُ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَقَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Ibnu Abu Dzi`b], telah menceritakan kepadaku [Sa'id bin Abu Sa'id Al Maqburi] dari [Abu Syuraih Al Ka'bi] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah menyucikan Makkah namun manusia tidak menyucikannya. Barangsiapa yang beriman kepada Allah dan hari akhir, maka janganlah ia menumpahkan darah di dalamnya dan tidak menebangi pepohonannya.\" Beliau melanjutkan: \"Telah dihalalkan untuk Rasulullah shallallahu 'alaihi wasallam, karena sesungguhnya Allah telah menghalalkannya untukku, namun tidak dihalalkan untuk manusia. Dan sesungguhnya telah dihalalkan untukku sesaat pada siang hari kemudian hal itu menjadi haram hingga hari kiamat, setelah itu kalian akan dikumpulkan dalam keadaan saling mencela, kalian akan membunuh orang dari Hudzail ini, sedangkan aku yang melaksanakan diyatnya, Barangsiapa yang dibunuh setelah hari ini, maka keluarnya berhak atas pembunuh itu untuk memilih dua pilihan, yakni mereka membunuhnya atau mengambil diyat darinya.\" Abu 'Isa berkata; Hadits ini hasan shahih dan Hadits Abu Hurairah adalah hadits hasan shahih. Syaiban juga meriwayatkannya dari Yahya bin Abu Katsir seperti ini dan telah diriwayatkan dari Abu Syuraih Al Khuza'i dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang dibunuh, maka keluarnya berhak atas pembunuh itu untuk memilih antara membunuh, memaafkan, atau mengambil diyat.\" Dan inilah pendapat ulama, dan termasuk juga pendapat Ahmad dan Ishaq."
            },
            {
                "number": 1327,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقُتِلَ رَجُلٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدُفِعَ الْقَاتِلُ إِلَى وَلِيِّهِ فَقَالَ الْقَاتِلُ يَا رَسُولَ اللَّهِ وَاللَّهِ مَا أَرَدْتُ قَتْلَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَا إِنَّهُ إِنْ كَانَ قَوْلُهُ صَادِقًا فَقَتَلْتَهُ دَخَلْتَ النَّارَ فَخَلَّى عَنْهُ الرَّجُلُ قَالَ وَكَانَ مَكْتُوفًا بِنِسْعَةٍ قَالَ فَخَرَجَ يَجُرُّ نِسْعَتَهُ قَالَ فَكَانَ يُسَمَّى ذَا النِّسْعَةِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالنِّسْعَةُ حَبْلٌ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib], telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Ada seseorang terbunuh pada zaman Nabi shallallahu 'alaihi wasallam lalu pembunuh itu diserahkan kepada wali yang dibunuh. Pembunuh berkata; Wahai Rasulullah, demi Allah, aku tidak bermaksud membunuhnya. Maka Rasulullah shallallahu 'alaihi wasallam mengatakan: \"Jika perkataannya benar lalu engkau membunuhnya, maka engkau akan masuk neraka.\" Lalu walinya melepasnya. Abu Hurairah berkata; Ketika itu tangan si pembunuh terikat ke belakang dengan tali dari kulit, ia melanjutkan; Lalu ia pergi dengan menyeret tali tersebut. Ia berkata; Setelah itu ia dipanggil dengan orang yang memiliki tali kulit. Abu 'Isa berkata; Hadits ini hasan shahih. An Nis'ah artinya tali."
            },
            {
                "number": 1328,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَعَثَ أَمِيرًا عَلَى جَيْشٍ أَوْصَاهُ فِي خَاصَّةِ نَفْسِهِ بِتَقْوَى اللَّهِ وَمَنْ مَعَهُ مِنْ الْمُسْلِمِينَ خَيْرًا فَقَالَ اغْزُوا بِسْمِ اللَّهِ وَفِي سَبِيلِ اللَّهِ قَاتِلُوا مَنْ كَفَرَ اغْزُوا وَلَا تَغُلُّوا وَلَا تَغْدِرُوا وَلَا تُمَثِّلُوا وَلَا تَقْتُلُوا وَلِيدًا وَفِي الْحَدِيثِ قِصَّةٌقَالَ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ وَشَدَّادِ بْنِ أَوْسٍ وَعِمْرَانَ بْنِ حُصَيْنٍ وَأَنَسٍ وَسَمُرَةَ وَالْمُغِيرَةِ وَيَعْلَى بْنِ مُرَّةَ وَأَبِي أَيُّوبَ قَالَ أَبُو عِيسَى حَدِيثُ بُرَيْدَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَكَرِهَ أَهْلُ الْعِلْمِ الْمُثْلَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan] dari ['Alqamah bin Martsad] dari [Sulaiman bin Buraidah] dari [ayahnya] ia berkata; Rasulullah shallallahu 'alaihi wasallam jika mengutus pimpinan pasukan, beliau memberi wasiat khusus untuk dirinya untuk bertaqwa kepada Allah dan wasiat kebaikan kepada kaum muslimin yang bersamanya. Beliau bersabda: \"Berperanglah dengan nama Allah dan di Jalan Allah, perangilah orang yang kafir, berperanglah dan janganlah melampaui batas, berkhianat, memutilasi dan janganlah membunuh anak-anak.\" Dalam hadits ini terdapat kisah. Ia mengatakan; Dalam hal ini ada hadits serupa dari Abdullah bin Mas'ud, Syaddad bin Aus, Imran bin Hushain, Anas, Samurah, Al Mughirah, Ya'la bin Murrah dan Abu Ayyub. Abu 'Isa berkata; Hadits Buraidah adalah hadits hasan shahih. Para ulama memakruhkan Al Mutslah."
            },
            {
                "number": 1329,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا خَالِدٌ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ عَنْ شَدَّادِ بْنِ أَوْسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ وَلْيُرِحْ ذَبِيحَتَهُقَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ أَبُو الْأَشْعَثِ الصَّنْعَانِيُّ اسْمُهُ شَرَاحِيلُ بْنُ آدَةَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Husyaim] telah menceritakan kepada kami [Khalid] dari [Abu Qilabah] dari [Abu Al Asy'ats Ash Shan'ani] dari [Syaddad bin Aus] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah telah mewajibkan berbuat baik kepada segala sesuatu, jika kalian membunuh maka bunuhlah secara baik, dan jika kalian menyembelih maka sembelihlah secara baik, dan hendaklah salah seorang dari kalian menajamkan pisaunya serta memberikan kenyamanan (tidak menyiksa) kepada sembelihannya.\" Ia mengatakan; Hadits ini hasan shahih. Abu Al Asy'ats Ash Shan'ani bernama Syarahbil bin Adah."
            },
            {
                "number": 1330,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ سَعِيدٍ الْكِنْدِيُّ الْكُوفِيُّ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْجَنِينِ بِغُرَّةٍ عَبْدٍ أَوْ أَمَةٍ فَقَالَ الَّذِي قُضِيَ عَلَيْهِ أَيُعْطَى مَنْ لَا شَرِبَ وَلَا أَكَلَ وَلَا صَاحَ فَاسْتَهَلَّ فَمِثْلُ ذَلِكَ يُطَلَّ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ هَذَا لَيَقُولُ بِقَوْلِ شَاعِرٍ بَلْ فِيهِ غُرَّةٌ عَبْدٌ أَوْ أَمَةٌوَفِي الْبَاب عَنْ حَمَلِ بْنِ مَالِكِ بْنِ النَّابِغَةِ وَالْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ و قَالَ بَعْضُهُمْ الْغُرَّةُ عَبْدٌ أَوْ أَمَةٌ أَوْ خَمْسُ مِائَةِ دِرْهَمٍ و قَالَ بَعْضُهُمْ أَوْ فَرَسٌ أَوْ بَغْلٌ",
                "id": "Telah menceritakan kepada kami [Ali bin Sa'id Al Kindi Al Kufi], telah menceritakan kepada kami [Ibnu Abu Za`idah] dari [Muhammad bin Amr] dari [Abu Salamah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam memutuskan untuk janin dengan ghurrah yaitu berupa seorang budak laki-laki atau wanita. Lalu orang yang mendapat keputusan itu berkata; Apakah orang yang tidak minum, makan atau menangis serta berteriak dikenakan diyat, hal seperti itu adalah sesuatu yang dibatalkan. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang ini mengatakan dengan perkataan penyair, bahkan diyat untuk janin adalah ghurrah berupa seorang budak laki-lai atau wanita.\" Dalam hal ini ada hadits serupa dari Hamal bin Malik bin An Nabighah dan Al Mughirah bin Syu'bah. Abu Isa berkata; Hadits Abu Hurairah adalah hadits hasan shahih dan menjadi pedoman amal menurut para ulama. Sebagian ulama berpendapat; Al Ghurrah yaitu berupa seorang budak laki-laki atau wanita atau sebesar lima ratus dirham, sebagian lainnya berpendapat; Atau berupa seekor kuda perang atau keledai."
            },
            {
                "number": 1331,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عُبَيْدِ بْنِ نَضْلَةَ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَأَنَّ امْرَأَتَيْنِ كَانَتَا ضَرَّتَيْنِ فَرَمَتْ إِحْدَاهُمَا الْأُخْرَى بِحَجَرٍ أَوْ عَمُودِ فُسْطَاطٍ فَأَلْقَتْ جَنِينَهَا فَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْجَنِينِ غُرَّةٌ عَبْدٌ أَوْ أَمَةٌ وَجَعَلَهُ عَلَى عَصَبَةِ الْمَرْأَةِقَالَ الْحَسَنُ وَأَخْبَرَنَا زَيْدُ بْنُ حُبَابٍ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ بِهَذَا الْحَدِيثِ نَحْوَهُ و قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal], telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Syu'bah] dari [Manshur] dari [Ibrahim] dari [Ubaid bin Nadllah] dari [Al Mughirah bin Syu'bah] bahwa ada dua orang wanita yang dipoligami, salah satunya melempar kepada yang lainnya dengan batu atau tiang tenda lalu ia pun membunuh janinnya. Kemudian Rasulullah shallallahu 'alaihi wasallam memutuskan untuk diyat janin satu ghurrah yaitu berupa seorang budak laki-laki atau wanita dan menjadikan diyatnya sebagai tanggungan 'ashabah wanita yang membunuh. [Al Hasan] berkata; Dan telah mengabarkan kepada kami [Zaid bin Hubab] dari [Sufyan] dari [Manshur] dengan hadis ini seperi itu. Ia mengatakan; Hadits ini hasan shahih."
            },
            {
                "number": 1332,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا هُشَيْمٌ أَنْبَأَنَا مُطَرِّفٌ عَنْ الشَّعْبِيِّ حَدَّثَنَا أَبُو جُحَيْفَةَ قَالَ قُلْتُ لِعَلِيٍّيَا أَمِيرَ الْمُؤْمِنِينَ هَلْ عِنْدَكُمْ سَوْدَاءُ فِي بَيْضَاءَ لَيْسَ فِي كِتَابِ اللَّهِ قَالَ لَا وَالَّذِي فَلَقَ الْحَبَّةَ وَبَرَأَ النَّسَمَةَ مَا عَلِمْتُهُ إِلَّا فَهْمًا يُعْطِيهِ اللَّهُ رَجُلًا فِي الْقُرْآنِ وَمَا فِي الصَّحِيفَةِ قُلْتُ وَمَا فِي الصَّحِيفَةِ قَالَ الْعَقْلُ وَفِكَاكُ الْأَسِيرِ وَأَنْ لَا يُقْتَلَ مُؤْمِنٌ بِكَافِرٍقَالَ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ أَبُو عِيسَى حَدِيثُ عَلِيٍّ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَمَالِكِ بْنِ أَنَسٍ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ قَالُوا لَا يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ و قَالَ بَعْضُ أَهْلِ الْعِلْمِ يُقْتَلُ الْمُسْلِمُ بِالْمُعَاهِدِ وَالْقَوْلُ الْأَوَّلُ أَصَحُّ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Husyaim] telah memberitakan kepada kami [Mutharrif] dari [Asy Sya'bi], telah menceritakan kepada kami [Abu Juhaifah] ia berkata; Aku bertanya kepada [Ali]; Wahai Amirul Mukminin, apakah anda memiliki catatan hitam di atas putih (wahyu) yang tidak ada di dalam kitabullah? Ia menjawab; Tidak, demi Dzat yang menciptakan biji-bijian (menjadi tanaman) dan menciptakan jiwa (semua makhluk hidup pasti bernyawa), aku tidak mengetahuinya kecuali pemahaman yang Allah berikan kepada seseorang di dalam Al Qur`an dan mushaf. Aku bertanya; Apa yang ada di mushaf itu? ia menjawab; Akal. Dan agar orang mukmin tidak dibunuh oleh orang kafir. Ia mengatakan; Dalam hal ini ada hadits serupa dari Abdullah bin Amru. Abu Isa berkata; Hadits Ali adalah haidts hasan shahih dan menjadi pedoman amal menurut sebagian ulama, yaitu pendapat Sufyan Ats Tsauri, Malik bin Anas, Asy Syafi'i, Ahmad dan Ishaq, mereka berpendapat; Orang mukmin tidak dibunuh karena membunuh orang kafir, sedangkan sebagian ulama lain berpendapat; Orang mukmin dibunuh karena membunuh orang kafir yang terikat dengan perjanjian. Pendapat pertama adalah lebih shahih."
            },
            {
                "number": 1333,
                "arab": "حَدَّثَنَا عِيسَى بْنُ أَحْمَدَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُقْتَلُ مُسْلِمٌ بِكَافِرٍ وَبِهَذَا الْإِسْنَادِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ دِيَةُ عَقْلِ الْكَافِرِ نِصْفُ دِيَةِ عَقْلِ الْمُؤْمِنِقَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ بْنِ عَمْرٍو فِي هَذَا الْبَابِ حَدِيثٌ حَسَنٌ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي دِيَةِ الْيَهُودِيِّ وَالنَّصْرَانِيِّ فَذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ فِي دِيَةِ الْيَهُودِيِّ وَالنَّصْرَانِيِّ إِلَى مَا رُوِيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ و قَالَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ دِيَةُ الْيَهُودِيِّ وَالنَّصْرَانِيِّ نِصْفُ دِيَةِ الْمُسْلِمِ وَبِهَذَا يَقُولُ أَحْمَدُ بْنُ حَنْبَلٍ وَرُوِيَ عَنْ عُمَرَ بْنِ الْخَطَّابِ أَنَّهُ قَالَ دِيَةُ الْيَهُودِيِّ وَالنَّصْرَانِيِّ أَرْبَعَةُ آلَافِ دِرْهَمٍ وَدِيَةُ الْمَجُوسِيِّ ثَمَانُ مِائَةِ دِرْهَمٍ وَبِهَذَا يَقُولُ مَالِكُ بْنُ أَنَسٍ وَالشَّافِعِيُّ وَإِسْحَقُ و قَالَ بَعْضُ أَهْلِ الْعِلْمِ دِيَةُ الْيَهُودِيِّ وَالنَّصْرَانِيِّ مِثْلُ دِيَةِ الْمُسْلِمِ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ",
                "id": "Telah menceritakan kepada kami [Isa bin Ahmad], telah menceritakan kepada kami [Ibnu Wahb] dari [Usamah bin Zaid] dari [Amru bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang mukmin tidak dibunuh karena membunuh orang kafir.\" Dengan sanad yang sama juga diriwayatkan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Diyat orang kafir adalah setengah diyat orang mukmin.\" Abu Isa berkata; Hadits Abdullah bin Amr dalam hal ini adalah hadits hasan, para ulama berselisih pendapat tentang diyat orang yahudi dan nashrani. Sebagian ulama berpendapat tentang diyat orang yahudi dan nashrani kepada apa yang telah diriwayatkan dari Nabi shallallahu 'alaihi wasallam. Umar bin Abdul Aziz berpendapat; Diyat orang yahudi dan nashrani adalah setengah diyat orang muslim. Dan Ahmad bin Hanbal juga berpendapat demikian dan diriwayatkan dari Umar bin Al Khaththab bahwa ia mengatakan; Diyat orang Yahudi dan nashrani adalah empat ribu dirham, sedangkan diyat orang Majusi adalah delapan ratus dirham. Malik bin Anas, Asy Syafi'i dan Ishaq berpendapat dengan pendapat ini sedangkan sebagian ulama berpendapat; Diyat orang Yahudi dan Nashrani adalah seperti diyat orang muslim, ini menjadi pendapat Sufyan Ats Tsauri dan ulama Kufah."
            },
            {
                "number": 1334,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ التَّابِعِينَ مِنْهُمْ إِبْرَاهِيمُ النَّخَعِيُّ إِلَى هَذَا و قَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْهُمْ الْحَسَنُ الْبَصْرِيُّ وَعَطَاءُ بْنُ أَبِي رَبَاحٍ لَيْسَ بَيْنَ الْحُرِّ وَالْعَبْدِ قِصَاصٌ فِي النَّفْسِ وَلَا فِيمَا دُونَ النَّفْسِ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَقَ و قَالَ بَعْضُهُمْ إِذَا قَتَلَ عَبْدَهُ لَا يُقْتَلُ بِهِ وَإِذَا قَتَلَ عَبْدَ غَيْرِهِ قُتِلَ بِهِ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ",
                "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Al Hasan] dari [Samurah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membunuh budaknya maka kami akan membunuhnya, barangsiapa memotong tubuh budaknya maka kami akan memotongnya.\" Abu Isa berkata; Hadits ini hasan gharib. Sebagian ulama dari kalangan tabi'in seperti Ibrahim An Nakha'i berpendapat seperti ini namun sebagian ulama seperti Al Hasan Al Bashri dan 'Atha` bin Abu Rabah berpendapat; Tidak ada qishash terhadap jiwa antara orang merdeka dan budak, juga tidak pada selain jiwa. Ini menjadi pendapat Ahmad dan Ishaq, sedangkan sebagian dari mereka berpendapat; Jika ia membunuh budaknya maka ia tidak dibunuh karenanya, namun jika ia membunuh budak orang lain maka ia dibunuh karenanya, ini menjadi pendapat Sufyan Ats Tsauri dan ulama Kufah."
            },
            {
                "number": 1335,
                "arab": "حَدَّثَنَا قُتَيْبَةُ وَأَحْمَدُ بْنُ مَنِيعٍ وَأَبُو عَمَّارٍ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّ عُمَرَ كَانَ يَقُولُ الدِّيَةُ عَلَى الْعَاقِلَةِ وَلَا تَرِثُ الْمَرْأَةُ مِنْ دِيَةِ زَوْجِهَا شَيْئًا حَتَّى أَخْبَرَهُ الضَّحَّاكُ بْنُ سُفْيَانَ الْكِلَابِيُّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَيْهِ أَنْ وَرِّثْ امْرَأَةَ أَشْيَمَ الضِّبَابِيِّ مِنْ دِيَةِ زَوْجِهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ",
                "id": "Telah menceritakan kepada kami [Qutaibah], [Ahmad bin Mani'], [Abu 'Ammar] dan masih banyak lagi, mereka mengatakan; Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] bahwa Umar pernah berkata; Diyat itu menjadi hak keluarga (kerabat) orang yang dibunuh, dan seorang isteri tidak mewarisi diyat suaminya sedikitpun, hingga [Adl Dlahhak bin Sufyan Al Kilabi] mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam telah menulis surat kepadanya berbunyi: \"Berilah warisan kepada seorang isteri Asyyam Adl Dlababi dari diyat suaminya.\" Abu Isa berkata; Hadits ini hasan shahih dan menjadi pedoman amal menurut para ulama."
            },
            {
                "number": 1336,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ عَنْ شُعْبَةَ عَنْ قَتَادَةَ قَال سَمِعْتُ زُرَارَةَ بْنَ أَوْفَى يُحَدِّثُ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ رَجُلًا عَضَّ يَدَ رَجُلٍ فَنَزَعَ يَدَهُ فَوَقَعَتْ ثَنِيَّتَاهُ فَاخْتَصَمَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَعَضُّ أَحَدُكُمْ أَخَاهُ كَمَا يَعَضُّ الْفَحْلُ لَا دِيَةَ لَكَ فَأَنْزَلَ اللَّهُ{ وَالْجُرُوحَ قِصَاصٌ }قَالَ وَفِي الْبَاب عَنْ يَعْلَى بْنِ أُمَيَّةَ وَسَلَمَةَ بْنِ أُمَيَّةَ وَهُمَا أَخَوَانِ قَالَ أَبُو عِيسَى حَدِيثُ عِمْرَانَ بْنِ حُصَيْنٍ حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Ali bin Khasyram], telah memberitakan kepada kami [Isa bin Yunus] dari [Syu'bah] dari [Qatadah] ia berkata; Aku mendengar [Zurarah bin Aufa] menceritakan dari [Imran bin Hushain] bahwa ada seseorang yang menggigit tangan orang lain, maka orang yang digigit tangannya itu menarik kedua tangannya sehingga tanggallah kedua gigi depan si penggigit tersebut. Maka keduanya saling mengadu kepada Nabi shallallahu 'alaihi wasallam, dan beliau menjawab, \"Salah seorang dari kalian menggigit saudaranya, seperti halnya unta yang menggigit (temannya), maka tidak ada diyat bagimu.\" Kemudian turunlah ayat, \"WAL JURUHA QISHAH\" (dan luka-luka pun ada qishasnya) (QS. Al Maidah: 45) Ia mengatakan; Dalam hal ini ada hadits serupa dari Ya'la bin Umayyah dan Salamah bin Umayyah keduanya bersaudara. Abu 'Isa berkata; Hadits Imran bin Hushain adalah hadits hasan shahih."
            },
            {
                "number": 1337,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ سَعِيدٍ الْكِنْدِيُّ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَبَسَ رَجُلًا فِي تُهْمَةٍ ثُمَّ خَلَّى عَنْهُقَالَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى حَدِيثُ بَهْزٍ عَنْ أَبِيهِ عَنْ جَدِّهِ حَدِيثٌ حَسَنٌ وَقَدْ رَوَى إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ بَهْزِ بْنِ حَكِيمٍ هَذَا الْحَدِيثَ أَتَمَّ مِنْ هَذَا وَأَطْوَلَ",
                "id": "Telah menceritakan kepada kami [Ali bin Sa'id Al Kindi], telah menceritakan kepada kami [Ibnu Al Mubrarak] dari [Ma'mar] dari [Bahz bin Hakim] dari [ayahnya] dari [kakeknya] bahwa Nabi shallallahu 'alaihi wasallam pernah menahan seseorang karena suatu tuduhan lalu melepasnya. Ia mengatakan; Dalam hal ini ada hadits serupa dari Abu Hurairah. Abu Isa berkata; Hadits Bahz dari ayahnya dari kakeknya adalah hadits hasan, [Isma'il bin Ibrahim] telah meriwayatkan hadits ini dari [Bahz bin Hakim] dengan redaksi yang lebih lengkap dan lebih panjang."
            },
            {
                "number": 1338,
                "arab": "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ وَحَاتِمُ بْنُ سِيَاهٍ الْمَرْوَزِيُّ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرِو بْنِ سَهْلٍ عَنْ سَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ وَمَنْ سَرَقَ مِنْ الْأَرْضِ شِبْرًا طُوِّقَهُ يَوْمَ الْقِيَامَةِ مِنْ سَبْعِ أَرَضِينَوَزَادَ حَاتِمُ بْنُ سِيَاهٍ الْمَرْوَزِيُّ فِي هَذَا الْحَدِيثِ قَالَ مَعْمَرٌ بَلَغَنِي عَنْ الزُّهْرِيِّ وَلَمْ أَسْمَعْ مِنْهُ زَادَ فِي هَذَا الْحَدِيثِ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ وَهَكَذَا رَوَى شُعَيْبُ بْنُ أَبِي حَمْزَةَ هَذَا الْحَدِيثَ عَنْ الزُّهْرِيِّ عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرِو بْنِ سَهْلٍ عَنْ سَعِيدِ بْنِ زَيْدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَوَى سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ عَنْ سَعِيدِ بْنِ زَيْدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَذْكُرْ فِيهِ سُفْيَانُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرِو بْنِ سَهْلٍ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Salamah bin Syabib] dan [Hatim bin Siyah Al Marwazi] dan yang lainnya, mereka berkata; Telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Az Zuhri] dari [Thalhah bin Abdullah bin 'Auf] dari [Abdurrahman bin Amru bin Sahl] dari [Sa'id bin Zaid bin Amru bin Nufail] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang terbunuh karena membela hartanya maka ia syahid, dan barangsiapa mencuri sejengkal bumi maka pada hari kiamat ia akan dikalungkan dengan tujuh bumi.\" Hatim bin Siyah Al Marwazi menambah di dalam hadits ini. Ma'mar berkata; Telah sampai berita kepadaku dari Az Zuhri namun aku tidak mendengar darinya bahwa ia menambah dalam hadits ini kalimat: \"Barangsiapa yang terbunuh karena membela hartanya, maka ia syahid.\" Demikianlah [Syu'aib bin Abu Hamzah] meriwayatkan hadits ini dari [Az Zuhri] dari [Thalhah bin Abdullah] dari [Abdurrahman bin Amr bin Sahl] dari [Sa'id bin Zaid] dari Nabi shallallahu 'alaihi wasallam dan [Sufyan bin 'Uyainah] meriwayatkan juga dari [Az Zuhri] dari [Thalhah bin Abdullah] dari [Sa'id bin Zaid] dari Nabi shallallahu 'alaihi wasallam namun Sufyan tidak menyebutkan dalam sanadnya dari Abdurrahman bin Amr bin Sahl. Hadits ini hasan shahih."
            },
            {
                "number": 1339,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُطَّلِبِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ طَلْحَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌقَالَ وَفِي الْبَاب عَنْ عَلِيٍّ وَسَعِيدِ بْنِ زَيْدٍ وَأَبِي هُرَيْرَةَ وَابْنِ عُمَرَ وَابْنِ عَبَّاسٍ وَجَابِرٍ قَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ بْنِ عَمْرٍو حَدِيثٌ حَسَنٌ وَقَدْ رُوِيَ عَنْهُ مِنْ غَيْرِ وَجْهٍ وَقَدْ رَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ لِلرَّجُلِ أَنْ يُقَاتِلَ عَنْ نَفْسِهِ وَمَالِهِ و قَالَ ابْنُ الْمُبَارَكِ يُقَاتِلُ عَنْ مَالِهِ وَلَوْ دِرْهَمَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Abu Amir Al 'Aqadi] telah menceritakan kepada kami [Abdul Aziz bin Al Muththalib] dari [Abdullah bin Al Hasan] dari [Ibrahim bin Muhammad bin Thalhah] dari [Abdullah bin Amru] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang terbunuh karena membela hartanya, maka ia syahid.\" Ia mengatakan; Dan dalam hal ini ada hadits serupa dari Ali, Sa'id bin Zaid, Abu Hurairah, Ibnu Umar, Ibnu Abbas dan Jabir. Abu 'Isa berkata; Hadits Abdullah bin Amr adalah hadits hasan dan telah diriwayatkan juga darinya dari jalur lain. Sebagian ulama membolehkan bagi seseorang untuk membunuh karena membela diri dan hartanya, Ibnu Al Mubarak berkata; Boleh membunuh karena membela hartanya walaupun dua dirham."
            },
            {
                "number": 1340,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ إِسْحَقَ الْهَمْدَانِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْوَهَّابِ الْكُوفِيُّ شَيْخٌ ثِقَةٌ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ طَلْحَةَ قَالَ سُفْيَانُ وَأَثْنَى عَلَيْهِ خَيْرًا قَال سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أُرِيدَ مَالُهُ بِغَيْرِ حَقٍّ فَقَاتَلَ فَقُتِلَ فَهُوَ شَهِيدٌقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ الْحَسَنِ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ طَلْحَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Harun bin Ishaq Al Hamdani] ia berkata; Telah menceritakan kepada kami [Muhammad bin Abdul Wahhab Al Kufi] seorang syaikh yang tsiqah, dari [Sufyan Ats Tsauri] dari [Abdullah bin Al Hasan bin Ali bin Abu Thalib] telah menceritakan kepadaku [Ibrahim bin Muhammad bin Thalhah], [Sufyan] berkata; Aku memuji kebaikannya, ia berkata; Aku mendengar [Abdullah bin Amr] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa hartanya dirampas secara tidak haq lalu ia memerangi dan terbunuh maka ia syahid.\" Abu Isa berkata; Hadits ini hasan shahih. Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan] dari [Abdullah bin Al Hasan] dari [Ibrahim bin Muhammad bin Thalhah] dari [Abdullah bin Amr] dari Nabi shallallahu 'alaihi wasallam seperti itu."
            },
            {
                "number": 1341,
                "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ قَالَ أَخْبَرَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي عَنْ أَبِيهِ عَنْ أَبِي عُبَيْدَةَ بْنِ مُحَمَّدِ بْنِ عَمَّارِ بْنِ يَاسِرٍ عَنْ طَلْحَةَ بْنِ عَبْدِ اللَّهِ بْنِ عَوْفٍ عَنْ سَعِيدِ بْنِ زَيْدٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ قُتِلَ دُونَ مَالِهِ فَهُوَ شَهِيدٌ وَمَنْ قُتِلَ دُونَ دِينِهِ فَهُوَ شَهِيدٌ وَمَنْ قُتِلَ دُونَ دَمِهِ فَهُوَ شَهِيدٌ وَمَنْ قُتِلَ دُونَ أَهْلِهِ فَهُوَ شَهِيدٌقَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَهَكَذَا رَوَى غَيْرُ وَاحِدٍ عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ نَحْوَ هَذَا وَيَعْقُوبُ هُوَ ابْنُ إبرَاهِيمَ بنِ سَعْدِ بنِ إبرَاهِيمَ بنِ عَبدِ الرحمنِ بنِ عَوْفٍ الزُّهْرِيُّ",
                "id": "Telah menceritakan kepada kami [Abdu bin Humaid] ia berkata; Telah mengabarkan kepadaku [Ya'qub bin Ibrahim bin Sa'd] telah menceritakan kepada kami [ayahku] dari [ayahnya] dari [Abu Ubaidah bin Muhammad bin 'Ammar bin Yasir] dari [Thalhah bin Abdullah bin 'Auf] dari [Sa'id bin Zaid] ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang terbunuh karena membela hartanya maka ia syahid, barangsiapa yang terbunuh karena membela agamanya maka ia syahid, barangsiapa yang terbunuh karena membela darahnya (jiwanya) maka ia syahid dan barangsiapa yang terbunuh karena membela keluarganya maka ia syahid.\" Ia mengatakan; Hadits ini hasan shahih, demikianlah banyak perawi meriwayatkan dari Ibrahim bin Sa'd seperti hadits ini. Ya'qub adalah Ibnu Ibrahim Sa'd bin Ibrahim bin Abdurrahman bin 'Auf Az Zuhri."
            },
            {
                "number": 1342,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ قَالَ يَحْيَى وَحَسِبْتُ عَنْ رَافِعِ بْنِ خَدِيجٍ أَنَّهُمَا قَالَاخَرَجَ عَبْدُ اللَّهِ بْنُ سَهْلِ بْنِ زَيْدٍ وَمُحَيِّصَةُ بْنُ مَسْعُودِ بْنِ زَيْدٍ حَتَّى إِذَا كَانَا بِخَيْبَرَ تَفَرَّقَا فِي بَعْضِ مَا هُنَاكَ ثُمَّ إِنَّ مُحَيِّصَةَ وَجَدَ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَتِيلًا قَدْ قُتِلَ فَدَفَنَهُ ثُمَّ أَقْبَلَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ وَحُوَيِّصَةُ بْنُ مَسْعُودٍ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَكَانَ أَصْغَرَ الْقَوْمِ ذَهَبَ عَبْدُ الرَّحْمَنِ لِيَتَكَلَّمَ قَبْلَ صَاحِبَيْهِ قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبِّرْ لِلْكُبْرِ فَصَمَتَ وَتَكَلَّمَ صَاحِبَاهُ ثُمَّ تَكَلَّمَ مَعَهُمَا فَذَكَرُوا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقْتَلَ عَبْدِ اللَّهِ بْنِ سَهْلٍ فَقَالَ لَهُمْ أَتَحْلِفُونَ خَمْسِينَ يَمِينًا فَتَسْتَحِقُّونَ صَاحِبَكُمْ أَوْ قَاتِلَكُمْ قَالُوا وَكَيْفَ نَحْلِفُ وَلَمْ نَشْهَدْ قَالَ فَتُبَرِّئُكُمْ يَهُودُ بِخَمْسِينَ يَمِينًا قَالُوا وَكَيْفَ نَقْبَلُ أَيْمَانَ قَوْمٍ كُفَّارٍ فَلَمَّا رَأَى ذَلِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَى عَقْلَهُحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ وَرَافِعِ بْنِ خَدِيجٍ نَحْوَ هَذَا الْحَدِيثِ بِمَعْنَاهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ أَهْلِ الْعِلْمِ فِي الْقَسَامَةِ وَقَدْ رَأَى بَعْضُ فُقَهَاءِ الْمَدِينَةِ الْقَوَدَ بِالْقَسَامَةِ و قَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَهْلِ الْكُوفَةِ وَغَيْرِهِمْ إِنَّ الْقَسَامَةَ لَا تُوجِبُ الْقَوَدَ وَإِنَّمَا تُوجِبُ الدِّيَةَ",
                "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Al Laits bin Sa'd] dari [Yahya bin Sa'id] dari [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah], Yahya berkata; Aku kira dari [Rafi' bin Khadij] di antara keduanya ada yang berkata; Abdullah bin Sahl bin Zaid dan Mukhayyishah bin Mas'ud bin Zaid keluar hingga ketika sampai di Khaibar keduanya berpisah untuk sebagian keperluan mereka di sana, kemudian Mukhayyishah mendapati Abdullah bin Sahl gugur, ia telah dibunuh, setelah menguburnya kemudian ia pun menghadap Rasulullah shallallahu 'alaihi wasallam, ketika itu beliau bersama Khuwaishah bin Mas'ud dan Abdurrahman bin Sahl, ia adalah orang paling muda. Abdurrahman pun maju untuk berbicara sebelum kedua temannya, lalu Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Dahulukan orang yang lebih tua.\" Ia pun terdiam dan kedua temannya berbicara kemudian ia berbicara bersama keduanya. Mereka menyebutkan perihal terbunuhnya Abdullah bin Sahl kepada Rasulullah shallallahu 'alaihi wasallam, beliau pun bersabda kepada mereka: \"Apakah kalian mau bersumpah lima puluh kali sumpah dan berhak terhadap sahabat atau orang yang membunuh kalian?\" Mereka berkata; Bagaimana kami bersumpah sedangkan kami tidak menyaksikan? Beliau bersabda: \"Apakah kalian mau orang-orang Yahudi terbebas dari segala tuduhan kalian dengan lima puluh kali sumpah?\" Maka mereka bertanya; Bagaimana kami mengambil sumpah orang-orang kafir? Ketika Rasulullah shallallahu 'alaihi wasallam melihat hal itu, beliau pun memberikan diyatnya. Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] telah menceritakan kepada kami [Yazid bin Harun], telah mengabarkan kepada kami [Yahya bin Sa'id] dari [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah] dan [Rafi' bin Khadij] seperti hadits ini secara maknanya. Abu Isa berkata; Hadits ini hasan shahih dan menjadi pedoman amal menurut para ulama dalam sumpah lima puluh orang, sebagian fuqaha Madinah berpendapat bahwa qishash adalah dengan sumpah lima puluh orang namun sebagian ulama dari Kufah dan selain mereka berpendapat bahwa sumpah lima puluh orang tidak diwajibkan dalam qishash hanya diwajibkan pada diyat."
            },
            {
                "number": 1343,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ الْبَصْرِيُّ حَدَّثَنَا بِشْرُ بْنُ عُمَرَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ الْبَصْرِيِّ عَنْ عَلِيٍّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُفِعَ الْقَلَمُ عَنْ ثَلَاثَةٍ عَنْ النَّائِمِ حَتَّى يَسْتَيْقِظَ وَعَنْ الصَّبِيِّ حَتَّى يَشِبَّ وَعَنْ الْمَعْتُوهِ حَتَّى يَعْقِلَقَالَ وَفِي الْبَاب عَنْ عَائِشَةَ قَالَ أَبُو عِيسَى حَدِيثُ عَلِيٍّ حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ عَلِيٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَكَرَ بَعْضُهُمْ وَعَنْ الْغُلَامِ حَتَّى يَحْتَلِمَ وَلَا نَعْرِفُ لِلْحَسَنِ سَمَاعًا مِنْ عَلِيِّ بْنِ أَبِي طَالِبٍ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِي ظَبْيَانَ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذَا الْحَدِيثِ وَرَوَاهُ الْأَعْمَشُ عَنْ أَبِي ظَبْيَانَ عَنْ ابْنِ عَبَّاسٍ عَنْ عَلِيٍّ مَوْقُوفًا وَلَمْ يَرْفَعْهُ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ أَهْلِ الْعِلْمِ قَالَ أَبُو عِيسَى قَدْ كَانَ الْحَسَنُ فِي زَمَانِ عَلِيٍّ وَقَدْ أَدْرَكَهُ وَلَكِنَّا لَا نَعْرِفُ لَهُ سَمَاعًا مِنْهُ وَأَبُو ظَبْيَانَ اسْمُهُ حُصَيْنُ بْنُ جُنْدَبٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya Al Qutha'i Al Bashri], telah menceritakan kepada kami [Bisyr bin Umar], telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Al Hasan Al Bashri] dari [Ali] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Diangkatlah pena dari tiga golongan; Orang yang tidur hingga ia bangun, anak kecil hingga ia remaja (baligh), dan orang gila hingga ia berakal (sembuh).\" Ia mengatakan; Dalam hal ini ada hadits serupa dari A`isyah. Abu Isa berkata; Hadits Ali adalah hadits hasan gharib dari jalur ini namun telah diriwayatkan dari jalur lain dari Ali dari Nabi shallallahu 'alaihi wasallam, sebagian mereka menyebutkan: \"Dan dari anak kecil hingga ia bermimpi basah.\" Namun kami tidak mengetahui Al Hasan mendengarkan dari Ali bin Abu Thalib. Hadits ini juga diriwayatkan dari ['Atha` bin As Sa`ib] dari [Abu Zhabyan] dari [Ali Bin Abu Thalib] dari Nabi shallallahu 'alaihi wasallam seperti hadits ini. Al A'masy meriwayatkannya dari Abu Zhabyan dari Ibnu Abbas dari Ali secara mauquf namun ia tidak memarfu'kannya. Hadits ini menjadi pedoman amal menurut para ulama. Abu Isa berkata; Al Hasan telah hidup pada zaman Ali dan terkadang mengikutinya tetapi kami tidak mengetahui ia memiliki hadits yang didengar darinya. Abu Zhabyan bernama Hushain bin Jundab."
            },
            {
                "number": 1344,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْأَسْوَدِ أَبُو عَمْرٍو الْبَصْرِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ رَبِيعَةَ حَدَّثَنَا يَزِيدُ بْنُ زِيَادٍ الدِّمَشْقِيُّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ادْرَءُوا الْحُدُودَ عَنْ الْمُسْلِمِينَ مَا اسْتَطَعْتُمْ فَإِنْ كَانَ لَهُ مَخْرَجٌ فَخَلُّوا سَبِيلَهُ فَإِنَّ الْإِمَامَ أَنْ يُخْطِئَ فِي الْعَفْوِ خَيْرٌ مِنْ أَنْ يُخْطِئَ فِي الْعُقُوبَةِحَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ يَزِيدَ بْنِ زِيَادٍ نَحْوَ حَدِيثِ مُحَمَّدِ بْنِ رَبِيعَةَ وَلَمْ يَرْفَعْهُ قَالَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ لَا نَعْرِفُهُ مَرْفُوعًا إِلَّا مِنْ حَدِيثِ مُحَمَّدِ بْنِ رَبِيعَةَ عَنْ يَزِيدَ بْنِ زِيَادٍ الدِّمَشْقِيِّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَوَاهُ وَكِيعٌ عَنْ يَزِيدَ بْنِ زِيَادٍ نَحْوَهُ وَلَمْ يَرْفَعْهُ وَرِوَايَةُ وَكِيعٍ أَصَحُّ وَقَدْ رُوِيَ نَحْوُ هَذَا عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُمْ قَالُوا مِثْلَ ذَلِكَ وَيَزِيدُ بْنُ زِيَادٍ الدِّمَشْقِيُّ ضَعِيفٌ فِي الْحَدِيثِ وَيَزِيدُ بْنُ أَبِي زِيَادٍ الْكُوفِيُّ أَثْبَتُ مِنْ هَذَا وَأَقْدَمُ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Al Aswad Abu Amr Al Bashri], telah menceritakan kepada kami [Muhammad bin Rabi'ah], telah menceritakan kepada kami [Yazid bin Ziyad Ad Dimasyqi] dari [Az Zuhri] dari ['Urwah] dari [A`isyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hindarilah hukuman had dari kaum muslimin semampu kalian, jika ia mempunyai jalan keluar maka lepaskanlah ia. Karena sesungguhnya seorang imam salah dalam memaafkan lebih baik daripada salah dalam menjatuhi hukuman.\" Telah menceritakan kepada kami Hannad, telah menceritakan kepada kami Waki' dari Yazid bin Ziyad seperti Hadits Muhammad bin Rabi'ah namun tidak memarfu'kannya. Ia mengatakan; Dalam hal ini ada hadits serupa dari Abu Hurairah dan Abdullah bin Amr. Abu Isa berkata; Hadits Aisyah tidak kami ketahui diriwayatkan secara marfu' kecuali dari Hadits Muhammad bin Rabi'ah dari Yazid bin Ziyad Ad Dimasyqi dari Az Zuhri dari Urwah dari Aisyah dari Nabi shallallahu 'alaihi wasallam. Dan Waki' meriwayatkannya dari Yazid bin Ziyad seperti itu namun tidak memarfu'kannya dan riwayat Waki' lebih shahih. Telah diriwayatkan juga hadits seperti ini dari banyak sahabat Nabi shallallahu 'alaihi wasallam, bahwa mereka mengatakan seperti itu. Yazid bin Ziyad Ad Dimasyqi adalah seorang yang dha'if dalam periwayatan hadits sedangkan Yazid bin Ziyad Al Kufi adalah lebih tsabat dari orang ini dan lebih dahulu."
            },
            {
                "number": 1345,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ الْآخِرَةِ وَمَنْ سَتَرَ عَلَى مُسْلِمٍ سَتَرَهُ اللَّهُ فِي الدُّنْيَا وَالْآخِرَةِ وَاللَّهُ فِي عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِي عَوْنِ أَخِيهِقَالَ وَفِي الْبَاب عَنْ عُقْبَةَ بْنِ عَامِرٍ وَابْنِ عُمَرَ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ هَكَذَا رَوَى غَيْرُ وَاحِدٍ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ رِوَايَةِ أَبِي عَوَانَةَ وَرَوَى أَسْبَاطُ بْنُ مُحَمَّدٍ عَنْ الْأَعْمَشِ قَالَ حُدِّثْتُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ وَكَأَنَّ هَذَا أَصَحُّ مِنْ الْحَدِيثِ الْأَوَّلِ حَدَّثَنَا بِذَلِكَ عُبَيْدُ بْنُ أَسْبَاطَ بْنِ مُحَمَّدٍ قَالَ حَدَّثَنِي أَبِي عَنْ الْأَعْمَشِ بِهَذَا الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Abu 'Awanah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meringankan seorang mukmin dari kesusahan dunia maka Allah akan meringankan baginya dari kesusahan akhirat, barangsiapa menutupi aib seorang muslim maka Allah akan menutupi aibnya di dunia dan akhirat. Dan Allah akan selalu menolong hambaNya selama hambaNya menolong saudaranya.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari 'Uqbah bin Amir dan Ibnu Umar, Abu Isa berkata; Hadits Abu Hurairah adalah seperti ini, banyak perawi meriwayatkan dari Al A'masy dari Abu Shalih dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam seperti riwayat Abu 'Awanah, [Asbath bin Muhammad] meriwayatkan dari [Al A'masy], ia berkata; [Disampaikan hadits kepadaku] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti itu, sepertinya ini lebih shahih dari hadits pertama. Telah menceritakan kepada kami [Ubaid bin Asbath bin Muhammad] ia berkata; Telah menceritakan kepadaku [ayahku] dari [Al A'masy] dengan hadits ini."
            },
            {
                "number": 1346,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَظْلِمُهُ وَلَا يُسْلِمُهُ وَمَنْ كَانَ فِي حَاجَةِ أَخِيهِ كَانَ اللَّهُ فِي حَاجَتِهِ وَمَنْ فَرَّجَ عَنْ مُسْلِمٍ كُرْبَةً فَرَّجَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ يَوْمَ الْقِيَامَةِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ ابْنِ عُمَرَ",
                "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Az Zuhri] dari [Salim] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang muslim adalah saudara bagi muslim lainnya, tidak menzhalimi dan tidak menganiyanya. Barangsiapa yang menolong kebutuhan saudaranya, maka Allah akan senantiasa menolongnya. Barangsiapa menghilangkan kesusahan seorang muslim maka Allah akan menghilangkan kesusahan-kesusahannya pada hari kiamat. Dan barangsiapa menutup aib seorang muslim, maka Allah akan menutup aibnya pada hari kiamat.\" Abu Isa berkata; Hadits ini hasan shahih gharib dari Hadits Ibnu Umar."
            },
            {
                "number": 1347,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِمَاعِزِ بْنِ مَالِكٍ أَحَقٌّ مَا بَلَغَنِي عَنْكَ قَالَ وَمَا بَلَغَكَ عَنِّي قَالَ بَلَغَنِي أَنَّكَ وَقَعْتَ عَلَى جَارِيَةِ آلِ فُلَانٍ قَالَ نَعَمْ فَشَهِدَ أَرْبَعَ شَهَادَاتٍ فَأَمَرَ بِهِ فَرُجِمَقَالَ وَفِي الْبَاب عَنْ السَّائِبِ بْنِ يَزِيدَ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ وَرَوَى شُعْبَةُ هَذَا الْحَدِيثَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ مُرْسَلًا وَلَمْ يَذْكُرْ فِيهِ عَنْ ابْنِ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Abu 'Awanah] dari [Simak bin Harb] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam mengatakan kepada Ma'iz bin Malik: \"Apakah benar kabar yang sampai kepadaku tentangmu?\" ia menjawab; Kabar apa yang telah sampai kepadamu? Beliau menjawab: \"Telah sampai kabar kepadaku bahwa engkau telah menggauli seorang budak wanita keluarga Fulan.\" Ia menjawab; Benar. Ia pun bersaksi dengan empat kali saksi lalu beliau memerintahkannya dan ia dirajam. Ia mengatakan; Dalam hal ini ada hadits serupa dari As Sa`ib bin Yazid. Abu Isa berkata; Hadits Ibnu Abbas adalah hadits hasan, [Syu'bah] meriwayatkan hadits ini dari [Simak bin Harb] dari [Sa'id bin Jubair] secara mursal namun tidak menyebutkan dari Ibnu Abbas di dalamnya."
            },
            {
                "number": 1348,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو حَدَّثَنَا أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَجَاءَ مَاعِزٌ الْأَسْلَمِيُّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّهُ قَدْ زَنَى فَأَعْرَضَ عَنْهُ ثُمَّ جَاءَ مِنْ شِقِّهِ الْآخَرِ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهُ قَدْ زَنَى فَأَعْرَضَ عَنْهُ ثُمَّ جَاءَ مِنْ شِقِّهِ الْآخَرِ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهُ قَدْ زَنَى فَأَمَرَ بِهِ فِي الرَّابِعَةِ فَأُخْرِجَ إِلَى الْحَرَّةِ فَرُجِمَ بِالْحِجَارَةِ فَلَمَّا وَجَدَ مَسَّ الْحِجَارَةِ فَرَّ يَشْتَدُّ حَتَّى مَرَّ بِرَجُلٍ مَعَهُ لَحْيُ جَمَلٍ فَضَرَبَهُ بِهِ وَضَرَبَهُ النَّاسُ حَتَّى مَاتَ فَذَكَرُوا ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ فَرَّ حِينَ وَجَدَ مَسَّ الْحِجَارَةِ وَمَسَّ الْمَوْتِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلَّا تَرَكْتُمُوهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ أَبِي هُرَيْرَةَ وَرُوِيَ هَذَا الْحَدِيثُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذَا",
                "id": "Telah menceritakan kepada kami [Abu Kuraib], telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Muhammad bin Amr], telah menceritakan kepada kami [Abu Salamah] dari [Abu Hurairah] ia berkata; Ma'iz Al Aslami datang kepada Rasulullah shallallahu 'alaihi wasallam seraya berkata bahwa ia telah berzina, namun beliau berpaling darinya kemudian ia datang dari arah lain seraya berkata; Wahai Rasulullah, sesungguhnya ia telah berzina. Namun beliau masih berpaling darinya kemudian ia datang dari arah lain seraya berkata; Wahai Rasulullah, sesungguhnya ia telah berzina. Maka keempat kalinya beliau memerintahkannya, ia pun dikeluarkan ke tanah lapang lalu ia dirajam dengan batu. Ketika tersentuh lemparan batu, ia melarikan diri hingga melewati seorang laki-laki yang membawa tulang dagu unta. Orang itu pun memukul dengannya dan orang-orang pun ikut memukulnya hingga meninggal. Hal itu disampaikan kepada Rasulullah shallallahu 'alaihi wasallam bahwa ia lari ketika tersentuh lemparan batu dan sentuhan kematian. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mengapa kalian tidak meninggalkannya?\" Abu Isa berkata; Hadits ini hasan, dan telah diriwayatkan dari jalur lain dari Abu Hurairah, hadits ini diriwayatkan dari Az Zuhri dari Abu Salamah dari Jabir bin Abdullah dari Nabi shallallahu 'alaihi wasallam seperti ini."
            },
            {
                "number": 1349,
                "arab": "حَدَّثَنَا بِذَلِكَ الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَجُلًا مِنْ أَسْلَمَ جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاعْتَرَفَ بِالزِّنَا فَأَعْرَضَ عَنْهُ ثُمَّ اعْتَرَفَ فَأَعْرَضَ عَنْهُ حَتَّى شَهِدَ عَلَى نَفْسِهِ أَرْبَعَ شَهَادَاتٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبِكَ جُنُونٌ قَالَ لَا قَالَ أَحْصَنْتَ قَالَ نَعَمْ قَالَ فَأَمَرَ بِهِ فَرُجِمَ بِالْمُصَلَّى فَلَمَّا أَذْلَقَتْهُ الْحِجَارَةُ فَرَّ فَأُدْرِكَ فَرُجِمَ حَتَّى مَاتَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرًا وَلَمْ يُصَلِّ عَلَيْهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ أَنَّ الْمُعْتَرِفَ بِالزِّنَا إِذَا أَقَرَّ عَلَى نَفْسِهِ أَرْبَعَ مَرَّاتٍ أُقِيمَ عَلَيْهِ الْحَدُّ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَقَ و قَالَ بَعْضُ أَهْلِ الْعِلْمِ إِذَا أَقَرَّ عَلَى نَفْسِهِ مَرَّةً أُقِيمَ عَلَيْهِ الْحَدُّ وَهُوَ قَوْلُ مَالِكِ بْنِ أَنَسٍ وَالشَّافِعِيِّ وَحُجَّةُ مَنْ قَالَ هَذَا الْقَوْلَ حَدِيثُ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ أَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَحَدُهُمَا يَا رَسُولَ اللَّهِ إِنَّ ابْنِي زَنَى بِامْرَأَةِ هَذَا الْحَدِيثُ بِطُولِهِ وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْدُ يَا أُنَيْسُ عَلَى امْرَأَةِ هَذَا فَإِنْ اعْتَرَفَتْ فَارْجُمْهَا وَلَمْ يَقُلْ فَإِنْ اعْتَرَفَتْ أَرْبَعَ مَرَّاتٍ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] dengan hadits itu telah menceritakan kepada kami [Abdurrazaq], telah memberitakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah bin Abdurrahman] dari [Jabir bin Abdullah] bahwa ada seseorang dari Aslam datang kepada Nabi shallallahu 'alaihi wasallam lalu mengaku telah berzina, beliau pun berpaling darinya kemudian ia tetap mengaku namun beliau tetap berpaling darinya hingga ia bersaksi atas dirinya empat kali saksi. Maka Nabi shallallahu 'alaihi wasallam bertanya: \"Apakah engkau gila?\" ia menjawab; tidak. Beliau bertanya: \"Apakah engkau telah menikah?\" ia menjawab; Ya. maka beliau memerintahkannya lalu ia dirajam di tempat sholat. Ketika batu mengenainya ia melarikan diri, lalu ia ditangkap dan dirajam hingga meninggal. Maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Bagus (beliau memuji kepadanya), namun ia tidak disholati.\" Abu Isa berkata; Hadits ini hasan shahih, hadits ini menjadi pedoman amal menurut sebagian ulama bahwa orang yang mengaku berzina jika ia berikrar atas dirinya sebanyak empat kali maka harus dijatuhkan hukuman atasnya, ini menjadi pendapat Ahmad dan Ishaq. Namun sebagian ulama berpendapat jika ia telah berikrar atas dirinya satu kali saja maka harus dijatuhkan hukuman atasnya, ini menjadi pendapat Malik bin Anas dan Asy Syafi'i. Landasan orang yang berpendapat seperti ini adalah Hadits Abu Hurairah dan Zaid bin Khalid bahwa ada dua orang yang mengadukan kepada Rasulullah shallallahu 'alaihi wasallam, lalu salah seorang dari mereka berkata; Wahai Rasulullah, sesungguhnya anakku telah berzina dengan seorang wanita, hadits ini sangat panjang, Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai Unais, pergilah kepada perempuan ini, jika ia mengaku, maka rajamlah.\" Dan beliau tidak mengatakan: Jika ia mengaku dengan empat kali."
            },
            {
                "number": 1350,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ قُرَيْشًا أَهَمَّهُمْ شَأْنُ الْمَرْأَةِ الْمَخْزُومِيَّةِ الَّتِي سَرَقَتْ فَقَالُوا مَنْ يُكَلِّمُ فِيهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا مَنْ يَجْتَرِئُ عَلَيْهِ إِلَّا أُسَامَةُ بْنُ زَيْدٍ حِبُّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَلَّمَهُ أُسَامَةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَشْفَعُ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ ثُمَّ قَامَ فَاخْتَطَبَ فَقَالَ إِنَّمَا أَهْلَكَ الَّذِينَ مِنْ قَبْلِكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمْ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ فِيهِمْ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ وَايْمُ اللَّهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَاقَالَ وَفِي الْبَاب عَنْ مَسْعُودِ ابْنِ الْعَجْمَاءِ وَابْنِ عُمَرَ وَجَابِرٍ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَيُقَالُ مَسْعُودُ بْنُ الْأَعْجَمِ وَلَهُ هَذَا الْحَدِيثُ",
                "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Al Laits] dari [Abu Syihab] dari ['Urwah] dari [Aisyah] bahwa orang-orang Quraisy disibukkan dengan seorang wanita dari banu Makhzum yang telah mencuri, mereka berkata; Siapa yang sanggup berbicara kepada Rasulullah shallallahu 'alaihi wasallam perihal wanita ini? Lalu mereka berkata; Tidak ada yang berani kecuali Usamah bin Zaid orang yang dicintai oleh Rasulullah shallallahu 'alaihi wasallam. Usamah pun berbicara kepada beliau. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah engkau akan meminta syafa'at atas salah satu dari hukuman Allah?\" Kemudian beliau berkhutbah seraya bersabda: \"Sesungguhnya penyebab hancurnya umat sebelum kalian adalah jika ada di antara mereka orang yang mulia mencuri, mereka membiarkannya dan jika ada orang yang lemah mencuri, maka mereka menjatuhkan hukuman kepadanya. Demi Allah, seandainya Fathimah bintu Muhammad mencuri, niscaya aku akan memotong tangannya.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Mas'ud bin Al 'Ajma`, Ibnu Umar dan Jabir. Abu Isa berkata; Hadits Aisyah adalah hadits hasan shahih. Dipanggil juga dengan Mas'ud Al A'jam dan ia meriwayatkan hadits ini."
            },
            {
                "number": 1351,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا إِسْحَقُ بْنُ يُوسُفَ الْأَزْرَقُ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَرَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَجَمَ أَبُو بَكْرٍ وَرَجَمْتُ وَلَوْلَا أَنِّي أَكْرَهُ أَنْ أَزِيدَ فِي كِتَابِ اللَّهِ لَكَتَبْتُهُ فِي الْمُصْحَفِ فَإِنِّي قَدْ خَشِيتُ أَنْ تَجِيءَ أَقْوَامٌ فَلَا يَجِدُونَهُ فِي كِتَابِ اللَّهِ فَيَكْفُرُونَ بِهِقَالَ وَفِي الْبَاب عَنْ عَلِيٍّ قَالَ أَبُو عِيسَى حَدِيثُ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَرُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ عُمَرَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Ishaq bin Yusuf Al Azraq] dari [Dawud bin Abu Hind] dari [Sa'id bin Al Musayyib] dari [Umar bin Al Khaththab] ia berkata; Rasulullah shallallahu 'alaihi wasallam melakukan hukum rajam, Abu Abu Bakr juga melakukan hukum rajam dan aku juga melakukannya, seandainya bukan karena aku benci menambah di dalam Kitabullah, niscaya aku akan menulisnya di Mushaf. Karena sesungguhnya aku khawatir akan datang sekelompok orang namun mereka tidak mendapatinya di dalam Kitabullah, lalu mereka mengingkarinya. Ia mengatakan; Dalam hal ini ada hadits serupa dari Ali. Abu Isa berkata; Hadits Umar adalah hadits hasan shahih, dan telah diriwayatkan dari jalur lain dari Umar."
            },
            {
                "number": 1352,
                "arab": "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ وَإِسْحَقُ بْنُ مَنْصُورٍ وَالْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَإِنَّ اللَّهَ بَعَثَ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَقِّ وَأَنْزَلَ عَلَيْهِ الْكِتَابَ فَكَانَ فِيمَا أَنْزَلَ عَلَيْهِ آيَةُ الرَّجْمِ فَرَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَجَمْنَا بَعْدَهُ وَإِنِّي خَائِفٌ أَنْ يَطُولَ بِالنَّاسِ زَمَانٌ فَيَقُولَ قَائِلٌ لَا نَجِدُ الرَّجْمَ فِي كِتَابِ اللَّهِ فَيَضِلُّوا بِتَرْكِ فَرِيضَةٍ أَنْزَلَهَا اللَّهُ أَلَا وَإِنَّ الرَّجْمَ حَقٌّ عَلَى مَنْ زَنَى إِذَا أَحْصَنَ وَقَامَتْ الْبَيِّنَةُ أَوْ كَانَ حَبَلٌ أَوْ اعْتِرَافٌوَفِي الْبَاب عَنْ عَلِيٍّ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَرُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ",
                "id": "Telah menceritakan kepada kami [Salamah bin Syabib], [Ishaq bin Manshur], [Al Hasan bin Ali Al Khallal] dan masih banyak lagi, mereka berkata; Telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Az Zuhri] dari [ubaidhullah bin Abdullah bin Utbah] dari [Ibnu Abbas] dari [Umar bin Al Khaththab] ia berkata; Sesungguhnya Allah mengutus Muhammad shallallahu 'alaihi wasallam dengan kebenaran dan menurunkan Al Kitab atasnya. Ketika turun atasnya ayat tentang rajam, maka Rasulullah shallallahu 'alaihi wasallam melakukan hukum rajam dan kami pun melakukan rajam sepeninggal beliau. Dan sesungguhnya aku sangat khawatir berlalunya zaman yang lama terhadap manusia, akan ada orang yang berkata; Kami tidak mendapati hukum rajam di dalam Kitabullah. Lalu mereka tersesat dengan meninggalkan kewajiban yang telah diturunkan oleh Allah. Ketahuilah, sesungguhnya hukum rajam itu adalah hak atas orang yang berzina jika sudah menikah, telah jelas bukti, kehamilan atau pengakuan. Dalam hal ini ada hadits serupa dari Ali. Abu Isa berkata; Hadits ini hasan shahih dan diriwayatkan dari jalur lain dari Umar radliallahu 'anhu."
            },
            {
                "number": 1353,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ وَغَيْرُ وَاحِدٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ سَمِعَهُ مِنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ وَشِبْلٍأَنَّهُمْ كَانُوا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَاهُ رَجُلَانِ يَخْتَصِمَانِ فَقَامَ إِلَيْهِ أَحَدُهُمَا وَقَالَ أَنْشُدُكَ اللَّهَ يَا رَسُولَ اللَّهِ لَمَا قَضَيْتَ بَيْنَنَا بِكِتَابِ اللَّهِ فَقَالَ خَصْمُهُ وَكَانَ أَفْقَهَ مِنْهُ أَجَلْ يَا رَسُولَ اللَّهِ اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ وَأْذَنْ لِي فَأَتَكَلَّمَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا فَزَنَى بِامْرَأَتِهِ فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي الرَّجْمَ فَفَدَيْتُ مِنْهُ بِمِائَةِ شَاةٍ وَخَادِمٍ ثُمَّ لَقِيتُ نَاسًا مِنْ أَهْلِ الْعِلْمِ فَزَعَمُوا أَنَّ عَلَى ابْنِي جَلْدَ مِائَةٍ وَتَغْرِيبَ عَامٍ وَإِنَّمَا الرَّجْمُ عَلَى امْرَأَةِ هَذَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي نَفْسِي بِيَدِهِ لَأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ الْمِائَةُ شَاةٍ وَالْخَادِمُ رَدٌّ عَلَيْكَ وَعَلَى ابْنِكَ جَلْدُ مِائَةٍ وَتَغْرِيبُ عَامٍ وَاغْدُ يَا أُنَيْسُ عَلَى امْرَأَةِ هَذَا فَإِنْ اعْتَرَفَتْ فَارْجُمْهَا فَغَدَا عَلَيْهَا فَاعْتَرَفَتْ فَرَجَمَهَاحَدَّثَنَا إِسْحَقُ بْنُ مُوسَى الْأَنْصَارِيُّ حَدَّثَنَا مَعْنٌ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ بِمَعْنَاهُ حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ بِإِسْنَادِهِ نَحْوَ حَدِيثِ مَالِكٍ بِمَعْنَاهُ قَالَ وَفِي الْبَاب عَنْ أَبِي بَكْرَةَ وَعُبَادَةَ بْنِ الصَّامِتِ وَأَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ وَابْنِ عَبَّاسٍ وَجَابِرِ بْنِ سَمُرَةَ وَهَزَّالٍ وَبُرَيْدَةَ وَسَلَمَةَ بْنِ الْمُحَبَّقِ وَأَبِي بَرْزَةَ وَعِمْرَانَ بْنِ حُصَيْنٍ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَهَكَذَا رَوَى مَالِكُ بْنُ أَنَسٍ وَمَعْمَرٌ وَغَيْرُ وَاحِدٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَوَوْا بِهَذَا الْإِسْنَادِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِذَا زَنَتْ الْأَمَةُ فَاجْلِدُوهَا فَإِنْ زَنَتْ فِي الرَّابِعَةِ فَبِيعُوهَا وَلَوْ بِضَفِيرٍ وَرَوَى سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ عَنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ وَشِبْلٍ قَالُوا كُنَّا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَكَذَا رَوَى ابْنُ عُيَيْنَةَ الْحَدِيثَيْنِ جَمِيعًا عَنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ وَشِبْلٍ وَحَدِيثُ ابْنِ عُيَيْنَةَ وَهِمَ فِيهِ سُفْيَانُ بْنُ عُيَيْنَةَ أَدْخَلَ حَدِيثًا فِي حَدِيثٍ وَالصَّحِيحُ مَا رَوَى مُحَمَّدُ بْنُ الْوَلِيدِ الزُّبَيْدِيُّ وَيُونُسُ بْنُ عُبَيْدٍ وَابْنُ أَخِي الزُّهْرِيِّ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ عَنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا زَنَتْ الْأَمَةُ فَاجْلِدُوهَا وَالزُّهْرِيُّ عَنْ عُبَيْدِ اللَّهِ عَنْ شِبْلِ بْنِ خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ الْأَوْسِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا زَنَتْ الْأَمَةُ وَهَذَا الصَّحِيحُ عِنْدَ أَهْلِ الْحَدِيثِ وَشِبْلُ بْنُ خَالِدٍ لَمْ يُدْرِكْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا رَوَى شِبْلٌ عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ الْأَوْسِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهَذَا الصَّحِيحُ وَحَدِيثُ ابْنِ عُيَيْنَةَ غَيْرُ مَحْفُوظٍ وَرُوِيَ عَنْهُ أَنَّهُ قَالَ شِبْلُ بْنُ حَامِدٍ وَهُوَ خَطَأٌ إِنَّمَا هُوَ شِبْلُ بْنُ خَالِدٍ وَيُقَالُ أَيْضًا شِبْلُ بْنُ خُلَيْدٍ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] dan yang lainnya telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [ubaidhullah bin Abdullah bin Utbah] ia mendengarnya dari [Abu Hurairah] dan [Zaid bin Khalid] dan [Syibl] bahwa mereka berada di sebelah Nabi shallallahu 'alaihi wasallam, lalu ada dua orang datang bertengkar, salah seorang dari keduanya berdiri dan berkata; Aku bersumpah karena Allah, wahai Rasulullah, mengapa engkau tidak memutuskan di antara kami dengan Kitabullah? Lawannya yang lebih faqih berkata; Benar wahai Rasulullah, putuskanlah di antara kami dengan Kitabullah dan berilah izin untukku, aku akan mengatakan sesungguhnya anakku merasa kasihan karena orang ini, ia berzina dengan isterinya lalu mereka mengabarkan kepadaku bahwa anakku harus dirajam. Kemudian aku membayar fidyah dengan seratus unta dan pembantunya, setelah itu aku menemui sekumpulan para ulama, mereka menyuruh untuk mendera anakku sebanyak seratus kali dan diasingkan satu tahun, sesungguhnya rajam itu hanya untuk wanita ini. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di tanganNya, sungguh aku akan memutuskan di antara kalian berdua dengan Kitabullah, seratus unta dan pembantunya dikembalikan kepadamu, anakmu harus didera sebanyak seratus kali dan diasingkan selama satu tahun. Wahai Unais, pergilah kepada wanita ini, jika ia mengaku maka rajamlah.\" Maka keduanya pergi menemui wanita itu, ia pun mengaku maka ia dirajam. Telah menceritakan kepada kami [Ishaq bin Musa Al Anshari], telah menceritakan kepada kami [Ma'n] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari [ubaidhullah bin Abdullah] dari [Abu Hurairah] dan [Zaid bin Khalid Al Juhani] dari Nabi shallallahu 'alaihi wasallam seperti itu dengan maknanya. Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dengan sanadnya seperti Hadits Malik dengan maknanya. Ia mengatakan; Dalam hal ini ada hadits serupa dari Abu Bakrah, Ubadah bin Ash Shamit, Abu Hurairah, Abu Sa'id, Ibnu Abbas, Jabir bin Samurah, Hazzal, Buraidah, Salamah bin Al Muhabbaq, Abu Barzah dan Imran bin Hushain. Abu Isa berkata; Hadits Abu Hurairah dan Zaid bin Khalid adalah hadits hasan shahih, demikianlah Malik bin Anas, Ma'mar dan selainnya meriwayatkan dari Az Zuhri dari ubaidhullah bin Abdullah bin Utbah dari Abu Hurairah dan Zaid bin Khalid dari Nabi shallallahu 'alaihi wasallam. Mereka meriwayatkan dengan sanad ini dari Nabi shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Jika budak wanita berzina maka deralah, jika ia berzina pada empat kalinya maka juallah ia walaupun dengan tali pengikat pelana unta.\" Sufyan bin Uyainah meriwayatkan dari Az Zuhri dari ubaidhullah dari Abu Hurairah, Zaid bin Khalid dan Syibl, mereka berkata; Kami pernah berada di sebelah Nabi shallallahu 'alaihi wasallam seperti ini. Ibnu Uyainah meriwayatkan dua hadits semuanya dari Abu Hurairah, Zaid bin Khalid dan Syibl namun dalam Hadits Ibnu Uyainah, Sufyan bin Uyainah melakukan kesamaran, ia memasukkan hadits satu ke dalam hadits lain. Yang shahih adalah yang diriwayatkan oleh Muhammad bin Al Walid Az Zubaidi, Yunus bin Ubaid, anak saudaraku Az Zuhri dari Az Zuhri dari ubaidhullah dari Abu Hurairah dan Zaid bin Khalid dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika budak wanita berzina, maka deralah ia.\" Dan Az Zuhri dari ubaidhullah dari Syibl bin Khalid dari Abdullah bin Malik Al Ausi dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika budak wanita berzina.\" Inilah yang shahih menurut para ulama hadits, namun Syibl bin Khalid tidak bertemu Nabi shallallahu 'alaihi wasallam, sesungguhnya Syibl hanya meriwayatkan dari Abdullah bin Malik Al Ausi dari Nabi shallallahu 'alaihi wasallam, dan ini yang shahih. Sedangkan Hadits Ibnu Uyainah tidak terjaga dan diriwayatkan juga darinya bahwa ia berkata; Syibl bin Hamid adalah salah yang benar adalah Syibl bin Khalid dan dipanggil juga dengan Syibl bin Khulaid."
            },
            {
                "number": 1354,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا هُشَيْمٌ عَنْ مَنْصُورِ بْنِ زَاذَانَ عَنْ الْحَسَنِ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذُوا عَنِّي فَقَدْ جَعَلَ اللَّهُ لَهُنَّ سَبِيلًا الثَّيِّبُ بِالثَّيِّبِ جَلْدُ مِائَةٍ ثُمَّ الرَّجْمُ وَالْبِكْرُ بِالْبِكْرِ جَلْدُ مِائَةٍ وَنَفْيُ سَنَةٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُمْ عَلِيُّ بْنُ أَبِي طَالِبٍ وَأُبَيُّ بْنُ كَعْبٍ وَعَبْدُ اللَّهِ بْنُ مَسْعُودٍ وَغَيْرُهُمْ قَالُوا الثَّيِّبُ تُجْلَدُ وَتُرْجَمُ وَإِلَى هَذَا ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ إِسْحَقَ و قَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُمْ أَبُو بَكْرٍ وَعُمَرُ وَغَيْرُهُمَا الثَّيِّبُ إِنَّمَا عَلَيْهِ الرَّجْمُ وَلَا يُجْلَدُ وَقَدْ رُوِيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلُ هَذَا فِي غَيْرِ حَدِيثٍ فِي قِصَّةِ مَاعِزٍ وَغَيْرِهِ أَنَّهُ أَمَرَ بِالرَّجْمِ وَلَمْ يَأْمُرْ أَنْ يُجْلَدَ قَبْلَ أَنْ يُرْجَمَ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ",
                "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Husyaim] dari [Manshur bin Zadzan] dari [Al Hasan] dari [Hiththan bin Abdullah] dari [Ubadah bin Ash Shamit] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ambillah dariku, sungguh Allah telah menjadikan jalan untuk mereka, orang yang telah menikah berzina dengan orang yang telah menikah mendapat dera seratus kali kemudian rajam, anak muda berzina dengan anak muda (sama-sam belum menikah) mendapat dera seratus kali dan diasingkan satu tahun.\" Abu Isa berkata; Hadits ini hasan shahih dan menjadi pedoman amal menurut sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam, di antaranya Ali bin Abu Thalib, Ubay bin Ka'bin, Abdullah bin Mas'ud dan selain mereka, mereka berpendapat; Orang yang telah menikah yang berzina itu hanya mendapat rajam tanpa didera, dan telah diriwayatkan dari Nabi shallallahu 'alaihi wasallam seperti ini dalam hadits lain dalam kisah Ma'iz dan lainnya. Sesungguhnya beliau memerintahkan untuk merajamnya dan tidak memerintahkan untuk menderanya sebelum dirajam. Hadits ini menjadi pedoman amal menurut sebagian ulama, ini menjadi pendapat Sufyan Ats Tsauri, Ibnu Al Mubarak, Asy Syafi'i dan Ahmad."
            },
            {
                "number": 1355,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلِّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ امْرَأَةً مِنْ جُهَيْنَةَ اعْتَرَفَتْ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالزِّنَا فَقَالَتْ إِنِّي حُبْلَى فَدَعَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلِيَّهَا فَقَالَ أَحْسِنْ إِلَيْهَا فَإِذَا وَضَعَتْ حَمْلَهَا فَأَخْبِرْنِي فَفَعَلَ فَأَمَرَ بِهَا فَشُدَّتْ عَلَيْهَا ثِيَابُهَا ثُمَّ أَمَرَ بِرَجْمِهَا فَرُجِمَتْ ثُمَّ صَلَّى عَلَيْهَا فَقَالَ لَهُ عُمَرُ بْنُ الْخَطَّابِ يَا رَسُولَ اللَّهِ رَجَمْتَهَا ثُمَّ تُصَلِّي عَلَيْهَا فَقَالَ لَقَدْ تَابَتْ تَوْبَةً لَوْ قُسِمَتْ بَيْنَ سَبْعِينَ مِنْ أَهْلِ الْمَدِينَةِ لَوَسِعَتْهُمْ وَهَلْ وَجَدْتَ شَيْئًا أَفْضَلَ مِنْ أَنْ جَادَتْ بِنَفْسِهَا لِلَّهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Abdurrazaq] telah menceritakan kepada kami [Ma'mar] dari [Yahya bin Abu Katsir] dari [Abu Qilabah] dari [Abu Al Muhallib] dari [Imran bin Hushain] bahwa ada seorang wanita dari Juhainah berada di sebelah Nabi shallallahu 'alaihi wasallam mengaku telah berzina seraya berkata; Sesungguhnya aku hamil. Maka Nabi shallallahu 'alaihi wasallam memanggil walinya seraya bersabda: \"Berbuat baiklah kepadanya, jika ia telah melahirkan, kabarilah aku.\" Wali itupun mengabari Rasulullah (bahwa anaknya telah melahirkan). Kemudian Rasulullah memanggilnya, dan menyuruhnya untuk mengencangkan pakaiannya, kemudian beliau memerintahkan untuk merajamnya, lalu ia pun dirajam, kemudian beliau mensholatinya. Umar bin Al Khaththab bertanya kepada beliau; Wahai Rasulullah, engkau telah merajamnya, namun engkau mensholatinya? Beliau menjawab: \"Sungguh, ia telah bertaubat dengan suatu taubat yang sekiranya dibagikan di antara tujuh puluh penduduk Madinah, niscaya akan mencukupi mereka. Apakah engkau mendapati sesuatu yang lebih utama dari orang yang mempersembahkan dirinya untuk Allah?\" Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 1356,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مُوسَى الْأَنْصَارِيُّ حَدَّثَنَا مَعْنٌ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجَمَ يَهُودِيًّا وَيَهُودِيَّةًقَالَ أَبُو عِيسَى وَفِي الْحَدِيثِ قِصَّةٌ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Musa Al Anshari], telah menceritakan kepada kami [Ma'n], telah menceritakan kepada kami [Malik bin Anas] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam pernah merajam laki-laki dan wanita yahudi. Abu Isa berkata; Dalam hadits ini terdapat kisah panjang. Hadits ini hasan shahih."
            },
            {
                "number": 1357,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا شَرِيكٌ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجَمَ يَهُودِيًّا وَيَهُودِيَّةًقَالَ وَفِي الْبَاب عَنْ ابْنِ عُمَرَ وَالْبَرَاءِ وَجَابِرٍ وَابْنِ أَبِي أَوْفَى وَعَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ جَزْءٍ وَابْنِ عَبَّاسٍ قَالَ أَبُو عِيسَى حَدِيثُ جَابِرِ بْنِ سَمُرَةَ حَدِيثٌ حَسَنٌ غَرِيبٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ قَالُوا إِذَا اخْتَصَمَ أَهْلُ الْكِتَابِ وَتَرَافَعُوا إِلَى حُكَّامِ الْمُسْلِمِينَ حَكَمُوا بَيْنَهُمْ بِالْكِتَابِ وَالسُّنَّةِ وَبِأَحْكَامِ الْمُسْلِمِينَ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَقَ و قَالَ بَعْضُهُمْ لَا يُقَامُ عَلَيْهِمْ الْحَدُّ فِي الزِّنَا وَالْقَوْلُ الْأَوَّلُ أَصَحُّ",
                "id": "Telah menceritakan kepada kami [Hannad], telah menceritakan kepada kami [Syarik] dari [Simak bin Harb] dari [Jabir bin Samurah] bahwa Nabi shallallahu 'alaihi wasallam pernah merajam laki-laki dan wanita yahudi. Ia mengatakan; Dalam hal ini ada hadits serupa dari Ibnu Umar, Al Barra`, Jabir, Ibnu Abu Aufa, Abdullah bin Al Harits bin jaz` dan Ibnu Abbas. Abu Isa berkata; Hadits Jabir bin Samurah adalah hadits hasan gharib dan menjadi pedoman amal menurut kebanyakan ulama. Mereka berpendapat; Jika orang-orang ahlu Kitab bertengkar lalu mengangkat permasalahannya kepada hakim kaum muslimin, maka mereka menghukumi di antara mereka dengan Kitab dan Sunnah dan dengan hukum kaum muslimin, ini menjadi pendapat Ahmad dan Ishaq. Namun sebagian mereka berpendapat; Hukum had zina tidak ditegakkan kepada mereka. Pendapat pertama adalah lebih shahih."
            },
            {
                "number": 1358,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ وَيَحْيَى بْنُ أَكْثَمَ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَرَبَ وَغَرَّبَ وَأَنَّ أَبَا بَكْرٍ ضَرَبَ وَغَرَّبَ وَأَنَّ عُمَرَ ضَرَبَ وَغَرَّبَقَالَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ وَعُبَادَةَ بْنِ الصَّامِتِ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ غَرِيبٌ رَوَاهُ غَيْرُ وَاحِدٍ عَنْ عَبْدِ اللَّهِ بْنِ إِدْرِيسَ فَرَفَعُوهُ وَرَوَى بَعْضُهُمْ عَنْ عَبْدِ اللَّهِ بْنِ إِدْرِيسَ هَذَا الْحَدِيثَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ أَبَا بَكْرٍ ضَرَبَ وَغَرَّبَ وَأَنَّ عُمَرَ ضَرَبَ وَغَرَّبَ حَدَّثَنَا بِذَلِكَ أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ وَهَكَذَا رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ رِوَايَةِ ابْنِ إِدْرِيسَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ نَحْوَ هَذَا وَهَكَذَا رَوَاهُ مُحَمَّدُ بْنُ إِسْحَقَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ أَبَا بَكْرٍ ضَرَبَ وَغَرَّبَ وَأَنَّ عُمَرَ ضَرَبَ وَغَرَّبَ وَلَمْ يَذْكُرُوا فِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ صَحَّ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّفْيُ رَوَاهُ أَبُو هُرَيْرَةَ وَزَيْدُ بْنُ خَالِدٍ وَعُبَادَةُ بْنُ الصَّامِتِ وَغَيْرُهُمْ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُمْ أَبُو بَكْرٍ وَعُمَرُ وَعَلِيٌّ وَأُبَيُّ بْنُ كَعْبٍ وَعَبْدُ اللَّهِ بْنُ مَسْعُودٍ وَأَبُو ذَرٍّ وَغَيْرُهُمْ وَكَذَلِكَ رُوِيَ عَنْ غَيْرِ وَاحِدٍ مِنْ فُقَهَاءِ التَّابِعِينَ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَمَالِكِ بْنِ أَنَسٍ وَعَبْدِ اللَّهِ بْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] dan [Yahya bin Aktsam] keduanya berkata; Telah menceritakan kepada kami [Abdullah bin Idris] dari [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam telah memukul dan mengasingkan, demikian pula Abu Bakar telah memukul dan mengasingkan serta Umar juga telah memukul dan mengasingkan. Ia mengatakan; Dalam hal ini ada hadits serupa dari Abu Hurairah, Zaid bin Khalid dan Ubadah bin Ash Shamit. Abu Isa berkata; Hadits Ibnu Umar adalah hadits gharib. Banyak perawi meriwayatkannya dari Abdullah bin Idris lalu mereka memarfu'kannya. Sebagian mereka meriwayatkan hadits ini dari Abdullah bin Idris dari ubaidhullah dari Nafi' dari Ibnu Umar bahwa Abu Bakr memukul dan mengasingkan dan Umar juga memukul dan mengasingkan. Telah menceritakan dengan hadits itu kepada kami Abu Sa'id Al Asyajj telah menceritakan kepada kami Abdullah bin Idris dan demikianlah hadits ini diriwayatkan dari selain periwayatan Ibnu Idris dari ubaidhullah bin Umar seperti ini. Demikian juga Muhammad bin Ishaq meriwayatkannya dari Nafi' dari Ibnu Umar bahwa Abu Bakr memukul dan mengasingkan dan Umar juga memukul dan mengasingkan, namun mereka tidak menyebutkan di dalamnya dari Nabi shallallahu 'alaihi wasallam dan telah shahih peniadaan dari Rasulullah shallallahu 'alaihi wasallam. Abu Hurairah, Zaid bin Khalid, Ubadah bin Ash Shamit dan selain mereka meriwayatkannya dari Nabi shallallahu 'alaihi wasallam. Hadits ini menjadi pedoman amal menurut para ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam di antaranya Abu Bakr, Umar, Ali, Ubay bin Ka'b, Abdullah bin Mas'ud, Abu Dzar dan selain mereka. Demikian juga diriwayatkan dari banyak perawi dari para fuqaha tabi'in, ini menjadi pendapat Sufyan Ats Tsauri, Malik bin Anas, Abdullah bin Al Mubarak, Asy Syafi'i, Ahmad dan Ishaq."
            },
            {
                "number": 1359,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَكُنَّا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَجْلِسٍ فَقَالَ تُبَايِعُونِي عَلَى أَنْ لَا تُشْرِكُوا بِاللَّهِ شَيْئًا وَلَا تَسْرِقُوا وَلَا تَزْنُوا قَرَأَ عَلَيْهِمْ الْآيَةَ فَمَنْ وَفَّى مِنْكُمْ فَأَجْرُهُ عَلَى اللَّهِ وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَعُوقِبَ عَلَيْهِ فَهُوَ كَفَّارَةٌ لَهُ وَمَنْ أَصَابَ مِنْ ذَلِكَ شَيْئًا فَسَتَرَهُ اللَّهُ عَلَيْهِ فَهُوَ إِلَى اللَّهِ إِنْ شَاءَ عَذَّبَهُ وَإِنْ شَاءَ غَفَرَ لَهُقَالَ وَفِي الْبَاب عَنْ عَلِيٍّ وَجَرِيرِ بْنِ عَبْدِ اللَّهِ وَخُزَيْمَةَ بْنِ ثَابِتٍ قَالَ أَبُو عِيسَى حَدِيثُ عُبَادَةَ بْنِ الصَّامِتِ حَدِيثٌ حَسَنٌ صَحِيحٌ و قَالَ الشَّافِعِيُّ لَمْ أَسْمَعْ فِي هَذَا الْبَابِ أَنَّ الْحُدُودَ تَكُونُ كَفَّارَةً لِأَهْلِهَا شَيْئًا أَحْسَنَ مِنْ هَذَا الْحَدِيثِ قَالَ الشَّافِعِيُّ وَأُحِبُّ لِمَنْ أَصَابَ ذَنْبًا فَسَتَرَهُ اللَّهُ عَلَيْهِ أَنْ يَسْتُرَ عَلَى نَفْسِهِ وَيَتُوبَ فِيمَا بَيْنَهُ وَبَيْنَ رَبِّهِ وَكَذَلِكَ رُوِيَ عَنْ أَبِي بَكْرٍ وَعُمَرَ أَنَّهُمَا أَمَرَا رَجُلًا أَنْ يَسْتُرَ عَلَى نَفْسِهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Ibnu Idris Al Khaulani] dari [Ubadah bin Ash Shamit] ia berkata; Kami pernah berada di sebelah Nabi shallallahu 'alaihi wasallam di suatu majelis, beliau bersabda: \"Berjanji setialah kalian kepadaku untuk tidak menyekutukan Allah sedikitpun, tidak mencuri, dan tidak berzina.\" Beliau membacakan ayat kepada mereka: \"Barangsiapa dari kalian yang memenuhinya maka akan mendapat pahala dari Allah. Barangsiapa yang melakukan sesuatu dari hal itu lalu ia dihukum maka hal itu sebagai kafarah baginya. Dan barangsiapa yang melakukan sesuatu dari hal itu lalu Allah menutupi perbuatannya maka hal itu kembali kepada Allah, jika Allah berkehendak Dia akan mengadzabnya dan jika berkehendak Dia akan mengampuninya.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Ali, Jarir bin Abdullah dan Khuzaimah bin Tsabit. Abu Isa berkata; Hadits Ubadah bin Ash Shamit adalah hadits hasan shahih. Namun Asy Syafi'i mengatakan; Aku tidak mendengar dalam masalah ini bahwa hukuman-hukuman sebagai kafarah untuk pelakunya merupakan sesuatu yang lebih baik dari hadits ini. Asy Syafi'i berkata; Aku menyukai kepada orang yang melakukan dosa lalu Allah menutupinya, ia pun menutupi dirinya dan bertaubat terhadap apa yang terjadi antara dirinya dengan Rabbnya. Demikian juga yang diriwayatkan dari Abu Bakr dan Umar bahwa keduanya menyuruh seseorang untuk menutupi dosa pada dirinya."
            },
            {
                "number": 1360,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا زَنَتْ أَمَةُ أَحَدِكُمْ فَلْيَجْلِدْهَا ثَلَاثًا بِكِتَابِ اللَّهِ فَإِنْ عَادَتْ فَلْيَبِعْهَا وَلَوْ بِحَبْلٍ مِنْ شَعَرٍقَالَ وَفِي الْبَاب عَنْ عَلِيٍّ وَأَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ وَشِبْلٍ عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ الْأَوْسِيِّ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ عَنْهُ مِنْ غَيْرِ وَجْهٍ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ رَأَوْا أَنْ يُقِيمَ الرَّجُلُ الْحَدَّ عَلَى مَمْلُوكِهِ دُونَ السُّلْطَانِ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَقَ قَالَ بَعْضُهُمْ يُرْفَعُ إِلَى السُّلْطَانِ وَلَا يُقِيمُ الْحَدَّ هُوَ بِنَفْسِهِ وَالْقَوْلُ الْأَوَّلُ أَصَحُّ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id Al Asyajj], telah menceritakan kepada kami [Abu Khalid Al Ahmar] telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika budak wanita salah seorang dari kalian berzina maka deralah hingga tiga kali berdasar Kitabullah, jika ia melakukan lagi maka juallah ia walau pun seharga sebuah tali dari rambut.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Ali, Abu Hurairah, Zaid bin Khalid dan Syibl dari Abdullah bin Malik Al Ausi. Abu Isa berkata; Hadits Abu Hurairah adalah hadits hasan shahih dan telah diriwayatkan darinya dari jalur lain. Hadits ini menjadi pedoman amal menurut sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka. Mereka memperbolehkan seseorang untuk menegakkan hukuman kepada para budak selain penguasa, ini menjadi pendapat Ahmad dan Ishaq. Sebagian mereka berpendapat; Diserahkan kepada penguasa dan tidak ditegakkan hukuman sendiri, namun pendapat pertama adalah lebih shahih."
            },
            {
                "number": 1361,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ حَدَّثَنَا زَائِدَةُ بْنُ قُدَامَةَ عَنْ السُّدِّيِّ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ قَالَ خَطَبَ عَلِيٌّ فَقَالَيَا أَيُّهَا النَّاسُ أَقِيمُوا الْحُدُودَ عَلَى أَرِقَّائِكُمْ مَنْ أَحْصَنَ مِنْهُمْ وَمَنْ لَمْ يُحْصِنْ وَإِنَّ أَمَةً لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَنَتْ فَأَمَرَنِي أَنْ أَجْلِدَهَا فَأَتَيْتُهَا فَإِذَا هِيَ حَدِيثَةُ عَهْدٍ بِنِفَاسٍ فَخَشِيتُ إِنْ أَنَا جَلَدْتُهَا أَنْ أَقْتُلَهَا أَوْ قَالَ تَمُوتَ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ أَحْسَنْتَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالسُّدِّيُّ اسْمُهُ إِسْمَعِيلُ بْنُ عَبْدِ الرَّحْمَنِ وَهُوَ مِنْ التَّابِعِينَ قَدْ سَمِعَ مِنْ أَنَسِ بْنِ مَالِكٍ وَرَأَى حُسَيْنَ بْنَ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal], telah menceritakan kepada kami [Abu Dawud Ath Thayalisi], telah menceritakan kepada kami [Za`idah bin Qudamah] dari [As Suddi] dari [Sa'd bin Ubaidah] dari [Abu Abdurrahman As Sulami] ia berkata; [Ali] pernah berkhutbah seraya berkata; Wahai sekalian manusia, tegakkanlah hukuman-hukuman kepada para budak kalian yang telah menikah dari mereka dan yang belum menikah, karena sesungguhnya budak wanita milik Rasulullah shallallahu 'alaihi wasallam pernah berzina, lalu beliau memerintahkanku untuk menderanya. Maka aku mendatanginya ternyata ia baru menyelesaikan masa nifasnya, aku khawatir jika aku menderanya akan membunuhnya. Atau ia berkata; Ia akan meninggal. Aku pun menemui Rasulullah shallallahu 'alaihi wasallam seraya menyebutkan hal itu padanya. Beliau bersabda: \"Engkau benar.\" Abu Isa berkata; Hadits ini hasan shahih. As Suddi bernama Isma'il bin Abdurrahman dari kalangan tabi'in, ia telah mendengar dari Anas bin Malik dan melihat Husain bin Ali bin Abu Thalib radliallahu 'anhu."
            },
            {
                "number": 1362,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا أَبِي عَنْ مِسْعَرٍ عَنْ زَيْدٍ الْعَمِّيِّ عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَرَبَ الْحَدَّ بِنَعْلَيْنِ أَرْبَعِينَقَالَ مِسْعَرٌ أَظُنُّهُ فِي الْخَمْرِ قَالَ وَفِي الْبَاب عَنْ عَلِيٍّ وَعَبْدِ الرَّحْمَنِ بْنِ أَزْهَرَ وَأَبِي هُرَيْرَةَ وَالسَّائِبِ وَابْنِ عَبَّاسٍ وَعُقْبَةَ بْنِ الْحَارِثِ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي سَعِيدٍ حَدِيثٌ حَسَنٌ وَأَبُو الصِّدِّيقِ النَّاجِيُّ اسْمُهُ بَكْرُ بْنُ عَمْرٍو وَيُقَالُ بَكْرُ بْنُ قَيْسٍ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Waki'], telah menceritakan kepada kami [ayahku] dari [Mis'ar] dari [Zaid Al 'Ammi] dari [Abu Ash Shiddiq An Naji] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam menerapkan hukuman dengan memukul dua sandal sebanyak empat puluh kali. Mis'ar berkata; Aku kira dalam masalah khamr. Ia mengatakan; Dalam hal ini ada hadits serupa dari Ali, Abdurrahman bin Azhar, Abu Hurairah, As Sa`ib, Ibnu Abbas dan Uqbah bin Al Harits. Abu Isa berkata; Hadits Abu Sa'id adalah hadits hasan. Abu As Siddiq An Naji bernama Bakr bin Amr, terkadang dipanggil Bakr bin Qais."
            },
            {
                "number": 1363,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَال سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أُتِيَ بِرَجُلٍ قَدْ شَرِبَ الْخَمْرَ فَضَرَبَهُ بِجَرِيدَتَيْنِ نَحْوَ الْأَرْبَعِينَوَفَعَلَهُ أَبُو بَكْرٍ فَلَمَّا كَانَ عُمَرُ اسْتَشَارَ النَّاسَ فَقَالَ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ كَأَخَفِّ الْحُدُودِ ثَمَانِينَ فَأَمَرَ بِهِ عُمَرُ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ أَنَّ حَدَّ السَّكْرَانِ ثَمَانُونَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] ia berkata; Aku mendengar [Qatadah] menceritakan dari [Anas] dari Nabi shallallahu 'alaihi wasallam bahwa beliau didatangi seseorang yang telah meminum khamr, lalu beliau memukulnya dengan dua pelepah kurma sebanyak empat puluh kali, dilakukan juga oleh Abu Bakr. Ketika Umar bermusyawarah dengan orang-orang, maka Abdurarhman bin Auf berkata; Seperti hukuman paling ringan yaitu delapan puluh kali. Maka Umar memerintahkannya. Abu Isa berkata; Hadits Anas adalah hadits hasan shahih, dan menjadi pedoman amal menurut para ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka bahwa hukuman orang yang mabuk adalah delapan puluh kali."
            },
            {
                "number": 1364,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ عَاصِمِ بْنِ بَهْدَلَةَ عَنْ أَبِي صَالِحٍ عَنْ مُعَاوِيَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ شَرِبَ الْخَمْرَ فَاجْلِدُوهُ فَإِنْ عَادَ فِي الرَّابِعَةِ فَاقْتُلُوهُقَالَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَالشَّرِيدِ وَشُرَحْبِيلَ بْنِ أَوْسٍ وَجَرِيرٍ وَأَبِي الرَّمَدِ الْبَلَوِيِّ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ أَبُو عِيسَى حَدِيثُ مُعَاوِيَةَ هَكَذَا رَوَى الثَّوْرِيُّ أَيْضًا عَنْ عَاصِمٍ عَنْ أَبِي صَالِحٍ عَنْ مُعَاوِيَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَوَى ابْنُ جُرَيْجٍ وَمَعْمَرٌ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَمِعْت مُحَمَّدًا يَقُولُ حَدِيثُ أَبِي صَالِحٍ عَنْ مُعَاوِيَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا أَصَحُّ مِنْ حَدِيثِ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنَّمَا كَانَ هَذَا فِي أَوَّلِ الْأَمْرِ ثُمَّ نُسِخَ بَعْدُ هَكَذَا رَوَى مُحَمَّدُ بْنُ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ مَنْ شَرِبَ الْخَمْرَ فَاجْلِدُوهُ فَإِنْ عَادَ فِي الرَّابِعَةِ فَاقْتُلُوهُ قَالَ ثُمَّ أُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ذَلِكَ بِرَجُلٍ قَدْ شَرِبَ الْخَمْرَ فِي الرَّابِعَةِ فَضَرَبَهُ وَلَمْ يَقْتُلْهُ وَكَذَلِكَ رَوَى الزُّهْرِيُّ عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذَا قَالَ فَرُفِعَ الْقَتْلُ وَكَانَتْ رُخْصَةً وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ عَامَّةِ أَهْلِ الْعِلْمِ لَا نَعْلَمُ بَيْنَهُمْ اخْتِلَافًا فِي ذَلِكَ فِي الْقَدِيمِ وَالْحَدِيثِ وَمِمَّا يُقَوِّي هَذَا مَا رُوِيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَوْجُهٍ كَثِيرَةٍ أَنَّهُ قَالَ لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ إِلَّا بِإِحْدَى ثَلَاثٍ النَّفْسُ بِالنَّفْسِ وَالثَّيِّبُ الزَّانِي وَالتَّارِكُ لِدِينِهِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib], telah menceritakan kepada kami [Abu Bakr bin 'Ayyasy] dari ['Ashim bin Bahdalah] dari [Abu Shalih] dari [Mu'awiyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang minum khamr maka deralah ia, jika ia mengulangi keempat kalinya maka bunuhlah.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Abu Hurairah, Asy Syarid, Syurahbil bin Aus, Jarir, Abu Ar Ramad Al Balawi dan Abdullah bin Amr. Abu Isa berkata; Hadits Mu'awiyah adalah seperti ini, [Ats Tsauri] meriwayatkan juga dari ['Ashim] dari [Abu Shalih] dari [Mu'awiyah] dari Nabi shallallahu 'alaihi wasallam. [Ibnu Juraij] dan [Ma'mar] meriwayatkan dari [Suhail bin Abu Shalih] dari [ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam. Ia mengatakan; Aku mendengar Muhammad mengatakan; Hadits Abu Shalih dari Mu'awiyah dari Nabi shallallahu 'alaihi wasallam dalam hal ini adalah lebih shahih daripada Hadits Abu Shalih dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam dan sesungguhnya hal ini terjadi pada awal perintah kemudian dihapus setelah itu. Demikianlah [Muhammad bin Ishaq] meriwayatkan dari [Muhammad bin Al Munkadir] dari [Jabir bin Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang meminum khamr maka deralah ia, dan jika ia mengulangi keempat kalinya, bunuhlah ia.\" Ia melanjutkan; Kemudian didatangkan setelah itu kepada Nabi shallallahu 'alaihi wasallam seseorang yang telah meminum khamr keempat kalinya, namun beliau hanya memukul dan tidak membunuhnya. Dan demikianlah [Az Zuhri] meriwayatkan dari [Qabishah bin Dzu`aib] dari Nabi shallallahu 'alaihi wasallam seperti hadits ini. Ia melanjutkan; Maka dihapuslah pembunuhan sebagai keringanan. Hadits ini menjadi pedoman amal menurut mayoritas ulama, tidak kami ketahui ada perselisihan di antara mereka dari banyak sisi karena beliau pernah bersabda: \"Tidak halal darah seorang muslim yang bersaksi bahwa tidak ada sesembahan yang haq selain Allah dan aku adalah utusan Allah kecuali salah satu dari tiga orang; Jiwa dibalas dengan jiwa (orang yang membunuh orang lain), orang tua yang berzina, dan orang meninggalkan agamanya.\""
            },
            {
                "number": 1365,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ أَخْبَرَتْهُ عَمْرَةُ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْطَعُ فِي رُبُعِ دِينَارٍ فَصَاعِدًاقَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ مَرْفُوعًا وَرَوَاهُ بَعْضُهُمْ عَنْ عَمْرَةَ عَنْ عَائِشَةَ مَوْقُوفًا",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr], telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri], telah mengabarkan kepadanya ['Amrah] dari [A`isyah] bahwa Nabi shallallahu 'alaihi wasallam pernah memotong dalam pencurian seperempat dinar atau lebih. Abu Isa berkata; Hadits Aisyah adalah hadits hasan shahih dan hadits ini telah diriwayatkan dari jalur lain dari 'Amrah dari Aisyah secara marfu', namun sebagian mereka meriwayatkannya dari 'Amrah dari Aisyah secara mauquf."
            },
            {
                "number": 1366,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَطَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مِجَنٍّ قِيمَتُهُ ثَلَاثَةُ دَرَاهِمَقَالَ وَفِي الْبَاب عَنْ سَعْدٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ وَأَيْمَنَ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُمْ أَبُو بَكْرٍ الصِّدِّيقُ قَطَعَ فِي خَمْسَةِ دَرَاهِمَ وَرُوِي عَنْ عُثْمَانَ وَعَلِيٍّ أَنَّهُمَا قَطَعَا فِي رُبُعِ دِينَارٍ وَرُوِي عَنْ أَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ أَنَّهُمَا قَالَا تُقْطَعُ الْيَدُ فِي خَمْسَةِ دَرَاهِمَ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ فُقَهَاءِ التَّابِعِينَ وَهُوَ قَوْلُ مَالِكِ بْنِ أَنَسٍ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ رَأَوْا الْقَطْعَ فِي رُبُعِ دِينَارٍ فَصَاعِدًا وَقَدْ رُوِيَ عَنْ ابْنِ مَسْعُودٍ أَنَّهُ قَالَ لَا قَطْعَ إِلَّا فِي دِينَارٍ أَوْ عَشَرَةِ دَرَاهِمَ وَهُوَ حَدِيثٌ مُرْسَلٌ رَوَاهُ الْقَاسِمُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ ابْنِ مَسْعُودٍ وَالْقَاسِمُ لَمْ يَسْمَعْ مِنْ ابْنِ مَسْعُودٍ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ قَالُوا لَا قَطْعَ فِي أَقَلَّ مِنْ عَشَرَةِ دَرَاهِمَ وَرُوِي عَنْ عَلِيٍّ أَنَّهُ قَالَ لَا قَطْعَ فِي أَقَلَّ مِنْ عَشَرَةِ دَرَاهِمَ وَلَيْسَ إِسْنَادُهُ بِمُتَّصِلٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam memotong tangan dalam pencurian tameng besi senilai tiga dirham. Ia mengatakan; Dalam hal ini ada hadits serupa dari Sa'd, Abdullah bin Amr, Ibnu Abbas, Abu Hurairah dan Aiman. Abu Isa berkata; Hadits Ibnu Umar adalah hadits hasan shahih dan menjadi pedoman amal menurut sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam di antaranya; Abu Bakr Ash Shiddiq memotong tangan dalam pencurian lima dirham, dan diriwayatkan dari Utsman dan Ali bahwa keduanya pernah memotong tangan dalam pencurian seperempat dinar dan diriwayatkan juga dari Abu Hurairah dan Abu Sa'id bahwa keduanya berkata; Tangan boleh dipotong dalam penduciran lima dirham. Hadits ini menjadi pedoman amal menurut sebagian fuqaha tabi'in, ini menjadi pendapat Malik bin Anas, Asy Syafi'i, Ahmad dan Ishaq, mereka membolehkan memotong tangan dalam pencurian seperempat dinar atau lebih. Telah diriwayatkan juga dari Ibnu Mas'ud bahwa ia berkata; Tidak dipotong tangan kecuali mencapai satu dinar atau sepuluh dirham. Ini adalah hadits mursal, Al Qasim bin Abdurrahman meriwayatkannya dari Ibnu Mas'ud padahal Al Qasim tidak mendengar dari Ibnu Mas'ud. Hadits ini menjadi pedoman amal menurut sebagian ulama, ini menjadi pendapat Sufyan Ats Tsauri dan ulama Kufah, mereka berpendapat; Tidak ada potong tangan kurang dari sepuluh dirham dan sanadnya tidak bersambung."
            },
            {
                "number": 1367,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ الْمُقَدَّمِيُّ حَدَّثَنَا الْحَجَّاجُ عَنْ مَكْحُولٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُحَيْرِيزٍ قَالَسَأَلْتُ فَضَالَةَ بْنَ عُبَيْدٍ عَنْ تَعْلِيقِ الْيَدِ فِي عُنُقِ السَّارِقِ أَمِنْ السُّنَّةِ هُوَ قَالَ أُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَارِقٍ فَقُطِعَتْ يَدُهُ ثُمَّ أَمَرَ بِهَا فَعُلِّقَتْ فِي عُنُقِهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عُمَرَ بْنِ عَلِيٍّ الْمُقَدَّمِيِّ عَنْ الْحَجَّاجِ بْنِ أَرْطَاةَ وَعَبْدُ الرَّحْمَنِ بْنُ مُحَيْرِيزٍ هُوَ أَخُو عَبْدِ اللَّهِ بْنِ مُحَيْرِيزٍ شَامِيٌّ",
                "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Umar bin Ali Al Muqaddami], telah menceritakan kepada kami [Al Hajjaj] dari [Makhul] dari [Abdurrahman bin Muhairiz] ia berkata; Aku bertanya kepada [Fadlalah bin Ubaid] tentang menggantungkan tangan di leher pencuri; Apakah hal itu termasuk sunnah? Ia menjawab; Rasulullah shallallahu 'alaihi wasallam pernah didatangkan seorang pencuri lalu tangannya dipotong kemudian beliau memerintahkan untuk menggantungkan di lehernya. Abu Isa berkata; Hadits ini hasan gharib, tidak kami ketahui kecuali dari Hadits Umar bin Ali Al Muqaddami dari Al Hajjaj bin Arthah. Abdurrahman bin Muhairiz adalah saudara Abdullah bin Muhairiz Syami."
            },
            {
                "number": 1368,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ عَلَى خَائِنٍ وَلَا مُنْتَهِبٍ وَلَا مُخْتَلِسٍ قَطْعٌقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ وَقَدْ رَوَاهُ مُغِيرَةُ بْنُ مُسْلِمٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ حَدِيثِ ابْنِ جُرَيْجٍ وَمُغِيرَةُ بْنُ مُسْلِمٍ هُوَ بَصْرِيٌّ أَخُو عَبْدِ الْعَزِيزِ الْقَسْمَلِيِّ كَذَا قَالَ عَلِيُّ بْنُ الْمَدِينِيِّ",
                "id": "Telah menceritakan kepada kami [Ali bin Khasyram], telah menceritakan kepada kami [Isa bin Yunus] dari [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada potong tangan terhadap pengkhianat, perampas dan penipuan.\" Abu Isa berkata; Hadits ini hasan shahih dan menjadi pedoman amal menurut para ulama dan [Mughirah bin Muslim] telah meriwayatkannya dari [Abu Az Zubair] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam seperti Hadits Ibnu Juraij. Mughirah bin Muslim adalah Bashri saudara Abdul Aziz Al Qasmali, seperti inilah yang dikatakan oleh Ali bin Al Madini."
            },
            {
                "number": 1369,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ عَمِّهِ وَاسِعِ بْنِ حَبَّانَ أَنَّ رَافِعَ بْنَ خَدِيجٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍقَالَ أَبُو عِيسَى هَكَذَا رَوَى بَعْضُهُمْ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ عَمِّهِ وَاسِعِ بْنِ حَبَّانَ عَنْ رَافِعِ بْنِ خَدِيجٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ رِوَايَةِ اللَّيْثِ بْنِ سَعْدٍ وَرَوَى مَالِكُ بْنُ أَنَسٍ وَغَيْرُ وَاحِدٍ هَذَا الْحَدِيثَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ رَافِعِ بْنِ خَدِيجٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَذْكُرُوا فِيهِ عَنْ وَاسِعِ بْنِ حَبَّانَ",
                "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Al Laits] dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari pamannya [Wasi' bin Habban] bahwa [Rafi' bin Khadij] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada potong tangan pada buah atau daging kurma yang paling lunak.\" Abu Isa berkata; Demikianlah sebagian mereka meriwayatkan dari Yahya bin Sa'id dari Muhammad bin Yahya bin Habban dari pamannya Wasi' bin Habban dari Rafi' bin khadij dari Nabi shallallahu 'alaihi wasallam seperti riwayat Al Laits bin Sa'd. [Malik bin Anas] dan lainnya meriwayatkan hadits ini juga dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari [Rafi' bin Khadij] dari Nabi shallallahu 'alaihi wasallam namun mereka tidak menyebutkan dalam hadits itu dari Wasi' bin Habban"
            },
            {
                "number": 1370,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ عَيَّاشِ بْنِ عَبَّاسٍ عَنْ شُيَيْمِ بْنِ بَيْتَانَ عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ عَنْ بُسْرِ بْنِ أَرْطَاةَ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُقْطَعُ الْأَيْدِي فِي الْغَزْوِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَقَدْ رَوَى غَيْرُ ابْنِ لَهِيعَةَ بِهَذَا الْإِسْنَادِ نَحْوَ هَذَا وَيُقَالُ بُسْرُ بْنُ أَبِي أَرْطَاةَ أَيْضًا وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْهُمْ الْأَوْزَاعِيُّ لَا يَرَوْنَ أَنْ يُقَامَ الْحَدُّ فِي الْغَزْوِ بِحَضْرَةِ الْعَدُوِّ مَخَافَةَ أَنْ يَلْحَقَ مَنْ يُقَامُ عَلَيْهِ الْحَدُّ بِالْعَدُوِّ فَإِذَا خَرَجَ الْإِمَامُ مِنْ أَرْضِ الْحَرْبِ وَرَجَعَ إِلَى دَارِ الْإِسْلَامِ أَقَامَ الْحَدَّ عَلَى مَنْ أَصَابَهُ كَذَلِكَ قَالَ الْأَوْزَاعِيُّ",
                "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Ibnu Lahi'ah] dari ['Ayyasy bin Abbas] dari [Syuyaim bin Baitan] dari [Junadah bin Abu Umayyah] dari [Busr bin Arthah] ia berkata; Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada potong tangan dalam peperangan.\" Abu Isa berkata; Hadits ini gharib, ada selain Ibnu Lahi'ah yang meriwayatkan dengan sanad ini seperti hadits ini. Ia dipanggil juga dengan Busr bin Abu Arthah. Hadits ini menjadi pedoman amal menurut sebagian ulama di antaranya Al Auza'i, mereka tidak membolehkan menegakkan hukuman dalam peperangan ketika musuh datang, khawatir orang yang sedang dihukum bergabung dengan musuh. Maka jika imam telah keluar dari bumi peperangan dan kembali ke negara Islam, maka ia harus menegakkan hukuman kepada orang yang salah, demikian yang dikatakan oleh Al Auza'i."
            },
            {
                "number": 1371,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا هُشَيْمٌ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ وَأَيُّوبَ بْنِ مِسْكِينٍ عَنْ قَتَادَةَ عَنْ حَبِيبِ بْنِ سَالِمٍ قَالَرُفِعَ إِلَى النُّعْمَانِ بْنِ بَشِيرٍ رَجُلٌ وَقَعَ عَلَى جَارِيَةِ امْرَأَتِهِ فَقَالَ لَأَقْضِيَنَّ فِيهَا بِقَضَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَئِنْ كَانَتْ أَحَلَّتْهَا لَهُ لَأَجْلِدَنَّهُ مِائَةً وَإِنْ لَمْ تَكُنْ أَحَلَّتْهَا لَهُ رَجَمْتُهُحَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا هُشَيْمٌ عَنْ أَبِي بِشْرٍ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ نَحْوَهُ وَيُرْوَى عَنْ قَتَادَةَ أَنَّهُ قَالَ كُتِبَ بِهِ إِلَى حَبِيبِ بْنِ سَالِمٍ وَأَبُو بِشْرٍ لَمْ يَسْمَعْ مِنْ حَبِيبِ بْنِ سَالِمٍ هَذَا أَيْضًا إِنَّمَا رَوَاهُ عَنْ خَالِدِ بْنِ عُرْفُطَةَ قَالَ وَفِي الْبَاب عَنْ سَلَمَةَ بْنِ الْمُحَبَّقِ قَالَ أَبُو عِيسَى حَدِيثُ النُّعْمَانِ فِي إِسْنَادِهِ اضْطِرَابٌ قَالَ سَمِعْت مُحَمَّدًا يَقُولُ لَمْ يَسْمَعْ قَتَادَةُ مِنْ حَبِيبِ بْنِ سَالِمٍ هَذَا الْحَدِيثَ إِنَّمَا رَوَاهُ عَنْ خَالِدِ بْنِ عُرْفُطَةَ قَالَ أَبُو عِيسَى وَقَدْ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي الرَّجُلِ يَقَعُ عَلَى جَارِيَةِ امْرَأَتِهِ فَرُوِيَ عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُمْ عَلِيٌّ وَابْنُ عُمَرَ أَنَّ عَلَيْهِ الرَّجْمَ و قَالَ ابْنُ مَسْعُودٍ لَيْسَ عَلَيْهِ حَدٌّ وَلَكِنْ يُعَزَّرُ وَذَهَبَ أَحْمَدُ وَإِسْحَقُ إِلَى مَا رَوَى النُّعْمَانُ بْنُ بَشِيرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr], telah menceritakan kepada kami [Husyaim] dari [Sa'id bin Abu 'Arubah] dan [Ayyub bin Miskin] dari [Qatadah] dari [Habib bin Salim] ia berkata; Ada seseorang yang menggauli budak wanita isterinya diserahkan kepada [An Nu'man bin Basyir], ia pun berkata; Sungguh, aku akan memutuskan dengan putusan Rasulullah shallallahu 'alaihi wasallam, jika isterinya menghalalkan untuknya maka aku akan menderanya sebanyak seratus kali dan jikta ia tidak menghalalkan untuknya maka aku akan merajamnya. Telah menceritakan kepada kami [Ali bin Hujr], telah menceritakan kepada kami [Husyaim] dari [Abu Bisyr] dari [Habib bin Salim], dan [An Nu'man bin Basyir] sebagaimana di atas. dan diriwayatkan dari [Qatadah] bahwa berkata; dituliskan kepada [Habib bin Salim] namun Abu Bisyr tidak mendengar dari Habib bin Salim hadits ini juga, sesungguhnya ia meriwayatkannya dari Khalid bin 'Urfuthah. Ia mengatakan; Dalam hal ini ada hadits serupa dari Salamah bin Al Muhabbaq. Abu Isa berkata; Hadits An Nu'man dalam sanadnya terdapat kegoncangan, ia berkata; Aku mendengar Muhammad berkata; Qatadah tidak mendengar hadits ini dari Habib bin Salim sesungguhnya ia meriwayatkannya dari Khalid bin 'Urfuthah. Abu Isa berkata; Para ulama telah berselisih tentang seseorang yang telah menggauli budak wanita isterinya, maka diriwayatkan dari banyak ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam di antaranya; Ali dan Ibnu Umar; Ia harus dirajam. Sedangkan Ibnu Mas'ud berpendapat; Tidak hukuman atasnya tetapi ia diasingkan. Ahmad dan Ishaq berpendapat kepada hadits yang diriwayatkan oleh An Nu'man bin Basyir dari Nabi shallallahu 'alaihi wasallam."
            },
            {
                "number": 1372,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا مُعَمَّرُ بْنُ سُلَيْمَانَ الرَّقِّيُّ عَنْ الْحَجَّاجِ بْنِ أَرْطَاةَ عَنْ عَبْدِ الْجَبَّارِ بْنِ وَائِلِ بْنِ حُجْرٍ عَنْ أَبِيهِ قَالَاسْتُكْرِهَتْ امْرَأَةٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَرَأَ عَنْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحَدَّ وَأَقَامَهُ عَلَى الَّذِي أَصَابَهَا وَلَمْ يُذْكَرْ أَنَّهُ جَعَلَ لَهَا مَهْرًاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَلَيْسَ إِسْنَادُهُ بِمُتَّصِلٍ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ قَالَ سَمِعْت مُحَمَّدًا يَقُولُ عَبْدُ الْجَبَّارِ بْنُ وَائِلِ بْنِ حُجْرٍ لَمْ يَسْمَعْ مِنْ أَبِيهِ وَلَا أَدْرَكَهُ يُقَالُ إِنَّهُ وُلِدَ بَعْدَ مَوْتِ أَبِيهِ بِأَشْهُرٍ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ أَنْ لَيْسَ عَلَى الْمُسْتَكْرَهَةِ حَدٌّ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr], telah menceritakan kepada kami [Mu'ammar bin Sulaiman Ar Raqqi] dari [Al Hajjaj bin Arthah] dari [Abdul Jabbar bin Wa`il bin Hujr] dari [ayahnya] ia berkata; Pada zaman Rasulullah shallallahu 'alaihi wasallam ada seorang wanita yang dipaksa berzina, lalu Rasulullah shallallahu 'alaihi wasallam menahan hukuman darinya dan menghukum orang yang melakukannya, namun tidak disebutkan bahwa ia harus menyediakan mahar untuk wanita itu. Abu Isa berkata; Hadits ini gharib dan sanadnya tidak bersambung. Hadits ini juga diriwayatkan dari jalur lain. Ia berkata; Aku mendengar Muhammad berkata; Abdul Jabbar bin Hujr tidak mendengar dari ayahnya dan tidak mendapatinya, dikatakan bahwa ia dilahirkan setelah meninggal ayahnya satu bulan. Hadits ini menjadi pedoman amal menurut para ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka bahwa tidak ada hukuman atas orang yang dipaksa berzina."
            },
            {
                "number": 1373,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى النَّيْسَابُورِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ عَنْ إِسْرَائِيلَ حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ الْكِنْدِيِّ عَنْ أَبِيهِأَنَّ امْرَأَةً خَرَجَتْ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُرِيدُ الصَّلَاةَ فَتَلَقَّاهَا رَجُلٌ فَتَجَلَّلَهَا فَقَضَى حَاجَتَهُ مِنْهَا فَصَاحَتْ فَانْطَلَقَ وَمَرَّ عَلَيْهَا رَجُلٌ فَقَالَتْ إِنَّ ذَاكَ الرَّجُلَ فَعَلَ بِي كَذَا وَكَذَا وَمَرَّتْ بِعِصَابَةٍ مِنْ الْمُهَاجِرِينَ فَقَالَتْ إِنَّ ذَاكَ الرَّجُلَ فَعَلَ بِي كَذَا وَكَذَا فَانْطَلَقُوا فَأَخَذُوا الرَّجُلَ الَّذِي ظَنَّتْ أَنَّهُ وَقَعَ عَلَيْهَا وَأَتَوْهَا فَقَالَتْ نَعَمْ هُوَ هَذَا فَأَتَوْا بِهِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا أَمَرَ بِهِ لِيُرْجَمَ قَامَ صَاحِبُهَا الَّذِي وَقَعَ عَلَيْهَا فَقَالَ يَا رَسُولَ اللَّهِ أَنَا صَاحِبُهَا فَقَالَ لَهَا اذْهَبِي فَقَدْ غَفَرَ اللَّهُ لَكِ وَقَالَ لِلرَّجُلِ قَوْلًا حَسَنًا وَقَالَ لِلرَّجُلِ الَّذِي وَقَعَ عَلَيْهَا ارْجُمُوهُ وَقَالَ لَقَدْ تَابَ تَوْبَةً لَوْ تَابَهَا أَهْلُ الْمَدِينَةِ لَقُبِلَ مِنْهُمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ وَعَلْقَمَةُ بْنُ وَائِلِ بْنِ حُجْرٍ سَمِعَ مِنْ أَبِيهِ وَهُوَ أَكْبَرُ مِنْ عَبْدِ الْجَبَّارِ بْنِ وَائِلٍ وَعَبْدُ الْجَبَّارِ لَمْ يَسْمَعْ مِنْ أَبِيهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya An Naisaburi], telah menceritakan kepada kami [Muhammad bin Yusuf] dari [Isra`il], telah menceritakan kepada kami [Simak bin Harb] dari ['Alqamah bin Wa`il Al Kindi] dari [ayahnya] bahwa pada zaman Rasulullah shallallahu 'alaihi wasallam ada seorang wanita yang keluar hendak melakukan sholat, ia bertemu dengan seseorang laki-laki, lalu laki-laki itu menghadang dan memperkosanya. Wanita itu pun berteriak dan laki-laki itu pergi. Kemudian ada seseorang yang melintasinya, wanita itu berkata; Sesungguhnya orang itu telah melakukan begini dan begini kepadaku. Melintas juga sekumpulan orang-orang Muhajirin, wanita itu berkata; Sesungguhnya orang itu telah melakukan begini dan begini kepadaku. Maka mereka beranjak pergi untuk menangkap orang yang dituduh telah memperkosanya, mereka mendatangkan kepadanya, wanita itu berkata; Benar, ini orangnya. Mereka pun mendatangkannya kepada Rasulullah shallallahu 'alaihi wasallam, ketika beliau memerintahkan agar ia dirajam, teman orang yang memerkosa wanita itu berdiri seraya berkata; Wahai Rasulullah, aku adalah temannya. Beliau mengatakan kepada wanita itu: \"Pergilah engkau, Allah telah mengampunimu.\" Beliau berbicara kepada temannya itu dengan perkataan yang baik dan beliau mengatakan kepada orang yang telah menggaulinya: \"Rajamlah ia.\" Beliau bersabda: \"Sungguh, ia telah bertaubat dengan taubat yang sekiranya seluruh penduduk Madinah bertaubat, niscaya dapat mengimbanginya.\" Abu Isa berkata; Hadits ini hasan gharib shahih. 'Alqamah bin Wa`il bin Hujr mendengar dari ayahnya, ia lebih tua dari Abdul Jabbar bin Wa`il sedangkan Abdul Jabbar tidak mendengar dari ayahnya."
            },
            {
                "number": 1374,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو السَّوَّاقُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ وَجَدْتُمُوهُ وَقَعَ عَلَى بَهِيمَةٍ فَاقْتُلُوهُ وَاقْتُلُوا الْبَهِيمَةَ فَقِيلَ لِابْنِ عَبَّاسٍ مَا شَأْنُ الْبَهِيمَةِ قَالَ مَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ شَيْئًا وَلَكِنْ أَرَى رَسُولَ اللَّهِ كَرِهَ أَنْ يُؤْكَلَ مِنْ لَحْمِهَا أَوْ يُنْتَفَعَ بِهَا وَقَدْ عُمِلَ بِهَا ذَلِكَ الْعَمَلُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عَمْرِو بْنِ أَبِي عَمْرٍو عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Amr As Sawwaq], telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Amru bin Abu Amr] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang kalian dapati menggauli binatang, maka bunuhlah ia dan bunuhlah binatangnya.\" Ditanyakan kepada Ibnu Abbas; Ada apa dengan binatang itu? Ia menjawab; Aku tidak mendengar sesuatu pun dari Rasulullah shallallahu 'alaihi wasallam tentang hal itu, tetapi aku melihat Rasulullah shallallahu 'alaihi wasallam membenci untuk dimakan dagingnya atau memanfaatkannya, dan hal itu telah dilakukan. Abu Isa berkata; Hadits ini tidak kami ketahui kecuali dari Hadits Amr bin Abu Amr dari Ikrimah dari Ibnu Abbas dari Nabi shallallahu 'alaihi wasallam."
            },
            {
                "number": 1375,
                "arab": "وَقَدْ رَوَى سُفْيَانُ الثَّوْرِيُّ عَنْ عَاصِمٍ عَنْ أَبِي رُزَيْنٍ عَنْ ابْنِ عَبَّاسٍأَنَّهُ قَالَ مَنْ أَتَى بَهِيمَةً فَلَا حَدَّ عَلَيْهِحَدَّثَنَا بِذَلِكَ مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ وَهَذَا أَصَحُّ مِنْ الْحَدِيثِ الْأَوَّلِ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَقَ",
                "id": "Dan [Sufyan Ats Tsauri], telah meriwayatkan dari ['Ashim] dari [Abu Ruzain] dari [Ibnu Abbas] bahwa ia pernah berkata; Barangsiapa menggauli binatang maka tidak ada hukuman atasnya. Telah menceritakan dengan hadits itu kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan Ats Tsauri], hadits ini lebih shahih dari hadits pertama. Hadits ini menjadi pedoman amal menurut para ulama, ini menjadi pendapat Ahmad dan Ishaq."
            },
            {
                "number": 1376,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو السَّوَّاقُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ وَجَدْتُمُوهُ يَعْمَلُ عَمَلَ قَوْمِ لُوطٍ فَاقْتُلُوا الْفَاعِلَ وَالْمَفْعُولَ بِهِقَالَ وَفِي الْبَاب عَنْ جَابِرٍ وَأَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى وَإِنَّمَا يُعْرَفُ هَذَا الْحَدِيثُ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ هَذَا الْوَجْهِ وَرَوَى مُحَمَّدُ بْنُ إِسْحَقَ هَذَا الْحَدِيثَ عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو فَقَالَ مَلْعُونٌ مَنْ عَمِلَ عَمَلَ قَوْمِ لُوطٍ وَلَمْ يَذْكُرْ فِيهِ الْقَتْلَ وَذَكَرَ فِيهِ مَلْعُونٌ مَنْ أَتَى بَهِيمَةً وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عَاصِمِ بْنِ عُمَرَ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اقْتُلُوا الْفَاعِلَ وَالْمَفْعُولَ بِهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ فِي إِسْنَادِهِ مَقَالٌ وَلَا نَعْرِفُ أَحَدًا رَوَاهُ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ غَيْرَ عَاصِمِ بْنِ عُمَرَ الْعُمَرِيِّ وَعَاصِمُ بْنُ عُمَرَ يُضَعَّفُ فِي الْحَدِيثِ مِنْ قِبَلِ حِفْظِهِ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي حَدِّ اللُّوطِيِّ فَرَأَى بَعْضُهُمْ أَنَّ عَلَيْهِ الرَّجْمَ أَحْصَنَ أَوْ لَمْ يُحْصِنْ وَهَذَا قَوْلُ مَالِكٍ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ و قَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ فُقَهَاءِ التَّابِعِينَ مِنْهُمْ الْحَسَنُ الْبَصْرِيُّ وَإِبْرَاهِيمُ النَّخَعِيُّ وَعَطَاءُ بْنُ أَبِي رَبَاحٍ وَغَيْرُهُمْ قَالُوا حَدُّ اللُّوطِيِّ حَدُّ الزَّانِي وَهُوَ قَوْلُ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Amr As Sawwaq], telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Amru bin Abu Amr] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang kalian dapati melakukan perbuatan kaum Nabi Luth (yakni melakukan homoseksual), maka bunuhlah pelaku dan korbannya.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Jabir dan Abu Hurairah. Abu Isa berkata; Sesungguhnya hadits ini hanya diketahui dari Ibnu Abbas dari Nabi shallallahu 'alaihi wasallam dari jalur ini, namun [Muhammad bin Ishaq] meriwayatkan hadits ini dari [Amr bin Abu Amr], beliau bersabda: \"Terlaknat orang yang melakukan perbuatan kaum Nabi Luth.\" Dan ia tidak menyebutkan pembunuhan, ia menyebutkan dalam hadits itu: \"Terlaknat orang yang menggauli binatang.\" Hadits ini juga telah diriwayatkan dari ['Ashim bin Umar] dari [Suhail bin Abu Shalih] dari [ayahnya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Bunuhlah orang yang melakukan dan yang menjadi korbannya.\" Abu Isa berkata; Hadits ini dalam isnadnya terdapat komentar dan kami tidak mengetahui seseorang pun meriwayatkannya dari Suhail bin Abu Shalih selain 'Ashim bin Umar Al Umari sedangkan 'Ashim bin Umar didla'ifkan dalam periwayatan hadits dari sisi hafalannya. Para ulama berselisih tentang hukuman liwath (homoseksual), sebagian mereka berpendapat; Bahwa ia harus dirajam baik sudah atau belum menikah, ini menjadi pendapat Malik, Asy Syafi'i, Ahmad dan Ishaq. Sedangkan sebagian ulama dari fuqaha tabi'in berpendapat di antaranya Al Hasan Al Bashri, Ibrahim An Nakha'i, 'Atha` bin Abu Rabah dan selain mereka berpendapat; Hukuman liwath seperti hukuman zina, ini menjadi pendapat Ats Tsauri dan ulama Kufah."
            },
            {
                "number": 1377,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا هَمَّامٌ عَنْ الْقَاسِمِ بْنِ عَبْدِ الْوَاحِدِ الْمَكِّيِّ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عُقَيْلٍ أَنَّهُ سَمِعَ جَابِرًا يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَخْوَفَ مَا أَخَافُ عَلَى أُمَّتِي عَمَلُ قَوْمِ لُوطٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ إِنَّمَا نَعْرِفُهُ مِنْ هَذَا الْوَجْهِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عُقَيْلِ بْنِ أَبِي طَالِبٍ عَنْ جَابِرٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Hammam] dari [Al Qasim bin Abdul Wahid Al Makki] dari [Abdullah bin Muhammad bin 'Uqail] bahwa ia mendengar [Jabir] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya sesuatu yang paling aku khawatirkan dari ummatku adalah perbuatan kaum Luth.\" Abu Isa berkata; Hadits ini hasan gharib, sesungguhnya kami hanya mengetahui dari jalur ini dari Abdullah bin Muhammad bin 'Uqail bin Abu Thalib dari Jabir."
            },
            {
                "number": 1378,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ حَدَّثَنَا أَيُّوبُ عَنْ عِكْرِمَةَ أَنَّ عَلِيًّاحَرَّقَ قَوْمًا ارْتَدُّوا عَنْ الْإِسْلَامِ فَبَلَغَ ذَلِكَ ابْنَ عَبَّاسٍ فَقَالَ لَوْ كُنْتُ أَنَا لَقَتَلْتُهُمْ لِقَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ وَلَمْ أَكُنْ لِأُحَرِّقَهُمْ لِقَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُعَذِّبُوا بِعَذَابِ اللَّهِ فَبَلَغَ ذَلِكَ عَلِيًّا فَقَالَ صَدَقَ ابْنُ عَبَّاسٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ حَسَنٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ فِي الْمُرْتَدِّ وَاخْتَلَفُوا فِي الْمَرْأَةِ إِذَا ارْتَدَّتْ عَنْ الْإِسْلَامِ فَقَالَتْ طَائِفَةٌ مِنْ أَهْلِ الْعِلْمِ تُقْتَلُ وَهُوَ قَوْلُ الْأَوْزَاعِيِّ وَأَحْمَدَ وَإِسْحَقَ وَقَالَتْ طَائِفَةٌ مِنْهُمْ تُحْبَسُ وَلَا تُقْتَلُ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَغَيْرِهِ مِنْ أَهْلِ الْكُوفَةِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah Adl Dlabbi Al Bashri], telah menceritakan kepada kami [Abdul Wahhab Ats Tsaqafi] telah menceritakan kepada kami [Ayyub] dari [Ikrimah] bahwa [Ali] pernah membakar sebuah kaum yang murtad dari Islam, hal itu sampai kepada [Ibnu Abbas], ia pun berkata; Seandainya itu aku, niscaya aku akan membunuhnya, sebagaimana sabda Rasulullah shallallahu 'alaihi wasallam: \"Barangsiapa yang mengganti agamanya (murtad), maka bunuhlah ia.\" Dan aku tidak akan membakar mereka, berdasarkan sabda Rasulullah shallallahu 'alaihi wasallam: \"Janganlah kalian mengadzab dengan adzab Allah.\" Hal itu sampai juga kepada Ali, ia pun berkata; Ibnu Abbas benar. Abu Isa berkata; Hadits ini shahih hasan dan menjadi pedoman amal menurut para ulama ulama dalam masalah murtad, namun mereka berselisih tentan wanita jika ia murtad dari Islam. Sebagian kelompok dari para ulama berpendapat; Ia dibunuh, ini menjadi pendapat Al Auza'i, Ahmad dan Ishaq. Sedangkan sebagian dari mereka berpendapat; Ia dipenjara dan tidak dibunuh, ini menjadi pendapat Sufyan Ats Tsauri dan selainnya dari ulama Kufah."
            },
            {
                "number": 1379,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ وَأَبُو السَّائِبِ سَلْمُ بْنُ جُنَادَةَ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ عَنْ جَدِّهِ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَىعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَمَلَ عَلَيْنَا السِّلَاحَ فَلَيْسَ مِنَّاقَالَ وَفِي الْبَاب عَنْ ابْنِ عُمَرَ وَابْنِ الزُّبَيْرِ وَأَبِي هُرَيْرَةَ وَسَلَمَةَ بْنِ الْأَكْوَعِ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي مُوسَى حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] dan [Abu As Sa`ib Salm bin Junadah] keduanya berkata; Telah menceritakan kepada kami [Abu Usamah] dari [Buraidah bin Abdullah bin Abu Burdah] dari kakeknya [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barang siapa yang mengangkat senjata untuk memerangi kami, maka ia bukan termasuk golongan kami.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Ibnu Umar, Ibnu Az Zubair, Abu Hurairah dan Salamah bin Al Akwa`. Abu Isa berkata; Hadits Abu Musa adalah hadits hasan shahih."
            },
            {
                "number": 1380,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ إِسْمَعِيلَ بْنِ مُسْلِمٍ عَنْ الْحَسَنِ عَنْ جُنْدُبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدُّ السَّاحِرِ ضَرْبَةٌ بِالسَّيْفِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ مَرْفُوعًا إِلَّا مِنْ هَذَا الْوَجْهِ وَإِسْمَعِيلُ بْنُ مُسْلِمٍ الْمَكِّيُّ يُضَعَّفُ فِي الْحَدِيثِ مِنْ قِبَلِ حِفْظِهِ وَإِسْمَعِيلُ بْنُ مُسْلِمٍ الْعَبْدِيُّ الْبَصْرِيُّ قَالَ وَكِيعٌ هُوَ ثِقَةٌ وَيُرْوَى عَنْ الْحَسَنِ أَيْضًا وَالصَّحِيحُ عَنْ جُنْدَبٍ مَوْقُوفٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ وَهُوَ قَوْلُ مَالِكِ بْنِ أَنَسٍ و قَالَ الشَّافِعِيُّ إِنَّمَا يُقْتَلُ السَّاحِرُ إِذَا كَانَ يَعْمَلُ فِي سِحْرِهِ مَا يَبْلُغُ بِهِ الْكُفْرَ فَإِذَا عَمِلَ عَمَلًا دُونَ الْكُفْرِ فَلَمْ نَرَ عَلَيْهِ قَتْلًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Abu Mu'awiyah] dari [Isma'il bin Muslim] dari [Al Hasan] dari [Jundub] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hukuman bagi penyihir adalah dipenggal dengan pedang.\" Abu Isa berkata; Hadits ini tidak kami ketahui diriwayatkan secara marfu' kecuali dari jalur ini dan Isma'il bin Muslim Al Makki didla'ifkan dalam periwayatan hadits dari segi hafalannya, sedangkan Isma'il bin Muslim Al Abdi Al Bashri, Waki' berkata tentangnya; Ia seorang yang tsiqah dan hadits ini diriwayatkan juga dari Al Hasan. Dan yang shahih dari Jundub adalah riwayat mauquf. Hadits ini menjadi pedoman amal menurut sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka, ini menjadi pendapat Malik bin Anas. Asy Syafi'i berkata; Sesungguhnya seorang penyihir dibunuh jika ia melakukan perbuatan sihir yang mencapai kekufuran namun jika ia melakukan perbuatan selain kekufuran maka kami tidak berpendapat ia harus dibunuh."
            },
            {
                "number": 1381,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو السَّوَّاقُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ مُحَمَّدِ بْنِ زَائِدَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ وَجَدْتُمُوهُ غَلَّ فِي سَبِيلِ اللَّهِ فَاحْرِقُوا مَتَاعَهُقَالَ صَالِحٌ فَدَخَلْتُ عَلَى مَسْلَمَةَ وَمَعَهُ سَالِمُ بْنُ عَبْدِ اللَّهِ فَوَجَدَ رَجُلًا قَدْ غَلَّ فَحَدَّثَ سَالِمٌ بِهَذَا الْحَدِيثِ فَأَمَرَ بِهِ فَأُحْرِقَ مَتَاعُهُ فَوُجِدَ فِي مَتَاعِهِ مُصْحَفٌ فَقَالَ سَالِمٌ بِعْ هَذَا وَتَصَدَّقْ بِثَمَنِهِ قَالَ أَبُو عِيسَى هَذَا الْحَدِيثُ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ الْأَوْزَاعِيِّ وَأَحْمَدَ وَإِسْحَقَ قَالَ وَسَأَلْتُ مُحَمَّدًا عَنْ هَذَا الْحَدِيثِ فَقَالَ إِنَّمَا رَوَى هَذَا صَالِحُ بْنُ مُحَمَّدِ بْنِ زَائِدَةَ وَهُوَ أَبُو وَاقِدٍ اللَّيْثِيُّ وَهُوَ مُنْكَرُ الْحَدِيثِ قَالَ مُحَمَّدٌ وَقَدْ رُوِيَ فِي غَيْرِ حَدِيثٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْغَالِّ فَلَمْ يَأْمُرْ فِيهِ بِحَرْقِ مَتَاعِهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Amr As Sawwaq], telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Shalih bin Muhammad bin Za`idah] dari [Salim bin Abdullah] dari [Abdullah bin Umar] dari [Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang kalian dapati mengambil ghanimah sebelum dibagi dalam peperangan di jalan Allah, maka bakarlah barang (harta bendanya itu).\" Shalih berkata; Aku pun masuk ke rumah Maslamah sedang bersama Salim bin Abdullah lalu ia mendapati seseorang mengambil ghanimah sebelum dibagi. Salim pun menyampaikan hadits ini lalu ia menyuruhnya dan membakar perhiasannya, ternyata di dalam perhiasan itu terdapat mushaf. Salim berkata; Juallah ini dan sedekahkan hasilnya. Abu Isa berkata; Hadits ini gharib tidak kami ketahui kecuali dari jalur ini, hadits ini menjadi pedoman amal menurut sebagian ulama, ini menjadi pendapat Al Auza'i, Ahmad dan Ishaq. Ia berkata; Dan aku bertanya kepada Muhammad tentang hadits ini, ia pun menjawab; Sesungguhnya yang meriwayatkan hadits ini adalah Shalih bin Muhammad bin Za`idah, ia adalah Abu Waqid Al Laitsi, ia mungkar dalam periwayatan hadits. Muhammad berkata; Dan diriwayatkan juga pada hadits lain dari Nabi shallallahu 'alaihi wasallam tentang mengambil ghanimah sebelum dibagi namun beliau tidak memerintahkan untuk membakar barangnya. Abu Isa berkata; Hadits ini gharib."
            },
            {
                "number": 1382,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ إِبْرَاهِيمَ بْنِ إِسْمَعِيلَ بْنِ أَبِي حَبِيبَةَ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَالَ الرَّجُلُ لِلرَّجُلِ يَا يَهُودِيُّ فَاضْرِبُوهُ عِشْرِينَ وَإِذَا قَالَ يَا مُخَنَّثُ فَاضْرِبُوهُ عِشْرِينَ وَمَنْ وَقَعَ عَلَى ذَاتِ مَحْرَمٍ فَاقْتُلُوهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَإِبْرَاهِيمُ بْنُ إِسْمَعِيلَ يُضَعَّفُ فِي الْحَدِيثِ وَقَدْ رُوِيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غَيْرِ وَجْهٍ رَوَاهُ الْبَرَاءُ بْنُ عَازِبٍ وَقُرَّةُ بْنُ إِيَاسٍ الْمُزَنِيُّ أَنَّ رَجُلًا تَزَوَّجَ امْرَأَةَ أَبِيهِ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَتْلِهِ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَصْحَابِنَا قَالُوا مَنْ أَتَى ذَاتَ مَحْرَمٍ وَهُوَ يَعْلَمُ فَعَلَيْهِ الْقَتْلُ و قَالَ أَحْمَدُ مَنْ تَزَوَّجَ أُمَّهُ قُتِلَ و قَالَ إِسْحَقُ مَنْ وَقَعَ عَلَى ذَاتِ مَحْرَمٍ قُتِلَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rafi'], telah menceritakan kepada kami [Ibnu Abu Fudaik] dari [Ibrahim bin Isma'il bin Abu Habibah] dari [Dawud bin Al Hushain] dari [Ikrimah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika seseorang berkata kepada orang lain; Wahai orang Yahudi, maka pukullah ia dua puluh kali, jika ia berkata kepadanya; Wahai orang banci, maka pukullah ia dua puluh kali, dan barangsiapa yang menggauli mahramnya maka bunuhlah ia.\" Abu Isa berkata; Hadits ini tidak kami ketahui kecuali dari jalur ini sedangkan Ibrahim bin Isma'il didha'ifkan dalam periwayatan hadits. Diriwayatkan juga dari Nabi shallallahu 'alaihi wasallam melalui jalur lain, Al Bara` bin Azib dan Qurrah bin Iyyas Al Muzani meriwayatkan bahwa ada seseorang menikahi isteri ayahnya lalu Nabi shallallahu 'alaihi wasallam memerintah untuk membunuhnya. Hadits ini menjadi pedoman amal menurut sahabat kami, mereka berpendapat; Barangsiapa menggauli mahramnya sedangkan ia mengetahuinya maka ia harus dibunuh. Sedangkan Ahmad berkata; Barangsiapa menikahi ibunya ia harus dibunuh. Ishaq berkata; Barangsiapa menggauli mahramnya, ia harus dibunuh."
            },
            {
                "number": 1383,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبيبٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي بُرْدَةَ بْنِ نِيَارٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُجْلَدُ فَوْقَ عَشْرِ جَلَدَاتٍ إِلَّا فِي حَدٍّ مِنْ حُدُودِ اللَّهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ بُكَيْرِ بْنِ الْأَشَجِّ وَقَدْ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي التَّعْزِيرِ وَأَحْسَنُ شَيْءٍ رُوِيَ فِي التَّعْزِيرِ هَذَا الْحَدِيثُ قَالَ وَقَدْ رَوَى هَذَا الْحَدِيثَ ابْنُ لَهِيعَةَ عَنْ بُكَيْرٍ فَأَخْطَأَ فِيهِ وَقَالَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ خَطَأٌ وَالصَّحِيحُ حَدِيثُ اللَّيْثِ بْنِ سَعْدٍ إِنَّمَا هُوَ عَبْدُ الرَّحْمَنِ بْنُ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي بُرْدَةَ بْنِ نِيَارٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari [Bukair bin Abdullah bin Al Asyajj] dari [Sulaiman bin Yasar] dari [Abdurrahman bin Jabir bin Abdullah] dari [Abu Burdah bin Niyar] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh didera lebih dari sepuluh kali kecuali dalam salah satu hukuman Allah (dalam masalah had).\" Abu Isa berkata; Hadits ini hasan gharib tidak kami ketahui kecuali dari Hadits Bukair bin Al Asyajj. Para ulama berselisih tentang pengasingan dan sesuatu yang paling baik diriwayatkan tentang pengasingan adalah hadits ini. Ia mengatakan; Ibnu Lahi'ah telah meriwayatkan hadits ini dari Bukair namun ia melakukan kesalahan di dalamnya. Dan ia mengatakan; Dari Abdurrahman bin Jabir bin Abdullah dari ayahnya dari Nabi shallallahu 'alaihi wasallam, ini adalah salah, yang shahih adalah Hadits Al Laits bin Sa'd yaitu Abdurrahman bin Jabir bin Abdullah dari Abu Burdah bin Niyar dari Nabi shallallahu 'alaihi wasallam."
            },
            {
                "number": 1384,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا الْحَجَّاجُ عَنْ مَكْحُولٍ عَنْ أَبِي ثَعْلَبَةَ ح وَالْحَجَّاجُ عَنْ الْوَلِيدِ بْنِ أَبِي مَالِكٍ عَنْ عَائِذِ اللَّهِ بْنِ عَبْدِ اللَّهِ أَنَّهُ سَمِعَ أَبَا ثَعْلَبَةَ الْخُشَنِيَّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا أَهْلُ صَيْدٍ قَالَ إِذَا أَرْسَلْتَ كَلْبَكَ وَذَكَرْتَ اسْمَ اللَّهِ عَلَيْهِ فَأَمْسَكَ عَلَيْكَ فَكُلْ قُلْتُ وَإِنْ قَتَلَ قَالَ وَإِنْ قَتَلَ قُلْتُ إِنَّا أَهْلُ رَمْيٍ قَالَ مَا رَدَّتْ عَلَيْكَ قَوْسُكَ فَكُلْ قَالَ قُلْتُ إِنَّا أَهْلُ سَفَرٍ نَمُرُّ بِالْيَهُودِ وَالنَّصَارَى وَالْمَجُوسِ فَلَا نَجِدُ غَيْرَ آنِيَتِهِمْ قَالَ فَإِنْ لَمْ تَجِدُوا غَيْرَهَا فَاغْسِلُوهَا بِالْمَاءِ ثُمَّ كُلُوا فِيهَا وَاشْرَبُواقَالَ وَفِي الْبَاب عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَعَائِذُ اللَّهِ بْنُ عَبْدِ اللَّهِ هُوَ أَبُو إِدْرِيسَ الْخَوْلَانِيُّ وَاسْمُ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ جُرْثُومٌ وَيُقَالُ جُرْثُمُ بْنُ نَاشِبٍ وَيُقَالُ ابْنُ قَيْسٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Yazid bin Harun], telah menceritakan kepada kami [Al Hajjaj] dari [Makhul] dari [Abu Tsa'labah], hadits diriwayatkan juga dengan jalur [Al Hajjaj] dari [Al Walid bin Abu Malik] dari [A'idzillah bin Abdullah] bahwa ia mendengar [Abu Tsa'labah Al Khusyani] berkata; Aku berkata; Wahai Rasulullah, kami adalah pemburu. Beliau bersabda: \"Jika engkau mengutus (berburu dengan) anjingmu dan engkau menyebut nama Allah saat melepaskannya, lalu ia menangkap mangsa untukmu maka makanlah hasil buruannya itu.\" Aku bertanya; Jika ia telah mati. Beliau menjawab: \"Walaupun telah mati.\" Aku bertanya lagi; Sesungguhnya kami adalah ahli memanah. Beliau bersabda: \"Apa yang terkena oleh panahmu (hewan buruan yang terkena panah), maka makanlah.\" Ia melanjutkan; Aku bertanya; Sesungguhnya kami penduduk Safar, kami melewati orang-orang yahudi, nashrani dan majusi, kami tidak mendapati selain bejana-bejana mereka. Beliau menjawab: \"Jika kalian tidak mendapati selain bejana itu, maka cucilah dengan air kemudian makanlah dan minumlah menggunakan bejana itu.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari 'Adi bin Hatim. Abu Isa berkata; Hadits ini hasan shahih, A`idzullah bin Abdullah adalah Abu Idris Al Khaulani dan nama Abu Tsa'labah Al Khusyani adalah Jurtsum, terkadang dipanggil Jurtsum bin Nasyib dan terkadang dipanggil Ibnu Qais."
            },
            {
                "number": 1385,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا قَبِيصَةُ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ هَمَّامِ بْنِ الْحَارِثِ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا نُرْسِلُ كِلَابًا لَنَا مُعَلَّمَةً قَالَ كُلْ مَا أَمْسَكْنَ عَلَيْكَ قُلْتُ يَا رَسُولَ اللَّهِ وَإِنْ قَتَلْنَ قَالَ وَإِنْ قَتَلْنَ مَا لَمْ يَشْرَكْهَا كَلْبٌ غَيْرُهَا قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا نَرْمِي بِالْمِعْرَاضِ قَالَ مَا خَزَقَ فَكُلْ وَمَا أَصَابَ بِعَرْضِهِ فَلَا تَأْكُلْحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ نَحْوَهُ إِلَّا أَنَّهُ قَالَ وَسُئِلَ عَنْ الْمِعْرَاضِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan], telah menceritakan kepada kami [Qabishah] dari [Sufyan] dari [Manshur] dari [Ibrahim] dari [Hammam bin Al Harits] dari ['Adi bin Hatim] ia berkata; Aku berkata; Wahai Rasulullah, sesungguhnya kami mengutus (berburu dengan) seekor anjing yang terlatih. Beliau bersabda: \"Makanlah setiap apa yang ditangkap untukmu.\" Aku bertanya; Wahai Rasulullah, jika ia membunuhnya? Beliau menjawab: \"Walaupun ia membunuhnya selama tidak ada anjing lain yang ikut membunuhnya.\" Ia melanjutkan; Aku bertanya; Wahai Rasulullah, sesungguhnya kami melempar dengan sisi panah. Beliau menjawab: \"Apa yang ia tembus (oleh panah itu) makanlah, apa yang terkena sisi panah janganlah engkau makan.\" Telah menceritakan kepada kami [Muhammad bin Yahya] telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Manshur] seperti itu kecuali bahwa ia berkata; Dan beliau ditanya tentang sisi panah. Abu Isa berkata; Haditsi ini hasan shahih."
            },
            {
                "number": 1386,
                "arab": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى حَدَّثَنَا وَكِيعٌ حَدَّثَنَا شَرِيكٌ عَنْ الْحَجَّاجِ عَنْ الْقَاسِمِ بْنِ أَبِي بَزَّةَ عَنْ سُلَيْمَانَ الْيَشْكُرِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَنُهِينَا عَنْ صَيْدِ كَلْبِ الْمَجُوسِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ لَا يُرَخِّصُونَ فِي صَيْدِ كَلْبِ الْمَجُوسِ وَالْقَاسِمُ بْنُ أَبِي بَزَّةَ هُوَ الْقَاسِمُ بْنُ نَافِعٍ الْمَكِّيُّ",
                "id": "Telah menceritakan kepada kami [Yusuf bin Isa], telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Syarik] dari [Al Hajjaj] dari [Al Qosim bin Abu Bazzah] dari [Sulaiman Al Yasykuri] dari [Jabir bin Abdullah] ia berkata; Kami dilarang dari hasil buruan anjng Majusi. Abu Isa berkata; Hadits ini gharib tidak kami ketahui kecuali dari jalur ini. Hadits ini menjadi pedoman amal menurut kebanyakan ulama, mereka tidak membolehkan berburu dengan anjing Majusi. Al Qasim bin Abu Bazzah adalah Al Qasim bin Nafi' Al Makki."
            },
            {
                "number": 1387,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ وَهَنَّادٌ وَأَبُو عَمَّارٍ قَالُوا حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ مُجَالِدٍ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَيْدِ الْبَازِي فَقَالَ مَا أَمْسَكَ عَلَيْكَ فَكُلْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ مُجَالِدٍ عَنْ الشَّعْبِيِّ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ لَا يَرَوْنَ بِصَيْدِ الْبُزَاةِ وَالصُّقُورِ بَأْسًا و قَالَ مُجَاهِدٌ الْبُزَاةُ هُوَ الطَّيْرُ الَّذِي يُصَادُ بِهِ مِنْ الْجَوَارِحِ الَّتِي قَالَ اللَّهُ تَعَالَى{ وَمَا عَلَّمْتُمْ مِنْ الْجَوَارِحِ }فَسَّرَ الْكِلَابَ وَالطَّيْرَ الَّذِي يُصَادُ بِهِ وَقَدْ رَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ فِي صَيْدِ الْبَازِي وَإِنْ أَكَلَ مِنْهُ وَقَالُوا إِنَّمَا تَعْلِيمُهُ إِجَابَتُهُ وَكَرِهَهُ بَعْضُهُمْ وَالْفُقَهَاءُ أَكْثَرُهُمْ قَالُوا يَأْكُلُ وَإِنْ أَكَلَ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali], [Hannad] dan [Abu 'Ammar] mereka berkata; Telah menceritakan kepada kami [Isa bin Yunus] dari [Mujalid] dari [Asy Sya'bi] dari ['Adi bin Hatim] ia berkata; Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang buruan burung elang. Beliau menjawab: \"Apa yang didapat untukmu makanlah.\" Abu Isa berkata; Hadits ini tidak kami ketahui kecuali dari Hadits Mujalid dari Asy Sya'bi. Hadits ini menjadi pedoman amal menurut para ulama, mereka membolehkan berburu dengan burung pemangsa dan burung elang. Mujalid berkata; Al Buzah adalah burung yang telah dilatih untuk berburu, sebagaimana yang Allah firmankan: (Dan (buruan yang ditangkap) oleh binatang buas yang Telah kamu ajar dengan melatih nya untuk berburu). Ia menafsirkan dengan anjing dan burung yang dilatih untuk berburu. Sebagian ulama membolehkan berburu dengan burung elang walaupun ia memakannya. Dan mereka mengatakan; Sesungguhnya wajib untuk mengajarinya, namun sebagian dari mereka dan para fuqaha memakruhkan, kebanyakan mereka berpendapat; Boleh memakannya walaupun ia ikut memakannya."
            },
            {
                "number": 1388,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ أَخْبَرَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ قَال سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ يُحَدِّثُ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَرْمِي الصَّيْدَ فَأَجِدُ فِيهِ مِنْ الْغَدِ سَهْمِي قَالَ إِذَا عَلِمْتَ أَنَّ سَهْمَكَ قَتَلَهُ وَلَمْ تَرَ فِيهِ أَثَرَ سَبُعٍ فَكُلْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ وَرَوَى شُعْبَةُ هَذَا الْحَدِيثَ عَنْ أَبِي بِشْرٍ وَعَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ عَدِيِّ بْنِ حَاتِمٍ مِثْلَهُ وَكِلَا الْحَدِيثَيْنِ صَحِيحٌ وَفِي الْبَاب عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan], telah menceritakan kepada kami [Abu Dawud] telah mengabarkan kepada kami [Syu'bah] dari [Abu Bisyr] ia berkata; Aku mendengar [Sa'id bin Jubair] menceritakan dari ['Adi bin Hatim] ia berkata; Aku bertanya; Wahai Rasulullah, aku memanah buruan lalu aku mendapati esok harinya tertancap panahku? Beliau menjawab: \"Jika engkau mengetahui bahwa panahmu yang membunuhnya dan engkau tidak melihat bekas hewan buas, maka makanlah.\" Abu Isa berkata; Hadits ini hasan shahih dan menjadi pedoman amal menurut para ulama, [Syu'bah] meriwayatkan hadits ini dari [Abu Bisyr] dan [Abdul Malik bin Maisarah] dari [Sa'id bin Jubair] dari ['Adi bin Hatim] seperti itu, kedua hadits itu shahih. Dalam hal ini ada hadits serupa dari Abu Tsa'labah Al Khusyani."
            },
            {
                "number": 1389,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنِي عَاصِمٌ الْأَحْوَلُ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّيْدِ فَقَالَ إِذَا رَمَيْتَ بِسَهْمِكَ فَاذْكُرْ اسْمَ اللَّهِ فَإِنْ وَجَدْتَهُ قَدْ قُتِلَ فَكُلْ إِلَّا أَنْ تَجِدَهُ قَدْ وَقَعَ فِي مَاءٍ فَلَا تَأْكُلْ فَإِنَّكَ لَا تَدْرِي الْمَاءُ قَتَلَهُ أَوْ سَهْمُكَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Abdullah bin Al Mubarak] telah mengabarkan kepadaku ['Ashim Al Ahwal] dari [Asy Sya'bi] dari ['Adi bin Hatim] ia berkata; Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang hewan buruan. Beliau menjawab: \"Jika engkau melempar dengan panahmu sebutlah nama Allah, jika engkau mendapatinya telah mati maka makanlah kecuali engkau mendapatinya tergenang di air, jangan engkau makan karena engkau tidak tahu apakah air atau panahmu yang membunuhnya.\" Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 1390,
                "arab": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ مُجَالِدٍ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَيْدِ الْكَلْبِ الْمُعَلَّمِ قَالَ إِذَا أَرْسَلْتَ كَلْبَكَ الْمُعَلَّمَ وَذَكَرْتَ اسْمَ اللَّهِ فَكُلْ مَا أَمْسَكَ عَلَيْكَ فَإِنْ أَكَلَ فَلَا تَأْكُلْ فَإِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ قُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ خَالَطَتْ كِلَابَنَا كِلَابٌ أُخَرُ قَالَ إِنَّمَا ذَكَرْتَ اسْمَ اللَّهِ عَلَى كَلْبِكَ وَلَمْ تَذْكُرْ عَلَى غَيْرِهِقَالَ سُفْيَانُ أَكْرَهُ لَهُ أَكْلَهُ قَالَ أَبُو عِيسَى وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ فِي الصَّيْدِ وَالذَّبِيحَةِ إِذَا وَقَعَا فِي الْمَاءِ أَنْ لَا يَأْكُلَ فَقَالَ بَعْضُهُمْ فِي الذَّبِيحَةِ إِذَا قُطِعَ الْحُلْقُومُ فَوَقَعَ فِي الْمَاءِ فَمَاتَ فِيهِ فَإِنَّهُ يُؤْكَلُ وَهُوَ قَوْلُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ وَقَدْ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي الْكَلْبِ إِذَا أَكَلَ مِنْ الصَّيْدِ فَقَالَ أَكْثَرُ أَهْلِ الْعِلْمِ إِذَا أَكَلَ الْكَلْبُ مِنْهُ فَلَا تَأْكُلْ وَهُوَ قَوْلُ سُفْيَانَ وَعَبْدِ اللَّهِ بْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ وَرَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ فِي الْأَكْلِ مِنْهُ وَإِنْ أَكَلَ الْكَلْبُ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Ibnu Abu Umar], telah menceritakan kepada kami [Sufyan] dari [Mujalid] dari [Asy Sya'bi] dari ['Adi bin Hatim] ia berkata; Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang berburu dengan anjing terlatih. Beliau menjawab: \"Jika engkau mengutus anjingmu yang terlatih dan menyebut nama Allah, maka makanlah apa yang ditangkapkan untukmu. Jika ia memakannya maka janganlah engkau memakannya, karena ia menangkap untuk dirinya.\" Aku bertanya; Wahai Rasulullah, jika anjing kami bercampur dengan anjing lain? Beliau menjawab: \"Sesungguhnya engkau menyebut nama Allah untuk (melepas) anjingmu dan engkau tidak menyebutnya (asma Allah, basmalah) untuk yang lain.\" Sufyan berkata; Aku memakruhkan untuk memakannya. Abu Isa berkata; Hadits ini menjadi pedoman amal menurut sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka tentang hewan buruan dan sembelihan jika jatuh ke dalam air agar tidak memakannya. Sebagian mereka berpendapat tentang hewan sembelihan; Jika terpotong tenggorokannya lalu jatuh ke dalam air dan mati maka ia dimakan, ini menjadi pendapat Abdullah bin Al Mubarak. Sedangkan para ulama berselisih tentang anjing yang memakan hewan buruan, kebanyakan mereka berpendapat; Jika anjing itu makan darinya maka jangan engkau makan, ini menjadi pendapat Sufyan dan Abdullah bin Al Mubarak, Asy Syafi'i, Ahmad dan Ishaq, namun sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka membolehkan makan darinya meskipun anjing memakan darinya."
            },
            {
                "number": 1391,
                "arab": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى حَدَّثَنَا وَكِيعٌ حَدَّثَنَا زَكَرِيَّا عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ مَا أَصَبْتَ بِحَدِّهِ فَكُلْ وَمَا أَصَبْتَ بِعَرْضِهِ فَهُوَ وَقِيذٌحَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ زَكَرِيَّا عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَهْلِ الْعِلْمِ",
                "id": "Telah menceritakan kepada kami [Yusuf bin Isa], telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Zakariya] dari [Asy Sya'bi] dari ['Adi bin Hatim] ia berkata; Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang buruan yang terkena sisi panah. Beliau menjawab: \"Apa yang terkena dengan besinya, maka makanlah, dan yang terkena sisinya maka itu adalah mati secara perlahan.\" Telah menceritakan kepada kami [Ibnu Abu Umar], telah menceritakan kepada kami [Sufyan] dari [Zakariya] dari [Asy Sya'bi] dari ['Adi bin Hatim] dari Nabi shallallahu 'alaihi wasallam seperti itu. Abu Isa berkata; Hadits ini hasan shahih dan menjadi pedoman amal menurut para ulama."
            },
            {
                "number": 1392,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ الشَّعْبِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَجُلًا مِنْ قَوْمِهِ صَادَ أَرْنَبًا أَوْ اثْنَيْنِ فَذَبَحَهُمَا بِمَرْوَةٍ فَعَلَّقَهُمَا حَتَّى لَقِيَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ فَأَمَرَهُ بِأَكْلِهِمَاقَالَ وَفِي الْبَاب عَنْ مُحَمَّدِ بْنِ صَفْوَانَ وَرَافِعٍ وَعَدِيِّ بْنِ حَاتِمٍ قَالَ أَبُو عِيسَى وَقَدْ رَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ أَنْ يُذَكِّيَ بِمَرْوَةٍ وَلَمْ يَرَوْا بِأَكْلِ الْأَرْنَبِ بَأْسًا وَهُوَ قَوْلُ أَكْثَرِ أَهْلِ الْعِلْمِ وَقَدْ كَرِهَ بَعْضُهُمْ أَكْلَ الْأَرْنَبِ وَقَدْ اخْتَلَفَ أَصْحَابُ الشَّعْبِيِّ فِي رِوَايَةِ هَذَا الْحَدِيثِ فَرَوَى دَاوُدُ بْنُ أَبِي هِنْدٍ عَنْ الشَّعْبِيِّ عَنْ مُحَمَّدِ بْنِ صَفْوَانَ وَرَوَى عَاصِمٌ الْأَحْوَلُ عَنْ الشَّعْبِيِّ عَنْ صَفْوَانَ بْنِ مُحَمَّدٍ أَوْ مُحَمَّدِ بْنِ صَفْوَانَ وَمُحَمَّدُ بْنُ صَفْوَانَ أَصَحُّ وَرَوَى جَابِرٌ الْجُعْفِيُّ عَنْ الشَّعْبِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ نَحْوَ حَدِيثِ قَتَادَةَ عَنْ الشَّعْبِيِّ وَيُحْتَمَلُ أَنَّ رِوَايَةَ الشَّعْبِيِّ عَنْهُمَا قَالَ مُحَمَّدٌ حَدِيثُ الشَّعْبِيِّ عَنْ جَابِرٍ غَيْرُ مَحْفُوظٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya Al Qutha'i], telah menceritakan kepada kami [Abdul A'la] dari [Sa'id] dari [Qatadah] dari [Asy Sya'bi] dari [Jabir bin Abdullah] bahwa ada seseorang dari kaumnya berburu satu atau dua kelinci lalu menyembelihnya di Marwah dan menggantungkannya hingga ia menemui Rasulullah shallallahu 'alaihi wasallam dan menanyakan tentangnya. Maka beliau menyuruh untuk memakannya. Ia mengatakan; Dalam hal ini ada hadits serupa dari Muhammad bin Shafwan, Rafi' dan 'Adi bin Hatim. Abu Isa berkata; Sebagian ulama membolehkan untuk menyembelih di Marwah dan membolehkan memakan daging kelinci, ini menjadi pendapat kebanyakan ulama, namun sebagian mereka memakruhkan makan daging kelinci. Para sahabat Asy Sya'bi berselisih dalam periwayatan hadits ini, [Daud bin Abu Hind] meriwayatkan dari [Asy Sya'bi] dari [Muhammad bin Shafwan] dan ['Ashim Al Ahwal] meriwayatkan dari [Asy Sya'bi] dari [Shafwan bin Muhammad] atau Muhammad bin Shafwan, Muhammad bin Shafwan lebih shahih. [Jabir Al Ju'fi] meriwayatkan dari [Asy Sya'bi] dari [Jabir bin Abdullah] seperti Hadits Qatadah dari Asy Sya'bi dan kemungkinan riwayat Asy Sya'bi dari keduanya. Muhammad berkata; Hadits Asy Sya'bi dari Jabir tidak terjaga."
            },
            {
                "number": 1393,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ أَبِي أَيُّوبَ الْأَفْرِيقِيِّ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي الدَّرْدَاءِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ الْمُجَثَّمَةِ وَهِيَ الَّتِي تُصْبَرُ بِالنَّبْلِقَالَ وَفِي الْبَاب عَنْ عِرْبَاضِ بْنِ سَارِيَةَ وَأَنَسٍ وَابْنِ عُمَرَ وَابْنِ عَبَّاسٍ وَجَابِرٍ وَأَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي الدَّرْدَاءِ حَدِيثٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib], telah menceritakan kepada kami [Abdurrahim bin Sulaiman] dari [Abu Ayyub Al Afriqi] dari [Shafwan bin Sulaim] dari [Sa'id bin Al Musayyab] dari [Abu Ad Darda`] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang memakan mujatstsamah yaitu hewan yang diundi dan dilempari dengan batu atau panah agar mati (tidak dengan disembelih). Ia mengatakan; Dalam hal ini ada hadits serupa dari 'Irbadl bin Sariyah, Anas, Ibnu Umar, Ibnu Abbas, Jabir dan Abu Hurairah. Abu Isa berkata; Hadits Abu Ad Darda` adalah hadits gharib."
            },
            {
                "number": 1394,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا أَبُو عَاصِمٍ عَنْ وَهْبٍ أَبِي خَالِدٍ قَالَ حَدَّثَتْنِي أُمُّ حَبِيبَةَ بِنْتُ الْعِرْبَاضِ وَهُوَ ابْنُ سَارِيَةَ عَنْ أَبِيهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى يَوْمَ خَيْبَرَ عَنْ لُحُومِ كُلِّ ذِي نَابٍ مِنْ السَّبُعِ وَعَنْ كُلِّ ذِي مِخْلَبٍ مِنْ الطَّيْرِ وَعَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ وَعَنْ الْمُجَثَّمَةِ وَعَنْ الْخَلِيسَةِ وَأَنْ تُوطَأَ الْحَبَالَى حَتَّى يَضَعْنَ مَا فِي بُطُونِهِنَّقَالَ مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ سُئِلَ أَبُو عَاصِمٍ عَنْ الْمُجَثَّمَةِ قَالَ أَنْ يُنْصَبَ الطَّيْرُ أَوْ الشَّيْءُ فَيُرْمَى وَسُئِلَ عَنْ الْخَلِيسَةِ فَقَالَ الذِّئْبُ أَوْ السَّبُعُ يُدْرِكُهُ الرَّجُلُ فَيَأْخُذُهُ مِنْهُ فَيَمُوتُ فِي يَدِهِ قَبْلَ أَنْ يُذَكِّيَهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] dan yang lainnya mereka berkata; Rasulullah shallallahu 'alaihi wasallam [Abu 'Ashim] dari [Wahb Abu Khalid] ia berkata; Telah menceritakan kepadaku [Ummu Habibah bintu Al 'Irbadl], ia adalah Ibnu Sariyah dari [ayahnya] bahwa pada hari Khaibar Rasulullah shallallahu 'alaihi wasallam melarang daging setiap binatang buas yang bertaring, setiap burung yang memiliki cakar, daging keledai jinak, hewan sebagai sasaran tembak dan hewan dari gigitan binatang buas. Beliau juga melarang menggauli wanita hamil hingga melahirkan apa yang ada diperutnya. Muhammad bin Yahya Al Qutha'i berkata; Abu 'Ashim ditanya tentang mujatstsamah, ia menjawab; Burung atau hewan yang dijadikan undian lalu dilempari (agar mati tidak disembelih). Ia juga ditanya tentang khalisah, ia menjawab; Serigala atau binatang buas yang ditangkap oleh seseorang, ia mengambil hewan yang ditangkapnya lalu mati ditangannya sebelum disembelih."
            },
            {
                "number": 1395,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ الثَّوْرِيِّ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَّخَذَ شَيْءٌ فِيهِ الرُّوحُ غَرَضًاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَهْلِ الْعِلْمِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul A'la], telah menceritakan kepada kami [Abdurrazaq] dari [Ats Tsauri] dari [Simak] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang menjadikan sesuatu yang bernyawa untuk dijadikan sasaran tembak. Abu Isa berkata; Hadits ini hasan shahih dan menjadi pedoman amal menurut para ulama."
            },
            {
                "number": 1396,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مُجَالِدٍ ح قَالَ حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ مُجَالِدٍ عَنْ أَبِي الْوَدَّاكِ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ذَكَاةُ الْجَنِينِ ذَكَاةُ أُمِّهِقَالَ وَفِي الْبَاب عَنْ جَابِرٍ وَأَبِي أُمَامَةَ وَأَبِي الدَّرْدَاءِ وَأَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ هَذَا الْوَجْهِ عَنْ أَبِي سَعِيدٍ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ وَأَبُو الْوَدَّاكِ اسْمُهُ جَبْرُ بْنُ نَوْفٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Yahya bin Sa'id] dari [Mujalid], hadits diriwayatkan dari jalur lain, ia berkata; Telah menceritakan kepada kami [Sufyan bin Waki'] telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Mujalid] dari [Abu Al Waddak] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Penyembelihan janin mengikuti penyembelihan induknya (menyembelih janin yang ada di dalam kandungan induknya cukup dengan menyembelih induknya).\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Jabir, Abu Umamah, Abu Ad Darda` dan Abu Hurairah. Abu Isa berkata; Hadits ini hasan shahih dan telah diriwayatkan dari jalur lain dari Abu Sa'id. Hadits ini menjadi pedoman amal menurut para ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka, ini menjadi pendapat Sufyan Ats Tsauri, Ibnu Al Mubarak, Asy Syafi'i, Ahmad dan Ishaq. Abu Al Waddak bernama Jubr bin Nauf."
            },
            {
                "number": 1397,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِحَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَبُو إِدْرِيسَ الْخَوْلَانِيُّ اسْمُهُ عَائِذُ اللَّهِ بْنُ عَبْدِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Al Hasan], telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik bin Anas] dari [Ibnu Syihab] dari [Abu Idris Al Khaulani] dari [Abu Tsa'labah Al Khusyani] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang memakan setiap binatang buas yang bertaring. Telah menceritakan kepada kami [Sa'id bin Abdurrahman Al Makhzumi] dan selainnya, mereka mengatakan; Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Abu Idris Al Khaulani] seperti itu. Abu Isa berkata; Hadits ini hasan shahih. Abu Idris Al Khaulani bernama 'A`idzullah bin Abdullah."
            },
            {
                "number": 1398,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو النَّضْرِ هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ قَالَحَرَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي يَوْمَ خَيْبَرَ الْحُمُرَ الْإِنْسِيَّةَ وَلُحُومَ الْبِغَالِ وَكُلَّ ذِي نَابٍ مِنْ السِّبَاعِ وَذِي مِخْلَبٍ مِنْ الطَّيْرِقَالَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَعِرْبَاضِ بْنِ سَارِيَةَ وَابْنِ عَبَّاسٍ قَالَ أَبُو عِيسَى حَدِيثُ جَابِرٍ حَدِيثٌ حَسَنٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan], telah menceritakan kepada kami [Abu An Nadlr Hasyim bin Al Qasim], telah menceritakan kepada kami [Ikrimah bin Ammar] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam yakni pada hari Khaibar mengharamkan daging keledai tunggangan, daging bighal, setiap binatang buas yang bertaring, dan burung yang memiliki cakar. Ia mengatakan; Dalam hal ini ada hadits serupa dari Abu Hurairah, 'Irbadl bin Sariyah dan Ibnu Abbas. Abu Isa berkata; Hadits Jabir adalah hadits hasan gharib."
            },
            {
                "number": 1399,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّمَ كُلَّ ذِي نَابٍ مِنْ السِّبَاعِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ وَهُوَ قَوْلُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ",
                "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam mengharamkan setiap binatang buas yang bertaring. Abu Isa berkata; Hadits ini hasan dan menjadi pedoman amal menurut kebanyakan ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka, ini menjadi pendapat Abdullah bin Al Mubarak, Asy Syafi'i, Ahmad dan Ishaq."
            },
            {
                "number": 1400,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ حَدَّثَنَا سَلَمَةُ بْنُ رَجَاءٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي وَاقِدٍ اللَّيْثِيِّ قَالَقَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وَهُمْ يَجُبُّونَ أَسْنِمَةَ الْإِبِلِ وَيَقْطَعُونَ أَلْيَاتِ الْغَنَمِ فَقَالَ مَا قُطِعَ مِنْ الْبَهِيمَةِ وَهِيَ حَيَّةٌ فَهِيَ مَيْتَةٌحَدَّثَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ الْجَوْزَجَانِيُّ حَدَّثَنَا أَبُو النَّضْرِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ دِينَارٍ نَحْوَهُ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ زَيْدِ بْنِ أَسْلَمَ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ وَأَبُو وَاقِدٍ اللَّيْثِيُّ اسْمُهُ الْحَارِثُ بْنُ عَوْفٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul A'la Ash Shan'ani], telah menceritakan kepada kami [Salamah bin Raja`] ia berkata; Telah menceritakan kepada kami [Abdurrahman bin Abdullah bin Dinar] dari [Zaid bin Aslam] dari ['Atha` bin Yasar] dari [Abu Waqid Al Laitsi] ia berkata; Tatkala Nabi shallallahu 'alaihi wasallam datang ke Madinah, orang-orang biasa memotong punuk unta dan bagian dari badan kambing. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Bagian apa saja yang diambil dari binatang yang masih dalam keadaan hidup, maka itu adalah bangkai.\" Telah menceritakan kepada kami [Ibrahim bin Ya'qub Al Jauzajani] telah menceritakan kepada kami [Abu An Nadlr] dari [Abdurrahman bin Abdullah bin Dinar] seperti itu. Abu Isa berkata; Hadits ini gharib tidak kami ketahui kecuali dari Hadits Zaid bin Aslam dan menjadi pedoman amal menurut para ulama. Abu Waqid Al Laitsi bernama Harits bin Auf."
            },
            {
                "number": 1401,
                "arab": "حَدَّثَنَا هَنَّادٌ وَمُحَمَّدُ بْنُ الْعَلَاءِ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ حَمَّادِ بْنِ سَلَمَةَ ح و حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي الْعُشَرَاءِ عَنْ أَبِيهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَمَا تَكُونُ الذَّكَاةُ إِلَّا فِي الْحَلْقِ وَاللَّبَّةِ قَالَ لَوْ طَعَنْتَ فِي فَخِذِهَا لَأَجْزَأَ عَنْكَقَالَ أَحْمَدُ بْنُ مَنِيعٍ قَالَ يَزِيدُ بْنُ هَارُونَ هَذَا فِي الضَّرُورَةِ قَالَ وَفِي الْبَاب عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ حَمَّادِ بْنِ سَلَمَةَ وَلَا نَعْرِفُ لِأَبِي الْعُشَرَاءِ عَنْ أَبِيهِ غَيْرَ هَذَا الْحَدِيثِ وَاخْتَلَفُوا فِي اسْمِ أَبِي الْعُشَرَاءِ فَقَالَ بَعْضُهُمْ اسْمُهُ أُسَامَةُ بْنُ قِهْطِمٍ وَيُقَالُ اسْمُهُ يَسَارُ بْنُ بَرْزٍ وَيُقَالُ ابْنُ بَلْزٍ وَيُقَالُ اسْمُهُ عُطَارِدٌ نُسِبَ إِلَى جَدِّهِ",
                "id": "Telah menceritakan kepada kami [Hannad] dan [Muhammad bin Al 'Ala] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Hammad bin Salamah]. (Dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Mani'] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah memberitakan kepada kami [Hammad bin Salamah] dari [Abul 'Usyara] dari [Bapaknya] ia berkata; Aku bertanya; Wahai Rasulullah, bukankah tempat penyembelihan hewan itu pada kerongkongan dan labbah (tempat kalung)?\" beliau menjawab: \"Jika engkau tikam pahanya pun telah cukup bagimu.\" Ahmad bin Mani' berkata; Yazid bin Harun berkata, \"Hal ini jika dalam kondisi darurat.\" Ia berkata, \"Dalam bab ini juga ada hadits dari Rafi' bin Khadij.\" Abu Isa berkata, \"Ini adalah hadits gharib, kami tidak mengetahuinya kecuali dari hadits Hammad bin Salamah, dan kami tidak mengetahui riwayat Abul Usyara dari bapaknya, kecuali hadits ini. Namun para ulama berselisih pendapat tentang nama Abul Usyara; sebagian mengatakan bahwa namanya adalah Usamah bin Qihthim, ada yang menyebut Yasar bin Baraz, ada yang menyebut Ibnu Balz dan ada yang menyebut namanya dengan Utharid yang disandarkan kepada nama kakeknya.\""
            },
            {
                "number": 1402,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَتَلَ وَزَغَةً بِالضَّرْبَةِ الْأُولَى كَانَ لَهُ كَذَا وَكَذَا حَسَنَةً فَإِنْ قَتَلَهَا فِي الضَّرْبَةِ الثَّانِيَةِ كَانَ لَهُ كَذَا وَكَذَا حَسَنَةً فَإِنْ قَتَلَهَا فِي الضَّرْبَةِ الثَّالِثَةِ كَانَ لَهُ كَذَا وَكَذَا حَسَنَةًقَالَ وَفِي الْبَاب عَنْ ابْنِ مَسْعُودٍ وَسَعْدٍ وَعَائِشَةَ وَأُمِّ شَرِيكٍ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] berkata, telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda; \"Barangsiapa membunuh cicak dengan sekali pukul maka ia akan mendapat pahala sekian dan sekian. Jika ia membunuh pada pukulan kedua maka ia akan mendapatkan pahala sekian dan sekian. Dan jika ia membunuh pada pukulan ketiga maka ia akan mendapatkan pahala sekian dan sekian.\" Dalam bab ini ada hadits serupa dari Ibnu Mas'ud, Sa'd, 'Aisyah dan Ummu Syarik. Abu Isa berkata, \"Hadits Abu Hurairah derajatnya hasan shahih.\""
            },
            {
                "number": 1403,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْتُلُوا الْحَيَّاتِ وَاقْتُلُوا ذَا الطُّفْيَتَيْنِ وَالْأَبْتَرَ فَإِنَّهُمَا يَلْتَمِسَانِ الْبَصَرَ وَيُسْقِطَانِ الْحُبْلَىقَالَ وَفِي الْبَاب عَنْ ابْنِ مَسْعُودٍ وَعَائِشَةَ وَأَبِي هُرَيْرَةَ وَسَهْلِ بْنِ سَعْدٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ عَنْ ابْنِ عُمَرَ عَنْ أَبِي لُبَابَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى بَعْدَ ذَلِكَ عَنْ قَتْلِ جِنَّانِ الْبُيُوتِ وَهِيَ الْعَوَامِرُ وَيُرْوَى عَنْ ابْنِ عُمَرَ عَنْ زَيْدِ بْنِ الْخَطَّابِ أَيْضًا و قَالَ عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ إِنَّمَا يُكْرَهُ مِنْ قَتْلِ الْحَيَّاتِ قَتْلُ الْحَيَّةِ الَّتِي تَكُونُ دَقِيقَةً كَأَنَّهَا فِضَّةٌ وَلَا تَلْتَوِي فِي مِشْيَتِهَا",
                "id": "Telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari [Salim bin Abdullah] dari [Bapaknya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda; \"Bunuhlah semua ular; yang berbisa dan yang berekor pendek. Karena keduanya dapat membutakan mata dan menggugurkan kandungan.\" Dalam bab ini ada hadits serupa dari Ibnu Mas'ud, 'Aisyah, Abu Hurairah dan Sahl bin Sa'd. Abu Isa berkata; Ini adalah hadits hasan shahih. telah diriwayatkan pula oleh Ibnu Umar dari Abu Lubabah, bahwa Nabi shallallahu 'alaihi wasallam setelah itu, melarang dari membunuh ular rumah yang berada dalam rumah.\" Hadits juga diriwayatkan dari Ibnu Umar, dari Zaid Ibnul Khaththab.\" Abdullah Ibnul Mubarak berkata; Dilarangnya membunuh ular itu adalah ular yang mempunyai garis tipis seperti perak dan tidak berkelok saat berjalan."
            },
            {
                "number": 1404,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عَبْدَةُ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ صَيْفِيٍّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِبُيُوتِكُمْ عُمَّارًا فَحَرِّجُوا عَلَيْهِنَّ ثَلَاثًا فَإِنْ بَدَا لَكُمْ بَعْدَ ذَلِكَ مِنْهُنَّ شَيْءٌ فَاقْتُلُوهُنَّقَالَ أَبُو عِيسَى هَكَذَا رَوَى عُبَيْدُ اللَّهِ بْنُ عُمَرَ هَذَا الْحَدِيثَ عَنْ صَيْفِيٍّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ وَرَوَى مَالِكُ بْنُ أَنَسٍ هَذَا الْحَدِيثَ عَنْ صَيْفِيٍّ عَنْ أَبِي السَّائِبِ مَوْلَى هِشَامِ بْنِ زُهْرَةَ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي الْحَدِيثِ قِصَّةٌ حَدَّثَنَا بِذَلِكَ الْأَنْصَارِيُّ حَدَّثَنَا مَعْنٌ حَدَّثَنَا مَالِكٌ وَهَذَا أَصَحُّ مِنْ حَدِيثِ عُبَيْدِ اللَّهِ بْنِ عُمَرَ وَرَوَى مُحَمَّدُ بْنُ عَجْلَانَ عَنْ صَيْفِيٍّ نَحْوَ رِوَايَةِ مَالِكٍ",
                "id": "Telah menceritakan kepada kami [Hannad] berkata, telah menceritakan kepada kami [Abdah] dari [ubaidhullah bin Umar] dari [Shaifi] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya di rumah-rumah kalian ada penghuninya (jin yang berupa ular), maka mintalah mereka untuk keluar sebanyak tiga kali. Jika setelah itu mereka tetap terlihat, maka bunuhlah mereka.\" Abu Isa berkata, \"Demikianlah [ubaidhullah bin Umar] meriwayatkan hadits ini dari [Shaifi], dari [Abu Sa'id Al Khudri]. [Malik bin Anas] juga meriwayatkan hadits ini dari [Shaifi], dari [Abu As Sa`ib] mantan budak (yang telah dimerdekakan) Hisyam bin Zuhrah, dari [Abu Sa'id], dari Nabi shallallahu 'alaihi wasallam. Dalam hadits tersebut terdapat kisah. Seperti itu pula yang diceritakan oleh? [Al Anshari] kepada kami, ia berkata; telah menceritakan kepada kami [Ma'n] berkata, telah menceritakan kepada kami [Malik] dan ini lebih shahih dari hadits ubaidhullah bin Umar. [Muhammad bin 'Ajlan] juga meriwayatkan dari [Shaifi] seperti hadits riwayat Malik.\""
            },
            {
                "number": 1405,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ حَدَّثَنَا ابْنُ أَبِي لَيْلَى عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَ قَالَ أَبُو لَيْلَىقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا ظَهَرَتْ الْحَيَّةُ فِي الْمَسْكَنِ فَقُولُوا لَهَا إِنَّا نَسْأَلُكِ بِعَهْدِ نُوحٍ وَبِعَهْدِ سُلَيْمَانَ بْنِ دَاوُدَ أَنْ لَا تُؤْذِيَنَا فَإِنْ عَادَتْ فَاقْتُلُوهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ مِنْ حَدِيثِ ثَابِتٍ الْبُنَانِيِّ إِلَّا مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ ابْنِ أَبِي لَيْلَى",
                "id": "Telah menceritakan kepada kami [Hannad] berkata, telah menceritakan kepada kami [Ibnu Abu Zaidah] berkata, telah menceritakan kepada kami [Ibnu Abu Laila] dari [Tsabit Al Bunani] dari ['Abdurrahman bin Abu Laila] ia berkata; [Abu Laila] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika ada ular muncul di tempat tinggal maka katakanlah kepadanya, 'Sesungguhnya kami meminta kepadamu dengan perjanjian Nuh dan Sulaiman bin Dawud agar engkau tidak menyakiti kami', jika ia tetap kembali maka bunuhlah.\" Abu Isa berkata, \"Hadits ini derajatnya hasan gharib, kami tidak mengetahuinya dari Tsabit Al Bunani kecuali dari jalur ini, yaitu dari hadits Ibnu Abu Laila.\""
            },
            {
                "number": 1406,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا مَنْصُورُ بْنُ زَاذَانَ وَيُونُسُ بْنُ عُبَيْدٍ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْلَا أَنَّ الْكِلَابَ أُمَّةٌ مِنْ الْأُمَمِ لَأَمَرْتُ بِقَتْلِهَا كُلِّهَا فَاقْتُلُوا مِنْهَا كُلَّ أَسْوَدَ بَهِيمٍقَالَ وَفِي الْبَاب عَنْ ابْنِ عُمَرَ وَجَابِرٍ وَأَبِي رَافِعٍ وَأَبِي أَيُّوبَ قَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَيُرْوَى فِي بَعْضِ الْحَدِيثِ أَنَّ الْكَلْبَ الْأَسْوَدَ الْبَهِيمَ شَيْطَانٌ وَالْكَلْبُ الْأَسْوَدُ الْبَهِيمُ الَّذِي لَا يَكُونُ فِيهِ شَيْءٌ مِنْ الْبَيَاضِ وَقَدْ كَرِهَ بَعْضُ أَهْلِ الْعِلْمِ صَيْدَ الْكَلْبِ الْأَسْوَدِ الْبَهِيمِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] berkata, telah menceritakan kepada kami [Hisyaim] berkata, telah mengabarkan kepada kami [Manshur bin Zadzan] dan [Yunus bin Ubaid] dari [Al Hasan] dari [Abdullah bin Mughaffal] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya anjing-anjing itu bukan suatu umat, sungguh aku akan perintahkan untuk membunuh mereka semua. Maka bunuhlah semua anjing yang berwarna hitam pekat.\" Abu Isa berkata, \"Hadits Abdullah bin Mughaffal derajatnya hasan shahih. Dalam sebagian hadits diriwayatkan bahwa anjing yang berwarna hitam pekat adalah setan, dan anjing yang berwarna hitam pekat adalah anjing yang tidak memiliki warna putih sedikitpun. Dan sebagian ulama memakruhkan hasil buruan dari anjing yang berwarna hitam pekat.\""
            },
            {
                "number": 1407,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اقْتَنَى كَلْبًا أَوْ اتَّخَذَ كَلْبًا لَيْسَ بِضَارٍ وَلَا كَلْبَ مَاشِيَةٍ نَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطَانِقَالَ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ وَأَبِي هُرَيْرَةَ وَسُفْيَانَ بْنِ أَبِي زُهَيْرٍ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ أَوْ كَلْبَ زَرْعٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] berkata, telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memelihara anjing, atau mengambil anjing tanpa ada kebutuhan, tidak juga anjing yang digunakan untuk menjaga ternak, maka dalam setiap hari pahalanya akan berkurang sebanyak dua qirath.\" Ia berkata; \"Dalam bab ini hadits serupa dari Abdullah bin Mughaffal, Abu Hurairah dan Utsman bin Abu Zuhair.\" Abu Isa berkata; \"Hadits Ibnu Umar ini derajatnya hasan shahih. Telah diriwayatkan pula dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda; \"Atau anjing untuk menjaga kebun.\""
            },
            {
                "number": 1408,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْكِلَابِ إِلَّا كَلْبَ صَيْدٍ أَوْ كَلْبَ مَاشِيَةٍ قَالَ قِيلَ لَهُ إِنَّ أَبَا هُرَيْرَةَ كَانَ يَقُولُ أَوْ كَلْبَ زَرْعٍ فَقَالَ إِنَّ أَبَا هُرَيْرَةَ لَهُ زَرْعٌقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Amru bin Dinar] dari [Ibnu Umar] berkata; \"Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk membunuh anjing kecuali anjing untuk berburu, atau anjing untuk menjaga ternak.\" Ia (perawi) berkata; Ibnu Umar pernah ditanya, [Abu Hurairah] pernah mengatakan; \"atau anjing untuk menjaga tanaman\", Ibnu Umar menjawab; \"(karena) Abu Hurairah memiliki tanaman.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih.\""
            },
            {
                "number": 1409,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ وَغَيْرُ وَاحِدٍ قَالُوا أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اتَّخَذَ كَلْبًا إِلَّا كَلْبَ مَاشِيَةٍ أَوْ صَيْدٍ أَوْ زَرْعٍ انْتَقَصَ مِنْ أَجْرِهِ كُلَّ يَوْمٍ قِيرَاطٌقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَيُرْوَى عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ أَنَّهُ رَخَّصَ فِي إِمْسَاكِ الْكَلْبِ وَإِنْ كَانَ لِلرَّجُلِ شَاةٌ وَاحِدَةٌ حَدَّثَنَا بِذَلِكَ إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ بِهَذَا",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Hulwani] dan banyak, mereka berkata; telah mengabarkan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah bin 'Abdurrahman] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memelihara anjing selain anjing untuk menjaga ternak, atau untuk berburu, atau untuk menjaga tanaman, maka pahalanya akan berkurang satu qirath setiap harinya.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih\", dan diriwayatkan dari Atha bin Abu Rabah, bahwasanya beliau memberi keringanan bagi seorang untuk memelihara anjing meskipun ia hanya memiliki seekor kambing, Seperti itu telah diceritakan kepada kami oleh Ishaq bin Manshur telah menceritakan kepada kami Hajjaj bin Muhammad, dari Ibnu juraij, dari Atha.\""
            },
            {
                "number": 1410,
                "arab": "حَدَّثَنَا عُبَيْدُ بْنُ أَسْبَاطِ بْنِ مُحَمَّدٍ الْقُرَشِيُّ حَدَّثَنَا أَبِي عَنْ الْأَعْمَشِ عَنْ إِسْمَعِيلَ بْنِ مُسْلِمٍ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَإِنِّي لَمِمَّنْ يَرْفَعُ أَغْصَانَ الشَّجَرَةِ عَنْ وَجْهِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَخْطُبُ فَقَالَ لَوْلَا أَنَّ الْكِلَابَ أُمَّةٌ مِنْ الْأُمَمِ لَأَمَرْتُ بِقَتْلِهَا فَاقْتُلُوا مِنْهَا كُلَّ أَسْوَدَ بَهِيمٍ وَمَا مِنْ أَهْلِ بَيْتٍ يَرْتَبِطُونَ كَلْبًا إِلَّا نَقَصَ مِنْ عَمَلِهِمْ كُلَّ يَوْمٍ قِيرَاطٌ إِلَّا كَلْبَ صَيْدٍ أَوْ كَلْبَ حَرْثٍ أَوْ كَلْبَ غَنَمٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ubaid bin Asbath bin Muhammad Al Qurasyi] berkata, telah menceritakan kepada kami [Bapakku] dari [Al A'masy] dari [Isma'il bin Muslim] dari [Al Hasan] dari [Abdullah bin Mughaffal] ia berkata, \"Sungguh aku termasuk orang yang mengangkat dahan pohon dari wajah Rasulullah shallallahu 'alaihi wasallam saat beliau berkhutbah. Beliau mengatakan: \"Sekiranya anjing-anjing itu bukan suatu umat, sungguh aku akan perintahkan untuk membunuh mereka semua. Maka bunuhlah semua anjing yang berwarna hitam pekat. Dan tidaklah penghuni rumah memelihara anjing kecuali pahalanya akan berkurang satu qirath setiap harinya. Kecuali anjing untuk berburu, atau anjing untuk menjaga tanaman, atau anjing untuk menjaga kambing ternak.\" Abu Isa berkata; \"Hadits ini telah diriwayatkan dari Al Hasan dengan jalur yang banyak, dari Abdullah bin Mughaffal, dari Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 1411,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ عَنْ أَبِيهِ عَنْ جَدِّهِ رَافِعِ بْنِ خَدِيجٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا نَلْقَى الْعَدُوَّ غَدًا وَلَيْسَتْ مَعَنَا مُدًى فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَنْهَرَ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ عَلَيْهِ فَكُلُوهُ مَا لَمْ يَكُنْ سِنًّا أَوْ ظُفُرًا وَسَأُحَدِّثُكُمْ عَنْ ذَلِكَ أَمَّا السِّنُّ فَعَظْمٌ وَأَمَّا الظُّفُرُ فَمُدَى الْحَبَشَةِحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ الثَّوْرِيِّ قَالَ حَدَّثَنَا أَبِي عَنْ عَبَايَةَ عَنْ رَافِعِ بْنِ خَدِيجٍ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ وَلَمْ يَذْكُرْ فِيهِ عَبَايَةَ عَنْ أَبِيهِ وَهَذَا أَصَحُّ وَعَبَايَةُ قَدْ سَمِعَ مِنْ رَافِعٍ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ لَا يَرَوْنَ أَنْ يُذَكَّى بِسِنٍّ وَلَا بِعَظْمٍ",
                "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abul Ahwash] dari [Sa'id bin Masruq] dari [Abayah bin rifa'ah bin Rafi' bin Khadij] dari [Bapaknya] dari kakeknya yaitu [Rafi' bin Khadij] ia berkata; Aku bertanya; \"Wahai Rasulullah, besok kami akan bertemu dengan musuh, sementara kami tidak memiliki pisau tajam?\" Nabi shallallahu 'alaihi wasallam lalu menjawab: \"Apa saja yang bisa mengalirkan darah dan disebut nama Allah atasnya maka makanlah, selama (alat pemotong tersebut) bukan gigi atau kuku. Dan akan aku jelaskan kepada kalian tentang hal itu; adapun gigi karena ia adalah termasuk tulang, sementara kuku adalah alat pemotong orang-orang habasyah.\" Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Yahya bin Said] dari [Sufyan Ats Tsauri] ia berkata; telah menceritakan kepada kami [Bapakku] dari [Abayah] dari [Rafi' bin Khadij radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam, seperti hadits tersebut. Hanya saja ia tidak menyebutkan nama Abayah, dari bapaknya, dan ini lebih shahih, sebab Abayah telah mendengar dari Rafi'. Hadits ini menjadi pedoman amal menurut para ulama`. Mereka tidak membolehkan menyembelih dengan menggunakan gigi atau kuku.\""
            },
            {
                "number": 1412,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعٍ عَنْ أَبِيهِ عَنْ جَدِّهِ رَافِعِ بْنِ خَدِيجٍ قَالَكُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَنَدَّ بَعِيرٌ مِنْ إِبِلِ الْقَوْمِ وَلَمْ يَكُنْ مَعَهُمْ خَيْلٌ فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ اللَّهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِهَذِهِ الْبَهَائِمِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَمَا فَعَلَ مِنْهَا هَذَا فَافْعَلُوا بِهِ هَكَذَاحَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِيهِ عَنْ عَبَايَةَ بْنِ رِفَاعَةَ عَنْ جَدِّهِ رَافِعِ بْنِ خَدِيجٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ وَلَمْ يَذْكُرْ فِيهِ عَبَايَةَ عَنْ أَبِيهِ وَهَذَا أَصَحُّ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ وَهَكَذَا رَوَاهُ شُعْبَةُ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ نَحْوَ رِوَايَةِ سُفْيَانَ",
                "id": "Telah menceritakan kepada kami [Hannad] berkata, telah menceritakan kepada kami [Abul Ahwash] dari [Sa'id bin Masruq] dari [Abayah bin rifa'ah bin Rafi'] dari [Bapaknya] dari kakeknya [Ibnu khadij] ia berkata, \"kami bersama Nabi shallallahu 'alaihi wasallam dalam sebuah perjalanan, lalu ada salah satu unta rombongan tersebut kabur, sementara mereka tidak memiliki kuda (untuk mengejar). Maka salah seorang laki-laki melumpuhkan unta tersebut dengan panah, hingga Allah menghentikannya. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Sesungguhnya pada hewan-hewan ini masih ada sisa-sisa keliaran seperti binatang buas, jika ada salah satu dari mereka yang kabur, maka lakukanlah seperti ini (dilumpuhkan dengan panah).\" Telah menceritakan kepada kami [Mahmud bin Ghailan] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Sufyan] dari [Bapaknya] dari [Abayah bin Rifa'ah] dari kakeknya yaitu [Rafi' bin Khadij] dari Nabi shallallahu 'alaihi wasallam, seperti hadits tersebut. Namun dalam hadits tersebut ia (perawi) tidak menyebutkan nama Abayah, dari bapaknya. Dan ini lebih shahih, dan hadits ini menjadi pedoman amal menurut para ulama`. Dan seperti ini pula [Syu'bah] meriwayatkan dari [Sa'id bin Masruq], seperti riwayat Sufyan.\""
            },
            {
                "number": 1413,
                "arab": "حَدَّثَنَا أَبُو عَمْرٍو مُسْلِمُ بْنُ عَمْرِو بْنِ مُسْلِمٍ الْحَذَّاءُ الْمَدَنِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ الصَّائِغُ أَبُو مُحَمَّدٍ عَنْ أَبِي الْمُثَنَّى عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا عَمِلَ آدَمِيٌّ مِنْ عَمَلٍ يَوْمَ النَّحْرِ أَحَبَّ إِلَى اللَّهِ مِنْ إِهْرَاقِ الدَّمِ إِنَّهَا لَتَأْتِي يَوْمَ الْقِيَامَةِ بِقُرُونِهَا وَأَشْعَارِهَا وَأَظْلَافِهَا وَأَنَّ الدَّمَ لَيَقَعُ مِنْ اللَّهِ بِمَكَانٍ قَبْلَ أَنْ يَقَعَ مِنْ الْأَرْضِ فَطِيبُوا بِهَا نَفْسًاقَالَ وَفِي الْبَاب عَنْ عِمْرَانَ بْنِ حُصَيْنٍ وَزَيْدِ بْنِ أَرْقَمَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ مِنْ حَدِيثِ هِشَامِ بْنِ عُرْوَةَ إِلَّا مِنْ هَذَا الْوَجْهِ وَأَبُو الْمُثَنَّى اسْمُهُ سُلَيْمَانُ بْنُ يَزِيدَ وَرَوَى عَنْهُ ابْنُ أَبِي فُدَيْكٍ قَالَ أَبُو عِيسَى وَيُرْوَى عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ فِي الْأُضْحِيَّةِ لِصَاحِبِهَا بِكُلِّ شَعَرَةٍ حَسَنَةٌ وَيُرْوَى بِقُرُونِهَا",
                "id": "Telah menceritakan kepada kami [Abu Amru Muslim bin Amru bin Muslim Al Hadzdza Al Madani] berkata; telah menceritakan kepada kami [Abdullah bin Nafi' Ash Sha`igh Abu Muhammad] dari [Abul Mutsanna] dari [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada amalan yang dilakukan oleh anak Adam pada hari Nahr (Idul adha) yang lebih dicintai oleh Allah selain dari pada mengucurkan darah (hewan kurban). Karena sesungguhnya ia (hewan kurban) akan datang pada hari kiamat dengan tanduk, bulu, dan kukunya. Dan sungguh, darah tersebut akan sampai kepada (ridha) Allah sebelum tetesan darah tersebut jatuh ke bumi, maka bersihkanlah jiwa kalian dengan berkurban.\" Ia berkata; \"Dalam bab ini ada hadits serupa dari Imran bin Hushain dan Zaid bin Arqam.\" Abu Isa berkata; \"Hadits ini derajatnya hasan gharib, kami tidak mengetahui hadits ini dari Hisyam bin Urwah selain dari jalur ini. Dan Abul Mutsanna namanya adalah Sulaiman bin Yazid. Dan Abu Fudaik telah meriwayatkan hadits darinya.\" Abu Isa berkata; \"Telah diriwayatkan dari Rasulullah shallallahu 'alaihi wasallam, Bahwasanya beliau pernah bersabda tentang kurban; \"Pemiliknya akan mendapat satu kebaikan dari setiap bulunya.\" Dalam riwayat lain, \"Dengan setiap tanduknya.\""
            },
            {
                "number": 1414,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشَيْنِ أَمْلَحَيْنِ أَقْرَنَيْنِ ذَبَحَهُمَا بِيَدِهِ وَسَمَّى وَكَبَّرَ وَوَضَعَ رِجْلَهُ عَلَى صِفَاحِهِمَاقَالَ وَفِي الْبَاب عَنْ عَلِيٍّ وَعَائِشَةَ وَأَبِي هُرَيْرَةَ وَأَبِي أَيُّوبَ وَجَابِرٍ وَأَبِي الدَّرْدَاءِ وَأَبِي رَافِعٍ وَابْنِ عُمَرَ وَأَبِي بَكْرَةَ أَيْضًا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Qatadah] dari [Anas bin Malik] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam berkurban dengan dua ekor kambing gemuk lagi bertanduk beliau menyembelih keduanya dengan tangannya sendiri. Beliau menyebut nama Allah, bertakbir serta meletakkan kakinya di atas lambungnya.\" Ia berkata; \"Dalam bab ini ada hadits serupa dari Ali, 'Aisyah, Abu Hurairah, Abu Ayyub, Jabir, Abu Darda, Abu Rafi', Abu Umar dan Abu Bakrah.\" Abu Isa berkata; \"Ini adalah hadits hasan shahih.\""
            },
            {
                "number": 1415,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْمُحَارِبِيُّ الْكُوفِيُّ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي الْحَسْنَاءِ عَنْ الْحَكَمِ عَنْ حَنَشٍ عَنْ عَلِيٍّأَنَّهُ كَانَ يُضَحِّي بِكَبْشَيْنِ أَحَدُهُمَا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْآخَرُ عَنْ نَفْسِهِ فَقِيلَ لَهُ فَقَالَ أَمَرَنِي بِهِ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَا أَدَعُهُ أَبَدًاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ شَرِيكٍ وَقَدْ رَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ أَنْ يُضَحَّى عَنْ الْمَيِّتِ وَلَمْ يَرَ بَعْضُهُمْ أَنْ يُضَحَّى عَنْهُ و قَالَ عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَحَبُّ إِلَيَّ أَنْ يُتَصَدَّقَ عَنْهُ وَلَا يُضَحَّى عَنْهُ وَإِنْ ضَحَّى فَلَا يَأْكُلُ مِنْهَا شَيْئًا وَيَتَصَدَّقُ بِهَا كُلِّهَا قَالَ مُحَمَّدٌ قَالَ عَلِيُّ بْنُ الْمَدِينِيِّ وَقَدْ رَوَاهُ غَيْرُ شَرِيكٍ قُلْتُ لَهُ أَبُو الْحَسْنَاءِ مَا اسْمُهُ فَلَمْ يَعْرِفْهُ قَالَ مُسْلِمٌ اسْمُهُ الْحَسَنُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid Al Muharibi Al Kufi] berkata, telah menceritakan kepada kami [Syarik] dari [Abul Hasna`] dari [Al Hakam] dari [Hanasy] dari [Ali] Bahwasanya ia pernah berkurban dengan dua ekor kambing; seekor untuk Nabi shallallahu 'alaihi wasallam dan seekor lagi untuk dirinya sendiri, hingga ia pun ditanya tentang hal itu. Ali menjawab; \"Nabi shallallahu 'alaihi wasallam telah memerintahkan hal itu kepadaku, maka aku tidak akan meninggalkannya selamanya.\" Abu Isa berkata; \"Ini adalah hadits gharib, kami tidak mengetahuinya kecuali dari hadits Syarik. Sebagian ulama` memberi keringanan untuk berkurban atas nama mayit, sementara sebagian lagi tidak memberikan keringanan tersebut.\" Abdullah Ibnul Mubarak berkata; \"Aku lebih cenderung seseorang bersedekah atas nama mayit, dan bukan berkurban, namun ia berkurban atas nama mayit maka hendaknya ia tidak memakan dagingnya sedikitpun, tetapi mensedekahkan semuanya.\" Muhammad berkata; Ali Ibnul Madini berkata; \"Hadits ini tidak hanya diriwayatkan oleh Syarik.\" Aku bertanya kepadanya (Ali bin Al Madini; \"Siapa nama Abul Hasna`\" maka ia tidak mengetahuinya. Sedangkan Muslim berkata; \"namanya (Abu Al Hasna` adalah Al Hasan\" "
            },
            {
                "number": 1416,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشٍ أَقْرَنَ فَحِيلٍ يَأْكُلُ فِي سَوَادٍ وَيَمْشِي فِي سَوَادٍ وَيَنْظُرُ فِي سَوَادٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ حَفْصِ بْنِ غِيَاثٍ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id Al Asyaj] berkata, telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Ja'far bin Muhammad] dari [Bapaknya] dari [Abu Sa'id Al Khudri] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam berkurban dengan kambing yang bertanduk, pada bagian mulut berwarna hitam, kaki-kakinya hitam dan pada daerah mata juga hitam.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih gharib, dan kami tidak mengetahuinya kecuali dari hadits Hafsh bin Ghiyats.\""
            },
            {
                "number": 1417,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ سُلَيْمَانَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عُبَيْدِ بْنِ فَيْرُوزَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ رَفَعَهُقَالَ لَا يُضَحَّى بِالْعَرْجَاءِ بَيِّنٌ ظَلَعُهَا وَلَا بِالْعَوْرَاءِ بَيِّنٌ عَوَرُهَا وَلَا بِالْمَرِيضَةِ بَيِّنٌ مَرَضُهَا وَلَا بِالْعَجْفَاءِ الَّتِي لَا تُنْقِيحَدَّثَنَا هَنَّادٌ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ أَخْبَرَنَا شُعْبَةُ عَنْ سُلَيْمَانَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عُبَيْدِ بْنِ فَيْرُوزَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ بِمَعْنَاهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عُبَيْدِ بْنِ فَيْرُوزَ عَنْ الْبَرَاءِ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ أَهْلِ الْعِلْمِ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr] berkata, telah mengabarkan kepada kami [Jarir bin Hazim] dari [Muhammad bin Ishaq] dari [Yazid bin Abu Habib] dari [Sulaiman bin 'Abdurrahman] dari [Ubaid bin Fairuz] dari [Al Bara bin Azib] ia memarfu'kannya (kepada Nabi shallallahu 'alaihi wasallam), beliau bersabda: \"Tidak boleh berkurban dengan kambing pincang dan jelas kepincangannya, atau kambing yang buta sebelah dan jelas butanya, atau kambing yang sakit dan jelas sakitnya, atau kurus yang tidak bersumsum (berdaging).\" Telah menceritakan kepada kami [Hannad] berkata, telah menceritakan kepada kami [Ibnu Abu Zaidah] berkata, telah mengabarkan kepada kami [Syu'bah] dari [Sulaiman bin 'Abdurrahman] dari [Ubaid bin Fairuz] dari [Al Bara bin Azib] dari Nabi shallallahu 'alaihi wasallam dengan makna yang sama.\"Abu Isa berkata; \"Hadits ini derajatnya hasan shahih, dan kami tidak mengetahuinya kecuali dari hadits Ubaid bin Fairuz, dari Al Bara. Hadits ini juga menjadi pedoman amal menurut para ulama`.\" "
            },
            {
                "number": 1418,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِي إِسْحَقَ عَنْ شُرَيْحِ بْنِ النُّعْمَانِ الصَّائِدِيِّ وَهُوَ الْهَمْدَانِيُّ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَشْرِفَ الْعَيْنَ وَالْأُذُنَ وَأَنْ لَا نُضَحِّيَ بِمُقَابَلَةٍ وَلَا مُدَابَرَةٍ وَلَا شَرْقَاءَ وَلَا خَرْقَاءَحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَخْبَرَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ شُرَيْحِ بْنِ النُّعْمَانِ عَنْ عَلِيٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ وَزَادَ قَالَ الْمُقَابَلَةُ مَا قُطِعَ طَرَفُ أُذُنِهَا وَالْمُدَابَرَةُ مَا قُطِعَ مِنْ جَانِبِ الْأُذُنِ وَالشَّرْقَاءُ الْمَشْقُوقَةُ وَالْخَرْقَاءُ الْمَثْقُوبَةُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَالَ أَبُو عِيسَى وَشُرَيْحُ بْنُ النُّعْمَانِ الصَّائِدِيُّ هُوَ كُوفِيٌّ مِنْ أَصْحَابِ عَلِيٍّ وَشُرَيْحُ بْنُ هَانِيءٍ كُوفِيٌّ وَلِوَالِدِهِ صُحْبَةٌ مِنْ أَصْحَابِ عَلِيٍّ وَشُرَيْحُ بْنُ الْحَارِثِ الْكِنْدِيُّ أَبُو أُمَيَّةَ الْقَاضِي قَدْ رَوَى عَنْ عَلِيٍّ وَكُلُّهُمْ مِنْ أَصْحَابِ عَلِيٍّ فِي عَصْرٍ وَاحِدٍ قَوْلُهُ أَنْ نَسْتَشْرِفَ أَيْ أَنْ نَنْظُرَ صَحِيحًا",
                "id": "Telah menceritakan kepada kami [Al hasan bin Ali Al Hulwani] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Syarik bin Abdullah] dari [Abu Ishaq] dari [Syuraih bin An Nu'man Ash Sha`idi dan dia adalah orang? Hamdan] dari [Ali bin Abu Thalib] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk memperhatikan baiknya mata dan telinga (hewan kurban). Beliau juga melarang kami untuk berkurban dengan hewan yang cacat telinga bagian depannya, dan tidak pula cacat telinga bagian belakangnya, tidak yang terbelah terbalah daun telinganya dan tidak pula yang terdapat lubang bundar pada daun telinganya.\" Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [ubaidhullah bin Musa] berkata, telah mengabarkan kepada kami [Isra'il] dari [Abu Ishaq] dari [Syuraih bin Nu'man] dari [Ali] dari Nabi shallallahu 'alaihi wasallam, seperti hadits tersebut. Ia menambahkan, Ali berkata; \"Muqabalah adalah hewan yang terpotong pada sisi ujungnya, Mudabarah hewan yang terpotong pada sisi telinganya, Syarqa` hewan yang telinganya terbelah; dan Kharqa hewan yang telinganya berlubang.\" Abu Isa berkata, \"Hadits ini derajatnya hasan shahih. Dan Syuraih bin An Nu'man Ash Sha`idi berasal dari Kufah, dan termasuk dari sahabat Ali. Syuraih bin Hani juga dari Kufah, bapaknya termasuk sahabat Ali. Syuraih Ibnul Harits Al Kindi Abu Umayyah Al Qadhi telah meriwayatkan dari Ali, mereka semua masih sahabat Ali yang hidup dalam satu masa. Perkataan Ali 'memperhatikan baiknya' maksudnya adalah memperhatikan kesehatan hewan kurban.\""
            },
            {
                "number": 1419,
                "arab": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عُثْمَانُ بْنُ وَاقِدٍ عَنْ كِدَامِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي كِبَاشٍ قَالَجَلَبْتُ غَنَمًا جُذْعَانًا إِلَى الْمَدِينَةِ فَكَسَدَتْ عَلَيَّ فَلَقِيتُ أَبَا هُرَيْرَةَ فَسَأَلْتُهُ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ نِعْمَ أَوْ نِعْمَتِ الْأُضْحِيَّةُ الْجَذَعُ مِنْ الضَّأْنِ قَالَ فَانْتَهَبَهُ النَّاسُقَالَ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ وَأُمِّ بِلَالِ ابْنَةِ هِلَالٍ عَنْ أَبِيهَا وَجَابِرٍ وَعُقْبَةَ بْنِ عَامِرٍ وَرَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ غَرِيبٌ وَقَدْ رُوِيَ هَذَا عَنْ أَبِي هُرَيْرَةَ مَوْقُوفًا وَعُثْمَانُ بْنُ وَاقِدٍ هُوَ ابْنُ مُحَمَّدِ بْنِ زِيَادِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ أَنَّ الْجَذَعَ مِنْ الضَّأْنِ يُجْزِئُ فِي الْأُضْحِيَّةِ",
                "id": "Telah menceritakan kepada kami [Yusuf bin Isa] berkata, telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Utsman bin Waqid] dari [Kidam bin 'Abdurrahman] dari [Abu Kibasy] ia berkata, \"Aku membawa kambing ke madinah yang berumur enam bulanan (untuk dijual), namun aku merugi (karena tidak ada yang beli). Aku lalu bertemu [Abu Hurairah] dan aku tanyakan hal itu kepadanya, ia pun menjawab, \"Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik hewan kurban adalah kambing jadza' (berumur enam bulan sampai setahun).\" Abu Kibasy berkata, \"Maka orang-orang pun berburu untuk membeli.\" Ia berkata, \"Dalam bab ini juga ada hadits dari Ibnu Abbas dan Ummu Bilal binti Hilal dari bapaknya dan Jabir dan Uqbah bin Amir serta seorang laki-laki dari sahabat Nabi shallallahu 'alaihi wasallam.\" Abu Isa berkata; \"Hadits Abu Hurairah ini derajatnya hasan gharib. hadits ini diriwayatkan dari Abu Hurairah secara mauquf. Utsman Abu Isa Waqid adalah Ibnu Muhammd bin Ziyad bin Abdullah bin Umar bin Al Khaththab. Hadits ini menjadi pedoman amal oleh para ulama' dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka, bahwa kambing yang berumur enam bulan hingga setahun boleh untuk digunakan sebagai hewan kurban.\""
            },
            {
                "number": 1420,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ بْنِ عَامِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَاهُ غَنَمًا يَقْسِمُهَا عَلَى أَصْحَابِهِ ضَحَايَا فَبَقِيَ عَتُودٌ أَوْ جَدْيٌ فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ضَحِّ بِهِ أَنْتَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَالَ وَكِيعٌ الْجَذَعُ مِنْ الضَّأْنِ يَكُونُ ابْنَ سَنَةٍ أَوْ سَبْعَةِ أَشْهُرٍ وَقَدْ رُوِيَ مِنْ غَيْرِ هَذَا الْوَجْهِ عَنْ عُقْبَةَ بْنِ عَامِرٍ أَنَّهُ قَالَ قَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحَايَا فَبَقِيَ جَذَعَةٌ فَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ضَحِّ بِهَا أَنْتَ حَدَّثَنَا بِذَلِكَ مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ وَأَبُو دَاوُدَ قَالَا حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ بَعْجَةَ بْنِ عَبْدِ اللَّهِ بْنِ بَدْرٍ عَنْ عُقْبَةَ بْنِ عَامِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari [Abul Khair] dari [Uqbah bin Amir] bahwa Rasulullah shallallahu 'alaihi wasallam pernah memberikan kepadanya kambing yang ia bagikan kepada para sahabatnya sebagai kurban, lalu tersisalah anak unta atau anak kambing yang baru bisa berdiri. Maka hal itu aku ceritakan kepada Rasulullah shallallahu 'alaihi wasallam, lantas beliau bersabda: \"Berkurbanlah kamu dengan hewan itu.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih. Waki' berkata, \"Kambing yang termasuk kategori jadza' adalah yang berumur satu tahun atau tujuh bulan.\" Hadits ini juga diriwayatkan dari Uqbah bin Amir dengan jalur yang lain, bahwasanya ia berkata; \"Rasulullah shallallahu 'alaihi wasallam membagi-bagi hewan kurban dan hanya tersisa seekor jadza'ah, lalu aku bertanya Nabi shallallahu 'alaihi wasallam. Beliau menjawab: \"Berkurbanlah kamu dengan hewan tersebut.\" Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Yazid bin Harun] dan [Abu Dawud] keduanya berkata; telah menceritakan kepada kami [Hisyam Ad Dastuwa'i] dari [Yahya bin Abu Katsir] dari [Ba'jah bin Abdullah bin Badr] dari [Uqbah bin Amir] dari Nabi shallallahu 'alaihi wasallam, sama seperti hadits tersebut.\""
            },
            {
                "number": 1421,
                "arab": "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ الْحُسَيْنِ بْنِ وَاقِدٍ عَنْ عِلْبَاءَ بْنِ أَحْمَرَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَحَضَرَ الْأَضْحَى فَاشْتَرَكْنَا فِي الْبَقَرَةِ سَبْعَةً وَفِي الْبَعِيرِ عَشَرَةًقَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ أَبِي الْأَسَدِ السُّلَمِيِّ عَنْ أَبِيهِ عَنْ جَدِّهِ وَأَبِي أَيُّوبَ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ الْفَضْلِ بْنِ مُوسَى",
                "id": "Telah menceritakan kepada kami [Abu Ammar Al Husain bin Huraits] berkata, telah menceritakan kepada kami [Al Fadhl bin Musa] dari [Al Husain bin Waqid] dari [Ilba bin Ahmar] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Kami bersama Rasulullah shallallahu 'alaihi wasallam dalam perjalanan, lalu tibalah hari Idul adha. Kami lalu berserikat berkurban seekor sapi untuk tujuh orang dan seekor unta untuk sepuluh orang.\" Abu Isa berkata; \"Dalam bab ini ada hadits serupa dari Abul Asad As Sulami dari bapaknya dari kakeknya, dan hadits Abu Ayyub.\" Abu Isa berkata; \"Hadits Ibnu Abbas derajatnya hasan gharib, dan kami tidak mengetahui hadits tersebut kecuali dari Al Fadhl bin Musa.\""
            },
            {
                "number": 1422,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَنَحَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحُدَيْبِيَةِ الْبَدَنَةَ عَنْ سَبْعَةٍ وَالْبَقَرَةَ عَنْ سَبْعَةٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ و قَالَ إِسْحَقُ يُجْزِئُ أَيْضًا الْبَعِيرُ عَنْ عَشَرَةٍ وَاحْتَجَّ بِحَدِيثِ ابْنِ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Malik bin Anas] dari [Abu Az Zubair] dari [Jabir] ia berkata, \"Kami pernah berkurban bersama Rasulullah shallallahu 'alaihi wasallam di Hudaibiyyah, yaitu satu ekor unta untuk tujuh orang dan satu ekor sapi untuk tujuh orang.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih. dan hadits ini menjadi pedoman amal oleh para ulama' dari kalangan sahabat Nabi Sallallahu 'alahi wa sallam dan selainnya. Dan ini adalah perkataan Sufyan Ats Tsauri, Ibnul Mubarak, Syafi'I, Ahmad dan Ishaq. Ishaq berkata; \"Satu ekor unta juga cukup untuk sepuluh orang.\" Ia berpegangan dengan hadits Ibnu Abbas.\" "
            },
            {
                "number": 1423,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا شَرِيكٌ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ حُجَيَّةَ بْنِ عَدِيٍّ عَنْ عَلِيٍّ قَالَالْبَقَرَةُ عَنْ سَبْعَةٍ قُلْتُ فَإِنْ وَلَدَتْ قَالَ اذْبَحْ وَلَدَهَا مَعَهَا قُلْتُ فَالْعَرْجَاءُ قَالَ إِذَا بَلَغَتْ الْمَنْسِكَ قُلْتُ فَمَكْسُورَةُ الْقَرْنِ قَالَ لَا بَأْسَ أُمِرْنَا أَوْ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَشْرِفَ الْعَيْنَيْنِ وَالْأُذُنَيْنِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَالَ أَبُو عِيسَى وَقَدْ رَوَاهُ سُفْيَانُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr] berkata, telah mengabarkan kepada kami [Syarik] dari [Salamah bin Kuhail] dari [Hujayyah bin Adi] dari [Ali] ia berkata; \"Seekor sapi cukup untuk tujuh orang.\" Aku bertanya; \"Bagaimana jika sapi itu melahirkan?\" ia menjawab; \"Sembelih sekalian bersama induknya.\" Aku bertanya lagi; \"Bagaimana dengan hewan yang pincang?\" ia menjawab, \"(boleh) jika telah sampai tempat pemotongan hewan.\" Aku bertanya lagi, \"Bagaimana dengan hewan yang tanduknya pecah?\" ia menjawab, \"Tidak mengapa, kami pernah diperintahkan, atau (ia mangatakan;) \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk memeriksa kesehatan kedua mata dan telinganya.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih. [Sufyan] meriwayatkannya dari [Salamah bin Kuhail].\""
            },
            {
                "number": 1424,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عَبْدَةُ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ جُرَيِّ بْنِ كُلَيْبٍ النَّهْدِيِّ عَنْ عَلِيٍّ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُضَحَّى بِأَعْضَبِ الْقَرْنِ وَالْأُذُنِقَالَ قَتَادَةُ فَذَكَرْتُ ذَلِكَ لِسَعِيدِ بْنِ الْمُسَيَّبِ فَقَالَ الْعَضْبُ مَا بَلَغَ النِّصْفَ فَمَا فَوْقَ ذَلِكَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Hannad] berkata, telah menceritakan kepada kami [Abdah] dari [Sa'id] dari [Qatadah] dari [Juray bin Kulaib An Nahdi] dari [Ali] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang berkurban dengan hewan yang tanduk atau telinganya pecah.\" Qatadah berkata; \"Hal itu lalu aku sebutkan kepada Sa'id Ibnul Musayyab, maka ia berkata; \"Pecah itu jika telah sampai separuh atau lebih.\" Abu Isa berkata, \"Hadits ini derajatnya hasan shahih.\""
            },
            {
                "number": 1425,
                "arab": "حَدَّثَنِي يَحْيَى بْنُ مُوسَى حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ حَدَّثَنَا الضَّحَّاكُ بْنُ عُثْمَانَ حَدَّثَنِي عُمَارَةُ بْنُ عَبْدِ اللَّهِ قَال سَمِعْتُ عَطَاءَ بْنَ يَسَارٍ يَقُولُ سَأَلْتُ أَبَا أَيُّوبَ الْأَنْصَارِيَّكَيْفَ كَانَتْ الضَّحَايَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ كَانَ الرَّجُلُ يُضَحِّي بِالشَّاةِ عَنْهُ وَعَنْ أَهْلِ بَيْتِهِ فَيَأْكُلُونَ وَيُطْعِمُونَ حَتَّى تَبَاهَى النَّاسُ فَصَارَتْ كَمَا تَرَىقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَعُمَارَةُ بْنُ عَبْدِ اللَّهِ هُوَ مَدَنِيٌّ وَقَدْ رَوَى عَنْهُ مَالِكُ بْنُ أَنَسٍ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَقَ وَاحْتَجَّا بِحَدِيثِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ ضَحَّى بِكَبْشٍ فَقَالَ هَذَا عَمَّنْ لَمْ يُضَحِّ مِنْ أُمَّتِي وَقَالَ بَعْضُ أَهْلِ الْعِلْمِ لَا تُجْزِي الشَّاةُ إِلَّا عَنْ نَفْسٍ وَاحِدَةٍ وَهُوَ قَوْلُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ وَغَيْرِهِ مِنْ أَهْلِ الْعِلْمِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Musa] berkata, telah menceritakan kepada kami [Abu Bakar Al Hanafi] berkata, telah menceritakan kepada kami [Adh Dhahhak bin Utsman] berkata, telah menceritakan kepadaku [Umarah bin Abdullah] ia berkata; Aku mendengar [Atha bin Yasar] berkata, \"Aku pernah bertanya kepada [Abu Ayyub Al Anshari], bagaimana kurban yang dilakukan pada masa Rasulullah shallallahu 'alaihi wasallam?\", ia menjawab; \"Seorang laki-laki menyembelih seekor kambing untuk dirinya dan keluarganya, mereka makan daging kurban tersebut dan memberikannya kepada orang lain. Hal itu tetap berlangsung hingga manusia berbangga-bangga, maka jadilah kurban itu seperti sekarang yang engkau saksikan (hanya untuk berbangga-bangga).\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih Dan Umarah bin Abdullah adalah orang Madinah, Malik bin Anas termasuk orang-orang yang telah meriwayatkan darinya. Hadits ini menjadi pedoman amal menurut sebagian ulama', dan inilah pendapat Ahmad dan Ishaq. Keduanya berdalil dengan hadits Nabi shallallahu 'alaihi wasallam, Bahwasanya beliau pernah berkurban dengan seekor kambing, lalu beliau bersabda: \"Ini untuk orang-orang yang belum berkurban dari umatku.\" Sebagian ulama' berpendapat, \"Seekor kambing tidak cukup kecuali untuk satu orang. Dan ini adalah Pendapat Abdullah Ibnul Mubarak dan selainnya dari kalangan para ulama'.\""
            },
            {
                "number": 1426,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا حَجَّاجُ بْنُ أَرْطَاةَ عَنْ جَبَلَةَ بْنِ سُحَيْمٍ أَنَّ رَجُلًاسَأَلَ ابْنَ عُمَرَ عَنْ الْأُضْحِيَّةِ أَوَاجِبَةٌ هِيَ فَقَالَ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْمُسْلِمُونَ فَأَعَادَهَا عَلَيْهِ فَقَالَ أَتَعْقِلُ ضَحَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْمُسْلِمُونَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ أَنَّ الْأُضْحِيَّةَ لَيْسَتْ بِوَاجِبَةٍ وَلَكِنَّهَا سُنَّةٌ مِنْ سُنَنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسْتَحَبُّ أَنْ يُعْمَلَ بِهَا وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَابْنِ الْمُبَارَكِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] berkata, telah menceritakan kepada kami [Husyaim] berkata, telah mengabarkan kepada kami [Hajjaj bin Arthah] dari [Jabalah bin Suhaim] berkata; \"ada seorang laki-laki bertanya kepada Ibnu Umar tentang hukum menyembelih hewan kurban, apakah hukumnya wajib? ' [Ibnu Umar] lalu menjawab, \"Rasulullah shallallahu 'alaihi wasallam dan kaum muslimin melakukannya.\" Laki-laki itu mengulangi pertanyaannya. Ibnu Umar lalu berkata, \"Tidakkah kamu bisa memahaminya, Rasulullah shallallahu 'alaihi wasallam dan kaum muslimin melakukannya!\" Abu Isa berkata, \"Hadits ini derajatnya hasan shahih. Hadits ini menjadi pedoman para ulama', yakni bahwa menyembelih hewan kurban tidaklah wajib, tetapi ia merupakan sunah dari sunah-sunah Rasulullah shallallahu 'alaihi wasallam yang dianjurkan untuk diamalkan. Dan ini adalah pendapat Sufyan Ats Tsauri dan Ibnul Mubarak.\""
            },
            {
                "number": 1427,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ وَهَنَّادٌ قَالَا حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ عَنْ حَجَّاجِ بْنِ أَرْطَاةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَأَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ عَشْرَ سِنِينَ يُضَحِّيقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] dan [Hannad] keduanya berkata; telah menceritakan kepada kami [Ibnu Abu Zaidah] dari [Hajjaj bin Arthah] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam tingal di Madinah selama sepuluh tahun, dan beliau selalu berkurban.\" Abu Isa berkata, \"Ini adalah hadits hasan.\""
            },
            {
                "number": 1428,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ الشَّعْبِيِّ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي يَوْمِ نَحْرٍ فَقَالَ لَا يَذْبَحَنَّ أَحَدُكُمْ حَتَّى يُصَلِّيَ قَالَ فَقَامَ خَالِي فَقَالَ يَا رَسُولَ اللَّهِ هَذَا يَوْمٌ اللَّحْمُ فِيهِ مَكْرُوهٌ وَإِنِّي عَجَّلْتُ نُسُكِي لِأُطْعِمَ أَهْلِي وَأَهْلَ دَارِي أَوْ جِيرَانِي قَالَ فَأَعِدْ ذَبْحًا آخَرَ فَقَالَ يَا رَسُولَ اللَّهِ عِنْدِي عَنَاقُ لَبَنٍ وَهِيَ خَيْرٌ مِنْ شَاتَيْ لَحْمٍ أَفَأَذْبَحُهَا قَالَ نَعَمْ وَهِيَ خَيْرُ نَسِيكَتَيْكَ وَلَا تُجْزِئُ جَذَعَةٌ بَعْدَكَقَالَ وَفِي الْبَاب عَنْ جَابِرٍ وَجُنْدَبٍ وَأَنَسٍ وَعُوَيْمِرِ بْنِ أَشْقَرَ وَابْنِ عُمَرَ وَأَبِي زَيْدٍ الْأَنْصَارِيِّ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ أَنْ لَا يُضَحَّى بِالْمِصْرِ حَتَّى يُصَلِّيَ الْإِمَامُ وَقَدْ رَخَّصَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ لِأَهْلِ الْقُرَى فِي الذَّبْحِ إِذَا طَلَعَ الْفَجْرُ وَهُوَ قَوْلُ ابْنِ الْمُبَارَكِ قَالَ أَبُو عِيسَى وَقَدْ أَجْمَعَ أَهْلُ الْعِلْمِ أَنْ لَا يُجْزِئَ الْجَذَعُ مِنْ الْمَعْزِ وَقَالُوا إِنَّمَا يُجْزِئُ الْجَذَعُ مِنْ الضَّأْنِ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr] berkata, telah mengabarkan kepada kami [Isma'il bin Ibrahim] dari [Dawud bin Abu Hind] dari [Asy Sya'bi] dari [Al Bara bin Azib] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam berkhuthbah di hadapan kami pada hari Nahr (Idul adha), beliau mengatakan: \"Jangan sekali-kali menyembelih hewan kurban hingga kalian selesai melaksanakan sholat.\" Al Bara` berkata, \"Pamanku lalu bangkit dan bertanya, \"Wahai Rasulullah, ini adalah hari di mana orang-orang bosan dengan daging. Untuk itu aku segerakan memotongnya untuk aku berikan kepada keluarga dan tetanggaku (karena mereka belum merasakan bosan).\" Beliau menjawab: \"Ulangilah sembelihanmu dengan yang lain.\" Pamanku berkata lagi, \"Wahai Rasulullah, aku mempunyai kambing muda betina, yang (dagingnya) lebih baik dari pada dua ekor tua kambing jantan. Apakah aku boleh menyembelihnya?\" beliau menjawab: \"Ya. itu adalah sebaik-baik kurbanmu. Dan setelahmu ini, anak kambing yang berumur enam sampai setahun tak lagi dianggap memadai (untuk berkurban).\" Ia berkata; \"Dalam bab ini ada hadits serupa dari Jabir dan Jundub, Uwaimir bin Asyqar, Ibnu Umar dan Abu Zaid Al Anshari.\" Abu Isa berkata, \"Hadits ini derajatnya hasan shahih, dan menjadi pedoman amal menurut sebagian ulama`, yakni bahwa bagi penduduk kota tidak boleh melaksanakan pemotongan hewan hingga imam selesai sholat. Sementara sebagaian ulama yang lain memberi keringanan bagi penduduk kampung untuk menyembelih kurban setelah terbitnya fajar. Dan Ini adalah pendapat Ibnul Mubarak.\", Abu Isa berkata; \"para ulama` telah bersepakat bahwa tidak sah berkurban dengan hewan yang berumur enam bulan hingga satu tahun dari jenis kambing, dan mereka berkata; berkurban dengan hewan yang berumur enam hingga satu tahun hanya sah dari jenis domba\". "
            },
            {
                "number": 1429,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَأْكُلُ أَحَدُكُمْ مِنْ لَحْمِ أُضْحِيَّتِهِ فَوْقَ ثَلَاثَةِ أَيَّامٍقَالَ وَفِي الْبَاب عَنْ عَائِشَةَ وَأَنَسٍ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَإِنَّمَا كَانَ النَّهْيُ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَقَدِّمًا ثُمَّ رَخَّصَ بَعْدَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah salah seorang dari kalian makan daging sembelihannya lebih dari tiga hari.\" Ia berkata, \"Dalam ini ada hadits serupa dari 'Aisyah dan Anas.\" Abu Isa berkata, \"Hadits Ibnu Umar derajatnya hasan shahih. Dan hanyasanya pelarangan dari Nabi shallallahu 'alaihi wasallam tehadap yang demikian itu telah berlalu kemudian setelah itu beliau membolehkannya.\""
            },
            {
                "number": 1430,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمَحْمُودُ بْنُ غَيْلَانَ وَالْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ وَغَيْرُ وَاحِدٍ قَالُوا أَخْبَرَنَا أَبُو عَاصِمٍ النَّبِيلُ حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُنْتُ نَهَيْتُكُمْ عَنْ لُحُومِ الْأَضَاحِيِّ فَوْقَ ثَلَاثٍ لِيَتَّسِعَ ذُو الطَّوْلِ عَلَى مَنْ لَا طَوْلَ لَهُ فَكُلُوا مَا بَدَا لَكُمْ وَأَطْعِمُوا وَادَّخِرُواقَالَ وَفِي الْبَاب عَنْ ابْنِ مَسْعُودٍ وَعَائِشَةَ وَنُبَيْشَةَ وَأَبِي سَعِيدٍ وَقَتَادَةَ بْنِ النُّعْمَانِ وَأَنَسٍ وَأُمِّ سَلَمَةَ قَالَ أَبُو عِيسَى حَدِيثُ بُرَيْدَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] dan [Mahmud bin Ghailan] dan [Al Hasan bin Ali Al Khallal] dan masih banyak, mereka berkata; telah mengabarkan kepada kami [Abu Ashim An Nabil] berkata, telah menceritakan kepada kami [Sufyan Ats Tsauri] dari [Alqamah bin Martsad] dari [Sulaiman bin Buraidah] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku pernah melarang kalian makan daging sembelihan lebih dari tiga hari, agar orang-orang yang berkurban bisa memberikan kepada orang yang tidak bisa berkurban. Maka, sekarang makanlah daging tersebut, kalian bisa berikan kepada orang lain atau kalian simpan.\" Ia berkata, \"Dalam bab ini ada hadits serupa dari Ibnu Mas'ud, 'Aisyah, Nubaisyah, Abu Sa'id, Qatadah bin An Nu'man, Anas dan Ummu Salamah.\" Abu Isa berkata, \"Hadits Buraidah derajatnya hasan shahih, dan menjadi pedoman amal menurut para ulama` dari kalangan sahabat Nabi Sallallahu 'alaihi wa sallam dan selain mereka.\""
            },
            {
                "number": 1431,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ عَابِسِ بْنِ رَبِيعَةَ قَالَقُلْتُ لِأُمِّ الْمُؤْمِنِينَ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ لُحُومِ الْأَضَاحِيِّ قَالَتْ لَا وَلَكِنْ قَلَّ مَنْ كَانَ يُضَحِّي مِنْ النَّاسِ فَأَحَبَّ أَنْ يَطْعَمَ مَنْ لَمْ يَكُنْ يُضَحِّي وَلَقَدْ كُنَّا نَرْفَعُ الْكُرَاعَ فَنَأْكُلُهُ بَعْدَ عَشَرَةِ أَيَّامٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأُمُّ الْمُؤْمِنِينَ هِيَ عَائِشَةُ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ رُوِيَ عَنْهَا هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Abul Ahwash] dari [Abu Ishaq] dari [Abis bin Rabi'ah] ia berkata, \"Aku bertanya kepada [Ummul Mukminin], \"Apakah Rasulullah shallallahu 'alaihi wasallam melarang daging sembelihan (untuk dimakan lebih dari tiga hari)?\" ia menjawab, \"Tidak, hanya saja waktu itu sedikit sekali manusia yang berkurban, maka beliau berkeingian untuk memberi daging kepada orang-orang yang tidak berkurban. Dan sungguh, kami mendendeng kaki kambing dan memakannya setelah sepuluh hari.\" Abu Isa berkata, \"Hadits ini derajatnya hasan shahih. Dan Ummul Mukminin di sini maksudnya adalah 'Aisyah? isteri Nabi shallallahu 'alaihi wasallam. Hadits ini juga diriwayatkan dari 'Aisyah dengan jalur yang lain.\""
            },
            {
                "number": 1432,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ ابْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا فَرَعَ وَلَا عَتِيرَةَ وَالْفَرَعُ أَوَّلُ النِّتَاجِ كَانَ يُنْتَجُ لَهُمْ فَيَذْبَحُونَهُقَالَ وَفِي الْبَاب عَنْ نُبَيْشَةَ وَمِخْنَفِ بْنِ سُلَيْمٍ وَأَبِي الْعُشَرَاءِ عَنْ أَبِيهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَتِيرَةُ ذَبِيحَةٌ كَانُوا يَذْبَحُونَهَا فِي رَجَبٍ يُعَظِّمُونَ شَهْرَ رَجَبٍ لِأَنَّهُ أَوَّلُ شَهْرٍ مِنْ أَشْهُرِ الْحُرُمِ وَأَشْهُرِ الْحُرُمِ رَجَبٌ وَذُو الْقَعْدَةِ وَذُو الْحِجَّةِ وَالْمُحَرَّمُ وَأَشْهُرُ الْحَجِّ شَوَّالٌ وَذُو الْقَعْدَةِ وَعَشْرٌ مِنْ ذِي الْحِجَّةِ كَذَلِكَ رُوِيَ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ فِي أَشْهُرِ الْحَجِّ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Ibnul Musayyab] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada Fara' atau Atirah. Fara' adalah anak unta yang pertama kali dilahirkan, lalu mereka menyembelihnya.\" Ia berkata; \"Dalam bab ini ada hadits serupa dari Nubaisyah, Mikhnaf bin Sulaim dan Abul 'Usyara, dari bapaknya.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih. sementara yang dimaksud dengan Atirah adalah sembelihan yang mereka sembelih pada bulan rajab untuk memuliakan bulan tersebut. Sebab rajab adalah bulan pertama dari bulan-bulan haram. Adapun bulan-bulan haram itu sendiri adalah rajab, dzul qa'dah, dzul hijjah dan muharram. Sedangkan bulan-bulan haji adalah syawal, dzul qa'dah, dan sepuluh hari pada bulan dzul hijjah. Demikianlah yang pernah diriwayatkan dari sebagian sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka tentang bulan-bulan haji.\""
            },
            {
                "number": 1433,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ الْبَصْرِيُّ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ يُوسُفَ بْنِ مَاهَكَ أَنَّهُمْ دَخَلُوا عَلَى حَفْصَةَ بِنْتِ عَبْدِ الرَّحْمَنِ فَسَأَلُوهَا عَنْ الْعَقِيقَةِ فَأَخْبَرَتْهُمْ أَنَّ عَائِشَةَ أَخْبَرَتْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُمْ عَنْ الْغُلَامِ شَاتَانِ مُكَافِئَتَانِ وَعَنْ الْجَارِيَةِ شَاةٌقَالَ وَفِي الْبَاب عَنْ عَلِيٍّ وَأُمِّ كُرْزٍ وَبُرَيْدَةَ وَسَمُرَةَ وَأَبِي هُرَيْرَةَ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَأَنَسٍ وَسَلْمَانَ بْنِ عَامِرٍ وَابْنِ عَبَّاسٍ قَالَ أَبُو عِيسَى حَدِيثُ عَائِشَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَحَفْصَةُ هِيَ بِنْتُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Khalaf Al Bashri] berkata, telah menceritakan kepada kami [Bisyr Ibnul Mufadhdhal] berkata, telah mengabarkan kepada kami [Abdullah bin Utsman bin Khutsaim] dari [Yusuf bin Mahak] Bahwasanya mereka pernah masuk menemui [Hafshah binti 'Abdurrahman], mereka bertanya kepadanya tentang hukum akikah. Lalu Hafshah mengabarkan bahwa ['Aisyah] pernah memberitahunya, bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan para sahabat untuk menyembelih dua ekor kambing yang telah cukup umur untuk anak laki-laki dan satu ekor untuk anak perempuan.\" Ia berkata, \"Dalam bab ini ada hadits serupa dari Ali dan ummu Kurz, Buraidah, Samurah, Abu Hurairah, Abdullah bin Amru, Anas, Salman bin Amir dan Ibnu Abbas.\" Abu Isa berkata, \"Hadits 'Aisyah ini derajatnya hasan shahih, sementara maksud Hafshah dalam hadits tersebut adalah (Hafshah) binti 'Abdurrahman bin Abu Bakar Ash Shiddiq.\""
            },
            {
                "number": 1434,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ الرَّبَابِ عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَ الْغُلَامِ عَقِيقَةٌ فَأَهْرِيقُوا عَنْهُ دَمًا وَأَمِيطُوا عَنْهُ الْأَذَىحَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ عُيَيْنَةَ عَنْ عَاصِمِ بْنِ سُلَيْمَانَ الْأَحْوَلِ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ الرَّبَابِ عَنْ سَلْمَانَ بْنِ عَامِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Hisyam bin Hassan] dari [Hafshah binti Sirin] dari [Ar Rabab] dari [Salman bin Amir Adh Dhabbi] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada anak laki-laki ada hak untuk akikah, maka tumpahkanlah darah (sembelihlah kambing untuknya) dan hilangkanlah kejelekan darinya.\" Telah menceritakan kepada kami [Al Hasan bin A'yan] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ibnu Uyainah] dari [Ashim bin Sulaiman Al Ahwal] dari [Hafshah binti Sirin] dari [Ar Rabab] dari [Salman bin Amir] dari Nabi shallallahu 'alaihi wasallam, seperti dalam hadits tersebut. Abu Isa berkata, \"Hadits ini derajatnya hasan shahih.\""
            },
            {
                "number": 1435,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ عَنْ سِبَاعِ بْنِ ثَابِتٍ أَنَّ مُحَمَّدَ بْنَ ثَابِتِ بْنِ سِبَاعٍ أَخْبَرَهُ أَنَّ أُمَّ كُرْزٍ أَخْبَرَتْهُأَنَّهَا سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْعَقِيقَةِ فَقَالَ عَنْ الْغُلَامِ شَاتَانِ وَعَنْ الْأُنْثَى وَاحِدَةٌ وَلَا يَضُرُّكُمْ ذُكْرَانًا كُنَّ أَمْ إِنَاثًاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] berkata, telah menceritakan kepada kami [Abdurrazaq] dari [Ibnu Juraij] berkata, telah mengabarkan kepada kami [ubaidhullah bin Abu Yazid] dari [Siba' bin Tsabit] bahwa [Muhammad bin Tsabit bin Siba'] mengabarkan kepadanya bahwa [Ummu Kurz] mengabarkan kepadanya, bahwa ia pernah bertanya Rasulullah shallallahu 'alaihi wasallam tentang akikah. Rasulullah shallallahu 'alaihi wasallam lalu menjawab: \"Dua ekor kambing untuk anak laki-laki dan satu ekor untuk anak perempuan. Dan tidak ada masalah bagi kalian apakah kambing tersebut jantan atau betina.\" Abu Isa berkata, \"Hadits ini derajatnya hasan shahih.\""
            },
            {
                "number": 1436,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا أَخْبَرَنَا سُفْيَانُ عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَذَّنَ فِي أُذُنِ الْحَسَنِ بْنِ عَلِيٍّ حِينَ وَلَدَتْهُ فَاطِمَةُ بِالصَّلَاةِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ فِي الْعَقِيقَةِ عَلَى مَا رُوِيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غَيْرِ وَجْهٍ عَنْ الْغُلَامِ شَاتَانِ مُكَافِئَتَانِ وَعَنْ الْجَارِيَةِ شَاةٌ وَرُوِيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْضًا أَنَّهُ عَقَّ عَنْ الْحَسَنِ بْنِ عَلِيٍّ بِشَاةٍ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ إِلَى هَذَا الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dan ['Abdurrahman bin Mahdi] keduanya berkata; telah mengabarkan kepada kami [Sufyan] dari [Ashim bin ubaidhullah] dari [ubaidhullah bin Abu Rafi'] dari [Bapaknya] ia berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam mengumandangkan adzan -sholat- pada telinga Hasan bin Ali saat ia dilahirkan oleh Fatimah.\" Abu Isa berkata, \"Hadits ini derajatnya hasan shahih. Dan pelaksanaan dalam akikah adalah sebagaimana yang diriwayatkan dari Nabi shallallahu 'alaihi wasallam dari jalur yang banyak, yaitu dua ekor kambing yang telah cukup umur untuk laki-laki dan satu ekor untuk anak perempuan. Diriwayatkan pula dari Nabi shallallahu 'alaihi wasallam, Bahwasanya beliau pernah mengakikahi Al Hasan bin Ali dengan satu kambing. Dan sebagian ulama berpegangan dengan hadits ini.\" "
            },
            {
                "number": 1437,
                "arab": "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا أَبُو الْمُغِيرَةِ عَنْ عُفَيْرِ بْنِ مَعْدَانَ عَنْ سُلَيْمِ بْنِ عَامِرٍ عَنْ أَبِي أُمَامَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ الْأُضْحِيَّةِ الْكَبْشُ وَخَيْرُ الْكَفَنِ الْحُلَّةُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَعُفَيْرُ بْنُ مَعْدَانَ يُضَعَّفُ فِي الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Salamah bin Syu'aib] berkata, telah menceritakan kepada kami [Abul Mughirah] dari [Ufair bin Ma'dan] dari [Sulaim bin Amir] dari [Abu Umamah] ia berkata, 'Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik hewan untuk kurban adalah kibasy, dan sebaik-baik kafan adalah hullah (sarung dan selendang).\" Abu Isa berkata, \"Ini adalah hadits gharib. Dan Ufair bin Ma'dan adalah orang yang dilemahkan dalam hal periwayatan hadits.\""
            },
            {
                "number": 1438,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا ابْنُ عَوْنٍ حَدَّثَنَا أَبُو رَمْلَةَ عَنْ مِخْنَفِ بْنِ سُلَيْمٍ قَالَكُنَّا وُقُوفًا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَاتٍ فَسَمِعْتُهُ يَقُولُ يَا أَيُّهَا النَّاسُ عَلَى كُلِّ أَهْلِ بَيْتٍ فِي كُلِّ عَامٍ أُضْحِيَّةٌ وَعَتِيرَةٌ هَلْ تَدْرُونَ مَا الْعَتِيرَةُ هِيَ الَّتِي تُسَمُّونَهَا الرَّجَبِيَّةَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَلَا نَعْرِفُ هَذَا الْحَدِيثَ إِلَّا مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ ابْنِ عَوْنٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] berkata, telah menceritakan kepada kami [Rauh bin Ubadah] berkata, telah menceritakan kepada kami [Ibnu Aun] berkata, telah menceritakan kepada kami [Abu Ramlah] dari [Mikhnaf bin Sulaim] ia berkata, \"Kami bersama Nabi shallallahu 'alaihi wasallam wukuf di Arafah, lalu aku mendengar beliau bersabda: \"Wahai manusia, setiap pemilik rumah wajib memberikan hewan kurban dan Atirah pada setiap tahunnya. Tahukah kalian apa itu Atirah? Kalian biasa menamainya dengan rajabiyah (hewan yang dipotong untuk memuliakan bulan rajab).\" Abu Isa berkata; \"Ini adalah hadits gharib, kami tidak mengetahuinya kecuali dari jalur ini, yaitu dari hadits Ibnu Aun.\""
            },
            {
                "number": 1439,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَعَقَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْحَسَنِ بِشَاةٍ وَقَالَ يَا فَاطِمَةُ احْلِقِي رَأْسَهُ وَتَصَدَّقِي بِزِنَةِ شَعْرِهِ فِضَّةً قَالَ فَوَزَنَتْهُ فَكَانَ وَزْنُهُ دِرْهَمًا أَوْ بَعْضَ دِرْهَمٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَإِسْنَادُهُ لَيْسَ بِمُتَّصِلٍ وَأَبُو جَعْفَرٍ مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحُسَيْنِ لَمْ يُدْرِكْ عَلِيَّ بْنَ أَبِي طَالِبٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya Al Qutha'i] berkata, telah menceritakan kepada kami [Abdul A'la bin Abdul A'la] dari [Muhammad bin Ishaq] dari [Abdullah bin Abu Bakar] dari [Muhammd bin Ali bin Al Husain] dari [Ali bin Abu Thalib] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengakikahi Hasan dengan seekor kambing.\" Kemudian beliau bersabda: \"Wahai Fatimah, cukurlah rambutnya lalu sedekahkanlah perak seberat rambutnya.\" Ali berkata, \"Aku kemudian menimbang rambutnya, dan beratnya sekadar uang satu dirham atau sebagiannya.\" Abu Isa berkata; \"Hadits ini derajatnya hasan gharib dan sanadnya tidak bersambung. Dan Abu Ja'far Muhammad bin Ali bin Al Husain belum pernah bertemu dengan Ali bin Abu Thalib.\""
            },
            {
                "number": 1440,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا أَزْهَرُ بْنُ سَعْدٍ السَّمَّانُ عَنْ ابْنِ عَوْنٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ ثُمَّ نَزَلَ فَدَعَا بِكَبْشَيْنِ فَذَبَحَهُمَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] berkata, telah menceritakan kepada kami [Azhar bin Sa'd As Samman] dari [Ibnu Aun] dari [Muhammad bin Sirin] dari ['Abdurrahman bin Abu Bakrah] dari [Bapaknya] berkata, \"Nabi shallallahu 'alaihi wasallam pernah berkhutbah, lalu beliau turun dan minta didatangkan dua ekor kambing, setelah itu beliau menyembelih kambing tersebut.\" Abu Isa berkata, \"Hadits ini derajatnya hasan shahih.\""
            },
            {
                "number": 1441,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو عَنْ الْمُطَّلِبِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَشَهِدْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَضْحَى بِالْمُصَلَّى فَلَمَّا قَضَى خُطْبَتَهُ نَزَلَ عَنْ مِنْبَرِهِ فَأُتِيَ بِكَبْشٍ فَذَبَحَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ وَقَالَ بِسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ هَذَا عَنِّي وَعَمَّنْ لَمْ يُضَحِّ مِنْ أُمَّتِيقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ أَنْ يَقُولَ الرَّجُلُ إِذَا ذَبَحَ بِسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ وَهُوَ قَوْلُ ابْنِ الْمُبَارَكِ وَالْمُطَّلِبُ بْنُ عَبْدِ اللَّهِ بْنِ حَنْطَبٍ يُقَالُ إِنَّهُ لَمْ يَسْمَعْ مِنْ جَابِرٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Ya'qub bin 'Abdurrahman] dari [Amru bin Abu Amru] dari [Al Muthallib] dari [Jabir bin Abdullah] ia berkata; \"Aku pernah mengikuti sholat 'idul adha bersama Nabi shallallahu 'alaihi wasallam di lapangan, maka ketika selesai berkhutbah beliau turun dari mimbar. Setelah itu didatangkan kepada beliau seekor kambing, lalu Rasulullah shallallahu 'alaihi wasallam menyembelih kambing tersebut dengan tangannya. Dan beliau mengucapkan: \"BISMILLLAAHI WALLAAHU AKBAR (Dengan nama Allah, Allah Maha Besar), ini dariku dan dari umatku yang belum berkurban.\" Abu Isa berkata, \"Hadits ini derajatnya gharib dari jalur ini. Dan hadits ini menjadi pedoman amal menurut para ulama' dari kalangan sahabat Nabi Sallallahu 'Alaihi Wasallam dan selain mereka, Yakni, hendaklah seorang laki-laki ketika menyembelih (kurban) ia mengucapkan; \"BISMILLLAAHI WALLAAHU AKBAR\" (Dengan nama Allah, Allah Maha Besar) dan ini adalah pendapat Ibnul Mubarak. Dan? dikatakan bahwa Al Muthallib bin Abdullah bin Hanthab belum pernah mendengar dari Jabir.\""
            },
            {
                "number": 1442,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ إِسْمَعِيلَ بْنِ مُسْلِمٍ عَنْ الْحَسَنِ عَنْ سَمُرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْغُلَامُ مُرْتَهَنٌ بِعَقِيقَتِهِ يُذْبَحُ عَنْهُ يَوْمَ السَّابِعِ وَيُسَمَّى وَيُحْلَقُ رَأْسُهُحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ يَسْتَحِبُّونَ أَنْ يُذْبَحَ عَنْ الْغُلَامِ الْعَقِيقَةُ يَوْمَ السَّابِعِ فَإِنْ لَمْ يَتَهَيَّأْ يَوْمَ السَّابِعِ فَيَوْمَ الرَّابِعَ عَشَرَ فَإِنْ لَمْ يَتَهَيَّأْ عُقَّ عَنْهُ يَوْمَ حَادٍ وَعِشْرِينَ وَقَالُوا لَا يُجْزِئُ فِي الْعَقِيقَةِ مِنْ الشَّاةِ إِلَّا مَا يُجْزِئُ فِي الْأُضْحِيَّةِ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr] berkata, telah mengabarkan kepada kami [Ali bin Mushir] dari [Isma'il bin Muslim] dari [Al Hasan] dari [Samurah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang anak laki-laki itu tergadai dengan akikahnya yang disembelih pada hari ketujuh, pada hari itu ia diberi nama dan dicukur rambutnya.\" Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Sa'id bin Abu Arubah] dari [Qatadah] dari [Al Hasan] dari [Samurah bin Jundub] dari Nabi shallallahu 'alaihi wasallam seperti dalam hadits tersebut.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih. Dan menjadi pedoman amal menurut para ulama`, mereka menyukai jika akikah untuk anak itu disembelih pada hari ke tujuh, jika belum tersedia pada hari ke tujuh maka pada hari ke empat belas, dan jika belum tersedia maka pada hari ke dua puluh satu. Mereka mengatakan; \"kambing yang sah untuk disembelih dalam akikah adalah kambing yang memenuhi kreteria (syarat) kurban\". "
            },
            {
                "number": 1443,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَكَمِ الْبَصْرِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ شُعْبَةَ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ عَمْرٍو أَوْ عُمَرَ بْنِ مُسْلِمٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أُمِّ سَلَمَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ رَأَى هِلَالَ ذِي الْحِجَّةِ وَأَرَادَ أَنْ يُضَحِّيَ فَلَا يَأْخُذَنَّ مِنْ شَعْرِهِ وَلَا مِنْ أَظْفَارِهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالصَّحِيحُ هُوَ عَمْرُو بْنُ مُسْلِمٍ قَدْ رَوَى عَنْهُ مُحَمَّدُ بْنُ عَمْرِو بْنِ عَلْقَمَةَ وَغَيْرُ وَاحِدٍ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أُمِّ سَلَمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غَيْرِ هَذَا الْوَجْهِ نَحْوَ هَذَا وَهُوَ قَوْلُ بَعْضِ أَهْلِ الْعِلْمِ وَبِهِ كَانَ يَقُولُ سَعِيدُ بْنُ الْمُسَيَّبِ وَإِلَى هَذَا الْحَدِيثِ ذَهَبَ أَحْمَدُ وَإِسْحَقُ وَرَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ فِي ذَلِكَ فَقَالُوا لَا بَأْسَ أَنْ يَأْخُذَ مِنْ شَعَرِهِ وَأَظْفَارِهِ وَهُوَ قَوْلُ الشَّافِعِيِّ وَاحْتَجَّ بِحَدِيثِ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَبْعَثُ بِالْهَدْيِ مِنْ الْمَدِينَةِ فَلَا يَجْتَنِبُ شَيْئًا مِمَّا يَجْتَنِبُ مِنْهُ الْمُحْرِمُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Al Hakam Al Bashri] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] dari [Syu'bah] dari [Malik bin Anas] dari [Amru atau Umar bin Muslim] dari [Sa'id Ibnul Al Musayyab] dari [Ummu Salamah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa melihat hilal bulan dzul hijjah dan ingin berkurban, maka janganlah ia mengambil rambut atau kukunya.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih. Yang benar, dia adalah Amru bin Muslim, Muhammad bin Amru bin Alqamah adalah orang yang meriwayatkan hadits darinya dan masih banyak lagi. Hadits ini juga diriwayatkan dari Sa'id Ibnul Musayyab, dari Ummu Salamah, dari Nabi shallallahu 'alaihi wasallam dengan jalur lain, seperti hadits tersebut. Hadits ini menjadi pendapat sebagian ulama` di antaranya Sa'id bin Al Musayyab, Ahmad dan Ishaq. Namun ada sebagian ulama` lain yang memberikan keringan dalam persoalan tersebut, mereka mengatakan, \"Tidak apa-apa mengambil bulu atau kukunya, dan ini adalah pendapat As Syafi'i. Ia berhujah dengan hadits 'Aisyah bahwa Nabi shallallahu 'alaihi wasallam pernah mengirim hewan kurban dari Madinah. Dan beliau tidak menghindari perbuatan yang dihindari oleh orang yang sedang ihram.\" "
            },
            {
                "number": 1444,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو صَفْوَانَ عَنْ يُونُسَ بْنِ يَزِيدَ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَذْرَ فِي مَعْصِيَةٍ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍقَالَ وَفِي الْبَاب عَنْ ابْنِ عُمَرَ وَجَابِرٍ وَعِمْرَانَ بْنِ حُصَيْنٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا يَصِحُّ لِأَنَّ الزُّهْرِيَّ لَمْ يَسْمَعْ هَذَا الْحَدِيثَ مِنْ أَبِي سَلَمَةَ قَالَ سَمِعْت مُحَمَّدًا يَقُولُ رَوَى غَيْرُ وَاحِدٍ مِنْهُمْ مُوسَى بْنُ عُقْبَةَ وَابْنُ أَبِي عَتِيقٍ عَنْ الزُّهْرِيِّ عَنْ سُلَيْمَانَ بْنِ أَرْقَمَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مُحَمَّدٌ وَالْحَدِيثُ هُوَ هَذَا",
                "id": "Telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Abu Shafwan] dari [Yunus bin Abu Yazid] dari [Ibnu Syihab] dari [Abu Salamah] dari ['Aisyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada nadzar dalam bermaksiat, dan kafarahnya adalah kafarah sumpah.\" Ia berkata; \"Dalam bab ini ada hadits serupa dari Ibnu Umar, Jabir dan Imran bin Hushain.\" Abu Isa berkata; \"Ini adalah hadits yang tidak shahih, sebab Az Zuhri tidak mendengar hadits ini dari Abu Salamah. Ia berkata, \"Aku mendengar [Muhammad] berkata; \"Tidak hanya seorang yang telah meriwayatkan hadits ini, di antara mereka [Musa bin Uqbah] dan [Ibnu Abu Atiq] dari [Az Zuhri] dari [Sulaiman bin Arqam] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam. Muhammad berkata, \"Hadits itu (sendiri) adalah ini.\""
            },
            {
                "number": 1445,
                "arab": "حَدَّثَنَا أَبُو إِسْمَعِيلَ التِّرْمِذِيُّ وَاسْمُهُ مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ يُوسُفَ حَدَّثَنَا أَيُّوبُ بْنُ سُلَيْمَانَ بْنِ بِلَالٍ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي أُوَيْسٍ عَنْ سُلَيْمَانَ بْنِ بِلَالٍ عَنْ مُوسَى بْنِ عُقْبَةَ وَمُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي عَتِيقٍ عَنْ الزُّهْرِيِّ عَنْ سُلَيْمَانَ بْنِ أَرْقَمَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا نَذْرَ فِي مَعْصِيَةِ اللَّهِ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَهُوَ أَصَحُّ مِنْ حَدِيثِ أَبِي صَفْوَانَ عَنْ يُونُسَ وَأَبُو صَفْوَانَ هُوَ مَكِّيٌّ وَاسْمُهُ عَبْدُ اللَّهِ بْنُ سَعِيدِ بْنِ عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ وَقَدْ رَوَى عَنْهُ الْحُمَيْدِيُّ وَغَيْرُ وَاحِدٍ مِنْ جُلَّةِ أَهْلِ الْحَدِيثِ و قَالَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ لَا نَذْرَ فِي مَعْصِيَةِ اللَّهِ وَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَقَ وَاحْتَجَّا بِحَدِيثِ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ و قَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ لَا نَذْرَ فِي مَعْصِيَةٍ وَلَا كَفَّارَةَ فِي ذَلِكَ وَهُوَ قَوْلُ مَالِكٍ وَالشَّافِعِيِّ",
                "id": "Telah menceritakan kepada kami [Abu Isma'il At Tirmidzi] -dan namanya adalah Muhammad bin Isma'il bin Yusuf, berkata; telah menceritakan kepada kami [Ayyub bin Sulaiman bin Bilal] berkata, telah menceritakan kepada kami [Abu Bakar bin Abu Uwais] dari [Sulaiman bin bilal] dari [Musa bin Uqbah] dan [Muhammad bin Abdullah bin Abu Atiq] dari [Az Zuhri] dari [Sulaiman bin Arqam] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada nadzar dalam bermaksiat kepada Allah, dan kafarahnya adalah kafarah sumpah.\" Abu Isa berkata, \"Hadits ini derajatnya gharib. Tetapi hadits ini lebih shahih dari hadits Abu Shafwan dari Yunus. Abu Shafwan sendiri adalah orang Makkah, namanya adalah Abdullah bin Sa'id bin Abdul Malik bin Marwan. Al Humaidi dan banyak ulama dari ahli hadits telah meriwayatkan darinya. Ada Sekelompok ulama` dari kalangan sahabat nabi shallallahu 'alaihi wasallam dan selain mereka berkata, \"Tidak ada nadzar dalam bermaksiat kepada Allah, dan kafarahnya adalah kafarah sumpah.\" Dan ini adalah pendapat Ahmad dan Ishaq, keduanya berdalil dengan hadits Az Zuhri, dari Abu Salamah, dari 'Aisyah. Dan sebagian ulama` dari kalangan sahabat nabi shallallahu 'alaihi wasallam dan selainnya berkata; \"Tidak ada nadzar dalam bermaksiat, dan tidak ada pula kafarah dalam hal tersebut.\" Dan ini adalah pendapat Malik dan As Syafi'i.\""
            },
            {
                "number": 1446,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ الْأَيْلِيِّ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ نَذَرَ أَنْ يُطِيعَ اللَّهَ فَلْيُطِعْهُ وَمَنْ نَذَرَ أَنْ يَعْصِيَ اللَّهَ فَلَا يَعْصِهِحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ طَلْحَةَ بْنِ عَبْدِ الْمَلِكِ الْأَيْلِيِّ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَاهُ يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ وَهُوَ قَوْلُ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ وَبِهِ يَقُولُ مَالِكٌ وَالشَّافِعِيُّ قَالُوا لَا يَعْصِي اللَّهَ وَلَيْسَ فِيهِ كَفَّارَةُ يَمِينٍ إِذَا كَانَ النَّذْرُ فِي مَعْصِيَةٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik bin Anas] dari [Thalhah bin Abdul Malik Al Aili] dari [Al Qasim bin Muhammad] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa bernadzar untuk taat kepada Allah hendaklah ia kerjakan dan barangsiapa bernadzar untuk bermaksiat kepada Allah maka janganlah ia kerjakan.\" Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] berkata; telah menceritakan kepada kami [Abdullah bin Numair] dari [ubaidhullah bin Umar] dari [Thalhah bin Abdul Malik Al Aili] dari [Al Qasim bin Muhammad] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam, seperti hadits tersebut.\" Abu Isa berkata, \"Hadits ini derajatnya hasan shahih, [Yahya bin Abu Katsir] meriwayatkannya dari? [Al Qasim bin Muhammad]. Dan ini adalah pendapat sebagian ulama` dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka. Pendapat ini juga dipegang oleh Imam Malik dan Imam Syafi'i. Mereka mengatakan, \"Tidak boleh bermaksiat kepada Allah, (jika seseorang bernadzar demikian) dan tidak ada kaffarat sumpah apabila terdapat nadzar dalam kemaksiatan.\""
            },
            {
                "number": 1447,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا إِسْحَقُ بْنُ يُوسُفَ الْأَزْرَقُ عَنْ هِشَامٍ الدَّسْتُوَائِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي قِلَابَةَ عَنْ ثَابِتِ بْنِ الضَّحَّاكِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ عَلَى الْعَبْدِ نَذْرٌ فِيمَا لَا يَمْلِكُقَالَ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو وَعِمْرَانَ بْنِ حُصَيْنٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] berkata, telah menceritakan kepada kami [Ishaq bin Yusuf Al Azraq] dari [Hisyam Ad Dastuwa`i] dari [Yahya bin Abu Katsir] dari [Abu Qilabah] dari [Tsabit bin Adh Dhahhak] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang hamba tidak boleh bernadzar dengan sesuatu yang tidak ia miliki.\" Ia berkata, \"Dalam bab ini ada hadits serupa dari Abdullah bin Amru dan Imran Abu Isa Hushain.\" Abu Isa berkata, \"Hadits ini derajatnya hasan shahih.\""
            },
            {
                "number": 1448,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ حَدَّثَنِي مُحَمَّدٌ مَوْلَى الْمُغِيرَةِ بْنِ شُعْبَةَ حَدَّثَنِي كَعْبُ بْنُ عَلْقَمَةَ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَفَّارَةُ النَّذْرِ إِذَا لَمْ يُسَمَّ كَفَّارَةُ يَمِينٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] berkata, telah menceritakan kepada kami [Abu Bakar bin Ayyasy] berkata, telah menceritakan kepadaku [Muhammad] mantan budak (yang telah dimerdekakan oleh) Al Mughirah bin Syu'bah- berkata, telah menceritakan kepadaku [Ka'b bin Alqamah] dari [Abul Khair] dari [Uqbah bin Amir] ia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kafarah nadzar yang belum ditentukan (bentuknya), maka kafarahnya adalah dengan kafarah yamin (sumpah).\" Abu Isa berkata, \"Hadits ini derajatnya hasan shahih gharib.\""
            },
            {
                "number": 1449,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ يُونُسَ هُوَ ابْنُ عُبَيْدٍ حَدَّثَنَا الْحَسَنُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَبْدَ الرَّحْمَنِ لَا تَسْأَلْ الْإِمَارَةَ فَإِنَّكَ إِنْ أَتَتْكَ عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا وَإِنْ أَتَتْكَ عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَأْتِ الَّذِي هُوَ خَيْرٌ وَلْتُكَفِّرْ عَنْ يَمِينِكَوَفِي الْبَاب عَنْ عَلِيٍّ وَجَابِرٍ وَعَدِيِّ بْنِ حَاتِمٍ وَأَبِي الدَّرْدَاءِ وَأَنَسٍ وَعَائِشَةَ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَأَبِي هُرَيْرَةَ وَأُمِّ سَلَمَةَ وَأَبِي مُوسَى قَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul A'la Ash Shan'ani] berkata, telah menceritakan kepada kami [Al Mu'tamir bin Sulaiman] dari [Yunus] ia adalah Ibnu Ubaid- berkata, telah menceritakan kepada kami [Al Hasan] dari ['Abdurrahman bin Samurah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai 'Abdurrahman, janganlah kamu mengharap kekuasaan. Sesungguhnya jika kekuasaan itu datang kepadamu karena pengharapanmu, maka urusannya akan dibebankan kepadamu. Tetapi jika kekuasaan itu datang kepadamu bukan karena pengharapanmu, maka engkau akan mendapat pertolongan. Jika engkau bersumpah untuk melakukan sesuatu (nadzar) kemudian melihat yang lebih baik, maka ambillah sesuatu yang lebih baik itu dan tunaikanlah kafarah untuk sumpahmu tersebut.\" Ia berkata, \"Dalam bab ini ada hadits serupa dari Ali, Jabir, Adi bin Hatim, Abu Darda, Anas, 'Aisyah, Abdullah bin Amru, Abu Hurairah, Ummu Salamah dan Abu Musa.\" Abu Isa berkata; \"Hadits 'Abdurrahman bin Samurah derajatnya hasan shahih.\""
            },
            {
                "number": 1450,
                "arab": "حَدَّثَنَا قُتَيْبَةُ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرَهَا خَيْرًا مِنْهَا فَلْيُكَفِّرْ عَنْ يَمِينِهِ وَلْيَفْعَلْقَالَ وَفِي الْبَاب عَنْ أُمِّ سَلَمَةَ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ أَنَّ الْكَفَّارَةَ قَبْلَ الْحِنْثِ تُجْزِئُ وَهُوَ قَوْلُ مَالِكِ بْنِ أَنَسٍ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ و قَالَ بَعْضُ أَهْلِ الْعِلْمِ لَا يُكَفِّرُ إِلَّا بَعْدَ الْحِنْثِ قَالَ سُفْيَانُ الثَّوْرِيُّ إِنْ كَفَّرَ بَعْدَ الْحِنْثِ أَحَبُّ إِلَيَّ وَإِنْ كَفَّرَ قَبْلَ الْحِنْثِ أَجْزَأَهُ",
                "id": "Telah menceritakan kepada kami [Qutaibah] dari [Malik bin Anas] dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa bersumpah atas suatu perkara lalu melihat yang lebih baik dari itu, maka hendaklah ia kerjakan yang lebih baik dan membayar kafarah sumpahnya.\" Ia berkata, \"Dalam bab ini ada hadits serupa dari Ummu Salamah.\" Abu Isa berkata; \"Hadits Abu Hurairah derajatnya hasan shahih. Dan menjadi pedoman amal menurut kebanyakan ulama` dari kalangan sahabat Nabi Sallallahu 'Alaihi Wasallam dan selain mereka, yakni bahwa kafarah yang ditunaikan sebelum terjadinya pelanggaran adalah sah. Ini adalah pendapat yang diambil oleh Malik bin Anas, As Syafi'I, Ahmad dan Ishaq. Sedangkan sebagian ulama` lain berpendapat bahwa kafarah tidak boleh ditunaikan sebelum terjadinya pelanggaran. Sufyan Ats Tsauri berkata; \"Jika seseorang memberikan kafarah setelah terjadinya pelanggaran maka itu lebih aku sukai, jika ia memberikannya sebelum terjadinya pelanggaran maka itu sudah cukup.\""
            }
        ]
    }
}