{
    "status": true,
    "data": {
        "start": 2611,
        "end": 2755,
        "total": 145,
        "book": "tirmidzi",
        "hadits": [
            {
                "number": 2611,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا عَفَّانُ أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حُمَيْدٍ عَنْ أَنَسٍ قَالَلَمْ يَكُنْ شَخْصٌ أَحَبَّ إِلَيْهِمْ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَكَانُوا إِذَا رَأَوْهُ لَمْ يَقُومُوا لِمَا يَعْلَمُونَ مِنْ كَرَاهِيَتِهِ لِذَلِكَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah mengabarkan kepada kami ['Affan] telah mengabarkan kepada kami [Hammad bin Salamah] dari [Humaid] dari [Anas] ia berkata; \"Tidak ada seorangpun yang lebih mereka (para sahabat) cintai selain dari Rasulullah shallallahu 'alaihi wasallam, Anas berkata; Apabila melihat beliau, mereka tidak bangkit karena mereka tahu bahwa beliau tidak menyukai yang demikian.\" Abu Isa berkata; Hadits ini hasan shahih gharib dari jalur ini.\""
            },
            {
                "number": 2612,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا قَبِيصَةُ حَدَّثَنَا سُفْيَانُ عَنْ حَبِيبِ بْنِ الشَّهِيدِ عَنْ أَبِي مِجْلَزٍ قَالَخَرَجَ مُعَاوِيَةُ فَقَامَ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ وَابْنُ صَفْوَانَ حِينَ رَأَوْهُ فَقَالَ اجْلِسَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ سَرَّهُ أَنْ يَتَمَثَّلَ لَهُ الرِّجَالُ قِيَامًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِوَفِي الْبَاب عَنْ أَبِي أُمَامَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ حَبِيبِ بْنِ الشَّهِيدِ عَنْ أَبِي مِجْلَزٍ عَنْ مُعَاوِيَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Qibishah] telah menceritakan kepada kami [Sufyan] dari [Habib bin Asy Syahid] dari [Abu Mijlaz] ia berkata; \"Suatu ketika Mu'awiyah keluar, ketika melihatnya, Abdullah bin Zubair dan Ibnu Safwan langsung berdiri, [Mu'awiyah] berkata; \"Duduklah kalian, aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa senang menjadikan orang-orang berdiri untuknya, maka bersiap-siaplah menempati tempatnya di neraka.\" Dan dalam bab ini, ada hadits dari Abu Umamah. Abu Isa berkata; Hadits ini hasan. Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Usamah] dari [Habib bin Asy Syahid] dari [Abu Mijlaz] dari [Mu'awiyah] dari Nabi shallallahu 'alaihi wasallam seperti hadits diatas."
            },
            {
                "number": 2613,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسٌ مِنْ الْفِطْرَةِ الِاسْتِحْدَادُ وَالْخِتَانُ وَقَصُّ الشَّارِبِ وَنَتْفُ الْإِبْطِ وَتَقْلِيمُ الْأَظْفَارِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] dan lainnya, mereka berkata; telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Lima hal termasuk (sunnah) fitrah, yaitu; mencukur rambut kemaluan, khitan, mencukur kumis, mencabut bulut ketiak dan memotong kuku, \" Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2614,
                "arab": "حَدَّثَنَا قُتَيْبَةُ وَهَنَّادٌ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ مُصْعَبِ بْنِ شَيْبَةَ عَنْ طَلْقِ بْنِ حَبِيبٍ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَشْرٌ مِنْ الْفِطْرَةِ قَصُّ الشَّارِبِ وَإِعْفَاءُ اللِّحْيَةِ وَالسِّوَاكُ وَالِاسْتِنْشَاقُ وَقَصُّ الْأَظْفَارِ وَغَسْلُ الْبَرَاجِمِ وَنَتْفُ الْإِبْطِ وَحَلْقُ الْعَانَةِ وَانْتِقَاصُ الْمَاءِقَالَ زَكَرِيَّا قَالَ مُصْعَبٌ وَنَسِيتُ الْعَاشِرَةَ إِلَّا أَنْ تَكُونَ الْمَضْمَضَةَ قَالَ أَبُو عِيسَى انْتِقَاصُ الْمَاءِ الِاسْتِنْجَاءُ بِالْمَاءِ وَفِي الْبَاب عَنْ عَمَّارِ بْنِ يَاسِرٍ وَابْنِ عُمَرَ وَأَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah] dan [Hannad] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Zakariya bin Abu Za`idah] dari [Mush'ab bin Syaibah] dari [Thalq bin Habib] dari [Abdullah bin Az Zubair] dari ['Aisyah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sepuluh hal yang termasuk (sunnah) fitrah, yaitu; mencukur kumis, memanjangkan jenggot, bersiwak, Istinsyaq (menghirup air lewat hidung), memotong kuku, membasuh ruas jari, mencabut bulu ketiak, mencukur rambut kemaluan, beristinja` -Mush'ab mengatakan; Saya lupa yang kesepuluh- mungkin berkumur.\" Abu Isa berkata; \"Intiqash al-maa` artinya beristinja` dengan air.\" Dalam hal ini ada hadits serupa dari Ammar bin Yasir, Ibnu Umar dan Abu Hurairah. Abu Isa berkata; Hadits ini hasan."
            },
            {
                "number": 2615,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا صَدَقَةُ بْنُ مُوسَى أَبُو مُحَمَّدٍ صَاحِبُ الدَّقِيقِ حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ عَنْ أَنَسِ بْنِ مَالِكٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ وَقَّتَ لَهُمْ فِي كُلِّ أَرْبَعِينَ لَيْلَةً تَقْلِيمَ الْأَظْفَارِ وَأَخْذَ الشَّارِبِ وَحَلْقَ الْعَانَةِ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manhsur] telah mengabarkan kepada kami [Abdushshamad bin Abdul Warits] telah menceritakan kepada kami [Shadaqah bin Musa Abu Muhammad] telah menceritakan kepada kami [Abu Imran Al Jauni] dari [Anas bin Malik] dari nabi shallallahu 'alaihi wasallam, bahwa beliau memberi batas waktu setiap empatpuluh malam untuk memotong kuku, mencukur kumis dan mencukur rambut kemaluan.\""
            },
            {
                "number": 2616,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَوُقِّتَ لَنَا فِي قَصِّ الشَّارِبِ وَتَقْلِيمِ الْأَظْفَارِ وَحَلْقِ الْعَانَةِ وَنَتْفِ الْإِبْطِ لَا يُتْرَكُ أَكْثَرَ مِنْ أَرْبَعِينَ يَوْمًاقَالَ هَذَا أَصَحُّ مِنْ حَدِيثِ الْأَوَّلِ وَصَدَقَةُ بْنُ مُوسَى لَيْسَ عِنْدَهُمْ بِالْحَافِظِ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Ja'far bin Sulaiman] dari [Abu 'Imran Al Jauni] dari [Anas bin Malik] ia berkata; \"Kami diberi batas waktu untuk mencukur kumis, memotong kuku, mencukur bulu kemaluan, mencabut bulu ketiak, tidak dibiarkan lebih dari empatpuluh hari.\" Abu Isa berkata; Hadits ini lebih shahih dari hadits pertama. Shadaqah bin Musa menurut mereka bukan seorang yang hafidz."
            },
            {
                "number": 2617,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الْوَلِيدِ الْكِنْدِيُّ الْكُوفِيُّ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ إِسْرَائِيلَ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُصُّ أَوْ يَأْخُذُ مِنْ شَارِبِهِ وَكَانَ إِبْرَاهِيمُ خَلِيلُ الرَّحْمَنِ يَفْعَلُهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Umar bin Al Walid Al Kindi Al Kufi] telah menceritakan kepada kami [Yahya bin Adam] dari [Isra`il] dari [Simak] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; \"Nabi shallallahu 'alaihi wasallam biasa mencukur atau memotong kumis beliau, dan Ibrahim kekasih Ar Rahman juga melakukan hal yang sama.\" Abu Isa berkata; Hadits ini hasan gharib."
            },
            {
                "number": 2618,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ عَنْ يُوسُفَ بْنِ صُهَيْبٍ عَنْ حَبِيبِ بْنِ يَسَارٍ عَنْ زَيْدِ بْنِ أَرْقَمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَمْ يَأْخُذْ مِنْ شَارِبِهِ فَلَيْسَ مِنَّاوَفِي الْبَاب عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ يُوسُفَ بْنِ صُهَيْبٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Abidah bin Humaid] dari [Yusuf bin Shuhaib] dari [Habib bin Yasar] dari [Zaid bin Arqam] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa tidak mencukur kumisnya, maka dia bukan termasuk golonganku.\" Dan dalam bab ini, ada juga hadits dari Al Mughirah bin Syu'bah. Abu Isa berkata; Hadits ini hasan shahih. Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Yusuf bin Shuhaib] dengan sanad yang semakna hadits ini."
            },
            {
                "number": 2619,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عُمَرُ بْنُ هَارُونَ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْخُذُ مِنْ لِحْيَتِهِ مِنْ عَرْضِهَا وَطُولِهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ و سَمِعْت مُحَمَّدَ بْنَ إِسْمَعِيلَ يَقُولُ عُمَرُ بْنُ هَارُونَ مُقَارِبُ الْحَدِيثِ لَا أَعْرِفُ لَهُ حَدِيثًا لَيْسَ لَهُ أَصْلٌ أَوْ قَالَ يَنْفَرِدُ بِهِ إِلَّا هَذَا الْحَدِيثَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْخُذُ مِنْ لِحْيَتِهِ مِنْ عَرْضِهَا وَطُولِهَا لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عُمَرَ بْنِ هَارُونَ وَرَأَيْتُهُ حَسَنَ الرَّأْيِ فِي عُمَرَ قَالَ أَبُو عِيسَى و سَمِعْت قُتَيْبَةَ يَقُولُ عُمَرُ بْنُ هَارُونَ كَانَ صَاحِبَ حَدِيثٍ وَكَانَ يَقُولُ الْإِيمَانُ قَوْلٌ وَعَمَلٌ قَالَ قُتَيْبَةُ حَدَّثَنَا وَكِيعُ بْنُ الْجَرَّاحِ عَنْ رَجُلٍ عَنْ ثَوْرِ بْنِ يَزِيدَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَصَبَ الْمَنْجَنِيقَ عَلَى أَهْلِ الطَّائِفِ قَالَ قُتَيْبَةُ قُلْتُ لِوَكِيعٍ مَنْ هَذَا قَالَ صَاحِبُكُمْ عُمَرُ بْنُ هَارُونَ",
                "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Umar bin Harun] dari [Usamah bin Zaid] dari ['Amru bin Syu'aib] dari [Ayahnya] dari [kakeknya] bahwa Nabi shallallahu 'alaihi wasallam mengambil (memotong) jenggotnya dari bagian samping dan bagian yang panjang.\" Abu Isa berkata; Hadits ini gharib, dan aku mendengar Muhammad bin Isma'il berkata; Umar bin Harun muqaribul hadits, aku tidak mengetahui dia memiliki hadits yang tidak ada asalnya, atau dia mengatakan; \"Haditsnya munfarid (diriwayatkan sendirian) kecuali hadits ini, \"Bahwa Nabi shallallahu 'alaihi wasallam mengambil jenggotnya dari bagian samping dan bagian yang panjang, \" kami tidak mengetahuinya kecuali dari hadits Umar bin Harun dan menurutku pendapatnya tentang Umar baik. Abu Isa berkata; Aku mendengar Qutaibah berkata; Umar bin Harun adalah orang yang memiliki hadits, dan dia yang mengatakan: \"Iman itu ucapan dan perbuatan.\" Qutaibah berkata; telah menceritakan kepada kami Waqi' bin Al Jarrah dari seseorang dari Tsaur bin Yazid bahwa Nabi shallallahu 'alaihi wasallam menyerang penduduk Tha`if dengan manjanik (senjata kuno sejenis pelontar batu, pent.). Qutaibah berkata; Aku bertanya kepada Waqi'; \"Siapa dia?\" dia menjawab; \"Sahabat kalian, Umar bin Harun.\""
            },
            {
                "number": 2620,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْفُوا الشَّوَارِبَ وَأَعْفُوا اللِّحَىقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khiallal] telah menceritakan kepada kami [Abdullah bin Numair] dari [ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Cukurlah kumis dan biarkan jenggot.\" Abu Isa berkata; Hadits ini shahih."
            },
            {
                "number": 2621,
                "arab": "حَدَّثَنَا الْأَنْصَارِيُّ حَدَّثَنَا مَعْنٌ حَدَّثَنَا مَالِكٌ عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَنَا بِإِحْفَاءِ الشَّوَارِبِ وَإِعْفَاءِ اللِّحَىقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَبُو بَكْرِ بْنُ نَافِعٍ هُوَ مَوْلَى ابْنِ عُمَرَ ثِقَةٌ وَعُمَرُ بْنُ نَافِعٍ ثِقَةٌ وَعَبْدُ اللَّهِ بْنُ نَافِعٍ مَوْلَى ابْنِ عُمَرَ يُضَعَّفُ",
                "id": "Telah menceritakan kepada kami [Al Anshari] telah menceritakan kepada kami [Ma'nu] telah menceritakan kepada kami [Malik] dari [Abu Bakar bin Nafi'] dari [Ayahnya] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan kami untuk mencukur kumis dan membiarkan jenggot.\" Abu Isa berkata; Hadits ini hasan shahih. Abu Bakar bin Nafi' yaitu bekas budak Ibnu Umar adalah perawi tsiqah, sedangkan Umar bin Nafi' perawi tsiqah, sementara Abdullah bin Nafi' budak Ibnu Umar, dilemahkan."
            },
            {
                "number": 2622,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَمِّهِأَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسْتَلْقِيًا فِي الْمَسْجِدِ وَاضِعًا إِحْدَى رِجْلَيْهِ عَلَى الْأُخْرَىقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَعَمُّ عَبَّادِ بْنِ تَمِيمٍ هُوَ عَبْدُ اللَّهِ بْنُ زَيْدِ بْنِ عَاصِمٍ الْمَازِنِيُّ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Abdurrahman Al Makhzumi] dan yang lain, mereka berkata; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['Abbad bin Tamim] dari [Pamannya] bahwa ia melihat Nabi shallallahu 'alaihi wasallam terlentang di masjid sambil meletakkan salah satu kaki di atas sebelah kaki yang lain.\" Abu Isa berkata; Hadits ini hasan shahih. Paman 'Abbad bin Tamim adalah Abdullah bin Zaid bin 'Ashim Al Mazini."
            },
            {
                "number": 2623,
                "arab": "حَدَّثَنَا عُبَيْدُ بْنُ أَسْبَاطِ بْنِ مُحَمَّدٍ الْقُرَشِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ عَنْ خِدَاشٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَلْقَى أَحَدُكُمْ عَلَى ظَهْرِهِ فَلَا يَضَعْ إِحْدَى رِجْلَيْهِ عَلَى الْأُخْرَىهَذَا حَدِيثٌ رَوَاهُ غَيْرُ وَاحِدٍ عَنْ سُلَيْمَانَ التَّيْمِيِّ وَلَا يُعْرَفُ خِدَاشٌ هَذَا مَنْ هُوَ وَقَدْ رَوَى لَهُ سُلَيْمَانُ التَّيْمِيُّ غَيْرَ حَدِيثٍ",
                "id": "Telah menceritakan kepada kami ['Ubaid bin Asbath bin Muhammad Al Qurasyi] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Sulaiman At Taimi] dari [Khidasy] dari [Abu Az Zubair] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian berbaring di atas punggungnya, janganlah meletakkan salah satu kakinya di atas yang lain.\" Hadits ini diriwayatkan oleh orang banyak dari Sulaiman At Taimi, dan tidak di ketahui siapa sebenarnya Khidasy, sementara Sulaiman meriwayatkan darinya bukan cuma satu hadits."
            },
            {
                "number": 2624,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ اشْتِمَالِ الصَّمَّاءِ وَالِاحْتِبَاءِ فِي ثَوْبٍ وَاحِدٍ وَأَنْ يَرْفَعَ الرَّجُلُ إِحْدَى رِجْلَيْهِ عَلَى الْأُخْرَى وَهُوَ مُسْتَلْقٍ عَلَى ظَهْرِهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Abu Az Zubair] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam melarang isytimalus shama` dan duduk ihtiba' dengan mengenakan sehelai kain, dan terlentang diatas punggungnya dengan mengangkat sebelah kaki di atas kaki yang lain.\" Abu Isa berkata; Hadits ini hasan shahih. "
            },
            {
                "number": 2625,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ وَعَبْدُ الرَّحِيمِ عَنْ مُحَمَّدِ بْنِ عَمْرٍو حَدَّثَنَا أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَرَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا مُضْطَجِعًا عَلَى بَطْنِهِ فَقَالَ إِنَّ هَذِهِ ضَجْعَةٌ لَا يُحِبُّهَا اللَّهُوَفِي الْبَاب عَنْ طِهْفَةَ وَابْنِ عُمَرَ قَالَ أَبُو عِيسَى وَرَوَى يَحْيَى بْنُ أَبِي كَثِيرٍ هَذَا الْحَدِيثَ عَنْ أَبِي سَلَمَةَ عَنْ يَعِيشَ بْنِ طِهْفَةَ عَنْ أَبِيهِ وَيُقَالُ طِخْفَةُ وَالصَّحِيحُ طِهْفَةُ وَقَالَ بَعْضُ الْحُفَّاظِ الصَّحِيحُ طِخْفَةُ وَيُقَالُ طِغْفَةُ يَعِيشُ هُوَ مِنْ الصَّحَابَةِ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami ['Abdah bin Sulaiman] dan [Abdurrahim] dari [Muhammad bin 'Amru] telah menceritakan kepada kami [Abu Salamah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah melihat seseorang tengkurap, lalu beliau bersabda: \"Sesungguhnya tengkurap tidak disukai Allah.\" Dalam hal ini ada hadits serupa dari Thihfah dan Ibnu Umar. Abu Isa berkata; [Yahya bin Abu Katsir] meriwayatkan hadits ini dari [Abu Salamah] dari [Ya'isy bin Thihfah] dari [Ayahnya], dikatakan juga Thikfah, namun yang benar adalah Thihfah. Sebagaian hafidz mengatakan bahwa yang benar adalah Thikhfah. Ada juga yang menyebut Thighfah Ya'isy, ia adalah salah seorang sahabat."
            },
            {
                "number": 2626,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ حَدَّثَنِي أَبِي عَنْ جَدِّي قَالَقُلْتُ يَا رَسُولَ اللَّهِ عَوْرَاتُنَا مَا نَأْتِي مِنْهَا وَمَا نَذَرُ قَالَ احْفَظْ عَوْرَتَكَ إِلَّا مِنْ زَوْجَتِكَ أَوْ مَا مَلَكَتْ يَمِينُكَ فَقَالَ الرَّجُلُ يَكُونُ مَعَ الرَّجُلِ قَالَ إِنْ اسْتَطَعْتَ أَنْ لَا يَرَاهَا أَحَدٌ فَافْعَلْ قُلْتُ وَالرَّجُلُ يَكُونُ خَالِيًا قَالَ فَاللَّهُ أَحَقُّ أَنْ يُسْتَحْيَا مِنْهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَجَدُّ بَهْزٍ اسْمُهُ مُعَاوِيَةُ بْنُ حَيْدَةَ الْقُشَيْرِيُّ وَقَدْ رَوَى الْجُرَيْرِيُّ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ وَهُوَ وَالِدُ بَهْزٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Bahz bin Hakim] telah menceritakan kepada kami [Ayahku] dari [kakekku] ia berkata; Aku bertanya; \"Wahai Rasulullah, aurat mana sajakah yang yang harus kami tutup dan yang kami biarkan (terbuka)? beliau menjawab: \"Jagalah auratmu kecuali kepada istrimu atau budak yang kamu miliki, \" dia bertanya lagi; \"Jika sesama lelaki?\" beliau menjawab: \"Jika kamu mampu supaya tidak terlihat oleh seorangpun, maka lakukanlah.\" Aku bertanya; \"Jika seseorang sendirian?\" beliau menjawab: \"Allah lebih patut dimalui.\" Abu Isa berkata; Hadits ini hasan, kakeknya Bahz namanya Mu'awiyah bin Haidah Al Qusyairi, dan Jurairi meriwayatkan dari Hakim bin Mu'awiyah, dia adalah ayahnya Bahz."
            },
            {
                "number": 2627,
                "arab": "حَدَّثَنَا عَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ الْبَغْدَادِيُّ حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ الْكُوفِيُّ أَخْبَرَنَا إِسْرَائِيلُ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَّكِئًا عَلَى وِسَادَةٍ عَلَى يَسَارِهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَرَوَى غَيْرُ وَاحِدٍ هَذَا الْحَدِيثَ عَنْ إِسْرَائِيلَ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَّكِئًا عَلَى وِسَادَةٍ وَلَمْ يَذْكُرْ عَلَى يَسَارِهِ",
                "id": "Telah menceritakan kepada kami [Abbas bin Muhammad Ad Duri Al Baghdadi] telah menceritakan kepada kami [Ishaq bin Manshur Al Kufi] telah mengabarkan kepada kami [Isra`il] dari [Simak bin Harb] dari [Jabir bin Samurah] ia berkata; \"Aku melihat Rasulullah shallallahu 'alaihi wasallam bersandarkan bantal ke sebelah kiri beliau.\" Abu Isa berkata; Hadits ini hasan gharib, banyak perawi meriwayatkan hadits ini dari Isra`il dari Simak dari Jabir bin Samurah, dia berkata; \"Aku pernah melihat Nabi shallallahu 'alaihi wasallam bersandarkan bantal.\" Namun dia tidak menyebutkan; \"Ke sebelah kiri beliau.\""
            },
            {
                "number": 2628,
                "arab": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَّكِئًا عَلَى وِسَادَةٍهَذَا حَدِيثٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Yusuf bin Isa] telah menceritakan kepada kami [Waki'] dari [Isra`il] dari [Simak bin Harb] dari [Jabir bin Samurah] ia berkata; \"Aku pernah melihat Nabi shallallahu 'alaihi wasallam bersandarkan bantal.\" Hadits ini shahih."
            },
            {
                "number": 2629,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِسْمَعِيلَ بْنِ رَجَاءٍ عَنْ أَوْسِ بْنِ ضَمْعَجٍ عَنْ أَبِي مَسْعُودٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُؤَمُّ الرَّجُلُ فِي سُلْطَانِهِ وَلَا يُجْلَسُ عَلَى تَكْرِمَتِهِ فِي بَيْتِهِ إِلَّا بِإِذْنِهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Isma'il bin Raja`] dari [Aus bin Dlam'aj] dari [Abu Mas'ud] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah seseorang menjadi imam di daerah kekuasaan (orang lain) dan jangan duduk di tempat terhormat di rumah (orang lain) kecuali atas izin darinya.\" Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2630,
                "arab": "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ حَدَّثَنِي أَبِي حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ قَال سَمِعْتُ أَبِي بُرَيْدَةَ يَقُولُبَيْنَمَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْشِي إِذْ جَاءَهُ رَجُلٌ وَمَعَهُ حِمَارٌ فَقَالَ يَا رَسُولَ اللَّهِ ارْكَبْ وَتَأَخَّرَ الرَّجُلُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَنْتَ أَحَقُّ بِصَدْرِ دَابَّتِكَ إِلَّا أَنْ تَجْعَلَهُ لِي قَالَ قَدْ جَعَلْتُهُ لَكَ قَالَ فَرَكِبَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَفِي الْبَاب عَنْ قَيْسِ بْنِ سَعْدِ بْنِ عُبَادَةَ",
                "id": "Telah menceritakan kepada kami [Abu 'Ammar Al Husain bin Huraits] telah menceritakan kepada kami [Ali bin Al Husain bin Waqid] telah menceritakan kepada kami [Ayahku] telah menceritakan kepadaku [Abdullah bin Buraidah] ia berkata; Aku mendengar [Abu Buraidah] berkata; \"Ketika Nabi shallallahu 'alaihi wasallam sedang berjalan, datanglah seseorang dengan membawa keledai sambil berkata; \"Wahai Rasulullah, naiklah!.\" Orang itu bergeser, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kamu lebih berhak untuk menempati tempat kendaraanmu kecuali jika kamu persilahkan untukku.\" orang itu berkata; Aku telah mempersilahkan untuk anda.\" Abu Buraidah berkata; \"Rasulullah lalu mengendarainya.\" Abu Isa berkata; Hadits ini hasan gharib dari jalur ini, dan dalam bab ini, ada juga hadits dari Qais bin Sa'd bin 'Ubadah."
            },
            {
                "number": 2631,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ لَكُمْ أَنْمَاطٌ قُلْتُ وَأَنَّى تَكُونُ لَنَا أَنْمَاطٌ قَالَ أَمَا إِنَّهَا سَتَكُونُ لَكُمْ أَنْمَاطٌ قَالَ فَأَنَا أَقُولُ لِامْرَأَتِي أَخِّرِي عَنِّي أَنْمَاطَكِ فَتَقُولُ أَلَمْ يَقُلْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهَا سَتَكُونُ لَكُمْ أَنْمَاطٌ قَالَ فَأَدَعُهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan] dari [Muhammad bin Al Munkadir] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah kalian memiliki permadani?\" Aku katakan; \"Dari mana kami dapatkan permadani?\". Beliau bersabda: \"Sungguh suatu saat nanti kalian akan memiliki permadani\". Jabir berkata; Kemudian aku katakan istriku; \"Berikan kepadaku permadanimu.\" Istrinya berkata; \"Bukankah Nabi Shallallahu 'alaihi wa salam telah bersabda bahwa suatu hari nanti kalian akan memiliki permadani?\". Lalu aku membiarkannya. Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2632,
                "arab": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ هُوَ الْجُرَشِيُّ الْيَمَامِيُّ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ عَنْ إِيَاسِ بْنِ سَلَمَةَ عَنْ أَبِيهِ قَالَلَقَدْ قُدْتُ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْحَسَنَ وَالْحُسَيْنَ عَلَى بَغْلَتِهِ الشَّهْبَاءِ حَتَّى أَدْخَلْتُهُ حُجْرَةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا قُدَّامُهُ وَهَذَا خَلْفُهُوَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ وَعَبْدِ اللَّهِ بْنِ جَعْفَرٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ",
                "id": "Telah menceritakan kepada kami ['Abbas Al Anbari] telah menceritakan kepada kami [An Nadlr bin Muhammad yaitu Al Jurasyi Al Yamami] telah menceritakan kepada kami [Ikrimah bin 'Ammar] dari [Iyas bin Salamah] dari [Ayahnya] ia berkata; Aku pernah menuntun (kendaraan) Nabi Allah shallallahu 'alaihi wasallam, sementara Al Hasan dan Al Husain berada di atas keledai yang warna putihnya lebih banyak dari warna hitam, hingga aku membawanya masuk ke dalam kamar Nabi shallallahu 'alaihi wasallam, yang ini di depan beliau dan yang satunya lagi di belakang beliau.\" Dan dalam bab ini, ada juga hadits dari Ibnu Abbas dan Abdullah bin Ja'far, Abu Isa berkata; Hadits ini hasan shahih gharib dari jalur ini."
            },
            {
                "number": 2633,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يُونُسُ بْنُ عُبَيْدٍ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَظْرَةِ الْفُجَاءَةِ فَأَمَرَنِي أَنْ أَصْرِفَ بَصَرِيقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَبُو زُرْعَةَ بْنُ عَمْرٍو اسْمُهُ هَرِمٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Yunus bin 'Ubaid] dari ['Amru bin Sa'id] dari [Abu Zur'ah bin 'Amru bin Jarir] dari [Jarir bin Abdullah] ia berkata; Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang pandangan sepintas, lalu beliau memerintahkanku untuk mengalihkan pandanganku.\" Abu Isa berkata; Hadits ini hasan shahih. Abu Zur'ah bin Amru namanya adalah Harim."
            },
            {
                "number": 2634,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا شَرِيكٌ عَنْ أَبِي رَبِيعَةَ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِرَفَعَهُ قَالَ يَا عَلِيُّ لَا تُتْبِعْ النَّظْرَةَ النَّظْرَةَ فَإِنَّ لَكَ الْأُولَى وَلَيْسَتْ لَكَ الْآخِرَةُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ شَرِيكٍ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr] telah mengabarkan kepada kami [Syarik] dari [Abu Rabi'ah] dari [Ibnu Buraidah] dari [Ayahnya] ia memarfu'kan (menyambungkan sampai Nabi shallallahu 'alaihi wasallam), sabdanya; \"Wahai Ali, janganlah kamu ikuti pandangan yang pertama dengan pandangan berikutnya, karena yang pertama untukmu dan yang kedua bukan lagi untukmu.\" Abu Isa berkata; Hadits ini hasan gharib, kami tidak mengetahuinya kecuali dari hadits Syarik."
            },
            {
                "number": 2635,
                "arab": "حَدَّثَنَا سُوَيْدٌ حَدَّثَنَا عَبْدُ اللَّهِ أَخْبَرَنَا يُونُسُ بْنُ يَزِيدَ عَنْ ابْنِ شِهَابٍ عَنْ نَبْهَانَ مَوْلَى أُمِّ سَلَمَةَ أَنَّهُ حَدَّثَهُ أَنَّ أُمَّ سَلَمَةَ حَدَّثَتْهُأَنَّهَا كَانَتْ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَيْمُونَةَ قَالَتْ فَبَيْنَا نَحْنُ عِنْدَهُ أَقْبَلَ ابْنُ أُمِّ مَكْتُومٍ فَدَخَلَ عَلَيْهِ وَذَلِكَ بَعْدَ مَا أُمِرْنَا بِالْحِجَابِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجِبَا مِنْهُ فَقُلْتُ يَا رَسُولَ اللَّهِ أَلَيْسَ هُوَ أَعْمَى لَا يُبْصِرُنَا وَلَا يَعْرِفُنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفَعَمْيَاوَانِ أَنْتُمَا أَلَسْتُمَا تُبْصِرَانِهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Suwaid] telah menceritakan kepada kami [Abdullah] telah mengabarkan kepada kami [Yunus bin Yazid] dari [Ibnu Syihab] dari [Nabhan] bekas budak Ummu Salamah, bahwa ia telah menceritakan kepadanya, bahwa ia pernah berada di sisi Rasulullah shallallahu 'alaihi wasallam dan Maimunah, [Ummu Salamah] berkata; Ketika kami berada di sisi beliau, Ibnu Ummi Maktum dating dan menghadap kepada beliau, yaitu setelah kami diperintahkan untuk berhijab, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berhijablah kalian berdua darinya, \" maka aku bertanya; \"Wahai Rasulullah, bukankah dia buta, dia tidak dapat melihat dan tidak mengetahui kami?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Apakah kamu berdua buta?\" Bukankah kamu berdua dapat melihatnya?.\" Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2636,
                "arab": "حَدَّثَنَا سُوَيْدٌ حَدَّثَنَا عَبْدُ اللَّهِ أَخْبَرَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ ذَكْوَانَ عَنْ مَوْلَى عَمْرِو بْنِ الْعَاصِأَنَّ عَمْرَو بْنَ الْعَاصِ أَرْسَلَهُ إِلَى عَلِيٍّ يَسْتَأْذِنُهُ عَلَى أَسْمَاءَ بِنْتِ عُمَيْسٍ فَأُذِنَ لَهُ حَتَّى إِذَا فَرَغَ مِنْ حَاجَتِهِ سَأَلَ الْمَوْلَى عَمْرَو بْنَ الْعَاصِ عَنْ ذَلِكَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَانَا أَوْ نَهَى أَنْ نَدْخُلَ عَلَى النِّسَاءِ بِغَيْرِ إِذْنِ أَزْوَاجِهِنَّوَفِي الْبَاب عَنْ عُقْبَةَ بْنِ عَامِرٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَجَابِرٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Suwaid] telah menceritakan kepada kami [Abdullah] telah mengabarkan kepada kami [Syu'bah] dari [Al Hakam] dari [Dzakwan] dari [Bekas budak 'Amru bin Al Ash] bahwa ['Amru bin Al Ash] pernah mengutusnya menemui Ali untuk meminta izin menemui Asma` binti Umais, lalu ia memberi izin, setelah menunaikan keperluannya, budak itu bertanya kepada 'Amru bin Al Ash tentang masalah itu, 'Amru menjawab; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam melarang kami atau melarang kami memasuki kediaman wanita-wanita tanpa izin suami-suami mereka.\" Dalam hal ini ada hadits serupa dari 'Uqbah bin 'Amir, Abdullah bin 'Amru dan Jabir. Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2637,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ عَنْ أَبِيهِ عَنْ أَبِي عُثْمَانَ عَنْ أُسَامَةَ بْنِ زَيْدٍ وَسَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا تَرَكْتُ بَعْدِي فِي النَّاسِ فِتْنَةً أَضَرَّ عَلَى الرِّجَالِ مِنْ النِّسَاءِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَى هَذَا الْحَدِيثَ غَيْرُ وَاحِدٍ مِنْ الثِّقَاتِ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي عُثْمَانَ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَذْكُرُوا فِيهِ عَنْ سَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ وَلَا نَعْلَمُ أَحَدًا قَالَ عَنْ أُسَامَةَ بْنِ زَيْدٍ وَسَعِيدُ بْنُ زَيْدٍ غَيْرُ الْمُعْتَمِرِ وَفِي الْبَاب عَنْ أَبِي سَعِيدٍ حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي عُثْمَانَ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul A'la Ash Shan'ani] telah menceritakan kepada kami [Al Mu'tamir bin Sulaiman] dari [Ayahnya] dari [Abu Utsman] dari [Usamah bin Zaid] dari [Sa'id bin Zaid bin 'Amru bin Nufail] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Tidaklah aku tinggalkan sepeninggalku fitnah yang lebih membahayakan bagi kaum lelaki melebihi wanita.\" Abu Isa berkata; Hadits ini hasan shahih. Hadits ini diriwayatkan oleh beberapa orang dari perawi-perawi tsiqah dari Sulaiman At Taimi dari Abu Utsman dari Usamah bin Zaid dari nabi shallallahu 'alaihi wasallam, mereka tidak menyebutkan; dari Sa'id bin Zaid bin 'Amru bin Nufail. Dan kami tidak mengetahui seorangpun berkata; Dari Usamah bin Zaid dan Sa'id bin Zaid selain Al Mu'tamir. Dalam hal ini, ada hadits serupa dari Abu Sa'id. Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Sulaiman At Taimi] dari [Abu Utsman] dari [Usamah bin Zaid] dari Nabi shallallahu 'alaihi wasallam seperti hadits diatas."
            },
            {
                "number": 2638,
                "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا يُونُسُ عَنْ الزُّهْرِيِّ أَخْبَرَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ أَنَّهُ سَمِعَ مُعَاوِيَةَ بِالْمَدِينَةِ يَخْطُبُ يَقُولُأَيْنَ عُلَمَاؤُكُمْ يَا أَهْلَ الْمَدِينَةِ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ هَذِهِ الْقُصَّةِ وَيَقُولُ إِنَّمَا هَلَكَتْ بَنُو إِسْرَائِيلَ حِينَ اتَّخَذَهَا نِسَاؤُهُمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ مُعَاوِيَةَ",
                "id": "Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Yunus] dari [Az Zuhri] telah mengabarkan kepada kami [Humaid bin Abdurrahman] ia mendengar [Mu'awiyah] berkhutbah di Madinah, ia berkata; \"Manakah para ulama kalian, wahai penduduk Madinah? Sesungguhnya aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam melarang menyambung rambut, beliau bersabda: \"Sesungguhnya Bani Isra`il binasa karena wanita-wanita mereka melakukan hal itu.\" Abu Isa berkata; Hadits ini hasan sahih dan hadits ini diriwayatkan melalui beberapa sanad dari Mu'awiyah."
            },
            {
                "number": 2639,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ الْوَاشِمَاتِ وَالْمُسْتَوْشِمَاتِ وَالْمُتَنَمِّصَاتِ مُبْتَغِيَاتٍ لِلْحُسْنِ مُغَيِّرَاتٍ خَلْقَ اللَّهِقَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَاهُ شُعْبَةُ وَغَيْرُ وَاحِدٍ مِنْ الْأَئِمَّةِ عَنْ مَنْصُورٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami ['Ubaidah bin Humaid] dari [Manshur] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] bahwa Nabi shallallahu 'alaihi wasallam melaknat wanita-wanita yang mentato dan yang meminta ditato, wanita-wanita yang mencukur alis demi mencari keindahan dan merubah ciptaan Allah.\" Abu Isa berkata; Hadits ini hasan shahih. [Syu'bah] dan lainnya meriwayatkannya dari para imam dari [Manshur]."
            },
            {
                "number": 2640,
                "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَعَنَ اللَّهُ الْوَاصِلَةَ وَالْمُسْتَوْصِلَةَ وَالْوَاشِمَةَ وَالْمُسْتَوْشِمَةَقَالَ نَافِعٌ الْوَشْمُ فِي اللِّثَةِ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ عَائِشَةَ وَمَعْقِلِ بْنِ يَسَارٍ وَأَسْمَاءَ بِنْتِ أَبِي بَكْرٍ وَابْنِ عَبَّاسٍ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ وَلَمْ يَذْكُرْ فِيهِ يَحْيَى قَوْلَ نَافِعٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah bin Al Mubarak] dari ['ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Allah melaknat wanita yang menyambung rambut dan yang meminta disambung rambutnya, wanita yang mentato dan yang meminta ditato.\" Nafi' bekata: \"Tato di gusi.\" Abu Isa berkata; Hadits ini hasan shahih. Dalam hal ini, ada hadits serupa dari 'Aisyah, Ma'qil bin Yasar, Asma` binti Abu Bakar dan Ibnu Abbas. Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami ['ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas, dalam hadits tersebut Yahya tidak menyebutkan perkataan Nafi'. Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2641,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ وَهَمَّامٌ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَلَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُتَشَبِّهَاتِ بِالرِّجَالِ مِنْ النِّسَاءِ وَالْمُتَشَبِّهِينَ بِالنِّسَاءِ مِنْ الرِّجَالِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Dawud Ath Thayalisi] telah menceritakan kepada kami [Syu'bah] dan [Hammam] dari [Qatadah] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam melaknat wanita-wanita yang menyerupai lelaki dan lelaki-lelaki yang menyerupai wanita.\" Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2642,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ وَأَيُّوبُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَلَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُخَنَّثِينَ مِنْ الرِّجَالِ وَالْمُتَرَجِّلَاتِ مِنْ النِّسَاءِقَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ عَائِشَةَ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] telah menceritakan kepada kami [Abdurrazzaq] telah menceritakan kepada kami [Ma'mar] dari [Yahya bin Abu Katsir] dan [Ayyub] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam melaknat laki-laki yang menyerupai wanita dan wanita yang menyerupai laki-laki.\" Abu Isa berkata; Hadits ini hasan shahih, dan dalam bab ini, ada juga hadits dari 'Aisyah."
            },
            {
                "number": 2643,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ عَنْ ثَابِتِ بْنِ عُمَارَةَ الْحَنَفِيِّ عَنْ غُنَيْمِ بْنِ قَيْسٍ عَنْ أَبِي مُوسَىعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ عَيْنٍ زَانِيَةٌ وَالْمَرْأَةُ إِذَا اسْتَعْطَرَتْ فَمَرَّتْ بِالْمَجْلِسِ فَهِيَ كَذَا وَكَذَا يَعْنِي زَانِيَةًوَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Yahya bin Sa'id Al Qattan] dari [Tsabit bin 'Umarah Al Hanafi] dari [Ghunaim bin Qais] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Setiap mata memiliki bagian dari zina, dan wanita yang memakai wewangian kemudian lewat di perkumpulan (lelaki) berarti dia begini dan begini.\" Maksud beliau berbuat zina. Dan dalam bab ini ada juga hadits dari Abu Hurairah, Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2644,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ عَنْ سُفْيَانَ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ عَنْ رَجُلٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طِيبُ الرِّجَالِ مَا ظَهَرَ رِيحُهُ وَخَفِيَ لَوْنُهُ وَطِيبُ النِّسَاءِ مَا ظَهَرَ لَوْنُهُ وَخَفِيَ رِيحُهُحَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ عَنْ الطُّفَاوِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ بِمَعْنَاهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ إِلَّا أَنَّ الطُّفَاوِيَّ لَا نَعْرِفُهُ إِلَّا فِي هَذَا الْحَدِيثِ وَلَا نَعْرِفُ اسْمَهُ وَحَدِيثُ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ أَتَمُّ وَأَطْوَلُ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Daud Al Hafari] dari [Sufyan] dari [Al Jurairi] dari [Abu Nadlrah] dari [seseorang] dari [Abu Hurairah] ia berkata; bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Minyak wanginya lelaki baunya menyengat dan warnyanya tidak kelihatan, sedangkan minyak wangi wanita adalah yang warnanya kelihatan dan baunya tidak tercium.\" Telah menceritakan kepada kami [Ali bin Hujr] telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Al Jurairi] dari [Abu Nadlrah] dari [Ath Thafawi] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam dengan hadits dan maksud yang sama. Abu Isa berkata; Hadits ini hasan, namun Ath Thafawi tidak kami ketahui kecuali dalam hadits ini, namanya pun tidak kami ketahui, sedangkan hadits Isma'il bin Ibrahim lebih lengkap dan lebih panjang.\""
            },
            {
                "number": 2645,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَقَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ خَيْرَ طِيبِ الرَّجُلِ مَا ظَهَرَ رِيحُهُ وَخَفِيَ لَوْنُهُ وَخَيْرَ طِيبِ النِّسَاءِ مَا ظَهَرَ لَوْنُهُ وَخَفِيَ رِيحُهُ وَنَهَى عَنْ مِيثَرَةِ الْأُرْجُوَانِهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu Bakar Al Hanafi] dari [Sa'id] dari [Qatadah] dari [Al Hasan] dari ['Imran bin Hushain] ia berkata; Nabi shallallahu 'alaihi wasallam bersabda kepadaku: \"Sesungguhnya wewangian lelaki yang terbaik adalah baunya semerbak namun warnanya tidak terlihat, sedangkan wewangian wanita yang terbaik adalah yang nampak warnanya namun baunya tidak tercium.\" Dan Beliau melarang celupan (wantek) yang warnanya sangat merah. Hadits ini hasan gharib melalui sanad ini."
            },
            {
                "number": 2646,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ عَنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ قَالَكَانَ أَنَسٌ لَا يَرُدُّ الطِّيبَ وَقَالَ أَنَسٌ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَرُدُّ الطِّيبَوَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami ['Azrah bin Tsabit] dari [Tsumamah bin Abdullah] ia berkata; \"Anas tidak pernah menolak pemberian minyak wangi, [Anas] berkata; \"Sesungguhnya Nabi shallallahu 'alaihi wasallam tidak pernah menolak pemberian minyak wangi.\" Dan dalam bab ini, ada juga hadits dari Abu Hurairah. Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2647,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ عَبْدِ اللَّهِ بْنِ مُسْلِمٍ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثٌ لَا تُرَدُّ الْوَسَائِدُ وَالدُّهْنُ وَاللَّبَنُ الدُّهْنُ يَعْنِي بِهِ الطِّيبَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَعَبْدُ اللَّهِ هُوَ ابْنُ مُسْلِمِ بْنِ جُنْدُبٍ وَهُوَ مَدَنِيٌّ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Ibnu Abu Fudaik] dari [Abdullah bin Muslim] dari [Ayahnya] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tiga hal yang tidak layak untuk ditolak, yaitu; (pemberian) bantal, minyak dan susu, minyak yaitu yang ada wewangiannya.\" Abu Isa berkata; Hadits ini gharib, Abdullah adalah Ibnu Muslim bin Jundub, seseorang penduduk Madinah."
            },
            {
                "number": 2648,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ خَلِيفَةَ أَبُو عَبْدِ اللَّهِ بَصْرِيٌّ وَعَمْرُو بْنُ عَلِيٍّ قَالَا حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ حَجَّاجٍ الصَّوَّافِ عَنْ حَنَانٍ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُعْطِيَ أَحَدُكُمْ الرَّيْحَانَ فَلَا يَرُدَّهُ فَإِنَّهُ خَرَجَ مِنْ الْجَنَّةِقَالَ هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَلَا نَعْرِفُ حَنَانًا إِلَّا فِي هَذَا الْحَدِيثِ وَأَبُو عُثْمَانَ النَّهْدِيُّ اسْمُهُ عَبْدُ الرَّحْمَنِ بْنُ مُلٍّ وَقَدْ أَدْرَكَ زَمَنَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَرَهُ وَلَمْ يَسْمَعْ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Khalifah Abu Abdillah Bashri] dan ['Amru bin Ali] keduanya berkata; telah menceritakan kepada kami [Yazid bin Zurai'] dari [Hajjaj Ash Shawwaf] dari [Hanan] dari [Abu Utsman An Nahdi] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian diberi bunga Raihan, janganlah menolaknya, karena dia berasal dari surga.\" Perawi berkata; Hadits ini gharib, kami tidak mengetahuinya kecuali dari jalur ini, dan kami tidak mengetahui Hanan kecuali dalam hadits ini, adapun nama Abu Utsman An Nahdi adalah Abdurrahman bin Mull, dan dia semasa dengan Nabi shallallahu 'alaihi wasallam namun tidak pernah melihat beliau dan tidak mendengar hadits dari beliau."
            },
            {
                "number": 2649,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ شَقِيقِ بْنِ سَلَمَةَ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُبَاشِرُ الْمَرْأَةُ الْمَرْأَةَ حَتَّى تَصِفَهَا لِزَوْجِهَا كَأَنَّمَا يَنْظُرُ إِلَيْهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Muawiyah] dari [Al A'masy] dari [Syaqiq bin Salamah] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah seorang isteri menceritakan cirri-ciri wanita lain pada suaminya sehingga suaminya seolah-olah melihatnya.\" Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2650,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي زِيَادٍ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ أَخْبَرَنِي الضَّحَّاكُ بْنُ عُثْمَانَ أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَنْظُرُ الرَّجُلُ إِلَى عَوْرَةِ الرَّجُلِ وَلَا تَنْظُرُ الْمَرْأَةُ إِلَى عَوْرَةِ الْمَرْأَةِ وَلَا يُفْضِي الرَّجُلُ إِلَى الرَّجُلِ فِي الثَّوْبِ الْوَاحِدِ وَلَا تُفْضِي الْمَرْأَةُ إِلَى الْمَرْأَةِ فِي الثَّوْبِ الْوَاحِدِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Abu Ziyad] telah menceritakan kepada kami [Zaid bin Hubab] telah menceritakan kepada kami [Adl Dlahhak bin Utsman] telah mengabarkan kepadaku [Zaid bin Aslam] dari [Abdurrahman bin Abu Sa'id Al Khudri] dari [Ayahnya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah seorang laki-laki melihat aurat laki-laki lain dan janganlah seorang wanita melihat aurat wanita lain, janganlah seorang laki-laki satu selimut dengan laki-laki lainnya dan juga janganlah seorang wanita satu selimut dengan wanita lainnya.\" Abu Isa berkata; Hadits ini hasan gharib shahih."
            },
            {
                "number": 2651,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ وَيَزِيدُ بْنُ هَارُونَ قَالَا حَدَّثَنَا بَهْزُ بْنُ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقُلْتُ يَا نَبِيَّ اللَّهِ عَوْرَاتُنَا مَا نَأْتِي مِنْهَا وَمَا نَذَرُ قَالَ احْفَظْ عَوْرَتَكَ إِلَّا مِنْ زَوْجَتِكَ أَوْ مَا مَلَكَتْ يَمِينُكَ قُلْتُ يَا رَسُولَ اللَّهِ إِذَا كَانَ الْقَوْمُ بَعْضُهُمْ فِي بَعْضٍ قَالَ إِنْ اسْتَطَعْتَ أَنْ لَا يَرَاهَا أَحَدٌ فَلَا يَرَاهَا قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ إِذَا كَانَ أَحَدُنَا خَالِيًا قَالَ فَاللَّهُ أَحَقُّ أَنْ يُسْتَحْيَا مِنْهُ مِنْ النَّاسِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Mu'adz] dan [Yazid bin Harun] keduanya berkata; telah menceritakan kepada kami [Bahz bin Hakim] dari [Ayahnya] dari [kakeknya] ia berkata; Aku berkata; \"Wahai Nabiyullah, manakah aurat kami yang harus kami tutupi dan yang kami biarkan terbuka?\" Beliau menjawab: \"Jagalah auratmu kecuali dari istrimu atau budakmu.\" Aku bertanya: \"Wahai Rasulullah, bila dengan sejenis?\" Beliau menjawab: \"Bila kau mampu agar tidak ada seorang pun yang melihatnya, maka jangan sampai ia melihatnya.\" Aku berkata; \"Wahai nabiyullah, bila salah seorang dari kami sendirian?\" Beliau menjawab: \"Hendaknya ia lebih layak untuk malu kepada Allah daripada kepada manusia.\" Abu Isa berkata; Hadits ini hasan."
            },
            {
                "number": 2652,
                "arab": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي النَّضْرِ مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ زُرْعَةَ بْنِ مُسْلِمِ بْنِ جَرْهَدٍ الْأَسْلَمِيِّ عَنْ جَدِّهِ جَرْهَدٍ قَالَمَرَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجَرْهَدٍ فِي الْمَسْجِدِ وَقَدْ انْكَشَفَ فَخِذُهُ فَقَال إِنَّ الْفَخِذَ عَوْرَةٌقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ مَا أَرَى إِسْنَادَهُ بِمُتَّصِلٍ",
                "id": "Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Abu An Nadlrah] bekas budak Umar bin 'ubaidhullah, dari [Zur'ah bin Muslim bin Jarhad Al Aslami] dari kakeknya yaitu [Jarhad] ia berkata; Nabi shallallahu 'alaihi wasallam melintasi Jarhad di masjid, sedangkan pahanya tersingkap, maka beliau bersabda: \"Sesungguhnya paha itu aurat.\" Abu Isa berkata; Hadits ini hasan, menurutku sanadnya tidak bersambung."
            },
            {
                "number": 2653,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ أَبِي الزِّنَادِ قَالَ أَخْبَرَنِي ابْنُ جَرْهَدٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ وَهُوَ كَاشِفٌ عَنْ فَخِذِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَطِّ فَخِذَكَ فَإِنَّهَا مِنْ الْعَوْرَةِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Abu Az Zinad] ia berkata; telah mengabarkan kepada kami [Ibnu Jarhad] dari [Ayahnya] bahwa Nabi shallallahu 'alaihi wasallam melewatinya ketika itu pahanya tersingkap, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Tutuplah pahamu karena itu termasuk aurat.\" Abu Isa berkata; Hadits ini hasan."
            },
            {
                "number": 2654,
                "arab": "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ الْحَسَنِ بْنِ صَالِحٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ عَبْدِ اللَّهِ بْنِ جَرْهَدٍ الْأَسْلَمِيِّ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْفَخِذُ عَوْرَةٌقَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ",
                "id": "Telah menceritakan kepada kami [Washil bin Abdul A'la] telah menceritakan kepada kami [Yahya bin Adam] dari [Al Hasan bin Shalih] dari [Abdullah bin Muhammad bin 'Uqail] dari [Abdullah bin Jarhad Al Aslami] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabada: \"Paha itu aurat.\" Abu Isa berkata; Hadits ini hasan gharib, melalui sanad ini."
            },
            {
                "number": 2655,
                "arab": "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى الْكُوفِيُّ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ إِسْرَائِيلَ عَنْ أَبِي يَحْيَى عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْفَخِذُ عَوْرَةٌوَفِي الْبَاب عَنْ عَلِيٍّ وَمُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ جَحْشٍ وَلِعَبْدِ اللَّهِ بْنِ جَحْشٍ صُحْبَةٌ وَلِابْنِهِ مُحَمَّدٍ صُحْبَةٌ",
                "id": "Telah menceritakan kepada kami [Washil bin Abdul A'la Al Kufi] telah menceritakan kepada kami [Yahya bin Adam] dari [Isra`il] dari [Abu Yahya] dari [Mujahid] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Paha adalah aurat.\" Dan dalam bab ini, ada juga hadits dari Ali dan Muhammad bin Abdullah bin Jahsy. Abdullah bin Jahsy pernah bertemu Nabi shallallahu 'alaihi wasallam. Anaknya, Muhammad juga pernah bertemu beliau."
            },
            {
                "number": 2656,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ حَدَّثَنَا خَالِدُ بْنُ إِلْيَاسَ عَنْ صَالِحِ بْنِ أَبِي حَسَّانَ قَال سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ يَقُولُإِنَّ اللَّهَ طَيِّبٌ يُحِبُّ الطَّيِّبَ نَظِيفٌ يُحِبُّ النَّظَافَةَ كَرِيمٌ يُحِبُّ الْكَرَمَ جَوَادٌ يُحِبُّ الْجُودَ فَنَظِّفُوا أُرَاهُ قَالَ أَفْنِيَتَكُمْ وَلَا تَشَبَّهُوا بِالْيَهُودِقَالَ فَذَكَرْتُ ذَلِكَ لِمُهَاجِرِ بْنِ مِسْمَارٍ فَقَالَ حَدَّثَنِيهِ عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ إِلَّا أَنَّهُ قَالَ نَظِّفُوا أَفْنِيَتَكُمْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَخَالِدُ بْنُ إِلْيَاسَ يُضَعَّفُ وَيُقَالُ ابْنُ إِيَاسٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu 'Amir Al 'Aqadi] telah menceritakan kepada kami [Khalid bin Ilyas] dari [Shalih bin Abu Hassan] ia berkata; Aku mendengar [Sa'id bin Al Musayyab] berkata; \"Sesungguhnya Allah Maha Baik, dan menyukai kepada yang baik, Maha Bersih dan menyukai kepada yang bersih, Maha Pemurah, dan menyukai kemurahan, dan Maha Mulia dan menyukai kemuliaan, karena itu bersihkanlah diri kalian, \" aku mengiranya dia berkata; \"Halaman kalian, dan janganlah kalian menyerupai orang-orang Yahudi, \" Shalih bin Abu Hassan berkata; Hadits itu aku sampaikan kepada [Muhajir bin Mismar], lalu dia berkata; \" [Amir bin Sa'ad bin Abu Waqqas] telah menceritakannya kepadaku dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam dengan hadits yang semisal, Namun dalam hadits tersebut beliau bersabda: \"Bersihkanlah halaman kalian.\" Abu Isa berkata; Hadits ini gharib, dan Khalid bin Ilyas telah dilemahkan, dan dia juga dinamakan Ibnu Iyas."
            },
            {
                "number": 2657,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ نِيْزَكَ الْبَغْدَادِيُّ حَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا أَبُو مُحَيَّاةَ عَنْ لَيْثٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِيَّاكُمْ وَالتَّعَرِّيَ فَإِنَّ مَعَكُمْ مَنْ لَا يُفَارِقُكُمْ إِلَّا عِنْدَ الْغَائِطِ وَحِينَ يُفْضِي الرَّجُلُ إِلَى أَهْلِهِ فَاسْتَحْيُوهُمْ وَأَكْرِمُوهُمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَأَبُو مُحَيَّاةَ اسْمُهُ يَحْيَى بْنُ يَعْلَى",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Nizak Al Baghdadi] telah menceritakan kepada kami [Al Aswad bin 'Amir] telah menceritakan kepada kami [Abu Muhayyah] dari [Laits] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian telanjang (tanpa busana), karena kalian selalu bersama golongan (Malaikat) yang tidak berpisah dengan kalian, kecuali ketika buang air besar dan ketika seorang lelaki bersetubuh dengan istrinya, karena itu, malulah kepada mereka dan muliakanlah mereka.\" Abu Isa berkata; Hadits ini gharib, kami tidak mengetahuinya kecuali dari jalur ini, sedangkan Abu Muhayyah namanya adalah Yahya bin Ya'la.\""
            },
            {
                "number": 2658,
                "arab": "حَدَّثَنَا الْقَاسِمُ بْنُ دِينَارٍ الْكُوفِيُّ حَدَّثَنَا مُصْعَبُ بْنُ الْمِقْدَامِ عَنْ الْحَسَنِ بْنِ صَالِحٍ عَنْ لَيْثِ بْنِ أَبِي سُلَيْمٍ عَنْ طَاوُسٍ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَدْخُلْ الْحَمَّامَ بِغَيْرِ إِزَارٍ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يُدْخِلْ حَلِيلَتَهُ الْحَمَّامَ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَجْلِسْ عَلَى مَائِدَةٍ يُدَارُ عَلَيْهَا بِالْخَمْرِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ مِنْ حَدِيثِ طَاوُوسٍ عَنْ جَابِرٍ إِلَّا مِنْ هَذَا الْوَجْهِ قَالَ مُحَمَّدُ بْنُ إِسْمَعِيلَ لَيْثُ بْنُ أَبِي سُلَيْمٍ صَدُوقٌ وَرُبَّمَا يَهِمُ فِي الشَّيْءِ قَالَ مُحَمَّدُ بْنُ إِسْمَعِيلَ وَقَالَ أَحْمَدُ بْنُ حَنْبَلٍ لَيْثٌ لَا يُفْرَحُ بِحَدِيثِهِ كَانَ لَيْثٌ يَرْفَعُ أَشْيَاءَ لَا يَرْفَعُهَا غَيْرُهُ فَلِذَلِكَ ضَعَّفُوهُ",
                "id": "Telah menceritakan kepada kami [Al Qasim bin Dinar Al Kufi] telah menceritakan kepada kami [Mush'ab bin Al Miqdam] dari [Al Hasan bin Shalih] dari [Laits bin Abu Sulaim] dari [Thawus] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa beriman kepada Allah dan hari akhir, janganlah masuk kamar mandi tanpa busana, barangsiapa beriman kepada Allah dan hari akhir, janganlah memasukkan istrinya ke pemandian (umum), dan barangsiapa beriman kepada Allah dan hari akhir, janganlah duduk di dekat meja yang di atasnya diedarkan khamar.\" Abu Isa berkata; Hadits ini hasan gharib, kami tidak mengetahui hadits tersebut dari Thawus dari Jabir kecuali dari jalur ini. Muhammad bin Isma`il berkata; Laits bin Abu Sulaim shuduq (jujur dalam periwayatan hadits), walaupun sebagia periwayatannya ada yang wahm (cacat). Muhammad bin Isma`il berkata; Ahmad bin Hanbal berkata; \"Haditsnya Laits tidak di bisa diandalkan, sebab Laits sering merafa'kan hadits yang tidak dirafa'kan oleh perawi yang lain, oleh karena itu mereka melemahkannya.\""
            },
            {
                "number": 2659,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ الْأَعْرَجِ عَنْ أَبِي عُذْرَةَ وَكَانَ قَدْ أَدْرَكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى الرِّجَالَ وَالنِّسَاءَ عَنْ الْحَمَّامَاتِ ثُمَّ رَخَّصَ لِلرِّجَالِ فِي الْمَيَازِرِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ حَمَّادِ بْنِ سَلَمَةَ وَإِسْنَادُهُ لَيْسَ بِذَاكَ الْقَائِمِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Hammad bin Salamah] dari [Abdullah bin Syaddad Al A'raj] dari [Abu 'Udzri] -dia pernah bertemu Nabi shallallahu 'alaihi wasallam- dari ['Aisyah] bahwa Nabi shallallahu 'alaihi wasallam melarang para lelaki dan wanita masuk kamar mandi (umum), kemudian beliau memberikan keringan bagi para lelaki jika mengenakan sarung (kain penutup).\" Abu Isa berkata; Kami tidak mengetahui hadits ini kecuali dari hadits Hammad bin Salamah, sedangkan sanadnya tidak sedemikian kuat."
            },
            {
                "number": 2660,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ أَنْبَأَنَا شُعْبَةُ عَنْ مَنْصُورٍ قَال سَمِعْتُ سَالِمَ بْنَ أَبِي الْجَعْدِ يُحَدِّثُ عَنْ أَبِي الْمَلِيحِ الْهُذَلِيِّ أَنَّنِسَاءً مِنْ أَهْلِ حِمْصَ أَوْ مِنْ أَهْلِ الشَّامِ دَخَلْنَ عَلَى عَائِشَةَ فَقَالَتْ أَنْتُنَّ اللَّاتِي يَدْخُلْنَ نِسَاؤُكُنَّ الْحَمَّامَاتِ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ امْرَأَةٍ تَضَعُ ثِيَابَهَا فِي غَيْرِ بَيْتِ زَوْجِهَا إِلَّا هَتَكَتْ السِّتْرَ بَيْنَهَا وَبَيْنَ رَبِّهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Dawud] telah memberitakan kepada kami [Syu'bah] dari [Manshur] ia berkata; Aku mendengar [Salim bin Abu Al Ja'd] menceritakan dari [Abu Al Malih Al Hudzali] bahwa beberapa wanita dari penduduk Himsh atau Syam masuk menemui ['Aisyah], ia berkata; \"Kaliankah yang menyuruh wanita-wanita kalian masuk ke kamar mandi (umum)? Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang wanita menanggalkan bajunya di selain rumah suaminya, melainkan ia telah merusak tabir antara dirinya dengan Rabbnya.\" Abu Isa berkata; Hadits ini hasan."
            },
            {
                "number": 2661,
                "arab": "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ وَالْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ وَعَبْدُ بْنُ حُمَيْدٍ وَغَيْرُ وَاحِدٍ وَاللَّفْظُ لِلْحَسَنِ بْنِ عَلِيٍّ قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ يَقُولُ سَمِعْتُ أَبَا طَلْحَةَ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ كَلْبٌ وَلَا صُورَةُ تَمَاثِيلَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Salamah bin Syabib] dan [Al Hasan bin Ali Al Khallal] dan [Abdu bin Humaid] dan yang lain, sedangkan redaksi haditsnya milik Al Hasan bin Ali, mereka berkata; telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah bin 'Utbah] bahwa ia mendengar [Ibnu Abbas] berkata; Aku mendengar [Abu Thalhah] berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Malaikat tidak akan memasuki rumah yang ada anjing dan gambarnya.\" Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2662,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ أَنَّ رَافِعَ بْنَ إِسْحَقَ أَخْبَرَهُقَالَ دَخَلْتُ أَنَا وَعَبْدُ اللَّهِ بْنُ أبِي طَلْحَةَ عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ نَعُودُهُ فَقَالَ أَبُو سَعِيدٍ أَخْبَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الْمَلَائِكَةَ لَا تَدْخُلُ بَيْتًا فِيهِ تَمَاثِيلُ أَوْ صُورَةٌشَكَّ إِسْحَقُ لَا يَدْرِي أَيُّهُمَا قَالَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Rauh bin 'Ubadah] telah menceritakan kepada kami [Malik bin Anas] dari [Ishaq bin Abdullah bin Abu Thalhah] bahwa [Rabi' bin Ishaq] telah menceritakan kepadanya, ia berkata; Aku dan Abdullah bin Abu Thalhah pernah menemui [Abu Sa'id Al Khudri] untuk menjenguknya. Abu Sa'id berkata; telah mengabarkan kepada kami Rasulullah shallallahu 'alaihi wasallam bahwa Malaikat tidak akan memasuki rumah yang ada patung atau gambarnya.\" Ishaq ragu (dengan redaksi haditsnya), tidak tahu yang mana (antara patung atau gambar). Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2663,
                "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ حَدَّثَنَا مُجَاهِدٌ قَالَ حَدَّثَنَا أَبُو هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَانِي جِبْرِيلُ فَقَالَ إِنِّي كُنْتُ أَتَيْتُكَ الْبَارِحَةَ فَلَمْ يَمْنَعْنِي أَنْ أَكُونَ دَخَلْتُ عَلَيْكَ الْبَيْتَ الَّذِي كُنْتَ فِيهِ إِلَّا أَنَّهُ كَانَ فِي بَابِ الْبَيْتِ تِمْثَالُ الرِّجَالِ وَكَانَ فِي الْبَيْتِ قِرَامُ سِتْرٍ فِيهِ تَمَاثِيلُ وَكَانَ فِي الْبَيْتِ كَلْبٌ فَمُرْ بِرَأْسِ التِّمْثَالِ الَّذِي بِالْبَابِ فَلْيُقْطَعْ فَلْيُصَيَّرْ كَهَيْئَةِ الشَّجَرَةِ وَمُرْ بِالسِّتْرِ فَلْيُقْطَعْ وَيُجْعَلْ مِنْهُ وِسَادَتَيْنِ مُنْتَبَذَتَيْنِ يُوطَآَنِ وَمُرْ بِالْكَلْبِ فَيُخْرَجْ فَفَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ ذَلِكَ الْكَلْبُ جَرْوًا لِلْحَسَنِ أَوْ الْحُسَيْنِ تَحْتَ نَضَدٍ لَهُ فَأَمَرَ بِهِ فَأُخْرِجَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ عَائِشَةَ وَأَبِي طَلْحَةَ",
                "id": "Telah menceritakan kepada kami [Suwaid] telah menceritakan kepada kami [Abdullah bin Al Mubarak] telah mengabarkan kepada kami [Yunus bin Abu Ishaq] telah mengabarkan kepada kami [Mujahid] ia berkata; telah menceritakan kepada kami [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jibril datang kepadaku, kemudian dia berkata; \"Sesungguhnya tadi malam aku datang kepadamu, dan tidak ada yang menghalangiku masuk menemuimu dalam rumah yang kamu tempati, kecuali karena pada pintu rumah ada gambar seorang lelaki, dan di dalam rumah ada tabir tipis yang bergambar dan ada anjingnya, perintahkan agar kepala gambar-gambar yang ada di pintu diptong dan jadikan seperti bentuk pohon, perintahkan agar tabir itu dipotong kemudian dijadikan dua bantal yang di hamparkan dan di jadikan tempat sandaran serta perintahkan agar anjing itu dikeluarkan dari rumah.\" Lalu Rasulullah shallallahu 'alaihi wasallam melakukannya, anjing itu adalah anak anjing yang di jadikan mainan untuk Hasan dan Husain, \" kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan supaya anjing tersebut di keluarkan.\" Abu Isa berkata; Hadits ini hasan shahih, dan dalam bab ini, ada juga hadits dari 'Aisyah dan Abu Thalhah."
            },
            {
                "number": 2664,
                "arab": "حَدَّثَنَا عَبَّاسُ بْنُ مُحَمَّدٍ الْبَغْدَادِيُّ حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا إِسْرَائِيلُ عَنْ أَبِي يَحْيَى عَنْ مُجَاهِدٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَمَرَّ رَجُلٌ وَعَلَيْهِ ثَوْبَانِ أَحْمَرَانِ فَسَلَّمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يَرُدَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَمَعْنَى هَذَا الْحَدِيثِ عِنْدَ أَهْلِ الْعِلْمِ أَنَّهُمْ كَرِهُوا لُبْسَ الْمُعَصْفَرِ وَرَأَوْا أَنَّ مَا صُبِغَ بِالْحُمْرَةِ بِالْمَدَرِ أَوْ غَيْرِ ذَلِكَ فَلَا بَأْسَ بِهِ إِذَا لَمْ يَكُنْ مُعَصْفَرًا",
                "id": "Telah menceritakan kepada kami [Abbas bin Muhammad Al Baghdadi] telah menceritakan kepada kami [Ishaq bin Manshur] telah mengabarkan kepada kami [Isra`il] dari [Abu Yahya] dari [Mujahid] dari [Abdullah bin 'Amru] ia berkata; Seseorang memakai dua kain yang berwarna merah lewat, lalu mengucapkan salam kepada Nabi shallallahu 'alaihi wasallam, namun beliau tidak menjawab salamnya.\" Abu Isa berkata; Hadits ini hasan gharib dari jalur ini. Makna hadits ini menurut para ahli ilmu, mereka memakruhkan mengenakan pakaian yang diwarnai dengan warna kuning (seluruh bagiannya), mereka berpendapat bahwa kain yang diwarnai warna merah dengan bahan dari madar (jenis tanah liat yang kering) atau dengan yang lainnya hukumnya tidak apa-apa, jika warnanya tidak menjadi kuning.\""
            },
            {
                "number": 2665,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ هُبَيْرَةَ بْنِ يَرِيمَ قَالَ قَالَ عَلِيٌّنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ خَاتَمِ الذَّهَبِ وَعَنْ الْقَسِّيِّ وَعَنْ الْمِيثَرَةِ وَعَنْ الْجِعَةِقَالَ أَبُو الْأَحْوَصِ وَهُوَ شَرَابٌ يُتَّخَذُ بِمِصْرَ مِنْ الشَّعِيرِ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu Al Ahwash] dari [Abu Ishaq] dari [Hubairah bin Yarim] ia berkata; [Ali] berkata; Nabi shallallahu 'alaihi wasallam melarang mengenakan cincin emas, qassi, mitsarah dan ji'ah.\" Abu Al Ahwash berkata; \"Itu adalah minuman yang terbuat dari gandum di Mesir.\" Abu Isa berkata; Hadits ini hasan shahih. "
            },
            {
                "number": 2666,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَعَبْدُ الرّحْمَنِ بْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ الْأَشْعَثِ بْنِ سُلَيْمٍ عَنْ مُعَاوِيَةَ بْنِ سُوَيْدِ بْنِ مُقَرِّنٍ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَأَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَبْعٍ وَنَهَانَا عَنْ سَبْعٍ أَمَرَنَا بِاتِّبَاعِ الْجَنَازَةِ وَعِيَادَةِ الْمَرِيضِ وَتَشْمِيتِ الْعَاطِسِ وَإِجَابَةِ الدَّاعِي وَنَصْرِ الْمَظْلُومِ وَإِبْرَارِ الْقَسَمِ وَرَدِّ السَّلَامِ وَنَهَانَا عَنْ سَبْعٍ عَنْ خَاتَمِ الذَّهَبِ أَوْ حَلْقَةِ الذَّهَبِ وَآنِيَةِ الْفِضَّةِ وَلُبْسِ الْحَرِيرِ وَالدِّيبَاجِ وَالْإِسْتَبْرَقِ وَالْقَسِّيِّقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَشْعَثُ بْنُ سُلَيْمٍ هُوَ أَشْعَثُ بْنُ أَبِي الشَّعْثَاءِ اسْمُهُ سُلَيْمُ بْنُ الْأَسْوَدِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] dan [Abdurrahman bin Mahdi] keduanya berkata; telah menceritakan kepada kami [Syu'bah] dari [Al Asy'ats bin Sulaim] dari [Mu'awiyah bin Suwaid bin Muqarrin] dari [Al Barra` bin Azib] ia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan kepada kami tujuh hal dan melarang tujuh hal, beliau memerintahkan kami untuk mengiringi jenazah, menjenguk orang sakit, mendoakan orang yang bersin, memenuhi undangan, menolong orang yang teraniaya, menunaikan sumpah dan menjawab salam. Beliau melarang tujuh hal dari kami, yaitu mengenakan cincin emas atau kalung emas, bejana emas, mengenakan sutera, sutra tebal dan sutera tipis dan qassi.\" Abu Isa berkata; Hadits ini shahih. Asy'ats bin Sulaim adalah Asy'ats bin Abu Al Asy Sya'tsa`, namanya Sulaim bin Al Aswad."
            },
            {
                "number": 2667,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَسُوا الْبَيَاضَ فَإِنَّهَا أَطْهَرُ وَأَطْيَبُ وَكَفِّنُوا فِيهَا مَوْتَاكُمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ وَابْنِ عُمَرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan] dari [Habib bin Abu Tsabit] dari [Maimun bin Abu Syabib] dari [Samurah bin Jundub] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kenakanlah pakaian warna putih, karena itu lebih suci dan lebih baik, dan gunakanlah kain putih untuk mangkafani mayit kalian.\" Abu Isa berkata; Hadits ini hasan shahih, dan dalam bab ini, ada juga hadits dari Ibnu Abbas dan Ibnu Umar."
            },
            {
                "number": 2668,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عَبْثَرُ بْنُ الْقَاسِمِ عَنْ الْأَشْعَثِ وَهُوَ ابْنُ سَوَّارٍ عَنْ أَبِي إِسْحَقَ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي لَيْلَةٍ إِضْحِيَانٍ فَجَعَلْتُ أَنْظُرُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِلَى الْقَمَرِ وَعَلَيْهِ حُلَّةٌ حَمْرَاءُ فَإِذَا هُوَ عِنْدِي أَحْسَنُ مِنْ الْقَمَرِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ الْأَشْعَثِ",
                "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abtsar bin Al Qasim] dari [Al Asy'ats yaitu Ibnu Sawwar] dari [Abu Ishaq] dari [Jabir bin Samurah] ia berkata; \"Pada malam bulan purnama aku melihat Rasulullah shallallahu 'alaihi wasallam, aku melihat Rasulullah shallallahu 'alaihi wasallam dan melihat bulan, ketika itu beliau tengah mengenakan pakaian berwarna merah, beliau bagiku lebih bagus rupanya daripada bulan.\" Abu Isa berkata; Hadits ini hasan gharib, kami tidak mengetahuinya kecuali dari hadits Al Asy'ats."
            },
            {
                "number": 2669,
                "arab": "وَرَوَى شُعْبَةُ وَالثَّوْرِيُّ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَرَأَيْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُلَّةً حَمْرَاءَحَدَّثَنَا بِذَلِكَ مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ بِهَذَا وَفِي الْحَدِيثِ كَلَامٌ أَكْثَرُ مِنْ هَذَا قَالَ سَأَلْتُ مُحَمَّدًا قُلْتُ لَهُ حَدِيثُ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ أَصَحُّ أَوْ حَدِيثُ جَابِرِ بْنِ سَمُرَةَ فَرَأَى كِلَا الْحَدِيثَيْنِ صَحِيحًا وَفِي الْبَاب عَنْ الْبَرَاءِ وَأَبِي جُحَيْفَةَ",
                "id": "Telah menceritakan kepada kami [Syu'bah] dan [Ats Tsauri] dari [Abu Ishaq] dari [Al Bara` bin Azib] ia berkata; Aku melihat Rasulullah shallallahu 'alaihi wasallam mengenakan busana merah.\" Telah menceritakan kepada kami [Mahmud bin Ghailan] seperti itu, telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dan telah menceritakan kepada kami [Muhammad bin Basyr] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dengan hadits serupa. Dalam hadits tersebut, terdapat pembicaraan yang lebih banyak dari hadits ini. Perawi berkata; Aku bertanya kepada Muhammad, Aku berkata padanya: \"Apakah hadits Abu Ishaq dari Al Barra` lebih shahih atau hadits Jabir bin Samurah?.\" Muhammad menilai kedua hadits itu shahih. Dalam hal ini, ada hadits serupa dari Al Barra` dan Abu Juhaifah."
            },
            {
                "number": 2670,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادِ بْنِ لَقِيطٍ عَنْ أَبِيهِ عَنْ أَبِي رِمْثَةَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عُبَيْدِ اللَّهِ بْنِ إِيَادٍ وَأَبُو رِمْثَةَ التَّيْمِيُّ يُقَالُ اسْمُهُ حَبِيبُ بْنُ حَيَّانَ وَيُقَالُ اسْمُهُ رِفَاعَةُ بْنُ يَثْرِبِيٍّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami ['ubaidhullah bin Iyad bin Laqith] dari [Ayahnya] dari [Abu Rimtsah] ia berkata; \"Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam mengenakan dua selimut berwarna hijau.\" Abu Isa berkata; Hadits ini hasan gharib, kami hanya mengetahuinya dari hadits 'ubaidhullah bin Iyad dan Abu Rimtsah At Taimi. Ada yang mengatakan bahwa namanya adalah Habib bin Hayyan, yang lain mengatakan namanya Rifa'ah bin Yatsribi."
            },
            {
                "number": 2671,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ أَخْبَرَنِي أَبِي عَنْ مُصْعَبِ بْنِ شَيْبَةَ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ عَائِشَةَ قَالَتْخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ غَدَاةٍ وَعَلَيْهِ مِرْطٌ مِنْ شَعَرٍ أَسْوَدَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Yahya bin Zakariya bin Abu Za`idah] telah mengabarkan kepadaku [Ayahku] dari [Mush'ab bin Syaibah] dari [Shafiyah binti Syaibah] dari ['Aisyah] ia berkata; \"Pada suatu pagi, Nabi shallallahu 'alaihi wasallam pergi sambil mengenakan pakaian dari bulu berwarna hitam.\" Abu Isa berkata; Hadits ini hasan gharib shahih."
            },
            {
                "number": 2672,
                "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ الصَّفَّارُ أَبُو عُثْمَانَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ حَسَّانَ أَنَّهُ حَدَّثَتْهُ جَدَّتَاهُ صَفِيَّةُ بِنْتُ عُلَيْبَةَ وَدُحَيْبَةُ بِنْتُ عُلَيْبَةَ حَدَّثَتَاهُ عَنْ قَيْلَةَ بِنْتِ مَخْرَمَةَ وَكَانَتَا رَبِيبَتَيْهَا وَقَيْلَةُ جَدَّةُ أَبِيهِمَا أُمُّ أُمِّهِ أَنَّهَا قَالَتْقَدِمْنَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ الْحَدِيثَ بِطُولِهِ حَتَّى جَاءَ رَجُلٌ وَقَدْ ارْتَفَعَتْ الشَّمْسُ فَقَالَ السَّلَامُ عَلَيْكَ يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْكَ السَّلَامُ وَرَحْمَةُ اللَّهِ وَعَلَيْهِ تَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْمَالُ مُلَيَّتَيْنِ كَانَتَا بِزَعْفَرَانٍ وَقَدْ نَفَضَتَا وَمَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَسِيبُ نَخْلَةٍقَالَ أَبُو عِيسَى حَدِيثُ قَيْلَةَ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عَبْدِ اللَّهِ بْنِ حَسَّانَ",
                "id": "Telah menceritakan kepada kami ['Abdu bin Humaid] telah menceritakan kepada kami ['Affan bin Muslim Ash Shaffar Abu Utsman] telah menceritakan kepada kami [Abdullah bin Hassan] bahwa dua orang neneknya yaitu [Shafiyyah binti 'Ulayyah] dan [Duhaibah binti 'Ulaibah] telah menceritakan kepadanya, dari [Qailah binti Makhramah], keduanya (Shafiyah dan Duhaibah) adalah anak tiri Qailah, sementara Qailah adalah nenek dari ayah mereka berdua, dia berkata; \"Kami datang kepada Nabi shallallahu 'alaihi wasallam, -kemudian ia menyebutkan hadits panjang- sampai datanglah seseorang, sementara sinar matahari tengah naik sepenggalahan, lalu dia mengatakan; \"ASSALAAMU 'ALAIKA YA RASULALLAAH, \" Rasulullah shallallahu 'alaihi wasallam menjawab: \"WA'ALAIKAS SALAM WARAHMATULLAAH.\" Beliau yaitu Nabi shallallahu 'alaihi wasallam tengah mengenakan pakaian dan selimut usang yang diberi minyak za'faran, ketika itu Nabi shallallahu 'alaihi wasallam membawa pelepah kurma.\" Abu Isa berkata; Kami tidak mengetahui hadits Qailah kecuali dari hadits Abdullah bin Hasan."
            },
            {
                "number": 2673,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ قَالَ ح و حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ حَمَّادِ بْنِ زَيْدٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ التَّزَعْفُرِ لِلرِّجَالِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَرَوَى شُعْبَةُ هَذَا الْحَدِيثَ عَنْ إِسْمَعِيلَ ابْنِ عُلَيَّةَ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ التَّزَعْفُرِ حَدَّثَنَا بِذَلِكَ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا آدَمُ عَنْ شُعْبَةَ قَالَ أَبُو عِيسَى وَمَعْنَى كَرَاهِيَةِ التَّزَعْفُرِ لِلرِّجَالِ أَنْ يَتَزَعْفَرَ الرَّجُلُ يَعْنِي أَنْ يَتَطَيَّبَ بِهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Hammad bin Zaid] ia berkata, -dan diriwayatkan dari jalur lain- telah menceritakan kepada kami [Ishaq bin Manshur] telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Hammad bin Zaid] dari [Abdul Aziz bin Shuhaib] dari [Anas bin Malik] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang seorang laki-laki mengenakan za'faran.\" Abu Isa berkata; Hadits ini hasan shahih. [Syu'bah] meriwayatkan hadits ini dari [Isma'il bin 'Ulaiyah] dari [Abdul Aziz bin Shuhaib] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam melarang mengenakan za'faran. Telah menceritakan kepada kami [Abdullah bin Abdurrahman] seperti itu, telah menceritakan kepada kami [Adam] dari [Syu'bah]. Abu Isa berkata; \"Makna makruhnya mengenakan za'faran bagi lelaki adalah bila dipakai untuk wewangian.\""
            },
            {
                "number": 2674,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ عَنْ شُعْبَةَ عَنْ عَطَاءِ بْنِ السَّائِبِ قَال سَمِعْتُ أَبَا حَفْصِ بْنَ عُمَرَ يُحَدِّثُ عَنْ يَعْلَى بْنِ مُرَّةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبْصَرَ رَجُلًا مُتَخَلِّقًا قَالَ اذْهَبْ فَاغْسِلْهُ ثُمَّ اغْسِلْهُ ثُمَّ لَا تَعُدْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَقَدْ اخْتَلَفَ بَعْضُهُمْ فِي هَذَا الْإِسْنَادِ عَنْ عَطَاءِ بْنِ السَّائِبِ قَالَ عَلِيٌّ قَالَ يَحْيَى بْنُ سَعِيدٍ مَنْ سَمِعَ مِنْ عَطَاءِ بْنِ السَّائِبِ قَدِيمًا فَسَمَاعُهُ صَحِيحٌ وَسَمَاعُ شُعْبَةَ وَسُفْيَانَ مِنْ عَطَاءِ بْنِ السَّائِبِ صَحِيحٌ إِلَّا حَدِيثَيْنِ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ زَاذَانَ قَالَ شُعْبَةُ سَمِعْتُهُمَا مِنْهُ بِآخِرَةٍ قَالَ أَبُو عِيسَى يُقَالُ إِنَّ عَطَاءَ بْنَ السَّائِبِ كَانَ فِي آخِرِ أَمْرِهِ قَدْ سَاءَ حِفْظُهُ وَفِي الْبَاب عَنْ عَمَّارٍ وَأَبِي مُوسَى وَأَنَسٍ وَأَبُو حَفْصٍ هُوَ أَبُو حَفْصِ بْنُ عُمَرَ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Daud Ath Thayalisi] dari [Syu'bah] dari [Atha` bin As Sa`ib] ia berkata; Aku mendengar [Abu Hafs bin Umar] menceritakan dari [Ya'la bin Murrah] bahwa Nabi shallallahu 'alaihi wasallam melihat seorang lelaki berlumuran minyak wangi yang berwarna kuning, kemudian beliau bersabda: \"Pergi dan cucilah kemudian cucilah dan jangan ulangi lagi.\" Abu Isa berkata; Hadits ini hasan, sebagian ulama berbeda pendapat tentang sanad ini dari Atha` bin As Sa`ib, Ali berkata bahwa Yahya bin Sa'id berkata; Barangsiapa mendengar dari Atha` pada waktu dulu, maka hadits yang dia dengar shahih, sementara hadits yang didengar oleh Syu'bah dan Sufyan dari Atha` bin Sa`ib adalah shahih, kecuali dua hadits yaitu dari Atha` dari Zadzan dimana Syu'bah berkata; Aku mendengar darinya di masa-masa akhir (hayatnya). Abu Isa berkata; Dikatakan bahwa hafalan Atha` bin Sa`ib buruk pada masa-masa akhir hayatnya. Dan dalam bab ini, ada juga hadits dari 'Ammar, Abu Musa, Anas dan Abu Hafs yaitu Abu Hafs bin Umar."
            },
            {
                "number": 2675,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا إِسْحَقُ بْنُ يُوسُفَ الْأَزْرَقُ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ حَدَّثَنِي مَوْلَى أَسْمَاءَ عَنْ ابْنِ عُمَرَ قَال سَمِعْتُ عُمَرَ يَذْكُرُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَبِسَ الْحَرِيرَ فِي الدُّنْيَا لَمْ يَلْبَسْهُ فِي الْآخِرَةِوَفِي الْبَاب عَنْ عَلِيٍّ وَحُذَيْفَةَ وَأَنَسٍ وَغَيْرِ وَاحِدٍ وَقَدْ ذَكَرْنَاهُ فِي كِتَابِ اللِّبَاسِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ أَبِي عَمْرٍو مَوْلَى أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ الصِّدِّيقِ وَاسْمُهُ عَبْدُ اللَّهِ وَيُكْنَى أَبَا عَمْرٍو وَقَدْ رَوَى عَنْهُ عَطَاءُ بْنُ أَبِي رَبَاحٍ وَعَمْرُو بْنُ دِينَارٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Ishaq bin Yusuf Al Azraq] telah menceritakan kepada kami [Abdul Malik bin Abu Sulaiman] telah menceritakan kepada kami [Bekas budak Asma`] dari [Ibnu Umar] ia berkata; Aku mendengar [Umar] menyebutkan, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memakai kain sutra di dunia, maka dia tidak akan memakainya di akhirat.\" Dan dalam bab ini, ada juga hadits dari Ali, Hudzaifah, Anas dan lainnya. Kami telah menyebutkannya dalam kitabul libas (kitab tentang pakaian). Abu Isa berkata; Hadits ini hasan shahih, telah diriwayatkan dari beberapa jalur sanad dari Abu 'Amru bekas budak Asma` binti Abu Bakar Ash Shiddiq, namanya adalah Abdullah sedangkan julukannya adalah Abu 'Amru. Atha` bin Abu Rabah dan 'Amru bin Dinar meriwayatkan hadits darinya."
            },
            {
                "number": 2676,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ الْمِسْوَرِ بْنِ مَخْرَمَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَسَمَ أَقْبِيَةً وَلَمْ يُعْطِ مَخْرَمَةَ شَيْئًا فَقَالَ مَخْرَمَةُ يَا بُنَيَّ انْطَلِقْ بِنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْطَلَقْتُ مَعَهُ قَالَ ادْخُلْ فَادْعُهُ لِي فَدَعَوْتُهُ لَهُ فَخَرَج النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ قَبَاءٌ مِنْهَا فَقَالَ خَبَأْتُ لَكَ هَذَا قَالَ فَنَظَر إِلَيْهِ فَقَال رَضِيَ مَخْرَمَةُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَابْنُ أَبِي مُلَيْكَةَ اسْمُهُ عَبْدُ اللَّهِ بْنُ عُبَيْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Abu Mulaikah] dari [Al Miswar bin Al Makhramah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah membagi-bagikan pakaian, dan tidak memberikan bagian sama sekali kepada Makhramah, maka Makhramah berkata; \"Wahai anakku, berangkatlah bersama kami menghadap Rasulullah shallallahu 'alaihi wasallam, \" akupun berangkat bersamanya, lalu Makhramah berkata; \"Masuklah dan panggilkan beliau untukku, \" aku pun memanggil beliau, maka Nabi shallallahu 'alaihi wasallam keluar dengan membawa pakaian, sambil bersabda: \"Aku simpan ini untukmu.\" Al Miswar berkata; Makhramah memandang beliau, lalu berkata; \"Makhramah rela.\" Abu Isa berkata; Hadits ini hasan shahih, Ibnu Mulaikah namanya adalah Abdullah bin 'ubaidhullah bin Abu Mulaikah."
            },
            {
                "number": 2677,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ يُحِبَّ أَنْ يَرَى أَثَرَ نِعْمَتِهِ عَلَى عَبْدِهِوَفِي الْبَاب عَنْ أَبِي الْأَحْوَصِ عَنْ أَبِيهِ وَعِمْرَانَ بْنِ حُصَيْنٍ وَابْنِ مَسْعُودٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Muhammad Az Za'farani] telah menceritakan kepada kami ['Affan bin Muslim] telah menceritakan kepada kami [Hammam] dari [Qatadah] dari ['Amru bin Syu'aib] dari [Ayahnya] dari [Kakeknya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah senang bila melihat bekas nikmat-Nya yang diberikan kepada hamba-NYa.\" Dan dalam bab ini, ada juga hadits dari Abul Ahwas dari ayahnya dan Imran bin Hushain serta Ibnu Mas'ud, Abu Isa berkata; Hadits ini hasan."
            },
            {
                "number": 2678,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ دَلْهَمِ بْنِ صَالِحٍ عَنْ حُجَيْرِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِأَنَّ النَّجَاشِيَّ أَهْدَى إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُفَّيْنِ أَسْوَدَيْنِ سَاذَجَيْنِ فَلَبِسَهُمَا ثُمَّ تَوَضَّأَ وَمَسَحَ عَلَيْهِمَاقَالَ هَذَا حَدِيثٌ حَسَنٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ دَلْهَمٍ وَقَدْ رَوَاهُ مُحَمَّدُ بْنُ رَبِيعَةَ عَنْ دَلْهَمٍ",
                "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Waki'] dari [Dalham bin Shalih] dari [Hujair bin 'Abdullah] dari [Ibnu Buraidah] dari [Ayahnya] bahwa Najasyi menghadiahkan sepasang sepatu berwarna hitam yang tidak di bordir kepada Nabi shallallahu 'alaihi wasallam, lalu beliau memakainya dan berwudlu sambil mengusap keduanya.\" Abu Isa berkata; Hadits ini hasan, hanyasannya kami mengetahui hadits ini dari hadits Dalham, sedangkan [Muhammad bin Rabi'ah] telah meriwayatkannya dari [Dalham]."
            },
            {
                "number": 2679,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ إِسْحَقَ الْهَمْدَانِيُّ حَدَّثَنَا عَبْدَةُ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ نَتْفِ الشَّيْبِ وَقَالَ إِنَّهُ نُورُ الْمُسْلِمِقَالَ هَذَا حَدِيثٌ حَسَنٌ قَدْ رُوِيَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ وَغَيْرِ وَاحِدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ",
                "id": "Telah menceritakan kepada kami [Harun bin Ishaq Al Hamdani] telah menceritakan kepada kami ['Abdah] dari [Muhammad bin Ishaq] dari ['Amru bin Syu'aib] dari [Ayahnya] dari [Kakeknya] bahwa Nabi shallallahu 'alaihi wasallam melarang mencabuti rambut uban, beliau bersabda: \"Sesungguhnya uban itu cahaya bagi seorang muslim.\" Abu Isa berkata; Hadits ini hasan, telah diriwayatkan dari [Abdurrahman bin Al Harits] dan yang lainnya dari ['Amru bin Syu'aib]."
            },
            {
                "number": 2680,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى حَدَّثَنَا شَيْبَانُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُسْتَشَارُ مُؤْتَمَنٌقَالَ هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رَوَى غَيْرُ وَاحِدٍ عَنْ شَيْبَانَ بْنِ عَبْدِ الرَّحْمَنِ النَّحْوِيِّ وَشَيْبَانُ هُوَ صَاحِبُ كِتَابٍ وَهُوَ صَحِيحُ الْحَدِيثِ وَيُكْنَى أَبَا مُعَاوِيَةَ حَدَّثَنَا عَبْدُ الْجَبَّارِ بْنُ الْعَلَاءِ الْعَطَّارُ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ قَالَ قَالَ عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ إِنِّي لَأُحَدِّثُ الْحَدِيثَ فَمَا أَخْرِمُ مِنْهُ حَرْفًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Al Hasan bin Musa] telah menceritakan kepada kami [Syaiban] dari [Abdul Malik bin 'Umair] dari [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaknya seorang penasehat adalah orang yang amanah.\" Abu Isa berkata; Hadits ini hasan, banyak yang meriwayatkan hadits ini dari Syaiban bin Abdurrahman An Nahwi, sedangkan Syaiban adalah pemilik kitab, haditsnya shahih, julukannya Abu Mu'awiyah. Telah menceritakan kepada kami Abdul Jabbar bin Al 'Ala Al Athar dari Sufyan bin 'Uyainah, dia berkata; Abdul Malik bin 'Umair berkata; Aku menyampaikan hadits dan tidak ada satu huruf pun yang aku kurangi."
            },
            {
                "number": 2681,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ عَنْ دَاوُدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ ابْنِ جُدْعَانَ عَنْ جَدَّتِهِ عَنْ أُمِّ سَلَمَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُسْتَشَارُ مُؤْتَمَنٌوَفِي الْبَاب عَنْ ابْنِ مَسْعُودٍ وَأَبِي هُرَيْرَةَ وَابْنِ عُمَرَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ أُمِّ سَلَمَةَ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Waki'] dari [Daud bin Abu Abdullah] dari [Ibnu Jud'an] dari [neneknya] dari [Ummu Salamah], dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaknya seorang penasehat adalah orang yang amanah (dapat di percaya).\" Dan dalam bab ini, ada juga hadits dari Ibnu Mas'ud, Abu Hurairah dan Ibnu Umar. Abu Isa berkata; Hadits ini gharib dari hadits Ummu Salamah."
            },
            {
                "number": 2682,
                "arab": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ وَحَمْزَةَ ابْنَيْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِمَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الشُّؤْمُ فِي ثَلَاثَةٍ فِي الْمَرْأَةِ وَالْمَسْكَنِ وَالدَّابَّةِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَبَعْضُ أَصْحَابِ الزُّهْرِيِّ لَا يَذْكُرُونَ فِيهِ عَنْ حَمْزَةَ إِنَّمَا يَقُولُونَ عَنْ سَالِمٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهَكَذَا رَوَى لَنَا ابْنُ أَبِي عُمَرَ هَذَا الْحَدِيثَ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ وَحَمْزَةَ ابْنَيْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِمَا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ وَلَمْ يَذْكُرْ فِيهِ سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ حَمْزَةَ وَرِوَايَةُ سَعِيدٍ أَصَحُّ لِأَنَّ عَلِيَّ بْنَ الْمَدِينِيِّ وَالْحُمَيْدِيَّ رَوَيَا عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ وَذَكَرَا عَنْ سُفْيَانَ قَالَ لَمْ يَرْوِ لَنَا الزُّهْرِيُّ هَذَا الْحَدِيثَ إِلَّا عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ وَرَوَى مَالِكٌ هَذَا الْحَدِيثَ عَنْ الزُّهْرِيِّ وَقَالَ عَنْ سَالِمٍ وَحَمْزَةَ ابْنَيْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِمَا وَفِي الْبَاب عَنْ سَهْلِ بْنِ سَعْدٍ وَعَائِشَةَ وَأَنَسٍ وَقَدْ رُوِيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنْ كَانَ الشُّؤْمُ فِي شَيْءٍ فَفِي الْمَرْأَةِ وَالدَّابَّةِ وَالْمَسْكَنِ",
                "id": "Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Salim] dan [Hamzah] -dua putra Abdullah bin Umar, dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"(Terkadang) kesialan itu ada pada tiga hal, yaitu; wanita, tempat tinggal dan binatang tunggangan (kendaraan).\" Abu Isa berkata; hadits ini shahih, sebagaian sahabat Az Zuhri tidak menyebutkannya dari Hamzah, mereka hanya mengatakan; Dari Salim dari Ayahnya dari Nabi shallallahu 'alaihi wasallam. Demikianlah Ibnu Abu Umar meriwayatkan hadits ini kepada kami, dari Sufyan bin 'Uyainah dari Az Zuhri dari Salim dan Hamzah, -dua putra Abdullah bin Umar, - dari ayahnya dari Nabi shallallahu 'alaihi wasallam. Telah menceritakan kepada kami [Sa'id bin Abdurrahman] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Salim] dari [Ayahnya] dari nabi shallallahu 'alaihi wasallam seperti itu, namun ia tidak menyebut; Sa'id bin Abdurrahman dari Hamzah. Sedangkan riwayat Sa'id lebih shahih, karena [Ali bin Al Madini] dan [Humaidi] meriwayatkan dari [Sufyan] dari [Az Zuhri] dari [Salim] dari [Ayahnya], keduanya menyebutkan; dari Sufyan. Abu Isa berkata; Az Zuhri tidak meriwayatkan hadits ini untuk kami kecuali dari Salim dari Ibnu Umar. [Malik] juga meriwayatkan hadits ini dari [Az Zuhri] dan berkata; Dari [Salim] dan [Hamzah] -dua putra Abdullah bin Umar, - dari [ayah mereka berdua]. Dalam hal ini, ada hadits serupa dari Sahl bin Sa'ad, 'Aisyah dan Anas. Dan diriwayatkan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Bila kesialan ada pada sesuatu, maka hal itu ada pada wanita, hewa tunggangan (kendaraan) dan tempat tinggal.\""
            },
            {
                "number": 2683,
                "arab": "وَقَدْ رُوِيَ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ قَال سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُلَا شُؤْمَ وَقَدْ يَكُونُ الْيُمْنُ فِي الدَّارِ وَالْمَرْأَةِ وَالْفَرَسِحَدَّثَنَا بِذَلِكَ عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ سُلَيْمَانَ بْنِ سُلَيْمٍ عَنْ يَحْيَى بْنِ جَابِرٍ الطَّائِيِّ عَنْ مُعَاوِيَةَ بْنِ حَكِيمٍ عَنْ عَمِّهِ حَكِيمِ بْنِ مُعَاوِيَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا",
                "id": "Dan telah diriwayatkan dari Hakim bin Mu'awiyah bahwa dia berkata; Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada kesialan, dan terkadang keberkahan itu ada pada rumah, istri dan kendaraan, \" Telah menceritakan kepada kami [Ali bin Hujr] yang seperti itu, telah menceritakan kepada kami [Isma'il bin Ayyasy] dari [Sulaiman bin Sulaim] dari [Yahya bin Jabir Ath Tha`i] dari [Mu'awiyah bin Hakim] dari [pamannya, Hakim bin Mu'awiyah] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini."
            },
            {
                "number": 2684,
                "arab": "حَدَّثَنَا هَنَّادٌ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ قَالَ ح و حَدَّثَنِي ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ شَقِيقٍ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كُنْتُمْ ثَلَاثَةً فَلَا يَتَنَاجَى اثْنَانِ دُونَ صَاحِبِهِمَاو قَالَ سُفْيَانُ فِي حَدِيثِهِ لَا يَتَنَاجَى اثْنَانِ دُونَ الثَّالِثِ فَإِنَّ ذَلِكَ يُحْزِنُهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا يَتَنَاجَى اثْنَانِ دُونَ وَاحِدٍ فَإِنَّ ذَلِكَ يُؤْذِي الْمُؤْمِنَ وَاللَّهُ عَزَّ وَجَلَّ يَكْرَهُ أَذَى الْمُؤْمِنِ وَفِي الْبَاب عَنْ ابْنِ عُمَرَ وَأَبِي هُرَيْرَةَ وَابْنِ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [Hannad] ia berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] ia berkata. (Dan diriwayatkan dari jalur lain) telah menceritakan kepadaku [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Syaqiq] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bila kalian bertiga, janganlah dua orang berbisik-bisik tanpa menyertakan orang ketiga.\" Sufyan berkata dalam haditsnya; \"Janganlah dua orang berbisik-bisik tanpa menyertakan orang ketiga, karena hal itu akan membuatnya sedih.\" Abu Isa berkata; Hadits ini hasan shahih. Dan diriwayatkan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah dua orang berbisik-bisik tanpa menyertakan yang satunya, karena itu akan menyakitkan orang mu`min, dan Allah 'azza wajalla membenci menyakiti orang mu`min.\" Dalam hal ini, ada hadits serupa dari Ibnu Umar, Abu Hurairah dan Ibnu Abbas."
            },
            {
                "number": 2685,
                "arab": "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى الْكُوفِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ أَبِي جُحَيْفَةَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبْيَضَ قَدْ شَابَ وَكَانَ الْحَسَنُ بْنُ عَلِيٍّ يُشْبِهُهُ وَأَمَرَ لَنَا بِثَلَاثَةَ عَشَرَ قَلُوصًا فَذَهَبْنَا نَقْبِضُهَا فَأَتَانَا مَوْتُهُ فَلَمْ يُعْطُونَا شَيْئًا فَلَمَّا قَامَ أَبُو بَكْرٍ قَالَ مَنْ كَانَتْ لَهُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِدَةٌ فَلْيَجِئْ فَقُمْتُ إِلَيْهِ فَأَخْبَرْتُهُ فَأَمَرَ لَنَا بِهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رَوَى مَرْوَانُ بْنُ مُعَاوِيَةَ هَذَا الْحَدِيثَ بِإِسْنَادٍ لَهُ عَنْ أَبِي جُحَيْفَةَ نَحْوَ هَذَا وَقَدْ رَوَى غَيْرُ وَاحِدٍ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ أَبِي جُحَيْفَةَ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ الْحَسَنُ بْنُ عَلِيٍّ يُشْبِهُهُ وَلَمْ يَزِيدُوا عَلَى هَذَا",
                "id": "Telah menceritakan kepada kami [Washil bin Abdul A'la Al Kufi] telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Isma'il bin Abu Khalid] dari [Abu Juhaifah] ia berkata; Aku melihat (muka) Rasulullah shallallahu 'alaihi wasallam putih (agak kemerah-merahan) dan tampak beruban, sementara Al Hasan bin Ali mirip beliau, beliau memerintahkan supaya memberikan kepada kami (kaumnya) tigabelas unta muda, kami lalu pergi hendak mengambilnya, belum sempat kami mengambilnya, berita kematian beliau sampai kepada kami, lantas mereka (para sahabat) tidak memberiku apa pun. Saat Abu Bakar berdiri, ia berkata; \"Barangsiapa memiliki tanggungan dari Rasulullah shallallahu 'alaihi wasallam, hendaklah ia datang.\" Aku pun menghampirinya dan memberitahunya, lalu ia memerintahkan untuk memberikan tigabelas unta kepada kami.\" Abu Isa berkata; Hadits ini hasan. [Marwan bin Mu'awiyah] juga meriwayatkan hadits ini dengan sanadnya dari [Abu Juhaifah] seperti di atas. Dan yang lain juga meriwayatkan dari Isma'il bin Abu Khalid dari Abu Juhaifah, ia berkata; Aku melihat Nabi shallallahu 'alaihi wasallam sedangkan Al Hasan bin Ali mirip beliau.\" Mereka tidak menambahkan lebih dari ini."
            },
            {
                "number": 2686,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ حَدَّثَنَا أَبُو جُحَيْفَةَ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ الْحَسَنُ بْنُ عَلِيٍّ يُشْبِهُهُقَالَ أَبُو عِيسَى وَهَكَذَا رَوَى غَيْرُ وَاحِدٍ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ نَحْوَ هَذَا وَفِي الْبَاب عَنْ جَابِرٍ وَأَبُو جُحَيْفَةَ اسْمُهُ وَهْبٌ السُّوَائِيُّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Isma'il bin Abu Khalid] telah menceritakan kepada kami [Abu Juhaifah] ia berkata; Aku melihat Rasulullah shallallahu 'alaihi wasallam sedangkan Al Hasan bin Ali mirip beliau.\" Abu Isa berkata; Seperti itu juga yang diriwayatkan oleh beberapa orang dari Isma'il bin Abu Khalid. Dalam hal ini, ada hadits serupa dari Jabir. Abu Juhaifah namanya adalah Wahb As Suwa`i."
            },
            {
                "number": 2687,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عَلِيٍّ قَالَمَا سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ أَبَوَيْهِ لِأَحَدٍ غَيْرَ سَعْدِ بْنِ أَبِي وَقَّاصٍ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Sa'id Al Jauhari] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Yahya bin Sa'id] dari [Sa'id bin Al Musayyab] dari [Ali] ia berkata; Aku tidak pernah mendengar Rasulullah shallallahu 'alaihi wasallam menjadikan kedua orang tua beliau sebagai tebusan untuk orang lain, selain Sa'd bin Abi Waqqash.\""
            },
            {
                "number": 2688,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ الْبَزَّارُ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ جُدْعَانَ وَيَحْيَى بْنِ سَعِيدٍ سَمِعَا سَعِيدَ بْنَ الْمُسَيَّبِ يَقُولُ قَالَ عَلِيٌّمَا جَمَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَاهُ وَأُمَّهُ لِأَحَدٍ إِلَّا لِسَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ لَهُ يَوْمَ أُحُدٍ ارْمِ فِدَاكَ أَبِي وَأُمِّي وَقَالَ لَهُ ارْمِ أَيُّهَا الْغُلَامُ الْحَزَوَّرُوَفِي الْبَاب عَنْ الزُّبَيْرِ وَجَابِرٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ عَلِيٍّ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ash Shabbah Al Bazzar] telah menceritakan kepada kami [Sufyan] dari [Ibnu Jud'an] dan [Yahya bin Sa'id] keduanya mendengar [Sa'id bin Al Musayyab] berkata; [Ali] berkata; Rasulullah shallallahu 'alaihi wasallam tidak pernah menjadikan ayah dan ibu beliau sebagai tebusan untuk seseorang kecuali untuk Sa'd bin Abi Waqqash. Beliau mengucapkannya pada saat perang Uhud: \"Lemparlah, demi ayah dan ibuku menjadi penebusmu.\" Beliau juga bersabda kepadanya: \"Lemparlah wahai pemuda yang kuat.\" Dalam hal ini, ada hadits serupa dari Az Zubair dan Jabir. Abu Isa berkata; Hadits ini hasan shahih dan diriwayatkan melalui beberapa jalur dari Ali."
            },
            {
                "number": 2689,
                "arab": "وَقَدْ رَوَى غَيْرُ وَاحِدٍ هَذَا الْحَدِيثَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَجَمَعَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَوَيْهِ يَوْمَ أُحُدٍ قَالَ ارْمِ فِدَاكَ أَبِي وَأُمِّيحَدَّثَنَا بِذَلِكَ قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ وَعَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ قَالَ جَمَعَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَوَيْهِ يَوْمَ أُحُدٍ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah di riwayatkan dari beberapa orang, dari Yahya bin Sa'id dari Sa'id bin Al Musayyab dari Sa'd bin Abu Waqqash ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah menjadikan kedua orang tua beliau sebagai tebusan untukku saat perang Uhud, beliau bersabda: \"Lemparlah, demi ayah dan ibuku menjadi tebusanmu.\" Telah menceritakan kepada kami [Qutaibah] seperti itu, telah menceritakan kepada kami [Al Laits bin Sa'ad] dan [Abdul Aziz bin Muhammad] dari [Yahya bin Sa'id] dari [Sa'id bin Al Musayyab] dari [Sa'd bin Abu Waqqash] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam menjadikan kedua orang tuanya sebagai tebusan untukku.\" Hadits ini hasan shahih."
            },
            {
                "number": 2690,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا أَبُو عَوَانَةَ حَدَّثَنَا أَبُو عُثْمَانَ شَيْخٌ لَهُ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ يَا بُنَيَّوَفِي الْبَاب عَنْ الْمُغِيرَةِ وَعُمَرَ بْنِ أَبِي سَلَمَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ مِنْ غَيْرِ هَذَا الْوَجْهِ عَنْ أَنَسٍ وَأَبُو عُثْمَانَ هَذَا شَيْخٌ ثِقَةٌ وَهُوَ الْجَعْدُ بْنُ عُثْمَانَ وَيُقَالُ ابْنُ دِينَارٍ وَهُوَ بَصْرِيٌّ وَقَدْ رَوَى عَنْهُ يُونُسُ بْنُ عُبَيْدٍ وَشُعْبَةُ وَغَيْرُ وَاحِدٍ مِنْ الْأَئِمَّةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu Asy Syawarib] telah menceritakan kepada kami [Abu 'Awanah] telah menceritakan kepada kami [Abu Utsman] -seorang syaikhnya- dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Wahai anakku.\" Dan dalam bab ini, ada hadits dari Al Mughirah dan Umar bin Abu Salamah. Abu Isa berkata; Hadits ini hasan shahih gharib dari jalur ini, dan hadits ini juga diriwayatkan melalui jalur lain dari Anas, sedangkan Abu Utsman adalah seorang syaikh yang tsiqah, dia adalah Al Ja'd bin Utsman dan dinamakan juga Ibnu Dinar, dia orang Bashrah, orang-orang yang telah meriwayatkan hadits darinya antara lain; Yunus bin Ubaid, Syu'bah dan tidak sedikit dari para ulama.\""
            },
            {
                "number": 2691,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ حَدَّثَنِي عَمِّي يَعْقُوبُ بْنُ إِبَرَاهِيمَ حَدَّثَنَا شَرِيكٌ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِتَسْمِيَةِ الْمَوْلُودِ يَوْمَ سَابِعِهِ وَوَضْعِ الْأَذَى عَنْهُ وَالْعَقِّقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Sa'd bin Ibrahim bin Sa'd bin Ibrahim bin Abdurrahman bin 'Auf] telah menceritakan kepadaku pamanku yaitu [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Syarik] dari [Muhammad bin Ishaq] dari ['Amru bin Syu'aib] dari [Ayahnya] dari [kakeknya] bahwa Nabi shallallahu 'alaihi wasallam memerintahkan agar memberikan nama kepada bayi yang lahir pada hari ketujuh, membersihkan kotoran darinya dan di aqiqahkan.\" Abu Isa berkata; Hadits ini hasan gharib."
            },
            {
                "number": 2692,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْأَسْوَدِ أَبُو عَمْرٍو الْوَرَّاقُ الْبَصْرِيُّ حَدَّثَنَا مُعَمَّرُ بْنُ سُلَيْمَانَ الرَّقِّيُّ عَنْ عَلِيِّ بْنِ صَالِحٍ الْمَكِّيِّ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَحَبُّ الْأَسْمَاءِ إِلَى اللَّهِ عَزَّ وَجَلَّ عَبْدُ اللَّهِ وَعَبْدُ الرَّحْمَنِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Al Aswad Abu 'Amru Al Warraq Al Bashri] telah menceritakan kepada kami [Mu'ammar bin Sulaiman Ar Raqqi] dari [Ali bin Shalih Al Makki] dari [Abdullah bin Utsman] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Nama-nama yang paling disukai Allah 'azza wajalla adalah Abdullah dan Abdurrahman.\" Abu Isa berkata; Hadits ini hasan gharib melalui jalur ini."
            },
            {
                "number": 2693,
                "arab": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ الْبَصْرِيُّ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ الْعُمَرِيِّ عَنْ نَافِعٍ عَنْ ابْن عُمَرَ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَحَبَّ الْأَسْمَاءِ إِلَى اللَّهِ عَبْدُ اللَّهِ وَعَبْدُ الرَّحْمَنِهَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ",
                "id": "Telah menceritakan kepada kami ['Uqbah bin Mukram Al Ammi Al Bashri] telah menceritakan kepada kami [Abu 'Ashim] dari [Abdullah bin Umar Al 'Umari] dari [Nafi'] dari [Ibnu Umar] ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Nama-nama yang paling disukai Allah adalah Abdullah dan Abdurrahman.\" Abu Isa berkata; Hadits ini hasan melalui jalur ini."
            },
            {
                "number": 2694,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَنْهَيَنَّ أَنْ يُسَمَّى رَافِعٌ وَبَرَكَةُ وَيَسَارٌقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ هَكَذَا رَوَاهُ أَبُو أَحْمَدَ عَنْ سُفْيَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ عُمَرَ وَرَوَاهُ غَيْرُهُ عَنْ سُفْيَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو أَحْمَدَ ثِقَةٌ حَافِظٌ وَالْمَشْهُورُ عِنْدَ النَّاسِ هَذَا الْحَدِيثُ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَيْسَ فِيهِ عَنْ عُمَرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu Ahmad] telah menceritakan kepada kami [Sufyan] dari [Abu Az Zubair] dari [Jabir] dari [Umar bin Al Khaththab] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh aku melarang kalian memberikan nama Rafi', Barakah dan Yasar.\" Abu Isa berkata; Hadits ini gharib, demikianlah Abu Ahmad telah meriwayatkannya dari Sufyan dari Abu Az Zubair dari Jabir dari Umar, dan yang lainnya telah meriwayatkannya dari [Sufyan] dari [Abu Az Zubair] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam. Abu Ahmad adalah tsiqah hafidz, dan hadits ini yang masyhur dikalangan orang-orang adalah hadits dari Jabir dari Nabi shallallahu 'alaihi wasallam, dan di dalamnya tidak disebutkan, \"Dari Umar.\""
            },
            {
                "number": 2695,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ عَنْ شُعْبَةَ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ الرَّبِيعِ بْنِ عُمَيْلَةَ الْفَزَارِيِّ عَنْ سَمُرَةَ بْنِ جُنْدَبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُسَمِّ غُلَامَكَ رَبَاحٌ وَلَا أَفْلَحُ وَلَا يَسَارٌ وَلَا نَجِيحٌ يُقَالُ أَثَمَّ هُوَ فَيُقَالُ لَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Dawud] dari [Syu'bah] dari [Manshur] dari [Hilal bin Yasaf] dari [Ar Rabi' bin 'Umailah Al Fazari] dari [Samurah bin Jundub] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kamu memberi nama anakmu; Rabah, Aflah, Yasar dan Najih, karena bila dikatakan; \"Apakah ia (dengan menyebutkan salah satu dari nama tersebut -pent) ada disana?\" dan di jawab; \"Tidak.\" Abu Isa berkata; Hadits ini hasan shahih. "
            },
            {
                "number": 2696,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مَيْمُونٍ الْمَكِّيُّ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَخْنَعُ اسْمٍ عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ رَجُلٌ تَسَمَّى بِمَلِكِ الْأَمْلَاكِقَالَ سُفْيَانُ شَاهَانْ شَاهْ وَأَخْنَعُ يَعْنِي وَأَقْبَحُ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Maimun Al Makki] telah menceritakan kepada kami [Sufyan] dari [Abu Az Zinnad] dari [Al A'raj] dari [Abu Hurairah], yang (riwayatnya) sampai kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Nama paling buruk di sisi Allah pada hari kiamat adalah seseorang yang diberi nama raja diraja.\" Sufyan -Syahan syah- mengatakan; \"Akhna' artinya paling buruk.\" Hadits ini hasan shahih."
            },
            {
                "number": 2697,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ وَأَبُو بَكْرٍ مُحَمَّدُ بْنُ بَشَّارٍ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيَّرَ اسْمَ عَاصِيَةَ وَقَالَ أَنْتِ جَمِيلَةُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَإِنَّمَا أَسْنَدَهُ يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ وَرَوَى بَعْضُهُمْ هَذَا عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ أَنَّ عُمَرَ مُرْسَلًا وَفِي الْبَاب عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَعَبْدِ اللَّهِ بْنِ سَلَامٍ وَعَبْدِ اللَّهِ بْنِ مُطِيعٍ وَعَائِشَةَ وَالْحَكَمِ بْنِ سَعِيدٍ وَمُسْلِمٍ وَأُسَامَةَ بْنِ أَخْدَرِيٍّ وَشُرَيْحِ بْنِ هَانِئٍ عَنْ أَبِيهِ وَخَيْثَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim Ad Dauraqi] dan [Abu Bakar Muhammad bin Basyar] dan yang lain, mereka berkata; telah menceritakan kepada kami [Yahya bin Sa'id Al Qaththan] dari ['ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam merubah nama 'Ashiya (durhaka), beliau bersabda: \"Engkau adalah Jamilah (wanita cantik).\" Abu Isa berkata; Hadits ini hasan gharib, Yahya bin Sa'id Al Qaththan menyandarkannya dari 'ubaidhullah dari Nafi' dari Ibnu Umar, dan sebagaian dari mereka meriwayatkan hadits ini dari 'ubaidhullah dari Nafi' bahwa Umar, meriwayatkan secara mursal. Dalam hal ini, ada hadits serupa dari Abdurrahman bin Auf, Abdullah bin Salam, Abdullah bin Muthi', 'Aisyah, Hakam bin Sa'id, Muslim, Usamah bin Akhdari, Syuraikh bin Hani`, dari ayahnya dan Khaitsamah bin Abdurrahman dari ayahnya."
            },
            {
                "number": 2698,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ نَافِعٍ الْبَصْرِيُّ حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ الْمُقَدَّمِيُّ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُغَيِّرُ الِاسْمَ الْقَبِيحَقَالَ أَبُو بَكْرٍ وَرُبَّمَا قَالَ عُمَرُ بْنُ عَلِيٍّ فِي هَذَا الْحَدِيثِ هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا وَلَمْ يَذْكُرْ فِيهِ عَنْ عَائِشَةَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Nafi' Al Bashri] telah menceritakan kepada kami [Umar bin Ali Al Muqaddami] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari ['Aisyah] bahwa Nabi shallallahu 'alaihi wasallam merubah nama yang jelek.\" [Abu Bakar] berkata; Mungkin [Umar bin Ali] berkata dalam hadits ini, [Hisyam bin 'Urwah] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam secara mursal dan dalam hadits tidak menyebutkan, \"Dari 'Aisyah.\""
            },
            {
                "number": 2699,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِي أَسْمَاءً أَنَا مُحَمَّدٌ وَأَنَا أَحْمَدُ وَأَنَا الْمَاحِي الَّذِي يَمْحُو اللَّهُ بِيَ الْكُفْرَ وَأَنَا الْحَاشِرُ الَّذِي يُحْشَرُ النَّاسُ عَلَى قَدَمِي وَأَنَا الْعَاقِبُ الَّذِي لَيْسَ بَعْدِي نَبِيٌّوَفِي الْبَاب عَنْ حُذَيْفَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Abdurrahman Al Makhzumi] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Muhammad bin Jubair bin Muth'im] dari [Ayahnya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku memiliki beberapa nama, aku adalah Muhammad, Ahmad, Al Mahi yang denganku Allah menghapus kekufuran, Al Hasyir (pengumpul) di mana manusia dikumpulkan di atas kakiku, Al 'Aqib (terakhir) yang tiada Nabi setelahku.\" Dalam hal ini, ada hadits serupa dari Hudzaifah. Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2700,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَجْمَعَ أَحَدٌ بَيْنَ اسْمِهِ وَكُنْيَتِهِ وَيُسَمِّيَ مُحَمَّدًا أَبَا الْقَاسِمِوَفِي الْبَاب عَنْ جَابِرٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ كَرِهَ بَعْضُ أَهْلِ الْعِلْمِ أَنْ يَجْمَعَ الرَّجُلُ بَيْنَ اسْمِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكُنْيَتِهِ وَقَدْ فَعَلَ ذَلِكَ بَعْضُهُمْ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Ibnu 'Ajlan] dari [Ayahnya] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam melarang seseorang menyatukan antara nama dan kun-yahnya (julukan) dan memberi nama Muhammad Abu Al Qasim.\" Dalam hal ini, ada hadits serupa dari Jabir. Abu Isa berkata; Hadits ini hasan shahih. Beberapa ulama memakruhkan seseorang menyatukan antara nama Nabi shallallahu 'alaihi wasallam dengan kun-yahnya, namun sebagaian lain melakukannya.\""
            },
            {
                "number": 2701,
                "arab": "رُوِيَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ سَمِعَ رَجُلًا فِي السُّوقِ يُنَادِي يَا أَبَا الْقَاسِمِ فَالْتَفَتَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَال لَمْ أَعْنِكَ فَقَال النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَكْتَنُوا بِكُنْيَتِيحَدَّثَنَا بِذَلِكَ الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ حُمَيْدٍ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا وَفِي هَذَا الْحَدِيثِ مَا يَدُلُّ عَلَى كَرَاهِيَةِ أَنْ يُكَنَّى أَبَا الْقَاسِمِ",
                "id": "Diriwayatkan dari Nabi shallallahu 'alaihi wasallam, beliau mendengar seseorang memanggil-manggil di pasar; \"Wahai Abu Al Qasim!\" Nabi shallallahu 'alaihi wasallam menoleh, lalu orang itu berkata; \"Bukan anda yang aku maksud.\" Setelah itu Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menjuluki seseorang dengan julukanku.\" Telah menceritakan kepada kami [Al Hasan bin Ali bin Khallal] seperti itu, telah menceritakan kepada kami [Yazid bin Harun] dari [Humaid] dari [Anas] dari Nabi shallallahu 'alaihi wasallam seperti di atas. Hadits ini menunjukkan makruhnya memberi kun-yah Abu Al Qasim."
            },
            {
                "number": 2702,
                "arab": "حَدَّثَنَا الْحُسَيْنُ بْنُ حُرَيْثٍ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ الْحُسَيْنِ بْنِ وَاقِدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَمَّيْتُمْ بِي فَلَا تَكْتَنُوا بِيقَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ",
                "id": "Telah menceritakan kepada kami [Al Husain bin Huraits] telah menceritakan kepada kami [Al Fadll bin Musa] dari [Al Husain bin Waqid] dari [Abu Az Zubair] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian memberi nama seperti namaku, maka janganlah memberi kun-yah (julukan) seperti kun-yahku.\" Abu Isa berkata; Hadits ini hasan gharib melalui sanad ini."
            },
            {
                "number": 2703,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ حَدَّثَنَا فِطْرُ بْنُ خَلِيفَةَ حَدَّثَنِي مُنْذِرٌ وَهُوَ الثَّوْرِيُّ عَنْ مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ أَنَّهُ قَالَيَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ وُلِدَ لِي بَعْدَكَ أُسَمِّيهِ مُحَمَّدًا وَأُكَنِّيهِ بِكُنْيَتِكَ قَالَ نَعَمْ قَالَ فَكَانَتْ رُخْصَةً لِيهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Yahya bin Sa'id Al Qaththan] telah menceritakan kepada kami [Fithr bin Khalifah] telah menceritakan kepadaku [Mundzir yaitu Ats Tsauri] dari [Muhammad bin Al Hanafiyah] dari [Ali bin Abu Thalib] dia bertanya; \"Wahai Rasulullah, bagaimana pendapat anda jika anakku lahir sepeninggalmu?, apakah aku boleh menamainya Muhammad dan memberinya kun-yah (julukan) seperti kun-yahmu?\" beliau menjawab: \"Ya.\" Ali berkata; \"Namun hal itu sebagai keringan khusus bagiku.\" Hadits ini hasan shahih."
            },
            {
                "number": 2704,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا يَحْيَى بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي غَنِيَّةَ حَدَّثَنِي أَبِي عَنْ عَاصِمٍ عَنْ زِرٍّ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ الشِّعْرِ حِكْمَةًقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ إِنَّمَا رَفَعَهُ أَبُو سَعِيدٍ الْأَشَجُّ عَنْ ابْنِ أَبِي غَنِيَّةَ وَرَوَى غَيْرُهُ عَنْ ابْنِ أَبِي غَنِيَّةَ هَذَا الْحَدِيثَ مَوْقُوفًا وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي الْبَاب عَنْ أُبَيِّ بْنِ كَعْبٍ وَابْنِ عَبَّاسٍ وَعَائِشَةَ وَبُرَيْدَةَ وَكَثِيرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ جَدِّهِ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id Al Asyaj] telah menceritakan kepada kami [Yahya bin Abdul Malik bin Abu Ghaniyyah] telah menceritakan kepada kami [Ayahku] dari ['Ashim] dari [Zirr] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya di antara (bait-bait) syair itu ada yang mengandung hikmah.\" Abu Isa berkata; Hadits ini gharib dari jalur ini, yang memarfu'kannya (menyambungkan sampai kepada nabi) hanyalah Abu Sa'id Al Asyaj dari Ibnu Abu ghaniyyah, sedangkan yang lainnya telah meriwayatkan hadits ini dari Ibnu Abu Ghaniyyah secara Mauquf. Hadits ini diriwayatkan dari selain jalur ini dari Abdullah bin Mas'ud dari Nabi shallallahu 'alaihi wasallam. Dan dalam bab ini, ada hadits dari Ubay bin Ka'ab, Ibnu Abbas, Aisyah, Buraidah dan Katsir bin Abdullah dari Ayahnya dari kakeknya."
            },
            {
                "number": 2705,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ الشِّعْرِ حِكَمًاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu 'Awanah] dari [Simak bin Harb] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya di antara (bait-bait) syair itu ada yang mengandung hikmah.\" Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2706,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُوسَى الْفَزَارِيُّ وَعَلِيُّ بْنُ حُجْرٍ الْمَعْنَى وَاحِدٌ قَالَا حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضَعُ لِحَسَّانَ مِنْبَرًا فِي الْمَسْجِدِ يَقُومُ عَلَيْهِ قَائِمًا يُفَاخِرُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ قَالَ يُنَافِحُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيَقُولُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ يُؤَيِّدُ حَسَّانَ بِرُوحِ الْقُدُسِ مَا يُفَاخِرُ أَوْ يُنَافِحُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَحَدَّثَنَا إِسْمَعِيلُ بْنُ مُوسَى وَعَلِيُّ بْنُ حُجْرٍ قَالَا حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَالْبَرَاءِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَهُوَ حَدِيثُ ابْنِ أَبِي الزِّنَادِ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Musa Al Fazari] dan [Ali bin Hujr] sedangkan maksudnya sama, keduanya berkata; telah menceritakan kepada kami [Ibnu Abu Az Zinad] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari ['Aisyah] ia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk meletakkan mimbar buat Hasan (bin Tsabit) di masjid, yaitu sebagai tempat berdirinya, dia membanggakan diri Rasulullah shallallahu 'alaihi wasallam atau membela Rasulullah shallallahu 'alaihi wasallam, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah menguatkan Hasan dengan Ruhul Qudus yang dapat membanggakan atau membela Rasulullah shallallahu 'alaihi wasallam.\" Telah menceritakan kepada kami [Isma'il bin Musa] dan [Ali bin Hujr] keduanya berkata; telah menceritakan kepada kami [Ibnu Abu Az Zinad] dari [Ayahnya] dari ['Urwah] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam dengan hadits yang semisal. Dan dalam bab ini, ada hadits dari Abu Hurairah dan Al Barra'. Abu Isa berkata; Hadits ini hasan shahih gharib, yaitu hadits Ibnu Abu Az Zinad."
            },
            {
                "number": 2707,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ حَدَّثَنَا ثَابِتٌ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ فِي عُمْرَةِ الْقَضَاءِ وَعَبْدُ اللَّهِ بْنُ رَوَاحَةَ بَيْنَ يَدَيْهِ يَمْشِي وَهُوَ يَقُولُ خَلُّوا بَنِي الْكُفَّارِ عَنْ سَبِيلِهِالْيَوْمَ نَضْرِبْكُمْ عَلَى تَنْزِيلِهِضَرْبًا يُزِيلُ الْهَامَ عَنْ مَقِيلِهِوَيُذْهِلُ الْخَلِيلَ عَنْ خَلِيلِهِفَقَالَ لَهُ عُمَرُ يَا ابْنَ رَوَاحَةَ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي حَرَمِ اللَّهِ تَقُولُ الشِّعْرَ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَلِّ عَنْهُ يَا عُمَرُ فَلَهِيَ أَسْرَعُ فِيهِمْ مِنْ نَضْحِ النَّبْلِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَقَدْ رَوَى عَبْدُ الرَّزَّاقِ هَذَا الْحَدِيثَ أَيْضًا عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ أَنَسٍ نَحْوَ هَذَا وَرُوِيَ فِي غَيْرِ هَذَا الْحَدِيثِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ فِي عُمْرَةِ الْقَضَاءِ وَكَعْبُ بْنُ مَالِكٍ بَيْنَ يَدَيْهِ وَهَذَا أَصَحُّ عِنْدَ بَعْضِ أَهْلِ الْحَدِيثِ لِأَنَّ عَبْدَ اللَّهِ بْنَ رَوَاحَةَ قُتِلَ يَوْمَ مُؤْتَةَ وَإِنَّمَا كَانَتْ عُمْرَةُ الْقَضَاءِ بَعْدَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Manshur] telah mengabarkan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ja'far bin Sulaiman] telah menceritakan kepada kami [Tsabit] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam memasuki Makkah pada saat Umratul Qadla`, sedangkan Abdullah bin Rawahah berjalan di depan beliau sambil bersyair; \"Biarkanlah orang-orang kafir pergi saat ini, kami akan menebas kalian atas kedatangan beliau, dengan tebusan yang melenyapkan kepala dari tempatnya dan yang membingungkan seorang kekasih dari kekasihnya.\" Umar berkata kepadanya; \"Wahai Ibnu Rawahah, berada di hadapan Rasulullah shallallahu 'alaihi wasallam dan di tanah haramillah (tempat yang Allah sucikan) ini kamu berani membaca sya'ir?\" Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Biarkan dia wahai Umar, syair itu lebih cepat mengenai mereka (orang-orang Kafir Quraisy) melebihi lemparan tombak.\" Abu Isa berkata; Hadits ini hasan shahih gharib dari jalur ini. Dan [Abdurrazzaq] telah meriwayatkan hadits ini dari [Ma'mar] dari [Az Zuhri] dari [Anas] dengan matan yang semakna. Riwayat lain menyebutkan bahwa Nabi shallallahu 'alaihi wasallam masuk Makkah pada saat Umratul Qadla`, sementara Ka'ab bin Malik berada di hadapan beliau.\" Dan hadits ini lebih shahih menurut sebagian ahli hadits, karena Abdullah bin Rawahah terbunuh pada saat perang Mu'tah, sedangkan Umratul Qadla` terjadi setelah peristiwa itu."
            },
            {
                "number": 2708,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا شَرِيكٌ عَنْ الْمِقْدَامِ بْنِ شُرَيْحٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَقِيلَ لَهَا هَلْ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَمَثَّلُ بِشَيْءٍ مِنْ الشِّعْرِ قَالَتْ كَانَ يَتَمَثَّلُ بِشِعْرِ ابْنِ رَوَاحَةَ وَيَتَمَثَّلُ وَيَقُولُ وَيَأْتِيكَ بِالْأَخْبَارِ مَنْ لَمْ تُزَوِّدِوَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr] telah menceritakan kepada kami [Syarik] dari [Al Miqdam bin Syuraih] dari [Ayahnya] dari ['Aisyah], (Ayah Miqdam) berkata; \"Pernah ditanyakan kepada 'Aisyah; \"Apakah Nabi shallallahu 'alaihi wasallam pernah mengucapkan sya'ir?\" 'Aisyah menjawab; \"Beliau pernah membaca sya'irnya Ibnu Rawahah dan beliau bersaya'ir dengan mengatakan: \"Dan orang yang tidak memberimu bekal datang kepadamu dengan membawa berita-berita.\" Dan dalam bab ini, ada hadits dari Ibnu Abbas. Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2709,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا شَريكٌ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَشْعَرُ كَلِمَةٍ تَكَلَّمَتْ بِهَا الْعَرَبُ كَلِمَةُ لَبِيدٍ أَلَا كُلُّ شَيْءٍ مَا خَلَا اللَّهَ بَاطِلُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَاهُ الثَّوْرِيُّ وَغَيْرُهُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr] telah mengabarkan kepada kami [Syarik] dari [Abdul Malik bin 'Umair] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Kalimat syair terbaik yang diucapkan bangsa Arab adalah kata-kata Labid, yaitu; \"Ingat, segala sesuatu selain Allah adalah batil.\" Abu Isa berkata; Hadits ini hasan shahih. [Ats Tsauri] dan lainnya meriwayatkan dari [Abdul Malik bin 'Umair]."
            },
            {
                "number": 2710,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا شَرِيكٌ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَجَالَسْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْثَرَ مِنْ مِائَةِ مَرَّةٍ فَكَانَ أَصْحَابُهُ يَتَنَاشَدُونَ الشِّعْرَ وَيَتَذَاكَرُونَ أَشْيَاءَ مِنْ أَمْرِ الْجَاهِلِيَّةِ وَهُوَ سَاكِتٌ فَرُبَّمَا تَبَسَّمَ مَعَهُمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَاهُ زُهَيْرٌ عَنْ سِمَاكٍ أَيْضًا",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr] telah mengabarkan kepada kami [Syarik] dari [Simak] dari [Jabir bin Samurah] ia berkata; Aku menemani Nabi shallallahu 'alaihi wasallam lebih dari seratus kali, para sahabat beliau menyenandungkan syair, mereka menyebut-nyebut perkara jahiliyah, sementara beliau diam, kadang beliau tersenyum bersama mereka.\" Abu Isa berkata; Hadits ini hasan shahih. [Zuhair] juga meriwayatkannya dari [Simak]."
            },
            {
                "number": 2711,
                "arab": "حَدَّثَنَا عِيسَى بْنُ عُثْمَانَ بْنِ عِيسَى الرَّمْلِيُّ حَدَّثَنَا عَمِّي يَحْيَى بْنُ عِيسَى عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَنْ يَمْتَلِئَ جَوْفُ أَحَدِكُمْ قَيْحًا يَرِيَهُ خَيْرٌ لَهُ مِنْ أَنْ يَمْتَلِئَ شِعْرًاوَفِي الْبَاب عَنْ سَعْدٍ وَأَبِي سَعِيدٍ وَابْنِ عُمَرَ وَأَبِي الدَّرْدَاءِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Isa bin Utsman bin Isa Ar Ramli] telah menceritakan kepada kami pamanku yaitu [Yahya bin Isa] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perut seseorang penuh dengan nanah yang berbau busuk itu lebih baik daripada penuh dengan bait-bait sya'ir.\" Dalam hal ini, ada hadits serupa dari Sa'd, Abu Sa'id, Ibnu Umar dan Abu Ad Darda`. Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2712,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ يُونُسَ بْنِ جُبَيْرٍ عَنْ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَاصٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَنْ يَمْتَلِئَ جَوْفُ أَحَدِكُمْ قَيْحًا خَيْرٌ لَهُ مِنْ أَنْ يَمْتَلِئَ شِعْرًاقَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah mengabarkan kepada kami [Yahya bin Sa'id] dari [Syu'bah] dari [Qatadah] dari [Yunus bin Jubair] dari [Muhammad bin Sa'd bin Abu Waqqash] dari [Ayahnya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perut seseorang penuh dengan nanah yang berbau busuk itu lebih baik daripada penuh dengan bait-bait sya'ir.\" Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2713,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ الْمُقَدَّمِيُّ حَدَّثَنَا نَافِعُ بْنُ عُمَرَ الْجُمَحِيُّ عَنْ بِشْرِ بْنِ عَاصِمٍ سَمِعَهُ يُحَدِّثُ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ يَبْغَضُ الْبَلِيغَ مِنْ الرِّجَالِ الَّذِي يَتَخَلَّلُ بِلِسَانِهِ كَمَا تَتَخَلَّلُ الْبَقَرَةُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَفِي الْبَاب عَنْ سَعْدٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul A'la Ash Shan'ani] telah menceritakan kepada kami [Umar bin Ali Al Muqaddami] telah menceritakan kepada kami [Nafi' bin Umar Al Jumahi] dari [Bisyr bin 'Ashim] dia telah mendengarnya bercerita dari [Ayahnya] dari [Abdullah bin 'Amru] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah membenci para tukang syair yang memainkan lidahnya, sebagaimana sapi memainkan lidahnya.\" Abu Isa berkata; dari jalur ini, hadits ini hasan gharib. Dan dalam bab ini, ada juga hadits dari Sa'd."
            },
            {
                "number": 2714,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مُوسَى الْأَنْصَارِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ عَبْدِ الْجَبَّارِ بْنِ عُمَرَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنَامَ الرَّجُلُ عَلَى سَطْحٍ لَيْسَ بِمَحْجُورٍ عَلَيْهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مِنْ حَدِيثِ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ إِلَّا مِنْ هَذَا الْوَجْهِ وَعَبْدُ الْجَبَّارِ بْنُ عُمَرَ يُضَعَّفُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Musa Al Anshari] telah menceritakan kepada kami [Abdullah bin Wahab] dari [Abdul Jabbar bin Umar] dari [Muhammad bin Al Munkadir] dari [Jabir] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang seseorang tidur di atas atap yang tidak ada pelindungnya (pembatas sekelilingnya).\" Abu Isa berkata; Hadits ini gharib, kami tidak mengetahuinya dari hadits Muhammad bin Al Munkadir dari Jabir kecuali dari jalur ini, sedangkan Abdul Jabbar bin Umar dinyatakan lemah."
            },
            {
                "number": 2715,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَخَوَّلُنَا بِالْمَوْعِظَةِ فِي الْأَيَّامِ مَخَافَةَ السَّآمَةِ عَلَيْنَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا سُفْيَانُ عَنْ الْأَعْمَشِ حَدَّثَنِي شَقِيقُ بْنُ سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Ahmad] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] dari [Abu Wa`il] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam memberi kami nasehat pada hari-hari (tertentu) karena khawatir kami jemu.\" Abu Isa berkata; Hadits ini hasan shahih. Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Sufyan] dari [Al A'masy] telah menceritakan kepadaku [Syaqiq bin Salamah] dari [Abdullah bin Mas'ud] seperti hadits di atas."
            },
            {
                "number": 2716,
                "arab": "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ قَالَسُئِلَتْ عَائِشَةُ وَأُمُّ سَلَمَةَ أَيُّ الْعَمَلِ كَانَ أَحَبَّ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتَا مَا دِيمَ عَلَيْهِ وَإِنْ قَلَّقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَانَ أَحَبُّ الْعَمَلِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا دِيمَ عَلَيْهِ حَدَّثَنَا بِذَلِكَ هَارُونُ بْنُ إِسْحَقَ الْهَمْدَانِيُّ حَدَّثَنَا عَبْدَةُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ بِمَعْنَاهُ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Abu Hisyam Ar Rifa'I] telah menceritakan kepada kami [Ibnu Fudlail] dari [Al A'masy] dari [Abu Shalih] ia berkata; ['Aisyah] dan [Ummu Salamah] pernah ditanya tentang amalan apakah yang paling disukai Rasulullah shallallahu 'alaihi wasallam?\" keduanya menjawab; \"Amalan yang dilakkukan secara terus menerus sekalipun sedikit.\" Abu Isa berkata; Dari jalur ini, hadits ini hasan gharib. Dan telah diriwayatkan dari [Hisyam bin 'Urwah] dari [Ayahnya] dari ['Aisyah] bahwa dia berkata; \"Amalan yang paling disukai oleh Rasulullah shallallahu 'alaihi wasallam adalah yang dikerjakan secara terus menerus.\" [Harun bin Ishaq Al Hamdani] telah menceritakan yang demikian kepada kami, telah menceritakan kepada kami ['Abdah] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari ['Aisyah] dari Nabi shallallahu 'alaihi wasallam dengan matan hadits yang semakna dengannya, hadits ini hasan shahih."
            },
            {
                "number": 2717,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ كَثِيرِ بْنِ شِنْظِيرٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمِّرُوا الْآنِيَةَ وَأَوْكِئُوا الْأَسْقِيَةَ وَأَجِيفُوا الْأَبْوَابَ وَأَطْفِئُوا الْمَصَابِيحَ فَإِنَّ الْفُوَيْسِقَةَ رُبَّمَا جَرَّتْ الْفَتِيلَةَ فَأَحْرَقَتْ أَهْلَ الْبَيْتِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Hammad bin Zaid] dari [Katsir bin Syindzir] dari ['Atha` bin Abu Rabah] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tutuplah bejana-bejana kelian, tempat-tempat air kalian, dan pintu-pintu kalian serta padamkan lampu-lampu kalian, karena bisa jadi tikus menyeret sumbu lampu, lalu membakar penghuni rumah.\" Abu Isa berkata; Hadits ini hasan shahih. Diriwayatkan melalui sanad lain dari Jabir dari Nabi shallallahu 'alaihi wasallam."
            },
            {
                "number": 2718,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا سَافَرْتُمْ فِي الْخِصْبِ فَأَعْطُوا الْإِبِلَ حَظَّهَا مِنْ الْأَرْضِ وَإِذَا سَافَرْتُمْ فِي السَّنَةِ فَبَادِرُوا بِهَا نِقْيَهَا وَإِذَا عَرَّسْتُمْ فَاجْتَنِبُوا الطَّرِيقَ فَإِنَّهَا طُرُقُ الدَّوَابِّ وَمَأْوَى الْهَوَامِّ بِاللَّيْلِقَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ جَابِرٍ وَأَنَسٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Aiziz bin Muhammad] dari [Suhail bin Abu Shalih] dari [Ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian bepergian dimusim banyak rumput dan tanaman, maka berikanlah hak unta (untuk memakan tanaman dan rerumputan) bumi, dan apabila kalian bepergian saat kemarau, percepatlah kekuatannya dan bila kalian istirahat di akhir malam, jauhilah jalanan, karena jalanan merupakan jalan hewan dan tempat binatang beracun di malam hari.\" Abu Isa berkata; Hadits ini hasan shahih. Dalam hal ini ada hadits serupa dari Jabir dan Anas."
            },
            {
                "number": 2719,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ عَنْ بَحِيرِ بْنِ سَعْدٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ النَّوَّاسِ بْنِ سَمْعَانَ الْكِلَابِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ ضَرَبَ مَثَلًا صِرَاطًا مُسْتَقِيمًا عَلَى كَنَفَيْ الصِّرَاطِ زُورَانِ لَهُمَا أَبْوَابٌ مُفَتَّحَةٌ عَلَى الْأَبْوَابِ سُتُورٌ وَدَاعٍ يَدْعُو عَلَى رَأْسِ الصِّرَاطِ وَدَاعٍ يَدْعُو فَوْقَهُ{ وَاللَّهُ يَدْعُوا إِلَى دَارِ السَّلَامِ وَيَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ }وَالْأَبْوَابُ الَّتِي عَلَى كَنَفَيْ الصِّرَاطِ حُدُودُ اللَّهِ فَلَا يَقَعُ أَحَدٌ فِي حُدُودِ اللَّهِ حَتَّى يُكْشَفَ السِّتْرُ وَالَّذِي يَدْعُو مِنْ فَوْقِهِ وَاعِظُ رَبِّهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ قَالَ سَمِعْت عَبْدَ اللَّهِ بْنَ عَبْدِ الرَّحْمَنِ يَقُولُ سَمِعْتُ زَكَرِيَّا بْنَ عَدِيٍّ يَقُولُ قَالَ أَبُو إِسْحَقَ الْفَزَارِيُّ خُذُوا عَنْ بَقِيَّةَ مَا حَدَّثَكُمْ عَنْ الثِّقَاتِ وَلَا تَأْخُذُوا عَنْ إِسْمَعِيلَ بْنِ عَيَّاشٍ مَا حَدَّثَكُمْ عَنْ الثِّقَاتِ وَلَا غَيْرِ الثِّقَاتِ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr As Sa'di] telah menceritakan kepada kami [Baqiyah bin Al Walid] dari [Bahir bin Sa'd] dari [Khalid bin Ma'dan] dari [Jubair bin Nufair] dari [An Nawwas bin Sam'an Al Kilabi] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah membuat perumpamaan jalan yang lurus, di atas dua tepi jalan ada dua tembok, pada keduanya ada beberapa pintu terbuka, pintu-pintu itu bertirai dan disetiap penghujung jalan ada penyeru yang meyeru manusia dan penyeru yang menyeru di atasnya Dan Allah menyeru menuju negeri keselamatan, memberi petunjuk kepada siapa saja yang Ia kehendaki menuju jalan yang lurus. QS Yunus; 25 Pintu-pintu yang ada di sisi jalan adalah batasan-batasan Allah, karenanya janganlah ada seorang pun yang jatuh di batasan-batasan Allah hingga tirai terbuka, sementara yang menyeru dari atasnya adalah penyeru Rabbnya.\" Abu Isa berkata; Hadits ini hasan gharib. Ia berkata; Aku mendengar Abdullah bin Abdurrahman berkata; Aku mendengar Zakariya bin Adi berkata; Abu Ishaq Al Fazari berkata; \"Ambillah hadits yang disampaikan oleh para perawi tsiqah yang masih ada, dan jangan mengambil hadits yang disampaikan Isma'il bin Ayyasy, baik dari para perawi tsiqah atau bukan tsiqah.\""
            },
            {
                "number": 2720,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ خَالِدِ بْنِ يَزِيدَ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ الْأَنْصَارِيَّ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا فَقَالَ إِنِّي رَأَيْتُ فِي الْمَنَامِ كَأَنَّ جِبْرِيلَ عِنْدَ رَأْسِي وَمِيكَائِيلَ عِنْدَ رِجْلَيَّ يَقُولُ أَحَدُهُمَا لِصَاحِبِهِ اضْرِبْ لَهُ مَثَلًا فَقَالَ اسْمَعْ سَمِعَتْ أُذُنُكَ وَاعْقِلْ عَقَلَ قَلْبُكَ إِنَّمَا مَثَلُكَ وَمَثَلُ أُمَّتِكَ كَمَثَلِ مَلِكٍ اتَّخَذَ دَارًا ثُمَّ بَنَى فِيهَا بَيْتًا ثُمَّ جَعَلَ فِيهَا مَائِدَةً ثُمَّ بَعَثَ رَسُولًا يَدْعُو النَّاسَ إِلَى طَعَامِهِ فَمِنْهُمْ مَنْ أَجَابَ الرَّسُولَ وَمِنْهُمْ مَنْ تَرَكَهُ فَاللَّهُ هُوَ الْمَلِكُ وَالدَّارُ الْإِسْلَامُ وَالْبَيْتُ الْجَنَّةُ وَأَنْتَ يَا مُحَمَّدُ رَسُولٌ فَمَنْ أَجَابَكَ دَخَلَ الْإِسْلَامَ وَمَنْ دَخَلَ الْإِسْلَامَ دَخَلَ الْجَنَّةَ وَمَنْ دَخَلَ الْجَنَّةَ أَكَلَ مَا فِيهَاوَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِإِسْنَادٍ أَصَحَّ مِنْ هَذَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ مُرْسَلٌ سَعِيدُ بْنُ أَبِي هِلَالٍ لَمْ يُدْرِكْ جَابِرَ بْنَ عَبْدِ اللَّهِ وَفِي الْبَاب عَنْ ابْنِ مَسْعُودٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Khalid bin Yazid] dari [Sa'id bin Abu Hilal] bahwa [Jabir bin Abdullah Al Anshari] berkata; \"Pada suatu hari, Rasulullah shallallahu 'alaihi wasallam keluar menemui kami, beliau bersabda: \"Sesungguhnya aku bermimpi seakan-akan Jibril berada di sisi kepalaku, sedangkan Mika'il berada di sisi kakiku, salah satu dari keduanya berkata kepada yang lain; \"Buatlah perumpamaan baginya, \" dia berkata; \"Dengarkanlah pasti telingamu mendengar dan fahamilah pasti hatimu memahami, perumpamaanmu dengan ummatmu seperti seorang raja yang hendak membuat istana, dan didalamnya dibangun rumah, setelah membangun rumah, dia menyiapkan jamuan makan dalam rumah tersebut, lalu dia menyuruh seorang utusan untuk mengundang rakyat agar menghadiri jamuannya, di antara mereka ada yang memenuhi undangan utusan tadi dan di antara mereka ada yang meninggalkannya, Allah sebagai rajanya, istana sebagai Islamnya, rumah sebagai surganya dan engkau wahai Muhammad adalah sebagai seorang utusannya, barangsiapa yang memenuhi undanganmu berarti dia masuk Islam, dan barangsiapa masuk Islam, berarti akan masuk surga dan barangsiapa masuk surga, berarti dia memakan apa yang ada di dalamnya.\" Hadits ini telah diriwayatkan dari beberapa jalur dari Nabi shallallahu 'alaihi wasallam dengan sanad yang lebih kuat dari sanad hadits ini. Abu Isa berkata; Hadits ini mursal, karena Sa'id bin Abu Hilal tidak bertemu dengan Jabir bin Abdullah. Dan dalam bab ini, ada juga hadits dari Ibnu Mas'ud."
            },
            {
                "number": 2721,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ عَنْ جَعْفَرِ بْنِ مَيْمُونٍ عَنْ أَبِي تَمِيمَةَ الْهُجَيْمِيِّ عَنْ أَبِي عُثْمَانَ عَنْ ابْنِ مَسْعُودٍ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعِشَاءَ ثُمَّ انْصَرَفَ فَأَخَذَ بِيَدِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ حَتَّى خَرَجَ بِهِ إِلَى بَطْحَاءِ مَكَّةَ فَأَجْلَسَهُ ثُمَّ خَطَّ عَلَيْهِ خَطًّا ثُمَّ قَالَ لَا تَبْرَحَنَّ خَطَّكَ فَإِنَّهُ سَيَنْتَهِي إِلَيْكَ رِجَالٌ فَلَا تُكَلِّمْهُمْ فَإِنَّهُمْ لَا يُكَلِّمُونَكَ قَالَ ثُمَّ مَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَيْثُ أَرَادَ فَبَيْنَا أَنَا جَالِسٌ فِي خَطِّي إِذْ أَتَانِي رِجَالٌ كَأَنَّهُمْ الزُّطُّ أَشْعَارُهُمْ وَأَجْسَامُهُمْ لَا أَرَى عَوْرَةً وَلَا أَرَى قِشْرًا وَيَنْتَهُونَ إِلَيَّ وَلَا يُجَاوِزُونَ الْخَطَّ ثُمَّ يَصْدُرُونَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا كَانَ مِنْ آخِرِ اللَّيْلِ لَكِنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ جَاءَنِي وَأَنَا جَالِسٌ فَقَالَ لَقَدْ أَرَانِي مُنْذُ اللَّيْلَةَ ثُمَّ دَخَلَ عَلَيَّ فِي خَطِّي فَتَوَسَّدَ فَخِذِي فَرَقَدَ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَقَدَ نَفَخَ فَبَيْنَا أَنَا قَاعِدٌ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَوَسِّدٌ فَخِذِي إِذَا أَنَا بِرِجَالٍ عَلَيْهِمْ ثِيَابٌ بِيضٌ اللَّهُ أَعْلَمُ مَا بِهِمْ مِنْ الْجَمَالِ فَانْتَهَوْا إِلَيَّ فَجَلَسَ طَائِفَةٌ مِنْهُمْ عِنْدَ رَأْسِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَطَائِفَةٌ مِنْهُمْ عِنْدَ رِجْلَيْهِ ثُمَّ قَالُوا بَيْنَهُمْ مَا رَأَيْنَا عَبْدًا قَطُّ أُوتِيَ مِثْلَ مَا أُوتِيَ هَذَا النَّبِيُّ إِنَّ عَيْنَيْهِ تَنَامَانِ وَقَلْبُهُ يَقْظَانُ اضْرِبُوا لَهُ مَثَلًا مَثَلُ سَيِّدٍ بَنَى قَصْرًا ثُمَّ جَعَلَ مَأْدُبَةً فَدَعَا النَّاسَ إِلَى طَعَامِهِ وَشَرَابِهِ فَمَنْ أَجَابَهُ أَكَلَ مِنْ طَعَامِهِ وَشَرِبَ مِنْ شَرَابِهِ وَمَنْ لَمْ يُجِبْهُ عَاقَبَهُ أَوْ قَالَ عَذَّبَهُ ثُمَّ ارْتَفَعُوا وَاسْتَيْقَظَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ ذَلِكَ فَقَالَ سَمِعْتَ مَا قَالَ هَؤُلَاءِ وَهَلْ تَدْرِي مَنْ هَؤُلَاءِ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ هُمْ الْمَلَائِكَةُ فَتَدْرِي مَا الْمَثَلُ الَّذِي ضَرَبُوا قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ الْمَثَلُ الَّذِي ضَرَبُوا الرَّحْمَنُ تَبَارَكَ وَتَعَالَى بَنَى الْجَنَّةَ وَدَعَا إِلَيْهَا عِبَادَهُ فَمَنْ أَجَابَهُ دَخَلَ الْجَنَّةَ وَمَنْ لَمْ يُجِبْهُ عَاقَبَهُ أَوْ عَذَّبَهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَأَبُو تَمِيمَةَ هُوَ الْهُجَيْمِيُّ وَاسْمُهُ طَرِيفُ بْنُ مُجَالِدٍ وَأَبُو عُثْمَانَ النَّهْدِيُّ اسْمُهُ عَبْدُ الرَّحْمَنِ بْنُ مُلٍّ وَسُلَيْمَانُ التَّيْمِيُّ قَدْ رَوَى هَذَا الْحَدِيثَ عَنْهُ مُعْتَمِرٌ وَهُوَ سُلَيْمَانُ بْنُ طَرْخَانَ وَلَمْ يَكُنْ تَيْمِيًّا وَإِنَّمَا كَانَ يَنْزِلُ بَنِي تَيْمٍ فَنُسِبَ إِلَيْهِمْ قَالَ عَلِيٌّ قَالَ يَحْيَى بْنُ سَعِيدٍ مَا رَأَيْتُ أَخْوَفَ لِلَّهِ تَعَالَى مِنْ سُلَيْمَانَ التَّيْمِيِّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Abu Adi] dari [Ja'far bin Maymun] dari [Abu Tamimah Al Hujaimi] dari [Abu Utsman] dari [Ibnu Mas'ud] ia berkata; \"Seusai Rasulullah shallallahu 'alaihi wasallam sholat isya, beliau keluar sambil memegang tangan Abdullah bin Mas'ud, ketika sampai di suatu lembah makkah, beliau mendudukkannya kemudian membuat garis lingkaran di sekitarnya lalu bersabda: \"Janganlah kamu meninggalkan garismu, karena akan datang kepadamu beberapa orang dan janganlah kamu mengajak bicara kepada mereka, karena sesungguhnya mereka tidak mengajak bicara denganmu, \" Ibnu Mas'ud berkata; lalu Rasulullah shallallahu 'alaihi wasallam berlalu ke tempat yang beliau tuju, ketika aku sedang duduk di garisku, tiba-tiba datanglah kepadaku beberapa orang, seakan-akan mereka adalah orang-orang hitam India yang rambut dan tubuh mereka tidak terlihat, tapi tidak memakai kain penutup, mereka menghampiriku namun tidak bisa melewati garis, setelah itu mereka kembali kepada Rasulullah shallallahu 'alaihi wasallam, sampai ketika di akhir malam, Rasulullah shallallahu 'alaihi wasallam mendatangiku, sementara saya dalam keadaan duduk, lalu beliau bersabda: \"Sejak tadi malam aku tidak tidur, \" kemudian beliau masuk ke dalam garis bersamaku dan menjadikan pahaku untuk bantalnya lalu beliau tertidur. Jika Rasulullah shallallahu 'alaihi wasallam tidur, maka tarikan nafasnya terdengar. Ketika aku sedang duduk sementara Rasulullah shallallahu 'alaihi wasallam berbantalkan pahaku, tiba-tiba saya melihat beberapa orang dengan mengenakan pakaian serba putih, hanya Allah yang tahu akan keindahan mereka, mereka menghampiriku, sedangkan sebagian dari mereka duduk di sisi kepala Rasulullah shallallahu 'alaihi wasallam dan sebagian yang lainnya di sisi kaki beliau, lalu mereka berkata kepada sesamanya: \"Kita tidak pernah sama sekali melihat seorang hamba yang diberi sebagaimana yang diberikan kepada Nabi ini, sungguh kedua matanya tertidur sementara hatinya terjaga, buatlah oleh kalian permisalan untuknya, permisalannya seperti seorang tuan yang membangun istana, kemudian membuat jamuan makan, setelah itu ia mengundang orang-orang untuk menghadiri jamuan makan dan minumnya, barangsiapa memenuhi undangannya maka dia makan dan minum jamuan makanan dan minumannya, dan barangsiapa tidak memenuhi undangannya, maka dia akan memberinya sanksi, atau dia berkata; maka dia akan menyiksanya.\" kemudian mereka pergi, ketika itu Rasulullah shallallahu 'alaihi wasallam terjaga dari tidurnya, lalu beliau bertanya: \"Apakah kamu mendengar apa yang mereka katakan dan apakah kamu tahu siapa mereka?\" Aku menjawab; \"Allah dan RasulNya yang lebih tahu, \" beliau bersabda: \"Mereka adalah para Malaikat, kemudian apakah kamu tahu apa permisalan yang mereka buat?\" aku menjawab; \"Allah dan Rasul-Nya yang lebih tahu, \" beliau bersabda: \"Permisalan yang mereka buat adalah Allah yang Maha pemurah dan Maha Tinggi telah membangum surga dan menyeru hamba-hambaNya menuju surga, barangsiapa menjawab seruanNya, dia masuk surga dan barangsiapa tidak menjawabnya, Dia akan memberinya sanksi atau menyiksanya.\" Abu Isa berkata; Hadits ini hasan shahih gharib dari jalur ini, Abu Tamimah adalah Al Juhani, namanya adalah Tharif bin Mujalid, Abu Utsman An Nahdi namanya adalah Abdurrahman bin Mull. Hadits [Sulaiman At Taimi] telah meriwayatkan hadits ini darinya [Mu'tamir] dan dia adalah Sulaiman bin Tharkhan, bukan Taimi namun dia pernah singgah di Bani Taim sehingga dia dinisbahkan kepadanya. Ali berkata bahwa Yahya bin Sa'id berkata; \"Aku tidak pernah melihat orang yang lebih takut kepada Allah melebihi Sulaiman At Taimi.\""
            },
            {
                "number": 2722,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا مُحَمَّدُ بْنِ سِنَانٍ حَدَّثَنَا سَلِيمُ بْنُ حَيَّانَ بَصْرِيٌّ حَدَّثَنَا سَعِيدُ بْنُ مِينَاءَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا مَثَلِي وَمَثَلُ الْأَنْبِيَاءِ قَبْلِي كَرَجُلٍ بَنَى دَارًا فَأَكْمَلَهَا وَأَحْسَنَهَا إِلَّا مَوْضِعَ لَبِنَةٍ فَجَعَلَ النَّاسُ يَدْخُلُونَهَا وَيَتَعَجَّبُونَ مِنْهَا وَيَقُولُونَ لَوْلَا مَوْضِعُ اللَّبِنَةِوَفِي الْبَاب عَنْ أُبَيِّ بْنِ كَعْبٍ وَأَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Muhammad bin Sinan] telah menceritakan kepada kami [Sulaim bin Hayyan Bashri] telah menceritakan kepada kami [Sa'id bin Mina`] dari [Jabir bin Abdullah] ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya perumpamaanku dengan para nabi sebelumku seperti seseorang yang membangun rumah, lalu ia menyelesaikan dan memperindahnya kecuali satu tempat batu bata yang kurang, lalu orang-orang memasukinya dan mereka terkesima karenanya, mereka berkata; \"Andai bukan karena satu tempat batu bata.\" Abu Isa berkata; Dalam hal ini, ada hadits serupa dari Ubay bin Ka'ab dan Abu Hurairah. Abu Isa berkata; Hadits ini hasan shahih gharib dari jalur ini."
            },
            {
                "number": 2723,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ زَيْدِ بْنِ سَلَّامٍ أَنَّ أَبَا سَلَّامٍ حَدَّثَهُ أَنَّ الْحَارِثَ الْأَشْعَرِيَّ حَدَّثَهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ أَمَرَ يَحْيَى بْنَ زَكَرِيَّا بِخَمْسِ كَلِمَاتٍ أَنْ يَعْمَلَ بِهَا وَيَأْمُرَ بَنِي إِسْرَائِيلَ أَنْ يَعْمَلُوا بِهَا وَإِنَّهُ كَادَ أَنْ يُبْطِئَ بِهَا فَقَالَ عِيسَى إِنَّ اللَّهَ أَمَرَكَ بِخَمْسِ كَلِمَاتٍ لِتَعْمَلَ بِهَا وَتَأْمُرَ بَنِي إِسْرَائِيلَ أَنْ يَعْمَلُوا بِهَا فَإِمَّا أَنْ تَأْمُرَهُمْ وَإِمَّا أَنْ آمُرَهُمْ فَقَالَ يَحْيَى أَخْشَى إِنْ سَبَقْتَنِي بِهَا أَنْ يُخْسَفَ بِي أَوْ أُعَذَّبَ فَجَمَعَ النَّاسَ فِي بَيْتِ الْمَقْدِسِ فَامْتَلَأَ الْمَسْجِدُ وَتَعَدَّوْا عَلَى الشُّرَفِ فَقَالَ إِنَّ اللَّهَ أَمَرَنِي بِخَمْسِ كَلِمَاتٍ أَنْ أَعْمَلَ بِهِنَّ وَآمُرَكُمْ أَنْ تَعْمَلُوا بِهِنَّ أَوَّلُهُنَّ أَنْ تَعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا وَإِنَّ مَثَلَ مَنْ أَشْرَكَ بِاللَّهِ كَمَثَلِ رَجُلٍ اشْتَرَى عَبْدًا مِنْ خَالِصِ مَالِهِ بِذَهَبٍ أَوْ وَرِقٍ فَقَالَ هَذِهِ دَارِي وَهَذَا عَمَلِي فَاعْمَلْ وَأَدِّ إِلَيَّ فَكَانَ يَعْمَلُ وَيُؤَدِّي إِلَى غَيْرِ سَيِّدِهِ فَأَيُّكُمْ يَرْضَى أَنْ يَكُونَ عَبْدُهُ كَذَلِكَ وَإِنَّ اللَّهَ أَمَرَكُمْ بِالصَّلَاةِ فَإِذَا صَلَّيْتُمْ فَلَا تَلْتَفِتُوا فَإِنَّ اللَّهَ يَنْصِبُ وَجْهَهُ لِوَجْهِ عَبْدِهِ فِي صَلَاتِهِ مَا لَمْ يَلْتَفِتْ وَآمُرُكُمْ بِالصِّيَامِ فَإِنَّ مَثَلَ ذَلِكَ كَمَثَلِ رَجُلٍ فِي عِصَابَةٍ مَعَهُ صُرَّةٌ فِيهَا مِسْكٌ فَكُلُّهُمْ يَعْجَبُ أَوْ يُعْجِبُهُ رِيحُهَا وَإِنَّ رِيحَ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ وَآمُرُكُمْ بِالصَّدَقَةِ فَإِنَّ مَثَلَ ذَلِكَ كَمَثَلِ رَجُلٍ أَسَرَهُ الْعَدُوُّ فَأَوْثَقُوا يَدَهُ إِلَى عُنُقِهِ وَقَدَّمُوهُ لِيَضْرِبُوا عُنُقَهُ فَقَالَ أَنَا أَفْدِيهِ مِنْكُمْ بِالْقَلِيلِ وَالْكَثِيرِ فَفَدَى نَفْسَهُ مِنْهُمْ وَآمُرُكُمْ أَنْ تَذْكُرُوا اللَّهَ فَإِنَّ مَثَلَ ذَلِكَ كَمَثَلِ رَجُلٍ خَرَجَ الْعَدُوُّ فِي أَثَرِهِ سِرَاعًا حَتَّى إِذَا أَتَى عَلَى حِصْنٍ حَصِينٍ فَأَحْرَزَ نَفْسَهُ مِنْهُمْ كَذَلِكَ الْعَبْدُ لَا يُحْرِزُ نَفْسَهُ مِنْ الشَّيْطَانِ إِلَّا بِذِكْرِ اللَّهِ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا آمُرُكُمْ بِخَمْسٍ اللَّهُ أَمَرَنِي بِهِنَّ السَّمْعُ وَالطَّاعَةُ وَالْجِهَادُ وَالْهِجْرَةُ وَالْجَمَاعَةُ فَإِنَّهُ مَنْ فَارَقَ الْجَمَاعَةَ قِيدَ شِبْرٍ فَقَدْ خَلَعَ رِبْقَةَ الْإِسْلَامِ مِنْ عُنُقِهِ إِلَّا أَنْ يَرْجِعَ وَمَنْ ادَّعَى دَعْوَى الْجَاهِلِيَّةِ فَإِنَّهُ مِنْ جُثَا جَهَنَّمَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ وَإِنْ صَلَّى وَصَامَ قَالَ وَإِنْ صَلَّى وَصَامَ فَادْعُوا بِدَعْوَى اللَّهِ الَّذِي سَمَّاكُمْ الْمُسْلِمِينَ الْمُؤْمِنِينَ عِبَادَ اللَّهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ قَالَ مُحَمَّدُ بْنُ إِسْمَعِيلَ الْحَارِثُ الْأَشْعَرِيُّ لَهُ صُحْبَةٌ وَلَهُ غَيْرُ هَذَا الْحَدِيثِ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ زَيْدِ بْنِ سَلَّامٍ عَنْ أَبِي سَلَّامٍ عَنْ الْحَارِثِ الْأَشْعَرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ بِمَعْنَاهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَأَبُو سَلَّامٍ الْحَبَشِيُّ اسْمُهُ مَمْطُورٌ وَقَدْ رَوَاهُ عَلِيُّ بْنُ الْمُبَارَكِ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Aban bin Yazid] telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Zaid bin Sallam] bahwa [Abu Sallam] telah menceritakan kepadanya bahwa [Al Harits Al Asy'ari] telah menceritakan kepadanya bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah memerintahkan lima kalimat kepada Yahya bin Zakariya agar diamalkan dan memerintahkan Bani Israil supaya mengamalkannya, dan sesungguhnya ia hampir saja memperlambatnya. Isa berkata; \"Sesungguhnya Allah memerintahkan lima kalimat padamu agar kamu amalkan dan agar Bani Israil kamu perintahkan untuk mengamalkannya, perintahlah mereka atau aku yang memerintah mereka.\" Yahya menjawab; \"Aku khawatir bila kamu mendahuluiku menyampaikannya, aku akan dibenamkan atau disiksa.\" Isa kemudian mengumpulkan manusia di Baitul Maqdis, masjid penuh sesak hingga ke teras, Isa berkata; \"Sesungguhnya Allah memerintahkanku lima kalimat agar aku amalkan dan aku perintahkan kalian untuk mengamalkannya, pertama; sembahlah Allah dan jangan menyekutukanNya dengan sesuatu pun, sesungguhnya perumpamaan orang yang menyekutukan Allah sama seperti seseorang membeli budak dengan uang emas atau perak lalu ia berkata; Ini rumahku dan ini pekerjaanku, bekerjalah dan tunaikan untukku. Tapi budak itu malah bekerja dan menunaikan untuk orang lain, siapa di antara kalian yang mau budaknya seperti itu? Sesungguhnya Allah memerintahkan sholat pada kalian, bila kalian sholat, maka janganlah menoleh, karena Allah menghadapkankan wajah-Nya ke wajah hambaNya saat sholat, selama ia tidak menoleh. Aku memerintahkan kalian puasa, dan perumpamaannya seperti seseorang berada di tengah-tengah sekelompok orang, ia membawa kantong berisi minyak kesturi, kalian semua kagum atau semerbak baunya mengagumkan, seseungguhnya bau (mulut) orang yang berpuasa lebih harum bagi Allah melebihi minyak kesturi, aku juga memerintahkan kalian bersedekah, perumpamaannya seperti seseorang yang ditawan musuh, mereka membelenggu tangannya ke leher, mereka lalu memajukannya untuk ditebas lehernya, kemudian ia berkata; \"Aku menebusnya dari kalian dengan yang sedikit dan yang banyak, \" lalu tawanan tersebut menebus dirinya dari mereka. Aku memerintahkan kalian untuk mengingat Allah, sesungguhnya perumpamaannya seperti seseorang yang dikejar musuh dengan cepat, hingga ketika tiba di benteng yang kokoh, ia menjaga dirinya dari mereka, demikian halnya hamba, ia tidak menjaga diri dari setan kecuali dengan mengingat Allah.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Dan aku memerintahkan lima hal pada kalian yang diperintahkan Allah padaku, yaitu; mendengar, taat, jihad, hijrah dan jama'ah, sebab barangsiapa meninggalkan jama'ah barang sejengkal, maka ia telah melepas tali Islam dari lehernya, kecuali jika ia kembali. Dan barangsiapa menyerukan seruan jahiliyah, maka ia termasuk bangkai neraka jahanam.\" Seseorang bertanya; \"Wahai Rasulullah, meski ia sholat dan puasa?\" Beliau menjawab: \"Meski ia sholat dan puasa, oleh karena itu, serukanlah seruan Allah yang menyebut kalian sebagai kaum muslimin, mu`minin dan hamba-hamba Allah.\" Abu Isa berkata; Hadits ini hasan shahih gharib. Abu Isa berkata; Muhammad bin Isam'il Al Harits Al Asy'ari pernah bertemu Nabi shallallahu 'alaihi wasallam dan ia memiliki hadits lain selain hadits ini. Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu Dawud Ath Thayalisi] telah menceritakan kepada kami [Aban bin Yazid] dari [Yahya bin Abu Katsir] dari [Zaid bin Sallam] dari [Abu Sallam] dari [Al Harits Al Asy'ari] dari Nabi shallallahu 'alaihi wasallam seperti di atas dengan maksud yang sama.\" Abu Isa berkata; Hadits ini hasan shahih gharib, dan Abu Sallam Al Habasyi namanya adalah Mamthur. [Ali bin Al Mubarak] telah meriwayatkan hadits ini dari [Yahya bin Abu Katsir]."
            },
            {
                "number": 2724,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْمُؤْمِنِ الَّذِي يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْأُتْرُنْجَةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا طَيِّبٌ وَمَثَلُ الْمُؤْمِنِ الَّذِي لَا يَقْرَأُ الْقُرْآنَ كَمَثَلِ التَّمْرَةِ لَا رِيحَ لَهَا وَطَعْمُهَا حُلْوٌ وَمَثَلُ الْمُنَافِقِ الَّذِي يَقْرَأُ الْقُرْآنَ كَمَثَلِ الرَّيْحَانَةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا مُرٌّ وَمَثَلُ الْمُنَافِقِ الَّذِي لَا يَقْرَأُ الْقُرْآنَ كَمَثَلِ الْحَنْظَلَةِ رِيحُهَا مُرٌّ وَطَعْمُهَا مُرٌّقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَاهُ شُعْبَةُ عَنْ قَتَادَةَ أَيْضًا",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Anas] dari [Abu Musa Al Asy'ari] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perumpamaan orang mu`min yang membaca al-Qur`an seperti buah utrujah, baunya harum dan rasanya enak, sedangkan perumpamaan orang mu`min yang tidak membaca al-Qur`an seperti buah kurma, tidak ada baunya namun rasanya manis, dan perumpamaan orang munafik yang membaca al-Qur`an seperti raihanah (sejenis tanaman), harum baunya tapi pahit rasanya dan perumpamaan munafik yang yang tidak membaca al-Qur`an seperti brotowali, baunya busuk dan rasanya pahit.\" Abu Isa berkata; Hadits ini hasan shahih dan [Syu'bah] juga meriwayatkannya dari [Qatadah]."
            },
            {
                "number": 2725,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الزَّرْعِ لَا تَزَالُ الرِّيَاحُ تُفَيِّئُهُ وَلَا يَزَالُ الْمُؤْمِنُ يُصِيبُهُ بَلَاءٌ وَمَثَلُ الْمُنَافِقِ مَثَلُ شَجَرَةِ الْأَرْزِ لَا تَهْتَزُّ حَتَّى تُسْتَحْصَدَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] dan yang lain, mereka berkata; telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perumpamaan orang mu`min seperti tanaman, angin senantiasa menerpanya (ke kiri dan ke kanan) dan orang mu`min itu akan senantiasa tertimpa musibah, sedangkan perumpamaan orang munafik seperti pohon padi, tidaklah ia bergerak hingga di ketam.\" Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2726,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مُوسَى الْأَنْصَارِيُّ حَدَّثَنَا مَعْنٌ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ مِنْ الشَّجَرِ شَجَرَةً لَا يَسْقُطُ وَرَقُهَا وَهِيَ مَثَلُ الْمُؤْمِنِ حَدِّثُونِي مَا هِيَ قَالَ عَبْدُ اللَّهِ فَوَقَعَ النَّاسُ فِي شَجَرِ الْبَوَادِي وَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هِيَ النَّخْلَةُ فَاسْتَحْيَيْتُ أَنْ أَقُولَ قَالَ عَبْدُ اللَّهِ فَحَدَّثْتُ عُمَرَ بِالَّذِي وَقَعَ فِي نَفْسِي فَقَالَ لَأَنْ تَكُونَ قُلْتَهَا أَحَبَّ إِلَيَّ مِنْ أَنْ يَكُونَ لِي كَذَا وَكَذَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Musa Al Anshari] telah menceritakan kepada kami [Ma'nu] telah menceritakan kepada kami [Malik] dari [Abdullah bin Dinar] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya di antara pepohonan ada suatu pohon yang daunnya tidak berguguran, itu seperti seorang mu`min, beritahukanlah kepadaku pohon apa itu?\" Abdullah berkata; Orang-orang mengira pohon tersebut adalah pohon yang tumbuh dipadang pasir, sementara aku mengiranya pohon kurma. Nabi shallallahu 'alaihi wasallam bersabda: \"Ia adalah pohon kurma\" akan tetapi aku malu mengatakannya.\" Abdullah berkata; \"Lalu aku beritahukan kepada Umar apa yang aku kira, maka Umar berkata; \"Sungguh bila kamu mengatakannya itu lebih aku sukai daripada aku memiliki ini dan ini.\" Abu Isa berkata; Hadits ini hasan. Dalam hal ini ada hadits serupa dari Abu Hurairah radliallahu 'anhu."
            },
            {
                "number": 2727,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَرَأَيْتُمْ لَوْ أَنَّ نَهْرًا بِبَابِ أَحَدِكُمْ يَغْتَسِلُ مِنْهُ كُلَّ يَوْمٍ خَمْسَ مَرَّاتٍ هَلْ يَبْقَى مِنْ دَرَنِهِ شَيْءٌ قَالُوا لَا يَبْقَى مِنْ دَرَنِهِ شَيْءٌ قَالَ فَذَلِكَ مَثَلُ الصَّلَوَاتِ الْخَمْسِ يَمْحُو اللَّهُ بِهِنَّ الْخَطَايَاوَفِي الْبَاب عَنْ جَابِرٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا بَكْرُ بْنُ مُضَرَ الْقُرَشِيُّ عَنْ ابْنِ الْهَادِ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Ibnu Al Had] dari [Muhammad bin Ibrahim] dari [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagaimana menurut kalian bila di pintu salah seorang dari kalian ada sungai, lalu ia mandi lima kali setiap harinya, masihkan ada kotoran yang tersisa?\" mereka menjawab; \"Tidak akan ada kotorannya tersisa sedikit pun.\" Beliau bersabda: \"Itu seperti sholat lima waktu, dengannya Allah akan menghapus kesalahan-kesalahannya.\" Dalam hal ini, ada hadits serupa dari Jabir. Abu Isa berkata; Hadits ini hasan shahih. Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Bakr bin Mudlar Al Qurasy] dari [Ibnu Al Had] seperti hadits di atas."
            },
            {
                "number": 2728,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا حَمَّادُ بْنُ يَحْيَى الْأَبَحُّ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ أُمَّتِي مَثَلُ الْمَطَرِ لَا يُدْرَى أَوَّلُهُ خَيْرٌ أَمْ آخِرُهُقَالَ وَفِي الْبَاب عَنْ عَمَّارٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَابْنِ عُمَرَ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ قَالَ وَرُوِي عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَهْدِيٍّ أَنَّهُ كَانَ يُثَبِّتُ حَمَّادَ بْنَ يَحْيَى الْأَبَحَّ وَكَانَ يَقُولُ هُوَ مِنْ شُيُوخِنَا",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Hammad bin Yahya Al Abah] dari [Tsabit Al Bunani] dari [Anas] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Perumpamaan ummatku seperti hujan, tidak diketahui (apakah) yang baik pada permulannya ataukah akhirnya.\" Abu Isa berkata; Dalam hal ini, ada hadits serupa dari 'Ammar, Abdullah bin 'Amru dan Ibnu Umar. Abu Isa berkata; Hadits ini hasan gharib melalui sanad ini. ia berkata; Dan diriwayatkan dari Abdurrahman bin Mahdi bahwa dia menguatkan (hadits) Hammad bin Yahya Al Abah, ia berkata; \"Dia termasuk salah satu dari guru kami.\""
            },
            {
                "number": 2729,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا خَلَّادُ بْنُ يَحْيَي حَدَّثَنَا بَشِيرُ بْنُ الْمُهَاجِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِيهِ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ تَدْرُونَ مَا هَذِهِ وَمَا هَذِهِ وَرَمَى بِحَصَاتَيْنِ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ هَذَاكَ الْأَمَلُ وَهَذَاكَ الْأَجَلُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Khallad bin Yahya] telah menceritakan kepada kami [Basyir bin Al Muhajir] telah menceritakan kepada kami [Abdullah bin Buraidah] dari [Ayahnya] dia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Tahukah kalian apakah ini dan apakah ini?\" -beliau sambil melempar dua batu kerikil, - para sahabat menjawab; \"Allah dan Rasul-Nya yang lebih tahu, \" beliau bersabda: \"Yang ini seperti cita-cita dan yang ini seperti ajal.\" Abu Isa berkata; Dari jalur ini, hadits ini hasan gharib."
            },
            {
                "number": 2730,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مُوسَى حَدَّثَنَا مَعْنٌ حَدَّثَنَا مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا أَجَلُكُمْ فِيمَا خَلَا مِنْ الْأُمَمِ كَمَا بَيْنَ صَلَاةِ الْعَصْرِ إِلَى مَغَارِبِ الشَّمْسِ وَإِنَّمَا مَثَلُكُمْ وَمَثَلُ الْيَهُودِ وَالنَّصَارَى كَرَجُلٍ اسْتَعْمَلَ عُمَّالًا فَقَالَ مَنْ يَعْمَلُ لِي إِلَى نِصْفِ النَّهَارِ عَلَى قِيرَاطٍ قِيرَاطٍ فَعَمِلَتْ الْيَهُودُ عَلَى قِيرَاطٍ قِيرَاطٍ فَقَالَ مَنْ يَعْمَلُ لِي مِنْ نِصْفِ النَّهَارِ إِلَى صَلَاةِ الْعَصْرِ عَلَى قِيرَاطٍ قِيرَاطٍ فَعَمِلَتْ النَّصَارَى عَلَى قِيرَاطٍ قِيرَاطٍ ثُمَّ أَنْتُمْ تَعْمَلُونَ مِنْ صَلَاةِ الْعَصْرِ إِلَى مَغَارِبِ الشَّمْسِ عَلَى قِيرَاطَيْنِ قِيرَاطَيْنِ فَغَضِبَتْ الْيَهُودُ وَالنَّصَارَى وَقَالُوا نَحْنُ أَكْثَرُ عَمَلًا وَأَقَلُّ عَطَاءً قَالَ هَلْ ظَلَمْتُكُمْ مِنْ حَقِّكُمْ شَيْئًا قَالُوا لَا قَالَ فَإِنَّهُ فَضْلِي أُوتِيهِ مَنْ أَشَاءُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Musa] telah menceritakan kepada kami [Ma'nu] telah menceritakan kepada kami [Malik] dari [Abdullah bin Dinar] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya ajal kalian seperti yang telah berlalu dari umat-umat sebelumnya, sama seperti waktu antara sholat ashar hingga terbenamnya matahari, sesungguhnya perumpamaan kalian dan perumpamaan Yahudi dan Nasrani seperti seseorang mempekerjakan beberapa pekerja, orang itu berkata; \"Siapa yang bekerja untukku hingga pertengahan siang, akan mendapatkan satu qirath satu qirath.\" Maka orang Yahudi bekerja untuk mendapatkan satu qirath satu qirath, lalu orang itu berkata; \"Siapa yang bekerja untukku dari pertengahan siang hingga sholat ashar akan mendapatkan satu qirath satu qirat.\" Orang Nasrani bekerja untuk mendapatkan satu qirath satu qirath. Selanjutnya kalian bekerja mulai dari sholat ashar hingga matahari terbenam dengan mendapatkan dua qirath dua qirath. Maka Yahudi dan Nasrani marah, mereka berkata; Kami kerja lebih banyak tapi imbalannya sedikit. Orang itu bertanya: \"Apakah aku menzhalimi hak kalian sedikit pun?\" Mereka menjawab; \"Tidak.\" orang itu berkata; \"Itulah karuniaku, aku memberikannya kepada siapa saja yang aku kehendaki.\" Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2731,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا النَّاسُ كَإِبِلٍ مِائَةٍ لَا يَجِدُ الرَّجُلُ فِيهَا رَاحِلَةًقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ بِهَذَا الْإِسْنَادِ نَحْوَهُ وَقَالَ لَا تَجِدُ فِيهَا رَاحِلَةً أَوْ قَالَ لَا تَجِدُ فِيهَا إِلَّا رَاحِلَةً",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] dan yang lain, mereka berkata; telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya manusia itu seperti seratus unta, hampir saja seseorang tidak menemukan satu pun yang berangkat (yang layak untuk ditunggangi).\" Abu Isa berkata; Hadits ini hasan shahih. Telah menceritakan kepada kami [Sa'id bin Abdurrahman Al Makhzumi] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dengan sanad dan maksud yang sama. Dan beliau bersabda: \"Tidak ada satu pun yang berangkat, atau bersabda: \"Tidak ada kecuali satu pun yang berangkat.\""
            },
            {
                "number": 2732,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا مَثَلِي وَمَثَلُ أُمَّتِي كَمَثَلِ رَجُلٍ اسْتَوْقَدَ نَارًا فَجَعَلَتْ الذُّبَابُ وَالْفَرَاشُ يَقَعْنَ فِيهَا وَأَنَا آخُذُ بِحُجَزِكُمْ وَأَنْتُمْ تَقَحَّمُونَ فِيهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Mughirah bin Abdurrahman] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya perumpamaanku dan perumpamaan ummatku seperti seseorang yang menyalakan api kemudian lalat dan kupu-kupu jatuh di api itu, dan aku memegangi ikatan kain kalian, sementara kalian tetap memasukinya.\" Abu Isa berkata; hadits ini hasan shahih dan hadits ini juga diriwayatkan melalui sanad yang lain."
            },
            {
                "number": 2733,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ عَلَى أُبَيِّ بْنِ كَعْبٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أُبَيُّ وَهُوَ يُصَلِّي فَالْتَفَتَ أُبَيٌّ وَلَمْ يُجِبْهُ وَصَلَّى أُبَيٌّ فَخَفَّفَ ثُمَّ انْصَرَفَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ السَّلَامُ عَلَيْكَ يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْكَ السَّلَامُ مَا مَنَعَكَ يَا أُبَيُّ أَنْ تُجِيبَنِي إِذْ دَعَوْتُكَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ فِي الصَّلَاةِ قَالَ أَفَلَمْ تَجِدْ فِيمَا أَوْحَى اللَّهُ إِلَيَّ أَنْ{ اسْتَجِيبُوا لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ لِمَا يُحْيِيكُمْ }قَالَ بَلَى وَلَا أَعُودُ إِنْ شَاءَ اللَّهُ قَالَ أَتُحِبُّ أَنْ أُعَلِّمَكَ سُورَةً لَمْ يَنْزِلْ فِي التَّوْرَاةِ وَلَا فِي الْإِنْجِيلِ وَلَا فِي الزَّبُورِ وَلَا فِي الْفُرْقَانِ مِثْلُهَا قَالَ نَعَمْ يَا رَسُولَ اللَّهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ تَقْرَأُ فِي الصَّلَاةِ قَالَ فَقَرَأَ أُمَّ الْقُرْآنِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي نَفْسِي بِيَدِهِ مَا أُنْزِلَتْ فِي التَّوْرَاةِ وَلَا فِي الْإِنْجِيلِ وَلَا فِي الزَّبُورِ وَلَا فِي الْفُرْقَانِ مِثْلُهَا وَإِنَّهَا سَبْعٌ مِنْ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُعْطِيتُهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ أَنَسِ بْنِ مَالِكٍ وَفِيهِ عَنْ أَبِي سَعِيدِ بْنِ الْمُعَلَّى",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Al Ala` bin Abdurrahman] dari [Ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam pergi menemui Ubay bin Ka'ab, maka Rasulullah shallallahu 'alaihi wasallam memanggil: \"Hai Ubay!\" sementara dirinya tengah mengerjakan sholat, ia menoleh namun tidak menjawab beliau, dan Ubai tetap melanjutkan sholatnya, ia lalu mempercepat sholatnya dan langsung menghampiri Rasulullah shallallahu 'alaihi wasallam, Ubay mengucapkan; \"ASSALAAMU'ALAIKUM, wahai Rasulullah.\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"WA 'ALAIKASSALAAM, apa yang menghalangimu, wahai Ubay untuk menjawabku saat aku memanggilmu?\" Ubay menjawab; \"Wahai Rasulullah, aku tadi sedang mengerjakan sholat. Beliau bertanya: \"Apa kau tidak menemukan di antara yang diwahyukan Allah kepadaku agar kalian memenuhi panggilan Allah dan RasulNya bila menyeru kalian untuk sesuatu yang menghidupkan kalian?\" Ubay menjawab; \"Benar, aku tidak akan mengulangi, insya Allah.\" Beliau bersabda: \"Maukah aku ajarkan kepadamu satu surat yang tidak diturunkan di Taurat, Injil dan Zabur, dan dalam al-Qur`an juga tidak ada yang sepertinya?\" Ubay menjawab; \"Tentu, wahai Rasulullah.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagaimana kamu membaca saat sholat?\" Perawi berkata; \"Maka Ubay membaca ummul al-Qur`an (Al Fatehah). Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, tidaklah diturunkan di Taurat, Injil, Zabur dan dalam al-Qur`an seperti itu, sesungguhnya ia adalah tujuh (ayat) yang diulang-ulang dan al-Qur`an yang agung yang diberikan padaku.\" Abu Isa berkata; Hadits ini hasan shahih. Dalam hal ini, ada hadits serupa dari Anas bin Malik dan Abu Sa'id bin Al Mu'alla."
            },
            {
                "number": 2734,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ عَطَاءٍ مَوْلَى أَبِي أَحْمَدَ عَنْ أَبِي هُرَيْرَةَ قَالَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْثًا وَهُمْ ذُو عَدَدٍ فَاسْتَقْرَأَهُمْ فَاسْتَقْرَأَ كُلَّ رَجُلٍ مِنْهُمْ مَا مَعَهُ مِنْ الْقُرْآنِ فَأَتَى عَلَى رَجُلٍ مِنْهُمْ مِنْ أَحْدَثِهِمْ سِنًّا فَقَالَ مَا مَعَكَ يَا فُلَانُ قَالَ مَعِي كَذَا وَكَذَا وَسُورَةُ الْبَقَرَةِ قَالَ أَمَعَكَ سُورَةُ الْبَقَرَةِ فَقَالَ نَعَمْ قَالَ فَاذْهَبْ فَأَنْتَ أَمِيرُهُمْ فَقَالَ رَجُلٌ مِنْ أَشْرَافِهِمْ وَاللَّهِ يَا رَسُولَ اللَّهِ مَا مَنَعَنِي أَنْ أَتَعَلَّمَ سُورَةَ الْبَقَرَةِ إِلَّا خَشْيَةَ أَلَّا أَقُومَ بِهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعَلَّمُوا الْقُرْآنَ وَاقْرَءُوهُ فَإِنَّ مَثَلَ الْقُرْآنِ لِمَنْ تَعَلَّمَهُ فَقَرَأَهُ وَقَامَ بِهِ كَمَثَلِ جِرَابٍ مَحْشُوٍّ مِسْكًا يَفُوحُ رِيحُهُ فِي كُلِّ مَكَانٍ وَمَثَلُ مَنْ تَعَلَّمَهُ فَيَرْقُدُ وَهُوَ فِي جَوْفِهِ كَمَثَلِ جِرَابٍ وُكِئَ عَلَى مِسْكٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رَوَاهُ اللَّيْثُ بْنُ سَعْدٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ عَطَاءٍ مَوْلَى أَبِي أَحْمَدَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا وَلَمْ يَذْكُرْ فِيهِ عَنْ أَبِي هُرَيْرَةَ حَدَّثَنَا قُتَيْبَةُ عَنْ اللَّيْثِ فَذَكَرَهُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Hulwani] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami [Abdul Hamid bin Ja'far] dari [Sa'id Al Maqburi] dari [Atha`] bekas budak milik Abu Ahmad dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah mengutus rombongan para sahabat dalam jumlah banyak, beliau meminta kepada mereka untuk membaca, beliau meminta setiap orang dari mereka untuk membacakan apa yang dia hafal dari Al Qur`an, beliau datang kepada seseorang yang paling muda umurnya di antara mereka dan bertanya: \"Apa yang kamu hafal dari Al Qur`an wahai Fulan?\" dia menjawab; \"Saya hafal ini dan ini dan surat Al Baqarah, \" beliau bertanya: \"Apakah kamu hafal surat Al Baqarah?\" dia menjawab; \"Ya, \" beliau bersabda kepadanya: \"Pergilah dan kamu yang jadi imam bagi mereka, \" Seseorang yang paling terkemuka di antara mereka berkata; \"Demi Allah wahai Rasulullah, tidak ada yang menghalangiku untuk mempelajari surat Al Baqarah selain karena aku takut tidak dapat mengamalkannya, \" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pelajarilah Al Qur`an dan bacalah, karena perumpamaan Al Qur`an bagi orang yang mempelajarinya kemudian membacanya seperti kantong yang penuh dengan minyak wangi, dimana wanginya semerbak ke setiap tempat, dan perumpamaan orang yang mempelajarinya kemudian tidur (tidak mengamalkannya) padahal Al Qur`an ada di hatinya seperti kantong yang berisi minyak wangi namun terikat.\" Abu Isa berkata; Hadits ini hasan, [Laits bin Sa'ad] telah meriwayatkannya dari [Sa'id Al Maqburi] dari [Atha`] budak milik Abu Ahmad, dari Nabi shallallahu 'alaihi wasallam secara mursal, dan di dalam hadits tersebut, tidak disebutkan dari Abu Hurairah. Telah menceritakan kepada kami [Qutaibah] dari [Laits] kemudian dia menyebutkan hadits."
            },
            {
                "number": 2735,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَجْعَلُوا بُيُوتَكُمْ مَقَابِرَ وَإِنَّ الْبَيْتَ الَّذِي تُقْرَأُ فِيهِ الْبَقَرَةُ لَا يَدْخُلُهُ الشَّيْطَانُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Suhail bin Abu Shalih] dari [Ayahnya] dari [Abu Hurairah] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menjadikan rumah-rumah kalian seperti kuburan, sesungguhnya syetan tidak memasuki rumah yang dibacakan didalamnya surat Al Baqarah.\" Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2736,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ عَنْ زَائِدَةَ عَنْ حَكِيمِ بْنِ جُبَيْرٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِكُلِّ شَيْءٍ سَنَامٌ وَإِنَّ سَنَامَ الْقُرْآنِ سُورَةُ الْبَقَرَةِ وَفِيهَا آيَةٌ هِيَ سَيِّدَةُ آيِ الْقُرْآنِ هِيَ آيَةُ الْكُرْسِيِّقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ حَكِيمِ بْنِ جُبَيْرٍ وَقَدْ تَكَلَّمَ شُعْبَةُ فِي حَكِيمِ بْنِ جُبَيْرٍ وَضَعَّفَهُ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Husain Al Ju'fi] dari [Za`idah] dari [Hakim bin Jubair] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap sesuatu memiliki puncak, dan puncaknya Al Qur`an adalah surat Al Baqarah, di dalamnya terdapat ayat yang merupakan tuannya ayat-ayat dalam Al Qur`an yaitu ayat kursi.\" Abu Isa berkata; Hadits ini gharib, kami tidak mengetahuinya kecuali dari hadits Hakim bin Jubair, sementara Syu'bah mempermasalahkan tentang Hakim bin Jubair dan melemahkannya.\""
            },
            {
                "number": 2737,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ الْمُغِيرَةِ أَبُو سَلَمَةَ الْمَخْزُومِيُّ الْمَدَنِيُّ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ الْمُلَيْكِيِّ عَنْ زُرَارَةَ بْنِ مُصْعَبٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَرَأَ حم الْمُؤْمِنَ إِلَى{ إِلَيْهِ الْمَصِيرُ }وَآيَةَ الْكُرْسِيِّ حِينَ يُصْبِحُ حُفِظَ بِهِمَا حَتَّى يُمْسِيَ وَمَنْ قَرَأَهُمَا حِينَ يُمْسِي حُفِظَ بِهِمَا حَتَّى يُصْبِحَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَقَدْ تَكَلَّمَ بَعْضُ أَهْلِ الْعِلْمِ فِي عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرِ بْنِ أَبِي مُلَيْكَةَ الْمُلَيْكِيِّ مِنْ قِبَلِ حِفْظِهِ وَزُرَارَةُ بْنُ مُصْعَبٍ هُوَ ابْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَهُوَ جَدُّ أَبِي مُصْعَبٍ الْمَدَنِيِّ",
                "id": "Telah menceritakan kepada kami [Yahya bin Al Mughirah Abu Salamah Al Makhzumi Al Madani] telah menceritakan kepada kami [Ibnu Abu Fudaik] dari [Abdurrahman bin Abu Bakar Al Mulaiki] dari [Zurarah bin Mush'ab] dari [Abu Salamah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membaca HAA MIIM (dalam surat) Al Mu`min sampai ayat ILAIHIL MASHIIR dan membaca ayat kursi pada waktu pagi, maka ia akan di jaga hingga tiba waktu sore, dan barangsiapa membaca keduanya pada waktu sore maka ia akan dijaga hingga tiba waktu pagi.\" Abu Isa berkata; Hadits ini gharib, sebagian ahli ilmu telah membicarakan tentang Abdurrahman bin Abu Bakar bin Abu Mulaikah Al Mulaiki dari sisi hafalannya, Zurarah bin Mush'ab adalah Ibnu Abdurrahman bin 'Auf, kakek Abu Mush'ab Al Madani."
            },
            {
                "number": 2738,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي لَيْلَى عَنْ أَخِيهِ عِيسَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّأَنَّهُ كَانَتْ لَهُ سَهْوَةٌ فِيهَا تَمْرٌ فَكَانَتْ تَجِيءُ الْغُولُ فَتَأْخُذُ مِنْهُ قَالَ فَشَكَا ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَاذْهَبْ فَإِذَا رَأَيْتَهَا فَقُلْ بِسْمِ اللَّهِ أَجِيبِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَأَخَذَهَا فَحَلَفَتْ أَنْ لَا تَعُودَ فَأَرْسَلَهَا فَجَاءَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا فَعَلَ أَسِيرُكَ قَالَ حَلَفَتْ أَنْ لَا تَعُودَ فَقَالَ كَذَبَتْ وَهِيَ مُعَاوِدَةٌ لِلْكَذِبِ قَالَ فَأَخَذَهَا مَرَّةً أُخْرَى فَحَلَفَتْ أَنْ لَا تَعُودَ فَأَرْسَلَهَا فَجَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا فَعَلَ أَسِيرُكَ قَالَ حَلَفَتْ أَنْ لَا تَعُودَ فَقَالَ كَذَبَتْ وَهِيَ مُعَاوِدَةٌ لِلْكَذِبِ فَأَخَذَهَا فَقَالَ مَا أَنَا بِتَارِكِكِ حَتَّى أَذْهَبَ بِكِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنِّي ذَاكِرَةٌ لَكَ شَيْئًا آيَةَ الْكُرْسِيِّ اقْرَأْهَا فِي بَيْتِكَ فَلَا يَقْرَبُكَ شَيْطَانٌ وَلَا غَيْرُهُ قَالَ فَجَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا فَعَلَ أَسِيرُكَ قَالَ فَأَخْبَرَهُ بِمَا قَالَتْ قَالَ صَدَقَتْ وَهِيَ كَذُوبٌقَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَفِي الْبَاب عَنْ أُبَيِّ بْنِ كَعْبٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu Ahmad] telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Laila] dari saudaranya yaitu [Isa] dari [Abdurrahman bin Abu Laila] dari [Abu Ayyub Al Anshari] ia memiliki rak berisi kurma, ada hantu datang dan mengambilnya, lalu ia mengadukan hal itu kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Pergilah, bila kau melihatnya, ucapkanlah BISMILLAAH, turutilah Rasulullah.\" lalu Abu Ayyub Al Anshari menangkapnya, hantu itu bersumpah tidak akan kembali. Akhirnya Abu Ayyub melepasnya lalu ia menemui Nabi shallallahu 'alaihi wasallam, beliau bertanya: \"Apa yang dilakukan tawananmu?\" Abu Ayyub menjawab: \"Ia bersumpah tidak akan kembali.\" Beliau bersabda: \"Ia dusta, memang ia terbiasa berdusta.\" Abdurrahman berkata; Abu Ayyub lalu menangkap yang kedua kalinya, hantu itu pun bersumpah untuk tidak kembali lagi, lantas Abu Ayyub melepasnya. Setelah itu Abu Ayyub datang menemui Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Apa yang di lakukan tawananmu?\" Abu Ayyub menjawab; \"Dia bersumpah untuk tidak kembali.\" Beliau bersabda: \"Dia dusta, memang ia terbiasa berdusta.\" Setelah itu Abu Ayyub menangkapnya lagi, lalu berkata; \"Aku tidak akan melepaskanmu sampai aku membawamu ke Nabi shallallahu 'alaihi wasallam.\" Hantu itu berkata; \"Aku ingatkan padamu tentang sesuatu, yaitu ayat kursi, bacalah ayat kursi di rumahmu, niscaya setan tidak akan mendekatimu dan tidak juga yang lainnya.\" Abu Ayyub pun menemui Nabi shallallahu 'alaihi wasallam, beliau bertanya: \"Apa yang dilakukan tawananmu?\" Abdurrahman berkata; lalu Abu Ayyub memberitahukan apa yang diucapkan hantu itu, maka beliau bersabda: \"Ia benar walaupun sebenarnya ia pendusta.\" Abu Isa berkata; Hadits ini hasan gharib. Dalam hal ini, ada hadits serupa dari Ubay bin Ka'ab."
            },
            {
                "number": 2739,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ عَنْ مَنْصُورِ بْنِ الْمُعْتَمِرِ عَنْ إِبْرَاهِيمَ بْنِ يَزِيدَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَرَأَ الْآيَتَيْنِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي لَيْلَةٍ كَفَتَاهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Jarir bin Abdul Hamid] dari [Mandhur bin Al Mu'tamir] dari [Ibrahim bin Yazid] dari [Abdurrahman bin Yazid] dari [Abu Mas'ud Al Anshari] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membaca dua ayat terakhir dari surat Al Baqarah pada malam hari, maka keduanya akan mencukupinya.\" Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2740,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَشْعَثَ بْنِ عَبْدِ الرَّحْمَنِ الْجَرْمِيِّ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْأَشْعَثِ الْجَرْمِيِّ عَنْ النُّعْمَانِ بْنِ بَشِيرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ كَتَبَ كِتَابًا قَبْلَ أَنْ يَخْلُقَ السَّمَوَاتِ وَالْأَرْضَ بِأَلْفَيْ عَامٍ أَنْزَلَ مِنْهُ آيَتَيْنِ خَتَمَ بِهِمَا سُورَةَ الْبَقَرَةِ وَلَا يُقْرَأَانِ فِي دَارٍ ثَلَاثَ لَيَالٍ فَيَقْرَبُهَا شَيْطَانٌقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Hammad bin Salamah] dari [Asy'ats bin Abdurrahman Al Jarmi] dari [Abu Qilabah] dari [Abu Al Asy'ats Al Jarmi] dari [Nu'man bin Basyir] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya Allah telah menulis kitab (Al Qur`an) sejak dua ribu tahun sebelum menciptakan langit dan bumi, Allah menurunkan dua ayat darinya sebagai penutup surat Al Baqarah, tidaklah keduanya dibaca dalam rumah selama tiga malam setan akan mendekatinya.\" Abu Isa berkata; Hadits ini hasan gharib."
            },
            {
                "number": 2741,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ أَخْبَرَنَا هِشَامُ بْنُ إِسْمَعِيلَ أَبُو عَبْدِ الْمَلِكِ الْعَطَّارِ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سُلَيْمَانَ عَنْ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُ حَدَّثَهُمْ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ نَوَّاسِ بْنِ سَمْعَانَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَأْتِي الْقُرْآنُ وَأَهْلُهُ الَّذِينَ يَعْمَلُونَ بِهِ فِي الدُّنْيَا تَقْدُمُهُ سُورَةُ الْبَقَرَةِ وَآلُ عِمْرَانَ قَالَ نَوَّاسٌ وَضَرَبَ لَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةَ أَمْثَالٍ مَا نَسِيتُهُنَّ بَعْدُ قَالَ تَأْتِيَانِ كَأَنَّهُمَا غَيَابَتَانِ وَبَيْنَهُمَا شَرْقٌ أَوْ كَأَنَّهُمَا غَمَامَتَانِ سَوْدَاوَانِ أَوْ كَأَنَّهُمَا ظُلَّةٌ مِنْ طَيْرٍ صَوَافَّ تُجَادِلَانِ عَنْ صَاحِبِهِمَاوَفِي الْبَاب عَنْ بُرَيْدَةَ وَأَبِي أُمَامَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَمَعْنَى هَذَا الْحَدِيثِ عِنْدَ أَهْلِ الْعِلْمِ أَنَّهُ يَجِيءُ ثَوَابُ قِرَاءَتِهِ كَذَا فَسَّرَ بَعْضُ أَهْلِ الْعِلْمِ هَذَا الْحَدِيثَ وَمَا يُشْبِهُ هَذَا مِنْ الْأَحَادِيثِ أَنَّهُ يَجِيءُ ثَوَابُ قِرَاءَةِ الْقُرْآنِ وَفِي حَدِيثِ النَّوَّاسِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يَدُلُّ عَلَى مَا فَسَّرُوا إِذْ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَهْلُهُ الَّذِينَ يَعْمَلُونَ بِهِ فِي الدُّنْيَا فَفِي هَذَا دَلَالَةٌ أَنَّهُ يَجِيءُ ثَوَابُ الْعَمَلِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Hisyam bin Isma'il Abu Abdul Malik Al Athar] telah mengabarkan kepada kami [Muhammad bin Syu'aib] telah menceritakan kepada kami [Ibrahim bin Sulaiman] dari [Al Walid bin Abdurrahman] dari [Jubair bin Nufair] dari [Nawwas bin Sam'an] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Al Qur`an akan datang pada hari Qiyamat bersama pemiliknya yang mengamalkannya di dunia, didahului oleh surat Al Baqarah dan Ali Imran, \" Nawwas berkata; Rasulullah shallallahu 'alaihi wasallam membuat perumpamaan untuk keduanya (surat Al Baqarah dan Ali Imran) dengan tiga perumpamaan yang aku tidak akan melupakan selamanya, beliau bersabda: \"Keduanya akan datang seperti dua awan, yang di antara keduanya ada cahaya, atau keduanya seperti dua awan tebal, atau keduanya seperti sekawanan burung yang membentangkan sayapnya, lalu keduanya berhujah untuk pemiliknya.\" Dan dalam bab ini, ada hadits dari Buraidah dan Abu Umamah. Abu Isa berkata; Dari jalur ini, hadits ini gharib, adapun makna hadits ini menurut ahli ilmu adalah akan datang pahala membacanya seperti ini, sebagian ahli ilmu menafsirkan hadits ini dan yang hadits serupa bahwa pahala membaca Al Qur`an akan datang, dan dalam hadits An Nawwas dari Nabi shallallahu 'alaihi wasallam ada dalil yang menunjukkan atas apa yang mereka tafsirkan, dimana Nabi shallallahu 'alaihi wasallam bersabda: \"Dan para pemiliknya yang mengamalkannya di dunia.\" Hadits ini menunjukkan pahala amal akan datang."
            },
            {
                "number": 2742,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا الْحُمَيْدِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ فِي تَفْسِيرِ حَدِيثِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَمَا خَلَقَ اللَّهُ مِنْ سَمَاءٍ وَلَا أَرْضٍ أَعْظَمَ مِنْ آيَةِ الْكُرْسِيِّ قَالَ سُفْيَانُ لِأَنَّ آيَةَ الْكُرْسِيِّ هُوَ كَلَامُ اللَّهِ وَكَلَامُ اللَّهِ أَعْظَمُ مِنْ خَلْقِ اللَّهِ مِنْ السَّمَاءِ وَالْأَرْضِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il] ia berkata; telah menceritakan kepada kami [Al Humaidi] telah menceritakan kepada kami [Sufyan bin 'Uyainah] tentang penafsiran hadits Abdulah bin Mas'ud, ia berkata; \"Tidaklah Allah menciptakan langit dan bumi yang lebih agung melebihi ayat kursi.\" Sufyan berkata; \"Karena ayat kursi adalah kalam Allah dan kalam Allah lebih agung dari ciptaan Allah seperti langit dan bumi.\""
            },
            {
                "number": 2743,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ أَنْبَأَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَال سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ يَقُولُبَيْنَمَا رَجُلٌ يَقْرَأُ سُورَةَ الْكَهْفِ إِذْ رَأَى دَابَّتَهُ تَرْكُضُ فَنَظَرَ فَإِذَا مِثْلُ الْغَمَامَةِ أَوْ السَّحَابَةِ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِلْكَ السَّكِينَةُ نَزَلَتْ مَعَ الْقُرْآنِ أَوْ نَزَلَتْ عَلَى الْقُرْآنِوَفِي الْبَاب عَنْ أُسَيْدِ بْنِ حُضَيْرٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Dawud] telah memberitakan kepada kami [Syu'bah] dari [Abu Ishaq] ia berkata; Aku mendengar [Al Bara` bin 'Azib] berkata; \"Ketika seseorang membaca surat Al Kahfi, tiba-tiba ia melihat binatang tunggangannya menghentakkan kedua kakinya, kemudian ia memandang (keatas), ternyata seperti awan atau mendung. Lalu ia menemui Rasulullah shallallahu 'alaihi wasallam dan menceritakan hal itu kepada beliau. Lantas Nabi shallallahu 'alaihi wasallam bersabda: \"Itu adalah ketenangan yang turun bersama al-Qur`an atau turun atas al-Qur`an.\" Dalam hal ini, ada hadits serupa dari Usaid bin Hudlair. Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2744,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ عَنْ أَبِي الدَّرْدَاءِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَرَأَ ثَلَاثَ آيَاتٍ مِنْ أَوَّلِ الْكَهْفِ عُصِمَ مِنْ فِتْنَةِ الدَّجَّالِحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ بِهَذَا الْإِسْنَادِ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Salim bin Abu Al Ja'd] dari [Ma'dan bin Abu Thalhah] dari [Abu Ad Darda`] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa membaca tiga ayat permulaan surat Al Kahfi, maka ia akan terjaga dari fitnah Dajjal.\" Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [Ayahku] dari [Qatadah] dengan sanad dan maksud yang sama. Abu Isa berkata; Hadits ini hasan shahih."
            },
            {
                "number": 2745,
                "arab": "حَدَّثَنَا قُتَيْبَةُ وَسُفْيَانُ بْنُ وَكِيعٍ قَالَا حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الرُّؤَاسِيُّ عَنْ الْحَسَنِ بْنِ صَالِحٍ عَنْ هَارُونَ أَبِي مُحَمَّدٍ عَنْ مُقَاتِلِ بْنِ حَيَّانَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِكُلِّ شَيْءٍ قَلْبًا وَقَلْبُ الْقُرْآنِ يس وَمَنْ قَرَأَ يس كَتَبَ اللَّهُ لَهُ بِقِرَاءَتِهَا قِرَاءَةَ الْقُرْآنِ عَشْرَ مَرَّاتٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ وَبِالْبَصْرَةِ لَا يَعْرِفُونَ مِنْ حَدِيثِ قَتَادَةَ إِلَّا مِنْ هَذَا الْوَجْهِ وَهَارُونُ أَبُو مُحَمَّدٍ شَيْخٌ مَجْهُولٌ حَدَّثَنَا أَبُو مُوسَى مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ حَدَّثَنَا قُتَيْبَةُ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بِهَذَا وَفِي الْبَاب عَنْ أَبِي بَكْرٍ الصِّدِّيقِ وَلَا يَصِحُّ مِنْ قِبَلِ إِسْنَادِهِ وَإِسْنَادُهُ ضَعِيفٌ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ",
                "id": "Telah menceritakan kepada kami [Qutaibah] dan [Sufyan bin Waki'] keduanya berkata; telah menceritakan kepada kami [Humaid bin Abdurrahman Ar Ru`asi] dari [Al Hasan bin Shalih] dari [Harun Abu Muhammad] dari [Muqatil bin Hayyan] dari [Qatadah] dari [Anas] ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya setiap sesuatu memiliki hati, dan hatinya Al Qur`an adalah surat Yasin, barangsiapa membaca surat Yasin, maka Allah akan mencatat baginya seperti membaca seluruh Al Qur`an sepuluh kali atas balasan bacaannya.\" Abu Isa berkata; Hadits ini gharib, kami tidak mengetahuinya kecuali dari hadits Humaid bin Abdurrahman. Sedangkan di Bashrah, orang-orang tidak mengetahuinya dari hadits Qatadah kecuali dari jalur ini. Harun Abu Muhammad adalah seorang syaikh yang majhul (tidak diketahui). Telah menceritakan kepada kami [Abu Musa bin Muhammad Al Mutsanna] telah menceritakan kepada kami [Ahmad bin Sa'id Ad Darimi] telah menceritakan kepada kami [Qutaibah] dari [Humaid bin Abdurrahman] dengan hadits ini. Dan dalam bab ini, ada hadits dari Abu Bakar Ash Shiddiq, namun tidak sah dari sisi sanadnya, karena sanadnya lemah. Dan dalam bab ini, ada juga hadits dari Abu Hurairah."
            },
            {
                "number": 2746,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ عَنْ عُمَرَ بْنِ أَبِي خَثْعَمٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَرَأَ حم الدُّخَانَ فِي لَيْلَةٍ أَصْبَحَ يَسْتَغْفِرُ لَهُ سَبْعُونَ أَلْفَ مَلَكٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَعُمَرُ بْنُ أَبِي خَثْعَمٍ يُضَعَّفُ قَالَ مُحَمَّدٌ وَهُوَ مُنْكَرُ الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Waqi'] telah menceritakan kepada kami [Zaid bin Hubab] dari [Umar bin Abu Khats'am] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membaca HAA MIIM (surat) Ad Dukhan pada malam hari, maka tujuh puluh ribu malaikat akan memohonkan ampunan untuknya di pagi harinya.\" Abu Isa berkata; Hadits ini gharib, kami tidak mengetahuinya kecuali dari jalur ini, sebab Umar bin Abu Khats'am dilemahkan, Muhammad berkata; \"Dia adalah munkarul hadits (Sering meriwayatkan hadits munkar).\""
            },
            {
                "number": 2747,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَبْدِ الرَّحْمَنِ الْكُوفِيُّ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ عَنْ هِشَامٍ أَبِي الْمِقْدَامِ عَنْ الْحَسَنِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَرَأَ حم الدُّخَانَ فِي لَيْلَةِ الْجُمُعَةِ غُفِرَ لَهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَهِشَامٌ أَبُو الْمِقْدَامِ يُضَعَّفُ وَلَمْ يَسْمَعْ الْحَسَنُ مِنْ أَبِي هُرَيْرَةَ هَكَذَا قَالَ أَيُّوبُ وَيُونُسُ بْنُ عُبَيْدٍ وَعَلِيُّ بْنُ زَيْدٍ",
                "id": "Telah menceritakan kepada kami [Nashr bin Abdurrahman Al Kufi] telah menceritakan kepada kami [Zaid bin Hubab] dari [Hisyam Abu Al Miqdam] dari [Al Hasan] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membaca HAA MIIM (surat) Ad Dukhan pada malam jum'at, maka (dosa-dosanya) akan diampuni.\" Abu Isa berkata; Hadits ini hanya kami ketahui dari jalur ini. Hisyam Abu Al Miqdam dilemahkan dan Al Hasan tidak pernah mendengar dari Abu Hurairah. Demikian yang dikatakan Ayyub, Yunus bin Ubaid dan Ali bin Zaid."
            },
            {
                "number": 2748,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا يَحْيَى بْنُ عَمْرِو بْنِ مَالِكٍ النُّكْرِيُّ عَنْ أَبِيهِ عَنْ أَبِي الْجَوْزَاءِ عَنْ ابْنِ عَبَّاسٍ قَالَضَرَبَ بَعْضُ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خِبَاءَهُ عَلَى قَبْرٍ وَهُوَ لَا يَحْسِبُ أَنَّهُ قَبْرٌ فَإِذَا فِيهِ إِنْسَانٌ يَقْرَأُ سُورَةَ تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ حَتَّى خَتَمَهَا فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي ضَرَبْتُ خِبَائِي عَلَى قَبْرٍ وَأَنَا لَا أَحْسِبُ أَنَّهُ قَبْرٌ فَإِذَا فِيهِ إِنْسَانٌ يَقْرَأُ سُورَةَ تَبَارَكَ الْمُلْكِ حَتَّى خَتَمَهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هِيَ الْمَانِعَةُ هِيَ الْمُنْجِيَةُ تُنْجِيهِ مِنْ عَذَابِ الْقَبْرِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu Asy Syawarib] telah menceritakan kepada kami [Yahya bin 'Amru bin Malik An Nukri] dari [Ayahnya] dari [Abul Jauza`] dari [Ibnu Abbas] ia berkata; \"Sebagian sahabat Nabi shallallahu 'alaihi wasallam membuat kemah di atas pemakaman, ternyata ia tidak mengira jika berada di pemakaman, tiba-tiba ada seseorang membaca surat TABAARAKAL LADZII BIYADIHIL MULKU (Maha Suci Allah yang di tangan-Nyalah segala kerajaan) \". sampai selesai, kemudian dia datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; \"Wahai Rasulullah sesungguhnya, aku membuat kemahku di atas kuburan dan saya tidak mengira jika tempat tersebut adalah kuburan, kemudian ada seseorang membaca surat TABARAK (surat) Al Mulk sampai selesai, \" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dia adalah penghalang, dia adalah penyelamat yang menyelamatkannya dari siksa kubur.\" Abu Isa berkata; Dari jalur ini, hadits ini hasan gharib. Dan dalam bab ini, ada hadits dari Abu Hurairah. "
            },
            {
                "number": 2749,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ عَبَّاسٍ الْجُشَمِيِّ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ سُورَةً مِنْ الْقُرْآنِ ثَلَاثُونَ آيَةً شَفَعَتْ لِرَجُلٍ حَتَّى غُفِرَ لَهُ وَهِيَ سُورَةُ تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Abbas Al Jusyami] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya ada satu surat dalam Al Qur`an yang terdiri dari tiga puluh ayat, dan dapat memberikan syafa'at kepada seseorang hingga dia diampuni, yaitu surat TABAARAKAL LADZII BIYADIHIL MULKU.\" Abu Isa berkata; Hadits ini hasan."
            },
            {
                "number": 2750,
                "arab": "حَدَّثَنَا هُرَيْمُ بْنُ مِسْعَرٍ التِّرْمِذِيُّ حَدَّثَنَا الْفُضَيْلُ بْنُ عِيَاضٍ عَنْ لَيْثٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَنَامُ حَتَّى يَقْرَأَ الم تَنْزِيلُ وَتَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ رَوَاهُ غَيْرُ وَاحِدٍ عَنْ لَيْثِ بْنِ أَبِي سُلَيْمٍ مِثْلَ هَذَا وَرَوَاهُ مُغِيرَةُ بْنُ مُسْلِمٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذَا وَرَوَى زُهَيْرٌ قَالَ قُلْتُ لِأَبِي الزُّبَيْرِ سَمِعْتَ مِنْ جَابِرٍ فَذَكَرَ هَذَا الْحَدِيثَ فَقَالَ أَبُو الزُّبَيْرِ إِنَّمَا أَخْبَرَنِيهِ صَفْوَانُ أَوِ ابْنُ صَفْوَانَ وَكَأَنَّ زُهَيْرًا أَنْكَرَ أَنْ يَكُونَ هَذَا الْحَدِيثُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ لَيْثٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ قَالَ حَدَّثَنَا هُرَيْمُ بْنُ مِسْعَرٍ حَدَّثَنَا فُضَيْلٌ عَنْ لَيْثٍ عَنْ طَاوُسٍ قَالَ تَفْضُلَانِ عَلَى كُلِّ سُورَةٍ فِي الْقُرْآنِ بِسَبْعِينَ حَسَنَةً",
                "id": "Telah menceritakan kepada kami [Huraim bin Mis'ar At Turmudzi] telah menceritakan kepada kami [Al Fadll bin Iyadl] dari [Laits] dari [Abu Az Zubair] dari [Jabir] bahwa; \"Tidaklah Nabi shallallahu 'alaihi wasallam tidur hingga beliau membaca ALIF LAAM MIIM TANZIL dan TABAARAKALLADZI BIYADILIL MULK.\" Abu Isa berkata; Hadits ini diriwayatkan oleh beberapa perawi dari Laits bin Abu Sulaim seperti ini, dan diriwayatkan pula oleh [Mughirah bin Muslim] dari [Abu Az Zubair] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam seperti ini. [Zuhair] meriwayatkan, katanya; \"Aku bertanya kepada Abu Zubair; \"Apakah kamu mendengar dari Jabir?\" Ia pun menyebut hadits ini. [Abu Az Zubair] mengatakan; Hanya [Shafwan atau Ibnu Shafwan] yang mengabarkannya kepadaku. Sepertinya Zuhair mengingkari hadits ini dari Abu Az Zubair dari Jabir. Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Al Ahwash] dari [Laits] dari [Abu Az Zubair] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas. Perawi berkata; telah menceritakan kepada kami Huraim bin Mis'ar telah menceritakan kepada kami Fudlail dari Laits dari Thawus ia berkata; \"Keduanya melebihi setiap surat dalam al-Qur`an dengan tujuhpuluh kebaikan.\""
            },
            {
                "number": 2751,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْحَرَشِيُّ الْبَصْرِيُّ حَدَّثَنَا الْحَسَنُ بْنُ سَلْمِ بْنِ صَالِحٍ الْعِجْلِيُّ حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَرَأَ إِذَا زُلْزِلَتْ عُدِلَتْ لَهُ بِنِصْفِ الْقُرْآنِ وَمَنْ قَرَأَ قُلْ يَا أَيُّهَا الْكَافِرُونَ عُدِلَتْ لَهُ بِرُبُعِ الْقُرْآنِ وَمَنْ قَرَأَ قُلْ هُوَ اللَّهُ أَحَدٌ عُدِلَتْ لَهُ بِثُلُثِ الْقُرْآنِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ هَذَا الشَّيْخِ الْحَسَنِ بْنِ سَلْمٍ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Musa Al Harasyi Al Bashri] telah menceritakan kepada kami [Al Hasan bin Salm bin Shalih Al Ijli] telah menceritakan kepada kami [Tsabit Al Bunani] dari [Anas bin Malik] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membaca \"IDZA ZULZILAT\" maka akan digantikan baginya dengan separuh Al Qur`an, barangsiapa membaca \"QUL YAA AYYUHAL KAAFIRUUN\" maka akan di gantikan baginya dengan seperempat Al Qur`an dan barangsiapa membaca \"QUL HUWALLAAHU AHAD\" maka akan disamakan baginya dengan sepertiga Al Qur`an.\" Abu Isa berkata; Hadits ini gharib, kami tidak mengetahuinya kecuali dari hadits syaikh ini, yaitu Al Hasan bin Salm. Dan dalam bab ini, ada juga hadits dari Ibnu Abbas."
            },
            {
                "number": 2752,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا يَمَانُ بْنُ الْمُغِيرَةِ الْعَنَزِيُّ حَدَّثَنَا عَطَاءٌ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا زُلْزِلَتْ تَعْدِلُ نِصْفَ الْقُرْآنِ وَقُلْ هُوَ اللَّهُ أَحَدٌ تَعْدِلُ ثُلُثَ الْقُرْآنِ وَقُلْ يَا أَيُّهَا الْكَافِرُونَ تَعْدِلُ رُبُعَ الْقُرْآنِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ يَمَانِ بْنِ الْمُغِيرَةِ",
                "id": "Telah menceritakan kepada kami [Ali bin Hujr] telah mengabarkan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Yaman bin Al Mughirah Al Anazi] telah mengabarkan kepada kami [Atha`] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"(Surat) IDZA ZULZILAT sama seperti separuh Al Qur`an, QUL HUWALLAAHU AHAD sama seperti sepertiga Al Qur`an dan QUL YAA AYYUHAL KAAFIRUUN sama seperti seperempat Al Qur`an.\" Abu Isa berkata; Hadits ini gharib, kami tidak mengetahuinya kecuali dari hadits Yaman bin Al Mughirah."
            },
            {
                "number": 2753,
                "arab": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ الْبَصْرِيُّ حَدَّثَنِي ابْنُ أَبِي فُدَيْكٍ أَخْبَرَنَا سَلَمَةُ بْنُ وَرْدَانَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ مِنْ أَصْحَابِهِ هَلْ تَزَوَّجْتَ يَا فُلَانُ قَالَ لَا وَاللَّهِ يَا رَسُولَ اللَّهِ وَلَا عِنْدِي مَا أَتَزَوَّجُ بِهِ قَالَ أَلَيْسَ مَعَكَ قُلْ هُوَ اللَّهُ أَحَدٌ قَالَ بَلَى قَالَ ثُلُثُ الْقُرْآنِ قَالَ أَلَيْسَ مَعَكَ إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ قَالَ بَلَى قَالَ رُبُعُ الْقُرْآنِ قَالَ أَلَيْسَ مَعَكَ قُلْ يَا أَيُّهَا الْكَافِرُونَ قَالَ بَلَى قَالَ رُبُعُ الْقُرْآنِ قَالَ أَلَيْسَ مَعَكَ إِذَا زُلْزِلَتْ الْأَرْضُ قَالَ بَلَى قَالَ رُبُعُ الْقُرْآنِ قَالَ تَزَوَّجْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ",
                "id": "Telah menceritakan kepada kami ['Uqbah bin Mukram Al Ammi Al Bashri] telah menceritakan kepadaku [Ibnu Abu Fudaik] telah mengabarkan kepada kami [Salamah bin Wardan] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam bertanya kepada salah seorang sahabat beliau: \"Apakah kamu sudah menikah hai fulan?\" ia menjawab; \"Belum, demi Allah wahai Rasulullah, aku tidak memiliki sesuatu untuk aku pakai menikah.\" Rasulullah bertanya: \"Bukankah kamu punya (hafalan) QUL HUWALLAHU AHAD?\" Ia menjawab; \"Betul.\" Beliau bersabda: \"Sepertiga al-Qur'an.\" Beliau bertanya: \"Bukankah kau punya (hafalan) IDZAA JAA`A NASHRULLAAHI WAL FATH?\" ia menjawab; \"Benar.\" Beliau bersabda: \"Seperempat al-Qur'an.\" Beliau bertanya: \"Bukankah kamu punya (hafalan) QUL YAA`AYYUHAL KAAFIRUUN?\" ia menjawab; \"Benar.\" Beliau bersabda: \"Seperempat al-Qur'an.\" Beliau bertanya: \"Bukankah kau punya (hafalan) IDZAA ZULZILATIL ARDLU?\" ia menjawab; \"Benar.\" Beliau bersabda: \"Seperempat al-Qur'an.\" Beliau bersabda: \"Menikahlah.\" Abu Isa berkata; Hadits ini hasan."
            },
            {
                "number": 2754,
                "arab": "حَدَّثَنَا قُتَيْبَةُ وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا زَائِدَةُ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ رَبِيعِ بْنِ خُثَيْمٍ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ امْرَأَةِ أَبِي أَيُّوبَ عَنْ أَبِي أَيُّوبَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيَعْجِزُ أَحَدُكُمْ أَنْ يَقْرَأَ فِي لَيْلَةٍ ثُلُثَ الْقُرْآنِ مَنْ قَرَأَ اللَّهُ الْوَاحِدُ الصَّمَدُ فَقَدْ قَرَأَ ثُلُثَ الْقُرْآنِوَفِي الْبَاب عَنْ أَبِي الدَّرْدَاءِ وَأَبِي سَعِيدٍ وَقَتَادَةَ بْنِ النُّعْمَانِ وَأَبِي هُرَيْرَةَ وَأَنَسٍ وَابْنِ عُمَرَ وَأَبِي مَسْعُودٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَلَا نَعْرِفُ أَحَدًا رَوَى هَذَا الْحَدِيثَ أَحْسَنَ مِنْ رِوَايَةِ زَائِدَةَ وَتَابَعَهُ عَلَى رِوَايَتِهِ إِسْرَائِيلُ وَالْفُضَيْلُ بْنُ عِيَاضٍ وَقَدْ رَوَى شُعْبَةُ وَغَيْرُ وَاحِدٍ مِنْ الثِّقَاتِ هَذَا الْحَدِيثَ عَنْ مَنْصُورٍ وَاضْطَرَبُوا فِيهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah] dan [Muhammad bin Basyar] keduanya berkata; telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Za'idah] dari [Manshur] dari [Hilal bin Yasaf] dari [Rabi' bin Khutsaim] dari ['Amru bin Maimun] dari [Abdurrahman bin Abu Laila] dari [istrinya Abu Ayyub] dari [Abu Ayyub] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidakkah salah seorang dari kalian mampu membaca sepertiga Al Qur`an dalam waktu semalam, barangsiapa membaca ALAAHUL WAAHIDUSH SHAMAD (Surat Al Ikhlas) berarti dia membaca sepertiga Al Qur`an.\" Dan dalam bab ini, ada hadits dari Abu Darda`, Abu Sa'id, Qatadah bin Nu'man, Abu Hurairah, Anas, Ibnu Umar dan Abu Mas'ud. Abu Isa berkata; Hadits ini hasan, dan kami tidak mengetahui seorang pun meriwayatkan hadits ini yang lebih baik dari riwayatnya Za`idah, dan riwayatnya disempurnakan pula oleh [Isra`il] dan [Al Fudlail bin Iyadl]. Syu'bah dan yang lainnya juga telah meriwayatkan hadits ini dari orang-orang tsiqah dari Manshur, namun mereka sedikit bertentangan dalam hadits ini."
            },
            {
                "number": 2755,
                "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا إِسْحَقُ بْنُ سُلَيْمَانَ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ ابْنِ حُنَيْنٍ مَوْلًى لِآلِ زَيْدِ بْنِ الْخَطَّابِ أَوْ مَوْلَى زَيْدِ بْنِ الْخَطَّابِ عَنْ أَبِي هُرَيْرَةَ قَالَأَقْبَلْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمِعَ رَجُلًا يَقْرَأُ قُلْ هُوَ اللَّهُ أَحَدٌ اللَّهُ الصَّمَدُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَبَتْ قُلْتُ وَمَا وَجَبَتْ قَالَ الْجَنَّةُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ مَالِكِ بْنِ أَنَسٍ وَابْنُ حُنَيْنٍ هُوَ عُبَيْدُ بْنُ حُنَيْنٍ",
                "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Ishaq bin Sulaiman] dari [Malik bin Anas] dari ['ubaidhullah bin Abdurrahman] dari [Ibnu Hunain] bekas budak milik keluarga Zaid bin Al Khaththab atau budak Zaid bin Al Khaththab, dari [Abu Hurairah] ia berkata; \"Saya pulang dari perjalanan bersama Nabi shallallahu 'alaihi wasallam, lalu beliau mendengar seseorang membaca QUL HUWALLAAHU AHAD ALAAHUSH SHAMAD, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wajib.\" Aku bertanya; \"Wajib apa?\" Beliau menjawab: \"(mendapatkan) Surga.\" Abu Isa berkata; Hadits ini hasan gharib, kami hanya mengetahuinya dari hadits Malik bin Anas. Ibnu Hunain adalah 'Ubaid bin Hunain."
            }
        ]
    }
}