{
    "status": true,
    "data": {
        "start": 3529,
        "end": 3675,
        "total": 147,
        "book": "abu-daud",
        "hadits": [
            {
                "number": 3529,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا سُفْيَانُ عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ عَنْ عُبَيْدٍ مَوْلَى أَبِي رُهْمٍ عَنْ أَبِي هُرَيْرَةَ قَالَلَقِيَتْهُ امْرَأَةٌ وَجَدَ مِنْهَا رِيحَ الطِّيبِ يَنْفَحُ وَلِذَيْلِهَا إِعْصَارٌ فَقَالَ يَا أَمَةَ الْجَبَّارِ جِئْتِ مِنْ الْمَسْجِدِ قَالَتْ نَعَمْ قَالَ وَلَهُ تَطَيَّبْتِ قَالَتْ نَعَمْ قَالَ إِنِّي سَمِعْتُ حِبِّي أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُقْبَلُ صَلَاةٌ لِامْرَأَةٍ تَطَيَّبَتْ لِهَذَا الْمَسْجِدِ حَتَّى تَرْجِعَ فَتَغْتَسِلَ غُسْلَهَا مِنْ الْجَنَابَةِقَالَ أَبُو دَاوُد الْإِعْصَارُ غُبَارٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah menceritakan kepada kami [Sufyan] dari [Ashim bin ubaidhullah] dari [Ubaid] mantan budak Abu Ruhm, dari [Abu Hurairah] ia berkata, \"Ia bertemu seorang wanita dan mencium bau harum darinya, dan ujung pakaiannya menjuntai (menyapu tanah). Ia lalu berkata, \"Wahai Budak Al Jabbar, apakah engkau datang dari masjid?\" wanita itu menjawab, \"Ya.\" Abu Hurairah bertanya lagi, \"Karena ingin ke masjidkah kamu memakai wewangian?\" wanita itu menjawab, \"Ya.\" Abu Hurairah lalu berkata, \"Sesungguhnya aku mendengar kekasihku, Abu Al Qasim shallallahu 'alaihi wasallam bersabda: \"Tidak akan diterima sholat seorang wanita yang memakai wewangian karena ingin pergi ke masjid ini, sehingga ia kembali dan mandi sebagaimana ia mandi dari junub.\" Abu Dawud berkata, \"Al I'shar maksudnya adalah debu.\""
            },
            {
                "number": 3530,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ وَسَعِيدُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ أَبُو عَلْقَمَةَ قَالَ حَدَّثَنِي يَزِيدُ بْنُ خُصَيْفَةَ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا امْرَأَةٍ أَصَابَتْ بَخُورًا فَلَا تَشْهَدَنَّ مَعَنَا الْعِشَاءَ قَالَ ابْنُ نُفَيْلٍ عِشَاءَ الْآخِرَةِ",
                "id": "Telah menceritakan kepada kami [An nufaili] dan [Sa'id bin Manshur] keduanya berkata; telah menceritakan kepada kami [Abdullah bin Muhammad Abu Alqamah] ia berkata; telah menceritakan kepadaku [Yazid bin Khushaifah] dari [Busr bin Sa'id] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wanita mana saja yang terkena bakhur (wewangian), maka jangan sekali-kali ia sholat isya bersama kami.\" Ia (perawi) berkata, \"Maksudnya adalah sholat isya yang akhir (larut malam).\""
            },
            {
                "number": 3531,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا عَطَاءٌ الْخُرَاسَانِيُّ عَنْ يَحْيَى بْنِ يَعْمَرَ عَنْ عَمَّارِ بْنِ يَاسِرٍ قَالَقَدِمْتُ عَلَى أَهْلِي لَيْلًا وَقَدْ تَشَقَّقَتْ يَدَايَ فَخَلَّقُونِي بِزَعْفَرَانٍ فَغَدَوْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيَّ وَلَمْ يُرَحِّبْ بِي وَقَالَ اذْهَبْ فَاغْسِلْ هَذَا عَنْكَ فَذَهَبْتُ فَغَسَلْتُهُ ثُمَّ جِئْتُ وَقَدْ بَقِيَ عَلَيَّ مِنْهُ رَدْعٌ فَسَلَّمْتُ فَلَمْ يَرُدَّ عَلَيَّ وَلَمْ يُرَحِّبْ بِي وَقَالَ اذْهَبْ فَاغْسِلْ هَذَا عَنْكَ فَذَهَبْتُ فَغَسَلْتُهُ ثُمَّ جِئْتُ فَسَلَّمْتُ عَلَيْهِ فَرَدَّ عَلَيَّ وَرَحَّبَ بِي وَقَالَ إِنَّ الْمَلَائِكَةَ لَا تَحْضُرُ جَنَازَةَ الْكَافِرِ بِخَيْرٍ وَلَا الْمُتَضَمِّخَ بِالزَّعْفَرَانِ وَلَا الْجُنُبَ قَالَ وَرَخَّصَ لِلْجُنُبِ إِذَا نَامَ أَوْ أَكَلَ أَوْ شَرِبَ أَنْ يَتَوَضَّأَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عُمَرُ بْنُ عَطَاءِ ابْنِ أَبِي الْخُوَارِ أَنَّهُ سَمِعَ يَحْيَى بْنَ يَعْمَرَ يُخْبِرُ عَنْ رَجُلٍ أَخْبَرَهُ عَنْ عَمَّارِ بْنِ يَاسِرٍ زَعَمَ عُمَرُ أَنَّ يَحْيَى سَمَّى ذَلِكَ الرَّجُلَ فَنَسِيَ عُمَرُ اسْمَهُ أَنَّ عَمَّارًا قَالَ تَخَلَّقْتُ بِهَذِهِ الْقِصَّةِ وَالْأَوَّلُ أَتَمُّ بِكَثِيرٍ فِيهِ ذِكْرُ الْغُسْلِ قَالَ قُلْتُ لِعُمَرَ وَهُمْ حُرُمٌ قَالَ لَا الْقَوْمُ مُقِيمُونَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah mengabarkan kepada kami [Atha Al Khurasani] dari [Yahya bin Ya'mar] dari [Ammar bin Yasir] ia berkata, \"Aku kembali ke rumah di waktu yang sudah malam, dan tanganku terlihat pecah-pecah hingga mereka melumuri aku dengan Za'faran (yang berwarna kuning). Aku lalu mendatangi Nabi shallallahu 'alaihi wasallam di waktu pagi, aku mengucapkan salam namun beliau tidak menjawab salam atau menyambutku. Bahkan beliau bersabda: \"Pergi dan bersihkanlah ini darimu.\" Aku lantas pergi dan membersihkan Za'faran tersebut. Kemudian aku mendatangi beliau meskipun masih ada sisa-sisa Za'faran. Aku mengucapkan salam namun beliau tidak menjawab atau menyambutku. Beliau bersabda: \"Bersihkan ini darimu.\" Aku lalu pergi dan membersihkannya. Kemudian aku datang dan mengucapkan salam kepadanya, lalu beliau menjawab atau menyambutku. Beliau lantas bersabda: \"Sesungguhnya malaikat tidak akan datang menghadiri jenazah orang kafir dengan kebaikan, dan pula orang yang melumuri dirinya dengan Za'faran dan orang yang junub.\" Ammar berkata, \"Beliau memberi keringanan kepada orang yang junub jika ingin tidur, atau makan, atau minum cukup dengan berwudhu.\" Telah menceritakan kepada kami [Nashr bin Ali] berkata, telah menceritakan kepada kami [Muhammad bin Bakr] berkata, telah mengabarkan kepada kami [Ibnu Juraij] berkata, telah mengabarkan kepadaku [Umar bin Atha bin Abu Al Khuwar] Bahwasanya ia mendengar [Yahya bin Ya'mar] mengabarkan dari [seorang laki-laki] ia mengabarkan kepadanya dari [Ammar bin Yasir] berkata -Umar berkeyakinan bahwa Yahya menyebut nama laki-laki itu, namun Umar lupa namanya-, \"Aku memakai wewangian…sama seperti hadits ini. namun yang pertama lebih lengkap dan sempurna, sebab disebutkan tentang mandi di dalamnya.\" Ia berkata, \"Aku bertanya kepada Umar, \"Apakah mereka sedang ihram?\" Umar berkata, \"Tidak, mereka sedang menetap di rumah.\""
            },
            {
                "number": 3532,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ الْأَسَدِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ ابْنِ الزُّبَيْرِ الْأَسَدِيُّ حَدَّثَنَا أَبُو جَعْفَرٍ الرَّازِيُّ عَنْ الرَّبِيعِ بْنِ أَنَسٍ عَنْ جَدَّيْهِ قَالَا سَمِعْنَا أَبَا مُوسَى يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقْبَلُ اللَّهُ تَعَالَى صَلَاةَ رَجُلٍ فِي جَسَدِهِ شَيْءٌ مِنْ خَلُوقٍقَالَ أَبُو دَاوُد جَدَّاهُ زَيْدٌ وَزِيَادٌ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb Al Asadi] berkata, telah menceritakan kepada kami [Muhammad bin Abdullah bin Az Zubair Al Asadi] berkata, telah menceritakan kepada kami [Abu Ja'far Ar Razi] dari [Ar Rabi' bin Anas] dari [Kedua kakeknya] keduanya berkata; kami mendengar [Abu Musa] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Ta'ala tidak menerima sholat seorang laki-laki yang pada tubuhnya Za'faran.\" Abu Dawud berkata, \"Kedua kakeknya adalah [Zaid] dan [Ziyad].\""
            },
            {
                "number": 3533,
                "arab": "حَدَّثَنَا مُسَدَّدٌ أَنَّ حَمَّادَ بْنَ زَيْدٍ وَإِسْمَعِيلَ بْنَ إِبْرَاهِيمَ حَدَّثَاهُمْ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ التَّزَعْفُرِ لِلرِّجَالِ وَقَالَ عَنْ إِسْمَعِيلَ أَنْ يَتَزَعْفَرَ الرَّجُلُ",
                "id": "Telah menceritakan kepada kami [Musaddad] bahwa [Hammad bin Zaid] dan [Isma'il bin Ibrahim] keduanya menceritakan kepada mereka dari [Abdul Aziz bin Shuhaib] dari [Anas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang penggunakan Za'faran untuk laki-laki.\""
            },
            {
                "number": 3534,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الْأُوَيْسِيُّ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ ثَوْرِ بْنِ زَيْدٍ عَنْ الْحَسَنِ بْنِ أَبِي الْحَسَنِ عَنْ عَمَّارِ بْنِ يَاسِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ثَلَاثَةٌ لَا تَقْرَبُهُمْ الْمَلَائِكَةُ جِيفَةُ الْكَافِرِ وَالْمُتَضَمِّخُ بِالْخَلُوقِ وَالْجُنُبُ إِلَّا أَنْ يَتَوَضَّأَ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] berkata, telah menceritakan kepada kami [Abdul Aziz bin Abdullah Al Uwaisi] berkata, telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Tsaur bin Zaid] dari [Al Hasan bin Abu Al Hasan] dari [Ammar bin Yasir] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tiga kelompok yang tidak akan didekati oleh malaikat; bangkai orang kafir, orang yang berlebihan dalam menggunakan wewangian dan orang junub kecuali jika ia berwudhu.\""
            },
            {
                "number": 3535,
                "arab": "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الرَّقِّيُّ حَدَّثَنَا عُمَرُ بْنُ أَيُّوبَ عَنْ جَعْفَرِ بْنِ بُرْقَانَ عَنْ ثَابِتِ بْنِ الْحَجَّاجِ عَنْ عَبْدِ اللَّهِ الْهَمْدَانِيِّ عَنْ الْوَلِيدِ بْنِ عُقْبَةَ قَالَلَمَّا فَتَحَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ جَعَلَ أَهْلُ مَكَّةَ يَأْتُونَهُ بِصِبْيَانِهِمْ فَيَدْعُو لَهُمْ بِالْبَرَكَةِ وَيَمْسَحُ رُءُوسَهُمْ قَالَ فَجِيءَ بِي إِلَيْهِ وَأَنَا مُخَلَّقٌ فَلَمْ يَمَسَّنِي مِنْ أَجْلِ الْخَلُوقِ",
                "id": "Telah menceritakan kepada kami [Ayyub bin Muhammad Ar Raqqi] berkata, telah menceritakan kepada kami [Umar bin Ayyub] dari [Ja'far bin Burqan] dari [Tsabit Ibnul Hajjaj] dari [Abdullah Al Hamdani] dari [Al Walid bin Uqbah] ia berkata, \"Ketika Nabi Allah shallallahu 'alaihi wasallam membuka kota Makkah, penduduk Makkah datang kepada beliau dengan membawa anak-anak mereka, lalu beliau mendoakan keberkahan bagi mereka dan mengusap kepala mereka.\" Al Walid berkata, \"Aku lalu dibawa menghadap beliau sementara aku penuh dengan Za'faran, maka beliau pun tidak mengusapku karena alasan Za'faran tersebut.\""
            },
            {
                "number": 3536,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا سَلْمٌ الْعَلَوِيُّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَجُلًا دَخَلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ أَثَرُ صُفْرَةٍ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَلَّمَا يُوَاجِهُ رَجُلًا فِي وَجْهِهِ بِشَيْءٍ يَكْرَهُهُ فَلَمَّا خَرَجَ قَالَ لَوْ أَمَرْتُمْ هَذَا أَنْ يَغْسِلَ هَذَا عَنْهُ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Umar bin Maisarah] berkata, telah menceritakan kepada kami [Hammad bin Zaid] berkata, telah menceritakan kepada kami [Salm Al 'Alawi] dari [Anas bin Malik] berkata, \"Seorang laki-laki masuk menemui Rasulullah shallallahu 'alaihi wasallam, sementara pada dirinya terdapat sisa-sisa warna kuning (Za'faran). Dan jarang sekali Nabi shallallahu 'alaihi wasallam menemui seseorang dengan wajah yang kurang senang karena sesuatu, maka ketika keluar beliau bersabda: \"Sekiranya kalian suruh orang ini untuk membersihkan dirinya dari sisa-sisa warna kuning.\""
            },
            {
                "number": 3537,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ وَمُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَمَا رَأَيْتُ مِنْ ذِي لِمَّةٍ أَحْسَنَ فِي حُلَّةٍ حَمْرَاءَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَادَ مُحَمَّدُ بْنُ سُلَيْمَانَ لَهُ شَعْرٌ يَضْرِبُ مَنْكِبَيْهِقَالَ أَبُو دَاوُد كَذَا رَوَاهُ إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ قَالَ يَضْرِبُ مَنْكِبَيْهِ و قَالَ شُعْبَةُ يَبْلُغُ شَحْمَةَ أُذُنَيْهِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dan [Muhammad bin Sulaiman Al Anbari] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abu Ishaq] dari [Al Bara] ia berkata, \"Aku belum pernah melihat seseorang berambut panjang yang lebih bagus ketika mengenakan pakaian berwarna merah melebihi Rasulullah shallallahu 'alaihi wasallam.\" [Muhammad bin Sulaiman] menambahkan, \"Beliau mempunyai rambut hingga kedua bahu.\" Abu Dawud berkata, \"Demikian [Isra'il] meriwayatkannya dari [Abu Ishaq], ia berkata, \"(Rambutnya) Hingga kedua pundaknya.\" Sementara Syu'bah menceritakan, \"Hingga daun telinga.\""
            },
            {
                "number": 3538,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهُ شَعْرٌ يَبْلُغُ شَحْمَةَ أُذُنَيْهِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] berkata, telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Al Bara] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mempunyai rambut yang panjangnya hingga daun telinga.\""
            },
            {
                "number": 3539,
                "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَكَانَ شَعْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى شَحْمَةِ أُذُنَيْهِ",
                "id": "Telah menceritakan kepada kami [Makhlad bin Khalid] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Tsabit] dari [Anas] ia berkata, \"Rambut Rasulullah shallallahu 'alaihi wasallam panjangnya hingga dua daun telinga.\""
            },
            {
                "number": 3540,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا إِسْمَعِيلُ أَخْبَرَنَا حُمَيْدٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَ شَعْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى أَنْصَافِ أُذُنَيْهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Isma'il] berkata, telah mengabarkan kepada kami [Humaid] dari [Anas bin Malik] ia berkata, \"Rambut Rasulullah shallallahu 'alaihi wasallam panjangnya hingga pertengahan daun telinganya.\""
            },
            {
                "number": 3541,
                "arab": "حَدَّثَنَا ابْنُ نُفَيْلٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكَانَ شَعْرُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوْقَ الْوَفْرَةِ وَدُونَ الْجُمَّةِ",
                "id": "Telah menceritakan kepada kami [Ibnu Nufail] berkata, telah menceritakan kepada kami ['Abdurrahman bin Abu Az Zinad] dari [Hisyam bin Urwah] dari [Bapaknya] dari ['Aisyah] ia berkata, \"Rambut Rasulullah shallallahu 'alaihi wasallam panjangnya melebihi daun telinga tetapi belum sampai kedua pundaknya.\""
            },
            {
                "number": 3542,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ أَخْبَرَنِي ابْنُ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ أَهْلُ الْكِتَابِ يَعْنِي يَسْدِلُونَ أَشْعَارَهُمْ وَكَانَ الْمُشْرِكُونَ يَفْرُقُونَ رُءُوسَهُمْ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُعْجِبُهُ مُوَافَقَةُ أَهْلِ الْكِتَابِ فِيمَا لَمْ يُؤْمَرْ بِهِ فَسَدَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَاصِيَتَهُ ثُمَّ فَرَقَ بَعْدُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Ibrahim bin Sa'd] berkata, telah mengabarkan kepadaku [Ibnu Syihab] dari [ubaidhullah bin Abdullah bin Utbah] dari [Ibnu Abbas] ia berkata, \"orang-orang ahli kitab biasa mengurai rambutnya dan orang-orang musyrik biasa membelah rambut kepada mereka menjadi dua bagian. Sedangkan Rasulullah shallallahu 'alaihi wasallam lebih senang menyamai orang-orang ahli kitab pada hal-hal yang tidak ada perintahnya. Maka Rasulullah shallallahu 'alaihi wasallam pun mengurai rambutnya bagian depan, kemudian membelahnya setelah itu.\""
            },
            {
                "number": 3543,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مُحَمَّدٍ يَعْنِي ابْنَ إِسْحَقَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرِ بْنِ الزُّبَيْرِ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكُنْتُ إِذَا أَرَدْتُ أَنْ أَفْرُقَ رَأْسَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَعْتُ الْفَرْقَ مِنْ يَافُوخِهِ وَأُرْسِلُ نَاصِيَتَهُ بَيْنَ عَيْنَيْهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Khalaf] berkata, telah menceritakan kepada kami [Abdul A'la] dari [Muhammad] -yaitu Ibnu Ishaq- ia berkata; telah menceritakan kepadaku [Muhammad bin Ja'far bin Az Zubair] dari [Urwah] dari ['Aisyah radliallahu 'anha] ia berkata, \"Jika aku ingin membelah (menyisir) rambut Rasulullah shallallahu 'alaihi wasallam, maka aku memulainya dari ubun-ubun dan mengurai rambut bagian depan antara dua matanya.\""
            },
            {
                "number": 3544,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ وَسُفْيَانُ بْنُ عُقْبَةَ السُّوَائِيُّ هُوَ أَخُو قَبِيصَةَ وَحُمَيْدُ بْنُ خُوَارٍ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلِي شَعْرٌ طَوِيلٌ فَلَمَّا رَآنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ذُبَابٌ ذُبَابٌ قَالَ فَرَجَعْتُ فَجَزَزْتُهُ ثُمَّ أَتَيْتُهُ مِنْ الْغَدِ فَقَالَ إِنِّي لَمْ أَعْنِكَ وَهَذَا أَحْسَنُ",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul 'Ala] berkata, telah menceritakan kepada kami [Mu'awiyah bin Hisyam] dan [Sufyan bin Uqbah As Suwa`i] -ia adalah saudara Qabishah dan [Humaid bin Khuwar] - dari [Sufyan Ats Tsauri] dari [Ashim bin Kulaib] dari [Bapaknya] dari [Wail bin Hujr] ia berkata, \"Aku mendatangi Nabi shallallahu 'alaihi wasallam, sementara aku mempunyai rambut yang panjang. Ketika Rasulullah shallallahu 'alaihi wasallam melihatku beliau bersabda: \"Lalat, lalat.\" Wail bin Hujr berkata, \"Maka aku kembali pulang dan memangkasnya, setelah itu aku mendatangi beliau pada keesokan harinya. Beliau bersabda: \"Sesungguhnya aku tidak bermaksud untuk menjelekkanmu namun ini (sekarang) lebih baik.\""
            },
            {
                "number": 3545,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ قَالَ قَالَتْ أُمُّ هَانِئٍقَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى مَكَّةَ وَلَهُ أَرْبَعُ غَدَائِرَ تَعْنِي عَقَائِصَ",
                "id": "Telah menceritakan kepada kami [An Nufaili] berkata, telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Najih] dari [Mujahid] ia berkata; [Ummu Hani] berkata, \"Nabi shallallahu 'alaihi wasallam datang ke Makkah, dan saat itu beliau mempunyai empat kepangan.\""
            },
            {
                "number": 3546,
                "arab": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ وَابْنُ الْمُثَنَّى قَالَا حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ مُحَمَّدَ بْنَ أَبِي يَعْقُوبَ يُحَدِّثُ عَنْ الْحَسَنِ بْنِ سَعْدٍ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْهَلَ آلَ جَعْفَرٍ ثَلَاثًا أَنْ يَأْتِيَهُمْ ثُمَّ أَتَاهُمْ فَقَالَ لَا تَبْكُوا عَلَى أَخِي بَعْدَ الْيَوْمِ ثُمَّ قَالَ ادْعُوا لِي بَنِي أَخِي فَجِيءَ بِنَا كَأَنَّا أَفْرُخٌ فَقَالَ ادْعُوا لِي الْحَلَّاقَ فَأَمَرَهُ فَحَلَقَ رُءُوسَنَا",
                "id": "Telah menceritakan kepada kami [Uqbah bin Mukram] dan [Ibnu Al Mutsanna] keduanya berkata; telah menceritakan kepada kami [Wahb bin Jarir] berkata, telah menceritakan kepada kami [Bapakku] ia berkata, \"Aku mendengar [Muhammad bin Abu Ya'qub] ia menceritakan dari [Al Hasan bin Sa'd] dari [Abdullah bin Ja'far] berkata, \"Nabi shallallahu 'alaihi wasallam memberi tenggang waktu untuk keluarga Ja'far selama tiga hari, setelah itu beliau datang kepada mereka dan bersabda: \"Setelah ini, janganlah kalian menangisi saudaraku.\" Setelah itu beliau bersabda: \"Undanglah kemari bani saudaraku.\" kami lalu dihadapkan kepada beliau layaknya anak-anak ayam, beliau lantas bersabda: \"Panggilkan tukang cukur kepadaku.\" Beliau lalu memerintah tukang tukur itu (untuk mencukur), hingga kami semua dicukur olehnya.\""
            },
            {
                "number": 3547,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عُثْمَانُ بْنُ عُثْمَانَ قَالَ أَحْمَدُ كَانَ رَجُلًا صَالِحًا قَالَ أَخْبَرَنَا عُمَرُ بْنُ نَافِعٍ عَنْ أَبِيهِ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْقَزَعِ وَالْقَزَعُ أَنْ يُحْلَقَ رَأْسُ الصَّبِيِّ فَيُتْرَكَ بَعْضُ شَعْرِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Utsman bin Utsman] -Ahmad berkata; ia adalah seorang laki-laki yang shalih- ia berkata; telah mengabarkan kepada kami [Umar bin Nafi'] dari [Bapaknya] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang Al Qaza', Al Qaza' adalah kepala anak kecil yang dicukur sebagiannya dan dibiarkan sebagian.\""
            },
            {
                "number": 3548,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْقَزَعِ وَهُوَ أَنْ يُحْلَقَ رَأْسُ الصَّبِيِّ فَتُتْرَكَ لَهُ ذُؤَابَةٌ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah menceritakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu Umar] berkata, \"Nabi shallallahu 'alaihi wasallam melarang Al Qaza'. Yaitu mencukur kepala anak kecil dengan menyisakan sedikit (dikepang).\""
            },
            {
                "number": 3549,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى صَبِيًّا قَدْ حُلِقَ بَعْضُ شَعْرِهِ وَتُرِكَ بَعْضُهُ فَنَهَاهُمْ عَنْ ذَلِكَ وَقَالَ احْلِقُوهُ كُلَّهُ أَوْ اتْرُكُوهُ كُلَّهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah menceritakan kepada kami [Ma'mar] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] berkata, \"Nabi shallallahu 'alaihi wasallam melihat melihat anak kecil yang rambutnya dicukur sebagian dan disisakan sebagian, lalu beliau melarang hal itu. Beliau bersabda: \"Cukurlah semua atau sisakan semua.\""
            },
            {
                "number": 3550,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ عَنْ مَيْمُونِ بْنِ عَبْدِ اللَّهِ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَتْ لِي ذُؤَابَةٌ فَقَالَتْ لِي أُمِّي لَا أَجُزُّهَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمُدُّهَا وَيَأْخُذُ بِهَا",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul 'Ala] berkata, telah menceritakan kepada kami [Zaid Ibnul Hubab] dari [Maimun bin Abdullah] dari [Tsabit Al Bunani] dari [Anas bin Malik] ia berkata, \"Aku mempunyai jambul. Ibuku lalu berkata kepadaku, \"Aku tidak akan memotongnya, Rasulullah shallallahu 'alaihi wasallam biasa memanjangkan dan memegangnya.\""
            },
            {
                "number": 3551,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا الْحَجَّاجُ بْنُ حَسَّانَ قَالَ دَخَلْنَا عَلَى أَنَسِ بْنِ مَالِكٍ فَحَدَّثَتْنِي أُخْتِي الْمُغِيرَةُ قَالَتْوَأَنْتَ يَوْمَئِذٍ غُلَامٌ وَلَكَ قَرْنَانِ أَوْ قُصَّتَانِ فَمَسَحَ رَأْسَكَ وَبَرَّكَ عَلَيْكَ وَقَالَ احْلِقُوا هَذَيْنِ أَوْ قُصُّوهُمَا فَإِنَّ هَذَا زِيُّ الْيَهُودِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah menceritakan kepada kami [Al Hajjaj bin Hassan] ia berkata; Kami masuk menemui [Anas bin Malik], lalu [saudara pererempuan Al Mughirah] menceritakan kepadaku, ia berkata, \"Dahulu kamu masih bocah, dan kamu mempunyai dua tanduk (jambul), lalu Anas mengusap kepalamu dan mendoakan keberkahan untukmu. Ia lalu berkata, \"cukurlah atau pangkaslah dua jambul ini, karena ini adalah hiasan orang-orang yahudi.\""
            },
            {
                "number": 3552,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ عَنْ أَبِي هُرَيْرَةَيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْفِطْرَةُ خَمْسٌ أَوْ خَمْسٌ مِنْ الْفِطْرَةِ الْخِتَانُ وَالِاسْتِحْدَادُ وَنَتْفُ الْإِبِطِ وَتَقْلِيمُ الْأَظْفَارِ وَقَصُّ الشَّارِبِ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id] dari [Abu Hurairah] dan sampai kepada Nabi shallallahu 'alaihi wasallam, \"Fitrah (suci) itu ada pada lima hal, atau ada lima hal dari fitrah; khitan, mencukur bulu kemaluan, mencabut bulu ketiak, memotong kuku dan mencukur kumis.\""
            },
            {
                "number": 3553,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِإِحْفَاءِ الشَّوَارِبِ وَإِعْفَاءِ اللِّحَى",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi] dari [Malik] dari [Abu Bakr bin Nafi'] dari [Bapaknya] dari [Abdullah bin Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan mencukur kumis dan membiarkan janggut.\""
            },
            {
                "number": 3554,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا صَدُقَةُ الدَّقِيقِيُّ حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَوَقَّتَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَلْقَ الْعَانَةِ وَتَقْلِيمَ الْأَظْفَارِ وَقَصَّ الشَّارِبِ وَنَتْفَ الْإِبِطِ أَرْبَعِينَ يَوْمًا مَرَّةًقَالَ أَبُو دَاوُد رَوَاهُ جَعْفَرُ بْنُ سُلَيْمَانَ عَنْ أَبِي عِمْرَانَ عَنْ أَنَسٍ لَمْ يَذْكُرْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وُقِّتَ لَنَا وَهَذَا أَصَحُّ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Shadaqah Ad Daqiqi] berkata, telah menceritakan kepada kami [Abu Imran Al Jauni] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memberi waktu kita untuk mencukur bulu kemaluan, memotong kuku, mencukur kumis dan mencabut bulu ketiak selama empat puluh hari sekali.\" Abu Dawud berkata \" [Ja'far bin Sulaiman] menceritakannya dari [Abu Imran], dari [Anas]. Namun ia tidak menyebut Nabi shallallahu 'alaihi wasallam. Ia berkata, \"Kami diberi waktu…\", dan ini yang benar. "
            },
            {
                "number": 3555,
                "arab": "حَدَّثَنَا ابْنُ نُفَيْلٍ حَدَّثَنَا زُهَيْرٌ قَرَأْتُ عَلَى عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ وَقَرَأَهُ عَبْدُ الْمَلِكِ عَلَى أَبِي الزُّبَيْرِ وَرَوَاهُ أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَكُنَّا نُعْفِي السِّبَالَ إِلَّا فِي حَجٍّ أَوْ عُمْرَةٍقَالَ أَبُو دَاوُد الِاسْتِحْدَادُ حَلْقُ الْعَانَةِ",
                "id": "Telah menceritakan kepada kami [Ibnu Nufail] berkata, telah menceritakan kepada kami [Zuhair] aku membaca di hadapan [Abdul Malik bin Abu Sualiman] dan Abdul Malik membacanya di hadapan [Abu Az Zubair] dan Abu Az Zubair meriwayatkannya dari [Jabir] ia berkata, \"Kami membiarkan Sibal (bulu janggut yang panjang hingga dada) kecuali pada saat haji dan umrah.\" Abu Dawud berkata, \"Al Istihdad artinya adalah mencukur bulu kemaluan.\""
            },
            {
                "number": 3556,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ الْمَعْنَى عَنْ ابْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَنْتِفُوا الشَّيْبَ مَا مِنْ مُسْلِمٍ يَشِيبُ شَيْبَةً فِي الْإِسْلَامِ قَالَ عَنْ سُفْيَانَ إِلَّا كَانَتْ لَهُ نُورًا يَوْمَ الْقِيَامَةِ وَقَالَ فِي حَدِيثِ يَحْيَى إِلَّا كَتَبَ اللَّهُ لَهُ بِهَا حَسَنَةً وَحَطَّ عَنْهُ بِهَا خَطِيئَةً",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Sufyan] secara makna, dari [Ibnu 'Ajlan] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mencabut uban, tidaklah seorang muslim tumbuh uban padanya dalam Islam -disebutkan oleh Sufyan dalam riwayatnya- \"Kecuali ia akan menjadi cahaya baginya pada hari kiamat.\" Dalam riwayat lain (oleh Yahya) disebutkan, \"Kecuali dengannya Allah akan menuliskan satu kebaikan dan dihapuskan darinya satu dosa.\""
            },
            {
                "number": 3557,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ وَسُلَيْمَانَ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْيَهُودَ وَالنَّصَارَى لَا يَصْبُغُونَ فَخَالِفُوهُمْ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Abu Salamah] dan [Sulaiman bin Yasar] dari [Abu Hurairah] dan sampai kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya orang-orang Yahudi dan Nashara tidak mencelup (menyemir rambut), maka selisihilah mereka.\""
            },
            {
                "number": 3558,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ وَأَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَأُتِيَ بِأَبِي قُحَافَةَ يَوْمَ فَتْحِ مَكَّةَ وَرَأْسُهُ وَلِحْيَتُهُ كَالثَّغَامَةِ بَيَاضًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيِّرُوا هَذَا بِشَيْءٍ وَاجْتَنِبُوا السَّوَادَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Amru bin As Sarh] dan [Ahmad bin Sa'id Al Hamdani] keduanya berkata; telah menceritakan kepada kami [Ibnu Wahb] berkata, telah menceritakan kepada kami [Ibnu Juraij] dari [Abu Az Zubair] dari [Jabir bin Abdullah] ia berkata, \"Pada saat pembukaan kota Makkah, Abu Kuhafah dihadapkan kepada Rasulullah, sementara rambut dan janggutnya putih seperti bunga berwarna putih, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Rubahlah warna rambutmu ini dengan sesuatu, dan jauhilah warna hitam.\""
            },
            {
                "number": 3559,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ سَعِيدٍ الْجُرَيْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِي الْأَسْوَدِ الدِّيْلِيِّ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَحْسَنَ مَا غُيِّرَ بِهِ هَذَا الشَّيْبُ الْحِنَّاءُ وَالْكَتَمُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah menceritakan kepada kami [Ma'mar] dari [Sa'id Al Jurairi] dari [Abdullah bin Buraidah] dari [Abu Al Aswad Ad dili] dari [Abu Dzar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya yang paling baik untuk mengubah warna uban ini adalah pacar dan Al Katam (sejenis pacar).\""
            },
            {
                "number": 3560,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ إِيَادٍ قَالَ حَدَّثَنَا إِيَادٌ عَنْ أَبِي رِمْثَةَ قَالَانْطَلَقْتُ مَعَ أَبِي نَحْوَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا هُوَ ذُو وَفْرَةٍ بِهَا رَدْعُ حِنَّاءٍ وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِحَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا ابْنُ إِدْرِيسَ قَالَ سَمِعْتُ ابْنَ أَبْجَرَ عَنْ إِيَادِ بْنِ لَقِيطٍ عَنْ أَبِي رِمْثَةَ فِي هَذَا الْخَبَرِ قَالَ فَقَالَ لَهُ أَبِي أَرِنِي هَذَا الَّذِي بِظَهْرِكَ فَإِنِّي رَجُلٌ طَبِيبٌ قَالَ اللَّهُ الطَّبِيبُ بَلْ أَنْتَ رَجُلٌ رَفِيقٌ طَبِيبُهَا الَّذِي خَلَقَهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] berkata, telah menceritakan kepada kami [ubaidhullah] - maksudnya ubaidhullah bin Had- ia berkata; telah menceritakan kepada kami [Iyad] dari [Abu Rimtsah] ia berkata, \"Aku bersama bapakku pergi menemui Nabi shallallahu 'alaihi wasallam, dan ternyata rambut beliau panjangnya hingga daun telinga yang diberi warna dengan daun pacar, dan beliau mengenakan dua kain berwarna hijau.\" Telah menceritakan kepada kami [Muhammad Ibnul 'Ala] berkata, telah menceritakan kepada kami [Ibnu Idris] ia berkata; Aku mendengar [Ibnu Abjar] dari [Iyad bin Laqith] dari [Abu Rimtsah] berkenaan dengan kabar ini. Ia (perawi) berkata; Lalu bapakku berkata kepadanya, \"Perlihatkanlah kepadaku apa yang ada di punggungmu, karena aku adalah seorang tabib.\" Ia berkata, \"Demi Allah, engkau hanyalah perantara. Tabib yang sebenarnya adalah Dzat Yang telah menciptakannya (sakit).\""
            },
            {
                "number": 3561,
                "arab": "حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ إِيَادِ بْنِ لَقِيطٍ عَنْ أَبِي رِمْثَةَ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَأَبِي فَقَالَ لِرَجُلٍ أَوْ لِأَبِيهِ مَنْ هَذَا قَالَ ابْنِي قَالَ لَا تَجْنِي عَلَيْهِ وَكَانَ قَدْ لَطَّخَ لِحْيَتَهُ بِالْحِنَّاءِ",
                "id": "Telah menceritakan kepada kami [Ibnu Basysyar] berkata, telah menceritakan kepada kami ['Abdurrahman] berkata, telah menceritakan kepada kami [Sufyan] dari [Iyad bin Laqith] dari [Abu Rimtsah] ia berkata, \"Aku dan bapakku mendatangi Nabi shallallahu 'alaihi wasallam, lalu beliau bertanya kepada seorang laki-laki, atau kepada bapaknya: \"Siapa ini?\" orang itu menjawab, \"Anakku.\" Beliau bersabda: \"Jangan engkau berlaku jahat kepadanya.\" Dan saat itu ia sedang mewarnai janggutnya dengan pacar.\""
            },
            {
                "number": 3562,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ أَنَسٍأَنَّهُ سُئِلَ عَنْ خِضَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَنَّهُ لَمْ يَخْضِبْ وَلَكِنْ قَدْ خَضَبَ أَبُو بَكْرٍ وَعُمَرُ رَضِيَ اللَّهُ عَنْهُمَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid] berkata, telah menceritakan kepada kami [Hammad] dari [Tsabit] dari [Anas] Bahwasanya ia pernah ditanya tentang warna cat (rambut) Nabi shallallahu 'alaihi wasallam. Lalu ia menyebutkan bahwa Rasulullah tidak pernah mengecat rambutnya, hanya saja hal itu pernah dilakukan oleh Abu Bakar dan Umar radliallahu 'anhuma.\""
            },
            {
                "number": 3563,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ مُطَرِّفٍ أَبُو سُفْيَانَ حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ حَدَّثَنَا ابْنُ أَبِي رَوَّادٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَلْبَسُ النِّعَالَ السِّبْتِيَّةَ وَيُصَفِّرُ لِحْيَتَهُ بِالْوَرْسِ وَالزَّعْفَرَانِوَكَانَ ابْنُ عُمَرَ يَفْعَلُ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Abdurrahim bin Mutaharrif Abu Sufyan] berkata, telah menceritakan kepada kami [Amru bin Muhammad] berkata, telah menceritakan kepada kami [Ibnu Abu Rawwad] dari [Nafi'] dari [Ibnu Umar] berkata, \"Nabi shallallahu 'alaihi wasallam mengenakan sandal yang bertali dan memberi warna janggutnya dengan Al Waras (semacam tumbuhan) dan Za'faran. Dan Ibnu Umar juga melakukan hal itu.\""
            },
            {
                "number": 3564,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ عَنْ حُمَيْدِ بْنِ وَهْبٍ عَنْ ابْنِ طَاوُسٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَمَرَّ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ قَدْ خَضَّبَ بِالْحِنَّاءِ فَقَالَ مَا أَحْسَنَ هَذَا قَالَ فَمَرَّ آخَرُ قَدْ خَضَّبَ بِالْحِنَّاءِ وَالْكَتَمِ فَقَالَ هَذَا أَحْسَنُ مِنْ هَذَا قَالَ فَمَرَّ آخَرُ قَدْ خَضَّبَ بِالصُّفْرَةِ فَقَالَ هَذَا أَحْسَنُ مِنْ هَذَا كُلِّهِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ishaq bin Manshur] berkata, telah menceritakan kepada kami [Muhammad bin Thalhah] dari [Humaid bin Wahb] dari [Ibnu Thawus] dari [Thawus] dari [Ibnu Abbas] ia berkata, \"Seorang laki-laki yang mengecat rambutnya dengan pacar lewat dihadapan Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Betapa bagusnya ini.\" Setelah itu lewat orang lain yang mewarnai rambutnya dengan pacar dan Al Katam (tanaman semacam daun pacar), beliau bersabda: \"Orang ini lebih bagus dari yang tadi.\" Setelah itu lewat orang lain yang mewarnai rambutnya dengan warna kuning, beliau bersabda: \"Orang ini lebih bagus dari yang tadi-tadi.\""
            },
            {
                "number": 3565,
                "arab": "حَدَّثَنَا أَبُو تَوْبَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكُونُ قَوْمٌ يَخْضِبُونَ فِي آخِرِ الزَّمَانِ بِالسَّوَادِ كَحَوَاصِلِ الْحَمَامِ لَا يَرِيحُونَ رَائِحَةَ الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Abu Taubah] berkata, telah menceritakan kepada kami [ubaidhullah] dari [Abdul Karim Al jazari] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada akhir zaman nanti akan ada orang-orang yang mengecat rambutnya dengan warna hitam seperti warna mayoritas dada merpati, mereka tidak akan mendapat bau surga.\""
            },
            {
                "number": 3566,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ جُحَادَةَ عَنْ حُمَيْدٍ الشَّامِيِّ عَنْ سُلَيْمَانَ الْمُنَبِّهِيِّ عَنْ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَافَرَ كَانَ آخِرُ عَهْدِهِ بِإِنْسَانٍ مِنْ أَهْلِهِ فَاطِمَةَ وَأَوَّلُ مَنْ يَدْخُلُ عَلَيْهَا إِذَا قَدِمَ فَاطِمَةَ فَقَدِمَ مِنْ غَزَاةٍ لَهُ وَقَدْ عَلَّقَتْ مِسْحًا أَوْ سِتْرًا عَلَى بَابِهَا وَحَلَّتْ الْحَسَنَ وَالْحُسَيْنَ قُلْبَيْنِ مِنْ فِضَّةٍ فَقَدِمَ فَلَمْ يَدْخُلْ فَظَنَّتْ أَنَّ مَا مَنَعَهُ أَنْ يَدْخُلَ مَا رَأَى فَهَتَكَتْ السِّتْرَ وَفَكَّكَتْ الْقُلْبَيْنِ عَنْ الصَّبِيَّيْنِ وَقَطَّعَتْهُ بَيْنَهُمَا فَانْطَلَقَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُمَا يَبْكِيَانِ فَأَخَذَهُ مِنْهُمَا وَقَالَ يَا ثَوْبَانُ اذْهَبْ بِهَذَا إِلَى آلِ فُلَانٍ أَهْلِ بَيْتٍ بِالْمَدِينَةِ إِنَّ هَؤُلَاءِ أَهْلُ بَيْتِي أَكْرَهُ أَنْ يَأْكُلُوا طَيِّبَاتِهِمْ فِي حَيَاتِهِمْ الدُّنْيَا يَا ثَوْبَانُ اشْتَرِ لِفَاطِمَةَ قِلَادَةً مِنْ عَصَبٍ وَسِوَارَيْنِ مِنْ عَاجٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abdul Warits bin Sa'id] dari [Muhammad bin Juhadah] dari [Humaid Asy Syami] dari [Sulaiman Al Munabbihi] dari [Tsauban] mantan budak (yang telah dimerdekakan oleh) Rasulullah shallallahu 'alaihi wasallam, ia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam melakukan safar, maka orang yang paling akhir beliau beri nasihat dari keluarganya adalah Fatimah, dan orang yang pertama kali beliau temui saat datang adalah Fatimah. Satu kali beliau tiba dari peperangan yang dilakukannya, sementara Fatimah telah memasang satir di pintunya dan memasang perhiasan gelang perak pada hasan dan husain. Beliau datang namun tidak masuk, hal itu menjadikan Fatimah berperasangka bahwa tidak masuknya Rasulullah adalah karena apa yang beliau lihat dari yang ia lakukan. Lalu ia menyobek tirai dan melepas dua gelang yang ada pada kedua anaknya. Setelah itu ia membawa kedua anaknya yang masih menangis untuk menemui Rasulullah shallallahu 'alaihi wasallam. Beliau lantas meraih gelang tersebut dari keduanya dan bersabda: \"Wahai Tsauban, pergilah dengan membawa ini (gelang) ke keluarga fulan -ahlu bait di Madinah-, mereka (keluarga Fathimah) adalah ahli baitku, aku tidak ingin mereka makan dengan enak dalam kehidupan mereka di dunia. Wahai Tsauban, belikanlah Fatimah kalung dari ashab (sejenis tumbuhan) dan dua gelang dari gading.\""
            },
            {
                "number": 3567,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ مُطَرِّفٍ الرُّوَاسِيُّ حَدَّثَنَا عِيسَى عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَأَرَادَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَكْتُبَ إِلَى بَعْضِ الْأَعَاجِمِ فَقِيلَ لَهُ إِنَّهُمْ لَا يَقْرَءُونَ كِتَابًا إِلَّا بِخَاتَمٍ فَاتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ وَنَقَشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِحَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍ بِمَعْنَى حَدِيثِ عِيسَى بْنِ يُونُسَ زَادَ فَكَانَ فِي يَدِهِ حَتَّى قُبِضَ وَفِي يَدِ أَبِي بَكْرٍ حَتَّى قُبِضَ وَفِي يَدِ عُمَرَ حَتَّى قُبِضَ وَفِي يَدِ عُثْمَانَ فَبَيْنَمَا هُوَ عِنْدَ بِئْرٍ إِذْ سَقَطَ فِي الْبِئْرِ فَأَمَرَ بِهَا فَنُزِحَتْ فَلَمْ يَقْدِرْ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Abdurrahim bin Mutharrif Ar Ruwasi] berkata, telah menceritakan kepada kami [Isa] dari [Sa'id] dari [Qatadah] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam ingin menulis surat untuk orang-orang di luar arab, lalu dikatakan kepada beliau, \"Sesungguhnya mereka tidak mau membaca surat tanpa ada setempelnya.\" Rasulullah kemudian membuat cincin dari perak dan memberi ukiran Muhammad Rasulullah.\" Telah menceritakan kepada kami [Wahb bin Baqiyyah] dari [Khalid] dari [Sa'id] dari [Qatadah] dari [Anas] sebagaimana makna hadits Isa bin Yunus. Namun ia menambahkan, \"cincin itu tetap berada dijarinya hingga meninggal, lalu pindah ke Abu Bakar hingga meninggal, lalu pindah ke Umar hingga meninggal, lalu pindah ke tangan Utsman. Dan ketika Utsman sedang berada di dekat sumur, cincin itu jatuh. Utsman memerintahkan untuk mencarinya namun tidak ketemu.\""
            },
            {
                "number": 3568,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَحْمَدُ بْنُ صَالِحٍ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ عَنْ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي أَنَسٌ قَالَكَانَ خَاتَمُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ وَرِقٍ فَصُّهُ حَبَشِيٌّ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Ahmad bin Shalih] keduanya berkata; telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Yunus bin Yazid] dari [Ibnu Syihab] ia berkata; telah menceritakan kepadaku [Anas] ia berkata, \"Cincin Nabi shallallahu 'alaihi wasallam terbuat dari perak, sedangkan mata cincinnya dari Habasyah.\""
            },
            {
                "number": 3569,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا حُمَيْدٌ الطَّوِيلُ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَ خَاتَمُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ فِضَّةٍ كُلُّهُ فَصُّهُ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] berkata, telah menceritakan kepada kami [Zuhair] berkata, telah menceritakan kepada kami [Humaid Ath Thawil] dari [Anas bin Malik] ia berkata, \"Cincin Nabi shallallahu 'alaihi wasallam terbuat dari perak, demikian juga dengan mata cincinnya.\""
            },
            {
                "number": 3570,
                "arab": "حَدَّثَنَا نُصَيْرُ بْنُ الْفَرَجِ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَاتَّخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا مِنْ ذَهَبٍ وَجَعَلَ فَصَّهُ مِمَّا يَلِي بَطْنَ كَفِّهِ وَنَقَشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ فَاتَّخَذَ النَّاسُ خَوَاتِمَ الذَّهَبِ فَلَمَّا رَآهُمْ قَدْ اتَّخَذُوهَا رَمَى بِهِ وَقَالَ لَا أَلْبَسُهُ أَبَدًا ثُمَّ اتَّخَذَ خَاتَمًا مِنْ فِضَّةٍ نَقَشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ ثُمَّ لَبِسَ الْخَاتَمَ بَعْدَهُ أَبُو بَكْرٍ ثُمَّ لَبِسَهُ بَعْدَ أَبِي بَكْرٍ عُمَرُ ثُمَّ لَبِسَهُ بَعْدَهُ عُثْمَانُ حَتَّى وَقَعَ فِي بِئْرِ أَرِيسٍقَالَ أَبُو دَاوُد وَلَمْ يَخْتَلِفْ النَّاسُ عَلَى عُثْمَانَ حَتَّى سَقَطَ الْخَاتَمُ مِنْ يَدِهِ حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ فِي هَذَا الْخَبَرِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَقَشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ وَقَالَ لَا يَنْقُشُ أَحَدٌ عَلَى نَقْشِ خَاتَمِي هَذَا ثُمَّ سَاقَ الْحَدِيثَ حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بِنِ فَارِسٍ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ الْمُغِيرَةِ بْنِ زِيَادٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ بِهَذَا الْخَبَرِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَالْتَمَسُوهُ فَلَمْ يَجِدُوهُ فَاتَّخَذَ عُثْمَانُ خَاتَمًا وَنَقَشَ فِيهِ مُحَمَّدٌ رَسُولُ اللَّهِ قَالَ فَكَانَ يَخْتِمُ بِهِ أَوْ يَتَخَتَّمُ بِهِ",
                "id": "Telah menceritakan kepada kami [Nushair bin Faraj] berkata, telah menceritakan kepada kami [Abu Usamah] dari [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam membuat cincin dari emas, beliau menghadapkan mata cincinnya ke arah telapak tangan, dan beliau memberi ukiran pada cincin itu dengan tulisan 'Muhammad Rasulullah'. Orang-orang lalu ikut membuat cincin dari emas, ketika beliau melihat mereka membuat cincin seperti itu, beliau membuang cincinnya seraya mengatakan: \"Selamanya aku tidak akan memakainya lagi.\" Kemudian beliau membuat cincin dari perak dan memberi ukiran pada cincin tersebut 'Muhammad Rasulullah'. Cincin itu kemudian dipakai oleh Abu Bakar, kemudian Umar, kemudian Utsman hingga akhirnya cincin tersebut jatuh ke dalam sumur Aris.\" Abu Dawud berkata, \"Orang-orang belum berselisih dengan Utsman hingga cincin itu jatuh dari tangannya (ke dalam sumur).\" Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ayyub bin Musa] dari [Nafi'] dari [Ibnu Umar] tentang hadits ini, dari Nabi shallallahu 'alaihi wasallam, \"Beliau memberi ukiran 'Muhammad Rasulullah', dan beliau bersabda: \"Janganlah seseorang membuat ukiran sebagaimana ukiran yang aku buat ini.\" kemudian ia menyebutkan hadits secara lengkap. Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] berkata, telah menceritakan kepada kami [Abu Ashim] dari [Al Mughirah bin Ziyad] dari [Nafi'] dari [Ibnu Umar] seperti hadits ini, dari Nabi shallallahu 'alaihi wasallam, ia menyebutkan, \"Orang-orang lalu mencari cincin itu namun tidak ketemu. Maka Utsman pun membuat cincin lagi dan memberi ukiran 'Muhammad Rasulullah'.\" Ibnu Umar berkata, \"Utsman lantas memberi setempel dengan cincin tersebut.\""
            },
            {
                "number": 3571,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ لُوَيْنٌ عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّهُ رَأَى فِي يَدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاتَمًا مِنْ وَرِقٍ يَوْمًا وَاحِدًا فَصَنَعَ النَّاسُ فَلَبِسُوا وَطَرَحَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَطَرَحَ النَّاسُقَالَ أَبُو دَاوُد رَوَاهُ عَنْ الزُّهْرِيِّ زِيَادُ بْنُ سَعْدٍ وَشُعَيْبٌ وَابْنُ مُسَافِرٍ كُلُّهُمْ قَالَ مِنْ وَرِقٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Luwain] dari [Ibrahim bin Sa'd] dari [Ibnu Syihab] dari [Anas bin Malik] Bahwasanya ia pernah melihat pada tangan Nabi shallallahu 'alaihi wasallam cincin perak selama satu hari. Orang-orang lalu ikut membuat cincin hingga Nabi shallallahu 'alaihi wasallam membuang cincinnya, lalu orang-orang pun ikut membuangnya.\" Abu Dawud berkata, \" [Ziyad bin Sa'd] dan [Syu'aib] dan [Ibnu Musafir] diriwayatkan hadits itu dari [Az Zuhri], ia berkata, \"Yaitu dari perak.\""
            },
            {
                "number": 3572,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ الرُّكَيْنَ بْنَ الرَّبِيعِ يُحَدِّثُ عَنْ الْقَاسِمِ بْنِ حَسَّانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ أَنَّ ابْنَ مَسْعُودٍ كَانَ يَقُولُكَانَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْرَهُ عَشْرَ خِلَالٍ الصُّفْرَةَ يَعْنِي الْخَلُوقَ وَتَغْيِيرَ الشَّيْبِ وَجَرَّ الْإِزَارِ وَالتَّخَتُّمَ بِالذَّهَبِ وَالتَّبَرُّجَ بِالزِّينَةِ لِغَيْرِ مَحَلِّهَا وَالضَّرْبَ بِالْكِعَابِ وَالرُّقَى إِلَّا بِالْمُعَوِّذَاتِ وَعَقْدَ التَّمَائِمِ وَعَزْلَ الْمَاءِ لِغَيْرِ أَوْ غَيْرَ مَحَلِّهِ أَوْ عَنْ مَحَلِّهِ وَفَسَادَ الصَّبِيِّ غَيْرَ مُحَرِّمِهِقَالَ أَبُو دَاوُد انْفَرَدَ بِإِسْنَادِ هَذَا الْحَدِيثِ أَهْلُ الْبَصْرَةِ وَاللَّهُ أَعْلَمُ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Al Mu'tamir] ia berkata; Aku mendengar [Ar Rukain bin Ar Rabi'] ia menceritakan dari [Al Qasim bin Hassan] dari ['Abdurrahman bin Harmalah] bahwa [Ibnu Mas'ud] berkata, \"Rasulullah shallallahu 'alaihi wasallam membenci sepuluh hal; warna kuning -Za'faran-, mengecat uban (dengan warna hitam), memanjangkan sarung, memakai cincin emas, memakai perhiasan bukan pada tempatnya, dadu, jampi-jampi selain dengan Al Mu'awwidzat, menggantungkan jimat dan meng'azl air mani bukan pada tempatnya serta menyetubuhi wanita yang menyusui balita lalu hamil hingga membuat balita kering dari susu ibunya (karena hamil), dan beliau tidak mengharamkannya (hanya membencinya).\" Abu Dawud berkata, \"Penduduk Bashrah meriwayatkan hadits ini secara sendirian (tidak ada yang meriwayatkan selain mereka).\" Wallahu a'lam. "
            },
            {
                "number": 3573,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ الْمَعْنَى أَنَّ زَيْدَ بْنَ حُبَابٍ أَخْبَرَهُمْ عَنْ عَبْدِ اللَّهِ بْنِ مُسْلِمٍ السُّلَمِيِّ الْمَرْوَزِيِّ أَبِي طَيْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِأَنَّ رَجُلًا جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ خَاتَمٌ مِنْ شَبَهٍ فَقَالَ لَهُ مَا لِي أَجِدُ مِنْكَ رِيحَ الْأَصْنَامِ فَطَرَحَهُ ثُمَّ جَاءَ وَعَلَيْهِ خَاتَمٌ مِنْ حَدِيدٍ فَقَالَ مَا لِي أَرَى عَلَيْكَ حِلْيَةَ أَهْلِ النَّارِ فَطَرَحَهُ فَقَالَ يَا رَسُولَ اللَّهِ مِنْ أَيِّ شَيْءٍ أَتَّخِذُهُ قَالَ اتَّخِذْهُ مِنْ وَرِقٍ وَلَا تُتِمَّهُ مِثْقَالًاوَلَمْ يَقُلْ مُحَمَّدٌ عَبْدَ اللَّهِ بْنَ مُسْلِمٍ وَلَمْ يَقُلْ الْحَسَنُ السُّلَمِيَّ الْمَرْوَزِيَّ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] dan [Muhammad bin Abdul Aziz bin Abu Rizmah] secara makna, bahwa [Zaid bin Hubab] mengabarkan kepada mereka dari [Abdullah bin Muslim As Sulami Al Mawarzi Abu Thaubah] dari [Abdullah bin Buraidah] dari [Bapaknya] ia berkata, \"Seorang laki-laki datang menemui Nabi shallallahu 'alaihi wasallam, sementara ia mengenakan cincin dari kuningan tembaga. Beliau lalu berkata kepadanya: \"Kenapa aku mendapatkan bau berhala darimu!\" laki-laki itu lantas membuang cincinnya. Setelah itu ia datang lagi dengan mengenakan cincin besi, beliau bersabda: \"Kenapa melihatmu mengenakan perhiasan penduduk neraka!\" laki-laki lantas membuangnya kembali, lalu ia bertanya, \"Wahai Rasulullah, lalu dari apa aku harus membuatnya?\" beliau menjawab: \"Dari perak, namun jangan engkau genapkan hingga (beratnya) satu mitsqal.\" Muhammad tidak menyebutkan, \"Abdullah bin Muslim, atau Al Hasan As Sulami Al Mawarzi.\" "
            },
            {
                "number": 3574,
                "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى وَزِيَادُ بْنُ يَحْيَى وَالْحَسَنُ بْنُ عَلِيٍّ قَالُوا حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ أَبُو عَتَّابٍ حَدَّثَنَا أَبُو مَكِينٍ نُوحُ بْنُ رَبِيعَةَ حَدَّثَنِي إِيَاسُ بْنُ الْحَارِثِ بْنِ الْمُعَيْقِيبِ وَجَدُّهُ مِنْ قِبَلِ أُمِّهِ أَبُو ذُبَابٍ عَنْ جَدِّهِ قَالَكَانَ خَاتَمُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ حَدِيدٍ مَلْوِيٌّ عَلَيْهِ فِضَّةٌ قَالَ فَرُبَّمَا كَانَ فِي يَدِهِ قَالَ وَكَانَ الْمُعَيْقِيبُ عَلَى خَاتَمِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ibnul Mutsanna] dan [Ziyad bin Yahya] dan [Al hasan bin Ali] mereka berkata; telah menceritakan kepada kami [Sahl bin Hammad Abu Attab] berkata, telah menceritakan kepada kami [Abu Makin Nuh bin Rabi'ah] berkata, telah menceritakan kepadaku [Iyas Ibnul Harits Ibnul Mu'aiqib] dan kakeknya dari pihak ibunya Abu Dzubab dari [Kakeknya] ia berkata, \"Cincin Nabi shallallahu 'alaihi wasallam terbuat dari besi bercampur perak.\" Ia melanjutkan, \"Dan mungkin itu masih di tangannya. Sementara cincin Mu'aiqib mengatakan seperti Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3575,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا عَاصِمُ بْنُ كُلَيْبٍ عَنْ أَبِي بُرْدَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْ اللَّهُمَّ اهْدِنِي وَسَدِّدْنِي وَاذْكُرْ بِالْهِدَايَةِ هِدَايَةَ الطَّرِيقِ وَاذْكُرْ بِالسَّدَادِ تَسْدِيدَكَ السَّهْمَ قَالَ وَنَهَانِي أَنْ أَضَعَ الْخَاتَمَ فِي هَذِهِ أَوْ فِي هَذِهِ لِلسَّبَّابَةِ وَالْوُسْطَى شَكَّ عَاصِمٌ وَنَهَانِي عَنْ الْقَسِّيَّةِ وَالْمِيثَرَةِقَالَ أَبُو بُرْدَةَ فَقُلْنَا لِعَلِيٍّ مَا الْقَسِّيَّةُ قَالَ ثِيَابٌ تَأْتِينَا مِنْ الشَّامِ أَوْ مِنْ مِصْرَ مُضَلَّعَةٌ فِيهَا أَمْثَالُ الْأُتْرُجِّ قَالَ وَالْمِيثَرَةُ شَيْءٌ كَانَتْ تَصْنَعُهُ النِّسَاءُ لِبُعُولَتِهِنَّ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Ibnul Mufadhdhal] berkata, telah menceritakan kepada kami [Ashim bin Kulaib] dari [Abu Burdah] dari [Ali radliallahu 'anhu] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Ucapkanlah; ALLAHUMMAHDINII WA SADDIDNII WADZKUR BILHIDAAYAH HIDAAYATATH THARIIQI WADZKUR BIS SADDAADI TASDIIDAKA AS SAHMI (Ya Allah, tunjukkanlah kami, luruskanlah kami, tunjukkan kami kepada jalan yang benar, dan tunjukkan kepada kami kebenaran sebagaimana Engkau tancapkan anak panah kepada sasarannya).\" Ali berkata, \"Beliau juga melarangku untuk meletakkan cincin pada ini dan ini; jari telunjuk dan jari tengah -Ashim masih merasa ragu-. Beliau juga melarangku dari Al Qasiyah dan Al Mitsarah.\" Abu Burdah berkata, \"Kami bertanya kepada Ali, \"Apa itu Al Qasiyah?\" Ia menjawab, \"Kain yang berasal dari Syam atau Mesir yang bergaris-garis bengkok. Sementara Al Mitsarah adalah sesuatu yang dibuat oleh kaum wanita untuk suami-suaminya.\""
            },
            {
                "number": 3576,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلَالٍ عَنْ شَرِيكِ بْنِ أَبِي نَمِرَةَ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ عَنْ أَبِيهِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ شَرِيكٌ و أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَخَتَّمُ فِي يَمِينِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Sulaiman bin Bilal] dari [Syarik bin Abu Namirah] dari [Ibrahim bin Abdullah bin Hunain] dari [Bapaknya] dari [Ali radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam, [Syarik] berkata, \"Telah mengabarkan kepadaku [Abu Salamah bin 'Abdurrahman], bahwa Nabi shallallahu 'alaihi wasallam mengenakan cincin pada tangan kanannya.\""
            },
            {
                "number": 3577,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنِي أَبِي حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي رَوَّادٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَخَتَّمُ فِي يَسَارِهِ وَكَانَ فَصُّهُ فِي بَاطِنِ كَفِّهِقَالَ أَبُو دَاوُد قَالَ ابْنُ إِسْحَقَ وَأُسَامَةُ يَعْنِي ابْنَ زَيْدٍ عَنْ نَافِعٍ بِإِسْنَادِهِ فِي يَمِينِهِ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] berkata, telah menceritakan kepadaku [Bapakku] berkata, telah menceritakan kepada kami [Abdul Aziz bin Abu Rawwad] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam biasa menggenakan cincin pada tangan kirinya dan mata cincinnya menghadap telapak tangannya.\" Abu Dawud berkata, \" [Ibnu Ishaq] berkata, \" [Usamah] -maksudnya Usamah bin Zaid- juga meriwayatkan dari [Nafi'] dengan sanadnya, \"pada tangan kanannya.\""
            },
            {
                "number": 3578,
                "arab": "حَدَّثَنَا هَنَّادٌ عَنْ عَبْدَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍأَنَّ ابْنَ عُمَرَ كَانَ يَلْبَسُ خَاتَمَهُ فِي يَدِهِ الْيُسْرَى",
                "id": "Telah menceritakan kepada kami [Hannad] dari [Abdah] dari [ubaidhullah] dari [Nafi'] berkata, \" [Ibnu Umar] mengenakan cincinnya pada tangan kirinya.\""
            },
            {
                "number": 3579,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ قَالَرَأَيْتُ عَلَى الصَّلْتِ بْنِ عَبْدِ اللَّهِ بْنِ نَوْفَلِ بْنِ عَبْدِ الْمُطَّلِبِ خَاتَمًا فِي خِنْصَرِهِ الْيُمْنَى فَقُلْتُ مَا هَذَا قَالَ رَأَيْتُ ابْنَ عَبَّاسٍ يَلْبَسُ خَاتَمَهُ هَكَذَا وَجَعَلَ فَصَّهُ عَلَى ظَهْرِهَا قَالَ وَلَا يَخَالُ ابْنَ عَبَّاسٍ إِلَّا قَدْ كَانَ يَذْكُرُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَلْبَسُ خَاتَمَهُ كَذَلِكَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] berkata, telah menceritakan kepada kami [Yunus bin Bukair] dari [Muhammad bin Ishaq] ia berkata, \"Aku melihat [Ash Shalt bin Abdullah bin Naufal bin Abdul Muthallib] mengenakan cincin pada jari kelingking sebelah kanan. Aku lalu bertanya, \"Apa ini?\" ia menjawab, \"Aku melihat [Ibnu Abbas] mengenakan cincinnya seperti ini, ia menghadapkan mata cincinnya ke punggung telapak tangannya.\" Ia (Muhammad bin Ishaq) berkata, \"dia tidak berpendapat kecuali Ibnu Abbas sendiri yang menyebutkan bahwa Rasulullah shallallahu 'alaihi wasallam mengenakan cincinnya seperti itu.\""
            },
            {
                "number": 3580,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ سَهْلٍ وَإِبْرَاهِيمُ بْنُ الْحَسَنِ قَالَا حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي عُمَرُ بْنُ حَفْصٍ أَنَّ عَامِرَ بْنَ عَبْدِ اللَّهِ قَالَ عَلِيُّ بْنُ سَهْلِ بْنِ الزُّبَيْرِ أَخْبَرَهُأَنَّ مَوْلَاةً لَهُمْ ذَهَبَتْ بِابْنَةِ الزُّبَيْرِ إِلَى عُمَرَ بْنِ الْخَطَّابِ وَفِي رِجْلِهَا أَجْرَاسٌ فَقَطَعَهَا عُمَرُ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ مَعَ كُلِّ جَرَسٍ شَيْطَانًا",
                "id": "Telah menceritakan kepada kami [Ali bin Sahl] dan [Ibrahim Ibnul Hasan] keduanya berkata; telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] berkata, telah mengabarkan kepadaku [Umar bin Hafsh] bahwa [Amir bin Abdullah] berkata; Ali bin Sahl bin Az Zubair mengabarkan kepadanya bahwa mantan budak perempuannya (yang telah ia merdekakan) pergi bersama puteri Az Zubair menemui [Umar Ibnul Khaththab], sementara pada kakinya terdapat kerincing (lonceng) hingga Umar memotongnya. Kemudian Umar berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya pada setiap lonceng ada setan (yang menyertainya).\""
            },
            {
                "number": 3581,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ حَدَّثَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ بُنَانَةَ مَوْلَاةِ عَبْدِ الرَّحْمَنِ بْنِ حَسَّانَ الْأَنْصَارِيِّ عَنْ عَائِشَةَ قَالَتْبَيْنَمَا هِيَ عِنْدَهَا إِذْ دُخِلَ عَلَيْهَا بِجَارِيَةٍ وَعَلَيْهَا جَلَاجِلُ يُصَوِّتْنَ فَقَالَتْ لَا تُدْخِلْنَهَا عَلَيَّ إِلَّا أَنْ تَقْطَعُوا جَلَاجِلَهَا وَقَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَدْخُلُ الْمَلَائِكَةُ بَيْتًا فِيهِ جَرَسٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdurrahim] berkata, telah menceritakan kepada kami [Rauh] berkata, telah menceritakan kepada kami [Ibnu Juraij] dari [Bunanah] -mantan budak (yang dimerdekakan oleh) 'Abdurrahman bin Hassan Al Anshari- dari ['Aisyah radliallahu 'anha], ia mengatakan bahwa ketika ia sedang bersama Bunanah, ada seorang budak wanita datang kepadanya dengan mengenakan gelang kaki yang berbunyi keras. 'Aisyah lalu berkata, \"Jangan kalian masukkan ia untuk menemuiku hingga kalian memotong gelangnya. Setelah itu ia berkata lagi, \"Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Malaikat tidak akan masuk ke dalam rumah yang di dalamnya terdapat lonceng.\""
            },
            {
                "number": 3582,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ الْمَعْنَى قَالَا حَدَّثَنَا أَبُو الْأَشْهَبِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ طَرَفَةَأَنَّ جَدَّهُ عَرْفَجَةَ بْنَ أَسْعَدَ قُطِعَ أَنْفُهُ يَوْمَ الْكُلَابِ فَاتَّخَذَ أَنْفًا مِنْ وَرِقٍ فَأَنْتَنَ عَلَيْهِ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاتَّخَذَ أَنْفًا مِنْ ذَهَبٍحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ وَأَبُو عَاصِمٍ قَالَا حَدَّثَنَا أَبُو الْأَشْهَبِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ طَرَفَةَ عَنْ عَرْفَجَةَ بْنِ أَسْعَدَ بِمَعْنَاهُ قَالَ يَزِيدُ قُلْتُ لِأَبِي الْأَشْهَبِ أَدْرَكَ عَبْدُ الرَّحْمَنِ بْنُ طَرَفَةَ جَدَّهُ عَرْفَجَةَ قَالَ نَعَمْ حَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ حَدَّثَنَا إِسْمَعِيلُ عَنْ أَبِي الْأَشْهَبِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ طَرَفَةَ عَنْ عَرْفَجَةَ بْنِ أَسْعَدَ عَنْ أَبِيهِ أَنَّ عَرْفَجَةَ بِمَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] dan [Muhammad bin Abdullah Al Khuza'i] keduanya berkata; telah menceritakan kepada kami [Abu Al Asyhab] dari ['Abdurrahman bin Tharafah] bahwa kakeknya [Arfajah bin As'ad], hidungnya terpotong saat perang Al Kilab. Lalu ia membuat hidung palsu dari perak, tetapi justru hidungnya menjadi busuk. Nabi shallallahu 'alaihi wasallam lalu memerintahkan kepadanya (untuk membuat hidung dari emas), hingga ia pun membuat hidung dari emas.\" Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Yazid bin Harun] dan [Abu Ashim] keduanya berkata; telah menceritakan kepada kami [Abu Al Asyhab] dari ['Abdurrahman bin Tharafah] dari [Arfajah bin As'ad] dengan makna yang sama. Yazid berkata, \"Aku berkata kepada Abu Al Asyhab, \"Apakah 'Abdurrahman bin Tharafah mendapati kakeknya, Arfajah?\" Ia menjawab, \"Ya.\" Telah menceritakan kepada kami [Muammal bin Hisyam] berkata, telah menceritakan kepada kami [Isma'il] dari [Abu Al Asyhab] dari ['Abdurrahman bin Tharafah] dari Arfajah bin As'ad dari [Bapaknya] bahwa [Arfajah] …. dengan makna yang sama.\""
            },
            {
                "number": 3583,
                "arab": "حَدَّثَنَا ابْنُ نُفَيْلٍ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ قَالَ حَدَّثَنِي يَحْيَى بْنُ عَبَّادٍ عَنْ أَبِيهِ عَبَّادِ بْنِ عَبْدِ اللَّهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَدِمَتْ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِلْيَةٌ مِنْ عِنْدِ النَّجَاشِيِّ أَهْدَاهَا لَهُ فِيهَا خَاتَمٌ مِنْ ذَهَبٍ فِيهِ فَصٌّ حَبَشِيٌّ قَالَتْ فَأَخَذَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعُودٍ مُعْرِضًا عَنْهُ أَوْ بِبَعْضِ أَصَابِعِهِ ثُمَّ دَعَا أُمَامَةَ ابْنَةَ أَبِي الْعَاصِ ابْنَةَ ابْنَتِهِ زَيْنَبَ فَقَالَ تَحَلَّيْ بِهَذَا يَا بُنَيَّةُ",
                "id": "Telah menceritakan kepada kami [Ibnu Nufail] berkata, telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq] ia berkata; telah menceritakan kepadaku [Yahya bin Abbad] dari bapaknya [Abbad bin Abdullah] dari ['Aisyah radliallahu 'anha] ia berkata, \"Nabi shallallahu 'alaihi wasallam mendapat kiriman perhiasan dari An Najasyi sebagai hadiah. Di antara perhiasan tersebut terdapat sebuah cincin emas yang mata cincinnya dari habasyah. 'Aisyah berkata, \"Rasulullah shallallahu 'alaihi wasallam lalu mengambilnya dengan sebatang kayu, atau jarinya karena tidak suka. Beliau kemudian memanggil Umamah binti Abu Al Ash, anak perempuan dari puterinya Zainab, beliau bersabda: \"Wahai anakku, pakailah perhiasan ini.\""
            },
            {
                "number": 3584,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ أَسِيدِ بْنِ أَبِي أَسِيدٍ الْبَرَّادِ عَنْ نَافِعِ بْنِ عَيَّاشٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَحَبَّ أَنْ يُحَلِّقَ حَبِيبَهُ حَلْقَةً مِنْ نَارٍ فَلْيُحَلِّقْهُ حَلْقَةً مِنْ ذَهَبٍ وَمَنْ أَحَبَّ أَنْ يُطَوِّقَ حَبِيبَهُ طَوْقًا مِنْ نَارٍ فَلْيُطَوِّقْهُ طَوْقًا مِنْ ذَهَبٍ وَمَنْ أَحَبَّ أَنْ يُسَوِّرَ حَبِيبَهُ سِوَارًا مِنْ نَارٍ فَلْيُسَوِّرْهُ سِوَارًا مِنْ ذَهَبٍ وَلَكِنْ عَلَيْكُمْ بِالْفِضَّةِ فَالْعَبُوا بِهَا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] berkata, telah menceritakan kepada kami [Abdul Aziz] -maksudnya Abdul Aziz bin Muhammad- dari [Asid bin Abu Asid Al Barrad] dari [Nafi' bin Ayyasy] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa ingin memberi cincin kekasihnya dengan cincin dari api, hendaklah ia memberinya cincin dari emas. Barangsiapa ingin memberi gelang kepada kekasihnya dengan gelang dari api, hendaklah ia memberinya gelang dari emas. Dan barangsiapa ingin memberi gelang kepada kekasihnya dengan gelang dari api, hendaklah ia memberinya gelang dari emas. Hendaklah kalian menggunakan perak, dan bersenang-senanglah kalian dengannya.\""
            },
            {
                "number": 3585,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ امْرَأَتِهِ عَنْ أُخْتٍ لِحُذَيْفَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَا مَعْشَرَ النِّسَاءِ أَمَا لَكُنَّ فِي الْفِضَّةِ مَا تَحَلَّيْنَ بِهِ أَمَا إِنَّهُ لَيْسَ مِنْكُنَّ امْرَأَةٌ تَحَلَّى ذَهَبًا تُظْهِرُهُ إِلَّا عُذِّبَتْ بِهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Manshur] dari [Rib'I bin Hirasy] dari [Isterinya] dari [Saudara perempuan Hudzaifah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai sekalian wanita, tidak cukupkah perak sebagai perhiasan kalian? Tidaklah salah seorang wanita dari kalian mengenakan perhiasan emas, lalu memperlihatkannya (kepada orang lain) kecuali ia akan disiksa.\""
            },
            {
                "number": 3586,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ الْعَطَّارُ حَدَّثَنَا يَحْيَى أَنَّ مَحْمُودَ بْنَ عَمْرٍو الْأَنْصَارِيَّ حَدَّثَهُ أَنَّ أَسْمَاءَ بِنْتَ يَزِيدَ حَدَّثَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا امْرَأَةٍ تَقَلَّدَتْ قِلَادَةً مِنْ ذَهَبٍ قُلِّدَتْ فِي عُنُقِهَا مِثْلَهُ مِنْ النَّارِ يَوْمَ الْقِيَامَةِ وَأَيُّمَا امْرَأَةٍ جَعَلَتْ فِي أُذُنِهَا خُرْصًا مِنْ ذَهَبٍ جُعِلَ فِي أُذُنِهَا مِثْلُهُ مِنْ النَّارِ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Aban bin Yazid Al 'Aththar] berkata, telah menceritakan kepada kami [Yahya] bahwa [Mahmud bin Amru Al Anshari] menceritakan kepadanya, bahwa [Asma binti Yazid] menceritakan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wanita mana saja memakai kalung emas, maka pada hari kiamat kelak ia akan diberi kalung yang semisal dari api. Dan wanita mana saja yang di telinganya terdapat anting emas, maka pada hari kiamat kelak ia akan diberi anting yang semisal dari api.\""
            },
            {
                "number": 3587,
                "arab": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا إِسْمَعِيلُ حَدَّثَنَا خَالِدٌ عَنْ مَيْمُونٍ الْقَنَّادِ عَنْ أَبِي قِلَابَةَ عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ رُكُوبِ النِّمَارِ وَعَنْ لُبْسِ الذَّهَبِ إِلَّا مُقَطَّعًاقَالَ أَبُو دَاوُد أَبُو قِلَابَةَ لَمْ يَلْقَ مُعَاوِيَةَ",
                "id": "Telah menceritakan kepada kami [Humaid bin Mas'adah] berkata, telah menceritakan kepada kami [Isma'il] berkata, telah menceritakan kepada kami [Khalid] dari [Maimun Al Qannad] dari [Abu Qilabah] dari [Mu'awiyah bin Abu Sufyan] berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang mengendarai macan dan mengenakan emas kecuali yang telah diputus-putus.\" Abu Dawud berkata, \"Abu Qilabah belum pernah bertemu Mu'awiyah.\""
            },
            {
                "number": 3588,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَ قَالَقَامَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمًا فَمَا تَرَكَ شَيْئًا يَكُونُ فِي مَقَامِهِ ذَلِكَ إِلَى قِيَامِ السَّاعَةِ إِلَّا حَدَّثَهُ حَفِظَهُ مَنْ حَفِظَهُ وَنَسِيَهُ مَنْ نَسِيَهُ قَدْ عَلِمَهُ أَصْحَابُهُ هَؤُلَاءِ وَإِنَّهُ لَيَكُونُ مِنْهُ الشَّيْءُ فَأَذْكُرُهُ كَمَا يَذْكُرُ الرَّجُلُ وَجْهَ الرَّجُلِ إِذَا غَابَ عَنْهُ ثُمَّ إِذَا رَآهُ عَرَفَهُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Wail] dari [Hudzaifah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah berdiri di hadapan kami (khutbah), tidak ada sesuatu pun yang bakal terjadi hingga datang hari kiamat kecuali beliau jelaskan saat itu (berdiri). Maka hafallah orang yang hafal dan lupalah orang yang lupa, dan para sahabatnya telah mengetahui hal itu. Sungguh, aku dapat mengingat apa yang disampaikan saat itu, sebagaimana seorang laki-laki yang mengingat wajah orang yang pergi kemudian bertemu lagi.\""
            },
            {
                "number": 3589,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ عَنْ بَدْرِ بْنِ عُثْمَانَ عَنْ عَامِرٍ عَنْ رَجُلٍ عَنْ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَكُونُ فِي هَذِهِ الْأُمَّةِ أَرْبَعُ فِتَنٍ فِي آخِرِهَا الْفَنَاءُ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] berkata, telah menceritakan kepada kami [Abu Dawud Al Hafari] dari [Badr bin Utsman] dari [Amir] dari [seorang laki-laki] dari [Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Pada umatku akan terjadi empat macam fitnah, dan yang terakhir adalah kebinasaan.\""
            },
            {
                "number": 3590,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ عُثْمَانَ بْنِ سَعِيدٍ الْحِمْصِيُّ حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ سَالِمٍ حَدَّثَنِي الْعَلَاءُ بْنُ عُتْبَةَ عَنْ عُمَيْرِ بْنِ هَانِئٍ الْعَنْسِيِّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُكُنَّا قُعُودًا عِنْدَ رَسُولِ اللَّهِ فَذَكَرَ الْفِتَنَ فَأَكْثَرَ فِي ذِكْرِهَا حَتَّى ذَكَرَ فِتْنَةَ الْأَحْلَاسِ فَقَالَ قَائِلٌ يَا رَسُولَ اللَّهِ وَمَا فِتْنَةُ الْأَحْلَاسِ قَالَ هِيَ هَرَبٌ وَحَرْبٌ ثُمَّ فِتْنَةُ السَّرَّاءِ دَخَنُهَا مِنْ تَحْتِ قَدَمَيْ رَجُلٍ مِنْ أَهْلِ بَيْتِي يَزْعُمُ أَنَّهُ مِنِّي وَلَيْسَ مِنِّي وَإِنَّمَا أَوْلِيَائِي الْمُتَّقُونَ ثُمَّ يَصْطَلِحُ النَّاسُ عَلَى رَجُلٍ كَوَرِكٍ عَلَى ضِلَعٍ ثُمَّ فِتْنَةُ الدُّهَيْمَاءِ لَا تَدَعُ أَحَدًا مِنْ هَذِهِ الْأُمَّةِ إِلَّا لَطَمَتْهُ لَطْمَةً فَإِذَا قِيلَ انْقَضَتْ تَمَادَتْ يُصْبِحُ الرَّجُلُ فِيهَا مُؤْمِنًا وَيُمْسِي كَافِرًا حَتَّى يَصِيرَ النَّاسُ إِلَى فُسْطَاطَيْنِ فُسْطَاطِ إِيمَانٍ لَا نِفَاقَ فِيهِ وَفُسْطَاطِ نِفَاقٍ لَا إِيمَانَ فِيهِ فَإِذَا كَانَ ذَاكُمْ فَانْتَظِرُوا الدَّجَّالَ مِنْ يَوْمِهِ أَوْ مِنْ غَدِهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Utsman bin Sa'id Al Himshi] berkata, telah menceritakan kepada kami [Abu Al Mughirah] berkata, telah menceritakan kepadaku [Abdullah bin Salim] berkata, telah menceritakan kepadaku [Al 'Ala bin Utbah] dari [Umair bin Hani Al 'Ansi] ia berkata; Aku mendengar [Abdullah bin Umar] berkata, \"Saat kami duduk-duduk di sisi Rasulullah shallallahu 'alaihi wasallam, beliau bercerita tentang fitnah, panjang lebar beliau bercerita seputar fitnah itu hingga beliau menyebutkan tentang fitnah Al Ahlas. Seorang laki-laki lalu bertanya, \"Wahai Rasulullah, apa itu fitnah Al Ahlas?\" beliau menjawab: \"Adanya permusuhan dan peperangan, kemudian fitnah kesenangan yang asapnya muncul dari bawah kedua kaki seorang laki-laki ahli baitku. Ia mengaku berasal dari keturunanku, padahal bukan. Wali-waliku hanya orang-orang yang bertaqwa. Kemudian orang-orang akan berdamai pada seorang laki-laki layaknya pangkal paha yang bertumpuk di tulang rusuk (kesepakatan yang semu). Kemudian akan muncul fitnah seorang yang buta (dengan kekuasaan), tidak seorang pun dari umat ini kecuali ia akan mendapat satu tamparan di mukanya (bencana kerusakan darinya). Ketika fitnah itu telah dianggap usai, namun fitnah tersebut justru berkelanjutan. Seorang laki-laki yang paginya beriman menjadi kafir di waktu sore, sehingga manusia akan menjadi dua kelompok; sekelompok orang yang beriman dan tidak ada kemunafikan dalam keimanannya, dan sekelompok orang yang penuh kemunafikan dan tidak ada keimanan padanya. Jika kondisi kalian sudah begitu, maka tunggulah munculnya Dajjal pada hari itu atau keesokan harinya.\""
            },
            {
                "number": 3591,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا ابْنُ فَرُّوخَ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ أَخْبَرَنِي ابْنٌ لِقَبِيصَةَ بْنِ ذُؤَيْبٍ عَنْ أَبِيهِ قَالَ قَالَ حُذَيْفَةُ بْنُ الْيَمَانِوَاللَّهِ مَا أَدْرِي أَنَسِيَ أَصْحَابِي أَمْ تَنَاسَوْا وَاللَّهِ مَا تَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ قَائِدِ فِتْنَةٍ إِلَى أَنْ تَنْقَضِيَ الدُّنْيَا يَبْلُغُ مَنْ مَعَهُ ثَلَاثَ مِائَةٍ فَصَاعِدًا إِلَّا قَدْ سَمَّاهُ لَنَا بِاسْمِهِ وَاسْمِ أَبِيهِ وَاسْمِ قَبِيلَتِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] berkata, telah menceritakan kepada kami [Ibnu Abu Maryam] berkata, telah mengabarkan kepada kami [Ibnu Farrukh] berkata, telah mengabarkan kepadaku [Usamah bin Zaid] berkata, telah mengabarkan kepadaku [Ibnu Qabishah bin Dzuaib] dari [Bapaknya] ia berkata; [Hudzaifah bin Yaman] berkata, \"Demi Allah, aku tidak tahu apakah para sahabatku lupa atau pura-pura lupa. Demi Allah, Rasulullah shallallahu 'alaihi wasallam tidak pernah meninggalkan penyeru fitnah hingga berakhirnya masa kehidupan dunia, yang jumlahlah lebih dari tiga ratus orang kecuali beliau menyebutkan kepada kami akan namanya, nama bapak dan kabilahnya.\""
            },
            {
                "number": 3592,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ نَصْرِ بْنِ عَاصِمٍ عَنْ سُبَيْعِ بْنِ خَالِدٍ قَالَأَتَيْتُ الْكُوفَةَ فِي زَمَنِ فُتِحَتْ تُسْتَرُ أَجْلُبُ مِنْهَا بِغَالًا فَدَخَلْتُ الْمَسْجِدَ فَإِذَا صَدْعٌ مِنْ الرِّجَالِ وَإِذَا رَجُلٌ جَالِسٌ تَعْرِفُ إِذَا رَأَيْتَهُ أَنَّهُ مِنْ رِجَالِ أَهْلِ الْحِجَازِ قَالَ قُلْتُ مَنْ هَذَا فَتَجَهَّمَنِي الْقَوْمُ وَقَالُوا أَمَا تَعْرِفُ هَذَا هَذَا حُذَيْفَةُ بْنُ الْيَمَانِ صَاحِبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ حُذَيْفَةُ إِنَّ النَّاسَ كَانُوا يَسْأَلُونَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَيْرِ وَكُنْتُ أَسْأَلُهُ عَنْ الشَّرِّ فَأَحْدَقَهُ الْقَوْمُ بِأَبْصَارِهِمْ فَقَالَ إِنِّي أَرَى الَّذِي تُنْكِرُونَ إِنِّي قُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ هَذَا الْخَيْرَ الَّذِي أَعْطَانَا اللَّهُ أَيَكُونُ بَعْدَهُ شَرٌّ كَمَا كَانَ قَبْلَهُ قَالَ نَعَمْ قُلْتُ فَمَا الْعِصْمَةُ مِنْ ذَلِكَ قَالَ السَّيْفُ قُلْتُ يَا رَسُولَ اللَّهِ ثُمَّ مَاذَا يَكُونُ قَالَ إِنْ كَانَ لِلَّهِ خَلِيفَةٌ فِي الْأَرْضِ فَضَرَبَ ظَهْرَكَ وَأَخَذَ مَالَكَ فَأَطِعْهُ وَإِلَّا فَمُتْ وَأَنْتَ عَاضٌّ بِجِذْلِ شَجَرَةٍ قُلْتُ ثُمَّ مَاذَا قَالَ ثُمَّ يَخْرُجُ الدَّجَّالُ مَعَهُ نَهْرٌ وَنَارٌ فَمَنْ وَقَعَ فِي نَارِهِ وَجَبَ أَجْرُهُ وَحُطَّ وِزْرُهُ وَمَنْ وَقَعَ فِي نَهْرِهِ وَجَبَ وِزْرُهُ وَحُطَّ أَجْرُهُ قَالَ قُلْتُ ثُمَّ مَاذَا قَالَ ثُمَّ هِيَ قِيَامُ السَّاعَةِحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ قَتَادَةَ عَنْ نَصْرِ بْنِ عَاصِمٍ عَنْ خَالِدِ بْنِ خَالِدٍ الْيَشْكُرِيِّ بِهَذَا الْحَدِيثِ قَالَ قُلْتُ بَعْدَ السَّيْفِ قَالَ بَقِيَّةٌ عَلَى أَقْذَاءٍ وَهُدْنَةٌ عَلَى دَخَنٍ ثُمَّ سَاقَ الْحَدِيثَ قَالَ وَكَانَ قَتَادَةُ يَضَعُهُ عَلَى الرِّدَّةِ الَّتِي فِي زَمَنِ أَبِي بَكْرٍ عَلَى أَقْذَاءٍ يَقُولُ قَذًى وَهُدْنَةٌ يَقُولُ صُلْحٌ عَلَى دَخَنٍ عَلَى ضَغَائِنَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ الْمُغِيرَةِ عَنْ حُمَيْدٍ عَنْ نَصْرِ بْنِ عَاصِمٍ اللَّيْثِيِّ قَالَ أَتَيْنَا الْيَشْكُرِيَّ فِي رَهْطٍ مِنْ بَنِي لَيْثٍ فَقَالَ مَنْ الْقَوْمُ قُلْنَا بَنُو لَيْثٍ أَتَيْنَاكَ نَسْأَلُكَ عَنْ حَدِيثِ حُذَيْفَةَ فَذَكَرَ الْحَدِيثَ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ هَلْ بَعْدَ هَذَا الْخَيْرِ شَرٌّ قَالَ فِتْنَةٌ وَشَرٌّ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ هَلْ بَعْدَ هَذَا الشَّرِّ خَيْرٌ قَالَ يَا حُذَيْفَةُ تَعَلَّمْ كِتَابَ اللَّهِ وَاتَّبِعْ مَا فِيهِ ثَلَاثَ مِرَارٍ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ هَلْ بَعْدَ هَذَا الشَّرِّ خَيْرٌ قَالَ هُدْنَةٌ عَلَى دَخَنٍ وَجَمَاعَةٌ عَلَى أَقْذَاءٍ فِيهَا أَوْ فِيهِمْ قُلْتُ يَا رَسُولَ اللَّهِ الْهُدْنَةُ عَلَى الدَّخَنِ مَا هِيَ قَالَ لَا تَرْجِعُ قُلُوبُ أَقْوَامٍ عَلَى الَّذِي كَانَتْ عَلَيْهِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَبَعْدَ هَذَا الْخَيْرِ شَرٌّ قَالَ فِتْنَةٌ عَمْيَاءُ صَمَّاءُ عَلَيْهَا دُعَاةٌ عَلَى أَبْوَابِ النَّارِ فَإِنْ تَمُتْ يَا حُذَيْفَةُ وَأَنْتَ عَاضٌّ عَلَى جِذْلٍ خَيْرٌ لَكَ مِنْ أَنْ تَتَّبِعَ أَحَدًا مِنْهُمْ حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا أَبُو التَّيَّاحِ عَنْ صَخْرِ بْنِ بَدْرِ الْعِجْلِيِّ عَنْ سُبَيْعِ بْنِ خَالِدٍ بِهَذَا الْحَدِيثِ عَنْ حُذَيْفَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَإِنْ لَمْ تَجِدْ يَوْمَئِذٍ خَلِيفَةً فَاهْرُبْ حَتَّى تَمُوتَ فَإِنْ تَمُتْ وَأَنْتَ عَاضٌّ وَقَالَ فِي آخِرِهِ قَالَ قُلْتُ فَمَا يَكُونُ بَعْدَ ذَلِكَ قَالَ لَوْ أَنَّ رَجُلًا نَتَجَ فَرَسًا لَمْ تُنْتَجْ حَتَّى تَقُومَ السَّاعَةُ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Qatadah] dari [Nashr bin Ashim] dari [Subai' bin Khalid] ia berkata, \"Aku pernah datang ke Kufah saat penaklukan kota Tustar tempat yang biasa aku membeli domba. Aku lantas masuk ke sebuah masjid, orang-orang banyak berkumpul, dan ternyata di sana ada seorang lelaki -jika kamu melihat, kamu akan tahu bahwa ia dari wilayah Hijaz; Makkah dan Madinah-. Aku bertanya, \"Siapakah lelaki ini?\" orang-orang memandangiku dengan sorotan tajam, mereka berkata, \"Engkau tidak tahu orang ini! ini adalah [Hudzaifah Ibnul Yaman], seorang sahabat Rasulullah shallallahu 'alaihi wasallam.\" Hudzaifah lalu berkata, \"Orang-orang banyak bertanya Rasulullah shallallahu 'alaihi wasallam tentang kebaikan, sementara aku bertanya beliau tentang keburukan.\" Orang-orang sepontan memperhatikan Hudzaifah dengan pandangan tajam, Hudzaifah melanjutkan, \"Aku tahu apa yang kalian ingkari (cemaskan). Aku pernah bertanya kepada Rasulullah, \"Wahai Rasulullah, apakah setelah kebaikan yang Allah berikan kepada kita ini, akan muncul keburukan setelahnya seperti masa-masa sebelumnya?\" Beliau menjawab: \"Benar.\" Aku bertanya lagi, \"Bagaimana bisa selamat dari hal itu?\" beliau menjawab: \"Dengan pedang.\" Aku bertanya lagi, \"Wahai Rasulullah, lantas apa yang bakal terjadi?\" Beliau menjawab: \"Jika Allah mempunyai Khalifah di muka bumi, lalu ia memukul punggung dan mengambil hartamu, maka taatilah ia. Jika tidak begitu, maka matilah kamu dalam keadaan menggigit akar pohon (tidak taat dan pergi menyepi).\" Aku bertanya lagi, \"Lalu apa yang akan terjadi?\" beliau menjawab: \"Akan muncul dajjal dengan membawa sungai dan api. Siapa yang jatuh ke dalam apinya, maka ia akan mendapatkan pahala dan akan dihapus dosanya. Dan siapa yang jatuh ke dalam sungainya, maka ia akan mendapat dosa dan digugurkan pahalanya.\" Aku bertanya lagi, \"Lalu apa lagi?\" beliau menjawab: \"Kiamat akan datang.\" Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] berkata, telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Qatadah] dari [Nashr bin Ashim] dari [Khalid bin Khalid Al Yasykuri] dengan hadits yang sama. Ia (Hudzaifah) berkata, \"Setelah pedang apa lagi?\" beliau menjawab: \"Akan tersisa kotoran mata (keburukan) dan kerisuhan yang berkedok kedamaian.\" Lalu ia menyebutkan hadits selengkapnya.\" Ia (perawai) berkata, \"Qatadah menganalogikan 'kotoran mata' adalah peristiwa riddah (pemurtadan) yang ada di masa Abu Bakar. Dan 'kerisuhan yang berkedok kedamaian' adalah upaya damai yang semu.\" Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi] berkata, telah menceritakan kepada kami [Sulaiman] -maksudnya Sulaiman bin Al Mughirah- dari [Humaid] dari [Nashr bin Ashim Al Laitsi] ia berkata, \"Kami pernah mendatangi [Al Yasykuri] dalam sebuah rombongan bani Laits, ia bertanya, \"Siapakah orang-orang itu?\" kami menjawab, \"Mereka adalah orang-orang bani Laits. Kami mendatangimu untuk menanyakan seputar hadits Hudzaifah.. lalu ia menyebutkan hadits tersebut. Hudzaifah berkata, \"Aku bertanya, \"Wahai Rasulullah, apakah setelah kebaikan ini akan ada keburukan?\" beliau menjawab: \"Fitnah dan keburukan.\" Aku bertanya lagi, \"Wahai Rasulullah, apakah setelah keburukan ini akan muncul kebaikan?\" beliau menjawab: \"Wahai Hudzaifah, pelajarilah Al-Qur'an dan ikuti apa yang ada di dalamnya.\" Beliau ulangi kata-kata itu hingga tiga kali. Aku bertanya lagi, \"Wahai Rasulullah, apakah setelah keburukan ini ada kebaikan?\" beliau menjawab: \"Kericuhan berkedok kedamaian, dan kelompok yang diselimuti oleh kekufuran.\" Aku berkata, \"Wahai Rasulullah, maksud kerisuhan berkedok kedamaian itu apa?\" beliau menjawab: \"Jika hati orang-orang tidak lagi sebagaimana fitrahnya.\" Aku bertanya lagi, \"Wahai Rasulullah, apakah setelah kebaikan ini akan muncul keburukan?\" beliau menjawab: \"Fitnahnya orang yang buta dan tuli (dari kebenaran), mereka mempunyai penyeru-penyeru yang berada di pintu neraka. Wahai Hudzaifah, jika engkau mati dalam keadaan menggigit akar pohon (pergi menjauh), maka itu lebih baik dari pada kamu mengikuti mereka.\" Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abdul Warits] berkata, telah menceritakan kepada kami [Abu At Tayyah] dari [Shakhr bin Badr Al 'Ijli] dari [Subai' bin Khalid] dengan hadits ini, dari [Hudzaifah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika pada hari itu engkau tidak mendapatkan seorang khalifah (yang adil), maka menjauhlah hingga engkau mendapati kematian, meskipun engkau mati dalam keadaan menggigit akar pohon.\" Dan pada penghujung hadits Hudzaifah berkata, \"Aku bertanya, \"Apa yang akan terjadi setelah itu?\" beliau menjawab: \"Andai kala itu ada seorang laki-laki yang mengawinkan kuda, maka ia tidak akan mendapatkan hasil hingga datang kiamat.\""
            },
            {
                "number": 3593,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا الْأَعْمَشُ عَنْ زَيْدِ بْنِ وَهْبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ رَبِّ الْكَعْبَةِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ بَايَعَ إِمَامًا فَأَعْطَاهُ صَفْقَةَ يَدِهِ وَثَمَرَةَ قَلْبِهِ فَلْيُطِعْهُ مَا اسْتَطَاعَ فَإِنْ جَاءَ آخَرُ يُنَازِعُهُ فَاضْرِبُوا رَقَبَةَ الْآخَرِ قُلْتُ أَنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَمِعَتْهُ أُذُنَايَ وَوَعَاهُ قَلْبِي قُلْتُ هَذَا ابْنُ عَمِّكَ مُعَاوِيَةُ يَأْمُرُنَا أَنْ نَفْعَلَ وَنَفْعَلَ قَالَ أَطِعْهُ فِي طَاعَةِ اللَّهِ وَاعْصِهِ فِي مَعْصِيَةِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Isa bin Yunus] berkata, telah menceritakan kepada kami [Al A'masy] dari [Zaid bin Wahb] dari ['Abdurrahman bin Abdu Rabbil Ka'bah] dari [Abdullah bin Amru] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membaiat seorang imam, ia jabat tangannya dan menyerahkan keikhlasan hatinya (untuk setia), maka hendaklah ia berikan hak ketaatan padanya semampu mungkin. Jika ada pihak lain yang ingin mengambil kekuasaannya hendaklah ia penggal lehernya.\" Aku (perawi) bertanya, \"Apakah engkau benar-benar mendengarnya dari Rasulullah shallallahu 'alaihi wasallam?\" Abdullah bin Amru menjawab: \"Kedua telingaku mendengarnya dan hatiku mengingatnya.\" Aku berkata, \"Sepupumu ini (Mu'awiyah), memerintahkan kami untuk melakukan begini dan begini?\" ia menjawab, \"Taatilah ia dalam ketaatan kepada Allah, dan ingkarilah dalam kemaksiatan kepada-Nya.\""
            },
            {
                "number": 3594,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ شَيْبَانَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدْ اقْتَرَبَ أَفْلَحَ مَنْ كَفَّ يَدَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] berkata, telah menceritakan kepada kami [ubaidhullah bin Musa] dari [Syaiban] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Celakalah orang-orang Arab dari keburukan yang kian mendekat, dan beruntunglah orang yang dapat menahan tangannya.\""
            },
            {
                "number": 3595,
                "arab": "قَالَ أَبُو دَاوُد حُدِّثْتُ عَنْ ابْنِ وَهْبٍ قَالَ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوشِكُ الْمُسْلِمُونَ أَنْ يُحَاصَرُوا إِلَى الْمَدِينَةِ حَتَّى يَكُونَ أَبْعَدَ مَسَالِحِهِمْ سَلَاحِحَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ عَنْ عَنْبَسَةَ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ قَالَ وَسَلَاحِ قَرِيبٌ مِنْ خَيْبَرَ",
                "id": "Abu Dawud berkata; aku mendapat cerita dari [Ibnu Wahb] ia berkata; telah menceritakan kepada kami [Jarir bin Hazim] dari [ubaidhullah bin Umar] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hampir-hampir kaum muslimin terkepung hingga Madinah, sampai-sampai batas akhir pertahanan mereka adalah Silah (tempat dekat Khaibar).\", telah menceritakan kepada kami Ahmad bin Shalih dari Anbasah dari Yunus dari Az Zuhri ia berkata; \"Silah adalah nama tempat yang dekat dengan Khaibar.\""
            },
            {
                "number": 3596,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ الطَّائِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنِي أَبِي قَالَ ابْنُ عَوْفٍ وَقَرَأْتُ فِي أَصْلِ إِسْمَعِيلَ قَالَ حَدَّثَنِي ضَمْضَمٌ عَنْ شُرَيْحٍ عَنْ أَبِي مَالِكٍ يَعْنِي الْأَشْعَرِيَّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ أَجَارَكُمْ مِنْ ثَلَاثِ خِلَالٍ أَنْ لَا يَدْعُوَ عَلَيْكُمْ نَبِيُّكُمْ فَتَهْلَكُوا جَمِيعًا وَأَنْ لَا يَظْهَرَ أَهْلُ الْبَاطِلِ عَلَى أَهْلِ الْحَقِّ وَأَنْ لَا تَجْتَمِعُوا عَلَى ضَلَالَةٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Auf Ath Tha`i] berkata, telah menceritakan kepada kami [Muhammad bin Isma'il] berkata, telah menceritakan kepadaku [Bapakku]. [Ibnu Auf] berkata; Aku membaca dalam buku Isma'il; ia berkata; telah menceritakan kepadaku [Dhamdham] dari [Syuraih] dari [Abu Malik] -maksudnya Abul Malik Al Asy'ari- ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah melindungi kalian dari tiga hal; jangan sampai Nabi kalian mendoakan (keburukan), hingga kalian mendapat kecelakaan, jangan sampai pendukung kebatilan (orang-orang kafir) mengalahkan pendukung kebenaran, dan jangan sampai kalian berkumpul dalam kesesatan.\""
            },
            {
                "number": 3597,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ الْبَرَاءِ بْنِ نَاجِيَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَدُورُ رَحَى الْإِسْلَامِ لِخَمْسٍ وَثَلَاثِينَ أَوْ سِتٍّ وَثَلَاثِينَ أَوْ سَبْعٍ وَثَلَاثِينَ فَإِنْ يَهْلَكُوا فَسَبِيلُ مَنْ هَلَكَ وَإِنْ يَقُمْ لَهُمْ دِينُهُمْ يَقُمْ لَهُمْ سَبْعِينَ عَامًا قَالَ قُلْتُ أَمِمَّا بَقِيَ أَوْ مِمَّا مَضَى قَالَ مِمَّا مَضَىقَالَ أَبُو دَاوُد مَنْ قَالَ خِرَاشٍ فَقَدْ أَخْطَأَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] berkata, telah menceritakan kepada kami ['Abdurrahman] dari [Sufyan] dari [Manshur] dari [rib'I bin Hirasy] dari [Al Bara bin Najiah] dari [Abdullah bin Mas'ud] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Roda Islam akan berputar (berlangsung) selama tiga puluh lima, atau tiga puluh enam, atau tiga puluh tujuh (tahun). Jika mereka binasa maka itulah jalan orang-orang yang binasa (sebelum mereka), namun jika mereka menegakkan agama, maka mereka akan tetap ada hingga tujuh puluh tahun.\" Ibnu Mas'ud berkata, \"Aku lalu bertanya, \"Dihitung dari pasca tiga puluh lima tahun, atau mulai dari awal berdirinya daulah Islam (di masa kenabian)?\" beliau menjawab: \"Dihitung dari awal.\" Abu Dawud berkata, \"Siapa yang mengatakan (Rib'ie bin) Khirasy, ia telah keliru.\""
            },
            {
                "number": 3598,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ عُثْمَانَ الشَّحَّامِ قَالَ حَدَّثَنِي مُسْلِمُ بْنُ أَبِي بَكْرَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهَا سَتَكُونُ فِتْنَةٌ يَكُونُ الْمُضْطَجِعُ فِيهَا خَيْرًا مِنْ الْجَالِسِ وَالْجَالِسُ خَيْرًا مِنْ الْقَائِمِ وَالْقَائِمُ خَيْرًا مِنْ الْمَاشِي وَالْمَاشِي خَيْرًا مِنْ السَّاعِي قَالَ يَا رَسُولَ اللَّهِ مَا تَأْمُرُنِي قَالَ مَنْ كَانَتْ لَهُ إِبِلٌ فَلْيَلْحَقْ بِإِبِلِهِ وَمَنْ كَانَتْ لَهُ غَنَمٌ فَلْيَلْحَقْ بِغَنَمِهِ وَمَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَلْحَقْ بِأَرْضِهِ قَالَ فَمَنْ لَمْ يَكُنْ لَهُ شَيْءٌ مِنْ ذَلِكَ قَالَ فَلْيَعْمِدْ إِلَى سَيْفِهِ فَلْيَضْرِبْ بِحَدِّهِ عَلَى حَرَّةٍ ثُمَّ لِيَنْجُ مَا اسْتَطَاعَ النَّجَاءَحَدَّثَنَا يَزِيدُ بْنُ خَالِدٍ الرَّمْلِيُّ حَدَّثَنَا مُفَضِّلٌ عَنْ عَيَّاشٍ عَنْ بُكَيْرٍ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ حُسَيْنِ بْنِ عَبْدِ الرَّحْمَنِ الْأَشْجَعِيِّ أَنَّهُ سَمِعَ سَعْدَ بْنَ أَبِي وَقَّاصٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْحَدِيثِ قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ دَخَلَ عَلَيَّ بَيْتِي وَبَسَطَ يَدَهُ لِيَقْتُلَنِي قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُنْ كَابْنَيْ آدَمَ وَتَلَا يَزِيدُ{ لَئِنْ بَسَطْتَ إِلَيَّ يَدَكَ }الْآيَةَ حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا أَبِي حَدَّثَنَا شِهَابُ بْنُ خِرَاشٍ عَنْ الْقَاسِمِ بْنِ غَزْوَانَ عَنْ إِسْحَقَ بْنِ رَاشِدٍ الْجَزَرِيِّ عَنْ سَالِمٍ حَدَّثَنِي عَمْرُو بْنُ وَابِصَةَ الْأَسَدِيُّ عَنْ أَبِيهِ وَابِصَةَ عَنْ ابْنِ مَسْعُودٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَذَكَرَ بَعْضَ حَدِيثِ أَبِي بَكْرَةَ قَالَ قَتْلَاهَا كُلُّهُمْ فِي النَّارِ قَالَ فِيهِ قُلْتُ مَتَى ذَلِكَ يَا ابْنَ مَسْعُودٍ قَالَ تِلْكَ أَيَّامُ الْهَرْجِ حَيْثُ لَا يَأْمَنُ الرَّجُلُ جَلِيسَهُ قُلْتُ فَمَا تَأْمُرُنِي إِنْ أَدْرَكَنِي ذَلِكَ الزَّمَانُ قَالَ تَكُفُّ لِسَانَكَ وَيَدَكَ وَتَكُونُ حِلْسًا مِنْ أَحْلَاسِ بَيْتِكَ فَلَمَّا قُتِلَ عُثْمَانُ طَارَ قَلْبِي مَطَارَهُ فَرَكِبْتُ حَتَّى أَتَيْتُ دِمَشْقَ فَلَقِيتُ خُرَيْمَ بْنَ فَاتِكٍ فَحَدَّثْتُهُ فَحَلَفَ بِاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ لَسَمِعَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا حَدَّثَنِيهِ ابْنُ مَسْعُودٍ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki'] dari [Utsman Asy Syahham] ia berkata; telah menceritakan kepadaku [Muslim bin Abu Bakrah] dari [Bapaknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan muncul fitnah, saat itu orang yang berbaring lebih baik dari orang yang duduk, orang yang duduk lebih baik dari orang yang berdiri, orang yang berdiri lebih baik dari orang yang berjalan, dan orang yang berjalan lebih baik dari orang yang lari (jalan cepat).\" Ia (Abu Bakrah) berkata, \"Wahai Rasulullah, apa yang engkau perintahkan kepadaku?\" beliau menjawab: \"Barangsiapa memiliki unta hendaklah ia membawanya (pergi mengasingkan diri, jauh dari manusia pada saat itu), barangsiapa memiliki kambing hendaklah ia membawanya (pergi mengasingkan diri), barangsiapa memiliki tanah (yang jauh dari manusia) hendaklah ia pergi menujunya.\" Abu Bakrah berkata, \"Wahai Rasulullah, bagaimana dengan seseorang yang tidak memiliki sesuatu?\" beliau menjawab: \"Hendaklah ia menancapkan pedangnya pada tanah berbatu dan berpegangan dengannya, setelah itu hendaklah ia berusaha mencari perlindungan untuk keselamatan dirinya.\" Telah menceritakan kepada kami [Yazid bin Khalid Ar Ramli] berkata, telah menceritakan kepada kami [Mufadhdhil] dari [Ayyasy] dari [Bukair] dari [Busr bin Sa'id] dari [Husain bin 'Abdurrahman Al Asyja'i] Bahwasanya ia mendengar [Sa'd bin Abu Waqash] dari Nabi shallallahu 'alaihi wasallam…seperti hadits ini. Sa'd berkata, \"Aku bertanya, \"Wahai Rasulullah, apa pendapatmu jika ada seseorang masuk ke dalam rumahku dan mengacungkan tangannya untuk membunuhku?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Jadilah engkau sebagaimana dua anak Adam.\" Yazid lalu membaca firman Allah: '(Sungguh, kalau kamu menggerakkan tanganmu kepadaku untuk membunuhku..) ' Al Maidah: 28. Telah menceritakan kepada kami [Amru bin Utsman] berkata, telah menceritakan kepada kami [Bapakku] berkata, telah menceritakan kepada kami [Syihab bin Khirasy] dari [Al Qasim bin Ghazwan] dari [Ishaq bin Rasyid Al Jazari] dari [Salim] berkata, telah menceritakan kepadaku [Amru bin Wabishah Al Asadi] dari bapaknya [Wabishah] dari [Ibnu Mas'ud] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda…lalu ia menyebutkan sebagian hadits Abu Bakrah. Ibnu Mas'ud berkata, \"Semua korban pembunuhan (pada masa fitnah karena pertikaian dan perebutan kekuasaan serta harta) akan masuk neraka.\" Aku bertanya, \"Wahai Ibnu Mas'ud, kapan itu terjadi?\" Ibnu Mas'ud menjawab, \"Itu terjadai pada hari-hari tersebarnya Al Harj (pembunuhan), seorang laki-laki tidak lagi bisa mempercayai teman duduknya.\" Aku berkata, \"Lalu apa yang engkau perintahkan kepadaku jika menemui masa itu?\" Ibnu Mas'ud menjawab, \"Engkau jaga lisan dan tanganmu, lalu jadilah permadani bagi rumahmu (berdiam diri dan tidak keluar).\" (Wabishah) berkata, \"Maka saat Utsman dibunuh, hatiku melayang karena kepergiannya. Lantas aku pergi dengan kendaraan hingga aku memasuki Damasykus, lalu aku bertemu dengan [Khuraim bin Fatik] dan aku ceritakan hal itu kepadanya. Maka ia bersumpah atas nama Allah Yang tidak ada Tuhan yang berhak untuk disembah selain Dia, bahwa ia juga pernah mendengar hadits itu dari Rasulullah shallallahu 'alaihi wasallam, sebagaimana Ibnu Mas'ud menceritakannya kepadaku.\""
            },
            {
                "number": 3599,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ جُحَادَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ ثَرْوَانَ عَنْ هُزَيْلٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ بَيْنَ يَدَيْ السَّاعَةِ فِتَنًا كَقِطَعِ اللَّيْلِ الْمُظْلِمِ يُصْبِحُ الرَّجُلُ فِيهَا مُؤْمِنًا وَيُمْسِي كَافِرًا وَيُمْسِي مُؤْمِنًا وَيُصْبِحُ كَافِرًا الْقَاعِدُ فِيهَا خَيْرٌ مِنْ الْقَائِمِ وَالْمَاشِي فِيهَا خَيْرٌ مِنْ السَّاعِي فَكَسِّرُوا قِسِيَّكُمْ وَقَطِّعُوا أَوْتَارَكُمْ وَاضْرِبُوا سُيُوفَكُمْ بِالْحِجَارَةِ فَإِنْ دُخِلَ يَعْنِي عَلَى أَحَدٍ مِنْكُمْ فَلْيَكُنْ كَخَيْرِ ابْنَيْ آدَمَ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abdul Warits bin Sa'id] dari [Muhammad bin Juhadah] dari ['Abdurrahman bin Tsarwan] dari [Huzail] dari [Abu Musa Al Asy'ari] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Menjelang datangnya hari kiamat akan muncul fitnah seperti malam yang gelam gulita, seorang laki-laki beriman di pagi hari lalu kafir di sore hari, sore hari beriman lalu pagi hari kafir. Pada waktu itu orang yang duduk lebih baik dari orang yang berdiri, dan orang yang berjalan lebih baik dari orang yang berlari (jalan cepat). Patahkanlah anak panah kalian dan potonglah tali busur kalian, serta tancapkanlah pedang kalian di bebatuan. Jika ada seseorang yang masuk pada salah seorang dari kalian (untuk membunuh), maka berlakulah seperti sebaik-baik dari kedua anak Adam (Qabil dan Habil).\""
            },
            {
                "number": 3600,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ رَقَبَةَ بْنِ مَصْقَلَةَ عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ عَنْ عَبْدِ الرَّحْمَنِ يَعْنِي ابْنَ سَمُرَةَ قَالَكُنْتُ آخِذًا بِيَدِ ابْنِ عُمَرَ فِي طَرِيقٍ مِنْ طُرُقِ الْمَدِينَةِ إِذْ أَتَى عَلَى رَأْسٍ مَنْصُوبٍ فَقَالَ شَقِيَ قَاتِلُ هَذَا فَلَمَّا مَضَى قَالَ وَمَا أُرَى هَذَا إِلَّا قَدْ شَقِيَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ مَشَى إِلَى رَجُلٍ مِنْ أُمَّتِي لِيَقْتُلَهُ فَلْيَقُلْ هَكَذَا فَالْقَاتِلُ فِي النَّارِ وَالْمَقْتُولُ فِي الْجَنَّةِقَالَ أَبُو دَاوُد رَوَاهُ الثَّوْرِيُّ عَنْ عَوْنٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سُمَيْرٍ أَوْ سُمَيْرَةَ وَرَوَاهُ لَيْثُ بْنُ أَبِي سُلَيْمٍ عَنْ عَوْنٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سُمَيْرَةَ قَالَ أَبُو دَاوُد قَالَ لِي الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو الْوَلِيدِ يَعْنِي بِهَذَا الْحَدِيثِ عَنْ أَبِي عَوَانَةَ و قَالَ هُوَ فِي كِتَابِي ابْنُ سَبَرَةَ وَقَالُوا سَمُرَةَ وَقَالُوا سُمَيْرَةَ هَذَا كَلَامُ أَبِي الْوَلِيدِ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Raqabah bin Mashqalah] dari [Aun bin Abu Juhaifah] dari ['Abdurrahman] -maksudnya Abdur Rahman bin Samurah- ia berkata, \"Aku meraih tangan [Ibnu Umar] saat berada di jalanan kota Madinah; yakni saat mendatangi kepala yang ditancapkan (kepala Abdullah bin Az Zubair), ia berkata, \"Calakalah orang yang telah membunuh orang ini!\" Ketika telah berlalu ia berkata lagi, \"Aku tidak melihat kecuali orang ini telah celaka. Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mendatangi seorang laki-laki dari umatku untuk membunuhnya, hendaklah ia mengatakan begini 'orang yang membunuh dineraka dan yang dibunuh disurga.\" Abu Daud berkata; [At Tsauri] telah meriwayatkannya dari [Aun] dari [Abdur Rahman bin Sumair atau Sumairah] serta [Laits bin Abu Sulaim] meriwayatkannya dari [Aun] dari [Abdur Rahman bin Sumairah], Abu Daud berkata; \" [Al Hasan bin Ali] berkata kepadaku, telah menceritakan kepadaku [Abu Walid] -maksudnya menceritakan hadits ini-; dari [Abu Awanah] dan ia (Abu Walid) berkata; \"dia (Abdur Rahman) di dalam kitab saya (bernama Abdur Rahman) bin Sabarah, dan mereka berkata; Samurah, dan mereka juga berkata; Sumairah, ini adalah perkataannya Abu Walid.\""
            },
            {
                "number": 3601,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ الْمُشَعَّثِ بْنِ طَرِيفٍ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَبَا ذَرٍّ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ وَسَعْدَيْكَ فَذَكَرَ الْحَدِيثَ قَالَ فِيهِ كَيْفَ أَنْتَ إِذَا أَصَابَ النَّاسَ مَوْتٌ يَكُونُ الْبَيْتُ فِيهِ بِالْوَصِيفِ يَعْنِي الْقَبْرَ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ أَوْ قَالَ مَا خَارَ اللَّهُ لِي وَرَسُولُهُ قَالَ عَلَيْكَ بِالصَّبْرِ أَوْ قَالَ تَصْبِرُ ثُمَّ قَالَ لِي يَا أَبَا ذَرٍّ قُلْتُ لَبَّيْكَ وَسَعْدَيْكَ قَالَ كَيْفَ أَنْتَ إِذَا رَأَيْتَ أَحْجَارَ الزَّيْتِ قَدْ غَرِقَتْ بِالدَّمِ قُلْتُ مَا خَارَ اللَّهُ لِي وَرَسُولُهُ قَالَ عَلَيْكَ بِمَنْ أَنْتَ مِنْهُ قُلْتُ يَا رَسُولَ اللَّهِ أَفَلَا آخُذُ سَيْفِي وَأَضَعُهُ عَلَى عَاتِقِي قَالَ شَارَكْتَ الْقَوْمَ إِذَنْ قُلْتُ فَمَا تَأْمُرُنِي قَالَ تَلْزَمُ بَيْتَكَ قُلْتُ فَإِنْ دُخِلَ عَلَيَّ بَيْتِي قَالَ فَإِنْ خَشِيتَ أَنْ يَبْهَرَكَ شُعَاعُ السَّيْفِ فَأَلْقِ ثَوْبَكَ عَلَى وَجْهِكَ يَبُوءُ بِإِثْمِكَ وَإِثْمِهِقَالَ أَبُو دَاوُد لَمْ يَذْكُرْ الْمُشَعَّثَ فِي هَذَا الْحَدِيثِ غَيْرَ حَمَّادِ بْنِ زَيْدٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Abu Imran Al Jauni] dari [Musya'ats bin Tharif] dari [Abdullah bin Ash Shamit] dari [Abu Dzar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Wahai Abu Dzar!\" Aku menjawab, \"Wahai Rasulullah, aku penuhi panggilanmu dan kebahagiaan semoga bersamamu, \" -lalu ia menyebutkan hadits secara lengkap-. Dalam hadits tersebut beliau bertanya: \"Apa yang akan kamu lakukan jika datang kematian kepada manusia, kemudian rumahnya pindah ke kuburan?\" Aku menjawab, \"Allah dan Rasul-Nya lebih tahu.\" Atau ia menyebutkan, \"(Aku akan melakukan) apa yang Allah dan Rasul-Nya kehendaki (pilih).\" Beliau bersabda: \"Hendaklah engkau sabar, atau beliau mengatakan: \"Bersabarlah.\" Kemudian beliau berkata lagi kepadaku: \"Wahai Abu Dzar!\" aku menjawab, \"Aku penuhi panggilanmu dan kebahagiaan semoga bersamamu, \"Apa pendapatmu jika Ahjar Az Zait (nama suatu tempat di Madinah) berlumuran darah?\" Aku menjawab, \"(Aku akan melakukan) apa yang Allah dan Rasul-Nya kehendaki untukku.\" Beliau bersabda: \"Hendaklah engkau bergabung bersama orang terdekatmu (keluarga, atau Imam yang kamu berbaiat kepadanya).\" Aku bertanya, \"Wahai Rasulullah, apa tidak lebih baik jika aku ambil pedangku, lalu aku letakkan di atas pundakku?\" beliau menjawab: \"Kalau begitu kamu telah ikut serta bersama orang-orang (dalam dosa).\" Aku lalu bertanya lagi, \"Lantas apa yang engkau perintahkan untukku?\" beliau menjawab: \"Berdiamlah engkau dirumahmu.\" Aku terus bertanya, \"Bagaimana jika ada seseorang yang masuk ke dalam rumahku!\" beliau menjawab: \"Jika engkau merasa takut dengan kilauan pedang musuh, maka letakkanlah kain baju di mukamu (pasrah), maka ia akan menanggung dosamu dan dosanya sendiri.\" Abu Dawud berkata, \"Al Musya'ats dalam hadits ini tidak menyebutkan selain Hammad bin Zaid.\""
            },
            {
                "number": 3602,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ عَنْ أَبِي كَبْشَةَ قَالَ سَمِعْتُ أَبَا مُوسَى يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ بَيْنَ أَيْدِيكُمْ فِتَنًا كَقِطَعِ اللَّيْلِ الْمُظْلِمِ يُصْبِحُ الرَّجُلُ فِيهَا مُؤْمِنًا وَيُمْسِي كَافِرًا الْقَاعِدُ فِيهَا خَيْرٌ مِنْ الْقَائِمِ وَالْقَائِمُ فِيهَا خَيْرٌ مِنْ الْمَاشِي وَالْمَاشِي فِيهَا خَيْرٌ مِنْ السَّاعِي قَالُوا فَمَا تَأْمُرُنَا قَالَ كُونُوا أَحْلَاسَ بُيُوتِكُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Farits] berkata, telah menceritakan kepada kami [Affan bin Muslim] berkata, telah menceritakan kepada kami [Abdul Wahid bin Ziyad] berkata, telah menceritakan kepada kami [Ashim Al Ahwal] dari [Abu Kabsyah] ia berkata; Aku mendengar [Abu Musa] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan datang kepada kalian fitnah sebagaimana malam yang gelap gulita, pada masa itu seorang beriman di pagi hari lalu kafir di sore hari, orang yang duduk lebih baik dari orang yang berdiri, orang yang berdiri lebih baik dari orang yang berjalan dan orang yang berjalan lebih baik dari orang yang berlari.\" Para sahabat bertanya, \"Lalu apa yang engkau perintahkan kepada kami?\" Beliau menjawab: \"Tetaplah kalian di rumah-rumah kalian.\""
            },
            {
                "number": 3603,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ الْمِصِّيصِيُّ حَدَّثَنَا حَجَّاجٌ يَعْنِي ابْنَ مُحَمَّدٍ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ قَالَ حَدَّثَنِي مُعَاوِيَةُ بْنُ صَالِحٍ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ جُبَيْرٍ حَدَّثَهُ عَنْ أَبِيهِ عَنْ الْمِقْدَادِ بْنِ الْأَسْوَدِ قَالَايْمُ اللَّهِ لَقَدْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ السَّعِيدَ لَمَنْ جُنِّبَ الْفِتَنَ إِنَّ السَّعِيدَ لَمَنْ جُنِّبَ الْفِتَنِ إِنَّ السَّعِيدَ لَمَنْ جُنِّبَ الْفِتَنُ وَلَمَنْ ابْتُلِيَ فَصَبَرَ فَوَاهًا",
                "id": "Telah menceritakan kepada kami [Ibrahim Ibnul Hasan Al Misshishi] berkata, telah menceritakan kepada kami [Hajjaj] -maksudnya Hajjaj bin Muhammad- ia berkata, telah menceritakan kepada kami [Al Laits bin Sa'd] ia berkata; telah menceritakan kepadaku [Mu'awiyah bin Shalih] bahwa ['Abdurrahman bin Jubair] menceritakan kepadanya dari [Bapaknya] dari [Al Miqdad Ibnul Aswad] ia berkata, \"Demi Allah, aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang bahagia adalah orang yang terhindar dari fitnah, orang yang bahagia adalah orang yang terhindar dari fitnah, orang yang bahagia adalah orang yang terhindar dari fitnah dan orang yang tertimpa musibah lalu bersabar seraya mengucapkan, \"Betapa baiknya cobaan ini!\""
            },
            {
                "number": 3604,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِي ابْنُ وَهْبٍ حَدَّثَنِي اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ قَالَ خَالِدُ بْنُ أَبِي عِمْرَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْبَيْلَمَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَتَكُونُ فِتْنَةٌ صَمَّاءُ بَكْمَاءُ عَمْيَاءُ مَنْ أَشْرَفَ لَهَا اسْتَشْرَفَتْ لَهُ وَإِشْرَافُ اللِّسَانِ فِيهَا كَوُقُوعِ السَّيْفِ",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin Syu'aib bin Al Laits] berkata, telah menceritakan kepadaku [Ibnu Wahb] berkata, telah menceritakan kepadaku [Al Laits] dari [Yahya bin Sa'id] ia berkata; [Khalid bin Abu Imran] berkata dari ['Abdurrahman Ibnil Bailamani] dari ['Abdurrahman bin Hurmuz] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan terjadi fitnah, orang-orang tidak lagi dapat mendengar, bisu dan tuli dari kebenaran, barang siapa yang mencoba untuk mendekati fitnah tersebut maka ia akan tertarik ke dalamnya, dan ikut serta dalam mengumbar lisan di dalamnya seperti memukulkan pedang (dalam mengakibatkan bahaya dan luka).\""
            },
            {
                "number": 3605,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا لَيْثٌ عَنْ طَاوُسٍ عَنْ رَجُلٍ يُقَالُ لَهُ زِيَادٌ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهَا سَتَكُونُ فِتْنَةٌ تَسْتَنْظِفُ الْعَرَبَ قَتْلَاهَا فِي النَّارِ اللِّسَانُ فِيهَا أَشَدُّ مِنْ وَقْعِ السَّيْفِقَالَ أَبُو دَاوُد رَوَاهُ الثَّوْرِيُّ عَنْ لَيْثٍ عَنْ طَاوُسٍ عَنْ الْأَعْجَمِ حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى بْنِ الطَّبَّاعِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الْقُدُّوسِ قَالَ زِيَادٌ سِيْمِينُ كُوشَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid] berkata, telah menceritakan kepada kami [Hammad bin Zaid] berkata, telah menceritakan kepada kami [Laits] dari [Thawus] dari seorang laki-laki yang bernama [Ziyad] dari [Abdullah bin Amru] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan terjadi fitnah, yang akan membersihkan bangsa Arab, orang-orang yang terbunuh akan masuk ke dalam neraka (karena perebutan harta dan kekuasaan), dan lisan pada hari itu lebih tajam dari sabetan pedang.\" Abu Dawud berkata, \"Hadits diriwayatkan oleh [Ats Tsauri] dari [Laits], dari [Thawus], dari [Al A'jam].\" Telah menceritakan kepada kami [Muhammad bin Isa bin Ath Thaba'].\" Telah menceritakan kepada kami [Abdullah bin Abdul Qudus] berkata, \"Ziyad adalah seorang laki-laki yang berkuping putih.\""
            },
            {
                "number": 3606,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوشِكُ أَنْ يَكُونَ خَيْرَ مَالِ الْمُسْلِمِ غَنَمٌ يَتَّبِعُ بِهَا شَغَفَ الْجِبَالِ وَمَوَاقِعَ الْقَطْرِ يَفِرُّ بِدِينِهِ مِنْ الْفِتَنِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari ['Abdurrahman bin Abdullah bin 'Abdurrahman bin Abu Sha'sha'ah] dari [Bapaknya] dari [Abu Sa'id Al Khudri] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hampir-hampir (tiba masanya) harta seorang muslim adalah seekor kambing, ia giring ke puncak gunung dan tempat turunnya embun; ia pergi menyelamatkan agamanya dari fitnah.\""
            },
            {
                "number": 3607,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ وَيُونُسَ عَنْ الْحَسَنِ عَنْ الْأَحْنَفِ بْنِ قَيْسٍ قَالَخَرَجْتُ وَأَنَا أُرِيدُ يَعْنِي فِي الْقِتَالِ فَلَقِيَنِي أَبُو بَكْرَةَ فَقَالَ ارْجِعْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا تَوَاجَهَ الْمُسْلِمَانِ بِسَيْفَيْهِمَا فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ قَالَ يَا رَسُولَ اللَّهِ هَذَا الْقَاتِلُ فَمَا بَالُ الْمَقْتُولِ قَالَ إِنَّهُ أَرَادَ قَتْلَ صَاحِبِهِحَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ الْعَسْقَلَانِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ أَيُّوبَ عَنْ الْحَسَنِ بِإِسْنَادِهِ وَمَعْنَاهُ مُخْتَصَرًا",
                "id": "Telah menceritakan kepada kami [Abu Kamil] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dan [Yunus] dari [Al Hasan] dari [Al Ahnaf bin Qais] ia berkata, \"Saat aku keluar -yakni untuk perang-, [Abu bakrah] menemuiku seraya berkata, \"Kembalilah pulang! Sesungguhnya aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika dua orang muslim saling berhadapan dengan pedang terhunus, maka baik yang membunuh atau yang terbunuh akan masuk neraka.\" Ia (perawi) berkata, \"Jika orang yang membunuh wajar masuk neraka, tapi bagaimana dengan yang terbunuh?\" beliau bersabda: \"Karena ia juga ingin membunuh saudaranya.\" Telah menceritakan kepada kami [Muhammad Ibnul Mutawakkil Al Asqalani] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah menceritakan kepada kami [Ma'mar] dari [Ayyub] dari [Al Hasan] dengan sanad dan maknanya secara ringkas. "
            },
            {
                "number": 3608,
                "arab": "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ الْحَرَّانِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ عَنْ خَالِدِ بْنِ دِهْقَانَ قَالَكُنَّا فِي غَزْوَةِ الْقُسْطَنْطِينِيَّةِ بِذُلُقْيَةَ فَأَقْبَلَ رَجُلُ مِنْ أَهْلِ فِلَسْطِينَ مِنْ أَشْرَافِهِمْ وَخِيَارِهِمْ يَعْرِفُونَ ذَلِكَ لَهُ يُقَالُ لَهُ هَانِئُ بْنُ كُلْثُومِ بْنِ شَرِيكٍ الْكِنَانِيُّ فَسَلَّمَ عَلَى عَبْدِ اللَّهِ بْنِ أَبِي زَكَرِيَّا وَكَانَ يَعْرِفُ لَهُ حَقَّهُ قَالَ لَنَا خَالِدٌ فَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي زَكَرِيَّا قَالَ سَمِعْتُ أُمَّ الدَّرْدَاءِ تَقُولُ سَمِعْتُ أَبَا الدَّرْدَاءِ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كُلُّ ذَنْبٍ عَسَى اللَّهُ أَنْ يَغْفِرَهُ إِلَّا مَنْ مَاتَ مُشْرِكًا أَوْ مُؤْمِنٌ قَتَلَ مُؤْمِنًا مُتَعَمِّدًافَقَالَ هَانِئُ بْنُ كُلْثُومٍ سَمِعْتُ مَحْمُودَ بْنَ الرَّبِيعِ يُحَدِّثُ عَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّهُ سَمِعَهُ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ قَتَلَ مُؤْمِنًا فَاعْتَبَطَ بِقَتْلِهِ لَمْ يَقْبَلْ اللَّهُ مِنْهُ صَرْفًا وَلَا عَدْلًا قَالَ لَنَا خَالِدٌ ثُمَّ حَدَّثَنِي ابْنُ أَبِي زَكَرِيَّا عَنْ أُمِّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَزَالُ الْمُؤْمِنُ مُعْنِقًا صَالِحًا مَا لَمْ يُصِبْ دَمًا حَرَامًا فَإِذَا أَصَابَ دَمًا حَرَامًا بَلَّحَ وَحَدَّثَ هَانِئُ بْنُ كُلْثُومٍ عَنْ مَحْمُودِ بْنِ الرَّبِيعِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ سَوَاءً حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو عَنْ مُحَمَّدِ بْنِ مُبِارَكٍ حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ أَوْ غَيْرُهُ قَالَ قَالَ خَالِدُ بْنُ دِهْقَانَ سَأَلْتُ يَحْيَى بْنَ يَحْيَى الْغَسَّانِيَّ عَنْ قَوْلِهِ اعْتَبَطَ بِقَتْلِهِ قَالَ الَّذِينَ يُقَاتِلُونَ فِي الْفِتْنَةِ فَيَقْتُلُ أَحَدُهُمْ فَيَرَى أَنَّهُ عَلَى هُدًى لَا يَسْتَغْفِرُ اللَّهَ يَعْنِي مِنْ ذَلِكَ قَالَ أَبُو دَاوُد فَاعْتَبَطَ يَصُبُّ دَمَهُ صَبًّا",
                "id": "Telah menceritakan kepada kami [Muammal Ibnul Fadhl Al Harrani] berkata, telah menceritakan kepada kami [Muhammad bin Syu'aib] dari [Khalid bin Dihqan] ia berkata, \"Saat kami sedang berada dalam peperangan Qastantiniyah di daerah Dzuluqyah, seorang laki-laki terpandang dan paling baik dari penduduk Palestina, orang-orang biasa memanggilnya dengan nama Hani bin Kultsum bin Syarik Al Kinani, datang seraya mengucapkan salam kepada [Abullah bin Abu Zakariya]. Orang yang tahu akan kedudukannya -Hani-. lalu Khalid berkata kepada kami, \"Abdullah bin Abu Zakariya telah menceritakan kepadaku, ia berkata; Aku mendengar [Ummu Darda] berkata, \"Aku mendengar [Abu Darda] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap dosa berharap bisa diampuni oleh Allah kecuali seseorang yang meninggal dalam keadaan musyrik, atau seorang mukmin yang membunuh mukmin lainnya dengan sengaja.\" [Hani bin Kultsum] berkata, \"Aku mendengar [Mahmud bin Ar Rabi'] menceritakan dari [Ubadah bin Ash Shamit], Bahwasanya ia pernah mendengarnya menceritakan dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa membunuh seorang mukmin dengan zhalim, maka Allah tidak akan menerima taubat atau ibadah sunahnya.\" [Khalid] lantas berkata lagi kepada kami; [Ibnu Abu Zakariya] menceritakan kepadaku dari [Ummu Darda], dari [Abu Darda], dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang mukmin akan senantiasa dalam keshalihan selama ia tidak terlumuri darah yang haram (membunuh), jika berlumuran maka ia telah terjerumus dalam kehancuran.\" Hani bin Kultsum juga menceritakan dari Mahmud bin Ar Rabi', dari Ubadah bin Ash Shamit, dari Rasulullah shallallahu 'alaihi wasallam, persis sebagaimana hadits tersebut. Telah menceritakan kepada kami 'Abdurrahman bin Amru dari Muhammad bin Mubarak berkata, telah menceritakan kepada kami Shadaqah bin Khalid atau selainnya, ia berkata; Khalid bin Dihqan berkata; Aku bertanya kepada Yahya bin Yahya Al Ghassani tentang sabda beliau, 'membunuhnya dengan zhalim'? ia menjawab, \"(Yaitu) orang-orang yang saling bunuh dalam fitnah hingga salah seorang dari mereka terbunuh, namun ia melihat bahwa dirinya di atas petunjuk dan tidak meminta ampun kepada Allah -yaitu dari dosa membunuh tersebut-.\" Abu Dawud berkata, \"Maka kata I'tabatha adalah menumpahkan darah.\""
            },
            {
                "number": 3609,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَقَ عَنْ أَبِي الزِّنَادِ عَنْ مُجَالِدِ بْنِ عَوْفٍ أَنَّ خَارِجَةَ بْنَ زَيْدٍ قَالَ سَمِعْتُ زَيْدَ بْنَ ثَابِتٍفِي هَذَا الْمَكَانِ يَقُولُ أُنْزِلَتْ هَذِهِ الْآيَةُ{ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ خَالِدًا فِيهَا }بَعْدَ الَّتِي فِي الْفُرْقَانِ{ وَالَّذِينَ لَا يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلَا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ }بِسِتَّةِ أَشْهُرٍ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Hammad] berkata, telah mengabarkan kepada kami ['Abdurrahman bin Ishaq] dari [Abu Az Zinad] dari [Mujalid bin Auf] bahwa [Kharijah bin Zaid] berkata; Aku mendengar [Zaid bin Tsabit] berkata di tempat ini, \"Firman Allah ini: (Dan barangsiapa yang membunuh seorang mu'min dengan sengaja maka balasannya ialah Jahannam, ia kekal di dalamnya..) -An Nisa: 93-, diturunkan setelah ayat Allah yang ada dalam surat Al Furqan: (Dan orang-orang yang tidak menyembah tuhan yang lain beserta Allah dan tidak membunuh jiwa yang diharamkan Allah (membunuhnya) kecuali dengan (alasan) yang benar..) -Al Furqan: 68- jaraknya adalah enam bulam.\""
            },
            {
                "number": 3610,
                "arab": "حَدَّثَنَا يُوسُفُ بْنُ مُوسَى حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ أَوْ حَدَّثَنِي الْحَكَمُ عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ فَقَالَلَمَّا نَزَلَتْ الَّتِي فِي الْفُرْقَانِ{ وَالَّذِينَ لَا يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلَا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ }قَالَ مُشْرِكُو أَهْلِ مَكَّةَ قَدْ قَتَلْنَا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ وَدَعَوْنَا مَعَ اللَّهِ إِلَهًا آخَرَ وَأَتَيْنَا الْفَوَاحِشَ فَأَنْزَلَ اللَّهُ{ إِلَّا مَنْ تَابَ وَآمَنَ وَعَمِلَ عَمَلًا صَالِحًا فَأُولَئِكَ يُبَدِّلُ اللَّهُ سَيِّئَاتِهِمْ حَسَنَاتٍ }فَهَذِهِ لِأُولَئِكَ قَالَ وَأَمَّا الَّتِي فِي النِّسَاءِ{ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ }الْآيَةَ قَالَ الرَّجُلُ إِذَا عَرَفَ شَرَائِعَ الْإِسْلَامِ ثُمَّ قَتَلَ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ لَا تَوْبَةَ لَهُفَذَكَرْتُ هَذَا لِمُجَاهِدٍ فَقَالَ إِلَّا مَنْ نَدِمَ حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ حَدَّثَنِي يَعْلَى عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ فِي هَذِهِ الْقِصَّةِ فِي{ وَالَّذِينَ لَا يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ }أَهْلِ الشِّرْكِ قَالَ وَنَزَلَ{ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ }",
                "id": "Telah menceritakan kepada kami [Yusuf bin Musa] berkata, telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Sa'id bin Jubair] atau ia mengatakan; telah menceritakan kepadaku [Al hakam] dari [Sa'id bin Jubair] ia berkata; Aku bertanya [Ibnu Abbas] berkata, \"Ketika ayat dalam surat Al furqan ini turun: (Dan orang-orang yang tidak menyembah tuhan yang lain beserta Allah dan tidak membunuh jiwa yang diharamkan Allah (membunuhnya) kecuali dengan (alasan) yang benar..) -Al Furqan: 68-, orang-orang musyrik Makkah berkata, \"Kami telah membunuh jiwa yang telah diharamkan oleh Allah dan berbuat syirik kepada-Nya serta melakukan perbuatan keji!\" Allah pun menurunkan ayat: (Kecuali orang-orang yang bertaubat dan, beriman dan beramal shalih; maka kejahatan mereka akan diganti Allah dengan kebajikan..) -Qs. Al Furqan: 70-, maka ayat ini untuk orang-orang musyrik Quraisy tersebut. Ibnu Abbas melanjutkan, \"Sedangkan ayat yang ada dalam surat An Nisa: (Dan barangsiapa yang membunuh seorang mu'min dengan sengaja maka balasannya ialah Jahannam…) -An Nisa: 93- ia mengatakan, \"Seorang laki-laki yang mengetahui hukum-hukum Islam, kemudian ia membunuh seorang mukmin dengan sengaja, maka balasannya adalah neraka jahannam dan tidak ada lagi taubat untuknya.\" Perkataan ini lalu aku sebutkan kepada Mujahid, ia berkomentar, \"Kecuali jika ia (pembunuh) merasa menyesal.\" Telah menceritakan kepada kami [Ahmad bin Ibrahim] berkata, telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] berkata, telah menceritakan kepadaku [Ya'la] dari [Sa'id bin Jubair] dari [Ibnu Abbas] -sebagaimana kisah dalam hadits tersebut- tentang firman Allah: (dan orang-orang yang tidak menyembah tuhan yang lain berserta Allah..) -Qs. Al Furqan: 53- yakni orang-orang musyrik. Ibnu Abbas berkata, \"Lalu turun ayat: (Katakanlah, 'Hai hamba-hamba-Ku yang melampaui batas terhadap diri mereka sendiri, janganlah kamu berputus asa dari rahmat Allah') -Qs. Az Zumar: 53-. "
            },
            {
                "number": 3611,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ الْمُغِيرَةِ بْنِ النُّعْمَانِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَ{ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا }قَالَ مَا نَسَخَهَا شَيْءٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami ['Abdurrahman] berkata, telah menceritakan kepada kami [Sufyan] dari [Al Mughirah bin Nu'man] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata, \"Firman Allah: (Dan barangsiapa membunuh seorang mukmin dengan sengaja…) -Qs. An Nisa: 94-, tidak pernah dihapus oleh ayat manapun.\""
            },
            {
                "number": 3612,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا أَبُو شِهَابٍ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي مِجْلَزٍفِي قَوْلِهِ{ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ }قَالَ هِيَ جَزَاؤُهُ فَإِنْ شَاءَ اللَّهُ أَنْ يَتَجَاوَزَ عَنْهُ فَعَلَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] berkata, telah menceritakan kepada kami [Abu Syihab] dari [Sulaiman At Taimi] dari [Abu Mijlaz] tentang firman Allah: (Dan barangsiapa membunuh seorang mukmin dengan sengaja, maka balasannya ialah Jahannam..) -Qs. An Nisa: 93- ia berkata, \"Itu adalah ganjaran baginya, jika Allah akan mengampuninya, maka Allah akan melakukannya.\""
            },
            {
                "number": 3613,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو الْأَحْوَصِ سَلَّامُ بْنُ سُلَيْمٍ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ سَعِيدِ بْنِ زَيْدٍ قَالَكُنَّا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ فِتْنَةً فَعَظَّمَ أَمْرَهَا فَقُلْنَا أَوْ قَالُوا يَا رَسُولَ اللَّهِ لَئِنْ أَدْرَكَتْنَا هَذِهِ لَتُهْلِكَنَّا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَلَّا إِنَّ بِحَسْبِكُمْ الْقَتْلَقَالَ سَعِيدٌ فَرَأَيْتُ إِخْوَانِي قُتِلُوا",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abu Al Ahwash Salam bin Sulaim] dari [Manshur] dari [Hilal bin Yasaf] dari [Sa'id bin Zaid] ia berkata, \"Saat kami berada di sisi Nabi shallallahu 'alaihi wasallam, beliau menyebutkan tentang fitnah dan memperbesar masalahnya, kami lalu berkata, atau mereka mengatakan, \"Wahai Rasulullah, jika hal itu menimpa kami, maka hancurlah kami!\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Tidak, itu bergantung kalian dalam menjaga dari pembunuhan.\" Sa'id berkata, \"Aku melihat saudara-saudaraku terbunuh.\""
            },
            {
                "number": 3614,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنْ أَبِي مُوسَى قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمَّتِي هَذِهِ أُمَّةٌ مَرْحُومَةٌ لَيْسَ عَلَيْهَا عَذَابٌ فِي الْآخِرَةِ عَذَابُهَا فِي الدُّنْيَا الْفِتَنُ وَالزَّلَازِلُ وَالْقَتْلُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Katsir bin Hisyam] berkata, telah menceritakan kepada kami [Al Mas'udi] dari [Sa'id bin Abu Burdah] dari [Bapaknya] dari [Abu Musa] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Umatku adalah umat yang terhormat, di akhirat tidak akan mendapatkan siksa, siksa mereka adalah di dunia; yakni dengan adanya fitnah, gempa bumi dan peperangan.\""
            },
            {
                "number": 3615,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ عَنْ إِسْمَعِيلَ يَعْنِي ابْنَ أَبِي خَالِدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَزَالُ هَذَا الدِّينُ قَائِمًا حَتَّى يَكُونَ عَلَيْكُمْ اثْنَا عَشَرَ خَلِيفَةً كُلُّهُمْ تَجْتَمِعُ عَلَيْهِ الْأُمَّةُ فَسَمِعْتُ كَلَامًا مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ أَفْهَمْهُ قُلْتُ لِأَبِي مَا يَقُولُ قَالَ كُلُّهُمْ مِنْ قُرَيْشٍ",
                "id": "Telah menceritakan kepada kami [Amru bin Utsman] berkata, telah menceritakan kepada kami [Marwan bin Mu'awiyah] dari [Isma'il] -maksudnya Ismail bin Abu Khalid- dari [Bapaknya] dari [Jabir bin Samurah] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Agama ini akan senantiasa tegak hingga muncul di antara kalian dua belas khalifah, dan manusia akan ikut bersama mereka.\" Aku mendengar ucapan dari Nabi shallallahu 'alaihi wasallam yang tidak aku mengerti, lalu aku kepada bertanya bapakku tentang apa yang beliau katakan itu, ia (bapakku) menjawab, \"Mereka semua (para khalifah) dari bangsa Quraisy.\""
            },
            {
                "number": 3616,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا دَاوُدُ عَنْ عَامِرٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَزَالُ هَذَا الدِّينُ عَزِيزًا إِلَى اثْنَيْ عَشَرَ خَلِيفَةً قَالَ فَكَبَّرَ النَّاسُ وَضَجُّوا ثُمَّ قَالَ كَلِمَةً خَفِيفَةً قُلْتُ لِأَبِي يَا أَبَتِ مَا قَالَ قَالَ كُلُّهُمْ مِنْ قُرَيْشٍحَدَّثَنَا ابْنُ نُفَيْلٍ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا زِيَادُ بْنُ خَيْثَمَةَ حَدَّثَنَا الْأَسْوَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ عَنْ جَابِرِ بْنِ سَمُرَةَ بِهَذَا الْحَدِيثِ زَادَ فَلَمَّا رَجَعَ إِلَى مَنْزِلِهِ أَتَتْهُ قُرَيْشٌ فَقَالُوا ثُمَّ يَكُونُ مَاذَا قَالَ ثُمَّ يَكُونُ الْهَرْجُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Wuhaib] berkata, telah menceritakan kepada kami [Dawud] dari [Amir] dari [Jabir bin Samurah] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Agama ini akan tetap mulia hingga khalifah ke dua belas.\" Jabir berkata, \"Orang-orang bertakbir dan berteriak. Kemudian beliau mengatakan suatu ucapan yang pelan (hingga aku tidak mendengarnyanya, lalu aku bertanya kepada bapakku, \"Wahai bapakku, apa yang beliau katakan?\" Ia menjawab, \"Beliau mengatakan bahwa mereka dari bangsa Quraisy.\" Telah menceritakan kepada kami [Ibnu Nufail] berkata, telah menceritakan kepada kami [Zuhair] berkata, telah menceritakan kepada kami [Ziyad bin Khaitsamah] berkata, telah menceritakan kepada kami [Al Aswad bin Sa'id Al Hamdani] dari [Jabir bin Samurah] dengan hadits yang sama. Namun ia menambahkan, \"Ketika beliau kembali ke rumahnya, orang-orang Quraisy mendatanginya seraya bertanya, \"Setelah itu akan terjadi peristiwa apa?\" beliau menjawab: \"Akan terjadi pembunuhan.\""
            },
            {
                "number": 3617,
                "arab": "حَدَّثَنَا مُسَدَّدٌ أَنَّ عُمَرَ بْنَ عُبَيْدٍ حَدَّثَهُمْ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو بَكْرٍ يَعْنِي ابْنَ عَيَّاشٍ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ ح و حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَخْبَرَنَا زَائِدَةُ ح و حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ فِطْرٍ الْمَعْنَى وَاحِدٌ كُلُّهُمْ عَنْ عَاصِمٍ عَنْ زِرٍّ عَنْ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ لَمْ يَبْقَ مِنْ الدُّنْيَا إِلَّا يَوْمٌ قَالَ زَائِدَةُ فِي حَدِيثِهِ لَطَوَّلَ اللَّهُ ذَلِكَ الْيَوْمَ ثُمَّ اتَّفَقُوا حَتَّى يَبْعَثَ فِيهِ رَجُلًا مِنِّي أَوْ مِنْ أَهْلِ بَيْتِي يُوَاطِئُ اسْمُهُ اسْمِي وَاسْمُ أَبِيهِ اسْمُ أَبِي زَادَ فِي حَدِيثِ فِطْرٍ يَمْلَأُ الْأَرْضَ قِسْطًا وَعَدْلًا كَمَا مُلِئَتْ ظُلْمًا وَجَوْرًا وَقَالَ فِي حَدِيثِ سُفْيَانَ لَا تَذْهَبُ أَوْ لَا تَنْقَضِي الدُّنْيَا حَتَّى يَمْلِكَ الْعَرَبَ رَجُلٌ مِنْ أَهْلِ بَيْتِي يُوَاطِئُ اسْمُهُ اسْمِيقَالَ أَبُو دَاوُد لَفْظُ عُمَرَ وَأَبِي بَكْرٍ بِمَعْنَى سُفْيَانَ",
                "id": "Telah menceritakan kepada kami [Musaddad] bahwa [Umar bin Ubaid] menceritakan kepada mereka. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Al 'Ala] berkata, telah menceritakan kepada kami [Abu Bakr] -maksudnya Abu Bakar bin 'Ayyasy-. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Sufyan]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Ibrahim] berkata, telah menceritakan kepada kami [ubaidhullah bin Musa] berkata, telah mengabarkan kepada kami [Zaidah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Ibrahim] berkata, telah menceritakan kepadaku [ubaidhullah bin Musa] dari [Fithr] dengan makna hadits yang sama. Dan semuanya dari [Ashim] dari [Zir] dari [Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sekiranya dunia ini tidak tersisa kecuali hanya sehari, Zaidah menyebutkan dalam haditsnya, \"maka Allah akan memanjangkan hari itu, \" kemudian mereka bersepakat -dalam menyebutkan lafadz- hingga Allah mengutus seorang laki-laki dariku, atau dari keluargaku; namanya mirip dengan namaku, dan nama bapaknya juga mirip dengan nama bapakku. Dalam hadits Fithr ditambahkan, \"Ia akan memenuhi bumi dengan keadilan, sebagaimana kezhaliman dan kelaliman pernah memenuhinya.\" Dalam hadits riwayat Sufyan beliau mengatakan: \"(Dunia) tidak akan pergi, atau tidak akan hancur hingga seorang laki-laki dari ahli baitku menguasai Arab; namanya seperti namanku.\" Abu Daud berkata; \"lafadz hadits Umar dan Abu Bakar semakna dengan lafadz Abu Sufyan.\""
            },
            {
                "number": 3618,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ حَدَّثَنَا فِطْرٌ عَنْ الْقَاسِمِ بْنِ أَبِي بَزَّةَ عَنْ أَبِي الطُّفَيْلِ عَنْ عَلِيٍ رَضِيَ اللَّهُ عَنْهُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ لَمْ يَبْقَ مِنْ الدَّهْرِ إِلَّا يَوْمٌ لَبَعَثَ اللَّهُ رَجُلًا مِنْ أَهْلِ بَيْتِي يَمْلَؤُهَا عَدْلًا كَمَا مُلِئَتْ جَوْرًا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Al Fadhl bin Dukain] berkata, telah menceritakan kepada kami [Fithr] dari [Al Qasim bin Abu Bazzah] dari [Abu Ath Thufail] dari [Ali radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sekiranya dunia ini tidak lagi tersisa kecuali hanya sehari, sungguh Allah akan mengutus seorang laki-laki dari ahli baitku, ia akan memenuhi bumi dengan keadilan sebagaimana bumi pernah dipenuhi kajahatan.\""
            },
            {
                "number": 3619,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ حَدَّثَنَا أَبُو الْمَلِيحِ الْحَسَنُ بْنُ عُمَرَ عَنْ زِيَادِ بْنِ بَيَانٍ عَنْ عَلِيِّ بْنِ نُفَيْلٍ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ أُمِّ سَلَمَةَ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْمَهْدِيُّ مِنْ عِتْرَتِي مِنْ وَلَدِ فَاطِمَةَقَالَ عَبْدُ اللَّهِ بْنُ جَعْفَرٍ وَسَمِعْتُ أَبَا الْمَلِيحِ يُثْنِي عَلَى عَلِيِّ بْنِ نُفَيْلٍ وَيَذْكُرُ مِنْهُ صَلَاحًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Ibrahim] berkata, telah menceritakan kepada kami [Abdullah bin Ja'far Ar Raqqi] berkata, telah menceritakan kepada kami [Abu Al Malih Al Hasan bin Umar] dari [Ziyad bin Bayan] dari [Ali bin Nufail] dari [Sa'id Ibnul Musayyab] dari [Ummu Salamah] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Al Mahdi dari keturunanku, dari jalur Fatimah.\" Abdullah bin Ja'far berkata, \"Aku mendengar Abul Malih memuji Ali bin Nufail, dan ia menyebutkan akan kebaikannya.\""
            },
            {
                "number": 3620,
                "arab": "حَدَّثَنَا سَهْلُ بْنُ تَمَّامِ بْنِ بَزِيعٍ حَدَّثَنَا عِمْرَانُ الْقَطَّانُ عَنْ قَتَادَةَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَهْدِيُّ مِنِّي أَجْلَى الْجَبْهَةِ أَقْنَى الْأَنْفِ يَمْلَأُ الْأَرْضَ قِسْطًا وَعَدْلًا كَمَا مُلِئَتْ جَوْرًا وَظُلْمًا يَمْلِكُ سَبْعَ سِنِينَ",
                "id": "Telah menceritakan kepada kami [Sahl bin Tammam bin Bazi'] berkata, telah menceritakan kepada kami [Imran Al Qaththan] dari [Qatadah] dari [Abu Nadhrah] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Al Mahdi itu dari keturunanku, dahinya lebar dan hidungnya mancung, ia akan memenuhi bumi dengan keadilan sebagaimana bumi pernah dipenuhi dengan kejahatan dan kezhaliman. Ia akan berkuasa selama tujuh tahun.\""
            },
            {
                "number": 3621,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ صَالِحٍ أَبِي الْخَلِيلِ عَنْ صَاحِبٍ لَهُ عَنْ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَكُونُ اخْتِلَافٌ عِنْدَ مَوْتِ خَلِيفَةٍ فَيَخْرُجُ رَجُلٌ مِنْ أَهْلِ الْمَدِينَةِ هَارِبًا إِلَى مَكَّةَ فَيَأْتِيهِ نَاسٌ مِنْ أَهْلِ مَكَّةَ فَيُخْرِجُونَهُ وَهُوَ كَارِهٌ فَيُبَايِعُونَهُ بَيْنَ الرُّكْنِ وَالْمَقَامِ وَيُبْعَثُ إِلَيْهِ بَعْثٌ مِنْ أَهْلِ الشَّامِ فَيُخْسَفُ بِهِمْ بِالْبَيْدَاءِ بَيْنَ مَكَّةَ وَالْمَدِينَةِ فَإِذَا رَأَى النَّاسُ ذَلِكَ أَتَاهُ أَبْدَالُ الشَّامِ وَعَصَائِبُ أَهْلِ الْعِرَاقِ فَيُبَايِعُونَهُ بَيْنَ الرُّكْنِ وَالْمَقَامِ ثُمَّ يَنْشَأُ رَجُلٌ مِنْ قُرَيْشٍ أَخْوَالُهُ كَلْبٌ فَيَبْعَثُ إِلَيْهِمْ بَعْثًا فَيَظْهَرُونَ عَلَيْهِمْ وَذَلِكَ بَعْثُ كَلْبٍ وَالْخَيْبَةُ لِمَنْ لَمْ يَشْهَدْ غَنِيمَةَ كَلْبٍ فَيَقْسِمُ الْمَالَ وَيَعْمَلُ فِي النَّاسِ بِسُنَّةِ نَبِيِّهِمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيُلْقِي الْإِسْلَامُ بِجِرَانِهِ فِي الْأَرْضِ فَيَلْبَثُ سَبْعَ سِنِينَ ثُمَّ يُتَوَفَّى وَيُصَلِّي عَلَيْهِ الْمُسْلِمُونَقَالَ أَبُو دَاوُد قَالَ بَعْضُهُمْ عَنْ هِشَامٍ تِسْعَ سِنِينَ و قَالَ بَعْضُهُمْ سَبْعَ سِنِينَ حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا عَبْدُ الصَّمَدِ عَنْ هَمَّامٍ عَنْ قَتَادَةَ بِهَذَا الْحَدِيثِ وَقَالَ تِسْعَ سِنِينَ قَالَ أَبُو دَاوُد و قَالَ غَيْرُ مُعَاذٍ عَنْ هِشَامٍ تِسْعَ سِنِينَ حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ حَدَّثَنَا أَبُو الْعَوَّامِ حَدَّثَنَا قَتَادَةُ عَنْ أَبِي الْخَلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أُمِّ سَلَمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ وَحَدِيثُ مُعَاذٍ أَتَمُّ",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] berkata, telah menceritakan kepada kami [Mu'adz bin Hisyam] berkata, telah menceritakan kepadaku [Bapakku] dari [Qatadah] dari [Shalih Abu Al Khalil] dari [Sahabatnya] dari [Ummu Salamah] isteri Nabi shallallahu 'alaihi wasallam, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Akan terjadi perselisihan saat matinya khalifah, lalu seorang laki-laki (Al Mahdi) akan keluar dari Madinah pergi menuju Makkah. Lantas beberapa orang dari penduduk Makkah mendatanginya, mereka memaksanya keluar (dari dalam rumah) meskipun ia tidak menginginkannya. Orang-orang itu kemudian membaiatnya pada suatu tempat antara Rukun (Hajar Asawad) dan Maqam (Ibrahim). Lalu dikirimlah sepasukan dari penduduk Syam untuk memeranginya, tetapi pasukan itu justru ditenggelamkan oleh (Allah) di Al Baida, tempat antara Makkah dan Madinah. Maka ketika manusia melihat hal itu, orang-orang shalih dari Syam dan orang-orang terbaik dari penduduk Irak membaiatnya antara rukun dan Maqam. Lalu tumbuhlah seorang laki-laki dari bangsa Quraisy, paman-pamannya dari suku Kalb, ia lalu mengirimkan sepasukan untuk memerangi mereka (orang-orang yang berbaiat kepada Al mahdi) namun mereka dapat mengalahkan mereka (pasukan yang dikirim oleh lelaki Quraisy dari suku Kalb). Alangkah ruginya orang yang tidak ikut serta dalam pembagian ghanimah perang melawan suku Kalb. ia (Al Mahdi) lalu membagi ghanimah, dan membina manusia dengan sunnah Nabi mereka shallallahu 'alaihi wasallam dan menyampaikan Islam ke semua penduduk bumi. Ia berkuasa selama tujuh tahun, kemudian wafat dan disholati oleh kaum muslimin.\" Abu Dawud berkata, \"Sebagian mereka menyebutkan dari Hisyam, \" selama sembilan tahun.\" Dan sebagian yang lain menyebutkan, \"Selama tujuh tahun.\" Telah menceritakan kepada kami [Harun bin Abdullah] berkata, telah menceritakan kepada kami [Abdu Ash Shamad] dari [Hammam] dari [Qatadah] dengan hadits yang sama. Beliau mengatakan, \"sembilan tahun.\" Abu Dawud berkata, \"Selain Mu'adz menyebutkan dari Hisyam, \"selama sembilan tahun.\" Telah menceritakan kepada kami [Ibnul Mutsanna] berkata, telah menceritakan kepada kami [Amru bin Ashim] berkata, telah menceritakan kepada kami [Abu Al Awwam] berkata, telah menceritakan kepada kami [Qatadah] dari [Abu Al Khalil] dari [Abdullah bin Al Harits] dari [Ummu Salamah] dari Nabi shallallahu 'alaihi wasallam seperti hadits ini, namun hadits Mu'adz lebih lengkap.\""
            },
            {
                "number": 3622,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ عُبَيْدِ اللَّهِ ابْنِ الْقِبْطِيَّةِ عَنْ أُمِّ سَلَمَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقِصَّةِ جَيْشِ الْخَسْفِ قُلْتُ يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَيْفَ بِمَنْ كَانَ كَارِهًا قَالَ يُخْسَفُ بِهِمْ وَلَكِنْ يُبْعَثُ يَوْمَ الْقِيَامَةِ عَلَى نِيَّتِهِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Jarir] dari [Abdul Aziz bin rufai'] dari [ubaidhullah bin Al Qibthiyyah] dari [Ummu Salamah] dari Nabi shallallahu 'alaihi wasallam berkenaan dengan kisah pasukan yang ditenggelamkan. Aku bertanya, \"Wahai Rasulullah shallallahu 'alaihi wasallam, bagaimana dengan orang yang terpaksa (bersama tentara yang ditenggelamkan)?\" beliau menjawab: \"Ia juga akan ditenggelamkan, hanyasaja pada hari kiamat ia akan dibangkitkan sesuai dengan niatnya.\""
            },
            {
                "number": 3623,
                "arab": "قَالَ أَبُو دَاوُد حُدِّثْتُ عَنْ هَارُونَ بْنِ الْمُغِيرَةِ قَالَ حَدَّثَنَا عَمْرُو بْنُ أَبِي قَيْسٍ عَنْ شُعَيْبِ بْنِ خَالِدٍ عَنْ أَبِي إِسْحَقَ قَالَقَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ وَنَظَرَ إِلَى ابْنِهِ الْحَسَنِ فَقَالَ إِنَّ ابْنِي هَذَا سَيِّدٌ كَمَا سَمَّاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَيَخْرُجُ مِنْ صُلْبِهِ رَجُلٌ يُسَمَّى بِاسْمِ نَبِيِّكُمْ يُشْبِهُهُ فِي الْخُلُقِ وَلَا يُشْبِهُهُ فِي الْخَلْقِ ثُمَّ ذَكَرَ قِصَّةً يَمْلَأُ الْأَرْضَ عَدْلًاو قَالَ هَارُونُ حَدَّثَنَا عَمْرُو بْنُ أَبِي قَيْسٍ عَنْ مُطَرِّفِ بْنِ طَرِيفٍ عَنْ أَبِي الْحَسَنِ عَنْ هِلَالِ بْنِ عَمْرٍو قَالَ سَمِعْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ يَقُولُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ رَجُلٌ مِنْ وَرَاءِ النَّهْرِ يُقَالُ لَهُ الْحَارِثُ بْنُ حَرَّاثٍ عَلَى مُقَدِّمَتِهِ رَجُلٌ يُقَالُ لَهُ مَنْصُورٌ يُوَطِّئُ أَوْ يُمَكِّنُ لِآلِ مُحَمَّدٍ كَمَا مَكَّنَتْ قُرَيْشٌ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَبَ عَلَى كُلِّ مُؤْمِنٍ نَصْرُهُ أَوْ قَالَ إِجَابَتُهُ",
                "id": "Abu Dawud berkata; Aku diceritakan dari [Harun Ibnul Mughirah] ia berkata; telah menceritakan kepada kami [Amru bin Abu Qais] dari [Syu'aib bin Khalid] dari [Abu Ishaq] ia berkata; Sambil melihat puteranya Al hasan, Ali radliallahu 'anhu berkata berkata, \"Puteraku ini adalah seorang pemimpin sebagaimana yang disebutkan oleh Nabi shallallahu 'alaihi wasallam, dan akan keluar dari keturunannya seorang laki-laki yang bernama seperti nama Nabi kalian, akhlaqnya sama tetapi tidak untuk postur tubuhnya.\" Kemudian beliau menyebutkan kisahnya, \"Ia akan memenuhi bumi dengan keadilan.\" Harun berkata, \"Telah menceritakan kepada kami [Amru bin Abu Qais] dari [Mutharrif bin Tharif] dari [Abu Al Hasan] dari [Hilal bin Amru] ia berkata; Aku mendengar [Ali radliallahu 'anhu] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Akan keluar seorang laki-laki dari seberang sungai (seperti Bukhara dan Samarqan), dia bernama Al Harits bin Hurrats, lalu setelahnya akan keluar seorang laki-laki bernama Manshur. Ia memperkokoh keluarga Muhammad sebagaimana bangsa Quraisy memperkokoh Rasulullah shallallahu 'alaihi wasallam. Maka wajib atas setiap mukmin menolongnya, atau beliau mengatakan: \"memenuhi seruannya.\""
            },
            {
                "number": 3624,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ عَنْ شَرَاحِيلَ بْنِ يَزِيدَ الْمُعَافِرِيِّ عَنْ أَبِي عَلْقَمَةَ عَنْ أَبِي هُرَيْرَةَ فِيمَا أَعْلَمُعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ يَبْعَثُ لِهَذِهِ الْأُمَّةِ عَلَى رَأْسِ كُلِّ مِائَةِ سَنَةٍ مَنْ يُجَدِّدُ لَهَا دِينَهَاقَالَ أَبُو دَاوُد رَوَاهُ عَبْدُ الرَّحْمَنِ بْنُ شُرَيْحٍ الْإِسْكَنْدَرَانِيُّ لَمْ يَجُزْ بِهِ شَرَاحِيلَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Dawud Al Mahri] berkata, telah mengabarkan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Sa'id bin Abu Ayyub] dari [Syarahil bin Yazid Al Mu'arifi] dari [Abu Alqamah] dari [Abu Hurairah] yang aku tahu hadits itu dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Setiap seratus tahun Allah mengutus kepada umat ini seseorang yang akan memperbaharui agama ini (dari penyimpangan).\" Abu Dawud berkata, \"'Abdurrahman bin Syuraih Al Iskandarani meriwayatkan hadits ini, namun tidak menyebutkan Syarahil.\""
            },
            {
                "number": 3625,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ حَسَّانَ بْنِ عَطِيَّةَ قَالَ مَالَ مَكْحُولٌ وَابْنُ أَبِي زَكَرِيَّا إِلَى خَالِدِ بْنِ مَعْدَانَ وَمِلْتُ مَعَهُمْ فَحَدَّثَنَا عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ الْهُدْنَةِ قَالَقَالَ جُبَيْرٌ انْطَلِقْ بِنَا إِلَى ذِي مِخْبَرٍ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَيْنَاهُ فَسَأَلَهُ جُبَيْرٌ عَنْ الْهُدْنَةِ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ سَتُصَالِحُونَ الرُّومَ صُلْحًا آمِنًا فَتَغْزُونَ أَنْتُمْ وَهُمْ عَدُوًّا مِنْ وَرَائِكُمْ فَتُنْصَرُونَ وَتَغْنَمُونَ وَتَسْلَمُونَ ثُمَّ تَرْجِعُونَ حَتَّى تَنْزِلُوا بِمَرْجٍ ذِي تُلُولٍ فَيَرْفَعُ رَجُلٌ مِنْ أَهْلِ النَّصْرَانِيَّةِ الصَّلِيبَ فَيَقُولُ غَلَبَ الصَّلِيبُ فَيَغْضَبُ رَجُلٌ مِنْ الْمُسْلِمِينَ فَيَدُقُّهُ فَعِنْدَ ذَلِكَ تَغْدِرُ الرُّومُ وَتَجْمَعُ لِلْمَلْحَمَةِحَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ الْحَرَّانِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا أَبُو عَمْرٍو عَنْ حَسَّانَ بْنِ عَطِيَّةَ بِهَذَا الْحَدِيثِ وَزَادَ فِيهِ وَيَثُورُ الْمُسْلِمُونَ إِلَى أَسْلِحَتِهِمْ فَيَقْتَتِلُونَ فَيُكْرِمُ اللَّهُ تِلْكَ الْعِصَابَةَ بِالشَّهَادَةِ إِلَّا أَنَّ الْوَلِيدَ جَعَلَ الْحَدِيثَ عَنْ جُبَيْرٍ عَنْ ذِي مِخْبَرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو دَاوُد وَرَوَاهُ رَوْحٌ وَيَحْيَى بْنُ حَمْزَةَ وَبِشْرُ بْنُ بَكْرٍ عَنْ الْأَوْزَاعِيِّ كَمَا قَالَ عِيسَى",
                "id": "Telah menceritakan kepada kami [An Nufaili] berkata, telah menceritakan kepada kami [Isa bin Yunus] berkata, telah menceritakan kepada kami [Al Auza'i] dari [Hassan bin Athiyah] ia berkata; Makhul dan Ibnu Abu Zakariya menemui [Khalid bin Ma'dan], sementara aku juga ikut mereka. Lalu Khalid menceritakan kepada kami dari [Jubair bin Nufair] tentang Hudnah (perjanjian damai). Hassan berkata, \"Selanjutnya [Jubair] berkata, \"Mari bersama kami menemui [Dzu Mikhbar], seorang laki-laki dari sahabat Nabi shallallahu 'alaihi wasallam. Akhirnya kami pun mendatangi laki-laki tersebut, Jubair lantas bertanya kepadanya tentang perjanjian damai. Sahabat Nabi itu menjawab, \"Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalian akan mengadakan perjanjian dengan bangsa Ramawi, namun kalian akan memerangi mereka dan mereka menjadi musuh di belakang kalian. Kalian akan mendapatkan kemenangan dan ghanimah, dan keselamatan. Setelah itu kalian akan kembali pulang, saat kalian singgah di suatu tempat tinggi yang subur dan banyak tanamannya, ada seorang laki-laki nashrani mengangkat salib seraya berkata, \"Salib telah menang!\" hal itu menjadikan seorang laki-laki dari kaum muslimin marah hingga mematahkan kayu salibnya. Maka saat itulah orang-orang Ramawi berkhianat dan berkumpul untuk mengadakan peperangan.\" Telah menceritakan kepada kami [Muammal Ibnul Fadhl Al harrani] berkata, telah menceritakan kepada kami [Al Walid bin Muslim] berkata, telah menceritakan kepada kami [Abu Amru] dari [Hassan bin Athiyyah] dengan hadits yang sama. Namun ia menambahkan, \"Kaum muslimin lalu segera meraih senjata mereka dan berperang. Allah kemudian memuliakan mereka dengan syahid.\" Hanya saja Al Walid menyebutkan hadits ini melalui jalur Jubair, dari [Dzu Mikhbar], dari Nabi shallallahu 'alaihi wasallam. Abu Dawud berkata, \"Hadits ini diriwayatkan oleh [Rauh], [Yahya bin Hamzah] dan [Bisyr bin Bakr], dari [Al Auza'I] sebagaimana yang dikatakan oleh Isa.\""
            },
            {
                "number": 3626,
                "arab": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ ثَابِتِ بْنِ ثَوْبَانَ عَنْ أَبِيهِ عَنْ مَكْحُولٍ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ مَالِكِ بْنِ يَخَامِرَ عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عُمْرَانُ بَيْتِ الْمَقْدِسِ خَرَابُ يَثْرِبَ وَخَرَابُ يَثْرِبَ خُرُوجُ الْمَلْحَمَةِ وَخُرُوجُ الْمَلْحَمَةِ فَتْحُ قُسْطَنْطِينِيَّةَ وَفَتْحُ الْقُسْطَنْطِينِيَّةِ خُرُوجُ الدَّجَّالِ ثُمَّ ضَرَبَ بِيَدِهِ عَلَى فَخِذِ الَّذِي حَدَّثَهُ أَوْ مَنْكِبِهِ ثُمَّ قَالَ إِنَّ هَذَا لَحَقٌّ كَمَا أَنَّكَ هَاهُنَا أَوْ كَمَا أَنَّكَ قَاعِدٌ يَعْنِي مُعَاذَ بْنَ جَبَلٍ",
                "id": "Telah menceritakan kepada kami [Abbas Al 'Anbari] berkata, telah menceritakan kepada kami [Hasyim Ibnul Qasim] berkata, telah menceritakan kepada kami ['Abdurrahman bin Tsabit bin Tsauban] dari [Bapaknya] dari [Makhul] dari [Jubair bin Nufair] dari [Malik bin Yukhamir] dari [Mu'adz bin Jabal] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ramainya Baitul Maqdis adalah tanda kehancuran kota Madinah, hancurnya kota Madinah adalah tanda terjadinya peperangan besar, terjadinya peperangan besar adalah tanda dari pembukaan kota Konstantinopel, dan pembukaan kota Konstantinopel adalah tanda keluarnya Dajjal.\" Kemudian beliau menepuk-nepuk paha orang yang beliau ceritakan tentang hadits tersebut, atau dalam riwayat lain, 'pundaknya'. Kemudian bersabda: \"Semua ini adalah sesuatu yang benar, sebagaimana engkau -Mu'adz bin Jabal- sekarang berada di sini adalah sesuatu yang benar.\""
            },
            {
                "number": 3627,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ عَنْ الْوَلِيدِ بْنِ سُفْيَانَ الْغَسَّانِيِّ عَنْ يَزِيدَ بْنِ قُتَيْبٍ السَّكُونِيِّ عَنْ أَبِي بَحْرِيَّةَ عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَلْحَمَةُ الْكُبْرَى وَفَتْحُ الْقُسْطَنْطِينِيَّةِ وَخُرُوجُ الدَّجَّالِ فِي سَبْعَةِ أَشْهُرٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufail] berkata, telah menceritakan kepada kami [Isa bin Yunus] dari [Abu Bakr bin Abu Maryam] dari [Al Walid bin Sufyan Al Ghassani] dari [Yazid bin Qutaib As Sakuni] dari [Abu Bahriyah] dari [Mu'adz bin Jabal] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Peperangan besar, pembukaan Konstantinopel dan keluarnya Dajjal terjadi selama tujuh bulan.\""
            },
            {
                "number": 3628,
                "arab": "حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ عَنْ بَحِيرٍ عَنْ خَالِدٍ عَنْ ابْنِ أَبِي بِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَ الْمَلْحَمَةِ وَفَتْحِ الْمَدِينَةِ سِتُّ سِنِينَ وَيَخْرُجُ الْمَسِيحُ الدَّجَّالُ فِي السَّابِعَةِقَالَ أَبُو دَاوُد هَذَا أَصَحُّ مِنْ حَدِيثِ عِيسَى",
                "id": "Telah menceritakan kepada kami [Haiwah bin Syuraih Al Himshi] berkata, telah menceritakan kepada kami [Baqiyyah] dari [bahir] dari [Khalid] dari [Ibnu Abu Bilal] dari [Abdullah bin Busr] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Antara peperangan dan pembukaan kota Konstantinopel jaraknya enam tahun, lalu Al Masih Ad Dajjal keluar pada awal tahun ke tujuh.\" Abu Dawud berkata, \"Ini lebih shahih ketimbang hadits Isa.\""
            },
            {
                "number": 3629,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ حَدَّثَنَا بِشْرُ بْنُ بَكْرٍ حَدَّثَنَا ابْنُ جَابِرٍ حَدَّثَنِي أَبُو عَبْدِ السَّلَامِ عَنْ ثَوْبَانَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوشِكُ الْأُمَمُ أَنْ تَدَاعَى عَلَيْكُمْ كَمَا تَدَاعَى الْأَكَلَةُ إِلَى قَصْعَتِهَا فَقَالَ قَائِلٌ وَمِنْ قِلَّةٍ نَحْنُ يَوْمَئِذٍ قَالَ بَلْ أَنْتُمْ يَوْمَئِذٍ كَثِيرٌ وَلَكِنَّكُمْ غُثَاءٌ كَغُثَاءِ السَّيْلِ وَلَيَنْزَعَنَّ اللَّهُ مِنْ صُدُورِ عَدُوِّكُمْ الْمَهَابَةَ مِنْكُمْ وَلَيَقْذِفَنَّ اللَّهُ فِي قُلُوبِكُمْ الْوَهْنَ فَقَالَ قَائِلٌ يَا رَسُولَ اللَّهِ وَمَا الْوَهْنُ قَالَ حُبُّ الدُّنْيَا وَكَرَاهِيَةُ الْمَوْتِ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Ibrahim bin Ad Dimasyqi] berkata, telah menceritakan kepada kami [Bisyr bin Bakr] berkata, telah menceritakan kepada kami [Ibnu Jabir] berkata, telah menceritakan kepadaku [Abu Abdus Salam] dari [Tsauban] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hampir-hampir bangsa-bangsa memperebutkan kalian (umat Islam), layaknya memperebutkan makanan yang berada di mangkuk.\" Seorang laki-laki berkata, \"Apakah kami waktu itu berjumlah sedikit?\" beliau menjawab: \"Bahkan jumlah kalian pada waktu itu sangat banyak, namun kalian seperti buih di genangan air. Sungguh Allah akan mencabut rasa takut kepada kalian, dan akan menanamkan ke dalam hati kalian Al wahn.\" Seseorang lalu berkata, \"Wahai Rasulullah, apa itu Al wahn?\" beliau menjawab: \"Cinta dunia dan takut mati.\""
            },
            {
                "number": 3630,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ حَدَّثَنَا ابْنُ جَابِرٍ حَدَّثَنِي زَيْدُ بْنُ أَرْطَاةَ قَالَ سَمِعْتُ جُبَيْرَ بْنَ نُفَيْرٍ يُحَدِّثُ عَنْ أَبِي الدَّرْدَاءِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فُسْطَاطَ الْمُسْلِمِينَ يَوْمَ الْمَلْحَمَةِ بِالْغُوطَةِ إِلَى جَانِبِ مَدِينَةٍ يُقَالُ لَهَا دِمَشْقُ مِنْ خَيْرِ مَدَائِنِ الشَّامِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Yahya bin Hamzah] berkata, telah menceritakan kepada kami [Ibnu Jabir] berkata, telah menceritakan kepadaku [Zaid bin Arthah] ia berkata; Aku mendengar [Jubair bin Nufair] menceritakan dari [Abu Darda] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saat terjadinya peperangan yang besar, pangkalan kaum muslimin berada di daerah Ghuthah, sebuah wilayah di pinggiran kota yang dikenal dengan nama Damaskus, salah satu kota terbaik di negeri Syam.\""
            },
            {
                "number": 3631,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ حَدَّثَنَا إِسْمَعِيلُ ح و حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا الْحَسَنُ بْنُ سَوَّارٍ حَدَّثَنَا إِسْمَعِيلُ حَدَّثَنَا سُلَيْمَانُ بْنُ سُلَيْمٍ عَنْ يَحْيَى بْنِ جَابِرٍ الطَّائِيِّ قَالَ هَارُونُ فِي حَدِيثِهِ عَنْ عَوْفِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَنْ يَجْمَعَ اللَّهُ عَلَى هَذِهِ الْأُمَّةِ سَيْفَيْنِ سَيْفًا مِنْهَا وَسَيْفًا مِنْ عَدُوِّهَا",
                "id": "Telah menceritakan kepada kami [Abdul Wahhab bin Najdah] berkata, telah menceritakan kepada kami [Isma'il]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Harun bin Abdullah] berkata, telah menceritakan kepada kami [Al Hasan bin Sawwar] berkata, telah menceritakan kepada kami [Isma'il] berkata, telah menceritakan kepada kami [Sulaiman bin Sulaim] dari [Yahya bin Jabir Ath Tha`i] berkata; Harun dalam haditsnya menyebutkan dari [Auf bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekali-kali Allah tidak akan mengumpulkan dua pedang pada umat ini; satu pedang dari mereka dan satu pedang lagi dari musuh mereka.\""
            },
            {
                "number": 3632,
                "arab": "حَدَّثَنَا عِيسَى بْنُ مُحَمَّدٍ الرَّمْلِيُّ حَدَّثَنَا ضَمْرَةُ عَنْ السَّيْبَانِيِّ عَنْ أَبِي سُكَيْنَةَ رَجُلٌ مِنْ الْمُحَرَّرِينَ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ دَعُوا الْحَبَشَةَ مَا وَدَعُوكُمْ وَاتْرُكُوا التُّرْكَ مَا تَرَكُوكُمْ",
                "id": "Telah menceritakan kepada kami [Isa bin Muhammad Ar Ramli] berkata, telah menceritakan kepada kami [Dhamrah] dari [As Saibani] dari [Abu Sukainah] seorang lelaki dari Al Muhararaini, dari [seorang laki-laki] di antara sahabat Nabi shallallahu 'alaihi wasallam, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Biarkanlah orang-orang Habasyah sebagaimana mereka membiarkan kalian, dan tinggalkanlah orang-orang Turki sebagaimana mereka meninggalkan kalian.\""
            },
            {
                "number": 3633,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا يَعْقُوبُ يَعْنِي الْإِسْكَنْدَرَانِيَّ عَنْ سُهَيْلٍ يَعْنِي ابْنَ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى يُقَاتِلَ الْمُسْلِمُونَ التُّرْكَ قَوْمًا وُجُوهُهُمْ كَالْمَجَانِّ الْمُطْرَقَةِ يَلْبَسُونَ الشَّعْرَ",
                "id": "Telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Ya'qub] -maksudnya Ya'qub Al Iskandarani- dari [Suhail] -maksudnya Suhail bin Abu Shalih- dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kiamat tidak akan terjadi hingga kaum muslimin memerangi bangsa Turki, wajah mereka seperti perisai dan mengenakan sandal dari rambut.\""
            },
            {
                "number": 3634,
                "arab": "حَدَّثَنَا قُتَيْبَةُ وَابْنُ السَّرْحِ وَغَيْرُهُمَا قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ أَبِي هُرَيْرَةَرِوَايَةً قَالَ ابْنُ السَّرْحِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا نِعَالُهُمْ الشَّعَرُ وَلَا تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا صِغَارَ الْأَعْيُنِ ذُلْفَ الْآنُفِ كَأَنَّ وُجُوهَهُمْ الْمَجَانُّ الْمُطْرَقَةُ",
                "id": "Telah menceritakan kepada kami [Qutaibah] dan [Ibnu As Sarh] dan selain keduanya, mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Sa'id Ibnul Musayyab] dari [Abu Hurairah] secara riwayat. Ibnu Suraih berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak akan terjadi hari kiamat hingga kalian memerangi kaum yang mengenakan sandal dari rambut, dan tidak akan terjadai hari kiamat hingga kalian memerangi suatu kaum yang matanya sipit, hidung pesek dan wajah mereka seperti tameng untuk perang.\""
            },
            {
                "number": 3635,
                "arab": "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ التِّنِّيسِيُّ حَدَّثَنَا خَلَّادُ بْنُ يَحْيَى حَدَّثَنَا بَشِيرُ بْنُ الْمُهَاجِرِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَدِيثِ يُقَاتِلُكُمْ قَوْمٌ صِغَارُ الْأَعْيُنِ يَعْنِي التُّرْكَ قَالَ تَسُوقُونَهُمْ ثَلَاثَ مِرَارٍ حَتَّى تُلْحِقُوهُمْ بِجَزِيرَةِ الْعَرَبِ فَأَمَّا فِي السِّيَاقَةِ الْأُولَى فَيَنْجُو مَنْ هَرَبَ مِنْهُمْ وَأَمَّا فِي الثَّانِيَةِ فَيَنْجُو بَعْضٌ وَيَهْلَكُ بَعْضٌ وَأَمَّا فِي الثَّالِثَةِ فَيُصْطَلَمُونَ أَوْ كَمَا قَالَ",
                "id": "Telah menceritakan kepada kami [Ja'far bin Musafir At Tinnisi] berkata, telah menceritakan kepada kami [Khallad bin Yahya] berkata, telah menceritakan kepada kami [Basyir Ibnul Muhajir] berkata, telah menceritakan kepada kami [Abdullah bin Buraidah] dari [Bapaknya] dari Nabi shallallahu 'alaihi wasallam berkenaan dengan hadits Nabi, 'Akan memerangi kalian suatu kaum yang mata mereka sipit -yakni bangsa Turki-', beliau bersabda: \"Kalian akan menguasai mereka sebanyak tiga kali, sehingga kalian dapat menyusul mereka hingga jazirah arab. Pada kemenangan pertama orang-orang yang lari dari mereka selamat, pada kemenangan kedua sebagian dari mereka selamat dan sebagian yang lain binasa, dan pada kemenangan ketiga mereka menyerah total. ' Atau sebagaimana yang beliau sabdakan.\""
            },
            {
                "number": 3636,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنِي أَبِي حَدَّثَنَا سَعِيدُ بْنُ جُمْهَانَ حَدَّثَنَا مُسْلِمُ بْنُ أَبِي بَكْرَةَ قَالَ سَمِعْتُ أَبِي يُحَدِّثُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَنْزِلُ نَاسٌ مِنْ أُمَّتِي بِغَائِطٍ يُسَمُّونَهُ الْبَصْرَةَ عِنْدَ نَهْرٍ يُقَالُ لَهُ دِجْلَةُ يَكُونُ عَلَيْهِ جِسْرٌ يَكْثُرُ أَهْلُهَا وَتَكُونُ مِنْ أَمْصَارِ الْمُهَاجِرِينَ قَالَ ابْنُ يَحْيَى قَالَ أَبُو مَعْمَرٍ وَتَكُونُ مِنْ أَمْصَارِ الْمُسْلِمِينَ فَإِذَا كَانَ فِي آخِرِ الزَّمَانِ جَاءَ بَنُو قَنْطُورَاءَ عِرَاضُ الْوُجُوهِ صِغَارُ الْأَعْيُنِ حَتَّى يَنْزِلُوا عَلَى شَطِّ النَّهْرِ فَيَتَفَرَّقُ أَهْلُهَا ثَلَاثَ فِرَقٍ فِرْقَةٌ يَأْخُذُونَ أَذْنَابَ الْبَقَرِ وَالْبَرِّيَّةِ وَهَلَكُوا وَفِرْقَةٌ يَأْخُذُونَ لِأَنْفُسِهِمْ وَكَفَرُوا وَفِرْقَةٌ يَجْعَلُونَ ذَرَارِيَّهُمْ خَلْفَ ظُهُورِهِمْ وَيُقَاتِلُونَهُمْ وَهُمْ الشُّهَدَاءُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] berkata, telah menceritakan kepada kami [Abdu Ash Shamad bin Abdul Warits] berkata, telah menceritakan kepadaku [Bapakku] berkata, telah menceritakan kepada kami [Sa'id bin Jumhan] berkata, telah menceritakan kepada kami [Muslim bin Abu Bakrah] ia berkata; Aku mendengar [Bapakku] menceritakan bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Beberapa orang dari umatku singgah di suatu tempat yang luas, mereka menamakannya Bashrah. Yakni di sisi sungai yang bernama Dijlah, sungai itu mempunyai jembatan. Tempat itu penduduknya sangat banyak, dan mayoritas berasal dari orang-orang yang hijrah. Ibnu Ishaq berkata, \"Abu Ma'mar menyebutkan, 'Penduduk tempat itu berasal dari penjuru kaum muslimin'. Di akhir zaman nanti akan datang suatu kaum yang bernama Qanthura, wajah mereka lebar dan matanya sipit, hingga kaum itu sampai ke daerah tepian sungai lalu para penduduknya pecah menjadi tiga kelompok; satu kelompok pergi mengikuti ekor sapi dan binatang ternak (pergi ke tempat yang jauh dengan membawa binatang ternak mereka untuk bercocok tanam) hingga mereka hancur. Satu kelompok mengambil untuk keamanan mereka (mengajukan atau menerima jaminan keamanan dari bani Qanthura) hingga akhirnya menjadi kafir. Dan satu kelompok melindungi anak dan istri mereka dan berperang melawan musuh (Bani Qanthura) hingga mereka mati sebagai syuhada.\""
            },
            {
                "number": 3637,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ حَدَّثَنَا مُوسَى الْحَنَّاطُ لَا أَعْلَمُهُ إِلَّا ذَكَرَهُ عَنْ مُوسَى بْنِ أَنَسٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ يَا أَنَسُ إِنَّ النَّاسَ يُمَصِّرُونَ أَمْصَارًا وَإِنَّ مِصْرًا مِنْهَا يُقَالُ لَهُ الْبَصْرَةُ أَوْ الْبُصَيْرَةُ فَإِنْ أَنْتَ مَرَرْتَ بِهَا أَوْ دَخَلْتَهَا فَإِيَّاكَ وَسِبَاخَهَا وَكِلَاءَهَا وَسُوقَهَا وَبَابَ أُمَرَائِهَا وَعَلَيْكَ بِضَوَاحِيهَا فَإِنَّهُ يَكُونُ بِهَا خَسْفٌ وَقَذْفٌ وَرَجْفٌ وَقَوْمٌ يَبِيتُونَ يُصْبِحُونَ قِرَدَةً وَخَنَازِيرَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Ash Shabbah] berkata, telah menceritakan kepada kami [Abdul Aziz bin Abdu Ash Shamad] berkata, telah menceritakan kepada kami [Musa Al Hannath] -aku tidak mengetahuinya kecuali ia menyebutkannya- dari [Musa bin Anas] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam pernah bersabda kepadanya: \"Wahai Anas, sesungguhnya manusia akan menempati banyak tempat, dan salah satu tempat itu bernama Bashrah, atau Bushairah. Jika kamu melewati tempat itu, atau masuk ke dalamnya, maka hindarilah tempat-tempat yang tanahnya asin (lapang karena sidikit pohon), dan tempat penambatan kapal (dermaga), serta pasar-pasar dan para penguasanya. Pergilah ke tempat-tempat pelosok (daerah pegunungan), karena wilayah wilayah tersebut banyak terjadi penenggelaman (ke dasar bumi), angin topan dan gempa bumi. Di sana kalian juga akan menemui suatu kaum, mereka bermalam dan pagi harinya telah menjadi kera dan babi.\""
            },
            {
                "number": 3638,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي إِبْرَاهِيمُ بْنُ صَالِحِ بْنِ دِرْهَمٍ قَالَ سَمِعْتُ أَبِي يَقُولُانْطَلَقْنَا حَاجِّينَ فَإِذَا رَجُلٌ فَقَالَ لَنَا إِلَى جَنْبِكُمْ قَرْيَةٌ يُقَالُ لَهَا الْأُبُلَّةُ قُلْنَا نَعَمْ قَالَ مَنْ يَضْمَنُ لِي مِنْكُمْ أَنْ يُصَلِّيَ لِي فِي مَسْجِدِ الْعَشَّارِ رَكْعَتَيْنِ أَوْ أَرْبَعًا وَيَقُولَ هَذِهِ لِأَبِي هُرَيْرَةَ سَمِعْتُ خَلِيلِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ يَبْعَثُ مِنْ مَسْجِدِ الْعَشَّارِ يَوْمَ الْقِيَامَةِ شُهَدَاءَ لَا يَقُومُ مَعَ شُهَدَاءِ بَدْرٍ غَيْرُهُمْقَالَ أَبُو دَاوُد هَذَا الْمَسْجِدُ مِمَّا يَلِي النَّهْرَ",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] berkata, telah menceritakan kepadaku [Ibrahim bin Shalih bin Dirham] ia berkata; Aku mendengar [Bapakku] berkata, \"Kami berangkat untuk menunaikan haji, lalu ada seorang laki-laki (Abu Hurairah) berkata, \"Di sisi kalian ada sebuah kampung bernama Ubullah, \" kami menjawab, \"Benar.\" Laki-laki itu berkata lagi, \"Siapakah di antara kalian bersedia memberi jaminan padaku, bahwa ia mau sholat untukku di masjid Al Asysyar sebanyak dua atau empat rakaat, setelah itu mengatakan '(pahala sholat ini untuk [Abu Hurairah]? Aku pernah mendengar kekasihku Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada hari kiamat Allah akan membangkitkan para syuhada dari masjid Al Asysyar, tidak ada yang bangkit (berdiri) bersama para syuhada perang badar selain mereka.\" Abu Dawud berkata, \"Masjid ini ada di sisi sungai.\""
            },
            {
                "number": 3639,
                "arab": "حَدَّثَنَا الْقَاسِمُ بْنُ أَحْمَدَ الْبَغْدَادِيُّ حَدَّثَنَا أَبُو عَامِرٍ عَنْ زُهَيْرِ بْنِ مُحَمَّدٍ عَنْ مُوسَى بْنِ جُبَيْرٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حَنِيفٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اتْرُكُوا الْحَبَشَةَ مَا تَرَكُوكُمْ فَإِنَّهُ لَا يَسْتَخْرِجُ كَنْزَ الْكَعْبَةِ إِلَّا ذُو السُّوَيْقَتَيْنِ مِنْ الْحَبَشَةِ",
                "id": "Telah menceritakan kepada kami [Al Qasim bin Ahmad Al Baghdadi] berkata, telah menceritakan kepada kami [Abu Amir] dari [Zuhair bin Muhammad] dari [Musa bin Jubair] dari [Abu Umamah bin Sahl bin Hanif] dari [Abdullah bin Amru] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Biarkanlah orang-orang Habasyah sebagaimana mereka membiarkan kalian, sebab tidaklah harta simpanan ka'bah itu dikeluarkan kecuali oleh Dzu As Suwaiqataini (seorang yang berjuluk pemilik dua betis) dari negeri Habasyah.\""
            },
            {
                "number": 3640,
                "arab": "حَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ حَدَّثَنَا إِسْمَعِيلُ عَنْ أَبِي حَيَّانَ التَّيْمِيِّ عَنْ أَبِي زُرْعَةَ قَالَجَاءَ نَفَرٌ إِلَى مَرْوَانَ بِالْمَدِينَةِ فَسَمِعُوهُ يُحَدِّثُ فِي الْآيَاتِ أَنَّ أَوَّلَهَا الدَّجَّالُ قَالَ فَانْصَرَفْتُ إِلَى عَبْدِ اللَّهِ بْنِ عَمْرٍو فَحَدَّثْتُهُ فَقَالَ عَبْدُ اللَّهِ لَمْ يَقُلْ شَيْئًا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ أَوَّلَ الْآيَاتِ خُرُوجًا طُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا أَوْ الدَّابَّةُ عَلَى النَّاسِ ضُحًى فَأَيَّتُهُمَا كَانَتْ قَبْلَ صَاحِبَتِهَا فَالْأُخْرَى عَلَى أَثَرِهَا قَالَ عَبْدُ اللَّهِ وَكَانَ يَقْرَأُ الْكُتُبَ وَأَظُنُّ أَوَّلَهُمَا خُرُوجًا طُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا",
                "id": "Telah menceritakan kepada kami [Muammal bin Hisyam] berkata, telah menceritakan kepada kami [Isma'il] dari [Abu Hayyan At taimi] dari [Abu Zur'ah] ia berkata, \"Beberapa orang datang menemui Marwan di Madinah, mereka mendengar Marwan menceritakan tentang tanda-tanda datangnya hari kiamat. Bahwa pertama kali yang akan muncul adalah Dajjal.\" Abu Zur'ah berkata, \"Aku lantas menemui Abdullah bin Amru dan aku ceritakan hal itu kepadanya. [Abdullah] lalu berkata, \"Perkataan Marwan tidak dianggap, aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tanda hari kiamat pertama yang akan muncul adalah terbitnya matahari dari arah barat, atau keluarnya binatang melata kepada manusia di waktu dhuha. Mana pun dari keduanya muncul pertama kali, maka yang lain akan segera menyusul.\" Abdullah berkata -sambil membaca buku-, \"Aku kira yang pertama kali akan muncul adalah terbitnya matahari dari arah terbenamnya.\""
            },
            {
                "number": 3641,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَهَنَّادٌ الْمَعْنَى قَالَ مُسَدَّدٌ حَدَّثَنَا أَبُو الْأَحْوَصِ حَدَّثَنَا فُرَاتٌ الْقَزَّازُ عَنْ عَامِرِ بْنِ وَاثِلَةَ وَقَالَ هَنَّادٌ عَنْ أَبِي الطُّفَيْلِ عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ الْغِفَارِيِّ قَالَكُنَّا قُعُودًا نَتَحَدَّثُ فِي ظِلِّ غُرْفَةٍ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْنَا السَّاعَةَ فَارْتَفَعَتْ أَصْوَاتُنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَنْ تَكُونَ أَوْ لَنْ تَقُومَ السَّاعَةُ حَتَّى يَكُونَ قَبْلَهَا عَشْرُ آيَاتٍ طُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا وَخُرُوجُ الدَّابَّةِ وَخُرُوجُ يَأْجُوجَ وَمَأْجُوجَ وَالدَّجَّالُ وَعِيسَى ابْنُ مَرْيَمَ وَالدُّخَانُ وَثَلَاثَةُ خُسُوفٍ خَسْفٌ بِالْمَغْرِبِ وَخَسْفٌ بِالْمَشْرِقِ وَخَسْفٌ بِجَزِيرَةِ الْعَرَبِ وَآخِرُ ذَلِكَ تَخْرُجُ نَارٌ مِنْ الْيَمَنِ مِنْ قَعْرِ عَدَنٍ تَسُوقُ النَّاسَ إِلَى الْمَحْشَرِ",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Hannad] secara makna, [Musaddad] berkata; telah menceritakan kepada kami [Abu Al Ahwash] berkata, telah menceritakan kepada kami [Furat Al Qazzaz] dari [Amir bin Watsilah]. Dan [Hannad] berkata dari [Abu Thufail] dari [Hudzaifah bin Asid Al Ghifari] ia berkata, \"Kami duduk bersama di sisi kamar Rasulullah shallallahu 'alaihi wasallam sambil membicarakan seputar hari kiamat, suara kami sangat keras hingga Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak akan terjadi, atau tidak akan datang hari kiamat hingga muncul sepuluh tanda; terbitnya matahari dari barat, munculnya binatang melata, keluarnya Ya'juj dan Ma'juj, Dajjal, Isa putera Maryam, asap dan tiga gempa bumi (longsor), longsor di barat, timur dan di Jazirah Arab. Dan tanda terakhir adalah keluarnya api dari Yaman, dari dasar tanah Adn yang akan menggiring manusia menuju mahsyar.\""
            },
            {
                "number": 3642,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ الْفُضَيْلِ عَنْ عُمَارَةَ عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقُومُ السَّاعَةُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا فَإِذَا طَلَعَتْ وَرَآهَا النَّاسُ آمَنَ مَنْ عَلَيْهَا فَذَاكَ حِينَ{ لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا }الْآيَةَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abu Syu'aib Al Harrani] berkata, telah menceritakan kepada kami [Muhammad Fudhail] dari [Umarah] dari [Abu Zur'ah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak akan tegak hari kiamat hingga matahari terbit dari arah terbenamnya, jika manusia melihat hal itu maka mereka akan beriman semuanya. Dan waktu itu adalah saat 'Tidak bermanfaat lagi iman seseorang bagi dirinya sendiri yang belum beriman sebelum itu, atau dia (belum) mengusahakan kebaikan dalam masa imannya) '-Al An'am 158-.\""
            },
            {
                "number": 3643,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْكِنْدِيُّ حَدَّثَنِي عُقْبَةُ بْنُ خَالِدٍ السَّكُونِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ حَفْصِ بْنِ عَاصِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوشِكُ الْفُرَاتُ أَنْ يَحْسِرَ عَنْ كَنْزٍ مِنْ ذَهَبٍ فَمَنْ حَضَرَهُ فَلَا يَأْخُذْ مِنْهُ شَيْئًاحَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْكِنْدِيُّ حَدَّثَنِي عُقْبَةُ يَعْنِي ابْنَ خَالِدٍ حَدَّثَنِي عُبَيْدُ اللَّهِ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ إِلَّا أَنَّهُ قَالَ يَحْسِرُ عَنْ جَبَلٍ مِنْ ذَهَبٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id Al Kindi] berkata, telah menceritakan kepadaku [Uqbah bin Khalid As Sakuni] berkata, telah menceritakan kepada kami [ubaidhullah] dari [Khubaib bin 'Abdurrahman] dari [Hafsh bin Ashim] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"begitu dekat (hari kiamat) yaitu ketika sungai Furat menyibak harta kekayaan berupa emas yang terkandung di dalamnya, barangsiapa yang datang kepadanya maka janganlah ia mengambil sesuatu pun darinya.\" Telah menceritakan kepada kami [Abdullah bin Sa'id Al Kindi] berkata, telah menceritakan kepadaku [Uqbah] -maksudnya Uqbah bin Khalid- berkata, telah menceritakan kepadaku [ubaidhullah] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits tersebut, hanya saja beliau mengatakan: \"menyibak gunung emas.\""
            },
            {
                "number": 3644,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَمْرٍو حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ قَالَاجْتَمَعَ حُذَيْفَةُ وَأَبُو مَسْعُودٍ فَقَالَ حُذَيْفَةُ لَأَنَا بِمَا مَعَ الدَّجَّالِ أَعْلَمُ مِنْهُ إِنَّ مَعَهُ بَحْرًا مِنْ مَاءٍ وَنَهْرًا مِنْ نَارٍ فَالَّذِي تَرَوْنَ أَنَّهُ نَارٌ مَاءٌ وَالَّذِي تَرَوْنَ أَنَّهُ مَاءٌ نَارٌ فَمَنْ أَدْرَكَ ذَلِكَ مِنْكُمْ فَأَرَادَ الْمَاءَ فَلْيَشْرَبْ مِنْ الَّذِي يَرَى أَنَّهُ نَارٌ فَإِنَّهُ سَيَجِدُهُ مَاءًقَالَ أَبُو مَسْعُودٍ الْبَدْرِيُّ هَكَذَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Amru] berkata, telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Rib'I bin Hirasy] ia berkata; [Hudzaifah] dan [Abu Mas'ud] berkumpul, lalu Hudzaifah berkata, \"Aku adalah orang yang paling tahu tentang (kapan munculnya) dajjal. Sesungguhnya dajjal mempunyai lautan dari air dan sungai dari api. Apa yang kalian lihat sebagai api sebenarnya adalah air, dan apa yang kalian lihat sebagai air sebenarnya adalah api. Maka, siapa dari kalian yang mendapati hal itu dan ingin minum, hendaklah ia minum (air) yang berupa api dalam pandangannya, sebab ia akan mendapatkan air yang sesungguhnya.\" Abu Mas'ud Al Badri berkata, \"Demikianlah aku mendengar Rasulullah shallallahu 'alaihi wasallam mengatakannya.\""
            },
            {
                "number": 3645,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يُحَدِّثُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَا بُعِثَ نَبِيٌّ إِلَّا قَدْ أَنْذَرَ أُمَّتَهُ الدَّجَّالَ الْأَعْوَرَ الْكَذَّابَ أَلَا وَإِنَّهُ أَعْوَرُ وَإِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ وَإِنَّ بَيْنَ عَيْنَيْهِ مَكْتُوبًا كَافِرٌحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ عَنْ شُعْبَةَ ك ف ر حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ شُعَيْبِ بْنِ الْحَبْحَابِ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْحَدِيثِ قَالَ يَقْرَؤُهُ كُلُّ مُسْلِمٍ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] berkata, telah menceritakan kepada kami [Syu'bah] dari [Qatadah] ia berkata; Aku mendengar [Anas bin Malik] menceritakan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tiada seorang Nabi yang diutus kecuali ia telah menjelaskan kepada umatnya tentang dajjal, si buta sebelah dan pendusta. Ketahuilah, bahwa ia benar-benar buta sebelah, dan Rabb kalian tidak buta sebelah. Antara kedua matanya tertulis 'kafir'.\" Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] dari [Muhammad bin Ja'far] dari [Syu'bah] berkata, \"Bertuliskan Kaf-Fa'-Ra.\" Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abdul Warits] dari [Syu'aib Ibnul Habhab] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits, beliau mengatakan: \"Setiap muslim akan dapat membacanya.\""
            },
            {
                "number": 3646,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا جَرِيرٌ حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ عَنْ أَبِي الدَّهْمَاءِ قَالَ سَمِعْتُ عِمْرَانَ بْنَ حُصَيْنٍ يُحَدِّثُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَمِعَ بِالدَّجَّالِ فَلْيَنْأَ عَنْهُ فَوَاللَّهِ إِنَّ الرَّجُلَ لَيَأْتِيهِ وَهُوَ يَحْسِبُ أَنَّهُ مُؤْمِنٌ فَيَتَّبِعُهُ مِمَّا يَبْعَثُ بِهِ مِنْ الشُّبُهَاتِ أَوْ لِمَا يَبْعَثُ بِهِ مِنْ الشُّبُهَاتِ هَكَذَا قَالَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Jarir] berkata, telah menceritakan kepada kami [Humaid bin Hilal] dari [Abu Ad Dahma] ia berkata; aku mendengar [Imran bin Hushain] menceritakan, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang mendengar (kedatangan) Dajjal hendaklah menjauhinya. Demi Allah, seorang laki-laki benar-benar akan mendatangi Dajjal dan mengira bahwa ia adalah seorang mukmin, lalu ia akan mengikuti setiap subhat yang ditebarkannya.\" Demikian beliau mengatakannya. "
            },
            {
                "number": 3647,
                "arab": "حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ حَدَّثَنَا بَقِيَّةُ حَدَّثَنِي بَحِيرٌ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ عَمْرِو بْنِ الْأَسْوَدِ عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ عَنْ عُبَادَةَ بْنِ الصَّامِتِ أَنَّهُ حَدَّثَهُمْأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنِّي قَدْ حَدَّثْتُكُمْ عَنْ الدَّجَّالِ حَتَّى خَشِيتُ أَنْ لَا تَعْقِلُوا إِنَّ مَسِيحَ الدَّجَّالِ رَجُلٌ قَصِيرٌ أَفْحَجُ جَعْدٌ أَعْوَرُ مَطْمُوسُ الْعَيْنِ لَيْسَ بِنَاتِئَةٍ وَلَا حَجْرَاءَ فَإِنْ أُلْبِسَ عَلَيْكُمْ فَاعْلَمُوا أَنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَقَالَ أَبُو دَاوُد عَمْرُو بْنُ الْأَسْوَدِ وَلِي الْقَضَاءَ",
                "id": "Telah menceritakan kepada kami [Haiwah bin Syuraih] berkata, telah menceritakan kepada kami [Baqiyyah] berkata, telah menceritakan kepadaku [Bahir] dari [Khalid bin Ma'dan] dari [Amru Ibnul Aswad] dari [Junadah bin Abu Umayyah] dari [Ubadah bin Ash Shamit] bahwa ia menceritakan kepada mereka, Bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh, aku telah menceritakan perihal Dajjal kepada kalian, hingga aku kawatir kalian tidak lagi mampu memahaminya. Sesungguhnya Al Masih Dajjal adalah seorang laki-laki yang pendek, berkaki bengkok, berambut keriting, buta sebelah dan matanya tidak terlalu menonjol dan tidak pula terlalu tenggelam. Jika kalian merasa bingung, maka ketahuilah bahwa Rabb kalian tidak bermata juling.\" Abu Dawud berkata, \"Amru Ibnul Aswad adalah seorang hakim.\""
            },
            {
                "number": 3648,
                "arab": "حَدَّثَنَا صَفْوَانُ بْنُ صَالِحٍ الدِّمَشْقِيُّ الْمُؤَذِّنُ حَدَّثَنَا الْوَلِيدُ حَدَّثَنَا ابْنُ جَابِرٍ حَدَّثَنِي يَحْيَى بْنُ جَابِرٍ الطَّائِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ عَنْ النَّوَّاسِ بْنِ سَمْعَانَ الْكِلَابِيِّ قَالَذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الدَّجَّالَ فَقَالَ إِنْ يَخْرُجْ وَأَنَا فِيكُمْ فَأَنَا حَجِيجُهُ دُونَكُمْ وَإِنْ يَخْرُجْ وَلَسْتُ فِيكُمْ فَامْرُؤٌ حَجِيجُ نَفْسِهِ وَاللَّهُ خَلِيفَتِي عَلَى كُلِّ مُسْلِمٍ فَمَنْ أَدْرَكَهُ مِنْكُمْ فَلْيَقْرَأْ عَلَيْهِ فَوَاتِحَ سُورَةِ الْكَهْفِ فَإِنَّهَا جِوَارُكُمْ مِنْ فِتْنَتِهِ قُلْنَا وَمَا لَبْثُهُ فِي الْأَرْضِ قَالَ أَرْبَعُونَ يَوْمًا يَوْمٌ كَسَنَةٍ وَيَوْمٌ كَشَهْرٍ وَيَوْمٌ كَجُمُعَةٍ وَسَائِرُ أَيَّامِهِ كَأَيَّامِكُمْ فَقُلْنَا يَا رَسُولَ اللَّهِ هَذَا الْيَوْمُ الَّذِي كَسَنَةٍ أَتَكْفِينَا فِيهِ صَلَاةُ يَوْمٍ وَلَيْلَةٍ قَالَ لَا اقْدُرُوا لَهُ قَدْرَهُ ثُمَّ يَنْزِلُ عِيسَى ابْنُ مَرْيَمَ عِنْدَ الْمَنَارَةِ الْبَيْضَاءِ شَرْقِيَّ دِمَشْقَ فَيُدْرِكُهُ عِنْدَ بَابِ لُدٍّ فَيَقْتُلُهُحَدَّثَنَا عِيسَى بْنُ مُحَمَّدٍ حَدَّثَنَا ضَمْرَةُ عَنْ السَّيْبَانِيِّ عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ عَنْ أَبِي أُمَامَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ وَذَكَرَ الصَّلَوَاتِ مِثْلَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Shafwan bin Shalih Ad Dimasyqi Al Mu'adzdzin] berkata, telah menceritakan kepada kami [Al Walid] berkata, telah menceritakan kepada kami [Ibnu Jabir] berkata, telah menceritakan kepadaku [Yahya bin Jabir Ath Tha`i] dari ['Abdurrahman bin Jubair bin Nufair] dari [Bapaknya] dari [An Nawwas bin Sam'an Al Kilabi] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menyebutkan tentang Dajjal, beliau bersabda: \"Jika saat Dajjal keluar aku masih bersama kalian maka akulah yang akan melindungi kalian darinya. Namun jika ia keluar dan aku tidak lagi bersama kalian, maka setiap orang harus melindungi dirinya sendiri. Allah adalah pelindung bagiku dan setiap muslim. Barangsiapa dari kalian berjumpa dengannya, hendaklah ia bacakan awal surat Al Kahfi, sebab itu akan melindungi kalian dari fitnahnya.\" Kami lalu bertanya, \"Berapa lama ia akan tinggal di bumi?\" beliau menjawab: \"Empat puluh hari. Satu hari seakan setahun, dan sehari seakan sebulan, dan sehari seakan sepekan dan hari-harinya dia sama sebagaimana hari-hari kalian.\" Kami bertanya lagi, \"Wahai Rasulullah, pada hari yang seakan satu tahun, apakah sholat kami akan mencukupi untuk waktu sehari semalam?\" beliau menjawab: \"Tidak, namun sesuaikanlah (setiap waktu sholat). Kemudian Isa putera Maryam akan turun di sisi menara putih, sebelah timur kota Damaskus. Lalu ia menemukan Dajjal di pintu Lud (sebuah tempat di dekat Baitul Maqdis), lantas ia pun membunuhnya.\" Telah menceritakan kepada kami [Isa bin Muhammad] berkata, telah menceritakan kepada kami [Dhamrah] dari [Asy Syaibani] dari [Amru bin Abdullah] dari [Abu Umamah] dari Nabi shallallahu 'alaihi wasallam, sebagaimana dalam hadits tersebut. Lalu beliau menyebutkan beberapa sholat seperti makna dalam hadits tersebut.\""
            },
            {
                "number": 3649,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ عَنْ حَدِيثِ أَبِي الدَّرْدَاءِ يَرْوِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ حَفِظَ عَشْرَ آيَاتٍ مِنْ أَوَّلِ سُورَةِ الْكَهْفِ عُصِمَ مِنْ فِتْنَةِ الدَّجَّالِقَالَ أَبُو دَاوُد وَكَذَا قَالَ هِشَامٌ الدَّسْتُوَائِيُّ عَنْ قَتَادَةَ إِلَّا أَنَّهُ قَالَ مَنْ حَفِظَ مِنْ خَوَاتِيمِ سُورَةِ الْكَهْفِ و قَالَ شُعْبَةُ عَنْ قَتَادَةَ مِنْ آخِرِ الْكَهْفِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] berkata, telah menceritakan kepada kami [Hammam] berkata, telah menceritakan kepada kami [Qatadah] dari [Salim bin Abu Al Ja'd] dari [Ma'dan bin Abu Thalhah] dari hadits [Abu Darda] yang ia riwayatkan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa menghafal sepuluh ayat awal dari surat Al Kahfi, maka ia akan dijaga dari fitnah Dajjal.\" Abu Dawud berkata, \"Seperti ini pula yang dikatakan oleh [Hisyam Ad Dustuwa`i] dari [Qatadah], hanya saja (dalam hadits itu) Rasulullah bersabda: \"Barangsiapa menghafal akhir-akhir dari surat Al kahfi, \" [Syu'bah] menyebutkan dari [Qatadah], \"Akhir dari surat Al Kahfi.\""
            },
            {
                "number": 3650,
                "arab": "حَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامُ بْنُ يَحْيَى عَنْ قَتَادَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ آدَمَ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْسَ بَيْنِي وَبَيْنَهُ نَبِيٌّ يَعْنِي عِيسَى وَإِنَّهُ نَازِلٌ فَإِذَا رَأَيْتُمُوهُ فَاعْرِفُوهُ رَجُلٌ مَرْبُوعٌ إِلَى الْحُمْرَةِ وَالْبَيَاضِ بَيْنَ مُمَصَّرَتَيْنِ كَأَنَّ رَأْسَهُ يَقْطُرُ وَإِنْ لَمْ يُصِبْهُ بَلَلٌ فَيُقَاتِلُ النَّاسَ عَلَى الْإِسْلَامِ فَيَدُقُّ الصَّلِيبَ وَيَقْتُلُ الْخِنْزِيرَ وَيَضَعُ الْجِزْيَةَ وَيُهْلِكُ اللَّهُ فِي زَمَانِهِ الْمِلَلَ كُلَّهَا إِلَّا الْإِسْلَامَ وَيُهْلِكُ الْمَسِيحَ الدَّجَّالَ فَيَمْكُثُ فِي الْأَرْضِ أَرْبَعِينَ سَنَةً ثُمَّ يُتَوَفَّى فَيُصَلِّي عَلَيْهِ الْمُسْلِمُونَ",
                "id": "Telah menceritakan kepada kami [Hudbah bin Khalid] berkata, telah menceritakan kepada kami [Hammam bin Yahya] dari [Qatadah] dari ['Abdurrahman bin Adam] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada Nabi antara aku dan dia -maksudnya Isa-. Sungguh, kelak ia akan turun, jika kalian melihatnya maka kenalilah. Ia adalah seorang laki-laki yang sedang (tidak tinggi ataupun pendek), berkulit merah keputih-putihan, mengenakan kain berwarna kekuningan. Seakan rambut kepala menetes meski tidak basah. Ia akan memerangi manusia hingga mereka masuk ke dalam Islam, ia memecahkan salib, membunuh babi dan membebaskan jizyah (pajak). Pada masanya Allah akan membinasakan semua agama selain Islam, Isa akan membunuh Dajjal, dan akan tinggal di dunia selama empat puluh tahun. Setelah itu ia meninggal dan kaum muslimin mensholatinya.\""
            },
            {
                "number": 3651,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا عُثْمَانُ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ فَاطِمَةَ بِنْتِ قَيْسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَّرَ الْعِشَاءَ الْآخِرَةَ ذَاتَ لَيْلَةٍ ثُمَّ خَرَجَ فَقَالَ إِنَّهُ حَبَسَنِي حَدِيثٌ كَانَ يُحَدِّثُنِيهِ تَمِيمٌ الدَّارِيُّ عَنْ رَجُلٍ كَانَ فِي جَزِيرَةٍ مِنْ جَزَائِرِ الْبَحْرِ فَإِذَا أَنَا بِامْرَأَةٍ تَجُرُّ شَعْرَهَا قَالَ مَا أَنْتِ قَالَتْ أَنَا الْجَسَّاسَةُ اذْهَبْ إِلَى ذَلِكَ الْقَصْرِ فَأَتَيْتُهُ فَإِذَا رَجُلٌ يَجُرُّ شَعْرَهُ مُسَلْسَلٌ فِي الْأَغْلَالِ يَنْزُو فِيمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ فَقُلْتُ مَنْ أَنْتَ قَالَ أَنَا الدَّجَّالُ خَرَجَ نَبِيُّ الْأُمِّيِّينَ بَعْدُ قُلْتُ نَعَمْ قَالَ أَطَاعُوهُ أَمْ عَصَوْهُ قُلْتُ بَلْ أَطَاعُوهُ قَالَ ذَاكَ خَيْرٌ لَهُمْحَدَّثَنَا حَجَّاجُ بْنُ أَبِي يَعْقُوبَ حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ حُسَيْنًا الْمُعَلِّمَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ حَدَّثَنَا عَامِرُ بْنُ شَرَاحِيلَ الشَّعْبِيُّ عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ قَالَتْ سَمِعْتُ مُنَادِيَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنَادِي أَنْ الصَّلَاةُ جَامِعَةٌ فَخَرَجْتُ فَصَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاتَهُ جَلَسَ عَلَى الْمِنْبَرِ وَهُوَ يَضْحَكُ قَالَ لِيَلْزَمْ كُلُّ إِنْسَانٍ مُصَلَّاهُ ثُمَّ قَالَ هَلْ تَدْرُونَ لِمَ جَمَعْتُكُمْ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ إِنِّي مَا جَمَعْتُكُمْ لِرَهْبَةٍ وَلَا رَغْبَةٍ وَلَكِنْ جَمَعْتُكُمْ أَنَّ تَمِيمًا الدَّارِيَّ كَانَ رَجُلًا نَصْرَانِيًّا فَجَاءَ فَبَايَعَ وَأَسْلَمَ وَحَدَّثَنِي حَدِيثًا وَافَقَ الَّذِي حَدَّثْتُكُمْ عَنْ الدَّجَّالِ حَدَّثَنِي أَنَّهُ رَكِبَ فِي سَفِينَةٍ بَحْرِيَّةٍ مَعَ ثَلَاثِينَ رَجُلًا مِنْ لَخْمٍ وَجُذَامٍ فَلَعِبَ بِهِمْ الْمَوْجُ شَهْرًا فِي الْبَحْرِ وَأَرْفَئُوا إِلَى جَزِيرَةٍ حِينَ مَغْرِبِ الشَّمْسِ فَجَلَسُوا فِي أَقْرُبْ السَّفِينَةِ فَدَخَلُوا الْجَزِيرَةَ فَلَقِيَتْهُمْ دَابَّةٌ أَهْلَبُ كَثِيرَةُ الشَّعْرِ قَالُوا وَيْلَكِ مَا أَنْتِ قَالَتْ أَنَا الْجَسَّاسَةُ انْطَلِقُوا إِلَى هَذَا الرَّجُلِ فِي هَذَا الدَّيْرَ فَإِنَّهُ إِلَى خَبَرِكُمْ بِالْأَشْوَاقِ قَالَ لَمَّا سَمَّتْ لَنَا رَجُلًا فَرِقْنَا مِنْهَا أَنْ تَكُونَ شَيْطَانَةً فَانْطَلَقْنَا سِرَاعًا حَتَّى دَخَلْنَا الدَّيْرَ فَإِذَا فِيهِ أَعْظَمُ إِنْسَانٍ رَأَيْنَاهُ قَطُّ خَلْقًا وَأَشَدُّهُ وَثَاقًا مَجْمُوعَةٌ يَدَاهُ إِلَى عُنُقِهِ فَذَكَرَ الْحَدِيثَ وَسَأَلَهُمْ عَنْ نَخْلِ بَيْسَانَ وَعَنْ عَيْنِ زُغَرَ وَعَنْ النَّبِيِّ الْأُمِّيِّ قَالَ إِنِّي أَنَا الْمَسِيحُ وَإِنَّهُ يُوشَكُ أَنْ يُؤْذَنَ لِي فِي الْخُرُوجِ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنَّهُ فِي بَحْرِ الشَّامِ أَوْ بَحْرِ الْيَمَنِ لَا بَلْ مِنْ قِبَلِ الْمَشْرِقِ مَا هُوَ مَرَّتَيْنِ وَأَوْمَأَ بِيَدِهِ قِبَلَ الْمَشْرِقِ قَالَتْ حَفِظْتُ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَاقَ الْحَدِيثَ حَدَّثَنَا مُحَمَّدُ بْنُ صُدْرَانَ حَدَّثَنَا الْمُعْتَمِرُ حَدَّثَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ مُجَالِدِ بْنِ سَعِيدٍ عَنْ عَامِرٍ قَالَ حَدَّثَتْنِي فَاطِمَةُ بِنْتُ قَيْسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ ثُمَّ صَعِدَ الْمِنْبَرَ وَكَانَ لَا يَصْعَدُ عَلَيْهِ إِلَّا يَوْمَ جُمُعَةٍ قَبْلَ يَوْمَئِذٍ ثُمَّ ذَكَرَ هَذِهِ الْقِصَّةَ قَالَ أَبُو دَاوُد وَابْنُ صُدْرَانَ بَصْرِيٌّ غَرِقَ فِي الْبَحْرِ مَعَ ابْنِ مِسْوَرٍ لَمْ يَسْلَمْ مِنْهُمْ غَيْرُهُ حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى أَخْبَرَنَا ابْنُ فُضَيْلٍ عَنْ الْوَلِيدِ بْنِ عَبْدِ اللَّهِ بْنِ جُمَيْعٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ عَلَى الْمِنْبَرِ إِنَّهُ بَيْنَمَا أُنَاسٌ يَسِيرُونَ فِي الْبَحْرِ فَنَفِدَ طَعَامُهُمْ فَرُفِعَتْ لَهُمْ جَزِيرَةٌ فَخَرَجُوا يُرِيدُونَ الْخُبْزَ فَلَقِيَتْهُمْ الْجَسَّاسَةُ قُلْتُ لِأَبِي سَلَمَةَ وَمَا الْجَسَّاسَةُ قَالَ امْرَأَةٌ تَجُرُّ شَعْرَ جِلْدِهَا وَرَأْسِهَا قَالَتْ فِي هَذَا الْقَصْرِ فَذَكَرَ الْحَدِيثَ وَسَأَلَ عَنْ نَخْلِ بَيْسَانَ وَعَنْ عَيْنِ زُغَرَ قَالَ هُوَ الْمَسِيحُ فَقَالَ لِي ابْنُ أَبِي سَلَمَةَ إِنَّ فِي هَذَا الْحَدِيثِ شَيْئًا مَا حَفِظْتُهُ قَالَ شَهِدَ جَابِرٌ أَنَّهُ هُوَ ابْنُ صَيَّادٍ قُلْتُ فَإِنَّهُ قَدْ مَاتَ قَالَ وَإِنْ مَاتَ قُلْتُ فَإِنَّهُ أَسْلَمَ قَالَ وَإِنْ أَسْلَمَ قُلْتُ فَإِنَّهُ قَدْ دَخَلَ الْمَدِينَةَ قَالَ وَإِنْ دَخَلَ الْمَدِينَةَ",
                "id": "Telah menceritakan kepada kami [An Nufaili] berkata, telah menceritakan kepada kami [Utsman bin 'Abdurrahman] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi`b] dari [Az Zuhri] dari [Abu Salamah] dari [Fatimah binti Qais] berkata, \"Pada suatu malam pernah Rasulullah shallallahu 'alaihi wasallam mengakhirkan sholat isya` yang akhir, lalu beliau keluar dan bersabda: \"Sesungguhnya yang menghalangiku (untuk segera keluar) adalah kisah yang diceritakan Tamim Ad Dari kepadaku dari seorang laki-laki yang berada di sebuah pulau dari gugusan pulau-pulau. Tamim berkata, \"Saat itu tiba-tiba ada seorang wanita yang berambut panjang.\" Tamim selanjutnya bertanya, \"Siapa kamu?\" Ia menjawab, \"Aku adalah Jasasah. Pergilah kamu ke istana itu.\" Tamim berkata, \"Aku pun mendatanginya, ternyata di sana ada seorang laki-laki berambut panjang yang terikat dengan sebuah rantai. Tingginya menjulang antara langit dan bumi. Aku lalu bertanya, \"Siapa kamu?\" Ia menjawab, \"Aku adalah Dajjal. Apakah telah ada seorang Nabi buta huruf yang diutus?\" Aku menjawab, \"Ya.\" Ia kembali bertanya, \"Apakah orang-orang mentaatinya atau mengingkarinya?\" Aku menjawab, \"Orang-orang mentaatinya.\" Ia berkata, \"Itu yang lebih baik bagi mereka.\" Telah menceritakan kepada kami [Hajjaj bin Abu Ya'qub] berkata, telah menceritakan kepada kami [Abdu Ash Shamad] berkata, telah menceritakan kepada kami [Bapakku] ia berkata; Aku mendengar [Husain Al Mu'allim] berkata, telah menceritakan kepada kami [Abdullah bin Buraidah] berkata, telah menceritakan kepada kami [Amir bin Syurahil Asy Sya'bi] dari [Fatimah binti Qais] ia berkata; Aku mendengar tukang adzan Rasulullah shallallahu 'alaihi wasallam menyeru 'Ash sholatu Jami'ah (sholatlah berjamaah) ', maka aku keluar dan ikut sholat berjamaah bersama Rasulullah shallallahu 'alaihi wasallam. Ketika Rasulullah shallallahu 'alaihi wasallam selesai dari sholatnya, beliau duduk sambil tertawa, beliau bersabda: \"Hendaklah setiap orang tetap di tempat sholatnya (duduk).\" Kemudian beliau melanjutkan sabdanya: \"Apakah kalian tahu, kenapa aku kumpulkan kalian di sini?\" Para sahabat, \"Allah dan Rasul-Nya lebih tahu.\" Beliau bersabda: \"Aku kumpulkan kalian bukan atas sesuatu yang membuat takut atau senang, namun aku kumpulkan kalian adalah karena Tamim Ad Dari, seorang lelaki Nashrani yang datang dan berbaiat masuk Islam, ia menceritakan kepadaku sebuah kisah yang mirip dengan cerita yang pernah aku ceritakan kepada kalian tentang Dajjal. Ia ceritakan kepadaku bahwasanya ia pernah menaiki sebuah perahu bersama tiga puluh laki-laki dari kaum Lakhm dan Judzam, mereka kemudian diombang-ambingkan oleh ombak selama satu bulan di tengah laut, sampai akhirnya mereka menepi ke sebuah pulau saat matahari terbenam. Mereka lantas duduk di sisi kapal mereka, setelah itu mereka bergegas memasuki pulau tersebut hingga akhirnya bertemu dengan binatang melata besar dan berbulu lebat. Mereka berkata, \"Celaka engkau, siapa kamu ini!\" binatang itu menjawab, \"Aku adalah Jasasah. Temuilah laki-laki yang ada dalam sebuah gua, karena ia sangat berkeinginan untuk mendengar berita dari kalian.\" Tamim berkata, \"Saat ia menyebut laki-laki, maka kami ketakutan jikalau dia adalah setan lalu kami cepat pergi hingga memasuki gua tersebut. Dan ternyata di dalamnya terdapat manusia yang paling besar yang pernah kami lihat, talinya sangat kuat, dan tangannya menyatu dengan leher (terikat dengan rantai).\" Lalu perawi menyebutkan hadits tersebut dengan lengkap. Manusia besar (Dajjal) itu bertanya kepada mereka tentang Nakhl Baisan (nama tempat dekat Yordania), mata air Zughar (nama tempat di Syam) dan seorang Nabi yang buta huruf. Manusia besar itu berkata, \"Aku adalah Al Masih Dajjal, dan hampir-hampir aku mendapat izin untuk segera keluar.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Sesunggunya ia (Dajjal) berada di laut Syam, atau laut Yaman. Bahkan ia akan muncul dari arah timur tempat ia berasal -beliau ucapkan hingga dua kali seraya menunjuk ke arah timur-. Fatimah berkata, \"Aku hafal perkataan ini dari Rasulullah shallallahu 'alaihi wasallam, lalu ia menyebutkan hadits selengkapnya.\" Telah menceritakan kepada kami [Muhammad bin Shadran] berkata, telah menceritakan kepada kami [Al Mu'tamir] berkata, telah menceritakan kepada kami [Isma'il bin Abu Khalid] dari [Mujalid bin Sa'id] dari [Amir] ia berkata; [Fatimah bin Qais] menceritakan kepadaku bahwa pernah Nabi shallallahu 'alaihi wasallam sholat zhuhur kemudian naik ke atas mimbar, padahal sebelum hari itu beliau tidak penah naik ke atas mimbar tersebut kecuali di hari jum'at. Kemudian beliau menyebutkan kisah ini.\" Abu Dawud berkata, \"Ibnu Shadran adalah orang Bashrah, ia pernah tenggelam di lautan bersama Ibnu Miswar, dan tidak ada yang selamat dari mereka selain dia.\" Telah menceritakan kepada kami [Washil bin Abdul A'la] berkata, telah mengabarkan kepada kami [Ibnu Fudhail] dari [Al Walid bin Abdullah bin Jumai'] dari [Abu Salamah bin 'Abdurrahman] dari [Jabir] ia berkata, \"Pada suatu hari Rasulullah shallallahu 'alaihi wasallam bersabda di atas mimbar: \"Ketika ada beberapa orang berlayar di lautan, makanan mereka hilang (habis), lalu tampaklah oleh mereka sebuah pulau. Mereka pun menuju pulau tersebut untuk mencari roti, namun mereka dihadang oleh Jasasah.\" Aku (Walid bin Abdullah) lantas bertanya kepada Abu Salamah, \"apa itu Jassasah?\" Ia menjawab, \"Seorang wanita yang rambutnya menutupi kulit dan kepalanya. Wanita itu berkata, \"Dalam istana ini.\" Lalu ia menceritakan haditsnya, dan ia bertanya tentang Nakhl Baisan dan mata air Zughar, ia menjawab; \"Dia adalah Al Masih\", maka Abu Salamah berkata kepadaku; Dalam hadits ini ada beberapa lafadz yang tidak aku hafal. Abu Salamah berkata, \"Jabir bersaksi bahwa laki-laki itu adalah Ibnu Shayyad.\" Aku berkata, \"Tapi Ibnu Shayyad telah mati!\" Jabir menjawab, \"Meskipun ia telah mati.\" Aku bertanya lagi, \"Ia juga telah masuk Islam.\" Jabir berkata, \"Meskipun ia telah masuk Islam.\" Aku bertanya, \"Ia juga telah masuk ke kota Madinah.\" Jabir menjawab, \"Meskipun ia telah masuk kota Madinah.\""
            },
            {
                "number": 3652,
                "arab": "حَدَّثَنَا أَبُو عَاصِمٍ خُشَيْشُ بْنُ أَصْرَمَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِابْنِ صَائِدٍ فِي نَفَرٍ مِنْ أَصْحَابِهِ فِيهِمْ عُمَرُ بْنُ الْخَطَّابِ وَهُوَ يَلْعَبُ مَعَ الْغِلْمَانِ عِنْدَ أُطُمِ بَنِي مَغَالَةَ وَهُوَ غُلَامٌ فَلَمْ يَشْعُرْ حَتَّى ضَرَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ظَهْرَهُ بِيَدِهِ ثُمَّ قَالَ أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ قَالَ فَنَظَرَ إِلَيْهِ ابْنُ صَيَّادٍ فَقَالَ أَشْهَدُ أَنَّكَ رَسُولُ الْأُمِّيِّينَ ثُمَّ قَالَ ابْنُ صَيَّادٍ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آمَنْتُ بِاللَّهِ وَرُسُلِهِ ثُمَّ قَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا يَأْتِيكَ قَالَ يَأْتِينِي صَادِقٌ وَكَاذِبٌ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُلِطَ عَلَيْكَ الْأَمْرُ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي قَدْ خَبَّأْتُ لَكَ خَبِيئَةً وَخَبَّأَ لَهُ{ يَوْمَ تَأْتِي السَّمَاءُ بِدُخَانٍ مُبِينٍ }قَالَ ابْنُ صَيَّادٍ هُوَ الدُّخُّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اخْسَأْ فَلَنْ تَعْدُوَ قَدْرَكَ فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ ائْذَنْ لِي فَأَضْرِبَ عُنُقَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ يَكُنْ فَلَنْ تُسَلَّطَ عَلَيْهِ يَعْنِي الدَّجَّالَ وَإِلَّا يَكُنْ هُوَ فَلَا خَيْرَ فِي قَتْلِهِ",
                "id": "Telah menceritakan kepada kami [Abu Ashim Khusyaisy bin Ashram] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar] berkata, \"Nabi shallallahu 'alaihi wasallam bersama beberapa orang sahabatnya, termasuk di dalamnya adalah Umar Ibnul Khaththab, melewati Ibnu Shaid ketika sedang bermain-main dengan beberapa anak kecil di sebuah bangunan tinggi milik bani Maghalah. Dan Ibnu Shaid waktu itu juga masih seorang bocah. Ia tidak sadar dengan kedatangan Rasulullah shallallahu 'alaihi wasallam hingga beliau menepuk pundaknya dengan tangan, beliau lantas bertanya: \"Apakah kamu bersaksi bahwa aku adalah utusan Allah?\" Ibnu Shaid memperhatikan beliau, lalu ia menjawab, \"Aku bersaksi bahwa engkau adalah utusan Allah yang buta aksara. Setelah itu Ibnu Shaid berkata kepada Nabi shallallahu 'alaihi wasallam, \"Apakah kamu juga bersaksi bahwa aku adalah utusan Allah?\" Nabi shallallahu 'alaihi wasallam balik berkata, \"Aku beriman kepada Allah dan para rasul-Nya.\" Nabi shallallahu 'alaihi wasallam kemudian bertanya kepadanya: \"(Berita ghaib) apa yang kamu bawa?\" Ibnu Shaid menjawab, \"Telah datang kepadaku berita (ghaib) yang benar dan berita bohong.\" Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Perkaramu membingungkan (bercampur antara kebenaran dengan kedustaan).\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda lagi: \"Sesungguhnya aku telah menyembunyikan sesuatu darimu, \" beliau menyembunyikan darinya: '(Maka tunggulah ketika langit membawa kabut yang nyata) '. Ibnu Shaid berkata, \"Yang dimaksud itu adalah awan.\" Rasulullah shallallahu 'alaihi wasallam lantas berkata kepadanya: \"His! Sekali-kali engkau tidak akan dapat mendahului takdirmu.\" Kemudian Umar berkata, \"Wahai Rasulullah, izinkanlah aku memenggal lehernya!\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika memang ia Dajjal, maka engkau tidak diberi kuasa untuk membunuhnya. Namun jika bukan dia, maka tidak ada manfaat membunuhnya.\""
            },
            {
                "number": 3653,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعٍ قَالَكَانَ ابْنُ عُمَرَ يَقُولُ وَاللَّهِ مَا أَشُكُّ أَنَّ الْمَسِيحَ الدَّجَّالَ ابْنُ صَيَّادٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Ya'qub] -maksudnya Ya'qub bin 'Abdurrahman- dari [Musa bin Uqbah] dari [Nafi'] ia berkata, \" [Ibnu Umar] berkata, \"Demi Allah, aku tidak ragu bahwa Al Masih Dajjal adalah Ibnu Shayyad.\""
            },
            {
                "number": 3654,
                "arab": "حَدَّثَنَا ابْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ قَالَرَأَيْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَحْلِفُ بِاللَّهِ أَنَّ ابْنَ صَائِدٍ الدَّجَّالُ فَقُلْتُ تَحْلِفُ بِاللَّهِ فَقَالَ إِنِّي سَمِعْتُ عُمَرَ يَحْلِفُ عَلَى ذَلِكَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يُنْكِرْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ibnu Mu'adz] berkata, telah menceritakan kepada kami [Bapakku] berkata, telah menceritakan kepada kami [Syu'bah] dari [Sa'd bin Ibrahim] dari [Muhammad bin Al Munkadir] ia berkata, \"Aku melihat [Jabir bin Abdullah] bersumpah dengan nama Allah bahwa Ibnu Shaid adalah Dajjal.\" Aku lalu berkata, \"Engkau benar-benar bersumpah kepada Allah!\" Ia lalu menjawab, \"Aku mendengar Umar bersumpah dengan hal yang sama di hadapan Rasulullah shallallahu 'alaihi wasallam dan beliau tidak mengingkarinya.\""
            },
            {
                "number": 3655,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ مُوسَى حَدَّثَنَا شَيْبَانُ عَنْ الْأَعْمَشِ عَنْ سَالِمٍ عَنْ جَابِرٍ قَالَفَقَدْنَا ابْنَ صَيَّادٍ يَوْمَ الْحَرَّةِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Ibrahim] berkata, telah menceritakan kepada kami [ubaidhullah] -maksudnya ubaidhullah bin Musa- berkata, telah menceritakan kepada kami [Syaiban] dari [Al A'masy] dari [Salim] dari [Jabir] ia berkata, \"Kami kehilangan Ibnu Shayyad pada hari Al harrah.\""
            },
            {
                "number": 3656,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقُومُ السَّاعَةُ حَتَّى يَخْرُجَ ثَلَاثُونَ دَجَّالُونَ كُلُّهُمْ يَزْعُمُ أَنَّهُ رَسُولُ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] berkata, telah menceritakan kepada kami [Abdul Aziz] -maksudnya Abdul Aziz bin Muhammad- dari [Al 'Ala`] dari [Bapaknya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak akan datang hari kiamat hingga muncul tiga puluh Dajjal, mereka semua mengaku sebagai utusan Allah.\""
            },
            {
                "number": 3657,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقُومُ السَّاعَةُ حَتَّى يَخْرُجَ ثَلَاثُونَ كَذَّابًا دَجَّالًا كُلُّهُمْ يَكْذِبُ عَلَى اللَّهِ وَعَلَى رَسُولِهِحَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ عَنْ جَرِيرٍ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ قَالَ قَالَ عُبَيْدَةُ السَّلْمَانِيُّ بِهَذَا الْخَبَرِ قَالَ فَذَكَرَ نَحْوَهُ فَقُلْتُ لَهُ أَتَرَى هَذَا مِنْهُمْ يَعْنِي الْمُخْتَارَ فَقَالَ عُبَيْدَةُ أَمَا إِنَّهُ مِنْ الرُّءُوسِ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Mu'adz] berkata, telah menceritakan kepada kami [Bapakku] berkata, telah menceritakan kepada kami [Muhammad] -maksudnya Muhammad bin Amru- dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak akan datang hari kiamat hingga muncul tiga puluh Dajjal pendusta, mereka semua berdusta kepada Allah dan Rasul-Nya.\" Telah menceritakan kepada kami [Abdullah Ibnul Jarrah] dari [Jarir] dari [Mughirah] dari [Ibrahim] ia berkata; [Ubaidah As Sulami] menyebutkan dengan hadits ini. ia berkata, \"Lalu ia menyebutkan sebagaimana hadits tersebut.\" Aku (Ibrahim) lalu berkata kepada Ubaidah, \"Apakah engkau mengira bahwa orang ini -Al Mukhtar- berasal dari mereka (para dajjal pendusta)?\" Ubaidah menjawab, \"(Bahkan) Ia dari pembesarnya.\""
            },
            {
                "number": 3658,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا يُونُسُ بْنُ رَاشِدٍ عَنْ عَلِيِّ بْنِ بَذِيمَةَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَوَّلَ مَا دَخَلَ النَّقْصُ عَلَى بَنِي إِسْرَائِيلَ كَانَ الرَّجُلُ يَلْقَى الرَّجُلَ فَيَقُولُ يَا هَذَا اتَّقِ اللَّهَ وَدَعْ مَا تَصْنَعُ فَإِنَّهُ لَا يَحِلُّ لَكَ ثُمَّ يَلْقَاهُ مِنْ الْغَدِ فَلَا يَمْنَعُهُ ذَلِكَ أَنْ يَكُونَ أَكِيلَهُ وَشَرِيبَهُ وَقَعِيدَهُ فَلَمَّا فَعَلُوا ذَلِكَ ضَرَبَ اللَّهُ قُلُوبَ بَعْضِهِمْ بِبَعْضٍ ثُمَّ قَالَ{ لُعِنَ الَّذِينَ كَفَرُوا مِنْ بَنِي إِسْرَائِيلَ عَلَى لِسَانِ دَاوُدَ وَعِيسَى ابْنِ مَرْيَمَ إِلَى قَوْلِهِ فَاسِقُونَ }ثُمَّ قَالَ كَلَّا وَاللَّهِ لَتَأْمُرُنَّ بِالْمَعْرُوفِ وَلَتَنْهَوُنَّ عَنْ الْمُنْكَرِ وَلَتَأْخُذُنَّ عَلَى يَدَيْ الظَّالِمِ وَلَتَأْطُرُنَّهُ عَلَى الْحَقِّ أَطْرًا وَلَتَقْصُرُنَّهُ عَلَى الْحَقِّ قَصْرًاحَدَّثَنَا خَلَفُ بْنُ هِشَامٍ حَدَّثَنَا أَبُو شِهَابٍ الْحَنَّاطُ عَنْ الْعَلَاءِ بْنِ الْمُسَيِّبِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ سَالِمٍ عَنْ أَبِي عُبَيْدَةَ عَنْ ابْنِ مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ زَادَ أَوْ لَيَضْرِبَنَّ اللَّهُ بِقُلُوبِ بَعْضِكُمْ عَلَى بَعْضٍ ثُمَّ لَيَلْعَنَنَّكُمْ كَمَا لَعَنَهُمْ قَالَ أَبُو دَاوُد رَوَاهُ الْمُحَارِبِيُّ عَنْ الْعَلَاءِ بْنِ الْمُسَيِّبِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ مُرَّةَ عَنْ سَالِمٍ الْأَفْطَسِ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ وَرَوَاهُ خَالِدٌ الطَّحَّانُ عَنْ الْعَلَاءِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي عُبَيْدَةَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] berkata, telah menceritakan kepada kami [Yunus bin Rasyid] dari [Ali bin Badzimah] dari [Abu Ubaidah] dari [Abdullah bin Mas'ud] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kemaksiatan pertama kali yang terjadi pada bani Isra'il adalah ketika seorang laki-laki berjumpa seorang laki-laki lain, ia berkata, \"Wahai saudaraku, bertaqwalah kepada Allah, tinggalkan apa yang telah engkau lakukan, karena itu tidak halal untuk kamu lakukan.\" Kemudian keesokan harinya ia berjumpa lagi dengannya, namun perbuatan maksiat yang ia larang (kepada temannya) tidak mencegah dirinya untuk menjadikannya sebagai teman makan dan minum serta duduknya (yakni ikut bersama dalam kemaksiatan), maka ketika mereka melakukan hal itu, Allah menghitamkan hati sebagian mereka karena sebab sebagian yang lain. Kemudian beliau membaca: (Telah dila'nati orang-orang kafir dari Bani Israil dengan lisan Daud dan 'Isa putera Maryam) hingga firmannya: (orang-orang yang fasik) '. Kemudian beliau bersabda; \"Demi Allah hendaklah kalian benar-benar memerintahkan kebaikan, mencegah kemungkaran dan mencabutnya dari tangan orang zhalim lalu mengambalikannya (membelokkannya) kepada kebenaran serta konsisten terhadap kebenaran itu.\", telah menceritakan kepada kami [Khalaf bin Hisyam] telah menceritakan kepada kami [Abu Syihab Al Hannath] dari [Al 'Ala` bin Al Musayyib] dari [Amru bin Murrah] dari [Salim] dari [Abu Ubaidah] dari [Ibnu Mas'ud] dari Nabi shallallahu 'alaihi wasallam seperti hadits tersebut, dengan tambahan redaksi; \"atau (jika tidak) Allah benar-benar akan menutup hati kalian karena (tutupnya) sebagian yang lain, kemudian melaknat kalian sebagaimana telah melaknat mereka (orang-orang bani Israil).\", Abu Daud berkata; [Al Muharibi] telah meriwayatkan hadits ini dari [Al 'Ala` bin Al Musayyib] dari [Abdullah bin Amru bin Murrah] dari [Salim Al Afthas] dari [Abu Ubaidah] dari [Abdullah], dan [Khalid] meriwayatkan hadits ini dari [Al 'Ala`] dari [Amru bin Murrah] dari [Abu Ubaidah].\""
            },
            {
                "number": 3659,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ ح و حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا هُشَيْمٌ الْمَعْنَى عَنْ إِسْمَعِيلَ عَنْ قَيْسٍ قَالَ قَالَ أَبُو بَكْرٍبَعْدَ أَنْ حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ يَا أَيُّهَا النَّاسُ إِنَّكُمْ تَقْرَءُونَ هَذِهِ الْآيَةَ وَتَضَعُونَهَا عَلَى غَيْرِ مَوَاضِعِهَا{ عَلَيْكُمْ أَنْفُسَكُمْ لَا يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُمْ }قَالَ عَنْ خَالِدٍ وَإِنَّا سَمِعْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ النَّاسَ إِذَا رَأَوْا الظَّالِمَ فَلَمْ يَأْخُذُوا عَلَى يَدَيْهِ أَوْشَكَ أَنْ يَعُمَّهُمْ اللَّهُ بِعِقَابٍ و قَالَ عَمْرٌو عَنْ هُشَيْمٍ وَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ قَوْمٍ يُعْمَلُ فِيهِمْ بِالْمَعَاصِي ثُمَّ يَقْدِرُونَ عَلَى أَنْ يُغَيِّرُوا ثُمَّ لَا يُغَيِّرُوا إِلَّا يُوشِكُ أَنْ يَعُمَّهُمْ اللَّهُ مِنْهُ بِعِقَابٍقَالَ أَبُو دَاوُد وَرَوَاهُ كَمَا قَالَ خَالِدٌ أَبُو أُسَامَةَ وَجَمَاعَةٌ وَقَالَ شُعْبَةُ فِيهِ مَا مِنْ قَوْمٍ يُعْمَلُ فِيهِمْ بِالْمَعَاصِي هُمْ أَكْثَرُ مِمَّنْ يَعْمَلُهُ",
                "id": "Telah menceritakan kepada kami [Wahb bin Baqiyyah] dari [Khalid]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Amru bin Aun] berkata, telah mengabarkan kepada kami [Husyaim] secara makna, dari [Isma'il] dari [Qais] ia berkata, \"Setelah mengucapkan pujian dan mengagungkan-Nya, [Abu Bakar] berkata, \"Wahai manusia sekalian, kalian telah membaca ayat ini, namun kalian tidak meletakkannya sebagaimana mestinya: '(.. jagalah dirimu; tidaklah orang yang sesat itu akan memberi madharat kepadamu apabila kamu telah mendapatkan petunjuk..) ' -Al Maidah: 105-. Wahb menyebutkan dari [Khalid], (Abu Bakar berkata;) \"Kami mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang yang melihat kezhaliman kemudian tidak mencegah dengan tangannya, maka sangat dikawatirkan Allah akan menimpakan siksa kepada mereka secara merata.\" [Amru] menyebutkan dari [Husyaim], \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah kemaksiatan yang dilakukan pada suatu kaum, kemudian mereka mampu mencegahnya tetapi tidak mau mencegah, melainkan Allah akan meratakan siksa kepada mereka.\" Abu Dawud berkata; \" [Abu Usamah] dan sekelompok orang juga meriwayatkannya sebagaimana yang dikatakan oleh Khalid\". sedangkan Syu'bah meriwayatkan dengan lafadz di dalamnya, \"Tidaklah suatu kemaksiatan dilakukan pada suatu kaum, sementara jumlah mereka lebih banyak dari orang-orang yang melakukannya (kemaksiatan), ….).\""
            },
            {
                "number": 3660,
                "arab": "حَدَّثَنَا مُسَّدَدٌ حَدَّثَنَا أَبُو الْأَحْوَصِ حَدَّثَنَا أَبُو إِسْحَقَ أَظُنُّهُ عَنْ ابْنِ جَرِيرٍ عَنْ جَرِيرٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ رَجُلٍ يَكُونُ فِي قَوْمٍ يُعْمَلُ فِيهِمْ بِالْمَعَاصِي يَقْدِرُونَ عَلَى أَنْ يُغَيِّرُوا عَلَيْهِ فَلَا يُغَيِّرُوا إِلَّا أَصَابَهُمْ اللَّهُ بِعَذَابٍ مِنْ قَبْلِ أَنْ يَمُوتُوا",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Al Ahwash] berkata, telah menceritakan kepada kami [Abu Ishaq] aku mengira bahwa itu berasal dari [Ibnu Jarir] dari [Jarir] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang laki-laki berada pada sebuah kaum yang di dalamnya dilakukan suatu kemaksiatan, mereka mampu mengubah kemaksiatan tersebut lalu tidak melakukannya, maka Allah akan menimpakan siksa kepada mereka sebelum mereka meninggal.\""
            },
            {
                "number": 3661,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَهَنَّادُ بْنُ السَّرِيِّ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِسْمَعِيلَ بْنِ رَجَاءٍ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ وَعَنْ قَيْسِ بْنِ مُسْلِمٍ عَنْ طَارِقِ بْنِ شِهَابٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ رَأَى مُنْكَرًا فَاسْتَطَاعَ أَنْ يُغَيِّرَهُ بِيَدِهِ فَلْيُغَيِّرْهُ بِيَدِهِ وَقَطَعَ هَنَّادٌ بَقِيَّةَ الْحَدِيثِ وَفَّاهُ ابْنُ الْعَلَاءِ فَإِنْ لَمْ يَسْتَطِعْ فَبِلِسَانِهِ فَإِنْ لَمْ يَسْتَطِعْ بِلِسَانِهِ فَبِقَلْبِهِ وَذَلِكَ أَضْعَفُ الْإِيمَانِ",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul 'Ala] dan [Hannad bin As Sari] keduanya berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Isma'il bin Raja] dari [Bapaknya] dari [Abu Sa'id] dan dari [Qais bin Muslim] dari [Thariq bin Syihab] dari [Abu Sa'id Al Khudri] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa dari kalian melihat kemungkaran lalu ia mampu mengubahnya dengan tangan, hendaklah ia ubah kemungkaran tersebut dengan tangannya.\" Hannad kemudian memotong (tidak melanjutkan) sisa hadits tersebut. Kemudian [Ibnul 'Ala] melengkapinya, \"jika ia tidak mampu hendaklah dengan lisannya, jika tidak mampu dengan lisan hendaklah dengan hatinya, dan itu adalah selemah-lemah iman.\""
            },
            {
                "number": 3662,
                "arab": "حَدَّثَنَا أَبُو الرَّبِيعِ سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ عُتْبَةَ بْنِ أَبِي حَكِيمٍ قَالَ حَدَّثَنِي عَمْرُو بْنُ جَارِيَةَ اللَّخْمِيُّ حَدَّثَنِي أَبُو أُمَيَّةَ الشَّعْبَانِيُّ قَالَسَأَلْتُ أَبَا ثَعْلَبَةَ الْخُشَنِيَّ فَقُلْتُ يَا أَبَا ثَعْلَبَةَ كَيْفَ تَقُولُ فِي هَذِهِ الْآيَةِ{ عَلَيْكُمْ أَنْفُسَكُمْ }قَالَ أَمَا وَاللَّهِ لَقَدْ سَأَلْتَ عَنْهَا خَبِيرًا سَأَلْتُ عَنْهَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بَلْ ائْتَمِرُوا بِالْمَعْرُوفِ وَتَنَاهَوْا عَنْ الْمُنْكَرِ حَتَّى إِذَا رَأَيْتَ شُحًّا مُطَاعًا وَهَوًى مُتَّبَعًا وَدُنْيَا مُؤْثَرَةً وَإِعْجَابَ كُلِّ ذِي رَأْيٍ بِرَأْيِهِ فَعَلَيْكَ يَعْنِي بِنَفْسِكَ وَدَعْ عَنْكَ الْعَوَامَّ فَإِنَّ مِنْ وَرَائِكُمْ أَيَّامَ الصَّبْرِ الصَّبْرُ فِيهِ مِثْلُ قَبْضٍ عَلَى الْجَمْرِ لِلْعَامِلِ فِيهِمْ مِثْلُ أَجْرِ خَمْسِينَ رَجُلًا يَعْمَلُونَ مِثْلَ عَمَلِهِوَزَادَنِي غَيْرُهُ قَالَ يَا رَسُولَ اللَّهِ أَجْرُ خَمْسِينَ مِنْهُمْ قَالَ أَجْرُ خَمْسِينَ مِنْكُمْ",
                "id": "Telah menceritakan kepada kami [Abu Ar Rabi' Sulaiman bin Dawud Al 'Ataki] berkata, telah menceritakan kepada kami [Ibnul Mubarak] dari [Utbah bin Abu Hakim] ia berkata; telah menceritakan kepadaku [Amru bin Jariyah Al Lakhmi] berkata, telah menceritakan kepadaku [Abu Umayyah Asy Sya'bani] ia berkata, \"Aku pernah bertanya kepada [Abu Tsa'labah Al Khusyani], aku katakan kepadanya, \"Wahai Abu Tsa'labah, apa pendapatmu tentang ayat ini: '(.. jagalah dirimu..) -Al Maidah: 105-?\" Ia menjawab, \"Demi Allah, engkau telah menanyakan hal itu kepada orang yang tepat. Aku pernah menanyakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, beliau lalu menjawab: \"Bahkan perintahkanlah kepada perkara yang ma'ruf dan cegahlah dari perkara yang munkar, sehingga ketika engkau melihat sifat kikir ditaati, hawa nafsu diikuti, dunia lebih diutamakan (dari urusan agama), dan setiap orang bangga dengan pendapatnya sendiri, maka hendaklah engkau jaga dirimu sendiri, dan jauhilah orang-orang awam (bodoh). Sebab di belakang kalian ada hari-hari (yang kalian wajib) bersabar, sabar pada saat itu seperti seseorang yang memegang bara api, dan orang yang beramal pada saat itu pahalanya sebanding dengan lima puluh kali amalan orang yang beramal seperti amalnya, ia menambahkan untukku, \"seperti amalan selainnya.\" Abu Tsa'labah bertanya, \"Wahai Rasulullah, seperti pahala lima puluh orang dari mereka!\" beliau menjawab: \"(Bahkan) seperti pahala lima puluh orang dari kalian.\""
            },
            {
                "number": 3663,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ أَنَّ عَبْدَ الْعَزِيزِ بْنَ أَبِي حَازِمٍ حَدَّثَهُمْ عَنْ أَبِيهِ عَنْ عُمَارَةَ بْنِ عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَيْفَ بِكُمْ وَبِزَمَانٍ أَوْ يُوشِكُ أَنْ يَأْتِيَ زَمَانٌ يُغَرْبَلُ النَّاسُ فِيهِ غَرْبَلَةً تَبْقَى حُثَالَةٌ مِنْ النَّاسِ قَدْ مَرِجَتْ عُهُودُهُمْ وَأَمَانَاتُهُمْ وَاخْتَلَفُوا فَكَانُوا هَكَذَا وَشَبَّكَ بَيْنَ أَصَابِعِهِ فَقَالُوا وَكَيْفَ بِنَا يَا رَسُولَ اللَّهِ قَالَ تَأْخُذُونَ مَا تَعْرِفُونَ وَتَذَرُونَ مَا تُنْكِرُونَ وَتُقْبِلُونَ عَلَى أَمْرِ خَاصَّتِكُمْ وَتَذَرُونَ أَمْرَ عَامَّتِكُمْقَالَ أَبُو دَاوُد هَكَذَا رُوِيَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غَيْرِ وَجْهٍ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] bahwa [Abdul Aziz bin Abu Hazim] menceritakan kepada mereka, dari [Bapaknya] dari [Umarah bin Amru] dari [Abdullah bin Amru bin Al Ash] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagaimana kondisi kalian pada zaman, atau beliau mengatakan, \"Hampir-hampir akan datang kepada kalian suatu masa, orang-orang yang baik telah pergi dan tinggal orang-orang yang jelek. Janji-janji dan amanah mereka telah rusak, mereka berselisih, dan mereka menjadi seperti ini -beliau menganyam antara jemarinya-\". Para sahabat bertanya, \"Wahai Rasulullah, lalu bagaimana dengan kami; apa yang engkau perintahkan?\" beliau menjawab: \"Ambillah apa yang kalian ketahui (dari kebenarannya) dan jauhi apa yang kalian ingkari, terimalah apa yang menjadi hak kalian dan tinggalkan apa yang menjadi hak khalayak umum.\" Abu Dawud berkata, \"Demikianlah hadits ini diriwayatkan oleh Abdullah bin Amru dari Nabi shallallahu 'alaihi wasallam dengan banyaknya jalur periwayatan.\""
            },
            {
                "number": 3664,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ هِلَالِ بْنِ خَبَّابٍ أَبِي الْعَلَاءِ قَالَ حَدَّثَنِي عِكْرِمَةُ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ قَالَبَيْنَمَا نَحْنُ حَوْلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ ذَكَرَ الْفِتْنَةَ فَقَالَ إِذَا رَأَيْتُمْ النَّاسَ قَدْ مَرِجَتْ عُهُودُهُمْ وَخَفَّتْ أَمَانَاتُهُمْ وَكَانُوا هَكَذَا وَشَبَّكَ بَيْنَ أَصَابِعِهِ قَالَ فَقُمْتُ إِلَيْهِ فَقُلْتُ كَيْفَ أَفْعَلُ عِنْدَ ذَلِكَ جَعَلَنِي اللَّهُ فِدَاكَ قَالَ الْزَمْ بَيْتَكَ وَامْلِكْ عَلَيْكَ لِسَانَكَ وَخُذْ بِمَا تَعْرِفُ وَدَعْ مَا تُنْكِرُ وَعَلَيْكَ بِأَمْرِ خَاصَّةِ نَفْسِكَ وَدَعْ عَنْكَ أَمْرَ الْعَامَّةِ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] berkata, telah menceritakan kepada kami [Al Fadhl bin Dukain] berkata, telah menceritakan kepada kami [Yunus bin Abu Ishaq] dari [Hilal bin Khabbab Abul 'Ala] ia berkata; telah menceritakan kepadaku [Ikrimah] berkata, telah menceritakan kepadaku [Abdullah bin Amru bin Al Ash] ia berkata, \"Saat kami berada di sisi Rasulullah shallallahu 'alaihi wasallam, beliau menyebutkan tentang fitnah. Beliau bersabda: \"Jika kalian melihat manusia telah rusak janji-janji mereka dan telah luntur amanah mereka, sementara mereka begini -beliau menganyam antara jemarinya-, \" Abdullah berkata, \"Aku lantas bangkit ke arah beliau seraya bertanya, \"(Semoga Allah menjadikan aku sebagai tebusanmu) apa yang harus aku lakukan pada saat itu?\" beliau menjawab: \"Tetaplah engkau berdiam di dalam rumahmu, kuasailah lisanmu, ambilah (lakukan) apa saja yang kamu ketahui dan tinggalkan apa saja yang kamu pungkiri (tidak ketahui), urusilah perkaramu sendiri dan jauhilah urusan orang banyak, \""
            },
            {
                "number": 3665,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَادَةَ الْوَاسِطِيُّ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ هَارُونَ أَخْبَرَنَا إِسْرَائِيلُ حَدَّثَنَا مُحَمَّدُ بْنُ جُحَادَةَ عَنْ عَطِيَّةَ الْعَوْفِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْضَلُ الْجِهَادِ كَلِمَةُ عَدْلٍ عِنْدَ سُلْطَانٍ جَائِرٍ أَوْ أَمِيرٍ جَائِرٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubadah Al Wasithi] berkata, telah menceritakan kepada kami [Yazid] -makasudnya Yazid bin Harun- berkata, telah mengabarkan kepada kami [Isra'il] berkata, telah menceritakan kepada kami [Muhammad bin Juhadah] dari [Athiyah Al 'Aufi] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jihad yang paling utama adalah menyampaikan kebenaran kepada penguasa yang dhalim, atau pemimpin yang dhalim.\""
            },
            {
                "number": 3666,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَخْبَرَنَا أَبُو بَكْرٍ حَدَّثَنَا مُغِيرَةُ بْنُ زِيَادٍ الْمُوصِلِيُّ عَنْ عَدِيِّ بْنِ عَدِيٍّ عَنْ الْعُرْسِ ابْنِ عَمِيرَةَ الْكِنْدِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا عُمِلَتْ الْخَطِيئَةُ فِي الْأَرْضِ كَانَ مَنْ شَهِدَهَا فَكَرِهَهَا وَقَالَ مَرَّةً أَنْكَرَهَا كَانَ كَمَنْ غَابَ عَنْهَا وَمَنْ غَابَ عَنْهَا فَرَضِيَهَا كَانَ كَمَنْ شَهِدَهَاحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا أَبُو شِهَابٍ عَنْ مُغِيرَةَ ابْنِ زِيَادٍ عَنْ عَدِيِّ بْنِ عَدِيٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ قَالَ مَنْ شَهِدَهَا فَكَرِهَهَا كَانَ كَمَنْ غَابَ عَنْهَا",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul 'Ala] berkata, telah mengabarkan kepada kami [Abu Bakr] berkata, telah menceritakan kepada kami [Mughirah bin Ziyad Al Mushili] dari [Adi bin Adi] dari [Al 'urs bin Amirah Al Kindi] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika ada satu kemaksiatan dikerjakan dimuka bumi, maka orang yang melihat lalu membencinya, dalam riwayat lain, \"lalu ia mengingkarinya, ia seperti orang yang tidak melihatnya. Sedangkan bagi orang yang tidak melihatnya, namun ia ridha dengan kemaksiatan tersebut, maka ia seperti orang yang melihatnya.\" Telah menceritakan kepada kami [Ahmad bin Yunus] berkata, telah menceritakan kepada kami [Abu Syihab] dari [Al Mughirah bin Ziyad] dari [Adi bin Adi] dari Nabi shallallahu 'alaihi wasallam sebagaimana dalam hadits tersebut. Beliau bersabda: \"Barangsiapa melihat lalu mengingkarinya, maka ia seperti orang yang tidak melihatnya.\""
            },
            {
                "number": 3667,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَحَفْصُ بْنُ عُمَرَ قَالَا حَدَّثَنَا شُعْبَةُ وَهَذَا لَفْظُهُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي الْبَخْتَرِيِّ قَالَ أَخْبَرَنِي مَنْ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ و قَالَ سُلَيْمَانُ حَدَّثَنِي رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَنْ يَهْلَكَ النَّاسُ حَتَّى يَعْذِرُوا أَوْ يُعْذِرُوا مِنْ أَنْفُسِهِمْ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] dan [Hafsh bin Umar] keduanya berkata; telah menceritakan kepada kami [Syu'bah] -dan ini adalah lafadz darinya- dari [Amru bin Murrah] dari [Abu Al Bakhtari] ia berkata, \"Telah mengabarkan kepadaku [orang] yang telah mendengarnya dari Nabi shallallahu 'alaihi wasallam, beliau bersabda, sementara Sulaiman menyebutkan, \"Telah menceritakan kepadaku seorang laki-laki sahabat Nabi shallallahu 'alaihi wasallam, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sekali-kali manusia tidak akan binasa hingga mereka banyak melakukan kesalahan, atau beliau mengatakan, \"hingga mereka mencari dalih dari kesalahan mereka.\""
            },
            {
                "number": 3668,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ وَأَبُو بَكْرِ بْنُ سُلَيْمَانَ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ صَلَاةَ الْعِشَاءِ فِي آخِرِ حَيَاتِهِ فَلَمَّا سَلَّمَ قَامَ فَقَالَ أَرَأَيْتُكُمْ لَيْلَتَكُمْ هَذِهِ فَإِنَّ عَلَى رَأْسِ مِائَةِ سَنَةٍ مِنْهَا لَا يَبْقَى مِمَّنْ هُوَ عَلَى ظَهْرِ الْأَرْضِ أَحَدٌ قَالَ ابْنُ عُمَرَ فَوَهِلَ النَّاسُ فِي مَقَالَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تِلْكَ فِيمَا يَتَحَدَّثُونَ عَنْ هَذِهِ الْأَحَادِيثِ عَنْ مِائَةِ سَنَةٍ وَإِنَّمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَبْقَى مِمَّنْ هُوَ الْيَوْمَ عَلَى ظَهْرِ الْأَرْضِ يُرِيدُ بِأَنْ يَنْخَرِمَ ذَلِكَ الْقَرْنُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] ia berkata; telah mengabarkan kepadaku [Salim bin Abdullah] dan [Abu Bakr bin Sulaiman] bahwa [Abdullah bin Umar] berkata; Pada sutau malam Rasulullah shallallahu 'alaihi wasallam pernah melaksanakan sholat isya bersama kami di masa-masa akhir hidup beliau. Setelah salam beliau kemudian berdiri dan bersabda: \"Aku perhatikan malam kalian ini, sungguh dalam seratus tahun (kedepan), tidak seorang pun yang ada di muka bumi ini (dari malam tersebut) yang masih tersisa (hidup).\" Ibnu Umar berkata, \"Mendengar ucapan Rasulullah shallallahu 'alaihi wasallam, orang-orang mereka-reka berkenaan dengan makna 'seratus tahun' dari ucapan beliau tersebut. Padahal sebenarnya, Rasulullah shallallahu 'alaihi wasallam mengatakan: \"Orang-orang yang hidup hari ini, maka seratus tahun ke depan tidak akan ada lagi yang masih hidup di muka bumi.\" Maksudnya, beliau menegaskan bahwa masa itu akan terjadi.\""
            },
            {
                "number": 3669,
                "arab": "حَدَّثَنَا مُوسَى بْنُ سَهْلٍ حَدَّثَنَا حَجَّاجُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي مُعَاوِيَةُ بْنُ صَالِحٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَنْ يُعْجِزَ اللَّهُ هَذِهِ الْأُمَّةَ مِنْ نِصْفِ يَوْمٍ",
                "id": "Telah menceritakan kepada kami [Musa bin Sahl] berkata, telah menceritakan kepada kami [Hajjaj bin Ibrahim] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah menceritakan kepadaku [Mu'awiyah bin Shalih] dari ['Abdurrahman bin Jubair] dari [Bapaknya] dari [Abu Tsa'labah Al Khusyani] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekali-kali Allah tidak akan melemahkan umat ini dari waktu setengah hari (pada hari kiamat).\""
            },
            {
                "number": 3670,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنِي صَفْوَانُ عَنْ شُرَيْحِ بْنِ عُبَيْدٍ عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنِّي لَأَرْجُو أَنْ لَا تَعْجِزَ أُمَّتِي عِنْدَ رَبِّهَا أَنْ يُؤَخِّرَهُمْ نِصْفَ يَوْمٍقِيلَ لِسَعْدٍ وَكَمْ نِصْفُ ذَلِكَ الْيَوْمِ قَالَ خَمْسُ مِائَةِ سَنَةٍ",
                "id": "Telah menceritakan kepada kami [Amru bin Utsman] berkata, telah menceritakan kepada kami [Abu Al Mughirah] berkata, telah menceritakan kepadaku [Shafwan] dari [Syuraih bin Ubaid] dari [Sa'd bin Abu Waqash] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Aku sangat berharap bahwa umatku tidak akan merasa lemah di sisi Rabbnya, ketika Dia mengakhirkan bagi mereka setengah hari.\" Sa'd lalu ditanya, \"Setengah hari pada waktu itu berapa lama?\" Ia menjawab, \"Lima ratus tahun.\""
            },
            {
                "number": 3671,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَيُّوبُ عَنْ عِكْرِمَةَأَنَّ عَلِيًّا عَلَيْهِ السَّلَام أَحْرَقَ نَاسًا ارْتَدُّوا عَنْ الْإِسْلَامِ فَبَلَغَ ذَلِكَ ابْنَ عَبَّاسٍ فَقَالَ لَمْ أَكُنْ لِأُحْرِقَهُمْ بِالنَّارِ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُعَذِّبُوا بِعَذَابِ اللَّهِ وَكُنْتُ قَاتِلَهُمْ بِقَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ بَدَّلَ دِينَهُ فَاقْتُلُوهُ فَبَلَغَ ذَلِكَ عَلِيًّا عَلَيْهِ السَّلَام فَقَالَ وَيْحَ ابْنِ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Hanbal] berkata, telah menceritakan kepada kami [Isma'il bin Ibrahim] berkata, telah mengabarkan kepada kami [Ayyub] dari [Ikrimah] bahwa Ali Alaihis salam pernah membakar orang-orang yang murtad dari Islam. Lalu sampailah berita itu kepada [Ibnu Abbas] hingga ia berkata, \"Sungguh, aku tidak akan pernah membakar mereka dengan api. Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menyiksa dengan siksaan Allah.\" dan aku memerangi mereka berdasarkan sabda Rasulullah shallallahu 'alaihi wasallam. Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengganti agamanya, maka bunuhlah ia.\" Hal itu akhirnya juga sampai kepada Ali Alaihis salam, hingga ia berkata, \"Ibnu Abbas benar.\""
            },
            {
                "number": 3672,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ مَسْرُوقٍ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ دَمُ رَجُلٍ مُسْلِمٍ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ إِلَّا بِإِحْدَى ثَلَاثٍ الثَّيِّبُ الزَّانِي وَالنَّفْسُ بِالنَّفْسِ وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ",
                "id": "Telah menceritakan kepada kami [Amru bin Aun] berkata, telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abdullah bin Murrah] dari [Masruq] dari [Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal darah seorang muslim yang bersaksi bahwa tidak ada Ilah yang berhak disembah selain Allah dan aku adalah utusan Allah kecuali dengan salah satu dari tiga sebab; orang tua yang berzina, membunuh jiwa (qisas) dan keluar dari Islam (murtad) yang memisahkan diri dari jama'ah (jama'ah muslimin).\""
            },
            {
                "number": 3673,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ الْبَاهِلِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ إِلَّا بِإِحْدَى ثَلَاثٍ رَجُلٌ زَنَى بَعْدَ إِحْصَانٍ فَإِنَّهُ يُرْجَمُ وَرَجُلٌ خَرَجَ مُحَارِبًا لِلَّهِ وَرَسُولِهِ فَإِنَّهُ يُقْتَلُ أَوْ يُصْلَبُ أَوْ يُنْفَى مِنْ الْأَرْضِ أَوْ يَقْتُلُ نَفْسًا فَيُقْتَلُ بِهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sinan Al bahili] berkata, telah menceritakan kepada kami [Ibrahim bin Thahman] dari [Abdul Aziz bin Rufai'] dari [Ubaid bin Umair] dari ['Aisyah radliallahu 'anha] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal darah seorang muslim yang bersaksi bahwa tidak ada Ilah -yang berhak disembah- selain Allah dan Muhammad adalah utusan Allah kecuali dengan salah satu dari tiga sebab; orang yang berzina setelah menikah, maka ia harus dirajam; seorang laki-laki yang keluar untuk memerangi Allah dan Rasul-Nya, maka ia harus dibunuh, disalib atau dibuang dari negri terebut. Serta seseorang yang membunuh orang lain maka harus dihukum mati karena membunuh.\""
            },
            {
                "number": 3674,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَمُسَدَّدٌ قَالَا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ مُسَدَّدٌ حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ حَدَّثَنَا أَبُو بُرْدَةَ قَالَ قَالَ أَبُو مُوسَىأَقْبَلْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعِي رَجُلَانِ مِنْ الْأَشْعَرِيِّينَ أَحَدُهُمَا عَنْ يَمِينِي وَالْآخَرُ عَنْ يَسَارِي فَكِلَاهُمَا سَأَلَ الْعَمَلَ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَاكِتٌ فَقَالَ مَا تَقُولُ يَا أَبَا مُوسَى أَوْ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ قُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أَطْلَعَانِي عَلَى مَا فِي أَنْفُسِهِمَا وَمَا شَعَرْتُ أَنَّهُمَا يَطْلُبَانِ الْعَمَلَ وَكَأَنِّي أَنْظُرُ إِلَى سِوَاكِهِ تَحْتَ شَفَتِهِ قَلَصَتْ قَالَ لَنْ نَسْتَعْمِلَ أَوْ لَا نَسْتَعْمِلُ عَلَى عَمَلِنَا مَنْ أَرَادَهُ وَلَكِنْ اذْهَبْ أَنْتَ يَا أَبَا مُوسَى أَوْ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ فَبَعَثَهُ عَلَى الْيَمَنِ ثُمَّ أَتْبَعَهُ مُعَاذَ بْنَ جَبَلٍ قَالَ فَلَمَّا قَدِمَ عَلَيْهِ مُعَاذٌ قَالَ انْزِلْ وَأَلْقَى لَهُ وِسَادَةً وَإِذَا رَجُلٌ عِنْدَهُ مُوثَقٌ قَالَ مَا هَذَا قَالَ هَذَا كَانَ يَهُودِيًّا فَأَسْلَمَ ثُمَّ رَاجَعَ دِينَهُ دِينَ السُّوءِ قَالَ لَا أَجْلِسُ حَتَّى يُقْتَلَ قَضَاءُ اللَّهِ وَرَسُولِهِ قَالَ اجْلِسْ نَعَمْ قَالَ لَا أَجْلِسُ حَتَّى يُقْتَلَ قَضَاءُ اللَّهِ وَرَسُولِهِ ثَلَاثَ مَرَّاتٍ فَأَمَرَ بِهِ فَقُتِلَ ثُمَّ تَذَاكَرَا قِيَامَ اللَّيْلِ فَقَالَ أَحَدُهُمَا مُعَاذُ بْنُ جَبَلٍ أَمَّا أَنَا فَأَنَامُ وَأَقُومُ أَوْ أَقُومُ وَأَنَامُ وَأَرْجُو فِي نَوْمَتِي مَا أَرْجُو فِي قَوْمَتِي",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Musaddad] keduanya berkata; telah menceritakan kepada kami [Yahya bin Sa'id] berkata; [Musaddad] berkata; telah menceritakan kepada kami [Qurrah bin Khalid] berkata, telah menceritakan kepada kami [Humaid bin Hilal] berkata, telah menceritakan kepada kami [Abu Burdah] ia berkata; [Abu Musa] berkata, \"Aku menemui Nabi shallallahu 'alaihi wasallam bersama dua orang laki-laki dari Al Asy'ari; seorang dari keduanya ada di sebelah kananku dan seorang lagi di sebelah kiri. Keduanya minta dicarikan pekerjaan, sementara Nabi shallallahu 'alaihi wasallam hanya terdiam. Kemudian beliau bersabda: \"Wahai Abu Musa, apa pendapatmu? Atau beliau mengatakan, \"Wahai Abdullah bin Qais?\" Aku (Abu Musa) berkata, \"Demi Dzat yang mengutusmu dengan kebenaran, aku tidak tahu apa yang mereka inginkan, aku juga tidak tahu bahwa keduanya juga minta pekerjaan. Seakan aku melihat siwak yang berada di bawah bibir beliau telah menyusut. Beliau lalu bersabda: \"Sekali-kali kami tidak akan memperkerjakan, atau beliau mengatakan, \"tidak akan memperkerjakan orang yang menghendakinya untuk melakukan pekerjaan kami. Wahai Abu Musa, pergilah engkau, atau beliau mengatakan, \"Wahai Abu Abdullah bin Qais.\" Rasulullah kemudian mengutus Abu Musa ke Yaman yang kemudian disusul Mu'adz bin Jabal. Ketika Mu'adz datang, Abu Musa berkata, \"Turunlah kemari.\" Kemudian Abu Musa mengambilkan bantal untuk Mu'adz. Namun tiba-tiba di sisinya (Mu'adz) ada seorang laki-laki yang terikat, Mu'adz bertanya, \"Siapa ini?\" Abu Musa menjawab, \"Ini adalah seorang laki-laki yahudi, ia pernah masuk Islam, namun ia kembali lagi kepada agamanya yang jelek.\" Mu'adz lalu berkata, \"Aku tidak akan duduk hingga ia dibunuh, sebagai bentuk dari ketetapan Allah dan Rasul-Nya.\" Hal itu ia ucapkan hingga tiga kali. Abu Musa berkata, \"Baiklah, sekarang duduklah.\" Mu'adz berkata, \"Aku tidak akan duduk hingga ia dibunuh, sebagai bentuk dari ketetapan Allah dan Rasul-Nya.\" Hal itu ia ucapkan hingga tiga kali. Abu Musa kemudian memerintahkan hukuman tersebut, dan laki-laki itu pun dihumum mati. Setelah itu mereka menyebut-nyebut tentang sholat malam, salah seorang dari keduanya (Mu'adz bin Jabal) lalu berkata, \"Aku tidur dan bangun, atau ia mengatakan, \"bangun dan tidur. Dan aku berharap disaat tidurku mendapatkan (pahala) sebagaimana saat aku terjaga.\""
            },
            {
                "number": 3675,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا الْحِمَّانِيُّ يَعْنِى عَبْدَ الْحَمِيدِ ابْنَ عَبْدِ الرَّحْمَنِ عَنْ طَلْحَةَ بْنِ يَحْيَى وَبُرَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَقَدِمَ عَلَيَّ مُعَاذٌ وَأَنَا بِالْيَمَنِ وَرَجُلٌ كَانَ يَهُودِيًّا فَأَسْلَمَ فَارْتَدَّ عَنْ الْإِسْلَامِ فَلَمَّا قَدِمَ مُعَاذٌ قَالَ لَا أَنْزِلُ عَنْ دَابَّتِي حَتَّى يُقْتَلَ فَقُتِلَ قَالَ أَحَدُهُمَا وَكَانَ قَدْ اسْتُتِيبَ قَبْلَ ذَلِكَحَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا حَفْصٌ حَدَّثَنَا الشَّيْبَانِيُّ عَنْ أَبِي بُرْدَةَ بِهَذِهِ الْقِصَّةِ قَالَ فَأُتِيَ أَبُو مُوسَى بِرَجُلٍ قَدْ ارْتَدَّ عَنْ الْإِسْلَامِ فَدَعَاهُ عِشْرِينَ لَيْلَةً أَوْ قَرِيبًا مِنْهَا فَجَاءَ مُعَاذٌ فَدَعَاهُ فَأَبَى فَضَرَبَ عُنُقَهُ قَالَ أَبُو دَاوُد وَرَوَاهُ عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ عَنْ أَبِي بُرْدَةَ لَمْ يَذْكُرْ الِاسْتِتَابَةَ وَرَوَاهُ ابْنُ فُضَيْلٍ عَنْ الشَّيْبَانِيِّ عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنْ أَبِي مُوسَى لَمْ يَذْكُرْ فِيهِ الِاسْتِتَابَةَ حَدَّثَنَا ابْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْمَسْعُودِيُّ عَنْ الْقَاسِمِ بِهَذِهِ الْقِصَّةِ قَالَ فَلَمْ يَنْزِلْ حَتَّى ضُرِبَ عُنُقُهُ وَمَا اسْتَتَابَهُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Al Himmani] -maksudnya Abdul Hamid bin 'Abdurrahman Al Himmani- dari [Thalhah bin Yahya] dan [Buraid bin Abdullah bin Abu Burdah] dari [Abu Burdah] dari [Abu Musa] ia berkata, \"Muadz pernah datang kepadaku saat aku berada di Yaman dan ada seorang yahudi yang telah masuk Islam kemudian murtad. Saat Mu'adz tiba, ia berkata, \"Aku tidak akan turun dari tungganganku ini hingga ia (yahudi itu) dibunuh.\" Yahudi itu akhirnya dibunuh. Salah seorang dari keduanya (Abu Musa dan Mu'adz) berkata, \"Yahudi itu telah diminta untuk bertaubat sebelum diekskusi mati.\" Telah menceritakan kepada kami [Muhammad Ibnul 'Ala] berkata, telah menceritakan kepada kami [Hafsh] berkata, telah menceritakan kepada kami [Asy Syaibani] dari [Abu Burdah] dengan kisah cerita yang sama. Ia (Abu Burdah) berkata, \"Didatangkan kepada [Abu Musa] seorang laki-laki yang telah murtad dari Islam. Lalu ia menyerunya (untuk bertaubat) selama dua puluh hari, atau kurang dari itu. Kemudian Mu'adz tiba dan menyerunya (untuk taubat), namun laki-laki itu enggan, hingga akhirnya Mu'adz memenggal lehernya.\" Abu Dawud berkata, \"Hadits ini diriwayatkan oleh [Abdul Malik bin Umair] dari [Abu Burdah], namun ia tidak menyebutkan kata 'permintaan untuk bertubat'. [Ibnu Fudhail] juga meriwayatkan dari [Asy Syaibani] dari [Sa'id bin Abu Burdah], dari [bapaknya], dari [Abu Musa], dan ia juga tidak menyebutkan kata 'permintaan untuk taubat' dalam haditsnya. Telah menceritakan kepada kami [Ibnu Mu'adz] berkata, telah menceritakan kepada kami [bapakku] berkata, telah menceritakan kepada kami [Al Mas'udi] dari [Al Qasim] dengan kisah ini, ia berkata, \"Mu'adz belum juga turun dari kendaraannya hingga laki-laki (murtad) itu dipenggal lehernya tanpa memintanya untuk bertaubat dahulu.\""
            }
        ]
    }
}