{
    "status": true,
    "data": {
        "start": 736,
        "end": 882,
        "total": 147,
        "book": "abu-daud",
        "hadits": [
            {
                "number": 736,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ مُسْلِمٍ الْبَطِينِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَرَأَ{ سَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى }قَالَ سُبْحَانَ رَبِّيَ الْأَعْلَىقَالَ أَبُو دَاوُد خُولِفَ وَكِيعٌ فِي هَذَا الْحَدِيثِ وَرَوَاهُ أَبُو وَكِيعٍ وَشُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ مَوْقُوفًا",
                "id": "Telah menceritakan kepada kami [Zuhair bin harb] telah menceritakan kepada kami [Waki'] dari [Isra'il] dari [Abu Ishaq] dari [Muslim Al Bathin] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa apabila Nabi shallallahu 'alaihi wasallam membaca; \"Sabbihisma rabbikal a'la.\" Maka beliau mengucapkan; \"Subhaana rabbiyal a'la (Maha suci Rabbku yang Maha tinggi.\" Abu Daud mengatakan; riwayat Waki' di perselisihkan dalam hadits ini, hadits ini juga di riwayatkan oleh [Abu Waki'] dan [Syu'bah] dari [Abu Ishaq] dari [Sa'id bin Jubair] dari [Ibnu Abbas] secara mauquf. "
            },
            {
                "number": 737,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ قَالَكَانَ رَجُلٌ يُصَلِّي فَوْقَ بَيْتِهِ وَكَانَ إِذَا قَرَأَ{ أَلَيْسَ ذَلِكَ بِقَادِرٍ عَلَى أَنْ يُحْيِيَ الْمَوْتَى }قَالَ سُبْحَانَكَ فَبَكَى فَسَأَلُوهُ عَنْ ذَلِكَ فَقَالَ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ أَبُو دَاوُد قَالَ أَحْمَدُ يُعْجِبُنِي فِي الْفَرِيضَةِ أَنْ يَدْعُوَ بِمَا فِي الْقُرْآنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Musa bin Abu Aisyah] dia berkata; \" [Seseorang] sholat diatas rumahnya, apabila ia selesai membaca ayat \"alaisa dzaalika bi qaadirin 'ala an yuhyiyal mauta\" (Bukankah Dzat yang demikian itu lebih mampu untuk menghidupkan yang mati)?\" maka dia mengucapkan \"subhanaka\" lalu menangis. Mereka bertanya kepada laki-laki tersebut tentang perbuatannya itu, dia menjawab bahwa dirinya pernah mendengarnya dari Rasulullah shallallahu 'alaihi wasallam.\" Abu Daud berkata: Ahmad berkata: \"Aku lebih suka dalam sholat wajib membaca do'a-do'a yang ada dalam al-qur'an.\""
            },
            {
                "number": 738,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سَعِيدٌ الْجُرَيْرِيُّ عَنْ السَّعْدِيِّ عَنْ أَبِيهِ أَوْ عَنْ عَمِّهِ قَالَرَمَقْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاتِهِ فَكَانَ يَتَمَكَّنُ فِي رُكُوعِهِ وَسُجُودِهِ قَدْرَ مَا يَقُولُ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ثَلَاثًا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Khalid bin Abdullah] telah menceritakan kepada kami [Sa'id Al Jurairi] dari [As Sa'di] dari [ayahnya] atau dari [pamannya] dia berkata; \"Aku memperhatikan Nabi shallallahu 'alaihi wasallam pada waktu sholat, maka beliau tenang dalam ruku' dan sujudnya sebatas membaca; 'Subhanallah wa bihamdihi (Maha suci Allah dengan segala puji-pujian-Nya).\" sebanyak tiga kali. "
            },
            {
                "number": 739,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ مَرْوَانَ الْأَهْوَازِيُّ حَدَّثَنَا أَبُو عَامِرٍ وَأَبُو دَاوُدَ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ إِسْحَقَ بْنِ يَزِيدَ الْهُذَلِيِّ عَنْ عَوْنِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَكَعَ أَحَدُكُمْ فَلْيَقُلْ ثَلَاثَ مَرَّاتٍ سُبْحَانَ رَبِّيَ الْعَظِيمِ وَذَلِكَ أَدْنَاهُ وَإِذَا سَجَدَ فَلْيَقُلْ سُبْحَانَ رَبِّيَ الْأَعْلَى ثَلَاثًا وَذَلِكَ أَدْنَاهُقَالَ أَبُو دَاوُد هَذَا مُرْسَلٌ عَوْنٌ لَمْ يُدْرِكْ عَبْدَ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin Marwan Al Ahwazi] telah menceritakan kepada kami [Abu 'Amir] dan [Abu Daud] dari [Ibnu Abu Dzi`b] dari [Ishaq bin Yazid Al Hudzali] dari ['Aun bin Abdullah] dari [Abdullah bin Mas'ud] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian ruku' maka ucapkanlah \"Subhaana Rabbiyal 'adziim\" sebanyak tiga kali. Apabila sujud, maka ucapkanlah \"subhaana Rabbiyal a'la\" sebanyak tiga kali.\" Abu Daud berkata: \"Ini adalah hadits mursal, sebab 'Aun tidak pernah bertemu dengan Abdullah. "
            },
            {
                "number": 740,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ حَدَّثَنَا سُفْيَانُ حَدَّثَنِي إِسْمَعِيلُ بْنُ أُمَيَّةَ سَمِعْتُ أَعْرَابِيًّا يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَرَأَ مِنْكُمْ{ وَالتِّينِ وَالزَّيْتُونِ }فَانْتَهَى إِلَى آخِرِهَا{ أَلَيْسَ اللَّهُ بِأَحْكَمِ الْحَاكِمِينَ }فَلْيَقُلْ بَلَى وَأَنَا عَلَى ذَلِكَ مِنْ الشَّاهِدِينَ وَمَنْ قَرَأَ{ لَا أُقْسِمُ بِيَوْمِ الْقِيَامَةِ }فَانْتَهَى إِلَى{ أَلَيْسَ ذَلِكَ بِقَادِرٍ عَلَى أَنْ يُحْيِيَ الْمَوْتَى }فَلْيَقُلْ بَلَى وَمَنْ قَرَأَ{ وَالْمُرْسَلَاتِ }فَبَلَغَ{ فَبِأَيِّ حَدِيثٍ بَعْدَهُ يُؤْمِنُونَ }فَلْيَقُلْ آمَنَّا بِاللَّهِقَالَ إِسْمَعِيلُ ذَهَبْتُ أُعِيدُ عَلَى الرَّجُلِ الْأَعْرَابِيِّ وَأَنْظُرُ لَعَلَّهُ فَقَالَ يَا ابْنَ أَخِي أَتَظُنُّ أَنِّي لَمْ أَحْفَظْهُ لَقَدْ حَجَجْتُ سِتِّينَ حَجَّةً مَا مِنْهَا حَجَّةٌ إِلَّا وَأَنَا أَعْرِفُ الْبَعِيرَ الَّذِي حَجَجْتُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad Az Zuhri] telah menceritakan kepada kami [Sufyan] telah menceritakan kepadaku [Isma'il bin Umayyah] saya mendengar [seorang arab badui] berkata; saya mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa di antara kalian membaca; \"WAT TIIN WAZ ZAITUN (Demi (buah) Tin dan (buah) Zaitun), \" sampai akhir ayat \"ALAISALLAHU BI AHKAMIL HAAKIMIIN (Bukankah Allah hakim yang seadil-adilnya?) \" hendaknya ia mengucapkan; \"Benar, dan kami menjadi saksi untuk itu.\" Dan barangsiapa membaca; \"LAA UQSIMU BIYAUMIL QIYAAMAH (Aku bersumpah demi hari kiamat), hingga akhir ayat \"ALAISA DZAALIKA BI QAADIRIN `ALAA AIYYUHYIYAL MAUTA (Bukankah (Allah yang berbuat) demikian berkuasa (pula) menghidupkan orang mati?), maka hendaklah ia mengatakan; benar.\" Dan barangsiapa membaca; WAL MURSALAATI `URFA (Demi malaikat-malaikat yang diutus untuk membawa kebaikan) sampai dengan; FA BIAIYYI HADITSIN BA`DAHU YU`MINUN (Maka kepada perkataan apakah sesudah Al Quraan ini mereka akan beriman?), maka hendaknya ia mengatakan; aku beriman kepada Allah.\" Isma'il berkata: aku pergi untuk melihat apakah dia menjaganya, Dan dia adalah seorang badui, dia berkata; \"wahai saudaraku, apakah kamu mengira bahwa aku tidak menjaganya, sungguh aku telah berhaji sebanyak enam puluh kali, tidaklah ada pada satu tahun pun kecuali aku mengetahui unta yang dulu aku pakai untuk berhaji.\""
            },
            {
                "number": 741,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ وَابْنُ رَافِعٍ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِبْرَاهِيمَ بْنِ عُمَرَ بْنِ كَيْسَانَ حَدَّثَنِي أَبِي عَنْ وَهْبِ بْنِ مَانُوسَ قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ يَقُولُ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُمَا صَلَّيْتُ وَرَاءَ أَحَدٍ بَعْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشْبَهَ صَلَاةً بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ هَذَا الْفَتَى يَعْنِي عُمَرَ بْنَ عَبْدِ الْعَزِيزِ قَالَ فَحَزَرْنَا فِي رُكُوعِهِ عَشْرَ تَسْبِيحَاتٍ وَفِي سُجُودِهِ عَشْرَ تَسْبِيحَاتٍقَالَ أَبُو دَاوُد قَالَ أَحْمَدُ بْنُ صَالِحٍ قُلْتُ لَهُ مَانُوسُ أَوْ مَابُوسُ قَالَ أَمَّا عَبْدُ الرَّزَّاقِ فَيَقُولُ مَابُوسُ وَأَمَّا حِفْظِي فَمَانُوسُ وَهَذَا لَفْظُ ابْنِ رَافِعٍ قَالَ أَحْمَدُ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ أَنَسِ بْنِ مَالِكٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] dan [Ibnu Rafi'] keduanya berkata; telah menceritakan kepada kami [Abdullah bin Ibrahim bin Umar bin Kaisan] telah menceritakan kepadaku [ayahku] dari [Wahb bin Manus] dia berkata; saya mendengar [Sa'id bin Jubair] berkata; saya mendengar [Anas bin Malik] berkata; saya tidak pernah sholat di belakang seorang pun setelah Rasulullah shallallahu 'alaihi wasallam yang sholatnya menyerupai sholat Rasulullah shallallahu 'alaihi wasallam selain pemuda ini -yaitu Umar bin Abdul Aziz- Anas mengatakan; 'Kami memperkirakan dalam ruku'nya beliau mengucapkan sepuluh kali tasbih.\" Abu Daud mengatakan; Ahmad bin Shalih mengatakan; kataku kepada Manus atau Mabus -perawi berkata; Abdurrazaq mengatakan \"Mabus\" sedangkan yang ku hafal adalah Manus, ini adalah lafadznya Ibnu Rafi'. Ahmad mengatakan; dari Sa'id bin Jubair dari Anas bin Malik.\""
            },
            {
                "number": 742,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَسُلَيْمَانُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ قَالَ حَمَّادٌ أُمِرَ نَبِيُّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْجُدَ عَلَى سَبْعَةٍ وَلَا يَكُفَّ شَعْرًا وَلَا ثَوْبًا",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Sulaiman bin Harb] keduanya berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari ['Amru bin Dinar] dari [Thawus] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"aku di perintah\" sedangkan Hammad mengatakan; Nabi kalian shallallahu 'alaihi wasallam di perintah supaya melakukan sujud atas tujuh anggota badan, dan supaya seseorang tidak menahan rambut dan kainnya ketika sujud.\""
            },
            {
                "number": 743,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ وَرُبَّمَا قَالَ أُمِرَ نَبِيُّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَسْجُدَ عَلَى سَبْعَةِ آرَابٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Syu'bah] dari ['Amru bin Dinar] dari [Thawus] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Aku di perintah\" atau sepertinya bersabda: \"Nabi kalian shallallahu 'alaihi wasallam telah di perintahkan supaya melakukan sujud atas tujuh macam anggota badan.\""
            },
            {
                "number": 744,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا بَكْرٌ يَعْنِي ابْنَ مُضَرَ عَنْ ابْنِ الْهَادِي عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا سَجَدَ الْعَبْدُ سَجَدَ مَعَهُ سَبْعَةُ آرَابٍ وَجْهُهُ وَكَفَّاهُ وَرُكْبَتَاهُ وَقَدَمَاهُ",
                "id": "telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Bakr yaitu Ibnu Mudlar] dari [Ibnu Al Hadi] dari [Muhammad bin Ibrahim] dari ['Amir bin Sa'd] dari [Abbas bin Abdul Mutthalib] bahwa dia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila seorang hamba melakukan sujud, hendaknya ia sujud bersama tujuh anggota badannya, yaitu; keningnya (wajahnya), kedua telapak tangannya, kedua lututnya dan kedua kakinya.\""
            },
            {
                "number": 745,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ إِبْرَاهِيمَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَرَفَعَهُ قَالَ إِنَّ الْيَدَيْنِ تَسْجُدَانِ كَمَا يَسْجُدُ الْوَجْهُ فَإِذَا وَضَعَ أَحَدُكُمْ وَجْهَهُ فَلْيَضَعْ يَدَيْهِ وَإِذَا رَفَعَهُ فَلْيَرْفَعْهُمَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Isma'il yuitu Ibnu Ibrahim] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] yang ia marfu'kan kepada Nabi, \"Sesungguhnya kedua tangan bersujud sebagaimana wajah bersujud, apabila salah seorang dari kalian meletakkan wajah, hendaklah dia meletakkan kedua (telapak) tangannya dan apabila mengangkat wajahnya, hendaklah dia mengangkat kedua (telapak) tangannya.\""
            },
            {
                "number": 746,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ أَنَّ سَعِيدَ بْنَ الْحَكَمِ حَدَّثَهُمْ أَخْبَرَنَا نَافِعُ بْنُ يَزِيدَ حَدَّثَنِي يَحْيَى بْنُ أَبِي سُلَيْمَانَ عَنْ زَيْدِ بْنِ أَبِي الْعَتَّابِ وَابْنِ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جِئْتُمْ إِلَى الصَّلَاةِ وَنَحْنُ سُجُودٌ فَاسْجُدُوا وَلَا تَعُدُّوهَا شَيْئًا وَمَنْ أَدْرَكَ الرَّكْعَةَ فَقَدْ أَدْرَكَ الصَّلَاةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] bahwa [Sa'id bin Al Hakam] telah menceritakan kepada mereka, telah mengabarkan kepada kami [Nafi' bin Yazid] telah menceritakan kepadaku [Yahya bin Abu Sulaiman] dari [Zaid bin Abu Al 'Attab] dan [Ibnu Al Maqburi] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian datang untuk menunaikan sholat, sedangkan kami dalam keadaan sujud, maka ikutlah bersujud, dan janganlah kalian menghitungnya satu raka'at, dan barangsiapa mendapatkan ruku', berarti dia telah mendapatkan sholat (satu raka'at -pent).\""
            },
            {
                "number": 747,
                "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى حَدَّثَنَا مَعْمَرٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُئِيَ عَلَى جَبْهَتِهِ وَعَلَى أَرْنَبَتِهِ أَثَرُ طِينٍ مِنْ صَلَاةٍ صَلَّاهَا بِالنَّاسِحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Sufwan bin Isa] telah menceritakan kepada kami [Ma'mar] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam terlihat pada dahi dan ujung hidung beliau terdapat bekas tanah dari mengerjakan sholat bersama orang-orang.\" Telah menceritakan kepada kami [Muhamad bin Yahya] telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] seperti hadits di atas.\""
            },
            {
                "number": 748,
                "arab": "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ قَالَوَصَفَ لَنَا الْبَرَاءُ بْنُ عَازِبٍ فَوَضَعَ يَدَيْهِ وَاعْتَمَدَ عَلَى رُكْبَتَيْهِ وَرَفَعَ عَجِيزَتَهُ وَقَالَ هَكَذَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْجُدُ",
                "id": "Telah menceritakan kepada kami [Ar Rabi'ah' bin Nafi' Abu Taubah] telah menceritakan kepada kami [Syarik] dari [Abu Ishaq] dia berkata; [Al Barra` bin 'Azib] menjelaskan sujud kepada kami, maka ia meletakkan kedua tangannya dan mengangkat perutnya dari menempel tanah. Al Barra berkata; Beginilah Rasulullah Shalallahu 'Alaihi Wa sallam sujud.\""
            },
            {
                "number": 749,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اعْتَدِلُوا فِي السُّجُودِ وَلَا يَفْتَرِشْ أَحَدُكُمْ ذِرَاعَيْهِ افْتِرَاشَ الْكَلْبِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam bersabda: 'sempurnakanlah ketika kalian sujud dan janganlah salah seorang dari kalian membentangkan kedua lengannya seperti seekor anjing.\""
            },
            {
                "number": 750,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا سُفْيَانُ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَمِّهِ يَزِيدَ بْنِ الْأَصَمِّ عَنْ مَيْمُونَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَجَدَ جَافَى بَيْنَ يَدَيْهِ حَتَّى لَوْ أَنَّ بَهْمَةً أَرَادَتْ أَنْ تَمُرَّ تَحْتَ يَدَيْهِ مَرَّتْ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Sufyan] dari ['ubaidhullah bin Abdullah] dari [pamannya Yazid bin Al Asham] dari [Maimunah] bahwa apabila Nabi shallallahu 'alaihi wasallam sujud, beliau merenggangkan antara kedua tangannya sehingga seandainya ada seekor anak kambing yang hendak lewat di bawah kedua tangan beliau, tentu ia akan melewatinya.\""
            },
            {
                "number": 751,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو إِسْحَقَ عَنْ التَّمِيمِيِّ الَّذِي يُحَدِّثُ بِالتَّفْسِيرِ عَنْ ابْنِ عَبَّاسٍ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ خَلْفِهِ فَرَأَيْتُ بَيَاضَ إِبِطَيْهِ وَهُوَ مُجَخٍّ قَدْ فَرَّجَ بَيْنَ يَدَيْهِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Abu Ishaq] dari [At Taimi] yang menceritakan dengan tafsir, dari [Ibnu Abbas] dia berkata; saya menemui Nabi shallallahu 'alaihi wasallam dari belakang beliau, lalu aku melihat putih ketiaknya ketika beliau menungging (sujud), beliau merenggangkan antara kedua tangannya.\""
            },
            {
                "number": 752,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَبَّادُ بْنُ رَاشِدٍ حَدَّثَنَا الْحَسَنُ حَدَّثَنَا أَحْمَرُ بْنُ جَزْءٍ صَاحِبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا سَجَدَ جَافَى عَضُدَيْهِ عَنْ جَنْبَيْهِ حَتَّى نَأْوِيَ لَهُ",
                "id": "telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami ['Abbad bin Rasyid] telah menceritakan kepada kami [Al Hasan] telah menceritakan kepada kami [Ahmar bin Juz`in] salah seorang sahabat Rasulullah shallallahu 'alaihi wasallam bahwa apabila Rasulullah shallallahu 'alaihi wasallam sujud, beliau merenggangkan kedua lengannya dari kedua rusuk beliau sehingga kami amat kasihan terhadap beliau.\""
            },
            {
                "number": 753,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنَا اللَّيْثُ عَنْ دَرَّاجٍ عَنْ ابْنِ حُجَيْرَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا سَجَدَ أَحَدُكُمْ فَلَا يَفْتَرِشْ يَدَيْهِ افْتِرَاشَ الْكَلْبِ وَلْيَضُمَّ فَخْذَيْهِ",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin Syu'aib bin Al Laits] telah menceritakan kepada kami [Ibnu Wahb] telah menceritakan kepada kami [Al Laits] dari [Darraj] dari [Ibnu Hujairah] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian sujud, janganlah ia membentangkan kedua tangannya ke lantai sebagaimana seekor anjing, dan hendaklah ia meletakkan di kedua pahanya.\""
            },
            {
                "number": 754,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَاشْتَكَى أَصْحَابُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَشَقَّةَ السُّجُودِ عَلَيْهِمْ إِذَا انْفَرَجُوا فَقَالَ اسْتَعِينُوا بِالرُّكَبِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Ibnu 'Ajlan] dari [Sumayy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; para sahabat Nabi shallallahu 'alaihi wasallam mengadu kepada beliau tentang sulitnya sujud mereka jika harus menjauhkan kedua tangan dari kedua rusuk dan menjauhkan perut dari kedua paha, maka beliau bersabda: \"Gunakanklah lutut-lutut kalian.\""
            },
            {
                "number": 755,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ وَكِيعٍ عَنْ سَعِيدِ بْنِ زِيَادٍ عَنْ زِيَادِ بْنِ صَبِيحٍ الْحَنَفِيِّ قَالَصَلَّيْتُ إِلَى جَنْبِ ابْنِ عُمَرَ فَوَضَعْتُ يَدَيَّ عَلَى خَاصِرَتَيَّ فَلَمَّا صَلَّى قَالَ هَذَا الصَّلْبُ فِي الصَّلَاةِ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْهُ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sarri] dari [Waki'] dari [Sa'id bin Ziyad] dari [Ziyad bin Shabih Al Hanafi] dia berkata; saya sholat di samping [Ibnu Umar], lalu aku meletakkan kedua tanganku pada kedua lambungku (bertolak pinggang), seusainya sholat, dia berkata; \"Ini adalah salib dalam sholat, dan Rasulullah shallallahu 'alaihi wasallam melarang perbuatan seperti ini.\""
            },
            {
                "number": 756,
                "arab": "حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلَّامٍ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ هَارُونَ أَخْبَرَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ ثَابِتٍ عَنْ مُطَرِّفٍ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَفِي صَدْرِهِ أَزِيزٌ كَأَزِيزِ الرَّحَى مِنْ الْبُكَاءِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Muhammad bin Salam] telah menceritakan kepada kami [Yazid yaitu Ibnu Harun] telah mengabarkan kepada kami [Hammad yaitu Ibnu Salamah] dari [Tsabit] dari [Mutharif] dari [ayahnya] dia berkata; saya melihat Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat, sedang dalam dada beliau terdengar bunyi seperti batu penggiling gandum karena tangisan beliau shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 757,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو حَدَّثَنَا هِشَامٌ يَعْنِي ابْنَ سَعْدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَوَضَّأَ فَأَحْسَنَ وُضُوءَهُ ثُمَّ صَلَّى رَكْعَتَيْنِ لَا يَسْهُو فِيهِمَا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Hanbal] telah menceritakan kepada kami [Abdul Malik bin 'Amru] telah menceritakan kepada kami [Hisyam yaitu Ibnu Sa'd] dari [Zaid bin Aslam] dari ['Atha` bin Yasar] dari [Zaid bin Khalid Al Juhani] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berwudlu dan menyempurnakan wudlunya, kemudian sholat dua raka'at, tidak berbuat lalai, maka dosa-dosanya yang telah lalu akan terampuni.\""
            },
            {
                "number": 758,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ عَنْ رَبِيعَةَ بْنِ يَزِيدَ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ الْحَضْرَمِيِّ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ أَحَدٍ يَتَوَضَّأُ فَيُحْسِنُ الْوُضُوءَ وَيُصَلِّي رَكْعَتَيْنِ يُقْبِلُ بِقَلْبِهِ وَوَجْهِهِ عَلَيْهِمَا إِلَّا وَجَبَتْ لَهُ الْجَنَّةُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Zaid bin Al Hubab] telah menceritakan kepada kami [Mu'awiyah bin Shalih] dari [Rabi'ah bin Yazid] dari [Abu Idris Al Khaulani] dari [Jubair bin Nufair Al Hadlrami] dari ['Uqbah bin 'Amir Al Juhani] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah salah seorang dari kalian yang berwudlu, dan menyempurnakan wudlunya kemudian sholat (sunnah) dua raka'at dengan menghadapkan hati dan mukanya (khusyu' dan ikhlas) melainkan ia berhak mendapatkan surga.\""
            },
            {
                "number": 759,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَسُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ الدِّمَشْقِيُّ قَالَا أَخْبَرَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ عَنْ يَحْيَى الْكَاهِلِيِّ عَنْ الْمُسَوَّرِ بْنِ يَزِيدَ الْأَسَدِيِّ الْمَالِكِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَحْيَى وَرُبَّمَا قَالَ شَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الصَّلَاةِ فَتَرَكَ شَيْئًا لَمْ يَقْرَأْهُ فَقَالَ لَهُ رَجُلٌ يَا رَسُولَ اللَّهِ تَرَكْتَ آيَةَ كَذَا وَكَذَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلَّا أَذْكَرْتَنِيهَا قَالَ سُلَيْمَانُ فِي حَدِيثِهِ قَالَ كُنْتُ أُرَاهَا نُسِخَتْو قَالَ سُلَيْمَانُ قَالَ حَدَّثَنِي يَحْيَى بْنُ كَثِيرٍ الْأَزْدِيُّ قَالَ حَدَّثَنَا الْمُسَوَّرُ بْنُ يَزِيدَ الْأَسَدِيُّ الْمَالِكِيُّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] dan [Sulaiman bin Abdurrahman Ad Dimasyqi] keduanya berkata; telah mengabarkan kepada kami [Marwan bin Mu'awiyah] dari [Yahya Al Kahili] dari [Al Musawwir bin Yazid Al Asadi Al Maliki] bahwa Rasulullah shallallahu 'alaihi wasallam -Yahya mengatakan; \"dan sepertinya Musawir mengatakan; \"Aku menyaksikan Rasulullah shallallahu 'alaihi wasallam membaca surat al-qur'an dalam sholat, kemudian beliau meninggalkan suatu ayat, dan tidak di bacanya. Maka ada seseorang berkata kepada beliau; \"Wahai Rasulullah, Anda telah meninggalkan ayat ini dan ini.\" lantas Rasulullah shallallahu 'alaihi wasallam bersabda; \"Mengapa kamu tidak mengingatkan aku tentang ayat itu?\" Sulaiman berkata dalam haditsnya; Pendapatku bahwa ayat tersebut telah di nasakh (di hapus).\" Sulaiman mengatakan; telah menceritakan kepadaku Yahya bin Katsir Al Azdi dia berkata; telah menceritakan kepada kami Al Musawwar bin Yazid Al Asadi Al Maliki.\""
            },
            {
                "number": 760,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ مُحَمَّدٍ الدِّمَشْقِيُّ حَدَّثَنَا هِشَامُ بْنُ إِسْمَعِيلَ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْعَلَاءِ بْنِ زَبْرٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى صَلَاةً فَقَرَأَ فِيهَا فَلُبِسَ عَلَيْهِ فَلَمَّا انْصَرَفَ قَالَ لِأُبَيٍّ أَصَلَّيْتَ مَعَنَا قَالَ نَعَمْ قَالَ فَمَا مَنَعَكَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Muhammad Ad Dimasyqi] telah menceritakan kepada kami [Hisyam bin Isma'il] telah menceritakan kepada kami [Muhammad bin Syu'aib] telah mengabarkan kepada kami [Abdullah bin Al 'Ala` bin Zabr] dari [Salim bin Abdullah] dari [Abdullah bin Umar] bahwa Nabi shallallahu 'alaihi wasallam mengerjakan sholat dan membaca (beberapa ayat al-qur'an) dalam sholatnya, dan beliau terbalik-balik dalam bacaannya, seusai sholat beliau bersabda kepada Ubay: \"Apakah kamu tadi ikut sholat bersama kami?\" Ubay menjawab; \"Ya.\" Sabda beliau: \"Apa yang mencegahmu (untuk tidak membenarkan tentang ayat tadi)?\""
            },
            {
                "number": 761,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ الْفِرْيَابِيُّ عَنْ يُونُسَ بْنِ أَبِي إِسْحَقَ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَلِيُّ لَا تَفْتَحْ عَلَى الْإِمَامِ فِي الصَّلَاةِقَالَ أَبُو دَاوُد أَبُو إِسْحَقَ لَمْ يَسْمَعْ مِنْ الْحَارِثِ إِلَّا أَرْبَعَةَ أَحَادِيثَ لَيْسَ هَذَا مِنْهَا",
                "id": "Telah menceritakan kepada kami [Abdul Wahab bin Najdah] telah menceritakan kepada kami [Muhammad bin Yusuf Al Firyabi] dari [Yunus bin Abu Ishaq] dari [Abu Ishaq] dari [Al Harits] dari [Ali radliallahu 'anhu] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Ali, janganlah kamu mendahului imam dalam sholat.\" Abu Daud mengatakan; \"Abu Ishaq belum pernah mendengar dari Al Harits kecuali hanya empat hadits, padahal hadits ini tidak termasuk dari yang empat itu.\""
            },
            {
                "number": 762,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ سَمِعْتُ أَبَا الْأَحْوَصِ يُحَدِّثُنَا فِي مَجْلِسِ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَ قَالَ أَبُو ذَرٍّقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزَالُ اللَّهُ عَزَّ وَجَلَّ مُقْبِلًا عَلَى الْعَبْدِ وَهُوَ فِي صَلَاتِهِ مَا لَمْ يَلْتَفِتْ فَإِذَا الْتَفَتَ انْصَرَفَ عَنْهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] dia berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dia berkata; saya mendengar [Abu Al Ahwash] telah menceritakan kepada kami ketika di Majlis Ibnu Al Musayyab, dia berkata; [Abu Dzar] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Azza wa Jalla senantiasa menghadap kepada seorang hamba dalam sholatnya selama dia tidak menoleh, apabila ia menoleh, maka Allah pun berpaling darinya.\""
            },
            {
                "number": 763,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ الْأَشْعَثِ يَعْنِي ابْنَ سُلَيْمٍ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْتِفَاتِ الرَّجُلِ فِي الصَّلَاةِ فَقَالَ إِنَّمَا هُوَ اخْتِلَاسٌ يَخْتَلِسُهُ الشَّيْطَانُ مِنْ صَلَاةِ الْعَبْدِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu Al Ahwash] dari [Al Asy'ats yaitu Ibnu Sulaim] dari [ayahnya] dari [Masruq] dari [Aisyah radliallahu 'anha] dia berkata; aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam perihal menolehnya seseorang dalam sholatnya, beliau menjawab: \"Itu merupakan suatu bentuk perampasaan yang di kerjakan syetan terhadap sholat seorang hamba.\""
            },
            {
                "number": 764,
                "arab": "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ حَدَّثَنَا عِيسَى عَنْ مَعْمَرٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُئِيَ عَلَى جَبْهَتِهِ وَعَلَى أَرْنَبَتِهِ أَثَرُ طِينٍ مِنْ صَلَاةٍ صَلَّاهَا بِالنَّاسِقَالَ أَبُو عَلِيٍّ هَذَا الْحَدِيثُ لَمْ يَقْرَأْهُ أَبُو دَاوُدَ فِي الْعَرْضَةِ الرَّابِعَةِ",
                "id": "Telah menceritakan kepada kami [Mu'ammal bin Al Fadl] telah menceritakan kepada kami [Isa] dari [Ma'mar] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam terlihat pada dahi dan ujung hidung beliau ada bekas tanah, setelah mengerjakan sholat bersama orang-orang.\" Abu Ali mengatakan; \"Hadits ini tidak di baca oleh Abu Daud di pemaparan yang ke empat.\""
            },
            {
                "number": 765,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ وَهَذَا حَدِيثُهُ وَهُوَ أَتَمُّ عَنْ الْأَعْمَشِ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ الطَّائِيِّ عَنْ جَابِرِ بْنِ سَمُرَةَقَالَ عُثْمَانُ قَالَ دَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَسْجِدَ فَرَأَى فِيهِ نَاسًا يُصَلُّونَ رَافِعِي أَيْدِيهِمْ إِلَى السَّمَاءِ ثُمَّ اتَّفَقَا فَقَالَ لَيَنْتَهِيَنَّ رِجَالٌ يَشْخَصُونَ أَبْصَارَهُمْ إِلَى السَّمَاءِ قَالَ مُسَدَّدٌ فِي الصَّلَاةِ أَوْلَا تَرْجِعُ إِلَيْهِمْ أَبْصَارُهُمْ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu Mu'awiyah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dan ini merupakan hadits darinya dan lebih sempurna, dari [Al A'masy] dari [Al Musayyab bin Rafi'] dari [Tamim bin Tharafah Ath Tha`i] dari [Jabir bin Samurah] dia berkata; -Utsman berkata; \"Rasulullah shallallahu 'alaihi wasallam masuk masjid, lalu beliau melihat orang-orang tengah mengerjakan sholat sambil mengangkat tangan mereka (menengadah) ke langit, -kemudian riwayat Utsman dan Musaddad bersambung- beliau bersabda: \"Hendaklah orang-orang berhenti mengangkat pandangan mereka ke langit pada waktu sholat,.\" -Musaddad menambahkan; \"ataukah (mereka) ingin penglihatan mereka tidak dikembalikan lagi?\""
            },
            {
                "number": 766,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ أَنَّ أَنَسَ بْنَ مَالِكٍ حَدَّثَهُمْ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَالُ أَقْوَامٍ يَرْفَعُونَ أَبْصَارَهُمْ فِي صَلَاتِهِمْ فَاشْتَدَّ قَوْلُهُ فِي ذَلِكَ فَقَالَ لَيَنْتَهُنَّ عَنْ ذَلِكَ أَوْ لَتُخْطَفَنَّ أَبْصَارُهُمْ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Sa'id bin Abu 'Arubah] dari [Qatdah] bahwa [Anas bin Malik] telah menceritakan kepada mereka, katanya; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mengapa orang-orang masih saja mengangkat pandangan mereka (ke atas) pada waktu sholat?\" dan ucapan beliau (terdengar) sangat mengecam perbuatan tersebut, lalu beliau bersabda: \"Hendaklah mereka berhenti melakukan hal itu atau mereka ingin penglihatan mereka di hilangkan?\""
            },
            {
                "number": 767,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي خَمِيصَةٍ لَهَا أَعْلَامٌ فَقَالَ شَغَلَتْنِي أَعْلَامُ هَذِهِ اذْهَبُوا بِهَا إِلَى أَبِي جَهْمٍ وَأْتُونِي بِأَنْبِجَانِيَّتِهِحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ أَبِي الزِّنَادِ قَالَ سَمِعْتُ هِشَامًا يُحَدِّثُ عَنْ أَبِيهِ عَنْ عَائِشَةَ بِهَذَا الْخَبَرِ قَالَ وَأَخَذَ كُرْدِيًّا كَانَ لِأَبِي جَهْمٍ فَقِيلَ يَا رَسُولَ اللَّهِ الْخَمِيصَةُ كَانَتْ خَيْرًا مِنْ الْكُرْدِيِّ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu syaibah] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['Urwah] dari [Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan sholat dengan memakai pakaian bergambar, kemudian beliau bersabda: \"Gambar-gambar pada pakaian ini telah mengganggu perhatianku, kembalikanlah ia kepada Abu Jahm dan tukarlah dengan pakaian bulu kasar yang tidak bergambar.\" Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Abdurrahman yaitu Ibnu Abu Az Zannad] dia berkata; saya mendengar [Hisyam] menceritakan dari [ayahnya] dari [Aisyah] dengan hadits seperti ini, katanya; \"Dan beliau mengambil kain Kurdi milik Abu Jahm, lalu di katakan; \"Wahai Rasulullah, kain yang bergambar tadi lebih bagus dari kain Kurdi.\""
            },
            {
                "number": 768,
                "arab": "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا مُعَاوِيَةُ يَعْنِي ابْنَ سَلَّامٍ عَنْ زَيْدٍ أَنَّهُ سَمِعَ أَبَا سَلَّامٍ قَالَ حَدَّثَنِي السَّلُولِيُّ هُوَ أَبُو كَبْشَةَ عَنْ سَهْلِ ابْنِ الْحَنْظَلِيَّةِ قَالَثُوِّبَ بِالصَّلَاةِ يَعْنِي صَلَاةَ الصُّبْحِ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَهُوَ يَلْتَفِتُ إِلَى الشِّعْبِقَالَ أَبُو دَاوُد وَكَانَ أَرْسَلَ فَارِسًا إِلَى الشِّعْبِ مِنْ اللَّيْلِ يَحْرُسُ",
                "id": "Telah menceritakan kepada kami [Ar Rabi' bin nafi'] telah menceritakan kepada kami [Mu'awiyah yaitu Ibnu Sallam] dari [Zaid] bahwa dia mendengar [Abu Salam] berkata; telah menceritakan kepadaku [As Saluli yaitu Abu Kabsyah] dari [Sahl bin Handzaliyah] dia berkata; \"Iqamat sholat subuh telah di kumandangkan, lalu Rasulullah shallallahu 'alaihi wasallam berdiri untuk melaksanakan sholat, (dalam sholatnya) beliau menoleh ke arah jalan setapak di bukit.\" -Abu Daud berkata; Waktu itu beliau mengutus pasukan penunggang kuda ke jalan setapak di bukit untuk berjaga-jaga pada malam hari.\""
            },
            {
                "number": 769,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا مَالِكٌ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَمْرِو بْنِ سُلَيْمٍ عَنْ أَبِي قَتَادَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي وَهُوَ حَامِلٌ أُمَامَةَ بِنْتَ زَيْنَبَ بِنْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا سَجَدَ وَضَعَهَا وَإِذَا قَامَ حَمَلَهَا",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] telah menceritakan kepada kami [Malik] dari ['Amir bin Abdullah bin Az Zubair] dari ['Amru bin Sulaim] dari [Abu Qatadah] bahwa Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat sambil menggendong Umamah binti Zainab binti Rasulullah shallallahu 'alaihi wasallam, apabila beliau sujud, beliau menaruh Umamah, dan apabila berdiri beliau menggendongnya.\""
            },
            {
                "number": 770,
                "arab": "حَدَّثَنَا قُتَيْبَةُ يَعْنِي ابْنَ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ أَنَّهُ سَمِعَ أَبَا قَتَادَةَ يَقُولُبَيْنَا نَحْنُ فِي الْمَسْجِدِ جُلُوسٌ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْمِلُ أُمَامَةَ بِنْتَ أَبِي الْعَاصِ بْنِ الرَّبِيعِ وَأُمُّهَا زَيْنَبُ بِنْتُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ صَبِيَّةٌ يَحْمِلُهَا عَلَى عَاتِقِهِ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ عَلَى عَاتِقِهِ يَضَعُهَا إِذَا رَكَعَ وَيُعِيدُهَا إِذَا قَامَ حَتَّى قَضَى صَلَاتَهُ يَفْعَلُ ذَلِكَ بِهَا",
                "id": "Telah menceritakan kepada kami [Qutaibah yaitu Ibnu Sa'id] telah menceritakan kepada kami [Al Laits] dari [Sa'id bin Abu Sa'id] dari ['Amru bin Sulaim Az Zuraqi] bahwa dia mendengar [Abu Qatadah] berkata; \"Ketika kami duduk-duduk di Masjid, Rasulullah shallallahu 'alaihi wasallam muncul menemui kami sambil menggendong Umamah binti Abu Al 'Ash bin Ar Rabi' -ibunya adalah Zainab binti Rasulullah shallallahu 'alaihi wasallam- ketika itu Umamah masih kacil, beliau menggendongnya di atas pundak, kemudian Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat, sedangkan Umamah masih di atas pundak beliau, apabila ruku' beliau meletakkan Umamah, jika berdiri, beliau menggendongnya kembali. beliau melakukan yang demikian itu hingga selesai sholat.\""
            },
            {
                "number": 771,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ مَخْرَمَةَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ قَالَ سَمِعْتُ أَبَا قَتَادَةَ الْأَنْصَارِيَّ يَقُولُرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي لِلنَّاسِ وَأُمَامَةُ بِنْتُ أَبِي الْعَاصِ عَلَى عُنُقِهِ فَإِذَا سَجَدَ وَضَعَهَاقَالَ أَبُو دَاوُد وَلَمْ يَسْمَعْ مَخْرَمَةُ مِنْ أَبِيهِ إِلَّا حَدِيثًا وَاحِدًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Salamah Al Muradi] telah menceritakan kepada kami [Ibnu Wahb] dari [Makhramah] dari [ayahnya] dari ['Amru bin Sulaim Az Zuraqi] dia berkata; saya mendengar [Abu Qatadah Al Anshari] berkata; saya melihat Rasulullah shallallahu 'alaihi wasallam sholat bersama orang-orang, sedangkan Umamah binti Abu Al 'Ash berada di tengkuk beliau, apabila sujud, beliau meletakkannya.\" Abu Daud berkata; \"Al Makhramah tidak pernah mendengar hadits dari Ayahnya kecuali hanya satu hadits.\""
            },
            {
                "number": 772,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ إِسْحَقَ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ عَنْ أَبِي قَتَادَةَ صَاحِبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَبَيْنَمَا نَحْنُ نَنْتَظِرُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلصَّلَاةِ فِي الظُّهْرِ أَوْ الْعَصْرِ وَقَدْ دَعَاهُ بِلَالٌ لِلصَّلَاةِ إِذْ خَرَجَ إِلَيْنَا وَأُمَامَةُ بِنْتُ أَبِي الْعَاصِ بِنْتُ ابْنَتِهِ عَلَى عُنُقِهِ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مُصَلَّاهُ وَقُمْنَا خَلْفَهُ وَهِيَ فِي مَكَانِهَا الَّذِي هِيَ فِيهِ قَالَ فَكَبَّرَ فَكَبَّرْنَا قَالَ حَتَّى إِذَا أَرَادَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَرْكَعَ أَخَذَهَا فَوَضَعَهَا ثُمَّ رَكَعَ وَسَجَدَ حَتَّى إِذَا فَرَغَ مِنْ سُجُودِهِ ثُمَّ قَامَ أَخَذَهَا فَرَدَّهَا فِي مَكَانِهَا فَمَا زَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ بِهَا ذَلِكَ فِي كُلِّ رَكْعَةٍ حَتَّى فَرَغَ مِنْ صَلَاتِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Khalaf] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Muhammad yakni Ibnu Ishaq] dari [Sa'id bin Abu Sa'id Al Maqburi] dari ['Amru bin Sulaim Az Zuraqi] dari [Abu Qatadah] salah seorang sahabat Rasulullah shallallahu 'alaihi wasallam, katanya; \"Katika kami menunggu Rasulullah shallallahu 'alaihi wasallam untuk mengerjakan sholat dluhur atau sholat Ashar (berjama'ah), dan Bilal pun telah mengumandangkan iqamah untuk sholat, tiba-tiba beliau muncul menggendong Umamah anak putrinya (Zainab) di tengkuk beliau, kemudian Rasulullah shallallahu 'alaihi wasallam sholat sedangkan kami berada di belakang beliau, sementara Umamah masih dalam posisinya semula.\" Abu Qatadah berkata; \"Kamudian beliau bertakbir, kami pun bertakbir, sehingga ketika beliau hendak ruku', beliau mengambil dari tengkuknya dan meletakkannya, lalu beliau ruku' dan sujud, seusainya sujud dan hendak berdiri, beliau mengambilnya lagi dan meletakkan kembali di posisi semula, Rasulullah shallallahu 'alaihi wasallam melakukan yang demikian itu di setiap raka'atnya hingga selesai dari sholatnya shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 773,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ ضَمْضَمِ بْنِ جَوْسٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْتُلُوا الْأَسْوَدَيْنِ فِي الصَّلَاةِ الْحَيَّةَ وَالْعَقْرَبَ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Ali bin Al Mubarrak] dari [Yahya bin Abu Katsir] dari [Dlamdlam bin Jaus] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bunuhlah dua binatang hitam dalam sholat, yaitu ular dan kalajengking.\""
            },
            {
                "number": 774,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَمُسَدَّدٌ وَهَذَا لَفْظُهُ قَالَ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ حَدَّثَنَا بُرْدٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَحْمَدُ يُصَلِّي وَالْبَابُ عَلَيْهِ مُغْلَقٌ فَجِئْتُ فَاسْتَفْتَحْتُ قَالَ أَحْمَدُ فَمَشَى فَفَتَحَ لِي ثُمَّ رَجَعَ إِلَى مُصَلَّاهُوَذَكَرَ أَنَّ الْبَابَ كَانَ فِي الْقِبْلَةِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Musaddad] sedangkan ini adalah lafadznya Musaddad, katanya; telah menceritakan kepada kami [Bisyr yaitu Ibnu Al Mufadlal] telah menceritakan kepada kami [Burd] dari [Az Zuhri] dari ['Urwah bin Az Zubair] dari [Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam -Ahmad berkata- Sedang mengerjakan sholat, sementara pintu dalam keadaan tertutup, ketika aku datang, aku minta dibukakan pintu -Ahmad berkata- maka beliau berjalan dan membukakan pintu untukku lalu beliau kembali lagi ketempat sholatnya.\" disebutkan ketika itu pintu berada di arah kiblatnya. "
            },
            {
                "number": 775,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَكُنَّا نُسَلِّمُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي الصَّلَاةِ فَيَرُدُّ عَلَيْنَا فَلَمَّا رَجَعْنَا مِنْ عِنْدِ النَّجَاشِيِّ سَلَّمْنَا عَلَيْهِ فَلَمْ يَرُدَّ عَلَيْنَا وَقَالَ إِنَّ فِي الصَّلَاةِ لَشُغْلًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Ibnu Fudlail] dari [Al A'masy] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] dia berkata; \"Kami memberi salam kepada Rasulullah shallallahu 'alaihi wasallam ketika beliau sedang sholat, lalu beliau menjawab salam kami, ketika kami tiba dari negeri Najasyi, kami memberi salam kepada beliau, namun beliau tidak menjawab salam kami, setelah itu beliau bersabda: \"Sesunggunya dalam sholat benar-benar ada kesibukan.\""
            },
            {
                "number": 776,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ حَدَّثَنَا عَاصِمٌ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ قَالَكُنَّا نُسَلِّمُ فِي الصَّلَاةِ وَنَأْمُرُ بِحَاجَتِنَا فَقَدِمْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي فَسَلَّمْتُ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيَّ السَّلَامَ فَأَخَذَنِي مَا قَدُمَ وَمَا حَدُثَ فَلَمَّا قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةَ قَالَ إِنَّ اللَّهَ يُحْدِثُ مِنْ أَمْرِهِ مَا يَشَاءُ وَإِنَّ اللَّهَ جَلَّ وَعَزَّ قَدْ أَحْدَثَ مِنْ أَمْرِهِ أَنْ لَا تَكَلَّمُوا فِي الصَّلَاةِ فَرَدَّ عَلَيَّ السَّلَامَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Aban] telah menceritakan kepada kami ['Ashim] dari [Abu Wa'il] dari [Abdullah] dia berkata; \"Kami pernah memberi salam dalam sholat dan memerintahkan supaya hajat kami di penuhi, kemudian kami datang menemui Rasulullah shallallahu 'alaihi wasallam, ketika itu beliau sedang mengerjakan sholat, lantas aku pun memberi salam kepadanya, namun beliau tidak menjawab salamku, sehingga aku teringat dengan masa laluku dan masa sekarang,. Ketika sholat selesai, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah menetapkan perintah-Nya sesuai kehendak-Nya, dan Allah Jalla wa 'Azza telah menetapkan perintah-Nya yaitu janganlah kamu berbicara ketika sedang sholat.\" kemudian beliau menjawab salamku.\""
            },
            {
                "number": 777,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ أَنَّ اللَّيْثَ حَدَّثَهُمْ عَنْ بُكَيْرٍ عَنْ نَابِلٍ صَاحِبِ الْعَبَاءِ عَنْ ابْنِ عُمَرَ عَنْ صُهَيْبٍ أَنَّهُ قَالَمَرَرْتُ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي فَسَلَّمْتُ عَلَيْهِ فَرَدَّ إِشَارَةً قَالَ وَلَا أَعْلَمُهُ إِلَّا قَالَ إِشَارَةً بِأُصْبُعِهِوَهَذَا لَفْظُ حَدِيثِ قُتَيْبَةَ",
                "id": "telah menceritakan kepada kami [Yazid bin Khalid bin Mauhab] dan [Qutaibah bin Sa'id] bahwa [Al Laitsi] telah menceritakan kepada meeka dari [Bukair] dari [Nabil sahabatnya 'Aba`] dari [Ibnu Umar] dari [Suhaib] dia berkata; \"Aku melewati Rasulullah shallallahu 'alaihi wasallam, sementara beliau dalam keadaan sholat, lalu aku mengucapkan salam kepadanya, dan beliau menjawabnya dengan isyarat.\" Nabil berkata; \"Aku tidak mengetahui kecuali Ibnu Umar berkata; 'Bahwa isyarat beliau dengan menggunakan jari jemarinya.\" Lafadz hadits ini dari Qutaibah. "
            },
            {
                "number": 778,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَأَرْسَلَنِي نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى بَنِى الْمُصْطَلَقِ فَأَتَيْتُهُ وَهُوَ يُصَلِّي عَلَى بَعِيرِهِ فَكَلَّمْتُهُ فَقَالَ لِي بِيَدِهِ هَكَذَا ثُمَّ كَلَّمْتُهُ فَقَالَ لِي بِيَدِهِ هَكَذَا وَأَنَا أَسْمَعُهُ يَقْرَأُ وَيُومِئُ بِرَأْسِهِ فَلَمَّا فَرَغَ قَالَ مَا فَعَلْتَ فِي الَّذِي أَرْسَلْتُكَ فَإِنَّهُ لَمْ يَمْنَعْنِي أَنْ أُكَلِّمَكَ إِلَّا أَنِّي كُنْتُ أُصَلِّي",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] dia berkata; Nabi Allah shallallahu 'alaihi wasallam pernah mengutusku menuju (perkampungan) Bani Mushthaliq, lalu aku menemui beliau, sedangkan beliau tengah mengerjakan sholat di atas kendaraannya, aku pun berbicara kepadanya, maka beliau memberi isyarat dengan tangannya seperti ini, aku berbicara lagi, namun beliau hanya memberi isyarat dengan tangannya seperti ini, sedangkan aku mendengar bacaan sholat beliau, dan beliau menganggukkan kepalanya. Seusai sholat, beliau bersabda: \"Bagaimana dengan tugas yang telah aku tugaskan kepadamu? Sebenarnya tidak ada halangan buatku untuk membalas perkataanmu itu, hanya saja waktu itu aku sedang mengerjakan sholat.\""
            },
            {
                "number": 779,
                "arab": "حَدَّثَنَا الْحُسَيْنُ بْنُ عِيسَى الْخُرَاسَانِيُّ الدَّامِغَانِيُّ حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ حَدَّثَنَا نَافِعٌ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى قُبَاءَ يُصَلِّي فِيهِ قَالَ فَجَاءَتْهُ الْأَنْصَارُ فَسَلَّمُوا عَلَيْهِ وَهُوَ يُصَلِّي قَالَ فَقُلْتُ لِبِلَالٍ كَيْفَ رَأَيْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرُدُّ عَلَيْهِمْ حِينَ كَانُوا يُسَلِّمُونَ عَلَيْهِ وَهُوَ يُصَلِّي قَالَ يَقُولُ هَكَذَا وَبَسَطَ كَفَّهُ وَبَسَطَ جَعْفَرُ بْنُ عَوْنٍ كَفَّهُ وَجَعَلَ بَطْنَهُ أَسْفَلَ وَجَعَلَ ظَهْرَهُ إِلَى فَوْقٍ",
                "id": "Telah menceritakan kepada kami [Al Husain bin Isa Al Khurasani Ad Damighani] telah menceritakan kepada kami [Ja'far bin 'Aun] telah menceritakan kepada kami [Hisyam bin Sa'd] telah menceritakan kepada kami [Nafi'] dia berkata; saya mendengar [Abdullah bin Umar] berkata; Rasulullah shallallahu 'alaihi wasallam berangkat menuju Quba` dan sholat di sana, lantas orang-orang Anshar datang menemui beliau sambil mengucapkan salam, sedangkan beliau tengah mengerjakan sholat.\" Abdullah berkata; \"Aku bertanya kepada Bilal; \"Bagaimana kamu melihat Rasulullah shallallahu 'alaihi wasallam menjawab salam ketika mereka memberi salam kepada beliau yang sedang sholat?\" Bilal menjawab; \"Seperti ini, sambil membuka telapak tangannya. dan Ja'far bin 'Aun membuka telapak tangannya dengan menjadikan bagian dalamnya di bawah dan bagian luarnya di atas.\""
            },
            {
                "number": 780,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا غِرَارَ فِي صَلَاةٍ وَلَا تَسْلِيمٍقَالَ أَحْمَدُ يَعْنِي فِيمَا أَرَى أَنْ لَا تُسَلِّمَ وَلَا يُسَلَّمَ عَلَيْكَ وَيُغَرِّرُ الرَّجُلُ بِصَلَاتِهِ فَيَنْصَرِفُ وَهُوَ فِيهَا شَاكٌّ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Sufyan] dari [Abu Malik Al Asyja'i] dari [Abu Hazim] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Tidak boleh ada pengurangan dalam hal sholat maupun salam.\" Ahmad berkata; \"Menurutku baik anda mengucap salam maupun menjawab salam. Dan maksud seseorang mengurangi sholatnya, adalah ia berhenti, padahal dia masih ragu (sudah sempurna ataukah belum).\" "
            },
            {
                "number": 781,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَخْبَرَنَا مُعَاوِيَةُ بْنُ هِشَامٍ عَنْ سُفْيَانَ عَنْ أَبِي مَالِكٍ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَأُرَاهُ رَفَعَهُ قَالَ لَا غِرَارَ فِي تَسْلِيمٍ وَلَا صَلَاةٍقَالَ أَبُو دَاوُد وَرَوَاهُ ابْنُ فُضَيْلٍ عَلَى لَفْظِ ابْنِ مَهْدِيٍّ وَلَمْ يَرْفَعْهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] telah mengabarkan kepada kami [Mu'awiyah bin Hisyam] dari [Sufyan] dari [Abu Malik] dari [Abu Hazim] dari [Abu Hurairah] dia berkata; -sepertinya Sufyan merafa'kan hadits ini kepada Nabi- beliau bersabda: \"Tidak boleh ada ghirar (pengurangan) dalam hal salam, maupun sholat.\" Abu Daud mengatakan; \"Hadits ini di riwayatkan pula oleh [Ibnu Fudlail] dengan lafadz Ibnu Mahdi, namun dia tidak merafa'kan kepada Nabi.\""
            },
            {
                "number": 782,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ الْمَعْنَى عَنْ حَجَّاجٍ الصَّوَّافِ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ مُعَاوِيَةَ بْنِ الْحَكَمِ السُّلَمِيِّ قَالَصَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَطَسَ رَجُلٌ مِنْ الْقَوْمِ فَقُلْتُ يَرْحَمُكَ اللَّهُ فَرَمَانِي الْقَوْمُ بِأَبْصَارِهِمْ فَقُلْتُ وَاثُكْلَ أُمِّيَاهُ مَا شَأْنُكُمْ تَنْظُرُونَ إِلَيَّ فَجَعَلُوا يَضْرِبُونَ بِأَيْدِيهِمْ عَلَى أَفْخَاذِهِمْ فَعَرَفْتُ أَنَّهُمْ يُصَمِّتُونِي فَقَالَ عُثْمَانُ فَلَمَّا رَأَيْتُهُمْ يُسَكِّتُونِي لَكِنِّي سَكَتُّ قَالَ فَلَمَّا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَبِي وَأُمِّي مَا ضَرَبَنِي وَلَا كَهَرَنِي وَلَا سَبَّنِي ثُمَّ قَالَ إِنَّ هَذِهِ الصَّلَاةَ لَا يَحِلُّ فِيهَا شَيْءٌ مِنْ كَلَامِ النَّاسِ هَذَا إِنَّمَا هُوَ التَّسْبِيحُ وَالتَّكْبِيرُ وَقِرَاءَةُ الْقُرْآنِ أَوْ كَمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا قَوْمٌ حَدِيثُ عَهْدٍ بِجَاهِلِيَّةٍ وَقَدْ جَاءَنَا اللَّهُ بِالْإِسْلَامِ وَمِنَّا رِجَالٌ يَأْتُونَ الْكُهَّانَ قَالَ فَلَا تَأْتِهِمْ قَالَ قُلْتُ وَمِنَّا رِجَالٌ يَتَطَيَّرُونَ قَالَ ذَاكَ شَيْءٌ يَجِدُونَهُ فِي صُدُورِهِمْ فَلَا يَصُدُّهُمْ قُلْتُ وَمِنَّا رِجَالٌ يَخُطُّونَ قَالَ كَانَ نَبِيٌّ مِنْ الْأَنْبِيَاءِ يَخُطُّ فَمَنْ وَافَقَ خَطَّهُ فَذَاكَ قَالَ قُلْتُ جَارِيَةٌ لِي كَانَتْ تَرْعَى غُنَيْمَاتٍ قِبَلَ أُحُدٍ وَالْجَوَّانِيَّةِ إِذْ اطَّلَعْتُ عَلَيْهَا اطِّلَاعَةً فَإِذَا الذِّئْبُ قَدْ ذَهَبَ بِشَاةٍ مِنْهَا وَأَنَا مِنْ بَنِي آدَمَ آسَفُ كَمَا يَأْسَفُونَ لَكِنِّي صَكَكْتُهَا صَكَّةً فَعَظُمَ ذَاكَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ أَفَلَا أُعْتِقُهَا قَالَ ائْتِنِي بِهَا قَالَ فَجِئْتُهُ بِهَا فَقَالَ أَيْنَ اللَّهُ قَالَتْ فِي السَّمَاءِ قَالَ مَنْ أَنَا قَالَتْ أَنْتَ رَسُولُ اللَّهِ قَالَ أَعْتِقْهَا فَإِنَّهَا مُؤْمِنَةٌ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya], dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Isma'il bin Ibrahim] sedangkan makna haditsnya dari [Hajjaj Ash Shawaf] telah menceritakan kepadaku [Yahya bi Abu Katsir] dari [Hilal bi Abu Maimunah] dari ['Atha` bin Yasar] dari [Mu'awiyah bin Al Hakam As Sulami] dia berkata; saya sholat bersama Rasulullah shallallahu 'alaihi wasallam, lalu ada seseorang yang bersin, maka aku mengucapkan; \"Yarhamukalah (semoga Allah merahmatimu) \" karena itu orang-rang mengalihkan pandangannya kepadaku, maka aku berkata; \"Celaka, kenapa kalian memandang kepadaku?\" kemudian mereka menepukkan tangan ke paha mereka, sehingga aku tahu bahwa mereka bermaksud menyuruh aku diam. Utsman mengatakan; \"ketika aku tahu mereka menyuruhku diam, maka aku pun diam. Kata Mu'awiyah; \"demi ayah dan ibuku, ketika Rasulullah shallallahu 'alaihi wasallam selesai sholat, beliau tidak memukulku dan tidak pula membentakku serta tidak memakiku.\" Kemudian beliau bersabda: \"Sesungguhnya sholat ini, tidak halal di dalamnya bercampur dengan sesuatu perkataan manusia, akan tetapi yang ada hanyalah tasbih, takbir dan membaca al-qur'an atau sebagaimana sabda Rasulullah shallallahu 'alaihi wasallam.\" Aku berkata; \"Wahai Rasulullah, kami adalah suatu kaum yang baru keluar dari kejahiliyahan, lalu Allah menganugerahkan kepada kami agama Islam, namun di antara kami masih ada yang suka mendatangi para normal.\" Beliau menjawab: \"Janganlah kalian mendatangi mereka.\" Mu'awiyah berkata; kataku; \"Dan di antara kami masih ada yang suka tathayyur (meramal nasib dengan burung dan yang lain).\" Beliau bersabda: \"itu hanya ilustrasi hati saja, karena itu janganlah mereka di halangi oleh hal itu.\" Aku bertanya; \"Di antara kami ada juga beberapa yang meramal nasib dengan membuat garis (tharq).\" Beliau bersabda: \"Ada di antara para Nabi yang memperaktekkan cara itu, maka siapa saja yang garisnya tepat dengan garis nabi itu, tepatlah ia.\" Mu'awiyah berkata; aku berkata; \"Aku memiliki seorang budak perempuan yang menggembalakan beberapa ekor kambingku ke arah Uhud dan Jawaniyah, suatu ketika aku pergi menemuinya, tiba-tiba waktu itu ada seekor serigala yang menerkam dan membawa lari seekor kambingku, sebenarnya aku adalah anak Adam yang memiliki belas kasihan kepada orang lain sebagaimana mereka (orang lain). Akan tetapi aku (tidak mampu lagi menahan diri) dan memukul budak perempuan itu, ternyata kejadian itu terasa berat bagiku, akhirnya aku mengadukannya kepada Rasulullah shallallahu 'alaihi wasallam, lalu aku berkata; \"Tidakkah aku memerdekakannya saja?\" beliau bersabda: \"Bawalah ia kepadaku.\" Mu'awiyah berkata; \"Lalu aku bawa dia menghadap beliau, kemudian beliau bersabda: \"Siapakah saya?\" Budak wanita itu menjawab; \"Anda adalah Rasulullah.\" Beliau bersabda: \"Merdekakanlah dia, karena dia wanita yang beriman.\""
            },
            {
                "number": 783,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يُونُسَ النَّسَائِيُّ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو حَدَّثَنَا فُلَيْحٌ عَنْ هِلَالِ بْنِ عَلِيٍّ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ مُعَاوِيَةَ بْنِ الْحَكَمِ السُّلَمِيِّ قَالَلَمَّا قَدِمْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلِمْتُ أُمُورًا مِنْ أُمُورِ الْإِسْلَامِ فَكَانَ فِيمَا عَلِمْتُ أَنْ قَالَ لِي إِذَا عَطَسْتَ فَاحْمَدْ اللَّهَ وَإِذَا عَطَسَ الْعَاطِسُ فَحَمِدَ اللَّهَ فَقُلْ يَرْحَمُكَ اللَّهُ قَالَ فَبَيْنَمَا أَنَا قَائِمٌ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّلَاةِ إِذْ عَطَسَ رَجُلٌ فَحَمِدَ اللَّهَ فَقُلْتُ يَرْحَمُكَ اللَّهُ رَافِعًا بِهَا صَوْتِي فَرَمَانِي النَّاسُ بِأَبْصَارِهِمْ حَتَّى احْتَمَلَنِي ذَلِكَ فَقُلْتُ مَا لَكُمْ تَنْظُرُونَ إِلَيَّ بِأَعْيُنٍ شُزْرٍ قَالَ فَسَبَّحُوا فَلَمَّا قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ الْمُتَكَلِّمُ قِيلَ هَذَا الْأَعْرَابِيُّ فَدَعَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِي إِنَّمَا الصَّلَاةُ لِقِرَاءَةِ الْقُرْآنِ وَذِكْرِ اللَّهِ جَلَّ وَعَزَّ فَإِذَا كُنْتَ فِيهَا فَلْيَكُنْ ذَلِكَ شَأْنُكَ فَمَا رَأَيْتُ مُعَلِّمًا قَطُّ أَرْفَقَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yunus An Nasa`i] telah menceritakan kepada kami [Abdul Malik bin 'Amru] telah menceritakan kepada kami [Fulaih] dari [Hilal bin Ali] dari ['Atha` bin Yasar] dari [Mu'awiyah bin Al Hakam As Sulami] dia berkata; Ketika aku tiba datang menemui Rasulullah shallallahu 'alaihi wasallam, maka aku tahu beberapa perkara Islam, di antara yang aku ketahui adalah, beliau bersabda kepadaku: \"Apabila kamu bersin, maka ucapkanlah \"Al hamdulillah\" dan apabila seseorang bersin, kemudian ia mengucapkan \"Al hamdulillah\" maka katakanlah \"Yarhamukallah (semoga Allah merahmatimu) \" Mu'awiyah melanjutkan; \"Ketika kami mengerjakan sholat bersama Rasulullah shallallahu 'alaihi wasallam, tiba-tiba seseorang bersin dan mengucapkan \"Al Hamdulillah\", maka sambil mengeraskan suaraku, aku berkata; \"Yarhamukallah.\" Dengan itu, orang-orang mengalihkan pandangan ke arahku, sehingga aku gugup karenanya, kataku; \"Kenapa kalian memandangku dengan pandangan marah.\" Katanya; \"Bertasbihlah kalian.\" ketika Rasulullah shallallahu 'alaihi wasallam selesai dari sholatnya, beliau bersabda: \"Siapakah yang berbicara tadi?\" di jawab; \"Orang arab badui ini.\" lalu Rasulullah shallallahu 'alaihi wasallam memanggilku dan bersabda: \"Sesungguhnya sholat itu untuk membaca al-qur'an dan berdzikir kepada Allah Jalla wa 'Azza, apabila kamu sedang sholat, maka kamu harus seperti itu (membaca al-qur'an dan berdzikir).\" Maka aku belum pernah melihat seorang pengajar yang lebih lembut dari Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 784,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ سَلَمَةَ عَنْ حُجْرٍ أَبِي الْعَنْبَسِ الْحَضْرَمِيِّ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَرَأَ{ وَلَا الضَّالِّينَ }قَالَ آمِينَ وَرَفَعَ بِهَا صَوْتَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Salamah] dari [Hujr Abu Al 'Anbas Al Hadlrami] dari [Wa'il bin Hujr] dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam membaca; \"Walaadl dlaallin, beliau mengucapkan; \"Amiin\" Sambil mengangkat suaranya.\""
            },
            {
                "number": 785,
                "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ الشَّعِيرِيُّ حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا عَلِيُّ بْنُ صَالِحٍ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ حُجْرِ بْنِ عَنْبَسٍ عَنْ وَائِلِ بْنِ حُجْرٍأَنَّهُ صَلَّى خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَهَرَ بِآمِينَ وَسَلَّمَ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ حَتَّى رَأَيْتُ بَيَاضَ خَدِّهِ",
                "id": "Telah menceritakan kepada kami [Makhlad bin Khalid As Sya'iri] telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Ali bin Shalih] dari [Salamah bin Kuhail] dari [Hujr bin 'Anbas] dari [Wa`il bin Hujr] bahwa dia sholat di belakang Rasulullah shallallahu 'alaihi wasallam, lalu beliau mengeraskan suara bacaan \"Amin\" dan memberi salam ke kanan dan ke kiri sehingga aku melihat putihnya pipi beliau.\""
            },
            {
                "number": 786,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا صَفْوَانُ بْنُ عِيسَى عَنْ بِشْرِ بْنِ رَافِعٍ عَنْ أَبِي عَبْدِ اللَّهِ ابْنِ عَمِّ أَبِي هُرَيْرَةَ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا تَلَا{ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ }قَالَ آمِينَ حَتَّى يَسْمَعَ مَنْ يَلِيهِ مِنْ الصَّفِّ الْأَوَّلِ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah mengabarkan kepada kami [Shafwan bin Isa] dari [Bisyr bin Rafi'] dari [Abu Abdullah anak paman Abu Hurairah] dari [Abu Hurairah] dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam membaca \"Ghairil maghdluubi 'alaihim waladl dlaallin\", beliau mengucapkan; \"Amin\" sehingga orang yang berada di belakang beliau di shaf pertama mendengar beliau ucapan beliau.\""
            },
            {
                "number": 787,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَالَ الْإِمَامُ{ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ }فَقُولُوا آمِينَ فَإِنَّهُ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلَائِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Sumayy bekas budak Abu Bakar] dari [Abu Shalih As Saman] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila imam mengucapkan; \"Ghairil maghdluubi 'alaihim waladl dlaallin\" maka ucapkanlah 'Amiin\" karena barangsiapa bacaan aminnya bersamaan dengan Malaikat, maka dosanya yang telah lalu akan terampuni.\""
            },
            {
                "number": 788,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُمَا أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَمَّنَ الْإِمَامُ فَأَمِّنُوا فَإِنَّهُ مَنْ وَافَقَ تَأْمِينُهُ تَأْمِينَ الْمَلَائِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ قَالَ ابْنُ شِهَابٍ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ آمِينَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Sa'id bin Al Musayyib] dan [Abu Salamah bin Abdurrahman] bahwa keduanya telah mengabarkan dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila seorang imam mengucapkan \"Amin\" maka ucapkanlah \"Amin\" barangsiapa yang bacaan aminnya bersamaan dengan Malaikat, maka dosa-dosanya yang telah lalu akan terampuni.\" Ibnu Syihab mengatakan; \"Rasulullah shallallahu 'alaihi wasallam juga mengucapkan amiin.\""
            },
            {
                "number": 789,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ بْنِ رَاهَوَيْهِ أَخْبَرَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَاصِمٍ عَنْ أَبِي عُثْمَانَ عَنْ بِلَالٍ أَنَّهُ قَالَيَا رَسُولَ اللَّهِ لَا تَسْبِقْنِي بِآمِينَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim bin Rahawaih] telah mengabarkan kepada kami [Waki'] dari [Sufyan] dari ['Ashim] dari [Abu Utsman] dari [Bilal] bahwa dia berkata; \"Wahai Rasulullah, janganlah anda mendahului kami dengan ucapan amin.\""
            },
            {
                "number": 790,
                "arab": "حَدَّثَنَا الْوَلِيدُ بْنُ عُتْبَةَ الدِّمَشْقِيُّ وَمَحْمُودُ بْنُ خَالِدٍ قَالَا حَدَّثَنَا الْفِرْيَابِيُّ عَنْ صُبَيْحِ بْنِ مُحْرِزٍ الْحِمْصِيِّ حَدَّثَنِي أَبُو مُصَبِّحٍ الْمَقْرَائِيُّ قَالَكُنَّا نَجْلِسُ إِلَى أَبِي زُهَيْرٍ النُّمَيْرِيِّ وَكَانَ مِنْ الصَّحَابَةِ فَيَتَحَدَّثُ أَحْسَنَ الْحَدِيثِ فَإِذَا دَعَا الرَّجُلُ مِنَّا بِدُعَاءٍ قَالَ اخْتِمْهُ بِآمِينَ فَإِنَّ آمِينَ مِثْلُ الطَّابَعِ عَلَى الصَّحِيفَةِ قَالَ أَبُو زُهَيْرٍ أُخْبِرُكُمْ عَنْ ذَلِكَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَأَتَيْنَا عَلَى رَجُلٍ قَدْ أَلَحَّ فِي الْمَسْأَلَةِ فَوَقَفَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَمِعُ مِنْهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْجَبَ إِنْ خَتَمَ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ بِأَيِّ شَيْءٍ يَخْتِمُ قَالَ بِآمِينَ فَإِنَّهُ إِنْ خَتَمَ بِآمِينَ فَقَدْ أَوْجَبَ فَانْصَرَفَ الرَّجُلُ الَّذِي سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَى الرَّجُلَ فَقَالَ اخْتِمْ يَا فُلَانُ بِآمِينَ وَأَبْشِرْ وَهَذَا لَفْظٌ مَحْمُودٌقَالَ أَبُو دَاوُد الْمَقْرَاءُ قَبِيلٌ مِنْ حِمْيَرَ",
                "id": "Telah menceritakan kepada kami [Al Walid bin 'Utbah Ad Dimasyqi] dan [Mahmud bin Khalid] keduanya berkata; telah menceritakan kepadaku [Al Firyabi] dari [Shubaih bin Muhriz Al Himshi] telah menceritakan kepadaku [Abu Mushabbih Al Maqra`i] dia berkata; \"Kami bermajlis kepada [Abu Zuhair An Numairi] -dia termasuk salah seorang sahabat-, dia berbicara kepada kami dengan pembicaraan yang bagus: apabila seseorang dari kami berdo'a maka dia berkata: \"Tutuplah dengan \"Amiin\" karena \"amiin\" seperti setempel pada lembaran.\" Abu Zuhair berkata; aku beritahukan kalian tentang itu; \"Pada suatu malam, kami keluar bersama Rasulullah shallallahu 'alaihi wasallam, lalu kami menemui seseorang yang bersungguh-sungguh dalam meminta (berdo'a), maka Nabi shallallahu 'alaihi wasallam berhenti untuk mendengarkan ucapan orang tersebut, lalu beliau bersabda: \"(Do'anya) akan dikabulkan apabila ditutup.\" Seseorang betanya; \"Dengan apa ia menutupnya? Beliau menjawab: \"Dengan \"amiin\" sesungguhnya apabila dia menutupnya dengan \"amiin\" pasti (do'nay) akan dikabulkan.\" Orang yang bertanya tadi pergi dan bergegas menemui orang yang berdo'a tadi sambil mengatakan: \"Wahai fulan, tutuplah do'a kamu dengan \"amiin\" ini adalah kabar gembira!.\" Lafdz hadits ini dari Mahmud. Abu Daud berkata; Al Maqra` merupakan salah satu kabilah Himyar. "
            },
            {
                "number": 791,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّسْبِيحُ لِلرِّجَالِ وَالتَّصْفِيقُ لِلنِّسَاءِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tasbih (mengucapkan subhanallah) untuk laki-laki dan tepuk tangan untuk wanita.\""
            },
            {
                "number": 792,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي حَازِمِ بْنِ دِينَارٍ عَنْ سَهْلِ بْنِ سَعْدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَهَبَ إِلَى بَنِي عَمْرِو بْنِ عَوْفٍ لِيُصْلِحَ بَيْنَهُمْ وَحَانَتْ الصَّلَاةُ فَجَاءَ الْمُؤَذِّنُ إِلَى أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَقَالَ أَتُصَلِّي بِالنَّاسِ فَأُقِيمَ قَالَ نَعَمْ فَصَلَّى أَبُو بَكْرٍ فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ فِي الصَّلَاةِ فَتَخَلَّصَ حَتَّى وَقَفَ فِي الصَّفِّ فَصَفَّقَ النَّاسُ وَكَانَ أَبُو بَكْرٍ لَا يَلْتَفِتُ فِي الصَّلَاةِ فَلَمَّا أَكْثَرَ النَّاسُ التَّصْفِيقَ الْتَفَتَ فَرَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَشَارَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ امْكُثْ مَكَانَكَ فَرَفَعَ أَبُو بَكْرٍ يَدَيْهِ فَحَمِدَ اللَّهَ عَلَى مَا أَمَرَهُ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ ذَلِكَ ثُمَّ اسْتَأْخَرَ أَبُو بَكْرٍ حَتَّى اسْتَوَى فِي الصَّفِّ وَتَقَدَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا انْصَرَفَ قَالَ يَا أَبَا بَكْرٍ مَا مَنَعَكَ أَنْ تَثْبُتَ إِذْ أَمَرْتُكَ قَالَ أَبُو بَكْرٍ مَا كَانَ لِابْنِ أَبِي قُحَافَةَ أَنْ يُصَلِّيَ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لِي رَأَيْتُكُمْ أَكْثَرْتُمْ مِنْ التَّصْفِيحِ مَنْ نَابَهُ شَيْءٌ فِي صَلَاتِهِ فَلْيُسَبِّحْ فَإِنَّهُ إِذَا سَبَّحَ الْتُفِتَ إِلَيْهِ وَإِنَّمَا التَّصْفِيحُ لِلنِّسَاءِقَالَ أَبُو دَاوُد وَهَذَا فِي الْفَرِيضَةِ حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ كَانَ قِتَالٌ بَيْنَ بَنِي عَمْرِو بْنِ عَوْفٍ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَاهُمْ لِيُصْلِحَ بَيْنَهُمْ بَعْدَ الظُّهْرِ فَقَالَ لِبِلَالٍ إِنْ حَضَرَتْ صَلَاةُ الْعَصْرِ وَلَمْ آتِكَ فَمُرْ أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ فَلَمَّا حَضَرَتْ الْعَصْرُ أَذَّنَ بِلَالٌ ثُمَّ أَقَامَ ثُمَّ أَمَرَ أَبَا بَكْرٍ فَتَقَدَّمَ قَالَ فِي آخِرِهِ إِذَا نَابَكُمْ شَيْءٌ فِي الصَّلَاةِ فَلْيُسَبِّحْ الرِّجَالُ وَلْيُصَفِّحْ النِّسَاءُ حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا الْوَلِيدُ عَنْ عِيسَى بْنِ أَيُّوبَ قَالَ قَوْلُهُ التَّصْفِيحُ لِلنِّسَاءِ تَضْرِبُ بِأُصْبُعَيْنِ مِنْ يَمِينِهَا عَلَى كَفِّهَا الْيُسْرَى",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abu Hazim bin Dinar] dari [Sahl bin Sa'd] bahwa Rasulullah shallallahu 'alaihi wasallam pernah berkunjung kepada Bani 'Amr bin 'Auf untuk mendamaikan perselisihan yang terjadi di antara mereka, sementara waktu sholat telah tiba. Mu'adzin datang menemui Abu Bakar radliallahu 'anhu, lalu berkata; \"Inginkah anda mengimami orang-orang, nanti aku akan kumandangkan iqamah.\" Abu Bakar menjawab; \"Ya, ' Abu Bakar mengerjakan sholat, lalu Rasulullah shallallahu 'alaihi wasallam datang, dan orang-orang pun tengah mengerjakan sholat, lalu beliau menelusuri shaf sampai sampai beliau berdiri dalam shaf, lalu orang-orang bertepuk tangan, tapi Abu Bakar tetap saja tidak menoleh dalam sholat. setelah banyak orang yang bertepuk tangan, baru dia menoleh dan langsung melihat Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallallahu 'alaihi wasallam memberi isyarat kepadanya supaya tetap di tempat, namun Abu Bakar mengangkat kedua tangannya (sebagai isyarat untuk menolak), seraya memuji kepada Allah atas apa yang di perintahkan oleh Rasulullah shallallahu 'alaihi wasallam kepadanya. Setelah itu Abu Bakar mundur, sampai berdiri lurus dengan shaf, maka Rasulullah shallallahu 'alaihi wasallam maju (sebagai imam). Selesai sholat, beliau bersabda: \"Apakah yang menghalangimu tidak mau tetap berada di tempat (jadi imam) sewaktu aku perintahkan?\" Abu Bakar menjawab; \"Tidak layak bagi anak Abu Quhafah mengerjakan sholat di depan Rasulullah shallallahu 'alaihi wasallam.\" Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: 'Kenapa aku melihat kalian bertepuk tangan? Barangsiapa terjadi sesuatu (kesalahan) pada dirinya dalam sholat, maka bacalah tasbih, sebab apabila dia telah membaca tasbih, orang lain akan menoleh kepadanya, dan tepuk tangan hanya bagi kaum wanita.\" Abu Daud berkata; \"Ini kalau dalam sholat fardlu.\" Telah menceritakan kepada kami ['Amru bin 'Aun] telah mengabarkan kepada kami [Hammad bin Zaid] dari [Abu Hazim] dari [Sahl bin Sa'd] dia berkata; \"Pernah terjadi suatu persengketaan di kalangan Bani 'Amru bin 'Auf, lalu berita itu sampai kepada Nabi shallallahu 'alaihi wasallam, lantas beliau menemui mereka setelah sholat Dzuhur untuk mendamaikan mereka. beliau bersabda kepada Bilal: \"Apabila waktu sholat ashar telah tiba, sedang aku belum datang kepadamu, maka suruhlah Abu Bakar mengerjakan sholat bersama orang-orang.\" Setelah waktu Ashar tiba, Bilal mengumandangkan adzan dan menyerukan iqamah, setelah itu menyuruh Abu Bakar untuk maju (jadi imam).\" Pada akhir hadits ini, beliau bersabda: \"apabila terjadi sesuatu padamu dalam sholat, hendaklah kaum laki-laki membaca tasbih dan kaum wanita bertepuk tangan.\" Telah menceritakan kepada kami Mahmud bin Khalid telah menceritakan kepada kami Al Walid dari Isa bin Ayyub dia berkata; sabdanya: \"Bertepuk tangan bagi kaum wanita\" yaitu; menepukan dua jari-jarinya yang sebelah kanan di atas telapak tangan kirinya.\""
            },
            {
                "number": 793,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ شَبُّوَيْهِ الْمَرْوَزِيُّ وَمُحَمَّدُ بْنُ رَافِعٍ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُشِيرُ فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Syubawaih al Marwazi] dan [Muhammad bin Rafi'] keduanya berkata; telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Anas bin Malik] bahwa Nabi shallallahu 'alaihi wasallam pernah memberi isyarat dalam sholat.\""
            },
            {
                "number": 794,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ يَعْقُوبَ بْنِ عُتْبَةَ بْنِ الْأَخْنَسِ عَنْ أَبِي غَطَفَانَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّسْبِيحُ لِلرِّجَالِ يَعْنِي فِي الصَّلَاةِ وَالتَّصْفِيقُ لِلنِّسَاءِ مَنْ أَشَارَ فِي صَلَاتِهِ إِشَارَةً تُفْهَمُ عَنْهُ فَلْيَعُدْ لَهَا يَعْنِي الصَّلَاةَقَالَ أَبُو دَاوُد هَذَا الْحَدِيثُ وَهْمٌ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] telah menceritakan kepada kami [Yunus bin Bukair] dari [Muhammad bin Ishaq] dari [Ya'qub bin 'Utbah bin Al Akhnas] dari [Abu Ghathafan] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tasbih (mengucapkan Subhanallah) untuk kaum laki-laki, dan bertepuk tangan untuk kaum wanita, dan barangsiapa memberi isyarat dalam sholatnya sedangkan ia faham isyarat tersebut, hendaklah ia mengulanginya yakni sholat.\" Abu Daud mengatakan; \"Hadits ini adalah hadits wahm (tidak jelas).\""
            },
            {
                "number": 795,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي الْأَحْوَصِ شَيْخٌ مِنْ أَهْلِ الْمَدِينَةِ أَنَّهُ سَمِعَ أَبَا ذَرٍّ يَرْوِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَامَ أَحَدُكُمْ إِلَى الصَّلَاةِ فَإِنَّ الرَّحْمَةَ تُوَاجِهُهُ فَلَا يَمْسَحْ الْحَصَى",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Abu Al Ahwash] -seorang syaikh dari penduduk Madinah- bahwa dia mendengar [Abu Dzar] meriwayatkan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila salah seseorang dari kalian sedang mengerjakan sholat, maka rahmat berada di hadapannya, oleh karena itu janganlah ia menyingkirkan kerikil yang ada di hadapannya!.\""
            },
            {
                "number": 796,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ مُعَيْقِيبٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَمْسَحْ وَأَنْتَ تُصَلِّي فَإِنْ كُنْتَ لَا بُدَّ فَاعِلًا فَوَاحِدَةٌ تَسْوِيَةَ الْحَصَى",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] dari [Yahya] dari [Abu Salamah] dari [Mu'aiqib] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kamu mengusap (kerikil) sementara kamu sedang sholat, namun apabila kamu terpaksa melakukan hal itu, maka cukuplah kamu meratakannya sekali.\""
            },
            {
                "number": 797,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ كَعْبٍ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ هِشَامٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الِاخْتِصَارِ فِي الصَّلَاةِقَالَ أَبُو دَاوُد يَعْنِي يَضَعُ يَدَهُ عَلَى خَاصِرَتِهِ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Ka'b] telah menceritakan kepada kami [Muhammad bin Salamah] dari [Hisyam] dari [Muhammad bin Sirin] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam melarang bertolak pinggang dalam sholat.\" Abu Daud mengatakan; \"Maksudnya meletakkan tangan di pinggangnya.\""
            },
            {
                "number": 798,
                "arab": "حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ عَبْدِ الرَّحْمَنِ الْوَابِصِيُّ حَدَّثَنَا أَبِي عَنْ شَيْبَانَ عَنْ حُصَيْنِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ هِلَالِ بْنِ يَسَافٍ قَالَقَدِمْتُ الرَّقَّةَ فَقَالَ لِي بَعْضُ أَصْحَابِي هَلْ لَكَ فِي رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُلْتُ غَنِيمَةٌ فَدَفَعْنَا إِلَى وَابِصَةَ قُلْتُ لِصَاحِبِي نَبْدَأُ فَنَنْظُرُ إِلَى دَلِّهِ فَإِذَا عَلَيْهِ قَلَنْسُوَةٌ لَاطِئَةٌ ذَاتُ أُذُنَيْنِ وَبُرْنُسُ خَزٍّ أَغْبَرُ وَإِذَا هُوَ مُعْتَمِدٌ عَلَى عَصًا فِي صَلَاتِهِ فَقُلْنَا بَعْدَ أَنْ سَلَّمْنَا فَقَالَ حَدَّثَتْنِي أُمُّ قَيْسٍ بِنْتُ مِحْصَنٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا أَسَنَّ وَحَمَلَ اللَّحْمَ اتَّخَذَ عَمُودًا فِي مُصَلَّاهُ يَعْتَمِدُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Abdussalam bin Abdurrahman al wabishi] telah menceritakan kepada kami [ayahku] dari [Syaiban] dari [Hushain bin Abdurrahman] dari [Hilal bin Yasaf] dia berkata; \"Aku pergi ke negeri Raqqah, lalu sebagian sahabatku berkata kepadaku; \"Apakah kamu mempunyai keinginan untuk bertemu salah seorang sahabat Rasulullah shallallahu 'alaihi wasallam?\" Hilal berkata; jawabku: \"ya! ini suatu keberuntungan, \" lalu kami menuju [Wabishah] (seorang sahabat Rasulullah), aku berkata kepada sahabatku; \"Kita mulai pandangi dulu karakternya, ternyata dia mengenakan peci bertelinga dua yang selalu melekat dan mengenakan jubah yang bertopi yang terbuat dari bahan sutera berwarna abu-abu, dan dia tengah mengerjakan sholat sambil bersandar kepada tongkatnya. Kami tanyakan hal itu kepadanya setelah kami memberi salam, dia menjawab: \" [Ummu Qais binti Mihshan] pernah menyampaikan kepadaku, bahwa setelah berusia lanjut dan lemah Rasulullah shallallahu 'alaihi wasallam membuat tiang di tempat sholatnya untuk bersandar.\""
            },
            {
                "number": 799,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا إِسْمَعِيلُ بْنُ أَبِي خَالِدٍ عَنْ الْحَارِثِ بْنِ شُبَيْلٍ عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ عَنْ زَيْدِ بْنِ أَرْقَمَ قَالَكَانَ أَحَدُنَا يُكَلِّمُ الرَّجُلَ إِلَى جَنْبِهِ فِي الصَّلَاةِ فَنَزَلَتْ{ وَقُومُوا لِلَّهِ قَانِتِينَ }فَأُمِرْنَا بِالسُّكُوتِ وَنُهِينَا عَنْ الْكَلَامِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Isma'il bin Abu Khalid] dari [Al Harits bin Syubail] dari [Abu 'Amru As Syaibani] dari [Zaid bin Arqam] dia berkata; \"Salah seorang dari kami pernah mengajak bicara kepada orang yang ada di sampingnya ketika sholat, lalu turunlah ayat; \"WA QUUMUU LILLAAHI QAANITIIN (berdirilah karena Allah (dalam sholatmu) dengan khusyu') QS Al Baqarah; 238. maka kami di perintahkan untuk diam dan di larang untuk berbicara.\""
            },
            {
                "number": 800,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ قُدَامَةَ بْنِ أَعْيَنَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ هِلَالٍ يَعْنِي ابْنَ يَسَافٍ عَنْ أَبِي يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ حُدِّثْتُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ الرَّجُلِ قَاعِدًا نِصْفُ الصَّلَاةِ فَأَتَيْتُهُ فَوَجَدْتُهُ يُصَلِّي جَالِسًا فَوَضَعْتُ يَدَيَّ عَلَى رَأْسِي فَقَالَ مَا لَكَ يَا عَبْدَ اللَّهِ بْنَ عَمْرٍو قُلْتُ حُدِّثْتُ يَا رَسُولَ اللَّهِ أَنَّكَ قُلْتَ صَلَاةُ الرَّجُلِ قَاعِدًا نِصْفُ الصَّلَاةِ وَأَنْتَ تُصَلِّي قَاعِدًا قَالَ أَجَلْ وَلَكِنِّي لَسْتُ كَأَحَدٍ مِنْكُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Qudamah bin A'yan] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Hilal yaitu Ibnu Yasaf] dari [Abu Yahya] dari [Abdullah bin 'Amru] dia berkata; pernah di sampaikan kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholatnya seseorang dengan duduk itu mendapatkan pahala separuh sholat.\" Maka aku pergi menemui beliau dan aku dapati beliau tengah mengerjakan sholat dengan duduk, maka aku meletakkan kedua tangan di atas kepalaku, maka beliau bersabda: \"Kenapa denganmu wahai Abdullah bin 'Amru?\" jawabku; \"Telah sampai kepadaku wahai Rasulullah, bahwa anda bersabda: \"sholatnya seseorang dengan duduk itu mendapatkan pahala separuh sholat, sementara anda mengerjakan sholat dengan posisi duduk.\" beliau bersabda: \"Benar, akan tetapi aku tidak sebagaimana salah seorang dari kalian.\""
            },
            {
                "number": 801,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ الرَّجُلِ قَاعِدًا فَقَالَ صَلَاتُهُ قَائِمًا أَفْضَلُ مِنْ صَلَاتِهِ قَاعِدًا وَصَلَاتُهُ قَاعِدًا عَلَى النِّصْفِ مِنْ صَلَاتِهِ قَائِمًا وَصَلَاتُهُ نَائِمًا عَلَى النِّصْفِ مِنْ صَلَاتِهِ قَاعِدًا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Husain Al Mu'allim] dari [Abdullah bin Buraidah] dari [Imran bin Hushain] bahwa dia bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai sholatnya seseorang dengan duduk.\" beliau bersabda: \"sholatnya seseorang dengan berdiri itu lebih utama dari sholatnya seseorang dengan duduk, dan sholatnya seseorang dengan duduk itu mendapatkan separuh pahala dari sholat dengan berdiri, dan sholatnya seseorang dengan tidur itu mendapatkan pahala separuh dari sholat dengan duduk.\""
            },
            {
                "number": 802,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا وَكِيعٌ عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ ابْنِ بُرَيْدَةَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَكَانَ بِي النَّاصُورُ فَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ صَلِّ قَائِمًا فَإِنْ لَمْ تَسْتَطِعْ فَقَاعِدًا فَإِنْ لَمْ تَسْتَطِعْ فَعَلَى جَنْبٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] telah menceritakan kepada kami [Waki'] dari [Ibrahim bin Thahman] dari [Husain Al Mu'allim] dari [Ibnu Buraidah] dari [Imran bin Hushain] dia berkata; \"Aku menderita penyakit wasir, lalu aku tanyakan hal itu kepada Nabi shallallahu 'alaihi wasallam, maka beliau bersabda: \"sholatlah dengan berdiri, dan apabila kamu tidak mampu, maka dengan duduk, jika tidak mampu, maka dengan berbaring.\""
            },
            {
                "number": 803,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي شَيْءٍ مِنْ صَلَاةِ اللَّيْلِ جَالِسًا قَطُّ حَتَّى دَخَلَ فِي السِّنِّ فَكَانَ يَجْلِسُ فِيهَا فَيَقْرَأُ حَتَّى إِذَا بَقِيَ أَرْبَعُونَ أَوْ ثَلَاثُونَ آيَةً قَامَ فَقَرَأَهَا ثُمَّ سَجَدَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdullah bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Hisyam bin 'Urwah] dari ['Urwah] dari [Aisyah] dia berkata; \"Aku tidak pernah melihat sama sekali Rasulullah shallallahu 'alaihi wasallam membaca dalam sholat malam sambil duduk sehingga beliau memasuki usia lanjut, di masa itu, barulah beliau membaca sambil duduk, apabila ayat yang belum di baca tinggal sekitar empat puluh atau tiga puluh ayat, beliau membacanya sambil berdiri kemudian sujud.\""
            },
            {
                "number": 804,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ وَأَبِي النَّضْرِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي جَالِسًا فَيَقْرَأُ وَهُوَ جَالِسٌ وَإِذَا بَقِيَ مِنْ قِرَاءَتِهِ قَدْرُ مَا يَكُونُ ثَلَاثِينَ أَوْ أَرْبَعِينَ آيَةً قَامَ فَقَرَأَهَا وَهُوَ قَائِمٌ ثُمَّ رَكَعَ ثُمَّ سَجَدَ ثُمَّ يَفْعَلُ فِي الرَّكْعَةِ الثَّانِيَةِ مِثْلَ ذَلِكَقَالَ أَبُو دَاوُد رَوَاهُ عَلْقَمَةُ بْنُ وَقَّاصٍ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abdullah bin Yazid] dan [Abu An Nadlr] dari [Abu Salamah bin Abdurrahman] dari [Aisyah istri Nabi shallallahu 'alaihi wasallam] bahwa Nabi shallallahu 'alaihi wasallam sholat dengan duduk, beliau membaca sambil duduk. dan apabila bacaan beliau tinggal sekitar tiga puluh atau empat puluh ayat, maka beliau berdiri dan membacanya sambil berdiri, kemudian beliau ruku' lalu sujud, beliau mengerjakan seperti itu pada raka'at yang kedua.\" Abu Daud mengatakan; \"Hadits ini juga di riwayatkan oleh ['Alqamah bin Waqash] dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas.\""
            },
            {
                "number": 805,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ قَالَ قَالَ سَمِعْتُ بُدَيْلَ بْنَ مَيْسَرَةَ وَأَيُّوبَ يُحَدِّثَانِ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا وَلَيْلًا طَوِيلًا قَاعِدًا فَإِذَا صَلَّى قَائِمًا رَكَعَ قَائِمًا وَإِذَا صَلَّى قَاعِدًا رَكَعَ قَاعِدًا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Hammad bin Zaid] dia berkata; saya mendengar [Budail bin Maisarah] dan [Ayyub] keduanya menceritakan dari [Abdullah bin Syaqiq] dari [Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa mengerjakan sholat beberapa malam dengan berdiri dan beberapa malam dengan duduk, apabila beliau mengerjakan sholat dengan berdiri, maka beliau ruku' dalam keadaan berdiri, dan apabila beliau mengerjakan sholat dengan duduk, maka beliau ruku' dengan posisi duduk.\""
            },
            {
                "number": 806,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا كَهْمَسُ بْنُ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَ سَأَلْتُ عَائِشَةَأَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ السُّورَةَ فِي رَكْعَةٍ قَالَتْ الْمُفَصَّلَ قَالَ قُلْتُ فَكَانَ يُصَلِّي قَاعِدًا قَالَتْ حِينَ حَطَمَهُ النَّاسُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Kahmas bin Al Hasan] dari [Abdullah bin Syaqiq] dia berkata; saya bertanya kepada [Aisyah]; \"Apakah Rasulullah shallallahu 'alaihi wasallam membaca surat dalam satu raka'at?\" Aisyah menjawab; \"(ya) Surat Al Mufashal (Qaaf, atau Al Hujurat hingga akhir al-qur'an).\" Abdullah bin Syaqiq berkata; tanyaku; \"Apakah beliau juga pernah sholat dengan duduk?\" jawabnya; \"Ketika beliau memasuki usia lanjut.\""
            },
            {
                "number": 807,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَقُلْتُ لَأَنْظُرَنَّ إِلَى صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ يُصَلِّي فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَقْبَلَ الْقِبْلَةَ فَكَبَّرَ فَرَفَعَ يَدَيْهِ حَتَّى حَاذَتَا بِأُذُنَيْهِ ثُمَّ أَخَذَ شِمَالَهُ بِيَمِينِهِ فَلَمَّا أَرَادَ أَنْ يَرْكَعَ رَفَعَهُمَا مِثْلَ ذَلِكَ قَالَ ثُمَّ جَلَسَ فَافْتَرَشَ رِجْلَهُ الْيُسْرَى وَوَضَعَ يَدَهُ الْيُسْرَى عَلَى فَخِذِهِ الْيُسْرَى وَحَدَّ مِرْفَقَهُ الْأَيْمَنَ عَلَى فَخِذِهِ الْيُمْنَى وَقَبَضَ ثِنْتَيْنِ وَحَلَّقَ حَلْقَةً وَرَأَيْتُهُ يَقُولُ هَكَذَا وَحَلَّقَ بِشْرٌ الْإِبْهَامَ وَالْوُسْطَى وَأَشَارَ بِالسَّبَّابَةِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Bisyr bin Al Mufadlal] dari ['Ashim bin Kulaib] dari [ayahnya] dari [Wa'il bin Hujr] dia berkata; kataku; \"Sungguh aku melihat bagaimana tata cara sholat Rasulullah shallallahu 'alaihi wasallam!.\" yaitu Rasulullah shallallahu 'alaihi wasallam berdiri, lalu menghadap kiblat, bertakbir, mengangkat kedua tangan sehingga sejajar dengan kedua telinga, setelah itu tangan kanan beliau memegang tangan kirinya, sewaktu beliau hendak ruku', beliau mengangkat kedua tangannya seperti tadi.\" Katanya melanjutkan; \"Kemudian beliau duduk, yaitu menduduki kaki kirinya dan meletakkan tangan kiri di atas paha kirinya sambil merenggangkan siku yang kanan terhadap paha sebelah kanan dan menggenggam kedua jari (kelingking dan manis) dan membentuk suatu lingkaran. Aku melihat beliau melakukan seperti ini Bisyr membentuk lingkaran dengan ibu jari dan jari tengah serta menunjuk dengan jari telunjuk.\""
            },
            {
                "number": 808,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَسُنَّةُ الصَّلَاةِ أَنْ تَنْصِبَ رِجْلَكَ الْيُمْنَى وَتَثْنِيَ رِجْلَكَ الْيُسْرَى",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Abdurrahman bin Al Qasim] dari [Abdullah bin Abdullah] dari [Abdullah bin Umar] dia berkata; \"Di antara sunnah dalam sholat adalah kamu menegakkan kaki kananmu dan melipat kaki kirimu (dalam posisi duduk).\""
            },
            {
                "number": 809,
                "arab": "حَدَّثَنَا ابْنُ مُعَاذٍ حَدَّثَنَا عَبْدُ الْوَهَّابِ قَالَ سَمِعْتُ يَحْيَى قَالَ سَمِعْتُ الْقَاسِمَ يَقُولُ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُمِنْ سُنَّةِ الصَّلَاةِ أَنْ تُضْجِعَ رِجْلَكَ الْيُسْرَى وَتَنْصِبَ الْيُمْنَىحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ يَحْيَى بِإِسْنَادِهِ مِثْلَهُ قَالَ أَبُو دَاوُد قَالَ حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى أَيْضًا مِنْ السُّنَّةِ كَمَا قَالَ جَرِيرٌ حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّ الْقَاسِمَ بْنَ مُحَمَّدٍ أَرَاهُمْ الْجُلُوسَ فِي التَّشَهُّدِ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Ibnu Mu'adz] telah menceritakan kepada kami [Abdul Wahab] dia berkata; saya mendengar [Yahya] berkata; saya mendengar [Al Qasim] berkata; telah mengabarkan kepadaku [Abdullah bin Abdullah] bahwa dia mendengar [Abdullah bin Umar] berkata; \"Di antara sunnah sholat adalah kamu baringkan kaki kirimu dan menegakkan kaki kanan.\" Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Yahya] dengan isnad seperti di atas, dia berkata; Abu Daud berkata; [Hammad bin Zaid] berkata; dari [Yahya] juga (katanya); \"Di antara sunnah…\" sebagaimana perkataan Jarir. Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Yahya bin Sa'id] bahwa [Al Qasim bin Muhammad] pernah memperlihatkan kepada mereka (cara) duduk tasyahud…\" lalu dia menyebutkan hadits tersebut.\""
            },
            {
                "number": 810,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ وَكِيعٍ عَنْ سُفْيَانَ عَنْ الزُّبَيْرِ بْنِ عَدِيٍّ عَنْ إِبْرَاهِيمَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَلَسَ فِي الصَّلَاةِ افْتَرَشَ رِجْلَهُ الْيُسْرَى حَتَّى اسْوَدَّ ظَهْرُ قَدَمِهِ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sarri] dari [Waki'] dari [Sufyan] dari [Az Zubair bin 'Adi] dari [Ibrahim] dia berkata; \"Apabila Nabi shallallahu 'alaihi wasallam duduk pada waktu sholat, maka telapak kaki kirinya beliau duduki hingga bagian atas kakinya menjadi hitam.\""
            },
            {
                "number": 811,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا أَبُو عَاصِمٍ الضَّحَّاكُ بْنُ مَخْلَدٍ أَخْبَرَنَا عَبْدُ الْحَمِيدِ يَعْنِي ابْنَ جَعْفَرٍ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى حَدَّثَنَا عَبْدُ الْحَمِيدِ يَعْنِي ابْنَ جَعْفَرٍ حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي حُمَيْدٍ السَّاعِدِيِّ قَالَ سَمِعْتُهُ فِي عَشَرَةٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ أَحْمَدُ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ قَالَ سَمِعْتُ أَبَا حُمَيْدٍ السَّاعِدِيَّ فِي عَشَرَةٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُمْ أَبُو قَتَادَةَقَالَ أَبُو حُمَيْدٍ أَنَا أَعْلَمُكُمْ بِصَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا فَاعْرِضْ فَذَكَرَ الْحَدِيثَ قَالَ وَيَفْتَحُ أَصَابِعَ رِجْلَيْهِ إِذَا سَجَدَ ثُمَّ يَقُولُ اللَّهُ أَكْبَرُ وَيَرْفَعُ وَيَثْنِي رِجْلَهُ الْيُسْرَى فَيَقْعُدُ عَلَيْهَا ثُمَّ يَصْنَعُ فِي الْأُخْرَى مِثْلَ ذَلِكَ فَذَكَرَ الْحَدِيثَ قَالَ حَتَّى إِذَا كَانَتْ السَّجْدَةُ الَّتِي فِيهَا التَّسْلِيمُ أَخَّرَ رِجْلَهُ الْيُسْرَى وَقَعَدَ مُتَوَرِّكًا عَلَى شِقِّهِ الْأَيْسَرِزَادَ أَحْمَدُ قَالُوا صَدَقْتَ هَكَذَا كَانَ يُصَلِّي وَلَمْ يَذْكُرَا فِي حَدِيثِهِمَا الْجُلُوسَ فِي الثِّنْتَيْنِ كَيْفَ جَلَسَ حَدَّثَنَا عِيسَى بْنُ إِبْرَاهِيمَ الْمِصْرِيُّ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ اللَّيْثِ عَنْ يَزِيدَ بْنِ مُحَمَّدٍ الْقُرَشِيِّ وَيَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ أَنَّهُ كَانَ جَالِسًا مَعَ نَفَرٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ وَلَمْ يَذْكُرْ أَبَا قَتَادَةَ قَالَ فَإِذَا جَلَسَ فِي الرَّكْعَتَيْنِ جَلَسَ عَلَى رِجْلِهِ الْيُسْرَى فَإِذَا جَلَسَ فِي الرَّكْعَةِ الْأَخِيرَةِ قَدَّمَ رِجْلَهُ الْيُسْرَى وَجَلَسَ عَلَى مَقْعَدَتِهِ حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو الْعَامِرِيِّ قَالَ كُنْتُ فِي مَجْلِسٍ بِهَذَا الْحَدِيثِ قَالَ فِيهِ فَإِذَا قَعَدَ فِي الرَّكْعَتَيْنِ قَعَدَ عَلَى بَطْنِ قَدَمِهِ الْيُسْرَى وَنَصَبَ الْيُمْنَى فَإِذَا كَانَتْ الرَّابِعَةُ أَفْضَى بِوَرِكِهِ الْيُسْرَى إِلَى الْأَرْضِ وَأَخْرَجَ قَدَمَيْهِ مِنْ نَاحِيَةٍ وَاحِدَةٍ حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ إِبْرَاهِيمَ حَدَّثَنَا أَبُو بَدْرٍ حَدَّثَنِي زُهَيْرٌ أَبُو خَيْثَمَةَ حَدَّثَنَا الْحَسَنُ بْنُ الْحُرِّ حَدَّثَنَا عِيسَى بْنُ عَبْدِ اللَّهِ بْنِ مَالِكٍ عَنْ عَبَّاسٍ أَوْ عَيَّاشِ بْنِ سَهْلٍ السَّاعِدِيِّ أَنَّهُ كَانَ فِي مَجْلِسٍ فِيهِ أَبُوهُ فَذَكَرَ فِيهِ قَالَ فَسَجَدَ فَانْتَصَبَ عَلَى كَفَّيْهِ وَرُكْبَتَيْهِ وَصُدُورِ قَدَمَيْهِ وَهُوَ جَالِسٌ فَتَوَرَّكَ وَنَصَبَ قَدَمَهُ الْأُخْرَى ثُمَّ كَبَّرَ فَسَجَدَ ثُمَّ كَبَّرَ فَقَامَ وَلَمْ يَتَوَرَّكْ ثُمَّ عَادَ فَرَكَعَ الرَّكْعَةَ الْأُخْرَى فَكَبَّرَ كَذَلِكَ ثُمَّ جَلَسَ بَعْدَ الرَّكْعَتَيْنِ حَتَّى إِذَا هُوَ أَرَادَ أَنْ يَنْهَضَ لِلْقِيَامِ قَامَ بِتَكْبِيرٍ ثُمَّ رَكَعَ الرَّكْعَتَيْنِ الْأُخْرَيَيْنِ فَلَمَّا سَلَّمَ سَلَّمَ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ قَالَ أَبُو دَاوُد لَمْ يَذْكُرْ فِي حَدِيثِهِ مَا ذَكَرَ عَبْدُ الْحَمِيدِ فِي التَّوَرُّكِ وَالرَّفْعِ إِذَا قَامَ مِنْ ثِنْتَيْنِ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو أَخْبَرَنِي فُلَيْحٌ أَخْبَرَنِي عَبَّاسُ بْنُ سَهْلٍ قَالَ اجْتَمَعَ أَبُو حُمَيْدٍ وَأَبُو أُسَيْدٍ وَسَهْلُ بْنُ سَعْدٍ وَمُحَمَّدُ بْنُ مَسْلَمَةَ فَذَكَرَ هَذَا الْحَدِيثَ وَلَمْ يَذْكُرْ الرَّفْعَ إِذَا قَامَ مِنْ ثِنْتَيْنِ وَلَا الْجُلُوسَ قَالَ حَتَّى فَرَغَ ثُمَّ جَلَسَ فَافْتَرَشَ رِجْلَهُ الْيُسْرَى وَأَقْبَلَ بِصَدْرِ الْيُمْنَى عَلَى قِبْلَتِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Abu 'Ashim Adl Dlahak bin Makhlad] telah mengabarkan kepada kami [Abdul Hamid yaitu Ibnu Ja'far]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Abdul Hamid yaitu Ibnu Ja'far] telah menceritakan kepadaku [Muhammad bin 'Amru] dari [Abu Humaid As Sa'idi] dia berkata; saya pernah mendengarnya berkata di tengah-tengah sepuluh sahabat Rasulullah shallallahu 'alaihi wasallam -Ahmad berkata; telah mengabarkan kepadaku Muhammad bin 'Amru bin 'Atha` dia berkata; aku mendengar Abu Humaid As Sa'idi berkata di tengah-tengah sepuluh sahabat Rasulullah shallallahu 'alaihi wasallam di antaranya adalah [Abu Qatadah], Abu Humaid berkata; \"Aku lebih mengetahui tentang sholat Rasulullah shallallahu 'alaihi wasallam.\" Mereka berkata; \"kalau demikian, jelaskanlah.\" Kemudian Abu Humaid menyebutkan hadits tersebut, katanya; \"… kemudian beliau membuka jari-jari kedua tangannya apabila sujud, lalu mengucapkan: \"Allahu Akbar\" Setelah itu, beliau mengangkat kepala dan melipat kaki kirinya serta mendudukinya, beliau mengerjakan seperti itu di raka'at yang lain.\" Kemudian dia menyebutkan lanjutan dari hadits tersebut, katanya; \"…dan ketika beliau duduk (tahiyyat) yang terdapat salam, beliau merubah posisi kaki kiri dan duduk secara tawaruk (duduk dengan posisi kaki kiri masuk ke kaki kanan) di atas betis kiri.\" Ahmad menambahkan; \"Sepuluh sahabat tersebut berkata; \"Benar kamu, demikianlah beliau biasa melaksanakan sholat.\" keduanya tidak menyebutkan dalam kedua hadits tersebut tentang cara duduk dalam rala'at kedua.\" Telah menceritakan kepada kami [Isa bin Ibrahim Al Mishri] telah menceritakan kepada kami [Ibnu Wahb] dari [Al Laits] dari [Yazid bin Muhammad Al Qurasyi] dan [Yazid bin Abu Habib] dari [Muhammad bin 'Amru bin Halhalah] dari [Muhammad bin 'Amru bin 'Atha`] bahwa dia duduk-duduk bersama dengan beberapa sahabat Rasulullah shallallahu 'alaihi wasallam…\" seperti hadits ini, namun dia tidak menyerbutkan Abu Qatadah, katanya; \"Apabila beliau duduk pada raka'at kedua, beliau duduk di atas kaki kirinya, dan apabila duduk pada raka'at terakhir, beliau memajukan kaki kirinya dan duduk di atas tempat duduknya. ' Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Yazid bin Abu Habib] dari [Muhammad bin 'Amru bin Halhalah] dari [Muhammad bin 'Amru Al 'Amiri] dia berkata; \"Aku pernah menghadiri suatu majlis…\"seperti hadits ini\" di dalam hadits tersebut, dia berkata; \"Apabila duduk pada raka'at kedua, beliau duduk di atas telapak kaki kirinya dan menegakkan kaki kanannya, dan apabila duduk di raka'at ke empat (terakhir), beliau merapatkan pantatnya ke lantai dan mengeluarkan kedua telapak kakinya dari satu arah.\" Telah menceritakan kepada kami [Ali bin Al Husain bin Ibrahim] telah menceritakan kepada kami [Abu Badr] telah menceritakan kepadaku [Zuhair Abu Khaitsamah] telah menceritakan kepada kami [Al Hasan bin Al Hurr] telah menceritakan kepada kami [Isa bin Abdullah bin Malik] dari ['Abbas atau 'Ayyasy bin Sahl As Sa'idi] bahwa dia pernah menghadiri suatu majlis yang di dalamnya terdapat ayahnya, kemudian dia menyebutkan sebagian hadits, katanya; \"Kemudian beliau sujud sambil tegak di atas telapak tangan dan kedua lututnya serta kedua telapak kakinya, kemudian beliau bertakbir dan sujud, setelah itu beliau bertakbir dan langsung berdiri tidak duduk tawaruk, kemudian beliau kembali (berdiri), kemudian beliau ruku' di raka'at yang lain (raka'at terakhir) sambil bertakbir seperti itu, kemudian beliau duduk setelah dua raka'at, sehingga ketika beliau hendak berdiri, beliau bertakbir terlebih dahulu, kemudian beliau menyempurnakan dua raka'at yang terakhir, ketika memberi salam, beliau memberi salam ke kanan dan ke arah kiri.\" Abu Daud mengatakan; \"Dalam haditsnya Isa bin Abdullah tidak disebutkan seperti apa yang di sebutkan oleh Abdul Hamid dalam duduk tawaruk dan mengangkat (tangan) apabila berdiri dari dua raka'at.\" Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Abdul Malik bin 'Amru] telah mengabarkan kepadaku [Fulaih] telah mengabarkan kepadaku ['Abbas bin Sahl] dia berkata; Abu Humaid, Abu Usaid, Sahl bin Sa'd dan Muhammad bin Maslamah pernah berkumpul…\" kemudian dia menyebutkan hadits ini, namun tidak menyebutkan tentang mengangkat (tangan) apabila berdiri dari dua raka'at dan juga pada waktu duduk\" katanya; \"Sampai beliau selesai, kemudian duduk dengan menduduki kaki kiri dan menghadapkan kiblat pada punggung kaki kanannya.\""
            },
            {
                "number": 812,
                "arab": "حَدَّثَنَا مُسَدَّدٌ أَخْبَرَنَا يَحْيَى عَنْ سُلَيْمَانَ الْأَعْمَشِ حَدَّثَنِي شَقِيقُ بْنُ سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَكُنَّا إِذَا جَلَسْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّلَاةِ قُلْنَا السَّلَامُ عَلَى اللَّهِ قَبْلَ عِبَادِهِ السَّلَامُ عَلَى فُلَانٍ وَفُلَانٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقُولُوا السَّلَامُ عَلَى اللَّهِ فَإِنَّ اللَّهَ هُوَ السَّلَامُ وَلَكِنْ إِذَا جَلَسَ أَحَدُكُمْ فَلْيَقُلْ التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ فَإِنَّكُمْ إِذَا قُلْتُمْ ذَلِكَ أَصَابَ كُلَّ عَبْدٍ صَالِحٍ فِي السَّمَاءِ وَالْأَرْضِ أَوْ بَيْنَ السَّمَاءِ وَالْأَرْضِ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ ثُمَّ لِيَتَخَيَّرْ أَحَدُكُمْ مِنْ الدُّعَاءِ أَعْجَبَهُ إِلَيْهِ فَيَدْعُوَ بِهِحَدَّثَنَا تَمِيمُ بْنُ الْمُنْتَصِرِ أَخْبَرَنَا إِسْحَقُ يَعْنِي ابْنَ يُوسُفَ عَنْ شَرِيكٍ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ قَالَ كُنَّا لَا نَدْرِي مَا نَقُولُ إِذَا جَلَسْنَا فِي الصَّلَاةِ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ عُلِّمَ فَذَكَرَ نَحْوَهُ قَالَ شَرِيكٌ وَحَدَّثَنَا جَامِعٌ يَعْنِي ابْنَ أَبِي شَدَّادٍ عَنْ أَبِي وَائِلٍ عَنْ عَبْدِ اللَّهِ بِمِثْلِهِ قَالَ وَكَانَ يُعَلِّمُنَا كَلِمَاتٍ وَلَمْ يَكُنْ يُعَلِّمُنَاهُنَّ كَمَا يُعَلِّمُنَا التَّشَهُّدَ اللَّهُمَّ أَلِّفْ بَيْنَ قُلُوبِنَا وَأَصْلِحْ ذَاتَ بَيْنِنَا وَاهْدِنَا سُبُلَ السَّلَامِ وَنَجِّنَا مِنْ الظُّلُمَاتِ إِلَى النُّورِ وَجَنِّبْنَا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَبَارِكْ لَنَا فِي أَسْمَاعِنَا وَأَبْصَارِنَا وَقُلُوبِنَا وَأَزْوَاجِنَا وَذُرِّيَّاتِنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ وَاجْعَلْنَا شَاكِرِينَ لِنِعْمَتِكَ مُثْنِينَ بِهَا قَابِلِيهَا وَأَتِمَّهَا عَلَيْنَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا الْحَسَنُ بْنُ الْحُرِّ عَنْ الْقَاسِمِ بْنِ مُخَيْمِرَةَ قَالَ أَخَذَ عَلْقَمَةُ بِيَدِي فَحَدَّثَنِي أَنَّ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ أَخَذَ بِيَدِهِ وَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ بِيَدِ عَبْدِ اللَّهِ فَعَلَّمَهُ التَّشَهُّدَ فِي الصَّلَاةِ فَذَكَرَ مِثْلَ دُعَاءِ حَدِيثِ الْأَعْمَشِ إِذَا قُلْتَ هَذَا أَوْ قَضَيْتَ هَذَا فَقَدْ قَضَيْتَ صَلَاتَكَ إِنْ شِئْتَ أَنْ تَقُومَ فَقُمْ وَإِنْ شِئْتَ أَنْ تَقْعُدَ فَاقْعُدْ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah mengabarkan kepada kami [Yahya] dari [Sulaiman Al A'masy] telah menceritakan kepadaku [Syaqiq bin Salamah] dari [Abdullah bin Mas'ud] dia berkata; \"Apabila kami selesai duduk-duduk bersama bersama Rasulullah shallallahu 'alaihi wasallam dalam sholat, maka kami ucapkan; \"As Salaamu 'alallah qabla 'ibaadihis salaam'ala fulaanin wa fulaan (selamat sejahtera bagi Allah sebelum hamba-bamba-Nya, selamat sejahtera bagi fulan dan fulan).\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mengatakan \"As Salaamu 'alaallah, karena Allah adalah dzat sumber keselamatan, akan tetapi jika salah seorang dari kalian duduk hendaklah mengucapkan; 'At Tahiyyati lillah was shalawaatu wat thayyibaat, as salaamu 'alaika ayyuhan nabiiyyu warahmatullahi wa barakaatuh as salaamu 'alaina wa 'alaa ibaadillahis shalihin (Segala kesejahteraan milik Allah semata, begitupun segala kasih-sayang dan hal-hal yang baik, selamat sejahtera kiranya terlimpah kepadamu wahai Nabi, begitupun rahmat Allah serta berkah-berkah-nya. Selamat sejahtera terlimpah pula atas kami dan atas hamba-hamba Allah yang Shalih) \" apabila kalian mengucapkan seperti ini, maka kalian dapat mencapai semua hamba yang Shalih baik yang di langit maupun yang di bumi, -atau sabdanya- di antara langit dan bumi. ' \"Asyhadu allaa ilaaha illallah wa asyhadu ann namuhammadan 'abduhu wa rasuuluh (Aku bersaksi bahwa tidak ada ilah selaian Allah, dan aku bersaksi bahwa Muhammad itu adalah hamba dan utusan-Nya) \", kemudian hendaklah salah seorang dari kalian memilih do'a yang menarik hatinya dan berdo'a dengan do'a itu.\" Telah menceritakan kepada kami [Tamim bin Al Muntashir] telah mengabarkan kepada kami [Ishaq yaitu Ibnu Yusuf] dari [Syarik] dari [Abu Ishaq] dari [Abu Al Ahwash] dari [Abdullah] dia berkata; \"Kami tidak tahu, apa yang harus kami baca ketika duduk dalam sholat, sedangkan Rasulullah shallallahu 'alaihi wasallam telah di ajari (oleh Allah) …\" kemudian dia menyebutkan hadits yang semisal itu.\" [Syarik] mengatakan; dan telah menceritakan kepada kami [Jami' yaitu ibnu Abu Syaddad] dari [Abu Wa'il] dari [Abdullah] seperti itu, katanya; \"Dan beliau telah mengajari kami beberapa kalimat, dan tidak mengajari kami kalimat-kalimat di atas sebagaimana beliau mengajari kami tasyahud, (sabdanya): \"Allahumma allif baina quluubina wa ashlih dzaata bainina wahdinaa subulus salaam wa najjinaa minad dlulumaati ilan nuur wa jannibnal fawaahisy maa dlahara minhaa wa maa bathana wa baarik lanaa fii asmaa'ina wa abshaarinaa wa quluubinaa wa azwaajinaa wa dzurriyyatinaa wa tub 'alainaa innaka anta tawwaabur rahim, wa ja'alna syaakiriin, lini'matika mutsniin bihaa qaabiliha wa atimmaha alainaa (Ya Allah, jinakkanlah antara hati kami, perbaikilah hubungan di antara kami, tunjukilah kami jalan yang lurus, selamatkanlah kami dari kegelapan menuju cahaya, hindarkanlah kami dari perbuatan keji baik yang nampak maupun yang tersembunyi, berkahilah kami pada pendengaran kami, penglihatan kami, hati kami, isteri-isteri kami dan anak cucu kami, terimalah taubat kami karena Engkau adalah dzat yang Maha penerima taubat dan Maha penyayang, jadikanlah kami dalam kelompok yang pandai bersyukur, terhadap nikmat-nikmat-Mu kami bersyukur, terimalah dan sempurnakanlah atas kami.\" Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Al Hasan bin Al Hurr] dari [Al Qasim bin Mukhaimirah] dia berkata; ['Alqamah] memegang tanganku, lalu menceritakan kepadaku bahwa [Abdullah bin Mas'ud] pernah memegang tangannya, dan Rasulullah shallallahu 'alaihi wasallam juga pernah memegang tangan Abdullah bin Mas'ud, lalu beliau mengajarinya tasyahud dalam sholat…\" kemudian dia menyebutkan seperti do'a dalam haditsnya Al A'masy, (sabdanya): \"Apabila kamu telah mengucapkan do'a tersebut atau memenuhi do'a ini, maka kamu benar-benar telah memenuhi sholatmu, jika kamu hendak berdiri, berdirilah dan jika hendak duduk, maka duduklah.\""
            },
            {
                "number": 813,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنِي أَبِي حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ سَمِعْتُ مُجَاهِدًا يُحَدِّثُ عَنْ ابْنِ عُمَرَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي التَّشَهُّدِ التَّحِيَّاتُ لِلَّهِ الصَّلَوَاتُ الطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُقَالَ قَالَ ابْنُ عُمَرَ زِدْتَ فِيهَا وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ قَالَ ابْنُ عُمَرَ زِدْتُ فِيهَا وَحْدَهُ لَا شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah menceritakan kepadaku [ayahku] telah menceritakan kepada kami [Syu'bah] dari [Abu Bisyr] aku mendengar [Mujahid] menceritakan dari [Ibnu Umar] dari Rasulullah shallallahu 'alaihi wasallam tentang tasyahud, yaitu: \"Attahiyyatu lillah Asshalawatut-thayyibat Assalamu 'alaika ayyuhannabiyyu warahmatullahi wabarakatuh\" Ibnu Umar berkata bahwa aku menambahkan \"wabarakatuh assalamu 'alaina wa'ala 'ibadillahis-shalihin Asyhadu alla ilaha illallah\" Ibnu Umar berkata bahwa aku menambahkan \"wahdahu la syarikalah wa asyhadu anna muhammadan abduhu warasuluhu\" (Segala penghormatan dan kebaktian yang baik hanya bagi Allah, kesejahteraan, rahmat Allah dan berkah-Nya tetap terlimpah kepadamu wahai Nabi, semoga kesejahteraan atas kami dan hamba-hamba Allah yang Shalih, aku bersaksi tidak ada ilah (yang berhak di sembah) kecuali Allah, tidak ada sekutu bagi-Nya, dan aku bersaksi bahwa Muhammad adalah Rasulullah).\""
            },
            {
                "number": 814,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ ح و حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ يُونُسَ بْنِ جُبَيْرٍ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ الرَّقَاشِيِّ قَالَصَلَّى بِنَا أَبُو مُوسَى الْأَشْعَرِيُّ فَلَمَّا جَلَسَ فِي آخِرِ صَلَاتِهِ قَالَ رَجُلٌ مِنْ الْقَوْمِ أُقِرَّتْ الصَّلَاةُ بِالْبِرِّ وَالزَّكَاةِ فَلَمَّا انْفَتَلَ أَبُو مُوسَى أَقْبَلَ عَلَى الْقَوْمِ فَقَالَ أَيُّكُمْ الْقَائِلُ كَلِمَةَ كَذَا وَكَذَا قَالَ فَأَرَمَّ الْقَوْمُ فَقَالَ أَيُّكُمْ الْقَائِلُ كَلِمَةَ كَذَا وَكَذَا فَأَرَمَّ الْقَوْمُ قَالَ فَلَعَلَّكَ يَا حِطَّانُ أَنْتَ قُلْتَهَا قَالَ مَا قُلْتُهَا وَلَقَدْ رَهِبْتُ أَنْ تَبْكَعَنِي بِهَا قَالَ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ أَنَا قُلْتُهَا وَمَا أَرَدْتُ بِهَا إِلَّا الْخَيْرَ فَقَالَ أَبُو مُوسَى أَمَا تَعْلَمُونَ كَيْفَ تَقُولُونَ فِي صَلَاتِكُمْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَنَا فَعَلَّمَنَا وَبَيَّنَ لَنَا سُنَّتَنَا وَعَلَّمَنَا صَلَاتَنَا فَقَالَ إِذَا صَلَّيْتُمْ فَأَقِيمُوا صُفُوفَكُمْ ثُمَّ لِيَؤُمَّكُمْ أَحَدُكُمْ فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا قَرَأَ{ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ }فَقُولُوا آمِينَ يُحِبُّكُمْ اللَّهُ وَإِذَا كَبَّرَ وَرَكَعَ فَكَبِّرُوا وَارْكَعُوا فَإِنَّ الْإِمَامَ يَرْكَعُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتِلْكَ بِتِلْكَ وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا اللَّهُمَّ رَبَّنَا وَلَكَ الْحَمْدُ يَسْمَعُ اللَّهُ لَكُمْ فَإِنَّ اللَّهَ تَعَالَى قَالَ عَلَى لِسَانِ نَبِيِّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ وَإِذَا كَبَّرَ وَسَجَدَ فَكَبِّرُوا وَاسْجُدُوا فَإِنَّ الْإِمَامَ يَسْجُدُ قَبْلَكُمْ وَيَرْفَعُ قَبْلَكُمْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتِلْكَ بِتِلْكَ فَإِذَا كَانَ عِنْدَ الْقَعْدَةِ فَلْيَكُنْ مِنْ أَوَّلِ قَوْلِ أَحَدِكُمْ أَنْ يَقُولَ التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ لِلَّهِ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ لَمْ يَقُلْ أَحْمَدُ وَبَرَكَاتُهُ وَلَا قَالَ وَأَشْهَدُ قَالَ وَأَنَّ مُحَمَّدًاحَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ أَبِي حَدَّثَنَا قَتَادَةُ عَنْ أَبِي غَلَّابٍ يُحَدِّثُهُ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ الرَّقَاشِيِّ بِهَذَا الْحَدِيثِ زَادَ فَإِذَا قَرَأَ فَأَنْصِتُوا وَقَالَ فِي التَّشَهُّدِ بَعْدَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ زَادَ وَحْدَهُ لَا شَرِيكَ لَهُ قَالَ أَبُو دَاوُد وَقَوْلُهُ فَأَنْصِتُوا لَيْسَ بِمَحْفُوظٍ لَمْ يَجِئْ بِهِ إِلَّا سُلَيْمَانُ التَّيْمِيُّ فِي هَذَا الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami ['Amru bin 'Aun] telah mengabarkan kepada kami [Abu 'Awanah] dari [Qatadah]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Yunus bin Jubair] dari [Hithan bin Abdullah Ar Raqasyi] dia berkata; \"Abu Musa al Asy'ari sholat bersama kami, ketika dia duduk di akhir sholatnya, tiba-tiba seorang laki-laki dari suatu kaum berteriak, katanya; \"sholat itu telah di tetapkan dengan amal kebaikan dan zakat.\" Ketika Abu Musa selesai dari sholat, dia menemui kaum tersebut tersebut seraya berkata; \"Siapakah di antara kalian tadi yang berkata demikian dan demikian?\" Hithan melanjutkan; \"Maka kaum tersebut diam menunduk. Abu Musa mengulanginya lagi; \"Siapakah di antara kalian tadi yang berkata demikian dan demikian?\" namun kaum tersebut masih diam menunduk.\" Abu Musa berkata; \"Mungkin kamu wahai Hithan, apakah kamu tadi yang mengatakannya?\" Hithan menjawab; \"Aku tidak mengatakannya, sungguh aku khawatir jika kamu mengecamku karena hal itu.\" Hithan melanjutkan; \"Maka seorang laki-laki dari suatu kaum itu berkata; \"Aku lah yang mengatakan ungkapan tadi, tidaklah aku mengatakannya kecuali untuk maksud baik.\" Maka [Abu Musa] berkata; \"Apakah kamu tahu bagaimanakah seharusnya yang kamu katakan dalam sholat? sesungguhnya Rasulullah shallallahu 'alaihi wasallam pernah berkhutbah di hadapan kami, beliau mengajari kami, menjelaskan ajaran kami dan mengajarkan tentang sholat kami, beliau bersabda: 'Apabila kalian hendak mengerjakan sholat, maka luruskanlah shaf kalian, dan hendaklah seseorang salah seorang dari kalian menjadi imam, apabila ia (imam) bertakbir, maka bertakbirlah kalian, apabila ia membaca \"Ghairil maghdluubi 'alaihim walad dllaallin\" maka ucapkanlah \"Amin\" niscaya Allah akan mencintai kalian, apabila ia bertakbir dan ruku', maka bertakbirlah dan ruku'lah kalian, sesungguhnya seorang imam itu ruku' sebelum kalian dan mengangkat (kepala) sebelum kalian.\" Rasulullah shallallahu 'alaihi wasallam melanjutkan: \"Maka (gerakkan kamu) itu harus setelah gerakan imam. Apabila imam membaca; \"Sami'allahu liman hamidah\" maka ucapkanlah; \"Allahumma Rabbanaa walakal hamdu\" Allah akan mendengarkan do'amu, sesungguhnya Allah Ta'ala shallallahu 'alaihi wasallam berfirman melalui lisan Nabi-Nya shallallahu 'alaihi wasallam \"sami'allahu liman hamidah\" apabila imam bertakbir dan sujud, maka bertakbir dan sujudlah kalian, karena sesungguhnya imam sujud sebelum kalian dan mengangkat kepalanya sebelum kalian.\" Rasulullah shallallahu 'alaihi wasallam melanjutkan sabdanya: \"Maka (gerakkan kamu) itu harus setelah gerakan imam, dan apabila imam telah duduk (di raka'at terakhir), maka hendaknya ucapan yang pertama kali di ucapkan oleh kalian adalah; \"Attahiyyatu lillah Asshalawatut-thayyibat Assalamu 'alaika ayyuhannabiyyu warahmatullahi wabarakatuh assalaamu 'alaina wa'ala 'ibadillahis-shalihin Asyhadu alla ilaha illallah wa asyhadu anna muhammadan abduhu warasuluhu\" (Segala penghormatan dan kebaktian yang baik hanya bagi Allah, kesejahteraan, rahmat Allah dan berkah-Nya tetap terlimpah kepadamu wahai Nabi, semoga kesejahteraan atas kami dan hamba-hamba Allah yang Shalih, aku bersaksi tidak ada ilah (yang berhak di sembah) kecuali Allah, dan aku bersaksi bahwa Muhammad adalah Rasulullah).\" (dalam riwayatnya) Ahmad tidak menyebutkan \"wabarakaatuh\" tidak pula menyebutkan \"wa asyhadu\" namun dia hanya menyebutkan; \"wa anna muhammadan\" telah menceritakan kepada kami ['Ashim bin An Nadlr] telah menceritakan kepada kami [Al Mu'tamir] dia berkata; saya mendengar [ayahku], telah menceritakan kepada kami [Qatadah] dari [Abu Ghallab] telah menceritakan kepadanya, dari [Hitthan bin Abdullah Ar Raqasyi] seperti hadits tersebut, ia menambahkan; \"Apabila imam membaca (surat), maka diamlah kalian.\" Dia mengatakan setelah tasyahud setelah \"asyhadu allaa ilaaha illallah\" dia menambahkan; \"…wahdahuu laa syariikalah…\" Abu Daud mengatakan; perkataannya \"Maka diamlah kalian\" redaksi tersebut tidaklah terjaga, tidak ada dalam hadits ini, melainkan dari Sulaiman At Taimi.\""
            },
            {
                "number": 815,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ أَبِي الزُّبَيْرِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ وَطَاوُسٍ عَنْ ابْنِ عَبَّاسٍ أَنَّهُ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُنَا التَّشَهُّدَ كَمَا يُعَلِّمُنَا الْقُرْآنَ وَكَانَ يَقُولُ التَّحِيَّاتُ الْمُبَارَكَاتُ الصَّلَوَاتُ الطَّيِّبَاتُ لِلَّهِ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Abu Az Zubair] dari [Sa'id bin Jubair] dan [Thawus] dari [Ibnu Abbas] bahwa dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah mengajari kami sebagaimana beliau mengajari kami al-qur'an, beliau mengucapkan: \"Attahiyyatul mubaarakatus shalawaatut thayyibaatu lillah Assalamu 'alaika ayyuhannabiyyu warahmatullahi wabarakatuh assalamu 'alaina wa'ala 'ibadillahis-shalihin Asyhadu alla ilaha illallah wa asyhadu anna muhammadan abduhu warasuluhu\" (Segala penghormatan dan kebaktian yang baik hanya bagi Allah, kesejahteraan, rahmat Allah dan berkah-Nya tetap terlimpah kepadamu wahai Nabi, semoga kesejahteraan atas kami dan hamba-hamba Allah yang Shalih, aku bersaksi tidak ada ilah (yang berhak di sembah) kecuali Allah, dan aku bersaksi bahwa Muhammad adalah Rasulullah).\""
            },
            {
                "number": 816,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ بْنِ سُفْيَانَ حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ حَدَّثَنَا سُلَيْمَانُ بْنُ مُوسَى أَبُو دَاوُدَ حَدَّثَنَا جَعْفَرُ بْنُ سَعْدِ بْنِ سَمُرَةَ بْنِ جُنْدُبٍ حَدَّثَنِي خُبَيْبُ بْنُ سُلَيْمَانَ بْنِ سَمُرَةَ عَنْ أَبِيهِ سُلَيْمَانَ بْنِ سَمُرَةَ عَنْ سَمُرَةَ بْنِ جُنْدُبٍأَمَّا بَعْدُ أَمَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ فِي وَسَطِ الصَّلَاةِ أَوْ حِينَ انْقِضَائِهَا فَابْدَءُوا قَبْلَ التَّسْلِيمِ فَقُولُوا التَّحِيَّاتُ الطَّيِّبَاتُ وَالصَّلَوَاتُ وَالْمُلْكُ لِلَّهِ ثُمَّ سَلِّمُوا عَلَى الْيَمِينِ ثُمَّ سَلِّمُوا عَلَى قَارِئِكُمْ وَعَلَى أَنْفُسِكُمْقَالَ أَبُو دَاوُد سُلَيْمَانُ بْنُ مُوسَى كُوفِيُّ الْأَصْلِ كَانَ بِدِمَشْقَ قَالَ أَبُو دَاوُد دَلَّتْ هَذِهِ الصَّحِيفَةُ عَلَى أَنَّ الْحَسَنَ سَمِعَ مِنْ سَمُرَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Daud bin Sufyan] telah menceritakan kepada kami [Yahya bin Hasan] telah menceritakan kepada kami [Sulaiman bin Musa Abu Daud] telah menceritakan kepada kami [Ja'far bin Sa'd bin Samurah bin Jundub] telah menceritakan kepadaku [Khubaib bin Sulaiman bin Samurah] dari [ayahnya Sulaiman bin Samurah] dari [Samurah bin Jundub] dia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkan di saat kami sedang sholat atau ketika hendak menyelesaikannya yaitu sebelum salam, maka ucapkanlah \"Attahiyyat atthayyibat washshalawat walmulku lillah\" kemudian ucapkanlah salam terhadap golongan kanan (orang-orang Mukmin) dan ucapkanlah salam atas orang yang mengajarkan al-qur'an kepada kalian dan atas diri kalian.\" Abu Daud berkata; \"Sulaiman bin Musa asalnya dari Kufah lalu dia menetap di Damaskus.\" Abu Daud berkata; \"Tulisan ini menunjukkan bahwa Al Hasan mendengar dari Samurah.\""
            },
            {
                "number": 817,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ ابْنِ أَبِي لَيْلَى عَنْ كَعْبِ بْنِ عُجْرَةَ قَالَ قُلْنَا أَوْقَالُوا يَا رَسُولَ اللَّهِ أَمَرْتَنَا أَنْ نُصَلِّيَ عَلَيْكَ وَأَنْ نُسَلِّمَ عَلَيْكَ فَأَمَّا السَّلَامُ فَقَدْ عَرَفْنَاهُ فَكَيْفَ نُصَلِّي عَلَيْكَ قَالَ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَآلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا شُعْبَةُ بِهَذَا الْحَدِيثِ قَالَ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا ابْنُ بِشْرٍ عَنْ مِسْعَرٍ عَنْ الْحَكَمِ بِإِسْنَادِهِ بِهَذَا قَالَ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ قَالَ أَبُو دَاوُد رَوَاهُ الزُّبَيْرُ بْنُ عَدِيٍّ عَنْ ابْنِ أَبِي لَيْلَى كَمَا رَوَاهُ مِسْعَرٌ إِلَّا أَنَّهُ قَالَ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ وَبَارِكْ عَلَى مُحَمَّدٍ وَسَاقَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibnu Abu Laila] dari [Ka'b bin 'Ujrah] dia berkata; kami bertanya -atau- mereka bertanya; \"Wahai Rasulullah, Anda memerintahkan kami untuk bershalawat dan salam kepada anda, kami telah mengetahui tentang salam, lalu bagaimana cara kami bershalawat kepada anda?\" beliau bersabda: \"Ucapkanlah; 'Allahumma shalli 'ala Muhammadin wa'alaa aalii Muhammad, kamaa shallaita 'alaa Ibrahim. Wabaarik 'alaa Muhammad wa'alaa aali Muhammad, kamaa barakta 'alaa Ibrahim fil 'alamiina innaka hamidum-majiid (Ya Allah, curahkanlah kesejahteraan kepada Muhammad dan keluarga Muhammad sebagaimana Engkau curahkan kepada keluarga Ibrahim. Ya Allah, curahkanlah keberkahan kepada Muhammad dan keluarga Muhammad, sebagaimana Engkau curahkan keberkahan kepada keluarga Ibrahim. Sesungguhnya Engkau Maha Terpuji Lagi Maha Agung).\" Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Syu'bah] seperti hadits ini, sabdanya; \"Shalli 'alaa muhammad wa 'alaa aali Muhammad kamaa shallait a'alaa ibraahiim (curahkanlah kesejahteraan kepada Muhammad dan keluarga Muhammad sebagaimana Engkau curahkan kepada keluarga Ibrahim).\" Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Ibnu Bisyr] dari [Mis'ar] dari [Al Hakam] dengan isnad ini, beliau bersabda: \"'Allahumma shalli 'ala Muhammadin wa'alaa aalii Muhammad, kamaa shallaita 'alaa Ibrahim innaka hamiidum majiid. Allahumma baarik 'alaa Muhammad wa'alaa aali Muhammad, kamaa barakta 'alaa Ibrahim fil 'alamiina innaka hamidum-majiid (Ya Allah, curahkanlah kesejahteraan kepada Muhammad dan keluarga Muhammad sebagaimana Engkau curahkan kepada keluarga Ibrahim, sesungguhnya Engkau Maha Terpuji Lagi Maha Agung. Ya Allah, curahkanlah keberkahan kepada Muhammad dan keluarga Muhammad, sebagaimana Engkau curahkan keberkahan kepada keluarga Ibrahim. Sesungguhnya Engkau Maha Terpuji Lagi Maha Agung).\" Abu Daud berkata; \"(Hadits ini) juga di riwayatkan oleh [Az Zubair bin 'Adi] dari [Ibnu Abu Laila] sebagaimana yang di riwayatkan Mis'ar namun ia mengatakan; \"kamaa shallaita 'alaa aali Ibrahim innaka hamiidum majiid, wa baarik 'alaa Muhammad …\" kemudian ia melanjutkan hadits seperti itu. "
            },
            {
                "number": 818,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ ح و حَدَّثَنَا ابْنُ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَالِكٌ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ أَنَّهُ قَالَ أَخْبَرَنِي أَبُو حُمَيْدٍ السَّاعِدِيُّأَنَّهُمْ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نُصَلِّي عَلَيْكَ قَالَ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌحَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ أَنَّ مُحَمَّدَ بْنَ عَبْدِ اللَّهِ بْنِ زَيْدٍ وَعَبْدُ اللَّهِ بْنُ زَيْدٍ هُوَ الَّذِي أُرِيَ النِّدَاءَ بِالصَّلَاةِ أَخْبَرَهُ عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ أَنَّهُ قَالَ أَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَجْلِسِ سَعْدِ بْنِ عُبَادَةَ فَقَالَ لَهُ بَشِيرُ بْنُ سَعْدٍ أَمَرَنَا اللَّهُ أَنْ نُصَلِّيَ عَلَيْكَ يَا رَسُولَ اللَّهِ فَكَيْفَ نُصَلِّي عَلَيْكَ فَسَكَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى تَمَنَّيْنَا أَنَّهُ لَمْ يَسْأَلْهُ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُولُوا فَذَكَرَ مَعْنَى حَدِيثِ كَعْبِ بْنِ عُجْرَةَ زَادَ فِي آخِرِهِ فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ حَدَّثَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ الْحَارِثِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ زَيْدٍ عَنْ عُقْبَةَ بْنِ عَمْرٍو بِهَذَا الْخَبَرِ قَالَ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ النَّبِيِّ الْأُمِّيِّ وَعَلَى آلِ مُحَمَّدٍ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu As Sarh] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Malik] dari [Abdullah bin Abu Bakr bin Muhammad bin 'Amru bin Hazm] dari [ayahnya] dari ['Amru bin Sulaim Az Zuraqi] bahwa dia berkata; telah mengabarkan kepadaku [Abu Humaid As Sa'idi] bahwa mereka bertanya; \"Wahai Rasulullah, bagaimana cara kami bershalawat kepadamu?\" beliau bersabda: 'Ucapkanlah oleh kalian; \"'Allahumma shalli 'ala Muhammadin wa azwajihi wa dzurriyatihi, kamaa shallaita 'alaa aali Ibrahim. Wabaarik 'alaa Muhammad wa azwajihi wa dzurriyatihi, kamaa baarakta 'alaa aali Ibrahim fil 'alamiina innaka hamiidum-majiid (Ya Allah, curahkanlah kesejahteraan kepada Muhammad, para isterinya dan keturunannya sebagaimana Engkau curahkan kepada keluarga Ibrahim. Ya Allah, curahkanlah keberkahan kepada Muhammad, isteri-isterinya dan keturunannya, sebagaimana Engkau curahkan keberkahan kepada keluarga Ibrahim. Sesungguhnya Engkau Maha Terpuji Lagi Maha Agung).\" Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Nu'aim bin Abdullah al Mujmir] bahwa [Muhammad bin Abdullah bin Zaid], Abdullah bin Zaid yang aku ketahui dia seorang yang mengumandangkan adzan untuk sholat, dia telah mengabarkan kepadanya, dari [Abu Mas'ud Al Anshari] bahwa dia berkata; \"Rasulullah shallallahu 'alaihi wasallam menemui kami di Majlisnya Sa'd bin 'Ubadah, maka Bisyr bin Sa'd bertanya kepada beliau; \"Wahai Rasulullah, Allah telah memerintahkan kepada kami untuk bershalawat kepada anda, lalu bagaimana caranya kami bershalawat kepada anda?\" namun Rasulullah shallallahu 'alaihi wasallam diam, sehingga kami berharap supaya Bisyr tidak bertanya ulang kepada beliau, setelah itu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ucapkanlah oleh kalian …\" kemudian ia menyebutkan makna hadits Ka'b bin 'Ujrah, di akhir hadits ia menambahkan; \"fil 'aalamiina innaka hamiidum majiid.\" Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Muhammad bin Ishaq] telah menceritakan kepada kami [Muhammad bin Ibrahim bin Al Harits] dari [Muhammad bin Abdullah bin Zaid] dari ['Uqbah bin 'Amru] seperti hadits ini, beliau bersabda: \"Ucapkanlah oleh kalian; \"Allahumma shalli 'alaa Muhammad An Nabiyyil Ummi wa 'alaa aali Muhammad (Ya Allah, limpahkanlah kesejahteraan kepada Muhammad, Nabi yang Ummi (buta huruf) dan kepada keluarga Muhammad).\""
            },
            {
                "number": 819,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حِبَّانُ بْنُ يَسَارٍ الْكِلَابِيُّ حَدَّثَنِي أَبُو مُطَرِّفٍ عُبَيْدُ اللَّهِ بْنُ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ بْنِ كَرِيزٍ حَدَّثَنِي مُحَمَّدُ بْنُ عَلِيٍّ الْهَاشِمِيُّ عَنْ الْمُجْمِرِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ سَرَّهُ أَنْ يَكْتَالَ بِالْمِكْيَالِ الْأَوْفَى إِذَا صَلَّى عَلَيْنَا أَهْلَ الْبَيْتِ فَلْيَقُلْ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ أُمَّهَاتِ الْمُؤْمِنِينَ وَذُرِّيَّتِهِ وَأَهْلِ بَيْتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hibban bin Yasar Al Kilabi] telah menceritakan kepadaku [Abu Mutharif 'ubaidhullah bin Thlhah bin Kariz] telah menceritakan kepadaku [Muhammad bin Ali Al Hasyimi] dari [Al Mujmir] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Barangsiapa ingin di timbang dengan timbangan yang sempurna, maka apabila bershalawat kepada kami yaitu ahlul bait, hendaklah dia mengucapkan \"Allahumma shalli 'ala muhammadin waazwajihi ummahatul mu'minin wadzurriyyatihi wa ahla baitihi kama shallaita 'ala ali Ibrahim innaka hamidun majid\" (Ya Allah limpahkanlah kesejahteraan kepada Muhammad, para istrinya yaitu ibu bagi orang-orang yang beriman, keturunannya dan ahlu baitnya sebagaimana Engkau limpahkan kesejahteraan kepada keluarga Ibrahim, sesungguhnya Engkau Maha Terpuji lagi Maha Agung).\""
            },
            {
                "number": 820,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي حَسَّانُ بْنُ عَطِيَّةَ حَدَّثَنِي مُحَمَّدُ بْنُ أَبِي عَائِشَةَ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا فَرَغَ أَحَدُكُمْ مِنْ التَّشَهُّدِ الْآخِرِ فَلْيَتَعَوَّذْ بِاللَّهِ مِنْ أَرْبَعٍ مِنْ عَذَابِ جَهَنَّمَ وَمِنْ عَذَابِ الْقَبْرِ وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ وَمِنْ شَرِّ الْمَسِيحِ الدَّجَّالِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepadaku [Hasan bin 'Athiyah] telah menceritakan kepadaku [Muhammad bin Abu Aisyah] bahwa dia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian selesai dari tasyahud akhir, hendaklah memohon perlindungan kepada Allah dari empat perkara, yaitu; dari siksa neraka Jahannam, dari siksa kubur, fitnah kehidupan dan kematian serta dari kejahatan Dajjal.\""
            },
            {
                "number": 821,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ أَخْبَرَنَا عُمَرُ بْنُ يُونُسَ الْيَمَامِيُّ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقُولُ بَعْدَ التَّشَهُّدِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ",
                "id": "Telah menceritakan kepada kami [Wahb bin Baqiyah] telah mengabarkan kepada kami [Umar bin Yunus Al Yamami] telah menceritakan kepadaku [Muhammad bin Abdullah bin Thawus] dari [ayahnya] dari [Thawus] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam bahwa setelah tasyahud beliau sering membaca do'a; \"Allahumma inni a'uudzu bika min 'adzaabi jahannam wa a'uudzu bika min 'adzzabil qabri wa a'uudzu bika min fitnatid dajjal wa a'uudzu bika min fitnatil mahyaa wal mamaati (Ya Allah aku berlindung kepada-Mu dari siksa neraka Jahannam, dari siksa kubur, dan dari fitnah Dajjal fitnah serta fitnah kehidupan dan kematian.\""
            },
            {
                "number": 822,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَمْرٍو أَبُو مَعْمَرٍ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا الْحُسَيْنُ الْمُعَلِّمُ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ حَنْظَلَةَ بْنِ عَلِيٍّ أَنَّ مِحْجَنَ بْنَ الْأَدْرَعِ حَدَّثَهُ قَالَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَسْجِدَ فَإِذَا هُوَ بِرَجُلٍ قَدْ قَضَى صَلَاتَهُ وَهُوَ يَتَشَهَّدُ وَهُوَ يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا أَللَّهُ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ أَنْ تَغْفِرَ لِي ذُنُوبِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ قَالَ فَقَالَ قَدْ غُفِرَ لَهُ قَدْ غُفِرَ لَهُ ثَلَاثًا",
                "id": "Telah menceritakan kepada kami [Abdullah bin 'Amru Abu Ma'mar] telah menceritakan kepada kami [Abdul Warits] telah menceritakan kepada kami [Al Husain Al Mu'allim] dari [Abdullah bin Buraidah] dari [Handlalah bin Ali] bahwa [Mihjan bin Al Adra'] telah menceritakan kepadanya, katanya Mihjan; \"Rasulullah shallallahu 'alaihi wasallam masuk ke dalam masjid, lalu beliau mendapati seorang laki-laki membaca tasyahud seusai sholat, dia mengucapkan; \"Allahumma inni as`aluka Ya Allah Al Ahad As Shamad alladzii lam yalid wa lam yuulad walam yakul lahuu kufuwan ahad antaghfira lii dzunuubi innaka antal ghafuurur rakhiim (Ya Allah, sesungguhnya aku memohon kepada-Mu, Dzat yang Maha Esa, Dzat yang bergantung kepada-Nya segala sesuatu, tiada beranak dan tidak pula diperanakkan dan tidak ada seorangpun yang setara dengan Dia, semoga Engkau mengampuni dosa-dosaku, sesungguhnya Engkau adalah Maha Pengampun lagi Maha Penyayang.\" Kata Mihjan, maka beliau bersabda: \"Sungguh (dosa-dosa) nya telah di ampuni, Sungguh (dosa-dosa) nya telah di ampuni.\" Beliau mengucapkannya hingga tiga kali.\""
            },
            {
                "number": 823,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْكِنْدِيُّ حَدَّثَنَا يُونُسُ يَعْنِي ابْنَ بُكَيْرٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ قَالَمِنْ السُّنَّةِ أَنْ يُخْفَى التَّشَهُّدُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id Al Kindi] telah menceritakan kepada kami [Yunus yaitu Ibnu Bukair] dari [Muhammad bin Ishaq] dari [Abdurrahman bin Al Aswad] dari [ayahnya] dari [Abdullah] dia berkata; \"Diantara sunnah -dalam sholat- adalah mengucapkan tasyahhud dengan samar (pelan).\""
            },
            {
                "number": 824,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ عَنْ عَلِيِّ بْنِ عَبْدِ الرَّحْمَنِ الْمُعَاوِيِّ قَالَرَآنِي عَبْدُ اللَّهِ بْنُ عُمَرَ وَأَنَا أَعْبَثُ بِالْحَصَى فِي الصَّلَاةِ فَلَمَّا انْصَرَفَ نَهَانِي وَقَالَ اصْنَعْ كَمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ فَقُلْتُ وَكَيْفَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ قَالَ كَانَ إِذَا جَلَسَ فِي الصَّلَاةِ وَضَعَ كَفَّهُ الْيُمْنَى عَلَى فَخْذِهِ الْيُمْنَى وَقَبَضَ أَصَابِعَهُ كُلَّهَا وَأَشَارَ بِأُصْبُعِهِ الَّتِي تَلِي الْإِبْهَامَ وَوَضَعَ كَفَّهُ الْيُسْرَى عَلَى فَخْذِهِ الْيُسْرَى",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Muslim bin Abu Maryam] dari [Ali bin Abdurrahman Al Mu'awi] dia berkata; [Abdullah bin Umar] melihatku, ketika aku sedang mempermainkan kerikil dalam sholat, seusai sholat, dia melarangku sambil berkata; \"Perbuatlah seperti yang di perbuat oleh Rasulullah shallallahu 'alaihi wasallam.\" kataku; 'Bagaimana yang biasa di perbuat Rasulullah shallallahu 'alaihi wasallam?\" dia menjawab; \"Apabila beliau duduk dalam sholat, beliau meletakkan telapak tangan kanannya di atas paha kanannya dan menggenggam semua jari jemarinya seraya menunjuk dengan jari yang dekat ibu jari (jari telunjuk) dan meletakkan telapak tangan kirinya di atas paha kirinya.\""
            },
            {
                "number": 825,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ الْبَزَّازُ حَدَّثَنَا عَفَّانُ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ حَدَّثَنَا عَامِرُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَعَدَ فِي الصَّلَاةِ جَعَلَ قَدَمَهُ الْيُسْرَى تَحْتَ فَخْذِهِ الْيُمْنَى وَسَاقِهِ وَفَرَشَ قَدَمَهُ الْيُمْنَى وَوَضَعَ يَدَهُ الْيُسْرَى عَلَى رُكْبَتِهِ الْيُسْرَى وَوَضَعَ يَدَهُ الْيُمْنَى عَلَى فَخْذِهِ الْيُمْنَى وَأَشَارَ بِأُصْبُعِهِ وَأَرَانَا عَبْدُ الْوَاحِدِ وَأَشَارَ بِالسَّبَّابَةِ",
                "id": "telah menceritakan kepada kami [Muhammad bin Abdurrahim Al Bazzaz] telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Abdul Wahid bin Ziyad] telah menceritakan kepada kami [Utsman bin Hakim] telah menceritakan kepada kami ['Amir bin Abdullah bin Az Zubair] dari [ayahnya] dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam duduk dalam sholat, beliau meletakkan telapak kaki kirinya di bawah paha dan betis kanannya, dan menghamparkan telapak kaki kanannya serta meletakkan tangan kirinya di atas lutut kiri dan meletakkan tangan kanan di atas paha kanan sambil menunjuk dengan jarinya.\" Abdul Wahid memperlihatkan kepada kami sambil menunjuk dengan jari telunjuknya.\""
            },
            {
                "number": 826,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ الْمِصِّيصِيُّ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ عَنْ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ أَنَّهُ ذَكَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُشِيرُ بِأُصْبُعِهِ إِذَا دَعَا وَلَا يُحَرِّكُهَاقَالَ ابْنُ جُرَيْجٍ وَزَادَ عَمْرُو بْنُ دِينَارٍ قَالَ أَخْبَرَنِي عَامِرٌ عَنْ أَبِيهِ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو كَذَلِكَ وَيَتَحَامَلُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ الْيُسْرَى عَلَى فَخْذِهِ الْيُسْرَى حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى حَدَّثَنَا ابْنُ عَجْلَانَ عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ بِهَذَا الْحَدِيثِ قَالَ لَا يُجَاوِزُ بَصَرُهُ إِشَارَتَهُ وَحَدِيثُ حَجَّاجٍ أَتَمُّ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Al Hasan Al Mishhishi] telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] dari [Ziyad] dari [Muhammad bin 'Ajlan] dari ['Amir bin Abdullah] dari [Abdullah bin Zubair] bahwa dia menyebutkan bahwa Nabi shallallahu 'alaihi wasallam memberi isyarat dengan jarinya ketika berdo'a, tanpa menggerakkannya.\" [Ibnu Juraij] berkata; ['Amru bin Dinar] menambahkan; katanya; telah mengabarkan kepadaku ['Amir] dari [ayahnya] bahwa dia pernah melihat Nabi shallallahu 'alaihi wasallam seperti itu juga (menunjuk, dan Nabi shallallahu 'alaihi wasallam juga meletakkan tangan kirinya di atas paha kirinya.\" Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Ibnu 'Ajlan] dari ['Amir bin Abdullah bin Az Zubair] dari [ayahnya] dengan hadits seperti ini, katanya; \"…pandangan mata beliau tidak melampaui dari telunjuk beliau…\" sedangkan hadits Hajjaj lebih sempurna. "
            },
            {
                "number": 827,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا عُثْمَانُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ حَدَّثَنَا عِصَامُ بْنُ قُدَامَةَ مِنْ بَنِي بَجِيلَةَ عَنْ مَالِكِ بْنِ نُمَيْرٍ الْخُزَاعِيِّ عَنْ أَبِيهِ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاضِعًا ذِرَاعَهُ الْيُمْنَى عَلَى فَخِذِهِ الْيُمْنَى رَافِعًا إِصْبَعَهُ السَّبَّابَةَ قَدْ حَنَاهَا شَيْئًا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Utsman yaitu Ibnu Abdurrahman] telah menceritakan kepada kami ['Isham bin Qudamah] dari Bani Bajilah, dari [Malik bin Numair Al Khuza'i] dari [ayahnya] dia berkata; \"Aku melihat Nabi shallallahu 'alaihi wasallam meletakkan lengan kanannya diatas paha kanannya sambil mengangkat jari telunjuknya dengan sedikit melengkung.\""
            },
            {
                "number": 828,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَأَحْمَدُ بْنُ مُحَمَّدِ بْنِ شَبُّوَيْهِ وَمُحَمَّدُ بْنُ رَافِعٍ وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الْغَزَّالُ قَالُوا حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَحْمَدُ بْنُ حَنْبَلٍ أَنْ يَجْلِسَ الرَّجُلُ فِي الصَّلَاةِ وَهُوَ مُعْتَمِدٌ عَلَى يَدِهِ وَقَالَ ابْنُ شَبُّوَيْهِ نَهَى أَنْ يَعْتَمِدَ الرَّجُلُ عَلَى يَدِهِ فِي الصَّلَاةِ وَقَالَ ابْنُ رَافِعٍ نَهَى أَنْ يُصَلِّيَ الرَّجُلُ وَهُوَ مُعْتَمِدٌ عَلَى يَدِهِ وَذَكَرَهُ فِي بَابِ الرَّفْعِ مِنْ السُّجُودِ وَقَالَ ابْنُ عَبْدِ الْمَلِكِ نَهَى أَنْ يَعْتَمِدَ الرَّجُلُ عَلَى يَدَيْهِ إِذَا نَهَضَ فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], [Ahmad bin Muhammad bin Syabuaih], [Muhammad bin Rafi'] dan [Muhammad bin Abdul Malik Al Ghazzal] mereka berkata; telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Isma'il bin Umayyah] dari [Nafi'] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam melarang -Ahmad bin Hanbal mengatakan- seseorang duduk dalam sholat, sedangkan dia bertopang kepada kedua tangannya.\" Ibnu Syabuaih; \"Beliau melarang seseorang yang sedang sholat bertumpu pada tangannya. ' Ibnu Rafi' mengatakan; \"Beliau melarang seseorang yang sholat sambil bertumpu pada tangannya.\" Dan dia menyebutkannya pada bab \"Mengangkat (kepadal) dari sujud\", Ibnu Abdul Malik berkata; \"Beliau melarang seseorang bertumpu kepada kedua tangannya ketika bangkit (berdiri) dalam sholat.\""
            },
            {
                "number": 829,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ سَأَلْتُ نَافِعًاعَنْ الرَّجُلِ يُصَلِّي وَهُوَ مُشَبِّكٌ يَدَيْهِ قَالَ قَالَ ابْنُ عُمَرَ تِلْكَ صَلَاةُ الْمَغْضُوبِ عَلَيْهِمْ",
                "id": "Telah menceritakan kepada kami [Bisyr bin Hilal] telah menceritakan kepada kami [Abdul Warits] dari [Isma'il bin Umayyah]; \"aku bertanya kepada [Nafi'] tentang orang yang sholat dengan menjalin jari-jari tangannya yang satu dengan yang lain.\" Jawabnya; [Ibnu Umar] pernah berkata: \"Itu adalah sholatnya orang yang dimurkai (Yahudi).\""
            },
            {
                "number": 830,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ حَدَّثَنَا أَبِي ح و حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ حَدَّثَنَا ابْنُ وَهْبٍ وَهَذَا لَفْظُهُ جَمِيعًا عَنْ هِشَامِ بْنِ سَعْدٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّهُ رَأَى رَجُلًا يَتَّكِئُ عَلَى يَدِهِ الْيُسْرَى وَهُوَ قَاعِدٌ فِي الصَّلَاةِ قَالَ هَارُونُ بْنُ زَيْدٍ سَاقِطًا عَلَى شِقِّهِ الْأَيْسَرِ ثُمَّ اتَّفَقَا فَقَالَ لَهُ لَا تَجْلِسْ هَكَذَا فَإِنَّ هَكَذَا يَجْلِسُ الَّذِينَ يُعَذَّبُونَ",
                "id": "Telah menceritakan kepada kami [Harun bin Zaid bin Abu Az Zarqa'] telah menceritakan kepada kami [ayahku], dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Salamah] telah menceritakan kepada kami [Ibnu Wahb], sedangkan lafadznya dari [Hisyam bin Sa'd] dari [Nafi'] dari [Ibnu Umar] bahwa dia melihat seseorang bersandar dengan tangan kirinya ketika duduk dalam sholat- Harun bin Yazid berkata: \"condong kearah kirinya, \" kemudian keduanya sepakat pada lafadz- Maka Ibnu Umar berkata kepadanya; \"Janganlah kamu duduk seperti itu, karena itu seperti duduknya orang yang di adzab.\""
            },
            {
                "number": 831,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي عُبَيْدَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ كَأَنَّهُ عَلَى الرَّضْفِ قَالَ قُلْنَا حَتَّى يَقُومَ قَالَ حَتَّى يَقُومَ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Sa'd bin Ibrahim] dari [Abu 'Ubaidah] dari [ayahnya] bahwa ketika Nabi shallallahu 'alaihi wasallam bangkit dari dua raka'at yang pertama, beliau seperti duduk di atas batu yang di panaskan.\" Syu'bah berkata; \"Hingga beliau segera berdiri?\" Sa'd bin Ibrahim menjawab; \"Sehingga beliau bergegas untuk berdiri.\""
            },
            {
                "number": 832,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ ح و حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زَائِدَةُ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو الْأَحْوَصِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْمُحَارِبِيُّ وَزِيَادُ بْنُ أَيُّوبَ قَالَا حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ الطَّنَافِسِيُّ ح و حَدَّثَنَا تَمِيمُ بْنُ الْمُنْتَصِرِ أَخْبَرَنَا إِسْحَقُ يَعْنِي ابْنَ يُوسُفَ عَنْ شَرِيكٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ حَدَّثَنَا إِسْرَائِيلُ كُلُّهُمْ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ وَقَالَ إِسْرَائِيلُ عَنْ أَبِي الْأَحْوَصِ وَالْأَسْوَدِ عَنْ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُسَلِّمُ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ حَتَّى يُرَى بَيَاضُ خَدِّهِ السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِقَالَ أَبُو دَاوُد وَهَذَا لَفْظُ حَدِيثِ سُفْيَانَ وَحَدِيثُ إِسْرَائِيلَ لَمْ يُفَسِّرْهُ قَالَ أَبُو دَاوُد وَرَوَاهُ زُهَيْرٌ عَنْ أَبِي إِسْحَقَ وَيَحْيَى بْنُ آدَمَ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ وَعَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَ أَبُو دَاوُد شُعْبَةُ كَانَ يُنْكِرُ هَذَا الْحَدِيثَ حَدِيثَ أَبِي إِسْحَقَ أَنْ يَكُونَ مَرْفُوعًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Za`idah] dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu Al Ahwash], dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin 'Ubaid Al Muhribi] dan [Ziyad bin Ayyub] keduanya berkata; telah menceritakan kepada kami ['Umar bin 'Ubaid Ath Thanafisi], dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Tamim bin Al Muntashir] telah mengabarkan kepada kami [Ishaq yaitu Ibnu Yusuf] dari [Syarik], dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Husain bin Muhammad] telah menceritakan kepada kami [Isra`il] semuanya dari [Abu Ishaq] dari [Abu Al Ahwash] dari [Abdullah], sedangkan [Isra'il] mengatakan, dari [Abu Al Ahwash] dan [Al Aswad] dari [Abdullah] bahwa Nabi shallallahu 'alaihi wasallam biasa memberi salam ke arah kanan dan ke arah kiri sehingga terlihat putih pipi beliau (beliau mengucapkan): \" Assalaamu 'alaikum wa rahmatullah, Assalaamu 'alaikum wa rahmatullahi (semoga keselamatan dan rahmat Allah tetap atas kalian, semoga keselamatan dan rahmat Allah tetap atas kalian).\" Abu Daud mengatakan; \"Lafadz hadits ini berasal dari haditsnya Sufyan dan hadits Isra'il tanpa ada penafsiran.\" Abu Daud mengatakan; \"Dan di riwayatkan pula oleh [Zuhair] dari [Abu Ishaq] dan [Yahya bin Adam] dari [Isra'il] dari [Abu Ishaq] dari [Abdurrahman bin Al Aswad] dari [ayahnya] dari ['Alqamah] dari [Abdullah].\" Abu Daud berkata; \"Syu'bah mengingkari hadits ini, yaitu hadits Abu Ishaq yang di marfu'kan.\""
            },
            {
                "number": 833,
                "arab": "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا مُوسَى بْنُ قَيْسٍ الْحَضْرَمِيُّ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِ قَالَصَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ يُسَلِّمُ عَنْ يَمِينِهِ السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ وَعَنْ شِمَالِهِ السَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللَّهِ",
                "id": "Telah menceritakan kepada kami ['Abdah bin Abdullah] telah menceritakan kepada kami [Yahya bin Adam] telah menceritakan kepada kami [Musa bin Qais Al Hadlrami] dari [Salamah bin Kuhail] dari ['Alqamah bin Wa`il] dari [ayahnya] dia berkata; \"Aku sholat di belakang Rasulullah shallallahu 'alaihi wasallam, beliau memberi salam ke arah kanan dengan mengucapkan \"Assalamu 'alaikum wa rahmatullahi wa barakatuh (Semoga keselamatan, rahmat dan berkah Allah tetap atas kalian), \" dan kearah kiri dengan mengucapkan \"Assalamu 'alaikum warahmatullah (Semoga keselamatan dan rahmat Allah tetap atas kalian).\""
            },
            {
                "number": 834,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا وَوَكِيعٌ عَنْ مِسْعَرٍ عَنْ عُبَيْدِ اللَّهِ ابْنِ الْقِبْطِيَّةِ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَكُنَّا إِذَا صَلَّيْنَا خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمَ أَحَدُنَا أَشَارَ بِيَدِهِ مِنْ عَنْ يَمِينِهِ وَمِنْ عَنْ يَسَارِهِ فَلَمَّا صَلَّى قَالَ مَا بَالُ أَحَدِكُمْ يُومِي بِيَدِهِ كَأَنَّهَا أَذْنَابُ خَيْلٍ شُمْسٍ إِنَّمَا يَكْفِي أَحَدَكُمْ أَوْ أَلَا يَكْفِي أَحَدَكُمْ أَنْ يَقُولَ هَكَذَا وَأَشَارَ بِأُصْبُعِهِ يُسَلِّمُ عَلَى أَخِيهِ مِنْ عَنْ يَمِينِهِ وَمِنْ عَنْ شِمَالِهِحَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا أَبُو نُعَيْمٍ عَنْ مِسْعَرٍ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ أَمَا يَكْفِي أَحَدَكُمْ أَوْ أَحَدَهُمْ أَنْ يَضَعَ يَدَهُ عَلَى فَخْذِهِ ثُمَّ يُسَلِّمَ عَلَى أَخِيهِ مِنْ عَنْ يَمِينِهِ وَمِنْ عَنْ شِمَالِهِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Yahya bin Zakariya] dan [Waki'] dari [Mis'ar] dari ['ubaidhullah bin Al Qibthiyah] dari [Jabir bin Samurah] dia berkata; \"Apabila kami sholat di belakang Rasulullah shallallahu 'alaihi wasallam, maka salah seorang dari kami memberi salam seraya memberi isyarat dengan tangannya kepada orang yang berada di kanan dan kirinya, ketika beliau selesai mengerjakan sholat, beliau bersabda: 'Kenapa salah seorang dari kalian masih saja memberi isyarat dengan tangannya seperti ekor kuda yang bergerak-gerak?, cukuplah salah seorang dari kalian -atau- tidak cukupkah salah seorang dari kalian melakukannya seperti ini saja.\" beliau memberi isyarat dengan jarinya dengan memberi salam kepada saudaranya yang ada di kanan dan kirinya.\" Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] telah menceritakan kepada kami [Abu Nu'aim] dari [Mis'ar] dengan isnad dan makna yang sama, sabdanya: \"Cukuplah salah seorang dari kalian -atau dari mereka- meletakkan tangannya di atas pahanya kemudian dia memberi salam kepada saudaranya yang berada di kanan dan kirinya.\""
            },
            {
                "number": 835,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا الْأَعْمَشُ عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ تَمِيمٍ الطَّائِيِّ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَدَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالنَّاسُ رَافِعُوا أَيْدِيهِمْ قَالَ زُهَيْرٌ أُرَاهُ قَالَ فِي الصَّلَاةِ فَقَالَ مَا لِي أَرَاكُمْ رَافِعِي أَيْدِيكُمْ كَأَنَّهَا أَذْنَابُ خَيْلٍ شُمْسٍ أُسْكُنُوا فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Al A'masy] dari [Al Musayyab bin Rafi'] dari [Tamim Ath Tha`i] dari [Jabir bin Samurah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam menemui kami, sedangkan orang-orang tengah mengangkat tangan -Zuhair berkata; sepengetahuanku Jabir bin Samurah mengatakan; \"ketika mereka tengah mengerjakan sholat, \" maka beliau bersabda: \"Kenapa aku melihat kalian mengangkat tangan seperti ekor kuda yang bergerak-gerak, diamlah kalian dalam sholat.\""
            },
            {
                "number": 836,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ أَبُو الْجَمَاهِرِ حَدَّثَنَا سَعِيدُ بْنُ بَشِيرٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ قَالَأَمَرَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَرُدَّ عَلَى الْإِمَامِ وَأَنْ نَتَحَابَّ وَأَنْ يُسَلِّمَ بَعْضُنَا عَلَى بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Utsman Abu Al Jamahir] telah menceritakan kepada kami [Sa'id bin Basyir] dari [Qatadah] dari [Al Hasan] dari [Samurah] dia berkata; \"Nabi shallallahu 'alaihi wasallam memerintahkan kami untuk menjawab salamnya imam, saling berkasih sayang dan saling mengucapkan salam antara sebagian kami dengan sebagian yang lain.\""
            },
            {
                "number": 837,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ أَخْبَرَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ أَبِي مَعْبَدٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ يُعْلَمُ انْقِضَاءُ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالتَّكْبِيرِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdah] telah mengabarkan kepada kami [Sufyan] dari ['Amru] dari [Abu Ma'bad] dari [Ibnu Abbas] dia berkata; \"Selesai sholatnya Rasulullah shallallahu 'alaihi wasallam, dapat di ketahui dengan takbir.\""
            },
            {
                "number": 838,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنِي ابْنُ جُرَيْجٍ أَخْبَرَنَا عَمْرُو بْنُ دِينَارٍ أَنَّ أَبَا مَعْبَدٍ مَوْلَى ابْنِ عَبَّاسٍ أَخْبَرَهُ أَنَّ ابْنَ عَبَّاسٍ أَخْبَرَهُأَنَّ رَفْعَ الصَّوْتِ لِلذِّكْرِ حِينَ يَنْصَرِفُ النَّاسُ مِنْ الْمَكْتُوبَةِ كَانَ ذَلِكَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَوَأَنَّ ابْنَ عَبَّاسٍ قَالَ كُنْتُ أَعْلَمُ إِذَا انْصَرَفُوا بِذَلِكَ وَأَسْمَعُهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Musa al Balhi] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepadaku [Ibnu Juraij] telah mengabarkan kepada kami ['Amru bin Dinar] bahwa [Abu Ma'bad] bekas budak Ibnu Abbas telah mengabarkan kepadanya, bahwa [Ibnu Abbas] telah mengabarkan kepadanya bahwa \"Mengeraskan suara dzikir ketika orang-orang selesai dari sholat fardlu itu telah di lakukan di masa Rasulullah shallallahu 'alaihi wasallam, dan Ibnu Abbas mengatakan; \"Aku mengetahuinya ketika mereka selesai melakukan itu dan aku juga mendengarnya.\""
            },
            {
                "number": 839,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنِي مُحَمَّدُ بْنُ يُوسُفَ الْفِرْيَابِيُّ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ قُرَّةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَذْفُ السَّلَامِ سُنَّةٌقَالَ عِيسَى نَهَانِي ابْنُ الْمُبَارَكِ عَنْ رَفْعِ هَذَا الْحَدِيثِ قَالَ أَبُو دَاوُد سَمِعْت أَبَا عُمَيْرٍ عِيسَى بْنَ يُونُسَ الْفَاخُورِيَّ الرَّمْلِيَّ قَالَ لَمَّا رَجَعَ الْفِرْيَابِيُّ مِنْ مَكَّةَ تَرَكَ رَفْعَ هَذَا الْحَدِيثِ وَقَالَ نَهَاهُ أَحْمَدُ بْنُ حَنْبَلٍ عَنْ رَفْعِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Hanbal] telah menceritakan kepadaku [Muhammad bin Yusuf Al Firyabi] telah menceritakan kepada kami [Al Auza'i] dari [Qurrah bin Abdurrahman] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak memanjangkan lafadz salam adalah sunnah.\" Isa berkata; Ibnu Mubarrak melarangku untuk merafa'kan hadits ini, Abu Daud mengatakan; \"aku mendengar Abu 'Umair Isa bin Yunus Al Fahuri Ar Ramli dia berkata; \"Ketika Al Firyabi kembali dari Makkah, dia meninggalkan untuk merafa'kan hadits ini, katanya; \"Ahmad bin Hanbal telah melarang untuk merafa'kannya.\""
            },
            {
                "number": 840,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ عِيسَى بْنِ حِطَّانَ عَنْ مُسْلِمِ بْنِ سَلَّامٍ عَنْ عَلِيِّ بْنِ طَلْقٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا فَسَا أَحَدُكُمْ فِي الصَّلَاةِ فَلْيَنْصَرِفْ فَلْيَتَوَضَّأْ وَلْيُعِدْ صَلَاتَهُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir bin Abdul Hamid] dari ['Ashim Al Ahwal] dari [Isa bin Hithan] dari [Muslim bin Salam] dari ['Ali bin Thalq] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian kentut dan tidak bersuara dalam sholat, hendaknya ia beranjak untuk berwudlu' dan mengulangi sholatnya.\""
            },
            {
                "number": 841,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادٌ وَعَبْدُ الْوَارِثِ عَنْ لَيْثٍ عَنْ الْحَجَّاجِ بْنِ عُبَيْدٍ عَنْ إِبْرَاهِيمَ بْنِ إِسْمَعِيلَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيَعْجِزُ أَحَدُكُمْ قَالَ عَنْ عَبْدِ الْوَارِثِ أَنْ يَتَقَدَّمَ أَوْ يَتَأَخَّرَ أَوْ عَنْ يَمِينِهِ أَوْ عَنْ شِمَالِهِ زَادَ فِي حَدِيثِ حَمَّادٍ فِي الصَّلَاةِ يَعْنِي فِي السُّبْحَةِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Hammad] dan [Abdul Warits] dari [Laits] dari [Al Hajjaj bin 'Ubaid] dari [Ibrahim bin Isma'il] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah salah seorang dari kalian tidak mampu -Musaddad berkata dari Abdul Warits- hendak maju atau mundur, ke kanan atau ke kiri -dalam haditsnya Hammad di tambahkan- dalam sholat yaitu sholat sunnah.\""
            },
            {
                "number": 842,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ حَدَّثَنَا أَشْعَثُ بْنُ شُعْبَةَ عَنْ الْمِنْهَالِ بْنِ خَلِيفَةَ عَنْ الْأَزْرَقِ بْنِ قَيْسٍ قَالَصَلَّى بِنَا إِمَامٌ لَنَا يُكْنَى أَبَا رِمْثَةَ فَقَالَ صَلَّيْتُ هَذِهِ الصَّلَاةَ أَوْ مِثْلَ هَذِهِ الصَّلَاةِ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَكَانَ أَبُو بَكْرٍ وَعُمَرُ يَقُومَانِ فِي الصَّفِّ الْمُقَدَّمِ عَنْ يَمِينِهِ وَكَانَ رَجُلٌ قَدْ شَهِدَ التَّكْبِيرَةَ الْأُولَى مِنْ الصَّلَاةِ فَصَلَّى نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ سَلَّمَ عَنْ يَمِينِهِ وَعَنْ يَسَارِهِ حَتَّى رَأَيْنَا بَيَاضَ خَدَّيْهِ ثُمَّ انْفَتَلَ كَانْفِتَالِ أَبِي رِمْثَةَ يَعْنِي نَفْسَهُ فَقَامَ الرَّجُلُ الَّذِي أَدْرَكَ مَعَهُ التَّكْبِيرَةَ الْأُولَى مِنْ الصَّلَاةِ يَشْفَعُ فَوَثَبَ إِلَيْهِ عُمَرُ فَأَخَذَ بِمَنْكِبِهِ فَهَزَّهُ ثُمَّ قَالَ اجْلِسْ فَإِنَّهُ لَمْ يُهْلِكْ أَهْلَ الْكِتَابِ إِلَّا أَنَّهُ لَمْ يَكُنْ بَيْنَ صَلَوَاتِهِمْ فَصْلٌ فَرَفَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَصَرَهُ فَقَالَ أَصَابَ اللَّهُ بِكَ يَا ابْنَ الْخَطَّابِقَالَ أَبُو دَاوُد وَقَدْ قِيلَ أَبُو أُمَيَّةَ مَكَانَ أَبِي رِمْثَةَ",
                "id": "Telah menceritakan kepada kami [Abdul Wahab bin Najdah] telah menceritakan kepada kami [Asy'ats Tsauri bin Syu'bah] dari [Al Minhal bin Khalifah] dari [Al Azraq bin Qais] dia berkata; imam kami yang berkunyah [Abu Rimtsah] sholat bersama kami, katanya; \"Aku sholat seperti ini atau seperti sholat bersama Nabi shallallahu 'alaihi wasallam, -dia melanjutkan perkataannya- sementara Abu Bakar dan Umar sholat di shaf pertama, tepatnya di samping kanan beliau, tiba-tiba seseorang datang dan mendapatkan takbiratul ihram bersama beliau, lalu Nabi Allah shallallahu 'alaihi wasallam mengerjakan sholat, kemudian salam kekanan dan kekiri sehingga kami melihat putihnya pipi beliau. Kemudian beliau merubah posisi sebagaimana Abu Ritsmah merubah posisi. Lantas seorang laki-laki yang tadi hanya mendapatkan takbiratul ihram berdiri untuk menambah raka'at lagi, maka Umar melompat menuju kepadanya dan memegang kedua pundak orang tersebut serta menggetarkannya sambil berkata: \"Duduklah! Karena sesungguhnya ahlul kitab tidak binasa kecuali mereka tidak memisahkan antara sholat-sholat mereka.\" Lalu Nabi shallallahu 'alaihi wasallam memandanginya seraya bersabda: \"Kamu benar wahai Ibnu Khattab.\" Abu Daud berkata: \"Dikatakan bahwa Abu Umayyah diganti dengan Abu Ritsmah.\""
            },
            {
                "number": 843,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِحْدَى صَلَاتَيْ الْعَشِيِّ الظُّهْرَ أَوْ الْعَصْرَ قَالَ فَصَلَّى بِنَا رَكْعَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ قَامَ إِلَى خَشَبَةٍ فِي مُقَدَّمِ الْمَسْجِدِ فَوَضَعَ يَدَيْهِ عَلَيْهِمَا إِحْدَاهُمَا عَلَى الْأُخْرَى يُعْرَفُ فِي وَجْهِهِ الْغَضَبُ ثُمَّ خَرَجَ سَرْعَانُ النَّاسِ وَهُمْ يَقُولُونَ قُصِرَتْ الصَّلَاةُ قُصِرَتْ الصَّلَاةُ وَفِي النَّاسِ أَبُو بَكْرٍ وَعُمَرُ فَهَابَاهُ أَنْ يُكَلِّمَاهُ فَقَامَ رَجُلٌ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَمِّيهِ ذَا الْيَدَيْنِ فَقَالَ يَا رَسُولَ اللَّهِ أَنَسِيتَ أَمْ قُصِرَتْ الصَّلَاةُ قَالَ لَمْ أَنْسَ وَلَمْ تُقْصَرْ الصَّلَاةُ قَالَ بَلْ نَسِيتَ يَا رَسُولَ اللَّهِ فَأَقْبَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْقَوْمِ فَقَالَ أَصَدَقَ ذُو الْيَدَيْنِ فَأَوْمَئُوا أَيْ نَعَمْ فَرَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى مَقَامِهِ فَصَلَّى الرَّكْعَتَيْنِ الْبَاقِيَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ كَبَّرَ وَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ ثُمَّ رَفَعَ وَكَبَّرَ ثُمَّ كَبَّرَ وَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ ثُمَّ رَفَعَ وَكَبَّرَقَالَ فَقِيلَ لِمُحَمَّدٍ سَلَّمَ فِي السَّهْوِ فَقَالَ لَمْ أَحْفَظْهُ عَنْ أَبِي هُرَيْرَةَ وَلَكِنْ نُبِّئْتُ أَنَّ عِمْرَانَ بْنَ حُصَيْنٍ قَالَ ثُمَّ سَلَّمَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ بِإِسْنَادِهِ وَحَدِيثُ حَمَّادٍ أَتَمُّ قَالَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَقُلْ بِنَا وَلَمْ يَقُلْ فَأَوْمَئُوا قَالَ فَقَالَ النَّاسُ نَعَمْ قَالَ ثُمَّ رَفَعَ وَلَمْ يَقُلْ وَكَبَّرَ ثُمَّ كَبَّرَ وَسَجَدَ مِثْلَ سُجُودِهِ أَوْ أَطْوَلَ ثُمَّ رَفَعَ وَتَمَّ حَدِيثُهُ لَمْ يَذْكُرْ مَا بَعْدَهُ وَلَمْ يَذْكُرْ فَأَوْمَئُوا إِلَّا حَمَّادُ بْنُ زَيْدٍ قَالَ أَبُو دَاوُد وَكُلُّ مَنْ رَوَى هَذَا الْحَدِيثَ لَمْ يَقُلْ فَكَبَّرَ وَلَا ذَكَرَ رَجَعَ حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ حَدَّثَنَا سَلَمَةُ يَعْنِي ابْنَ عَلْقَمَةَ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَمَّادٍ كُلِّهِ إِلَى آخِرِ قَوْلِهِ نُبِّئْتُ أَنَّ عِمْرَانَ بْنَ حُصَيْنٍ قَالَ ثُمَّ سَلَّمَ قَالَ قُلْتُ فَالتَّشَهُّدُ قَالَ لَمْ أَسْمَعْ فِي التَّشَهُّدِ وَأَحَبُّ إِلَيَّ أَنْ يَتَشَهَّدَ وَلَمْ يَذْكُرْ كَانَ يُسَمِّيهِ ذَا الْيَدَيْنِ وَلَا ذَكَرَ فَأَوْمَئُوا وَلَا ذَكَرَ الْغَضَبَ وَحَدِيثُ حَمَّادٍ عَنْ أَيُّوبَ أَتَمُّ حَدَّثَنَا عَلِيُّ بْنُ نَصْرِ بْنِ عَلِيٍّ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ وَهِشَامٍ وَيَحْيَى بْنِ عَتِيقٍ وَابْنِ عَوْنٍ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قِصَّةِ ذِي الْيَدَيْنِ أَنَّهُ كَبَّرَ وَسَجَدَ وَقَالَ هِشَامٌ يَعْنِي ابْنَ حَسَّانَ كَبَّرَ ثُمَّ كَبَّرَ وَسَجَدَ قَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ أَيْضًا حَبِيبُ بْنُ الشَّهِيدِ وَحُمَيْدٌ وَيُونُسُ وَعَاصِمٌ الْأَحْوَلُ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ لَمْ يَذْكُرْ أَحَدٌ مِنْهُمْ مَا ذَكَرَ حَمَّادُ بْنُ زَيْدٍ عَنْ هِشَامٍ أَنَّهُ كَبَّرَ ثُمَّ كَبَّرَ وَسَجَدَ وَرَوَى حَمَّادُ بْنُ سَلَمَةَ وَأَبُو بَكْرِ بْنُ عَيَّاشٍ هَذَا الْحَدِيثَ عَنْ هِشَامٍ لَمْ يَذْكُرَا عَنْهُ هَذَا الَّذِي ذَكَرَهُ حَمَّادُ بْنُ زَيْدٍ أَنَّهُ كَبَّرَ ثُمَّ كَبَّرَ حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ وَأَبِي سَلَمَةَ وَعُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي هُرَيْرَةَ بِهَذِهِ الْقِصَّةِ قَالَ وَلَمْ يَسْجُدْ سَجْدَتَيْ السَّهْوِ حَتَّى يَقَّنَهُ اللَّهُ ذَلِكَ حَدَّثَنَا حَجَّاجُ بْنُ أَبِي يَعْقُوبَ حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ أَنَّ أَبَا بَكْرِ بْنَ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ أَخْبَرَهُ أَنَّهُ بَلَغَهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْخَبَرِ قَالَ وَلَمْ يَسْجُدْ السَّجْدَتَيْنِ اللَّتَيْنِ تُسْجَدَانِ إِذَا شَكَّ حَتَّى لَقَاهُ النَّاسُ قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي بِهَذَا الْخَبَرِ سَعِيدُ بْنُ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ قَالَ وَأَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ وَأَبُو بَكْرِ بْنُ الْحَارِثِ بْنِ هِشَامٍ وَعُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ قَالَ أَبُو دَاوُد رَوَاهُ يَحْيَى بْنُ أَبِي كَثِيرٍ وَعِمْرَانُ بْنُ أَبِي أَنَسٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ وَالْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ جَمِيعًا عَنْ أَبِي هُرَيْرَةَ بِهَذِهِ الْقِصَّةِ وَلَمْ يَذْكُرْ أَنَّهُ سَجَدَ السَّجْدَتَيْنِ قَالَ أَبُو دَاوُد وَرَوَاهُ الزُّبَيْدِيُّ عَنْ الزُّهْرِيِّ عَنْ أَبِي بَكْرِ بْنِ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيهِ وَلَمْ يَسْجُدْ سَجْدَتَيْ السَّهْوِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Muhammad] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam sholat petang hari bersama kami yaitu sholat dzuhur atau ashar.\" Kata Abu Hurairah; \"Ternyata beliau hanya sholat dua raka'at kemudian salam, lalu pergi ke kayu yang melintang di depan masjid sambil meletakkan tangan yang satunya (kanannya) di atas tangannya yang lain, dan terlihat di wajahnya seolah-olah beliau sedang marah, setelah itu orang-orang bergegas keluar (dari masjid) sambil berkata; \"sholat di qashar, sholat di qashar.\" Dan di antara orang-orang tersebut terdapat Abu Bakar dan Umar, keduanya merasa segan untuk menanyakan hal itu, maka salah seorang yang di beri nama oleh Rasulullah shallallahu 'alaihi wasallam dengan sebutan Dzul yadain berdiri seraya bertanya; \"Wahai Rasulullah, apakah anda lupa ataukah memang sholat telah di qashar?\" beliau menjawab: \"Aku tidak lupa dan tidak pula mengqashar sholat.\" Dzul Yadain berkata; \"Akan tetapi anda lupa wahai Rasulullah.\" Kemudian Rasulullah shallallahu 'alaihi wasallam menghadap kepada orang-orang seraya bersabda: \"Benarkah apa yang di katakan oleh Dzul Yadain?\" para sahabat menjawab (dengan isyarat); \"Ya, benar\" lalu beliau maju kembali ke tempatnya semula dan menyelesaikan kekurangan (raka'at) yang tertinggal, kemudian salam. Setelah salam beliau bertakbir dan sujud seperti sujud biasa atau agak panjang sedikit lalu mengangkat kepala dan bertakbir, setelah itu beliau bertakbir lagi dan sujud seperti sujud biasa atau agak lama kemudian mengangkat kepala dan bertakbir.\" Di tanyakan kepada Muhammad; \"Apakah beliau salam dalam (sujud) sahwi?\" jawabnya; \"aku tidak menghafalnya dari Abu Hurairah, tapi aku diberitahu bahwa [Imran bin Hushain] berkata; \"Kemudian beliau shallallahu 'alaihi wasallam salam…\". Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Ayyub] dari [Muhammad] dengan sanadnya, namun hadits Hammad lebih sempurna, perawi berkata; Rasulullah shallallahu 'alaihi wasallam sholat bersama kami namun dia tidak mengatakan\"…Para sahabat mengangguk…\" katanya melanjutkan; \"…maka orang-orang menjawab; \"Ya, benar\" katanya lagi; \"…kemudian beliau mengangkat (kepalanya) …\" dan tidak mengatakan; \"…beliau bertakbir, kemudian bertakbir dan sujud seperti sujud biasanya atau agak panjang, kemudian beliau mengangkat (kepala).\" Riwayat haditsnya selesai sampai di sini, tanpa menyebutkan redaksi setelahnya dan tidak pula menyebutkan; \"…Para sahabat mengangguk..\" kecuali Hammad bin Zaid, Abu Daud mengatakan; 'Setiap orang yang meriwayatkan hadits ini tidak mengatakan; \"…kemudian bertakbir…'\" tidak pula menyebutkan; \"…dan kembali…\" Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Bisyr yaitu Ibnu Al Mufadlal] telah menceritakan kepada kami [Salamah yaitu Ibnu Alqamah] dari [Muhammad] dari [Abu Hurairah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan sholat bersama kami…\" seperti maksud hadits Hammad seluruhnya (dari awal) sampai akhir ucapannya, yaitu; \"Aku di beritahu bahwa Imran bin Hushain berkata; …kemudian beliau salam.\" Kata Salamah bin Alqamah; \"kataku; (dengan) membaca tasyahud (sesudah sujud sahwi)?\" kata Muhammad bin Sirin; \"Aku tidak mendengar beliau membaca tasyahud, sedangkan aku lebih suka membaca tasyahud. ' Tidak di sebutkan pula; \"Beliau menyebutnya dengan Dzul Yadain, \" demikian juga tidak menyebutkan; \"…lalu mereka mengangguk…\" begitu juga tentang \"Marah.\" Sedangkan haditsnya Hammad dari Ayyub lebih sempurna. Telah menceritakan kepada kami [Ali bin Nadhr bin Ali] telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dan [Hisyam], [Yahya bin 'Atiq], [Ibnu 'Aun] dari [Muhammad] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam -tentang kisah Dzul Yadain- bahwa beliau bertakbir dan sujud. Hisyam yaitu Ibnu Hasan berkata; 'beliau bertakbir kemudian bertakbir lalu sujud.\" Abu Daud mengatakan; Hadits ini juga di riwayatkan oleh [Habib bin As Syahid], [Humaid], [Yunus] dan ['Ashim Al Ahwal] dari [Muhammad] dari [Abu Hurairah], namun salah satu dari mereka tidak ada yang menyebutkan seperti yang di sebutkan oleh Hammad bin Zaid dari Hisyam bahwa beliau bertakbir kemudian bertakbir lalu sujud.\" Hadits ini juga riwayatkan dari [Hammad bin Salamah] dan [Abu Bakar bin 'Ayyasy] dari [Hisyam], namun keduanya tidak menyebutkan seperti yang di sebutkan oleh Hammad bin Zaid bahwa beliau bertakbir kemudian bertakbir.\" Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] telah menceritakan kepada kami [Muhammad bin Katsir] dari [Al Auza'i] dari [Az Zuhri] dari [Sa'id bin Al Musayyib] dan [Abu Salamah] serta ['ubaidhullah bin Abdullah] dari [Abu Hurairah] seperti kisah ini, dia mengatakan; \"Namun beliau tidak sujud sahwi dua kali sehingga Allah meyakinkan dirinya.\" Telah menceritakan kepada kami [Hajjaj bin Abu Ya'qub] telah menceritakan kepada kami [Ya'qub yaitu Ibnu Ibrahim] telah menceritakan kepada kami [ayahku] dari [Shalih] dari [Ibnu Syihab] bahwa [Abu Bakar bin Sulaiman bin Abu Hatsmah], telah mengabarkan kepadanya, bahwa telah sampai kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam …\" seperti hadits di atas, katanya; \"beliau tidak sujud dua kali yaitu sujud tatkala ragu sehingga orang-orang menemui beliau.\" [Ibnu Syihab] mengatakan; [Sa'id bin Al Musayyab] telah mengabariku dengan hadits ini, dari [Abu Hurairah] dia berkata; …\" Dan telah mengabarkan kepadaku [Abu Salamah bin Abdurrahman] dan [Abu Bakar bin Al Harits bin Hisyam] serta ['ubaidhullah bin Abdullah]. Abu Daud berkata; \"di riwayatkan pula dari [Yahya bin Abu Katsir] dan [Imran bin Abu Anas] dari [Abu Salamah bin Abdurrahman] dan ['Ala` bin Abdurrahman] dari [ayahnya] semuanya dari [Abu Hurairah] dengan kisah ini, namun dia tidak menyebutkan dua kali sujud (sahwi).\" Abu Daud mengatakan; \"Dan di riwayatkan dari [Az Zubaidi] dari [Az Zuhri] dari [Abu Bakar bin Sulaiman bin Abu Hatsmah] dari Nabi shallallahu 'alaihi wasallam -katanya dalam hadits tersebut- beliau tidak mengerjakan sujud sahwi dua kali (sujud).\""
            },
            {
                "number": 844,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ سَمِعَ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ فَسَلَّمَ فِي الرَّكْعَتَيْنِ فَقِيلَ لَهُ نَقَصْتَ الصَّلَاةَ فَصَلَّى رَكْعَتَيْنِ ثُمَّ سَجَدَ سَجْدَتَيْنِ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari [Sa'd bin Ibrahim] dia mendengar [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam mengerjakan sholat dluhur kemudian salam di raka'at kedua, maka di beritahukan kepadanya; \"Apakah anda mengurangi jumlah raka'at sholat?\" kemudian beliau melanjutkan dua raka'at lagi lalu sujud dua kali.\""
            },
            {
                "number": 845,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ أَسَدٍ أَخْبَرَنَا شَبَابَةُ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْصَرَفَ مِنْ الرَّكْعَتَيْنِ مِنْ صَلَاةِ الْمَكْتُوبَةِ فَقَالَ لَه رَجُلٌ أَقُصِرَتْ الصَّلَاةُ يَا رَسُولَ اللَّهِ أَمْ نَسِيتَ قَالَ كُلَّ ذَلِكَ لَمْ أَفْعَلْ فَقَالَ النَّاسُ قَدْ فَعَلْتَ ذَلِكَ يَا رَسُولَ اللَّهِ فَرَكَعَ رَكْعَتَيْنِ أُخْرَيَيْنِ ثُمَّ انْصَرَفَ وَلَمْ يَسْجُدْ سَجْدَتَيْ السَّهْوِقَالَ أَبُو دَاوُد رَوَاهُ دَاوُدُ بْنُ الْحُصَيْنِ عَنْ أَبِي سُفْيَانَ مَوْلَى ابْنِ أَبِي أَحْمَدَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذِهِ الْقِصَّةِ قَالَ ثُمَّ سَجَدَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ بَعْدَ التَّسْلِيمِ حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ عَنْ ضَمْضَمِ بْنِ جَوْسٍ الْهِفَّانِيِّ حَدَّثَنِي أَبُو هُرَيْرَةَ بِهَذَا الْخَبَرِ قَالَ ثُمَّ سَجَدَ سَجْدَتَيْ السَّهْوِ بَعْدَ مَا سَلَّمَ حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ حَدَّثَنَا أَبُو أُسَامَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَخْبَرَنَا أَبُو أُسَامَةَ أَخْبَرَنِي عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمَ فِي الرَّكْعَتَيْنِ فَذَكَرَ نَحْوَ حَدِيثِ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ ثُمَّ سَلَّمَ ثُمَّ سَجَدَ سَجْدَتَيْ السَّهْوِ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Asad] telah mengabarkan kepada kami [Syababah] telah menceritakan kepada kami [Ibnu Abu Dzi'b] dari [Sa'id bin Abu Sa'id Al Maqburi] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam beranjak pergi setelah selesai dari dua raka'at sholat wajib, maka seorang laki-laki bertanya kepada beliau; \"Apakah sholat telah di qashar wahai Rasulullah ataukah anda lupa?\" beliau menjawab; \"Semua itu tidak aku lakukan.\" Maka orang-orang berkata; \"Anda telah melakukan hal itu wahai Rasulullah!.\" Kemudian beliau mengerjakan dua raka'at yang tertinggal, lalu beliau beranjak pergi tanpa mengerjakan sujud sahwi dua kali.\" Abu Daud mengatakan; \"Hadits ini di riwayatkan pula oleh [Daud bin Al Hushain] dari [Abu Sufyan bekas budak Ibnnu Abu Ahmad] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam dengan kisah seperti ini, katanya; \"kemudian beliau sujud dua kali dan duduk setelah memberi salam.\" Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Ikrimah bin 'Ammar] dari [Dlamdlam bin Jaus Al Hiffani] telah menceritakan kepadaku [Abu Hurairah] dengan hadits seperti ini, katanya; \"Kemudian beliau sujud sahwi setelah memberi salam.\" Telah menceritakan kepada kami [Ahmad bin Muhammad bin Tsabit] telah menceritakan kepada kami [Abu Usamah], dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Al 'Ala`] telah mengabarkan kepada kami [Abu Usamah] telah mengabarkan kepadaku ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam sholat bersama kami, kemudian beliau salam di raka'at kedua…\" kemudian ia menyebutkan seperti hadits Ibnu Sirin dari Abu Hurairah dia berkata; \"Kemudian beliau salam lalu sujud sahwi dua kali.\""
            },
            {
                "number": 846,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا مَسْلَمَةُ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا خَالِدٌ الْحَذَّاءُ حَدَّثَنَا أَبُو قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَسَلَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثَلَاثِ رَكَعَاتٍ مِنْ الْعَصْرِ ثُمَّ دَخَلَ قَالَ عَنْ مَسْلَمَةَ الْحُجَرَ فَقَامَ إِلَيْهِ رَجُلٌ يُقَالُ لَهُ الْخِرْبَاقُ كَانَ طَوِيلَ الْيَدَيْنِ فَقَالَ لَهُ أَقُصِرَتْ الصَّلَاةُ يَا رَسُولَ اللَّهِ فَخَرَجَ مُغْضَبًا يَجُرُّ رِدَاءَهُ فَقَالَ أَصَدَقَ قَالُوا نَعَمْ فَصَلَّى تِلْكَ الرَّكْعَةَ ثُمَّ سَلَّمَ ثُمَّ سَجَدَ سَجْدَتَيْهَا ثُمَّ سَلَّمَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yazid bin Zurai'] dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Maslamah bin Muhammad] keduanya berkata; telah menceritakan kepada kami [Khalid Al Khaddza`] telah menceritakan kepada kami [Abu Qilabah] dari [Abu Al Muhallab] dari ['Imran bin Hushain] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam salam di raka'at ke tiga sholat Ashar, kemudian beliau masuk (rumah).\" -Katanya dari Maslamah- (beliau masuk) kamar, lalu seorang laki-laki yang bernama Khirbaq -seorang yang memiliki tangan panjang- berdiri, ia bertanya kepada Rasulullah shallallahu 'alaihi wasallam: \"Apakah sholat telah di qashar wahai Rasulullah?\" beliau lalu keluar dengan marah sambil memegang kainnya, beliau bersabda: \"Apakah perkataannya benar?\" mereka menjawab; \"Ya, benar.\" Maka beliau mengerjakan raka'at yang tertinggal kemudian beliau salam, setelah itu beliau sujud dua kali kemudian salam.\""
            },
            {
                "number": 847,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ الْمَعْنَى قَالَ حَفْصٌ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ خَمْسًا فَقِيلَ لَهُ أَزِيدَ فِي الصَّلَاةِ قَالَ وَمَا ذَاكَ قَالَ صَلَّيْتَ خَمْسًا فَسَجَدَ سَجْدَتَيْنِ بَعْدَ مَا سَلَّمَ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] dan [Muslim bin Ibrahim] sedangkan maksud haditsnya sama, Hafsh mengatakan; telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam sholat dzuhur lima raka'at, lantas di beritahukan kepada beliau; \"Apakah sholat telah di tambah (bilangan raka'atnya)?\" beliau bersabda: \"Apa maksudnya?\" mereka berkata; \"Anda telah sholat lima raka'at.\" Maka beliau sujud dua kali setelah salam.\""
            },
            {
                "number": 848,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ قَالَ قَالَ عَبْدُ اللَّهِصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِبْرَاهِيمُ فَلَا أَدْرِي زَادَ أَمْ نَقَصَ فَلَمَّا سَلَّمَ قِيلَ لَهُ يَا رَسُولَ اللَّهِ أَحَدَثَ فِي الصَّلَاةِ شَيْءٌ قَالَ وَمَا ذَاكَ قَالُوا صَلَّيْتَ كَذَا وَكَذَا فَثَنَى رِجْلَهُ وَاسْتَقْبَلَ الْقِبْلَةَ فَسَجَدَ بِهِمْ سَجْدَتَيْنِ ثُمَّ سَلَّمَ فَلَمَّا انْفَتَلَ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّهُ لَوْ حَدَثَ فِي الصَّلَاةِ شَيْءٌ أَنْبَأْتُكُمْ بِهِ وَلَكِنْ إِنَّمَا أَنَا بَشَرٌ أَنْسَى كَمَا تَنْسَوْنَ فَإِذَا نَسِيتُ فَذَكِّرُونِي وَقَالَ إِذَا شَكَّ أَحَدُكُمْ فِي صَلَاتِهِ فَلْيَتَحَرَّ الصَّوَابَ فَلْيُتِمَّ عَلَيْهِ ثُمَّ لِيُسَلِّمْ ثُمَّ لِيَسْجُدْ سَجْدَتَيْنِحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ بِهَذَا قَالَ فَإِذَا نَسِيَ أَحَدُكُمْ فَلْيَسْجُدْ سَجْدَتَيْنِ ثُمَّ تَحَوَّلَ فَسَجَدَ سَجْدَتَيْنِ قَالَ أَبُو دَاوُد رَوَاهُ حُصَيْنٌ نَحْوَ حَدِيثِ الْأَعْمَشِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari ['Alqamah] dia berkata; [Abdullah] berkata; \"Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat -Ibrahim mengatakan; \"Aku tidak tahu, apakah (raka'atnya) lebih ataukah kurang- setelah salam, di beritahukan kepada beliau; \"Wahai Rasulullah, (apakah) terjadi sesuatu yang nggek beres dalam sholat?\" beliau bersabda: \"Memangnya kenapa?\" mereka berkata; \"Anda sholat begini dan begini.\" Lalu beliau merubah posisi kakinya dan menghadap kiblat, bersujud bersama mereka dua kali, lalu salam. Setelah itu beliau menghadap kepada kami seraya bersabda: \"Kalau terjadi sesuatu yang nggak beres dalam sholat, aku beritahukan kepada kalian. Akan tetapi aku hanyalah manusia biasa yang terkadang lupa sebagaimana kalian lupa, oleh karena itu, apabila aku lupa, maka ingatkanlah aku.\" selanjutnya beliau bersabda: \"Apabila salah seorang dari kalian ragu dalam sholatnya, hendaknya ia mengambil sesuatu (raka'at) yang di yakininya, lalu menyempurnakannya, kemudian hendaknya ia sujud dua kali.\" telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Al A'masy] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] … seperti hadits sebelumnya… sabdanya: \"Apabila salah seorang dari kalian lupa, hendaknya ia sujud dua kali.\" kemudian beliau agak bergeser, lalu sujud dua kali.\" Abu Daud berkata; hadits ini juga diriwayatkan oleh [Hushain] seperti hadits Al A'masy. "
            },
            {
                "number": 849,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا جَرِيرٌ ح و حَدَّثَنَا يُوسُفُ بْنُ مُوسَى حَدَّثَنَا جَرِيرٌ وَهَذَا حَدِيثُ يُوسُفَ عَنْ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ عَنْ إِبْرَاهِيمَ بْنِ سُوَيْدٍ عَنْ عَلْقَمَةَ قَالَ قَالَ عَبْدُ اللَّهِصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسًا فَلَمَّا انْفَتَلَ تَوَشْوَشَ الْقَوْمُ بَيْنَهُمْ فَقَالَ مَا شَأْنُكُمْ قَالُوا يَا رَسُولَ اللَّهِ هَلْ زِيدَ فِي الصَّلَاةِ قَالَ لَا قَالُوا فَإِنَّكَ قَدْ صَلَّيْتَ خَمْسًا فَانْفَتَلَ فَسَجَدَ سَجْدَتَيْنِ ثُمَّ سَلَّمَ ثُمَّ قَالَ إِنَّمَا أَنَا بَشَرٌ أَنْسَى كَمَا تَنْسَوْنَ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah mengabarkan kepada kami [Jarir]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Yusuf bin Musa] telah menceritakan kepada kami [Jarir] dan ini adalah hadits Yusuf dari [Al Hasan bin 'ubaidhullah] dari [Ibrahim bin Suwaid] dari ['Alqamah] dia berkata; [Abdullah] berkata; \"Rasulullah shallallahu 'alaihi wasallam sholat lima raka'at bersama kami, setelah beliau selesai sholat, orang-orang orang-orang pada berbisik di antara mereka, maka beliau bersabda: \"Ada apa dengan kalian?\" mereka berkata; \"Wahai Rasulullah, apakah (raka'at) sholat di tambah?\" beliau menjawab: \"Tidak.\" Mereka berkata; \"Sesungguhnya anda sholat lima raka'at1.\" Setelah selesai, beliau melakukan dua kali sujud, lalu salam. Setelah itu beliau bersabda: \"Sesungguhnya aku adalah manusia biasa yang terkadang lupa sebagaimana kalian lupa.\""
            },
            {
                "number": 850,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ يَعْنِي ابْنَ سَعْدٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ أَنَّ سُوَيْدَ بْنَ قَيْسٍ أَخْبَرَهُ عَنْ مُعَاوِيَةَ بْنِ حُدَيْجٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى يَوْمًا فَسَلَّمَ وَقَدْ بَقِيَتْ مِنْ الصَّلَاةِ رَكْعَةٌ فَأَدْرَكَهُ رَجُلٌ فَقَالَ نَسِيتَ مِنْ الصَّلَاةِ رَكْعَةً فَرَجَعَ فَدَخَلَ الْمَسْجِدَ وَأَمَرَ بِلَالًا فَأَقَامَ الصَّلَاةَ فَصَلَّى لِلنَّاسِ رَكْعَةًفَأَخْبَرْتُ بِذَلِكَ النَّاسَ فَقَالُوا لِي أَتَعْرِفُ الرَّجُلَ قُلْتُ لَا إِلَّا أَنْ أَرَاهُ فَمَرَّ بِي فَقُلْتُ هَذَا هُوَ فَقَالُوا هَذَا طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits yaitu Ibnu Sa'd] dari [Yazid bin Abu Habib] bahwa [Suwaid bin Qais] telah mengabarkan kepadanya, dari [Mu'awiyah bin Hudaij] bahwa suatu hari Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat, kemudian salam. Padahal masih tersisa satu raka'at lagi, lalu seorang laki-laki menemui beliau sambil berkata; \"Anda lupa satu raka'at sholat.\" Maka beliau kembali masuk masjid dan menyuruh Bilal untuk menyerukan iqamah, kemudian beliau sholat satu raka'at bersama orang-orang.\" Lalu aku beritahukan peristiwa tersebut kepada orang-orang, mereka berkata kepadaku; \"Tahukah kamu laki-laki tersebut?\" jawabku; \"Tidak, kecuali jika aku di beritahu.\" Tiba-tiba seseorang lewati di hadapanku, maka aku berkata; \"Inikah orangnya?\" mereka menjawab; \"Ini adalah Thalhah bin 'ubaidhullah.\""
            },
            {
                "number": 851,
                "arab": "حَدَّثَنَا مُحَمَّدُّ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو خَالِدٍ عَنْ ابْنِ عَجْلَانَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا شَكَّ أَحَدُكُمْ فِي صَلَاتِهِ فَلْيُلْقِ الشَّكَّ وَلْيَبْنِ عَلَى الْيَقِينِ فَإِذَا اسْتَيْقَنَ التَّمَامَ سَجَدَ سَجْدَتَيْنِ فَإِنْ كَانَتْ صَلَاتُهُ تَامَّةً كَانَتْ الرَّكْعَةُ نَافِلَةً وَالسَّجْدَتَانِ وَإِنْ كَانَتْ نَاقِصَةً كَانَتْ الرَّكْعَةُ تَمَامًا لِصَلَاتِهِ وَكَانَتْ السَّجْدَتَانِ مُرْغِمَتَيْ الشَّيْطَانِقَالَ أَبُو دَاوُد رَوَاهُ هِشَامُ بْنُ سَعْدٍ وَمُحَمَّدُ بْنُ مُطَرِّفٍ عَنْ زَيْدٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحَدِيثُ أَبِي خَالِدٍ أَشْبَعُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Abu Khalid] dari [Ibnu Al 'Ajlan] dari [Zaid bin Aslam] dari ['Atha` bin Yasar] dari [Abu Sa'id Al Khudri] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian ragu dalam sholatnya, hendaknya ia meninggalkan keraguannya dan menetapkan yang di yakininya, apabila dia yakin (raka'atnya) telah sempurna, lalu sujud dua kali. Apabila ternyata raka'atnya telah sempurna, maka satu raka'at dan kedua sujudnya itu menjadi tambahan baginya (amalan sunnah), kalau memang ternyata raka'atnya kurang, maka raka'at itu menjadi penyempurna sholatnya dan kedua sujudnya itu sebagai pembuat syetan jengkel.\" Abu Daud berkata; \"Di riwayatkan pula oleh [Hisyam bin Sa'd] dan [Muhammad bin Mutharif] dari [Zaid] dari ['Atha` bin Yasar] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam, sedangkan haditsnya Abu Khalid lebih sempurna (daripada haditsnya Hisyam).\""
            },
            {
                "number": 852,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى عَنْ عَبْدِ اللَّهِ بْنِ كَيْسَانَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمَّى سَجْدَتَيْ السَّهْوِ الْمُرْغِمَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Aziz bin Abu Rizmah] telah mengabarkan kepada kami [Al Fadl bin Musa] dari [Abdullah bin Kaisan] dari ['Ikrimah] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam menamakan dua sujud sahwi (sujud karena lupa) sebagai Al Murghimataini (Pembuat syetan jengkel).\""
            },
            {
                "number": 853,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا شَكَّ أَحَدُكُمْ فِي صَلَاتِهِ فَلَا يَدْرِي كَمْ صَلَّى ثَلَاثًا أَوْ أَرْبَعًا فَلْيُصَلِّ رَكْعَةً وَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ قَبْلَ التَّسْلِيمِ فَإِنْ كَانَتْ الرَّكْعَةُ الَّتِي صَلَّى خَامِسَةً شَفَعَهَا بِهَاتَيْنِ وَإِنْ كَانَتْ رَابِعَةً فَالسَّجْدَتَانِ تَرْغِيمٌ لِلشَّيْطَانِحَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ الْقَارِيُّ عَنْ زَيْدِ بْنِ أَسْلَمَ بِإِسْنَادِ مَالِكٍ قَالَ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا شَكَّ أَحَدُكُمْ فِي صَلَاتِهِ فَإِنْ اسْتَيْقَنَ أَنْ قَدْ صَلَّى ثَلَاثًا فَلْيَقُمْ فَلْيُتِمَّ رَكْعَةً بِسُجُودِهَا ثُمَّ يَجْلِسْ فَيَتَشَهَّدْ فَإِذَا فَرَغَ فَلَمْ يَبْقَ إِلَّا أَنْ يُسَلِّمَ فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌ ثُمَّ لِيُسَلِّمْ ثُمَّ ذَكَرَ مَعْنَى مَالِكٍ قَالَ أَبُو دَاوُد وَكَذَلِكَ رَوَاهُ ابْنُ وَهْبٍ عَنْ مَالِكٍ وَحَفْصِ بْنِ مَيْسَرَةَ وَدَاوُدَ بْنِ قَيْسٍ وَهِشَامِ بْنِ سَعْدٍ إِلَّا أَنَّ هِشَامًا بَلَغَ بِهِ أَبَا سَعِيدٍ الْخُدْرِيَّ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Zaid bin Aslam] dari ['Atha` bin Yasar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian ragu dalam sholatnya, sehingga tidak tahu tiga atukah empat raka'atkah yang telah di kerjakan, hendaknya ia sujud dua kali ketika sedang duduk sebelum salam, jika ternyata raka'at yang di kerjakannya itu raka'at yang kelima, maka sholatnya di sempurnakan oleh dua sujud tersebut, sekiranya sudah cukup empar raka'at, maka sujudnya itu untuk menjengkelkan syetan.\" Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Ya'qub bin Abdurrahman Al Qarri] dari [Zaid bin Aslam] dengan isnadnya Malik dia berkata; Sesungguhnya Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian ragu dalam sholatnya, dan apabila ia meyakini telah mengerjakan tiga raka'at, hendaknya ia berdiri untuk menyempurnakan satu raka'at dengan sujudnya kemudian dia duduk sambil membaca tasyahud. Apabila telah selesai dan tinggal salam, hendaknya ia sujud dua kali kemudian salam…\" kemudian dia menyebutkan makna hadits Malik. Abu Daud mengatakan; \"Demikian juga yang di riwayatkan oleh [Ibnu Wahb] dari [Malik] dan [Hafsh bin Maisarah], [Daud bin Qais] serta [Hisyam bin Sa'd] kecuali Hisyam yang menyampaikan dari [Abu Sa'id Al Khudri].\""
            },
            {
                "number": 854,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ خُصَيْفٍ عَنْ أَبِي عُبَيْدَةَ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كُنْتَ فِي صَلَاةٍ فَشَكَكْتَ فِي ثَلَاثٍ أَوْ أَرْبَعٍ وَأَكْبَرُ ظَنِّكَ عَلَى أَرْبَعٍ تَشَهَّدْتَ ثُمَّ سَجَدْتَ سَجْدَتَيْنِ وَأَنْتَ جَالِسٌ قَبْلَ أَنْ تُسَلِّمَ ثُمَّ تَشَهَّدْتَ أَيْضًا ثُمَّ تُسَلِّمُقَالَ أَبُو دَاوُد رَوَاهُ عَبْدُ الْوَاحِدِ عَنْ خُصَيْفٍ وَلَمْ يَرْفَعْهُ وَوَافَقَ عَبْدَ الْوَاحِدِ أَيْضًا سُفْيَانُ وَشَرِيكٌ وَإِسْرَائِيلُ وَاخْتَلَفُوا فِي الْكَلَامِ فِي مَتْنِ الْحَدِيثِ وَلَمْ يُسْنِدُوهُ",
                "id": "Telah menceritakan kepada kami [An Nufaili] telah menceritakan kepada kami [Muhammad bin Salamah] dari [Khushaif] dari [Abu 'Ubaidah bin Abdullah] dari [ayahnya] dari Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Apabila kamu sedang sholat, kemudian ragu apakah tiga ataukah empat raka'at (yang telah di kerjakan), sedangkan berat prasangka kamu telah mengerjakan empat raka'at, maka tasyahudlah kamu kemudian sujud dua kali ketika masih duduk (tasyahud) sebelum salam, kemudian tasyahud lagi lalu salam.\" Abu Daud berkata; \"Telah di riwayatkan pula oleh [Abdul Wahid] dari [Khushaif] namun dia tidak merafa'kan, hadits Abdul Wahid juga di sepakati oleh [Sufyan], [Syarik] dan [Isra'il] dan mereka berbeda mengenai redaksi hadits yaitu dalam matannya, dan mereka tidak menyandarkan kepada seorang Perawi pun.\""
            },
            {
                "number": 855,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنَا عِيَاضٌ ح و حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ حَدَّثَنَا يَحْيَى عَنْ هِلَالِ بْنِ عِيَاضٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ فَلَمْ يَدْرِ زَادَ أَمْ نَقَصَ فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ قَاعِدٌ فَإِذَا أَتَاهُ الشَّيْطَانُ فَقَالَ إِنَّكَ قَدْ أَحْدَثْتَ فَلْيَقُلْ كَذَبْتَ إِلَّا مَا وَجَدَ رِيحًا بِأَنْفِهِ أَوْ صَوْتًا بِأُذُنِهِوَهَذَا لَفْظُ حَدِيثِ أَبَانَ قَالَ أَبُو دَاوُد و قَالَ مَعْمَرٌ وَعَلِيُّ بْنُ الْمُبَارَكِ عِيَاضُ بْنُ هِلَالٍ و قَالَ الْأَوْزَاعِيُّ عِيَاضُ بْنُ أَبِي زُهَيْرٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Isma'il bin Ibrahim] telah menceritakan kepada kami [Hisyam Ad Dastuwa`i] telah menceritakan kepada kami [Yahya bin Abu Katsir] telah menceritakan kepada kami ['Iyadl]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Aban] telah menceritakan kepada kami [Yahya] dari [Hilal bin 'Iyadl] dari [Abu Sa'id Al Khudri] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian sholat, dan tidak tahu apakah lebih ataukah kurang (raka'atnya) hendaknya ia sujud dua kali ketika masih duduk (tasyahud), apabila datang (was-was) syetan dan mengatakan; \"Kamu telah hadats (batal) \" hendaknya ia mengatakan; \"Kamu dusta\", melainkan jika ia hidungnya mencium angin (bau), atau telinganya mendengar suara.\" Ini adalah lafadz haditsnya Aban. Abu Daud mengatakan; (dari) Ma'mar, Ali bin Mubarrak. 'Iyadl bin Hilal. Al Auza'i mengatakan; \"'Iyadl bin abu Zuhair.\""
            },
            {
                "number": 856,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَحَدَكُمْ إِذَا قَامَ يُصَلِّي جَاءَهُ الشَّيْطَانُ فَلَبَّسَ عَلَيْهِ حَتَّى لَا يَدْرِيَ كَمْ صَلَّى فَإِذَا وَجَدَ أَحَدُكُمْ ذَلِكَ فَلْيَسْجُدْ سَجْدَتَيْنِ وَهُوَ جَالِسٌقَالَ أَبُو دَاوُد وَكَذَا رَوَاهُ ابْنُ عُيَيْنَةَ وَمَعْمَرٌ وَاللَّيْثُ حَدَّثَنَا حَجَّاجُ بْنُ أَبِي يَعْقُوبَ حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا ابْنُ أَخِي الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ بِهَذَا الْحَدِيثِ بِإِسْنَادِهِ زَادَ وَهُوَ جَالِسٌ قَبْلَ التَّسْلِيمِ حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا يَعْقُوبُ أَخْبَرَنَا أَبِي عَنْ ابْنِ إِسْحَقَ حَدَّثَنِي مُحَمَّدُ بْنُ مُسْلِمٍ الزُّهْرِيُّ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ فَلْيَسْجُدْ سَجْدَتَيْنِ قَبْلَ أَنْ يُسَلِّمَ ثُمَّ لِيُسَلِّمْ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian tengah mengerjakan sholat, maka syetan akan datang kepadanya kemudian ia mengacaukan (pikiran) hingga tidak tahu berapa kali dia sholat, apabila salah seorang dari kalian mendapati yang demikian itu, hendaknya ia sujud dua kali ketika masih duduk (tasyahud).\" Abu Daud mengatakan; \"Demikianlah yang di riwayatkan oleh [Ibnu 'Uyainah], [Ma'mar], [Al Laits]. Telah menceritakan kepada kami [Hajjaj bin Abu Ya'qub] telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [sepupunya Az Zuhri] dari [Muhammad bin Muslim] seperti isnad hadits ini, dia menambahkan; \"…ketika masih duduk sebelum salam.\" Telah menceritakan kepada kami [Hajjaj] telah menceritakan kepada kami [Ya'qub] telah mengabarkan kepada kami [ayahku] dari [Ibnu Ishaq] telah menceritakan kepadaku [Muhammad bin Muslim Az Zuhri] dengan isnad dan maknanya, dia berkata; \"…Kemudian dia sujud dua kali sebelum salam, lalu salam.\""
            },
            {
                "number": 857,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُسَافِعٍ أَنَّ مُصْعَبَ بْنَ شَيْبَةَ أَخْبَرَهُ عَنْ عُتْبَةَ بْنِ مُحَمَّدِ بْنِ الْحَارِثِ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ شَكَّ فِي صَلَاتِهِ فَلْيَسْجُدْ سَجْدَتَيْنِ بَعْدَمَا يُسَلِّمُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Ibrahim] telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] telah mengabarkan kepadaku [Abdullah bin Musafi'] bahwa [Mush'ab bin Syaibah] telah mengabarkan kepadanya, dari ['Utbah bin Muhammad bin Al Harits] dari [Abdullah bin Ja'far] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa ragu-ragu dalam sholatnya, hendaknya ia sujud dua kali setelah salam.\""
            },
            {
                "number": 858,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ أَنَّهُ قَالَصَلَّى لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ ثُمَّ قَامَ فَلَمْ يَجْلِسْ فَقَامَ النَّاسُ مَعَهُ فَلَمَّا قَضَى صَلَاتَهُ وَانْتَظَرْنَا التَّسْلِيمَ كَبَّرَ فَسَجَدَ سَجْدَتَيْنِ وَهُوَ جَالِسٌ قَبْلَ التَّسْلِيمِ ثُمَّ سَلَّمَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَحَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا أَبِي وَبَقِيَّةُ قَالَا حَدَّثَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ بِمَعْنَى إِسْنَادِهِ وَحَدِيثِهِ زَادَ وَكَانَ مِنَّا الْمُتَشَهِّدُ فِي قِيَامِهِ قَالَ أَبُو دَاوُد وَكَذَلِكَ سَجَدَهُمَا ابْنُ الزُّبَيْرِ قَامَ مِنْ ثِنْتَيْنِ قَبْلَ التَّسْلِيمِ وَهُوَ قَوْلُ الزُّهْرِيِّ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Abdurrahman bin Al A'raj] dari [Abdullah bin Buhainah] bahwa dia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat dua raka'at bersama kami, lalu beliau langsung berdiri, sementara beliau belum duduk (tasyahud), maka orang-orang pun berdiri mengikuti beliau, setelah selesai sholat, sedangkan kami tengah menunggu salam, beliau lalu bertakbir dan sujud dua kali sewaktu beliau duduk sebelum salam, kemudian beliau (shallallahu 'alaihi wasallam) salam.\" Telah menceritakan kepada kami ['Amru bin Utsman] telah menceritakan kepada kami [ayahku] dan [Baqiyah] keduanya berkata; telah menceritakan kepada kami [Syu'aib] dari [Az Zuhri] dengan maksud hadits dan isnad yang sama, dia menambahkan; \"…di antara kami ada juga yang membaca tasyahud ketika beliau berdiri (karena lupa).\" Abu Daud berkata; \"Demikianlah Ibnu Zubair mengerjakan kedua sujud, beliau berdiri dari raka'at kedua sebelum memberi salam\" ini adalah pendapat Az Zuhri. "
            },
            {
                "number": 859,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ الْوَلِيدِ عَنْ سُفْيَانَ عَنْ جَابِرٍ يَعْنِي الْجُعْفِيَّ قَالَ حَدَّثَنَا الْمُغِيرَةُ بْنُ شُبَيْلٍ الْأَحْمَسِيُّ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ الْإِمَامُ فِي الرَّكْعَتَيْنِ فَإِنْ ذَكَرَ قَبْلَ أَنْ يَسْتَوِيَ قَائِمًا فَلْيَجْلِسْ فَإِنْ اسْتَوَى قَائِمًا فَلَا يَجْلِسْ وَيَسْجُدْ سَجْدَتَيْ السَّهْوِقَالَ أَبُو دَاوُد وَلَيْسَ فِي كِتَابِي عَنْ جَابِرٍ الْجُعْفِيِّ إِلَّا هَذَا الْحَدِيثُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin 'Amru] dari [Abdullah bin Walid] dari [Sufyan] dari [Jabir yaitu Al Ju'fi] dia berkata; telah menceritakan kepada kami [Al Mughirah bin Syubail Al Ahmasi] dari [Qais bin Abu Hazim] dari [Al Mughirah bin Syu'bah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda; \"Apabila seorang imam terlanjur berdiri pada raka'at kedua, dan ingat sebelum berdiri tegak, hendaknya ia kembali duduk, dan apabila telah berdiri tegak hendaknya ia tidak duduk dan sujudlah dua kali yaitu sujud sahwi.\" Abu Daud berkata; \"Dan dalam kitabku tidak di sebutkan dari Jabir Al Ju'fi kecuali dari hadits ini.\""
            },
            {
                "number": 860,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْجُشَمِيُّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْمَسْعُودِيُّ عَنْ زِيَادِ بْنِ عِلَاقَةَ قَالَصَلَّى بِنَا الْمُغِيرَةُ بْنُ شُعْبَةَ فَنَهَضَ فِي الرَّكْعَتَيْنِ قُلْنَا سُبْحَانَ اللَّهِ قَالَ سُبْحَانَ اللَّهِ وَمَضَى فَلَمَّا أَتَمَّ صَلَاتَهُ وَسَلَّمَ سَجَدَ سَجْدَتَيْ السَّهْوِ فَلَمَّا انْصَرَفَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ كَمَا صَنَعْتُقَالَ أَبُو دَاوُد وَكَذَلِكَ رَوَاهُ ابْنُ أَبِي لَيْلَى عَنْ الشَّعْبِيِّ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ وَرَفَعَهُ وَرَوَاهُ أَبُو عُمَيْسٍ عَنْ ثَابِتِ بْنِ عُبَيْدٍ قَالَ صَلَّى بِنَا الْمُغِيرَةُ بْنُ شُعْبَةَ مِثْلَ حَدِيثِ زِيَادِ بْنِ عِلَاقَةَ قَالَ أَبُو دَاوُد أَبُو عُمَيْسٍ أَخُو الْمَسْعُودِيِّ وَفَعَلَ سَعْدُ بْنُ أَبِي وَقَّاصٍ مِثْلَ مَا فَعَلَ الْمُغِيرَةُ وَعِمْرَانُ بْنُ حُصَيْنٍ وَالضَّحَّاكُ بْنُ قَيْسٍ وَمُعَاوِيَةُ بْنُ أَبِي سُفْيَانَ وَابْنُ عَبَّاسٍ أَفْتَى بِذَلِكَ وَعُمَرُ بْنُ عَبْدِ الْعَزِيزِ قَالَ أَبُو دَاوُد وَهَذَا فِيمَنْ قَامَ مِنْ ثِنْتَيْنِ ثُمَّ سَجَدُوا بَعْدَ مَا سَلَّمُوا",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Umar Al Jusyami] telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Al Mas'udi] dari [Ziyad bin 'Ilaqah] dia berkata; \" [Al Mughirah bin Syu'bah] sholat bersama kami, lalu langsung berdiri di raka'at kedua, lantas kami mengucapkan \"Subhanallah\" dia juga mengucapkan; \"Subhanallah\" dan dia terus berdiri. Setelah menyempurnakan sholat dan memberi salam, dia sujud sahwi dua kali, seusai sholat dia berkata; \"Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam mengerjakan seperti yang aku kerjakan.\" Abu Daud berkata; \"Demikian pula yang di riwayatkan oleh [Ibnu Abu Laila] dari [Asy Sya'bi] dari [Al Mughirah bin Syu'bah] dan dia merafa'kan hadits tersebut.\" Dan di riwayatkan pula oleh [Abu 'Umais] dari [Tsabit bin 'Ubaid] dia berkata; \" [Al Mughirah bin Syu'bah] sholat bersama kami…\" seperti haditsnya Ziyad bin 'Ilaqah. Abu Daud mengatakan; \"Abu 'Umais adalah saudara Al Mas'udi, sedangkan Sa'd bin Abu Waqash juga pernah mengerjakan apa yang di kerjakan oleh Al Mughirah, begitu juga dengan 'Imran bin Hushain, Dlahak bin Qais, Mu'awiyah bin Abu Sufyan dan Ibnu Abbas. Umar bin Abdul Aziz juga pernah memberi fatwa seperti itu. Abu Daud berkata; \"Dan yang demikian bagi orang yang langsung berdiri dari dua raka'at (lupa dari tasyahud), kemudian dia sujud (sahwi) setelah salam.\""
            },
            {
                "number": 861,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ وَالرَّبِيعُ بْنُ نَافِعٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ وَشُجَاعُ بْنُ مَخْلَدٍ بِمَعْنَى الْإِسْنَادِ أَنَّ ابْنَ عَيَّاشٍ حَدَّثَهُمْ عَنْ عُبَيْدِ اللَّهِ بْنِ عُبَيْدٍ الْكَلَاعِيِّ عَنْ زُهَيْرٍ يَعْنِي ابْنَ سَالِمٍ الْعَنْسِيَّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ قَالَ عَمْرٌو وَحْدَهُ عَنْ أَبِيهِ عَنْ ثَوْبَانَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِكُلِّ سَهْوٍ سَجْدَتَانِ بَعْدَ مَا يُسَلِّمُوَلَمْ يَذْكُرْ عَنْ أَبِيهِ غَيْرُ عَمْرٍو",
                "id": "Telah menceritakan kepada kami ['Amru bin Utsman], [Ar Rabi' bin Nafi'], [Utsman bin Abu Syaibah] dan [Syuja' bin Makhlad], semakna dengan isnad, bahwa [Ibnu 'Ayyasy] telah menceritakan kepada mereka, dari ['ubaidhullah bin 'Ubaid al Kala'i] dari [Zuhair yaitu Ibnu Salim Al 'Ansi] dari [Abdurrahman bin Jubair bin Nufair], 'Amru mengatakan secara munfarid (sendirian) dari [ayahnya] dari [Tsauban] dari Nabi shallallahu 'alaihi wasallam beliau bersabda; 'Setiap kali lupa, ada dua kali sujud setelah salam.\" Namun dia tidak menyebutkan dari ayahnya tanpa sebutan 'Amru. "
            },
            {
                "number": 862,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُثَنَّى حَدَّثَنِي أَشْعَثُ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ خَالِدٍ يَعْنِي الْحَذَّاءَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِهِمْ فَسَهَا فَسَجَدَ سَجْدَتَيْنِ ثُمَّ تَشَهَّدَ ثُمَّ سَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] telah menceritakan kepada kami [Muhammad bin Abdullah bin Al Mutsanna] telah menceritakan kepadaku [Asy'ats] dari [Muhammad bin Sirin] dari [Khalid yaitu Al Khaddza`] dari [Abu Qilabah] dari [Abu Al Muhallab] dari ['Imran bin Hushain] bahwa Nabi shallallahu 'alaihi wasallam sholat bersama mereka lalu lupa, maka beliau sujud dua kali, lalu tasyahud dan salam.\""
            },
            {
                "number": 863,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَمُحَمَّدُ بْنُ رَافِعٍ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ هِنْدِ بِنْتِ الْحَارِثِ عَنْ أُمِّ سَلَمَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَلَّمَ مَكَثَ قَلِيلًا وَكَانُوا يَرَوْنَ أَنَّ ذَلِكَ كَيْمَا يَنْفُذُ النِّسَاءُ قَبْلَ الرِّجَالِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] dan [Muhammad bin Rafi'] keduanya berkata; telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Hind binti Al Harits] dari [Ummu Salamah] dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam salam (dari sholat), beliau berhenti sejenak.\" -mereka berpendapat, yang demikian supaya para wanita keluar lebih dahulu sebelum kaum laki-laki.\""
            },
            {
                "number": 864,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ قَبِيصَةَ بْنِ هُلْبٍ رَجُلٍ مِنْ طَيِّئٍ عَنْ أَبِيهِأَنَّهُ صَلَّى مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ يَنْصَرِفُ عَنْ شِقَّيْهِ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah] dari [Syimak bin Harb] dari [Qabishah bin Hulb] -seorang laki-laki dari kabilah Thayi`- dari [ayahnya] bahwa dia pernah sholat bersama Nabi shallallahu 'alaihi wasallam, dan beliau biasa berbalik dari dua sisi (kanan dan kiri).\""
            },
            {
                "number": 865,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ الْأَسْوَدِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ قَالَلَا يَجْعَلُ أَحَدُكُمْ نَصِيبًا لِلشَّيْطَانِ مِنْ صَلَاتِهِ أَنْ لَا يَنْصَرِفَ إِلَّا عَنْ يَمِينِهِ وَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْثَرُ مَا يَنْصَرِفُ عَنْ شِمَالِهِقَالَ عُمَارَةُ أَتَيْتُ الْمَدِينَةَ بَعْدُ فَرَأَيْتُ مَنَازِلَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ يَسَارِهِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Syu'bah] dari [Sulaiman] dari ['Umarah bin 'Umair] dari [Al Aswad bin Yazid] dari [Abdullah] dia berkata; \"Jangan sekali-kali salah seorang dari kalian memberi kesempatan bagi syetan dalam sholatnya, hendaknya ia tidak berbalik kecuali ke sisi kanan. Namun aku melihat Rasulullah shallallahu 'alaihi wasallam paling banyak berbalik ke sisi kiri.\" Ammarah berkata; \"Setelah itu, aku mengunjungi Madinah, maka aku dapati rumah-rumah Nabi shallallahu 'alaihi wasallam di sebelah kiri beliau.\""
            },
            {
                "number": 866,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْعَلُوا فِي بُيُوتِكُمْ مِنْ صَلَاتِكُمْ وَلَا تَتَّخِذُوهَا قُبُورًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Hanbal] telah menceritakan kepada kami [Yahya] dari ['ubaidhullah] telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jadikanlah rumah-rumah kalian sebagai tempat mengerjakan sholat (sunnah), dan janganlah kalian jadikan sebagai kuburan.\""
            },
            {
                "number": 867,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلَالٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي النَّضْرِ عَنْ أَبِيهِ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْدِ بْنِ ثَابِتٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ الْمَرْءِ فِي بَيْتِهِ أَفْضَلُ مِنْ صَلَاتِهِ فِي مَسْجِدِي هَذَا إِلَّا الْمَكْتُوبَةَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku [Sulaiman bin Bilal] dari [Ibrahim bin Abu An Nadlr] dari [ayahnya] dari [Busr bin Sa'id] dari [Zaid bin Tsabit] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat seseorang di rumahnya itu lebih utama daripada sholatnya dia di masjidku ini, kecuali sholat fardlu.\""
            },
            {
                "number": 868,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ وَحُمَيْدٍ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابَهُ كَانُوا يُصَلُّونَ نَحْوَ بَيْتِ الْمَقْدِسِ فَلَمَّا نَزَلَتْ هَذِهِ الْآيَةُ{ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ وَحَيْثُ مَا كُنْتُمْ فَوَلُّوا وُجُوهَكُمْ شَطْرَهُ }فَمَرَّ رَجُلٌ مِنْ بَنِي سَلَمَةَ فَنَادَاهُمْ وَهُمْ رُكُوعٌ فِي صَلَاةِ الْفَجْرِ نَحْوَ بَيْتِ الْمَقْدِسِ أَلَا إِنَّ الْقِبْلَةَ قَدْ حُوِّلَتْ إِلَى الْكَعْبَةِ مَرَّتَيْنِ فَمَالُوا كَمَا هُمْ رُكُوعٌ إِلَى الْكَعْبَةِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Tsabit] dan [Humaid] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam dan para sahabatnya sholat menghadap ke arah Baitul Maqdis, ketika turun ayat; \"Palingkanlah mukamu ke arah Masjidil Haram. dan dimana saja kamu berada, palingkanlah mukamu ke arahnya.\" (QS Al Baqarah; 144), lalu seorang laki-laki dari Bani Salamah lewat dan berseru kepada kaumnya ketika mereka sedang ruku' dalam sholat dengan menghadap Baitul Maqdis; \"Ketahuilah, bahwa kiblat telah di alihkan ke Ka'bah -ia berseru dua kali- akhirnya mereka beralih ke Ka'bah dalam posisi ruku'.\""
            },
            {
                "number": 869,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُهْبِطَ وَفِيهِ تِيبَ عَلَيْهِ وَفِيهِ مَاتَ وَفِيهِ تَقُومُ السَّاعَةُ وَمَا مِنْ دَابَّةٍ إِلَّا وَهِيَ مُسِيخَةٌ يَوْمَ الْجُمُعَةِ مِنْ حِينَ تُصْبِحُ حَتَّى تَطْلُعَ الشَّمْسُ شَفَقًا مِنْ السَّاعَةِ إِلَّا الْجِنَّ وَالْإِنْسَ وَفِيهِ سَاعَةٌ لَا يُصَادِفُهَا عَبْدٌ مُسْلِمٌ وَهُوَ يُصَلِّي يَسْأَلُ اللَّهَ حَاجَةً إِلَّا أَعْطَاهُ إِيَّاهَا قَالَ كَعْبٌ ذَلِكَ فِي كُلِّ سَنَةٍ يَوْمٌ فَقُلْتُ بَلْ فِي كُلِّ جُمُعَةٍ قَالَ فَقَرَأَ كَعْبٌ التَّوْرَاةَ فَقَالَ صَدَقَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ أَبُو هُرَيْرَةَ ثُمَّ لَقِيتُ عَبْدَ اللَّهِ بْنَ سَلَامٍ فَحَدَّثْتُهُ بِمَجْلِسِي مَعَ كَعْبٍ فَقَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ قَدْ عَلِمْتُ أَيَّةَ سَاعَةٍ هِيَ قَالَ أَبُو هُرَيْرَةَ فَقُلْتُ لَهُ فَأَخْبِرْنِي بِهَا فَقَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ هِيَ آخِرُ سَاعَةٍ مِنْ يَوْمِ الْجُمُعَةِ فَقُلْتُ كَيْفَ هِيَ آخِرُ سَاعَةٍ مِنْ يَوْمِ الْجُمُعَةِ وَقَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُصَادِفُهَا عَبْدٌ مُسْلِمٌ وَهُوَ يُصَلِّي وَتِلْكَ السَّاعَةُ لَا يُصَلِّي فِيهَا فَقَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ أَلَمْ يَقُلْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ جَلَسَ مَجْلِسًا يَنْتَظِرُ الصَّلَاةَ فَهُوَ فِي صَلَاةٍ حَتَّى يُصَلِّيَ قَالَ فَقُلْتُ بَلَى قَالَ هُوَ ذَاكَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Yazid bin Abdullah bin Al Had] dari [Muhammad bin Ibrahim] dari [Abu Salamah bin Abdurrahman] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik hari ketika matahari terbit adalah hari Jum'at, pada hari itu Adam di cipta, pada hari itu Adam di turunkan dari surga, pada hari itu pula taubatnya di terima, pada hari itu juga ia wafat, pada hari itu Kiamat akan terjadi dan tidak ada binatang melata satu pun kecuali mereka menunggu pada hari Jum'at sejak shubuh sampai terbit matahari karena takut akan datangnya hari Kiamat kecuali Jin dan manusia, pada hari Jum 'at ada suatu waktu yang tidaklah seorang mukmin pun ketika sholat, dan berdo'a meminta sesuatu kepada Allah yang bertepatan dengan waktu itu, melainkan Allah akan mengabulkannya\". Ka'ab lalu berkata; 'Apakah waktu itu hanya ada dalam satu hari di setiap tahun? '. Jawabku; 'Bahkan waktu itu ada pada setiap hari Jum'at'. Lantas Ka'ab membaca Taurat. Kemudian berkata; 'Rasulullah Shalallahu 'Alaihi Wa Sallam benar, hari itu ada pada setiap hari Jum'at'. Abu Hurairah berkata; \"Kemudian aku menemui Abdullah bin Salam, lalu aku ceritakan peristiwaku bersama Ka'ab ketika di majlisku.\" Maka [Abdullah bin Salam] berkata; \"Sungguh aku tahu saat itu.\" Abu Hurairah berkata; \"Beritahukanlah kepadaku saat itu.\" Abdullah bin Salam menjawab; \"Saat itu adalah waktu terakhir pada hari Jum'at.\" Kataku; \"Bagaimana saat itu bisa terjadi di akhir hari Jum'at? Padahal Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dan tidaklah seorang hamba muslim yang sholat pada waktu itu, dan tidaklah ia sholat …\" Maka Abdullah bin Salam berkata; \"Tidakkah Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bermajlis untuk menunggu sholat, maka ia terus dihitung dalam sholat hingga ia benar-benar sholat.\" Abu Hurairah berkata; jawabku; \"Benar.\" Abdullah bin Salam berkata; \"Itulah waktunya.\""
            },
            {
                "number": 870,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ جَابِرٍ عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ عَنْ أَوْسِ بْنِ أَوْسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ أَفْضَلِ أَيَّامِكُمْ يَوْمَ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ قُبِضَ وَفِيهِ النَّفْخَةُ وَفِيهِ الصَّعْقَةُ فَأَكْثِرُوا عَلَيَّ مِنْ الصَّلَاةِ فِيهِ فَإِنَّ صَلَاتَكُمْ مَعْرُوضَةٌ عَلَيَّ قَالَ قَالُوا يَا رَسُولَ اللَّهِ وَكَيْفَ تُعْرَضُ صَلَاتُنَا عَلَيْكَ وَقَدْ أَرِمْتَ يَقُولُونَ بَلِيتَ فَقَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ حَرَّمَ عَلَى الْأَرْضِ أَجْسَادَ الْأَنْبِيَاءِ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Husain bin Ali] dari [Abdurrahman bin Yazid bin Jabir] dari [Abu Al Asy'Ats Tsauri Ash Shan'ani] dari [Aus bin Aus] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya di antara hari-harimu yang paling utama adalah hari Jum'at, pada hari itu Adam di ciptakan, pada hari itu beliau wafat, pada hari itu juga ditiup (sangkakala) dan pada hari itu juga mereka pingsan. Maka perbanyaklah shalawat kepadaku -karena- shalawat kalian akan disampaikan kepadaku.\" Aus bin Aus berkata; para sahabat bertanya; \"Wahai Rasulullah Shalallahu, bagaimana mungkin shalawat kami bisa disampaikan kepadamu, sementara anda telah tiada (meninggal)? -atau mereka berkata; \"Telah hancur (menjadi tulang) \"- Beliau bersabda: \"Sesungguhnya Allah Azza wa Jalla mengharamkan bumi untuk memakan jasad para Nabi.\""
            },
            {
                "number": 871,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو يَعْنِي ابْنَ الْحَارِثِ أَنَّ الْجُلَاحَ مَوْلَى عَبْدِ الْعَزِيزِ حَدَّثَهُ أَنَّ أَبَا سَلَمَةَ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ يَوْمُ الْجُمُعَةِ ثِنْتَا عَشْرَةَ يُرِيدُ سَاعَةً لَا يُوجَدُ مُسْلِمٌ يَسْأَلُ اللَّهَ عَزَّ وَجَلَّ شَيْئًا إِلَّا أَتَاهُ اللَّهُ عَزَّ وَجَلَّ فَالْتَمِسُوهَا آخِرَ سَاعَةٍ بَعْدَ الْعَصْرِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Ibnu 'Amru yaitu Ibnu Al Harits] bahwa [Al Julah bekas budak Abdul Aziz] telah menceritakan kepadanya, bahwa [Abu Salamah yaitu Ibnu Abdurrahman] telah menceritakan kepadanya, dari [Jabir bin Abdullah] dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau bersabda; \"Hari jum'at itu dua belas -maksudnya jam- dan tidak di dapati seorang muslim pun yang meminta kepada Allah kecuali Allah 'azza wajalla akan mengabulkannya, maka bersegeralah untuk mendapatkannya pada waktu-waktu akhir setelah Ashar.\""
            },
            {
                "number": 872,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَخْرَمَةُ يَعْنِي ابْنَ بُكَيْرٍ عَنْ أَبِيهِ عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَ قَالَ لِي عَبْدُ اللَّهِ بْنُ عُمَرَ أَسَمِعْتَ أَبَاكَ يُحَدِّثُعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شَأْنِ الْجُمُعَةِ يَعْنِي السَّاعَةَ قَالَ قُلْتُ نَعَمْ سَمِعْتُهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ هِيَ مَا بَيْنَ أَنْ يَجْلِسَ الْإِمَامُ إِلَى أَنْ تُقْضَى الصَّلَاةُقَالَ أَبُو دَاوُد يَعْنِي عَلَى الْمِنْبَرِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Makhramah yaitu Ibnu Bukair] dari [ayahnya] dari [Abu Burdah bin Abu Musa Al Asy'ari] dia berkata; [Abdullah bin Umar] berkata kepadaku; \"Apakah kamu pernah mendengar ayahmu mengatakan suatu hadits dari Rasulullah shallallahu 'alaihi wasallam mengenai waktu yang mustajab di hari Jum'at?\" Aku menjawab; \"Ya! Aku pernah mendengar dia berkata, (katanya); aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda; \"(waktu mustajab hari Jum'at) terjadi antara tempat duduknya imam hingga selesai sholat (Jum'at).\" Abu Daud berkata; \"Maksudnya ketika masih diatas mimbar.\""
            },
            {
                "number": 873,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ أَتَى الْجُمُعَةَ فَاسْتَمَعَ وَأَنْصَتَ غُفِرَ لَهُ مَا بَيْنَ الْجُمُعَةِ إِلَى الْجُمُعَةِ وَزِيَادَةَ ثَلَاثَةِ أَيَّامٍ وَمَنْ مَسَّ الْحَصَى فَقَدْ لَغَا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berwudlu' dengan menyempurnakan wudlu'nya, kemudian mendatangi sholat jum'at, mendengarkan dan memperhatikan (Khutbah Jum'at), maka dosa-dosanya akan di ampuni hingga jum'at berikutnya, di tambah tiga hari. Dan barangsiapa bermain kerikil, sungguh (jum'atnya) telah sia-sia.\""
            },
            {
                "number": 874,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا عِيسَى حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ قَالَ حَدَّثَنِي عَطَاءٌ الْخُرَاسَانِيُّ عَنْ مَوْلَى امْرَأَتِهِ أُمِّ عُثْمَانَ قَالَسَمِعْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ عَلَى مِنْبَرِ الْكُوفَةِ يَقُولُ إِذَا كَانَ يَوْمُ الْجُمُعَةِ غَدَتْ الشَّيَاطِينُ بِرَايَاتِهَا إِلَى الْأَسْوَاقِ فَيَرْمُونَ النَّاسَ بِالتَّرَابِيثِ أَوْ الرَّبَائِثِ وَيُثَبِّطُونَهُمْ عَنْ الْجُمُعَةِ وَتَغْدُو الْمَلَائِكَةُ فَيَجْلِسُونَ عَلَى أَبْوَابِ الْمَسْجِدِ فَيَكْتُبُونَ الرَّجُلَ مِنْ سَاعَةٍ وَالرَّجُلَ مِنْ سَاعَتَيْنِ حَتَّى يَخْرُجَ الْإِمَامُ فَإِذَا جَلَسَ الرَّجُلُ مَجْلِسًا يَسْتَمْكِنُ فِيهِ مِنْ الِاسْتِمَاعِ وَالنَّظَرِ فَأَنْصَتَ وَلَمْ يَلْغُ كَانَ لَهُ كِفْلَانِ مِنْ أَجْرٍ فَإِنْ نَأَى وَجَلَسَ حَيْثُ لَا يَسْمَعُ فَأَنْصَتَ وَلَمْ يَلْغُ لَهُ كِفْلٌ مِنْ أَجْرٍ وَإِنْ جَلَسَ مَجْلِسًا يَسْتَمْكِنُ فِيهِ مِنْ الِاسْتِمَاعِ وَالنَّظَرِ فَلَغَا وَلَمْ يُنْصِتْ كَانَ لَهُ كِفْلٌ مِنْ وِزْرٍ وَمَنْ قَالَ يَوْمَ الْجُمُعَةِ لِصَاحِبِهِ صَهٍ فَقَدْ لَغَا وَمَنْ لَغَا فَلَيْسَ لَهُ فِي جُمُعَتِهِ تِلْكَ شَيْءٌ ثُمَّ يَقُولُ فِي آخِرِ ذَلِكَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ذَلِكَقَالَ أَبُو دَاوُد رَوَاهُ الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ ابْنِ جَابِرٍ قَالَ بِالرَّبَائِثِ وَقَالَ مَوْلَى امْرَأَتِهِ أُمِّ عُثْمَانَ بْنِ عَطَاءٍ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami [Isa] telah menceritakan kepada kami [Abdurrahman bin Yazid bin Jabir] dia berkata; telah menceritakan kepadaku ['Atha` Al Khurasani] dari [bekas budak isterinya Ummu Ustman] dia berkata; aku mendengar [Ali radliallahu 'anhu] berkata ketika di atas mimbar di Kufah: \"Apabila datang hari jum'at, maka setan akan berpagi-pagi dengan membawa benderanya menuju pasar-pasar sambil menaburkan rintangan atau penghalang-penghalang sehingga mereka mengakhirkan sholat jum'at, sementara para Malaikat berpagi-pagi dan duduk di pintu-pintu masjid mencacat manusia berdasarkan tingkatan mereka yang lebih awal dan orang yang berikutnya sampai Imam keluar, maka apabila seseorang duduk diam untuk mendengar dan memperhatikan serta tidak lalai, maka baginya dua bagian pahala, dan barangsiapa yang menjauh (dari imam), tidak mendengar dan diam serta tidak lalai maka baginya satu bagian dari pahala, dan barangsiapa duduk mendekat (kepada imam) kemudian duduk untuk mendengarkan dan memperhatikan, namun dirinya lalai dan tidak biasa diam, maka baginya satu bagian dari dosa, dan barangsiapa berkata kepada temannya \"diamlah\" pada waktu (khutbah) jum'at, maka ia telah lalai (bebuat sia-sia), dan barangsiapa lalai, maka ia tidak mendapatkan bagian dari Jum'atnya.\" Di akhir dari hadits tersebut, Ali berkata; \"saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda seperti itu.\" Abu Daud mengatakan; \"di riwayatkan pula oleh [Al Walid bin Muslim] dari [Ibnu Jabir] dia berkata dengan redaksi lafadz \"bir rabaa`is (rintangan).\" Dan berkata pula bekas budak istrinya yaitu Ummu Utsman bin 'Atha` seperti itu.\""
            },
            {
                "number": 875,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ مُحَمَّدِ بْنِ عَمْرٍو قَالَ حَدَّثَنِي عَبِيدَةُ بْنُ سُفْيَانَ الْحَضْرَمِيُّ عَنْ أَبِي الْجَعْدِ الضَّمْرِيِّ وَكَانَتْ لَهُ صُحْبَةٌأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَرَكَ ثَلَاثَ جُمَعٍ تَهَاوُنًا بِهَا طَبَعَ اللَّهُ عَلَى قَلْبِهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Muhammad bin 'Amru] dia berkata; telah menceritakan kepadaku ['Abidah bin Sufyan Al Hadlrami] dari [Abu Al Ja'd Adl Dlamri] -beliau termasuk dari sahabat Nabi- bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meninggalkan Jum'at tiga kali karena meremehkannya, Allah menutup pintu hatinya.\""
            },
            {
                "number": 876,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ قُدَامَةَ بْنِ وَبَرَةَ الْعُجَيْفِيِّ عَنْ سَمُرَةَ بْنِ جُنْدُبٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَرَكَ الْجُمُعَةَ مِنْ غَيْرِ عُذْرٍ فَلْيَتَصَدَّقْ بِدِينَارٍ فَإِنْ لَمْ يَجِدْ فَبِنِصْفِ دِينَارٍقَالَ أَبُو دَاوُد وَهَكَذَا رَوَاهُ خَالِدُ بْنُ قَيْسٍ وَخَالَفَهُ فِي الْإِسْنَادِ وَوَافَقَهُ فِي الْمَتْنِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] dari [Qudamah bin Wabarah Al 'Ujaifi] dari [Samurah bin Jundab] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meninggalkan Jum'at tanpa ada udzur (syar'i) hendaknya ia bersedekah satu Dinar, apabila ia tidak mendapati (satu Dinar), maka dengan setengah Dinar.\" Abu Daud mengatakan; \"Demikianlah yang di riwayatkan Khalid bin Qais, ia menyelisihinya dalam isnad, namun sepakat pada matan-nya.\""
            },
            {
                "number": 877,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ وَإِسْحَقُ بْنُ يُوسُفَ عَنْ أَيُّوبَ أَبِي الْعَلَاءِ عَنْ قَتَادَةَ عَنْ قُدَامَةَ بْنِ وَبَرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ فَاتَهُ الْجُمُعَةُ مِنْ غَيْرِ عُذْرٍ فَلْيَتَصَدَّقْ بِدِرْهَمٍ أَوْ نِصْفِ دِرْهَمٍ أَوْ صَاعِ حِنْطَةٍ أَوْ نِصْفِ صَاعٍقَالَ أَبُو دَاوُد رَوَاهُ سَعِيدُ بْنُ بَشِيرٍ عَنْ قَتَادَةَ هَكَذَا إِلَّا أَنَّهُ قَالَ مُدًّا أَوْ نِصْفَ مُدٍّ وَقَالَ عَنْ سَمُرَةَ قَالَ أَبُو دَاوُد سَمِعْت أَحْمَدَ بْنَ حَنْبَلٍ يُسْأَلُ عَنْ اخْتِلَافِ هَذَا الْحَدِيثِ فَقَالَ هَمَّامٌ عِنْدِي أَحْفَظُ مِنْ أَيُّوبَ يَعْنِي أَبَا الْعَلَاءِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] telah menceritakan kepada kami [Muhammad bin Yazid] dan [Ishaq bin Yusuf] dari [Ayyub Abu Al 'Ala`] dari [Qatadah] dari [Qudamah bin Wabarah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meninggalkan jum'at tanpa ada udzur (syar'i), hendaknya ia bersedekah satu dirham atau setengah dirham atau satu sha' gandum atau setengahnya.\" Abu Daud berkata; \"di riwayatkan pula oleh [Sa'id bin Basyir] dari [Qatadah] seperti ini, namun dia mengatakan; \"satu mud atau setengahnya.\" perawi berkata; dari [Samurah]. Abu Daud berkata; saya mendengar Ahmad bin Hanbal bertanya mengenai perbedaan hadits ini, maka Hammam berkata; \"Menurutku dia lebih hafal dari Ayyub yaitu Ibnu Al 'Ala`.\""
            },
            {
                "number": 878,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ أَنَّ مُحَمَّدَ بْنَ جَعْفَرٍ حَدَّثَهُ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْكَانَ النَّاسُ يَنْتَابُونَ الْجُمُعَةَ مِنْ مَنَازِلِهِمْ وَمِنْ الْعَوَالِي",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku ['Amru] dari ['ubaidhullah bin Abu Ja'far] bahwa [Muhammad bin Ja'far] telah menceritakan kepadanya dari ['Urwah bin Az Zubair] dari [Aisyah istri Rasulullah shallallahu 'alaihi wasallam] bahwa dia berkata; \"Orang-orang berbondong-bondong untuk melaksanakan sholat jum'at dari rumah-rumah mereka dan dari 'Awali (dataran tinggi yang jaraknya sekitar empat mil dari Madinah). "
            },
            {
                "number": 879,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا قَبِيصَةُ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ سَعِيدٍ يَعْنِي الطَّائِفِيَّ عَنْ أَبِي سَلَمَةَ بْنِ نُبَيْهٍ عَنْ عَبْدِ اللَّهِ بْنِ هَارُونَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْجُمُعَةُ عَلَى كُلِّ مَنْ سَمِعَ النِّدَاءَقَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ جَمَاعَةٌ عَنْ سُفْيَانَ مَقْصُورًا عَلَى عَبْدِ اللَّهِ بْنِ عَمْرٍو وَلَمْ يَرْفَعُوهُ وَإِنَّمَا أَسْنَدَهُ قَبِيصَةُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] telah menceritakan kepada kami [Qabishah] telah menceritakan kepada kami [Sufyan] dari [Muhammad bin Sa'id yaitu Ath Tha`ifi] dari [Abu Salamah bin Nubaih] dari [Abdullah bin Harun] dari [Abdullah bin 'Amru] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"sholat jum'at wajib bagi orang yang mendengarkan adzan.\" Abu Daud berkata; \"Hadits ini diriwayatkan oleh Jama'ah dari Sufyan sebatas Abdullah bin Amru saja dan tidak merafa'-kannya, yang men-sanadkan (menyambungkan riwayatnya sampai kepada Nabi) hanya Qabishah. "
            },
            {
                "number": 880,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ عَنْ أَبِيهِأَنَّ يَوْمَ حُنَيْنٍ كَانَ يَوْمَ مَطَرٍ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُنَادِيَهُ أَنَّ الصَّلَاةَ فِي الرِّحَالِحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ صَاحِبٍ لَهُ عَنْ أَبِي مَلِيحٍ أَنَّ ذَلِكَ كَانَ يَوْمَ جُمُعَةٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Hammam] dari [Qatadah] dari [Abu Al Malih] dari [ayahnya] bahwa pada waktu Perang Hunain, hari sedang hujan, maka Nabi shallallahu 'alaihi wasallam memerintahkan Mu'adzinnya untuk menyerukan sholat di persinggahan masing-masing.\" Telah menceritakan kepada kami Muhammad bin Al Mutsanna telah menceritakan kepada kami Abdul A'la telah menceritakan kepada kami Sa'id dari sahabatnya Sa'id dari Abu Malih, bahwa waktu itu adalah hari Jum'at.\""
            },
            {
                "number": 881,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ قَالَ سُفْيَانُ بْنُ حَبِيبٍ خَبَّرَنَا عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمَلِيحِ عَنْ أَبِيهِأَنَّهُ شَهِدَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَمَنَ الْحُدَيْبِيَةِ فِي يَوْمِ جُمُعَةٍ وَأَصَابَهُمْ مَطَرٌ لَمْ تَبْتَلَّ أَسْفَلُ نِعَالِهِمْ فَأَمَرَهُمْ أَنْ يُصَلُّوا فِي رِحَالِهِمْ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali], [Sufyan bin Habib] berkata; telah mengabarkan kepada kami, dari [Khalid Al Khaddza`] dari [Abu Qilabah] dari [Abu Al Malih] dari [ayahnya] bahwa dia melihat Nabi shallallahu 'alaihi wasallam pada peristiwa Hudaibiyah ketika hari Jum'at, mereka kehujanan yang tidak hanya mengenai bagian bawah sandal mereka, maka beliau memerintahkan mereka untuk mengerjakan sholat di persinggahan mereka.\""
            },
            {
                "number": 882,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ أَنَّ ابْنَ عُمَرَ نَزَلَ بِضَجْنَانَ فِي لَيْلَةٍ بَارِدَةٍ فَأَمَرَ الْمُنَادِيَ فَنَادَى أَنْ الصَّلَاةُ فِي الرِّحَالِ قَالَ أَيُّوبُ وَحَدَّثَنَا نَافِعٌ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا كَانَتْ لَيْلَةٌ بَارِدَةٌ أَوْ مَطِيرَةٌ أَمَرَ الْمُنَادِيَ فَنَادَى الصَّلَاةُ فِي الرِّحَالِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid] telah menceritakan kepada kami [Hammad bin Zaid] telah menceritakan kepada kami [Ayyub] dari [Nafi'] bahwa [Ibnu Umar] pernah singgah di Dlajnan ketika malam dingin mencekam, maka dia memerintahkan Mu'adzinnya untuk menyerukan bahwa sholat di kerjakan di persinggahan.\" [Ayyub] berkata; telah menceritakan kepada kami [Nafi'] dari [Ibnu Umar] bahwa apabila malam sangat dingin atau terjadi hujan lebat, maka Rasulullah shallallahu 'alaihi wasallam memerintahkan Mu'adzinnya untuk menyerukan supaya sholat di kerjakan di persinggahan.\""
            }
        ]
    }
}