{
    "status": true,
    "data": {
        "start": 442,
        "end": 588,
        "total": 147,
        "book": "abu-daud",
        "hadits": [
            {
                "number": 442,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ وَمُوسَى بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا أَبَانُ عَنْ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أُقِيمَتْ الصَّلَاةُ فَلَا تَقُومُوا حَتَّى تَرَوْنِيقَالَ أَبُو دَاوُد وَهَكَذَا رَوَاهُ أَيُّوبُ وَحَجَّاجٌ الصَّوَّافُ عَنْ يَحْيَى وَهِشَامٍ الدَّسْتُوَائِيِّ قَالَ كَتَبَ إِلَيَّ يَحْيَى وَرَوَاهُ مُعَاوِيَةُ بْنُ سَلَّامٍ وَعَلِيُّ بْنُ الْمُبَارَكِ عَنْ يَحْيَى وَقَالَا فِيهِ حَتَّى تَرَوْنِي وَعَلَيْكُمْ السَّكِينَةَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى حَدَّثَنَا عِيسَى عَنْ مَعْمَرٍ عَنْ يَحْيَى بِإِسْنَادِهِ مِثْلَهُ قَالَ حَتَّى تَرَوْنِي قَدْ خَرَجْتُ قَالَ أَبُو دَاوُد لَمْ يَذْكُرْ قَدْ خَرَجْتُ إِلَّا مَعْمَرٌ وَرَوَاهُ ابْنُ عُيَيْنَةَ عَنْ مَعْمَرٍ لَمْ يَقُلْ فِيهِ قَدْ خَرَجْتُ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] dan [Musa bin Isma'il] mereka berdua berkata; telah menceritakan kepada kami [Aban] dari [Yahya] dari [Abdullah bin Abi Qatadah] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila telah dikumandangkan iqamah untuk sholat, maka janganlah kalian berdiri sehingga melihatku (datang).\" Abu Dawud berkata; Demikianlah diriwayatkan oleh [Ayyub] dan [Hajjaj Ash-Shawwaf] dari [Yahya] dan [Hisyam Ad-Dastuwa`i] dia berkata; Yahya menuliskan kepadaku, dan diriwayatkan oleh [Mu'awiyah bin Sallam] dan [Ali bin Al-Mubarak] dari [Yahya] dan mereka berdua menyebutkan padanya; (beliau bersabda): \"Hingga kalian melihatku (datang) dan kalian harap tenang.\" Telah menceritakan kepada kami [Ibrahim bin Musa] telah menceritakan kepada kami [Isa] dari [Ma'mar] dari [Yahya] dengan isnadnya semisanya, dia meyebutkan; (beliau bersabda): \"Hingga kalian melihatku telah keluar (dari rumah ke Masjid).\" Abu Dawud berkata; Tidak meyebutkan lafazh 'telah keluar' kecuali Ma'mar, dan diriwayatkan oleh [Ibnu 'Uyainah] dari [Ma'mar], dia tidak menyebutkan padanya lafazh 'telah keluar'. "
            },
            {
                "number": 443,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا الْوَلِيدُ قَالَ قَالَ أَبُو عَمْرٍو ح و حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا الْوَلِيدُ وَهَذَا لَفْظُهُ عَنْ الْأَوْزَاعِيِّ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ الصَّلَاةَ كَانَتْ تُقَامُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَأْخُذُ النَّاسُ مَقَامَهُمْ قَبْلَ أَنْ يَأْخُذَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Khalid] telah menceritakan kepada kami [Al-Walid] dia berkata; [Abu Amru] berkata, -dari jalur lain- Dan telah menceritakan kepada kami [Dawud bin Rusyaid] telah menceritakan kepada kami [Al-Walid] dan ini adalah lafazh riwayatnya dari [Al-Auza'i] dari [Az-Zuhri] dari [Abu Salamah] dari [Abu Hurairah] bahwasanya iqamah sholat dikumandangkan untuk Rasulullah shallallahu 'alaihi wasallam, lalu orang orang (para sahabat) segera mengambil tempat (pada shaf), sebelum Nabi shallallahu 'alaihi wasallam mengambil tempat sholat. "
            },
            {
                "number": 444,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُعَاذٍ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ حُمَيْدٍ قَالَ سَأَلْتُ ثَابِتًا الْبُنَانِيَّعَنْ الرَّجُلِ يَتَكَلَّمُ بَعْدَمَا تُقَامُ الصَّلَاةُ فَحَدَّثَنِي عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ أُقِيمَتْ الصَّلَاةُ فَعَرَضَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ فَحَبَسَهُ بَعْدَ مَا أُقِيمَتْ الصَّلَاةُ",
                "id": "Telah menceritakan kepada kami [Husain bin Mu'adz] telah menceritakan kepada kami [Abdul A'la] dari [Humaid] dia berkata; Saya pernah bertanya kepada [Tsabit Al-Bunani] tentang seseorang yang berbicara setelah dibacakan iqamah. Maka Tsabit menceritakan kepadaku sebuah Hadits dari [Anas bin Malik], dia berkata; Pernah ketika dibacakan iqamah, datang seorang laki laki kepada Rasulullah shallallahu 'alaihi wasallam, maka beliau tertahan olehnya, padahal sholat telah dikumandangkan iqamah. "
            },
            {
                "number": 445,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَلِيِّ بْنِ سُوَيْدِ بْنِ مَنْجُوفٍ السَّدُوسِيُّ حَدَّثَنَا عَوْنُ بْنُ كَهْمَسٍ عَنْ أَبِيهِ كَهْمَسٍ قَالَقُمْنَا إِلَى الصَّلَاةِ بِمِنًى وَالْإِمَامُ لَمْ يَخْرُجْ فَقَعَدَ بَعْضُنَا فَقَالَ لِي شَيْخٌ مِنْ أَهْلِ الْكُوفَةِ مَا يُقْعِدُكَ قُلْتُ ابْنُ بُرَيْدَةَ قَالَ هَذَا السُّمُودُ فَقَالَ لِي الشَّيْخُ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَوْسَجَةَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَ كُنَّا نَقُومُ فِي الصُّفُوفِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَوِيلًا قَبْلَ أَنْ يُكَبِّرَ قَالَ وَقَالَ إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى الَّذِينَ يَلُونَ الصُّفُوفَ الْأُوَلَ وَمَا مِنْ خُطْوَةٍ أَحَبُّ إِلَى اللَّهِ مِنْ خُطْوَةٍ يَمْشِيهَا يَصِلُ بِهَا صَفًّا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Ali bin Suwaid bin Manjuf As-Sadusi] telah menceritakan kepada kami ['Aun bin Kahmas] dari [Ayahnya, Kahmas] dia berkata; Kami telah berdiri untuk melaksanakan sholat pada waktu di Mina sementara imam belum keluar, maka sebagian dari kami duduk lagi, lalu [seorang syaikh] dari kufah berkata kepadaku; Apa yang membuatmu duduk? Saya menjawab; Ibnu Buraidah. Dia berkata; ini adalah suatu kelalaian (kebingungan), lalu dia berkata; Telah berkata kepadaku [Abdurrahman bin Ausajah] dari [Al-Bara` bin Azib] dia berkata; Kami pernah berdiri lama sekali pada shaf sholat pada masa Rasulullah Shallallahu alaihi wasallam (dalam rangka menunggu beliau) sebelum sholat dilaksanakan, dan beliau bersabda: \"Sesungguhnya Allah dan para Malaikatnya bershalawat bagi orang-orang yang berada pada shaf shaf pertama, dan tidak ada suatu langkah yang lebih Allah sukai daripada langkah seseorang untuk menuju shaf yang paling depan. "
            },
            {
                "number": 446,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسٍ قَالَأُقِيمَتْ الصَّلَاةُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَجِيٌّ فِي جَانِبِ الْمَسْجِدِ فَمَا قَامَ إِلَى الصَّلَاةِ حَتَّى نَامَ الْقَوْمُ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdul Warits] dari [Abdul Aziz bin Shuhaib] dari [Anas] dia berkata; Iqamat sholat telah dikumandangkan, sementara Rasulullah Shallallahu alaihi wasallam sedang berbiisik-bisik dengan seseorang, beliau tidak beranjak untuk melaksanakan sholat hingga orang-orang tertidur. "
            },
            {
                "number": 447,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِسْحَقَ الْجَوْهَرِيُّ أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ سَالِمٍ أَبِي النَّضْرِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تُقَامُ الصَّلَاةُ فِي الْمَسْجِدِ إِذَا رَآهُمْ قَلِيلًا جَلَسَ لَمْ يُصَلِّ وَإِذَا رَآهُمْ جَمَاعَةً صَلَّىحَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِسْحَقَ أَخْبَرَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ أَبِي مَسْعُودٍ الزُّرَقِيِّ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Ishaq Al-Jauhari] telah mengabarkan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Musa bin Uqbah] dari [Salim, Abu An-Nadlr] dia berkata; Rasulullah Shallallahu alaihi wasallam, ketika sholat akan didirikan di Masjid, beliau melihat para jama'ah, apabila masih sedikit maka beliau duduk, dan apabila beliau melihatnya sudah banyak, beliau segera melaksanakan sholat. Telah menceritakan kepada kami [Abdullah bin Ishaq] telah mengabarkan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] dari [Musa bin Uqbah] dari [Nafi' bin Jubair] dari [Abu Mas'ud Az-Zuraqiy] dari [Ali Bin Abi Thalib radliallahu 'anhu] semisalnya. "
            },
            {
                "number": 448,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زَائِدَةُ حَدَّثَنَا السَّائِبُ بْنُ حُبَيْشٍ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ الْيَعْمُرِيِّ عَنْ أَبِي الدَّرْدَاءِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ ثَلَاثَةٍ فِي قَرْيَةٍ وَلَا بَدْوٍ لَا تُقَامُ فِيهِمْ الصَّلَاةُ إِلَّا قَدْ اسْتَحْوَذَ عَلَيْهِمْ الشَّيْطَانُ فَعَلَيْكَ بِالْجَمَاعَةِ فَإِنَّمَا يَأْكُلُ الذِّئْبُ الْقَاصِيَةَقَالَ زَائِدَةُ قَالَ السَّائِبُ يَعْنِي بِالْجَمَاعَةِ الصَّلَاةَ فِي الْجَمَاعَةِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Za`idah] telah menceritakan kepada kami [As-Sa`ib bin Huaisy] dari [Ma'dan bin Abi Thalhah Al-Ya'muri] dari [Abu Ad-Darda`] dia berkata; Saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda; \"Tidaklah tiga orang di suatu desa atau lembah yang tidak didirikan sholat berjamaah di lingkungan mereka, melainkan setan telah menguasai mereka. Karena itu tetaplah kalian berjamaah, karena sesungguhnya serigala itu hanya akan memakan kambing yang sendirian (jauh dari kawan-kawannya).\" As-Sa`ib berkata; Maksud berjamaah adalah sholat secara berjamaah. "
            },
            {
                "number": 449,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ هَمَمْتُ أَنْ آمُرَ بِالصَّلَاةِ فَتُقَامَ ثُمَّ آمُرَ رَجُلًا فَيُصَلِّيَ بِالنَّاسِ ثُمَّ أَنْطَلِقَ مَعِي بِرِجَالٍ مَعَهُمْ حُزَمٌ مِنْ حَطَبٍ إِلَى قَوْمٍ لَا يَشْهَدُونَ الصَّلَاةَ فَأُحَرِّقَ عَلَيْهِمْ بُيُوتَهُمْ بِالنَّارِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al-A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh saya ingin sekali menyuruh sholat, lalu dikumandangkan iqamah, kemudian saya menyuruh seseorang mengimami sholat berjamaah (menggantikan saya), lalu saya pergi bersama beberapa orang yang membawa tumpukan-tumpukan kayu bakar ke rumah orang-orang yang tidak mengerjakan sholat berjamaah, kemudian saya bakar rumah-rumah mereka dengan api.\""
            },
            {
                "number": 450,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا أَبُو الْمَلِيحِ حَدَّثَنِي يَزِيدُ بْنُ يَزِيدَ حَدَّثَنِي يَزِيدُ بْنُ الْأَصَمِّ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ هَمَمْتُ أَنْ آمُرَ فِتْيَتِي فَيَجْمَعُوا حُزَمًا مِنْ حَطَبٍ ثُمَّ أَاتِيَ قَوْمًا يُصَلُّونَ فِي بُيُوتِهِمْ لَيْسَتْ بِهِمْ عِلَّةٌ فَأُحَرِّقَهَا عَلَيْهِمْقُلْتُ لِيَزِيدَ بْنِ الْأَصَمِّ يَا أَبَا عَوْفٍ الْجُمُعَةَ عَنَى أَوْ غَيْرَهَا قَالَ صُمَّتَا أُذُنَايَ إِنْ لَمْ أَكُنْ سَمِعْتُ أَبَا هُرَيْرَةَ يَأْثُرُهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا ذَكَرَ جُمُعَةً وَلَا غَيْرَهَا",
                "id": "Telah menceritakan kepada kami [An-Nufaili] telah menceritakan kepada kami [Abu Al-Malih] telah menceritakan kepadaku [Yazid bin Yazid] telah menceritakan kepadaku [Yazid bin Al-Asham] dia berkata; Saya telah mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda; \"Sungguh saya ingin sekali memerintahkan para pemudaku untuk mengumpulkan tumpukan tumpukan kayu bakar, kemudian saya pergi mendatangi kaum yang mengerjakan sholat di rumah rumah mereka tanpa udzur, lalu saya membakar rumah rumah mereka.\" Kata Yazid bin Yazid Saya katakan kepada Yazid bin Asham; Wahai Abu Auf, apakah sholat Jumat yang dimaksud Nabi shallallahu 'alaihi wasallam ataukah lainnya? Dia menjawab; Kedua telingaku tersumbat, sekiranya saya tidak mendengar Abu Hurairah meriwayatkannya dari Rasulullah shallallahu 'alaihi wasallam, sama sekali beliau tidak menyebutkan sholat Jumat dan juga sholat yang lain. "
            },
            {
                "number": 451,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبَّادٍ الْأَزْدِيُّ حَدَّثَنَا وَكِيعٌ عَنْ الْمَسْعُودِيِّ عَنْ عَلِيِّ بْنِ الْأَقْمَرِ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَحَافِظُوا عَلَى هَؤُلَاءِ الصَّلَوَاتِ الْخَمْسِ حَيْثُ يُنَادَى بِهِنَّ فَإِنَّهُنَّ مِنْ سُنَنِ الْهُدَى وَإِنَّ اللَّهَ شَرَعَ لِنَبِيِّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُنَنَ الْهُدَى وَلَقَدْ رَأَيْتُنَا وَمَا يَتَخَلَّفُ عَنْهَا إِلَّا مُنَافِقٌ بَيِّنُ النِّفَاقِ وَلَقَدْ رَأَيْتُنَا وَإِنَّ الرَّجُلَ لَيُهَادَى بَيْنَ الرَّجُلَيْنِ حَتَّى يُقَامَ فِي الصَّفِّ وَمَا مِنْكُمْ مِنْ أَحَدٍ إِلَّا وَلَهُ مَسْجِدٌ فِي بَيْتِهِ وَلَوْ صَلَّيْتُمْ فِي بُيُوتِكُمْ وَتَرَكْتُمْ مَسَاجِدَكُمْ تَرَكْتُمْ سُنَّةَ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَوْ تَرَكْتُمْ سُنَّةَ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَكَفَرْتُمْ",
                "id": "Telah menceritakan kepada kami [Harun bin 'Abbad Al-Azdi] telah menceritakan kepada kami [Waki'] dari [Al-Mas'udi] dari [Ali bin Al-Aqmar] dari [Abu Al-Ahwash] dari [Abdullah bin Mas'ud] dia berkata; Peliharalah dengan baik lima sholat ini ketika dikumandangkan adzan, karena sesungguhnya lima sholat jamaah itu termasuk di antara sunnah (jalan) hidayah dan sesungguhnya Allah telah mensyari'atkan jalan jalan petunjuk kepada NabiNya shallallahu 'alaihi wasallam, dan sungguh kami menganggap, bahwa tidak seorang pun yang meninggalkan sholat berjamaah, kecuali orang munafik yang jelas kemunafikannya. Seingatku, dahulu seseorang (diantara kami) biasa dituntun (dipapah) antara dua orang di kanan kirinya, sampai dia diberdirikan di shaf sholat. Tidak ada seorang pun di antara kalian, kecuali mempunyai masjid (tempat sholat) di dalam rumahnya. Seandainya kalian mengerjakan sholat di rumah kalian dan meninggalkan masjid masjid kalian, berarti kalian telah meninggalkan sunah sunah Nabi kalian shallallahu 'alaihi wasallam, dan jika kalian telah meninggalkan sunnah Nabi kalian, niscaya kalian telah kafir. "
            },
            {
                "number": 452,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا جَرِيرٌ عَنْ أَبِي جَنَابٍ عَنْ مَغْرَاءَ الْعَبْدِيِّ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَمِعَ الْمُنَادِيَ فَلَمْ يَمْنَعْهُ مِنْ اتِّبَاعِهِ عُذْرٌ قَالُوا وَمَا الْعُذْرُ قَالَ خَوْفٌ أَوْ مَرَضٌ لَمْ تُقْبَلْ مِنْهُ الصَّلَاةُ الَّتِي صَلَّىقَالَ أَبُو دَاوُد رَوَى عَنْ مَغْرَاءَ أَبُو إِسْحَقَ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Jarir] dari [Abu Janab] dari [Maghra` Al-'Abdi] dari ['Adi bin Tsabit] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dia berkata; Rasulullah Shallallahu alaihi wasallam bersabda: \"Barangsiapa yang mendengarkan adzan dan tidak punya alasan sehingga tidak menjawabnya (tidak mendatanginya) -para sahabat bertanya; Apakah alasan (udzur) itu? Beliau menjawab: \"Takut atau sakit-, maka tidak diterima sholat yang dia kerjakan. Abu Dawud berkata; Abu Ishaq meriwayatkan dari Maghra`. "
            },
            {
                "number": 453,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَاصِمِ بْنِ بَهْدَلَةَ عَنْ أَبِي رَزِينٍ عَنْ ابْنِ أُمِّ مَكْتُومٍأَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ ضَرِيرُ الْبَصَرِ شَاسِعُ الدَّارِ وَلِي قَائِدٌ لَا يُلَائِمُنِي فَهَلْ لِي رُخْصَةٌ أَنْ أُصَلِّيَ فِي بَيْتِي قَالَ هَلْ تَسْمَعُ النِّدَاءَ قَالَ نَعَمْ قَالَ لَا أَجِدُ لَكَ رُخْصَةً",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari ['Ashim bin Bahdalah] dari [Abu Razin] dari [Ibnu Ummi Maktum] bahwasanya dia pernah bertanya kepada Rasulullah Shallallahu alaihi wasallam, dia berkata; Ya Rasulullah, saya adalah seorang yang buta dan rumahku jauh, sedangkan saya mempunyai orang yang menuntunku tapi dia tidak membantuku, maka apakah saya mendapatkan keringanan untuk melaksanakan sholat di rumahku? Beliau bersabda: \"Apakah kamu mendengar adzan?\" Dia menjawab; Ya. Beliau bersabda: \"Saya tidak mendapatkan keringanan untukmu!\""
            },
            {
                "number": 454,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ حَدَّثَنَا أَبِي حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَابِسٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ ابْنِ أُمِّ مَكْتُومٍ قَالَيَا رَسُولَ اللَّهِ إِنَّ الْمَدِينَةَ كَثِيرَةُ الْهَوَامِّ وَالسِّبَاعِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَسْمَعُ حَيَّ عَلَى الصَّلَاةِ حَيَّ عَلَى الْفَلَاحِ فَحَيَّ هَلًاقَالَ أَبُو دَاوُد وَكَذَا رَوَاهُ الْقَاسِمُ الْجَرْمِيُّ عَنْ سُفْيَانَ لَيْسَ فِي حَدِيثِهِ حَيَّ هَلًا",
                "id": "Telah menceritakan kepada kami [Harun bin Zaid bin ABi Az-Zarqa`] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Sufyan] dari [Abdurrahman bin Abis] dari [Abdurrahman bin Abi Laila] dari [Ibnu Ummi Maktum] dia berkata; Wahai Rasulullah, sesungguhnya di kota Madinah banyak binatang berbisa dan binatang buasnya. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Apakah kamu mendengar seruan adzan 'Hayya 'alash shalaah, Hayya 'alalfalaah? 'Karena itu, penuhilah!. Abu Dawud berkata; Dan demikian pula diriwayatkan oleh [Al-Qasim Al-Jarmi] dari [Sufyan] tidak ada di dalam hadits riwayatnya lafazh: Karena itu, penuhilah! "
            },
            {
                "number": 455,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَصِيرٍ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا الصُّبْحَ فَقَالَ أَشَاهِدٌ فُلَانٌ قَالُوا لَا قَالَ أَشَاهِدٌ فُلَانٌ قَالُوا لَا قَالَ إِنَّ هَاتَيْنِ الصَّلَاتَيْنِ أَثْقَلُ الصَّلَوَاتِ عَلَى الْمُنَافِقِينَ وَلَوْ تَعْلَمُونَ مَا فِيهِمَا لَأَتَيْتُمُوهُمَا وَلَوْ حَبْوًا عَلَى الرُّكَبِ وَإِنَّ الصَّفَّ الْأَوَّلَ عَلَى مِثْلِ صَفِّ الْمَلَائِكَةِ وَلَوْ عَلِمْتُمْ مَا فَضِيلَتُهُ لَابْتَدَرْتُمُوهُ وَإِنَّ صَلَاةَ الرَّجُلِ مَعَ الرَّجُلِ أَزْكَى مِنْ صَلَاتِهِ وَحْدَهُ وَصَلَاتُهُ مَعَ الرَّجُلَيْنِ أَزْكَى مِنْ صَلَاتِهِ مَعَ الرَّجُلِ وَمَا كَثُرَ فَهُوَ أَحَبُّ إِلَى اللَّهِ تَعَالَى",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Abdullah bin Abu Bashir] dari [Ubay bin Ka'ab] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan sholat Shubuh bersama kami, lalu beliau bersabda: \"Apakah si fulan hadir?\" Mereka (para sahabat) menjawab; Tidak. Beliau bersabda: \"Apakah si fulan hadir?\" Para sahabat menjawab; Tidak. Beliau bersabda: \"Dua sholat ini (Shubuh dan Isya) adalah sholat yang paling berat bagi orang orang munafik. Andaikata kalian mengetahui apa (keutamaan) yang ada pada keduanya, niscaya kalian akan menghadirinya sekalipun dengan merangkak, dan sesungguhnya shaf pertama adalah seperti shaf para malaikat. Seandainya kalian mengetahui keutamaan shaf pertama, niscaya kalian akan memperebutkannya. Sesungguhnya sholat seseorang yang berjamaah dengan satu orang, adalah lebih baik daripada sholat sendirian. Dan sholatnya bersama dua orang jamaah, adalah lebih baik daripada sholat bersama seorang jamaah. Semakin banyak jama'ahnya, maka semakin dicintai oleh Allah Ta'ala.\""
            },
            {
                "number": 456,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا إِسْحَقُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي سَهْلٍ يَعْنِي عُثْمَانَ بْنَ حَكِيمٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ عَنْ عُثْمَانَ بْنِ عَفَّانَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى الْعِشَاءَ فِي جَمَاعَةٍ كَانَ كَقِيَامِ نِصْفِ لَيْلَةٍ وَمَنْ صَلَّى الْعِشَاءَ وَالْفَجْرَ فِي جَمَاعَةٍ كَانَ كَقِيَامِ لَيْلَةٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Ishaq bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Abu Sahl, yakni Utsman bin Hakim] telah menceritakan kepada kami [Abdurrahman bin Abu 'Amrah] dari [Utsman bin Affan] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang mengerjakan sholat Isya secara berjamaah, itu seperti beribadah setengah malam dan barangsiapa yang mengerjakan sholat Isya dan Subuh secara berjamaah, maka ia seperti beribadah semalam.\""
            },
            {
                "number": 457,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مِهْرَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعْدٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْأَبْعَدُ فَالْأَبْعَدُ مِنْ الْمَسْجِدِ أَعْظَمُ أَجْرًا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Ibnu Abi Dzi`b] dari [Abdurrahman bin Mihran] dari [Abdurrahman bin Sa'd] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Semakin jauh perjalanan seorang untuk berjamaah ke masjid, maka semakin besar pahalanya.\""
            },
            {
                "number": 458,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ أَنَّ أَبَا عُثْمَانَ حَدَّثَهُ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَكَانَ رَجُلٌ لَا أَعْلَمُ أَحَدًا مِنْ النَّاسِ مِمَّنْ يُصَلِّي الْقِبْلَةَ مِنْ أَهْلِ الْمَدِينَةِ أَبْعَدَ مَنْزِلًا مِنْ الْمَسْجِدِ مِنْ ذَلِكَ الرَّجُلِ وَكَانَ لَا تُخْطِئُهُ صَلَاةٌ فِي الْمَسْجِدِ فَقُلْتُ لَوْ اشْتَرَيْتَ حِمَارًا تَرْكَبُهُ فِي الرَّمْضَاءِ وَالظُّلْمَةِ فَقَالَ مَا أُحِبُّ أَنَّ مَنْزِلِي إِلَى جَنْبِ الْمَسْجِدِ فَنُمِيَ الْحَدِيثُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ عَنْ قَوْلِهِ ذَلِكَ فَقَالَ أَرَدْتُ يَا رَسُولَ اللَّهِ أَنْ يُكْتَبَ لِي إِقْبَالِي إِلَى الْمَسْجِدِ وَرُجُوعِي إِلَى أَهْلِي إِذَا رَجَعْتُ فَقَالَ أَعْطَاكَ اللَّهُ ذَلِكَ كُلَّهُ أَنْطَاكَ اللَّهُ جَلَّ وَعَزَّ مَا احْتَسَبْتَ كُلَّهُ أَجْمَعَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An-Nufaili] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Sulaiman At-Taimi] bahwasanya [Abu Utsman] telah menceritakan kepadanya dari [Ubay bin Ka'ab] dia berkata; Ada seseorang yang menurut pengetahuan saya, tidak ada seorang pun di antara penduduk Madinah yang mengerjakan sholat menghadap kiblat, yang paling jauh rumahnya dari masjid, daripada orang itu. Dia tidak pernah ketinggalan satu sholat pun di masjid. Saya berkata; Alangkah baiknya) seandainya kamu membeli seekor keledai, yang dapat kamu tunggangi ketika matahari terik dan gelap. Maka orang itu berkata: \"Saya tidak suka kalau rumahku berada di dekat masjid. Lalu hal ini sampai kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau bertanya kepada orang itu tentang perkataannya itu. Maka orang itu menjawab; Wahai Rasulullah, saya menginginkan supaya dicatat pahala kepergian saya ke masjid dan pahala kepulangan saya kepada keluarga setelah saya pulang. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semoga Allah memberikan semua itu kepadamu, semoga Allah memberi semuanya itu kepadamu sesuai keikhlasanmu.\""
            },
            {
                "number": 459,
                "arab": "حَدَّثَنَا أَبُو تَوْبَةَ حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ عَنْ يَحْيَى بْنِ الْحَارِثِ عَنْ الْقَاسِمِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ أَبِي أُمَامَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ خَرَجَ مِنْ بَيْتِهِ مُتَطَهِّرًا إِلَى صَلَاةٍ مَكْتُوبَةٍ فَأَجْرُهُ كَأَجْرِ الْحَاجِّ الْمُحْرِمِ وَمَنْ خَرَجَ إِلَى تَسْبِيحِ الضُّحَى لَا يَنْصِبُهُ إِلَّا إِيَّاهُ فَأَجْرُهُ كَأَجْرِ الْمُعْتَمِرِ وَصَلَاةٌ عَلَى أَثَرِ صَلَاةٍ لَا لَغْوَ بَيْنَهُمَا كِتَابٌ فِي عِلِّيِّينَ",
                "id": "Telah menceritakan kepada kami [Abu Taubah] telah menceritakan kepada kami [Al-Haitsam bin Humaid] dari [Yahya bin Al-Harits] dari [Al-Qasim, Abu Abdurrahman] dari [Abu Umamah] bahwasanya Rasulullah Shallallahu alaihi wasallam bersabda: \"Barangsiapa yang keluar dari rumahnya dalam keadaan suci untuk melaksanakan sholat wajib, maka pahalanya seperti pahala orang yang haji yang sedang ihram, dan barangsiapa yang keluar dari rumahnya untuk melaksanakan sholat Dluha, dia tidak mempunyai niat kecuali itu, maka pahalanya seperti orang yang sedang umrah. Dan menunggu sholat hingga datang waktu sholat yang lain yang tidak ada main-main di antara keduanya, maka pahalanya ditulis di 'Iliyyin.\""
            },
            {
                "number": 460,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ الرَّجُلِ فِي جَمَاعَةٍ تَزِيدُ عَلَى صَلَاتِهِ فِي بَيْتِهِ وَصَلَاتِهِ فِي سُوقِهِ خَمْسًا وَعِشْرِينَ دَرَجَةً وَذَلِكَ بِأَنَّ أَحَدَكُمْ إِذَا تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ وَأَتَى الْمَسْجِدَ لَا يُرِيدُ إِلَّا الصَّلَاةَ وَلَا يَنْهَزُهُ إِلَّا الصَّلَاةُ لَمْ يَخْطُ خُطْوَةً إِلَّا رُفِعَ لَهُ بِهَا دَرَجَةٌ وَحُطَّ عَنْهُ بِهَا خَطِيئَةٌ حَتَّى يَدْخُلَ الْمَسْجِدَ فَإِذَا دَخَلَ الْمَسْجِدَ كَانَ فِي صَلَاةٍ مَا كَانَتْ الصَّلَاةُ هِيَ تَحْبِسُهُ وَالْمَلَائِكَةُ يُصَلُّونَ عَلَى أَحَدِكُمْ مَا دَامَ فِي مَجْلِسِهِ الَّذِي صَلَّى فِيهِ وَيَقُولُونَ اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ اللَّهُمَّ تُبْ عَلَيْهِ مَا لَمْ يُؤْذِ فِيهِ أَوْ يُحْدِثْ فِيهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al-A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pahala sholat seseorang dengan berjamaah melebihi pahala sholatnya di rumah dan di pasar sebanyak dua puluh lima derajat. Hal tersebut, karena apabila seseorang di antara kalian berwudlu, lalu memperbagus wudlunya, kemudian pergi ke masjid semata mata karena untuk mengerjakan sholat, dan kesempatan itu hanya dipergunakan untuk sholat, maka orang tersebut tidak melangkahkan satu langkah, kecuali setiap langkahnya itu diangkat baginya satu derajat, dan dihapus darinya satu dosa, sampai dia masuk ke dalam masjid. Apabila dia telah masuk masjid, maka dia dihitung dalam keadaan sholat selama tertahan karena sholat (tidak keluar dari masjid karena menunggu sholat), dan para malaikat akan bershalawat (memohonkan rahmat dan ampunan) kepada seseorang di antara kalian, selama dia tetap berada di tempat dia mengerjakan sholatnya, mereka (para malaikat) berdo'a; Ya Allah, ampunilah dia, rahmatilah dia dan terimalah taubatnya. Para malaikat itu berdo'a demikian selama orang itu tidak mengganggu orang lain di tempat itu atau berhadats.\""
            },
            {
                "number": 461,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ هِلَالِ بْنِ مَيْمُونٍ عَنْ عَطَاءِ بْنِ يَزِيدَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةُ فِي جَمَاعَةٍ تَعْدِلُ خَمْسًا وَعِشْرِينَ صَلَاةً فَإِذَا صَلَّاهَا فِي فَلَاةٍ فَأَتَمَّ رُكُوعَهَا وَسُجُودَهَا بَلَغَتْ خَمْسِينَ صَلَاةًقَالَ أَبُو دَاوُد قَالَ عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ فِي هَذَا الْحَدِيثِ صَلَاةُ الرَّجُلِ فِي الْفَلَاةِ تُضَاعَفُ عَلَى صَلَاتِهِ فِي الْجَمَاعَةِ وَسَاقَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Hilal bin Maimun] dari ['Atha` bin Yazid] dari [Abu Sa'id Al-Khudri] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat yang dikerjakan secara berjamaah menyamai dua puluh lima kali sholat (secara sendirian). Apabila dia mengerjakannya di tanah lapang, lalu dia menyempurnakan ruku dan sujudnya, maka sholatnya sampai lima puluh kali pahala sholat\". Abu Dawud berkata; [Abdul Wahid bin Ziyad] menyebutkan di dalam hadits ini; \"sholat seseorang yang dikerjakan di tanah lapang, dilipatgandakan pahalanya daripada sholatnya secara berjamaah\", selanjutnya dia menyebutkan Hadits itu secara lengkap. "
            },
            {
                "number": 462,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا أَبُو عُبَيْدَةَ الْحَدَّادُ حَدَّثَنَا إِسْمَعِيلُ أَبُو سُلَيْمَانَ الْكَحَّالُ عَنْ عَبْدِ اللَّهِ بْنِ أَوْسٍ عَنْ بُرَيْدَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَشِّرْ الْمَشَّائِينَ فِي الظُّلَمِ إِلَى الْمَسَاجِدِ بِالنُّورِ التَّامِّ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ma'in] telah menceritakan kepada kami [Abu Ubaidah Al-Haddad] telah menceritakan kepada kami [Isma'il, Abu Sulaiman Al-Kahhal] dari [Abdullah bin Aus] dari [Buraidah dari] dar Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Berilah kabar gembira bagi orang yang berjalan pada malam gelap gulita menuju masjid (untuk sholat berjama'ah) bahwa bagi mereka cahaya yang sempurna pada hari kiamat nanti.\""
            },
            {
                "number": 463,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ أَنَّ عَبْدَ الْمَلِكِ بْنَ عَمْرٍو حَدَّثَهُمْ عَنْ دَاوُدَ بْنِ قَيْسٍ قَالَ حَدَّثَنِي سَعْدُ بْنُ إِسْحَقَ حَدَّثَنِي أَبُو ثُمَامَةَ الْحَنَّاطُ أَنَّ كَعْبَ بْنَ عُجْرَةَأَدْرَكَهُ وَهُوَ يُرِيدُ الْمَسْجِدَ أَدْرَكَ أَحَدُهُمَا صَاحِبَهُ قَالَ فَوَجَدَنِي وَأَنَا مُشَبِّكٌ بِيَدَيَّ فَنَهَانِي عَنْ ذَلِكَ وَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا تَوَضَّأَ أَحَدُكُمْ فَأَحْسَنَ وُضُوءَهُ ثُمَّ خَرَجَ عَامِدًا إِلَى الْمَسْجِدِ فَلَا يُشَبِّكَنَّ يَدَيْهِ فَإِنَّهُ فِي صَلَاةٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al-Anbari] bahwasanya [Abdul Malik bin Amru] telah menceritakan kepada mereka, dari [Dawud bin Qais] dia berkata; Telah menceritakan kepadaku [Sa'd bin Ishaq] telah menceritakan kepadaku [Abu Tsumamah Al-Hannath] bahwasanya [Ka'ab bin 'Ujrah] pernah mendapatkannya hendak pergi ke masjid. Salah satunya bertemu dengan temannya. Kata Abu Tsumamah; Ka'ab mendapatiku sedang menjalin kedua tanganku, maka dia melarangku berbuat demikian dan berkata; Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian berwudlu, lalu dia membaguskan wudlunya, kemudian pergi dengan sengaja ke masjid, maka janganlah dia menjalin kedua tangannya, karena perbuatan itu dianggap himpunan ibadah sholat.\""
            },
            {
                "number": 464,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُعَاذِ بْنِ عَبَّادٍ الْعَنْبَرِيُّ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ مَعْبَدِ بْنِ هُرْمُزَ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ قَالَحَضَرَ رَجُلًا مِنْ الْأَنْصَارِ الْمَوْتُ فَقَالَ إِنِّي مُحَدِّثُكُمْ حَدِيثًا مَا أُحَدِّثُكُمُوهُ إِلَّا احْتِسَابًا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا تَوَضَّأَ أَحَدُكُمْ فَأَحْسَنَ الْوُضُوءَ ثُمَّ خَرَجَ إِلَى الصَّلَاةِ لَمْ يَرْفَعْ قَدَمَهُ الْيُمْنَى إِلَّا كَتَبَ اللَّهُ عَزَّ وَجَلَّ لَهُ حَسَنَةً وَلَمْ يَضَعْ قَدَمَهُ الْيُسْرَى إِلَّا حَطَّ اللَّهُ عَزَّ وَجَلَّ عَنْهُ سَيِّئَةً فَلْيُقَرِّبْ أَحَدُكُمْ أَوْ لِيُبَعِّدْ فَإِنْ أَتَى الْمَسْجِدَ فَصَلَّى فِي جَمَاعَةٍ غُفِرَ لَهُ فَإِنْ أَتَى الْمَسْجِدَ وَقَدْ صَلَّوْا بَعْضًا وَبَقِيَ بَعْضٌ صَلَّى مَا أَدْرَكَ وَأَتَمَّ مَا بَقِيَ كَانَ كَذَلِكَ فَإِنْ أَتَى الْمَسْجِدَ وَقَدْ صَلَّوْا فَأَتَمَّ الصَّلَاةَ كَانَ كَذَلِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Mu'adz bin 'Abbad Al-Anbari] telah menceritakan kepada kami [Abu 'Awanah] dari [Ya'la bin 'Atha`] dari [Ma'bad bin Hurmuz] dari [Sa'id bin Al-Musayyib] dia berkata; Ada [seorang dari sahabat Anshar] sedang menghadapi sakaratul maut dan dia berkata; Sesungguhnya saya akan menceritakan kepada kalian (suatu hadits) yang saya tidak mengharapkan apa-apa kecuali pahala. Saya mendengar Rasulullah Shallallahu alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian berwudlu dan dia membaguskan wudlunya, kemudian keluar untuk melaksanakan sholat, maka tidaklah dia mengangkat kaki kanannya kecuali Allah Azza wa Jalla menulis baginya suatu kebajikan, dan tidaklah dia mengangkat kaki kirinya kecuali Allah Azza wa Jalla menghapus satu kesalahannya darinya. Maka silahkanlah kalian mendekatkan langkah atau menjauhkannya. Dan apabila dia datang ke masjid lalu sholat dengan berjama'ah, maka dosanya akan diampuni, jika dia sampai di masjid sementara jama'ah bersama imam telah mengerjakan sebagian sholat dan tinggal sebagian, maka hendaklah dia melaksanakan yang tersisa dan menyempurnakan yang lainnya, maka dia pun akan diampuni, dan begitu juga jika dia sampai di masjid dan dia mendapatkan sholat telah dilaksanakan semuanya, maka baginya juga akan diampuni.\""
            },
            {
                "number": 465,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ مُحَمَّدٍ يَعْنِي ابْنَ طَحْلَاءَ عَنْ مُحْصِنِ بْنِ عَلِيٍّ عَنْ عَوْفِ بْنِ الْحَارِثِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَوَضَّأَ فَأَحْسَنَ وُضُوءَهُ ثُمَّ رَاحَ فَوَجَدَ النَّاسَ قَدْ صَلَّوْا أَعْطَاهُ اللَّهُ جَلَّ وَعَزَّ مِثْلَ أَجْرِ مَنْ صَلَّاهَا وَحَضَرَهَا لَا يَنْقُصُ ذَلِكَ مِنْ أَجْرِهِمْ شَيْئًا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Muhammad bin Thahla`] dari [Muhshin bin Ali] dari [Auf bin Al-Harits] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang berwudlu, lalu memperbagus wudlunya, kemudian pergi ke masjid, sementara dia mendapati jama'ah telah selesai mengerjakan sholat, maka Allah Azza wa Jalla akan memberinya pahala, seperti pahala orang yang telah mengerjakan (sholat jama'ah) dan menghadirinya, tidak kurang sedikit pun dari pahala mereka.\""
            },
            {
                "number": 466,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَمْنَعُوا إِمَاءَ اللَّهِ مَسَاجِدَ اللَّهِ وَلَكِنْ لِيَخْرُجْنَ وَهُنَّ تَفِلَاتٌ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'i] telah menceritakan kepada kami [Hammad] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menghalangi kaum wanita itu pergi ke masjid masjid Allah, akan tetapi hendaklah mereka itu pergi tanpa memakai wangi-wangian.\""
            },
            {
                "number": 467,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَمْنَعُوا إِمَاءَ اللَّهِ مَسَاجِدَ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian melarang kaum wanita pergi ke masjid-Masjid Allah.\""
            },
            {
                "number": 468,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْعَوَّامُ بْنُ حَوْشَبٍ حَدَّثَنِي حَبِيبُ بْنُ أَبِي ثَابِتٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَمْنَعُوا نِسَاءَكُمْ الْمَسَاجِدَ وَبُيُوتُهُنَّ خَيْرٌ لَهُنَّ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abi Syaibah] telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Al-'Awwam bin Hausyab] telah menceritakan kepadaku [Habib bin Abu Tsabit] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian melarang kaum wanita pergi ke masjid, akan tetapi sebenarnya rumah rumah mereka itu lebih baik bagi mereka.\""
            },
            {
                "number": 469,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ وَأَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ مُجَاهِدٍ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ائْذَنُوا لِلنِّسَاءِ إِلَى الْمَسَاجِدِ بِاللَّيْلِفَقَالَ ابْنٌ لَهُ وَاللَّهِ لَا نَأْذَنُ لَهُنَّ فَيَتَّخِذْنَهُ دَغَلًا وَاللَّهِ لَا نَأْذَنُ لَهُنَّ قَالَ فَسَبَّهُ وَغَضِبَ وَقَالَ أَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ائْذَنُوا لَهُنَّ وَتَقُولُ لَا نَأْذَنُ لَهُنَّ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abi Syaibah] telah menceritakan kepada kami [Jarir] dan [Abu Mu'awiyah] dari [Al-A'masy] dari [Mujahid] dia berkata; [Abdullah bin Umar] berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Izinkanlah kaum wanita untuk pergi ke masjid masjid pada malam hari.\" Lalu seorang anak lelaki Ibnu Umar berkata; Demi Allah, kami tidak akan memberi izin kepada mereka, karena mereka akan membuatnya sebagai tipuan. Demi Allah, kami tidak akan memberi izin kepada mereka. Mujahid berkata; Maka Abdullah memakinya dan memarahinya seraya berkata; Saya katakan Rasulullah shallallahu 'alaihi wasallam bersabda: \"Izinkanlah mereka\", namun mengapa malah kamu katakan; Kami tidak akan mengizinkan mereka?\""
            },
            {
                "number": 470,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ أَنَّهَا أَخْبَرَتْهُ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْلَوْ أَدْرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَحْدَثَ النِّسَاءُ لَمَنَعَهُنَّ الْمَسْجِدَ كَمَا مُنِعَهُ نِسَاءُ بَنِي إِسْرَائِيلَقَالَ يَحْيَى فَقُلْتُ لِعَمْرَةَ أَمُنِعَهُ نِسَاءُ بَنِي إِسْرَائِيلَ قَالَتْ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Al-Qa'nabi] dari [Malik] dari [Yahya bin Sa'id] dari ['Amrah binti Abdurrahman] bahwasanya dia telah mengabarkan kepadanya bahwasanya [Aisyah], istri Nabi shallallahu 'alaihi wasallam berkata; Seandainya Rasulullah shallallahu 'alaihi wasallam mendapati apa yang terjadi pada kaum wanita saat ini, niscaya beliau akan melarang mereka pergi ke masjid, sebagaimana kaum wanita bani Israil dilarang. Berkata Yahya; Saya bertanya kepada Amrah; Apakah kaum wanita bani Israil dilarang ke masjid? Dia menjawab; Ya. "
            },
            {
                "number": 471,
                "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى أَنَّ عَمْرَو بْنَ عَاصِمٍ حَدَّثَهُمْ قَالَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ مُوَرِّقٍ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ الْمَرْأَةِ فِي بَيْتِهَا أَفْضَلُ مِنْ صَلَاتِهَا فِي حُجْرَتِهَا وَصَلَاتُهَا فِي مَخْدَعِهَا أَفْضَلُ مِنْ صَلَاتِهَا فِي بَيْتِهَا",
                "id": "Telah menceritakan kepada kami [Ibnu Al-Mutsanna] bahwasanya [Amru bin 'Ashim] telah menceritakan kepada mereka, dia berkata; Telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Muwarriq] dari [Abu Al-Ahwash] dari [Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"sholat seorang wanita di rumahnya lebih utama baginya daripada sholatnya di kamarnya, dan sholat seorang wanita di rumahnya yang kecil lebih utama baginya daripada dirumahnya.\""
            },
            {
                "number": 472,
                "arab": "حَدَّثَنَا أَبُو مَعْمَرٍ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ تَرَكْنَا هَذَا الْبَابَ لِلنِّسَاءِقَالَ نَافِعٌ فَلَمْ يَدْخُلْ مِنْهُ ابْنُ عُمَرَ حَتَّى مَاتَ قَالَ أَبُو دَاوُد رَوَاهُ إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ أَيُّوبَ عَنْ نَافِعٍ قَالَ قَالَ عُمَرُ وَهَذَا أَصَحُّ",
                "id": "Telah menceritakan kepada kami [Abu Ma'mar] telah menceritakan kepada kami [Abdul Warits] telah menceritakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaiknya pintu ini kita peruntukkan bagi kaum wanita.\" Nafi' berkata; Maka Ibnu Umar tidak pernah lagi masuk lewat pintu itu sampai beliau meninggal dunia. Abu Dawud berkata; Diriwayatkan oleh [Isma'il bin Ibrahim] dari [Ayyub] dari [Nafi'] dia berkata; [Umar] berkata;, dan ini lebih shahih. "
            },
            {
                "number": 473,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَنْبَسَةُ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيِّبِ وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا أُقِيمَتْ الصَّلَاةُ فَلَا تَأْتُوهَا تَسْعَوْنَ وَأْتُوهَا تَمْشُونَ وَعَلَيْكُمْ السَّكِينَةُ فَمَا أَدْرَكْتُمْ فَصَلُّوا وَمَا فَاتَكُمْ فَأَتِمُّواقَالَ أَبُو دَاوُد كَذَا قَالَ الزُّبَيْدِيُّ وَابْنُ أَبِي ذِئْبٍ وَإِبْرَاهِيمُ بْنُ سَعْدٍ وَمَعْمَرٌ وَشُعَيْبُ بْنُ أَبِي حَمْزَةَ عَنْ الزُّهْرِيِّ وَمَا فَاتَكُمْ فَأَتِمُّوا و قَالَ ابْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ وَحْدَهُ فَاقْضُوا و قَالَ مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ وَجَعْفَرُ بْنُ رَبِيعَةَ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ فَأَتِمُّوا وَابْنُ مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو قَتَادَةَ وَأَنَسٌ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّهُمْ قَالُوا فَأَتِمُّوا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami ['Anbasah] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Sa'id bin Al-Musayyib] dan [Abu Salamah bin Abdurrahman] bahwasanya [Abu Hurairah] berkata; Saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila sholat telah dibacakan iqamah, maka janganlah kalian mendatanginya dengan berlari, akan tetapi datangilah dalam keadaan berjalan biasa, dan hendaklah kalian tenang. Apa pun yang kalian dapatkan dengan jama'ah maka lakukanlah, dan apa yang tertinggal maka sempurnakanlah.\" Abu Dawud berkata; Demikian yang dikatakan oleh [Az-Zubaidi] dan [Ibnu Abi Dzi`b] dan [Ibrahim bin Sa'd] dan [Ma'mar] dan [Syu'aib bin Abu Hamzah] dari [Az-Zuhri]; Dan apa yang tertinggal maka sempurnakanlah. Dan [Ibnu Uyainah] menyebutkan dari [Zuhri] sendirian (dengan lafazh); Maka selesaikanlah. Dan berkata [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah], dan [Ja'far bin Rabi'ah] dari [Al-A'raj] dari [Abu Hurairah] dengan lafazh; maka sempurnakanlah. Dan riwayat Ibnu Mas'ud dari Nabi shallallahu 'alaihi wasallam dan Abu Qatadah dan Anas dari Nabi shallallahu 'alaihi wasallam, semuanya menyebutkan dengan lafazh; maka sempurnakanlah. "
            },
            {
                "number": 474,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ قَالَ سَمِعْتُ أَبَا سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ائْتُوا الصَّلَاةَ وَعَلَيْكُمْ السَّكِينَةُ فَصَلُّوا مَا أَدْرَكْتُمْ وَاقْضُوا مَا سَبَقَكُمْقَالَ أَبُو دَاوُد وَكَذَا قَالَ ابْنُ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ وَلْيَقْضِ وَكَذَا قَالَ أَبُو رَافِعٍ عَنْ أَبِي هُرَيْرَةَ وَأَبُو ذَرٍّ رَوَى عَنْهُ فَأَتِمُّوا وَاقْضُوا وَاخْتُلِفَ فِيهِ",
                "id": "Telah menceritakan kepada kami [Abul Walid Ath-Thayalisi] telah menceritakan kepada kami [Syu'bah] dari [Sa'd bin Ibrahim] dia berkata; Saya pernah mendengar [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Datangilah sholat berjama'ah dan hendaklah kalian tenang, lalu kerjakanlah apa yang kalian dapatkan dengan jamaah dan genapilah yang tertinggal.\" Abu Dawud berkata; Dan demikian pula disebutkan oleh [Ibnu Sirin] dari [Abu Hurairah] dengan lafazh; Dan beresilah. Dan demikian pula disebutkan oleh [Abu Rafi'] dari [Abu Hurairah]. Sedangkan Abu Dzarr meriwayatkan dari beliau dengan lafazh; Maka sempurnakanlah dan beresilah. Namun itu diperselisihkan. "
            },
            {
                "number": 475,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ عَنْ سُلَيْمَانَ الْأَسْوَدِ عَنْ أَبِي الْمُتَوَكِّلِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبْصَرَ رَجُلًا يُصَلِّي وَحْدَهُ فَقَالَ أَلَا رَجُلٌ يَتَصَدَّقُ عَلَى هَذَا فَيُصَلِّيَ مَعَهُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Wuhaib] dari [Sulaiman Al-Aswad] dari [Abu Al-Mutawakkil] dari [Abu Sa'id Al-Khudri] bahwasanya Rasulullah shallallahu 'alaihi wasallam pernah melihat seorang laki laki sedang mengerjakan sholat sendirian, maka beliau bersabda: \"Adakah seseorang yang mau bersedekah kepada orang ini dengan mengerjakan sholat bersamanya?\""
            },
            {
                "number": 476,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي يَعْلَى بْنُ عَطَاءٍ عَنْ جَابِرِ بْنِ يَزِيدَ بْنِ الْأَسْوَدِ عَنْ أَبِيهِأَنَّهُ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ غُلَامٌ شَابٌّ فَلَمَّا صَلَّى إِذَا رَجُلَانِ لَمْ يُصَلِّيَا فِي نَاحِيَةِ الْمَسْجِدِ فَدَعَا بِهِمَا فَجِئَ بِهِمَا تُرْعَدُ فَرَائِصُهُمَا فَقَالَ مَا مَنَعَكُمَا أَنْ تُصَلِّيَا مَعَنَا قَالَا قَدْ صَلَّيْنَا فِي رِحَالِنَا فَقَالَ لَا تَفْعَلُوا إِذَا صَلَّى أَحَدُكُمْ فِي رَحْلِهِ ثُمَّ أَدْرَكَ الْإِمَامَ وَلَمْ يُصَلِّ فَلْيُصَلِّ مَعَهُ فَإِنَّهَا لَهُ نَافِلَةٌحَدَّثَنَا ابْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ جَابِرِ بْنِ يَزِيدَ عَنْ أَبِيهِ قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصُّبْحَ بِمِنًى بِمَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepadaku [Ya'la bin 'Atha`] dari [Jabir bin Yazid bin Al-Aswad] dari [Ayahnya] bahwasanya dia pernah sholat bersama Rasulullah Shallallahu alaihi wasallam sementara ketika itu dia masih muda. Tatkala sholat telah selesai dilaksanakan, ada dua orang laki-laki yang berada di salah satu sudut masjid tidak melaksanakan sholat, maka beliau memanggil keduanya dan keduanya pun didatangkan dalam kondisi merinding bulu kuduknya, lalu beliau bersabda: \"Apakah yang menghalangi kalian berdua untuk melaksanakan sholat bersama kami?\" Mereka menjawab; Kami sudah melaksanakannya di rumah kami. Beliau bersabda: \"Janganlah kalian melakukannya lagi, apabila seseorang di antara kalian sudah melaksanakan sholat di rumahnya, lalu mendapatkan imam sedang sholat, maka sholatlah bersamanya, karena yang ini baginya adalah nafilah (sholat sunnah).\"Telah menceritakan kepada kami [Ibnu Mu'adz] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin 'Atha`] dari [Jabir bin Yazid] dari [Ayahnya] dia berkata; Saya pernah sholat Shubuh bersama Nabi Shallallahu alaihi wasallam di Mina, lalu dia melanjutkan hadits semakan dengan di atas. "
            },
            {
                "number": 477,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا مَعْنُ بْنُ عِيسَى عَنْ سَعِيدِ بْنِ السَّائِبِ عَنْ نُوحِ بْنِ صَعْصَعَةَ عَنْ يَزِيدَ بْنِ عَامِرٍ قَالَجِئْتُ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّلَاةِ فَجَلَسْتُ وَلَمْ أَدْخُلْ مَعَهُمْ فِي الصَّلَاةِ قَالَ فَانْصَرَفَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَى يَزِيدَ جَالِسًا فَقَالَ أَلَمْ تُسْلِمْ يَا يَزِيدُ قَالَ بَلَى يَا رَسُولَ اللَّهِ قَدْ أَسْلَمْتُ قَالَ فَمَا مَنَعَكَ أَنْ تَدْخُلَ مَعَ النَّاسِ فِي صَلَاتِهِمْ قَالَ إِنِّي كُنْتُ قَدْ صَلَّيْتُ فِي مَنْزِلِي وَأَنَا أَحْسَبُ أَنْ قَدْ صَلَّيْتُمْ فَقَالَ إِذَا جِئْتَ إِلَى الصَّلَاةِ فَوَجَدْتَ النَّاسَ فَصَلِّ مَعَهُمْ وَإِنْ كُنْتَ قَدْ صَلَّيْتَ تَكُنْ لَكَ نَافِلَةً وَهَذِهِ مَكْتُوبَةٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Ma'n bin Isa] dari [Sa'id bin As-Sa`ib] dari [Nuh bin Sha'sha'ah] dari [Yazid bin Amir] dia berkata; Saya pernah datang ke Masjid sementara Nabi shallallahu 'alaihi wasallam dalam keadaan sholat. Saya lalu duduk dan tidak sholat bersama mereka. Lalu Rasulullah shallallahu 'alaihi wasallam pergi dan melihat Yazid sedang duduk. Beliau bersabda: \"Apakah kamu belum masuk Islam wahai Yazid.\" Dia menjawab; Tentu wahai Rasulullah, saya telah masuk Islam. Beliau bersabda: \"Lalu apa yang menghalangimu untuk sholat bersama jama'ah?\" Dia menjawab; Saya telah sholat di rumahku dan saya menyangka kalian telah selesai sholat. Maka beliau bersabda: \"Apabila kamu datang ke sholat jama'ah, lalu kamu mendapati orang-orang sedang sholat, maka sholatlah bersama mereka, meskipun kamu telah sholat, sholatmu itu sebagai nafilah (sholat sunnah) bagimu, dan yang ini menjadi yang wajib.\""
            },
            {
                "number": 478,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ قَالَ قَرَأْتُ عَلَى ابْنِ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرٌو عَنْ بُكَيْرٍ أَنَّهُ سَمِعَ عَفِيفَ بْنَ عَمْرِو بْنِ الْمُسَيِّبِ يَقُولُ حَدَّثَنِي رَجُلٌ مِنْ بَنِي أَسَدِ بْنِ خُزَيْمَةَ أَنَّهُ سَأَلَ أَبَا أَيُّوبَ الْأَنْصَارِيَّفَقَالَ يُصَلِّي أَحَدُنَا فِي مَنْزِلِهِ الصَّلَاةَ ثُمَّ يَأْتِي الْمَسْجِدَ وَتُقَامُ الصَّلَاةُ فَأُصَلِّي مَعَهُمْ فَأَجِدُ فِي نَفْسِي مِنْ ذَلِكَ شَيْئًا فَقَالَ أَبُو أَيُّوبَ سَأَلْنَا عَنْ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ذَلِكَ لَهُ سَهْمُ جَمْعٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] dia berkata; Saya telah membaca hadits pada [Ibnu Wahb] dia berkata; Telah mengabarkan kepadaku [Amru] dari [Bukair] bahwasanya dia telah mendengar [Afif bin Amru bin Al-Musayyib] dia berkata; Telah menceritakan kepada kami [Seorang lelaki dari Bani Asad bin Khuzaimah] bahwasanya dia pernah bertanya kepada [Abu Ayyub Al-Anshari], dia berkata; Seseorang di antara kami telah sholat di rumahnya, kemudian dia datang ke masjid dan iqamat sholat baru saja dikumandangkan, lalu saya sholat bersama mereka, tapi saya mendapatkan dalam diriku suatu ganjalan. Maka Abu Ayyub berkata; Kami pernah bertanya tentang itu kepada Nabi shallallahu 'alaihi wasallam, maka beliau menjawab: \"sholat itu baginya sebagai saham pahala berjama'ah.\""
            },
            {
                "number": 479,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا حُسَيْنٌ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ يَعْنِي مَوْلَى مَيْمُونَةَ قَالَأَتَيْتُ ابْنَ عُمَرَ عَلَى الْبَلَاطِ وَهُمْ يُصَلُّونَ فَقُلْتُ أَلَا تُصَلِّي مَعَهُمْ قَالَ قَدْ صَلَّيْتُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُصَلُّوا صَلَاةً فِي يَوْمٍ مَرَّتَيْنِ",
                "id": "Telah menceritakan kepada kami [Abu Kamil] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Husain] dari [Amru bin Syu'aib] dari [Sulaiman bin Yasar, mantan sahaya Maimunah] dia berkata; Saya pernah datang kepada [lbnu Umar] sewaktu dia sedang duduk di atas lantai, sementara keluarganya tengah mengerjakan sholat (berjama'ah). Saya berkata; Kenapa kamu tidak ikut sholat bersama mereka? Ibnu Umar mejawab; Saya telah mengerjakan sholat, saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mengerjakan satu sholat itu dua kali dalam sehari.\""
            },
            {
                "number": 480,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ عَنْ أَبِي عَلِيٍّ الْهَمْدَانِيِّ قَالَ سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَمَّ النَّاسَ فَأَصَابَ الْوَقْتَ فَلَهُ وَلَهُمْ وَمَنْ انْتَقَصَ مِنْ ذَلِكَ شَيْئًا فَعَلَيْهِ وَلَا عَلَيْهِمْ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Dawud Al-Mahri] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yahya bin Ayyub] dari [Abdurrahman bin Harmalah] dari [Abu 'Ali Al-Hamdani] dia berkata; Saya telah mendengar [Uqbah bin Amir] berkata; Saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang mengimami sholat orang banyak dan tepat pada waktunya, maka baginya dan bagi mereka pahala. Barangsiapa (di antara imam) yang mengurangi waktu meski sedikit, maka dosanya baginya dan tidak bagi mereka (para makmun).\""
            },
            {
                "number": 481,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبَّادٍ الْأَزْدِيُّ حَدَّثَنَا مَرْوَانُ حَدَّثَتْنِي طَلْحَةُ أُمُّ غُرَابٍ عَنْ عَقِيلَةَ امْرَأَةٍ مِنْ بَنِي فَزَارَةَ مَوْلَاةٍ لَهُمْ عَنْ سَلَامَةَ بِنْتِ الْحُرِّ أُخْتِ خَرَشَةَ بْنِ الْحُرِّ الْفَزَارِيِّ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يَتَدَافَعَ أَهْلُ الْمَسْجِدِ لَا يَجِدُونَ إِمَامًا يُصَلِّي بِهِمْ",
                "id": "Telah menceritakan kepada kami [Harun bin Abbad Al-Azdi] telah menceritakan kepada kami [Marwan] telah menceritakan kepadaku [Thalhah, Ummu Ghurab] dari ['Aqilah], seorang wanita dari Bani Fazarah, maula mereka dari [Salamah binti Al-Hurr], saudara wanita Kharasyah bin Al-Hurr Al-Fazari dia berkata; Saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Diantara tanda-tanda Hari Kiamat, jama'ah Masjid saling dorong karena mereka tidak mendapatkan imam yang bisa mengimami mereka sholat.\""
            },
            {
                "number": 482,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي إِسْمَعِيلُ بْنُ رَجَاءٍ سَمِعْتُ أَوْسَ بْنَ ضَمْعَجٍ يُحَدِّثُ عَنْ أَبِي مَسْعُودٍ الْبَدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَؤُمُّ الْقَوْمَ أَقْرَؤُهُمْ لِكِتَابِ اللَّهِ وَأَقْدَمُهُمْ قِرَاءَةً فَإِنْ كَانُوا فِي الْقِرَاءَةِ سَوَاءً فَلْيَؤُمَّهُمْ أَقْدَمُهُمْ هِجْرَةً فَإِنْ كَانُوا فِي الْهِجْرَةِ سَوَاءً فَلْيَؤُمَّهُمْ أَكْبَرُهُمْ سِنًّا وَلَا يُؤَمُّ الرَّجُلُ فِي بَيْتِهِ وَلَا فِي سُلْطَانِهِ وَلَا يُجْلَسُ عَلَى تَكْرِمَتِهِ إِلَّا بِإِذْنِهِقَالَ شُعْبَةُ فَقُلْتُ لِإِسْمَعِيلَ مَا تَكْرِمَتُهُ قَالَ فِرَاشُهُ حَدَّثَنَا ابْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ بِهَذَا الْحَدِيثِ قَالَ فِيهِ وَلَا يَؤُمُّ الرَّجُلُ الرَّجُلَ فِي سُلْطَانِهِ قَالَ أَبُو دَاوُد وَكَذَا قَالَ يَحْيَى الْقَطَّانُ عَنْ شُعْبَةَ أَقْدَمُهُمْ قِرَاءَةً حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ عَنْ الْأَعْمَشِ عَنْ إِسْمَعِيلَ بْنِ رَجَاءٍ عَنْ أَوْسِ بْنِ ضَمْعَجٍ الْحَضْرَمِيِّ قَالَ سَمِعْتُ أَبَا مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ قَالَ فَإِنْ كَانُوا فِي الْقِرَاءَةِ سَوَاءً فَأَعْلَمُهُمْ بِالسُّنَّةِ فَإِنْ كَانُوا فِي السُّنَّةِ سَوَاءً فَأَقْدَمُهُمْ هِجْرَةً وَلَمْ يَقُلْ فَأَقْدَمُهُمْ قِرَاءَةً قَالَ أَبُو دَاوُد رَوَاهُ حَجَّاجُ بْنُ أَرْطَاةَ عَنْ إِسْمَعِيلَ قَالَ وَلَا تَقْعُدْ عَلَى تَكْرِمَةِ أَحَدٍ إِلَّا بِإِذْنِهِ",
                "id": "Telah menceritakan kepada kami [Abul Walid Ath-Thayalisi] telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepadaku [Isma'il bin Raja`] Saya telah mendengar [Aus bin Dlam'aj] telah menceritakan dari [Abu Mas'ud Al-Badri] berkata; Rasulullah Shallallahu alaihi wasallam bersabda: \"Orang yang paling berhak menjadi imam sholat suatu kaum adalah yang paling pandai dalam Kitabullah (al-qur'an) dan lebih dahulu membacanya. Jika dalam hal bacaan mereka sama, maka hendaklah yang menjadi imam orang yang lebih dahulu hijrah. Jika dalam hal hijrah mereka sama, maka hendaklah yang menjadi imam yang lebih tua, dan janganlah seseorang menjadi imam di rumah orang lain dan jangan pula ketika dalam kekuasaan orang lain, serta jangan pula dia duduk di tempat yang khusus untuk tuan rumah kecuali dengan izinnya.\" Syu'bah berkata; Saya katakan kepada Isma'il; Apakah tempat yang khusus itu? Dia menjawab; Yaitu kasurnya. Telah menceritakan kepada kami [Ibnu Mu'adz] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Syu'bah] dengan hadits ini dan dia menyebutkan di dalamnya; Dan janganlah seseorang mengimami orang lain pada daerah kekuasaannya (wewenangnya). Abu Daud berkata; Dan begitu juga [Yahya Al Qathan] dari [Syu'bah]; Yang lebih dahulu bacaannya. Telah menceritakan kepada kami [Al-Hasan bin Ali] telah menceritakan kepada kami [Abdullah bin Numair] dari [Al-A'masy] dari [Isma'il bin Raja`] dari [Aus bin Dlam'aj Al-Hadhrami] dia berkata; Saya telah mendengar [Abu Mas'ud] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini, beliau bersabda: \"Apabila mereka dalah hal bacaan sama, maka hendaklah yang paling mengetahui tentang sunnah. Dan apabila mereka dalam hal sunnah sama, maka hendaklah yang lebih dahulu hijrah.\" Dalam riwayat ini beliau dia tidak menyebutkan; Yang paling dahulu bacaannya. Abu Dawud berkata; Hadits ini juga diriwayatkan oleh [Hajjaj bin Arthaah] dari [Isma'il] dia menyebutkan; Dan janganlah dia duduk di tempat yang khusus bagi tuan rumah kecuali atas idzinnya. "
            },
            {
                "number": 483,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا أَيُّوبُ عَنْ عَمْرِو بْنِ سَلَمَةَ قَالَكُنَّا بِحَاضِرٍ يَمُرُّ بِنَا النَّاسُ إِذَا أَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانُوا إِذَا رَجَعُوا مَرُّوا بِنَا فَأَخْبَرُونَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَذَا وَكَذَا وَكُنْتُ غُلَامًا حَافِظًا فَحَفِظْتُ مِنْ ذَلِكَ قُرْآنًا كَثِيرًا فَانْطَلَقَ أَبِي وَافِدًا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَفَرٍ مِنْ قَوْمِهِ فَعَلَّمَهُمْ الصَّلَاةَ فَقَالَ يَؤُمُّكُمْ أَقْرَؤُكُمْ وَكُنْتُ أَقْرَأَهُمْ لِمَا كُنْتُ أَحْفَظُ فَقَدَّمُونِي فَكُنْتُ أَؤُمُّهُمْ وَعَلَيَّ بُرْدَةٌ لِي صَغِيرَةٌ صَفْرَاءُ فَكُنْتُ إِذَا سَجَدْتُ تَكَشَّفَتْ عَنِّي فَقَالَتْ امْرَأَةٌ مِنْ النِّسَاءِ وَارُوا عَنَّا عَوْرَةَ قَارِئِكُمْ فَاشْتَرَوْا لِي قَمِيصًا عُمَانِيًّا فَمَا فَرِحْتُ بِشَيْءٍ بَعْدَ الْإِسْلَامِ فَرَحِي بِهِ فَكُنْتُ أَؤُمُّهُمْ وَأَنَا ابْنُ سَبْعِ سِنِينَ أَوْ ثَمَانِ سِنِينَحَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ عَنْ عَمْرِو بْنِ سَلَمَةَ بِهَذَا الْخَبَرِ قَالَ فَكُنْتُ أَؤُمُّهُمْ فِي بُرْدَةٍ مُوَصَّلَةٍ فِيهَا فَتْقٌ فَكُنْتُ إِذَا سَجَدْتُ خَرَجَتْ اسْتِي",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] telah mengabarkan kepada kami [Ayyub] dari [Amru bin Salamah] dia berkata; Kami pernah berada di suatu tempat yang sering dilewati oleh orang orang yang datang menghadap kepada Nabi shallallahu 'alaihi wasallam. Apabila mereka pulang, mereka melewati kami, lalu mereka memberitahukan kepada kami bahwa Rasulullah shallallahu 'alaihi wasallam bersabda begini dan begini. Saya adalah seorang pemuda yang kuat hafalannya, karena itu saya telah mampu menghafal banyak ayat-ayat al-qur'an. Ayahku pernah datang menghadap kepada Rasulullah shallallahu 'alaihi wasallam bersama beberapa orang sebagai utusan kaumnya. Lalu beliau mengajarkan kepada mereka tentang sholat, beliau bersabda: \"Yang berhak menjadi imam kalian (dalam sholat) adalah yang paling ahli dalam membaca al-qur'an.\" (Pada saat itu) sayalah yang paling ahli dalam membaca al-qur'an di antara mereka, karena saya sudah dapat menghafalnya, lalu mereka mengajukanku (untuk menjadi imam). Maka saya pun menjadi imam mereka dengan memakai kain yang kecil berwarna kuning, sehingga kalau saya sujud, terbuka auratku sedikit Lalu seorang wanita di antara mereka berkata; Tutupilah dari kami aurat ahli al-qur'an (yang jadi imam) kalian. Lalu mereka pun membelikan untukku baju buatan Oman, sehingga tidak pernah saya bahagia setelah masuk Islam seperti bahagiaku dengannya. Saya menjadi imam mereka, sedang usiaku baru tujuh atau delapan tahun. Telah menceritakan kepada kami [An-Nufaili] telah menceritakan kepada kami [Zhair] telah menceritakan kepada kami ['Ashim Al-Ahwal] dari [Amru bin Salamah] dengan hadits ini, dia berkata; Saya mengimami mereka dengan hanya memakai pakaian tambalan yang sobek, sehingga apabila saya bersujud, pantatku terlihat. "
            },
            {
                "number": 484,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا وَكِيعٌ عَنْ مِسْعَرِ بْنِ حَبِيبٍ الْجَرْمِيِّ حَدَّثَنَا عَمْرُو بْنُ سَلَمَةَ عَنْ أَبِيهِأَنَّهُمْ وَفَدُوا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا أَرَادُوا أَنْ يَنْصَرِفُوا قَالُوا يَا رَسُولَ اللَّهِ مَنْ يَؤُمُّنَا قَالَ أَكْثَرُكُمْ جَمْعًا لِلْقُرْآنِ أَوْ أَخْذًا لِلْقُرْآنِ قَالَ فَلَمْ يَكُنْ أَحَدٌ مِنْ الْقَوْمِ جَمَعَ مَا جَمَعْتُهُ قَالَ فَقَدَّمُونِي وَأَنَا غُلَامٌ وَعَلَيَّ شَمْلَةٌ لِي فَمَا شَهِدْتُ مَجْمَعًا مِنْ جَرْمٍ إِلَّا كُنْتُ إِمَامَهُمْ وَكُنْتُ أُصَلِّي عَلَى جَنَائِزِهِمْ إِلَى يَوْمِي هَذَاقَالَ أَبُو دَاوُد وَرَوَاهُ يَزِيدُ بْنُ هَارُونَ عَنْ مِسْعَرِ بْنِ حَبِيبٍ الْجَرْمِيِّ عَنْ عَمْرِو بْنِ سَلَمَةَ قَالَ لَمَّا وَفَدَ قَوْمِي إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَقُلْ عَنْ أَبِيهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Waki'] dari [Mis'ar bin Habib Al-Jarmi] telah menceritakan kepada kami [Amru bin Salamah] dari [Ayahnya] bahwasanya mereka pergi menghadap kepada Nabi shallallahu 'alaihi wasallam sebagai utusan kaumnya. Tatkala mereka hendak pulang, mereka bertanya; Wahai Rasulullah, siapakah (yang lebih berhak) untuk menjadi imam bagi kami? Beliau bersabda: \"Orang yang paling banyak menghafal al-qur'an.\" Amru bin Salamah berkata; Ternyata tidak ada seorang pun dari kaum kami yang menghafal al-qur'an sepertiku. Kata Amru; Karena itu mereka mengajukanku (untuk menjadi imam), padahal saya masih kanak kanak yang sedang memakai kain toga (sejenis jubah). Maka tidaklah saya menghadiri suatu perkumpulan di Jarm, melainkan saya pasti yang menjadi imam mereka, dan saya pula yang menyalati jenazah mereka (menjadi imam) sampai hari ini. Abu Dawud berkata; Dan diriwayatkan oleh [Yazid bin Harun] dari [Mis'ar bin Habib Al-Jarmi] dari [Amru bin Salamah] dia berkata; Tatkala kaumku mengirim utusan kepada Nabi shallallahu 'alaihi wasallam, tanpa menyebut dari ayahnya. "
            },
            {
                "number": 485,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا أَنَسٌ يَعْنِي ابْنَ عِيَاضٍ ح و حَدَّثَنَا الْهَيْثَمُ بْنُ خَالِدٍ الْجُهَنِيُّ الْمَعْنَى قَالَا حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ قَالَلَمَّا قَدِمَ الْمُهَاجِرُونَ الْأَوَّلُونَ نَزَلُوا الْعُصْبَةَ قَبْلَ مَقْدَمِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ يَؤُمُّهُمْ سَالِمٌ مَوْلَى أَبِي حُذَيْفَةَ وَكَانَ أَكْثَرَهُمْ قُرْآنًا زَادَ الْهَيْثَمُ وَفِيهِمْ عُمَرُ بْنُ الْخَطَّابِ وَأَبُو سَلَمَةَ بْنُ عَبْدِ الْأَسَدِ",
                "id": "Telah menceritakan kepada kami [Al-Qa'nabi] telah menceritakan kepada kami [Anas bin 'Iyadl] Al-Hadits. Dan telah menceritakan kepada kami [Al-Haitsam bin Khalid Al-Juhani] secara makna. Mereka berdua berkata; Telah menceritakan kepada kami [Ibnu Numair] dari [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwasanya dia berkata; Tatkala kaum muhajirin yang pertama-tama datang, mereka singgah di Ushbah (suatu kampung di Madinah) sebelum datangnya Nabi shallallahu 'alaihi wasallam, dan yang menjadi imam bagi mereka tatkala itu adalah Salim, mantan sahaya Abu Hudzaifah dan dia adalah orang yang paling banyak hafalan al-qur'annya. Al-Haitsami menambahkan; Dan di antara mereka ada Umar bin Al-Khaththab dan Abu Salamah bin Abdul Asad. "
            },
            {
                "number": 486,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا إِسْمَعِيلُ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا مَسْلَمَةُ بْنُ مُحَمَّدٍ الْمَعْنَى وَاحِدٌ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ أَوْ لِصَاحِبٍ لَهُ إِذَا حَضَرَتْ الصَّلَاةُ فَأَذِّنَا ثُمَّ أَقِيمَا ثُمَّ لِيَؤُمَّكُمَا أَكْبَرُكُمَا سِنًّا وَفِي حَدِيثِ مَسْلَمَةَ قَالَ وَكُنَّا يَوْمَئِذٍ مُتَقَارِبَيْنِ فِي الْعِلْمِو قَالَ فِي حَدِيثِ إِسْمَعِيلَ قَالَ خَالِدٌ قُلْتُ لِأَبِي قِلَابَةَ فَأَيْنَ الْقُرْآنُ قَالَ إِنَّهُمَا كَانَا مُتَقَارِبَيْنِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Isma'il] Al-Hadits. Dan telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Maslamah bin Muhammad] dengan makna yang sama, dari [Khalid] dari [Abu Qilabah] dari [Malik bin Al-Huwairits] bahwasanya Nabi shallallahu 'alaihi wasallam pernah bersabda kepadanya atau kepada temannya: \"Apabila waktu sholat telah tiba, maka adzanlah, kemudian kumandangkanlah iqamah, lalu hendaklah yang lebih tua dari kalian berdua yang menjadi imam.\" Dan di dalam hadits Maslamah disebutkan, dia berkata; Dan ketika itu kami memiliki ilmu yang tidak jauh berbeda. Dia berkata di dalam hadits Isma'il berkata Khalid Saya bertanya kepada Abu Qi1abah; Lalu siapakah (yang lebih ahli) al-qur'an? Dia menjawab; Sesungguhnya keduanya itu hampir sama dalam i1mu pegetahuan. "
            },
            {
                "number": 487,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حُسَيْنُ بْنُ عِيسَى الْحَنَفِيُّ حَدَّثَنَا الْحَكَمُ بْنُ أَبَانَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُؤَذِّنْ لَكُمْ خِيَارُكُمْ وَلْيَؤُمَّكُمْ قُرَّاؤُكُمْ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abi Syaibah] telah menceritakan kepada kami [Husain bin Isa Al-Hanafi] telah menceritakan kepada kami [Al-Hakam bin Aban] dari [Ikrimah] dari [Ibnu Abbas] dia berkata; Rasulullah Shallallahu alaihi wasallam bersabda: \"Yang mengumandangkan adzan hendaknya adalah orang yang terpilih di antara kalian dan yang menjadi imam hendaknya yang lebih ahli bacaan al-qur'annya.\""
            },
            {
                "number": 488,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعُ بْنُ الْجَرَّاحِ حَدَّثَنَا الْوَلِيدُ بْنُ عَبْدِ اللَّهِ بْنِ جُمَيْعٍ قَالَ حَدَّثَتْنِي جَدَّتِي وَعَبْدُ الرَّحْمَنِ بْنُ خَلَّادٍ الْأَنْصَارِيُّ عَنْ أُمِّ وَرَقَةَ بِنْتِ عَبْدِ اللَّهِ بْنِ نَوْفَلٍ الْأَنْصَارِيَّةِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا غَزَا بَدْرًا قَالَتْ قُلْتُ لَهُ يَا رَسُولَ اللَّهِ ائْذَنْ لِي فِي الْغَزْوِ مَعَكَ أُمَرِّضُ مَرْضَاكُمْ لَعَلَّ اللَّهَ أَنْ يَرْزُقَنِي شَهَادَةً قَالَ قَرِّي فِي بَيْتِكِ فَإِنَّ اللَّهَ تَعَالَى يَرْزُقُكِ الشَّهَادَةَ قَالَ فَكَانَتْ تُسَمَّى الشَّهِيدَةُ قَالَ وَكَانَتْ قَدْ قَرَأَتْ الْقُرْآنَ فَاسْتَأْذَنَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَتَّخِذَ فِي دَارِهَا مُؤَذِّنًا فَأَذِنَ لَهَا قَالَ وَكَانَتْ قَدْ دَبَّرَتْ غُلَامًا لَهَا وَجَارِيَةً فَقَامَا إِلَيْهَا بِاللَّيْلِ فَغَمَّاهَا بِقَطِيفَةٍ لَهَا حَتَّى مَاتَتْ وَذَهَبَا فَأَصْبَحَ عُمَرُ فَقَامَ فِي النَّاسِ فَقَالَ مَنْ كَانَ عِنْدَهُ مِنْ هَذَيْنِ عِلْمٌ أَوْ مَنْ رَآهُمَا فَلْيَجِئْ بِهِمَا فَأَمَرَ بِهِمَا فَصُلِبَا فَكَانَا أَوَّلَ مَصْلُوبٍ بِالْمَدِينَةِحَدَّثَنَا الْحَسَنُ بْنُ حَمَّادٍ الْحَضْرَمِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ الْوَلِيدِ بْنِ جُمَيْعٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ خَلَّادٍ عَنْ أُمِّ وَرَقَةَ بِنْتِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بِهَذَا الْحَدِيثِ وَالْأَوَّلُ أَتَمُّ قَالَ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَزُورُهَا فِي بَيْتِهَا وَجَعَلَ لَهَا مُؤَذِّنًا يُؤَذِّنُ لَهَا وَأَمَرَهَا أَنْ تَؤُمَّ أَهْلَ دَارِهَا قَالَ عَبْدُ الرَّحْمَنِ فَأَنَا رَأَيْتُ مُؤَذِّنَهَا شَيْخًا كَبِيرًا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abi Syaibah] telah menceritakan kepada kami [Waki' bin Al-Jarrah] telah menceritakan kepada kami [Al-Walid bin Abdullah bin Jumai'] dia berkata; Telah menceritakan kepadaku [Nenekku] dan [Abdurrahman bin Khallad Al-Anshari] dari [Ummu Waraqah binti Abdillah bin Naufal Al-Anshariyah] bahwasanya Nabi shallallahu 'alaihi wasallam ketika menuju ke pertempuran badar, dia berkata; saya bertanya kepada beliau; Ya Rasulullah, izinkanlah saya ikut serta dalam peperangan bersamamu untuk merawat prajurit-prajurit yang sakit, mudah mudahan Allah menganugerahkan kepadaku mati syahid. Beliau bersabda; \"Tetaplah di rumahmu, sesungguhnya Ta'ala akan menganugerahkan kepadamu mati syahid.\" Perawi Hadits ini berkata; Karena itulah dia disebut Asy Syahidah (wanita yang mati syahid). Kata perawi; Dia adalah ahli al-qur'an, lalu dia meminta izin kepada Nabi shallallahu 'alaihi wasallam supaya diperbolehkan mengambil seorang muadzin di rumahnya. Lalu beliau mengizinkannya. Katanya; Dia membuat kedua budaknya yang laki laki dan perempuan sebagai budak Mudabbar (budak yang dijanjikan merdeka sepeninggal tuannya). Pada suatu malam, kedua budak itu bangun dan pergi kepadanya, Ialu menyelubungkan sehelai kain tutup mukanya ke wajahnya sampai wanita itu meninggal, sementara kedua budak itu melarikan diri. Pada keesokan harinya, Umar berdiri di hadapan orang banyak, lalu berkata; Barangsiapa yang mengetahui kedua atau melihat kedua budak ini, hendaklah membawanya kemari! Setelah tertangkap, maka keduanya diperintahkan untuk disalib. Kedua budak inilah orang yang pertama kali disalib di kota Madinah. Telah menceritakan kepada kami [Al-Hasan bin Hammad Al-Hadlrami] telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Al-Walid bin Jumai'] dari [Abdurrahman bin Khallad] dari [Ummu Waraqah binti Abdullah bin Al-Harits] dengan hadits ini, namun yang pertama lebih lengkap. Dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah berkunjung ke rumahnya dan beliau mengangkat seorang muadzin yang menyerukan adzan untuknya dan beliau mengizinkan Ummu Waraqah menjadi imam keluarganya. Abdurrahman berkata; Saya melihat muadzinnya adalah seorang laki laki yang sudah tua. "
            },
            {
                "number": 489,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ غَانِمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ زِيَادٍ عَنْ عِمْرَانَ بْنِ عَبْدٍ الْمَعَافِرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ ثَلَاثَةٌ لَا يَقْبَلُ اللَّهُ مِنْهُمْ صَلَاةً مَنْ تَقَدَّمَ قَوْمًا وَهُمْ لَهُ كَارِهُونَ وَرَجُلٌ أَتَى الصَّلَاةَ دِبَارًا وَالدِّبَارُ أَنْ يَأْتِيَهَا بَعْدَ أَنْ تَفُوتَهُ وَرَجُلٌ اعْتَبَدَ مُحَرَّرَهُ",
                "id": "Telah menceritakan kepada kami [Al-Qa'nabi] telah menceritakan kepada kami [Abdullah bin Umar bin Ghanim] dari [Abdurrahman bin Ziyad] dari [Imran bin Abd Al-Ma'afiri] dari [Abdullah bin Amru] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada tiga orang yang Allah tidak menerima sholat dari mereka, yaitu: orang yang menjadi imam di tengah-tengah masyarakat yang membencinya, orang yang selalu melaksanakan sholat setelah waktunya habis, dan orang yang memperbudak orang yang telah dimerdekakannya.\""
            },
            {
                "number": 490,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي مُعَاوِيَةُ بْنُ صَالِحٍ عَنْ الْعَلَاءِ بْنِ الْحَارِثِ عَنْ مَكْحُولٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةُ الْمَكْتُوبَةُ وَاجِبَةٌ خَلْفَ كُلِّ مُسْلِمٍ بَرًّا كَانَ أَوْ فَاجِرًا وَإِنْ عَمِلَ الْكَبَائِرَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah menceritakan kepada saya [Mu'awiyah bin Shalih] dari [Al-'Ala` bin Al-Harits] dari [Makhul] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat yang telah ditetapkan (sholat farlu) wajib dilakukan di belakang setiap Muslim, baik dia orang baik ataupun orang jahat, meskipun dia melakukan dosa besar.\""
            },
            {
                "number": 491,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الْعَنْبَرِيُّ أَبُو عَبْدِ اللَّهِ حَدَّثَنَا ابْنُ مَهْدِيٍّ حَدَّثَنَا عِمْرَانُ الْقَطَّانُ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَخْلَفَ ابْنَ أُمِّ مَكْتُومٍ يَؤُمُّ النَّاسَ وَهُوَ أَعْمَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdurrahman Al-'Anbari Abu Abdillah] telah menceritakan kepada kami [Ibnu Mahdi] telah menceritakan kepada kami ['Imran Al-Qaththan] dari [Qatadah] dari [Anas] bahwasanya Nabi shallallahu 'alaihi wasallam pernah menyuruh Ibnu Ummi Maktum menggantikan beliau untuk mengimami manusia sedangkan dia adalah orang yang buta. "
            },
            {
                "number": 492,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبَانُ عَنْ بُدَيْلٍ حَدَّثَنِي أَبُو عَطِيَّةَ مَوْلًى مِنَّا قَالَكَانَ مَالِكُ بْنُ حُوَيْرِثٍ يَأْتِينَا إِلَى مُصَلَّانَا هَذَا فَأُقِيمَتْ الصَّلَاةُ فَقُلْنَا لَهُ تَقَدَّمْ فَصَلِّهْ فَقَالَ لَنَا قَدِّمُوا رَجُلًا مِنْكُمْ يُصَلِّي بِكُمْ وَسَأُحَدِّثُكُمْ لِمَ لَا أُصَلِّي بِكُمْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ زَارَ قَوْمًا فَلَا يَؤُمَّهُمْ وَلْيَؤُمَّهُمْ رَجُلٌ مِنْهُمْ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Aban] dari [Budail] telah menceritakan kepada saya [Abu 'Athiyyah mantan sahaya kami] dia berkata; [Malik bin Huwairits] pernah mengunjungi kami di mushalla kami ini, lalu tatkala iqamat sholat telah dikumandangkan, kami berkata kepadanya; Maju dan jadilah imam sholat. Namun dia berkata kepada kami; Pilihlah salah seorang dari kalian untuk sholat mengimami kalian dan saya akan menceritakan kepada kalian mengapa saya tidak mau mengimami kalian, saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang mengunjungi suatu kaum maka janganlah dia mengimami mereka, akan tetapi hendaklah yang mengimami mereka adalah salah seorang dari mereka.\""
            },
            {
                "number": 493,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ وَأَحْمَدُ بْنُ الْفُرَاتِ أَبُو مَسْعُودٍ الرَّازِيُّ الْمَعْنَى قَالَا حَدَّثَنَا يَعْلَى حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ هَمَّامٍأَنَّ حُذَيْفَةَ أَمَّ النَّاسَ بِالْمَدَائِنِ عَلَى دُكَّانٍ فَأَخَذَ أَبُو مَسْعُودٍ بِقَمِيصِهِ فَجَبَذَهُ فَلَمَّا فَرَغَ مِنْ صَلَاتِهِ قَالَ أَلَمْ تَعْلَمْ أَنَّهُمْ كَانُوا يُنْهَوْنَ عَنْ ذَلِكَ قَالَ بَلَى قَدْ ذَكَرْتُ حِينَ مَدَدْتَنِي",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sinan] dan [Ahmad bin Al-Furat Abu Mas'ud Ar-Razi] dengan makna. Dia berkata; Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Al-A'masy] dari [Ibrahim] dari [Hammam] bahwasanya [Hudzaifah] sedang mengimami masyarakat Mada`in di atas bangku panjang, maka Abu Mas'ud menarik bajunya, dan ketika selesai melaksanakan sholat, [Abu Mas'ud] berkata; Tidakkah kamu tahu bahwa mereka dilarang untuk melaksanakan hal demikian? Dia menjawab; Ya, aku ingat ketika kamu menarik bajuku."
            },
            {
                "number": 494,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو خَالِدٍ عَنْ عَدِيِّ بْنِ ثَابِتٍ الْأَنْصَارِيِّ حَدَّثَنِي رَجُلٌأَنَّهُ كَانَ مَعَ عَمَّارِ بْنِ يَاسِرٍ بِالْمَدَائِنِ فَأُقِيمَتْ الصَّلَاةُ فَتَقَدَّمَ عَمَّارٌ وَقَامَ عَلَى دُكَّانٍ يُصَلِّي وَالنَّاسُ أَسْفَلَ مِنْهُ فَتَقَدَّمَ حُذَيْفَةُ فَأَخَذَ عَلَى يَدَيْهِ فَاتَّبَعَهُ عَمَّارٌ حَتَّى أَنْزَلَهُ حُذَيْفَةُ فَلَمَّا فَرَغَ عَمَّارٌ مِنْ صَلَاتِهِ قَالَ لَهُ حُذَيْفَةُ أَلَمْ تَسْمَعْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا أَمَّ الرَّجُلُ الْقَوْمَ فَلَا يَقُمْ فِي مَكَانٍ أَرْفَعَ مِنْ مَقَامِهِمْ أَوْ نَحْوَ ذَلِكَقَالَ عَمَّارٌ لِذَلِكَ اتَّبَعْتُكَ حِينَ أَخَذْتَ عَلَى يَدَيَّ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Ibrahim] telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] telah mengabarkan kepada saya [Abu Khalid] dari [Adi bin Tsabit Al-Anshari] telah menceritakan kepada saya [Seorang laki-laki] yang pernah bersama Ammar bin Yasir sewaktu di Mada`in, ketika iqamat sholat telah dikumandangkan, 'Ammar maju untuk menjadi imam dan dia berdiri di atas bangku panjang, sementara para makmum berada di bawahnya, lalu Hudzaifah maju dan menarik tangan 'Ammar dan 'Ammar pun mengikutinya hingga dia diturunkan ditempat yang sejajar oleh Hudzaifah. Setelah 'Ammar selesai sholat, [Hudzaifah] berkata kepadanya; Apakah kamu belum pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila seseorang mengimami suatu kaum, maka janganlah dia berdiri di tempat yang lebih tinggi dari tempat mereka\", atau semisal ucapan tersebut. Ammar berkata; Maka dari itu saya mengikutimu tatkala kamu menarik tanganku. "
            },
            {
                "number": 495,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مِقْسَمٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ مُعَاذَ بْنَ جَبَلٍ كَانَ يُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعِشَاءَ ثُمَّ يَأْتِي قَوْمَهُ فَيُصَلِّي بِهِمْ تِلْكَ الصَّلَاةَ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Umar bin Maisarah] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Muhammad bin 'Ajlan] telah menceritakan kepada kami [ubaidhullah bin Miqsam] dari [Jabir bin Abdullah] bahwasanya Mu'adz bin Jabal pernah sholat Isya bersama Rasulullah shallallahu 'alaihi wasallam, kemudian dia pergi kepada kaumnya dan mengimami mereka sholat tersebut. "
            },
            {
                "number": 496,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ إِنَّ مُعَاذًاكَانَ يُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ يَرْجِعُ فَيَؤُمُّ قَوْمَهُ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Sufyan] dari [Amru bin Dinar] dia pernah mendengar [Jabir bin Abdullah] berkata; Mu'adz pernah sholat bersama Nabi shallallahu 'alaihi wasallam, kemudian dia pulang dan mengimami kaumnya. "
            },
            {
                "number": 497,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكِبَ فَرَسًا فَصُرِعَ عَنْهُ فَجُحِشَ شِقُّهُ الْأَيْمَنُ فَصَلَّى صَلَاةً مِنْ الصَّلَوَاتِ وَهُوَ قَاعِدٌ وَصَلَّيْنَا وَرَاءَهُ قُعُودًا فَلَمَّا انْصَرَفَ قَالَ إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا صَلَّى قَائِمًا فَصَلُّوا قِيَامًا وَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَارْفَعُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا رَبَّنَا وَلَكَ الْحَمْدُ وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًا أَجْمَعُونَ",
                "id": "Telah menceritakan kepada kami [Al-Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Anas bin Malik], Rasulullah shallallahu 'alaihi wasallam pernah menaiki seekor kuda, lalu beliau terpelanting darinya hingga sisi kanannya terkoyak, lalu beliau melaksanakan salah satu sholat wajib dengan duduk dan kami pun sholat di belakang beliau dengan duduk. Tatkala selesai, beliau bersabda: \"Sesungguhnya imam itu dijadikan hanyalah untuk diikuti, apabila dia sholat dengan berdiri maka sholatlah kalian dengan berdiri, apabila dia rukuk maka rukuklah, apabila dia bangkit maka bangkitlah, apabila dia mengucapkan, 'Sami'allaahu liman hamidah' (Allah mendengar kepada orang yang memujiNya), maka ucapkanlah, 'Rabbanaa Walakal Hamdu' (Wahai Rabb Kami, segala puji hanya bagiMu), dan apabila dia sholat dengan duduk maka sholatlah kalian dengan duduk.\""
            },
            {
                "number": 498,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ وَوَكِيعٌ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَرَكِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَسًا بِالْمَدِينَةِ فَصَرَعَهُ عَلَى جِذْمِ نَخْلَةٍ فَانْفَكَّتْ قَدَمُهُ فَأَتَيْنَاهُ نَعُودُهُ فَوَجَدْنَاهُ فِي مَشْرُبَةٍ لِعَائِشَةَ يُسَبِّحُ جَالِسًا قَالَ فَقُمْنَا خَلْفَهُ فَسَكَتَ عَنَّا ثُمَّ أَتَيْنَاهُ مَرَّةً أُخْرَى نَعُودُهُ فَصَلَّى الْمَكْتُوبَةَ جَالِسًا فَقُمْنَا خَلْفَهُ فَأَشَارَ إِلَيْنَا فَقَعَدْنَا قَالَ فَلَمَّا قَضَى الصَّلَاةَ قَالَ إِذَا صَلَّى الْإِمَامُ جَالِسًا فَصَلُّوا جُلُوسًا وَإِذَا صَلَّى الْإِمَامُ قَائِمًا فَصَلُّوا قِيَامًا وَلَا تَفْعَلُوا كَمَا يَفْعَلُ أَهْلُ فَارِسَ بِعُظَمَائِهَا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abi Syaibah] telah menceritakan kepada kami [Jarir] dan [Waki'] dari [Al-A'masy] dari [Abu Sufyan] dari [Jabir] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah menaiki seekor kuda di Madinah, lalu kuda itu menjatuhkan beliau pada akar pohon kurma hingga kakinya keseleo. Maka kami menjenguk beliau, kami mendapati beliau di kamar 'Aisyah sedang melaksanakan sholat sunnah dalam keadaan duduk. Dia (perawi) berkata; Maka kami pun berdiri di belakang beliau, namun beliau tidak berbicara dengan kami. Kemudian kami menjenguk beliau kembali (pada waktu yang lain), lalu beliau sholat wajib dengan duduk, sedangkan kami berdiri di belakang beliau, kemudian beliau memberikan isyarat kepada kami agar duduk, maka kami pun duduk. Dia (perawi) berkata; Tatkala selesai sholat, beliau bersabda: \"Apabila imam sholat dengan duduk maka sholatlah kalian dengan duduk, dan apabila imam sholat dengan berdiri maka sholatlah kalian dengan berdiri, dan janganlah kalian melakukan sebagaimana yang dilakukan oleh orang-orang Persia kepada para pemimpin mereka.\""
            },
            {
                "number": 499,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ الْمَعْنَى عَنْ وُهَيْبٍ عَنْ مُصْعَبِ بْنِ مُحَمَّدٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا كَبَّرَ فَكَبِّرُوا وَلَا تُكَبِّرُوا حَتَّى يُكَبِّرَ وَإِذَا رَكَعَ فَارْكَعُوا وَلَا تَرْكَعُوا حَتَّى يَرْكَعَ وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ قَالَ مُسْلِمٌ وَلَكَ الْحَمْدُ وَإِذَا سَجَدَ فَاسْجُدُوا وَلَا تَسْجُدُوا حَتَّى يَسْجُدَ وَإِذَا صَلَّى قَائِمًا فَصَلُّوا قِيَامًا وَإِذَا صَلَّى قَاعِدًا فَصَلُّوا قُعُودًا أَجْمَعُونَقَالَ أَبُو دَاوُد اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ أَفْهَمَنِي بَعْضُ أَصْحَابِنَا عَنْ سُلَيْمَانَ حَدَّثَنَا مُحَمَّدُ بْنُ آدَمَ الْمِصِّيصِيُّ حَدَّثَنَا أَبُو خَالِدٍ عَنْ ابْنِ عَجْلَانَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ بِهِ بِهَذَا الْخَبَرِ زَادَ وَإِذَا قَرَأَ فَأَنْصِتُوا قَالَ أَبُو دَاوُد وَهَذِهِ الزِّيَادَةُ وَإِذَا قَرَأَ فَأَنْصِتُوا لَيْسَتْ بِمَحْفُوظَةٍ الْوَهْمُ عِنْدَنَا مِنْ أَبِي خَالِدٍ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] dan [Muslim dan Ibrahim] dengan makna, dari [Wuhaib] dari [Mush'ab bin Muhammad] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Imam itu dijadikan hanyalah untuk diikuti, apabila dia bertakbir maka bertakbirlah kalian dan janganlah kalian bertakbir hingga dia bertakbir, apabila dia rukuk maka rukuklah kalian dan janganlah kalian rukuk hingga dia rukuk, apabila dia mengucapkan, 'Sami'allaahu liman hamidah' (Allah mendengar kepada orang yang memujiNya), maka ucapkanlah, 'Allahumma Rabbanaa Walakal Hamdu' (Ya Allah, wahai Rabb Kami, segala puji hanya bagiMu). Muslim menyebutkan (dengan lafazh); Walakalhamdu. Apabila dia sujud maka sujudlah kalian dan janganlah kalian sujud hingga dia sujud, apabila dia sholat dengan berdiri maka sholatlah kalian dengan berdiri dan apabila dia sholat dengan duduk maka sholatlah kalian semua dengan duduk.\" Abu Dawud menyebutkan; Allahumma Rabbana Lakalhamdu, telah memahamkan saya sebagian sahabat kami, dari [Sulaiman] telah menceritakan kepada kami [Muhammad bin Adam Al-Mishshishi] telah menceritakan kepada kami [Abu Khalid] dari [Ibnu 'Ajlan] dari [Zaid bin Aslam] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya imam itu dijadikan hanyalah untuk diikuti, \" dengan hadits ini, dan dia menambahkan; Dan apabila dia (imam) membaca (al-qur'an) maka diamlah kalian. Abu Dawud berkata; Tambahan ini, yakni, \"Dan apabila dia (imam) membaca (al-qur'an) maka diamlah kalian\", tidaklah terhafal, dan kesalahan pada kami dari Abu Khalid. "
            },
            {
                "number": 500,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِهِ وَهُوَ جَالِسٌ فَصَلَّى وَرَاءَهُ قَوْمٌ قِيَامًا فَأَشَارَ إِلَيْهِمْ أَنْ اجْلِسُوا فَلَمَّا انْصَرَفَ قَالَ إِنَّمَا جُعِلَ الْإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا رَفَعَ فَارْفَعُوا وَإِذَا صَلَّى جَالِسًا فَصَلُّوا جُلُوسًاحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَيَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ الْمَعْنَى أَنَّ اللَّيْثَ حَدَّثَهُمْ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ قَالَ اشْتَكَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّيْنَا وَرَاءَهُ وَهُوَ قَاعِدٌ وَأَبُو بَكْرٍ يُكَبِّرُ لِيُسْمِعَ النَّاسَ تَكْبِيرَهُ ثُمَّ سَاقَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Al-Qa'nabi] dari [Malik] dari [Hisyam bin Urwah] dari [Ayahnya] dari [Aisyah] istri Nabi shallallahu 'alaihi wasallam, bahwasanya dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah sholat di rumahnya dengan duduk, kemudian orang-orang sholat di belakang beliau dengan berdiri, maka beliau mengisyaratkan kepada mereka untuk duduk. Tatkala selesai, beliau bersabda: \"Imam itu dijadikan hanyalah untuk diikuti, apabila dia rukuk maka rukuklah kalian, apabila dia bangkit maka bangkitlah kalian, dan apabila dia sholat dengan duduk maka sholatlah kalian dengan duduk.\" Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Yazid bin Khalid bin Mauhib] dengan makna. Bahwasanya [Al-Laits] telah menceritakan kepada mereka dari [Abu Az-Zubair] dari [Jabir] dia berkata; Nabi shallallahu 'alaihi wasallam sakit, maka kami sholat di belakang beliau sedangkan beliau dalam keadaan duduk dan Abu Bakar bertakbir untuk memperdengarkan takbir beliau kepada para makmu, kemudian dia menyebutkan hadits secara lengkap. "
            },
            {
                "number": 501,
                "arab": "حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ أَخْبَرَنَا زَيْدٌ يَعْنِي ابْنَ الْحُبَابِ عَنْ مُحَمَّدِ بْنِ صَالِحٍ حَدَّثَنِي حُصَيْنٌ مِنْ وَلَدِ سَعْدِ بْنِ مُعَاذٍ عَنْ أُسَيْدِ بْنِ حُضَيْرٍأَنَّهُ كَانَ يَؤُمُّهُمْ قَالَ فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُهُ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّ إِمَامَنَا مَرِيضٌ فَقَالَ إِذَا صَلَّى قَاعِدًا فَصَلُّوا قُعُودًاقَالَ أَبُو دَاوُد وَهَذَا الْحَدِيثُ لَيْسَ بِمُتَّصِلٍ",
                "id": "Telah menceritakan kepada kami ['Abdah bin Abdullah] telah mengabarkan kepada kami [Zaid, yakni Ibnu Al-Hubab] dari [Muhammad bin Shalih] telah menceritakan kepada saya [Hushain] dari anaknya Sa'ad bin Mu'adz dari [Usaid bin Hudhair] bahwa dia mengimami mereka (kaumnya), lalu Rasulullah shallallahu 'alaihi wasallam datang untuk menjenguknya, mereka (kaumnya) berkata; Ya Rasulallah, sesungguhnya imam kami (Usaid bin Hudhair) sedang sakit! Maka beliau bersabda: \"Apabila imam kalian sholat dengan duduk maka sholatlah kalian dengan duduk.\" Abu Dawud berkata; Hadits ini tidak muttashil (bersambung sanadnya). "
            },
            {
                "number": 502,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى أُمِّ حَرَامٍ فَأَتَوْهُ بِسَمْنٍ وَتَمْرٍ فَقَالَ رُدُّوا هَذَا فِي وِعَائِهِ وَهَذَا فِي سِقَائِهِ فَإِنِّي صَائِمٌ ثُمَّ قَامَ فَصَلَّى بِنَا رَكْعَتَيْنِ تَطَوُّعًا فَقَامَتْ أُمُّ سُلَيْمٍ وَأُمُّ حَرَامٍ خَلْفَنَا قَالَ ثَابِتٌ وَلَا أَعْلَمُهُ إِلَّا قَالَ أَقَامَنِي عَنْ يَمِينِهِ عَلَى بِسَاطٍ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] telah mengabarkan kepada kami [Tsabit] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam pernah mengunjungi Ummu Haram, kemudian mereka memberikan beliau samin dan kurma, maka beliau bersabda: \"Kembalikan ini ke tempatnya dan ini ke tempatnya, sesungguhnya aku sedang berpuasa.\" Kemudian beliau sholat sunnah dua rakaat bersama kami. Ummu Sulaim dan Ummu Haram berdiri di belakang kami. Tsabit berkata; Saya tidak mengetahuinya kecuali mengatakan; Beliau memberdirikanku di sebelah kanannya di atas permadani. "
            },
            {
                "number": 503,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ اللَّهِ بْنِ الْمُخْتَارِ عَنْ مُوسَى بْنِ أَنَسٍ يُحَدِّثُ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّهُ وَامْرَأَةً مِنْهُمْ فَجَعَلَهُ عَنْ يَمِينِهِ وَالْمَرْأَةَ خَلْفَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Abdullah bin Al-Mukhtar] dari [Musa bin Anas] dia menceritakan dari [Anas] bahwasanya Rasulullah shallallahu 'alaihi wasallam pernah mengimaminya dan seorang wanita dari mereka, maka beliau menjadikan Anas di sebelah kanannya dan wanita tersebut di belakang mereka. "
            },
            {
                "number": 504,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَبِتُّ فِي بَيْتِ خَالَتِي مَيْمُونَةَ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ اللَّيْلِ فَأَطْلَقَ الْقِرْبَةَ فَتَوَضَّأَ ثُمَّ أَوْكَأَ الْقِرْبَةَ ثُمَّ قَامَ إِلَى الصَّلَاةِ فَقُمْتُ فَتَوَضَّأْتُ كَمَا تَوَضَّأَ ثُمَّ جِئْتُ فَقُمْتُ عَنْ يَسَارِهِ فَأَخَذَنِي بِيَمِينِهِ فَأَدَارَنِي مِنْ وَرَائِهِ فَأَقَامَنِي عَنْ يَمِينِهِ فَصَلَّيْتُ مَعَهُحَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا هُشَيْمٌ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ فِي هَذِهِ الْقِصَّةِ قَالَ فَأَخَذَ بِرَأْسِي أَوْ بِذُؤَابَتِي فَأَقَامَنِي عَنْ يَمِينِهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Abdul Malik bin Abu Sulaiman] dari ['Atha`] dari [Ibnu Abbas] dia berkata; Saya pernah bermalam di rumah bibi, Maimunah, kemudian Rasulullah shallallahu 'alaihi wasallam bangun di malam hari, beliau membuka geriba (kantong air dari kulit) dan berwudhu, kemudian menutup kembali geriba tersebut dan berdiri untuk sholat. Lalu saya bangun dan berwudhu sebagaimana beliau berwudhu, kemudian saya menghampiri beliau dan berdiri sisi kiri beliau, namun kemudian beliau memegang tanganku dan memindahkanku lewat belakang beliau hingga aku ditempatkan di sisi kanan beliau, lalu aku pun sholat dengan beliau. Telah menceritakan kepada kami ['Amru bin 'Aun] telah mengabarkan kepada kami [Husyaim] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dalam kisah ini dia berkata; Beliau shallallahu 'alaihi wasallam memegang kepalaku atau rambut kepalaku kemudian menempatkanku di sebelah kanan beliau. "
            },
            {
                "number": 505,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ جَدَّتَهُ مُلَيْكَةَ دَعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِطَعَامٍ صَنَعَتْهُ فَأَكَلَ مِنْهُ ثُمَّ قَالَ قُومُوا فَلَأُصَلِّيَ لَكُمْ قَالَ أَنَسٌ فَقُمْتُ إِلَى حَصِيرٍ لَنَا قَدْ اسْوَدَّ مِنْ طُولِ مَا لُبِسَ فَنَضَحْتُهُ بِمَاءٍ فَقَامَ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصَفَفْتُ أَنَا وَالْيَتِيمُ وَرَاءَهُ وَالْعَجُوزُ مِنْ وَرَائِنَا فَصَلَّى لَنَا رَكْعَتَيْنِ ثُمَّ انْصَرَفَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Al-Qa'nabi] dari [Malik] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] bahwa Neneknya, Mulaikah pernah mengundang Rasulullah shallallahu 'alaihi wasallam untuk suatu jamuan makan yang telah dibuatnya. Beliau makan darinya kemudian bersabda: \"Bangkitlah, saya akan mengerjakan sholat untuk kalian.\" Kata Anas; Saya bangkit untuk mengambil tikar kami yang telah menghitam karena lamanya dipakai, lalu saya memercikinya dengan air, kemudian Rasulullah shallallahu 'alaihi wasallam berdiri di atasnya. Saya dan seorang yatim berbaris membuat shaf di belakang beliau, sedangkan nenekku berdiri di belakang kami. Beliau mengerjakan sholat dua rakaat untuk kami, kemudian beliau shallallahu 'alaihi wasallam pergi."
            },
            {
                "number": 506,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ هَارُونَ بْنِ عَنْتَرَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ قَالَاسْتَأْذَنَ عَلْقَمَةُ وَالْأَسْوَدُ عَلَى عَبْدِ اللَّهِ وَقَدْ كُنَّا أَطَلْنَا الْقُعُودَ عَلَى بَابِهِ فَخَرَجَتْ الْجَارِيَةُ فَاسْتَأْذَنَتْ لَهُمَا فَأَذِنَ لَهُمَا ثُمَّ قَامَ فَصَلَّى بَيْنِي وَبَيْنَهُ ثُمَّ قَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abi Syaibah] telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Harun bin 'Antarah] dari [Abdurrahman bin Al-Aswad] dari [Ayahnya] dia berkata; Alqamah dan Al-Aswad pernah meminta izin untuk berkunjung ke rumah [Abdullah bin Mas'ud], kami telah lama duduk menunggu di depan pintunya. Tidak lama kemudian keluar seorang gadis, lalu memohonkan izin untuk kedua orang ini, maka beliau (Abdullah) mengizinkan keduanya. Kemudian Abdullah berdiri mengerjakan sholat antara saya dan Alqamah, setelah itu dia berkata; Demikianlah saya melihat Rasulullah shallallahu 'alaihi wasallam mengerjakannya. "
            },
            {
                "number": 507,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ حَدَّثَنِي يَعْلَى بْنُ عَطَاءٍ عَنْ جَابِرِ بْنِ يَزِيدَ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ قَالَصَلَّيْتُ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ إِذَا انْصَرَفَ انْحَرَفَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Sufyan] telah menceritakan kepadaku [Ya'la bin 'Atha`] dari [Jabir bin Yazid Al-Aswad] dari [Ayahnya] dia berkata; Saya pernah sholat di belakang Rasulullah Shallallahu alaihi wasallam, beliau apabila selesai melaksanakan sholat, beliau merubah posisi duduk. "
            },
            {
                "number": 508,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ حَدَّثَنَا مِسْعَرٌ عَنْ ثَابِتِ بْنِ عُبَيْدٍ عَنْ عُبَيْدِ بْنِ الْبَرَاءِ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَكُنَّا إِذَا صَلَّيْنَا خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْبَبْنَا أَنْ نَكُونَ عَنْ يَمِينِهِ فَيُقْبِلُ عَلَيْنَا بِوَجْهِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abu Ahmad Az-Zubairi] telah menceritakan kepada kami [Mis'ar] dari [Tsabit bin Ubaid] dari [Ubaid bin Al Barra'] dari [Al-Bara` bin 'Azib] dia berkata; Kami apabila mengerjakan sholat di belakang Rasulullah shallallahu 'alaihi wasallam, kami suka berada di sebelah kanan beliau, karena beliau menghadap kepada kami dengan wajahnya shallallahu 'alaihi wasallam (setelah salam). "
            },
            {
                "number": 509,
                "arab": "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الْمَلِكِ الْقُرَشِيُّ حَدَّثَنَا عَطَاءٌ الْخُرَاسَانِيُّ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُصَلِّ الْإِمَامُ فِي الْمَوْضِعِ الَّذِي صَلَّى فِيهِ حَتَّى يَتَحَوَّلَقَالَ أَبُو دَاوُد عَطَاءٌ الْخُرَاسَانِيُّ لَمْ يُدْرِكْ الْمُغِيرَةَ بْنَ شُعْبَةَ",
                "id": "Telah menceritakan kepada kami [Abu Taubah, Ar-Rabi' bin Nafi'] telah menceritakan kepada kami [Abdul Aziz bin Abdul Malik Al-Qurasyi] telah menceritakan kepada kami ['Atha` Al-Khurasani] dari [Mughirah bin Syu'bah] dia berkata; Rasulullah Shallallahu alaihi wasallam bersabda: \"Jangan seorang imam sholat di tempat yang semula dipergunakannya untuk sholat wajib, hingga dia bergeser.\" Abu Dawud berkata; 'Atha` Al-Khurasani tidak bertemu dengan Al Mughirah bin Syu'bah. "
            },
            {
                "number": 510,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زِيَادِ بْنِ أَنْعُمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ وَبَكْرِ بْنِ سَوَادَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَضَى الْإِمَامُ الصَّلَاةَ وَقَعَدَ فَأَحْدَثَ قَبْلَ أَنْ يَتَكَلَّمَ فَقَدْ تَمَّتْ صَلَاتُهُ وَمَنْ كَانَ خَلْفَهُ مِمَّنْ أَتَمَّ الصَّلَاةَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Abdurrahman bin Ziyad bin An'um] dari [Abdurrahman bin Rafi'] dan [Bakr bin Sawadah] dari [Abdurrahman bin Amru] bahwasanya Rasulullah Shallallahu alaihi wasallam bersabda: \"Apabila seorang imam telah selesai melaksanakan sholat, lalu duduk sejenak lalu batal wudhunya sebelum dia berbicara, maka sholatnya sudah sempurna walaupun di belakangnya masih ada orang yang belum selesai melaksanakanya.\""
            },
            {
                "number": 511,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ ابْنِ عَقِيلٍ عَنْ مُحَمَّدِ ابْنِ الْحَنَفِيَّةِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِفْتَاحُ الصَّلَاةِ الطُّهُورُ وَتَحْرِيمُهَا التَّكْبِيرُ وَتَحْلِيلُهَا التَّسْلِيمُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abi Syaibah] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Ibnu 'Aqil] dari [Muhammad bin Al-Hanafiyyah] dari [Ali radliallahu 'anhu] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kunci sholat adalah bersuci, sedangkan yang mengharamkan (segala aktivitas di luar sholat) adalah takbir, dan yang menghalalkannya kembali adalah salam.\""
            },
            {
                "number": 512,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ابْنِ عَجْلَانَ حَدَّثَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ حَبَّانَ عَنْ ابْنِ مُحَيْرِيزٍ عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُبَادِرُونِي بِرُكُوعٍ وَلَا بِسُجُودٍ فَإِنَّهُ مَهْمَا أَسْبِقْكُمْ بِهِ إِذَا رَكَعْتُ تُدْرِكُونِي بِهِ إِذَا رَفَعْتُ إِنِّي قَدْ بَدَّنْتُ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Ibnu 'Ajlan] telah menceritakan kepadaku [Muhammad bin Yahya bin Habban] dari [Ibnu Muhairiz] dari [Mu'awiyah bin Abi Sufyan] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mendahuluiku dengan ruku' dan sujud, karena meskipun saya mendahului kalian tatkala ruku', niscaya kalian akan mendapatkanku tatkala saya mengangkat kepalaku (i'tidal), karena saya telah berumur dan badanku berat.\""
            },
            {
                "number": 513,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ الْخَطْمِيَّ يَخْطُبُ النَّاسَ قَالَ حَدَّثَنَا الْبَرَاءُ وَهُوَ غَيْرُ كَذُوبٍأَنَّهُمْ كَانُوا إِذَا رَفَعُوا رُءُوسَهُمْ مِنْ الرُّكُوعِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامُوا قِيَامًا فَإِذَا رَأَوْهُ قَدْ سَجَدَ سَجَدُوا",
                "id": "Telah menceritakan kepada kami [Hafs bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] mengatakan, aku mendengar ['Abdullah bin Yazid Alkhatmi] berpidato didepan orang-orang dengan mengatakan, Telah menceritakan kepada kami [Al Barra'] yang dia bukan pendusta,: \"Jika para sahabat mengangkat kepala mereka dari ruku' bersama Rasulullah Shallallahu'alaihiwasallam, mereka berdiri hingga betul-betul telah berdiri, dan jika telah mereka lihat beliau sujud, mereka bersujud.\""
            },
            {
                "number": 514,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَهَارُونُ بْنُ مَعْرُوفٍ الْمَعْنَى قَالَا حَدَّثَنَا سُفْيَانُ عَنْ أَبَانَ بْنِ تَغْلِبَ قَالَ زُهَيْرٌ حَدَّثَنَا الْكُوفِيُّونَ أَبَانُ وَغَيْرُهُ عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ قَالَكُنَّا نُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَا يَحْنُو أَحَدٌ مِنَّا ظَهْرَهُ حَتَّى يَرَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضَعُ",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Harun bin Ma'ruf] secara makna, mereka berdua berkata; Telah menceritakan kepada kami [Sufyan] dari [Aban bin Taghlab], berkata [Zuhair]; Telah menceritakan kepada kami Al-Kufiyyun [Aban dan selainnya], dari [Al-Hakam] dari [Abdurrahman bin Abi Laila] dari [Al-Bara`] dia berkata; Kami sholat bersama Nabi shallallahu 'alaihi wasallam, maka tidak ada seorang pun dari kami yang ruku' sampai melihat Nabi shallallahu 'alaihi wasallam ruku'."
            },
            {
                "number": 515,
                "arab": "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا أَبُو إِسْحَقَ يَعْنِي الْفَزَارِيَّ عَنْ أَبِي إِسْحَقَ عَنْ مُحَارِبِ بْنِ دِثَارٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ يَزِيدَ يَقُولُ عَلَى الْمِنْبَرِ حَدَّثَنِي الْبَرَاءُأَنَّهُمْ كَانُوا يُصَلُّونَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا رَكَعَ رَكَعُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ لَمْ نَزَلْ قِيَامًا حَتَّى يَرَوْهُ قَدْ وَضَعَ جَبْهَتَهُ بِالْأَرْضِ ثُمَّ يَتَّبِعُونَهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ar-Rabi' bin Nafi'] telah menceritakan kepada kami [Abu Ishaq Al-Fazari] dari [Abu Ishaq] dari [Muharib bin Ditsar] dia berkata; Saya pernah mendengar [Abdullah bin Yazid] berkhubtah di atas mimbar, dia berkata; Telah menceritakan kepadaku [Al-Bara`]; bahwasanya mereka (para sahabat) sholat bersama Rasulullah shallallahu 'alaihi wasallam, apabila beliau ruku', mereka pun ruku', dan apabila beliau mengucapkan: Sami'allau liman hamidah (tatkala I'tidal), mereka pun berdiri dan tetap demikian hingga mereka melihat beliau meletakkan keningnya di tanah (sujud) kemudian mereka pun mengikuti beliau shallallahu 'alaihi wasallam. "
            },
            {
                "number": 516,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَا يَخْشَى أَوْ أَلَا يَخْشَى أَحَدُكُمْ إِذَا رَفَعَ رَأْسَهُ وَالْإِمَامُ سَاجِدٌ أَنْ يُحَوِّلَ اللَّهُ رَأْسَهُ رَأْسَ حِمَارٍ أَوْ صُورَتَهُ صُورَةَ حِمَارٍ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin Ziyad] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidakkah takut seseorang di antara kalian apabila mengangkat kepalanya, sementara imamnya masih sersujud, Allah akan merubah kepalanya menjadi kepala keledai atau rupanya menjadi rupa keledai?\""
            },
            {
                "number": 517,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا حَفْصُ بْنُ بُغَيْلٍ الْمُرْهِبِيُّ حَدَّثَنَا زَائِدَةُ عَنْ الْمُخْتَارِ بْنِ فُلْفُلٍ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَضَّهُمْ عَلَى الصَّلَاةِ وَنَهَاهُمْ أَنْ يَنْصَرِفُوا قَبْلَ انْصِرَافِهِ مِنْ الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al-'Ala`] telah menceritakan kepada kami [Hafsh bin Bughail Al-Murhibi] telah menceritakan kepada kami [Za`idah] dari [Al-Mukhtar bin Fulful] dari [Anas] bahwasanya Nabi shallallahu 'alaihi wasallam memotivasi mereka untuk mengerjakan sholat (berjamaah) dan melarang mereka pergi (meninggalkan tempat) sebelum imam pergi. "
            },
            {
                "number": 518,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الصَّلَاةِ فِي ثَوْبٍ وَاحِدٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَلِكُلِّكُمْ ثَوْبَانِ",
                "id": "Telah menceritakan kepada kami [Al-Qa'nabi'] dari [Malik] dari [Ibnu Syihab] dari [Sa'id bin Al-Musayyib] dari [Abu Hurairah] bahwasanya Rasulullah shallallahu 'alaihi wasallam pernah ditanya tentang sholat dengan memakai sehelai kain, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Apakah setiap kalian memiliki dua kain (pakain luar dan pakaian dalam)?\""
            },
            {
                "number": 519,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُصَلِّ أَحَدُكُمْ فِي الثَّوْبِ الْوَاحِدِ لَيْسَ عَلَى مَنْكِبَيْهِ مِنْهُ شَيْءٌ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Sufyan] dari [Abu Az-Zinad] dari [Al-A'raj] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang di antara kalian mengerjakan sholat dengan hanya memakai sehelai kain, sedang tidak ada sesuatu yang menutupi bagian atas kedua pundaknya.\""
            },
            {
                "number": 520,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا إِسْمَعِيلُ الْمَعْنَى عَنْ هِشَامِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عِكْرِمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى أَحَدُكُمْ فِي ثَوْبٍ فَلْيُخَالِفْ بِطَرَفَيْهِ عَلَى عَاتِقَيْهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] -dari jalur lain- Dan telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Isma'il] secara makna, dari [Hisyam bin Abi Abdullah] dari [Yahya bin Abi Katsir] dari [Ikrimah] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian mengerjakan sholat dengan memakai sehelai kain, maka silangkanlah kedua ujungnya pada kedua pundaknya.\""
            },
            {
                "number": 521,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي ثَوْبٍ وَاحِدٍ مُلْتَحِفًا مُخَالِفًا بَيْنَ طَرَفَيْهِ عَلَى مَنْكِبَيْهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al-Laits] dari [Yahya bin Sa'id] dari [Abu Umamah bin Sahl] dari [Umar bin Abu Salamah] dia berkata; Saya pernah melihat Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat memakai sehelai kain dengan cara berselimut. Beliau silangkan kedua ujungnya di atas kedua pundak beliau.\""
            },
            {
                "number": 522,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا مُلَازِمُ بْنُ عَمْرٍو الْحَنَفِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَدْرٍ عَنْ قَيْسِ بْنِ طَلْقٍ عَنْ أَبِيهِ قَالَقَدِمْنَا عَلَى نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَ رَجُلٌ فَقَالَ يَا نَبِيَّ اللَّهِ مَا تَرَى فِي الصَّلَاةِ فِي الثَّوْبِ الْوَاحِدِ قَالَ فَأَطْلَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِزَارَهُ طَارَقَ بِهِ رِدَاءَهُ فَاشْتَمَلَ بِهِمَا ثُمَّ قَامَ فَصَلَّى بِنَا نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا أَنْ قَضَى الصَّلَاةَ قَالَ أَوَكُلُّكُمْ يَجِدُ ثَوْبَيْنِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Mulazim bin Amru Al-Hanafi] telah menceritakan kepada kami [Abdullah bin Badr] dari [Qais bin Thalq] dari [Ayahnya] dia berkata; Kami pernah datang kepada Nabi shallallahu 'alaihi wasallam, lalu datang seorang laki laki seraya berkata; Wahai Nabi Allah, bagaimana pendapat Anda tentang sholat dengan memakai sehelai kain? Katanya; Rasulullah shallallahu 'alaihi wasallam lalu melepaskan kain selimut beliau kemudian dipergunakannya untuk berselimut, lalu Nabi shallallahu 'alaihi wasallam berdiri mengerjakan sholat bersama kami, setelah mengerjakan sholat, beliau bersabda: \"Apakah setiap kalian mempunyai dua pakaian?\""
            },
            {
                "number": 523,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ قَالَلَقَدْ رَأَيْتُ الرِّجَالَ عَاقِدِي أُزُرِهِمْ فِي أَعْنَاقِهِمْ مِنْ ضِيقِ الْأُزُرِ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّلَاةِ كَأَمْثَالِ الصِّبْيَانِ فَقَالَ قَائِلٌ يَا مَعْشَرَ النِّسَاءِ لَا تَرْفَعْنَ رُءُوسَكُنَّ حَتَّى يَرْفَعَ الرِّجَالُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al-Anbari] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abu Hazim] dari [Sahl bin Sa'd] dia berkata; Sungguh saya melihat kaum lelaki yang mengikat kain selimutnya di leher mereka karena sempit sedang mengerjakan sholat di belakang Rasulullah shallallahu 'alaihi wasallam seperti anak kecil. Lalu ada seseorang berkata; Wahai kaum wanita, janganlah kalian mengangkat kepala sehingga kaum pria (terlebih dahulu) mengangkat kepala.. "
            },
            {
                "number": 524,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا زَائِدَةُ عَنْ أَبِي حُصَيْنٍ عَنْ أَبِي صَالِحٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي ثَوْبٍ وَاحِدٍ بَعْضُهُ عَلَيَّ",
                "id": "Telah menceritakan kepada kami [Abul Walid Ath-Thayalisi] telah menceritakan kepada kami [Za`idah] dari [Abu Hushain] dari [Abu Shalih] dari [Aisyah radliallahu 'anha] bahwasanya Nabi shallallahu 'alaihi wasallam pernah mengerjakan sholat dengan memakai sehelai kain, sementara sebagiannya mengenaiku. "
            },
            {
                "number": 525,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ مُوسَى بْنِ إِبْرَاهِيمَ عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ أَصِيدُ أَفَأُصَلِّي فِي الْقَمِيصِ الْوَاحِدِ قَالَ نَعَمْ وَازْرُرْهُ وَلَوْ بِشَوْكَةٍ",
                "id": "Telah menceritakan kepada kami [Al-Qa'nabi'] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Musa bin Ibrahim] dari [Salamah bin Al-Akwa'] dia berkata; Saya pernah bertanya; Ya Rasulullah, saya sedang berburu, apakah saya boleh sholat dengan menggunakan sehelai baju? Beliau menjawab: \"Ya, dan ikatlah dia walau hanya dengan duri.\""
            },
            {
                "number": 526,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ عَنْ إِسْرَائِيلَ عَنْ أَبِي حَوْمَلٍ الْعَامِرِيِّ قَالَ أَبُو دَاوُد كَذَا قَالَ وَالصَّوَابُ أَبُو حَرْمَلٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ عَنْ أَبِيهِ قَالَأَمَّنَا جَابِرُ بْنُ عَبْدِ اللَّهِ فِي قَمِيصٍ لَيْسَ عَلَيْهِ رِدَاءٌ فَلَمَّا انْصَرَفَ قَالَ إِنِّي رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي قَمِيصٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Hatim bin Bazi'] telah menceritakan kepada kami [Yahya bin Abi Bukair] dari [Isra`il] dari [Abu Haumal Al-'Amiri], Abu Dawud berkata; demikian dia mengatakan, sedangkan yang benar adalah Abu Harmal dari [Muhammad bin Abdurrahman bin Abu Bakar] dari [Ayahnya] dia berkata; [Jabir bin Abdullah] pernah mengimami kami dengan mengenakan baju yang tidak berselendang. Tatkala selesai, dia berkata; Saya pernah melihat Rasulullah shallallahu 'alaihi wasallam sholat dengan mengenakan baju. "
            },
            {
                "number": 527,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ وَسُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ الدِّمَشْقِيُّ وَيَحْيَى بْنُ الْفَضْلِ السِّجِسْتَانِيُّ قَالُوا حَدَّثَنَا حَاتِمٌ يَعْنِي ابْنَ إِسْمَعِيلَ حَدَّثَنَا يَعْقُوبُ بْنُ مُجَاهِدٍ أَبُو حَزْرَةَ عَنْ عُبَادَةَ بْنِ الْوَلِيدِ بْنِ عُبَادَةَ بْنِ الصَّامِتِ قَالَأَتَيْنَا جَابِرًا يَعْنِي ابْنَ عَبْدِ اللَّهِ قَالَ سِرْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةٍ فَقَامَ يُصَلِّي وَكَانَتْ عَلَيَّ بُرْدَةٌ ذَهَبْتُ أُخَالِفُ بَيْنَ طَرَفَيْهَا فَلَمْ تَبْلُغْ لِي وَكَانَتْ لَهَا ذَبَاذِبُ فَنَكَّسْتُهَا ثُمَّ خَالَفْتُ بَيْنَ طَرَفَيْهَا ثُمَّ تَوَاقَصْتُ عَلَيْهَا لَا تَسْقُطُ ثُمَّ جِئْتُ حَتَّى قُمْتُ عَنْ يَسَارِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخَذَ بِيَدِي فَأَدَارَنِي حَتَّى أَقَامَنِي عَنْ يَمِينِهِ فَجَاءَ ابْنُ صَخْرٍ حَتَّى قَامَ عَنْ يَسَارِهِ فَأَخَذَنَا بِيَدَيْهِ جَمِيعًا حَتَّى أَقَامَنَا خَلْفَهُ قَالَ وَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمُقُنِي وَأَنَا لَا أَشْعُرُ ثُمَّ فَطِنْتُ بِهِ فَأَشَارَ إِلَيَّ أَنْ أَتَّزِرَ بِهَا فَلَمَّا فَرَغَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَا جَابِرُ قَالَ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ قَالَ إِذَا كَانَ وَاسِعًا فَخَالِفْ بَيْنَ طَرَفَيْهِ وَإِذَا كَانَ ضَيِّقًا فَاشْدُدْهُ عَلَى حِقْوِكَ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] dan [Sulaiman bin Abdurrahman Ad-Dimasyqi] dan [Yahya bin Al-Fadll As-Sijistani] mereka berkata; Telah menceritakan kepada kami [Hatim bin Isma'il] telah menceritakan kepada kami [Ya`qub bin Mujahid, Abu Hazrah] dari [Ubadah bin Al-Walid bin Ubadah bin Ash-Shamit] dia berkata; Kami pernah mengunjungi [Jabir bin Abdullah], dia berkata; Saya pernah pergi bersama Nabi shallallahu 'alaihi wasallam dalam suatu peperangan. Lalu beliau berdiri mengerjakan sholat, sementara saya memakai kain selimut yang saya silangkan kedua ujungnya, namun tidak memadai untukku. Kain itu berumbai bagian bawahnya, maka saya membaliknya, lalu saya silangkan kedua ujungnya, kemudian saya apit (dengan leher) supaya tidak jatuh. Lalu saya datang sehingga saya berdiri di sebelah kiri Rasulullah shallallahu 'alaihi wasallam, maka beliau memegang tanganku, dan memindahkanku sehingga saya ditempatkan di sebelah kanan beliau, tiba tiba datang Ibnu Sakhr langsung berdiri di sebelah kiri beliau, maka beliau memegang kami berdua dengan kedua tangannya, sampai beliau menempatkan kami di belakang. Kata Jabir; Rasulullah menatapku, sedangkan saya tidak merasa, akhirnya saya juga dapat memahaminya. Beliau kemudian memberi isyarat kepadaku supaya saya memakai kain tersebut sebagai sarung. Setelah Rasulullah shallallahu 'alaihi wasallam selesai sholat, beliau bersabda: \"Wahai Jabir.\" Kata Jabir; Aku jawab, ya Rasulullah. Beliau bersabda: \"Apabila kain itu longgar, maka silangkanlah kedua ujungnya, dan apabila sempit, ikatlah pada pinggangmu.\""
            },
            {
                "number": 528,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ قَالَ قَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ إِذَا كَانَ لِأَحَدِكُمْ ثَوْبَانِ فَلْيُصَلِّ فِيهِمَا فَإِنْ لَمْ يَكُنْ إِلَّا ثَوْبٌ وَاحِدٌ فَلْيَتَّزِرْ بِهِ وَلَا يَشْتَمِلْ اشْتِمَالَ الْيَهُودِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda, atau Ibnu Umar berkata; Umar radliallahu 'anhu berkata; \"Apabila salah seorang di antara kalian mempunyai dua kain pakaian, maka sholatlah dengan keduanya. Apabila dia mempunyai sehelai kain pakaian saja, hendaklah dia mengenakannya seperti kain sarung dan janganlah dia berselubung seperti orang-orang yahudi.\""
            },
            {
                "number": 529,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ الذُّهْلِيُّ حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو تُمَيْلَةَ يَحْيَى بْنُ وَاضِحٍ حَدَّثَنَا أَبُو الْمُنِيبِ عُبَيْدُ اللَّهِ الْعَتَكِيُّ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُصَلِّيَ فِي لِحَافٍ لَا يَتَوَشَّحُ بِهِ وَالْآخَرُ أَنْ تُصَلِّيَ فِي سَرَاوِيلَ وَلَيْسَ عَلَيْكَ رِدَاءٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris Adz-Dzuhli] telah menceritakan kepada kami [Sa'id bin Muhammad] telah menceritakan kepada kami [Abu Tumailah, Yahya bin Wadlih] telah menceritakan kepada kami [Abu Al-Munib, ubaidhullah Al-'Ataki] dari [Abdullah bin Buraidah] dari [Ayahnya] dia berkata; Rasulullah Shallallahu alaihi wasallam melarang seseorang sholat dengan menggunakan selimut yang tidak ada pengikatnya untuk pundak, dan beliau juga melarang seseorang yang lain yang sholat menggunakan celana tanpa melapisi badannya dengan selendang. "
            },
            {
                "number": 530,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ حَدَّثَنَا أَبُو دَاوُدَ عَنْ أَبِي عَوَانَةَ عَنْ عَاصِمٍ عَنْ أَبِي عُثْمَانَ عَنْ ابْنِ مَسْعُودٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَسْبَلَ إِزَارَهُ فِي صَلَاتِهِ خُيَلَاءَ فَلَيْسَ مِنْ اللَّهِ فِي حِلٍّ وَلَا حَرَامٍقَالَ أَبُو دَاوُد رَوَى هَذَا جَمَاعَةٌ عَنْ عَاصِمٍ مَوْقُوفًا عَلَى ابْنِ مَسْعُودٍ مِنْهُمْ حَمَّادُ بْنُ سَلَمَةَ وَحَمَّادُ بْنُ زَيْدٍ وَأَبُو الْأَحْوَصِ وَأَبُو مُعَاوِيَةَ",
                "id": "Telah menceritakan kepada kami [Zaid bin Akhzam] telah menceritakan kepada kami [Abu Dawud] dari [Abu 'Awanah] dari ['Ashim] dari [Abu Utsman] dari [Ibnu Mas'ud] dia berkata; Saya mendengar Rasulullah Shallallahu alaihi wasallam bersabda; \"Barangsiapa yang isbal (memanjangkan) pakaiannya (hingga melewati mata kaki) dalam sholat karena sombong, maka Allah tidak menghalalkan baginya surga dan tidak mengharamkan neraka untuknya.\" Abu Dawud berkata; Hadits ini diriwayatkan oleh Jama'ah dari ['Ashim] mauquf terhadap [Ibnu Mas'ud], di antara mereka adalah [Hammad bin Salamah] dan [Hammad bin Zaid] dan [Abul Ahwash] dan [Abu Mu'awiyah]. "
            },
            {
                "number": 531,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ حَدَّثَنَا يَحْيَى عَنْ أَبِي جَعْفَرٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ قَالَبَيْنَمَا رَجُلٌ يُصَلِّي مُسْبِلًا إِزَارَهُ إِذْ قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اذْهَبْ فَتَوَضَّأْ فَذَهَبَ فَتَوَضَّأَ ثُمَّ جَاءَ ثُمَّ قَالَ اذْهَبْ فَتَوَضَّأْ فَذَهَبَ فَتَوَضَّأَ ثُمَّ جَاءَ فَقَالَ لَهُ رَجُلٌ يَا رَسُولَ اللَّهِ مَا لَكَ أَمَرْتَهُ أَنْ يَتَوَضَّأَ ثُمَّ سَكَتَّ عَنْهُ فَقَالَ إِنَّهُ كَانَ يُصَلِّي وَهُوَ مُسْبِلٌ إِزَارَهُ وَإِنَّ اللَّهَ تَعَالَى لَا يَقْبَلُ صَلَاةَ رَجُلٍ مُسْبِلٍ إِزَارَهُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Aban] telah menceritakan kepada kami [Yahya] dari [Abi Ja'far] dari ['Atha` bin Yasar] dari [Abu Hurairah] dia berkata; Ketika ada seseorang melaksanakan sholat dengan memanjangkan pakaiannya (hingga melewati mata kaki), Rasulullah Shallallahu alaihi wasallam bersabda kepadanya: \"Pergilah dan ulangi wudlumu!\" Maka orang tersebut pergi dan berwudlu lagi, kemudian datang lagi, lalu beliau bersabda lagi kepadanya: \"Pergilah dan ulangi wudlumu!\" Maka dia pergi lagi dan mengulangi wudlunya lalu kembali, dan ada seseorang berkata; Ya Rasulullah, kenapa engkau memerintahkannya untuk berwudlu lagi kemudian engkau mendiamkannya? Beliau bersabda; \"Sesungguhnya orang tersebut sholat dengan memanjangkan pakaiannya (melewati mata kaki), dan sesungguhnya Allah Ta'ala tidak menerima sholat seseorang yang memanjangkan pakaiannya (hingga melewati mata kaki).\""
            },
            {
                "number": 532,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ مُحَمَّدِ بْنِ زَيْدِ بْنِ قُنْفُذٍ عَنْ أُمِّهِ أَنَّهَا سَأَلَتْ أُمَّ سَلَمَةَمَاذَا تُصَلِّي فِيهِ الْمَرْأَةُ مِنْ الثِّيَابِ فَقَالَتْ تُصَلِّي فِي الْخِمَارِ وَالدِّرْعِ السَّابِغِ الَّذِي يُغَيِّبُ ظُهُورَ قَدَمَيْهَا",
                "id": "Telah menceritakan kepada kami [Al-Qa'nabi'] dari [Malik] dari [Muhammad bin Zaid bin Qunfudz] dari [Ibunya] bahwasanya dia pernah bertanya kepada [Ummu Salamah]; Pakaian apakah yang boleh digunakan wanita untuk sholat? Dia menjawab; Wanita sholat dengan menggunakan jilbab yang panjang dan gamis yang menutupi telapak kakinya. "
            },
            {
                "number": 533,
                "arab": "حَدَّثَنَا مُجَاهِدُ بْنُ مُوسَى حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ يَعْنِي ابْنَ دِينَارٍ عَنْ مُحَمَّدِ بْنِ زَيْدٍ بِهَذَا الْحَدِيثِ قَالَ عَنْ أُمِّ سَلَمَةَأَنَّهَا سَأَلَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتُصَلِّي الْمَرْأَةُ فِي دِرْعٍ وَخِمَارٍ لَيْسَ عَلَيْهَا إِزَارٌ قَالَ إِذَا كَانَ الدِّرْعُ سَابِغًا يُغَطِّي ظُهُورَ قَدَمَيْهَاقَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ مَالِكُ بْنُ أَنَسٍ وَبَكْرُ بْنُ مُضَرَ وَحَفْصُ بْنُ غِيَاثٍ وَإِسْمَعِيلُ بْنُ جَعْفَرٍ وَابْنُ أَبِي ذِئْبٍ وَابْنُ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ زَيْدٍ عَنْ أُمِّهِ عَنْ أُمِّ سَلَمَةَ لَمْ يَذْكُرْ أَحَدٌ مِنْهُمْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَصَرُوا بِهِ عَلَى أُمِّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَا",
                "id": "Telah menceritakan kepada kami [Mujahid bin Musa] telah menceritakan kepada kami [Utsman bin Umar] telah menceritakan kepada kami [Abdurrahman bin Abdullah bin Dinar] dari [Muhammad bin Zaid] dengan hadits ini, dia berkata dari [Ummu Salamah] bahwasanya dia pernah bertanya kepada Nabi shallallahu 'alaihi wasallam; Bolehkah wanita sholat memakai gamis dan jilbab tanpa memakai kain sarung? Beliau menjawab: \"Boleh apabila gamisnya itu longgar yang dapat menutupi punggung kakinya. Abu Dawud berkata; Hadits ini telah diriwayatkan oleh [Malik bin Anas] dan [Bakr bin Mudlar] dan [Hafzh bin Ghiyats] dan [Isma'il bin Ja'far] dan [Ibnu Abi Dzi`b] dan [Ibnu Ishaq] dari [Muhammad bin Zaid] dari [Ibunya] dari [Ummu Salamah], salah satu dari mereka tidak menyebutkan Nabi shallallahu 'alaihi wasallam, mereka hanya menyebutkan Ummu Salamah radliallahu 'anha."
            },
            {
                "number": 534,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا حَمَّادٌ عَنْ قَتَادَةَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ صَفِيَّةَ بِنْتِ الْحَارِثِ عَنْ عَائِشَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا يَقْبَلُ اللَّهُ صَلَاةَ حَائِضٍ إِلَّا بِخِمَارٍقَالَ أَبُو دَاوُد رَوَاهُ سَعِيدٌ يَعْنِي ابْنَ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al-Mutsanna] telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammad] dari [Qatadah] dari [Muhammad bin Sirin] dari [Shafiyyah binti Al-Harits] dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam, bahwasanya beliau bersabda: \"Allah tidak menerima sholat wanita yang sudah haid (baligh), kecuali dengan memakai tutup kepala.\" Abu Dawud berkata; Diriwayatkan oleh [Sa'id bin Abi 'Arubah] dari [Qatadah] dari [Al-Hasan] dari Nabi shallallahu 'alaihi wasallam. "
            },
            {
                "number": 535,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ أَنَّ عَائِشَةَنَزَلَتْ عَلَى صَفِيَّةَ أُمِّ طَلْحَةَ الطَّلَحَاتِ فَرَأَتْ بَنَاتٍ لَهَا فَقَالَتْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ وَفِي حُجْرَتِي جَارِيَةٌ فَأَلْقَى لِي حَقْوَهُ وَقَالَ لِي شُقِّيهِ بِشُقَّتَيْنِ فَأَعْطِي هَذِهِ نِصْفًا وَالْفَتَاةَ الَّتِي عِنْدَ أُمِّ سَلَمَةَ نِصْفًا فَإِنِّي لَا أَرَاهَا إِلَّا قَدْ حَاضَتْ أَوْ لَا أُرَاهُمَا إِلَّا قَدْ حَاضَتَاقَالَ أَبُو دَاوُد وَكَذَلِكَ رَوَاهُ هِشَامٌ عَنْ ابْنِ سِيرِينَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Muhammad] bahwasanya [Aisyah] singgah di rumah Shafiyyah, Ummu Thalhah Ath-Thalahat lalu dia meliaht putri-putrinya, maka dia berkata; Sesungguhnya Rasulullah shallallahu 'alaihi wasallam pernah masuk, sedangkan di kamarku ada seorang gadis kecil. Maka beliau memberikan kain penutup badan kepadaku dan bersabda: \"Robeklah menjadi dua bagian, kemudian berilah setengahnya untuk gadis ini dan setengah lagi untuk gadis yang berada di Ummu Salamah, karena sesungguhnya saya memandangnya telah baligh, atau beliau bersabda: Saya tidak memandang keduanya kecuali telah baligh. Abu Dawud berkata; Dan demikian pula diriwayatkan oleh [Hisyam] dari [Ibnu Sirin]."
            },
            {
                "number": 536,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَإِبْرَاهِيمُ بْنُ مُوسَى عَنْ ابْنِ الْمُبَارَكِ عَنْ الْحَسَنِ بْنِ ذَكْوَانَ عَنْ سُلَيْمَانَ الْأَحْوَلِ عَنْ عَطَاءٍ قَالَ إِبْرَاهِيمُ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ السَّدْلِ فِي الصَّلَاةِ وَأَنْ يُغَطِّيَ الرَّجُلُ فَاهُقَالَ أَبُو دَاوُد رَوَاهُ عِسْلٌ عَنْ عَطَاءٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ السَّدْلِ فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al-'Ala`] dan [Ibrahim bin Musa] dari [Ibnu Al-Mubarak] dari [Al-Hasan bin Dzakwan] dari [Sulaiman Al-Ahwal] dari ['Atha`] berkata Ibrahim dari [Abu Hurairah] bahwasanya Rasulullah shallallahu 'alaihi wasallam melarang menjulurkan pakaian dalam sholat dan melarang seseorang menutupi mulutnya (dengan kain). Abu Dawud berkata; Diriwayatkan oleh ['isl] dari ['Atha`] dari [Abu Hurairah] bahwasanya Nabi shallallahu 'alaihi wasallam melarang menjulurkan pakaian ketika sholat. "
            },
            {
                "number": 537,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى بْنِ الطَّبَّاعِ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَأَكْثَرُ مَا رَأَيْتُ عَطَاءً يُصَلِّي سَادِلًاقَالَ أَبُو دَاوُد وَهَذَا يُضَعِّفُ ذَلِكَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa bin Ath-Thabba'] telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] dia berkata; Sering saya melihat ['Atha`] sholat dengan menjulurkan pakaian. Abu Dawud berkata: Hadits ini melemahkan hadits sebelumnya. "
            },
            {
                "number": 538,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَشْعَثُ عَنْ مُحَمَّدٍ يَعْنِي ابْنَ سِيرِينَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُصَلِّي فِي شُعُرِنَا أَوْ لُحُفِنَا قَالَ عُبَيْدُ اللَّهِ شَكَّ أَبِي",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Mu'adz] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al-Asy'ats] dari [Muhammad bin Sirin] dari [Abdullah bin Syaqiq] dari [Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam tidak biasa mengerjakan sholat dengan memakai pakaian atau selimut kami. ubaidhullah berkata; Ayahku ragu-ragu. "
            },
            {
                "number": 539,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ ابْنِ جُرَيْجٍ حَدَّثَنِي عِمْرَانُ بْنُ مُوسَى عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ يُحَدِّثُ عَنْ أَبِيهِأَنَّهُ رَأَى أَبَا رَافِعٍ مَوْلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِحَسَنِ بْنِ عَلِيٍّ عَلَيْهِمَا السَّلَام وَهُوَ يُصَلِّي قَائِمًا وَقَدْ غَرَزَ ضَفْرَهُ فِي قَفَاهُ فَحَلَّهَا أَبُو رَافِعٍ فَالْتَفَتَ حَسَنٌ إِلَيْهِ مُغْضَبًا فَقَالَ أَبُو رَافِعٍ أَقْبِلْ عَلَى صَلَاتِكَ وَلَا تَغْضَبْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ذَلِكَ كِفْلُ الشَّيْطَانِ يَعْنِي مَقْعَدَ الشَّيْطَانِ يَعْنِي مَغْرَزَ ضَفْرِهِ",
                "id": "Telah menceritakan kepada kami [Al-Hasan bin Ali] telah menceritakan kepada kami [Abdur Razzaq] dari [Ibnu Juraij] telah menceritakan kepadaku ['Imran bin Musa] dari [Sa'id bin Abi Sa'id Al-Maqburi] dia menceritakan dari [Ayahnya] bahwasanya dia pernah melihat Abu Rafi', mantan sahaya Nabi shallallahu 'alaihi wasallam bertemu dengan Hasan bin Ali radliallahu 'anhuma yang sedang sholat dalam keadaan berdiri dengan menyanggulkan rambutnya pada tengkuknya. Abu Rafi' melepasnya, sehingga Hasan menoleh kepadanya dengan marah, lalu [Abu Rafi'] berkata; Perhatikan sholatmu dan jangan marah, karena sesungguhnya saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Itu adalah tempat duduk syetan.\""
            },
            {
                "number": 540,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ أَنَّ بُكَيْرًا حَدَّثَهُ أَنَّ كُرَيْبًا مَوْلَى ابْنِ عَبَّاسٍ حَدَّثَهُأَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ رَأَى عَبْدَ اللَّهِ بْنَ الْحَارِثِ يُصَلِّي وَرَأْسُهُ مَعْقُوصٌ مِنْ وَرَائِهِ فَقَامَ وَرَاءَهُ فَجَعَلَ يَحُلُّهُ وَأَقَرَّ لَهُ الْآخَرُ فَلَمَّا انْصَرَفَ أَقْبَلَ إِلَى ابْنِ عَبَّاسٍ فَقَالَ مَا لَكَ وَرَأْسِي قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّمَا مَثَلُ هَذَا مَثَلُ الَّذِي يُصَلِّي وَهُوَ مَكْتُوفٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Salamah] telah menceritakan kepada kami [Ibnu Wahb] dari [Amru bin Al-Harits] bahwasanya [Bukair] menceritakan kepadanya bahwa [Kuraib, mantan sahaya Ibnu Abbas] telah menceritakan kepadanya bahwasanya [Abdullah bin Abbas] pernah melihat Abdullah bin Al-Harits sedang mengerjakan sholat, sementara rambutnya disanggul. Maka Abdullah bin Abbas berdiri di belakangnya, lalu melepasnya, namun Abdullah bin Al-Harits diam saja tidak bergerak. Setelah selesai sholat, dia menghampiri Ibnu Abbas dan berkata; Ada apa denganmu dan rambutku? Ibnu Abbas menjawab; Saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya penampilan seperti ini laksana orang yang mengerjakan sholat, sementara kedua tangannya diikat kebelakang pundaknya.\""
            },
            {
                "number": 541,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ حَدَّثَنِي مُحَمَّدُ بْنُ عَبَّادِ بْنِ جَعْفَرٍ عَنْ ابْنِ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي يَوْمَ الْفَتْحِ وَوَضَعَ نَعْلَيْهِ عَنْ يَسَارِهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij] telah menceritakan kepadaku [Muhammad bin Abbad bin Ja'far] dari [Ibnu Sufyan] dari [Abdullah bin As-Sa`ib] dia berkata; Saya melihat Nabi shallallahu 'alaihi wasallam sedang melaksanakan sholat pada hari Fathu Makkah, sementara kedua sandalnya diletakkan di sisi kirinya. "
            },
            {
                "number": 542,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ وَأَبُو عَاصِمٍ قَالَا أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ عَبَّادِ بْنِ جَعْفَرٍ يَقُولُ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ سُفْيَانَ وَعَبْدُ اللَّهِ بْنُ الْمُسَيِّبِ الْعَابِدِيُّ وَعَبْدُ اللَّهِ بْنُ عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصُّبْحَ بِمَكَّةَ فَاسْتَفْتَحَ سُورَةَ الْمُؤْمِنِينَ حَتَّى إِذَا جَاءَ ذِكْرُ مُوسَى وَهَارُونَ أَوْ ذِكْرُ مُوسَى وَعِيسَى ابْنُ عَبَّادٍ يَشُكُّ أَوْ اخْتَلَفُوا أَخَذَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَعْلَةٌ فَحَذَفَ فَرَكَعَ وَعَبْدُ اللَّهِ بْنُ السَّائِبِ حَاضِرٌ لِذَلِكَ",
                "id": "Telah menceritakan kepada kami [Al-Hasan bin Ali] telah menceritakan kepada kami [Abdur Razzaq] dan [Abu 'Ashim] mereka berdua berkata; Telah mengabarkan kepada kami [Ibnu Juraij] dia berkata; Saya telah mendengar [Muhammad bin 'Abbad bin Ja'far] berkata; Telah mengabarkan kepadaku [Abu Salamah bin Sufyan] dan [Abdullah bin Al-Musayyib Al-'Abidi] dan [Abdullah bin Amru] dari [Abdullah bin As-Sa`ib] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan sholat Shubuh bersama kami di Makkah. Beliau membaca surat Al-Muminuun, ketika beliau sampai pada ayat tentang cerita Musa dan Harun, atau cerita tentang Musa dan Isa, -Ibnu Abbad ragu-ragu atau mereka berselisih pendapat-, Rasulullah shallallahu 'alaihi wasallam mengalami batuk batuk, lalu beliau berhenti membaca, kemudian ruku', dan Abdullah bin As-Sa`ib turut hadir ketika kejadian itu. "
            },
            {
                "number": 543,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي نَعَامَةَ السَّعْدِيِّ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَبَيْنَمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِأَصْحَابِهِ إِذْ خَلَعَ نَعْلَيْهِ فَوَضَعَهُمَا عَنْ يَسَارِهِ فَلَمَّا رَأَى ذَلِكَ الْقَوْمُ أَلْقَوْا نِعَالَهُمْ فَلَمَّا قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاتَهُ قَالَ مَا حَمَلَكُمْ عَلَى إِلْقَاءِ نِعَالِكُمْ قَالُوا رَأَيْنَاكَ أَلْقَيْتَ نَعْلَيْكَ فَأَلْقَيْنَا نِعَالَنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ جِبْرِيلَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَانِي فَأَخْبَرَنِي أَنَّ فِيهِمَا قَذَرًا أَوْ قَالَ أَذًى وَقَالَ إِذَا جَاءَ أَحَدُكُمْ إِلَى الْمَسْجِدِ فَلْيَنْظُرْ فَإِنْ رَأَى فِي نَعْلَيْهِ قَذَرًا أَوْ أَذًى فَلْيَمْسَحْهُ وَلْيُصَلِّ فِيهِمَاحَدَّثَنَا مُوسَى يَعْنِي ابْنَ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ حَدَّثَنَا قَتَادَةُ حَدَّثَنِي بَكْرُ بْنُ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا قَالَ فِيهِمَا خَبَثٌ قَالَ فِي الْمَوْضِعَيْنِ خَبَثٌ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad bin Salamah] dari [Abu Na'amah As-Sa'di] dari [Abu Nadlrah] dari [Abu Sa'id Al-Khudri] dia berkata; Tatkala Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat bersama para sahabatnya, tiba tiba beliau melepaskan kedua sandalnya lalu meletakkannya di sebelah kirinya. Sewaktu para sahabat melihat tindakan beliau tersebut, mereka ikut pula melepas sandal mereka. Maka tatkala Rasulullah shallallahu 'alaihi wasallam selesai sholat, beliau bersabda: \"Apa gerangan yang membuat kalian melepas sandal sandal kalian?\" Mereka menjawab; Kami melihat engkau melepas sandal, sehingga kami pun melepaskan sandal sandal kami. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Malaikat Jibril 'Alaihis Salam telah datang kepadaku, lalu memberitahukan kepadaku bahwa di sepasang sandal itu ada najisnya.\" Selanjutnya beliau bersabda: \"Apabila salah seorang di antara kalian datang ke masjid, maka perhatikanlah, jika dia melihat di sepasang sandalnya terdapat najis atau kotoran maka bersihkan, dan sholatlah dengan sepasang sandalnya itu.\" Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Aban] telah menceritakan kepada kami [Qatadah] telah menceritakan kepadaku [Bakr bin Abdullah] dari Nabi shallallahu 'alaihi wasallam seperti Hadits ini, beliau bersabda: \"Pada keduanya terdapat kotoran.\""
            },
            {
                "number": 544,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ عَنْ هِلَالِ بْنِ مَيْمُونٍ الرَّمْلِيِّ عَنْ يَعْلَى بْنِ شَدَّادِ بْنِ أَوْسٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَالِفُوا الْيَهُودَ فَإِنَّهُمْ لَا يُصَلُّونَ فِي نِعَالِهِمْ وَلَا خِفَافِهِمْ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Marwan bin Mu'awiyah Al-Fazari] dari [Hilal bin Maimun Ar-Ramli] dari [Ya'la bin Syaddad bin Aus] dari [Ayahnya] dia berkata; Rasulullah Shallallahu alaihi wasallam bersabda: \"Selisihilah orang-orang yahudi, yang mereka beribadah dengan tidak mengenakan sandal-sandal dan juga khuf (sepatu) mereka.\""
            },
            {
                "number": 545,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي حَافِيًا وَمُنْتَعِلًا",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Ali bin Al-Mubarak] dari [Husain Al-Mu'allim] dari [Amru bin Syu'aib] dari [Ayahnya] dari [Kakeknya] dia berkata; Saya pernah melihat Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat dengan kaki telanjang dan memakai sandal. "
            },
            {
                "number": 546,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا صَالِحُ بْنُ رُسْتُمَ أَبُو عَامِرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ قَيْسٍ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ فَلَا يَضَعْ نَعْلَيْهِ عَنْ يَمِينِهِ وَلَا عَنْ يَسَارِهِ فَتَكُونَ عَنْ يَمِينِ غَيْرِهِ إِلَّا أَنْ لَا يَكُونَ عَنْ يَسَارِهِ أَحَدٌ وَلْيَضَعْهُمَا بَيْنَ رِجْلَيْهِ",
                "id": "Telah menceritakan kepada kami [Al-Hasan bin Ali] telah menceritakan kepada kami [Utsman bin Umar] telah menceritakan kepada kami [Shalih bin Rustum, Ab 'Amir] dari [Abdurrahman bin Qais] dari [Yusuf bin Mahak] dari [Abu Hurairah] bahwasanya Rasulullah Shallallahu alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian melaksanakan sholat, janganlah dia meletakkan sandalnya di sisi kanan atau kirinya sehingga menjadi di sisi kanan orang lain, kecuali di sisi kirinya tidak ada orang lain, dan hendaklah dia meletakkannya di antara kedua kakinya.\""
            },
            {
                "number": 547,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ حَدَّثَنَا بَقِيَّةُ وَشُعَيْبُ بْنُ إِسْحَقَ عَنْ الْأَوْزَاعِيِّ حَدَّثَنِي مُحَمَّدُ بْنُ الْوَلِيدِ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ فَخَلَعَ نَعْلَيْهِ فَلَا يُؤْذِ بِهِمَا أَحَدًا لِيَجْعَلْهُمَا بَيْنَ رِجْلَيْهِ أَوْ لِيُصَلِّ فِيهِمَا",
                "id": "Telah menceritakan kepada kami [Abdul Wahhab bin Najdah] telah menceritakan kepada kami [Baqiyyah] dan [Syu'aib bin Ishaq] dari [Al-Auza'i] telah menceritakan kepadaku [Muhammad bin Al-Walid] dari [Sa'id bin Abi Sa'id] dari [Ayahnya] dari [Abu Hurairah] dari Rasulullah Shallallahu alaihi wasallam, beliau bersabda: \"Apabila salah seorang di antara kalian sholat dengan melepaskan kedua sandalnya, janganlah mengganggu orang lain dengannya, hendaklah dia meletakkan kedua sandalnya di antara kedua kakinya atau dia sholat dengan menggunakan keduanya.\""
            },
            {
                "number": 548,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ حَدَّثَنَا خَالِدٌ عَنْ الشَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ حَدَّثَتْنِي مَيْمُونَةُ بِنْتُ الْحَارِثِ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَأَنَا حِذَاءَهُ وَأَنَا حَائِضٌ وَرُبَّمَا أَصَابَنِي ثَوْبُهُ إِذَا سَجَدَ وَكَانَ يُصَلِّي عَلَى الْخُمْرَةِ",
                "id": "Telah menceritakan kepada kami [Amru bin Aun] telah menceritakan kepada kami [Khalid] dari [Asy-Syaibani] dari [Abdullah bin Syaddad] telah menceritakan kepadaku [Maimunah binti Al-Harits] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan sholat, sementara saya berada dekat kaki beliau dan saya sedang haidl. Terkadang pakaian beliau mengenaiku ketika beliau sujud, beliau itu mengerjakan sholat di atas tikar kecil. "
            },
            {
                "number": 549,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ أَنَسِ بْنِ سِيرِينَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَجُلٌ مِنْ الْأَنْصَارِ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ ضَخْمٌ وَكَانَ ضَخْمًا لَا أَسْتَطِيعُ أَنْ أُصَلِّيَ مَعَكَ وَصَنَعَ لَهُ طَعَامًا وَدَعَاهُ إِلَى بَيْتِهِ فَصَلِّ حَتَّى أَرَاكَ كَيْفَ تُصَلِّي فَأَقْتَدِيَ بِكَ فَنَضَحُوا لَهُ طَرَفَ حَصِيرٍ كَانَ لَهُمْ فَقَامَ فَصَلَّى رَكْعَتَيْنِ قَالَ فُلَانُ بْنُ الْجَارُودِ لِأَنَسِ بْنِ مَالِكٍ أَكَانَ يُصَلِّي الضُّحَى قَالَ لَمْ أَرَهُ صَلَّى إِلَّا يَوْمَئِذٍ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Mu'adz] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Syu'bah] dari [Anas bin Sirin] dari [Anas bin Malik] dia berkata; Ada seorang laki laki dari golongan Anshar berkata; Wahai Rasulullah, saya seorang laki laki yang sangat gemuk dia memang sangat gemuk, saya tidak mampu sholat bersamamu. Laki laki itu membuat makanan untuk beliau, lalu mengundang beliau ke rumahnya. Laki-laki itu berkata; Maka sholatlah, sehingga saya dapat melihat bagaimana cara engkau mengerjakan sholat, dan saya mengikuti gerakanmu. Mereka kemudian memerciki ujung tikar mereka dengan air untuk beliau, lalu beliau berdiri mengerjakan sholat dua rakaat. Berkata Fulan bin Al-Jarud kepada Anas bin Malik; Apakah beliau itu sholat Dhuha? Kata Anas, \"Saya belum pernah melihat beliau sholat kecuali pada hari itu. "
            },
            {
                "number": 550,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ الذَّارِعُ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَزُورُ أُمَّ سُلَيْمٍ فَتُدْرِكُهُ الصَّلَاةُ أَحْيَانًا فَيُصَلِّي عَلَى بِسَاطٍ لَنَا وَهُوَ حَصِيرٌ نَنْضَحُهُ بِالْمَاءِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Al-Mutsanna bin Sa'id Adz-Dzira'] telah menceritakan kepada kami [Qatadah] dari [Anas bin Malik] bahwasanya Nabi shallallahu 'alaihi wasallam pernah mengunjungi Ummu Sulaim dan terkadang sampai (waktu) sholat tiba, maka beliau mengerjakan sholat di atas hamparan kami, yaitu tikar yang kami perciki dengan air."
            },
            {
                "number": 551,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ بِمَعْنَى الْإِسْنَادِ وَالْحَدِيثِ قَالَا حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ عَنْ يُونُسَ بْنِ الْحَارِثِ عَنْ أَبِي عَوْنٍ عَنْ أَبِيهِ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى الْحَصِيرِ وَالْفَرْوَةِ الْمَدْبُوغَةِ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Umar bin Maisarah] dan [Utsman bin Abi Syaibah] dengan makna yang sama dalam isnad dan lafazh hadits. Mereka berdua berkata; Telah menceritakan kepada kami [Abu Ahmad Az-Zubairi] dari [Yunus bin Al-Harits] dari [Abu 'Aun] dari [Ayahnya] dari [Al-Mughirah bin Syu'bah] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah sholat di atas tikar dan kulit yang telah disamak. "
            },
            {
                "number": 552,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ حَدَّثَنَا غَالِبٌ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي شِدَّةِ الْحَرِّ فَإِذَا لَمْ يَسْتَطِعْ أَحَدُنَا أَنْ يُمَكِّنَ وَجْهَهُ مِنْ الْأَرْضِ بَسَطَ ثَوْبَهُ فَسَجَدَ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Bisyr bin Al-Mufadldlal] telah menceritakan kepada kami [Ghalib] dari [Bakr bin Abdullah] dari [Anas bin Malik] dia berkata; Kami pernah sholat bersama Rasulullah shallallahu 'alaihi wasallam di waktu yang sangat panas, apabila salah seorang dari kami tidak sanggup menempelkan dahinya di tanah, dia menghamparkan kainnya lalu bersujud di atasnya. "
            },
            {
                "number": 553,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ قَالَ سَأَلْتُ سُلَيْمَانَ الْأَعْمَشَ عَنْ حَدِيثِ جَابِرِ بْنِ سَمُرَةَ فِي الصُّفُوفِ الْمُقَدَّمَةِ فَحَدَّثَنَا عَنْ الْمُسَيَّبِ بْنِ رَافِعٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا تَصُفُّونَ كَمَا تَصُفُّ الْمَلَائِكَةُ عِنْدَ رَبِّهِمْ جَلَّ وَعَزَّ قُلْنَا وَكَيْفَ تَصُفُّ الْمَلَائِكَةُ عِنْدَ رَبِّهِمْ قَالَ يُتِمُّونَ الصُّفُوفَ الْمُقَدَّمَةَ وَيَتَرَاصُّونَ فِي الصَّفِّ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An-Nufaili] telah menceritakan kepada kami [Zuhair] dia berkata; Saya pernah bertanya kepada [Sulaiman Al-A'masy] tentang hadits Jabir bin Samurah dalam hal shaf terdepan, maka dia menceritakan kepada kami dari [Al-Musayyab bin Rafi'] dari [Tamim bin Tharafah] dari [Jabir bin Samurah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidakkah kalian ingin berbaris sebagaimana para malaikat berbarls di hadapan Rabb mereka Azza wa Jalla?\" Kami berkata; Bagaimana para malaikat berbaris di hadapan Rabb mereka? Baliau bersabda: \"Mereka menyempurnakan shaf shaf yang terdepan, dan mereka saling merapatkan shaf.\""
            },
            {
                "number": 554,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ أَبِي الْقَاسِمِ الْجُدَلِيِّ قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ يَقُولُأَقْبَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى النَّاسِ بِوَجْهِهِ فَقَالَ أَقِيمُوا صُفُوفَكُمْ ثَلَاثًا وَاللَّهِ لَتُقِيمُنَّ صُفُوفَكُمْ أَوْ لَيُخَالِفَنَّ اللَّهُ بَيْنَ قُلُوبِكُمْ قَالَ فَرَأَيْتُ الرَّجُلَ يَلْزَقُ مَنْكِبَهُ بِمَنْكِبِ صَاحِبِهِ وَرُكْبَتَهُ بِرُكْبَةِ صَاحِبِهِ وَكَعْبَهُ بِكَعْبِهِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abi Syaibah] telah menceritakan kepada kami [Waki'] dari [Zakariyya bin Abi Za`idah] dari [Abul Qasim Al-Judali] dia berkata; Saya telah mendengar [An-Numan bin Basyir] berkata; Rasulullah shallallahu 'alaihi wasallam biasa menghadap kepada jamaah, lalu bersabda: \"Luruskanlah shaf shaf kalian! -beliau mengucapkannya tiga kali- Demi Allah, hendaklah kalian benar-benar meluruskan shaf shaf kalian, atau Allah benar--benar akan membuat hati kalian saling berselisih.\" Kata Nu'man; Maka saya melihat seseorang melekatkan (merapatkan) pundaknya dengan pundak temannya (orang di sampingnya), demikian pula antara lutut dan mata kakinya dengan lutut dan mata kaki temannya. "
            },
            {
                "number": 555,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ سِمَاكِ بْنِ حَرْبٍ قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ يَقُولُكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَوِّينَا فِي الصُّفُوفِ كَمَا يُقَوَّمُ الْقِدْحُ حَتَّى إِذَا ظَنَّ أَنْ قَدْ أَخَذْنَا ذَلِكَ عَنْهُ وَفَقِهْنَا أَقْبَلَ ذَاتَ يَوْمٍ بِوَجْهِهِ إِذَا رَجُلٌ مُنْتَبِذٌ بِصَدْرِهِ فَقَالَ لَتُسَوُّنَّ صُفُوفَكُمْ أَوْ لَيُخَالِفَنَّ اللَّهُ بَيْنَ وُجُوهِكُمْ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Simak bin Harb] dia berkata; Saya telah mendengar [An-Nu'man bin Basyir] berkata; Nabi shallallahu 'alaihi wasallam biasa meluruskan shaf kami, sebagaimana beliau meluruskan anak panah, sehingga setelah beliau merasa bahwa kami telah memenuhi perintahnya dan memahami benar benar, tiba tiba pada suatu hari beliau menghadapkan wajahnya kepada kami dan melihat masih ada seseorang yang menonjolkan dadanya ke depan, maka beliau bersabda: \"Hendaklah kalian meratakan shaf, atau (kalau tidak), maka Allah akan merubah wajah-wajah kalian.\""
            },
            {
                "number": 556,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ وَأَبُو عَاصِمِ بْنُ جَوَّاسٍ الْحَنَفِيُّ عَنْ أَبِي الْأَحْوَصِ عَنْ مَنْصُورٍ عَنْ طَلْحَةَ الْيَامِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْسَجَةَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَخَلَّلُ الصَّفَّ مِنْ نَاحِيَةٍ إِلَى نَاحِيَةٍ يَمْسَحُ صُدُورَنَا وَمَنَاكِبَنَا وَيَقُولُ لَا تَخْتَلِفُوا فَتَخْتَلِفَ قُلُوبُكُمْ وَكَانَ يَقُولُ إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى الصُّفُوفِ الْأُوَلِ",
                "id": "Telah menceritakan kepada kami [Hannad bin As-Sariy] dan [Abu 'Ashim bin Jawwas Al-Hanafi] dari [Abu Al-Ahwash] dari [Manshur] dari [Thalhah Al-Yamiy] dari [Abdurrahman bin Ausajah] dari [Al-Bara` bin 'Azib] dia berkata; Rasulullah shallallahu 'alaihi wasallam biasa memasuki celah celah shaf, dari ujung ke ujung lainnya seraya mengusap dada dan pundak kami, lalu bersabda: \"Janganlah kalian berselisih, sehingga akan membuat hati kalian berselisih juga.\" Beliau juga bersabda: \"Sesungguhnya Allah dan para malaikatNya bershalawat kepada shaf shaf pertama.\""
            },
            {
                "number": 557,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا حَاتِمٌ يَعْنِي ابْنَ أَبِي صَغِيرَةَ عَنْ سِمَاكٍ قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسَوِّي صُفُوفَنَا إِذَا قُمْنَا لِلصَّلَاةِ فَإِذَا اسْتَوَيْنَا كَبَّرَ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Mu'adz] telah menceritakan kepada kami [Khalid bin Al-Harits] telah menceritakan kepada kami [Hatim bin Abi Shaghirah] dari [Simak] dia berkata; Saya telah mendengar [An-Nu'man bin Basyir] berkata; Rasulullah shallallahu 'alaihi wasallam biasa meluruskan shaf shaf kami apabila kami berdiri untuk sholat. Kalau barisan kami telah lurus, maka beliau bertakbir. "
            },
            {
                "number": 558,
                "arab": "حَدَّثَنَا عِيسَى بْنُ إِبْرَاهِيمَ الْغَافِقِيُّ حَدَّثَنَا ابْنُ وَهْبٍ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ وَحَدِيثُ ابْنِ وَهْبٍ أَتَمُّ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ أَبِي الزَّاهِرِيَّةِ عَنْ كَثِيرِ بْنِ مُرَّةَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ قُتَيْبَةُ عَنْ أَبِي الزَّاهِرِيَّةِ عَنْ أَبِي شَجَرَةَ لَمْ يَذْكُرْ ابْنَ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَقِيمُوا الصُّفُوفَ وَحَاذُوا بَيْنَ الْمَنَاكِبِ وَسُدُّوا الْخَلَلَ وَلِينُوا بِأَيْدِي إِخْوَانِكُمْ لَمْ يَقُلْ عِيسَى بِأَيْدِي إِخْوَانِكُمْ وَلَا تَذَرُوا فُرُجَاتٍ لِلشَّيْطَانِ وَمَنْ وَصَلَ صَفًّا وَصَلَهُ اللَّهُ وَمَنْ قَطَعَ صَفًّا قَطَعَهُ اللَّهُقَالَ أَبُو دَاوُد أَبُو شَجَرَةَ كَثِيرُ بْنُ مُرَّةَ قَالَ أَبُو دَاوُد وَمَعْنَى وَلِينُوا بِأَيْدِي إِخْوَانِكُمْ إِذَا جَاءَ رَجُلٌ إِلَى الصَّفِّ فَذَهَبَ يَدْخُلُ فِيهِ فَيَنْبَغِي أَنْ يُلِينَ لَهُ كُلُّ رَجُلٍ مَنْكِبَيْهِ حَتَّى يَدْخُلَ فِي الصَّفِّ",
                "id": "Telah menceritakan kepada kami [Isa bin Ibrahim Al-Ghafiqi] telah menceritakan kepada kami [Ibnu Wahb] -dari jalur lain- Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al-Laits] dan hadits riwayat Ibnu Wahb lebih sempurna, dari [Mu'awiyah bin Shalih] dari [Abu Az-Zahiriyyah] dari [Katsir bin Murrah] dari [Abdullah bin Umar], Qutaibah berkata; dari Az-Zahiriyah dari Abi Syajarah tanpa menyebutkan Ibnu Umar bahwasanya Rasulullah Shallallahu alaihi wasallam bersabda: \"Tegakkanlah shaf-shaf, sejajarkanlah antara pundak-pundak, tutuplah celah-celah dan lemah lembutlah terhadap kedua tangan saudara kalian, -[Isa] tidak menyebutkan; tangan saudara kalian- dan janganlah kalian membiarkan celah-celah itu untuk setan, barangsiapa yang menyambung shaf maka Allah akan menyambungnya dan barang siapa yang memutusnya maka Allah Allah akan memutusnya.\" Abu Dawud berkata; Abu Syajarah adalah Katsir bin Murrah. Abu Dawud berkata; Makna dari kalimat lemah lembutlah kalian terhadap tangan saudara kalian adalah, apabila ada seseorang yang baru datang dan masuk ke dalam shaf, maka yang lain hendaknya melemaskan pundaknya hingga dia dapat masuk ke dalam shaf."
            },
            {
                "number": 559,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبَانُ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُصُّوا صُفُوفَكُمْ وَقَارِبُوا بَيْنَهَا وَحَاذُوا بِالْأَعْنَاقِ فَوَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لَأَرَى الشَّيْطَانَ يَدْخُلُ مِنْ خَلَلِ الصَّفِّ كَأَنَّهَا الْحَذَفُ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Aban] dari [Qatadah] dari [Anas bin Malik] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Rapatkan shaf shaf kalian, dekatkanlah jarak antara keduanya, dan sejajarkanlah antara leher-leher. Demi Dzat yang jiwaku berada di TanganNya, sesungguhnya saya melihat setan masuk ke dalam celah celah shaf itu, tak ubahnya bagai anak kambing kecil.\""
            },
            {
                "number": 560,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ وَسُلَيْمَانُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَوُّوا صُفُوفَكُمْ فَإِنَّ تَسْوِيَةَ الصَّفِّ مِنْ تَمَامِ الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Abu Al-Walid Ath-Thayalisi] dan [Sulaiman bin Harb] mereka berdua berkata; Telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Anas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Luruskan shaf shaf kalian, karena sesungguhnya meluruskan shaf termasuk kesempurnaan sholat (berjama'ah).\""
            },
            {
                "number": 561,
                "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ مُصْعَبِ بْنِ ثَابِتِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ مُحَمَّدِ بْنِ مُسْلِمِ بْنِ السَّائِبِ صَاحِبِ الْمَقْصُورَةِ قَالَصَلَّيْتُ إِلَى جَنْبِ أَنَسِ بْنِ مَالِكٍ يَوْمًا فَقَالَ هَلْ تَدْرِي لِمَ صُنِعَ هَذَا الْعُودُ فَقُلْتُ لَا وَاللَّهِ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضَعُ يَدَهُ عَلَيْهِ فَيَقُولُ اسْتَوُوا وَعَدِّلُوا صُفُوفَكُمْحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حُمَيْدُ بْنُ الْأَسْوَدِ حَدَّثَنَا مُصْعَبُ بْنُ ثَابِتٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَنَسٍ بِهَذَا الْحَدِيثِ قَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَامَ إِلَى الصَّلَاةِ أَخَذَهُ بِيَمِينِهِ ثُمَّ الْتَفَتَ فَقَالَ اعْتَدِلُوا سَوُّوا صُفُوفَكُمْ ثُمَّ أَخَذَهُ بِيَسَارِهِ فَقَالَ اعْتَدِلُوا سَوُّوا صُفُوفَكُمْ",
                "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Hatim bin Isma'il] dari [Mush'ab bin Tsabit bin Abdullah bin Az-Zubair] dari [Muhammad bin Muslim bin As-Sa`ib] dia berkata; Pada suatu hari saya pernah sholat di samping [Anas bin Malik], lalu dia berkata; Tahukah kamu apa yang dilakukan dengan kayu ini? Saya katakan; Tidak tahu, demi Allah. Dia berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa memegangnya dan bersabda: \"Luruskan dan tegakkan shaf-shaf kalian.\" Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Humaid bin Al-Aswad] telah menceritakan kepada kami [Mush'ab bin Tsabit] dari [Muhammad bin Muslim] dari [Anas] dengan hadits ini, dia berkata; Sesungguhnya Rasulullah shallallahu 'alaihi wasallam apabila bangkit untuk sholat, beliau mengambilnya dengan tangan kanannya, kemudian menoleh dan bersabda: \"Tegaklah, luruskanlah shaf-shaf kalian.\" Lalu beliau mengambilnya dengan tangan kirinya dan bersabda: \"Luruskanlah shaf-shaf kalian.\""
            },
            {
                "number": 562,
                "arab": "حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا جَعْفَرُ بْنُ يَحْيَى بْنِ ثَوْبَانَ قَالَ أَخْبَرَنِي عَمِّي عُمَارَةُ بْنُ ثَوْبَانَ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خِيَارُكُمْ أَلْيَنُكُمْ مَنَاكِبَ فِي الصَّلَاةِقَالَ أَبُو دَاوُد جَعْفَرُ بْنُ يَحْيَى مِنْ أَهْلِ مَكَّةَ",
                "id": "Telah menceritakan kepada kami [Ibnu Basysyar] telah menceritakan kepada kami [Abu 'Ashim] telah menceritakan kepada kami [Ja'far bin Yahya bin Tsauban] dia berkata; Telah mengabarkan kepadaku [Umarah bin Tsauban] dari ['Atha`] dari [Ibnu Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik baik kalian adalah orang yang paling berlaku lunak menyentuh bahu bahu temannya (ketika meratakan shaf sholat). Abu Dawud berkata; Ja'far bin Yahya termasuk penduduk Makkah. "
            },
            {
                "number": 563,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ يَحْيَى بْنِ هَانِئٍ عَنْ عَبْدِ الْحَمِيدِ بْنِ مَحْمُودٍ قَالَصَلَّيْتُ مَعَ أَنَسِ بْنِ مَالِكٍ يَوْمَ الْجُمُعَةِ فَدُفِعْنَا إِلَى السَّوَارِي فَتَقَدَّمْنَا وَتَأَخَّرْنَا فَقَالَ أَنَسٌ كُنَّا نَتَّقِي هَذَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abdurrahman] telah menceritakan kepada kami [Sufyan] dari [Yahya bin Hani`] dari [Abdul Hamid bin Mahmud] dia berkata; Saya pernah sholat di belakang Anas bin Malik pada Hari Jum'at, kami didorong untuk tidak sholat di antara kedua tiang hingga ada di antara kami yang maju ke depan dan ada yang mundur ke belakang. Lalu [Anas] berkata; Kami pada zaman Rasulullah Shallallahu alaihi wasallam dahulu menghindari tempat (tiang) tersebut ketika sholat. "
            },
            {
                "number": 564,
                "arab": "حَدَّثَنَا ابْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ أَبِي مَعْمَرٍ عَنْ أَبِي مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيَلِنِي مِنْكُمْ أُولُو الْأَحْلَامِ وَالنُّهَى ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا خَالِدٌ عَنْ أَبِي مَعْشَرٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ وَزَادَ وَلَا تَخْتَلِفُوا فَتَخْتَلِفَ قُلُوبُكُمْ وَإِيَّاكُمْ وَهَيْشَاتِ الْأَسْوَاقِ",
                "id": "Telah menceritakan kepada kami [Ibnu Katsir] telah mengabarkan kepada kami [Sufyan] dari [Al-A'masy] dari ['Umarah bin 'Umair] dari [Abu Ma'mar] dari [Abu Mas'ud] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaklah yang menempati shaf di belakangku adalah orang orang dewasa dan cerdik pandai, kemudian orang orang yang (kualitas dan umurnya) setelah mereka, kemudian orang orang yang (kualitas dan umurnya) setelah mereka.\" Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Khalid] dari [Abu Ma'syar] dari [Ibrahim] dari [Alqamah] dari [Abdullah] dari Nabi shallallahu 'alaihi wasallam, semisal dengannya, dan menambahkan lafazh; Dan janganlah kalian berselisih sehingga menyebabkan hati kalian saling berselisih. Dan jauhilah olehmu suara ribut seperti di tengah pasar. "
            },
            {
                "number": 565,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ حَدَّثَنَا سُفْيَانُ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنْ عُثْمَانَ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى مَيَامِنِ الصُّفُوفِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abi Syaibah] telah menceritakan kepada kami [Mu'awiyah bin Hisyam] telah menceritakan kepada kami [Sufyan] dari [Usamah bin Zaid] dari [Utsman bin Urwah] dari [Urwah] dari [Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah dan para malaikatNya mengucapkan shalawat untuk orang orang yang berada di shaf kanan.\""
            },
            {
                "number": 566,
                "arab": "حَدَّثَنَا عِيسَى بْنُ شَاذَانَ حَدَّثَنَا عَيَّاشٌ الرَّقَّامُ حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ حَدَّثَنَا بُدَيْلٌ حَدَّثَنَا شَهْرُ بْنُ حَوْشَبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ قَالَ قَالَ أَبُو مَالِكٍ الْأَشْعَرِيُّأَلَا أُحَدِّثُكُمْ بِصَلَاةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَأَقَامَ الصَّلَاةَ وَصَفَّ الرِّجَالَ وَصَفَّ خَلْفَهُمْ الْغِلْمَانَ ثُمَّ صَلَّى بِهِمْ فَذَكَرَ صَلَاتَهُ ثُمَّ قَالَ هَكَذَا صَلَاةُ قَالَ عَبْدُ الْأَعْلَى لَا أَحْسَبُهُ إِلَّا قَالَ صَلَاةُ أُمَّتِي",
                "id": "Telah menceritakan kepada kami [Isa bin Syadzan] telah menceritakan kepada kami ['Ayyasy Ar-Raqqam] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Qurrah bin Khalid] telah menceritakan kepada kami [Budail] telah menceritakan kepada kami [Syahr bin Hausyab] dari [Abdurrahman bin Ghanm] dia berkata; [Abu Malik Al-Asy'ari] berkata; Maukah aku ceritakan kepada kalian tentang sholat Nabi shallallahu 'alaihi wasallam? Dia melanjutkan; Beliau shallallahu 'alaihi wasallam mendirikan sholat, beliau membariskan shaf laki-laki dewasa dan di belakang mereka anak-anak muda, lalu beliau sholat bersama mereka. Abu Malik kemudian menyebutkan sholat beliau, lalu beliau bersabda: \"Inilah sholat.\" Abdul A'la berkata; Saya tidak menyangka Abu Malik kecuali dia menyebutkan sabda beliau: \"Inilah sholat umatku.\""
            },
            {
                "number": 567,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا خَالِدٌ وَإِسْمَعِيلُ بْنُ زَكَرِيَّاءَ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ صُفُوفِ الرِّجَالِ أَوَّلُهَا وَشَرُّهَا آخِرُهَا وَخَيْرُ صُفُوفِ النِّسَاءِ آخِرُهَا وَشَرُّهَا أَوَّلُهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash-Shabbah Al-Bazzaz] telah menceritakan kepada kami [Khalid] dan [Isma'il bin Zakariyya] dari [Suhail bin Abi Shalih] dari [Ayahnya] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik baik shaf laki laki adalah shaf yang pertama dan sejelek jeleknya adalah shaf yang terakhir. Sebaik baik shaf wanita adalah yang terakhir dan sejelek jeleknya adalah shaf yang pertama.\""
            },
            {
                "number": 568,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَزَالُ قَوْمٌ يَتَأَخَّرُونَ عَنْ الصَّفِّ الْأَوَّلِ حَتَّى يُؤَخِّرَهُمْ اللَّهُ فِي النَّارِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ma'in] telah menceritakan kepada kami [Abdur Razzaq] dari [Ikrimah bin Ammar] dari [Yahya bin Abi Katsir] dari [Abu Salamah] dari [Aisyah] dia berkata; Rasulullah Shallallahu alaihi wasallam bersabda: \"Akan ada suatu kaum yang suka melambat-lambatkan diri dari shaf pertama, hingga Allah melambatkan mereka (keluar dari) neraka.\""
            },
            {
                "number": 569,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخُزَاعِيُّ قَالَا حَدَّثَنَا أَبُو الْأَشْهَبِ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى فِي أَصْحَابِهِ تَأَخُّرًا فَقَالَ لَهُمْ تَقَدَّمُوا فَأْتَمُّوا بِي وَلْيَأْتَمَّ بِكُمْ مَنْ بَعْدَكُمْ وَلَا يَزَالُ قَوْمٌ يَتَأَخَّرُونَ حَتَّى يُؤَخِّرَهُمْ اللَّهُ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] dan [Muhammad bin Abdullah Al-Khuza'i] dia berkata; Telah menceritakan kepada kami [Abu Al-Asyhab] dari [Abu Nadlrah] dari [Abu Sa'id Al-Khudri] bahwasanya Rasulullah shallallahu 'alaihi wasallam pernah melihat pada sahabat sahabatnya bersikap lamban (untuk maju ke depan), maka beliau bersabda kepada mereka: \"Majulah dan ikutilah aku, dan hendaklah orang yang di belakang kalian mengikuti kalian. Suatu kaum masih saja bersikap lamban, sehingga Allah Azza wa Jalla juga akan memperlamban mereka (dari RahmatNya).\""
            },
            {
                "number": 570,
                "arab": "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ يَحْيَى بْنِ بَشِيرِ بْنِ خَلَّادٍ عَنْ أُمِّهِ أَنَّهَا دَخَلَتْ عَلَى مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ فَسَمِعَتْهُ يَقُولُ حَدَّثَنِي أَبُو هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسِّطُوا الْإِمَامَ وَسُدُّوا الْخَلَلَ",
                "id": "Telah menceritakan kepada kami [Ja'far bin Musafir] telah menceritakan kepada kami [Ibnu Abi Fudaik] dari [Yahya bin Basyir bin Khallad] dari [Ibunya] bahwasanya dia pernah menemui [Muhammad bin Ka'b Al-Qurazhi] lalu dia mendengarnya berkata; Telah menceritakan kepadaku [Abu Hurairah] dia berkata; Rasulullah Shallallahu alaihi wasallam bersabda: \"Jadikanlah imam berada di tengah-tengah kalian dan tutuplah celah-celah shaf.\""
            },
            {
                "number": 571,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَحَفْصُ بْنُ عُمَرَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ عَمْرِو بْنِ رَاشِدٍ عَنْ وَابِصَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يُصَلِّي خَلْفَ الصَّفِّ وَحْدَهُ فَأَمَرَهُ أَنْ يُعِيدَ قَالَ سُلَيْمَانُ بْنُ حَرْبٍ الصَّلَاةَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] dan [Hafsh bin Umar] dia berkata; Telah menceritakan kepada kami [Syu'bah] dari [Amru bin Murrah] dari [Hilal bin Yasaf] dari [Amru bin Rasyid] dari [Wabishah] bahwasanya Rasulullah shallallahu 'alaihi wasallam pernah melihat seorang laki laki mengerjakan sholat sendirian di belakang shaf, maka beliau memerintahkannya untuk mengulangi kembali sholatnya. Sulaiman bin Harb menyebutkan; (mengulangi) sholatnya. "
            },
            {
                "number": 572,
                "arab": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ أَنَّ يَزِيدَ بْنَ زُرَيْعٍ حَدَّثَهُمْ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ زِيَادٍ الْأَعْلَمِ حَدَّثَنَا الْحَسَنُ أَنَّ أَبَا بَكْرَةَ حَدَّثَأَنَّهُ دَخَلَ الْمَسْجِدَ وَنَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَاكِعٌ قَالَ فَرَكَعْتُ دُونَ الصَّفِّ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَادَكَ اللَّهُ حِرْصًا وَلَا تَعُدْ",
                "id": "Telah menceritakan kepada kami [Humaid bin Mas'adah] bahwasanya [Yazid bin Zurai'] telah menceritakan kepada mereka, Telah menceritakan kepada kami [Sa'id bin Abi 'Arubah] dari [Ziyad Al-A'lam] telah menceritakan kepada kami [Al-Hasan] bahwasanya [Abu Bakrah] telah menceritakan kepadanya bahwa dia pernah masuk ke dalam masjid, sedangkan Nabiyullah shallallahu 'alaihi wasallam sedang ruku'. Kata Abu Bakrah; Maka saya ruku' di luar shaf, lalu setelah Nabi shallallahu 'alaihi wasallam selesai sholat, beliau bersabda: \"Semoga Allah menambahkan untukmu semangat melakukan kebaikan, dan janganlah kamu mengulanginya lagi.\""
            },
            {
                "number": 573,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا زِيَادٌ الْأَعْلَمُ عَنْ الْحَسَنِ أَنَّ أَبَا بَكْرَةَجَاءَ وَرَسُولُ اللَّهِ رَاكِعٌ فَرَكَعَ دُونَ الصَّفِّ ثُمَّ مَشَى إِلَى الصَّفِّ فَلَمَّا قَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاتَهُ قَالَ أَيُّكُمْ الَّذِي رَكَعَ دُونَ الصَّفِّ ثُمَّ مَشَى إِلَى الصَّفِّ فَقَالَ أَبُو بَكْرَةَ أَنَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَادَكَ اللَّهُ حِرْصًا وَلَا تَعُدْقَالَ أَبُو دَاوُد زِيَادٌ الْأَعْلَمُ زِيَادُ بْنُ فُلَانِ بْنِ قُرَّةَ وَهُوَ ابْنُ خَالَةِ يُونُسَ بْنِ عُبَيْدٍ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] telah mengabarkan kepada kami [Ziyad Al-A'lam] dari [Al-Hasan] bahwasanya [Abu Bakrah] datang, sedangkan Rasulullah shallallahu 'alaihi wasallam dalam keadaan ruku', lalu dia ruku' di luar shaf, kemudian berjalan menuju shaf. Tatkala Nabi shallallahu 'alaihi wasallam selesai sholat, beliau bersabda: \"Siapakah di antara kalian yang ruku di luar shaf kemudian berjalan masuk ke shaf?\" Abu Bakrah menjawab; Saya. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Semoga Allah menambahkan semangat untukmu melakukan kebaikan, dan jangan kamu mengulanginya lagi.\" Abu Dawud berkata; Ziyad Al-A'lam adalah Ziyad bin Fulan bin Qurrah, dan dia adalah anak bibinya Yunus bin Ubaid. "
            },
            {
                "number": 574,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ الْعَبْدِيُّ حَدَّثَنَا إِسْرَائِيلُ عَنْ سِمَاكٍ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ أَبِيهِ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا جَعَلْتَ بَيْنَ يَدَيْكَ مِثْلَ مُؤَخِّرَةِ الرَّحْلِ فَلَا يَضُرُّكَ مَنْ مَرَّ بَيْنَ يَدَيْكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir Al-'Abdi] telah menceritakan kepada kami [Isra`il] dari [Simak] dari [Musa bin Thahah] dari [Ayahnya, Thahah bin Ubaidillah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kamu memasang sutrah (pembatas) di depanmu seperti kayu di belakang binatang kendaraan, maka tidak akan memudharatkanmu orang yang lewat di depanmu\""
            },
            {
                "number": 575,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ قَالَآخِرَةُ الرَّحْلِ ذِرَاعٌ فَمَا فَوْقَهُ",
                "id": "Telah menceritakan kepada kami [Al-Hasan bin Ali] telah menceritakan kepada kami [Abdur Razzaq] dari [Ibnu Juraij] dari ['Atha`] dia berkata: Tinggi kayu yang di letakkan di belakang hewan kendaraan adalah sehasta lebih. "
            },
            {
                "number": 576,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ يَوْمَ الْعِيدِ أَمَرَ بِالْحَرْبَةِ فَتُوضَعُ بَيْنَ يَدَيْهِ فَيُصَلِّي إِلَيْهَا وَالنَّاسُ وَرَاءَهُ وَكَانَ يَفْعَلُ ذَلِكَ فِي السَّفَرِ فَمِنْ ثَمَّ اتَّخَذَهَا الْأُمَرَاءُ",
                "id": "Telah menceritakan kepada kami [Al-Hasan bin Ali] telah menceritakan kepada kami [Ibnu Numair] dari [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwasanya apabila Rasulullah shallallahu 'alaihi wasallam hendak pergi melakukan sholat pada Hari Raya, beliau memerintahkan untuk membawa tombak, lalu ditancapkannya di depan beliau. lalu beliau sholat menghadap kepadanya, sementara orang-orang berdiri di belakang beliau. Hal itu juga dilakukan beliau sewaktu dalam perjalanan, yang kemudian dicontoh oleh para pemimpin. "
            },
            {
                "number": 577,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِهِمْ بِالْبَطْحَاءِ وَبَيْنَ يَدَيْهِ عَنَزَةٌ الظُّهْرَ رَكْعَتَيْنِ وَالْعَصْرَ رَكْعَتَيْنِ يَمُرُّ خَلْفَ الْعَنَزَةِ الْمَرْأَةُ وَالْحِمَارُ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari ['Aun bin Abi Juhaifah] dari [Ayahnya] bahwasanya Nabi shallallahu 'alaihi wasallam pernah mengerjakan sholat bersama mereka di Bathha`, sementara di depan beliau ada tongkat, beliau mengerjakan sholat Zhuhur dua rakaat dan Ashar dua rakaat, dan di belakang tongkat itu lewat seorang wanita dan seekor keledai. "
            },
            {
                "number": 578,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا إِسْمَعِيلُ بْنُ أُمَيَّةَ حَدَّثَنِي أَبُو عَمْرِو بْنُ مُحَمَّدِ بْنِ حُرَيْثٍ أَنَّهُ سَمِعَ جَدَّهُ حُرَيْثًا يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ فَلْيَجْعَلْ تِلْقَاءَ وَجْهِهِ شَيْئًا فَإِنْ لَمْ يَجِدْ فَلْيَنْصِبْ عَصًا فَإِنْ لَمْ يَكُنْ مَعَهُ عَصًا فَلْيَخْطُطْ خَطًّا ثُمَّ لَا يَضُرُّهُ مَا مَرَّ أَمَامَهُحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَلِيٌّ يَعْنِي ابْنَ الْمَدِينِيِّ عَنْ سُفْيَانَ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ أَبِي مُحَمَّدِ بْنِ عَمْرِو بْنِ حُرَيْثٍ عَنْ جَدِّهِ حُرَيْثٍ رَجُلٍ مِنْ بَنِي عُذْرَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ أَبِي الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَذَكَرَ حَدِيثَ الْخَطِّ قَالَ سُفْيَانُ لَمْ نَجِدْ شَيْئًا نَشُدُّ بِهِ هَذَا الْحَدِيثَ وَلَمْ يَجِئْ إِلَّا مِنْ هَذَا الْوَجْهِ قَالَ قُلْتُ لِسُفْيَانَ إِنَّهُمْ يَخْتَلِفُونَ فِيهِ فَتَفَكَّرَ سَاعَةً ثُمَّ قَالَ مَا أَحْفَظُ إِلَّا أَبَا مُحَمَّدِ بْنَ عَمْرٍو قَالَ سُفْيَانُ قَدِمَ هَاهُنَا رَجُلٌ بَعْدَ مَا مَاتَ إِسْمَعِيلُ بْنُ أُمَيَّةَ فَطَلَبَ هَذَا الشَّيْخُ أَبَا مُحَمَّدٍ حَتَّى وَجَدَهُ فَسَأَلَهُ عَنْهُ فَخَلَطَ عَلَيْهِ قَالَ أَبُو دَاوُد و سَمِعْت أَحْمَدَ بْنَ حَنْبَلٍ سُئِلَ عَنْ وَصْفِ الْخَطِّ غَيْرَ مَرَّةٍ فَقَالَ هَكَذَا عَرْضًا مِثْلَ الْهِلَالِ قَالَ أَبُو دَاوُد و سَمِعْت مُسَدَّدًا قَالَ قَالَ ابْنُ دَاوُدَ الْخَطُّ بِالطُّولِ قَالَ أَبُو دَاوُد و سَمِعْت أَحْمَدَ بْنَ حَنْبَلٍ وَصَفَ الْخَطَّ غَيْرَ مَرَّةٍ فَقَالَ هَكَذَا يَعْنِي بِالْعَرْضِ حَوْرًا دَوْرًا مِثْلَ الْهِلَالِ يَعْنِي مُنْعَطِفًا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Bisyr bin Al-Mufadldlal] telah menceritakan kepada kami [Isma'il bin Umayyah] telah menceritakan kepadaku [Abu Amru bin Muhammad bin Huraits] bahwasanya dia telah mendengar [Kakeknya, Huraits] menceritakan kepadanya dari [Abu Hurairah] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian mengerjakan sholat, maka hendaklah dia meletakkan sesuatu di depannya. Jika dia tidak menemukan, hendaklah dia menancapkan sebuah tongkat. Jika dia tidak membawa tongkat, hendaklah dia membuat garis, kemudian tidak memudharatkannya sekalipun ada yang lewat depannya.\" Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] telah menceritakan kepada kami [Ali bin Al-Madini] dari [Sufyan] dari [Isma'il bin Umayyah] dari [Abu Muhammad bin Amru bin Huraits] dari [Kakeknya, Huraits] seorang laki-laki dari Bani 'Udzrah, dari [Abu Hurairah] dari Abul Qasim shallallahu 'alaihi wasallam, beliau bersabda: kemudian dia menyebutkan hadits tentang garis untuk sutrah. Sufyan berkata; Kami tidak mendapat satu riwayat pun yang dapat menguatkan hadits ini, dan ia tidak diriwayatkan kecuali dari sanad ini. dia berkata; Saya berkata kepada Sufyan; Sesungguhnya mereka berselisih tentangnya. Maka dia berpikir sesaat, kemudian berkata; Saya tidak hafal kecuali Abu Muhammad bin Amru. Sufyan berkata; Ada seorang laki-laki datang ke sini setelah Isma'il bin Umayyah meninggal dunia. Syaikh ini mencari Abu Muhammad hingga dia menemukannya, maka dia bertanya kepadanya tentang hadits ini, namuan hadits ini rancu atasnya. Abu Dawud berkata; Saya mendengar Ahmad bin Hanbal pernah ditanya tentang garis untuk sutrah sholat tidak hanya sekali, maka dia menjawab; Begini, dengan memanjang seperti bentuk hilal (bulan sabit). Abu Dawud berkata; Dan saya telah mendengar Musaddad berkata; Ibnu Dawud berkata; Garis untuk sutrah sholat itu memanjang. Abu Dawud berkata; Dan saya telah mendengar Ahmad bin Hanbal menyifati garis tersebut lebih dari sekali, dia berkata; Begini, yakni dengan memanjang melengkung seperti hilal. "
            },
            {
                "number": 579,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ قَالَ رَأَيْتُ شَرِيكًاصَلَّى بِنَا فِي جَنَازَةٍ الْعَصْرَ فَوَضَعَ قَلَنْسُوَتَهُ بَيْنَ يَدَيْهِ يَعْنِي فِي فَرِيضَةٍ حَضَرَتْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad Az-Zuhri] telah menceritakan kepada kami [Sufyan bin Uyainah] dia berkata; Saya pernah melihat [Syarik] sholat janazah menjadi imam kami pada waktu Ashar, lalu dia meletakkan pecinya di depannya, yakni ketika dia melaksanakan sholat wajib. "
            },
            {
                "number": 580,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَوَهْبُ بْنُ بَقِيَّةَ وَابْنُ أَبِي خَلَفٍ وَعَبْدُ اللَّهِ بْنُ سَعِيدٍ قَالَ عُثْمَانُ حَدَّثَنَا أَبُو خَالِدٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي إِلَى بَعِيرٍ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abi Syaibah] dan [Wahb bin Baqiyyah] dan [Ibnu Abi Khalaf] dan [Abdullah bin Sa'id] berkata Utsman; Telah menceritakan kepada kami [Abu Khalid] telah menceritakan kepada kami [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwasanya Nabi shallallahu 'alaihi wasallam pernah sholat dengan menghadap onta. "
            },
            {
                "number": 581,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ الدِّمَشْقِيُّ حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ حَدَّثَنَا أَبُو عُبَيْدَةَ الْوَلِيدُ بْنُ كَامِلٍ عَنْ الْمُهَلَّبِ بْنِ حُجْرٍ الْبَهْرَانِيِّ عَنْ ضُبَاعَةَ بِنْتِ الْمِقْدَادِ بْنِ الْأَسْوَدِ عَنْ أَبِيهَا قَالَمَا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي إِلَى عُودٍ وَلَا عَمُودٍ وَلَا شَجَرَةٍ إِلَّا جَعَلَهُ عَلَى حَاجِبِهِ الْأَيْمَنِ أَوْ الْأَيْسَرِ وَلَا يَصْمُدُ لَهُ صَمْدًا",
                "id": "Telah menceritakan kepada kami [Mahmud bin Khalid Ad-Dimasyqi] telah menceritakan kepada kami [Ali bin 'Ayyasy] telah menceritakan kepada kami [Abu Ubaidah Al-Walid bin Kamil] dari [Al-Muhallab bin Hujr Al-Bahrani] dari [Dluba'ah binti Al-Miqdad bin Al-Aswad] dari [Ayahnya] dia berkata; Saya tidak pernah melihat Rasulullah shallallahu 'alaihi wasallam sholat menghadap kayu, tiang, dan tidak pula pohon, kecuali beliau menjadikannya di depan sebelah kanannya atau kirinya, dan beliau tidak menghadapnya. "
            },
            {
                "number": 582,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ مُحَمَّدِ بْنِ أَيْمَنَ عَنْ عَبْدِ اللَّهِ بْنِ يَعْقُوبَ بْنِ إِسْحَقَ عَمَّنْ حَدَّثَهُ عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ قَالَ قُلْتُ لَهُ يَعْنِي لِعُمَرَ بْنِ عَبْدِ الْعَزِيزِ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُصَلُّوا خَلْفَ النَّائِمِ وَلَا الْمُتَحَدِّثِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al-Qa'nabi] telah menceritakan kepada kami [Abdul Malik bin Muhammad bin Aiman] dari [Abdullah bin Ya'qub bin Ishaq] dari [orang yang telah menceritakan kepadanya] dari [Muhammad bin Ka'ab Al-Qurazhi] dia berkata; Saya katakan kepada Umar bin Abdul Aziz bahwa [Abdullah bin Abbas] telah menceritakan kepadaku, bahwasanya Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian sholat di belakang orang yang sedang tidur atau orang yang sedang berhadats.\""
            },
            {
                "number": 583,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ بْنِ سُفْيَانَ أَخْبَرَنَا سُفْيَانُ ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَحَامِدُ بْنُ يَحْيَى وَابْنُ السَّرْحِ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ إِلَى سُتْرَةٍ فَلْيَدْنُ مِنْهَا لَا يَقْطَعْ الشَّيْطَانُ عَلَيْهِ صَلَاتَهُقَالَ أَبُو دَاوُد رَوَاهُ وَاقِدُ بْنُ مُحَمَّدٍ عَنْ صَفْوَانَ عَنْ مُحَمَّدِ بْنِ سَهْلٍ عَنْ أَبِيهِ أَوْ عَنْ مُحَمَّدِ بْنِ سَهْلٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَعْضُهُمْ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ سَهْلِ بْنِ سَعْدٍ وَاخْتُلِفَ فِي إِسْنَادِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash-Shabbah bin Sufyan] telah mengabarkan kepada kami [Sufyan] -dari jalur lain- Dan telah menceritakan kepada kami [Utsman bin Abi Syaibah] dan [Hamid bin Yahya] dan [Ibnu As-Sarj] mereka berkata; Telah menceritakan kepada kami [Sufyan] dari [Shafwan bin Sulaim] dari [Nafi' bin Jubair] dari [Sahl bin Abi Hatsmah] yang menyampaikan haditsnya kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila salah seorang di antara kalian sholat dengan sutrah, hendaklah dia mendekat darinya hingga setan tidak dapat memutus sholatnya.\" Abu Dawud berkata; Hadits ini diriwayatkan oleh [Waqid bin Muhammad] dari [Shafwan] dari [Muhammad bin Sahl] dari [Ayahnya] atau dari [Muhammad bin Sahl] dari Nabi shallallahu 'alaihi wasallam, sebagian mereka berkata dari [Nafi' bin Jubair] dari [Sahl bin Sa'ad] dan sanadnya diperselisihkan."
            },
            {
                "number": 584,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ وَالنُّفَيْلِيُّ قَالَا حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ قَالَ أَخْبَرَنِي أَبِي عَنْ سَهْلٍ قَالَوَكَانَ بَيْنَ مَقَامِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَيْنَ الْقِبْلَةِ مَمَرُّ عَنْزٍقَالَ أَبُو دَاوُد الْخَبَرُ لِلنُّفَيْلِيِّ",
                "id": "Telah menceritakan kepada kami [Al-Qa'nabi] dan [An-Nufaili] mereka berdua berkata; Telah menceritakan kepada kami [Abdul Aziz bin Abu Hazim] dia berkata; Telah mengabarkan kepadaku [Ayahku] dari [Sahl] dia berkata; Jarak antara tempat berdiri Nabi shallallahu 'alaihi wasallam dan antara kiblat adalah sekitar tempat lewat domba. Abu Dawud berkata; Hadits ini adalah riwayat An-Nufaili. "
            },
            {
                "number": 585,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا كَانَ أَحَدُكُمْ يُصَلِّي فَلَا يَدَعْ أَحَدًا يَمُرُّ بَيْنَ يَدَيْهِ وَلْيَدْرَأْهُ مَا اسْتَطَاعَ فَإِنْ أَبَى فَلْيُقَاتِلْهُ فَإِنَّمَا هُوَ شَيْطَانٌحَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو خَالِدٍ عَنْ ابْنِ عَجْلَانَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِيهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى أَحَدُكُمْ فَلْيُصَلِّ إِلَى سُتْرَةٍ وَلْيَدْنُ مِنْهَا ثُمَّ سَاقَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Al-Qa'nabi] dari [Malik] dari [Zaid bin Aslam] dari [Abdurrahman bin Abi Sa'id Al-Khudri] dari [Abu Sa'id Al-Khudri] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian mengerjakan sholat, maka janganlah dia membiarkan orang lewat di depannya, dan hendaklah dia mencegahnya semampunya. Jika dia menolak, maka lawanlah, sesungguhnya dia itu setan.\" Telah menceritakan kepada kami [Muhammad bin Al-'Ala`] telah menceritakan kepada kami [Abu Khalid] dari [Ibnu 'Ajlan] dari [Zaid bin Aslam] dari [Abdurrahman bin Abu Sa'id Al-Khudri] dari [Ayahnya] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian sholat, maka hendaklah dia menghadap sutrah dan mendekatlah padanya\", kemudian dia melanjutkan hadits itu secara makna. "
            },
            {
                "number": 586,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي سُرَيْجٍ الرَّازِيُّ أَخْبَرَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ أَخْبَرَنَا مَسَرَّةُ بْنُ مَعْبَدٍ اللَّخْمِيُّ لَقِيتُهُ بِالْكُوفَةِ قَالَ حَدَّثَنِي أَبُو عُبَيْدٍ حَاجِبُ سُلَيْمَانَ قَالَ رَأَيْتُ عَطَاءَ بْنَ زَيْدٍ اللَّيْثِيَّقَائِمًا يُصَلِّي فَذَهَبْتُ أَمُرُّ بَيْنَ يَدَيْهِ فَرَدَّنِي ثُمَّ قَالَ حَدَّثَنِي أَبُو سَعِيدٍ الْخُدْرِيُّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اسْتَطَاعَ مِنْكُمْ أَنْ لَا يَحُولَ بَيْنَهُ وَبَيْنَ قِبْلَتِهِ أَحَدٌ فَلْيَفْعَلْ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abi Suraij Ar-Razi] telah mengabarkan kepada kami [Abu Ahmad Az-Zubairi] telah mengabarkan kepada kami [Masarrah bin Ma'bad Al-Lakhmi] Saya bertemu dengannya di Kufah, dia berkata; Telah menceritakan kepadaku [Abu Ubaid, seorang penjaga Sulaiman] dia berkata; Saya pernah melihat ['Atha' bin Zaid Al Laitsi] sedang berdiri sholat. Saya lewat di depannya, lalu beliau mencegahku. Setelah selesai sholat dia berkata; Telah menceritakan kepadaku [Abu Sa'id Al-Khudri] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa di antara kalian yang sanggup supaya seseorang tidak dapat lewat antara dia dengan kiblatnya, maka kerjakanlah.\""
            },
            {
                "number": 587,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ الْمُغِيرَةِ عَنْ حُمَيْدٍ يَعْنِي ابْنَ هِلَالٍ قَالَ قَالَ أَبُو صَالِحٍأُحَدِّثُكَ عَمَّا رَأَيْتُ مِنْ أَبِي سَعِيدٍ وَسَمِعْتُهُ مِنْهُ دَخَلَ أَبُو سَعِيدٍ عَلَى مَرْوَانَ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا صَلَّى أَحَدُكُمْ إِلَى شَيْءٍ يَسْتُرُهُ مِنْ النَّاسِ فَأَرَادَ أَحَدٌ أَنْ يَجْتَازَ بَيْنَ يَدَيْهِ فَلْيَدْفَعْ فِي نَحْرِهِ فَإِنْ أَبَى فَلْيُقَاتِلْهُ فَإِنَّمَا هُوَ الشَّيْطَانُقَالَ أَبُو دَاوُد قَالَ سُفْيَانُ الثَّوْرِيُّ يَمُرُّ الرَّجُلُ يَتَبَخْتَرُ بَيْنَ يَدَيَّ وَأَنَا أُصَلِّي فَأَمْنَعُهُ وَيَمُرُّ الضَّعِيفُ فَلَا أَمْنَعُهُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Sulaiman bin Al-Mughirah] dari [Humaid bin Hilal] dia berkata; [Abu Shalih] berkata; Saya ceritakan kepadamu dari apa yang telah saya lihat dari [Abu Sa'id] dan saya dengar darinya. Abu Sa'id pernah berkuinjung kepada Marwan lalu berkata; Saya telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian mengerjakan sholat dengan bersutrahkan sesuatu, lalu ada seseorang yang hendak lewat di depannya, maka cegahlah (doronglah) dadanya, apabila dia enggan, maka lawanlah, karena sesungguhnya ia itu setan.\" Abu Dawud berkata; Sufyan Ats-Tsauri berkata; Pernah ada seorang laki-laki lewat di depanku dengan sombong, sementara saya sedang sholat, maka saya mencegahnya. Kemudian ada orang lemah lewat di depanku, maka saya tidak mencegahnya. "
            },
            {
                "number": 588,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي النَّضْرِ مَوْلَى عُمَرَ بْنِ عُبَيْدِ اللَّهِ عَنْ بُسْرِ بْنِ سَعِيدٍأَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ أَرْسَلَهُ إِلَى أَبِي جُهَيْمٍ يَسْأَلُهُ مَاذَا سَمِعَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَارِّ بَيْنَ يَدَيْ الْمُصَلِّي فَقَالَ أَبُو جُهَيْمٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ يَعْلَمُ الْمَارُّ بَيْنَ يَدَيْ الْمُصَلِّي مَاذَا عَلَيْهِ لَكَانَ أَنْ يَقِفَ أَرْبَعِينَ خَيْرٌ لَهُ مِنْ أَنْ يَمُرَّ بَيْنَ يَدَيْهِ قَالَ أَبُو النَّضْرِ لَا أَدْرِي قَالَ أَرْبَعِينَ يَوْمًا أَوْ شَهْرًا أَوْ سَنَةً",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abu Nadlr bekas budak Umar bin Ubaidillah] dari [Busr bin Sa'id] bahwa Zaid bin Khalid Al Juhani mengirinya menemui Abu Juhaim untuk menanyakan sesuatu yang pernah dia dengar dari Rasulullah shallallahu 'alaihi wasallam mengenai seseorang yang lewat di depan orang yang sholat, maka [Abu Juhaim] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya orang yang lewat di depan orang yang sholat mengetahui (dosa) yang akan di pikulnya, niscaya lebih baik baginya berdiri yang lamanya selama empat puluh, daripada lewat di depan orang yang sholat.\" Abu Nadlr berkata; \"Aku tidak tahu apakah yang di maksud empat puluh hari atau empat puluh bulan atau empat puluh tahun.\""
            }
        ]
    }
}