{
    "status": true,
    "data": {
        "start": 1030,
        "end": 1176,
        "total": 147,
        "book": "abu-daud",
        "hadits": [
            {
                "number": 1030,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَابْنُ الْمُثَنَّى وَهَذَا لَفْظُ ابْنِ الْمُثَنَّى قَالَا حَدَّثَنَا أَبُو أُسَامَةَ قَالَ ابْنُ الْمُثَنَّى قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عُمَرَ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّ عَلِيًّا رَضِيَ اللَّهُ عَنْهُكَانَ إِذَا سَافَرَ سَارَ بَعْدَ مَا تَغْرُبُ الشَّمْسُ حَتَّى تَكَادَ أَنْ تُظْلِمَ ثُمَّ يَنْزِلُ فَيُصَلِّي الْمَغْرِبَ ثُمَّ يَدْعُوا بِعَشَائِهِ فَيَتَعَشَّى ثُمَّ يُصَلِّي الْعِشَاءَ ثُمَّ يَرْتَحِلُ وَيَقُولُ هَكَذَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُقَالَ عُثْمَانُ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عُمَرَ بْنِ عَلِيٍّ سَمِعْت أَبَا دَاوُد يَقُولُ وَرَوَى أُسَامَةُ بْنُ زَيْدٍ عَنْ حَفْصِ بْنِ عُبَيْدِ اللَّهِ يَعْنِي ابْنَ أَنَسِ بْنِ مَالِكٍ أَنَّ أَنَسًا كَانَ يَجْمَعُ بَيْنَهُمَا حِينَ يَغِيبُ الشَّفَقُ وَيَقُولُ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ ذَلِكَ وَرِوَايَةُ الزُّهْرِيِّ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلُهُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Ibnu Al Mutsanna] dan lafadz hadits ini dari Ibnul Mutsanna, keduanya berkata; telah menceritakan kepada kami [Abu Usamah], Ibnu Al Mutsanna mengatakan; telah mengabarkan kepadaku [Abdullah bin Muhammad bin Umar bin Ali bin Abu Thalib] dari [ayahnya] dari [kakeknya] bahwa apabila [Ali radliallahu 'anhu] bepergian, dia berangkat setelah matahari terbenam, hingga apabila hampir gelap, dia singgah lalu mengerjakan sholat Maghrib kemudian melakukan makan malam, setelah itu dia mengerjakan sholat Isya'. Lalu dia melanjutkan perjalanannya, katanya; \"Seperti inilah Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan.\" [Utsman] berkata; dari [Abdullah bin Muhammad bin Umar bin Ali]. Aku mendengar Abu Daud berkata; [Usamah bin Zaid] meriwayatkan, dari [Hafsh bin ubaidhullah yaitu Ibnu Anas bin Malik] bahwa [Anas] pernah menjama' keduanya ketika mega merah telah hilang, dia berkata; \"Nabi shallallahu 'alaihi wasallam juga pernah melakukan hal itu.\" Sedangkan riwayatnya [Az Zuhri] dari [Anas] dari Nabi shallallahu 'alaihi wasallam juga seperti hadits di atas.\""
            },
            {
                "number": 1031,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَأَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِتَبُوكَ عِشْرِينَ يَوْمًا يَقْصُرُ الصَّلَاةَقَالَ أَبُو دَاوُد غَيْرُ مَعْمَرٍ يُرْسِلُهُ لَا يُسْنِدُهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Yahya bin Abu Katsir] dari [Muhammad bin Abdurrahman bin Tsauban] dari [Jabir bin Abdullah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah bermukim di Tabuk selama dua puluh hari, dan selalu mengqashar sholat.\" Abu Daud mengatakan; \"selain Ma'mar, memursalkan hadits ini, dan sanadnya tidak bersambung.\""
            },
            {
                "number": 1032,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ أَبِي عَيَّاشٍ الزُّرَقِيِّ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعُسْفَانَ وَعَلَى الْمُشْرِكِينَ خَالِدُ بْنُ الْوَلِيدِ فَصَلَّيْنَا الظُّهْرَ فَقَالَ الْمُشْرِكُونَ لَقَدْ أَصَبْنَا غِرَّةً لَقَدْ أَصَبْنَا غَفْلَةً لَوْ كُنَّا حَمَلْنَا عَلَيْهِمْ وَهُمْ فِي الصَّلَاةِ فَنَزَلَتْ آيَةُ الْقَصْرِ بَيْنَ الظُّهْرِ وَالْعَصْرِ فَلَمَّا حَضَرَتْ الْعَصْرُ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُسْتَقْبِلَ الْقِبْلَةِ وَالْمُشْرِكُونَ أَمَامَهُ فَصَفَّ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَفٌّ وَصَفَّ بَعْدَ ذَلِكَ الصَّفِّ صَفٌّ آخَرُ فَرَكَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَكَعُوا جَمِيعًا ثُمَّ سَجَدَ وَسَجَدَ الصَّفُّ الَّذِينَ يَلُونَهُ وَقَامَ الْآخَرُونَ يَحْرُسُونَهُمْ فَلَمَّا صَلَّى هَؤُلَاءِ السَّجْدَتَيْنِ وَقَامُوا سَجَدَ الْآخَرُونَ الَّذِينَ كَانُوا خَلْفَهُمْ ثُمَّ تَأَخَّرَ الصَّفُّ الَّذِي يَلِيهِ إِلَى مَقَامِ الْآخَرِينَ وَتَقَدَّمَ الصَّفُّ الْأَخِيرُ إِلَى مَقَامِ الصَّفِّ الْأَوَّلِ ثُمَّ رَكَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَكَعُوا جَمِيعًا ثُمَّ سَجَدَ وَسَجَدَ الصَّفُّ الَّذِي يَلِيهِ وَقَامَ الْآخَرُونَ يَحْرُسُونَهُمْ فَلَمَّا جَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالصَّفُّ الَّذِي يَلِيهِ سَجَدَ الْآخَرُونَ ثُمَّ جَلَسُوا جَمِيعًا فَسَلَّمَ عَلَيْهِمْ جَمِيعًا فَصَلَّاهَا بِعُسْفَانَ وَصَلَّاهَا يَوْمَ بَنِي سُلَيْمٍقَالَ أَبُو دَاوُد رَوَى أَيُّوبُ وَهِشَامٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ هَذَا الْمَعْنَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَذَلِكَ رَوَاهُ دَاوُدُ بْنُ حُصَيْنٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ وَكَذَلِكَ عَبْدُ الْمَلِكِ عَنْ عَطَاءٍ عَنْ جَابِرٍ وَكَذَلِكَ قَتَادَةُ عَنْ الْحَسَنِ عَنْ حِطَّانَ عَنْ أَبِي مُوسَى فِعْلَهُ وَكَذَلِكَ عِكْرِمَةُ بْنُ خَالِدٍ عَنْ مُجَاهِدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَذَلِكَ هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ قَوْلُ الثَّوْرِيِّ",
                "id": "telah menceritakan kepada kami [Sa'id bin Manshur] telah menceritakan kepada kami [Jarir bin Abdul Hamid] dari [Manshur] dari [Mujahid] dari [Abu 'Ayasy Az Zuraqi] dia berkata; kami bersama Rasulullah shallallahu 'alaihi wasallam di Usfan, sedangkan waktu itu, kaum Musyrikin berada di bawah komando Khalid bin Walid. lalu kami mengerjakan sholat Dluhur, maka orang-orang Musyrik berkata; \"Sungguh kita telah lengah, kita telah lalai. (Alangkah baiknya) sekiranya kita serang mereka ketika mereka tengah mengerjakan sholat.\" lalu turunlah ayat untuk mengqashar sholat antara Dluhur dengan Ashar, ketika waktu Ashar telah tiba, Rasulullah shallallahu 'alaihi wasallam berdiri menghadap ke kiblat, sedangkan orang-orang musyrik berada di hadapannya, sementara satu shaf berbaris di belakang beliau, kemudian ada juga di belakangnya satu shaf lagi, lalu Rasulullah shallallahu 'alaihi wasallam ruku', mereka juga ikut ruku', lalu beliau sujud, dan shaf di belakang beliau juga sujud, sementara shaf berikutnya masih tetap berdiri untuk berjaga-jaga. Setelah shaf pertama selesai sujud dua kali dan berdiri, barulah shaf yang berikutnya (shaf kedua) sujud. Setelah itu, shaf yang ada di belakang beliau (shaf pertama) mundur menempati shaf yang lain (shaf kedua), sedangkan shaf yang kedua maju ke depan menempati shaf pertama, kemudian Rasulullah shallallahu 'alaihi wasallam ruku', mereka semuanya juga ikut ruku', lalu sujud dan shaf yang berada di belakang beliau ikut sujud, sedangkan shaf yang belakangnya (shaf kedua) tetap berdiri berjaga-jaga. Ketika Rasulullah shallallahu 'alaihi wasallam duduk, maka shaf kedua sujud, kemudian mereka semuanya duduk, lalu beliau memberi salam dan mereka pun salam. Cara sholat seperti ini di kerjakan di daerah Usfan, dan juga pernah di kerjakan di Bani Sulaim. ' Abu Daud berkata; [Ayyub] dan [Hisyam] meriwayatkan dari [Abu Az Zubair] dari [Jabir] dengan makna seperti ini dari Nabi shallallahu 'alaihi wasallam, begitu juga [Daud bin Hushain] meriwayatkan dari ['Ikrimah] dari [Ibnu Abbas], begitu juga [Abdul Malik] dari ['Atha`] dari [Jabir]. Begitu juga dengan [Qatadah] dari [Al Hasan] dari [Hithan] dari [Abu Musa] juga pernah mengerjakan seperti itu, begitu juga [Ikrimah bin Khalid] dari [Mujahid] dari Nabi shallallahu 'alaihi wasallam, begitu juga [Hisyam bin 'Urwah] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam, dan itu merupakan perkataan Ats Tsauri \""
            },
            {
                "number": 1033,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ صَالِحِ بْنِ خَوَّاتٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِأَصْحَابِهِ فِي خَوْفٍ فَجَعَلَهُمْ خَلْفَهُ صَفَّيْنِ فَصَلَّى بِالَّذِينَ يَلُونَهُ رَكْعَةً ثُمَّ قَامَ فَلَمْ يَزَلْ قَائِمًا حَتَّى صَلَّى الَّذِينَ خَلْفَهُمْ رَكْعَةً ثُمَّ تَقَدَّمُوا وَتَأَخَّرَ الَّذِينَ كَانُوا قُدَّامَهُمْ فَصَلَّى بِهِمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَةً ثُمَّ قَعَدَ حَتَّى صَلَّى الَّذِينَ تَخَلَّفُوا رَكْعَةً ثُمَّ سَلَّمَ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari [Abdurrahman bin Al Qasim] dari [ayahnya] dari [Shalih bin Khawwat] dari [Sahl bin Abu Hatsmah] bahwa Nabi shallallahu 'alaihi wasallam pernah mengerjakan sholat khauf bersama para sahabatnya, beliau menjadikan mereka dua shaf di belakangnya, lalu beliau mengerjakan sholat dengan shaf yang ada di belakang beliau satu raka'at, kemudian berdiri. Beliau tetap dalam posisi berdiri sehingga orang-orang yang berada di shaf kedua sholat satu raka'at, setelah itu mereka maju ke depan, sedangkan shaf pertama mundur ke belakang, lalu Nabi shallallahu 'alaihi wasallam sholat bersama mereka satu raka'at, kemudian beliau duduk (sambil menanti) sehingga orang-orang yang tertinggal (di shaf ke dua) menyelesaikan satu raka'at yang tertinggal, kemudian beliau salam.\""
            },
            {
                "number": 1034,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ يَزِيدَ بْنِ رُومَانَ عَنْ صَالِحِ بْنِ خَوَّاتٍ عَمَّنْصَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ ذَاتِ الرِّقَاعِ صَلَاةَ الْخَوْفِ أَنَّ طَائِفَةً صَفَّتْ مَعَهُ وَطَائِفَةً وِجَاهَ الْعَدُوِّ فَصَلَّى بِالَّتِي مَعَهُ رَكْعَةً ثُمَّ ثَبَتَ قَائِمًا وَأَتَمُّوا لِأَنْفُسِهِمْ ثُمَّ انْصَرَفُوا وَصَفُّوا وِجَاهَ الْعَدُوِّ وَجَاءَتْ الطَّائِفَةُ الْأُخْرَى فَصَلَّى بِهِمْ الرَّكْعَةَ الَّتِي بَقِيَتْ مِنْ صَلَاتِهِ ثُمَّ ثَبَتَ جَالِسًا وَأَتَمُّوا لِأَنْفُسِهِمْ ثُمَّ سَلَّمَ بِهِمْقَالَ مَالِكٌ وَحَدِيثُ يَزِيدَ بْنِ رُومَانَ أَحَبُّ مَا سَمِعْتُ إِلَيَّ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Yazid bin Ruman] dari [Shalih bin Khuwwat] dari [orang] yang pernah mengerjakan sholat khauf bersama Rasulullah shallallahu 'alaihi wasallam pada waktu Perang Dzatur Riqa', yaitu; bahwa satu shaf berbaris bersama beliau, sedangkan shaf yang lain (berjaga-jaga) menghadapi musuh, kemudian orang-orang yang bersama beliau sholat satu raka'at, kemudian beliau tetap dalam kondisi berdiri, sedangkan mereka menyempurnakan satu raka'at sendiri-sendiri, setelah itu mereka beranjak pergi dan berbaris (berjaga-jaga) menghadapi musuh. Setelah itu, kelompok yang lain datang dan sholat bersama beliau satu raka'at dari sisa satu raka'at beliau, kemudian beliau tetap dalam duduk (menunggu), sedangkan mereka menyempurnakan sholat (satu raka'at) sendiri-sendiri, lalu beliau salam bersama mereka.\" Malik berkata; sedangkan haditsnya Yazid bin Ruman lebih aku sukai dari apa yang pernah aku dengar.\""
            },
            {
                "number": 1035,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ صَالِحِ بْنِ خَوَّاتٍ الْأَنْصَارِيِّ أَنَّ سَهْلَ بْنَ أَبِي حَثْمَةَ الْأَنْصَارِيَّ حَدَّثَهُأَنَّ صَلَاةَ الْخَوْفِ أَنْ يَقُومَ الْإِمَامُ وَطَائِفَةٌ مِنْ أَصْحَابِهِ وَطَائِفَةٌ مُوَاجِهَةُ الْعَدُوِّ فَيَرْكَعُ الْإِمَامُ رَكْعَةً وَيَسْجُدُ بِالَّذِينَ مَعَهُ ثُمَّ يَقُومُ فَإِذَا اسْتَوَى قَائِمًا ثَبَتَ قَائِمًا وَأَتَمُّوا لِأَنْفُسِهِمْ الرَّكْعَةَ الْبَاقِيَةَ ثُمَّ سَلَّمُوا وَانْصَرَفُوا وَالْإِمَامُ قَائِمٌ فَكَانُوا وِجَاهَ الْعَدُوِّ ثُمَّ يُقْبِلُ الْآخَرُونَ الَّذِينَ لَمْ يُصَلُّوا فَيُكَبِّرُونَ وَرَاءَ الْإِمَامِ فَيَرْكَعُ بِهِمْ وَيَسْجُدُ بِهِمْ ثُمَّ يُسَلِّمُ فَيَقُومُونَ فَيَرْكَعُونَ لِأَنْفُسِهِمْ الرَّكْعَةَ الْبَاقِيَةَ ثُمَّ يُسَلِّمُونَقَالَ أَبُو دَاوُد وَأَمَّا رِوَايَةُ يَحْيَى بْنِ سَعِيدٍ عَنْ الْقَاسِمِ نَحْوَ رِوَايَةِ يَزِيدَ بْنِ رُومَانَ إِلَّا أَنَّهُ خَالَفَهُ فِي السَّلَامِ وَرِوَايَةُ عُبَيْدِ اللَّهِ نَحْوَ رِوَايَةِ يَحْيَى بْنِ سَعِيدٍ قَالَ وَيَثْبُتُ قَائِمًا",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Yahya bin Sa'id] dari [Al Qasim bin Muhammad] dari [Shalih bin Khuwwat Al Anshari] bahwa [Sahl bin Abu Hatsmah Al Anshari] telah menceritakan kepadanya, bahwa sholat khauf itu adalah; \"Imam berdiri bersama satu kelompok sahabatnya, sedangkan satu kelompok yang lainnya menghadap ke arah musuh. Lalu imam ruku' dan sujud bersama kelompok yang menyertainya, lalu berdiri. Apabila telah berdiri tegak, imam tetap berdiri, sedangkan kelompok yang bersamanya menyempurnakan satu raka'at yang tersisa sendiri-sendiri, lalu mereka salam dan beranjak pergi, sedangkan imam masih dalam posisi berdiri, sementara mereka pergi berjaga-jaga menghadapi musuh. Kemudian kelompok yang lain, yang belum sholat datang dan bertakbir di belakang imam. Imam ruku' dan sujud bersama mereka, kemudian imam salam, sementara mereka berdiri dan melanjutkan raka'at yang sisa, lalu mereka salam.\" Abu Daud berkata; adapun riwayat Yahya bin Sa'id dari Al Qasim seperti riwayat Yazid bin Ruman, namun riwayatnya sedikit berbeda ketika salam, sedangkan riwayatnya 'ubaidhullah seperti riwayatnya Yahya bin Sa'id, katanya; \"Imam tetap berdiri.\""
            },
            {
                "number": 1036,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ حَدَّثَنَا حَيْوَةُ وَابْنُ لَهِيعَةَ قَالَا أَخْبَرَنَا أَبُو الْأَسْوَدِ أَنَّهُ سَمِعَ عُرْوَةَ بْنَ الزُّبَيْرِ يُحَدِّثُ عَنْ مَرْوَانَ بْنِ الْحَكَمِأَنَّهُ سَأَلَ أَبَا هُرَيْرَةَ هَلْ صَلَّيْتَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ قَالَ أَبُو هُرَيْرَةَ نَعَمْ قَالَ مَرْوَانُ مَتَى فَقَالَ أَبُو هُرَيْرَةَ عَامَ غَزْوَةِ نَجْدٍ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى صَلَاةِ الْعَصْرِ فَقَامَتْ مَعَهُ طَائِفَةٌ وَطَائِفَةٌ أُخْرَى مُقَابِلَ الْعَدُوِّ وَظُهُورُهُمْ إِلَى الْقِبْلَةِ فَكَبَّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَبَّرُوا جَمِيعًا الَّذِينَ مَعَهُ وَالَّذِينَ مُقَابِلِي الْعَدُوِّ ثُمَّ رَكَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَةً وَاحِدَةً وَرَكَعَتْ الطَّائِفَةُ الَّتِي مَعَهُ ثُمَّ سَجَدَ فَسَجَدَتْ الطَّائِفَةُ الَّتِي تَلِيهِ وَالْآخَرُونَ قِيَامٌ مُقَابِلِي الْعَدُوِّ ثُمَّ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَامَتْ الطَّائِفَةُ الَّتِي مَعَهُ فَذَهَبُوا إِلَى الْعَدُوِّ فَقَابَلُوهُمْ وَأَقْبَلَتْ الطَّائِفَةُ الَّتِي كَانَتْ مُقَابِلِي الْعَدُوِّ فَرَكَعُوا وَسَجَدُوا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمٌ كَمَا هُوَ ثُمَّ قَامُوا فَرَكَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَةً أُخْرَى وَرَكَعُوا مَعَهُ وَسَجَدَ وَسَجَدُوا مَعَهُ ثُمَّ أَقْبَلَتْ الطَّائِفَةُ الَّتِي كَانَتْ مُقَابِلِي الْعَدُوِّ فَرَكَعُوا وَسَجَدُوا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَاعِدٌ وَمَنْ كَانَ مَعَهُ ثُمَّ كَانَ السَّلَامُ فَسَلَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَلَّمُوا جَمِيعًا فَكَانَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَانِ وَلِكُلِّ رَجُلٍ مِنْ الطَّائِفَتَيْنِ رَكْعَةٌ رَكْعَةٌحَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو الرَّازِيُّ حَدَّثَنَا سَلَمَةُ حَدَّثَنِي مُحَمَّدُ بْنُ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ وَمُحَمَّدِ بْنِ الْأَسْوَدِ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ أَبِي هُرَيْرَةَ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى نَجْدٍ حَتَّى إِذَا كُنَّا بِذَاتِ الرِّقَاعِ مِنْ نَخْلٍ لَقِيَ جَمْعًا مِنْ غَطَفَانَ فَذَكَرَ مَعْنَاهُ وَلَفْظُهُ عَلَى غَيْرِ لَفْظِ حَيْوَةَ وَقَالَ فِيهِ حِينَ رَكَعَ بِمَنْ مَعَهُ وَسَجَدَ قَالَ فَلَمَّا قَامُوا مَشَوْا الْقَهْقَرَى إِلَى مَصَافِّ أَصْحَابِهِمْ وَلَمْ يَذْكُرْ اسْتِدْبَارَ الْقِبْلَةِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Abu Abdurrahman Al Muqri`i] telah menceritakan kepada kami [Haiwah] dan [Ibnu Lahi'ah] keduanya berkata; telah mengabarkan kepada kami [Abu Al Aswad] bahwa dia mendengar ['Urwah bin Az Zubair] bercerita dari [Marwan bin Hakam] bahwa dia bertanya kepada [Abu Hurairah]; \"Apakah kamu pernah sholat khauf bersama Rasulullah shallallahu 'alaihi wasallam?\" Abu Hurairah menjawab; \"Ya, pernah.\" Marwan bertanya; \"Kapan?\" Abu Hurairah menjawab; \"Ketika memerangi Bani Najd, Rasulullah shallallahu 'alaihi wasallam hendak mengerjakan sholat Ashar, lalu sekelompok orang berdiri (sholat) bersama beliau, sedangkan kelompok yang lain menghadap ke arah musuh membelakangi Kiblat. Rasulullah shallallahu 'alaihi wasallam bertakbir, lalu mereka juga ikut bertakbir, baik yang bersama beliau atau kelompok yang menghadap musuh. Setelah itu, Rasulullah shallallahu 'alaihi wasallam ruku' sekali bersama dengan kelompok yang menyertai beliau, lalu beliau sujud dan sujud pula orang yang menyertai beliau, sementara kelompok yang lain tetap berdiri menghadap ke arah musuh. Selanjutnya Rasulullah shallallahu 'alaihi wasallam berdiri, begitu juga kelompok yang menyertai beliau, kemudian kelompok ini pindah, menggantikan kelompok yang menghadapi musuh, sedangkan kelompok yang menghadapi musuh pindah ke belakang beliau untuk mengerjakan ruku' dan sujud sendiri-sendiri. Sedangkan Rasulullah shallallahu 'alaihi wasallam tetap berdiri menunggu sampai mereka berdiri pula. Setelah itu Rasulullah shallallahu 'alaihi wasallam ruku' (untuk raka'at kedua), lalu mereka ruku' bersama beliau, beliau sujud, mereka pun ikut sujud. Lalu kelompok yang menghadapi musuh datang, mereka ruku' dan sujud sendiri, sedangkan Rasulullah shallallahu 'alaihi wasallam tetap duduk menunggu bersama kelompok yang menyertai beliau tadi, setelah itu, baru tiba waktu salam. Maka Rasulullah shallallahu 'alaihi wasallam salam dan mereka semuanya pun salam. Maka bagi Rasulullah shallallahu 'alaihi wasallam dua rala'at, sedangkan bagi masing-masing mereka satu raka'at.\" Telah menceritakan kepada kami [Muhammad bin 'Amru Ar Razi] telah menceritakan kepada kami [Salamah] telah menceritakan kepadaku [Muhammad bin Ishaq] dari [Muhammad bin Ja'far bin Zubair] dan [Muhammad bin Al Aswad] dari ['Urwah bin Az Zubair] dari [Abu Hurairah] dua berkata; \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam menuju daerah Najd, hingga ketika kami sampai di perkebunan kurma Dzatur Riqa', beliau bertemu dengan sekelompok orang Bani Ghathafan…' kemudian dia menyebutkan makna dan lafadz hadits ini, tidak seperti lafadz hadits sebelumnya. Dalam hadits tersebut, dia berkata; \"…Ketika beliau ruku' dam sujud bersama orang-orang yang berada di belakang beliau. selanjutnya Perawi berkata; \"Setelah mereka berdiri, lalu berjalan mundur ke barisan sahabat mereka.\" dalam hadits ini tidak di sebutkan \"membelakangi Kiblat.\""
            },
            {
                "number": 1037,
                "arab": "قَالَ أَبُو دَاوُد وَأَمَّا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ فَحَدَّثَنَا قَالَ حَدَّثَنِي عَمِّي حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرِ بْنِ الزُّبَيْرِ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ حَدَّثَهُ أَنَّ عَائِشَةَ حَدَّثَتْهُ بِهَذِهِ الْقِصَّةِ قَالَتْكَبَّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَبَّرَتْ الطَّائِفَةُ الَّذِينَ صَفُّوا مَعَهُ ثُمَّ رَكَعَ فَرَكَعُوا ثُمَّ سَجَدَ فَسَجَدُوا ثُمَّ رَفَعَ فَرَفَعُوا ثُمَّ مَكَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسًا ثُمَّ سَجَدُوا لِأَنْفُسِهِمْ الثَّانِيَةَ ثُمَّ قَامُوا فَنَكَصُوا عَلَى أَعْقَابِهِمْ يَمْشُونَ الْقَهْقَرَى حَتَّى قَامُوا مِنْ وَرَائِهِمْ وَجَاءَتْ الطَّائِفَةُ الْأُخْرَى فَقَامُوا فَكَبَّرُوا ثُمَّ رَكَعُوا لِأَنْفُسِهِمْ ثُمَّ سَجَدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَجَدُوا مَعَهُ ثُمَّ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَجَدُوا لِأَنْفُسِهِمْ الثَّانِيَةَ ثُمَّ قَامَتْ الطَّائِفَتَانِ جَمِيعًا فَصَلَّوْا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَكَعَ فَرَكَعُوا ثُمَّ سَجَدَ فَسَجَدُوا جَمِيعًا ثُمَّ عَادَ فَسَجَدَ الثَّانِيَةَ وَسَجَدُوا مَعَهُ سَرِيعًا كَأَسْرَعِ الْإِسْرَاعِ جَاهِدًا لَا يَأْلُونَ سِرَاعًا ثُمَّ سَلَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَلَّمُوا فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ شَارَكَهُ النَّاسُ فِي الصَّلَاةِ كُلِّهَا",
                "id": "Abu Daud berkata; telah menceritakan kepada kami ['ubaidhullah bin Sa'd] katanya; telah menceritakan kepadaku [pamanku] telah menceritakan kepada kami [ayahku] dari [Ibnu Ishaq] telah menceritakan kepada kami [Muhammad bin Ja'far bin Az Zubair] bahwa ['Urwah bin Zubair] telah menceritakan kepadanya, bahwa [Aisyah] pernah menceritakan kepadanya dengan kisah seperti ini, kata Asiyah; 'Rasulullah shallallahu 'alaihi wasallam bertakbir, begitu juga dengan kelompok yang sholat bersama beliau ikut bertakbir, kemudian beliau ruku, mereka juga ruku', lalu beliau sujud, mereka juga ikut sujud, lalu beliau mengangkat kepala (duduk di antara dua sujud), lalu mereka ikut bangkit, namun Rasulullah shallallahu 'alaihi wasallam masih tetap duduk, sementara mereka mengerjakan sujud kedua sendiri-sendiri. Kemudian mereka berdiri dan berjalan mundur pelan-pelan sehingga berdiri di belakang mereka (kelompok kedua), dan kelompok kedua datang, lalu mereka berdiri di belakang Rasulullah shallallahu 'alaihi wasallam, mereka bertakbir dan ruku' sendiri-sendiri, setelah ruku', Rasulullah shallallahu 'alaihi wasallam sujud, maka mereka juga sujud bersama beliau. kemudian Rasulullah shallallahu 'alaihi wasallam berdiri, sedangkan mereka mengerjakan sujud kedua sendiri-sendiri, setelah itu kedua kelompok tersebut berdiri semua, mengerjakan sholat bersama dengan Rasulullah shallallahu 'alaihi wasallam. beliau ruku', lalu mereka juga ikut ruku', beliau sujud mereka juga sujud. Lalu beliau kembali duduk, terus sujud lagi yang kedua, maka mereka juga ikut sujud bersama beliau secepatnya dan sangat cepat tanpa mengurangi kesempurnaan (sujud), setelah itu Rasulullah shallallahu 'alaihi wasallam salam dan mereka juga ikut salam bersama beliau.\" Rasulullah shallallahu 'alaihi wasallam berdiri dalam semua sholat yang di sertai oleh semua jama'ah sholat.\""
            },
            {
                "number": 1038,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِإِحْدَى الطَّائِفَتَيْنِ رَكْعَةً وَالطَّائِفَةُ الْأُخْرَى مُوَاجِهَةُ الْعَدُوِّ ثُمَّ انْصَرَفُوا فَقَامُوا فِي مَقَامِ أُولَئِكَ وَجَاءَ أُولَئِكَ فَصَلَّى بِهِمْ رَكْعَةً أُخْرَى ثُمَّ سَلَّمَ عَلَيْهِمْ ثُمَّ قَامَ هَؤُلَاءِ فَقَضَوْا رَكْعَتَهُمْ وَقَامَ هَؤُلَاءِ فَقَضَوْا رَكْعَتَهُمْقَالَ أَبُو دَاوُد وَكَذَلِكَ رَوَاهُ نَافِعٌ وَخَالِدُ بْنُ مَعْدَانَ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَذَلِكَ قَوْلُ مَسْرُوقٍ وَيُوسُفُ بْنُ مِهْرَانَ عَنْ ابْنِ عَبَّاسٍ وَكَذَلِكَ رَوَى يُونُسُ عَنْ الْحَسَنِ عَنْ أَبِي مُوسَى أَنَّهُ فَعَلَهُ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yazid bin Zurai'] dari [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat satu raka'at dengan salah satu dari dua kelompok, sedangkan kelompok yang lain berjaga-jaga menghadapi musuh, setelah kelompok pertama selesai melaksanakan sholat, mereka pergi menempati kelompok kedua, dan kelompok kedua menempati tempat kelompok pertama, beliau mengerjakan sholat bersama kelompok kedua satu raka'at sisanya, lalu beliau salam, kemudian kelompok kedua berdiri dan menyelesaikan raka'at mereka, dan mereka berdiri untuk menyelesaikan raka'at mereka.\" Abu Daud berkata; \"Demikian juga yang di riwayatkan oleh [Nafi'] dan [Khalid bin Ma'dan] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, begitu juga dengan perkataannya Masruq dan Yusuf bin Mihran dari Ibnu Abbas, demikian juga yang di riwayatkan Yunus dari Al Hasan dari Abu Musa bahwa dia juga melakukan cara seperti ini.\""
            },
            {
                "number": 1039,
                "arab": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ حَدَّثَنَا ابْنُ فُضَيْلٍ حَدَّثَنَا خُصَيْفٌ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ فَقَامُوا صَفًّا خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصَفٌّ مُسْتَقْبِلَ الْعَدُوِّ فَصَلَّى بِهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَةً ثُمَّ جَاءَ الْآخَرُونَ فَقَامُوا مَقَامَهُمْ وَاسْتَقْبَلَ هَؤُلَاءِ الْعَدُوَّ فَصَلَّى بِهِمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَةً ثُمَّ سَلَّمَ فَقَامَ هَؤُلَاءِ فَصَلَّوْا لِأَنْفُسِهِمْ رَكْعَةً ثُمَّ سَلَّمُوا ثُمَّ ذَهَبُوا فَقَامُوا مَقَامَ أُولَئِكَ مُسْتَقْبِلِي الْعَدُوِّ وَرَجَعَ أُولَئِكَ إِلَى مَقَامِهِمْ فَصَلَّوْا لِأَنْفُسِهِمْ رَكْعَةً ثُمَّ سَلَّمُواحَدَّثَنَا تَمِيمُ بْنُ الْمُنْتَصِرِ أَخْبَرَنَا إِسْحَقُ يَعْنِي ابْنَ يُوسُفَ عَنْ شَرِيكٍ عَنْ خُصَيْفٍ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ فَكَبَّرَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَبَّرَ الصَّفَّانِ جَمِيعًا قَالَ أَبُو دَاوُد رَوَاهُ الثَّوْرِيُّ بِهَذَا الْمَعْنَى عَنْ خُصَيْفٍ وَصَلَّى عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ هَكَذَا إِلَّا أَنَّ الطَّائِفَةَ الَّتِي صَلَّى بِهِمْ رَكْعَةً ثُمَّ سَلَّمَ مَضَوْا إِلَى مَقَامِ أَصْحَابِهِمْ وَجَاءَ هَؤُلَاءِ فَصَلَّوْا لِأَنْفُسِهِمْ رَكْعَةً ثُمَّ رَجَعُوا إِلَى مَقَامِ أُولَئِكَ فَصَلَّوْا لِأَنْفُسِهِمْ رَكْعَةً قَالَ أَبُو دَاوُد حَدَّثَنَا بِذَلِكَ مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ حَبِيبٍ قَالَ أَخْبَرَنِي أَبِي أَنَّهُمْ غَزَوْا مَعَ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ كَابُلَ فَصَلَّى بِنَا صَلَاةَ الْخَوْفِ",
                "id": "Telah menceritakan kepada kami [Imran bin Maisarah] telah menceritakan kepada kami [Ibnu Fudlail] telah menceritakan kepada kami [Khushaif] dari [Abu 'Ubaidah] dari [Abdullah bin Mas'ud] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan sholat khauf bersama kami, lalu sekelompok mereka berbaris di belakang Rasulullah shallallahu 'alaihi wasallam, sedangkan kelompok yang lain berjaga-jaga menghadapi musuh, maka Rasulullah shallallahu 'alaihi wasallam sholat dengan kelompok pertama satu raka'at, kemudian kelompok kedua datang dan menempati tempat kelompok pertama, sedangkan kelompok pertama bergantian berjaga menghadapi musuh, lalu Nabi shallallahu 'alaihi wasallam sholat dengan kelompok kedua satu raka'at, kemudian beliau salam, sementara kelompok yang sholat bersama beliau berdiri dan menyempurnakan satu raka'at sendiri-sendiri, kemudian mereka salam. Setelah itu mereka kembali dan menempati posisi kelompok yang menghadapi musuh, sedangkan kelompok pertama kembali (ke shaf sholat), kemudian mereka (menyempurnakan) sholat satu raka'at (yang tersisa) sendiri-sendiri, kemudian mereka salam.\" Telah menceritakan kepada kami [Tamim bin Al Muntashir] telah mengabarkan kepada kami [Ishaq yaitu Ibnu Yusuf] dari [Syarik] dari [Khushaif] dengan sanad dan maksud yang sama, katanya; \"Kemudian Nabi shallallahu 'alaihi wasallam bertakbir, dan kedua kelompok juga ikut bertakbir bersama beliau.\" Abu Daud mengatakan; \"Di riwayatkan pula oleh [Ats Tsauri] dengan makna seperti ini, dari [Khushaif], dan Abdurrahman bin Samurah juga mengerjakan cara sholat seperti ini, kecuali kelompok yang sholat satu raka'at, kemudian salam, lalu mereka bergantian menempati tempat sahabatnya yang lain (kelompok kedua), kemudian mereka (kelompok kedua) datang lalu sholat sendiri-sendiri satu raka'at, kemudian mereka kembali ke tempat mereka dan menyempurnakan sholat satu raka'at sendiri-sendiri.\" Abu Daud berkata; telah menceritakan kepada kami hadits seperti itu Muslim bin Ibrahim telah menceritakan kepada kami Abdusshamad bin Habib dia berkata; telah mengabarkan kepadaku ayahku bahwa mereka pernah berperang bersama Abdurrahman bin Samurah di daerah Kabul, kemudian dia mengerjakan sholat khauf bersama kami.\""
            },
            {
                "number": 1040,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ حَدَّثَنِي الْأَشْعَثُ بْنُ سُلَيْمٍ عَنْ الْأَسْوَدِ بْنِ هِلَالٍ عَنْ ثَعْلَبَةَ بْنِ زَهْدَمٍ قَالَكُنَّا مَعَ سَعِيدِ بْنِ الْعَاصِ بِطَبَرِسْتَانَ فَقَامَ فَقَالَ أَيُّكُمْ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ فَقَالَ حُذَيْفَةُ أَنَا فَصَلَّى بِهَؤُلَاءِ رَكْعَةً وَبِهَؤُلَاءِ رَكْعَةً وَلَمْ يَقْضُواقَالَ أَبُو دَاوُد وَكَذَا رَوَاهُ عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ وَمُجَاهِدٌ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَبْدُ اللَّهِ بْنُ شَقِيقٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيَزِيدُ الْفَقِيرُ وَأَبُو مُوسَى قَالَ أَبُو دَاوُد رَجُلٌ مِنْ التَّابِعِينَ لَيْسَ بِالْأَشْعَرِيِّ جَمِيعًا عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ قَالَ بَعْضُهُمْ عَنْ شُعْبَةَ فِي حَدِيثِ يَزِيدَ الْفَقِيرِ إِنَّهُمْ قَضَوْا رَكْعَةً أُخْرَى وَكَذَلِكَ رَوَاهُ سِمَاكٌ الْحَنَفِيُّ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَذَلِكَ رَوَاهُ زَيْدُ بْنُ ثَابِتٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَكَانَتْ لِلْقَوْمِ رَكْعَةً رَكْعَةً وَلِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Sufyan] telah menceritakan kepadaku [Al Asy'Ats Tsauri bin Sulaim] dari [Al Aswad bin Hilal] dari [Tsa'labah bin Zahdam] dia berkata; \"Kami bersama Sa'id bin Al 'Ash di daerah Thabaristan, kemudian dia berdiri dan berkata \"Siapakah di antara kalian yang pernah mengerjakan sholat khauf bersama Rasulullah shallallahu 'alaihi wasallam?\" maka [Hudzaifah] menjawab; \"Aku, beliau mengerjakan sholat satu raka'at dengan satu kelompok, dan mengerjakan satu raka'at dengan kelompok yang lain, dan mereka tidak menambah (sendiri-sendiri).\" Abu Daud berkata; \"Demikian juga yang di riwayatkan ['ubaidhullah bin Abdullah] dan [Mujahid] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam. Dan [Abdullah bin Syaqiq] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam. Serta [Yazid Al Faqir] dan [Abu Musa]. Abu Daud berkata; \"-Abu Musa yang di maksud adalah seorang tabi'in, bukan (Abu Musa) Asy'ari seorang sahabat, semuanya dari [Jabir] dari Nabi shallallahu 'alaihi wasallam. Sebagian mereka berkata; dari Syu'bah dalam haditsnya Yazid Al Faqir, \"Mereka menyempurnakan satu raka'at lagi.\" Demikian juga yang di riwayatkan [Simak Al Hanafi] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam. Demikian juga yang di riwayatkan Zaid bin Tsabit dari Nabi shallallahu 'alaihi wasallam, dia berkata; \"…Untuk setiap kelompok, mengerjakan satu raka'at-satu raka'at, sedangkan Nabi shallallahu 'alaihi wasallam mengerjakan dua raka'at.\""
            },
            {
                "number": 1041,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَسَعِيدُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا أَبُو عَوَانَةَ عَنْ بُكَيْرِ بْنِ الْأَخْنَسِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ قَالَفَرَضَ اللَّهُ تَعَالَى الصَّلَاةَ عَلَى لِسَانِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَضَرِ أَرْبَعًا وَفِي السَّفَرِ رَكْعَتَيْنِ وَفِي الْخَوْفِ رَكْعَةً",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Sa'id bin Manshur] keduanya berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Bukair bin Al Ahnas] dari [Mujahid] dari [Ibnu Abbas] dia berkata; \"Allah Ta'ala telah mewajibkan sholat lewat lisan Nabi kalian ketika menetap (tidak bepergian) sebanyak empat raka'at, di waktu bepergian dua raka'at dan dalam kondisi takut (dalam Perang) satu raka'at.\""
            },
            {
                "number": 1042,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَشْعَثُ عَنْ الْحَسَنِ عَنْ أَبِي بَكْرَةَ قَالَصَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي خَوْفٍ الظُّهْرَ فَصَفَّ بَعْضُهُمْ خَلْفَهُ وَبَعْضُهُمْ بِإِزَاءِ الْعَدُوِّ فَصَلَّى بِهِمْ رَكْعَتَيْنِ ثُمَّ سَلَّمَ فَانْطَلَقَ الَّذِينَ صَلَّوْا مَعَهُ فَوَقَفُوا مَوْقِفَ أَصْحَابِهِمْ ثُمَّ جَاءَ أُولَئِكَ فَصَلَّوْا خَلْفَهُ فَصَلَّى بِهِمْ رَكْعَتَيْنِ ثُمَّ سَلَّمَ فَكَانَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعًا وَلِأَصْحَابِهِ رَكْعَتَيْنِ رَكْعَتَيْنِوَبِذَلِكَ كَانَ يُفْتِي الْحَسَنُ قَالَ أَبُو دَاوُد وَكَذَلِكَ فِي الْمَغْرِبِ يَكُونُ لِلْإِمَامِ سِتُّ رَكَعَاتٍ وَلِلْقَوْمِ ثَلَاثٌ ثَلَاثٌ قَالَ أَبُو دَاوُد وَكَذَلِكَ رَوَاهُ يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَذَلِكَ قَالَ سُلَيْمَانُ الْيَشْكُرِيُّ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Al Asy'Ats Tsauri] dari [A Hasan] dari [Abu Bakrah] dia berkata; \"Nabi shallallahu 'alaihi wasallam pernah mengerjakan sholat khauf pada waktu Dluhur, sebagian kelompok berbaris di belakang beliau dan sebagian kelompok yang lain menghadapi musuh, beliau sholat dua raka'at dengan mereka (kelompok pertama), kemudian salam. Lalu kelompok yang tadinya sholat dengan beliau pindah menempati tempat para sahabat mereka (kelompok kedua), kemudian mereka (kelompok kedua) datang dan sholat di belakang beliau, maka beliau sholat dua raka'at bersama mereka, lalu salam. Sehingga Rasulullah shallallahu 'alaihi wasallam sholat empat raka'at, sementara para sahabat beliau sholat dua raka'at-dua raka'at.\" Demikianlah yang di fatwakan oleh Al Hasan. Abu Daud mengatakan; \"Demikian pula dalam sholat Maghrib, maka imam enam raka'at, sementara setiap kelompok tiga raka'at-tiga raka'at.\" Abu Daud mengatakan; \"Demikian pula yang di riwayatkan oleh [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam. [Sulaiman Al Yasykuri] berkata; dari [Jabir] dari Nabi shallallahu 'alaihi wasallam. "
            },
            {
                "number": 1043,
                "arab": "حَدَّثَنَا أَبُو مَعْمَرٍ عَبْدُ اللَّهِ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ عَنْ ابْنِ عَبْدِ اللَّهِ بْنِ أُنَيْسٍ عَنْ أَبِيهِ قَالَبَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى خَالِدِ بْنِ سُفْيَانَ الْهُذَلِيِّ وَكَانَ نَحْوَ عُرَنَةَ وَعَرَفَاتٍ فَقَالَ اذْهَبْ فَاقْتُلْهُ قَالَ فَرَأَيْتُهُ وَحَضَرَتْ صَلَاةُ الْعَصْرِ فَقُلْتُ إِنِّي أَخَافُ أَنْ يَكُونَ بَيْنِي وَبَيْنَهُ مَا إِنْ أُؤَخِّرْ الصَّلَاةَ فَانْطَلَقْتُ أَمْشِي وَأَنَا أُصَلِّي أُومِئُ إِيمَاءً نَحْوَهُ فَلَمَّا دَنَوْتُ مِنْهُ قَالَ لِي مَنْ أَنْتَ قُلْتُ رَجُلٌ مِنْ الْعَرَبِ بَلَغَنِي أَنَّكَ تَجْمَعُ لِهَذَا الرَّجُلِ فَجِئْتُكَ فِي ذَاكَ قَالَ إِنِّي لَفِي ذَاكَ فَمَشَيْتُ مَعَهُ سَاعَةً حَتَّى إِذَا أَمْكَنَنِي عَلَوْتُهُ بِسَيْفِي حَتَّى بَرَدَ",
                "id": "Telah menceritakan kepada kami [Abu Ma'mar Abdullah bin 'Amru] telah menceritakan kepada kami [Abdul Warits] telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Muhammad bin ja'far] dari [Ibnu Abdullah bin Unais] dari [ayahnya] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah mengutusku untuk menemui Khalid bin Sufyan Al Hudzali, sedangkan dia berada di daerah antara 'Uranah dan 'Arafat, beliau bersabda: \"Pergilah dan bunuhlah dia.\" Abdullah bin Unais berkata; \"Maka aku dapat melihatnya sedangkan waktu sholat Ashar telah tiba, aku berkata (dalam dalam hati);; \"Aku khawatir jika aku mengakhirkan sholat Ashar, akan terjadi sesuatu antara aku dengan dia.\" Maka aku terus saja berjalan sambil mengerjakan sholat dengan memberi isyarat, ketika jarakku dengannya semakin dekat, dia berkata kepadaku; \"Siapakah kamu?\" jawabku; \"Aku adalah seseorang dari Arab, telah sampai kepadaku bahwa dirimu telah mengumpulkan (orang-orang) untuk memerangi laki-laki ini, maka aku datang untuk urusan tersebut. ' Dia berkata; \"Memang aku berhajat seperti itu.\" Sesaat kemudian aku jalan-jalan bersamanya, ketika keadaan memungkinkan bagiku (untuk membunuhnya), maka aku langsung mengayunkan pedangku menebasnya hingga dia mati terkapar.\""
            },
            {
                "number": 1044,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا ابْنُ عُلَيَّةَ حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ حَدَّثَنِي النُّعْمَانُ بْنُ سَالِمٍ عَنْ عَمْرِو بْنِ أَوْسٍ عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ عَنْ أُمِّ حَبِيبَةَ قَالَتْقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى فِي يَوْمٍ ثِنْتَيْ عَشْرَةَ رَكْعَةً تَطَوُّعًا بُنِيَ لَهُ بِهِنَّ بَيْتٌ فِي الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Ibnu 'Ulayyah] telah menceritakan kepada kami [Daud bin Abu Hind] telah menceritakan kepadaku [An Nu'man bin Salim] dari ['Amru bin Aus] dari ['Anbasah bin Abu Sufyan] dari [Ummu Habibah] dia berkata; Nabi shallallahu 'alaihi wasallam bersabda; \"Barangsiapa mengerjakan sholat sunnah dua belas raka'at dalam sehari, maka akan di bangunkan baginya rumah di surga.\""
            },
            {
                "number": 1045,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا خَالِدٌ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا خَالِدٌ الْمَعْنَى عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَسَأَلْتُ عَائِشَةَ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ التَّطَوُّعِ فَقَالَتْ كَانَ يُصَلِّي قَبْلَ الظُّهْرِ أَرْبَعًا فِي بَيْتِي ثُمَّ يَخْرُجُ فَيُصَلِّي بِالنَّاسِ ثُمَّ يَرْجِعُ إِلَى بَيْتِي فَيُصَلِّي رَكْعَتَيْنِ وَكَانَ يُصَلِّي بِالنَّاسِ الْمَغْرِبَ ثُمَّ يَرْجِعُ إِلَى بَيْتِي فَيُصَلِّي رَكْعَتَيْنِ وَكَانَ يُصَلِّي بِهِمْ الْعِشَاءَ ثُمَّ يَدْخُلُ بَيْتِي فَيُصَلِّي رَكْعَتَيْنِ وَكَانَ يُصَلِّي مِنْ اللَّيْلِ تِسْعَ رَكَعَاتٍ فِيهِنَّ الْوِتْرُ وَكَانَ يُصَلِّي لَيْلًا طَوِيلًا قَائِمًا وَلَيْلًا طَوِيلًا جَالِسًا فَإِذَا قَرَأَ وَهُوَ قَائِمٌ رَكَعَ وَسَجَدَ وَهُوَ قَائِمٌ وَإِذَا قَرَأَ وَهُوَ قَاعِدٌ رَكَعَ وَسَجَدَ وَهُوَ قَاعِدٌ وَكَانَ إِذَا طَلَعَ الْفَجْرُ صَلَّى رَكْعَتَيْنِ ثُمَّ يَخْرُجُ فَيُصَلِّي بِالنَّاسِ صَلَاةَ الْفَجْرِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Khalid]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Khalid] sedangkan maknanya dari [Abdullah bin Syaqiq] dia berkata; saya bertanya kepada [Aisyah] mengenai sholat sunnahnya Rasulullah shallallahu 'alaihi wasallam.\" Jawabnya; \"Beliau biasa mengerjakan sholat (sunnah) sebelum Dluhur empat raka'at di rumahku, kemudian beliau keluar dan sholat bersama orang-orang. Setelah sholat, beliau kembali ke rumahku lalu beliau mengerjakan sholat dua raka'at. Setelah sholat Maghrib (berjama'ah) bersama orang-orang, beliau pulang ke rumahku, kemudian beliau sholat (sunnah) dua raka'at. Setelah sholat Isya' bersama orag-orang, beliau masuk ke rumahku lalu sholat dua raka'at. Beliau juga biasa mengerjakan sholat malam sembilan raka'at bersamaan dengan witirnya. Beliau mengerjakan sholat malam dengan berdiri hingga jangka waktu yang lama, terkadang juga sholat malam sambil duduk hingga jangka waktu yang lama. Apabila membaca (Surat) sambil berdiri, maka beliau ruku' dan sujud sebagaimana (ruku' dan sujud) ketika mengerjakan sholat dengan berdiri, dan apabila beliau duduk, maka beliau ruku' dan sujud dengan posisi duduk. apabila waktu fajar telah terbit, beliau sholat dua raka'at, lalu beliau shallallahu 'alaihi wasallam keluar mengerjakan sholat shubuh (berjama'ah) bersama orang-orang.\""
            },
            {
                "number": 1046,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي قَبْلَ الظُّهْرِ رَكْعَتَيْنِ وَبَعْدَهَا رَكْعَتَيْنِ وَبَعْدَ الْمَغْرِبِ رَكْعَتَيْنِ فِي بَيْتِهِ وَبَعْدَ صَلَاةِ الْعِشَاءِ رَكْعَتَيْنِ وَكَانَ لَا يُصَلِّي بَعْدَ الْجُمُعَةِ حَتَّى يَنْصَرِفَ فَيُصَلِّيَ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam biasa mengerjakan sholat (sunnah) dua raka'at sebelum dan setelah Dluhur, dua raka'at di rumahnya setelah Maghrib, dua raka'at setelah Isya', dan beliau tidak mengerjakan sholat sunnah setelah Jum'at, sehingga beliau pergi (ke rumah) kemudian sholat dua raka'at.\""
            },
            {
                "number": 1047,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَدَعُ أَرْبَعًا قَبْلَ الظُّهْرَ وَرَكْعَتَيْنِ قَبْلَ صَلَاةِ الْغَدَاةِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Syu'bah] dari [Ibrahim bin Muhammad bin Al Muntasyir] dari [ayahnya] dari [Aisyah] bahwa Nabi shallallahu 'alaihi wasallam tidak pernah meninggalkan empat raka'at sebelum Dluhur dan dua raka'at sebelum sholat subuh.\""
            },
            {
                "number": 1048,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ حَدَّثَنِي عَطَاءٌ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَكُنْ عَلَى شَيْءٍ مِنْ النَّوَافِلِ أَشَدَّ مُعَاهَدَةً مِنْهُ عَلَى الرَّكْعَتَيْنِ قَبْلَ الصُّبْحِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij] telah menceritakan kepadaku ['Atha`] dari ['Ubaid bin 'Umair] dari [Aisyah] radliallahu 'anha dia berkata; \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam tidak pernah memiliki perhatian yang lebih terhadap sholat sunnah melebihi perhatian beliau terhadap dua raka'at sebelum subuh.\""
            },
            {
                "number": 1049,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُخَفِّفُ الرَّكْعَتَيْنِ قَبْلَ صَلَاةِ الْفَجْرِ حَتَّى إِنِّي لَأَقُولُ هَلْ قَرَأَ فِيهِمَا بِأُمِّ الْقُرْآنِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abu Syu'aib Al Harrani] telah menceritakan kepada kami [Zuhair bin Mu'awiyah] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Muhammad bin Abdurrahman] dari ['Amrah] dari [Aisyah] dia berkata; \"Nabi shallallahu 'alaihi wasallam biasa mempersingkat (sholat) dua raka'at sebelum fajar, sehingga aku berkata (dalam hati), apakah beliau hanya membaca al Fatihah saja dalam dua raka'at tersebut?\""
            },
            {
                "number": 1050,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ فِي رَكْعَتَيْ الْفَجْرِ قُلْ يَا أَيُّهَا الْكَافِرُونَ وَ قُلْ هُوَ اللَّهُ أَحَدٌ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ma'in] telah menceritakan kepada kami [Marwan bin Mu'awiyah] telah menceritakan kepada kami [Yazid bin Kaisan] dari [Abu Hazim] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam membaca \"Qul yaa ayyuhal Kaafiruun\" dan \"Qul huwallahu ahad\" dalam dua raka'at sholat (sunnah) fajar.\""
            },
            {
                "number": 1051,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلَاءِ حَدَّثَنِي أَبُو زِيَادَةَ عُبَيْدُ اللَّهِ بْنُ زِيَادَةَ الْكِنْدِيُّ عَنْ بِلَالٍ أَنَّهُ حَدَّثَهُأَنَّهُ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيُؤْذِنَهُ بِصَلَاةِ الْغَدَاةِ فَشَغَلَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا بِلَالًا بِأَمْرٍ سَأَلَتْهُ عَنْهُ حَتَّى فَضَحَهُ الصُّبْحُ فَأَصْبَحَ جِدًّا قَالَ فَقَامَ بِلَالٌ فَآذَنَهُ بِالصَّلَاةِ وَتَابَعَ أَذَانَهُ فَلَمْ يَخْرُجْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا خَرَجَ صَلَّى بِالنَّاسِ وَأَخْبَرَهُ أَنَّ عَائِشَةَ شَغَلَتْهُ بِأَمْرٍ سَأَلَتْهُ عَنْهُ حَتَّى أَصْبَحَ جِدًّا وَأَنَّهُ أَبْطَأَ عَلَيْهِ بِالْخُرُوجِ فَقَالَ إِنِّي كُنْتُ رَكَعْتُ رَكْعَتَيْ الْفَجْرِ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّكَ أَصْبَحْتَ جِدًّا قَالَ لَوْ أَصْبَحْتُ أَكْثَرَ مِمَّا أَصْبَحْتُ لَرَكَعْتُهُمَا وَأَحْسَنْتُهُمَا وَأَجْمَلْتُهُمَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Abdullah Al 'Ala`] telah menceritakan kepadaku [Abu Ziyadah 'ubaidhullah bin Ziyadah Al Kindi] dari [Bilal] bahwa dia telah menceritakan kepadanya, bahwa dirinya pernah datang kepada Rasulullah shallallahu 'alaihi wasallam untuk menyerukan adzan subuh, lalu Aisyah menyibukkan Bilal dengan suatu perkara yang ia tanyakan, hingga waktu pagi datang dengan cerah. ' Katanya; 'lalu Bilal berdiri mengumandangkan adzan untuk sholat, dan adzan di kumandangkan dengan sempurna, namun Rasulullah shallallahu 'alaihi wasallam tidak kunjung keluar, setelah beliau keluar mengerjakan sholat dengan orang-orang, di sampaikanlah kepada beliau bahwa dia (Bilal) disibukkan dengan suatu urusan yang di tanyakan Aisyah sampai tiba waktu pagi yang cerah, sehingga dia membuat beliau juga terlambat keluar.\" Beliau bersabda: \"Sesungguhnya aku tengah mengerjakan sholat sunnah fajar dua raka'at.\" Bilal berkata; \"Wahai Rasulullah, sesungguhnya anda berada di pagi yang sangat cerah?\" beliau bersabda: \"Sekiranya aku kesiangan dan lebih siang daripada sekarang ini, pasti aku akan tetap mengerjakan dua raka'at tersebut, dan aku akan memperbaiki dan memperbagus kedua raka'at tersebut.\""
            },
            {
                "number": 1052,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا خَالِدٌ حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ إِسْحَقَ الْمَدَنِيَّ عَنْ ابْنِ زَيْدٍ عَنْ ابْنِ سَيْلَانَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَدَعُوهُمَا وَإِنْ طَرَدَتْكُمْ الْخَيْلُ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Khalid] telah menceritakan kepada kami [Abdurrahman yaitu Ibnu Ishaq Al Madani] dari [Ibnu Zaid] dari [Ibnu Sailan] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian meninggalkan (dua raka'at sunnah fajar), sekalipun kalian terpelanting dari kudanya.\""
            },
            {
                "number": 1053,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ أَخْبَرَنِي سَعِيدُ بْنُ يَسَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّ كَثِيرًا مِمَّا كَانَ يَقْرَأُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَكْعَتَيْ الْفَجْرِ بِ{ آمَنَّا بِاللَّهِ وَمَا أُنْزِلَ إِلَيْنَا }هَذِهِ الْآيَةُ قَالَ هَذِهِ فِي الرَّكْعَةِ الْأُولَى وَفِي الرَّكْعَةِ الْآخِرَةِ بِ{ آمَنَّا بِاللَّهِ وَاشْهَدْ بِأَنَّا مُسْلِمُونَ }",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Utsman bin Hakim] telah menceritakan kepadaku [Sa'id bin Yasar] dari [Abdullah bin Abbas] bahwa kebanyakan yang di baca Rasulullah shallallahu 'alaihi wasallam dalam dua raka'at fajar adalah \"Kami beriman kepada Allah dan apa yang diturunkan kepada kami\" (QS Al Baqarah; 136). Kata Ibnu Abbas; \"ayat ini di baca beliau di raka'at pertama, sedangkan di raka'at terakhir beliau membaca \"……kami beriman kepada Allah; dan saksikanlah bahwa Sesungguhnya kami adalah orang-orang yang berserah diri.\" (QS Ali Imran; 52). "
            },
            {
                "number": 1054,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ بْنِ سُفْيَانَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عُمَرَ يَعْنِي ابْنَ مُوسَى عَنْ أَبِي الْغَيْثِ عَنْ أَبِي هُرَيْرَةَأَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي رَكْعَتَيْ الْفَجْرِ{ قُلْ آمَنَّا بِاللَّهِ وَمَا أُنْزِلَ عَلَيْنَا }فِي الرَّكْعَةِ الْأُولَى وَفِي الرَّكْعَةِ الْأُخْرَى بِهَذِهِ الْآيَةِ{ رَبَّنَا آمَنَّا بِمَا أَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ }أَوْ{ إِنَّا أَرْسَلْنَاكَ بِالْحَقِّ بَشِيرًا وَنَذِيرًا وَلَا تُسْأَلُ عَنْ أَصْحَابِ الْجَحِيمِ }شَكَّ الدَّارَوَرْدِيُّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin As Shabbah bin Sufyan] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Utsman bin Umar yaitu Ibnu Musa] dari [Abu Al Ghaits] dari [Abu Hurairah] bahwa dia mendengar Nabi shallallahu 'alaihi wasallam membaca dalam dua raka'at fajar dengan; \"Katakanlah: \"Kami beriman kepada Allah dan kepada apa yang diturunkan kepada kami…\" QS Ali Imran; 84, ayat ini beliau baca di raka'at pertama, sedangkan di raka'at kedua, beliau membaca dengan ayat ini; \"Ya Tuhan kami, kami Telah beriman kepada apa yang Telah Engkau turunkan dan Telah kami ikuti rasul, Karena itu masukanlah kami ke dalam golongan orang-orang yang menjadi saksi (tentang keesaan Allah) \" (QS Ali Imran; 53) atau membaca; \"Sesungguhnya kami Telah mengutusmu (Muhammad) dengan kebenaran; sebagai pembawa berita gembira dan pemberi peringatan, dan kamu tidak akan diminta (pertanggungan jawab) tentang penghuni-penghuni neraka Jahannam.\" (QS Al Baqarah; 119) -Ad Darawardi ragu mengenai redaksi hadits ini-.\""
            },
            {
                "number": 1055,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَأَبُو كَامِلٍ وَعُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ قَالُوا حَدَّثَنَا عَبْدُ الْوَاحِدِ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى أَحَدُكُمْ الرَّكْعَتَيْنِ قَبْلَ الصُّبْحِ فَلْيَضْطَجِعْ عَلَى يَمِينِهِفَقَالَ لَهُ مَرْوَانُ بْنُ الْحَكَمِ أَمَا يُجْزِئُ أَحَدَنَا مَمْشَاهُ إِلَى الْمَسْجِدِ حَتَّى يَضْطَجِعَ عَلَى يَمِينِهِ قَالَ عُبَيْدُ اللَّهِ فِي حَدِيثِهِ قَالَ لَا قَالَ فَبَلَغَ ذَلِكَ ابْنَ عُمَرَ فَقَالَ أَكْثَرَ أَبُو هُرَيْرَةَ عَلَى نَفْسِهِ قَالَ فَقِيلَ لِابْنِ عُمَرَ هَلْ تُنْكِرُ شَيْئًا مِمَّا يَقُولُ قَالَ لَا وَلَكِنَّهُ اجْتَرَأَ وَجَبُنَّا قَالَ فَبَلَغَ ذَلِكَ أَبَا هُرَيْرَةَ قَالَ فَمَا ذَنْبِي إِنْ كُنْتُ حَفِظْتُ وَنَسَوْا",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Abu Kamil] serta ['ubaidhullah bin Umar bin Maisarah] mereka berkata; telah menceritakan kepada kami [Abdul Wahid] telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian selesai mengerjakan sholat (sunnah) dua raka'at sebelum subuh, hendaknya ia berbaring ke sebelah kanan.\" Maka Marwan bin Hakam berkata kepadanya; \"Apakah seseorang dari kami cukup waktu berjalan ke masjid kok sehingga dia berbaring ke sebelah kanan segala?\" 'ubaidhullah berkata dalam haditsnya. Abu Hurairah menjawab; \"Tidak.\" Lalu hal itu di sampaikan kepada Ibnu Umar, maka Ibnu Umar berkata; \"Abu Hurairah berlaku berlebih-lebihan atas dirinya sendiri.\" Lalu di katakan kepada Ibnu Umar; \"Apakah anda tidak membenarkan sebagian yang di katakannya?\" dia menjawab; \"Tidak, namun Abu Hurairah berani (karena banyak riwayat), sedangkan kami amat hati-hati (karena sedikit periwayatan hadits).\" Katanya; \"Lalu hal itu sampai kepada Abu Hurairah, kemudian dia berkata; \"Apa salahku, jika aku pernah menghafalnya (hadits) sedangkan ia lupa?.\""
            },
            {
                "number": 1056,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا بِشْرُ بْنُ عُمَرَ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ سَالِمٍ أَبِي النَّضْرِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَضَى صَلَاتَهُ مِنْ آخِرِ اللَّيْلِ نَظَرَ فَإِنْ كُنْتُ مُسْتَيْقِظَةً حَدَّثَنِي وَإِنْ كُنْتُ نَائِمَةً أَيْقَظَنِي وَصَلَّى الرَّكْعَتَيْنِ ثُمَّ اضْطَجَعَ حَتَّى يَأْتِيَهُ الْمُؤَذِّنُ فَيُؤْذِنَهُ بِصَلَاةِ الصُّبْحِ فَيُصَلِّي رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ يَخْرُجُ إِلَى الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Hakim] telah menceritakan kepada kami [Bisyr bin Umar] telah menceritakan kepada kami [Malik bin Anas] dari [Salim Abu An Nadlr] dari [Abu Salamah bin Abdurrahman] dari [Aisyah] dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam selesai melaksanakan sholat di akhir malam, maka beliau memperhatikanku, apabila aku telah bengun, beliau pun bercakap-cakap denganku, dan apabila aku masih tertidur, beliau akan membangunkanku, kemudian beliau sholat dua raka'at, setelah itu beliau berbaring hingga Mu'adzin datang untuk mengumandangkan adzan sholat shubuh, lalu beliau mengerjakan sholat (sunnah) dua raka'at yang singkat, setelah itu beliau keluar untuk mengerjakan sholat (Subuh).\""
            },
            {
                "number": 1057,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ زِيَادِ بْنِ سَعْدٍ عَمَّنْ حَدَّثَهُ ابْنُ أَبِي عَتَّابٍ أَوْ غَيْرُهُ عَنْ أَبِي سَلَمَةَ قَالَ قَالَتْ عَائِشَةُكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى رَكْعَتَيْ الْفَجْرِ فَإِنْ كُنْتُ نَائِمَةً اضْطَجَعَ وَإِنْ كُنْتُ مُسْتَيْقِظَةً حَدَّثَنِي",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Sufyan] dari [Ziyad bin Sa'd] dari seseorang yang pernah menceritakan kepadanya [Ibnu Abi 'Attab] atau yang lainnya, dari [Abu Salamah] dia berkata; [Aisyah] berkata; \"Apabila Nabi shallallahu 'alaihi wasallam selesai mengerjakan sholat dua raka'at fajar, sementara aku masih tidur, beliau akan berbaring, namun apabila aku sudah bangun, maka beliau akan bercakap-cakap denganku.\""
            },
            {
                "number": 1058,
                "arab": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ وَزِيَادُ بْنُ يَحْيَى قَالَا حَدَّثَنَا سَهْلُ بْنُ حَمَّادٍ عَنْ أَبِي مَكِينٍ حَدَّثَنَا أَبُو الْفُضَيْلِ رَجُلٌ مِنْ الْأَنْصَارِ عَنْ مُسْلِمِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِ قَالَخَرَجْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِصَلَاةِ الصُّبْحِ فَكَانَ لَا يَمُرُّ بِرَجُلٍ إِلَّا نَادَاهُ بِالصَّلَاةِ أَوْ حَرَّكَهُ بِرِجْلِهِ قَالَ زِيَادٌ قَالَ حَدَّثَنَا أَبُو الْفُضَيْلِ",
                "id": "Telah menceritakan kepada kami [Abbas Al 'Anbari] dan [Ziyad bin Yahya] keduanya berkata; telah menceritakan kepada kami [Sahl bin Hammad] dari [Abu Makkin] telah menceritakan kepada kami [Abu Al Fudlail] -seorang laki-laki dari Anshar- dari [Muslim bin Abu Bakrah] dari [ayahnya] dia berkata; \"Aku keluar bersama Nabi shallallahu 'alaihi wasallam untuk sholat subuh, dan tidaklah beliau melewati seseorang melainkan beliau akan memanggilnya untuk sholat atau mengarak-gerakkan dengan kaki beliau.\" Ziyad berkata; \"Telah menceritakan kepada kami Abu Al Fudlail. "
            },
            {
                "number": 1059,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَاصِمٍ عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ قَالَجَاءَ رَجُلٌ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الصُّبْحَ فَصَلَّى الرَّكْعَتَيْنِ ثُمَّ دَخَلَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّلَاةِ فَلَمَّا انْصَرَفَ قَالَ يَا فُلَانُ أَيَّتُهُمَا صَلَاتُكَ الَّتِي صَلَّيْتَ وَحْدَكَ أَوْ الَّتِي صَلَّيْتَ مَعَنَا",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari ['Ashim] dari [Abdullah bin Sarjis] dia berkata; \"Seorang laki-laki datang, sementara Nabi shallallahu 'alaihi wasallam tengah mengerjakan sholat shubuh, kemudian laki-laki itu sholat dua raka'at, barulah dia masuk (shaf) untuk mengerjakan sholat bersama Nabi shallallahu 'alaihi wasallam, setelah selesai sholat, beliau bersabda: \"Wahai fulan, dari kedua sholatmu tadi, manakah yang merupakan sholat (shubuh)? yang kamu kerjakan secara sendirian ataukah yang kamu kerjakan bersama kami?\""
            },
            {
                "number": 1060,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ ح و حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ وَرْقَاءَ ح و حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ ح و حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ حَمَّادِ بْنِ زَيْدٍ عَنْ أَيُّوبَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا زَكَرِيَّا بْنُ إِسْحَقَ كُلُّهُمْ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُقِيمَتْ الصَّلَاةُ فَلَا صَلَاةَ إِلَّا الْمَكْتُوبَةَ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hammad bin Salamah]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Warqa`]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Yazid bin Harun] dari [Hammad bin Zaid] dari [Ayyub]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Al Mutawakkil] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Zakariya bin Ishaq] semuanya dari ['Amru bin Dinar] dari ['Atha` bin Yasar] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"jika iqamah telah di tegakkan, maka tidak ada sholat kecuali sholat wajib.\""
            },
            {
                "number": 1061,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ سَعْدِ بْنِ سَعِيدٍ حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ عَنْ قَيْسِ بْنِ عَمْرٍو قَالَرَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يُصَلِّي بَعْدَ صَلَاةِ الصُّبْحِ رَكْعَتَيْنِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ الصُّبْحِ رَكْعَتَانِ فَقَالَ الرَّجُلُ إِنِّي لَمْ أَكُنْ صَلَّيْتُ الرَّكْعَتَيْنِ اللَّتَيْنِ قَبْلَهُمَا فَصَلَّيْتُهُمَا الْآنَ فَسَكَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَحَدَّثَنَا حَامِدُ بْنُ يَحْيَى الْبَلْخِيُّ قَالَ قَالَ سُفْيَانُ كَانَ عَطَاءُ بْنُ أَبِي رَبَاحٍ يُحَدِّثُ بِهَذَا الْحَدِيثِ عَنْ سَعْدِ بْنِ سَعِيدٍ قَالَ أَبُو دَاوُد وَرَوَى عَبْدُ رَبِّهِ وَيَحْيَى ابْنَا سَعِيدٍ هَذَا الْحَدِيثَ مُرْسَلًا أَنَّ جَدَّهُمْ صَلَّى مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذِهِ الْقِصَّةِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Ibnu Numair] dari [Sa'd bin Sa'id] telah menceritakan kepadaku [Muhammad bin Ibrahim] dari [Qais bin 'Amru] dia berkata; \"Suatu ketika Rasulullah shallallahu 'alaihi wasallam pernah melihat seorang laki-laki yang mengerjakan sholat dua raka'at setelah sholat shubuh, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat shubuh itu hanya dua raka'at.\" laki-laki itu menjawab; \"Sesungguhnya aku belum mengerjakan sholat dua raka'at (sunnah fajar), karena itu aku mengerjakannya sekarang ini.\" Maka Rasulullah shallallahu 'alaihi wasallam diam.\". Telah menceritakan kepada kami [Hamid bin Yahya Al Balakhi] dia berkata; telah berkata [Sufyan] bahwasanya [Atha' bin Abi Robbah] menceritakan hadits ini dari [Sa'ad bin Sa'id]. Abu Daud berkata; \"dan telah di riwayatkan oleh 'Abdu Rabbihi dan Yahya keduanya adalah putra Sa'id. Hadits ini adalah hadits mursal, sebab dalam kisah ini, kakek mereka ikut sholat bersama Nabi shallallahu 'alaihi wasallam. "
            },
            {
                "number": 1062,
                "arab": "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ عَنْ النُّعْمَانِ عَنْ مَكْحُولٍ عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ قَالَ قَالَتْ أُمُّ حَبِيبَةَ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَافَظَ عَلَى أَرْبَعِ رَكَعَاتٍ قَبْلَ الظُّهْرِ وَأَرْبَعٍ بَعْدَهَا حَرُمَ عَلَى النَّارِقَالَ أَبُو دَاوُد رَوَاهُ الْعَلَاءُ بْنُ الْحَارِثِ وَسُلَيْمَانُ بْنُ مُوسَى عَنْ مَكْحُولٍ بِإِسْنَادِهِ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Fadl] telah menceritakan kepada kami [Muhammad bin Syu'aib] dari [An Nu'man] dari [Makhul] dari ['Anbasah bin Abu Sufyan] dia berkata; [Ummu Habibah isteri Nabi] shallallahu 'alaihi wasallam berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bisa menjaga empat raka'at sebelum Dluhur dan empat raka'at setelahnya, maka neraka akan di haramkan bagi dirinya.\" Abu Daud berkata; \"Di riwayatkan pula oleh [Al 'Ala` bin Al Harits] dan [Sulaiman bin Musa] dari [Makhul] dengan sanad seperti hadits di atas.\""
            },
            {
                "number": 1063,
                "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عُبَيْدَةَ يُحَدِّثُ عَنْ إِبْرَاهِيمَ عَنْ ابْنِ مِنْجَابَ عَنْ قَرْثَعٍ عَنْ أَبِي أَيُّوبَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَرْبَعٌ قَبْلَ الظُّهْرِ لَيْسَ فِيهِنَّ تَسْلِيمٌ تُفْتَحُ لَهُنَّ أَبْوَابُ السَّمَاءِقَالَ أَبُو دَاوُد بَلَغَنِي عَنْ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ قَالَ لَوْ حَدَّثْتُ عَنْ عُبَيْدَةَ بِشَيْءٍ لَحَدَّثْتُ عَنْهُ بِهَذَا الْحَدِيثِ قَالَ أَبُو دَاوُد عُبَيْدَةُ ضَعِيفٌ قَالَ أَبُو دَاوُد ابْنُ مِنْجَابٍ هُوَ سَهْمٌ",
                "id": "Telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dia berkata; saya mendengar ['Ubaidah] pernah bercerita dari [Ibrahim] dari [Ibnu Minjab] dari [Qartsa'] dari [Abu Ayyub] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Empat raka'at sebelum Dluhur yang tidak di pisahkan oleh salam, maka akan di bukakan untuknya pintu-pintu langit.\" Abu Daud berkata; telah sampai kepadaku dari Yahya bin Sa'id Al Qatthan dia berkata; \"sekiranya aku menyampaikan suatu hadits dari 'Ubaidah, tentu aku akan menyampaikan hadits ini darinya. Abu Daud berkata; 'Ubaidah adalah Perawi yang lemah. Abu Daud berkata; Ibnu Minjab adalah Sahm. "
            },
            {
                "number": 1064,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الْقُرَشِيُّ حَدَّثَنِي جَدِّي أَبُو الْمُثَنَّى عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَحِمَ اللَّهُ امْرَأً صَلَّى قَبْلَ الْعَصْرِ أَرْبَعًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Ibrahim] telah menceritakan kepada kami [Abu Daud] telah menceritakan kepada kami [Muhammad bin Mihran Al Qurasyi] telah menceritakan kepadaku [Kakekku yaitu Abu Al Mutsanna] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semoga Allah merahmati seseorang yang mengerjakan sholat (sunnah) empat raka'at sebelum Ashar.\""
            },
            {
                "number": 1065,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ عَلَيْهِ السَّلَامأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي قَبْلَ الْعَصْرِ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari ['Ashim bin Dlamrah] dari [Ali] 'alaihi salam, bahwa Nabi shallallahu 'alaihi wasallam biasa mengerjakan sholat (sunnah) dua raka'at sebelum Ashar.\""
            },
            {
                "number": 1066,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍأَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ وَعَبْدَ الرَّحْمَنِ بْنَ أَزْهَرَ وَالْمِسْوَرَ بْنَ مَخْرَمَةَ أَرْسَلُوهُ إِلَى عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا اقْرَأْ عَلَيْهَا السَّلَامَ مِنَّا جَمِيعًا وَسَلْهَا عَنْ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ وَقُلْ إِنَّا أُخْبِرْنَا أَنَّكِ تُصَلِّينَهُمَا وَقَدْ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهُمَا فَدَخَلْتُ عَلَيْهَا فَبَلَّغْتُهَا مَا أَرْسَلُونِي بِهِ فَقَالَتْ سَلْ أُمَّ سَلَمَةَ فَخَرَجْتُ إِلَيْهِمْ فَأَخْبَرْتُهُمْ بِقَوْلِهَا فَرَدُّونِي إِلَى أُمِّ سَلَمَةَ بِمِثْلِ مَا أَرْسَلُونِي بِهِ إِلَى عَائِشَةَ فَقَالَتْ أُمُّ سَلَمَةَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْهُمَا ثُمَّ رَأَيْتُهُ يُصَلِّيهِمَا أَمَّا حِينَ صَلَّاهُمَا فَإِنَّهُ صَلَّى الْعَصْرَ ثُمَّ دَخَلَ وَعِنْدِي نِسْوَةٌ مِنْ بَنِي حَرَامٍ مِنْ الْأَنْصَارِ فَصَلَّاهُمَا فَأَرْسَلْتُ إِلَيْهِ الْجَارِيَةَ فَقُلْتُ قُومِي بِجَنْبِهِ فَقُولِي لَهُ تَقُولُ أُمُّ سَلَمَةَ يَا رَسُولَ اللَّهِ أَسْمَعُكَ تَنْهَى عَنْ هَاتَيْنِ الرَّكْعَتَيْنِ وَأَرَاكَ تُصَلِّيهِمَا فَإِنْ أَشَارَ بِيَدِهِ فَاسْتَأْخِرِي عَنْهُ قَالَتْ فَفَعَلَتْ الْجَارِيَةُ فَأَشَارَ بِيَدِهِ فَاسْتَأْخَرَتْ عَنْهُ فَلَمَّا انْصَرَفَ قَالَ يَا بِنْتَ أَبِي أُمَيَّةَ سَأَلْتِ عَنْ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ إِنَّهُ أَتَانِي نَاسٌ مِنْ عَبْدِ الْقَيْسِ بِالْإِسْلَامِ مِنْ قَوْمِهِمْ فَشَغَلُونِي عَنْ الرَّكْعَتَيْنِ اللَّتَيْنِ بَعْدَ الظُّهْرِ فَهُمَا هَاتَانِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku ['Amru bin Al Harits] dari [Bukair bin Al Asyaj] dari [Kuraib] bekas budak Ibnu Abbas, bahwa Abdullah bin Abbas dan Abdurrahman bin Azhar serta Al Miswar bin Al Mahramah pernah mengutusnya untuk menemui Aisyah isteri Nabi shallallahu 'alaihi wasallam, mereka berkata; \"Sampaikanlah salam kami kepada Aisyah dan tanyakan kepadanya tentang sholat (sunnah) setelah Ashar, dan katakan pula kepadanya bahwa kami pernah di beritahukan bahwa anda pernah mengerjakan dua raka'at setelah Ashar padahal Rasulullah shallallahu 'alaihi wasallam telah melarangnya.\" Lalu aku pergi menemui Aisyah dan menyampaikan pesan mereka kepadanya, lalu Aisyah berkata; \"Tanyakanlah kepada Ummu Salamah!.\" Maka aku keluar dan kembali menemui mereka dan menyampaikan apa yang di katakan Aisyah. Mereka mengembalikanku untuk menemui Ummu Salamah dengan berpesan seperti yang di pesankan kepadaku ketika pergi ke rumah Aisyah. Maka [Ummu Salamah] berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam melarang dua raka'at setelah Ashar, kemudian aku melihat beliau mengerjakan dua raka'at tersebut, ketika beliau melaksanakannya, yaitu beliau mengerjakan dulu sholat Ashar, lalu beliau masuk, sementara di rumahku ada beberapa wanita Anshar dari Bani Haram. Lalu beliau mengerjakan dua raka'at tersebut, setelah itu aku menyuruh seorang pelayan wanita untuk menemui beliau, kataku; \"Berdirilah di samping beliau dan tanyakan kepadanya; [Ummu Salamah] berkata; \"Wahai Rasulullah, aku pernah mendengar anda telah melarang dua raka'at ini, namun aku melihat justru anda melaksanakannya.\" Beliau memberi isyarat dengan tangannya, karena itu beliau mundur. Setelah selesai sholat, beliau bersabda: \"wahai putri Abu Umayyah, kamu tanyakan dua raka'at setelah Ashar? Sesungguhnya telah datang beberapa orang kepadaku dari kaum Abdul Qais, sementara mereka baru masuk Islam. Karena itu, mereka membuatku sibuk untuk mengerjakan dua raka'at setelah Dluhur, maka dua raka'at (Dluhur) adalah ini.\""
            },
            {
                "number": 1067,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ وَهْبِ بْنِ الْأَجْدَعِ عَنْ عَلِيٍّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الصَّلَاةِ بَعْدَ الْعَصْرِ إِلَّا وَالشَّمْسُ مُرْتَفِعَةٌ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Syu'bah] dari [Manshur] dari [Hilal bin Yasaf] dari [Wahb bin Al Ajda'] dari [Ali] bahwa Nabi shallallahu 'alaihi wasallam melarang mengerjakan sholat setelah Ashar kecuali jika matahari masih tinggi.\""
            },
            {
                "number": 1068,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي إِثْرِ كُلِّ صَلَاةٍ مَكْتُوبَةٍ رَكْعَتَيْنِ إِلَّا الْفَجْرَ وَالْعَصْرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Abu Ishaq] dari ['Ashim bin Dlamrah] dari [Ali] dia berkata; Rasulullah shallallahu 'alaihi wasallam biasa mengerjakan sholat dua raka'at di sela-sela (setelah) sholat wajib, kecuali sholat subuh dan ashar. '"
            },
            {
                "number": 1069,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبَانُ حَدَّثَنَا قَتَادَةُ عَنْ أَبِي الْعَالِيَةِ عَنْ ابْنِ عَبَّاسٍ قَالَشَهِدَ عِنْدِي رِجَالٌ مَرْضِيُّونَ فِيهِمْ عُمَرُ بْنُ الْخَطَّابِ وَأَرْضَاهُمْ عِنْدِي عُمَرُ أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا صَلَاةَ بَعْدَ صَلَاةِ الصُّبْحِ حَتَّى تَطْلُعَ الشَّمْسُ وَلَا صَلَاةَ بَعْدَ صَلَاةِ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Aban] telah menceritakan kepada kami [Qatadah] dari [Abu Al 'Aliyah] dari [Ibnu Abbas] dia berkata; \"Beberapa orang yang mendapatkan keridlaan (Allah) memberi kesaksian kepadaku, di antara mereka adalah [Umar bin Khattab], dan memang yang paling aku sukai di antara mereka adalah Umar, bahwa Nabi Allah shallallahu 'alaihi wasallam bersabda; \"Tidak ada sholat setelah sholat Shubuh hingga matahari terbit, dan tidak ada sholat setelah sholat Ashar hingga matahari terbenam.\""
            },
            {
                "number": 1070,
                "arab": "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُهَاجِرِ عَنْ الْعَبَّاسِ بْنِ سَالِمٍ عَنْ أَبِي سَلَّامٍ عَنْ أَبِي أُمَامَةَ عَنْ عَمْرِو بْنِ عَبَسَةَ السُّلَمِيِّ أَنَّهُ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَيُّ اللَّيْلِ أَسْمَعُ قَالَ جَوْفُ اللَّيْلِ الْآخِرُ فَصَلِّ مَا شِئْتَ فَإِنَّ الصَّلَاةَ مَشْهُودَةٌ مَكْتُوبَةٌ حَتَّى تُصَلِّيَ الصُّبْحَ ثُمَّ أَقْصِرْ حَتَّى تَطْلُعَ الشَّمْسُ فَتَرْتَفِعَ قِيسَ رُمْحٍ أَوْ رُمْحَيْنِ فَإِنَّهَا تَطْلُعُ بَيْنَ قَرْنَيْ شَيْطَانٍ وَيُصَلِّي لَهَا الْكُفَّارُ ثُمَّ صَلِّ مَا شِئْتَ فَإِنَّ الصَّلَاةَ مَشْهُودَةٌ مَكْتُوبَةٌ حَتَّى يَعْدِلَ الرُّمْحُ ظِلَّهُ ثُمَّ أَقْصِرْ فَإِنَّ جَهَنَّمَ تُسْجَرُ وَتُفْتَحُ أَبْوَابُهَا فَإِذَا زَاغَتْ الشَّمْسُ فَصَلِّ مَا شِئْتَ فَإِنَّ الصَّلَاةَ مَشْهُودَةٌ حَتَّى تُصَلِّيَ الْعَصْرَ ثُمَّ أَقْصِرْ حَتَّى تَغْرُبَ الشَّمْسُ فَإِنَّهَا تَغْرُبُ بَيْنَ قَرْنَيْ شَيْطَانٍ وَيُصَلِّي لَهَا الْكُفَّارُوَقَصَّ حَدِيثًا طَوِيلًا قَالَ الْعَبَّاسُ هَكَذَا حَدَّثَنِي أَبُو سَلَّامٍ عَنْ أَبِي أُمَامَةَ إِلَّا أَنْ أُخْطِئَ شَيْئًا لَا أُرِيدُهُ فَأَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ",
                "id": "Telah menceritakan kepada kami [Ar Rabi' bin Nafi'] telah menceritakan kepada kami [Muhammad bin Al Muhajir] dari [Al 'Abbas bin Salim] dari [Abu Salam] dari [Abu Umamah] dari ['Amru bin 'Abasah As Sulami] bahwa dia berkata; aku bertanya; \"Wahai Rasulullah, pada malam hari yang manakah yang paling di dengar (mustajab)?\" beliau bersabda: \"Di tengah malam yang terakhir, maka sholatlah kamu dengan sholat apa saja yang kamu kehendaki, karena sesungguhnya sholat (pada waktu itu) di saksikan (oleh para malaikat) dan di catat (pahalanya) sampai kamu sholat shubuh, setelah itu, berhentilah sampai matahari terbit dan meninggi sampai seukuran satu atau dua tombak, karena sesungguhnya (antara waktu itu) bertepatan dengan keluarnya tanduk setan dan orang-orang kafir sembahyang kepadanya. Setelah itu, sholatlah kamu dengan sholat apa saja yang kamu kehendaki, karena pada waktu itu, sholat di saksikan (oleh para Malaikat) dan di catat (pahalanya), sehingga tombak sama lurus dengan bayangannya, kemudian berhentilah (sejenak) karena sesungguhnya neraka Jahannam di nyalakan dan semua pintu-pintunya di buka, dan apabila matahari mulai condong (ke barat), Setelah itu, sholatlah kamu dengan sholat apa saja yang kamu kehendaki, karena pada waktu itu, sholat di saksikan (oleh para Malaikat) dan di catat (pahalanya), sampai kamu mengerjakan sholat Ashar, setelah itu berhentilah sampai matahari terbenam, karena (waktu itu) bertepatan dengan terbenamnya kedua tanduk syetan dan orang-orang kafir sembahyang kepadanya…\" selanjutnya Perawi menceritakan hadits yang panjang.\" Abbas berkata; Demikianlah Abu Salam menuturkan haditsnya kepadaku dari Abu Umamah, kecuali kalau ada kesalahan sedikit yang tidak aku sengaja, maka aku meminta ampun kepada Allah dan bertaubat kepada-Nya.\""
            },
            {
                "number": 1071,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا قُدَامَةُ بْنُ مُوسَى عَنْ أَيُّوبَ بْنِ حُصَيْنٍ عَنْ أَبِي عَلْقَمَةَ عَنْ يَسَارٍ مَوْلَى ابْنِ عُمَرَ قَالَرَآنِي ابْنُ عُمَرَ وَأَنَا أُصَلِّي بَعْدَ طُلُوعِ الْفَجْرِ فَقَالَ يَا يَسَارُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ عَلَيْنَا وَنَحْنُ نُصَلِّي هَذِهِ الصَّلَاةَ فَقَالَ لِيُبَلِّغْ شَاهِدُكُمْ غَائِبَكُمْ لَا تُصَلُّوا بَعْدَ الْفَجْرِ إِلَّا سَجْدَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Qudamah bin Musa] dari [Ayyub bin Hushain] dari [Abu Alqamah] dari [Yasar] bekas budak Ibnu Umar, dia berkata; [Ibnu Umar] pernah melihatku sedangkan aku tengah mengerjakan sholat setelah terbitnya fajar, dia berkata; \"Ya Yasar, sesungguhnya Rasulullah shallallahu 'alaihi wasallam pernah keluar menemui kami, sedangkan waktu itu kami tengah mengerjakan sholat seperti ini, maka beliau bersabda; \"Hendaknya orang yang menyaksikan (hadir) di antara kalian memberitahu terhadap orang yang tidak hadir, yaitu; janganlah kalian sholat setelah fajar, kecuali dua raka'at (sunnah fajar).\""
            },
            {
                "number": 1072,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ وَمَسْرُوقٍ قَالَا نَشْهَدُ عَلَى عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّهَا قَالَتْمَا مِنْ يَوْمٍ يَأْتِي عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا صَلَّى بَعْدَ الْعَصْرِ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Al Aswad] dan [Masruq] keduanya berkata; kami bersaksi atas [Aisyah] radliallahu 'anha bahwa dia berkata; \"Tidaklah suatu hari datang kepada Nabi shallallahu 'alaihi wasallam, kecuali beliau pernah mengerjakan sholat dua raka'at setelah Ashar.\""
            },
            {
                "number": 1073,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ حَدَّثَنَا عَمِّي حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ عَنْ ذَكْوَانَ مَوْلَى عَائِشَةَ أَنَّهَا حَدَّثَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بَعْدَ الْعَصْرِ وَيَنْهَى عَنْهَا وَيُوَاصِلُ وَيَنْهَى عَنْ الْوِصَالِ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Sa'd] telah menceritakan kepada kami [pamanku] telah menceritakan kepada kami [ayahku] dari [Ibnu Ishaq] dari [Muhammad bin 'Amru bin 'Atha`] dari [Dzakwan] bekas budak Aisyah bahwa [Aisyah] pernah mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan sholat (sunnah) setelah Ashar, lalu beliau melarangnya, dan pernah (puasa) wishal (puasa terus), kemudian beliau melarangnya.\""
            },
            {
                "number": 1074,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ عَنْ الْحُسَيْنِ الْمُعَلِّمِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ الْمُزَنِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلُّوا قَبْلَ الْمَغْرِبِ رَكْعَتَيْنِ ثُمَّ قَالَ صَلُّوا قَبْلَ الْمَغْرِبِ رَكْعَتَيْنِ لِمَنْ شَاءَ خَشْيَةَ أَنْ يَتَّخِذَهَا النَّاسُ سُنَّةً",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Umar] telah menceritakan kepada kami [Abdul Warits bin Sa'id] dari [Al Husain Al Mu'allim] dari ['Abdullah bin Buraidah] dari [Abdullah Al Muzanni] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholatlah kalian dua raka'at sebelum Maghrib.\" Kemudian beliau bersabda: \"sholatlah kalian dua raka'at sebelum Maghrib bagi yang suka.\" Beliau khawatir orang-orang menjadikannya sebagai sunnah (mu'akkadah).\""
            },
            {
                "number": 1075,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ الْبَزَّازُ أَخْبَرَنَا سَعِيدُ بْنُ سُلَيْمَانَ حَدَّثَنَا مَنْصُورُ بْنُ أَبِي الْأَسْوَدِ عَنْ الْمُخْتَارِ بْنِ فُلْفُلٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَصَلَّيْتُ الرَّكْعَتَيْنِ قَبْلَ الْمَغْرِبِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُلْتُ لِأَنَسٍ أَرَآكُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ رَآنَا فَلَمْ يَأْمُرْنَا وَلَمْ يَنْهَنَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdurrahim Al Bazzaz] telah mengabarkan kepada kami [Sa'id bin Sulaiman] telah menceritakan kepada kami [Manshur bin Abu Al Aswad] dari [Al Mukhtar Al Fulful] dari [Anas bin Malik] dia berkata; \"Aku pernah mengerjakan sholat dua raka'at sebelum Maghrib pada masa Rasulullah shallallahu 'alaihi wasallam.\" Mukhtar berkata; Lalu tanyaku kepada Anas; \"Apakah Rasulullah shallallahu 'alaihi wasallam pernah melihatmu (melakukan hal itu)?\" Anas menjawab; 'Ya, ketika itu beliau melihat kami, namun beliau tidak memerintahkan kami dan tidak juga melarang kami.\""
            },
            {
                "number": 1076,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا ابْنُ عُلَيَّةَ عَنْ الْجُرَيْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ لِمَنْ شَاءَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Ibnu 'Ulayyah] dari [Al Jurairi] dari [Abdullah bin Buraidah] dari [Abdullah bin Mughaffal] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Di antara setiap dua adzan (adzan dan Iqamah) terdapat sholat (sunnah), dan di antara setiap dua adzan (adzan dan Iqamah) terdapat sholat (sunnah), bagi siapa yang menghendakinya.\""
            },
            {
                "number": 1077,
                "arab": "حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي شُعَيْبٍ عَنْ طَاوُسٍ قَالَسُئِلَ ابْنُ عُمَرَ عَنْ الرَّكْعَتَيْنِ قَبْلَ الْمَغْرِبِ فَقَالَ مَا رَأَيْتُ أَحَدًا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّيهِمَا وَرَخَّصَ فِي الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِقَالَ أَبُو دَاوُد سَمِعْت يَحْيَى بْنَ مَعِينٍ يَقُولُ هُوَ شُعَيْبٌ يَعْنِي وَهِمَ شُعْبَةُ فِي اسْمِهِ",
                "id": "Telah menceritakan kepada kami [Ibnu Basyar] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abu Syu'aib] dari [Thawus] dia berkata; [Ibnu Umar] pernah di tanya mengenai dua raka'at sebelum Maghrib, dia menjawab; \"Aku tidak pernah melihat seorang pun pada masa Rasulullah shallallahu 'alaihi wasallam yang melakukan dua raka'at tersebut, namun beliau memberi keringanan pada dua raka'at setelah Ashar.\" Abu Daud berkata; aku mendengar Yahya bin Ma'in berkata; \"bahwa Perawi yang meriwayatkan hadits dari Thawus adalah Syu'aib (bukan Abu Syu'aib), Syu'bah ragu mengenai nama Syu'aib.\""
            },
            {
                "number": 1078,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ عَنْ عَبَّادِ بْنِ عَبَّادٍ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ الْمَعْنَى عَنْ وَاصِلٍ عَنْ يَحْيَى بْنِ عُقَيْلٍ عَنْ يَحْيَى بْنِ يَعْمَرَ عَنْ أَبِي ذَرٍّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُصْبِحُ عَلَى كُلِّ سُلَامَى مِنْ ابْنِ آدَمَ صَدَقَةٌ تَسْلِيمُهُ عَلَى مَنْ لَقِيَ صَدَقَةٌ وَأَمْرُهُ بِالْمَعْرُوفِ صَدَقَةٌ وَنَهْيُهُ عَنْ الْمُنْكَرِ صَدَقَةٌ وَإِمَاطَتُهُ الْأَذَى عَنْ الطَّرِيقِ صَدَقَةٌ وَبُضْعَةُ أَهْلِهِ صَدَقَةٌ وَيُجْزِئُ مِنْ ذَلِكَ كُلِّهِ رَكْعَتَانِ مِنْ الضُّحَىقَالَ أَبُو دَاوُد وَحَدِيثُ عَبَّادٍ أَتَمُّ وَلَمْ يَذْكُرْ مُسَدَّدٌ الْأَمْرَ وَالنَّهْيَ زَادَ فِي حَدِيثِهِ وَقَالَ كَذَا وَكَذَا وَزَادَ ابْنُ مَنِيعٍ فِي حَدِيثِهِ قَالُوا يَا رَسُولَ اللَّهِ أَحَدُنَا يَقْضِي شَهْوَتَهُ وَتَكُونُ لَهُ صَدَقَةٌ قَالَ أَرَأَيْتَ لَوْ وَضَعَهَا فِي غَيْرِ حِلِّهَا أَلَمْ يَكُنْ يَأْثَمُ",
                "id": "Telah mengabarkan kepada kami [Ahmad bin Mani'] dari ['Abbad bin 'Abbad]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Hammad bin Zaid] sedangkan makna haditsnya dari [Washil] dari [Yahya bin 'Uqail] dari [Yahya bin Ma'mar] dari [Abu Dzar] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Setiap pagi dari setiap ruas yang di miliki oleh ibnu Adam terdapat sedekahnya, memberi salam kepada orang yang di jumpainya adalah sedekah, memerintahkan kepada kebaikan adalah sedekah, mencegah dari kemungkaran adalah sedekah, menyingkirkan duri dari jalan adalah sedekah dan mengumpuli (bersenggama) dengan isterinya adalah sedekah, dan itu semua bisa di gantikan dengan dua raka'at sholat Dluha.\" Abu Daud berkata; \"Haditsnya 'Abbad lebih lengkap, namun Musaddad tidak menyebutkan kalimat \"Memerintahkan (yang ma'ruf) dan mencegah (dari kemungkaran) \", dalam haditsnya ada sedikit tambahan, beliau bersabda seperti ini dan ini, Ibnu Mani' menambahkan dalam haditsnya; para sahabat bertanya; \"Wahai Rasulullah, apakah jika salah seorang dari kami memenuhi tuntutan syahwatnya (mengumpuli isterinya) mendapatkan sedekah?\" beliau menjawab; \"Bagaimana pendapatmu jika dia meletakkan syahwatnya bukan pada yang di halalkannya, apakah dia mendapatkan dosa?\""
            },
            {
                "number": 1079,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ أَخْبَرَنَا خَالِدٌ عَنْ وَاصِلٍ عَنْ يَحْيَى بْنِ عُقَيْلٍ عَنْ يَحْيَى بْنِ يَعْمَرَ عَنْ أَبِي الْأَسْوَدِ الدُّؤَلِيِّ قَالَبَيْنَمَا نَحْنُ عِنْدَ أَبِي ذَرٍّ قَالَ يُصْبِحُ عَلَى كُلِّ سُلَامَى مِنْ أَحَدِكُمْ فِي كُلِّ يَوْمٍ صَدَقَةٌ فَلَهُ بِكُلِّ صَلَاةٍ صَدَقَةٌ وَصِيَامٍ صَدَقَةٌ وَحَجٍّ صَدَقَةٌ وَتَسْبِيحٍ صَدَقَةٌ وَتَكْبِيرٍ صَدَقَةٌ وَتَحْمِيدٍ صَدَقَةٌ فَعَدَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ هَذِهِ الْأَعْمَالِ الصَّالِحَةِ ثُمَّ قَالَ يُجْزِئُ أَحَدَكُمْ مِنْ ذَلِكَ رَكْعَتَا الضُّحَى",
                "id": "Telah menceritakan kepada kami [Wahb bin Baqiyah] telah mengabarkan kepada kami [Khalid] dari [Washil] dari [Yahya bin 'Uqail] dari [Yahya bin Ya'mar] dari [Abu Al Aswad Ad Du`ali] dia berkata; \"ketika kami berada di dekat [Abu Dzar], dia berkata; \"Hendaklah masing-masing dari kalian setiap harinya bersedekah untuk setiap ruas tulangnya. Setiap sholat (yang ia kerjakan) menjadi sedekah baginya, puasa adalah sedekah, haji adalah sedekah, bacaan tasbih adalah sedekah, bacaan takbir juga sedekah, bacaan tahmid adalah sedekah.\" Rasulullah shallallahu 'alaihi wasallam menghitung (menyebutkan) semua amal Shalih ini, lalu bersabda: \"Cukuplah salah seorang dari kalian mengerjakan sholat dua raka'at dhuha untuk menggantikan semua itu.\""
            },
            {
                "number": 1080,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ يَحْيَى بْنِ أَيُّوبَ عَنْ زَبَّانَ بْنِ فَائِدٍ عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ الْجُهَنِيِّ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَعَدَ فِي مُصَلَّاهُ حِينَ يَنْصَرِفُ مِنْ صَلَاةِ الصُّبْحِ حَتَّى يُسَبِّحَ رَكْعَتَيْ الضُّحَى لَا يَقُولُ إِلَّا خَيْرًا غُفِرَ لَهُ خَطَايَاهُ وَإِنْ كَانَتْ أَكْثَرَ مِنْ زَبَدِ الْبَحْرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Salamah Al Muradi] telah menceritakan kepada kami [Ibnu Wahb] dari [Yahya bin Ayyub] dari [Zabban bin Fa`id] dari [Sahl bin Mu'adz bin Anas Al Juhani] dari [ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa tetap duduk di tempat sholatnya ketika selesai dari sholat shubuh sampai dia mengerjakan dua raka'at dluha dan tidak mengucapkan kata-kata kecuali yang baik, melainkan dosa-dosanya akan terampuni meskipun lebih banyak dari buih di lautan.\""
            },
            {
                "number": 1081,
                "arab": "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ عَنْ يَحْيَى بْنِ الْحَارِثِ عَنْ الْقَاسِمِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي أُمَامَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةٌ فِي إِثْرِ صَلَاةٍ لَا لَغْوَ بَيْنَهُمَا كِتَابٌ فِي عِلِّيِّينَ",
                "id": "Telah menceritakan kepada kami [Abu Taubah Ar Rabi' bin Nafi'] telah menceritakan kepada kami [Al Haitsam bin Humaid] dari [Yahya bin Al Harits] dari [Al Qasim bin Abdurrahman] dari [Abu Umamah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Suatu sholat yang di kerjakan setelah sholat, yang antara kedua sholat tersebut tidak ada perkataan yang sia-sia, melainkan akan menjadi suatu catatan amal kelak di 'Iliyyin (nama surga).\""
            },
            {
                "number": 1082,
                "arab": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا الْوَلِيدُ عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ عَنْ مَكْحُولٍ عَنْ كَثِيرِ بْنِ مُرَّةَ أَبِي شَجَرَةَ عَنْ نُعَيْمِ بْنِ هَمَّارٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَقُولُ اللَّهُ عَزَّ وَجَلَّ يَا ابْنَ آدَمَ لَا تُعْجِزْنِي مِنْ أَرْبَعِ رَكَعَاتٍ فِي أَوَّلِ نَهَارِكَ أَكْفِكَ آخِرَهُ",
                "id": "Telah menceritakan kepada kami [Daud bin Rusyaid] telah menceritakan kepada kami [Al Walid] dari [Sa'id bin Abdul Aziz] dari [Makhul] dari [Katsir bin Murrah Abu Syajarah] dari [Nu'aim bin Hammar] dia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah 'azza wajalla berfirman; Wahai anak Adam, janganlah kamu meninggalkan-Ku (karena tidak mengerjakan) empat raka'at pada permulaan siang, niscaya aku akan mencukupi kebutuhanmu di sore hari.\""
            },
            {
                "number": 1083,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ وَأَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي عَيَّاضُ بْنُ عَبْدِ اللَّهِ عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ عَنْ كُرَيْبٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ أُمِّ هَانِئٍ بِنْتِ أَبِي طَالِبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ صَلَّى سُبْحَةَ الضُّحَى ثَمَانِيَ رَكَعَاتٍ يُسَلِّمُ مِنْ كُلِّ رَكْعَتَيْنِ قَالَ أَحْمَدُ بْنُ صَالِحٍ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى يَوْمَ الْفَتْحِ سُبْحَةَ الضُّحَى فَذَكَرَ مِثْلَهُ قَالَ ابْنُ السَّرْحِ إِنَّ أُمَّ هَانِئٍ قَالَتْ دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَذْكُرْ سُبْحَةَ الضُّحَى بِمَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] dan [Ahmad bin 'Amru bin As Sarh] keduanya berkata; telah menceritakan kepada kami [Ibnu Wahb] telah menceritakan kepadaku ['Ayyadl bin Abdullah] dari [Makhramah bin Sulaiman] dari [Kuraib] bekas budak Ibnu Abbas, dari [Ummu Hani` binti Abu Thalib] bahwa pada hari penaklukan kota Makkah, Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan sholat Dhuha delapan raka'at, di setiap dua raka'at beliau salam.\" [Ahmad bin Shalih] berkata; \"Sesungguhnya pada hari penaklukan kota Makkah, Rasulullah shallallahu 'alaihi wasallam pernah mengerjakan sholat Dhuha …\" kemudian dia menyebutkan seperti hadits di atas.\" [Ibnu As Sarh] mengatakan; Sesungguhnya [Ummu Hani`] berkata; \"Rasulullah shallallahu 'alaihi wasallam masuk menemuiku…\" tanpa menyebutkan kalimat \"Mengerjakan sholat Dhuha\" dengan maksud haditsnya.\""
            },
            {
                "number": 1084,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ ابْنِ أَبِي لَيْلَى قَالَمَا أَخْبَرَنَا أَحَدٌ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الضُّحَى غَيْرُ أُمِّ هَانِئٍ فَإِنَّهَا ذَكَرَتْ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فَتْحِ مَكَّةَ اغْتَسَلَ فِي بَيْتِهَا وَصَلَّى ثَمَانِيَ رَكَعَاتٍ فَلَمْ يَرَهُ أَحَدٌ صَلَّاهُنَّ بَعْدُ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari ['Amru bin Murrah] dari [Ibnu Abu Laila] dia berkata; Tidak ada seorang pun yang menyampaikan kepada kami bahwa dirinya pernah melihat Nabi shallallahu 'alaihi wasallam mengerjakan sholat Dluha selain [Ummu Hani`], bahwa dirinya menyebutkan bahwa pada hari penaklukan kota Makkah, Nabi shallallahu 'alaihi wasallam pernah mandi di rumahnya kemudian beliau mengerjakan sholat delapan raka'at, dan tidak ada seorang pun yang melihat beliau mengerjakannya setelah itu.\""
            },
            {
                "number": 1085,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا الْجُرَيْرِيُّ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَ سَأَلْتُ عَائِشَةَهَلْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الضُّحَى فَقَالَتْ لَا إِلَّا أَنْ يَجِيءَ مِنْ مَغِيبِهِ قُلْتُ هَلْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرِنُ بَيْنَ السُّورَتَيْنِ قَالَتْ مِنْ الْمُفَصَّلِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Al Jurairi] dari [Abdullah bin Syaqiq] dia berkata; aku pernah bertanya kepada [Aisyah]; \"Apakah Rasulullah shallallahu 'alaihi wasallam biasa melaksanakan sholat Dhuha?\" Aisyah menjawab; \"tidak, kecuali jika beliau tiba dari suatu perjalanan.\" Tanyaku selanjutnya; \"Apakah beliau juga sering menggabungkan antara dua surat?\" Jawab Aisyah; \"Ya, di surat-surat yang di baca pendek (yaitu dari surat Qaaf atau Al Hujurat sampai surat an nas -pent).\""
            },
            {
                "number": 1086,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْمَا سَبَّحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُبْحَةَ الضُّحَى قَطُّ وَإِنِّي لَأُسَبِّحُهَا وَإِنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيَدَعُ الْعَمَلَ وَهُوَ يُحِبُّ أَنْ يَعْمَلَ بِهِ خَشْيَةَ أَنْ يَعْمَلَ بِهِ النَّاسُ فَيُفْرَضَ عَلَيْهِمْ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari ['Urwah bin Zubair] dari ['Aisyah istri Nabi shallallahu 'alaihi wasallam] bahwa dia berkata; \"Rasulullah shallallahu 'alaihi wasallam sama sekali tidak pernah mengerjakan sholat sunnah Dluha, dan aku sungguh mengerjakannya, walaupun Rasulullah shallallahu 'alaihi wasallam meninggalkan amal kebaikan yang sebenarnya beliau suka mengerjakannya, hal itu karena beliau khawatir di kerjakan oleh orang-orang yang akhirnya amalan itu di wajibkan atas mereka.\""
            },
            {
                "number": 1087,
                "arab": "حَدَّثَنَا ابْنُ نُفَيْلٍ وَأَحْمَدُ بْنُ يُونُسَ قَالَا حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا سِمَاكٌ قَالَقُلْتُ لِجَابِرِ بْنِ سَمُرَةَ أَكُنْتَ تُجَالِسُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ كَثِيرًا فَكَانَ لَا يَقُومُ مِنْ مُصَلَّاهُ الَّذِي صَلَّى فِيهِ الْغَدَاةَ حَتَّى تَطْلُعَ الشَّمْسُ فَإِذَا طَلَعَتْ قَامَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ibnu Nufail] dan [Ahmad bin Yunus] keduanya berkata; telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Simak] dia berkata; \"Kataku kepada [Jabir bin Samurah]; \"Apakah kamu pernah bermajlis bersama Rasulullah shallallahu 'alaihi wasallam?\" jawabnya; \"Ya, sering, beliau tidak berdiri dari tempat beliau mengerjakan sholat subuh sehingga matahari terbit, apabila matahari telah terbit, maka beliau shallallahu 'alaihi wasallam berdiri.\""
            },
            {
                "number": 1088,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ أَخْبَرَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ عَلِيِّ بْنِ عَبْدِ اللَّهِ الْبَارِقِيِّ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَى",
                "id": "Telah menceritakan kepada kami ['Umar bin Marzuq] telah mengabarkan kepada kami [Syu'bah] dari [Ya'la bin 'Atha`] dari [Ali bin Abdullah Al Bariqi] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"sholat di malam dan siang hari adalah dua-dua (raka'at).\""
            },
            {
                "number": 1089,
                "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ حَدَّثَنَا شُعْبَةُ حَدَّثَنِي عَبْدُ رَبِّهِ بْنُ سَعِيدٍ عَنْ أَنَسِ بْنِ أَبِي أَنَسٍ عَنْ عَبْدِ اللَّهِ بْنِ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ الْمُطَّلِبِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الصَّلَاةُ مَثْنَى مَثْنَى أَنْ تَشَهَّدَ فِي كُلِّ رَكْعَتَيْنِ وَأَنْ تَبَاءَسَ وَتَمَسْكَنَ وَتُقْنِعَ بِيَدَيْكَ وَتَقُولَ اللَّهُمَّ اللَّهُمَّ فَمَنْ لَمْ يَفْعَلْ ذَلِكَ فَهِيَ خِدَاجٌسُئِلَ أَبُو دَاوُد عَنْ صَلَاةِ اللَّيْلِ مَثْنَى قَالَ إِنْ شِئْتَ مَثْنَى وَإِنْ شِئْتَ أَرْبَعًا",
                "id": "Telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Mu'adz bin Mu'adz] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepadaku ['Abd Rabbihi bin Sa'id] dari [Anas bin Abu Anas] dari [Abdullah bin Nafi'] dari [Abdullah bin Al Harits] dari [Al Mutthalib] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"sholat itu dua-dua (raka'at), hendaknya kamu (duduk) tasyahud setiap dua raka'at, hendaknya kamu khusyu', tenang dan berdo'a (dengan mengangkat kedua tanganmu), sambil mengucapkan; \"Ya Allah, Ya Allah …, barangsiapa tidak melakukan hal itu, maka sholatnya kurang (sempurna).\" Abu Daud di tanya mengenai sholat malam, apakah dua raka'at-dua raka'at?\" jawabnya; \"Jika mau dua raka'at-dua raka'at, dan jika mau boleh empat raka'at-empat raka'at.\""
            },
            {
                "number": 1090,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ بِشْرِ بْنِ الْحَكَمِ النَّيْسَابُورِيُّ حَدَّثَنَا مُوسَى بْنُ عَبْدِ الْعَزِيزِ حَدَّثَنَا الْحَكَمُ بْنُ أَبَانَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ يَا عَبَّاسُ يَا عَمَّاهُ أَلَا أُعْطِيكَ أَلَا أَمْنَحُكَ أَلَا أَحْبُوكَ أَلَا أَفْعَلُ بِكَ عَشْرَ خِصَالٍ إِذَا أَنْتَ فَعَلْتَ ذَلِكَ غَفَرَ اللَّهُ لَكَ ذَنْبَكَ أَوَّلَهُ وَآخِرَهُ قَدِيمَهُ وَحَدِيثَهُ خَطَأَهُ وَعَمْدَهُ صَغِيرَهُ وَكَبِيرَهُ سِرَّهُ وَعَلَانِيَتَهُ عَشْرَ خِصَالٍ أَنْ تُصَلِّيَ أَرْبَعَ رَكَعَاتٍ تَقْرَأُ فِي كُلِّ رَكْعَةٍ فَاتِحَةَ الْكِتَابِ وَسُورَةً فَإِذَا فَرَغْتَ مِنْ الْقِرَاءَةِ فِي أَوَّلِ رَكْعَةٍ وَأَنْتَ قَائِمٌ قُلْتَ سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ خَمْسَ عَشْرَةَ مَرَّةً ثُمَّ تَرْكَعُ فَتَقُولُهَا وَأَنْتَ رَاكِعٌ عَشْرًا ثُمَّ تَرْفَعُ رَأْسَكَ مِنْ الرُّكُوعِ فَتَقُولُهَا عَشْرًا ثُمَّ تَهْوِي سَاجِدًا فَتَقُولُهَا وَأَنْتَ سَاجِدٌ عَشْرًا ثُمَّ تَرْفَعُ رَأْسَكَ مِنْ السُّجُودِ فَتَقُولُهَا عَشْرًا ثُمَّ تَسْجُدُ فَتَقُولُهَا عَشْرًا ثُمَّ تَرْفَعُ رَأْسَكَ فَتَقُولُهَا عَشْرًا فَذَلِكَ خَمْسٌ وَسَبْعُونَ فِي كُلِّ رَكْعَةٍ تَفْعَلُ ذَلِكَ فِي أَرْبَعِ رَكَعَاتٍ إِنْ اسْتَطَعْتَ أَنْ تُصَلِّيَهَا فِي كُلِّ يَوْمٍ مَرَّةً فَافْعَلْ فَإِنْ لَمْ تَفْعَلْ فَفِي كُلِّ جُمُعَةٍ مَرَّةً فَإِنْ لَمْ تَفْعَلْ فَفِي كُلِّ شَهْرٍ مَرَّةً فَإِنْ لَمْ تَفْعَلْ فَفِي كُلِّ سَنَةٍ مَرَّةً فَإِنْ لَمْ تَفْعَلْ فَفِي عُمُرِكَ مَرَّةًحَدَّثَنَا مُحَمَّدُ بْنُ سُفْيَانَ الْأُبُلِّيُّ حَدَّثَنَا حَبَّانُ بْنُ هِلَالٍ أَبُو حَبِيبٍ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ حَدَّثَنَا عَمْرُو بْنُ مَالِكٍ عَنْ أَبِي الْجَوْزَاءِ قَالَ حَدَّثَنِي رَجُلٌ كَانَتْ لَهُ صُحْبَةٌ يَرَوْنَ أَنَّهُ عَبْدُ اللَّهِ بْنُ عَمْرٍو قَالَ قَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ائْتِنِي غَدًا أَحْبُوكَ وَأُثِيبُكَ وَأُعْطِيكَ حَتَّى ظَنَنْتُ أَنَّهُ يُعْطِينِي عَطِيَّةً قَالَ إِذَا زَالَ النَّهَارُ فَقُمْ فَصَلِّ أَرْبَعَ رَكَعَاتٍ فَذَكَرَ نَحْوَهُ قَالَ ثُمَّ تَرْفَعُ رَأْسَكَ يَعْنِي مِنْ السَّجْدَةِ الثَّانِيَةِ فَاسْتَوِ جَالِسًا وَلَا تَقُمْ حَتَّى تُسَبِّحَ عَشْرًا وَتَحْمَدَ عَشْرًا وَتُكَبِّرَ عَشْرًا وَتُهَلِّلَ عَشْرًا ثُمَّ تَصْنَعَ ذَلِكَ فِي الْأَرْبَعِ الرَّكَعَاتِ قَالَ فَإِنَّكَ لَوْ كُنْتَ أَعْظَمَ أَهْلِ الْأَرْضِ ذَنْبًا غُفِرَ لَكَ بِذَلِكَ قُلْتُ فَإِنْ لَمْ أَسْتَطِعْ أَنْ أُصَلِّيَهَا تِلْكَ السَّاعَةَ قَالَ صَلِّهَا مِنْ اللَّيْلِ وَالنَّهَارِ قَالَ أَبُو دَاوُد حَبَّانُ بْنُ هِلَالٍ خَالُ هِلَالٍ الرَّأْيِ قَالَ أَبُو دَاوُد رَوَاهُ الْمُسْتَمِرُّ بْنُ الرَّيَّانِ عَنْ أَبِي الْجَوْزَاءِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو مَوْقُوفًا وَرَوَاهُ رَوْحُ بْنُ الْمُسَيَّبِ وَجَعْفَرُ بْنُ سُلَيْمَانَ عَنْ عَمْرِو بْنِ مَالِكٍ النُّكْرِيِّ عَنْ أَبِي الْجَوْزَاءِ عَنْ ابْنِ عَبَّاسٍ قَوْلُهُ وَقَالَ فِي حَدِيثِ رَوْحٍ فَقَالَ حَدِيثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا مُحَمَّدُ بْنُ مُهَاجِرٍ عَنْ عُرْوَةَ بْنِ رُوَيْمٍ حَدَّثَنِي الْأَنْصَارِيُّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِجَعْفَرٍ بِهَذَا الْحَدِيثِ فَذَكَرَ نَحْوَهُمْ قَالَ فِي السَّجْدَةِ الثَّانِيَةِ مِنْ الرَّكْعَةِ الْأُولَى كَمَا قَالَ فِي حَدِيثِ مَهْدِيِّ بْنِ مَيْمُونٍ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Bisyr bin Hakam An Naisabury] telah menceritakan kepada kami [Musa bin Abdul Aziz] telah menceritakan kepada kami [Al Hakam bin Aban] dari [Ikrimah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepada Abbas bin Abdul Mutthalib: \"Wahai Abbas, wahai pamanku, sukakah paman, aku beri, aku karuniai, aku beri hadiah istimewa, aku ajari sepuluh macam kebaikan yang dapat menghapus sepuluh macam dosa? Jika paman mengerjakan ha itu, maka Allah akan mengampuni dosa-dosa paman, baik yang awal dan yang akhir, baik yang telah lalu atau yang akan datang, yang di sengaja ataupun tidak, yang kecil maupun yang besar, yang samar-samar maupun yang terang-terangan. Sepuluh macam kebaikan itu ialah; \"Paman mengerjakan sholat empat raka'at, dan setiap raka'at membaca AL Fatihah dan surat, apabila selesai membaca itu, dalam raka'at pertama dan masih berdiri, bacalah; \"Subhanallah wal hamdulillah walaa ilaaha illallah wallahu akbar (Maha suci Allah, segala puji bagi Allah, tidak ada ilah selain Allah dan Allah Maha besar) \" sebanyak lima belas kali, lalu ruku', dan dalam ruku' membaca bacaan seperti itu sebanyak sepuluh kali, kemudian mengangkat kepala dari ruku' (i'tidal) juga membaca seperti itu sebanyak sepuluh kali, lalu sujud juga membaca sepuluh kali, setelah itu mengangkat kepala dari sujud (duduk di antara dua sujud) juga membaca sepuluh kali, lalu sujud juga membaca sepuluh kali, kemudian mengangkat kepala dan membaca sepuluh kali, Salim bin Abul Ja'd jumlahnya ada tujuh puluh lama kali dalam setiap raka'at, paman dapat melakukannya dalam empat raka'at. jika paman sanggup mengerjakannya sekali dalam sehari, kerjakanlah. Jika tidak mampu, kerjakanlah setiap jum'at, jika tidak mampu, kerjakanlah setiap bulan, jika tidak mampu, kerjakanlah setiap tahun sekali. Dan jika masih tidak mampu, kerjakanlah sekali dalam seumur hidup.\" Telah menceritakan kepada kami [Muhammad bin Sufyan Al Ubuli] telah menceritakan kepada kami [Habban bin Hilal Abu Habib] telah menceritakan kepada kami [Mahdi bin Maimun] telah menceritakan kepada kami ['Amru bin Malik] dari [Abu Jauza`] dia berkata; telah menceritakan kepada kami seseorang laki-laki yang pernah bersahabat dengannya, menurut mereka, dia adalah [Abdullah bin 'Amru] dia berkata; Nabi shallallahu 'alaihi wasallam bersabda kepadaku: \"Datanglah kepadaku besok hari, aku akan memberimu suatu pemberian.\" Hingga aku mengira beliau benar-benar akan memberiku suatu pemberian. Beliau bersabda: \"Apabila siang agak reda, maka berdirilah untuk menunaikan sholat empat raka'at…\" kemudian dia menyebutkan hadits seperti di atas. Beliau lalu bersabda: \"Kemudian kamu mengangkat kepalamu -yaitu dari sujud kedua- sehingga kamu benar-benar duduk, dan janganlah berdiri hingga membaca tasbih, tahmid, takbir dan tahlil masing-masing sepuluh kali, lalu kamu melakukan hal itu di empat raka'at.\" Beliau melanjutkan; \"Seandainya kamu orang yang paling besar dosanya di antara penduduk bumi, maka dosa-dosamu akan di ampuni dengan melakukan hal itu (sholat tasbih).\" Aku bertanya; \"Jika aku tidak mampu melaksanakan sholat tasbih pada waktu itu?\" beliau menjawab: \"Kerjakanlah di malam hari atau siang hari.\" Abu Daud berkata; \"Habban bin Daud adalah pamannya Hilal Ar Ra'yi. Abu Daud berkata; \"Hadits ini di riwayawatkan pula oleh [Al Mustamir Ar Rayyan] dari [Abu Al Jauza`] dari [Abdullah bin 'Amru] secara mauquf. Dan di riwayatkan pula oleh [Rauh bin Al Musayyab] dan [Ja'far bin Sulaiman] dari ['Amru bin Malik An Nukri] dari [Abu Al Jauza`] dari [Ibnu Abbas]. Sedangkan perkataannya mengenai hadits Rauh, dia berkata; yaitu hadits dari Nabi shallallahu 'alaihi wasallam. Telah menceritakan kepada kami [Abu Taubah Ar Rabi' bin Nafi'] telah menceritakan kepada kami [Muhammad bin Muhajir] dari ['Urwah bin Ruwaim] telah menceritakan kepadaku [Al Anshari] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepada Ja'far…\" dengan hadits ini, lalu dia menyebutkan seperti hadits mereka, katanya; \"……dalam sujud kedua pada raka'at pertama.\" Sebagaimana dia berkata dalam hadits Mahdi bin Maimun.\""
            },
            {
                "number": 1091,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي الْأَسْوَدِ حَدَّثَنِي أَبُو مُطَرِّفٍ مُحَمَّدُ بْنُ أَبِي الْوَزِيرِ حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى الْفِطْرِيُّ عَنْ سَعْدِ بْنِ إِسْحَقَ بْنِ كَعْبِ بْنِ عُجْرَةَ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى مَسْجِدَ بَنِي عَبْدِ الْأَشْهَلِ فَصَلَّى فِيهِ الْمَغْرِبَ فَلَمَّا قَضَوْا صَلَاتَهُمْ رَآهُمْ يُسَبِّحُونَ بَعْدَهَا فَقَالَ هَذِهِ صَلَاةُ الْبُيُوتِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Al Aswad] telah menceritakan kepadaku [Abu Mutharif Muhammad bin Abu Al Wazir] telah menceritakan kepada kami [Muhammad bin Musa Al fitri] dari [Sa'd bin Ishaq bin Ka'b bin 'Ujrah] dari [ayahnya] dari [kakeknya] bahwa Nabi shallallahu 'alaihi wasallam pernah datang berkunjung ke Masjid Bani Abdul Asyhal, kemudian beliau sholat Maghrib, ketika mereka selesai mengerjakan sholat Maghrib, beliau melihat mereka mengerjakan sholat sunnah, maka beliau bersabda: \"sholat ini adalah sholat untuk di kerjakan di rumah.\""
            },
            {
                "number": 1092,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ عَبْدِ الرَّحْمَنِ الْجَرْجَرَائِيُّ حَدَّثَنَا طَلْقُ بْنُ غَنَّامٍ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ اللَّهِ عَنْ جَعْفَرِ بْنِ أَبِي الْمُغِيرَةِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُطِيلُ الْقِرَاءَةَ فِي الرَّكْعَتَيْنِ بَعْدَ الْمَغْرِبِ حَتَّى يَتَفَرَّقَ أَهْلُ الْمَسْجِدِقَالَ أَبُو دَاوُد رَوَاهُ نَصْرٌ الْمُجَدَّرُ عَنْ يَعْقُوبَ الْقُمِّيِّ وَأَسْنَدَهُ مِثْلَهُ قَالَ أَبُو دَاوُد حَدَّثَنَاه مُحَمَّدُ بْنُ عِيسَى بْنِ الطَّبَّاعِ حَدَّثَنَا نَصْرٌ الْمُجَدَّرُ عَنْ يَعْقُوبَ مِثْلَهُ حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ وَسُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ قَالَا حَدَّثَنَا يَعْقُوبُ عَنْ جَعْفَرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ النَّبِيِّ بِمَعْنَاهُ مُرْسَلًا قَالَ أَبُو دَاوُد سَمِعْت مُحَمَّدَ بْنَ حُمَيْدٍ يَقُولُ سَمِعْتُ يَعْقُوبَ يَقُولُ كُلُّ شَيْءٍ حَدَّثْتُكُمْ عَنْ جَعْفَرِ بْنِ الْمُغِيرَةِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهُوَ مُسْنَدٌ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Husain bin Abdurrahman Al Jarjara`i] telah menceritakan kepada kami [Thalq bin Ghanam] telah menceritakan kepada kami [Ya'qub bin Abdullah] dari [Ja'far bin Abu Al Mughirah] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa memanjangkan bacaan di dua raka'at (sholat sunnah) setelah Maghrib sehingga orang-orang dalam masjid bubar.\" Abu Daud berkata; \"Telah di riwayatkan pula oleh [Nahsr Al Mujaddar] dari [Ya'qub Al Qummi] dengan mensanadkan seperti hadits di atas. Abu Daud berkata; telah menceritakan kepada kami [Muhammad bin Isa bin Ath Thaba'] telah menceritakan kepada kami [Nashr Al Mujaddar] dari [Ya'qub] seperti hadits di atas. Telah menceritakan kepada kami [Ahmad bin Yunus] dan [Sulaiman bin Daud Al 'Ataki] keduanya berkata; telah menceritakan kepada kami [Ya'qub] dari [Ja'far] dari [sa'id bin Jubair] dari Nabi shallallahu 'alaihi wasallam dengan maksud yang sama, secara mursal. Abu Daud berkata; aku mendengar Muhammad bin Humaid berkata; aku mendengar Ya'qub berkata; \"Setiap (hadits) yang aku sampaikan kepada kalian dari Ja'far bin Mughirah dari Sa'id bin Jubair dari Nabi shallallahu 'alaihi wasallam adalah musnad (bersambung) dari Ibnu Abbas dari Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 1093,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ الْعُكْلِيُّ حَدَّثَنِي مَالِكُ بْنُ مِغْوَلٍ حَدَّثَنِي مُقَاتِلُ بْنُ بَشِيرٍ الْعِجْلِيُّ عَنْ شُرَيْحِ بْنِ هَانِئٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَسَأَلْتُهَا عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ مَا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعِشَاءَ قَطُّ فَدَخَلَ عَلَيَّ إِلَّا صَلَّى أَرْبَعَ رَكَعَاتٍ أَوْ سِتَّ رَكَعَاتٍ وَلَقَدْ مُطِرْنَا مَرَّةً بِاللَّيْلِ فَطَرَحْنَا لَهُ نِطَعًا فَكَأَنِّي أَنْظُرُ إِلَى ثُقْبٍ فِيهِ يَنْبُعُ الْمَاءُ مِنْهُ وَمَا رَأَيْتُهُ مُتَّقِيًا الْأَرْضَ بِشَيْءٍ مِنْ ثِيَابِهِ قَطُّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Zaid bin Al Khubbab Al 'Ukali] telah menceritakan kepadaku [Malik bin Mighwal] telah menceritakan kepadaku [Muqatil bin Basyir Al 'Ijli] dari [Syuraih bin Hani`] dari [Aisyah radliallahu 'anha]. Syuraih berkata; aku bertanya kepada Aisyah mengenai sholat Rasulullah shallallahu 'alaihi wasallam.\" Aisyah menjawab; \"Rasulullah shallallahu 'alaihi wasallam tidak pernah mengerjakan sholat Isya` sama sekali kemudian menemuiku melainkan beliau sholat (sunnah) sesudahnya empat atau enam raka'at. Suatu malam kami terkena hujan, kontan kami hamparkan selembar tikar kulit untuk beliau, dan seakan-akan kulihat suatu lubang pada tikar tersebut mengeluarkan rembesan air, dan tidak kulihat beliau menjauhkan tanah dengan bagian manapun dari kainnya.\""
            },
            {
                "number": 1094,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ ابْنِ شَبُّوَيْهِ حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ عَنْ أَبِيهِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَفِي الْمُزَّمِّلِ{ قُمْ اللَّيْلَ إِلَّا قَلِيلًا نِصْفَهُ }نَسَخَتْهَا الْآيَةُ الَّتِي فِيهَا{ عَلِمَ أَنْ لَنْ تُحْصُوهُ فَتَابَ عَلَيْكُمْ فَاقْرَءُوا مَا تَيَسَّرَ مِنْ الْقُرْآنِ }وَنَاشِئَةُ اللَّيْلِ أَوَّلُهُ وَكَانَتْ صَلَاتُهُمْ لِأَوَّلِ اللَّيْلِ يَقُولُ هُوَ أَجْدَرُ أَنْ تُحْصُوا مَا فَرَضَ اللَّهُ عَلَيْكُمْ مِنْ قِيَامِ اللَّيْلِ وَذَلِكَ أَنَّ الْإِنْسَانَ إِذَا نَامَ لَمْ يَدْرِ مَتَى يَسْتَيْقِظُ وَقَوْلُهُ أَقْوَمُ قِيلًا هُوَ أَجْدَرُ أَنْ يَفْقَهَ فِي الْقُرْآنِ وَقَوْلُهُ{ إِنَّ لَكَ فِي النَّهَارِ سَبْحًا طَوِيلًا }يَقُولُ فَرَاغًا طَوِيلًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad Al Mawarzi Ibnu Syabbuwaih] telah menceritakan kepadaku [Ali bin Husain] dari [ayahnya] dari [Yazid An Nahwi] dari [Ikrimah] dari [Ibnu Abbas] dia berkata mengenai surt Al Muzammil, yaitu; \"Bangunlah (sholat) di malam hari, kecuali sedikit daripadanya, (yaitu) separuhnya.\" (QS Al Muzammil; 2-3). Ayat tersebut di hapus dengan surat ini, yaitu; \"Allah mengetahui bahwa kamu sekali-kali tidak dapat menentukan batas-batas waktu itu, maka Dia memberi keringanan kepadamu, karena itu bacalah apa yang mudah (bagimu) dari al-qur'an.\" (QS Al Muzzamil; 20). Maksud dari \"Nasyi`atul lail\" adalah sholat tahajjudnya mereka (para sahabat) di awal malam (sebelum di mansukh).\" Ibnu Abbas melanjutkan; \"Tahajjud di awal malam lebih sesuai untuk kamu tentukan batas waktu bangun malam yang telah di wajibkan Allah atas kamu. Hal itu karena manusia, apabila telah tidur, ia tidak tahu kapan dirinya bangun.\" Maksud firman Allah; \"Aqwamu qiila\" ialah lebih sesuai untuk memahami al-qur'an (ketika di baca pada malam hari) \" dan maksud ayat; \"Inna laka fin nahaari sabhan thawiila\" ialah kesempatan yang panjang.\""
            },
            {
                "number": 1095,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ يَعْنِي الْمَرْوَزِيَّ حَدَّثَنَا وَكِيعٌ عَنْ مِسْعَرٍ عَنْ سِمَاكٍ الْحَنَفِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَلَمَّا نَزَلَتْ أَوَّلُ الْمُزَّمِّلِ كَانُوا يَقُومُونَ نَحْوًا مِنْ قِيَامِهِمْ فِي شَهْرِ رَمَضَانَ حَتَّى نَزَلَ آخِرُهَا وَكَانَ بَيْنَ أَوَّلِهَا وَآخِرِهَا سَنَةٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad yaitu Al Mawarzi] telah menceritakan kepada kami [Waki'] dari [Mis'ar] dari [Simak Al Hanafi] dari [Ibnu Abbas] dia berkata; \"Ketika turun awal surat Al Muzammil, mereka (para sahabat) bangun (untuk mengerjakan sholat) sebagaimana bangunnya ketika di bulan Ramadhan hingga turun akhir dari surat Al Muzzamil, sedangkan rentang waktu turunnya awal surat Al Muzammil dengan akhir surat itu selama satu tahun.\""
            },
            {
                "number": 1096,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَعْقِدُ الشَّيْطَانُ عَلَى قَافِيَةِ رَأْسِ أَحَدِكُمْ إِذَا هُوَ نَامَ ثَلَاثَ عُقَدٍ يَضْرِبُ مَكَانَ كُلِّ عُقْدَةٍ عَلَيْكَ لَيْلٌ طَوِيلٌ فَارْقُدْ فَإِنْ اسْتَيْقَظَ فَذَكَرَ اللَّهَ انْحَلَّتْ عُقْدَةٌ فَإِنْ تَوَضَّأَ انْحَلَّتْ عُقْدَةٌ فَإِنْ صَلَّى انْحَلَّتْ عُقْدَةٌ فَأَصْبَحَ نَشِيطًا طَيِّبَ النَّفْسِ وَإِلَّا أَصْبَحَ خَبِيثَ النَّفْسِ كَسْلَانَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Syetan mengikat tiga ikatan di tengkuk salah seorang dari kalian ketika dia tidur, dia membuat setiap satu ikatan akan berkata; \"Malam masih panjang\", apabila seseorang bangun kemudian berdzikir kepada Allah, maka akan lepas satu ikatan, jika seseorang berwudlu', maka akan terlepas satu ikatan lagi, jika seseorang sholat, maka akan terlepas satu ikatan lagi, maka di pagi harinya ia menjadi bersemangat dan berhati bersih, apabila tidak, maka di pagi harinya jiwanya menjadi kotor dan akan sangat malas.\""
            },
            {
                "number": 1097,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ قَالَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ بْنِ خُمَيْرٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي قَيْسٍ يَقُولُ قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَالَا تَدَعْ قِيَامَ اللَّيْلِ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَدَعُهُ وَكَانَ إِذَا مَرِضَ أَوْ كَسِلَ صَلَّى قَاعِدًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] dia berkata; telah menceritakan kepada kami [Abu Daud] dia berkata; telah menceritakan kepada kami [Syu'bah] dari [Yazid bin Khumair] dia berkata; saya mendengar [Abdullah bin Abu Qais] berkata; [Aisyah radliallahu 'anha] berkata; \"Janganlah kamu meninggalkan sholat malam (qiyamul lail), karena Rasulullah shallallahu 'alaihi wasallam tidak pernah meninggalkannya, bahkan apabila beliau sedang sakit atau kepayahan, beliau sholat dengan duduk.\""
            },
            {
                "number": 1098,
                "arab": "حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى حَدَّثَنَا ابْنُ عَجْلَانَ عَنْ الْقَعْقَاعِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَحِمَ اللَّهُ رَجُلًا قَامَ مِنْ اللَّيْلِ فَصَلَّى وَأَيْقَظَ امْرَأَتَهُ فَإِنْ أَبَتْ نَضَحَ فِي وَجْهِهَا الْمَاءَ رَحِمَ اللَّهُ امْرَأَةً قَامَتْ مِنْ اللَّيْلِ فَصَلَّتْ وَأَيْقَظَتْ زَوْجَهَا فَإِنْ أَبَى نَضَحَتْ فِي وَجْهِهِ الْمَاءَ",
                "id": "Telah menceritakan kepada kami [Ibnu Basyar] telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Ibnu 'Ajlan] dari [Al Qa'qa'] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah akan merahmati seseorang yang bangun malam kemudian sholat lalu membangunkan isterinya, apabila isterinya menolak, dia akan memercikkan air ke mukanya, dan Allah akan merahmati seorang isteri yang bangun malam lalu sholat, kemudian dia membangunkan suaminya, apabila suaminya enggan, maka isterinya akan memercikkan air ke muka suaminya.\""
            },
            {
                "number": 1099,
                "arab": "حَدَّثَنَا ابْنُ كَثِيرٍ حَدَّثَنَا سُفْيَانُ عَنْ مِسْعَرٍ عَنْ عَلِيِّ بْنِ الْأَقْمَرِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ بَزِيعٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ شَيْبَانَ عَنْ الْأَعْمَشِ عَنْ عَلِيِّ بْنِ الْأَقْمَرِ الْمَعْنَى عَنْ الْأَغَرِّ عَنْ أَبِي سَعِيدٍ وَأَبِي هُرَيْرَةَ قَالَاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَيْقَظَ الرَّجُلُ أَهْلَهُ مِنْ اللَّيْلِ فَصَلَّيَا أَوْ صَلَّى رَكْعَتَيْنِ جَمِيعًا كُتِبَا فِي الذَّاكِرِينَ وَالذَّاكِرَاتِوَلَمْ يَرْفَعْهُ ابْنُ كَثِيرٍ وَلَا ذَكَرَ أَبَا هُرَيْرَةَ جَعَلَهُ كَلَامَ أَبِي سَعِيدٍ قَالَ أَبُو دَاوُد رَوَاهُ ابْنُ مَهْدِيٍّ عَنْ سُفْيَانَ قَالَ وَأُرَاهُ ذَكَرَ أَبَا هُرَيْرَةَ قَالَ أَبُو دَاوُد وَحَدِيثُ سُفْيَانَ مَوْقُوفٌ",
                "id": "Telah menceritakan kepada kami [Ibnu Katsir] telah menceritakan kepada kami [Sufyan] dari [Mis'ar] dari [Ali bin Al Aqmar]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Hatim bin Bazi'] telah menceritakan kepada kami ['ubaidhullah bin Musa] dari [Syaiban] dari [Al A'masy] dari [Ali bin Al Aqmar], sedangkan maknanya dari [Al Aghar] dari [Abu Sa'id] dan [Abu Hurairah] keduanya berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila seseorang membangunkan isterinya di malam hari, kemudian keduanya mengerjakan sholat, atau keduanya sholat dua raka'at, maka keduanya akan di catat sebagai orang-orang yang selalu berdzikir.\" Namun Ibnu katsir tidak merafa'kan hadits ini, dan Abu Hurairah juga tidak menjadikan hadits tersebut dari perkataan Abu Sa'id. Abu Daud berkata; \"dan di riwayatkan pula oleh [Ibnu Mahdi] dari [Sufyan] dia berkata; -aku berpendapat bahwa dia menyebutkan \" [Abu Hurairah].\" Abu Daud berkata; \"Sedangkan hadits Sufyan mauquf.\""
            },
            {
                "number": 1100,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا نَعَسَ أَحَدُكُمْ فِي الصَّلَاةِ فَلْيَرْقُدْ حَتَّى يَذْهَبَ عَنْهُ النَّوْمُ فَإِنَّ أَحَدَكُمْ إِذَا صَلَّى وَهُوَ نَاعِسٌ لَعَلَّهُ يَذْهَبُ يَسْتَغْفِرُ فَيَسُبَّ نَفْسَهُ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Aisyah isteri Nabi] shallallahu 'alaihi wasallam bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian mengantuk dalam sholat, hendaknya ia tidur terlebih dahulu hingga rasa kantuknya hilang, karena apabila salah seorang dari kalian mengerjakan sholat dalam kondisi mengantuk, di khawatirkan ketika dia hendak meminta ampun, tapi sebaliknya dia malah mencela dirinya sendiri.\""
            },
            {
                "number": 1101,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ أَحَدُكُمْ مِنْ اللَّيْلِ فَاسْتَعْجَمَ الْقُرْآنُ عَلَى لِسَانِهِ فَلَمْ يَدْرِ مَا يَقُولُ فَلْيَضْطَجِعْ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Abdurrazaq] telah menceritakan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian bangun malam, kemudian terasa berat baginya untuk membaca al-qur'an (karena mengantuk), hingga ia tidak sadar apa yang di baca, sebaiknya ia tidur terlebih dahulu.\""
            },
            {
                "number": 1102,
                "arab": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ وَهَارُونُ بْنُ عَبَّادٍ الْأَزْدِيُّ أَنَّ إِسْمَعِيلَ بْنَ إِبْرَاهِيمَ حَدَّثَهُمْ حَدَّثَنَا عَبْدُ الْعَزِيزِ عَنْ أَنَسٍ قَالَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَسْجِدَ وَحَبْلٌ مَمْدُودٌ بَيْنَ سَارِيَتَيْنِ فَقَالَ مَا هَذَا الْحَبْلُ فَقِيلَ يَا رَسُولَ اللَّهِ هَذِهِ حَمْنَةُ بِنْتُ جَحْشٍ تُصَلِّي فَإِذَا أَعْيَتْ تَعَلَّقَتْ بِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِتُصَلِّ مَا أَطَاقَتْ فَإِذَا أَعْيَتْ فَلْتَجْلِسْ قَالَ زِيَادٌ فَقَالَ مَا هَذَا فَقَالُوا لِزَيْنَبَ تُصَلِّي فَإِذَا كَسِلَتْ أَوْ فَتَرَتْ أَمْسَكَتْ بِهِ فَقَالَ حُلُّوهُ فَقَالَ لِيُصَلِّ أَحَدُكُمْ نَشَاطَهُ فَإِذَا كَسِلَ أَوْ فَتَرَ فَلْيَقْعُدْ",
                "id": "Telah menceritakan kepada kami [Ziyad bin Ayyub] dan [Harun 'Abbad Al Azdi] bahwa [Isma'il bin Ibrahim] telah menceritakan kepada mereka, telah menceritakan kepada kami [Abdul Aziz] dari [Anas] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah masuk ke dalam masjid, lalu beliau mendapati tali yang membentang antara dua tiang, lantas beliau bertanya; \"Tali apakah ini?\" maka di beritahukan; \"Wahai Rasulullah shallallahu 'alaihi wasallam, ini adalah Hamnah binti Jahsyi, dia sedang mengerjakan sholat, apabila dia merasa kepayahan, maka dia akan bergantung dengan tali tersebut.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaknya ia sholat menurut kemampuannya, apabila telah terasa payah, hendaknya ia duduk.\" Kata Ziyad; beliau bertanya; \"Apakah ini?\" mereka menjawab; \"Ini adalah (tali) milik Zainab, dia sedang mengerjakan sholat, apabila dia terasa capek atau terasa lelah, maka dia akan berpegangan dengannya.\" Maka beliau bersabda: \"Lepaslah tali itu.\" sabdanya lagi; \"Hendaknya salah seorang dari kalian mengerjakan sholat selagi masih segar(semangat), apabila telah lelah atau capek, sebaiknya ia duduk (tidur).\""
            },
            {
                "number": 1103,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو صَفْوَانَ عَبْدُ اللَّهِ بْنُ سَعِيدِ بْنِ عَبْدِ الْمَلِكِ بْنِ مَرْوَانَ ح و حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ وَمُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ الْمَعْنَى عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ أَنَّ السَّائِبَ بْنَ يَزِيدَ وَعُبَيْدَ اللَّهِ أَخْبَرَاهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَبْدٍ قَالَ عَنْ ابْنِ وَهْبِ بْنِ عَبْدِ الْقَارِيِّ قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَامَ عَنْ حِزْبِهِ أَوْ عَنْ شَيْءٍ مِنْهُ فَقَرَأَهُ مَا بَيْنَ صَلَاةِ الْفَجْرِ وَصَلَاةِ الظُّهْرِ كُتِبَ لَهُ كَأَنَّمَا قَرَأَهُ مِنْ اللَّيْلِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abu Shafwan Abdullah bin Sa'id bin Abdul Malik bin Marwan]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Sulaiman bin Daud] dan [Muhammad bin Salamah Al Muradi] keduanya berkata; telah menceritakan kepada kami [Ibnu Wahb] sedangkan maknanya dari [Yunus] dari [Ibnu Syihab] bahwa [As Sa`ib bin Yazid] dan ['ubaidhullah] telah mengabarkan keduanya, bahwa [Abdurrahman bin 'Abd] dia berkata; dari [Ibnu Wahb bin Abdul Qari] dia berkata; saya mendengar [Umar bin Khattab] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa tertidur dari bacaan wiridnya atau sesuatu yang di biasakannya di waktu malam, kemudian dia membaca antara sholat fajar (subuh) dan sholat Dluhur, maka akan di catat (pahala) baginya seakan-akan dia membaca di malam hari.\""
            },
            {
                "number": 1104,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ رَجُلٍ عِنْدَهُ رَضِيٍّ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ امْرِئٍ تَكُونُ لَهُ صَلَاةٌ بِلَيْلٍ يَغْلِبُهُ عَلَيْهَا نَوْمٌ إِلَّا كُتِبَ لَهُ أَجْرُ صَلَاتِهِ وَكَانَ نَوْمُهُ عَلَيْهِ صَدَقَةً",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Muhammad bin Al Munkadir] dari [Sa'id bin Jubair] dari [seseorang] yang ia ridlai, bahwa [Aisyah] isteri Nabi shallallahu 'alaihi wasallam telah mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang yang terbiasa mengerjakan sholat malam, kemudian dia tertidur (tidak mengerjakannya) melainkan akan di catat baginya pahala sholat malam, dan tidurnya di anggap sedekah baginya.\""
            },
            {
                "number": 1105,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ وَعَنْ أَبِي عَبْدِ اللَّهِ الْأَغَرِّ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَنْزِلُ رَبُّنَا تَبَارَكَ وَتَعَالَى كُلَّ لَيْلَةٍ إِلَى سَمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الْآخِرُ فَيَقُولُ مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ مَنْ يَسْأَلُنِي فَأُعْطِيَهُ مَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman] dan dari [Abdullah Al Agharru] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Rabb kita Tabaraka wa Ta'ala turun di setiap malamnya ke langit dunia pada sepertiga malam terakhir, lalu Dia berfirman: \"barangsiapa berdo'a kepada-Ku, niscaya Aku kabulkan, barangsiapa memohon kepada-Ku, niscaya Aku akan memberinya, barangsiapa memohon ampunan kepada-Ku, niscaya Aku akan mengampuninya.\""
            },
            {
                "number": 1106,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ يَزِيدَ الْكُوفِيُّ حَدَّثَنَا حَفْصٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْإِنْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيُوقِظُهُ اللَّهُ عَزَّ وَجَلَّ بِاللَّيْلِ فَمَا يَجِيءُ السَّحَرُ حَتَّى يَفْرُغَ مِنْ حِزْبِهِ",
                "id": "Telah menceritakan kepada kami [Husain bin Yazid Al Kufi] telah menceritakan kepada kami [Hafsh] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa di bangunkan oleh Allah Azza wa Jalla di setiap malam, dan tidaklah datang waktu sahur melainkan beliau telah menyelesaikan (bacaan) wiridnya.\""
            },
            {
                "number": 1107,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى حَدَّثَنَا أَبُو الْأَحْوَصِ ح و حَدَّثَنَا هَنَّادٌ عَنْ أَبِي الْأَحْوَصِ وَهَذَا حَدِيثُ إِبْرَاهِيمَ عَنْ أَشْعَثَ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ قَالَسَأَلْتُ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ لَهَا أَيَّ حِينٍ كَانَ يُصَلِّي قَالَتْ كَانَ إِذَا سَمِعَ الصُّرَاخَ قَامَ فَصَلَّى",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa] telah menceritakan kepada kami [Abu Al Ahwash]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Hannad] dari [Abu Al Ahwash], dan ini adalah hadits Ibrahim dari [Asy'ats] dari [ayahnya] dari [Masruq] dia berkata; saya bertanya kepada [Aisyah] radliallahu 'anha tentang sholatnya Rasulullah shallallahu 'alaihi wasallam, kataku kepadanya; \"Waktu kapankah beliau biasa mengerjakan sholat (malam)?\" jawabnya; \"Apabila beliau mendengar suara kokok ayam, beliau bangun lalu sholat.\""
            },
            {
                "number": 1108,
                "arab": "حَدَّثَنَا أَبُو تَوْبَةَ عَنْ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنْ أَبِيهِ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ قَالَتْمَا أَلْفَاهُ السَّحَرُ عِنْدِي إِلَّا نَائِمًا تَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abu Taubah] dari [Ibrahim bin Sa'd] dari [ayahnya] dari [Abu Salamah] dari [Aisyah] dia berkata; \"Tidaklah datang waktu sahur, melainkan beliau tidur berada di dekatku.\" Maksudnya Nabi shallallahu 'alaihi wasallam. "
            },
            {
                "number": 1109,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ الدُّؤَلِيِّ عَنْ عَبْدِ الْعَزِيزِ ابْنِ أَخِي حُذَيْفَةَ عَنْ حُذَيْفَةَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَزَبَهُ أَمْرٌ صَلَّى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Yahya bin Zakariya] dari [Ikrimah bin 'Ammar] dari [Muhammad bin Abdullah Ad Du`ali] dari [Abdul Aziz keponakan Hudzaifah] dari [Hudzaifah] dia berkata; \"Apabila Nabi shallallahu 'alaihi wasallam tertekan oleh suatu urusan, beliau mengerjakan sholat.\""
            },
            {
                "number": 1110,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا الْهِقْلُ بْنُ زِيَادٍ السَّكْسَكِيُّ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ قَالَ سَمِعْتُ رَبِيعَةَ بْنَ كَعْبٍ الْأَسْلَمِيَّ يَقُولُكُنْتُ أَبِيتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آتِيهِ بِوَضُوئِهِ وَبِحَاجَتِهِ فَقَالَ سَلْنِي فَقُلْتُ مُرَافَقَتَكَ فِي الْجَنَّةِ قَالَ أَوَ غَيْرَ ذَلِكَ قُلْتُ هُوَ ذَاكَ قَالَ فَأَعِنِّي عَلَى نَفْسِكَ بِكَثْرَةِ السُّجُودِ",
                "id": "Telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Al Hiql bin Ziyad As Saksaki] telah menceritakan kepada kami [Al Auza'i] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dia berkata; saya mendengar [Rabi'ah bin Ka'b Al Aslami] berkata; \"Aku bermalam bersama Rasulullah shallallahu 'alaihi wasallam, aku juga pernah mengambilkan air wudlu' dan air untuk buang hajat untuk beliau. Lalu beliau bersabda: \"Mohonlah kepadaku.\" Kataku; 'Aku memohon dapat bersama anda di surga'. Beliau menegaskan, 'Adakah yang lain? 'Aku menjawab, 'Itu saja'. Beliau bersabda: 'Bantu aku untuk dirimu sendiri dengan memperbanyak sujud'.\""
            },
            {
                "number": 1111,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍفِي هَذِهِ الْآيَةِ{ تَتَجَافَى جُنُوبُهُمْ عَنْ الْمَضَاجِعِ يَدْعُونَ رَبَّهُمْ خَوْفًا وَطَمَعًا وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ }قَالَ كَانُوا يَتَيَقَّظُونَ مَا بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ يُصَلُّونَوَكَانَ الْحَسَنُ يَقُولُ قِيَامُ اللَّيْلِ",
                "id": "Telah menceritakan kepada kami [Abu Kamil] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas bin Malik] mengenai ayat ini; \"Lambung mereka jauh dari tempat tidurnya, sedang mereka berdo'a kepada Rabbnya dengan rasa takut dan penuh harap, dan mereka menafkahkan sebagian dari rizki yang Kami berikan kepada mereka.\" (QS As Sajadah; 16), kata Anas; \"Mereka biasa bangun antara waktu Maghrib hingga Isya' kemudian mereka mengerjakan sholat.\" Sedangkan Al Hasan mengatakan; \"Maksudnya adalah Qiyamul lail.\""
            },
            {
                "number": 1112,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَابْنُ أَبِي عَدِيٍّ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَنَسٍفِي قَوْلِهِ عَزَّ وَجَلَّ{ كَانُوا قَلِيلًا مِنْ اللَّيْلِ مَا يَهْجَعُونَ }قَالَ كَانُوا يُصَلُّونَ فِيمَا بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ زَادَ فِي حَدِيثِ يَحْيَى وَكَذَلِكَ تَتَجَافَى جُنُوبُهُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Yahya bin Sa'id] dan [Ibnu Abu 'Adi] dari [Sa'id] dari [Qatadah] dari [Anas] mengenai firman Allah Azza wa Jalla; \"Mereka sedikit sekali tidur di waktu malam\" (QS Adz Dzariyat; 17), kata Anas; \"Mereka biasa mengerjakan sholat antara waktu Maghrib dan Isya'.\" Dalam haditsnya Yahya di tambahkan; \"Dan demikian pula lambung mereka (dari tempat tidurnya).\""
            },
            {
                "number": 1113,
                "arab": "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَيَّانَ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ أَحَدُكُمْ مِنْ اللَّيْلِ فَلْيُصَلِّ رَكْعَتَيْنِ خَفِيفَتَيْنِحَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا إِبْرَاهِيمُ يَعْنِي ابْنَ خَالِدٍ عَنْ رَبَاحِ بْنِ زَيْدٍ عَنْ مَعْمَرٍ عَنْ أَيُّوبَ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَ إِذَا بِمَعْنَاهُ زَادَ ثُمَّ لِيُطَوِّلْ بَعْدُ مَا شَاءَ قَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ حَمَّادُ بْنُ سَلَمَةَ وَزُهَيْرُ بْنُ مُعَاوِيَةَ وَجَمَاعَة عَنْ هِشَامٍ عَنْ مُحَمَّدٍ أَوْقَفُوهُ عَلَى أَبِي هُرَيْرَةَ وَكَذَلِكَ رَوَاهُ أَيُّوبُ وَابْنُ عَوْنٍ أَوْقَفُوهُ عَلَى أَبِي هُرَيْرَةَ وَرَوَاهُ ابْنُ عَوْنٍ عَنْ مُحَمَّدٍ قَالَ فِيهِمَا تَجَوُّزٌ",
                "id": "Telah menceritakan kepada kami [Ar Rabi' bin Nafi' Abu Taubah] telah menceritakan kepada kami [Sulaiman bin Hayyan] dari [Hisyam bin Hasan] dari [Ibnu Sirin] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian bangun malam, hendaknya ia mengerjakan sholat dua raka'at yang ringan.\" Telah menceritakan kepada kami [Makhlad bin Khalid] telah menceritakan kepada kami [Ibrahim yaitu Ibnu Khalid] dari [Rabah bin Zaid] dari [Ma'mar] dari [Ayyub] dari [Ibnu Sirin] dari [Abu Hurairah] perawi berkata; makna haditsnya sama namun ada tambahan \"kemudian memanjangkan sesuai dengan yang dia kehendaki\". Abu Daud berkata; telah meriwayatkan hadits ini [Hammad bin Salamah] dan [Zuhair bin Mu'awiyyah] dan jama'ah dari [Hisyam] dari [Muhammad] yang di mauqufkan kepada [Abu Hurairah], demikian juga yang di riwayatkan oleh [Ayyub] dan [Ibnu 'Aun] yang di mauqufkan kepada [Abu Hurairah]. Dan di riwayatkan oleh [Ibnu Aun] dari [Muhammad] katanya; \"Dalam dua raka'at tersebut di persingkat.\""
            },
            {
                "number": 1114,
                "arab": "حَدَّثَنَا ابْنُ حَنْبَلٍ يَعْنِي أَحْمَدَ حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عُثْمَانُ بْنُ أَبِي سُلَيْمَانَ عَنْ عَلِيٍّ الْأَزْدِيِّ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ حُبْشِيٍّ الْخَثْعَمِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ أَيُّ الْأَعْمَالِ أَفْضَلُ قَالَ طُولُ الْقِيَامِ",
                "id": "Telah menceritakan kepada kami [Ibnu Hanbal yaitu Ahmad] telah menceritakan kepada kami [Hajjaj] dia berkata; [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Utsman bin Abu Sulaiman] dari [Ali Al Azdi] dari ['Ubaid bin 'Umair] dari [Abdullah bin Habsyi Al Khasy'ami] bahwa Rasulullah shallallahu 'alaihi wasallam pernah di tanya; \"Amalan apakah yang paling utama?\" beliau menjawab; \"Lama berdiri (dalam sholat).\""
            },
            {
                "number": 1115,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ وَعَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَلَاةِ اللَّيْلِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا خَشِيَ أَحَدُكُمْ الصُّبْحَ صَلَّى رَكْعَةً وَاحِدَةً تُوتِرُ لَهُ مَا قَدْ صَلَّى",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Nafi'] dan [Abdullah bin Dinar] dari [Abdullah bin Umar] bahwa seorang laki-laki bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai sholat malam, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"sholat malam dua raka'at-dua raka'at, apabila salah seorang dari kalian khawatir datangnya waktu subuh, hendaknya ia sholat satu raka'at sebagai witir atas sholat yang telah di kerjakan.\""
            },
            {
                "number": 1116,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ الْوَرَكَانِيُّ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو مَوْلَى الْمُطَّلِبِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَتْ قِرَاءَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى قَدْرِ مَا يَسْمَعُهُ مَنْ فِي الْحُجْرَةِ وَهُوَ فِي الْبَيْتِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far Al Warakani] telah menceritakan kepada kami [Ibnu Abu Az Zinad] dari ['Amru bin Abu 'Amru] bekas budak Al Mutthalib, dari ['Ikrimah] dari [Ibnu Abbas] dia berkata; \"Bacaan Nabi shallallahu 'alaihi wasallam sekedar dapat di dengar oleh orang yang berada di kamar, sementara beliau berada di rumah.\""
            },
            {
                "number": 1117,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارِ بْنِ الرَّيَّانِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ عِمْرَانَ بْنِ زَائِدَةَ عَنْ أَبِيهِ عَنْ أَبِي خَالِدٍ الْوَالِبِيِّ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَكَانَتْ قِرَاءَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ يَرْفَعُ طَوْرًا وَيَخْفِضُ طَوْرًاقَالَ أَبُو دَاوُد أَبُو خَالِدٍ الْوَالِبِيُّ اسْمُهُ هُرْمُزُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Bakar bin Ar Rayyan] telah menceritakan kepada kami [Abdullah bin Al Mubarrak] dari [Imran bin Za`idah] dari [ayahnya] dari [Abu Khalid Al Wali] dari [Abu Hurairah] bahwa dia berkata; \"Bacaan Nabi shallallahu 'alaihi wasallam dalam sholat malam, terkadang beliau mengeraskan suara dan terkadang melirihkannya.\" Abu Daud berkata; \"Abu Khalid Al Wali namanya adalah Hurmuz.\""
            },
            {
                "number": 1118,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ حَدَّثَنَا يَحْيَى بْنُ إِسْحَقَ أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ عَنْ أَبِي قَتَادَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ لَيْلَةً فَإِذَا هُوَ بِأَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ يُصَلِّي يَخْفِضُ مِنْ صَوْتِهِ قَالَ وَمَرَّ بِعُمَرَ بْنِ الْخَطَّابِ وَهُوَ يُصَلِّي رَافِعًا صَوْتَهُ قَالَ فَلَمَّا اجْتَمَعَا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَا أَبَا بَكْرٍ مَرَرْتُ بِكَ وَأَنْتَ تُصَلِّي تَخْفِضُ صَوْتَكَ قَالَ قَدْ أَسْمَعْتُ مَنْ نَاجَيْتُ يَا رَسُولَ اللَّهِ قَالَ وَقَالَ لِعُمَرَ مَرَرْتُ بِكَ وَأَنْتَ تُصَلِّي رَافِعًا صَوْتَكَ قَالَ فَقَالَ يَا رَسُولَ اللَّهِ أُوقِظُ الْوَسْنَانَ وَأَطْرُدُ الشَّيْطَانَ زَادَ الْحَسَنُ فِي حَدِيثِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَبَا بَكْرٍ ارْفَعْ مِنْ صَوْتِكَ شَيْئًا وَقَالَ لِعُمَرَ اخْفِضْ مِنْ صَوْتِكَ شَيْئًاحَدَّثَنَا أَبُو حُصَيْنِ بْنُ يَحْيَى الرَّازِيُّ حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذِهِ الْقِصَّةِ لَمْ يَذْكُرْ فَقَالَ لِأَبِي بَكْرٍ ارْفَعْ مِنْ صَوْتِكَ شَيْئًا وَلِعُمَرَ اخْفِضْ شَيْئًا زَادَ وَقَدْ سَمِعْتُكَ يَا بِلَالُ وَأَنْتَ تَقْرَأُ مِنْ هَذِهِ السُّورَةِ وَمِنْ هَذِهِ السُّورَةِ قَالَ كَلَامٌ طَيِّبٌ يَجْمَعُ اللَّهُ تَعَالَى بَعْضَهُ إِلَى بَعْضٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّكُمْ قَدْ أَصَابَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Tsabit Al Bunani] dari Nabi shallallahu 'alaihi wasallam. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Al Hasan bin As Shabah] telah menceritakan kepada kami [Yahya bin Ishaq] telah mengabarkan kepada kami [Hammad bin Salamah] dari [Tsabit Al Bunani] dari [Abdullah bin Rabah] dari [Abu Qatadah] bahwa pada suatu malam Nabi shallallahu 'alaihi wasallam keluar, lalu beliau mendapati Abu Bakar radliallahu 'anhu yang tengah sholat dengan memelankan suaranya.\" Abu Qatadah berkata; \"Dan beliau juga bertemu dengan Umar bin Khattab yang tengah sholat dengan mengangkat suaranya.\" Abu Qatadah melanjutkan; \"Ketika keduanya berkumpul di hadapan Nabi shallallahu 'alaihi wasallam, beliau bersabda kepada Abu Bakar: \"Aku melawatimu ketika kamu sedang sholat dengan memelankan suara.\" Abu Bakar menjawab; \"Suaraku hanya cukup di dengar (Allah) tempatku bermunajat wahai Rasulullah.\" Abu Qatadah berkata; \"Lalu beliau bersabda kepada Umar: \"Sedangkan kamu mengangkat suaramu.\" Abu Qatadah berkata; \"Wahai Rasulullah, supaya saya dapat membangunkan orang tidur dan mengusir syetan.\" Hasan menambahkan dalam haditsnya; \"Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai Abu Bakar, angkatlah suaramu sedikit.\" Dan beliau bersabda kepada Umar: \"Rendahkanlah suaramu sedikit!.\" Telah menceritakan kepada kami [Abu Hushain bin Yahya Ar Razi] telah menceritakan kepada kami [Asbath bin Muhammad] dari [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam dengan kisah seperti ini, namun dia tidak menyebutkan; \"Maka beliau bersabda kepada Abu Bakar: \"Angkatlah suaramu sedikit\" dan bersabda kepada Umar: \"Rendahkanlah suaramu sedikit.\" Dia menambahkan; \"Aku benar-benar telah mendengarmu wahai Bilal, kamu sedang membaca surat ini dan surat ini.\" Bilal menjawab; \"(al-qur'an) itu adalah kalam (perkataan) yang semuanya baik, di susun oleh Allah Ta'ala dari satu bagian ke bagian yang lainnya.\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Kalian semua benar.\""
            },
            {
                "number": 1119,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَجُلًا قَامَ مِنْ اللَّيْلِ فَقَرَأَ فَرَفَعَ صَوْتَهُ بِالْقُرْآنِ فَلَمَّا أَصْبَحَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْحَمُ اللَّهُ فُلَانًا كَأَيٍّ مِنْ آيَةٍ أَذْكَرَنِيهَا اللَّيْلَةَ كُنْتُ قَدْ أَسْقَطْتُهَاقَالَ أَبُو دَاوُد رَوَاهُ هَارُونُ النَّحْوِيُّ عَنْ حَمَّادِ بْنِ سَلَمَةَ فِي سُورَةِ آلِ عِمْرَانَ فِي الْحُرُوفِ{ وَكَأَيٍّ مِنْ نَبِيٍّ }",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Hisyam bin 'Urwah] dari [Urwah] dari [Aisyah] radliallahu 'anha, bahwa seorang laki-laki sedang mengerjakan sholat malam, lalu membaca al-qur'an dengan mengangkat suaranya, keesokan harinya, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Semoga Allah merahmati fulan, dia telah mengingatkanku terhadap ayat al-qur'an yang aku lupa ayat tersebut.\" Abu Daud berkata; \"di riwayatkan pula oleh Harun An Nahwi dari Hammad bin Salamah mengenai surat Ali Imran pada ayat; \"Dan berapa banyak dari para Nabi…\""
            },
            {
                "number": 1120,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ إِسْمَعِيلَ بْنِ أُمَيَّةَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سَعِيدٍ قَالَاعْتَكَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ فَسَمِعَهُمْ يَجْهَرُونَ بِالْقِرَاءَةِ فَكَشَفَ السِّتْرَ وَقَالَ أَلَا إِنَّ كُلَّكُمْ مُنَاجٍ رَبَّهُ فَلَا يُؤْذِيَنَّ بَعْضُكُمْ بَعْضًا وَلَا يَرْفَعْ بَعْضُكُمْ عَلَى بَعْضٍ فِي الْقِرَاءَةِ أَوْ قَالَ فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Isma'il bin Umayyah] dari [Abu Salamah] dari [Abu Sa'id] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam beri'tikaf di Masjid, lalu beliau menedengar mereka (para sahabat) mengeraskan bacaan (al-qur'an) mereka. kemudian beliau membuka tirai sambil bersabda: \"Ketahuilah, sesungguhnya kalian tengah berdialog dengan Rabb, oleh karena itu janganlah sebagian yang satu mengganggu sebagian yang lain dan jangan pula sebagian yang satu mengeraskan terhadap sebagian yang lain di dalam membaca (al-qur'an) atau dalam sholatnya.\""
            },
            {
                "number": 1121,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ بَحِيرِ بْنِ سَعْدٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ كَثِيرِ بْنِ مُرَّةَ الْحَضْرَمِيِّ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَاهِرُ بِالْقُرْآنِ كَالْجَاهِرِ بِالصَّدَقَةِ وَالْمُسِرُّ بِالْقُرْآنِ كَالْمُسِرِّ بِالصَّدَقَةِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Isma'il bin Ayasy] dari [Bahir bin Sa'd] daru [Khalid bin Ma'dan] dari [Katsir bin Murah Al Hadlrami] dari ['Uqbah bin 'Amir Al Juhani] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang mengeraskan bacaan al-qur'an bagaikan orang yang menampakkan sedekah, dan orang yang memelankan bacaan al-qur'an ibarat orang yang bersekah dengan sembunyi-sembunyi.\""
            },
            {
                "number": 1122,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي مِنْ اللَّيْلِ إِحْدَى عَشْرَةَ رَكْعَةً يُوتِرُ مِنْهَا بِوَاحِدَةٍ فَإِذَا فَرَغَ مِنْهَا اضْطَجَعَ عَلَى شِقِّهِ الْأَيْمَنِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dair ['Urwah bin Az Zubair] dari [Aisyah isteri Nabi shallallahu 'alaihi wasallam] bahwa Rasulullah shallallahu 'alaihi wasallam biasa mengerjakan sholat malam sebelas raka'at termasuk witir satu raka'at, apabila beliau selesai dari sholat malam, beliau berbaring di atas rusuk kanannya.\""
            },
            {
                "number": 1123,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ وَنَصْرُ بْنُ عَاصِمٍ وَهَذَا لَفْظُهُ قَالَا حَدَّثَنَا الْوَلِيدُ حَدَّثَنَا الْأَوْزَاعِيُّ وَقَالَ نَصْرٌ عَنْ ابْنِ أَبِي ذِئْبٍ وَالْأَوْزَاعِيُّ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِيمَا بَيْنَ أَنْ يَفْرُغَ مِنْ صَلَاةِ الْعِشَاءِ إِلَى أَنْ يَنْصَدِعَ الْفَجْرُ إِحْدَى عَشْرَةَ رَكْعَةً يُسَلِّمُ مِنْ كُلِّ ثِنْتَيْنِ وَيُوتِرُ بِوَاحِدَةٍ وَيَمْكُثُ فِي سُجُودِهِ قَدْرَ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً قَبْلَ أَنْ يَرْفَعَ رَأْسَهُ فَإِذَا سَكَتَ الْمُؤَذِّنُ بِالْأُولَى مِنْ صَلَاةِ الْفَجْرِ قَامَ فَرَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ اضْطَجَعَ عَلَى شِقِّهِ الْأَيْمَنِ حَتَّى يَأْتِيَهُ الْمُؤَذِّنُحَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي ابْنُ أَبِي ذِئْبٍ وَعَمْرُو بْنُ الْحَارِثِ وَيُونُسُ بْنُ يَزِيدَ أَنَّ ابْنَ شِهَابٍ أَخْبَرَهُمْ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ وَيُوتِرُ بِوَاحِدَةٍ وَيَسْجُدُ سَجْدَةً قَدْرَ مَا يَقْرَأُ أَحَدُكُمْ خَمْسِينَ آيَةً قَبْلَ أَنْ يَرْفَعَ رَأْسَهُ فَإِذَا سَكَتَ الْمُؤَذِّنُ مِنْ صَلَاةِ الْفَجْرِ وَتَبَيَّنَ لَهُ الْفَجْرُ وَسَاقَ مَعْنَاهُ قَالَ وَبَعْضُهُمْ يَزِيدُ عَلَى بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Ibrahim] dan [Nashr bin 'Ashim] dan ini lafadznya Nashr, keduanya berkata; telah menceritakan kepada kami [Al Walid] telah menceritakan kepada kami [Al Auza'i]. Nashr mengatakan; dari [Ibnu Abu Dzi`b] dan [Auza'i] dari [Az Zuhri] dari ['Urwah] dari [Aisyah] radliallahu 'anha, dia berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa mengerjakan sholat malam di antara setelah sholat Isya' hingga terbit fajar. Beliau biasa mengerjakan sebelas raka'at, beliau salam setiap satu raka'at, dan witir satu raka'at. lama beliau diam dalam sujudnya sekitar salah seorang dari kalian membaca lima puluh ayat, yaitu sebelum beliau mengangkat kepala. Apabila Mu'adzin selesai mengumandangkan adzan yang pertama untuk sholat subuh, beliau berdiri untuk mengerjakan sholat dua raka'at secara singkat, kemudian beliau berbaring di atas rusuk kanannya, sehingga Mu'adzin mengumandangkan adzan (kedua).\" Telah menceritakan kepada kami [Sulaiman bin Daud Al Mahri] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Ibnu Abu Dzi`b], ['Amru bin Al Harits] dan [Yunus bin Yazid], bahwa [Ibnu Syihab] telah mengabarkan kepada mereka, dengan sanad dan maksud yang sama, dia berkata; \"…Beliau witir satu raka'at, dan bersujud sekali (sujud terakhir) yang lamanya sekitar seseorang dari kalian membaca lima puluh ayat, yaitu sebelum beliau mengangkat kepalanya. Dan apabila seorang Mu'adzin selesai mengumandangkan adzan untuk sholat subuh, dan fajar telah nampak…\" kemudian dia melanjutkan maksud hadits tersebut.\" Perawi berkata; \"Dan sebagian dari mereka saling melengkapi atas sebagian yang lain.\""
            },
            {
                "number": 1124,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِاللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً ثُمَّ يُصَلِّي إِذَا سَمِعَ النِّدَاءَ بِالصُّبْحِ رَكْعَتَيْنِ خَفِيفَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam biasa mengerjakan sholat malam tiga belas raka'at, kemudian beliau mengerjakan dua raka'at (sunnah fajar) secara singkat setelah mendengar adzan sholat shubuh.\""
            },
            {
                "number": 1125,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَا حَدَّثَنَا أَبَانُ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي مِنْ اللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً كَانَ يُصَلِّي ثَمَانِيَ رَكَعَاتٍ وَيُوتِرُ بِرَكْعَةٍ ثُمَّ يُصَلِّي قَالَ مُسْلِمٌ بَعْدَ الْوِتْرِ ثُمَّ اتَّفَقَا رَكْعَتَيْنِ وَهُوَ قَاعِدٌ فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ فَرَكَعَ وَيُصَلِّي بَيْنَ أَذَانِ الْفَجْرِ وَالْإِقَامَةِ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] dan [Muslim bin Ibrahim] keduanya berkata; telah menceritakan kepada kami [Aban] dari [Yahya] dari [Abu Salamah] dari [Aisyah] bahwa Nabi Allah shallallahu 'alaihi wasallam terkadang mengerjakan sholat malam tiga belas raka'at, dan terkadang beliau mengerjakan delapan belas raka'at, lalu witir satu raka'at, setelah itu beliau mengerjakan sholat (sunnah fajar -pent) -Muslim berkata; \"Yaitu setelah witir\"- kemudian hadits Muslim dan Musa sepakat pada kalimat- dua raka'at, beliau mengerjakannya sambil duduk. Apabila hendak ruku', beliau berdiri lalu ruku'. Beliau juga mengerjakan sholat dua raka'at antara adzan dan iqamah.\""
            },
            {
                "number": 1126,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُ أَخْبَرَهُأَنَّهُ سَأَلَ عَائِشَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ كَانَتْ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَمَضَانَ فَقَالَتْ مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَزِيدُ فِي رَمَضَانَ وَلَا فِي غَيْرِهِ عَلَى إِحْدَى عَشْرَةَ رَكْعَةً يُصَلِّي أَرْبَعًا فَلَا تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ ثُمَّ يُصَلِّي أَرْبَعًا فَلَا تَسْأَلْ عَنْ حُسْنِهِنَّ وَطُولِهِنَّ ثُمَّ يُصَلِّي ثَلَاثًا قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا فَقُلْتُ يَا رَسُولَ اللَّهِ أَتَنَامُ قَبْلَ أَنْ تُوتِرَ قَالَ يَا عَائِشَةُ إِنَّ عَيْنَيَّ تَنَامَانِ وَلَا يَنَامُ قَلْبِي",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Sa'id bin Abu Sa'id Al Maqburi] dari [Abu Salamah bin Abdurrahman] bahwa dia mengabarkan kepadanya bahwa dirinya pernah bertanya kepada [Aisyah isteri Nabi] shallallahu 'alaihi wasallam; \"Bagaimanakah sholatnya Rasulullah shallallahu 'alaihi wasallam di bulan Ramadhan?\" Aisyah menjawab; \"sholat Rasulullah shallallahu 'alaihi wasallam tidak pernah lebih dari sebelas raka'at, baik pada bulan Ramadhan atau di selain bulan Ramadhan, yaitu beliau mengerjakan empat raka'at, jangan di tanya bagaimana bagus dan panjangnya, setelah itu beliau sholat empat raka'at, dan jangan di tanya bagaimana kwalitas bagus dan panjangnya, kemudian beliau sholat tiga raka'at.\" Aisyah radliallahu 'anha melanjutkan; aku bertanya; \"Wahai Rasulullah, apakah anda tidur sebelum berwitir?\" beliau menjawab: \"Wahai Aisyah, sesungguhnya kedua mataku tertidur, namun hatiku tetap terjaga.\""
            },
            {
                "number": 1127,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُسَيْنٍ الدِّرْهَمِيُّ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ بَهْزِ بْنِ حَكِيمٍ حَدَّثَنَا زُرَارَةُ بْنُ أَوْفَىأَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا سُئِلَتْ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَوْفِ اللَّيْلِ فَقَالَتْ كَانَ يُصَلِّي الْعِشَاءَ فِي جَمَاعَةٍ ثُمَّ يَرْجِعُ إِلَى أَهْلِهِ فَيَرْكَعُ أَرْبَعَ رَكَعَاتٍ ثُمَّ يَأْوِي إِلَى فِرَاشِهِ وَيَنَامُ وَطَهُورُهُ مُغَطًّى عِنْدَ رَأْسِهِ وَسِوَاكُهُ مَوْضُوعٌ حَتَّى يَبْعَثَهُ اللَّهُ سَاعَتَهُ الَّتِي يَبْعَثُهُ مِنْ اللَّيْلِ فَيَتَسَوَّكُ وَيُسْبِغُ الْوُضُوءَ ثُمَّ يَقُومُ إِلَى مُصَلَّاهُ فَيُصَلِّي ثَمَانِيَ رَكَعَاتٍ يَقْرَأُ فِيهِنَّ بِأُمِّ الْكِتَابِ وَسُورَةٍ مِنْ الْقُرْآنِ وَمَا شَاءَ اللَّهُ وَلَا يَقْعُدُ فِي شَيْءٍ مِنْهَا حَتَّى يَقْعُدَ فِي الثَّامِنَةِ وَلَا يُسَلِّمُ وَيَقْرَأُ فِي التَّاسِعَةِ ثُمَّ يَقْعُدُ فَيَدْعُو بِمَا شَاءَ اللَّهُ أَنْ يَدْعُوَهُ وَيَسْأَلَهُ وَيَرْغَبَ إِلَيْهِ وَيُسَلِّمُ تَسْلِيمَةً وَاحِدَةً شَدِيدَةً يَكَادُ يُوقِظُ أَهْلَ الْبَيْتِ مِنْ شِدَّةِ تَسْلِيمِهِ ثُمَّ يَقْرَأُ وَهُوَ قَاعِدٌ بِأُمِّ الْكِتَابِ وَيَرْكَعُ وَهُوَ قَاعِدٌ ثُمَّ يَقْرَأُ الثَّانِيَةَ فَيَرْكَعُ وَيَسْجُدُ وَهُوَ قَاعِدٌ ثُمَّ يَدْعُو مَا شَاءَ اللَّهُ أَنْ يَدْعُوَ ثُمَّ يُسَلِّمُ وَيَنْصَرِفُ فَلَمْ تَزَلْ تِلْكَ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى بَدَّنَ فَنَقَّصَ مِنْ التِّسْعِ ثِنْتَيْنِ فَجَعَلَهَا إِلَى السِّتِّ وَالسَّبْعِ وَرَكْعَتَيْهِ وَهُوَ قَاعِدٌ حَتَّى قُبِضَ عَلَى ذَلِكَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا بَهْزُ بْنُ حَكِيمٍ فَذَكَرَ هَذَا الْحَدِيثَ بِإِسْنَادِهِ قَالَ يُصَلِّي الْعِشَاءَ ثُمَّ يَأْوِي إِلَى فِرَاشِهِ لَمْ يَذْكُرْ الْأَرْبَعَ رَكَعَاتٍ وَسَاقَ الْحَدِيثَ وَقَالَ فِيهِ فَيُصَلِّي ثَمَانِيَ رَكَعَاتٍ يُسَوِّي بَيْنَهُنَّ فِي الْقِرَاءَةِ وَالرُّكُوعِ وَالسُّجُودِ وَلَا يَجْلِسُ فِي شَيْءٍ مِنْهُنَّ إِلَّا فِي الثَّامِنَةِ فَإِنَّهُ كَانَ يَجْلِسُ ثُمَّ يَقُومُ وَلَا يُسَلِّمُ فِيهِ فَيُصَلِّي رَكْعَةً يُوتِرُ بِهَا ثُمَّ يُسَلِّمُ تَسْلِيمَةً يَرْفَعُ بِهَا صَوْتَهُ حَتَّى يُوقِظَنَا ثُمَّ سَاقَ مَعْنَاهُ حَدَّثَنَا عُمَرُ بْنُ عُثْمَانَ حَدَّثَنَا مَرْوَانُ يَعْنِي ابْنَ مُعَاوِيَةَ عَنْ بَهْزٍ حَدَّثَنَا زُرَارَةُ بْنُ أَوْفَى عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ أَنَّهَا سُئِلَتْ عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ كَانَ يُصَلِّي بِالنَّاسِ الْعِشَاءَ ثُمَّ يَرْجِعُ إِلَى أَهْلِهِ فَيُصَلِّي أَرْبَعًا ثُمَّ يَأْوِي إِلَى فِرَاشِهِ ثُمَّ سَاقَ الْحَدِيثَ بِطُولِهِ وَلَمْ يَذْكُرْ يُسَوِّي بَيْنَهُنَّ فِي الْقِرَاءَةِ وَالرُّكُوعِ وَالسُّجُودِ وَلَمْ يَذْكُرْ فِي التَّسْلِيمِ حَتَّى يُوقِظَنَا حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا بِهَذَا الْحَدِيثِ وَلَيْسَ فِي تَمَامِ حَدِيثِهِمْ",
                "id": "Telah menceritakan kepada kami [Ali bin Husain Ad Dirhami] telah menceritakan kepada kami [Ibnu Abu Adi] dari [Bahz bin Hakim] telah menceritakan kepada kami [Zurarah bin Aufa] bahwa [Aisyah] radliallahu 'anha pernah di tanya mengenai sholatnya Rasulullah shallallahu 'alaihi wasallam di pertengahan malam, dia menjawab; \"Beliau biasa mengerjakan sholat Isya' dengan berjama'ah, kemudian kembali kepada keluarganya dan mengerjakan sholat (sunnah) empat raka'at, setelah itu beliau pergi ke tempat tidurnya, lalu beliau tidur. Sedangkan tempat air wudlunya tertutup berada di atas kepala beliau dan siwaknya juga di letakkan di situ, sehingga Allah membangunkan beliau pada saatnya yaitu pada malam hari, kemudian beliau bersiwak dan menyempurnakan wudlu'nya, setelah itu beliau berdiri di tempat sholatnya, lalu sholat delapan raka'at, dalam raka'at tersebut beliau membaca Al Fatihah dan surat al-qur'an serta apa saja yang Allah kehendaki, beliau tidak duduk dalam raka'at tersebut kecuali di raka'at ke delapan, dan beliau juga tidak salam. Beliau membaca (Al Fatihah dan surat al-qur'an) pada rakaat ke sembilan, lalu beliau duduk dan berdo'a dengan do'a yang di kehendaki Allah, beliau memohon kepada-Nya dan beliau berdo'a dengan penuh harap. Setelah itu beliau mengucapkan satu kali salam dengan keras, hingga hampir saja membangunkan keluarga beliau lantaran kerasnya salam beliau, setelah itu beliau membaca (Al Fatihah dan surat al-qur'an) dalam keadaan duduk dan ruku' sambil duduk pula, lalu beliau membaca lagi yang kedua kalinya, lalu ruku' dan sujud sembari duduk, kemudian beliau berdo'a sesuai yang di kehendaki Allah, setelah itu beliau salam dan beranjak (meninggalkan tempat sholat). Rasulullah shallallahu 'alaihi wasallam masih tetap mengerjakan sholat seperti itu hingga beliau menjadi gemuk, lalu beliau mengurangi dua rakaat dari sembilan raka'at, hingga menjadi enam hingga tujuh raka'at di tambah dua raka'at yang beliau kerjakan dengan duduk, sampai beliau shallallahu 'alaihi wasallam meninggal dunia.\" Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Bahz bin Hakim] kemudian dia menyebutkan hadits ini dengan sanadnya, katanya; \"Selepas sholat Isya', beliau pergi ke tempat tidurnya…\" tidak menyebutkan \"empat raka'at\" lalu dia menyebutkan hadits ini, dan dalam hadits tersebut dia berkata; \"Kemudian beliau sholat delapan raka'at, beliau menyamakan (lamanya) antara ketika membaca (surat al-qur'an), ruku' dan sujud. Beliau tidak duduk dalam raka'at tersebut kecuali pada raka'at ke delapan. (dalam raka'at ke delapan) biasanya beliau duduk lalu bediri, tidak salam, lalu beliau melanjutkan satu raka'at sebagai witirnya, setelah itu beliau salam dengan mengeraskan suaranya hingga membangunkan kami semua.\" Kemudian dia melanjutkan maksud hadits tersebut. Telah menceritakan kepada kami [Umar bin Utsman] telah menceritakan kepada kami [Marwan yaitu Ibnu Mu'awiyah] dari [Bahz] telah menceritakan kepada kami [Zurarah bin Aufa] dari [Aisyah Ummul Mukminin] bahwa dia pernah di tanya mengenai sholat (malam) nya Rasulullah shallallahu 'alaihi wasallam, Aisyah menjawab; \"Beliau biasa mengerjakan sholat Isya' bersama orang-orang (berjama'ah), kemudian beliau pulang ke keluarganya, lalu sholat (sunnah) empat raka'at. setelah itu beliau pergi ke tempat tidurnya…\" kemudian perawi melanjutkan hadits panjang tersebut, namun dia tidak menyebutkan \"Beliau menyamakan (lamanya) antara membaca (surat al-qur'an), ruku' dan sujudnya.\" Dan tidak pula menyebutkan \"Lalu beliau mengucapkan salam sehingga membangunkan kami.\" Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad yaitu Ibnu Salamah] dari [Bahz bin Hakim] dari [Zurarah bin Aufa] dari [Sa'd bin Hisyam] dari [Aisyah radliallahu 'anha] seperti hadits tersebut, namun hadits mereka tidak sesempurna (hadits yang pertama).\""
            },
            {
                "number": 1128,
                "arab": "حَدَّثَنَا مُوسَى يَعْنِي ابْنَ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي مِنْ اللَّيْلِ ثَلَاثَ عَشْرَةَ رَكْعَةً يُوتِرُ بِتِسْعٍ أَوْ كَمَا قَالَتْ وَيُصَلِّي رَكْعَتَيْنِ وَهُوَ جَالِسٌ وَرَكْعَتَيْ الْفَجْرِ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ",
                "id": "Telah menceritakan kepada kami [Musa yaitu Ibnu Isma'il] telah menceritakan kepada kami [Hammad yaitu Ibnu Salamah] dari [Muhammad bin 'Amru] dari [Abu Salamah bin Abdurrahman] dari [Aisyah] radliallahu 'anha bahwa Rasulullah shallallahu 'alaihi wasallam biasa mengerjakan sholat malam tiga belas raka'at, beserta witirnya sembilan raka'at atau sebagaimana di katakan oleh Aisyah, dan beliau mengerjakan dua raka'at dengan duduk, dan dua raka'at fajar antara adzan dan Iqamah.\""
            },
            {
                "number": 1129,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا حُصَيْنٌ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ حُصَيْنٍ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍأَنَّهُ رَقَدَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَآهُ اسْتَيْقَظَ فَتَسَوَّكَ وَتَوَضَّأَ وَهُوَ يَقُولُ{ إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالْأَرْضِ }حَتَّى خَتَمَ السُّورَةَ ثُمَّ قَامَ فَصَلَّى رَكْعَتَيْنِ أَطَالَ فِيهِمَا الْقِيَامَ وَالرُّكُوعَ وَالسُّجُودَ ثُمَّ انْصَرَفَ فَنَامَ حَتَّى نَفَخَ ثُمَّ فَعَلَ ذَلِكَ ثَلَاثَ مَرَّاتٍ بِسِتِّ رَكَعَاتٍ كُلُّ ذَلِكَ يَسْتَاكُ ثُمَّ يَتَوَضَّأُ وَيَقْرَأُ هَؤُلَاءِ الْآيَاتِ ثُمَّ أَوْتَرَ قَالَ عُثْمَانُ بِثَلَاثِ رَكَعَاتٍ فَأَتَاهُ الْمُؤَذِّنُ فَخَرَجَ إِلَى الصَّلَاةِ وَقَالَ ابْنُ عِيسَى ثُمَّ أَوْتَرَ فَأَتَاهُ بِلَالٌ فَآذَنَهُ بِالصَّلَاةِ حِينَ طَلَعَ الْفَجْرُ فَصَلَّى رَكْعَتَيْ الْفَجْرِ ثُمَّ خَرَجَ إِلَى الصَّلَاةِ ثُمَّ اتَّفَقَا وَهُوَ يَقُولُ اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا وَاجْعَلْ فِي لِسَانِي نُورًا وَاجْعَلْ فِي سَمْعِي نُورًا وَاجْعَلْ فِي بَصَرِي نُورًا وَاجْعَلْ خَلْفِي نُورًا وَأَمَامِي نُورًا وَاجْعَلْ مِنْ فَوْقِي نُورًا وَمِنْ تَحْتِي نُورًا اللَّهُمَّ وَأَعْظِمْ لِي نُورًاحَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ عَنْ حُصَيْنٍ نَحْوَهُ قَالَ وَأَعْظِمْ لِي نُورًا قَالَ أَبُو دَاوُد وَكَذَلِكَ قَالَ أَبُو خَالِدٍ الدَّالَانِيُّ عَنْ حَبِيبٍ فِي هَذَا وَكَذَلِكَ قَالَ فِي هَذَا الْحَدِيثِ وَقَالَ سَلَمَةُ بْنُ كُهَيْلٍ عَنْ أَبِي رِشْدِينَ عَنْ ابْنِ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Hushain] dari [Habib bin Abu Tsabit]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Hushain] dari [Habib bin Abu Tsabit] dari [Muhammad bin Ali bin Abdullah bin 'Abbas] dari [ayahnya] dari [Ibnu Abbas] bahwa dia pernah tidur di samping Nabi shallallahu 'alaihi wasallam, maka dia melihat beliau bangun (malam) lalu bersiwak dan berwudlu', lalu beliau mengucapkan; \"Sesungguhnya dalam penciptaan langit dan bumi…\" hingga akhir ayat, setelah itu mengerjakan sholat dua raka'at, dalam dua raka'at tersebut, beliau panjangkan berdirinya, ruku'nya dan sujudnya. Selesai sholat beliau tidur hingga mendengkur. Beliau kerjakan hal itu hingga tiga kali, yaitu enam raka'at. setiap kali hendak sholat, beliau bersiwak lalu berwudlu dan membaca beberapa ayat. Kemudian beliau sholat witir tiga raka'at. Setelah itu Mu'adzin datang, lalu beliau keluar untuk mengerjakan sholat (subuh).\" Ibnu 'Isa mengatakan; \"…kemudian beliau mengerjakan witir, lalu datanglah Bilal untuk mengumandangkan adzan sholat ketika fajar telah terbit, kemudian beliau mengerjakan dua raka'at (sunnah) fajar. Setelah itu beliau keluar untuk mengerjakan sholat -lalu hadits keduanya sepakat pada kalimat- sambil mengucapkan: \"Allahummaj'al fii qalbii nuuran, waj'al fii lisaani nuuran, waj'al fii basharii nuuran, waj'al khalfii nuuran, wa amaami nuuran, waj'al min fauqii nuuran wa min tahtii nuuran, Allahumma wa a'dzim lii nuuran (Ya Allah, jadikanlah dalam hatiku cahaya, jadikanlah dalam lisanku cahaya, jadikanlah dalam pendengaranku cahaya, jadikanlah dalam penglihatanku cahaya, jadikanlah di belakangku cahaya, jadikanlah di depanku cahaya, jadikanlah di atasku cahaya, jadikanlah di bawahku cahaya. Ya Allah, agungkanlah untukku cahaya.\" Telah menceritakan kepada kami [Wahb bin Baqiyah] dari [Khalid] dari [Hushain] seperti hadits di atas, dia berkata; \"Wa a'dzim lii nuuran (dan agungkanlah untukku cahaya).\" Abu Daud berkata; \"Demikian pula yang di katakan [Abu Khalid Ad Dalalani] dari [Habib] dalam permasalahan ini, demikian pula dia berkata dalam hadits ini, [Salamah bin Kuhail] berkata; dari [Abu Risydin] dari [Ibnu Abbas].\""
            },
            {
                "number": 1130,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ عَنْ كُرَيْبٍ عَنْ الْفَضْلِ بْنِ عَبَّاسٍ قَالَبِتُّ لَيْلَةً عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَنْظُرَ كَيْفَ يُصَلِّي فَقَامَ فَتَوَضَّأَ وَصَلَّى رَكْعَتَيْنِ قِيَامُهُ مِثْلُ رُكُوعِهِ وَرُكُوعُهُ مِثْلُ سُجُودِهِ ثُمَّ نَامَ ثُمَّ اسْتَيْقَظَ فَتَوَضَّأَ وَاسْتَنَّ ثُمَّ قَرَأَ بِخَمْسِ آيَاتٍ مِنْ آلِ عِمْرَانَ{ إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالْأَرْضِ وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ }فَلَمْ يَزَلْ يَفْعَلُ هَذَا حَتَّى صَلَّى عَشْرَ رَكَعَاتٍ ثُمَّ قَامَ فَصَلَّى سَجْدَةً وَاحِدَةً فَأَوْتَرَ بِهَا وَنَادَى الْمُنَادِي عِنْدَ ذَلِكَ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَمَا سَكَتَ الْمُؤَذِّنُ فَصَلَّى سَجْدَتَيْنِ خَفِيفَتَيْنِ ثُمَّ جَلَسَ حَتَّى صَلَّى الصُّبْحَقَالَ أَبُو دَاوُد خَفِيَ عَلَيَّ مِنْ ابْنِ بَشَّارٍ بَعْضُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu 'Ashim] telah menceritakan kepada kami [Zuhair bin Muhammad] dari [Syarik bin Abdullah bin Abu Namir] dari [Kuraib] dari [Al Fadl bin Abbas] dia berkata; \"Aku pernah bermalam di sisi Nabi shallallahu 'alaihi wasallam untuk melihat bagaimana cara beliau sholat (malam). Maka (aku melihat) beliau bangun lalu berwudlu' dan sholat dua raka'at. (lama) beliau berdiri sama seperti ruku' dan sujudnya. Setelah itu beliau tidur, kemudian beliau bangun lagi, lalu berwudlu dan bersiwak, kemudian beliau mengucapkan lima ayat dari surat Ali Imran, yaitu; \"Sesungguhnya dalam penciptaan langit dan bumi, dan silih bergantinya malam dan siang…\" (QS Ali Imran; 190), beliau selalu mengerjakan perbuatan ini, sehingga beliau mengerjakan sholat sepuluh raka'at, kemudian beliau bangun dan mengerjakan sholat satu raka'at sebagai witirnya. Setelah seorang Muadzin menyerukan adzan, maka Rasulullah shallallahu 'alaihi wasallam akan mengerjakan sholat dua raka'at yang ringan, kemudian beliau duduk hingga tiba sholat subuh.\" Abu Daud berkata; \"Aku tidak jelas sebagian (riwayat) dari Ibnu Basyar.\""
            },
            {
                "number": 1131,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا مُحَمَّدُ بْنُ قَيْسٍ الْأَسَدِيُّ عَنْ الْحَكَمِ بْنِ عُتَيْبَةَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَبِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَمَا أَمْسَى فَقَالَ أَصَلَّى الْغُلَامُ قَالُوا نَعَمْ فَاضْطَجَعَ حَتَّى إِذَا مَضَى مِنْ اللَّيْلِ مَا شَاءَ اللَّهُ قَامَ فَتَوَضَّأَ ثُمَّ صَلَّى سَبْعًا أَوْ خَمْسًا أَوْتَرَ بِهِنَّ لَمْ يُسَلِّمْ إِلَّا فِي آخِرِهِنَّ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Muhammad bin Qais Al Asadi] dari [Al Hakam bin 'Utaibah] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dia berkata; \"Aku pernah bermalam di rumah bibiku Maimunah, lalu Rasulullah shallallahu 'alaihi wasallam datang setelah waktu sore tiba, maka beliau bersabda: \"Apakah anak ini sudah sholat?\" mereka menjawab; \"Ya, sudah.\" Kemudian beliau berbaring, setelah malam berlalu sebagaimana yang Allah kehendaki, beliau bangun, berwudlu' kemudian sholat tujuh atau lima raka'at dengan sholat witirnya, beliau tidak salam kecuali di raka'at terakhir (raka'at ke tujuh atau ke lima).\""
            },
            {
                "number": 1132,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اكْلَفُوا مِنْ الْعَمَلِ مَا تُطِيقُونَ فَإِنَّ اللَّهَ لَا يَمَلُّ حَتَّى تَمَلُّوا وَإِنَّ أَحَبَّ الْعَمَلِ إِلَى اللَّهِ أَدْوَمُهُ وَإِنْ قَلَّ وَكَانَ إِذَا عَمِلَ عَمَلًا أَثْبَتَهُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Ibnu 'Ajlan] dari [Sa'id Al Maqburi] dari [Abu Salamah] dari [Aisyah] radliallahu 'anha bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kerjakanlah suatu amalan itu sesuai dengan kemampuan kalian, karena Allah tidak akan bosan sehingga diri kalianlah yang bosan, sesungguhnya amalan yang paling di cintai Allah adalah yang di kerjakan secara terus menerus walaupun sedikit.\" apabila beliau mengerjakan suatu amalan, beliau akan mengerjakannya secara rutin.\""
            },
            {
                "number": 1133,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ حَدَّثَنَا عَمِّي حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ إِلَى عُثْمَانَ بْنِ مَظْعُونٍ فَجَاءَهُ فَقَالَ يَا عُثْمَانُ أَرَغِبْتَ عَنْ سُنَّتِي قَالَ لَا وَاللَّهِ يَا رَسُولَ اللَّهِ وَلَكِنْ سُنَّتَكَ أَطْلُبُ قَالَ فَإِنِّي أَنَامُ وَأُصَلِّي وَأَصُومُ وَأُفْطِرُ وَأَنْكِحُ النِّسَاءَ فَاتَّقِ اللَّهَ يَا عُثْمَانُ فَإِنَّ لِأَهْلِكَ عَلَيْكَ حَقًّا وَإِنَّ لِضَيْفِكَ عَلَيْكَ حَقًّا وَإِنَّ لِنَفْسِكَ عَلَيْكَ حَقًّا فَصُمْ وَأَفْطِرْ وَصَلِّ وَنَمْ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Sa'd] telah menceritakan kepada kami [pamanku] telah menceritakan kepada kami [ayahku] dari [Ibnu Ishaq] dari [Hisyam bin 'Urwah] dari [ayahnya] dari [Aisyah] bahwa Nabi shallallahu 'alaihi wasallam mengutus seseorang menemui Utsman bin Mazh'un, lalu Utsman datang kepada beliau, maka beliau bersabda: \"Apakah kamu membenci sunnahku?\" Utsman menjawab; \"Tidak, demi Allah wahai Rasulullah… bahkan sunnahmu lah yang amat kami cari.\" Beliau bersabda: \"Sesungguhnya aku tidur, aku juga sholat, aku berpuasa dan juga berbuka, aku juga menikahi wanita. Bertaqwalah kepada Allah wahai Utsman, sesungguhnya keluargamu mempunyai hak atas dirimu, dan tamumu mempunyai hak atas dirimu, dan kamu pun memiliki hak atas dirimu sendiri, oleh karena itu berpuasa dan berbukalah, kerjakanlah sholat dan tidurlah.\""
            },
            {
                "number": 1134,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ قَالَسَأَلْتُ عَائِشَةَ كَيْفَ كَانَ عَمَلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ كَانَ يَخُصُّ شَيْئًا مِنْ الْأَيَّامِ قَالَتْ لَا كَانَ كُلُّ عَمَلِهِ دِيمَةً وَأَيُّكُمْ يَسْتَطِيعُ مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَطِيعُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Ibrahim] dari ['Alqamah] dia berkata; aku bertanya kepada [Aisyah]; \"Bagaimanakah amal perbuatan Rasulullah shallallahu 'alaihi wasallam? Apakah beliau pernah mengkhususkan suatu hari yang tertentu?\" Aisyah menjawab; \"Tidak, setiap amalan beliau selalu di kerjakan secara rutin, dan siapakan di antara kalian yang mampu mengerjakan amalan yang di kerjakan oleh Rasulullah shallallahu 'alaihi wasallam?\""
            },
            {
                "number": 1135,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ الْمُتَوَكِّلِ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ قَالَ الْحَسَنُ فِي حَدِيثِهِ وَمَالِكُ بْنُ أَنَسٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُرَغِّبُ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ أَنْ يَأْمُرَهُمْ بِعَزِيمَةٍ ثُمَّ يَقُولُ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ فَتُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْأَمْرُ عَلَى ذَلِكَ ثُمَّ كَانَ الْأَمْرُ عَلَى ذَلِكَ فِي خِلَافَةِ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ وَصَدْرًا مِنْ خِلَافَةِ عُمَرَ رَضِيَ اللَّهُ عَنْهُقَالَ أَبُو دَاوُد وَكَذَا رَوَاهُ عُقَيْلٌ وَيُونُسُ وَأَبُو أُوَيْسٍ مَنْ قَامَ رَمَضَانَ وَرَوَى عُقَيْلٌ مَنْ صَامَ رَمَضَانَ وَقَامَهُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] dan [Muhammad bin Al Mutawakkil] keduanya berkata; telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar]; Al Hasan berkata dalam haditsnya; Dan [Malik bin Anas] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam biasa memberi motivasi untuk selalu mengerjakan sholat pada malam bulan Ramadhan tanpa memerintahkan secara ketat kepada mereka, beliau bersabda: \"Barangsiapa bangun (sholat) malam pada bulan Ramadhan dengan penuh keimanan dan mengharap (ridla Allah), maka dosa-dosanya yang telah lalu akan di ampuni.\" Lalu Rasulullah shallallahu 'alaihi wasallam wafat, sedangkan perkara itu masih tetap ada, kemudian perkara itu berlanjut hingga pemerintahan Abu Bakar radliallahu 'anhu dan di awal pemerintahan Umar radliallahu 'anhu. Abu Daud berkata; \"Demikian pula yang di riwayatkan oleh ['Uqail], [Yunus] dan [Abu Uwais] yaitu; \"Barangsiapa berpuasa pada bulan Ramadhan dan bangun (sholat) pada malamnya…\""
            },
            {
                "number": 1136,
                "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ وَابْنُ أَبِي خَلَفٍ الْمَعْنَى قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِقَالَ أَبُو دَاوُد وَكَذَا رَوَاهُ يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ وَمُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ",
                "id": "Telah menceritakan kepada kami [Mukhlad bin Khalid] dan [Ibnu Abu Khalaf] yang maksudnya sama, keduanya berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] yang sampai kepada Nabi shallallahu 'alaihi wasallam, sabdanya: \"Barangsiapa berpuasa di bulan Ramadhan dengan keimanan dan penuh harap, maka akan di ampuni dosa-dosanya yang telah lalu. Dan barangsiapa bangun (sholat) pada malam lailatul Qadr dengan keimanan dan penuh harap, maka akan di ampuni dosa-dosanya yang telah lalu.\" Abu Daud berkata; \"Demikian pula yang di riwayatkan [Yahya bin Abu Katsir] dari [Abu Salamah], dan [Muhammad bin 'Amru] dari [Abu salamah].\""
            },
            {
                "number": 1137,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي الْمَسْجِدِ فَصَلَّى بِصَلَاتِهِ نَاسٌ ثُمَّ صَلَّى مِنْ الْقَابِلَةِ فَكَثُرَ النَّاسُ ثُمَّ اجْتَمَعُوا مِنْ اللَّيْلَةِ الثَّالِثَةِ فَلَمْ يَخْرُجْ إِلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا أَصْبَحَ قَالَ قَدْ رَأَيْتُ الَّذِي صَنَعْتُمْ فَلَمْ يَمْنَعْنِي مِنْ الْخُرُوجِ إِلَيْكُمْ إِلَّا أَنِّي خَشِيتُ أَنْ تُفْرَضَ عَلَيْكُمْ وَذَلِكَ فِي رَمَضَانَحَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا عَبْدَةُ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ قَالَتْ كَانَ النَّاسُ يُصَلُّونَ فِي الْمَسْجِدِ فِي رَمَضَانَ أَوْزَاعًا فَأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَضَرَبْتُ لَهُ حَصِيرًا فَصَلَّى عَلَيْهِ بِهَذِهِ الْقِصَّةِ قَالَتْ فِيهِ قَالَ تَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّهَا النَّاسُ أَمَا وَاللَّهِ مَا بِتُّ لَيْلَتِي هَذِهِ بِحَمْدِ اللَّهِ غَافِلًا وَلَا خَفِيَ عَلَيَّ مَكَانُكُمْ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik bin Anas] dari [Ibnu Syihab] dari ['Urwah bin Az Zubair] dari [Aisyah isteri Nabi] shallallahu 'alaihi wasallam bahwa Nabi shallallahu 'alaihi wasallam mengerjakan sholat di dalam masjid, kemudian orang-orang turut mengikuti sholat beliau, kemudian beliau mengerjakan lagi di malam berikutnya, ternyata orang-orang yang mengikuti sholat beliau semakin banyak, Dan di malam ketiga, ketika orang-orang telah berkumpul, Rasulullah shallallahu 'alaihi wasallam tidak kunjung keluar. Keesokan harinya, beliau bersabda: \"Aku telah mengetahui apa yang kalian perbuat semalam, dan tidak ada sesuatu pun yang menghalangiku keluar menemui kalian, hanya saja aku khawatir jika sholat tersebut akan diwajibkan atas kalian.\" Kejadian itu terjadi pada bulan Ramadhan.\" Telah menceritakan kepada kami [Hannad bin As Sarri] telah menceritakan kepada kami ['Abdah] dari [Muhammad bin 'Amru] dari [Muhammad bin Ibrahim] dari [Abu Salamah bin Abdurrahman] dari [Aisyah] dia berkata; \"Biasanya orang-orang mengerjakan sholat di masjid pada bulan Ramadhan secara terpisah, lalu Rasulullah shallallahu 'alaihi wasallam memerintahkanku (untuk menghamparkan tikar), maka aku pun menghamparkan tikar untuk beliau, lalu beliau sholat di atas tikar tersebut…\" seperti kisah dalam hadits ini, Aisyah berkata; \"Beliau yaitu Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai sekalian manusia, demi Allah, segala puji bagi Allah, tidaklah aku lalai pada malam hariku ini, dan tidak pula tempat kalian samar bagiku.\""
            },
            {
                "number": 1138,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ أَخْبَرَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ عَنْ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِي ذَرٍّ قَالَصُمْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَمَضَانَ فَلَمْ يَقُمْ بِنَا شَيْئًا مِنْ الشَّهْرِ حَتَّى بَقِيَ سَبْعٌ فَقَامَ بِنَا حَتَّى ذَهَبَ ثُلُثُ اللَّيْلِ فَلَمَّا كَانَتْ السَّادِسَةُ لَمْ يَقُمْ بِنَا فَلَمَّا كَانَتْ الْخَامِسَةُ قَامَ بِنَا حَتَّى ذَهَبَ شَطْرُ اللَّيْلِ فَقُلْتُ يَا رَسُولَ اللَّهِ لَوْ نَفَّلْتَنَا قِيَامَ هَذِهِ اللَّيْلَةِ قَالَ فَقَالَ إِنَّ الرَّجُلَ إِذَا صَلَّى مَعَ الْإِمَامِ حَتَّى يَنْصَرِفَ حُسِبَ لَهُ قِيَامُ لَيْلَةٍ قَالَ فَلَمَّا كَانَتْ الرَّابِعَةُ لَمْ يَقُمْ فَلَمَّا كَانَتْ الثَّالِثَةُ جَمَعَ أَهْلَهُ وَنِسَاءَهُ وَالنَّاسَ فَقَامَ بِنَا حَتَّى خَشِينَا أَنْ يَفُوتَنَا الْفَلَاحُ قَالَ قُلْتُ وَمَا الْفَلَاحُ قَالَ السُّحُورُ ثُمَّ لَمْ يَقُمْ بِقِيَّةَ الشَّهْرِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yazid bin Zurai'] telah mengabarkan kepada kami [Daud bin Abu Hind] dari [Al Walid bin Abdurrahman] dari [Jubair bin Nufair] dari [Abu Dzar] dia berkata; \"Kami pernah berpuasa Ramadhan bersama Rasulullah shallallahu 'alaihi wasallam, dan beliau tidak pernah mengerjakan sholat malam bersama kami sedikitpun dalam sebulan sampai berlalu sepertiga malam, setelah malam ke enam (dari akhir bulan) beliau juga tidak mengerjakan sholat malam bersama kami, ketika di hari ke lima (dari akhir bulan), beliau mengerjakan sholat malam bersama kami hingga tengah malam pun berlalu. Maka kataku; \"wahai Rasulullah, alangkah baiknya sekiranya anda memperbanyak sholat sunnah (qiyamullail) pada malam hari ini untuk kami!.\" Abu Dzar berkata; Maka beliau bersabda: \"Sesungguhnya apabila seseorang sholat (malam) bersama imam hingga selesai, maka akan di catat baginya seperti bangun (untuk mengerjakan sholat malam) semalam suntuk.\" Kata Abu Dzar; \"Ketika malam ke empat (dari akhir bulan) beliau tidak mengerjakan sholat malam (bersama kami), setelah malam ketiga (dari akhir bulan), beliu mengumpulkan keluarganya, isteri-isterinya dan orang-orang, lalu melakukan sholat malam bersama kami, sampai kami khawatir ketinggalah \"Al falah.\" Jabir bertanya; \"Apakah al falah itu?\" jawabnya; \"Waktu sahur, kemudian beliau tidak lagi melakukan sholat malam bersama kami di malam-malam berikutnya dari sebulan itu.\""
            },
            {
                "number": 1139,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ وَدَاوُدُ بْنُ أُمَيَّةَ أَنَّ سُفْيَانَ أَخْبَرَهُمْ عَنْ أَبِي يَعْفُورٍ وَقَالَ دَاوُدُ عَنْ ابْنِ عُبَيْدِ بْنِ نِسْطَاسٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ إِذَا دَخَلَ الْعَشْرُ أَحْيَا اللَّيْلَ وَشَدَّ الْمِئْزَرَ وَأَيْقَظَ أَهْلَهُقَالَ أَبُو دَاوُد وَأَبُو يَعْفُورٍ اسْمُهُ عَبْدُ الرَّحْمَنِ بْنُ عُبَيْدِ بْنِ نِسْطَاسٍ",
                "id": "Telah menceritakan kepada kami [Nahsr bin Ali] dan [Daud bin Umayyah] bahwa [Sufyan] mengabarkan kepada mereka, dari [Abu Ya'fur]. [Daud] mengatakan; dari [Abu 'Ubaid bin Nisthasi] dari [Abu Adl Dluha] dari [Masruq] dari [Aisyah] bahwa ketika Nabi shallallahu 'alaihi wasallam memasuki sepuluh malam yang terakhir, beliau menghidupkan malamnya dan mengencangkan ikat pinggang serta membangunkan keluarganya.\" Abu Daud berkata; \"Abu Ya'fur namanya adalah Abdurrahman bin 'Ubaid bin Nisthasi.\""
            },
            {
                "number": 1140,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي مُسْلِمُ بْنُ خَالِدٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا أُنَاسٌ فِي رَمَضَانَ يُصَلُّونَ فِي نَاحِيَةِ الْمَسْجِدِ فَقَالَ مَا هَؤُلَاءِ فَقِيلَ هَؤُلَاءِ نَاسٌ مَعَهُمْ قُرْآنٌ وَأُبَيُّ بْنُ كَعْبٍ يُصَلِّي وَهُمْ يُصَلُّونَ بِصَلَاتِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَابُوا وَنِعْمَ مَا صَنَعُواقَالَ أَبُو دَاوُد لَيْسَ هَذَا الْحَدِيثُ بِالْقَوِيِّ مُسْلِمُ بْنُ خَالِدٍ ضَعِيفٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Al hamdani] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku [Muslim bin Khalid] dari [Al 'Ala` bin Abdurrahman] dari [ayahnya] dari [Abu Hurairah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam keluar, dan beliau melihat orang-orang tengah mengerjakan sholat di pojok-pojok masid, beliau bersabda: \"Apa yang sedang di perbuat oleh mereka?\" maka di jawab; \"Beberapa orang yang tidak hafal al-qur'an, sedangkan Ubay bin Ka'b tengah mengerjakan sholat yang di ikuti oleh mereka.\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Mereka benar, alangkah baiknya amal perbuatan mereka.\" Abu Daud berkata; 'Hadits ini tidaklah kuat, sebab Muslim bin Khalid riwayatnya lemah.\""
            },
            {
                "number": 1141,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَمُسَدَّدٌ الْمَعْنَى قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَاصِمٍ عَنْ زِرٍّ قَالَ قُلْتُ لِأُبَيِّ بْنِ كَعْبٍ أَخْبِرْنِي عَنْ لَيْلَةِ الْقَدْرِ يَا أَبَا الْمُنْذِرِ فَإِنَّ صَاحِبَنَا سُئِلَ عَنْهَا فَقَالَ مَنْ يَقُمْ الْحَوْلَ يُصِبْهَافَقَالَ رَحِمَ اللَّهُ أَبَا عَبْدِ الرَّحْمَنِ وَاللَّهِ لَقَدْ عَلِمَ أَنَّهَا فِي رَمَضَانَ زَادَ مُسَدَّدٌ وَلَكِنْ كَرِهَ أَنْ يَتَّكِلُوا أَوْ أَحَبَّ أَنْ لَا يَتَّكِلُوا ثُمَّ اتَّفَقَا وَاللَّهِ إِنَّهَا لَفِي رَمَضَانَ لَيْلَةَ سَبْعٍ وَعِشْرِينَ لَا يَسْتَثْنِي قُلْتُ يَا أَبَا الْمُنْذِرِ أَنَّى عَلِمْتَ ذَلِكَ قَالَ بِالْآيَةِ الَّتِي أَخْبَرَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ لِزِرٍّ مَا الْآيَةُ قَالَ تُصْبِحُ الشَّمْسُ صَبِيحَةَ تِلْكَ اللَّيْلَةِ مِثْلَ الطَّسْتِ لَيْسَ لَهَا شُعَاعٌ حَتَّى تَرْتَفِعَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] dan [Musaddad] sedangkan maksudnya sama, keduanya berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari ['Ashim] dari [Zirrin] dia berkata; aku bertanya kepada [Ubay bin Ka'b]; \"wahai Abu Mundzir, beritahukanlah kepadaku mengenai lailatul qadr!, karena sesungguhnya sahabat kami (Ibnu Mas'ud) pernah di tanya tentang lailatul qadr, lalu dia menjawab; \"Barangsiapa melakukan (qiyamullail) setahun penuh, maka ia akan mendapatkannya.\" Ubay bin Ka'b berkata; \"Semoga Allah merahmati Abu Abdurrahman, sungguh dirinya telah mengetahui bahwa lailatul qadr terjadi pada bulan Ramadhan.\" Musaddad menambahkan; \"Tapi beliau tidak senang jika kalian bergantung pada lailatul qadr -atau- beliau lebih suka jika kalian tidak bergantung pada lailatul qadr. Demi Allah, sesungguhnya lailatul qadr itu terjadi pada bulan Ramadhan yaitu pada tanggal dua puluh tujuh tanpa terkecuali.\" Tanyaku; \"Wahai Abu Mundzir, bagaimana kamu dapat mengetahui hal itu?\" dia menjawab; \"yaitu dengan tanda-tanda yang pernah di beritahukan Rasulullah shallallahu 'alaihi wasallam.\" aku berkata kepada Zirr; \"Apakah tanda-tandanya?\" dia menjawab; \"Matahari pada pagi harinya seperti baskom, tidak bercahaya hingga ia meninggi.\""
            },
            {
                "number": 1142,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ السُّلَمِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا إِبْرَاهِيمُ بْنُ طَهْمَانَ عَنْ عَبَّادِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ الزُّهْرِيِّ عَنْ ضَمْرَةَ بْنِ عَبْدِ اللَّهِ بْنِ أُنَيْسٍ عَنْ أَبِيهِ قَالَكُنْتُ فِي مَجْلِسِ بَنِي سَلَمَةَ وَأَنَا أَصْغَرُهُمْ فَقَالُوا مَنْ يَسْأَلُ لَنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لَيْلَةِ الْقَدْرِ وَذَلِكَ صَبِيحَةَ إِحْدَى وَعِشْرِينَ مِنْ رَمَضَانَ فَخَرَجْتُ فَوَافَيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْمَغْرِبِ ثُمَّ قُمْتُ بِبَابِ بَيْتِهِ فَمَرَّ بِي فَقَالَ ادْخُلْ فَدَخَلْتُ فَأُتِيَ بِعَشَائِهِ فَرَآنِي أَكُفُّ عَنْهُ مِنْ قِلَّتِهِ فَلَمَّا فَرَغَ قَالَ نَاوِلْنِي نَعْلِي فَقَامَ وَقُمْتُ مَعَهُ فَقَالَ كَأَنَّ لَكَ حَاجَةً قُلْتُ أَجَلْ أَرْسَلَنِي إِلَيْكَ رَهْطٌ مِنْ بَنِي سَلَمَةَ يَسْأَلُونَكَ عَنْ لَيْلَةِ الْقَدْرِ فَقَالَ كَمْ اللَّيْلَةُ فَقُلْتُ اثْنَتَانِ وَعِشْرُونَ قَالَ هِيَ اللَّيْلَةُ ثُمَّ رَجَعَ فَقَالَ أَوْ الْقَابِلَةُ يُرِيدُ لَيْلَةَ ثَلَاثٍ وَعِشْرِينَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hafsh bin Abdullah As Sulami] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Ibrahim bin Thahman] dari ['Abbad bin Ishaq] dari [Muhammad bin Muslim Az Zuhri] dari [Dlamrah bin Abdullah bin Unais] dari [ayahnya] dia berkata; \"Aku pernah berada di majlisnya Bani Salamah, sementara waktu itu aku lah yang paling muda, mereka berkata; \"Siapakah yang akan menanyakan untuk kita kepada Rasulullah shallallahu 'alaihi wasallam tentang lailatul qadr?\" pada pagi itu adalah tanggal dua puluh satu Ramadhan, lalu aku keluar, maka aku dapati beliau tengah mengerjakan sholat Maghrib, kemudian aku berdiri di depan pintu rumah beliau, lalu beliau lewat di depanku, beliau bersabda; \"Masuklah.\" Lalu aku pun masuk, saat itu makan malam beliau telah terhidang, maka aku menahan diri karena memang makan malam beliau sangat sedikit. setelah selesai, beliau bersabda: \"Tolong ambilkan sandalku!.\" Lalu beliau berdiri dan aku pun berdiri bersama beliau, beliau bersabda: \"Sepertinya kamu mempunyai keperluan?\" jawabku; \"Ya benar, beberapa pemuda dari Bani Salamah mengutusku untuk menyakan lailatul qadr kepada anda.\" Beliau bertanya; \"Tanggal berapakah malam ini?\" jawabku; \"Malam ke dua puluh dua.\" Beliau bersabda: \"Pada malam inilah lailatul qadr terjadi.\" Kemudian beliau kembali dan bersabda: \"atau malam berikutnya.\" Yang beliau maksudkan adalah malam ke dua puluh tiga.\""
            },
            {
                "number": 1143,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْحَقَ حَدَّثَنَا مُحَمَّدُ بْنُ إِبْرَاهِيمَ عَنْ ابْنِ عَبْدِ اللَّهِ بْنِ أُنَيْسٍ الْجُهَنِيِّ عَنْ أَبِيهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ لِي بَادِيَةً أَكُونُ فِيهَا وَأَنَا أُصَلِّي فِيهَا بِحَمْدِ اللَّهِ فَمُرْنِي بِلَيْلَةٍ أَنْزِلُهَا إِلَى هَذَا الْمَسْجِدِ فَقَالَ انْزِلْ لَيْلَةَ ثَلَاثٍ وَعِشْرِينَفَقُلْتُ لِابْنِهِ كَيْفَ كَانَ أَبُوكَ يَصْنَعُ قَالَ كَانَ يَدْخُلُ الْمَسْجِدَ إِذَا صَلَّى الْعَصْرَ فَلَا يَخْرُجُ مِنْهُ لِحَاجَةٍ حَتَّى يُصَلِّيَ الصُّبْحَ فَإِذَا صَلَّى الصُّبْحَ وَجَدَ دَابَّتَهُ عَلَى بَابِ الْمَسْجِدِ فَجَلَسَ عَلَيْهَا فَلَحِقَ بِبَادِيَتِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah mengabarkan kepada kami [Muhammad bin Ishaq] telah menceritakan kepada kami [Muhammad bin Ibrahim] dari [Ibnu Abdullah bin Unais Al Juhani] dari [ayahnya] berkata; saya berkata; wahai Rasulullah, sesungguhnya saya memiliki perkampungan yang aku tinggal di sana dan alhamdulillah aku dapat melaksanakan sholat di dalamnya, maka perintahkanlah kepadaku satu malam sehingga pada malam itu aku dapat tinggal di masjid ini, maka Rasulullah Shallallahu 'alaihi wasallam menjawab: \"Tinggallah pada malam ke dua puluh tiga\". (perawi berkata) Kemudian aku bertanya kepada anaknya (Ibnu Abdullah bin Unais): \"bagaimana bapakmu melakukannya?\" dia menjawab: \"Bapakku masuk ke Masjid jika hendak sholat asar, dan dia tidak keluar untuk memenuhi hajatnya sampai dia sholat shubuh, apabila ia selesai sholat shubuh dia menghampiri kendaraannya di depan pintu masjid, kemudian ia menaikinya dan kembali ke perkampungannya. "
            },
            {
                "number": 1144,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ أَخْبَرَنَا أَيُّوبُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ فِي تَاسِعَةٍ تَبْقَى وَفِي سَابِعَةٍ تَبْقَى وَفِي خَامِسَةٍ تَبْقَى",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Wuhaib] telah mengabarkan kepada kami [Ayyub] dari ['Ikrimah] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Carilah lailatul qadar pada sepuluh terakhir bulan ramadhan, sembilan tersisa, tujuh tersisa atau lima tersisa.\""
            },
            {
                "number": 1145,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيِّ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْتَكِفُ الْعَشْرَ الْأَوْسَطَ مِنْ رَمَضَانَ فَاعْتَكَفَ عَامًا حَتَّى إِذَا كَانَتْ لَيْلَةُ إِحْدَى وَعِشْرِينَ وَهِيَ اللَّيْلَةُ الَّتِي يَخْرُجُ فِيهَا مِنْ اعْتِكَافِهِ قَالَ مَنْ كَانَ اعْتَكَفَ مَعِي فَلْيَعْتَكِفْ الْعَشْرَ الْأَوَاخِرَ وَقَدْ رَأَيْتُ هَذِهِ اللَّيْلَةَ ثُمَّ أُنْسِيتُهَا وَقْدَ رَأَيْتُنِي أَسْجُدُ مِنْ صَبِيحَتِهَا فِي مَاءٍ وَطِينٍ فَالْتَمِسُوهَا فِي كُلِّ وِتْرٍ قَالَ أَبُو سَعِيدٍ فَمَطَرَتْ السَّمَاءُ مِنْ تِلْكَ اللَّيْلَةِ وَكَانَ الْمَسْجِدُ عَلَى عَرِيشٍ فَوَكَفَ الْمَسْجِدُ فَقَالَ أَبُو سَعِيدٍ فَأَبْصَرَتْ عَيْنَايَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى جَبْهَتِهِ وَأَنْفِهِ أَثَرُ الْمَاءِ وَالطِّينِ مِنْ صَبِيحَةِ إِحْدَى وَعِشْرِينَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Yazid bin Abdullah bin Al Had] dari [Muhammad bin Ibrahim bin Al Harits At Taimi] dari [Abu Salamah bin Abdurrahman] dari [Abu Sa'id Al Khudri] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memulai beri'tikaf pada sepuluh kedua pada bulan Ramadan. Beliau beri'tikaf pada tahun itu, hingga ketika tiba malam kedua puluh satu, yaitu hari ketika beliau keluar dari I'tikafnya, beliau bersabda: 'Barangsiapa ingin melaksanakan I'tikaf bersamaku, hendaklah dia mengerjakannya pada sepuluh hari yang terakhir ini. Aku telah melihat dalam mimpiku, namun aku lupa. Aku mimpi pada waktu paginya aku bersujud pada air dan tanah. Carilah lailatul qadar pada malam yang ganjil. ' Abu Sa'id berkata; \"Pada malam itu terjadi hujan, dan saat itu masjidnya laksana bangsal untuk berteduh dan bocor, \" Abu Sa'id menambahkan; \"Dengan kedua mataku, aku melihat Rasulullah shallallahu 'alaihi wasallam pergi, sementara pada dahi dan hidungnya ada bekas tanah dan air. Itu terjadi pada pagi hari malam ke dua puluh satu.\""
            },
            {
                "number": 1146,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْأَعْلَى أَخْبَرَنَا سَعِيدٌ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ مِنْ رَمَضَانَ وَالْتَمِسُوهَا فِي التَّاسِعَةِ وَالسَّابِعَةِ وَالْخَامِسَةِقَالَ قُلْتُ يَا أَبَا سَعِيدٍ إِنَّكُمْ أَعْلَمُ بِالْعَدَدِ مِنَّا قَالَ أَجَلْ قُلْتُ مَا التَّاسِعَةُ وَالسَّابِعَةُ وَالْخَامِسَةُ قَالَ إِذَا مَضَتْ وَاحِدَةٌ وَعِشْرُونَ فَالَّتِي تَلِيهَا التَّاسِعَةُ وَإِذَا مَضَى ثَلَاثٌ وَعِشْرُونَ فَالَّتِي تَلِيهَا السَّابِعَةُ وَإِذَا مَضَى خَمْسٌ وَعِشْرُونَ فَالَّتِي تَلِيهَا الْخَامِسَةُ قَالَ أَبُو دَاوُد لَا أَدْرِي أَخَفِيَ عَلَيَّ مِنْهُ شَيْءٌ أَمْ لَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abdul A'laa] telah mengabarkan kepada kami [Sa'id] dari [Abu Nadlrah] dari [Abu Sa'id Al Khudri] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Carilah (Laiatul Qadr) pada sepuluh malam yang terakhir bulan ramadhan, dan carilah pada malam sembilan, ketujuh dan kelima.\" Abu Nadlrah berkata; tanyaku; \"Wahai Abu Sa'id, sesungguhnya kamu lebih mengetahui bilangan tersebut daripada kami.\" Dia menjawab; \"ya, betul.\" Tanyaku selanjutnya; \"apakah maksud malam kesembilan, ketujuh dan kelima?\" dia menjawab; \"Jika malam kedua puluh satu telah berlalu, maka berikutnya tinggal sembilan, jika malam ketiga puluh satu telah berlalu, maka malam berikutnya tinggal tinggal tujuh, jika malam kedua puluh lima telah berlalu, maka malam berikutnya tinggal lima.\" Abu Daud berkata; \"Apakah dia (Perawi) menyembunyikan sesuatu dariku apakah tidak.\""
            },
            {
                "number": 1147,
                "arab": "حَدَّثَنَا حَكِيمُ بْنُ سَيْفٍ الرَّقِّيُّ أَخْبَرَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ عَمْرٍو عَنْ زَيْدٍ يَعْنِي ابْنَ أَبِي أُنَيْسَةَ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ عَنْ ابْنِ مَسْعُودٍ قَالَقَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اطْلُبُوهَا لَيْلَةَ سَبْعَ عَشْرَةَ مِنْ رَمَضَانَ وَلَيْلَةَ إِحْدَى وَعِشْرِينَ وَلَيْلَةَ ثَلَاثٍ وَعِشْرِينَ ثُمَّ سَكَتَ",
                "id": "Telah menceritakan kepada kami [Hakim bin Saif Ar Raqi] telah mengabarkan kepada kami ['ubaidhullah yaitu Ibnu 'Amru] dari [Zaid yaitu Ibnu Abu Unaisah] dari [Abu Ishaq] dari [Abdurrahman bin Al Aswad] dari [ayahnya] dari [Ibnu Mas'ud] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepada kami; \"Carilah (lailatul Qadar) pada malam ke tujuh belas bulan Ramadhan dan malam kedua puluh satu dan malam kedua puluh tiga.\" Kemudian beliau diam.\""
            },
            {
                "number": 1148,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَحَرَّوْا لَيْلَةَ الْقَدْرِ فِي السَّبْعِ الْأَوَاخِرِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abdullah bin Dinar] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Carilah malam lailatul qadr di tujuh malam terakhir (bulan Ramadhan).\""
            },
            {
                "number": 1149,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي أَخْبَرَنَا شُعْبَةُ عَنْ قَتَادَةَ أَنَّهُ سَمِعَ مُطَرِّفًا عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي لَيْلَةِ الْقَدْرِ قَالَ لَيْلَةُ الْقَدْرِ لَيْلَةُ سَبْعٍ وَعِشْرِينَ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah mengabarkan kepada kami [Syu'bah] dari [Qatadah] bahwa dia mendengar [Muttharif] dari [Mu'awiyah bin Abu Sufyan] dari Nabi shallallahu 'alaihi wasallam mengenai lailatul qadr, beliau bersabda: \"Lailatul qadr adalah malam ke dua puluh tujuh.\""
            },
            {
                "number": 1150,
                "arab": "حَدَّثَنَا حُمَيْدُ بْنُ زَنْجُوَيْهِ النَّسَائِيُّ أَخْبَرَنَا سَعِيدُ بْنُ أَبِي مَرْيَمَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرِ بْنِ أَبِي كَثِيرٍ أَخْبَرَنَا مُوسَى بْنُ عُقْبَةَ عَنْ أَبِي إِسْحَقَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَسْمَعُ عَنْ لَيْلَةِ الْقَدْرِ فَقَالَ هِيَ فِي كُلِّ رَمَضَانَقَالَ أَبُو دَاوُد رَوَاهُ سُفْيَانُ وَشُعْبَةُ عَنْ أَبِي إِسْحَقَ مَوْقُوفًا عَلَى ابْنِ عُمَرَ لَمْ يَرْفَعَاهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Humaid bin Zanjuwaih An Nasa`i] telah mengabarkan kepada kami [Sa'id bin Abu Maryam] telah menceritakan kepada kami [Muhammad bin Ja'far bin Abu Katsir] telah mengabarkan kepada kami [Musa bin 'Uqbah] dari [Abu Ishaq] dari [Sa'id bin Jubair] dari [Abdullah bin Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah di tanya, dan aku mendengar mengenai lailatul qadr, beliau bersabda: \"lailatul qadr terjadi setiap bulan Ramadhan.\" Abu Daud berkata; di riwayatkan pula oleh [Sufyan] dan [Syu'bah] dari [Abu Ishaq] secara mauquf sampai [Ibnu Umar], dan dia tidak merafa'kan sampai kepada Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 1151,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ وَمُوسَى بْنُ إِسْمَعِيلَ قَالَا أَخْبَرَنَا أَبَانُ عَنْ يَحْيَى عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ اقْرَأْ الْقُرْآنَ فِي شَهْرٍ قَالَ إِنِّي أَجِدُ قُوَّةً قَالَ اقْرَأْ فِي عِشْرِينَ قَالَ إِنِّي أَجِدُ قُوَّةً قَالَ اقْرَأْ فِي خَمْسَ عَشْرَةَ قَالَ إِنِّي أَجِدُ قُوَّةً قَالَ اقْرَأْ فِي عَشْرٍ قَالَ إِنِّي أَجِدُ قُوَّةً قَالَ اقْرَأْ فِي سَبْعٍ وَلَا تَزِيدَنَّ عَلَى ذَلِكَقَالَ أَبُو دَاوُد وَحَدِيثُ مُسْلِمٍ أَتَمُّ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] dan [Musa bin Isma'il] keduanya berkata; telah mengabarkan kepada kami [Aban] dari [Yahya] dari [Muhammad bin Ibrahim] dari [Abu Salamah] dari [Abdullah bin 'Amru] bahwa Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Bacalah al-qur'an (hingga khatam) dalam sebulan.\" Abdullah berkata; \"Aku bisa (mengkhatamkan) lebih dari itu (sebulan).\" Beliau bersabda: \"Kalau begitu (khatamkan) selama dua puluh hari.\" Abdullah berkata; \"Aku bisa (mengkhatamkan) lebih dari itu.\" Beliau bersabda: \"Kalau begitu, (khatamkan) selama lima belas hari.\" Abdullah berkata; \"Aku bisa (mengkhatamkan) lebih dari itu.\" Beliau bersabda: \"Kalau begitu, (khatamkan) selama sepuluh hari.\" Abdullah berkata; \"Aku bisa (mengkhatamkan) lebih dari itu.\" Beliau bersabda \"Kalau begitu, (khatamkan) selama tujuh hari, jangan kamu kurangi dari itu.\" Abu Daud berkata; \"Hadits muslim lebih lengkap (dari haditsnya Musa).\""
            },
            {
                "number": 1152,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ أَخْبَرَنَا حَمَّادٌ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صُمْ مِنْ كُلِّ شَهْرٍ ثَلَاثَةَ أَيَّامٍ وَاقْرَأْ الْقُرْآنَ فِي شَهْرٍ فَنَاقَصَنِي وَنَاقَصْتُهُ فَقَالَ صُمْ يَوْمًا وَأَفْطِرْ يَوْمًاقَالَ عَطَاءٌ وَاخْتَلَفْنَا عَنْ أَبِي فَقَالَ بَعْضُنَا سَبْعَةَ أَيَّامٍ وَقَالَ بَعْضُنَا خَمْسًا",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah mengabarkan kepada kami [Hammad] dari ['Atha` bin As Sa`ib] dari [ayahnya] dari [Abdullah bin 'Amru] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Puasalah tiga hari dalam setiap bulan, dan bacalah al-qur'an (khatamkan) dalam sebulan.\" Beliau mengajukan pengurangan terhadapku, dan aku pun demikian, lalu beliau bersabda: 'Berpuasalah sehari dan berbukalah sehari. ' 'Atha` berkata; \"kami berbeda (periwayatan) dari ayahku, sebagian dari kami mengatakan; \"Tujuh hari.\" Sebagian lagi mengatakan; \"Lima hari.\""
            },
            {
                "number": 1153,
                "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الصَّمَدِ أَخْبَرَنَا هَمَّامٌ أَخْبَرَنَا قَتَادَةُ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّهُ قَالَيَا رَسُولَ اللَّهِ فِي كَمْ أَقْرَأُ الْقُرْآنَ قَالَ فِي شَهْرٍ قَالَ إِنِّي أَقْوَى مِنْ ذَلِكَ يُرَدِّدُ الْكَلَامَ أَبُو مُوسَى وَتَنَاقَصَهُ حَتَّى قَالَ اقْرَأْهُ فِي سَبْعٍ قَالَ إِنِّي أَقْوَى مِنْ ذَلِكَ قَالَ لَا يَفْقَهُ مَنْ قَرَأَهُ فِي أَقَلَّ مِنْ ثَلَاثٍ",
                "id": "Telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Abdusshamad] telah mengabarkan kepada kami [Hammam] telah mengabarkan kepada kami [Qatadah] dari [Yazid bin Abdullah bin 'Amru] dari [Abdullah bin 'Amru] bahwa dia berkata; \"Wahai Rasulullah, berapa lamakah aku harus mengkhatamkan al-qur'an?\" beliau bersabda: \"Dalam sebulan.\" Abdullah bin 'Amru berkata; \"Sesungguhnya aku bisa lebih dari itu.\" -Abu Musa (Ibnu Mutsanna) mengulang-ulang perkataan ini- dan Abdullah selalu meminta dipensasi hingga beliau bersabda: \"Jika demikian, bacalah al-qur'an (hingga khatam) dalam tujuh hari.\" Abdullah berkata; \"Aku masih dapat menyelesaikannya lebih dari itu.\" Beliau bersabda: \"Tidak akan dapat memahaminya orang yang mengkhatamkan al-qur'an kurang dari tiga hari.\""
            },
            {
                "number": 1154,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَفْصٍ أَبُو عَبْدِ الرَّحْمَنِ الْقَطَّانُ خَالُ عِيسَى بْنِ شَاذَانَ أَخْبَرَنَا أَبُو دَاوُدَ أَخْبَرَنَا الْحَرِيشُ بْنُ سُلَيْمٍ عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ عَنْ خَيْثَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَأْ الْقُرْآنَ فِي شَهْرٍ قَالَ إِنَّ بِي قُوَّةً قَالَ اقْرَأْهُ فِي ثَلَاثٍقَالَ أَبُو عَلِيٍّ سَمِعْت أَبَا دَاوُد يَقُولُ سَمِعْتُ أَحْمَدَ يَعْنِي ابْنَ حَنْبَلٍ يَقُولُ عِيسَى بْنُ شَاذَانَ كَيِّسٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Hafsh Abu Abdurrahman Al Qatthan] pamannya Isa bin Syadzan, telah mengabarkan kepada kami [Abu Daud] telah mengabarkan kepada kami [Al Harisy bin Sulaim] dari [Thalhah bin Musharif] dari [Khaitsamah] dari [Abdullah bin 'Amru] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Khatamkanlah al-qur'an dalam sebulan.\" Abdullah berkata; \"Aku bisa (menghatamkannya) lebih dari itu.\" Beliau bersabda: \"Khatamkan selama tiga hari.\" Abu Ali mengatakan; \"Aku mendengar Abu Daud berkata; saya mendengar Ahmad yaitu Ibnu Hanbal berkata; Isa bin Syadzan adalah orang yang bijaksana.\""
            },
            {
                "number": 1155,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ أَخْبَرَنَا ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ عَنْ ابْنِ الْهَادِ قَالَ سَأَلَنِي نَافِعُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍفَقَالَ لِي فِي كَمْ تَقْرَأُ الْقُرْآنَ فَقُلْتُ مَا أُحَزِّبُهُ فَقَالَ لِي نَافِعٌ لَا تَقُلْ مَا أُحَزِّبُهُ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَرَأْتُ جُزْءًا مِنْ الْقُرْآنِقَالَ حَسِبْتُ أَنَّهُ ذَكَرَهُ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] telah mengabarkan kepada kami [Ibnu Abu Maryam] telah mengabarkan kepada kami [Yahya bin Ayyub] dari [Ibnu Al Haad] dia berkata; [Nafi' bin Jubair bin Muth'im] pernah bertanya kepadaku, tanyanya; \"Berapa lamakah kamu biasa menghatamkan al-qur'an?\" maka aku menjawab; \"Aku tidak biasa menghimpunnya sebagai suatu wirid.\" Lalu Nafi' berkata kepadaku; \"Janganlah kamu berkata \"Aku tidak biasa menghimpunnya sebagai suatu wirid\" karena Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku telah membaca sebagian dari al-qur'an.\" Kata Ibnu Al Haad; \"Saya kira, dia menyebutkan hadits ini dari [Al Mughirah bin Syu'bah].\""
            },
            {
                "number": 1156,
                "arab": "حَدَّثَنَا مُسَدَّدٌ أَخْبَرَنَا قُرَّانُ بْنُ تَمَّامٍ ح و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ أَخْبَرَنَا أَبُو خَالِدٍ وَهَذَا لَفْظُهُ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَعْلَى عَنْ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ أَوْسٍ عَنْ جَدِّهِ قَالَ عَبْدُ اللَّهِ بْنُ سَعِيدٍ فِي حَدِيثِهِ أَوْسُ بْنُ حُذَيْفَةَ قَالَقَدِمْنَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي وَفْدِ ثَقِيفٍ قَالَ فَنَزَلَتْ الْأَحْلَافُ عَلَى الْمُغِيرَةِ بْنِ شُعْبَةَ وَأَنْزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَنِي مَالِكٍ فِي قُبَّةٍ لَهُ قَالَ مُسَدَّدٌ وَكَانَ فِي الْوَفْدِ الَّذِينَ قَدِمُوا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ ثَقِيفٍ قَالَ كَانَ كُلَّ لَيْلَةٍ يَأْتِينَا بَعْدَ الْعِشَاءِ يُحَدِّثُنَا و قَالَ أَبُو سَعِيدٍ قَائِمًا عَلَى رِجْلَيْهِ حَتَّى يُرَاوِحُ بَيْنَ رِجْلَيْهِ مِنْ طُولِ الْقِيَامِ وَأَكْثَرُ مَا يُحَدِّثُنَا مَا لَقِيَ مِنْ قَوْمِهِ مِنْ قُرَيْشٍ ثُمَّ يَقُولُ لَا سَوَاءَ كُنَّا مُسْتَضْعَفِينَ مُسْتَذَلِّينَ قَالَ مُسَدَّدٌ بِمَكَّةَ فَلَمَّا خَرَجْنَا إِلَى الْمَدِينَةِ كَانَتْ سِجَالُ الْحَرْبِ بَيْنَنَا وَبَيْنَهُمْ نُدَالُ عَلَيْهِمْ وَيُدَالُونَ عَلَيْنَا فَلَمَّا كَانَتْ لَيْلَةً أَبْطَأَ عَنْ الْوَقْتِ الَّذِي كَانَ يَأْتِينَا فِيهِ فَقُلْنَا لَقَدْ أَبْطَأْتَ عَنَّا اللَّيْلَةَ قَالَ إِنَّهُ طَرَأَ عَلَيَّ جُزْئِي مِنْ الْقُرْآنِ فَكَرِهْتُ أَنْ أَجِيءَ حَتَّى أُتِمَّهُقَالَ أَوْسٌ سَأَلْتُ أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ يُحَزِّبُونَ الْقُرْآنَ قَالُوا ثَلَاثٌ وَخَمْسٌ وَسَبْعٌ وَتِسْعٌ وَإِحْدَى عَشْرَةَ وَثَلَاثَ عَشْرَةَ وَحِزْبُ الْمُفَصَّلِ وَحْدَهُ قَالَ أَبُو دَاوُد وَحَدِيثُ أَبِي سَعِيدٍ أَتَمُّ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah mengabarkan kepada kami [Qurran bin Tammam]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Abdullah bin Sa'id] telah mengabarkan kepada kami [Abu Khalid], dan ini adalah redaksi dari dia, dari [Abdullah bin Abdurrahman bin Ya'laa] dari [Utsman bin Abdullah bin Aus] dari [kakeknya]. Abdullah bin Sa'id berkata dalam haditsnya Aus bin Hudzaifah, dia berkata; \"Kami mendatangi Rasulullah shallallahu 'alaihi wasallam dalam rombongan delegasi Bani Tsaqif, sekutu-sekutu (aliansi-aliansi) Tsaqif singgah menemui Al-Mughirah bin Syu'bah, sementara Rasulullah shallallahu 'alaihi wasallam memberi persinggahan kepada Bani Malik di tenda besar miliknya. Musaddad berkata dengan redaksi; \"Sedangkan seseorang dari utusan dari Tsaqif yang datang kepada Rasulullah shallallahu 'alaihi wasallam, berkata; \"Setiap habis Isya', beliau selalu menemui kami kami untuk bercakap-cakap.\" Abu Sa'id mengatakan; \"Sambil berdiri di atas salah satu kakinya secara berganti-gantian di antara kedua kakinya, karena lamanya berdiri. Dan yang paling banyak yang diceritakan adalah apa yang beliau alami dari kaumnya, Quraisy. Beliau bersabda: \"Tidaklah sama kami orang-orang yang lemah dan terhina - [Musaddad] berkata- selama kami di Makkah. Ketika kami keluar menuju Madinah, peperangan silih berganti di antara kami dan mereka. Terkadang kami mengalahkan mereka dan terkadang mereka mengalahkan kami.\" Di suatu malam, Beliau terlambat dari kebiasaan waktu kedatangannya kepada kami. Maka aku berkata, \"Anda terlambat datang kepada kami pada malam ini\". Beliau bersabda: \"Sesungguhnya telah datang kepadaku bagian yang aku harus baca dari al-qur'an, maka aku tidak senang untuk keluar hingga selesai menyempurnakannya.\" Aus berkata, \"Aku bertanya kepada para sahabat Rasulullah shallallahu 'alaihi wasallam, bagaimanakah kalian membagi-bagi (memilah atau mengelompokkan) dan menertibkan al-qur'an? Mereka menjawab: \"Tiga, lima, tujuh, sembilan, sebelas, tigabelas dan bagian surat-surat yang mufashshal (dari surat Qaaf atau al Hujurat sampai an nas).\" Abu Daud berkata; \"Haditsnya Abu Sa'id lebih lengkap.\""
            },
            {
                "number": 1157,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمِنْهَالِ الضَّرِيرُ أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ أَخْبَرَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَبِي الْعَلَاءِ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ عَبْدِ اللَّهِ يَعْنِي ابْنَ عَمْرٍو قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَفْقَهُ مَنْ قَرَأَ الْقُرْآنَ فِي أَقَلَّ مِنْ ثَلَاثٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Minhal Adl Dlarir] telah mengabarkan kepada kami [Yazid bin Zurai'] telah mengabarkan kepada kami [Sa'id] dari [Qatadah] dari [Abu Al 'Ala` Yazid bin Abdullah bin Asy Syihir] dari [Abdullah yaitu Ibnu 'Amru] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak akan dapat memahami orang yang membaca al-qur'an kurang dari tiga hari.\""
            },
            {
                "number": 1158,
                "arab": "حَدَّثَنَا نُوحُ بْنُ حَبِيبٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ سِمَاكِ بْنِ الْفَضْلِ عَنْ وَهْبِ بْنِ مُنَبِّهٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي كَمْ يُقْرَأُ الْقُرْآنُ قَالَ فِي أَرْبَعِينَ يَوْمًا ثُمَّ قَالَ فِي شَهْرٍ ثُمَّ قَالَ فِي عِشْرِينَ ثُمَّ قَالَ فِي خَمْسَ عَشْرَةَ ثُمَّ قَالَ فِي عَشْرٍ ثُمَّ قَالَ فِي سَبْعٍ لَمْ يَنْزِلْ مِنْ سَبْعٍ",
                "id": "Telah menceritakan kepada kami [Nuh bin Habib] telah mengabarkan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Simak bin Al Fadl] dari [Wahb bin Munabbih] dari [Abdullah bin 'Amru] bahwa dia bertanya kepada Nabi shallallahu 'alaihi wasallam; \"Berapa lamakah al-qur'an di baca (hingga khatam)?\" beliau bersabda: \"Dalam jangka waktu empat puluh hari.\" Kemudian beliau bersabda: \"Dalam jangka waktu sebulan.\" Kemudian beliau bersabda: \"Dalam jangka waktu dua puluh hari.\" Kemudian beliau bersabda: \"Dalam jangka waktu lima belas hari.\" Kemudian beliau bersabda: \"Dalam jangka waktu sepuluh hari.\" Kemudian beliau bersabda: \"Dalam jangka waktu tujuh hari, dan tidak kurang dari tujuh hari.\""
            },
            {
                "number": 1159,
                "arab": "حَدَّثَنَا عَبَّادُ بْنُ مُوسَى أَخْبَرَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ عَلْقَمَةَ وَالْأَسْوَدِ قَالَاأَتَى ابْنَ مَسْعُودٍ رَجُلٌ فَقَالَ إِنِّي أَقْرَأُ الْمُفَصَّلَ فِي رَكْعَةٍ فَقَالَ أَهَذًّا كَهَذِّ الشِّعْرِ وَنَثْرًا كَنَثْرِ الدَّقَلِ لَكِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ النَّظَائِرَ السُّورَتَيْنِ فِي رَكْعَةٍ النَّجْمَ وَالرَّحْمَنَ فِي رَكْعَةٍ وَاقْتَرَبَتْ وَالْحَاقَّةَ فِي رَكْعَةٍ وَالطُّورَ وَالذَّارِيَاتِ فِي رَكْعَةٍ وَإِذَا وَقَعَتْ وَنُونَ فِي رَكْعَةٍ وَسَأَلَ سَائِلٌ وَالنَّازِعَاتِ فِي رَكْعَةٍ وَوَيْلٌ لِلْمُطَفِّفِينَ وَعَبَسَ فِي رَكْعَةٍ وَالْمُدَّثِّرَ وَالْمُزَّمِّلَ فِي رَكْعَةٍ وَهَلْ أَتَى وَلَا أُقْسِمُ بِيَوْمِ الْقِيَامَةِ فِي رَكْعَةٍ وَعَمَّ يَتَسَاءَلُونَ وَالْمُرْسَلَاتِ فِي رَكْعَةٍ وَالدُّخَانَ وَإِذَا الشَّمْسُ كُوِّرَتْ فِي رَكْعَةٍقَالَ أَبُو دَاوُد هَذَا تَأْلِيفُ ابْنِ مَسْعُودٍ رَحِمَهُ اللَّهُ",
                "id": "Telah menceritakan kepada kami ['Abbad bin Musa] telah mengabarkan kepada kami [Isma'il bin Ja'far] dari [Isra`il] dari [Abu Ishaq] dari ['Alqomah] dan [Al Aswad] keduanya berkata; seorang laki-laki datang kepada [Ibnu Mas'ud] seraya berkata; \"Aku biasa membaca Al Mufashal (dari surat Qaaf atau Al Hujurat sampai an Naas) dalam satu raka'at.\" Maka Ibnu Mas'ud berkata; \"Apakah membaca al-qur'an itu seperti melantunkan sya'ir atau prosa prosa tentang runtuhnya kurma dari pohonnya? Padahal Nabi shallallahu 'alaihi wasallam biasa membaca surat-surat yang sepadan, dua surat dalam satu raka'at, yaitu An Najm dan Ar Rahman dalam satu raka'at.\"Iqtarabat\" dan \"Al Haqqah\" dalam satu raka'at.\"At Thur\" dan \"Adz Dzariyat\" dalam satu raka'at.\"Idza Waqa'at\" dan \"Nuun\" dalam satu raka'at.\"sa`ala saa`ilu\" dan \"wan naazi'aati\" dalam satu raka'at.\"wailul lil muthaffifin\" dan \"abasa\" dalam satu raka'at.\"Al Mudattsir\" dan \"Al Muzammil\" dalam satu raka'at.\"Hal attaa\" dan \"Laa uqsimu bi yaumil Qiyaamah\" dalam satu raka'at.\"Amma yatasaa`alun\" dan \"Wal mursalaati\" dalam satu raka'at.\"Ad dukhaan\" dan \"Idzas syamsu kuwwirat\" dalam satu raka'at.\" Abu Daud berkata; \"Ini adalah tulisan Ibnu Mas'ud rahimahullah.\""
            },
            {
                "number": 1160,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ أَخْبَرَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَقَالَ سَأَلْتُ أَبَا مَسْعُودٍ وَهُوَ يَطُوفُ بِالْبَيْتِ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَرَأَ الْآيَتَيْنِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي لَيْلَةٍ كَفَتَاهُ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah mengabarkan kepada kami [Syu'bah] dari [Manshur] dari [Ibrahim] dari [Abdurrahman bin Yazid] dia berkata; aku pernah bertanya kepada [Abu Mas'ud] ketika dia sedang Thawaf di Ka'bah, dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membaca dua ayat dari akhir surat Al Baqarah pada malam harinya, maka dianggap cukup.\" "
            },
            {
                "number": 1161,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنَا عَمْرٌو أَنَّ أَبَا سَوِيَّةَ حَدَّثَهُ أَنَّهُ سَمِعَ ابْنَ حُجَيْرَةَ يُخْبِرُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَامَ بِعَشْرِ آيَاتٍ لَمْ يُكْتَبْ مِنْ الْغَافِلِينَ وَمَنْ قَامَ بِمِائَةِ آيَةٍ كُتِبَ مِنْ الْقَانِتِينَ وَمَنْ قَامَ بِأَلْفِ آيَةٍ كُتِبَ مِنْ الْمُقَنْطِرِينَقَالَ أَبُو دَاوُد ابْنُ حُجَيْرَةَ الْأَصْغَرُ عَبْدُ اللَّهِ ابْنُ عَبْدِ الرَّحْمَنِ ابْنِ حُجَيْرَةَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepada kami ['Amru] bahwa [Abu Sawiyah] telah mengabarkan kepadanya, bahwa dia pernah mendengar [Ibnu Hujairah] mengabarkan dari [Abdullah bin 'Amru bin Al 'Ash] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bangun (sholat malam) dan membaca sepuluh ayat, maka dia tidak akan di catat sebagai orang-orang yang lalai. Barangsiapa bangun (sholat malam) dengan membaca seratus ayat, maka dia akan di catat sebagai orang-orang yang tunduk dan patuh, dan barangsiapa bangun (sholat malam) dengan membaca seribu ayat, maka dia akan di catat sebagai orang-orang yang dermawan.\" Abu Daud berkata; Ibnu Hujairah Al Ashgar adalah Abdullah bin Abdurrahman ibnu Hujairah.\""
            },
            {
                "number": 1162,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ وَهَارُونُ بْنُ عَبْدِ اللَّهِ قَالَا أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ أَخْبَرَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ حَدَّثَنِي عَيَّاشُ بْنُ عَبَّاسٍ الْقِتْبَانِيُّ عَنْ عِيسَى بْنِ هِلَالٍ الصَّدَفِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَأَتَى رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَقْرِئْنِي يَا رَسُولَ اللَّهِ فَقَالَ اقْرَأْ ثَلَاثًا مِنْ ذَوَاتِ الر فَقَالَ كَبُرَتْ سِنِّي وَاشْتَدَّ قَلْبِي وَغَلُظَ لِسَانِي قَالَ فَاقْرَأْ ثَلَاثًا مِنْ ذَوَاتِ حاميم فَقَالَ مِثْلَ مَقَالَتِهِ فَقَالَ اقْرَأْ ثَلَاثًا مِنْ الْمُسَبِّحَاتِ فَقَالَ مِثْلَ مَقَالَتِهِ فَقَالَ الرَّجُلُ يَا رَسُولَ اللَّهِ أَقْرِئْنِي سُورَةً جَامِعَةً فَأَقْرَأَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا زُلْزِلَتْ الْأَرْضُ حَتَّى فَرَغَ مِنْهَا فَقَالَ الرَّجُلُ وَالَّذِي بَعَثَكَ بِالْحَقِّ لَا أَزِيدُ عَلَيْهَا أَبَدًا ثُمَّ أَدْبَرَ الرَّجُلُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْلَحَ الرُّوَيْجِلُ مَرَّتَيْنِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Musa Al Balhi] dan [Harun bin Abdullah] keduanya berkata; telah mengabarkan kepada kami [Abdullah bin Yazid] telah mengabarkan kepada kami [Sa'id bin Abu Ayyub] telah menceritakan kepadaku ['Ayyasy bin Abbas Al Qitbani] dari [Isa bin Hilal Ash Shadafi] dari [Abdullah bin 'Amru] dia berkata; seorang laki-laki datang kepada Rasulullah shallallahu 'alaihi wasallam sambil berkata; \"Wahai Rasulullah, koreksilah bacaanku!\" Maka beliau pun berkata kepadanya: \"Bacalah tiga surat yang di dahului Alif Laam Ra'.\" Lelaki itu berkata; \"Umurku sudah tua, dan hatiku sudah mengeras, serta lidahku juga sudah kelu.\" Beliau berkata: \"Kalau begitu bacalah surat yang di dahului Haa' Mim.\" Maka lelaki itupun mengatakan seperti perkataannya yang tadi. Beliau berkata: \"Bacalah tiga surat yang diawali dengan sabbaha.\" Dan lelaki itupun mengatakan seperti perkataannya yang pertama, lalu dia mengatakan, \"Wahai Rasulullah, yang aku mau anda membacakan kepadaku satu surat yang mencakup keseluruhan.\" Maka beliau menyuruhnya membaca surat Idzaa zulzilatil ardlu, hingga selesai. Laki-laki itu berkata; \"Demi Dzat Yang telah mengutusmu dengan kebenaran, aku tidak akan menambahinya untuk selamanya.\" Lalu orang itupun berpaling dan pergi meninggalkan beliau, lalu Rasulullah pun bersabda: \"Sungguh beruntung orang itu, sungguh beruntung orang itu\" Beliau mengucapkannya hingga dua kali. "
            },
            {
                "number": 1163,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ أَخْبَرَنَا شُعْبَةُ أَخْبَرَنَا قَتَادَةُ عَنْ عَبَّاسٍ الْجُشَمِيِّ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سُورَةٌ مِنْ الْقُرْآنِ ثَلَاثُونَ آيَةً تَشْفَعُ لِصَاحِبِهَا حَتَّى يُغْفَرَ لَهُ تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ",
                "id": "Telah menceritakan kepada kami ['Amru bin Marzuq] telah mengabarkan kepada kami [Syu'bah] telah mengabarkan kepada kami [Qatadah] dari ['Abbas Al Jusyami] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam bersabda: 'Ada suatu surat dari al-qur'an yang terdiri dari tiga puluh ayat dan dapat memberi syafa'at bagi yang membacanya, sampai dia di ampuni, yaitu; \"Tabaarakalladzii biyadihil mulku…\""
            },
            {
                "number": 1164,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ بْنِ الْبَرْقِيِّ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ أَخْبَرَنَا نَافِعُ بْنُ يَزِيدَ عَنْ الْحَارِثِ بْنِ سَعِيدٍ الْعُتَقِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مُنَيْنٍ مِنْ بَنِي عَبْدِ كُلَالٍ عَنْ عَمْرِو بْنِ الْعَاصِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْرَأَهُ خَمْسَ عَشْرَةَ سَجْدَةً فِي الْقُرْآنِ مِنْهَا ثَلَاثٌ فِي الْمُفَصَّلِ وَفِي سُورَةِ الْحَجِّ سَجْدَتَانِقَالَ أَبُو دَاوُد رُوِيَ عَنْ أَبِي الدَّرْدَاءِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِحْدَى عَشْرَةَ سَجْدَةً وَإِسْنَادُهُ وَاهٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdurrahim bin Al Buraqi] telah menceritakan kepada kami [Ibnu Abu Maryam] telah mengabarkan kepada kami [Nafi' bin Yazid] dari [Al Harits bin Sa'id Al 'Utaqi] dari [Abdullah bin Munain] dari Bani Abdul Kulal, dari ['Amru bin Al 'Ash] bahwa Rasulullah shallallahu 'alaihi wasallam pernah membacakan untuknya lima belas ayat sajadah dalam al-qur'an, di antaranya tiga ayat terdapat dalam surat Al Mufashal (dari surat Qaaf atau Al Hujurat sampai an naas), dan dalam surat Al Hajj dua ayat sajadah.\" Abu Daud berkata; \"di riwayatkan dari Abu Darda` dari Nabi shallallahu 'alaihi wasallam terdapat sebelas ayat sajadah, sedangkan sanadnya lemah.\""
            },
            {
                "number": 1165,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي ابْنُ لَهِيعَةَ أَنَّ مِشْرَحَ بْنَ هَاعَانَ أَبَا الْمُصْعَبِ حَدَّثَهُ أَنَّ عُقْبَةَ بْنَ عَامِرٍ حَدَّثَهُ قَالَقُلْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفِي سُورَةِ الْحَجِّ سَجْدَتَانِ قَالَ نَعَمْ وَمَنْ لَمْ يَسْجُدْهُمَا فَلَا يَقْرَأْهُمَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Amru bin As Sarh] telah mengabarkan kepada kami [Ibnu Wahb] telah menceritakan kepadaku [Ibnu Lahi'ah] bahwa [Misrah bin Ha'an Abu Al Mush'ab] telah bercerita kepadanya bahwa ['Ubah bin 'Amir] telah menceritakan kepadanya, dia berkata; aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam; \"Apakah dalam surat Al Haj terdapat dua ayat sajadah?\" beliau menjawab: \"ya, benar. Barangsiapa tidak sujud ketika membacanya, maka janganlah ia membaca kedua ayat sajadah tersebut.\""
            },
            {
                "number": 1166,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَزْهَرُ بْنُ الْقَاسِمِ قَالَ مُحَمَّدٌ رَأَيْتُهُ بِمَكَّةَ حَدَّثَنَا أَبُو قُدَامَةَ عَنْ مَطَرٍ الْوَرَّاقِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَسْجُدْ فِي شَيْءٍ مِنْ الْمُفَصَّلِ مُنْذُ تَحَوَّلَ إِلَى الْمَدِينَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Azhar bin Al Qasim] -Muhammad mengatakan; \"aku mengetahuinya ketika dia berada di Makkah- telah menceritakan kepada kami [Abu Qudamah] dari [Mathar Al Waraq] dari [Ikrimah] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam tidak pernah sujud sama sekali ketika membaca surat Al Mufashal (dari surat Qaaf atau Al Hujurat sampai An Naas) hingga beliau pindah ke Madinah.\""
            },
            {
                "number": 1167,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا وَكِيعٌ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَقَرَأْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّجْمَ فَلَمْ يَسْجُدْ فِيهَاحَدَّثَنَا ابْنُ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنَا أَبُو صَخْرٍ عَنْ ابْنِ قُسَيْطٍ عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ قَالَ أَبُو دَاوُد كَانَ زَيْدٌ الْإِمَامَ فَلَمْ يَسْجُدْ فِيهَا",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sarri] telah menceritakan kepada kami [Waki'] dari [Abu Ad Dzi`b] dari [Yazid bin Abdullah bin Qusaith] dari ['Atha` bin Yasar] dari [Zaid bin Tsabit] dia berkata; \"Aku pernah membaca surat An Najm di hadapan Rasulullah shallallahu 'alaihi wasallam, namun beliau tidak sujud.\" Telah menceritakan kepada kami [Ibnu As Sarh] telah mengabarkan kepada kami [Ibnu Wahb] telah menceritakan kepada kami [Abu Shakhr] dari [Ibnu Qusaith] dari [Kharijah bin Zaid bin Tsabit] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam semakna dengan hadits di atas. Abu Daud berkata; \"Zaid adalah seorang Imam, namun dia tidak sujud ketika membaca surat tersebut.\""
            },
            {
                "number": 1168,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ الْأَسْوَدِ عَنْ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ سُورَةَ النَّجْمِ فَسَجَدَ فِيهَا وَمَا بَقِيَ أَحَدٌ مِنْ الْقَوْمِ إِلَّا سَجَدَ فَأَخَذَ رَجُلٌ مِنْ الْقَوْمِ كَفًّا مِنْ حَصًى أَوْ تُرَابٍ فَرَفَعَهُ إِلَى وَجْهِهِ وَقَالَ يَكْفِينِي هَذَاقَالَ عَبْدُ اللَّهِ فَلَقَدْ رَأَيْتُهُ بَعْدَ ذَلِكَ قُتِلَ كَافِرًا",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Al Aswad] dari [Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah membaca surat An Najm, lalu beliau sujud, dan tidak seorang pun dari kaum tersebut yang tidak turut sujud. Setelah itu seorang laki-laki dari kaum tersebut mengambil segenggam kerikil atau tanah, lalu di angkat ke wajahnya sambil berkata; \"Sujud bagiku cukuplah sekali ini saja.\" Abdullah berkata; \"Sungguh, setelah peristiwa tersebut, aku melihat laki-laki tersebut mati terbunuh dalam keadaan kafir.\" "
            },
            {
                "number": 1169,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ عَطَاءِ بْنِ مِينَاءَ عَنْ أَبِي هُرَيْرَةَ قَالَسَجَدْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِذَا السَّمَاءُ انْشَقَّتْ وَاقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَقَالَ أَبُو دَاوُد أَسْلَمَ أَبُو هُرَيْرَةَ سَنَةَ سِتٍّ عَامَ خَيْبَرَ وَهَذَا السُّجُودُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آخِرُ فِعْلِهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Sufyan] dari [Ayyub bin Musa] dari ['Atha` bin Mina`] dari [Abu Hurairah] dia berkata; \"Kami pernah bersujud (tilawah) bersama Rasulullah shallallahu 'alaihi wasallam pada surat \"idzaas samaa'un syaqqat\" dan \"iqra` bismirabbikal ladzii khalaq\" Abu Daud berkata; \"Abu Hurairah masuk Islam pada tahun ke enam (hijriyah) yaitu ketika hari penaklukan Khaibar, sedangkan sujud ini adalah yang terakhir kali di kerjakan oleh Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 1170,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا الْمُعْتَمِرُ قَالَ سَمِعْتُ أَبِي حَدَّثَنَا بَكْرٌ عَنْ أَبِي رَافِعٍ قَالَصَلَّيْتُ مَعَ أَبِي هُرَيْرَةَ الْعَتَمَةَ فَقَرَأَ إِذَا السَّمَاءُ انْشَقَّتْ فَسَجَدَ فَقُلْتُ مَا هَذِهِ السَّجْدَةُ قَالَ سَجَدْتُ بِهَا خَلْفَ أَبِي الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَا أَزَالُ أَسْجُدُ بِهَا حَتَّى أَلْقَاهُ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Al Mu'tamir] dia berkata; saya mendengar [ayahku], telah menceritakan kepada kami [Bakr] dari [Abu Rafi'] dia berkata; \"Aku pernah sholat Isya' bersama [Abu Hurairah], lalu dia membaca; \"Idzas samaa'un syaqqat\" kemudian dia sujud.\" Aku pun bertanya; \"Sujud apakah ini?\" dia menjawab; \"Aku juga pernah sujud seperti ini di belakang Abu Qasim shallallahu 'alaihi wasallam, dan aku akan senantiasa sujud pada bacaan ini sehingga aku bertemu dengan-Nya (meninggal dunia).\""
            },
            {
                "number": 1171,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَلَيْسَ ص مِنْ عَزَائِمِ السُّجُودِ وَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْجُدُ فِيهَا",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ayyub] dari [Ikrimah] dari [Ibnu Abbas] dia berkata; Surat Shaad sebenarnya bukan termasuk surat yang di haruskan untuk sujud, akan tetapi aku pernah melihat Rasulullah shallallahu 'alaihi wasallam sujud pada surat tersebut.\""
            },
            {
                "number": 1172,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو يَعْنِي ابْنَ الْحَارِثِ عَنْ ابْنِ أَبِي هِلَالٍ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ سَعْدِ بْنِ أَبِي سَرْحٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّهُ قَالَقَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ ص فَلَمَّا بَلَغَ السَّجْدَةَ نَزَلَ فَسَجَدَ وَسَجَدَ النَّاسُ مَعَهُ فَلَمَّا كَانَ يَوْمٌ آخَرُ قَرَأَهَا فَلَمَّا بَلَغَ السَّجْدَةَ تَشَزَّنَ النَّاسُ لِلسُّجُودِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا هِيَ تَوْبَةُ نَبِيٍّ وَلَكِنِّي رَأَيْتُكُمْ تَشَزَّنْتُمْ لِلسُّجُودِ فَنَزَلَ فَسَجَدَ وَسَجَدُوا",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Shalih] telah menceritakan kepada Kami [Ibnu Wahb], telah mengkhabarkan kepadaku ['Amr yaitu Ibnu Al Harits] dari [Ibnu Abu Hilal] dari ['Iyadh bin Abdullah bin Sa'd bin Abu Sarh] dari [Abu Sa'id Al Khudri] bahwa ia berkata; Rasulullah shallallahu 'alaihi wasallam di atas mimbar membaca Surat Shaad. Kemudian tatkala beliau telah sampai pada ayat as sajdah beliau turun kemudian sujud, dan orang-orang pun bersujud bersamanya. Kemudian tatkala pada hari yang lainnya beliau membacanya, lalu tatkala telah sampai pada ayat as sajdah orang-orang bersiap-siap untuk bersujud. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya ayat tersebut adalah taubat seorang nabi, akan tetapiaku melihat kalian telah bersiap-siap untuk bersujud, lalu beliau bersujud dan mereka pun bersujud.\""
            },
            {
                "number": 1173,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ أَبُو الْجَمَاهِرِ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ مُصْعَبِ بْنِ ثَابِتِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ عَامَ الْفَتْحِ سَجْدَةً فَسَجَدَ النَّاسُ كُلُّهُمْ مِنْهُمْ الرَّاكِبُ وَالسَّاجِدُ فِي الْأَرْضِ حَتَّى إِنَّ الرَّاكِبَ لَيَسْجُدُ عَلَى يَدِهِ",
                "id": "Telah menceritakan kepada Kami [Muhammad bin Utsman Ad Dimasyqi Abu Al Jamahir], telah menceritakan kepada Kami [Abdul Aziz yaitu Ibnu Muhammad] dari [Mush'ab bin Tsabit bin Abdullah bin Az Zubair] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam pada saat penaklukan Mekkah membaca ayat Sajdah, kemudian seluruh manusia bersujud, diantara mereka ada yang berkendaraan dan ada yang bersujud di tanah hingga orang yang berkendaraan bersujud di atas tangannya."
            },
            {
                "number": 1174,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ حَدَّثَنَا ابْنُ نُمَيْرٍ الْمَعْنَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ عَلَيْنَا السُّورَةَ قَالَ ابْنُ نُمَيْرٍ فِي غَيْرِ الصَّلَاةِ ثُمَّ اتَّفَقَا فَيَسْجُدُ وَنَسْجُدُ مَعَهُ حَتَّى لَا يَجِدَ أَحَدُنَا مَكَانًا لِمَوْضِعِ جَبْهَتِهِ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Hanbal], telah menceritakan kepada Kami [Yahya bin Sa'id], dan diriwayatkan dari jalur yang lain: Telah menceritakan kepada Kami [Ahmad bin Abu Syu'aib Al Harrani] telah menceritakan kepada Kami [Ibnu Numair] secara makna dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam membacakan kepada Kami sebuah surat. Ibnu Numair berkata; tidak ketika melakukan sholat. Kemudian keduanya sama lafazh mereka yaitu, \"Kemudian beliau bersujud dan Kamipun bersujud bersamanya hingga salah seorangpun diantara Kami yang tidak mendapatkan tempat untuk meletakkan keningnya."
            },
            {
                "number": 1175,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ الْفُرَاتِ أَبُو مَسْعُودٍ الرَّازِيُّ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ عَلَيْنَا الْقُرْآنَ فَإِذَا مَرَّ بِالسَّجْدَةِ كَبَّرَ وَسَجَدَ وَسَجَدْنَا مَعَهُقَالَ عَبْدُ الرَّزَّاقِ وَكَانَ الثَّوْرِيُّ يُعْجِبُهُ هَذَا الْحَدِيثُ قَالَ أَبُو دَاوُد يُعْجِبُهُ لِأَنَّهُ كَبَّرَ",
                "id": "Telah menceritakan kepada Kami [Ahmad bin Al Furat Abu Mas'ud Ar Razi] telah mengabarkan kepada Kami [Abdurrazzaq], telah mengabarkan kepada Kami [Abdullah bin Umar] dari [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam membacakan al-qur'an kepada Kami, dan apabila melewati ayat sajdah beliau bertakbir dan bersujud dan Kami bersujud bersamanya. Abdurrazzaq berkata; Ats Tsauri kagum dengan hadits ini. Abu Daud berkata; ia kagum kepada hadits tersebut karena disebutkan bahwa Rasulullah shallallahu 'alaihi wasallam bertakbir."
            },
            {
                "number": 1176,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا إِسْمَعِيلُ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ رَجُلٍ عَنْ أَبِي الْعَالِيَةِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي سُجُودِ الْقُرْآنِ بِاللَّيْلِ يَقُولُ فِي السَّجْدَةِ مِرَارًا سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ بِحَوْلِهِ وَقُوَّتِهِ",
                "id": "Telah menceritakan kepada Kami [Musaddad] telah menceritakan kepada Kami [Isma'il], telah menceritakan kepada Kami [Khalid Al Hadzdza`] dari [seorang laki-laki] dari [Abu Al 'Aliyah] dari [Aisyah] radliallahu 'anha ia berkata; \" Rasulullah shallallahu 'alaihi wasallam ketika melakukan sujud al-qur'an (sajdah) pada malam hari beliau mengucapkan beberapa kali: \" SAJADA WAJHIYA LILLADZII KHALAQAHU WA SYAQQA SAM'AHU WA BASHARAHU BIHAULIHI WA QUWWATIHI\" (Wajahku bersujud kepada Dzat yang telah menciptakannya dan telah membuka pendengaran serta penglihatannya dengan daya dan kekuatanNya). "
            }
        ]
    }
}