{
    "status": true,
    "data": {
        "start": 589,
        "end": 735,
        "total": 147,
        "book": "abu-daud",
        "hadits": [
            {
                "number": 589,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ مُطَهَّرٍ وَابْنُ كَثِيرٍ الْمَعْنَى أَنَّ سُلَيْمَانَ بْنَ الْمُغِيرَةِ أَخْبَرَهُمْ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّقَالَ حَفْصٌ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْطَعُ صَلَاةَ الرَّجُلِ وَقَالَ عَنْ سُلَيْمَانَ قَالَ أَبُو ذَرٍّ يَقْطَعُ صَلَاةَ الرَّجُلِ إِذَا لَمْ يَكُنْ بَيْنَ يَدَيْهِ قَيْدُ آخِرَةِ الرَّحْلِ الْحِمَارُ وَالْكَلْبُ الْأَسْوَدُ وَالْمَرْأَةُ فَقُلْتُ مَا بَالُ الْأَسْوَدِ مِنْ الْأَحْمَرِ مِنْ الْأَصْفَرِ مِنْ الْأَبْيَضِ فَقَالَ يَا ابْنَ أَخِي سَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا سَأَلْتَنِي فَقَالَ الْكَلْبُ الْأَسْوَدُ شَيْطَانٌ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Abdussaalam bin Mutthahir] dan [Ibnu Katsir] sedangkan maksud haditsnya sama, bahwa [Sulaiman bin Mughirah] telah mengabarkan kepada mereka, dari [Humaid bin Hilal] dari [Abdullah bin bin Ash Shamit] dari [Abu Dzar] dia berkata; Hafsh berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Yang dapat memutuskan sholat seseorang apabila di hadapannya tidak terdapat tabir sepanjang ujung pelana unta yaitu, keledai, anjing hitam dan wanita.\" Kataku; Apa bedanya warna hitam dengan warna merah, kuning atau putih?\" Abu Dzar menjawab; \"Wahai anak saudaraku, aku pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam sebagaimana yang kamu tanyakan, beliau bersabda: \"Anjing hitam adalah setan.\""
            },
            {
                "number": 590,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ شُعْبَةَ حَدَّثَنَا قَتَادَةُ قَالَ سَمِعْتُ جَابِرَ بْنَ زَيْدٍ يُحَدِّثُ عَنْ ابْنِ عَبَّاسٍرَفَعَهُ شُعْبَةُ قَالَ يَقْطَعُ الصَّلَاةَ الْمَرْأَةُ الْحَائِضُ وَالْكَلْبُقَالَ أَبُو دَاوُد وَقَفَهُ سَعِيدٌ وَهِشَامٌ وَهَمَّامٌ عَنْ قَتَادَةَ عَنْ جَابِرِ بْنِ زَيْدٍ عَلَى ابْنِ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Syu'bah] telah menceritakan kepada kami [Qatadah] dia berkata; saya mendengar [Jabir bin Zaid] bercerita dari [Ibnu Abbas] yang di rafa'kan (bersambung hingga Nabi) oleh Syu'bah dia berkata; \"Yang dapat memutus (membatalkan) sholat seseorang adalah wanita haidh dan anjing.\" Abu Daud berkata; [Sa'id], [Hisyam] dan [Hammam] memauqufkan (riwayat tersebut) dari [Jabir bin Zaid] atas riwayat [ibnu Abbas].\""
            },
            {
                "number": 591,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ مَوْلَى بَنِي هَاشِمٍ الْبَصْرِيُّ حَدَّثَنَا مُعَاذٌ حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَأَحْسَبُهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ إِلَى غَيْرِ سُتْرَةٍ فَإِنَّهُ يَقْطَعُ صَلَاتَهُ الْكَلْبُ وَالْحِمَارُ وَالْخِنْزِيرُ وَالْيَهُودِيُّ وَالْمَجُوسِيُّ وَالْمَرْأَةُ وَيُجْزِئُ عَنْهُ إِذَا مَرُّوا بَيْنَ يَدَيْهِ عَلَى قَذْفَةٍ بِحَجَرٍقَالَ أَبُو دَاوُد فِي نَفْسِي مِنْ هَذَا الْحَدِيثِ شَيْءٌ كُنْتُ أُذَاكِرُ بِهِ إِبْرَاهِيمَ وَغَيْرَهُ فَلَمْ أَرَ أَحَدًا جَاءَ بِهِ عَنْ هِشَامٍ وَلَا يَعْرِفُهُ وَلَمْ أَرَ أَحَدًا يُحَدِّثُ بِهِ عَنْ هِشَامٍ وَأَحْسَبُ الْوَهْمَ مِنْ ابْنِ أَبِي سَمِينَةَ يَعْنِي مُحَمَّدَ بْنَ إِسْمَعِيلَ الْبَصْرِيَّ مَوْلَى بَنِي هَاشِمٍ وَالْمُنْكَرُ فِيهِ ذِكْرُ الْمَجُوسِيِّ وَفِيهِ عَلَى قَذْفَةٍ بِحَجَرٍ وَذِكْرُ الْخِنْزِيرِ وَفِيهِ نَكَارَةٌ قَالَ أَبُو دَاوُد وَلَمْ أَسْمَعْ هَذَا الْحَدِيثَ إِلَّا مِنْ مُحَمَّدِ بْنِ إِسْمَعِيلَ بْنِ أَبِي سَمِينَةَ وَأَحْسَبُهُ وَهِمَ لِأَنَّهُ كَانَ يُحَدِّثُنَا مِنْ حِفْظِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il] bekas budak Bani Hasyim Al Bashri, telah menceritakan kepada kami [Mu'adz] telah menceritakan kepada kami [Hisyam] dari [Yahya] dari ['Ikrimah] dari [Ibnu Abbas] dia berkata; saya kira (hadits ini) dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila salah seorang dari kalian sholat tanpa ada sutrah (pembatas), maka anjing, keledai, babi, orang Yahudi dan wanita dapat memutuskan sholatnya (apabila lewat di depannya), dan cukuplah baginya (apabila mereka hendak lewat di hadapannya) untuk melempar dengan batu.\" Abu Daud mengatakan; \"Menurutku hadits ini ada masalah, ketika aku menyebutkan hadits tersebut kepada Ibrahim, maka ia tidak pernah tahu seorang pun yang datang (meriwayatkan) dari Haisyam dan dia juga tidak mengetahuinya, begitu juga aku tidak pernah melihat seorang pun yang pernah meriwayatkan dari Hisyam, saya kira Ibnu Abu Saminah yaitu Muhammad bin Isma'il Al Bashri bekas budak Bani Hasyim, terdapat keraguan (dalam riwayatnya) dan kemungkaran, karena ia menyebutkan; \"Orang Majusi\" dan \"Melemparnya dengan batu\" (dalam riwayatnya pula) dia menyebutkan \"babi\" sehingga (riwayatnya) munkar, Abu Daud berkata; \"Aku tidak pernah mendengar hadits ini kecuali dari Muhammad bin Isma'il bin Abu Saminah, dan saya kira dia banyak keraguan karena dia meriwayatkan kepada kami dari hafalannya sendiri.\""
            },
            {
                "number": 592,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا وَكِيعٌ عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ عَنْ مَوْلَى يَزِيدَ بْنِ نِمْرَانَ عَنْ يَزِيدَ بْنِ نِمْرَانَ قَالَرَأَيْتُ رَجُلًا بِتَبُوكَ مُقْعَدًا فَقَالَ مَرَرْتُ بَيْنَ يَدَيْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا عَلَى حِمَارٍ وَهُوَ يُصَلِّي فَقَالَ اللَّهُمَّ اقْطَعْ أَثَرَهُ فَمَا مَشَيْتُ عَلَيْهَا بَعْدُحَدَّثَنَا كَثِيرُ بْنُ عُبَيْدٍ يَعْنِي الْمَذْحِجِيَّ حَدَّثَنَا أَبُو حَيْوَةَ عَنْ سَعِيدٍ بِإِسْنَادِهِ وَمَعْنَاهُ زَادَ قَالَ قَطَعَ صَلَاتَنَا قَطَعَ اللَّهُ أَثَرَهُ قَالَ أَبُو دَاوُد وَرَوَاهُ أَبُو مُسْهِرٍ عَنْ سَعِيدٍ قَالَ فِيهِ قَطَعَ صَلَاتَنَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] telah menceritakan kepada kami [Waki'] dari [Sa'id bin Abdul Aziz] dari [Bekas budak Yazid bin Nimran] dari [Yazid bin Nimran] dia berkata; Aku bertemu [seorang lumpuh] di Tabuk, lalu dia bercerita: \"Aku pernah lewat di hadapan Rasulullah Shallallahu 'alaihi wa Salam dengan mengendarai keledai ketika beliau sedang sholat, maka beliau bersabda: \"Ya Allah, potonglah jejaknya.\" Setelah itu aku tidak dapat berjalan.\" Telah menceritakan kepada kami [Katsir bin Ubaid yaitu Al Madhiji] telah menceritakan kepada kami [Abu Haiwah] dari [Sa'id] dengan isnad dan maknanya, dia menambahkan; \"Dia telah memotong sholat kami, semoga Allah memotong jejaknya.\" Abu Daud berkata; sedangkan [Abu Mushir] meriwayatkan dari [Sa'id] dia berkata; \"Dia telah memotong sholat kami.\""
            },
            {
                "number": 593,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ ح و حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مُعَاوِيَةُ عَنْ سَعِيدِ بْنِ غَزْوَانَ عَنْ أَبِيهِأَنَّهُ نَزَلَ بِتَبُوكَ وَهُوَ حَاجٌّ فَإِذَا هُوَ بِرَجُلٍ مُقْعَدٍ فَسَأَلَهُ عَنْ أَمْرِهِ فَقَالَ لَهُ سَأُحَدِّثُكَ حَدِيثًا فَلَا تُحَدِّثْ بِهِ مَا سَمِعْتَ أَنِّي حَيٌّ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَزَلَ بِتَبُوكَ إِلَى نَخْلَةٍ فَقَالَ هَذِهِ قِبْلَتُنَا ثُمَّ صَلَّى إِلَيْهَا فَأَقْبَلْتُ وَأَنَا غُلَامٌ أَسْعَى حَتَّى مَرَرْتُ بَيْنَهُ وَبَيْنَهَا فَقَالَ قَطَعَ صَلَاتَنَا قَطَعَ اللَّهُ أَثَرَهُ فَمَا قُمْتُ عَلَيْهَا إِلَى يَوْمِي هَذَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Al Hamdani] dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Sulaiman bin Daud] keduanya berkata; telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Mu'awiyah] dari [Sa'id bin Ghazwan] dari [ayahnya] bahwa dia singgah di Tabuk ketika berhaji, tiba-tiba dia bertemu [seorang laki-laki yang lumpuh], lantas dia bertanya sebab kelumpuhannya, maka laki-laki itu berkata kepadanya; \"Aku akan ceritakan kepadamu suatu cerita, namun kamu jangan ceritakan kepada siapapun yang kamu dengar selagi aku masih hidup, sesungguhnya Rasulullah Shallallahu'alaihiwasallam pernah singgah di Tabuk yaitu di bawah pohon kurma, maka beliau bersabda: \"Ini adalah kiblat kami.\" Kemudian beliau sholat menghadap pohon kurma, lalu aku berusaha menemui beliau -waktu itu usiaku masih kecil- sehingga aku lewat antara beliau dengan pohon kurma tersebut, maka beliau bersabda: \"Dia telah memotong sholat kami, semoga Allah memotong jejaknya.\" Maka saya tidak dapat berdiri sampai hari ini.\""
            },
            {
                "number": 594,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا هِشَامُ بْنُ الْغَازِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَهَبَطْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ ثَنِيَّةِ أَذَاخِرَ فَحَضَرَتْ الصَّلَاةُ يَعْنِي فَصَلَّى إِلَى جِدَارٍ فَاتَّخَذَهُ قِبْلَةً وَنَحْنُ خَلْفَهُ فَجَاءَتْ بَهْمَةٌ تَمُرُّ بَيْنَ يَدَيْهِ فَمَا زَالَ يُدَارِئُهَا حَتَّى لَصَقَ بَطْنَهُ بِالْجِدَارِ وَمَرَّتْ مِنْ وَرَائِهِ أَوْ كَمَا قَالَ مُسَدَّدٌ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Isa bin Yunus] telah menceritakan kepada kami [Hisyam bin Al Ghaz] dari ['amru bin Syu'aib] dari [ayahnya] dari [kakeknya] dia berkata; \"Kami bersama Rasulullah shallallahu 'alaihi wasallam pernah menuruni bukit Adzakhir, kemudian tibalah waktu sholat, lantas beliau mengerjakan sholat dengan menjadikan dinding sebagai arah kiblat, sedangkan kami berada di belakang beliau, tiba-tiba ada seekor anak kambing yang lewat di depan beliau di hadapan beliau, namun beliau selalu mencegahnya, sehingga perut beliau hampir menempel di dinding, akhirnya anak kambing tersebut lewat di belakang dinding.\" Atau sebagaimana kata Musaddad.\""
            },
            {
                "number": 595,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَحَفْصُ بْنُ عُمَرَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ يَحْيَى بْنِ الْجَزَّارِ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي فَذَهَبَ جَدْيٌ يَمُرُّ بَيْنَ يَدَيْهِ فَجَعَلَ يَتَّقِيهِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] dan [Hafsh bin Umar] keduanya berkata; telah menceritakan kepada kami [Syu'bah] dari ['Amru bin Murrah] dari [Yahya bin Al Jazzar] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam bahwa beliau pernah sholat, lalu seekor anak kambing hendak lewat di depan beliau, maka beliau berusaha menahannya.\""
            },
            {
                "number": 596,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا شُعْبَةُ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْكُنْتُ بَيْنَ يَدَيْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَيْنَ الْقِبْلَةِ قَالَ شُعْبَةُ أَحْسَبُهَا قَالَتْ وَأَنَا حَائِضٌقَالَ أَبُو دَاوُد رَوَاهُ الزُّهْرِيُّ وَعَطَاءٌ وَأَبُو بَكْرِ بْنُ حَفْصٍ وَهِشَامُ بْنُ عُرْوَةَ وَعِرَاكُ بْنُ مَالِكٍ وَأَبُو الْأَسْوَدِ وَتَمِيمُ بْنُ سَلَمَةَ كُلُّهُمْ عَنْ عُرْوَةَ عَنْ عَائِشَةَ وَإِبْرَاهِيمُ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ وَأَبُو الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ وَالْقَاسِمُ بْنُ مُحَمَّدٍ وَأَبُو سَلَمَةَ عَنْ عَائِشَةَ لَمْ يَذْكُرُوا وَأَنَا حَائِضٌ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Syu'bah] dari [Sa'd bin Ibrahim] dari ['Urwah] dari [Aisyah] dia berkata; \"Aku pernah berada di antara Nabi dan Kiblat.\" Syu'bah berkata; \"Aku mengira Aisyah mengatakan; \"Padahal aku sedang haidh.\" Abu Daud berkata; 'Hadits ini di riwayatkan pula oleh [Az Zuhri], ['Atha`], [Abu Bakar bin Hafsh], [Hisyam bin 'Urwah], ['Irak bin Malik], [Abu Al Aswad] dan [Tamim bin Salamah], mereka semuanya dari ['Urwah] dari [Aisyah]. Sedangkan [Ibrahim] dari [Al Aswad] dari [Aisyah], dan [Abu Dluha] dari [Masruq] dari [Aisyah], sedangkan [Al Qasim bin Muhammad] dan [Abu Salamah] dari [Aisyah], namun mereka tidak menyebutkan; \"Padahal aku sedang haidh.\""
            },
            {
                "number": 597,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي صَلَاتَهُ مِنْ اللَّيْلِ وَهِيَ مُعْتَرِضَةٌ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ رَاقِدَةٌ عَلَى الْفِرَاشِ الَّذِي يَرْقُدُ عَلَيْهِ حَتَّى إِذَا أَرَادَ أَنْ يُوتِرَ أَيْقَظَهَا فَأَوْتَرَتْ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Hisyam bin 'Urwah] dari ['Urwah] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam sholat malam, sedangkan Aisyah melintang antara beliau dengan Kiblat, berbaring di atas tempat tidur yang biasa di tempati oleh beliau, hingga apabila beliau hendak mengerjakan sholat witir, beliau membangunkan Aisyah, untuk sholat witir.\""
            },
            {
                "number": 598,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ سَمِعْتُ الْقَاسِمَ يُحَدِّثُ عَنْ عَائِشَةَ قَالَتْبِئْسَمَا عَدَلْتُمُونَا بِالْحِمَارِ وَالْكَلْبِ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ يُصَلِّي وَأَنَا مُعْتَرِضَةٌ بَيْنَ يَدَيْهِ فَإِذَا أَرَادَ أَنْ يَسْجُدَ غَمَزَ رِجْلِي فَضَمَمْتُهَا إِلَيَّ ثُمَّ يَسْجُدُ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari ['ubaidhullah] dia berkata; saya mendengar [Al Qasim] bercerita dari [Aisyah] dia berkata; alangkah jeleknya kalian yang menyetarakan kami dengan keledai dan anjing, sungguh aku telah melihat Rasulullah mengerjakan sholat sedangkan saya melintang antara diri beliau dengan kiblat, apabila beliau hendak sujud, beliau meraba kakiku, sebab itu aku menarik kakiku lalu beliau sujud.\""
            },
            {
                "number": 599,
                "arab": "حَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ حَدَّثَنَا الْمُعْتَمِرُ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ أَبِي النَّضْرِ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ أَنَّهَا قَالَتْكُنْتُ أَكُونُ نَائِمَةً وَرِجْلَايَ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي مِنْ اللَّيْلِ فَإِذَا أَرَادَ أَنْ يَسْجُدَ ضَرَبَ رِجْلَيَّ فَقَبَضْتُهُمَا فَسَجَدَ",
                "id": "Telah menceritakan kepada kami ['Ashim bin An Nadlr] telah menceritakan kepada kami [Al Mu'tamir] telah menceritakan kepada kami ['ubaidhullah] dari [Abu An Nadlr] dari [Abu Salamah bin Abdurrahman] dari [Aisyah] bahwa dia berkata; \"Aku pernah tidur dan kedua kakiku berada di hadapan Rasulullah shallallahu 'alaihi wasallam padahal beliau sedang mengerjakan sholat malam, apabila beliau hendak sujud, beliau menepuk kakiku, sebab itu aku menarik kedua kakiku, kemudian beliau sujud.\""
            },
            {
                "number": 600,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ ح قَالَ أَبُو دَاوُد و حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ وَهَذَا لَفْظُهُ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْكُنْتُ أَنَامُ وَأَنَا مُعْتَرِضَةٌ فِي قِبْلَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيُصَلِّي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَمَامَهُ إِذَا أَرَادَ أَنْ يُوتِرَ زَادَ عُثْمَانُ غَمَزَنِي ثُمَّ اتَّفَقَا فَقَالَ تَنَحَّيْ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Muhammad bin Bisysr] dan telah di riwayatkan dari jalur lain, Abu Daud mengatakan; dan telah menceritakan kepada kami [Al Qa'nabi] telah menceritakan kepada kami [Abdul Aziz] yaitu Ibnu Muhammad, dan ini adalah lafadznya dari [Muhammad bin 'Amru] dari [Abu Salamah] dari [Aisyah] bahwa dia berkata; \"Aku tidur melintang di antara kiblat Rasulullah shallallahu 'alaihi wasallam, kemudian Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat sementara aku berada di hadapan beliau, apabila beliau hendak mengerjakan witir -Utsman menambahkan; \"beliau meraba (kakiku) \" -lalu riwayatnya Utsman dengan Al Qa'nabi menyatu lagi- Lalu beliau bersabda: \"Pindahlah! (wahai Aisyah).\""
            },
            {
                "number": 601,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ قَالَ جِئْتُ عَلَى حِمَارٍ ح و حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍ قَالَأَقْبَلْتُ رَاكِبًا عَلَى أَتَانٍ وَأَنَا يَوْمَئِذٍ قَدْ نَاهَزْتُ الِاحْتِلَامَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِالنَّاسِ بِمِنًى فَمَرَرْتُ بَيْنَ يَدَيْ بَعْضِ الصَّفِّ فَنَزَلْتُ فَأَرْسَلْتُ الْأَتَانَ تَرْتَعُ وَدَخَلْتُ فِي الصَّفِّ فَلَمْ يُنْكِرْ ذَلِكَ أَحَدٌقَالَ أَبُو دَاوُد وَهَذَا لَفْظُ الْقَعْنَبِيِّ وَهُوَ أَتَمُّ قَالَ مَالِكٌ وَأَنَا أَرَى ذَلِكَ وَاسِعًا إِذَا قَامَتْ الصَّلَاةُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] dia berkata; \"Aku datang dengan mengendarai seekor keledai…\" dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari ['ubaidhullah bin Abdullah bin 'Utbah] dari [Ibnu Abbas] dia berkata; \"Aku datang sambil menaiki seekor keledai, pada saat itu aku sudah hampir usia baligh, dan Rasulullah shallallahu 'alaihi wasallam sedang melaksanakan sholat bersama orang-orang di Mina, lalu aku lewat di depan sebagian shaf, lalu aku turun. Setelah itu aku melepas keledaiku untuk merumput, lalu aku masuk kedalam shaf, tapi tidak ada satupun orang yang menegur perbuatanku.\" Abu Daud berkata; \"Ini redaksi dari Al Qa'nabi dan lebih lengkap, Malik mengatakan; \"Dan aku melihat hal itu merupakan kemudahan apabila sholat telah di tegakkan.\""
            },
            {
                "number": 602,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ مَنْصُورٍ عَنْ الْحَكَمِ عَنْ يَحْيَى بْنِ الْجَزَّارِ عَنْ أَبِي الصَّهْبَاءِ قَالَتَذَاكَرْنَا مَا يَقْطَعُ الصَّلَاةَ عِنْدَ ابْنِ عَبَّاسٍ فَقَالَ جِئْتُ أَنَا وَغُلَامٌ مِنْ بَنِي عَبْدِ الْمُطَّلِبِ عَلَى حِمَارٍ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فَنَزَلَ وَنَزَلْتُ وَتَرَكْنَا الْحِمَارَ أَمَامَ الصَّفِّ فَمَا بَالَاهُ وَجَاءَتْ جَارِيَتَانِ مِنْ بَنِي عَبْدِ الْمُطَّلِبِ فَدَخَلَتَا بَيْنَ الصَّفِّ فَمَا بَالَى ذَلِكَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَدَاوُدُ بْنُ مِخْرَاقٍ الْفِرْيَابِيُّ قَالَا حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ بِهَذَا الْحَدِيثِ بِإِسْنَادِهِ قَالَ فَجَاءَتْ جَارِيَتَانِ مِنْ بَنِي عَبْدِ الْمُطَّلِبِ اقْتَتَلَتَا فَأَخَذَهُمَا قَالَ عُثْمَانُ فَفَرَّعَ بَيْنَهُمَا وَقَالَ دَاوُدُ فَنَزَعَ إِحْدَاهُمَا عَنْ الْأُخْرَى فَمَا بَالَى ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu 'Awanah] dari [Manshur] dari [Al Hakam] dari [Yahya bin Al Jazzar] dari [Abu As Shahba`] dia berkata; \"Kami membiacarakan mengenai sesuatu yang dapat memutuskan sholat di samping Ibnu Abbas, maka [Ibnu Abbas] berkata; \"Aku pernah datang bersama seorang budak dari Bani Abdul Mutthalib dengan mengendarai seekor keledai, dan Rasulullah shallallahu 'alaihi wasallam sedang melaksanakan sholat, maka budak itu turun, aku pun ikut turun lalu aku biarkan keledai tersebut di depan shaf, namun beliau tidak menghiraukannya. Setelah itu datang pula dua orang budak wanita dari Bani Abdul Mutthalib, lalu keduanya masuk ke dalam shaf, namun beliau tetap tidak menghiraukannya.\" Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Daud bin Mihraq Al Firyabi] keduanya berkata; telah menceritakan kepada kami [Jarir] dari [Manshur] dengan hadits ini dengan isnadnya dia mengatakan; \"Kemudian datang pula dua budak wanita dari Bani Abdul Mutthalib yang sedang bertikai, maka beliau memegang keduanya.\" Utsman mengatakan; \"Kemudian beliau melerai keduanya.\" Sedangkan Daud mengatakan; \"Lalu beliau melerai salah satu dari keduanya, dan beliau tidak memperdulikan hal itu.\""
            },
            {
                "number": 603,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ قَالَ حَدَّثَنِي أَبِي عَنْ جَدِّي عَنْ يَحْيَى بْنِ أَيُّوبَ عَنْ مُحَمَّدِ بْنِ عُمَرَ بْنِ عَلِيٍّ عَنْ عَبَّاسِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ عَنْ الْفَضْلِ بْنِ عَبَّاسٍ قَالَأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِي بَادِيَةٍ لَنَا وَمَعَهُ عَبَّاسٌ فَصَلَّى فِي صَحْرَاءَ لَيْسَ بَيْنَ يَدَيْهِ سُتْرَةٌ وَحِمَارَةٌ لَنَا وَكَلْبَةٌ تَعْبَثَانِ بَيْنَ يَدَيْهِ فَمَا بَالَى ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin Syu'aib bin Al Laits] dia berkata; telah menceritakan kepadaku [ayahku] dari [kakekku] dari [Yahya bin Ayyub] dari [Muhammad bin Umar bin Ali] dari ['Abbas bin 'ubaidhullah bin 'Abbas] dari [Al Fadl bin 'Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam mendatangi kami ketika kami berada di kampung, beliau bersama Abbas, lalu beliau sholat di tanah lapang tanpa ada sutrah (pembatas jarak dalam sholat) sementara keledai kami dan seekor anjing berada di sekitar beliau sedang bermain, namun beliau tidak menghiraukannya.\""
            },
            {
                "number": 604,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ مُجَالِدٍ عَنْ أَبِي الْوَدَّاكِ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقْطَعُ الصَّلَاةَ شَيْءٌ وَادْرَءُوا مَا اسْتَطَعْتُمْ فَإِنَّمَا هُوَ شَيْطَانٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`] telah menceritakan kepada kami [Abu Usamah] dari [Mujalid] dari [Abu Al Waddak] dari [Abu Sa'id] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jangan sampai ada sesuatu yang dapat memutuskan sholat kalian, dan cegahlah semampu kalian, karena ia adalah syetan.\""
            },
            {
                "number": 605,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا مُجَالِدٌ حَدَّثَنَا أَبُو الْوَدَّاكِ قَالَمَرَّ شَابٌّ مِنْ قُرَيْشٍ بَيْنَ يَدَيْ أَبِي سَعِيدٍ الْخُدْرِيِّ وَهُوَ يُصَلِّي فَدَفَعَهُ ثُمَّ عَادَ فَدَفَعَهُ ثَلَاثَ مَرَّاتٍ فَلَمَّا انْصَرَفَ قَالَ إِنَّ الصَّلَاةَ لَا يَقْطَعُهَا شَيْءٌ وَلَكِنْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ادْرَءُوا مَا اسْتَطَعْتُمْ فَإِنَّهُ شَيْطَانٌقَالَ أَبُو دَاوُد إِذَا تَنَازَعَ الْخَبَرَانِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نُظِرَ إِلَى مَا عَمِلَ بِهِ أَصْحَابُهُ مِنْ بَعْدِهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdul Wahid bin Ziyad] telah menceritakan kepada kami [Mujalid] telah menceritakan kepada kami [Abu Al Waddak] dia berkata; \"Seorang pemuda Quraisy lewat di hadapan Abu Sa'id Al Khudri yang sedang melaksanakan sholat, kemudian Abu Sa'id mencegahnya (supaya tidak lewat di hadapannya), namun pemuda tersebut mengulanginya lagi, Abu Sa'id tetap mencegahnya dan peristiwa itu berulang-ulang hingga tiga kali, ketika [Abu Sa'id] telah selesai dia berkata; \"Sesungguhnya tidak ada sesuatu yang dapat memutuskan sholat, akan tetapi Rasulullah shallallahu 'alaihi wasallam bersabda: \"Cegahlah semampu kalian, karena ia adalah syetan.\" Abu Daud mengatakan; \"Apabila ada dua hadits dari Rasulullah shallallahu 'alaihi wasallam yang bertentangan, maka di lihat hadits yang di amalkan oleh sahabat setelahnya.\""
            },
            {
                "number": 606,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَفْتَحَ الصَّلَاةَ رَفَعَ يَدَيْهِ حَتَّى يُحَاذِيَ مَنْكِبَيْهِ وَإِذَا أَرَادَ أَنْ يَرْكَعَ وَبَعْدَمَا يَرْفَعُ رَأْسَهُ مِنْ الرُّكُوعِ وَقَالَ سُفْيَانُ مَرَّةً وَإِذَا رَفَعَ رَأْسَهُ وَأَكْثَرُ مَا كَانَ يَقُولُ وَبَعْدَ مَا يَرْفَعُ رَأْسَهُ مِنْ الرُّكُوعِ وَلَا يَرْفَعُ بَيْنَ السَّجْدَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Hanbal] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Salim] dari [ayahnya] dia berkata; \"Saya pernah melihat apabila Rasulullah shallallahu 'alaihi wasallam memulai sholat, beliau mengangkat kedua tangannya hingga setara dengan kedua bahunya, demikian juga apabila hendak ruku' yaitu setelah mengangkat kepalanya dari ruku'.\" Di kali yang lain, Sufyan mengatakan; \"Apabila beliau mengangkat kepalanya.\" Dan lafadz yang sering dia pergunakan adalah; \"Yaitu setelah beliau mengangkat kepalanya dari ruku' dan tidak mengangkat kedua tangannya antara dua sujud.\""
            },
            {
                "number": 607,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ حَدَّثَنَا بَقِيَّةُ حَدَّثَنَا الزُّبَيْدِيُّ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ إِلَى الصَّلَاةِ رَفَعَ يَدَيْهِ حَتَّى تَكُونَ حَذْوَ مَنْكِبَيْهِ ثُمَّ كَبَّرَ وَهُمَا كَذَلِكَ فَيَرْكَعُ ثُمَّ إِذَا أَرَادَ أَنْ يَرْفَعَ صُلْبَهُ رَفَعَهُمَا حَتَّى تَكُونَ حَذْوَ مَنْكِبَيْهِ ثُمَّ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ وَلَا يَرْفَعُ يَدَيْهِ فِي السُّجُودِ وَيَرْفَعُهُمَا فِي كُلِّ تَكْبِيرَةٍ يُكَبِّرُهَا قَبْلَ الرُّكُوعِ حَتَّى تَنْقَضِيَ صَلَاتُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mushaffa Al Himshi] telah menceritakan kepada kami [Baqiyah] telah menceritakan kepada kami [Az Zubaidi] dari [Az Zuhri] dari [Salim] dari [Abdullah bin Umar] dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam hendak melaksanakan sholat, maka beliau mengangkat kedua tangannya hingga sejajar dengan kedua bahunya, kemudian beliau bertakbir, dan kedua tangannya juga masih seperti itu, lalu beliau ruku'. Dan apabila beliau hendak mengangkat tulang sulbinya (punggung), beliau mengangkat kedua tangannya hingga sejajar dengan kedua bahunya sambil mengucapkan: \"Sami'allahu liman hamidah (Allah Maha mendengar terhadap siapa saja yang memuji-Nya).\" Beliau tidak mengangkat kedua tangannya ketika hendak sujud, namun beliau selalu mengangkat kedua tangannya di setiap takbir yang beliau ucapkan sebelum ruku' sampai selesai sholat.\""
            },
            {
                "number": 608,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ الْجُشَمِيُّ حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جُحَادَةَ حَدَّثَنِي عَبْدُ الْجَبَّارِ بْنُ وَائِلِ بْنِ حُجْرٍ قَالَكُنْتُ غُلَامًا لَا أَعْقِلُ صَلَاةَ أَبِي قَالَ فَحَدَّثَنِي وَائِلُ بْنُ عَلْقَمَةَ عَنْ أَبِي وَائِلِ بْنِ حُجْرٍ قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ إِذَا كَبَّرَ رَفَعَ يَدَيْهِ قَالَ ثُمَّ الْتَحَفَ ثُمَّ أَخَذَ شِمَالَهُ بِيَمِينِهِ وَأَدْخَلَ يَدَيْهِ فِي ثَوْبِهِ قَالَ فَإِذَا أَرَادَ أَنْ يَرْكَعَ أَخْرَجَ يَدَيْهِ ثُمَّ رَفَعَهُمَا وَإِذَا أَرَادَ أَنْ يَرْفَعَ رَأْسَهُ مِنْ الرُّكُوعِ رَفَعَ يَدَيْهِ ثُمَّ سَجَدَ وَوَضَعَ وَجْهَهُ بَيْنَ كَفَّيْهِ وَإِذَا رَفَعَ رَأْسَهُ مِنْ السُّجُودِ أَيْضًا رَفَعَ يَدَيْهِ حَتَّى فَرَغَ مِنْ صَلَاتِهِقَالَ مُحَمَّدٌ فَذَكَرْتُ ذَلِكَ لِلْحَسَنِ بْنِ أَبِي الْحَسَنِ فَقَالَ هِيَ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَهُ مَنْ فَعَلَهُ وَتَرَكَهُ مَنْ تَرَكَهُ قَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ هَمَّامٌ عَنْ ابْنِ جُحَادَةَ لَمْ يَذْكُرْ الرَّفْعَ مَعَ الرَّفْعِ مِنْ السُّجُودِ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Umar bin Maisarah Al Jusyami] telah menceritakan kepada kami [Abdul Warits bin Sa'id] dia berkata; telah menceritakan kepada kami [Muhammad bin Juhadah] telah menceritakan kepadaku [Abdul Jabbar bin Wa`il bin Hujr] dia berkata; \"Aku adalah seorang anak yang belum mengerti sholat yang di kerjakan ayahku, katanya; maka [\"Wa'il bin 'Alqamah] telah menceritakan kepadaku, dari ayahku [Wa'il bin Hujr] dia berkata; \"Aku sholat bersama Rasulullah shallallahu 'alaihi wasallam, apabila beliau hendak bertakbir, maka beliau mengangkat kedua tangannya.\" Katanya; \"Kemudian beliau melipatkan pakaiannya, lalu tangan kanannya memegang tangan kirinya dan memasukkan kedua tangannya ke dalam pakaian beliau.\" dia melanjutkan; \"Apabila beliau hendak ruku', beliau mengeluarkan kedua tangannya dan mengangkatnya, dan apabila beliau hendak mengangkat kepalanya dari ruku' (i'tidal), beliau mengangkat kedua tangannya, barulah beliau sujud dengan meletakkan wajahnya sejajar dengan kedua telapak tangannya, apabila beliau hendak mengangkat kepalanya dari sujud, maka beliau juga mengangkat kedua tangannya lagi sampai selesai sholat.\" Muhammad mengatakan; \"Lalu aku menyebutkan hal itu kepada Al Hasan bin Abu Al Hasan, maka dia berkata; \"Itu adalah sholat Rasulullah shallallahu 'alaihi wasallam yang di kerjakan oleh orang yang suka mengerjakan dan di tinggalkan oleh orang yang suka meninggalkannya.\" Abu Daud mengatakan; \"Hadits ini di riwayatkan juga oleh [Hammam] dari [Ibnu Juhadah], namun dia tidak menyebutkan 'juga mengangkat tangan ketika bangkit dari sujud'. "
            },
            {
                "number": 609,
                "arab": "حَدَّثَنِي عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ النَّخَعِيِّ عَنْ عَبْدِ الْجَبَّارِ بْنِ وَائِلٍ عَنْ أَبِيهِأَنَّهُ أَبْصَرَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ قَامَ إِلَى الصَّلَاةِ رَفَعَ يَدَيْهِ حَتَّى كَانَتَا بِحِيَالِ مَنْكِبَيْهِ وَحَاذَى بِإِبْهَامَيْهِ أُذُنَيْهِ ثُمَّ كَبَّرَ",
                "id": "Telah menceritakan kepada kami ['Utsman bin Abu Syaibah] telah menceritakan kepada kami [Abdurrahim bin Sulaiman] dari [Al Hasan bin 'Ubaidulah An Nakha'i] dari [Abdul Jabbar bin Wa`il] dari [ayahnya] bahwa dia memperhatikan Nabi shallallahu 'alaihi wasallam ketika beliau mengerjakan sholat, beliau mengangkat kedua tangannya di atas kedua bahunya dan kedua jempol jarinya hampir menempel di kedua telinganya, kemudian beliau bertakbir.\""
            },
            {
                "number": 610,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ حَدَّثَنَا الْمَسْعُودِيُّ حَدَّثَنِي عَبْدُ الْجَبَّارِ بْنُ وَائِلٍ حَدَّثَنِي أَهْلُ بَيْتِي عَنْ أَبِي أَنَّهُ حَدَّثَهُمْأَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ مَعَ التَّكْبِيرَةِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yazid yaitu Ibnu Zurai'] telah menceritakan kepada kami [Al Mas'udi] telah menceritakan kepadaku [Abdul Jabbar bin Wa'il] telah menceritakan kepadaku [keluargaku] dari [ayahku] bahwa dia menceritakan kepada mereka (ahli baitku) bahwa dia (ayahku) pernah melihat Rasulullah shallallahu 'alaihi wasallam mengangkat kedua tangannya sambil bertakbir.\""
            },
            {
                "number": 611,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَقُلْتُ لَأَنْظُرَنَّ إِلَى صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ يُصَلِّي قَالَ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَقْبَلَ الْقِبْلَةَ فَكَبَّرَ فَرَفَعَ يَدَيْهِ حَتَّى حَاذَتَا أُذُنَيْهِ ثُمَّ أَخَذَ شِمَالَهُ بِيَمِينِهِ فَلَمَّا أَرَادَ أَنْ يَرْكَعَ رَفَعَهُمَا مِثْلَ ذَلِكَ ثُمَّ وَضَعَ يَدَيْهِ عَلَى رُكْبَتَيْهِ فَلَمَّا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ رَفَعَهُمَا مِثْلَ ذَلِكَ فَلَمَّا سَجَدَ وَضَعَ رَأْسَهُ بِذَلِكَ الْمَنْزِلِ مِنْ بَيْنِ يَدَيْهِ ثُمَّ جَلَسَ فَافْتَرَشَ رِجْلَهُ الْيُسْرَى وَوَضَعَ يَدَهُ الْيُسْرَى عَلَى فَخِذِهِ الْيُسْرَى وَحَدَّ مِرْفَقَهُ الْأَيْمَنَ عَلَى فَخِذِهِ الْيُمْنَى وَقَبَضَ ثِنْتَيْنِ وَحَلَّقَ حَلْقَةً وَرَأَيْتُهُ يَقُولُ هَكَذَا وَحَلَّقَ بِشْرٌ الْإِبْهَامَ وَالْوُسْطَى وَأَشَارَ بِالسَّبَّابَةِحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو الْوَلِيدِ حَدَّثَنَا زَائِدَةُ عَنْ عَاصِمِ بْنِ كُلَيْبٍ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ فِيهِ ثُمَّ وَضَعَ يَدَهُ الْيُمْنَى عَلَى ظَهْرِ كَفِّهِ الْيُسْرَى وَالرُّسْغِ وَالسَّاعِدِ وَقَالَ فِيهِ ثُمَّ جِئْتُ بَعْدَ ذَلِكَ فِي زَمَانٍ فِيهِ بَرْدٌ شَدِيدٌ فَرَأَيْتُ النَّاسَ عَلَيْهِمْ جُلُّ الثِّيَابِ تَحَرَّكُ أَيْدِيهِمْ تَحْتَ الثِّيَابِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Bisyr bin Al Mufadlal] dari ['Ashim bin Kulaib] dari [ayahnya] dari [wa'il bin Hujr] dia berkata; kataku; \"Sungguh aku benar-benar akan melihat sholat Rasulullah shallallahu 'alaihi wasallam, dan melihat bagaimana beliau tata cara beliau sholat.\" Wa'il berkata; asulullah shallallahu 'alaihi wasallam berdiri menghadap kiblat, kemudian beliau bertakbir sambil mengangkat kedua tangannya hingga sejajar dengan kedua telinganya, kemudian tangan kanannya memegang tangan kirinya, ketika beliau hendak ruku', beliau mengangkat kedua tangannya seperti tadi, kemudian beliau meletakkan kedua tangannya di atas kedua lututnya, ketika beliau hendak mengangkat kepalanya dari ruku' (i'tidal) beliau mengangkat kedua tangannya lagi seperti tadi, dan ketika sujud, beliau meletakkan kepalanya di tempat tersebut yaitu di antara kedua tangannya kemudian beliau duduk dengan bertumpu di atas kaki yang kiri dan meletakkan tangan kiri di atas paha kiri dan merenggangkan siku yang kanan pada paha yang kanan, menggenggam kedua jarinya dengan membentuk seperti lingkaran, aku melihat beliau memberi tanda demikian -Bisyr memperragakan dengan membentuk seperti lingkaran dengan ibu jari dan jari tengah- telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Abu Al Walid] telah menceritakan kepada kami [Za`idah] dari ['Ashim bin Kulaib] dengan isnad dan maknanya, (dalam haditsnya) dia mengatakan; \"Kemudian beliau meletakkan tangan kanannya di atas punggung telapak tangan kirinya dan pergelangan tangan kirinya.\" Dia juga mengatakan; \"Setelah itu aku datang ketika musim dingin tiba, maka aku melihat orang-orang berselimutkan pakaian dan tangan-tangan mereka bergerak di bawah pakaian tersebut.\""
            },
            {
                "number": 612,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَرِيكٌ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ افْتَتَحَ الصَّلَاةَ رَفَعَ يَدَيْهِ حِيَالَ أُذُنَيْهِ قَالَ ثُمَّ أَتَيْتُهُمْ فَرَأَيْتُهُمْ يَرْفَعُونَ أَيْدِيَهُمْ إِلَى صُدُورِهِمْ فِي افْتِتَاحِ الصَّلَاةِ وَعَلَيْهِمْ بَرَانِسُ وَأَكْسِيَةٌ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Syarik] dari ['Ashim bin Kulaib] dari [ayahnya] dari [Wa`il bin Hujr] dia berkata; saya melihat Rasulullah shallallahu 'alaihi wasallam ketika memulai sholat, beliau mengangkat kedua tangannya sejajar dengan kedua telinganya, katanya; kemudian aku datang kepada mereka (para sahabat), maka aku melihat mereka mengangkat kedua tangan sampai ke dada mereka ketika memulai sholat, sementara mereka ada yang mengenakan mantel yang menutupi kepala dan ada juga yang mengenakan pakaian.\""
            },
            {
                "number": 613,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا وَكِيعٌ عَنْ شَرِيكٍ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الشِّتَاءِ فَرَأَيْتُ أَصْحَابَهُ يَرْفَعُونَ أَيْدِيَهُمْ فِي ثِيَابِهِمْ فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] telah menceritakan kepada kami [Waki'] dari [Syarik] dari ['Ashim bin Kulaib] dari ['Alqamah bin Wa'il] dari [Wa'il bin Hujr] dia berkata; \"Aku datang kepada Nabi shallallahu 'alaihi wasallam di musim dingin, maka aku melihat para sahabat beliau mengangkat tangan di dalam pakaian mereka ketika sedang sholat.\""
            },
            {
                "number": 614,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا أَبُو عَاصِمٍ الضَّحَّاكُ بْنُ مَخْلَدٍ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى وَهَذَا حَدِيثُ أَحْمَدَ قَالَ أَخْبَرَنَا عَبْدُ الْحَمِيدِ يَعْنِي ابْنَ جَعْفَرٍ أَخْبَرَنِي مُحَمَّدُ بْنُ عُمَرَ بْنِ عَطَاءٍ قَالَسَمِعْتُ أَبَا حُمَيْدٍ السَّاعِدِيَّ فِي عَشْرَةٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُمْ أَبُو قَتَادَةَ قَالَ أَبُو حُمَيْدٍ أَنَا أَعْلَمُكُمْ بِصَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا فَلِمَ فَوَاللَّهِ مَا كُنْتَ بِأَكْثَرِنَا لَهُ تَبَعًا وَلَا أَقْدَمِنَا لَهُ صُحْبَةً قَالَ بَلَى قَالُوا فَاعْرِضْ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ إِلَى الصَّلَاةِ يَرْفَعُ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا مَنْكِبَيْهِ ثُمَّ يُكَبِّرُ حَتَّى يَقِرَّ كُلُّ عَظْمٍ فِي مَوْضِعِهِ مُعْتَدِلًا ثُمَّ يَقْرَأُ ثُمَّ يُكَبِّرُ فَيَرْفَعُ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا مَنْكِبَيْهِ ثُمَّ يَرْكَعُ وَيَضَعُ رَاحَتَيْهِ عَلَى رُكْبَتَيْهِ ثُمَّ يَعْتَدِلُ فَلَا يَصُبُّ رَأْسَهُ وَلَا يُقْنِعُ ثُمَّ يَرْفَعُ رَأْسَهُ فَيَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ يَرْفَعُ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا مَنْكِبَيْهِ مُعْتَدِلًا ثُمَّ يَقُولُ اللَّهُ أَكْبَرُ ثُمَّ يَهْوِي إِلَى الْأَرْضِ فَيُجَافِي يَدَيْهِ عَنْ جَنْبَيْهِ ثُمَّ يَرْفَعُ رَأْسَهُ وَيَثْنِي رِجْلَهُ الْيُسْرَى فَيَقْعُدُ عَلَيْهَا وَيَفْتَحُ أَصَابِعَ رِجْلَيْهِ إِذَا سَجَدَ وَيَسْجُدُ ثُمَّ يَقُولُ اللَّهُ أَكْبَرُ وَيَرْفَعُ رَأْسَهُ وَيَثْنِي رِجْلَهُ الْيُسْرَى فَيَقْعُدُ عَلَيْهَا حَتَّى يَرْجِعَ كُلُّ عَظْمٍ إِلَى مَوْضِعِهِ ثُمَّ يَصْنَعُ فِي الْأُخْرَى مِثْلَ ذَلِكَ ثُمَّ إِذَا قَامَ مِنْ الرَّكْعَتَيْنِ كَبَّرَ وَرَفَعَ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا مَنْكِبَيْهِ كَمَا كَبَّرَ عِنْدَ افْتِتَاحِ الصَّلَاةِ ثُمَّ يَصْنَعُ ذَلِكَ فِي بَقِيَّةِ صَلَاتِهِ حَتَّى إِذَا كَانَتْ السَّجْدَةُ الَّتِي فِيهَا التَّسْلِيمُ أَخَّرَ رِجْلَهُ الْيُسْرَى وَقَعَدَ مُتَوَرِّكًا عَلَى شِقِّهِ الْأَيْسَرِ قَالُوا صَدَقْتَ هَكَذَا كَانَ يُصَلِّي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ يَزِيدَ يَعْنِي ابْنَ أَبِي حَبِيبٍ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو الْعَامِرِيِّ قَالَ كُنْتُ فِي مَجْلِسٍ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَذَاكَرُوا صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَبُو حُمَيْدٍ فَذَكَرَ بَعْضَ هَذَا الْحَدِيثِ وَقَالَ فَإِذَا رَكَعَ أَمْكَنَ كَفَّيْهِ مِنْ رُكْبَتَيْهِ وَفَرَّجَ بَيْنَ أَصَابِعِهِ ثُمَّ هَصَرَ ظَهْرَهُ غَيْرَ مُقْنِعٍ رَأْسَهُ وَلَا صَافِحٍ بِخَدِّهِ وَقَالَ فَإِذَا قَعَدَ فِي الرَّكْعَتَيْنِ قَعَدَ عَلَى بَطْنِ قَدَمِهِ الْيُسْرَى وَنَصَبَ الْيُمْنَى فَإِذَا كَانَ فِي الرَّابِعَةِ أَفْضَى بِوَرِكِهِ الْيُسْرَى إِلَى الْأَرْضِ وَأَخْرَجَ قَدَمَيْهِ مِنْ نَاحِيَةٍ وَاحِدَةٍ حَدَّثَنَا عِيسَى بْنُ إِبْرَاهِيمَ الْمِصْرِيُّ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ اللَّيْثِ بْنِ سَعْدٍ عَنْ يَزِيدَ بْنِ مُحَمَّدٍ الْقُرَشِيِّ وَيَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ نَحْوَ هَذَا قَالَ فَإِذَا سَجَدَ وَضَعَ يَدَيْهِ غَيْرَ مُفْتَرِشٍ وَلَا قَابِضِهِمَا وَاسْتَقْبَلَ بِأَطْرَافِ أَصَابِعِهِ الْقِبْلَةَ حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ إِبْرَاهِيمَ حَدَّثَنَا أَبُو بَدْرٍ حَدَّثَنِي زُهَيْرٌ أَبُو خَيْثَمَةَ حَدَّثَنَا الْحَسَنُ بْنُ الْحُرِّ حَدَّثَنِي عِيسَى بْنُ عَبْدِ اللَّهِ بْنِ مَالِكٍ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ أَحَدِ بَنِي مَالِكٍ عَنْ عَبَّاسٍ أَوْ عَيَّاشِ بْنِ سَهْلٍ السَّاعِدِيِّ أَنَّهُ كَانَ فِي مَجْلِسٍ فِيهِ أَبُوهُ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي الْمَجْلِسِ أَبُو هُرَيْرَةَ وَأَبُو حُمَيْدٍ السَّاعِدِيُّ وَأَبُو أُسَيْدٍ بِهَذَا الْخَبَرِ يَزِيدُ أَوْ يَنْقُصُ قَالَ فِيهِ ثُمَّ رَفَعَ رَأْسَهُ يَعْنِي مِنْ الرُّكُوعِ فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ وَرَفَعَ يَدَيْهِ ثُمَّ قَالَ اللَّهُ أَكْبَرُ فَسَجَدَ فَانْتَصَبَ عَلَى كَفَّيْهِ وَرُكْبَتَيْهِ وَصُدُورِ قَدَمَيْهِ وَهُوَ سَاجِدٌ ثُمَّ كَبَّرَ فَجَلَسَ فَتَوَرَّكَ وَنَصَبَ قَدَمَهُ الْأُخْرَى ثُمَّ كَبَّرَ فَسَجَدَ ثُمَّ كَبَّرَ فَقَامَ وَلَمْ يَتَوَرَّكْ ثُمَّ سَاقَ الْحَدِيثَ قَالَ ثُمَّ جَلَسَ بَعْدَ الرَّكْعَتَيْنِ حَتَّى إِذَا هُوَ أَرَادَ أَنْ يَنْهَضَ لِلْقِيَامِ قَامَ بِتَكْبِيرَةٍ ثُمَّ رَكَعَ الرَّكْعَتَيْنِ الْأُخْرَيَيْنِ وَلَمْ يَذْكُرْ التَّوَرُّكَ فِي التَّشَهُّدِ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو أَخْبَرَنِي فُلَيْحٌ حَدَّثَنِي عَبَّاسُ بْنُ سَهْلٍ قَالَ اجْتَمَعَ أَبُو حُمَيْدٍ وَأَبُو أُسَيْدٍ وَسَهْلُ بْنُ سَعْدٍ وَمُحَمَّدُ بْنُ مَسْلَمَةَ فَذَكَرُوا صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَبُو حُمَيْدٍ أَنَا أَعْلَمُكُمْ بِصَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ بَعْضَ هَذَا قَالَ ثُمَّ رَكَعَ فَوَضَعَ يَدَيْهِ عَلَى رُكْبَتَيْهِ كَأَنَّهُ قَابِضٌ عَلَيْهِمَا وَوَتَّرَ يَدَيْهِ فَتَجَافَى عَنْ جَنْبَيْهِ قَالَ ثُمَّ سَجَدَ فَأَمْكَنَ أَنْفَهُ وَجَبْهَتَهُ وَنَحَّى يَدَيْهِ عَنْ جَنْبَيْهِ وَوَضَعَ كَفَّيْهِ حَذْوَ مَنْكِبَيْهِ ثُمَّ رَفَعَ رَأْسَهُ حَتَّى رَجَعَ كُلُّ عَظْمٍ فِي مَوْضِعِهِ حَتَّى فَرَغَ ثُمَّ جَلَسَ فَافْتَرَشَ رِجْلَهُ الْيُسْرَى وَأَقْبَلَ بِصَدْرِ الْيُمْنَى عَلَى قِبْلَتِهِ وَوَضَعَ كَفَّهُ الْيُمْنَى عَلَى رُكْبَتِهِ الْيُمْنَى وَكَفَّهُ الْيُسْرَى عَلَى رُكْبَتِهِ الْيُسْرَى وَأَشَارَ بِأُصْبُعِهِ قَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ عُتْبَةُ بْنُ أَبِي حَكِيمٍ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى عَنْ الْعَبَّاسِ بْنِ سَهْلٍ لَمْ يَذْكُرْ التَّوَرُّكَ وَذَكَرَ نَحْوَ حَدِيثِ فُلَيْحٍ وَذَكَرَ الْحَسَنُ بْنُ الْحُرِّ نَحْوَ جِلْسَةِ حَدِيثِ فُلَيْحٍ وَعُتْبَةَ حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا بَقِيَّةُ حَدَّثَنِي عُتْبَةُ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عِيسَى عَنْ الْعَبَّاسِ بْنِ سَهْلٍ السَّاعِدِيِّ عَنْ أَبِي حُمَيْدٍ بِهَذَا الْحَدِيثِ قَالَ وَإِذَا سَجَدَ فَرَّجَ بَيْنَ فَخِذَيْهِ غَيْرَ حَامِلٍ بَطْنَهُ عَلَى شَيْءٍ مِنْ فَخِذَيْهِ قَالَ أَبُو دَاوُد رَوَاهُ ابْنُ الْمُبَارَكِ حَدَّثَنَا فُلَيْحٌ سَمِعْتُ عَبَّاسَ بْنَ سَهْلٍ يُحَدِّثُ فَلَمْ أَحْفَظْهُ فَحَدَّثَنِيهِ أُرَاهُ ذَكَرَ عِيسَى بْنَ عَبْدِ اللَّهِ أَنَّهُ سَمِعَهُ مِنْ عَبَّاسِ بْنِ سَهْلٍ قَالَ حَضَرْتُ أَبَا حُمَيْدٍ السَّاعِدِيَّ بِهَذَا الْحَدِيثِ حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا مُحَمَّدُ بْنُ جُحَادَةَ عَنْ عَبْدِ الْجَبَّارِ بْنِ وَائِلٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الْحَدِيثِ قَالَ فَلَمَّا سَجَدَ وَقَعَتَا رُكْبَتَاهُ إِلَى الْأَرْضِ قَبْلَ أَنْ تَقَعَ كَفَّاهُ قَالَ فَلَمَّا سَجَدَ وَضَعَ جَبْهَتَهُ بَيْنَ كَفَّيْهِ وَجَافَى عَنْ إِبِطَيْهِ قَالَ حَجَّاجٌ وَقَالَ هَمَّامٌ و حَدَّثَنَا شَقِيقٌ حَدَّثَنِي عَاصِمُ بْنُ كُلَيْبٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ هَذَا وَفِي حَدِيثِ أَحَدِهِمَا وَأَكْبَرُ عِلْمِي أَنَّهُ حَدِيثُ مُحَمَّدِ بْنِ جُحَادَةَ وَإِذَا نَهَضَ نَهَضَ عَلَى رُكْبَتَيْهِ وَاعْتَمَدَ عَلَى فَخِذِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Abu 'Ashim Adalah Dlahak bin Makhlad] dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dan ini adalah hadits (riwayat) Ahmad, dia berkata; telah mengabarkan kepada kami [Abdul Hamid yaitu Ibnu Ja'far] telah mengabarkan kepadaku [Muhammad bin Umar bin 'Atha`] dia berkata; saya mendengar [Abu Humaid As Sa'idi] berkata di tengah-tengah sepuluh sahabat Rasulullah shallallahu 'alaihi wasallam di antaranya adalah [Abu Qatadah], Abu Humaid berkata; \"Aku lebih mengetahui tentang sholat Rasulullah shallallahu 'alaihi wasallam.\" Mereka berkata; \"Kenapa demikian, demi Allah, padahal kamu bukanlah orang yang sering menyertai beliau dan bukan pula orang yang paling dahulu menjadi sahabat beliau daripada kami.\" Dia berkata; \"Ya, benar.\" Mereka berkata; \"Jika demikian, jelaskanlah.\" Abu Humaid berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam hendak memulai sholatnya, beliau mengangkat kedua tangan hingga sejajar dengan kedua bahunya, kemudian beliau bertakbir sehingga semua tulang beliau kembali pada tempat semula dengan lurus, lalu beliau membaca (bacaan sholat) kemudian beliau bertakbir sambil mengangkat kedua tangan sampai sejajar dengan kedua bahu, lalu ruku' dengan meletakkan kedua telapak tangan di atas kedua lutut, kemudian meluruskan (punggung dan kepala) tidak menundukkan kepala dan juga tidak menengadah. Setelah itu beliau mengangkat kepala sambil mengucapkan: \"Sami'allahu liman hamidah.\" Kemudian beliau mengangkat kedua tangan sehingga sejajar dengan kedua bahu sampai lurus, lalu mengucapkan: \"Allahu akbar.\" Setelah itu beliau turun ke lantai, lalu merenggangkan kedua tangannya dari kedua lambungnya, kemudian beliau mengangkat kepala dan melipat kaki kirinya dan mendudukinya, dengan membuka kedua jari-jari kakinya apabila bersujud, kemudian mengucapkan: \"Allahu akbar.\" Setelah itu, beliau mengangkat kepala dan melipat kaki kirinya serta mendudukinya, sehingga tulang beliau kembali ke posisinya, kemudian beliau mengerjakan seperti itu di raka'at yang lain. Apabila beliau berdiri setelah dua rakaat, beliau bertakbir dan mengangkat kedua tangan sampai sejajar dengan kedua bahu, sebagaimana beliau bertakbir ketika memulai sholat, beliau melakukan cara seperti itu pada sholat-sholat yang lain, dan ketika beliau duduk (tahiyyat) yang terdapat salam, beliau merubah posisi kaki kiri dan duduk secara tawaruk (duduk dengan posisi kaki kiri masuk ke kaki kanan).\" Setelah itu sepuluh sahabat tersebut berkata; \"Benar kamu, demikianlah Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat.\" Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Yazid yaitu Ibnu Abu Habib] dari [Muhammad bin 'Amru bin Halhalah] dari [Muhammad bin 'Amru Al 'Amiri] dia berkata; \"Aku berada di majlis para sahabat Nabi shallallahu 'alaihi wasallam, lalu mereka membicarakan sholat Rasulullah shallallahu 'alaihi wasallam.\" Abu Humaid mengatakan; \"…kemudian ia menyebutkan sebagian dari hadits ini.\" kata Abu Humaid selanjutnya; \"Apabila ruku', beliau merapatkan kedua telapak tangan pada kedua lututnya, merenggangkan jari jemarinya lalu membungkukkan punggung (secara rata), tidak menengadah dan tidak pula menundukkan kepalanya.\" Abu Humaid melanjutkan; \"Apabila beliau duduk dalam dua raka'at, beliau duduk di atas punggung telapak kaki kiri, dan menegakkan telapak kaki kanan. Sedangkan pada raka'at yang ke empat, beliau merapatkan pangkal paha yang kiri ke lantai, dan mengeluarkan kedua telapak kakinya menuju satu arah (yaitu di sebelah kanan).\" Telah menceritakan kepada kami [Isa bin Ibrahim Al Mishri] telah menceritakan kepada kami [Ibnu Wahb] dari [Al Laits bin Sa'd] dari [Yazid bin Muhammad Al Qurasyi] dan [Yazid bin Abu Habib] dari [Muhammad bin 'Amru bin Halhalah] dari [Muhammad bin 'Amru bin 'Atha`] seperti hadits ini, dia mengatakan; \"Apabila beliau sujud, beliau meletakkan kedua tangannya tanpa menghamparkan dan tidak pula merapatkan dan beliau menghadapkan jari-jari (kakinya) ke arah kiblat.\" Telah menceritakan kepada kami [Ali bin Al Husain bin Ibrahim] telah menceritakan kepada kami [Abu Badr] telah menceritakan kepadaku [Zuhair Abu Khaitsamah] telah menceritakan kepada kami [Al Hasan bin Al Hurr] telah menceritakan kepadaku [Isa bin Abdullah bin Malik] dari [Muhammad bin 'Amru bin 'Atha`] salah seorang dari Bani Malik, dari [Abbas atau 'Ayyasy bin Sahl As Sa'idi] bahwa dia menghadiri majlis yang terdapat ayahnya dan beberapa sahabat Nabi shallallahu 'alaihi wasallam, di dalam majlis itu pula terdapat Abu Hurairah, Abu Humaid As Sa'idi serta Abu Usaid dengan khabar (hadits) ini, dengan adanya penambahan atau pengurangan, dalam (riwayat itu), dia mengatakan; \"Kemudian beliau mengangkat kepalanya yaitu dari ruku' sambil mengucapkan; \"Sami'allahu liman hamidah, Allaumma rabbani walakal hamdu (Allah Maha mendengar terhadap siapa saja yang memuji-Nya, wahai rabb kami, hanya kepada-Mu lah segala puji-pujian).\" Dan mengangkat kedua tangannya sambil mengucapkan; \"Allahu akbar.\" Kemudian beliau sujud sambil menegakkan di atas telapak tangan dan kedua lututnya serta kedua telapak kakinya ketika beliau sedang sujud. Kemudian beliau bertakbir dan duduk tawaruk (duduk dengan posisi kaki kiri masuk ke kaki kanan) dan menegakkan telapak kakinya yang satu, kemudian beliau bertakbir lantas bersujud, lalu takbir yang di lanjutkan dengan berdiri, tidak duduk tawaruk (sebagaimana di awal) …\" kemudian dia melanjutkan redaksi haditsnya, dia melanjutkan; \"Kemudian beliau duduk setelah dua raka'at, sehingga ketika beliau hendak berdiri, beliau bertakbir terlebih dahulu, kemudian beliau menyempurnakan dua raka'at yang terakhir, dan tidak menyebutkan duduk tawaruk dalam tasyahud.\" Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Abdul Malik bin 'Amru] telah mengabarkan kepadaku [Fualaih] telah menceritakan kepadaku ['Abbas bin Sahl] dia berkata; \"Abu Humaid, Abu Usaid, Sahl bin Sa'd dan Muhammad bin Maslamah bermajlis dan menyebutkan tata cara sholat Rasulullah shallallahu 'alaihi wasallam, [Abu Humaid] mengatakan; \"Aku adalah orang yang paling mengetahui tata cara sholat Rasulullah shallallahu 'alaihi wasallam.\" lalu dia menyebutkan sebagian dari hadits ini, katanya; \"Kemudian beliau ruku' dengan meletakkan kedua tangannya pada kedua lututnya seakan-akan beliau menggenggamnya, dan mengikatkan kedua tangannya seperti tali lalu merenggangkannya dari kedua lambungnya.\" Selanjutnya dia berkata; \"kemudian beliau sujud, dengan merapatkan hidung dan dahinya (ke lantai), dan merenggangkan kedua tangannya dari kedua lambungnya serta meletakkan kedua telapak tangan sejajar dengan kedua pundak. Setelah itu beliau mengangkat kepalanya (duduk di antara dua sujud) sehingga tulang beliau kembali ke posisi semula, seusainya (sujud) beliau duduk iftirasy (duduk di atas kaki kiri) dengan menghadapkan punggung kaki kanan ke arah kiblat, dan meletakkan kaki kanan di atas lutut kanan, dan telapak tangan kiri di atas lutut kiri, sambil menunjuk dengan jari (telunjuk) nya.\" Abu Daud mengatakan; \"Hadits ini di riwayatkan oleh ['Utbah bin Abu Hakim] dari [Abdullah bin Isa] dari ['Abbas bin Sahl], namun dia tidak menyebutkan (duduk) tawaruk, lalu dia menyebutkan sebagaimana hadits (riwayat) Fulaih.\" Sedangkan Al Hasan bin Al Hur menyebutkan posisi duduk sebagaimana hadits (riwayatnya) Fulaih dan 'Utbah.\" Telah menceritakan kepada kami ['Amru bin Utsman] telah menceritakan kepada kami [Baqiyah] telah menceritakan kepadaku [Utbah] telah menceritakan kepadaku [Abdullah bin Isa] dari [Al 'Abbas bin Sahl As Sa'idi] dari [Abu Humaid] dengan hadits seperti ini, katanya; \"Apabila beliau sujud, beliau merenggangkan kedua pahanya tanpa memikul beban perutnya.\" Abu Daud mengatakan; \"Hadits ini juga di riwayatka oleh [Ibnu Mubarrak], telah menceritakan kepada kami [Fulaih] saya mendengar ['Abbas bin Sahl] menceritakan (hadits ini), namun aku tidak hafal. Dan telah menceritakan kepadaku sepertinya ia menyebut Isa bin Abdullah bahwa dia pernah mendengar dari Abbas bin Sahl dia berkata; \"Aku memaparkan hadits ini kepada Abu Humaid As Sa'idi, telah menceritakan kepada kami [Muhammad bin Ma'mar] telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Muhammad bin Juhadah] dari [Abdul Jabbar bin Wa`il] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam mengenai hadits ini, katanya; \"Ketika beliau sujud, beliau menempelkan kedua lututnya ke lantai sebelum meletakkan kedua telapak tangannya (ke lantai), katanya lagi; \"Ketika beliau sujud, beliau meletakkan mukanya di antara kedua telapak tangannya dan merenggangkan kedua ketiaknya.\" Telah berkata [Hajjaj]; [Hammam] berkata; dan telah menceritakan kepada kami [Syaqiq] telah menceritakan kepadaku ['Ashim bin Kulaib] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam seperti (hadits) ini, dan di antara salah satu dari hadits tersebut yang lebih aku yakini adalah hadits Muhammad bin Juhadah yaitu; \"Apabila beliau hendak bangkit (untuk berdiri), beliau bangkit di atas kedua lututnya dengan bersandarkan pada kedua pahanya.\""
            },
            {
                "number": 615,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ فِطْرٍ عَنْ عَبْدِ الْجَبَّارِ بْنِ وَائِلٍ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ إِبْهَامَيْهِ فِي الصَّلَاةِ إِلَى شَحْمَةِ أُذُنَيْهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdullah bin Daud] dari [Fithr] dari [Abdul Jabbar bin Wa'il] dari [ayahnya] dia berkata; saya melihat Rasulullah shallallahu 'alaihi wasallam mengangkat kedua jempol jarinya sejajar dengan kedua telinga ketika sholat.\""
            },
            {
                "number": 616,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِي أَبِي عَنْ جَدِّي عَنْ يَحْيَى بْنِ أَيُّوبَ عَنْ عَبْدِ الْمَلِكِ بْنِ عَبْدِ الْعَزِيزِ بْنِ جُرَيْجٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَبَّرَ لِلصَّلَاةِ جَعَلَ يَدَيْهِ حَذْوَ مَنْكِبَيْهِ وَإِذَا رَكَعَ فَعَلَ مِثْلَ ذَلِكَ وَإِذَا رَفَعَ لِلسُّجُودِ فَعَلَ مِثْلَ ذَلِكَ وَإِذَا قَامَ مِنْ الرَّكْعَتَيْنِ فَعَلَ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin Syu'aib bin Al Laits] telah menceritakan kepadaku [ayahku] dari [kakekku] dari [Yahya bin Ayyub] dari [Abdul Malik bin Abdul Aziz bin Juraij] dari [Ibnu Syihab] dari [Abu Bakar bin Abdurrahman bin Al Harits bin Hisyam] dari [Abu Hurairah] dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam bertakbir untuk melaksanakan sholat, beliau mengangkat kedua tangannya hingga sejajar dengan kedua bahunya, begitu juga ketika hendak ruku', beliau juga melakukan seperti itu, apabila hendak sujud, juga apabila berdiri dari raka'at kedua, beliau juga melakukan seperti itu.\""
            },
            {
                "number": 617,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ أَبِي هُبَيْرَةَ عَنْ مَيْمُونٍ الْمَكِّيِّأَنَّهُ رَأَى عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ وَصَلَّى بِهِمْ يُشِيرُ بِكَفَّيْهِ حِينَ يَقُومُ وَحِينَ يَرْكَعُ وَحِينَ يَسْجُدُ وَحِينَ يَنْهَضُ لِلْقِيَامِ فَيَقُومُ فَيُشِيرُ بِيَدَيْهِ فَانْطَلَقْتُ إِلَى ابْنِ عَبَّاسٍ فَقُلْتُ إِنِّي رَأَيْتُ ابْنَ الزُّبَيْرِ صَلَّى صَلَاةً لَمْ أَرَ أَحَدًا يُصَلِّيهَا فَوَصَفْتُ لَهُ هَذِهِ الْإِشَارَةَ فَقَالَ إِنْ أَحْبَبْتَ أَنْ تَنْظُرَ إِلَى صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاقْتَدِ بِصَلَاةِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Abu Hubairah] dari [Maimun Al Makki] bahwa dirinya melihat Maimun bin Zubair mengerjakan sholat bersama mereka (orang-orang) seraya mengangkat kedua tangannya ketika berdiri, ruku', sujud, lalu berdiri sambil mengangkat kedua tangannya. Lalu aku menemui Ibnu Abbas, kataku; \"Aku pernah melihat Ibnu Zubair mengerjakan sholat yang aku belum pernah melihat seseorang mengerjakan sholat seperti dirinya.\" Sambil mengisyaratkan dengan mengangkat tangan ini kepada Ibnu Abbas, maka [Ibnu Abbas] menjawab; \"Jika kamu ingin melihat tata cara sholat Rasulullah shallallahu 'alaihi wasallam, maka ikutilah tata cara sholat Abdullah bin Zubair.\""
            },
            {
                "number": 618,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَمُحَمَّدُ بْنُ أَبَانَ الْمَعْنَى قَالَا حَدَّثَنَا النَّضْرُ بْنُ كَثِيرٍ يَعْنِي السَّعْدِيَّ قَالَصَلَّى إِلَى جَنْبِي عَبْدُ اللَّهِ بْنُ طَاوُسٍ فِي مَسْجِدِ الْخَيْفِ فَكَانَ إِذَا سَجَدَ السَّجْدَةَ الْأُولَى فَرَفَعَ رَأْسَهُ مِنْهَا رَفَعَ يَدَيْهِ تِلْقَاءَ وَجْهِهِ فَأَنْكَرْتُ ذَلِكَ فَقُلْتُ لِوُهَيْبِ بْنِ خَالِدٍ فَقَالَ لَهُ وُهَيْبُ بْنُ خَالِدٍ تَصْنَعُ شَيْئًا لَمْ أَرَ أَحَدًا يَصْنَعُهُ فَقَالَ ابْنُ طَاوُسٍ رَأَيْتُ أَبِي يَصْنَعُهُ وَقَالَ أَبِي رَأَيْتُ ابْنَ عَبَّاسٍ يَصْنَعُهُ وَلَا أَعْلَمُ إِلَّا أَنَّهُ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُهُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Muhammad bin Aban] sedangkan maksud haditsnya sama, keduanya berkata; telah menceritakan kepada kami [An Nadlr bin Katsir yaitu As Sa'di] dia berkata; Abdullah bin Thawus sholat di sampingku di masjid Khaif, apabila dia sujud pada sujud pertama, lalu bangkit dari sujudnya, dia mengangkat kedua tangannya ke depan mukanya, lalu aku pun mengingkari perbuatannya, setelah itu aku adukan hal tersebut kepada Wuhaib bin Khalid, maka Wuhaib bin khalid berkata kepadanya; \"Kamu telah melakukan sesuatu yang belum pernah aku melihat seorangpun melakukannya.\" [Ibnu Thawus] menjawab; \"Aku pernah melihat ayahku melakukannya, kata [ayahku]; \"Aku melihat [Ibnu Abbas] melakukan hal itu, namun aku tidak mengetahui kecuali dia berkata bahwa Nabi shallallahu 'alaihi wasallam juga melakukan hal itu.\""
            },
            {
                "number": 619,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّهُ كَانَ إِذَا دَخَلَ فِي الصَّلَاةِ كَبَّرَ وَرَفَعَ يَدَيْهِ وَإِذَا رَكَعَ وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ وَإِذَا قَامَ مِنْ الرَّكْعَتَيْنِ رَفَعَ يَدَيْهِ وَيَرْفَعُ ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ أَبُو دَاوُد الصَّحِيحُ قَوْلُ ابْنِ عُمَرَ لَيْسَ بِمَرْفُوعٍ قَالَ أَبُو دَاوُد وَرَوَى بَقِيَّةُ أَوَّلَهُ عَنْ عُبَيْدِ اللَّهِ وَأَسْنَدَهُ وَرَوَاهُ الثَّقَفِيُّ عَنْ عُبَيْدِ اللَّهِ وَأَوْقَفَهُ عَلَى ابْنِ عُمَرَ قَالَ فِيهِ وَإِذَا قَامَ مِنْ الرَّكْعَتَيْنِ يَرْفَعُهُمَا إِلَى ثَدْيَيْهِ وَهَذَا هُوَ الصَّحِيحُ قَالَ أَبُو دَاوُد وَرَوَاهُ اللَّيْثُ بْنُ سَعْدٍ وَمَالِكٌ وَأَيُّوبُ وَابْنُ جُرَيْجٍ مَوْقُوفًا وَأَسْنَدَهُ حَمَّادُ بْنُ سَلَمَةَ وَحْدَهُ عَنْ أَيُّوبَ وَلَمْ يَذْكُرْ أَيُّوبُ وَمَالِكٌ الرَّفْعَ إِذَا قَامَ مِنْ السَّجْدَتَيْنِ وَذَكَرَهُ اللَّيْثُ فِي حَدِيثِهِ قَالَ ابْنُ جُرَيْجٍ فِيهِ قُلْتُ لِنَافِعٍ أَكَانَ ابْنُ عُمَرَ يَجْعَلُ الْأُولَى أَرْفَعَهُنَّ قَالَ لَا سَوَاءً قُلْتُ أَشِرْ لِي فَأَشَارَ إِلَى الثَّدْيَيْنِ أَوْ أَسْفَلَ مِنْ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Nahsr bin Ali] telah mengabarkan kepada kami [Abdul A'laa] telah menceritakan kepada kami ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwa apabila dia hendak melaksanakan sholat, dia bertakbir sambil mengangkat kedua tangannya, (begitu juga) ketika ruku', ketika mengucapkan sami'allahu liman hamidah, ketika berdiri dari raka'at kedua beliau juga mengangkat kedua tangannya.\" Dia merafa'kan (mengangkat hadits ini) kepada Rasulullah shallallahu 'alaihi wasallam.\" Abu Daud mengatakan; \"Yang shahih adalah perkataannya Ibnu Umar, bukan sampai kepada Nabi shallallahu 'alaihi wasallam. ' Abu Daud mengatakan; \"Sedangkan di awal-awal hadits (yaitu tanpa menyebutkan \"Apabila berdiri dari raka'at kedua -pent) telah di riwayatkan oleh [Baqiyyah] dari ['ubaidhullah] dan ia merafa'kannya (bersambung sampai kepada Nabi -pent) kepada Nabi shallallahu 'alaihi wasallam. Dan di riwayatkan pula oleh [Ats Tsaqafi] dari ['ubaidhullah], namun ia hanya mewaqafkan sampai kepada [Ibnu Umar], katanya; \"Apabila beliau hendak berdiri di raka'at kedua, beliau mengangkat kedua tangannya sampai kedua susunya (dadanya), inilah (di antara riwayat) yang shahih.\" Abu Daud berkata; \"Dan di riwayatkan pula oleh [Al Laits bin Sa'd], [Malik], [Ayyub] serta [Ibnu Juraij] secara mauquf, namun [Hammad bin Salamah] saja yang menyambungnya (hingga kepada Nabi) dari [Ayyub], sedangkan Malik dan Ayyub tidak merafa'kan lafadz; \"Apabila beliau hendak bangkit dari sujud kedua.\" Al Laits juga menyebutkan dalam haditsnya seperti ini.\" Ibnu Juraij juga mengatakan; kataku kepada Nafi'; \"Apakah ibnu Umar mengangkat (kedua tangannya) lebih tinggi (dari dada)?\" jawabnya; \"Tidak, namun sejajar (dengan dada).\" Kataku; \"Jelaskanlah padaku!.\" Kemudian Nafi' memberi isyarat pada kedua susunya (dadanya) atau lebih rendah darinya.\""
            },
            {
                "number": 620,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَكَانَ إِذَا ابْتَدَأَ الصَّلَاةَ يَرْفَعُ يَدَيْهِ حَذْوَ مَنْكِبَيْهِ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ رَفَعَهُمَا دُونَ ذَلِكَقَالَ أَبُو دَاوُد لَمْ يَذْكُرْ رَفَعَهُمَا دُونَ ذَلِكَ أَحَدٌ غَيْرُ مَالِكٍ فِيمَا أَعْلَمُ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Nafi'] bahwa; \"Apabila [Ibnu Umar] hendak memulai sholatnya, dia mengangkat kedua tangannya sejajar dengan kedua bahunya, apabila mengangkat kepalanya dari ruku' (i'tidal), dia juga mengangkat kedua tangannya lebih rendah dari itu.\" Abu Daud mengatakan; 'yang saya ketahui, tidak ada Perawi satu pun yang menyebutkan; \"Mengangkat keduanya lebih rendah dari itu\" selain Malik.\""
            },
            {
                "number": 621,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عُبَيْدٍ الْمُحَارِبِيُّ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ مِنْ الرَّكْعَتَيْنِ كَبَّرَ وَرَفَعَ يَدَيْهِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Muhammad bin 'Ubaid Al Muharibi] keduanya berkata; telah menceritakan kepada kami [Muhammad bin Fudlail] dari ['Ashim bin Kulaib] dari [Muharib bin Ditsar] dari [Ibnu Umar] dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam bangkit dari raka'at kedua, beliau bertakbir sambil mengangkat kedua tangannya.\""
            },
            {
                "number": 622,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْهَاشِمِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ بْنِ رَبِيعَةَ بْنِ الْحَارِثِ بْنِ عَبْدِ الْمُطَّلِبِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَعْرَجِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا قَامَ إِلَى الصَّلَاةِ الْمَكْتُوبَةِ كَبَّرَ وَرَفَعَ يَدَيْهِ حَذْوَ مَنْكِبَيْهِ وَيَصْنَعُ مِثْلَ ذَلِكَ إِذَا قَضَى قِرَاءَتَهُ وَأَرَادَ أَنْ يَرْكَعَ وَيَصْنَعُهُ إِذَا رَفَعَ مِنْ الرُّكُوعِ وَلَا يَرْفَعُ يَدَيْهِ فِي شَيْءٍ مِنْ صَلَاتِهِ وَهُوَ قَاعِدٌ وَإِذَا قَامَ مِنْ السَّجْدَتَيْنِ رَفَعَ يَدَيْهِ كَذَلِكَ وَكَبَّرَقَالَ أَبُو دَاوُد فِي حَدِيثِ أَبِي حُمَيْدٍ السَّاعِدِيِّ حِينَ وَصَفَ صَلَاةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ مِنْ الرَّكْعَتَيْنِ كَبَّرَ وَرَفَعَ يَدَيْهِ حَتَّى يُحَاذِيَ بِهِمَا مَنْكِبَيْهِ كَمَا كَبَّرَ عِنْدَ افْتِتَاحِ الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Sulaiman bin Daud Al Hasyimi] telah menceritakan kepada kami [Abdurrahman bin Abu Az Zinnad] dari [Musa bin 'Uqbah] dari [Abdullah bin Al Fadl bin Rabi'ah bin Al Harits bin Abdul Mutthalib] dari [Abdurrahman bin Al A'raj] dari ['ubaidhullah bin Abu Rafi'] dari [Ali bin Abu Thalib radliallahu 'anhu] dari Rasulullah shallallahu 'alaihi wasallam; bahwa apabila beliau berdiri untuk melaksanakan sholat wajib, beliau bertakbir dengan mengangkat kedua tangannya sejajar dengan kedua bahunya, beliau melakukan seperti itu apabila selesai membaca surat dan hendak ruku', demikian juga apabila bangkit dari ruku'. Beliau tidak pernah sama sekali mengangkat kedua tangannya dalam ketika mengerjakan sholat dengan posisi duduk. Apabila bangkit dari sujud kedua, beliau mengangkat kedua tangannya lagi sambil mengucapkan takbir.\" Abu Daud berkata; \"Dalam hadits Abu Humaid As Sa'idi ketika dia mensifati sifat sholat Nabi shallallahu 'alaihi wasallam, yaitu; \"Apabila beliau berdiri dari raka'at kedua, beliau bertakbir sambil mengangkat kedua tangannya hingga sejajar dengan kedua bahunya, sebagaimana beliau takbir ketika memulai sholat.\""
            },
            {
                "number": 623,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ نَصْرِ بْنِ عَاصِمٍ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ إِذَا كَبَّرَ وَإِذَا رَكَعَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ حَتَّى يَبْلُغَ بِهِمَا فُرُوعَ أُذُنَيْهِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Nashr bin 'Ashim] dari [Malik bin Al Huwairits] dia berkata; \"Aku melihat Nabi shallallahu 'alaihi wasallam mengangkat kedua tangannya ketika bertkbir, ruku', dan ketika mengangkat kepalanya dari ruku' (i'tidal) hingga mencapai kedua ujung telinganya.\""
            },
            {
                "number": 624,
                "arab": "حَدَّثَنَا ابْنُ مُعَاذٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا مُوسَى بْنُ مَرْوَانَ حَدَّثَنَا شُعَيْبٌ يَعْنِي ابْنَ إِسْحَقَ الْمَعْنَى عَنْ عِمْرَانَ عَنْ لَاحِقٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ قَالَ قَالَ أَبُو هُرَيْرَةَلَوْ كُنْتُ قُدَّامَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَرَأَيْتُ إِبِطَيْهِ زَادَ عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ قَالَ يَقُولُ لَاحِقٌ أَلَا تَرَى أَنَّهُ فِي الصَّلَاةِ وَلَا يَسْتَطِيعُ أَنْ يَكُونَ قُدَّامَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَزَادَ مُوسَى بْنُ مَرْوَانَ الرَّقِّيُّ يَعْنِي إِذَا كَبَّرَ رَفَعَ يَدَيْهِ",
                "id": "Telah menceritakan kepada kami [Ibnu Mu'adz] telah menceritakan kepada kami [ayahku], dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Musa bin Marwan] telah menceritakan kepada kami [Syu'aib yaitu Ibnu Ishaq] sedangkan ma'na haditsnya dari ['Imran] dari [Lahiq] dari [Basyir bin Nahik] dia berkata; [Abu Hurairah] berkata; \"Sekiranya aku berada di depan Nabi shallallahu 'alaihi wasallam (sewaktu mengangkat kedua tangan), niscaya ketiak beliau akan terlihat olehku.\" 'ubaidhullah bin Mu'adz menambahkan; Lahiq berkata; \"Tidakkah kamu tahu bahwa dia itu sedang sholat, oleh karena itu dia tidak bisa berada di depan Rasulullah shallallahu 'alaihi wasallam?.\" Marwan bin Ar Raqi menambahkan; \"yang di maksud ketika beliau bertakbir dan mengangkat kedua tangannya.\""
            },
            {
                "number": 625,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ عَلْقَمَةَ قَالَ قَالَ عَبْدُ اللَّهِعَلَّمَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةَ فَكَبَّرَ وَرَفَعَ يَدَيْهِ فَلَمَّا رَكَعَ طَبَّقَ يَدَيْهِ بَيْنَ رُكْبَتَيْهِ قَالَ فَبَلَغَ ذَلِكَ سَعْدًا فَقَالَ صَدَقَ أَخِي قَدْ كُنَّا نَفْعَلُ هَذَا ثُمَّ أَمَرَنَا بِهَذَا يَعْنِي الْإِمْسَاكَ عَلَى الرُّكْبَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Ibnu Idris] dari ['Ashim bin Kulaib] dari [Abdurrahman bin Al Aswad] dari ['Alqamah] dia berkata; [Abdullah] berkata; Rasulullah shallallahu 'alaihi wasallam mengajari kami sholat, beliau takbir sambil mengangkat kedua tangannya, dan ketika ruku', beliau mencengkramkan kedua tangannya pada kedua lututnya.\" Kata 'Alqamah; \"ternyata hal itu sampai kepada Sa'd, maka dia berkata; \"Saudaraku benar, kami memang melakukan hal itu, kemudian kami diperintahkan untuk mengerjakannya yaitu memegang kedua lutut.\""
            },
            {
                "number": 626,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَاصِمٍ يَعْنِي ابْنَ كُلَيْبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ عَلْقَمَةَ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍأَلَا أُصَلِّي بِكُمْ صَلَاةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَصَلَّى فَلَمْ يَرْفَعْ يَدَيْهِ إِلَّا مَرَّةًقَالَ أَبُو دَاوُد هَذَا حَدِيثٌ مُخْتَصَرٌ مِنْ حَدِيثٍ طَوِيلٍ وَلَيْسَ هُوَ بِصَحِيحٍ عَلَى هَذَا اللَّفْظِ",
                "id": "Telah menceritakan kepada kami ['Utsman bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari ['Ashim yaitu Ibnu Kuliab] dari [Abdurrahman bin Al Aswad] dari ['Alqamah] dia berkata; [Abdullah bin Mas'ud] berkata: \"Maukah kalian aku ajarkan bersama kalian sholat Rasulullah shallallahu 'alaihi wasallam?\" lalu dia sholat dan tidak mengangkat kedua tangannya kecuali hanya sekali saja.\" Abu Daud berkata; \"Hadits ini adalah ringkasan dari hadits yang panjang dan di pandang tidak shahih dari redaksi tersebut.\""
            },
            {
                "number": 627,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ حَدَّثَنَا شَرِيكٌ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا افْتَتَحَ الصَّلَاةَ رَفَعَ يَدَيْهِ إِلَى قَرِيبٍ مِنْ أُذُنَيْهِ ثُمَّ لَا يَعُودُحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ حَدَّثَنَا سُفْيَانُ عَنْ يَزِيدَ نَحْوَ حَدِيثِ شَرِيكٍ لَمْ يَقُلْ ثُمَّ لَا يَعُودُ قَالَ سُفْيَانُ قَالَ لَنَا بِالْكُوفَةِ بَعْدُ ثُمَّ لَا يَعُودُ قَالَ أَبُو دَاوُد وَرَوَى هَذَا الْحَدِيثَ هُشَيْمٌ وَخَالِدٌ وَابْنُ إِدْرِيسَ عَنْ يَزِيدَ لَمْ يَذْكُرُوا ثُمَّ لَا يَعُودُ حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا مُعَاوِيَةُ وَخَالِدُ بْنُ عَمْرٍو وَأَبُو حُذَيْفَةَ قَالُوا حَدَّثَنَا سُفْيَانُ بِإِسْنَادِهِ بِهَذَا قَالَ فَرَفَعَ يَدَيْهِ فِي أَوَّلِ مَرَّةٍ وَقَالَ بَعْضُهُمْ مَرَّةً وَاحِدَةً",
                "id": "Telah menceritakan kepada kami [Muhammad bin As Shabah Al Bazzaz] telah menceritakan kepada kami [Syarik] dari [Yazid bin Abu Ziyad] dari [Abdurrahman bin Abu Laila] dari [Al Barra`] bahwa; \"Apabila Rasulullah shallallahu 'alaihi wasallam memulai sholat, beliau mengangkat kedua tangannya sampai mendekati kedua telinganya, dan tidak mengulanginya lagi (hanya sekali).\" Telah menceritakan kepada kami [Abdullah bin Muhammad Az Zuhri] telah menceritakan kepada kami [Sufyan] dari [Yazid] seperti haditsnya Syarik, namun dia tidak mengatakan; \"Dan beliau tidak mengulanginya lagi.\" Sufyan mengatakan; \"Setelah itu dia mengatakan kepada kami; \"Dan beliau tidak mengulanginya lagi\" ketika berada di Kufah.\" Abu Daud mengatakan; \"Hadits ini di riwayatkan pula oleh [Husyaim], [Khalid] dan [Ibdu Idris] dari [Yazid], namun mereka tidak menyebutkan; \"Dan beliau tidak mengulanginya lagi.\" Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Mu'awiyah] dan [Khalid bin 'Amru] serta [Abu Hudzaifah] mereka mengatakan; telah menceritakan kepada kami [Sufyan] dengan isnad seperti ini, katanya; \"Beliau mengangkat kedua tangannya di awal kali.\" sebagian yang lain mengatakan; \"Satu kali.\""
            },
            {
                "number": 628,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا وَكِيعٌ عَنْ ابْنِ أَبِي لَيْلَى عَنْ أَخِيهِ عِيسَى عَنْ الْحَكَمِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَفَعَ يَدَيْهِ حِينَ افْتَتَحَ الصَّلَاةَ ثُمَّ لَمْ يَرْفَعْهُمَا حَتَّى انْصَرَفَقَالَ أَبُو دَاوُد هَذَا الْحَدِيثُ لَيْسَ بِصَحِيحٍ",
                "id": "Telah menceritakan kepada kami [Husain bin Abdurrahman] telah mengabarkan kepada kami [Waki'] dari [Ibnu Abu Laila] dari [Saudaranya yaitu Isa] dari [Al Hakam] dari [Abdurrahman bin Abu Laila] dari [Al Barra` bin 'Azib] dia berkata; saya melihat Rasulullah shallallahu 'alaihi wasallam mengangkat kedua tangannya ketika memulai sholat, kemudian beliau tidak mengangkatnya hingga selesai sholat.\" Abu Daud mengakata; \"Hadits ini tidak shahih.\""
            },
            {
                "number": 629,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ سَعِيدِ بْنِ سَمْعَانَ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ فِي الصَّلَاةِ رَفَعَ يَدَيْهِ مَدًّا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Abu Dzi`b] dari [Sa'id bin Sam'an] dari [Abu Hurairah] dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam telah masuk sholat, beliau mengangkat tinggi-tinggi kedua tangannya.\""
            },
            {
                "number": 630,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا أَبُو أَحْمَدَ عَنْ الْعَلَاءِ بْنِ صَالِحٍ عَنْ زُرْعَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالَ سَمِعْتُ ابْنَ الزُّبَيْرِ يَقُولُصَفُّ الْقَدَمَيْنِ وَوَضْعُ الْيَدِ عَلَى الْيَدِ مِنْ السُّنَّةِ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah mengabarkan kepada kami [Abu Ahmad] dari [Al 'Ala` bin Shalih] dari [Zur'ah bin Abdurrahman] dia berkata; aku mendengar [Ibnu Zubair] berkata; \"Meluruskan kedua kaki dan meletekkan tangan (kanan) diatas tangan yang lain (kiri) adalah bagian dari sunnah.\""
            },
            {
                "number": 631,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارِ بْنِ الرَّيَّانِ عَنْ هُشَيْمِ بْنِ بَشِيرٍ عَنْ الْحَجَّاجِ بْنِ أَبِي زَيْنَبَ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ ابْنِ مَسْعُودٍأَنَّهُ كَانَ يُصَلِّي فَوَضَعَ يَدَهُ الْيُسْرَى عَلَى الْيُمْنَى فَرَآهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَضَعَ يَدَهُ الْيُمْنَى عَلَى الْيُسْرَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Bakkar bin Ar Rayyan] dari [Husyaim bin Basyir] dari [Al Hajjaj bin Abu Zainab] dari [Abu Utsman An Nahdi] dari [Ibnu Mas'ud] bahwa dia sholat dengan meletakkan tangan kirinya diatas tangan kanannya, ternyata dia dilihat Nabi shallallahu 'alaihi wasallam, kontan beliau meletakkan tangan kanannya diatas tangan kirinya.\""
            },
            {
                "number": 632,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مَحْبُوبٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ عَنْ زِيَادِ بْنِ زَيْدٍ عَنْ أَبِي جُحَيْفَةَ أَنَّ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ قَالَمِنْ السُّنَّةِ وَضْعُ الْكَفِّ عَلَى الْكَفِّ فِي الصَّلَاةِ تَحْتَ السُّرَّةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Mahbub] telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Abdurrahman bin Ishaq] dari [Ziyad bin Zaid] dari [Abu Juhaifah] bahwa [Ali radliallahu 'anhu] berkata; \"Termasuk dari sunnah adalah meletakkan telapak tangan di atas telapak tangan yang lain di bawah pusar dalam sholat.\""
            },
            {
                "number": 633,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ قُدَامَةَ يَعْنِي ابْنَ أَعْيَنَ عَنْ أَبِي بَدْرٍ عَنْ أَبِي طَالُوتَ عَبْدِ السَّلَامِ عَنْ ابْنِ جَرِيرٍ الضَّبِّيِّ عَنْ أَبِيهِ قَالَ رَأَيْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُيُمْسِكُ شِمَالَهُ بِيَمِينِهِ عَلَى الرُّسْغِ فَوْقَ السُّرَّةِقَالَ أَبُو دَاوُد وَرُوِيَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ فَوْقَ السُّرَّةِ قَالَ أَبُو مِجْلَزٍ تَحْتَ السُّرَّةِ وَرُوِيَ عَنْ أَبِي هُرَيْرَةَ وَلَيْسَ بِالْقَوِيِّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Qudamah yaitu Ibnu A'yan] dari [Abu Badr] dari [Abu Thalut Abdussalam] dari [Ibnu Jarir Ad Dhabbi] dari [ayahnya] dia berkata; \"Aku melihat tangan kanan [Ali radliallahu 'anhu] memegang tangan kirinya pada pergelangannya diatas pusar.\" Abu Daud berkata; \"Dan diriwayatkan dari Sa'id bin Jubair \"diatas pusar\". Abu Mijlaz mengatakan; \"dibawah pusar.\" Dan di riwayatkan dari Abu Hurairah, namun sanadnya tidak kuat.\""
            },
            {
                "number": 634,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ الْكُوفِيِّ عَنْ سَيَّارٍ أَبِي الْحَكَمِ عَنْ أَبِي وَائِلٍ قَالَ قَالَ أَبُو هُرَيْرَةَأَخْذُ الْأَكُفِّ عَلَى الْأَكُفِّ فِي الصَّلَاةِ تَحْتَ السُّرَّةِقَالَ أَبُو دَاوُد سَمِعْت أَحْمَدَ بْنَ حَنْبَلٍ يُضَعِّفُ عَبْدَ الرَّحْمَنِ بْنَ إِسْحَقَ الْكُوفِيَّ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdul Wahid bin Ziyad] dari [Abdurrahman bin Ishaq Al Kuffi] dari [Sayyar Abu Al Hakam] dari [Abu Wa'il] dia berkata; [Abu Hurairah] berkata; \"Letakkanlah telapak tangan di atas telapak tangan yang lain di bawah pusar ketika sholat.\" Abu Daud berkata; \"Aku mendengar Ahmad bin Hambal melemahkan Abdurrahman bin Ishak Al Kufi.\""
            },
            {
                "number": 635,
                "arab": "حَدَّثَنَا أَبُو تَوْبَةَ حَدَّثَنَا الْهَيْثَمُ يَعْنِي ابْنَ حُمَيْدٍ عَنْ ثَوْرٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ طَاوُسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَضَعُ يَدَهُ الْيُمْنَى عَلَى يَدِهِ الْيُسْرَى ثُمَّ يَشُدُّ بَيْنَهُمَا عَلَى صَدْرِهِ وَهُوَ فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Abu Taubah] telah menceritakan kepada kami [Al Haitsam yaitu Ibnu Humaid] dari [Tsaur] dari [Sulaiman bin Musa] dari [Thawus] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam meletakkan tangan kanannya diatas tangan kiri, kemudian menarik keduanya diatas dada ketika sholat.\""
            },
            {
                "number": 636,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي سَلَمَةَ عَنْ عَمِّهِ الْمَاجِشُونِ بْنِ أَبِي سَلَمَةَ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ إِلَى الصَّلَاةِ كَبَّرَ ثُمَّ قَالَ{ وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالْأَرْضَ حَنِيفًا }مُسْلِمًا وَمَا أَنَا مِنْ الْمُشْرِكِينَ{ إِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ لَا شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا أَوَّلُ الْمُسْلِمِينَ }اللَّهُمَّ أَنْتَ الْمَلِكُ لَا إِلَهَ لِي إِلَّا أَنْتَ أَنْتَ رَبِّي وَأَنَا عَبْدُكَ ظَلَمْتُ نَفْسِي وَاعْتَرَفْتُ بِذَنْبِي فَاغْفِرْ لِي ذُنُوبِي جَمِيعًا إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ وَاهْدِنِي لِأَحْسَنِ الْأَخْلَاقِ لَا يَهْدِي لِأَحْسَنِهَا إِلَّا أَنْتَ وَاصْرِفْ عَنِّي سَيِّئَهَا لَا يَصْرِفُ سَيِّئَهَا إِلَّا أَنْتَ لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ كُلُّهُ فِي يَدَيْكَ وَالشَّرُّ لَيْسَ إِلَيْكَ أَنَا بِكَ وَإِلَيْكَ تَبَارَكْتَ وَتَعَالَيْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ وَإِذَا رَكَعَ قَالَ اللَّهُمَّ لَكَ رَكَعْتُ وَبِكَ آمَنْتُ وَلَكَ أَسْلَمْتُ خَشَعَ لَكَ سَمْعِي وَبَصَرِي وَمُخِّي وَعِظَامِي وَعَصَبِي وَإِذَا رَفَعَ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ مِلْءَ السَّمَوَاتِ وَالْأَرْضِ وَمِلْءَ مَا بَيْنَهُمَا وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ وَإِذَا سَجَدَ قَالَ اللَّهُمَّ لَكَ سَجَدْتُ وَبِكَ آمَنْتُ وَلَكَ أَسْلَمْتُ سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَصَوَّرَهُ فَأَحْسَنَ صُورَتَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ وَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ وَإِذَا سَلَّمَ مِنْ الصَّلَاةِ قَالَ اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ وَمَا أَسْرَفْتُ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي أَنْتَ الْمُقَدِّمُ وَالْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْهَاشِمِيُّ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ بْنِ رَبِيعَةَ بْنِ الْحَارِثِ بْنِ عَبْدِ الْمُطَّلِبِ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا قَامَ إِلَى الصَّلَاةِ الْمَكْتُوبَةِ كَبَّرَ وَرَفَعَ يَدَيْهِ حَذْوَ مَنْكِبَيْهِ وَيَصْنَعُ مِثْلَ ذَلِكَ إِذَا قَضَى قِرَاءَتَهُ وَإِذَا أَرَادَ أَنْ يَرْكَعَ وَيَصْنَعُهُ إِذَا رَفَعَ مِنْ الرُّكُوعِ وَلَا يَرْفَعُ يَدَيْهِ فِي شَيْءٍ مِنْ صَلَاتِهِ وَهُوَ قَاعِدٌ وَإِذَا قَامَ مِنْ السَّجْدَتَيْنِ رَفَعَ يَدَيْهِ كَذَلِكَ وَكَبَّرَ وَدَعَا نَحْوَ حَدِيثِ عَبْدِ الْعَزِيزِ فِي الدُّعَاءِ يَزِيدُ وَيَنْقُصُ الشَّيْءَ وَلَمْ يَذْكُرْ وَالْخَيْرُ كُلُّهُ فِي يَدَيْكَ وَالشَّرُّ لَيْسَ إِلَيْكَ وَزَادَ فِيهِ وَيَقُولُ عِنْدَ انْصِرَافِهِ مِنْ الصَّلَاةِ اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَأَعْلَنْتُ أَنْتَ إِلَهِي لَا إِلَهَ إِلَّا أَنْتَ حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا شُرَيْحُ بْنُ يَزِيدَ حَدَّثَنِي شُعَيْبُ بْنُ أَبِي حَمْزَةَ قَالَ قَالَ لِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ وَابْنُ أَبِي فَرْوَةَ وَغَيْرُهُمَا مِنْ فُقَهَاءِ أَهْلِ الْمَدِينَةِ فَإِذَا قُلْتَ أَنْتَ ذَاكَ فَقُلْ وَأَنَا مِنْ الْمُسْلِمِينَ يَعْنِي قَوْلَهُ{ وَأَنَا أَوَّلُ الْمُسْلِمِينَ }",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Abdul Aziz bin Abu Salamah] dari [pamannya yaitu Al Majisun bin Abu Salamah] dari [Abdurrahman Al A'raj] dari ['ubaidhullah bin Abu Rafi'] dari [Ali bin Abu Thalib radliallahu 'anhu] dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam hendak mengerjakan sholat, beliau bertakbir kemudian membaca; \"WAJJAHTU WAJHIYA LILLADZII FATHARAS SAMAAWAATI WAL ARDLI HANIIFAM MUSLIMA WAMAA ANA MINAL MUSYRIKIN, INNA SHALAATI WA NUSUKII WA MAHYAAYA WA MAMAATI LILLAHI RABBIL 'AALAMIN, LAA SYARIIKALAHU WA BIDZAALIKA UMIRTU WA ANAA AWWALUL MUSLIMIN. ALLAHUMMA ANTAL MALIK LAAILAAHA ILLA ANTA, ANTA RABBI WA ANAA 'ABDUKA DLALAMTU NAFSII WA'TARAFTU BIDZANBII FAGHFIRLII DZUNUUBI JAMII'A INNAHU LAA YAGHFIRUD DZUNUUBA ILLA ANTA WAHDINII LIAHSANIL AHLAAQI LAA YAHDII LI AHSANIHAA ILLA ANTA WASHRIF 'ANNI SAYYI`AHAA LAA YASHRIF SAYYI`AHAA ILLA ANTA. LABBAIKA WA SA'DAIKA WAL KHAIRU KULLUHU FII YADAIKA WASS SYARRU LAISA ILAIKA ANA BIKA WA ILAIKA TABAARAKTA WA TA'AALAITA ASTAGHFIRUKA WA ATUUBU ILAIKA. (Aku hadapkan muka-Ku ke hadirat Allah yang telah menciptakan langit dan bumi dengan tunduk dan menyerahkan diri, dan tidaklah aku termasuk golongan orang-orang Musyrik. Sesungguhnya sholatku, ibadahku, hidup dan matiku adalah untuk Allah Penguasa seluruh alam, tidak ada sekutu bagi-Nya dan dengan demikian aku di perintah, dan aku adalah dari golongan orang-orang Islam (yang menyerah diri). Ya Allah, Enkau adalah Rabbku dan aku dalah hamba-Mu, aku telah berbuat aniaya terhadap diriku sendiri dan mengakui kesalahanku, maka amnpunilah dosaku semuanya, dan tiadalah yang dapat mengampuni dosaku itu melainkan Engkau. Tunjukilah aku kepada akhlak yang baik, dan tak ada yang dapat menunjuki kepada akhlak yang terbaik melainkan Engkau. Dan jauhkanlah aku dari akhlak yang tercela, karena tidak ada yang dapat menjauhkanku dari akhlak yang tercela melainkan Engkau, Ya Allah, aku penuhi panggilan-Mu, aku patuhi perintah-Mu, kebaikan seluruhnya berada dalam kekuasaan-Mu, sedangkan kejahatan tidak dapat di pakai untuk mendekatkan diri kepada-Mu. Aku ini hanya dapat hidup dengan-Mu dan akan kembali kepada-Mu, Maha Berkah Engakau dan Maha Tinggi, aku meohon ampunan dan bertaubat kepada-Mu).\" Apabila ruku', beliau membaca; \"ALLAHUMMA LAKA RAKA'TU WABIKA AAMANTU WALAKA ASLAMTU KHASYA'A LAKA SAM'II WA BASHARII WA MUKHHII WA 'IDZAAMII WA 'ASHABII (Ya Allah, kepada-Mu lah aku ruku', kepada-Mu lah aku beriman, kepada-Mu lah aku tunduk, dan kepada-Mu lah pendengaranku, penglihatanku, otakku, tulang belulangku dan urat sarafku tunduk).\" Apabila i'tidal beliau mengucapkan; \"SAMI'ALLAHU LIMAN HAMIDAH, RABBANAA WALAKAL HAMDU MIL`US SAMAAWAATI WAL ARDLI WA MIL`U MAA BAINAHUMAA WAMIL`U MAA SYI`TA MIN SYAI`IN BA'DU (Maha Mendengar Allah terhadap siapa saja yang memuji-Nya, Wahai Rabb kami, hanya bagi Engkau jua segala pujian, sepenuh langit, bumi, dan sepenuh isi langit dan bumi dan sepenuh apa yang Engkau kehendaki setelah itu).\" Apabila sujud, beliau mengucapkan; \"ALLAHUMMA LAKA SAJADTU WA BIKA AAMANTU WALAKA ASLAMTU, SAJADA WAJHIYA LILLADZII KHALAQAHU WA SHAWWARAHU FA AHSANA SHUURATAHU WA SYAQQA SAM'AHU WA BASHARAHU WA TABAARAKALLAHU AHSANUL KHAALIQIN (Ya Allah, kepada-Mu lah aku bersujud, kepada-Mu lah aku beriman, kepada-Mu lah aku tunduk, wajahku bersujud kepada Dzat yang telah menciptakannya dan membentuknya dengan sebaik-baik bentuk, membuat pendengaran dan penglihatannya, dan Maha Barakah Allah, sebaik-baik pencipta).\" Apabila selesai salam, beliau mengucapkan; \"ALLAHUMMAGHFIRLII MAA QADDAMTU WA MAA AKHHARTU WAMAA ASRARTU WAMAA A'LANTU WAMAA ASRAFTU WAMAA ANTA A'LAMU BIHI MINNI ANTAL MUQADDIM WAL MU`AKHHIR LAA ILAAHA ILLA ANTA (Ya Allah, ampunilah daku, dan dosa-dosa yang telah lalu, dosa yang akan datang, dosa yang samar dan dosa yang jelas, serta dosa yang hanya Engkau saja yang mengetahuinya, Engkau lah yang mendahulukan dan mengundurkan, tiada ilah selain Engkau).\" Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Sulaiman bin Daud Al Hasyimi] telah mengabarkan kepada kami [Abdurrahman bin Abu Az Zinnad] dari [Musa bin 'Uqbah] dari [Abdullah bin Al Fadl bin Rabi'ah bin Al Harits bin Abdul Mutthalib] dari [Abdurrahman Al A'raj] dari ['ubaidhullah bin Abu Rafi'] dari [Ali bin Abu Thalib] dari Rasulullah shallallahu 'alaihi wasallam bahwa; \"Apabila beliau hendak mengerjakan sholat wajib, beliau mengangkat kedua tangannya sejajar dengan kedua bahunya, beliau melakukan semacam itu ketika telah usai dari membaca (surat Al Qur'an) yaitu ketika hendak ruku', beliau mengerjakan seperti itu pula ketika bangun dari ruku' (i'tidal), dan beliau tidak pernah mengangkat kedua tangannya waktu duduk dalam sholat, ketika beliau hendak bangkit dari sujud kedua, beliau juga mengangkat kedua tangannya dan bertakbir lalu berdo'a …\" sebagaimana hadits (riwayat) Abdul Aziz. Dalam do'anya terdapat penambahan dan pengurangan, namun tidak menyebutkan; \"WAL KHAIRU KULLUHU FII YADAIKA WAS SYARRU LAISA ILAIKA\" pada lafadznya ada tambahan; \"Ketika telah selesai, beliau mengucapkan: \"ALLAHUMMAGHFIRLII MAA QADDAMTU WA MAA AKHHARTU WAMAA ASRARTU WAMAA A'LANTU ANTA ILAAHI LAAILAAHA ILLA ANTA (Ya Allah, ampunilah daku, dan dosa-dosa yang telah lalu, dosa yang akan datang, dosa yang samar dan dosa yang jelas, serta dosa yang hanya Engkau saja yang mengetahuinya, Engkau lah yang mendahulukan dan mengundurkan, tiada ilah selain Engkau).\" Telah menceritakan kepada kami 'Amru bin Utsman telah menceritakan kepada kami Syuraih bin Yazid telah menceritakan kepadaku Syu'aib bin Abu Hamzah dia berkata; Muhammad bin Al Munkadir, Ibnu Abu Farwah dan yang lain dari fuqaha' Madinah telah berkata kepadaku; \"Jika kamu mengucapkan (do'a iftitah) tersebut, maka ucapkanlah \"WA ANA MINAL MUSLIMIN yaitu (sebagai pengganti) pada lafadz \"WA ANA AWWALUL MUSLIMIN.\""
            },
            {
                "number": 637,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ أَخْبَرَنَا حَمَّادٌ عَنْ قَتَادَةَ وَثَابِتٍ وَحُمَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَجُلًا جَاءَ إِلَى الصَّلَاةِ وَقَدْ حَفَزَهُ النَّفَسُ فَقَالَ اللَّهُ أَكْبَرُ الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ فَلَمَّا قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاتَهُ قَالَ أَيُّكُمْ الْمُتَكَلِّمُ بِالْكَلِمَاتِ فَإِنَّهُ لَمْ يَقُلْ بَأْسًا فَقَالَ الرَّجُلُ أَنَا يَا رَسُولَ اللَّهِ جِئْتُ وَقَدْ حَفَزَنِيَ النَّفَسُ فَقُلْتُهَا فَقَالَ لَقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا أَيُّهُمْ يَرْفَعُهَا وَزَادَ حُمَيْدٌ فِيهِ وَإِذَا جَاءَ أَحَدُكُمْ فَلْيَمْشِ نَحْوَ مَا كَانَ يَمْشِي فَلْيُصَلِّ مَا أَدْرَكَهُ وَلْيَقْضِ مَا سَبَقَهُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah mengabarkan kepada kami [Hammad] dari [Qatadah], [tsabit] dan [Humaid] dari [Anas bin Malik] bahwa seorang laki-laki datang untuk menunaikan sholat, sedangkan lafadznya terengah-engah sambil mengucapkan; \"ALLAHU AKBAR, AL HAMDU LILLAHI HAMDAN KATSIRAN THAYYIBAN MUBAARAKAN FIIHI (Allah Maha Besar, segala puji bagi Allah, pujian yang banyak, baik dan penuh berkah).\" Ketika Rasulullah shallallahu 'alaihi wasallam selesai mengerjakan sholat, beliau bersabda: \"Siapakah di antara kalian yang mengucapkan beberapa kalimat tadi? Sungguh dia telah mengucapkan kalimat yang tidak di larang.\" Laki-laki tiu menjawab; \"Saya wahai Rasulullah, aku datang dengan tergesa-gesa, sehingga nafasku terengah-engah, lalu saya ucapkan do'a seperti tadi.\" Beliau bersabda: \"Sungguh, saya melihat dua belas Malaikat yang masing-masing dari mereka berlomba-lomba untuk mengangkat (kalimat tersebut).\" Dalam riwayatnya Humaid menambahkan; \"Apabila salah seorang dari kalian datang, hendaknya ia berjalan seperti biasa, lalu mengerjakan sholat sesuai raka'at yang ia dapat, dan mengganti raka'at yang tertinggal.\""
            },
            {
                "number": 638,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ أَخْبَرَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَاصِمٍ الْعَنَزِيِّ عَنْ ابْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِأَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي صَلَاةً قَالَ عَمْرٌو لَا أَدْرِي أَيَّ صَلَاةٍ هِيَ فَقَالَ اللَّهُ أَكْبَرُ كَبِيرًا اللَّهُ أَكْبَرُ كَبِيرًا اللَّهُ أَكْبَرُ كَبِيرًا وَالْحَمْدُ لِلَّهِ كَثِيرًا وَالْحَمْدُ لِلَّهِ كَثِيرًا وَالْحَمْدُ لِلَّهِ كَثِيرًا وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلًا ثَلَاثًا أَعُوذُ بِاللَّهِ مِنْ الشَّيْطَانِ مِنْ نَفْخِهِ وَنَفْثِهِ وَهَمْزِهِقَالَ نَفْثُهُ الشِّعْرُ وَنَفْخُهُ الْكِبْرُ وَهَمْزُهُ الْمُوتَةُ حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى بْنُ مِسْعَرٍ عَنْ مِسْعَرٍ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ رَجُلٍ عَنْ نَافِعِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي التَّطَوُّعِ ذَكَرَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami ['Amru bin Marzuq] telah mengabarkan kepada kami [Syu'bah] dari ['Amru bin Murrah] dari ['Ashim Al 'Anazi] dari [Ibnu Jubair bin Muth'im] dari [ayahnya] bahwa dia melihat Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat, -'Amru mengatakan; Aku tidak tahu sholat apa yang sedang di kerjakan beliau- beliau mengucapkan; \"ALLAHU AKBAR KABIIRA, ALLAHU AKBAR KABIIRA, ALLAHU AKBAR KABIIRAW WAL HAMDU LILLAAHI KATSIRA WAL HAMDU LILLAHI KATSIIRA WAL HAMDU LILLAHI KATSIRA WA SUBHAANALLAHI BUKRATA WA ASHIILA -tiga kali- A'UUDZU BILLAHI MINAS SYAITHAANI MIN NAFKHIHI WA NAFSIHI WA HAMAZIHI (Allah Maha Besar sungguh Maha Besar, Allah Maha Besar sungguh Maha Besar, Allah Maha Besar sungguh Maha Besar, dan segala puji bagi Allah dengan pujian yang banyak, segala puji bagi Allah dengan pujian yang banyak, segala puji bagi Allah dengan pujian yang banyak, dan Maha suci Allah pada pagi hari dan sore -sebanyak tiga kali- Aku berlindung kepada Allah dari godaan syetan, dari nafkh-nya, nafts-nya serta hamz-nya.\" Perawi berkata; nafts adalah syairnya, an-nafkh adalah kesombongannya sedangkan hamznya adalah kegilaan.\" Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya bin Mis'ar] dari [Mis'ar] dari ['Amru bin Murrah] dari [seorang laki-laki] dari [Nafi' bin Jubair] dari [ayahnya] dia berkata; saya mendengar Nabi shallallahu 'alaihi wasallam mengucapkan dalam sholat sunnahnya…\" kemudian dia menyebutkan hadits yang serupa.\""
            },
            {
                "number": 639,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ أَخْبَرَنِي مُعَاوِيَةُ بْنُ صَالِحٍ أَخْبَرَنِي أَزْهَرُ بْنُ سَعِيدٍ الْحَرَازِيُّ عَنْ عَاصِمِ بْنِ حُمَيْدٍ قَالَ سَأَلْتُ عَائِشَةَبِأَيِّ شَيْءٍ كَانَ يَفْتَتِحُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِيَامَ اللَّيْلِ فَقَالَتْ لَقَدْ سَأَلْتَنِي عَنْ شَيْءٍ مَا سَأَلَنِي عَنْهُ أَحَدٌ قَبْلَكَ كَانَ إِذَا قَامَ كَبَّرَ عَشْرًا وَحَمِدَ اللَّهَ عَشْرًا وَسَبَّحَ عَشْرًا وَهَلَّلَ عَشْرًا وَاسْتَغْفَرَ عَشْرًا وَقَالَ اللَّهُمَّ اغْفِرْ لِي وَاهْدِنِي وَارْزُقْنِي وَعَافِنِي وَيَتَعَوَّذُ مِنْ ضِيقِ الْمَقَامِ يَوْمَ الْقِيَامَةِقَالَ أَبُو دَاوُد وَرَوَاهُ خَالِدُ بْنُ مَعْدَانَ عَنْ رَبِيعَةَ الْجُرَشِيِّ عَنْ عَائِشَةَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Zaid bin Al Hubbab] telah mengabarkan kepadaku [Mu'awiyah bin Shalih] telah mengabarkan kepadaku [Azhar bin Sa'id Al Harazi] dari ['Ashim bin Humaid] dia berkata; \"Aku bertanya kepada [Aisyah]; \"Dengan apakah Rasulullah shallallahu 'alaihi wasallam memulai sholat malamnya?\" Aisyah menjawab; \"Sungguh kamu telah menanyakan kepadaku sesuatu yang belum pernah di tanyakan seseorang sebelummu, apabila beliau mengerjakan (sholat malam) beliau memulai dengan takbir sepuluh kali, memuji Allah sepuluh kali, bertasbih sepuluh kali, lalu beliau mengucapkan; \"ALLAHUMMAGHFIRLII WAHDINII WARZUQNII WA'AAFINII (Ya Allah, ampunilah daku, berilah aku petunjuk, berilah aku rizki dan anugerahkanlah kesehatan padaku), kemudian beliau juga berlindung dari sempitnya kedudukan pada hari Kiamat.\" Abu Daud mengatakan; \"Dan di riwayatkan pula oleh [Khalid bin Ma'dan] dari [Rabi'ah Al Jurasyi] dari [Aisyah] seperti hadits di atas.\""
            },
            {
                "number": 640,
                "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عُمَرُ بْنُ يُونُسَ حَدَّثَنَا عِكْرِمَةُ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ سَأَلْتُ عَائِشَةَبِأَيِّ شَيْءٍ كَانَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْتَتِحُ صَلَاتَهُ إِذَا قَامَ مِنْ اللَّيْلِ قَالَتْ كَانَ إِذَا قَامَ مِنْ اللَّيْلِ يَفْتَتِحُ صَلَاتَهُ اللَّهُمَّ رَبَّ جِبْرِيلَ وَمِيكَائِيلَ وَإِسْرَافِيلَ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنْ الْحَقِّ بِإِذْنِكَ إِنَّكَ أَنْتَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو نُوحٍ قُرَادٌ حَدَّثَنَا عِكْرِمَةُ بِإِسْنَادِهِ بِلَا إِخْبَارٍ وَمَعْنَاهُ قَالَ كَانَ إِذَا قَامَ بِاللَّيْلِ كَبَّرَ وَيَقُولُ حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ قَالَ لَا بَأْسَ بِالدُّعَاءِ فِي الصَّلَاةِ فِي أَوَّلِهِ وَأَوْسَطِهِ وَفِي آخِرِهِ فِي الْفَرِيضَةِ وَغَيْرِهَا",
                "id": "Telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Umar bin Yunus] telah menceritakan kepada kami ['Ikrimah] telah menceritakan kepadaku [Yahya bin Abu Katsir] telah menceritakan kepadaku [Abu Salamah bin Abdurrahman bin 'Auf] dia berkata; saya bertanya kepada Aisyah; \"Dengan apakah Nabi Allah shallallahu 'alaihi wasallam berdo'a sebagai pembukaan sholat malam?\" [Aisyah] menjawab; \"Sebagai pembukaan sholat malamnya, beliau memulai dengan do'a; \"ALLAHUMMA RABBI JIBRIIL WA MIIKAAIIL WA ISRAAFIIL FAATHIRIS SAMAAWATI WAL ARDLI 'AALIMIL GHAIBI WAS SYAHAADAH ANTA TAHKUMU BAINA 'IBAADIKA FIIMA KAANUU FIIHI YAKHTALIFUUN, IHDINII LIMAKHTULIFA FIIHI MINAL HAQQI BI IDZNIKA INNAKA ANTA TAHDI MANTASYAA`U ILAA SHIRAATHAL MUSTAQIIM (Ya Allah, Tuhan Jibril, Mika`il dan Israfil yang telah menciptakan langit dan bumi, yang mengetahui hal yang ghaib maupun yang nyata. Engkau lah dzat yang akan mengadili hamba-hamba-Mu mengenai apa yang mereka perselisihkan. Berilah aku petunjuk dengan keizinan-Mu terhadap kebenaran yang diperselisihkan, sesungguhnya Engkau memberi petunjuk kepada siapa yang Engkau kehendaki ke jalan yang lurus).\" Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abu Nuh Qurad] telah menceritakan kepada kami ['Ikrimah] dengan isnad dan makna yang sama tanpa adanya pengabaran (telah mengabarkan kepada kami), katanya; \"Apabila beliau hendak mengerjakan sholat malam, beliau bertakbir dan mengucapkan…\" telah menceritakan kepada kami Al Qa'nabi dari Malik dia berkata; \"Tidak mengapa mengucapkan do'a dalam sholat, apakah di awal sholat, pertengahan ataupun di akhir sholat, baik sholat wajib atau sunnah.\""
            },
            {
                "number": 641,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ عَنْ عَلِيِّ بْنِ يَحْيَى الزُّرَقِيِّ عَنْ أَبِيهِ عَنْ رِفَاعَةَ بْنِ رَافِعٍ الزُّرَقِيِّ قَالَكُنَّا يَوْمًا نُصَلِّي وَرَاءَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأْسَهُ مِنْ الرُّكُوعِ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ قَالَ رَجُلٌ وَرَاءَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ رَبَّنَا وَلَكَ الْحَمْدُ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ فَلَمَّا انْصَرَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ الْمُتَكَلِّمُ بِهَا آنِفًا فَقَالَ الرَّجُلُ أَنَا يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ رَأَيْتُ بِضْعَةً وَثَلَاثِينَ مَلَكًا يَبْتَدِرُونَهَا أَيُّهُمْ يَكْتُبُهَا أَوَّلُ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Nu'aim bin Abdullah Al Mujmir] dari [Ali bi Yahya Az Zuraqi] dari [ayahnya] dari [Rifa'ah bin Rafi' Az Zuraqi] dia berkata; \"Suatu hari kami pernah sholat di belakang Rasulullah shallallahu 'alaihi wasallam, ketika Rasulullah shallallahu 'alaihi wasallam mengangkat kepalanya dari ruku' (i'tidal), tiba-tiba seorang laki-laki di belakang Rasulullah shallallahu 'alaihi wasallam mengucapkan; \"ALLAHUMMA RABBANA WALAKAL HAMDU HAMDAN KATSIIRA THAYYIBA MUBAARAKAN FIIH (Allah Maha Besar, segala puji bagi Allah, pujian yang banyak, baik dan penuh berkah).\" Ketika Rasulullah shallallahu 'alaihi wasallam selesai menunaikan sholat, beliau bersabda: \"Siapakah di antara kalian yang mengucapkan beberapa kalimat tadi?\" laki-laki itu menjawab; \"Saya wahai Rasulullah.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh aku telah melihat lebih dari tiga puluh malaikat yang berlomba-lomba untuk mencatat kalimat tersebut lebih dulu.\""
            },
            {
                "number": 642,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ أَبِي الزُّبَيْرِ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَامَ إِلَى الصَّلَاةِ مِنْ جَوْفِ اللَّيْلِ يَقُولُ اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالْأَرْضِ وَلَكَ الْحَمْدُ أَنْتَ قَيَّامُ السَّمَوَاتِ وَالْأَرْضِ وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ أَنْتَ الْحَقُّ وَقَوْلُكَ الْحَقُّ وَوَعْدُكَ الْحَقُّ وَلِقَاؤُكَ حَقٌّ وَالْجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ وَالسَّاعَةُ حَقٌّ اللَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ وَإِلَيْكَ حَاكَمْتُ فَاغْفِرْ لِي مَا قَدَّمْتُ وَأَخَّرْتُ وَأَسْرَرْتُ وَأَعْلَنْتُ أَنْتَ إِلَهِي لَا إِلَهَ إِلَّا أَنْتَحَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ حَدَّثَنَا عِمْرَانُ بْنُ مُسْلِمٍ أَنَّ قَيْسَ بْنَ سَعْدٍ حَدَّثَهُ قَالَ حَدَّثَنَا طَاوُسٌ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي التَّهَجُّدِ يَقُولُ بَعْدَ مَا يَقُولُ اللَّهُ أَكْبَرُ ثُمَّ ذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Abu Az Zubair] dari [Thawus] dari [Ibnu Abbas] bahwa; \"Apabila Rasulullah shallallahu 'alaihi wasallam hendak mengerjakan sholat malam, beliau berdo'a; \"ALLAHUMMA LAKAL HAMDU ANTA NUURUS SAMAAWAATI WAL ARDLI WALAKAL HAMDU ANTA QAYYAMAS SAMAAWAATI WAL ARDLI WALAKAL HAMDU ANTA RABBUS SAMAAWAATI WAL ARDLI WAMAN FIIHINNA, ANTAL HAQQU WAQAULUKAL HAQQU WAWA'DUKAL HAQQU WANNAARU HAQQUN, WAS SAA'ATU HAQQUN, ALLAHUMMA LAKA ASLAMTU WABIKA AAMANTU WA'ALAIKA TAWAKKALTU WA ILAIKA ANABTU WABIKA KHAASHAMTU WA ILAIKA HAAKAMTU, FAGHFIRLII MAA QADDAMTU WA AKKHARTU WA ASRARTU WA A'LANTU ANTA ILAAHI LAA ILAAHA ILLA ANTA (Ya Allah, hanya untuk Engkau segala pujian, Engkau lah cahaya langit dan bumi, hanya untuk Engkau lah segala pujian, Engkau lah pemelihara langit dan bumi, dan hanya untuk Engkau-lah segala pujian, Engkau Maha pengatur langit dan bumi serta segala isinya, Engkau lah Al Haqq, firman-Mu juga Haqq, surga itu haq, janji Engkau juga haq, hari kiamat itu haq, Ya Allah, kepada Engkau lah aku berserah diri, kepada-Mu aku beriman, kepada-Mu aku bertawakkal, kepada-Mu aku akan kembali, dan aku berjuang bersama-Mu, dan aku berpedoman kepada hukum-hukum-Mu, maka ampunilah dosa-dosaku yang telah lalu dan yang akan datang, baik yang samar maupun yang terang, Engkau lah Rabb ku tidak ada ilah selain Engkau).\" Telah menceritakan kepada kami [Abu Kamil] telah menceritakan kepada kami [Khalid yaitu Ibnu Al Harits] telah menceritakan kepada kami ['Imran bin Muslim] bahwa [Qais bin Sa'd] telah menceritakan kepadanya, katanya; telah menceritakan kepada kami [Thawus] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam dalam sholat tahajjud, yaitu setelah mengucapkan \"Allahu akbar\" beliau biasa mengucapkan do'a…\" kemudian dia menyebutkan makna haditsnya.\""
            },
            {
                "number": 643,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَسَعِيدُ بْنُ عَبْدِ الْجَبَّارِ نَحْوَهُ قَالَ قُتَيْبَةُ حَدَّثَنَا رِفَاعَةُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ رِفَاعَةَ بْنِ رَافِعٍ عَنْ عَمِّ أَبِيهِ مُعَاذِ بْنِ رِفَاعَةَ بْنِ رَافِعٍ عَنْ أَبِيهِ قَالَصَلَّيْتُ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَطَسَ رِفَاعَةُ لَمْ يَقُلْ قُتَيْبَةُ رِفَاعَةُ فَقُلْتُ الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ مُبَارَكًا عَلَيْهِ كَمَا يُحِبُّ رَبُّنَا وَيَرْضَى فَلَمَّا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْصَرَفَ فَقَالَ مَنْ الْمُتَكَلِّمُ فِي الصَّلَاةِثُمَّ ذَكَرَ نَحْوَ حَدِيثِ مَالِكٍ وَأَتَمَّ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Sa'id bin Abdul Jabbar] seperti sanad semisal. Qutaibah berkata; telah menceritakan kepada kami [Rifa'ah bin Yahya bin Abdullah bin Rifa'ah bin Rafi'] dari [paman ayahnya Mu'adz bin Rifa'ah bin Rafi'] dari [ayahnya] dia berkata; \"Saya sholat di belakang Rasulullah shallallahu 'alaihi wasallam, lalu Rifa'ah bersin -namun Qutaibah tidak menyebutkan \"Rifa'ah\"- maka aku mengucapkan; \"ALHAMDULILLAAHI HAMDAN KATSIRA THAYYIBAN MUBAARAKAN FIIHI MUBAARAKAN 'ALAIHI KAMAA YUHIBBU RABBUNA WAYARDLAA (Segala puji bagi Allah dengan pujian yang banyak, baik lagi penuh berkah, seperti yang di cintai dan di ridlai oleh Rabb kami).\" Seusai sholat, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa tadi yang mengucapkan (do'a) dalam sholat?\" kemudian dia menyebutkan seperti hadits Malik dan yang lebih sempurna dari hadits di atas.\""
            },
            {
                "number": 644,
                "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شَرِيكٌ عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ عَنْ أَبِيهِ قَالَعَطَسَ شَابٌّ مِنْ الْأَنْصَارِ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي الصَّلَاةِ فَقَالَ الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ حَتَّى يَرْضَى رَبُّنَا وَبَعْدَمَا يَرْضَى مِنْ أَمْرِ الدُّنْيَا وَالْآخِرَةِ فَلَمَّا انْصَرَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ الْقَائِلُ الْكَلِمَةَ قَالَ فَسَكَتَ الشَّابُّ ثُمَّ قَالَ مَنْ الْقَائِلُ الْكَلِمَةَ فَإِنَّهُ لَمْ يَقُلْ بَأْسًا فَقَالَ يَا رَسُولَ اللَّهِ أَنَا قُلْتُهَا لَمْ أُرِدْ بِهَا إِلَّا خَيْرًا قَالَ مَا تَنَاهَتْ دُونَ عَرْشِ الرَّحْمَنِ تَبَارَكَ وَتَعَالَى",
                "id": "Telah menceritakan kepada kami [Al 'Abbas bin Abdul 'Adzim] telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Syarik] dari ['Ashim bin 'ubaidhullah] dari ['Abdullah bin 'Amir bin Rabi'ah] dari [ayahnya] dia berkata; \"Seorang pemuda dari Anshar bersin dalam sholat di belakang Rasulullah shallallahu 'alaihi wasallam, lalu dia mengucapkan: \"ALHAMDULILLAHI HAMDAN KATSIRAN THAYYIBAN MUBARAKAN FIIH HATTA YARDHA RABBUNA WA BA'DA MA YARDHA MIN AMRID DUN-YAA WAL AKHIRAH\" (Segala puji bagi Allah dengan pujian yang banyak, baik, lagi penuh berkah. hingga Rabb kami ridha setelah Dia ridha terhadap urusan dunia dan akhirat).\" Seusai sholat, Rasulullah shallallahu 'alaihi wasallam bertanya: \"Siapakah yang mengucapkan kalimat tadi?\" Pemuda itu terdiam, lalu beliau bertanya lagi: \"Siapakah yang mengucapkan kalimat tadi? Sesungguhnya dia tidak mengatakan sesuatu yang salah!\" Maka laki-laki itu menjawab: \"Akulah yang mengatakannya wahai Rasulullah! Aku tidak bermaksud kecuali hanya kebaikan.\" Beliau bersabda: \"Tidak ada yang dapat menghalangi kalimat tersebut untuk sampai ke Arsy Ar Rahman Tabaraka wa Ta'ala.\""
            },
            {
                "number": 645,
                "arab": "حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ مُطَهَّرٍ حَدَّثَنَا جَعْفَرٌ عَنْ عَلِيِّ بْنِ عَلِيٍّ الرِّفَاعِيِّ عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ مِنْ اللَّيْلِ كَبَّرَ ثُمَّ يَقُولُ سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالَى جَدُّكَ وَلَا إِلَهَ غَيْرَكَ ثُمَّ يَقُولُ لَا إِلَهَ إِلَّا اللَّهُ ثَلَاثًا ثُمَّ يَقُولُ اللَّهُ أَكْبَرُ كَبِيرًا ثَلَاثًا أَعُوذُ بِاللَّهِ السَّمِيعِ الْعَلِيمِ مِنْ الشَّيْطَانِ الرَّجِيمِ مِنْ هَمْزِهِ وَنَفْخِهِ وَنَفْثِهِ ثُمَّ يَقْرَأُقَالَ أَبُو دَاوُد وَهَذَا الْحَدِيثُ يَقُولُونَ هُوَ عَنْ عَلِيِّ بْنِ عَلِيٍّ عَنْ الْحَسَنِ مُرْسَلًا الْوَهْمُ مِنْ جَعْفَرٍ",
                "id": "Telah menceritakan kepada kami [Abdussalam bin Mutthahir] telah menceritakan kepada kami [Ja'far] dari [Ali bin Ali Ar Rifa'i] dari [Abu Al Mutawakkil An Naji] dari [Abu Sa'id Al Khudri] dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam bangun untuk sholat malam, beliau bertakbir kemudian mengucapkan: \"SUBHAANAKA ALLAHUMMA WABIHAMDIKA WATABAARAKASMUKA WA TA'AALA JADDUKA WALAA ILAAHA GHAIRAKA (Maha suci Engkau, ya Allah, aku sucikan nama-Mu dengan memuji-Mu, Maha berkah nama-Mu, Maha luhur keluhuran-Mu dan tidak ilah selain Engkau).\" kemudian membaca: \"LAA ILAAHA ILLALLAH (tidak ada ilah selain Allah) sebanyak tiga kali, kemudian membaca: \"ALLAHU AKBAR KABIIRA (Allah Maha besar benar-benar Maha besar).\" sebanyak tiga kali- (kemudian membaca): A'UUDZU BILLAHIS SAMII'IL 'ALIIM MINAS SYAITHAANIR RAJIIM MIN HAMZIHII WANAFKHIHI WA NAFTSIHI (Aku berlindung kepada Allah, dzat yang Maha mendengar lagi Maha mengetahui dari goda'an syetan yang terkutuk, dari kegilaannya, dari kesombongannya dan syairnya yang jelek).\" kemudian beliau membaca (surat Al Qur'an).\" Abu Daud berkata; \"Mereka (para perawi) mengatakan; Hadits ini dari Ali bin Ali dari Al Hasan secara mursal, dan wahm (keraguan) dari Ja'far.\""
            },
            {
                "number": 646,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ عِيسَى حَدَّثَنَا طَلْقُ بْنُ غَنَّامٍ حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ الْمُلَائِيُّ عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ عَنْ أَبِي الْجَوْزَاءِ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَفْتَحَ الصَّلَاةَ قَالَ سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالَى جَدُّكَ وَلَا إِلَهَ غَيْرَكَقَالَ أَبُو دَاوُد وَهَذَا الْحَدِيثُ لَيْسَ بِالْمَشْهُورِ عَنْ عَبْدِ السَّلَامِ بْنِ حَرْبٍ لَمْ يَرْوِهِ إِلَّا طَلْقُ بْنُ غَنَّامٍ وَقَدْ رَوَى قِصَّةَ الصَّلَاةِ عَنْ بُدَيْلٍ جَمَاعَةٌ لَمْ يَذْكُرُوا فِيهِ شَيْئًا مِنْ هَذَا",
                "id": "Telah menceritakan kepada kami [Husain bin Isa] telah menceritakan kepada kami [Thalq bin Ghannam] telah menceritakan kepada kami [Abdussalam bin Harb Al Mula`i] dari [Budail bin Maisarah] dari [Abu Jauza`] dari [Aisyah] dia berkata; Apabila Rasulullah shallallahu 'alaihi wasallam hendak memulai sholat, beliau mengucapkan: \"SUBHANAKA ALLAHUMMA WA BIHAMDIKA WA TABARAKAS-MUKA WA TA'ALA JADDUKA WA LA ILAHA GHAIRAKA\" (Maha suci Engkau, ya Allah, aku sucikan nema-Mu dengan memuji-Mu, Maha berkah nama-Mu, Maha luhur keluhuran-Mu dan tidak ilah selain Engkau). Abu Daud berkata: \"Hadits ini tidak masyhur (di kenal) dari Abdullah bin Salam bin Harb, dan tidak ada yang meriwayatkan hadits ini kecuali Thalq bin Ghannam, namun dia telah meriwayatkan hadits tentang kisah sholat dari Budair, sedangkan para pakar hadits tidak menyebutkan sedikitpun hadits seperti ini.\""
            },
            {
                "number": 647,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا إِسْمَعِيلُ عَنْ يُونُسَ عَنْ الْحَسَنِ قَالَ قَالَ سَمُرَةُحَفِظْتُ سَكْتَتَيْنِ فِي الصَّلَاةِ سَكْتَةً إِذَا كَبَّرَ الْإِمَامُ حَتَّى يَقْرَأَ وَسَكْتَةً إِذَا فَرَغَ مِنْ فَاتِحَةِ الْكِتَابِ وَسُورَةٍ عِنْدَ الرُّكُوعِ قَالَ فَأَنْكَرَ ذَلِكَ عَلَيْهِ عِمْرَانُ بْنُ حُصَيْنٍ قَالَ فَكَتَبُوا فِي ذَلِكَ إِلَى الْمَدِينَةِ إِلَى أُبَيٍّ فَصَدَّقَ سَمُرَةَقَالَ أَبُو دَاوُد كَذَا قَالَ حُمَيْدٌ فِي هَذَا الْحَدِيثِ وَسَكْتَةً إِذَا فَرَغَ مِنْ الْقِرَاءَةِ حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ عَنْ أَشْعَثَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَسْكُتُ سَكْتَتَيْنِ إِذَا اسْتَفْتَحَ وَإِذَا فَرَغَ مِنْ الْقِرَاءَةِ كُلِّهَا فَذَكَرَ مَعْنَى حَدِيثِ يُونُسَ",
                "id": "Telah menceritakan kepada kami [Ya'kub bin Ibrahim] telah menceritakan kepada kami [Isma'il] dari [Yunus] dari [Al Hasan] dia berkata; [Samurah] berkata; \"Aku hafal dua tempat diam sejenaknya beliau dalam sholat, pertama ketika imam bertakbir sampai membaca (Al Fatihah) dan diamnya yang kedua apabila selesai membaca surat Al Fatihah dan surat Al Qur'an sebelum ruku'.\" Al Hasan mengatakan; \"Ternyata hal itu di ingkari oleh 'Imran bin Hushain.\" Kata Al Hasan selanjutnya; \"Lantas mereka (orang-orang) menulis surat mengenai hal itu kepada [Ubay] di Madinah, namun Ubay membenarkan Samurah.\" Abu Daud mengatakan; \"Demikianlah kata Humaid dalam hadits ini, yaitu; \"Diam sejenaknya beliau ketika selesai membaca (surat Al Qur'an).\" Telah menceritakan kepada kami [Abu Bakr bin Khallad] telah menceritakan kepada kami [Khalid bin Al Harits] dari [Asy'ats] dari [Al Hasan] dari [Samurah bin Jundab] dari Nabi shallallahu 'alaihi wasallam bahwa beliau diam sejenak di dua tempat, yaitu; Ketika mulai (sholat, yaitu setelah takbir -pent) dan ketika selesai membaca (surat).\" Kemudian perawi menyebutkan makna hadits Yunus.\""
            },
            {
                "number": 648,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ حَدَّثَنَا سَعِيدٌ حَدَّثَنَا قَتَادَةُ عَنْ الْحَسَنِ أَنَّ سَمُرَةَ بْنَ جُنْدُبٍ وَعِمْرَانَ بْنَ حُصَيْنٍ تَذَاكَرَافَحَدَّثَ سَمُرَةُ بْنُ جُنْدُبٍ أَنَّهُ حَفِظَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَكْتَتَيْنِ سَكْتَةً إِذَا كَبَّرَ وَسَكْتَةً إِذَا فَرَغَ مِنْ قِرَاءَةِ{ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ }فَحَفِظَ ذَلِكَ سَمُرَةُ وَأَنْكَرَ عَلَيْهِ عِمْرَانُ بْنُ حُصَيْنٍ فَكَتَبَا فِي ذَلِكَ إِلَى أُبَيِّ بْنِ كَعْبٍ فَكَانَ فِي كِتَابِهِ إِلَيْهِمَا أَوْ فِي رَدِّهِ عَلَيْهِمَا أَنَّ سَمُرَةَ قَدْ حَفِظَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yazid] telah menceritakan kepada kami [Sa'id] telah menceritakan kepada kami [Qatadah] dari [Al Hasan] bahwa Samurah bin Jundab dan 'Imran bin Hushain saling mengingatkan (sesuatu), maka [Samurah bin Jundab] menceritakan bahwa dirinya hafal dari Rasulullah shallallahu 'alaihi wasallam dua tempat diam sejenaknya beliau (dalam sholat), pertama setelah takbir dan yang satunya ketika selesai dari membaca \"GHAIRIL MAGHDLUUBI 'ALAIHIM WALADL DLLAALLIN\", Samurah hafal yang demikian itu, namun Imran bin Hushain mengingkarinya, lantas keduanya menulis surat kepada Ubay bin Ka'b, maka [Ubay] membalas suratnya atau balasan dari surat mereka berdua bahwa Samurah memang telah hafal (dari Nabi).\""
            },
            {
                "number": 649,
                "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ بِهَذَا قَالَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ قَالَسَكْتَتَانِ حَفِظْتُهُمَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيهِ قَالَ سَعِيدٌ قُلْنَا لِقَتَادَةَ مَا هَاتَانِ السَّكْتَتَانِ قَالَ إِذَا دَخَلَ فِي صَلَاتِهِ وَإِذَا فَرَغَ مِنْ الْقِرَاءَةِ ثُمَّ قَالَ بَعْدُ وَإِذَا قَالَ{ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ }",
                "id": "Telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Sa'id] dengan redaksi ini, katanya; dari [Qatadah] dari [Al Hasan] dari [Samurah] dia berkata; \"Dua tempat pemberhentian sejenak yang pernah saya hafal dari Rasulullah shallallahu 'alaihi wasallam, (Abdul A'la) mengatakan dalam hadits tersebut, Sa'id berkata; kami berkata kepada Qatadah; \"Di manakah dua tempat pemberhentian sejenak tersebut?\" jawabnya; \"Apabila telah masuk sholat (setelah takbir -pent) dan ketika selesai dari membaca (surat Al Qur'an).\" Setelah itu Qatadah mengatakan; \"Ketika selesai membaca; \"GHAIRIL MAGHDLUUBI 'ALAIHIM WALADL DLLAALLIN.\""
            },
            {
                "number": 650,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ عُمَارَةَ ح و حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا عَبْدُ الْوَاحِدِ عَنْ عُمَارَةَ الْمَعْنَى عَنْ أَبِي زُرْعَةَ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَبَّرَ فِي الصَّلَاةِ سَكَتَ بَيْنَ التَّكْبِيرِ وَالْقِرَاءَةِ فَقُلْتُ لَهُ بِأَبِي أَنْتَ وَأُمِّي أَرَأَيْتَ سُكُوتَكَ بَيْنَ التَّكْبِيرِ وَالْقِرَاءَةِ أَخْبِرْنِي مَا تَقُولُ قَالَ اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ اللَّهُمَّ أَنْقِنِي مِنْ خَطَايَايَ كَالثَّوْبِ الْأَبْيَضِ مِنْ الدَّنَسِ اللَّهُمَّ اغْسِلْنِي بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abu Syu'aib] telah menceritakan kepada kami [Muhammad bin Fudlail] dari ['Umarah]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Abu Kamil] telah menceritakan kepada kami [Abdul Wahid] dari ['Umarah] sedangkan ma'na haditsnya dari [Abu Zur'ah] dari [Abu Hurairah] dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam mengucapkan takbir dalam sholat, maka beliau akan diam sejenak antara takbir dan qira'ah (membaca surat Al Fatihah), maka kataku kepadanya; \"Demi ayah dan ibuku sebagai tebusanmu, beritahukanlah kepadaku, apa yang anda baca sewaktu anda diam antara takbir dan membaca Al Fatihah?\" beiau menjawab: \"ALLAHUMMA BAA'ID BAINI WA BAINA KHATHAAYAYA KAMAA BAA'ATTA BAINAL MASYRIQI WAL MAGHRIB, ALLAHUMMA ANQINII MIN KHATHAAYAAYA KATSSAUBIL ABYADLI MINAD DANAS, ALLAHUMMAGH SILNII BIS TSALJI WAL MAA`I WAL BARAD (Ya Allah, jauhkanlah antara aku dengan dosa-dosaku, sebagaimana Engkau jauhkan jarak antara timur dan barat, ya Allah bersihkanlah kesalahan-kesalahanku sebagaimana bersihnya kain putih dari kotoran, ya Allah cucilah diriku dengan salju, air dan embun).\""
            },
            {
                "number": 651,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ وَعُثْمَانَ كَانُوا يَفْتَتِحُونَ الْقِرَاءَةَ بِ{ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ }",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam, Abu Bakar, Umar dan Utsman, mereka semua memulai bacaannya dengan \"ALHAMDULILLAHI RABBIL 'AALAMIN.\""
            },
            {
                "number": 652,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ عَنْ حُسَيْنٍ الْمُعَلِّمِ عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ عَنْ أَبِي الْجَوْزَاءِ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَفْتَتِحُ الصَّلَاةَ بِالتَّكْبِيرِ وَالْقِرَاءَةِ بِ{ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ }وَكَانَ إِذَا رَكَعَ لَمْ يُشَخِّصْ رَأْسَهُ وَلَمْ يُصَوِّبْهُ وَلَكِنْ بَيْنَ ذَلِكَ وَكَانَ إِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ لَمْ يَسْجُدْ حَتَّى يَسْتَوِيَ قَائِمًا وَكَانَ يَقُولُ فِي كُلِّ رَكْعَتَيْنِ التَّحِيَّاتُ وَكَانَ إِذَا جَلَسَ يَفْرِشُ رِجْلَهُ الْيُسْرَى وَيَنْصِبُ رِجْلَهُ الْيُمْنَى وَكَانَ يَنْهَى عَنْ عَقِبِ الشَّيْطَانِ وَعَنْ فَرْشَةِ السَّبُعِ وَكَانَ يَخْتِمُ الصَّلَاةَ بِالتَّسْلِيمِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdul Warits bin Sa'id] dari [Husain Al Mu'allim] dari [Budail bin Maisarah] dari [Abu Al Jauza`] dari [Aisyah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam memulai sholatnya dengan takbir dan membaca \"AL HAMDULILLAHI RABBIL 'AALAMIIN\", dan apabila hendak ruku', beliau tidak menengadah dan tidak pula terlalu menunduk, akan tetapi pertengahan antara keduanya. Apabila mengangkat kepala dari ruku' (i'tidal), beliau tidak langsung sujud sehingga diri beliau berdiri tegap, dan di setiap dua raka'at beliau biasa membaca; \"AT TAHIYYAT.\" Apabila duduk, beliau duduk di atas kaki kiri dan menegakkan kaki kanannya, beliau juga melarang duduknya syetan (yaitu duduk di atas tumit) dan melarang menghamparkan kedua telapak tangan dan hasta seperti binatang buas (ketika sujud), beliau menutup sholatnya dengan salam.\""
            },
            {
                "number": 653,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ الْمُخْتَارِ بْنِ فُلْفُلٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُنْزِلَتْ عَلَيَّ آنِفًا سُورَةٌ فَقَرَأَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ حَتَّى خَتَمَهَا قَالَ هَلْ تَدْرُونَ مَا الْكَوْثَرُ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ فَإِنَّهُ نَهْرٌ وَعَدَنِيهِ رَبِّي فِي الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sarri] telah menceritakan kepada kami [Ibnu Fudlail] dari [Al Mukhtar bin Fulful] dia berkata; saya mendengar [Anas bin Malik] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tadi telah di turunkan suatu surat kepadaku.\" Lalu beliau membaca: \"BISMILLAHIRRAHMAANIRRAHIM, INNAA A'THAINAAKAL KAUTSAR …\" hingga akhir ayat. Beliau bersabda: \"Apakah kalian tahu Al Kautsar?\" para sahabat menjawab; \"Allah dan rasul-Nya yang lebih mengetahui.\" Beliau bersabda: \"Ia adalah sungai di dalam surga yang telah di janjikan oleh Rabbku kepadaku kelak.\""
            },
            {
                "number": 654,
                "arab": "حَدَّثَنَا قَطَنُ بْنُ نُسَيْرٍ حَدَّثَنَا جَعْفَرٌ حَدَّثَنَا حُمَيْدٌ الْأَعْرَجُ الْمَكِّيُّ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَوَذَكَرَ الْإِفْكَ قَالَتْ جَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَشَفَ عَنْ وَجْهِهِ وَقَالَ أَعُوذُ بِالسَّمِيعِ الْعَلِيمِ مِنْ الشَّيْطَانِ الرَّجِيمِ{ إِنَّ الَّذِينَ جَاءُوا بِالْإِفْكِ عُصْبَةٌ مِنْكُمْ }الْآيَةَقَالَ أَبُو دَاوُد وَهَذَا حَدِيثٌ مُنْكَرٌ قَدْ رَوَى هَذَا الْحَدِيثَ جَمَاعَةٌ عَنْ الزُّهْرِيِّ لَمْ يَذْكُرُوا هَذَا الْكَلَامَ عَلَى هَذَا الشَّرْحِ وَأَخَافُ أَنْ يَكُونَ أَمْرُ الِاسْتِعَاذَةِ مِنْ كَلَامِ حُمَيْدٍ",
                "id": "Telah menceritakan kepada kami [Qathn bin Nusair] telah menceritakan kepada kami [Ja'far] telah menceritakan kepada kami [Humaid Al A'raj Al Makki] dari [Ibnu Syihab] dari ['Urwah] dari [Aisyah] -kemudian 'Urwah menyebutkan tentang haditsul ifki (berita kebohongan terhadap diri Aisyah) - Aisyah berkata; Suatu ketika Rasulullah shallallahu 'alaihi wasallam duduk dan mengusap wajahnya sambil mengucapkan: \"A'UUDZU BILLAHIS-SAMI'IL 'ALIM MINASY-SYAITHANIR RAJIM. INNAL LADZINA JAA-U BIL IFKI 'USHBATUN MINKUM\" (Sesungguhnya orang-orang yang membawa berita bohong itu adalah dari golongan kamu juga).\" QS. An Nur: 11. Abu Daud berkata; \"Ini adalah hadits munkar, dan hadits ini juga di riwayatkan oleh beberapa orang dari Az Zuhri, namun mereka tidak menyebutkan perkataan ini sebagai penjelas, dan aku khawatir \"istiadzah\" pada redaksi ini dari perkataan Humaid.\""
            },
            {
                "number": 655,
                "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا هُشَيْمٌ عَنْ عَوْفٍ عَنْ يَزِيدَ الْفَارِسِيِّ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ قَالَقُلْتُ لِعُثْمَانَ بْنِ عَفَّانَ مَا حَمَلَكُمْ أَنْ عَمَدْتُمْ إِلَى بَرَاءَةَ وَهِيَ مِنْ الْمِئِينَ وَإِلَى الْأَنْفَالِ وَهِيَ مِنْ الْمَثَانِي فَجَعَلْتُمُوهُمَا فِي السَّبْعِ الطِّوَالِ وَلَمْ تَكْتُبُوا بَيْنَهُمَا سَطْرَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ قَالَ عُثْمَانُ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا تَنَزَّلُ عَلَيْهِ الْآيَاتُ فَيَدْعُو بَعْضَ مَنْ كَانَ يَكْتُبُ لَهُ وَيَقُولُ لَهُ ضَعْ هَذِهِ الْآيَةَ فِي السُّورَةِ الَّتِي يُذْكَرُ فِيهَا كَذَا وَكَذَا وَتَنْزِلُ عَلَيْهِ الْآيَةُ وَالْآيَتَانِ فَيَقُولُ مِثْلَ ذَلِكَ وَكَانَتْ الْأَنْفَالُ مِنْ أَوَّلِ مَا أُنْزِلَ عَلَيْهِ بِالْمَدِينَةِ وَكَانَتْ بَرَاءَةُ مِنْ آخِرِ مَا نَزَلَ مِنْ الْقُرْآنِ وَكَانَتْ قِصَّتُهَا شَبِيهَةً بِقِصَّتِهَا فَظَنَنْتُ أَنَّهَا مِنْهَا فَمِنْ هُنَاكَ وَضَعْتُهَا فِي السَّبْعِ الطِّوَالِ وَلَمْ أَكْتُبْ بَيْنَهُمَا سَطْرَ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِحَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ حَدَّثَنَا مَرْوَانُ يَعْنِي ابْنَ مُعَاوِيَةَ أَخْبَرَنَا عَوْفٌ الْأَعْرَابِيُّ عَنْ يَزِيدَ الْفَارِسِيِّ حَدَّثَنَا ابْنُ عَبَّاسٍ بِمَعْنَاهُ قَالَ فِيهِ فَقُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يُبَيِّنْ لَنَا أَنَّهَا مِنْهَا قَالَ أَبُو دَاوُد قَالَ الشَّعْبِيُّ وَأَبُو مَالِكٍ وَقَتَادَةُ وَثَابِتُ بْنُ عُمَارَةَ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَكْتُبْ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ حَتَّى نَزَلَتْ سُورَةُ النَّمْلِ هَذَا مَعْنَاهُ",
                "id": "Telah mengabarkan kepada kami ['Amru bin 'Aun] telah mengabarkan kepada kami [Husyaim] dari ['Auf] dari [Yazid Al Farisi] dia berkata; saya mendengar [Ibnu Abbas] berkata; aku bertanya kepada Utsman bin 'Affan; \"Apa yang menyebabkan kalian sengaja meletakkan surat surat Bara'ah (At Taubah) padahal dia termasuk dari mi`in (surat yang ayatnya sampai seratus) dan surat Al Anfal padahal dia termasuk dari al matsani (surat yang ayatnya kurang dari seratus) kemudian kalian menyatukan keduanya termasuk dari tujuh surat panjang, dan belum kalian tulis antara keduanya dengan batas \"bismillaahir rahmaanir rahim?\" [Utsman] berkata; \"Ketika beberapa ayat turun kepada Nabi shallallahu 'alaihi wasallam, maka beliau memanggil beberapa orang yang akan menuliskan di sisinya, kemudian beliau bersabda kepadanya: \"Letakkan ayat ini dalam surat yang disebutkan di dalamnya begini dan begini, \" Ketika turun kepada beliau satu ayat atau dua ayat, maka beliau akan mengatakan seperti itu. Surat Al Anfal termasuk dari surat yang pertama diturunkan di Madinah, sedangkan Bara'ah (At Taubah) termasuk dari surat yang terakhir diturunkan di Madinah, sementara kandungannya mirip dengan kandungan yang ada dalam surat Al Anfal, maka perkiraanku, surat Al Bara'ah bagian dari surat Al Anfal, oleh karena itu aku meletakkan surat tersebut termasuk dari tujuh surat yang panjang, sehingga aku tidak menulis dengan batasan \"Bismillahir rahmanir rahim.\" Telah menceritakan kepada kami [Ziyad bin Ayyub] telah menceritakan kepada kami [Marwan yaitu Ibnu Mu'awiyah] telah mengabarkan kepada kami ['Auf Al A'Rabi'ah] dari [Yazid Al Farisi] telah menceritakan kepada kami [Ibnu Abbas] semakna dengan hadits di atas, dalam hadits tersebut dia mengatakan; \"Rasulullah shallallahu 'alaihi wasallam telah wafat, namun beliau belum menjelaskan kepada kami jika surat Al Anfal bagian dari surat Al Bara'ah.\" Abu Daud berkata; As Sya'bi, Abu Malik, Qatadah dan Tsabit bin 'Umarah mengatakan; \"Sesungguhnya Nabi shallallahu 'alaihi wasallam tidak menulis \"Bismillahir rahmaanir rahim\" hingga turun surat An Naml, demikian makna dari hadits tersebut.\""
            },
            {
                "number": 656,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ وَابْنُ السَّرْحِ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ سَعِيدِ بْنِ جُبَيْرٍ قَالَ قُتَيْبَةُ فِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَعْرِفُ فَصْلَ السُّورَةِ حَتَّى تَنَزَّلَ عَلَيْهِ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِوَهَذَا لَفْظُ ابْنِ السَّرْحِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Ahmad bin Muhammad Al Marwazi] serta [Ibnu Sarh] mereka mengatakan telah menceritakan kepada kami [Sufyan] dari ['Amru] dari [Sa'id bin Jubair] -Qutaibah mengatakan dalam riwayat tersebut- dari [Ibnu Abbas] dia berkata; \"Nabi shallallahu 'alaihi wasallam tidak mengetahui pemisah antar surat hingga diturunkan kepada beliau \"Bismillahir Rahmanir Rahim\" (dengan menyebut nama Allah yang maha pengasih lagi maha penyayang). Lafadz ini dari Ibnu As Sarh.\""
            },
            {
                "number": 657,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عُمَرُ بْنُ عَبْدِ الْوَاحِدِ وَبِشْرُ بْنُ بَكْرٍ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَأَقُومُ إِلَى الصَّلَاةِ وَأَنَا أُرِيدُ أَنْ أُطَوِّلَ فِيهَا فَأَسْمَعُ بُكَاءَ الصَّبِيِّ فَأَتَجَوَّزُ كَرَاهِيَةَ أَنْ أَشُقَّ عَلَى أُمِّهِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Ibrahim] telah menceritakan kepada kami [Umar bin Abdul Wahid] dan [Bisr bin Bakr] dari [Al Auza'i] dari [Yahya bin Abu Katsir] dari [Abdullah bin Abu Qatadah] dari [ayahnya] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku hendak memanjangkan (bacaan) ketika aku mengerjakan sholat, lalu aku mendengar tangisan anak kecil, maka aku mempersingkat (bacaan sholat) karena aku tidak ingin memberatkan (hati) ibunya.\""
            },
            {
                "number": 658,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو وَسَمِعَهُ مِنْ جَابِرٍ قَالَكَانَ مُعَاذٌ يُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ يَرْجِعُ فَيَؤُمُّنَا قَالَ مَرَّةً ثُمَّ يَرْجِعُ فَيُصَلِّي بِقَوْمِهِ فَأَخَّرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةً الصَّلَاةَ وَقَالَ مَرَّةً الْعِشَاءَ فَصَلَّى مُعَاذٌ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ جَاءَ يَؤُمُّ قَوْمَهُ فَقَرَأَ الْبَقَرَةَ فَاعْتَزَلَ رَجُلٌ مِنْ الْقَوْمِ فَصَلَّى فَقِيلَ نَافَقْتَ يَا فُلَانُ فَقَالَ مَا نَافَقْتُ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ مُعَاذًا يُصَلِّي مَعَكَ ثُمَّ يَرْجِعُ فَيَؤُمُّنَا يَا رَسُولَ اللَّهِ وَإِنَّمَا نَحْنُ أَصْحَابُ نَوَاضِحَ وَنَعْمَلُ بِأَيْدِينَا وَإِنَّهُ جَاءَ يَؤُمُّنَا فَقَرَأَ بِسُورَةِ الْبَقَرَةِ فَقَالَ يَا مُعَاذُ أَفَتَّانٌ أَنْتَ أَفَتَّانٌ أَنْتَ اقْرَأْ بِكَذَا اقْرَأْ بِكَذَا قَالَ أَبُو الزُّبَيْرِ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى وَاللَّيْلِ إِذَا يَغْشَىفَذَكَرْنَا لِعَمْرٍو فَقَالَ أُرَاهُ قَدْ ذَكَرَهُ حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا طَالِبُ بْنُ حَبِيبٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ جَابِرٍ يُحَدِّثُ عَنْ حَزْمِ بْنِ أُبَيِّ بْنِ كَعْبٍ أَنَّهُ أَتَى مُعَاذَ بْنَ جَبَلٍ وَهُوَ يُصَلِّي بِقَوْمٍ صَلَاةَ الْمَغْرِبِ فِي هَذَا الْخَبَرِ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا مُعَاذُ لَا تَكُنْ فَتَّانًا فَإِنَّهُ يُصَلِّي وَرَاءَكَ الْكَبِيرُ وَالضَّعِيفُ وَذُو الْحَاجَةِ وَالْمُسَافِرُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Sufyan] dari ['Amru] dan dia mendengarnya dari [Jabir] dia berkata; \"Mu'adz biasa sholat bersama Nabi shallallahu 'alaihi wasallam, kemudian dia kembali dan menjadi imam (sholat) bagi kami' -di lain kali Jabir mengatakan; kemudian dia kembali dan menjadi imam (sholat) bagi kaumnya-, pada suatu malam, Nabi shallallahu 'alaihi wasallam mengakhirkan sholat -di lain kali Jabir mengatakan; sholat Isya'- Mu'adz mengerjakan sholat bersama Nabi shallallahu 'alaihi wasallam, lalu kembali (ke kaumnya) menjadi imam (sholat) bagi kaumnya dengan membaca surat Al Baqarah, (karena panjangnya) maka salah seorang laki-laki memisahkan diri dari Jama'ah dan mengerjakan sholat sendirian, hingga di katakan kepadanya; \"kamu telah berbuat nifak wahai fulan.\" Laki-laki itu menimpali; \"aku tidak munafik.\" Lantas laki-laki itu pergi menghadap Rasulullah shallallahu 'alaihi wasallam seraya berkata; \"Sesungguhnya Mu'adz biasa mengerjakan sholat bersama anda, kemudian ia kembali (ke kaumnya) dan menjadi imam (sholat) bagi kami, wahai Rasulullah, kami hanya pemilik unta pengangkut air dan kami harus bekerja keras, sesungguhnya dia datang mengimami kami dengan membaca surat Al Baqarah.\" Maka beliau bersabda: \"Wahai Mu'adz, apakah kamu hendak menyebarkan fitnah, apakah kamu hendak menyebarkan fitnah, bacalah surat ini, bacalah surat ini.\" Abu Zubair mengatakan; \"(cukup) dengan membaca 'sabbihisma rabbikal a'la dan wallaili idzaa yaghsyaa.\" Kemudian aku sebutkan perkara itu kepada 'amru, maka dia berkata; \"Aku telah melihat Jabir telah menyebutkan hadits tersebut.\" Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Thalib bin Habib] telah menceritakan kepada kami [Abdurrahman bin Jabir] dia menceritakan dari [Hazm bin Ubay bin Ka'b] bahwa dia menemui Mu'adz bin Jabal yang sedang mengerjakan sholat maghrib (menjadi imam) bersama kaumnya…\" dalam hadits ini perawi mengatakan; \"Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Mu'adz, janganlah kamu menjadi penyebar fitnah, karena yang mengerjakan sholat di belakangmu terdapat orang tua, orang yang lemah, orang yang memiliki keperluan dan musafir.\" "
            },
            {
                "number": 659,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ عَنْ زَائِدَةَ عَنْ سُلَيْمَانَ عَنْ أَبِي صَالِحٍ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِرَجُلٍ كَيْفَ تَقُولُ فِي الصَّلَاةِ قَالَ أَتَشَهَّدُ وَأَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنْ النَّارِ أَمَا إِنِّي لَا أُحْسِنُ دَنْدَنَتَكَ وَلَا دَنْدَنَةَ مُعَاذٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَوْلَهَا نُدَنْدِنُحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا مُحَمَّدُ بْنُ عَجْلَانَ عَنْ عُبَيْدِ اللَّهِ بْنِ مِقْسَمٍ عَنْ جَابِرٍ ذَكَرَ قِصَّةَ مُعَاذٍ قَالَ وَقَالَ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْفَتَى كَيْفَ تَصْنَعُ يَا ابْنَ أَخِي إِذَا صَلَّيْتَ قَالَ أَقْرَأُ بِفَاتِحَةِ الْكِتَابِ وَأَسْأَلُ اللَّهَ الْجَنَّةَ وَأَعُوذُ بِهِ مِنْ النَّارِ وَإِنِّي لَا أَدْرِي مَا دَنْدَنَتُكَ وَلَا دَنْدَنَةُ مُعَاذٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي وَمُعَاذًا حَوْلَ هَاتَيْنِ أَوْ نَحْوَ هَذَا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Husain bin Ali] dari [Za`idah] dari [Sulaiman] dari [Abu Shalih] dari [sebagian sahabat Nabi shallallahu 'alaihi wasallam] katanya; Nabi shallallahu 'alaihi wasallam pernah bertanya kepada seorang laki-laki: \"Bagaimana kamu berdo'a dalam sholat?\" laki-laki tersebut menjawab; \"Aku membaca tasyahud dan mengucapkan; \"ALLAHUMMA INNI AS`ALUKAL JANNATA WA A'UUDZUBIKA MINANNAAR (Ya Allah, aku memohon kepada Engkau surga dan berlindung kepada Engkau dari api neraka). (Ma'af) kami tidak dapat memahami dengan baik gumam anda gumam Mu'adz (ketika berdo'a).\" maka Nabi shallallahu 'alaihi wasallam bersabda: \"Seputar itulah kami bergumam (ketika berdo'a).\" Telah menceritakan kepada kami [Yahya bin Habib] telah menceritakan kepada kami [Khalid bin Al Harits] telah menceritakan kepada kami [Muhammad bin 'Ajlan] dari ['ubaidhullah bin Miqsam] dari [Jabir] -dia menyebutkan kisahnya Mu'adz- katanya; \"Nabi shallallahu 'alaihi wasallam bertanya kepada seorang pemuda: \"Wahai anak saudaraku, apa yang kamu perbuat (baca) ketika mengerjakan sholat?\" pemuda itu menjawab; \"Aku membaca surat Al Fatihah dan memohon surga-Nya Allah dan berlindung dari api nerakanya Allah, sesungguhnya aku tidak dapat mendengar gumam anda begitu juga dengan gumam Mu'adz.\" Lantas Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku dan Mu'adz (juga berdo'a) sekitar dua hal itu atau seperti itu.\""
            },
            {
                "number": 660,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ لِلنَّاسِ فَلْيُخَفِّفْ فَإِنَّ فِيهِمْ الضَّعِيفَ وَالسَّقِيمَ وَالْكَبِيرَ وَإِذَا صَلَّى لِنَفْسِهِ فَلْيُطَوِّلْ مَا شَاءَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Abu Az Zinnad] dari [Al A'raj] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian mengerjakan sholat dengan orang banyak, maka peringanlah, karena di antara mereka terdapat orang yang lemah, sakit dan lanjut usia, namun apabila dia sholat sendirian, maka ia boleh memanjangkan sesuka hati.\""
            },
            {
                "number": 661,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ ابْنِ الْمُسَيِّبِ وَأَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا صَلَّى أَحَدُكُمْ لِلنَّاسِ فَلْيُخَفِّفْ فَإِنَّ فِيهِمْ السَّقِيمَ وَالشَّيْخَ الْكَبِيرَ وَذَا الْحَاجَةِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Ibnu Musayyib] dan [Abu Salamah] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian sholat bersama orang banyak, hendaknya ia meringankannya, karena di antara mereka ada orang yang sakit, usia lanjut dan orang yang memiliki keperluan.\""
            },
            {
                "number": 662,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ بَكْرٍ يَعْنِي ابْنَ مُضَرَ عَنْ ابْنِ عَجْلَانَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ عُمَرَ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ عَنَمَةَ الْمُزَنِيِّ عَنْ عَمَّارِ بْنِ يَاسِرٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الرَّجُلَ لَيَنْصَرِفُ وَمَا كُتِبَ لَهُ إِلَّا عُشْرُ صَلَاتِهِ تُسْعُهَا ثُمْنُهَا سُبْعُهَا سُدْسُهَا خُمْسُهَا رُبْعُهَا ثُلُثُهَا نِصْفُهَا",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Bakr yaitu ibnu mudlar] dari [Ibnu 'Ajlan] dari [Sa'id Al Maqburi] dari ['Umar bin Hakam] dari [Abdullah bin 'Anamah Al Muzanni] dari ['Ammar bin Yasir] dia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya ada seseorang yang benar-benar mengerjakan sholat, namun pahala sholat yang tercatat baginya hanyalah sepersepuluh (dari) sholatnya, sepersembilan, seperdelapan, sepetujuh, seperenam, seperlima, seperempat, sepertiga, dan seperduanya saja.\""
            },
            {
                "number": 663,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ قَيْسِ بْنِ سَعْدٍ وَعُمَارَةَ بْنِ مَيْمُونٍ وَحَبِيبٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ أَنَّ أَبَا هُرَيْرَةَ قَالَفِي كُلِّ صَلَاةٍ يُقْرَأُ فَمَا أَسْمَعَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْمَعْنَاكُمْ وَمَا أَخْفَى عَلَيْنَا أَخْفَيْنَا عَلَيْكُمْ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Qais bin Sa'd] dan ['Umarah bin Maimun] serta [Habib] dari ['Atha` bin Abu Rabah] bahwa [Abu Hurairah] berkata; \"Di dalam sholat itu ada yang di baca, dan apa yang Rasulullah shallallahu 'alaihi wasallam perdengarkan kepada kami, maka kami pun akan perdengarkan kepada kalian, dan apa yang beliau samarkan (dalam bacaan) kepada kami, maka kami pun akan menyamarkan kepada kalian.\""
            },
            {
                "number": 664,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ هِشَامِ بْنِ أَبِي عَبْدِ اللَّهِ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ الْحَجَّاجِ وَهَذَا لَفْظُهُ عَنْ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ قَالَ ابْنُ الْمُثَنَّى وَأَبِي سَلَمَةَ ثُمَّ اتَّفَقَا عَنْ أَبِي قَتَادَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِنَا فَيَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ بِفَاتِحَةِ الْكِتَابِ وَسُورَتَيْنِ وَيُسْمِعُنَا الْآيَةَ أَحْيَانًا وَكَانَ يُطَوِّلُ الرَّكْعَةَ الْأُولَى مِنْ الظُّهْرِ وَيُقَصِّرُ الثَّانِيَةَ وَكَذَلِكَ فِي الصُّبْحِ قَالَ أَبُو دَاوُد لَمْ يَذْكُرْ مُسَدَّدٌ فَاتِحَةَ الْكِتَابِ وَسُورَةًحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هَمَّامٌ وَأَبَانُ بْنُ يَزِيدَ الْعَطَّارُ عَنْ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ بِبَعْضِ هَذَا وَزَادَ فِي الْأُخْرَيَيْنِ بِفَاتِحَةِ الْكِتَابِ وَزَادَ عَنْ هَمَّامٍ قَالَ وَكَانَ يُطَوِّلُ فِي الرَّكْعَةِ الْأُولَى مَا لَا يُطَوِّلُ فِي الثَّانِيَةِ وَهَكَذَا فِي صَلَاةِ الْعَصْرِ وَهَكَذَا فِي صَلَاةِ الْغَدَاةِ حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ قَالَ فَظَنَنَّا أَنَّهُ يُرِيدُ بِذَلِكَ أَنْ يُدْرِكَ النَّاسُ الرَّكْعَةَ الْأُولَى",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Hisyam bin Abu Abdullah], dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Al Hajjaj] -dan ini adalah lafadz hadits darinya- dari [Yahya] dari [Abdullah bin Abu Qatadah], berkata [Ibnu Al Mutsanna] dan [Abu Salamah], kemudian keduanya sepakat dari [Abu Qotadah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam sholat mengimami kami, beliau membaca Al Fatihah dan dua surat pada dua raka'at pertama dalam sholat Dhuhur dan Ashar. Kadang-kadang beliau memperdengarkan bacaan ayat kepada kami, dan biasanya beliau memanjangkan raka'at pertama pada sholat dzuhur dan memperpendek pada raka'at keduanya, begitu juga pada waktu sholat subuh.\" Abu Daud berkata; Musaddad tidak menyebutkan Al Fatihah dan surat. Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Hammam] dan [Aban bin Yazid Al 'Atthar] dari [Yahya] dari [Abdullah bin Abu Qatadah] dari [ayahnya] dengan menambahkan pada sebagian hadits ini; \"… Pada dua raka'at terakhir dengan membaca Al Fatihah…\" Dan dia menambahkan dari Hammam katanya; \"… Dan beliau memanjangkan berdirinya pada raka'at pertama, tidak sepanjang pada raka'at kedua, demikian juga pada sholat Ashar dan sholat subuh...\" Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Yahya] dari [Abdullah bin Abu Qatadah] dari [ayahnya] dia berkata; \"Hingga kami menyangka beliau memanjangkan bacaannya karena ingin menunggu supaya orang-orang mendapatkan raka'at pertama.\""
            },
            {
                "number": 665,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ أَبِي مَعْمَرٍ قَالَ قُلْنَا لِخَبَّابٍهَلْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ قَالَ نَعَمْ قُلْنَا بِمَ كُنْتُمْ تَعْرِفُونَ ذَاكَ قَالَ بِاضْطِرَابِ لِحْيَتِهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdul Wahid bin Ziyad] dari [Al A'masy] dari ['Umarah bin 'Umair] dari [Abu Ma'mar] dia berkata; kami bertanya kepada [Khabbab]; \"Apakah Rasulullah shallallahu 'alaihi wasallam membaca (surat al Fatihah) dalam sholat dluhur dan Ashar?\" jawabnya; \"Ya, benar.\" Kami bertanya; \"Dengan apa kalian mengetahuinya?\" jawabnya; \"Dengan gerakan jenggot beliau.\""
            },
            {
                "number": 666,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا مُحَمَّدُ بْنُ جُحَادَةَ عَنْ رَجُلٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَىأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُومُ فِي الرَّكْعَةِ الْأُولَى مِنْ صَلَاةِ الظُّهْرِ حَتَّى لَا يُسْمَعَ وَقْعُ قَدَمٍ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Muhammad bin Juhadah] dari [seorang laki-laki] dari [Abdullah bin Abu Aufa] bahwa Nabi shallallahu 'alaihi wasallam berdiri pada raka'at pertama dalam sholat dluhur hingga tidak terdengar suara pijakan kaki.\""
            },
            {
                "number": 667,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ أَبِي عَوْنٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَقَالَ عُمَرُ لِسَعْدٍ قَدْ شَكَاكَ النَّاسُ فِي كُلِّ شَيْءٍ حَتَّى فِي الصَّلَاةِ قَالَ أَمَّا أَنَا فَأَمُدُّ فِي الْأُولَيَيْنِ وَأَحْذِفُ فِي الْأُخْرَيَيْنِ وَلَا آلُو مَا اقْتَدَيْتُ بِهِ مِنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ذَاكَ الظَّنُّ بِكَ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin 'ubaidhullah Abu 'Aun] dari [Jabir bin Samurah] dia berkata; Umar berkata kepada Sa'd; \"Orang-orang mengadukan segala sesuatu kepadamu sampai dalam masalah sholat, [Sa'd] menjawab; \"Aku suka memanjangkan sholatku pada dua raka'at pertama dan memendekkannya pada dua raka'at yang terakhir, aku tidak akan mengurangi sedikitpun apa yang telah aku dapatkan dari tata cara sholat Rasulullah shallallahu 'alaihi wasallam.\" Umar berkata; \"Demikianlah dugaan saya tentang dirimu!.\""
            },
            {
                "number": 668,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ يَعْنِي النُّفَيْلِيَّ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا مَنْصُورٌ عَنْ الْوَلِيدِ بْنِ مُسْلِمٍ الْهُجَيْمِيِّ عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَحَزَرْنَا قِيَامَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الظُّهْرِ وَالْعَصْرِ فَحَزَرْنَا قِيَامَهُ فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ مِنْ الظُّهْرِ قَدْرَ ثَلَاثِينَ آيَةً قَدْرَ الم تَنْزِيلُ السَّجْدَةِ وَحَزَرْنَا قِيَامَهُ فِي الْأُخْرَيَيْنِ عَلَى النِّصْفِ مِنْ ذَلِكَ وَحَزَرْنَا قِيَامَهُ فِي الْأُولَيَيْنِ مِنْ الْعَصْرِ عَلَى قَدْرِ الْأُخْرَيَيْنِ مِنْ الظُّهْرِ وَحَزَرْنَا قِيَامَهُ فِي الْأُخْرَيَيْنِ مِنْ الْعَصْرِ عَلَى النِّصْفِ مِنْ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad yaitu An Nufaili] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Manshur] dari [Al Walid bin Muslim Al Hujaimi] dari [Abu As Shiddiq An Najji] dari [Abu Sa'id Al Khudri] dia berkata; \"Kami pernah memperkirakan berapa lama Rasulullah shallallahu 'alaihi wasallam berdiri ketika sholat Dzuhur dan Ashar, yaitu perkirakan kami pada dua raka'at pertama sholat Dzuhur seperti lamanya membaca kira-kira tiga puluh ayat, seperti membaca; \"Alif Lam Mim Tanziilul (surat as Sajadah), dan kami memperkirakan lama berdiri beliau pada dua raka'at terakhir, seperti setengah dari dua raka'at yang pertama. Lalu kami memperkirakan lama berdiri beliau dalam dua raka'at pertama sholat Ashar, sama dengan lama berdiri beliau dalam dua raka'at terakhir sholat Dzuhur, dan kami memperkirakan lama berdiri beliau dalam dua raka'at yang terakhir dalam sholat Ashar seperti separuh dari lamanya pada dua raka'at pertama.\""
            },
            {
                "number": 669,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ بِالسَّمَاءِ وَالطَّارِقِ وَالسَّمَاءِ ذَاتِ الْبُرُوجِ وَنَحْوِهِمَا مِنْ السُّوَرِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Simak bin Harb] dari [Jabir bin Samurah] bahwa pada waktu sholat Dhuhur dan Ashar Rasulullah shallallahu 'alaihi wasallam membaca (surat) \"WAS SAMAA`I WAT THAARIQ dan WAS SAMAA`I DZAATIL BURUUJ serta surat-surat seperti itu.\""
            },
            {
                "number": 670,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكٍ سَمِعَ جَابِرَ بْنَ سَمُرَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَحَضَتْ الشَّمْسُ صَلَّى الظُّهْرَ وَقَرَأَ بِنَحْوٍ مِنْ وَاللَّيْلِ إِذَا يَغْشَى وَالْعَصْرَ كَذَلِكَ وَالصَّلَوَاتِ كَذَلِكَ إِلَّا الصُّبْحَ فَإِنَّهُ كَانَ يُطِيلُهَا",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz] telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah] dari [Simak] dia mendengar [Jabir bin Samurah] berkata; \"Apabila matahari telah condong ke barat, beliau melaksanakan sholat dhuhur dan membaca (surat) seperti surat WALLAILI IDZAA YAGHSYAA, demikian juga dalam sholat-sholat yang lain kecuali sholat subuh, beliau memanjangkan bacaannya.\""
            },
            {
                "number": 671,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ وَيَزِيدُ بْنُ هَارُونَ وَهُشَيْمٌ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أُمَيَّةَ عَنْ أَبِي مِجْلَزٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ فِي صَلَاةِ الظُّهْرِ ثُمَّ قَامَ فَرَكَعَ فَرَأَيْنَا أَنَّهُ قَرَأَ تَنْزِيلَ السَّجْدَةِقَالَ ابْنُ عِيسَى لَمْ يَذْكُرْ أُمَيَّةَ أَحَدٌ إِلَّا مُعْتَمِرٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Mu'tamir bin Sulaiman] dan [Yazid bin Harun] serta [Husyaim] dari [Sulaiman At Taimi] dari [Umayyah] dari [Abu Mijlas] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam sujud pada waktu sholat Dluhur, kemudian beliau berdiri (dari sujud) lalu ruku', maka kami mengetahui bahwa beliau membaca surat As Sajdah.\" Ibnu Isa mengatakan; \"Umayyah tidak menyebutkan seorang pun kecuali hanya menyebutkan Mu'tamir.\""
            },
            {
                "number": 672,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ مُوسَى بْنِ سَالِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُبَيْدِ اللَّهِ قَالَدَخَلْتُ عَلَى ابْنِ عَبَّاسٍ فِي شَبَابٍ مِنْ بَنِي هَاشِمٍ فَقُلْنَا لِشَابٍّ مِنَّا سَلْ ابْنَ عَبَّاسٍ أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ فَقَالَ لَا لَا فَقِيلَ لَهُ فَلَعَلَّهُ كَانَ يَقْرَأُ فِي نَفْسِهِ فَقَالَ خَمْشًا هَذِهِ شَرٌّ مِنْ الْأُولَى كَانَ عَبْدًا مَأْمُورًا بَلَّغَ مَا أُرْسِلَ بِهِ وَمَا اخْتَصَّنَا دُونَ النَّاسِ بِشَيْءٍ إِلَّا بِثَلَاثِ خِصَالٍ أَمَرَنَا أَنْ نُسْبِغَ الْوُضُوءَ وَأَنْ لَا نَأْكُلَ الصَّدَقَةَ وَأَنْ لَا نُنْزِيَ الْحِمَارَ عَلَى الْفَرَسِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdul Warits] dari [Musa bin Salim] telah menceritakan kepada kami [Abdullah bin 'ubaidhullah] dia berkata; aku menemui Ibnu Abbas ketika dia berada di tengah-tengah pemuda Bani Hasyim, lalu kami berkata kepada seorang pemuda di antara kami; \"Tanyakanlah kepada Ibnu Abbas, apakah Rasulullah shallallahu 'alaihi wasallam membaca (surat) dalam sholat Dluhur dan Ashar?\" [Ibnu Abbas] menjawab; \"Tidak, tidak membaca.\" Maka di katakan kepadanya lagi; \"Barangkali dia membaca dalam hati.\" Maka Ibnu Abbas berkata; \"Sungguh ini lebih jelek dari (dugaan) yang pertama, beliau adalah seorang hamba yang di perintahkan untuk menyampaikan apa yang di tugaskan kepada beliau, beliau tidak pernah mengistimewakan kami dengan sesuatu pun di banding orang lain, kecuali tiga perkara; beliau memerintahkan kami untuk menyempurnakan wudlu`, kami tidak boleh makan uang zakat dan tidak boleh menjadikan keledai untuk menjantani kuda.\" "
            },
            {
                "number": 673,
                "arab": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا حُصَيْنٌ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَلَا أَدْرِي أَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ أَمْ لَا",
                "id": "Telah menceritakan kepada kami [Ziyad bin Ayyub] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Hushain] dari ['Ikrimah] dari [Ibnu Abbas] dia berkata; \"Aku tidak tahu, apakah Rasulullah shallallahu 'alaihi wasallam membaca (surat Al Qur'an) pada waktu sholat Dluhur dan Ashar ataukah tidak.\""
            },
            {
                "number": 674,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ أُمَّ الْفَضْلِ بِنْتَ الْحَارِثِ سَمِعَتْهُ وَهُوَ يَقْرَأُ وَالْمُرْسَلَاتِ عُرْفًا فَقَالَتْ يَا بُنَيَّ لَقَدْ ذَكَّرْتَنِي بِقِرَاءَتِكَ هَذِهِ السُّورَةِ إِنَّهَا لَآخِرُ مَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِهَا فِي الْمَغْرِبِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari ['ubaidhullah bin Abdullah bin 'Utbah] dari [Ibnu Abbas] bahwa Ummu Fadl binti Al Harits mendengarnya ketika dia membaca surat \"WAL MURSALAATI 'URFAA\" maka Ummu Fadl berkata; \"Wahai anakku, kamu telah mengingatkanku dengan bacaan suratmu itu, yaitu akhir bacaan Rasulullah shallallahu 'alaihi wasallam yang pernah aku dengar pada sholat Maghrib.\""
            },
            {
                "number": 675,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِ أَنَّهُ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِالطُّورِ فِي الْمَغْرِبِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Muhammad bin Jubair bin Muth'im] dari [ayahnya] bahwa dia berkata; aku mendengr Rasulullah shallallahu 'alaihi wasallam membaca surat At Thur pada waktu sholat Maghrib.\""
            },
            {
                "number": 676,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ ابْنِ جُرَيْجٍ حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ مَرْوَانَ بْنِ الْحَكَمِ قَالَ قَالَ لِي زَيْدُ بْنُ ثَابِتٍمَا لَكَ تَقْرَأُ فِي الْمَغْرِبِ بِقِصَارِ الْمُفَصَّلِ وَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْمَغْرِبِ بِطُولَى الطُّولَيَيْنِقَالَ قُلْتُ مَا طُولَى الطُّولَيَيْنِ قَالَ الْأَعْرَافُ وَالْأُخْرَى الْأَنْعَامُ قَالَ وَسَأَلْتُ أَنَا ابْنَ أَبِي مُلَيْكَةَ فَقَالَ لِي مِنْ قِبَلِ نَفْسِهِ الْمَائِدَةُ وَالْأَعْرَافُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Abdurrazaq] dari [Ibnu Juraij] telah menceritakan kepadaku [Ibnu Abu Mulaikah] dari ['Urwah bin Zubair] dari [Marwan bin Al Hakam] dia berkata; [Zaid bin Tsabit] berkata kepadaku; \"Kenapa anda biasa membaca surat-surat pendek pada saat sholat Maghrib? Padahal aku melihat Rasulullah shallallahu 'alaihi wasallam membaca dua surat panjang dari surat-surat panjang dalam sholat Maghrib?.\" Ibnu Abu Mulaikah berkata; \"Kataku; \"Apakah dua surat panjang dari surat-surat panjang tersebut?\" Urwah menjawab; \"Yaitu Al A'raf dan Al An'am.\" Ibnu Juraij berkata; Aku bertanya kepada Ibnu Abu Mulaikah, lalu menurut dirinya adalah surat Al Maidah dan Al A'raf.\""
            },
            {
                "number": 677,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا هِشَامُ بْنُ عُرْوَةَ أَنَّ أَبَاهُكَانَ يَقْرَأُ فِي صَلَاةِ الْمَغْرِبِ بِنَحْوِ مَا تَقْرَءُونَ وَالْعَادِيَاتِ وَنَحْوِهَا مِنْ السُّوَرِقَالَ أَبُو دَاوُد هَذَا يَدُلُّ عَلَى أَنَّ ذَاكَ مَنْسُوخٌ قَالَ أَبُو دَاوُد وَهَذَا أَصَحُّ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] telah mengabarkan kepada kami [Hisyam bin 'Urwah] bahwa dalam sholat Maghrib [ayahnya (Urwah)] biasa membaca (surat) sebatas kalian membaca surat \"WAL 'ADIYAT\" dan surat semisalnya.\" Abu Daud berkata; \"Ini menunjukkan bahwa hadits yang diatas terhapus, sedangkan hadits ini lebih shahih.\""
            },
            {
                "number": 678,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ السَّرْخَسِيُّ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ مُحَمَّدَ بْنَ إِسْحَقَ يُحَدِّثُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّهُ قَالَمَا مِنْ الْمُفَصَّلِ سُورَةٌ صَغِيرَةٌ وَلَا كَبِيرَةٌ إِلَّا وَقَدْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَؤُمُّ النَّاسَ بِهَا فِي الصَّلَاةِ الْمَكْتُوبَةِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id As Sarkhasi] telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [ayahku] dia berkata; saya mendengar [Muhammad bin Ishaq] menceritakan dari ['Amru bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa dia berkata; \"Tidak ada suatu surat yang pendek ataupun yang panjang melainkan aku telah mendengar Rasulullah shallallahu 'alaihi wasallam membacanya ketika mengimami orang-orang dalam sholat wajib.\""
            },
            {
                "number": 679,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا قُرَّةُ عَنْ النَّزَّالِ بْنِ عَمَّارٍ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ أَنَّهُصَلَّى خَلْفَ ابْنِ مَسْعُودٍ الْمَغْرِبَ فَقَرَأَ قُلْ هُوَ اللَّهُ أَحَدٌ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz] telah menceritakan kepada kami [ayahku] dari [Qurrah] dari [An Nazal bin 'Ammar] dari [Abu Utsman An Nahdi] bahwa dia sholat Maghrib di belakang Ibnu Mas'ud, maka [Ibnu Mas'ud] membaca surat Al Ikhlash \"Qul Huwallahu Ahad\". "
            },
            {
                "number": 680,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو عَنْ ابْنِ أَبِي هِلَالٍ عَنْ مُعَاذِ بْنِ عَبْدِ اللَّهِ الْجُهَنِيِّ أَنَّ رَجُلًا مِنْ جُهَيْنَةَ أَخْبَرَهُأَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الصُّبْحِ إِذَا زُلْزِلَتْ الْأَرْضُ فِي الرَّكْعَتَيْنِ كِلْتَيْهِمَا فَلَا أَدْرِي أَنَسِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْ قَرَأَ ذَلِكَ عَمْدًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku ['Amru] dari [Ibnu Abu Hilal] dari [Mu'adz bin Abdullah Al Juhani] bahwa [seseorang laki-laki dari Juhainah] memberitahukan kepadanya bahwa dirinya telah mendengar Nabi shallallahu 'alaihi wasallam membaca dalam sholat subuh \"IDZA ZULZILATIL-ARDHU ZILZALAHA\" di kedua rakaatnya, aku tidak tahu apakah Rasulullah shallallahu 'alaihi wasallam lupa ataukah beliau memang sengaja.\""
            },
            {
                "number": 681,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ عَنْ إِسْمَعِيلَ عَنْ أَصْبَغَ مَوْلَى عَمْرِو بْنِ حُرَيْثٍ عَنْ عَمْرِو بْنِ حُرَيْثٍ قَالَكَأَنِّي أَسْمَعُ صَوْتَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي صَلَاةِ الْغَدَاةِ فَلَا أُقْسِمُ بِالْخُنَّسِ الْجَوَارِي الْكُنَّسِ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] telah mengabarkan kepada kami [Isa yaitu Ibnu Yunus] dari [Isma'il] dari [Asbagh bekas budak 'Amru bin Huraits] dari [Amru bin Huraits] dia berkata; Pada waktu sholat shubuh, seakan-akan aku mendengar suara Nabi shallallahu 'alaihi wasallam membaca; \"FALAA UQSIMU BIL KHUNNAS, AL JAWAARIL KUNNAS.\" (Sebagian bacaan dari surat Attakwir) "
            },
            {
                "number": 682,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَأُمِرْنَا أَنْ نَقْرَأَ بِفَاتِحَةِ الْكِتَابِ وَمَا تَيَسَّرَ",
                "id": "Telah menceritakan kepada kami [Abu Walid Ath Thayalisi] telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Abu Nadlrah] dari [Abu Sa'id] dia berkata; \"Kami di perintahkan untuk membaca surat Al Fatihah dan surat yang mudah (kami baca).\""
            },
            {
                "number": 683,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عِيسَى عَنْ جَعْفَرِ بْنِ مَيْمُونٍ الْبَصْرِيِّ حَدَّثَنَا أَبُو عُثْمَانَ النَّهْدِيُّ قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اخْرُجْ فَنَادِ فِي الْمَدِينَةِ أَنَّهُ لَا صَلَاةَ إِلَّا بِقُرْآنٍ وَلَوْ بِفَاتِحَةِ الْكِتَابِ فَمَا زَادَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] telah mengabarkan kepada kami [Isa] dari [Ja'far bin Maimun Al Bashri] telah menceritakan kepada kami [Abu Utsman An Nahdi] dia berkata; telah menceritakan kepadaku [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Keluarlah dan serukan di (penjuru) Madinah bahwa tidak sah sholat seseorang, kecuali dengan bacaan alquran sekalipun Fatihatul Kitab (Al Fatihah) dan selebihnya.\""
            },
            {
                "number": 684,
                "arab": "حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى حَدَّثَنَا جَعْفَرٌ عَنْ أَبِي عُثْمَانَ عَنْ أَبِي هُرَيْرَةَ قَالَأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أُنَادِيَ أَنَّهُ لَا صَلَاةَ إِلَّا بِقِرَاءَةِ فَاتِحَةِ الْكِتَابِ فَمَا زَادَ",
                "id": "Telah menceritakan kepada kami [Ibnu Basyar] telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Ja'far] dari [Abu Utsman] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam memerintahkanku supaya aku menyerukan bahwa tidak sah sholat seseorang kecuali dengan membaca Al Fatihah dan selebihnya.\""
            },
            {
                "number": 685,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ أَنَّهُ سَمِعَ أَبَا السَّائِبِ مَوْلَى هِشَامِ بْنِ زَهْرَةَ يَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى صَلَاةً لَمْ يَقْرَأْ فِيهَا بِأُمِّ الْقُرْآنِ فَهِيَ خِدَاجٌ فَهِيَ خِدَاجٌ فَهِيَ خِدَاجٌ غَيْرُ تَمَامٍ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Al 'Ala` bin Abdurrahman] bahwa dia mendengar [Abu As Sa`ib bekas budak Hisyam bin Zahrah] berkata; saya mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengerjakan sholat tanpa membaca Ummul Qur'an (Al Fatihah) maka sholatnya kurang, kurang, kurang dan tidak sempurna.\""
            },
            {
                "number": 686,
                "arab": "قَالَ فَقُلْتُ يَا أَبَا هُرَيْرَةَ إِنِّي أَكُونُ أَحْيَانًا وَرَاءَ الْإِمَامِ قَالَ فَغَمَزَ ذِرَاعِي وَقَالَ اقْرَأْ بِهَا يَا فَارِسِيُّ فِي نَفْسِكَفَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَالَ اللَّهُ تَعَالَى قَسَمْتُ الصَّلَاةَ بَيْنِي وَبَيْنَ عَبْدِي نِصْفَيْنِ فَنِصْفُهَا لِي وَنِصْفُهَا لِعَبْدِي وَلِعَبْدِي مَا سَأَلَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْرَءُوا يَقُولُ الْعَبْدُ{ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ }يَقُولُ اللَّهُ عَزَّ وَجَلَّ حَمِدَنِي عَبْدِي يَقُولُ{ الرَّحْمَنِ الرَّحِيمِ }يَقُولُ اللَّهُ عَزَّ وَجَلَّ أَثْنَى عَلَيَّ عَبْدِي يَقُولُ الْعَبْدُ{ مَالِكِ يَوْمِ الدِّينِ }يَقُولُ اللَّهُ عَزَّ وَجَلَّ مَجَّدَنِي عَبْدِي يَقُولُ الْعَبْدُ{ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ }يَقُولُ اللَّهُ هَذِهِ بَيْنِي وَبَيْنَ عَبْدِي وَلِعَبْدِي مَا سَأَلَ يَقُولُ الْعَبْدُ{ اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ }يَقُولُ اللَّهُ فَهَؤُلَاءِ لِعَبْدِي وَلِعَبْدِي مَا سَأَلَ",
                "id": "(Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Al 'Ala` bin Abdurrahman] bahwa dia mendengar) \n\n[Abu As Sa'ib] berkata; tanyaku; \"Wahai Abu Hurairah, terkadang aku (sholat) berada di belakang imam.\" Abu As Sa'ib berkata; \"Lalu [Abu Hurairah] memegang hastaku seraya berkata; \"Bacalah dengan suara lirih wahai Farisi, karena aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Ta'ala berfirman; \"Aku membagi sholat antara Aku dan hamba-Ku setengah-setengah, setengahnya untuk-Ku dan setengahnya lagi untuk hamba-Ku dan untuk hamba-Ku apa yang ia mohon.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bacalah oleh kalian, (ketika) hamba itu membaca; \"Al-hamdu lillaahi rabbiil 'aalamin, \" Allah Azza wa Jalla akan menjawab; \"Hamba-Ku telah memuji-Ku.\" (ketika) seorang hamba membaca; \"Arrahmaanir rahiim, \" Allah Azza wa Jalla berfirman; \"Hamba-Ku telah menyanjung-Ku.\" (ketika) seorang hamba membaca; \"Maaliki yaumid diin.\" Allah Azza wa Jalla berfirman; \"Hamba-Ku telah mengagungkan-Ku.\" (ketika) seorang hamba membaca; \"Iyyaaka na'budu wa iyyaka nasta'iin.\" Allah Azza wa Jalla berfirman; \"Inilah bagian-Ku dan bagian hamba-Ku, sedangkan bagi hamba-Ku apa yang di mintanya.\" (ketika) seorang hamba membaca; \"Ihdinash shiraathal mustaqiim, shiraathal ladziina an'amta 'alaihim ghairil maghdluubi 'alaihim waladl dllaallliin.\" Allah Azza wa Jalla berfirman; \"Inilah bagian dari hamba-Ku, dan baginya apa yang di minta.\""
            },
            {
                "number": 687,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَابْنُ السَّرْحِ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ مَحْمُودِ بْنِ الرَّبِيعِ عَنْ عُبَادَةَ بْنِ الصَّامِتِيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَلَاةَ لِمَنْ لَمْ يَقْرَأْ بِفَاتِحَةِ الْكِتَابِ فَصَاعِدًاقَالَ سُفْيَانُ لِمَنْ يُصَلِّي وَحْدَهُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Ibnu Sarh] keduanya berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Mahmud bin Ar Rabi'] dari ['Ubadah bin As Shamit] yang sampai kepada Nabi shallallahu 'alaihi wasallam (sabdanya): \"Tidak sah sholat bagi siapa yang tidak membaca fatihatul kitab (surat Al Fatihah) dan selebihnya.\" Sufyan berkata; \"Bagi siapa yang sholat sendirian.\""
            },
            {
                "number": 688,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مَكْحُولٍ عَنْ مَحْمُودِ بْنِ الرَّبِيعِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَكُنَّا خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ الْفَجْرِ فَقَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَثَقُلَتْ عَلَيْهِ الْقِرَاءَةُ فَلَمَّا فَرَغَ قَالَ لَعَلَّكُمْ تَقْرَءُونَ خَلْفَ إِمَامِكُمْ قُلْنَا نَعَمْ هَذًّا يَا رَسُولَ اللَّهِ قَالَ لَا تَفْعَلُوا إِلَّا بِفَاتِحَةِ الْكِتَابِ فَإِنَّهُ لَا صَلَاةَ لِمَنْ لَمْ يَقْرَأْ بِهَا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Makhul] dari [Mahmud bin Ar Rabi'] dari ['Ubadah bin As Shamit] dia berkata; \"Kami sholat shubuh di belakang Rasulullah shallallahu 'alaihi wasallam, sepertinya bacaan beliau terasa berat. Seusai sholat, beliau bersabda: \"Sepengetahuanku, kalian membaca di belakang imam kalian.\" Mereka menjawab; \"Ya, wahai Rasulullah! (hingga) Kami menyusul bacaanmu dengan cepat.\" Beliau bersabda: \"Jangan kalian lakukan kecuali Fatihatul Kitab (Al Fatihah) karena tidak sah sholat seseorang yang tidak membacanya.\""
            },
            {
                "number": 689,
                "arab": "حَدَّثَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ الْأَزْدِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ أَخْبَرَنِي زَيْدُ بْنُ وَاقِدٍ عَنْ مَكْحُولٍ عَنْ نَافِعِ بْنِ مَحْمُودِ بْنِ الرَّبِيعِ الْأَنْصَارِيِّقَالَ نَافِعٌ أَبْطَأَ عُبَادَةُ بْنُ الصَّامِتِ عَنْ صَلَاةِ الصُّبْحِ فَأَقَامَ أَبُو نُعَيْمٍ الْمُؤَذِّنُ الصَّلَاةَ فَصَلَّى أَبُو نُعَيْمٍ بِالنَّاسِ وَأَقْبَلَ عُبَادَةُ وَأَنَا مَعَهُ حَتَّى صَفَفْنَا خَلْفَ أَبِي نُعَيْمٍ وَأَبُو نُعَيْمٍ يَجْهَرُ بِالْقِرَاءَةِ فَجَعَلَ عُبَادَةُ يَقْرَأُ أُمَّ الْقُرْآنِ فَلَمَّا انْصَرَفَ قُلْتُ لِعُبَادَةَ سَمِعْتُكَ تَقْرَأُ بِأُمِّ الْقُرْآنِ وَأَبُو نُعَيْمٍ يَجْهَرُ قَالَ أَجَلْ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْضَ الصَّلَوَاتِ الَّتِي يَجْهَرُ فِيهَا بِالْقِرَاءَةِ قَالَ فَالْتَبَسَتْ عَلَيْهِ الْقِرَاءَةُ فَلَمَّا انْصَرَفَ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ وَقَالَ هَلْ تَقْرَءُونَ إِذَا جَهَرْتُ بِالْقِرَاءَةِ فَقَالَ بَعْضُنَا إِنَّا نَصْنَعُ ذَلِكَ قَالَ فَلَا وَأَنَا أَقُولُ مَا لِي يُنَازِعُنِي الْقُرْآنُ فَلَا تَقْرَءُوا بِشَيْءٍ مِنْ الْقُرْآنِ إِذَا جَهَرْتُ إِلَّا بِأُمِّ الْقُرْآنِحَدَّثَنَا عَلِيُّ بْنُ سَهْلٍ الرَّمْلِيُّ حَدَّثَنَا الْوَلِيدُ عَنْ ابْنِ جَابِرٍ وَسَعِيدِ بْنِ عَبْدِ الْعَزِيزِ وَعَبْدِ اللَّهِ بْنِ الْعَلَاءِ عَنْ مَكْحُولٍ عَنْ عُبَادَةَ نَحْوَ حَدِيثِ الرَّبِيعِ بْنِ سُلَيْمَانَ قَالُوا فَكَانَ مَكْحُولٌ يَقْرَأُ فِي الْمَغْرِبِ وَالْعِشَاءِ وَالصُّبْحِ بِفَاتِحَةِ الْكِتَابِ فِي كُلِّ رَكْعَةٍ سِرًّا قَالَ مَكْحُولٌ اقْرَأْ بِهَا فِيمَا جَهَرَ بِهِ الْإِمَامُ إِذَا قَرَأَ بِفَاتِحَةِ الْكِتَابِ وَسَكَتَ سِرًّا فَإِنْ لَمْ يَسْكُتْ اقْرَأْ بِهَا قَبْلَهُ وَمَعَهُ وَبَعْدَهُ لَا تَتْرُكْهَا عَلَى كُلِّ حَالٍ",
                "id": "Telah menceritakan kepada kami [Ar Rabi'ah' bin Sulaiman Al Azdi] telah menceritakan kepada kami [Abdullah bin Yusuf] telah menceritakan kepada kami [Al Haitsam bin Humaid] telah mengabarkan kepadaku [Zaid bin Waqid] dari [Makhul] dari [Nafi' bin Mahmud bin Ar Rabi'ah' Al Anshari], Nafi' berkata; ['Ubadah bin Shamit] terlambat dari sholat shubuh, maka Abu Nu'aim seorang Mu'adzin mengumandangkan adzan untuk sholat, lalu Abu Nu'aim mengimami sholat orang banyak, tidak lama kemudian Ubadah datang bersamaku hingga kami mengambil shaf di belakang Abu Nu'aim, sedangkan Abu Nu'aim mengeraskan bacaannya, sementara 'Ubadah membaca Al Fatihah. Ketika sholat selesai, aku bertanya kepada Ubadah; \"Aku mendengar kamu membaca Al Fatihah ketika Abu Nu'aim mengeraskan bacaannya.\" Dia menjawab; \"Ya, kami juga pernah melakukan ketika sholat bersama Rasulullah shallallahu 'alaihi wasallam di sebagian sholat yang bacaannya di keraskan.\" Katanya melanjutkan; \"Hingga bacaannya bercampur, selepas sholat, beliau menghadap kami sambil bersabda: \"Apakah kalian juga ikut membaca ketika aku mengeraskan bacaanku?\" sebagian kami menjawab; \"Kami melakukan hal itu.\" Beliau bersabda: \"Oleh karenanya aku berkata (dalam hati), kenapa ada yang membaca bersamaku dan mendahuluiku dalam membaca Al Qur'an?, janganlah kalian membaca sesuatu pun ketika aku mengeraskan bacaan, kecuali bacaan Al Fatihah.\" Telah menceritakan kepada kami [Ali bin Sahl Ar Ramli] telah menceritakan kepada kami [Al Walid] dari [Ibnu Jabir] dan [Sa'id bin Abdul Aziz] dan [Abdullah bin Al 'Ala`] dari [Makhul] dari ['Ubadah] seperti haditsnya Ar Rabi'ah' bin Sulaiman, mereka berkata; \"Mak-hul biasa membaca Al Fatihah dengan suara lirih pada waktu sholat Maghrib, Isya' dan Shubuh, di setiap raka'atnya. Kata Mak-hul; \"Bacalah Al Fatihah dengan suara lirih (pelan) ketika imam mengeraskan bacaannya ketika berhenti dari membaca Al Fatihah, apabila imam tidak berhenti (diam), maka bacalah sebelum imam membaca atau membaca bersamanya atau setelah imam membacanya, yang penting, janganlah kamu meninggalkannya (tidak membaca Al Fatihah).\""
            },
            {
                "number": 690,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ ابْنِ أُكَيْمَةَ اللَّيْثِيِّ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْصَرَفَ مِنْ صَلَاةٍ جَهَرَ فِيهَا بِالْقِرَاءَةِ فَقَالَ هَلْ قَرَأَ مَعِيَ أَحَدٌ مِنْكُمْ آنِفًا فَقَالَ رَجُلٌ نَعَمْ يَا رَسُولَ اللَّهِ قَالَ إِنِّي أَقُولُ مَالِي أُنَازَعُ الْقُرْآنَقَالَ فَانْتَهَى النَّاسُ عَنْ الْقِرَاءَةِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيمَا جَهَرَ فِيهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْقِرَاءَةِ مِنْ الصَّلَوَاتِ حِينَ سَمِعُوا ذَلِكَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو دَاوُد رَوَى حَدِيثَ ابْنِ أُكَيْمَةَ هَذَا مَعْمَرٌ وَيُونُسُ وَأُسَامَةُ بْنُ زَيْدٍ عَنْ الزُّهْرِيِّ عَلَى مَعْنَى مَالِكٍ حَدَّثَنَا مُسَدَّدٌ وَأَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ وَمُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ وَعَبْدِ اللَّهِ بْنِ مُحَمَّدٍ الزُّهْرِيِّ وَابْنِ السَّرْحِ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ سَمِعْتُ ابْنَ أُكَيْمَةَ يُحَدِّثُ سَعِيدَ بْنَ الْمُسَيِّبِ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةً نَظُنُّ أَنَّهَا الصُّبْحُ بِمَعْنَاهُ إِلَى قَوْلِهِ مَا لِي أُنَازَعُ الْقُرْآنَ قَالَ مُسَدَّدٌ فِي حَدِيثِهِ قَالَ مَعْمَرٌ فَانْتَهَى النَّاسُ عَنْ الْقِرَاءَةِ فِيمَا جَهَرَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ و قَالَ ابْنُ السَّرْحِ فِي حَدِيثِهِ قَالَ مَعْمَرٌ عَنْ الزُّهْرِيِّ قَالَ أَبُو هُرَيْرَةَ فَانْتَهَى النَّاسُ و قَالَ عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ مِنْ بَيْنِهِمْ قَالَ سُفْيَانُ وَتَكَلَّمَ الزُّهْرِيُّ بِكَلِمَةٍ لَمْ أَسْمَعْهَا فَقَالَ مَعْمَرٌ إِنَّهُ قَالَ فَانْتَهَى النَّاسُ قَالَ أَبُو دَاوُد وَرَوَاهُ عَبْدُ الرَّحْمَنِ بْنُ إِسْحَقَ عَنْ الزُّهْرِيِّ وَانْتَهَى حَدِيثُهُ إِلَى قَوْلِهِ مَا لِي أُنَازَعُ الْقُرْآنَ وَرَوَاهُ الْأَوْزَاعِيُّ عَنْ الزُّهْرِيِّ قَالَ فِيهِ قَالَ الزُّهْرِيُّ فَاتَّعَظَ الْمُسْلِمُونَ بِذَلِكَ فَلَمْ يَكُونُوا يَقْرَءُونَ مَعَهُ فِيمَا جَهَرَ بِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو دَاوُد سَمِعْت مُحَمَّدَ بْنَ يَحْيَى بْنِ فَارِسٍ قَالَ قَوْلُهُ فَانْتَهَى النَّاسُ مِنْ كَلَامِ الزُّهْرِيِّ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [Ibnu Ukaimah Al Laitsi] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam selesai dari sholat yang di baca Jahr (jelas), lalu beliau bersabda; \"Apakah ada seseorang yang membaca (ayat) bersamaku tadi?\" seorang laki-laki berkata; \"Ya, wahai Rasulullah.\" Beliau bersabda: \"Sungguh, aku berkata (dalam hati) kenapa ia membaca bersamaku dan mendahuluiku dalam membaca Al Qur'an?\" Az Zuhri berkata; \"Seketika itu orang-ornag yang membaca bersama Nabi shallallahu 'alaihi wasallam dalam sholat-sholat yang di baca nyaring pun berhenti, setelah mendengar hal itu dari Rasulullah shallallahu 'alaihi wasallam.\" Abu Daud berkata; \"Hadits Ibnu Ukaimah ini juga telah di riwayatkan pula oleh [Ma'mar] dan [Yunus] serta [Usamah bin Zaid] dari [Az Zuhri] dengan makna haditsnya Malik. Telah menceritakan kepada kami [Musaddad], [Ahmad bin Muhammad Al Marwazi], [Muhammad bin Ahmad bin Abu Khalaf], [Abdullah bin Muhammad Az Zuhri] dan [Ibnu Sarh], mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] saya mendengar [Ibnu Ukaimah] menceritakan kepada Sa'id bin Musayyib katanya; saya mendengar [Abu Hurairah] berkata; \"Rasulullah shallallahu 'alaihi wasallam sholat bersama kami -kami mengira sholat tersebut adalah sholat shubuh- semakna dengan hadits di atas, sampai pada sabdanya; kenapa ia membaca bersamaku dan mendahuluiku dalam membaca Al Qur'an?\" Musaddad berkata dalam haditsnya; Ma'mar mengatakan; \"Seketika itu orang-orang berhenti dari membaca dalam sholat yang bacaannya di baca jahr (jelas, nyaring) oleh Rasulullah shallallahu 'alaihi wasallam.\" Ibnu As Sarh mengatakan dalam haditsnya; Ma'mar berkata dari Az Zuhri, Abu Hurairah berkata; \"Orang-orang pun berhenti…\" sedangkan Abdullah bin Muhammad Az Zuhri di antara mereka juga Sufyan berkata; lalu Az Zuhri mengatakan suatu perkataan yang tidak aku dengar.\" Ma'mar mengatakan; Bahwa az Zuhri mengatakan; \"Orang-orang berhenti.\" Abu Daud mengatakan; \"Hadits ini juga di riwayatkan [Abdurrahman bin Ishaq] dari [Az Zuhri] dan haditsnya berhenti sampai sabdanya; kenapa ia membaca bersamaku dan mendahuluiku dalam membaca Al Qur'an?\" Dan di riwayatkan pula oleh [Al Auza'i] dari [Az Zuhri] dia mengatakan dalam masalah itu; \"Maka kaum Muslimin pun mengambil pelajaran dari hal itu, sehingga mereka tidak lagi membaca bersama beliau shallallahu 'alaihi wasallam dalam sholat yang bacaannya di baca jahr.\" Abu Daud mengatakan; \"saya mendengar Muhammad bin Yahya bin Faris berkata; \"Mengenai perkataannya \"orang-orang pun berhenti\" merupakan perkataan Az Zuhri.\""
            },
            {
                "number": 691,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ الْعَبْدِيُّ أَخْبَرَنَا شُعْبَةُ الْمَعْنَى عَنْ قَتَادَةَ عَنْ زُرَارَةَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ فَجَاءَ رَجُلٌ فَقَرَأَ خَلْفَهُ سَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى فَلَمَّا فَرَغَ قَالَ أَيُّكُمْ قَرَأَ قَالُوا رَجُلٌ قَالَ قَدْ عَرَفْتُ أَنَّ بَعْضَكُمْ خَالَجَنِيهَاقَالَ أَبُو دَاوُد قَالَ الْوَلِيدُ فِي حَدِيثِهِ قَالَ شُعْبَةُ فَقُلْتُ لِقَتَادَةَ أَلَيْسَ قَوْلُ سَعِيدٍ أَنْصِتْ لِلْقُرْآنِ قَالَ ذَاكَ إِذَا جَهَرَ بِهِ قَالَ ابْنُ كَثِيرٍ فِي حَدِيثِهِ قَالَ قُلْتُ لِقَتَادَةَ كَأَنَّهُ كَرِهَهُ قَالَ لَوْ كَرِهَهُ نَهَى عَنْهُ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah]. Dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Muhammad bin Katsir Al 'Abdi] telah mengabarkan kepada kami [Syu'bah] sedangkan ma'na haditsnya dari [Qatadah] dari [Zurarah] dari ['Imran bin Hushain] bahwa Nabi shallallahu 'alaihi wasallam menunaikan sholat Dluhur, tiba-tiba seorang laki-laki datang sambil membaca \"Sabbihisma rabbikal a'la.\" di belakang beliau, ketika selesai sholat, beliau bersabda: \"Siapakah tadi yang membaca (surat)?\" para sahabat menjawab; \"Laki-laki ini.\" beliau bersabda: \"Sungguh aku telah mengetahui, bahwa sebagian dari kalian telah mengalahkan bacaanku.\" Abu Daud berkata; Al Walid berkata dalam haditsnya, Syu'bah berkata; kataku kepada Qatadah; 'tidakkah perkataannya Sa'id; \"Diamlah (untuk mendengarkan) bacaan Al Qur'an (imam).\" Qatadah berkata; \"Hal itu jika (imam) mengeraskan bacaannya.\" Ibnu Katsir berkata dalam haditsnya; dia berkata; kataku kepada Qatadah; \"Sepertinya beliau hanya membenci.\" Qatadah menimpali; \"Jika beliau membencinya, berarti beliau melarang yang demikian.\""
            },
            {
                "number": 692,
                "arab": "حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ زُرَارَةَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِهِمْ الظُّهْرَ فَلَمَّا انْفَتَلَ قَالَ أَيُّكُمْ قَرَأَ بِسَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى فَقَالَ رَجُلٌ أَنَا فَقَالَ عَلِمْتُ أَنَّ بَعْضَكُمْ خَالَجَنِيهَا",
                "id": "Telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Sa'id] dari [Qatadah] dari [Zurarah] dari ['Imran bin Hushain] bahwa Nabi shallallahu 'alaihi wasallam sholat Dluhur bersama mereka, setelah selesai sholat beliau bersabda: \"Siapakah di antara kalian yang membca \"sabbihisma rabbikal a'la?\" maka laki-laki itu menjawab; \"saya.\" Beliau bersabda: \"Aku tahu, bahwa sebagian dari kalian telah mengalahkan bacaanku.\""
            },
            {
                "number": 693,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ أَخْبَرَنَا خَالِدٌ عَنْ حُمَيْدٍ الْأَعْرَجِ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَقْرَأُ الْقُرْآنَ وَفِينَا الْأَعْرَابِيُّ وَالْأَعْجَمِيُّ فَقَالَ اقْرَءُوا فَكُلٌّ حَسَنٌ وَسَيَجِيءُ أَقْوَامٌ يُقِيمُونَهُ كَمَا يُقَامُ الْقِدْحُ يَتَعَجَّلُونَهُ وَلَا يَتَأَجَّلُونَهُ",
                "id": "Telah menceritakan kepada kami [Wahb bin Baqiyah] telah mengabarkan kepada kami [Khalid] dari [Humaid Al A'raj] dari [Muhammad bin Al Munkadir] dari [Jabir bin Abdullah] dia berkata; Rasulullah shallallahu 'alaihi wasallam menemui kami, ketika itu kami sedang membaca Al Qur'an, sedangkan di antara kami ada seorang arab Badui dan orang Asing, maka beliau bersabda: \"Bacalah oleh kalian dengan bacaan yang baik, akan datang suatu kaum yang membaca dengan melurus-luruskannya (benar) sebagaimana anak panah di luruskan, namun mereka hanyalah mengharap-harap balasan yang disegerakan (materi-duniawi) dan mereka tidak mengharap pahala yang ditangguhkan (di akhirat).\""
            },
            {
                "number": 694,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو وَابْنُ لَهِيعَةَ عَنْ بَكْرِ بْنِ سَوَادَةَ عَنْ وَفَاءِ بْنِ شُرَيْحٍ الصَّدَفِيِّ عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا وَنَحْنُ نَقْتَرِئُ فَقَالَ الْحَمْدُ لِلَّهِ كِتَابُ اللَّهِ وَاحِدٌ وَفِيكُمْ الْأَحْمَرُ وَفِيكُمْ الْأَبْيَضُ وَفِيكُمْ الْأَسْوَدُ اقْرَءُوهُ قَبْلَ أَنْ يَقْرَأَهُ أَقْوَامٌ يُقِيمُونَهُ كَمَا يُقَوَّمُ السَّهْمُ يُتَعَجَّلُ أَجْرُهُ وَلَا يُتَأَجَّلُهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku ['Amru] dan [Ibnu Lahi'ah] dari [Bakr bin Sawadah] dari [Wafa' bin Syuraikh Ash Shadafi] dari [Sahl bin Sa'ad As Sa'idi] dia berkata; Rasulullah shallallahu 'alaihi wasallam menemui kami, sementara kami sedang membaca Al Qur'an, maka beliau bersabda: \"Segala puji bagi Allah kitab Allah hanya satu, padahal di antara kalian ada bangsa yang berkulit merah, putih dan hitam, bacalah Al Qur'an tersebut, sebelum di baca oleh suatu kaum, mereka membacanya dengan lurus sebagaimana meluruskan anak panah, mereka mengharap pahalanya yang disegerakan di dunia, dan tidak mengharap pahala yang ditangguhkan di akhirat.\""
            },
            {
                "number": 695,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعُ بْنُ الْجَرَّاحِ حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ عَنْ أَبِي خَالِدٍ الدَّالَانِيِّ عَنْ إِبْرَاهِيمَ السَّكْسَكِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي لَا أَسْتَطِيعُ أَنْ آخُذَ مِنْ الْقُرْآنِ شَيْئًا فَعَلِّمْنِي مَا يُجْزِئُنِي مِنْهُ قَالَ قُلْ سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ قَالَ يَا رَسُولَ اللَّهِ هَذَا لِلَّهِ عَزَّ وَجَلَّ فَمَا لِي قَالَ قُلْ اللَّهُمَّ ارْحَمْنِي وَارْزُقْنِي وَعَافِنِي وَاهْدِنِي فَلَمَّا قَامَ قَالَ هَكَذَا بِيَدِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا هَذَا فَقَدْ مَلَأَ يَدَهُ مِنْ الْخَيْرِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Waki' bin Al Jarrah] telah menceritakan kepada kami [Sufyan Ats Tsauri] dari [Abu Khalid Ad Dalani] dari [Ibrahim As Saksaki] dari [Abdullah bin Abu Aufa] dia berkata; seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam seraya berkata; \"Sesungguhnya aku tidak dapat mempelajari Al Qur'an sedikit pun, maka ajarilah aku sesuatu yang dapat memadai untukku sebagai gantinya.\" Beliau bersabda: \"Ucapkanlah; \"SUBHANALLAH WAL HAMDULILLAH WALAA ILAAHA ILLALLAH WALLAAHU AKBAR WALAA HAULAA WALAA QUWWATA ILLA BILLAHIL 'ALIYYIL 'AZHIIM (Maha suci Allah, segala puji bagi Allah, tidak ada ilah yang hak kecuali Allah dan Allah Maha besar, tidak ada daya dan upaya kecuali kecuali dengan pertolongan Allah yang Maha Luhur lagi Maha Agung).\" Laki-laki itu berkata; \"wahai Rasulullah, ungkapan ini untuk Allah Azza Wa Jalla, lantas (ungkapan) manakah yang untuk saya?\" beliau bersabda: \"katakanlah; \"ALLAHUMMARHAMNII WARZUQNII WA'AAFINII WAHDINII (Ya Allah, rahmatilah aku, berilah aku rizki, kesejahteraan, dan petunjuk.\" Ketika orang itu berdiri (sholat), maka dia memberi isyarat dengan tangannya seperti ini (yaitu membaca sambil menghitungnya) maka Rasulullah shallallahu 'alaihi wasallam bersabda: \" Orang ini tangannya telah di penuhi dengan kebaikan.\""
            },
            {
                "number": 696,
                "arab": "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ أَخْبَرَنَا أَبُو إِسْحَقَ يَعْنِي الْفَزَارِيَّ عَنْ حُمَيْدٍ عَنْ الْحَسَنِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكُنَّا نُصَلِّي التَّطَوُّعَ نَدْعُو قِيَامًا وَقُعُودًا وَنُسَبِّحُ رُكُوعًا وَسُجُودًاحَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ حُمَيْدٍ مِثْلَهُ لَمْ يَذْكُرْ التَّطَوُّعَ قَالَ كَانَ الْحَسَنُ يَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ إِمَامًا أَوْ خَلْفَ إِمَامٍ بِفَاتِحَةِ الْكِتَابِ وَيُسَبِّحُ وَيُكَبِّرُ وَيُهَلِّلُ قَدْرَ ق وَالذَّارِيَاتِ",
                "id": "Telah menceritakan kepada kami [Abu Taubah Ar Rabi' bin Nafi'] telah mengabarkan kepada kami [Abu Ishaq yaitu Al Fazari] dari [Humaid] dari [Al Hasan] dari [Jabir bin Abdullah] dia berkata: \"Kami sholat sunnah dengan membaca do'a baik ketika berdiri ataupun duduk, dan kami mengucapkan tasbih pada waktu ruku' dan sujud.\" Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Humaid] seperti hadits tersebut dengan tidak menyebutkan sholat sunnah. Humiad berkata; \"Al Hasan membaca Al Fatihah dalam sholat Zhuhur dan Ashar baik ketika menjadi Imam atau di belakang imam dan bertasbih, bertakbir, serta bertahlil sepanjang membaca surat Qaaf dan Adz Dzariyat.\""
            },
            {
                "number": 697,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادٌ عَنْ غَيْلَانَ بْنِ جَرِيرٍ عَنْ مُطَرِّفٍ قَالَصَلَّيْتُ أَنَا وَعِمْرَانُ بْنُ حُصَيْنٍ خَلْفَ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ فَكَانَ إِذَا سَجَدَ كَبَّرَ وَإِذَا رَكَعَ كَبَّرَ وَإِذَا نَهَضَ مِنْ الرَّكْعَتَيْنِ كَبَّرَ فَلَمَّا انْصَرَفْنَا أَخَذَ عِمْرَانُ بِيَدِي وَقَالَ لَقَدْ صَلَّى هَذَا قَبْلُ أَوْ قَالَ لَقَدْ صَلَّى بِنَا هَذَا قَبْلَ صَلَاةِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad] dari [Ghailan bin Jarir] dari [Mutharif] dia berkata; \"Aku dan Imran bin Hushain sholat di belakang Ali bin Abu Thalib radliallahu 'anhu, dia bertakbir ketika sujud, ruku' dan bangkit dari raka'at kedua. Ketika kami selesai melaksanakan sholat, [Imran bin Hushain] memegang tanganku dan berkata; \"Sungguh sebelum ini, dia juga melaksanakan sholat seperti ini, -atau dia berkata- sungguh dia telah melaksanakan sholat bersama kami seperti ini sebelumnya, maksudnya seperti sholatnya Muhammad shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 698,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا أُبَيٌّ وَبَقِيَّةُ عَنْ شُعَيْبٍ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ وَأَبُو سَلَمَةَ أَنَّ أَبَا هُرَيْرَةَكَانَ يُكَبِّرُ فِي كُلِّ صَلَاةٍ مِنْ الْمَكْتُوبَةِ وَغَيْرِهَا يُكَبِّرُ حِينَ يَقُومُ ثُمَّ يُكَبِّرُ حِينَ يَرْكَعُ ثُمَّ يَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ يَقُولُ رَبَّنَا وَلَكَ الْحَمْدُ قَبْلَ أَنْ يَسْجُدَ ثُمَّ يَقُولُ اللَّهُ أَكْبَرُ حِينَ يَهْوِي سَاجِدًا ثُمَّ يُكَبِّرُ حِينَ يَرْفَعُ رَأْسَهُ ثُمَّ يُكَبِّرُ حِينَ يَسْجُدُ ثُمَّ يُكَبِّرُ حِينَ يَرْفَعُ رَأْسَهُ ثُمَّ يُكَبِّرُ حِينَ يَقُومُ مِنْ الْجُلُوسِ فِي اثْنَتَيْنِ فَيَفْعَلُ ذَلِكَ فِي كُلِّ رَكْعَةٍ حَتَّى يَفْرُغَ مِنْ الصَّلَاةِ ثُمَّ يَقُولُ حِينَ يَنْصَرِفُ وَالَّذِي نَفْسِي بِيَدِهِ إِنِّي لَأَقْرَبُكُمْ شَبَهًا بِصَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ كَانَتْ هَذِهِ لَصَلَاتُهُ حَتَّى فَارَقَ الدُّنْيَاقَالَ أَبُو دَاوُد هَذَا الْكَلَامُ الْأَخِيرُ يَجْعَلُهُ مَالِكٌ وَالزُّبَيْدِيُّ وَغَيْرِهِمَا عَنْ الزُّهْرِيِّ عَنْ عَلِيِّ بْنِ حُسَيْنٍ وَوَافَقَ عَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ شُعَيْبَ بْنَ أَبِي حَمْزَةَ عَنْ الزُّهْرِيِّ",
                "id": "Telah menceritakan kepada kami ['Amru bin Utsman] telah menceritakan kepada kami [Ubay] dan [Baqiyah] dari [Syu'aib] dari [Az Zuhri] dia berkata; telah mengabarkan kepadaku [Abu Bakar bin Abdurrahman] dan [Abu Salamah] bahwa [Abu Hurairah] selalu bertakbir di setiap sholat wajib maupun sholat sunnah, dia bertakbir ketika berdiri, bertakbir ketika ruku' kemudian mengucapkan; \"SAMI'ALLAAHU LIMAN HAMIDAH\" Lalu mengucapkan; \"RABBANA WALAKAL HAMDU (wahai Rabb kami, bagi-Mu lah segala pujian) \" yaitu sebelum sujud, setelah itu dia mengucapkan; \"Allahu akbar\" ketika tersungkur sujud, bertakbir ketika bangun dari sujud, bertakbir ketika sujud (kedua), bertakbir ketika bangun dari sujud, bertakbir ketika bangun dari duduknya pada raka'at kedua, yang demikian itu di lakukannya pada setiap raka'at hingga selesai sholat. seusai sholat dia mengucapkan; \"Demi dzat yang jiwaku berada di tangan-Nya, sesungguhnya sholatku lah yang paling menyerupai sholat Rasulullah shallallahu 'alaihi wasallam, Sesungguhnya sholat yang seperti ini merupakan sholat Rasulullah shallallahu 'alaihi wasallam sehingga beliau meninggal dunia.\" Abu Daud berkata; \"Ini adalah perkataan terakhir yang di jadikan oleh [Malik] dan [Zubaidi] serta yang lain sebagai (perkataannya) Az Zuhri dari [Ali bin Husain] yang di sepakati oleh [Abdul A'la] dari [Ma'mar Syu'aib bin Abu Hamzah] dari [Az Zuhri]. "
            },
            {
                "number": 699,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَابْنُ الْمُثَنَّى قَالَا حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَسَنِ بْنِ عِمْرَانَ قَالَ ابْنُ بَشَّارٍ الشَّامِيِّ و قَالَ أَبُو دَاوُدَ أَبُو عَبْدِ اللَّهِ الْعَسْقَلَانِيُّ عَنْ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِأَنَّهُ صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَانَ لَا يُتِمُّ التَّكْبِيرَقَالَ أَبُو دَاوُد مَعْنَاهُ إِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ وَأَرَادَ أَنْ يَسْجُدَ لَمْ يُكَبِّرْ وَإِذَا قَامَ مِنْ السُّجُودِ لَمْ يُكَبِّرْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] dan [Ibnu Al Mutsanna] keduanya berkata; telah menceritakan kepada kami [Abu Daud] telah menceritakan kepada kami [Syu'bah] dari [Al Hasan bin 'Imran] dia berkata; Ibnu Basyar As Syami berkata; Abu Daud Abu Abdullah Al 'Asqalani berkata dari [Ibnu Abdurrahman bin Abza] dari [ayahnya] bahwa dia sholat bersama Rasulullah shallallahu 'alaihi wasallam, dan beliau tidak menyempurnakan takbir. ' Abu Daud mengatakan; maknanya; 'Apabila mengangkat kepalanya dari ruku' (I'tidal) dan hendak sujud, maka beliau tidak bertakbir, begitu juga ketika bangkit dari sujud, beliau tidak bertakbir.\""
            },
            {
                "number": 700,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ وَحُسَيْنُ بْنُ عِيسَى قَالَا حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شَرِيكٌ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ عَنْ وَائِلِ بْنِ حُجْرٍ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ وَضَعَ رُكْبَتَيْهِ قَبْلَ يَدَيْهِ وَإِذَا نَهَضَ رَفَعَ يَدَيْهِ قَبْلَ رُكْبَتَيْهِحَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ حَدَّثَنَا حَجَّاجُ بْنُ مِنْهَالٍ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا مُحَمَّدُ بْنُ جُحَادَةَ عَنْ عَبْدِ الْجَبَّارِ بْنِ وَائِلٍ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ حَدِيثَ الصَّلَاةِ قَالَ فَلَمَّا سَجَدَ وَقَعَتَا رُكْبَتَاهُ إِلَى الْأَرْضِ قَبْلَ أَنْ تَقَعَ كَفَّاهُ قَالَ هَمَّامٌ وَحَدَّثَنِي شَقِيقٌ قَالَ حَدَّثَنِي عَاصِمُ بْنُ كُلَيْبٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ هَذَا وَفِي حَدِيثِ أَحَدِهِمَا وَأَكْبَرُ عِلْمِي أَنَّهُ فِي حَدِيثِ مُحَمَّدِ بْنِ جُحَادَةَ وَإِذَا نَهَضَ نَهَضَ عَلَى رُكْبَتَيْهِ وَاعْتَمَدَ عَلَى فَخِذِهِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] dan [Husain bin Isa] keduanya berkata; telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Syarik] dari ['Ashim bin Kulaib] dari [ayahnya] dari [Wa'il bin Hujr] dia berkata; saya melihat apabila Nabi shallallahu 'alaihi wasallam sujud, beliau meletakkan kedua lututnya sebelum kedua tangannya, dan apabila bangkit, beliau mengangkat kedua tangannya sebelum kedua lututnya.\" Telah menceritakan kepada kami [Muhammad bin Ma'mar] telah menceritakan kepada kami [Hajjaj bin Minhal] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Muhammad bin Juhadah] dari [Abdul Jabbar bin Wa`il] dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam…\" kemudian dia melanjutkan hadits tentang sholat. katanya; \"Ketika beliau sujud, beliau meletakkan kedua lututnya ke lantai sebelum meletakkan kedua telapak tangannya. ' Hammam mengatakan; telah menceritakan kepadaku [Syaqiq] dia berkata; telah menceritakan kepadaku ['Ashim bin Kulaib] dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam seperti hadits ini. sedangkan dalam hadits salah satu dari keduanya (Muhammad bin Juhadah dan Syaqiq) yang lebih tahu daripadaku adalah hadits yang (di riwayatkan) oleh Muhammad bin Juhadah; \"Apabila beliau bangkit, maka beliau bangkit dengan menumpu kedua lututnya dengan bersandarkan pada kedua pahanya.\""
            },
            {
                "number": 701,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ حَسَنٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ أَحَدُكُمْ فَلَا يَبْرُكْ كَمَا يَبْرُكُ الْبَعِيرُ وَلْيَضَعْ يَدَيْهِ قَبْلَ رُكْبَتَيْهِ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] telah menceritakan kepadaku [Muhammad bin Abdullah bin Hasan] dari [Abu Az Zinnad] dari [Al A'raj] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian sujud, maka janganlah menderum sebagaimana unta menderum, akan tetapi hendaknya ia meletakkan kedua tangannya sebelum kedua lututnya.\""
            },
            {
                "number": 702,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ حَسَنٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْمِدُ أَحَدُكُمْ فِي صَلَاتِهِ فَيَبْرُكُ كَمَا يَبْرُكُ الْجَمَلُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdullah bin Nafi'] dari [Muhammad bin Abdullah bin Hasan] dari [Abu Az Zinnad] dari [Al A'raj] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"(Apakah) salah seorang dari kalian sengaja dalam sholatnya menderum sebagaimana unta menderum (ketika hendak sujud -pent)?\""
            },
            {
                "number": 703,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ إِبْرَاهِيمَ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ قَالَجَاءَنَا أَبُو سُلَيْمَانَ مَالِكُ بْنُ الْحُوَيْرِثِ إِلَى مَسْجِدِنَا فَقَالَ وَاللَّهِ إِنِّي لَأُصَلِّي بِكُمْ وَمَا أُرِيدُ الصَّلَاةَ وَلَكِنِّي أُرِيدُ أَنْ أُرِيَكُمْ كَيْفَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي قَالَ قُلْتُ لِأَبِي قِلَابَةَ كَيْفَ صَلَّى قَالَ مِثْلَ صَلَاةِ شَيْخِنَا هَذَا يَعْنِي عَمْرَو بْنَ سَلَمَةَ إِمَامَهُمْ وَذَكَرَ أَنَّهُ كَانَ إِذَا رَفَعَ رَأْسَهُ مِنْ السَّجْدَةِ الْآخِرَةِ فِي الرَّكْعَةِ الْأُولَى قَعَدَ ثُمَّ قَامَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Isma'il yaitu Ibnu Ibrahim] dari [Ayyub] dari [Abu Qilabah] dia berkata; [Abu Sulaiman Malik bin Al Huraits] datang menemui kami di masjid, dia berkata; \"Demi Allah, sungguh aku akan mengerjakan sholat bersama kalian, sebenarnya aku tidak bermaksud untuk sholat (bersama kalian), namun aku hendak memperlihatkan kepada kalian bagaimana Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat.\" Abu Ayyub berkata; \"Kataku kepada Abu Qilabah; 'Bagaimana dia (Malik) mengerjakan sholat?\" jawabnya; \"Seperti cara sholatnya syaikh kita yaitu 'Amru bin Salamah, imam mereka. Abu Qilabah menyebutkan; apabila Malik bin Huwairits bangkit dari sujud terakhir pada raka'at pertama, dia duduk sesaat kemudian berdiri.\""
            },
            {
                "number": 704,
                "arab": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ حَدَّثَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ قَالَجَاءَنَا أَبُو سُلَيْمَانَ مَالِكُ بْنُ الْحُوَيْرِثِ إِلَى مَسْجِدِنَا فَقَالَ وَاللَّهِ إِنِّي لَأُصَلِّي وَمَا أُرِيدُ الصَّلَاةَ وَلَكِنِّي أُرِيدُ أَنْ أُرِيَكُمْ كَيْفَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي قَالَ فَقَعَدَ فِي الرَّكْعَةِ الْأُولَى حِينَ رَفَعَ رَأْسَهُ مِنْ السَّجْدَةِ الْآخِرَةِ",
                "id": "Telah menceritakan kepada kami [Ziyad bin Ayyub] telah menceritakan kepada kami [Isma'il] dari [Ayyub] dari [Abu Qilabah] dia berkata; [Abu Sulaiman Malik bin Al Huwairits] datang ke masjid kami seraya berkata; \"Sesungguhnya aku akan sholat, dan sebenarnya aku tidak bermaksud untuk sholat (bersama kalian), akan tetapi aku hendak memperlihatkan kepada kalian bagaimana Rasulullah shallallahu 'alaihi wasallam sholat.\" Abu Qilabah berkata; \"Maka (Malik) duduk sejenak di raka'at pertama setelah mengangkat kepala dari sujud kedua.\""
            },
            {
                "number": 705,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا هُشَيْمٌ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِأَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ فِي وِتْرٍ مِنْ صَلَاتِهِ لَمْ يَنْهَضْ حَتَّى يَسْتَوِيَ قَاعِدًا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Husyaim] dari [Khalid] dari [Abu Qilabah] dari [Malik bin Al Huwairits] bahwa dia melihat Nabi shallallahu 'alaihi wasallam ketika mengerjakan sholat witir, beliau tidak bangkit hingga beliau benar-benar dalam keadaan duduk sejenak.\""
            },
            {
                "number": 706,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ طَاوُسًا يَقُولُقُلْنَا لِابْنِ عَبَّاسٍ فِي الْإِقْعَاءِ عَلَى الْقَدَمَيْنِ فِي السُّجُودِ فَقَالَ هِيَ السُّنَّةُ قَالَ قُلْنَا إِنَّا لَنَرَاهُ جُفَاءً بِالرَّجُلِ فَقَالَ ابْنُ عَبَّاسٍ هِيَ سُنَّةُ نَبِيِّكَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ma'in] telah menceritakan kepada kami [Hajjaj bin Muhammad] dari [Ibnu Juraij] telah mengabarkan kepadaku [Abu Az Zubair] bahwa dia mendengar [Thawus] berkata; kami bertanya kepada [Ibnu Abbas] mengenai duduk iq`a' (duduk bersimpuh) di atas kedua tumit di antara sujud.\" Ibnu Abbas menjawab; \"itu termasuk sunnah.\" Kata Thawus; \"kami berkata; \"Sesungguhnya kami melihatnya kurang sopan.\" Ibnu Abbas menjawab; \"Itu adalah sunnah Nabimu shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 707,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَأَبُو مُعَاوِيَةَ وَوَكِيعٌ وَمُحَمَّدُ بْنُ عُبَيْدٍ كُلُّهُمْ عَنْ الْأَعْمَشِ عَنْ عُبَيْدِ بْنِ الْحَسَنِ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ يَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءُ السَّمَوَاتِ وَمِلْءُ الْأَرْضِ وَمِلْءُ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُقَالَ أَبُو دَاوُد قَالَ سُفْيَانُ الثَّوْرِيُّ وَشُعْبَةُ بْنُ الْحَجَّاجِ عَنْ عُبَيْدٍ أَبِي الْحَسَنِ هَذَا الْحَدِيثُ لَيْسَ فِيهِ بَعْدَ الرُّكُوعِ قَالَ سُفْيَانُ لَقِينَا الشَّيْخَ عُبَيْدًا أَبَا الْحَسَنِ بَعْدُ فَلَمْ يَقُلْ فِيهِ بَعْدَ الرُّكُوعِ قَالَ أَبُو دَاوُد وَرَوَاهُ شُعْبَةُ عَنْ أَبِي عِصْمَةَ عَنْ الْأَعْمَشِ عَنْ عُبَيْدٍ قَالَ بَعْدَ الرُّكُوعِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Abdullah bin Numair] dan [Abu Mu'awiyah], [Waki'], dan [Muhammad bin 'Ubaid] semuanya dari [Al A'masy] dari ['Ubaid bin Al Hasan] dia berkata; saya mendengar [Abdullah bin Abu Aufa] berkata; Apabila Rasulullah shallallahu 'alaihi wasallam mengangkat kepalanya dari ruku' (i'tidal) beliau mengucapkan: \"SAMI'ALLAHU LIMAN HAMIDAH, RABBANAA LAKAL HAMDU MIL`US SAMAAWATI WAMIL`UL ARDLI WAMIL`U MAASYI`TA MIN SYAI`IN BA'DU (Maha mendengar Allah kepada siapa saja yang memuji-Nya, Ya Allah Rabb kami, hanya untuk Engkau lah segala pujian sepenuh langit dan bumi dan sepenuh apa saja yang Engkau kehendaki).\" Abu Daud mengatakan; setelah itu [Sufyan Ats Tsauri] dan [Syu'bah bin Al Hajjaj] mengatakan dari ['Ubaid Abu Al Hasan], tanpa menyebutkan; \"Setelah ruku'\" Abu Daud mengatakan; sedangkan (hadits) yang telah di riwayatkan [Syu'bah] dari [Abu 'Ishmah] dari [Al A'masy] dari ['Ubaid] dia berkata; \"Setelah ruku'.\""
            },
            {
                "number": 708,
                "arab": "حَدَّثَنَا مُؤَمَّلُ بْنُ الْفَضْلِ الْحَرَّانِيُّ حَدَّثَنَا الْوَلِيدُ ح و حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا أَبُو مُسْهِرٍ ح و حَدَّثَنَا ابْنُ السَّرْحِ حَدَّثَنَا بِشْرُ بْنُ بَكْرٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ كُلُّهُمْ عَنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ عَنْ عَطِيَّةَ بْنِ قَيْسٍ عَنْ قَزَعَةَ بْنِ يَحْيَى عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ حِينَ يَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَاءِ قَالَ مُؤَمَّلٌ مِلْءَ السَّمَوَاتِ وَمِلْءَ الْأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ أَهْلَ الثَّنَاءِ وَالْمَجْدِ أَحَقُّ مَا قَالَ الْعَبْدُ وَكُلُّنَا لَكَ عَبْدٌ لَا مَانِعَ لِمَا أَعْطَيْتَ زَادَ مَحْمُودٌ وَلَا مُعْطِيَ لِمَا مَنَعْتَ ثُمَّ اتَّفَقُوا وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ وَقَالَ بِشْرٌ رَبَّنَا لَكَ الْحَمْدُ لَمْ يَقُلْ اللَّهُمَّ لَمْ يَقُلْ مَحْمُودٌ اللَّهُمَّ قَالَ رَبَّنَا وَلَكَ الْحَمْدُ",
                "id": "Telah menceritakan kepada kami [Mu`ammal bin Al Fadl Al Harrani] telah menceritakan kepada kami [Al Walid]. dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Mahmud bin Khalid] telah menceritakan kepada kami [Abu Mushir]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu As Sarh] telah menceritakan kepada kami [Bisyr bin Bakr]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Mahmud bin Mush'ab] telah menceritakan kepada kami [Abdullah bin Yusuf] semuanya dari [Sa'id bin Abdul Aziz] dari ['Athiyah bin Qais] dari [Qaza'ah bin Yahya] dari [Abu Sa'id Al Khudri] bahwa ketika Rasulullah shallallahu 'alaihi wasallam mengucapkan; \"Sami'allaahu liman hamidah\" maka beliau melanjutkan dengan \"RABBANAA LAKAL HAMDU MIL`US SAMAA`I -Mu`ammil mengatakan; MIL`US SAMAAWATI- WAMIL`UL ARDLI WAMIL`U MAASYI`TA MIN SYAI`IN BA'DU AHLUTS TSANAA`I WAL MAJDI AHAQQU MAA QAALAL 'ABDU WA KULLANAA MAA QAALAL 'ABDU WA KULLANAA LAKAL 'ABDU LAA MAANI'A LIMAA A'THAITA (Ya Allah Rabb kami, hanya untuk Engkau lah segala pujian sepenuh langit dan bumi dan sepenuh apa saja yang Engkau kehendaki, wahai Allah yang berhak menerima sanjungan dan kehormatan, Ucapan yang paling pantas di ucapkan oleh seorang hamba, dan kami semua adalah hamba-Mu, tak seorang pun yang dapat melarang apa yang telah Engkau berikan).\" -Mahmud menambahkan- WALAA MU'THIYA LIMAA MANA'TA (begitu pula tak seorang pun yang dapat memberikan apa yang Engkau cegah).\" -kemudian riwayat mereka bersambung lagi- WALAA YANFA'U DZAL JADDI MINKAL JADDU (dan sekali-kali tidak bermanfa'at bagi orang yang mempunyai kebesaran, dari Engkau lah kebesaran itu).\" Bisyr mengatakan; \"RABBANAA LAKAL HAMDU (Wahai Rabb kami, bagi-Mu lah segala pujian) \" tidak menyebutkan; \"ALLAHUMMA.\" Begitu juga dalam riwayatnya Mahmud, dia tidak mengatakan; \"ALLAHUMMA\" namun hanya mengatakan; \"RABBANAA WA LAKAL HAMDU.\""
            },
            {
                "number": 709,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ السَّمَّانِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا قَالَ الْإِمَامُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ فَإِنَّهُ مَنْ وَافَقَ قَوْلُهُ قَوْلَ الْمَلَائِكَةِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Sumayyi] dari [Abu Shalih As Samman] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila imam mengucapkan \"Sami'allahu liman hamidah\" maka ucapkanlah oleh kalian; \"ALLAHUMMA RABBANA LAKAL HAMDU\" (Ya Allah Rabb kami, hanya untuk Engkau lah segala pujian), barangsiapa ucapannya bersamaan dengan ucapan Mala'ikat, maka dosa-dosanya yang telah lalu akan terampuni.\""
            },
            {
                "number": 710,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ عَمَّارٍ حَدَّثَنَا أَسْبَاطٌ عَنْ مُطَرِّفٍ عَنْ عَامِرٍ قَالَلَا يَقُولُ الْقَوْمُ خَلْفَ الْإِمَامِ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ وَلَكِنْ يَقُولُونَ رَبَّنَا لَكَ الْحَمْدُ",
                "id": "Telah menceritakan kepada kami [Bisyr bin 'Ammar] telah menceritakan kepada kami [Asbath] dari [Mutharrif] dari ['Amir] dia berkata; \"Makmum tidak mengucapkan \"Sami'allahu liman hamidah\" dibelakang imam, akan tetapi hendaknya ia mengucapkan \"Rabbana lakal hamdu (Wahai Rabb kami, hanya untuk Engkau lah segala pujian).\""
            },
            {
                "number": 711,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مَسْعُودٍ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا كَامِلٌ أَبُو الْعَلَاءِ حَدَّثَنِي حَبِيبُ بْنُ أَبِي ثَابِتٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ بَيْنَ السَّجْدَتَيْنِ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَعَافِنِي وَاهْدِنِي وَارْزُقْنِي",
                "id": "Telah menceritakan kepada kami [Muhammad bin Mas'ud] telah menceritakan kepada kami [Zaid bin Al Khubbab] telah menceritakan kepada kami [Kamil Abu Al 'Ala`] telah menceritakan kepadaku [Habib bin Abu Tsabit] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam mengucapkan diantara dua sujudnya \"ALLAHUMMA GHFIR LI WARHAMNI WA'AFINI WAHDINI WARZUQNI\" (ya Allah anugerahkanlah untukku ampunan, rahmat, kesejahteraan, petunjuk dan rizki).\""
            },
            {
                "number": 712,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ الْعَسْقَلَانِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ عَبْدِ اللَّهِ بْنِ مُسْلِمٍ أَخِي الزُّهْرِيِّ عَنْ مَوْلًى لِأَسْمَاءَ ابْنَةِ أَبِي بَكْرٍ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ كَانَ مِنْكُنَّ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا تَرْفَعْ رَأْسَهَا حَتَّى يَرْفَعَ الرِّجَالُ رُءُوسَهُمْ كَرَاهَةَ أَنْ يَرَيْنَ مِنْ عَوْرَاتِ الرِّجَالِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutawakkil Al 'Asqalani] telah menceritakan kepada kami [Abdurrazaq] telah memberitakan kepada kami [Ma'mar] dari [Abdullah bin Muslim saudaranya Az Zuhri] dari [Bekas budaknya Asma` binti Abu Bakar] dari [Asma` binti Abu Bakar] dia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa di antara kalian (para wanita) beriman kepada Allah dan hari akhir, janganlah mengangkat kepalanya terlebih dahulu sehingga kaum laki-laki mengangkat kepala mereka, karena di khawatirkan mereka melihat aurat kaum laki-laki.\""
            },
            {
                "number": 713,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ ابْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ سُجُودُهُ وَرُكُوعُهُ وَقُعُودُهُ وَمَا بَيْنَ السَّجْدَتَيْنِ قَرِيبًا مِنْ السَّوَاءِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibnu Abu Laila] dari [Al Barra`] bahwa lama sujud, ruku' dan duduk di antara dua sujudnya Rasulullah shallallahu 'alaihi wasallam hampir sama.\""
            },
            {
                "number": 714,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ وَحُمَيْدٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَمَا صَلَّيْتُ خَلْفَ رَجُلٍ أَوْجَزَ صَلَاةً مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي تَمَامٍ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ قَامَ حَتَّى نَقُولَ قَدْ أَوْهَمَ ثُمَّ يُكَبِّرُ وَيَسْجُدُ وَكَانَ يَقْعُدُ بَيْنَ السَّجْدَتَيْنِ حَتَّى نَقُولَ قَدْ أَوْهَمَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] telah mengabarkan kepada kami [Tsabit] dan [Humaid] dari [Anas bin Malik] dia berkata; \"Aku tidak pernah sholat di belakang seseorang yang paling singkat dan paling sempurna sholatnya daripada sholatnya Rasulullah shallallahu 'alaihi wasallam, apabila Rasulullah shallallahu 'alaihi wasallam mengucapkan; \"Sami'allahu liman hamidah\" beliau berdiri (agak lama) sampai kami menyangka beliau lupa, kemudian beliau bertakbir dan sujud, beliau duduk di antara dua sujud sehingga kami menyangka bahwa beliau lupa.\""
            },
            {
                "number": 715,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَأَبُو كَامِلٍ دَخَلَ حَدِيثُ أَحَدِهِمَا فِي الْآخَرِ قَالَا حَدَّثَنَا أَبُو عَوَانَةَ عَنْ هِلَالِ بْنِ أَبِي حُمَيْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَرَمَقْتُ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ أَبُو كَامِلٍ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصَّلَاةِ فَوَجَدْتُ قِيَامَهُ كَرَكْعَتِهِ وَسَجْدَتِهِ وَاعْتِدَالَهُ فِي الرَّكْعَةِ كَسَجْدَتِهِ وَجِلْسَتَهُ بَيْنَ السَّجْدَتَيْنِ وَسَجْدَتَهُ مَا بَيْنَ التَّسْلِيمِ وَالِانْصِرَافِ قَرِيبًا مِنْ السَّوَاءِ قَالَ أَبُو دَاوُد قَالَ مُسَدَّدٌ فَرَكْعَتُهُ وَاعْتِدَالُهُ بَيْنَ الرَّكْعَتَيْنِ فَسَجْدَتُهُ فَجِلْسَتُهُ بَيْنَ السَّجْدَتَيْنِ فَسَجْدَتُهُ فَجِلْسَتَهُ بَيْنَ التَّسْلِيمِ وَالِانْصِرَافِ قَرِيبًا مِنْ السَّوَاءِ",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Abu Kamil], hadits riwayat mereka berdua saling melengkapi antara yang satu dengan yang lain, keduanya berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Hilal bin Abu Humaid] dari [Abdurrahman bin Abu Laila] dari [Al Barra` bin 'Azib] dia berkata; \"Aku memperhatikan Muhammad shallallahu 'alaihi wasallam -Abu Kamil mengatakan; \"Rasulullah shallallahu 'alaihi wasallam\"- ketika beliau sholat, maka aku mendapati (lama) berdirinya seperti ketika ruku', sujud dan sujudnya, dan aku dapati i'tidal dari ruku' sujud dan duduk di antara dua sujud serta duduk beliau antara salam dan selesai sholat hampir sama lamanya.\" Abu Daud mengatakan; Musaddad mengatakan; \"Maka ruku'nya, i'tidal beliau antara dua raka'at, sujudnya, duduk di antara dua sujud, sujudnya, dan duduk antara salam dan selesai dari sholat (lamanya) hampir sama.\""
            },
            {
                "number": 716,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ أَبِي مَعْمَرٍ عَنْ أَبِي مَسْعُودٍ الْبَدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُجْزِئُ صَلَاةُ الرَّجُلِ حَتَّى يُقِيمَ ظَهْرَهُ فِي الرُّكُوعِ وَالسُّجُودِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar An Namari] telah menceritakan kepada kami [Syu'bah] dari [Sulaiman] dari ['Umarah bin Umair] dari [Abu Ma'mar] dari [Abu Mas'ud Al Badri] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak sempurna sholat seseorang sehingga ia meluruskan punggungnya ketika ruku' dan sujud.\""
            },
            {
                "number": 717,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا أَنَسٌ يَعْنِي ابْنَ عَيَّاضٍ ح و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ وَهَذَا لَفْظُ ابْنِ الْمُثَنَّى حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ الْمَسْجِدَ فَدَخَلَ رَجُلٌ فَصَلَّى ثُمَّ جَاءَ فَسَلَّمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَدَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِ السَّلَامَ وَقَالَ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ فَرَجَعَ الرَّجُلُ فَصَلَّى كَمَا كَانَ صَلَّى ثُمَّ جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمَ عَلَيْهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْكَ السَّلَامُ ثُمَّ قَالَ ارْجِعْ فَصَلِّ فَإِنَّكَ لَمْ تُصَلِّ حَتَّى فَعَلَ ذَلِكَ ثَلَاثَ مِرَارٍ فَقَالَ الرَّجُلُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أُحْسِنُ غَيْرَ هَذَا فَعَلِّمْنِي قَالَ إِذَا قُمْتَ إِلَى الصَّلَاةِ فَكَبِّرْ ثُمَّ اقْرَأْ مَا تَيَسَّرَ مَعَكَ مِنْ الْقُرْآنِ ثُمَّ ارْكَعْ حَتَّى تَطْمَئِنَّ رَاكِعًا ثُمَّ ارْفَعْ حَتَّى تَعْتَدِلَ قَائِمًا ثُمَّ اسْجُدْ حَتَّى تَطْمَئِنَّ سَاجِدًا ثُمَّ اجْلِسْ حَتَّى تَطْمَئِنَّ جَالِسًا ثُمَّ افْعَلْ ذَلِكَ فِي صَلَاتِكَ كُلِّهَاقَالَ الْقَعْنَبِيُّ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ وَقَالَ فِي آخِرِهِ فَإِذَا فَعَلْتَ هَذَا فَقَدْ تَمَّتْ صَلَاتُكَ وَمَا انْتَقَصْتَ مِنْ هَذَا شَيْئًا فَإِنَّمَا انْتَقَصْتَهُ مِنْ صَلَاتِكَ وَقَالَ فِيهِ إِذَا قُمْتَ إِلَى الصَّلَاةِ فَأَسْبِغْ الْوُضُوءَ حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ عَلِيِّ بْنِ يَحْيَى بْنِ خَلَّادٍ عَنْ عَمِّهِ أَنَّ رَجُلًا دَخَلَ الْمَسْجِدَ فَذَكَرَ نَحْوَهُ قَالَ فِيهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ لَا تَتِمُّ صَلَاةٌ لِأَحَدٍ مِنْ النَّاسِ حَتَّى يَتَوَضَّأَ فَيَضَعَ الْوُضُوءَ يَعْنِي مَوَاضِعَهُ ثُمَّ يُكَبِّرُ وَيَحْمَدُ اللَّهَ جَلَّ وَعَزَّ وَيُثْنِي عَلَيْهِ وَيَقْرَأُ بِمَا تَيَسَّرَ مِنْ الْقُرْآنِ ثُمَّ يَقُولُ اللَّهُ أَكْبَرُ ثُمَّ يَرْكَعُ حَتَّى تَطْمَئِنَّ مَفَاصِلُهُ ثُمَّ يَقُولُ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ حَتَّى يَسْتَوِيَ قَائِمًا ثُمَّ يَقُولُ اللَّهُ أَكْبَرُ ثُمَّ يَسْجُدُ حَتَّى تَطْمَئِنَّ مَفَاصِلُهُ ثُمَّ يَقُولُ اللَّهُ أَكْبَرُ وَيَرْفَعُ رَأْسَهُ حَتَّى يَسْتَوِيَ قَاعِدًا ثُمَّ يَقُولُ اللَّهُ أَكْبَرُ ثُمَّ يَسْجُدُ حَتَّى تَطْمَئِنَّ مَفَاصِلُهُ ثُمَّ يَرْفَعُ رَأْسَهُ فَيُكَبِّرُ فَإِذَا فَعَلَ ذَلِكَ فَقَدْ تَمَّتْ صَلَاتُهُ حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ وَالْحَجَّاجُ بْنُ مِنْهَالٍ قَالَا حَدَّثَنَا هَمَّامٌ حَدَّثَنَا إِسْحَقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ عَلِيِّ بْنِ يَحْيَى بْنِ خَلَّادٍ عَنْ أَبِيهِ عَنْ عَمِّهِ رِفَاعَةَ بْنِ رَافِعٍ بِمَعْنَاهُ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهَا لَا تَتِمُّ صَلَاةُ أَحَدِكُمْ حَتَّى يُسْبِغَ الْوُضُوءَ كَمَا أَمَرَهُ اللَّهُ عَزَّ وَجَلَّ فَيَغْسِلَ وَجْهَهُ وَيَدَيْهِ إِلَى الْمِرْفَقَيْنِ وَيَمْسَحَ بِرَأْسِهِ وَرِجْلَيْهِ إِلَى الْكَعْبَيْنِ ثُمَّ يُكَبِّرَ اللَّهَ عَزَّ وَجَلَّ وَيَحْمَدَهُ ثُمَّ يَقْرَأَ مِنْ الْقُرْآنِ مَا أَذِنَ لَهُ فِيهِ وَتَيَسَّرَ فَذَكَرَ نَحْوَ حَدِيثِ حَمَّادٍ قَالَ ثُمَّ يُكَبِّرَ فَيَسْجُدَ فَيُمَكِّنَ وَجْهَهُ قَالَ هَمَّامٌ وَرُبَّمَا قَالَ جَبْهَتَهُ مِنْ الْأَرْضِ حَتَّى تَطْمَئِنَّ مَفَاصِلُهُ وَتَسْتَرْخِيَ ثُمَّ يُكَبِّرَ فَيَسْتَوِيَ قَاعِدًا عَلَى مَقْعَدِهِ وَيُقِيمَ صُلْبَهُ فَوَصَفَ الصَّلَاةَ هَكَذَا أَرْبَعَ رَكَعَاتٍ حَتَّى تَفْرُغَ لَا تَتِمُّ صَلَاةُ أَحَدِكُمْ حَتَّى يَفْعَلَ ذَلِكَ حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ عَنْ مُحَمَّدٍ يَعْنِي ابْنَ عَمْرٍو عَنْ عَلِيِّ بْنِ يَحْيَى بْنِ خَلَّادٍ عَنْ أَبِيهِ عَنْ رِفَاعَةَ بْنِ رَافِعٍ بِهَذِهِ الْقِصَّةِ قَالَ إِذَا قُمْتَ فَتَوَجَّهْتَ إِلَى الْقِبْلَةِ فَكَبِّرْ ثُمَّ اقْرَأْ بِأُمِّ الْقُرْآنِ وَبِمَا شَاءَ اللَّهُ أَنْ تَقْرَأَ وَإِذَا رَكَعْتَ فَضَعْ رَاحَتَيْكَ عَلَى رُكْبَتَيْكَ وَامْدُدْ ظَهْرَكَ وَقَالَ إِذَا سَجَدْتَ فَمَكِّنْ لِسُجُودِكَ فَإِذَا رَفَعْتَ فَاقْعُدْ عَلَى فَخِذِكَ الْيُسْرَى حَدَّثَنَا مُؤَمَّلُ بْنُ هِشَامٍ حَدَّثَنَا إِسْمَعِيلُ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ حَدَّثَنِي عَلِيُّ بْنُ يَحْيَى بْنِ خَلَّادِ بْنِ رَافِعٍ عَنْ أَبِيهِ عَنْ عَمِّهِ رِفَاعَةَ بْنِ رَافِعٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذِهِ الْقِصَّةِ قَالَ إِذَا أَنْتَ قُمْتَ فِي صَلَاتِكَ فَكَبِّرْ اللَّهَ تَعَالَى ثُمَّ اقْرَأْ مَا تَيَسَّرَ عَلَيْكَ مِنْ الْقُرْآنِ وَقَالَ فِيهِ فَإِذَا جَلَسْتَ فِي وَسَطِ الصَّلَاةِ فَاطْمَئِنَّ وَافْتَرِشْ فَخِذَكَ الْيُسْرَى ثُمَّ تَشَهَّدْ ثُمَّ إِذَا قُمْتَ فَمِثْلَ ذَلِكَ حَتَّى تَفْرُغَ مِنْ صَلَاتِكَ حَدَّثَنَا عَبَّادُ بْنُ مُوسَى الْخُتَّلِيُّ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ جَعْفَرٍ أَخْبَرَنِي يَحْيَى بْنُ عَلِيِّ بْنِ يَحْيَى بْنِ خَلَّادِ بْنِ رَافِعٍ الزُّرَقِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ رِفَاعَةَ بْنِ رَافِعٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَصَّ هَذَا الْحَدِيثَ قَالَ فِيهِ فَتَوَضَّأْ كَمَا أَمَرَكَ اللَّهُ جَلَّ وَعَزَّ ثُمَّ تَشَهَّدْ فَأَقِمْ ثُمَّ كَبِّرْ فَإِنْ كَانَ مَعَكَ قُرْآنٌ فَاقْرَأْ بِهِ وَإِلَّا فَاحْمَدْ اللَّهَ وَكَبِّرْهُ وَهَلِّلْهُ وَقَالَ فِيهِ وَإِنْ انْتَقَصْتَ مِنْهُ شَيْئًا انْتَقَصْتَ مِنْ صَلَاتِكَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] telah menceritakan kepada kami [Anas yaitu Ibnu 'Ayyadl]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepadaku [Yahya bin Sa'id] dari ['ubaidhullah] sedangkan lafadz hadits ini berasal dari Al Mutsanna telah menceritakan kepadaku [Sa'id bin Abu Sa'id] dari [ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam masuk masjid, bersamaan dengan itu seorang laki-laki masuk masjid lalu sholat, seusai sholat, dia datang sambil memberi salam kepada Rasulullah shallallahu 'alaihi wasallam, lalu Rasulullah shallallahu 'alaihi wasallam menjawab salamnya dan bersabda: \"Kembali dan sholatlah, karena kamu belum mengerjakan sholat.\" laki-laki itu kembali mengerjakan sholat sebagaimana ia sholat, kemudian dia datang kepada Nabi shallallahu 'alaihi wasallam dan memberi salam kepada beliau, maka Rasulullah shallallahu 'alaihi wasallam menjawab salamnya, sabdanya; \"Alaikas salam.\" kemudian bersabda: \"sholatlah kamu, sesungguhnya kamu belum mengerjakan sholat.\" hal itu di ulanginya sampai tiga kali. Laki-laki itu berkata; \"Demi dzat yang telah mengutus-Mu dengan kebenaran, aku tidak dapat mengerjakan yang lebih baik selain cara ini, oleh karena itu ajarilah aku.\" Beliau bersabda: \"Apabila kamu hendak mengerjakan sholat, bertakbirlah, kemudian bacalah ayat Al Qur'an yang mudah bagimu, lalu ruku'lah hingga kamu benar-benar (tenang) dalam posisi ruku', setelah itu bangkitlah sampai berdiri lurus kembali, kemudian sujudlah hingga benar-benar dalam posisi sujud, lalu duduklah hingga benar-benar dalam posisi duduk, lalu sujud kembali hingga benar-benar sujud, kemudian lakukanlah hal itu di setiap sholatmu.\" [Al Qa'nabi] mengatakan; dari [Sa'id bin Abu Sa'id Al Maqburi] dari [Abu Hurairah] …' di akhir haditsnya ia mengatakan; \"Jika kamu melakukan seperti ini, maka sholatmu menjadi sempurna, dan apabila kamu mengurangi dari cara ini, berarti kesempurnaan sholatmu juga akan terkurangi.\" Dalam hadits ini juga di sebutkan; \"Apabila kamu hendak mengerjakan sholat, maka sempurnakanlah wudlu'mu.\" Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Ali bin Yahya bin Khallad] dari [pamannya] bahwa seorang laki-laki masuk masjid…\" selanjutnya dia melanjutkan seperti hadits di atas, lalu dia berkata; \"Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya tidak sempurna sholat seseorang sehingga dia berwudlu' yaitu membasuh anggota wudlu'nya (dengan sempurna) kemudian bertakbir, memuji Allah Jalla wa 'Azza, menyanjung-Nya dan membaca AL Qur'an yang mudah baginya. Setelah itu mengucapkan Allahu Akbar, kemudian ruku' sampai tenang semua persendiannya, lalu mengucapkan \"Sami'allahu liman hamidah\" sampai berdiri lurus, kemudian mengucapkan Allahu Akbar, lalu sujud sehingga semua persendiannya tenang. Setelah itu mengangkat kepalanya sambil bertakbir. Apabila dia telah mengerjakan seperti demikian, maka sholatnya menjadi sempurna.\" Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Hisyam bin Abdul Malik] dan [Hajjaj bin Minhal] keduanya berkata; telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Ishaq bin Abdullah bin Abu Thalhah] dari [Ali bin Yahya bin Khallad] dari [ayahnya] dari [pamannya yaitu Rifa'ah bin Rafi'] dengan makna yang sama, dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak sempurna sholat salah seorang dari kalian sehingga dirinya menyempurnakan wudlu' sebagaimana yang di perintahkan Allah Azza wa Jalla, yaitu membasuh mukanya dan kedua tangannya sampai kedua sikunya, dan membasuh kepalanya dan kedua kakinya hingga kedua mata kakinya, kemudian mengucapkan takbir, memuji Allah dan membaca Al Qur'an yang mudah baginya…\" kemudian ia menyebutkan seperti haditsnya Hammad, katanya; \"…Kemudian bertakbir, bersujud dengan meletakkan muka -Hammam mengatakan; sepertinya dia mengatakan- atau keningnya ke tanah, sehingga semua persendiannya tenang dan menjadi rileks, lalu bertakbir dan duduk pada tempat duduknya hingga lurus tulang punggungnya, maka beliau mempraktekkan cara sholat tersebut hingga empat kali sampai selesai, tidak sempurna sholat seseorang di antara kalian, sehingga ia mengerjakan cara sholat yang seperti ini.\" telah menceritakan kepada kami [Wahb bin Baqiyah] dari [Khalid] dari [Muhammad yaitu Ibnu 'Amru] dari [Ali bin Yahya bin Khallad] dari [ayahnya] dari [Rifa'ah bin Rafi'] dengan kisah seperti ini, sabdanya: \"Apabila kamu hendak mengerjakan sholat, dan wajahmu telah menghadap ke arah kiblat, maka bertakbirlah lalu bacalah Ummul Qur'an dan surat sesuka hatimu, dan sesuai kehendak Allah untuk kamu baca, apabila kamu ruku', maka letakkanlah kedua telapak tanganmu di atas kedua lututmu dan hamparkanlah punggungmu.\" Setelah itu beliau bersabda: \"Apabila kamu hendak sujud, maka kuatkanlah (kedua tangan) untuk menyangga sujudmu, dan apabila kamu mengangkat (kepala dari sujud) maka duduklah di atas pahamu yang kiri.\" Telah menceritakan kepada kami [Mu'ammal bin Hisyam] telah menceritakan kepada kami [Isma'il] dari [Muhammad bin ishaq] telah menceritakan kepadaku [Ali bin Yahya bin Khallad bin Rafi'] dari [ayahnya] dari [pamannya yaitu Rifa'ah bin Rafi'] dari Nabi shallallahu 'alaihi wasallam dengan kisah seperti ini, beliau bersabda: \"Apabila kamu hendak mengerjakan sholat, bertakbirlah kepada Allah Ta'ala, kemudian bacalah Al Qur'an yang mudah bagimu.\" -dalam hadits tersebut beliau juga bersabda- Apabila kamu duduk di tengah mengerjakan sholat, maka tenangkanlah dirimu dan duduklah di atas paha kirimu, kemudian bacalah tasyahud. Setelah itu, apabila kamu berdiri, kerjakanlah seperti itu pula, sehingga kamu selesai dari sholat.\" Telah menceritakan kepada kami ['Abbad bin Musa Al Khuttali] telah menceritakan kepada kami [Isma'il yaitu Ibnu Ja'far] telah mengabarkan kepadaku [Yahya bin Ali bin Yahya bin Khallad bin Rafi' Az Zuraqi] dari [ayahnya] dari [kakeknya] dari [Rifa'ah bin Rafi'] bahwa Rasulullah shallallahu 'alaihi wasallam -lalu di ceritakannya hadits tersebut, di antaranya beliau bersabda: \"Maka berwudlu'lah sebagaimana yang di perintahkan oleh Allah Jalla wa Azza kepadamu, kemudian bacalah Tasyahud (setelah wudlu), dan dirikanlah (sholat) kemudian bertakbirlah, jika kamu bisa membaca (hafal) dari surat Al Qur'an, maka bacalah, jika tidak (bisa membaca), maka bertahmid (membaca Al Hamdulillah), bertakbir (membaca Allahu Akbar) dan bertahlil (membaca Laa ilaaha illallah) lah kepada Allah.\" -dalam hadits itu pula beliau bersabda; \"…Jika kamu mengurangi sedikit dari cara tersebut, berarti kamu mengurangi (kesempurnaan) sholatmu.\""
            },
            {
                "number": 718,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ جَعْفَرِ بْنِ الْحَكَمِ ح و حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ جَعْفَرِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّ عَنْ تَمِيمِ بْنِ مَحْمُودٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شِبْلٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَقْرَةِ الْغُرَابِ وَافْتِرَاشِ السَّبْعِ وَأَنْ يُوَطِّنَ الرَّجُلُ الْمَكَانَ فِي الْمَسْجِدِ كَمَا يُوَطِّنُ الْبَعِيرُهَذَا لَفْظُ قُتَيْبَةَ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari [Ja'far bin Al Hakam]. Dan diriwayatkan dari jalur lain, telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Ja'far bin Abdullah Al Anshari] dari [Tamim bin Mahmud] dari [Abdurrahman bin Syibl] dia berkata; Rasulullah shallallahu 'alaihi wasallam melarang (sujud dengan cepat) seperti burung gagak mematuk dan (menghamparkan lengan ketika sujud) seperti binatang buas yang sedang membentangkan kakinya dan melarang seseorang mengambil lokasi khusus di Masjid (untuk ibadatnya) sebagaimana unta menempati tempat berderumnya.\" Ini adalah lafadz yang berasal dari Qutaibah.\" "
            },
            {
                "number": 719,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ سَالِمٍ الْبَرَّادِ قَالَأَتَيْنَا عُقْبَةَ بْنَ عَمْرٍو الْأَنْصَارِيَّ أَبَا مَسْعُودٍ فَقُلْنَا لَهُ حَدِّثْنَا عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ بَيْنَ أَيْدِينَا فِي الْمَسْجِدِ فَكَبَّرَ فَلَمَّا رَكَعَ وَضَعَ يَدَيْهِ عَلَى رُكْبَتَيْهِ وَجَعَلَ أَصَابِعَهُ أَسْفَلَ مِنْ ذَلِكَ وَجَافَى بَيْنَ مِرْفَقَيْهِ حَتَّى اسْتَقَرَّ كُلُّ شَيْءٍ مِنْهُ ثُمَّ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقَامَ حَتَّى اسْتَقَرَّ كُلُّ شَيْءٍ مِنْهُ ثُمَّ كَبَّرَ وَسَجَدَ وَوَضَعَ كَفَّيْهِ عَلَى الْأَرْضِ ثُمَّ جَافَى بَيْنَ مِرْفَقَيْهِ حَتَّى اسْتَقَرَّ كُلُّ شَيْءٍ مِنْهُ ثُمَّ رَفَعَ رَأْسَهُ فَجَلَسَ حَتَّى اسْتَقَرَّ كُلُّ شَيْءٍ مِنْهُ فَفَعَلَ مِثْلَ ذَلِكَ أَيْضًا ثُمَّ صَلَّى أَرْبَعَ رَكَعَاتٍ مِثْلَ هَذِهِ الرَّكْعَةِ فَصَلَّى صَلَاتَهُ ثُمَّ قَالَ هَكَذَا رَأَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Jarir] dari ['Atha` bin As Sa`ib] dari [Salim Al Barrad] dia berkata; aku menemui ['Uqbah bin 'Amru Al Anshari yaitu Abu Mas'ud] maka kau berkata kepadanya; \"Jelaskanlah kepada kami tata cara sholat Rasulullah shallallahu 'alaihi wasallam!.\" maka dia berdiri di depan kami di masjid, lalu bertakbir. Ketika ruku', dia meletakkan kedua tangannya di atas kedua lututnya dan meletakkan jemarinya lebih rendah dari itu, sedangkan kedua sikunya di renggangkan, sehingga semua anggota tubuhnya tenang (thuma'ninah), kemudian bertakbir dan sujud, setelah itu ia meletakkan kedua telapak tangannya ke tanah, dan merenggangkan antara kedua sikunya sampai semua anggota tubuhnya tenang (thuma'ninah). Dia mengerjakan yang demikian itu, dan sholat empat raka'at sebagaimana raka'at ini, setelah mengerjakan sholatnya, dia berkata; \"Demikianlah kami pernah melihat Rasulullah shallallahu 'alaihi wasallam mengerjakan sholat.\""
            },
            {
                "number": 720,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا إِسْمَعِيلُ حَدَّثَنَا يُونُسُ عَنْ الْحَسَنِ عَنْ أَنَسِ بْنِ حَكِيمٍ الضَّبِّيِّ قَالَخَافَ مِنْ زِيَادٍ أَوْ ابْنِ زِيَادٍ فَأَتَى الْمَدِينَةَ فَلَقِيَ أَبَا هُرَيْرَةَ قَالَ فَنَسَبَنِي فَانْتَسَبْتُ لَهُ فَقَالَ يَا فَتَى أَلَا أُحَدِّثُكَ حَدِيثًا قَالَ قُلْتُ بَلَى رَحِمَكَ اللَّهُ قَالَ يُونُسُ وَأَحْسَبُهُ ذَكَرَهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَوَّلَ مَا يُحَاسَبُ النَّاسُ بِهِ يَوْمَ الْقِيَامَةِ مِنْ أَعْمَالِهِمْ الصَّلَاةُ قَالَ يَقُولُ رَبُّنَا جَلَّ وَعَزَّ لِمَلَائِكَتِهِ وَهُوَ أَعْلَمُ انْظُرُوا فِي صَلَاةِ عَبْدِي أَتَمَّهَا أَمْ نَقَصَهَا فَإِنْ كَانَتْ تَامَّةً كُتِبَتْ لَهُ تَامَّةً وَإِنْ كَانَ انْتَقَصَ مِنْهَا شَيْئًا قَالَ انْظُرُوا هَلْ لِعَبْدِي مِنْ تَطَوُّعٍ فَإِنْ كَانَ لَهُ تَطَوُّعٌ قَالَ أَتِمُّوا لِعَبْدِي فَرِيضَتَهُ مِنْ تَطَوُّعِهِ ثُمَّ تُؤْخَذُ الْأَعْمَالُ عَلَى ذَاكُمْحَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ حُمَيْدٍ عَنْ الْحَسَنِ عَنْ رَجُلٍ مِنْ بَنِي سَلِيطٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ تَمِيمٍ الدَّارِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْمَعْنَى قَالَ ثُمَّ الزَّكَاةُ مِثْلُ ذَلِكَ ثُمَّ تُؤْخَذُ الْأَعْمَالُ عَلَى حَسَبِ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Isma'il] telah menceritakan kepada kami [Yunus] dari [Al Hasan] dari [Anas bin Hakim Adl Dlabbi] dia berkata; \"Dirinya pernah takut kepada Ziyad atau Ibnu Ziyad kemudian pergi ke Madinah, di sana ia bertemu dengan Abu Hurairah, katanya; dia menasabkan aku kepadanya dan aku pun menyatakan nasab kepadanya.\" [Abu Hurairah] berkata; \"Wahai anak muda, maukah kamu kuceritakan suatu hadits?\" kata Anas; kataku; \"Ya, semoga Allah merahmati anda.\" Yunus berkata; \"Aku kira dia menyebutkan dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya yang pertama kali akan di hisab dari amal perbuatan manusia pada hari kiamat adalah sholatnya, Allah Jalla wa 'Azza berfirman kepada Malaikat -Dan Dia lebih mengetahui (amalan seseorang) -; \"Periksalah sholat hamba-Ku, sempurnakah atau justru kurang? Sekiranya sempurna, maka catatlah baginya dengan sempurna, dan jika terdapat kekurangan, Allah berfirman; \"Periksalah lagi, apakah hamba-Ku memiliki amalan sholat sunnah? Jikalau terdapat sholat sunnahnya, Allah berfirman; \"Cukupkanlah kekurangan yang ada pada sholat wajib hamba-Ku itu dengan sholat sunnahnya.\" Selanjutnya semua amal manusia di hisab dengan cara demikian.\" Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Humaid] dari [Al Hasan] dari [seorang laki-laki dari Bani Salith] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas. Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Daud bin Abu Hind] dari [Zurarah bin Aufa] dari [Tamim Ad Dari] dari Nabi shallallahu 'alaihi wasallam dengan makna seperti ini, beliau bersabda: \"Kemudian zakat, (di hisab) seperti itu juga, kemudian semua amalan di hisab seperti itu.\""
            },
            {
                "number": 721,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي يَعْفُورٍ قَالَ أَبُو دَاوُد وَاسْمُهُ وَقْدَانُ عَنْ مُصْعَبِ بْنِ سَعْدٍ قَالَصَلَّيْتُ إِلَى جَنْبِ أَبِي فَجَعَلْتُ يَدَيَّ بَيْنَ رُكْبَتَيَّ فَنَهَانِي عَنْ ذَلِكَ فَعُدْتُ فَقَالَ لَا تَصْنَعْ هَذَا فَإِنَّا كُنَّا نَفْعَلُهُ فَنُهِينَا عَنْ ذَلِكَ وَأُمِرْنَا أَنْ نَضَعَ أَيْدِيَنَا عَلَى الرُّكَبِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dari [Abu Ya'fur]. Abu Daud mengatakan; namanya adalah Waqdan, dari [Mush'ab bin Sa'd] dia berkata; \"Aku mengerjakan sholat di samping ayahku, lalu aku meletakkan kedua tanganku antara kedua lututku, maka dia melarangku mengerjakan cara yang demikian, lalu saya mengulanginya, maka [ayahku] berkata; \"Janganlah kamu melakukan cara yang seperti ini, karena sesungguhnya kami pernah melakukan cara seperti ini, lalu kami dilarang melakukannya dan kami di perintahkan supaya meletakkan tangan di atas lutut.\""
            },
            {
                "number": 722,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ وَالْأَسْوَدِ عَنْ عَبْدِ اللَّهِ قَالَإِذَا رَكَعَ أَحَدُكُمْ فَلْيَفْرِشْ ذِرَاعَيْهِ عَلَى فَخِذَيْهِ وَلْيُطَبِّقْ بَيْنَ كَفَّيْهِ فَكَأَنِّي أَنْظُرُ إِلَى اخْتِلَافِ أَصَابِعِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy] dari [Ibrahim] dari ['Alqamah] dan [Al Aswad] dari [Abdullah] dia berkata; \"Apabila salah seorang dari kalian ruku', maka hamparkanlah kedua hastanya di atas pahanya dan ratakanlah antara kedua telapak tangannya, seakan-akan aku melihat jemari Rasulullah shallallahu 'alaihi wasallam bersilang.\""
            },
            {
                "number": 723,
                "arab": "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ وَمُوسَى بْنُ إِسْمَعِيلَ الْمَعْنَى قَالَا حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ مُوسَى قَالَ أَبُو سَلَمَةَ مُوسَى بْنِ أَيُّوبَ عَنْ عَمِّهِ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَلَمَّا نَزَلَتْ{ فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظِيمِ }قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْعَلُوهَا فِي رُكُوعِكُمْ فَلَمَّا نَزَلَتْ{ سَبِّحْ اسْمَ رَبِّكَ الْأَعْلَى }قَالَ اجْعَلُوهَا فِي سُجُودِكُمْحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا اللَّيْثُ يَعْنِي ابْنَ سَعْدٍ عَنْ أَيُّوبَ بْنِ مُوسَى أَوْ مُوسَى بْنِ أَيُّوبَ عَنْ رَجُلٍ مِنْ قَوْمِهِ عَنْ عُقْبَةَ بْنِ عَامِرٍ بِمَعْنَاهُ زَادَ قَالَ فَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَكَعَ قَالَ سُبْحَانَ رَبِّيَ الْعَظِيمِ وَبِحَمْدِهِ ثَلَاثًا وَإِذَا سَجَدَ قَالَ سُبْحَانَ رَبِّيَ الْأَعْلَى وَبِحَمْدِهِ ثَلَاثًا قَالَ أَبُو دَاوُد وَهَذِهِ الزِّيَادَةُ نَخَافُ أَنْ لَا تَكُونَ مَحْفُوظَةً قَالَ أَبُو دَاوُد انْفَرَدَ أَهْلُ مِصْرَ بِإِسْنَادِ هَذَيْنِ الْحَدِيثَيْنِ حَدِيثِ الرَّبِيعِ وَحَدِيثِ أَحْمَدَ بْنِ يُونُسَ",
                "id": "Telah menceritakan kepada kami [Ar Rabi' bin Nafi' Abu Tsaubah] dan [Musa bin Isma'il] sedangkan maksud haditsnya sama, keduanya berkata; telah menceritakan kepada kami [Ibnu Al Mubarrak] dari [Musa]. Abu Salamah Musa bin Ayyub mengatakan; dari [pamannya] dari ['Uqbah bin 'Amir] dia berkata; Ketika turun; \"FASABBIH BISMIRABBIKAL 'ADZIIM (maka sucikanlah dengan nama Rabbmu yang Maha Agung).\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jadikanlah ia sebagai bacaan ruku' kalian.\" dan ketika turun; \"SABBIHISMA RABBIKAL A'LA (Sucikanlah dengan nama Rabbmu yang Maha tinggi) \" maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jadikanlah ia sebagai bacaan sujud kalian.\" telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Al Laits yaitu Ibnu Sa'd] dari [Ayyub bin Musa atau Musa bin Ayyub] dari [seorang laki-laki dari Kaumnya] dari ['Uqbah bin 'Amir] dengan makna yang sama, dia menambahkan; Uqbah berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam ruku' beliau mengucapkan; \"Subhaana rabbiyal 'azhiim wa bihamdihi (Maha suci Rabbku yang Maha Agung dengan pujian-Nya) \" sebanyak tiga kali, dan apabila sujud beliau mengucapkan; \"Subhaana rabbiyal a'la wa bihamdih (Maha suci Rabbku yang Maha Tinggi dengan segala pujian-Nya) \" sebanyak tiga kali.\" Abu Daud mengatakan; \"Saya khawatir tambahan ini tidak dari tambahan yang benar-benar terjaga (kebenarannya).\" Abu Daud mengatakan; \"Penduduk Mesir meriwayatkan dengan periwayatan tunggal mengenai dua isnad hadits ini yaitu hadits Rabi' dan hadits Ahmad bin Yunus. "
            },
            {
                "number": 724,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ قَالَ قُلْتُ لِسُلَيْمَانَ أَدْعُو فِي الصَّلَاةِ إِذَا مَرَرْتُ بِآيَةِ تَخَوُّفٍ فَحَدَّثَنِي عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ مُسْتَوْرِدٍ عَنْ صِلَةَ بْنِ زُفَرَ عَنْ حُذَيْفَةَأَنَّهُ صَلَّى مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ يَقُولُ فِي رُكُوعِهِ سُبْحَانَ رَبِّيَ الْعَظِيمِ وَفِي سُجُودِهِ سُبْحَانَ رَبِّيَ الْأَعْلَى وَمَا مَرَّ بِآيَةِ رَحْمَةٍ إِلَّا وَقَفَ عِنْدَهَا فَسَأَلَ وَلَا بِآيَةِ عَذَابٍ إِلَّا وَقَفَ عِنْدَهَا فَتَعَوَّذَ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah] dia berkata; saya berkata kepada Sulaiman; apabila aku membaca ayat yang mengandung ketakutan apakah aku harus berdoa dalam sholat?\" maka [Sulaiman] menceritakan kepadaku dari [Sa'd bin 'Ubaidah] dari [Mustaurid] dari [Shilah bin Zufar] dari [Hudzaifah] bahwa dia sholat bersama Nabi shallallahu 'alaihi wasallam, ketika ruku' beliau membaca: \"Subhaana rabbiyal 'azhiimi (Maha suci Rabbku yang Maha Agung) \" dan ketika sujud beliau membaca: \"Subhaana Rabbiyal a'la (Maha suci Rabbku yang Maha Tinggi).\" Dan beliau tidak melewati ayat tentang rahmat melainkan beliau akan berhenti pada ayat tersebut, lalu berdo'a. dan tidaklah beliau melewati ayat tentang adzab (siksa) melainkan beliau akan berhenti pada ayat tersebut lalu memohon perlindungan.\""
            },
            {
                "number": 725,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ حَدَّثَنَا قَتَادَةُ عَنْ مُطَرِّفٍ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ فِي رُكُوعِهِ وَسُجُودِهِ سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلَائِكَةِ وَالرُّوحِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] telah menceritakan kepada kami [Qatadah] dari [Mutharif] dari [Aisyah] bahwa ketika Nabi shallallahu 'alaihi wasallam ruku' dan sujudnya, beliau mengucapkan: \"Subbuhun quddusun rabbul Malaaikati war ruuhi (Maha suci (Allah), Rabb kami, para Malaikat dan Jibril).\""
            },
            {
                "number": 726,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ عَنْ عَمْرِو بْنِ قَيْسٍ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ قَالَقُمْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْلَةً فَقَامَ فَقَرَأَ سُورَةَ الْبَقَرَةِ لَا يَمُرُّ بِآيَةِ رَحْمَةٍ إِلَّا وَقَفَ فَسَأَلَ وَلَا يَمُرُّ بِآيَةِ عَذَابٍ إِلَّا وَقَفَ فَتَعَوَّذَ قَالَ ثُمَّ رَكَعَ بِقَدْرِ قِيَامِهِ يَقُولُ فِي رُكُوعِهِ سُبْحَانَ ذِي الْجَبَرُوتِ وَالْمَلَكُوتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ ثُمَّ سَجَدَ بِقَدْرِ قِيَامِهِ ثُمَّ قَالَ فِي سُجُودِهِ مِثْلَ ذَلِكَ ثُمَّ قَامَ فَقَرَأَ بِآلِ عِمْرَانَ ثُمَّ قَرَأَ سُورَةً سُورَةً",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah menceritakan kepada kami [Mu'awiyah bin Shalih] dari ['Amru bin Qais] dari ['Ashim bin Humaid] dari ['Auf bin Malik Al Asyja'i] dia berkata; \"Di suatu malam, aku mengerjakan sholat bersama Rasulullah shallallahu 'alaihi wasallam, beliau kemudian berdiri dan membaca surat Al Baqarah, tidaklah beliau melewati ayat tentang rahmat, pasti beliau berhenti dan memohon kepada-Nya, dan tidaklah melewati ayat tentang adzab, melainkan beliau berhenti dan meminta perlindungan darinya.\" katanya melanjutkan; \"Kemudian beliau ruku' yang lamanya seperti beliau berdiri, dalam ruku'nya beliau mengucapkan: \"subahaana dzil jabaruuti wal malakuuti wal kibriyaa`i wal 'azhamati (Maha suci dzat yang memiliki sifat kekuasaan, kerajaan, kebesaran dan keagungan).\" Kemudian beliau sujud yang lamanya seperti beliau berdiri, dalam sujudnya beliau mengucapkan seperti itu juga, sesudah itu beliau berdiri, lalu membaca surat Ali Imran, kemudian membaca surat demi surat.\""
            },
            {
                "number": 727,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ وَعَلِيُّ بْنُ الْجَعْدِ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ أَبِي حَمْزَةَ مَوْلَى الْأَنْصَارِ عَنْ رَجُلٍ مِنْ بَنِي عَبْسٍ عَنْ حُذَيْفَةَأَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي مِنْ اللَّيْلِ فَكَانَ يَقُولُ اللَّهُ أَكْبَرُ ثَلَاثًا ذُو الْمَلَكُوتِ وَالْجَبَرُوتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ ثُمَّ اسْتَفْتَحَ فَقَرَأَ الْبَقَرَةَ ثُمَّ رَكَعَ فَكَانَ رُكُوعُهُ نَحْوًا مِنْ قِيَامِهِ وَكَانَ يَقُولُ فِي رُكُوعِهِ سُبْحَانَ رَبِّيَ الْعَظِيمِ سُبْحَانَ رَبِّيَ الْعَظِيمِ ثُمَّ رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ فَكَانَ قِيَامُهُ نَحْوًا مِنْ رُكُوعِهِ يَقُولُ لِرَبِّيَ الْحَمْدُ ثُمَّ سَجَدَ فَكَانَ سُجُودُهُ نَحْوًا مِنْ قِيَامِهِ فَكَانَ يَقُولُ فِي سُجُودِهِ سُبْحَانَ رَبِّيَ الْأَعْلَى ثُمَّ رَفَعَ رَأْسَهُ مِنْ السُّجُودِ وَكَانَ يَقْعُدُ فِيمَا بَيْنَ السَّجْدَتَيْنِ نَحْوًا مِنْ سُجُودِهِ وَكَانَ يَقُولُ رَبِّ اغْفِرْ لِي رَبِّ اغْفِرْ لِي فَصَلَّى أَرْبَعَ رَكَعَاتٍ فَقَرَأَ فِيهِنَّ الْبَقَرَةَ وَآلَ عِمْرَانَ وَالنِّسَاءَ وَالْمَائِدَةَ أَوْ الْأَنْعَامَ شَكَّ شُعْبَةُ",
                "id": "Telah menceritakan kepada kami [Abu Walid Ath Thayalisi] dan [Ali bin Al Ja'd] keduanya berkata; telah menceritakan kepada kami [Syu'bah] dari ['Amru bin Murrah] dari [Abu Hamzah bekas budak Al Anshari] dari [seorang laki-laki dari Bani 'Absi] dari [Hudzaifah] bahwa dia melihat Rasulullah shallallahu 'alaihi wasallam sholat malam, dalam sholatnya beliau mengucapkan; \"Allahu Akbar\" tiga kali dzul malakuuti wal Jabaruuri wal kibriyaa`i wal 'adzamati (Maha suci dzat yang memiliki kerajaan, kekuasaan, kebesaran dan keagungan).\" Kemudian beliau membaca do'a iftitah, lalu membaca surat Al Baqarah, kemudian beliau ruku, lama beliau ruku' hampir sama ketika beliau berdiri, dalam ruku'nya beliau mengucapkan; \"Subhaana rabbiyal 'azhiimi, Subhaana rabbiyal 'azhiimi (Maha suci Rabbku yang Maha Agung, Maha suci Rabbku yang Maha Agung).\" Kemudian beliau mengangkat kepalanya dari ruku', sedangkan lamanya beliau berdiri (i'tidal) seperti ketika beliau ruku', beliau mengucapkan; \"Lirabbiyal hamdu (Bagi rabbku segala puji-pujian).\" Kemudian beliau sujud, sedangkan lamanya beliau sujud seperti ketika beliau berdiri, dalam sujudnya beliau mengucapkan; \"Subhaana rabbiyal a'la (Maha suci Rabbku yang Maha tinggi).\" Kemudian beliau mengangkat kepalanya dari sujud, lama beliau duduk di antara dua sujud seperti ketika beliau sujud, dan dalam duduk di antara dua sujudnya beliau mengucapkan: \"Rabbighfirlii, Rabbighfirlii\" kemudian beliau sholat empat raka'at, dalam sholatnya itu beliau membaca surat Al Baqarah, Ali Imran, An Nisa', Al Maidah atau Al An'am -Syu'bah ragu (dalam lafadznya).\""
            },
            {
                "number": 728,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ وَأَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ وَمُحَمَّدُ بْنُ سَلَمَةَ قَالُوا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنَا عَمْرٌو يَعْنِي ابْنَ الْحَارِثِ عَنْ عُمَارَةَ بْنِ غَزِيَّةَ عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرٍ أَنَّهُ سَمِعَ أَبَا صَالِحٍ ذَكْوَانَ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ وَهُوَ سَاجِدٌ فَأَكْثِرُوا الدُّعَاءَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], [Ahmad bin 'Amru bin As Sarh] dan [Muhammad bin Salamah] mereka mengatakan; telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepada kami ['Amru yaitu Ibnu Al Harits] dari ['Umarah bin Ghaziyah] dari [Sumayya bekas budak Abu Bakr] bahwa dia mendengar [Abu Shalih Dzakwan] menceritakan dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saat paling dekat bagi seorang hamba dengan Rabbnya adalah ketika dia sujud, karena itu perbanyaklah berdo'a ketika sujud.\""
            },
            {
                "number": 729,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ سُلَيْمَانَ بْنِ سُحَيْمٍ عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَشَفَ السِّتَارَةَ وَالنَّاسُ صُفُوفٌ خَلْفَ أَبِي بَكْرٍ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّهُ لَمْ يَبْقَ مِنْ مُبَشِّرَاتِ النُّبُوَّةِ إِلَّا الرُّؤْيَا الصَّالِحَةُ يَرَاهَا الْمُسْلِمُ أَوْ تُرَى لَهُ وَإِنِّي نُهِيتُ أَنْ أَقْرَأَ رَاكِعًا أَوْ سَاجِدًا فَأَمَّا الرُّكُوعُ فَعَظِّمُوا الرَّبَّ فِيهِ وَأَمَّا السُّجُودُ فَاجْتَهِدُوا فِي الدُّعَاءِ فَقَمِنٌ أَنْ يُسْتَجَابَ لَكُمْ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Sufyan] dari [Sulaiman bin Suhaim] dari [Ibrahim bin Abdullah bin Ma'bad] dari [ayahnya] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam menyingkap tirai (kamarnya) sementara orang-orang sedang berbaris di belakang Abu Bakar, maka beliau bersabda: \"Wahai sekalian manusia, sesungguhnya berita gembira kenabian telah tiada, kecuali mimpi yang shalih (benar) yang di mimpikan oleh seorang muslim atau yang di perlihatkan kepadanya, ketahuilah aku di larang membaca Al Qur'an ketika ruku' dan sujud, oleh karena itu, ketika ruku', hendaklah kalian mengagungkan Rabb (Allah), sedangkan ketika sujud, hendaklah kalian bersungguh-sungguh dalam berdo'a, karena besar kemungkinan do'a kalian akan di kabulkan oleh Allah.\""
            },
            {
                "number": 730,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي الضُّحَى عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكْثِرُ أَنْ يَقُولَ فِي رُكُوعِهِ وَسُجُودِهِ سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي يَتَأَوَّلُ الْقُرْآنَ",
                "id": "telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Abu Adl Dluha] dari [Masruq] dari [Aisyah] dia berkata; \"Dalam ruku' dan sujudnya Rasulullah shallallahu 'alaihi wasallam sering memperbanyak bacaan \"Subhaanaka Allahumma Rabbana wa bihamdika Allahummaghfir li\" (Maha suci Engkau ya Allah wahai Rabb kami segala puji bagi-Mu, ya Allah ampunilah aku).\" beliau menta'wilkan Al Qur'an. "
            },
            {
                "number": 731,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ عَنْ عُمَارَةَ بْنِ غَزِيَّةَ عَنْ سُمَيٍّ مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ فِي سُجُودِهِ اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ دِقَّهُ وَجِلَّهُ وَأَوَّلَهُ وَآخِرَهُ زَادَ ابْنُ السَّرْحِ عَلَانِيَتَهُ وَسِرَّهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] dan telah di riwayatkan dari jalur lain, telah menceritakan kepada kami [Ahmad bin As Sarh] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yahya bin Ayyub] dari ['Umarah bin Ghaziyah] dari [Sumayya bekas budak Abu Bakar] dari [Abu Shalih] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam dalam sujudnya membaca: \"Allahummaghfir li dzanbi kulluhu diqqahu wa jillahu wa awwalahu wa akhirahu\" (ya Allah ampunilah dosaku semuanya, baik yang kecil maupun yang besar, dan dari yang pertama sampai yang terakhir).\" Ibnu Siraj menambahkan \"Alaniyatahu wa sirrahu\" (baik yang nampak ataupun yang tersembunyi).\""
            },
            {
                "number": 732,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا عَبْدَةُ عَنْ عُبَيْدِ اللَّهِ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْفَقَدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ فَلَمَسْتُ الْمَسْجِدَ فَإِذَا هُوَ سَاجِدٌ وَقَدَمَاهُ مَنْصُوبَتَانِ وَهُوَ يَقُولُ أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ وَأَعُوذُ بِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ وَأَعُوذُ بِكَ مِنْكَ لَا أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] telah menceritakan kepada kami ['Abdah] dari ['ubaidhullah] dari [Muhammad Ibnu Yahya bin Habban] dari [Abdurrahman Al A'raj] dari [Abu Huraiah] dari [Aisyah radliallahu 'anha] dia berkata; \"Suatu malam aku kehilangan Rasulullah shallallahu 'alaihi wasallam, maka tersentuhlah beliau olehku di masjid, ternyata beliau sedang sujud dengan kedua telapak kakinya yang tegak ke atas, dan beliau mengucapkan; \"A'uudzu biridlaaka min sukhtika wa a'uudzu bi mu'aafatika min 'uquubatika wa a'uudzubika minka laa uhshii tsanaa'a 'alaika anta kamaa atsnaita 'alaa nafsika (Aku berlindung dengan keridlaan-Mu dari murka-Mu, aku berlindung dengan ampunan-Mu dari siksa-Mu, aku berlindung kepada-Mu dari pada-Mu, tidaklah terhitung puji-pujianku kepada-Mu, engkau adalah Dzat sebagaimana di pujikan oleh diri-Mu sendiri).\""
            },
            {
                "number": 733,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا بَقِيَّةُ حَدَّثَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ أَنَّ عَائِشَةَ أَخْبَرَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو فِي صَلَاتِهِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْمَأْثَمِ وَالْمَغْرَمِ فَقَالَ لَهُ قَائِلٌ مَا أَكْثَرَ مَا تَسْتَعِيذُ مِنْ الْمَغْرَمِ فَقَالَ إِنَّ الرَّجُلَ إِذَا غَرِمَ حَدَّثَ فَكَذَبَ وَوَعَدَ فَأَخْلَفَ",
                "id": "Telah menceritakan kepada kami ['Amru bin Utsman] telah menceritakan kepada kami [Baqiyah] telah menceritakan kepada kami [Syu'aib] dari [Az Zuhri] dari ['Urwah] bahwa [Aisyah] telah mengabarkan kepadanya bahwa dalam sholatnya, Rasulullah shallallahu 'alaihi wasallam sering berdo'a; \"Allahumma inni 'auudzubika min 'adzaabil qabri wa a'uudzubika min fitnatil masiihid dajjal wa a'uudzubika min fitnatil mahya wal mamaati, allahumma inni a'uudzubika minal ma`tsmi wal maghrami (Ya Allah, aku berlindung kepada-Mu dari siksa kubur, aku berlindung dari fitnah Dajjal, aku berlindung kepada-Mu dari fitnah kehidupan dan kematian, ya Allah aku berlindung kepada-Mu dari perbuatan dosa dan lilitan hutang).\" Maka seseorang bertanya kepada beliau; 'alangkah seringnya anda memohon perlindungan diri dari lilitan hutang.\" Beliau bersabda: \"Sesungguhnya apabila seseorang sudah sering berhutang, maka dia akan berbicara dan berbohong, dan apabila berjanji, maka dia akan mengingkari.\""
            },
            {
                "number": 734,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ ابْنِ أَبِي لَيْلَى عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِيهِ قَالَصَلَّيْتُ إِلَى جَنْبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ تَطَوُّعٍ فَسَمِعْتُهُ يَقُولُ أَعُوذُ بِاللَّهِ مِنْ النَّارِ وَيْلٌ لِأَهْلِ النَّارِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdullah bin Daud] dari [Ibnu Abu Laila] dari [Tsabit Al Banani] dari [Abdurrahman bin Abu Laila] dari [ayahnya] dia berkata; \"Aku sholat sunnah di samping Rasulullah shallallahu 'alaihi wasallam, dan terdengar olehku beliau memohon perlindungan kepada Allah dari api neraka dan kesengsaraan penduduk Neraka.\""
            },
            {
                "number": 735,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ قَالَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الصَّلَاةِ وَقُمْنَا مَعَهُ فَقَالَ أَعْرَابِيٌّ فِي الصَّلَاةِ اللَّهُمَّ ارْحَمْنِي وَمُحَمَّدًا وَلَا تَرْحَمْ مَعَنَا أَحَدًا فَلَمَّا سَلَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْأَعْرَابِيِّ لَقَدْ تَحَجَّرْتَ وَاسِعًا يُرِيدُ رَحْمَةَ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Abdullah bin Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Abu Salamah bin Abdurrahman] bahwa [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam berdiri untuk mengerjakan sholat, lantas kami pun berdiri bersama beliau, tiba-tiba seorang arab badui berkata dalam sholatnya; \"Allahummar hamnii wa muhammadan walaa tarham ma'adaa ahadan (Ya Allah, rahmatilah aku dan Muhammad dan janganlah Engkau merahmati seorang pun yang bersama kami).\" Setelah Rasulullah shallallahu 'alaihi wasallam salam, beliau bersabda kepada arab badui tersebut: 'Kamu telah mempersempit sesuatu yang luas.\" Maksud beliau adalah rahmat Allah Azza Wa Jalla.\""
            }
        ]
    }
}