{
    "status": true,
    "data": {
        "start": 2794,
        "end": 2940,
        "total": 147,
        "book": "abu-daud",
        "hadits": [
            {
                "number": 2794,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يُهَادَى بَيْنَ ابْنَيْهِ فَسَأَلَ عَنْهُ فَقَالُوا نَذَرَ أَنْ يَمْشِيَ فَقَالَ إِنَّ اللَّهَ لَغَنِيٌّ عَنْ تَعْذِيبِ هَذَا نَفْسَهُ وَأَمَرَهُ أَنْ يَرْكَبَقَالَ أَبُو دَاوُد رَوَاهُ عَمْرُو بْنُ أَبِي عَمْرٍو عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yahya] dari [Humaid Ath Thawil] dari [Tsabit Al Bunani] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam melihat seorang laki-laki yang dipapah daintara dua orang anaknya. Kemudian beliau bertanya mengenainya, lalu mereka berkata; ia telah bernadzar untuk berjalan. Kemudian beliau berkata: \"Sesungguhnya Allah tidak butuh penyiksaan orang ini terhadap dirinya.\" Dan beliau memerintahkannya agar berkendaraan. Abu Daud berkata; dan hadits tersebut diriwayatkan oleh ['Amr bin Abu 'Amr], dari [Al A'raj], dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam seperti itu. "
            },
            {
                "number": 2795,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ السُّلَمِيُّ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنِي إِبْرَاهِيمُ يَعْنِي ابْنَ طَهْمَانَ عَنْ مَطَرٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ أُخْتَ عُقْبَةَ بْنِ عَامِرٍ نَذَرَتْ أَنْ تَحُجَّ مَاشِيَةً وَأَنَّهَا لَا تُطِيقُ ذَلِكَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ لَغَنِيٌّ عَنْ مَشْيِ أُخْتِكَ فَلْتَرْكَبْ وَلْتُهْدِ بَدَنَةً",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hafsh bin Abdullah As Sulami], ia berkata; telah menceritakan kepadaku [ayahku], ia berkata; telah menceritakan kepadaku [Ibrahim bin Thahman] dari [Mathar] dari [Ikrimah] dari [Ibnu Abbas], bahwa saudari 'Uqbah bin 'Amir telah bernadzar untuk berhaji dengan berjalan kaki, dan ia tidak mampu melakukan hal tersebut. Kemudian Nabi shallallahu 'alaihi wasallam berkata: \"Sesungguhnya Allah tidak butuh kepada jalannya saudarimu, hendaknya ia berkendaraan dan menyembelih kurban.\""
            },
            {
                "number": 2796,
                "arab": "حَدَّثَنَا شُعَيْبُ بْنُ أَيُّوبَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ عَنْ سُفْيَانَ عَنْ أَبِيهِ عَنْ عِكْرِمَةَ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّأَنَّهُ قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أُخْتِي نَذَرَتْ أَنْ تَمْشِيَ إِلَى الْبَيْتِ فَقَالَ إِنَّ اللَّهَ لَا يَصْنَعُ بِمَشْيِ أُخْتِكَ إِلَى الْبَيْتِ شَيْئًا",
                "id": "Telah menceritakan kepada kami [Syu'aib bin Ayyub], telah menceritakan kepada kami [Mu'awiya bin Hisyam] dari [Sufyan] dari [ayahnya], dari [Ikrimah] dari ['Uqbah bin 'Amir Al Juhani] bahwa ia berkata kepada Nabi shallallahu 'alaihi wasallam; sesungguhnya saudariku bernadzar untuk berjalan menuju Ka'bah. Kemudian beliau berkata: \"Sesungguhnya Allah tidak berbuat sesuatu dengan berjalannya saudarimu ke Ka'bah.\""
            },
            {
                "number": 2797,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا حَبِيبٌ الْمُعَلِّمُ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَجُلًا قَامَ يَوْمَ الْفَتْحِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ لِلَّهِ إِنْ فَتَحَ اللَّهُ عَلَيْكَ مَكَّةَ أَنْ أُصَلِّيَ فِي بَيْتِ الْمَقْدِسِ رَكْعَتَيْنِ قَالَ صَلِّ هَاهُنَا ثُمَّ أَعَادَ عَلَيْهِ فَقَالَ صَلِّ هَاهُنَا ثُمَّ أَعَادَ عَلَيْهِ فَقَالَ شَأْنُكَ إِذَنْقَالَ أَبُو دَاوُد رُوِيَ نَحْوُهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا أَبُو عَاصِمٍ ح و حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ الْمَعْنَى حَدَّثَنَا رَوْحٌ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي يُوسُفُ بْنُ الْحَكَمِ بْنِ أَبِي سُفْيَانَ أَنَّهُ سَمِعَ حَفْصَ بْنَ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَعَمْرًو وَقَالَ عَبَّاسٌ ابْنُ حَنَّةَ أَخْبَرَاهُ عَنْ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ رِجَالٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْخَبَرِ زَادَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي بَعَثَ مُحَمَّدًا بِالْحَقِّ لَوْ صَلَّيْتَ هَاهُنَا لَأَجْزَأَ عَنْكَ صَلَاةً فِي بَيْتِ الْمَقْدِسِ قَالَ أَبُو دَاوُد رَوَاهُ الْأَنْصَارِيُّ عَنْ ابْنِ جُرَيْجٍ فَقَالَ جَعْفَرُ بْنُ عُمَرَ وَقَالَ عَمْرُو بْنُ حَيَّةَ وَقَالَ أَخْبَرَاهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَعْن رِجَالٌ مَنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] telah mengabarkan kepada kami [Habib Al Mu'allim] dari ['Atha` bin Abu Rabah] dari [Jabir bin Abdullah] bahwa seseorang berdiri pada saat penaklukan Mekkah, kemudian berkata; wahai Rasulullah, sesungguhnya saya telah bernadzar untuk Allah, seandainya Allah menaklukkan Mekkah melalui anda maka saya akan melakukan sholat di Baitul Maqdis sebanyak dua raka'at. Beliau bersabda: \"sholatlah di sini!\" Kemudian ia mengulang perkataannya kepada beliau. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"sholatlah di sini!\" Kemudian ia mengulang perkataan kepada beliau. Maka beliau berkata: \"Terserah engkau, jika demikian.\" Abu Daud berkata; telah diriwayatkan seperti itu dari [Abdurrahman bin 'Auf] dari Nabi shallallahu 'alaihi wasallam. telah menceritakan kepada kami [Makhlad bin Khalid] telah menceritakan kepada kami [Abu 'Ashim]. Dan telah menceritakan kepada kami [Abbas Al 'Anbary] secara makna, telah menceritakan kepada kami [Rauh] dari [Ibnu Juraij] telah mengabarkan kepadaku [Yusuf bin Al Hakam bin Abu Sufyan] bahwasanya dia telah mendengar [Hafash bin Umar bin Abdurrahman bin Auf] dan [Amru], dan berkata Abbas bin Hannah, keduanya telah mengabarkan kepadanya dari [Umar bin Abdurrahman bin 'Auf] dari [seseorang dari sahabat Nabi shallallahu 'alaihi wasallam] dengan hadits ini. Ia menambahkan; kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang telah mengutus Muhammad dengan kebenaran. Seandainya engkau melakukan sholat di sini niscaya hal tersebut mencukupkan bagimu sholat dari melakukan sholat di Baitul Maqdis.\" Abu Daud berkata; hadits tersebut diriwayatkan oleh [Al Anshari] dari [Ibnu Juraij], [Ja'far bin Umar] berkata; dan ['Amr bin Hayyah] berkata; dan ia telah mengatakan; mereka berdua mengabarkan kepadanya dari [Abdurrahman bin 'Auf] dan dari [seseorang dari sahabat Nabi shallallahu 'alaihi wasallam]. "
            },
            {
                "number": 2798,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍأَنَّ سَعْدَ بْنَ عُبَادَةَ اسْتَفْتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أُمِّي مَاتَتْ وَعَلَيْهَا نَذْرٌ لَمْ تَقْضِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْضِهِ عَنْهَا",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] ia berkata; aku membacakan riwayat kepada [Malik] dari [Ibnu Syihab] dari ['ubaidhullah bin Abdullah] dari [Abdullah bin Abbas], bahwa Sa'd bin 'Ubadah telah meminta fatwa kepada Rasulullah shallallahu 'alaihi wasallam, ia berkata; sesungguhnya ibuku telah meninggal, dan ia memiliki tanggungan nadzar yang belum beliau tunaikan. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Tunaikan nadzar tersebut untuknya!\""
            },
            {
                "number": 2799,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا هُشَيْمٌ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ امْرَأَةً رَكِبَتْ الْبَحْرَ فَنَذَرَتْ إِنْ نَجَّاهَا اللَّهُ أَنْ تَصُومَ شَهْرًا فَنَجَّاهَا اللَّهُ فَلَمْ تَصُمْ حَتَّى مَاتَتْ فَجَاءَتْ ابْنَتُهَا أَوْ أُخْتُهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهَا أَنْ تَصُومَ عَنْهَاحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ بُرَيْدَةَ أَنَّ امْرَأَةً أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ كُنْتُ تَصَدَّقْتُ عَلَى أُمِّي بِوَلِيدَةٍ وَإِنَّهَا مَاتَتْ وَتَرَكَتْ تِلْكَ الْوَلِيدَةَ قَالَ قَدْ وَجَبَ أَجْرُكِ وَرَجَعَتْ إِلَيْكِ فِي الْمِيرَاثِ قَالَتْ وَإِنَّهَا مَاتَتْ وَعَلَيْهَا صَوْمُ شَهْرٍ فَذَكَرَ نَحْوَ حَدِيثِ عَمْرٍو",
                "id": "Telah menceritakan kepada kami ['Amr bin 'Aun] telah mengabarkan kepada kami [Husyaim] dari [Abu Bisyr] dari [Sa'id bin Jubair] dari [Ibnu Abbas] bahwa seorang wanita mengarungi bahtera, kemudian ia bernadzar seandainya Allah menyelamatkannya maka ia akan berpuasa satu bulan. Kemudian Allah menyelamatkannya dan ia tidak berpuasa hingga ia meninggal. Lalu anak wanitanya atau saudara wanitanya datang kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau memerintahkannya agar berpuasa untuknya. Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair], telah menceritakan kepada kami [Abdullah bin 'Atho`] dari [Abdullah bin Buraidah] dari [ayahnya] bahwa seorang wanita datang kepada Rasulullah shallallahu 'alaihi wasallam dan berkata; dahulu aku pernah mensedekahkan budak wanita kepada ibuku, dan ia meninggal dalam keadaan memiliki tanggungan puasa satu bulan. Kemudian Buraidah menyebutkan hadits 'Amr tersebut. "
            },
            {
                "number": 2800,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى قَالَ سَمِعْتُ الْأَعْمَشَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ الْمَعْنَى عَنْ مُسْلِمٍ الْبَطِينِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍأَنَّ امْرَأَةً جَاءَتْ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنَّهُ كَانَ عَلَى أُمِّهَا صَوْمُ شَهْرٍ أَفَأَقْضِيهِ عَنْهَا فَقَالَ لَوْ كَانَ عَلَى أُمِّكِ دَيْنٌ أَكُنْتِ قَاضِيَتَهُ قَالَتْ نَعَمْ قَالَ فَدَيْنُ اللَّهِ أَحَقُّ أَنْ يُقْضَى",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] ia berkata; saya mendengar [Al A'masy].. dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Muhammad bin Al 'Ala`], telah menceritakan kepada kami [Abu Mu'awiyah] dan [Al A'masy] secara makna, dari [Muslim Al Bathin] dari [Sa'id bin Jubair], dari [Ibnu Abbas] bahwa seorang wanita telah datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; sesungguhnya ibuku memiliki tanggungan puasa satu bulan. Apakah boleh saya menunaikan puasa tersebut untuknya? Kemudian beliau berkata: \"Seandainya ibumu memiliki tanggungan hutang apakah engkau akan menunaikannya?\" Ia berkata; ya. Beliau berkata: \"Maka hutang Allah lebih berhak untuk ditunaikan.\""
            },
            {
                "number": 2801,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ مَاتَ وَعَلَيْهِ صِيَامٌ صَامَ عَنْهُ وَلِيُّهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Ibnu Wahb], telah mengabarkan kepadaku ['Amr bin Al Harits] dari ['ubaidhullah bin Abu Ja'far] dari [Muhammad bin Ja'far bin Az Zubair] dari ['Urwah] dari [Aisyah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang meninggal dalam keadaan memiliki tanggungan puasa, maka walinya berpuasa (sebagai pengganti) untuknya.\""
            },
            {
                "number": 2802,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا الْحَارِثُ بْنُ عُبَيْدٍ أَبُو قُدَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ الْأَخْنَسِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ امْرَأَةً أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ أَنْ أَضْرِبَ عَلَى رَأْسِكَ بِالدُّفِّ قَالَ أَوْفِي بِنَذْرِكِ قَالَتْ إِنِّي نَذَرْتُ أَنْ أَذْبَحَ بِمَكَانِ كَذَا وَكَذَا مَكَانٌ كَانَ يَذْبَحُ فِيهِ أَهْلُ الْجَاهِلِيَّةِ قَالَ لِصَنَمٍ قَالَتْ لَا قَالَ لِوَثَنٍ قَالَتْ لَا قَالَ أَوْفِي بِنَذْرِكِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Al Harits bin 'Ubaid Abu Qudamah] dari ['ubaidhullah bin Al Akhnas] dari ['Amr bin Syu'aib] dari [ayahnya] dari [kakeknya] bahwa seorang wanita telah datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; wahai Rasulullah, sesungguhnya saya telah bernadzar untuk memukul rebana di hadapan anda. Beliau berkata: \"Penuhi nadzarmu!\" Ia berkata; sesungguhnya saya bernadzar untuk menyembelih di tempat ini dan ini. Yaitu tempat yang dahulu orang-orang Jahiliyah menyembelih padanya. Beliau berkata: \"Untuk patung?\" Ia berkata; tidak. Beliau berkata: \"Untuk berhala?\" Ia berkata; tidak. Beliau berkata: \"Penuhi nadzarmu!\""
            },
            {
                "number": 2803,
                "arab": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَقَ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي أَبُو قِلَابَةَ قَالَ حَدَّثَنِي ثَابِتُ بْنُ الضَّحَّاكِ قَالَنَذَرَ رَجُلٌ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْحَرَ إِبِلًا بِبُوَانَةَ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي نَذَرْتُ أَنْ أَنْحَرَ إِبِلًا بِبُوَانَةَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ كَانَ فِيهَا وَثَنٌ مِنْ أَوْثَانِ الْجَاهِلِيَّةِ يُعْبَدُ قَالُوا لَا قَالَ هَلْ كَانَ فِيهَا عِيدٌ مِنْ أَعْيَادِهِمْ قَالُوا لَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْفِ بِنَذْرِكَ فَإِنَّهُ لَا وَفَاءَ لِنَذْرٍ فِي مَعْصِيَةِ اللَّهِ وَلَا فِيمَا لَا يَمْلِكُ ابْنُ آدَمَ",
                "id": "Telah menceritakan kepada kami [Abu Daud bin Rusyid] telah menceritakan kepada kami [Syu'aib bin Ishaq] dari [Al Auza'i] dari [Yahya bin Abu Katsir] ia berkata; [Abu Qilabah] ia berkata; telah menceritakan kepadaku [Tsabit bin Adh Dhahhak] ia berkata; seorang laki-laki bernadzar pada zaman Rasulullah shallallahu 'alaihi wasallam untuk menyembelih unta di Buwanah. Kemudian ia datang kepada Nabi shallallahu 'alaihi wasallam dan berkata; sesungguhnya saya telah bernadzar untuk menyembelih unta di Buwanah. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Apakah padanya terdapat berhala diantara berhala-berhala jahiliyah yang disembah?\" Mereka berkata; tidak. Beliau berkata: \"Apakah padanya terdapat hari besar diantara hari-hari besar mereka?\" Mereka berkata; tidak. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penuhi nadzarmu, sesungguhnya tidak boleh memenuhi nadzar dalam bermaksiat kepada Allah, dalam perkara yang tidak dimiliki anak Adam.\""
            },
            {
                "number": 2804,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ بْنِ مِقْسَمٍ الثَّقَفِيُّ مِنْ أَهْلِ الطَّائِفِ قَالَ حَدَّثَتْنِي سَارَّةُ بِنْتُ مِقْسَمٍ الثَّقَفِيِّ أَنَّهَا سَمِعَتْ مَيْمُونَةَ بِنْتَ كَرْدَمٍ قَالَتْخَرَجْتُ مَعَ أَبِي فِي حِجَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَمِعْتُ النَّاسَ يَقُولُونَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلْتُ أُبِدُّهُ بَصَرِي فَدَنَا إِلَيْهِ أَبِي وَهُوَ عَلَى نَاقَةٍ لَهُ مَعَهُ دِرَّةٌ كَدِرَّةِ الْكُتَّابِ فَسَمِعْتُ الْأَعْرَابَ وَالنَّاسَ يَقُولُونَ الطَّبْطَبِيَّةَ الطَّبْطَبِيَّةَ فَدَنَا إِلَيْهِ أَبِي فَأَخَذَ بِقَدَمِهِ قَالَتْ فَأَقَرَّ لَهُ وَوَقَفَ فَاسْتَمَعَ مِنْهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ إِنْ وُلِدَ لِي وَلَدٌ ذَكَرٌ أَنْ أَنْحَرَ عَلَى رَأْسِ بُوَانَةَ فِي عَقَبَةٍ مِنْ الثَّنَايَا عِدَّةً مِنْ الْغَنَمِ قَالَ لَا أَعْلَمُ إِلَّا أَنَّهَا قَالَتْ خَمْسِينَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ بِهَا مِنْ الْأَوْثَانِ شَيْءٌ قَالَ لَا قَالَ فَأَوْفِ بِمَا نَذَرْتَ بِهِ لِلَّهِ قَالَتْ فَجَمَعَهَا فَجَعَلَ يَذْبَحُهَا فَانْفَلَتَتْ مِنْهَا شَاةٌ فَطَلَبَهَا وَهُوَ يَقُولُ اللَّهُمَّ أَوْفِ عَنِّي نَذْرِي فَظَفِرَهَا فَذَبَحَهَاحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ مَيْمُونَةَ بِنْتِ كَرْدَمِ بْنِ سُفْيَانَ عَنْ أَبِيهَا نَحْوَهُ مُخْتَصَرٌ مِنْهُ شَيْءٌ قَالَ هَلْ بِهَا وَثَنٌ أَوْ عِيدٌ مِنْ أَعْيَادِ الْجَاهِلِيَّةِ قَالَ لَا قُلْتُ إِنَّ أُمِّي هَذِهِ عَلَيْهَا نَذْرٌ وَمَشْيٌ أَفَأَقْضِيهِ عَنْهَا وَرُبَّمَا قَالَ ابْنُ بَشَّارٍ أَنَقْضِيهِ عَنْهَا قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Yazid? bin Harun], telah menceritakan kepada kami [Abdullah bin Yazid? bin Miqsam Ats Tsaqafi] dari penduduk Thaif, ia berkata; telah menceritakan kepadaku [Sarrah binti Miqsam Ats Tsaqafi] bahwa ia telah mendengar [Maimunah binti Kardam], ia berkata; aku pernah keluar bersama ayahku ketika Rasulullah shallallahu 'alaihi wasallam melakukan haji, kemudian aku melihat Rasulullah shallallahu 'alaihi wasallam dan aku mendengar orang-orang berkata; Rasulullah shallallahu 'alaihi wasallam. Lalu aku memandangnya dengan tajam, kemudian ayahku mendekat kepada beliau sementera beliau berada di atas untanya. Kemudian beliau berhenti dan mendengar darinya dengan membawa cambuk seperti cambuk orang mengajar anak-anak. Kemudian aku mendengar orang-orang dan orang-orang badui berkata; jangan bersuara! Jangan bersuara! Jangan bersuara! Kemudian ayahku mendekat kepada beliau, mengambil posisi di hadapan beliau, dan mengakui risalah serta kenabian beliau dan beliau berhenti serta mendengarkan darinya. Kemudian ia berkata; wahai Rasulullah, sesungguhnya aku telah bernadzar, apabila anakku terlahirkan laki-laki maka aku akan menyembelih di puncak Buwanah beberapa ekor kambing. Yazid? bin Miqsam mengatakan; yang aku ketahui hanya ia mengatakan; lima ekor. Kemudian Rasulullah shallallahu 'alaihi wasallam bertanya: \"Apakah padanya terdapat sebagian berhala?\" Ia berkata; tidak. Beliau bersabda: \"Penuhilah apa yang engkau nadzarkan untuk Allah!\" Maimunah binti Kardam berkata; kemudian ia mengumpulkan kambing-kambing tersebut dan menyembelihnya. Lalu terdapat satu ekor kambing yang kabur. Lalu ia mencarinya dan berdo'a; ya Allah, penuhkanlah nadzarku. Lalu ia mendapatkan kambing tersebut lalu menyembelihnya. Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Abu Bakr Al Hanafi], telah menceritakan kepada kami [Abdul Hamid bin Ja'far] dari ['Amr bin Syu'aib], dari [Maimunah binti Kardam bin Sufyan] dari [ayahnya] seperti itu secara ringkas. Beliau bersabda: \"Apakah padanya terdapat berhala, atau hari besar jahiliyah?\" Ia berkata; tidak. aku katakan; sesungguhnya ibuku memiliki tanggungan nadzar dan berjalan. Apakah aku boleh menunaikan untuknya? Dan Ibnu Basysyar berkata; apakah aku boleh menunaikannya? Beliau berkata: \"Ya.\""
            },
            {
                "number": 2805,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ عِيسَى قَالَا حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَكَانَتْ الْعَضْبَاءُ لِرَجُلٍ مِنْ بَنِي عُقَيْلٍ وَكَانَتْ مِنْ سَوَابِقِ الْحَاجِّ قَالَ فَأُسِرَ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي وَثَاقٍ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى حِمَارٍ عَلَيْهِ قَطِيفَةٌ فَقَالَ يَا مُحَمَّدُ عَلَامَ تَأْخُذُنِي وَتَأْخُذُ سَابِقَةَ الْحَاجِّ قَالَ نَأْخُذُكَ بِجَرِيرَةِ حُلَفَائِكَ ثَقِيفَ قَالَ وَكَانَ ثَقِيفُ قَدْ أَسَرُوا رَجُلَيْنِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَقَدْ قَالَ فِيمَا قَالَ وَأَنَا مُسْلِمٌ أَوْ قَالَ وَقَدْ أَسْلَمْتُ فَلَمَّا مَضَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو دَاوُد فَهِمْتُ هَذَا مِنْ مُحَمَّدِ بْنِ عِيسَى نَادَاهُ يَا مُحَمَّدُ يَا مُحَمَّدُ قَالَ وَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَحِيمًا رَفِيقًا فَرَجَعَ إِلَيْهِ فَقَالَ مَا شَأْنُكَ قَالَ إِنِّي مُسْلِمٌ قَالَ لَوْ قُلْتَهَا وَأَنْتَ تَمْلِكُ أَمْرَكَ أَفْلَحْتَ كُلَّ الْفَلَاحِ قَالَ أَبُو دَاوُد ثُمَّ رَجَعْتُ إِلَى حَدِيثِ سُلَيْمَانَ قَالَ يَا مُحَمَّدُ إِنِّي جَائِعٌ فَأَطْعِمْنِي إِنِّي ظَمْآنٌ فَاسْقِنِي قَالَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذِهِ حَاجَتُكَ أَوْ قَالَ هَذِهِ حَاجَتُهُ فَفُودِيَ الرَّجُلُ بَعْدُ بِالرَّجُلَيْنِ قَالَ وَحَبَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَضْبَاءَ لِرَحْلِهِ قَالَ فَأَغَارَ الْمُشْرِكُونَ عَلَى سَرْحِ الْمَدِينَةِ فَذَهَبُوا بِالْعَضْبَاءِ قَالَ فَلَمَّا ذَهَبُوا بِهَا وَأَسَرُوا امْرَأَةً مِنْ الْمُسْلِمِينَ قَالَ فَكَانُوا إِذَا كَانَ اللَّيْلُ يُرِيحُونَ إِبِلَهُمْ فِي أَفْنِيَتِهِمْ قَالَ فَنُوِّمُوا لَيْلَةً وَقَامَتْ الْمَرْأَةُ فَجَعَلَتْ لَا تَضَعُ يَدَهَا عَلَى بَعِيرٍ إِلَّا رَغَا حَتَّى أَتَتْ عَلَى الْعَضْبَاءِ قَالَ فَأَتَتْ عَلَى نَاقَةٍ ذَلُولٍ مُجَرَّسَةٍ قَالَ فَرَكِبَتْهَا ثُمَّ جَعَلَتْ لِلَّهِ عَلَيْهَا إِنْ نَجَّاهَا اللَّهُ لَتَنْحَرَنَّهَا قَالَ فَلَمَّا قَدِمَتْ الْمَدِينَةَ عُرِفَتْ النَّاقَةُ نَاقَةُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأُخْبِرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذَلِكَ فَأَرْسَلَ إِلَيْهَا فَجِيءَ بِهَا وَأُخْبِرَ بِنَذْرِهَا فَقَالَ بِئْسَ مَا جَزَيْتِيهَا أَوْ جَزَتْهَا إِنْ اللَّهُ أَنْجَاهَا عَلَيْهَا لَتَنْحَرَنَّهَا لَا وَفَاءَ لِنَذْرٍ فِي مَعْصِيَةِ اللَّهِ وَلَا فِيمَا لَا يَمْلِكُ ابْنُ آدَمَقَالَ أَبُو دَاوُد وَالْمَرْأَةُ هَذِهِ امْرَأَةُ أَبِي ذَرٍّ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] dan [Muhammad bin Isa], mereka berkata; telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Abu Qilabah] dari [Abu Al Muhallab] dari [Imran bin Hushain], ia berkata; dahulu 'Adhba` (unta Rasulullah shallallahu 'alaihi wasallam) dahulu adalah milik seorang laki-laki dari Bani 'Uqail, unta tersebut termasuk unta yang mendahului orang yang berhaji. kemudian ia ditawan, kemudian Rasulullah shallallahu 'alaihi wasallam mendatanginya sementara orang tersebut terikat. Beliau berada di atas untanya mengenakan selimut. Lalu ia berkata; wahai Muhammad, kenapa engkau menangkapku dan mengambil unta yang mendahului orang yang berhaji (yaitu Al 'Adhba`)? Beliau berkata: \"Kami menangkapmu karena kesalahan sekutumu yaitu Tsaqif.\" Tsaqif telah menawan dua orang sahabat Nabi shallallahu 'alaihi wasallam. ia bekata; sungguh beliau telah mengucapakan apa yang beliau ucapkan sementara aku adalah seorang muslim. Atau ia mengatakan; telah masuk Islam. Kemudian tatkala Nabi shallallahu 'alaihi wasallam telah pergi…… Abu Daud berkata; aku mengetahui hal ini dari Muhammad bin Isa. Ia memanggil; wahai Muhammad! Wahai Muhammad! Dan Rasulullah shallallahu 'alaihi wasallam adalah orang yang penyayang dan lembut. Kemudian beliau kembali kepadanya dan berkata; ada apa denganmu? Ia berkata; aku adalah seorang muslim. Beliau berkata; \"Jika engkau mengatakan demikian sementara engkau memiliki urusanmu maka engkau sangat beruntung.\" Abu Daud berkata; kemudian aku kembali kepada hadits Sulaiman, ia berkata; wahai Muhammad, aku lapar maka berilah aku makan, dan aku haus, maka berilah aku minum. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ini adalah hajatmu.\" Kemudian orang tersebut ditebus setelah itu dengan dua orang laki-laki. Ia berkata; dan Rasulullah shallallahu 'alaihi wasallam menahan Al 'Adhba` untuk kendaraan beliau. Kemudian orang-orang musyrik menyerang serambi Madinah dengan tiba-tiba dan membawa Al 'Adhba`. Ia berkata; kemudian tatkala mereka telah pergi membawanya dan menawan seorang wanita, ia berkata; apabila malam hari mereka mengistirahatkan unta mereka di halaman mereka. Ia berkata; kemudian suatu makam mereka tertidur, dan wanita tersebut berdiri dan tidaklah ia meletakkan kedua tangannya di atas unta melainkan unta tersebut bersuara hingga ia datang kepada Al 'Adhba`. Ia berkata; kemudian ia mendatangi unta yang menurut dan telah teruji, kemudian ia menungganginya dan bernadzar seandainya Allah menyelamatkannya niscaya ia akan menyembelihnya. Imran berkata; kemudian di saat ia telah sampai maka unta tersebut dikenali yaitu unta Rasulullah shallallahu 'alaihi wasallam. Kemudian Nabi shallallahu 'alaihi wasallam diberitahu mengenai hal tersebut. Lalu beliau mengirim utusan kepada wanita tersebut dan iapun dihadapkan, dan beliau diberitahu mengenai nadzarnya. Kemudian beliau berkata: \"Sungguh buruk balasan yang engkau berikan.\" Atau \"yang diberikan wanita tersebut apabila Allah menyelamatkannya niscaya ia akan menyembelihnya. Tidak boleh menunaikan nadzar dalam berbuat kemaksiatan kepada Allah, dan dalam perkara yang tidak dimiliki anak Adam.\" Abu Dzar berkata; dan wanita ini adalah isteri Abu Dzar. "
            },
            {
                "number": 2806,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ وَابْنُ السَّرْحِ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ قَالَ قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ وَكَانَ قَائِدَ كَعْبٍ مِنْ بَنِيهِ حِينَ عَمِيَ عَنْ كَعْبِ بْنِ مَالِكٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ مِنْ تَوْبَتِي أَنْ أَنْخَلِعَ مِنْ مَالِي صَدَقَةً إِلَى اللَّهِ وَإِلَى رَسُولِهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْسِكْ عَلَيْكَ بَعْضَ مَالِكَ فَهُوَ خَيْرٌ لَكَ قَالَ فَقُلْتُ إِنِّي أُمْسِكُ سَهْمِيَ الَّذِي بِخَيْبَرَحَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ أَنَّهُ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تِيبَ عَلَيْهِ إِنِّي أَنْخَلِعُ مِنْ مَالِي فَذَكَرَ نَحْوَهُ إِلَى خَيْرٌ لَكَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Daud], dan [Ibnu As Sarh] mereka berdua berkata; telah menceritakan kepada kami [Ibnu Wahb], telah mengabarkan kepadaku [Yunus] ia berkata; [Ibnu Syihab] berkata; telah mengabarkan kepadaku [Abdurrahman bin Abdullah bin Ka'b bin Malik] bahwa [Abdullah bin Ka'b] -dan ia adalah penuntun Ka'b ketika Ka'b mengalami buta mata. Dari [Ka'b] ia berkata; aku katakan; wahai Rasulullah, sesungguhnya diantara taubatku adalah melepaskan sebagian hartaku sebagai sedekah kepada Allah dan kepada rasulNya. Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tahanlah sebagian hartamu, hal itu lebih baik bagimu!\" Maka aku katakan; sesungguhnya saya telah menahan saham saya yang ada di Khaibar. Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Abdullah bin Ka'b bin Malik], dari [ayahnya] bahwa ia berkata kepada Rasulullah shallallahu 'alaihi wasallam ketika diterima taubatnya; sesungguhnya saya melepaskan sebagian dari hartaku …… kemudian ia menyebutkan seperti hadits tersebut hingga kata; lebih baik bagimu. "
            },
            {
                "number": 2807,
                "arab": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ ابْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِأَنَّهُ قَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ أَبُو لُبَابَةَ أَوْ مَنْ شَاءَ اللَّهُ إِنَّ مِنْ تَوْبَتِي أَنْ أَهْجُرَ دَارَ قَوْمِي الَّتِي أَصَبْتُ فِيهَا الذَّنْبَ وَأَنْ أَنْخَلِعَ مِنْ مَالِي كُلِّهِ صَدَقَةً قَالَ يُجْزِئُ عَنْكَ الثُّلُثُحَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنِي مَعْمَرٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي ابْنُ كَعْبِ بْنِ مَالِكٍ قَالَ كَانَ أَبُو لُبَابَةَ فَذَكَرَ مَعْنَاهُ وَالْقِصَّةُ لِأَبِي لُبَابَةَ قَالَ أَبُو دَاوُد رَوَاهُ يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ بَعْضِ بَنِي السَّائِبِ ابْنِ أَبِي لُبَابَةَ وَرَوَاهُ الزُّبَيْدِيُّ عَنْ الزُّهْرِيِّ عَنْ حُسَيْنِ بْنِ السَّائِبِ بْنِ أَبِي لُبَابَةَ مِثْلَهُ",
                "id": "Telah menceritakan kepadaku ['ubaidhullah bin Umar], telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari [Ibnu Ka'b bin Malik] dari [ayahnya] bahwa ia berkata kepada Nabi shallallahu 'alaihi wasallam, atau [Abu Lubabah] atau orang yang Allah kehendaki; sesungguhnya diantara bukti taubatku adalah aku tinggalkan negeri kaumku yang padanya aku melakukan dosa, dan melepas sebagian dari hartaku semua sebagai sedekah. Beliau bersabda: \"Cukup bagimu melepaskan sepertiga.\" Telah menceritakan kepada kami [Muhammad bin Al Mutawakkil] telah menceritakan kepada kami [Abdurrazzaq], ia berkata; telah mengabarkan kepadaku [Ma'mar] dari [Az Zuhri], ia berkata; telah mengabarkan kepadaku [Ibnu Ka'b bin Malik] ia berkata; [Abu Lubabah] ….. kemudian ia menyebutkan maknanya. Dan kisah mengenai Abu Lubabah dikatakan Abu Daud; telah diriwayatkan oleh [Yunus] dari [Ibnu Syihab], dari [sebagian Bani As Saib bin Abu Lubabah], dan telah diriwayatkan oleh [Az Zubaidi] dari [Az Zuhri] dari [Husain bin As Saib bin Abu Lubabah] seperti itu. "
            },
            {
                "number": 2808,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ حَدَّثَنَا ابْنُ إِدْرِيسَ قَالَ قَالَ ابْنُ إِسْحَقَ حَدَّثَنِي الزُّهْرِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ كَعْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ فِي قِصَّتِهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ مِنْ تَوْبَتِي إِلَى اللَّهِ أَنْ أَخْرُجَ مِنْ مَالِي كُلِّهِ إِلَى اللَّهِ وَإِلَى رَسُولِهِ صَدَقَةً قَالَ لَا قُلْتُ فَنِصْفُهُ قَالَ لَا قُلْتُ فَثُلُثُهُ قَالَ نَعَمْ قُلْتُ فَإِنِّي سَأُمْسِكُ سَهْمِي مِنْ خَيْبَرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya], telah menceritakan kepada kami [Hasan bin Ar Rabi'], telah menceritakan kepada kami [Ibnu Idris] ia berkata; [Ibnu Ishaq] beliau berkata: telah menceritakan kepadaku [Az Zuhri], dari [Abdurrahman bin Abdullah bin Ka'b] dari [ayahnya], dari [kakeknya] mengenai kisahnya, ia berkata; aku katakan; wahai Rasulullah, sesungguhnya diantara taubatku kepada Allah adalah keluar dari sebagian hartaku semua sebagai sedekah kepada Allah dan RasulNya. Beliau berkata: \"Tidak.\" Aku katakan; setengahnya. Beliau berkata: \"Tidak.\" Aku katakan; sepertiga. Beliau berkata: \"Ya.\" Aku katakan; aku akan menahan sahamku di Khaibar. "
            },
            {
                "number": 2809,
                "arab": "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ التِّنِّيسِيُّ عَنْ ابْنِ أَبِي فُدَيْكٍ قَالَ حَدَّثَنِي طَلْحَةُ بْنُ يَحْيَى الْأَنْصَارِيُّ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ نَذَرَ نَذْرًا لَمْ يُسَمِّهِ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ وَمَنْ نَذَرَ نَذْرًا فِي مَعْصِيَةٍ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ وَمَنْ نَذَرَ نَذْرًا لَا يُطِيقُهُ فَكَفَّارَتُهُ كَفَّارَةُ يَمِينٍ وَمَنْ نَذَرَ نَذْرًا أَطَاقَهُ فَلْيَفِ بِهِقَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ وَكِيعٌ وَغَيْرُهُ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي الْهِنْدِ أَوْقَفُوهُ عَلَى ابْنِ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [Ja'far bin Musafir At Tinnisi] dari [Ibnu Abu Fudaik], ia berkata; telah menceritakan kepadaku [Thalhah bin Yahya Al Anshari] dari [Abdullah bin Sa'id bin Abu Hindun], dari [Bukair bin Abdullah bin Al Asyajj] dari [Kuraib], dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang bernadzar dengan tidak menyebutkannya, maka kafarahnya adalah kafarah sumpah. Dan barangsiapa yang bernadzar dalam kemaksiatan maka kafarahnya adalah kafarah bersumpah, dan barangsiapa yang bernadzar sesuatu yang tidak ia mampu maka kafarahnya adalah kafarah puasa. Dan barangsiapa yang bernadzar sesuatu yang ia mampu; maka hendaknya ia memenuhinya.\" Abu Daud berkata; hadits ini diriwayatkan Waki' dan yang lainnya dari Abdullah bin Sa'id bin Abu Al Hind, mereka telah menganggapnya muquf pada Ibnu Abbas. "
            },
            {
                "number": 2810,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبَّادٍ الْأَزْدِيُّ حَدَّثَنَا أَبُو بَكْرٍ يَعْنِي ابْنَ عَيَّاشٍ عَنْ مُحَمَّدٍ مَوْلَى الْمُغِيرَةِ قَالَ حَدَّثَنِي كَعْبُ بْنُ عَلْقَمَةَ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَفَّارَةُ النَّذْرِ كَفَّارَةُ الْيَمِينِقَالَ أَبُو دَاوُد وَرَوَاهُ عَمْرُو بْنُ الْحَارِثِ عَنْ كَعْبِ بْنِ عَلْقَمَةَ عَنْ ابْنِ شِمَاسَةَ عَنْ عُقْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ أَنَّ سَعِيدَ بْنَ الْحَكَمِ حَدَّثَهُمْ أَخْبَرَنَا يَحْيَى يَعْنِي بْنَ أَيُّوبَ حَدَّثَنِي كَعْبُ بْنُ عَلْقَمَةَ أَنَّهُ سَمِعَ ابْنَ شِمَاسَةَ عَنْ أَبِي الْخَيْرِ عَنْ عُقْبَةَ بْنِ عَامِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Harun bin 'Abbad Al Azdi] telah menceritakan kepada kami [Abu Bakr bin 'Ayyasy] dari [Muhammad] mantan budak Al Mughirah, ia berkata; telah menceritakan kepadaku [Ka'bin bin 'Alqamah] dari [Abu Al Khair] dari ['Uqbah bin 'Amir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kafarah nadzar adalah kafarah sumpah.\" Abu Daud berkata; dan hadits tersebut telah diriwayatkan ['Amr bin Al Harits] dari [Ka'b bin 'Alqamah] dari [Ibnu Syimasah] dari ['Uqbah], telah menceritakan kepada kami [Muhammad bin 'Auf] bahwa [Sa'id bin Al Hakam] telah menceritakan kepada mereka; telah mengabarkan kepada kami [Yahya yaitu Ibnu Ayyub] telah menceritakan kepadaku [Ka'b bin 'Alqamah] bahwa ia mendengar [Ibnu Syimasah] dari [Abu Al Khair] dari ['Uqbah bin 'Amir] dari Nabi shallallahu 'alaihi wasallam seperti itu. "
            },
            {
                "number": 2811,
                "arab": "أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَ عَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ قَالَيَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ فِي الْجَاهِلِيَّةِ أَنْ أَعْتَكِفَ فِي الْمَسْجِدِ الْحَرَامِ لَيْلَةً فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْفِ بِنَذْرِكَ",
                "id": "[Ahmad bin Hanbal] telah menceritakan kepada kami [Yahya] dari ['ubaidhullah] telah menceritakan kepadaku [Nafi'] dari [Ibnu Umar], dari [Umar radliallahu 'anhu] bahwasanya dia berkata; wahai Rasulullah, sesungguhnya saya bernadzar pada masa jahiliyah untuk beri'tikaf di Masji Al Haram pada malam hari. Kemudian Nabi shallallahu 'alaihi wasallam berkata kepadanya: \"Penuhilah nadzarmu.\""
            },
            {
                "number": 2812,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي وَائِلٍ عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ قَالَكُنَّا فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نُسَمَّى السَّمَاسِرَةَ فَمَرَّ بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمَّانَا بِاسْمٍ هُوَ أَحْسَنُ مِنْهُ فَقَالَ يَا مَعْشَرَ التُّجَّارِ إِنَّ الْبَيْعَ يَحْضُرُهُ اللَّغْوُ وَالْحَلْفُ فَشُوبُوهُ بِالصَّدَقَةِحَدَّثَنَا الْحُسَيْنُ بْنُ عِيسَى الْبِسْطَامِيُّ وَحَامِدُ بْنُ يَحْيَى وَعَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ قَالُوا حَدَّثَنَا سُفْيَانُ عَنْ جَامِعِ بْنِ أَبِي رَاشِدٍ وَعَبْدِ الْمَلِكِ بْنِ أَعْيَنَ وَعَاصِمٌ عَنْ أَبِي وَائِلٍ عَنْ قَيْسِ بْنِ أَبِي غَرَزَةَ بِمَعْنَاهُ قَالَ يَحْضُرُهُ الْكَذِبُ وَالْحَلْفُ و قَالَ عَبْدُ اللَّهِ الزُّهْرِيُّ اللَّغْوُ وَالْكَذِبُ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Wail] dari [Qais bin Abu Gharazah], ia berkata; kami pada zaman Rasulullah shallallahu 'alaihi wasallam diberi nama para calo, kemudian Rasulullah shallallahu 'alaihi wasallam lewat di hadapan kami, dan menamai kami dengan nama yang lebih baik darinya. Beliau mengatakan: \"Wahai para pedagang, sesungguhnya dalam transksi jual beli itu diwarnai tindakan sia-sia dan pengucapan sumpah, maka bersihkanlah jual beli tersebut dengan bersedekah!\" telah menceritakan kepada kami [Al Husain bin Isa Al Bisthami], dan [Hamid bin Yahya], serta [Abdullah bin Muhammad Az Zuhri], mereka mengatakan; telah menceritakan kepada kami [Sufyan], dari [Jami' bin Abu Rasyid], [Abdul Malik bin A'yan] dan ['Ashim] dari [Abu Wail] dari [Qais bin Abu Gharazah] dengan makna hadits tersebut, ia berkata; dihadiri ucapan dusta dan sumpah. Abdullah Az Zuhri mengatakan; perbuatan sia-sia dan ucapan dusta. "
            },
            {
                "number": 2813,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ عَمْرٍو يَعْنِي ابْنَ أَبِي عَمْرٍو عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَجُلًا لَزِمَ غَرِيمًا لَهُ بِعَشَرَةِ دَنَانِيرَ فَقَالَ وَاللَّهِ لَا أُفَارِقُكَ حَتَّى تَقْضِيَنِي أَوْ تَأْتِيَنِي بِحَمِيلٍ فَتَحَمَّلَ بِهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَاهُ بِقَدْرِ مَا وَعَدَهُ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَيْنَ أَصَبْتَ هَذَا الذَّهَبَ قَالَ مِنْ مَعْدِنٍ قَالَ لَا حَاجَةَ لَنَا فِيهَا وَلَيْسَ فِيهَا خَيْرٌ فَقَضَاهَا عَنْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi], telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari ['Amr bin Abu 'Amr] dari [Ikrimah] dari [Ibnu Abbas] bahwa seorang laki-laki tidak meninggalkan orang yang yang berhutang kepadanya sepuluh dinar, ia berkata; demi Allah, aku tidak akan meninggalkanmu hingga engkau membayar atau engkau datang kepadaku membawa orang yang akan bertanggung jawab. Kemudian Nabi shallallahu 'alaihi wasallam menanggungnya, kemudian ia datang dengan membawa uang sebesar yang telah ia janjikan. Kemudian Nabi shallallahu 'alaihi wasallam berkata kepadanya: \"Dari mana engkau mendapatkan emas ini?\" Ia berkata; dari barang tambang. Beliau bersabda: \"Kami tidak butuh kepadanya, tidak ada kebaikan padanya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam membayarkan hutang tersebut untuknya. "
            },
            {
                "number": 2814,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ قَالَ حَدَّثَنَا أَبُو شِهَابٍ حَدَّثَنَا ابْنُ عَوْنٍ عَنْ الشَّعْبِيِّ قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ وَلَا أَسْمَعُ أَحَدًا بَعْدَهُ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الْحَلَالَ بَيِّنٌ وَإِنَّ الْحَرَامَ بَيِّنٌ وَبَيْنَهُمَا أُمُورٌ مُشْتَبِهَاتٌ وَأَحْيَانًا يَقُولُ مُشْتَبِهَةٌ وَسَأَضْرِبُ لَكُمْ فِي ذَلِكَ مَثَلًا إِنَّ اللَّهَ حَمَى حِمًى وَإِنَّ حِمَى اللَّهِ مَا حَرَّمَ وَإِنَّهُ مَنْ يَرْعَى حَوْلَ الْحِمَى يُوشِكُ أَنْ يُخَالِطَهُ وَإِنَّهُ مَنْ يُخَالِطُ الرِّيبَةَ يُوشِكُ أَنْ يَجْسُرَحَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عِيسَى حَدَّثَنَا زَكَرِيَّا عَنْ عَامِرٍ الشَّعْبِيِّ قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِهَذَا الْحَدِيثِ قَالَ وَبَيْنَهُمَا مُشَبَّهَاتٌ لَا يَعْلَمُهَا كَثِيرٌ مِنْ النَّاسِ فَمَنْ اتَّقَى الشُّبُهَاتِ اسْتَبْرَأَ عِرْضَهُ وَدِينَهُ وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus], ia berkata; telah menceritakan kepada kami [Abu Syihab], telah menceritakan kepada kami [Ibnu 'Aun] dari [Asy Sya'bi], ia berkata; saya mendengar [An Nu'man bin Basyir], dan aku tidak mendengar seorangpun setelahnya. Ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya perkara yang halal itu jelas, serta yang haram jelas dan diantara keduanya terdapat dan diantara keduanya terdapat perkara-perkara yang samar. Dan akan aku berikan contoh hal tersebut. Sesungguhnya Allah melindungi daerah terlarang, dan sesungguhnya daerah terlarang Allah adalah apa yang Dia haramkan. Dan sesungguhnya orang yang menggembala di sekitar daerah larangan hampir memasukinya, dan sesungguhnya orang memasuki perkara yang meragukan hampir terjerumus dalam perkara yang haram.\" Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi], telah mengabarkan kepada kami [Isa] telah menceritakan kepada kami [Zakariya] dari [Amir Asy Sya'bi] ia berkata; saya mendengar [An Nu'man bin Basyir], ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda dengan hadits ini. Beliau berkata: \"Dan diantara keduanya terdapat perkara samar, yang tidak diketahui oleh kebanyakan orang. Barangsiapa yang menghindari perkara-perkara yang samar maka ia telah membersihkan kehormatan dan agamanya, dan barangsiapa yang terjerumus dlam perkara yang samar maka ia terjerumus dalam perkara yang haram.\""
            },
            {
                "number": 2815,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا عَبَّادُ بْنُ رَاشِدٍ قَالَ سَمِعْتُ سَعِيدَ بْنَ أَبِي خَيْرَةَ يَقُولُ حَدَّثَنَا الْحَسَنُ مُنْذُ أَرْبَعِينَ سَنَةً عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ أَخْبَرَنَا خَالِدٌ عَنْ دَاوُدَ يَعْنِي ابْنَ أَبِي هِنْدٍ وَهَذَا لَفْظُهُ عَنْ سَعِيدِ بْنِ أَبِي خَيْرَةَ عَنْ الْحَسَنِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيَأْتِيَنَّ عَلَى النَّاسِ زَمَانٌ لَا يَبْقَى أَحَدٌ إِلَّا أَكَلَ الرِّبَا فَإِنْ لَمْ يَأْكُلْهُ أَصَابَهُ مِنْ بُخَارِهِقَالَ ابْنُ عِيسَى أَصَابَهُ مِنْ غُبَارِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa], telah menceritakan kepada kami [Husyaim], telah mengabarkan kepada kami ['Abbad bin Rasyid], ia berkata; saya mendengar [Sa'id bin Abu Khairah] ia berkata; telah menceritakan kepada kami [Al Hasan] sejak empat puluh tahun, dari [Abu Hurairah], ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: …. Dan telah diriwayatkan dari jalur yang lain. Dan telah menceritakan kepada kami [Wahb bin Baqiyyah], telah mengabarkan kepada kami [Khalid], dari [Daud bin Abu Hindun], dan ini adalah lafazhnya. Dari [Sa'id bin Abu Khairah], dari [Al Hasan] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh akan datang kepada manusia suatu zaman dimana tidak ada seorangpun melainkan ia akan makan riba, jika tidak memakannya maka ia terkena sebagian dari uapnya.\" Ibnu Isa berkata; terkena sebagian dari debunya. "
            },
            {
                "number": 2816,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَخْبَرَنَا ابْنُ إِدْرِيسَ أَخْبَرَنَا عَاصِمُ بْنُ كُلَيْبٍ عَنْ أَبِيهِ عَنْ رَجُلٍ مِنْ الْأَنْصَارِ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَنَازَةٍ فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْقَبْرِ يُوصِي الْحَافِرَ أَوْسِعْ مِنْ قِبَلِ رِجْلَيْهِ أَوْسِعْ مِنْ قِبَلِ رَأْسِهِ فَلَمَّا رَجَعَ اسْتَقْبَلَهُ دَاعِي امْرَأَةٍ فَجَاءَ وَجِيءَ بِالطَّعَامِ فَوَضَعَ يَدَهُ ثُمَّ وَضَعَ الْقَوْمُ فَأَكَلُوا فَنَظَرَ آبَاؤُنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَلُوكُ لُقْمَةً فِي فَمِهِ ثُمَّ قَالَ أَجِدُ لَحْمَ شَاةٍ أُخِذَتْ بِغَيْرِ إِذْنِ أَهْلِهَا فَأَرْسَلَتْ الْمَرْأَةُ قَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أَرْسَلْتُ إِلَى الْبَقِيعِ يَشْتَرِي لِي شَاةً فَلَمْ أَجِدْ فَأَرْسَلْتُ إِلَى جَارٍ لِي قَدْ اشْتَرَى شَاةً أَنْ أَرْسِلْ إِلَيَّ بِهَا بِثَمَنِهَا فَلَمْ يُوجَدْ فَأَرْسَلْتُ إِلَى امْرَأَتِهِ فَأَرْسَلَتْ إِلَيَّ بِهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَطْعِمِيهِ الْأُسَارَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`], telah mengabarkan kepada kami [Ibnu Idris], telah mengabarkan kepada kami ['Ashim bin Kulaib], dari [ayahnya] dari [seorang laki-laki anshar], ia berkata; kami pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam mengantarkan jenazah, kemudian aku melihat Rasulullah shallallahu 'alaihi wasallam berada di atas kubur berwasiat kepada orang yang menggali: \"Perluaslah dari sisi kedua kakinya, perluaslah dari sisi kepalanya.\" Kemudian tatkala kembali, beliau disambut utusan seorang wanita yang mengundang Rasulullah shallallahu 'alaihi wasallam untuk makan, kemudian beliau datang dan makanan pun dihidangkan. Lalu beliau meletakkan tangannya pada makan kemudian orang-orang meletakkan tangan mereka pada makanan, lalu mereka makan. Kemudian orang-orang melihat Rasulullah shallallahu 'alaihi wasallam mengunyah makanan di mulutnya, kemudian beliau berkata: \"Saya dapatkan daging kambing yang diambil tanpa seizin pemiliknya.\" Kemudian wanita tersebut mengirim utusan, ia berkata; wahai Rasulullah, sesungguhnya saya telah mengirim utusan ke Baqi' untuk membelikan kambing, lalu aku tidak mendapatinya. Lalu aku mengirim utusan kepada tetanggaku yang telah membeli kambing agar ia mengirimnya kepadaku dan diganti dengan harganya, namun aku tidak mendapatkanya. Lalu aku mengirim utusan kepada isterinya, kemudian wanita tersebut mengirimkan kambing tersebut kepadaku. Lalu Rasulullah shallallahu 'alaihi wasallam berkata: \"Berilah makan para tawanan!\""
            },
            {
                "number": 2817,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا سِمَاكٌ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنْ أَبِيهِ قَالَلَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ آكِلَ الرِّبَا وَمُؤْكِلَهُ وَشَاهِدَهُ وَكَاتِبَهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus], telah menceritakan kepada kami [Zuhair], telah menceritakan kepada kami [Simak], telah menceritakan kepadaku [Abdurrahman bin Abdullah bin Mas'ud], dari [ayahnya], ia berkata; Rasulullah shallallahu 'alaihi wasallam melaknat orang yang makan riba, orang yang memberi makan riba, saksinya dan penulisnya. "
            },
            {
                "number": 2818,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو الْأَحْوَصِ حَدَّثَنَا شَبِيبُ بْنُ غَرْقَدَةَ عَنْ سُلَيْمَانَ بْنِ عَمْرٍو عَنْ أَبِيهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَجَّةِ الْوَدَاعِ يَقُولُ أَلَا إِنَّ كُلَّ رِبًا مِنْ رِبَا الْجَاهِلِيَّةِ مَوْضُوعٌ لَكُمْ رُءُوسُ أَمْوَالِكُمْ لَا تَظْلِمُونَ وَلَا تُظْلَمُونَ أَلَا وَإِنَّ كُلَّ دَمٍ مِنْ دَمِ الْجَاهِلِيَّةِ مَوْضُوعٌ وَأَوَّلُ دَمٍ أَضَعُ مِنْهَا دَمُ الْحَارِثِ بْنِ عَبْدِ الْمُطَّلِبِ كَانَ مُسْتَرْضِعًا فِي بَنِي لَيْثٍ فَقَتَلَتْهُ هُذَيْلٌ قَالَ اللَّهُمَّ هَلْ بَلَّغْتُ قَالُوا نَعَمْ ثَلَاثَ مَرَّاتٍ قَالَ اللَّهُمَّ اشْهَدْ ثَلَاثَ مَرَّاتٍ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Abu Al Ahwash], telah menceritakan kepada kami [Syabib bin Gharqadah], dari [Sulaiman bin 'Amr], dari [ayahnya] ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam ketika haji wada' berkata: \"Ketahuilah bahwa seluruh riba dari riba jahiliyah telah dibatalkan, bagi kalian modal kalian, dengan tidak menzhalimi dan tidak dizhalimi. Ketahuilah bahwa seluruh darah dari darah pada masa jahiliyah telah digugurkan, dan darah pertama yang aku gugurkan adalah darah Al Harits bin Abdul Muththalib, dahulu ia disusui seseorang dari Bani Laits, kemudian ia dibunuh orang-orang Hudzail.\" Beliau berkata: \"Ya Allah, saksikanlah. Apakah aku telah menyampaikan?\" mereka berkata; ya. Tiga kali. Beliau berkata; ya Allah, saksikanlah. Beliau mengucapkannya sebanyak tiga kali. "
            },
            {
                "number": 2819,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ حَدَّثَنَا ابْنُ وَهْبٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَنْبَسَةُ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ قَالَ قَالَ لِي ابْنُ الْمُسَيَّبِ إِنَّ أَبَا هُرَيْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْحَلِفُ مَنْفَقَةٌ لِلسِّلْعَةِ مَمْحَقَةٌ لِلْبَرَكَةِقَالَ ابْنُ السَّرْحِ لِلْكَسْبِ و قَالَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Amr bin As Sarh] telah menceritakan kepada kami [Ibnu Wahb], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami ['Anbasah] dari [Yunus] dari [Ibnu Syihab], ia berkata; [Ibnu Al Musayyab] berkata kepadaku; sesungguhnya [Abu Hurairah] berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sumpah itu melariskan barang dan menghilangkan berkah.\" Ibnu As Sarh berkata; menghilangkan usaha. Dan ia berkata dari Sa'id bin Al Musayyab dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam. "
            },
            {
                "number": 2820,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا سُفْيَانُ عَنْ سِمَاكِ بْنِ حَرْبٍ حَدَّثَنِي سُوَيْدُ بْنُ قَيْسٍ قَالَجَلَبْتُ أَنَا وَمَخْرَفَةُ الْعَبْدِيُّ بَزًّا مِنْ هَجَرَ فَأَتَيْنَا بِهِ مَكَّةَ فَجَاءَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْشِي فَسَاوَمَنَا بِسَرَاوِيلَ فَبِعْنَاهُ وَثَمَّ رَجُلٌ يَزِنُ بِالْأَجْرِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زِنْ وَأَرْجِحْحَدَّثَنَا حَفْصُ بْنُ عُمَرَ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ الْمَعْنَى قَرِيبٌ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ أَبِي صَفْوَانَ بْنِ عُمَيْرَةَ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ قَبْلَ أَنْ يُهَاجِرَ بِهَذَا الْحَدِيثِ وَلَمْ يَذْكُرْ يَزِنُ بِأَجْرٍ قَالَ أَبُو دَاوُد رَوَاهُ قَيْسٌ كَمَا قَالَ سُفْيَانُ وَالْقَوْلُ قَوْلُ سُفْيَانَ حَدَّثَنَا ابْنُ أَبِي رِزْمَةَ سَمِعْتُ أَبِي يَقُولُ قَالَ رَجُلٌ لِشُعْبَةَ خَالَفَكَ سُفْيَانَ قَالَ دَمَغْتَنِي وَبَلَغَنِي عَنْ يَحْيَى بْنِ مَعِينٍ قَالَ كُلُّ مَنْ خَالَفَ سُفْيَانَ فَالْقَوْلُ قَوْلُ سُفْيَانَ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ قَالَ كَانَ سُفْيَانُ أَحْفَظَ مِنِّي",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz], telah menceritakan kepada kami [ayahku], telah menceritakan kepada kami [Sufyan] dari [Simak bin Harb], telah menceritakan kepadaku [Suwaid bin Qais], ia berkata; aku dan Makhramah menyambut jenis pakaian dari sutera yang datang dari Hajar menuju Mekkah, kemudian Rasulullah shallallahu 'alaihi wasallam mendatangi kami dengan berjalan kaki kemudian beliau menawar beberapa celana panjang dari kami kemudian kami menjualnya kepada beliau, dan disana terdapat tukang penimbang yang melakukan penimbangan dengan diberi diupah. Kemudian beliau berkata kepada tukang penimbang tersebut: \"Timbanglah dan penuhilah (sempurnakanlah) timbangan..\" telah menceritakan kepada kami [Hafshah bin Umar] dan [Muslim bin Ibrahim] secara makna hampir sama. Mereka berdua berkata; telah menceritakan kepada kami [Syu'bah] dari [Simak bin Harb] dari [Abu Shafwan bin 'Umairah], ia berkata; aku datang kepada Rasulullah shallallahu 'alaihi wasallam di Mekkah sebelum beliau berhijrah, -ia menceritakan dengan hadits ini dan tidak menyebutkan; menimbang dengan diberi upah. Abu Daud berkata; hadits tersebut diriwayatkan oleh [Qais], sebagaimana yang dikatakan Sufyan. Dan perkataan yang benar adalah perkataan Sufyan. Telah menceritakan kepada kami Ibnu Abu Rizmah; aku mendengar ayahku berkata; seorang laki-laki berkata kepada Syu'bah, Sufyan telah menyelisihimu. Engkau telah melukaiku, telah sampai kepadaku khabar dari Yahya bin Ma'in, ia berkata; seluruh orang yang menyelisihi Sufyan, maka perkataan yang benar adalah perkataan Sufyan. Telah menceritakan kepada kami Ahmad bin Hanbal, telah menceritakan kepada kami Waki' dari Syu'bah ia berkata; Sufyan lebih hafal dariku. "
            },
            {
                "number": 2821,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ دُكَيْنٍ حَدَّثَنَا سُفْيَانُ عَنْ حَنْظَلَةَ عَنْ طَاوُسٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوَزْنُ وَزْنُ أَهْلِ مَكَّةَ وَالْمِكْيَالُ مِكْيَالُ أَهْلِ الْمَدِينَةِقَالَ أَبُو دَاوُد وَكَذَا رَوَاهُ الْفِرْيَابِيُّ وَأَبُو أَحْمَدَ عَنْ سُفْيَانَ وَافَقَهُمَا فِي الْمَتْنِ و قَالَ أَبُو أَحْمَدَ عَنْ ابْنِ عَبَّاسٍ مَكَانَ ابْنِ عُمَرَ وَرَوَاهُ الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ حَنْظَلَةَ قَالَ وَزْنُ الْمَدِينَةِ وَمِكْيَالُ مَكَّةَ قَالَ أَبُو دَاوُد وَاخْتُلِفَ فِي الْمَتْنِ فِي حَدِيثِ مَالِكِ بْنِ دِينَارٍ عَنْ عَطَاءٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah?], telah menceritakan kepada kami [Ibnu Dukain], telah menceritakan kepada kami [Sufyan], dari [Hanzhalah] dari [Thawus] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Timbangan yang menjadi standar ukuran adalah timbangan penduduk Mekkah, takaran yang menjadi standar ukuran adalah takaran penduduk Madinah.\" Abu Daud berkata; demikian ini yang diriwayatkan oleh [Al Firyabi], dan [Abu Ahmad], dari [Sufyan]. Dan keduanya sama dalam matan. [Abu Ahmad] berkata; dari [Ibnu Abbas]. Sebagai ganti Ibnu Umar. Hadits tersebut diriwayatkan oleh [Al Walid bin Muslim] dari [Hanzhalah]. Ia berkata; timbangan Madinah dan takaran Mekkah. Abu Daud berkata; dan telah diperselisihkan dalam matan pada hadits Malik bin Dinar, dari 'Atha`, dari Nabi shallallahu 'alaihi wasallam dalam hal ini."
            },
            {
                "number": 2822,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ الشَّعْبِيِّ عَنْ سَمْعَانَ عَنْ سَمُرَةَ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هَاهُنَا أَحَدٌ مِنْ بَنِي فُلَانٍ فَلَمْ يُجِبْهُ أَحَدٌ ثُمَّ قَالَ هَاهُنَا أَحَدٌ مِنْ بَنِي فُلَانٍ فَلَمْ يُجِبْهُ أَحَدٌ ثُمَّ قَالَ هَاهُنَا أَحَدٌ مِنْ بَنِي فُلَانٍ فَقَامَ رَجُلٌ فَقَالَ أَنَا يَا رَسُولَ اللَّهِ فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مَنَعَكَ أَنْ تُجِيبَنِي فِي الْمَرَّتَيْنِ الْأُولَيَيْنِ أَمَا إِنِّي لَمْ أُنَوِّهْ بِكُمْ إِلَّا خَيْرًا إِنَّ صَاحِبَكُمْ مَأْسُورٌ بِدَيْنِهِ فَلَقَدْ رَأَيْتُهُ أَدَّى عَنْهُ حَتَّى مَا بَقِيَ أَحَدٌ يَطْلُبُهُ بِشَيْءٍقَالَ أَبُو دَاوُد سَمْعَانُ بْنُ مُشَنِّجٍ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur], telah menceritakan kepada kami [Abu Al Ahwash] dari [Sa'id bin Masruq], dari [Asy Sya'bi], dari [Sam'an] dari [Samurah], ia berkata; Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada kami, kemudian beliau berkata: \"Apakah di sini terdapat seseorang dari Bani Fulan?\" kemudian terdapat seorang laki-laki yang berdiri dan berkata; saya wahai Rasulullah. Kemudian beliau shallallahu 'alaihi wasallam berkata: \"Apa yang menghalangimu untuk menjawabku, pada dua pertanyaan pertama? Adapun aku, maka tidaklah aku menyebutkan kepada kalian kecuali kebaikan. Sesungguhnya sahabat kalian tertahan dengan hutangnya.\" Sungguh aku melihatnya telah membayar hutang tersebut untuknya hingga tidak tersisa seorangpun yang menuntut sesuatu kepadanya. Abu Daud berkata; Sam'an bin Musyannij. "
            },
            {
                "number": 2823,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ أَنَّهُ سَمِعَ أَبَا عَبْدِ اللَّهِ الْقُرَشِيَّ يَقُولُ سَمِعْتُ أَبَا بُرْدَةَ بْنَ أَبِي مُوسَى الْأَشْعَرِيَّ يَقُولُ عَنْ أَبِيهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ أَعْظَمَ الذُّنُوبِ عِنْدَ اللَّهِ أَنْ يَلْقَاهُ بِهَا عَبْدٌ بَعْدَ الْكَبَائِرِ الَّتِي نَهَى اللَّهُ عَنْهَا أَنْ يَمُوتَ رَجُلٌ وَعَلَيْهِ دَيْنٌ لَا يَدَعُ لَهُ قَضَاءً",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al Mahri], telah mengabarkan kepada kami [Ibnu Wahb], telah menceritakan kepadaku [Sa'i bin Abu Ayyub], bahwa ia telah mendengar [Abu Abdullah Al Qurasyi] berkata; aku mendengar [Abu Burdah bin Abu Musa Al Asy'ari] berkata dari [ayahnya], dari Rasulullah shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Sesungguhnya dosa terbesar di sisi Allah yang akan dibawa seorang hamba bertemu denganNya setelah dosa-dosa besar yang telah Allah larang adalah seseorang meninggal dalam keadaan menanggung hutang yang tidak mampu ia lunasi.\""
            },
            {
                "number": 2824,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ الْعَسْقَلَانِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُصَلِّي عَلَى رَجُلٍ مَاتَ وَعَلَيْهِ دَيْنٌ فَأُتِيَ بِمَيِّتٍ فَقَالَ أَعَلَيْهِ دَيْنٌ قَالُوا نَعَمْ دِينَارَانِ قَالَ صَلُّوا عَلَى صَاحِبِكُمْ فَقَالَ أَبُو قَتَادَةَ الْأَنْصَارِيُّ هُمَا عَلَيَّ يَا رَسُولَ اللَّهِ قَالَ فَصَلَّى عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا فَتَحَ اللَّهُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَنَا أَوْلَى بِكُلِّ مُؤْمِنٍ مِنْ نَفْسِهِ فَمَنْ تَرَكَ دَيْنًا فَعَلَيَّ قَضَاؤُهُ وَمَنْ تَرَكَ مَالًا فَلِوَرَثَتِهِحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَقُتَيْبَةُ بْنُ سَعِيدٍ عَنْ شَرِيكٍ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ رَفَعَهُ قَالَ عُثْمَانُ و حَدَّثَنَا وَكِيعٌ عَنْ شَرِيكٍ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ قَالَ اشْتَرَى مِنْ عِيرٍ تَبِيعًا وَلَيْسَ عِنْدَهُ ثَمَنُهُ فَأُرْبِحَ فِيهِ فَبَاعَهُ فَتَصَدَّقَ بِالرِّبْحِ عَلَى أَرَامِلِ بَنِي عَبْدِ الْمُطَّلِبِ وَقَالَ لَا أَشْتَرِي بَعْدَهَا شَيْئًا إِلَّا وَعِنْدِي ثَمَنُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutawakkil Al 'Asqalani], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam tidak mensholatkan seseorang yang meninggal dalam keadaan menanggung hutang. Kemudian beliau dihadapkan kepada seorang yang telah meninggal, lalu beliau bertanya: \"Apakah ia memiliki tanggungan hutang?\" Mereka berkata; Iya, dua dinar. Beliau berkata: \"sholatkan sahabat kalian!\" kemudian Abu Qatadah Al Anshari berkata; keduanya menjadi tanggunganku wahai Rasulullah! Jabir berkata; kemudian Rasulullah shallallahu 'alaihi wasallam mensholatkannya. Kemudian tatkala Allah memberikan kemenangan kepada Rasulullah shallallahu 'alaihi wasallam beliau bersabda: \"Aku adalah lebih utama (lebih berhak) terhadap orang mukmin daripada dirinya sendiri. Barangsiapa yang meninggalkan hutang maka menjadi tanggunganku, dan barangsiapa yang meninggalkan harta maka untuk pewarisnya.\" Telah menceritakan kepada kami [Utsman bin Abu Syaibah?], dan [Qutaibah bin Sa'id], dari [Syarik] dari [Simak], dari [Ikrimah] dan ia memarfu'kannya. [Utsman] berkata; dan telah menceritakan kepada kami [Waki'] dari [Syarik], dari [Simak], dari [Ikrimah], dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam seperti itu. Ia berkata; ia membeli sapi yang berumur satu tahun dari sebuah kafilah, sementara ia tidak memiliki uang untuk membayarnya. Kemudian ia mendapat keuntungan dan ia pun menjualnya. Lalu ia mensedekahkan keuntungan tersebut kepada para janda Bani Abdul Muththalib. Ia berkata; setelah itu tidaklah aku membeli sesuatu, melainkan aku memiliki uang untuk harganya. "
            },
            {
                "number": 2825,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَطْلُ الْغَنِيِّ ظُلْمٌ وَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيءٍ فَلْيَتْبَعْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi], dari [Malik], dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penangguhan orang yang kaya (dalam melunasi hutang) adalah kezhaliman, dan apabila salah seorang di antara kalian diikutkan (hutangnya dipindahkan, hiwalah) kepada orang yang kaya, hendaknya ia mengikuti!\""
            },
            {
                "number": 2826,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي رَافِعٍ قَالَاسْتَسْلَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَكْرًا فَجَاءَتْهُ إِبِلٌ مِنْ الصَّدَقَةِ فَأَمَرَنِي أَنْ أَقْضِيَ الرَّجُلَ بَكْرَهُ فَقُلْتُ لَمْ أَجِدْ فِي الْإِبِلِ إِلَّا جَمَلًا خِيَارًا رَبَاعِيًا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطِهِ إِيَّاهُ فَإِنَّ خِيَارَ النَّاسِ أَحْسَنُهُمْ قَضَاءً",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi], dari [Malik] dari [Zaid bin Aslam] dari ['Atha` bin Yasar] dari [Abu Rafi'], ia berkata; Rasulullah shallallahu 'alaihi wasallam menghutang seekor unta muda, kemudian terdapat unta zakat yang datang kepada beliau. Lalu beliau memerintahkanku agar mengembalikan unta muda tersebut kepada yang punya. Lalu aku katakan; saya tidak mendapatkan di antara unta tersebut selain unta pilihan yang berumur empat tahun. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Berikan kepadanya, sesungguhnya sebaik-baik orang adalah yang terbaik dalam menunaikan hutang.\""
            },
            {
                "number": 2827,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ مِسْعَرٍ عَنْ مُحَارِبِ بْنِ دِثَارٍ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَكَانَ لِي عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَيْنٌ فَقَضَانِي وَزَادَنِي",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Yahya] dari [Mas'ar] dari [Muharib bin Ditsar], ia berkata; saya mendengar [Jabir bin Abdullah] berkata; dahulu aku memiliki piutang pada Rasulullah shallallahu 'alaihi wasallam, kemudian beliau membayar piutangku dan memberikan lebih (dari jumlah yang dipinjam). "
            },
            {
                "number": 2828,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ مَالِكِ بْنِ أَوْسٍ عَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الذَّهَبُ بِالْوَرِقِ رِبًا إِلَّا هَاءَ وَهَاءَ وَالْبُرُّ بِالْبُرِّ رِبًا إِلَّا هَاءَ وَهَاءَ وَالتَّمْرُ بِالتَّمْرِ رِبًا إِلَّا هَاءَ وَهَاءَ وَالشَّعِيرُ بِالشَّعِيرِ رِبًا إِلَّا هَاءَ وَهَاءَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi], dari [Malik], dari [Ibnu Syihab], dari [Malik bin Aus] dari [Umar] radliallahu 'anhu, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Emas ditukar dengan perak adalah riba, kecuali diserahkan secara tunai, gandum ditukar dengan gandum adalah riba kecuali diserahkan secara tunai, kurma ditukar dengan kurma adalah riba kecuali diserahkan secara tubai, jewawut ditukar dengan jewawut adalah riba kecuali diserahkan secara tunai.\""
            },
            {
                "number": 2829,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا بِشْرُ بْنُ عُمَرَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَبِي الْخَلِيلِ عَنْ مُسْلِمٍ الْمَكِّيِّ عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الذَّهَبُ بِالذَّهَبِ تِبْرُهَا وَعَيْنُهَا وَالْفِضَّةُ بِالْفِضَّةِ تِبْرُهَا وَعَيْنُهَا وَالْبُرُّ بِالْبُرِّ مُدْيٌ بِمُدْيٍ وَالشَّعِيرُ بِالشَّعِيرِ مُدْيٌ بِمُدْيٍ وَالتَّمْرُ بِالتَّمْرِ مُدْيٌ بِمُدْيٍ وَالْمِلْحُ بِالْمِلْحِ مُدْيٌ بِمُدْيٍ فَمَنْ زَادَ أَوْ ازْدَادَ فَقَدْ أَرْبَى وَلَا بَأْسَ بِبَيْعِ الذَّهَبِ بِالْفِضَّةِ وَالْفِضَّةُ أَكْثَرُهُمَا يَدًا بِيَدٍ وَأَمَّا نَسِيئَةً فَلَا وَلَا بَأْسَ بِبَيْعِ الْبُرِّ بِالشَّعِيرِ وَالشَّعِيرُ أَكْثَرُهُمَا يَدًا بِيَدٍ وَأَمَّا نَسِيئَةً فَلَاقَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ سَعِيدُ بْنُ أَبِي عَرُوبَةَ وَهِشَامٌ الدَّسْتُوَائِيُّ عَنْ قَتَادَةَ عَنْ مُسْلِمِ بْنِ يَسَارٍ بِإِسْنَادِهِ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْخَبَرِ يَزِيدُ وَيَنْقُصُ وَزَادَ قَالَ فَإِذَا اخْتَلَفَتْ هَذِهِ الْأَصْنَافُ فَبِيعُوا كَيْفَ شِئْتُمْ إِذَا كَانَ يَدًا بِيَدٍ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Bisyr bin Umar], telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Abu Al Khalil] dari [Muslim Al Makki] dari [Abu Al Asy'ats Ash Shan'ani] dari ['Ubadah bin Ash Shamit], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Emas dengan emas baik yang masih murni maupun mata uangnya, perak dengan perak baik yang masih murni maupun mata uangnya, gandum dengan gandum satu mudyu (takaran penduduk Syam sama dengan dua setengah sha') dengan satu mudyu, jewawut dengan jewawut satu mudyu dengan satu mudyu, kurma dengan kurma satu mudyu dengan satu mudyu, garam dengan garam satu mudyu dengan satu mudyu, barangsiapa yang menambah atau minta tambah maka sungguh ia telah melakukan riba. Tidak mengapa menjual emas dengan perak dan perak lebih banyak apabila secara langsung, adapun dengan cara menunda maka tidak boleh, dan tidak mengapa menjual gandum dengan jewawut dan jewawut lebih banyak apabila secara langsung, adapun dengan menunda maka tidak boleh.\" Abu Daud berkata; hadits ini diriwayatkan oleh [Sa'id bin Abu 'Arubah] dan [Hisyam Ad Dastuwai] dari [Qatadah] dari [Muslim bin Yasar] dengan sanadnya. Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah?] telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami [Sufyan] dari [Khalid] dari [Abu Qilabah], dari [Abu Al Asy'ats Ash Shan'ani], dari ['Ubadah bin Ash Shamit], dari Nabi shallallahu 'alaihi wasallam bersabda: dengan hadits ini, dan dengan menambah serta mengurangi. Ia tambahkan; beliau bersabda: \"Apabila jenisnya berbeda, maka juallah dengan cara yang kalian kehendaki, apabila dilakukan secara langsung.\""
            },
            {
                "number": 2830,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَحْمَدُ بْنُ مَنِيعٍ قَالُوا حَدَّثَنَا ابْنُ الْمُبَارَكِ ح و حَدَّثَنَا ابْنُ الْعَلَاءِ أَخْبَرَنَا ابْنُ الْمُبَارَكِ عَنْ سَعِيدِ بْنِ يَزِيدَ قَالَ حَدَّثَنِي خَالِدُ بْنُ أَبِي عِمْرَانَ عَنْ حَنَشٍ عَنْ فَضَالَةَ بْنِ عُبَيْدٍ قَالَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ خَيْبَرَ بِقِلَادَةٍ فِيهَا ذَهَبٌ وَخَرَزٌ قَالَ أَبُو بَكْرٍ وَابْنُ مَنِيعٍ فِيهَا خَرَزٌ مُعَلَّقَةٌ بِذَهَبٍ ابْتَاعَهَا رَجُلٌ بِتِسْعَةِ دَنَانِيرَ أَوْ بِسَبْعَةِ دَنَانِيرَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا حَتَّى تُمَيِّزَ بَيْنَهُ وَبَيْنَهُ فَقَالَ إِنَّمَا أَرَدْتُ الْحِجَارَةَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا حَتَّى تُمَيِّزَ بَيْنَهُمَا قَالَ فَرَدَّهُ حَتَّى مُيِّزَ بَيْنَهُمَاو قَالَ ابْنُ عِيسَى أَرَدْتُ التِّجَارَةَ قَالَ أَبُو دَاوُد وَكَانَ فِي كِتَابِهِ الْحِجَارَةُ فَغَيَّرَهُ فَقَالَ التِّجَارَةُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa], dan [Abu Bakr bin Abu Syaibah?] serta [Ahmad bin Mani'], mereka berkata; telah menceritakan kepada kami [Ibnu Al Mubarak] dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Ibnu Al 'Ala`], telah mengabarkan kepada kami [Ibnu Al Mubarak], dari [Sa'id bin Yazid?], ia berkata; telah menceritakan kepadaku [Khalid bin Abu Imran] dari [Hanasy] dari [Fadhalah bin 'Ubaid], ia berkata; Nabi shallallahu 'alaihi wasallam pada saat perang Khaibar diberi sebuah kalung yang padanya terdapat emas dan manik-manik. Abu Bakr dan Ibnu Mani' berkata; padanya terdapat manik-manik yang tergantung dengan emas. Yang dibeli oleh seseorang dengan harga sembilan dinar atau tujuh dinar. Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak boleh, hingga engkau memisahkan antara emas dan manik-manik tersebut.\" Kemudian ia mengembalikannya hingga terpisahkan antara keduanya. Ibnu Isa berkata; aku ingin at tijarah (berdagang). Abu Daud berkata; dalam tulisannya adalah al hijarah (bebatuan). Kemudian ia mengubahnya, lalu ia berkata; at tijarah (perdagangan). "
            },
            {
                "number": 2831,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ أَبِي شُجَاعٍ سَعِيدِ بْنِ يَزِيدَ عَنْ خَالِدِ بْنِ أَبِي عِمْرَانَ عَنْ حَنَشٍ الصَّنْعَانِيِّ عَنْ فَضَالَةَ بْنِ عُبَيْدٍ قَالَاشْتَرَيْتُ يَوْمَ خَيْبَرَ قِلَادَةً بِاثْنَيْ عَشَرَ دِينَارًا فِيهَا ذَهَبٌ وَخَرَزٌ فَفَصَّلْتُهَا فَوَجَدْتُ فِيهَا أَكْثَرَ مِنْ اثْنَيْ عَشَرَ دِينَارًا فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَا تُبَاعُ حَتَّى تُفَصَّلَ",
                "id": "Telah menceritakan kepada kami [Quaibah bin Sa'id], telah menceritakan kepada kami [Al Laits] dari [Abu Syuja' Sa'id bin Yazid?] dari [Khalid bin Abu Imran], dari [Hanasy Ash Shan'ani], dari [Fadhalah bin 'Ubaid], ia berkata; pada saat perang Khaibar, aku membeli kalung dengan harga dua belas dinar, padanya terdapat emas dan manik-manik. Kemudian aku memisahkannya dan aku dapatkan padanya lebih dari dua belas dinar. Kemudian aku sebutkan hal tersebut kepada Nabi shallallahu 'alaihi wasallam, lalu beliau berkata: \"Tidak boleh dijual hingga dipisahkan (antara emas dan manik-manik tersebut).\""
            },
            {
                "number": 2832,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ أَبِي جَعْفَرٍ عَنْ الْجُلَاحِ أَبِي كَثِيرٍ حَدَّثَنِي حَنَشٌ الصَّنْعَانِيُّ عَنْ فَضَالَةَ بْنِ عُبَيْدٍ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ خَيْبَرَ نُبَايِعُ الْيَهُودَ الْأُوقِيَّةَ مِنْ الذَّهَبِ بِالدِّينَارِ قَالَ غَيْرُ قُتَيْبَةَ بِالدِّينَارَيْنِ وَالثَّلَاثَةِ ثُمَّ اتَّفَقَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَبِيعُوا الذَّهَبَ بِالذَّهَبِ إِلَّا وَزْنًا بِوَزْنٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id], telah menceritakan kepada kami [Al Laits] dari [Ibnu Abu Ja'far], dari [Al Julah Abu Katsir], telah menceritakan kepadaku [Hanasy Ash Shan'ani], dari [Fadhlah bin 'Ubaid], ia berkata; kami pernah bersama Rasulullah shallallahu 'alaihi wasallam pada saat perang khaibar, kami menjual emas kepada orang-orang yahudi dengan dinar. Selain Qutaibah berkata; dengan dua dan tiga dinar. Kemudian lafazh mereka sama; kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menjual emas dengan emas kecuali dengan timbangan yang sama.\""
            },
            {
                "number": 2833,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ وَمُحَمَّدُ بْنُ مَحْبُوبٍ الْمَعْنَى وَاحِدٌ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ قَالَكُنْتُ أَبِيعُ الْإِبِلَ بِالْبَقِيعِ فَأَبِيعُ بِالدَّنَانِيرِ وَآخُذُ الدَّرَاهِمَ وَأَبِيعُ بِالدَّرَاهِمِ وَآخُذُ الدَّنَانِيرَ آخُذُ هَذِهِ مِنْ هَذِهِ وَأُعْطِي هَذِهِ مِنْ هَذِهِ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي بَيْتِ حَفْصَةَ فَقُلْتُ يَا رَسُولَ اللَّهِ رُوَيْدَكَ أَسْأَلُكَ إِنِّي أَبِيعُ الْإِبِلَ بِالْبَقِيعِ فَأَبِيعُ بِالدَّنَانِيرِ وَآخُذُ الدَّرَاهِمَ وَأَبِيعُ بِالدَّرَاهِمِ وَآخُذُ الدَّنَانِيرَ آخُذُ هَذِهِ مِنْ هَذِهِ وَأُعْطِي هَذِهِ مِنْ هَذِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا بَأْسَ أَنْ تَأْخُذَهَا بِسِعْرِ يَوْمِهَا مَا لَمْ تَفْتَرِقَا وَبَيْنَكُمَا شَيْءٌحَدَّثَنَا حُسَيْنُ بْنُ الْأَسْوَدِ حَدَّثَنَا عُبَيْدُ اللَّهِ أَخْبَرَنَا إِسْرَائِيلُ عَنْ سِمَاكٍ بِإِسْنَادِهِ وَمَعْنَاهُ وَالْأَوَّلُ أَتَمُّ لَمْ يَذْكُرْ بِسِعْرِ يَوْمِهَا",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], serta [Muhammad bin Mahbub] dan maknanya satu, mereka berkata; telah menceritakan kepada kami [Hammad] dari [Simak bin Harb], dari [Sa'id bin Jubair], dari [Ibnu Umar] ia berkata; dahulu aku menjual unta di Baqi', aku menjual dengan dinar dan mengambil dirham, dan menjual dengan dirham dan mengambil dinar, aku mengambil ini sebagai ganti dari ini, dan memberikan ini sebagai ganti dari ini. Kemudian aku datang kepada Rasulullah shallallahu 'alaihi wasallam sementara beliau berada di rumah Hafshah. Lalu aku katakan; wahai Rasulullah, sebentar! Saya ingin bertanya. Saya menjual unta di Baqi' dengan dinar, dan mengambil dirham, menjual dengan dirham dan mengambil dinar. Saya mengambil ini sebagai ganti dari ini, dan memberi ini sebagai ganti dari ini. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak mengapa engkau mengambilnya dengan nilai harga pada hari itu selama kalian belum berpisah, sementara di antara kalian terdapat sesuatu (yang belum diserahkan).\" Telah menceritakan kepada kami [Husain bin Al Aswad], telah menceritakan kepada kami ['ubaidhullah] telah mengabarkan kepada kami [Israil] dari [Simak] dengan sanad dan maknanya, -dan hadits yang pertama lebih sempurna-, ia tidak menyebutkan kata: \"nilai harga pada hari.\""
            },
            {
                "number": 2834,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْحَيَوَانِ بِالْحَيَوَانِ نَسِيئَةً",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Qatadah] dari [Al Hasan], dari [Samurah] bahwa Nabi shallallahu 'alaihi wasallam telah melarang menjual hewan dengan hewan dengan cara penangguhan. "
            },
            {
                "number": 2835,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ مُسْلِمِ بْنِ جُبَيْرٍ عَنْ أَبِي سُفْيَانَ عَنْ عَمْرِو بْنِ حَرِيشٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ أَنْ يُجَهِّزَ جَيْشًا فَنَفِدَتْ الْإِبِلُ فَأَمَرَهُ أَنْ يَأْخُذَ فِي قِلَاصِ الصَّدَقَةِ فَكَانَ يَأْخُذُ الْبَعِيرَ بِالْبَعِيرَيْنِ إِلَى إِبِلِ الصَّدَقَةِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar], telah menceritakan kepada kami [Hammad bin Salamah], dari [Muhammad bin Ishaq], dari [Yazid? bin Abu Habib], dari [Muslim bin Jubair], dari [Abu Sufyan], dari ['Amr bin Harisy] dari [Abdullah bin 'Amr], bahwa Rasulullah shallallahu 'alaihi wasallam telah memerintahkannya agar mempersiapkan tentara, hingga habis unta beliau, lalu beliau memerintahkan agar mengambil dari unta zakat. Beliau mengambil satu ekor dengan mengembalikan dua ekor unta hingga waktu diperoleh unta untuk zakat. "
            },
            {
                "number": 2836,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدٍ الْهَمْدَانِيُّ وَقُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ أَنَّ اللَّيْثَ حَدَّثَهُمْ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْتَرَى عَبْدًا بِعَبْدَيْنِ",
                "id": "Telah menceritakan kepada kami [Yazid? bin Khalid Al Hamdani], dan [Qutaibah bin Sa'id Ats Tsaqafi], bahwa [Al Laits] telah menceritakan kepada mereka dari [Abu Az Zubair] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam membeli seorang budak dibayar dengan dua orang budak. "
            },
            {
                "number": 2837,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ أَنَّ زَيْدًا أَبَا عَيَّاشٍ أَخْبَرَهُأَنَّهُ سَأَلَ سَعْدَ بْنَ أَبِي وَقَّاصٍ عَنْ الْبَيْضَاءِ بِالسُّلْتِ فَقَالَ لَهُ سَعْدٌ أَيُّهُمَا أَفْضَلُ قَالَ الْبَيْضَاءُ فَنَهَاهُ عَنْ ذَلِكَ وَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُسْأَلُ عَنْ شِرَاءِ التَّمْرِ بِالرُّطَبِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيَنْقُصُ الرُّطَبُ إِذَا يَبِسَ قَالُوا نَعَمْ فَنَهَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَقَالَ أَبُو دَاوُد رَوَاهُ إِسْمَعِيلُ بْنُ أُمَيَّةَ نَحْوَ مَالِكٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah], dari [Malik], dari [Abdullah bin Yazid?], bahwa [Zaid Abu 'Ayyasy] telah mengabarkan kepadanya bahwa ia bertanya kepada [Sa'd bin Abu Waqqash] mengenai menjual jewawut dengan sult (semacam jewawut yang tidak berbulu). Kemudian Sa'd berkata kepadanya; manakah yang lebih baik? Ia berkata; jewawut. Kemudian Sa'd melarang dari hal tersebut, dan ia berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam ditanya mengenai pembelian kurma dengan ruthab (kurma yang belum matang). Kemudian beliau berkata: \"Apakah ruthab akan berkurang apabila kering?\" Mereka berkata; Iya. Kemudian Rasulullah shallallahu 'alaihi wasallam melarangnya dari hal tersebut. Abu Daud berkata; hadits tersebut diriwayatkan oleh [Isma'il bin Umayyah] seperti hadits Malik. "
            },
            {
                "number": 2838,
                "arab": "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ حَدَّثَنَا مُعَاوِيَةُ يَعْنِي ابْنَ سَلَّامٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ أَخْبَرَنَا عَبْدُ اللَّهِ أَنَّ أَبَا عَيَّاشٍ أَخْبَرَهُ أَنَّهُ سَمِعَ سَعْدَ بْنَ أَبِي وَقَّاصٍ يَقُولُنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الرُّطَبِ بِالتَّمْرِ نَسِيئَةًقَالَ أَبُو دَاوُد رَوَاهُ عِمْرَانُ بْنُ أَبِي أَنَسٍ عَنْ مَوْلًى لِبَنِي مَخْزُومٍ عَنْ سَعْدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Ar Rabi' bin Nafi' Abu Taubah], telah menceritakan kepada kami [Mu'awiyah bin Sallam], dari [Yahya bin Abu Katsir], telah mengabarkan kepada kami [Abdullah] bahwa [Abu 'Ayyasy] telah mengabarkan kepadanya bahwa ia mendengar [Sa'd bin Abu Waqqash] berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjual ruthab dengan kurma secara dengan penundaan. Abu Daud berkata; hadits tersebut diriwayatkan oleh [Imran bin Abu Anas] dari [mantan budak Bani Makhzum], dari [Sa'd] dari Nabi shallallahu 'alaihi wasallam seperti itu. "
            },
            {
                "number": 2839,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرِ بِالتَّمْرِ كَيْلًا وَعَنْ بَيْعِ الْعِنَبِ بِالزَّبِيبِ كَيْلًا وَعَنْ بَيْعِ الزَّرْعِ بِالْحِنْطَةِ كَيْلًا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah], telah menceritakan kepada kami [Ibnu Abu Zaidah] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam melarang dari menjual buah dengan kurma secara takaran, dan dari penjualan anggur dengan kismis secara takaran, dan dari penjualan tanaman dengan gandum secara takaran. "
            },
            {
                "number": 2840,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي خَارِجَةُ بْنُ زَيْدِ بْنِ ثَابِتٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي بَيْعِ الْعَرَايَا بِالتَّمْرِ وَالرُّطَبِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Ibnu Wahb], telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah mengabarkan kepadaku [Kharijah bin Tsabit] dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam telah memberikan keringanan untuk menjual 'araya (ruthab atau anggur di atas pohon) dengan kurma dan ruthab. "
            },
            {
                "number": 2841,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ عُيَيْنَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ التَّمْرِ بِالتَّمْرِ وَرَخَّصَ فِي الْعَرَايَا أَنْ تُبَاعَ بِخَرْصِهَا يَأْكُلُهَا أَهْلُهَا رُطَبًا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah?], telah menceritakan kepada kami [Ibnu 'Uyainah] dari [Yahya bin Sa'id] dari [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual kurma dengan kurma, dan memberikan keringanan dalam 'araya (ruthab atau anggur di atas pohon) yang dijual dengan menaksirnya, yang dimakan pemiliknya dalam keadaan berupa ruthab. "
            },
            {
                "number": 2842,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا مَالِكٌ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ مَوْلَى ابْنِ أَبِي أَحْمَدَ قَالَ أَبُو دَاوُد وَقَالَ لَنَا الْقَعْنَبِيُّ فِيمَا قَرَأَ عَلَى مَالِكٍ عَنْ أَبِي سُفْيَانَ وَاسْمُهُ قُزْمَانُ مَوْلَى ابْنِ أَبِي أَحْمَدَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ فِي بَيْعِ الْعَرَايَا فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ أَوْ فِي خَمْسَةِ أَوْسُقٍ شَكَّ دَاوُدُ بْنُ الْحُصَيْنِقَالَ أَبُو دَاوُد حَدِيثُ جَابِرٍ إِلَى أَرْبَعَةِ أَوْسُقٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] telah menceritakan kepada kami [Malik] dari [Daud bin Al Hushain] dari [mantan budak Ibnu Abu Ahmad]. Abu Daud berkata; Al Qo'naby berkata kepada kami dari riwayat yang dia baca kepada Malik dari Abu Sufyan dan namanya adalah Quzman budak Ibnu Abi Ahmad dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam telah memberikan keringanan untuk menjual 'araya kurang dari lima wasaq atau seukuran lima wasaq. Daud bin Al Hushain merasa ragu. Abu Daud berkata; hadits Jabir mengatakan; hingga empat wasaq. "
            },
            {
                "number": 2843,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ الْأَنْصَارِيِّ أَنَّهُ قَالَالْعَرِيَّةُ الرَّجُلُ يُعْرِي النَّخْلَةَ أَوْ الرَّجُلُ يَسْتَثْنِي مِنْ مَالِهِ النَّخْلَةَ أَوْ الِاثْنَتَيْنِ يَأْكُلُهَا فَيَبِيعُهَا بِتَمْرٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Al Hamdani] telah menceritakan kepada kami [Ibnu Wahb], ia berkata; telah mengabarkan kepadaku [Amr bin Al Harits] dari [Abdu Rabbihi bin Sa'id Al Anshari] bahwa ia berkata; 'ariyah adalah seseorang menyewakan pohon kurma atau seseorang mengecualikan satu atau dua pohon kurma dari hartanya yang ia makan dan menjualnya dengan kurma. "
            },
            {
                "number": 2844,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ عَبْدَةَ عَنْ ابْنِ إِسْحَقَ قَالَالْعَرَايَا أَنْ يَهَبَ الرَّجُلُ لِلرَّجُلِ النَّخَلَاتِ فَيَشُقُّ عَلَيْهِ أَنْ يَقُومَ عَلَيْهَا فَيَبِيعُهَا بِمِثْلِ خَرْصِهَا",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari] dari [Abdah] dari [Ibnu Ishaq] ia berkata; 'araya adalah seseorang memberikan beberapa pohon kurma kepada seseorang, kemudian orang-orang tersebut merasa terganggu dengan apa yang dilakukan orang yang diberi tersebut terhadap beberapa pohon kurma tersebut, kemudian ia membelinya dengan seukuran penaksiran buah yang ada di pohon tersebut. "
            },
            {
                "number": 2845,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثِّمَارِ حَتَّى يَبْدُوَ صَلَاحُهَا نَهَى الْبَائِعَ وَالْمُشْتَرِيَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi], dari [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam melarang menjual buah hingga nampak kelayakannya, beliau melarang penjual dan pembeli. "
            },
            {
                "number": 2846,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا ابْنُ عُلَيَّةَ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ النَّخْلِ حَتَّى يَزْهُوَ وَعَنْ السُّنْبُلِ حَتَّى يَبْيَضَّ وَيَأْمَنَ الْعَاهَةَ نَهَى الْبَائِعَ وَالْمُشْتَرِيَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Ibnu 'Ulayyah] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual pohon kurma hingga matang (buahnya), dan dari menjual bulir hingga berwarna putih dan aman dari musibah, beliau melarang penjual dan pembeli. "
            },
            {
                "number": 2847,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ بْنِ خُمَيْرٍ عَنْ مَوْلًى لِقُرَيْشٍ عَنْ أَبِي هُرَيْرَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْغَنَائِمِ حَتَّى تُقَسَّمَ وَعَنْ بَيْعِ النَّخْلِ حَتَّى تُحْرَزَ مِنْ كُلِّ عَارِضٍ وَأَنْ يُصَلِّيَ الرَّجُلُ بِغَيْرِ حِزَامٍ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar An Namari] telah menceritakan kepada kami [Syu'bah] dari [Yazid? bin Khumair] dari [mantan budak Quraisy] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari menjual rampasan perang hingga dibagi, dan dari menjual pohon kurma hingga terjaga dari musibah yang datang dan seseorang melakukan sholat tanpa mengikat pakaian. "
            },
            {
                "number": 2848,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سَلِيمِ بْنِ حَيَّانَ أَخْبَرَنَا سَعِيدُ بْنُ مِينَاءَ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُبَاعَ الثَّمَرَةُ حَتَّى تُشْقِحَ قِيلَ وَمَا تُشْقِحُ قَالَ تَحْمَارُّ وَتَصْفَارُّ وَيُؤْكَلُ مِنْهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Khallad Al Bahili] telah menceritakan kepada kami [Yahya bin Sa'id], dari [Salim bin Hayyan] telah mengabarkan kepada kami [Sa'id bin Mina`], ia berkata; aku mendengar [Jabir bin Abdullah] berkata; Rasulullah shallallahu 'alaihi wasallam melarang menjual buah hingga hingga tusyqif. Ia ditanya apa makna tusyqif? Ia berkata; memerah dan menguning dan dapat dimakan. "
            },
            {
                "number": 2849,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو الْوَلِيدِ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ حُمَيْدٍ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْعِنَبِ حَتَّى يَسْوَدَّ وَعَنْ بَيْعِ الْحَبِّ حَتَّى يَشْتَدَّ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Abu Al Walid] dari [Hammad bin Salamah] dari [Humaid] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam melarang menjual anggur hingga menghitam, dan (melarang) menjual biji hingga mengeras. "
            },
            {
                "number": 2850,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَنْبَسَةُ بْنُ خَالِدٍ حَدَّثَنِي يُونُسُ قَالَ سَأَلْتُ أَبَا الزِّنَادِ عَنْ بَيْعِ الثَّمَرِ قَبْلَ أَنْ يَبْدُوَ صَلَاحُهُ وَمَا ذُكِرَ فِي ذَلِكَ فَقَالَ كَانَ عُرْوَةُ بْنُ الزُّبَيْرِ يُحَدِّثُ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَكَانَ النَّاسُ يَتَبَايَعُونَ الثِّمَارَ قَبْلَ أَنْ يَبْدُوَ صَلَاحُهَا فَإِذَا جَدَّ النَّاسُ وَحَضَرَ تَقَاضِيهِمْ قَالَ الْمُبْتَاعُ قَدْ أَصَابَ الثَّمَرَ الدُّمَانُ وَأَصَابَهُ قُشَامٌ وَأَصَابَهُ مُرَاضٌ عَاهَاتٌ يَحْتَجُّونَ بِهَا فَلَمَّا كَثُرَتْ خُصُومَتُهُمْ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَالْمَشُورَةِ يُشِيرُ بِهَا فَإِمَّا لَا فَلَا تَتَبَايَعُوا الثَّمَرَةَ حَتَّى يَبْدُوَ صَلَاحُهَا لِكَثْرَةِ خُصُومَتِهِمْ وَاخْتِلَافِهِمْ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami ['Anbasah bin Khalid] telah menceritakan kepadaku [Yunus], ia berkata; aku bertanya kepada [Abu Az Zinad] mengenai penjualan buah sebelum nampak kelayakannya, dan apa yang diceritakan mengenai hal tersebut. Ia berkata; ['Urwah bin Az Zubair] menceritakan dari [Sahl bin Abu Hatsmah] dari [Zaid bin Tsabit], ia berkata; dahulu orang-orang saling berjual beli buah sebelum nampak kelayakannya. Kemudian apabila orang-orang telah memotong kurma, dan telah hadir tuntutan hutang mereka, maka pembeli berkata; buahnya telah membusuk, dan telah mengering serta terkena penyakit dan bencana. Mereka berhujjah dengannya, kemudian tatkala telah banyak perselisihan mereka di sisi Nabi shallallahu 'alaihi wasallam maka Rasulullah shallallahu 'alaihi wasallam bersabda seperti suatu isyarat yang beliau tunjukkan, apabila tidak maka beliau mengatakan: \"Janganlah kalian berjual beli buah hingga, nampak kelayakannya!\" karena banyak perselisihan dan perbedaan mereka. "
            },
            {
                "number": 2851,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ الطَّالَقَانِيُّ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الثَّمَرِ حَتَّى يَبْدُوَ صَلَاحُهُ وَلَا يُبَاعُ إِلَّا بِالدِّينَارِ أَوْ بِالدِّرْهَمِ إِلَّا الْعَرَايَا",
                "id": "Telah menceritakan kepada kami [Ishaq bin Isma'il Ath Thalaqni], telah menceritakan kepada kami [Sufyan] dari [Ibnu Juraij] dari ['Atha`] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam melarang dari menjual buah hingga nampak kelayakannya, dan tidak dijual kecual dengan dinar atau dirham kecuali 'araya. "
            },
            {
                "number": 2852,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَيَحْيَى بْنُ مَعِينٍ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ حُمَيْدٍ الْأَعْرَجِ عَنْ سُلَيْمَانَ بْنِ عَتِيقٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ السِّنِينَ وَوَضَعَ الْجَوَائِحَقَالَ أَبُو دَاوُد لَمْ يَصِحَّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الثُّلُثِ شَيْءٌ وَهُوَ رَأْيُ أَهْلِ الْمَدِينَةِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Yahya bin Ma'in], mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Humaid Al A'raj] dari [Sulaiman bin 'Atiq] dari [Jabir bin Abdullah] bahwa Nabi shallallahu 'alaihi wasallam melarang menjual sinin (menjual buah kurma untuk beberapa tahun sebelum nampak buahnya), dan beliau menggugurkan jual beli lantaran terdapat bencana yang menimpa tanaman."
            },
            {
                "number": 2853,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ أَبِي الزُّبَيْرِ وَسَعِيدِ بْنِ مِينَاءَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْمُعَاوَمَةِ وَقَالَ أَحَدُهُمَا بَيْعُ السِّنِينَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Abu Az Zubair] dan [Sa'id bin Mina`] dari [Jabir bin Abdullah], bahwa Nabi shallallahu 'alaihi wasallam melarang dari mu'awamah (menjual kurma di pohon untuk beberapa tahun sebelum nampak). Sedang salah seorang dari mereka berdua mengatakan; menjual sinin. "
            },
            {
                "number": 2854,
                "arab": "حَدَّثَنَا أَبُو بَكْرٍ وَعُثْمَانُ ابْنَا أَبِي شَيْبَةَ قَالَا حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ عُبَيْدِ اللَّهِ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ الْغَرَرِزَادَ عُثْمَانُ وَالْحَصَاةِ",
                "id": "Telah menceritakan kepada kami [Abu Bakr] dan [Utsman] dua anak Abu Syaibah?, mereka berkata; telah menceritakan kepada kami [Ibnu Idris] dari ['ubaidhullah] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam melarang menjual secara ghaghar (transaksi jual beli yang mengandung unsur ketidakjelasan, penipuan, pertaruhan, dan hal-hal yang merugikan), sedang Utsman menambahkan dan hashah (transaksi jual beli yang dilakukan oleh dua orang tetapi barangnya belum jelas, kemudian untuk menentukannya salah satu dari mereka melempar hashat (kerikil), maka barang yang terkena kerikil itulah yang dijual). "
            },
            {
                "number": 2855,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَأَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ وَهَذَا لَفْظُهُ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعَتَيْنِ وَعَنْ لِبْسَتَيْنِ أَمَّا الْبَيْعَتَانِ فَالْمُلَامَسَةُ وَالْمُنَابَذَةُ وَأَمَّا اللِّبْسَتَانِ فَاشْتِمَالُ الصَّمَّاءِ وَأَنْ يَحْتَبِيَ الرَّجُلُ فِي ثَوْبٍ وَاحِدٍ كَاشِفًا عَنْ فَرْجِهِ أَوْ لَيْسَ عَلَى فَرْجِهِ مِنْهُ شَيْءٌحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ زَادَ وَاشْتِمَالُ الصَّمَّاءِ أَنْ يَشْتَمِلَ فِي ثَوْبٍ وَاحِدٍ يَضَعُ طَرَفَيْ الثَّوْبِ عَلَى عَاتِقِهِ الْأَيْسَرِ وَيُبْرِزُ شِقَّهُ الْأَيْمَنَ وَالْمُنَابَذَةُ أَنْ يَقُولَ إِذَا نَبَذْتُ إِلَيْكَ هَذَا الثَّوْبَ فَقَدْ وَجَبَ الْبَيْعُ وَالْمُلَامَسَةُ أَنْ يَمَسَّهُ بِيَدِهِ وَلَا يَنْشُرُهُ وَلَا يُقَلِّبُهُ فَإِذَا مَسَّهُ وَجَبَ الْبَيْعُ حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَنْبَسَةُ بْنُ خَالِدٍ حَدَّثَنَا يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى حَدِيثِ سُفْيَانَ وَعَبْدِ الرَّزَّاقِ جَمِيعًا",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Ahmad bin 'Amr bin As Sarh], dan ini adalah lafazhnya. Mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari ['Atha` bin Yazid? Al Laitsi] dari [Abu Sa'id Al Khudri] bahwa Nabi shallallahu 'alaihi wasallam melarang dari dua macam jual beli dan dua pakaian. Adapun dua macam jual beli yaitu mulamasah (jual beli pakaian yang dilakukan oleh dua orang dengan cara menyentuhnya (lams) dari luar tanpa membukanya dan tidak mengetahui apa yang ada di dalamnya) dan munabadzah (seseorang berkata; lemparkan kepadaku apa yang ada padamu dan aku akan melemparkan sesuatu yang ada padaku, dan hal tersebut dianggap sebagai proses jual beli). Adapun dua pakaian adalah isytimal shamma` (melilitkan pakaian yang tidak ada tempat keluar untuk tangan) dan seseorang membungkus dirinya dengan satu kain dan membuka kemaluannya atau tidak ada sesuatupun kain yang menutupi kemaluannya. Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri], dari ['Atha` bin Yazid? Al Laitsi] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini. Ia menambahkan; dan isytimal shama` adalah berselimut dalam satu kain, meletakkan dua ujung kain pada pundaknya sebelah kiri, dan membuka sebelah kanan. Sedangkan munabadzah adalah dengan mengatakan; apabila aku lemparkan kepadamu pakaian ini maka telah sah jual beli. Dan mulamasah adalah menyentuh kain dengan tangannya dan tidak membukanya serta membalikkannya. Apabila ia menyentuhnya maka telah sah jual beli. Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami ['Anbasah bin Khalid], telah menceritakan kepada kami [Yunus] dari [Ibnu Syihab], ia berkata; telah mengabarkan kepadaku ['Amir bin Sa'dan bin Abu Waqqash] bahwa [Abu Sa'id Al Khudri] berkata; Rasulullah shallallahu 'alaihi wasallam telah melarang dengan makna hadits Sufyan dan Abdurrazzaq seluruhnya. "
            },
            {
                "number": 2856,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ حَبَلِ الْحَبَلَةِحَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ و قَالَ وَحَبَلُ الْحَبَلَةِ أَنْ تُنْتَجَ النَّاقَةُ بَطْنَهَا ثُمَّ تَحْمِلُ الَّتِي نُتِجَتْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari menjual habalil hablah. Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Yahya] dari [ubaidhullah] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam seperti itu. Dan perowi berkata; habalul hablah yaitu seekor unta hamil kemudian janinnya hamil. "
            },
            {
                "number": 2857,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا صَالِحُ بْنُ عَامِرٍ قَالَ أَبُو دَاوُد كَذَا قَالَ مُحَمَّدٌ حَدَّثَنَا شَيْخٌ مِنْ بَنِي تَمِيمٍ قَالَخَطَبَنَا عَلِيُّ بْنُ أَبِي طَالِبٍ أَوْ قَالَ قَالَ عَلِيٌّ قَالَ ابْنُ عِيسَى هَكَذَا حَدَّثَنَا هُشَيْمٌ قَالَ سَيَأْتِي عَلَى النَّاسِ زَمَانٌ عَضُوضٌ يَعَضُّ الْمُوسِرُ عَلَى مَا فِي يَدَيْهِ وَلَمْ يُؤْمَرْ بِذَلِكَ قَالَ اللَّهُ تَعَالَى{ وَلَا تَنْسَوْا الْفَضْلَ بَيْنَكُمْ }وَيُبَايِعُ الْمُضْطَرُّونَ وَقَدْ نَهَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الْمُضْطَرِّ وَبَيْعِ الْغَرَرِ وَبَيْعِ الثَّمَرَةِ قَبْلَ أَنْ تُدْرِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Shalih bin 'Amir], Abu Daud berkata; demikianlah yang dikatakan Muhammad, telah menceritakan kepada kami [Syaikh] dari Bani Tamim, ia berkata; [Ali bin Abu Thalib] berkhutbah kepada kami, -atau ia mengatakan; Ali berkata; …. Ibnu Isa berkata; demikianlah Husyaim menceritakan kepada kami, ia berkata; akan datang kepada manusia suatu zaman yang menggigit, orang yang berkelapangan menggigit apa yang ada pada keduanya dan tidak diperintahkan untuk itu. Allah Ta'ala berfirman: \"Dan janganlah kalian melupakan keutamaan diantara kalian.\" Dan orang-orang yang terdesak (dalam kondisi terpaksa) melakukan jual beli, sementara Nabi shallallahu 'alaihi wasallam telah melarang dari penjualan orang yang terdesak (dalam kondisi terpaksa), serta penjualan secara gharar (menipu), dan menjual buah sebelum sampai waktunya. "
            },
            {
                "number": 2858,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْمِصِّيصِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ الزِّبْرِقَانِ عَنْ أَبِي حَيَّانَ التَّيْمِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ رَفَعَهُ قَالَإِنَّ اللَّهَ يَقُولُ أَنَا ثَالِثُ الشَّرِيكَيْنِ مَا لَمْ يَخُنْ أَحَدُهُمَا صَاحِبَهُ فَإِذَا خَانَهُ خَرَجْتُ مِنْ بَيْنِهِمَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Mishshishi], telah menceritakan kepada kami [Muhammad bin Az Zibriqan], dari [Abu Hayyan At Taimi], dari [ayahnya] dari [Abu Hurairah] dan ia merafa'kannya. Ia berkata; sesungguhnya Allah berfirman: \"Aku adalah pihak ketiga dari dua orang yang bersekutu, selama tidak ada salah seorang diantara mereka yang berkhianat kepada sahabatnya. Apabila ia telah mengkhianatinya, maka aku keluar dari keduanya.\""
            },
            {
                "number": 2859,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ شَبِيبِ بْنِ غَرْقَدَةَ حَدَّثَنِي الْحَيُّ عَنْ عُرْوَةَ يَعْنِي ابْنَ أَبِي الْجَعْدِ الْبَارِقِيَّ قَالَأَعْطَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِينَارًا يَشْتَرِي بِهِ أُضْحِيَّةً أَوْ شَاةً فَاشْتَرَى شَاتَيْنِ فَبَاعَ إِحْدَاهُمَا بِدِينَارٍ فَأَتَاهُ بِشَاةٍ وَدِينَارٍ فَدَعَا لَهُ بِالْبَرَكَةِ فِي بَيْعِهِ كَانَ لَوْ اشْتَرَى تُرَابًا لَرَبِحَ فِيهِحَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ حَدَّثَنَا أَبُو الْمُنْذِرِ حَدَّثَنَا سَعِيدُ بْنُ زَيْدٍ هُوَ أَخُو حَمَّادِ بْنِ زَيْدٍ حَدَّثَنَا الزُّبَيْرُ بْنُ الْخِرِّيتِ عَنْ أَبِي لَبِيدٍ حَدَّثَنِي عُرْوَةُ الْبَارِقِيُّ بِهَذَا الْخَبَرِ وَلَفْظُهُ مُخْتَلِفٌ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Sufyan] dari [Syabib bin Qarqadah], telah menceritakan kepadaku [Al Hayyu] dari ['Urwah bin Abu Al Ja'dan Al Bariqi], ia berkata; Nabi shallallahu 'alaihi wasallam telah memberinya uang satu dinar agar ia belikan satu ekor hewan kurban atau satu ekor kambing. Kemudian ia membeli dua ekor kambing lalu ia menjual salah satunya dengan harga satu dinar. Kemudian ia datang kepada beliau dengan membawa satu ekor kambing dan uang satu dinar. Kemudian beliau mendo'akannya agar mendapatkan berkah dalam jual belinya. Ia apabila membeli tanah niscaya mendapatkan keuntungan. Telah menceritakan kepada kami [Al Hasan bin Ash Shabbah], telah menceritakan kepada kami [Abu Al Mundzir], telah menceritakan kepada kami [Sa'id bin Zaid yaitu saudara Hammad bin Zaid], telah menceritakan kepada kami [Az Zubair bin Al Khirrit], dari [Abu Labid] telah menceritakan kepadaku [Urwah Al Bariqi] dengan hadits ini dan lafazhnya diperselisihkan. "
            },
            {
                "number": 2860,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ الْعَبْدِيُّ أَخْبَرَنَا سُفْيَانُ حَدَّثَنِي أَبُو حُصَيْنٍ عَنْ شَيْخٍ مِنْ أَهْلِ الْمَدِينَةِ عَنْ حَكِيمِ بْنِ حِزَامٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ مَعَهُ بِدِينَارٍ يَشْتَرِي لَهُ أُضْحِيَّةً فَاشْتَرَاهَا بِدِينَارٍ وَبَاعَهَا بِدِينَارَيْنِ فَرَجَعَ فَاشْتَرَى لَهُ أُضْحِيَّةً بِدِينَارٍ وَجَاءَ بِدِينَارٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَصَدَّقَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدَعَا لَهُ أَنْ يُبَارَكَ لَهُ فِي تِجَارَتِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir Al 'Abdi], telah mengabarkan kepada kami [Sufyan], telah menceritakan kepadaku [Abu Hushain], dari [seorang syekh dari penduduk Madinah] dari [Hakim bin Hizam] bahwa Rasulullah shallallahu 'alaihi wasallam telah mengutus dengan membawa uang satu dinar agar ia belikan satu ekor hewan kurban. Kemudian ia membelinya dengan harga satu dinar, dan ia menjualnya seharga dua dinar, lalu ia kembali dan membeli seekor hewan kurban dengan harga satu dinar. Dan ia datang dengan membawa satu uang dinar kepada Nabi shallallahu 'alaihi wasallam. kemudian Nabi shallallahu 'alaihi wasallam mensedekahkan uang tersebut dan mendo'akannya agar diberi berkah dalam perdagangannya. "
            },
            {
                "number": 2861,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا عُمَرُ بْنُ حَمْزَةَ أَخْبَرَنَا سَالِمُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ اسْتَطَاعَ مِنْكُمْ أَنْ يَكُونَ مِثْلَ صَاحِبِ فَرْقِ الْأَرُزِّ فَلْيَكُنْ مِثْلَهُ قَالُوا وَمَنْ صَاحِبُ فَرْقِ الْأَرُزِّ يَا رَسُولَ اللَّهِ فَذَكَرَ حَدِيثَ الْغَارِ حِينَ سَقَطَ عَلَيْهِمْ الْجَبَلُ فَقَالَ كُلُّ وَاحِدٍ مِنْهُمْ اذْكُرُوا أَحْسَنَ عَمَلِكُمْ قَالَ وَقَالَ الثَّالِثُ اللَّهُمَّ إِنَّكَ تَعْلَمُ أَنِّي اسْتَأْجَرْتُ أَجِيرًا بِفَرْقِ أَرُزٍّ فَلَمَّا أَمْسَيْتُ عَرَضْتُ عَلَيْهِ حَقَّهُ فَأَبَى أَنْ يَأْخُذَهُ وَذَهَبَ فَثَمَّرْتُهُ لَهُ حَتَّى جَمَعْتُ لَهُ بَقَرًا وَرِعَاءَهَا فَلَقِيَنِي فَقَالَ أَعْطِنِي حَقِّي فَقُلْتُ اذْهَبْ إِلَى تِلْكَ الْبَقَرِ وَرِعَائِهَا فَخُذْهَا فَذَهَبَ فَاسْتَاقَهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`], telah menceritakan kepada kami [Abu Usamah], telah menceritakan kepada kami [Umar bin Hamzah] telah mengabarkan kepada kami [Salim bin Abdullah] dari [ayahnya] ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa diantara kalian yang mampu seperti takaran beras, maka hendaknya ia menjadi seperti dia!\" Mereka bertanya; siapakah pemilik takaran beras itu Rasulullah? Kemudian beliau menyebutkan kisah gua ketika meruntuhi mereka, kemudian setiap mereka berkata; ingatlah amalan kalian yang terbaik! Beliau mengatakan: \"Dan orang yang ketiga berkata; ya Allah, engkau mengetahui bahwa aku telah mempekerjakan orang dengan upah satu farq beras. Kemudian tatkala sore hari aku memberikan haknya kepadanya. Namun ia menolak untuk mengambil, dan ia pergi. Kemudian aku mengembangkan untuknya aku dapat mengumpulkan sapi dan para penggembalanya. Lalu ia mendatangiku dan berkata; berikan hakku kepadaku! Lalu aku katakan; pergilah kepada sapi-sapi itu dan para penggembalanya, dan ambillah! Lalu ia pergi dan menggiring sapi-sapi tersebut.\""
            },
            {
                "number": 2862,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا يَحْيَى حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ قَالَاشْتَرَكْتُ أَنَا وَعَمَّارٌ وَسَعْدٌ فِيمَا نُصِيبُ يَوْمَ بَدْرٍ قَالَ فَجَاءَ سَعْدٌ بِأَسِيرَيْنِ وَلَمْ أَجِئْ أَنَا وَعَمَّارٌ بِشَيْءٍ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz], telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Abu 'Ubaidah] dari [Abdullah] ia berkata; aku dan 'Ammar serta Sa'd bersekutu pada apa yang kami dapatkan ketika perang Badr, Abdullah berkata; kemudian Sa'd membawa dua orang tawanan sementara aku dan 'Ammar tidak membawa sesuatu pun. "
            },
            {
                "number": 2863,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ سَمِعْتُ ابْنَ عُمَرَ يَقُولُمَا كُنَّا نَرَى بِالْمُزَارَعَةِ بَأْسًا حَتَّى سَمِعْتُ رَافِعَ بْنَ خَدِيجٍ يَقُولُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهَا فَذَكَرْتُهُ لِطَاوُسٍ فَقَالَ قَالَ لِي ابْنُ عَبَّاسٍ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَنْهَ عَنْهَا وَلَكِنْ قَالَ لَأَنْ يَمْنَحَ أَحَدُكُمْ أَرْضَهُ خَيْرٌ مِنْ أَنْ يَأْخُذَ عَلَيْهَا خَرَاجًا مَعْلُومًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Sufyan] dari ['Amr bin Dinar], ia berkata; aku mendengar [Ibnu Umar] berkata; kami menganggap muzara'ah adalah sesuatu yang diperbolehkan hingga aku mendengar Rafi' bin Khadij berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah melarang darinya. Kemudian aku ceritakan hal tersebut kepada Thawus. Lalu ia berkata; Ibnu Abba berkata kepadaku; sesungguhnya Rasulullah shallallahu 'alaihi wasallam tidak melarang darinya. Akan tetapi beliau bersabda: \"Sungguh, salah seorang diantara kalian memberikan tanahnya kepada saudaranya adalah lebih baik daripada ia mengambil upah tertentu atas tanah tersebut.\""
            },
            {
                "number": 2864,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ عُلَيَّةَ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا بِشْرٌ الْمَعْنَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ بْنِ مُحَمَّدِ بْنِ عَمَّارٍ عَنْ الْوَلِيدِ بْنِ أَبِي الْوَلِيدِ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ قَالَقَالَ زَيْدُ بْنُ ثَابِتٍ يَغْفِرُ اللَّهُ لِرَافِعِ بْنِ خَدِيجٍ أَنَا وَاللَّهِ أَعْلَمُ بِالْحَدِيثِ مِنْهُ إِنَّمَا أَتَاهُ رَجُلَانِ قَالَ مُسَدَّدٌ مِنْ الْأَنْصَارِ ثُمَّ اتَّفَقَا قَدْ اقْتَتَلَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ كَانَ هَذَا شَأْنَكُمْ فَلَا تُكْرُوا الْمَزَارِعَزَادَ مُسَدَّدٌ فَسَمِعَ قَوْلَهُ لَا تُكْرُوا الْمَزَارِعَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah?], telah menceritakan kepada kami [Ibnu 'Ulayyah], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Bisyr] secara makna, dari [Abdurrahman bin Ishaq] dari [Abu 'Ubaidah bin Muhammad bin 'Ammar] dari [Al Walid bin Abu Al Walid], dari ['Urwah bin Az Zubair], ia berkata; [Zaid bin Tsabit] berkata; semoga Allah mengampuni Rafi' bin Khudaij, demi Allah aku lebih mengetahui hadits daripadanya. Sesungguhnya terdapat dua orang yang datang kepada beliau. -Musaddad berkata; dari kalangan anshar-. Kemudian lafazh mereka sama: saling bermusuhan. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila hal ini adalah kemauan kalian, maka janganlah kalian menyewakan lahan pertanian!\" Musaddad menambahkan; maka ia mendengar perkataan beliau: \"Janganlah kalian menyewakan lahan pertanian!\""
            },
            {
                "number": 2865,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ مُحَمَّدِ بْنِ عِكْرِمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَبِيبَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ سَعْدٍ قَالَكُنَّا نُكْرِي الْأَرْضَ بِمَا عَلَى السَّوَاقِي مِنْ الزَّرْعِ وَمَا سَعِدَ بِالْمَاءِ مِنْهَا فَنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ وَأَمَرَنَا أَنْ نُكْرِيَهَا بِذَهَبٍ أَوْ فِضَّةٍ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah?], telah menceritakan kepada kami [Yazid? bin Harun] telah mengabarkan kepada kami [Ibrahim bin Sa'd] dari [Muhammad bin Ikrimah bin Abdurrahman bin Al Harits bin Hisyam] dari [Muhammad bin Abdurrahman bin Abu Labibah] dari [Sa'id bin Al Musayyab], dari [Sa'd] ia berkata; dahulu kami menyewakan tanah dengan upah tanaman yang tumbuh di atas sungai-sungai kecil serta sungai-sungai yang mengalir airnya tersebut. Kemudian Rasulullah shallallahu 'alaihi wasallam melarang kami dari hal tersebut dan beliau memerintahkan kami untuk menyewakannya dengan upah emas atau perak. "
            },
            {
                "number": 2866,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عِيسَى حَدَّثَنَا الْأَوْزَاعِيُّ ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ كِلَاهُمَا عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ وَاللَّفْظُ لِلْأَوْزَاعِيِّ حَدَّثَنِي حَنْظَلَةُ بْنُ قَيْسٍ الْأَنْصَارِيُّ قَالَسَأَلْتُ رَافِعَ بْنَ خَدِيجٍ عَنْ كِرَاءِ الْأَرْضِ بِالذَّهَبِ وَالْوَرِقِ فَقَالَ لَا بَأْسَ بِهَا إِنَّمَا كَانَ النَّاسُ يُؤَاجِرُونَ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَا عَلَى الْمَاذِيَانَاتِ وَأَقْبَالِ الْجَدَاوِلِ وَأَشْيَاءَ مِنْ الزَّرْعِ فَيَهْلَكُ هَذَا وَيَسْلَمُ هَذَا وَيَسْلَمُ هَذَا وَيَهْلَكُ هَذَا وَلَمْ يَكُنْ لِلنَّاسِ كِرَاءٌ إِلَّا هَذَا فَلِذَلِكَ زَجَرَ عَنْهُ فَأَمَّا شَيْءٌ مَضْمُونٌ مَعْلُومٌ فَلَا بَأْسَ بِهِوَحَدِيثُ إِبْرَاهِيمَ أَتَمُّ و قَالَ قُتَيْبَةُ عَنْ حَنْظَلَةَ عَنْ رَافِعٍ قَالَ أَبُو دَاوُد رِوَايَةُ يَحْيَى بْنِ سَعِيدٍ عَنْ حَنْظَلَةَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi], telah mengabarkan kepada kami [Isa], telah menceritakan kepada kami [Al Auza'i], dan telah diriwayatkan dari jalur yang lain: Dan telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits], keduanya berasal dari [Rabi'ah bin Abu Abdurrahman], sedangkan lafazhnya adalah lafazh Al Auza'i. telah menceritakan kepadaku [Hanzhalah bin Qais Al Anshari], ia berkata; aku bertanya kepada [Rafi' bin Khadij] mengenai penyewaan tanah dengan emas dan perak. Kemudian ia berkata; tidak mengapa. Sesungguhnya orang-orang dahulu pada masa Rasulullah shallallahu 'alaihi wasallam menyewakan dengan upah apa yang tumbuh di kedua sisi saluran air, dan rumput-rumput sungai serta berbagai hal dari pertanian. Kemudian ada yang rusak dan ada yang baik, dan orang-orang tidak memiliki cara menyewakan kecuali seperti ini. Oleh karena itu beliau melarang dari hal tersebut. Adapun sesuatu yang terjamin dan diketahui maka tidak mengapa. Dan hadits Ibrahim lebih sempurna. Qutaibah berkata; dari Hanzhalah, dari Rafi'. Abu Daud berkata; riwayat Yahya bin Sa'id dari Hanzhalah seperti ini. "
            },
            {
                "number": 2867,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ مَالِكٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ حَنْظَلَةَ بْنِ قَيْسٍأَنَّهُ سَأَلَ رَافِعَ بْنَ خَدِيجٍ عَنْ كِرَاءِ الْأَرْضِ فَقَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كِرَاءِ الْأَرْضِ فَقَالَ أَبِالذَّهَبِ وَالْوَرِقِ فَقَالَ أَمَّا بِالذَّهَبِ وَالْوَرِقِ فَلَا بَأْسَ بِهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Malik] dari [Rabi'ah bin Abu Abdurrahman] dari [Hanzhalah bin Qais] bahwa ia bertanya kepada [Rafi' bin Khadij] mengenai penyewaan tanah. Kemudian ia berkata; Rasulullah shallallahu 'alaihi wasallam telah melarang dari penyewaan tanah. Kemudian Hanzhalah berkata; apakah (boleh) jika dilakukan dengan upah emas dan perak? Rafi' berkata; adapun dengan upah emas dan perak, maka tidak mengapa. "
            },
            {
                "number": 2868,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ حَدَّثَنِي أَبِي عَنْ جَدِّي اللَّيْثِ حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ ابْنَ عُمَرَ كَانَ يَكْرِي أَرْضَهُ حَتَّى بَلَغَهُ أَنَّ رَافِعَ بْنَ خَدِيجٍ الْأَنْصَارِيَّ حَدَّثَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَنْهَى عَنْ كِرَاءِ الْأَرْضِ فَلَقِيَهُ عَبْدُ اللَّهِ فَقَالَ يَا ابْنَ خَدِيجٍ مَاذَا تُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي كِرَاءِ الْأَرْضِ قَالَ رَافِعٌ لِعَبْدِ اللَّهِ بْنِ عُمَرَ سَمِعْتُ عَمَّيَّ وَكَانَا قَدْ شَهِدَا بَدْرًا يُحَدِّثَانِ أَهْلَ الدَّارِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كِرَاءِ الْأَرْضِ قَالَ عَبْدُ اللَّهِ وَاللَّهِ لَقَدْ كُنْتُ أَعْلَمُ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الْأَرْضَ تُكْرَى ثُمَّ خَشِيَ عَبْدُ اللَّهِ أَنْ يَكُونَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْدَثَ فِي ذَلِكَ شَيْئًا لَمْ يَكُنْ عَلِمَهُ فَتَرَكَ كِرَاءَ الْأَرْضِقَالَ أَبُو دَاوُد رَوَاهُ أَيُّوبُ وَعُبَيْدُ اللَّهِ وَكَثِيرُ بْنُ فَرْقَدٍ وَمَالِكٌ عَنْ نَافِعٍ عَنْ رَافِعٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَوَاهُ الْأَوْزَاعِيُّ عَنْ حَفْصِ بْنِ عِنَانٍ الْحَنَفِيِّ عَنْ نَافِعٍ عَنْ رَافِعٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَذَلِكَ رَوَاهُ زَيْدُ بْنُ أَبِي أُنَيْسَةَ عَنْ الْحَكَمِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ أَتَى رَافِعًا فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ نَعَمْ وَكَذَا قَالَ عِكْرِمَةُ بْنُ عَمَّارٍ عَنْ أَبِي النَّجَاشِيِّ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْهِ الصَّلَاة وَالسَّلَامُ وَرَوَاهُ الْأَوْزَاعِيُّ عَنْ أَبِي النَّجَاشِيِّ عَنْ رَافِعِ بْنِ خَدِيجٍ عَنْ عَمِّهِ ظُهَيْرِ بْنِ رَافِعٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو دَاوُد أَبُو النَّجَاشِيِّ عَطَاءُ بْنُ صُهَيْبٍ",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin Syu'aib bin Al Laits], telah menceritakan kepadaku [ayahku] dari [kakekku yaitu Al Laits], telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab], telah mengabarkan kepadaku [Salim bin Abdullah bin Umar] bahwa [Ibnu Umar] dahulu menyewakan tanahnya hingga sampai kepadanya bahwa [Rafi' bin Khadij Al Anshari] telah menceritakan bahwa Rasulullah shallallahu 'alaihi wasallam telah melarang menyewakan tanah, kemudian Abdullah bertemu dengannya dan berkata; wahai Ibnu Khadij, apa yang engkau ceritakan dari Rasulullah shallallahu 'alaihi wasallam mengenai penyewaan tanah? Rafi' berkata kepada Abdullah bin Umar; aku mendengar [dua pamanku] dan mereka adalah orang-orang yang menghadiri perang Badr, mereka menceritakan kepada penghuni rumah bahwa Rasulullah shallallahu 'alaihi wasallam melarang dari penyewaan tanah. Abdullah berkata; Demi Allah, sungguh pada masa Rasulullah shallallahu 'alaihi wasallam aku mengetahui bahwa tanah boleh disewakan. Kemudian Abdullah khawatir Rasulullah shallallahu 'alaihi wasallam telah melakukan sesuatu yang baru yang tidak ia ketahui. Maka ia meninggalkan penyewaan tanah. Abu Daud berkata; hadits tersebut diriwayatkan oleh [Ayyub], ['ubaidhullah], [Katsir bin Farqad], dan [Malik] dari [Nafi'] dari [Rafi'] dari Nabi shallallahu 'alaihi wasallam. Dan telah diriwayatkan oleh [Al Auza'i] dari [Hafsh bin 'Inan Al Hanafi], dari [Nafi'], dari [Rafi'], ia berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam ….. Dan begitu juga diriwayatkan oleh [Zaid bin Abu Unaisah], dari [Al Hakam] dari [Nafi'] dari [Ibnu Umar] bahwa ia datang kepada [Rafi'] dan berkata; apakah engkau mendengar Rasulullah shallallahu 'alaihi wasallam? kemudian ia berkata; ya. Dan begitulah yang dikatakan [Ikrimah bin 'Ammar] dari [Abu An Najasyi] dari [Rafi' bin Khadij], ia berkata; saya mendengar Nabi shallallahu 'alaihi wasallam. Dan telah diriwayatkan oleh [Al Auza'i] dari [Abu An Najasyi] dari [Rafi' bin Khadij] dari [pamannya yaitu Zhahir bin Rafi'] dari Nabi shallallahu 'alaihi wasallam. Abu Daud berkata; Abu An Najasyi adalah 'Atha` bin Shuhaib."
            },
            {
                "number": 2869,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا سَعِيدٌ عَنْ يَعْلَى بْنِ حَكِيمٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ أَنَّ رَافِعَ بْنَ خَدِيجٍ قَالَكُنَّا نُخَابِرُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ أَنَّ بَعْضَ عُمُومَتِهِ أَتَاهُ فَقَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَمْرٍ كَانَ لَنَا نَافِعًا وَطَوَاعِيَةُ اللَّهِ وَرَسُولِهِ أَنْفَعُ لَنَا وَأَنْفَعُ قَالَ قُلْنَا وَمَا ذَاكَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَتْ لَهُ أَرْضٌ فَلْيَزْرَعْهَا أَوْ فَلْيُزْرِعْهَا أَخَاهُ وَلَا يُكَارِيهَا بِثُلُثٍ وَلَا بِرُبُعٍ وَلَا بِطَعَامٍ مُسَمًّىحَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ قَالَ كَتَبَ إِلَيَّ يَعْلَى بْنُ حَكِيمٍ أَنِّي سَمِعْتُ سُلَيْمَانَ بْنَ يَسَارٍ بِمَعْنَى إِسْنَادِ عُبَيْدِ اللَّهِ وَحَدِيثِهِ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Umar bin Maisarah], telah menceritakan kepada kami [Khalid bin Al Harits], telah menceritakan kepada kami [Sa'id] dari [Ya'laa bin Hakim], dari [Sulaiman bin Yasar] bahwa [Rafi' bin Khadij] berkata; dahulu kami pernah melakukan mukhabarah (menyewakan tanah kepada petani dengan upah sebagian hasil bumi seperti sepertiga atau seperempat) pada masa Rasulullah shallallahu 'alaihi wasallam. kemudian ia menyebutkan bahwa [sebagian pamannya] datang kepadanya dan berkata; Rasulullah shallallahu 'alaihi wasallam telah melarang dari suatu perkara yang dahulu memberikan manfaat kepada kami sedangkan mentaati Allah dan RasulNya adalah lebih bermanfaat bagi kita. Rafi' berkata; maka kami katakan; apakah itu? Ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang memiliki tanah maka hendaknya ia menanamnya atau meminta saudaranya untuk menanamnya, dan tidak menyewakannya dengan sepertiga dan seperempat dan tidak pula dengan upah makanan tertentu.\" Telah menceritakan kepada kami [Muhammad bin 'Ubaid], telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub], ia berkata; [Ya'laa] menulis surat kepadaku; bahwa aku telah mendengar [Sulaiman bin Yasar], dengan makna sanad 'ubaidhullah dan haditsnya. "
            },
            {
                "number": 2870,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عُمَرُ بْنُ ذَرٍّ عَنْ مُجَاهِدٍ عَنْ ابْنِ رَافِعِ بْنِ خَدِيجٍ عَنْ أَبِيهِ قَالَجَاءَنَا أَبُو رَافِعٍ مِنْ عِنْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَمْرٍ كَانَ يَرْفُقُ بِنَا وَطَاعَةُ اللَّهِ وَطَاعَةُ رَسُولِهِ أَرْفَقُ بِنَا نَهَانَا أَنْ يَزْرَعَ أَحَدُنَا إِلَّا أَرْضًا يَمْلِكُ رَقَبَتَهَا أَوْ مَنِيحَةً يَمْنَحُهَا رَجُلٌ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah?], telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami [Umar bin Dzar] dari [Mujahid] dari [Ibnu Rafi' bin Khadij], dari [ayahnya], ia berkata; [Abu Rafi'] telah datang kepada kami dari sisi Rasulullah shallallahu 'alaihi wasallam kemudian berkata; Rasulullah shallallahu 'alaihi wasallam melarang kami dari suatu perkara yang beliau berikan keringanan kepada kami, dan ketaatan kepada Allah serta RasulNya lebih ringan bagi kami. Beliau melarang salah seorang diantara kami untuk menanam kecuali tanah yang ia miliki atau pemberian yang telah diberikan seseorang kepadanya. "
            },
            {
                "number": 2871,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ أَنَّ أُسَيْدَ بْنَ ظُهَيْرٍ قَالَجَاءَنَا رَافِعُ بْنُ خَدِيجٍ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَاكُمْ عَنْ أَمْرٍ كَانَ لَكُمْ نَافِعًا وَطَاعَةُ اللَّهِ وَطَاعَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْفَعُ لَكُمْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَاكُمْ عَنْ الْحَقْلِ وَقَالَ مَنْ اسْتَغْنَى عَنْ أَرْضِهِ فَلْيَمْنَحْهَا أَخَاهُ أَوْ لِيَدَعْقَالَ أَبُو دَاوُد وَهَكَذَا رَوَاهُ شُعْبَةُ وَمُفَضَّلُ بْنُ مُهَلْهَلٍ عَنْ مَنْصُورٍ قَالَ شُعْبَةُ أُسَيْدٌ ابْنُ أَخِي رَافِعِ بْنِ خَديِجٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Sufyan] dari [Manshur], dari [Mujahid] bahwa [Usaid bin Zhuhair] berkata; [Rafi' bin Khudaij] telah datang kepada kami dan berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah melarang kalian dari suatu perkara yang dahulu memberikan manfaat kepada kalian, sedang ketaatan kepada Allah dan Rasulullah shallallahu 'alaihi wasallam adalah lebih bermanfaat bagi kalian. Sesungguhnya Rasulullah shallallahu 'alaihi wasallam melarang kalian dari haql (menjual gandum dalam bulirnya dengan gandum yang bersih dalam timbangan tertentu), beliau bersabda: \"Barangsiapa yang tidak membutuhkan tanahnya maka hendaknya ia memberikannya kepada saudaranya atau membiarkannya!\" Abu Daud berkata; dan demikianlah hadits tersebut diriwayatkan oleh [Syu'bah] dan [Mufadhdhal bin Muhalhal], dari [Manshur]. Syu'bah berkata; Usaid adalah anak saudara Rafi' bin Khadij. "
            },
            {
                "number": 2872,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى حَدَّثَنَا أَبُو جَعْفَرٍ الْخَطْمِيُّ قَالَ بَعَثَنِي عَمِّي أَنَا وَغُلَامًا لَهُ إِلَى سَعِيدِ بْنِ الْمُسَيَّبِ قَالَفَقُلْنَا لَهُ شَيْءٌ بَلَغَنَا عَنْكَ فِي الْمُزَارَعَةِ قَالَ كَانَ ابْنُ عُمَرَ لَا يَرَى بِهَا بَأْسًا حَتَّى بَلَغَهُ عَنْ رَافِعِ بْنِ خَدِيجٍ حَدِيثٌ فَأَتَاهُ فَأَخْبَرَهُ رَافِعٌ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى بَنِي حَارِثَةَ فَرَأَى زَرْعًا فِي أَرْضِ ظُهَيْرٍ فَقَالَ مَا أَحْسَنَ زَرْعَ ظُهَيْرٍ قَالُوا لَيْسَ لِظُهَيْرٍ قَالَ أَلَيْسَ أَرْضُ ظُهَيْرٍ قَالُوا بَلَى وَلَكِنَّهُ زَرْعُ فُلَانٍ قَالَ فَخُذُوا زَرْعَكُمْ وَرُدُّوا عَلَيْهِ النَّفَقَةَقَالَ رَافِعٌ فَأَخَذْنَا زَرْعَنَا وَرَدَدْنَا إِلَيْهِ النَّفَقَةَ قَالَ سَعِيدٌ أَفْقِرْ أَخَاكَ أَوْ أَكْرِهِ بِالدَّرَاهِمِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Yahya], telah menceritakan kepada kami [Abu Ja'far Al Khathmi], ia berkata; pamanku mengutusku dan budaknya kepada [Sa'id bin Al Muasayyab], ia berkata; kemudian kami mengatakan kepadanya; apakah ada sesuatu yang telah sampai kepadamu mengenai muzara'ah. Ia berkata; dahulu Ibnu Umar melihatnya sebagai sesuatu yang diperbolehkan hingga sampai kepadanya hadits dari [Rafi' bin Khadij], kemudian ia datang kepadanya, lalu Rafi' mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam telah datang kepada Bani Haritsah lalu beliau melihat tanaman di tanah Zhuhair. Kemudian beliau berkata; betapa indah tanaman Zhuhair. Orang-orang berkata; itu bukan milik Zhuhair. Beliau berkata; bukankah itu adalah tanah milik Zhuhair? Mereka berkata; benar, akan tetapi tanamannya adalah tanaman Fulan. Beliau berkata: \"Ambillah tanaman kalian dan kembalikan pembiayaannya kepadanya.\" Rafi' berkata; kemudian kami mengambil tanaman kami dan kami mengembalikan pembiayaan kepadanya. Sa'id berkata; \"Berikan kepada saudaramu atau sewakan dengan upah beberapa dirham!\""
            },
            {
                "number": 2873,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو الْأَحْوَصِ حَدَّثَنَا طَارِقُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَقَالَ إِنَّمَا يَزْرَعُ ثَلَاثَةٌ رَجُلٌ لَهُ أَرْضٌ فَهُوَ يَزْرَعُهَا وَرَجُلٌ مُنِحَ أَرْضًا فَهُوَ يَزْرَعُ مَا مُنِحَ وَرَجُلٌ اسْتَكْرَى أَرْضًا بِذَهَبٍ أَوْ فِضَّةٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu Al Ahwash], telah menceritakan kepada kami [Thariq bin Abdurrahman] dari [Sa'id bin Al Musayyab], dari [Rafi' bin Khadij], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari muhaqalah (menjual gandum dalam bulirnya dengan gandum yang bersih dalam timbangan tertentu), dan muzabanah (menjual kurma kering dengan ruthab, dan menjual anggur dengan kismis secara takaran). Sesungguhnya yang boleh menanam Abu Daud tiga, yaitu: seseorang yang memiliki tanah dan ia yang menanaminya, dan seseorang yang diberi tanah dan ia yang menanami apa yang ia diberikan kepadanya, serta seseorang yang menyewa tanah dengan upah emas atau perak. "
            },
            {
                "number": 2874,
                "arab": "قَالَ أَبُو دَاوُد قَرَأْتُ عَلَى سَعِيدِ بْنِ يَعْقُوبَ الطَّالْقَانِيِّ قُلْتُ لَهُ حَدَّثَكُمْ ابْنُ الْمُبَارَكِ عَنْ سَعِيدٍ أَبِي شُجَاعٍ حَدَّثَنِي عُثْمَانُ بْنُ سَهْلِ بْنِ رَافِعِ بْنِ خَدِيجٍ قَالَإِنِّي لَيَتِيمٌ فِي حِجْرِ رَافِعِ بْنِ خَدِيجٍ وَحَجَجْتُ مَعَهُ فَجَاءَهُ أَخِي عِمْرَانُ بْنُ سَهْلٍ فَقَالَ أَكْرَيْنَا أَرْضَنَا فُلَانَةَ بِمِائَتَيْ دِرْهَمٍ فَقَالَ دَعْهُ فَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كِرَاءِ الْأَرْضِ",
                "id": "Telah berkata Abu Daud; aku membacakan riwayat kepada [Sa'id bin Ya'qub Ath Thalqani], aku katakan kepadanya; telah menceritakan kepada kalian [Ibnu Al Mubarak], dari [Sa'id Abu Syuja'], telah menceritakan kepadaku [Utsman bin Sahl bin Rafi' bin Khadij], ia berkata; sungguh aku dahulu adalah seorang anak yatim di dalam asuhan [Rafi' bin Khadij], dan aku pernah berhaji bersamanya. Kemudian saudara Imran bin Sahl datang kepadanya dan berkata; kami menyewakan tanah kami kepada Fulanah dengan upah dua ratus dirham. Kemudian ia berkata; tinggalkan pekerjaan tersebut, karena sesungguhnya Nabi shallallahu 'alaihi wasallam melarang dari menyewakan tanah. "
            },
            {
                "number": 2875,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ حَدَّثَنَا بُكَيْرٌ يَعْنِي ابْنَ عَامِرٍ عَنْ ابْنِ أَبِي نُعْمٍ حَدَّثَنِي رَافِعُ بْنُ خَدِيجٍأَنَّهُ زَرَعَ أَرْضًا فَمَرَّ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَسْقِيهَا فَسَأَلَهُ لِمَنْ الزَّرْعُ وَلِمَنْ الْأَرْضُ فَقَالَ زَرْعِي بِبَذْرِي وَعَمَلِي لِي الشَّطْرُ وَلِبَنِي فُلَانٍ الشَّطْرُ فَقَالَ أَرْبَيْتُمَا فَرُدَّ الْأَرْضَ عَلَى أَهْلِهَا وَخُذْ نَفَقَتَكَ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah], telah menceritakan kepada kami [Al Fadhl bin Dukain], telah menceritakan kepada kami [Bukair bin Amir] dari [Ibnu Abu Nu'm], telah menceritakan kepadaku [Rafi' bin Khadij], bahwa ia menanami sebuah lahan, kemudian Nabi shallallahu 'alaihi wasallam melewatinya sementara ia sedang mengairi lahan tersebut. Kemudian beliau bertanya: \"Milik siapakah tanaman dan milik siapa tanah itu?\" Kemudian ia berkata; tanam saya dengan benih dan kerja saya, saya mendapatkan setengah bagian, dan Bani Fulan mendapatkan setengah. Kemudian beliau berkata: \"Kalian telah melakukan riba, kembalikan tanah tersebut kepada pemiliknya dan ambillah pembiayaanmu!\""
            },
            {
                "number": 2876,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ عَطَاءٍ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ زَرَعَ فِي أَرْضِ قَوْمٍ بِغَيْرِ إِذْنِهِمْ فَلَيْسَ لَهُ مِنْ الزَّرْعِ شَيْءٌ وَلَهُ نَفَقَتُهُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id], telah menceritakan kepada kami [Syarik] dari [Abu Ishaq], dari ['Atha`] dari [Rafi' bin Khadij], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang menanam di tanah suatu kaum tanpa seizin mereka, maka ia tidak memiliki hak dari tanamannya sedikitpun, dan baginya pembiayaannya.\""
            },
            {
                "number": 2877,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا إِسْمَعِيلُ ح و حَدَّثَنَا مُسَدَّدٌ أَنَّ حَمَّادًا وَعَبْدَ الْوَارِثِ حَدَّثَاهُمْ كُلُّهُمْ عَنْ أَيُّوبَ عَنْ أَبِي الزُّبَيْرِ قَالَ عَنْ حَمَّادٍ وَسَعِيدِ بْنِ مِينَاءَ ثُمَّ اتَّفَقُوا عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُحَاقَلَةِ وَالْمُزَابَنَةِ وَالْمُخَابَرَةِ وَالْمُعَاوَمَةِ قَالَ عَنْ حَمَّادٍ و قَالَ أَحَدُهُمَا وَالْمُعَاوَمَةِ وَقَالَ الْآخَرُ بَيْعُ السِّنِينَ ثُمَّ اتَّفَقُوا وَعَنْ الثُّنْيَا وَرَخَّصَ فِي الْعَرَايَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Isma'il], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Musaddad] bahwa [Hammad] dan [Abdul Warits], telah menceritakan kepada mereka, seluruh mereka dari [Ayyub], dari [Abu Az Zubair], ia berkata; dari [Hammad] dan [Sa'id bin Mina`], dari [Jabir bin Abdullah], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang muhaqalah (menjual gandum dalam bulirnya dengan gandum yang bersih), dan muzabanah (menjual kurma kering dengan ruthab, dan menjual anggur dengan kismis secara takaran), mukhabarah (menyewakan tanah kepada petani dengan upah sebagian hasil bumi seperti sepertiga atau seperempat), dan mu'awamah (menjual buah untuk beberapa tahun sebelum buah tersebut nampak). Sedang yang lainnya mengatakan; bai'us sinin. Kemudian lafazh mereka sama; dan dari tsunya (mengecualikan sesuatu yang tidak jelas dalam jual beli) dan memberikan keringanan dalam hal 'araya (menjual ruthab atau anggur di atas pohon dengan kurma atau kismis dengan menaksirnya). "
            },
            {
                "number": 2878,
                "arab": "حَدَّثَنَا أَبُو حَفْصٍ عُمَرُ بْنُ يَزِيدَ السَّيَّارِيُّ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ عَنْ يُونُسَ بْنِ عُبَيدٍ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُزَابَنَةِ وَالْمُحَاقَلَةِ وَعَنْ الثُّنْيَا إِلَّا أَنْ يُعْلَمَ",
                "id": "Telah menceritakan kepada kami [Abu Hafsh Umar bin Yazid? As Sayyari], telah menceritakan kepada kami ['Abbad bin Al 'Awwam], dari [Sufyan bin Husain], dari [Yunus bin 'Ubaid] dari ['Atha`] dari [Jabir bin Abdullah], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang muzabanah (menjual kurma kering dengan ruthab, dan menjual anggur dengan kismis secara takaran), dan muhaqalah (menjual gandum dalam bulirnya dengan gandum yang bersih) serta tsunya (mengecualikan sesuatu dalam jual beli) kecuali apabila diketahui. "
            },
            {
                "number": 2879,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا ابْنُ رَجَاءٍ يَعْنِي الْمَكِّيَّ قَالَ ابْنُ خُثَيْمٍ حَدَّثَنِي عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ لَمْ يَذَرْ الْمُخَابَرَةَ فَلْيَأْذَنْ بِحَرْبٍ مِنْ اللَّهِ وَرَسُولِهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ma'in], telah menceritakan kepada kami [Ibnu Raja` Al Makki], ia berkata; [Ibnu Khutsaim] menceritakan kepadaku dari [Abu Az Zubair] dari [Jabir bin Abdullah], ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam berkata: \"Barangsiapa yang tidak meninggalkan mukhabarah, maka hendaknya ia mengumumkan peperangan dengan Allah dan RasulNya!\""
            },
            {
                "number": 2880,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عُمَرُ بْنُ أَيُّوبَ عَنْ جَعْفَرِ بْنِ بُرْقَانَ عَنْ ثَابِتِ بْنِ الْحَجَّاجِ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُخَابَرَةِ قُلْتُ وَمَا الْمُخَابَرَةُ قَالَ أَنْ تَأْخُذَ الْأَرْضَ بِنِصْفٍ أَوْ ثُلُثٍ أَوْ رُبْعٍ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah?], telah menceritakan kepada kami [Umar bin Ayyub], dari [Ja'far bin Buqan], dari [Tsabit bin Al Hajjaj], dari [Zaid bin Tsabit], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari mukhabarah. Aku katakan; apakah mukhabrah itu? Ia berkata; engkau mengambil tanah dengan upah setengah atau sepertiga atau seperempat. "
            },
            {
                "number": 2881,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَلَ أَهْلَ خَيْبَرَ بِشَطْرِ مَا يَخْرُجُ مِنْ ثَمَرٍ أَوْ زَرْعٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Yahya], dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam mempekerjakan penduduk Khaibar dengan upah setengah buah atau tanaman yang keluar. "
            },
            {
                "number": 2882,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ اللَّيْثِ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ يَعْنِي ابْنَ غَنَجٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَفَعَ إِلَى يَهُودِ خَيْبَرَ نَخْلَ خَيْبَرَ وَأَرْضَهَا عَلَى أَنْ يَعْتَمِلُوهَا مِنْ أَمْوَالِهِمْ وَأَنَّ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَطْرَ ثَمَرَتِهَا",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id], dari [Al Laits] dari [Muhammad bin Abdurrahman bin Ghanaj] dari [Nafi'] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam menyerahkan pohon kurma dan tanah Khaibar kepada orang-orang yahudi Khaibar, agar mereka mengolahnya dengan modal mereka dan Rasulullah shallallahu 'alaihi wasallam mendapatkan setengah buahnya. "
            },
            {
                "number": 2883,
                "arab": "حَدَّثَنَا أَيُّوبُ بْنُ مُحَمَّدٍ الرَّقِّيُّ حَدَّثَنَا عُمَرُ بْنُ أَيُّوبَ حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ عَنْ مَيْمُونِ بْنِ مِهْرَانَ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ قَالَافْتَتَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْبَرَ وَاشْتَرَطَ أَنَّ لَهُ الْأَرْضَ وَكُلَّ صَفْرَاءَ وَبَيْضَاءَ قَالَ أَهْلُ خَيْبَرَ نَحْنُ أَعْلَمُ بِالْأَرْضِ مِنْكُمْ فَأَعْطِنَاهَا عَلَى أَنَّ لَكُمْ نِصْفَ الثَّمَرَةِ وَلَنَا نِصْفٌ فَزَعَمَ أَنَّهُ أَعْطَاهُمْ عَلَى ذَلِكَ فَلَمَّا كَانَ حِينَ يُصْرَمُ النَّخْلُ بَعَثَ إِلَيْهِمْ عَبْدَ اللَّهِ بْنَ رَوَاحَةَ فَحَزَرَ عَلَيْهِمْ النَّخْلَ وَهُوَ الَّذِي يُسَمِّيهِ أَهْلُ الْمَدِينَةِ الْخَرْصَ فَقَالَ فِي ذِهْ كَذَا وَكَذَا قَالُوا أَكْثَرْتَ عَلَيْنَا يَا ابْنَ رَوَاحَةَ فَقَالَ فَأَنَا أَلِي حَزْرَ النَّخْلِ وَأُعْطِيكُمْ نِصْفَ الَّذِي قُلْتُ قَالُوا هَذَا الْحَقُّ وَبِهِ تَقُومُ السَّمَاءُ وَالْأَرْضُ قَدْ رَضِينَا أَنْ نَأْخُذَهُ بِالَّذِي قُلْتَحَدَّثَنَا عَلِيُّ بْنُ سَهْلٍ الرَّمْلِيُّ حَدَّثَنَا زَيْدُ بْنُ أَبِي الزَّرْقَاءِ عَنْ جَعْفَرِ بْنِ بُرْقَانَ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ فَحَزَرَ وَقَالَ عِنْدَ قَوْلِهِ وَكُلَّ صَفْرَاءَ وَبَيْضَاءَ يَعْنِي الذَّهَبَ وَالْفِضَّةَ لَهُ حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا كَثِيرٌ يَعْنِي ابْنَ هِشَامٍ عَنْ جَعْفَرِ بْنِ بُرْقَانَ حَدَّثَنَا مَيْمُونٌ عَنْ مِقْسَمٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ افْتَتَحَ خَيْبَرَ فَذَكَرَ نَحْوَ حَدِيثِ زَيْدٍ قَالَ فَحَزَرَ النَّخْلَ وَقَالَ فَأَنَا أَلِي جُذَاذَ النَّخْلِ وَأُعْطِيكُمْ نِصْفَ الَّذِي قُلْتُ",
                "id": "Telah menceritakan kepada kami [Ayyub bin Muhammad Ar Raqqi], telah menceritakan kepada kami [Umar bin Ayyub], telah menceritakan kepada kami [Ja'far bin Burqan], dari [Maimun bin Mahran], dari [Miqsam] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam menaklukkan Khaibar dan beliau memberi syarat bahwa tanah dan seluruh emas dan perak adalah untuk beliau. Penduduk Khaibar berkata; kami lebih mengetahui mengenai tanah tersebut daripada kalian, maka berikan kepada kami dan kalian mendapatkan setengah buahnya dan kami mendapatkan setengah. Ibnu Abbas mengaku bahwa beliau memberikan tanah tersebut kepada mereka dengan syarat hal tersebut. Kemudian tatkala telah sampai waktu pemotongan kurma, beliau mengutus kepada mereka Abdullah bin Rawahah. Kemudian ia memperkirakan kurma untuk mereka yang penduduk Madinah namakan khirsh. Kemudian ia berkata; dalam pohon-pohon ini terdapat sekian dan sekian. Mereka berkata; engkau telah memperbanyak atas kami wahai Ibnu Rawahah! Maka ia berkata; aku yang menaksirkan dan memberi kepada kalian setengah yang aku katakan. Mereka berkata; ini adalah benar, dan dengannya langit dan bumi tegak. Kami rela mengambilnya sesuai dengan apa yang engkau katakan. Telah menceritakan kepada kami [Ali bin Sahl Ar Ramli], telah menceritakan kepada kami [Zaid bin Abu Az Zarqa`] dari [Ja'far bin Burqan] dengan sanad dan maknanya. Ia berkata; kemudian Abdullah bin Rawahah menaksir. Dan ia berkata ketika mengatakan; dan seluruh yang kuning dan putih; yaitu emas dan perak untuknya. Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari], telah menceritakan kepada kami [Katsir bin Hisyam] dari [Ja'far bin Burqan], telah menceritakan kepada kami [Maimun] dari [Miqsam], bahwa Nabi shallallahu 'alaihi wasallam ketika menaklukkan Khaibar…. Kemudian ia menyebutkan seperti hadits Zaid. Ia berkata; kemudian ia menaksir pohon kurma tersebut, dan ia berkata; aku yang memotong kurma, dan memberi kalian setengah yang aku katakan. "
            },
            {
                "number": 2884,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ قَالَ أُخْبِرْتُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَبْعَثُ عَبْدَ اللَّهِ بْنَ رَوَاحَةَ فَيَخْرُصُ النَّخْلَ حِينَ يَطِيبُ قَبْلَ أَنْ يُؤْكَلَ مِنْهُ ثُمَّ يُخَيِّرُ يَهُودَ يَأْخُذُونَهُ بِذَلِكَ الْخَرْصِ أَوْ يَدْفَعُونَهُ إِلَيْهِمْ بِذَلِكَ الْخَرْصِ لِكَيْ تُحْصَى الزَّكَاةُ قَبْلَ أَنْ تُؤْكَلَ الثِّمَارُ وَتُفَرَّقَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ma'in], telah menceritakan kepada kami [Hajjaj], dari [Ibnu Juraij], ia berkata; aku telah diberitahu dari [Ibnu Syihab] dari ['Urwah] dari [Aisyah] radliallahu 'anha, ia berkata; Nabi shallallahu 'alaihi wasallam mengutus Abdullah bin Rawahah, dan mentaksirkan kurma ketika telah matang sebelum dimakan. Kemudian ia memberikan pilihan kepada orang-orang yahudi, dan mereka mengambilnya dengan penaksiran tersebut, atau mereka menyerahkan kurma tersebut kepada orang-orang yahudi dengan penaksiaran tersebut, agar zakat dapat dihitung sebelum buah dimakan dan dipisahkan."
            },
            {
                "number": 2885,
                "arab": "حَدَّثَنَا ابْنُ أَبِي خَلَفٍ حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ أَنَّهُ قَالَأَفَاءَ اللَّهُ عَلَى رَسُولِهِ خَيْبَرَ فَأَقَرَّهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا كَانُوا وَجَعَلَهَا بَيْنَهُ وَبَيْنَهُمْ فَبَعَثَ عَبْدَ اللَّهِ بْنَ رَوَاحَةَ فَخَرَصَهَا عَلَيْهِمْحَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ وَمُحَمَّدُ بْنُ بَكْرٍ قَالَا حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ خَرَصَهَا ابْنُ رَوَاحَةَ أَرْبَعِينَ أَلْفَ وَسْقٍ وَزَعَمَ أَنَّ الْيَهُودَ لَمَّا خَيَّرَهُمْ ابْنُ رَوَاحَةَ أَخَذُوا الثَّمَرَ وَعَلَيْهِمْ عِشْرُونَ أَلْفَ وَسْقٍ",
                "id": "Telah menceritakan kepada kami [Ibnu Abu Khalaf], telah menceritakan kepada kami [Muhammad bin Sabiq] dari [Ibrahim bin Thahman] dari [Abu Az Zubair] dari [Jabir] bahwa ia berkata; Allah telah memberikan Khaibar sebagai fai` (harta rampasan tanpa adanya peperangan) kepada RasulNya, kemudian Rasulullah shallallahu 'alaihi wasallam membiarkan mereka sebagaimana dahulu. Dan beliau menjadikan Khaibar hasilnya dibagi antara beliau dan mereka (orang-orang yahudi). Kemudian beliau mengutus Abdullah bin Rawahah, lalu ia menaksirkannya untuk mereka. Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Abdurrazzaq] dan [Muhammad bin Bakr], mereka berkata; Telah menceritakan kepada kami [Ibnu Juraij], telah mengabarkan kepadaku [Abu Az Zubair] bahwa ia mendengar [Jabir bin Abdullah] berkata; Ibnu Rawahah menaksirkan untuk kami empat puluh ribu wasaq. Ia mengaku bahwa orang-orang yahudi tatkala Ibnu Rawahah memberikan pilihan kepada mereka maka mereka mengambil buah dan menanggung dua puluh ribu wasaq. "
            },
            {
                "number": 2886,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الرُّوَاسِيُّ عَنْ مُغِيرَةَ بْنِ زِيَادٍ عَنْ عُبَادَةَ بْنِ نُسَيٍّ عَنْ الْأَسْوَدِ بْنِ ثَعْلَبَةَ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَعَلَّمْتُ نَاسًا مِنْ أَهْلِ الصُّفَّةِ الْكِتَابَ وَالْقُرْآنَ فَأَهْدَى إِلَيَّ رَجُلٌ مِنْهُمْ قَوْسًا فَقُلْتُ لَيْسَتْ بِمَالٍ وَأَرْمِي عَنْهَا فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ لَآتِيَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَأَسْأَلَنَّهُ فَأَتَيْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ رَجُلٌ أَهْدَى إِلَيَّ قَوْسًا مِمَّنْ كُنْتُ أُعَلِّمُهُ الْكِتَابَ وَالْقُرْآنَ وَلَيْسَتْ بِمَالٍ وَأَرْمِي عَنْهَا فِي سَبِيلِ اللَّهِ قَالَ إِنْ كُنْتَ تُحِبُّ أَنْ تُطَوَّقَ طَوْقًا مِنْ نَارٍ فَاقْبَلْهَاحَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ وَكَثِيرُ بْنُ عُبَيْدٍ قَالَا حَدَّثَنَا بَقِيَّةُ حَدَّثَنِي بِشْرُ بْنُ عَبْدِ اللَّهِ بْنِ يَسَارٍ قَالَ عَمْرٌو و حَدَّثَنِي عُبَادَةُ بْنُ نُسَيٍّ عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ عَنْ عُبَادَةَ بْنِ الصَّامِتِ نَحْوَ هَذَا الْخَبَرِ وَالْأَوَّلُ أَتَمُّ فَقُلْتُ مَا تَرَى فِيهَا يَا رَسُولَ اللَّهِ فَقَالَ جَمْرَةٌ بَيْنَ كَتِفَيْكَ تَقَلَّدْتَهَا أَوْ تَعَلَّقْتَهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah?], telah menceritakan kepada kami [Waki'] dan [Humaid bin Abdurrahman Ar Ruwasi], dari [Al Mughirah bin Ziyad] dari ['Ubadah bin Nusai] dari [Al Aswad bin Tsa'labah] dari ['Ubadah bin Ash Shamit] ia berkata; aku mengajari orang-orang ahli Shuffah menulis dan membaca, kemudian terdapat seseorang di antara yang memberiku hadiah sebuah busur panah. Kemudian aku katakan; busur bukanlah sebuah harta, dan aku akan menggunakannya untuk memanah di jalan Allah 'azza wajalla. Sungguh aku akan datang kepada Rasulullah shallallahu 'alaihi wasallam dan bertanya kepada beliau. Kemudian aku datang kepada beliau dan aku katakan; wahai Rasulullah, seorang laki-laki di antara orang-orang yang aku ajari menulis dan membaca telah memberiku hadiah sebuah busur panah, dan busur bukanlah merupakan harta dan aku akan menggunakannya untuk memanah di jalan Allah. Beliau berkata: \"Apabila engkau ingin dikalungi dengan kalung dari api maka terimalah!\" telah menceritakan kepada kami ['Amr bin Utsman] dan [Katsir bin 'Ubaid], mereka berkata; telah menceritakan kepada kami [Baqiyyah], telah menceritakan kepadaku [Bisyr bin Abdullah bin Yasar]. ['Amr] berkata; dan telah menceritakan kepadaku ['Ubadah bin Nusai], dari [Junadah bin Abu Umayyah], dari ['Ubadah bin Ash Shamit], seperti hadits ini. Dan hadits yang pertama lebih sempurna. Kemudian aku katakan; bagaimana pendapat engkau, wahai Rasulullah? Kemudian beliau bersabda: \"Itu adalah bara di antara dua pundakmu, engkau memakainya sebagai kalung atau menggantungkanya.\""
            },
            {
                "number": 2887,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ أَبِي الْمُتَوَكِّلِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَهْطًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْطَلَقُوا فِي سَفْرَةٍ سَافَرُوهَا فَنَزَلُوا بِحَيٍّ مِنْ أَحْيَاءِ الْعَرَبِ فَاسْتَضَافُوهُمْ فَأَبَوْا أَنْ يُضَيِّفُوهُمْ قَالَ فَلُدِغَ سَيِّدُ ذَلِكَ الْحَيِّ فَشَفَوْا لَهُ بِكُلِّ شَيْءٍ لَا يَنْفَعُهُ شَيْءٌ فَقَالَ بَعْضُهُمْ لَوْ أَتَيْتُمْ هَؤُلَاءِ الرَّهْطَ الَّذِينَ نَزَلُوا بِكُمْ لَعَلَّ أَنْ يَكُونَ عِنْدَ بَعْضِهِمْ شَيْءٌ يَنْفَعُ صَاحِبَكُمْ فَقَالَ بَعْضُهُمْ إِنَّ سَيِّدَنَا لُدِغَ فَشَفَيْنَا لَهُ بِكُلِّ شَيْءٍ فَلَا يَنْفَعُهُ شَيْءٌ فَهَلْ عِنْدَ أَحَدٍ مِنْكُمْ شَيْءٌ يَشْفِي صَاحِبَنَا يَعْنِي رُقْيَةً فَقَالَ رَجُلٌ مِنْ الْقَوْمِ إِنِّي لَأَرْقِي وَلَكِنْ اسْتَضَفْنَاكُمْ فَأَبَيْتُمْ أَنْ تُضَيِّفُونَا مَا أَنَا بِرَاقٍ حَتَّى تَجْعَلُوا لِي جُعْلًا فَجَعَلُوا لَهُ قَطِيعًا مِنْ الشَّاءِ فَأَتَاهُ فَقَرَأَ عَلَيْهِ بِأُمِّ الْكِتَابِ وَيَتْفِلُ حَتَّى بَرِئَ كَأَنَّمَا أُنْشِطَ مِنْ عِقَالٍ فَأَوْفَاهُمْ جُعْلَهُمْ الَّذِي صَالَحُوهُ عَلَيْهِ فَقَالُوا اقْتَسِمُوا فَقَالَ الَّذِي رَقَى لَا تَفْعَلُوا حَتَّى نَأْتِيَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَسْتَأْمِرَهُ فَغَدَوْا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرُوا ذَلِكَ لَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَيْنَ عَلِمْتُمْ أَنَّهَا رُقْيَةٌ أَحْسَنْتُمْ وَاضْرِبُوا لِي مَعَكُمْ بِسَهْمٍحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هِشَامُ بْنُ حَسَّانَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَخِيهِ مَعْبَدِ بْنِ سِيرِينَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Abu Al Mutawakkil] dari [Abu Sa'id Al Khudri], bahwa beberapa orang sahabat Rasulullah shallallahu 'alaihi wasallam pergi dalam suatu safar yang mereka lakukan. Kemudian mereka singgah di sebuah kampung diantara kampung-kampung Arab. Lalu mereka bertamu kepada penduduk tersebut, namun mereka enggan untuk menjadikan para sahabat tersebut sebagai tamu. Abu Sa'id berkata; kemudian pemimpin kampung tersebut tersengat. Lalu mereka menyebar untuk mencarikan obat untuknya, namun tidak ada sesutupun yang memberinya manfaat. Kemudian sebagian mereka berkata; seandainya kalian datang kepada orang-orang yang singgah kepada kalian tersebut bisa jadi mereka memiliki sesuatu yang bermanfaat untuk sahabat kalian. Kemudian sebagian mereka berkata; sesungguhnya pemiimpin kami tersengat, kemudian kami menyebar untuk mencarikan obat untuknya, namun tidak ada sesuatupun yang bermanfaat baginya, apakah salah seorang diantara kalian memiliki sesuatu yaitu jampi yang dapat menyembuhkan sahabat kami? Kemudian salah seorang diantara orang-orang tersebut berkata; sungguh aku akan menjampinya, akan tetapi kami bertamu kepada kalian namun kalian menolak untuk menjadikan kami sebagai tamu. Aku tidak akan menjampi hingga kalian memberikan hadiah kepadaku. Kemudian mereka memberikan kepadanya sekelompok kambing. Lalu ia datang kepada orang yang tersengat tersebut dan membacakan padanya Surat Al Fatihah, dan meludah hingga ia sembuh, seolah-olah ia terbebas dari belenggu. Lalu ia memenuhi hadiah yang mereka janjikan. Kemudian para sahabat tersebut membagi kambing tersebut. Kemudian orang yang menjampi berkata; jangan kalian lakukan hingga kita datang kepada Rasulullah shallallahu 'alaihi wasallam dan meminta pendapat beliau. Kemudian mereka pergi kepada Rasulullah shallallahu 'alaihi wasallam dan menceritakan hal tersebut kepada beliau. Lalu beliau berkata: \"Dari mana kalian mengetahui bahwa surat tersebut adalah jampi? Kalian telah berlaku baik, berilah aku bagian bersama kalian!\" Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Yazid? bin Harun], telah mengabarkan kepada kami [Hisyam bin Hassan] dari [Muhammad bin Sirin] dari [saudaranya yaitu Ma'bad bin Sirin] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini. "
            },
            {
                "number": 2888,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ عَنْ الشَّعْبِيِّ عَنْ خَارِجَةَ بْنِ الصَّلْتِ عَنْ عَمِّهِأَنَّهُ مَرَّ بِقَوْمٍ فَأَتَوْهُ فَقَالُوا إِنَّكَ جِئْتَ مِنْ عِنْدِ هَذَا الرَّجُلِ بِخَيْرٍ فَارْقِ لَنَا هَذَا الرَّجُلَ فَأَتَوْهُ بِرَجُلٍ مَعْتُوهٍ فِي الْقُيُودِ فَرَقَاهُ بِأُمِّ الْقُرْآنِ ثَلَاثَةَ أَيَّامٍ غُدْوَةً وَعَشِيَّةً وَكُلَّمَا خَتَمَهَا جَمَعَ بُزَاقَهُ ثُمَّ تَفَلَ فَكَأَنَّمَا أُنْشِطَ مِنْ عِقَالٍ فَأَعْطَوْهُ شَيْئًا فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَهُ لَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلْ فَلَعَمْرِي لَمَنْ أَكَلَ بِرُقْيَةٍ بَاطِلٍ لَقَدْ أَكَلْتَ بِرُقْيَةٍ حَقٍّ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz], telah menceritakan kepada kami [ayahku] telah menceritakan kepada kami [Syu'bah], dari [Abdullah bin Abu As Safar] dari [Asy Sya'bi], dari [Kharijah bin Ash Shalt], dari [pamannya] bahwa ia pernah melewati sebuah kaum, kemudian mereka mendatanginya dan berkata; engkau datang dari sisi orang ini (Rasulullah shallallahu 'alaihi wasallam) dengan membawa kebaikan, maka jampilah orang ini untuk kami! Kemudian mereka membawa orang yang hilang akalnya dalam keadaan terbaring. Lalu paman Kharijah menjampinya dengan Al Fatihah selama tiga hari pagi dan sore, setiap kali ia menyelesaikan membaca Al Fatihah mengumpulkan ludahnya kemudian meludah. Maka orang-orang tersebut seolah-olah telah terlepas dari belenggu. Lalu mereka memberinya sesuatu, kemudian ia datang kepada Nabi shallallahu 'alaihi wasallam dan menceritakan hal kepada beliau. Nabi shallallahu 'alaihi wasallam bersabda: \"Makanlah, sungguh ada orang yang makan dengan jampi yang batil, sementara engkau makan dengan jampi yang benar.\""
            },
            {
                "number": 2889,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ أَخْبَرَنَا أَبَانُ عَنْ يَحْيَى عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ يَعْنِي ابْنَ قَارِظٍ عَنْ السَّائِبِ بْنِ يَزِيدَ عَنْ رَافِعِ بْنِ خَدِيجٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَسْبُ الْحَجَّامِ خَبِيثٌ وَثَمَنُ الْكَلْبِ خَبِيثٌ وَمَهْرُ الْبَغِيِّ خَبِيثٌ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah mengabarkan kepada kami [Aban] dari [Yahya] dari [Ibrahim bin Abdullah bin Qarizh], dari [As Saib bin Yazid?] dari [Rafi' bin Khadij], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penghasilan tukang bekam adalah kotor, dan harga (uang penjualan) anjing adalah kotor, serta upah pelacur adalah kotor.\""
            },
            {
                "number": 2890,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ ابْنِ مُحَيِّصَةَ عَنْ أَبِيهِأَنَّهُ اسْتَأْذَنَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِجَارَةِ الْحَجَّامِ فَنَهَاهُ عَنْهَا فَلَمْ يَزَلْ يَسْأَلُهُ وَيَسْتَأْذِنُهُ حَتَّى أَمَرَهُ أَنْ أَعْلِفْهُ نَاضِحَكَ وَرَقِيقَكَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah], dari [Malik] dari [Ibnu Syihab] dari [Ibnu Muhayyishah] dari [ayahnya] bahwa ia meminta izin kepada Rasulullah shallallahu 'alaihi wasallam untuk menyewakan tukang bekam, kemudian beliau melarangnya. Namun ia terus memohon dan minta izin hingga beliau memerintahkannya: \"Berilah makan untamu yang digunakan untuk mengairi air, serta budakmu!\""
            },
            {
                "number": 2891,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا خَالِدٌ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍقَالَ احْتَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَعْطَى الْحَجَّامَ أَجْرَهُ وَلَوْ عَلِمَهُ خَبِيثًا لَمْ يُعْطِهِ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yazid? bin Zurai'], telah menceritakan kepada kami [Khalid], dari [Ikrimah] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam berbekam dan memberikan upah kepada tukang bekam. Seandainya beliau meyakininya sebagai sesuatu yang buruk, niscaya beliau tidak memberinya. "
            },
            {
                "number": 2892,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ قَالَحَجَمَ أَبُو طَيْبَةَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ لَهُ بِصَاعٍ مِنْ تَمْرٍ وَأَمَرَ أَهْلَهُ أَنْ يُخَفِّفُوا عَنْهُ مِنْ خَرَاجِهِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi], dari [Malik] dari [Humaid Ath Thawil], dari [Anas bin Malik], bahwa ia berkata; Abu Thaibah membekam Rasulullah shallallahu 'alaihi wasallam dan beliau memerintahkan agar ia diberi satu sha' kurma dan memerintahkan para majikannya agar meringankan upeti darinya. "
            },
            {
                "number": 2893,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ جُحَادَةَ قَالَ سَمِعْتُ أَبَا حَازِمٍ سَمِعَ أَبَا هُرَيْرَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كَسْبِ الْإِمَاءِ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz], telah menceritakan kepada kami [ayahku], telah menceritakan kepada kami [Syu'bah], dari [Muhammad bin Juhadah], ia berkata; saya mendengar [Abu Hazim] mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari hasil pelacuran budak wanita. "
            },
            {
                "number": 2894,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا عِكْرِمَةُ حَدَّثَنِي طَارِقُ بْنُ عَبْدِ الرَّحْمَنِ الْقُرَشِيُّ قَالَجَاءَ رَافِعُ بْنُ رِفَاعَةَ إِلَى مَجْلِسِ الْأَنْصَارِ فَقَالَ لَقَدْ نَهَانَا نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْيَوْمَ فَذَكَرَ أَشْيَاءَ وَنَهَى عَنْ كَسْبِ الْأَمَةِ إِلَّا مَا عَمِلَتْ بِيَدِهَا وَقَالَ هَكَذَا بِأَصَابِعِهِ نَحْوَ الْخَبْزِ وَالْغَزْلِ وَالنَّفْشِ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah], telah menceritakan kepada kami [Hasyim bin Al Qasim], telah menceritakan kepada kami [Ikrimah], telah menceritakan kepadaku [Thariq bin Abdurrahman Al Qurasyi], ia berkata; [Rafi' bin Rifa'ah] telah datang ke majelis orang-orang anshar dan berkata; sungguh Nabi shallallahu 'alaihi wasallam telah melarang kami pada hari ini. Kemudian ia menyebutkan beberapa hal. Dan beliau melarang dari hasil kerja budak yang berzina kecuali apa yang ia lakukan dengan tangannya. Dan ia mengucapkannya denangan jari-jarinya seperti membuat roti, memintal dan mengurai wol. "
            },
            {
                "number": 2895,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ عُبَيْدِ اللَّهِ يَعْنِي ابْنَ هُرَيْرٍ عَنْ أَبِيهِ عَنْ جَدِّهِ رَافِعٍ هُوَ ابْنُ خَدِيجٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كَسْبِ الْأَمَةِ حَتَّى يُعْلَمَ مِنْ أَيْنَ هُوَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Ibnu Abu Fudaik] dari ['ubaidhullah bin Hurair] dari [ayahnya] dari [kakeknya yaitu Rafi' bin Khudaij] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari hasil pelacuran budak wanita hingga diketahui dari mana hasil tersebut diperoleh. "
            },
            {
                "number": 2896,
                "arab": "حَدَّثَنَا قُتَيْبَةُ عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَى عَنْ ثَمَنِ الْكَلْبِ وَمَهْرِ الْبَغِيِّ وَحُلْوَانِ الْكَاهِنِ",
                "id": "Telah menceritakan kepada kami [Qutaibah], dari [Sufyan], dari [Az Zuhri], dari [Abu Bakr bin Abdurrahman] dari [Abu Mas'ud] dari Nabi shallallahu 'alaihi wasallam bahwa beliau telah melarang uang hasil dari penjualan anjing, upah pezina, dan upah dukun. "
            },
            {
                "number": 2897,
                "arab": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا إِسْمَعِيلُ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ عَسْبِ الْفَحْلِ",
                "id": "Telah menceritakan kepada kami [Musaddad bin Musarhad], telah menceritakan kepada kami [Isma'il], dari [Ali bin Al Hakam], dari [Nafi'] dari [Ibnu Umar] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang dari upah dari hewan pejantan. "
            },
            {
                "number": 2898,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي مَاجِدَةَ قَالَقَطَعْتُ مِنْ أُذُنِ غُلَامٍ أَوْ قُطِعَ مِنْ أُذُنِي فَقَدِمَ عَلَيْنَا أَبُو بَكْرٍ حَاجًّا فَاجْتَمَعْنَا إِلَيْهِ فَرَفَعَنَا إِلَى عُمَرَ بْنِ الْخَطَّابِ فَقَالَ عُمَرُ إِنَّ هَذَا قَدْ بَلَغَ الْقِصَاصَ ادْعُوا لِي حَجَّامًا لِيَقْتَصَّ مِنْهُ فَلَمَّا دُعِيَ الْحَجَّامُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنِّي وَهَبْتُ لِخَالَتِي غُلَامًا وَأَنَا أَرْجُو أَنْ يُبَارَكَ لَهَا فِيهِ فَقُلْتُ لَهَا لَا تُسَلِّمِيهِ حَجَّامًا وَلَا صَائِغًا وَلَا قَصَّابًاقَالَ أَبُو دَاوُد رَوَى عَبْدُ الْأَعْلَى عَنْ ابْنِ إِسْحَقَ قَالَ ابْنُ مَاجِدَةَ رَجُلٌ مَنْ بَنِي سَهْمٍ عَنْ عُمَرَ بْنِ الْخَطَّابِ حَدَّثَنَا يُوسُفُ بْنُ مُوسَى حَدَّثَنَا سَلَمَةُ بْنُ الْفَضْلِ حَدَّثَنَا ابْنُ إِسْحَقَ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ الْحُرَقِيِّ عَنْ ابْنِ مَاجِدَةَ السَّهْمِيِّ عَنْ عُمَرَ بْنِ الْخَطَّابِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ حَدَّثَنَا الْفَضْلُ بْنُ يَعْقُوبَ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مُحَمَّدِ بْنِ إِسْحَقَ حَدَّثَنَا الْعَلَاءُ بْنُ عَبْدِ الرَّحْمَنِ الْحُرَقِيُّ عَنْ ابْنِ مَاجِدَةَ السَّهْمِيِّ عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad bin Salamah], telah mengabarkan kepada kami [Muhammad bin Ishaq], dari [Al 'Ala` bin Abdurrahman], dari [Abu Majidah] ia berkata; aku telah memotong sebagian dari telinga seorang budak, atau sebagian dari telinga budakku telah terpotong. Kemudian Abu Bakr datang kepada kami dalam keadaan melakukan haji. Kemudian kami berkumpul kepadanya, lalu ia melaporkan kami kepada Umar bin Al Khathab, kemudian [Umar] berkata; sesungguhnya ini telah sampai kepada qishash, panggilkan tukang bekam agar ia membalasnya. Kemudian tatkala tukang bekam tersebut dipanggil ia berkata; aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku telah memberikan kepada bibiku seorang budak, dan aku berharap ia mendapatkan berkah pada diri budak tersebut.\" Kemudian aku katakan kepadanya; janganlah engkau serahkan ia kepada tukang bekam dan tukang pembuat perhiasan serta penjagal! Abu Daud berkata; [Abdul A'laa] telah meriwayatkan dari [Ibnu Ishaq], [Ibnu Majidah] seorang laki-laki dari Bani Sahm berkata; dari [Umar bin Al Khathab]. Telah menceritakan kepada kami [Yusuf bin Musa], telah menceritakan kepada kami [Salamah bin Al Fadhl], telah menceritakan kepada kami [Ibnu Ishaq] dari [Al 'Ala` bin Abdurrahman Al Huraqi], dari [Ibnu Majidah As Sahmi], dan [Umar bin Al Khathab], dari Nabi shallallahu 'alaihi wasallam seperti itu. Telah menceritakan kepada kami [Al Fadhl bin Ya'qub] telah menceritakan kepada kami [Abdul A'la] dari [Muhammad bin Ishaq], telah menceritakan kepada kami [Al 'Alaa bin Abdurrahman Al Huraqi], dari [Ibnu Majidah As Sahmi] dari [Umar bin Al Khathab radliallahu 'anhu] dari Nabi shallallahu 'alaihi wasallam seperti itu. "
            },
            {
                "number": 2899,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ بَاعَ عَبْدًا وَلَهُ مَالٌ فَمَالُهُ لِلْبَائِعِ إِلَّا أَنْ يَشْتَرِطَهُ الْمُبْتَاعُ وَمَنْ بَاعَ نَخْلًا مُؤَبَّرًا فَالثَّمَرَةُ لِلْبَائِعِ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُحَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ عُمَرَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقِصَّةِ الْعَبْدِ وَعَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقِصَّةِ النَّخْلِ قَالَ أَبُو دَاوُد وَاخْتَلَفَ الزُّهْرِيُّ وَنَافِعٌ فِي أَرْبَعَةِ أَحَادِيثَ هَذَا أَحَدُهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Sufyan], dari [Az Zuhri], dari [Salim], dari [ayahnya], dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa yang menjual budak dan budak tersebut memiliki harta, maka hartanya adalah milik penjual, kecuali pembeli mensyaratkannya, dan barangsiapa yang menjual pohon kurma yang telah dikawinkan maka buahnya adalah untuk pembeli, kecuali pembeli mensyaratkannya.\" Telah menceritakan kepada kami [Al Qa'nabi], dari [Malik] dari [Nafi'] dari [Ibnu Umar] dari [Umar] dari Rasulullah shallallahu 'alaihi wasallam dengan kisah seorang budak, dan dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam dengan kisah pohon kurma. Abu Daud berkata; Az Zuhri dan Nafi' berselisih dalam empat hadits. Hadits ini adalah salah satunya. "
            },
            {
                "number": 2900,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ حَدَّثَنِي سَلَمَةُ بْنُ كُهَيْلٍ حَدَّثَنِي مَنْ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ بَاعَ عَبْدًا وَلَهُ مَالٌ فَمَالُهُ لِلْبَائِعِ إِلَّا أَنْ يَشْتَرِطَ الْمُبْتَاعُ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya], dari [Sufyan], telah menceritakan kepadaku [Salamah bin Kuhail], telah menceritakan kepadaku [orang yang mendengar] [Jabir bin Abdullah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang menjual budak dan ia (budak) memiliki harta, maka hartanya adalah milik penjual kecuali pembeli mensyaratkannya.\""
            },
            {
                "number": 2901,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَلَا تَلَقَّوْا السِّلَعَ حَتَّى يُهْبَطَ بِهَا الْأَسْوَاقَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi], dari [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah sebagian dari kalian menjual barang yang masih ada dalam penawaran orang lain, dan janganlah menyambut (membeli) barang hingga sampai ke pasar.\""
            },
            {
                "number": 2902,
                "arab": "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ عَمْرٍو الرَّقِّيَّ عَنْ أَيُّوبَ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ تَلَقِّي الْجَلَبِ فَإِنْ تَلَقَّاهُ مُتَلَقٍّ مُشْتَرٍ فَاشْتَرَاهُ فَصَاحِبُ السِّلْعَةِ بِالْخِيَارِ إِذَا وَرَدَتْ السُّوقَقَالَ أَبُو عَلِيٍّ سَمِعْتُ أَبَا دَاوُدَ يَقُولُ قَالَ سُفْيَانُ لَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ أَنْ يَقُولَ إِنَّ عِنْدِي خَيْرًا مِنْهُ بِعَشَرَةٍ",
                "id": "Telah menceritakan kepada kami [Ar Rabi' bin Nafi' Abu Taubah] telah menceritakan kepada kami ['ubaidhullah bin 'Amr Ar Raqqi], dari [Ayyub] dari [Ibnu Sirin] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam melarang dari menyambut barang dagangan sebelum masuk pasar. Apabila terdapat terdapat pembeli yang menyambutnya kemudian membelinya maka pemilik barang memiliki hak memiliki hak untuk memilih apabila barang tersebut telah sampai ke pasar. Abu Ali berkata; aku saya mendengar Abu Daud berkata; Sufyan berkata; jangan sebagian kalian menjual barang yang masih ada dalam penawaran orang lain, dengan mengatakan; sesungguhnya aku memiliki yang lebih baik daripada itu dengan harga sepuluh. "
            },
            {
                "number": 2903,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَنَاجَشُوا",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Amr bin sarah], telah menceritakan kepada kami [Sufyan] dari [Az Zuhri], dari [Sa'id bin Al Musayyab], dari [Abu Hurairah] ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian melakukan najsy.\" "
            },
            {
                "number": 2904,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا مُحَمَّدُ بْنُ ثَوْرٍ عَنْ مَعْمَرٍ عَنْ ابْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبِيعَ حَاضِرٌ لِبَادٍفَقُلْتُ مَا يَبِيعُ حَاضِرٌ لِبَادٍ قَالَ لَا يَكُونُ لَهُ سِمْسَارًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid], telah menceritakan kepada kami [Muhammad bin Tsaur] dari [Ma'mar] dari [Ibnu Thawus] dari [ayahnya] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang orang yang bermukim (orang kota) menjualkan barang orang yang datang dari desa. Aku katakan apa maksud tidak boleh orang yang bermukim (orang kota) menjualkan barang orang yang datang dari desa? Ia berkata; tidak boleh ia menjadi calo. "
            },
            {
                "number": 2905,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ أَنَّ مُحَمَّدَ بْنَ الزِّبْرِقَانِ أَبَا هَمَّامٍ حَدَّثَهُمْ قَالَ زُهَيْرٌ وَكَانَ ثِقَةً عَنْ يُونُسَ عَنْ الْحَسَنِ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبِيعُ حَاضِرٌ لِبَادٍ وَإِنْ كَانَ أَخَاهُ أَوْ أَبَاهُقَالَ أَبُو دَاوُد سَمِعْت حَفْصَ بْنَ عُمَرَ يَقُولُ حَدَّثَنَا أَبُو هِلَالٍ حَدَّثَنَا مُحَمَّدٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ يُقَالُ لَا يَبِيعُ حَاضِرٌ لِبَادٍ وَهِيَ كَلِمَةٌ جَامِعَةٌ لَا يَبِيعُ لَهُ شَيْئًا وَلَا يَبْتَاعُ لَهُ شَيْئًا",
                "id": "Telah menceritakan kepada kami [Zuhair bin Harb] bahwa [Muhammad bin Az Zibriqan Abu Hammam] telah menceritakan kepada mereka, Zuhair berkata; dan ia adalah orang yang tsiqah, dari [Yunus] dari [Al Hasan] dari [Anas bin Malik] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak boleh orang yang bermukim (orang kota) menjualkan barang orang yang datang dari desa walaupun ia adalah saudaranya atau ayahnya.\" Abu Daud berkata; saya mendengar Hafsh bin Umar berkata; telah menceritakan kepada kami Abu Hilal, telah menceritakan kepada kami Muhammad dari Anas bin Malik ia berkata; dahulu pernah dikatakan; Tidak boleh orang yang bermukim menjualkan orang pelosok. Hal tersebut merupakan sebuah kalimat yang mencakup tidak boleh menjualkan sesuatu untuknya dan tidak boleh membelikan sesuatu untuknya. "
            },
            {
                "number": 2906,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ سَالِمٍ الْمَكِّيِّ أَنَّ أَعْرَابِيًّا حَدَّثَهُأَنَّهُ قَدِمَ بِحَلُوبَةٍ لَهُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَزَلَ عَلَى طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ فَقَالَ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَبِيعَ حَاضِرٌ لِبَادٍ وَلَكِنْ اذْهَبْ إِلَى السُّوقِ فَانْظُرْ مَنْ يُبَايِعُكَ فَشَاوِرْنِي حَتَّى آمُرَكَ أَوْ أَنْهَاكَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Muhammad bin Ishaq], dari [Salim Al Makki] bahwa [seorang badui] telah menceritakan kepadanya bahwa ia datang dengan membawa kambing perahan pada zaman Rasulullah shallallahu 'alaihi wasallam. kemudian ia singgah pada [Thalhah bin 'ubaidhullah], kemudian berkata; sesungguhnya Nabi shallallahu 'alaihi wasallam telah melarang orang yang bermukim (orang kota) menjualkan barang orang yang datang dari desa, akan tetapi pergilah ke pasar dan lihatlah siapakah yang berjual beli denganmu, kemudian mintalah petunjuk kepadaku hingga aku memerintahkan atau melarangmu. "
            },
            {
                "number": 2907,
                "arab": "حَدَّثَنَا عُبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَبِعْ حَاضِرٌ لِبَادٍ وَذَرُوا النَّاسَ يَرْزُقُ اللَّهُ بَعْضَهُمْ مِنْ بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Zuhair], telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah orang yang bermukim 9orang kota) menjualkan barang orang yang datang dari desa. Biarkan orang-orang sebagian mereka Allah beri rizqi dari sebagian yang lain!\""
            },
            {
                "number": 2908,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَلَقَّوْا الرُّكْبَانَ لِلْبَيْعِ وَلَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ وَلَا تُصَرُّوا الْإِبِلَ وَالْغَنَمَ فَمَنْ ابْتَاعَهَا بَعْدَ ذَلِكَ فَهُوَ بِخَيْرِ النَّظَرَيْنِ بَعْدَ أَنْ يَحْلُبَهَا فَإِنْ رَضِيَهَا أَمْسَكَهَا وَإِنْ سَخِطَهَا رَدَّهَا وَصَاعًا مِنْ تَمْرٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik], dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menyambut para pedagang yang datang ke pasar untuk menjual, dan janganlah sebagian kalian menjual barang yang ada dalam penawaran oang lain, dan janganlah menahan kantong susu unta dan kambing (tidak memerahnya agar kelihatan susunya banyak). Barangsiapa yang membelinya setelah itu maka ia memiliki hak memilih antara dua pendapat setelah memerahnya, apabila ia merelakannya maka ia menahannya dan apabila ia tidak merelakannya maka ia mengembalikannya di tambah satu sha' kurma.\""
            },
            {
                "number": 2909,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ وَهِشَامٌ وَحَبِيبٌ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اشْتَرَى شَاةً مُصَرَّاةً فَهُوَ بِالْخِيَارِ ثَلَاثَةَ أَيَّامٍ إِنْ شَاءَ رَدَّهَا وَصَاعًا مِنْ طَعَامٍ لَا سَمْرَاءَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Ayyub] dan [Hisyam] serta [Habib] dari [Muhammad bin Sirin] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membeli kambing yang telah ditahan kantong susunya (tidak diperah), maka ia memiliki hak memilih selama tiga hari. Apabila ia menghendaki maka ia mengembalikannya ditambah satu sha' makanan tidak mesti harus gandum samra`.\""
            },
            {
                "number": 2910,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَخْلَدٍ التَّمِيمِيُّ حَدَّثَنَا الْمَكِّيُّ يَعْنِي ابْنَ إِبْرَاهِيمَ حَدَّثَنَا ابْنُ جُرَيْجٍ حَدَّثَنِي زِيَادٌ أَنَّ ثَابِتًا مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ أَخْبَرَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اشْتَرَى غَنَمًا مُصَرَّاةً احْتَلَبَهَا فَإِنْ رَضِيَهَا أَمْسَكَهَا وَإِنْ سَخِطَهَا فَفِي حَلْبَتِهَا صَاعٌ مِنْ تَمْرٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Makhlad At Taimi], telah menceritakan kepada kami [Al Makki bin Ibrahim], telah menceritakan kepada kami [Ibnu Juraij] telah menceritakan kepadaku [Ziyad] bahwa [Tsabit] mantan budak Abdurrahman bin Zaid telah mengabarkan kepadanya bahwa ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang membeli kambing yang telah ditahan kantong susunya, dan ia telah memerahnya apabila ia merelakannya maka ia menahannya, dan apabila tidak merelakannya maka pengganti susu yang diperah adalah satu sha' kurma.\""
            },
            {
                "number": 2911,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا عَبْدُ الْوَاحِدِ حَدَّثَنَا صَدَقَةُ بْنُ سَعِيدٍ عَنْ جُمَيْعِ بْنِ عُمَيْرٍ التَّيْمِيِّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ ابْتَاعَ مُحَفَّلَةً فَهُوَ بِالْخِيَارِ ثَلَاثَةَ أَيَّامٍ فَإِنْ رَدَّهَا رَدَّ مَعَهَا مِثْلَ أَوْ مِثْلَيْ لَبَنِهَا قَمْحًا",
                "id": "Telah menceritakan kepada kami [Abu Kamil], telah menceritakan kepada kami [Abdul Wahid], telah menceritakan kepada kami [Shadaqah bin Sa'id], dari [Jumai' bin 'Umair At Taimi], ia berkata; aku mendengar [Abdullah bin Umar] berkata; Rasulullah shallallahu 'alaihi wasallam berkata; \"Barangsiapa yang membeli hewan yang tidak diperah susunya, maka ia memiliki hak memilih selama tiga hari, apabila ia mengembalikannya maka ia mengembalikannya disertai gandum seperti susu tersebut atau dua kali susunya.\""
            },
            {
                "number": 2912,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ أَخْبَرَنَا خَالِدٌ عَنْ عَمْرِو بْنِ يَحْيَى عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ مَعْمَرِ بْنِ أَبِي مَعْمَرٍ أَحَدِ بَنِي عَدِيِّ بْنِ كَعْبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحْتَكِرُ إِلَّا خَاطِئٌفَقُلْتُ لِسَعِيدٍ فَإِنَّكَ تَحْتَكِرُ قَالَ وَمَعْمَرٌ كَانَ يَحْتَكِرُ قَالَ أَبُو دَاوُد وَسَأَلْتُ أَحْمَدَ مَا الْحُكْرَةُ قَالَ مَا فِيهِ عَيْشُ النَّاسِ قَالَ أَبُو دَاوُد قَالَ الْأَوْزَاعِيُّ الْمُحْتَكِرُ مَنْ يَعْتَرِضُ السُّوقَ",
                "id": "Telah menceritakan kepada kami [Wahb bin Baqiyyah], telah mengabarkan kepada kami [Khalid] dari ['Amr bin Yahya], dari [Muhammad bin 'Amr bin 'Atho`] dari [Sa'id bin Al Musayyab] dari [Ma'mar bin Abu Ma'mar] salah satu Bani Adi bin Ka'b, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang menimbun barang, kecuali tela berbuat salah.\" Kemudian aku katakan kepada Sa'id; sesungguhnya engkau menimbun. Ia berkata; dan Ma'mar pernah menimbun. Abu Daud berkata; dan aku bertanya kepada Ahmad; apakah hukrah itu? Ia berkata; sesuatu yang padanya terdapat kehidupan manusia. Abu Daud berkata; Al Auza'i berkata; muhtakir adalah orang yang datang ke pasar untuk membeli apa yang dibutuhkan orang-orang dan menyimpannya. "
            },
            {
                "number": 2913,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَيَّاضٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ الْفَيَّاضِ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ قَالَلَيْسَ فِي التَّمْرِ حُكْرَةٌقَالَ ابْنُ الْمُثَنَّى قَالَ عَنْ الْحَسَنِ فَقُلْنَا لَهُ لَا تَقُلْ عَنْ الْحَسَنِ قَالَ أَبُو دَاوُد هَذَا الْحَدِيثُ عِنْدَنَا بَاطِلٌ قَالَ أَبُو دَاوُد كَانَ سَعِيدُ بْنُ الْمُسَيِّبِ يَحْتَكِرُ النَّوَى وَالْخَبَطَ وَالْبِزْرَ و سَمِعْت أَحْمَدَ بْنَ يُونُسَ يَقُولُ سَأَلْتُ سُفْيَانَ عَنْ كَبْسِ الْقَتِّ فَقَالَ كَانُوا يَكْرَهُونَ الْحُكْرَةَ وَسَأَلْتُ أَبَا بَكْرِ بْنَ عَيَّاشٍ فَقَالَ اكْبِسْهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Fayyadh], telah menceritakan kepada kami [ayahku]. Dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Ibnu Al Mutsanna], telah menceritakan kepada kami [Yahya bin Al Fayyadh], telah menceritakan kepada kami [Hammam] dari [Qatadah], ia berkata; tidak ada penimbunan dalam kurma. Ibnu Al Mutsanna berkata dari [Al Hasan], kemudian kami katakan kepadanya; jangan engkau katakan; dari Al Hasan! Abu Daud berkata; hadits ini menurut kami adalah batil. Abu Daud berkata; dahulu Sa'id bin Al Musayyab menimbun biji kurma, dedaunan yang berguguran, serta bebijian. Dan aku mendengar Ahmad bin Yunus berkata; aku mendengar Sufyan mengenai menimbun Al Qatt (jenis tumbuh-tumbuhan), ia berkata; dahulu mereka tidak suka menimbun. Dan aku bertanya kepada Abu Bakr bin 'Ayyasy, kemudian ia berkata; timbunlah! "
            },
            {
                "number": 2914,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ فَضَاءٍ يُحَدِّثُ عَنْ أَبِيهِ عَنْ عَلْقَمَةَ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تُكْسَرَ سِكَّةُ الْمُسْلِمِينَ الْجَائِزَةُ بَيْنَهُمْ إِلَّا مِنْ بَأْسٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Mu'tamir], ia berkata; saya mendengar [Muhammad bin Fadha`] menceritakan dari [ayahnya] dari ['Alqamah bin Abdullah] dari [ayahnya], ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang untuk memecah mata uang muslimin yang diperbolehkan diantara mereka kecuali karena perkara yang mengharuskannya. "
            },
            {
                "number": 2915,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ أَنَّ سُلَيْمَانَ بْنَ بِلَالٍ حَدَّثَهُمْ قَالَ حَدَّثَنِي الْعَلَاءُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَجُلًا جَاءَ فَقَالَ يَا رَسُولَ اللَّهِ سَعِّرْ فَقَالَ بَلْ أَدْعُو ثُمَّ جَاءَهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ سَعِّرْ فَقَالَ بَلْ اللَّهُ يَخْفِضُ وَيَرْفَعُ وَإِنِّي لَأَرْجُو أَنْ أَلْقَى اللَّهَ وَلَيْسَ لِأَحَدٍ عِنْدِي مَظْلَمَةٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Utsman Ad Dimasyqi] bahwa [Sulaiman bin Bilal] telah menceritakan kepada mereka, ia berkata; telah menceritakan kepadaku [Al 'Ala` bin Abdurrahman] dari [ayahnya] dari [Abu Hurairah] bahwa seseorang datang dan berkata; wahai Rasulullah, tetapkanlah harga! Kemudian beliau berkata: \"Allahlah yang menurunkan dan menaikkan, dan sesungguhnya aku berharap untuk bertemu dengan Allah sementara aku tidak memiliki dosa kezhaliman kepada seorangpun.\""
            },
            {
                "number": 2916,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا ثَابِتٌ عَنْ أَنَسِ بْنِ مَالِكٍ وَقَتَادَةُ وَحُمَيْدٌ عَنْ أَنَسٍ قَالَالنَّاسُ يَا رَسُولَ اللَّهِ غَلَا السِّعْرُ فَسَعِّرْ لَنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ هُوَ الْمُسَعِّرُ الْقَابِضُ الْبَاسِطُ الرَّازِقُ وَإِنِّي لَأَرْجُو أَنْ أَلْقَى اللَّهَ وَلَيْسَ أَحَدٌ مِنْكُمْ يُطَالِبُنِي بِمَظْلَمَةٍ فِي دَمٍ وَلَا مَالٍ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah?], telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammad bin Maslamah], telah mengabarkan kepada kami [Tsabit] dari [Anas bin Malik] dan [Qatadah], serta [Humaid] dari [Anas], orang-orang berkata; wahai Rasulullah, harta telah melonjang, maka tetapkanlah harga untuk kami! Maka beliau berkata: \"Sesungguhnya Allahlah yang menentukan harga, Yang menggenggam dan Yang menghamparkan, dan Pemberi rizqi. Dan sungguh aku berharap berjumpa dengan Allah sementara tidak ada seorang pun dari kalian yang menuntutku karena suatu kezhaliman dalam hal darah, dan harta.\""
            },
            {
                "number": 2917,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الْعَلَاءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِرَجُلٍ يَبِيعُ طَعَامًا فَسَأَلَهُ كَيْفَ تَبِيعُ فَأَخْبَرَهُ فَأُوحِيَ إِلَيْهِ أَنْ أَدْخِلْ يَدَكَ فِيهِ فَأَدْخَلَ يَدَهُ فِيهِ فَإِذَا هُوَ مَبْلُولٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ مِنَّا مَنْ غَشَّحَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ عَنْ عَلِيٍّ عَنْ يَحْيَى قَالَ كَانَ سُفْيَانُ يَكْرَهُ هَذَا التَّفْسِيرَ لَيْسَ مِنَّا لَيْسَ مِثْلَنَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Hanbal], telah menceritakan kepada kami [Sufyan bin 'Uyainah], dari [Al 'Ala`] dari [ayahnya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam melewati seorang laki-laki yang membeli makanan, kemudian ia bertanya kepadanya; bagaimana engkau berjualan? Kemudian orang tersebut memberitahukan kepada beliau bagaimana ia berjualan. Kemudian Rasulullah shallallahu 'alaihi wasallam diberi wahyu; masukkan tanganmu ke dalam makanan tersebut! Kemudian beliau memasukkan tangannya ke dalamnya, dan ternyata makanan tersebut basah. Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bukan dari golongan kami orang yang menipu.\""
            },
            {
                "number": 2918,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُتَبَايِعَانِ كُلُّ وَاحِدٍ مِنْهُمَا بِالْخِيَارِ عَلَى صَاحِبِهِ مَا لَمْ يَفْتَرِقَا إِلَّا بَيْعَ الْخِيَارِحَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ قَالَ أَوْ يَقُولُ أَحَدُهُمَا لِصَاحِبِهِ اخْتَرْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang saling berjual beli, keduanya memiliki hak memilih terhadap sahabatnya selama mereka belum berpisah. Kecuali jual beli dengan syarat memiliki hak memilih.\" Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam dengan maknanya, ia berkata; atau salah seorang diantara mereka berdua berkata kepada sahabatnya; pilihlah. "
            },
            {
                "number": 2919,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُتَبَايِعَانِ بِالْخِيَارِ مَا لَمْ يَفْتَرِقَا إِلَّا أَنْ تَكُونَ صَفْقَةَ خِيَارٍ وَلَا يَحِلُّ لَهُ أَنْ يُفَارِقَ صَاحِبَهُ خَشْيَةَ أَنْ يَسْتَقِيلَهُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id], telah menceritakan kepada kami [Al Laits] dari [Ibnu 'Ajlan] dari ['Amr bin Syu'aib] dari [ayahnya] dari [Abdullah bin 'Amr bin Al 'Ash] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang saling berjual beli memiliki hak memilih selama mereka belum berpisah, kecuali jual beli tersebut adalah jual beli dengan syarat adanya hak memilih, dan tidak halal baginya untuk meninggalkan sahabatnya karena khawatir membatalkan jual beli.\""
            },
            {
                "number": 2920,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادٌ عَنْ جَمِيلِ بْنِ مُرَّةَ عَنْ أَبِي الْوَضِيءِ قَالَغَزَوْنَا غَزْوَةً لَنَا فَنَزَلْنَا مَنْزِلًا فَبَاعَ صَاحِبٌ لَنَا فَرَسًا بِغُلَامٍ ثُمَّ أَقَامَا بَقِيَّةَ يَوْمِهِمَا وَلَيْلَتِهِمَا فَلَمَّا أَصْبَحَا مِنْ الْغَدِ حَضَرَ الرَّحِيلُ فَقَامَ إِلَى فَرَسِهِ يُسْرِجُهُ فَنَدِمَ فَأَتَى الرَّجُلَ وَأَخَذَهُ بِالْبَيْعِ فَأَبَى الرَّجُلُ أَنْ يَدْفَعَهُ إِلَيْهِ فَقَالَ بَيْنِي وَبَيْنَكَ أَبُو بَرْزَةَ صَاحِبُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَيَا أَبَا بَرْزَةَ فِي نَاحِيَةِ الْعَسْكَرِ فَقَالَا لَهُ هَذِهِ الْقِصَّةَ فَقَالَ أَتَرْضَيَانِ أَنْ أَقْضِيَ بَيْنَكُمَا بِقَضَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَاقَالَ هِشَامُ بْنُ حَسَّانَ حَدَّثَ جَمِيلٌ أَنَّهُ قَالَ مَا أَرَاكُمَا افْتَرَقْتُمَا",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Hammad] dari [Jamil bin Murrah], dari [Abu Al Wadhi`], ia berkata; kami melakukan peperangan kami, kemudian kami singgah di suatu tempat. Kemudian seorang sahabat kami menjual kuda dengan seorang budak. Kemudian mereka berdua tinggal pada sisa hari dan malam mereka berdua. Kemudian pada keesokan hari pasukan datang, kemudian pergi kepada kudanya untuk memberinya pelana. Maka ia merasa menyesal, lalu ia datang kepada laki-laki pemilik budak tersebut dan ingin membeli kuda tersebut. Lalu laki-laki pemilik budak tersebut menolak untuk menyerahkannya kepadanya. Lalu ia berkata; antaraku dan dirimu terdapat [Abu Barzah] seorang sahabat Nabi shallallahu 'alaihi wasallam. kemudian mereka berdua datang kepada Abu Barzah di pinggir pasukan. Kemudian mereka berdua menceritakan kisah ini kepadanya. Lalu ia berkata; apakah kalian berdua rela aku putuskan diantara kalian berdua dengan keputusan Rasulullah shallallahu 'alaihi wasallam? Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang saling berjual beli memiliki hak memilih selama belum berpisah.\" [Hisyam bin Hassan] berkata; telah menceritakan kepada kami [Jamil] bahwa ia berkata; aku melihat kalian berdua tidak berpisah. "
            },
            {
                "number": 2921,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ الْجَرْجَرَائِيُّ قَالَ مَرْوَانُ الْفَزَارِيُّ أَخْبَرَنَا عَنْ يَحْيَى بْنِ أَيُّوبَ قَالَكَانَ أَبُو زُرْعَةَ إِذَا بَايَعَ رَجُلًا خَيَّرَهُ قَالَ ثُمَّ يَقُولُ خَيِّرْنِي وَيَقُولُ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَفْتَرِقَنَّ اثْنَانِ إِلَّا عَنْ تَرَاضٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Hatim Al Jarjarai], ia berkata; [Marwan Al Fazari] telah mengabarkan kepada kami, dari [Yahya bin Ayyub], ia berkata; [Abu Zur'ah] apabila melakukan jual beli dengan seseorang maka ia memberinya kebebasan memilih. Kemudian ia berkata; berilah aku kebebasan memilih! Dan ia berkata; aku mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah dua orang berpisah kecuali dengan saling rela.\""
            },
            {
                "number": 2922,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَبِي الْخَلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ حَكِيمِ بْنِ حِزَامٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَفْتَرِقَا فَإِنْ صَدَقَا وَبَيَّنَا بُورِكَ لَهُمَا فِي بَيْعِهِمَا وَإِنْ كَتَمَا وَكَذَبَا مُحِقَتْ الْبَرَكَةُ مِنْ بَيْعِهِمَاقَالَ أَبُو دَاوُد وَكَذَلِكَ رَوَاهُ سَعِيدُ بْنُ أَبِي عَرُوبَةَ وَحَمَّادٌ وَأَمَّا هَمَّامٌ فَقَالَ حَتَّى يَتَفَرَّقَا أَوْ يَخْتَارَا ثَلَاثَ مِرَارٍ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Syu'bah], dari [Qatadah] dari [Abu Al Khalil] dari [Abdullah bin Al Harits] dari [Hakim bin Hizam] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua orang yang saling berjual beli memiliki khiyar (hak memilih) selama mereka belum berpisah. Apabila mereka jujur dan memberikan penjelasan (terus terang dalam muamalah mereka), maka mereka akan diberi berkah dalam jual beli mereka. Dan apabila mereka menyembunyikan kekurangan dan berdusta, maka berkah akan terhapus dari jual beli mereka.\" Abu Daud berkata; dan demikianlah hadits tersebut diriwayatkan oleh [Sa'id bin Abu 'Arubah], dan [Hammad]. Adapun [Hammam], ia berkata; hingga mereka berpisah, atau memilih tiga kali. "
            },
            {
                "number": 2923,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا حَفْصٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَقَالَ مُسْلِمًا أَقَالَهُ اللَّهُ عَثْرَتَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ma'in] telah menceritakan kepada kami [Hafsh] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memberikan persetujuan kepada seorang muslim untuk membatalkan jual belinya, maka Allah akan mengapuni kesalahannya.\""
            },
            {
                "number": 2924,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ عَنْ يَحْيَى بْنِ زَكَرِيَّا عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ بَاعَ بَيْعَتَيْنِ فِي بَيْعَةٍ فَلَهُ أَوْكَسُهُمَا أَوْ الرِّبَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dari [Yahya bin Zakaria] dari [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa melakukan dua transaksi dalam satu transaksi maka baginya kekurangannya atau riba.\""
            },
            {
                "number": 2925,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي حَيْوَةُ بْنُ شُرَيْحٍ ح و حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ التِّنِّيسِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَحْيَى الْبُرُلُّسِيُّ حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ عَنْ إِسْحَقَ أَبِي عَبْدِ الرَّحْمَنِ قَالَ سُلَيْمَانُ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْخُرَاسَانِيِّ أَنَّ عَطَاءً الْخُرَاسَانِيَّ حَدَّثَهُ أَنَّ نَافِعًا حَدَّثَهُ عَنْ ابْنِ عُمَرَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا تَبَايَعْتُمْ بِالْعِينَةِ وَأَخَذْتُمْ أَذْنَابَ الْبَقَرِ وَرَضِيتُمْ بِالزَّرْعِ وَتَرَكْتُمْ الْجِهَادَ سَلَّطَ اللَّهُ عَلَيْكُمْ ذُلًّا لَا يَنْزِعُهُ حَتَّى تَرْجِعُوا إِلَى دِينِكُمْقَالَ أَبُو دَاوُد الْإِخْبَارُ لِجَعْفَرٍ وَهَذَا لَفْظُهُ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al Mahri] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Haiwah bin Syuraih]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ja'far bin Musafir At Tinnisi] telah menceritakan kepada kami [Abdullah bin Yahya Al Burullussi] telah menceritakan kepada kami [Haiwah bin Syuraih] dari [Ishaq bin Abu Abdurrahman] dan [Sulaiman] berkata dari [Abu Abdurrahman Al Khurasani] bahwa ['Atha Al Khurasani] menceritakan kepadanya bahwa [Nafi'] telah menceritakan kepadanya dari [Ibnu Umar] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika kalian berjual beli secara cara 'inah, mengikuti ekor sapi, ridla dengan bercocok tanam dan meninggalkan jihad, maka Allah akan menguasakan kehinaan atas kalian. Allah tidak akan mencabutnya dari kalian hingga kalian kembali kepada agama kalian.\" Abu Daud berkata, \"Ini adalah riwayat Ja'far, dan hadits ini adalah lafadznya.\""
            },
            {
                "number": 2926,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ عَبْدِ اللَّهِ بْنِ كَثِيرٍ عَنْ أَبِي الْمِنْهَالِ عَنْ ابْنِ عَبَّاسٍ قَالَقَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وَهُمْ يُسْلِفُونَ فِي التَّمْرِ السَّنَةَ وَالسَّنَتَيْنِ وَالثَّلَاثَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَسْلَفَ فِي تَمْرٍ فَلْيُسْلِفْ فِي كَيْلٍ مَعْلُومٍ وَوَزْنٍ مَعْلُومٍ إِلَى أَجَلٍ مَعْلُومٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Sufyan] dari [Ibnu Najih] dari [Abdullah bin Katsir] dari [Abu Al Minhal] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam datang ke Madinah sementara penduduk Madinah menghutangkan kurma selama satu tahun, dua tahun serta tiga tahun. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menghutangkan kurma, maka hendaknya ia menghutangkan dalam takaran yang diketahui, dan timbangan yang diketahui serta tempo yang diketahui.\"\""
            },
            {
                "number": 2927,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا ابْنُ كَثِيرٍ أَخْبَرَنَا شُعْبَةُ أَخْبَرَنِي مُحَمَّدٌ أَوْ عَبْدُ اللَّهِ بْنُ مُجَالِدٍ قَالَاخْتَلَفَ عَبْدُ اللَّهِ بْنُ شَدَّادٍ وَأَبُو بُرْدَةَ فِي السَّلَفِ فَبَعَثُونِي إِلَى ابْنِ أَبِي أَوْفَى فَسَأَلْتُهُ فَقَالَ إِنْ كُنَّا نُسْلِفُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ فِي الْحِنْطَةِ وَالشَّعِيرِ وَالتَّمْرِ وَالزَّبِيبِ زَادَ ابْنُ كَثِيرٍ إِلَى قَوْمٍ مَا هُوَ عِنْدَهُمْ ثُمَّ اتَّفَقَا وَسَأَلْتُ ابْنَ أَبْزَي فَقَالَ مِثْلَ ذَلِكَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى وَابْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي الْمُجَالِدِ وَقَالَ عَبْدُ الرَّحْمَنِ عَنْ ابْنِ أَبِي الْمُجَالِدِ بِهَذَا الْحَدِيثِ قَالَ عِنْدَ قَوْمٍ مَا هُوَ عِنْدَهُمْ قَالَ أَبُو دَاوُد الصَّوَابُ ابْنُ أَبِي الْمُجَالِدِ وَشُعْبَةُ أَخْطَأَ فِيهِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar] telah menceritakan kepada kami [Syu'bah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Katsir] telah mengabarkan kepada kami [Syu'bah] telah mengabarkan kepadaku [Muhammad atau Abdullah bin Mujalid] ia berkata, \"Abdullah bin Syaddad dan Abu Burdah berselisih mengenai jual beli salaf. Kemudian mereka mengirim aku kepada Ibnu Abu Aufa untuk bertanya kepadanya. [Ibnu Abu Aufa] lalu berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam, Abu Bakar dan Umar kami pernah menjual jewawut, kurma dan kismis secara salaf - [Ibnu Katsir] menambahkan- kepada suatu kaum yang tidak memiliki barang tersebut -Kemudian keduanya sepakat pada lafazh-, dan aku bertanya kepada [Ibnu Abza], lalu ia mengatakan seperti itu.\" Telah menceritakan kepada kami [Muhammad bin Basysyar] Telah menceritakan kepada kami [Yahya] dan [Ibnu Mahdi] mereka berkata; telah menceritakan kepada kami [Syu'bah] dari [Abdullah bin Abu Al Mujalid] dan Abdurrahman menyebutkan hadits ini dari Ibnu Abu Al Mujalid. Ia berkata, \"Pada suatu kaum yang tidak memiliki barang tersebut.\" Abu Daud berkata, \"Yang benar adalah Ibnu Abu Al Mujalid, dan Syu'bah dalam hal ini.\" "
            },
            {
                "number": 2928,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي غَنِيَّةَ حَدَّثَنِي أَبُو إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى الْأَسْلَمِيِّ قَالَغَزَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الشَّامَ فَكَانَ يَأْتِينَا أَنْبَاطٌ مِنْ أَنْبَاطِ الشَّامِ فَنُسْلِفُهُمْ فِي الْبُرِّ وَالزَّيْتِ سِعْرًا مَعْلُومًا وَأَجَلًا مَعْلُومًا فَقِيلَ لَهُ مِمَّنْ لَهُ ذَلِكَ قَالَ مَا كُنَّا نَسْأَلُهُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mushaffa] telah menceritakan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Abdul Malik bin Abu Ghaniyyah] telah menceritakan kepadaku [Abu Ishaq] dari [Abdullah bin Abu Aufa Al Aslami] ia berkata, \"Kami berperang bersama Rasulullah shallallahu 'alaihi wasallam di Syam. Dahulu para pedagang Syam datang kepada kami, lalu kami menjual gandum dan minyak secara salam dengan harga yang diketahui, dan tempo yang diketahui.\" Ia ditanya, \"Dari mana ia mendapatkan riwayat itu?\" Ia menjawab, \"Kami tidak bertanya kepada mereka. "
            },
            {
                "number": 2929,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ رَجُلٍ نَجْرَانِيٍّ عَنْ ابْنِ عُمَرَأَنَّ رَجُلًا أَسْلَفَ رَجُلًا فِي نَخْلٍ فَلَمْ تُخْرِجْ تِلْكَ السَّنَةَ شَيْئًا فَاخْتَصَمَا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بِمَ تَسْتَحِلُّ مَالَهُ ارْدُدْ عَلَيْهِ مَالَهُ ثُمَّ قَالَ لَا تُسْلِفُوا فِي النَّخْلِ حَتَّى يَبْدُوَ صَلَاحُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Abu Ishaq] dari [seorang Najran] dari [Ibnu Umar] bahwa seorang laki-laki telah menjual kurma kepada seseorang secara salaf. Kemudian pada tahun itu, pohon kurma tersebut tidak berbuah sedikitpun. Lalu mereka mengadukan kepada Nabi shallallahu 'alaihi wasallam, beliau lalu menjawab: \"Dengan alasan apakah engkau menghalalkan hartanya? Kembalikan harta tersebut kepadanya!\" Kemudian beliau berkata: \"Janganlah kalian menjual kurma dalam pohon secara salaf hingga nampak kematangannya buah tersebut!\" "
            },
            {
                "number": 2930,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا أَبُو بَدْرٍ عَنْ زِيَادِ بْنِ خَيْثَمَةَ عَنْ سَعْدٍ يَعْنِي الطَّائِيَّ عَنْ عَطِيَّةَ بْنِ سَعْدٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَسْلَفَ فِي شَيْءٍ فَلَا يَصْرِفْهُ إِلَى غَيْرِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Abu Badr] dari [Ziyad bin Khaitsamah] dari [Sa'd Ath Thai] dari ['Athiyyah bin Sa'dan] dari [Abu Sa'id Al Khudri] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjual sesuatu secara salaf, maka janganlah ia mengalihkannya kepada pihak lain.\""
            },
            {
                "number": 2931,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ بُكَيْرٍ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّهُ قَالَأُصِيبَ رَجُلٌ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ثِمَارٍ ابْتَاعَهَا فَكَثُرَ دَيْنُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَصَدَّقُوا عَلَيْهِ فَتَصَدَّقَ النَّاسُ عَلَيْهِ فَلَمْ يَبْلُغْ ذَلِكَ وَفَاءَ دَيْنِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذُوا مَا وَجَدْتُمْ وَلَيْسَ لَكُمْ إِلَّا ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits] dari [Bukair] dari ['Iyadl bin Abdullah] dari [Abu Sa'id Al Khudri] ia berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam ada seorang laki-laki mengalami kerugian pada buah kurma yang ia beli sehingga hutangnya menjadi banyak. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Bersedekahlah kalian kepadanya!\" Maka orang-orang pun bersedekah kepadanya, namun hal itu belum dapat membayar hutangnya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ambillah apa yang kalian dapatkan, kalian tidak memiliki sesutupun kecuali hal tersebut.\""
            },
            {
                "number": 2932,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ وَأَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ قَالَا أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ ح و حَدَّثَنَا مُحَمَّدُ بْنُ مَعْمَرٍ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ الْمَعْنَى أَنَّ أَبَا الزُّبَيْرِ الْمَكِّيَّ أَخْبَرَهُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنْ بِعْتَ مِنْ أَخِيكَ تَمْرًا فَأَصَابَتْهَا جَائِحَةٌ فَلَا يَحِلُّ لَكَ أَنْ تَأْخُذَ مِنْهُ شَيْئًا بِمَ تَأْخُذُ مَالَ أَخِيكَ بِغَيْرِ حَقٍّ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al Mahri] dan [Ahmad bin Sa'id Al Mahdani] mereka berkata; telah mengabarkan kepada kami [Ibnu Wahb] ia berkata; telah mengabarkan kepadaku [Ibnu Juraij]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Ma'mar] telah menceritakan kepada kami [Abu 'Ashim] dari [Ibnu Juraij] secara makna, bahwa [Abu Az Zubair Al Makki] mengabarkan kepadanya dari [Jabir bin Abdullah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila engkau menjual kurma kepada saudaramu kemudian kurma tersebut rusak, maka tidak halal bagimu untuk mengambil sesuatupun darinya, dengan alasan apakah engkau mengambil harta saudaramu tidak dengan hak.\""
            },
            {
                "number": 2933,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عُثْمَانُ بْنُ الْحَكَمِ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ قَالَالْجَوَائِحُ كُلُّ ظَاهِرٍ مُفْسِدٍ مِنْ مَطَرٍ أَوْ بَرَدٍ أَوْ جَرَادٍ أَوْ رِيحٍ أَوْ حَرِيقٍ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Daud Al Mahri] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Utsman bin Al Hakam] dari [Ibnu Juraij] dari ['Atha] ia berkata, \"Jaihah adalah setiap fenomena yang merusak, berupa hujan, musim dingin, belalang atau angin atau kebakaran.\""
            },
            {
                "number": 2934,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عُثْمَانُ بْنُ الْحَكَمِ عَنْ يَحْيَى بْنِ سَعِيدٍ أَنَّهُ قَالَلَا جَائِحَةَ فِيمَا أُصِيبَ دُونَ ثُلُثِ رَأْسِ الْمَالِقَالَ يَحْيَى وَذَلِكَ فِي سُنَّةِ الْمُسْلِمِينَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Daud] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Utsman bin Al Hakam] dari [Yahya bin Sa'id] bahwa ia berkata, \"Tidak disebut jaihah jika musibah yang menimpa tanaman itu kurang dari dari sepertiga modal.\" Yahya berkata, \"Ini adalah sesuatu yang biasa di antara orang-orang Muslim.\" "
            },
            {
                "number": 2935,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُمْنَعُ فَضْلُ الْمَاءِ لِيُمْنَعَ بِهِ الْكَلَأُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak boleh menahan kelebihan air untuk menghalangi tumbuhnya rumput.\""
            },
            {
                "number": 2936,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةٌ لَا يُكَلِّمُهُمْ اللَّهُ يَوْمَ الْقِيَامَةِ رَجُلٌ مَنَعَ ابْنَ السَّبِيلِ فَضْلَ مَاءٍ عِنْدَهُ وَرَجُلٌ حَلَفَ عَلَى سِلْعَةٍ بَعْدَ الْعَصْرِ يَعْنِي كَاذِبًا وَرَجُلٌ بَايَعَ إِمَامًا فَإِنْ أَعْطَاهُ وَفَى لَهُ وَإِنْ لَمْ يُعْطِهِ لَمْ يَفِ لَهُحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ وَلَا يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ وَقَالَ فِي السِّلْعَةِ بِاللَّهِ لَقَدْ أُعْطِيَ بِهَا كَذَا وَكَذَا فَصَدَّقَهُ الْآخَرُ فَأَخَذَهَا",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tiga golongan yang tidak Allah ajak bicara kepada mereka pada Hari Kiamat; seorang laki-laki yang menghalangi Ibnu Sabil untuk mendapatkan kelebihan air yang ada padanya, seorang laki-laki yang bersumpah palsu untuk menjual barang setelah 'Ashar, dan seorang laki-laki yang membai'at seorang imam, apabila Imam tersebut memberi sesuatu kepadanya maka ia penuhi haknya, namun jika Imam tersebut tidak memberi maka ia tidak memenuhi haknya.\" Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dengan sanad dan maknanya. Ia sebutkan, \"Tidak mensucikan mereka dan bagi mereka siksa yang pedih.\" Ia juga menyebutkan, \"(bersumpah) dengan Allah, 'Sungguh aku diberi tawaran sekian dan sekian'. Lalu orang pun percaya dan membelinya.\""
            },
            {
                "number": 2937,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا كَهْمَسٌ عَنْ سَيَّارِ بْنِ مَنْظُورٍ رَجُلٌ مِنْ بَنِي فَزَارَةَ عَنْ أَبِيهِ عَنْ امْرَأَةٍ يُقَالُ لَهَا بُهَيْسَةُ عَنْ أَبِيهَا قَالَتْاسْتَأْذَنَ أَبِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَخَلَ بَيْنَهُ وَبَيْنَ قَمِيصِهِ فَجَعَلَ يُقَبِّلُ وَيَلْتَزِمُ ثُمَّ قَالَ يَا نَبِيَّ اللَّهِ مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ قَالَ الْمَاءُ قَالَ يَا نَبِيَّ اللَّهِ مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ قَالَ الْمِلْحُ قَالَ يَا نَبِيَّ اللَّهِ مَا الشَّيْءُ الَّذِي لَا يَحِلُّ مَنْعُهُ قَالَ أَنْ تَفْعَلَ الْخَيْرَ خَيْرٌ لَكَ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz] telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Kahmas] dari [Sayyar bin Manzhur] seorang laki-laki dari Bani Fazarah, dari [Ayahnya] dari seorang wanita yang dipanggil [Buhaisah] dari [Ayahnya] ia berkata, \"Ayahku minta izin kepada Nabi shallallahu 'alaihi wasallam, kemudian ia masuk di antara badan dan jubahnya, lalu mencium dan merangkulnya. Kemudian ia berkata, \"Wahai Nabi Allah, apakah yang tidak boleh untuk ditahan?\" Beliau menjawab: \"Air.\" Ia bertanya lagi, \"Wahai Nabi Allah, apakah yang tidak boleh untuk ditahan?\" Beliau menjawab: \"Garam.\" Ia bertanya lagi, \"Wahai Nabi Allah, apakah yang tidak boleh untuk ditahan?\" Beliau menjawab: \"Engkau berbuat kebaikan lebih baik bagimu.\""
            },
            {
                "number": 2938,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ اللُّؤْلُؤِيُّ أَخْبَرَنَا حَرِيزُ بْنُ عُثْمَانَ عَنْ حِبَّانَ بْنِ زَيْدٍ الشَّرْعَبِيِّ عَنْ رَجُلٍ مِنْ قَرْنٍ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا حَرِيزُ بْنُ عُثْمَانَ حَدَّثَنَا أَبُو خِدَاشٍ وَهَذَا لَفْظُ عَلِيٍّ عَنْ رَجُلٍ مِنْ الْمُهَاجِرِينَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَغَزَوْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثًا أَسْمَعُهُ يَقُولُ الْمُسْلِمُونَ شُرَكَاءُ فِي ثَلَاثٍ فِي الْكَلَإِ وَالْمَاءِ وَالنَّارِ",
                "id": "Telah menceritakan kepada kami [Ali bin Al Ja'dan Al Lu`lui] telah mengabarkan kepada kami [Hariz bin Utsman] dari [Hibban bin Zaid Asy Syar'i] dari [seorang laki-laki Qarn]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Isa bin Yunus] telah menceritakan kepada kami [Hariz bin Utsman] telah menceritakan kepada kami [Abu Khidasy] dan ini adalah lafazh Ali, dari [seorang laki-laki Muhajirin] sahabat Nabi shallallahu 'alaihi wasallam, ia berkata, \"Aku pernah berperang bersama Nabi shallallahu 'alaihi wasallam tiga kali, aku mendengar beliau bersabda: \"Orang-orang Muslim bersekutu dalam hal rumput, air dan api.\""
            },
            {
                "number": 2939,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ الْعَطَّارُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ أَبِي الْمِنْهَالِ عَنْ إِيَاسِ بْنِ عَبْدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ بَيْعِ فَضْلِ الْمَاءِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Daud bin Abdurrahman Al 'Aththar] dari ['Amru bin Dinar] dari [Abu Al Minhal] dari [Iyas bin Abdu] bahwa Rasulullah shallallahu 'alaihi wasallam melarang menjual kelebihan air.\""
            },
            {
                "number": 2940,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ ح و حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ وَعَلِيُّ بْنُ بَحْرٍ قَالَا حَدَّثَنَا عِيسَى وَقَالَ إِبْرَاهِيمُ أَخْبَرَنَا عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ ثَمَنِ الْكَلْبِ وَالسِّنَّوْرِ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ar Rabi' bin Nafi' Abu Taubah] dan [Ali bin Bahr] mereka berkata; telah menceritakan kepada kami [Isa] dan [Ibrahim] telah mengabarkan kepada kami dari [Al A'masy] dari [Abu Sufyan] dari [Jabir bin Abdullah] bahwa Nabi shallallahu 'alaihi wasallam melarang uang dari hasil penjualan anjing serta kucing.\""
            }
        ]
    }
}