{
    "status": true,
    "data": {
        "start": 2206,
        "end": 2352,
        "total": 147,
        "book": "abu-daud",
        "hadits": [
            {
                "number": 2206,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ يَعْقُوبَ الطَّالْقَانِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ حُمَيْدٍ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ وَأَنْ يَسْتَقْبِلُوا قِبْلَتَنَا وَأَنْ يَأْكُلُوا ذَبِيحَتَنَا وَأَنْ يُصَلُّوا صَلَاتَنَا فَإِذَا فَعَلُوا ذَلِكَ حَرُمَتْ عَلَيْنَا دِمَاؤُهُمْ وَأَمْوَالُهُمْ إِلَّا بِحَقِّهَا لَهُمْ مَا لِلْمُسْلِمِينَ وَعَلَيْهِمْ مَا عَلَى الْمُسْلِمِينَحَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ عَنْ حُمَيْدٍ الطَّوِيلِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمِرْتُ أَنْ أُقَاتِلَ الْمُشْرِكِينَ بِمَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Sa'id? bin Ya'qub Ath Thalqani], telah menceritakan kepada kami [Abdullah bin Al Mubarak] dari [Humaid] dari [Anas], ia berkata; Rasulullah shallallahu 'alaihi wasallam berkata: \"Aku diperintahkan agar memerangi manusia hingga mereka bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah, dan Muhammad adalah hamba dan rasulNya, menghadap ke kiblat kita, makan sembelihan kita, dan melakukan sholat kita. Apabila mereka melakukan hal tersebut maka telah haram atas kita darah dan harta mereka kecuali dengan haknya. Bagi mereka apa yang menjadi hak orang-orang muslim, dan kewajiban mereka apa yang menjadi kewajiban orang-orang muslim.\" Telah menceritakan kepada kami [Sulaiman bin Daud Al Mahri], telah mengabarkan kepada kami [Ibnu Wahb], telah mengabarkan kepadaku [Yahya bin Ayyub], dari [Humaid Ath Thawil], dari [Anas bin Malik], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku diperintahkan untuk memerangi orang-orang musyrik…. Seperti makna hadits tersebut. "
            },
            {
                "number": 2207,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ الْمَعْنَى قَالَا حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ عَنْ الْأَعْمَشِ عَنْ أَبِي ظَبْيَانَ حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ قَالَبَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً إِلَى الْحُرَقَاتِ فَنَذِرُوا بِنَا فَهَرَبُوا فَأَدْرَكْنَا رَجُلًا فَلَمَّا غَشِينَاهُ قَالَ لَا إِلَهَ إِلَّا اللَّهُ فَضَرَبْنَاهُ حَتَّى قَتَلْنَاهُ فَذَكَرْتُهُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ لَكَ بِلَا إِلَهَ إِلَّا اللَّهُ يَوْمَ الْقِيَامَةِ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا قَالَهَا مَخَافَةَ السِّلَاحِ قَالَ أَفَلَا شَقَقْتَ عَنْ قَلْبِهِ حَتَّى تَعْلَمَ مِنْ أَجْلِ ذَلِكَ قَالَهَا أَمْ لَا مَنْ لَكَ بِلَا إِلَهَ إِلَّا اللَّهُ يَوْمَ الْقِيَامَةِ فَمَا زَالَ يَقُولُهَا حَتَّى وَدِدْتُ أَنِّي لَمْ أُسْلِمْ إِلَّا يَوْمَئِذٍ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] dan [Utsman bin Abu Syaibah], secara makna, mereka berkata; telah menceritakan kepada kami [Ya'la bin 'Ubaid] dari [Al A'masy] dari [Abu Zhabyan], telah menceritakan kepada kami [Usamah bin Zaid], ia berkata; Rasulullah shallallahu 'alaihi wasallam mengutus kami dalam kesatuan militer menuju Al Huraqat. Kemudian mereka mengetahui kedatangan kami, lalu mereka melarikan diri. Kemudian kami mendapati seorang laki-laki, dan tatkala kami mengepungnya ia mengucapkan: LAA ILAAHA ILLALLAAH kemudian kami menebasnya hingga kami membunuhnya. Lalu hal tersebut aku ceritakan kepada Nabi shallallahu 'alaihi wasallam, lalu beliau berkata: \"Siapakah yang akan menolongmu apabila LAA ILAAHA ILLALLAAH telah datang pada Hari Kiamat?\" Lalu aku katakan; wahai Rasulullah, sesungguhnya ia mengucapkannya karena takut kepada senjata. Beliau berkata: \"Apakah engkau telah membelah hatinya hingga engkau mengetahui apakah ia mengucapkannya atau tidak? Siapakah yang akan menolongmu apabila LAA ILAAHA ILLALLAAH telah datang pada Hari Kiamat?\" Beliau terus mengucapkan hal tersebut hingga aku berharap bahwa aku belum masuk Islam kecuali pada saat itu. "
            },
            {
                "number": 2208,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ عَنْ اللَّيْثِ عَنْ ابْنِ شِهَابٍ عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَدِيِّ بْنِ الْخِيَارِ عَنْ الْمِقْدَادِ بْنِ الْأَسْوَدِ أَنَّهُ أَخْبَرَهُ أَنَّهُ قَالَيَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ لَقِيتُ رَجُلًا مِنْ الْكُفَّارِ فَقَاتَلَنِي فَضَرَبَ إِحْدَى يَدَيَّ بِالسَّيْفِ ثُمَّ لَاذَ مِنِّي بِشَجَرَةٍ فَقَالَ أَسْلَمْتُ لِلَّهِ أَفَأَقْتُلُهُ يَا رَسُولَ اللَّهِ بَعْدَ أَنْ قَالَهَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقْتُلْهُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّهُ قَطَعَ يَدِي قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقْتُلْهُ فَإِنْ قَتَلْتَهُ فَإِنَّهُ بِمَنْزِلَتِكَ قَبْلَ أَنْ تَقْتُلَهُ وَأَنْتَ بِمَنْزِلَتِهِ قَبْلَ أَنْ يَقُولَ كَلِمَتَهُ الَّتِي قَالَ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dari [Al Laits] dari [Ibnu Syihab] dari ['Atha` bin Yazid? Al Laitsi] dari ['ubaidhullah bin Adi bin Al Khiyar], dari [Al Miqdad bin Al Aswad] bahwa ia telah mengabarkan kepadanya bahwa ia berkata; wahai Rasulullah, bagaimana pendapat engkau apabila aku bertemu orang kafir kemudian ia memerangiku, lalu ia menebas salah satu tanganku dengan pedang, kemudian ia berlindung dariku di sebuah pohon, lalu ia berkata; aku masuk Islam karena Allah. Apakah aku boleh membunuhnya setelah ia mengucapkan hal tersebut wahai Rasulullah? Rasulullah shallallahu 'alaihi wasallam berkata: \"Jangan engkau membunuhnya!\" Kemudian aku katakan; tapi ia telah memotong tanganku. Rasulullah shallallahu 'alaihi wasallam berkata: \"Jangan engkau membunuhnya!\" Karena apabila engkau membunuhnya maka ia akan menempati posisimu sebelum engkau membunuhnya dan engkau menempati posisinya sebelum ia mengucapkan kalimat tersebut. "
            },
            {
                "number": 2209,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ إِسْمَعِيلَ عَنْ قَيْسٍ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ قَالَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً إِلَى خَثْعَمٍ فَاعْتَصَمَ نَاسٌ مِنْهُمْ بِالسُّجُودِ فَأَسْرَعَ فِيهِمْ الْقَتْلَ قَالَ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ لَهُمْ بِنِصْفِ الْعَقْلِ وَقَالَ أَنَا بَرِيءٌ مِنْ كُلِّ مُسْلِمٍ يُقِيمُ بَيْنَ أَظْهُرِ الْمُشْرِكِينَ قَالُوا يَا رَسُولَ اللَّهِ لِمَ قَالَ لَا تَرَاءَى نَارَاهُمَاقَالَ أَبُو دَاوُد رَوَاهُ هُشَيْمٌ وَمَعْمَرٌ وَخَالِدٌ الْوَاسِطِيُّ وَجَمَاعَةٌ لَمْ يَذْكُرُوا جَرِيرًا",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sarri], telah menceritakan kepada kami [Abu Mu'awiyah], dari [Isma'il], dari [Qais] dari [Jarir bin Abdullah], ia berkata; Rasulullah shallallahu 'alaihi wasallam telah mengirim kami dalam sebuah kesatuan militer menuju Khats'am, kemudian orang-orang diantara mereka berlindung dengan bersujud, kemudian cepat terjadi pembunuhan diantara mereka. Lalu hal tersebut sampai kepada Nabi shallallahu 'alaihi wasallam, dan beliau memerintahkan agar mereka diberi setengah diyah. Dan beliau berkata: \"Aku berlepas diri dari setiap muslim yang bermukim di antara orang-orang musyrik.\" Mereka bertanya; kenapa wahai Rasulullah? Beliau berkata: kedua api peperangan mereka saling melihat. Abu Daud berkata; hadits tersebut diriwayatkan oleh Husyaim dan Ma'mar, Khalid Al Wasithi, serta beberapa orang-orang, mereka tidak menyebutkan Jarir. "
            },
            {
                "number": 2210,
                "arab": "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ جَرِيرِ بْنِ حَازِمٍ عَنْ الزُّبَيْرِ بْنِ خِرِّيتٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَنَزَلَتْ{ إِنْ يَكُنْ مِنْكُمْ عِشْرُونَ صَابِرُونَ يَغْلِبُوا مِائَتَيْنِ }فَشَقَّ ذَلِكَ عَلَى الْمُسْلِمِينَ حِينَ فَرَضَ اللَّهُ عَلَيْهِمْ أَنْ لَا يَفِرَّ وَاحِدٌ مِنْ عَشَرَةٍ ثُمَّ إِنَّهُ جَاءَ تَخْفِيفٌ فَقَالَ{ الْآنَ خَفَّفَ اللَّهُ عَنْكُمْ }قَرَأَ أَبُو تَوْبَةَ إِلَى قَوْلِهِ{ يَغْلِبُوا مِائَتَيْنِ }قَالَ فَلَمَّا خَفَّفَ اللَّهُ تَعَالَى عَنْهُمْ مِنْ الْعِدَّةِ نَقَصَ مِنْ الصَّبْرِ بِقَدْرِ مَا خَفَّفَ عَنْهُمْ",
                "id": "Telah menceritakan kepada kami [Abu Taubah Ar Rabi' bin Nafi'], telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Jarir bin Hazim] dari [Az Zubair bin Khirrit] dari [Ikrimah], dari [Ibnu Abbas], ia berkata; telah turun ayat: \"Jika ada dua puluh orang yang sabar diantaramu, niscaya mereka akan dapat mengalahkan dua ratus orang musuh.\" Maka hal tersebut terasa berat atas orang-orang muslim di saat Allah mewajibkan kepada mereka agar tidak seorang pun lari dari sepuluh orang musuh. Kemudian datang keringanan, Allah berfirman: \"Sekarang Allah telah meringankan kepadamu…..\" Abu Taubah membacanya hingga firmanNya: \"…. dapat mengalahkan dua ratus orang kafir.\" Abu Taubah berkata; tatkala Allah memberikan keringanan kepada mereka dalam hal jumlah maka berkuranglah kesabaran sesuai kadar keringan yang Allah berikan kepada mereka. "
            },
            {
                "number": 2211,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا يَزِيدُ بْنُ أَبِي زِيَادٍ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ حَدَّثَهُ أَنَّهُ كَانَ فِي سَرِيَّةٍ مِنْ سَرَايَا رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَحَاصَ النَّاسُ حَيْصَةً فَكُنْتُ فِيمَنْ حَاصَ قَالَ فَلَمَّا بَرَزْنَا قُلْنَا كَيْفَ نَصْنَعُ وَقَدْ فَرَرْنَا مِنْ الزَّحْفِ وَبُؤْنَا بِالْغَضَبِ فَقُلْنَا نَدْخُلُ الْمَدِينَةَ فَنَتَثَبَّتُ فِيهَا وَنَذْهَبُ وَلَا يَرَانَا أَحَدٌ قَالَ فَدَخَلْنَا فَقُلْنَا لَوْ عَرَضْنَا أَنْفُسَنَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنْ كَانَتْ لَنَا تَوْبَةٌ أَقَمْنَا وَإِنْ كَانَ غَيْرَ ذَلِكَ ذَهَبْنَا قَالَ فَجَلَسْنَا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَبْلَ صَلَاةِ الْفَجْرِ فَلَمَّا خَرَجَ قُمْنَا إِلَيْهِ فَقُلْنَا نَحْنُ الْفَرَّارُونَ فَأَقْبَلَ إِلَيْنَا فَقَالَ لَا بَلْ أَنْتُمْ الْعَكَّارُونَ قَالَ فَدَنَوْنَا فَقَبَّلْنَا يَدَهُ فَقَالَ إِنَّا فِئَةُ الْمُسْلِمِينَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus], telah menceritakan kepada kami [Zuhair], telah menceritakan kepada kami [Yazid? bin Abu Ziyad], bahwa [Abdurrahman bin Abu Laila] telah menceritakan kepadanya bahwa [Abdullah bin Umar] telah menceritakan kepadanya bahwa ia pernah berada dalam kesatuan militer diantara kesatuan-kesatuan militer Rasulullah shallallahu 'alaihi wasallam. Ia berkata; kemudian orang-orang melarikan diri, dan aku termasuk orang-orang yang melarikan diri. Kemudian tatkala kami nampak, maka kami mengatakan; apa yang akan kita lakukan? Sungguh kita telah lari dari peperangan dan kita kembali dengan kemurkaan. Lalu kami katakan; kita akan masuk Madinah kemudian kita tinggal padanya dan pergi sementara tidak ada seorangpun yang melihat kita. Kemudian kami masuk Madinah, lalu kami katakan; seandainya kita menyerahkan diri kepada Rasulullah shallallahu 'alaihi wasallam, apabila kita mendapatkan taubat maka kita tinggal di Madinah dan seandainya tidak demikian maka kita akan pergi. Ibnu Umar berkata; kemudian kami duduk menunggu Rasulullah shallallahu 'alaihi wasallam sebelum sholat Subuh. Kemudian tatkala beliau keluar maka kami berdiri menuju kepadanya dan kami katakan; kami adalah orang-orang yang melarikan diri. Lalu beliau menghadap kepada kami dan berkata: \"Tidak, melainkan kalian adalah orang-orang yang kembali berperang.\" Ibnu Umar berkata; kemudian kami mendekat dan mencium tangan beliau. Lalu beliau berkata: \"Kami adalah kelompok orang-orang muslimin.\""
            },
            {
                "number": 2212,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ هِشَامٍ الْمِصْرِيُّ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ حَدَّثَنَا دَاوُدُ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَ نَزَلَتْ فِي يَوْمِ بَدْرٍ وَمَنْ يُوَلِّهِمْ يَوْمَئِذٍ دُبُرَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Hisyam Al Mishri], telah menceritakan kepada kami [Bisyr bin Al Mufadhdhal], telah menceritakan kepada kami [Daud], dari [Abu Nadhrah], dari [Abu Sa'id], ia berkata; telah turun mengenai waktu perang Badr ayat: \"Barangsiapa yang membelakangi mereka (mundur) di waktu itu…..\""
            },
            {
                "number": 2213,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا هُشَيْمٌ وَخَالِدٌ عَنْ إِسْمَعِيلَ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ خَبَّابٍ قَالَأَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُتَوَسِّدٌ بُرْدَةً فِي ظِلِّ الْكَعْبَةِ فَشَكَوْنَا إِلَيْهِ فَقُلْنَا أَلَا تَسْتَنْصِرُ لَنَا أَلَا تَدْعُو اللَّهَ لَنَا فَجَلَسَ مُحْمَرًّا وَجْهُهُ فَقَالَ قَدْ كَانَ مَنْ قَبْلَكُمْ يُؤْخَذُ الرَّجُلُ فَيُحْفَرُ لَهُ فِي الْأَرْضِ ثُمَّ يُؤْتَى بِالْمِنْشَارِ فَيُجْعَلُ عَلَى رَأْسِهِ فَيُجْعَلُ فِرْقَتَيْنِ مَا يَصْرِفُهُ ذَلِكَ عَنْ دِينِهِ وَيُمْشَطُ بِأَمْشَاطِ الْحَدِيدِ مَا دُونَ عَظْمِهِ مِنْ لَحْمٍ وَعَصَبٍ مَا يَصْرِفُهُ ذَلِكَ عَنْ دِينِهِ وَاللَّهِ لَيُتِمَّنَّ اللَّهُ هَذَا الْأَمْرَ حَتَّى يَسِيرَ الرَّاكِبُ مَا بَيْنَ صَنْعَاءَ وَحَضْرَمُوتَ مَا يَخَافُ إِلَّا اللَّهَ تَعَالَى وَالذِّئْبَ عَلَى غَنَمِهِ وَلَكِنَّكُمْ تَعْجَلُونَ",
                "id": "Telah menceritakan kepada kami ['Amr bin 'Aun], telah mengabarkan kepada kami [Husyaim], dan [Khalid], dari [Isma'il], dari [Qais bin Abu Hazim], dari [Khabbab], ia berkata; kami datang kepada Rasulullah shallallahu 'alaihi wasallam sementara beliau berbantalkan burdah di bawah naungan Ka'bah, kami mengeluhkan kepada beliau, kami katakan; tidakkah anda memintakan kemenangan untuk kami? Tidakkah engkau berdo'a kepada Allah untuk kami? Kemudian beliau duduk dalam keadaan memerah wajahnya, lalu berkata: \"Sungguh orang-orang sebelum kalian diantara mereka ada yang dikubur di tanah kemudian didatangkan gergaji kemudian diletakkan di atas kepalanya dan ia dibelah menjadi dua bagian, hal tersebut tidaklah membuatnya berpaling dari agamanya, dan ada yang disisir daging dan sarafnya menggukan sisir besi mendekati tulangnya, tidaklah hal tersebut menjadikannya berpaling dari agamanya. Demi Allah, sungguh Allah akan menyempurnakan perkara ini hingga orang yang berkendaraan berjalan antara Shan'a` dan Hadhramut dalam keadaan tidak takut kecuali kepada Allah ta'ala serta serigala yang akan memangsa dombanya, akan tetapi kalian tergesa-gesa.\""
            },
            {
                "number": 2214,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو حَدَّثَهُ الْحَسَنُ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ أَخْبَرَهُ عُبَيْدُ اللَّهِ بْنُ أَبِي رَافِعٍ وَكَانَ كَاتِبًا لِعَلِيِّ بْنِ أَبِي طَالِبٍ قَالَ سَمِعْتُ عَلِيًّا يَقُولُبَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَالزُّبَيْرُ وَالْمِقْدَادُ فَقَالَ انْطَلِقُوا حَتَّى تَأْتُوا رَوْضَةَ خَاخٍ فَإِنَّ بِهَا ظَعِينَةً مَعَهَا كِتَابٌ فَخُذُوهُ مِنْهَا فَانْطَلَقْنَا تَتَعَادَى بِنَا خَيْلُنَا حَتَّى أَتَيْنَا الرَّوْضَةَ فَإِذَا نَحْنُ بِالظَّعِينَةِ فَقُلْنَا هَلُمِّي الْكِتَابَ قَالَتْ مَا عِنْدِي مِنْ كِتَابٍ فَقُلْتُ لَتُخْرِجِنَّ الْكِتَابَ أَوْ لَنُلْقِيَنَّ الثِّيَابَ فَأَخْرَجَتْهُ مِنْ عِقَاصِهَا فَأَتَيْنَا بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا هُوَ مِنْ حَاطِبِ بْنِ أَبِي بَلْتَعَةَ إِلَى نَاسٍ مِنْ الْمُشْرِكِينَ يُخْبِرُهُمْ بِبَعْضِ أَمْرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا هَذَا يَا حَاطِبُ فَقَالَ يَا رَسُولَ اللَّهِ لَا تَعْجَلْ عَلَيَّ فَإِنِّي كُنْتُ امْرَأً مُلْصَقًا فِي قُرَيْشٍ وَلَمْ أَكُنْ مِنْ أَنْفُسِهَا وَإِنَّ قُرَيْشًا لَهُمْ بِهَا قَرَابَاتٌ يَحْمُونَ بِهَا أَهْلِيهِمْ بِمَكَّةَ فَأَحْبَبْتُ إِذْ فَاتَنِي ذَلِكَ أَنْ أَتَّخِذَ فِيهِمْ يَدًا يَحْمُونَ قَرَابَتِي بِهَا وَاللَّهِ يَا رَسُولَ اللَّهِ مَا كَانَ بِي مِنْ كُفْرٍ وَلَا ارْتِدَادٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَقَكُمْ فَقَالَ عُمَرُ دَعْنِي أَضْرِبُ عُنُقَ هَذَا الْمُنَافِقِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ شَهِدَ بَدْرًا وَمَا يُدْرِيكَ لَعَلَّ اللَّهَ اطَّلَعَ عَلَى أَهْلِ بَدْرٍ فَقَالَ اعْمَلُوا مَا شِئْتُمْ فَقَدْ غَفَرْتُ لَكُمْحَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ عَنْ حُصَيْنٍ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ عَنْ عَلِيٍّ بِهَذِهِ الْقِصَّةِ قَالَ انْطَلَقَ حَاطِبٌ فَكَتَبَ إِلَى أَهْلِ مَكَّةَ أَنَّ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ سَارَ إِلَيْكُمْ وَقَالَ فِيهِ قَالَتْ مَا مَعِي كِتَابٌ فَانْتَحَيْنَاهَا فَمَا وَجَدْنَا مَعَهَا كِتَابًا فَقَالَ عَلِيٌّ وَالَّذِي يُحْلَفُ بِهِ لَأَقْتُلَنَّكِ أَوْ لَتُخْرِجِنَّ الْكِتَابَ وَسَاقَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Sufyan] dari ['Amr], telah menceritakan kepadanya [Al Hasan bin Muhammad bin Ali], telah mengabarkan kepadanya ['ubaidhullah bin Abu Rafi'], dan dahulu ia adalah sekretaris Ali bin Abu Thalib, ia berkata; saya telah mendengar [Ali] berkata; Rasulullah shallallahu 'alaihi wasallam telah mengirimku bersama dengan Az Zubair dan Al Miqdad, kemudian beliau berkata: \"Pergilah kalian ke taman Khakh, sesungguhnya di sana terdapat seorang wanita yang membawa surat. Ambillah surat tersebut darinya.\" Kemudian kami pergi dan kuda kami berlari kencang hingga sampai taman tersebut. Tiba-tiba kami mendapati seorang wanita, lalu kami katakan; serahkan surat tersebut! Wanita tersebut berkata; aku tidak memiliki surat. Lalu aku katakan; sungguh engkau keluarkan surat tersebut atau kami akan melucuti pakaianmu! Kemudian wanita tersebut mengeluarkannya dari bawah sanggulnya. Kemudian kami membawanya kepada Nabi shallallahu 'alaihi wasallam, ternyata surat tersebut berasal dari Hathib bin Abu Balta'ah kepada beberapa orang musyriki, ia memberitahukan kepada mereka sebagian urusan Rasulullah shallallahu 'alaihi wasallam. Kemudian beliau berkata: \"Apa ini wahai Hathib?\" Hathib berkata; jangan terburu menghukumku wahai Rasulullah! Sesungguhnya dahulu aku adalah orang yang tinggal di antara orang-orang Quraisy dan bukan dari mereka, sementara orang-orang Quraisy memiliki kerabat di sana, yang dengan kekerabatan tersebut mereka melindungi keluarga mereka di Mekkah. Dan disaat aku tidak memiliki hal itu aku ingin untuk memberikan suatu pemberian yang dengannya mereka dapat melindungi kerabatku di sana. Demi Allah wahai Rasulullah, aku melakukan hal itu bukan lantaran aku kafir serta keluar dari agamaku. Kemudian Nabi shallallahu 'alaihi wasallam berkata: ia benar. Lalu Umar bin Al Khathab radliallahu 'anhu berkata; biarkan aku memenggal leher orang munafik ini wahai Rasulullah! Kemudian Nabi shallallahu 'alaihi wasallam berkata: \"Sesungguhnya ia telah mengikuti perang Badr, tahukah kamu sungguh Allah telah melihat kepada Ahli Badr dan berkata: \"Lakukan sesuka kalian, sungguh Aku telah mengampuni dosa kalian.\" Telah menceritakan kepada kami [Wahb bin Baqiyyah], dari [Khalid] dari [Hushain], dari [Sa'd bin 'Ubaidah], dari [Abu Abdurrahman As Sulami], dari [Ali] dengan kisah ini. Ia berkata; Hathib pergi dan menulis surat kepada penduduk Mekkah bahwa Muhammad shallallahu 'alaihi wasallam telah berjalan menuju kepada kalian. Wahb berkata dalam hadits tersebut; wanita tersebut berkata; aku tidak memiliki surat. Kemudian kami memeriksanya dan kami tidak mendapatkan surat bersamanya. Kemudian Ali berkata; demi Dzat yang dengan dilakukan sumpah, sungguh aku akan membunuhmu atau engkau keluarkan surat tersebut. Dan Wahb menyebutkan hadits tersebut. "
            },
            {
                "number": 2215,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنِي مُحَمَّدُ بْنُ مُحَبَّبٍ أَبُو هَمَّامٍ الدَّلَّالُ حَدَّثَنَا سُفْيَانُ بْنُ سَعِيدٍ عَنْ أَبِي إِسْحَقَ عَنْ حَارِثَةَ بْنِ مُضَرِّبٍ عَنْ فُرَاتِ بْنِ حَيَّانَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِهِ وَكَانَ عَيْنًا لِأَبِي سُفْيَانَ وَكَانَ حَلِيفًا لِرَجُلٍ مِنْ الْأَنْصَارِ فَمَرَّ بِحَلَقَةٍ مِنْ الْأَنْصَارِ فَقَالَ إِنِّي مُسْلِمٌ فَقَالَ رَجُلٌ مِنْ الْأَنْصَارِ يَا رَسُولَ اللَّهِ إِنَّهُ يَقُولُ إِنَّى مُسْلِمٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْكُمْ رِجَالًا نَكِلُهُمْ إِلَى إِيمَانِهِمْ مِنْهُمْ فُرَاتُ بْنُ حَيَّانَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepadaku [Muhammad bin Muhabbab Abu Hammam Ad Dallal], telah menceritakan kepada kami [Sufyan bin Sa'id], dari [Abu Ishaq], dari [Haritsah bin Mudharrib], dari [Furat bin Hayyan] bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk membunuhnya, dan ia adalah mata-mata Abu Sufyan. Dan ia adalah sekutu seorang anshor, kemudian ia berkata; sesungguhnya aku adalah seorang muslim. Kemudian seorang anshar berkata; wahai Rasulullah, sesungguhnya ia berkata; aku adalah seorang muslim. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Sesungguhnya diantara kalian terdapat orang-orang yang kami serahkan mereka kepada keimanan mereka, diantara mereka adalah Furat bin Hayyan.\""
            },
            {
                "number": 2216,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا قَالَ أَبُو نُعَيْمٍ حَدَّثَنَا أَبُو عُمَيْسٍ عَنْ ابْنِ سَلَمَةَ بْنِ الْأَكْوَعِ عَنْ أَبِيهِ قَالَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَيْنٌ مِنْ الْمُشْرِكِينَ وَهُوَ فِي سَفَرٍ فَجَلَسَ عِنْدَ أَصْحَابِهِ ثُمَّ انْسَلَّ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اطْلُبُوهُ فَاقْتُلُوهُ قَالَ فَسَبَقْتُهُمْ إِلَيْهِ فَقَتَلْتُهُ وَأَخَذْتُ سَلَبَهُ فَنَفَّلَنِي إِيَّاهُ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Abu Nu'aim], telah menceritakan kepada kami [Abu 'Umais] dari [Salamah bin Al Akwa'] dari [ayahnya], ia berkata; telah datang seorang mata-mata dari orang-orang musyrik kepada Nabi shallallahu 'alaihi wasallam dan ia sedang dalam perjalanannya, kemudian ia duduk disisi para sahabatnya kemudian ia pergi. Nabi shallallahu 'alaihi wasallam berkata: \"Carilah dia dan bunuhlah!\" Salamah bin Al Akwa' berkata; kemudian aku mendahului mereka dan membunuhnya serta mengambil barang yang ada di badannya. Lalu beliau memberiku tambahan. "
            },
            {
                "number": 2217,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ أَنَّ هَاشِمَ بْنَ الْقَاسِمِ وَهِشَامًا حَدَّثَاهُمْ قَالَا حَدَّثَنَا عِكْرِمَةُ قَالَ حَدَّثَنِي إِيَاسُ بْنُ سَلَمَةَ قَالَ حَدَّثَنِي أَبِي قَالَغَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَوَازِنَ قَالَ فَبَيْنَمَا نَحْنُ نَتَضَحَّى وَعَامَّتُنَا مُشَاةٌ وَفِينَا ضَعَفَةٌ إِذْ جَاءَ رَجُلٌ عَلَى جَمَلٍ أَحْمَرَ فَانْتَزَعَ طَلَقًا مِنْ حَقْوِ الْبَعِيرِ فَقَيَّدَ بِهِ جَمَلَهُ ثُمَّ جَاءَ يَتَغَدَّى مَعَ الْقَوْمِ فَلَمَّا رَأَى ضَعَفَتَهُمْ وَرِقَّةَ ظَهْرِهِمْ خَرَجَ يَعْدُو إِلَى جَمَلِهِ فَأَطْلَقَهُ ثُمَّ أَنَاخَهُ فَقَعَدَ عَلَيْهِ ثُمَّ خَرَجَ يَرْكُضُهُ وَاتَّبَعَهُ رَجُلٌ مِنْ أَسْلَمَ عَلَى نَاقَةٍ وَرْقَاءَ هِيَ أَمْثَلُ ظَهْرِ الْقَوْمِ قَالَ فَخَرَجْتُ أَعْدُو فَأَدْرَكْتُهُ وَرَأْسُ النَّاقَةِ عِنْدَ وَرِكِ الْجَمَلِ وَكُنْتُ عِنْدَ وَرِكِ النَّاقَةِ ثُمَّ تَقَدَّمْتُ حَتَّى كُنْتُ عِنْدَ وَرِكِ الْجَمَلِ ثُمَّ تَقَدَّمْتُ حَتَّى أَخَذْتُ بِخِطَامِ الْجَمَلِ فَأَنَخْتُهُ فَلَمَّا وَضَعَ رُكْبَتَهُ بِالْأَرْضِ اخْتَرَطْتُ سَيْفِي فَأَضْرِبُ رَأْسَهُ فَنَدَرَ فَجِئْتُ بِرَاحِلَتِهِ وَمَا عَلَيْهَا أَقُودُهَا فَاسْتَقْبَلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي النَّاسِ مُقْبِلًا فَقَالَ مَنْ قَتَلَ الرَّجُلَ فَقَالُوا سَلَمَةُ بْنُ الْأَكْوَعِ فَقَالَ لَهُ سَلَبُهُ أَجْمَعُقَالَ هَارُونُ هَذَا لَفْظُ هَاشِمٍ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah], bahwa [Hasyim bin Al Qasim], dan [Hisyam] telah menceritakan kepada mereka; telah menceritakan kepada kami [Ikrimah], telah menceritakan kepada kami [Iyas bin Salamah], ia berkata; telah menceritakan kepadaku [ayahku], ia berkata; aku pernah memerangi Hawazin bersama Rasulullah shallallahu 'alaihi wasallam, kemudian tatkala kami sedang makan pada waktu dhuha dan kebanyakan kami berjalan kaki, serta diantara kami terdapat orang yang lemah tiba-tiba seseorang datang dengan mengendarai unta. Lalu ia melepas tali dari pinggang unta, lalu ia gunakan untuk mengikat untanya. Kemudian ia datang dan makan siang bersama orang-orang. Kemudian tatkala ia melihat orang-orang lemah mereka dan punggung mereka yang lemas, maka ia keluar menuju kepada untanya lalu melepaskannya kemudian menderumkannya. Orang tersebut duduk di atas unta tersebut kemudian keluar dan memukul unta dengan kakinya. Ia diikuti seseorang dari Aslam yang mengendarai unta Abu-Abu yang sama dengan punggung orang-orang tersebut. Ia berkata; kemudian aku keluar mengejarnya, lalu aku mendapatkannya, sementara kepala untaku ada di sisi pantat untanya, kemudian aku maju hingga dapat memegang tali kendali untanya. Lalu aku menderumkannya. Tatkala ia telahmeletakkan lututnya di tanah aku mencabut pedangku lalu menebas kepalanya hingga ia terjatuh. Kemudian aku datang dengan membawa kendaraannya dan apa yang ada di atasnya. Aku menuntunnya, kemudian Rasulullah shallallahu 'alaihi wasallam menyambutku diantara orang-orang. Kemudian ia berkata; siapakah yang membunuh orang tersebut? Mereka berkata; Salamah bin Al Akwa'. Lalu beliau berkata: \"Baginya salabnya semua.\" Harun berkata; ini adalah lafazh Hasyim. "
            },
            {
                "number": 2218,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ عَنْ عَلْقَمَةَ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ عَنْ مَعْقِلِ بْنِ يَسَارٍ أَنَّ النُّعْمَانَ يَعْنِي ابْنَ مُقَرِّنٍ قَالَشَهِدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا لَمْ يُقَاتِلْ مِنْ أَوَّلِ النَّهَارِ أَخَّرَ الْقِتَالَ حَتَّى تَزُولَ الشَّمْسُ وَتَهُبَّ الرِّيَاحُ وَيَنْزِلَ النَّصْرُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad], telah mengabarkan kepada kami [Abu Imran Al Jauni], dari ['Alqamah bin Abdullah Al Muzani], dari [Ma'qil bin Yasar] bahwa [An Nu'man bin Muqarrin] berkata; aku menyaksikan Rasulullah shallallahu 'alaihi wasallam apabila tidak berperang pada awal siang maka beliau menunda perang hingga matahari tergelincir dan angin berhembus kencang dan turunlah kemenangan. "
            },
            {
                "number": 2219,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا هِشَامٌ حَدَّثَنَا قَتَادَةُ عَنْ الْحَسَنِ عَنْ قَيْسِ بْنِ عُبَادٍ قَالَكَانَ أَصْحَابُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْرَهُونَ الصَّوْتَ عِنْدَ الْقِتَالِحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ هَمَّامٍ حَدَّثَنِي مَطَرٌ عَنْ قَتَادَةَ عَنْ أَبِي بُرْدَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim], telah menceritakan kepada kami [Hisyam], dan telah diriwayat dari jalur yang lain: Telah menceritakan kepada kami ['ubaidhullah bin Umar], telah menceritakan kepada kami [Abdurrahman bin Mahdi], telah menceritakan kepada kami [Hisyam], telah menceritakan kepada kami [Qatadah], dari [Al Hasan], dari [Qais bin 'Ubad], ia berkata; para sahabat Nabi shallallahu 'alaihi wasallam tidak menyukai bersuara ketika berperang. Telah menceritakan kepada kami ['ubaidhullah bin Umar], telah menceritakan kepada kami [Abdurrahman] dari [Hammam], telah menceritakan kepadaku [Mathar], dari [Qatadah] dari [Abu Burdah], dari [ayahnya], dari Nabi shallallahu 'alaihi wasallam seperti hadits tersebut. "
            },
            {
                "number": 2220,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ الْبَرَاءِ قَالَلَمَّا لَقِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُشْرِكِينَ يَوْمَ حُنَيْنٍ فَانْكَشَفُوا نَزَلَ عَنْ بَغْلَتِهِ فَتَرَجَّلَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Waki'], dari [Israil] dari [Abu Ishaq], dari [Al Bara`], ia berkata; tatkala Rasulullah shallallahu 'alaihi wasallam bertemu dengan orang-orang musyrik pada saat perang Hunain kemudian mereka terkalahkan, beliau turun dari Bighalnya dan berjalan kaki. "
            },
            {
                "number": 2221,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ وَمُوسَى بْنُ إِسْمَعِيلَ الْمَعْنَى وَاحِدٌ قَالَا حَدَّثَنَا أَبَانُ قَالَ حَدَّثَنَا يَحْيَى عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ ابْنِ جَابِرِ بْنِ عَتِيكٍ عَنْ جَابِرِ بْنِ عَتِيكٍأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ مِنْ الْغَيْرَةِ مَا يُحِبُّ اللَّهُ وَمِنْهَا مَا يُبْغِضُ اللَّهُ فَأَمَّا الَّتِي يُحِبُّهَا اللَّهُ فَالْغَيْرَةُ فِي الرِّيبَةِ وَأَمَّا الْغَيْرَةُ الَّتِي يُبْغِضُهَا اللَّهُ فَالْغَيْرَةُ فِي غَيْرِ رِيبَةٍ وَإِنَّ مِنْ الْخُيَلَاءِ مَا يُبْغِضُ اللَّهُ وَمِنْهَا مَا يُحِبُّ اللَّهُ فَأَمَّا الْخُيَلَاءُ الَّتِي يُحِبُّ اللَّهُ فَاخْتِيَالُ الرَّجُلِ نَفْسَهُ عِنْدَ الْقِتَالِ وَاخْتِيَالُهُ عِنْدَ الصَّدَقَةِ وَأَمَّا الَّتِي يُبْغِضُ اللَّهُ فَاخْتِيَالُهُ فِي الْبَغْيِ قَالَ مُوسَى وَالْفَخْرِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim], dan [Musa bin Isma'il] dan maknanya adalah satu. Mereka berkata; telah menceritakan kepada kami [Aban], ia berkata; telah menceritakan kepada kami [Yahya], dari [Muhammad bin Ibrahim], dari [Ibnu Jabir 'Atik] dari [Jabir bin 'Atik] bahwa Nabi Rasulullah shallallahu 'alaihi wasallam berkata: \"Diantara rasa cemburu ada yang dicintai Allah, dan diantara rasa cemburu tersebut ada yang dibenci Allah.\" Adapun rasa cemburu yang Allah 'azza wajalla cintai adalah cemburu dalam keraguan, adapun rasa cemburu yang Allah 'azza wajalla benci adalah kecemburuan yang tidak dalam keraguan. Dan diantara rasa bangga ada yang Allah benci dan diantara rasa bangga ada yang Allah benci, adapun rasa bangga yang Allah 'azza wajalla cintai adalah rasa bangga seseorang kepada dirinya ketika berperang dan bersedekah, sedangkan rasa bangga yang Allah 'azza wajalla benci adalah rasa bangga dalam kebatilan.\" Musa berkata; dan rasa sombong. "
            },
            {
                "number": 2222,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا إِبْرَاهِيمُ يَعْنِي ابْنَ سَعْدٍ أَخْبَرَنَا ابْنُ شِهَابٍ أَخْبَرَنِي عَمْرُو بْنُ جَارِيَةَ الثَّقَفِيُّ حَلِيفُ بَنِي زُهْرَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشَرَةً عَيْنًا وَأَمَّرَ عَلَيْهِمْ عَاصِمَ بْنَ ثَابِتٍ فَنَفَرُوا لَهُمْ هُذَيْلٌ بِقَرِيبٍ مِنْ مِائَةِ رَجُلٍ رَامٍ فَلَمَّا أَحَسَّ بِهِمْ عَاصِمٌ لَجَئُوا إِلَى قَرْدَدٍ فَقَالُوا لَهُمْ انْزِلُوا فَأَعْطُوا بِأَيْدِيكُمْ وَلَكُمْ الْعَهْدُ وَالْمِيثَاقُ أَنْ لَا نَقْتُلَ مِنْكُمْ أَحَدًا فَقَالَ عَاصِمٌ أَمَّا أَنَا فَلَا أَنْزِلُ فِي ذِمَّةِ كَافِرٍ فَرَمَوْهُمْ بِالنَّبْلِ فَقَتَلُوا عَاصِمًا فِي سَبْعَةِ نَفَرٍ وَنَزَلَ إِلَيْهِمْ ثَلَاثَةُ نَفَرٍ عَلَى الْعَهْدِ وَالْمِيثَاقِ مِنْهُمْ خُبَيْبٌ وَزَيْدُ بْنُ الدَّثِنَةِ وَرَجُلٌ آخَرُ فَلَمَّا اسْتَمْكَنُوا مِنْهُمْ أَطْلَقُوا أَوْتَارَ قِسِيِّهِمْ فَرَبَطُوهُمْ بِهَا فَقَالَ الرَّجُلُ الثَّالِثُ هَذَا أَوَّلُ الْغَدْرِ وَاللَّهِ لَا أَصْحَبُكُمْ إِنَّ لِي بِهَؤُلَاءِ لَأُسْوَةً فَجَرُّوهُ فَأَبَى أَنْ يَصْحَبَهُمْ فَقَتَلُوهُ فَلَبِثَ خُبَيْبٌ أَسِيرًا حَتَّى أَجْمَعُوا قَتْلَهُ فَاسْتَعَارَ مُوسَى يَسْتَحِدُّ بِهَا فَلَمَّا خَرَجُوا بِهِ لِيَقْتُلُوهُ قَالَ لَهُمْ خُبَيْبٌ دَعُونِي أَرْكَعُ رَكْعَتَيْنِ ثُمَّ قَالَ وَاللَّهِ لَوْلَا أَنْ تَحْسَبُوا مَا بِي جَزَعًا لَزِدْتُحَدَّثَنَا ابْنُ عَوْفٍ حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ أَخْبَرَنِي عَمْرُو بْنُ أَبِي سُفْيَانَ بْنِ أَسِيدِ بْنِ جَارِيَةَ الثَّقَفِيُّ وَهُوَ حَلِيفٌ لِبَنِي زُهْرَةَ وَكَانَ مِنْ أَصْحَابِ أَبِي هُرَيْرَةَ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Ibrahim bin Sa'd], telah mengabarkan kepada kami [Ibnu Syihab] telah mengabarkan kepadaku ['Amr bin Jariyah Ats Tsaqafi], sekutu Bani Zuhrah, dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, ia berkata; Rasulullah shallallahu 'alaihi wasallam mengutus sepuluh orang mata-mata dan menganggkat 'Ashim bin Tsabit sebagai pemimpin. Kemudian orang-orang Hudzail keluar untuk memerangi mereka jumlah mereka sekitar seratus orang pemanah. Kemudian tatkala 'Ashim merasakan kedatangan orang-orang Hudzail tersebut maka mereka berlindung ke dataran tinggi. Kemudian orang-orang Hudzail tersebut berkata; turunlah, dan berikan tangan kalian. Untuk kalian perjanjian agar kami tidak membunuh seorangpun diantara kalian. Kemudian 'Ashim berkata; adapun aku, maka aku tidak akan turun dengan perlindungan orang kafir. Kemudian mereka memanah mereka dan membunuh 'Ashim diantara tujuh orang yang terbunuh. Dan tiga orang turun kepada mereka dengan perjanjian tersebut. Diantara ketiga orang tersebut adalah Khubaib, Zaid bin Ad Datsanah, seseorang yang lain. Kemudian tatkala orang-orang tersebut menguasai mereka maka mereka melepaskan tali busur mereka dan mengikat ketiga orang tersebut. Orang yang ketiga berkata; ini adalah awal pengingkaran janji. Demi Allah aku tidak akan menyertai kalian, sesungguhnya mereka adalah teladanku. Kemudian mereka menariknya namun ia menolak untuk mengikut mereka. Lalu mereka membunuhnya. Dan Khubaib tetap menjadi tawanan hingga mereka bersepakat untuk membunuhnya. Lalu ia meminjam pisau untuk mencukur rambut kemaluannya. Kemudian tatkala mereka keluar membawanya untuk mereka bunuh Khubaib berkata kepada mereka; biarkan aku untuk melakukan sholat dua raka'at! Kemudian ia berkata; demi Allah, seandainya kalian tidak menyangka bahwa aku takut niscaya aku akan menambahnya. Telah menceritakan kepada kami [Ibnu 'Auf], telah menceritakan kepada kami [Abu Al Yaman], telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri], telah mengabarkan kepadaku ['Amr bin Sufyan bin Asid bin Jariyah Ats Tsaqafi] ia adalah sekutu Bani Zuhrah, dan ia termasuk sahabat Abu Hurairah. Kemudian ia menyebutkan hadits. "
            },
            {
                "number": 2223,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو إِسْحَقَ قَالَ سَمِعْتُ الْبَرَاءَ يُحَدِّثُ قَالَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الرُّمَاةِ يَوْمَ أُحُدٍ وَكَانُوا خَمْسِينَ رَجُلًا عَبْدَ اللَّهِ بْنَ جُبَيْرٍ وَقَالَ إِنْ رَأَيْتُمُونَا تَخْطِفُنَا الطَّيْرُ فَلَا تَبْرَحُوا مِنْ مَكَانِكُمْ هَذَا حَتَّى أُرْسِلَ لَكُمْ وَإِنْ رَأَيْتُمُونَا هَزَمْنَا الْقَوْمَ وَأَوْطَأْنَاهُمْ فَلَا تَبْرَحُوا حَتَّى أُرْسِلَ إِلَيْكُمْ قَالَ فَهَزَمَهُمْ اللَّهُ قَالَ فَأَنَا وَاللَّهِ رَأَيْتُ النِّسَاءَ يُسْنِدْنَ عَلَى الْجَبَلِ فَقَالَ أَصْحَابُ عَبْدِ اللَّهِ بْنِ جُبَيْرٍ الْغَنِيمَةَ أَيْ قَوْمِ الْغَنِيمَةَ ظَهَرَ أَصْحَابُكُمْ فَمَا تَنْتَظِرُونَ فَقَالَ عَبْدُ اللَّهِ بْنُ جُبَيْرٍ أَنَسِيتُمْ مَا قَالَ لَكُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا وَاللَّهِ لَنَأْتِيَنَّ النَّاسَ فَلَنُصِيبَنَّ مِنْ الْغَنِيمَةِ فَأَتَوْهُمْ فَصُرِفَتْ وُجُوهُهُمْ وَأَقْبَلُوا مُنْهَزِمِينَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Zuhair], telah menceritakan kepada kami [Abu Ishaq], ia berkata; saya mendengar [Al Bara`] bercerita; ia berkata; Rasulullah shallallahu 'alaihi wasallam menunjuk Abdullah bin Jubair sebagai pemimpin para pemanah pada saat perang Uhud, dan jumlah mereka adalah lima puluh orang. Beliau bersabda: \"Apabila kalian melihat kami disambar burung, maka janganlah kalian meninggalkan tempat kalian ini hingga aku mengirimkan utusan kepada kalian. Dan apabila kalian melihat kami telah mengalahkan musuh dan kami memukul mereka, maka janganlah kalian meninggalkan tempat hingga aku mengirim utusan kepada kalian.\" Kemudian Allah mengalahkan mereka. Al Bara` berkata; demi Allah aku melihat para wanita menaiki gunung. Kemudian para sahabat Abdullah bin Jubair berkata; rampasan perang wahai kaum! Para sahabat kalian telah mendapat kemenangan, maka apa yang kalian tunggu? Kemudian Abdullah bin Jubair berkata; apakah kalian lupa apa yang dikatakan Rasulullah shallallahu 'alaihi wasallam kepada kalian? Kemudian mereka berkata; demi Allah, kami akan datang kepada orang-orang tersebut dan mendapatkan sebagian harta rampasan. Lalu mereka datang dengan wajah-wajah mereka dipalingkan (langkah tak menetu) dan dalam keadaan kalah."
            },
            {
                "number": 2224,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سُلَيْمَانَ بْنِ الْغَسِيلِ عَنْ حَمْزَةَ بْنِ أَبِي أُسَيْدٍ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ اصْطَفَفْنَا يَوْمَ بَدْرٍ إِذَا أَكْثَبُوكُمْ يَعْنِي إِذَا غَشُوكُمْ فَارْمُوهُمْ بِالنَّبْلِ وَاسْتَبْقُوا نَبْلَكُمْ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sinan], telah menceritakan kepada kami [Abu Ahmad Az Zubairi], telah menceritakan kepada kami [Abdurrahman bin Sulaiman bin Al Ghasil] dari [Hamzah bin Abu Usaid], dari [ayahnya], ia berkata; pada waktu perang Badr, disaat kami berbaris, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila (musuh) kalian telah mendekat kepada kalian, maka panahlah mereka dan sisakan anak panah kalian.\""
            },
            {
                "number": 2225,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا إِسْحَقُ بْنُ نَجِيحٍ وَلَيْسَ بِالْمَلْطِيِّ عَنْ مَالِكِ بْنِ حَمْزَةَ بْنِ أَبِي أُسَيْدٍ السَّاعِدِيِّ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ بَدْرٍ إِذَا أَكْثَبُوكُمْ فَارْمُوهُمْ بِالنَّبْلِ وَلَا تَسُلُّوا السُّيُوفَ حَتَّى يَغْشَوْكُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa], telah menceritakan kepada kami [Ishaq bin Najih], bukan Al Malthi, dari [Malik bin Hamzah bin Abu Usaid As Sa'idi], dari [ayahnya], dari [kakeknya], ia berkata; Nabi shallallahu 'alaihi wasallam bersabda pada saat perang Badr: \"Apabila mereka telah mendekat kepada kalian, maka panahlah mereka dan jangan kalian menghunus pedang hingga mereka telah dekat.\""
            },
            {
                "number": 2226,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَقَ عَنْ حَارِثَةَ بْنِ مُضَرِّبٍ عَنْ عَلِيٍّ قَالَتَقَدَّمَ يَعْنِي عُتْبَةَ بْنَ رَبِيعَةَ وَتَبِعَهُ ابْنُهُ وَأَخُوهُ فَنَادَى مَنْ يُبَارِزُ فَانْتَدَبَ لَهُ شَبَابٌ مِنْ الْأَنْصَارِ فَقَالَ مَنْ أَنْتُمْ فَأَخْبَرُوهُ فَقَالَ لَا حَاجَةَ لَنَا فِيكُمْ إِنَّمَا أَرَدْنَا بَنِي عَمِّنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُمْ يَا حَمْزَةُ قُمْ يَا عَلِيُّ قُمْ يَا عُبَيْدَةَ بْنَ الْحَارِثِ فَأَقْبَلَ حَمْزَةُ إِلَى عُتْبَةَ وَأَقْبَلْتُ إِلَى شَيْبَةَ وَاخْتُلِفَ بَيْنَ عُبَيْدَةَ وَالْوَلِيدِ ضَرْبَتَانِ فَأَثْخَنَ كُلُّ وَاحِدٍ مِنْهُمَا صَاحِبَهُ ثُمَّ مِلْنَا عَلَى الْوَلِيدِ فَقَتَلْنَاهُ وَاحْتَمَلْنَا عُبَيْدَةَ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah], telah menceritakan kepada kami [Utsman bin Umar], telah mengabarkan kepada kami [Israil] dari [Abu Ishaq] dari [Haritsah bin Mudharrib], dari [Ali], ia berkata; 'Utbah bin Rabi'ah telah datang dan diikuti anak dan saudaranya, kemudian ia berteriak; siapakah yang akan berperang tanding? Kemudian beberapa pemuda anshar menyambutnya. Kemudian ia berkata; siapakah kalian? Kemudian mereka memberitahukan kepadanya, lalu ia berkata; kami tidak butuh kepada kalian, kami hanya menghendaki anak-anak paman kami. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Berdirilah wahai Hamzah, berdirilah wahai Ali, berdirilah wahai 'Ubaidah bin Al Harits!\" Kemudian Hamzah menghadapi Utbah, dan aku menghadapi Syaibah. Dan 'Ubaidah serta Al Walid saling bergantian menebaskan pedang, dan masing-masing melukai serta melemahkan lawannya. Kemudian kami mendatangi Al Walid lalu kami membunuhnya dan kami membawa 'Ubaidah. "
            },
            {
                "number": 2227,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى وَزِيَادُ بْنُ أَيُّوبَ قَالَا حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا مُغِيرَةُ عَنْ شِبَاكٍ عَنْ إِبْرَاهِيمَ عَنْ هُنَيِّ بْنِ نُوَيْرَةَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعَفُّ النَّاسِ قِتْلَةً أَهْلُ الْإِيمَانِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa], serta [Ziyad bin Ayyub], mereka berkata; telah menceritakan kepada kami [Husyaim], telah mengabarkan kepada kami [Mughirah] dari [Syibak] dari [Ibrahim] dari [Hunai bin Nuwairah], dari ['Al Qamah] dari [Abdullah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang paling dapat menahan diri dalam membunuh adalah orang yang beriman.\""
            },
            {
                "number": 2228,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ الْهَيَّاجِ بْنِ عِمْرَانَأَنَّ عِمْرَانَ أَبَقَ لَهُ غُلَامٌ فَجَعَلَ لِلَّهِ عَلَيْهِ لَئِنْ قَدَرَ عَلَيْهِ لَيَقْطَعَنَّ يَدَهُ فَأَرْسَلَنِي لِأَسْأَلَ لَهُ فَأَتَيْتُ سَمُرَةَ بْنَ جُنْدُبٍ فَسَأَلْتُهُ فَقَالَ كَانَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحُثُّنَا عَلَى الصَّدَقَةِ وَيَنْهَانَا عَنْ الْمُثْلَةِ فَأَتَيْتُ عِمْرَانَ بْنَ حُصَيْنٍ فَسَأَلْتُهُ فَقَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحُثُّنَا عَلَى الصَّدَقَةِ وَيَنْهَانَا عَنْ الْمُثْلَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna], telah menceritakan kepada kami [Mu'adz bin Hisyam], telah menceritakan kepadaku [ayahku], dari [Qatadah], dari [Al Hasan] dari [Al Hayyaj bin 'Imran] bahwa budak Imrah telah melarikan diri, dan ia bersumpah bahwa apabila ia mampu untuk menangkapnya maka niscaya ia akan memotong tangannya. Kemudian ia mengutusku agar bertanya untuknya, kemudian aku datang kepada [Samurah bin Jundub], dan menanyakan hal tersebut kepadanya. Kemudian ia berkata; Nabi shallallahu 'alaihi wasallam menganjurkan kami untuk bersedekah dan melarang kami dari mencincang. Lalu aku datang kepada [Imran bin Hushain] dan menanyakan hal tersebut kepadanya. Kemudian ia berkata; Rasulullah shallallahu 'alaihi wasallam menganjurkan kami untuk bersedekah dan melarang kami dari mencincang (memotong-motong bagian anggota tubuh). "
            },
            {
                "number": 2229,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ وَقُتَيْبَةُ يَعْنِي ابْنَ سَعِيدٍ قَالَا حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِأَنَّ امْرَأَةً وُجِدَتْ فِي بَعْضِ مَغَازِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقْتُولَةً فَأَنْكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَتْلَ النِّسَاءِ وَالصِّبْيَانِ",
                "id": "Telah menceritakan kepada kami [Yazid? bin Khalid bin Mauhib], serta [Qutaibah bin Sa'id], mereka berkata; telah menceritakan kepada kami [Al Laits] dari [Nafi'], dari [Abdullah] bahwa seorang wanita telah didapati terbunuh dalam sebagian peperangan yang diikuti Rasulullah shallallahu wa'alaihi wa sallam, kemudian Rasulullah shallallahu 'alaihi wasallam mengingkari pembunuhan wanita dan anak-anak. "
            },
            {
                "number": 2230,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا عُمَرُ بْنُ الْمُرَقَّعِ بْنِ صَيْفِيِّ بْنِ رَبَاحٍ قَالَ حَدَّثَنِي أَبِي عَنْ جَدِّهِ رَبَاحِ بْنِ رَبِيعٍ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةٍ فَرَأَى النَّاسَ مُجْتَمِعِينَ عَلَى شَيْءٍ فَبَعَثَ رَجُلًا فَقَالَ انْظُرْ عَلَامَ اجْتَمَعَ هَؤُلَاءِ فَجَاءَ فَقَالَ عَلَى امْرَأَةٍ قَتِيلٍ فَقَالَ مَا كَانَتْ هَذِهِ لِتُقَاتِلَ قَالَ وَعَلَى الْمُقَدِّمَةِ خَالِدُ بْنُ الْوَلِيدِ فَبَعَثَ رَجُلًا فَقَالَ قُلْ لِخَالِدٍ لَا يَقْتُلَنَّ امْرَأَةً وَلَا عَسِيفًا",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi], telah menceritakan kepada kami [Umar bin Al Muraqqa' bin Shaifi bin Rabah], ia berkata; telah menceritakan kepadaku [ayahku], dari [kakekku yaitu Rabah bin Rabi'], ia berkata; kami pernah bersama dalam sebuah pertempuran. Kemudian beliau melihat orang-orang berkumpul mengerumuni sesuatu. Kemudian beliau mengirim seseorang dan berkata: \"Lihatlah, apakah yang mereka kerumuni?\" kemudian orang tersebut datang dan berkata; mengerumuni seorang wanita yang terbunuh. Kemudian beliau berkata; tidak sepantasnya orang ini untuk berperang. Sementara baris depan Khalid bin Al Walid. Kemudian beliau mengutus seseorang dan beliau berkata; katakan kepada Khalid; agar ia tidak membunuh wanita dan orang utusan. "
            },
            {
                "number": 2231,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا قَتَادَةُ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْتُلُوا شُيُوخَ الْمُشْرِكِينَ وَاسْتَبْقُوا شَرْخَهُمْ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur], telah menceritakan kepada kami [Husyaim], telah menceritakan kepada kami [Hajjaj], telah menceritakan kepada kami [Qatadah] dari [Al Hasan] dari [Samurah bin Jundub], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bunuhlah orang-orang tua yang musyrik, dan biarkan anak-anak kecil.\""
            },
            {
                "number": 2232,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرِ بْنِ الزُّبَيْرِ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْلَمْ يُقْتَلْ مِنْ نِسَائِهِمْ تَعْنِي بَنِي قُرَيْظَةَ إِلَّا امْرَأَةٌ إِنَّهَا لَعِنْدِي تُحَدِّثُ تَضْحَكُ ظَهْرًا وَبَطْنًا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْتُلُ رِجَالَهُمْ بِالسُّيُوفِ إِذْ هَتَفَ هَاتِفٌ بِاسْمِهَا أَيْنَ فُلَانَةُ قَالَتْ أَنَا قُلْتُ وَمَا شَأْنُكِ قَالَتْ حَدَثٌ أَحْدَثْتُهُ قَالَتْ فَانْطَلَقَ بِهَا فَضُرِبَتْ عُنُقُهَا فَمَا أَنْسَى عَجَبًا مِنْهَا أَنَّهَا تَضْحَكُ ظَهْرًا وَبَطْنًا وَقَدْ عَلِمَتْ أَنَّهَا تُقْتَلُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Muhammad bin Salamah], dari [Muhammad bin Ishaq], telah menceritakan kepadaku [Muhammad bin Ja'far bin Az Zubair] dari ['Urwah bin Az Zubair] dari [Aisyah], ia berkata; tidak ada yang terbunuh diantara para wanita Bani Quraizhah kecuali seorang wanita, sesungguhnya ia di sisiku berbicara dan tertawa luar dalam. Dan Rasulullah shallallahu 'alaihi wasallam membunuh laki-laki mereka dengan pedang, tiba-tiba terdapat orang yang menyebutkan namanya; dimanakah Fulanah? Ia berkata; aku. Maka aku katakan; ada apa denganmu? Wanita tersebut berkata; ada suatu kejadian yang telah aku lakukan. Aisyah berkata; kemudian orang tersebut pergi membawa wanita tersebut kemudian leher wanita tersebut dipenggal. Aku tidak melupakan sesuatu yang aneh. Bahwa ia tertawa luar dalam sementara ia mengetahui bahwa ia akan dibunuh. "
            },
            {
                "number": 2233,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ يَعْنِي ابْنَ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ الصَّعْبِ ابْنِ جَثَّامَةَأَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الدَّارِ مِنْ الْمُشْرِكِينَ يُبَيَّتُونَ فَيُصَابُ مِنْ ذَرَارِيِّهِمْ وَنِسَائِهِمْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُمْ مِنْهُمْ وَكَانَ عَمْرٌو يَعْنِي ابْنَ دِينَارٍ يَقُولُ هُمْ مِنْ آبَائِهِمْ قَالَ الزُّهْرِيُّ ثُمَّ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ذَلِكَ عَنْ قَتْلِ النِّسَاءِ وَالْوِلْدَانِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Amr bin As Sarh], telah menceritakan kepada kami [Sufyan] dari [Az Zuhri], dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] dari [Ash Sha'bin bin Jatstsamah] bahwa ia telah bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai sebuah kampung orang-orang musyrikin yang diserang pada malam hari. Kemudian ditawan anak-anak dan wanita mereka. Kemudian Nabi shallallahu 'alaihi wasallam berkata: \"Mereka merupakan bagian dari mereka.\" 'Amr bin Dinar berkata; beliau berkata: \"Mereka merupakan bagian dari bapak-bapak mereka.\" Az Zuhri berkata; kemudian setelah itu Rasulullah shallallahu 'alaihi wasallam melarang membunuh para wanita dan anak-anak. "
            },
            {
                "number": 2234,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا مُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ الْحِزَامِيُّ عَنْ أَبِي الزِّنَادِ حَدَّثَنِي مُحَمَّدُ بْنُ حَمْزَةَ الْأَسْلَمِيُّ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّرَهُ عَلَى سَرِيَّةٍ قَالَ فَخَرَجْتُ فِيهَا وَقَالَ إِنْ وَجَدْتُمْ فُلَانًا فَأَحْرِقُوهُ بِالنَّارِ فَوَلَّيْتُ فَنَادَانِي فَرَجَعْتُ إِلَيْهِ فَقَالَ إِنْ وَجَدْتُمْ فُلَانًا فَاقْتُلُوهُ وَلَا تُحْرِقُوهُ فَإِنَّهُ لَا يُعَذِّبُ بِالنَّارِ إِلَّا رَبُّ النَّارِحَدَّثَنَا يَزِيدُ بْنُ خَالِدٍ وَقُتَيْبَةُ أَنَّ اللَّيْثَ بْنَ سَعْدٍ حَدَّثَهُمْ عَنْ بُكَيْرٍ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ قَالَ بَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْثٍ فَقَالَ إِنْ وَجَدْتُمْ فُلَانًا وَفُلَانًا فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur], telah menceritakan kepada kami [Mughirah bin Abdurrahman Al Hizami], dari [Abu Az Zinad], telah menceritakan kepadaku [Muhammad bin Hamzah Al Aslami], dari [ayahnya], bahwa Rasulullah shallallahu wa'alaihi wa sallam telah menunjuknya sebagai pemimpin sebuah kesatuan militer. Hamzah Al Aslami berkata; kemudian aku keluar diantara pasukan tersebut. Beliau berkata: \"Apabila kalian mendapatkan Fulan, maka bakarlah dia dengan api.\" Kemudian aku pergi, lalu beliau memanggilku lalu aku kembali kepada beliau. Beliau berkata: \"Apabila kalian mendapatkan Fulan maka bunuhlah dia, dan jangan kalian bakar! Sesungguhnya tidak ada yang boleh menyiksa dengan api kecuali Tuhan Penguasa api.\" Telah menceritakan kepada kami [Yazid? bin Khalid], dan [Qutaibah] bahwa [Al Laits bin Sa'd] telah menceritakan kepada mereka dari [Bukair] dari [Sulaiman bin Yasar] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam mengirim kami dalam sebuah pasukan. Kemudian beliau berkata: \"Apabila kalian mendapatkan Fulan dan Fulan ….. kemudian Yazid bin Khalid menyebutkan hadits semakna dengan hadits tersebut. "
            },
            {
                "number": 2235,
                "arab": "حَدَّثَنَا أَبُو صَالِحٍ مَحْبُوبُ بْنُ مُوسَى أَخْبَرَنَا أَبُو إِسْحَقَ الْفَزَارِيُّ عَنْ أَبِي إِسْحَقَ الشَّيْبَانِيِّ عَنْ ابْنِ سَعْدٍ قَالَ غَيْرُ أَبِي صَالِحٍ عَنْ الْحَسَنِ بْنِ سَعْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَانْطَلَقَ لِحَاجَتِهِ فَرَأَيْنَا حُمَرَةً مَعَهَا فَرْخَانِ فَأَخَذْنَا فَرْخَيْهَا فَجَاءَتْ الْحُمَرَةُ فَجَعَلَتْ تَفْرِشُ فَجَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ فَجَعَ هَذِهِ بِوَلَدِهَا رُدُّوا وَلَدَهَا إِلَيْهَا وَرَأَى قَرْيَةَ نَمْلٍ قَدْ حَرَّقْنَاهَا فَقَالَ مَنْ حَرَّقَ هَذِهِ قُلْنَا نَحْنُ قَالَ إِنَّهُ لَا يَنْبَغِي أَنْ يُعَذِّبَ بِالنَّارِ إِلَّا رَبُّ النَّارِ",
                "id": "Telah menceritakan kepada kami [Abu Shalih Mahbub bin Musa], telah mengabarkan kepada kami [Abu Ishaq Al Fazari], dari [Abu Ishaq Asy Syaibani], dari [Ibnu Sa'd], telah berkata selain Shalih, dari Al Hasan bin Sa'd dari [Abdurrahman bin Abdullah] dari [ayahnya], ia berkata; kami pernah bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan, kemudian beliau pergi untuk suatu keperluannya, kemudian kami melihat seekor burung bersama kedua anaknya. Lalu kami mengambil kedua anaknya, kemudian burung tersebut datang dan mengepak-ngepakkan sayapnya. Kemudian Nabi shallallahu 'alaihi wasallam datang dan berkata: \"Siapakah yang menyakiti burung ini dengan mengambil anaknya? Kembalikan anaknya kepadanya.\" Dan Rasulullah shallallahu 'alaihi wasallam melihat kelompok semut yang telah kami bakar, kemudian beliau bersabda: \"Siapakah yang telah membakar semut ini?\" Kami katakan; kami. Beliau berkata: \"Sesungguhnya tidak layak untuk menyiksa dengan api kecuali Tuhan Penguasa api.\""
            },
            {
                "number": 2236,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ أَبُو النَّضْرِ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ أَخْبَرَنِي أَبُو زَرْعَةَ يَحْيَى بْنُ أَبِي عَمْرٍو السَّيْبَانِيُّ عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ أَنَّهُ حَدَّثَهُ عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ فَخَرَجْتُ إِلَى أَهْلِي فَأَقْبَلْتُ وَقَدْ خَرَجَ أَوَّلُ صَحَابَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَطَفِقْتُ فِي الْمَدِينَةِ أُنَادِي أَلَا مَنْ يَحْمِلُ رَجُلًا لَهُ سَهْمُهُ فَنَادَى شَيْخٌ مِنْ الْأَنْصَارِ قَالَ لَنَا سَهْمُهُ عَلَى أَنْ نَحْمِلَهُ عَقَبَةً وَطَعَامُهُ مَعَنَا قُلْتُ نَعَمْ قَالَ فَسِرْ عَلَى بَرَكَةِ اللَّهِ تَعَالَى قَالَ فَخَرَجْتُ مَعَ خَيْرِ صَاحِبٍ حَتَّى أَفَاءَ اللَّهُ عَلَيْنَا فَأَصَابَنِي قَلَائِصُ فَسُقْتُهُنَّ حَتَّى أَتَيْتُهُ فَخَرَجَ فَقَعَدَ عَلَى حَقِيبَةٍ مِنْ حَقَائِبِ إِبِلِهِ ثُمَّ قَالَ سُقْهُنَّ مُدْبِرَاتٍ ثُمَّ قَالَ سُقْهُنَّ مُقْبِلَاتٍ فَقَالَ مَا أَرَى قَلَائِصَكَ إِلَّا كِرَامًا قَالَ إِنَّمَا هِيَ غَنِيمَتُكَ الَّتِي شَرَطْتُ لَكَ قَالَ خُذْ قَلَائِصَكَ يَا ابْنَ أَخِي فَغَيْرَ سَهْمِكَ أَرَدْنَا",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim Ad Damasyqi Abu An Nadhr], telah menceritakan kepada kami [Muhammad bin Syu'aib], telah mengabarkan kepadaku [Abu Zar'ah bin Abu 'Amr As Saibani], dari ['Amr bin Abdullah] bahwa ia telah menceritakan kepadanya dari [Watsilah bin Al Asqa'], ia berkata; Rasulullah shallallahu 'alaihi wasallam berada pada perang Tabuk, kemudian aku keluar kepada keluargaku lalu datang, sementara sahabat Rasulullah shallallahu 'alaihi wasallam yang pertama telah keluar, kemudian aku berseru di Madinah; adakah orang yang mau membawa seseorang dan untuknya sahamnya? Kemudian terdapat orang tua dari kalangan anshar berseru; untuk kami saham (bagian) nya, dengan kami memboncengkannya di belakang, dan makanannya bersama kami. Aku katakan; ya. Watsilah berkata; lalu aku berjalan dengan berkah Allah ta'ala. Ia berkata; aku keluar bersama teman terbaik hingga Allah memberikan harta fai` (rampasan perang) kepada kami. Aku mendapatkan beberapa unta, kemudian aku menggiringnya hingga aku datang kepadanya. Lalu ia keluar dan duduk di atas ransel diantara ransel-ransel untanya kemudian ia berkata; giringlah unta-unta tersebut mundur! Kemudian ia berkata; giringlah unta-unta tersebut maju! Lalu ia berkata; aku tidak mengetahui unta-untamu melainkan adalah unta-unta yang mulia. Ia berkata; sesungguhnya unta-unta tersebut adalah ghanimahmu yang telah aku syaratkan kepadamu. Ia berkata; ambillah unta-untamu wahai saudaraku. Kami menginginkan selain saham (bagian) mu. "
            },
            {
                "number": 2237,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ أَخْبَرَنَا مُحَمَّدُ بْنُ زِيَادٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عَجِبَ رَبُّنَا عَزَّ وَجَلَّ مِنْ قَوْمٍ يُقَادُونَ إِلَى الْجَنَّةِ فِي السَّلَاسِلِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad bin Salamah], telah mengabarkan kepada kami [Muhammad bin Ziyad], ia berkata; saya mendengar [Abu Hurairah] berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam berkata; Tuhan kita 'azza wajalla kagum kepada sebuah kaum yang digiring menuju Surga dalam rantai. "
            },
            {
                "number": 2238,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ أَبِي الْحَجَّاجِ أَبُو مَعْمَرٍ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ يَعْقُوبَ بْنِ عُتْبَةَ عَنْ مُسْلِمِ بْنِ عَبْدِ اللَّهِ عَنْ جُنْدُبِ بْنِ مَكِيثٍ قَالَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدَ اللَّهِ بْنَ غَالِبٍ اللَّيْثِيَّ فِي سَرِيَّةٍ وَكُنْتُ فِيهِمْ وَأَمَرَهُمْ أَنْ يَشُنُّوا الْغَارَةَ عَلَى بَنِي الْمُلَوِّحِ بِالْكَدِيدِ فَخَرَجْنَا حَتَّى إِذَا كُنَّا بِالْكَدِيدِ لَقِينَا الْحَارِثَ بْنَ الْبَرْصَاءِ اللَّيْثِيَّ فَأَخَذْنَاهُ فَقَالَ إِنَّمَا جِئْتُ أُرِيدُ الْإِسْلَامَ وَإِنَّمَا خَرَجْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْنَا إِنْ تَكُنْ مُسْلِمًا لَمْ يَضُرَّكَ رِبَاطُنَا يَوْمًا وَلَيْلَةً وَإِنْ تَكُنْ غَيْرَ ذَلِكَ نَسْتَوْثِقُ مِنْكَ فَشَدَدْنَاهُ وِثَاقًا",
                "id": "Telah menceritakan kepada kami [Abdullah bin 'Amr bin Abu Al Hajjaj Abu Ma'mar], telah menceritakan kepada kami [Abdul Warits], telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Ya'qub bin 'Utbah], dari [Muslim bin Abdullah] dari [Jundub bin Makits], ia berkata; Rasulullah shallallahu 'alaihi wasallam mengirim Abdullah bin Ghalib Al Laits dalam sebuah kesatuan militer, dan aku berada diantara mereka. Dan beliau memerintahkan mereka agar menyebar dalam menyerang Bani Al Mulawwih di Al Kadid. Kemudian kami keluar hingga kami sampai di Al Kadid kami bertemu dengan Al Harits bin Al Barsha` Al Laitsi lalu kami menangkapnya. Kemudian ia berkata; sesungguhnya saya datang untuk masuk Islam. Sesungguhnya aku keluar kepada Rasulullah shallallahu 'alaihi wasallam. Maka kami katakan; apabila engkau adalah seorang muslim maka para penjaga kami tidak akan membahayakanmu selama satu hari satu malam. Dan jika engkau tidak demikian maka kami akan mengikatmu dan akan kami kencangkan ikatanmu. "
            },
            {
                "number": 2239,
                "arab": "حَدَّثَنَا عِيسَى بْنُ حَمَّادٍ الْمِصْرِيُّ وَقُتَيْبَةُ قَالَ قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْلًا قِبَلَ نَجْدٍ فَجَاءَتْ بِرَجُلٍ مِنْ بَنِي حَنِيفَةَ يُقَالُ لَهُ ثُمَامَةُ بْنُ أُثَالٍ سَيِّدُ أَهْلِ الْيَمَامَةِ فَرَبَطُوهُ بِسَارِيَةٍ مِنْ سَوَارِي الْمَسْجِدِ فَخَرَجَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَاذَا عِنْدَكَ يَا ثُمَامَةُ قَالَ عِنْدِي يَا مُحَمَّدُ خَيْرٌ إِنْ تَقْتُلْ تَقْتُلْ ذَا دَمٍ وَإِنْ تُنْعِمْ تُنْعِمْ عَلَى شَاكِرٍ وَإِنْ كُنْتَ تُرِيدُ الْمَالَ فَسَلْ تُعْطَ مِنْهُ مَا شِئْتَ فَتَرَكَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا كَانَ الْغَدُ ثُمَّ قَالَ لَهُ مَا عِنْدَكَ يَا ثُمَامَةُ فَأَعَادَ مِثْلَ هَذَا الْكَلَامِ فَتَرَكَهُ حَتَّى كَانَ بَعْدَ الْغَدِ فَذَكَرَ مِثْلَ هَذَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَطْلِقُوا ثُمَامَةَ فَانْطَلَقَ إِلَى نَخْلٍ قَرِيبٍ مِنْ الْمَسْجِدِ فَاغْتَسَلَ فِيهِ ثُمَّ دَخَلَ الْمَسْجِدَ فَقَالَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ وَسَاقَ الْحَدِيثَ قَالَ عِيسَى أَخْبَرَنَا اللَّيْثُ وَقَالَ ذَا ذِمٍّ",
                "id": "Telah menceritakan kepada kami [Isa bin Hammad Al Mishri], dan [Qutaibah], Qutaibah berkata; telah menceritakan kepada kami [Al Laits bin Sa'd] dari [Sa'id bin Abu Sa'id] bahwa ia mendengar [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam mengirimkan pasukan penunggang kuda menuju Najd, kemudian pasukan tersebut membawa seorang laki-laki dari Bani Hanifah yang bernama Tsumamah bin Utsal pemimpin penduduk Yamamah. Kemudian mereka mengikatnya pada sebuah tiang masjid, kemudian Rasulullah shallallahu 'alaihi wasallam keluar kepadanya. Lalu beliau berkata: \"Bagaimana keadaanmu wahai Tsumamah?\" Ia berkata; keadaanku baik wahai Muhammad. Apabila engkau membunuh maka engkau membunuh orang yang memiliki darah, dan apabila engkau memberi kenikmatan maka engkau memberi kenikmatan kepada orang yang akan berterima kasih. Dan apabila engkau menghendaki harta, mintalah maka engkau akan diber apa yang engkau kehendaki. Kemudian Rasulullah shallallahu 'alaihi wasallam meninggalkannya. Kemudian keesokan harinya beliau berkata: \"Bagaimana keadaanmu wahai Tsumamah?\" kemudian ia mengulangi seperti perkataan ini. Lalu beliau meninggalkannya. Kemudian keesokan harinya, lalu beliau menyebutkan seperti ini. Lalu beliau berkata: \"Lepaskan Tsumamah!\" Kemudian ia pergi ke sebuah pohon kurma dekat masjid, lalu ia mandi padanya kemudian memasuki masjid dan berkata; aku bersaksi bahwa tidak ada tuhan yang berhak disembah kecuali Allah dan aku bersaksi bahwa Muhammad adalah hamba dan utusanNya. Dan Abu Hurairah menyebutkan hadits tersebut. Isa berkata; telah mengabarkan kepada kami [Al Laits] dan ia mengatakan; orang yang memiliki celaan. "
            },
            {
                "number": 2240,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو الرَّازِيُّ قَالَ حَدَّثَنَا سَلَمَةُ يَعْنِي ابْنَ الْفَضْلِ عَنْ ابْنِ إِسْحَقَ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَعْدِ بْنِ زُرَارَةَ قَالَقُدِمَ بِالْأُسَارَى حِينَ قُدِمَ بِهِمْ وَسَوْدَةُ بِنْتُ زَمْعَةَ عِنْدَ آلِ عَفْرَاءَ فِي مُنَاخِهِمْ عَلَى عَوْفٍ وَمُعَوِّذٍ ابْنَيْ عَفْرَاءَ قَالَ وَذَلِكَ قَبْلَ أَنْ يُضْرَبَ عَلَيْهِنَّ الْحِجَابُ قَالَ تَقُولُ سَوْدَةُ وَاللَّهِ إِنِّي لَعِنْدَهُمْ إِذْ أَتَيْتُ فَقِيلَ هَؤُلَاءِ الْأُسَارَى قَدْ أُتِيَ بِهِمْ فَرَجَعْتُ إِلَى بَيْتِي وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِ وَإِذَا أَبُو يَزِيدَ سُهَيْلُ بْنُ عَمْرٍو فِي نَاحِيَةِ الْحُجْرَةِ مَجْمُوعَةٌ يَدَاهُ إِلَى عُنُقِهِ بِحَبْلٍ ثُمَّ ذَكَرَ الْحَدِيثَقَالَ أَبُو دَاوُد وَهُمَا قَتَلَا أَبَا جَهْلِ بْنَ هِشَامٍ وَكَانَا انْتَدَبَا لَهُ وَلَمْ يَعْرِفَاهُ وَقُتِلَا يَوْمَ بَدْرٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Amr Ar Razi], ia berkata; telah menceritakan kepada kami [Salamah bin Al Fadhl] dari [Ibnu Ishaq], ia berkata; telah menceritakan kepadaku [Abdullah bin Abu Bakr] dari [Yahya bin Abdullah bin Abdurrahman bin Sa'd bin Zurarah], ia berkata; telah di hadapkan beberapa tawanan kepada 'Auf dan 'Mu'awwidz kedua anak 'Afra` ketika [Saudah binti Zam'ah] berada di rumah keluarga 'Afra` di tempat penambatan unta mereka, dan hal tersebut sebelum diwajibkannya berhijab. Yahya berkata; Saudah berkata; demi Allah, aku berada di rumah mereka tatkala aku datang. Kemudian dikatakan; para tawanan ini telah dibawa. Kemudian aku kembali ke rumahku dan Rasulullah shallallahu 'alaihi wasallam berada di dalamnya. Dan ternyata Abu Yazid Suhail bin 'Amr berada di pojok ruangan tangannya terikat di lehernya dengan sebuah tali. Kemudian Yahya menyebutkan hadits tersebut. Abu Daud berkata; dan keduanya telah membunuh Abu Jahl bin Hisyam, dan keduanya telah menyambutnya dan tidak mengenalnya, dan mereka berdua terbunuh pada saat perang Badr. "
            },
            {
                "number": 2241,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَدَبَ أَصْحَابَهُ فَانْطَلَقُوا إِلَى بَدْرٍ فَإِذَا هُمْ بِرَوَايَا قُرَيْشٍ فِيهَا عَبْدٌ أَسْوَدُ لِبَنِي الْحَجَّاجِ فَأَخَذَهُ أَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَعَلُوا يَسْأَلُونَهُ أَيْنَ أَبُو سُفْيَانَ فَيَقُولُ وَاللَّهِ مَالِي بِشَيْءٍ مِنْ أَمْرِهِ عِلْمٌ وَلَكِنْ هَذِهِ قُرَيْشٌ قَدْ جَاءَتْ فِيهِمْ أَبُو جَهْلٍ وَعُتْبَةُ وَشَيْبَةُ ابْنَا رَبِيعَةَ وَأُمَيَّةُ بْنُ خَلَفٍ فَإِذَا قَالَ لَهُمْ ذَلِكَ ضَرَبُوهُ فَيَقُولُ دَعُونِي دَعُونِي أُخْبِرْكُمْ فَإِذَا تَرَكُوهُ قَالَ وَاللَّهِ مَالِي بِأَبِي سُفْيَانَ مِنْ عِلْمٍ وَلَكِنْ هَذِهِ قُرَيْشٌ قَدْ أَقْبَلَتْ فِيهِمْ أَبُو جَهْلٍ وَعُتْبَةُ وَشَيْبَةُ ابْنَا رَبِيعَةَ وَأُمَيَّةُ بْنُ خَلَفٍ قَدْ أَقْبَلُوا وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي وَهُوَ يَسْمَعُ ذَلِكَ فَلَمَّا انْصَرَفَ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّكُمْ لَتَضْرِبُونَهُ إِذَا صَدَقَكُمْ وَتَدَعُونَهُ إِذَا كَذَبَكُمْ هَذِهِ قُرَيْشٌ قَدْ أَقْبَلَتْ لِتَمْنَعَ أَبَا سُفْيَانَ قَالَ أَنَسٌ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا مَصْرَعُ فُلَانٍ غَدًا وَوَضَعَ يَدَهُ عَلَى الْأَرْضِ وَهَذَا مَصْرَعُ فُلَانٍ غَدًا وَوَضَعَ يَدَهُ عَلَى الْأَرْضِ وَهَذَا مَصْرَعُ فُلَانٍ غَدًا وَوَضَعَ يَدَهُ عَلَى الْأَرْضِ فَقَالَ وَالَّذِي نَفْسِي بِيَدِهِ مَا جَاوَزَ أَحَدٌ مِنْهُمْ عَنْ مَوْضِعِ يَدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأُخِذَ بِأَرْجُلِهِمْ فَسُحِبُوا فَأُلْقُوا فِي قَلِيبِ بَدْرٍ",
                "id": "Telah menceritakan kepada kami [Musa bin Ismai'i], ia berkata; telah menceritakan kepada kami [Hammad] dari [Tsabit] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam memanggil para sahabatnya, kemudian mereka pergi ke Badr, dan ternyata mereka mendapatkan beberapa unta Quraisy padanya terdapat seorang budak hitam milik Bani Hajjaj, kemudian ia ditangkap para sahabat Rasulullah shallallahu 'alaihi wasallam. Kemudian mereka menginterogasinya; dimanakah Abu Sufyan? Kemudian budak tersebut berkata; demi Allah, aku tidak tahu mengenainya sama sekali. Akan tetapi orang-orang Quraisy telah datang, diantara mereka terdapat Abu Jahl dan 'Utbah serta Syaibah dua anak Rabi'ah, dan Umayyah bin Khalaf. Ketika ia berkata demikian kepada mereka maka mereka memukulinya, lalu ia berkata; biarkan aku, biarkan aku! Aku akan beritahu kalian. Kemudian tatkala mereka membiarkannya ia berkata; demi Allah aku tidak mengetahui mengenai Abu Sufyan sama sekali. Akan tetapi orang-orang Quraisy telah datang, diantara mereka terdapat Abu Jahl dan 'Utbah serta Syaibah dua anak Rabi'ah, dan Umayyah bin Khalaf. Mereka telah datang. Sementera Nabi shallallahu 'alaihi wasallam melakukan sholat dan mendengar hal tersebut, kemudian tatkala pergi beliau mengatakan; demi Dzat yang jiwaku ada di tanganNya, sesungguhnya kalian akan memukulnya apabila ia berkata jujur kepada kalian, dan kalian akan membiarkannya apabila ia berdusta kepada kalian. Inilah orang-orang Quraisy, mereka telah datang untuk mencegah Abu Sufyan. Anas berkata; Rasulullah shallallahu 'alaihi wasallam berkata: \"Ini adalah tempat terbunuhnya Fulan besok.\" Dan beliau meletakkan tangannya di atas tanah.\"Dan ini adalah tempat terbunuhnya Fulan besok.\" Dan beliau meletakkan tangannya di atas tanah.\"Dan ini adalah tempat terbunuhnya Fulan besok.\" Dan beliau meletakkan tangannya di atas tanah. Anas berkata; demi Allah tidak ada seorangpun diantara mereka yang melewati tempat tangan Rasulullah shallallahu 'alaihi wasallam. Kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkan agar mereka dikumpulkan, lalu dipegang kaki mereka dan diseret dan dilemparkan ke dalam lubang Badr. "
            },
            {
                "number": 2242,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ عَلِيٍّ الْمُقَدَّمِيُّ قَالَ حَدَّثَنَا أَشْعَثُ بْنُ عَبْدِ اللَّهِ يَعْنِي السِّجِسْتَانِيَّ ح و حَدَّثَنَا ابْنُ بَشَّارٍ قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ وَهَذَا لَفْظُهُ ح و حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ قَالَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ عَنْ شُعْبَةَ عَنْ أَبِي بِشْرٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَتْ الْمَرْأَةُ تَكُونُ مِقْلَاتًا فَتَجْعَلُ عَلَى نَفْسِهَا إِنْ عَاشَ لَهَا وَلَدٌ أَنْ تُهَوِّدَهُ فَلَمَّا أُجْلِيَتْ بَنُو النَّضِيرِ كَانَ فِيهِمْ مِنْ أَبْنَاءِ الْأَنْصَارِ فَقَالُوا لَا نَدَعُ أَبْنَاءَنَا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ لَا إِكْرَاهَ فِي الدِّينِ قَدْ تَبَيَّنَ الرُّشْدُ مِنْ الْغَيِّ }قَالَ أَبُو دَاوُد الْمِقْلَاتُ الَّتِي لَا يَعِيشُ لَهَا وَلَدٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Umar bin Ali Al Muqaddami], ia berkata; telah menceritakan kepada kami [Asy'ats bin Abdullah As Sijistani], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Ibnu Basysyar], ia berkata; telah menceritakan kepada kami [Ibnu Abu Adi], dan ini adalah lafazhnya. Dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Al Hasan bin Ali], ia berkata; telah menceritakan kepada kami [Wahb bin Jarir], dari [Syu'bah] dari [Abu Bisyr] dari [Sa'id? bin Jubair] dari [Ibnu Abbas], ia berkata; terdapat seorang wanita yang tidak memiliki anak karena terus meninggal, kemudian ia bersumpah atas dirinya bahwa apabila ia memiliki anak yang hidup maka ia akan menjadikannya seorang Yahudi. Kemudian tatkala Bani Nadhir diusir, diantara mereka terdapat anak-anak orang anshar, kemudian mereka mengatakan; kita tidak akan meninggalkan anak-anak kita. Kemudian Allah menurunkan ayat: \"Tidak ada paksaan untuk (memasuki) agama (Islam); sesungguhnya telah jelas jalan yang benar daripada jalan yang sesat.\" Abu Daud berkata; Miqlat adalah wanita yang tidak memiliki anak yang hidup. "
            },
            {
                "number": 2243,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا أَسْبَاطُ بْنُ نَصْرٍ قَالَ زَعَمَ السُّدِّيُّ عَنْ مُصْعَبِ بْنِ سَعْدٍ عَنْ سَعْدٍ قَالَلَمَّا كَانَ يَوْمُ فَتْحِ مَكَّةَ أَمَّنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّاسَ إِلَّا أَرْبَعَةَ نَفَرٍ وَامْرَأَتَيْنِ وَسَمَّاهُمْ وَابْنُ أَبِي سَرْحٍ فَذَكَرَ الْحَدِيثَ قَالَ وَأَمَّا ابْنُ أَبِي سَرْحٍ فَإِنَّهُ اخْتَبَأَ عِنْدَ عُثْمَانَ بْنِ عَفَّانَ فَلَمَّا دَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّاسَ إِلَى الْبَيْعَةِ جَاءَ بِهِ حَتَّى أَوْقَفَهُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا نَبِيَّ اللَّهِ بَايِعْ عَبْدَ اللَّهِ فَرَفَعَ رَأْسَهُ فَنَظَرَ إِلَيْهِ ثَلَاثًا كُلُّ ذَلِكَ يَأْبَى فَبَايَعَهُ بَعْدَ ثَلَاثٍ ثُمَّ أَقْبَلَ عَلَى أَصْحَابِهِ فَقَالَ أَمَا كَانَ فِيكُمْ رَجُلٌ رَشِيدٌ يَقُومُ إِلَى هَذَا حَيْثُ رَآنِي كَفَفْتُ يَدِي عَنْ بَيْعَتِهِ فَيَقْتُلُهُ فَقَالُوا مَا نَدْرِي يَا رَسُولَ اللَّهِ مَا فِي نَفْسِكَ أَلَا أَوْمَأْتَ إِلَيْنَا بِعَيْنِكَ قَالَ إِنَّهُ لَا يَنْبَغِي لِنَبِيٍّ أَنْ تَكُونَ لَهُ خَائِنَةُ الْأَعْيُنِقَالَ أَبُو دَاوُد كَانَ عَبْدُ اللَّهِ أَخَا عُثْمَانَ مِنْ الرِّضَاعَةِ وَكَانَ الْوَلِيدُ بْنُ عُقْبَةَ أَخَا عُثْمَانَ لِأُمِّهِ وَضَرَبَهُ عُثْمَانُ الْحَدَّ إِذْ شَرِبَ الْخَمْرَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], ia berkata; telah menceritakan kepada kami [Ahmad bin Al Mufadhdhal], ia berkata; telah menceritakan kepada kami [Asbath bin Nashr], ia berkata; [As Suddi] mengaku dari [Mush'ab bin Sa'd], dari [Sa'id], ia berkata; tatkala terjadi penaklukan Mekkah Rasulullah shallallahu 'alaihi wasallam memberikan keamanan kepada semua orang kecuali empat orang laki-laki dan dua orang wanita, dan beliau menyebutkan mereka, serta Ibnu Abu Sarh. Kemudian Sa'id menyebutkan hadits tersebut, ia berkata; adapun Ibnu Abu Sarh, ia bersembunyi di rumah Utsman bin Affan, kemudian tatkala Rasulullah shallallahu 'alaihi wasallam menyeru untuk berbai'ah, Utsman membawanya ke hadapan Rasulullah shallallahu wa'alaihi wa sallam dan berkata; wahai Nabi Allah, bai'atlah Abdullah. Kemudian beliau mengangkat kepalanya dan melihat kepadanya tiga kali, setiap melakukan tersebut beliau enggan untuk memba'iatnya. Kemudian setelah tiga kali beliau membai'atnya lalu beliau menghadap kepada para sahabatnya dan berkata: \"Bukankah diantara kalian ada orang yang berakal yang mendatangi orang ini dimana ia melihatku. Aku menahan diri dari memba'iatnya, lalu ia membunuhnya?\" Mereka berkata; kami tidak mengetahui wahai Rasulullah, apa yang ada di dalam hati anda. Bukankah anda telah memberi isyarat kepada kami dengan mata anda? Beliau berkata: \"Sesungguhnya tidak selayaknya seorang nabi memiliki mata khianat.\" Abu Daud berkata; Abdullah adalah saudara Utsman sepersusuan. Al Walid bin 'Uqbah adalah saudara Utsman seibu, dan Utsman telah mencambuknya tatkala ia meminum arak. "
            },
            {
                "number": 2244,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَعِيدِ بْنِ يَرْبُوعٍ الْمَخْزُومِيُّ قَالَ حَدَّثَنِي جَدِّي عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَوْمَ فَتْحِ مَكَّةَ أَرْبَعَةٌ لَا أُؤَمِّنُهُمْ فِي حِلٍّ وَلَا حَرَمٍ فَسَمَّاهُمْ قَالَ وَقَيْنَتَيْنِ كَانَتَا لِمِقْيَسٍ فَقُتِلَتْ إِحْدَاهُمَا وَأَفْلَتَتْ الْأُخْرَى فَأَسْلَمَتْقَالَ أَبُو دَاوُد لَمْ أَفْهَمْ إِسْنَادَهُ مِنْ ابْنِ الْعَلَاءِ كَمَا أُحِبُّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`], ia berkata; telah menceritakan kepada kami [Zaid bin Al Hubab], ia berkata; telah mengabarkan kepada kami ['Amr bin Utsman bin Abdurrahman bin Sa'id bin Yarbu' Al Makhzumi], ia berkata; telah menceritakan kepadaku [kakekku], dari [ayahku] bahwa Rasulullah shallallahu wa'alaihi wa sallam berkata pada saat penaklukan Mekkah: \"Ada empat orang yang tidak aku beri mereka jaminan baik di luar tanah haram maupun di tanah haram.\" Kemudian beliau menyebutkan mereka dan berkata: serta dua orang budak penyanyi milik Miqyas. Kemudian salah seorang diantara mereka dibunuh dan yang lainnya dilepaskan, kemudian ia masuk Islam. Abu Daud berkata; aku tidak faham sanadnya dari Ibnu Al 'Ala` sebagaimana yang aku inginkan. "
            },
            {
                "number": 2245,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ مَكَّةَ عَامَ الْفَتْحِ وَعَلَى رَأْسِهِ الْمِغْفَرُ فَلَمَّا نَزَعَهُ جَاءَهُ رَجُلٌ فَقَالَ ابْنُ خَطَلٍ مُتَعَلِّقٌ بِأَسْتَارِ الْكَعْبَةِ فَقَالَ اقْتُلُوهُقَالَ أَبُو دَاوُد ابْنُ خَطَلٍ اسْمُهُ عَبْدُ اللَّهِ وَكَانَ أَبُو بَرْزَةَ الْأَسْلَمِيُّ قَتَلَهُ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi], dari [Malik] dari [Ibnu Syihab] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam memasuki Mekkah pada saat penaklukan Mekkah, dan beliau memakai penutup kepala. Kemudian tatkala beliau melepasnya terdapat seorang laki-laki yang datang kepada beliau dan berkata; Ibnu Khathal bergantungan pada tabir Ka'bah. Lalu beliau berkata: \"Bunuhlah dia!\" Abu Daud berkata; Ibnu Khathal namanya adalah Abdullah, dan Abu Barzah Al Aslami adalah yang membunuhnya. "
            },
            {
                "number": 2246,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ الرَّقِّيُّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الرَّقِّيُّ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ إِبْرَاهِيمَ قَالَأَرَادَ الضَّحَّاكُ بْنُ قَيْسٍ أَنْ يَسْتَعْمِلَ مَسْرُوقًا فَقَالَ لَهُ عُمَارَةُ بْنُ عُقْبَةَ أَتَسْتَعْمِلُ رَجُلًا مِنْ بَقَايَا قَتَلَةِ عُثْمَانَ فَقَالَ لَهُ مَسْرُوقٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْعُودٍ وَكَانَ فِي أَنْفُسِنَا مَوْثُوقَ الْحَدِيثِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا أَرَادَ قَتْلَ أَبِيكَ قَالَ مَنْ لِلصِّبْيَةِ قَالَ النَّارُ فَقَدْ رَضِيتُ لَكَ مَا رَضِيَ لَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ali bin Al Husain Ar Raqqi], ia berkata; telah menceritakan kepada kami [Abdullah bin Ja'far Ar Raqqi], ia berkata; telah mengabarkan kepadaku ['ubaidhullah bin 'Amr], dari [Zaid bin Abu Unaisah] dari ['Amr bin Murrah] dari [Ibrahim], ia berkata; [Adh Dhahhak bin Qais] berkeinginan untuk memberikan jabatan kepada Masruq, kemudian 'Umarah bin 'Uqbah berkata kepadanya; apakah engkau akan memberikan jabatan kepada orang yang merupakan diantara sisa pembunuh Utsman? Maka Masruq berkata kepadanya; telah menceritakan kepada kami [Abdullah bin Mas'ud], ia menurut kami adalah orang yang dipercaya haditsnya, bahwa Nabi shallallahu 'alaihi wasallam tatkala hendak membunuh ayahmu beliau berkata; siapakah yang akan mengurus anak ini? Beliau berkata; api. Aku telah ridha sebagaimana keridhaan Rasulullah shallallahu 'alaihi wasallam. "
            },
            {
                "number": 2247,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ ابْنِ تِعْلَى قَالَغَزَوْنَا مَعَ عَبْدِ الرَّحْمَنِ بْنِ خَالِدِ بْنِ الْوَلِيدِ فَأُتِيَ بِأَرْبِعَةِ أَعْلَاجٍ مِنْ الْعَدُوِّ فَأَمَرَ بِهِمْ فَقُتِلُوا صَبْرًاقَالَ أَبُو دَاوُد قَالَ لَنَا غَيْرُ سَعِيدٍ عَنْ ابْنِ وَهْبٍ فِي هَذَا الْحَدِيثِ قَالَ بِالنَّبْلِ صَبْرًا فَبَلَغَ ذَلِكَ أَبَا أَيُّوبَ الْأَنْصَارِيَّ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ قَتْلِ الصَّبْرِ فَوَالَّذِي نَفْسِي بِيَدِهِ لَوْ كَانَتْ دَجَاجَةٌ مَا صَبَرْتُهَا فَبَلَغَ ذَلِكَ عَبْدَ الرَّحْمَنِ بْنَ خَالِدِ بْنِ الْوَلِيدِ فَأَعْتَقَ أَرْبَعَ رِقَابٍ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur], ia berkata; telah menceritakan kepada kami [Abdullah bin Wahb], ia berkata; telah mengabarkan kepadaku ['Amr bin Al Harits] dari [Bukair bin Abdullah bin Al Asyajj], dari [Ibnu Ya'la], ia berkata; kami pernah berperang bersama Abdurrahman bin Khalid bin Al Walid, kemudian ia diberi empat orang musuh yang kuat, kemudian ia memerintahkan untuk membunuh mereka. Kemudian mereka di bunuh dengan ditahan dan dilempari. Abu Daud berkata; selain Sa'id telah berkata kepadaku dari Ibnu Wahb dalam hadits ini, ia berkata; dengan melempari anak panah. Kemudian hal tersebut sampai kepada [Abu Ayyub Al Anshari], lalu ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam melarang dari membunuh dengan cara menahan dan melemparinya. Demi Dzat yang jiwaku ada di tanganku, seandainya hal tersebut adalah ayam betina, maka aku tidak akan menjadikannya sasaran. Kemudian hal tersebut sampai kepada Abdurrahman bin Khalid bin Al Walid, kemudian ia memerdekakan empat orang budak. "
            },
            {
                "number": 2248,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا حَمَّادٌ قَالَ أَخْبَرَنَا ثَابِتٌ عَنْ أَنَسٍأَنَّ ثَمَانِينَ رَجُلًا مِنْ أَهْلِ مَكَّةَ هَبَطُوا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابِهِ مِنْ جِبَالِ التَّنْعِيمِ عِنْدَ صَلَاةِ الْفَجْرِ لِيَقْتُلُوهُمْ فَأَخَذَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سِلْمًا فَأَعْتَقَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ وَهُوَ الَّذِي كَفَّ أَيْدِيَهُمْ عَنْكُمْ وَأَيْدِيَكُمْ عَنْهُمْ بِبَطْنِ مَكَّةَ }إِلَى آخِرِ الْآيَةِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad], ia berkata; telah mengabarkan kepada kami [Tsabit] dari [Anas] bahwa delapan puluh orang penduduk Mekkah telah turun kepada Nabi shallallahu 'alaihi wasallam dan para sahabatnya dari gunung di Tan'im pada saat sholat Fajar untuk membunuh mereka. Kemudian Rasulullah shallallahu 'alaihi wasallam menangkap mereka dalam karena menyerahkan diri, kemudian Rasulullah shallallahu 'alaihi wasallam membebaskan mereka. Lalu Allah menurunkan ayat: \"Dan Dia-lah yang menahan tangan mereka dari (membinasakan) kamu dan (menahan) tangan kamu dari (membinasakan) mereka di tengah kota Mekah sesudah Allah memenangkan kamu atas mereka, dan adalah Allah Maha Melihat apa yang kamu kerjakan.\""
            },
            {
                "number": 2249,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ مُحَمَّدِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأُسَارَى بَدْرٍ لَوْ كَانَ مُطْعِمُ بْنُ عَدِيٍّ حَيًّا ثُمَّ كَلَّمَنِي فِي هَؤُلَاءِ النَّتْنَى لَأَطْلَقْتُهُمْ لَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris], ia berkata; telah menceritakan kepada kami [Abdurrazzaq], ia berkata; telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri], dari [Muhammad bin Jubair bin Muth'im] dari [ayahnya] bahwa Nabi shallallahu 'alaihi wasallam berkata kepada para tawanan Badr; seandainya Muth'im bin 'Adi hidup kemudian berbicara kepadaku mengenai orang-orang kafir ini sungguh aku akan membebaskan mereka untuknya. "
            },
            {
                "number": 2250,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ قَالَ حَدَّثَنَا أَبُو نُوحٍ قَالَ أَخْبَرَنَا عِكْرِمَةُ بْنُ عَمَّارٍ قَالَ حَدَّثَنَا سِمَاكٌ الْحَنَفِيُّ قَالَ حَدَّثَنِي ابْنُ عَبَّاسٍ قَالَ حَدَّثَنِي عُمَرُ بْنُ الْخَطَّابِ قَالَلَمَّا كَانَ يَوْمُ بَدْرٍ فَأَخَذَ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْفِدَاءَ أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ مَا كَانَ لِنَبِيٍّ أَنْ يَكُونَ لَهُ أَسْرَى حَتَّى يُثْخِنَ فِي الْأَرْضِ إِلَى قَوْلِهِ لَمَسَّكُمْ فِيمَا أَخَذْتُمْ }مِنْ الْفِدَاءِ ثُمَّ أَحَلَّ لَهُمْ اللَّهُ الْغَنَائِمَقَالَ أَبُو دَاوُد سَمِعْت أَحْمَدَ بْنَ حَنْبَلٍ يُسْأَلُ عَنْ اسْمِ أَبِي نُوحٍ فَقَالَ إِيشْ تَصْنَعُ بِاسْمِهِ اسْمُهُ اسْمٌ شَنِيعٌ قَالَ أَبُو دَاوُد اسْمُ أَبِي نُوحٍ قُرَادٌ وَالصَّحِيحُ عَبْدُ الرَّحْمَنِ بْنُ غَزْوَانَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Hanbal], ia berkata; telah menceritakan kepada kami [Abu Nuh], ia berkata; telah mengabarkan kepada kami [Ikrimah bin 'Ammar], ia berkata; telah menceritakan kepada kami [Simak Al Hanafi], ia berkata; telah menceritakan kepadaku [Ibnu Abbas], ia berkata; telah menceritakan kepadaku [Umar bin Al Khathab], ia berkata; pada saat perang Badr dan Nabi shallallahu 'alaihi wasallam mengambil tebusan maka Allah 'azza wajalla menurunkan ayat: \"Tidak patut, bagi seorang Nabi mempunyai tawanan sebelum ia dapat melumpuhkan musuhnya di muka bumi.\" Hingga firmanNya: \"niscaya kamu ditimpa siksaan yang besar karena tebusan yang kamu ambil.\" Karena tebusan tersebut, kemudian Allah menghalalkan bagi mereka rampasan perang. Abu Daud berkata; saya mendengar Ahmad bin Hanbal ditanya mengenai nama Abu Nuh, kemudian ia berkata; apa yang akan engkau lakukan dengan namanya? Namanya adalah nama buruk. Abu Daud berkata; nama Abu Nuh adalah Qurad, dan yang benar adalah Abdurrahman bin Ghazwan. "
            },
            {
                "number": 2251,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ الْعَيْشِيُّ قَالَ حَدَّثَنَا سُفْيَانُ بْنُ حَبِيبٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي الْعَنْبَسِ عَنْ أَبِي الشَّعْثَاءِ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَعَلَ فِدَاءَ أَهْلِ الْجَاهِلِيَّةِ يَوْمَ بَدْرٍ أَرْبَعَ مِائَةٍ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Al Mubarak Al 'Aisyi], ia berkata; telah menceritakan kepada kami [Sufyan bin Habib], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Abu Al 'Anbas], dari [Abu Asy Sya'tsa`] dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam telah menjadikan tebusan penduduk jahiliyah pada saat perang Badr empat ratus. "
            },
            {
                "number": 2252,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ يَحْيَى بْنِ عَبَّادٍ عَنْ أَبِيهِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ قَالَتْلَمَّا بَعَثَ أَهْلُ مَكَّةَ فِي فِدَاءِ أَسْرَاهُمْ بَعَثَتْ زَيْنَبُ فِي فِدَاءِ أَبِي الْعَاصِ بِمَالٍ وَبَعَثَتْ فِيهِ بِقِلَادَةٍ لَهَا كَانَتْ عِنْدَ خَدِيجَةَ أَدْخَلَتْهَا بِهَا عَلَى أَبِي الْعَاصِ قَالَتْ فَلَمَّا رَآهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَقَّ لَهَا رِقَّةً شَدِيدَةً وَقَالَ إِنْ رَأَيْتُمْ أَنْ تُطْلِقُوا لَهَا أَسِيرَهَا وَتَرُدُّوا عَلَيْهَا الَّذِي لَهَا فَقَالُوا نَعَمْ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ عَلَيْهِ أَوْ وَعَدَهُ أَنْ يُخَلِّيَ سَبِيلَ زَيْنَبَ إِلَيْهِ وَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْدَ بْنَ حَارِثَةَ وَرَجُلًا مِنْ الْأَنْصَارِ فَقَالَ كُونَا بِبَطْنِ يَأْجَجَ حَتَّى تَمُرَّ بِكُمَا زَيْنَبُ فَتَصْحَبَاهَا حَتَّى تَأْتِيَا بِهَا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq], dari [Yahya bin 'Abbad] dari [ayahnya yaitu 'Abbad bin Abdullah bin Az Zubair], dari [Aisyah], ia berkata; tatkala penduduk Quraisy mengirimkan tebusan para tawanan mereka maka Zainab mengirimkan tebusan Abu Al 'Ash, dan ia mengirimkan kalungnya yang dahulu ada pada Khadijah, ketika ia mempertemukannya dengan Abu Al 'Ash dengan memakai kalung tersebut. Aisyah berkata; kemudian tatkala Rasulullah shallallahu 'alaihi wasallam melihatnya beliau sangat tersentuh dan berkata: \"Apabila menurut kalian agar melepaskan tawanannya dan kalian kembalikan miliknya kepadanya?\" Mereka mengatakan; ya. Dan Rasulullah shallallahu 'alaihi wasallam telah mengambil kesepakatan dengannya atau berjanji kepadanya untuk membiarkan Zainab kembali kepadanya. Dan Rasulullah shallallahu 'alaihi wasallam telah mengutus Zaid bin Haritsah dan seorang laki-laki anshor. Beliau berkata: \"Hendaknya kalian berada di tengah Ya`jaj (tempat berjarak delapan mil dari Mekkah) hingga Zainab melewati kalian, lalu temanilah ia hingga kalian datang bersamanya.\""
            },
            {
                "number": 2253,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي مَرْيَمَ حَدَّثَنَا عَمِّي يَعْنِي سَعِيدَ بْنَ الْحَكَمِ قَالَ أَخْبَرَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ قَالَ وَذَكَرَ عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ مَرْوَانَ وَالْمِسْوَرَ بْنَ مَخْرَمَةَ أَخْبَرَاهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حِينَ جَاءَهُ وَفْدُ هَوَازِنَ مُسْلِمِينَ فَسَأَلُوهُ أَنْ يَرُدَّ إِلَيْهِمْ أَمْوَالَهُمْ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعِي مَنْ تَرَوْنَ وَأَحَبُّ الْحَدِيثِ إِلَيَّ أَصْدَقُهُ فَاخْتَارُوا إِمَّا السَّبْيَ وَإِمَّا الْمَالَ فَقَالُوا نَخْتَارُ سَبْيَنَا فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَثْنَى عَلَى اللَّهِ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنَّ إِخْوَانَكُمْ هَؤُلَاءِ جَاءُوا تَائِبِينَ وَإِنِّي قَدْ رَأَيْتُ أَنْ أَرُدَّ إِلَيْهِمْ سَبْيَهُمْ فَمَنْ أَحَبَّ مِنْكُمْ أَنْ يُطَيِّبَ ذَلِكَ فَلْيَفْعَلْ وَمَنْ أَحَبَّ مِنْكُمْ أَنْ يَكُونَ عَلَى حَظِّهِ حَتَّى نُعْطِيَهُ إِيَّاهُ مِنْ أَوَّلِ مَا يُفِيءُ اللَّهُ عَلَيْنَا فَلْيَفْعَلْ فَقَالَ النَّاسُ قَدْ طَيَّبْنَا ذَلِكَ لَهُمْ يَا رَسُولَ اللَّهِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّا لَا نَدْرِي مَنْ أَذِنَ مِنْكُمْ مِمَّنْ لَمْ يَأْذَنْ فَارْجِعُوا حَتَّى يَرْفَعَ إِلَيْنَا عُرَفَاؤُكُمْ أَمْرَكُمْ فَرَجَعَ النَّاسُ وَكَلَّمَهُمْ عُرَفَاؤُهُمْ فَأَخْبَرُوهُمْ أَنَّهُمْ قَدْ طَيَّبُوا وَأَذِنُوا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abu Maryam], telah menceritakan kepada kami [pamanku yaitu Sa'id bin Al Hakam], ia berkata; telah mengabarkan kepada kami [Al Laits bin Sa'd] dari ['Uqail] dari [Ibnu Syihab], ia berkata; dan ['Urwah bin Az Zubair] menyebutkan bahwa [Marwan] serta [Al Miswar bin Makhramah] telah mengabarkan kepadanya bahwa ketika utusan orang-orang muslim Hawazin datang kepada Rasulullah shallallahu 'alaihi wasallam dan meminta agar beliau mengembalikan harta mereka, maka beliau berkata kepada mereka: \"Bersamaku orang-orang yang kalian lihat, dan perkataan yang paling aku senangi adalah yang paling benar. Maka pilihlah tawanan atau harta!\" Lalu mereka berkata; kami memilih tawanan kami. Lalu Rasulullah shallallahu 'alaihi wasallam berdiri dan memuji Allah, kemudian beliau berkata: \"Adapun selanjutnya, sesungguhnya saudara-saudara kalian ini telah datang dalam keadaan bertaubat dan aku ingin mengembalikan tawanan kepada mereka. Maka barangsiapa diantara kalian yang ingin merelakan hal tersebut, silahkan ia melakukannya, dan barangsiapa yang hendak mengambil bagiannya hingga kami berikan kepadanya dari pertama kali Allah memberikan fai` kepada kita, maka silahkan ia melakukannya.\" Kemudian orang-orang berkata; kami telah merelakan hal tersebut untuk mereka wahai Rasulullah! Kemudian Rasulullah shallallahu 'alaihi wasallam berkata kepada mereka: \"Sesungguhnya kami tidak mengetahui siapakah diantara kalian yang mengizinkan dan siapakah diantara kalian yang tidak mengizinkan. Maka kembalilah, hingga para pemimpin kalian mengadukan perkara kalian kepada kami!\" Lalu orang-orang tersebut kembali dan berbicara dengan para pemimpin mereka. Kemudian memereka mengabarkan kepada mereka bahwa mereka telah merelakan dan mengizinkan. "
            },
            {
                "number": 2254,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ فِي هَذِهِ الْقِصَّةِ قَالَفَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُدُّوا عَلَيْهِمْ نِسَاءَهُمْ وَأَبْنَاءَهُمْ فَمَنْ مَسَكَ بِشَيْءٍ مِنْ هَذَا الْفَيْءِ فَإِنَّ لَهُ بِهِ عَلَيْنَا سِتَّ فَرَائِضَ مِنْ أَوَّلِ شَيْءٍ يُفِيئُهُ اللَّهُ عَلَيْنَا ثُمَّ دَنَا يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ بَعِيرٍ فَأَخَذَ وَبَرَةً مِنْ سَنَامِهِ ثُمَّ قَالَ يَا أَيُّهَا النَّاسُ إِنَّهُ لَيْسَ لِي مِنْ هَذَا الْفَيْءِ شَيْءٌ وَلَا هَذَا وَرَفَعَ أُصْبُعَيْهِ إِلَّا الْخُمُسَ وَالْخُمُسُ مَرْدُودٌ عَلَيْكُمْ فَأَدُّوا الْخِيَاطَ وَالْمِخْيَطَ فَقَامَ رَجُلٌ فِي يَدِهِ كُبَّةٌ مِنْ شَعْرٍ فَقَالَ أَخَذْتُ هَذِهِ لِأُصْلِحَ بِهَا بَرْذَعَةً لِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا مَا كَانَ لِي وَلِبَنِي عَبْدِ الْمُطَّلِبِ فَهُوَ لَكَ فَقَالَ أَمَّا إِذْ بَلَغَتْ مَا أَرَى فَلَا أَرَبَ لِي فِيهَا وَنَبَذَهَا",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], ia berkata; telah menceritakan kepada kami [Hammad] dari [Muhammad bin Ishaq], dari ['Amr bin Syu'aib] dari [ayahnya], dari [kakeknya], dalam kisah ini ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kembalikan kepada mereka para wanita dan anak-anak mereka! Barangsiapa yang menahan sebagian dari fai` ini, maka baginya enam unta dari pertama kali Allah memberikan fai` kepada kita.\" Kemudian Nabi shallallahu 'alaihi wasallam mendekat kepada unta dan mengambil sehelai bulu dari punuknya kemudian berkata: \"Wahai manusia, sesungguhnya aku tidak mendapatkan sesuatupun dari fai` ini, tidak pula ini, -beliau mengangkat kedua jarinya- kecuali seperlima, dan seperlima dikembalikan kepada kalian, maka tunaikanlah benang dan jarum!\" kemudian terdapat seorang laki-laki yang berdiri, di tangannya terdapat segulung rambut, ia berkata; aku mengambil ini untuk memperbaiki alas pelanaku. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Adapun bagianku dan bagian Bani Abdul Muththalib adalah untukmu, adapun apabila telah mencapai apa yang aku lihat, maka aku tidak membutuhkannya.\" Dan beliau membuang bulu tersebut. "
            },
            {
                "number": 2255,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ ح و حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا رَوْحٌ قَالَا حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ أَبِي طَلْحَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا غَلَبَ عَلَى قَوْمٍ أَقَامَ بِالْعَرْصَةِ ثَلَاثًا قَالَ ابْنُ المُثَنَّى إِذَا غَلَبَ قَوْمًا أَحَبَّ أَنْ يُقِيمَ بِعَرْصَتِهِمْ ثَلَاثًاقَالَ أَبُو دَاوُد كَانَ يَحْيَى بْنُ سَعِيدٍ يَطْعَنُ فِي هَذَا الْحَدِيثِ لِأَنَّهُ لَيْسَ مِنْ قَدِيمِ حَدِيثِ سَعِيدٍ لِأَنَّهُ تَغَيَّرَ سَنَةَ خَمْسٍ وَأَرْبَعِينَ وَلَمْ يُخْرِجْ هَذَا الْحَدِيثَ إِلَّا بِأَخَرَةٍ قَالَ أَبُو دَاوُد يُقَالُ إِنَّ وَكِيعًا حَمَلَ عَنْهُ فِي تَغَيُّرِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna], ia berkata; telah menceritakan kepada kami [Mu'adz bin Mu'adz], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Harun bin Abdullah], ia berkata; telah menceritakan kepada kami [Rauh], mereka berkata; telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Anas] dari [Abu Thalhah], ia berkata; Rasulullah shallallahu 'alaihi wasallam apabila menundukkan suatu kaum beliau tinggal di sebidang tanah mereka yang luas selama tiga hari. Ibnu Al Mutsanna berkata; apabila beliau menundukkan suatu kaum, maka beliau senang untuk tinggal di sebidang tanah mereka yang luas mereka selama tiga hari. Abu Daud berkata; Yahya bin Sa'id mengkritik hadits ini karena bukan termasuk hadits Sa'id yang terdahulu sebelum mengalami perubahan, karena ia mengalami perubahan pada tahun empat puluh lima, dan ia tidak mengeluarkan hadits ini kecuali pada tahun terakhir. Abu Daud berkata; ada yang mengatakan bahwa Waki' meriwayatkan hadits tersebut darinya di saat ia mengalami perubahan. "
            },
            {
                "number": 2256,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَرْبٍ عَنْ يَزِيدَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ الْحَكَمِ عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ عَنْ عَلِيٍّأَنَّهُ فَرَّقَ بَيْنَ جَارِيَةٍ وَوَلَدِهَا فَنَهَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ وَرَدَّ الْبَيْعَقَالَ أَبُو دَاوُد وَمَيْمُونٌ لَمْ يُدْرِكْ عَلِيًّا قُتِلَ بِالْجَمَاجِمِ وَالْجَمَاجِمُ سَنَةُ ثَلَاثٍ وَثَمَانِينَ قَالَ أَبُو دَاوُد وَالْحَرَّةُ سَنَةُ ثَلَاثٍ وَسِتِّينَ وَقُتِلَ ابْنُ الزُّبَيْرِ سَنَةَ ثَلَاثٍ وَسَبْعِينَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], ia berkata; telah menceritakan kepada kami [Ishaq bin Manshur], telah menceritakan kepada kami [Abdussalam bin Harb] dari [Yazid bin Abdurrahman] dari [Al Hakam] dari [Maimun bin Abu Syabib] dari [Ali] bahwa ia telah memisahkan antara seorang budak wanita dan anaknya. Kemudian Nabi shallallahu 'alaihi wasallam melarangnya dari melakukan hal tersebut, dan beliau mengembalikan jual beli. Abu Daud berkata; dan Maimun tidak mendapati Ali. Ia terbunuh menggunakan jamjamah (kayu yang di ujungnya terdapat besi yang digunakan untuk membajak tanah), dan kejadian jamjamah tersebut pada tahun delapan puluh tiga. Abu Daud berkata; dan kejadian harrah (tempat yang berbatu hitam di Madinah) pada tahun enam puluh tiga. Dan Ibnu Az Zubair terbunuh pada tahun tujuh puluh tiga. "
            },
            {
                "number": 2257,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ قَالَ حَدَّثَنَا عِكْرِمَةُ قَالَ حَدَّثَنِي إِيَاسُ بْنُ سَلَمَةَ قَالَ حَدَّثَنِي أَبِي قَالَخَرَجْنَا مَعَ أَبِي بَكْرٍ وَأَمَّرَهُ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَغَزَوْنَا فَزَارَةَ فَشَنَنَّا الْغَارَةَ ثُمَّ نَظَرْتُ إِلَى عُنُقٍ مِنْ النَّاسِ فِيهِ الذُّرِّيَّةُ وَالنِّسَاءُ فَرَمَيْتُ بِسَهْمٍ فَوَقَعَ بَيْنَهُمْ وَبَيْنَ الْجَبَلِ فَقَامُوا فَجِئْتُ بِهِمْ إِلَى أَبِي بَكْرٍ فِيهِمْ امْرَأَةٌ مِنْ فَزَارَةَ وَعَلَيْهَا قِشْعٌ مَنْ أَدَمٍ مَعَهَا بِنْتٌ لَهَا مِنْ أَحْسَنِ الْعَرَبِ فَنَفَّلَنِي أَبُو بَكْرٍ ابْنَتَهَا فَقَدِمْتُ الْمَدِينَةَ فَلَقِيَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِي يَا سَلَمَةُ هَبْ لِي الْمَرْأَةَ فَقُلْتُ وَاللَّهِ لَقَدْ أَعْجَبَتْنِي وَمَا كَشَفْتُ لَهَا ثَوْبًا فَسَكَتَ حَتَّى إِذَا كَانَ مِنْ الْغَدِ لَقِيَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي السُّوقِ فَقَالَ يَا سَلَمَةُ هَبْ لِي الْمَرْأَةَ لِلَّهِ أَبُوكَ فَقُلْتُ يَا رَسُولَ اللَّهِ وَاللَّهِ مَا كَشَفْتُ لَهَا ثَوْبًا وَهِيَ لَكَ فَبَعَثَ بِهَا إِلَى أَهْلِ مَكَّةَ وَفِي أَيْدِيهِمْ أَسْرَى فَفَادَاهُمْ بِتِلْكَ الْمَرْأَةِ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah], ia berkata; telah menceritakan kepada kami [Hisyam bin Al Qasim], ia berkata; telah menceritakan kepada kami [Ikrimah], ia berkata; telah menceritakan kepadaku [Iyas bin Salamah], ia berkata; telah menceritakan kepadaku [ayahku], ia berkata; kami keluar bersama Abu Bakr dan Rasulullah shallallahu 'alaihi wasallam telah menjadikannya pemimpin atas kami. Kemudian kami memerangi Fazarah dan kami menyerbu dari setiap penjuru. Kemudian aku melihat kepada sekelompok orang padanya terdapat anak-anak dan wanita. Lalu aku memanah dan jatuh diantara mereka dan gunung, kemudian mereka berdiri. Lalu aku datang membawa mereka kepada Abu Bakr, dan diantara mereka terdapat seorang wanita dari Fazarah di atasnya terdapat keranjang dari kulit, dan ia membawa seorang anak wanita yang merupakan diantara wanita Arab yang tercantik. Lalu Abu Bakr memberikan anaknya kepadaku, kemudian aku datang ke Madinah dan bertemu dengan Rasulullah shallallahu 'alaihi wasallam. Beliau berkata: \"Wahai Salamah, berikan wanita tersebut kepadaku!\" Lalu aku katakan; wahai Rasulullah, ia telah membuatku terkagum dan aku belum menggaulinya. Lalu beliau terdiam hingga keesokan harinya Rasulullah shallallahu 'alaihi wasallam bertemu denganku di pasar dan beliau berkata; wahai Salamah, berikan wanita tersebut kepadaku, semoga engkau beruntung. Lalu aku katakan; wahai Rasulullah, demi Allah, aku belum mengaulinya, ia untuk engkau. Kemudian beliau mengirim wanita tersebut kepada penduduk Mekkah yang membawa beberapa orang tawanan, dan beliau menebus mereka dengan wanita tersebut. "
            },
            {
                "number": 2258,
                "arab": "حَدَّثَنَا صَالِحُ بْنُ سُهَيْلٍ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ أَبِي زَائِدَةَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ غُلَامًا لِابْنِ عُمَرَ أَبَقَ إِلَى الْعَدُوِّ فَظَهَرَ عَلَيْهِ الْمُسْلِمُونَ فَرَدَّهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى ابْنِ عُمَرَ وَلَمْ يَقْسِمْقَالَ أَبُو دَاوُد وَقَالَ غَيْرُهُ رَدَّهُ عَلَيْهِ خَالِدُ بْنُ الْوَلِيدِ",
                "id": "Telah menceritakan kepada kami [Shalih bin Suhail], telah menceritakan kepada kami [Yahya bin Abu Zaidah], dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwa budak Ibnu Umar telah melarikan diri, kemudian orang-orang muslim menangkapnya lalu Rasulullah shallallahu 'alaihi wasallam mengembalikannya kepada Ibnu Umar dan tidak membagikannya. Abu Daud berkata; dan yang lainnya berkata; Khalid bin Al Walid mengembalikan budak tersebut kepada Ibnu Umar. "
            },
            {
                "number": 2259,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ وَالْحَسَنُ بْنُ عَلِيٍّ الْمَعْنَى قَالَا حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَذَهَبَ فَرَسٌ لَهُ فَأَخَذَهَا الْعَدُوُّ فَظَهَرَ عَلَيْهِمْ الْمُسْلِمُونَ فَرُدَّ عَلَيْهِ فِي زَمَنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَقَ عَبْدٌ لَهُ فَلَحِقَ بِأَرْضِ الرُّومِ فَظَهَرَ عَلَيْهِمْ الْمُسْلِمُونَ فَرَدَّهُ عَلَيْهِ خَالِدُ بْنُ الْوَلِيدِ بَعْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaim Al Anbari], dan [Al Hasan bin Ali] secara makna, mereka berkata; telah menceritakan kepada kami [Ibnu Umair] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar], ia berkata; kudanya telah lari, kemudian musuh menangkapnya. Lalu orang-orang muslim menaklukkan mereka dan kuda tersebut dikembalikan kepadanya pada zaman Rasulullah shallallahu 'alaihi wasallam. Dan budaknya telah kabur dan masuk ke negeri Romawi, kemudian orang-orang muslim menaklukkan mereka dan Khalid mengembalikan budak tersebut kepadanya setelah Nabi shallallahu 'alaihi wasallam meninggal. "
            },
            {
                "number": 2260,
                "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى الْحَرَّانِيُّ حَدَّثَنِي مُحَمَّدٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ أَبَانَ بْنِ صَالِحٍ عَنْ مَنْصُورِ بْنِ الْمُعْتَمِرِ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَخَرَجَ عِبْدَانٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي يَوْمَ الْحُدَيْبِيَةِ قَبْلَ الصُّلْحِ فَكَتَبَ إِلَيْهِ مَوَالِيهُمْ فَقَالُوا يَا مُحَمَّدُ وَاللَّهِ مَا خَرَجُوا إِلَيْكَ رَغْبَةً فِي دِينِكَ وَإِنَّمَا خَرَجُوا هَرَبًا مِنْ الرِّقِّ فَقَالَ نَاسٌ صَدَقُوا يَا رَسُولَ اللَّهِ رُدَّهُمْ إِلَيْهِمْ فَغَضِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ مَا أُرَاكُمْ تَنْتَهُونَ يَا مَعْشَرَ قُرَيْشٍ حَتَّى يَبْعَثَ اللَّهُ عَلَيْكُمْ مَنْ يَضْرِبُ رِقَابَكُمْ عَلَى هَذَا وَأَبَى أَنْ يَرُدَّهُمْ وَقَالَ هُمْ عُتَقَاءُ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Abdul Aziz bin Yahya Al Harrani], telah menceritakan kepadaku [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Aban bin Shalih], dari [Manshur bin Al Mu'tamir], dari [Rib'I bin Hirasy] dari [Ali bin Abu Thalib], ia berkata; terdapat bebeorang orang budak keluar menemui Rasulullah shallallahu 'alaihi wasallam pada saat terjadinya perjanjian Hudaibiyah sebelum terjadinya perdamaian, kemudian tuan-tuan mereka menulis surat kepada beliau dan berkata; wahai Muhammad! Demi Allah, tidaklah mereka keluar kepadamu karena senang kepada agamu, melainkan mereka keluar karena kabur dari perbudakan. Kemudian orang-orang berkata; mereka benar wahai Rasulullah! Kembalikan budak-budak tersebut kepada mereka! Maka Rasulullah shallallahu 'alaihi wasallam marah dan berkata: \"Aku melihat kalian tidak akan berhenti wahai orang-orang Quraisy hingga Allah mengutus orang yang akan memenggal leher kalian.\" Dan beliau menolak untuk mengembalikan mereka, dan beliau berkata: \"Mereka adalah orang-orang telah Allah 'azza wajalla bebaskan.\""
            },
            {
                "number": 2261,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَمْزَةَ الزُّبَيْرِيُّ قَالَ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ جَيْشًا غَنِمُوا فِي زَمَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامًا وَعَسَلًا فَلَمْ يُؤْخَذْ مِنْهُمْ الْخُمُسُ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Hamzah Az Zubairi], ia berkata; telah menceritakan kepada kami [Anas bin 'Iyadh] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwa sebuah pasukan telah mendapatkan rampasan perang pada zaman Rasulullah shallallahu 'alaihi wasallam berupa makanan, serta madu dan tidak diambil dari mereka zakat seperlima. "
            },
            {
                "number": 2262,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ وَالْقَعْنَبِيُّ قَالَا حَدَّثَنَا سُلَيْمَانُ عَنْ حُمَيْدٍ يَعْنِي ابْنَ هِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَدُلِّيَ جِرَابٌ مِنْ شَحْمٍ يَوْمَ خَيْبَرَ قَالَ فَأَتَيْتُهُ فَالْتَزَمْتُهُ قَالَ ثُمَّ قُلْتُ لَا أُعْطِي مِنْ هَذَا أَحَدًا الْيَوْمَ شَيْئًا قَالَ فَالْتَفَتُّ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَبَسَّمُ إِلَيَّ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] dan [Al Qa'nabi], mereka berkata; telah menceritakan kepada kami [Sulaiman] dari [Humaid bin Hilal] dari [Abdullah bin Mughaffal], ia berkata; telah diambilkan satu kantong lemak pada saat perang Khaibar. Ia berkata; kemudian aku mendatanginya dan menjaganya. Kemudian aku katakan; hari ini aku tidak akan memberikan sedikit pun dari lemak ini kepada seorang pun. "
            },
            {
                "number": 2263,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ عَنْ يَعْلَى بْنِ حَكِيمٍ عَنْ أَبِي لَبِيدٍ قَالَكُنَّا مَعَ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ بِكَابُلَ فَأَصَابَ النَّاسُ غَنِيمَةً فَانْتَهَبُوهَا فَقَامَ خَطِيبًا فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْهَى عَنْ النُّهْبَى فَرَدُّوا مَا أَخَذُوا فَقَسَمَهُ بَيْنَهُمْ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb], ia berkata; telah menceritakan kepada kami [Jarir bin Hazim] dari [Ya'la bin Hakim] dari [Abu Labid], ia berkata; kami pernah bersama [Abdurrahman bin Samurah] di Kabul, kemudian orang-orang mendapatkan rampasan perang, lalu mereka mengambilnya sebelum dibagi. Kemudian ia berkhutbah, ia berkata; saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam melarang dari mengambil rampasan perang sebelum dibagi. Lalu mereka mengembalikan apa yang telah mereka ambil, kemudian ia membaginya diantara mereka. "
            },
            {
                "number": 2264,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا أَبُو إِسْحَقَ الشَّيْبَانِيُّ عَنْ مُحَمَّدِ بْنِ أَبِي مُجَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى قَالَ قُلْتُهَلْ كُنْتُمْ تُخَمِّسُونَ يَعْنِي الطَّعَامَ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَصَبْنَا طَعَامًا يَوْمَ خَيْبَرَ فَكَانَ الرَّجُلُ يَجِيءُ فَيَأْخُذُ مِنْهُ مِقْدَارَ مَا يَكْفِيهِ ثُمَّ يَنْصَرِفُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`], telah menceritakan kepada kami [Abu Mu'awiyah], telah menceritakan kepada kami [Abu Ishaq Asy Syaibani], dari [Muhammad bin Abu Mujalid] dari [Abdullah bin Abu Aufa], ia berkata; aku katakan; apakah kalian membagi makanan menjadi lima pada zaman Rasulullah shallallahu 'alaihi wasallam? Kemudian ia berkata; kami pernah mendapatkan makanan pada saat perang Khaibar, dan terdapat seseorang yang datang dan mengambil sebagian makanan tersebut seukuran yang cukup baginya kemudian ia pergi. "
            },
            {
                "number": 2265,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ عَاصِمٍ يَعْنِي ابْنَ كُلَيْبٍ عَنْ أَبِيهِ عَنْ رَجُلٍ مِنْ الْأَنْصَارِ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَأَصَابَ النَّاسَ حَاجَةٌ شَدِيدَةٌ وَجَهْدٌ وَأَصَابُوا غَنَمًا فَانْتَهَبُوهَا فَإِنَّ قُدُورَنَا لَتَغْلِي إِذْ جَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْشِي عَلَى قَوْسِهِ فَأَكْفَأَ قُدُورَنَا بِقَوْسِهِ ثُمَّ جَعَلَ يُرَمِّلُ اللَّحْمَ بِالتُّرَابِ ثُمَّ قَالَ إِنَّ النُّهْبَةَ لَيْسَتْ بِأَحَلَّ مِنْ الْمَيْتَةِ أَوْ إِنَّ الْمَيْتَةَ لَيْسَتْ بِأَحَلَّ مِنْ النُّهْبَةِ الشَّكُّ مِنْ هَنَّادٍ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sarri], telah menceritakan kepada kami [Abu Al Ahwash] dari ['Ashim bin Kulaib], dari [ayahnya] dari [seorang anshar], ia berkata; kami keluar bersama Rasulullah shallallahu 'alaihi wasallam dalam sebuah perjalanan, kemudian orang-orang memiliki kebutuhan dan kesusahan yang sangat, kemudian mereka memperoleh kambing dan mereka mengambilnya sebelum dibagi. Dan periuk-periuk kami mendidih, tiba-tiba Rasulullah shallallahu 'alaihi wasallam datang, beliau berjalan dengan membawa busurnya, lalu beliau menggulingkan periuk-periuk kami dengan busur beliau dan memasukkan ke dalam daging yang dimasak tersebut dengan tanah seraya bersabda: \"Sesungguhnya mengambil bagian dari rampasan perang sebelum dibagi tidaklah lebih halal daripada bangkai atau tidaklah bangkai lebih halal daripada mengambil rampasan perang sebelum dibagi.\" Terdapat keraguan dari Hannad. "
            },
            {
                "number": 2266,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ أَنَّ ابْنَ حَرْشَفٍ الْأَزْدِيَّ حَدَّثَهُ عَنْ الْقَاسِمِ مَوْلَى عَبْدِ الرَّحْمَنِ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَكُنَّا نَأْكُلُ الْجَزَرَ فِي الْغَزْوِ وَلَا نَقْسِمُهُ حَتَّى إِنْ كُنَّا لَنَرْجِعُ إِلَى رِحَالِنَا وَأَخْرِجَتُنَا مِنْهُ مُمْلَأَةٌ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur], ia berkata; telah menceritakan kepada kami [Abdullah bin Wahb], ia berkata; telah mengabarkan kepadaku ['Amr bin Al Harits] bahwa [Ibnu Harsyaf Al Azdi] telah menceritakan kepadanya dari [Al Qasim] mantan budak Abdurrahman dari [sebagian sahabat Nabi shallallahu 'alaihi wasallam], beliau bersabda: \"Kami pernah makan unta dan kami tidak membaginya hingga kami kembali ke tempat-tempat tinggal kami, sementara bejana kami penuh dengan daging unta.\""
            },
            {
                "number": 2267,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى حَدَّثَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ عَنْ يَحْيَى بْنِ حَمْزَةَ قَالَ حَدَّثَنَا أَبُو عَبْدِ الْعَزِيزِ شَيْخٌ مِنْ أَهْلِ الْأُرْدُنِّ عَنْ عُبَادَةَ بْنِ نُسَيٍّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ قَالَرَابَطْنَا مَدِينَةَ قِنَّسْرِينَ مَعَ شُرَحْبِيلَ بْنِ السِّمْطِ فَلَمَّا فَتَحَهَا أَصَابَ فِيهَا غَنَمًا وَبَقَرًا فَقَسَمَ فِينَا طَائِفَةً مِنْهَا وَجَعَلَ بَقِيَّتَهَا فِي الْمَغْنَمِ فَلَقِيتُ مُعَاذَ بْنَ جَبَلٍ فَحَدَّثْتُهُ فَقَالَ مُعَاذٌ غَزَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْبَرَ فَأَصَبْنَا فِيهَا غَنَمًا فَقَسَمَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَائِفَةً وَجَعَلَ بَقِيَّتَهَا فِي الْمَغْنَمِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mushaffa], telah menceritakan kepada kami [Muhammad bin Al Mubarak] dari [Yahya bin Hamzah], ia berkata; telah menceritakan kepada kami [Abu Abdul Aziz] syekh dari penduduk Yordania dari ['Ubadah bin Nusai] dari [Abdurrahman bin Ghanm], ia berkata; kami memerangi Kota Qannasrin bersama Syarahbil bin As Simth, kemudian tatkala ia telah menaklukkannya ia memperoleh kambing dan sapi, kemudian ia membagikan sebagian darinya, dan menjadikan sisanya bagian dari harta rampasan perang. Kemudian aku bertemu dengan [Mu'adz bin Jabal], lalu aku ceritakan hal tersebut kepadanya. Lalu Mu'adz berkata; kami pernah memerangi khaibar bersama Rasulullah shallallahu 'alaihi wasallam, lalu kami memperoleh kambing, lalu Rasulullah shallallahu 'alaihi wasallam membagi sebagiannya diantara kami dan menjadikan sisanya bagian dari rampasan perang. "
            },
            {
                "number": 2268,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ الْمَعْنَى قَالَ أَبُو دَاوُد وَأَنَا لِحَدِيثِهِ أَتْقَنُ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي مَرْزُوقٍ مَوْلَى تُجِيبَ عَنْ حَنَشٍ الصَّنْعَانِيِّ عَنْ رُوَيْفِعِ بْنِ ثَابِتٍ الْأَنْصَارِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَبِالْيَوْمِ الْآخِرِ فَلَا يَرْكَبْ دَابَّةً مِنْ فَيْءِ الْمُسْلِمِينَ حَتَّى إِذَا أَعْجَفَهَا رَدَّهَا فِيهِ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَبِالْيَوْمِ الْآخِرِ فَلَا يَلْبَسْ ثَوْبًا مِنْ فَيْءِ الْمُسْلِمِينَ حَتَّى إِذَا أَخْلَقَهُ رَدَّهُ فِيهِ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur], dan [Utsman bin Abu Syaibah] secara makna, Abu Daud berkata; dan aku lebih yakin kepada haditsnya. Ia berkata; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Muhammad bin Ishaq] dari [Yazid? bin Abu Habib] dari [Abu Marzuq] mantan budak Tujib, dari [Hanasy Ash Shan'ani], dari [Ruwaifi' bin Tsabit Al Anshari] bahwa Nabi shallallahu 'alaihi wasallam berkata: \"Barangsiapa yang beriman kepada Allah dan Hari Akhir, maka janganlah ia menaiki unta yang berasal dari fai` orang-orang muslim hingga apabila ia telah menjadikannya kurus maka ia mengembalikannya. Dan barangsiapa yang beriman kepada Allah dan Hari Akhir, maka janganlah ia memakai pakaian yang berasal dari fai` orang-orang muslim hingga apabila ia telah menjadikannya usang, maka ia mengembalikannya.\""
            },
            {
                "number": 2269,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ أَخْبَرَنَا إِبْرَاهِيمُ يَعْنِي ابْنَ يُوسُفَ قَالَ قَالَ أَبُو دَاوُد هُوَ إِبْرَاهِيمُ بْنُ يُوسُفَ بْنِ إِسْحَقَ بْنِ أَبِي إِسْحَقَ السُّبَيْعِيُّ عَنْ أَبِيهِ عَنْ أَبِي إِسْحَقَ السُّبَيْعِيِّ قَالَ حَدَّثَنِي أَبُو عُبَيْدَةَ عَنْ أَبِيهِ قَالَمَرَرْتُ فَإِذَا أَبُو جَهْلٍ صَرِيعٌ قَدْ ضُرِبَتْ رِجْلُهُ فَقُلْتُ يَا عَدُوَّ اللَّهِ يَا أَبَا جَهْلٍ قَدْ أَخْزَى اللَّهُ الْأَخِرَ قَالَ وَلَا أَهَابُهُ عِنْدَ ذَلِكَ فَقَالَ أَبْعَدُ مِنْ رَجُلٍ قَتَلَهُ قَوْمُهُ فَضَرَبْتُهُ بِسَيْفٍ غَيْرِ طَائِلٍ فَلَمْ يُغْنِ شَيْئًا حَتَّى سَقَطَ سَيْفُهُ مِنْ يَدِهِ فَضَرَبْتُهُ بِهِ حَتَّى بَرَدَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`], ia berkata; telah mengabarkan kepada kami [Ibrahim bin Yusuf], ia berkata; Abu Daud berkata; ia adalah Ibrahim bin Yusuf bin Ishaq bin Abu Ishaq As Subai'i, dari [ayahnya], dari [Abu Ishaq As Subai'i], ia berkata; telah menceritakan kepadaku [Abu 'Ubaidah] dari [ayahnya], ia berkata; aku lewat, ternyata Abu Jahl telah terkapar dengan kaki yang telah terkena sabetan pedang, kemudian aku katakan; wahai musuh Allah, wahai Abu Jahl, akhirnya Allah telah membalasmu. Ia berkata; pada saat itu aku tidak takut kepadanya. Kemudian ia berkata; hal itu sangat jauh dari seseorang yang dibunuh oleh kaumnya. Lalu aku menebasnya dengan pedang dan tidak memutuskan, maka hal tersebut tidaklah berarti sedikitpun kecuali pedangnya yang terjatuh dari tangannya. Kemudian aku menebasnya menggunakan pedang tersebut hingga ia mati. "
            },
            {
                "number": 2270,
                "arab": "حَدَّثَنَا مُسَدَّدٌ أَنَّ يَحْيَى بْنَ سَعِيدٍ وَبِشْرَ بْنَ الْمُفَضَّلِ حَدَّثَاهُمْ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ أَبِي عَمْرَةَ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّأَنَّ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُوُفِّيَ يَوْمَ خَيْبَرَ فَذَكَرُوا ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ صَلُّوا عَلَى صَاحِبِكُمْ فَتَغَيَّرَتْ وُجُوهُ النَّاسِ لِذَلِكَ فَقَالَ إِنَّ صَاحِبَكُمْ غَلَّ فِي سَبِيلِ اللَّهِ فَفَتَّشْنَا مَتَاعَهُ فَوَجَدْنَا خَرَزًا مِنْ خَرَزِ يَهُودَ لَا يُسَاوِي دِرْهَمَيْنِ",
                "id": "Telah menceritakan kepada kami [Musaddad] bahwa [Yahya bin Sa'id], dan [Bisyr bin Al Mufadhdhal] telah menceritakan kepada mereka dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Hibban] dari [Abu Amrah] dari [Zaid bin Khalid Al Juhani] bahwa seorang sahabat Nabi shallallahu 'alaihi wasallam meninggal pada saat perang Khaibar. Kemudian para sahabat menceritakan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam. Lalu beliau berkata: \"sholatkan sahabat kalian!\" kemudian roman wajah orang-orang berubah karena hal tersebut. Lalu beliau berkata: \"Sesungguhnya sahabat kalian telah berbuat berkhianat di jalan Allah.\" Kemudian kami memeriksa barangnya, dan kami dapati butiran mutiara Yahudi yang tidak sampai senilai dua dirham. "
            },
            {
                "number": 2271,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ثَوْرِ بْنِ زَيْدٍ الدَّيْلِيِّ عَنْ أَبِي الْغَيْثِ مَوْلَى ابْنِ مُطِيعٍ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ خَيْبَرَ فَلَمْ نَغْنَمْ ذَهَبًا وَلَا وَرِقًا إِلَّا الثِّيَابَ وَالْمَتَاعَ وَالْأَمْوَالَ قَالَ فَوَجَّهَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ وَادِي الْقُرَى وَقَدْ أُهْدِيَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدٌ أَسْوَدُ يُقَالُ لَهُ مِدْعَمٌ حَتَّى إِذَا كَانُوا بِوَادِي الْقُرَى فَبَيْنَا مِدْعَمٌ يَحُطُّ رَحْلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَهُ سَهْمٌ فَقَتَلَهُ فَقَالَ النَّاسُ هَنِيئًا لَهُ الْجَنَّةُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَلَّا وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ الشَّمْلَةَ الَّتِي أَخَذَهَا يَوْمَ خَيْبَرَ مِنْ الْمَغَانِمِ لَمْ تُصِبْهَا الْمَقَاسِمُ لَتَشْتَعِلُ عَلَيْهِ نَارًا فَلَمَّا سَمِعُوا ذَلِكَ جَاءَ رَجُلٌ بِشِرَاكٍ أَوْ شِرَاكَيْنِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شِرَاكٌ مِنْ نَارٍ أَوْ قَالَ شِرَاكَانِ مِنْ نَارٍ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Tsaur bin Zaid Ad Dili] dari [Abu Al Ghaits] mantan budak Ibnu Muthi', dari [Abu Hurairah] bahwa ia berkata; kami pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam pada tahun terjadinya perang Khaibar. Kami tidak memperoleh rampasan emas dan perak, kecuali pakaian dan barang, serta harta. Abu Hurairah berkata; kemudian Rasulullah shallallahu 'alaihi wasallam mengarahkan ke arah bukit Qura. Sungguh Rasulullah shallallahu 'alaihi wasallam telah diberi hadiah seorang budak hitam yang bernama Mid'am, hingga ketika mereka berada Bukit Qura. Kemudian tatkala Mid'am menurunkan pelana Rasulullah shallallahu 'alaihi wasallam tiba-tiba ia terkena anak panah dan membunuhnya. Kemudian orang-orang berkata; betapa enaknya dia mendapatkan surga. Kemudian Nabi shallallahu 'alaihi wasallam berkata: \"Tidak, demi Dzat yang jiwaku ada di tanganNya, sesungguhnya pakaian yang telah ia ambil pada saat perang Khaibar dari rampasan perang yang belum dibagi telah membakarnya.\" Kemudian tatkala mereka mendengar hal tersebut, terdapat seorang laki-laki yang datang dengan membawa satu atau dua tali sandal kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Ini adalah tali sandal dari neraka\" -atau beliau mengatakan: \"Dua tali sandal dari neraka.\""
            },
            {
                "number": 2272,
                "arab": "حَدَّثَنَا أَبُو صَالِحٍ مَحْبُوبُ بْنُ مُوسَى قَالَ أَخْبَرَنَا أَبُو إِسْحَقَ الْفَزَارِيُّ عَنْ عَبْدِ اللَّهِ بْنِ شَوْذَبٍ قَالَ حَدَّثَنِي عَامِرٌ يَعْنِي ابْنَ عَبْدِ الْوَاحِدِ عَنْ ابْنِ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَصَابَ غَنِيمَةً أَمَرَ بِلَالًا فَنَادَى فِي النَّاسِ فَيَجِيئُونَ بِغَنَائِمِهِمْ فَيَخْمُسُهُ وَيُقَسِّمُهُ فَجَاءَ رَجُلٌ بَعْدَ ذَلِكَ بِزِمَامٍ مِنْ شَعَرٍ فَقَالَ يَا رَسُولَ اللَّهِ هَذَا فِيمَا كُنَّا أَصَبْنَاهُ مِنْ الْغَنِيمَةِ فَقَالَ أَسَمِعْتَ بِلَالًا يُنَادِي ثَلَاثًا قَالَ نَعَمْ قَالَ فَمَا مَنَعَكَ أَنْ تَجِيءَ بِهِ فَاعْتَذَرَ إِلَيْهِ فَقَالَ كُنْ أَنْتَ تَجِيءُ بِهِ يَوْمَ الْقِيَامَةِ فَلَنْ أَقْبَلَهُ عَنْكَ",
                "id": "Telah menceritakan kepada kami [Abu Shalih Mahbub bin Musa], ia berkata; telah mengabarkan kepada kami [Abu Ishaq Al Fazari], dari [Abdullah bin Syaudzab], ia berkata; telah menceritakan kepadaku ['Amir bin Abdul Wahid] dari [Ibnu Buraidah], dari [Abdullah bin 'Amr], ia berkata; Rasulullah shallallahu 'alaihi wasallam apabila mendapatkan rampasan perang beliau memerintahkan Bilal agar menyeru diantara orang-orang, kemudian mereka datang membawa rampasan perang mereka. Lalu beliau membagi lima dan membagikannya. Lalu terdapat seorang laki-laki yang datang setelah itu dengan membawa tali kekang yang terbuat dari rambut dan berkata; wahai Rasulullah, inilah yang rampasan perang yang telah kami peroleh. Kemudian beliau berkata: \"Apakah engkau telah mendengar Bilal menyeru tiga kali?\" ia berkata; ya. Beliau berkata: \"Apa yang menghalangimu untuk datang membawanya?\" kemudian ia menyampaikan alasan kepada beliau. Lalu beliau berkata: \"Datanglah dengan membawanya pada Hari Kiamat, aku tidak menerimanya darimu.\""
            },
            {
                "number": 2273,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ وَسَعِيدُ بْنُ مَنْصُورٍ قَالَا حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ قَالَ النُّفَيْلِيُّ الْأَنْدَرَاوَرْدِيُّ عَنْ صَالِحِ بْنِ مُحَمَّدِ بْنِ زَائِدَةَ قَالَ أَبُو دَاوُد وَصَالِحٌ هَذَا أَبُو وَاقِدٍقَالَ دَخَلْتُ مَعَ مَسْلَمَةَ أَرْضَ الرُّومِ فَأُتِيَ بِرَجُلٍ قَدْ غَلَّ فَسَأَلَ سَالِمًا عَنْهُ فَقَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ عُمَرَ بْنِ الْخَطَّابِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا وَجَدْتُمْ الرَّجُلَ قَدْ غَلَّ فَأَحْرِقُوا مَتَاعَهُ وَاضْرِبُوهُقَالَ فَوَجَدْنَا فِي مَتَاعِهِ مُصْحَفًا فَسَأَلَ سَالِمًا عَنْهُ فَقَالَ بِعْهُ وَتَصَدَّقْ بِثَمَنِهِ",
                "id": "Telah menceritakan kepada kami [An Nufaili] dan [Sa'id bin Manshur], mereka berkata; telah menceritakan kepada kami [Abdul Aziz bin Muhammad], telah berkata An Nufaili Al Andarawardi, dari [Shalih bin Muhammad bin Zaidah], Abu Daud berkata; Shalih ini adalah Abu Waqid. Ia berkata; aku masuk bersama Maslamah ke negeri Romawi, kemudian terdapat seorang laki-laki yang dihadapkan, ia telah berbuat khianat, kemudian ia bertanya kepada Salim mengenai orang tersebut, lalu [Salim] berkata; saya pernah mendengar [ayahku] menceritakan dari [Umar bin Al Khathab] dari Nabi shallallahu 'alaihi wasallam, beliau berkata: \"Apabila kalian mendapatkan seorang laki-laki yang telah berkhianat, maka bakarlah barangnya dan cambuklah dia!\" Abu Waqid berkata; kemudian kami mendapati sebuah Mushhaf pada barangnya. Kemudian Maslamah bertanya kepada Salim mengenai hal tersebut, kemudian ia berkata; juallah mushaf tersebut dan sedekahkan uang hasil penjualannya. "
            },
            {
                "number": 2274,
                "arab": "حَدَّثَنَا أَبُو صَالِحٍ مَحْبُوبُ بْنُ مُوسَى الْأَنْطَاكِيُّ قَالَ أَخْبَرَنَا أَبُو إِسْحَقَ عَنْ صَالِحِ بْنِ مُحَمَّدٍ قَالَغَزَوْنَا مَعَ الْوَلِيدِ بْنِ هِشَامٍ وَمَعَنَا سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ وَعُمَرُ بْنُ عَبْدِ الْعَزِيزِ فَغَلَّ رَجُلٌ مَتَاعًا فَأَمَرَ الْوَلِيدُ بِمَتَاعِهِ فَأُحْرِقَ وَطِيفَ بِهِ وَلَمْ يُعْطِهِ سَهْمَهُقَالَ أَبُو دَاوُد وَهَذَا أَصَحُّ الْحَدِيثَيْنِ رَوَاهُ غَيْرُ وَاحِدٍ أَنَّ الْوَلِيدَ بْنَ هِشَامٍ أَحْرَقَ رَحْلَ زِيَادِ بْنِ سَعْدٍ وَكَانَ قَدْ غَلَّ وَضَرَبَهُ",
                "id": "Telah menceritakan kepada kami [Abu Shalih Mahbub bin Musa Al Anthaki], ia berkata; telah mengabarkan kepada kami [Abu Ishaq] dari [Shalih bin Muhammad], ia berkata; kami pernah berperang bersama Al Walid bin Hisyam, dan bersama kami terdapat Salim bin Abdullah bin Umar, serta Umar bin Abdul Aziz. Kemudian terdapat seorang laki-laki yang berkhianat mengambil sebuah barang. Kemudian Al Walid memerintahkan agar barangnya dibakar dan orang tersebut dibawa berkeliling dan ia tidak memberikan sahamnya kepadanya. Abu Daud berkata; hadits ini adalah hadits paling shahih diantara dua hadits tersebut. Hadits tersebut telah diriwayatkan tidak hanya satu orang bahwa Al Walid bin Hisyam membakar pelana Ziyad bin Sa'd, dan ia telah berkhianat dan Al Walid mencambuknya. "
            },
            {
                "number": 2275,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ قَالَ حَدَّثَنَا مُوسَى بْنُ أَيُّوبَ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبَا بَكْرٍ وَعُمَرَ حَرَّقُوا مَتَاعَ الْغَالِّ وَضَرَبُوهُقَالَ أَبُو دَاوُد وَزَادَ فِيهِ عَلِيُّ بْنُ بَحْرٍ عَنْ الْوَلِيدِ وَلَمْ أَسْمَعْهُ مِنْهُ وَمَنَعُوهُ سَهْمَهُ قَالَ أَبُو دَاوُد و حَدَّثَنَا بِهِ الْوَلِيدُ بْنُ عُتْبَةَ وَعَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ قَالَا حَدَّثَنَا الْوَلِيدُ عَنْ زُهَيْرِ بْنِ مُحَمَّدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ قَوْلَهُ وَلَمْ يَذْكُرْ عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ الْحَوْطِيُّ مَنْعَ سَهْمِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Auf], ia berkata; telah menceritakan kepada kami [Musa bin Ayyub], ia berkata; telah menceritakan kepada kami [Al Walid bin Muslim], ia berkata; telah menceritakan kepada kami [Zuhair bin Muhammad] dari ['Amr bin Syu'aib] dari [ayahnya], dari [kakeknya], bahwa Rasulullah shallallahu 'alaihi wasallam, Abu Bakr dan Umar telah membakar harta orang yang berkhianat dan mencambuknya. Abu Daud berkata dan menambahkan didalamnya [Ali bin Bahr] dari [Al Walid] namun saya tidak mendengar darinya kata; dan mereka melarang untuk menyerahkan bagiannya. Abu Daud berkata; dan telah menceritakan kepada kami, [Al Walid bin 'Utbah], dan [Abdul Wahhab bin Najdah], mereka berkata; telah menceritakan kepada kami [Al Walid] dari [Zuhair bin Muhammad], dari ['Amr bin Syu'aib] perkataannya; dan Abdul Wahhab bin Najdah Al Hauthi tidak menyebutkan pelarangan untuk mengambil sahamnya."
            },
            {
                "number": 2276,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ بْنِ سُفْيَانَ قَالَ حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ مُوسَى أَبُو دَاوُدَ قَالَ حَدَّثَنَا جَعْفَرُ بْنُ سَعْدِ بْنِ سَمُرَةَ بْنِ جُنْدُبٍ حَدَّثَنِي خُبَيْبُ بْنُ سُلَيْمَانَ عَنْ أَبِيهِ سُلَيْمَانَ بْنِ سَمُرَةَ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ قَالَأَمَّا بَعْدُ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ كَتَمَ غَالًّا فَإِنَّهُ مِثْلُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Daud bin Sufyan], ia berkata; telah menceritakan kepada kami [Yahya bin Hassan], ia berkata; telah menceritakan kepada kami [Sulaiman bin Musa], Abu Daud berkata; telah menceritakan kepada kami [Ja'far bin Sa'd bin Samurah bin Jundub], telah menceritakan kepadaku [Khubaib bin Sulaiman] dari [ayahnya yaitu Sulaiman bin Samurah] dari [Samurah bin Jundub], ia berkata; adapun selanjutnya, dan Rasulullah shallallahu 'alaihi wasallam pernah berkata: \"Barangsiapa yang menyembunyikan orang yang berkhianat maka ia seperti itu.\""
            },
            {
                "number": 2277,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عُمَرَ بْنِ كَثِيرِ بْنِ أَفْلَحَ عَنْ أَبِي مُحَمَّدٍ مَوْلَى أَبِي قَتَادَةَ عَنْ أَبِي قَتَادَةَ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي عَامِ حُنَيْنٍ فَلَمَّا الْتَقَيْنَا كَانَتْ لِلْمُسْلِمِينَ جَوْلَةٌ قَالَ فَرَأَيْتُ رَجُلًا مِنْ الْمُشْرِكِينَ قَدْ عَلَا رَجُلًا مِنْ الْمُسْلِمِينَ قَالَ فَاسْتَدَرْتُ لَهُ حَتَّى أَتَيْتُهُ مِنْ وَرَائِهِ فَضَرَبْتُهُ بِالسَّيْفِ عَلَى حَبْلِ عَاتِقِهِ فَأَقْبَلَ عَلَيَّ فَضَمَّنِي ضَمَّةً وَجَدْتُ مِنْهَا رِيحَ الْمَوْتِ ثُمَّ أَدْرَكَهُ الْمَوْتُ فَأَرْسَلَنِي فَلَحِقْتُ عُمَرَ بْنَ الْخَطَّابِ فَقُلْتُ لَهُ مَا بَالُ النَّاسِ قَالَ أَمْرُ اللَّهِ ثُمَّ إِنَّ النَّاسَ رَجَعُوا وَجَلَسَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ مَنْ قَتَلَ قَتِيلًا لَهُ عَلَيْهِ بَيِّنَةٌ فَلَهُ سَلَبُهُ قَالَ فَقُمْتُ ثُمَّ قُلْتُ مَنْ يَشْهَدُ لِي ثُمَّ جَلَسْتُ ثُمَّ قَالَ ذَلِكَ الثَّانِيَةَ مَنْ قَتَلَ قَتِيلًا لَهُ عَلَيْهِ بَيِّنَةٌ فَلَهُ سَلَبُهُ قَالَ فَقُمْتُ ثُمَّ قُلْتُ مَنْ يَشْهَدُ لِي ثُمَّ جَلَسْتُ ثُمَّ قَالَ ذَلِكَ الثَّالِثَةَ فَقُمْتُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لَكَ يَا أَبَا قَتَادَةَ قَالَ فَاقْتَصَصْتُ عَلَيْهِ الْقِصَّةَ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ صَدَقَ يَا رَسُولَ اللَّهِ وَسَلَبُ ذَلِكَ الْقَتِيلِ عِنْدِي فَأَرْضِهِ مِنْهُ فَقَالَ أَبُو بَكْرٍ الصِّدِّيقُ لَاهَا اللَّهِ إِذًا يَعْمِدُ إِلَى أَسَدٍ مِنْ أُسْدِ اللَّهِ يُقَاتِلُ عَنْ اللَّهِ وَعَنْ رَسُولِهِ فَيُعْطِيكَ سَلَبَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَدَقَ فَأَعْطِهِ إِيَّاهُ فَقَالَ أَبُو قَتَادَةَ فَأَعْطَانِيهِ فَبِعْتُ الدِّرْعَ فَابْتَعْتُ بِهِ مَخْرَفًا فِي بَنِي سَلَمَةَ فَإِنَّهُ لَأَوَّلُ مَالٍ تَأَثَّلْتُهُ فِي الْإِسْلَامِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi], dari [Malik] dari [Yahya bin Sa'id] dari [Umar bin Katsir bin Aflah], dari [Abu Muhammad], mantan budak Abu Qatadah, dari [Abu Qatadah], ia berkata; kami keluar bersama Rasulullah shallallahu 'alaihi wasallam pada tahun terjadinya perang Hunain. Kemudian tatkala kami bertemu, orang-orang muslim datang pergi. Ia berkata; kemudian saya melihat seorang laki-laki dari kalangan musyrikin telah mengalahkan seorang muslim. Ia berkata; kemudian aku mengitarinya hingga aku mendatanginya dari belakang. Kemudian aku menebasnya dengan pedang pada urat pundaknya. Kemudian ia menghadap kepadaku dan ia memelukku dan aku dapatkan darinya bau kematian. Kemudian ia mati dan melepaskanku. Lalu aku menyusul kepada Umar dan aku katakan kepadanya; bagaimana pendapat orang-orang? Ia berkata; terdapat perintah Allah. Kemudian orang-orang kembali dan Rasulullah shallallahu 'alaihi wasallam duduk. Beliau mengatakan: \"Barangsiapa yang membunuh seseorang dengan memiliki bukti maka baginya salabnya (segala yang melekat pada tubuhnya).\" Abu Qatadah berkata; lalu aku berdiri kemudian aku katakan; siapakah yang memberikan persaksian untukku? Kemudian aku duduk, lalu beliau mengatakan hal tersebut yang kedua kalinya: \"Barangsiapa yang membunuh seseorang dengan memiliki bukti, maka baginya salabnya (segala yang melekat pada tubuhnya).\" Abu Qatadah berkata; lalu aku berdiri kemudian aku katakan; siapakah yang memberikan persaksian untukku? Kemudian aku duduk, lalu beliau mengatakan hal tersebut yang ketiga kalinya. Lalu aku berdiri dan Rasulullah shallallahu 'alaihi wasallam berkata: \"Ada apa denganmu wahai Abu Qatadah?\" Abu Qatadah berkata; lalu aku ceritakan kisah tersebut kepada beliau. Lalu terdapat seseorang yang berkata; ia benar wahai Rasulullah, dan salab orang yang terbunuh tersebut ada padaku maka relakan kepadanya! Lalu Abu Bakr Ash Shiddiq berkata; tidak, demi Allah, hal tersebut tidak terjadi, jika demikian ia menjatuhkan gelar singa diantara singa Allah yang bertempur membela Allah dan RasulNya, kemudian memberimu salabnya? Maka Rasulullah shallallahu 'alaihi wasallam berkata: \"Ia benar, berikan kepadanya salab tersebut.\" Abu Qatadah berkata; kemudian beliau memberiku salab tersebut, lalu aku menjual baju zirah dan aku belikan kebun di antara Bani Salamah. Sesungguhnya hal tersebut merupakan harta pertama yang aku kumpulkan di masa Islam."
            },
            {
                "number": 2278,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ قَالَ حَدَّثَنَا حَمَّادٌ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ يَعْنِي يَوْمَ حُنَيْنٍ مَنْ قَتَلَ كَافِرًا فَلَهُ سَلَبُهُ فَقَتَلَ أَبُو طَلْحَةَ يَوْمَئِذٍ عِشْرِينَ رَجُلًا وَأَخَذَ أَسْلَابَهُمْ وَلَقِيَ أَبُو طَلْحَةَ أُمَّ سُلَيْمٍ وَمَعَهَا خِنْجَرٌ فَقَالَ يَا أُمَّ سُلَيْمٍ مَا هَذَا مَعَكِ قَالَتْ أَرَدْتُ وَاللَّهِ إِنْ دَنَا مِنِّي بَعْضُهُمْ أَبْعَجُ بِهِ بَطْنَهُ فَأَخْبَرَ بِذَلِكَ أَبُو طَلْحَةَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ أَبُو دَاوُد هَذَا حَدِيثٌ حَسَنٌ قَالَ أَبُو دَاوُد أَرَدْنَا بِهَذَا الْخِنْجَرَ وَكَانَ سِلَاحَ الْعَجَمِ يَوْمَئِذٍ الْخِنْجَرُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], ia berkata; telah menceritakan kepada kami [Hammad] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik], ia berkata; Rasulullah shallallahu 'alaihi wasallam berkata pada saat perang Hunain: \"Barangsiapa yang membunuh seorang kafir maka baginya salabnya (segala apa yang dikenakan oleh orang yang dibunuh).\" Kemudian Abu Thalhah pada saat itu telah membunuh dua puluh orang dan ia mengambil salab mereka. Dan Abu Thalhah menemui Ummu Sulaim dan bersama Ummu Sulaim terdapat sebuah khanjar (pisau besar yang memiliki dua sisi yang tajam). Lalu Abu Thalhah berkata; wahai Ummu Sulaim, apa yang engkau bawa ini? Ia berkata; demi Allah apabila salah sebagian diantara mereka mendekatiku maka aku sobek perutnya. Kemudian Abu Thalhah mengabarkan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam. Abu Daud berkata; hadits ini adalah hadits hasan. Abu Daud berkata; aku ingin dengan pisau ini… dan dahulu senjata orang-orang selain Arab adalah khanjar."
            },
            {
                "number": 2279,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ حَدَّثَنِي صَفْوَانُ بْنُ عَمْرٍو عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ قَالَخَرَجْتُ مَعَ زَيْدِ بْنِ حَارِثَةَ فِي غَزْوَةِ مُؤْتَةَ فَرَافَقَنِي مَدَدٌ مِنْ أَهْلِ الْيَمَنِ لَيْسَ مَعَهُ غَيْرُ سَيْفِهِ فَنَحَرَ رَجُلٌ مِنْ الْمُسْلِمِينَ جَزُورًا فَسَأَلَهُ الْمَدَدِيُّ طَائِفَةً مِنْ جِلْدِهِ فَأَعْطَاهُ إِيَّاهُ فَاتَّخَذَهُ كَهَيْئَةِ الدَّرْقِ وَمَضَيْنَا فَلَقِينَا جُمُوعَ الرُّومِ وَفِيهِمْ رَجُلٌ عَلَى فَرَسٍ لَهُ أَشْقَرَ عَلَيْهِ سَرْجٌ مُذْهَبٌ وَسِلَاحٌ مُذْهَبٌ فَجَعَلَ الرُّومِيُّ يُغْرِي بِالْمُسْلِمِينَ فَقَعَدَ لَهُ الْمَدَدِيُّ خَلْفَ صَخْرَةٍ فَمَرَّ بِهِ الرُّومِيُّ فَعَرْقَبَ فَرَسَهُ فَخَرَّ وَعَلَاهُ فَقَتَلَهُ وَحَازَ فَرَسَهُ وَسِلَاحَهُ فَلَمَّا فَتَحَ اللَّهُ عَزَّ وَجَلَّ لِلْمُسْلِمِينَ بَعَثَ إِلَيْهِ خَالِدُ بْنُ الْوَلِيدِ فَأَخَذَ مِنْ السَّلَبِ قَالَ عَوْفٌ فَأَتَيْتُهُ فَقُلْتُ يَا خَالِدُ أَمَا عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالسَّلَبِ لِلْقَاتِلِ قَالَ بَلَى وَلَكِنِّي اسْتَكْثَرْتُهُ قُلْتُ لَتَرُدَّنَّهُ عَلَيْهِ أَوْ لَأُعَرِّفَنَّكَهَا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَبَى أَنْ يَرُدَّ عَلَيْهِ قَالَ عَوْفٌ فَاجْتَمَعْنَا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَصَصْتُ عَلَيْهِ قِصَّةَ الْمَدَدِيِّ وَمَا فَعَلَ خَالِدٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا خَالِدُ مَا حَمَلَكَ عَلَى مَا صَنَعْتَ قَالَ يَا رَسُولَ اللَّهِ لَقَدْ اسْتَكْثَرْتُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا خَالِدُ رُدَّ عَلَيْهِ مَا أَخَذْتَ مِنْهُ قَالَ عَوْفٌ فَقُلْتُ لَهُ دُونَكَ يَا خَالِدُ أَلَمْ أَفِ لَكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا ذَلِكَ فَأَخْبَرْتُهُ قَالَ فَغَضِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا خَالِدُ لَا تَرُدَّ عَلَيْهِ هَلْ أَنْتُمْ تَارِكُونَ لِي أُمَرَائِي لَكُمْ صَفْوَةُ أَمْرِهِمْ وَعَلَيْهِمْ كَدَرُهُحَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ قَالَ حَدَّثَنَا الْوَلِيدُ قَالَ سَأَلْتُ ثَوْرًا عَنْ هَذَا الْحَدِيثِ فَحَدَّثَنِي عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Hanbal], ia berkata; telah menceritakan kepada kami [Al Walid bin Muslim], ia berkata; telah menceritakan kepadaku [Shafwan bin 'Amr] dari [Abdurrahman bin Jubair bin Nufair], dari [ayahnya] dari ['Auf bin Malik Al Asyja'i], ia berkata; aku keluar bersama Zaid bin Haritsah pada perang Muktah. Kemudian aku disertai bala bantuan dari penduduk Yaman dengan hanya membawa pedangnya. Kemudian salah seorang muslim menyembelih unta dan seorang bala bantuan meminta kulit unta tersebut, kemudian ia memberikan kepadanya. Lalu orang-orang tersebut menjadikannya seperti tameng. Dan kami berjalan dan bertemu dengan orang-orang Romawi, dan diantara mereka terdapat seorang laki-laki yang menunggang kuda berwarna blonde padanya terdapat pelana emas serta senjata yang dilapisi emas. Kemudian orang Romawi tersebut menyerang muslimin dengan tiba-tiba. Kemudian seorang bala bantuan tersebut menunggunya di balik batu besar, kemudian orang Romawi tersebut lewat, lalu orang bala bantuan tersebut memotong kaki kudanya, maka orang Romawi tersebut terjatuh dan salah seorang bala bantuan tersebut membunuhnya dan mengumpulkan kuda serta senjatanya. Kemudian tatkala Allah 'azza wajalla memenangkan untuk orang-orang muslim, khalid bin Al Walid mengirim utusan kepadanya dan mengambil sebagian dari salab tersebut. 'Auf berkata; kemudian aku mendatangi Khalid dan berkata; wahai Khalid, bukanlah engkau telah mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam memutuskan bahwa salab adalah untuk orang yang yang membunuh? Ia berkata; benar. Akan tetapi aku menganggapnya terlalu banyak. Maka aku katakan; sungguh engkau kembalikan kepadanya aku akan memberitahukanmu di hadapan Rasulullah shallallahu 'alaihi wasallam. Kemudian ia enggan untuk mengembalikannya. 'Auf berkata; kemudian kami berkumpul di sisi Rasulullah shallallahu 'alaihi wasallam, lalu aku ceritakan kisah orang bantuan tersebut kepada beliau dan apa yang dilakukan Khalid. Kemudian Rasulullah shallallahu 'alaihi wasallam berkata: \"Wahai Khalid apa yang mendorongmu untuk melakukan apa yang telah engkau perbuat?\" ia berkata; wahai Rasulullah, sungguh aku menganggapnya sudah terlalu banyak. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Khalid, kembalikan kepadanya apa yang telah engkau ambil!\" Lalu aku katakan kepadanya; sebentar wahai Khalid, bukankah aku telah memenuhi janjiku kepadamu? Kemudian Rasulullah shallallahu 'alaihi wasallam berkata; apakah itu? Kemudian aku beritahukan kepada beliau. Kemudian Rasulullah shallallahu 'alaihi wasallam marah dan berkata: \"Wahai Khalid, jangan engkau kembalikan kepadanya! Apakah kalian akan meninggalkan para pemimpinku? Kalian mendapatkan urusan mereka yang telah bersih dan bagi mereka urusan yang masih keruh.\" Telah menceritakan kepada kami [Ahmad bin Muhammad bin Hanbal], ia berkata; telah menceritakan kepada kami [Al Walid], ia berkata; saya bertanya kepada [Tsaur] mengenai hadits ini. Kemudian ia menceritakan kepadaku dari [Khalid bin Ma'dan], dari [Jubair bin Nufair] dari ['Auf bin Malik Al Asyja'i] seperti hadits tersebut. "
            },
            {
                "number": 2280,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ صَفْوَانَ بْنِ عَمْرٍو عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ وَخَالِدِ بْنِ الْوَلِيدِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالسَّلَبِ لِلْقَاتِلِ وَلَمْ يُخَمِّسْ السَّلَبَ",
                "id": "Telah menceritakan kepada kami [Sa'd bin Manshur?], telah menceritakan kepada kami [Isma'il bin 'Ayyasy] dari [Shafwan bin 'Amr] dari [Abdurrahman bin Jubair bin Nufair] dari [ayahnya], dari ['Auf bin Malik Al Asyja'i], dan [Khalid bin Al Walid] bahwa Rasulullah shallallahu 'alaihi wasallam telah memutuskan bahwa salab adalah untuk orang yang membunuh, dan beliau tidak membagi menjadi lima bagian. "
            },
            {
                "number": 2281,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبَّادٍ الْأَزْدِيُّ قَالَ حَدَّثَنَا وَكِيعٌ عَنْ أَبِيهِ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَنَفَّلَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ بَدْرٍ سَيْفَ أَبِي جَهْلٍ كَانَ قَتَلَهُ",
                "id": "Telah menceritakan kepada kami [Harun bin 'Abbad Al Azdi], ia berkata; telah menceritakan kepada kami [Waki'] dari [ayahnya], dari [Abu Ishaq] dari [Abu 'Ubaidah] dari [Abdullah bin Mas'ud], ia berkata; Rasulullah shallallahu 'alaihi wasallam telah memberiku pedang Abu Jahl bagian pada saat perang Badr. Abdullah adalah orang yang telah membunuhnya. "
            },
            {
                "number": 2282,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ الزُّبَيْدِيِّ عَنْ الزُّهْرِيِّ أَنَّ عَنْبَسَةَ بْنَ سَعِيدٍ أَخْبَرَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يُحَدِّثُ سَعِيدَ بْنَ الْعَاصِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ أَبَانَ بْنَ سَعِيدِ بْنِ الْعَاصِ عَلَى سَرِيَّةٍ مِنْ الْمَدِينَةِ قِبَلَ نَجْدٍ فَقَدِمَ أَبَانُ بْنُ سَعِيدٍ وَأَصْحَابُهُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِخَيْبَرَ بَعْدَ أَنْ فَتَحَهَا وَإِنَّ حُزُمَ خَيْلِهِمْ لِيفٌ فَقَالَ أَبَانُ اقْسِمْ لَنَا يَا رَسُولَ اللَّهِ فَقَالَ أَبُو هُرَيْرَةَ فَقُلْتُ لَا تَقْسِمْ لَهُمْ يَا رَسُولَ اللَّهِ فَقَالَ أَبَانُ أَنْتَ بِهَا يَا وَبْرُ تَحَدَّرُ عَلَيْنَا مِنْ رَأْسِ ضَالٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْلِسْ يَا أَبَانُ وَلَمْ يَقْسِمْ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur?], ia berkata; telah menceritakan kepada kami [Isma'il bin 'Ayyasy] dari [Muhammad bin Al Walid Az Zubaidi] dari [Az Zuhri], bahwa ['Anbasah bin Sa'id] telah mengabarkan kepadanya bahwa ia telah mendengar [Abu Hurairah], menceritakan kepada Sa'id bin Al 'Ash bahwa Rasulullah shallallahu 'alaihi wasallam telah mengutus Aban bin Sa'id bin Al 'Ash dalam sebuah kesatuan militer dari Madinah menuju ke Najd. Kemudian Aban bin Sa'id serta para sahabatnya datang kepada Rasulullah shallallahu 'alaihi wasallam di Khaibar setelah beliau menaklukkannya. Dan tali pengikat badan kuda mereka adalah serat. Kemudian Aban berkata; wahai Rasulullah, bagikan untuk kami! Kemudian Abu Hurairah berkata; jangan engkau bagikan untuk mereka wahai Rasulullah! Kemudian Aban berkata; engkau wahai Abu Hurairah (atas ucapanmu ini) seperti hewan kecil (seperti kucing liar) yang datang kepada kami dari puncak Dhal (nama sebuah gunung atau tempat). "
            },
            {
                "number": 2283,
                "arab": "حَدَّثَنَا حَامِدُ بْنُ يَحْيَى الْبَلْخِيُّ قَالَ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا الزُّهْرِيُّ وَسَأَلَهُ إِسْمَعِيلُ بْنُ أُمَيَّةَ فَحَدَّثَنَاهُ الزُّهْرِيُّ أَنَّهُ سَمِعَ عَنْبَسَةَ بْنَ سَعِيدٍ الْقُرَشِيَّ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ قَالَقَدِمْتُ الْمَدِينَةَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِخَيْبَرَ حِينَ افْتَتَحَهَا فَسَأَلْتُهُ أَنْ يُسْهِمَ لِي فَتَكَلَّمَ بَعْضُ وُلْدِ سَعِيدِ بْنِ الْعَاصِ فَقَالَ لَا تُسْهِمْ لَهُ يَا رَسُولَ اللَّهِ قَالَ فَقُلْتُ هَذَا قَاتِلُ ابْنِ قَوْقَلٍ فَقَالَ سَعِيدُ بْنُ الْعَاصِ يَا عَجَبًا لِوَبْرٍ قَدْ تَدَلَّى عَلَيْنَا مِنْ قَدُومِ ضَالٍ يُعَيِّرُنِي بِقَتْلِ امْرِئٍ مُسْلِمٍ أَكْرَمَهُ اللَّهُ تَعَالَى عَلَى يَدَيَّ وَلَمْ يُهِنِّي عَلَى يَدَيْهِقَالَ أَبُو دَاوُد هَؤُلَاءِ كَانُوا نَحْوَ عَشَرَةٍ فَقُتِلَ مِنْهُمْ سِتَّةٌ وَرَجَعَ مَنْ بَقِيَ",
                "id": "Telah menceritakan kepada kami [Hamid bin Yahya Al Balkhi], ia berkata; telah menceritakan kepada kami [Sufyan], ia berkata; telah menceritakan kepada kami [Az Zuhri], dan ia ditanya Isma'il bin Umayyah kemudian Az Zuhri menceritakannya kepada kami, bahwa ia telah mendengar ['Anbasah bin Sa'id Al Qurasyi], ia menceritakan dari [Abu Hurairah], ia berkata; aku datang ke Madinah sementara Rasulullah shallallahu 'alaihi wasallam di Khaibar ketika beliau telah menaklukkannya. Kemudian aku meminta beliau untuk memberiku saham. Kemudian anak Sa'id bin Al 'Ash (Aban bin Al 'Ash) berkata; jangan engkau beri saham kepadanya wahai Rasulullah! Abu Hurairah berkata; kemudian aku katakan; ini adalah orang yang membunuh Ibnu Qauqal. Kemudian Sa'id bin Al 'Ash berkata; betapa aneh unta kecil, ia telah turun kepada kami dari Dhal dan mencelaku karena membunuh seorang muslim yang Allah ta'ala muliakan melalui diriku. Dan ia tidaklah menghinakanku di hadapannya. Abu Daud berkata; mereka berjumlah sekitar sepuluh orang, dan telah terbunuh enam orang dan kembali sisanya."
            },
            {
                "number": 2284,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ قَالَ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا بُرَيْدٌ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَقَدِمْنَا فَوَافَقْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ افْتَتَحَ خَيْبَرَ فَأَسْهَمَ لَنَا أَوْ قَالَ فَأَعْطَانَا مِنْهَا وَمَا قَسَمَ لِأَحَدٍ غَابَ عَنْ فَتْحِ خَيْبَرَ مِنْهَا شَيْئًا إِلَّا لِمَنْ شَهِدَ مَعَهُ إِلَّا أَصْحَابَ سَفِينَتِنَا جَعْفَرٌ وَأَصْحَابُهُ فَأَسْهَمَ لَهُمْ مَعَهُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`], ia berkata; telah menceritakan kepada kami [Abu Usamah], telah menceritakan kepada kami [Buraid] dari [Abu Burdah] dari [Abu Musa], ia berkata; kami datang dan bertepatan Rasulullah shallallahu 'alaihi wasallam berada di Khaibar. Kemudian beliau memberikan saham kepada kami. -atau ia mengatakan; dan beliau memberikan sebagiannya kepada kami. Dan beliau tidak membagikan kepada seorangpun yang tidak menghadiri penaklukan Khaibar kecuali orang yang hadir bersama beliau, kecuali para penumpang kapal kami yaitu Ja'far dan para sahabatnya. Maka beliau memberikan saham bersama mereka. "
            },
            {
                "number": 2285,
                "arab": "حَدَّثَنَا مَحْبُوبُ بْنُ مُوسَى أَبُو صَالِحٍ أَخْبَرَنَا أَبُو إِسْحَقَ الْفَزَارِيُّ عَنْ كُلَيْبِ بْنِ وَائِلٍ عَنْ هَانِئِ بْنِ قَيْسٍ عَنْ حَبِيبِ بْنِ أَبِي مُلَيْكَةَ عَنْ ابْنِ عُمَرَ قَالَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ يَعْنِي يَوْمَ بَدْرٍ فَقَالَ إِنَّ عُثْمَانَ انْطَلَقَ فِي حَاجَةِ اللَّهِ وَحَاجَةِ رَسُولِ اللَّهِ وَإِنِّي أُبَايِعُ لَهُ فَضَرَبَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَهْمٍ وَلَمْ يَضْرِبْ لِأَحَدٍ غَابَ غَيْرَهُ",
                "id": "Telah menceritakan kepada kami [Mahbub bin Musa Abu Shalih], telah mengabarkan kepada kami [Abu Ishaq Al Fazari], dari [Kulaib bin Wail] dari [Hani` bin Qais] dari [Habib bin Abu Mulaikah] dari [Ibnu Umar], ia berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam berdiri pada saat perang Khaibar kemudian berkata: \"Sesungguhnya Utsman pergi untuk keperluan Allah dan RasulNya, dan aku membai'at untuknya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam memberikannya saham dan tidak memberikan kepada seorangpun yang tidak hadir selainnya. "
            },
            {
                "number": 2286,
                "arab": "حَدَّثَنَا مَحْبُوبُ بْنُ مُوسَى أَبُو صَالِحٍ حَدَّثَنَا أَبُو إِسْحَقَ الْفَزَارِيُّ عَنْ زَائِدَةَ عَنْ الْأَعْمَشِ عَنْ الْمُخْتَارِ بْنِ صَيْفِيٍّ عَنْ يَزِيدَ بْنِ هُرْمُزَ قَالَ كَتَبَ نَجْدَةُإِلَى ابْنِ عَبَّاسٍ يَسْأَلُهُ عَنْ كَذَا وَكَذَا وَذَكَرَ أَشْيَاءَ وَعَنْ الْمَمْلُوكِ أَلَهُ فِي الْفَيْءِ شَيْءٌ وَعَنْ النِّسَاءِ هَلْ كُنَّ يَخْرُجْنَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهَلْ لَهُنَّ نَصِيبٌ فَقَالَ ابْنُ عَبَّاسٍ لَوْلَا أَنْ يَأْتِيَ أُحْمُوقَةً مَا كَتَبْتُ إِلَيْهِ أَمَّا الْمَمْلُوكُ فَكَانَ يُحْذَى وَأَمَّا النِّسَاءُ فَقَدْ كُنَّ يُدَاوِينَ الْجَرْحَى وَيَسْقِينَ الْمَاءَ",
                "id": "Telah menceritakan kepada kami [Mahbub bin Musa Abu Shalih], telah menceritakan kepada kami [Abu Ishaq Al Fazari], dari [Zaidah] dari [Al A'masy] dari [Al Mukhtar bin Shaifi], dari [Yazid bin Hurmuz], ia berkata; Najdah menulis surat kepada [Ibnu Abbas] ia bertanya mengenai ini dan ini -Yazid menyebutkan beberapa hal- dan mengenai budak, apakah ia mendapatkan fai`? Dan mengenai wanita, apakah mereka keluar bersama Rasulullah shallallahu 'alaihi wasallam? Dan apakah mereka mendapatkan bagian? Kemudian Ibnu Umar berkata; seandainya ia tidak melakukan perbuatan orang-orang yang bodoh maka aku tidak akan mengirim surat kepadanya. Adapun budak maka ia diberi pemberian, dan adapun para wanita maka mereka mengobati dan memberi minum. "
            },
            {
                "number": 2287,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ قَالَ حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ يَعْنِي الْوَهْبِيَّ حَدَّثَنَا ابْنُ إِسْحَقَ عَنْ أَبِي جَعْفَرٍ وَالزُّهْرِيِّ عَنْ يَزِيدَ بْنِ هُرْمُزَ قَالَ كَتَبَ نَجْدَةُ الْحَرُورِيُّإِلَى ابْنِ عَبَّاسٍ يَسْأَلُهُ عَنْ النِّسَاءِ هَلْ كُنَّ يَشْهَدْنَ الْحَرْبَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهَلْ كَانَ يَضْرِبُ لَهُنَّ بِسَهْمٍ قَالَ فَأَنَا كَتَبْتُ كِتَابَ ابْنِ عَبَّاسٍ إِلَى نَجْدَةَ قَدْ كُنَّ يَحْضُرْنَ الْحَرْبَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَّا أَنْ يُضْرَبَ لَهُنَّ بِسَهْمٍ فَلَا وَقَدْ كَانَ يُرْضَخُ لَهُنَّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris], ia berkata; telah menceritakan kepada kami [Ahmad bin Khalid Al Wahbi], telah menceritakan kepada kami [Ibnu Ishaq] dari [Abu Ja'far] dan [Az Zuhri] dari [Yazid bin Hurmuz], ia berkata; [Najdah Al Haruri] menulis surat kepada [Ibnu Abbas], ia bertanya kepadanya mengenai para wanita, apakah mereka menghadiri peperangan bersama Rasulullah shallallahu 'alaihi wasallam? Dan apakah mereka diberi saham? Yazid berkata; aku yang menulis surat Ibnu Abbas kepada Najdah. Sungguh mereka telah menghadiri peperangan bersama Rasulullah shallallahu 'alaihi wasallam. Adapun mereka tidak diberi saham (bagian), dan terkadang diberi pemberian. "
            },
            {
                "number": 2288,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ وَغَيْرُهُ قَالَا أَخْبَرَنَا زَيْدُ بْنُ الْحُبَابِ قَالَ حَدَّثَنَا رَافِعُ بْنُ سَلَمَةَ بْنِ زِيَادٍ حَدَّثَنِي حَشْرَجُ بْنُ زِيَادٍ عَنْ جَدَّتِهِ أُمِّ أَبِيهِأَنَّهَا خَرَجَتْ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ خَيْبَرَ سَادِسَ سِتِّ نِسْوَةٍ فَبَلَغَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَعَثَ إِلَيْنَا فَجِئْنَا فَرَأَيْنَا فِيهِ الْغَضَبَ فَقَالَ مَعَ مَنْ خَرَجْتُنَّ وَبِإِذْنِ مَنْ خَرَجْتُنَّ فَقُلْنَا يَا رَسُولَ اللَّهِ خَرَجْنَا نَغْزِلُ الشَّعَرَ وَنُعِينُ بِهِ فِي سَبِيلِ اللَّهِ وَمَعَنَا دَوَاءُ الْجَرْحَى وَنُنَاوِلُ السِّهَامَ وَنَسْقِي السَّوِيقَ فَقَالَ قُمْنَ حَتَّى إِذَا فَتَحَ اللَّهُ عَلَيْهِ خَيْبَرَ أَسْهَمَ لَنَا كَمَا أَسْهَمَ لِلرِّجَالِ قَالَ قُلْتُ لَهَا يَا جَدَّةُ وَمَا كَانَ ذَلِكَ قَالَتْ تَمْرًا",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Sa'id], dan selainnya, mereka berkata; telah mengabarkan kepada kami [Zaid bin Al Hubab], ia berkata; telah menceritakan kepada kami [Rafi' bin Salamah bin Ziyad], telah menceritakan kepadaku [Hasyraj bin Ziyad], dari [neneknya yaitu ibu ayahnya], bahwa ia pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam pada waktu perang Khaibar, ia adalah wanita yang ketujuh. Kemudian hal tersebut sampai kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau mengirim utusan kepada kami. Kami melihat pada diri beliau terdapat kemarahan, beliau mengatakan; bersama siapakah kalian keluar? Dan dengan izin siapakah kalian keluar? Lalu kami katakan; wahai Rasulullah, kami keluar untuk melantunkan syair, dan dengannya kami membantu di jalan Allah, dan kami membawa obat untuk orang yang terluka, kami mengambilkan anak panah, serta memberi minum. Kemudian beliau berkata: \"Bangkitlah kalian.\" Hingga setelah Allah menaklukkan Khaibar beliau memberi kami bagian sebagaimana memberi bagian kepada para lelaki. Ia berkata; aku katakan kepadanya; wahai nenek. Apakah bagian tersebut? Ia berkata; kurma. "
            },
            {
                "number": 2289,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ عَنْ مُحَمَّدِ بْنِ زَيْدٍ قَالَ حَدَّثَنِي عُمَيْرٌ مَوْلَى آبِي اللَّحْمِ قَالَشَهِدْتُ خَيْبَرَ مَعَ سَادَتِي فَكَلَّمُوا فِيَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِي فَقُلِّدْتُ سَيْفًا فَإِذَا أَنَا أَجُرُّهُ فَأُخْبِرَ أَنِّي مَمْلُوكٌ فَأَمَرَ لِي بِشَيْءٍ مِنْ خُرْثِيِّ الْمَتَاعِقَالَ أَبُو دَاوُد مَعْنَاهُ أَنَّهُ لَمْ يُسْهِمْ لَهُ قَالَ أَبُو دَاوُد وَقَالَ أَبُو عُبَيْدٍ كَانَ حَرَّمَ اللَّحْمَ عَلَى نَفْسِهِ فَسُمِّيَ آبِي اللَّحْمِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Bisyr bin Al Mufadhdhal], dari [Muhammad bin Zaid], ia berkata; telah menceritakan kepadaku [Umair] mantan budak Abu Al Lahm, ia berkata; aku pernah menghadiri perang Khaibar bersama para majikanku. Kemudian mereka berbica kepada Rasulullah shallallahu 'alaihi wasallam mengenai diriku, kemudian beliau memerintahkanku agar diberi pedang, tatkala aku menyeretnya aku memberitahukan kepadanya bahwa aku adalah seorang budak. Kemudian beliau memerintahkan agar aku diberi perabotan rumah. Abu Daud berkata; artinya bahwa beliau tidak memberikan saham kepadanya. Abu Daud berkata; dan Abu 'Ubaid berkata; ia pernah mengharamkan daging atas dirinya maka ia dinamai Abu Al Lahm. "
            },
            {
                "number": 2290,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَكُنْتُ أَمِيحُ أَصْحَابِي الْمَاءَ يَوْمَ بَدْرٍ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur?], telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir], ia berkata; aku pernah memberi minum para sahabatku pada saat perang Badr. "
            },
            {
                "number": 2291,
                "arab": "حَدَّثَنَا مُسَدَّدٌ وَيَحْيَى بْنُ مَعِينٍ قَالَا حَدَّثَنَا يَحْيَى عَنْ مَالِكٍ عَنْ الْفُضَيْلِ عَنْ عَبْدِ اللَّهِ بْنِ نِيَارٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَ يَحْيَىإِنَّ رَجُلًا مِنْ الْمُشْرِكِينَ لَحِقَ بِالنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِيُقَاتِلَ مَعَهُ فَقَالَ ارْجِعْ ثُمَّ اتَّفَقَا فَقَالَ إِنَّا لَا نَسْتَعِينُ بِمُشْرِكٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Yahya bin Ma'in], mereka berkata; telah menceritakan kepada kami [Yahya] dari [Malik] dari [Al Fudhail] dari [Abdullah bin Niyar], dari ['Urwah] dari [Aisyah], Yahya berkata; sesungguhnya terdapat seorang musyrik yang mengikuti Rasulullah shallallahu 'alaihi wasallam untuk berperang bersama beliau. Kemudian beliau berkata; kembalilah! -kemudian mereka berdua sama lafazhnya: kemudian beliau berkata: \"Sesungguhnya kami tidak meminta bantuan kepada orang musyrik.\""
            },
            {
                "number": 2292,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْهَمَ لِرَجُلٍ وَلِفَرَسِهِ ثَلَاثَةَ أَسْهُمٍ سَهْمًا لَهُ وَسَهْمَيْنِ لِفَرَسِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam memberikan tiga saham kepada seseorang dan kudanya, satu saham untuknya dan dua saham untuk kudanya. "
            },
            {
                "number": 2293,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنِي الْمَسْعُودِيُّ حَدَّثَنِي أَبُو عَمْرَةَ عَنْ أَبِيهِ قَالَأَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعَةَ نَفَرٍ وَمَعَنَا فَرَسٌ فَأَعْطَى كُلَّ إِنْسَانٍ مِنَّا سَهْمًا وَأَعْطَى لِلْفَرَسِ سَهْمَيْنِحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أُمَيَّةُ بْنُ خَالِدٍ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ رَجُلٍ مِنْ آلِ أَبِي عَمْرَةَ عَنْ أَبِي عَمْرَةَ بِمَعْنَاهُ إِلَّا أَنَّهُ قَالَ ثَلَاثَةُ نَفَرٍ زَادَ فَكَانَ لِلْفَارِسِ ثَلَاثَةُ أَسْهُمٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Abdullah bin Yazid], telah menceritakan kepadaku [Al Mas'udi], telah menceritakan kepadaku [Abu 'Amrah] dari [ayahnya], ia berkata; kami telah datang kepada Rasulullah shallallahu 'alaihi wasallam berjumlah empat orang, dan kami membawa kuda. Kemudian beliau memberi setiap dari kami satu saham dan untuk kuda dua saham. Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Umayyah bin Khalid], telah menceritakan kepada kami [Al Mas'udi], dari [seorang laki-laki dari keluarga Abu 'Amrah], dari [Abu 'Amrah] seperti makna hadits tersebut hanya saja ia berkata; tiga orang. Ia menambahkan; untuk kuda tiga saham. "
            },
            {
                "number": 2294,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا مُجَمِّعُ بْنُ يَعْقُوبَ بْنِ مُجَمِّعِ بْنِ يَزِيدَ الْأَنْصَارِيُّ قَالَ سَمِعْتُ أَبِي يَعْقُوبَ بْنِ مُجَمِّعٍ يَذْكُرُ عَنْ عَمِّهِ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ الْأَنْصَارِيِّ عَنْ عَمِّهِ مُجَمِّعِ بْنِ جَارِيَةَ الْأَنْصَارِيِّ وَكَانَ أَحَدَ الْقُرَّاءِ الَّذِينَ قَرَءُوا الْقُرْآنَ قَالَ شَهِدْنَا الْحُدَيْبِيَةَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا انْصَرَفْنَا عَنْهَا إِذَا النَّاسُ يَهُزُّونَ الْأَبَاعِرَ فَقَالَ بَعْضُ النَّاسِ لِبَعْضٍ مَا لِلنَّاسِ قَالُوا أُوحِيَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجْنَا مَعَ النَّاسِ نُوجِفُ فَوَجَدْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاقِفًا عَلَى رَاحِلَتِهِ عِنْدَ كُرَاعِ الْغَمِيمِ فَلَمَّا اجْتَمَعَ عَلَيْهِ النَّاسُ قَرَأَ عَلَيْهِمْ إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَفَتْحٌ هُوَ قَالَ نَعَمْ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ إِنَّهُ لَفَتْحٌ فَقُسِّمَتْ خَيْبَرُ عَلَى أَهْلِ الْحُدَيْبِيَةِ فَقَسَّمَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى ثَمَانِيَةَ عَشَرَ سَهْمًا وَكَانَ الْجَيْشُ أَلْفًا وَخَمْسَ مِائَةٍ فِيهِمْ ثَلَاثُ مِائَةِ فَارِسٍ فَأَعْطَى الْفَارِسَ سَهْمَيْنِ وَأَعْطَى الرَّاجِلَ سَهْمًا قَالَ أَبُو دَاوُد حَدِيثُ أَبِي مُعَاوِيَةَ أَصَحُّ وَالْعَمَلُ عَلَيْهِ وَأَرَى الْوَهْمَ فِي حَدِيثِ مُجَمِّعٍ أَنَّهُ قَالَ ثَلَاثَ مِائَةِ فَارِسٍ وَكَانُوا مِائَتَيْ فَارِسٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa], telah menceritakan kepada kami [Mujammi' bin Ya'qub bin Yazid Al Anshari], ia berkata; saya mendengar ayahku [Ya'qub bin Mujammi'] ia menyebutkan dari [pamannya yaitu Abdurrahman bin Yazid Al Anshari], dari [pamannya yaitu Mujammi' bin Jariyah Al Anshari], dan ia adalah salah seorang ahli al-qur'an. Ia berkata; kami pernah menghadiri perdamaian Hudaibiyah bersama Rasulullah shallallahu 'alaihi wasallam. Kemudian tatkala kami telah pergi dari Hudaibiyah, ternyata terdapat orang-orang yang menggerakkan beberapa unta. Kemudian sebagian orang berkata kepada sebagian yang lain; ada apa dengan orang-orang? Mereka berkata; Rasulullah shallallahu 'alaihi wasallam telah diberi wahyu. Kemudian kami keluar bersama orang-orang, kami mempercepat kendaraan kami, kemudian kami dapati Nabi shallallahu 'alaihi wasallam berdiri di atas kendaraannya di Kura' Al Ghamim. Kemudian tatkala orang-orang telah berkumpul beliau membacakan kepada mereka ayat: \"Sesungguhnya Kami telah memberikan kepadamu kemenangan yang nyata.\" Kemudian terdapat seseorang yang berkata; apakah ini adalah sebuah penaklukan? Beliau berkata: \"Ya, demi Dzat yang jiwa Muhammad ada di tangannya, sesungguhnya itu adalah sebuah penaklukan.\" Kemudian Khaibar dibagikan kepada orang-orang yang menghadiri perdamaian Hudaibiyah. Rasulullah shallallahu wa'alaihi wa sallam membaginya menjadi delapan belas saham. Dan jumlah pasukan adalah seribu lima ratus, diantara mereka terdapat tiga ratus penunggang kuda. Beliau memberi dua saham kepada penunggang kuda dan satu saham kepada orang yang berjalan kaki. Abu Daud berkata; hadits Abu Mu'awiyah lebih shahih, dan menjadi dasar untuk beramal. Dan aku melihat kesalahan ada dalam hadits Mujammi', bahwa ia berkata; tiga ratus penunggang kuda, padahal mereka berjumlah dua ratus penunggang kuda. "
            },
            {
                "number": 2295,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ قَالَ أَخْبَرَنَا خَالِدٌ عَنْ دَاوُدَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ بَدْرٍ مَنْ فَعَلَ كَذَا وَكَذَا فَلَهُ مِنْ النَّفَلِ كَذَا وَكَذَا قَالَ فَتَقَدَّمَ الْفِتْيَانُ وَلَزِمَ الْمَشْيَخَةُ الرَّايَاتِ فَلَمْ يَبْرَحُوهَا فَلَمَّا فَتَحَ اللَّهُ عَلَيْهِمْ قَالَ الْمَشْيَخَةُ كُنَّا رِدْءًا لَكُمْ لَوْ انْهَزَمْتُمْ لَفِئْتُمْ إِلَيْنَا فَلَا تَذْهَبُوا بِالْمَغْنَمِ وَنَبْقَى فَأَبَى الْفِتْيَانُ وَقَالُوا جَعَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَنَا فَأَنْزَلَ اللَّهُ{ يَسْأَلُونَكَ عَنْ الْأَنْفَالِ قُلْ الْأَنْفَالُ لِلَّهِ وَالرَّسُولِ إِلَى قَوْلِهِ كَمَا أَخْرَجَكَ رَبُّكَ مِنْ بَيْتِكَ بِالْحَقِّ وَإِنَّ فَرِيقًا مِنْ الْمُؤْمِنِينَ لَكَارِهُونَ }يَقُولُ فَكَانَ ذَلِكَ خَيْرًا لَهُمْ فَكَذَلِكَ أَيْضًا فَأَطِيعُونِي فَإِنِّي أَعْلَمُ بِعَاقِبَةِ هَذَا مِنْكُمْحَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ حَدَّثَنَا هُشَيْمٌ قَالَ أَخْبَرَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَوْمَ بَدْرٍ مَنْ قَتَلَ قَتِيلًا فَلَهُ كَذَا وَكَذَا وَمَنْ أَسَرَ أَسِيرًا فَلَهُ كَذَا وَكَذَا ثُمَّ سَاقَ نَحْوَهُ وَحَدِيثُ خَالِدٍ أَتَمُّ حَدَّثَنَا هَارُونُ بْنُ مُحَمَّدِ بْنِ بَكَّارِ بْنِ بِلَالٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ الْهَمْدَانِيُّ قَالَ حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ قَالَ أَخْبَرَنِي دَاوُدُ بِهَذَا الْحَدِيثِ بِإِسْنَادِهِ قَالَ فَقَسَّمَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالسَّوَاءِ وَحَدِيثُ خَالِدٍ أَتَمُّ",
                "id": "Telah menceritakan kepada kami [Wahb bin Baqiyyah], ia berkata; telah mengabarkan kepada kami [Khalid] dari [Daud], dari [Ikrimah], dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda pada saat perang Badr: \"Barangsiapa yang melakukan demikian dan demikian, maka baginya tambahan pemberian demikian dan demikian.\" Kemudian orang-orang yang muda maju sedangkan orang-orang tua menjaga bendera, dan mereka tidak meninggalkannya hingga Allah memenangkan atas mereka. Orang-orang tua berkata; kami adalah adalah penolong kalian, seandainya kalian kalah maka kalian akan bergabung kepada kami, maka janganlah kalian membawa rampasan perang sementara kami tetap di tempat dan tidak mengambilnya. Kemudian para pemuda menolak hal tersebut dan berkata; Rasulullah shallallahu 'alaihi wasallam telah menjadikannya untuk kami. Kemudian Allah menurunkan ayat: \"Mereka menanyakan kepadamu tentang (pembagian) harta rampasan perang. Katakanlah: \"Harta rampasan perang kepunyaan Allah dan Rasul….. hingga firmanNya: \"Sebagaimana Tuhanmu menyuruhmu pergi dan rumahmu dengan kebenaran, padahal sesungguhnya sebagian dari orang-orang yang beriman itu tidak menyukainya.\" Ibnu Abbas berkata berkata; maka hal tersebut menjadi sesuatu yang lebih baik bagi mereka, dan seperti itu juga; maka taatilah aku sesungguhnya aku lebih mengetahui akibat hal ini daripada kalian. Telah menceritakan kepada kami [Ziyad bin Ayyub], telah menceritakan kepada kami [Husyaim], ia berkata; telah mengabarkan kepada kami [Daud bin Abu Hindun], dari [Ikrimah], dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam berkata pada saat perang Badr: \"Barangsiapa yang membunuh satu orang, maka baginya demikian dan demikain. Dan barangsiapa yang menawan tawanan, maka baginya demikian dan demikian.\" Kemudian ia menyebutkan seperti hadits tersebut. Dan hadits Khalid lebih sempurna. Telah menceritakan kepada kami [Harun bin Muhammad bin Bakkar bin Bilal], ia berkata; telah menceritakan kepada kami [Yazid bin Khalid bin Mauhab Al Hamdani], ia berkata; telah menceritakan kepada kami [Yahya bin Zakariya bin Abu Zaidah], ia berkata; telah mengabarkan kepadaku [Daud] dengan hadits ini menggunakan sanadnya. Ia berkata; kemudian Rasulullah shallallahu 'alaihi wasallam membaginya dengan sama. Dan hadits Khalid lebih sempurna. "
            },
            {
                "number": 2296,
                "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي بَكْرٍ عَنْ عَاصِمٍ عَنْ مُصْعَبِ بْنِ سَعْدٍ عَنْ أَبِيهِ قَالَجِئْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ بَدْرٍ بِسَيْفٍ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ قَدْ شَفَى صَدْرِي الْيَوْمَ مِنْ الْعَدُوِّ فَهَبْ لِي هَذَا السَّيْفَ قَالَ إِنَّ هَذَا السَّيْفَ لَيْسَ لِي وَلَا لَكَ فَذَهَبْتُ وَأَنَا أَقُولُ يُعْطَاهُ الْيَوْمَ مَنْ لَمْ يُبْلِ بَلَائِي فَبَيْنَمَا أَنَا إِذْ جَاءَنِي الرَّسُولُ فَقَالَ أَجِبْ فَظَنَنْتُ أَنَّهُ نَزَلَ فِيَّ شَيْءٌ بِكَلَامِي فَجِئْتُ فَقَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّكَ سَأَلْتَنِي هَذَا السَّيْفَ وَلَيْسَ هُوَ لِي وَلَا لَكَ وَإِنَّ اللَّهَ قَدْ جَعَلَهُ لِي فَهُوَ لَكَ ثُمَّ قَرَأَ{ يَسْأَلُونَكَ عَنْ الْأَنْفَالِ قُلْ الْأَنْفَالُ لِلَّهِ وَالرَّسُولِ }إِلَى آخِرِ الْآيَةِقَالَ أَبُو دَاوُد قِرَاءَةُ ابْنِ مَسْعُودٍ يَسْأَلُونَكَ النَّفْلَ",
                "id": "Telah menceritakan kepada kami [Hannad bin As Sari] dari [Abu Bakr] dari ['Ashim] dari [Mush'ab bin Sa'd] dari [ayahnya], ia berkata; aku datang kepada Nabi shallallahu 'alaihi wasallam pada saat perang Badr dengan membawa sebuah pedang. Lalu aku katakan; wahai Rasulullah, sesungguhnya pada hari ini Allah telah mengobati dadaku dari musuh. Maka berikanlah pedang ini kepadaku. Beliau berkata: \"Sesungguhnya pedang ini bukan milikku dan bukan milikmu.\" Kemudian aku pergi dan aku katakan; pada hari ini pedang itu akan diberikan kepada orang yang tidak mendapatkan musibah seperti musibahku. Ketika aku dalam keadaan seperti itu, tiba-tiba seorang utusan datang kepadaku lalu berkata; sambutlah panggilan beliau! Lalu aku menyangka bahwa telah turun sesuatu mengenaiku karena ucapanku. Lalu aku datang dan Nabi shallallahu 'alaihi wasallam berkata kepadaku: \"Sesungguhnya engkau telah meminta pedang ini kepadaku, dan pedang tersebut bukanlah milikku dan bukan milikmu. Dan sesungguhnya Allah telah memberikannya kepadaku. Pedang tersebut untukmu.\" Kemudian beliau membacakan ayat: \"Mereka menanyakan kepadamu tentang (pembagian) harta rampasan perang. Katakanlah: \"Harta rampasan perang kepunyaan Allah dan Rasul…..\" hingga akhir ayat. Abu Daud berkata; sedangkan qira`ah (cara membaca) Ibnu Mas'ud adalah; YAS-ALUUNAKAN NAFLA. "
            },
            {
                "number": 2297,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ ح و حَدَّثَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ الْأَنْطَاكِيُّ قَالَ حَدَّثَنَا مُبَشَّرٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ الطَّائِيُّ أَنَّ الْحَكَمَ بْنَ نَافِعٍ حَدَّثَهُمْ الْمَعْنَى كُلُّهُمْ عَنْ شُعَيْبِ بْنِ أَبِي حَمْزَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَبَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي جَيْشٍ قِبَلَ نَجْدٍ وَانْبَعَثَتْ سَرِيَّةٌ مِنْ الْجَيْشِ فَكَانَ سُهْمَانُ الْجَيْشِ اثْنَيْ عَشَرَ بَعِيرًا اثْنَيْ عَشَرَ بَعِيرًا وَنَفَّلَ أَهْلَ السَّرِيَّةِ بَعِيرًا بَعِيرًا فَكَانَتْ سُهْمَانُهُمْ ثَلَاثَةَ عَشَرَ ثَلَاثَةَ عَشَرَحَدَّثَنَا الْوَلِيدُ بْنُ عُتْبَةَ الدِّمَشْقِيُّ قَالَ قَالَ الْوَلِيدُ يَعْنِي ابْنَ مُسْلِمٍ حَدَّثْتُ ابْنَ الْمُبَارَكِ بِهَذَا الْحَدِيثِ قُلْتُ وَكَذَا حَدَّثَنَا ابْنُ أَبِي فَرْوَةَ عَنْ نَافِعٍ قَالَ لَا تَعْدِلُ مَنْ سَمَّيْتَ بِمَالِكٍ هَكَذَا أَوْ نَحْوَهُ يَعْنِي مَالِكَ بْنَ أَنَسٍ",
                "id": "Telah menceritakan kepada kami [Abdul Wahhab bin Najdah], telah menceritakan kepada kami [Al Walid bin Muslim], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Musa bin Abdurrahman Al Anthaki], ia berkata; telah menceritakan kepada kami [Mubasysyar], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Muhammad bin 'Auf Ath Tha`i], bahwa [Al Hakam bin Nafi'], telah menceritakan kepada mereka secara makna, seluruh mereka berasal dari [Syu'aib bin Abu Hamzah], dari [Nafi'], dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam mengutus kami dalam sebuah pasukan menuju Najd, kemudian diutuslah satu kesatuan militer dari pasukan tersebut, saham pasukan tersebut adalah dua belas unta, dua belas unta. Dan beliau memberikan tambahan kepada kesatuan militer satu unta, satu unta. Sehingga saham mereka adalah tiga belas. Telah menceritakan kepada kami [Al Walid bin 'Utbah Ad Dimasyqi], ia berkata; [Al Walid bin Muslim] berkata; aku menceritakan kepada Ibnu Al Mubarak dengan hadits ini. Aku katakan; demikianlah [Ibnu Abu Farwah] menceritakan kepada kami dari [Nafi'], ia berkata; orang yang telah engkau sebutkan tidak sama dengan seorang Malik, yaitu Malik bin Anas. "
            },
            {
                "number": 2298,
                "arab": "حَدَّثَنَا هَنَّادٌ قَالَ حَدَّثَنَا عَبْدَةُ يَعْنِي ابْنَ سُلَيْمَانَ الْكِلَابِيَّ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً إِلَى نَجْدٍ فَخَرَجْتُ مَعَهَا فَأَصَبْنَا نَعَمًا كَثِيرًا فَنَفَّلَنَا أَمِيرُنَا بَعِيرًا بَعِيرًا لِكُلِّ إِنْسَانٍ ثُمَّ قَدِمْنَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَسَمَ بَيْنَنَا غَنِيمَتَنَا فَأَصَابَ كُلُّ رَجُلٍ مِنَّا اثْنَيْ عَشَرَ بَعِيرًا بَعْدَ الْخُمُسِ وَمَا حَاسَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالَّذِي أَعْطَانَا صَاحِبُنَا وَلَا عَابَ عَلَيْهِ بَعْدَ مَا صَنَعَ فَكَانَ لِكُلِّ رَجُلٍ مِنَّا ثَلَاثَةَ عَشَرَ بَعِيرًا بِنَفْلِهِ",
                "id": "Telah menceritakan kepada kami [Hannad], telah menceritakan kepada kami ['Abdah bin Sulaiman Al Kilabi] dari [Muhammad bin Ishaq] dari [Nafi'] dari [Ibnu Umar], ia berkata; Rasulullah shallallahu 'alaihi wasallam mengutus satu kesatuan militer ke Najd, kemudian aku keluar bersama kesatuan militer tersebut dan kami mendapatkan banyak binatang ternak. Kemudian pemimpin kami memberikan tambahan satu unta, satu unta untuk setiap orang. Kemudian kami datang kepada Rasulullah shallallahu 'alaihi wasallam dan beliau membagikan rampasan perang kepada kami. Sehingga setiap kami mendapatkan dua belas unta setelah diambil seperlima. Dan Rasulullah shallallahu 'alaihi wasallam tidak menghitung apa yang telah diberikan pemimpin kami kepada kami, dan beliau tidak mencelanya setelah ia melakukan hal tersebut. Sehingga setiap kami memiliki tiga belas unta dengan tambahan tersebut. "
            },
            {
                "number": 2299,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ ح و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ وَيَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ قَالَا حَدَّثَنَا اللَّيْثُ الْمَعْنَى عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ سَرِيَّةً فِيهَا عَبْدُ اللَّهِ بْنُ عُمَرَ قِبَلَ نَجْدٍ فَغَنِمُوا إِبِلًا كَثِيرَةً فَكَانَتْ سُهْمَانُهُمْ اثْنَيْ عَشَرَ بَعِيرًا وَنُفِّلُوا بَعِيرًا بَعِيرًا زَادَ ابْنُ مَوْهَبٍ فَلَمْ يُغَيِّرْهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Abdullah bin Maslamah], dan [Yazid? bin Khalid bin Mauhab], mereka berkata; telah menceritakan kepada kami [Al Laits] secara makna, dari [Nafi'] dari [Abdullah bin Umar], bahwa Rasulullah shallallahu 'alaihi wasallam telah mengirim satu kesatuan militer yang padanya terdapat Abdullah bin Umar ke arah Najd. Kemudian mereka mendapatkan rampasan unta yang banyak. Saham mereka adalah dua belas unta dan mereka diberi tambahan satu ekor, satu ekor oleh Ibnu Mauhab, dan Rasulullah shallallahu 'alaihi wasallam tidak mengubah hal tersebut. "
            },
            {
                "number": 2300,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنِي نَافِعٌ عَنْ عَبْدِ اللَّهِ قَالَبَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَرِيَّةٍ فَبَلَغَتْ سُهْمَانُنَا اثْنَيْ عَشَرَ بَعِيرًا وَنَفَّلَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعِيرًا بَعِيرًاقَالَ أَبُو دَاوُد رَوَاهُ بُرْدُ بْنُ سِنَانٍ عَنْ نَافِعٍ مِثْلَ حَدِيثِ عُبَيْدِ اللَّهِ وَرَوَاهُ أَيُّوبُ عَنْ نَافِعٍ مِثْلَهُ إِلَّا أَنَّهُ قَالَ وَنُفِّلْنَا بَعِيرًا بَعِيرًا لَمْ يَذْكُرْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari ['ubaidhullah], ia berkata; telah menceritakan kepadaku [Nafi'], dari [Abdullah], ia berkata; Rasulullah shallallahu 'alaihi wasallam telah mengutus kami dalam sebuah kesatuan militer. Dan saham mereka mencapai dua belas unta. Dan Rasulullah shallallahu 'alaihi wasallam memberikan tambahan satu unta, satu unta. Abu Daud berkata; hadits tersebut diriwayatkan oleh [Burd bin Sinan] dari [Nafi'] seperti hadits 'ubaidhullah. Dan telah diriwayatkan oleh [Ayyub] dari [Nafi'] seperti itu hanya saja ia berkata; dan kami diberi tambahan satu unta, satu unta. Dan ia tidak menyebutkan Nabi shallallahu 'alaihi wasallam. "
            },
            {
                "number": 2301,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ قَالَ حَدَّثَنِي أَبِي عَنْ جَدِّي ح و حَدَّثَنَا حَجَّاجُ بْنُ أَبِي يَعْقُوبَ قَالَ حَدَّثَنِي حُجَيْنٌ قَالَ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ عَنْ سَالِمٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ كَانَ يُنَفِّلُ بَعْضَ مَنْ يَبْعَثُ مِنْ السَّرَايَا لِأَنْفُسِهِمْ خَاصَّةَ النَّفَلِ سِوَى قَسْمِ عَامَّةِ الْجَيْشِ وَالْخُمُسُ فِي ذَلِكَ وَاجِبٌ كُلُّهُ",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin Syu'aib bin Al Laits], ia berkata; telah menceritakan kepadaku [ayahku], dari [kakekku], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Hajjaj bin Abu Ya'qub], ia berkata; telah menceritakan kepadaku [Hujain], ia berkata; telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Ibnu Syihab], dari [Salim] dari [Abdullah bin Umar], bahwa Rasulullah shallallahu 'alaihi wasallam telah memberikan tambahan kepada sebagian orang yang beliau utus dari kesatuan-kesatuan militer khusus untuk mereka selain bagian yang diberikan kepada para pasukan secara umum. Dan seperlima dalam hal tersebut adalah wajib semua. "
            },
            {
                "number": 2302,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنَا حُيَيٌّ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يَوْمَ بَدْرٍ فِي ثَلَاثِ مِائَةٍ وَخَمْسَةَ عَشَرَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ إِنَّهُمْ حُفَاةٌ فَاحْمِلْهُمْ اللَّهُمَّ إِنَّهُمْ عُرَاةٌ فَاكْسُهُمْ اللَّهُمَّ إِنَّهُمْ جِيَاعٌ فَأَشْبِعْهُمْ فَفَتَحَ اللَّهُ لَهُ يَوْمَ بَدْرٍ فَانْقَلَبُوا حِينَ انْقَلَبُوا وَمَا مِنْهُمْ رَجُلٌ إِلَّا وَقَدْ رَجَعَ بِجَمَلٍ أَوْ جَمَلَيْنِ وَاكْتَسَوْا وَشَبِعُوا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Abdullah bin Wahb], telah menceritakan kepada kami [Huyai] dari [Abu Abdurrahman Al Hubuli], dari [Abdullah bin 'Amr], bahwa Rasulullah shallallahu 'alaihi wasallam keluar pada saat perang Badr bersama tiga ratus lima belas orang. Rasulullah shallallahu 'alaihi wasallam berdo'a: \"Ya Allah, mereka adalah orang-orang yang tidak beralas kaki maka berilah mereka tunggangan, mereka adalah orang-orang yang telanjang maka berilah mereka pakaian, sesungguhnya mereka adalah orang-orang yang lapar maka kenyangkanlah mereka.\" Kemudian Allah memberi beliau kemenangan pada perang Badr. Sehingga mereka berbalik kondisi mereka, tidak ada seorangpun diantara mereka melainkan ia telah pulang dengan membawa satu atau dua ekor unta, dan mereka berpakaian serta merasa kenyang. "
            },
            {
                "number": 2303,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ قَالَ أَخْبَرَنَا سُفْيَانُ عَنْ يَزِيدَ بْنِ يَزِيدَ بْنِ جَابِرٍ الشَّامِيِّ عَنْ مَكْحُولٍ عَنْ زِيَادِ بْنِ جَارِيَةَ التَّمِيمِيِّ عَنْ حَبِيبِ بْنِ مَسْلَمَةَ الْفِهْرِيِّ أَنَّهُ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُنَفِّلُ الثُّلُثَ بَعْدَ الْخُمُسِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], ia berkata; telah mengabarkan kepada kami [Sufyan] dari [Yazid bin Yazid bin Jabir Asy Syami], dari [Makhul] dari [Ziyad bin Jariyah At Taimi] dari [Habib bin Maslamah Al Fihri], bahwa ia berkata; Rasulullah shallallahu 'alaihi wasallam memberikan tambahan sepertiga setelah diambil seperlima. "
            },
            {
                "number": 2304,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ الْجُشَمِيُّ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ الْعَلَاءِ بْنِ الْحَارِثِ عَنْ مَكْحُولٍ عَنْ ابْنِ جَارِيَةَ عَنْ حَبِيبِ بْنِ مَسْلَمَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُنَفِّلُ الرُّبْعَ بَعْدَ الْخُمُسِ وَالثُّلُثَ بَعْدَ الْخُمُسِ إِذَا قَفَلَ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Umar bin Maisarah Al Jusyami], ia berkata; telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Mu'awiyah bin Shalih] dari [Al 'Ala` bin Al Harits] dari [Makhul] dari [Ibnu Jariyah] dari [Habib bin Maslamah] bahwa Rasulullah shallallahu 'alaihi wasallam memberikan tambahan seperempat setelah diambil seperlima, dan sepertiga setelah diambil seperlima apabila berangkat. "
            },
            {
                "number": 2305,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ بَشِيرِ بْنِ ذَكْوَانَ وَمَحْمُودُ بْنُ خَالِدٍ الدِّمَشْقِيَّانِ الْمَعْنَى قَالَا حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ قَالَ سَمِعْتُ أَبَا وَهْبٍ يَقُولُ سَمِعْتُ مَكْحُولًا يَقُولُكُنْتُ عَبْدًا بِمِصْرَ لِامْرَأَةٍ مِنْ بَنِي هُذَيْلٍ فَأَعْتَقَتْنِي فَمَا خَرَجْتُ مِنْ مِصْرَ وَبِهَا عِلْمٌ إِلَّا حَوَيْتُ عَلَيْهِ فِيمَا أُرَى ثُمَّ أَتَيْتُ الْحِجَازَ فَمَا خَرَجْتُ مِنْهَا وَبِهَا عِلْمٌ إِلَّا حَوَيْتُ عَلَيْهِ فِيمَا أُرَى ثُمَّ أَتَيْتُ الْعِرَاقَ فَمَا خَرَجْتُ مِنْهَا وَبِهَا عِلْمٌ إِلَّا حَوَيْتُ عَلَيْهِ فِيمَا أُرَى ثُمَّ أَتَيْتُ الشَّامَ فَغَرْبَلْتُهَا كُلُّ ذَلِكَ أَسْأَلُ عَنْ النَّفَلِ فَلَمْ أَجِدْ أَحَدًا يُخْبِرُنِي فِيهِ بِشَيْءٍ حَتَّى لَقِيتُ شَيْخًا يُقَالُ لَهُ زِيَادُ بْنُ جَارِيَةَ التَّمِيمِيُّ فَقُلْتُ لَهُ هَلْ سَمِعْتَ فِي النَّفَلِ شَيْئًا قَالَ نَعَمْ سَمِعْتُ حَبِيبَ بْنَ مَسْلَمَةَ الْفِهْرِيَّ يَقُولُ شَهِدْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَفَّلَ الرُّبُعَ فِي الْبَدْأَةِ وَالثُّلُثَ فِي الرَّجْعَةِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Ahmad bin Basyir bin Dzakwan], serta [Mahmud bin Khalid Ad Dimasyqi] secara makna, mereka berkata; telah menceritakan kepada kami [Marwan bin Muhammad], ia berkata; telah menceritakan kepada kami [Yahya bin Hamzah], ia berkata; saya mendengar [Abu Wahb] berkata; saya telah mendegar [Makhul] berkata; dahulu aku adalah seorang budak di Mesir milik seorang wanita dari Bani Hudzail, kemudian ia membebaskanku. Tidaklah aku keluar dari Mesir dan padanya terdapat ilmu kecuali aku telah menguasainya sepengetahuanku, kemudian aku datang ke Hijaz, tidaklah aku keluar darinya dan padanya terdapat ilmu melainkan aku telah menguasainya sepengetahuanku. Kemudian aku datang ke Irak, tidaklah aku keluar darinya dan padanya terdapat ilmu melainkan aku telah menguasainya sepengetahuanku. Kemudian aku datang ke Syam lalu aku mengetahui kondisi orang-orang yang ada di sana, setiap itu semua aku bertanya mengenai nafal (tambahan yang diberikan seorang pemimpin) dan aku tidak menjumpai seseorang yang memberitahukan mengenainya hingga aku bertemu dengan seorang syekh yang bernama [Ziyad bin Jariyah At Taimi]. Kemudian aku tanyakan kepadanya; apakah engkau pernah mendengar sesuatu mengenai nafal? Ia berkata; ya. Aku pernah mendengar [Habib bin Maslamah Al Fihri] berkata; aku menyaksikan Nabi shallallahu 'alaihi wasallam memberikan tambahan seperempat ketika pergi dan sepertiga ketika kembali. "
            },
            {
                "number": 2306,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ ابْنِ إِسْحَقَ هُوَ مُحَمَّدٌ بِبَعْضِ هَذَا ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ حَدَّثَنِي هُشَيْمٌ عَنْ يَحْيَى بْنِ سَعِيدٍ جَمِيعًا عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُسْلِمُونَ تَتَكَافَأُ دِمَاؤُهُمْ يَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ وَيُجِيرُ عَلَيْهِمْ أَقْصَاهُمْ وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ يَرُدُّ مُشِدُّهُمْ عَلَى مُضْعِفِهِمْ وَمُتَسَرِّيهِمْ عَلَى قَاعِدِهِمْ لَا يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلَا ذُو عَهْدٍ فِي عَهْدِهِوَلَمْ يَذْكُرْ ابْنُ إِسْحَقَ الْقَوَدَ وَالتَّكَافُؤَ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id], telah menceritakan kepada kami [Ibnu Abu Adi] dari [Ibnu Ishaq Muhammad], dengan sebagian hadits ini. Dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami ['ubaidhullah bin Umar bin Maisarah], telah menceritakan kepadaku [Husyam] dari [Yahya bin Sa'id] seluruhnya berasal dari ['Amr bin Syu'aib] dari [ayahnya], dari [kakeknya], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang-orang muslim darah mereka sederajat, orang yang paling rendah diantara mereka berjalan dengan jaminan keamanan dari mereka, orang terjauh mereka memberikan perlindungan kepada mereka dan mereka adalah satu tangan atas orang selain mereka, orang kuat mereka membantu orang lemah mereka, dan orang yang berperang atas orang yang tidak berperang. Orang yang mukmin tidak dibunuh dibunuh lantaran orang kafir, dan tidak pula dibunuh orang yang memiliki perjanjian selama dalam perjanjiannya.\" Sedangkan Ibnu Ishaq tidak menyebutkan balasan dan persamaan. "
            },
            {
                "number": 2307,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا عِكْرِمَةُ حَدَّثَنِي إِيَاسُ بْنُ سَلَمَةَ عَنْ أَبِيهِ قَالَأَغَارَ عَبْدُ الرَّحْمَنِ بْنُ عُيَيْنَةَ عَلَى إِبِلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَتَلَ رَاعِيَهَا فَخَرَجَ يَطْرُدُهَا هُوَ وَأُنَاسٌ مَعَهُ فِي خَيْلٍ فَجَعَلْتُ وَجْهِي قِبَلَ الْمَدِينَةِ ثُمَّ نَادَيْتُ ثَلَاثَ مَرَّاتٍ يَا صَبَاحَاهُ ثُمَّ اتَّبَعْتُ الْقَوْمَ فَجَعَلْتُ أَرْمِي وَأَعْقِرُهُمْ فَإِذَا رَجَعَ إِلَيَّ فَارِسٌ جَلَسْتُ فِي أَصْلِ شَجَرَةٍ حَتَّى مَا خَلَقَ اللَّهُ شَيْئًا مِنْ ظَهْرِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا جَعَلْتُهُ وَرَاءَ ظَهْرِي وَحَتَّى أَلْقَوْا أَكْثَرَ مِنْ ثَلَاثِينَ رُمْحًا وَثَلَاثِينَ بُرْدَةً يَسْتَخِفُّونَ مِنْهَا ثُمَّ أَتَاهُمْ عُيَيْنَةُ مَدَدًا فَقَالَ لِيَقُمْ إِلَيْهِ نَفَرٌ مِنْكُمْ فَقَامَ إِلَيَّ أَرْبَعَةٌ مِنْهُمْ فَصَعِدُوا الْجَبَلَ فَلَمَّا أَسْمَعْتُهُمْ قُلْتُ أَتَعْرِفُونِي قَالُوا وَمَنْ أَنْتَ قُلْتُ أَنَا ابْنُ الْأَكْوَعِ وَالَّذِي كَرَّمَ وَجْهَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَطْلُبُنِي رَجُلٌ مِنْكُمْ فَيُدْرِكُنِي وَلَا أَطْلُبُهُ فَيَفُوتُنِي فَمَا بَرِحْتُ حَتَّى نَظَرْتُ إِلَى فَوَارِسِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَخَلَّلُونَ الشَّجَرَ أَوَّلُهُمْ الْأَخْرَمُ الْأَسَدِيُّ فَيَلْحَقُ بِعَبْدِ الرَّحْمَنِ بْنِ عُيَيْنَةَ وَيَعْطِفُ عَلَيْهِ عَبْدُ الرَّحْمَنِ فَاخْتَلَفَا طَعْنَتَيْنِ فَعَقَرَ الْأَخْرَمُ عَبْدَ الرَّحْمَنِ وَطَعَنَهُ عَبْدُ الرَّحْمَنِ فَقَتَلَهُ فَتَحَوَّلَ عَبْدُ الرَّحْمَنِ عَلَى فَرَسِ الْأَخْرَمِ فَيَلْحَقُ أَبُو قَتَادَةَ بِعَبْدِ الرَّحْمَنِ فَاخْتَلَفَا طَعْنَتَيْنِ فَعَقَرَ بِأَبِي قَتَادَةَ وَقَتَلَهُ أَبُو قَتَادَةَ فَتَحَوَّلَ أَبُو قَتَادَةَ عَلَى فَرَسِ الْأَخْرَمِ ثُمَّ جِئْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمَاءِ الَّذِي جَلَّيْتُهُمْ عَنْهُ ذُو قَرَدٍ فَإِذَا نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي خَمْسِ مِائَةٍ فَأَعْطَانِي سَهْمَ الْفَارِسِ وَالرَّاجِلِ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah], telah menceritakan kepada kami [Hasyim bin Al Qasim], telah menceritakan kepada kami [Ikrimah], telah menceritakan kepadaku [Iyas bin Salamah] dari [ayahnya], ia berkata; Abdurrahman bin 'Uyainah telah menyerang unta Rasulullah shallallahu 'alaihi wasallam dan membunuh penggembalanya, lalu ia dan para sahabatnya menggiring unta tersebut dengan menunggang kuda. Kemudian aku arahkan wajahku menghadap ke Madinah, kemudian aku menyeru tiga kali; peringatan…! Kemudian aku mengikuti orang-orang tersebut lalu aku memanah dan membunuh tunggangan mereka. Kemudian tiba-tiba terdapat seorang penunggang kuda yang kembali ke arahku. Aku duduk bersembunyi di panggal pohon, kemudian Allah tidaklah Allah memberikan tunggangan kepada Nabi shallallahu 'alaihi wasallam melainkan aku jadikan berada di belakang punggungku. Hingga mereka melemparkan lebih dari tiga puluh tombak dan tiga puluh pakaiaan untuk memperingan darinya. Kemudian 'Uyainah memberikan bala bantuan kepada mereka. Lalu ia berkata; hendaknya ada beberapa orang diantara kalian yang bangkit menuju kepadanya! Kemudian terdapat empar orang diantara mereka yang datang kepadaku dan menaiki gunung. Kemudian tatkala mereka mendengarku aku katakan; apakah kalian mengenalku? Mereka berkata; siapa engkau? Aku katakan; aku adalah Ibnu Al Akwa'. Demi Dzat yang telah memuliakan wajah Muhammad shallallahu 'alaihi wasallam, tidak ada seorangpun dari kalian yang mencariku kemudian mampu mendapatkanku. Dan tidaklah aku mencarinya dan ia luput dariku. Dan tidak lama kemudian aku melihat para penunggang kuda Rasulullah shallallahu 'alaihi wasallam yang menyelinap diantara pepohonan. Orang pertama mereka adalah Al Akhram Al Asadi, kemudian ia mengejar Abdurrahman bin 'Uyainah, kemudian Abdurrahman berbalik kepadanya, dan tusukan mereka bergantian dua tusukan. Lalu Al Akhram membunuh tunggangannya dan Abdurrahman menusuknya hingga ia mampu membunuhnya. Kemudian Abdurrahman berpindah kepada kuda Al Akhram. Lalu Abu Qatadah mengejar Abdurrahman kemudian mereka saling bergantian dua tusukan. Abdurrahman membunuh tunggangan Abu Qatadah dan Abu Qatadah membunuhnya. Kemudian Abu Qatadah berpindah ke kuda Al Akhram. Kemudian aku datang kepada Rasulullah shallallahu 'alaihi wasallam sementara beliau berada di tepi air yang aku jauhkan mereka darinya, yaitu Dzu Qarad. Ternyata Rasulullah shallallahu 'alaihi wasallam berada diantara lima ratus unta, kemudian beliau memberiku saham penunggang kuda dan pejalan kaki. "
            },
            {
                "number": 2308,
                "arab": "حَدَّثَنَا أَبُو صَالِحٍ مَحْبُوبُ بْنُ مُوسَى أَخْبَرَنَا أَبُو إِسْحَقَ الْفَزَارِيُّ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِي الْجُوَيْرِيَةِ الْجَرْمِيِّ قَالَأَصَبْتُ بِأَرْضِ الرُّومِ جَرَّةً حَمْرَاءَ فِيهَا دَنَانِيرُ فِي إِمْرَةِ مُعَاوِيَةَ وَعَلَيْنَا رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ بَنِي سُلَيْمٍ يُقَالُ لَهُ مَعْنُ بْنُ يَزِيدَ فَأَتَيْتُهُ بِهَا فَقَسَمَهَا بَيْنَ الْمُسْلِمِينَ وَأَعْطَانِي مِنْهَا مِثْلَ مَا أَعْطَى رَجُلًا مِنْهُمْ ثُمَّ قَالَ لَوْلَا أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا نَفْلَ إِلَّا بَعْدَ الْخُمُسِ لَأَعْطَيْتُكَ ثُمَّ أَخَذَ يَعْرِضُ عَلَيَّ مِنْ نَصِيبِهِ فَأَبَيْتُحَدَّثَنَا هَنَّادٌ عَنْ ابْنِ الْمُبَارَكِ عَنْ أَبِي عَوَانَةَ عَنْ عَاصِمِ بْنِ كُلَيْبٍ بِإِسْنَادِهِ وَمَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Abu Shalih Mahbub bin Musa], telah mengabarkan kepada kami [Abu Ishaq Al Fazari], dari ['Ashim bin Kulaib] dari [Abu Al Juwairiyah Al Jarmi], ia berkata; aku di negeri Romawi aku mendapatkan kendi merah yang berisi uang dinar pada saat kepemimpinan Mu'awiyah. Dan kami dipimpin oleh seorang sahabat Nabi shallallahu 'alaihi wasallam dari Bani Sulaim yang dipanggil [Ma'n bin Yazid]. Lalu aku mendatanginya dengan membawa kendi tersebut, lalu ia membaginya diantara orang-orang muslim. Dan ia memberiku dari kendi tersebut seperti ia memberikan kepada salah seorang diantara mereka. Kemudian ia berkata; seandainya aku tidak mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada nafal kecuali setelah diambil seperlima niscaya aku memberimu.\" Kemudian beliau menawarkan kepadaku sebagian dari bagiannya. Lalu aku menolak. Telah menceritakan kepada kami [Hannad] dari [Ibnu Al Mubarak] dari [Abu 'Awanah] dari ['Ashim bin Kulaib] dengan sanadnya dan maknanya. "
            },
            {
                "number": 2309,
                "arab": "حَدَّثَنَا الْوَلِيدُ بْنُ عُتْبَةَ قَالَ حَدَّثَنَا الْوَلِيدُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلَاءِ أَنَّهُ سَمِعَ أَبَا سَلَّامٍ الْأَسْوَدَ قَالَ سَمِعْتُ عَمْرَو بْنَ عَبَسَةَ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى بَعِيرٍ مِنْ الْمَغْنَمِ فَلَمَّا سَلَّمَ أَخَذَ وَبَرَةً مِنْ جَنْبِ الْبَعِيرِ ثُمَّ قَالَ وَلَا يَحِلُّ لِي مِنْ غَنَائِمِكُمْ مِثْلُ هَذَا إِلَّا الْخُمُسُ وَالْخُمُسُ مَرْدُودٌ فِيكُمْ",
                "id": "Telah menceritakan kepada kami [Al Walid bin 'Utbah], ia berkata; telah menceritakan kepada kami [Al Walid], telah menceritakan kepada kami [Abdullah bin Al 'Ala`] bahwa ia mendengar [Abu Sallam Al Aswad], berkata; aku mendengar ['Amr bin 'Abasah], ia berkata; Rasulullah shallallahu 'alaihi wasallam melakukan sholat bersama kami menghadap ke unta yang merupakan sebagian dari rampasan perang, kemudian beliau mengucapkan salam dan mengambil satu helai rambut dari sisi unta tersebut, kemudian beliau berkata: \"Dan tidak halal bagiku dari rampasan perang kalian seperti ini kecuali seperlima dan seperlima dikembalikan kepada kalian. "
            },
            {
                "number": 2310,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْغَادِرَ يُنْصَبُ لَهُ لِوَاءٌ يَوْمَ الْقِيَامَةِ فَيُقَالُ هَذِهِ غَدْرَةُ فُلَانِ بْنِ فُلَانٍ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi], dari [Malik], dari [Abdullah bin Dinar] dari [Ibnu Umar], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang yang berkhianat akan dikibarkan baginya bendera pada Hari Kiamat dan dikatakan; ini adalah pengkhianatan Fulan bin Fulan.\""
            },
            {
                "number": 2311,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ الْبَزَّازُ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا الْإِمَامُ جُنَّةٌ يُقَاتَلُ بِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ash Shabbah Al Bazzaz], ia berkata; telah menceritakan kepada kami [Abdurrahman bin Abu Az Zinad], dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya seorang imam adalah tameng yang digunakan untuk berperang.\""
            },
            {
                "number": 2312,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي رَافِعٍ أَنَّ أَبَا رَافِعٍ أَخْبَرَهُ قَالَبَعَثَتْنِي قُرَيْشٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُلْقِيَ فِي قَلْبِي الْإِسْلَامُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي وَاللَّهِ لَا أَرْجِعُ إِلَيْهِمْ أَبَدًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَا أَخِيسُ بِالْعَهْدِ وَلَا أَحْبِسُ الْبُرُدَ وَلَكِنْ ارْجِعْ فَإِنْ كَانَ فِي نَفْسِكَ الَّذِي فِي نَفْسِكَ الْآنَ فَارْجِعْ قَالَ فَذَهَبْتُ ثُمَّ أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْلَمْتُقَالَ بُكَيْرٌ وَأَخْبَرَنِي أَنَّ أَبَا رَافِعٍ كَانَ قِبْطِيًّا قَالَ أَبُو دَاوُد هَذَا كَانَ فِي ذَلِكَ الزَّمَانِ فَأَمَّا الْيَوْمَ فَلَا يَصْلُحُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Abdullah bin Wahb], telah mengabarkan kepadaku ['Amr] dari [Bukair bin Al Asyajj] dari [Al Husan bin Ali bin Abu Rafi'], bahwasanya [Abu Rof'] telah mengabarkan kepadanya, ia berkata; orang-orang Quraisy telah mengutusku kepada Rasulullah shallallahu 'alaihi wasallam, kemudian tatkala aku melihat Rasulullah shallallahu 'alaihi wasallam maka terbetik dalam hatiku untuk masuk Islam. Lalu aku katakan; wahai Rasulullah, demi Allah, sesungguhnya aku tidak akan kembali kepada mereka selamanya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku tidak akan membatalkan perjanjianku, dan tidak akan menahan utusan. Akan tetapi kembalilah apabila dalam hatimu apa yang ada dalam hatimu sekarang ini maka kembalilah!\" Al Husain berkata; lalu aku kembali, kemudian aku mendatangi Nabi shallallahu 'alaihi wasallam dan masuk Islam. Bukair berkata; dan ia telah mengabarkan kepadaku bahwa Abu Rafi' adalah seorang Qibthi (orang asli Mesir). Abu Daud berkata; ini adalah pada zaman dulu, adapun sekarang maka tidak boleh. "
            },
            {
                "number": 2313,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي الْفَيْضِ عَنْ سُلَيْمِ بْنِ عَامِرٍ رَجُلٌ مِنْ حِمْيَرَ قَالَكَانَ بَيْنَ مُعَاوِيَةَ وَبَيْنَ الرُّومِ عَهْدٌ وَكَانَ يَسِيرُ نَحْوَ بِلَادِهِمْ حَتَّى إِذَا انْقَضَى الْعَهْدُ غَزَاهُمْ فَجَاءَ رَجُلٌ عَلَى فَرَسٍ أَوْ بِرْذَوْنٍ وَهُوَ يَقُولُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ وَفَاءٌ لَا غَدَرَ فَنَظَرُوا فَإِذَا عَمْرُو بْنُ عَبَسَةَ فَأَرْسَلَ إِلَيْهِ مُعَاوِيَةُ فَسَأَلَهُ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ كَانَ بَيْنَهُ وَبَيْنَ قَوْمٍ عَهْدٌ فَلَا يَشُدُّ عُقْدَةً وَلَا يَحُلُّهَا حَتَّى يَنْقَضِيَ أَمَدُهَا أَوْ يَنْبِذَ إِلَيْهِمْ عَلَى سَوَاءٍ فَرَجَعَ مُعَاوِيَةُ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar An Namiri], ia berkata; telah menceritakan kepada kami [Syu'bah] dari [Abu Al Faidh] dari [Sulaim bin 'Amir] seorang laki-laki dari Himyar, ia berkata; dahulu antara Mu'awiyah dan Romawi terdapat perjanjian. Ia berjalan ke arah negeri mereka, kemudian setelah habis masa perjanjian ia memerangi orang-orang Romawi tersebut. Kemudian terdapat seorang laki-laki yang datang dengan menaiki kuda, ia berkata; Allahu akbar, Allahu akbar. Pemenuhan janji bukan pengkhianatan. Kemudian orang-orang melihat kepadanya dan ternyata ia adalah ['Amr bin 'Abasah], kemudian Mu'awiyah mengirimkan utusan kepadanya dan bertanya kepadanya. Kemudian ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa antara dirinya dan suatu kaum terdapat suatu perjanjian, maka janganlah ia mengencangkan ikatan dan janganlah ia melepasnya hingga habis waktunya atau ia mengembalikan perjanjian itu kepada mereka dengan cara yang jujur.\" Kemudian Mu'awiyah kembali. "
            },
            {
                "number": 2314,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ عُيَيْنَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي بَكْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَتَلَ مُعَاهِدًا فِي غَيْرِ كُنْهِهِ حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Waki'] dari ['Uyainah bin Abdurrahman] dari [ayahnya] dari [Abu Bakrah], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang membunuh kafir mu'ahad (yang memiliki perjanjian dengan Islam) tidak pada waktunya, maka Allah mengharamkan baginya Surga.\""
            },
            {
                "number": 2315,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو الرَّازِيُّ حَدَّثَنَا سَلَمَةُ يَعْنِي ابْنَ الْفَضْلِ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ قَالَ كَانَ مُسَيْلِمَةُ كَتَبَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَقَدْ حَدَّثَنِي مُحَمَّدُ بْنُ إِسْحَقَ عَنْ شَيْخٍ مِنْ أَشْجَعَ يُقَالُ لَهُ سَعْدُ بْنُ طَارِقٍ عَنْ سَلَمَةَ بْنِ نُعَيْمِ بْنِ مَسْعُودٍ الْأَشْجَعِيِّ عَنْ أَبِيهِ نُعَيْمٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَهُمَا حِينَ قَرَأَ كِتَابَ مُسَيْلِمَةَ مَا تَقُولَانِ أَنْتُمَا قَالَا نَقُولُ كَمَا قَالَ قَالَ أَمَا وَاللَّهِ لَوْلَا أَنَّ الرُّسُلَ لَا تُقْتَلُ لَضَرَبْتُ أَعْنَاقَكُمَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Amr Ar Razi], telah menceritakan kepada kami [Salamah bin Al Fadhl] dari [Muhammad bin Ishaq], ia berkata; dahulu Maslamah pernah menulis surat kepada Rasulullah shallallahu 'alaihi wasallam, ia berkata; telah menceritakan kepadaku Muhammad bin Ishaq dari seorang syekh dari Asyja' yang dipanggil [Sa'd bin Thariq], dari [Salamah bin Nu'aim bin Mas'ud Al Asyja'i] dari [ayahnya yaitu Nu'aim], ia berkata; saya mendengar Rasulullah shallallahu 'alaihi wasallam berkata kepada mereka berdua ketika beliau membaca surat Musailamah: \"Bagaimana pendapat kalian berdua?\" Mereka berdua berkata; kami mengatakan seperti yang ia katakan. Beliau berkata: \"Demi Allah, seandainya utusan boleh dibunuh niscaya aku akan memenggal leher kalian berdua.\""
            },
            {
                "number": 2316,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ حَارِثَةَ بْنِ مُضَرِّبٍأَنَّهُ أَتَى عَبْدَ اللَّهِ فَقَالَ مَا بَيْنِي وَبَيْنَ أَحَدٍ مِنْ الْعَرَبِ حِنَةٌ وَإِنِّي مَرَرْتُ بِمَسْجِدٍ لِبَنِي حَنِيفَةَ فَإِذَا هُمْ يُؤْمِنُونَ بِمُسَيْلِمَةَ فَأَرْسَلَ إِلَيْهِمْ عَبْدَ اللَّهِ فَجِيءَ بِهِمْ فَاسْتَتَابَهُمْ غَيْرَ ابْنِ النَّوَّاحَةِ قَالَ لَهُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَوْلَا أَنَّكَ رَسُولٌ لَضَرَبْتُ عُنُقَكَ فَأَنْتَ الْيَوْمَ لَسْتَ بِرَسُولٍ فَأَمَرَ قَرَظَةَ بْنَ كَعْبٍ فَضَرَبَ عُنُقَهُ فِي السُّوقِ ثُمَّ قَالَ مَنْ أَرَادَ أَنْ يَنْظُرَ إِلَى ابْنِ النَّوَّاحَةِ قَتِيلًا بِالسُّوقِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir], telah mengabarkan kepada kami [Sufyan] dari [Abu Ishaq] dari [Haritsah bin Mudharrib], bahwa ia datang kepada [Abdullah] dan berkata; tidak ada antara diriku dengan salah seorang Arab permusuhan, dan aku pernah melewati masjid Bani Hanifah, ternyata mereka adalah orang-orang yang beriman kepada Musailamah. Kemudian Abdullah mengutus utusan kepada mereka, kemudian mereka dihadapkan kepadanya. Lalu ia meminta mereka untuk bertaubat selain Ibnu An Nawwahah. Abdullah berkata kepadanya; saya mendengar Rasulullah shallallahu 'alaihi wasallam berkata: \"Seandainya engkau bukanlah seorang utusan niscaya aku memenggal lehermu.\" Pada saat ini engkau bukanlah seorang utusan. Kemudian ia memerintahkan Qarazhah bin Ka'bin untuk memenggalnya, lalu ia memenggal lehernya di pasar. Kemudian ia berkata; siapa yang ingin melihat Ibnu An Nawwahah terbunuh di pasar? "
            },
            {
                "number": 2317,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي عِيَاضُ بْنُ عَبْدِ اللَّهِ عَنْ مَخْرَمَةَ بْنِ سُلَيْمَانَ عَنْ كُرَيْبٍ عَنْ ابْنِ عَبَّاسٍ قَالَ حَدَّثَتْنِي أُمُّ هَانِئٍ بِنْتُ أَبِي طَالِبٍأَنَّهَا أَجَارَتْ رَجُلًا مِنْ الْمُشْرِكِينَ يَوْمَ الْفَتْحِ فَأَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَتْ ذَلِكَ لَهُ فَقَالَ قَدْ أَجَرْنَا مَنْ أَجَرْتِ وَأَمَّنَّا مَنْ أَمَّنْتِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Ibnu Wahb], ia berkata; telah mengabarkan kepadaku ['Iyadh bin Abdullah] dari [Makhramah bin Sulaiman], dari [Kuraib] dari [Ibnu Abbas], ia berkata; telah menceritakan kepadaku [Ummu Hani` binti Abu Thalib] bahwa ia telah melindungi seorang laki-laki musyrik pada saat penaklukan Mekkah. Kemudian ia datang kepada Nabi shallallahu 'alaihi wasallam dan menceritakan hal tersebut kepadanya. Kemudian beliau berkata: \"Kami telah melindungi orang yang engkau lindungi, dan kami memberi keamanan orang yang telah engkau beri keamanan.\""
            },
            {
                "number": 2318,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْإِنْ كَانَتْ الْمَرْأَةُ لَتُجِيرُ عَلَى الْمُؤْمِنِينَ فَيَجُوزُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Sufyan bin 'Uyainah], dari [Manshur] dari [Ibrahim] dari [Al Aswad] dari [Aisyah], ia berkata; apabila seorang wanita melindungi orang-orang mukmin, maka hal tersebut adalah boleh. "
            },
            {
                "number": 2319,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ أَنَّ مُحَمَّدَ بْنَ ثَوْرٍ حَدَّثَهُمْ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ الْمِسْوَرِ بْنِ مَخْرَمَةَ قَالَخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَمَنَ الْحُدَيْبِيَةِ فِي بِضْعَ عَشْرَةَ مِائَةً مِنْ أَصْحَابِهِ حَتَّى إِذَا كَانُوا بِذِي الْحُلَيْفَةِ قَلَّدَ الْهَدْيَ وَأَشْعَرَهُ وَأَحْرَمَ بِالْعُمْرَةِ وَسَاقَ الْحَدِيثَ قَالَ وَسَارَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى إِذَا كَانَ بِالثَّنِيَّةِ الَّتِي يَهْبِطُ عَلَيْهِمْ مِنْهَا بَرَكَتْ بِهِ رَاحِلَتُهُ فَقَالَ النَّاسُ حَلْ حَلْ خَلَأَتْ الْقَصْوَاءُ مَرَّتَيْنِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا خَلَأَتْ وَمَا ذَلِكَ لَهَا بِخُلُقٍ وَلَكِنْ حَبَسَهَا حَابِسُ الْفِيلِ ثُمَّ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَا يَسْأَلُونِي الْيَوْمَ خُطَّةً يُعَظِّمُونَ بِهَا حُرُمَاتِ اللَّهِ إِلَّا أَعْطَيْتُهُمْ إِيَّاهَا ثُمَّ زَجَرَهَا فَوَثَبَتْ فَعَدَلَ عَنْهُمْ حَتَّى نَزَلَ بِأَقْصَى الْحُدَيْبِيَةِ عَلَى ثَمَدٍ قَلِيلِ الْمَاءِ فَجَاءَهُ بُدَيْلُ بْنُ وَرْقَاءَ الْخُزَاعِيُّ ثُمَّ أَتَاهُ يَعْنِي عُرْوَةَ بْنَ مَسْعُودٍ فَجَعَلَ يُكَلِّمُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكُلَّمَا كَلَّمَهُ أَخَذَ بِلِحْيَتِهِ والْمُغِيَرةُ بْنُ شُعْبَةَ قَائِمٌ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ السَّيْفُ وَعَلَيْهِ الْمِغْفَرُ فَضَرَبَ يَدَهُ بِنَعْلِ السَّيْفِ وَقَالَ أَخِّرْ يَدَكَ عَنْ لِحْيَتِهِ فَرَفَعَ عُرْوَةُ رَأْسَهُ فَقَالَ مَنْ هَذَا قَالُوا الْمُغِيرَةُ بْنُ شُعْبَةَ فَقَالَ أَيْ غُدَرُ أَوَلَسْتُ أَسْعَى فِي غَدْرَتِكَ وَكَانَ الْمُغِيرَةُ صَحِبَ قَوْمًا فِي الْجَاهِلِيَّةِ فَقَتَلَهُمْ وَأَخَذَ أَمْوَالَهُمْ ثُمَّ جَاءَ فَأَسْلَمَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا الْإِسْلَامُ فَقَدْ قَبِلْنَا وَأَمَّا الْمَالُ فَإِنَّهُ مَالُ غَدْرٍ لَا حَاجَةَ لَنَا فِيهِ فَذَكَرَ الْحَدِيثَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اكْتُبْ هَذَا مَا قَاضَى عَلَيْهِ مُحَمَّدٌ رَسُولُ اللَّهِ وَقَصَّ الْخَبَرَ فَقَالَ سُهَيْلٌ وَعَلَى أَنَّهُ لَا يَأْتِيكَ مِنَّا رَجُلٌ وَإِنْ كَانَ عَلَى دِينِكَ إِلَّا رَدَدْتَهُ إِلَيْنَا فَلَمَّا فَرَغَ مِنْ قَضِيَّةِ الْكِتَابِ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَصْحَابِهِ قُومُوا فَانْحَرُوا ثُمَّ احْلِقُوا ثُمَّ جَاءَ نِسْوَةٌ مُؤْمِنَاتٌ مُهَاجِرَاتٌ الْآيَةَ فَنَهَاهُمْ اللَّهُ أَنْ يَرُدُّوهُنَّ وَأَمَرَهُمْ أَنْ يَرُدُّوا الصَّدَاقَ ثُمَّ رَجَعَ إِلَى الْمَدِينَةِ فَجَاءَهُ أَبُو بَصِيرٍ رَجُلٌ مِنْ قُرَيْشٍ يَعْنِي فَأَرْسَلُوا فِي طَلَبِهِ فَدَفَعَهُ إِلَى الرَّجُلَيْنِ فَخَرَجَا بِهِ حَتَّى إِذْ بَلَغَا ذَا الْحُلَيْفَةِ نَزَلُوا يَأْكُلُونَ مِنْ تَمْرٍ لَهُمْ فَقَالَ أَبُو بَصِيرٍ لِأَحَدِ الرَّجُلَيْنِ وَاللَّهِ إِنِّي لَأَرَى سَيْفَكَ هَذَا يَا فُلَانُ جَيِّدًا فَاسْتَلَّهُ الْآخَرُ فَقَالَ أَجَلْ قَدْ جَرَّبْتُ بِهِ فَقَالَ أَبُو بَصِيرٍ أَرِنِي أَنْظُرْ إِلَيْهِ فَأَمْكَنَهُ مِنْهُ فَضَرَبَهُ حَتَّى بَرَدَ وَفَرَّ الْآخَرُ حَتَّى أَتَى الْمَدِينَةَ فَدَخَلَ الْمَسجِدَ يَعْدُو فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ رَأَى هَذَا ذُعْرًا فَقَالَ قَدْ قُتِلَ وَاللَّهِ صَاحِبِي وَإِنِّي لَمَقْتُولٌ فَجَاءَ أَبُو بَصِيرٍ فَقَالَ قَدْ أَوْفَى اللَّهُ ذِمَّتَكَ فَقَدْ رَدَدْتَنِي إِلَيْهِمْ ثُمَّ نَجَّانِي اللَّهُ مِنْهُمْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيْلَ أُمِّهِ مِسْعَرَ حَرْبٍ لَوْ كَانَ لَهُ أَحَدٌ فَلَمَّا سَمِعَ ذَلِكَ عَرَفَ أَنَّهُ سَيَرُدُّهُ إِلَيْهِمْ فَخَرَجَ حَتَّى أَتَى سَيْفَ الْبَحْرِ وَيَنْفَلِتُ أَبُو جَنْدَلٍ فَلَحِقَ بِأَبِي بَصِيرٍ حَتَّى اجْتَمَعَتْ مِنْهُمْ عِصَابَةٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid] bahwa [Muhammad bin Tsaur] telah menceritakan kepada mereka, dari [Ma'mar] dari [Az Zuhri] dari ['Urwah bin Az Zubair] dari [Al Miswar bin Makhramah], ia berkata; Nabi shallallahu 'alaihi wasallam pernah keluar pada waktu terjadinya perdamaian Hudaibiyah bersama seratus tiga belas sahabatnya hingga ketika sampai di Dzul Hulaifah, beliau mengalungi hewan kurban dan memberinya tanda serta berihram untuk melakukan umrah. Al Miswar menyebutkan hadits tersebut, dan ia berkata; dan Nabi shallallahu 'alaihi wasallam berjalan hingga setelah berada di Ats Tsaniyyah yang darinya beliau turun kepada mereka, unta beliau menderum. Kemudian orang-orang berkata; hus, hus.. Al Qaswa` berhernti dua kali. Kemudian Nabi shallallahu 'alaihi wasallam berkata: \"Demi Dzat yang jiwaku ada di tanganNya, Al Qashwaa` tidak berhenti dan hal itu bukanlah tabi'atnya, akan tetapi ia tertahan oleh sesuatu yang menahan gajah (yang hendak menghancurkan Ka'bah).\" Kemudian beliau berkata: \"Demi Dzat yang jiwaku ada di tangannya, tidaklah pada hari ini mereka meminta sebuah kondisi yang dengannya mereka mengagungkan bulan-bulan haram (dengan tidak melakukan peperangan) melainkan aku akan memberikannya kepada mereka.\" Kemudian beliu menggertak untanya hingga berdiri, lalu beliau pergi dari mereka hingga beliau singgah di bagian Hudaibiyyah yang paling jauh, berada di atas lubang yang memilliki sedikit air. Kemudian Budail bin Warqa` Al Khuza'i datang kepada beliau kemudian 'Urwah bin Mas'ud datang kepadanya, dan berbicara dengan Nabi shallallahu 'alaihi wasallam, setiap kali ia berbicara dengan beliau ia memegang jenggot beliau. Sementara Al Mughirah bin Syu'bah berdiri di samping Nabi shallallahu 'alaihi wasallam dengan memegang pedang, dan memakai penutup kepala. Kemudian ia memukulkan tangannya pada gagang pedang, dan ia berkata; jauhkan tanganmu dari jenggot beliau! Kemudian 'Urwah mengangkat kepalanya dan berkata; siapakah ini? Mereka berkata; Al Mughirah bin Syu'bah. Kemudian ia berkata; wahai orang yang suka mengingkari janji, bukankah aku telah berusaha menolak keburukan sifat ingkar janjimu? Dahulu Al Mughirah pernah menyertai beberapa orang (dari Tsaqif) pada masa jahiliyah kemudan ia membunuh mereka dan mengambil harta mereka. Kemudian ia datang dan masuk Islam. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Adapun (jika) masuk Islam, maka kami menerima, sedangkan harta tersebut adalah harta hasil dari pengkhianatan, kami tidak butuh kepadanya.\" kemudian ia menyebutkan hadits tersebut. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Tulislah, ini adalah yang diputuskan Muhammad Rasulullah.\" Kemudian ia menyebutkan kisah tersebut. Kemudian Suhail berkata; dan dengan syarat bahwa tidak ada seorangpun diantara kami yang datang kepadamu walaupun ia berada di atas agamu melainkan engkau kembalikan kepada kami. Kemudian tatkala telah selesai dari urusan tulisan tersebut Nabi shallallahu 'alaihi wasallam bersabda kepada para sahabatnya: \"Bangkitlah, lalu sembelihlah kurban kemudian bercukurlah!\" kemudian para wanita mukmi yang berhijrah datang, sebagaimana yang terdapat dalam ayat. Kemudian Allah melarang mereka untuk mengembalikan para wanita tersebut dan memerintahkan agar mereka mengembalikan mahar (kepada mantan suami mereka). Kemudian beliau kembali ke Madinah, kemudian beliau di datangi seorang laki-laki Quraisy. Lalu orang-orang Quraisy mengirimkan utusan untuk mencarinya, kemudian beliau menyerahkannya kepada dua orang. Kemudian kedua orang tersebut keluar dengan membawanya, hingga tatkala mereka sampai di Dzul Hulaifah, mereka singgah dan makan sebagian kurma mereka. Lalu Abu Bashir berkata kepada salah seorang dari mereka; demi Allah, sungguh aku melihat pedangmu ini bagus wahai Fulan. Kemudian orang yang lain menghunusnya dan berkata; benar. Sungguh aku telah mencobanya. Lalu Abu Bashir bekata; perlihatkan kepadaku! aku akan melihatnya. Kemudian orang tersebut menyerahkan pedang tersebut kepadanya. lalu Abu Bashir menebasnya hingga mati, dan yang lain melarikan diri hingga datang ke Madinah, lalu ia memasuki masjid. Kemudian Nabi shallallahu 'alaihi wasallam berkata: \"Sungguh orang ini telah melihat rasa takut.\" Kemudian orang tersebut berkata; demi Allah, sahabatku telah terbunuh, dan aku akan dibunuh. Lalu Abu Bashir datang dan berkata; sungguh Allah telah memenuhi perlindunganmu, anda telah mengembalikanku kepada mereka kemudian Allah menyelamatkanku dari mereka. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Mengherankan, ia akan mengobarkan api peperangan apabila ia memiliki teman yang menolongnya.\" Kemudian tatkala Abu Bashir mendengar hal tersebut maka ia mengerti bahwa beliau akan mengembalikannya kepada mereka. Maka ia keluar hingga sampai di tepi laut, dan Abu Jundal hilang dan bergabung dengan Abu Bashir hingga terkumpul dari mereka sekelompok orang (berjumlah empat puluh atau lebih). "
            },
            {
                "number": 2320,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا ابْنُ إِدْرِيسَ قَالَ سَمِعْتُ ابْنَ إِسْحَقَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ الْمِسْوَرِ بْنِ مَخْرَمَةَ وَمَرْوَانَ بْنِ الْحَكَمِأَنَّهُمْ اصْطَلَحُوا عَلَى وَضْعِ الْحَرْبِ عَشْرَ سِنِينَ يَأْمَنُ فِيهِنَّ النَّاسُ وَعَلَى أَنَّ بَيْنَنَا عَيْبَةً مَكْفُوفَةً وَأَنَّهُ لَا إِسْلَالَ وَلَا إِغْلَالَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala`], telah menceritakan kepada kami [Ibnu Idris], ia berkata; saya mendengar [Ibnu Ishaq] dari [Az Zuhri], dari ['Urwah bin Az Zubair] dari [Al Miswar bin Makhramah], dan [Marwan bin Al Hakam] bahwa mereka berdamai untuk mengadakan gencatan senjata selama sepuluh tahun. Pada waktu tersebut orang-orang merasakan keamanan, dan mereka saling menahan peperangan, dan tidak ada pencurian dan tidak ada pengkhianatan. "
            },
            {
                "number": 2321,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ حَسَّانَ بْنِ عَطِيَّةَ قَالَ مَالَ مَكْحُولٌ وَابْنُ أَبِي زَكَرِيَّاءَ إِلَى خَالِدِ بْنِ مَعْدَانَ وَمِلْتُ مَعَهُمَا فَحَدَّثَنَا عَنْ جُبَيْرِ بْنِ نُفَيْرٍقَالَ قَالَ جُبَيْرٌ انْطَلِقْ بِنَا إِلَى ذِي مِخْبَرٍ رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَيْنَاهُ فَسَأَلَهُ جُبَيْرٌ عَنْ الْهُدْنَةِ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ سَتُصَالِحُونَ الرُّومَ صُلْحًا آمِنًا وَتَغْزُونَ أَنْتُمْ وَهُمْ عَدُوًّا مِنْ وَرَائِكُمْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili], telah menceritakan kepada kami [Isa bin Yunus], telah menceritakan kepada kami [Al Auza'i], dari [Hassan bin 'Athiyyah], ia berkata; Makhul dan Ibnu Zakariya` pergi kepada [Khalid bin Ma'dan] dan aku ikut bersama mereka berdua. Kemudian ia menceritakan kepada kami dari [Jubair bin Nufair], ia berkata; Jubair berkata; pergilah bersama kami ke [Dzu Mikhbar] seorang sahabat Nabi shallallahu 'alaihi wasallam, kemudian kami datang kepadanya. Kemudian Jubair bertanya kepadanya mengenai perjanjian damai. Kemudian ia berkata; aku telah mendengar Rasulullah shallallahu 'alaihi wasallam berkata: \"Kalian akan mengadakan perjanjian damai dengan orang-orang Romawi, dan kalian bersama mereka akan menyerang musuh di belakang kalian.\""
            },
            {
                "number": 2322,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ لِكَعْبِ بْنِ الْأَشْرَفِ فَإِنَّهُ قَدْ آذَى اللَّهَ وَرَسُولَهُ فَقَامَ مُحَمَّدُ بْنُ مَسْلَمَةَ فَقَالَ أَنَا يَا رَسُولَ اللَّهِ أَتُحِبُّ أَنْ أَقْتُلَهُ قَالَ نَعَمْ قَالَ فَأْذَنْ لِي أَنْ أَقُولَ شَيْئًا قَالَ نَعَمْ قُلْ فَأَتَاهُ فَقَالَ إِنَّ هَذَا الرَّجُلَ قَدْ سَأَلَنَا الصَّدَقَةَ وَقَدْ عَنَّانَا قَالَ وَأَيْضًا لَتَمَلُّنَّهُ قَالَ اتَّبَعْنَاهُ فَنَحْنُ نَكْرَهُ أَنْ نَدَعَهُ حَتَّى نَنْظُرَ إِلَى أَيِّ شَيْءٍ يَصِيرُ أَمْرُهُ وَقَدْ أَرَدْنَا أَنْ تُسْلِفَنَا وَسْقًا أَوْ وَسْقَيْنِ قَالَ كَعْبٌ أَيَّ شَيْءٍ تَرْهَنُونِي قَالَ وَمَا تُرِيدُ مِنَّا قَالَ نِسَاءَكُمْ قَالُوا سُبْحَانَ اللَّهِ أَنْتَ أَجْمَلُ الْعَرَبِ نَرْهَنُكَ نِسَاءَنَا فَيَكُونُ ذَلِكَ عَارًا عَلَيْنَا قَالَ فَتَرْهَنُونِي أَوْلَادَكُمْ قَالُوا سُبْحَانَ اللَّهِ يُسَبُّ ابْنُ أَحَدِنَا فَيُقَالُ رُهِنْتَ بِوَسْقٍ أَوْ وَسْقَيْنِ قَالُوا نَرْهَنُكَ اللَّأْمَةَ يُرِيدُ السِّلَاحَ قَالَ نَعَمْ فَلَمَّا أَتَاهُ نَادَاهُ فَخَرَجَ إِلَيْهِ وَهُوَ مُتَطَيِّبٌ يَنْضَحُ رَأْسُهُ فَلَمَّا أَنْ جَلَسَ إِلَيْهِ وَقَدْ كَانَ جَاءَ مَعَهُ بِنَفَرٍ ثَلَاثَةٍ أَوْ أَرْبَعَةٍ فَذَكَرُوا لَهُ قَالَ عِنْدِي فُلَانَةُ وَهِيَ أَعْطَرُ نِسَاءِ النَّاسِ قَالَ تَأْذَنُ لِي فَأَشُمَّ قَالَ نَعَمْ فَأَدْخَلَ يَدَهُ فِي رَأْسِهِ فَشَمَّهُ قَالَ أَعُودُ قَالَ نَعَمْ فَأَدْخَلَ يَدَهُ فِي رَأْسِهِ فَلَمَّا اسْتَمْكَنَ مِنْهُ قَالَ دُونَكُمْ فَضَرَبُوهُ حَتَّى قَتَلُوهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Sufyan] dari ['Amr bin Dinar] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapakah yang bersedia membunuh Ka'b bin Al Asyraf? Karena sesungguhnya ia telah mengganggu Allah dan RasulullahNya.\" Kemudian Muhammad bin Maslamah berdiri dan berkata; saya wahai Rasulullah. Apakah engkau ingin aku membunuhnya? Beliau berkata: \"Ya.\" Ia berkata; izinkan saya untuk mengatakan sesuatu! Beliau berkata: \"Ya.\" Kemudian ia datang kepada Ka'b dan berkata; sesungguhnya orang ini telah meminta sedekah kepada kami dan telah memberatkan kami. Ia berkata; dan juga niscaya engkau akan merasa bosan dengannya. Ia berkata; kami mengikutinya sementara kami tidak ingin meninggalkannya hingga kami melihat ke manakah urusannya akan berakhir. Sungguh kami ingin agar engkau memberi kami hutang satu wasaq atau dua wasaq. Ka'b berkata; apakah yang akan kalian gadaikan kepadaku? ia berkata; apa yang engkau inginkan dari kami? Ia berkata; para wanita kalian. Mereka berkata; subhanallah, engkau adalah orang Arab yang paling tampan, apakah kami akan menggadaikan para wanita kami kepadamu, hingga hal tersebut menjadi sebuah cela atas kami? Ia berkata; kalian gadaikan kepadaku anak-anak kalian. Mereka berkata; subhanallah, anak salah seorang dari kami akan dicela. Kemudian dikatakan; akan digadaikan kepadamu satu atau dua wasaq. Mereka berkata; kami akan menggadaikan senjata kepadamu. Ia bekata; ya. kemudian tatkala Muhammad bin Maslamah datang kepadanya, maka ia memanggilnya. Lalu ia keluar dengan memakai minyak wangi, kepalanya menebarkan bau wangi. Kemudian tatkala ia datang kepadanya sementara Muhammad bin Maslamah telah datang bersama tiga atau empat orang. Kemudian mereka menyebutkan hal tersebut kepadanya, ia berkata; aku memiliki Fulanah, ia adalah wanita yang paling wangi. Muhammad bin Maslamah berkata; apakah engkau menizinkanku untuk mencium? Ia berkata; ya. kemudian ia memasukkan tangannya ke kepalannya dan menciumnya. Ia berkata; apakah aku boleh mengulangi? Ia berkata; ya. kemudian ia memasukkan tangannya ke dalam kelapanya. Kemudian tatkala Muhammad bin Maslamah memungkinkan untuk membunuhnya ia berkata; tangkaplah dia! Kemudian mereka menebasnya hingga mereka membunuh Ka'b. "
            },
            {
                "number": 2323,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حُزَابَةَ حَدَّثَنَا إِسْحَقُ يَعْنِي ابْنَ مَنْصُورٍ حَدَّثَنَا أَسْبَاطٌ الْهَمْدَانِيُّ عَنْ السُّدِّيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْإِيمَانُ قَيَّدَ الْفَتْكَ لَا يَفْتِكُ مُؤْمِنٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Huzabah], telah menceritakan kepada kami [Ishaq bin Manshur?], telah menceritakan kepada kami [Asbath Al Hamdani], dari [As Suddi] dari [ayahnya], dari [Abu Hurairah], dari Nabi shallallahu 'alaihi wasallam, beliau berkata; keimanan menghalangi pembunuhan, seorang mukmin tidak boleh membunuh. "
            },
            {
                "number": 2324,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا قَفَلَ مِنْ غَزْوٍ أَوْ حَجٍّ أَوْ عُمْرَةٍ يُكَبِّرُ عَلَى كُلِّ شَرَفٍ مِنْ الْأَرْضِ ثَلَاثَ تَكْبِيرَاتٍ وَيَقُولُ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ آيِبُونَ تَائِبُونَ عَابِدُونَ سَاجِدُونَ لِرَبِّنَا حَامِدُونَ صَدَقَ اللَّهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi], dari [Malik] dari [Nafi'] dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam apabila kembali dari peperangan atau haji atau umrah beliau bertakbir di atas setiap dataran tinggi sebanyak tiga kali takir, beliau mengucapkan: LAA ILAAHA ILLALLAAHU WAHDAHU LAA SYARIIKALAH, LAHUL MULKU WA LAHUL HAMDU WA HUWA 'ALAA KULLI SYAI-IN QADIIR. AAYIBUUNA, TAAIBUUNA 'AABIDUUNA SAAJIDUUNA, LIRABBINAA HAAMIDUUN, SHADAQALLAHU WA'DAHU WA NASHARA 'ABDAHU WA HAZAMAL AHZAABA WAHDAH (Tidak ada tuhan yang berhak disembah kecuali Allah semata, tidak ada sekutu bagiNya, milikNya semua kerajaan dan bagiNya seluruh pujian, dan Dia Maha Mampu melakukan segala sesuatu AAYIBUUNA INSYAA ALLAAH, TAAIBUUNA 'AABIDUUNA LIRABBINAA HAAMIDUUN\" (Kami kembali insya Allah, kami bertaubat, ka0mi menyembah, dan kepada Tuhan kami, kami memuji, Allah menepati janji, menolong hambaNya, dan mengalahkan musuh yang berkelompok-kelompok..). "
            },
            {
                "number": 2325,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ الْمَرْوَزِيُّ حَدَّثَنِي عَلِيُّ بْنُ حُسَيْنٍ عَنْ أَبِيهِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ{ لَا يَسْتَأْذِنُكَ الَّذِينَ يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ }الْآيَةَ نَسَخَتْهَا الَّتِي فِي النُّورِ{ إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ آمَنُوا بِاللَّهِ وَرَسُولِهِ إِلَى قَوْلِهِ غَفُورٌ رَحِيمٌ }",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Tsabit Al Marwazi], telah menceritakan kepadaku [Ali bin Husain], dari [ayahnya], dari [Yazid An Nahwi], dari [Ikrimah], dari [Ibnu Abbas], ia berkata; \"Orang-orang yang beriman kepada Allah dan hari kemudian, tidak akan meminta izin……\" ayat tersebut digantikan oleh yang ada dalam Surat An Nur yang berbunyi: Sesungguhnya yang sebenar-benar orang mukmin ialah orang-orang yang beriman kepada Allah dan Rasul-Nya……hingga: \"Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.\""
            },
            {
                "number": 2326,
                "arab": "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا عِيسَى عَنْ إِسْمَعِيلَ عَنْ قَيْسٍ عَنْ جَرِيرٍ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا تُرِيحُنِي مِنْ ذِي الْخَلَصَةِ فَأَتَاهَا فَحَرَّقَهَا ثُمَّ بَعَثَ رَجُلًا مِنْ أَحْمَسَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُبَشِّرُهُ يُكْنَى أَبَا أَرْطَاةَ",
                "id": "Telah menceritakan kepada kami [Abu Taubah Ar Rabi' bin Nafi'], telah menceritakan kepada kami [Isa] dari [Isma'il] dari [Qais] dari [Jarir], ia berkata; Rasulullah shallallahu 'alaihi wasallam berkata kepadaku: \"Tidakkah engkau menenangkanku dari Dzul Khalashah?\" kemudian terdapat seseorang yang mendatanginya dan membakarnya. Kemudian mengirim seseorang dari Ahmas kepada Nabi shallallahu 'alaihi wasallam untuk memberikan kabar gembiran kepada beliau. Orang tersebut diberi kunyah Abu Arthah. "
            },
            {
                "number": 2327,
                "arab": "حَدَّثَنَا ابْنُ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ أَنَّ عَبْدَ اللَّهِ بْنَ كَعْبٍ قَالَ سَمِعْتُ كَعْبَ بْنَ مَالِكٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَدِمَ مِنْ سَفَرٍ بَدَأَ بِالْمَسْجِدِ فَرَكَعَ فِيهِ رَكْعَتَيْنِ ثُمَّ جَلَسَ لِلنَّاسِ وَقَصَّ ابْنُ السَّرْحِ الْحَدِيثَ قَالَ وَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُسْلِمِينَ عَنْ كَلَامِنَا أَيُّهَا الثَّلَاثَةُ حَتَّى إِذَا طَالَ عَلَيَّ تَسَوَّرْتُ جِدَارَ حَائِطِ أَبِي قَتَادَةَ وَهُوَ ابْنُ عَمِّي فَسَلَّمْتُ عَلَيْهِ فَوَاللَّهِ مَا رَدَّ عَلَيَّ السَّلَامَ ثُمَّ صَلَّيْتُ الصُّبْحَ صَبَاحَ خَمْسِينَ لَيْلَةً عَلَى ظَهْرِ بَيْتٍ مِنْ بُيُوتِنَا فَسَمِعْتُ صَارِخًا يَا كَعْبَ بْنَ مَالِكٍ أَبْشِرْ فَلَمَّا جَاءَنِي الَّذِي سَمِعْتُ صَوْتَهُ يُبَشِّرُنِي نَزَعْتُ لَهُ ثَوْبَيَّ فَكَسَوْتُهُمَا إِيَّاهُ فَانْطَلَقْتُ حَتَّى إِذَا دَخَلْتُ الْمَسْجِدَ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسٌ فَقَامَ إِلَيَّ طَلْحَةُ بْنُ عُبَيْدِ اللَّهِ يُهَرْوِلُ حَتَّى صَافَحَنِي وَهَنَّأَنِي",
                "id": "Telah menceritakan kepada kami [Ibnu As Sarh] telah mengabarkan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] ia berkata; telah mengabarkan kepadaku [Abdurrahman bin Abdullah bin Ka'b bin Malik], bahwa [Abdullah bin Ka'b] berkata; aku mendengar [Ka'b bin Malik] beliau berkata: Nabi shallallahu 'alaihi wasallam apabila datang dari safar beliau memulai dengan mendatangi masjid, kemudian melakukan sholat dua raka'at, dan duduk untuk memenuhi hajat orang-orang. Ibnu As Sarh berkata; dan Rasulullah shallallahu 'alaihi wasallam melarang orang-orang muslim untuk berbicara dengan kami bertiga. Hingga tatkala hal tersebut terasa lama bagiku, aku menaiki dinding kebun Abu Qatadah, ia adalah anak pamanku. Kemudian aku mengucapkan salam kepadanya. demi Allah, ia tidak membalas salamku. Kemudian aku melakukan sholat Subuh pada hari kelima puluh, di atas rumah diantara rumah-rumah kami. Kemudian aku mendengar seseorang berteriak; wahai Ka'b bin Malik, bergembiralah. Kemudian tatkala orang yang aku dengan suaranya untuk memberikan kabar gembiera telah datang kepadaku, maka aku lepaskan pakaianku dan aku berikan kepadanya. kemudian aku pergi hingga tatkala aku memasuki masjid, ternyata Rasulullah shallallahu 'alaihi wasallam sedang duduk. Kemudian Thalhah berdiri untuk menyambutku dengan berlari-lari kecil, hingga ia menyalami dan mengucapkan selamat kepadaku. "
            },
            {
                "number": 2328,
                "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ أَبِي بَكْرَةَ بَكَّارِ بْنِ عَبْدِ الْعَزِيزِ أَخْبَرَنِي أَبِي عَبْدُ الْعَزِيزِ عَنْ أَبِي بَكْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا جَاءَهُ أَمْرُ سُرُورٍ أَوْ بُشِّرَ بِهِ خَرَّ سَاجِدًا شَاكِرًا لِلَّهِ",
                "id": "Telah menceritakan kepada kami [Makhlad bin Khalid], telah menceritakan kepada kami [Abu 'Ashim] dari [Abu Bakrah Bakkar bin Abdul Aziz], telah mengabarkan kepadaku [Ayahku yaitu Abdul Aziz] dari [Abu Bakrah] dari Nabi shallallahu 'alaihi wasallam bahwa apabila terdapat perkara perkara yang menyenangkan atau beliau dibei kabar gembira maka beliau bersujud untuk bersyukur kepada Allah. "
            },
            {
                "number": 2329,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ حَدَّثَنِي مُوسَى بْنُ يَعْقُوبَ عَنْ ابْنِ عُثْمَانَ قَالَ أَبُو دَاوُد وَهُوَ يَحْيَى بْنُ الْحَسَنِ بْنِ عُثْمَانَ عَنْ الْأَشْعَثِ بْنِ إِسْحَقَ بْنِ سَعْدٍ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ أَبِيهِ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ مَكَّةَ نُرِيدُ الْمَدِينَةَ فَلَمَّا كُنَّا قَرِيبًا مِنْ عَزْوَرَا نَزَلَ ثُمَّ رَفَعَ يَدَيْهِ فَدَعَا اللَّهَ سَاعَةً ثُمَّ خَرَّ سَاجِدًا فَمَكَثَ طَوِيلًا ثُمَّ قَامَ فَرَفَعَ يَدَيْهِ فَدَعَا اللَّهَ سَاعَةً ثُمَّ خَرَّ سَاجِدًا فَمَكَثَ طَوِيلًا ثُمَّ قَامَ فَرَفَعَ يَدَيْهِ سَاعَةً ثُمَّ خَرَّ سَاجِدًا ذَكَرَهُ أَحْمَدُ ثَلَاثًا قَالَ إِنِّي سَأَلْتُ رَبِّي وَشَفَعْتُ لِأُمَّتِي فَأَعْطَانِي ثُلُثَ أُمَّتِي فَخَرَرْتُ سَاجِدًا شُكْرًا لِرَبِّي ثُمَّ رَفَعْتُ رَأْسِي فَسَأَلْتُ رَبِّي لِأُمَّتِي فَأَعْطَانِي ثُلُثَ أُمَّتِي فَخَرَرْتُ سَاجِدًا لِرَبِّي شُكْرًا ثُمَّ رَفَعْتُ رَأْسِي فَسَأَلْتُ رَبِّي لِأُمَّتِي فَأَعْطَانِي الثُّلُثَ الْآخِرَ فَخَرَرْتُ سَاجِدًا لِرَبِّيقَالَ أَبُو دَاوُد أَشْعَثُ بْنُ إِسْحَقَ أَسْقَطَهُ أَحْمَدُ بْنُ صَالِحٍ حِينَ حَدَّثَنَا بِهِ فَحَدَّثَنِي بِهِ عَنْهُ مُوسَى بْنُ سَهْلٍ الرَّمْلِيُّ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Ibnu Abu Fudaik], telah menceritakan kepadaku [Musa bin Ya'qub] dari [Ibnu Utsman]. Abu Daud berkata; ia adalah Yahya bin Al Hasan bin Utsman dari [Al Asy'ats bin Ishaq bin Sa'd] dari ['Amir bin Sa'd] dari [ayahnya], ia berkata; kami keluar besama Rasulullah shallallahu 'alaihi wasallam dari Mekkah henda menuju Madinah. Kemudian tatkala kami telah mendeati 'Azwara, beliau turun kemudian mengangkat kedua tangannyaa dan berdo'a kepada Allah sesaat, kemudian beliau bersujud. Beliau lama berada dalam keadaan demikian kemudian bangkit dan mengangkat kedua tangannya, dan berdo'a kepada Allah sesaat, kemudian beliau bersujud. Beliau lama berada dalam keadaan demikian kemudian bangkit dan mengangkat kedua tangannya, dan berdo'a kepada Allah sesaat, kemudian beliau bersujud. Ahmad menyebutkan hal tersebut sebanyak tiga kali. Beliau berkata: \"Aku memohon kepada Tuhanku dan memintakan syafa'at untuk umatku. Kemudian Allah memberiku sepertiga umatku, lalu aku bersujud sebagai rasa syukur kepada Tuhanku. Kemudian aku mengangkat kepalaku dan memohonkan untuk umatku. Kemudian Allah memberiku sepertiga umatku, lalu aku bersujud sebagai rasa syukur kepada Tuhanku. Kemudian aku mengangkat kepalaku dan memohonkan untuk umatku. Kemudian Allah memberiku sepertiga yang lainnya, lalu aku bersujud untuk Tuhanku.\" Abu Daud berkata; Asy'ats bin Ishaq telah digugurkan oleh Ahmad bin Shalih, ketika ia menceritakan hadits tersebut. Musa bin Sahl Ar Ramli menceritakan hadits tersebut darinya. "
            },
            {
                "number": 2330,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْرَهُ أَنْ يَأْتِيَ الرَّجُلُ أَهْلَهُ طُرُوقًا",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar], dan [Muslim bin Ibrahim], mereka berkata; telah menceritakan kepada kami [Syu'ba] dari [Muharib bin Ditsar], dari [Jabir bin Abdullah], ia berkata; Rasulullah shallallahu 'alaihi wasallam tidak menyukai seseorang mendatangi keluarganya pada malam hari. "
            },
            {
                "number": 2331,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ مُغِيرَةَ عَنْ الشَّعْبِيِّ عَنْ جَابِرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَحْسَنَ مَا دَخَلَ الرَّجُلُ عَلَى أَهْلِهِ إِذَا قَدِمَ مِنْ سَفَرٍ أَوَّلَ اللَّيْلِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Jarir] dari [Mughirah] dari [Asy Sya'bi] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya sebaik-baik waktu seseorang menemui keluarganya apabila ia datang dari sebuah safar adalah awal malam.\""
            },
            {
                "number": 2332,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا سَيَّارٌ عَنْ الشَّعْبِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَكُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَلَمَّا ذَهَبْنَا لِنَدْخُلَ قَالَ أَمْهِلُوا حَتَّى نَدْخُلَ لَيْلًا لِكَيْ تَمْتَشِطَ الشَّعِثَةُ وَتَسْتَحِدَّ الْمُغِيبَةُقَالَ أَبُو دَاوُد قَالَ الزُّهْرِيُّ الطُّرُوقُ بَعْدَ الْعِشَاءِ قَالَ أَبُو دَاوُد وَبَعْدَ الْمَغْرِبِ لَا بَأْسَ بِهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal], telah menceritakan kepada kami [Husyaim], telah mengabarkan kepada kami [Sayyar] dari [Asy Sya'bi], dari [Jabir bin Abdullah], ia berkata; dahulu kami bersama Nabi shallallahu 'alaihi wasallam dalam sebuah safar, kemudian tatkala kami pergi untuk menemui keluarga kami beliau berkata: \"Tundalah hingga kita masuk pada malam hari, agar wanita yang rambutnya acak-acakan bersisir, dan wanita yang ditinggal suaminya membersihkan bulu kemaluannya.\" Abu Daud berkata; Az Zuhri berkata; Thuruq adalah setelah 'Isya`. Abu Daud berkata; sedangkan setelah Maghrib tidak mengapa. "
            },
            {
                "number": 2333,
                "arab": "حَدَّثَنَا ابْنُ السَّرْحِ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ السَّائِبِ بْنِ يَزِيدَ قَالَلَمَّا قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ مِنْ غَزْوَةِ تَبُوكَ تَلَقَّاهُ النَّاسُ فَلَقِيتُهُ مَعَ الصِّبْيَانِ عَلَى ثَنِيَّةِ الْوَدَاعِ",
                "id": "Telah menceritakan kepada kami [Ibnu As Sarh], telah menceritakan kepada kami [Sufyan] dari [Az Zuhri], dari [As Saib bin Yazid], ia berkata; tatkala Nabi shallallahu 'alaihi wasallam datang ke Madinah dari perang Tabuk, orang-orang menemui beliau, sementara aku menemui beliau bersama anak-anak kecil di atas Tsaniyah Al Wada'. "
            },
            {
                "number": 2334,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ الْبُنَانِيُّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ فَتًى مِنْ أَسْلَمَ قَالَ يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ الْجِهَادَ وَلَيْسَ لِي مَالٌ أَتَجَهَّزُ بِهِ قَالَ اذْهَبْ إِلَى فُلَانٍ الْأَنْصَارِيِّ فَإِنَّهُ كَانَ قَدْ تَجَهَّزَ فَمَرِضَ فَقُلْ لَهُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقْرِئُكَ السَّلَامَ وَقُلْ لَهُ ادْفَعْ إِلَيَّ مَا تَجَهَّزْتَ بِهِ فَأَتَاهُ فَقَالَ لَهُ ذَلِكَ فَقَالَ لِامْرَأَتِهِ يَا فُلَانَةُ ادْفَعِي لَهُ مَا جَهَّزْتِنِي بِهِ وَلَا تَحْبِسِي مِنْهُ شَيْئًا فَوَاللَّهِ لَا تَحْبِسِينَ مِنْهُ شَيْئًا فَيُبَارِكَ اللَّهُ فِيهِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Hammad], telah mengabarkan kepada kami [Tsabit Al Bunani], dari [Anas bin Malik], bahwa seorang pemuda Aslam berkata; wahai Rasulullah, aku ingin berjihad dan aku tidak memiliki harta yang perlu aku persiapkan. Beliau berkata: \"Pergilah kepada Fulan Al Anshari, sesungguhnya ia telah bersiap-siap lalu sakit. Katakan kepadanya; sesungguhnya Rasulullah shallallahu 'alaihi wasallam menyampaikan salam kepadamu. Dan katakan kepadanya; serahkan kepadaku apa yang telah engkau persiapkan!\" kemudian pemuda tersebut datang kepadanya hal tersebut. Lalu orang anshar tersebut berkata kepada isterinya; wahai Fulanah, serahkan kepadanya apa yang telah aku persiapkan, dan jangan engkau tahan sedikitpun darinya! Demi Allah, tidak mungkin engkau menahan sedikitpun darinya kemudian Allah memberi berkah. "
            },
            {
                "number": 2335,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ الْعَسْقَلَانِيُّ وَالْحَسَنُ بْنُ عَلِيٍّ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنِي ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ قَالَ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِ عَبْدِ اللَّهِ بْنِ كَعْبٍ وَعَمِّهِ عُبَيْدِ اللَّهِ بْنِ كَعْبٍ عَنْ أَبِيهِمَا كَعْبِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَقْدَمُ مِنْ سَفَرٍ إِلَّا نَهَارًا قَالَ الْحَسَنُ فِي الضُّحَى فَإِذَا قَدِمَ مِنْ سَفَرٍ أَتَى الْمَسْجِدَ فَرَكَعَ فِيهِ رَكْعَتَيْنِ ثُمَّ جَلَسَ فِيهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutawakkil Al 'Asqalani] dan [Al Hasan bin Ali], mereka berkata; telah menceritakan kepada kami [Abdurrazzaq], telah mengabarkan kepada kami [Ibnu Juraij], ia berkata; telah mengabarkan kepadaku [Ibnu Syihab], ia berkata; telah mengabarkan kepadaku [Abdurrahman bin Abdullah bin Ka'b bin Malik], dari [ayahnya yaitu Abdullah bin Ka'b] dan [pamannya yaitu 'ubaidhullah bin Ka'b] dari [ayah mereka berdua yaitu Ka'b bin Malik], bahwa Nabi shallallahu 'alaihi wasallam tidak datang dari bepergian kecuali pada siang hari. Al Hasan berkata; pada waktu Dhuha. Apabila beliau datang dari bepergian maka beliau datang ke masjid, dan melakukan sholat dua raka'at kemudian duduk."
            },
            {
                "number": 2336,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مَنْصُورٍ الطُّوسِيُّ حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنْ ابْنِ إِسْحَقَ حَدَّثَنِي نَافِعٌ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ أَقْبَلَ مِنْ حَجَّتِهِ دَخَلَ الْمَدِينَةَ فَأَنَاخَ عَلَى بَابِ مَسْجِدِهِ ثُمَّ دَخَلَهُ فَرَكَعَ فِيهِ رَكْعَتَيْنِ ثُمَّ انْصَرَفَ إِلَى بَيْتِهِقَالَ نَافِعٌ فَكَانَ ابْنُ عُمَرَ كَذَلِكَ يَصْنَعُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Manshur Ath Thusi], telah menceritakan kepada kami [Ya'qub], telah menceritakan kepada kami [ayahku], dari [Ibnu Ishaq], telah menceritakan kepadaku [Nafi'] dari [Ibnu Umar], bahwa Rasulullah shallallahu 'alaihi wasallam ketika datang dari hajinya beliau masuk ke masjid, dan menderumkan untanya di depan pintu masjid, kemudian beliau pergi ke rumahnya. Nafi' berkata; Ibnu Umar melakukan demikian. "
            },
            {
                "number": 2337,
                "arab": "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ التِّنِّيسِيُّ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ حَدَّثَنَا الزَّمْعِيُّ عَنْ الزُّبَيْرِ بْنِ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ سُرَاقَةَ أَنَّ مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ أَخْبَرَهُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِيَّاكُمْ وَالْقُسَامَةَ قَالَ فَقُلْنَا وَمَا الْقُسَامَةُ قَالَ الشَّيْءُ يَكُونُ بَيْنَ النَّاسِ فَيَجِيءُ فَيَنْتَقِصُ مِنْهُحَدَّثَنَا عَبْدُ اللَّهِ الْقَعْنَبِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ شَرِيكٍ يَعْنِي ابْنَ أَبِي نَمِرٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ قَالَ الرَّجُلُ يَكُونُ عَلَى الْفِئَامِ مِنْ النَّاسِ فَيَأْخُذُ مِنْ حَظِّ هَذَا وَحَظِّ هَذَا",
                "id": "Telah menceritakan kepada kami [Ja'far bin Musafir At Tinnisi], telah menceritakan kepada kami [Ibnu Abu Fudaik], telah menceritakan kepada kami [Az Zam'i], dari [Az Zubair bin Utsman bin Abdullah bin Suraqah], bahwa [Muhammad bin Abdurrahman bin Tsauban], telah mengabarkan kepadanya bahwa [Abu Sa'id Al Khudri] telah mengabarkan kepadanya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: hendaklah kalian menjauhi qosamah. Ia berkatal lalu kami berkata; apakah qosamah itu? Beliau bersabda: suatu (pembunuhan tanpa bukti) yang terjadi di antara manusia kemudian (keluarganya) datang dan minta diadakan qishas darinya. Telah menceritakan kepada kami [Abdullah Al Qo'nabi] telah menceritakan kepada kami [Abdul Aziz yaitu Ibnu Muhammad] dari [Syarik yaitu Ibnu Abi Namir] dari ['Atha` bin Yasar] dari Nabi shallallahu 'alaihi wasallam seperti itu. Perawi berkata; seorang laki-laki yang berada di tengah-tengah perkumpulan manusia kemudian meminta tuntutan dari perkara ini dan perkara ini. "
            },
            {
                "number": 2338,
                "arab": "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا مُعَاوِيَةُ يَعْنِي ابْنَ سَلَّامٍ عَنْ زَيْدٍ يَعْنِي ابْنَ سَلَّامٍ أَنَّهُ سَمِعَ أَبَا سَلَّامٍ يَقُولُ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ سَلْمَانَأَنَّ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَهُ قَالَ لَمَّا فَتَحْنَا خَيْبَرَ أَخْرَجُوا غَنَائِمَهُمْ مِنْ الْمَتَاعِ وَالسَّبْيِ فَجَعَلَ النَّاسُ يَتَبَايَعُونَ غَنَائِمَهُمْ فَجَاءَ رَجُلٌ حِينَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ لَقَدْ رَبِحْتُ رِبْحًا مَا رَبِحَ الْيَوْمَ مِثْلَهُ أَحَدٌ مِنْ أَهْلِ هَذَا الْوَادِي قَالَ وَيْحَكَ وَمَا رَبِحْتَ قَالَ مَا زِلْتُ أَبِيعُ وَأَبْتَاعُ حَتَّى رَبِحْتُ ثَلَاثَ مِائَةِ أُوقِيَّةٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا أُنَبِّئُكَ بِخَيْرِ رَجُلٍ رَبِحَ قَالَ مَا هُوَ يَا رَسُولَ اللَّهِ قَالَ رَكْعَتَيْنِ بَعْدَ الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Ar Rabi' bin Nafi'], telah menceritakan kepada kami [Mu'awiyah bin Sallam] dari [Zaid bin Sallam] bahwa ia mendengar [Abu Sallam] berkata; telah menceritakan kepadaku ['ubaidhullah bin Salman] bahwa [seorang sahabat] Nabi shallallahu 'alaihi wasallam telah menceritakan kepadanya, ia berkata; tatkala kami menaklukkan Khaibar mereka mengeluarkan rampasan perang dari barang dan tawanan perang. Kemudian orang-orang menjual rampasan perang mereka. Lalu terdapat seorang laki-laki yang datang ketika Rasulullah shallallahu 'alaihi wasallam telah melakukan sholat dan berkata; wahai Rasulullah, sungguh aku telah mendapatkan keuntungan yang tidak ada seorangpun penghuni bukit ini yang mendapatkan keuntungan seperti itu hari ini. Beliau mengatakan; keuntungan apa yang telah engkau dapatkan? Ia berkata; aku terus berjual beli hingga mendapatkan keuntungan tiga ratus uqiyah. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku akan memberitahukan kepadamu mengenai orang mendapatkan keuntungan yang terbaik.\" Ia berkata; apakah itu wahai Rasulullah? Beliau berkata: \"sholat dua raka'at setelah melakukan sholat.\""
            },
            {
                "number": 2339,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ أَخْبَرَنِي أَبِي عَنْ أَبِي إِسْحَقَ عَنْ ذِي الْجَوْشَنِ رَجُلٍ مِنْ الضِّبَابِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ أَنْ فَرَغَ مِنْ أَهْلِ بَدْرٍ بِابْنِ فَرَسٍ لِي يُقَالُ لَهَا الْقَرْحَاءُ فَقُلْتُ يَا مُحَمَّدُ إِنِّي قَدْ جِئْتُكَ بِابْنِ الْقَرْحَاءِ لِتَتَّخِذَهُ قَالَ لَا حَاجَةَ لِي فِيهِ وَإِنْ شِئْتَ أَنْ أَقِيضَكَ بِهِ الْمُخْتَارَةَ مِنْ دُرُوعِ بَدْرٍ فَعَلْتُ قُلْتُ مَا كُنْتُ أَقِيضُهُ الْيَوْمَ بِغُرَّةٍ قَالَ فَلَا حَاجَةَ لِي فِيهِ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Isa bin Yunus], telah mengabarkan kepadaku [ayahku] dari [Abu Ishaq] dari [Dzul Jausyan] seorang laki-laki dari daerah yang banyak terdapat biawaknya. Aku datang kepada Nabi shallallahu 'alaihi wasallam dengan membawa anak kuda yang bernama Al Qarha` setelah beliau selesai menemui ahli Badr, kemudian aku katakan; wahai Muhammad, aku datang kepadamu dengan membawa anak Al Qarha` agar engkau gunakan. Beliau berkata: \"Aku tidak butuh kepadanya, apabila engkau mau, aku akan menggantimu dengan baju zirah pilihan dari Badr maka aku akan melakukannya.\" Aku katakan; aku tidak akan menukarnya dengan kuda pada hari ini (bagaimana aku menukarnya dengan sesuatu yang lebih rendah nilainya?). Beliau berkata: \"Aku tidak butuh kepadanya.\""
            },
            {
                "number": 2340,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ بْنِ سُفْيَانَ حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ أَخْبَرَنَا سُلَيْمَانُ بْنُ مُوسَى أَبُو دَاوُدَ حَدَّثَنَا جَعْفَرُ بْنُ سَعْدِ بْنِ سَمُرَةَ بْنِ جُنْدُبٍ حَدَّثَنِي خُبَيْبُ بْنُ سُلَيْمَانَ عَنْ أَبِيهِ سُلَيْمَانَ بْنِ سَمُرَةَ عَنْ سَمُرَةَ بْنِ جُنْدُبٍأَمَّا بَعْدُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ جَامَعَ الْمُشْرِكَ وَسَكَنَ مَعَهُ فَإِنَّهُ مِثْلُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Daud bin Sufyan], telah menceritakan kepada kami [Yahya bin Hassan], telah mengabarkan kepada kami [Sulaiman bin Musa Abu Daud], telah menceritakan kepada kami [Ja'far bin Sa'd bin Samurah bin Jundub], telah menceritakan kepadaku [Khubaib bin Sulaiman] dari [ayahnya yaitu Sulaiman bin Samurah] dari [Samurah bin Jundub], adapun selanjutnya, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang menggauli (menikahi) orang musyrik dan tinggal bersamanya, maka ia adalah sepertinya.\""
            },
            {
                "number": 2341,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَزِيدُ ح و حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا بِشْرٌ عَنْ عَبْدِ اللَّهِ بْنِ عَوْنٍ عَنْ عَامِرٍ أَبِي رَمْلَةَ قَالَ أَخْبَرَنَا مِخْنَفُ بْنُ سُلَيْمٍ قَالَوَنَحْنُ وُقُوفٌ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَاتٍ قَالَ يَا أَيُّهَا النَّاسُ إِنَّ عَلَى كُلِّ أَهْلِ بَيْتٍ فِي كُلِّ عَامٍ أُضْحِيَّةً وَعَتِيرَةً أَتَدْرُونَ مَا الْعَتِيرَةُ هَذِهِ الَّتِي يَقُولُ النَّاسُ الرَّجَبِيَّةُقَالَ أَبُو دَاوُد الْعَتِيرَةُ مَنْسُوخَةٌ هَذَا خَبَرٌ مَنْسُوخٌ",
                "id": "Telah menceritakan kepada kami [Musaddad], telah menceritakan kepada kami [Yazid], dan telah diriwayatkan dari jalur yang lain: Telah menceritakan kepada kami [Humaid bin Mas'adah], telah menceritakan kepada kami [Bisyr] dari [Abdullah bin 'Aun] dari ['Amir Abu Ramlah], ia berkata; telah mengabarkan kepada kami [Mikhnaf bin Sulaim], ketika kami sedang berwukuf bersama Rasulullah shallallahu 'alaihi wasallam di 'Arafah beliau berkata: \"Wahai umat manusia, sesungguhnya kewajiban setiap penghuni rumah pada setiap tahun untuk menyembelih kurban serta 'atirah, tahukah kalian apakah 'atirah? Yaitu yang orang-orang menyebutnya rajabiyyah (menyembelih hewan pada sepuluh hari pertama).\" Abu Daud berkata; 'atirah telah dihapuskan dan hadits ini adalah hadits yang telah terhapus. "
            },
            {
                "number": 2342,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ حَدَّثَنِي عَيَّاشُ بْنُ عَبَّاسٍ الْقِتْبَانِيُّ عَنْ عِيسَى بْنِ هِلَالٍ الصَّدَفِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمِرْتُ بِيَوْمِ الْأَضْحَى عِيدًا جَعَلَهُ اللَّهُ عَزَّ وَجَلَّ لِهَذِهِ الْأُمَّةِ قَالَ الرَّجُلُ أَرَأَيْتَ إِنْ لَمْ أَجِدْ إِلَّا أُضْحِيَّةً أُنْثَى أَفَأُضَحِّي بِهَا قَالَ لَا وَلَكِنْ تَأْخُذُ مِنْ شَعْرِكَ وَأَظْفَارِكَ وَتَقُصُّ شَارِبَكَ وَتَحْلِقُ عَانَتَكَ فَتِلْكَ تَمَامُ أُضْحِيَّتِكَ عِنْدَ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah], telah menceritakan kepada kami [Abdullah bin Yazid], telah menceritakan kepadaku [Sa'id bin Abu Ayyub], telah menceritakan kepadaku ['Ayyasy bin 'Abbas Al Qatbani], dari [Isa bin Hilal Ash Shudafi], dari [Abdullah bin 'Amr bin Al 'Ash], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Aku diperintahkan pada hari Kurban untuk menjadikannya sebagai hari raya, Allah 'azza wajalla telah menjadikannya untuk umat ini.\" Seseorang berkata; bagaimana pendapat anda jika aku hanya mendapatkan hewan kurban betina? Apakah aku boleh berkurban dengannya? Beliau berkata: \"Tidak, akan tetapi engkau ambil sebagian rambutmu dan kukumu, serta engkau gunting kumismu dan engkau cukur bulu kemaluanmu. Maka itulah kurbanmu yang sempurna di sisi Allah 'azza wajalla.\""
            },
            {
                "number": 2343,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي الْحَسْنَاءِ عَنْ الْحَكَمِ عَنْ حَنَشٍ قَالَرَأَيْتُ عَلِيًّا يُضَحِّي بِكَبْشَيْنِ فَقُلْتُ لَهُ مَا هَذَا فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْصَانِي أَنْ أُضَحِّيَ عَنْهُ فَأَنَا أُضَحِّي عَنْهُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah], telah menceritakan kepada kami [Syarik] dari [Abu Al Hasna`] dari [Al Hakam] dari [Hanasy], ia berkata; aku melihat [Ali] berkurban dengan dua kambing. Kemudian aku katakan kepadanya; apa ini? Lalu ia berkata; sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah berwasiat kepadaku agar berkurban untuknya, maka aku berkurban untuknya. "
            },
            {
                "number": 2344,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو حَدَّثَنَا عَمْرُو بْنُ مُسْلِمٍ اللَّيْثِيُّ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيِّبِ يَقُولُ سَمِعْتُ أُمَّ سَلَمَةَ تَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ لَهُ ذِبْحٌ يَذْبَحُهُ فَإِذَا أَهَلَّ هِلَالُ ذِي الْحِجَّةِ فَلَا يَأْخُذَنَّ مِنْ شَعْرِهِ وَلَا مِنْ أَظْفَارِهِ شَيْئًا حَتَّى يُضَحِّيَقَالَ أَبُو دَاوُد اخْتَلَفُوا عَلَى مَالِكٍ وَعَلَى مُحَمَّدِ بْنِ عَمْرٍو فِي عَمْرِو بْنِ مُسْلِمٍ قَالَ بَعْضُهُمْ عُمَرُ وَأَكْثَرُهُمْ قَالَ عَمْرٌو قَالَ أَبُو دَاوُد وَهُوَ عَمْرُو بْنُ مُسْلِمِ بْنِ أُكَيْمَةَ اللَّيْثِيُّ الْجُنْدُعِيُّ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz], telah menceritakan kepada kami [ayahku], telah menceritakan kepada kami [Muhammad bin 'Amr], telah menceritakan kepada kami ['Amr bin Muslim Al Laitsi], ia berkata; saya mendengar [Sa'id bin Al Musayyab] berkata; saya mendengar [Ummu Salamah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang memiliki hewan sembelihan yang akan ia sembelih, apabila telah muncul hilal Bulan Dzul Hijjah maka janganlah ia mengambil sedikitpun dari rambut, serta kukunya hingga ia menyembelih.\" Abu Daud berkata; mereka menyelisihi Malik dan Muhammad bin 'Amr mengenai 'Amr bin Muslim. Sebagian mereka berkata; ia adalah Umar, dan kebanyakan mereka mengatakan; 'Amr. Abu Daud berkata; ia adalah 'Amr bin Muslim bin Ukaimah Al Laitsi Al Jundu'i. "
            },
            {
                "number": 2345,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي حَيْوَةُ حَدَّثَنِي أَبُو صَخْرٍ عَنْ ابْنِ قُسَيْطٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِكَبْشٍ أَقْرَنَ يَطَأُ فِي سَوَادٍ وَيَنْظُرُ فِي سَوَادٍ وَيَبْرُكُ فِي سَوَادٍ فَأُتِيَ بِهِ فَضَحَّى بِهِ فَقَالَ يَا عَائِشَةُ هَلُمِّي الْمُدْيَةَ ثُمَّ قَالَ اشْحَذِيهَا بِحَجَرٍ فَفَعَلَتْ فَأَخَذَهَا وَأَخَذَ الْكَبْشَ فَأَضْجَعَهُ وَذَبَحَهُ وَقَالَ بِسْمِ اللَّهِ اللَّهُمَّ تَقَبَّلْ مِنْ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَمِنْ أُمَّةِ مُحَمَّدٍ ثُمَّ ضَحَّى بِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih], telah menceritakan kepada kami [Abdullah bin Wahb], telah mengabarkan kepadaku [Haiwah], telah menceritakan kepadaku [Abu Shakhr] dari [Ibnu Qusaith] dari ['Urwah bin Az Zubair] dari [Aisyah] bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk menyembelih domba yang bertanduk, berkaki hitam, sekitar matanya hitam, dan perutnya hitam. Kemudian beliau diberi kambing seperti itu, lalu beliau berkurban dengannya. Beliau berkata: \"Wahai Aisyah, berikan pisau.\" Kemudian beliau berkata: \"Tajamkan pisau tersebut dengan batu!\" kemudian ia melakukannya, lalu Rasulullah shallallahu 'alaihi wasallam mengambilnya dan mengambil domba tersebut serta membaringkan dan menyembelihnya. Beliau mengucapkan: \"BISMILLAAH, ALLAAHUMMA TAQABBAL MIN MUHAMMADIN WA AALI MUHAMMAD, WA MIN UMMATI MUHAMMAD (Dengan nama Allah, ya Allah, terimalah dari Muhammad dan keluarga Muhammad serta Ummat Muhammad). Kemudian beliau shallallahu 'alaihi wasallam berkurban dengannya. "
            },
            {
                "number": 2346,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وَهْبٌ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحَرَ سَبْعَ بَدَنَاتٍ بِيَدِهِ قِيَامًا وَضَحَّى بِالْمَدِينَةِ بِكَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il], telah menceritakan kepada kami [Wahb] dari [Ayyub], dari [Abu Qilabah], dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam menyembelih tujuh unta dengan tangannya dalam keadaan berdiri, dan beliau di Madinah berkurban dengan dua domba yang bertanduk dan berwarna abu-Abu. "
            },
            {
                "number": 2347,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحَّى بِكَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ يَذْبَحُ وَيُكَبِّرُ وَيُسَمِّي وَيَضَعُ رِجْلَهُ عَلَى صَفْحَتِهِمَا",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim], telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam berkurban dengan dua domba yang bertanduk dan berwarna abu-Abu. Beliau menyembelih, bertakbir dan membaca bismilah, serta beliau meletakkan kakinya di atas sebelah kepalanya. "
            },
            {
                "number": 2348,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ حَدَّثَنَا عِيسَى حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي عَيَّاشٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَذَبَحَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الذَّبْحِ كَبْشَيْنِ أَقْرَنَيْنِ أَمْلَحَيْنِ مُوجَأَيْنِ فَلَمَّا وَجَّهَهُمَا قَالَ إِنِّي وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالْأَرْضَ عَلَى مِلَّةِ إِبْرَاهِيمَ حَنِيفًا وَمَا أَنَا مِنْ الْمُشْرِكِينَ إِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ لَا شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنْ الْمُسْلِمِينَ اللَّهُمَّ مِنْكَ وَلَكَ وَعَنْ مُحَمَّدٍ وَأُمَّتِهِ بِاسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ ثُمَّ ذَبَحَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi], telah menceritakan kepada kami [Isa], telah menceritakan kepada kami [Muhammad bin Ishaq], dari [Yazid bin Abu Habib], dari [Abu 'Ayyasy] dari [Jabir bin Abdullah], ia berkata; Nabi shallallahu 'alaihi wasallam pada hari Kurban menyembelih dua domba yang bertanduk dan berwarna abu-abu yang terkebiri. Kemudian tatkala beliau telah menghadapkan keduanya beliau mengucapkan: \"INNII WAJJAHTU WAJHIYA LILLADZII FATHARAS SAMAAWAATI WAL ARDHA 'ALAA MILLATI IBRAAHIIMA HANIIFAN WA MAA ANA MINAL MUSYRIKIIN, INNA SHALAATII WA NUSUKII WA MAHYAAYA WA MAMAATII LILLAAHI RABBIL 'AALAMIIN, LAA SYARIIKA LAHU WA BIDZAALIKA UMIRTU WA ANA MINAL MUSLIMIIN. ALLAAHUMMA MINKA WA LAKA WA 'AN MUHAMMADIN WA UMMATIHI. BISMILLAAHI WALLAHU AKBAR\" (Sesungguhnya aku telah menghadapkan wajahku kepada Dzat yang telah menciptakan langit dan bumi di atas agama Ibrahim dengan lurus, dan aku bukan termsuk orang-orang yang berbuat syirik. Sesungguhnya sholatku, dan sembelihanku serta hidup dan matiku adalah untuk Allah Tuhan semesta alam, tidak ada sekutu bagiNya, dengan itu aku diperintahkan, dan aku termasuk orang-orang yang berserah diri. Ya Allah, ini berasal dariMu dan untukMu, dari Muhammad dan ummatnya. Dengan Nama Allah, dan Allah Maha Besar). "
            },
            {
                "number": 2349,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ حَدَّثَنَا حَفْصٌ عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ أَبِي سَعِيدٍ قَالَكَانَ رَسُولُ اللَّهِ يُضَحِّي صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِكَبْشٍ أَقْرَنَ فَحِيلٍ يَنْظُرُ فِي سَوَادٍ وَيَأْكُلُ فِي سَوَادٍ وَيَمْشِي فِي سَوَادٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ma'in], telah menceritakan kepada kami [Hafsh] dari [Ja'far], dari [ayahnya], dari [Abu Sa'id], ia berkata; Rasulullah shallallahu 'alaihi wasallam berkurban dengan seekor domba yang bertanduk yang sempurna tubuhnya, sekitar matanya hitam, dan perutnya hitam, serta berkaki hitam. "
            },
            {
                "number": 2350,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي شُعَيْبٍ الْحَرَّانِيُّ حَدَّثَنَا زُهَيْرُ بْنُ مُعَاوِيَةَ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَذْبَحُوا إِلَّا مُسِنَّةً إِلَّا أَنْ يَعْسُرَ عَلَيْكُمْ فَتَذْبَحُوا جَذَعَةً مِنْ الضَّأْنِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abu Syu'aib Al Harrani], telah menceritakan kepada kami [Zuhair bin Mu'awiyah], telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir], ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian menyembelih kecuali domba yang berumur tiga tahun, kecuali kalian kesulitan mendapatkannya maka sembelihlah domba yang berumur satu tahun.\""
            },
            {
                "number": 2351,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ صُدْرَانَ حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ حَدَّثَنِي عُمَارَةُ بْنُ عَبْدِ اللَّهِ بْنِ طُعْمَةَ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ قَالَقَسَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَصْحَابِهِ ضَحَايَا فَأَعْطَانِي عَتُودًا جَذَعًا قَالَ فَرَجَعْتُ بِهِ إِلَيْهِ فَقُلْتُ لَهُ إِنَّهُ جَذَعٌ قَالَ ضَحِّ بِهِ فَضَحَّيْتُ بِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Shudran], telah menceritakan kepada kami [Abdul A'la bin Abdul A'la], telah menceritakan kepada kami [Muhammad bin Ishaq], telah menceritakan kepadaku ['Umarah bin Abdullah bin Thu'mah], dari [Sa'id bin Al Musayyab], dari [Zaid bin Khalid Al Juhani], ia berkata; Rasulullah shallallahu 'alaihi wasallam membagikan kurban beliau kepada para sahabatnya, beliau memberiku kambing kecil yang berumur satu tahun. Kemudian aku membawanya kembali kepada beliau dan aku katakan kepadanya; kambing itu adalah kambing yang berumur satu tahun. Kemudian beliau berkata: \"Berkurbanlah dengannya!\" kemudian aku berkurban dengannya. "
            },
            {
                "number": 2352,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا الثَّوْرِيُّ عَنْ عَاصِمِ بْنِ كُلَيْبٍ عَنْ أَبِيهِ قَالَكُنَّا مَعَ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَالُ لَهُ مُجَاشِعٌ مِنْ بَنِي سُلَيْمٍ فَعَزَّتْ الْغَنَمُ فَأَمَرَ مُنَادِيًا فَنَادَى أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ إِنَّ الْجَذَعَ يُوَفِّي مِمَّا يُوَفِّي مِنْهُ الثَّنِيُّقَالَ أَبُو دَاوُد وَهُوَ مُجَاشِعُ بْنُ مَسْعُودٍ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali], telah menceritakan kepada kami [Abdurrazzaq], telah menceritakan kepada kami [Ats Tsauri] dari ['Ashim bin Kulaib], dari [ayahnya], ia berkata; kami pernah bersama seorang sahabat Nabi shallallahu 'alaihi wasallam yang bernama [Mujasyi'] dari Bani Sulaim. Dan jumlah kambing sedikit. Kemudian ia memerintahkan seseorang untuk menyeru bahwa Rasulullah shallallahu 'alaihi wasallam berkata: \"Sesungguhnya kambing yang berumur satu tahun adalah cukup sebagaimana yang genap dua tahun masuk tiga tahun.\" Abu Daud berkata; ia adalah Mujasyi' bin Mas'ud. "
            }
        ]
    }
}