{
    "status": true,
    "data": {
        "start": 3676,
        "end": 3822,
        "total": 147,
        "book": "abu-daud",
        "hadits": [
            {
                "number": 3676,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ الْمَرْوَزِيُّ حَدَّثَنَا عَلِيُّ بْنُ الْحُسَيْنِ بْنِ وَاقِدٍ عَنْ أَبِيهِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ عَبْدُ اللَّهِ بْنُ سَعْدِ بْنِ أَبِي سَرْحٍ يَكْتُبُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَزَلَّهُ الشَّيْطَانُ فَلَحِقَ بِالْكُفَّارِ فَأَمَرَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُقْتَلَ يَوْمَ الْفَتْحِ فَاسْتَجَارَ لَهُ عُثْمَانُ بْنُ عَفَّانَ فَأَجَارَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad Al Marwazi] berkata, telah menceritakan kepada kami [Ali bin Al Husain bin Waqid] dari [Bapaknya] dari [Yazid An Nahwi] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Abdullah bin Sa'd bin Abu Sarh pernah menulis surat perjanjian dengan Rasulullah shallallahu 'alaihi wasallam, namun setan menggelincirkannya hingga ia bergabung dengan orang-orang kafir. Rasulullah shallallahu 'alaihi wasallam pun memerintahkan untuk membunuhnya saat pembukaan (penaklukan) kota Makkah. Namun Utsman bin Affan memberikan jaminan perlindungan kepadanya, dan Rasulullah shallallahu 'alaihi wasallam menjamin keamanannya.\""
            },
            {
                "number": 3677,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَحْمَدُ بْنُ الْمُفَضَّلِ حَدَّثَنَا أَسْبَاطُ بْنُ نَصْرٍ قَالَ زَعَمَ السُّدِّيُّ عَنْ مُصْعَبِ بْنِ سَعْدٍ عَنْ سَعْدٍ قَالَلَمَّا كَانَ يَوْمُ فَتْحِ مَكَّةَ اخْتَبَأَ عَبْدُ اللَّهِ بْنُ سَعْدِ بْنِ أَبِي سَرْحٍ عِنْدَ عُثْمَانَ بْنِ عَفَّانَ فَجَاءَ بِهِ حَتَّى أَوْقَفَهُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ بَايِعْ عَبْدَ اللَّهِ فَرَفَعَ رَأْسَهُ فَنَظَرَ إِلَيْهِ ثَلَاثًا كُلُّ ذَلِكَ يَأْبَى فَبَايَعَهُ بَعْدَ ثَلَاثٍ ثُمَّ أَقْبَلَ عَلَى أَصْحَابِهِ فَقَالَ أَمَا كَانَ فِيكُمْ رَجُلٌ رَشِيدٌ يَقُومُ إِلَى هَذَا حَيْثُ رَآنِي كَفَفْتُ يَدِي عَنْ بَيْعَتِهِ فَيَقْتُلُهُ فَقَالُوا مَا نَدْرِي يَا رَسُولَ اللَّهِ مَا فِي نَفْسِكَ أَلَّا أَوْمَأْتَ إِلَيْنَا بِعَيْنِكَ قَالَ إِنَّهُ لَا يَنْبَغِي لِنَبِيٍّ أَنْ تَكُونَ لَهُ خَائِنَةُ الْأَعْيُنِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ahmad bin Al Mufadhdhal] berkata, telah menceritakan kepada kami [Asbath bin Nashr] ia berkata; [As Sudi] menyakini bahwa ia meriwayatkan dari [Mush'ab bin Sa'd] dari [Sa'd] ia berkata, \"Saat terjadi pembukaan (penaklukan) kota Makkah, Abdullah bin Sa'd bin Abu Sarh bersembunyi di belakang Utsman bin Affan (minta perlindungan). Utsman lantas membawanya menghadap Nabi shallallahu 'alaihi wasallam seraya berkata, \"Wahai Rasulullah, baiatlah Abdullah.\" Beliau kemudian mengangkat kepalanya dan memandang ke arahnya sebanyak tiga kali, setiap kali itu pula beliau enggan menerimanya. Namun pada kali ketiganya beliau menerima dan membaiatnya. Setelah itu beliau berbalik menghadap para sahabat, beliau bersabda: \"Bukankah telah ada di antara kalian seorang yang bijaksana (yang percaya dengan keputusan Rasulullah) yang berdiri menuju orang ini (untuk memohon jaminan perlindungan), yang jika sekiranya ia melihatku menahan tanganku untuk membaiatnya maka ia akan membunuhnya.\" maka mereka (para sahabat) berkata; \"Kami tidak mengetahui apa yang ada dalam dirimu wahai Rasulullah jika engkau tidak memberikan isyarat kepada kami dengan mata, Rasulullah shallallahu 'alaihi wasallam bersabda; \"Sesungguhnya tidak layak bagi seorang Nabi tidak jujur dengan isyarat matanya.\""
            },
            {
                "number": 3678,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي إِسْحَقَ عَنْ الشَّعْبِيِّ عَنْ جَرِيرٍ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا أَبَقَ الْعَبْدُ إِلَى الشِّرْكِ فَقَدْ حَلَّ دَمُهُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Humaid bin 'Abdurrahman] dari [Bapaknya] dari [Abu Ishaq] dari [Asy Sya'bi] dari [Jarir] ia berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Jika seorang hamba sahaya melarikan diri ke negeri kafir, maka darahnya telah halal.\""
            },
            {
                "number": 3679,
                "arab": "حَدَّثَنَا عَبَّادُ بْنُ مُوسَى الْخُتَّلِيُّ أَخْبَرَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ الْمَدَنِيُّ عَنْ إِسْرَائِيلَ عَنْ عُثْمَانَ الشَّحَّامِ عَنْ عِكْرِمَةَ قَالَ حَدَّثَنَا ابْنُ عَبَّاسٍأَنَّ أَعْمَى كَانَتْ لَهُ أُمُّ وَلَدٍ تَشْتُمُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَقَعُ فِيهِ فَيَنْهَاهَا فَلَا تَنْتَهِي وَيَزْجُرُهَا فَلَا تَنْزَجِرُ قَالَ فَلَمَّا كَانَتْ ذَاتَ لَيْلَةٍ جَعَلَتْ تَقَعُ فِي النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَشْتُمُهُ فَأَخَذَ الْمِغْوَلَ فَوَضَعَهُ فِي بَطْنِهَا وَاتَّكَأَ عَلَيْهَا فَقَتَلَهَا فَوَقَعَ بَيْنَ رِجْلَيْهَا طِفْلٌ فَلَطَّخَتْ مَا هُنَاكَ بِالدَّمِ فَلَمَّا أَصْبَحَ ذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَمَعَ النَّاسَ فَقَالَ أَنْشُدُ اللَّهَ رَجُلًا فَعَلَ مَا فَعَلَ لِي عَلَيْهِ حَقٌّ إِلَّا قَامَ فَقَامَ الْأَعْمَى يَتَخَطَّى النَّاسَ وَهُوَ يَتَزَلْزَلُ حَتَّى قَعَدَ بَيْنَ يَدَيْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَنَا صَاحِبُهَا كَانَتْ تَشْتُمُكَ وَتَقَعُ فِيكَ فَأَنْهَاهَا فَلَا تَنْتَهِي وَأَزْجُرُهَا فَلَا تَنْزَجِرُ وَلِي مِنْهَا ابْنَانِ مِثْلُ اللُّؤْلُؤَتَيْنِ وَكَانَتْ بِي رَفِيقَةً فَلَمَّا كَانَ الْبَارِحَةَ جَعَلَتْ تَشْتُمُكَ وَتَقَعُ فِيكَ فَأَخَذْتُ الْمِغْوَلَ فَوَضَعْتُهُ فِي بَطْنِهَا وَاتَّكَأْتُ عَلَيْهَا حَتَّى قَتَلْتُهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا اشْهَدُوا أَنَّ دَمَهَا هَدَرٌ",
                "id": "Telah menceritakan kepada kami [Abbad bin Musa Al Khuttali] berkata, telah mengabarkan kepada kami [Isma'il bin Ja'far Al madani] dari [Isra'il] dari [Utsman Asy Syahham] dari [Ikrimah] ia berkata, [Ibnu Abbas] pernah bercerita kepada kami; \"Seorang laki-laki buta mempunyai Ummul Walad (budak wanita yang dijadikan isteri) yang menghina Nabi shallallahu 'alaihi wasallam, dan ia benar-benar telah melakukannya (penghinaan). Laki-laki itu melarang dan mengancamnya namun ia tidak berhenti dan ia terus melarangnya namun wanita itu tidak menggubris. Ibnu Abbas melanjutkan ceritanya, \"Pada suatu malam wanita itu kembali mencela Nabi shallallahu 'alaihi wasallam, maka laki-laki itu mengambil sebuah pisau tajam dan meletakkan di atas perut wanita itu seraya menusuknya. Laki-laki itu membunuhnya, sementara antara kedua kaki wanita tersebut lahir seorang banyi mungil hingga ia pun berlumuran darah. Ketika hari telah pagi, kejadian tersebut disampaikan kepada Nabi shallallahu 'alaihi wasallam. Beliau lantas mengumpulkan orang-orang dan bersabda: \"Aku bersumpah kepada Allah atas seorang laki-laki, ia telah melakukan suatu perbuatan karena aku, ia dalam kebenaran.\" Kemudian laki-laki buta itu melangkah di antara manusia hingga ia duduk di hadapan nabi shallallahu 'alaihi wasallam. Ia lalu berkata, \"Wahai Rasulullah, aku adalah suaminya. Namun ia mencela dan menghinamu, aku telah melarang dan mengancamnya, namun ia tidak berhenti atau menggubrisnya. Darinya aku telah dikaruniakan dua orang anak yang cakep layaknya bintang yang bersinar, wanita itu sangat sayang kepadaku. Namun, tadi malam ia mencela dan menghinamu, lantas aku mengambil pisau tajam, pisau itu aku letakkan di atas perutnya dan aku tusukkan hingga ia mati.\" Nabi shallallahu 'alaihi wasallam lalu bersabda: \"Ketahuilah, bahwa darah wanita itu adalah sia-sia (halal).\""
            },
            {
                "number": 3680,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَعَبْدُ اللَّهِ بْنُ الْجَرَّاحِ عَنْ جَرِيرٍ عَنْ مُغِيرَةَ عَنْ الشَّعْبِيِّ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُأَنَّ يَهُودِيَّةً كَانَتْ تَشْتُمُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَقَعُ فِيهِ فَخَنَقَهَا رَجُلٌ حَتَّى مَاتَتْ فَأَبْطَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَمَهَا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Abdullah Ibnul jarrah] dari [Jarir] dari [Mughirah] dari [Asy Sya'bi] dari [Ali radliallahu 'anhu] ia berkata, \"Seorang wanita yahudi mencela Nabi shallallahu 'alaihi wasallam, lalu seorang laki-laki mencekik lehernya hingga mati. Rasulullah shallallahu 'alaihi wasallam lalu menjadikan darahnya sia-sia.\""
            },
            {
                "number": 3681,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ يُونُسَ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ وَنُصَيْرُ بْنُ الْفَرَجِ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ يَزِيدَ بْنِ زُرَيْعٍ عَنْ يُونُسَ بْنِ عُبَيْدٍ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ مُطَرِّفٍ عَنْ أَبِي بَرْزَةَ قَالَكُنْتُ عِنْدَ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ فَتَغَيَّظَ عَلَى رَجُلٍ فَاشْتَدَّ عَلَيْهِ فَقُلْتُ تَأْذَنُ لِي يَا خَلِيفَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَضْرِبُ عُنُقَهُ قَالَ فَأَذْهَبَتْ كَلِمَتِي غَضَبَهُ فَقَامَ فَدَخَلَ فَأَرْسَلَ إِلَيَّ فَقَالَ مَا الَّذِي قُلْتَ آنِفًا قُلْتُ ائْذَنْ لِي أَضْرِبُ عُنُقَهُ قَالَ أَكُنْتَ فَاعِلًا لَوْ أَمَرْتُكَ قُلْتُ نَعَمْ قَالَ لَا وَاللَّهِ مَا كَانَتْ لِبَشَرٍ بَعْدَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ أَبُو دَاوُد هَذَا لَفْظُ يَزِيدَ قَالَ أَحْمَدُ بْنُ حَنْبَلٍ أَيْ لَمْ يَكُنْ لِأَبِي بَكْرٍ أَنْ يَقْتُلَ رَجُلًا إِلَّا بِإِحْدَى الثَّلَاثِ الَّتِي قَالَهَا رَسُولُ اللَّه صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُفْرٌ بَعْدَ إِيمَانٍ أَوْ زِنًا بَعْدَ إِحْصَانٍ أَوْ قَتْلُ نَفْسٍ بِغَيْرَ نَفْسٍ وَكَانَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَقْتُلَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] dari [Yunus] dari [Humaid bin Hilal] dari Nabi shallallahu 'alaihi wasallam. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Harun bin Abdullah] dan [Nushair Ibnul Faraj] keduanya berkata; telah menceritakan kepada kami [Abu Usamah] dari [Yazid bin Zurai'] dari [Yunus bin Ubaid] dari [Humaid bin Hilal] dari [Abdullah bin Mutharrif] dari [Abu Barzah] ia berkata, \"Aku pernah di dekat [Abu Bakar radliallahu 'anhu], ia marah kepada seorang laki-laki dan amarahnya semakin memuncak. Aku lalu berkata, \"Wahai Khalifah Rasulullah shallallahu 'alaihi wasallam, bolehkan aku memenggal kepalanya?\" Abu Barzah berkata, \"Kata-kataku itu menjadikan amarahnya hilang. Ia lalu berdiri dan masuk ke dalam rumah. Kemudian Abu Bakar mengutus utusan (untuk memanggilku), Abu Bakar berkata, \"Apa yang kamu katakan tadi?\" aku menjawab, \"Tadi aku minta izin untuk memenggal lehernya.\" Abu Bakar berkata lagi, \"Apakah kamu akan melakukannya jika aku perintahkan untuk itu?\" Aku menjawab, \"Tentu.\" Abu Bakr lalu berkata, \"Demi Allah, tidak! Tidak ada seorang pun boleh melebihi (petuah) Muhammad shallallahu 'alaihi wasallam.\" Abu Dawud berkata, \"Ini adalah lafadz Yazid. Ahmad bin Hanbal berkata, \"Maksudnya, Abu Bakar tidak akan membunuh seorang pun kecuali dengan salah satu dari tiga sebab (dibolehkannya membunuh seorang muslim) sebagaimana yang dikatakan oleh Rasulullah shallallahu 'alaihi wasallam. Yakni; kafir setelah beriman, zina setelah menikah dan membunuh jiwa. Itulah alasan yang dibolehkan Nabi shallallahu 'alaihi wasallam untuk membunuh.\""
            },
            {
                "number": 3682,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ قَوْمًا مِنْ عُكْلٍ أَوْ قَالَ مِنْ عُرَيْنَةَ قَدِمُوا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاجْتَوَوْا الْمَدِينَةَ فَأَمَرَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلِقَاحٍ وَأَمَرَهُمْ أَنْ يَشْرَبُوا مِنْ أَبْوَالِهَا وَأَلْبَانِهَا فَانْطَلَقُوا فَلَمَّا صَحُّوا قَتَلُوا رَاعِيَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاسْتَاقُوا النَّعَمَ فَبَلَغَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَبَرُهُمْ مِنْ أَوَّلِ النَّهَارِ فَأَرْسَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي آثَارِهِمْ فَمَا ارْتَفَعَ النَّهَارُ حَتَّى جِيءَ بِهِمْ فَأَمَرَ بِهِمْ فَقُطِعَتْ أَيْدِيهِمْ وَأَرْجُلُهُمْ وَسُمِرَ أَعْيُنُهُمْ وَأُلْقُوا فِي الْحَرَّةِ يَسْتَسْقُونَ فَلَا يُسْقَوْنَقَالَ أَبُو قِلَابَةَ فَهَؤُلَاءِ قَوْمٌ سَرَقُوا وَقَتَلُوا وَكَفَرُوا بَعْدَ إِيمَانِهِمْ وَحَارَبُوا اللَّهَ وَرَسُولَهُ حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ عَنْ أَيُّوبَ بِإِسْنَادِهِ بِهَذَا الْحَدِيثِ قَالَ فِيهِ فَأَمَرَ بِمَسَامِيرَ فَأُحْمِيَتْ فَكَحَلَهُمْ وَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَمَا حَسَمَهُمْ حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ بْنِ سُفْيَانَ قَالَ أَخْبَرَنَا ح و حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ حَدَّثَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى يَعْنِي ابْنَ أَبِي كَثِيرٍ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسِ بْنِ مَالِكٍ بِهَذَا الْحَدِيثِ قَالَ فِيهِ فَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي طَلَبِهِمْ قَافَةً فَأُتِيَ بِهِمْ قَالَ فَأَنْزَلَ اللَّهُ تَبَارَكَ وَتَعَالَى فِي ذَلِكَ{ إِنَّمَا جَزَاءُ الَّذِينَ يُحَارِبُونَ اللَّهَ وَرَسُولَهُ وَيَسْعَوْنَ فِي الْأَرْضِ فَسَادًا }الْآيَةَ حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ وَقَتَادَةُ وَحُمَيْدٌ عَنْ أَنَسِ بْنِ مَالِكٍ ذَكَرَ هَذَا الْحَدِيثَ قَالَ أَنَسٌ فَلَقَدْ رَأَيْتُ أَحَدَهُمْ يَكْدِمُ الْأَرْضَ بِفِيهِ عَطَشًا حَتَّى مَاتُوا حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ هِشَامٍ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ بِهَذَا الْحَدِيثِ نَحْوَهُ زَادَ ثُمَّ نَهَى عَنْ الْمُثْلَةِ وَلَمْ يَذْكُرْ مِنْ خِلَافٍ وَرَوَاهُ شُعْبَةُ عَنْ قَتَادَةَ وَسَلَّامُ بْنُ مِسْكِينٍ عَنْ ثَابِتٍ جَمِيعًا عَنْ أَنَسٍ لَمْ يَذْكُرَا مِنْ خِلَافٍ وَلَمْ أَجِدْ فِي حَدِيثِ أَحَدٍ قَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ مِنْ خِلَافٍ إِلَّا فِي حَدِيثِ حَمَّادِ بْنِ سَلَمَةَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] berkata, telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Abu Qilabah] dari [Anas bin Malik] berkata, \"Beberapa orang dari 'Ukl, atau ia mengatakan, \"dari Urainah datang menemui Rasulullah shallallahu 'alaihi wasallam. Namun mereka tidak cocok dengan iklim Madinah (hingga jatuh sakit). Rasulullah shallallahu 'alaihi wasallam kemudian memerintahkan untuk menyediakan liqah (unta hamil) bagi mereka. Beliau perintahkan mereka minum air kencing dan susu unta tersebut. Mereka pun pergi (menuju kandang unta), namun ketika telah sembuh mereka justru membunuh pengembala Rasulullah shallallahu 'alaihi wasallam dan membawa lari unta-unta tersebut. Menjelang siang hari, berita yang menimpa mereka sampai kepada Nabi shallallahu 'alaihi wasallam, Nabi shallallahu 'alaihi wasallam lalu mengirim (beberapa orang) untuk mengikuti jejak mereka. Matahari belum tinggi, orang-orang tersebut telah ditangkap dan dihadapkan kepada beliau. Beliau pun memberi perintah untuk memberi hukuman kepada mereka, tangan dan kaki mereka lalu dipotong, matanya dicongkel kemudian mereka dibuang ke padang pasir. Mereka minta minum namun tidak diberi.\" [Abu Qilabah] berkata, \"Orang-orang itu telah mencuri dan membunuh, murtad setelah beriman, serta memerangi Allah dan Rasul-Nya.\" Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Wuhaib] dari [Ayyub] dengan sanadnya sebagaimana dalam hadits tersebut. Namun ia menambahkan dalam haditsnya, \"Beliau memerintahkan untuk mengambil beberapa paku yang dipanaskan, lalu mereka disayat (dengan paku tersebut), tangan dan kaki mereka juga dipotong, namun beliau tidak memerintahkan untuk menghentikan darah mereka dengan menempelkan besi panas.\" Telah menceritakan kepada kami [Muhammad bin Ash Shabbah bin Sufyan] ia berkata; telah mengabarkan kepada kami. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Amru bin Utsman] berkata, telah menceritakan kepada kami [Al Walid] dari [Al Auza'i] dari [Yahya] -maksudnya Yahya bin Abu Katsir- dari [Abu Qilabah] dari [Anas bin Malik] dengan hadits yang sama. Dalam hadits tersebut ia mengatakan, \"Rasulullah shallallahu 'alaihi wasallam lalu mengirim teliksandi untuk mencari mereka, hingga akhirnya mereka tertangkap. Anas berkata, \"Allah Tabaaraka Wa Ta'ala lalu menurunkan ayat: '(Sesungguhnya pembalasan terhadap orang-orang yang memerangi Allah dan Rasul-Nya dan membuat kerusakan..) ' -Qs. Al Maidah: 33-. Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah mengabarkan kepada kami [Tsabit] dan [Qatadah] dan [Humaid] dari [Anas bin Malik] ia lalu menyebutkan hadits tersebut. Anas berkata, \"Aku melihat salah seorang dari mereka menjilati bumi dengan mulutnya karena haus, hingga akhirnya mati.\" Telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Ibnu Abu Adi] dari [Hisyam] dari [Qatadah] dari [Anas bin Malik] sama dengan hadits tersebut, namun ia menambahkan, \"kemudian beliau melarang untuk melakukan mutslah (Mutilasi atau menyayat mayat). dan ia tidak menyebut kata; 'min khilaf' (secara bersilang). [Syu'bah] juga meriwayatkan dari [Qatadah] dan [Salam bin Miskin], dari [Tsabit]. Semuanya juga berasal dari [Anas], namun keduanya juga tidak menyebutkan kata; min khilaf (dipotong tangan dan kakinya secara bersilang). Aku tidak pernah mendapatkan dalam hadits seorang pun yang menyebutkan; 'beliau memotong tangan dan kaki mereka secara bersilang', kecuali hadits hadits riwayat Hammad bin Salamah.\""
            },
            {
                "number": 3683,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ عَنْ أَبِي الزِّنَادِ عَنْ عَبِدْ اللَّهِ بْنِ عُبَيْدِ اللَّهِ قَالَ أَحْمَدُ هُوَ يَعْنِي عَبْدَ اللَّهِ بْنَ عُبَيْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ عَنْ ابْنِ عُمَرَأَنَّ نَاسًا أَغَارُوا عَلَى إِبِلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَاقُوهَا وَارْتَدُّوا عَنْ الْإِسْلَامِ وَقَتَلُوا رَاعِيَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُؤْمِنًا فَبَعَثَ فِي آثَارِهِمْ فَأُخِذُوا فَقَطَّعَ أَيْدِيَهُمْ وَأَرْجُلَهُمْ وَسَمَلَ أَعْيُنَهُمْقَالَ وَنَزَلَتْ فِيهِمْ آيَةُ الْمُحَارَبَةِ وَهُمْ الَّذِينَ أَخْبَرَ عَنْهُمْ أَنَسُ بْنُ مَالِكٍ الْحَجَّاجَ حِينَ سَأَلَهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah mengabarkan kepadaku [Amru] dari [Sa'id bin Abu Hilal] dari [Abu Az Zinad] dari [Abdullah bin ubaidhullah] -Ahmad berkata; dia adalah Abdullah bin ubaidhullah bin Umar bin Al Khaththab- dari [Ibnu Umar] ia berkata, \"Ada beberapa orang mencuri unta Nabi shallallahu 'alaihi wasallam, mereka murtad dari Islam dan membunuh para pengembala Rasulullah shallallahu 'alaihi wasallam yang telah beriman. Beliau lalu mengirim mata-mata untuk mengikuti jejak mereka, mereka pun ditangkap. Beliau memotong tangan dan kaki, serta mencongkel mata mereka.\" Ibnu Umar melanjutkan, \"Lalu turunlah ayat Al Muharabah (peperangan) berkenaan dengan mereka. itu pulalah yang dikabarkan Anas bin Malik kepada Al Hajjaj saat ia bertanya kepadanya.\""
            },
            {
                "number": 3684,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي اللَّيْثُ بْنُ سَعْدٍ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ أَبِي الزِّنَادِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا قَطَّعَ الَّذِينَ سَرَقُوا لِقَاحَهُ وَسَمَلَ أَعْيُنَهُمْ بِالنَّارِ عَاتَبَهُ اللَّهُ تَعَالَى فِي ذَلِكَ فَأَنْزَلَ اللَّهُ تَعَالَى{ إِنَّمَا جَزَاءُ الَّذِينَ يُحَارِبُونَ اللَّهَ وَرَسُولَهُ وَيَسْعَوْنَ فِي الْأَرْضِ فَسَادًا أَنْ يُقَتَّلُوا أَوْ يُصَلَّبُوا }الْآيَةَحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ قَالَ أَخْبَرَنَا ح و حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ قَالَ كَانَ هَذَا قَبْلَ أَنْ تَنْزِلَ الْحُدُودُ يَعْنِي حَدِيثَ أَنَسٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Amru bin As Sarh] berkata, telah mengabarkan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Al laits bin Sa'd] dari [Muhammad bin 'Ajlan] dari [Abu Az Zinad] berkata, \"Ketika Rasulullah memotong (tangan dan kaki) serta mencongkel mata orang-orang yang mencuri unta miliknya dengan api, Allah Ta'ala mencela perbuatan tersebut. Allah kemudian menurunkan ayat: '(Sesungguhnya pembalasan terhadap orang-orang yang memerangi Allah dan rasul-Nya serta membuat kerusakan di muka bumi, hanyalah mereka dibunuh atau disalib..) '.\" Telah menceritakan kepada kami Muhammad bin Katsir ia berkata; telah mengabarkan kepada kami. (dalam jalur lain disebutkan) Telah menceritakan kepada kami Musa bin Isma'il berkata, telah menceritakan kepada kami Hammam dari Qatadah dari Muhammad bin Sirin ia berkata, \"Ini adalah ketika belum turun syariat hudud, yaitu sebagaimana tersebut dalam hadits Anas.\""
            },
            {
                "number": 3685,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ حَدَّثَنَا عَلِيُّ بْنُ حُسَيْنٍ عَنْ أَبِيهِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ{ إِنَّمَا جَزَاءُ الَّذِينَ يُحَارِبُونَ اللَّهَ وَرَسُولَهُ وَيَسْعَوْنَ فِي الْأَرْضِ فَسَادًا أَنْ يُقَتَّلُوا أَوْ يُصَلَّبُوا أَوْ تُقَطَّعَ أَيْدِيهِمْ وَأَرْجُلُهُمْ مِنْ خِلَافٍ أَوْ يُنْفَوْا مِنْ الْأَرْضِ إِلَى قَوْلِهِ غَفُورٌ رَحِيمٌ }نَزَلَتْ هَذِهِ الْآيَةُ فِي الْمُشْرِكِينَ فَمَنْ تَابَ مِنْهُمْ قَبْلَ أَنْ يُقْدَرَ عَلَيْهِ لَمْ يَمْنَعْهُ ذَلِكَ أَنْ يُقَامَ فِيهِ الْحَدُّ الَّذِي أَصَابَهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Tsabit] berkata, telah menceritakan kepada kami [Ali bin Husain] dari [Bapaknya] dari [Yazid An Nahwi] dari [Ikrimah] dari [Ibnu Abbas] ia berkata berkenaan dengan ayat: '(Sesungguhnya pembalasan terhadap orang-orang yang memerangi Allah dan Rasul-Nya dan membuat kerusakan di muka bumi, hanyalah mereka dibunuh atau disalib, atau dipotong tangan dan kaki mereka dengan bertimbal balik, atau dibuang dari negeri (tempat kediamannya). Hingga firman Allah: '(Allah Maha Pengampun lagi Maha Penyayang) ' ia mengatakan, \"Ayat ini turun kepada orang-orang musyrik, jika salah seorang dari mereka bertaubat sebelum dilaksanakannya (hudud), ia tidak dapat terhindar dari hukuman hudud.\""
            },
            {
                "number": 3686,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ الْهَمْدَانِيُّ قَالَ حَدَّثَنِي ح و حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ قُرَيْشًا أَهَمَّهُمْ شَأْنُ الْمَرْأَةِ الْمَخْزُومِيَّةِ الَّتِي سَرَقَتْ فَقَالُوا مَنْ يُكَلِّمُ فِيهَا يَعْنِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالُوا وَمَنْ يَجْتَرِئُ إِلَّا أُسَامَةُ بْنُ زَيْدٍ حِبُّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَلَّمَهُ أُسَامَةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أُسَامَةُ أَتَشْفَعُ فِي حَدٍّ مِنْ حُدُودِ اللَّهِ ثُمَّ قَامَ فَاخْتَطَبَ فَقَالَ إِنَّمَا هَلَكَ الَّذِينَ مِنْ قَبْلِكُمْ أَنَّهُمْ كَانُوا إِذَا سَرَقَ فِيهِمْ الشَّرِيفُ تَرَكُوهُ وَإِذَا سَرَقَ فِيهِمْ الضَّعِيفُ أَقَامُوا عَلَيْهِ الْحَدَّ وَايْمُ اللَّهِ لَوْ أَنَّ فَاطِمَةَ بِنْتَ مُحَمَّدٍ سَرَقَتْ لَقَطَعْتُ يَدَهَاحَدَّثَنَا عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ ومُحَمَّدُ بْنُ يَحْيَى قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ كَانَتْ امْرَأَةٌ مَخْزُومِيَّةٌ تَسْتَعِيرُ الْمَتَاعَ وَتَجْحَدُهُ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَطْعِ يَدِهَا وَقَصَّ نَحْوَ حَدِيثِ اللَّيْثِ قَالَ فَقَطَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهَا قَالَ أَبُو دَاوُد رَوَى ابْنُ وَهْبٍ هَذَا الْحَدِيثَ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ وَقَالَ فِيهِ كَمَا قَالَ اللَّيْثُ إِنَّ امْرَأَةً سَرَقَتْ فِي عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ الْفَتْحِ وَرَوَاهُ اللَّيْثُ عَنْ يُونُسَ عَنْ ابْنِ شِهَابٍ بِإِسْنَادِهِ فَقَالَ اسْتَعَارَتْ امْرَأَةٌ وَرَوَى مَسْعُودُ بْنُ الْأَسْوَدِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذَا الْخَبَرِ قَالَ سَرَقَتْ قَطِيفَةً مِنْ بَيْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَوَاهُ أَبُو الزُّبَيْرِ عَنْ جَابِرٍ أَنَّ امْرَأَةً سَرَقَتْ فَعَاذَتْ بِزَيْنَبَ بِنْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Khalid bin Mauhab Al Hambdani] ia berkata; telah menceritakan kepadaku. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Qutaibah bin Sa'id Ats Tsaqafi] berkata, telah menceritakan kepada kami [Al laits] dari [Ibnu Syihab] dari [Urwah] dari ['Aisyah radliallahu 'anha] berkata, \"Bangsa Quraisy pernah dikagetkan dengan kasus pencurian seorang wanita Makhzumiyah. Orang-orang berkata, \"Siapakah yang akan memintakan amnesti kepada Rasulullah shallallahu 'alaihi wasallam?\" sebagian yang lain menjawab, \"Tidak ada yang berani melakukan hal itu selain Usamah bin Zaid, kekasih Rasulullah shallallahu 'alaihi wasallam?\" Usamah kemudian menyampaikan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, hingga beliau pun bersabda: \"Wahai Usamah! Apakah engkau akan meminta keringanan dalam masalah hukum had Allah? Beliau kemudian berdiri dan berkhutbah: \"Hanyasanya orang-orang sebelum kalian binasa karena jika ada orang terhormat dari mereka mencuri, mereka tidak menegakkan had. Tetapi jika ada orang rendahan yang mencuri, mereka menegakkan had atasnya. Demi Allah, sekiranya Fatimah binti Muhammad mencuri, sungguh aku akan memotong tangannya.\" Telah menceritakan kepada kami [Abbas bin Abdul Azhim] dan [Muhammad bin Yahya] keduanya berkata; telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Urwah] dari ['Aisyah radliallahu 'anha] ia berkata, \"Pernah seorang wanita Makhzumiyah meminjam barang, kemudian ia mengingkari bahwa dirinya pernah meminjamnya. Maka Nabi shallallahu 'alaihi wasallam memerintahkan untuk memotong tangannya. Lalu ia mengisahkan sebagaimana dalam hadits Al Laits. Ia (perawi) berkata, \"Nabi shallallahu 'alaihi wasallam kemudian memotong tangan wanita tersebut.\" Abu Dawud berkata, \" [Ibnu Wahb] meriwayatkan hadits ini dari [Yunus], dari [Az Zuhri], dalam hadits tersebut ia menyebutkan sebagaimana yang pernah disebutkan oleh Al Laits, \"Seorang wanita mencuri pada masa Nabi shallallahu 'alaihi wasallam, yaitu ketika terjadinya penaklukan kota Makkah.\" [Al Laits] juga meriwayatkannya dari [Yunus], dari [Ibnu Syihab] dengan sanadnya. Ia menyebutkan, \"Seorang wanita meminjam..\" Mas'ud Ibnul Aswad juga meriwayatkan dari Nabi shallallahu 'alaihi wasallam seperti hadits tersebut. Ia menyebutkan, \"Wanita tersebut mencuri kain beludru dari rumah Rasulullah shallallahu 'alaihi wasallam.\" Dan [Abu Az Zubair] juga meriwayatkannya dari [Jabir]; \"bahwasanya ada seorang wanita yang mencuri, maka ia berlindung kepada Zainab anak Rasulullah Shallahu 'Alaihi Wasallam.\""
            },
            {
                "number": 3687,
                "arab": "حَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ وَمُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ قَالَا أَخْبَرَنَا ابْنُ أَبِي فُدَيْكٍ عَنْ عَبْدِ الْمَلِكِ بْنِ زَيْدٍ نَسَبَهُ جَعْفَرٌ إِلَى سَعِيدِ بْنِ زَيْدِ بْنِ عَمْرِو بْنِ نُفَيْلٍ عَنْ مُحَمَّدِ بْنِ أَبِي بَكْرٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقِيلُوا ذَوِي الْهَيْئَاتِ عَثَرَاتِهِمْ إِلَّا الْحُدُودَ",
                "id": "Telah menceritakan kepada kami [Ja'far bin Musafir] dan [Muhammad bin Sulaiman Al Anbari] keduanya berkata; telah mengabarkan kepada kami [Ibnu Abu Fudaik] dari [Abdul Malik bin Zaid]. Ja'far menyandarkannya kepada Sa'id bin Zaid bin Amru bin Nufail dari [Muhammad bin Abu Bakr] dari [Amrah] dari ['Aisyah radliallahu 'anha] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maafkanlah kekeliruan (tergelincirnya) orang-orang yang baik, kecuali dalam masalah hukum had.\""
            },
            {
                "number": 3688,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ قَالَ سَمِعْتُ ابْنَ جُرَيْجٍ يُحَدِّثُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَعَافُّوا الْحُدُودَ فِيمَا بَيْنَكُمْ فَمَا بَلَغَنِي مِنْ حَدٍّ فَقَدْ وَجَبَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Dawud Al Mahri] berkata, telah mengabarkan kepada kami [Ibnu Wahb] ia berkata; Aku mendengar [Ibnu Juraij] menceritakan dari [Amru bin Syu'aib] dari [Bapaknya] dari [Abdullah bin Amru bin Al Ash] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaklah kalian saling memaafkan dalam masalah hukuman had yang terjadi di antara kalian, sebab jika had telah sampai kepadaku maka wajib untuk dilaksanakan.\""
            },
            {
                "number": 3689,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ يَزِيدَ بْنِ نُعَيْمٍ عَنْ أَبِيهِأَنَّ مَاعِزًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقَرَّ عِنْدَهُ أَرْبَعَ مَرَّاتٍ فَأَمَرَ بِرَجْمِهِ وَقَالَ لِهَزَّالٍ لَوْ سَتَرْتَهُ بِثَوْبِكَ كَانَ خَيْرًا لَكَحَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا يَحْيَى عَنْ ابْنِ الْمُنْكَدِرِ أَنْ هَزَّالًا أَمَرَ مَاعِزًا أَنْ يَأْتِيَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيُخْبِرَهُ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Sufyan] dari [Zaid bin Aslam] dari [Yazid bin Nu'aim] dari [Bapaknya] ia berkata, \"Ma'iz datang menemui Nabi shallallahu 'alaihi wasallam dan mengakui -sebanyak empat kali- bahwa dirinya telah berzina. Beliau lalu memerintahkan untuk merajamnya. Beliau bersabda kepada Hazzal (bapaknya Nu'aim): \"Sekiranya engkau menutupinya dengan kainmu (tidak menyampaikan), sungguh itu akan lebih baik bagi kamu.\" Telah menceritakan kepada kami [Muhammad bin Ubaid] berkata, telah menceritakan kepada kami [Hammad bin Zaid] berkata, telah menceritakan kepada kami [Yahya] dari [Ibnul Munkadir] bahwa [Hazzal] menyuruh Ma'iz untuk mendatangi nabi shallallahu 'alaihi wasallam dan mengabarkan kepada beliau (bahwa ia pernah berzina).\""
            },
            {
                "number": 3690,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا الْفِّرْيَابِيُّ حَدَّثَنَا إِسْرَائِيلُ حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِأَنَّ امْرَأَةً خَرَجَتْ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُرِيدُ الصَّلَاةَ فَتَلَقَّاهَا رَجُلٌ فَتَجَلَّلَهَا فَقَضَى حَاجَتَهُ مِنْهَا فَصَاحَتْ وَانْطَلَقَ فَمَرَّ عَلَيْهَا رَجُلٌ فَقَالَتْ إِنَّ ذَاكَ فَعَلَ بِي كَذَا وَكَذَا وَمَرَّتْ عِصَابَةٌ مِنْ الْمُهَاجِرِينَ فَقَالَتْ إِنَّ ذَلِكَ الرَّجُلَ فَعَلَ بِي كَذَا وَكَذَا فَانْطَلَقُوا فَأَخَذُوا الرَّجُلَ الَّذِي ظَنَّتْ أَنَّهُ وَقَعَ عَلَيْهَا فَأَتَوْهَا بِهِ فَقَالَتْ نَعَمْ هُوَ هَذَا فَأَتَوْا بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا أَمَرَ بِهِ قَامَ صَاحِبُهَا الَّذِي وَقَعَ عَلَيْهَا فَقَالَ يَا رَسُولَ اللَّهِ أَنَا صَاحِبُهَا فَقَالَ لَهَا اذْهَبِي فَقَدْ غَفَرَ اللَّهُ لَكِ وَقَالَ لِلرَّجُلِ قَوْلًا حَسَنًاقَالَ أَبُو دَاوُد يَعْنِي الرَّجُلَ الْمَأْخُوذَ وَقَالَ لِلرَّجُلِ الَّذِي وَقَعَ عَلَيْهَا ارْجُمُوهُ فَقَالَ لَقَدْ تَابَ تَوْبَةً لَوْ تَابَهَا أَهْلُ الْمَدِينَةِ لَقُبِلَ مِنْهُمْ قَالَ أَبُو دَاوُد رَوَاهُ أَسْبَاطُ بْنُ نَصْرٍ أَيْضًا عَنْ سِمَاكٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] berkata, telah menceritakan kepada kami [Al Faryabi] berkata telah menceritakan kepada kami [Isra'il] berkata, telah menceritakan kepada kami [Simak bin Harb] dari [Alqamah bin Wail] dari [bapaknya] ia berkata, \"Pada masa Nabi shallallahu 'alaihi wasallam ada seorang wanita keluar rumah untuk melaksanakan sholat berjamaah. Lalu, ia bertemu dengan seorang laki-laki yang kemudian memaksanya untuk melakukan hubungan intim, laki-laki itu akhirnya memerkosanya sementara ia hanya bisa berteriak. Setelah puas laki-laki itu kabur melarikan diri. Kemudian lewatlah seorang laki-laki di hadapannya, wanita itu berkata, \"Orang itu telah memperlakukan aku begini dan begini (memperkosa)! Pada saat yang bersamaan lewat juga sekelompok orang dari Muhajirin, wanita itu berkata, \"laki-laki itu telah melakukan begini dan begini kepadaku (memperkosa).\" Rombongan itu lalu mengejar laki-laki yang disangka oleh wanita itu telah memperkosanya. Mereka kemudian membawanya ke hadapan wanita itu, wanita berkata, \"Benar, laki-laki inilah yang telah memperkosaku! ' Mereka kemudian membawa laki-laki malang itu kepada Nabi shallallahu 'alaihi wasallam, maka ketika beliau memerintahkan untuk menghukum (rajam) laki-laki tersebut, laki-laki yang memperkosa wanita itu berdiri dan berkata, \"Wahai Rasulullah, akulah yang telah memperkosanya.\" Beliau bersabda kepada wanita itu: \"Pergilah, semoga Allah mengampuni kekeliruanmu (salah tuduh).\" Beliau juga mengatakan ucapan yang baik kepada laki-laki itu.\" Abu Dawud berkata, \"maksudnya laki-laki yang diambil karena salah tangkap. Dan Rasulullah berkata untuk si pelaku: \"Rajamlah ia.\" Kemudian beliau melanjutkan: \"Dia telah bertaubat, dan sekiranya taubatnya dibagikan kepada seluruh penduduk Madinah, niscaya taubatnya akan diterima.\" Abu Dawud berkata, \" [Asbath bin Nashr] juga meriwayatkannya dari [Simak].\""
            },
            {
                "number": 3691,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَبِي الْمُنْذِرِ مَوْلَى أَبِي ذَرٍّ عَنْ أَبِي أُمَيَّةَ الْمَخْزُومِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِلِصٍّ قَدْ اعْتَرَفَ اعْتِرَافًا وَلَمْ يُوجَدْ مَعَهُ مَتَاعٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا إِخَالُكَ سَرَقْتَ قَالَ بَلَى فَأَعَادَ عَلَيْهِ مَرَّتَيْنِ أَوْ ثَلَاثًا فَأَمَرَ بِهِ فَقُطِعَ وَجِيءَ بِهِ فَقَالَ اسْتَغْفِرْ اللَّهَ وَتُبْ إِلَيْهِ فَقَالَ أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فَقَالَ اللَّهُمَّ تُبْ عَلَيْهِ ثَلَاثًاقَالَ أَبُو دَاوُد رَوَاهُ عَمْرُو بْنُ عَاصِمٍ عَنْ هَمَّامٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ قَالَ عَنْ أَبِي أُمَيَّةَ رَجُلٍ مِنْ الْأَنْصَارِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] dari [Ishaq bin Abdullah bin Abu thalhah] dari [Abu Al Mundzir] -mantan budak (yang telah dimerdekakan oleh) Abu Dzar- dari [Abu Umayyah Al Makhzumi] berkata, \"Pernah dihadapkan kepada Rasulullah shallallahu 'alaihi wasallam seorang pencuri yang telah mengakui kesalahannya, namun barang yang dicurinya tidak lagi bersamanya. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Benarkah kamu telah mencuri?\" Ia menjawab, \"Benar.\" Beliau ulangi pertanyaan itu dua atau tiga kali. Beliau lalu memerintahkan untuk memotong tangannya, setelah itu ia dihadapkan lagi kepada beliau. Beliau bersabda: \"Mintalah ampun kepada Allah, bertaubatlah kepada-Nya.\" Laki-laki itu lalu berkata, \"Aku minta ampun kepada Allah dan bertaubat kepada-Nya.\" Beliau lalu berdo'a: \"Ya Allah, ampunilah dia.\" do'a itu beliau ucapkan hingga tiga kali. Abu Dawud berkata, \" [Amru bin Ashim] meriwayatkannya dari [Hammam], dari [Ishaq bin Abdullah], ia berkata; dari [Abu Umayyah] -lelaki dari Anshar-, dari Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3692,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ حَدَّثَنَا عُمَرُ بْنُ عَبْدِ الْوَاحِدِ عَنْ الْأَوْزَاعِيِّ قَالَ حَدَّثَنِي أَبُو عَمَّارٍ حَدَّثَنِي أَبُو أُمَامَةَأَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أَصَبْتُ حَدًّا فَأَقِمْهُ عَلَيَّ قَالَ تَوَضَّأْتَ حِينَ أَقْبَلْتَ قَالَ نَعَمْ قَالَ هَلْ صَلَّيْتَ مَعَنَا حِينَ صَلَّيْنَا قَالَ نَعَمْ قَالَ اذْهَبْ فَإِنَّ اللَّهَ تَعَالَى قَدْ عَفَا عَنْكَ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Khalid] berkata, telah menceritakan kepada kami [Umar bin Abdul Wahid] dari [Al Auza'i] ia berkata; telah menceritakan kepadaku [Abu Ammar] berkata, telah menceritakan kepadaku [Abu Umamah] bahwa seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, aku telah melakukan dosa yang wajib atasnya hukuman had, maka hukumlah aku!\" beliau balik bertanya: \"Apakah engkau berwudhu ketika datang kemari?\" ia menjawab, \"Ya.\" beliau bertanya lagi: \"Ketika kami sholat apakah kamu juga ikut sholat bersama kami?\" ia menjawab, \"Ya.\" beliau bersabda: \"Pergilah sesungguhnya Allah telah mengampuni kamu.\""
            },
            {
                "number": 3693,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ حَدَّثَنَا بَقِيَّةُ حَدَّثَنَا صَفْوَانُ حَدَّثَنَا أَزْهَرُ بْنُ عَبْدِ اللَّهِ الْحَرَازِيُّأَنَّ قَوْمًا مِنْ الْكَلَاعِيِّينَ سُرِقَ لَهُمْ مَتَاعٌ فَاتَّهَمُوا أُنَاسًا مِنْ الْحَاكَةِ فَأَتَوْا النُّعْمَانَ بْنَ بَشِيرٍ صَاحِبَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَبَسَهُمْ أَيَّامًا ثُمَّ خَلَّى سَبِيلَهُمْ فَأَتَوْا النُّعْمَانَ فَقَالُوا خَلَّيْتَ سَبِيلَهُمْ بِغَيْرِ ضَرْبٍ وَلَا امْتِحَانٍ فَقَالَ النُّعْمَانُ مَا شِئْتُمْ إِنْ شِئْتُمْ أَنْ أَضْرِبَهُمْ فَإِنْ خَرَجَ مَتَاعُكُمْ فَذَاكَ وَإِلَّا أَخَذْتُ مِنْ ظُهُورِكُمْ مِثْلَ مَا أَخَذْتُ مِنْ ظُهُورِهِمْ فَقَالُوا هَذَا حُكْمُكَ فَقَالَ هَذَا حُكْمُ اللَّهِ وَحُكْمُ رَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ أَبُو دَاوُد إِنَّمَا أَرْهَبَهُمْ بِهَذَا الْقَوْلِ أَيْ لَا يَجِبُ الضَّرْبُ إِلَّا بَعْدَ الِاعْتِرَافِ",
                "id": "Telah menceritakan kepada kami [Abdul Wahhab bin Najdah] berkata, telah menceritakan kepada kami [Baqiyyah] berkata, telah menceritakan kepada kami [Shafwan] berkata, telah menceritakan kepada kami [Azhar bin Abdullah Al Harazi] ia berkata, \"Barang-barang milik kaum Kala'iyin dicuri, lalu mereka menyakini bahwa pelakunya adalah para tukang tenun. Mereka kemudian mendatangi [Nu'man bin Basyir], salah seorang sahabat Nabi shallallahu 'alaihi wasallam. Nu'man pun menahan para tukang tenun tersebut selama beberapa hari kemudian melepaskannya lagi. Orang-orang dari Kala'iyin itu lalu mendatangi Nu'man dan berkata, \"Kenapa engkau bebaskan mereka tanpa engkau beri pukulan atau hukuman!\" Nu'man menjawab, \"Itu terserah kalian, jika kalian ingin, dan kalau benar barang curian itu ada (terbukti) maka aku akan pukul mereka. Namun jika tidak, maka aku akan memukul punggung kalian sebagaimana aku menghukum mereka.\" Orang-orang itu berkata, \"Beginikah cara kamu mengadili!\" Nu'man menjawab, \"Ini adalah hukum Allah dan hukum Rasul-Nya shallallahu 'alaihi wasallam.\" Abu Dawud berkata, \"Nu'man menakut-nakuti mereka dengan ucapannya tersebut, karena hukuman tidak bisa diterapkan sehingga adanya pengakuan dari pihak tertuduh.\""
            },
            {
                "number": 3694,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ قَالَ سَمِعْتُهُ مِنْهُ عَنْ عَمْرَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْطَعُ فِي رُبُعِ دِينَارٍ فَصَاعِدًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Hanbal] berkata, telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] ia berkata; Aku mendengar hadits itu darinya, dari [Amrah] dari ['Aisyah radliallahu 'anha] ia berkata, \"Nabi shallallahu 'alaihi wasallam memotong tangan pencuri, jika barang yang dicuri senilai seperempat dinar atau lebih.\""
            },
            {
                "number": 3695,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ وَوَهْبُ بْنُ بَيَانٍ قَالَا حَدَّثَنَا ح و حَدَّثَنَا ابْنُ السَّرْحِ قَالَ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةً وَعَمْرَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تُقْطَعُ يَدُ السَّارِقِ فِي رُبُعِ دِينَارٍ فَصَاعِدًا قَالَ أَحْمَدُ بْنُ صَالِحٍ الْقَطْعُ فِي رُبْعِ دِينَارٍ فَصَاعِدًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] dan [Wahb bin Bayan] keduanya berkata; telah menceritakan kepada kami. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu As Sarh] ia berkata; telah mengabarkan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] dari [Urwah] dan [Amrah] dari ['Aisyah radliallahu 'anha] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Dipotongnya tangan pencuri jika ia mengambil seperempat dinar atau lebih.\" Ahmad bin Shalih berkata, \"Pemotongan itu jika telah sampai kadar seperempat dinar atau lebih.\""
            },
            {
                "number": 3696,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ حَدَّثَنَا مَالِكٌ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطَعَ فِي مِجَنٍّ ثَمَنُهُ ثَلَاثَةُ دَرَاهِمَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] berkata, telah menceritakan kepada kami [Malik] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memotong (tangan pencuri) senilai baju perang yang harganya tiga dirham.\""
            },
            {
                "number": 3697,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي إِسْمَعِيلُ بْنُ أُمَيَّةَ أَنَّ نَافِعًا مَوْلَى عَبْدِ اللَّهِ بْنِ عُمَرَ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ حَدَّثَهُمْأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَطَعَ يَدَ رَجُلٍ سَرَقَ تُرْسًا مِنْ صُفَّةِ النِّسَاءِ ثَمَنُهُ ثَلَاثَةُ دَرَاهِمَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ibnu Juraij] berkata, telah mengabarkan kepadaku [Isma'il bin Umayyah] bahwa [nafi'] -mantan budak (yang telah dimerdekakan oleh) Abdullah bin Umar- menceritakan kepadanya, bahwa [Abdullah bin Umar] menceritakan kepadanya, bahwa Nabi shallallahu 'alaihi wasallam pernah memotong tangan seorang laki-laki yang mencuri tameng (dari tempat sholatnya wanita) senilai tiga dirham.\""
            },
            {
                "number": 3698,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ أَبِي السَّرِيِّ الْعَسْقَلَانِيُّ وَهَذَا لَفْظُهُ وَهُوَ أَتَمُّ قَالَا حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَطَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَ رَجُلٍ فِي مِجَنٍّ قِيمَتُهُ دِينَارٌ أَوْ عَشَرَةُ دَرَاهِمَقَالَ أَبُو دَاوُد رَوَاهُ مُحَمَّدُ بْنُ سَلَمَةَ وَسَعْدَانُ بْنُ يَحْيَى عَنْ ابْنِ إِسْحَقَ بِإِسْنَادِهِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Muhammad bin Abu As Sari Al Asqalani] -ini adalah lafadz darinya, dan ini juga lebih lengkap- dari [Ibnu Numair] dari [Muhammad bin Ishaq] dari [Ayyub bin Musa] dari [Atha] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memotong tangan seorang laki-laki karena mencuri baju perang yang harganya satu dinar, atau sepuluh dirham.\" Abu Dawud berkata, \" [Muhammad bin Salamah] dan [Sa'dan bin Yahya] juga meriwayatkannya dari [Ibnu Ishaq] dengan sanadnya.\""
            },
            {
                "number": 3699,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَأَنَّ عَبْدًا سَرَقَ وَدِيًّا مِنْ حَائِطِ رَجُلٍ فَغَرَسَهُ فِي حَائِطِ سَيِّدِهِ فَخَرَجَ صَاحِبُ الْوَدِيِّ يَلْتَمِسُ وَدِيَّهُ فَوَجَدَهُ فَاسْتَعْدَى عَلَى الْعَبْدِ مَرْوَانَ بْنَ الْحَكَمِ وَهُوَ أَمِيرُ الْمَدِينَةِ يَوْمَئِذٍ فَسَجَنَ مَرْوَانُ الْعَبْدَ وَأَرَادَ قَطْعَ يَدِهِ فَانْطَلَقَ سَيِّدُ الْعَبْدِ إِلَى رَافِعِ بْنِ خَدِيجٍ فَسَأَلَهُ عَنْ ذَلِكَ فَأَخْبَرَهُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ فَقَالَ الرَّجُلُ إِنَّ مَرْوَانَ أَخَذَ غُلَامِي وَهُوَ يُرِيدُ قَطْعَ يَدِهِ وَأَنَا أُحِبُّ أَنْ تَمْشِيَ مَعِي إِلَيْهِ فَتُخْبِرَهُ بِالَّذِي سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَشَى مَعَهُ رَافِعُ بْنُ خَدِيجٍ حَتَّى أَتَى مَرْوَانَ بْنَ الْحَكَمِ فَقَالَ لَهُ رَافِعٌ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا قَطْعَ فِي ثَمَرٍ وَلَا كَثَرٍ فَأَمَرَ مَرْوَانُ بِالْعَبْدِ فَأُرْسِلَقَالَ أَبُو دَاوُد الْكَثَرُ الْجُمَّارُ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا يَحْيَى عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ بِهَذَا الْحَدِيثِ قَالَ فَجَلَدَهُ مَرْوَانُ جَلَدَاتٍ وَخَلَّى سَبِيلَهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik bin Anas] dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] berkata, \"Seorang budak mencuri pohon kurma kecil dari kebun seseorang, lalu ia menanamnya di kebun milik tuannya. Pemilik pohon itu lalu keluar mencari pohonnya yang telah hilang. Kemudian ia mendapatkannya tengah berada (bersama budak tersebut). Lantas ia membawa budak itu kepada Marwan Ibnul Hakam, gubernur Madinah saat itu. Marwan kemudian memenjarakan budak itu dan ingin memotong tangannya. Maka, majikan budak tersebut berangkat menemui [Rafi' bin Khadij]. Ia bertanya kepadanya tentang hukum dari kasus tersebut. Rafi' kemudian mengabarkan kepadanya, bahwa ia pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada hukuman potong tangan karena sebiji kurma atau mayang kurma.\" Laki-laki (majikan budak) itu berkata, \"Marwan telah menahan budak milikku, dan ia ingin memotong tangannya. Maka aku berharap engkau bersedia bersamaku menemui Marwan hingga engkau dapat mengabarkan apa yang engkau dengar dari Rasulullah shallallahu 'alaihi wasallam.\" Rafi' bin Khadij kemudian berangkat menemui Marwan bersama majikan budak tersebut, ketika telah tiba Rafi' berkata kepada Marwan, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada hukuman potong tangan karena sebiji kurma atau mayang kurma.\" Setelah mendengar Rafi', Marwan kemudian membebaskan budak tersebut.\" Abu Dawud berkata, \"Yang dimaksud dengan Al Katsar (mayang kurma) adalah bagian pada pohon kurma yang dapat dimakan.\" Telah menceritakan kepada kami [Muhammad bin Ubaid] berkata, telah menceritakan kepada kami [Hammad] berkata, telah menceritakan kepada kami [Yahya] dari [Muhammad bin Yahya bin Habban] dengan hadits yang sama. Ia berkata, \"Marwan kemudian mencambuknya dengan beberapa kali cambukan, setelah itu melepasnya.\""
            },
            {
                "number": 3700,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ سُئِلَ عَنْ الثَّمَرِ الْمُعَلَّقِ فَقَالَ مَنْ أَصَابَ بِفِيهِ مِنْ ذِي حَاجَةٍ غَيْرَ مُتَّخِذٍ خُبْنَةً فَلَا شَيْءَ عَلَيْهِ وَمَنْ خَرَجَ بِشَيْءٍ مِنْهُ فَعَلَيْهِ غَرَامَةُ مِثْلَيْهِ وَالْعُقُوبَةُ وَمَنْ سَرَقَ مِنْهُ شَيْئًا بَعْدَ أَنْ يُؤْوِيَهُ الْجَرِينُ فَبَلَغَ ثَمَنَ الْمِجَنِّ فَعَلَيْهِ الْقَطْعُ وَمَنْ سَرَقَ دُونَ ذَلِكَ فَعَلَيْهِ غَرَامَةُ مِثْلَيْهِ وَالْعُقُوبَةُقَالَ أَبُو دَاوُد الْجَرِينُ الْجُوخَانُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Al Laits] dari [Ibnu 'Ajlan] dari [Amru bin Syu'aib] dari [Bapaknya] dari kakeknya [Abdullah bin Amru bin Al Ash] dari Rasulullah shallallahu 'alaihi wasallam, bahwasanya beliau pernah ditanya tentang kurma yang masih menggantung di pohon? Maka beliau menjawab: \"Barangsiapa makan darinya karena kebutuhan, tidak menyembunyikan (buah yang lain), maka ia tidak berdosa. Barangsiapa keluar dari (kebun) tersebut dengan mengambil sesuatu darinya, maka ia harus mengganti dua kali lipat beserta hukuman tambahan. Barangsiapa mencuri sesuatu darinya setelah dikumpulkan dalam keranjang dan senilai tameng, maka baginya hukuman potong tangan. Dan barangsiapa mencuri sesuatu yang kurang dari nilai tersebut, maka harus mengganti dua kali lipat beserta hukuman tambahan.\" Abu Dawud berkata, \"Al Jarin adalah keranjang kurma.\""
            },
            {
                "number": 3701,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ قَالَ أَبُو الزُّبَيْرِ قَالَ جَابِرُ بْنُ عَبْدِ اللَّهِقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ عَلَى الْمُنْتَهِبِ قَطْعٌ وَمَنْ انْتَهَبَ نُهْبَةً مَشْهُورَةً فَلَيْسَ مِنَّا",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] berkata, telah mengabarkan kepada kami [Muhammad bin Bakr] berkata, telah menceritakan kepada kami [Ibnu Juraij] ia berkata; [Abu Az Zubair] berkata; [Jabir bin Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada hukuman potong tangan bagi perampas, dan barangsiapa merampas secara terang-terangan maka ia bukan dari golongan kami.\""
            },
            {
                "number": 3702,
                "arab": "وَبِهَذَا الْإِسْنَادِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ عَلَى الْخَائِنِ قَطْعٌحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ عَنْ ابْنِ جُرَيْجٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ زَادَ وَلَا عَلَى الْمُخْتَلِسِ قَطْعٌ قَالَ أَبُو دَاوُد هَذَانِ الْحَدِيثَانِ لَمْ يَسْمَعْهُمَا ابْنُ جُرَيْجٍ مِنْ أَبِي الزُّبَيْرِ وَبَلَغَنِي عَنْ أَحْمَدَ بْنِ حَنْبَلٍ أَنَّهُ قَالَ إِنَّمَا سَمِعَهُمَا ابْنُ جُرَيْجٍ مَنْ يَاسِينَ الزَّيَّاتِ قَالَ أَبُو دَاوُد وَقَدْ رَوَاهُمَا الْمُغِيرَةُ بْنُ مُسْلِمٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Dengan sanad ini pula ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penghianat tidak mendapat hukuman potong tangan.\" Telah menceritakan kepada kami [Nashr bin Ali] berkata, telah mengabarkan kepada kami [Isa bin Yunus] dari [ibnu Juraij] dari [Abu Az Zubair] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam seperti dalam hadits tersebut. Namun ia menambahkan, \"Dan bagi orang yang mencopet (korupsi) juga tidak ada hukuman potong tangan.\" Abu Dawud berkata, \"Dua hadits ini belum pernah didengar oleh Ibnu Juraij dari Abu Az Zubair. Telah sampai kepadaku dari jalur Ahmad, bahwa ia berkata, \"Ibnu Juraij mendengar kedua hadits tersebut justru dari Yasin bin Az Zayyat.\" Abu Dawud melanjutkan, \" [Al Mughirah bin Muslim] juga telah meriwayatkannya dari [Abu Az Zubair], dari [Jabir], dari Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3703,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا عَمْرُو بْنُ حَمَّادِ بْنِ طَلْحَةَ حَدَّثَنَا أَسْبَاطٌ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ حُمَيْدِ ابْنِ أُخْتِ صَفْوَانَ عَنْ صَفْوَانَ بْنِ أُمَيَّةَ قَالَكُنْتُ نَائِمًا فِي الْمَسْجِدِ عَلَيَّ خَمِيصَةٌ لِي ثَمَنُ ثَلَاثِينَ دِرْهَمًا فَجَاءَ رَجُلٌ فَاخْتَلَسَهَا مِنِّي فَأُخِذَ الرَّجُلُ فَأُتِيَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِهِ لِيُقْطَعَ قَالَ فَأَتَيْتُهُ فَقُلْتُ أَتَقْطَعُهُ مِنْ أَجْلِ ثَلَاثِينَ دِرْهَمًا أَنَا أَبِيعُهُ وَأُنْسِئُهُ ثَمَنَهَا قَالَ فَهَلَّا كَانَ هَذَا قَبْلَ أَنْ تَأْتِيَنِي بِهِقَالَ أَبُو دَاوُد وَرَوَاهُ زَائِدَةُ عَنْ سِمَاكٍ عَنْ جُعَيْدِ بْنِ حُجَيْرٍ قَالَ نَامَ صَفْوَانُ وَرَوَاهُ مُجَاهِدٌ وَطَاوُسٌ أَنَّهُ كَانَ نَائِمًا فَجَاءَ سَارِقٌ فَسَرَقَ خَمِيصَةً مِنْ تَحْتِ رَأْسِهِ وَرَوَاهُ أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ قَالَ فَاسْتَلَّهُ مِنْ تَحْتِ رَأْسِهِ فَاسْتَيْقَظَ فَصَاحَ بِهِ فَأُخِذَ وَرَوَاهُ الزُّهْرِيُّ عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ قَالَ فَنَامَ فِي الْمَسْجِدِ وَتَوَسَّدَ رِدَاءَهُ فَجَاءَ سَارِقٌ فَأَخَذَ رِدَاءَهُ فَأُخِذَ السَّارِقُ فَجِيءَ بِهِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] berkata, telah menceritakan kepada kami [Amru bin Hammad bin Thalhah] berkata, telah menceritakan kepada kami [Asbath] dari [Simak bin Harb] dari [Humaid bin Ukhti Shafwan] dari [Shafwan bin Umayyah] ia berkata, \"Aku tidur di dalam masjid dengan berselimut kain seharga tiga puluh dirham. Lalu datang seorang laki-laki dan mencuri kain tersebut dariku. laki-laki itu tertangkap dan dibawa ke hadapan Rasulullah shallallahu 'alaihi wasallam. Beliau lantas memerintahkan untuk memotong tangannya. Aku mendatangi beliau dan bertanya, \"Apakah engkau akan memotongnya hanya karena tiga puluh dirham? Padahal bisa saja aku jual kain itu dan pembayarannya ditangguhkan?\" Beliau bersabda: \"kenapa hal tersebut tidak kamu lakukan sebelum kamu membawanya kepadaku?\" Abu Dawud berkata, \"Hadits ini juga diriwayatkan oleh [Zaidah] dari [Simak], dari [Ju'aid bin hujair], ia berkata, \" [Shafwan] tidur…\" [Mujahid] dan [Thawus] juga meriwayatkan, bahwasanya Shafwan tertidur, lalu datang seorang pencuri dan mengambil kain dari bahwa kepalanya.\" [Abu Salamah bin 'Abdurrahman] juga meriwayatkan, ia berkata, \"Maling itu mengambilnya dari bawah kepalanya, tetapi Shafwan terbangun dan berteriak sehingga maling itu tertangkap.\" [Az Zuhri] meriwayatkannya dari [Shafwan bin Abdullah], ia berkata, \"Shafwan tidur di masjid, dan ia menjadikan kain selendangnya sebagai bantal. Lalu datang maling mengambil selendangnya tersebut, tetapi maling itu tertangkap dan dibawa ke hadapan Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3704,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ وَمَخْلَدُ بْنُ خَالِدٍ الْمَعْنَى قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ قَالَ مَخْلَدٌ عَنْ مَعْمَرٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ امْرَأَةً مَخْزُومِيَّةً كَانَتْ تَسْتَعِيرُ الْمَتَاعَ فَتَجْحَدُهُ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَا فَقُطِعَتْ يَدُهَاقَالَ أَبُو دَاوُد رَوَاهُ جُوَيْرِيَةُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَوْ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ زَادَ فِيهِ وَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ خَطِيبًا فَقَالَ هَلْ مِنْ امْرَأَةٍ تَائِبَةٍ إِلَى اللَّهِ عَزَّ وَجَلَّ وَرَسُولِهِ ثَلَاثَ مَرَّاتٍ وَتِلْكَ شَاهِدَةٌ فَلَمْ تَقُمْ وَلَمْ تَتَكَلَّمْ وَرَوَاهُ ابْنُ غَنَجٍ عَنْ نَافِعٍ عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ قَالَ فِيهِ فَشَهِدَ عَلَيْهَا",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] dan [Makhlad bin Khalid] secara makna, keduanya berkata; telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] berkata; [Makhlad] berkata dari [Ma'mar] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] berkata, \"Seorang wanita Makhzumiyah meminjam suatu barang kemudian mengingkarinya. Nabi shallallahu 'alaihi wasallam lalu memerintahkan untuk memotong tangannya.\" Abu Dawud berkata, \"Hadits ini diriwayatkan oleh [Juwairiyah] dari [Nafi'], dari [Ibnu Umar]. Atau, dari [Shafiyah binti Abu Ubaid]. Dalam riwayat tersebut ditambahkan, bahwa Nabi shallallahu 'alaihi wasallam berdiri khutbah, beliau bersabda: \"Apakah ada seorang wanita yang akan bertaubat kepada Allah Azza Wa Jalla dan Rasul-Nya?.\" Beliau ulangi hingga tiga kali. Wanita (pencuri) itu juga hadir, namun ia enggan untuk berdiri atau berkata-kata.\" [Ibnu Ghanaj] meriwayatkan hadits itu dari [Nafi'], dari [Shafiyah binti Abu Ubaid], dalam hadits itu ia mengatakan, \"Nabi lalu membuat persaksian atas wanita tersebut.\""
            },
            {
                "number": 3705,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا أَبُو صَالِحٍ عَنْ اللَّيْثِ قَالَ حَدَّثَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ كَانَ عُرْوَةُ يُحَدِّثُ أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْاسْتَعَارَتْ امْرَأَةٌ تَعْنِي حُلِيًّا عَلَى أَلْسِنَةِ أُنَاسٍ يُعْرَفُونَ وَلَا تُعْرَفُ هِيَ فَبَاعَتْهُ فَأُخِذَتْ فَأُتِيَ بِهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِقَطْعِ يَدِهَا وَهِيَ الَّتِي شَفَعَ فِيهَا أُسَامَةُ بْنُ زَيْدٍ وَقَالَ فِيهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا قَالَحَدَّثَنَا عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ وَمُحَمَّدُ بْنُ يَحْيَى قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْ كَانَتْ امْرَأَةً مَخْزُومِيَّةً تَسْتَعِيرُ الْمَتَاعَ وَتَجْحَدُهُ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَطْعِ يَدِهَا وَقَصَّ نَحْوَ حَدِيثِ قُتَيْبَةَ عَنْ اللَّيْثِ عَنْ ابْنِ شِهَابٍ زَادَ فَقَطَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin faris] berkata, telah menceritakan kepada kami [Abu Shalih] dari [Al Laits] ia berkata; telah menceritakan kepadaku [Yunus] dari [Ibnu Syihab] ia berkata; [Urwah] menceritakan bahwa ['Aisyah radliallahu 'anha] berkata, \"Seorang wanita meminjam perhiasan, banyak orang yang mengetahuinya namun ia tidak tahu. Wanita itu menjual perhiasan tersebut, sehingga ia ditangkap dan dibawa ke hadapan Nabi shallallahu 'alaihi wasallam. Beliau lantas memerintahkan untuk memotong tangannya, dan wanita itulah yang pernah dimintakan amnesti oleh Usamah bin Zaid, lalu Rasulullah shallallahu 'alaihi wasallam memberi jawaban kepada Usamah sebagaimana yang beliau katakan.\" Telah menceritakan kepada kami [Abbas bin Abdul Azhim] dan [Muhammad bin Yahya] keduanya berkata; telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Aisyah] ia berkata, \"Ada seorang wanita Makhzumiyah meminjam barang kemudian mengingkarinya. Maka Nabi shallallahu 'alaihi wasallam memerintahkan untuk memotong tangannya…lalu ia menceritakan sebagaimana hadits Qutaibah, dari Al Laits, dari Ibnu Syihab. Namun dalam hadits itu ia menambahkan, \"Nabi shallallahu 'alaihi wasallam lalu memotong tangannya.\""
            },
            {
                "number": 3706,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حَمَّادٍ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُفِعَ الْقَلَمُ عَنْ ثَلَاثَةٍ عَنْ النَّائِمِ حَتَّى يَسْتَيْقِظَ وَعَنْ الْمُبْتَلَى حَتَّى يَبْرَأَ وَعَنْ الصَّبِيِّ حَتَّى يَكْبُرَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Hammad bin Salamah] dari [hammad] dari [Ibrahim] dari [Al Aswad] dari ['Aisyah radliallahu 'anha] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pena pencatat amal dan dosa itu diangkat dari tiga golongan; orang yang tidur hingga terbangun, orang gila hingga ia waras, dan anak kecil hingga ia balig.\""
            },
            {
                "number": 3707,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ أَبِي ظَبْيَانَ عَنْ ابْنِ عَبَّاسٍ قَالَأُتِيَ عُمَرُ بِمَجْنُونَةٍ قَدْ زَنَتْ فَاسْتَشَارَ فِيهَا أُنَاسًا فَأَمَرَ بِهَا عُمَرُ أَنْ تُرْجَمَ مُرَّ بِهَا عَلَى عَلِيِّ بْنِ أَبِي طَالِبٍ رِضْوَانُ اللَّهِ عَلَيْهِ فَقَالَ مَا شَأْنُ هَذِهِ قَالُوا مَجْنُونَةُ بَنِي فُلَانٍ زَنَتْ فَأَمَرَ بِهَا عُمَرُ أَنْ تُرْجَمَ قَالَ فَقَالَ ارْجِعُوا بِهَا ثُمَّ أَتَاهُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَمَا عَلِمْتَ أَنَّ الْقَلَمَ قَدْ رُفِعَ عَنْ ثَلَاثَةٍ عَنْ الْمَجْنُونِ حَتَّى يَبْرَأَ وَعَنْ النَّائِمِ حَتَّى يَسْتَيْقِظَ وَعَنْ الصَّبِيِّ حَتَّى يَعْقِلَ قَالَ بَلَى قَالَ فَمَا بَالُ هَذِهِ تُرْجَمُ قَالَ لَا شَيْءَ قَالَ فَأَرْسِلْهَا قَالَ فَأَرْسَلَهَا قَالَ فَجَعَلَ يُكَبِّرُحَدَّثَنَا يُوسُفُ بْنُ مُوسَى حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ نَحْوَهُ وَقَالَ أَيْضًا حَتَّى يَعْقِلَ وَقَالَ وَعَنْ الْمَجْنُونِ حَتَّى يَفِيقَ قَالَ فَجَعَلَ عُمَرُ يُكَبِّرُ حَدَّثَنَا ابْنُ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ عَنْ سُلَيْمَانَ بْنِ مِهْرَانَ عَنْ أَبِي ظَبْيَانَ عَنْ ابْنِ عَبَّاسٍ قَالَ مُرَّ عَلَى عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ بِمَعْنَى عُثْمَانَ قَالَ أَوَ مَا تَذْكُرُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُفِعَ الْقَلَمُ عَنْ ثَلَاثَةٍ عَنْ الْمَجْنُونِ الْمَغْلُوبِ عَلَى عَقْلِهِ حَتَّى يَفِيقَ وَعَنْ النَّائِمِ حَتَّى يَسْتَيْقِظَ وَعَنْ الصَّبِيِّ حَتَّى يَحْتَلِمَ قَالَ صَدَقْتَ قَالَ فَخَلَّى عَنْهَا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Abu Zhabyan] dari [Ibnu Abbas] ia berkata, \"Didatangkan kepada Umar seorang wanita gila yang berbuat zina, Umar lalu minta masukan pendapat kepada orang-orang. Kemudian ia memerintahkan agar wanita itu dirajam. Wanita itu lalu dibawa melewati [Ali bin Abu Thalib] -semoga Allah meridhainya-, ia bertanya, \"Ada apa dengan wanita ini?\" orang-orang menjawab, \"Wanita gila dari bani fulan, ia telah berbuat zina. Dan Umar memerintahkan agar ia dirajam saja.\" Ibnu Abbas berkata, \"Ali kemudian berkata, \"Bawalah ia kembali.\" Ali lantas mendatangi Umar dan berkata, \"Wahai Amirul Mukminin, tidakkah engkau tahu bahwa pena pencatat amal itu diangkat dari tiga golongan manusia; orang gila hingga ia sembuh, orang tidur hingga ia terbangun dan anak kecil hingga ia balig?\" Umar menjawab, \"Tentu.\" Ali bertanya lagi, \"Lalu kenapa wanita ini dirajam?\" Umar menjawab, \"Tidak apa-apa.\" Ali berkata, \"Lepaskanlah ia.\" Ibnu Abbas berkata, \"Umar kemudian membebaskan wanita tersebut. Lalu Umar pun bertakbir.\" Telah menceritakan kepada kami [Yusuf bin Musa] berkata, telah menceritakan kepada kami [Waki'] dari [Al A'masy] seperti hadits tersebut. Ia menyebutkan, \"Hingga berakal.\" Dalam riwayat lain, \"Orang gila hingga ia sadar.\" Perawi berkata, \"Umar kemudian bertakbir.\" Telah menceritakan kepada kami [Ibnu As Sarh] berkata, telah mengabarkan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Jarir bin Hazim] dari [Sulaiman bin Mihran] dari [Abu Zhabyan] dari [Ibnu Abbas] ia berkata, \"(wanita) itu lalu dibawa melewati [Ali bin Abu Thalib] -yakni sama dengan hadits Utsman- ia berkata, \"Tidakkah engkau ingat (wahai Amirul Mukminin) bahwa Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Pena pencatat dosa itu diangkat dari tiga golongan; orang gila hingga ia waras, orang tidur hingga ia terbangun dan anak kecil hingga bermimpi basah?\" Umar menjawab, \"Engkau benar.\" Lalu Umar melepaskan wanita itu.\""
            },
            {
                "number": 3708,
                "arab": "حَدَّثَنَا هَنَّادٌ عَنْ أَبِي الْأَحْوَصِ ح و حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ الْمَعْنَى عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِي ظَبْيَانَ قَالَ هَنَّادٌ الْجَنْبيُّ قَالَأُتِيَ عُمَرُ بِامْرَأَةٍ قَدْ فَجَرَتْ فَأَمَرَ بِرَجْمِهَا فَمَرَّ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ فَأَخَذَهَا فَخَلَّى سَبِيلَهَا فَأُخْبِرَ عُمَرُ قَالَ ادْعُوا لِي عَلِيًّا فَجَاءَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ لَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُفِعَ الْقَلَمُ عَنْ ثَلَاثَةٍ عَنْ الصَّبِيِّ حَتَّى يَبْلُغَ وَعَنْ النَّائِمِ حَتَّى يَسْتَيْقِظَ وَعَنْ الْمَعْتُوهِ حَتَّى يَبْرَأَ وَإِنَّ هَذِهِ مَعْتُوهَةُ بَنِي فُلَانٍ لَعَلَّ الَّذِي أَتَاهَا وَهِيَ فِي بَلَائِهَا قَالَ فَقَالَ عُمَرُ لَا أَدْرِي فَقَالَ عَلِيٌّ عَلَيْهِ السَّلَام وَأَنَا لَا أَدْرِي",
                "id": "Telah menceritakan kepada kami [Hannad] dari [Abu Al Ahwash]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Jarir] secara makna, dari [Atha bin As Sa`ib] dari [Abu Zhabyan] berkata; Hannad Al janbi berkata, \"Pernah didatangkan kepada Umar seorang wanita yang berbuat zina, lalu ia memerintahkan agar wanita itu dirajam. Ketika Ali radliallahu 'anhu lewat, ia mengambil wanita itu dan melepaskannya. Umar lalu diberi kabar dengan kejadian tersebut, ia lantas berkata, \"Pangilkanlah Ali agar ia menemuiku.\" [Ali radliallahu 'anhu] kemudian datang dan berkata, \"Wahai Amirul Mukminin, engkau telah mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Pena pencatat amal dan dosa itu diangkat dari tiga golongan; anak kecil hingga ia balig, orang tidur hingga ia bangun dan orang gila hingga ia waras.\" Dan wanita ini adalah wanita gila dari bani Fulan. Mungkin saja perzinaan itu terjadi disaat gilanya kambuh.\" Umar menanggapi, \"Aku tidak tahu.\" Ali langsung menimpali, \"Aku juga tidak tahu.\""
            },
            {
                "number": 3709,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ عَنْ خَالِدٍ عَنْ أَبِي الضُّحَى عَنْ عَلِيٍّ عَلَيْهِ السَّلَامعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُفِعَ الْقَلَمُ عَنْ ثَلَاثَةٍ عَنْ النَّائِمِ حَتَّى يَسْتَيْقِظَ وَعَنْ الصَّبِيِّ حَتَّى يَحْتَلِمَ وَعَنْ الْمَجْنُونِ حَتَّى يَعْقِلَقَالَ أَبُو دَاوُد رَوَاهُ ابْنُ جُرَيْجٍ عَنْ الْقَاسِمِ بْنِ يَزِيدَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَادَ فِيهِ وَالْخَرِفِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Wuhaib] dari [Khalid] dari [Abu Adh Dhuha] dari [Ali Alais Salam] dari nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Pena pencatat amal dan dosa itu diangkat dari tiga golongan; orang tidur hingga ia bangun, anak kecil hingga ia bermimpi dan orang gila hingga ia berakal.\" Abu Dawud berkata, \"Hadits ini diriwayatkan oleh [Ibnu Juraij], dari [Al Qasim bin Yazid] dari [Ali radliallahu 'anhu], dari Nabi shallallahu 'alaihi wasallam.\" Ia menambahkan di dalamnya, \"dan kharif (orang yang kurang akalnya).\""
            },
            {
                "number": 3710,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ حَدَّثَنِي عَطِيَّةُ الْقُرَظِيُّ قَالَكُنْتُ مِنْ سَبْيِ بَنِي قُرَيْظَةَ فَكَانُوا يَنْظُرُونَ فَمَنْ أَنْبَتَ الشَّعْرَ قُتِلَ وَمَنْ لَمْ يُنْبِتْ لَمْ يُقْتَلْ فَكُنْتُ فِيمَنْ لَمْ يُنْبِتْحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ بِهَذَا الْحَدِيثِ قَالَ فَكَشَفُوا عَانَتِي فَوَجَدُوهَا لَمْ تَنْبُتْ فَجَعَلُونِي مِنْ السَّبْيِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah menceritakan kepada kami [Sufyan] berkata, telah mengabarkan kepada kami [Abdul Malik bin Umair] berkata, telah menceritakan kepadaku [Athiyah Al Qurazhi] ia berkata, \"Aku termasuk salah satu dari tawanan bani Quraizhah, mereka mengamati siapa yang telah tumbuh bulu kemaluannya maka akan dibunuh, dan siapa yang belum tumbuh bulu kemaluannya maka tidak akan dibunuh. Sementara aku termasuk orang yang bulu kemaluannya belum tumbuh.\" Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Abdul malik bin Umair] dengan hadits yang sama. Ia berkata, \"Mereka lalu menyingkap auratku, namun mereka tidak mendapati bulu pada kemaluanku, sehingga mereka hanya menjadikan aku sebagai tawanan.\""
            },
            {
                "number": 3711,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَرَضَهُ يَوْمَ أُحُدٍ وَهُوَ ابْنُ أَرْبَعَ عَشْرَةَ سَنَةً فَلَمْ يُجِزْهُ وَعَرَضَهُ يَوْمَ الْخَنْدَقِ وَهُوَ ابْنُ خَمْسَ عَشْرَةَ سَنَةً فَأَجَازَهُحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ قَالَ قَالَ نَافِعٌ حَدَّثْتُ بِهَذَا الْحَدِيثِ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ فَقَالَ إِنَّ هَذَا الْحَدُّ بَيْنَ الصَّغِيرِ وَالْكَبِيرِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Yahya] dari [ubaidhullah] ia berkata; telah mengabarkan kepadaku [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam pernah memeriksa dirinya pada waktu perang uhud, waktu itu umurnya baru empat belas tahun. Sehingga beliau tidak mengizinkan untuk ikut berperang. Dan pada perang Khandaq beliau juga memeriksanya, waktu itu umurnya lima belas tahun, maka beliau pun memberinya izin.\" Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ibnu Idris] dari [ubaidhullah bin Umar] ia berkata, \" [Nafi'] berkata, \"Aku telah menceritakan hadits ini kepada Umar bin Abdul Aziz, lalu ia berkata, \"(maka) hadits ini adalah batas untuk membedakan anak kecil dengan orang dewasa.\""
            },
            {
                "number": 3712,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي حَيْوَةُ بْنُ شُرَيْحٍ عَنْ عَيَّاشِ بْنِ عَبَّاسٍ الْقِتْبَانِيِّ عَنْ شِيَيْمِ بْنِ بَيْتَانَ وَيَزِيدَ بْنِ صُبْحٍ الْأَصْبَحِيِّ عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ قَالَكُنَّا مَعَ بُسْرِ بْنِ أَرْطَاةَ فِي الْبَحْرِ فَأُتِيَ بِسَارِقٍ يُقَالُ لَهُ مِصْدَرٌ قَدْ سَرَقَ بُخْتِيَّةً فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تُقْطَعُ الْأَيْدِي فِي السَّفَرِ وَلَوْلَا ذَلِكَ لَقَطَعْتُهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Haiwah bin Syuraih] dari [Ayyasy bin Ayyasy Al Qitbani] dari [Syiyaim bin Baitan] dan [Yazid bin Shubh Al Ashbahi] dari [Junadah bin Abu Umayyah] ia berkata, \"Ketika aku dan [Busr bin Arthah] berlayar di lautan, seorang pencuri yang bernama mishdar dihadapkan kepada kami. Ia telah mencuri unta yang berleher panjang. Busr bin Arthah berkata, \"Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tangan (pencuri) tidak boleh dipotong dalam perjalanan, \" kalaulah bukan karena hal itu, tentu aku sudah memotongnya.\""
            },
            {
                "number": 3713,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَبِي عِمْرَانَ عَنْ الْمُشَعَّثِ بْنِ طَرِيفٍ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَبَا ذَرٍّ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ وَسَعْدَيْكَ فَقَالَ كَيْفَ أَنْتَ إِذَا أَصَابَ النَّاسَ مَوْتٌ يَكُونُ الْبَيْتُ فِيهِ بِالْوَصِيفِ يَعْنِي الْقَبْرَ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ أَوْ مَا خَارَ اللَّهُ وَرَسُولُهُ قَالَ عَلَيْكَ بِالصَّبْرِ أَوْ قَالَ تَصْبِرُقَالَ أَبُو دَاوُد قَالَ حَمَّادُ بْنُ أَبِي سُلَيْمَانَ يُقْطَعُ النَّبَّاشُ لِأَنَّهُ دَخَلَ عَلَى الْمَيِّتِ بَيْتَهُ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Abu Imran] dari [Al Musya'ats bin Tharif] dari [Abdullah bin Ash Shamit] dari [Abu Dzar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Wahai Abu Dzar!\" Aku menjawab, \"Wahai Rasulullah, aku penuhi panggilanmu. Dan semoga kebahagiaan selalu menyertaimu.\" Beliau bersabda: \"Wahai Abu Dzar, bagaimana menurutmu jika manusia mendapati kematian kemudian rumahnya ada dalam kuburan?\" Aku menjawab, \"Allah dan Rasul-Nya lebih tahu, atau ia mengatakan, \"Sebagaimana yang menjadi pilihan Allah dan Rasul-Nya.\" Beliau bersabda: \"Hendaknya engkau bersabar, atau beliau mengatakan, \"bersabarlah.\" Abu Dawud berkata, \"Hammad bin Sulaiman berkata, \"Tangan An Nabbasy (orang yang menggali kuburan untuk mengambil harta mayit) itu harus dipotong, sebab ia memasuki rumah mayit (kuburan).\""
            },
            {
                "number": 3714,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عُبَيْدِ بْنِ عَقِيلٍ الْهِلَالِيُّ حَدَّثَنَا جَدِّي عَنْ مُصْعَبِ بْنِ ثَابِتِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَجِيءَ بِسَارِقٍ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اقْتُلُوهُ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّمَا سَرَقَ فَقَالَ اقْطَعُوهُ قَالَ فَقُطِعَ ثُمَّ جِيءَ بِهِ الثَّانِيَةَ فَقَالَ اقْتُلُوهُ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّمَا سَرَقَ فَقَالَ اقْطَعُوهُ قَالَ فَقُطِعَ ثُمَّ جِيءَ بِهِ الثَّالِثَةَ فَقَالَ اقْتُلُوهُ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّمَا سَرَقَ فَقَالَ اقْطَعُوهُ ثُمَّ أُتِيَ بِهِ الرَّابِعَةَ فَقَالَ اقْتُلُوهُ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّمَا سَرَقَ قَالَ اقْطَعُوهُ فَأُتِيَ بِهِ الْخَامِسَةَ فَقَالَ اقْتُلُوهُ قَالَ جَابِرٌ فَانْطَلَقْنَا بِهِ فَقَتَلْنَاهُ ثُمَّ اجْتَرَرْنَاهُ فَأَلْقَيْنَاهُ فِي بِئْرٍ وَرَمَيْنَا عَلَيْهِ الْحِجَارَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Ubaid bin Aqil Al Hilali] berkata, telah menceritakan kepada kami [Kakekku] dari [Mush'ab bin Tsabit bin Abdullah bin Az Zubair] dari [Muhammad Ibnul Munkadir] dari [Jabir bin Abdullah] ia berkata, \"Seorang pencuri dibawa ke hadapan Nabi shallallahu 'alaihi wasallam, beliau lalu bersabda: \"Bunuhlah.\" Para sahabat bertanya, \"Wahai Rasulullah, ia hanya mencuri!\" beliau bersabda: \"Kalau begitu, potonglah tangannya.\" Jabir berkata, \"Tangan pencuri itu lantas dipotong.\" Setelah itu, pencuri tersebut kembali dibawa ke hadapan Nabi shallallahu 'alaihi wasallam untuk yang kedua kalinya, beliau lalu bersabda: \"Bunuhlah.\" Para sahabat bertanya, \"Wahai Rasulullah, ia hanya mencuri!\" beliau bersabda: \"Kalau begitu, potonglah tangannya.\" Kemudian pencuri itu kembali dibawa ke hadapan Nabi shallallahu 'alaihi wasallam untuk yang ketiga kalinya, beliau lalu bersabda: \"Bunuhlah.\" Para sahabat berkata, \"Wahai Rasulullah, ia hanya mencuri!\" beliau bersabda: \"Kalau begitu, potonglah.\" Kemudian pencuri itu di bawah ke hadapan Nabi shallallahu 'alaihi wasallam untuk keempat kalinya, beliau bersabda: \"Bunuhlah.\" Para sahabat berkata, \"Wahai Rasulullah, ia hanya mencuri!\" beliau bersabda: \"Kalau begitu, maka potonglah.\" Kemudian pencuri itu di bawah ke hadapan Nabi shallallahu 'alaihi wasallam untuk kelima kalinya, beliau bersabda: \"Bunuhlah.\" Jabir berkata, \"Kami lalu membawanya pergi dan membunuhnya. Setelah itu, kami menyeret mayatnya dan membuangnya ke dalam sumur, kemudian kami melemparinya dengan bebatuan.\""
            },
            {
                "number": 3715,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ حَدَّثَنَا الْحَجَّاجُ عَنْ مَكْحُولٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُحَيْرِيزٍ قَالَسَأَلْنَا فَضَالَةَ بْنَ عُبَيْدٍ عَنْ تَعْلِيقِ الْيَدِ فِي الْعُنُقِ لِلسَّارِقِ أَمِنَ السُّنَّةِ هُوَ قَالَ أُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِسَارِقٍ فَقُطِعَتْ يَدُهُ ثُمَّ أَمَرَ بِهَا فَعُلِّقَتْ فِي عُنُقِهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Umar bin Ali] berkata, telah menceritakan kepada kami [Al Hajjaj] dari [Makhul] dari ['Abdurrahman bin Muhairiz] ia berkata, \"Kami bertanya kepada [Fadhalah bin Ubaid] bagaimana hukum menggantungkan tangan ke leher bagi seorang pencuri, apakah hal itu termasuk sunah?\" ia menjawab, \"Pernah seorang pencuri dibawah ke hadapan Rasulullah shallallahu 'alaihi wasallam, beliau lantas memotong tangannya dan memerintahkan (agar tangannya digantungkan ke leher), maka tangannya digantungkan ke lehernya.\""
            },
            {
                "number": 3716,
                "arab": "حَدَّثَنَا مُوسَى يَعْنِي ابْنَ إِسْمَعِيلَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَرَقَ الْمَمْلُوكُ فَبِعْهُ وَلَوْ بِنَشٍّ",
                "id": "Telah menceritakan kepada kami [Musa] -maksudnya Musa bin Isma'il- berkata, telah menceritakan kepada kami [Abu Awanah] dari [Umar bin Abu Salamah] dari [Bapaknya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seorang budak mencuri maka juallah meskipun seharga dua puluh dirham.\""
            },
            {
                "number": 3717,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ الْمَرْوَزِيُّ حَدَّثَنِي عَلِيُّ بْنُ الْحُسَيْنِ عَنْ أَبِيهِ عَنْ يَزِيدَ النَّحْوِيِّ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَ{ وَاللَّاتِي يَأْتِينَ الْفَاحِشَةَ مِنْ نِسَائِكُمْ فَاسْتَشْهِدُوا عَلَيْهِنَّ أَرْبَعَةً مِنْكُمْ فَإِنْ شَهِدُوا فَأَمْسِكُوهُنَّ فِي الْبُيُوتِ حَتَّى يَتَوَفَّاهُنَّ الْمَوْتُ أَوْ يَجْعَلَ اللَّهُ لَهُنَّ سَبِيلًا }وَذَكَرَ الرَّجُلَ بَعْدَ الْمَرْأَةِ ثُمَّ جَمَعَهُمَا فَقَالَ{ وَاللَّذَانِ يَأْتِيَانِهَا مِنْكُمْ فَآذُوهُمَا فَإِنْ تَابَا وَأَصْلَحَا فَأَعْرِضُوا عَنْهُمَا }فَنَسَحَ ذَلِكَ بِآيَةِ الْجَلْدِ فَقَالَ{ الزَّانِيَةُ وَالزَّانِي فَاجْلِدُوا كُلَّ وَاحِدٍ مِنْهُمَا مِائَةَ جَلْدَةٍ }حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ حَدَّثَنَا مُوسَى يَعْنِي ابْنَ مَسْعُودٍ عَنْ شِبْلٍ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجِاهِدٍ قَالَ السَّبِيلُ الْحَدُّ قَالَ سُفْيَانُ{ فَآذُوهُمَا }الْبِكْرَانِ{ فَأَمْسِكُوهُنَّ فِي الْبُيُوتِ }الثَّيِّبَاتُ",
                "id": "Telah menceritakan kepada kami [Amad bin Muhammad bin Tsabit Al Marwazi] berkata, telah menceritakan kepadaku [Ali bin Al Husain] dari [Bapaknya] dari [Yazid bin An Nahwi] dari [Ikrimah] dari [Ibnu Abbas] ia berkata tentang firman Allah: '(Dan (terhadap) para wanita yang mengerjakan perbuatan keji, hendaklah ada empat orang saksi diantara kamu (yang menyaksikannya). Kemudian apabila mereka telah memberi persaksian, maka kurunglah mereka (wanita-wanita itu) dalam rumah sampai mereka menemui ajalnya, atau sampai Allah memberi jalan lain kepadanya) ' -Qs. An Nisa: 15-. Allah menyebutkan laki-laki setelah perempuan, kemudian Dia menggabungkan keduanya. Allah berfirman: '(Dan terhadap dua orang yang melakukan perbuatan keji di antara kamu, maka berilah hukuman kepada keduanya, kemudian jika keduanya bertaubat dan memperbaiki diri, maka biarkanlah mereka..) ' -Qs. An Nisa: 16-. Ayat ini kemudian dihapus dengan ayat cambuk, Allah berfirman: '(perempuan yang berzina dan laki-laki yang berzina, maka deralah tiap-tiap seorang dari keduanya seratus kali dera…) ' -Qs. An Nuur: 2-. Telah menceritakan kepada kami Ahmad bin Muhammad bin Tsabit berkata, telah menceritakan kepada kami Musa -maksudnya Musa bin Mas'ud- dari Syibl dari Ibnu Abu Najih dari Mujahid ia berkata, \"Kata 'as sabil' maksudnya adalah hukuman had.\" Mujahid berkata, \"Firman Allah 'maka berilah hukuman kepada keduanya', maksudnya adalah pezina yang masih lajang. Sementara firman Allah 'maka kurunglah mereka (wanita-wanita itu) dalam rumah', maksudnya adalah para janda.\""
            },
            {
                "number": 3718,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ حَطَّانَ بْنِ عَبْدِ اللَّهِ الرَّقَاشِيِّ عَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذُوا عَنِّي خُذُوا عَنِّي قَدْ جَعَلَ اللَّهُ لَهُنَّ سَبِيلًا الثَّيِّبُ بِالثَّيِّبِ جَلْدُ مِائَةٍ وَرَمْيٌ بِالْحِجَارَةِ وَالْبِكْرُ بِالْبِكْرِ جَلْدُ مِائَةٍ وَنَفْيُ سَنَةٍحَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ وَمُحَمَّدُ بْنُ الصَّبَّاحِ بْنِ سُفْيَانَ قَالَا حَدَّثَنَا هُشَيْمٌ عَنْ مَنْصُورٍ عَنْ الْحَسَنِ بِإِسْنَادِ يَحْيَى وَمَعْنَاهُ قَالَ جَلْدُ مِائَةٍ وَالرَّجْمُ حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ الطَّائِيُّ حَدَّثَنَا الرَّبِيعُ بْنُ رَوْحِ بْنِ خُلَيْدٍ حَدَّثَنَا مُحَمَّدُ بْنُ خَالِدٍ يَعْنِي الْوَهْبِيَّ حَدَّثَنَا الْفَضْلُ بْنُ دَلْهَمٍ عَنْ الْحَسَنِ عَنْ سَلَمَةَ بْنِ الْمُحَبَّقِ عَنْ عُبَادَةَ بْنِ الصَّامِتِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ فَقَالَ نَاسٌ لِسَعْدِ بْنِ عُبَادَةَ يَا أَبَا ثَابِتٍ قَدْ نَزَلَتْ الْحُدُودُ لَوْ أَنَّكَ وَجَدْتَ مَعَ امْرَأَتِكَ رَجُلًا كَيْفَ كُنْتَ صَانِعًا قَالَ كُنْتُ ضَارِبَهُمَا بِالسَّيْفِ حَتَّى يَسْكُتَا أَفَأَنَا أَذْهَبُ فَأَجْمَعُ أَرْبَعَةَ شُهَدَاءٍ فَإِلَى ذَلِكَ قَدْ قَضَى الْحَاجَةَ فَانْطَلَقُوا فَاجْتَمَعُوا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا يَا رَسُولَ اللَّهِ أَلَمْ تَرَ إِلَى أَبِي ثَابِتٍ قَالَ كَذَا وَكَذَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَفَى بِالسَّيْفِ شَاهِدًا ثُمَّ قَالَ لَا لَا أَخَافُ أَنْ يَتَتَابَعَ فِيهَا السَّكْرَانُ وَالْغَيْرَانُ قَالَ أَبُو دَاوُد رَوَى وَكِيعٌ أَوَّلَ هَذَا الْحَدِيثِ عَنْ الْفَضْلِ بْنِ دَلْهَمٍ عَنْ الْحَسَنِ عَنْ قَبِيصَةَ بْنِ حُرَيْثٍ عَنْ سَلَمَةَ بْنِ الْمُحَبَّقِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنَّمَا هَذَا إِسْنَادُ حَدِيثِ ابْنِ الْمُحَبَّقِ أَنَّ رَجُلًا وَقَعَ عَلَى جَارِيَةِ امْرَأَتِهِ قَالَ أَبُو دَاوُد الْفَضْلُ بْنُ دَلْهَمٍ لَيْسَ بِالْحَافِظِ كَانَ قَصَّابًا بِوَاسِطَ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Sa'id bin Abu Arubah] dari [Qatadah] dari [Al Hasan] dari [Haththan bin Abdullah Ar Raqqasyi] dari [Ubadah bin Ash Shamit] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ambillah dariku, abillah dariku. Allah telah menjadikan bagi wanita-wanita itu hukuman had. Janda dan duda yang berzina, hukumannya adalah dera seratus kali dan dirajam. Perawan dan perjaka yang berzina, maka hukumannya adalah dera seratus kali dan diasingkan selama satu tahun.\" Telah menceritakan kepada kami [Wahb bin Baqiyyah] dan [Muhammad bin Ash Shabbah bin Sufyan] keduanya berkata; telah menceritakan kepada kami [Husyaim] dari [Manshur] dari [Al Hasan] dengan sanad dan makna yang sama dengan hadits Yahya. Ia menyebutkan, \"Dera seratus kali dan rajam.\" Telah menceritakan kepada kami [Muhamad bin auf Ath Tha`i] berkata, telah menceritakan kepada kami [Ar rabi' bin rauh bin Khulaid] berkata, telah menceritakan kepada kami [Muhammad bin Khalid] -maksudnya Muhammad bin Khalid Al Wahbi- berkata, telah menceritakan kepada kami [Al Fadhl bin Dalham] dari [Al Hasan] dari [Salamah bin Al Muhabbaq] dari [Ubadah bin Ash Shamit] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini; Orang-orang berkata kepada Sa'd bin Ubadah, \"Wahai Abu Tsabit, hudud telah ditetapkan. Sekiranya engkau mendapati seorang laki-laki sedang bersama isterimu, maka apa yang engkau lakukan?\" Sa'd menjawab, \"Aku akan membunuh keduanya dengan pedang hingga mereka mati. Sebab tidak masuk akal jika aku pergi mencari empat orang saksi! Jika aku lakukan, tentu mereka telah selesai (melakukan zina).\" Orang-orang itu lalu pergi dan berkumpul di sisi Rasulullah shallallahu 'alaihi wasallam, mereka bertanya, \"Wahai Rasulullah, apa pendapatmu dengan jawaban Abu Tsabit, ia mengatakan begini dan begini?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Cukuplah pedang sebagai saksi.\" Kemudian beliau bersabda lagi: \"Tidak, aku tidak kawatir orang yang lagi marah dan cemburu (suami) akan bertambah mewabah (semua suami yang cemburu main hakim hakim sendiri).\", Abu Daud berkata; [Waki'] meriwayatkan permulaan hadits ini dari [Al Fadhal bin Dahlam] dari [Al Hasan] dari [Qabishah bin Huraits] dari [Salamah bin Al Muhabbaq] dari Nabi shallallahu 'alaihi wasallam, hanyasanya sanad ini (yang disebutkan oleh Waki') adalah sanad hadits Ibnu Al Muhabbaq (yaitu hadits;) \"bahwasanya ada seorang laki-laki yang berbuat zina dengan seorang budak perempuan istrinya\", Abu Daud berkata; \"Al Fadhal bin Dalham bukan seorang yang hafidh (hafal ribuan hadits) namun dia hanya seorang tukang jagal di Washitha\""
            },
            {
                "number": 3719,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا الزُّهْرِيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَنَّ عُمَرَ يَعْنِي ابْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ خَطَبَ فَقَالَإِنَّ اللَّهَ بَعَثَ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحَقِّ وَأَنْزَلَ عَلَيْهِ الْكِتَابَ فَكَانَ فِيمَا أُنْزِلَ عَلَيْهِ آيَةُ الرَّجْمِ فَقَرَأْنَاهَا وَوَعَيْنَاهَا وَرَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَجَمْنَا مِنْ بَعْدِهِ وَإِنِّي خَشِيتُ إِنْ طَالَ بِالنَّاسِ الزَّمَانُ أَنْ يَقُولَ قَائِلٌ مَا نَجِدُ آيَةَ الرَّجْمِ فِي كِتَابِ اللَّهِ فَيَضِلُّوا بِتَرْكِ فَرِيضَةٍ أَنْزَلَهَا اللَّهُ تَعَالَى فَالرَّجْمُ حَقٌّ عَلَى مَنْ زَنَى مِنْ الرِّجَالِ وَالنِّسَاءِ إِذَا كَانَ مُحْصَنًا إِذَا قَامَتْ الْبَيِّنَةُ أَوْ كَانَ حَمْلٌ أَوْ اعْتِرَافٌ وَايْمُ اللَّهِ لَوْلَا أَنْ يَقُولَ النَّاسُ زَادَ عُمَرُ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ لَكَتَبْتُهَا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] berkata, telah menceritakan kepada kami [Husyaim] berkata, telah menceritakan kepada kami [Az Zuhri] dari [ubaidhullah bin Abdullah bin Utbah] dari [Abdullah bin Abbas] berkata, \" [Umar Ibnul Khaththab] berpidato, ia mengatakan, \"Sesungguhnya Allah telah mengutus Muhammad shallallahu 'alaihi wasallam dengan kebenaran dan menurunkan kepadanya Al Kitab (al-qur'an). Termasuk yang diturunkan kepada beliau adalah ayat rajam. Kami membaca dan memahaminya, Rasulullah shallallahu 'alaihi wasallam melaksanakan (ayat) rajam dan kami juga memberlakukannya setelah beliau. Aku kawatir ketika zaman terus berlalu, lalu ada seseorang mengatakan, 'Kami tidak mendapati ayat rajam dalam Kitabullah'. Maka mereka akan sesat dengan meninggalkan kewajiban yang telah Allah turunkan. Rajam adalah hukum yang pas bagi laki-laki dan perempuan yang berzina dan telah menikah; jika bukti telah ada, atau adanya kehamilan, atau pengakuan. Demi Allah, sekiranya manusia tidak akan mengatakan 'Umar telah menambahi Kitabullah', sungguh aku akan menuliskannya.\""
            },
            {
                "number": 3720,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا وَكِيعٌ عَنْ هِشَامِ بْنِ سَعْدٍ قَالَ حَدَّثَنِي يَزِيدُ بْنُ نُعَيْمِ بْنِ هَزَّالٍ عَنْ أَبِيهِ قَالَكَانَ مَاعِزُ بْنُ مَالِكٍ يَتِيمًا فِي حِجْرِ أَبِي فَأَصَابَ جَارِيَةً مِنْ الْحَيِّ فَقَالَ لَهُ أَبِي ائْتِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبِرْهُ بِمَا صَنَعْتَ لَعَلَّهُ يَسْتَغْفِرُ لَكَ وَإِنَّمَا يُرِيدُ بِذَلِكَ رَجَاءَ أَنْ يَكُونَ لَهُ مَخْرَجًا فَأَتَاهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ فَأَقِمْ عَلَيَّ كِتَابَ اللَّهِ فَأَعْرَضَ عَنْهُ فَعَادَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ فَأَقِمْ عَلَيَّ كِتَابَ اللَّهِ فَأَعْرَضَ عَنْهُ فَعَادَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ فَأَقِمْ عَلَيَّ كِتَابَ اللَّهِ حَتَّى قَالَهَا أَرْبَعَ مِرَارٍ قَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّكَ قَدْ قُلْتَهَا أَرْبَعَ مَرَّاتٍ فَبِمَنْ قَالَ بِفُلَانَةٍ فَقَالَ هَلْ ضَاجَعْتَهَا قَالَ نَعَمْ قَالَ هَلْ بَاشَرْتَهَا قَالَ نَعَمْ قَالَ هَلْ جَامَعْتَهَا قَالَ نَعَمْ قَالَ فَأَمَرَ بِهِ أَنْ يُرْجَمَ فَأُخْرِجَ بِهِ إِلَى الْحَرَّةِ فَلَمَّا رُجِمَ فَوَجَدَ مَسَّ الْحِجَارَةِ جَزِعَ فَخَرَجَ يَشْتَدُّ فَلَقِيَهُ عَبْدُ اللَّهِ بْنُ أُنَيْسٍ وَقَدْ عَجَزَ أَصْحَابُهُ فَنَزَعَ لَهُ بِوَظِيفِ بَعِيرٍ فَرَمَاهُ بِهِ فَقَتَلَهُ ثُمَّ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ هَلَّا تَرَكْتُمُوهُ لَعَلَّهُ أَنْ يَتُوبَ فَيَتُوبَ اللَّهُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] berkata, telah menceritakan kepada kami [Waki'] dari [Hisyam bin Sa'd] ia berkata; telah menceritakan kepadaku [Yazid bin Nu'aim bin Hazzal] dari [Bapaknya] ia berkata, \"Ma'iz bin Malik adalah seorang anak yatim yang diasuh oleh bapakku. Dan ia pernah berzina dengan seorang budak wanita dari suatu kampung. Bapakku lalu berkata kepadanya, \"Datanglah kepada Rasulullah shallallahu 'alaihi wasallam, kabarkan kepada beliau dengan apa yang telah engkau lakukan, semoga saja beliau mau memintakan ampun untukmu.\" Hanyasanya ayahku menginginkan hal itu agar Maiz mendapatkan jalan keluar, lalu ia bergegas menemui Rasulullah. Ma'iz lantas berkata, \"Wahai Rasulullah, aku telah berzina, maka laksanakanlah hukum Kitabullah terhadapku!\" Beliau berpaling darinya. Maka Ma'iz mengulangi lagi, \"Wahai Rasulullah, aku telah berzina, maka laksanakanlah hukum Kitabullah terhadapku!\" Beliau berpaling. Ma'iz mengulanginya lagi, \"Wahai Rasulullah, aku telah berzina, maka laksanakanlah hukum Kitabullah terhadapku!\" Ia ulangi hal itu hingga empat kali. Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Engkau telah mengatakannya hingga empat kali, lalu dengan siapa kamu melakukannya?\" Ma'iz menjawab, \"Dengan Fulanah.\" Beliau bertanya lagi: \"Apakah menidurinya?\" Ma'iz menjawab, \"Ya.\" beliau bertanya lagi: \"Apakah kamu menyentuhnya?\" Ma'iz menjawab, \"Ya.\" beliau bertanya lagi: \"Apakah kamu menyetubuhinya?\" Ma'iz menjawab, \"Ya.\" Akhirnya Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk merajamnya. Ma'iz lantas dibawa ke padang pasir, maka ketika ia sedang dirajam dan mulai merasakan sakitnya terkena lemparan batu, ia tidak tahan dan lari dengan kencang. Namun ia bertemu dengan Abdullah bin Unais, orang-orang yang merajam Ma'iz sudah tidak sanggup lagi (lelah), maka Abdullah mendorongnya dengan tulang unta, ia melempari Ma'iz dengan tulang tersebut hingga tewas. Kemudian Abdullah menemui Nabi shallallahu 'alaihi wasallam dan menyebutkan kejadian tersebut, beliau bersabda: \"Kenapa kalian tidak membiarkannya, siapa tahu ia bertaubat dan Allah menerima taubatnya.\""
            },
            {
                "number": 3721,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ قَالَ ذَكَرْتُ لِعَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ قِصَّةَ مَاعِزِ ابْنِ مَالِكٍ فَقَالَ لِي حَدَّثَنِي حَسَنُ بْنُ مُحَمَّدِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَحَدَّثَنِي ذَلِكَ مِنْ قَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَلَّا تَرَكْتُمُوهُ مَنْ شِئْتُمْ مِنْ رِجَالِ أَسْلَمَ مِمَّنْ لَا أَتَّهِمُ قَالَ وَلَمْ أَعْرِفْ هَذَا الْحَدِيثَ قَالَ فَجِئْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ فَقُلْتُ إِنَّ رِجَالًا مِنْ أَسْلَمَ يُحَدِّثُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُمْ حِينَ ذَكَرُوا لَهُ جَزَعَ مَاعِزٍ مِنْ الْحِجَارَةِ حِينَ أَصَابَتْهُ أَلَّا تَرَكْتُمُوهُ وَمَا أَعْرِفُ الْحَدِيثَ قَالَ يَا ابْنَ أَخِي أَنَا أَعْلَمُ النَّاسِ بِهَذَا الْحَدِيثِ كُنْتُ فِيمَنْ رَجَمَ الرَّجُلَ إِنَّا لَمَّا خَرَجْنَا بِهِ فَرَجَمْنَاهُ فَوَجَدَ مَسَّ الْحِجَارَةِ صَرَخَ بِنَا يَا قَوْمُ رُدُّونِي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنَّ قَوْمِي قَتَلُونِي وَغَرُّونِي مِنْ نَفْسِي وَأَخْبَرُونِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرُ قَاتِلِي فَلَمْ نَنْزَعْ عَنْهُ حَتَّى قَتَلْنَاهُ فَلَمَّا رَجَعْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَخْبَرْنَاهُ قَالَ فَهَلَّا تَرَكْتُمُوهُ وَجِئْتُمُونِي بِهِ لِيَسْتَثْبِتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُ فَأَمَّا لِتَرْكِ حَدٍّ فَلَا قَالَ فَعَرَفْتُ وَجْهَ الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Umar bin maisarah] berkata, telah menceritakan kepada kami [Yazid bin Zurai'] dari [Muhammad bin Ishaq] ia berkata; Aku menceritakan kisah Ma'iz bin Malik kepada [Ashim bin Umar bin Qatadah], lalu ia berkata kepadaku; telah menceritakan kepadaku [Hasan bin Muhammad bin Ali bin Abu Thalib] ia berkata, \"Aku mendengar kisah itu dari sabda Rasulullah shallallahu 'alaihi wasallam, 'Mengapa kalian tidak membiarkannya' dari orang-orang bani Aslam yang aku tidak merasa ragu dengan mereka.\" Hasan bin Muhammad berkata lagi, \"Tetapi aku tidak tahu hadits ini.\" Aku (Muhammad bin Ishaq) lalu mendatangi [Jabir bin Abdullah], dan kukatakan kepadanya, \"Beberapa lelaki dari bani Aslam menceritakan kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam pernah berkata kepada mereka 'Mengapa kalian tidak membiarkan (Ma'iz lari) saja? ', yakni ketika mereka menceritakan tentang kejadian kaburnya Ma'iz karena tidak tahan dengan sakitnya lemparan batu, dan aku juga tidak tahu keberadaan hadits tersebut.\" Jabir berkata, \"Wahai keponakanku, aku adalah orang yang paling tahu dengan hadits ini, karena aku termasuk orang yang ikut merajam Ma'iz. Ketika kami keluar dan merajam Ma'iz, dan ia merasakan sakitnya lemparan batu, maka ia kesakitan dan berteriak kepada kami, \"Wahai kaum, kembalikanlah aku kepada Rasulullah shallallahu 'alaihi wasallam. Sungguh, kaumku telah menipuku dan ingin membunuhku. Mereka kabarkan kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam tidak akan membunuhku.\" Namun kami tidak berhenti merajam Ma'iz, sehingga kami pun membunuhnya. Maka ketika kami kembali dan kami kabarkan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Kenapa kalian tidak biarkan saja, lalu kalian bawa ia kemari?\" Hal itu beliau lakukan untuk mendapat kepastian darinya, bukan untuk melepaskan hukuman had.\" Hasan bin Muhammad berkata, \"Dari situlah aku tahu konteks hadits itu sebenarnya.\""
            },
            {
                "number": 3722,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سِمَاكٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَرَأَيْتُ مَاعِزَ بْنَ مَالِكٍ حِينَ جِيءَ بِهِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا قَصِيرًا أَعْضَلَ لَيْسَ عَلَيْهِ رِدَاءٌ فَشَهِدَ عَلَى نَفْسِهِ أَرْبَعَ مَرَّاتٍ أَنَّهُ قَدْ زَنَى فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَعَلَّكَ قَبَّلْتَهَا قَالَ لَا وَاللَّهِ إِنَّهُ قَدْ زَنَى الْآخِرُ قَالَ فَرَجَمَهُ ثُمَّ خَطَبَ فَقَالَ أَلَا كُلَّمَا نَفَرْنَا فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ خَلَفَ أَحَدُهُمْ لَهُ نَبِيبٌ كَنَبِيبِ التَّيْسِ يَمْنَحُ إِحْدَاهُنَّ الْكُثْبَةَ أَمَا إِنَّ اللَّهَ إِنْ يُمَكِّنِّي مِنْ أَحَدٍ مِنْهُمْ إِلَّا نَكَلْتُهُ عَنْهُنَّحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ عَنْ شُعْبَةَ عَنْ سِمَاكٍ قَالَ سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ بِهَذَا الْحَدِيثِ وَالْأَوَّلُ أَتَمُّ قَالَ فَرَدَّهُ مَرَّتَيْنِ قَالَ سِمَاكٌ فَحَدَّثْتُ بِهِ سَعِيدَ بْنَ جُبَيْرٍ فَقَالَ إِنَّهُ رَدَّهُ أَرْبَعَ مَرَّاتٍ حَدَّثَنَا عَبْدُ الْغَنِيِّ بْنُ أَبِي عَقِيلٍ الْمِصْرِيُّ حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ قَالَ قَالَ شُعْبَةُ فَسَأَلْتُ سِمَاكًا عَنْ الْكُثْبَةِ فَقَالَ اللَّبَنُ الْقَلِيلُ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Simak] dari [Jabir bin Samurah] ia berkata, \"Saat Ma'iz bin Malik dibawa ke hadapan Nabi shallallahu 'alaihi wasallam, aku melihat bahwa ia adalah seorang laki-laki pendek, berotot besar dan tidak mengenakan selendang. Ia bersaksi -sebanyak empat kali- atas dirinya sendiri bahwa ia telah berbuat zina. Rasulullah shallallahu 'alaihi wasallam lalu bertanya: \"Mungkin kamu hanya menciumnya?\" ia menjawab, \"Demi Allah, tidak! Ma'iz justru mengakui bahwa ia benar-benar telah berzina. Jabir berkata, \"Rasulullah shallallahu 'alaihi wasallam kemudian merajamnya kemudian berpidato: \"Ketahuilah, ketika kita sedang jihad di jalan Allah 'azza wajalla, ada seorang laki-laki (yang bertugas menjaga para wanita di rumah) dari mereka suka mendesah layaknya kambing bandot. Ia memberikan kepada salah seorang wanita dari mereka sesuatu yang sedikit (memberi sedikit susu untuk menipu, kemudian menzinainya). Demi Allah, jika Allah memberiku kemampuan untuk menangkapnya, maka aku akan menghukumnya.\" Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] dari [Muhammad bin Ja'far] dari [Syu'bah] dari [Simak] ia berkata; Aku mendengar [Jabir bin Samurah] dengan hadits ini, tapi hadits yang pertama lebih lengkap. Ia (perawi) berkata, \"Ia ulangi hingga dua kali.\" [Simak] berkata, \"Hadits itu kemudian aku ceritakan kepada [Sa'id bin Jubair], ia balik berkata, \"(Bahkan) ia mengulanginya hingga empat kali.\" Telah menceritakan kepada kami Abdul Ghani bin Abu Aqil Al Mishri berkata, telah menceritakan kepada kami Khalid -makasudnya Khalid bin 'Abdurrahman- ia berkata; Syu'bah berkata; Aku pernah bertanya Simak maksud dari 'Al Kutsbah' (sesuatu yang sedikit), lalu ia menjawab, \"Itu adalah susu yang sedikit.\""
            },
            {
                "number": 3723,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِمَاعِزِ بْنِ مَالِكٍ أَحَقٌّ مَا بَلَغَنِي عَنْكَ قَالَ وَمَا بَلَغَكَ عَنِّي قَالَ بَلَغَنِي عَنْكَ أَنَّكَ وَقَعْتَ عَلَى جَارِيَةِ بَنِي فُلَانٍ قَالَ نَعَمْ فَشَهِدَ أَرْبَعَ شَهَادَاتٍ فَأَمَرَ بِهِ فَرُجِمَ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Simak bin Harb] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata, 'Rasulullah shallallahu 'alaihi wasallam bersabda kepada Ma'iz bin Malik: \"Apa benar berita yang sampai kepadaku tentang dirimu?\" Ma'iz balik bertanya, \"Berita apa yang telah engkau dengar tentang aku?\" beliau menjawab: \"Telah sampai kabar kepadaku bahwa engkau telah berzina dengan seorang budak wanita dari bani fulan.\" Ma'iz berkata, \"Benar.\" Lalu ia bersaksi hingga empat kali, Nabi kemudian memerintahkan untuk merajamnya, maka Ma'iz pun dirajam.\""
            },
            {
                "number": 3724,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا جَرِيرٌ حَدَّثَنِي يَعْلَى عَنْ عِكْرِمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَعُقْبَةُ بْنُ مُكْرَمٍ قَالَا حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ يَعْلَى يَعْنِي ابْنَ حَكِيمٍ يُحَدِّثُ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِمَاعِزِ بْنِ مَالِكٍ لَعَلَّكَ قَبَّلْتَ أَوْ غَمَزْتَ أَوْ نَظَرْتَ قَالَ لَا قَالَ أَفَنِكْتَهَا قَالَ نَعَمْ قَالَ فَعِنْدَ ذَلِكَ أَمَرَ بِرَجْمِهِوَلَمْ يَذْكُرْ مُوسَى عَنْ ابْنِ عَبَّاسٍ وَهَذَا لَفْظُ وَهْبٍ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Jarir] berkata, telah menceritakan kepadaku [Ya'la] dari [Ikrimah] bahwa Nabi shallallahu 'alaihi wasallam. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Zuhair bin Harb] dan [Uqbah bin Mukram] keduanya berkata; telah menceritakan kepada kami [Wahb bin Jarir] berkata, telah menceritakan kepada kami [Bapakku] ia berkata; aku mendengar [Ya'la] -maksudnya Ya'la bin Hakim- menceritakan dari [Ikrimah] dari [Ibnu Abbas] bahwa Nabi shallallahu 'alaihi wasallam bertanya kepada Ma'iz bin Malik: \"Mungkin kamu hanya mencium, melirik atau meraba saja?\" Ma'iz menjawab, \"Tidak.\" Beliau bertanya: \"Apa kamu telah menggaulinya?\" Ma'iz berkata, \"Ya.\" Ibnu Abbas berkata, \"Maka saat itulah beliau memerintahkan untuk merajamnya.\" Namun Musa tidak menyebutkan dari Ibnu Abbas. Dan ini adalah lafadz Wahb. "
            },
            {
                "number": 3725,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الصَّامِتِ ابْنَ عَمِّ أَبِي هُرَيْرَةَ أَخْبَرَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُجَاءَ الْأَسْلَمِيُّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَهِدَ عَلَى نَفْسِهِ أَنَّهُ أَصَابَ امْرَأَةً حَرَامًا أَرْبَعَ مَرَّاتٍ كُلُّ ذَلِكَ يُعْرِضُ عَنْهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقْبَلَ فِي الْخَامِسَةِ فَقَالَ أَنِكْتَهَا قَالَ نَعَمْ قَالَ حَتَّى غَابَ ذَلِكَ مِنْكَ فِي ذَلِكَ مِنْهَا قَالَ نَعَمْ قَالَ كَمَا يَغِيبُ الْمِرْوَدُ فِي الْمُكْحُلَةِ وَالرِّشَاءُ فِي الْبِئْرِ قَالَ نَعَمْ قَالَ فَهَلْ تَدْرِي مَا الزِّنَا قَالَ نَعَمْ أَتَيْتُ مِنْهَا حَرَامًا مَا يَأْتِي الرَّجُلُ مِنْ امْرَأَتِهِ حَلَالًا قَالَ فَمَا تُرِيدُ بِهَذَا الْقَوْلِ قَالَ أُرِيدُ أَنْ تُطَهِّرَنِي فَأَمَرَ بِهِ فَرُجِمَ فَسَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلَيْنِ مِنْ أَصْحَابِهِ يَقُولُ أَحَدُهُمَا لِصَاحِبِهِ انْظُرْ إِلَى هَذَا الَّذِي سَتَرَ اللَّهُ عَلَيْهِ فَلَمْ تَدَعْهُ نَفْسُهُ حَتَّى رُجِمَ رَجْمَ الْكَلْبِ فَسَكَتَ عَنْهُمَا ثُمَّ سَارَ سَاعَةً حَتَّى مَرَّ بِجِيفَةِ حِمَارٍ شَائِلٍ بِرِجْلِهِ فَقَالَ أَيْنَ فُلَانٌ وَفُلَانٌ فَقَالَا نَحْنُ ذَانِ يَا رَسُولَ اللَّهِ قَالَ انْزِلَا فَكُلَا مِنْ جِيفَةِ هَذَا الْحِمَارِ فَقَالَا يَا نَبِيَّ اللَّهِ مَنْ يَأْكُلُ مِنْ هَذَا قَالَ فَمَا نِلْتُمَا مِنْ عِرْضِ أَخِيكُمَا آنِفًا أَشَدُّ مِنْ أَكْلٍ مِنْهُ وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهُ الْآنَ لَفِي أَنْهَارِ الْجَنَّةِ يَنْقَمِسُ فِيهَاحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ عَنْ ابْنِ عَمِّ أَبِي هُرَيْرَةَ عَنْ أَبِي هُرَيْرَةَ بِنَحْوِهِ زَادَ وَاخْتَلَفُوا عَلَيَّ فَقَالَ بَعْضُهُمْ رُبِطَ إِلَى شَجَرَةٍ وَقَالَ بَعْضُهُمْ وُقِفَ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Abdurrazaq] dari [Ibnu Juraij] ia berkata; telah mengabarkan kepadaku [Abu Az Zubair] bahwa ['Abdurrahman bin Ash Shamit] -anak pamannya Abu Hurairah- ia mengabarkan kepadanya, Bahwasanya ia mendengar [Abu Hurairah] berkata, \"Al Aslami datang menemui Nabi shallallahu 'alaihi wasallam, ia bersaksi atas dirinya sendiri bahwa ia pernah berzina dengan seorang wanita ia ulangi pernyataannya itu hingga empat kali, dan setiap itu pula Nabi shallallahu 'alaihi wasallam selalu berpaling. Pada kali kelimanya, Nabi shallallahu 'alaihi wasallam bersabda: \"Apakah benar kamu melakukan itu?\" ia menjawab, \"Benar.\" Beliau bertanya lagi: \"Hingga waktu itu (kemaluanmu) hilang (masuk ke dalam kemaluannya)?\" ia menjawab, \"Ya.\" beliau bertanya lagi: \"Seperti pensil celak masuk ke dalam botolnya, dan seperti tali timba masuk ke dalam sumur?\" ia menjawab, \"Ya.\" beliau bertanya lagi: \"Apakah kamu tahu zina itu apa?\" ia menjawab, \"Ya. Aku mendatangi wanita yang haram bagiku layaknya laki-laki yang mendatangi isterinya secara halal.\" Beliau bertanya lagi: \"Apa yang kamu inginkan dari jawaban itu?\" Ia menjawab, \"Aku ingin agar engkau membersihkan dosaku.\" Beliau lalu memerintahkan agar ia dirajam, maka ia pun dirajam. Kemudian Nabi shallallahu 'alaihi wasallam mendengar dua orang sahabatnya bercakap-cakap, salah seorang dari keduanya berkata kepada yang lain, \"Lihatlah kepada laki-laki ini, Allah telah menutupi dirinya (jika ia tidak mengaku), namun dirinya tidak mau diam (justru mengaku), maka ia pun dirajam layaknya anjing.\" Beliau diam saja, hingga ketika beliau berjalan beberapa saat dan melewati bangkai, beliau bersabda: \"Di mana Fulan dan Fulan tadi?\", keduanya menjawab; \"Kami wahai Rasulullah!.\", beliau bersabda; \"Kalian berdua silahkan turun, ambil dan makanlah bangkai himar ini!\" keduanya lalu berkata, \"Wahai Rasulullah, siapakah orang yang mau makan bangkai ini.\" beliau bersabda: \"Apa yang kalian bicarakan berkenaan dengan harga diri saudara kalian tadi, itu lebih buruk dari bangkai ini. Demi Dzat Yang jiwaku ada dalam tangan-Nya, sungguh sekarang ini sahabat kalian (yang dirajam) tengah berada di antara sungai-sungai surga di berenang di dalamnya.\" Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Abu Ashim] berkata, telah menceritakan kepada kami [Ibnu Juraij] ia berkata; telah mengabarkan kepadaku [Abu Az Zubair] dari [Anak pamannya Abu Hurairah] dari [Abu Hurairah] sebagaimana hadits tersebut. Ia (Hasan bin Ali) menambahkan, \"mereka berselisih denganku, sebagian mereka berkata, \"Ikat saja di batang pohon, \" sedangkan yang lain berkata, \"Suruh berdiri.\""
            },
            {
                "number": 3726,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ الْعَسْقَلَانِيُّ وَالْحَسَنُ بْنُ عَلِيٍّ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَجُلًا مِنْ أَسْلَمَ جَاءَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاعْتَرَفَ بِالزِّنَا فَأَعْرَضَ عَنْهُ ثُمَّ اعْتَرَفَ فَأَعْرَضَ عَنْهُ حَتَّى شَهِدَ عَلَى نَفْسِهِ أَرْبَعَ شَهَادَاتٍ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبِكَ جُنُونٌ قَالَ لَا قَالَ أُحْصِنْتَ قَالَ نَعَمْ قَالَ فَأَمَرَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُجِمَ فِي الْمُصَلَّى فَلَمَّا أَذَلَقَتْهُ الْحِجَارَةُ فَرَّ فَأُدْرِكَ فَرُجِمَ حَتَّى مَاتَ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرًا وَلَمْ يُصَلِّ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul Mutawakkil Al Asqalani] dan [Al Hasan bin Ali] keduanya berkata; telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah] dari [Jabir bin Abdullah] bahwa seorang laki-laki dari Aslam datang menemui Rasulullah shallallahu 'alaihi wasallam mengakui bahwa dirinya telah berzina, namun beliau berpaling darinya. Laki-laki itu kembali mengakuinya dan beliau berpaling, sehingga laki-laki itu bersaksi (mengaku) sebanyak empat kali. Akhirnya Nabi shallallahu 'alaihi wasallam bertanya kepadanya: \"Apakah kamu gila?\" ia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Apakah kamu sudah menikah?\" ia menjawab, \"Ya.\" Nabi shallallahu 'alaihi wasallam lalu memerintahkan untuk merajamnya, ia pun dirajam di tempat yang lapang. Maka ketika ia merasakan sakit karena lemparan batu, ia kabur. Lalu ia ditangkap dan dirajam lagi hingga meninggal. Nabi shallallahu 'alaihi wasallam lalu berkomentar untuk laki-laki itu, \"Ia dalam kebaikan.\" Namun beliau tidak mensholatinya.\""
            },
            {
                "number": 3727,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرِ بْنِ أَبِي شَيْبَةَ حَدَّثَنَا يَحْيَى بْنُ يَعْلَى بْنِ الْحَارِثِ حَدَّثَنَا أَبِي عَنْ غَيْلَانَ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَنْكَهَ مَاعِزًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Yahya bin Ya'la Ibnul Harits] berkata, telah menceritakan kepada kami [Bapakku] dari [Ghailan] dari [Alqamah bin Martsad] dari [Ibnu Buraidah] dari [Bapaknya] ia berkata, \"Nabi shallallahu 'alaihi wasallam mencium (bau) mulut Ma'iz (mungkin jika ada bau khamer).\""
            },
            {
                "number": 3728,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَقَ الْأَهْوَازِيُّ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا بُشَيْرُ بْنُ الْمُهَاجِرِ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِيهِ قَالَكُنَّا أَصْحَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَتَحَدَّثُ أَنَّ الْغَامِدِيَّةَ وَمَاعِزَ بْنَ مَالِكٍ لَوْ رَجَعَا بَعْدَ اعْتِرَافِهِمَا أَوْ قَالَ لَوْ لَمْ يَرْجِعَا بَعْدَ اعْتِرَافِهِمَا لَمْ يَطْلُبْهُمَا وَإِنَّمَا رَجَمَهُمَا عِنْدَ الرَّابِعَةِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Ishaq Al Ahwazi] berkata, telah menceritakan kepada kami [Abu Ahmad] berkata, telah menceritakan kepada kami [Busyair Ibnul Muhajir] berkata, telah menceritakan kepadaku [Abdullah bin Buraidah] dari [Bapaknya] ia berkata, \"Kami para sahabat Rasulullah shallallahu 'alaihi wasallam, pernah memperbincangkan kisah wanita Al Ghamidiyah dan Ma'iz bin Malik, andaikata keduanya mau mencabut pengakuannya, atau ia mengatakan, \"tidak kembali menghadap Nabi setelah mengakui, tentu beliau tidak akan mencari mereka lagi (minta pengakuannya kembali). Beliau baru merajam mereka ketika pengakuan itu berulang hingga empat kali.\""
            },
            {
                "number": 3729,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا طَلْقُ بْنُ غَنَّامٍ حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَفْصٍ حَدَّثَنَا أَبُو حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَجُلًا أَتَاهُ فَأَقَرَّ عِنْدَهُ أَنَّهُ زَنَى بِامْرَأَةٍ سَمَّاهَا لَهُ فَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمَرْأَةِ فَسَأَلَهَا عَنْ ذَلِكَ فَأَنْكَرَتْ أَنْ تَكُونَ زَنَتْ فَجَلَدَهُ الْحَدَّ وَتَرَكَهَا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Thalq bin Ghannam] berkata, telah menceritakan kepada kami [Abdussalam bin Hafsh] berkata, telah menceritakan kepada kami [Abu Hazim] dari [Sahl bin Sa'd] dari Nabi shallallahu 'alaihi wasallam, bahwa ada seorang laki-laki yang datang menemui beliau dan mengaku telah berzina dengan seorang wanita yang namanya ia sebutkan kepada beliau. Rasulullah shallallahu 'alaihi wasallam lalu memanggil wanita itu dan bertanya kepadanya tentang kebenaran dari pengakuan laki-laki itu. Namun wanita tersebut tidak mengakuinya, maka Nabi mendera laki-laki itu dan membiarkan wanita tersebut.\""
            },
            {
                "number": 3730,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ أَنَّ هِشَامًا الدَّسْتُوَائِيَّ وَأَبَانَ ابْنَ يَزِيدَ حَدَّثَاهُمْ الْمَعْنَى عَنْ يَحْيَى عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ امْرَأَةً قَالَ فِي حَدِيثِ أَبَانَ مِنْ جُهَيْنَةَ أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنَّهَا زَنَتْ وَهِيَ حُبْلَى فَدَعَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلِيًّا لَهَا فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْسِنْ إِلَيْهَا فَإِذَا وَضَعَتْ فَجِئْ بِهَا فَلَمَّا أَنْ وَضَعَتْ جَاءَ بِهَا فَأَمَرَ بِهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشُكَّتْ عَلَيْهَا ثِيَابُهَا ثُمَّ أَمَرَ بِهَا فَرُجِمَتْ ثُمَّ أَمَرَهُمْ فَصَلُّوا عَلَيْهَا فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ تُصَلِّي عَلَيْهَا وَقَدْ زَنَتْ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَقَدْ تَابَتْ تَوْبَةً لَوْ قُسِّمَتْ بَيْنَ سَبْعِينَ مِنْ أَهْلِ الْمَدِينَةِ لَوَسِعَتْهُمْ وَهَلْ وَجَدْتَ أَفْضَلَ مِنْ أَنْ جَادَتْ بِنَفْسِهَا لَمْ يَقُلْ عَنْ أَبَانَ فَشُكَّتْ عَلَيْهَا ثِيَابُهَاحَدَّثَنَا مُحَمَّدُ بْنُ الْوَزِيرِ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ قَالَ فَشُكَّتْ عَلَيْهَا ثِيَابُهَا يَعْنِي فَشُدَّتْ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] bahwa [Hisyam Ad Dustuwa`i] dan [Aban bin Yazid] keduanya menceritakan kepada mereka secara makna, dari [Yahya] dari [Abu Qilabah] dari [Abu Al Muhallab] dari [Imran bin Hushain] bahwa ada seorang wanita -dalam hadits Aban ia dari Juhainah- datang kepada Nabi shallallahu 'alaihi wasallam dan mengatakan bahwa dirinya telah berzina dan sedang mengandung. Nabi shallallahu 'alaihi wasallam kemudian memanggil walinya, Rasulullah shallallahu 'alaihi wasallam bersabda kepada wali tersebut: \"Perlakukan ia dengan baik, jika ia telah melahirkan, maka bawalah ia kemari.\" Ketika wanita itu telah melahirkan, ia dibawa ke hadapan nabi shallallahu 'alaihi wasallam, beliau pun memerintahkan agar hukuman dilaksanakan. Pakaian wanita itu kemudian dirapatkan (agar auratnya tidak tersingkap), dan beliau kembali memerintahkan agar hukuman segera dilaksanakan, maka ia pun dirajam. Beliau lalu memerintahkan para sahabatnya (untuk mensholatkannya), mereka pun mensholatinya. Umar lantas berkata, \"Wahai Rasulullah, kenapa engkau mensholatinya padahal ia telah berzina!\" beliau bersabda: \"Demi Dzat yang jiwaku ada dalam tangan-Nya, ia telah bertaubat, dan sekiranya taubatnya dibagikan kepada tujuh puluh penduduk Madinah maka akan mencukupi. Apakah engkau menemukan yang lebih utama dari upaya wanita ini, ia datang sendiri dengan kerelaan hati?\". Namun perawi tidak menyebutkan dari Aban dengan lafadz 'Pakaian wanita itu kemudian dirapatkan (agar auratnya tidak tersingkap) '. Telah menceritakan kepada kami [Muhammad Ibnul Wazir Ad Dimasyqi] berkata, telah menceritakan kepada kami [Al Walid] dari [Al Auza'i] ia berkata, \"Pakaian wanita itu kemudian dirapatkan (agar auratnya tidak tersingkap), maksudnya adalah diikat.\""
            },
            {
                "number": 3731,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ عَنْ بُشَيْرِ بْنِ الْمُهَاجِرِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ أَبِيهِأَنَّ امْرَأَةً يَعْنِي مِنْ غَامِدٍ أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ إِنِّي قَدْ فَجَرْتُ فَقَالَ ارْجِعِي فَرَجَعَتْ فَلَمَّا أَنْ كَانَ الْغَدُ أَتَتْهُ فَقَالَتْ لَعَلَّكَ أَنْ تَرُدَّنِي كَمَا رَدَدْتَ مَاعِزَ بْنَ مَالِكٍ فَوَاللَّهِ إِنِّي لَحُبْلَى فَقَالَ لَهَا ارْجِعِي فَرَجَعَتْ فَلَمَّا كَانَ الْغَدُ أَتَتْهُ فَقَالَ لَهَا ارْجِعِي حَتَّى تَلِدِي فَرَجَعَتْ فَلَمَّا وَلَدَتْ أَتَتْهُ بِالصَّبِيِّ فَقَالَتْ هَذَا قَدْ وَلَدْتُهُ فَقَالَ لَهَا ارْجِعِي فَأَرْضِعِيهِ حَتَّى تَفْطِمِيهِ فَجَاءَتْ بِهِ وَقَدْ فَطَمَتْهُ وَفِي يَدِهِ شَيْءٌ يَأْكُلُهُ فَأَمَرَ بِالصَّبِيِّ فَدُفِعَ إِلَى رَجُلٍ مِنْ الْمُسْلِمِينَ وَأَمَرَ بِهَا فَحُفِرَ لَهَا وَأَمَرَ بِهَا فَرُجِمَتْ وَكَانَ خَالِدٌ فِيمَنْ يَرْجُمُهَا فَرَجَمَهَا بِحَجَرٍ فَوَقَعَتْ قَطْرَةٌ مِنْ دَمِهَا عَلَى وَجْنَتِهِ فَسَبَّهَا فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَهْلًا يَا خَالِدُ فَوَالَّذِي نَفْسِي بِيَدِهِ لَقَدْ تَابَتْ تَوْبَةً لَوْ تَابَهَا صَاحِبُ مَكْسٍ لَغُفِرَ لَهُ وَأَمَرَ بِهَا فَصُلِّيَ عَلَيْهَا وَدُفِنَتْ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] berkata, telah mengabarkan kepada kami [Isa bin Yunus] dari [Busyair Ibnul Muhajir] berkata, telah menceritakan kepada kami [Abdullah bin Buraidah] dari [Bapaknya] ia berkata, \"Seorang wanita -dari Ghamid- datang menemui Nabi shallallahu 'alaihi wasallam, ia berkata, \"Aku telah berbuat kehinaan (zina).\" Beliau bersabda: \"Pulanglah.\" Wanita itu lalu kembali pulang. Keesokan harinya ia datang lagi kepada beliau dan berkata, \"Apakah engkau akan menyuruhku untuk kembali lagi sebagaimana engkau perintahkan kepada Ma'iz! Demi Allah, sesungguhnya aku telah hamil.\" Beliau lalu bersabda kepadanya: \"Pulanglah.\" Wanita itu lalu kembali pulang. Keesokan harinya ia datang lagi kepada beliau, maka beliau pun bersabda: \"Kembalilah pulang hingga engkau melahirkan.\" Wanita itu lalu pulang. Ketika ia telah melahirkan, ia datang lagi menghadap Nabi shallallahu 'alaihi wasallam dengan membawa bayi, ia berkata, \"Aku telah melahirkan bayi ini.\" Beliau lalu bersabda kepadanya: \"Pulang dan susuilah anak itu hingga engkau menyapihnya.\" Setelah menyapihnya, wanita itu kembali menghadap Nabi shallallahu 'alaihi wasallam dengan membawa bayinya yang sedang makan sesuatu ditangannya. Beliau memerintahkan agar anak itu diserahkan kepada salah seorang laki-laki dari kaum muslimin, selanjutnya beliau memerintahkan (untuk merajamnya). Lalu dibuatlah lubang untuknya, hingga wanita itu dimasukkan ke dalam lubang dan dirajam. Dan Khalid adalah salah seorang yang ikut merajam wanita itu, ia melempar wanita itu dengan batu hingga darahnya mengenainya, ia pun mencela wanita tersebut. Nabi shallallahu 'alaihi wasallam kemudian bersabda kepada Khalid: \"Tunggu wahai Khalid! Demi Dzat yang jiwaku ada dalam tangan-Nya, ia telah bertaubat, sekiranya taubatnya dilakukan oleh seorang penganiaya, pasti ia akan diampuni.\" Beliau lantas memerintahkan (untuk mengurus jenazah wanita itu), wanita itu lalu disholati dan dikuburkan.\""
            },
            {
                "number": 3732,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعُ بْنُ الْجَرَّاحِ عَنْ زَكَرِيَّا أَبِي عِمْرَانَ قَالَ سَمِعْتُ شَيْخًا يُحَدِّثُ عَنْ ابْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجَمَ امْرَأَةً فَحُفِرَ لَهَا إِلَى الثَّنْدُوَةِقَالَ أَبُو دَاوُد أَفْهَمَنِي رَجُلٌ عَنْ عُثْمَانَ قَالَ أَبُو دَاوُد قَالَ الْغَسَّانِيُّ جُهَيْنَةُ وَغَامِدٌ وَبَارِقٌ وَاحِدٌ قَالَ أَبُو دَاوُد حُدِّثْتُ عَنْ عَبْدِ الصَّمَدِ بْنِ عَبْدِ الْوَارِثِ قَالَ حَدَّثَنَا زَكَرِيَّا بْنُ سُلَيْمٍ بِإِسْنَادِهِ نَحْوَهُ زَادَ ثُمَّ رَمَاهَا بِحَصَاةٍ مِثْلَ الْحِمِّصَةِ ثُمَّ قَالَ ارْمُوا وَاتَّقُوا الْوَجْهَ فَلَمَّا طَفِئَتْ أَخْرَجَهَا فَصَلَّى عَلَيْهَا وَقَالَ فِي التَّوْبَةِ نَحْوَ حَدِيثِ بُرَيْدَةَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki' Ibnul Jarrah] dari [Zakariya Abu Imran] ia berkata; Aku mendengar [Seorang Syaikh] menceritakan dari [Ibnu Abu Bakrah] dari [Bapaknya] berkata, \"Nabi shallallahu 'alaihi wasallam merajam seorang wanita, lalu beliau membuat lubang untuknya hingga sebatas dada.\" Abu Daud berkata, \"Seorang laki-laki memahamkan kepadaku dari Utsman.\" Abu Daud berkata lagi, \"Al Ghassani berkata, \"Juhainah, Ghamid dan Bariq itu sama.\" Abu Daud berkata, \"Aku mendapat cerita dari [Abdu Ash Shamad bin Abdul Warits], ia berkata; [Zakariya bin Sulaim] telah menceritakan kepada kami dengan sanadnya seperti hadits tersebut. Namun ia menambahkan, 'kemudian beliau melemparnya dengan kerikil-kerikil semisal biji gandum. Setelah itu beliau bersabda: \"Lemparlah, tetapi jauhilah bagian wajah.\" Ketika wanita itu telah meninggal, beliau mengeluarkannya dari lubang dan mensholatinya.\" Dan ia mengatakan dalam haditsnya tentang masalah taubat sebagaimana hadits Buraidah.\""
            },
            {
                "number": 3733,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ أَنَّهُمَا أَخْبَرَاهُأَنَّ رَجُلَيْنِ اخْتَصَمَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَحَدُهُمَا يَا رَسُولَ اللَّهِ اقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ وَقَالَ الْآخَرُ وَكَانَ أَفْقَهَهُمَا أَجَلْ يَا رَسُولَ اللَّهِ فَاقْضِ بَيْنَنَا بِكِتَابِ اللَّهِ وَأْذَنْ لِي أَنْ أَتَكَلَّمَ قَالَ تَكَلَّمْ قَالَ إِنَّ ابْنِي كَانَ عَسِيفًا عَلَى هَذَا وَالْعَسِيفُ الْأَجِيرُ فَزَنَى بِامْرَأَتِهِ فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي الرَّجْمَ فَافْتَدَيْتُ مِنْهُ بِمِائَةِ شَاةٍ وَبِجَارِيَةٍ لِي ثُمَّ إِنِّي سَأَلْتُ أَهْلَ الْعِلْمِ فَأَخْبَرُونِي أَنَّ عَلَى ابْنِي جَلْدَ مِائَةٍ وَتَغْرِيبَ عَامٍ وَإِنَّمَا الرَّجْمُ عَلَى امْرَأَتِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَا وَالَّذِي نَفْسِي بِيَدِهِ لَأَقْضِيَنَّ بَيْنَكُمَا بِكِتَابِ اللَّهِ أَمَّا غَنَمُكَ وَجَارِيَتُكَ فَرَدٌّ إِلَيْكَ وَجَلَدَ ابْنَهُ مِائَةً وَغَرَّبَهُ عَامًا وَأَمَرَ أُنَيْسًا الْأَسْلَمِيَّ أَنْ يَأْتِيَ امْرَأَةَ الْآخَرِ فَإِنْ اعْتَرَفَتْ رَجَمَهَا فَاعْتَرَفَتْ فَرَجَمَهَا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari [ubaidhullah bin Abdullah bin Utbah bin Mas'ud] dari [Abu Hurairah] dan [Zaid bin Khalid Al juhani] bahwa keduanya telah mengabarkan kepadanya, bahwa ada dua orang laki-laki bersengketa dan mengadu kepada Rasulullah shallallahu 'alaihi wasallam. salah seorang dari mereka berkata, \"Wahai Rasulullah, berilah putusan kepada kami sesuai dengan Kitabullah. Kemudian yang lainnya -dan ia yang lebih paham di antara keduanya- berkata, \"Benar, wahai Rasulullah, berilah putusan kepada kami sesuai dengan Kitabullah. Dan berilah kesempatan kepadaku untuk berbicara.\" Beliau bersabda: \"Berbicaralah.\" Laki-laki itu lalu berkata, \"Anakku kerja kepada orang ini, lalu anakku berzina dengan isterinya. Kemudian orang-orang memberi kabar kepadaku bahwa anakku harus dirajam, maka aku menebusnya dengan seratus ekor domba dan seorang budak wanita kepunyaanku. Setelah itu aku bertanya kepada ahli ilmu, mereka memberi kabar kepadaku bahwa anakku harus didera seratus kali dan diasingkan selama satu tahun, sementara wanita tersebut harus dirajam.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku ada dalam tangan-Nya, sungguh aku akan memberi putusan kepada kalian sesuai dengan Kitabullah. Kambing dan pembantu wanita milikmu akan dikembalikan kepadamu.\" Beliau lalu mendera putera laki-laki itu dan mengasingkannya selama satu tahun. Kemudian memerintahkan Unais Al Aslami untuk mendatangkan wanita tersebut, jika ia mengakui maka akan dirajam, wanita itu pun mengakuinya dan akhirnya dirajam.\""
            },
            {
                "number": 3734,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ قَالَ قَرَأْتُ عَلَى مِالِكِ بْنِ أَنَسٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ قَالَإِنَّ الْيَهُودَ جَاءُوا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرُوا لَهُ أَنَّ رَجُلًا مِنْهُمْ وَامْرَأَةً زَنَيَا فَقَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا تَجِدُونَ فِي التَّوْرَاةِ فِي شَأْنِ الزِّنَا فَقَالُوا نَفْضَحُهُمْ وَيُجْلَدُونَ فَقَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ كَذَبْتُمْ إِنَّ فِيهَا الرَّجْمَ فَأَتَوْا بِالتَّوْرَاةِ فَنَشَرُوهَا فَجَعَلَ أَحَدُهُمْ يَدَهُ عَلَى آيَةِ الرَّجْمِ ثُمَّ جَعَلَ يَقْرَأُ مَا قَبْلَهَا وَمَا بَعْدَهَا فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ سَلَامٍ ارْفَعْ يَدَيْكَ فَرَفَعَهَا فَإِذَا فِيهَا آيَةُ الرَّجْمِ فَقَالُوا صَدَقَ يَا مُحَمَّدُ فِيهَا آيَةُ الرَّجْمِ فَأَمَرَ بِهِمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُجِمَاقَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَرَأَيْتُ الرَّجُلَ يَحْنِي عَلَى الْمَرْأَةِ يَقِيهَا الْحِجَارَةَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] ia berkata; aku membaca di hadapan [Malik bin Anas] dari [nafi'] dari [Ibnu Umar] Bahwasanya ia berkata, \"Orang-orang yahudi datang kepada Nabi shallallahu 'alaihi wasallam, mereka menyebutkan di hadapan beliau bahwa ada seorang laki-laki dan perempuan dari kalangan mereka telah berbuat zina. Rasulullah shallallahu 'alaihi wasallam lalu bersabda kepada mereka: \"Hukum apa yang kalian temukan dalam Kitab Taurat kaitannya dengan zina?\" Mereka menjawab, \"Kami akan mencela dan mencambuk pelakunya.\" Abdullah bin Salam berkata, \"Kalian dusta! Dalam Taurat ada perintah rajam.\" Mereka lalu mendatangkan Taurat seraya membukanya. Salah seorang dari mereka lalu menutup ayat rajam dengan tangannya, kemudian ia membaca pada ayat sebelum dan sesudahnya (yakni tidak membaca pada bagian yang ditutup dengan tangan). Abdullah bin Salam lalu berkata, \"Angkatlah tanganmu!\" Ia pun mengangkat tangannya, maka didapatilah ayat yang berbicara tentang rajam. Mereka lantas berkata, \"Wahai Muhammad, ia benar! Di dalam taurat memang ada ayat rajam.\" Rasulullah shallallahu 'alaihi wasallam kemudian memerintahkan untuk merajam keduanya, maka keduanya dirajam.\" Abdullah bin Umar berkata, \"Aku melihat laki-laki itu mendekap wanitanya agar tidak terkena batu.\""
            },
            {
                "number": 3735,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ عَنْ الْأَعْمَشِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَمَرُّوا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَهُودِيٍّ قَدْ حُمِّمَ وَجْهُهُ وَهُوَ يُطَافُ بِهِ فَنَاشَدَهُمْ مَا حَدُّ الزَّانِي فِي كِتَابِهِمْ قَالَ فَأَحَالُوهُ عَلَى رَجُلٍ مِنْهُمْ فَنَشَدَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا حَدُّ الزَّانِي فِي كِتَابِكُمْ فَقَالَ الرَّجْمُ وَلَكِنْ ظَهَرَ الزِّنَا فِي أَشْرَافِنَا فَكَرِهْنَا أَنْ يُتْرَكَ الشَّرِيفُ وَيُقَامُ عَلَى مَنْ دُونَهُ فَوَضَعْنَا هَذَا عَنَّا فَأَمَرَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُجِمَ ثُمَّ قَالَ اللَّهُمَّ إِنِّي أَوَّلُ مَنْ أَحْيَا مَا أَمَاتُوا مِنْ كِتَابِكَ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abdul Wahid bin Ziyad] dari [Al A'masy] dari [Abdullah bin Murrah] dari [Al Bara bin Azib] ia berkata, \"Orang-orang melewati Rasulullah shallallahu 'alaihi wasallam dengan membawa seorang Yahudi yang wajahnya telah diberi arang untuk diarak. Beliau lalu bertanya kepada mereka: \"Apa hukum pezina yang termaktub dalam kitab suci mereka?\" Mereka lalu mengalihkan jawaban untuk soal itu kepada salah seorang dari mereka. Beliau lalu bertanya kepadanya: \"Apa hukum bagi pezina dalam kitab suci kalian?\" Ia menjawab, \"Rajam. Tetapi perzinaan kerap terjadi di kalangan petinggi kami, dan kami juga tidak senang jika orang terhormat tidak dikenakan hukuman dan hanya dikenakan kepada orang-orang yang rendah saja, maka akhirnya kami pun meniadakan hukuman tersebut.\" Rasulullah shallallahu 'alaihi wasallam kemudian memerintahkan agar pezina itu dihukum dengan rajam, maka ia pun dirajam. Setelah itu beliau bersabda: \"Ya Allah, aku adalah orang pertama kali yang menghidupkan terhadap apa yang mereka bekukan dari hukuman yang ada dalam kitab-Mu.\""
            },
            {
                "number": 3736,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَمُرَّ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَهُودِيٍّ مُحَمَّمٍ مَجْلُودٍ فَدَعَاهُمْ فَقَالَ هَكَذَا تَجِدُونَ حَدَّ الزَّانِي فَقَالُوا نَعَمْ فَدَعَا رَجُلًا مِنْ عُلَمَائِهِمْ قَالَ لَهُ نَشَدْتُكَ بِاللَّهِ الَّذِي أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى أَهَكَذَا تَجِدُونَ حَدَّ الزَّانِي فِي كِتَابِكُمْ فَقَالَ اللَّهُمَّ لَا وَلَوْلَا أَنَّكَ نَشَدْتَنِي بِهَذَا لَمْ أُخْبِرْكَ نَجِدُ حَدَّ الزَّانِي فِي كِتَابِنَا الرَّجْمَ وَلَكِنَّهُ كَثُرَ فِي أَشْرَافِنَا فَكُنَّا إِذَا أَخَذْنَا الرَّجُلَ الشَّرِيفَ تَرَكْنَاهُ وَإِذَا أَخَذْنَا الرَّجُلَ الضَّعِيفَ أَقَمْنَا عَلَيْهِ الْحَدَّ فَقُلْنَا تَعَالَوْا فَنَجْتَمِعُ عَلَى شَيْءٍ نُقِيمُهُ عَلَى الشَّرِيفِ وَالْوَضِيعِ فَاجْتَمَعْنَا عَلَى التَّحْمِيمِ وَالْجَلْدِ وَتَرَكْنَا الرَّجْمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ إِنِّي أَوَّلُ مَنْ أَحْيَا أَمْرَكَ إِذْ أَمَاتُوهُ فَأَمَرَ بِهِ فَرُجِمَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ يَا أَيُّهَا الرَّسُولُ لَا يَحْزُنْكَ الَّذِينَ يُسَارِعُونَ فِي الْكُفْرِ إِلَى قَوْلِهِ يَقُولُونَ إِنْ أُوتِيتُمْ هَذَا فَخُذُوهُ وَإِنْ لَمْ تُؤْتَوْهُ فَاحْذَرُوا إِلَى قَوْلِهِ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمْ الْكَافِرُونَ فِي الْيَهُودِ إِلَى قَوْلِهِ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمْ الظَّالِمُونَ فِي الْيَهُودِ إِلَى قَوْلِهِ وَمَنْ لَمْ يَحْكُمْ بِمَا أَنْزَلَ اللَّهُ فَأُولَئِكَ هُمْ الْفَاسِقُونَ }قَالَ هِيَ فِي الْكُفَّارِ كُلُّهَا يَعْنِي هَذِهِ الْآيَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul 'Ala] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Al A'masy] dari [Abdullah bin Murrah] dari [Al bara bin Azib] ia berkata, \"Seorang yahudi yang wajahnya menghitam (karena dilumuri arang) dan telah dicambuk dibawa melewati Rasulullah shallallahu 'alaihi wasallam, beliau lantas memanggil mereka seraya bertanya: \"Beginikah kalian mendapati hukum bagi pezina?\" Mereka menjawab, \"Benar.\" Beliau lalu memanggil seorang laki-laki dari ulama mereka, beliau bersabda: \"Kami bersumpah kepada Allah atas kamu, Dzat yang menurunkan Taurat kepada Musa. Apakah begini kalian mendapati hukuman bagi pezina dalam kitab kalian?\" Laki-laki itu berkata, \"Demi Allah, tidak. Sekiranya engkau tidak bersumpah kepada Allah aku tidak akan mengabarimu. Kami mendapati hukum bagi pezina dalam kitab kami adalah dengan hukum rajam. Tetapi perzinaan itu justru banyak terjadi dikalangan orang-orang terhormat di antara kami, ketika kami mendapati mereka melakukannya, kami tidak memberlakukan hukuman rajam tersebut. Namun jika itu dilakukan oleh orang-orang rendahan di antara kami, maka kami melaksanakannya. Lalu kami berembuk untuk mencari hukuman yang bisa kami terapkan kepada pezina baik dari kalangan terhormat maupun kalangan rendahan di antara kami. Maka kami bersepakat dengan hukuman tahmim (mencoreng muka dengan arang) dan hukuman cambuk.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Ya Allah, sungguh aku adalah orang pertama yang menghidupkan kembali perintah-Mu (hukuman had) ketika mereka mematikannya (tidak melaksanakannya).\" Beliau lalu memerintahkan agar pezina itu dirajam, akhirnya pezina itu pun dirajam. Allah Azza Wa Jalla lalu menurunkan ayat: '(Hai Rasul, janganlah hendaknya kamu disedihkan oleh orang-orang yang bersegera (memperlihatkan) kekafirannya..) ', hingga firman-Nya; '(Mereka mengatakan: \"Jika diberikan ini (yang sudah di robah-robah oleh mereka) kepada kamu, maka terimalah, dan jika kamu diberi yang bukan ini maka hati-hatilah'), hingga firman-Nya; '(Barangsiapa yang tidak memutuskan menurut apa yang diturunkan Allah, maka mereka itu adalah orang-orang yang kafir) ', ayat ini berkenaan dengan orang-orang yahudi, hingga firman-Nya; '(Barangsiapa tidak memutuskan perkara menurut apa yang diturunkan Allah, maka mereka itu adalah orang-orang yang zalim) ', ayat ini berkenaan dengan orang-orang yahudi, hingga firman-Nya; '(Barangsiapa tidak memutuskan perkara menurut apa yang diturunkan Allah, maka mereka itu adalah orang-orang yang fasik) ', semua ayat-ayat tersebut berkenaan dengan orang-orang kafir.\""
            },
            {
                "number": 3737,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي هِشَامُ بْنُ سَعْدٍ أَنَّ زَيْدَ بْنَ أَسْلَمَ حَدَّثَهُ عَنْ ابْنِ عُمَرَ قَالَأَتَى نَفَرٌ مِنْ يَهُودٍ فَدَعَوْا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْقُفِّ فَأَتَاهُمْ فِي بَيْتِ الْمِدْرَاسِ فَقَالُوا يَا أَبَا الْقَاسِمِ إِنَّ رَجُلًا مِنَّا زَنَى بِامْرَأَةٍ فَاحْكُمْ بَيْنَهُمْ فَوَضَعُوا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وِسَادَةً فَجَلَسَ عَلَيْهَا ثُمَّ قَالَ بِالتَّوْرَاةِ فَأُتِيَ بِهَا فَنَزَعَ الْوِسَادَةَ مِنْ تَحْتِهِ فَوَضَعَ التَّوْرَاةَ عَلَيْهَا ثُمَّ قَالَ آمَنْتُ بِكِ وَبِمَنْ أَنْزَلَكِ ثُمَّ قَالَ ائْتُونِي بِأَعْلَمِكُمْ فَأُتِيَ بِفَتًى شَابٍّثُمَّ ذَكَرَ قِصَّةَ الرَّجْمِ نَحْوَ حَدِيثِ مَالِكٍ عَنْ نَافِعٍ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Al Hamdani] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah menceritakan kepadaku [Hisyam bin Sa'd] bahwa [Zaid bin Aslam] ia menceritakan kepadanya dari [Ibnu Umar] ia berkata, \"Beberapa orang yahudi datang dan mengundang Rasulullah shallallahu 'alaihi wasallam untuk hadir ke Quff (tempat dekat Madinah), lalu beliau mendatangi mereka di tempat yang biasa mereka gunakan untuk mengaji. Mereka berkata, \"Wahai Abul Qasim, seorang laki-laki di antara kami berzina dengan seorang wanita, maka tetapkanlah hukum bagi mereka.\" Mereka lantas memberi bantal Rasulullah shallallahu 'alaihi wasallam untuk digunakan duduk, beliau pun duduk. Kemudian beliau minta diambilkan Taurat, naskah Taurat itu lalu diberikan kepada beliau. Beliau menarik bantal yang didudukinya dan meletakkan Taurat tersebut di atasnya seranya bersabda: \"Aku beriman kepadamu dan kepada Dzat Yang menurunkanmu.\" Setelah itu beliau bersabda: \"Hadirkanlah kepadaku orang yang paling paham di antara kalian.\" Lalu dihadirkanlah seorang pemuda, lalu ia menyebutkan kisah rajam sebagaimana hadits Malik dari Nafi'.\""
            },
            {
                "number": 3738,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ حَدَّثَنَا رَجُلٌ مِنْ مُزَيْنَةَ ح و حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَنْبَسَةُ حَدَّثَنَا يُونُسُ قَالَ قَالَ مُحَمَّدُ بْنُ مُسْلِمٍ سَمِعْتُ رَجُلًا مِنْ مُزَيْنَةَ مِمَّنْ يَتَّبِعُ الْعِلْمَ وَيَعِيهِ ثُمَّ اتَّفَقَا وَنَحْنُ عِنْدَ سَعِيدِ بْنِ الْمُسَيِّبِ فَحَدَّثَنَا عَنْ أَبِي هُرَيْرَةَ وَهَذَا حَدِيثُ مَعْمَرٍ وَهُوَ أَتَمُّ قَالَزَنَى رَجُلٌ مِنْ الْيَهُودِ وَامْرَأَةٌ فَقَالَ بَعْضُهُمْ لِبَعْضٍ اذْهَبُوا بِنَا إِلَى هَذَا النَّبِيِّ فَإِنَّهُ نَبِيٌّ بُعِثَ بِالتَّخْفِيفِ فَإِنْ أَفْتَانَا بِفُتْيَا دُونَ الرَّجْمِ قَبِلْنَاهَا وَاحْتَجَجْنَا بِهَا عِنْدَ اللَّهِ قُلْنَا فُتْيَا نَبِيٍّ مِنْ أَنْبِيَائِكَ قَالَ فَأَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ جَالِسٌ فِي الْمَسْجِدِ فِي أَصْحَابِهِ فَقَالُوا يَا أَبَا الْقَاسِمِ مَا تَرَى فِي رَجُلٍ وَامْرَأَةٍ زَنَيَا فَلَمْ يُكَلِّمْهُمْ كَلِمَةً حَتَّى أَتَى بَيْتَ مِدْرَاسِهِمْ فَقَامَ عَلَى الْبَابِ فَقَالَ أَنْشُدُكُمْ بِاللَّهِ الَّذِي أَنْزَلَ التَّوْرَاةَ عَلَى مُوسَى مَا تَجِدُونَ فِي التَّوْرَاةِ عَلَى مَنْ زَنَى إِذَا أَحْصَنَ قَالُوا يُحَمَّمُ وَيُجَبَّهُ وَيُجْلَدُ وَالتَّجْبِيهُ أَنْ يُحْمَلَ الزَّانِيَانِ عَلَى حِمَارٍ وَتُقَابَلُ أَقْفِيَتُهُمَا وَيُطَافُ بِهِمَا قَالَ وَسَكَتَ شَابٌّ مِنْهُمْ فَلَمَّا رَآهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَكَتَ أَلَظَّ بِهِ النِّشْدَةَ فَقَالَ اللَّهُمَّ إِذْ نَشَدْتَنَا فَإِنَّا نَجِدُ فِي التَّوْرَاةِ الرَّجْمَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا أَوَّلُ مَا ارْتَخَصْتُمْ أَمْرَ اللَّهِ قَالَ زَنَى ذُو قَرَابَةٍ مِنْ مَلِكٍ مِنْ مُلُوكِنَا فَأَخَّرَ عَنْهُ الرَّجْمَ ثُمَّ زَنَى رَجُلٌ فِي أُسْرَةٍ مِنْ النَّاسِ فَأَرَادَ رَجْمَهُ فَحَالَ قَوْمُهُ دُونَهُ وَقَالُوا لَا يُرْجَمُ صَاحِبُنَا حَتَّى تَجِيءَ بِصَاحِبِكَ فَتَرْجُمَهُ فَاصْطَلَحُوا عَلَى هَذِهِ الْعُقُوبَةِ بَيْنَهُمْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنِّي أَحْكُمُ بِمَا فِي التَّوْرَاةِ فَأَمَرَ بِهِمَا فَرُجِمَاقَالَ الزُّهْرِيُّ فَبَلَغَنَا أَنَّ هَذِهِ الْآيَةَ نَزَلَتْ فِيهِمْ{ إِنَّا أَنْزَلْنَا التَّوْرَاةَ فِيهَا هُدًى وَنُورٌ يَحْكُمُ بِهَا النَّبِيُّونَ الَّذِينَ أَسْلَمُوا }كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] berkata, telah menceritakan kepada kami [laki-laki Muzainah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Anbasah] berkata, telah menceritakan kepada kami [Yunus] ia berkata; [Muhammad bin Muslim] ia berkata; Aku mendengar [seorang laki-laki] Muzainah, orang yang tekun dalam menuntut ilmu dan menghafalnya, keduanya (Ma'mar dan Yunus) lalu sepakat, sementara kami sedang berada di sisi Sa'id Ibnul Musayyab, ia berkata; telah menceritakan kepada kami dari [Abu Hurairah] -dan ini adalah hadits Ma'mar, dan ini lebih lengkap-, ia berkata, \"Seorang laki-laki yahudi berzina dengan seorang wanita. Lalu sebagian mereka berkata kepada sebagian yang lain, \"Mari kita mendatangi Nabi ini (Muhammad shallallahu 'alaihi wasallam), ia adalah seorang Nabi yang diutus dengan membawa kemudahan, jika nanti ia memberi fatwa kepada kita dengan hukuman selain rajam, hendaklah kita terima, lalu kita gunakan sebagai hujah di sisi Allah 'Ini adalah fatwa dari seorang Nabi di antara para Nabi-Mu'.\" Ia (perawi) berkata, \"Mereka akhirnya mendatangi Nabi shallallahu 'alaihi wasallam yang sedang duduk-duduk di masjid bersama para sahabatnya. Mereka mengatakan, \"Wahai Abul Qasim, apa pendapatmu jika laki-laki dan perempuan melakukan perzinaan?\" Beliau tidak memberi mereka jawaban satu kata pun hingga beliau mendatangi mereka di tempat mereka mengaji. Beliau lalu berdiri di depan pintu seraya bersabda: \"Aku bersumpah kepadamu dengan nama Allah yang telah menurunkan Taurat kepada Musa, hukuman apa yang kalian dapati dalam Kitab suci kalian bagi pezina yang telah menikah?\" mereka menjawab, \"Wajahnya dilumuri arang, lalu dinaikkan himar (dengan saling membelakangi), lalu diarak dan didera.\" Seorang pemuda dari mereka terdiam. Maka ketika Nabi shallallahu 'alaihi wasallam melihat pemuda itu diam, beliau menguatkan sumpah kepadanya agar ia memberi jawaban. Ia pun berkata, \"(Ya Allah), jika engkau (Muhammad) bersumpah kepada kami, maka sesungguhnya kami mendapati dalam kitab Taurat adalah hukuman rajam.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Lalu siapa yang pertama kali kalian ringankan dari hukuman Allah (rajam) tersebut? Pemuda itu menjawab, \"Ketika salah seorang kerabat raja kami berbuat zina, maka hukuman rajam itu ditangguhkan. Kemudian ketika ada salah seorang laki-laki dari suatu kaum berbuat zina dan akan ditegakkan hukuman rajam atasnya, kaumnya ikut menghalang-halanginya. Mereka mengatakan, \"Sahabat kami tidak akan dirajam hingga engkau datang dengan sahabat kamu untuk dirajam (bersama-sama). ' Maka mereka semua akhirnya sepakat dengan hukuman ini.\" Nabi shallallahu 'alaihi wasallam lalu bersabda: \"Aku akan menghukumi sebagaimana yang ada dalam Taurat.\" Beliau lalu memerintahkan (agar keduanya dirajam), maka keduanya pun dirajam.\" Az Zuhri berkata, \"Telah sampai kabar kepada kami bahwa ayat ini turun berkenaan dengan mereka: '(Sesungguhnya Kami telah menurunkan Kitab Taurat di dalamnya (ada) petunjuk dan cahaya (yang menerangi), yang dengan Kitab itu diputuskan perkara orang-orang Yahudi oleh nabi-nabi yang menyerah diri kepada Allah..) ' dan Nabi shallallahu 'alaihi wasallam adalah termasuk dari para Nabi tersebut.\""
            },
            {
                "number": 3739,
                "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى أَبُو الْأَصْبَغِ الْحَرَّانِيُّ حَدَّثَنِي مُحَمَّدٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ الزُّهْرِيِّ قَالَ سَمِعْتُ رَجُلًا مِنْ مُزَيْنَةَ يُحَدِّثُ سَعِيدَ بْنَ الْمُسَيِّبِ عَنْ أَبِي هُرَيْرَةَ قَالَزَنَى رَجُلٌ وَامْرَأَةٌ مِنْ الْيَهُودِ وَقَدْ أُحْصِنَا حِينَ قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وَقَدْ كَانَ الرَّجْمُ مَكْتُوبًا عَلَيْهِمْ فِي التَّوْرَاةِ فَتَرَكُوهُ وَأَخَذُوا بِالتَّجْبِيهِ يُضْرَبُ مِائَةً بِحَبْلٍ مَطْلِيٍّ بِقَارٍ وَيُحْمَلُ عَلَى حِمَارٍ وَجْهُهُ مِمَّا يَلِي دُبُرَ الْحِمَارِ فَاجْتَمَعَ أَحْبَارٌ مِنْ أَحْبَارِهِمْ فَبَعَثُوا قَوْمًا آخَرِينَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا سَلُوهُ عَنْ حَدِّ الزَّانِي وَسَاقَ الْحَدِيثَ فَقَالَ فِيهِ قَالَ وَلَمْ يَكُونُوا مِنْ أَهْلِ دِينِهِ فَيَحْكُمَ بَيْنَهُمْ فَخُيِّرَ فِي ذَلِكَ قَالَ{ فَإِنْ جَاءُوكَ فَاحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ }",
                "id": "Telah menceritakan kepada kami [Abdul Aziz bin Yahya Abu Al Ashbagh Al Harrani] berkata, telah menceritakan kepadaku [Muhammad] -maksudnya Muhammad bin Salamah- dari [Muhammad bin Ishaq] dari [Az Zuhri] ia berkata, \"Aku mendengar [seorang laki-laki] dari Muzainah menceritakan dari Sa'id Ibnul Musayyab, dari [Abu Hurairah] ia berkata, \"Seorang laki-laki dan perempuan yahudi melakukan perbuatan zina, sementara keduanya sama-sama telah menikah ketika Rasulullah shallallahu 'alaihi wasallam datang ke Madinah. Padahal, sesuai dengan ketentuan Taurat mereka harus mendapatkan hukuman rajam. Namun mereka tidak melaksanakan hukuman itu dan menggantinya dengan Tajbih, yakni didera dengan cambuk sebanyak seratus kali dengan cambuk yang dilumuri warna hitam. Lalu diarak dengan dinaikkan himar, sementara wajah mereka menghadap ke arah bokong himar. Para ulama` mereka lalu berkumpul, mereka kemudian mengutus beberapa orang untuk menemui Rasulullah shallallahu 'alaihi wasallam. Para ulama` itu berkata, \"Bertanyalah kepada Muhammad apa hukum bagi pezina…lalu ia menyebutkan hadits selengkapnya. Ia berkata, \"Orang-orang yahudi itu bukan termasuk orang yang seagama dengannya (Rasulullah) namun beliau harus memberi putusan kepada mereka. Maka beliau diberi pilihan, Allah berfirman: '(Jika mereka (orang Yahudi) datang kepadamu (untuk meminta putusan), maka putuskanlah (perkara itu) diantara mereka, atau berpalinglah dari mereka..) ' -Al Maidah: 42-. "
            },
            {
                "number": 3740,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ حَدَّثَنَا أَبُو أُسَامَةَ قَالَ مُجَالِدٌ أَخْبَرَنَا عَنْ عَامِرٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَجَاءَتْ الْيَهُودُ بِرَجُلٍ وَامْرَأَةٍ مِنْهُمْ زَنَيَا فَقَالَ ائْتُونِي بِأَعْلَمِ رَجُلَيْنِ مِنْكُمْ فَأَتَوْهُ بِابْنَيْ صُورِيَا فَنَشَدَهُمَا كَيْفَ تَجِدَانِ أَمْرَ هَذَيْنِ فِي التَّوْرَاةِ قَالَا نَجِدُ فِي التَّوْرَاةِ إِذَا شَهِدَ أَرْبَعَةٌ أَنَّهُمْ رَأَوْا ذَكَرَهُ فِي فَرْجِهَا مِثْلَ الْمِيلِ فِي الْمُكْحُلَةِ رُجِمَا قَالَ فَمَا يَمْنَعُكُمَا أَنْ تَرْجُمُوهُمَا قَالَا ذَهَبَ سُلْطَانُنَا فَكَرِهْنَا الْقَتْلَ فَدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالشُّهُودِ فَجَاءُوا بِأَرْبَعَةٍ فَشَهِدُوا أَنَّهُمْ رَأَوْا ذَكَرَهُ فِي فَرْجِهَا مِثْلَ الْمِيلِ فِي الْمُكْحُلَةِ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجْمِهِمَاحَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ هُشَيْمٍ عَنْ مُغِيرَةَ عَنْ إِبْرَاهِيمَ وَالشَّعْبِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ لَمْ يَذْكُرْ فَدَعَا بِالشُّهُودِ فَشَهِدُوا حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ هُشَيْمٍ عَنْ ابْنِ شُبْرُمَةَ عَنْ الشَّعْبِيِّ بِنَحْوٍ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Musa Al Balkhi] berkata, telah menceritakan kepada kami [Abu Usamah] berkata; [Mujalid] berkata; telah mengabarkan kepada kami dari [Amir] dari [Jabir bin Abdullah] ia berkata, \"Orang-orang yahudi datang dengan membawa seorang laki-laki dan perempuan mereka yang telah melakukan perzinaan. Beliau lalu bersabda: \"Datangkan kepadaku orang yang paling tahu dari cendikia kalian.\" Mereka lalu mendatangkan dua anak Shuriya, beliau bertanya kepada keduanya: \"Hukuman apa yang kalian dapatkan dalam kitab Taurat berkenaan dengan kedua pezina ini?\" keduanya menjawab, \"Kami mendapatkan dalam kitab taurat; jika ada empat orang saksi yang menyatakan bahwa mereka telah melihat kemaluan si laki-laki masuk ke dalam kemaluan wanita seperti pena celak masuk ke dalam botolnya, maka mereka harus dirajam.\" Beliau bertanya lagi: \"Lalu apa yang menghalangi kalian untuk merajam mereka berdua?\" keduanya menjawab, \"Kekuasaan kami telah hilang, maka kami takut untuk dibunuh.\" Rasulullah shallallahu 'alaihi wasallam lantas meminta didatangkan beberapa orang saksi, mereka lalu datang dengan membawa empat orang saksi yang kemudian menyatakan kesaksiannya, bahwa mereka melihat kemaluan si lelaki masuk ke dalam kemaluan wanita layaknya pena celak masuk ke dalam botolnya. Maka, Rasulullah shallallahu 'alaihi wasallam kemudian memerintahkan untuk merajam keduanya.\" Telah menceritakan kepada kami [Wahb bin Baqiyyah] dari [Husyaim] dari [Mugirah] dari [Ibrahim] dan [Asy Sya'bi] dari Nabi shallallahu 'alaihi wasallam sebagaimana hadits tersebut. Namun tidak disebutkan, 'beliau lalu minta didatangkan empat orang saksi, lalu mereka pun bersaksi.\" Telah menceritakan kepada kami [Wahb bin baqiyyah] dari [Husyaim] dari [Ibnu Syubrumah] dari [Asy Sya'bi] seperti hadits tersebut.\""
            },
            {
                "number": 3741,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَسَنٍ الْمِصِّيصِيُّ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ أَنَّهُ سَمِعَ أَبَا الزُّبَيْرِ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُرَجَمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا مِنْ الْيَهُودِ وَامْرَأَةً زَنَيَا",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Hasan Al Mishishi] berkata, telah menceritakan kepada kami [Hajjaj bin Muhammad] ia berkata; telah menceritakan kepada kami [Ibnu Juraij] Bahwasanya ia mendengar [Abu Az Zubair] pernah mendengar [Jabir bin Abdullah] berkata, \"Nabi shallallahu 'alaihi wasallam pernah merajam seorang laki-laki dan perempuan yahudi yang berbuat zina.\""
            },
            {
                "number": 3742,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مُطَرِّفٌ عَنْ أَبِي الْجَهْمِ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَبَيْنَا أَنَا أَطُوفُ عَلَى إِبِلٍ لِي ضَلَّتْ إِذْ أَقْبَلَ رَكْبٌ أَوْ فَوَارِسُ مَعَهُمْ لِوَاءٌ فَجَعَلَ الْأَعْرَابُ يَطِيفُونَ بِي لِمَنْزِلَتِي مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ أَتَوْا قُبَّةً فَاسْتَخْرَجُوا مِنْهَا رَجُلًا فَضَرَبُوا عُنُقَهُ فَسَأَلْتُ عَنْهُ فَذَكَرُوا أَنَّهُ أَعْرَسَ بِامْرَأَةِ أَبِيهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Khalid bin Abdullah] berkata, telah menceritakan kepada kami [Mutharrif] dari [Abul Jahm] dari [Al Bara bin Azib] ia berkata, \"Ketika aku sedang berkeliling mencari untaku yang hilang, aku berpapasan dengan sekelompok penunggang kuda, dan mereka membawa bendera. Lalu orang-orang itu mengajakku untuk ikut serta karena kedekatanku dengan nabi shallallahu 'alaihi wasallam. saat mereka mendatangi sebuah qubah (rumah), mereka mengeluarkan seorang laki-laki darinya dengan paksa dan membunuhnya. Aku lantas bertanya (tentang hal itu), mereka lalu menyebutkan bahwasanya ia telah menikahi isteri bapaknya.\""
            },
            {
                "number": 3743,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ قُسَيْطٍ الرَّقِّيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ يَزِيدَ بْنِ الْبَرَاءِ عَنْ أَبِيهِ قَالَلَقِيتُ عَمِّي وَمَعَهُ رَايَةٌ فَقُلْتُ لَهُ أَيْنَ تُرِيدُ قَالَ بَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى رَجُلٍ نَكَحَ امْرَأَةَ أَبِيهِ فَأَمَرَنِي أَنْ أَضْرِبَ عُنُقَهُ وَآخُذَ مَالَهُ",
                "id": "Telah menceritakan kepada kami [Amru bin Qusaith Ar raqqi] berkata, telah menceritakan kepada kami [ubaidhullah bin Amru] dari [Zaid bin Abu Unaisah] dari [Adi bin Tsabit] dari [Yazid Ibnul Bara] dari [Bapaknya] ia berkata, \"Aku pernah bertemu dengan pamanku yang ketika itu sedang membawa bendera. Aku lalu bertanya kepadanya, \"Mau kemana engkau akan pergi?\" ia menjawab, \"Rasulullah shallallahu 'alaihi wasallam mengutusku untuk mendatangi seorang laki-laki yang menikahi isteri bapaknya, beliau memerintahkan kepadaku untuk memenggal lehernya dan mengambil hartanya.\""
            },
            {
                "number": 3744,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ حَدَّثَنَا قَتَادَةُ عَنْ خَالِدِ بْنِ عُرْفُطَةَ عَنْ حَبِيبِ بْنِ سَالِمٍأَنَّ رَجُلًا يُقَالُ لَهُ عَبْدُ الرَّحْمَنِ بْنُ حُنَيْنٍ وَقَعَ عَلَى جَارِيَةِ امْرَأَتِهِ فَرُفِعَ إِلَى النُّعْمَانِ بْنِ بَشِيرٍ وَهُوَ أَمِيرٌ عَلَى الْكُوفَةِ فَقَالَ لَأَقْضِيَنَّ فِيكَ بِقَضِيَّةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ كَانَتْ أَحَلَّتْهَا لَكَ جَلَدْتُكَ مِائَةً وَإِنْ لَمْ تَكُنْ أَحَلَّتْهَا لَكَ رَجَمْتُكَ بِالْحِجَارَةِ فَوَجَدُوهُ قَدْ أَحَلَّتْهَا لَهُ فَجَلَدَهُ مِائَةًقَالَ قَتَادَةُ كَتَبْتُ إِلَى حَبِيبِ بْنِ سَالِمٍ فَكَتْبَ إِلَيَّ بِهَذَا",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Aban] berkata, telah menceritakan kepada kami [Qatadah] dari [Khalid bin Urfuthah] dari [Habib bin Salim] berkata, \"Bahwa ada seorang laki-laki yang bernama 'Abdurrahman bin Hunain berzina dengan budak wanita milik isterinya. Maka kasus itu disampaikan kepada Nu'man bin Basyir, gubernur Kufah saat itu. [Nu'man] lalu berkata, \"Sunguh, aku akan memberi putusan kepada kamu sebagaimana putusan Rasulullah shallallahu 'alaihi wasallam. Jika isterimu menghalalkannya untukmu maka aku akan menderamu sebanyak seratus kali, namun jika isterimu tidak menghalalkannya untukmu maka aku akan merajam kamu dengan batu. Orang-orang lalu mendapatkan (kejelasan) bahwa isterinya telah menghalalkan budak wanita itu untuknya, maka Nu'man menderanya sebanyak seratus kali.\" Qatadah berkata, \"Aku menulis surat kepada Habib bin Salim, lalu ia memberi balasan dengan hadits tersebut.\""
            },
            {
                "number": 3745,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ شُعْبَةَ عَنْ أَبِي بِشْرٍ عَنْ خَالِدِ بْنِ عُرْفُطَةَ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الرَّجُلِ يَأْتِي جَارِيَةَ امْرَأَتِهِ قَالَ إِنْ كَانَتْ أَحَلَّتْهَا لَهُ جُلِدَ مِائَةً وَإِنْ لَمْ تَكُنْ أَحَلَّتْهَا لَهُ رَجَمْتُهُ",
                "id": "telah menceritakan kepada kami [Muhammad bin Basysyar] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] dari [Syu'bah] dari [Abu Bisyr] dari [Khalid bin Urfuthah] dari [Habib bin Salim] dari [An Nu'man bin Basyir] dari Nabi shallallahu 'alaihi wasallam, tentang seorang laki-laki yang mensetubuhi budak wanita milik isterinya: \"Jika isterinya menghalalkan baginya (suami), maka hukumannya adalah dera seratus kali. Namun jika tidak menghalalkan baginya, maka aku akan merajamnya.\""
            },
            {
                "number": 3746,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ قَبِيصَةَ بْنِ حُرَيْثٍ عَنْ سَلَمَةَ بْنِ الْمُحَبَّقِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي رَجُلٍ وَقَعَ عَلَى جَارِيَةِ امْرَأَتِهِ إِنْ كَانَ اسْتَكْرَهَهَا فَهِيَ حُرَّةٌ وَعَلَيْهِ لِسَيِّدَتِهَا مِثْلُهَا فَإِنْ كَانَتْ طَاوَعَتْهُ فَهِيَ لَهُ وَعَلَيْهِ لِسَيِّدَتِهَا مِثْلُهَاقَالَ أَبُو دَاوُد رَوَى يُونُسُ بْنُ عُبَيْدٍ وَعَمْرُو بْنُ دِينَارٍ وَمَنْصُورُ بْنُ زَاذَانَ وَسَلَّامٌ عَنْ الْحَسَنِ هَذَا الْحَدِيثَ بِمَعْنَاهُ لَمْ يَذْكُرْ يُونُسُ وَمَنْصُورٌ قَبِيصَةَ حَدَّثَنَا عَلِيُّ بْنُ حُسَيْنٍ الدِّرْهَمِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَلَمَةَ بْنِ الْمُحَبَّقِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ إِلَّا أَنَّهُ قَالَ وَإِنْ كَانَتْ طَاوَعَتْهُ فَهِيَ وَمِثْلُهَا مِنْ مَالِهِ لَسَيِّدَتِهَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Qatadah] dari [Al Hasan] dari [Qabishah bin Huraits] dari [Salamah Ibnul Muhabbaq] berkata, \"Bahwasanya Rasulullah shallallahu 'alaihi wasallam memberi putusan atas seorang laki-laki yang mensetubuhi budak wanita milik isterinya. Jika sang suami memaksanya maka sang budak menjadi merdeka, dan suami tetap menunaikan segala tanggung jawab terhadap isterinya sebagaimana tanggung jawabnya terhadap budaknya. Namun jika sang budak mempersilahkan dirinya secara sukarela, budak itu berpindah tangan menjadi budak suaminya, dan suami tetap menunaikan tanggung jawab terhadap isterinya.\" Abu Dawud berkata, \" [Yunus bin Ubaid], [Amru bin dinar], [Manshur bin Zadzan] dan [Salam] meriwayatkan hadits ini dari [Al Hasan] secara makna. Sementara Yunus dan Manshur tidak menyebutkan nama Qabishah.\" Telah menceritakan kepada kami [Ali bin Husain Ad Dirhami] berkata, telah menceritakan kepada kami [Abdul A'la] dari [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Salamah Ibnul Muhabbaq] dari Nabi shallallahu 'alaihi wasallam seperti hadits ini, hanya saja ia menyebutkan, \"Jika budak wanita itu menurut dengan suka rela, maka ia (budak wanita) dan harta yang ia dapat dari si suami menjadi milik majikannya (isteri).\""
            },
            {
                "number": 3747,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ النُّفَيْلِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ وَجَدْتُمُوهُ يَعْمَلُ عَمَلَ قَوْمِ لُوطٍ فَاقْتُلُوا الْفَاعِلَ وَالْمَفْعُولَ بِهِقَالَ أَبُو دَاوُد رَوَاهُ سُلَيْمَانُ بْنُ بِلَالٍ عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو مِثْلَهُ وَرَوَاهُ عَبَّادُ بْنُ مَنْصُورٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ رَفَعَهُ وَرَوَاهُ ابْنُ جُرَيْجٍ عَنْ إِبْرَاهِيمَ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ رَفَعَهُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad bin Ali An Nufaili] berkata, telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Amru bin Abu Amru] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang kalian dapati sedang melakukan perbuatan kaum Luth, maka bunuhlah; pelaku dan objeknya.\" Abu Dawud berkata, \" [Sulaiman bin Bilal] meriwayatkannya dari [Amru bin Abu Amru] seperti hadits tersebut. Dan [Abbad bin Manshur] meriwayatkannya dari [Ikrimah], dari [Ibnu Abbas], dan ia memarfu'kannya. [Ibnu Juraij] meriwayatkannya dari [Ibrahim], dari [Dawud Ibnul Hushain], dari [Ikrimah], dari [Ibnu Abbas], dan ia memarfu'kannya.\""
            },
            {
                "number": 3748,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ بْنِ رَاهَوَيْهِ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ خُثَيْمٍ قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ وَمُجَاهِدًا يُحَدِّثَانِ عَنْ ابْنِ عَبَّاسٍفِي الْبِكْرِ يُؤْخَذُ عَلَى اللُّوطِيَّةِ قَالَ يُرْجَمُقَالَ أَبُو دَاوُد حَدِيثُ عَاصِمٍ يُضَعِّفُ حَدِيثَ عَمْرِو بْنِ أَبِي عَمْرٍو",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim bin Rahawaih] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ibnu Juraij] berkata, telah mengabarkan kepadaku [Ibnu Khutsaim] ia berkata, \"Aku mendengar [Sa'id bin Jubair] dan [Mujahid] menceritakan dari [Ibnu Abbas] tentang seorang gadis yang melakukan perbuatan kaum Luth, ia berkata, \"Hukumannya adalah rajam.\" Abu Dawud berkata, \"Hadits Abu Dawud ini melemahkan hadits Amru bin Abu Amru.\""
            },
            {
                "number": 3749,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ حَدَّثَنِي عَمْرُو بْنُ أَبِي عَمْرٍو عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَتَى بَهِيمَةً فَاقْتُلُوهُ وَاقْتُلُوهَا مَعَهُ قَالَ قُلْتُ لَهُ مَا شَأْنُ الْبَهِيمَةِ قَالَ مَا أُرَاهُ قَالَ ذَلِكَ إِلَّا أَنَّهُ كَرِهَ أَنْ يُؤْكَلَ لَحْمُهَا وَقَدْ عُمِلَ بِهَا ذَلِكَ الْعَمَلُقَالَ أَبُو دَاوُد لَيْسَ هَذَا بِالْقَوِيِّ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] berkata, telah menceritakan kepada kami [Abdul Aziz bin Muhammad] berkata, telah menceritakan kepadaku [Amru bin Abu Amru] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mensetubuhi binatang maka bunuhlah ia beserta binatang tersebut.\" Ibnu Abbas berkata, \"Aku lantas bertanya kepada Rasulullah, \"Apa salah binatang tersebut?\" Ibnu abbas berkata, \"Aku tidak melihat beliau mengatakan begitu kecuali karena sebab, bahwa beliau tidak suka jika binatang yang telah disetubuhi itu dimakan dagingnya.\" Abu Dawud berkata, \"Namun derajat hadits ini tidak kuat.\""
            },
            {
                "number": 3750,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ أَنَّ شَرِيكًا وَأَبَا الْأَحْوَصِ وَأَبَا بَكْرِ بْنَ عَيَّاشٍ حَدَّثُوهُمْ عَنْ عَاصِمٍ عَنْ أَبِي رَزِينٍ عَنْ ابْنِ عَبَّاسٍ قَالَلَيْسَ عَلَى الَّذِي يَأْتِي الْبَهِيمَةَ حَدٌّقَالَ أَبُو دَاوُد وَكَذَا قَالَ عَطَاءٌ و قَالَ الْحَكَمُ أَرَى أَنْ يُجْلَدَ وَلَا يُبْلَغَ بِهِ الْحَدَّ و قَالَ الْحَسَنُ هُوَ بِمَنْزِلَةِ الزَّانِي قَالَ أَبُو دَاوُد حَدِيثُ عَاصِمٍ يُضَعِّفُ حَدِيثَ عَمْرِو بْنِ أَبِي عَمْرٍو",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] bahwa [Syarik] dan [Abu Al Ahwash] dan [Abu bakr bin Ayyasy] menceritakan kepada mereka dari [Ashim] dari [Abu Razin] dari [Ibnu Abbas] ia berkata, \"Orang yang mensetubuhi binatang tidak ada hukuman hadnya.\" Abu Dawud berkata, \"Atha juga mengatakan begitu.\" Al hakam berkata, \"Menurutku ia harus didera, meskipun jumlahnya tidak melebihi hukuman had.\" Al Hasan berkata, \"Hukumannya sama dengan hukukan pezina.\" Abu Dawud berkata, \"Hadits Ashim ini melemahkan hadits Amru bin Abu Amru.\""
            },
            {
                "number": 3751,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا طَلْقُ بْنُ غَنَّامٍ حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ حَفْصٍ حَدَّثَنَا أَبُو حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ رَجُلًا أَتَاهُ فَأَقَرَّ عِنْدَهُ أَنَّهُ زَنَى بِامْرَأَةٍ سَمَّاهَا لَهُ فَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْمَرْأَةِ فَسَأَلَهَا عَنْ ذَلِكَ فَأَنْكَرَتْ أَنْ تَكُونَ زَنَتْ فَجَلَدَهُ الْحَدَّ وَتَرَكَهَا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Thalq bin Ghannam] berkata, telah menceritakan kepada kami [Abdussalam bin Hafsh] berkata, telah menceritakan kepada kami [Abu Hazim] dari [Sahl bin Sa'd] dari Nabi shallallahu 'alaihi wasallam, Bahwasanya seorang laki-laki pernah mendatanginya dan mengaku bahwa dirinya telah berbuat zina dengan seorang wanita yang namanya telah ia sebutkan kepada beliau. Rasulullah shallallahu 'alaihi wasallam kemudian mengutus seseorang untuk bertanya kepada wanita itu; apakah benar yang dikatakan oleh laki-laki tersebut. Wanita itu mengingkari bahwa dirinya telah berzina, maka beliau mendera laki-laki itu sebagai had dan membiarkan wanita tersebut.\""
            },
            {
                "number": 3752,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا مُوسَى بْنُ هَارُونَ الْبُرْدِيُّ حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ عَنْ الْقَاسِمِ بْنِ فَيَّاضٍ الْأَبْنَاوِيِّ عَنْ خَلَّادِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ ابْنِ الْمُسَيِّبِ عَنْ ابْنِ عَبَّاسٍأَنَّ رَجُلًا مِنْ بَكْرِ بْنِ لَيْثٍ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقَرَّ أَنَّهُ زَنَى بِامْرَأَةٍ أَرْبَعَ مَرَّاتٍ فَجَلَدَهُ مِائَةً وَكَانَ بِكْرًا ثُمَّ سَأَلَهُ الْبَيِّنَةَ عَلَى الْمَرْأَةِ فَقَالَتْ كَذَبَ وَاللَّهِ يَا رَسُولَ اللَّهِ فَجَلَدَهُ حَدَّ الْفِرْيَةِ ثَمَانِينَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin faris] berkata, telah menceritakan kepada kami [Musa bin Harun Al Burdi] berkata, telah menceritakan kepada kami [Hisyam bin Yusuf] dari [Al Qasim bin Fayyadh Al Anbari] dari [Khallad bin 'Abdurrahman] dari [ibnul Musayyab] dari [Ibnu Abbas] berkata, \"Seorang laki-laki dari bani Bakr bin Laits mendatangi Nabi shallallahu 'alaihi wasallam. Laki-laki itu lalu mengaku -ia ulangi hingga empat kali- bahwa dirinya pernah berzina dengan seorang wanita, maka beliau menderanya sebanyak seratus kali karena ia belum menikah. Kemudian beliau bertanya kepadanya tentang bukti bahwa wanita itu berzina (dengannya), wanita itu berkata, \"Wahai Rasulullah, demi Allah ia telah berdusta.\" Beliau lalu mendera laki-laki itu sebanyak delapan puluh kali karena tuduhan zinanya kepada wanita itu.\""
            },
            {
                "number": 3753,
                "arab": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا أَبُو الْأَحْوَصِ حَدَّثَنَا سِمَاكٌ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ وَالْأَسْوَدِ قَالَا قَالَ عَبْدُ اللَّهِجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي عَالَجْتُ امْرَأَةً مِنْ أَقْصَى الْمَدِينَةِ فَأَصَبْتُ مِنْهَا مَا دُونَ أَنْ أَمَسَّهَا فَأَنَا هَذَا فَأَقِمْ عَلَيَّ مَا شِئْتَ فَقَالَ عُمَرُ قَدْ سَتَرَ اللَّهُ عَلَيْكَ لَوْ سَتَرْتَ عَلَى نَفْسِكَ فَلَمْ يَرُدَّ عَلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا فَانْطَلَقَ الرَّجُلُ فَأَتْبَعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا فَدَعَاهُ فَتَلَا عَلَيْهِ{ وَأَقِمْ الصَّلَاةَ طَرَفَيْ النَّهَارِ وَزُلَفًا مِنْ اللَّيْلِ }إِلَى آخِرِ الْآيَةِ فَقَالَ رَجُلٌ مِنْ الْقَوْمِ يَا رَسُولَ اللَّهِ أَلَهُ خَاصَّةً أَمْ لِلنَّاسِ كَافَّةً فَقَالَ لِلنَّاسِ كَافَّةً",
                "id": "Telah menceritakan kepada kami [Musaddad bin Musarhad] berkata, telah menceritakan kepada kami [Abul Ahwash] berkata, telah menceritakan kepada kami [Simak] dari [Ibrahim] dari [Alqamah] dan [Al Aswad] keduanya berkata, \" [Abdullah] berkata, \"Seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam dan berkata, \"Aku telah mencumbui seorang wanita dari pinggiran kota, aku telah melakukan semuanya kecuali persetubuhan. Dan sekarang aku ada dihadapanmu, maka hukumlah aku sekehendakmu.\" Umar menimpali, \"Allah telah menutupimu sekirannya kamu menutupi dirimu sendiri.\" Nabi shallallahu 'alaihi wasallam tidak memberi komentar apapun juga. Laki-laki itu lalu pergi dan Nabi shallallahu 'alaihi wasallam menyuruh orang mengikutinya dari belakang, beliau lantas memanggil laki-laki tersebut seraya membaca ayat: '(Dan dirikanlah sembahyang itu pada kedua tepi siang (pagi dan petang) dan pada bahagian permulaan daripada malam Sesungguhnya perbuatan-perbuatan yang baik itu menghapuskan (dosa) perbuatan-perbuatan yang buruk. Itulah peringatan bagi orang-orang yang ingat) '. Lalu ada seorang laki-laki dari kaum muslimin yang bertanya, \"Wahai Rasulullah, ayat itu khusus untuknya atau berlaku untuk semua orang?\" beliau menjawab: \"Berlaku untuk semua orang.\""
            },
            {
                "number": 3754,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أَبِي هُرَيْرَةَ وَزَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الْأَمَةِ إِذَا زَنَتْ وَلَمْ تُحْصَنْ قَالَ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَاجْلِدُوهَا ثُمَّ إِنْ زَنَتْ فَبِيعُوهَا وَلَوْ بِضَفِيرٍقَالَ ابْنُ شِهَابٍ لَا أَدْرِي فِي الثَّالِثَةِ أَوْ الرَّابِعَةِ وَالضَّفِيرُ الْحَبْلُ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Ibnu Syihab] dari [ubaidhullah bin Abdullah bin Utbah] dari [Abu Hurairah] dan [Zaid bin Khalid Al Juhani] bahwa Rasulullah shallallahu 'alaihi wasallam pernah ditanya tentang seorang budak wanita yang berzina, tetapi ia belum menikah? Beliau menjawab: \"Jika ia melakukan zina maka cambuklah, jika melakukan zina lagi maka cambuklah, jika melakukan zina lagi maka cambuklah, kemudian jika ia melakukan zina lagi maka juallah meskipun dengan seharga tali pengikat rambut.\" Ibnu Syihab berkata, \"Aku tidak tahu, itu berlaku pada kali ketiga atau keempat. Sementara Adh dhafir adalah tali (rambut).\""
            },
            {
                "number": 3755,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا زَنَتْ أَمَةُ أَحَدِكُمْ فَلْيَحُدَّهَا وَلَا يُعَيِّرْهَا ثَلَاثَ مِرَارٍ فَإِنْ عَادَتْ فِي الرَّابِعَةِ فَلْيَجْلِدْهَا وَلْيَبِعْهَا بِضَفِيرٍ أَوْ بِحَبْلٍ مِنْ شَعْرٍحَدَّثَنَا ابْنُ نُفَيْلٍ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ قَالَ فِي كُلِّ مَرَّةٍ فَلْيَضْرِبْهَا كِتَابُ اللَّهِ وَلَا يُثَرِّبْ عَلَيْهَا وَقَالَ فِي الرَّابِعَةِ فَإِنْ عَادَتْ فَلْيَضْرِبْهَا كِتَابُ اللَّهِ ثُمَّ لِيَبِعْهَا وَلَوْ بِحَبْلٍ مِنْ شَعْرٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [ubaidhullah] berkata, telah menceritakan kepadaku [Sa'id bin Abu Sa'id Al Maqburi] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika budak wanita salah seorang dari kalian berbuat zina maka tegakkanlah hukuman had dan jangan kalian cela dia -beliau ulangi hal itu hingga tiga kali-. Jika ia tetap mengulanginya pada kali keempat, maka cambuk dan juallah meskipun seharga tali rambut.\" Telah menceritakan kepada kami [Ibnu Nufail] berkata, telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Sa'id bin Abu Sa'id Al Maqburi] dari [Bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam dengan hadits yang sama. Setiap kali budak itu melakukan zina beliau bersabda: \"Hukumilah dengan Kitabullah dan jangan engkau cela.\" Maka pada kali keempat, beliau bersabda: \"Jika ia tetap mengulanginya, maka hukumilah dengan kitabullah, setelah itu juallah meski seharga tali rambut.\""
            },
            {
                "number": 3756,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ أَخْبَرَنِي أَبُو أُمَامَةَ بْنُ سَهْلِ بْنِ حُنَيْفٍ أَنَّهُ أَخْبَرَهُ بَعْضُ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْأَنْصَارِأَنَّهُ اشْتَكَى رَجُلٌ مِنْهُمْ حَتَّى أُضْنِيَ فَعَادَ جِلْدَةً عَلَى عَظْمٍ فَدَخَلَتْ عَلَيْهِ جَارِيَةٌ لِبَعْضِهِمْ فَهَشَّ لَهَا فَوَقَعَ عَلَيْهَا فَلَمَّا دَخَلَ عَلَيْهِ رِجَالُ قَوْمِهِ يَعُودُونَهُ أَخْبَرَهُمْ بِذَلِكَ وَقَالَ اسْتَفْتُوا لِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنِّي قَدْ وَقَعْتُ عَلَى جَارِيَةٍ دَخَلَتْ عَلَيَّ فَذَكَرُوا ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالُوا مَا رَأَيْنَا بِأَحَدٍ مِنْ النَّاسِ مِنْ الضُّرِّ مِثْلَ الَّذِي هُوَ بِهِ لَوْ حَمَلْنَاهُ إِلَيْكَ لَتَفَسَّخَتْ عِظَامُهُ مَا هُوَ إِلَّا جِلْدٌ عَلَى عَظْمٍ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَأْخُذُوا لَهُ مِائَةَ شِمْرَاخٍ فَيَضْرِبُوهُ بِهَا ضَرْبَةً وَاحِدَةً",
                "id": "Telah menceritakan kepada kami [Ahmad bin Sa'id Al Hamdani] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] ia berkata; telah mengabarkan kepadaku [Abu Umamah bin Sahl bin Hanif] Bahwasanya [sebagian sahabat] Rasulullah shallallahu 'alaihi wasallam dari kalangan Anshar pernah mengabarkan kepadanya, bahwa ada seorang laki-laki Anshar terserang penyakit hingga tubuhnya hanya kulit dan tulang saja. Kemudian budak wanita salah seorang dari mereka masuk menemuinya, hingga ia berhasrat kepada budak itu dan mensetubuhinya. Maka, ketika para sahabatnya datang menjenguk, hal itu ia kabarkan kepada mereka. Ia berkata, \"Mintakanlah aku fatwa kepada Rasulullah shallallahu 'alaihi wasallam; aku telah mensetubuhi budak wanita yang masuk menemuiku.\" Lalu mereka menceritakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, mereka berkata, \"Kami tidak pernah melihat seorang pun dari manusia yang mengalami sakit separah itu, jika kami membawanya kehadapanmu maka tulangnya akan berserakan. Sungguh, ia kini tinggal kulit pembungkus tulang!\" Rasulullah shallallahu 'alaihi wasallam kemudian memerintahkan mereka untuk mengambil seratus biji adas, agar mereka melemparkannya kepada laki-laki tersebut dengan sekali lemparan.\""
            },
            {
                "number": 3757,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا إِسْرَائِيلُ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ أَبِي جَمِيلَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَفَجَرَتْ جَارِيَةٌ لِآلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا عَلِيُّ انْطَلِقْ فَأَقِمْ عَلَيْهَا الْحَدَّ فَانْطَلَقْتُ فَإِذَا بِهَا دَمٌ يَسِيلُ لَمْ يَنْقَطِعْ فَأَتَيْتُهُ فَقَالَ يَا عَلِيُّ أَفَرَغْتَ قُلْتُ أَتَيْتُهَا وَدَمُهَا يَسِيلُ فَقَالَ دَعْهَا حَتَّى يَنْقَطِعَ دَمُهَا ثُمَّ أَقِمْ عَلَيْهَا الْحَدَّ وَأَقِيمُوا الْحُدُودَ عَلَى مَا مَلَكَتْ أَيْمَانُكُمْقَالَ أَبُو دَاوُد وَكَذَلِكَ رَوَاهُ أَبُو الْأَحْوَصِ عَنْ عَبْدِ الْأَعْلَى وَرَوَاهُ شُعْبَةُ عَنْ عَبْدِ الْأَعْلَى فَقَالَ فِيهِ قَالَ لَا تَضْرِبْهَا حَتَّى تَضَعَ وَالْأَوَّلُ أَصَحُّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah mengabarkan kepada kami [Isra'il] berkata, telah menceritakan kepada kami [Abdul A'la] dari [Abu Jamilah] dari [Ali radliallahu 'anhu] ia berkata, \"Seorang budak wanita milik keluarga Rasulullah shallallahu 'alaihi wasallam berbuat serong (zina), maka beliau bersabda: \"Wahai Ali, pergi dan tegakkanlah had atas dirinya.\" Aku lalu pergi menemui wanita itu, dan ternyata darah (nifas) nya belum berhenti.\" Maka aku kembali mendatangi Nabi shallallahu 'alaihi wasallam, beliau bertanya kepadaku: \"Wahai Ali, apakah engkau telah selesai?\" Aku menjawab, \"Saat aku mendatanginya, darah nifasnya masih mengalir.\" Beliau bersabda: \"Biarkanlah hingga masa nifasnya selesai, setelah itu tegakkanlah hudud atasnya. Dan laksanakanlah hukum hudud itu atas budak-budak kalian.\" Abu Dawud berkata, \" [Abu Al Ahwash] juga meriwayatkannya dari [Abdul A'la]. [Syu'bah] juga meriwayatkannya dari [Abdul A'la], ia menyebutkan dalam haditsnya, \"janganlah kamu rajam hingga ia melahirkan.\" Dan hadits pertama lebih shahih. "
            },
            {
                "number": 3758,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ وَمَالِكُ بْنُ عَبْدِ الْوَاحِدِ الْمِسْمَعِيُّ وَهَذَا حَدِيثُهُ أَنَّ ابْنَ أَبِي عَدِيٍّ حَدَّثَهُمْ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْلَمَّا نَزَلَ عُذْرِي قَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ فَذَكَرَ ذَاكَ وَتَلَا تَعْنِي الْقُرْآنَ فَلَمَّا نَزَلَ مِنْ الْمِنْبَرِ أَمَرَ بِالرَّجُلَيْنِ وَالْمَرْأَةِ فَضُرِبُوا حَدَّهُمْحَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ بِهَذَا الْحَدِيثِ لَمْ يَذْكُرْ عَائِشَةَ قَالَ فَأَمَرَ بِرَجُلَيْنِ وَامْرَأَةٍ مِمَّنْ تَكَلَّمَ بِالْفَاحِشَةِ حَسَّانَ بْنِ ثَابِتٍ وَمِسْطَحِ بْنِ أُثَاثَةَ قَالَ النُّفَيْلِيُّ وَيَقُولُونَ الْمَرْأَةُ حَمْنَةُ بِنْتُ جَحْشٍ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id Ats Tsaqafi] dan [Malik bin Abdul Wahid Al Misma'i] -dan ini adalah haditsnya- bahwa [Ibnu Abu Adi] menceritakan kepada mereka dari [Muhammad bin Ishaq] dari [Abdullah bin Abu Bakr] dari [Amrah] dari ['Aisyah radliallahu 'anha] ia berkata, \"Ketika Allah menurunkan udzurku (Ayat yang membebaskan 'Aisyah dari kasus fitnah yang dituduhkan padanya), Nabi shallallahu 'alaihi wasallam berpidato di atas mimbar dan menyampaikan hal itu seraya membacakan ayat al-qur'an. Ketika turun dari mimbar, beliau langsung memerintahkan untuk menghukum dua orang laki-laki dan seorang wanita (pelaku fitnah), maka mereka pun dicambuk sebagai had.\" Telah menceritakan kepada kami [An Nufaili] berkata, telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq] seperti hadits ini, hanya saja ia tidak menyebutkan nama 'Aisyah. Ia menyebutkan, \"Beliau kemudian memerintahkan untuk menghukum dua orang lelaki -Hassan bin Tsabit dan Misthah bin utsatsah- dan seorang wanita karena termasuk orang-orang yang menyebarkan fitnah (atas diri 'Aisyah) tersebut.\" An Nufaili berkata, \"Mereka mengatakan bahwa wanita itu adalah Hamnah binti Jahsy.\""
            },
            {
                "number": 3759,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَهَذَا حَدِيثُهُ قَالَا حَدَّثَنَا أَبُو عَاصِمٍ عَنْ ابْنِ جُرَيْجٍ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ رُكَانَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَقِتْ فِي الْخَمْرِ حَدًّا وَقَالَ ابْنُ عَبَّاسٍ شَرِبَ رَجُلٌ فَسَكِرَ فَلُقِيَ يَمِيلُ فِي الْفَجِّ فَانْطُلِقَ بِهِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا حَاذَى بِدَارِ الْعَبَّاسِ انْفَلَتَ فَدَخَلَ عَلَى الْعَبَّاسِ فَالْتَزَمَهُ فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَضَحِكَ وَقَالَ أَفَعَلَهَا وَلَمْ يَأْمُرْ فِيهِ بِشَيْءٍقَالَ أَبُو دَاوُد هَذَا مِمَّا تَفَرَّدَ بِهِ أَهْلُ الْمَدِينَةِ حَدِيثُ الْحَسَنِ بْنِ عَلِيٍّ هَذَا",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] dan [Muhammad Ibnul Mutsanna] -dan ini adalah haditsnya- keduanya berkata; telah menceritakan kepada kami [Abu Ashim] dari [Ibnu Juraij] dari [Muhammad bin Ali bin Rukanah] dari [Ikrimah] dari [Ibnu Abbas] berkata, \"Berkaitan dengan khamer Rasulullah shallallahu 'alaihi wasallam belum menentukan hukuman had.\" Ibnu Abbas berkata, \"Seorang laki-laki minum khamer hingga mabuk, lalu orang itu terlihat berada di jalan yang besar, maka ia pun dibawa untuk dihadapkan kepada Nabi shallallahu 'alaihi wasallam. Ketika hampir sampai rumah Al Abbas, ia menyelinap dan kabur sembunyi di rumah Al Abbas. Hal itu lalu disampaikan kepada Nabi shallallahu 'alaihi wasallam hingga beliau tertawa. Beliau bersabda: \"Apakah ia benar-benar melakukannya?\" Beliau tidak memerintahkan hukuman apapun.\" Abu Dawud berkata, \"Ini merupakan hadits yang hanya diriwayatkan oleh penduduk Madinah, yakni hadits Al Hasan bin Ali.\""
            },
            {
                "number": 3760,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو ضَمْرَةَ عَنْ يَزِيدَ بْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِرَجُلٍ قَدْ شَرِبَ فَقَالَ اضْرِبُوهُ قَالَ أَبُو هُرَيْرَةَ فَمِنَّا الضَّارِبُ بِيَدِهِ وَالضَّارِبُ بِنَعْلِهِ وَالضَّارِبُ بِثَوْبِهِ فَلَمَّا انْصَرَفَ قَالَ بَعْضُ الْقَوْمِ أَخْزَاكَ اللَّهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقُولُوا هَكَذَا لَا تُعِينُوا عَلَيْهِ الشَّيْطَانَحَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ بْنِ أَبِي نَاجِيَةَ الْإِسْكَنْدَرَانِيُّ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ وَحَيْوَةُ بْنُ شُرَيْحٍ وَابْنُ لَهِيعَةَ عَنْ ابْنِ الْهَادِ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ فِيهِ بَعْدَ الضَّرْبِ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَصْحَابِهِ بَكِّتُوهُ فَأَقْبَلُوا عَلَيْهِ يَقُولُونَ مَا اتَّقَيْتَ اللَّهَ مَا خَشِيتَ اللَّهَ وَمَا اسْتَحْيَيْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ أَرْسَلُوهُ وَقَالَ فِي آخِرِهِ وَلَكِنْ قُولُوا اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ وَبَعْضُهُمْ يَزِيدُ الْكَلِمَةَ وَنَحْوَهَا",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Abu Dhamrah] dari [Yazid Ibnul Had] dari [Muhammad bin Ibrahim] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Seorang yang telah minum khamer didatangkan kepada Rasulullah shallallahu 'alaihi wasallam, lalu beliau bersabda: \"Pukullah ia.\" Abu Hurairah berkata, \"Di antara kita ada yang memukul dengan tangan, sandal dan kain. Ketika beliau beranjak pergi, sebagian kami ada yang mengucapkan, \"Semoga Allah menghinakanmu!\" maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Janganlah kalian mengatakan begitu, jangan kalian bantu setan dalam memperdayanya.\" Telah menceritakan kepada kami [Muhammad bin Daud bin Abu Najiyah Al Iskandarani] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Yahya bin Ayyub] dan [Haiwah bin Syuraih] dan [Ibnu Lahi'ah] dari [Ibnul Had] dengan sanad dan maknanya. Setelah pemukulan (terhadap peminum khamer), ia menyebutkan dalam haditsnya, \"Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepada para sahabatnya: \"Jelekkanlah ia.\" Maka orang-orang kembali menemui peminum khamer itu dan berkata, \"Kamu tidak bertaqwa kepada Allah!\" Ada yang berkata, \"Kamu tidak takut kepada Allah!\" Ada yang berkata, \"Kamu tidak punya malu kepada Rasulullah shallallahu 'alaihi wasallam! ' Kemudian mereka membebaskan orang tersebut. Dan diakhir ucapannya, beliau mengatakan: \"Jangan kalian katakan yang demikian, tetapi ucapkanlah 'Ya Allah ampunilah ia, ya Allah rahmatilah ia'.\" Dan sebagian mereka ada yang menambahkan kalimat dan semisalnya.\""
            },
            {
                "number": 3761,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ هِشَامٍ الْمَعْنَى عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَلَدَ فِي الْخَمْرِ بِالْجَرِيدِ وَالنِّعَالِوَجَلَدَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ أَرْبَعِينَ فَلَمَّا وُلِّيَ عُمَرُ دَعَا النَّاسَ فَقَالَ لَهُمْ إِنَّ النَّاسَ قَدْ دَنَوْا مِنْ الرِّيفِ وَقَالَ مُسَدَّدٌ مِنْ الْقُرَى وَالرِّيفِ فَمَا تَرَوْنَ فِي حَدِّ الْخَمْرِ فَقَالَ لَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ نَرَى أَنْ تَجْعَلَهُ كَأَخَفِّ الْحُدُودِ فَجَلَدَ فِيهِ ثَمَانِينَ قَالَ أَبُو دَاوُد رَوَاهُ ابْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ جَلَدَ بِالْجَرِيدِ وَالنِّعَالِ أَرْبَعِينَ وَرَوَاهُ شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ضَرَبَ بِجَرِيدَتَيْنِ نَحْوَ الْأَرْبَعِينَ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Hisyam]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Hisyam] secara makna, dari [Qatadah] dari [Anas bin Malik] ia berkata, \"Nabi shallallahu 'alaihi wasallam menghukum peminum khamer dengan cambukan pelepah kurma dan sandal. Abu Bakar radliallahu 'anhu mencambuk sebanyak empat puluh kali, maka ketika umar diangkat menjadi khalifah, ia menyeru orang-orang dan berpesan, \"Sekarang manusia sudah banyak menghuni Ar Rif (perkampungan yang banyak tumbuh pohon kurma), lalu bagaimana batasan hukum (dera) bagi peminum khamer menurut kalian?\" 'Abdurrahman bin Auf lalu berkata kepadanya, \"Menurutku, hendaklah engkau beri hukuman yang paling ringan, \" Umar lalu menghukumnya dengan delapan puluh deraan.\" Abu Dawud berkata, \" [Ibnu Abu Arubah] meriwayatkannya dari [Qatadah], dari Nabi shallallahu 'alaihi wasallam, bahwasanya beliau mendera (peminum khamer) dengan pelepah kurma dan sandal sebanyak empat puluh kali.\" Dan [Syu'bah] meriwayatkan dari [Qatadah], dari [Anas], dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Beliau memukul dengan dua pelepah kurma sebanyak empat puluh kali.\""
            },
            {
                "number": 3762,
                "arab": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ وَمُوسَى بْنُ إِسْمَعِيلَ الْمَعْنَى قَالَا حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُخْتَارِ حَدَّثَنَا عَبْدُ اللَّهِ الدَّانَاجُ حَدَّثَنِي حُضَيْنُ بْنُ الْمُنْذِرِ الرَّقَاشِيُّ هُوَ أَبُو سَاسَانَ قَالَشَهِدْتُ عُثْمَانَ بْنَ عَفَّانَ وَأُتِيَ بِالْوَلِيدِ بْنِ عُقْبَةَ فَشَهِدَ عَلَيْهِ حُمْرَانُ وَرَجُلٌ آخَرُ فَشَهِدَ أَحَدُهُمَا أَنَّهُ رَآهُ شَرِبَهَا يَعْنِي الْخَمْرَ وَشَهِدَ الْآخَرُ أَنَّهُ رَآهُ يَتَقَيَّأُ فَقَالَ عُثْمَانُ إِنَّهُ لَمْ يَتَقَيَّأْ حَتَّى شَرِبَهَا فَقَالَ لِعَلِيٍّ رَضِيَ اللَّهُ عَنْهُ أَقِمْ عَلَيْهِ الْحَدَّ فَقَالَ عَلِيٌّ لِلْحَسَنِ أَقِمْ عَلَيْهِ الْحَدَّ فَقَالَ الْحَسَنُ وَلِّ حَارَّهَا مَنْ تَوَلَّى قَارَّهَا فَقَالَ عَلِيٌّ لِعَبْدِ اللَّهِ بْنِ جَعْفَرٍ أَقِمْ عَلَيْهِ الْحَدَّ قَالَ فَأَخَذَ السَّوْطَ فَجَلَدَهُ وَعَلِيٌّ يَعُدُّ فَلَمَّا بَلَغَ أَرْبَعِينَ قَالَ حَسْبُكَ جَلَدَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعِينَ أَحْسَبُهُ قَالَ وَجَلَدَ أَبُو بَكْرٍ أَرْبَعِينَ وَعُمَرُ ثَمَانِينَ وَكُلٌّ سُنَّةٌ وَهَذَا أَحَبُّ إِلَيَّ",
                "id": "Telah menceritakan kepada kami [Musaddad bin Musarhid] dan [Musa bin Isma'il] secara makna, keduanya berkata; telah menceritakan kepada kami [Abdul Aziz Ibnul Mukhtar] berkata, telah menceritakan kepada kami [Abdullah Ad Danaj] berkata, telah menceritakan kepadaku [Hudhain Ibnul Mundzir Ar Raqasyi] -maksudnya Abu Yasan- ia berkata, \"Ketika aku ada di sisi Utsman bin Affan, Al Walid bin Uqbah dihadapkan kepadanya, lalu Humran dan seorang laki-laki lain bersaksi, bahwa salah seorang dari mereka melihat (Al Walid) minum khamer, dan yang lain melihatnya muntah (karena khamer). Utsman lantas berkata, \"Ia tidak mungkin muntah kecuali karena sebab minum khamer! ' Lalu ia berkata kepada [Ali] radliallahu 'anhu, \"Laksanakan hukuman had atasnya.\" Kemudian Ali juga berkata kepada Al Hasan, \"Laksanakan hukuman had atasnya.\" Maka Al Hasan pun berkomentar, \"Berikanlah kekuasaan kepada orang yang layak memikulnya.\" Ali radliallahu 'anhu akhirnya berkata kepada Abdullah bin Ja'far, \"Laksanakan hukuman had atasnya.\" Maka Abdullah segera mengambil pecut dan mencambuknya (Al Walid), sementara Ali menghitungnya. Maka ketika sampai pada hitungan keempat puluh, Ali berkata, \"Cukup! Nabi shallallahu 'alaihi wasallam mendera sebanyak empat puluh kali, Abu Bakar empat puluh kali dan Umar delapan puluh kali. Semua itu sunnah, namun aku lebih suka yang ini (empat puluh kali).\""
            },
            {
                "number": 3763,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ الدَّانَاجِ عَنْ حُضَيْنِ بْنِ الْمُنْذِرِ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَجَلَدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْخَمْرِوَأَبُو بَكْرٍ أَرْبَعِينَ وَكَمَّلَهَا عُمَرُ ثَمَانِينَ وَكُلٌّ سُنَّةٌ قَالَ أَبُو دَاوُد و قَالَ الْأَصْمَعِيُّ وَلِّ حَارَّهَا مَنْ تَوَلَّيْ قَارَّهَا وَلِّ شَدِيدَهَا مَنْ تَوَلَّى هَيِّنَهَا قَالَ أَبُو دَاوُد هَذَا كَانَ سَيِّدَ قَوْمِهِ حُضَيْنُ بْنُ الْمُنْذِرِ أَبُو سَاسَانَ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Yahya] dari [Ibnu Abu Arubah] dari [Ad Danaj] dari [Hudhain Ibnul Mundzir] dari [Ali radliallahu 'anhu] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam dan Abu Bakar mendera peminum khamer sebanyak empat puluh kali, lalu Umar menggenapkannya menjadi delapan puluh kali, dan semua itu adalah sunnah.\" Abu Dawud berkata, \"Al Ashma'I berkata, \"Berikanlah kekuasaan kepada orang yang layak menjalaninya, yakni berikanlah orang yang bisa berlaku keras maupun lembut.\" Abu Dawud berkata lagi, \"Pemimpun kaumnya adalah Khudhain Ibnul Mundzir Abu Sasan.\""
            },
            {
                "number": 3764,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا أَبَانُ عَنْ عَاصِمٍ عَنْ أَبِي صَالِحٍ ذَكْوَانَ عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا شَرِبُوا الْخَمْرَ فَاجْلِدُوهُمْ ثُمَّ إِنْ شَرِبُوا فَاجْلِدُوهُمْ ثُمَّ إِنْ شَرِبُوا فَاجْلِدُوهُمْ ثُمَّ إِنْ شَرِبُوا فَاقْتُلُوهُمْحَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ حُمَيْدِ بْنِ يَزِيدَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بِهَذَا الْمَعْنَى قَالَ وَأَحْسِبُهُ قَالَ فِي الْخَامِسَةِ إِنْ شَرِبَهَا فَاقْتُلُوهُ قَالَ أَبُو دَاوُد وَكَذَا فِي حَدِيثِ أَبِي غُطَيْفٍ فِي الْخَامِسَةِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Aban] dari [Ashim] dari [Abu Shalih Dzakwan] dari [Mu'awiyah bin Abu Sufyan] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika mereka minum khamer maka cambuklah, jika mereka minum lagi maka cambuklah, jika mereka minum lagi maka cambuklah, dan jika mereka minum lagi maka bunuhlah.\" Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] dari [Humaid bin Yazid] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda dengan makna tersebut. Ia (perawi) berkata, \"Menurutku beliau bersabda pada kali kelima: \"Jika ia meminumnya lagi maka bunuhlah.\" Abu Dawud berkata, \"Dalam hadits Abu Ghuthaif juga dengan lafadz 'pada kali kelima'.\""
            },
            {
                "number": 3765,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَاصِمٍ الْأَنْطَاكِيُّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ الْوَاسِطِيُّ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الْحَارِثِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَكَرَ فَاجْلِدُوهُ ثُمَّ إِنْ سَكَرَ فَاجْلِدُوهُ ثُمَّ إِنْ سَكَرَ فَاجْلِدُوهُ فَإِنْ عَادَ الرَّابِعَةَ فَاقْتُلُوهُقَالَ أَبُو دَاوُد وَكَذَا حَدِيثُ عُمَرَ بْنِ أَبِي سَلَمَةَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا شَرِبَ الْخَمْرَ فَاجْلِدُوهُ فَإِنْ عَادَ الرَّابِعَةَ فَاقْتُلُوهُ قَالَ أَبُو دَاوُد وَكَذَا حَدِيثُ سُهَيْلٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ شَرِبُوا الرَّابِعَةَ فَاقْتُلُوهُمْ وَكَذَا حَدِيثُ ابْنِ أَبِي نُعْمٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَذَا حَدِيثُ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالشَّرِيدِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي حَدِيثِ الْجَدَلِيِّ عَنْ مُعَاوِيَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَإِنْ عَادَ فِي الثَّالِثَةِ أَوْ الرَّابِعَةِ فَاقْتُلُوهُ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ashim Al Anthaki] berkata, telah menceritakan kepada kami [Yazid bin Harun Al Wasithi] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi`b] dari [Al Harits bin 'Abdurrahman] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika ia mabuk maka cembuklah, kemudian jika ia mabuk lagi maka cambuklah, kemudian jika ia mabuk lagi maka cambuklah, kemudian jika ia mengulangi lagi pada kali keempat maka bunuhlah.\" Abu Dawud berkata, \"demikian juga hadits [Umar bin Abu Salamah], dari [bapaknya], dari [Abu Hurairah], dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika ia minum khamer maka cambuklah, jika ia mengulanginya lagi untuk kali keempat maka bunuhlah.\" Demikan juga dalam hadits [Suhail] dari [Abu Shalih], dari [Abu Hurairah], dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika mereka minum pada kali keempat, maka bunuhlah mereka.\" Demikian juga dalam hadits [Ibnu Abu Nu'm] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam. Demikian juga dengan hadits Abdullah bin Amru dari Nabi shallallahu 'alaihi wasallam, dan Asy Syarid dari Nabi shallallahu 'alaihi wasallam dalam hadits riwayat [Al Jadali], dari [Mu'awiyah], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jika ia mengulanginya lagi pada kali ketiga, atau keempat maka bunuhlah ia.\""
            },
            {
                "number": 3766,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ حَدَّثَنَا سُفْيَانُ قَالَ الزُّهْرِيُّ أَخْبَرَنَا عَنْ قَبِيصَةَ بْنِ ذُؤَيْبٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ شَرِبَ الْخَمْرَ فَاجْلِدُوهُ فَإِنْ عَادَ فَاجْلِدُوهُ فَإِنْ عَادَ فِي الثَّالِثَةِ أَوْ الرَّابِعَةِ فَاقْتُلُوهُ فَأُتِيَ بِرَجُلٍ قَدْ شَرِبَ فَجَلَدَهُ ثُمَّ أُتِيَ بِهِ فَجَلَدَهُ ثُمَّ أُتِيَ بِهِ فَجَلَدَهُ ثُمَّ أُتِيَ بِهِ فَجَلَدَهُ وَرَفَعَ الْقَتْلَ وَكَانَتْ رُخْصَةٌقَالَ سُفْيَانُ حَدَّثَ الزُّهْرِيُّ بِهَذَا الْحَدِيثِ وَعِنْدَهُ مَنْصُورُ بْنُ الْمُعْتَمِرِ وَمِخْوَلُ بْنُ رَاشِدٍ فَقَالَ لَهُمَا كُونَا وَافِدَيْ أَهْلِ الْعِرَاقِ بِهَذَا الْحَدِيثِ قَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ الشَّرِيدُ بْنُ سُوَيْدٍ وَشُرَحْبِيلُ بْنُ أَوْسٍ وَعَبْدُ اللَّهِ بْنُ عَمْرٍو وَعَبْدُ اللَّهِ بْنُ عُمَرَ وَأَبُو غُطَيْفٍ الْكِنْدِيُّ وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdah Adh Dhabbi] berkata, telah menceritakan kepada kami [Sufyan], [Az Zuhri] berkata; telah mengabarkan kepada kami dari [Qabishah bin Dzuaib] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa minum khamer maka cambuklah, jika ia mengulanginya lagi maka cambuklah, jika ia mengulanginya lagi pada kali ketiga atau keempat maka bunuhlah ia.\" Kemudian dihadapkan kepada beliau seorang laki-laki yang telah minum khamer, beliau lalu menderanya, kemudian orang itu dihadapkan lagi lalu beliau menderanya, kemudian orang itu dihadapkan lagi lalu beliau menderanya, kemudian orang itu dihadapkan lagi lalu beliau menderanya dan tidak dibunuh, namun itu adalah keringanan.\" [Sufyan] berkata, \"Az Zuhri menceritakan hadits ini, sementara di sisinya ada Manshur Ibnul Mu'tamir dan Mikhwal bin Rasyid. Maka ia berkata kepada keduanya, \"Kalian berdua jadilah kurir bagi penduduk Irak dengan hadits ini.\" Abu Dawud berkata, \"Hadits ini diriwayatkan oleh Asy Syarid bin Suwaid, Syurahbil bin Aus, Abdullah bin Amru, Abdullah bin Umar, Abu Ghuthaif Al Kindi, dan [Abu Salamah bin 'Abdurrahman] dari [Abu Hurairah].\""
            },
            {
                "number": 3767,
                "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُوسَى الْفَزَارِيُّ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي حُصَيْنٍ عَنْ عُمَيْرِ بْنِ سَعِيدٍ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَلَا أَدِي أَوْ مَا كُنْتُ لِأَدِيَ مَنْ أَقَمْتُ عَلَيْهِ حَدًّا إِلَّا شَارِبَ الْخَمْرِ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَسُنَّ فِيهِ شَيْئًا إِنَّمَا هُوَ شَيْءٌ قُلْنَاهُ نَحْنُ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Musa Al Faari] berkata, telah menceritakan kepada kami [Syarik] dari [Abu Hushain] dari [Umair bin Sa'id] dari [Ali radliallahu 'anhu] ia berkata, \"Aku tidak pernah menerapkan hukuman had kecuali pada peminum khamer, sebab Rasulullah shallallahu 'alaihi wasallam tidak memberi contoh dalam hal itu sesuatu pun. Tetapi itu hanyalah (suatu) perkataan kami.\""
            },
            {
                "number": 3768,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ الْمِصْرِيُّ ابْنُ أَخِي رِشْدِينَ بْنِ سَعْدٍ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ أَنَّ ابْنَ شِهَابٍ حَدَّثَهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَزْهَرَ قَالَكَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْآنَ وَهُوَ فِي الرِّحَالِ يَلْتَمِسُ رَحْلَ خَالِدِ بْنِ الْوَلِيدِ فَبَيْنَمَا هُوَ كَذَلِكَ إِذْ أُتِيَ بِرَجُلٍ قَدْ شَرِبَ الْخَمْرَ فَقَالَ لِلنَّاسِ اضْرِبُوهُ فَمِنْهُمْ مَنْ ضَرَبَهُ بِالنِّعَالِ وَمِنْهُمْ مَنْ ضَرَبَهُ بِالْعَصَا وَمِنْهُمْ مَنْ ضَرَبَهُ بِالْمِيتَخَةِ قَالَ ابْنُ وَهْبٍ الْجَرِيدَةُ الرَّطْبَةُ ثُمَّ أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُرَابًا مِنْ الْأَرْضِ فَرَمَى بِهِ فِي وَجْهِهِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Dawud Al Mahri Al Mishri bin Akhi Risydina bin Sa'd] berkata, telah mengabarkan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Usamah bin Zaid] bahwa [Ibnu Syihab] menceritakan kepadanya dari ['Abdurrahman bin Azhar] berkata, \"Saat ini seakan aku melihat Rasulullah shallallahu 'alaihi wasallam sedang berada di sebuah pemukiman, beliau mencari rumah Khalid Ibnul Walid. Ketika beliau dalam keadaan seperti itu, seorang laki-laki yang telah minum khamer dibawa ke hadapan Rasulullah shallallahu 'alaihi wasallam, beliau lalu bersabda kepada orang banyak: \"Pukullah ia!\" kemudian di antara mereka ada yang memukul dengan sandal, tongkat dan Mitakhah -Ibnu Wahb mengartikan dengan pelepah kurma yang basah-.\" Setelah itu Rasulullah shallallahu 'alaihi wasallam mengambil pasir dan melemparkannya ke wajah laki-laki itu.\""
            },
            {
                "number": 3769,
                "arab": "حَدَّثَنَا ابْنُ السَّرْحِ قَالَ وَجَدْتُ فِي كِتَابِ خَالِي عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ الْحَمِيدِ عَنْ عُقَيْلٍ عَنْ ابْنِ شِهَابٍ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْأَزْهَرِ أَخْبَرَهُ عَنْ أَبِيهِ قَالَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَارِبٍ وَهُوَ بِحُنَيْنٍ فَحَثَى فِي وَجْهِهِ التُّرَابَ ثُمَّ أَمَرَ أَصْحَابَهُ فَضَرَبُوهُ بِنِعَالِهِمْ وَمَا كَانَ فِي أَيْدِيهِمْ حَتَّى قَالَ لَهُمْ ارْفَعُوا فَرَفَعُوافَتُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ جَلَدَ أَبُو بَكْرٍ فِي الْخَمْرِ أَرْبَعِينَ ثُمَّ جَلَدَ عُمَرُ أَرْبَعِينَ صَدْرًا مِنْ إِمَارَتِهِ ثُمَّ جَلَدَ ثَمَانِينَ فِي آخِرِ خِلَافَتِهِ ثُمَّ جَلَدَ عُثْمَانُ الْحَدَّيْنِ كِلَيْهِمَا ثَمَانِينَ وَأَرْبَعِينَ ثُمَّ أَثْبَتَ مُعَاوِيَةُ الْحَدَّ ثَمَانِينَ",
                "id": "Telah menceritakan kepada kami [Ibnu As Sarh] ia berkata; Aku mendapatkan dalam buku pamanku ['Abdurrahman bin Abdul hamid] dari [Uqail] dari [Ibnu Syihab] mengabarkan kepadanya, bahwa [Abdullah bin 'Abdurrahman Ibnul Azhar] mengabarkan kepadanya dari [Bapaknya] ia berkata, \"Saat Nabi shallallahu 'alaihi wasallam berada di Hunain, seorang peminum khamer dihadapkan kepada beliau, maka beliau melemparkan pasir ke wajah laki-laki itu. Kemudian beliau memerintahkan kepada para sahabatnya untuk (memberi hukuman), maka mereka pun memukulinya dengan sandal dan apa saja yang ada di tangan mereka, hingga beliau mengatakan: \"Cukup!\" mereka pun berhenti. Ketika Rasulullah shallallahu 'alaihi wasallam wafat, Abu Bakar mendera peminum khamer sebanyak empat puluh kali, Umar juga mendera sebanyak empat puluh kali pada awal pemerintahannya, kemudian mendera sebanyak delapan puluh kali pada akhir masa pemerintahannya. Kemudian Utsman melaksanakan kedua hukuman tersebut (empat puluh dan delapan puluh). Setelah itu Mu'awiyah menetapkan jumlahnya menjadi delapan puluh kali.\""
            },
            {
                "number": 3770,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَزْهَرَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَدَاةَ الْفَتْحِ وَأَنَا غُلَامٌ شَابٌّ يَتَخَلَّلُ النَّاسَ يَسْأَلُ عَنْ مَنْزِلِ خَالِدِ بْنِ الْوَلِيدِ فَأُتِيَ بِشَارِبٍ فَأَمَرَهُمْ فَضَرَبُوهُ بِمَا فِي أَيْدِيهِمْ فَمِنْهُمْ مَنْ ضَرَبَهُ بِالسَّوْطِ وَمِنْهُمْ مَنْ ضَرَبَهُ بِعَصًا وَمِنْهُمْ مَنْ ضَرَبَهُ بِنَعْلِهِ وَحَثَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التُّرَابَ فَلَمَّا كَانَ أَبُو بَكْرٍ أُتِيَ بِشَارِبٍ فَسَأَلَهُمْ عَنْ ضَرْبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي ضَرَبَهُ فَحَزَرُوهُ أَرْبَعِينَفَضَرَبَ أَبُو بَكْرٍ أَرْبَعِينَ فَلَمَّا كَانَ عُمَرُ كَتَبَ إِلَيْهِ خَالِدُ بْنُ الْوَلِيدِ إِنَّ النَّاسَ قَدْ انْهَمَكُوا فِي الشُّرْبِ وَتَحَاقَرُوا الْحَدَّ وَالْعُقُوبَةَ قَالَ هُمْ عِنْدَكَ فَسَلْهُمْ وَعِنْدَهُ الْمُهَاجِرُونَ الْأَوَّلُونَ فَسَأَلَهُمْ فَأَجْمَعُوا عَلَى أَنْ يَضْرِبَ ثَمَانِينَ قَالَ و قَالَ عَلِيٌّ إِنَّ الرَّجُلَ إِذَا شَرِبَ افْتَرَى فَأَرَى أَنْ يَجْعَلَهُ كَحَدِّ الْفِرْيَةِ قَالَ أَبُو دَاوُد أَدْخَلَ عُقَيْلُ بْنُ خَالِدٍ بَيْنَ الزُّهْرِيِّ وَبَيْنَ ابْنِ الْأَزْهَرِ فِي هَذَا الْحَدِيثِ عَبْدَ اللَّهِ بْنَ عَبْدِ الرَّحْمَنِ بْنِ الْأَزْهَرِ عَنْ أَبِيهِ",
                "id": "Telah menceritakan kepada kami [Al hasan bin Ali] berkata, telah menceritakan kepada kami [Utsman bin Umar] berkata, telah menceritakan kepada kami [Usamah bin Zaid] dari [Az Zuhri] dari ['Abdurrahman bin Azhar] ia berkata, \"Saat aku masih kecil, dipagi hari penaklukan kota Makkah, aku melihat Rasulullah shallallahu 'alaihi wasallam bertanya kepada orang-orang di mana letak rumah Khalid bin Walid. Lalu didatangkanlah seorang peminum khamer kepada beliau, beliau lalu memerintahkan kepada orang-orang untuk menghukumnya. Maka mereka memukuli orang itu dengan apa saja yang ada di tangan mereka; di antara mereka ada yang memukul dengan pecut, tongkat dan sandal, sementara Rasulullah shallallahu 'alaihi wasallam melemparnya dengan pasir. Ketika dihadapkan seorang peminum khamer kepada Abu Bakar, maka ia bertanya kepada orang-orang bagaimana Nabi shallallahu 'alaihi wasallam memberi hukuman. Mereka lalu memeritahukan bahwa Rasulullah memukulnya sebanyak empat puluh kali, maka ia memukul (peminum itu) sebanyak empat puluh kali. Ketika Umar memerintah, Khalid Ibnul Walid menulis surat kepadanya bahwa orang-orang telah banyak minum khamer dan meremehkan hukuman hudud. Umar menjawab, \"Kasus mereka terserah kamu, maka tanyakanlah kepada mereka (kaum muhajirin).\" Karena di sisi Khalid banyak sahabat-sahabat Muhajirin, maka ia bertanya kepada mereka, dan mereka pun sepakat untuk mendera peminum khamer sebanyak delapan puluh kali.\" Ali radliallahu 'anhu berkata, \"Seorang laki-laki jika minum khamer, maka ia akan mudah berdusta, maka aku berpandangan untuk menyamakan hukuman mereka dengan pelaku firyah (menuduh zina tanpa bukti).\" Abu Dawud berkata, \" [Uqail bin Khalid] menempatkan [Abdullah bin 'Abdurrahman Ibnul Azhar] dari [ayahnya] (sebagai sanad) dalam hadits ini berada di antara Az Zuhri dan Ibnul Azhar.\""
            },
            {
                "number": 3771,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا صَدَقَةُ يَعْنِي ابْنَ خَالِدٍ حَدَّثَنَا الشُّعَيْثِيُّ عَنْ زُفَرَ بْنِ وَثِيمَةَ عَنْ حَكِيمِ بْنِ حِزَامٍ أَنَّهُ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُسْتَقَادَ فِي الْمَسْجِدِ وَأَنْ تُنْشَدَ فِيهِ الْأَشْعَارُ وَأَنْ تُقَامَ فِيهِ الْحُدُودُ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Ammar] berkata, telah menceritakan kepada kami [Shadaqah] -maksudnya Shadaqah bin Khalid- berkata, telah menceritakan kepada kami [Asy Syu'aitsi] dari [Zufar bin Watsimah] dari [Hakim bin Hizam] bahwa ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang pelaksanaan hukuman qishas dalam masjid, melantunkan syair (buruk) dan pelaksanaan hudud secara umum.\""
            },
            {
                "number": 3772,
                "arab": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي بُرْدَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ لَا يُجْلَدُ فَوْقَ عَشْرِ جَلَدَاتٍ إِلَّا فِي حَدٍّ مِنْ حُدُودِ اللَّهِ عَزَّ وَجَلَّحَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو أَنَّ بُكَيْرَ بْنَ الْأَشَجِّ حَدَّثَهُ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ جَابِرٍ أَنَّ أَبَاهُ حَدَّثَهُ أَنَّهُ سَمِعَ أَبَا بُرْدَةَ الْأَنْصَارِيَّ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah mengabarkan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Al Laits] dari [Yazid bin Abu Habib] dari [Bukair bin Abdullah Ibnul Asyaj] dari [Sulaiman bin Yasar] dari ['Abdurrahman bin Jabir bin Abdullah] dari [Abu Burdah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seseorang tidak boleh didera lebih dari sepuluh kali deraan, kecuali pada pelaksanaan hudud Allah Azza Wa Jalla.\" Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Amru] bahwa [Bukair Ibnul Asyaj] menceritakan kepadanya dari [Sulaiman bin Yasar] ia berkata; telah menceritakan kepadaku ['Abdurrahman bin Jabir] bahwa [Bapaknya] menceritakan kepadanya, bahwa ia mendengar [Abu Burdah Al Anshari] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda…lalu ia menyebutkan sebagaimana maknanya.\""
            },
            {
                "number": 3773,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عُمَرَ يَعْنِي ابْنَ أَبِي سَلَمَةَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا ضَرَبَ أَحَدُكُمْ فَلْيَتَّقِ الْوَجْهَ",
                "id": "Telah menceritakan kepada kami [Abu Kamil] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Umar] -maksudnya Umar bin Abu Salamah- dari [Bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika salah seorang dari kalian memukul maka jauhilah muka.\""
            },
            {
                "number": 3774,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ مُوسَى عَنْ عَلِيِّ بْنِ صَالِحٍ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ قُرَيْظَةُ وَالنَّضِيرُ وَكَانَ النَّضِيرُ أَشْرَفَ مِنْ قُرَيْظَةَ فَكَانَ إِذَا قَتَلَ رَجُلٌ مِنْ قُرَيْظَةَ رَجُلًا مِنْ النَّضِيرِ قُتِلَ بِهِ وَإِذَا قَتَلَ رَجُلٌ مِنْ النَّضِيرِ رَجُلًا مِنْ قُرَيْظَةَ فُودِيَ بِمِائَةِ وَسْقٍ مِنْ تَمْرٍ فَلَمَّا بُعِثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَتَلَ رَجُلٌ مِنْ النَّضِيرِ رَجُلًا مِنْ قُرَيْظَةَ فَقَالُوا ادْفَعُوهُ إِلَيْنَا نَقْتُلُهُ فَقَالُوا بَيْنَنَا وَبَيْنَكُمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَوْهُ فَنَزَلَتْ{ وَإِنْ حَكَمْتَ فَاحْكُمْ بَيْنَهُمْ بِالْقِسْطِ }وَالْقِسْطُ النَّفْسُ بِالنَّفْسِ ثُمَّ نَزَلَتْ{ أَفَحُكْمَ الْجَاهِلِيَّةِ يَبْغُونَ }قَالَ أَبُو دَاوُد قُرَيْظَةُ وَالنَّضِيرُ جَمِيعًا مِنْ وَلَدِ هَارُونَ النَّبِيِّ عَلَيْهِ السَّلَام",
                "id": "Telah menceritakan kepada kami [Muhammad Ibnul 'Ala] berkata, telah menceritakan kepada kami [ubaidhullah] -maksudnya ubaidhullah bin Musa- dari [Ali bin Shalih] dari [Simak bin Harb] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Antara bani Quraidhah dan bani Nadhir yang lebih mulia adalah bani Nadhir. Jika seorang laki-laki bani Quraidhah membunuh laki-laki dari bani Nadhir maka harus diqishah, sementara jika seorang laki-laki dari bani Nadhir membunuh laki-laki dari bani Quraidhah, cukup dengan memberikan tebusan seratus gantang kurma. Ketika Nabi shallallahu 'alaihi wasallam diutus, lalu ada seorang laki-laki dari bani Nadhir membunuh laki-laki dari bani Quraidhah, maka orang-orang dari bani Quraidhah berkata, \"Berikan pembunuh itu kepada kami sehingga kami dapat membunuhnya.\" Orang-orang bani Nadhir kemudian berkata, \"Antara kami dengan kalian ada Nabi Muhammad shallallahu 'alaihi wasallam!\" mereka lalu mendatangi beliau. Kemudian Allah menurunkan ayat: '(dan jika kamu memutuskan perkara mereka, maka putuskanlah perkara itu di antara mereka dengan adil..) ' -Al Maidah: 42-. Al Qisth (adil) itu adalah jiwa dibalas dengan jiwa.\" Kemudian setelah itu turun ayat: '(Apakah hukum Jahilliyah yang mereka kehendaki) ' -Al Maidah: 50-. Abu Dawud berkata, \"Bani Quraidhah dan bani Nadhir keduanya dari keturunan Nabi Harun Alaihis Salam.\""
            },
            {
                "number": 3775,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا عُبَيْدُ اللَّهِ يَعْنِي ابْنَ إِيَادٍ حَدَّثَنَا إِيَادٌ عَنْ أَبِي رِمْثَةَ قَالَانْطَلَقْتُ مَعَ أَبِي نَحْوَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي ابْنُكَ هَذَا قَالَ إِي وَرَبِّ الْكَعْبَةِ قَالَ حَقًّا قَالَ أَشْهَدُ بِهِ قَالَ فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَاحِكًا مِنْ ثَبْتِ شَبَهِي فِي أَبِي وَمِنْ حَلِفِ أَبِي عَلَيَّ ثُمَّ قَالَ أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ وَقَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ{ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى }",
                "id": "Telah menceritakan kepada kami [Ahmad bin yunus] berkata, telah menceritakan kepada kami [ubaidhullah] -maksudnya ubaidhullah bin Iyad- berkata, telah menceritakan kepada kami [Iyad] dari [Abu Rimtsah] ia berkata; Aku dan bapakku berangkat menemui Nabi shallallahu 'alaihi wasallam, lalu Rasulullah shallallahu 'alaihi wasallam bertanya kepada bapakku: \"Apakah ini anakmu?\" bapakku menjawab, \"Benar, demi Tuhannya Ka'bah.\" Beliau bertanya lagi: \"Apakah itu benar?\" bapakku menjawab, \"Aku bersaksi atasnya.\" Abu Rismtsah berkata, \"Rasulullah shallallahu 'alaihi wasallam lalu tersenyum karena aku mirip dengan bapakku dan karena sumpah yang dilakukannya atas diriku. Kemudian beliau bersabda: \"Ketahuilah, dia tidak akan memikul dosamu dan kamu tidak akan memikul dosanya.\" Lalu beliau membaca ayat: '(dan orang yang berdosa tidak akan memikul dosa orang lain) ' -Qs. Al Isra: 15-. "
            },
            {
                "number": 3776,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ الْحَارِثِ بْنِ فُضَيْلٍ عَنْ سُفْيَانَ بْنِ أَبِي الْعَوْجَاءِ عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أُصِيبَ بِقَتْلٍ أَوْ خَبْلٍ فَإِنَّهُ يَخْتَارُ إِحْدَى ثَلَاثٍ إِمَّا أَنْ يَقْتَصَّ وَإِمَّا أَنْ يَعْفُوَ وَإِمَّا أَنْ يَأْخُذَ الدِّيَةَ فَإِنْ أَرَادَ الرَّابِعَةَ فَخُذُوا عَلَى يَدَيْهِ وَمَنْ اعْتَدَى بَعْدَ ذَلِكَ فَلَهُ عَذَابٌ أَلِيمٌ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah mengabarkan kepada kami [Muhammad bin Ishaq] dari [Al Harits bin Fudhail] dari [Sufyan bin Abu Al 'Auja] dari [Abu Syuraih Al AKhuza'i] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mendapat musibah berupa pembunuhan atau cacat anggota badan maka ia mempunyai tiga pilihan; minta qishas, memberi maaf, atau meminta tebusan denda. Jika ia menginginkan yang keempat maka halangilah, dan barangsiapa melampaui batas setelah itu maka baginya siksa yang pedih.\""
            },
            {
                "number": 3777,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيُّ عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَمَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُفِعَ إِلَيْهِ شَيْءٌ فِيهِ قِصَاصٌ إِلَّا أَمَرَ فِيهِ بِالْعَفْوِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Abdullah bin bakr bin Abdullah Al Muzani] dari [Atha bin Abu Maimunah] dari [Anas bin Malik] ia berkata, \"Aku tidak pernah melihat Nabi shallallahu 'alaihi wasallam mendapat pengaduan yang padanya ada Qishas, kecuali beliau menganjurkan untuk memaafkan.\""
            },
            {
                "number": 3778,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ أَخْبَرَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقُتِلَ رَجُلٌ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرُفِعَ ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَفَعَهُ إِلَى وَلِيِّ الْمَقْتُولِ فَقَالَ الْقَاتِلُ يَا رَسُولَ اللَّهِ وَاللَّهِ مَا أَرَدْتُ قَتْلَهُ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْوَلِيِّ أَمَا إِنَّهُ إِنْ كَانَ صَادِقًا ثُمَّ قَتَلْتَهُ دَخَلْتَ النَّارَ قَالَ فَخَلَّى سَبِيلَهُ قَالَ وَكَانَ مَكْتُوفًا بِنِسْعَةٍ فَخَرَجَ يَجُرُّ نِسْعَتَهُ فَسُمِّيَ ذَا النِّسْعَةِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah mengabarkan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Ada seorang laki-laki dibunuh pada masa Rasulullah shallallahu 'alaihi wasallam. Maka kasus itu diajukan kepada Nabi shallallahu 'alaihi wasallam. Nabi lantas melimpahkan kasus ini kepada wali korban. Si pembunuh lantas menyampaikan uneg-unegnya kepada Nabi ' Wahai Rasulullah, sungguh aku semula tidak berniat membunuhnya! Rasulullah shallallahu 'alaihi wasallam lalu bersabda kepada wali korban: \"Jika ucapan pembunuh itu benar, kemudian kamu membunuhnya, maka kamu masuk neraka.\" Abu Hurairah berkata, \"Lantas wali korban itu pun membebaskan sang pembunuh.\" Abu Hurairah melanjutkan lagi, \"Sang pembunuh saat itu sudah diikat tali, ia pun pulang dengan keadaan terikat tali hingga dijuluki 'Orang terikat tali'. "
            },
            {
                "number": 3779,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ الْجُشَمِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَوْفٍ حَدَّثَنَا حَمْزَةُ أَبُو عُمَرَ الْعَائِذِيُّ حَدَّثَنِي عَلْقَمَةُ بْنُ وَائِلٍ حَدَّثَنِي وَائِلُ بْنُ حُجْرٍ قَالَكُنْتُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ جِيءَ بِرَجُلٍ قَاتِلٍ فِي عُنُقِهِ النِّسْعَةُ قَالَ فَدَعَا وَلِيَّ الْمَقْتُولِ فَقَالَ أَتَعْفُو قَالَ لَا قَالَ أَفَتَأْخُذُ الدِّيَةَ قَالَ لَا قَالَ أَفَتَقْتُلُ قَالَ نَعَمْ قَالَ اذْهَبْ بِهِ فَلَمَّا وَلَّى قَالَ أَتَعْفُو قَالَ لَا قَالَ أَفَتَأْخُذُ الدِّيَةَ قَالَ لَا قَالَ أَفَتَقْتُلُ قَالَ نَعَمْ قَالَ اذْهَبْ بِهِ فَلَمَّا كَانَ فِي الرَّابِعَةِ قَالَ أَمَا إِنَّكَ إِنْ عَفَوْتَ عَنْهُ يَبُوءُ بِإِثْمِهِ وَإِثْمِ صَاحِبِهِ قَالَ فَعَفَا عَنْهُ قَالَ فَأَنَا رَأَيْتُهُ يَجُرُّ النِّسْعَةَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنِي جَامِعُ بْنُ مَطَرٍ حَدَّثَنِي عَلْقَمَةُ بْنُ وَائِلٍ بِإِسْنَادِهِ وَمَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Umar bin Maisarah Al Jusyami] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Auf] berkata; telah menceritakan kepada kami [Hamzah Abu Umar Al 'Aidzi] berkata, telah menceritakan kepadaku [Alqamah bin Wail] berkata, telah menceritakan kepadaku [Wail bin Hujr] ia berkata, \"Aku pernah di sisi Nabi shallallahu 'alaihi wasallam, lalu didatangkan ke hadapan beliau seorang pembunuh yang pada lehernya telah diikat dengan tali.\" Wail berkata, \"Beliau lalu mengundang wali korban dan bertanya: \"Apa kamu tidak memberi maaf?\" Ia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Apa kamu tidak ingin mengambil tebusan?\" ia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Apa kamu ingin membunuhnya?\" ia menjawab, \"Benar.\" Beliau bersabda: \"Kalau begitu bawalah ia pergi.\" Ketika wali korban itu beranjak pergi, beliau kembali bertanya: \"Apa kamu tidak memberi maaf?\" ia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Apa kamu tidak ingin mengambil tebusan?\" ia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Apa kamu ingin membunuhnya?\" ia menjawab, \"Benar.\" Beliau bersabda: \"Kalau begitu bawalah ia pergi.\" Maka pada kali keempatnya beliau bersabda: \"Jika engkau memberinya maaf, maka ia akan menanggung dosanya sendiri dan dosa saudaramu.\" Wail berkata, \"Wali korban itu akhirnya memaafkannya.\" Wail berkata, \"Aku melihat pembunuh melepas tali pengikatnya.\" Telah menceritakan kepada kami [ubaidhullah bin Umar bin Umar bin Maisarah] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] ia berkata; telah menceritakan kepadaku [Jami' bin Mathar] berkata, telah menceritakan kepadaku [Alqamah bin Wail] dengan sanad dan maknanya.\""
            },
            {
                "number": 3780,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَوْفٍ الطَّائِيُّ حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ الْحَجَّاجِ حَدَّثَنَا يَزِيدُ بْنُ عَطَاءٍ الْوَاسِطِيُّ عَنْ سِمَاكٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِحَبَشِيٍّ فَقَالَ إِنَّ هَذَا قَتَلَ ابْنَ أَخِي قَالَ كَيْفَ قَتَلْتَهُ قَالَ ضَرَبْتُ رَأْسَهُ بِالْفَأْسِ وَلَمْ أُرِدْ قَتْلَهُ قَالَ هَلْ لَكَ مَالٌ تُؤَدِّي دِيَتَهُ قَالَ لَا قَالَ أَفَرَأَيْتَ إِنْ أَرْسَلْتُكَ تَسْأَلُ النَّاسَ تَجْمَعُ دِيَتَهُ قَالَ لَا قَالَ فَمَوَالِيكَ يُعْطُونَكَ دِيَتَهُ قَالَ لَا قَالَ لِلرَّجُلِ خُذْهُ فَخَرَجَ بِهِ لِيَقْتُلَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَا إِنَّهُ إِنْ قَتَلَهُ كَانَ مِثْلَهُ فَبَلَغَ بِهِ الرَّجُلُ حَيْثُ يَسْمَعُ قَوْلَهُ فَقَالَ هُوَ ذَا فَمُرْ فِيهِ مَا شِئْتَ فَقَالَ رَسُولُ اللَّه صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْسِلْهُ وَقَالَ مَرَّةً دَعْهُ يَبُوءُ بِإِثْمِ صَاحِبِهِ وَإِثْمِهِ فَيَكُونُ مِنْ أَصْحَابِ النَّارِ قَالَ فَأَرْسَلَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Auf Ath Tha`i] berkata, telah menceritakan kepada kami [Abdul Qudus Ibnul Hajjaj] berkata, telah menceritakan kepada kami [Yazid bin Atha Al Wasithi] dari [Simak] dari [Alqamah bin Wail] dari [Bapaknya] ia berkata, \"Seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam dengan membawa seorang habsyi, ia berkata, \"Sesungguhnya orang habsyi ini telah membunuh anak saudaraku!\" Beliau bertanya kepada habsyi tersebut: \"Bagaimana kamu membunuhnya?\" Ia menjawab, \"Aku memukul kepalanya dengan kapak, tetapi aku tidak bermaksud membunuhnya.\" Beliau bertanya lagi: \"Apa kamu mempunyai harta untuk membayar tebusan?\" Ia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Bagaimana menurutmu jika aku bebaskan kamu, lalu kamu mencari bantuan dana kepada orang-orang?\" Ia menjawab, \"Tidak perlu.\" Beliau bertanya lagi: \"Apa barangkali wali-walimu yang akan memberikan uang tebusannya?\" Ia menjawab, \"Tidak.\" Beliau lalu bersabda kepada laki-laki (wali korban): \"Bawalah ia.\" Maka laki-laki membawa pergi orang habsyi tersebut untuk dibunuh. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Sebenarnya jika laki-laki itu membunuh orang habsyi tersebut, maka kedudukannya akan sama dengan orang habsyi itu.\" Ucapan Rasulullah itu akhirnya sampai ke telinganya laki-laki tersebut, ia lalu berkata, \"Ini aku serahkan kembali. Maka berilah perintah sesukamu.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Bebaskanlah orang habsyi itu.\" Dalam riwayat lain beliau mengatakan, \"Biarkanlah, maka ia akan menanggung dosa temannya (korban) dan dosanya sendiri. Lalu ia akan masuk ke dalam neraka.\" Wali korban itu lantas membebaskannya. "
            },
            {
                "number": 3781,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى ابْنِ سَعِيدٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ قَالَكُنَّا مَعَ عُثْمَانَ وَهُوَ مَحْصُورٌ فِي الدَّارِ وَكَانَ فِي الدَّارِ مَدْخَلٌ مَنْ دَخَلَهُ سَمِعَ كَلَامَ مَنْ عَلَى الْبَلَاطِ فَدَخَلَهُ عُثْمَانُ فَخَرَجَ إِلَيْنَا وَهُوَ مُتَغَيِّرٌ لَوْنُهُ فَقَالَ إِنَّهُمْ لَيَتَوَاعَدُونَنِي بِالْقَتْلِ آنِفًا قَالَ قُلْنَا يَكْفِيكَهُمُ اللَّهُ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ وَلِمَ يَقْتُلُونَنِي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلَّا بِإِحْدَى ثَلَاثٍ كُفْرٌ بَعْدَ إِسْلَامٍ أَوْ زِنًا بَعْدَ إِحْصَانٍ أَوْ قَتْلُ نَفْسٍ بِغَيْرِ نَفْسٍ فَوَاللَّهِ مَا زَنَيْتُ فِي جَاهِلِيَّةٍ وَلَا فِي إِسْلَامٍ قَطُّ وَلَا أَحْبَبْتُ أَنَّ لِي بِدِينِي بَدَلًا مُنْذُ هَدَانِي اللَّهُ وَلَا قَتَلْتُ نَفْسًا فَبِمَ يَقْتُلُونَنِيقَالَ أَبُو دَاوُد عُثْمَانُ وَأَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُمَا تَرَكَا الْخَمْرَ فِي الْجَاهِلِيَّةِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin Sa'id] dari [Abu Umamah bin Sahl] ia berkata, \"Aku pernah bersama [Utsman] saat ia dikepung dalam rumahnya. Dalam rumahnya ada sebuah lorong, jika seseorang masuk ke dalamnya maka ia akan dapat mendengar percakapan orang yang berada di atasnya. Utsman masuk ke dalam lorong itu, lalu ia keluar dengan wajah telah berubah pucat. Ia berkata, \"Mereka berkeinginan untuk membunuhku.\" Ia (perawi) berkata, \"Lalu kami berkata, \"Cukuplah Allah sebagai pelindungmu wahai Amirul Mukminin.\" Utsman bertanya (bingung), \"Kenapa mereka ingin membunuhku?, padahal aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak halal darah seorang muslim kecuali karena tiga hal; kafir setelah beriman, zina setelah nikah, dan membunuh jiwa orang lain.\" Demi Allah, aku tidak pernah melakukan perzinaan baik di masa Jahilliyah atau setelah Islam, aku juga tidak pernah berharap untuk mengganti agamaku setelah Allah memberi petunjuk kepadaku, dan aku juga tidak pernah membunuh jiwa seorang pun (tanpa hak). Lalu dengan alasan apa mereka akan membunuhku?\" Abu Dawud berkata, \"Utsman dan Abu Bakar radliallahu 'anhuma tidak pernah minum khamer pada masa Jahilliyah.\""
            },
            {
                "number": 3782,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ فَحَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرِ بْنِ الزُّبَيْرِ قَالَ سَمِعْتُ زِيَادَ بْنَ ضُمَيْرَةَ الضُّمَرِيَّ ح و أَخْبَرَنَا وَهْبُ بْنُ بَيَانٍ وَأَحْمَدُ بْنُ سَعِيدٍ الْهَمْدَانِيُّ قَالَا حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ أَنَّهُ سَمِعَ زِيَادَ بْنَ سَعْدِ بْنِ ضُمَيْرَةَ السُّلَمِيَّ وَهَذَا حَدِيثُ وَهْبٍ وَهُوَ أَتَمُ يُحَدِّثُ عُرْوَةَ بْنَ الزُّبَيْرِ عَنْ أَبِيهِ قَالَ مُوسَى وَجَدِّهِوَكَانَا شَهِدَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُنَيْنًا ثُمَّ رَجَعْنَا إِلَى حَدِيثِ وَهْبٍ أَنْ مُحَلِّمَ بْنَ جَثَّامَةَ اللَّيْثِيَّ قَتَلَ رَجُلًا مِنْ أَشْجَعَ فِي الْإِسْلَامِ وَذَلِكَ أَوَّلُ غِيَرٍ قَضَى بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَكَلَّمَ عُيَيْنَةُ فِي قَتْلِ الْأَشْجَعِيِّ لِأَنَّهُ مِنْ غَطَفَانَ وَتَكَلَّمَ الْأَقْرَعُ بْنُ حَابِسٍ دُونَ مُحَلِّمٍ لِأَنَّهُ مِنْ خِنْدِفَ فَارْتَفَعَتْ الْأَصْوَاتُ وَكَثُرَتْ الْخُصُومَةُ وَاللَّغَطُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عُيَيْنَةُ أَلَا تَقْبَلُ الْغِيَرَ فَقَالَ عُيَيْنَةُ لَا وَاللَّهِ حَتَّى أُدْخِلَ عَلَى نِسَائِهِ مِنْ الْحَرْبِ وَالْحُزْنِ مَا أَدْخَلَ عَلَى نِسَائِي قَالَ ثُمَّ ارْتَفَعَتْ الْأَصْوَاتُ وَكَثُرَتْ الْخُصُومَةُ وَاللَّغَطُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عُيَيْنَةُ أَلَا تَقْبَلُ الْغِيَرَ فَقَالَ عُيَيْنَةُ مِثْلَ ذَلِكَ أَيْضًا إِلَى أَنْ قَامَ رَجُلٌ مِنْ بَنِي لَيْثٍ يُقَالُ لَهُ مُكَيْتِلٌ عَلَيْهِ شِكَّةٌ وَفِي يَدِهِ دَرِقَةٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي لَمْ أَجِدْ لِمَا فَعَلَ هَذَا فِي غُرَّةِ الْإِسْلَامِ مَثَلًا إِلَّا غَنَمًا وَرَدَتْ فَرُمِيَ أَوَّلُهَا فَنَفَرَ آخِرُهَا اسْنُنْ الْيَوْمَ وَغَيِّرْ غَدًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسُونَ فِي فَوْرِنَا هَذَا وَخَمْسُونَ إِذَا رَجَعْنَا إِلَى الْمَدِينَةِ وَذَلِكَ فِي بَعْضِ أَسْفَارِهِ وَمُحَلِّمٌ رَجُلٌ طَوِيلٌ آدَمُ وَهُوَ فِي طَرَفِ النَّاسِ فَلَمْ يَزَالُوا حَتَّى تَخَلَّصَ فَجَلَسَ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَيْنَاهُ تَدْمَعَانِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي قَدْ فَعَلْتُ الَّذِي بَلَغَكَ وَإِنِّي أَتُوبُ إِلَى اللَّهِ تَبَارَكَ وَتَعَالَى فَاسْتَغْفِرْ اللَّهَ عَزَّ وَجَلَّ لِي يَا رَسُولَ اللَّهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَتَلْتَهُ بِسِلَاحِكَ فِي غُرَّةِ الْإِسْلَامِ اللَّهُمَّ لَا تَغْفِرْ لِمُحَلِّمٍ بِصَوْتٍ عَالٍ زَادَ أَبُو سَلَمَةَ فَقَامَ وَإِنَّهُ لَيَتَلَقَّى دُمُوعَهُ بِطَرَفِ رِدَائِهِقَالَ ابْنُ إِسْحَقَ فَزَعَمَ قَوْمُهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَغْفَرَ لَهُ بَعْدَ ذَلِكَ قَالَ أَبُو دَاوُد قَالَ النَّضْرُ بْنُ شُمَيْلٍ الْغِيَرُ الدِّيَةُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] ia berkata; telah menceritakan kepada kami [Muhammad bin Ishaq] berkata, telah menceritakan kepadaku [Muhammad bin Ja'far bin Az Zubair] ia berkata; Aku mendengar [Ziyad bin Dhamrah Adh Dhumari]. (dalam jalur lain disebutkan) Telah mengabarkan kepada kami [Wahb bin Bayan] dan [Ahmad bin Sa'id Al Hamdani] keduanya berkata; telah menceritakan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku ['Abdurrahman bin Abu Az Zinad] dari ['Abdurrahman Ibnul Harits] dari [Muhammad bin Ja'far] Bahwasanya ia pernah mendengar [Ziyad bin Sa'd bin Dhumairah As Sulami] -ini adalah hadits Wahb, dan hadits ini lebih lengkap, ia menceritakan kepada Urwah bin Az Zubair- dari [Bapaknya] ia berkata, \" [Musa] dan [kakeknya] pernah mengikuti perang Hunain bersama Rasulullah shallallahu 'alaihi wasallam. ' kemudian kami kembali kepada hadits Wahb, bahwa Muhallim bin Jatstsamah Al Laitsi pernah membunuh seorang laki-laki dari Asyja' (nama tempat) padahal ia telah masuk Islam, dan itu adalah diyat pertama yang ditebus oleh Rasulullah shallallahu 'alaihi wasallam. Uyainah lalu memperbincangkan tentang pembunuhan Al Asyja'I, sebab ia berasal dari Ghathafan. Sementara Al Aqra' bin Habis berbicara membela Muhallim, sebab ia berasal dari Khindiq. Suara mereka meninggi hingga banyak terjadi perselisihan dan kegaduhan. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Wahai Uyainah, tidakkah kamu mau menerima diyat (tebusan)?\" Ia menjawab, \"Demi Allah, tidak! Sehingga kami dapat mendatangkan kerugian dan kesedihan untuk wanita-wanitanya sebagaimana ia telah mendatangkan kerugian dan kesedihan untuk wanita-wanitaku.\" Sa'd berkata, \"Kemudian suara mereka kembali meninggi hingga banyak terjadi perselisihan dan kegaduhan.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Wahai Uyainah, tidakkah kamu mau menerima diyat (tebusan)?\" Uyainah menjawab seperti jawabannya semula, sehingga berdirilah seorang laki-laki dari bani Laits yang bernama Mukaitil, ia membawa senjata dan perisai. Lalu ia berkata, \"Wahai Rasulullah, dalam Islam aku belum pernah mendapatkan tebusan untuk pelanggaran yang dilakukan oleh orang ini (Muhallim si pembunuh) kecuali seperti serombongan kambing yang minum (di sungai) karena haus. Lalu barisan pertama dilempar hingga barisan yang terakhir lari menjauh (maksudnya; adanya qishah itu agar yang lain takut dan mengambil pelajaran sebagaimana kambing yang dilempar agar yang lain takut dan pergi). Tegakkanlah sunnah sekarang dan rubahlah esok hari.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Lima puluh (unta) dibayar tunai dan lima puluh lagi ketika tiba di Madinah.\" Itu terjadi dalam salah satu safar beliau. Sementara Muhallim adalah seorang laki-laki tinggi yang berkulit coklat, ia duduk di antara orang banyak. Dan kawan-kawannya masih saja menolongnya hingga ia terbebas dari pembunuhan (qishas). Muhallim lalu duduk di sisi Rasulullah shallallahu 'alaihi wasallam dengan meneteskan air mata. Ia lalu berkata, \"Wahai Rasulullah, aku telah melakukan sesuatu sebagaimana yang engkau telah ketahui (membunuh), aku sekarang bertaubat kepada Allah Tabaaraka Wa Ta'ala, maka mintakan aku ampunan kepada Allah Azza Wa Jalla.\" Rasulullah shallallahu 'alaihi wasallam lantas bersabda: \"Apakah kamu membunuhnya dengan senjatamu padahal ia masih diawalmula keislamannya? Ya Allah, jangan engkau ampuni Muhallim.\" Beliau ucapkan kata-kata itu dengan suara yang keras.\" Abu Salamah menambahkan, \"Muhallim lalu bangkit dan mengusap air matanya dengan ujung selendang.\" Ibnu Ishaq berkata, \"Kaumnya merasa yakin bahwa Rasulullah shallallahu 'alaihi wasallam akan memintakan ampun untuk Muhallim setelah itu.\" Abu Dawud berkata, \"An Nadhr bin Syumail mengatakan bahwa Al Ghiyar adalah diyat (tebusan).\""
            },
            {
                "number": 3783,
                "arab": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ قَالَ سَمِعْتُ أَبَا شُرَيْحٍ الْكَعْبِيَّ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا إِنَّكُمْ يَا مَعْشَرَ خُزَاعَةَ قَتَلْتُمْ هَذَا الْقَتِيلَ مِنْ هُذَيْلٍ وَإِنِّي عَاقِلُهُ فَمَنْ قُتِلَ لَهُ بَعْدَ مَقَالَتِي هَذِهِ قَتِيلٌ فَأَهْلُهُ بَيْنَ خِيَرَتَيْنِ أَنْ يَأْخُذُوا الْعَقْلَ أَوْ يَقْتُلُوا",
                "id": "Telah menceritakan kepada kami [Musaddad bin Musarhad] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi`b] ia berkata; telah menceritakan kepadaku [Sa'id Ibnu Abu Sa'id] ia berkata; Aku mendengar [Abu Syuraih Al ka'bi] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai penduduk Khuza'ah! Ketahuilah oleh kalian semua, kalian telah membunuh orang Hudzail ini, sesungguhnya aku adalah penggantinya (yang akan membayarkan diyatnya), karena itu siapa yang terbunuh setelah perkataanku ini, maka bagi ahli warisnya aku beri dua pilihan; minta tebusan atau balas bunuh.\""
            },
            {
                "number": 3784,
                "arab": "حَدَّثَنَا عَبَّاسُ بْنُ الْوَلِيدِ بْنِ مَزْيَدٍ أَخْبَرَنِي أَبِي حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنِي يَحْيَى ح و حَدَّثَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ حَدَّثَنِي أَبُو دَاوُدَ حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا أَبُو هُرَيْرَةَ قَالَلَمَّا فُتِحَتْ مَكَّةُ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ قُتِلَ لَهُ قَتِيلٌ فَهُوَ بِخَيْرِ النَّظَرَيْنِ إِمَّا أَنْ يُودَى أَوْ يُقَادَ فَقَامَ رَجُلٌ مِنْ أَهْلِ الْيَمَنِ يُقَالُ لَهُ أَبُو شَاةٍ فَقَالَ يَا رَسُولَ اللَّهِ اكْتُبْ لِي قَالَ الْعَبَّاسُ اكْتُبُوا لِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اكْتُبُوا لِأَبِي شَاةٍوَهَذَا لَفْظُ حَدِيثِ أَحْمَدَ قَالَ أَبُو دَاوُد اكْتُبُوا لِي يَعْنِي خُطْبَةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abbas Ibnul Walid bin Mazyad] berkata, telah mengabarkan kepadaku [Bapakku] berkata, telah menceritakan kepada kami [Al Auza'i] berkata, telah menceritakan kepadaku [Yahya]. (dalam jalur lain disebutkan) telah menceritakan kepada kami [Ahmad bin Ibrahim] berkata, telah menceritakan kepadaku [Abu Dawud] berkata, telah menceritakan kepada kami [Harb bin Syaddad] berkata, telah menceritakan kepada kami [Yahya bin Abu Katsir] berkata, telah menceritakan kepadaku [Abu Salamah bin 'Abdurrahman] berkata, telah menceritakan kepada kami [Abu Hurairah] ia berkata, \"Saat pembukaan kota Makkah Rasulullah shallallahu 'alaihi wasallam berdiri dan berkhutbah, beliau bersabda: \"Barang siapa di antara kalian ada yang (keluarganya) terbunuh, maka ia mempunyai dua pilihan terbaik; minta tebusan atau balas bunuh.\" Lalu seorang laki-laki dari penduduk Yaman yang bernama Abu Syah berdiri dan berkata, \"Wahai Rasulullah, tuliskanlah untukku.\" Al Abbas berkata, \"Kalian menulislah untukku.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Buatlah tulisan untuk Abu Syah.\" Dan ini adalah lafadz hadits dari Ahmad. Abu Dawud berkata, \"kalian menulislah untukku' maksudnya adalah khutbah yang disampaikan oleh Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3785,
                "arab": "حَدَّثَنَا مُسْلِمٌ حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ حَدَّثَنَا سُلَيْمَانُ بْنُ مُوسَى عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَمَنْ قَتَلَ مُؤْمِنًا مُتَعَمِّدًا دُفِعَ إِلَى أَوْلِيَاءِ الْمَقْتُولِ فَإِنْ شَاءُوا قَتَلُوهُ وَإِنْ شَاءُوا أَخَذُوا الدِّيَةَ",
                "id": "Telah menceritakan kepada kami [Muslim] berkata, telah menceritakan kepada kami [Muhammad bin rasyid] berkata, telah menceritakan kepada kami [Sulaiman bin Musa] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang mukmin tidak boleh dibunuh karena orang kafir (sebagai qishas). Maka barangsiapa membunuh seorang mukmin dengan sengaja, perkaranya diserahkan kepada wali korban; jika mereka berkehendak maka mereka boleh balas membunuh, dan jika mereka berkehendak maka mereka boleh minta tebusan.\""
            },
            {
                "number": 3786,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا مَطَرٌ الْوَرَّاقُ وَأَحْسَبُهُ عَنْ الْحَسَنِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا أُعْفِيَ مَنْ قَتَلَ بَعْدَ أَخْذِهِ الدِّيَةَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah mengabarkan kepada kami [Mathar Al Warraq] dan aku mengira itu dari [Al Hasan] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku tidak akan memberi maaf kepada orang yang membunuh setelah ia mengambil tebusannya.\""
            },
            {
                "number": 3787,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا شُعْبَةُ عَنْ هِشَامِ بْنِ زَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ امْرَأَةً يَهُودِيَّةً أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَاةٍ مَسْمُومَةٍ فَأَكَلَ مِنْهَا فَجِيءَ بِهَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهَا عَنْ ذَلِكَ فَقَالَتْ أَرَدْتُ لِأَقْتُلَكَ فَقَالَ مَا كَانَ اللَّهُ لِيُسَلِّطَكِ عَلَى ذَلِكَ أَوْ قَالَ عَلَيَّ فَقَالُوا أَلَا نَقْتُلُهَا قَالَ لَا فَمَا زِلْتُ أَعْرِفُهَا فِي لَهَوَاتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Habib bin Arabi] berkata, telah menceritakan kepada kami [Khalid Ibnul Harits] berkata, telah menceritakan kepada kami [Syu'bah] dari [Hisyam bin Zaid] dari [Anas bin Malik] berkata, \"Seorang wanita Yahudi datang kepada Rasulullah shallallahu 'alaihi wasallam dengan membawa daging kambing yang telah diberi racun, lalu beliau memakannya. Setelah itu, wanita Yahudi tersebut dibawa ke hadapan Rasulullah shallallahu 'alaihi wasallam. beliau lantas menanyakan tentang hal tersebut, wanita itu menjawab, \"Aku ingin membunuhmu!\" beliau bersabda: \"Allah tidak akan memberikan kemudahan bagimu untuk melakukan itu, atau beliau mengatakan, \"untuk melakukan (hal itu) terhadapku.\" Para sahabat berkata, \"Bagaimana jika kami membunuhnya saja?\" beliau bersabda: \"Jangan.\" Anas berkata, \"Dan aku masih melihat sisa-sisa racun itu di tenggorokan Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3788,
                "arab": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ ح و حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ حَدَّثَنَا عَبَّادٌ عَنْ سُفْيَانَ ابْنِ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدٍ وأَبِي سَلَمَةَ قَالَ هَارُونُ عَنْ أَبِي هُرَيْرَةَأَنَّ امْرَأَةً مِنْ الْيَهُودِ أَهْدَتْ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَاةً مَسْمُومَةً قَالَ فَمَا عَرَضَ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ أَبُو دَاوُد هَذِهِ أُخْتُ مَرْحَبٍ الْيَهُودِيَّةُ الَّتِي سَمَّتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Dawud bin Rasyid] berkata, telah menceritakan kepada kami [Abbad Ibnul Awwam]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Harun bin Abdullah] berkata, telah menceritakan kepada kami [Sa'id bin Sulaiman] berkata, telah menceritakan kepada kami [Abbad] dari [Sufyan bin Husain] dari [Az Zuhri] dari [Sa'id] dan [Abu Salamah]. [Harun] berkata; dari [Abu Hurairah] ia berkata, \"Seorang wanita Yahudi memberi hadiah Nabi shallallahu 'alaihi wasallam daging kambing yang telah diberi racun.\" Abu Hurairah melanjutkan, \"Tetapi Nabi shallallahu 'alaihi wasallam tidak menyentuh wanita itu sama sekali (yakni dengan qishash).\" Abu Dawud berkata, \"Wanita ini adalah saudara perempuan dari perempuan Yahudi yang meracuni Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3789,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْمَهْرِيُّ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ قَالَ كَانَ جَابِرُ بْنُ عَبْدِ اللَّهِ يُحَدِّثُأَنَّ يَهُودِيَّةً مِنْ أَهْلِ خَيْبَرَ سَمَّتْ شَاةً مَصْلِيَّةً ثُمَّ أَهْدَتْهَا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الذِّرَاعَ فَأَكَلَ مِنْهَا وَأَكَلَ رَهْطٌ مِنْ أَصْحَابِهِ مَعَهُ ثُمَّ قَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ارْفَعُوا أَيْدِيَكُمْ وَأَرْسَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْيَهُودِيَّةِ فَدَعَاهَا فَقَالَ لَهَا أَسَمَمْتِ هَذِهِ الشَّاةَ قَالَتْ الْيَهُودِيَّةُ مَنْ أَخْبَرَكَ قَالَ أَخْبَرَتْنِي هَذِهِ فِي يَدِي لِلذِّرَاعِ قَالَتْ نَعَمْ قَالَ فَمَا أَرَدْتِ إِلَى ذَلِكَ قَالَتْ قُلْتُ إِنْ كَانَ نَبِيًّا فَلَنْ يَضُرَّهُ وَإِنْ لَمْ يَكُنْ نَبِيًّا اسْتَرَحْنَا مِنْهُ فَعَفَا عَنْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يُعَاقِبْهَا وَتُوُفِّيَ بَعْضُ أَصْحَابِهِ الَّذِينَ أَكَلُوا مِنْ الشَّاةِ وَاحْتَجَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى كَاهِلِهِ مِنْ أَجْلِ الَّذِي أَكَلَ مِنْ الشَّاةِ حَجَمَهُ أَبُو هِنْدٍ بِالْقَرْنِ وَالشَّفْرَةِ وَهُوَ مَوْلًى لِبَنِي بَيَاضَةَ مِنْ الْأَنْصَارِحَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ حَدَّثَنَا خَالِدٌ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهْدَتْ لَهُ يَهُودِيَّةٌ بِخَيْبَرَ شَاةً مَصْلِيَّةً نَحْوَ حَدِيثِ جَابِرٍ قَالَ فَمَاتَ بِشْرُ بْنُ الْبَرَاءِ بْنِ مَعْرُورٍ الْأَنْصَارِيُّ فَأَرْسَلَ إِلَى الْيَهُودِيَّةِ مَا حَمَلَكِ عَلَى الَّذِي صَنَعْتِ فَذَكَرَ نَحْوَ حَدِيثِ جَابِرٍ فَأَمَرَ بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُتِلَتْ وَلَمْ يَذْكُرْ أَمْرَ الْحِجَامَةِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Dawud Al Mahri] berkata, telah menceritakan kepada kami [Ibnu Wahb] ia berkata; telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] ia berkata, \" [Jabir bin Abdullah] pernah menceritakan bahwa seorang wanita Yahudi dari penduduk Khaibar menaburi racun pada daging kambing panggang. Kemudian ia menghadiahkan daging itu kepada Rasulullah shallallahu 'alaihi wasallam. Rasulullah shallallahu 'alaihi wasallam lantas mengambil lengan kambing tersebut dan memakannya bersama para sahabatnya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepada mereka semua: \"Angkatlah tangan kalian semuanya (jangan dimakan lagi).\" Rasulullah shallallahu 'alaihi wasallam kemudian mengirim utusan untuk memanggil wanita Yahudi tersebut. Lalu beliau bertanya kepada wanita itu: \"Apakah kamu memberi racun pada daging ini?\" wanita Yahudi itu menjawab, \"Siapa yang memberimu kabar?\" beliau menjawab: \"Yang memberiku kabar adalah apa yang ada di tanganku ini.\" wanita Yahudi itu berkata, \"Benar.\" Beliau bertanya lagi: \"Apa yang kamu inginkan?\" wanita Yahudi itu menjawab, \"Dalam hati aku berkata, 'Jika dia memang seorang Nabi maka dia tidak akan mendapatkan bahaya, tetapi jika bukan seorang Nabi maka kami dapat beristirahat darinya'. Rasulullah shallallahu 'alaihi wasallam lalu memaafkan wanita Yahudi tersebut dan tidak menghukumnya. Para sahabat beliau yang ikut makan daging kambing itu meninggal, sementara Rasulullah shallallahu 'alaihi wasallam membekam pada bagian tengkuknya karena daging yang dimakannya. Lalu beliau dibekam oleh Abu Hind -seorang mantan budak bani Bayadhah dari kaum Anshar- dengan menggunakan tanduk dan pisau tajam.\" Telah menceritakan kepada kami [Wahb bin Baqiyyah] berkata, telah menceritakan kepada kami [Khalid] dari [Muhammad bin Amru] dari [Abu Salamah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah diberi hadiah kambing panggang oleh seorang wanita Yahudi Khaibar, seperti dalam hadits Jabir. Ia (perawi) berkata, \"Bisyr bin Al Bara bin Ma'rur Al Anshari meninggal dunia (karena makan daging kambing), maka Rasulullah mengutus seseorang untuk menjemput wanita Yahudi tersebut. Beliau bersabda: \"Apa yang mendorongmu untuk melakukan itu?\" kemudian disebutkan sebagaimana dalam hadits Jabir. Rasulullah shallallahu 'alaihi wasallam kemudian memerintahkan supaya wanita itu dihukum, maka wanita itu pun dibunuh. Namun ia tidak menyebutkan tentang cerita bekam.\""
            },
            {
                "number": 3790,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ عَنْ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْبَلُ الْهَدِيَّةَ وَلَا يَأْكُلُ الصَّدَقَةَحَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ فِي مَوْضِعٍ آخَرَ عَنْ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ وَلَمْ يَذْكُرْ أَبَا هُرَيْرَةَ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْبَلُ الْهَدِيَّةَ وَلَا يَأْكُلُ الصَّدَقَةَ زَادَ فَأَهْدَتْ لَهُ يَهُودِيَّةٌ بِخَيْبَرَ شَاةً مَصْلِيَّةً سَمَّتْهَا فَأَكَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهَا وَأَكَلَ الْقَوْمُ فَقَالَ ارْفَعُوا أَيْدِيَكُمْ فَإِنَّهَا أَخْبَرَتْنِي أَنَّهَا مَسْمُومَةٌ فَمَاتَ بِشْرُ بْنُ الْبَرَاءِ بْنِ مَعْرُورٍ الْأَنْصَارِيُّ فَأَرْسَلَ إِلَى الْيَهُودِيَّةِ مَا حَمَلَكِ عَلَى الَّذِي صَنَعْتِ قَالَتْ إِنْ كُنْتَ نَبِيًّا لَمْ يَضُرَّكَ الَّذِي صَنَعْتُ وَإِنْ كُنْتَ مَلِكًا أَرَحْتُ النَّاسَ مِنْكَ فَأَمَرَ بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُتِلَتْ ثُمَّ قَالَ فِي وَجَعِهِ الَّذِي مَاتَ فِيهِ مَازِلْتُ أَجِدُ مِنْ الْأَكْلَةِ الَّتِي أَكَلْتُ بِخَيْبَرَ فَهَذَا أَوَانُ قَطَعَتْ أَبْهَرِي",
                "id": "Telah menceritakan kepada kami [Wahab bin Baqiyyah] dari [Khalid] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menerima hadiah namun tidak makan zakat.\" Telah menceritakan kepada kami [Wahb bin Baqiyyah] -dalam riwayat lain- dari [Khalid] dari [Muhammad bin Amru] dari [Abu Salamah] -namun ia tidak menyebutkan Abu Hurairah, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menerima hadiah namun tidak makan zakat.\" Ia menambahkan, \"Maka ada seorang wanita Yahudi Khaibar yang memberi hadiah daging guling yang telah dilumuri racun kepada beliau. Rasulullah shallallahu 'alaihi wasallam dan para sahabatnya lalu makan daging kambing tersebut. Namun kemudian, beliau bersabda: \"Angkatlah tangan kalian (berhenti makan), karena sesungguhnya daging kambing ini telah memberiku kabar bahwa ia telah dibubuhi racun.\" Bisyr Ibnul Al Bara bin Ma'rur Al Anshari akhirnya meninggal dunia. Rasulullah kemudian mengutus utusan kepada wanita Yahudi tersebut. Beliau bertanya: \"Apa yang mendorongmu untuk melakukan hal itu?\" Wanita itu menjawab, \"Jika engkau seorang Nabi, maka apa yang aku lakukan tidak akan membahayakanmu. Namun jika engkau hanya seorang raja, maka dengan begitu aku telah mengistirahatkan manusia darimu.\" Rasulullah shallallahu 'alaihi wasallam lantas memerintahkan agar wanita itu dibunuh, maka ia pun dibunuh. Kemudian beliau berkata pada saat sakit yang membawanya kepada kematian: \"Aku masih merasakan apa yang pernah aku makan di Khaibar, dan sekarang adalah waktu terputusnya punggungku (kematianku).\""
            },
            {
                "number": 3791,
                "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ ابْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِأَنَّ أُمَّ مُبَشِّرٍ قَالَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ مَا يُتَّهَمُ بِكَ يَا رَسُولَ اللَّهِ فَإِنِّي لَا أَتَّهِمُ بِابْنِي شَيْئًا إِلَّا الشَّاةَ الْمَسْمُومَةَ الَّتِي أَكَلَ مَعَكَ بِخَيْبَرَ وَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا لَا أَتَّهِمُ بِنَفْسِي إِلَّا ذَلِكَ فَهَذَا أَوَانُ قَطَعَتْ أَبْهَرِيقَالَ أَبُو دَاوُد وَرُبَّمَا حَدَّثَ عَبْدُ الرَّزَّاقِ بِهَذَا الْحَدِيثِ مُرْسَلًا عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرُبَّمَا حَدَّثَ بِهِ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ وَذَكَرَ عَبْدُ الرَّزَّاقِ أَنَّ مَعْمَرًا كَانَ يُحَدِّثُهُمْ بِالْحَدِيثِ مَرَّةً مُرْسَلًا فَيَكْتُبُونَهُ وَيُحَدِّثُهُمْ مَرَّةً بِهِ فَيُسْنِدُهُ فَيَكْتُبُونَهُ وَكُلٌّ صَحِيحٌ عِنْدَنَا قَالَ عَبْدُ الرَّزَّاقِ فَلَمَّا قَدِمَ ابْنُ الْمُبَارَكِ عَلَى مَعْمَرٍ أَسْنَدَ لَهُ مَعْمَرٌ أَحَادِيثَ كَانَ يُوقِفُهَا حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ خَالِدٍ حَدَّثَنَا رَبَاحٌ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أُمِّهِ أُمِّ مُبَشِّرٍ قَالَ أَبُو سَعِيدِ بْنُ الْأَعْرَابِيِّ كَذَا قَالَ عَنْ أُمِّهِ وَالصَّوَابُ عَنْ أَبِيهِ عَنْ أُمِّ مُبَشِّرٍ دَخَلْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مَعْنَى حَدِيثِ مَخْلَدِ بْنِ خَالِدٍ نَحْوَ حَدِيثِ جَابِرٍ قَالَ فَمَاتَ بِشْرُ بْنُ الْبَرَاءِ بْنِ مَعْرُورٍ فَأَرْسَلَ إِلَى الْيَهُودِيَّةِ فَقَالَ مَا حَمَلَكِ عَلَى الَّذِي صَنَعْتِ فَذَكَرَ نَحْوَ حَدِيثِ جَابِرٍ فَأَمَرَ بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُتِلَتْ وَلَمْ يَذْكُرْ الْحِجَامَةَ",
                "id": "Telah menceritakan kepada kami [Makhlad bin Khalid] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Ibnu Ka'b bin Malik] dari [Bapaknya] berkata, \"Ummu Mubasysyir berkata kepada Nabi shallallahu 'alaihi wasallam pada saat sakit yang menghantarkan beliau kepada kematian, \"Apa yang engkau keluhkan ya Rasulullah? Aku tidak mengeluhkan apapun atas anakku kecuali daging kambing beracun yang ia makan bersamamu waktu di Khaibar.\" Nabi shallallahu 'alaihi wasallam lalu menjawab: \"Aku juga tidak mengeluhkan apapun selain daging kambing beracun itu, dan sekarang adalah waktu terputusnya punggungku (kematian).\" Abu Dawud berkata, \"Barangkali Abdurrazaq menceritakan hadits ini secara mursal dari Ma'mar, dari Az Zuhri, dari Nabi shallallahu 'alaihi wasallam. Dan barangkali ia juga menceritakan hadits dari Az Zuhri, dari 'Abdurrahman bin Ka'b bin Malik.\" Abdurrazaq menyebutkan bahwa Ma'mar menceritakan hadits ini kepada mereka sekali waktu secara mursal. Namun, sekali waktu mereka yang menulisnya sedangkan dia menceritakannya kepada mereka. Dan semua itu menurut kami shahih\" Abdurrazaq berkata, \"Ketika Ibnul Mubarak datang kepada Ma'mar, maka Ma'mar menyandarkan kepada Ibnu Mubarak beberapa hadits yang ia mauqufkan.\" Telah menceritakan kepada kami [Ahmad bin Hanbal] berkata, telah menceritakan kepada kami [Ibrahim bin Khalid] berkata, telah menceritakan kepada kami [Rabah] dari [Ma'mar] dari [Az Zuhri] dari ['Abdurrahman bin Abdullah bin ka'b bin malik] dari ibunya Ummu Mubasysyir. Abu Sa'id Ibnul A'rabi berkata; demikian ia berkata dari ibunya. Namun yang benar adalah; dari [bapaknya], dari [Ummu Mubasysyir], ia berkata, \"Aku masuk menemui Nabi shallallahu 'alaihi wasallam... lalu ia menyebutkan sesuai makna hadits Makhlad bin Khalid, seperti hadits Jabir. Ia (perawi) berkata, \"Bisyr Ibnul Bara bin Ma'rur meninggal, maka beliau mengutus seseorang kepada wanita Yahudi tersebut. Beliau bertanya: \"Apa yang mendorongmu untuk melakukan hal itu?\" -lalu ia menyebutkan seperti hadits Jabir- Rasulullah shallallahu 'alaihi wasallam lalu memerintahkan untuk menghukum wanita tersebut, maka wanita itu pun dibunuh.\" Dan ia tidak menyebutkan tentang cerita bekam.\""
            },
            {
                "number": 3792,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ الْجَعْدِ حَدَّثَنَا شُعْبَةُ ح و حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَتَلَ عَبْدَهُ قَتَلْنَاهُ وَمَنْ جَدَعَ عَبْدَهُ جَدَعْنَاهُحَدَّثَنَا مُحَمَّدُ ابْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ بِإِسْنَادِهِ مِثْلَهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ خَصَى عَبْدَهُ خَصَيْنَاهُ ثُمَّ ذَكَرَ مِثْلَ حَدِيثِ شُعْبَةَ وَحَمَّادٍ قَالَ أَبُو دَاوُد وَرَوَاهُ أَبُو دَاوُدَ الطَّيَالِسِيُّ عَنْ هِشَامٍ مِثْلَ حَدِيثِ مُعَاذٍ حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ عَنْ ابْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ بِإِسْنَادِ شُعْبَةَ مِثْلَهُ زَادَ ثُمَّ إِنَّ الْحَسَنَ نَسِيَ هَذَا الْحَدِيثَ فَكَانَ يَقُولُ لَا يُقْتَلُ حُرٌّ بِعَبْدٍ",
                "id": "Telah menceritakan kepada kami [Ali Ibnul Ja'd] berkata, telah menceritakan kepada kami [Syu'bah]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] dari [Qatadah] dari [Al Hasan] dari [Samurah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membunuh budaknya maka kami akan membunuhnya, dan barangsiapa memotong hidung budaknya maka kami akan memotong hidungnya.\" Telah menceritakan kepada kami [Muhammad Ibnul Mutsanna] berkata, telah menceritakan kepada kami [Mu'adz bin Hisyam] berkata, telah menceritakan kepadaku [Bapakku] dari [Qatadah] dengan sanadnya yang sama. Ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mengebiri budaknya maka kami akan mengebirinya.\" Kemudian ia menyebutkan sebagaimana hadits Syu'bah dan Hamamd.\" Abu Dawud berkata, \" [Abu Dawud Ath Thayalisi] meriwayatkannya dari [Hisyam] seperti hadits [Mu'adz]. Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Sa'id bin Amir] dari [Ibnu Abu Arubah] dari [Qatadah] dengan sanad [Syu'bah] seperti hadits itu. Hanya saja ia menambahkan, bahwa Al Hasan melupakan hadits ini. Ia menyebutkan, \"Orang merdeka tidak boleh dibunuh karena seorang budak (yakni qishas).\""
            },
            {
                "number": 3793,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ قَالَلَا يُقَادُ الْحُرُّ بِالْعَبْدِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] berkata, telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Al Hasan] ia berkata, \"Orang merdeka tidak boleh diqishas karena (membunuh) seorang budak.\""
            },
            {
                "number": 3794,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْحَسَنِ بْنِ تَسْنِيمٍ الْعَتَكِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا سَوَّارٌ أَبُو حَمْزَةَ حَدَّثَنَا عَمْرُو بْنُ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَجَاءَ رَجُلٌ مُسْتَصْرِخٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ جَارِيَةٌ لَهُ يَا رَسُولَ اللَّهِ فَقَالَ وَيْحَكَ مَا لَكَ قَالَ شَرًّا أَبْصَرَ لِسَيِّدِهِ جَارِيَةً لَهُ فَغَارَ فَجَبَّ مَذَاكِيرَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيَّ بِالرَّجُلِ فَطُلِبَ فَلَمْ يُقْدَرْ عَلَيْهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اذْهَبْ فَأَنْتَ حُرٌّ فَقَالَ يَا رَسُولَ اللَّهِ عَلَى مَنْ نُصْرَتِي قَالَ عَلَى كُلِّ مُؤْمِنٍ أَوْ قَالَ كُلِّ مُسْلِمٍقَالَ أَبُو دَاوُد الَّذِي عَتَقَ كَانَ اسْمُهُ رَوْحُ بْنُ دِينَارٍ قَالَ أَبُو دَاوُد الَّذِي جَبَّهُ زِنْبَاعٌ قَالَ أَبُو دَاوُد هَذَا زِنْبَاعٌ أَبُو رَوْحٍ كَانَ مَوْلَى الْعَبْدِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Hasan bin Tasnim Al 'Ataki] berkata, telah menceritakan kepada kami [Muhammad bin Bakr] berkata, telah mengabarkan kepada kami [Sawwar Abu Hamzah] berkata, telah menceritakan kepada kami [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam sambil berteriak, ia mengatakan, \"Wahai Rasulullah, budak wanitanya!\" beliau bersabda: \"Celaka kamu, ada apa denganmu?\" ia menjawab, \"Keburukkan, ia (budak) melihat budak wanita milik tuannya. Lalu tuannya cemburu hingga ia memotong kemaluannya.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Bawa kemari laki-laki itu.\" Laki-laki itu kemudian dicari namun tidak ketemu. Rasulullah shallallahu 'alaihi wasallam lantas bersabda: \"Engkau sekarang merdeka, silahkan pergi.\" Ia lalu bertanya, \"Wahai Rasulullah, kepada siapa aku minta pertolongan?\" beliau menjawab: \"Kepada setiap mukmin, atau beliau mengatakan, \"Kepada setiap muslim.\" Abu Dawud berkata, \"Budak yang dimerdekakan itu namanya adalah Rauh bin Dinar.\" Abu Dawud berkata lagi, \"Sementara orang yang memotong kemaluan budak itu namanya adalah Zinba'.\" Abu Dawud berkata, \"Zinba' Abu Rauh juga mantan budak.\""
            },
            {
                "number": 3795,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ وَمُحَمَّدُ بْنُ عُبَيْدٍ الْمَعْنَى قَالَا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ وَرَافِعِ بْنِ خَدِيجٍأَنَّ مُحَيِّصَةَ بْنَ مَسْعُودٍ وَعَبْدَ اللَّهِ بْنَ سَهْلٍ انْطَلَقَا قِبَلَ خَيْبَرَ فَتَفَرَّقَا فِي النَّخْلِ فَقُتِلَ عَبْدُ اللَّهِ بْنُ سَهْلٍ فَاتَّهَمُوا الْيَهُودَ فَجَاءَ أَخُوهُ عَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ وَابْنَا عَمِّهِ حُوَيِّصَةُ وَمُحَيِّصَةُ فَأَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَكَلَّمَ عَبْدُ الرَّحْمَنِ فِي أَمْرِ أَخِيهِ وَهُوَ أَصْغَرُهُمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْكُبْرَ الْكُبْرَ أَوْ قَالَ لِيَبْدَأْ الْأَكْبَرُ فَتَكَلَّمَا فِي أَمْرِ صَاحِبِهِمَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقْسِمُ خَمْسُونَ مِنْكُمْ عَلَى رَجُلٍ مِنْهُمْ فَيُدْفَعُ بِرُمَّتِهِ قَالُوا أَمْرٌ لَمْ نَشْهَدْهُ كَيْفَ نَحْلِفُ قَالَ فَتُبَرِّئُكُمْ يَهُودُ بِأَيْمَانِ خَمْسِينَ مِنْهُمْ قَالُوا يَا رَسُولَ اللَّهِ قَوْمٌ كُفَّارٌ قَالَ فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ قِبَلِهِقَالَ سَهْلٌ دَخَلْتُ مِرْبَدًا لَهُمْ يَوْمًا فَرَكَضَتْنِي نَاقَةٌ مِنْ تِلْكَ الْإِبِلِ رَكْضَةً بِرِجْلِهَا قَالَ حَمَّادٌ هَذَا أَوْ نَحْوَهُ قَالَ أَبُو دَاوُد رَوَاهُ بِشْرُ بْنُ الْمُفَضَّلِ وَمَالِكٌ عَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ فِيهِ أَتَحْلِفُونَ خَمْسِينَ يَمِينًا وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ أَوْ قَاتِلِكُمْ وَلَمْ يَذْكُرْ بِشْرٌ دَمًا و قَالَ عَبْدَةُ عَنْ يَحْيَى كَمَا قَالَ حَمَّادٌ وَرَوَاهُ ابْنُ عُيَيْنَةَ عَنْ يَحْيَى فَبَدَأَ بِقَوْلِهِ تُبَرِّئُكُمْ يَهُودُ بِخَمْسِينَ يَمِينًا يَحْلِفُونَ وَلَمْ يَذْكُرْ الِاسْتِحْقَاقَ قَالَ أَبُو دَاوُد وَهَذَا وَهْمٌ مِنْ ابْنِ عُيَيْنَةَ",
                "id": "Telah menceritakan kepada kami [ubaidhullah bin Umar bin Masarah] dan [Muhammad bin Ubaid] secara makna, keduanya berkata; telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin Sa'id] dari [Busyair bin Yasar] dari [Sahl bin Abu Hatsmah] dan [Rafi' bin Khadij] berkata, \"Muhayishah bin Mas'ud dan Abdullah bin Sahl berangkat menuju Khaibar, namun keduanya berpisah di perkebunan kurma. Lalu Abdullah bin Sahl mati terbunuh, dan mereka menuduh orang-orang Yahudilah yang telah membunuhnya. Kemudian saudaranya bernama 'Abdurrahman bin Sahl datang bersama dua orang anak pamannya, Huwayishah dan Muhayishah kepada Nabi shallallahu 'alaihi wasallam. Lantas 'Abdurrahman menceritakan perihal saudaranya -dia adalah yang paling kecil di antara saudaranya-, beliau pun bersabda; \"Hendaknya dimulai dari yang lebih besar, hendaknya dimulai dari yang lebih besar. Atau beliau bersabda; \"Hendaknya yang lebih besar yang memulai.\" Lalu keduanya menceritakan perihal saudaranya (yang terbunuh), Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaklah lima puluh orang dari kalian bersumpah atas seorang dari mereka (Yahudi yang membunuh), dengan demikian maka akan dapat menebus tulang belulang saudaramu yang telah rapuh.\" Mereka menjawab, \"Kami tidak melihat peristiwanya secara langsung, lalu bagaimana kami akan bersumpah!\" beliau bersabda: \"Orang-orang yahudi itu akan bersih dari tuduhan kalian jika mereka bisa memberikan sumpah dari lima puluh orang dari kalangan mereka.\" Para sahabat menimpali, \"Mereka itu orang-orang kafir!\" Ia (perawi) berkata, \"Lantas Rasulullah shallallahu 'alaihi wasallam menebus (diyat) jiwa korban itu dengan harta pribadinya sendiri.\" Sahl berkata, \"Suatu hari aku masuk ke dalam kandang unta mereka, tiba-tiba aku aku ditendang oleh seekor unta betina dengan kakinya.\" Hammad berkomentar, \"Beginilah haditsnya, atau seperti inilah kira-kira.\" Abu Dawud berkata, \" [Bisyr Ibnul Mufadhdhal] dan [Malik] meriwayatkannya dari [Yahya bin Sa'id]. Ia menyebutkan dalam hadits tersebut, \"Apakah kalian bersedia bersumpah dengan lima puluh kali sumpah, kemudian kalian berhak untuk menuntut balas atas pembunuhan sahabat kalian ini?\" namun Bisyr tidak menyebutkan kata 'darah'. [Abdah] juga berkata dari [Yahya] sebagaimana yang dikatakan oleh [Hammad].\" [Ibnu Uyainah] juga meriwayatkan dari [Yahya], namun ia memulai dengan kalimat, \"Mereka orang-orang Yahudi akan bersih dari tuduhan kalian jika mereka memberikan lima puluh sumpah kepada kalian, dan ia tidak menyebutkan lafadh 'berhak'. Abu Dawud berkata, \"Dan inilah kesamaran dari Ibnu Uyainah.\""
            },
            {
                "number": 3796,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مَالِكٌ عَنْ أَبِي لَيْلَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَهْلٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَأَنَّهُ أَخْبَرَهُ هُوَ وَرِجَالٌ مِنْ كُبَرَاءِ قَوْمِهِ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ وَمُحَيِّصَةَ خَرَجَا إِلَى خَيْبَرَ مِنْ جَهْدٍ أَصَابَهُمْ فَأُتِيَ مُحَيِّصَةُ فَأُخْبِرَ أَنَّ عَبْدَ اللَّهِ بْنَ سَهْلٍ قَدْ قُتِلَ وَطُرِحَ فِي فَقِيرٍ أَوْ عَيْنٍ فَأَتَى يَهُودَ فَقَالَ أَنْتُمْ وَاللَّهِ قَتَلْتُمُوهُ قَالُوا وَاللَّهِ مَا قَتَلْنَاهُ فَأَقْبَلَ حَتَّى قَدِمَ عَلَى قَوْمِهِ فَذَكَرَ لَهُمْ ذَلِكَ ثُمَّ أَقْبَلَ هُوَ وَأَخُوهُ حُوَيِّصَةُ وَهُوَ أَكْبَرُ مِنْهُ وَعَبْدُ الرَّحْمَنِ بْنُ سَهْلٍ فَذَهَبَ مُحَيِّصَةُ لِيَتَكَلَّمَ وَهُوَ الَّذِي كَانَ بِخَيْبَرَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبِّرْ كَبِّرْ يُرِيدُ السِّنَّ فَتَكَلَّمَ حُوَيِّصَةُ ثُمَّ تَكَلَّمَ مُحَيِّصَةُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِمَّا أَنْ يَدُوا صَاحِبَكُمْ وَإِمَّا أَنْ يُؤْذَنُوا بِحَرْبٍ فَكَتَبَ إِلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِذَلِكَ فَكَتَبُوا إِنَّا وَاللَّهِ مَا قَتَلْنَاهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحُوَيِّصَةَ وَمُحَيِّصَةَ وَعَبْدِ الرَّحْمَنِ أَتَحْلِفُونَ وَتَسْتَحِقُّونَ دَمَ صَاحِبِكُمْ قَالُوا لَا قَالَ فَتَحْلِفُ لَكُمْ يَهُودُ قَالُوا لَيْسُوا مُسْلِمِينَ فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ فَبَعَثَ إِلَيْهِمْ مِائَةَ نَاقَةٍ حَتَّى أُدْخِلَتْ عَلَيْهِمْ الدَّارَقَالَ سَهْلٌ لَقَدْ رَكَضَتْنِي مِنْهَا نَاقَةٌ حَمْرَاءُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Amru bin As Sarh] berkata, telah mengabarkan kepada kami [Ibnu Wahb] berkata, telah mengabarkan kepadaku [Malik] dari [Abu Laila bin Abdullah bin 'Abdurrahman bin Sahl] dari [Sahl bin Abu Hatsmah] Bahwasanya ia dan beberapa tokoh kaumnya mengabarkan kepadanya, bahwa Abdullah bin Sahl dan Muhayishah keluar menuju Khaibar karena penderitaan yang mereka alami. Muhayyishah lalu didatangkan, lalu dikabarkan bahwa Abddullah bin Sahl dibunuh dan dibuang ke dalam lubang atau sumur. Muhayishah lalu mendatangi orang-orang Yahudi dan bertanya, \"Demi Allah, kalian yang telah membunuhnya?\" orang-orang Yahudi itu menjawab, \"Demi Allah, kami tidak membunuhnya.\" Muhayishah lalu pergi hingga sampai ke Madinah, ia lantas ceritakan semua kejadian tersebut kepada kaumnya. Kemudian, ia bersama saudaranya Huwayishah -dan ia umurnya lebih tua- serta 'Abdurrahman bin Sahl pergi menghadap Rasulullah shallallahu 'alaihi wasallam. Muhayishah angkat bicara -karena dialah yang waktu itu di Khaibar-, namun Rasulullah shallallahu 'alaihi wasallam bersabda: \"Yang tua dahulu, yang tua dahulu.\" Huwayishah lalu berbicara dan diteruskan oleh Muhayishah, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Mereka mau mambayar diyat untuk temanmu atau mereka mengumumkan peperangan!\" Rasulullah shallallahu 'alaihi wasallam kemudian menulis surat kepada mereka menuntut perkara tersebut, lalu mereka membalas (surat beliau) dengan menulis jawaban, \"Demi Allah kami tidak membunuhnya.\" Rasulullah shallallahu 'alaihi wasallam lalu berkata kepada Huwayishah, Muhayishah dan 'Abdurrahman bin Sahl, \"Apakah kalian mau bersumpah, sehingga kalian berhak mendapatkan hak atas pembunuhan saudara kalian?\" mereka menjawab, \"Tidak.\" Beliau bersabda: \"(Padahal) orang-orang Yahudi akan bersumpah atas tuduhan kalian.\" Mereka menimpali, \"Mereka bukan orang-orang muslim!\" Rasulullah shallallahu 'alaihi wasallam lalu menebus diyat itu dengan harta pribadinya, beliau kirimkan unta hingga unta-unta tersebut di masukkan ke dalam rumah mereka.\" Sahl berkata, \"Salah satu unta tersebut bahkan telah menendangku, yakni unta merah.\""
            },
            {
                "number": 3797,
                "arab": "حَدَّثَنَا مَحْمُودُ بْنُ خَالِدٍ وَكَثِيرُ بْنُ عُبَيْدٍ قَالَا حَدَّثَنَا ح و حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ بْنِ سُفْيَانَ أَخْبَرَنَا الْوَلِيدُ عَنْ أَبِي عَمْرٍو عَنْ عَمْرِو بْنِ شُعَيْبٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَتَلَ بِالْقَسَامَةِ رَجُلًا مِنْ بَنِي نَصْرِ بْنِ مَالِكٍ بِبَحْرَةِ الرُّغَاءِ عَلَى شَطِّ لِيَّةِ الْبَحْرَةِ قَالَ الْقَاتِلُ وَالْمَقْتُولُ مِنْهُمْ وَهَذَا لَفْظُ مَحْمُودٍ بِبَحْرَةٍ أَقَامَهُ مَحْمُودٌ وَحْدَهُ عَلَى شَطِّ لِيَّةَ",
                "id": "Telah menceritakan kepada kami [Mahmud bin Khalid] dan [Katsir bin Ubaid] keduanya berkata; telah menceritakan kepada kami. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Ash Shabbah bin Sufyan] berkata, telah mengabarkan kepada kami [Al Walid] dari [Abu Amru] dari [Amru bin Syu'aib] dari Rasulullah shallallahu 'alaihi wasallam bahwasanya beliau membunuh laki-laki dari bani Nashr bin Malik karena sumpah, yaitu di suatu tempat dataran rendah bernama Rugha, di sisi pantai. Ia (Mahmud) berkata, \"Baik yang membunuh atau yang dibunuh adalah dari mereka (bani Nashr).\" Ini adalah lafadz Mahmud, yaitu Mahmud mempunyai lafdh sendiri (dalam riwayatnya berupa; \"di suatu tempat dataran rendah bernama Rugha', di sisi pantai.\""
            },
            {
                "number": 3798,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ الصَّبَّاحِ الزَّعْفَرَانِيُّ حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سَعِيدُ بْنُ عُبَيْدٍ الطَّائِيُّ عَنْ بُشَيْرِ بْنِ يَسَارٍزَعَمَ أَنَّ رَجُلًا مِنْ الْأَنْصَارِ يُقَالُ لَهُ سَهْلُ بْنُ أَبِي حَثْمَةَ أَخْبَرَهُ أَنَّ نَفَرًا مِنْ قَوْمِهِ انْطَلَقُوا إِلَى خَيْبَرَ فَتَفَرَّقُوا فِيهَا فَوَجَدُوا أَحَدَهُمْ قَتِيلًا فَقَالُوا لِلَّذِينَ وَجَدُوهُ عِنْدَهُمْ قَتَلْتُمْ صَاحِبَنَا فَقَالُوا مَا قَتَلْنَاهُ وَلَا عَلِمْنَا قَاتِلًا فَانْطَلَقْنَا إِلَى نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقَالَ لَهُمْ تَأْتُونِي بِالْبَيِّنَةِ عَلَى مَنْ قَتَلَ هَذَا قَالُوا مَا لَنَا بَيِّنَةٌ قَالَ فَيَحْلِفُونَ لَكُمْ قَالُوا لَا نَرْضَى بِأَيْمَانِ الْيَهُودِ فَكَرِهَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُبْطِلَ دَمَهُ فَوَدَاهُ مِائَةً مِنْ إِبِلِ الصَّدَقَةِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Muhammad bin Ash Shabbah Az Za'farani] berkata, telah menceritakan kepada kami [Abu Nu'aim] berkata, telah menceritakan kepada kami [Sa'id bin Ubaid Ath Tha`i] dari [Busyair bin Yasar] ia berkeyakinan bahwa seorang laki-laki Anshar yang bernama [Sahl bin Abu Hatsmah] mengabarkan kepadanya, bahwa seorang laki-laki dari kaumnya berangkat menuju Khaibar. Lalu mereka mereka berpencar, hingga mereka mendapati salah seorang dari mereka telah terbunuh. Mereka pun berkata kepada orang-orang yang mereka temui, \"Kalian telah membunuh saudara kami!\" orang-orang itu menjawab, \"Kami tidak membunuhnya, dan kami juga tidak melihat seorang pembunuh.\" Maka kami pun berangkat menuju Nabi shallallahu 'alaihi wasallam. Ia (perawi) berkata, \"Beliau bertanya kepada mereka, \"Apakah kalian datang kepadaku dengan membawa bukti, siapa yang membunuhnya (temanmu)?\" mereka menjawab, \"Kami tidak punya bukti.\" Beliau menimpali: \"Mereka (orang-orang Yahudi) akan bersumpah atas kalian!\" mereka berkata, \"Kami tidak ridha dengan sumpahnya orang-orang yahudi.\" Nabi shallallahu 'alaihi wasallam tidak ingin kematiannya itu menjadi sia-sia, maka beliau pun membayar diyat tersebut dengan seratus ekor unta dari unta-unta sedekah.\""
            },
            {
                "number": 3799,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيِّ بْنِ رَاشِدٍ أَخْبَرَنَا هُشَيْمٌ عَنْ أَبِي حَيَّانَ التَّيْمِيِّ حَدَّثَنَا عَبَايَةُ بْنُ رِفَاعَةَ عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَأَصْبَحَ رَجُلٌ مِنْ الْأَنْصَارِ مَقْتُولًا بِخَيْبَرَ فَانْطَلَقَ أَوْلِيَاؤُهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرُوا ذَلِكَ لَهُ فَقَالَ لَكُمْ شَاهِدَانِ يَشْهَدَانِ عَلَى قَتْلِ صَاحِبِكُمْ قَالُوا يَا رَسُولَ اللَّهِ لَمْ يَكُنْ ثَمَّ أَحَدٌ مِنْ الْمُسْلِمِينَ وَإِنَّمَا هُمْ يَهُودُ وَقَدْ يَجْتَرِئُونَ عَلَى أَعْظَمَ مِنْ هَذَا قَالَ فَاخْتَارُوا مِنْهُمْ خَمْسِينَ فَاسْتَحْلَفُوهُمْ فَأَبَوْا فَوَدَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali bin Rasyid] berkata, telah mengabarkan kepada kami [Husyaim] dari [Abu hayyan At taimi] berkata, telah menceritakan kepada kami [Abayah bin Rifa'ah] dari [Rafi' bin Khadij] ia berkata, \"Seorang laki-laki Anshar terbunuh di Khaibar, maka para walinya datang menemui Nabi shallallahu 'alaihi wasallam. Mereka menceritakan kepada beliau perihal terbunuhnya saudaranya tersebut. Beliau lantas bertanya: \"Apakah kalian mempunyai dua saksi yang melihat pembunuhan itu?\" mereka menjawab, \"Wahai Rasulullah, tidak ada seorang muslim pun, mereka semua orang-orang Yahudi! Dan mungkin mereka akan lebih berani lagi untuk melakukan yang lebih besar dari ini.\" Rafi' bin Khadij berkata, \"Beliau lalu memilih lima puluh orang dari mereka untuk disumpah, namun mereka menolak. Maka diyat itu akhirnya dibayar oleh Nabi shallallahu 'alaihi wasallam dari harta sendiri.\""
            },
            {
                "number": 3800,
                "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى الْحَرَّانِيُّ حَدَّثَنِي مُحَمَّدٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ بُجَيْدٍ قَالَإِنَّ سَهْلًا وَاللَّهِ أَوْهَمَ الْحَدِيثَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَى يَهُودَ أَنَّهُ قَدْ وُجِدَ بَيْنَ أَظْهُرِكُمْ قَتِيلٌ فَدُوهُ فَكَتَبُوا يَحْلِفُونَ بِاللَّهِ خَمْسِينَ يَمِينًا مَا قَتَلْنَاهُ وَلَا عَلِمْنَا قَاتِلًا قَالَ فَوَدَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عِنْدِهِ بِمِائَةِ نَاقَةٍ",
                "id": "Telah menceritakan kepada kami [Abdul Aziz bin Yahya Al Harrani] berkata, telah menceritakan kepadaku [Muhammad] -maksudnya Muhammad bin Salamah- dari [Muhammad bin Ishaq] dari [Muhammad bin Ibrahim Ibnul Harits] dari ['Abdurrahman bin Bujaid] ia berkata; Demi Allah, Sahl masih samar dalam haditsnya. Sesungguhnya Rasulullah shallallahu 'alaihi wasallam menulis surat kepada orang-orang Yahudi, 'Telah didapati di antara kalian korban pembunuhan, maka tebuslah diyatnya'. Lalu orang-orang Yahudi itu memberi balasan dengan memberikan sumpah sebanyak lima puluh kali, 'kami tidak membunuhnya, dan kami juga tidak tahu siapa pembunuhnya'. Ia (perawi) berkata, \"Rasulullah shallallahu 'alaihi wasallam lalu menebus diyat itu dengan seratus ekor unta miliknya sendiri.\""
            },
            {
                "number": 3801,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ وَسُلَيْمَانَ بْنِ يَسَارٍ عَنْ رِجَالٍ مِنْ الْأَنْصَارِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْيَهُودِ وَبَدَأَ بِهِمْ يَحْلِفُ مِنْكُمْ خَمْسُونَ رَجُلًا فَأَبَوْا فَقَالَ لِلْأَنْصَارِ اسْتَحِقُّوا قَالُوا نَحْلِفُ عَلَى الْغَيْبِ يَا رَسُولَ اللَّهِ فَجَعَلَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِيَةً عَلَى يَهُودَ لِأَنَّهُ وُجِدَ بَيْنَ أَظْهُرِهِمْ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah bin 'Abdurrahman] dan [Sulaiman bin Yasar] dari [Beberapa lelaki] Anshar bahwa Nabi shallallahu 'alaihi wasallam bersabda kepada orang-orang Yahudi, dan beliau memulai dari mereka, \"Apakah ada lima puluh orang dari kalian yang mau bersumpah?\" namun mereka tidak ada yang bersedia. Lalu beliau berkata kepada orang-orang Anshar: \"Kalian berhak (untuk balas bersumpah).\" Mereka bertanya, \"Wahai Rasulullah, apakah kami harus bersumpah untuk sesuatu yang kami tidak ketahui!\" Rasulullah shallallahu 'alaihi wasallam memberi putusan bahwa diyat itu menjadi tanggungan bagi orang-orang Yahudi, sebab korban pembunuhan itu ada pada mereka.\""
            },
            {
                "number": 3802,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ جَارِيَةً وُجِدَتْ قَدْ رُضَّ رَأْسُهَا بَيْنَ حَجَرَيْنِ فَقِيلَ لَهَا مَنْ فَعَلَ بِكِ هَذَا أَفُلَانٌ أَفُلَانٌ حَتَّى سُمِّيَ الْيَهُودِيُّ فَأَوْمَتْ بِرَأْسِهَا فَأُخِذَ الْيَهُودِيُّ فَاعْتَرَفَ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُرَضَّ رَأْسُهُ بِالْحِجَارَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah mengabarkan kepada kami [Hammam] dari [Qatadah] dari [Anas] berkata, \"Seorang budak wanita ditemukan dalam keadaan kepalanya telah retak di antara dua batu, ia lalu ditanya, \"Siapa yang melakukan ini? Apakah si fulan, apakah si fulan?\" Hingga disebutlah nama seorang Yahudi dengan isyarat kepalanya. Maka yahudi itu ditangkap dan Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk meremukkan kepalanya dengan batu (sebagaimana yang dilakukannya kepada budak tersebut).\""
            },
            {
                "number": 3803,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسٍأَنَّ يَهُودِيًّا قَتَلَ جَارِيَةً مِنْ الْأَنْصَارِ عَلَى حُلِيٍّ لَهَا ثُمَّ أَلْقَاهَا فِي قَلِيبٍ وَرَضَخَ رَأْسَهَا بِالْحِجَارَةِ فَأُخِذَ فَأُتِيَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِهِ أَنْ يُرْجَمَ حَتَّى يَمُوتَ فَرُجِمَ حَتَّى مَاتَقَالَ أَبُو دَاوُد رَوَاهُ ابْنُ جُرَيْجٍ عَنْ أَيُّوبَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Ayyub] dari [Abu Qilabah] dari [Anas] berkata, \"Seorang Yahudi membunuh serang wanita Anshar untuk merebut perhiasannya. Yahudi itu lalu membuang budak wanita tersebut ke dalam sumur tua dan menghimpit kepalanya dengan batu. Yahudi itu akhirnya ditangkap dan dibawa ke hadapan Nabi shallallahu 'alaihi wasallam, beliau lalu memerintahkan agar yahudi itu dirajam hingga mati, maka yahudi itu dirajam hingga mati.\" Abu Dawud berkata, \" [Ibnu Juraij] meriwayatkannya dari [Ayyub] seperti itu pula.\""
            },
            {
                "number": 3804,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا ابْنُ إِدْرِيسَ عَنْ شُعْبَةَ عَنْ هِشَامِ بْنِ زَيْدٍ عَنْ جَدِّهِ أَنَسٍأَنَّ جَارِيَةً كَانَ عَلَيْهَا أَوْضَاحٌ لَهَا فَرَضَخَ رَأْسَهَا يَهُودِيٌّ بِحَجَرٍ فَدَخَلَ عَلَيْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِهَا رَمَقٌ فَقَالَ لَهَا مَنْ قَتَلَكِ فُلَانٌ قَتَلَكِ فَقَالَتْ لَا بِرَأْسِهَا قَالَ مَنْ قَتَلَكِ فُلَانٌ قَتَلَكِ قَالَتْ لَا بِرَأْسِهَا قَالَ فُلَانٌ قَتَلَكِ قَالَتْ نَعَمْ بِرَأْسِهَا فَأَمَرَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُتِلَ بَيْنَ حَجَرَيْنِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ibnu Idris] dari [Syu'bah] dari [Hisyam bin Zaid] dari kakeknya [Anas] ia berkata, \"Seorang budak wanita memiliki perhiasan dari perak, lalu seorang Yahudi memukul kepalanya dengan batu hingga retak. Rasulullah shallallahu 'alaihi wasallam kemudian masuk menemui budak wanita itu di saat akhir dari hidupnya. Beliau bertanya: \"Siapa yang membunuhmu, apakah si fulan yang melakukannya?\" Dengan isyarat kepalanya ia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Siapa yang membunuhmu, apakah si fulan yang melakukannya?\" Dengan isyarat kepalanya ia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Siapa yang membunuhmu, apakah si fulan yang melakukannya?\" Dengan isyarat kepala ia menjawab, \"Benar.\" Rasulullah shallallahu 'alaihi wasallam kemudian memerintahkan untuk menangkap pembunuh tersebut, maka pembunuh itu pun dibunuh dengan dihimpit (dibenturkan kepalanya) antara dua batu.\""
            },
            {
                "number": 3805,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَمُسَدَّدٌ قَالَا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ أَخْبَرَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ قَيْسِ بْنِ عُبَادٍ قَالَانْطَلَقْتُ أَنَا وَالْأَشْتَرُ إِلَى عَلِيٍّ عَلَيْهِ السَّلَام فَقُلْنَا هَلْ عَهِدَ إِلَيْكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا لَمْ يَعْهَدْهُ إِلَى النَّاسِ عَامَّةً قَالَ لَا إِلَّا مَا فِي كِتَابِي هَذَا قَالَ مُسَدَّدٌ قَالَ فَأَخْرَجَ كِتَابًا وَقَالَ أَحْمَدُ كِتَابًا مِنْ قِرَابِ سَيْفِهِ فَإِذَا فِيهِ الْمُؤْمِنُونَ تَكَافَأُ دِمَاؤُهُمْ وَهُمْ يَدٌ عَلَى مَنْ سِوَاهُمْ وَيَسْعَى بِذِمَّتِهِمْ أَدْنَاهُمْ أَلَا لَا يُقْتَلُ مُؤْمِنٌ بِكَافِرٍ وَلَا ذُو عَهْدٍ فِي عَهْدِهِ مَنْ أَحْدَثَ حَدَثًا فَعَلَى نَفْسِهِ وَمَنْ أَحْدَثَ حَدَثًا أَوْ آوَى مُحْدِثًا فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ قَالَ مُسَدَّدٌ عَنْ ابْنِ أَبِي عَرُوبَةَ فَأَخْرَجَ كِتَابًاحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ حَدَّثَنَا هُشَيْمٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ نَحْوَ حَدِيثِ عَلِيٍّ زَادَ فِيهِ وَيُجِيرُ عَلَيْهِمْ أَقْصَاهُمْ وَيَرُدُّ مُشِدُّهُمْ عَلَى مُضْعِفِهِمْ وَمُتَسَرِّيهِمْ عَلَى قَاعِدِهِمْ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Musaddad] keduanya berkata; telah menceritakan kepada kami [Yahya bin Sa'id] berkata, telah mengabarkan kepada kami [Sa'id bin Abu Arubah] dari [Qatadah] dari [Al Hasan] dari [Qais bin Ubad] ia berkata, \"Aku bersama Al Asytar berangkat menemui [Ali radliallahu 'anhu]. Kami lalu bertanya, \"Apakah Rasulullah shallallahu 'alaihi wasallam memberimu suatu wasiat yang tidak disampaikan kepada manusia secara umum?\" Ali menjawab, \"Tidak, kecuali apa yang ada dalam catatanku ini -Musaddad menyebutkan- \"Ali lalu mengeluarkan sebuah catatan.\" -Dan Ahmad menyebutkan- \"catatan yang ada pada sarung pedangnya.\" Dalam catatan itu disebutkan, \"orang-orang yang beriman itu darahnya sama (dalam hal qishash dan tebusan), mereka saling membantu dengan sesamanya untuk menghadapi orang lain (kafir), dan orang-orang yang paling dekat dengan mereka yang mukmin itu dapat menanggung mereka. Ketahuilah, seorang mukmin tidak boleh dibunuh karena membunuh seorang kafir (sebagai qishas), dan juga tidak boleh membunuh seseorang yang berada dalam ikatan perjanjiannya. Siapa saja yang berbuat kejahatan maka dosanya ia tanggung sendiri, dan barangsiapa berbuat kejahatan atau melindungi seorang penjahat, maka ia akan mendapat laknat Allah, malaikat dan semua manusia.\" [Musaddad] menyebutkan dari [Ibnu Abu Arubah], \"Lalu Ali mengeluarkan catatan.\" Telah menceritakan kepada kami [ubaidhullah bin Umar] berkata, telah menceritakan kepada kami [Husyaim] dari [Yahya bin Sa'id] dari [Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda, lalu beliau menyebutkan sebagaimana hadits Ali. Hanya saja perawi menambahkan, \"Orang-orang yang ada di tempat yang jauh (perbatasan) memberikan perlindungannya, yang kuat melindungi yang lemah dan ikut perang melindungi mereka yang berada di rumah.\""
            },
            {
                "number": 3806,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ وَعَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ الْحَوْطِيُّ الْمَعْنَى وَاحِدٌ قَالَا حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ سَعْدَ بْنَ عُبَادَةَ قَالَ يَا رَسُولَ اللَّهِ الرَّجُلُ يَجِدُ مَعَ امْرَأَتِهِ رَجُلًا أَيَقْتُلُهُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا قَالَ سَعْدٌ بَلَى وَالَّذِي أَكْرَمَكَ بِالْحَقِّ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْمَعُوا إِلَى مَا يَقُولُ سَيِّدُكُمْ قَالَ عَبْدُ الْوَهَّابِ إِلَى مَا يَقُولُ سَعْدٌ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Abdul Wahhab bin Najdah Al Hauthi] dengan satu makna, keduanya berkata; telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Suhail] dari [Bapaknya] dari [Abu Hurairah] bahwa Sa'd bin Ubadah berkata, \"Wahai Rasulullah, jika seorang laki-laki mendapati laki-laki (lain) bersama isterinya, apakah ia boleh membunuhnya?\" Rasulullah shallallahu 'alaihi wasallam menjawab: \"Tidak.\" Sa'd berkata, \"Baiklah, demi Dzat yang memuliakanmu dengan kebenaran.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Dengarkanlah apa yang disampikan oleh pemimpinmu.\" Abdul Wahhab berkata dengan redaksi, \"Yakni kepada apa yang disampaikan oleh Sa'd.\""
            },
            {
                "number": 3807,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ سَعْدَ بْنَ عُبَادَةَ قَالَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرَأَيْتَ لَوْ وَجَدْتُ مَعَ امْرَأَتِي رَجُلًا أُمْهِلُهُ حَتَّى آتِيَ بِأَرْبَعَةِ شُهَدَاءَ قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Suhail bin Abu Shalih] dari [Bapaknya] dari [Abu Hurairah] bahwa Sa'd bin Ubadah berkata kepada Rasulullah shallallahu 'alaihi wasallam, \"Apa pendapatmu jika aku mendapati isteriku bersama laki-laki asing, apakah aku harus menahan diri hingga aku dapat menghadirkan empat orang saksi?\" Beliau menjawab: \"Ya.\""
            },
            {
                "number": 3808,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ دَاوُدَ بْنِ سُفْيَانَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ أَبَا جَهْمِ بْنَ حُذَيْفَةَ مُصَدِّقًا فَلَاجَّهُ رَجُلٌ فِي صَدَقَتِهِ فَضَرَبَهُ أَبُو جَهْمٍ فَشَجَّهُ فَأَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالُوا الْقَوَدَ يَا رَسُولَ اللَّهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَكُمْ كَذَا وَكَذَا فَلَمْ يَرْضَوْا فَقَالَ لَكُمْ كَذَا وَكَذَا فَلَمْ يَرْضَوْا فَقَالَ لَكُمْ كَذَا وَكَذَا فَرَضُوا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي خَاطِبٌ الْعَشِيَّةَ عَلَى النَّاسِ وَمُخْبِرُهُمْ بِرِضَاكُمْ فَقَالُوا نَعَمْ فَخَطَبَ رَسُولُ اللَّهِ فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ هَؤُلَاءِ اللَّيْثِيِّينَ أَتَوْنِي يُرِيدُونَ الْقَوَدَ فَعَرَضْتُ عَلَيْهِمْ كَذَا وَكَذَا فَرَضُوا أَرَضِيتُمْ قَالُوا لَا فَهَمَّ الْمُهَاجِرُونَ بِهِمْ فَأَمَرَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَكُفُّوا عَنْهُمْ فَكَفُّوا ثُمَّ دَعَاهُمْ فَزَادَهُمْ فَقَالَ أَرَضِيتُمْ فَقَالُوا نَعَمْ قَالَ إِنِّي خَاطِبٌ عَلَى النَّاسِ وَمُخْبِرُهُمْ بِرِضَاكُمْ قَالُوا نَعَمْ فَخَطَبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَرَضِيتُمْ قَالُوا نَعَمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Dawud bin Sufyan] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Urwah] dari ['Aisyah] berkata, \"Nabi shallallahu 'alaihi wasallam mengutus Abu Jahm bin Hudzaifah sebagai penengah dalam persengketaan. Namun ada seorang laki-laki laki-laki yang memutar balikkan fakta hingga Abu jahm memukulnya hingga cidera. Mereka pun mendatangi Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, kami minta qishsash! ' Rasulullah shallallahu 'alaihi wasallam kemudian berkata, \"Bagi kalian begini dan begini, \" namun mereka tidak rela. Beliau bersabda lagi: \"Bagi kalian begini dan begini, \" namun mereka tidak rela. Beliau bersabda lagi: \"Bagi kalian begini dan begini, ' mereka akhirnya rela. Setelah itu Nabi shallallahu 'alaihi wasallam bersabda: \"Aku akan berpidato di hadapan orang-orang petang nanti dan mengabarkan kepada mereka bahwa kalian telah rela.\" Mereka menjawab, \"Ya.\" Rasulullah shallallahu 'alaihi wasallam lalu berpidato: \"Orang-orang bani Laits telah mendatangiku menginginkan qishsas, lalu aku tawarkan kepada mereka begini dan begini hingga mereka rela, maka apakah kalian juga rela?\" Mereka menjawab, \"Tidak.\" Orang-orang Muhajirin ingin menghajar mereka, namun Rasulullah shallallahu 'alaihi wasallam melarang mereka melakukan hal itu, sehingga mereka pun menahan diri. Kemudian beliau memanggil mereka semua dan berpidato lagi: \"Apakah kalian ridha?\" Mereka menjawab, \"Ya.\" Beliau bersabda: \"Aku akan berpidato di hadapan orang-orang untuk mengabarkan kepada mereka bahwa kalian telah ridha.\" Para sahabat menjawab, \"Ya.\" maka Nabi shallallahu 'alaihi wasallam berpidato seraya berkata: \"Apakah kalian ridha?\" Mereka menjawab, \"Ya.\""
            },
            {
                "number": 3809,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ جَارِيَةً وُجِدَتْ قَدْ رُضَّ رَأْسُهَا بَيْنَ حَجَرَيْنِ فَقِيلَ لَهَا مَنْ فَعَلَ بِكِ هَذَا أَفُلَانٌ أَفُلَانٌ حَتَّى سُمِّيَ الْيَهُودِيُّ فَأَوْمَتْ بِرَأْسِهَا فَأُخِذَ الْيَهُودِيُّ فَاعْتَرَفَ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُرَضَّ رَأْسُهُ بِالْحِجَارَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] berkata, telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Anas] berkata, \"Seorang budak wanita ditemukan dalam keadaan kepalanya terhimpit antara dua batu, maka ditanyakan kepadanya, \"Siapa yang melakukan ini kepadamu? Apakah si fulan yang melakukannya?\" Hingga ketika nama seorang Yahudi disebut, dengan kepalanya ia menjawab, \"Ya.\" Yahudi itu kemudian dijemput dan ia mengakuinya. Maka Nabi shallallahu 'alaihi wasallam memerintakah agar kepala yahudi itu juga dipecahkan dengan dihipit antara dua batu.\""
            },
            {
                "number": 3810,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ عَنْ عَمْرٍو يَعْنِي ابْنَ الْحَارِثِ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ عُبَيْدَةَ بْنِ مُسَافِعٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَبَيْنَمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْسِمُ قَسْمًا أَقْبَلَ رَجُلٌ فَأَكَبَّ عَلَيْهِ فَطَعَنَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعُرْجُونٍ كَانَ مَعَهُ فَجُرِحَ بِوَجْهِهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعَالَ فَاسْتَقِدْ فَقَالَ بَلْ عَفَوْتُ يَا رَسُولَ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] berkata, telah menceritakan kepada kami [Ibnu Wahb] dari [Amru] -maksudnya Amru bin harits- dari [Bukair Ibnul Asyaj] dari [Ubaidah bin Musafi'] dari [Abu Sa'id Al Khudri] ia berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam sedang membagi-bagikan sesuatu, tiba-tiba datang seorang laki-laki ke arah beliau hingga beliau pun memukul dengan tongkat yang dibawanya sehingga timbul luka di wajahnya. Rasulullah shallallahu 'alaihi wasallam lalu berkata kepadanya: \"Kemarilah, silahkan kamu qishas.\" Laki-laki itu menjawab, \"Tidak ya Rasulullah, aku telah memaafkanmu.\""
            },
            {
                "number": 3811,
                "arab": "حَدَّثَنَا أَبُو صَالِحٍ أَخْبَرَنَا أَبُو إِسْحَقَ الْفَزَارِيُّ عَنْ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي فِرَاسٍ قَالَخَطَبَنَا عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ فَقَالَ إِنِّي لَمْ أَبْعَثْ عُمَّالِي لِيَضْرِبُوا أَبْشَارَكُمْ وَلَا لِيَأْخُذُوا أَمْوَالَكُمْ فَمَنْ فُعِلَ بِهِ ذَلِكَ فَلْيَرْفَعْهُ إِلَيَّ أُقِصُّهُ مِنْهُ قَالَ عَمْرُو بْنُ الْعَاصِ لَوْ أَنَّ رَجُلًا أَدَّبَ بَعْضَ رَعِيَّتِهِ أَتُقِصُّهُ مِنْهُ قَالَ إِي وَالَّذِي نَفْسِي بِيَدِهِ أُقِصُّهُ وَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقَصَّ مِنْ نَفْسِهِ",
                "id": "Telah menceritakan kepada kami [Abu Shalih] berkata, telah mengabarkan kepada kami [Abu Ishaq Al Fazari] dari [Al Jurairi] dari [Abu Nadhrah] dari [Abu firas] ia berkata, \" [Umar Ibnul Khaththab] radliallahu 'anhu berkhutbah di hadapan kami, ia mengatakan, \"Aku tidak mengutus para petugasku untuk memukul badan atau mengambil harta kalian, maka siapa di antara kalian yang mendapatkan perlakukan seperti itu hendaklah ia datang kepadaku, sehingga aku dapat mengqishasnya.\" Amru Ibnul Ash berkata, \"Jika ada seorang laki-laki yang mendidik (dengan memukul) sebagian orang yang ada dalam pengawasannya apakah ada qishasnya?\" Umar menjawab, \"Benar. Demi Dzat yang jiwaku ada dalam tangan-Nya, aku tetap akan mengqishasnya. Sebab aku pernah melihat Rasulullah shallallahu 'alaihi wasallam mengqishas karena (kesalahan) dirinya sendiri.\""
            },
            {
                "number": 3812,
                "arab": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ حَدَّثَنَا الْوَلِيدُ عَنْ الْأَوْزَاعِيِّ أَنَّهُ سَمِعَ حِصْنًا أَنَّهُ سَمِعَ أَبَا سَلَمَةَ يُخْبِرُ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ عَلَى الْمُقْتَتِلِينَ أَنْ يَنْحَجِزُوا الْأَوَّلَ فَالْأَوَّلَ وَإِنْ كَانَتْ امْرَأَةًقَالَ أَبُو دَاوُد بَلَغَنِي أَنَّ عَفْوَ النِّسَاءِ فِي الْقَتْلِ جَائِزٌ إِذَا كَانَتْ إِحْدَى الْأَوْلِيَاءِ وَبَلَغَنِي عَنْ أَبِي عُبَيْدٍ فِي قَوْلِهِ يَنْحَجِزُوا يَكُفُّوا عَنْ الْقَوَدِ",
                "id": "Telah menceritakan kepada kami [Dawud bin Rusyaid] berkata, telah menceritakan kepada kami [Al Walid] dari [Al Auza'i] Bahwasanya ia mendengar [Hishn] bahwa ia mendengar [Abu Salamah] mengabarkan dari ['Aisyah radliallahu 'anha] dari Rasulullah shallallahu 'alaihi wasallam, Bahwasanya beliau bersabda tentang orang-orang yang saling bunuh: \"Hendaklah mereka menahan dari meminta qishas dari orang yang lebih dekat, meskipun itu seorang wanita.\" Abu Dawud berkata, \"Telah sampai kabar kepadaku bahwa memaafkan wanita dalam perkara qishas itu di bolehkan jika ia termasuk salah satu dari sekian wali yang ada. Dan telah sampai kabar kepadaku tentang sabda Nabi 'hendaklah mereka meminta mundur dari qishash', artinya menahan diri dari meminta qihsas.\""
            },
            {
                "number": 3813,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنَا ابْنُ السَّرْحِ حَدَّثَنَا سُفْيَانُ وَهَذَا حَدِيثُهُ عَنْ عَمْرٍو عَنْ طَاوُوسٍ قَالَمَنْ قُتِلَ وَقَالَ ابْنُ عُبَيْدٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قُتِلَ فِي عِمِّيَّا فِي رَمْيٍ يَكُونُ بَيْنَهُمْ بِحِجَارَةٍ أَوْ بِالسِّيَاطِ أَوْ ضَرْبٍ بِعَصًا فَهُوَ خَطَأٌ وَعَقْلُهُ عَقْلُ الْخَطَإِ وَمَنْ قُتِلَ عَمْدًا فَهُوَ قَوَدٌ قَالَ ابْنُ عُبَيْدٍ قَوَدُ يَدٍ ثُمَّ اتَّفَقَا وَمَنْ حَالَ دُونَهُ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَغَضَبُهُ لَا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عَدْلٌوَحَدِيثُ سُفْيَانَ أَتَمُّ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي غَالِبٍ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ عَنْ سُلَيْمَانَ بْنِ كَثِيرٍ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ عَنْ طَاوُوسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مَعْنَى حَدِيثِ سُفْيَانَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid] berkata, telah menceritakan kepada kami [Hammad]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu As Sarh] berkata, telah menceritakan kepada kami [Sufyan] -dan ini adalah haditsnya- dari [Amru] dari [Thawus] ia berkata, \"Barangsiapa terbunuh dalam keadaan gelap (tidak jelas siapa pembunuh dan bagaimana caranya), yaitu ketika saling lempar di antara mereka, baik itu dengan batu, cambuk, atau tongkat, maka itu adalah pembunuhan karena kesalahan, dan diyatnya adalah diyat (tebusannya) pembunuhan karena salah. Maka barangsiapa membunuh dengan sengaja, diyatnya adalah qishas - [Ibnu Ubaid] menyebutkan dalam riwayat lain- \"qishas dengan tangan. Kemudian riwayat itu sepakat pada lafadz, \"Barangsiapa menghalangi terlaksananya qishas, maka ia akan mendapat laknat dan murka Allah, serta tidak akan diterima ibadahnya baik amalam sunnah atau wajib.\" Dan hadits Sufyan redaksinya lebih lengkap. Telah menceritakan kepada kami [Muhammad bin Abu Ghalib] berkata, telah menceritakan kepada kami [Sa'id bin Sulaiman] dari [Sulaiman bin Katsir] berkata, telah menceritakan kepada kami [Amru bin Dinar] dari [Thawus] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda, lalu ia menyebutkan makna hadits Sufyan.\""
            },
            {
                "number": 3814,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ ح و حَدَّثَنَا هَارُونُ بْنُ زَيْدِ بْنِ أَبِي الزَّرْقَاءِ حَدَّثَنَا أَبِي حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى أَنَّ مَنْ قُتِلَ خَطَأً فَدِيَتُهُ مِائَةٌ مِنْ الْإِبِلِ ثَلَاثُونَ بِنْتَ مَخَاضٍ وَثَلَاثُونَ بِنْتَ لَبُونٍ وَثَلَاثُونَ حِقَّةً وَعَشَرَةُ بَنِي لَبُونٍ ذَكَرٍ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] ia berkata; telah menceritakan kepada kami [Muhammad bin rasyid]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Harun bin Zaid bin Abu Az Zaqa] berkata, telah menceritakan kepada kami [Bapakku] berkata, telah menceritakan kepada kami [Muhammad bin rasyid] dari [Sulaiman bin Musa] dari [Amru bin Syu'aib] dari [bapaknya] dari [kakeknya] berkata, \"Rasulullah shallallahu 'alaihi wasallam memberi putusan bahwa orang yang membunuh karena salah maka diyatnya (tebusannya) adalah seratus ekor unta; tiga puluh anak unta makhadh, tiga puluh anak unta betina labun, tiga puluh hiqqah dan sepuluh anak unta jantan labun laki-laki.\""
            },
            {
                "number": 3815,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عُثْمَانَ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَكَانَتْ قِيمَةُ الدِّيَةِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَمَانَ مِائَةِ دِينَارٍ أَوْ ثَمَانِيَةَ آلَافِ دِرْهَمٍ وَدِيَةُ أَهْلِ الْكِتَابِ يَوْمَئِذٍ النِّصْفُ مِنْ دِيَةِ الْمُسْلِمِينَ قَالَ فَكَانَ ذَلِكَ كَذَلِكَ حَتَّى اسْتُخْلِفَ عُمَرُ رَحِمَهُ اللَّهُ فَقَامَ خَطِيبًا فَقَالَ أَلَا إِنَّ الْإِبِلَ قَدْ غَلَتْ قَالَ فَفَرَضَهَا عُمَرُ عَلَى أَهْلِ الذَّهَبِ أَلْفَ دِينَارٍ وَعَلَى أَهْلِ الْوَرِقِ اثْنَيْ عَشَرَ أَلْفًا وَعَلَى أَهْلِ الْبَقَرِ مِائَتَيْ بَقَرَةٍ وَعَلَى أَهْلِ الشَّاءِ أَلْفَيْ شَاةٍ وَعَلَى أَهْلِ الْحُلَلِ مِائَتَيْ حُلَّةٍ قَالَ وَتَرَكَ دِيَةَ أَهْلِ الذِّمَّةِ لَمْ يَرْفَعْهَا فِيمَا رَفَعَ مِنْ الدِّيَةِ",
                "id": "Telah menceritakan kepada kami [Yahya bin hakim] berkata, telah menceritakan kepada kami ['Abdurrahman bin Utsman] berkata, telah menceritakan kepada kami [Husain Al Muallim] dari [Amru bin Syu'aib] dari [Bapaknya] dari [kakeknya] ia berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam nilai tebusan diyat adalah delapan ratus dinar, atau delapan ribu dirham, sedangkan diyat bagi ahli kitab adalah setengah dari diyat kaum muslimin.\" Ia (perawi) berkata, \"Hal itu terus berlangsung hingga Umar diangkat menjadi khalifah, dan saat berpidato ia berkata, \"Ketahuilah, sesungguhnya harta unta telah naik.\" Perawi berkata lagi, \"Maka Umar mewajibkan bagi pemilik emas untuk membayar diyat sebanyak seribu dinar, bagi pemilik perak dua belas ribu dirham, bagi pemilik sapi sebanyak dua ratus ekor sapi, bagi pemilik kambing sebanyak dua ribu kambing, dan bagi pemilik pakaian sebanyak dua ratus pasang baju.\" Ia (perawi) berkata, \"Sementara diyat untuk ahli dzimmah tidak dinaikkan sebagaimana diyat yang lainnya.\""
            },
            {
                "number": 3816,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْحَقَ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى فِي الدِّيَةِ عَلَى أَهْلِ الْإِبِلِ مِائَةً مِنْ الْإِبِلِ وَعَلَى أَهْلِ الْبَقَرِ مِائَتَيْ بَقَرَةٍ وَعَلَى أَهْلِ الشَّاءِ أَلْفَيْ شَاةٍ وَعَلَى أَهْلِ الْحُلَلِ مِائَتَيْ حُلَّةٍ وَعَلَى أَهْلِ الْقَمْحِ شَيْئًا لَمْ يَحْفَظْهُ مُحَمَّدٌقَالَ أَبُو دَاوُد قَرَأْتُ عَلَى سَعِيدِ بْنِ يَعْقُوبَ الطَّالْقَانِيِّ قَالَ حَدَّثَنَا أَبُو تُمَيْلَةَ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَقَ قَالَ ذَكَرَ عَطَاءٌ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ فَرَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَ حَدِيثِ مُوسَى وَقَالَ وَعَلَى أَهْلِ الطَّعَامِ شَيْئًا لَا أَحْفَظُهُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Hammad] berkata, telah mengabarkan kepada kami [Muhammad bin Ishaq] dari [Atha bin Abu Rabah] berkata, \"Rasulullah shallallahu 'alaihi wasallam memberi putusan bahwa besaran diyat bagi pemilik unta adalah seratus ekor unta, pemilik sapi adalah dua ratus ekor sapi, pemilik kambing adalah dua ribu ekor kambing, pemilik pakaian adalah dua pasang baju, pemilik gandum adalah sesuatu…-muhammad tidak menghafalnya-.\" Abu Dawud berkata, \"Aku membaca di hadapan [Sa'id bin Ya'qub Ath Thalqani], ia berkata; telah menceritakan kepada kami [Abu Tumailah] berkata, telah menceritakan kepada kami [Muhammad bin Ishaq] ia berkata; Atha menyebutkan dari [Jabir bin Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam mewajibkan…lalu ia menyebutkan sebagaimana hadits Musa. Ia berkata, \"Bagi pemilik makanan adalah sesuatu…aku tidak menghafalnya.\""
            },
            {
                "number": 3817,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ حَدَّثَنَا الْحَجَّاجُ عَنْ زَيْدِ بْنِ جُبَيْرٍ عَنْ خِشْفِ بْنِ مَالِكٍ الطَّائِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي دِيَةِ الْخَطَإِ عِشْرُونَ حِقَّةً وَعِشْرُونَ جَذَعَةً وَعِشْرُونَ بِنْتَ مَخَاضٍ وَعِشْرُونَ بِنْتَ لَبُونٍ وَعِشْرُونَ بَنِي مَخَاضٍ ذُكُرٍ وَهُوَ قَوْلُ عَبْدِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abdul Wahid] berkata, telah menceritakan kepada kami [Al Hajjaj] dari [Zaid bin Jubair] dari [Khisyf bin Malik Ath Tha`i] dari [Abdullah bin Mas'ud] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda tentang pembunuhan yang tidak sengaja; dua puluh hiqqah, ditambah dua puluh jadz'ah, ditambah dua puluh anak unta betina makhadh, ditambah dua puluh anak unta betina labun, dan dua puluh anak unta jantan makhadh. ' Ini adalah perkataan Abdullah.\""
            },
            {
                "number": 3818,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَجُلًا مِنْ بَنِي عَدِيٍّ قُتِلَ فَجَعَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِيَتَهُ اثْنَيْ عَشَرَ أَلْفًاقَالَ أَبُو دَاوُد رَوَاهُ ابْنُ عُيَيْنَةَ عَنْ عَمْرِو عَنْ عِكْرِمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَذْكُرْ ابْنَ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] berkata, telah menceritakan kepada kami [Zaid Ibnul Hubab] dari [Muhammad bin Muslim] dari [Amru bin Dinar] dari [Ikrimah] dari [Ibnu Abbas] ia berkata, \"Seorang laki-laki dari bani Adi terbunuh, lalu Nabi shallallahu 'alaihi wasallam menetapkan bahwa diyatnya adalah dua belas ribu.\" Abu Dawud berkata, \" [Ibnu Uyainah] meriwayatkannya dari [Amru], dari [Ikrimah], dari Nabi shallallahu 'alaihi wasallam, namun ia tidak menyebutkan nama Ibnu Abbas.\""
            },
            {
                "number": 3819,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ وَمُسَدَّدٌ الْمَعْنَى قَالَا حَدَّثَنَا حَمَّادٌ عَنْ خَالِدٍ عَنْ الْقَاسِمِ بْنِ رَبِيعَةَ عَنْ عُقْبَةَ بْنِ أَوْسٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مُسَدَّدٌ خَطَبَ يَوْمَ الْفَتْحِ بِمَكَّةَ فَكَبَّرَ ثَلَاثًا ثُمَّ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ صَدَقَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ إِلَى هَاهُنَا حَفِظْتُهُ عَنْ مُسَدَّدٍ ثُمَّ اتَّفَقَا أَلَا إِنَّ كُلَّ مَأْثُرَةٍ كَانَتْ فِي الْجَاهِلِيَّةِ تُذْكَرُ وَتُدْعَى مِنْ دَمٍ أَوْ مَالٍ تَحْتَ قَدَمَيَّ إِلَّا مَا كَانَ مِنْ سِقَايَةِ الْحَاجِّ وَسِدَانَةِ الْبَيْتِ ثُمَّ قَالَ أَلَا إِنَّ دِيَةَ الْخَطَإِ شِبْهِ الْعَمْدِ مَا كَانَ بِالسَّوْطِ وَالْعَصَا مِائَةٌ مِنْ الْإِبِلِ مِنْهَا أَرْبَعُونَ فِي بُطُونِ أَوْلَادِهَاوَحَدِيثُ مُسَدَّدٍ أَتَمُّ حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ عَنْ خَالِدٍ بِهَذَا الْإِسْنَادِ نَحْوَ مَعْنَاهُ حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ الْقَاسِمِ بْنِ رَبِيعَةَ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ قَالَ خَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ أَوْ فَتْحِ مَكَّةَ عَلَى دَرَجَةِ الْبَيْتِ أَوْ الْكَعْبَةِ قَالَ أَبُو دَاوُد كَذَا رَوَاهُ ابْنُ عُيَيْنَةَ أَيْضًا عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ الْقَاسِمِ بْنِ رَبِيعَةَ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَوَاهُ أَيُّوبُ السَّخْتِيَانِيُّ عَنْ الْقَاسِمِ بْنِ رَبِيعَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو مِثْلَ حَدِيثِ خَالِدٍ وَرَوَاهُ حَمَّادُ بْنُ سَلَمَةَ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ يَعْقُوبَ السَّدُوسِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَوْلُ زَيْدٍ وَأَبِي مُوسَى مِثْلُ حَدِيثِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحَدِيثِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] dan [Musaddad] secara makna, keduanya berkata; telah menceritakan kepada kami [Hammad] dari [Khalid] dari [Al Qasim bin Rabi'ah] dari [Uqbah bin Aus] dari [Abdullah bin Amru] bahwa Rasulullah shallallahu 'alaihi wasallam -Musaddad menyebutkan- berkhutbah pada hari penaklukan kota Makkah. Beliau bertakbir sebanyak tiga kali kemudian mengatakan: \"Tidak ada Tuhan selain Allah Yang Maha Esa, Maha Benar janji-Nya, dan menolong hamba-Nya, serta satu-satunya yang mengalahkan golongan musuh yang bersekutu -sampai kalimat ini aku menghafalnya dari Musaddad, kemudian keduanya sepakat pada lafadz- Ketahuilah, semua peninggalan masa Jahilliyah baik itu yang diperoleh karena diyat pembunuhan atau pencurian, maka semua itu ada di bawah telapak kakiku (yakni bathil), kecuali apa-apa yang dihasilkan dari usaha memberi minum jamaah haji dan pengabdian kepada ka'bah.\" Kemudian beliau bersabda: \"Ketahuilah, diyat untuk pembunuhan yang tidak sengaja (yang menyerupai sengaja), seperti memukul dengan cambuk atau tongkat adalah seratus ekor unta, yang di antaranya adalah empat puluh ekor yang sedang hamil.\" Hadits Musaddad ini lebih sempurna. Telah menceritakan kepada kami [Musa bin Isma'il] berkata, telah menceritakan kepada kami [Wuhaib] dari [Khalid] dengan sanad ini, seperti makna hadits tersebut. Telah menceritakan kepada kami [Musaddad] berkata, telah menceritakan kepada kami [Abdul Warits] dari [Ali bin Zaid] dari [Al Qasim bin Rabi'ah] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam dengan makna yang sama. Ia (perawi) berkata, \"Pada hari penaklukan kota Makkah Rasulullah shallallahu 'alaihi wasallam berkhutbah di atas undakan rumah atau ka'bah.\" Abu Dawud berkata, \"Seperti ini pula [Ibnu Uyainah] meriwayatkan dari [Ali bin Zaid], dari [Al Qasim bin Rabi'ah], dari [Ibnu Umar] dari nabi shallallahu 'alaihi wasallam.\" [Ayyub As Sakhtiyani] juga meriwayatkan dari [Al Qasim bin Rabi'ah], dari [Abdullah bin Amru] sebagaimana hadits Khalid, dan [Hammad bin Salamah] juga meriwayatkannya dari [Ali bin Zaid] dari dari [Ya'qub As Sadusi], dari [Abdullah bin Amru], dari Nabi shallallahu 'alaihi wasallam.\" Dan perkataan Zaid dan Abu Musa seperti hadits Nabi shallallahu 'alaihi wasallam dan hadits Umar radliallahu 'anhu.\""
            },
            {
                "number": 3820,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ قَالَقَضَى عُمَرُ فِي شِبْهِ الْعَمْدِ ثَلَاثِينَ حِقَّةً وَثَلَاثِينَ جَذَعَةً وَأَرْبَعِينَ خَلِفَةً مَا بَيْنَ ثَنِيَّةٍ إِلَى بَازِلِ عَامِهَا",
                "id": "Telah menceritakan kepada kami [An Nufaili] berkata, telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Najih] dari [Mujahid] ia berkata, \" [Umar] memberi putusan bahwa pembunuhan semi sengaja diyatnya adalah tiga puluh hiqqah, ditambah tiga puluh jadz'ah dan empat puluh khalifah dari unta yang umurnya antara enam hingga sembilan tahun.\""
            },
            {
                "number": 3821,
                "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُأَنَّهُ قَالَ فِي شِبْهِ الْعَمْدِ أَثْلَاثٌ ثَلَاثٌ وَثَلَاثُونَ حِقَّةً وَثَلَاثٌ وَثَلَاثُونَ جَذَعَةً وَأَرْبَعٌ وَثَلَاثُونَ ثَنِيَّةً إِلَى بَازِلِ عَامِهَا وَكُلُّهَا خَلِفَةٌ",
                "id": "Telah menceritakan kepada kami [Hannad] berkata, telah menceritakan kepada kami [Abu Al Ahwash] dari [Abu Ishaq] dari [Ashim bin Dhamrah] dari [Ali radliallahu 'anhu] Bahwasanya ia pernah berkata; \"tentang diyat pembunuhan semi sengaja (pembunuhan tidak sengaja menyerupai sengaja) adalah sepertiga, sepertiga yaitu, tiga puluh tiga unta yang berumur tiga tahun dan masuk tahun keempat, dan tiga puluh tiga unta betina yang berumur lima tahun, serta tiga puluh empat unta hamil yang berumur enam tahun hingga umur sembilan tahun.\""
            },
            {
                "number": 3822,
                "arab": "وَبِهِ عَنْ أَبِي إِسْحَقَ عَنْ عَلْقَمَةَ وَالْأَسْوَدِ قَالَ عَبْدُ اللَّهِفِي شِبْهِ الْعَمْدِ خَمْسٌ وَعِشْرُونَ حِقَّةً وَخَمْسٌ وَعِشْرُونَ جَذَعَةً وَخَمْسٌ وَعِشْرُونَ بَنَاتِ لَبُونٍ وَخَمْسٌ وَعِشْرُونَ بَنَاتِ مَخَاضٍ",
                "id": "dengan sanad itu juga, dari [Abu Ishaq] dari [Alqamah] dan [Al Aswad], [Abdullah] berkata tentang diyat pembunuhan semi sengaja, \"Dua puluh lima hiqqah, di tambah dua puluh lima jadz'ah, ditambah dua puluh lima bintu labun dan dua puluh lima bintu makhadh.\""
            }
        ]
    }
}