{
    "status": true,
    "data": {
        "start": 3235,
        "end": 3381,
        "total": 147,
        "book": "abu-daud",
        "hadits": [
            {
                "number": 3235,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَسَنٍ الْمِصِّيصِيُّ حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ أَخْبَرَنِي رَجُلٌ عَنْ جَابِرِ بَنِ عَبْدِ اللَّهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ خَيْبَرَ عَنْ أَنْ نَأْكُلَ لُحُومَ الْحُمُرِ وَأَمَرَنَا أَنْ نَأْكُلَ لُحُومَ الْخَيْلِقَالَ عَمْرٌو فَأَخْبَرْتُ هَذَا الْخَبَرَ أَبَا الشَّعْثَاءِ فَقَالَ قَدْ كَانَ الْحَكَمُ الْغِفَارِيُّ فِينَا يَقُولُ هَذَا وَأَبَى ذَلِكَ الْبَحْرُ يُرِيدُ ابْنَ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Hasan Al Mishshi] telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] telah mengabarkan kepadaku ['Amru bin Dinar] telah mengabarkan kepadaku [seorang laki-laki] dari [Jabir bin Abdullah] ia berkata, \"Saat perang Khaibar Rasulullah shallallahu 'alaihi wasallam melarang dari memakan daging keledai, dan memerintahkan kami agar makan daging kuda.\" 'Amru berkata, \"Aku lalu memberitahukan hadits ini kepada Abu Asy Sya'tsa`, maka ia pun berkata, \"Dahulu Al Hakam Al Ghifari berada di antara kami, ia membolehkannya, namun hal itu ditolak oleh Ibnu Abbas.\""
            },
            {
                "number": 3236,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي زِيَادٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ إِسْرَائِيلَ عَنْ مَنْصُورٍ عَنْ عُبَيْدٍ أَبِي الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ عَنْ غَالِبِ بْنِ أَبْجَرَ قَالَأَصَابَتْنَا سَنَةٌ فَلَمْ يَكُنْ فِي مَالِي شَيْءٌ أُطْعِمُ أَهْلِي إِلَّا شَيْءٌ مِنْ حُمُرٍ وَقَدْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّمَ لُحُومَ الْحُمُرِ الْأَهْلِيَّةِ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَصَابَتْنَا السَّنَةُ وَلَمْ يَكُنْ فِي مَالِي مَا أُطْعِمُ أَهْلِي إِلَّا سِمَانُ الْحُمُرِ وَإِنَّكَ حَرَّمْتَ لُحُومَ الْحُمُرِ الْأَهْلِيَّةِ فَقَالَ أَطْعِمْ أَهْلَكَ مِنْ سَمِينِ حُمُرِكَ فَإِنَّمَا حَرَّمْتُهَا مِنْ أَجْلِ جَوَّالِ الْقَرْيَةِ يَعْنِي الْجَلَّالَةَقَالَ أَبُو دَاوُد عَبْدُ الرَّحْمَنِ هَذَا هُوَ ابْنُ مَعْقِلٍ قَالَ أَبُو دَاوُد رَوَى شُعْبَةُ هَذَا الْحَدِيثَ عَنْ عُبَيْدٍ أَبِي الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَعْقِلٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ بِشْرٍ عَنْ نَاسٍ مِنْ مُزَيْنَةَ أَنَّ سَيِّدَ مُزَيْنَةَ أَبْجَرَ أَوِ ابْنَ أَبْجَرَ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ حَدَّثَنَا أَبُو نُعَيْمٍ عَنْ مِسْعَرٍ عَنْ عُبَيْدٍ عَنْ ابْنِ مَعْقِلٍ عَنْ رَجُلَيْنِ مِنْ مُزَيْنَةَ أَحَدُهُمَا عَنْ الْآخَرِ أَحَدُهُمَا عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ عُوَيْمٍ وَالْآخَرُ غَالِبُ بْنُ الْأَبْجَرِ قَالَ مِسْعَرٌ أَرَى غَالِبًا الَّذِي أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Abu Ziyad] telah menceritakan kepada kami ['ubaidhullah] dari [Israil] dari [Manshur] dari ['Ubaid Abu Al Hasan] dari [Abdurrahman] dari [Ghalib bin Abhar] ia berkata, \"Kami tertimpa kekeringan, dan di antara hartaku tidak ada sesuatu yang dapat aku gunakan untuk memberi makan keluargaku, kecuali lemak keledai. Sementara Rasulullah shallallahu 'alaihi wasallam telah mengharamkan daging keledai jinak. Lalu aku datang kepada Nabi shallallahu 'alaihi wasallam dan aku katakan, \"Wahai Rasulullah, kami telah tertimpa musim kering, dan tidak ada di antara hartaku sesuatu yang dapat aku gunakan untuk memberi makan keluargaku kecuali lemak keledai, sementara anda telah mengharamkan daging keledai jinak. Kemudian beliau berkata: \"Berilah makan keluargamu dari lemak keledaimu, hanysanya aku haramkan itu karena hewan-hewan yang suka berkeliling kampung (hewan yang suka makan kotoran).\" Abu Daud berkata, \"Abdurrahman ini adalah Ibnu Ma'qil.\" Abu Daud berkata, \" [Syu'bah] meriwayatkan hadits ini dari ['Ubaid Abu Al Hasan] dari [Abdurrahman bin Ma'qil] dari [Abdurrahman bin Bisyr] dari [beberapa orang] yang berasal dari Muzainah, bahwa pemimpin Muzainah [Abjar atau anak Abjar] telah bertanya kepada Nabi shallallahu 'alaihi wasallam….\" Telah menceritakan kepada kami [Muhammad bin Sulaiman] telah menceritakan kepada kami [Abu Nu'aim] dari [Mis'ar] dari ['Ubaid] dari [Abu Ma'qil] dari [dua orang laki-laki] yang berasal dari Muzainah, salah seorang dari mereka (meriwayatkan) dari yang lainnya. Salah seorang mereka adalah [Abdullah bin 'Amru bin 'Uwaim] sedangkan yang lainnya adalah [Ghalib bin Al Abjar] Mis'ar berkata, \"Menurutku Ghalib lah yang datang kepada Nabi shallallahu 'alaihi wasallam, dengan hadits seperti ini.\""
            },
            {
                "number": 3237,
                "arab": "حَدَّثَنَا سَهْلُ بْنُ بَكَّارٍ حَدَّثَنَا وُهَيْبٌ عَنْ ابْنِ طَاوُسٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ خَيْبَرَ عَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ وَعَنْ الْجَلَّالَةِ عَنْ رُكُوبِهَا وَأَكْلِ لَحْمِهَا",
                "id": "Telah menceritakan kepada kami [Sahl bin Bakkar] telah menceritakan kepada kami [Wuhaib] dari [Ibnu Thawus] dari ['Amru bin Syu'aib] dari [Ayahnya] dari [Kakeknya] ia berkata, \"Saat perang Khaibar Rasulullah shallallahu 'alaihi wasallam melarang makan daging keledai jinak, menaiki hewan jallalah dan meminum susunya.\" "
            },
            {
                "number": 3238,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي يَعْفُورٍ قَالَ سَمِعْتُ ابْنَ أَبِي أَوْفَىوَسَأَلْتُهُ عَنْ الْجَرَادِ فَقَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سِتَّ أَوْ سَبْعَ غَزَوَاتٍ فَكُنَّا نَأْكُلُهُ مَعَهُ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar An Namari] telah menceritakan kepada kami [Syu'bah] dari [Abu Ya'fur] ia berkata; aku mendengar [Ibnu Abu Aufa] dan aku tanyakan kepadanya mengenai belalang, kemudian ia menjawab, \"Aku pernah berperang bersama Rasulullah shallallahu 'alaihi wasallam sebanyak enam atau tujuh kali peperangan, dan kami pernah memakannya bersama beliau.\""
            },
            {
                "number": 3239,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْفَرَجِ الْبَغْدَادِيُّ حَدَّثَنَا ابْنُ الزِّبْرِقَانِ حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ سَلْمَانَ قَالَسُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْجَرَادِ فَقَالَ أَكْثَرُ جُنُودِ اللَّهِ لَا آكُلُهُ وَلَا أُحَرِّمُهُقَالَ أَبُو دَاوُد رَوَاهُ الْمُعْتَمِرُ عَنْ أَبِيهِ عَنْ أَبِي عُثْمَانَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَذْكُرْ سَلْمَانَ حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ وَعَلِيُّ بْنُ عَبْدِ اللَّهِ قَالَا حَدَّثَنَا زَكَرِيَّا بْنُ يَحْيَى بْنِ عُمَارَةَ عَنْ أَبِي الْعَوَّامِ الْجَزَّارِ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ سَلْمَانَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ فَقَالَ مِثْلَهُ فَقَالَ أَكْثَرُ جُنْدِ اللَّهِ قَالَ عَلِيٌّ اسْمُهُ فَائِدٌ يَعْنِي أَبَا الْعَوَّامِ قَالَ أَبُو دَاوُد رَوَاهُ حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي الْعَوَّامِ عَنْ أَبِي عُثْمَانَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَذْكُرْ سَلْمَانَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Faraj Al Baghdadi] telah menceritakan kepada kami [Ibnu Az Zibriqan] telah menceritakan kepada kami [Sulaiman At Tamimi] dari [Abu Utsman An Nahdi] dari [Salman] ia berkata, \"Nabi shallallahu 'alaihi wasallam ditanya mengenai belalang, kemudian beliau bersabda: \"Mereka adalah tentara Allah terbanyak. Aku tidak memakannya dan tidak mengharamkannya.\" Abu Daud berkata, \"Hadits tersebut diriwayatkan oleh [Al Mu'tamir] dari [Ayahnya] dari [Abu Utsman] dari Nabi shallallahu 'alaihi wasallam, namun ia tidak menyebutkan Salman.\" Telah menceritakan kepada kami [Nashr bin Ali] serta [Ali bin Abdullah] mereka berkata; telah menceritakan kepada kami [Zakaria bin Yahya bin 'Umarah] dari [Abu Al 'Awwam Al Hazzar] dari [Abu Utsman An Nahdi] dari [Salman] bahwa Rasulullah shallallahu 'alaihi wasallam ditanya, kemudian beliau mengatakan seperti itu. Beliau bersabda: \"Mereka adalah pasukan Allah yang terbanyak.\" Ali berkata, \"Namanya adalah Faid Abu Al 'Awwam.\" Abu Daud berkata, \"Hadits tersebut diriwayatkan oleh [Hammad bin Salamah] dari [Abu Al 'Awwam] dari [Abu Utsman] dari Nabi shallallahu 'alaihi wasallam, namuan Ia tidak menyebutkan Salman.\""
            },
            {
                "number": 3240,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ حَدَّثَنَا إِسْمَعِيلَ بْنُ أُمَيَّةَ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَلْقَى الْبَحْرُ أَوْ جَزَرَ عَنْهُ فَكُلُوهُ وَمَا مَاتَ فِيهِ وَطَفَا فَلَا تَأْكُلُوهُقَالَ أَبُو دَاوُد رَوَى هَذَا الْحَدِيثَ سُفْيَانُ الثَّوْرِيُّ وَأَيُّوبُ وَحَمَّادٌ عَنْ أَبِي الزُّبَيْرِ أَوْقَفُوهُ عَلَى جَابِرٍ وَقَدْ أُسْنِدَ هَذَا الْحَدِيثُ أَيْضًا مِنْ وَجْهٍ ضَعِيفٍ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin 'Abdah] telah menceritakan kepada kami [Yahya bin Sulaim Ath Thaifi] telah menceritakan kepada kami [Isma'il bin Umayyah] dari [Abu Az Zubair] dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa yang didamparkan oleh laut atau yang tersingkap darinya maka makanlah, dan apa yang mati padanya dalam keadaan mengapung maka janganlah engkau makan.\" Abu Daud berkata, \"Hadits tersebut diriwayatkan oleh [Sufyan Ats Tsauri] dan [Ayyub] serta [Hammad] dari [Abu Az Zubair] mereka menyandarkannya kepada Jabir. Dan hadits ini juga di sandarkan dengan sanad yang lemah, dari jalur Ibnu Abu Dzi`b dari Abu Az Zubair dari Jabir dari Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3241,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَأَنَّ رَجُلًا نَزَلَ الْحَرَّةَ وَمَعَهُ أَهْلُهُ وَوَلَدُهُ فَقَالَ رَجُلٌ إِنَّ نَاقَةً لِي ضَلَّتْ فَإِنْ وَجَدْتَهَا فَأَمْسِكْهَا فَوَجَدَهَا فَلَمْ يَجِدْ صَاحِبَهَا فَمَرِضَتْ فَقَالَتْ امْرَأَتُهُ انْحَرْهَا فَأَبَى فَنَفَقَتْ فَقَالَتْ اسْلُخْهَا حَتَّى نُقَدِّدَ شَحْمَهَا وَلَحْمَهَا وَنَأْكُلَهُ فَقَالَ حَتَّى أَسْأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَاهُ فَسَأَلَهُ فَقَالَ هَلْ عِنْدَكَ غِنًى يُغْنِيكَ قَالَ لَا قَالَ فَكُلُوهَا قَالَ فَجَاءَ صَاحِبُهَا فَأَخْبَرَهُ الْخَبَرَ فَقَالَ هَلَّا كُنْتَ نَحَرْتَهَا قَالَ اسْتَحْيَيْتُ مِنْكَ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Simak bin Harb] dari [Jabir bin Samurah] bahwa seorang laki-laki singgah di Harrah bersama dengan anak dan isterinya. Kemudian seorang laki-laki berkata, \"Sesungguhnya untaku telah hilang, apabila engkau mendapatkannya maka tangkaplah!\" Laki-laki itu kemudian mendapatkannya dan tidak mendapati pemiliknya, lalu unta tersebut sakit. Lantas isterinya berkata, \"Sembelihlah unta tersebut!\" Namun suaminya menolak, hingga unta itu pun mati. Isterinya kemudian berkata, \"Kulitilah unta tersebut hingga kita jadikan lemak dan dagingnya menjadi dendeng hingga kita bisa memakannya.\" Suaminya berkata, \"Tidak, hingga aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam.\" Lalu ia datang kepada beliau dan beliau bertanya: \"Apakah engkau memiliki sesuatu yang memberikan kecukupan bagimu?\" Ia berkata, \"Tidak.\" Beliau lalu bersabda: \"Makanlah!\" Jabir bin Samurah berkata, \"Kemudian pemiliknya datang hingga ia pun mengabarkan perihal unta tersebut. Sang pemilik unta lalu berkata, \"Kenapa tidak kamu sembelih?\" laki-laki itu menjawab, \"Aku malu darimu.\""
            },
            {
                "number": 3242,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ حَدَّثَنَا عُقْبَةُ بْنُ وَهْبِ بْنِ عُقْبَةَ الْعَامِرِيُّ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ الْفُجَيْعِ الْعَامِرِيِّأَنَّهُ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا يَحِلُّ لَنَا مِنْ الْمَيْتَةِ قَالَ مَا طَعَامُكُمْ قُلْنَا نَغْتَبِقُ وَنَصْطَبِحُقَالَ أَبُو نُعَيْمٍ فَسَّرَهُ لِي عُقْبَةُ قَدَحٌ غُدْوَةً وَقَدَحٌ عَشِيَّةً قَالَ ذَاكَ وَأَبِي الْجُوعُ فَأَحَلَّ لَهُمْ الْمَيْتَةَ عَلَى هَذِهِ الْحَالِ قَالَ أَبُو دَاوُد الْغَبُوقُ مِنْ آخِرِ النَّهَارِ وَالصَّبُوحُ مِنْ أَوَّلِ النَّهَارِ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Al Fadll bin Dukain] telah menceritakan kepada kami ['Uqbah bin Wahb bin 'Uqbah Al 'Amiri] ia berkata; aku mendengar [Ayahku] menceritakan dari [Al Fujai' Al 'Amiri] bahwa ia telah datang kepada Rasulullah shallallahu 'alaihi wasallam dan bertanya, \"Bangkai apakah yang halal bagi kami?\" Beliau menjawab: \"Apakah makanan kalian?\" Kami menjawab, \"Kami minum susu pada satu gelas pada sore hari dan minum satu gelas pada pagi hari.\" Abu Nu'aim berkata, \"Uqbah mentafsirkannya untukku, 'Yaitu satu gelas pada pagi hari dan satu gelas pada sore hari'. Beliau bersabda: \"Ukuran itu tidak cukup dan masih ada rasa lapar.\" Kemudian beliau menghalalkan bangkai bagi mereka dalam keadaan ini.\" Abu Daud berkata, \"Ghabuq adalah dari akhir siang sedangkan shabuh dari awal siang.\""
            },
            {
                "number": 3243,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى عَنْ حُسَيْنِ بْنِ وَاقِدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدِدْتُ أَنَّ عِنْدِي خُبْزَةً بَيْضَاءَ مِنْ بُرَّةٍ سَمْرَاءَ مُلَبَّقَةً بِسَمْنٍ وَلَبَنٍ فَقَامَ رَجُلٌ مِنْ الْقَوْمِ فَاتَّخَذَهُ فَجَاءَ بِهِ فَقَالَ فِي أَيِّ شَيْءٍ كَانَ هَذَا قَالَ فِي عُكَّةِ ضَبٍّ قَالَ ارْفَعْهُقَالَ أَبُو دَاوُد هَذَا حَدِيثٌ مُنْكَرٌ قَالَ أَبُو دَاوُد وَأَيُّوبُ لَيْسَ هُوَ السَّخْتِيَانِيُّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Aziz bin Abu Rizmah] telah mengabarkan kepada kami [Al Fadll bin Musa] dari [Husain bin Waqid] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku berharap memiliki roti putih yang terbuat dari gandum yang dicampur dengan mentega dan susu.\" Kemudian seorang laki-laki dari salah seorang mereka berdiri dan lalu membuatnya uantuk kemudian membawanya kepada beliau. Beliau kemudian bertanya: \"Di tempat apakah mentega ini sebelumnya?\" Laki-laki itu menjawab, \"Berada dalam bejana yang terbuat dari kulit biawak.\" Beliau bersabda: \"Angkatlah makanan tersebut!\" Abu Daud berkata, \"Hadits ini adalah hadits mungkar.\" Abu Daud berkata, \"Ayyub bukanlah As Sakhtinyani.\""
            },
            {
                "number": 3244,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى الْبَلْخِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ مَنْصُورٍ عَنْ الشَّعْبِيِّ عَنْ ابْنِ عُمَرَ قَالَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِجُبْنَةٍ فِي تَبُوكَ فَدَعَا بِسِكِّينٍ فَسَمَّى وَقَطَعَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Musa Al Balkhi] telah menceritakan kepada kami [Ibrahim bin 'Uyainah] dari ['Amru bin Manshur] dari [Asy Sya'bi] dari [Ibnu Umar] ia berkata, \"Nabi shallallahu 'alaihi wasallam diberi keju di Tabuk, kemudian beliau meminta pisau lalu menyebutkan nama Allah dan memotongnya.\""
            },
            {
                "number": 3245,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ حَدَّثَنَا سُفْيَانُ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ جَابِرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نِعْمَ الْإِدَامُ الْخَلُّ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Mu'awiyah bin Hisyam] telah menceritakan kepada kami [Sufyan] dari [Muharib bin Ditsar] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sebaik-baik lauk adalah cuka.\""
            },
            {
                "number": 3246,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ وَمُسْلِمُ بْنُ إِبْرَاهِيمَ قَالَا حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ عَنْ طَلْحَةَ بْنِ نَافِعٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نِعْمَ الْإِدَامُ الْخَلُّ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] dan [Muslim bin Ibrahim] mereka berkata; telah menceritakan kepada kami [Al Mutsanna bin Sa'id] dari [Thalhah bin Nafi'] dari [Jabir bin Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sebaik-baik lauk adalah cuka.\""
            },
            {
                "number": 3247,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي يُونُسُ عَنْ ابْنِ شِهَابٍ حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ قَالَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَكَلَ ثُومًا أَوْ بَصَلًا فَلْيَعْتَزِلْنَا أَوْ لِيَعْتَزِلْ مَسْجِدَنَا وَلْيَقْعُدْ فِي بَيْتِهِ وَإِنَّهُ أُتِيَ بِبَدْرٍ فِيهِ خَضِرَاتٌ مِنْ الْبُقُولِ فَوَجَدَ لَهَا رِيحًا فَسَأَلَ فَأُخْبِرَ بِمَا فِيهَا مِنْ الْبُقُولِ فَقَالَ قَرِّبُوهَا إِلَى بَعْضِ أَصْحَابِهِ كَانَ مَعَهُ فَلَمَّا رَآهُ كَرِهَ أَكْلَهَا قَالَ كُلْ فَإِنِّي أُنَاجِي مَنْ لَا تُنَاجِيقَالَ أَحْمَدُ بْنُ صَالِحٍ بِبَدْرٍ فَسَّرَهُ ابْنُ وَهْبٍ طَبَقٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Yunus] dari [Ibnu Syihab] telah menceritakan kepadaku ['Atha bin Abu Rabah] bahwa [Jabir bin Abdullah] berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa makan bawang putih dan bawang merah, maka hendaknya ia menjauhi masjid kami dan duduk di rumahnya.\" Beliau pernah diberi nampan berisi sayur-sayuran hijau. Kemudian beliau mencium bau sesuatu, ketika beliau menanyakan perihal bau tersebut, maka beliau pun diberitahu tentang bau tersebut. Kemudian beliau bersabda: \"Dekatkan!\" yaitu kepada sebagian sahabat yang bersamanya! Kemudian ketika beliau melihat mereka enggan makan, beliau pun bersabda: \"Makanlah, sesungguhnya aku bermunajat kepada Dzat yang engkau tidak bermunajat kepada-Nya.\" Ahmad bin Shalih berkata, \"Badr ditafsirkan Ibnu Wahb dengan nampan.\""
            },
            {
                "number": 3248,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي عَمْرٌو أَنَّ بَكْرَ بْنَ سَوَادَةَ حَدَّثَهُ أَنَّ أَبَا النَّجِيبِ مَوْلَى عَبْدِ اللَّهِ بْنِ سَعْدٍ حَدَّثَهُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ حَدَّثَهُأَنَّهُ ذُكِرَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الثُّومُ وَالْبَصَلُ وَقِيلَ يَا رَسُولَ اللَّهِ وَأَشَدُّ ذَلِكَ كُلُّهُ الثُّومُ أَفَتُحَرِّمُهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُوهُ وَمَنْ أَكَلَهُ مِنْكُمْ فَلَا يَقْرَبْ هَذَا الْمَسْجِدَ حَتَّى يَذْهَبَ رِيحُهُ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku ['Amru] bahwa [Bakr bin Sawadah] telah menceritakan kepadanya, bahwa [Abu An Najib] mantan budak Abdullah bin Sa'd menceritakan kepadanya, bahwa [Abu Sa'id Al Khudri] menceritakan kepadanya, bahwa disebutkan bawang putih dan bawang merah di hadapan Rasulullah shallallahu 'alaihi wasallam. Dikatakan, \"Wahai Rasulullah, di antara yang ada, yang paling keras baunya adalah bawang putih. Apakah anda mengharamkannya?\" Nabi shallallahu 'alaihi wasallam bersabda: \"Makanlah, siapa di antara kalian yang telah memakannya, maka janganlah ia mendekati masjid kami hingga baunya hilang.\""
            },
            {
                "number": 3249,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الشَّيْبَانِيِّ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ زِرِّ بْنِ حُبَيْشٍ عَنْ حُذَيْفَةَأَظُنُّهُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَفَلَ تُجَاهَ الْقِبْلَةِ جَاءَ يَوْمَ الْقِيَامَةِ تَفْلُهُ بَيْنَ عَيْنَيْهِ وَمَنْ أَكَلَ مِنْ هَذِهِ الْبَقْلَةِ الْخَبِيثَةِ فَلَا يَقْرَبَنَّ مَسْجِدَنَا ثَلَاثًا",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Asy Syaibani] dari [Adi bin Tsabit] dari [Zirr bin Khubaisy] dari [Hudzaifah] aku mengira dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa meludah ke arah kiblat, maka pada hari kiamat ia akan datang sementara ludahnya ada di antara kedua matanya. Dan barangsiapa makan sebagian dari sayur yang berbau busuk ini, maka janganlah ia mendekati masjid kami!\" Beliau mengatakannya sebanyak tiga kali.\""
            },
            {
                "number": 3250,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ فَلَا يَقْرَبَنَّ الْمَسَاجِدَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Yahya] dari ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa makan sebagian dari pohon ini, maka janganlah ia mendekati masjid-masjid!\""
            },
            {
                "number": 3251,
                "arab": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ حَدَّثَنَا أبُو هِلَالٍ حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ عَنْ أَبِي بُرْدَةَ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَأَكَلْتُ ثُومًا فَأَتَيْتُ مُصَلَّى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ سُبِقْتُ بِرَكْعَةٍ فَلَمَّا دَخَلْتُ الْمَسْجِدَ وَجَدَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رِيحَ الثُّومِ فَلَمَّا قَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاتَهُ قَالَ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ فَلَا يَقْرَبَنَّا حَتَّى يَذْهَبَ رِيحُهَا أَوْ رِيحُهُ فَلَمَّا قُضِيَتْ الصَّلَاةُ جِئْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ وَاللَّهِ لَتُعْطِيَنِّي يَدَكَ قَالَ فَأَدْخَلْتُ يَدَهُ فِي كُمِّ قَمِيصِي إِلَى صَدْرِي فَإِذَا أَنَا مَعْصُوبُ الصَّدْرِ قَالَ إِنَّ لَكَ عُذْرًا",
                "id": "Telah menceritakan kepada kami [Syaiban bin Farrukh] telah menceritakan kepada kami [Abu Hilal] telah menceritakan kepada kami [Humaid bin Hilal] dari [Abu Burdah] dari [Al Mughirah bin Syu'bah] ia berkata, \"Aku pernah makan bawang putih kemudian mendatangi mushalla Nabi shallallahu 'alaihi wasallam, dan aku telah ketinggalan satu rakaat. Saat aku masuk masjid Nabi shallallahu 'alaihi wasallam mencium bau bawang putih, selesai sholat Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Barangsiapa makan sebagian dari pohon ini maka janganlah ia mendekati kami, hingga hilang baunya.\" Selesai sholat aku datang menemui Rasulullah shallallahu 'alaihi wasallam dan aku katakan, \"Wahai Rasulullah, demi Allah! Berikanlah tanganmu kepadaku.\" Aku lalu memasukkan tangan beliau ke dalam lubang pergelangan bajuku hingga menyentuh dadaku. Sementara aku telah mengikat perut bagian dada dengan kain (karena lapar), maka beliau pun bersabda: \"Sesungguhnya engkau memiliki udzur.\""
            },
            {
                "number": 3252,
                "arab": "حَدَّثَنَا عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو حَدَّثَنَا خَالِدُ بْنُ مَيْسَرَةَ يَعْنِي الْعَطَّارَ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ هَاتَيْنِ الشَّجَرَتَيْنِ وَقَالَ مَنْ أَكَلَهُمَا فَلَا يَقْرَبَنَّ مَسْجِدَنَا وَقَالَ إِنْ كُنْتُمْ لَا بُدَّ آكِلِيهِمَا فَأَمِيتُوهُمَا طَبْخًاقَالَ يَعْنِي الْبَصَلَ وَالثُّومَ",
                "id": "Telah menceritakan kepada kami [Abbas bin Abdul 'Azhim] telah menceritakan kepada kami [Abu 'Amir Abdul Malik bin 'Amru] telah menceritakan kepada kami [Khalid bin Maisarah Al 'Aththar] dari [Mu'awiyah bin Qurrah] dari [Ayahnya] bahwa Nabi shallallahu 'alaihi wasallam telah melarang dari dua pohon ini, beliau bersabda: \"Barangsiapa memakan keduanya maka janganlah ia mendekati masjid kami!\" Dan beliau bersabda: \"Apabila kalian harus memakannya maka hilangkan bau keduanya dengan dimasak!\" Qurrah berkata, \"Yaitu bawang merah dan bawang putih.\""
            },
            {
                "number": 3253,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا الْجَرَّاحُ أَبُو وَكِيعٍ عَنْ أَبِي إِسْحَقَ عَنْ شَرِيكٍ عَنْ عَلِيٍّ عَلَيْهِ السَّلَام قَالَنُهِيَ عَنْ أَكْلِ الثُّومِ إِلَّا مَطْبُوخًاقَالَ أَبُو دَاوُد شَرِيكُ بْنُ حَنْبَلٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Al Jarrah Abu Waki'] dari [Abu Ishaq] dari [Syarik] dari [Ali] radliallahu 'anhu, ia berkata, \"Telah dilarang makan bawang putih kecuali dalam keadaan dimasak.\" Abu Daud berkata, \"Syarik bin Hanbal.\""
            },
            {
                "number": 3254,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا ح و حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ حَدَّثَنَا بَقِيَّةُ عَنْ بَحِيرٍ عَنْ خَالِدٍ عَنْ أَبِي زِيَادٍ خِيَارِ بْنِ سَلَمَةَأَنَّهُ سَأَلَ عَائِشَةَ عَنْ الْبَصَلِ فَقَالَتْ إِنَّ آخِرَ طَعَامٍ أَكَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامٌ فِيهِ بَصَلٌ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Haiwah bin Syuraih] telah menceritakan kepada kami [Baqiyyah] dari [Bahir] dari [Khalid] dari [Abu Ziyad Khiyar bin Salamah] bahwa ia pernah bertanya kepada [Aisyah] mengenai bawang merah, lalu ia menjawab, \"Sesungguhnya makanan terakhir yang dimakan Rasulullah shallallahu 'alaihi wasallam adalah makanan yang padanya terdapat bawang merah.\""
            },
            {
                "number": 3255,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا عُمَرُ بْنُ حَفْصٍ حَدَّثَنَا أَبِي عَنْ مُحَمَّدِ بْنِ أَبِي يَحْيَى عَنْ يَزِيدَ الْأَعْوَرِ عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ بْنِ سَلَامٍ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ كِسْرَةً مِنْ خُبْزِ شَعِيرٍ فَوَضَعَ عَلَيْهَا تَمْرَةً وَقَالَ هَذِهِ إِدَامُ هَذِهِ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Umar bin Hafsh] telah menceritakan kepada kami [Ayahku] dari [Muhammad bin Abu Yahya] dari [Yazid Al A'war] dari [Yusuf bin Abdullah bin Salam] ia berkata, \"Aku melihat Nabi shallallahu 'alaihi wasallam mengambil pecahan roti yang terbuat dari gandum lalu meletakkan kurma di atasnya, dan beliau bersabda: 'Kurma ini adalah lauk untuk roti ini.\""
            },
            {
                "number": 3256,
                "arab": "حَدَّثَنَا الْوَلِيدُ بْنُ عُتْبَةَ حَدَّثَنَا مَرْوَانُ بْنُ مُحَمَّدٍ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ حَدَّثَنِي هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْتٌ لَا تَمْرَ فِيهِ جِيَاعٌ أَهْلُهُ",
                "id": "Telah menceritakan kepada kami [Al Walid bin 'Utbah] telah menceritakan kepada kami [Marwan bin Muhammad] telah menceritakan kepada kami [Sulaiman bin Bilal] telah menceritakan kepadaku [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anha, ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Rumah yang tidak ada kurma padanya maka penghuninya adalah orang-orang yang lapar.\""
            },
            {
                "number": 3257,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ حَدَّثَنَا سَلْمُ بْنُ قُتَيْبَةَ أَبُو قُتَيْبَةَ عَنْ هَمَّامٍ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِتَمْرٍ عَتِيقٍ فَجَعَلَ يُفَتِّشُهُ يُخْرِجُ السُّوسَ مِنْهُحَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا هَمَّامٌ عَنْ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُؤْتَى بِالتَّمْرِ فِيهِ دُودٌ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Amru bin Jabalah] telah menceritakan kepada kami [Salm bin Qutaibah Abu Qutaibah] dari [Hammam] dari [Ishaq bin Abdullah bin Abu Thalhah] dari [Anas bin Malik] ia berkata, \"Nabi shallallahu 'alaihi wasallam diberi kurma 'Atiq, lalu beliau memeriksanya untuk mengeluarkan kutu darinya.\" Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Hammam] dari [Ishaq bin Abdullah bin Abu Thalhah] bahwa Nabi shallallahu 'alaihi wasallam pernah diberi kurma yang padanya terdapat ulat... lalu Abdullah bin Abu Thalhah menyebutkan makna hadits tersebut.\""
            },
            {
                "number": 3258,
                "arab": "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا ابْنُ فُضَيْلٍ عَنْ أَبِي إِسْحَقَ عَنْ جَبَلَةَ بْنِ سُحَيْمٍ عَنْ ابْنِ عُمَرَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْإِقْرَانِ إِلَّا أَنْ تَسْتَأْذِنَ أَصْحَابَكَ",
                "id": "Telah menceritakan kepada kami [Washil bin Abdul A'la] telah menceritakan kepada kami [Ibnu Fudlail] dari [Abu Ishaq] dari [Jabalah bin Suhaim] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah melarang dari iqran (makan kurma dua, dua) kecuali engkau meminta izin para sahabatmu (yang makan bersama).\""
            },
            {
                "number": 3259,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْكُلُ الْقِثَّاءَ بِالرُّطَبِ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar An Namari] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Ayahnya] dari [Abdullah bin Ja'far] bahwa Nabi shallallahu 'alaihi wasallam pernah makan mentimun dengan ruthab (kurma segar).\""
            },
            {
                "number": 3260,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ نُصَيْرٍ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ الْبِطِّيخَ بِالرُّطَبِ فَيَقُولُ نَكْسِرُ حَرَّ هَذَا بِبَرْدِ هَذَا وَبَرْدَ هَذَا بِحَرِّ هَذَا",
                "id": "Telah menceritakan kepada kami [Sa'id bin Nushair] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anha, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah makan labu dengan kurma segar. Kemudian beliau bersabda: \"Kita menghilangkan panas ini dengan dinginnya ini, dan dingin ini dengan panas ini.\""
            },
            {
                "number": 3261,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْوَزِيرِ حَدَّثَنَا الْوَلِيدُ بْنُ مَزْيَدَ قَالَ سَمِعْتُ ابْنَ جَابِرٍ قَالَ حَدَّثَنِي سُلَيْمُ بْنُ عَامِرٍ عَنْ ابْنَيْ بُسْرٍ السُّلَمِيَّيْنِ قَالَادَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَدَّمْنَا زُبْدًا وَتَمْرًا وَكَانَ يُحِبُّ الزُّبْدَ وَالتَّمْرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Wazir] telah menceritakan kepada kami [Al Walid bin Mazyad] ia berkata; aku mendengar [Ibnu Jabir] berkata; telah menceritakan kepadaku [Sulaim bin 'Amir] dari [dua anak] [Busr As Sulami] mereka berkata, \"Rasulullah shallallahu 'alaihi wasallam menemui kami, lalu kami menghidangkan keju dan kurma, dan beliau menyukai keduanya.\""
            },
            {
                "number": 3262,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ الْأَعْلَى وَإِسْمَعِيلُ عَنْ بُرْدِ بْنِ سِنَانٍ عَنْ عَطَاءٍ عَنْ جَابِرٍ قَالَكُنَّا نَغْزُو مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنُصِيبُ مِنْ آنِيَةِ الْمُشْرِكِينَ وَأَسْقِيَتِهِمْ فَنَسْتَمْتِعُ بِهَا فَلَا يَعِيبُ ذَلِكَ عَلَيْهِمْ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Abdul A'la] dan [Isma'il] dari [Burd bin Sinan] dari ['Atha] dari [Jabir] ia berkata, \"Dahulu kami pernah berperang bersama Rasulullah shallallahu 'alaihi wasallam, lalu kami mendapatkan bejana orang-orang musyrik dan tempat minum mereka. Lalu kami menggunakannya dan beliau tidak mencela mereka.\""
            },
            {
                "number": 3263,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَاصِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْعَلَاءِ بْنِ زَبْرٍ عَنْ أَبِي عُبَيْدِ اللَّهِ مُسْلِمِ بْنِ مِشْكَمٍ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّأَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّا نُجَاوِرُ أَهْلَ الْكِتَابِ وَهُمْ يَطْبُخُونَ فِي قُدُورِهِمْ الْخِنْزِيرَ وَيَشْرَبُونَ فِي آنِيَتِهِمْ الْخَمْرَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ وَجَدْتُمْ غَيْرَهَا فَكُلُوا فِيهَا وَاشْرَبُوا وَإِنْ لَمْ تَجِدُوا غَيْرَهَا فَارْحَضُوهَا بِالْمَاءِ وَكُلُوا وَاشْرَبُوا",
                "id": "Telah menceritakan kepada kami [Nashr bin 'Ashim] telah menceritakan kepada kami [Muhammad bin Syu'aib] telah mengabarkan kepada kami [Abdullah bin Al 'Ala bin Zabr] dari [Abu 'ubaidhullah Muslim bin Misykam] dari [Abu Tsa'labah Al Khusyani] bahwa ia pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam, ia berkata, \"Sesungguhnya kami bertetangga dengan orang ahli kitab sementara mereka merebus babi di dalam kuali mereka dan minum khamr dalam bejana mereka?\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila kalian mendapatkan selainnya maka makan dan minumlah padanya, dan apabila kalian tidak mendapatkan selainnya maka cucilah menggunakan air dan makan serta minumlah!\""
            },
            {
                "number": 3264,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَبَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمَّرَ عَلَيْنَا أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ نَتَلَقَّى عِيرًا لِقُرَيْشٍ وَزَوَّدَنَا جِرَابًا مِنْ تَمْرٍ لَمْ نَجِدْ لَهُ غَيْرَهُ فَكَانَ أَبُو عُبَيْدَةَ يُعْطِينَا تَمْرَةً تَمْرَةً كُنَّا نَمُصُّهَا كَمَا يَمُصُّ الصَّبِيُّ ثُمَّ نَشْرَبُ عَلَيْهَا مِنْ الْمَاءِ فَتَكْفِينَا يَوْمَنَا إِلَى اللَّيْلِ وَكُنَّا نَضْرِبُ بِعِصِيِّنَا الْخَبَطَ ثُمَّ نَبُلُّهُ بِالْمَاءِ فَنَأْكُلُهُ وَانْطَلَقْنَا عَلَى سَاحِلِ الْبَحْرِ فَرُفِعَ لَنَا كَهَيْئَةِ الْكَثِيبِ الضَّخْمِ فَأَتَيْنَاهُ فَإِذَا هُوَ دَابَّةٌ تُدْعَى الْعَنْبَرَ فَقَالَ أَبُو عُبَيْدَةَ مَيْتَةٌ وَلَا تَحِلُّ لَنَا ثُمَّ قَالَ لَا بَلْ نَحْنُ رُسُلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي سَبِيلِ اللَّهِ وَقَدْ اضْطُرِرْتُمْ إِلَيْهِ فَكُلُوا فَأَقَمْنَا عَلَيْهِ شَهْرًا وَنَحْنُ ثَلَاثُ مِائَةٍ حَتَّى سَمِنَّا فَلَمَّا قَدِمْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرْنَا ذَلِكَ لَهُ فَقَالَ هُوَ رِزْقٌ أَخْرَجَهُ اللَّهُ لَكُمْ فَهَلْ مَعَكُمْ مِنْ لَحْمِهِ شَيْءٌ فَتُطْعِمُونَا مِنْهُ فَأَرْسَلْنَا مِنْهُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكَلَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutus kami dan menjadikan Abu 'Ubaidah bin Al Jarrah sebagai pemimpin untuk menghadang rombongan pedagang Quraisy, beliau membekali kami dengan sekantung kurma yang kami tidak mengetahui beliau mempuyai kurma selain itu. Abu Ubaidah lalu membagikan kepada kami setiap satu butir untuk satu orang, dan kami hanya mengulum kurma tersebut sebagaimana seorang bayi mengulum. Kemudian kami minum air yang ada padanya, maka kurma tersebut cukup bagi kami pada hari itu hingga malam hari. Dan kami menggugurkan daun menggunakan tongkat kami, lalu kami membasahinya menggunakan air dan memakannya. Kami pergi ke tepi laut, kemudian kami mendapati sesuatu yang bentuknya seperti gundukan pasir yang besar. Kemudian kami mendatanginya, ternyata benda tersebut adalah hewan yang disebut paus. Abu 'Ubaidah berkata, \"Itu adalah bangkai, tidak halal bagi kita!\" Kemudian ia berkata, \"Tidak, melainkan kita adalah para utusan Rasulullah shallallahu 'alaihi wasallam, dan berada di jalan Allah. Kalian dalam keadaan terdesak untuk memakannya, maka makanlah!\" Kami kemudian memakannya selama satu bulan sedangkan jumlah kami adalah tiga ratus orang, hingga kami menjadi gemuk. Kemudian tatkala kami sampai kepada Rasulullah shallallahu 'alaihi wasallam, maka hal tersebut kami ceritakan kepada beliau. Beliau lalu bersabda: \"Itu adalah rizki yang telah Allah keluarkan untuk kalian. Apakah kalian membawa sebagian dagingnya, hingga kalian berikan kepada kami?\" Kemudian kami mengirimkan sebagiannya kepada Rasulullah shallallahu 'alaihi wasallam, dan beliau pun menerimanya.\""
            },
            {
                "number": 3265,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا سُفْيَانُ حَدَّثَنَا الزُّهْرِيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَأَنَّ فَأْرَةً وَقَعَتْ فِي سَمْنٍ فَأُخْبِرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلْقُوا مَا حَوْلَهَا وَكُلُوا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Az Zuhri] dari ['Ubaidillah bin Abdullah] dari [Ibnu Abbas] dari [Maimunah] bahwa ada seekor tikus yang jatuh ke dalam mentega, lalu aku beritahukan kepada Nabi shallallahu 'alaihi wasallam. Kemudian beliau bersabda: \"Buanglah sekitarnya dan makanlah!\""
            },
            {
                "number": 3266,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ وَالْحَسَنُ بْنُ عَلِيٍّ وَاللَّفْظُ لِلْحَسَنِ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وَقَعَتْ الْفَأْرَةُ فِي السَّمْنِ فَإِنْ كَانَ جَامِدًا فَأَلْقُوهَا وَمَا حَوْلَهَا وَإِنْ كَانَ مَائِعًا فَلَا تَقْرَبُوهُقَالَ الْحَسَنُ قَالَ عَبْدُ الرَّزَّاقِ وَرُبَّمَا حَدَّثَ بِهِ مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ بُوذَوَيْهِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ ابْنِ عَبَّاسٍ عَنْ مَيْمُونَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ الزُّهْرِيِّ عَنْ ابْنِ الْمُسَيِّبِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] dan [Al Hasan bin Ali] lafazh hadits ini adalah lafazh Al Hasan, mereka berkata; telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Sa'id bin Al Musayyab] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika ada tikus jatuh ke dalam mentega, jika mentega tersebut beku maka buanglah tikus tersebut dan yang ada di sekitarnya, namun jika mentega tersebut cair maka jangan engkau dekati (ambil).\" [Al Hasan] berkata, \" [Abdurrazzaq] berkata, \"Terkadang [Ma'mar] meriwayatkan hadits tersebut dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] dari [Maimunah] dari Nabi shallallahu 'alaihi wasallam.\" Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Abdurrahman bin Budzawaih] dari [Ma'mar] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Ibnu Abbas] dari [Maimunah] dari Nabi shallallahu 'alaihi wasallam dengan hadits seperti hadits Az Zuhri, dari Ibnu Al Musayyab.\""
            },
            {
                "number": 3267,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا بِشْرٌ يَعْنِي ابْنَ الْمُفَضَّلِ عَنْ ابْنِ عَجْلَانَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا وَقَعَ الذُّبَابُ فِي إِنَاءِ أَحَدِكُمْ فَامْقُلُوهُ فَإِنَّ فِي أَحَدِ جَنَاحَيْهِ دَاءً وَفِي الْآخَرِ شِفَاءً وَإِنَّهُ يَتَّقِي بِجَنَاحِهِ الَّذِي فِيهِ الدَّاءُ فَلْيَغْمِسْهُ كُلُّهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Bisyr bin Al Mufadldlal] dari [Ibnu 'Ajlan] dari [Sa'id Al Maqburi] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika ada lalat jatuh ke dalam bejana salah seorang dari kalian maka celupkanlah lalat tersebut, karena sesungguhnya di dalam salah satu sayapnya terdapat penyakit dan pada sayap yang lain terdapat obat. Sesungguhnya lalat tersebut melindungi diri dengan sayap yang padanya terdapat penyakit, maka celupkanlah semuannya!\""
            },
            {
                "number": 3268,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا أَكَلَ طَعَامًا لَعِقَ أَصَابِعَهُ الثَّلَاثَ وَقَالَ إِذَا سَقَطَتْ لُقْمَةُ أَحَدِكُمْ فَلْيُمِطْ عَنْهَا الْأَذَى وَلْيَأْكُلْهَا وَلَا يَدَعْهَا لِلشَّيْطَانِ وَأَمَرَنَا أَنْ نَسْلُتَ الصَّحْفَةَ وَقَالَ إِنَّ أَحَدَكُمْ لَا يَدْرِي فِي أَيِّ طَعَامِهِ يُبَارَكُ لَهُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Tsabit] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam jika makan makanan, beliau menjilat jari-jarinya sebanyak tiga kali, beliau bersabda: \"Jika suapan salah seorang dari kalian jatuh, maka hendaknya ia membersihkannya dari kotoran dan memakannya, dan janganlah ia membiarkannya untuk setan!\" Dan beliau memerintahkan kami agar mengusap piring. Beliau bersabda: \"Sesungguhnya tidak seorangpun di antara kalian mengetahui dibagian makanan makanakah ia diberi berkah.\""
            },
            {
                "number": 3269,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ عَنْ مُوسَى بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَنَعَ لِأَحَدِكُمْ خَادِمُهُ طَعَامًا ثُمَّ جَاءَهُ بِهِ وَقَدْ وَلِيَ حَرَّهُ وَدُخَانَهُ فَلْيُقْعِدْهُ مَعَهُ لِيَأْكُلَ فَإِنْ كَانَ الطَّعَامُ مَشْفُوهًا فَلْيَضَعْ فِي يَدِهِ مِنْهُ أَكْلَةً أَوْ أَكْلَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] telah menceritakan kepada kami [Daud bin Qais] dari [Musa bin Yasar] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila pembantu salah seorang di antara kalian membuatkan makanan untuknya kemudian ia datang membawa makanan tersebut kepadanya, sementara pembantu tersebut telah merasakan panas dan terkena asapnya maka hendaknya ia memintanya agar duduk untuk makan bersamanya. Apabila makakan tersebut sedikit maka hendaknya ia meletakkan di tangannya satu atau dua suap.\""
            },
            {
                "number": 3270,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَكَلَ أَحَدُكُمْ فَلَا يَمْسَحَنَّ يَدَهُ بِالْمِنْدِيلِ حَتَّى يَلْعَقَهَا أَوْ يُلْعِقَهَا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij] dari ['Atha] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika salah seorangii kalian makan, maka janganlah ia usap tangannya menggunakan sapu tangan hingga ia menjilatnya atau menjilatkannya!\""
            },
            {
                "number": 3271,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعْدٍ عَنْ ابْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْكُلُ بِثَلَاثِ أَصَابِعَ وَلَا يَمْسَحُ يَدَهُ حَتَّى يَلْعَقَهَا",
                "id": "Telah menceritakan kepada kami [An Nufaili] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Hisyam bin 'Urwah] dari [Abdurrahman bin Sa'dan] dari [Ibnu Ka'b bin Malik] dari [Ayahnya] bahwa Nabi shallallahu 'alaihi wasallam makan menggunakan tiga jari, dan tidak mengusap tangannya hingga beliau menjilatnya.\""
            },
            {
                "number": 3272,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ ثَوْرٍ عَنْ خَالِدِ بَنِ مَعْدَانَ عَنْ أَبِي أُمَامَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رُفِعَتْ الْمَائِدَةُ قَالَ الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ غَيْرَ مَكْفِيٍّ وَلَا مُوَدَّعٍ وَلَا مُسْتَغْنًى عَنْهُ رَبُّنَا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Tsaur] dari [Khalid bin Ma'dan] dari [Abu Umamah] ia berkata, \"Jika selesai makan Rasulullah shallallahu 'alaihi wasallam membaca do'a: 'ALHAMDULILLAAHI HAMDAN KATSIIRAN THAYYIBAN MUBAARAKAN FIIHI GHAIRA MAKFIYYIN WA LAA MUWADDA'IN WA LAA MUSTAGHNAN 'ANHU RABBUNAA (Segala puji bagi Allah, dengan pujian yang banyak, baik dan mendapatkan berkah padanya tidak cukup hanya itu, dan tidak terputus, serta senantiasa butuh kepadanya, wahai Tuhan kami) '.\""
            },
            {
                "number": 3273,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي هَاشِمٍ الْوَاسِطِيِّ عَنْ إِسْمَعِيلَ بْنِ رَبَاحٍ عَنْ أَبِيهِ أَوْ غَيْرِهِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا فَرَغَ مِنْ طَعَامِهِ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abu Hasyim Al Wasithi] dari [Isma'il bin Rabah] dari [Ayahnya atau selainnya] dari [Abu Sa'id Al Khudri] bahwa Nabi shallallahu 'alaihi wasallam jika selesai makan beliau mengucapkan: 'Al HAMDULILLAAHILLADZII ATH'AMANAA WA SAQAANAA WA JA'ALANAA MUSLIMIIN (Segala puji bagi Allah Yang telah memberi makan serta minum kami dan menjadikan kami orang-orang muslim) '.\""
            },
            {
                "number": 3274,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي سَعِيدُ بْنُ أَبِي أَيُّوبَ عَنْ أَبِي عَقِيلٍ الْقُرَشِيِّ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَكَلَ أَوْ شَرِبَ قَالَ الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَ وَسَقَى وَسَوَّغَهُ وَجَعَلَ لَهُ مَخْرَجًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Sa'id bin Abu Ayyub] dari [Abu 'Aqil Al Qurasyi] dari [Abu Abdurrahman Al Hubuli] dari [Abu Ayyub Al Anshari] ia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam selesai dari makan atau minum, beliau mengucapkan: 'Al HAMDULILLAAHILLADZII ATH'AMA WA SAQAA WA SAWWAGHAHU WA JA'ALA LAHU MAKHRAJAN (Segala puji bagi Allah Yang telah memberi makan dan minum, memudahkan saat menelan dan menjadikan baginya tempat keluar) '.\""
            },
            {
                "number": 3275,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا سُهَيْلُ بْنُ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَامَ وَفِي يَدِهِ غَمَرٌ وَلَمْ يَغْسِلْهُ فَأَصَابَهُ شَيْءٌ فَلَا يَلُومَنَّ إِلَّا نَفْسَهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Suhail bin Abu Shalih] dari [Ayahnya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa tidur dan di tangannya terdapat lemak daging yang belum ia bersihkan kemudian mengenai sesuatu, maka janganlah ia mencela kecuali kepada dirinya sendiri!\""
            },
            {
                "number": 3276,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ يَزِيدَ أَبِي خَالِدٍ الدَّالَانِيِّ عَنْ رَجُلٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَصَنَعَ أَبُو الْهَيْثَمِ بْنُ التَّيْهَانِ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامًا فَدَعَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابَهُ فَلَمَّا فَرَغُوا قَالَ أَثِيبُوا أَخَاكُمْ قَالُوا يَا رَسُولَ اللَّهِ وَمَا إِثَابَتُهُ قَالَ إِنَّ الرَّجُلَ إِذَا دُخِلَ بَيْتُهُ فَأُكِلَ طَعَامُهُ وَشُرِبَ شَرَابُهُ فَدَعَوْا لَهُ فَذَلِكَ إِثَابَتُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abu Ahmad] telah menceritakan kepada kami [Sufyan] dari [Yazid Abu Khalid Abu Daud Dalani] dari [seorang laki-laki] dari [Jabir bin Abdullah] ia berkata, \"Abu Al Haitsam bin At Taihan membuatkan makanan untuk Nabi shallallahu 'alaihi wasallam, kemudian ia mengundang Nabi shallallahu 'alaihi wasallam dan para sahabatnya. Ketika telah selesai beliau bersabda: \"Balaslah saudaramu!\" Para sahabat bertanya, \"Wahai Rasulullah, bagaimana membalasnya?\" Beliau menjawab: \"Sesungguhnya seseorang apabila dimasuki rumahnya kemudian dimakan makanannya serta diminum minumannya lalu mereka mendo'akan untuknya, maka itulah balasan kepadanya.\""
            },
            {
                "number": 3277,
                "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ثَابِتٍ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَ إِلَى سَعْدِ بْنِ عُبَادَةَ فَجَاءَ بِخُبْزٍ وَزَيْتٍ فَأَكَلَ ثُمَّ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْطَرَ عِنْدَكُمْ الصَّائِمُونَ وَأَكَلَ طَعَامَكُمْ الْأَبْرَارُ وَصَلَّتْ عَلَيْكُمْ الْمَلَائِكَةُ",
                "id": "Telah menceritakan kepada kami [Makhlad bin Khalid] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Tsabit] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam datang kepada Sa'd bin 'Ubadah, lalu Sa'd menyuguhkan roti dan minyak samin. Nabi shallallahu 'alaihi wasallam kemudian memakannya, setelah itu beliau bersabda: \"Telah berbuka di rumahmu orang-orang yang berpuasa, dan telah makan makananmu orang-orang yang baik, dan bershalawat kepadamu para Malaikat.\""
            },
            {
                "number": 3278,
                "arab": "حَدَّثَنَا حَفْصُ بْنُ عُمَرَ النَّمَرِيُّ حَدَّثَنَا شُعْبَةُ عَنْ زِيَادِ بْنِ عِلَاقَةَ عَنْ أُسَامَةَ بْنِ شَرِيكٍ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابَهُ كَأَنَّمَا عَلَى رُءُوسِهِمْ الطَّيْرُ فَسَلَّمْتُ ثُمَّ قَعَدْتُ فَجَاءَ الْأَعْرَابُ مِنْ هَا هُنَا وَهَا هُنَا فَقَالُوا يَا رَسُولَ اللَّهِ أَنَتَدَاوَى فَقَالَ تَدَاوَوْا فَإِنَّ اللَّهَ عَزَّ وَجَلَّ لَمْ يَضَعْ دَاءً إِلَّا وَضَعَ لَهُ دَوَاءً غَيْرَ دَاءٍ وَاحِدٍ الْهَرَمُ",
                "id": "Telah menceritakan kepada kami [Hafsh bin Umar An Namari] telah menceritakan kepada kami [Syu'bah] dari [Ziyad bin 'Ilaqah] dari [Usamah bin Syarik] ia berkata, \"Aku pernah mendatangi Nabi shallallahu 'alaihi wasallam dan para sahabatnya, dan seolah-olah di atas kepala mereka terdapat burung. Aku kemudian mengucapkan salam dan duduk, lalu ada seorang Arab badui datang dari arah ini dan ini, mereka lalu berkata, \"Wahai Rasulullah, apakah boleh kami berobat?\" Beliau menjawab: \"Berobatlah, sesungguhnya Allah 'azza wajalla tidak menciptakan penyakit melainkan menciptakan juga obatnya, kecuali satu penyakit, yaitu pikun.\""
            },
            {
                "number": 3279,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو دَاوُدَ وَأَبُو عَامِرٍ وَهَذَا لَفْظُ أَبِي عَامِرٍ عَنْ فُلَيْحِ بْنِ سُلَيْمَانَ عَنْ أَيُّوبَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ صَعْصَعَةَ الْأَنْصَارِيِّ عَنْ يَعْقُوبَ بْنِ أَبِي يَعْقُوبَ عَنْ أُمِّ الْمُنْذِرِ بِنْتِ قَيْسٍ الْأَنْصَارِيَّةِ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ عَلِيٌّ عَلَيْهِ السَّلَام وَعَلِيٌّ نَاقِهٌ وَلَنَا دَوَالِي مُعَلَّقَةٌ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ مِنْهَا وَقَامَ عَلِيٌّ لِيَأْكُلَ فَطَفِقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لِعَلِيٍّ مَهْ إِنَّكَ نَاقِهٌ حَتَّى كَفَّ عَلِيٌّ عَلَيْهِ السَّلَام قَالَتْ وَصَنَعْتُ شَعِيرًا وَسِلْقًا فَجِئْتُ بِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَلِيُّ أَصِبْ مِنْ هَذَا فَهُوَ أَنْفَعُ لَكَقَالَ أَبُو دَاوُد قَالَ هَارُونُ الْعَدَوِيَّةَ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Abu Daud] dan [Abu 'Amir] hadits ini adalah lafazh Abu 'Amir, dari [Fulaih bin Sulaiman] dari [Ayyub bin Abdurrahman bin Sha'sha'ah Al Anshari] dari [Ya'qub bin Abu Ya'qub] dari [Ummu Al Mundzir binti Qais Al Anshariyyah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menemuiku bersama Ali radliallahu 'anhu, sementara Ali yang sedang sakit. Saat itu kami memiliki buah kurma yang tergantung, Rasulullah shallallahu 'alaihi wasallam lalu berdiri dan makan sebagian darinya. Ketika Ali berdiri untuk makan, Rasulullah shallallahu 'alaihi wasallam berkata kepada Ali: \"Tahanlah, sesungguhnya engkau baru saja sembuh dari sakit!\" Hingga Ali menahan diri.\" Ummu Al Mundzir berkata, \"Aku lalu masak gandum dan rebusan sayur. Setelah itu aku membawanya dan Rasulullah shallallahu 'alaihi wasallam pun berkata: \"Wahai Ali, makanlah dari makanan ini, makanan tersebut lebih bermanfaat bagimu.\" Abu Daud berkata, \"Harun berkata, \"Ia adalah Ummu Al Mundzir Al Anshariyyah Al 'Adawiyyah.\""
            },
            {
                "number": 3280,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرِةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنْ كَانَ فِي شَيْءٍ مِمَّا تَدَاوَيْتُمْ بِهِ خَيْرٌ فَالْحِجَامَةُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Muhammad bin 'Amru] dari [Abu Salamah] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila ada sesuatu yang lebih baik untuk kalian gunakan berobat, maka sesuatu tersebut adalah bekam.\""
            },
            {
                "number": 3281,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْوَزِيرِ الدِّمَشْقِيُّ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ حَسَّانَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الْمَوَالِي حَدَّثَنَا فَائِدٌ مَوْلَى عُبَيْدِ اللَّهِ بْنِ عَلِيِّ بْنِ أَبِي رَافِعٍ عَنْ مَوْلَاهُ عُبَيْدِ اللَّهِ بْنِ عَلِيِّ بْنِ أَبِي رَافِعٍ عَنْ جَدَّتِهِ سَلْمَى خَادِمِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْمَا كَانَ أَحَدٌ يَشْتَكِي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَعًا فِي رَأْسِهِ إِلَّا قَالَ احْتَجِمْ وَلَا وَجَعًا فِي رِجْلَيْهِ إِلَّا قَالَ اخْضِبْهُمَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Wazir Ad Dimasyqi] telah menceritakan kepada kami [Yahya bin Hassan] telah menceritakan kepada kami [Abdurrahman bin Abu Al Mawali] telah menceritakan kepada kami [Faid] mantan budak 'ubaidhullah bin Ali bin Abu Rafi', dari [ubaidhullah bin Abu Rafi'] dari neneknya [Salma] pelayan Rasulullah shallallahu 'alaihi wasallam, Ia berkata, \"Tidak ada seorangpun yang mengeluhkan penyakit kepada Rasulullah shallallahu 'alaihi wasallam pada kepalanya melainkan beliau berkata: \"Berbekamlah!\" Dan tidaklah ia mengeluhkan sakit pada kedua kakinya melainkan beliau berkata: \"Warnailah dengan pacar!\""
            },
            {
                "number": 3282,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ وَكَثِيرُ بْنُ عُبَيْدٍ قَالَا حَدَّثَنَا الْوَلِيدُ عَنْ ابْنِ ثَوْبَانَ عَنْ أَبِيهِ عَنْ أَبِي كَبْشَةَ الْأَنْمَارِيِّقَالَ كَثِيرٌ إِنَّهُ حَدَّثَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَحْتَجِمُ عَلَى هَامَتِهِ وَبَيْنَ كَتِفَيْهِ وَهُوَ يَقُولُ مَنْ أَهْرَاقَ مِنْ هَذِهِ الدِّمَاءِ فَلَا يَضُرُّهُ أَنْ لَا يَتَدَاوَى بِشَيْءٍ لِشَيْءٍ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Ibrahim Ad Dimasyqi] dan [Katsir bin 'Ubaid] mereka berkata; telah menceritakan kepada kami [Al Walid] dari [Ibnu Tsauban] dari [Abu Kabsyah Al Anmari] [Katsir] berkata, \"Sesungguhnya ia telah meriwayatkannya bahwa Nabi shallallahu 'alaihi wasallam berbekam pada kepalanya, dan di antara kedua pundanya. Beliau bersabda: \"Barangsiapa mengalirkan sebagian dari darah ini, maka ia tidak akan terkena bahaya sekiranya tidak berobat dengan sesuatu, untuk suatu penyakit tertentu.\""
            },
            {
                "number": 3283,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ ثَلَاثًا فِي الْأَخْدَعَيْنِ وَالْكَاهِلِقَالَ مُعَمَّرٌ احْتَجَمْتُ فَذَهَبَ عَقْلِي حَتَّى كُنْتُ أُلَقَّنُ فَاتِحَةَ الْكِتَابِ فِي صَلَاتِي وَكَانَ احْتَجَمَ عَلَى هَامَتِهِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Jarir bin Hazim] telah menceritakan kepada kami [Qatadah] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam pernah berbekam pada tiga tempat; pada kedua urat leher dan kahil (bagian punggung antara dua pundak).\" Mu'ammar berkata, \"Ketika aku berbekam, akalku kemudian hilang hingga aku dibacakan Surat Al Fatihah dalam sholatku.\" Mu'ammar berbekam pada kepalanya. "
            },
            {
                "number": 3284,
                "arab": "حَدَّثَنَا أَبُو تَوْبَةَ الرَّبِيعُ بْنُ نَافِعٍ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْجُمَحِيُّ عَنْ سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ احْتَجَمَ لِسَبْعَ عَشْرَةَ وَتِسْعَ عَشْرَةَ وَإِحْدَى وَعِشْرِينَ كَانَ شِفَاءً مِنْ كُلِّ دَاءٍ",
                "id": "Telah menceritakan kepada kami [Abu Taubah Ar Rabi' bin Nafi'] telah menceritakan kepada kami [Sa'id bin Abdurrahman Al Jumahi] dari [Suhail] dari [Ayahnya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berbekam pada tanggal tujuh belas, sembilan belas dan dua puluh satu, maka bekam tersebut menjadi obat dari segala penyakit.\""
            },
            {
                "number": 3285,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ أَخْبَرَنِي أَبُو بَكْرَةَ بَكَّارُ بْنُ عَبْدِ الْعَزِيزِ أَخْبَرَتْنِي عَمَّتِي كَبْشَةُ بِنْتُ أَبِي بَكْرَةَ وَقَالَ غَيْرُ مُوسَى كَيِّسَةُ بِنْتُ أَبِي بَكْرَةَأَنَّ أَبَاهَا كَانَ يَنْهَى أَهْلَهُ عَنْ الْحِجَامَةِ يَوْمَ الثُّلَاثَاءِ وَيَزْعُمُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ يَوْمَ الثُّلَاثَاءِ يَوْمُ الدَّمِ وَفِيهِ سَاعَةٌ لَا يَرْقَأُ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah mengabarkan kepadaku [Abu Bakrah Bakkar bin Abdul Aziz] telah mengabarkan kepadaku bibiku [Kabsyah binti Abu Bakrah] -dan selain Musa berkata; Ia adalah Kayyisah binti Abu Bakrah-, bahwa [Ayahnya] melarang keluarganya untuk melakukan bekam pada hari Selasa, dan ia mengaku berasal dari Rasulullah shallallahu 'alaihi wasallam bahwa hari Selasa adalah hari yang tubuh banyak mengandung darah, dan tidak terputus (aliran darah dalam pembuluh sangat kuat).\""
            },
            {
                "number": 3286,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَمَ عَلَى وِرْكِهِ مِنْ وَثْءٍ كَانَ بِهِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] dari [Abu Az Zubair] dari [Jabir] bahwa Rasulullah shallallahu 'alaihi wasallam berbekam pada sisi pantatnya karena penyakit cacar yang beliau derita.\""
            },
            {
                "number": 3287,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَبَعَثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى أُبَيٍّ طَبِيبًا فَقَطَعَ مِنْهُ عِرْقًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] ia berkata, \"Nabi shallallahu 'alaihi wasallam mengutus seorang dokter kepada Ubai, kemudian dokter tersebut memotong uratnya.\""
            },
            {
                "number": 3288,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمُّادٌ عَنْ ثَابِتٍ عَنْ مُطَرِّفٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَنَهَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْكَيِّ فَاكْتَوَيْنَا فَمَا أَفْلَحْنَ وَلَا أَنْجَحْنَقَالَ أَبُو دَاوُد وَكَانَ يَسْمَعُ تَسْلِيمَ الْمَلَائِكَةِ فَلَمَّا اكْتَوَى انْقَطَعَ عَنْهُ فَلَمَّا تَرَكَ رَجَعَ إِلَيْهِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Tsabit] dari [Mutharrif] dari [Imran bin Hushain] ia berkata, \"Nabi shallallahu 'alaihi wasallam melarang dari kay (pengobatan dengan sengatan besi panas), kemudian kami melakukan kay, maka kay itu tidak beruntung dan tidak berhasil.\" Abu Daud berkata, \"Rasulullah shallallahu 'alaihi wasallam mendengar salam para Malaikat, ketika beliau melakukan kay suara itu hilang, dan ketika beliau meninggalkan pengobatan kay, beliau dapat mendengar suara Malaikat kembali.\""
            },
            {
                "number": 3289,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَوَى سَعْدَ بْنَ مُعَاذٍ مِنْ رَمِيَّتِهِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Abu Az Zubair] dari [Jabir] bahwa Nabi shallallahu 'alaihi wasallam pernah melakukan pengobatan kay untuk Sa'd bin Mu'adz karena luka panah yang ia derita.\""
            },
            {
                "number": 3290,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَقَ حَدَّثَنَا وُهَيْبٌ عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ عَنْ أَبِيهِ عَنْ ابْنِ عَبَّاسِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَعَطَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepadaku [Ahmad bin Ishaq] telah menceritakan kepada kami [Wuhaib] dari [Abdullah bin Thawus] dari [Ayahnya] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam memakai obat yang dimasukkan ke hidung.\""
            },
            {
                "number": 3291,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا عَقِيلُ بْنُ مَعْقِلٍ قَالَ سَمِعْتُ وَهْبَ بْنَ مُنَبِّهٍ يُحَدِّثُ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النُّشْرَةِ فَقَالَ هُوَ مِنْ عَمَلِ الشَّيْطَانِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Abdurrazzaq] telah menceritakan kepada kami ['Aqil bin Ma'qil] ia berkata; aku pernah mendengar [Wahb bin Munabbih] menceritakan dari [Jabir bin Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah ditanya mengenai nusyrah (jampi), kemudian beliau menjawab: \"Itu adalah perbuatan setan.\""
            },
            {
                "number": 3292,
                "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ بْنِ مَيْسَرَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يِزِيدَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ حَدَّثَنَا شُرَحْبِيلُ بْنُ يَزِيدَ الْمُعَافِرِيُّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ التَّنُوخِيِّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا أُبَالِي مَا أَتَيْتُ إِنْ أَنَا شَرِبْتُ تِرْيَاقًا أَوْ تَعَلَّقْتُ تَمِيمَةً أَوْ قُلْتُ الشِّعْرَ مِنْ قِبَلِ نَفْسِيقَالَ أَبُو دَاوُد هَذَا كَانَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَاصَّةً وَقَدْ رَخَّصَ فِيهِ قَوْمٌ يَعْنِي التِّرْيَاقَ",
                "id": "Telah menceritakan kepada kami ['ubaidhullah bin Umar bin Maisarah] telah menceritakan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami [Sa'id bin Abu Ayyub] telah menceritakan kepada kami [Syurahbil bin Yazid Al Mu'afiri] dari [Abdurrahman bin Rafi' At Tanukhi] ia berkata; aku pernah mendengar [Abdullah bin 'Amru] berkata, \"Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika aku minum tiryaq (penawar racun), aku tidak peduli dengan yang aku lakukan; menggantungkan jimat atau mengucapkan kata-kata syair dari diriku.\" Abu Daud berkata, \"Ini khusus untuk Nabi shallallahu 'alaihi wasallam, namun sebagian orang memberikan keringanan dalam hal itu, yakni saat minum obat penghilang racun.\""
            },
            {
                "number": 3293,
                "arab": "قَالَ لَنَا حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ مُجَاهِدٍ عَنْ أَبِي هُرَيْرَةَ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الدَّوَاءِ الْخَبِيثِ",
                "id": "Ia telah berkata kepada kami; telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Muhammad bin Bisyr] telah menceritakan kepada kami [Yunus bin Abu Ishaq] dari [Mujahid] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang mengunakan obat yang telah diharamkan.\""
            },
            {
                "number": 3294,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثيِرٍ أَخْبَرَنَا سُفْيَانُ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ سَعِيدِ بْنِ خَالِدٍ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَأَنَّ طَبِيبًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ضِفْدَعٍ يَجْعَلُهَا فِي دَوَاءٍ فَنَهَاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepada kami [Sufyan] dari [Ibnu Abu Dzi`b] dari [Sa'id bin Khalid] dari [Sa'id bin Al Musayyab] dari [Abdurrahman bin Utsman] bahwa seorang dokter pernah bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai katak yang ia jadikan sebagai campuran obat. Kemudian Nabi shallallahu 'alaihi wasallam melarang dari membunuhnya.\""
            },
            {
                "number": 3295,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَسَا سُمًّا فَسُمُّهُ فِي يَدِهِ يَتَحَسَّاهُ فِي نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا أَبَدًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meneguk racun, maka di neraka Jahannam ia akan meneguk racun yang ada di tangannya tersebut, ia kekal di dalamnya selama-lamanya.\""
            },
            {
                "number": 3296,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكٍ عَنْ عَلْقَمَةَ بْنِ وَائِلٍ عَنْ أَبِيهِ ذَكَرَ طَارِقُ بْنُ سُوَيْدٍ أَوْ سُوَيْدُ بْنُ طَارِقٍسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْخَمْرِ فَنَهَاهُ ثُمَّ سَأَلَهُ فَنَهَاهُ فَقَالَ لَهُ يَا نَبِيَّ اللَّهِ إِنَّهَا دَوَاءٌ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا وَلَكِنَّهَا دَاءٌ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Syu'bah] dari [Simak] dari ['Alqamah bin Wail] dari [Ayahnya] [Thariq bin Suwaid] atau Suwaid bin Thariq menyebutkan, \"Ia bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai khamer, kemudian beliau melarangnya. Lalu ia bertanya lagi kepada beliau, kemudian beliau melarangnya. Lalu ia berkata lagi kepada beliau, \"Wahai Nabi Allah, sesungguhnya khamer adalah obat!\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak! Tetapi dia adalah penyakit.\""
            },
            {
                "number": 3297,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَادَةَ الْوَاسِطِيُّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ ثَعْلَبَةَ بْنِ مُسْلِمٍ عَنْ أَبِي عِمْرَانَ الْأَنْصَارِيِّ عَنْ أُمِّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ أَنْزَلَ الدَّاءَ وَالدَّوَاءَ وَجَعَلَ لِكُلِّ دَاءٍ دَوَاءً فَتَدَاوَوْا وَلَا تَدَاوَوْا بِحَرَامٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubadah Al Wasithi] telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Isma'il bin 'Ayyasy] dari [Tsa'labah bin Muslim] dari [Abu Imran Al Anshari] dari [Ummu Ad Darda] dari [Abu Ad Darda] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah telah menurunkan penyakit dan obat, dan menjadikan bagi setiap penyakit terdapat obatnya, maka berobatlah dan jangan berobat dengan sesuatu yang haram!\""
            },
            {
                "number": 3298,
                "arab": "حَدَّثَنَا إِسْحَقُ بْنُ إِسْمَعِيلَ حَدَّثَنَا سُفْيَانُ عَنْ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ سَعْدٍ قَالَمَرِضْتُ مَرَضًا أَتَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعُودُنِي فَوَضَعَ يَدَهُ بَيْنَ ثَدْيَيَّ حَتَّى وَجَدْتُ بَرْدَهَا عَلَى فُؤَادِي فَقَالَ إِنَّكَ رَجُلٌ مَفْئُودٌ ائْتِ الْحَارِثَ بْنَ كَلَدَةَ أَخَا ثَقِيفٍ فَإِنَّهُ رَجُلٌ يَتَطَبَّبُ فَلْيَأْخُذْ سَبْعَ تَمَرَاتٍ مِنْ عَجْوَةِ الْمَدِينَةِ فَلْيَجَأْهُنَّ بِنَوَاهُنَّ ثُمَّ لِيَلُدَّكَ بِهِنَّ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Isma'il] telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Najih] dari [Mujahid] dari [Sa'd] ia berkata, \"Aku pernah mengalami sakit, Rasulullah shallallahu 'alaihi wasallam lalu datang menjengukku, beliau kemudian meletakkan tangannya di antara kedua dadaku hingga aku merasakan dinginnya tangan beliau pada dadaku. Kemudian beliau bersabda: \"Sesungguhnya engkau adalah seorang laki-laki yang terkena penyakit pada hatinya, datanglah kepada Al Harits bin Kaladah saudara Tsaqif, ia orang yang bisa kedokteran. Hendaknya ia mengambil tujuh buah kurma 'ajwah Madinah, hendaknya ia tumbuk bersamaan dengan bijinya, kemudian meminumkannya kepadamu!\""
            },
            {
                "number": 3299,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا هَاشِمُ بْنُ هَاشِمٍ عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَصَبَّحَ سَبْعَ تَمَرَاتٍ عَجْوَةٍ لَمْ يَضُرَّهُ ذَلِكَ الْيَوْمَ سَمٌّ وَلَا سِحْرٌ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah] telah menceritakan kepada kami [Hasyim bin Hasyim] dari ['Amir bin Sa'd bin Abu Waqqash] dari [Ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa pada pagi hari makan tujuh butir kurma 'ajwah, maka pada hari itu ia tidak akan terkena racun dan sihir.\""
            },
            {
                "number": 3300,
                "arab": "حَدَّثَنَا مُسَدَّدُ وَحَامِدُ بْنُ يَحْيَى قَالَا حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ عُبَيدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ قَالَتْدَخَلْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِابْنٍ لِي قَدْ أَعْلَقْتُ عَلَيْهِ مِنْ الْعُذْرَةِ فَقَالَ عَلَامَ تَدْغَرْنَ أَوْلَادَكُنَّ بِهَذَا الْعِلَاقِ عَلَيْكُنَّ بِهَذَا الْعُودِ الْهِنْدِيِّ فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ مِنْهَا ذَاتُ الْجَنْبِ يُسْعَطُ مِنْ الْعُذْرَةِ وَيُلَدُّ مِنْ ذَاتِ الْجَنْبِقَالَ أَبُو دَاوُد يَعْنِي بِالْعُودِ الْقُسْطَ",
                "id": "Telah menceritakan kepada kami [Musaddad] dan [Hamid bin Yahya] mereka berkata; telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [Ummu Qais binti Mihshan] ia berkata, \"Aku pernah menemui Rasulullah shallallahu 'alaihi wasallam membawa anakku yang telah aku obati dari penyakit radang kelenjar leher (amandel). Kemudian beliau berkata: \"Atas dasar apakah kalian menekan dan mengangkat tenggorokan anak kalian dengan mengangkat dagu mereka? Hendaknya kalian menggunakan gaharu India, karena sesungguhnya padanya terdapat tujuh macam obat, diantaranya adalah obat penyakit tulang rusuk, digunakan sebagai obat radang amandel yang dimasukkan dari hidung, serta obat penyakit rusuk yang dimasukkan lewat mulut.\" Abu Daud berkata, \"Yang dimaksud dengan 'ud adalah gaharu.\""
            },
            {
                "number": 3301,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَسُوا مِنْ ثِيَابِكُمْ الْبَيَاضَ فَإِنَّهَا مِنْ خَيْرِ ثِيَابِكُمْ وَكَفِّنُوا فِيهَا مَوْتَاكُمْ وَإِنَّ خَيْرَ أَكْحَالِكُمُ الْإِثْمِدُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعْرَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Abdullah bin Utsman bin Khutsaim] dari [Sa'id bin Jubair] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pakailah pakaian yang putih, sebab ia adalah sebaik-baik pakaian kalian, dan kafanilah jenazah kalian dengannya. Sesungguhnya sebaik-baik celak kalian adalah itsmid (sejenis tumbuhan), itsmid dapat mempertajam pandangan dan menumbuhkan rambut.\""
            },
            {
                "number": 3302,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهِ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعَيْنُ حَقٌّ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Abdurrazzaq] telah menceritakan kepada kami [Ma'mar] dari [Hammam bin Munabbih] ia berkata; Ini adalah hadits yang telah diceritakan [Abu Hurairah] kepada kami dari Rasulullah, \"Beliau bersabda: \"Penyakit Ain (pengaruh mata orang yang dengki) itu benar adanya.\""
            },
            {
                "number": 3303,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْكَانَ يُؤْمَرُ الْعَائِنُ فَيَتَوَضَّأُ ثُمَّ يَغْتَسِلُ مِنْهُ الْمَعِينُ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Al A'masy] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] radliallahu 'anha, ia berkata, \"Orang yang menimbulkan penyakit Ain diperintahkan untuk berwudlu, kemudian orang yang menderita penyakit Ain diperintahkan untuk mandi dengan air sisa wudlunya.\""
            },
            {
                "number": 3304,
                "arab": "حَدَّثَنَا الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ مُهَاجِرٍ عَنْ أَبِيهِ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ بْنِ السَّكَنِ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَقْتُلُوا أَوْلَادَكُمْ سِرًّا فَإِنَّ الْغَيْلَ يُدْرِكُ الْفَارِسَ فَيُدَعْثِرُهُ عَنْ فَرَسِهِ",
                "id": "Telah menceritakan kepada kami [Ar Rabi' bin Nafi' Abu Taubah] telah menceritakan kepada kami [Muhammad bin Muhajir] dari [Ayahnya] dari [Asma` binti Yazid bin As Sakan] ia berkata, \"Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian membunuh anak-anak kalian secara rahasia, sesungguhnya pengaruh menggauli isteri pada waktu menyusui akan menimpa penunggang kuda sehingga menyebabkannya lemah dan terjatuh dari kudanya.\""
            },
            {
                "number": 3305,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ جُدَامَةَ الْأَسَدِيَّةِأَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَقَدْ هَمَمْتُ أَنْ أَنْهَى عَنْ الْغِيلَةِ حَتَّى ذَكَرْتُ أَنَّ الرُّومَ وَفَارِسَ يَفْعَلُونَ ذَلِكَ فَلَا يَضُرُّ أَوْلَادَهُمْقَالَ مَالِكٌ الْغِيلَةُ أَنْ يَمَسَّ الرَّجُلُ امْرَأَتَهُ وَهِيَ تُرْضِعُ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Muhammad bin Abdurrahman bin Naufal] telah mengabarkan kepadaku ['Urwah bin Az Zubair] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, dari [Judamah Al Asadiyyah] bahwa ia pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh aku telah berniat untuk melarang dari menggauli isteri pada waktu menyusui, hingga aku ingat bahwa orang-orang Romawi dan Persia melakukan hal tersebut dan tidak membahayakan anak-anak mereka.\" Malik berkata, \"Ghailah adalah seorang laki-laki menggauli isterinya ketika dalam keadaan menyusui.\""
            },
            {
                "number": 3306,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ يَحْيَى بْنِ الْجَزَّارِ عَنْ ابْنِ أَخِي زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ عَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الرُّقَى وَالتَّمَائِمَ وَالتِّوَلَةَ شِرْكٌ قَالَتْ قُلْتُ لِمَ تَقُولُ هَذَا وَاللَّهِ لَقَدْ كَانَتْ عَيْنِي تَقْذِفُ وَكُنْتُ أَخْتَلِفُ إِلَى فُلَانٍ الْيَهُودِيِّ يَرْقِينِي فَإِذَا رَقَانِي سَكَنَتْ فَقَالَ عَبْدُ اللَّهِ إِنَّمَا ذَاكَ عَمَلُ الشَّيْطَانِ كَانَ يَنْخُسُهَا بِيَدِهِ فَإِذَا رَقَاهَا كَفَّ عَنْهَا إِنَّمَا كَانَ يَكْفِيكِ أَنْ تَقُولِي كَمَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَذْهِبْ الْبَأْسَ رَبَّ النَّاسِ اشْفِ أَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءً لَا يُغَادِرُ سَقَمًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala] telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy] dari ['Amru bin Murrah] dari [Yahya bin Al Jazzar] dari [anak saudara Zainab] isteri Abdullah, dari [Zainab] dari [Abdullah] ia berkata, \"Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya jampi-jampi, jimat dan tiwalah (menjadikan seorang wanita mencintai suaminya) adalah bentuk kesyirikan.\" Zainab berkata, \"Aku katakan, 'Kenapa engkau mengucapkan hal ini? Demi Allah! Sungguh, mataku telah mengeluarkan air mata dan kotoran. Dan aku bolak-balik datang kepada Fulan seorang Yahudi yang menjampiku, apabila ia menjampiku maka mataku menjadi tenang?\" Kemudian Abdullah menjawab, 'Sesungguhnya hal tersebut adalah perbuatan setan. Setan telah menusuk matanya menggunakan tangannya, kemudian apabila orang yahudi tersebut menjampinya maka setan menahan tusukannya. Sebenarnya cukup bagimu mengucapkan sebagaimana yang diucapkan Rasulullah shallallahu 'alaihi wasallam: 'ADZHIBIL BA`SA RABBAN NAASA ISYFI ANTA ASY SYAAFII LAA SYIFAA A ILLAA SYIFAA`UKA SYIFAA`AN LAA YUGHAADIRU SAQAMAN (Wahai Tuhan manusia, hilangkanlah penyakit, sesungguhnya Engkau Pemberi kesembuhan, tidak ada kesembuhan kecuali kesembuhan dari-Mu, kesembuhan yang tidak meninggalkan efek penyakit) '.\""
            },
            {
                "number": 3307,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ عَنْ مَالِكِ بْنِ مِغْوَلٍ عَنْ حُصَيْنٍ عَنْ الشَّعْبِيِّ عَنْ عِمْرَانَ بْنَ حُصَيْنٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا رُقْيَةَ إِلَّا مِنْ عَيْنٍ أَوْ حُمَةٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdullah bin Daud] dari [Malik bin Mighwal] dari [Hushain] dari [Asy Sya'bi] dari [Imran bin Hushain] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak ada jampi kecuali karena 'ain (pengaruh mata orang yang dengki), atau dari racun.\""
            },
            {
                "number": 3308,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ وابْنُ السَّرْحِ قَالَ أَحْمَدُ حَدَّثَنَا ابْنُ وَهْبٍ و قَالَ ابْنُ السَّرْحِ أَخْبَرَنَا ابْنُ وَهْبٍ حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ عَمْروِ بْنِ يَحْيَى عَنْ يُوسُفَ بْنِ مُحَمَّدٍ وَقَالَ ابْنُ صَالِحٍ مُحَمَّدُ بْنُ يُوسُفَ بْنِ ثَابِتِ بْنِ قَيْسِ بْنِ شَمَّاسٍ عَنْ أَبِيهِ عَنْ جَدِّهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ دَخَلَ عَلَى ثَابِتِ بْنِ قَيْسٍ قَالَ أَحْمَدُ وَهُوَ مَرِيضٌ فَقَالَ اكْشِفْ الْبَأْسَ رَبَّ النَّاسِ عَنْ ثَابِتِ بْنِ قَيْسِ بْنِ شَمَّاسٍ ثُمَّ أَخَذَ تُرَابًا مِنْ بَطْحَانَ فَجَعَلَهُ فِي قَدَحٍ ثُمَّ نَفَثَ عَلَيْهِ بِمَاءٍ وَصَبَّهُ عَلَيْهِقَالَ أَبُو دَاوُد قَالَ ابْنُ السَّرْحِ يُوسُفُ بْنُ مُحَمَّدٍ وَهُوَ الصَّوَابُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] dan [Ibnu As Sarh] [Ahmad] berkata; telah menceritakan kepada kami [Ibnu Wahb] dan [Ibnu As Sarh] berkata; telah mengabarkan kepada kami [Ibnu Wahb] telah menceritakan kepada kami [Daud bin Abdurrahman] dari ['Amru bin Yahya] dari [Yusuf bin Muhammad] -Ibnu Shalih Muhammad bin Yusuf bin Tsabit bin Qais bin Syammas berkata- dari [Ayahnya] dari [Kakeknya] dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau pernah menemui Tsabit bin Qais -Ahmad berkata; saat ia sedang sakit-, lalu beliau mengucapkan: 'IKSYIFIL BA`SA RABBAN NAASI (Hilangkan penyakit wahai Tuhan manusia!) '. Dari Tsabit bin Qais bin Syammas, \"Kemudian beliau mengambil tanah dari Bathhan dan memasukkannya ke dalam sebuah gelas, beliau kemudian menyemburkan air ke dalamnya, lalu menuangkannya kepadanya.\" Abu Daud berkata; Ibnu As As Sarh berkata, \"Yang benar adalah Yusuf bin Muhammad.\""
            },
            {
                "number": 3309,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي مُعَاوِيَةُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ عَنْ عَوْفِ بْنِ مَالِكٍ قَالَكُنَّا نَرْقِي فِي الْجَاهِلِيَّةِ فَقُلْنَا يَا رَسُولَ اللَّهِ كَيْفَ تَرَى فِي ذَلِكَ فَقَالَ اعْرِضُوا عَلَيَّ رُقَاكُمْ لَا بَأْسَ بِالرُّقَى مَا لَمْ تَكُنْ شِرْكًا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Mu'awiyah] dari [Abdurrahman bin Jubair] dari [Ayahnya] dari ['Auf bin Malik] ia berkata, \"Pada masa jahiliyah aku pernah melakukan penjampian, lalu aku berkata, \"Wahai Rasulullah, bagaimana pendapat anda mengenai hal tersebut?\" Beliau menjawab: \"Perlihatkan jampi kalian kepadaku! Tidak mengapa dengan jampi selama bukan perbuatan syirik.\""
            },
            {
                "number": 3310,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مَهْدِيٍّ الْمِصِّيصِيُّ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ أَبِي بَكْرِ بْنِ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ عَنْ الشِّفَاءِ بِنْتِ عَبْدِ اللَّهِ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا عِنْدَ حَفْصَةَ فَقَالَ لِي أَلَا تُعَلِّمِينَ هَذِهِ رُقْيَةَ النَّمْلَةِ كَمَا عَلَّمْتِيهَا الْكِتَابَةَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Mahdi Al Mishshi] telah menceritakan kepada kami [Ali bin Mushir] dan [Abdul Aziz bin Umar bin Abdul Aziz] dari [Shalih bin Kaisan] dari [Abu Bakr bin Sulaiman bin Abu Hatsmah] dari [Asy Syifa` binti Abdullah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah menemuiku, sementara aku sedang berada di rumah Hafshah. Lalu beliau berkata kepadaku: \"Tidakkah engkau ajari dia jampi namlah sebagaimana engkau mengajarinya menulis?\" "
            },
            {
                "number": 3311,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ حَدَّثَتْنِي جَدَّتِي قَالَتْ سَمِعْتُ سَهْلَ بْنَ حُنَيفٍ يَقُولُمَرَرْنَا بِسَيْلٍ فَدَخَلْتُ فَاغْتَسَلْتُ فِيهِ فَخَرَجْتُ مَحْمُومًا فَنُمِيَ ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مُرُوا أَبَا ثَابِتٍ يَتَعَوَّذُ قَالَتْ فَقُلْتُ يَا سَيِّدِي وَالرُّقَى صَالِحَةٌ فَقَالَ لَا رُقْيَةَ إِلَّا فِي نَفْسٍ أَوْ حُمَةٍ أَوْ لَدْغَةٍقَالَ أَبُو دَاوُد الْحُمَةُ مِنْ الْحَيَّاتِ وَمَا يَلْسَعُ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdul Wahid bin Ziyad] telah menceritakan kepada kami [Utsman bin Hakim] telah menceritakan kepadaku [Nenekku] ia berkata; Aku pernah mendengar [Sahl bin Hunaif] berkata, \"Kami pernah melewati sebuah air yang mengalir (banjir), kemudian aku mencebur dan mandi di dalamnya, setelah itu aku keluar dan dalam keadaan terserang demam. Hal itu lalu sampai kepada Rasulullah shallallahu 'alaihi wasallam hingga beliau pun bersabda: \"Perintahkan Abu Tsabit agar membaca ta'awwudz!\" Nenekku berkata, \"Lalu aku katakan, \"Wahai tuanku, apakah jampi diperbolehkan?\" Beliau bersabda: \"Tidak ada jampi kecuali karena pengaruh perbuatan dengki, atau racun, atau sengatan hewan.\" Abu Daud berkata, \"(Yaitu) racun ular dan apa yang menyengat.\""
            },
            {
                "number": 3312,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ حَدَّثَنَا شَرِيكٌ ح و حَدَّثَنَا الْعَبَّاسُ الْعَنْبَرِيُّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شَرِيكٌ عَنْ الْعَبَّاسِ بْنِ ذَرِيحٍ عَنْ الشَّعْبِيِّ قَالَ الْعَبَّاسُ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا رُقْيَةَ إِلَّا مِنْ عَيْنٍ أَوْ حُمَةٍ أَوْ دَمٍ يَرْقَأُ لَمْ يَذْكُرْ الْعَبَّاسُ الْعَيْنَ وَهَذَا لَفْظُ سُلَيْمَانَ بْنِ دَاوُدَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Daud] telah menceritakan kepada kami [Syarik]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Al 'Abbas Al 'Anbari] telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Syarik] dari [Al 'Abbas bin Dzarih] dari [Asy Sya'bi] [Al 'Abbas] menyebutkan dari [Anas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada jampi kecuali karena 'ain (pengaruh mata orang yang dengki), atau racun, atau darah yang terhenti.\" Al 'Abbas tidak menyebutkan 'ain, dan ini adalah lafazh Sulaiman bin Daud.\""
            },
            {
                "number": 3313,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ قَالَ قَالَ أَنَسٌ يَعْنِي لِثَابِتٍأَلَا أَرْقِيكَ بِرُقْيَةِ رَسُولِ اللَّهِ قَالَ بَلَى قَالَ فَقَالَ اللَّهُمَّ رَبَّ النَّاسِ مُذْهِبَ الْبَأْسِ اشْفِ أَنْتَ الشَّافِي لَا شَافِيَ إِلَّا أَنْتَ اشْفِهِ شِفَاءً لَا يُغَادِرُ سَقَمًا",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdul Warits] dari [Abdul Aziz bin Shuhaib] ia berkata, \" [Anas] berkata kepada Tsabit, \"Maukah aku jampi engkau dengan jampi yang dilakukan Rasulullah shallallahu 'alaihi wasallam?\" Tsabit menjawab, \"Ya.\" Anas lalu mengucapkan, \"ALLAAHUMMA RABBAN NAASI, MUDZHIBIL BA`SI ISYFI ANTA ASY SYAAFII LAA SYAAFIYA ILLAA ANTA ISYFIHI SYIFAA AN LAA YUGHAADIRU SAQAMAN (Ya Allah, Tuhan manusia, Penghilang penyakit, sembuhkanlah. Engkau adalah Pemberi kesembuhan, tidak ada yang dapat menyembuhkan kecuali Engkau. Sembuhkanlah dia dengan kesembuhan yang tidak meninggalkan efek sakit) '.\""
            },
            {
                "number": 3314,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ يَزِيدَ بْنِ خُصَيْفَةَ أَنَّ عَمْرَو بْنَ عَبْدِ اللَّهِ بْنِ كَعْبٍ السُّلَمِيَّ أَخْبَرَهُ أَنَّ نَافِعَ بْنَ جُبَيرٍ أَخْبَرَهُ عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِأَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عُثْمَانُ وَبِي وَجَعٌ قَدْ كَادَ يُهْلِكُنِي قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْسَحْهُ بِيَمِينِكَ سَبْعَ مَرَّاتٍ وَقُلْ أَعُوذُ بِعِزَّةِ اللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُقَالَ فَفَعَلْتُ ذَلِكَ فَأَذْهَبَ اللَّهُ عَزَّ وَجَلَّ مَا كَانَ بِي فَلَمْ أَزَلْ آمُرُ بِهِ أَهْلِي وَغَيْرَهُمْ",
                "id": "Telah menceritakan kepada kami [Abdullah Al Qa'nabi] dari [Malik] dari [Yazid bin Khushaifah] bahwa ['Amru bin Abdullah bin Ka'b As Sulami] telah mengabarkan kepadanya, bahwa [Nafi' bin Jubair] mengabarkan kepadanya dari [Utsman bin Abu Al 'Ash] bahwa ia telah datang kepada Nabi shallallahu 'alaihi wasallam -Utsman berkata; sementara aku sedang sakit yang hampir membinasakanku- Utsman berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Usaplah menggunakan tangan kananmu sebanyak tujuh kali, lalu ucapkanlah: A'UUDZU BI'IZZATILLAAHI WA QUDRATIHI MIN SYARRI MAA AJIDU (aku berlindung kepada kemuliaan Allah dan kemampuan-Nya dari keburukan yang aku temui) '.\" Utsman berkata, \"Lalu aku melakukan hal tersebut, maka Allah 'azza wajalla menghilangkan apa yang ada padaku, dan aku selalu memerintahkan keluargaku dan yang lainnya untuk mengucapkannya.\""
            },
            {
                "number": 3315,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ خَالِدِ بْنِ مَوْهَبٍ الرَّمْلِيُّ حَدَّثَنَا اللَّيْثُ عَنْ زِيَادَةَ بِنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ عَنْ فَضَالَةَ بْنِ عُبَيْدٍ عَنْ أَبِي الدَّرْدَاءِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ اشْتَكَى مِنْكُمْ شَيْئًا أَوْ اشْتَكَاهُ أَخٌ لَهُ فَلْيَقُلْ رَبَّنَا اللَّهُ الَّذِي فِي السَّمَاءِ تَقَدَّسَ اسْمُكَ أَمْرُكَ فِي السَّمَاءِ وَالْأَرْضِ كَمَا رَحْمَتُكَ فِي السَّمَاءِ فَاجْعَلْ رَحْمَتَكَ فِي الْأَرْضِ اغْفِرْ لَنَا حُوبَنَا وَخَطَايَانَا أَنْتَ رَبُّ الطَّيِّبِينَ أَنْزِلْ رَحْمَةً مِنْ رَحْمَتِكَ وَشِفَاءً مِنْ شِفَائِكَ عَلَى هَذَا الْوَجَعِ فَيَبْرَأَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Khalid bin Mauhib Ar Ramli] telah menceritakan kepada kami [Al Laits] dari [Ziyadah bin Muhammad] dari [Muhammad bin Ka'b Al Qurazhi] dari [Fadlalah bin 'Ubaid] dari [Abu Darda] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa di antara kalian mengeluhkan sesuatu atau saudaranya mengeluhkannya, maka hendaknya ia mengucapkan: RABBANALLAAHULLADZII FIS SAMAA`I TAQADDASA ISMUKA AMRUKA FIS SAMAA`I WAL ARDLI KAMAA RAHMATUKA FIS SAMAA`I, FAJ'AL RAHMATAKA FIL ARDLI, IGHFIR LANAA HUUBANAA WA KHATHAAYAANAA, ANTA RABBUTH THAYYIBIINA, ANZIL RAHMATAN MIN RAHMATIKA WA SYIFAA`AN MIN SYIFAA`IKA 'ALAA HAADZAL WAJA'I (Tuhanku adalah Allah yang berada di langit, Maha Suci nama-Mu, urusan-Mu berada di langit dan bumi. Sebagaimana rahmat-Mu berada di langit, maka jadikanlah rahmat-Mu berada di bumi! Ampunilah dosa dan kesalahan kami! Engkau Tuhan orang-orang yang baik, turunkan rahmat di antara rahmat-Mu, serta kesembuhan di antara kesembuhan-Mu kepada penyakit ini) ' maka ia akan sembuh.\""
            },
            {
                "number": 3316,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُعَلِّمُهُمْ مِنْ الْفَزَعِ كَلِمَاتٍ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ غَضَبِهِ وَشَرِّ عِبَادِهِ وَمِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَنْ يَحْضُرُونِوَكَانَ عَبْدُ اللَّهِ بْنُ عُمَرَ يُعَلِّمُهُنَّ مَنْ عَقَلَ مِنْ بَنِيهِ وَمَنْ لَمْ يَعْقِلْ كَتَبَهُ فَأَعْلَقَهُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Muhammad bin Ishaq] dari ['Amru bin Syu'aib] dari [Ayahnya] dari [Kakeknya] bahwa Rasulullah shallallahu 'alaihi wasallam pernah mengajari mereka beberapa kalimat karena adanya rasa takut, yaitu: A'UUDZU BIKALIMAATILLAAHIT TAAMMATI MIN GHADLABIHI WA SYARRI 'IBAADIHI WA MIN HAMAZAATISY SYAYAATHIINI WA AN YAHDLURUUNA (Aku berlindung kepada kalimat-kalimat Allah yang sempurna dari kemurkaan-Nya serta kejahatan para hamba-Nya, dan dari bisikan setan serta kedatangan mereka kepadaku) '. Abdullah bin Umar mengajarkan kalimat-kalimat tersebut kepada orang yang telah berakal di antara anak-anaknya serta orang yang belum berakal. Ia menulisnya dan menggantungkannya kepadanya.\""
            },
            {
                "number": 3317,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ أَبِي سُرَيْجٍ الرَّازِيُّ أَخْبَرَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي عُبَيْدٍ قَالَرَأَيْتُ أَثَرَ ضَرْبَةٍ فِي سَاقِ سَلَمَةَ فَقُلْتُ مَا هَذِهِ قَالَ أَصَابَتْنِي يَوْمَ خَيْبَرَ فَقَالَ النَّاسُ أُصِيبَ سَلَمَةُ فَأُتِيَ بِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَفَثَ فِيَّ ثَلَاثَ نَفَثَاتٍ فَمَا اشْتَكَيْتُهَا حَتَّى السَّاعَةِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abu Suraih Ar Razi] telah mengabarkan kepada kami [Makki bin Ibrahim] telah menceritakan kepada kami [Yazid bin 'Ubaid] ia berkata, \"Aku melihat pengaruh pukulan pada betis [Salamah], lalu aku katakan, 'Apakah ini? ' Ia menjawab, 'Aku mendapatkan luka ini saat perang Khaibar. ' Kemudian orang-orang berkata, 'Salamah telah terkena musibah'. Kemudian aku dibawa ke hadapkan Rasulullah shallallahu 'alaihi wasallam. Lalu beliau meludah padaku sebanyak tiga kali, kemudian aku tidak mengeluhkannya hingga saat ini.\""
            },
            {
                "number": 3318,
                "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ رَبِّهِ يَعْنِي ابْنَ سَعِيدٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لِلْإِنْسَانِ إِذَا اشْتَكَى يَقُولُ بِرِيقِهِ ثُمَّ قَالَ بِهِ فِي التُّرَابِ تُرْبَةُ أَرْضِنَا بِرِيقَةِ بَعْضِنَا يُشْفَى سَقِيمُنَا بِإِذْنِ رَبِّنَا",
                "id": "Telah menceritakan kepada kami [Zuhair bin Kharb] dan [Utsman bin Abu Syaibah] mereka berkata; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari ['Abdu Rabbih bin Sa'id] dari ['Amrah] dari [Aisyah] ia berkata, \"Jika ada orang yang mengeluhkan sakit, Nabi shallallahu 'alaihi wasallam meludah ke tanah lalu berdo'a: 'TURBATU ARDHINAA BIRIIQATI BA'DHINAA YUSYFAA SAQIIMUNAA BI IDZNI RABBINAA (Ini adalah debu tanah kami, dengan ludah sebagian kami maka tersembuhkan orang sakit kami dengan izin Tuhan kami) '.\""
            },
            {
                "number": 3319,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ زَكَرِيَّا قَالَ حَدَّثَنِي عَامِرٌ عَنْ خَارِجَةَ بْنِ الصَّلْتِ التَّمِيمِيِّ عَنْ عَمِّهِأَنَّهُ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْلَمَ ثُمَّ أَقْبَلَ رَاجِعًا مِنْ عِنْدِهِ فَمَرَّ عَلَى قَوْمٍ عِنْدَهُمْ رَجُلٌ مَجْنُونٌ مُوثَقٌ بِالْحَدِيدِ فَقَالَ أَهْلُهُ إِنَّا حُدِّثْنَا أَنَّ صَاحِبَكُمْ هَذَا قَدْ جَاءَ بِخَيْرٍ فَهَلْ عِنْدَكَ شَيْءٌ تُدَاوِيهِ فَرَقَيْتُهُ بِفَاتِحَةِ الْكِتَابِ فَبَرَأَ فَأَعْطَوْنِي مِائَةَ شَاةٍ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ فَقَالَ هَلْ إِلَّا هَذَا وَقَالَ مُسَدَّدٌ فِي مَوْضِعٍ آخَرَ هَلْ قُلْتَ غَيْرَ هَذَا قُلْتُ لَا قَالَ خُذْهَا فَلَعَمْرِي لَمَنْ أَكَلَ بِرُقْيَةِ بَاطِلٍ لَقَدْ أَكَلْتَ بِرُقْيَةِ حَقٍّحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي ح و حَدَّثَنَا ابْنُ بَشَّارٍ حَدَّثَنَا ابْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ عَنْ الشَّعْبِيِّ عَنْ خَارِجَةَ بْنِ الصَّلْتِ عَنْ عَمِّهِ أَنَّهُ مَرَّ قَالَ فَرَقَاهُ بِفَاتِحَةِ الْكِتَابِ ثَلَاثَةَ أَيَّامٍ غُدْوَةً وَعَشِيَّةً كُلَّمَا خَتَمَهَا جَمَعَ بُزَاقَهُ ثُمَّ تَفَلَ فَكَأَنَّمَا أُنْشِطَ مِنْ عِقَالٍ فَأَعْطَوْهُ شَيْئًا فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ ذَكَرَ مَعْنَى حَدِيثِ مُسَدَّدٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Zakaria] ia berkata; telah menceritakan kepadaku ['Amir] dari [Kharijah bin Ash Shalt At Tamimi] dari [Pamannya] bahwa ia datang kepada Rasulullah shallallahu 'alaihi wasallam lalu masuk Islam, kemudian kembali dari sisinya dan melewati sebuah kaum yang pada mereka terdapat orang gila yang diikat dengan sebuah besi. Keluarganya lalu berkata, \"Telah sampai kabar kepada kami bahwa sahabat kalian ini datang dengan membawa kebaikan, apakah kalian memiliki sesuatu yang dapat engkau gunakan untuk mengobati? ' Lalu aku menjampinya menggunakan Surat Al Fatihah sehingga orang itu pun sembuh. Kemudian mereka memberiku seratus ekor kambing. Setelah itu aku datang kepada Rasulullah shallallahu 'alaihi wasallam dan mengabarkan hal tersebut, beliau lantas bertanya: \"Apakah engkau hanya mengucapkan ini?\" Musaddad pada tempat yang lain menyebutkan, 'Apakah engkau mengucapkan selain hal ini? ' Maka aku jawab, \"Tidak.\" Beliau lalu bersabda: \"Demi Dzat yang memanjangkan umurku, ambillah! Sungguh, orang makan dengan jampi batil sedangkan engkau makan dengan jampi yang benar.\" Telah menceritakan kepada kami ['ubaidhullah bin Mu'adz] telah menceritakan kepada kami [Ayahku]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ibnu Basysyar] telah menceritakan kepada kami [Ibnu Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abdullah bin Abu As Safar] dari [Asy Sya'bi] dari [Kharijah bin Ash Shalt] dari [Pamannya] bahwa ia lewat, Kharijah berkata, \"Kemudian ia menjampi orang tersebut menggunakan Surat Al Fatihah selama tiga hari pagi dan sore, setiap kali ia menyelesaikannya maka ia mengumpulkan ludahnya kemudian meludah. Maka orang tersebut seolah-olah telah terbebas dari ikatan, kemudian mereka memberinya sesuatu. Lalu ia datang kepada Nabi shallallahu 'alaihi wasallam… lalu ia menyebutkan makna hadits Musaddad.\""
            },
            {
                "number": 3320,
                "arab": "حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ حَدَّثَنَا بَقِيَّةُ حَدَّثَنِي الزُّبَيْدِيُّ عَنْ الزُّهْرِيِّ عَنْ طَارِقٍ يَعْنِي ابْنَ مَخَاشِنٍ عَنْ أَبِي هُرَيْرَةَ قَالَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَدِيغٍ لَدَغَتْهُ عَقْرَبٌ قَالَ فَقَالَ لَوْ قَالَ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ شَرِّ مَا خَلَقَ لَمْ يُلْدَغْ أَوْ لَمْ يَضُرَّهُ",
                "id": "Telah menceritakan kepada kami [Haiwah bin Syuraih] telah menceritakan kepada kami [Baqiyyah] telah menceritakan kepadaku [Az Zubaidi] dari [Az Zuhri] dari [Thariq bin Makhasyin] dari [Abu Hurairah] ia berkata, \"Seorang laki-laki yang terkena sengatan kalajengking datang menemui Nabi shallallahu 'alaihi wasallam.\" Abu Hurairah berkata, \"Kemudian beliau bersabda: \"Seandainya ia mengucapkan A'UUDZU BIKALIMAATILLAAHIT TAAMMAATI MIN SYARRI MAA KHALAQ (Aku berlindung kepada kalimat-kalimat Allah yang sempurna dari keburukan makhluk yang Allah ciptakan) ', maka ia tidak akan tersengat, atau kalajengking tersebut tidak akan membahayakannya.\""
            },
            {
                "number": 3321,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي بِشْرٍ عَنْ أَبِي الْمُتَوَكِّلِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَهْطًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْطَلَقُوا فِي سَفْرَةٍ سَافَرُوهَا فَنَزَلُوا بِحَيٍّ مِنْ أَحْيَاءِ الْعَرَبِ فَقَالَ بَعْضُهُمْ إِنَّ سَيِّدَنَا لُدِغَ فَهَلْ عِنْدَ أَحَدٍ مِنْكُمْ شَيْءٌ يَنْفَعُ صَاحِبَنَا فَقَالَ رَجُلٌ مِنْ الْقَوْمِ نَعَمْ وَاللَّهِ إِنِّي لَأَرْقِي وَلَكِنْ اسْتَضَفْنَاكُمْ فَأَبَيْتُمْ أَنْ تُضَيِّفُونَا مَا أَنَا بِرَاقٍ حَتَّى تَجْعَلُوا لِي جُعْلًا فَجَعَلُوا لَهُ قَطِيعًا مِنْ الشَّاءِ فَأَتَاهُ فَقَرَأَ عَلَيْهِ أُمَّ الْكِتَابِ وَيَتْفُلُ حَتَّى بَرَأَ كَأَنَّمَا أُنْشِطَ مِنْ عِقَالٍ قَالَ فَأَوْفَاهُمْ جُعْلَهُمْ الَّذِي صَالَحُوهُمْ عَلَيْهِ فَقَالُوا اقْتَسِمُوا فَقَالَ الَّذِي رَقَى لَا تَفْعَلُوا حَتَّى نَأْتِيَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَسْتَأْمِرَهُ فَغَدَوْا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرُوا لَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَيْنَ عَلِمْتُمْ أَنَّهَا رُقْيَةٌ أَحْسَنْتُمْ اقْتَسِمُوا وَاضْرِبُوا لِي مَعَكُمْ بِسَهْمٍ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Bisyr] dari [Abu Al Mutawakkil] dari [Abu Sa'id Al Khudri] bahwa beberapa sahabat Nabi shallallahu 'alaihi wasallam pergi dalam suatu perjalanan yang mereka lakukan. Kemudian mereka singgah di sebuah kampung Arab, sebagian penduduk kampung tersebut lalu berkata, \"Sesungguhnya pemimpin kami tersengat, apakah salah seorang di antara kalian memiliki sesuatu yang bermanfaat bagi sahabat kami tersebut?\" Kemudian salah seorang dari para sahabat tersebut menjawab, \"Ya. Demi Allah, sesungguhnya aku akan menjampi, akan tetapi kami telah meminta kalian agar menjamu kami namun kalian menolak untuk menjadikan kami sebagai tamu. Aku tidak akan menjampi hingga kalian memberikan hadiah kepadaku.\" Penduduk kampung tersebut kemudian memberikan hadiah sekumpulan kambing kepadanya, lalu sahabat tersebut datang kepada orang yang tersengat dan membacakan Surat Al Fatihah kepadanya, lalu meniupkan hingga orang tersebut sembuh seolah-olah telah terbebas dari ikatan.\" Abu Sa'id Al Khudri berkata, \"Kemudian mereka memenuhi janjinya untuk memberikan hadiah kepada para sahabat sebagaimana yang mereka janjikan. Kemudian para sahabat berkata, \"Bagilah kambing-kambing tersebut!\" Lalu sahabat yang telah membacakan jampi mengatakan, \"Kalian jangan melakukannya hingga kita datang kepada Rasulullah shallallahu 'alaihi wasallam dan minta pertimbangannya.\" Lalu mereka pergi menemui Rasulullah shallallahu 'alaihi wasallam dan menyebutkan hal tersebut kepada beliau. Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Dari mana kalian mengetahui bahwa Al Fatihah adalah jampi? Kalian telah berbuat baik, bagilah dan berilah aku bagian bersama kalian.\""
            },
            {
                "number": 3322,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا اشْتَكَى يَقْرَأُ فِي نَفْسِهِ بِالْمُعَوِّذَاتِ وَيَنْفُثُ فَلَمَّا اشْتَدَّ وَجَعُهُ كُنْتُ أَقْرَأُ عَلَيْهِ وَأَمْسَحُ عَلَيْهِ بِيَدِهِ رَجَاءَ بَرَكَتِهَا",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Ibnu Syihab] dari ['Urwah] dari [Aisyah] isteri Nabi shallallahu 'alaihi wasallam, bahwa Rasulullah shallallahu 'alaihi wasallam apabila sakit maka beliau membacakan surat-surat mu'awwidzat (minta perlindungan) dan meniupkannya. Ketika sakit beliau semakin keras, maka aku yang membacakan kepada beliau dan aku usapkan kepadanya dengan tangan beliau, dengan harapan mendapatkan berkahnya.\""
            },
            {
                "number": 3323,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا نُوحُ بْنُ يَزِيدَ بْنِ سَيَّارٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْأَرَادَتْ أُمِّي أَنْ تُسَمِّنَنِي لِدُخُولِي عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ أَقْبَلْ عَلَيْهَا بِشَيْءٍ مِمَّا تُرِيدُ حَتَّى أَطْعَمَتْنِي الْقِثَّاءَ بِالرُّطَبِ فَسَمِنْتُ عَلَيْهِ كَأَحْسَنِ السَّمْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] telah menceritakan kepada kami [Nuh bin Yazid bin Sayyar] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Muhammad bin Ishaq] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anha, ia berkata, \"Ibuku ingin aku terlihat gemuk (segar) saat aku bertemu Rasulullah shallallahu 'alaihi wasallam, namun aku tidak menerima apapun yang diinginkannya hingga ia memberiku makan mentimun dengan ruthab (kurma segar). Kemudian aku menjadi tampak gemuk (segar) dengan bentuk yang edial.\""
            },
            {
                "number": 3324,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ حَكِيمٍ الْأَثْرَمِ عَنْ أَبِي تَمِيمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَتَى كَاهِنًا قَالَ مُوسَى فِي حَدِيثِهِ فَصَدَّقَهُ بِمَا يَقُولُ ثُمَّ اتَّفَقَا أَوْ أَتَى امْرَأَةً قَالَ مُسَدَّدٌ امْرَأَتَهُ حَائِضًا أَوْ أَتَى امْرَأَةً قَالَ مُسَدَّدٌ امْرَأَتَهُ فِي دُبُرِهَا فَقَدْ بَرِئَ مِمَّا أُنْزِلَ عَلَى مُحَمَّدٍ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad]. (dalam jalur lain disebutkan) Telah diriwayatkan [Musaddad] telah menceritakan kepada kami [Yahya] dari [Hammad bin Salamah] dari [Hakim Al Atsram] dari [Abu Tamimah] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mendatangi seorang dukun -Musa menyebutkan dalam haditsnya- kemudian membenarkan apa yang ia katakan -kemudian keduanya sepakat pada lafadz-, atau mendatangi seorang wanita -Musaddad menyebutkan-, isterinya saat haid, atau mendatangi wanita -Musaddad menyebutkan; mendatangi istrinya lewat dubur-, maka ia telah berlepas diri dari apa yang telah diturunkan kepada Muhammad.\""
            },
            {
                "number": 3325,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُسَدَّدٌ الْمَعْنَى قَالَا حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ بْنِ الْأَخْنَسِ عَنْ الْوَلِيدِ بْنِ عَبْدِ اللَّهِ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اقْتَبَسَ عِلْمًا مِنْ النُّجُومِ اقْتَبَسَ شُعْبَةً مِنْ السِّحْرِ زَادَ مَا زَادَ",
                "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Musaddad] secara makna, mereka berkata; telah menceritakan kepada kami [Yahya] dari ['ubaidhullah bin Al Akhnas] dari [Al Walid bin Abdullah] dari [Yusuf bin Mahik] dari [Ibnu Abbas] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa mempelajari ilmu nujum, maka ia telah mempelajari bagian dari sihir.\" Beliau menambah celaannya dengan apa yang beliau tambahkan. "
            },
            {
                "number": 3326,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ أَنَّهُ قَالَصَلَّى لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ بِالْحُدَيْبِيَةِ فِي إِثْرِ سَمَاءٍ كَانَتْ مِنْ اللَّيْلِ فَلَمَّا انْصَرَفَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ هَلْ تَدْرُونَ مَاذَا قَالَ رَبُّكُمْ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ قَالَ أَصْبَحَ مِنْ عِبَادِي مُؤْمِنٌ بِي وَكَافِرٌ فَأَمَّا مَنْ قَالَ مُطِرْنَا بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَذَلِكَ مُؤْمِنٌ بِي كَافِرٌ بِالْكَوْكَبِ وَأَمَّا مَنْ قَالَ مُطِرْنَا بِنَوْءِ كَذَا وَكَذَا فَذَلِكَ كَافِرٌ بِي مُؤْمِنٌ بِالْكَوْكَبِ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dan [Shalih bin Kaisan] dari ['ubaidhullah bin Abdullah] dari [Zaid bin Khalid Al Juhani] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah melakukan sholat Subuh mengimami kami di Hudaibiyah pada bekas hujan yang terjadi pada malam hari. Selesai sholat beliau menghadap ke arah orang-orang dan berkata: \"Apakah kalian mengetahui apa yang dikatakan Tuhan kalian?\" Mereka menjawab, \"Allah dan Rasul-Nya lebih mengetahuinya.\" Beliau bersabda: \"Allah berfirman: 'Pada pagi ini di antara para hamba-ku ada yang beriman kepada-ku dan ada yang kafir. Adapun orang yang mengatakan, 'Hujan turun hujan kepada kami dengan karena Allah dan rahmat-Nya', maka orang tersebut adalah orang yang beriman kepada-ku dan kafir kepada bintang. Adapun orang yang mengatakan, 'Hujan turun kepada kami berkat bintang ini dan ini', maka orang tersebut adalah orang yang kafir kepada-ku dan beriman kepada kepada bintang'.\""
            },
            {
                "number": 3327,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى حَدَّثَنَا عَوُفٌ حَدَّثَنَا حَيَّانُ قَالَ غَيْر مُسَدَّدٍ حَيَانُ بْنُ الْعَلَاءِ حَدَّثَنَا قَطَنُ بْنُ قَبِيصَةَ عَنْ أَبِيهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْعِيَافَةُ وَالطِّيَرَةُ وَالطَّرْقُ مِنْ الْجِبْتِ الطَّرْقُ الزَّجْرُ وَالْعِيَافَةُ الْخَطُّ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] telah menceritakan kepada kami ['Auf] telah menceritakan kepada kami [Hayyan] -selain Musaddad menyebut; Hayyan bin Al 'Ala- Telah menceritakan kepada kami [Qathan bin Qabishah] dari [Ayahnya] ia berkata, \"Aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"'Iyafah, thiyarah dan tharq adalah termasuk jibt. Tharq adalah hardikan dan Iyafah adalah garis.\" "
            },
            {
                "number": 3328,
                "arab": "حَدَّثَنَا ابْنُ بَشَّارٍ قَالَ قَالَ مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ عَوْفٌالْعِيَافَةُ زَجْرُ الطَّيْرِ وَالطَّرْقُ الْخَطُّ يُخَطُّ فِي الْأَرْضِ",
                "id": "Telah menceritakan kepada kami [Ibnu Basysysar] ia berkata; telah berkata [Muhammad bin Ja'far] ['Auf] berkata, \"'Iyafah adalah menghardik burung, sedangkan tharq adalah garis yang dibuat di tanah.\""
            },
            {
                "number": 3329,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ الْحَجَّاجِ الصَّوَّافِ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ هِلَالِ بْنِ أَبِي مَيْمُونَةَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ مُعَاوِيَةَ بْنِ الْحَكَمِ السُّلَمِيِّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ وَمِنَّا رِجَالٌ يَخُطُّونَ قَالَ كَانَ نَبِيٌّ مِنْ الْأَنْبِيَاءِ يَخُطُّ فَمَنْ وَافَقَ خَطَّهُ فَذَاكَ",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Al Hajjaj Ash Shawwaf] telah menceritakan kepadaku [Yahya bin Abu Katsir] dari [Hilal bin Abu Maimunah] dari ['Atha bin Yasar] dari [Mu'awiyah bin Al Hakam As Sulami] ia berkata, \"Aku katakan, \"Wahai Rasulullah, di antara kami ada orang-orang yang menggambar garis?\" Beliau bersabda: \"Di antara para Nabi ada yang membuat garis, maka barangsiapa yang garisnya sama dengan garis nabi tersebut maka hal itu adalah diperbolehkan.\" "
            },
            {
                "number": 3330,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنَا سُفْيَانُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ عَيْسَى بْنِ عَاصِمٍ عَنْ زِرِ بْنِ حُبَيْشٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الطِّيَرَةُ شِرْكٌ الطِّيَرَةُ شِرْكٌ ثَلَاثًا وَمَا مِنَّا إِلَّا وَلَكِنَّ اللَّهَ يُذْهِبُهُ بِالتَّوَكُّلِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepadaku [Sufyan] dari [Salamah bin Kuhail] dari [Isa bin 'Ashim] dari [Zir bin Hubaisy] dari [Abdullah bin Mas'ud] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Thiyarah adalah syirik, thiyarah adalah syirik -tiga kali-. Tidaklah di antara kita kecuali beranggapan seperti itu, akan tetapi Allah menghilangkannya dengan tawakal.\""
            },
            {
                "number": 3331,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُتَوَكِّلِ الْعَسْقَلَانِيُّ وَالْحَسَنُ بْنُ عَلِيٍّ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا عَدْوَى وَلَا طِيَرَةَ وَلَا صَفَرَ وَلَا هَامَّةَ فَقَالَ أَعْرَابِيٌّ مَا بَالُ الْإِبِلِ تَكُونُ فِي الرَّمْلِ كَأَنَّهَا الظِّبَاءُ فَيُخَالِطُهَا الْبَعِيرُ الْأَجْرَبُ فَيُجْرِبُهَا قَالَ فَمَنْ أَعْدَى الْأَوَّلَقَالَ مَعْمَرٌ قَالَ الزُّهْرِيُّ فَحَدَّثَنِي رَجُلٌ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يُورِدَنَّ مُمْرِضٌ عَلَى مُصِحٍّ قَالَ فَرَاجَعَهُ الرَّجُلُ فَقَالَ أَلَيْسَ قَدْ حَدَّثَنَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا عَدْوَى وَلَا صَفَرَ وَلَا هَامَةَ قَالَ لَمْ أُحَدِّثْكُمُوهُ قَالَ الزُّهْرِيُّ قَالَ أَبُو سَلَمَةَ قَدْ حَدَّثَ بِهِ وَمَا سَمِعْتُ أَبَا هُرَيْرَةَ نَسِيَ حَدِيثًا قَطُّ غَيْرَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutawakkil Al 'Asqalani] dan [Al Hasan bin Ali] mereka berkata; telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada 'adwa, thiyarah, shafar, dan tidak ada hammah.\" Seorang Arab badui lalu berkata, \"Kenapa seekor unta yang ada gurun pasir seperti kijang, kemudian bercampur dengan unta yang terkena penyakit kurap lalu ia tertular penyakit kurap?\" Beliau menjawab: \"(Jika begitu) siapakah yang menularkannya kepada yang pertama?\" Ma'mar berkata; Az Zuhri berkata; telah menceritakan kepadaku seorang laki-laki dari Abu Hurairah bahwa ia pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah orang yang memiliki unta yang sakit mendatangkannya kepada orang yang memiliki unta yang sehat!\" Kemudian orang tersebut kembali kepadanya dan berkata, \"Bukankah ia telah menceritakan kepada kita bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada 'Adwa, thiyarah, shafar dan tidak ada hammah.\" Abu Hurairah berkata, \"Aku belum pernah menceritakannya kepada kalian.\" [Az Zuhri] berkata; [Abu Salamah] berkata, \"Abu Hurairah telah menceritakannya dan aku tidak pernah mendengar ia lupa kepada suatu hadits pun selian hadits tersebut.\" "
            },
            {
                "number": 3332,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ بْنِ الْبَرْقِيِّ أَنَّ سَعِيدَ بْنَ الْحَكَمِ حَدَّثَهُمْ قَالَ أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنِي ابْنُ عَجْلَانَ حَدَّثَنِي الْقَعْقَاعُ بْنُ حَكِيمٍ وَعُبَيْدُ اللَّهِ بْنُ مِقْسَمٍ وَزَيدُ بْنُ أَسْلَمَ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا غُولَقَالَ أَبُو دَاوُد قُرِئَ عَلَى الْحَارِثِ بْنِ مِسْكِيْنٍ وَأَنَا شَاهِدٌ أَخْبَرَكُمْ أَشْهَبُ قَالَ سُئِلَ مَالِكٌ عَنْ قَوْلِهِ لَا صَفَرَ قَالَ إِنَّ أَهْلَ الْجَاهِلِيَّةِ كَانُوا يُحِلُّونَ صَفَرَ يُحِلُّونَهُ عَامًا وَيُحَرِّمُونَهُ عَامًا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَفَرَ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى حَدَّثَنَا بَقِيَّةُ قَالَ قُلْتُ لِمُحَمَّدٍ يَعْنِي ابْنَ رَاشِدٍ قَوْلُهُ هَامَ قَالَ كَانَتْ الْجَاهِلِيَّةُ تَقُولُ لَيْسَ أَحَدٌ يَمُوتُ فَيُدْفَنُ إِلَّا خَرَجَ مِنْ قَبْرِهِ هَامَةٌ قُلْتُ فَقَوْلُهُ صَفَرَ قَالَ سَمِعْتُ أَنَّ أَهْلَ الْجَاهِلِيَّةِ يَسْتَشْئِمُونَ بِصَفَرٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا صَفَرَ قَالَ مُحَمَّدٌ وَقَدْ سَمِعْنَا مَنْ يَقُولُ هُوَ وَجَعٌ يَأْخُذُ فِي الْبَطْنِ فَكَانُوا يَقُولُونَ هُوَ يُعْدِي فَقَالَ لَا صَفَرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdurrahim bin Al Barqi] bahwa [Sa'id bin Al Hakam] telah menceritakan kepada mereka, ia berkata; telah mengabarkan kepada kami [Yahya bin Ayyub] telah menceritakan kepadaku [Ibnu 'Ajlan] telah menceritakan kepadaku [Al Qa'qa' bin Hakim] dan ['ubaidhullah bin Miqsam] dan [Zaid bin Aslam] dari [Abu Shalih] dari [Abu Hurairah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada ghul (yang dapat menyesatkan seseorngpun).\" Abu Daud berkata; telah dibacakan di hadapan [Al Harits bin Miskin] -sementara aku menyaksikan- telah mengabarkan kepada kalian [Asyhab] ia berkata; [Malik] pernah ditanya mengenai sabda beliau 'Tidak ada shafar', maka ia menjawab, \"Sesungguhnya orang-orang jahiliyah dahulu menghalalkan bulan Shafar satu tahun dan mengharamkannya satu tahun. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: 'Tidak ada shafar'. Telah menceritakan kepada kami [Muhammad bin Al Mushaffa] telah menceritakan kepada kami [Baqiyyah] ia berkata, \"Aku tanyakan kepada [Muhammad bin Rasyid], \"Bagaimana dengan kata 'haam'? Ia menjawab, \"Orang-orang jahiliyah dulu mengatakan, 'Tidaklah orang yang meninggal kemudian dikubur melainkan keluar serangga berbisa dari kuburnya'. Aku tanyakan lagi, \"Bagaimana dengan kata, 'Shafar'? Ia menjawab, \"Aku pernah mendengar bahwa orang-orang jahiliyah menisbatkan kesialan kepada bulan Shafar.\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada shafar.\" Muhammad berkata, \"Aku mendengar orang yang mengatakan, 'Itu adalah suatu penyakit yang bertempat di dalam perut. Dahulu mereka mengatakan, 'Penyakit tersebut menular'. Maka beliau bersabda: \"Tidak ada shafar.\""
            },
            {
                "number": 3333,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا عَدْوَى وَلَا طِيَرَةَ وَيُعْجِبُنِي الْفَأْلُ الصَّالِحُ وَالْفَأْلُ الصَّالِحُ الْكَلِمَةُ الْحَسَنَةُ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Anas], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak ada 'Adwa dan tidak ada thiyarah, aku tertarik dengan Al fa'l (optimisme) yang baik, dan optimisme yang baik adalah perkataan yang baik.\""
            },
            {
                "number": 3334,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا ابْنُ جُرَيْجٍ عَنْ عَطَاءٍ قَالَيَقُولُ النَّاسُ الصَّفَرُ وَجَعٌ يَأْخُذُ فِي الْبَطْنِ قُلْتُ فَمَا الْهَامَةُ قَالَ يَقُولُ النَّاسُ الْهَامَةُ الَّتِي تَصْرُخُ هَامَةُ النَّاسِ وَلَيْسَتْ بِهَامَةِ الْإِنْسَانِ إِنَّمَا هِيَ دَابَّةٌ",
                "id": "Telah menceritakan kepada kami [Yahya bin Khalaf] telah menceritakan kepada kami [Abu 'Ashim] telah menceritakan kepada kami [Ibnu Juraij] dari ['Atha] orang-orang berkata, \"Shafar adalah sebuah penyakit yang ada dalam perut.\" Kemudian aku tanyakan, 'Apakah hamah itu? ' 'Atha melanjutkan, \"Orang-orang menjawab, 'Burung hantu yang berteriak itu sebenarnya arwah orang-orang. ' Padahal itu bukan nyawa manuisa, sesungguhnya hammah adalah binatang melata.\""
            },
            {
                "number": 3335,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ وَأبُو بَكْرِ بْنُ شَيْبَةَ الْمَعْنَى قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ عُرْوَةَ بْنِ عَامِرٍ قَالَ أَحْمَدُ الْقُرَشِيُّ قَالَذُكِرَتْ الطِّيَرَةُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَحْسَنُهَا الْفَأْلُ وَلَا تَرُدُّ مُسْلِمًا فَإِذَا رَأَى أَحَدُكُمْ مَا يَكْرَهُ فَلْيَقُلْ اللَّهُمَّ لَا يَأْتِي بِالْحَسَنَاتِ إِلَّا أَنْتَ وَلَا يَدْفَعُ السَّيِّئَاتِ إِلَّا أَنْتَ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِكَ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] dan [Abu Bakr bin Syaibah] secara makna, mereka berkata; telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Habib bin Abu Tsabit] dari ['Urwah bin 'Amir], Ahmad Al Qurasyi berkata, \"Telah disebutkan thiyarah di sisi Nabi shallallahu 'alaihi wasallam, kemudian beliau bersabda: \"Yang terbaik adalah sikap optimisme, dan thiyarah tidak boleh menahan kehendak seorang muslim. Apabila salah seorang di antara kalian melihat apa yang ia tidak sukai, maka hendaknya ia mengucapkan: ALLAAHUMMA LAA YA`TII BILHASANAATI ILLAA ANTA WA LAA YADFA'USSAYYIAATI ILLAA ANTA, WA LAA HAULA WA LAA QUWWATA ILLAA BIKA (Ya Allah, tidak ada yang mendatangkan kebaikan kecuali Engkau, dan tidak ada yang dapat menolak keburukan kecuali Engkau, dan tidak ada daya serta kekuatan kecuali karena-Mu) '.\""
            },
            {
                "number": 3336,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَتَطَيَّرُ مِنْ شَيْءٍ وَكَانَ إِذَا بَعَثَ عَامِلًا سَأَلَ عَنْ اسْمِهِ فَإِذَا أَعْجَبَهُ اسْمُهُ فَرِحَ بِهِ وَرُئِيَ بِشْرُ ذَلِكَ فِي وَجْهِهِ وَإِنْ كَرِهَ اسْمَهُ رُئِيَ كَرَاهِيَةُ ذَلِكَ فِي وَجْهِهِ وَإِذَا دَخَلَ قَرْيَةً سَأَلَ عَنْ اسْمِهَا فَإِنْ أَعْجَبَهُ اسْمُهَا فَرِحَ وَرُئِيَ بِشْرُ ذَلِكَ فِي وَجْهِهِ وَإِنْ كَرِهَ اسْمَهَا رُئِيَ كَرَاهِيَةُ ذَلِكَ فِي وَجْهِهِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Abdullah bin Buraidah] dari [Ayahnya], bahwa Nabi shallallahu 'alaihi wasallam tidak melakukan tathuyyur dari sesuatupun, beliau apabila telah mengutus seorang pekerja maka beliau bertanya mengenai namanya, apabila tertarik dengan namanya maka beliau senang dan terlihat kesenangan kepada hal tersebut pada wajah beliau. Dan apabila tidak menyukai namanya maka terlihat ketidak senangan kepada hal tersebut pada wajah beliau. Apabila beliau memasuki sebuah kampung maka beliau bertanya mengenai namanya, apabila tertarik dengan namanya maka beliau senang dan terlihat kesenangan kepada hal tersebut pada wajah beliau. Dan apabila beliau tidak menyukai nama tersebut maka terlihat ketidak senangan kepada hal tersebut pada wajah beliau.\" "
            },
            {
                "number": 3337,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ حَمْزَةَ وَسَالِمٍ ابْنَيْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الشُّؤْمُ فِي الدَّارِ وَالْمَرْأَةِ وَالْفَرَسِقَالَ أَبُو دَاوُد قُرِئَ عَلَى الْحَارِثِ بْنِ مِسْكِينٍ وَأَنَا شَاهِدٌ أَخْبَرَكَ ابْنُ الْقَاسِمِ قَالَ سُئِلَ مَالِكٌ عَنْ الشُّؤْمِ فِي الْفَرَسِ وَالدَّارِ قَالَ كَمْ مِنْ دَارٍ سَكَنَهَا نَاسٌ فَهَلَكُوا ثُمَّ سَكَنَهَا آخَرُونَ فَهَلَكُوا فَهَذَا تَفْسِيرُهُ فِيمَا نَرَى وَاللَّهُ أَعْلَمُ قَالَ أَبُو دَاوُد قَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ حَصِيرٌ فِي الْبَيْتِ خَيْرٌ مِنْ امْرَأَةٍ لَا تَلِدُ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] telah menceritakan kepada kami [Malik] dari [Ibnu Syihab] dari [Hamzah] dan [Salim] keduanya adalah anak Abdullah bin Umar, dari [Abdullah bin Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kesialan ada pada rumah, wanita dan kuda.\" Abu Daud berkata; telah dibacakan sebuah riwayat kepada Al Harits bin Miskin -sementara aku menyaksikan-, telah mengabarkan kepadaku Ibnu Al Qasim ia berkata, \"Malik ditanya mengenai kesialan pada kuda dan rumah. Ia lalu menjawab, \"Betapa banyak rumah yang ditempati orang-orang kemudian mereka binasa, kemudian ditempati orang-orang yang lain, lalu mereka binasa. Ini adalah penafsirannya yang kami lihat. Wallahu 'alam.\" Abu Daud berkata; Umar radliallahu 'anhu berkata, \"Tikar yang ada di rumah lebih baik daripada seorang wanita yang tidak dapat melahirkan.\""
            },
            {
                "number": 3338,
                "arab": "حَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ وَعَبَّاسُ الْعَنْبَرِيُّ قَالَا حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ يَحْيَى بْنُ عَبْدِ اللَّهِ بْنِ بَحِيرٍ قَالَ أَخْبَرَنِي مَنْ سَمِعَ فَرْوَةَ بْنَ مُسَيْكٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَرْضٌ عِنْدَنَا يُقَالُ لَهَا أَرْضُ أَبْيَنَ هِيَ أَرْضُ رِيفِنَا وَمِيرَتِنَا وَإِنَّهَا وَبِئَةٌ أَوْ قَالَ وَبَاؤُهَا شَدِيدٌ فَقَالَ النَّبِيُّ دَعْهَا عَنْكَ فَإِنَّ مِنْ الْقَرَفِ التَّلَفَ",
                "id": "Telah menceritakan kepada kami [Makhlad bin Khalid] serta [Abbas Al 'Anbari] mereka berkata; telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Yahya bin Abdullah bin Bahir] ia berkata; telah mengabarkan kepadaku [orang yang telah] mendengar [Farwah bin Musaik] berkata; aku katakan; wahai Rasulullah, lahan kami yang bernama tanah Abyan adalah tanah yang memiliki tanaman serta subur, tanah ladang kami, sesungguhnya tanah tersebut berwabah... -atau dia mengatakan; wabahnya keras- kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Tinggalkan tanah tersebut, sesungguhnya bersinggungan dengan penyakit adalah kebinasaan.\""
            },
            {
                "number": 3339,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا مُفَضَّلُ بْنُ فَضَالَةَ عَنْ حَبِيبِ بْنِ الشَّهِيدِ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ بِيَدِ مَجْذُومٍ فَوَضَعَهَا مَعَهُ فِي الْقَصْعَةِ وَقَالَ كُلْ ثِقَةً بِاللَّهِ وَتَوَكُّلًا عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Yunus bin Muhammad] telah menceritakan kepada kami [Mufadldlal bin Fadlalah] dari [Habib bin Asy Syahid] dari [Muhammad bin Al Munkadir] dari [Jabir], bahwa Rasulullah shallallahu 'alaihi wasallam menggandeng tangan orang yang menderita penyakit kusta, kemudian beliau meletakkan tangan orang tersebut di atas nampan seraya bersabda: \"Makanlah dengan percaya kepada Allah dan bertawakal kepada-Nya.\""
            },
            {
                "number": 3340,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو بَدْرٍ حَدَّثَنِي أَبُو عُتْبَةَ إِسْمَعِيلُ بْنُ عَيَّاشٍ حَدَّثَنِي سُلَيْمَانُ بْنُ سُلَيْمٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُكَاتَبُ عَبْدٌ مَا بَقِيَ عَلَيْهِ مِنْ مُكَاتَبَتِهِ دِرْهَمٌ",
                "id": "Telah menceritakan kepada kami [Harun bin Abdullah] telah menceritakan kepada kami [Abu Badr] telah menceritakan kepadaku [Abu 'Utbah Isma'il bin 'Ayyasy] telah menceritakan kepadaku [Sulaiman bin Sulaim] dari ['Amru bin Syu'aib] dari [Bapaknya] dari [Kakeknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang mukatab tetap sebagai seorang budak selama ia belum menyelesaikan tanggungan pembebasannya meskipun satu dirham.\" "
            },
            {
                "number": 3341,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنِي عَبْدُ الصَّمَدِ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا عَبَّاسٌ الْجُرَيْرِيُّ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا عَبْدٍ كَاتَبَ عَلَى مِائَةِ أُوقِيَّةٍ فَأَدَّاهَا إِلَّا عَشْرَةَ أَوَاقٍ فَهُوَ عَبْدٌ وَأَيُّمَا عَبْدٍ كَاتَبَ عَلَى مِائَةِ دِينَارٍ فَأَدَّاهَا إِلَّا عَشْرَةَ دَنَانِيرَ فَهُوَ عَبْدٌقَالَ أَبُو دَاوُد لَيْسَ هُوَ عَبَّاسٌ الْجُرَيْرِيُّ قَالُوا هُوَ وَهْمٌ وَلَكِنَّهُ هُوَ شَيْخٌ آخَرُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepadaku [Abdushshamad] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami ['Abbas Al Jurairi] dari ['Amru bin Syu'aib] dari [Ayahnya] dari [Kakeknya], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Budak manasaja yang mengadakan perjanjian pembebasan dirinya seharga seratus uqiyah, kemudian ia telah menyelesaikan semua membayarnya kecuali sepuluh uqiyah, maka ia tetap sebagai budak. Dan budak manasaja yang mengadakan perjanjian pembebasan dirinya dengan harga seratus dinar, kemudian ia telah menyelesaikan semua pembayarannya kecuali sepuluh dinar, maka ia tetap sebagai budak.\" Abu Daud berkata, \"Ia bukanlah Abbas Al Jurairi, yang mereka katakan hanyalah peraduka, yang benar bahwa ia adalah syaikh yang lain.\" "
            },
            {
                "number": 3342,
                "arab": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا سُفْيَانُ عَنْ الزُّهْرِيِّ عَنْ نَبْهَانَ مُكَاتَبِ أُمِّ سَلَمَةَ قَالَ سَمِعْتُ أُمَّ سَلَمَةَ تَقُولُقَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ كَانَ لِإِحْدَاكُنَّ مُكَاتَبٌ فَكَانَ عِنْدَهُ مَا يُؤَدِّي فَلْتَحْتَجِبْ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Musaddad bin Musarhad] telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Nabhan] seorang budak yang ingin membebaskan dirinya milik Ummu Salamah, ia berkata, \"Aku pernah mendengar [Ummu Salamah] berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah berkata kepada kami: \"Apabila salah seorang di antara kalian memiliki budak mukatab dan budak tersebut memiliki sesuatu yang dapat ia bayarkan, maka hendaknya ia memasang hijab darinya.\" "
            },
            {
                "number": 3343,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا اللَّيْثُ عَنْ ابْنِ شِهَابٍ عَنْ عُرْوَةَ أَنَّ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَخْبَرَتْهُأَنَّ بَرِيرَةَ جَاءَتْ عَائِشَةَ تَسْتَعِينُهَا فِي كِتَابَتِهَا وَلَمْ تَكُنْ قَضَتْ مِنْ كِتَابَتِهَا شَيْئًا فَقَالَتْ لَهَا عَائِشَةُ ارْجِعِي إِلَى أَهْلِكِ فَإِنْ أَحَبُّوا أَنْ أَقْضِيَ عَنْكِ كِتَابَتَكِ وَيَكُونَ وَلَاؤُكِ لِي فَعَلْتُ فَذَكَرَتْ ذَلِكَ بَرِيرَةُ لِأَهْلِهَا فَأَبَوْا وَقَالُوا إِنْ شَاءَتْ أَنْ تَحْتَسِبَ عَلَيْكِ فَلْتَفْعَلْ وَيَكُونُ لَنَا وَلَاؤُكِ فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ابْتَاعِي فَأَعْتِقِي فَإِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَ ثُمَّ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا بَالُ أُنَاسٍ يَشْتَرِطُونَ شُرُوطًا لَيْسَتْ فِي كِتَابِ اللَّهِ مَنْ اشْتَرَطَ شَرْطًا لَيْسَ فِي كِتَابِ اللَّهِ فَلَيْسَ لَهُ وَإِنْ شَرَطَهُ مِائَةَ مَرَّةٍ شَرْطُ اللَّهِ أَحَقُّ وَأَوْثَقُحَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا وُهَيْبٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ جَاءَتْ بَرِيرَةُ لِتَسْتَعِينَ فِي كِتَابَتِهَا فَقَالَتْ إِنِّي كَاتَبْتُ أَهْلِي عَلَى تِسْعِ أَوَاقٍ فِي كُلِّ عَامٍ أُوقِيَّةٌ فَأَعِينِينِي فَقَالَتْ إِنْ أَحَبَّ أَهْلُكِ أَنْ أَعُدَّهَا عَدَّةً وَاحِدَةً وَأَعْتِقَكِ وَيَكُونَ وَلَاؤُكِ لِي فَعَلْتُ فَذَهَبَتْ إِلَى أَهْلِهَا وَسَاقَ الْحَدِيثَ نَحْوَ الزُّهْرِيِّ زَادَ فِي كَلَامِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي آخِرِهِ مَا بَالُ رِجَالٍ يَقُولُ أَحَدُهُمْ أَعْتِقْ يَا فُلَانُ وَالْوَلَاءُ لِي إِنَّمَا الْوَلَاءُ لِمَنْ أَعْتَقَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dan [Qutaibah bin Sa'id] mereka berkata; telah menceritakan kepada kami [Al Laits] dari [Ibnu Syihab] dari ['Urwah] bahwa [Aisyah] radliallahu 'anhuma mengabarkan kepadanya, bahwa Barirah telah datang kepada Aisyah meminta bantuan kepadanya dalam hal perjanjian pembebasan dirinya, sementara ia tidak mampu melunasi sedikitpun dari perjanjain pembebasannya. Kemudian Aisyah berkata kepadanya, \"Kembalilah kepada tuanmu, jika mereka mau aku melunasi pembayaranmu dan perwaliannya untukku, maka aku akan melakukannya.\" Kemudian Barirah menyebutkan hal tersebut kepada tuannya. Namun mereka menolak dan berkata, \"Apabila Aisyah berkehendak untuk mendapatkan pahala dengan membebaskanmu maka silahkan ia melakukan, dan perwalianmu untuk kami.\" Aisyah kemudian menceritakan hal tersebut kepada Rasulullah shallallahu 'alaihi wasallam. Maka Rasulullah shallallahu 'alaihi wasallam pun berkata kepadanya: \"Beli dan bebaskanlah dia, sesungguhnya perwalian adalah untuk orang yang telah membebaskan.\" Kemudian Rasulullah shallallahu 'alaihi wasallam berdiri dan bersabda: \"Mengapa orang-orang membuat syarat yang tidak ada dalam kitab Allah! Barangsiapa memberikan syarat yang tidak ada dalam kitab Allah, maka tidak ada hak baginya walaupun ia memberikan syarat sebanyak seratus kali. Syarat Allah lebih berhak dan lebih kuat.\" Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Wuhaib] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] radliallahu 'anhuma, ia berkata, \"Barirah telah datang minta bantuan mengenai perjanjian pembebasannya, ia berkata, \"Sesungguhnya aku mengadakan perjanjian pembebasan diriku dengan tuanku seharga sembilan uqiyah, yaitu satu uqiyah untuk setiap tahunnya. Maka bantulah aku!\" Kemudian Aisyah berkata, \"Jika tuanmu ingin aku melunasi pembayaran tersebut, lalu aku bebaskan kamu dan perlianmu juga tetap untukku maka aku akan lakukan.\" Barirah kemudian pergi menemui tuannya…lalu 'Urwah menyebutkan hadits tersebut seperti hadits Az Zuhri. Ia menambahkan pada akhir sabda Nabi shallallahu 'alaihi wasallam: \"Kenapa di antara orang-orang ada seorang laki-laki berkata, 'Bebaskan wahai Fulan, dan perwaliannya milikku' sesungguhnya perwalian adalah milik orang yang membebaskan.\""
            },
            {
                "number": 3344,
                "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ يَحْيَى أَبُو الْأَصْبَغِ الْحَرَّانِيُّ حَدَّثَنِي مُحَمَّدٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ ابْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْوَقَعَتْ جُوَيْرِيَةُ بِنْتُ الْحَارِثِ بْنِ الْمُصْطَلِقِ فِي سَهْمِ ثَابِتِ بْنِ قَيْسِ بْنِ شَمَّاسٍ أَوْ ابْنِ عَمٍّ لَهُ فَكَاتَبَتْ عَلَى نَفْسِهَا وَكَانَتْ امْرَأَةً مَلَّاحَةً تَأْخُذُهَا الْعَيْنُ قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا فَجَاءَتْ تَسْأَلُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي كِتَابَتِهَا فَلَمَّا قَامَتْ عَلَى الْبَابِ فَرَأَيْتُهَا كَرِهْتُ مَكَانَهَا وَعَرَفْتُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَيَرَى مِنْهَا مِثْلَ الَّذِي رَأَيْتُ فَقَالَتْ يَا رَسُولَ اللَّهِ أَنَا جُوَيْرِيَةُ بِنْتُ الْحَارِثِ وَإِنَّمَا كَانَ مِنْ أَمْرِي مَا لَا يَخْفَى عَلَيْكَ وَإِنِّي وَقَعْتُ فِي سَهْمِ ثَابِتِ بْنِ قَيْسِ بْنِ شَمَّاسٍ وَإِنِّي كَاتَبْتُ عَلَى نَفْسِي فَجِئْتُكَ أَسْأَلُكَ فِي كِتَابَتِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَلْ لَكِ إِلَى مَا هُوَ خَيْرٌ مِنْهُ قَالَتْ وَمَا هُوَ يَا رَسُولَ اللَّهِ قَالَ أُؤَدِّي عَنْكِ كِتَابَتَكِ وَأَتَزَوَّجُكِ قَالَتْ قَدْ فَعَلْتُ قَالَتْ فَتَسَامَعَ تَعْنِي النَّاسَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ تَزَوَّجَ جُوَيْرِيَةَ فَأَرْسَلُوا مَا فِي أَيْدِيهِمْ مِنْ السَّبْيِ فَأَعْتَقُوهُمْ وَقَالُوا أَصْهَارُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا رَأَيْنَا امْرَأَةً كَانَتْ أَعْظَمَ بَرَكَةً عَلَى قَوْمِهَا مِنْهَا أُعْتِقَ فِي سَبَبِهَا مِائَةُ أَهْلِ بَيْتٍ مِنْ بَنِي الْمُصْطَلِقِقَالَ أَبُو دَاوُد هَذَا حُجَّةٌ فِي أَنَّ الْوَلِيَّ هُوَ يُزَوِّجُ نَفْسَهُ",
                "id": "Telah menceritakan kepada kami [Abdul Aziz bin Yahya Abu Al Ashbagh Al Harrani] telah menceritakan kepadaku [Muhammad bin Salamah] dari [Ibnu Ishaq] dari [Muhammad bin Ja'far bin Az Zubair] dari ['Urwah bin Az Zubair] dari [Aisyah] radliallahu 'anhuma, ia berkata, \"Juwairiyah binti Al Harits bin Al Mushthaliq menjadi milik Tsabit bin Qais bin Syammas saat pembagian ghanimah, atau pada anak pamannya. Kemudian Juwairiyah mengadakan perjanjian pembebasan dirinya. Ia adalah wanita menawan yang selalu menarik perhatian orang yang memandangnya. Aisyah radliallahu 'anha berkata, \"Kemudian ia datang memohon bantuan kepada Rasulullah shallallahu 'alaihi wasallam dalam hal perjanjian pembebasannya. Ketika ia berdiri di depan pintu dan aku melihatnya, maka aku tidak menyukai posisinya dan aku mengetahui bahwa Rasulullah shallallahu 'alaihi wasallam akan melihat dirinya seperti yang aku lihat. Kemudian Juwairiyah berkata, \"Wahai Rasulullah, aku adalah Juwairiyah binti Al Harits, permasalahanku sudah tuan ketahui. Sungguh, aku telah menjadi milik Tsabit bin Qais bin Syammas dalam pembagian, dan aku telah mengadakan perjanjian pembebasan diriku. Maka aku datang kepadamu memohon pertolongan dalam perjanjian pembebasanku.\" Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Apakah engkau mau mengambil sesuatu yang lebih baik dari hal itu?\" Juwairiyah bertanya, \"Hal apakah itu wahai Rasulullah?\" Beliau bersabda: \"Aku bayarkan perjanjian pembebasanmu dan aku akan menikahimu!\" Jiwairiyah menjawab, \"Aku telah melakukannya (siap).\" Aisyah berkata, \"Kemudian orang-orang mendengar bahwa Rasulullah shallallahu 'alaihi wasallam telah menikahi Juwairiyah, mereka pun melepaskan tawanan yang ada di tangan mereka dan membebaskan mereka. kemudian mereka berkata, \"Para tawanan itu adalah kerabat (besan) Rasulullah shallallahu 'alaihi wasallam. Kami tidak melihat seorang wanita yang lebih besar berkahnya bagi kaumnya dari pada dirinya, sebab karenanya seratus keluarga Bani Mushthaliq dibebaskan.\" Abu Daud berkata, \"Hadits ini adalah hujjah bahwa seorang wali boleh menikahkan dirinya.\""
            },
            {
                "number": 3345,
                "arab": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا عَبْدُ الْوَارِثِ عَنْ سَعِيدِ بْنِ جُمْهَانَ عَنْ سَفِينَةَ قَالَكُنْتُ مَمْلُوكًا لِأُمِّ سَلَمَةَ فَقَالَتْ أُعْتِقُكَ وَأَشْتَرِطُ عَلَيْكَ أَنْ تَخْدُمَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا عِشْتَ فَقُلْتُ وَإِنْ لَمْ تَشْتَرِطِي عَلَيَّ مَا فَارَقْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا عِشْتُ فَأَعْتَقَتْنِي وَاشْتَرَطَتْ عَلَيَّ",
                "id": "Telah menceritakan kepada kami [Musaddad bin Musarhad] telah menceritakan kepada kami [Abdul Warits] dari [Sa'id bin Jumhan] dari [Safinah] ia berkata, \"Aku dahulu adalah seorang budak milik [Ummu Salamah], lalu ia berkata, 'Aku akan membebaskanmu dan aku meminta syarat kepadamu agar melayani Rasulullah shallallahu 'alaihi wasallam selama engkau hidup'. Lalu aku katakan, 'Walaupun engkau tidak mensyaratkan kepadaku, aku tidak akan meninggalkan Rasulullah shallallahu 'alaihi wasallam selama aku hidup. ' Lalu Ummu Salamah membebaskanku dan memberikan syarat kepadaku.\""
            },
            {
                "number": 3346,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ الطَّيَالِسِيُّ حَدَّثَنَا هَمَّامٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ الْمَعْنَى أَخْبَرَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ قَالَ أَبُو الْوَلِيدِ عَنْ أَبِيهِأَنَّ رَجُلًا أَعْتَقَ شِقْصًا لَهُ مِنْ غُلَامٍ فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَيْسَ لِلَّهِ شَرِيكٌ زَادَ ابْنُ كَثِيرٍ فِي حَدِيثِهِ فَأَجَازَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِتْقَهُ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid Ath Thayalisi] telah menceritakan kepada kami [Hammam]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Katsir] secara makna, telah mengabarkan kepada kami [Hammam] dari [Qatadah] dari [Abu Al Malih], Abu Al Walid berkata dari [Ayahnya], bahwa seorang laki-laki telah memerdekakan bagiannya dari seorang budak. Kemudian hal tersebut diceritakan kepada Nabi shallallahu 'alaihi wasallam, maka beliau bersabda: \"Allah tidak memiliki sekutu.\" Ibnu Katsir menambahkan dalam haditsnya, \"Kemudian Nabi shallallahu 'alaihi wasallam memperbolehkan untuk membebaskannya.\""
            },
            {
                "number": 3347,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ أَخْبَرَنِي هَمَّامٌ عَنْ قَتَادَةَ عَنْ النَّضْرِ بْنِ أَنَسٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَجُلًا أَعْتَقَ شِقْصًا لَهُ مِنْ غُلَامٍ فَأَجَازَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِتْقَهُ وَغَرَّمَهُ بَقِيَّةَ ثَمَنِهِحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ ح و حَدَّثَنَا أَحْمَدُ بْنُ عَلِيِّ بْنِ سُوَيْدٍ حَدَّثَنَا رَوْحٌ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ بِإِسْنَادِهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَعْتَقَ مَمْلُوكًا بَيْنَهُ وَبَيْنَ آخَرَ فَعَلَيْهِ خَلَاصُهُ وَهَذَا لَفْظُ ابْنِ سُوَيْدٍ حَدَّثَنَا ابْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي ح و حَدَّثَنَا أَحْمَدُ بْنُ عَلِيِّ بْنِ سُوَيْدٍ حَدَّثَنَا رَوْحٌ حَدَّثَنَا هِشَامُ بْنُ أَبِي عَبْدِ اللَّهِ عَنْ قَتَادَةَ بِإِسْنَادِهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَعْتَقَ نَصِيبًا لَهُ فِي مَمْلُوكٍ عَتَقَ مِنْ مَالِهِ إِنْ كَانَ لَهُ مَالٌ وَلَمْ يَذْكُرْ ابْنُ الْمُثَنَّى النَّضْرَ بْنَ أَنَسٍ وَهَذَا لَفْظُ ابْنِ سُوَيْدٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah mengabarkan kepadaku [Hammam] dari [Qatadah] dari [An Nadlr bin Anas] dari [Basyir bin Nahik] dari [Abu Hurairah], bahwa seorang laki-laki telah membebaskan baginnya dari seorang budak. Kemudian Nabi shallallahu 'alaihi wasallam memperbolehkan untuk membebaskannya dan beliau menanggungkan kepadanya sisa harga budak tersebut.\" Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Ali bin Suwaid] telah menceritakan kepada kami [Rauh] mereka berkata; telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dengan sanadnya, dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa membebaskan seorang budak antara dirinya dan orang lain, maka hendaklah ia menanggung sisa pembayaran.\" Lafazh ini adalah lafazh Ibnu Suwaid.\" Telah menceritakan kepada kami [Ibnu Al Mutsanna] telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [Ayahku]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Ali bin Suwaid] telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Hisyam bin Abu Abdullah] dari [Qatadah] dengan sanadnya, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membebaskan bagiannya dalam diri seorang budak, hendaklah ia bebaskan sisanya jika memiliki uang.\" Namun Ibnu Al Mutsanna belum menyebutkan nama An Nadlr bin Anas, dan ini adalah lafadz Ibnu Suwaid.\""
            },
            {
                "number": 3348,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبَانُ يَعْنِي الْعَطَّارَ حَدَّثَنَا قَتَادَةُ عَنْ النَّضْرِ بْنِ أَنَسٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَعْتَقَ شَقِيصًا فِي مَمْلُوكِهِ فَعَلَيْهِ أَنْ يُعْتِقَهُ كُلَّهُ إِنْ كَانَ لَهُ مَالٌ وَإِلَّا اسْتُسْعِيَ الْعَبْدُ غَيْرَ مَشْقُوقٍ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] telah menceritakan kepada kami [Aban Al 'Aththar] telah menceritakan kepada kami [Qatadah] dari [An Nadlr bin Anas] dari [Basyir bin Nuhaik] dari [Abu Hurairah] ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membebaskan bagian kepemilikannya pada diri seorang budak, maka hendaklah ia membebaskan seluruhnya jika ia memiliki harta, jika tidak maka hendaklah budak tersebut diminta untuk berusaha (membebaskan diri) dengan tanpa diperberat.\""
            },
            {
                "number": 3349,
                "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ أَخْبَرَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ ح و حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ وَهَذَا لَفْظُهُ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ النَّضْرِ بْنِ أَنَسٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَعْتَقَ شِقْصًا لَهُ أَوْ شَقِيصًا لَهُ فِي مَمْلُوكٍ فَخَلَاصُهُ عَلَيْهِ فِي مَالِهِ إِنْ كَانَ لَهُ مَالٌ فَإِنْ لَمْ يَكُنْ لَهُ مَالٌ قُوِّمَ الْعَبْدُ قِيمَةَ عَدْلٍ ثُمَّ اسْتُسْعِيَ لِصَاحِبِهِ فِي قِيمَتِهِ غَيْرَ مَشْقُوقٍ عَلَيْهِ قَالَ أَبُو دَاوُد فِي حَدِيثِهِمَا جَمِيعًا فَاسْتُسْعِيَ غَيْرَ مَشْقُوقٍ عَلَيْهِ وَهَذَا لَفْظُ عَلِيٍّحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى وَابْنُ أَبِي عَدِيٍّ عَنْ سَعِيدٍ بِإِسْنَادِهِ وَمَعْنَاهُ قَالَ أَبُو دَاوُد وَرَوَاهُ رَوْحُ بْنُ عُبَادَةَ عَنْ سَعِيدٍ بْنِ أَبِي عَرُوبَةَ لَمْ يَذْكُرْ السِّعَايَةَ وَرَوَاهُ جَرِيرُ بْنُ حَازِمٍ وَمُوسَى بْنُ خَلَفٍ جَمِيعًا عَنْ قَتَادَةَ بِإِسْنَادِ يَزِيدَ بْنِ زُرَيْعٍ وَمَعْنَاهُ وَذَكَرَا فِيهِ السِّعَايَةَ",
                "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah mengabarkan kepada kami [Yazid bin Zurai']. Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepada kami [Muhammad bin Bisyr] dan ini adalah lafadznya, dari [Sa'id bin Abu 'Arubah] dari [Qatadah] dari [An Nadlr bin Anas] dari [Basyir bin Nuhaik] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa memerdekakan bagiannya dalam diri seorang budak, maka ia berkewajiban membayar sisa harganya dengan harta miliknya jika ia memiliki. Namun jika tidak memiliki harta, maka budak tersebut dinilai dengan nilai pertengahan, kemudian ia diminta (untuk membebaskan diri dengan tebusan) dengan tidak memperberatnya.\" Abu Daud menyebutkan dalam kedua haditsnya, 'kemudian diminta untuk membebaskan dirinya dengan tidak memperberatnya. ' Dan ini adalah lafadz Ali.\" Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Yahya], dan [Ibnu Abu Adi] dari [Sa'id] dengan sanad dan maknanya.\" Abu Daud berkata, \" [Rauh bin 'Ubadah] juga meriwayatkannya dari [Sa'id bin Abu 'Arubah], namun ia tidak menyebutkan lafadz 'berusaha'. [Jarir bin Hazim] dan [Musa bin Khalaf] keduanya juga meriwayatkannya dari [Qatadah] dengan sanad Yazid bin Zurai', seperti makna hadits tersebut, namun dalam hadits tersebut mereka menyebutkan lafadz 'berusaha'.\""
            },
            {
                "number": 3350,
                "arab": "حَدَّثَنَا الْقَعْنَبِيُّ عَنْ مَالِكٍ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي مَمْلُوكٍ أُقِيمَ عَلَيْهِ قِيمَةُ الْعَدْلِ فَأَعْطَى شُرَكَاءَهُ حِصَصَهُمْ وَأُعْتِقَ عَلَيْهِ الْعَبْدُ وَإِلَّا فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَحَدَّثَنَا مُؤَمَّلٌ حَدَّثَنَا إِسْمَعِيلُ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَاهُ قَالَ وَكَانَ نَافِعٌ رُبَّمَا قَالَ فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ وَرُبَّمَا لَمْ يَقُلْهُ حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ حَدَّثَنَا حَمَّادٌ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهَذَا الْحَدِيثِ قَالَ أَيُّوبُ فَلَا أَدْرِي هُوَ فِي الْحَدِيثِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ شَيْءٌ قَالَهُ نَافِعٌ وَإِلَّا عَتَقَ مِنْهُ مَا عَتَقَ",
                "id": "Telah menceritakan kepada kami [Al Qa'nabi] dari [Malik] dari [Nafi'] dari [Abdullah bin Umar], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membebaskan bagiannya dalam diri seorang budak, maka budak tersebut dinilai dengan nilai pertengahan. Lalu ia memberikan bagian para sekutunya kepada mereka, dan budak tersebut dibebaskan, jika tidak maka ia telah membebaskan darinya bagian yang telah ia bebaskan.\" Telah menceritakan kepada kami [Muammal] telah menceritakan kepada kami [Isma'il] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam dengan maknanya. Ia berkata, \"Nafi' dimungkinkan mengatakan, 'Sungguh ia telah membebaskan darinya bagian yang telah ia bebaskan', dan mungkin juga ia tidak mengatakannya.\" Telah menceritakan kepada kami [Sulaiman bin Daud Al 'Ataki] telah menceritakan kepada kami [Hammad] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam dengan hadits ini. Ayyub berkata, \"Aku tidak tahu, lafadz tersebut ada dalam hadits Nabi shallallahu 'alaihi wasallam, atau sesuatu yang ia dikatakan oleh Nafi', yaitu ucapan, 'jika tidak maka ia telah membebaskan darinya bagian yang telah ia bebaskan'.\""
            },
            {
                "number": 3351,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَعْتَقَ شِرْكًا مِنْ مَمْلُوكٍ لَهُ فَعَلَيْهِ عِتْقُهُ كُلِّهِ إِنْ كَانَ لَهُ مَا يَبْلُغُ ثَمَنَهُ وَإِنْ لَمْ يَكُنْ لَهُ مَالٌ عَتَقَ نَصِيبَهُحَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى إِبْرَاهِيمَ بْنِ مُوسَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ حَدَّثَنَا جُوَيْرِيَةُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَعْنَى مَالِكٍ وَلَمْ يَذْكُرْ وَإِلَّا فَقَدْ عَتَقَ مِنْهُ مَا عَتَقَ انْتَهَى حَدِيثُهُ إِلَى وَأُعْتِقَ عَلَيْهِ الْعَبْدُ عَلَى مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] telah mengabarkan kepada kami [Isa bin Yunus] telah menceritakan kepada kami ['ubaidhullah] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membebaskan baginya dari budaknya maka ia berkewajiban membebaskan seluruhnya apabila ia memiliki harta yang mencapai nilai harga budak tersebut. Jika tidak memiliki harta, maka ia telah membebaskan bagiannya.\" Telah menceritakan kepada kami [Makhlad bin Khalid] telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepadaku [Yahya bin Sa'id] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam dengan makna hadits Ibnu bin Musa.\" Telah menceritakan kepada kami [Abdullah bin Muhammad bin Asma`] telah menceritakan kepada kami [Juwairiyah] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam dengan makna hadits Malik, namun ia tidak menyebutkan kata, 'jika tidak (mempunyai uang), maka ia telah membebaskan darinya apa yang telah menjadi bagiannya. ' Dan haditsnya berakhir pada lafadz 'dan budak tersebut telah dibebaskan', seperti makna hadits tersebut.\""
            },
            {
                "number": 3352,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَعْتَقَ شِرْكًا لَهُ فِي عَبْدٍ عَتَقَ مِنْهُ مَا بَقِيَ فِي مَالِهِ إِذَا كَانَ لَهُ مَا يَبْلُغُ ثَمَنَ الْعَبْدِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Ali] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membebaskan bagiannya dalam diri seorang budak, maka ia berkewajiban membebaskan bagian yang tersisa jika uangnya mencukupi nilai harga budak tersebut.\""
            },
            {
                "number": 3353,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ سَالِمٍ عَنْ أَبِيهِيَبْلُغُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ الْعَبْدُ بَيْنَ اثْنَيْنِ فَأَعْتَقَ أَحَدُهُمَا نَصِيبَهُ فَإِنْ كَانَ مُوسِرًا يُقَوَّمُ عَلَيْهِ قِيمَةً لَا وَكْسَ وَلَا شَطَطَ ثُمَّ يُعْتَقُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Sufyan] dari ['Amru bin Dinar] dari [Salim] dari [Ayahnya] dan sampai kepada Nabi shallallahu 'alaihi wasallam, \"Jika seorang budak milik dua orang, kemudian salah seorang dari mereka membebaskan bagian yang menjadi miliknya, jika ia masih memiliki kelebihan harta maka budak tersebut hendaklah dihargai (tidak dilebihkan atau dikurangi), kemudian dibebaskan.\""
            },
            {
                "number": 3354,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ خَالِدٍ عَنْ أَبِي بِشْرٍ الْعَنْبَرِيِّ عَنْ ابْنِ التَّلِبِّ عَنْ أَبِيهِأَنَّ رَجُلًا أَعْتَقَ نَصِيبًا لَهُ مِنْ مَمْلُوكٍ فَلَمْ يُضَمِّنْهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ أَحْمَدُ إِنَّمَا هُوَ بِالتَّاءِ يَعْنِي التَّلِبَّ وَكَانَ شُعْبَةُ أَلْثَغُ لَمْ يُبَيِّنْ التَّاءَ مِنْ الثَّاءِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Khalid] dari [Abu Bisyr Al 'Anbari] dari [Ibnu At Talib] dari [Ayahnya], bahwa seorang laki-laki telah membebaskan bagiannya dari diri seorang budak, dan Nabi shallallahu 'alaihi wasallam tidak membebaninya dengan tanggungan.\" Ahmad berkata, \"Hanyasanya itu dengan huruf ta', yaitu At Talib. Sedangkan Syu'bah tidak mampu mengucapkan sebagian huruf, ia tidak dapat membedakan dengan jelas antara ta` dan tsa`.\""
            },
            {
                "number": 3355,
                "arab": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ وَمُوسَى بْنُ إِسْمَعِيلَ قَالَا حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ مُوسَى فِي مَوْضِعٍ آخَرَ عَنْ سَمُرَةَ بْنِ جُنْدُبٍ فِيمَا يَحْسِبُ حَمَّادٌ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّقَالَ أَبُو دَاوُد رَوَى مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ قَتَادَةَ وَعَاصِمٍ عَنْ الْحَسَنِ عَنْ سَمُرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَ ذَلِكَ الْحَدِيثِ قَالَ أَبُو دَاوُد وَلَمْ يُحَدِّثْ ذَلِكَ الْحَدِيثَ إِلَّا حَمَّادُ بْنُ سَلَمَةَ وَقَدْ شَكَّ فِيهِ",
                "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] dan [Musa bin Isma'il] mereka berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Qatadah] dari [Al Hasan] dari [Samurah] dari Nabi shallallahu 'alaihi wasallam, dan Musa berkata pada tempat yang lain, dari Samurah bin Jundub menurut perhitungan Hammad, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memiliki hubungan kekerabatan, maka ia adalah orang yang merdeka.\" Abu Daud berkata; [Muhammad bin Bakr Al Bursani] meriwayatkannya dari [Hammad bin Salamah] dari [Qatadah] dan ['Ashim] dari [Al Hasan] dari [Samurah] dari Nabi shallallahu 'alaihi wasallam seperti hadits tersebut.\" Abu Daud berkata, \"Tidak ada yang menceritakan hadits tersebut kecuali Hammad bin Salamah, dan ia telah ragu dalam hal tersebut.\""
            },
            {
                "number": 3356,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا عَبْدُ الْوَهَّابِ عَنْ سَعِيدٍ عَنْ قَتَادَةَ أَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَمَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] telah menceritakan kepada kami [Abdul Wahhab] dari [Sa'id] dari [Qatadah] bahwa [Umar bin Al Khathab] radliallahu 'anhu berkata, \"Barangsiapa memiliki hubungan kekerabatan maka ia adalah orang yang merdeka.\""
            },
            {
                "number": 3357,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ حَدَّثَنَا عَبْدُ الْوَهَّابِ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ قَالَمَنْ مَلَكَ ذَا رَحِمٍ مَحْرَمٍ فَهُوَ حُرٌّحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ جَابِرِ بْنِ زَيْدٍ وَالْحَسَنِ مِثْلَهُ قَالَ أَبُو دَاوُد سَعِيدٌ أَحْفَظُ مِنْ حَمَّادٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sulaiman] telah menceritakan kepada kami [Abdul Wahhab] dari [Sa'id] dari [Qatadah] dari [Al Hasan] ia berkata, \"Barangsiapa memiliki hubungan kekerabatan, maka ia adalah orang yang merdeka.\" Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] telah menceritakan kepada kami [Abu Usamah] dari [Sa'id] dari [Qatadah] dari [Jabir bin Zaid] dan [Al Hasan] seperti itu.\" Abu Daud berkata, \"Sa'id lebih hafal daripada Hammad.\""
            },
            {
                "number": 3358,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ خَطَّابِ بْنِ صَالِحٍ مَوْلَى الْأَنْصَارِيِّ عَنْ أُمِّهِ عَنْ سَلَامَةَ بِنْتِ مَعْقِلٍ امْرَأَةٍ مِنْ خَارِجَةِ قَيْسِ عَيْلَانَ قَالَتْقَدِمَ بِي عَمِّي فِي الْجَاهِلِيَّةِ فَبَاعَنِي مِنْ الْحُبَابِ بْنِ عَمْرٍو أَخِي أَبِي الْيُسْرِ بْنِ عَمْرٍو فَوَلَدْتُ لَهُ عَبْدَ الرَّحْمَنِ بْنَ الْحُبَابِ ثُمَّ هَلَكَ فَقَالَتْ امْرَأَتُهُ الْآنَ وَاللَّهِ تُبَاعِينَ فِي دَيْنِهِ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ مِنْ خَارِجَةِ قَيْسِ عَيْلَانَ قَدِمَ بِي عَمِّي الْمَدِينَةَ فِي الْجَاهِلِيَّةِ فَبَاعَنِي مِنْ الْحُبَابِ بْنِ عَمْرٍو أَخِي أَبِي الْيُسْرِ بْنِ عَمْرٍو فَوَلَدْتُ لَهُ عَبْدَ الرَّحْمَنِ بْنَ الْحُبَابِ فَقَالَتْ امْرَأَتُهُ الْآنَ وَاللَّهِ تُبَاعِينَ فِي دَيْنِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ وَلِيُّ الْحُبَابِ قِيلَ أَخُوهُ أَبُو الْيُسْرِ بْنُ عَمْرٍو فَبَعَثَ إِلَيْهِ فَقَالَ أَعْتِقُوهَا فَإِذَا سَمِعْتُمْ بِرَقِيقٍ قَدِمَ عَلَيَّ فَأْتُونِي أُعَوِّضْكُمْ مِنْهَا قَالَتْ فَأَعْتَقُونِي وَقَدِمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَقِيقٌ فَعَوَّضَهُمْ مِنِّي غُلَامًا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Muhammad bin Salamah] dari [Muhammad bin Ishaq] dari [Khaththab bin Shalih] mantan budak Al Anshari, dari [Ibunya] dari [Salamah binti Ma'qil] seorang wanita dari Kabilah Kharijah Qais 'Ailan, ia berkata, \"Pamanku datang membawaku pada masa jahiliyah, kemudian ia menjualku kepada Al Hubab bin 'Amru, saudara Abu Al Yusr bin 'Amru. Setelah itu aku melahirkan seorang anak untuknya bernama Abdurrahman bin Al Hubab, ketika ia meninggal isterinya berkata, \"Demi Allah, sekarang engkau akan dijual untuk melunasi hutangnya.\" Lalu aku datang kepada Rasulullah shallallahu 'alaihi wasallam dan aku katakan, \"Wahai Rasulullah, sesungguhnya saya adalah seorang wanita yang berasal dari Kharijah Qais 'Ailan. Pamanku datang ke Madinah membawaku pada masa jahiliyah, kemudian ia menjualku kepada Al Hubab bin 'Amru, saudara Abu Al Yusr bin 'Amru. Lalu aku melahirkan anaknya yang bernama Abdurrahman bin Al Hubab, kemudian isterinya berkata, 'Demi Allah, sekarang engkau akan dijual untuk melunasi hutangnya'? Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Siapakah wali Al Hubab?\" Kemudian dijawab, \"Saudaranya, yaitu Abu Al Yusr bin 'Amru.\" Beliau lalu mengirim utusan kepadanya dan berkata: \"Bebaskan wanita itu! Dan jika kalian mendengar ada budak yang datang untuk diberkan kepadaku (dari rampasan perang), maka bawalah ia kemari hingga aku memberikannya kepada kalian sebagai gantinya.\" Salamah berkata, \"Kemudian mereka membebaskanku, ketidak datang seorangh budak untuk Rasulullah shallallahu 'alaihi wasallam, maka beliau menganti (pembebasanku) dengan seorang budak.\""
            },
            {
                "number": 3359,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ قَيْسٍ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَبِعْنَا أُمَّهَاتِ الْأَوْلَادِ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ فَلَمَّا كَانَ عُمَرُ نَهَانَا فَانْتَهَيْنَا",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Qais] dari ['Atha] dari [Jabir bin Abdullah] ia berkata, \"Kami pernah membeli beberapa ummul walad pada zaman Rasulullah shallallahu 'alaihi wasallam serta pada zaman Abu Bakr. Ketika Umar menjabat sebagai Khalifah, ia melarang kami, maka kami pun tidak melakukannya lagi.\" "
            },
            {
                "number": 3360,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا هُشَيْمٌ عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ عَنْ عَطَاءٍ وَإِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ عَنْ عَطَاءٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَجُلًا أَعْتَقَ غُلَامًا لَهُ عَنْ دُبُرٍ مِنْهُ وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ فَأَمَرَ بِهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبِيعَ بِسَبْعِ مِائَةِ أَوْ بِتِسْعِ مِائَةِحَدَّثَنَا جَعْفَرُ بْنُ مُسَافِرٍ حَدَّثَنَا بِشْرُ بْنُ بَكْرٍ أَخْبَرَنَا الْأَوْزَاعِيُّ حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ حَدَّثَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ بِهَذَا زَادَ وَقَالَ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْتَ أَحَقُّ بِثَمَنِهِ وَاللَّهُ أَغْنَى عَنْهُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Husyaim] dari [Abdul Malik bin Abu Sulaiman] dari ['Atha] dan [Isma'il bin Abu Khalid] dari [Salamah bin Kuhail] dari ['Atha] dari [Jabir bin Abdullah], bahwa seorang laki-laki berjanji kepada budaknya, bahwa dirinya akan merdeka setelah ia (tuan) meninggal, padahal ia tidak memiliki seorang pun selain budak tersebut. Lalu Nabi shallallahu 'alaihi wasallam memerintahkan agar menjualnya, lalu budak tersebut dijual dengan harga tujuh ratus atau sembilan ratus.\" Telah menceritakan kepada kami [Ja'far bin Musafir] telah menceritakan kepada kami [Bisyr bin Bakr] telah mengabarkan kepada kami [Al Auza'i] telah menceritakan kepadaku ['Atha bin Abu Rabah] telah menceritakan kepadaku [Jabir bin Abdullah] dengan hadits ini, ia menambahkan, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Engkau lebih berhak terhadap harganya dan Allah tidak butuh kepadanya.\""
            },
            {
                "number": 3361,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي الزُّبَيْرِ عَنْ جَابِرٍأَنَّ رَجُلًا مِنْ الْأَنْصَارِ يُقَالُ لَهُ أَبُو مَذْكُورٍ أَعْتَقَ غُلَامًا لَهُ يُقَالُ لَهُ يَعْقُوبُ عَنْ دُبُرٍ وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُ فَدَعَا بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ يَشْتَرِيهِ فَاشْتَرَاهُ نُعَيْمُ بْنُ عَبْدِ اللَّهِ بْنِ النَّحَّامِ بِثَمَانِ مِائَةِ دِرْهَمٍ فَدَفَعَهَا إِلَيْهِ ثُمَّ قَالَ إِذَا كَانَ أَحَدُكُمْ فَقِيرًا فَلْيَبْدَأْ بِنَفْسِهِ فَإِنْ كَانَ فِيهَا فَضْلٌ فَعَلَى عِيَالِهِ فَإِنْ كَانَ فِيهَا فَضْلٌ فَعَلَى ذِي قَرَابَتِهِ أَوْ قَالَ عَلَى ذِي رَحِمِهِ فَإِنْ كَانَ فَضْلًا فَهَاهُنَا وَهَاهُنَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Isma'il bin Ibrahim] telah menceritakan kepada kami [Ayyub] dari [Abu Az Zubair] dari [Jabir], bahwa seorang laki-laki anshar yang bernama Abu Madzkur telah membebaskan seorang budaknya yang bernama Ya'qub (dengan syarat ia telah meninggal), dan ia tidak memiliki harta selain budak tersebut. Kemudian Rasulullah shallallahu 'alaihi wasallam meminta untuk membawanya dan bersabda: \"Siapakah yang mau membelinya?\" Kemudian Nu'aim bin Abdullah bin An Nahham membelinya dengan harga delapan ratus dirham. Beliau lalu menyerahkan uang tersebut kepadanya seraya bersabda: \"Jika salah seorang di antara kalian fakir, maka hendaknya ia memulai (sedekah) kepada dirinya sendiri, jika ada kelebihan maka ia berikan kepada keluarganya, jika ada kelebihan maka ia berikan kepada orang yang memiliki hubungan kekerabatan, kemudian jika masih ada kelebihan maka ia bisa memberikannya kepada siapa saja.\""
            },
            {
                "number": 3362,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمُهَلَّبِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ رَجُلًا أَعْتَقَ سِتَّةَ أَعْبُدٍ عِنْدَ مَوْتِهِ وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُمْ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ قَوْلًا شَدِيدًا ثُمَّ دَعَاهُمْ فَجَزَّأَهُمْ ثَلَاثَةَ أَجْزَاءٍ فَأَقْرَعَ بَيْنَهُمْ فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةًحَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ الْمُخْتَارِ حَدَّثَنَا خَالِدٌ عَنْ أَبِي قِلَابَةَ بِإِسْنَادِهِ وَمَعْنَاهُ وَلَمْ يَقُلْ فَقَالَ لَهُ قَوْلًا شَدِيدًا حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ هُوَ الطَّحَّانُ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي زَيْدٍ أَنَّ رَجُلًا مِنْ الْأَنْصَارِ بِمَعْنَاهُ وَقَالَ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ شَهِدْتُهُ قَبْلَ أَنْ يُدْفَنَ لَمْ يُدْفَنْ فِي مَقَابِرِ الْمُسْلِمِينَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Abu Qilabah] dari [Abu Al Muhallab] dari [Imran bin Hushain], bahwa seorang laki-laki telah membebaskan enam orang budak dengan syarat ia telah meninggal, sedangkan ia tidak memiliki harta selain mereka. Kemudian hal tersebut sampai kepada Nabi shallallahu 'alaihi wasallam, hingga beliau pun marah. Kemudian beliau mengundang mereka dan membagi mereka menjadi tiga kelompok, beliau lalu mengundi mereka, kemudian membebaskan dua orang dan menyisakan empat orang (sebagai budak).\" Telah menceritakan kepada kami [Abu Kamil] telah menceritakan kepada kami [Abdul Aziz bin Al Mukhtar] telah menceritakan kepada kami [Khalid] dari [Abu Qilabah] dengan sanad dan maknanya, namun ia tidak menyebutkan, 'kemudian beliau marah. ' Telah menceritakan kepada kami [Wahb bin Baqiyyah] telah menceritakan kepada kami [Khalid bin Abdullah Ath Thahhan] dari [Khalid] dari [Abu Qilabah] dari [Abu Zaid] bahwa seorang laki-laki anshar, seperti makna hadits tersebut. Nabi shallallahu 'alaihi wasallam lalu bersabda: \"Seandainya aku menyaksikannya sebelum ia dikubur, maka ia tidak dikubur di pekuburan orang-orang Muslim.\""
            },
            {
                "number": 3363,
                "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى بْنِ عَتِيقٍ وَأَيُّوبَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ رَجُلًا أَعْتَقَ سِتَّةَ أَعْبُدٍ عِنْدَ مَوْتِهِ وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُمْ فَبَلَغَ ذَلِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقْرَعَ بَيْنَهُمْ فَأَعْتَقَ اثْنَيْنِ وَأَرَقَّ أَرْبَعَةً",
                "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin 'Atiq] dan [Ayyub] dari [Muhammad bin Sirin] dari [Imran bin Hushain], bahwa seorang laki-laki telah memerdekakan enam budak dengan syarat sepeninggalnya, sementara ia tidak memiliki harta selain mereka. Kemudian hal tersebut sampai kepada Nabi shallallahu 'alaihi wasallam. Beliau pun mengundi di antara mereka dan memerdekakan dua orang dan menyisakan empat orang sebagai budak.\""
            },
            {
                "number": 3364,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ صَالِحٍ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنِي ابْنُ لَهِيعَةَ وَاللَّيْثُ بْنُ سَعْدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ عَنْ بُكَيْرِ بْنِ الْأَشَجِّ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَعْتَقَ عَبْدًا وَلَهُ مَالٌ فَمَالُ الْعَبْدِ لَهُ إِلَّا أَنْ يَشْتَرِطَهُ السَّيِّدُ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Shalih] telah menceritakan kepada kami [Ibnu Wahb] telah mengabarkan kepadaku [Ibnu Lahi'ah] dan [Al Laits bin Sa'd] dari ['ubaidhullah bin Abu Ja'far] dari [Bukair bin Al Asyajj] dari [Nafi'] dari [Abdullah bin Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memerdekakan budak miliknya yang mempunyai harta, maka harta tersebut adalah milik si budak, kecuali jika sang tuan mempersyaratkannya.\""
            },
            {
                "number": 3365,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى أَخْبَرَنَا جَرِيرٌ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَدُ الزِّنَا شَرُّ الثَّلَاثَةِو قَالَ أَبُو هُرَيْرَةَ لَأَنْ أُمَتِّعَ بِسَوْطٍ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ أَحَبُّ إِلَيَّ مِنْ أَنْ أَعْتِقَ وَلَدَ زِنْيَةٍ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Musa] telah mengabarkan kepada kami [Jarir] dari [Suhail bin Abu Shalih] dari [Ayahnya] dari [Abu Hurairah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Anak hasil zina adalah orang buruk ketiga.\" Abu Hurairah berkata, \"Sungguh aku bersedekah dengan sebuah cemeti di jalan Allah 'azza wajalla adalah lebih aku sukai daripada membebaskan anak zina.\""
            },
            {
                "number": 3366,
                "arab": "حَدَّثَنَا عِيسَى بْنُ مُحَمَّدٍ الرَّمْلِيُّ حَدَّثَنَا ضَمْرَةُ عَنْ إِبْرَاهِيمَ بْنِ أَبِي عَبْلَةَ عَنْ الْغَرِيفِ بْنِ الدَّيْلَمِيِّ قَالَأَتَيْنَا وَاثِلَةَ بْنَ الْأَسْقَعِ فَقُلْنَا لَهُ حَدِّثْنَا حَدِيثًا لَيْسَ فِيهِ زِيَادَةٌ وَلَا نُقْصَانٌ فَغَضِبَ وَقَالَ إِنَّ أَحَدَكُمْ لَيَقْرَأُ وَمُصْحَفُهُ مُعَلَّقٌ فِي بَيْتِهِ فَيَزِيدُ وَيَنْقُصُ قُلْنَا إِنَّمَا أَرَدْنَا حَدِيثًا سَمِعْتَهُ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَاحِبٍ لَنَا أَوْجَبَ يَعْنِي النَّارَ بِالْقَتْلِ فَقَالَ أَعْتِقُوا عَنْهُ يُعْتِقْ اللَّهُ بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنْهُ مِنْ النَّارِ",
                "id": "Telah menceritakan kepada kami [Isa bin Muhammad Ar Ramli] telah menceritakan kepada kami [Dlamrah] dari [Ibrahim bin Abu 'Abalah] dari [Al Gharif bin Ad Dailami] ia berkata, \"Kami datang menemui [Watsilah bin Al Asqa'] dan berkata kepadanya, \"Ceritakanlah kepada kami sebuah hadits yang tidak ada penambahan dan pengurangan padanya.\" Kemudian Watsilah marah dan berkata, \"Sungguh, salah seorang di antara kalian ada yang membaca sementara mushhafnya tergantung di rumahnya, sehingga ia pun menambah dan mengurang.\" Kami katakan, \"Sebenarnya kami hanya ingin mendengar hadits yang kamu dengar dari Nabi shallallahu 'alaihi wasallam.\" Watsilah lalu berkata, \"Kami pernah datang kepada Rasulullah shallallahu 'alaihi wasallam menanyakan perihal sahabat kami yang telah divonis neraka karena sebab membunuh. Beliau kemudian bersabda: \"Bebaskan budak untuknya, maka Allah akan membebaskan dengan setiap anggota badan budak tersebut satu anggotan badannya dari Neraka.\""
            },
            {
                "number": 3367,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ الْيَعْمَرِيِّ عَنْ أَبِي نَجِيحٍ السُّلَمِيِّ قَالَحَاصَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَصْرِ الطَّائِفِ قَالَ مُعَاذٌ سَمِعْتُ أَبِي يَقُولُ بِقَصْرِ الطَّائِفِ بِحِصْنِ الطَّائِفِ كُلَّ ذَلِكَ فَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ بَلَغَ بِسَهْمٍ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ فَلَهُ دَرَجَةٌ وَسَاقَ الْحَدِيثَ وَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَيُّمَا رَجُلٍ مُسْلِمٍ أَعْتَقَ رَجُلًا مُسْلِمًا فَإِنَّ اللَّهَ عَزَّ وَجَلَّ جَاعِلٌ وِقَاءَ كُلِّ عَظْمٍ مِنْ عِظَامِهِ عَظْمًا مِنْ عِظَامِ مُحَرَّرِهِ مِنْ النَّارِ وَأَيُّمَا امْرَأَةٍ أَعْتَقَتْ امْرَأَةً مُسْلِمَةً فَإِنَّ اللَّهَ جَاعِلٌ وِقَاءَ كُلِّ عَظْمٍ مِنْ عِظَامِهَا عَظْمًا مِنْ عِظَامِ مُحَرَّرِهَا مِنْ النَّارِ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [Ayahku] dari [Qatadah] dari [Salim bin Abu Al Ja'd] dari [Ma'dan bin Abu Thalhah Al Ya'muri] dari [Abu Najih As Sulami] ia berkata, \"Kami pernah mengepung istana Thaif bersama Rasulullah shallallahu 'alaihi wasallam, Mu'adz lalu berkata, \"Aku mendengar ayahku mengatakan di istana Thaif atau benteng Thaif, setiap itu ia mengatakan, 'Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa memanahkan satu anak panah kepada orang kafir di jalan Allah 'azza wajalla maka baginya satu derajat…lalu ia meneruskan hadits tersebut. Dan aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Muslim mansaja yang membebaskan seorang Muslim, maka Allah 'azza wajalla menjadikan perlindungan setiap tulangnya dari api neraka dengan setiap tulang orang yang ia bebaskan. Dan wanita manasaja yang membebaskan seorang wanita muslimah, maka pada hari kiamat Allah menjadikan perlindungan setiap tulangnya dari api neraka dengan setiap tulang orang yang ia bebaskan.\""
            },
            {
                "number": 3368,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ نَجْدَةَ حَدَّثَنَا بَقِيَّةُ حَدَّثَنَا صَفْوَانُ بْنُ عَمْرٍو حَدَّثَنِي سُلَيْمُ بْنُ عَامِرٍ عَنْ شُرَحْبِيلَ بْنِ السَّمْطِ أَنَّهُ قَالَ لِعَمْرِو بْنِ عَبَسَةَحَدِّثْنَا حَدِيثًا سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَعْتَقَ رَقَبَةً مُؤْمِنَةً كَانَتْ فِدَاءَهُ مِنْ النَّارِحَدَّثَنَا حَفْصُ بْنُ عُمَرَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ شُرَحْبِيلَ بْنِ السَّمْطِ أَنَّهُ قَالَ لِكَعْبِ بْنِ مُرَّةَ أَوْ مُرَّةَ بْنِ كَعْبٍ حَدِّثْنَا حَدِيثًا سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مَعْنَى مُعَاذٍ إِلَى قَوْلِهِ وَأَيُّمَا امْرِئٍ أَعْتَقَ مُسْلِمًا وَأَيُّمَا امْرَأَةٍ أَعْتَقَتْ امْرَأَةً مُسْلِمَةً زَادَ وَأَيُّمَا رَجُلٍ أَعْتَقَ امْرَأَتَيْنِ مُسْلِمَتَيْنِ إِلَّا كَانَتَا فِكَاكَهُ مِنْ النَّارِ يُجْزِئُ مَكَانَ كُلِّ عَظْمَيْنِ مِنْهُمَا عَظْمٌ مِنْ عِظَامِهِ قَالَ أَبُو دَاوُد سَالِمٌ لَمْ يَسْمَعْ مِنْ شُرَحْبِيلَ مَاتَ شُرَحْبِيلُ بِصِفِّينَ",
                "id": "Telah menceritakan kepada kami [Abdul Wahhab bin Najdah] telah menceritakan kepada kami [Baqiyyah] telah menceritakan kepada kami [Shafwan bin 'Amru] telah menceritakan kepadaku [Sulaim bin Amir] dari [Syurahbil bin As Samth] bahwa ia berkata kepada ['Amru bin 'Abasah], \"Ceritakan kepada kami sebuah hadits yang engkau dengar dari Rasulullah shallallahu 'alaihi wasallam! Amru lalu berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa membebaskan seorang budak mukmin, maka ia akan menjadi penebusnya dari Neraka.\" Telah menceritakan kepada kami [Hafshah bin Umar] telah menceritakan kepada kami [Syu'bah] dari ['Amru bin Murrah] dari [Salim bin Abu Al Ja'd] dari [Syurahbil bin As Samth] bahwa ia berkata kepada [Ka'b bin Murrah atau Murrah bin Ka'b], \"Ceritakanlah kepada kami sebuah hadits yang engkau dengar dari Rasulullah shallallahu 'alaihi wasallam!\" Kemudian ia menyebutkan makna hadits Mu'adz hingga perkataannya, \"Siapapun orang yang membebaskan seorang laki-laki dan siapapun wanita yang membebaskan seorang wanita muslimah….\" Ka'b bin Murrah menambahkan, \"Siapapun laki-laki yang membebaskan dua orang wanita muslimah melainkan keduanya akan menjadi penebusnya dari Neraka, satu tulang dari tulang-tulangnya terwakili oleh setiap dua tulang dari keduanya.\" Abu Daud berkata, \"Salim tidak mendengar dari Syurahbil, sebab Syurahbil meninggal di perang Shiffin.\""
            },
            {
                "number": 3369,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي حَبِيبَةَ الطَّائِيِّ عَنْ أَبِي الدَّرْدَاءِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الَّذِي يَعْتِقُ عِنْدَ الْمَوْتِ كَمَثَلِ الَّذِي يُهْدِي إِذَا شَبِعَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Abu Habibah Ath Tha`i] dari [Abu Ad Darda] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Permisalan orang yang membebaskan budak ketika hendak meninggal seperti orang yang memberi hadiah apabila ia telah kenyang.\""
            },
            {
                "number": 3370,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ النُّفَيْلِيُّ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ ح و حَدَّثَنَا نَصْرُ بْنُ عَاصِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ{ وَاتَّخِذُوا مِنْ مَقَامِ إِبْرَاهِيمَ مُصَلًّى }",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Hatim bin Isma'il]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Nashr bin 'Ashim] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ja'far bin Muhammad] dari [Ayahnya] dan [Jabir] radliallahu 'anhu, bahwa Nabi shallallahu 'alaihi wasallam membaca ayat: '(Dan jadikanlah sebahagian maqam Ibrahim tempat sholat) ' (Qs. Al Baqarah: 125). "
            },
            {
                "number": 3371,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا خُصَيْفٌ حَدَّثَنَا مِقْسَمٌ مَوْلَى ابْنِ عَبَّاسٍ قَالَ قَالَ ابْنُ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَانَزَلَتْ هَذِهِ الْآيَةُ{ وَمَا كَانَ لِنَبِيٍّ أَنْ يَغُلَّ }فِي قَطِيفَةٍ حَمْرَاءَ فُقِدَتْ يَوْمَ بَدْرٍ فَقَالَ بَعْضُ النَّاسِ لَعَلَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَهَا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ وَمَا كَانَ لِنَبِيٍّ أَنْ يَغُلَّ }إِلَى آخِرِ الْآيَةِقَالَ أَبُو دَاوُد يَغُلَّ مَفْتُوحَةُ الْيَاءِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Abdul Wahid bin Ziyad] telah menceritakan kepada kami [Khushaif] telah menceritakan kepada kami [Miqsam] mantan budak Ibnu Abbas, ia berkata, [Ibnu Abbas] radliallahu 'anhu berkata, \"Turunnya ayat ini: '(Tidak mungkin seorang nabi berkhianat dalam urusan harta rampasan perang) ' (Qs. Ali Imran: 161), berkenaan dengan hilangnya kasur merah di badar. Sebagian orang mengatakan, \"Kemungkinan Rasulullah shallallahu 'alaihi wasallam mengambilnya, maka Allah 'azza wajalla menurunkan ayat: '(Tidak mungkin seorang nabi berkhianat dalam urusan harta rampasan perang) ' (Qs. Ali Imran: 161), hingga akhir ayat.\" Abu Daud berkata, \"Yaghulla, dengan memberi harakat fathah pada huruf ya'.\""
            },
            {
                "number": 3372,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ أَبِي قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْبَخَلِ وَالْهَرَمِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Mu'tamir] ia berkata; aku mendengar [Ayahku] berkata; aku pernah mendengar [Anas bin Malik] berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"ALLAAHUMMA INNII A'UUDZU BIKA MINAL BUKHLI WAL HARAMI (Ya Allah, aku berlindung kepada-Mu dari sifat kikir dan pikun) '.\""
            },
            {
                "number": 3373,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا سُفْيَانُ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ عَنْ عَطَاءٍ عَنْ ابْنِ عَبَّاسٍ قَالَلَحِقَ الْمُسْلِمُونَ رَجُلًا فِي غُنَيْمَةٍ لَهُ فَقَالَ السَّلَامُ عَلَيْكُمْ فَقَتَلُوهُ وَأَخَذُوا تِلْكَ الْغُنَيْمَةَ فَنَزَلَتْ{ وَلَا تَقُولُوا لِمَنْ أَلْقَى إِلَيْكُمْ السَّلَامَ لَسْتَ مُؤْمِنًا تَبْتَغُونَ عَرَضَ الْحَيَاةِ الدُّنْيَا }تِلْكَ الْغُنَيْمَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami ['Amru bin Dinar] dari ['Atha] dari [Ibnu Abbas] ia berkata, \"Orang-orang muslim bertemu dengan seorang laki-laki yang membawa kambingnya, kemudian ia mengucapkan, 'Assalaamu 'alaikum! ' Lalu mereka membunuhnya dan mengambil kambing tersebut. Maka turunlah ayat: '(Dan janganlah kamu mengatakan kepada orang yang mengucapkan 'salam' kepadamu: 'Kamu bukan seorang mukmin' (lalu kamu membunuhnya), dengan maksud mencari harta benda kehidupan di dunia) ' (Qs. An Nisaa: 94), yaitu kambing tersebut.\""
            },
            {
                "number": 3374,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ ح و حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ الْأَنْبَارِيُّ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ عَنْ ابْنِ أَبِي الزِّنَادِ وَهُوَ أَشْبَعُ عَنْ أَبِيهِ عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ{ غَيْرُ أُولِي الضَّرَرِ }وَلَمْ يَقُلْ سَعِيدٌ كَانَ يَقْرَأُ",
                "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] telah menceritakan kepada kami [Ibnu Abu Az Zinad]. (dalam jalur lain disebutkan) Telah menceritakan kepada kami [Muhammad bin Sulaiman Al Anbari] telah menceritakan kepada kami [Hajjaj bin Muhammad] dari [Ibnu Abu Az Zinad Asyba'] dari [Ayahnya] dari [Kharijah bin Zaid bin Tsabit] dari [Ayahnya], bahwa Nabi shallallahu 'alaihi wasallam membaca ayat: (yang tidak mempunyai 'uzur…) ' (Qs. An Nisaa; 95). Sa'id tidak menyebutkan kata, 'membaca'.\""
            },
            {
                "number": 3375,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلَاءِ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ حَدَّثَنَا يُونُسُ بْنُ يَزِيدَ عَنْ أَبِي عَلِيِّ بْنِ يَزِيدَ عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَرَأَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ{ وَالْعَيْنُ بِالْعَيْنِ }",
                "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] dan [Muhammad bin Al 'Ala] mereka berkata; telah menceritakan kepada kami [Abdullah bin Al Mubarak] telah menceritakan kepada kami [Yunus bin Yazid] dari [Abu Ali bin Yazid] dari [Az Zuhri] dari [Anas bin Malik] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam membaca ayat: '(... dan mata dengan mata) ' (Qs. Al Maidah: 45). "
            },
            {
                "number": 3376,
                "arab": "حَدَّثَنَا النُّفَيْلِيُّ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا فُضَيْلُ بْنُ مَرْزُوقٍ عَنْ عَطِيَّةَ بْنِ سَعْدٍ الْعَوْفِيِّ قَالَقَرَأْتُ عَلَى عَبْدِ اللَّهِ بْنِ عُمَرَ{ اللَّهُ الَّذِي خَلَقَكُمْ مِنْ ضَعْفٍ }فَقَالَ{ مِنْ ضُعْفٍ }قَرَأْتُهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا قَرَأْتَهَا عَلَيَّ فَأَخَذَ عَلَيَّ كَمَا أَخَذْتُ عَلَيْكَ",
                "id": "Telah menceritakan kepada kami [An Nufaili] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Fudlail bin Marzuq] dari ['Athiyyah bin Sa'dan Al 'Aufi] ia berkata, \"Aku pernah membacakan kepada [Abdullah bin Umar] ayat: 'ALLAHULLADZII KHALAQAKUM MIN DLA'FIN… (Allah, Dialah yang menciptakan kamu dari keadaan lemah...) (Qs. Ar Ruum: 54) ', kemudian ia berkata, 'MIN DLU'FIN…(dari kelemahan) -dengan dlammah-', aku pernah membacakan ayat tersebut kepada Rasulullah shallallahu 'alaihi wasallam sebagaimana engkau telah membacakannya kepadaku, kemudian beliau mengoreksiku sebagaimana aku telah mengoreksimu.\""
            },
            {
                "number": 3377,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ حَدَّثَنَا عُبَيْدٌ يَعْنِي ابْنَ عَقِيلٍ عَنْ هَارُونَ عَنْ عَبْدِ اللَّهِ بْنِ جَابِرٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ ضُعْفٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Yahya Al Qutha'i] telah menceritakan kepada kami ['Ubaid bin 'Aqil] dari [Harun] dari [Abdullah bin Jabir] dari ['Athiyyah] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam, beliau membaca: 'MIN DLU'FIN (dari kelemahan) (Qs. Ar Ruum: 54). -dengan harakat dlammah-. "
            },
            {
                "number": 3378,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا الْمُغِيرَةُ بْنُ سَلَمَةَ حَدَّثَنَا ابْنُ الْمُبَارَكِ عَنْ الْأَجْلَحِ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِ عَنْ أُبَيٍّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ{ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَلِكَ فَلْتَفْرَحُوا هُوَ خَيْرٌ مِمَّا تَجْمَعُونَ }",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah] telah menceritakan kepada kami [Al Mughirah bin Salamah] telah menceritakan kepada kami [Ibnu Al Mubarak] dari [Al Ajlah] telah menceritakan kepadaku [Abdullah bin Abdurrahman bin Abza] dari [ayahnya] dari [Ubai] bahwa Nabi shallallahu 'alaihi wasallam pernah membaca ayat: BIFADHLILLAAHI WA RAHMATIHI, FABIDZAALIKA FAL TAFRAHUU, HUWA KHAIRUN MIMMAA TAJMA'UUN (Katakanlah: \"Dengan karunia Allah dan rahmat-Nya, hendaklah dengan itu kalian bergembira. Karunia Allah dan rahmat-Nya itu adalah lebih baik dari apa yang kalian kumpulkan.\"); "
            },
            {
                "number": 3379,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَأَنَّهَا سَمِعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ{ إِنَّهُ عَمِلَ غَيْرَ صَالِحٍ }",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] telah mengabarkan kepada kami [Tsabit] dari [Syahr bin Hausyab] dari [Asma` binti Yazid], bahwa ia pernah mendengar Nabi shallallahu 'alaihi wasallam membaca: 'INNAHUU 'AMILA GHAIRA SHAALIH (Sesungguhnya ia telah melakukan perbuatan yang tidak baik) '. (Qs. Huud: 46). "
            },
            {
                "number": 3380,
                "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ أَبِي عُذْرَةَ عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ دُخُولِ الْحَمَّامَاتِ ثُمَّ رَخَّصَ لِلرِّجَالِ أَنْ يَدْخُلُوهَا فِي الْمَيَازِرِ",
                "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] dari [Abdullah bin Syaddad] dari [Abu 'Udzrah] dari [Aisyah] radliallahu 'anhuma, bahwa Rasulullah shallallahu 'alaihi wasallam melarang memasuki tempat-tempat pemandian umum. Dan beliau memberi keringanan bagi kaum laki-laki dengan syarat mengenakan kain sarung.\""
            },
            {
                "number": 3381,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ قُدَامَةَ حَدَّثَنَا جَرِيرٌ ح و حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ جَمِيعًا عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ قَالَ ابْنُ الْمُثَنَّى عَنْ أَبِي الْمَلِيحِ قَالَدَخَلَ نِسْوَةٌ مِنْ أَهْلِ الشَّامِ عَلَى عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا فَقَالَتْ مِمَّنْ أَنْتُنَّ قُلْنَ مِنْ أَهْلِ الشَّامِ قَالَتْ لَعَلَّكُنَّ مِنْ الْكُورَةِ الَّتِي تَدْخُلُ نِسَاؤُهَا الْحَمَّامَاتِ قُلْنَ نَعَمْ قَالَتْ أَمَا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ امْرَأَةٍ تَخْلَعُ ثِيَابَهَا فِي غَيْرِ بَيْتِهَا إِلَّا هَتَكَتْ مَا بَيْنَهَا وَبَيْنَ اللَّهِ تَعَالَى قَالَ أَبُو دَاوُد هَذَا حَدِيثُ جَرِيرٍ وَهُوَ أَتَمُّ وَلَمْ يَذْكُرْ جَرِيرٌ أَبَا الْمَلِيحِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Qudamah] telah menceritakan kepada kami [Jarir]. Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] semuanya berasal dari [Manshur] dari [Salim bin Abu Al Ja'dan], [Ibnu Al Mutsanna] menyebutkan dari [Abu Al Malih] ia berkata, \"Beberapa wanita Syam menemui [Aisyah] radliallahu 'anhuma, Aisyah kemudian bertanya, \"Dari manakah kalian?\" Mereka menjawab, \"Dari penduduk Syam.\" Aisyah berkata, \"Kemungkinan kalian berasal dari Al Kurah yang para wanitanya biasa memasuki pemandian umum?\" Mereka menjawab, Ya. Aisyah lalu berkata, \"Ketahuilah, aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang wanita yang melepas pakaiannya di luar rumah kecuali ia telah melepaskan tabir antara dirinya dengan Allah Ta'ala.\" Abu Daud berkata, \"Ini adalah hadits Jarir, dan hadits ini lebih sempurna. Namun ia tidak menyebutkan nama Abu Al Malih. Ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda\""
            }
        ]
    }
}