{
    "status": true,
    "data": {
        "start": 149,
        "end": 296,
        "total": 148,
        "book": "ahmad",
        "hadits": [
            {
                "number": 149,
                "arab": "حَدَّثَنَا يَزِيدُ هَوَ ابْنُ هَارُونَ أَنْبَأَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ أَبِي خَالِدٍ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنِ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ قُرَيْشًا إِذَا لَقِيَ بَعْضُهُمْ بَعْضًا لَقُوهُمْ بِبِشْرٍ حَسَنٍ وَإِذَا لَقُونَا لَقُونَا بِوُجُوهٍ لَا نَعْرِفُهَا قَالَ فَغَضِبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَضَبًا شَدِيدًا وَقَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَا يَدْخُلُ قَلْبَ رَجُلٍ الْإِيمَانُ حَتَّى يُحِبَّكُمْ لِلَّهِ وَلِرَسُولِهِحَدَّثَنَا جَرِيرٌ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ عَبْدِ الْمُطَّلِبِ بْنِ رَبِيعَةَ قَالَ دَخَلَ الْعَبَّاسُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّا لَنَخْرُجُ فَنَرَى قُرَيْشًا تَحَدَّثُ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Yazid] yaitu Ibnu Harun, telah memberitakan kepada kami [Isma'il] yaitu Ibnu Abu Khalid, dari [Yazid bin Abu Ziyad] dari [Abdullah bin Al Harits] dari [Al Abbas bin Abdul Muththalib] berkata; Aku berkata kepada Rasulullah shallallahu 'alaihi wasallam; \"Wahai Rasulullah, jika orang-orang Quraisy bertemu satu sama lain, mereka selalu berseri-seri dan berwajah manis. Sedang jika bertemu dengan kami, maka mereka memasang tampang yang kami tidak mengerti.\" Al Abbas berkata; Maka Nabi shallallahu 'alaihi wasallam sangat marah dan bersabda: \"Demi Dzat yang jiwaku ada di tangan-Nya, iman tidak akan masuk kedalam hati seseorang sampai ia mencintai kalian karena Allah dan RasulNya.\" Telah menceritakan kepada kami [Jarir] dari [Yazid bin Abu Ziyad] dari [Abdullah bin Al Harits] dari [Abdul Muththalib bin Rabi'ah] berkata; [Al Abbas] menemui Rasulullah shallallahu 'alaihi wasallam lalu mengatakan: \"Ketika kami keluar, kami melihat orang-orang Quraisy saling berbincang..\" lalu dia menyebutkan hadits itu."
            },
            {
                "number": 150,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ أَخْبَرَنِي كَثِيرُ بْنُ عَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ عَنْ أَبِيهِ الْعَبَّاسِ قَالَشَهِدْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُنَيْنًا قَالَ فَلَقَدْ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا مَعَهُ إِلَّا أَنَا وَأَبُو سُفْيَانَ بْنُ الْحَارِثِ بْنِ عَبْدِ الْمُطَّلِبِ فَلَزِمْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ نُفَارِقْهُ وَهُوَ عَلَى بَغْلَةٍ شَهْبَاءَ وَرُبَّمَا قَالَ مَعْمَرٌ بَيْضَاءَ أَهْدَاهَا لَهُ فَرْوَةُ بْنُ نَعَامَةَ الْجُذَامِيُّ فَلَمَّا الْتَقَى الْمُسْلِمُونَ وَالْكُفَّارُ وَلَّى الْمُسْلِمُونَ مُدْبِرِينَ وَطَفِقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْكُضُ بَغْلَتَهُ قِبَلَ الْكُفَّارِ قَالَ الْعَبَّاسُ وَأَنَا آخِذٌ بِلِجَامِ بَغْلَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكُفُّهَا وَهُوَ لَا يَأْلُو مَا أَسْرَعَ نَحْوَ الْمُشْرِكِينَ وَأَبُو سُفْيَانَ بْنُ الْحَارِثِ آخِذٌ بِغَرْزِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَبَّاسُ نَادِ يَا أَصْحَابَ السَّمُرَةِ قَالَ وَكُنْتُ رَجُلًا صَيِّتًا فَقُلْتُ بِأَعْلَى صَوْتِي أَيْنَ أَصْحَابُ السَّمُرَةِ قَالَ فَوَاللَّهِ لَكَأَنَّ عَطْفَتَهُمْ حِينَ سَمِعُوا صَوْتِي عَطْفَةُ الْبَقَرِ عَلَى أَوْلَادِهَا فَقَالُوا يَا لَبَّيْكَ يَا لَبَّيْكَ وَأَقْبَلَ الْمُسْلِمُونَ فَاقْتَتَلُوا هُمْ وَالْكُفَّارُ فَنَادَتْ الْأَنْصَارُ يَقُولُونَ يَا مَعْشَرَ الْأَنْصَارِ ثُمَّ قَصَّرَتْ الدَّاعُونَ عَلَى بَنِي الْحَارِثِ بْنِ الْخَزْرَجِ فَنَادَوْا يَا بَنِي الْحَارِثِ بْنِ الْخَزْرَجِ قَالَ فَنَظَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى بَغْلَتِهِ كَالْمُتَطَاوِلِ عَلَيْهَا إِلَى قِتَالِهِمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا حِينَ حَمِيَ الْوَطِيسُ قَالَ ثُمَّ أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَصَيَاتٍ فَرَمَى بِهِنَّ وُجُوهَ الْكُفَّارِ ثُمَّ قَالَ انْهَزَمُوا وَرَبِّ الْكَعْبَةِ انْهَزَمُوا وَرَبِّ الْكَعْبَةِ قَالَ فَذَهَبْتُ أَنْظُرُ فَإِذَا الْقِتَالُ عَلَى هَيْئَتِهِ فِيمَا أَرَى قَالَ فَوَاللَّهِ مَا هُوَ إِلَّا أَنْ رَمَاهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِحَصَيَاتِهِ فَمَا زِلْتُ أَرَى حَدَّهُمْ كَلِيلًا وَأَمْرَهُمْ مُدْبِرًا حَتَّى هَزَمَهُمْ اللَّهُ قَالَ وَكَأَنِّي أَنْظُرُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْكُضُ خَلْفَهُمْ عَلَى بَغْلَتِهِ",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] telah mengabarkan kepadaku [Katsir bin Abbas bin Abdul Muththalib] dari [Bapaknya, Al Abbas] berkata; Saya menyaksikan perang Hunain bersama Rasulullah shallallahu 'alaihi wasallam. Saya melihat Nabi shallallahu 'alaihi wasallam tidak di kawal oleh seorangpun kecuali aku dan Abu Sufyan bin Al Harits bin Abdul Muththalib, maka kami memutuskan untuk tetap mendampingi Rasulullah shallallahu 'alaihi wasallam dan tidak meninggalkan beliau. Pada saat itu, beliau berada di atas keledai putih kehitam-hitaman -Ma'mar berkata; berwarna putih- pemberian Farwah bin Nu'amah Al Judzami. Tatkala pasukan kaum muslim dan pasukan kafir bertemu, orang-orang muslim kabur sedangkan Rasulullah shallallahu 'alaihi wasallam mengarahkan bighalnya ke arah orang kafir. Al Abbas berkata; Saya memegang kekang bighal Rasulullah shallallahu 'alaihi wasallam, saya menahannya agar kuda tersebut tidak berjalan cepat menuju orang-orang musyrik, sedangkan Abu Sufyan bin Al Harits memegang pijkan kaki Rasulullah shallallahu 'alaihi wasallam. Kemudian beliau bersabda: \"Wahai Abbas panggillah orang-orang yang mengikuti Bai'atur Ridlwan.\" Aku adalah orang yang sangat tinggi suaranya, maka aku pun mengangkat suaraku dengan tinggi; \"Dimanakah ashhab as samurrah (orang yang mengikuti Bai'atur Ridlwan)?\" Demi Allah, rasa sayang mereka (kepada Rasulullah shallallah 'alaihi wa sallam) ketika mendengar suaraku (memanggil mereka) seperti rasa sayang seekor induk sapi terhadap anak-anaknya. Mereka menjawab; \"Kami datang memenuhi panggilanmu, kami datang memenuhi panggilanmu.\" Maka kaum muslimin pun datang, kemudian terjadilah pertempuran antara kaum muslimin dan orang-orang kafir. Orang-orang Anshar pun (tak ketinggalan) menyeru; \"Wahai segenap kaum Anshar!\" Kemudian panggilan semakin menyempit kepada Bani Al Harits bin Al Khazraj, mereka memanggil; \"Wahai Bani Al Harits bin Al Khazraj.\" Rasulullah shallallahu 'alaihi wasallam melihat pada saat di atas bighalnya, seakan-akan beliau berdiri di atasnya, memandangi peperangan yang sedang terjadi, dan bersabda: \"Inilah yang terjadi ketika peperangan sangat sengit sedang terjadi.\" Kemudian beliau mengambil (segenggam) kerikil dan melemparkannya kepada arah orang-orang kafir, lalu bersabda: \"Mereka akan kalah, Demi Rabb Ka'bah, mereka akan kalah, Demi Rabb Ka'bah.\" Al Abbas melanjutkan ceritanya; Aku bergegas melihat peperangan, dan ternyata peperangan masih dalam keadaan seperti yang kulihat. Demi Allah, tidak ada yang dilakukan Rasulullah shallallahu 'alaihi wasallam kecuali melempar kerikil-kerikil tersebut kepada arah mereka, dan saya dapat melihat kekuatan mereka melemah dan akhirnya mundur sehingga Allah mengalahkan mereka. Saya tetap memperhatikan Nabi shallallahu 'alaihi wasallam yang sedang mengejar di belakang mereka di atas bighalnya.\""
            },
            {
                "number": 151,
                "arab": "حَدَّثَنَا سُفْيَانُ قَالَ سَمِعْتُ الزُّهْرِيَّ مَرَّةً أَوْ مَرَّتَيْنِ فَلَمْ أَحْفَظْهُ عَنْ كَثِيرِ بْنِ عَبَّاسٍ قَالَكَانَ عَبَّاسٌ وَأَبُو سُفْيَانَ مَعَهُ يَعْنِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَخَطَبَهُمْ وَقَالَ الْآنَ حَمِيَ الْوَطِيسُ وَقَالَ نَادِ يَا أَصْحَابَ سُورَةِ الْبَقَرَةِ",
                "id": "Telah menceritakan kepada kami [Sufyan] berkata; saya mendengar [Az Zuhri] sekali atau dua kali, namun saya tidak dapat mengingatnya, dari [Katsir bin Abbas] berkata; Abbas dan Abu Sufyan bersama Nabi shallallahu 'alaihi wasallam, beliau berkhutbah di hadapan mereka: \"Sekarang peperangan sudah semakin sengit!\" lalu beliau bersabda (kepada Abbas dan Abu Sufyan): \"serulah; 'Wahai orang-orang yang kepadanya diturunkan surat Al Baqarah.\""
            },
            {
                "number": 152,
                "arab": "حَدَّثَنَا جَرِيرُ بْنُ عَبْدِ الْحَمِيدِ أَبُو عَبْدِ اللَّهِ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ عَبْدِ الْمُطَّلِبِ بْنِ رَبِيعَةَ قَالَدَخَلَ الْعَبَّاسُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا لَنَخْرُجُ فَنَرَى قُرَيْشًا تَحَدَّثُ فَإِذَا رَأَوْنَا سَكَتُوا فَغَضِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدَرَّ عِرْقٌ بَيْنَ عَيْنَيْهِ ثُمَّ قَالَ وَاللَّهِ لَا يَدْخُلُ قَلْبَ امْرِئٍ إِيمَانٌ حَتَّى يُحِبَّكُمْ لِلَّهِ وَلِقَرَابَتِي",
                "id": "Telah menceritakan kepada kami [Jarir bin Abdul Hamid, Abu Abdullah] dari [Yazid bin Abu Ziyad] dari [Abdullah bin Al Harits] dari [Abdul Muththalib bin Rabi'ah] berkata; Al Abbas menemui Rasulullah shallallahu 'alaihi wasallam dan berkata; \"Kami keluar kemudian kami melihat orang-orang Quraisy sedang berbincang-bincang, tatkala mereka melihat kami mereka terdiam.\" Maka Rasulullah shallallahu 'alaihi wasallam marah dan keringatnya keluar antara kedua matanya kemudian bersabda: \"Demi Allah, iman tidak akan masuk ke dalam hati seseorang sehingga dia mencintai kalian karena Allah dan karena hubungan kekerabatan kalian denganku.\" "
            },
            {
                "number": 153,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثُ بْنُ سَعِيدٍ عَنِ ابْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ عَنْ عَامِرِ بْنِ سَعْدٍ عَنِ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ذَاقَ طَعْمَ الْإِيمَانِ مَنْ رَضِيَ بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits bin Sa'id] dari [Ibnu Al Had] dari [Muhammad bin Ibrahim bin Al Harits] dari ['Amir bin Sa'd] dari [Al Abbas bin Abdul Muththalib] bahwa dia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Yang bisa merasakan manisnya iman adalah orang yang rela Allah sebagai Rabbnya, Islam sebagai diennya, dan Muhammad sebagai Rasulnya.\""
            },
            {
                "number": 154,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا بَكْرُ بْنُ مُضَرَ الْقُرَشِيُّ عَنِ ابْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ عَنْ عَامِرِ بْنِ سَعْدٍ عَنِ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا سَجَدَ الْعَبْدُ سَجَدَ مَعَهُ سَبْعَةُ آرَابٍ وَجْهُهُ وَكَفَّاهُ وَرُكْبَتَاهُ وَقَدَمَاهُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Bakr bin Mudlar Al Qurasyi] dari [Ibnu Al Had] dari [Muhammad bin Ibrahim Al Harits] dari ['Amru bin Sa'd] dari [Al Abbas bin Abdul Muththalib] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seorang hamba bersujud maka ada tujuh anggota badan yang ikut bersujud bersamanya. Yaitu: wajahnya, kedua telapak tangannya, kedua lututnya, dan kedua kakinya.\" "
            },
            {
                "number": 155,
                "arab": "حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ عَنِ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ عَنِ ابْنِ عَبَّاسٍ عَنِ الْفَضْلِ بْنِ عَبَّاسٍأَنَّهُ كَانَ رِدْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ جَمْعٍ فَلَمْ يَزَلْ يُلَبِّي حَتَّى رَمَى الْجَمْرَةَ",
                "id": "Telah menceritakan kepada kami ['Abbad bin 'Abbad] dari [Ibnu Juraij] dari ['Atho`] dari [Ibnu Abbas] dari [Al Fadhl bin Abbas], bahwa dia membonceng Nabi shallallahu 'alaihi wasallam dari Muzdalifah, beliau tetap bertalbiyah hingga beliau melempar jumrah."
            },
            {
                "number": 156,
                "arab": "حَدَّثَنَا يَحْيَى عَنِ ابْنِ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ عَنِ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْدَفَ الْفَضْلَ بْنَ عَبَّاسٍ مِنْ جَمْعٍ قَالَ عَطَاءٌ فَأَخْبَرَنِي ابْنُ عَبَّاسٍ أَنَّ الْفَضْلَ أَخْبَرَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَزَلْ يُلَبِّي حَتَّى رَمَى الْجَمْرَةَ",
                "id": "Telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij] telah menceritakan kepadaku ['Atho`] dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam memboncengkan Al Fadhl bin Abbas dari Muzdalifah. 'Atho` berkata; telah menceritakan kepadaku Ibnu Abbas bahwa [Al Fadhl] mengabarinya, bahwa Nabi shallallahu 'alaihi wasallam tetap bertalbiyah sampai melempar jumrah."
            },
            {
                "number": 157,
                "arab": "حَدَّثَنَا يَحْيَى عَنِ ابْنِ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَخْبَرَنِي أَبُو مَعْبَدٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يُخْبِرُ عَنِ الْفَضْلِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشِيَّةَ عَرَفَةَ غَدَاةَ جَمْعٍ لِلنَّاسِ حِينَ دَفَعْنَا عَلَيْكُمْ السَّكِينَةَ وَهُوَ كَافٌّ نَاقَتَهُ حَتَّى إِذَا دَخَلَ مِنًى حِينَ هَبَطَ مُحَسِّرًا قَالَ عَلَيْكُمْ بِحَصَى الْخَذْفِ الَّذِي يُرْمَى بِهِ الْجَمْرَةُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُشِيرُ بِيَدِهِ كَمَا يَخْذِفُ الْإِنْسَانُو قَالَ رَوْحٌ وَالبُرْسَانِيُّ عَشِيَّةَ عَرَفَةَ وَغَدَاةَ جَمْعٍ وَقَالَا حِينَ دَفَعُوا",
                "id": "Telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij] telah mengabarkan kepadaku [Abu Zubair] telah menceritakan kepadaku [Abu Ma'bad] berkata; saya mendengar [Ibnu Abbas] mengabari dari [Al Fadhl], berkata; Rasulullah shallallahu 'alaihi wasallam bersabda pada Sore Hari di 'Arafah dan Pagi Hari di Muzdalifah kepada orang-orang ketika kami mulai berangkat: \"Hendaklah berjalan dengan tenang!\" sambil menarik tali kekang unta beliau. Ketika beliau masuk di Mina, tepatnya ketika menuruni lembah Muhassir, beliau bersabda: \"Hendaklah kalian (mempersiapkan) batu kerikil untuk melempar jumrah.\" Rasulullah shallallahu 'alaihi wasallam mengisyaratkan dengan tangan beliau sebagaimana orang yang melempar. [Rauh] dan [Al Bursani] berkata; \"Pada Sore Hari di 'Arafah dan Pagi Hari di Muzdalifah..\" dan \"Ketika mereka mulai berangkat.\""
            },
            {
                "number": 158,
                "arab": "حَدَّثَنَا حُجَيْنٌ وَيُونُسُ قَالَا حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ عَنْ أَبِي الزُّبَيْرِ عَنْ أَبِي مَعْبَدٍ مَوْلَى ابْنِ عَبَّاسٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ عَنِ الْفَضْلِ بْنِ عَبَّاسٍ وَكَانَ رَدِيفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهُ قَالَ فِي عَشِيَّةِ عَرَفَةَ وَغَدَاةِ جَمْعٍ لِلنَّاسِ حِينَ دَفَعُوا عَلَيْكُمْ السَّكِينَةَ وَهُوَ كَافٌّ نَاقَتَهُ حَتَّى إِذَا دَخَلَ مُحْسِّرًا وَهُوَ مِنْ مِنًى قَالَ عَلَيْكُمْ بِحَصَى الْخَذْفِ الَّذِي يُرْمَى بِهِ الْجَمْرَةُ وَقَالَ لَمْ يَزَلْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُلَبِّي حَتَّى رَمَى الْجَمْرَةَ",
                "id": "Telah menceritakan kepada kami [Hujain] dan [Yunus], keduanya berkata; telah menceritakan kepada kami [Laits bin Sa'id] dari [Abu Zubair] dari [Abu Ma'bad] mantan budak Ibnu Abbas, dari [Abdullah bin Abbas] dari [Al Fadhl bin Abbas], dia berkata; bahwa dia dibonceng Nabi shallallahu 'alaihi wasallam dan beliau bersabda pada Sore Hari 'Arafah dan Pagi Hari Muzdalifah kepada orang-orang ketika kami mulai berangkat: \"Hendaklah kalian berjalan dengan tenang!\" sambil menarik tali kekang unta beliau, sehingga ketika beliau masuk lembah Muhassir di Mina, beliau bersabda: \"Hendaklah kalian (mempersiapkan) batu kerikil untuk melempar jumrah.\" Al Fadhl berkata; \"Rasulullah shallallahu 'alaihi wasallam tetap bertalbiyah sampai beliau melempar jumrah.\""
            },
            {
                "number": 159,
                "arab": "حَدَّثَنَا حَجَّاجٌ قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي مُحَمَّدُ بْنُ عُمَرَ بْنِ عَلِيٍّ عَنْ عَبَّاسِ بْنِ عُبَيْدِ اللَّهِ بْنِ عَبَّاسٍ عَنِ الْفَضْلِ بْنِ عَبَّاسٍ قَالَزَارَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبَّاسًا فِي بَادِيَةٍ لَنَا وَلَنَا كُلَيْبَةٌ وَحِمَارَةٌ تَرْعَى فَصَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَصْرَ وَهُمَا بَيْنَ يَدَيْهِ فَلَمْ تُؤَخَّرَا وَلَمْ تُزْجَرَا",
                "id": "Telah menceritakan kepada kami [Hajjaj] berkata; [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Muhammad bin Umar bin Ali] dari [Abbas bin 'ubaidhullah bin Abbas] dari [Al Fadhl bin Abbas] berkata; Nabi shallallahu 'alaihi wasallam mengunjungi Abbas pada saat berada di kampung kami. Kami mempunyai seekor anjing dan keledai yang sedang memakan rumput. Lalu Nabi shallallahu 'alaihi wasallam mengerjakan sholat ashar sementara kedua binatang itu berada di depan beliau, dan keduanya tidak disingkirkan dan juga tidak diusir. "
            },
            {
                "number": 160,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ عَنْ أَبِي الطُّفَيْلِ عَنِ الْفَضْلِ بْنِ عَبَّاسٍأَنَّهُ كَانَ رَدِيفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ جَمْعٍ إِلَى مِنًى فَلَمْ يَزَلْ يُلَبِّي حَتَّى رَمَى الْجَمْرَةَ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Abdullah bin 'Utsman bin Khutsaim] dari [Abu Thufail] dari [Al Fadhl bin Abbas] bahwa dia dibonceng Nabi shallallahu 'alaihi wasallam dari Muzdalifah menuju Mina, dan beliau tetap bertalbiyah hingga beliau melempar jumrah."
            },
            {
                "number": 161,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ أَبِي حَكِيمٍ الْعَدَنِيُّ حَدَّثَنِي الْحَكَمُ يَعْنِي ابْنَ أَبَانَ قَالَ سَمِعْتُ عِكْرِمَةَ يَقُولُ قَالَ الْفَضْلُ بْنُ عَبَّاسٍلَمَّا أَفَاضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَعَهُ فَبَلَغْنَا الشِّعْبَ نَزَلَ فَتَوَضَّأَ ثُمَّ رَكِبْنَا حَتَّى جِئْنَا الْمُزْدَلِفَةَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Abu Hakim Al 'Adani] telah menceritakan kepadaku [Al Hakam] yaitu Ibnu Aban berkata; saya mendengar ['Ikrimah] berkata; [Al Fadhl bin Abbas] berkata: \"Ketika Rasulullah shallallahu 'alaihi wasallam bergegas meninggalkan (Arafah) yang pada saat itu aku bersama beliau. Ketika kami sampai di sebuah lembah, beliau singgah dan berwudhu, kemudian kami melanjutkan perjalanan kembali hingga tiba di Muzdalifah.\""
            },
            {
                "number": 162,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي نَجِيحٍ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ أَوْ عَنْ مُجَاهِدِ بْنِ جَبْرٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ حَدَّثَنِي أَخِي الْفَضْلُ بْنُ عَبَّاسٍ وَكَانَ مَعَهُ حِينَ دَخَلَهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يُصَلِّ فِي الْكَعْبَةِ وَلَكِنَّهُ لَمَّا دَخَلَهَا وَقَعَ سَاجِدًا بَيْنَ الْعَمُودَيْنِ ثُمَّ جَلَسَ يَدْعُو",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [bapakku] dari [Ibnu Ishaq] telah menceritakan kepadaku [Abdullah bin Abu Nujaih] dari ['Atho` bin Abu Rabah] atau dari [Mujahid bin Jubair] dari [Abdullah bin Abbas] telah menceritakan kepadaku [saudaraku, Al Fadhl bin Abbas] dan dia bersamanya ketika memasuki Ka'bah, bahwa Rasulullah shallallahu 'alaihi wasallam tidak sholat di dalam Ka'bah tapi beliau ketika memasukinya bersujud di antara kedua tiangnya lalu duduk berdoa."
            },
            {
                "number": 163,
                "arab": "حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ حَدَّثَنَا ابْنُ أَبِي لَيْلَى عَنْ عَطَاءٍ عَنِ ابْنِ عَبَّاسٍ عَنِ الْفَضْلِ بْنِ عَبَّاسٍوَكَانَ رَدِيفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ أَفَاضَ مِنْ عَرَفَةَ قَالَ فَرَأَى النَّاسَ يُوضِعُونَ فَأَمَرَ مُنَادِيَهُ فَنَادَى لَيْسَ الْبِرُّ بِإِيضَاعِ الْخَيْلِ وَالْإِبِلِ فَعَلَيْكُمْ بِالسَّكِينَةِ",
                "id": "Telah menceritakan kepada kami ['Abdah bin Sulaiman] telah menceritakan kepada kami [Ibnu Abu Laila] dari ['Atho`] dari [Ibnu Abbas] dari [Al Fadhl bin Abbas] bahwa dia membonceng Nabi shallallahu 'alaihi wasallam ketika berangkat dari Arafah lalu dia melihat orang-orang berjalan dengan tergesa-gesa, maka beliau menyuruh seorang penyerunya menyerukan; \"Tidaklah termasuk kebaikan memaksa kuda dan unta untuk berlari, tapi berangkatlah dengan tenang!\""
            },
            {
                "number": 164,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ عَنْ عَمِّهِ قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ قَالَ قَالَتْ عَائِشَةُ وُأُمُّ سَلَمَةَ زَوْجَا النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَدْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصْبِحُ مِنْ أَهْلِهِ جُنُبًا فَيَغْتَسِلُ قَبْلَ أَنْ يُصَلِّيَ الْفَجْرَ ثُمَّ يَصُومُ يَوْمَئِذٍقَالَ فَذَكَرْتُ ذَلِكَ لِأَبِي هُرَيْرَةَ فَقَالَ لَا أَدْرِي أَخْبَرَنِي ذَلِكَ الْفَضْلُ بْنُ عَبَّاسٍ رَضِيَ اللَّهُ تَعَالَى عَنْهُ",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [anak saudara Ibnu Syihab] dari [pamannya] berkata; telah mengabarkan kepadaku [Abu Bakar bin Abdurrahman bin Al Harits bin Hisyam] berkata; [Aisyah] dan [Ummu Salamah], istri Nabi shallallahu 'alaihi wasallam, keduanya mengatakan; \"pada suatu pagi Rasulullah shallallahu 'alaihi wasallam dalam keadaan junub karena jima', kemudian beliau mandi sebelum beliau mengerjakan sholat fajar, dan pada hari itu beliau melanjutkan berpuasa.\" Kemudian (hadits tersebut) saya ceritakan kepada Abu Hurairah, maka dia mengatakan; \"Aku tidak tahu, tetapi Al Fadhl bin Abbas radhia Allahu ta'ala 'anhu yang memberitahukan kepadaku.\""
            },
            {
                "number": 165,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عُمَرَ أَبُو الْمُنْذِرِ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي عَلِيٍّ الزَّرَّادِ قَالَ حَدَّثَنِي جَعْفَرُ بْنُ تَمَّامِ بْنِ عَبَّاسٍ عَنْ أَبِيهِ قَالَأَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ أُتِيَ فَقَالَ مَا لِي أَرَاكُمْ تَأْتُونِي قُلْحًا اسْتَاكُوا لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَفَرَضْتُ عَلَيْهِمْ السِّوَاكَ كَمَا فَرَضْتُ عَلَيْهِمْ الْوُضُوءَ",
                "id": "Telah menceritakan kepada kami [Isma'il bin 'Amru, Abu Al Mundzir] berkata; telah menceritakan kepada kami [Sufyan] dari [Abu Ali Az Zarad] berkata; telah menceritakan kepadaku [Ja'far bin Tammam] dari [Bapaknya] berkata; Para sahabat menemui Nabi shallallahu 'alaihi wasallam, atau ada yang datang pada beliau. Maka beliau bertanya: \"Apa yang menyebabkan kalian menemuiku dengan gigi yang kuning. Bersiwaklah kalian, seandainya tidak akan memberatkan umatku, niscaya aku akan wajibkan bagi mereka untuk bersiwak sebagaimana aku wajibkan atas mereka berwudhu.\""
            },
            {
                "number": 166,
                "arab": "حَدَّثَنَا جَرِيرٌ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُفُّ عَبْدَ اللَّهِ وَعُبَيْدَ اللَّهِ وَكَثِيرًا مِنْ بَنِي الْعَبَّاسِ ثُمَّ يَقُولُ مَنْ سَبَقَ إِلَيَّ فَلَهُ كَذَا وَكَذَا قَالَ فَيَسْتَبِقُونَ إِلَيْهِ فَيَقَعُونَ عَلَى ظَهْرِهِ وَصَدْرِهِ فَيُقَبِّلُهُمْ وَيَلْزَمُهُمْ",
                "id": "Telah menceritakan kepada kami [Jarir] dari [Yazid bin Abu Ziyad] dari [Abdullah bin al Harits] berkata; Rasulullah shallallahu 'alaihi wasallam membariskan Abdullah, ubaidhullah dan banyak lagi sahabat dari kalangan Bani Al Abbas, seraya bersabda: \"Barangsiapa paling dahulu sampai kepadaku, maka ia akan mendapatkan ini dan itu.\" Abdullah berkata; Lalu mereka saling berlomba untuk sampai kepada Rasulullah shallallahu 'alaihi wasallam, sehingga diantara mereka ada yang menyentuh dada beliau dan ada juga yang menyentuh punggung beliau. Kemudian beliau menciumi mereka dan memeluk mereka.\""
            },
            {
                "number": 167,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَنْبَأَنَا يَحْيَى بْنُ أَبِي إِسْحَاقَ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عُبَيْدِ اللَّهِ بْنِ الْعَبَّاسِ قَالَجَاءَتْ الْغُمَيْصَاءُ أَوْ الرُّمَيْصَاءُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَشْكُو زَوْجَهَا وَتَزْعُمُ أَنَّهُ لَا يَصِلُ إِلَيْهَا فَمَا كَانَ إِلَّا يَسِيرًا حَتَّى جَاءَ زَوْجُهَا فَزَعَمَ أَنَّهَا كَاذِبَةٌ وَلَكِنَّهَا تُرِيدُ أَنْ تَرْجِعَ إِلَى زَوْجِهَا الْأَوَّلِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ لَكِ ذَلِكَ حَتَّى يَذُوقَ عُسَيْلَتَكِ رَجُلٌ غَيْرُهُ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah memberitakan kepada kami [Yahya bin Abu Ishaq] dari [Sulaiman bin Yasar] dari [ubaidhullah bin Abbas] berkata; Al Ghumaisha' atau Ar Rumaisha' menemui Rasulullah shallallahu 'alaihi wasallam mengadukan suaminya, dan perempuan itu menyatakan bahwa suaminya tidak mau menggaulinya. Tidak lama kemudian datanglah suaminya dan menyatakan bahwa istrinya berdusta, namun dia melakukannya hanya karena ingin kembali kepada suami pertamanya. Maka Rasulullah shallallahu 'alaihi wasallam berkata kepada perempuan itu: \"Engkau tidak akan bisa melakukannya hingga suami kedua merasakan madumu.\""
            },
            {
                "number": 168,
                "arab": "حَدَّثَنَا مُعَاوِيةُ بْنُ عَمْرٍو قَالَ حَدَّثَنَا زَائِدَةُ عَنْ مَنْصُورٍ عَنْ أَبِي هَاشِمٍ عَنْ يَحْيَى بْنِ عَبَّادٍ أَوْ عَنْ أَبِي هَاشِمٍ عَنْ حَجَّاجٍ شَكَّ مَنْصُورٌ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ قَالَ اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَوَاتِ وَمِلْءَ الْأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُقَالَ وَقَالَ مَنْصُورٌ وَحَدَّثَنِي عَوْنٌ عَنْ أَخِيهِ عُبَيْدِ اللَّهِ بِهَذَا",
                "id": "Telah menceritakan kepada kami [Mu'awiyah bin 'Amru] berkata; Telah menceritakan kepada kami [Za`idah] dari [Manshur] dari [Abu Hasyim] dari [Yahya bin 'Abbad] atau dari [Abu Hasyim] dari [Hajjaj], -Manshur ragu- dari [Sa'id bin Jubair] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam apabila mengucapkan: SAMI'ALLAHU LIMAN HAMIDAH (Allah Maha Mendengar bagi siapa saja yang memujiNya), beliau mengucapkan: ALLAHUMMA RABBANA LAKA AL HAMDU MIL`AS SAMAWATI WA MIL`AL ARDLI WA MIL`A MA SYI`TA MIN SYAI`IN BA'DU (Wahai Tuhan kami, milikMu segala puji sepenuh langit dan sepenuh bumi serta sepenuh apa pun setelah itu yang Engkau kehendaki). Ahmad berkata; [Manshur] berkata; dan telah menceritakan kepadaku ['Aun] dari saudaranya yaitu [ubaidhullah] seperti ini."
            },
            {
                "number": 169,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ وَمُحَمَّدُ بْنُ جَعْفَرٍ قَالَا حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ جَابِرِ بْنِ زَيْدٍ عَنِ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُرِيدَ عَلَى ابْنَةِ حَمْزَةَ أَنْ يَتَزَوَّجَهَا فَقَالَ إِنَّهَا ابْنَةُ أَخِي مِنْ الرَّضَاعَةِ وَإِنَّهُ يَحْرُمُ مِنْ الرَّضَاعَةِ مَا يَحْرُمُ مِنْ النَّسَبِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Bakr] dan [Muhammad bin Ja'far] mereka berdua berkata; Telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Jabir bin Zaid] dari [Ibnu Abbas]; bahwa Rasulullah shallallahu 'alaihi wasallam hendak dinikahkan dengan anak perempuan Hamzah, lalu beliau bersabda: \"Dia putri saudara sesusuanku, sesungguhnya diharamkan karena faktor sebagaimana apa yang diharamkan karena faktor nasab (garis keturunan).\""
            },
            {
                "number": 170,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ وَمُحَمَّدُ بْنُ جَعْفَرٍ قَالَا حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ يَعْلَى بْنِ حَكِيمٍ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍأَنَّهُ كَانَ لَا يَرَى بَأْسًا أَنْ يَتَزَوَّجَ الرَّجُلُ وَهُوَ مُحْرِمٌ وَيَقُولُ إِنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَزَوَّجَ مَيْمُونَةَ بِنْتَ الْحَارِثِ بِمَاءٍ يُقَالُ لَهُ سَرِفُ وَهُوَ مُحْرِمٌ فَلَمَّا قَضَى نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَجَّتَهُ أَقْبَلَ حَتَّى إِذَا كَانَ بِذَلِكَ الْمَاءِ أَعْرَسَ بِهَا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Bakr] dan [Muhammad bin Ja'far] mereka berdua berkata; Telah menceritakan kepada kami [Sa'id bin Abu 'Arubah] dari [Ya'la bin Hakim] dari [Ikrimah] dari [Ibnu Abbas]; bahwa ia berpendapat; \"tidak apa-apa orang yang sedang ihram melakukan pernikahan, \" dan ia mengatakan; \"Sesungguhnya Nabiyullah shallallahu 'alaihi wasallam menikahi Maimunah binti Al Harits di suatu sumber air yang bernama Saraf, saat itu beliau sedang ihram. Setelah Nabiyullah shallallahu 'alaihi wasallam menyelesaikan hajinya, beliau datang, lalu ketika berada di sumber air itu, beliau tinggal bersamanya.\""
            },
            {
                "number": 171,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي يَحْيَى الْقَتَّاتِ عَنْ مُجَاهِدٍ عَنِ ابْنِ عَبَّاسٍ قَالَمَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رَجُلٍ وَفَخِذُهُ خَارِجَةٌ فَقَالَ غَطِّ فَخِذَكَ فَإِنَّ فَخِذَ الرَّجُلِ مِنْ عَوْرَتِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sabiq] telah menceritakan kepada kami [Israil] dari [Abu Yahya Al Qattat] dari [Mujahid] dari [Ibnu Abbas], ia berkata; Rasulullah shallallahu 'alaihi wasallam melewati seorang laki-laki yang terlihat pahanya, maka beliau bersabda, \"Tutuplah pahamu, karena sesungguhnya paha laki-laki itu termasuk aurat.\""
            },
            {
                "number": 172,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَابِقٍ حَدَّثَنَا إِسْرَائِيلُ عَنْ إِبْرَاهِيمَ بْنِ مُهَاجِرٍ عَنْ مُجَاهِدٍ عَنِ ابْنِ عَبَّاسٍ قَالَقَالَ أَيُّ الْقِرَاءَتَيْنِ كَانَتْ أَخِيرًا قِرَاءَةُ عَبْدِ اللَّهِ أَوْ قِرَاءَةُ زَيْدٍ قَالَ قُلْنَا قِرَاءَةُ زَيْدٍ قَالَ لَا إِلَّا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَعْرِضُ الْقُرْآنَ عَلَى جَبْرَائِيلَ كُلَّ عَامٍ مَرَّةً فَلَمَّا كَانَ فِي الْعَامِ الَّذِي قُبِضَ فِيهِ عَرَضَهُ عَلَيْهِ مَرَّتَيْنِ وَكَانَتْ آخِرَ الْقِرَاءَةِ قِرَاءَةُ عَبْدِ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Sabiq] telah menceritakan kepada kami [Israil] dari [Ibrahim bin Muhajir] dari [Mujahid] dari [Ibnu Abbas], ia berkata; \"Bacaan siapa yang terakhir, bacaan Abdullah atau bacaan Zaid?\" kami menjawab; \"Bacaan Zaid.\" Ia berkata; \"Bukan, karena Rasulullah shallallahu 'alaihi wasallam setiap setahun sekali membacakan Al Qur`an kepada Jibra`il, namun pada tahun beliau wafat, beliau membacakannya dua kali, dan bacaan yang terakhir adalah bacaan Abdullah.\""
            },
            {
                "number": 173,
                "arab": "حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو حَدَّثَنَا أَبُو إِسْحَاقَ عَنْ سُفْيَانَ عَنْ حَبِيبِ بْنِ أَبِي عَمْرَةَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍفِي قَوْلِهِ{ الم غُلِبَتْ الرُّومُ }قَالَ غُلِبَتْ وَغَلَبَتْ قَالَ كَانَ الْمُشْرِكُونَ يُحِبُّونَ أَنْ تَظْهَرَ فَارِسُ عَلَى الرُّومِ لِأَنَّهُمْ أَهْلُ أَوْثَانٍ وَكَانَ الْمُسْلِمُونَ يُحِبُّونَ أَنْ تَظْهَرَ الرُّومُ عَلَى فَارِسَ لِأَنَّهُمْ أَهْلُ كِتَابٍ فَذَكَرُوهُ لِأَبِي بَكْرٍ فَذَكَرَهُ أَبُو بَكْرٍ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَا إِنَّهُمْ سَيَغْلِبُونَ قَالَ فَذَكَرَهُ أَبُو بَكْرٍ لَهُمْ فَقَالُوا اجْعَلْ بَيْنَنَا وَبَيْنَكَ أَجَلًا فَإِنْ ظَهَرْنَا كَانَ لَنَا كَذَا وَكَذَا وَإِنْ ظَهَرْتُمْ كَانَ لَكُمْ كَذَا وَكَذَا فَجَعَلَ أَجَلًا خَمْسَ سِنِينَ فَلَمْ يَظْهَرُوا فَذَكَرَ ذَلِكَ أَبُو بَكْرٍ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلَا جَعَلْتَهَا إِلَى دُونَ قَالَ أُرَاهُ قَالَ الْعَشْرِ قَالَ قَالَ سَعِيدُ بْنُ جُبَيْرٍ الْبِضْعُ مَا دُونَ الْعَشْرِ ثُمَّ ظَهَرَتْ الرُّومُ بَعْدُ قَالَ فَذَلِكَ قَوْلُهُ{ الم غُلِبَتْ الرُّومُ إِلَى قَوْلِهِ وَيَوْمَئِذٍ يَفْرَحُ الْمُؤْمِنُونَ }قَالَ يَفْرَحُونَ{ بِنَصْرِ اللَّهِ }",
                "id": "Telah menceritakan kepada kami [Mu'awiyah bin 'Amru] telah menceritakan kepada kami [Abu Ishaq] dari [Sufyan] dari [Habib bin Abu Amrah] dari [Sa'id bin Jubair] dari [Ibnu Abbas] tentang firmanNya (Alif laam Miim. Telah dikalahkan bangsa Romawi), ia berkata; \"Bangsa Romawi dikalahkan dan akhirnya kalah.\" Ia berkata; \"Orang-orang Musyrik senang (berharap) jika bangsa Persia dapat mengalahkan bangsa Romawi, karena mereka adalah penyembah berhala, sedang kaum Muslimin senang (berharap) jika Romawi dapat mengalahkan Persia, karena mereka adalah Ahli Kitab. Maka orang-orang menceritakannya pada Abu Bakar, maka Abu Bakar menceritakannya pada Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh nantinya mereka akan menang.\" Ibnu Abbas berkata; Lalu Abu Bakar memberitahukan kepada mereka, dan mereka berkata; \"Tentukan waktunya antara kami dan engkau; bila kami menang, maka bagi kami anu dan anu, dan bila kalian menang, maka bagi kalian anu dan anu.\" Lalu ditetapkanlah waktu lima tahun, namun mereka (bangsa Romawi) belum juga menang, akhirnya Abu Bakar menyampaikan hal itu pada Nabi Shallallahu 'alaihi Wasallam, maka beliau bersabda: \"Sebaiknya engkau tetapkan lebih dari itu.\" Ia berkata; Menurutku beliau mengatakan: \"Sepuluh tahun.\" Abdullah berkata; Sa'id bin Jubair berkata; Al Bidl'u adalah di bawah sepuluh, maka setelah itu bangsa Romawi memperoleh kemenangan. Ia melanjutkan, \"Itulah (makna) firmanNya: (Alif laam Miim. Telah dikalahkan bangsa Rumawi) hingga firmanNya (dan di hari (kemenangan bangsa Rumawi) itu bergembiralah orang-orang yang beriman). Ia berkata; \"Mereka bergembira dengan pertolongan Allah.\""
            },
            {
                "number": 174,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ لَيْثٍ عَنْ رَجُلٍ قَالَقَالَ لَهَا ابْنُ عَبَّاسٍ إِنَّمَا سُمِّيتِ أُمَّ الْمُؤْمِنِينَ لِتَسْعَدِي وَإِنَّهُ لَاسْمُكِ قَبْلَ أَنْ تُولَدِي",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Laits] dari [Seorang laki-laki] berkata; [Ibnu Abbas] mengatakan kepada Aisyah; \"Sesungguhnya engkau disebut ummul mukminin adalah agar engkau bahagia, karena sesungguhnya itu bukanlah namamu sebelum engkau dilahirkan.\""
            },
            {
                "number": 175,
                "arab": "حَدَّثَنِي مُعَاوِيَةُ قَالَ حَدَّثَنَا زَائِدَةُ عَنْ هِشَامٍ عَنْ قَيْسِ بْنِ سَعْدٍ حَدَّثَنِي عَطَاءٌ أَنَّ ابْنَ عَبَّاسٍ حَدَّثَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ قَالَ اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَوَاتِ وَمِلْءَ الْأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ",
                "id": "Telah menceritakan kepadaku [Mu'awiyah] berkata; Telah menceritakan kepada kami [Za`idah] dari [Hisyam] dari [Qais bin Sa'd] telah menceritakan kepadaku ['Atho`] bahwa [Ibnu Abbas] menceritakan kepadanya; bahwa Rasulullah shallallahu 'alaihi wasallam apabila mengangkat kepalanya dari ruku' mengatakan: \"ALLAHUMMA RABBANA LAKA AL HAMDU MIL`AS SAMAWATI WA MIL`AL ARDLI WA MIL`A MA SYI`TA MIN SYAI`IN BA'DU\" (Wahai Tuhan kami, milikMu segala puji sepenuh langit dan sepenuh bumi serta sepenuh apa pun setelah itu yang Engkau kehendaki).\""
            },
            {
                "number": 176,
                "arab": "حَدَّثَنَا مُعَاوِيَةُ حَدَّثَنَا أَبُو إِسْحَاقَ عَنْ مُحَمَّدِ بْنِ أَبِي حَفْصَةَ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنِ ابْنِ عَبَّاسٍ قَالَكَانَ الْفَتْحُ فِي ثَلَاثَ عَشْرَةَ خَلَتْ مِنْ رَمَضَانَ",
                "id": "Telah menceritakan kepada kami [Mu'awiyah] telah menceritakan kepada kami [Abu Ishaq] dari [Muhammad bin Abu Hafshah] dari [Az Zuhri] dari [ubaidhullah bin Abdullah] dari [Ibnu Abbas], ia berkata; \"Penaklukan kota Makkah terjadi pada hari ketiga belas ramadhan.\""
            },
            {
                "number": 177,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ عَنِ ابْنِ عَوْنٍ عَنْ مُجَاهِدٍ قَالَ كُنَّا عِنْدَ ابْنِ عَبَّاسٍ فَذَكَرُوا الدَّجَّالَ فَقَالُوا إِنَّهُ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ ك ف ر قَالَ مَا تَقُولُونَ قَالَ يَقُولُونَ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ ك ف ر قَالَ فَقَالَ ابْنُ عَبَّاسٍ لَمْ أَسْمَعْهُ قَالَ ذَلِكَ وَلَكِنْ قَالَأَمَّا إِبْرَاهِيمُ عَلَيْهِ السَّلَام فَانْظُرُوا إِلَى صَاحِبِكُمْ وَأَمَّا مُوسَى عَلَيْهِ السَّلَام فَرَجُلٌ آدَمُ جَعْدٌ عَلَى جَمَلٍ أَحْمَرَ مَخْطُومٍ بِخُلْبَةٍ كَأَنِّي أَنْظُرُ إِلَيْهِ إِذَا انْحَدَرَ فِي الْوَادِي يُلَبِّي",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu 'Adi] dari [Ibnu 'Aun] dari [Mujahid], ia berkata; Kami pernah bersama [Ibnu Abbas], lalu mereka menyebutkan tentang Dajjal, mereka berkata; \"Sesungguhnya di antara kedua matanya tertulis Kaaf Faa' Raa'.\" Dia berkata; \"Apa yang kalian katakan?\" Mujahid berkata; \"Mereka mengatakan bahwa di antara kedua matanya tertulis Kaaf faa' Raa'.\" Mujahid berkata; Maka Ibnu Abbas berkata; \"Aku tidak pernah mendengar beliau mengatakan itu, tetapi beliau mengatakan: \"Adapun Ibrahim 'Alaihis Salam, maka lihatlah pada teman kalian, sedangkan Musa 'Alaihis Salam, ia adalah seorang laki-laki (berkulit) kecoklatan dan bertubuh kekar yang sedang (menunggang) unta merah yang kendalinya terbuat dari sabut kurma, seolah-olah aku melihat kepadanya ketika menuruni lembah sambil bertalbiyah.\""
            },
            {
                "number": 178,
                "arab": "حَدَّثَنَا إِسْحَاقُ هُوَ الْأَزْرَقُ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَاقَ عَنْ أَبِي الْأَحْوَصِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي فَإِنَّ الشَّيْطَانَ لَا يَنْبَغِي لَهُ أَنْ يَتَمَثَّلَ بِمَثَلِي",
                "id": "Telah menceritakan kepada kami [Ishaq] ia adalah Al Azraq telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Abu Al Ahwash] dari [Abdullah bin Mas'ud] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barang siapa yang melihatku dalam mimpi maka sungguh ia telah melihatku, karena setan tidak dapat merubah diri seperti diriku.\""
            },
            {
                "number": 179,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ خُصَيْفٍ حَدَّثَنَا أَبُو عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ فَقَامُوا صَفَّيْنِ فَقَامَ صَفٌّ خَلْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصَفٌّ مُسْتَقْبِلَ الْعَدُوِّ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالصَّفِّ الَّذِينَ يَلُونَهُ رَكْعَةً ثُمَّ قَامُوا فَذَهَبُوا فَقَامُوا مَقَامَ أُولَئِكَ مُسْتَقْبِلَ الْعَدُوِّ وَجَاءَ أُولَئِكَ فَقَامُوا مَقَامَهُمْ فَصَلَّى بِهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَةً ثُمَّ سَلَّمَ ثُمَّ قَامُوا فَصَلَّوْا لِأَنْفُسِهِمْ رَكْعَةً ثُمَّ سَلَّمُوا ثُمَّ ذَهَبُوا فَقَامُوا مَقَامَ أُولَئِكَ مُسْتَقْبِلَ الْعَدُوِّ وَرَجَعَ أُولَئِكَ إِلَى مَقَامِهِمْ فَصَلَّوْا لِأَنْفُسِهِمْ رَكْعَةً ثُمَّ سَلَّمُوا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Khushaif] telah menceritakan kepada kami [Abu Ubaidah] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam sholat bersama kami dalam sholat Khauf, lalu mereka pun berdiri membentuk dua shaf, satu shaf berdiri di belakang Nabi shallallahu 'alaihi wasallam sementara shaf yang lain berada menghadap musuh. Lalu Rasulullah shallallahu 'alaihi wasallam sholat dengan shaf yang setelahnya satu rakaat, kemudian mereka bangun dan pergi menempati posisi mereka yang menghadap musuh, dan mereka pun menempati posisi mereka, maka Rasulullah shallallahu 'alaihi wasallam sholat bersama mereka satu rakaat kemudian beliau salam. Lantas mereka menyelesaikan sendiri sholatnya satu rakaat, kemudian salam dan pergi menempati posisi mereka menghadap musuh, mereka pun kembali ke tempat mereka lalu masing-masing sholat sendiri satu rakaat kemudia mereka salam."
            },
            {
                "number": 180,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ حَدَّثَنَا خُصَيْفٌ الْجَزَرِيُّ قَالَ حَدَّثَنِي أَبُو عُبَيْدَةَ بْنُ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ قَالَعَلَّمَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التَّشَهُّدَ وَأَمَرَهُ أَنْ يُعَلِّمَ النَّاسَ التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Fudlail] telah menceritakan kepada kami [Khushaif Al Jazari] ia berkata; Telah menceritakan kepadaku [Abu Ubaidah bin Abdullah] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam mengajarkan tasyahud kepadanya dan memerintahkan untuk mengajarkan kepada manusia, (yaitu); (ATTAHIYYATU LILLAH WASH SHALAWATU WATH THAYYIBAT, AS SALAMU'ALAIKA AYYUHAN NABIYYU WARAHMATULLAHI WABARAKATUH, AS SALAMU'ALAINA WA'ALA 'IBADILLAHISSHALIHIN, ASYHADU ALLA ILAHA ILLALAH WA ASYHADU ANNA MUHAMMADAN 'ABDUHU WARASULUH) (Segala penghormatan hanya milik Allah, juga segala pengagungan dan kebaikan. Semoga kesejahteraan terlimpahkan kepadamu semoga terlimpahkan kepada kita dan hamba-hamba Allah yang shalih, Aku bersaksi bahwa tiada Ilah selain Allah dan aku bersaksi bahwa Muhammad adalah hamba dan RasulNya)."
            },
            {
                "number": 181,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ حَدَّثَنَا الْأَعْمَشُ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ قَالَكُنَّا نُسَلِّمُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي الصَّلَاةِ فَيَرُدُّ عَلَيْنَا فَلَمَّا رَجَعْنَا مِنْ عِنْدِ النَّجَاشِيِّ سَلَّمْنَا عَلَيْهِ فَلَمْ يَرُدَّ عَلَيْنَا فَقُلْنَا يَا رَسُولَ اللَّهِ كُنَّا نُسَلِّمُ عَلَيْكَ فِي الصَّلَاةِ فَتَرُدُّ عَلَيْنَا فَقَالَ إِنَّ فِيَّ أَوْ فِي الصَّلَاةِ لَشُغْلًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Fudlail] telah menceritakan kepada kami [Al A'masy] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] ia berkata; Kami memberi salam kepada Rasulullah shallallahu 'alaihi wasallam ketika beliau sedang sholat, lalu beliau membalasnya. Ketika kami pulang dari pertemuan dengan Najasyi, kami kembali memberi salam kepada beliau, namun beliau tidak membalasnya, maka kami bertanya; Wahai Rasulullah, dulu kami memberi salam kepada engkau ketika sholat, engkau pun membalasnya? Beliau menjawab: \"Sesungguhnya aku\" atau, \"Di dalam sholat itu sedang sibuk.\""
            },
            {
                "number": 182,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ الْهَيْثَمِ أَبُو قَطَنٍ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ سَعِيدِ بْنِ عَمْرٍو عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍأَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَتَى لَيْلَةُ الْقَدْرِ قَالَ مَنْ يَذْكُرُ مِنْكُمْ لَيْلَةَ الصَّهْبَاوَاتِ قَالَ عَبْدُ اللَّهِ أَنَا بِأَبِي أَنْتَ وَأُمِّي وَإِنَّ فِي يَدِي لَتَمَرَاتٍ أَسْتَحِرُ بِهِنَّ مُسْتَتِرًا بِمُؤْخِرَةِ رَحْلِي مِنْ الْفَجْرِ وَذَلِكَ حِينَ طَلَعَ الْقَمَرُ",
                "id": "Telah menceritakan kepada kami [Amru bin Al Haitsam Abu Qathn] telah menceritakan kepada kami [Al Mas'udi] dari [Sa'id bin Amru] dari [Abu Ubaidah] dari [Abdullah bin Mas'ud] bahwa seorang laki-laki datang kepada Nabi shallallahu 'alaihi wasallam lalu berkata; Kapan terjadi lailatul qadar? Beliau bersabda: \"Siapa dari kalian yang ingat malam berwarna merah itu?\" Abdullah berkata; Aku, demi ayah dan ibuku jadi tebusanmu. Dan sesungguhnya di kedua tanganku ada beberapa kurma yang menjadikan menu sahurku sambil bersembunyi di balik bagian belakang tungganganku karena fajar tiba. Hal itu terjadi ketika bulan telah muncul."
            },
            {
                "number": 183,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ الْهَيْثَمِ حَدَّثَنَا شُعْبَةُ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الظُّهْرَ خَمْسًا فَقِيلَ زِيدَ فِي الصَّلَاةِ قِيلَ صَلَّيْتَ خَمْسًا فَسَجَدَ سَجْدَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Amru bin Al Haitsam] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] bahwa Nabi shallallahu 'alaihi wasallam sholat Zhuhur sebanyak lima rakaat, lalu dikatakan; (Engkau) telah menambah dalam sholat. dikatakan; Engkau sholat lima rakaat. Lalu beliau sujud dua kali."
            },
            {
                "number": 184,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الْكَرِيمِ قَالَ أَخْبَرَنِي زِيَادُ بْنُ أَبِي مَرْيَمَ عَنْ عَبْدِ اللَّهِ بْنِ مَعْقِلِ بْنِ مُقَرِّنٍ قَالَدَخَلْتُ مَعَ أَبِي عَلَى عَبْدِ اللَّهِ بْنِ مَسْعُودٍ فَقَالَ أَنْتَ سَمِعْتَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ النَّدَمُ تَوْبَةٌ قَالَ نَعَمْ وَقَالَ مَرَّةً سَمِعْتُهُ يَقُولُ النَّدَمُ تَوْبَةٌ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Abdul Karim] ia berkata; Telah mengabarkan kepadaku [Ziyad bin Abu Maryam] dari [Abdullah bin Ma'qil bin Muqarrin] ia berkata; Aku bersama ayahku masuk ke tempatnya [Abdullah bin Mas'ud] lalu ia berkata; Engkau telah mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Penyesalan itu adalah taubat.\" Ia berkata; Ya. Dan ia berkata sekali lagi; Aku mendengar beliau bersabda: \"Penyesalan itu adalah taubat.\""
            },
            {
                "number": 185,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ ذَرٍّ عَنْ وَائِلِ بْنِ مَهَانَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَصَدَّقْنَ يَا مَعْشَرَ النِّسَاءِ وَلَوْ مِنْ حُلِيِّكُنَّ فَإِنَّكُنَّ أَكْثَرُ أَهْلِ النَّارِ فَقَامَتْ امْرَأَةٌ لَيْسَتْ مِنْ عِلْيَةِ النِّسَاءِ فَقَالَتْ لِمَ يَا رَسُولَ اللَّهِ قَالَ لِأَنَّكُنَّ تُكْثِرْنَ اللَّعْنَ وَتَكْفُرْنَ الْعَشِيرَ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Manshur] dari [Dzarr] dari [Wa`il bin Mahanah] dari [Abdullah bin Mas'ud] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bersedekahlah kalian wahai para kaum wanita. meskipun dari perhiasan kalian sebab kalian merupakan penghuni neraka yang paling banyak.\" Lalu seorang wanita yang bukan tokoh wanita bertanya; Mengapa demikian wahai Rasulullah? Beliau menjawab: \"Karena kalian banyak mencela dan tidak menghargai kebaikan suami.\""
            },
            {
                "number": 186,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَهُمَا بَعْدَ السَّلَامِ وَقَالَ مَرَّةً إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجَدَ السَّجْدَتَيْنِ فِي السَّهْوِ بَعْدَ السَّلَامِ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Manshur] dari [Ibrahim] dari ['Alqamah] dari [Abdullah] bahwa Nabi shallallahu 'alaihi wasallam sujud dua kali setelah salam. Ia berkata sekali lagi; Sesungguhnya Nabi shallallahu 'alaihi wasallam sujud dua kali setelah salam ketika lupa."
            },
            {
                "number": 187,
                "arab": "حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ عَنْ عَاصِمِ بْنِ أَبِي النَّجُودِ عَنْ زِرِّ بْنِ حُبَيْشٍ عَنْ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَنْقَضِي الْأَيَّامُ وَلَا يَذْهَبُ الدَّهْرُ حَتَّى يَمْلِكَ الْعَرَبَ رَجُلٌ مِنْ أَهْلِ بَيْتِي اسْمُهُ يُوَاطِئُ اسْمِي",
                "id": "Telah menceritakan kepada kami [Umar bin Ubaid] dari ['Ashim bin Abu An Najud] dari [Zirr bin Hubaisy] dari [Abdullah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah akan berakhir hari-hari dan tidak akan masa pergi hingga ada seorang laki-laki dari Ahlu Baitku menguasai bangsa Arab, namanya sama dengan namaku.\""
            },
            {
                "number": 188,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الزُّبَيْرِيُّ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ سَمِعْتُ ابْنَ عُمَرَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَشَارَ بِيَدِهِ نَحْوَ الْمَشْرِقِ فَقَالَ هَا إِنَّ الْفِتَنَ مِنْ هَاهُنَا إِنَّ الْفِتَنَ مِنْ هَاهُنَا إِنَّ الْفِتَنَ مِنْ هَاهُنَا مِنْ حَيْثُ يَطْلُعُ قَرْنُ الشَّيْطَانِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah Az Zubairi] telah menceritakan kepada kami [Sufyan] dari [Abdullah bin Dinar] aku mendengar [Ibnu Umar] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda sambil menunjukkan tangannya ke arah timur, beliau bersabda: \"Ketahuilah, sesungguhnya fitnah akan muncul dari sini, fitnah akan muncul dari sini, fitnah akan muncul dari sini, dari tempat terbitnya tanduk setan.\""
            },
            {
                "number": 189,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنِ ابْنِ عُمَرَ قَالَوَقَّتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَهْلِ الْمَدِينَةِ ذَا الْحُلَيْفَةِ وَلِأَهْلِ نَجْدٍ قَرْنًا وَلِأَهْلِ الشَّأْمِ الْجُحْفَةَ وَقَالَ هَؤُلَاءِ الثَّلَاثُ حَفِظْتُهُنَّ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحُدِّثْتُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَلِأَهْلِ الْيَمَنِ يَلَمْلَمُ فَقِيلَ لَهُ الْعِرَاقُ قَالَ لَمْ يَكُنْ يَوْمَئِذٍ عِرَاقٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah] telah menceritakan kepada kami [Sufyan] dari [Abdullah bin Dinar] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam menentukan miqat bagi penduduk Madinah mulai dari Dzul Hulaifah, penduduk Najd dari Qarn dan penduduk Syam dari Juhfah.\" Ibnu Umar berkata, \"Ketiga miqat itu aku hafal dari Rasulullah shallallahu 'alaihi wasallam, dan aku diberitahu bahwa Rasulullah shallallahu 'alaihi wasallam mengatakan; \"Dan bagi penduduk Yaman mulai dari Yalamlam.\" Lalu ditanyakan kepadanya, \"Maksudnya Irak?\" Ia menjawab, \"Ketika itu belum Irak.\""
            },
            {
                "number": 190,
                "arab": "حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا مَرْثَدٌ يَعْنِي ابْنَ عَامِرٍ الْهُنَائِيَّ حَدَّثَنِي أَبُو عَمْرٍو النَّدَبِيُّ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ الْخَطَّابِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ لَيَعْجَبُ مِنْ الصَّلَاةِ فِي الْجَمِيعِ",
                "id": "Telah menceritakan kepada kami [Yunus bin Muhammad] telah menceritakan kepada kami [Martsad] -yakni Ibnu Amir Al Huna`i- telah menceritakan kepadaku [Abu Amru An Nadabi] telah menceritakan kepadaku [Abdullah bin Umar bin Al Khaththab] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh, Allah kagum dengan sholat yang dilakukan dengan berjama'ah.\""
            },
            {
                "number": 191,
                "arab": "حَدَّثَنَا خَلَفُ بْنُ الْوَلِيدِ حَدَّثَنَا أَبُو مَعْشَرٍ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ قَالَمَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِطَعَامٍ وَقَدْ حَسَّنَهُ صَاحِبُهُ فَأَدْخَلَ يَدَهُ فِيهِ فَإِذَا طَعَامٌ رَدِيءٌ فَقَالَ بِعْ هَذَا عَلَى حِدَةٍ وَهَذَا عَلَى حِدَةٍ فَمَنْ غَشَّنَا فَلَيْسَ مِنَّا",
                "id": "Telah menceritakan kepada kami [Khalaf bin Al Walid] telah menceritakan kepada kami [Abu Ma'syar] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah melewati tumpukan makanan dan telah diperbagus oleh pemiliknya. Lalu beliau memasukkan tangannya dan ternyata ada makanan yang telah rusak. Maka beliau pun berkata, \"Juallah yang ini dengan harga tertentu dan yang ini dengan harga tertentu pula. Barangsiapa menipu kami, ia bukan golongan kami.\""
            },
            {
                "number": 192,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ ثَابِتِ بْنِ ثَوْبَانَ حَدَّثَنَا حَسَّانُ بْنُ عَطِيَّةَ عَنْ أَبِي مُنِيبٍ الْجُرَشِيِّ عَنِ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُعِثْتُ بَيْنَ يَدَيْ السَّاعَةِ بِالسَّيْفِ حَتَّى يُعْبَدَ اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَجُعِلَ رِزْقِي تَحْتَ ظِلِّ رُمْحِي وَجُعِلَ الذِّلَّةُ وَالصَّغَارُ عَلَى مَنْ خَالَفَ أَمْرِي وَمَنْ تَشَبَّهَ بِقَوْمٍ فَهُوَ مِنْهُمْ",
                "id": "Telah menceritakan kepada kami [Abu An Nadlr] telah menceritakan kepada kami [Abdurrahman bin Tsabit bin Tsauban] telah menceritakan kepada kami [Hassan bin 'Athiyah] dari [Abu Munib Al Jurasyi] dari [Ibnu Umar] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku diutus menjelang hari kiamat dengan pedang hingga hanya Allah yang diibadahi tanpa ada sekutu bagi-Nya, dan rizkiku ditempatkan di bawah bayang-bayang tombak. Kehinaan dan kerendahan dijadikan bagi orang yang menyelisihi perintahku. Barangsiapa menyerupai suatu kaum berarti ia termasuk golongan mereka.\""
            },
            {
                "number": 193,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ أَخْبَرَنَا لَيْثٌ عَنْ مُجَاهِدٍ عَنِ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي الْبَيْتِ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Isma'il] telah mengabarkan kepada kami [Laits] dari [Mujahid] dari [Ibnu Umar], bahwa Nabi shallallahu 'alaihi wasallam melakukan sholat sunnah dua rakaat di rumah.\""
            },
            {
                "number": 194,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا أَيُّوبُ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا حَقُّ امْرِئٍ يَبِيتُ لَيْلَتَيْنِ وَلَهُ مَا يُرِيدُ أَنْ يُوصِيَ فِيهِ إِلَّا وَوَصِيَّتُهُ مَكْتُوبَةٌ عِنْدَهُ",
                "id": "Telah menceritakan kepada kami [Isma'il] telah menceritakan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tidak halal bagi seseorang untuk bermalam selama dua malam sementara ia mempunyai sesuatu untuk diwasiatkan, kecuali wasiat tersebut telah tertulis di sampingnya.\""
            },
            {
                "number": 195,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ أَخْبَرَنَا أَيُّوبُ عَنِ نَافِعٍ عَنِ ابْنِ عُمَرَ قَالَ أَحْسِبُهُ قَدْ رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَإِذَا مَاتَ أَحَدُكُمْ يُعْرَضُ عَلَيْهِ مَقْعَدُهُ غُدْوَةً وَعَشِيَّةً إِنْ كَانَ مِنْ أَهْلِ الْجَنَّةِ فَمِنْ الْجَنَّةِ وَإِنْ كَانَ مِنْ أَهْلِ النَّارِ فَمِنْ النَّارِ يُقَالُ هَذَا مَقْعَدُكَ حَتَّى تُبْعَثَ إِلَيْهِ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Isma'il] telah mengabarkan kepada kami [Ayyub] dari [Nafi'] dari [Ibnu Umar] ia berkata, \"Menurutku ia telah memarfu'kannya kepada Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika salah seorang dari kalian meninggal dunia, maka akan diperlihatkan kepadanya tempat duduknya setiap pagi dan sore. Jika ia termasuk ahli surga maka akan diperlihatkan surga, dan jika ia termasuk ahli neraka maka akan diperlihatkan neraka. Dikatakan kepadanya, 'Inilah tempat dudukmu', hingga ia dibangkitkan di hari kiamat.\""
            },
            {
                "number": 196,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ أَخْبَرَنَا أَيُّوبُ عَنْ نَافِعٍأَنَّ ابْنَ عُمَرَ اسْتُصْرِخَ عَلَى صَفِيَّةَ فَسَارَ فِي تِلْكَ اللَّيْلَةِ مَسِيرَةَ ثَلَاثِ لَيَالٍ سَارَ حَتَّى أَمْسَى فَقُلْتُ الصَّلَاةَ فَسَارَ وَلَمْ يَلْتَفِتْ فَسَارَ حَتَّى أَظْلَمَ فَقَالَ لَهُ سَالِمٌ أَوْ رَجُلٌ الصَّلَاةَ وَقَدْ أَمْسَيْتَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا عَجِلَ بِهِ السَّيْرُ جَمَعَ مَا بَيْنَ هَاتَيْنِ الصَّلَاتَيْنِ وَإِنِّي أُرِيدُ أَنْ أَجْمَعَ بَيْنَهُمَا فَسِيرُوا فَسَارَ حَتَّى غَابَ الشَّفَقُ ثُمَّ نَزَلَ فَجَمَعَ بَيْنَهُمَا",
                "id": "Telah menceritakan kepada kami [Isma'il] telah mengabarkan kepada kami [Ayyub] dari [Nafi'] bahwa [Ibnu Umar] dimintai tolong menemani Shafiyah, lalu ia berjalan pada malam itu sejauh perjalanan tiga hari, ia berjalan hingga sore hari. Aku berkata, 'sholatlah'. Namun ia tetap berjalan dan tidak menoleh, ia masih berjalan hingga hari sudah gelap, maka Salim atau seseorang berkata kepadanya, 'sholatlah karena hari telah sore.' Maka Ibnu Umar pun menjawab, 'Sesungguhnya Rasulullah shallallahu 'alaihi wasallam jika tergesa dalam perjalanan, beliau menjamak di antara kedua sholat ini, dan aku ingin menjamak keduanya, maka (tetap) berjalanlah kalian.' Lalu Ibnu Umar berjalan hingga terbenam matahari, kemudian singgah dan menjamak kedua sholat itu.\""
            },
            {
                "number": 197,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ أَنَّهُ سَمِعَ عَلِيًّا الْأَزْدِيَّ يُحَدِّثُ أَنَّهُ سَمِعَ ابْنَ عُمَرَ يُحَدِّثُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ صَلَاةُ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَىوَكَانَ شُعْبَةُ يَفْرَقُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin 'Atha] bahwa ia mendengar [Ali Al Azdi] menceritakan, bahwa ia mendengar [Ibnu Umar] menceritakan dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"sholat pada malam dan siang hari itu adalah dua rakaat-dua rakaat.\" Dan Syu'bah ketika itu sedang menyisirinya.\""
            },
            {
                "number": 198,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا عَطَاءُ بْنُ السَّائِبِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اعْبُدُوا الرَّحْمَنَ وَأَفْشُوا السَّلَامَ وَأَطْعِمُوا الطَّعَامَ وَادْخُلُوا الْجِنَانَ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami ['Atho` bin As Sa`ib] dari [bapaknya], dari [Abdullah bin 'Amru], dia berkata; bahwa Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Sembahlah Ar Rahman (Allah), sebarkanlah salam, berilah makan kepada orang miskin, maka engkau akan masuk surga.\""
            },
            {
                "number": 199,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍوأَنَّ رَجُلًا قَالَ اللَّهُمَّ اغْفِرْ لِي وَلِمُحَمَّدٍ وَحْدَنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ حَجَبْتَهَا عَنْ نَاسٍ كَثِيرٍ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] dari ['Atho` bin As Sa`ib] dari [bapaknya] dari [Abdullah bin 'Amru], dia berkata; bahwa ada seorang lelaki berdoa: \"Ya Allah, ampunilah aku dan Muhammad saja.\" Maka Rasulullah Shallallahu 'alaihi wa Salam pun bersabda: \"sungguh engkau telah menghalangi doa tersebut untuk orang banyak\""
            },
            {
                "number": 200,
                "arab": "حَدَّثَنَا خَلَفُ بْنُ الْوَلِيدِ حَدَّثَنَا ابْنُ عَيَّاشٍ عَنْ مُحَمَّدِ بْنِ زِيَادٍ الْأَلْهَانِيِّ عَنْ أَبِي رَاشِدٍ الْحُبْرَانِيِّ قَالَأَتَيْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ فَقُلْتُ لَهُ حَدِّثْنَا مَا سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَلْقَى بَيْنَ يَدَيَّ صَحِيفَةً فَقَالَ هَذَا مَا كَتَبَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَظَرْتُ فِيهَا فَإِذَا فِيهَا أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ قَالَ يَا رَسُولَ اللَّهِ عَلِّمْنِي مَا أَقُولُ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَبَا بَكْرٍ قُلْ اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ لَا إِلَهَ إِلَّا أَنْتَ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
                "id": "Telah menceritakan kepada kami [Khalaf bin Walid] telah menceritakan kepada kami [Ibnu 'Ayyasy] dari [Muhammad bin Ziyad Al Alhani] dari [Abu Rasyid Al Hubrani] dia berkata; aku mendatangi [Abdullah bin 'Amru bin Al 'Ash], aku katakan kepadanya: \"ceritakan kepada kami apa yang telah engkau dengar dari Rasul Shallallahu 'alaihi wa Salam.\" Maka dia menyodorkan ke tanganku sebuah lembaran shahifah seraya berkata: \"Ini yang dituliskan Rasulullah Shallallahu 'alaihi wa Salam untukku.\" Maka akupun melihat lembaran shahifah tersebut, dan aku dapatkan dalam lembaran tersebut bahwa Abu Bakar Ash Shidiq pernah bertanya kepada beliau: \"Wahai Rasulullah, ajarilah aku, apa yang harus aku ucapkan ketika berada pada waktu pagi dan sore hari?\" Maka Rasulullah Shallallahu 'alaihi wa Salam pun menjawab: \"wahai Abu Bakar, ucapkalah: ALLAHUMMA FAATHIROS SAMAAWAATI WAL ARDLI, `AALIMAL GHAIBI WASY SYAHAADAH, LAA ILLAHA ILLA ANTA, RABBA KULLI SYAI` WA MALIIKAHU, A`UUDZU BIKA MIN SYARRI NAFSII WA MIN SYARRI ASY SYAITHAANI WA SYIRKIHI, WA AN AQTARIFA `ALAA NAFSII SUU`AN AU AJURROHU ILA MUSLIM (Ya Allah, Tuhan pencipta langit dan bumi, Tuhan yang mengetahui yang Ghaib dan yang nyata, tiada tuhan yang berhak untuk disembah kecuali Engkau, Tuhan yang menguasai segala sesuatu dan merajainya, aku berlindung kepada-Mu dari kejahatan diriku, kejahan setan dan bala tentaranya, atau aku berbuat kejelekkan pada diriku atau aku mendorongnya pada seorang muslim).\""
            },
            {
                "number": 201,
                "arab": "حَدَّثَنَا أَبُو مُغِيرَةَ حَدَّثَنَا هِشَامُ بْنُ الْغَازِ حَدَّثَنِي عَمْرُو بْنُ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَهَبَطْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ ثَنِيَّةِ أَذَاخِرَ قَالَ فَنَظَرَ إِلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا عَلَيَّ رَيْطَةٌ مُضَرَّجَةٌ بِعُصْفُرٍ فَقَالَ مَا هَذِهِ فَعَرَفْتُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ كَرِهَهَا فَأَتَيْتُ أَهْلِي وَهُمْ يَسْجُرُونَ تَنُّورَهُمْ فَلَفَفْتُهَا ثُمَّ أَلْقَيْتُهَا فِيهِ ثُمَّ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا فَعَلَتْ الرَّيْطَةُ قَالَ قُلْتُ قَدْ عَرَفْتُ مَا كَرِهْتَ مِنْهَا فَأَتَيْتُ أَهْلِي وَهُمْ يَسْجُرُونَ تَنُّورَهُمْ فَأَلْقَيْتُهَا فِيهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَهَلَّا كَسَوْتَهَا بَعْضَ أَهْلِكَ وَذَكَرَ أَنَّهُ حِينَ هَبَطَ بِهِمْ مِنْ ثَنِيَّةِ أَذَاخِرَ صَلَّى بِهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى جَدْرٍ اتَّخَذَهُ قِبْلَةً فَأَقْبَلَتْ بَهْمَةٌ تَمُرُّ بَيْنَ يَدَيْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا زَالَ يُدَارِئُهَا وَيَدْنُو مِنْ الْجَدْرِ حَتَّى نَظَرْتُ إِلَى بَطْنِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ لَصِقَ بِالْجِدَارِ وَمَرَّتْ مِنْ خَلْفِهِ",
                "id": "Telah menceritakan kepada kami [Abu Mughirah] telah menceritakan kepada kami [Hisyam bin Al Ghoz] telah menceritakan kepadaku ['Amru bin Syu'aib] dari [bapaknya] dari [kakeknya], dia berkata; \"kami bersama Rasulullah Shallallahu 'alaihi wa Salam turun dari suatu tempat yang bernama Tsaniyah Adzakhir.\" Dia berkata; \"maka beliau melihat ke arahku, sedang aku waktu itu menggunakan kain tipis nan lembut yang sudah dicelup dengan warna kuning. Maka beliau pun berkata: \"apa-apaan ini\"! aku tahu sesungguhnya Rasulullah shallallahu 'alaihi wasallam marah dan tidak suka. Lalu aku pulang dan menemui keluargaku, waktu itu mereka sedang menghidupkan tungku masak, maka akupun segera melepas kainku dan aku lemparkan ke dalam tungku masak tersebut. Kemudian aku kembali menemui Rasulullah Shallallahu 'alaihi wa Salam. Beliau bertanya: \"Apa yang terjadi dengan kain itu?\" dia berkata; aku berkata; \"aku tahu bahwa engkau tidak suka dengan kain tersebut, maka aku pun pulang ke rumahku menemui mereka, dan aku dapati mereka sedang menyalakan tungku masak sehingga aku masukkan kain tersebut ke dalam tungku.\" Maka beliau pun bersabda: \"kenapa tidak kamu pakaikan saja untuk sebagian keluargamu.\" Dan dia menyebutkan bahwa ketika turun dari Tsaniyah Adzakhir, Rasulullah sholat bersama dengan mereka dan menghadap ke arah tembok yang dijadikan sebagai kiblat. Lalu muncullah seekor anak kambing lewat di hadapan Rasulullah Shallallahu 'alaihi wa Salam, maka Nabi pun berusaha mencegah anak kambing tersebut sambil terus mendekat ke arah tembok. Sehingga aku lihat perut Nabi menempel tembok dan anak kambing itu lewat di belakang beliau.\""
            },
            {
                "number": 202,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ حَسَّانَ بْنِ عَطِيَّةَ سَمِعْتُ أَبَا كَبْشَةَ السَّلُولِيَّ يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعُونَ حَسَنَةً أَعْلَاهَا مِنْحَةُ الْعَنْزِ مَا مِنْهَا حَسَنَةٌ يَعْمَلُ بِهَا عَبْدٌ رَجَاءَ ثَوَابِهَا وَتَصْدِيقَ مَوْعُودِهَا إِلَّا أَدْخَلَهُ اللَّهُ بِهَا الْجَنَّةَ",
                "id": "Telah menceritakan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Al Auza'i] dari [Hassan bin 'Athiyyah] dia berkata; aku mendengar [Abu Kabsyah As Saluli] berkata; aku mendengar [Abdullah bin 'Amru bin Al 'Ash] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Ada empat puluh cabang kebaikkan, yang paling baik dari semuanya adalah Manihatul 'Anz (binatang ternak yang dipinjamkan untuk diambil susunya), tidaklah seorang hamba beramal dari salah satu cabang kebaikkan tersebut dengan hanya mengharapkan pahala dan janji Allah, kecuali Allah akan memasukkannya ke surga\""
            },
            {
                "number": 203,
                "arab": "قَالَوَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ خَلَقَ خَلْقَهُ ثُمَّ جَعَلَهُمْ فِي ظُلْمَةٍ ثُمَّ أَخَذَ مِنْ نُورِهِ مَا شَاءَ فَأَلْقَاهُ عَلَيْهِمْ فَأَصَابَ النُّورُ مَنْ شَاءَ أَنْ يُصِيبَهُ وَأَخْطَأَ مَنْ شَاءَ فَمَنْ أَصَابَهُ النُّورُ يَوْمَئِذٍ فَقَدْ اهْتَدَى وَمَنْ أَخْطَأَ يَوْمَئِذٍ ضَلَّ فَلِذَلِكَ قُلْتُ جَفَّ الْقَلَمُ بِمَا هُوَ كَائِنٌ",
                "id": "(Masih dari jalur yang sama dengan hadits sebelumnya), dia ([Abdullah bin 'Amru]) berkata; aku mendengar Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"sesungguhnya Allah menciptakan makhluq-Nya kemudian dijadikanlah mereka dalam kondisi kegelapan, lalu Dia mengambil cahaya-Nya dengan sekehendak-Nya kemudian dilemparkan kepada mereka, cahaya itu akan mengenai bagi yang dikehendaki-Nya, dan tidak akan mengenai bagi yang tidak dikehendaki-Nya. Bagi yang mendapatkan cahaya pada hari itu ia akan mendapatkan petunjuk, dan bagi yang tidak mendapatkan cahaya pada hari itu ia akan tersesat. Maka itu yang aku katakan bahwa pena Allah telah kering dengan apa yang telah ditentukan.\""
            },
            {
                "number": 204,
                "arab": "و حَدَّثَنَا عَلِيُّ بْنُ أَبِي إِسْحَاقَ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ جُنَادَةَ الْمَعَافِرِيُّ أَنَّ أَبَا عَبْدِ الرَّحْمَنِ الْحُبُلِيَّ حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو حَدَّثَهُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الدُّنْيَا سِجْنُ الْمُؤْمِنِ وَسَنَتُهُ فَإِذَا فَارَقَ الدُّنْيَا فَارَقَ السِّجْنَ وَالسَّنَةَ",
                "id": "Telah menceritakan kepada kami [Ali bin Abu Ishaq] telah menceritakan kepada kami [Abdullah] telah mengkhabarkan kepada kami [Yahya bin Ayub] telah mengkhabarkan kepadaku [Abdullah bin junadah Al Ma'arifi] dia berkata; bahwa [Abu Abdurrahman Al Hubuli] telah menceritakan kepadanya dari [Abdullah bin 'Amru] bahwa dia telah menceritakan kepadanya dari Nabi Shallallahu 'alaihi wa Salam, beliau bersabda: \"Dunia adalah penjara orang mukmin, maka apabila dia berpisah dengan dunia (meninggal dunia) berarti ia telah berpisah dengan penjaranya.\" "
            },
            {
                "number": 205,
                "arab": "حَدَّثَنَا عَفَّانُ وَبَهْزٌ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ قَالَ سَمِعْتُ أَبَا الْعَبَّاسِ وَكَانَ رَجُلًا شَاعِرًا سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو قَالَجَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَأْذَنَهُ فِي الْجِهَادِ فَقَالَ أَحَيٌّ وَالِدَاكَ قَالَ نَعَمْ قَالَ فَفِيهِمَا فَجَاهِدْقَالَ بَهْزٌ أَخْبَرَنِي ابْنُ أَبِي ثَابِتٍ عَنْ أَبِي الْعَبَّاسِ قَالَ سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو",
                "id": "Telah menceritakan kepada kami ['Affan] dan [Bahz] mereka berkata: telah menceritakan kepada kami [Syu'bah] dari [Habib bin Abu Tsabit] dia berkata; aku mendengar [Abul Abbas] -dia adalah seorang lelaki yang pandai bersya'ir- berkata; aku mendengar [Abdullah bin 'Amru] berkata; seorang lelaki datang kepada Rasulullah Shallallahu 'alaihi wa Salam meminta izin kepadanya untuk pergi berjihad. Maka beliau bertanya: \"Apakah kedua orang tuamu masih hidup?\" \"Masih\" jawabnya. Beliau bersabda: \"Kepada keduanya hendaknya kamu berjihad.\" [Bahz] berkata: telah menceritakan kepada kami [Ibnu Abu Tsabit] dari [Abul Abbas] dia berkata: \"aku bertanya [Abdullah bin 'Amru].\""
            },
            {
                "number": 206,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي يَعْلَى بْنُ عَطَاءٍ عَنْ أَبِيهِ قَالَ أَظُنُّهُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ شُعْبَةُ شَكَّقَامَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَأْذِنُهُ فِي الْجِهَادِ فَقَالَ فَهَلْ لَكَ وَالِدَانِ قَالَ نَعَمْ قَالَ أُمِّي قَالَ انْطَلِقْ فَبِرَّهَا قَالَ فَانْطَلَقَ يَتَخَلَّلُ الرِّكَابَ",
                "id": "Telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Syu'bah] telah mengkhabarkan kepadaku [Ya'la bin Atho`] dari [bapaknya], dia berkata; aku mengira bahwa hadits itu berasal dari [Abdullah bin 'Amru], dia berkata; -Syu'bah masih meragukan- Seorang laki-laki berdiri kepada Rasulullah Shallallahu 'alaihi wa Salam dan meminta izin kepadanya untuk pergi jihad. Maka beliau bersabda: \"Apakah engkau masih mempunyai kedua orang tua?\" Dia berkata; \"Ya, ibuku\" Beliau bersabda: \"Pergi dan berbuat baiklah kepada ibumu.\" Dia berkata; maka lelaki itu pun pergi di antara orang-orang."
            },
            {
                "number": 207,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ الْمُغِيرَةِ عَنْ ثَابِتٍ حَدَّثَنَا رَجُلٌ مِنْ الشَّامِ وَكَانَ يَتْبَعُ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ وَيَسْمَعُ قَالَكُنْتُ مَعَهُ فَلَقِيَ نَوْفًا فَقَالَ نَوْفٌ ذُكِرَ لَنَا أَنَّ اللَّهَ تَعَالَى قَالَ لِمَلَائِكَتِهِ ادْعُوا لِي عِبَادِي قَالُوا يَا رَبِّ كَيْفَ وَالسَّمَوَاتُ السَّبْعُ دُونَهُمْ وَالْعَرْشُ فَوْقَ ذَلِكَ قَالَ إِنَّهُمْ إِذَا قَالُوا لَا إِلَهَ إِلَّا اللَّهُ اسْتَجَابُوا قَالَ يَقُولُ لَهُ عَبْدُ اللَّهِ بْنُ عَمْرٍو صَلَّيْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْمَغْرِبِ أَوْ غَيْرَهَا قَالَ فَجَلَسَ قَوْمٌ أَنَا فِيهِمْ يَنْتَظِرُونَ الصَّلَاةَ الْأُخْرَى قَالَ فَأَقْبَلَ إِلَيْنَا يُسْرِعُ الْمَشْيَ كَأَنِّي أَنْظُرُ إِلَى رَفْعِهِ إِزَارَهُ لِيَكُونَ أَحَثَّ لَهُ فِي الْمَشْيِ فَانْتَهَى إِلَيْنَا فَقَالَ أَلَا أَبْشِرُوا هَذَاكَ رَبُّكُمْ أَمَرَ بِبَابِ السَّمَاءِ الْوُسْطَى أَوْ قَالَ بِبَابِ السَّمَاءِ فَفُتِحَ فَفَاخَرَ بِكُمْ الْمَلَائِكَةَ قَالَ انْظُرُوا إِلَى عِبَادِي أَدَّوْا حَقًّا مِنْ حَقِّي ثُمَّ هُمْ يَنْتَظِرُونَ أَدَاءَ حَقٍّ آخَرَ يُؤَدُّونَهُ",
                "id": "Telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Sulaiman] -yaitu Ibnul Mughirah- dari [Tsabit] telah menceritakan kepada kami [seorang laki-laki] dari Syam, dia adalah seorang yang selalu mengikuti dan mendengar Abdullah bin 'Amru bin Al 'Ash, ia berkata; aku sedang bersama Abdullah bin 'Amru, lalu dia bertemu dengan Nauf, maka Nauf pun berkata: telah disebutkan kepadaku bahwa Allah Ta`ala berfirman kepada para Malaikat-Nya: \"Panggilkanlah hamba-hamba-Ku.\" Mereka menjawab: \"Wahai Rabb, bagaimana mungkin, langit yang tujuh lapis ada di atas mereka, dan Arsy ada di atasnya lagi?\" Allah menjawab: \"Sesungguhnya jika mereka mengucapkan LAA ILAAHA ILLAH maka doa mereka akan dikabulkan.\" (Lelaki dari Syam) berkata: [Abdullah bin 'Amru] berkata kepada Nauf; \"kami sholat maghrib bersama Rasulullah Shallallahu 'alaihi wa Salam atau sholat selainnya, maka orang-orang duduk sedang aku juga di antara mereka sedang menunggu sholat yang lain, kemudian beliau membalikkan badannya dan berjalan dengan cepat, seakan-akan aku melihat sarungnya diangkat lebih tinggi agar bisa berjalan dengan cepat, lalu beliau berhenti di hadapan kami dan bersabda: \"maukah kalian aku beri kabar gembira, Rabb kalian memerintahkan pintu langit yang tengah, \" atau beliau berkata: \"pintu langit agar dibuka. Kemudian Dia membangga-banggakan kalian di hadapan para malaikat-Nya. Dia berkata; \"Lihatlah hamba-hamba Ku, mereka melaksanakan hak kewajiban dari-Ku, kemudian mereka juga sedang menunggu untuk mengerjakan hak untuk-Ku yang lainnya.\""
            },
            {
                "number": 208,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ الْهَيْثَمِ أَبُو قَطَنٍ وَأَبُو النَّضْرِ قَالَا حَدَّثَنَا الْمَسْعُودِيُّ عَنْ إِيَادِ بْنِ لَقِيطٍ عَنْ أَبِي رِمْثَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَدُ الْمُعْطِي الْعُلْيَا أُمَّكَ وَأَبَاكَ وَأُخْتَكَ وَأَخَاكَ ثُمَّ أَدْنَاكَ أَدْنَاكَ وَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هَؤُلَاءِ بَنُو يَرْبُوعٍ قَتَلَةُ فُلَانٍ قَالَ أَلَا لَا تَجْنِي نَفْسٌ عَلَى أُخْرَى و قَالَ أَبِي قَالَ أَبُو النَّضْرِ فِي حَدِيثِهِ دَخَلْتُ الْمَسْجِدَ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ وَيَقُولُ يَدُ الْمُعْطِي الْعُلْيَا",
                "id": "Telah menceritakan kepada kami ['Amru bin Al Haitsam Abu Qaththan] dan [Abu An Nadlr] mereka berkata; telah menceritakan kepada kami [Al Mas'udi] dari [Iyad bin laqith] dari [Abu Rimtsah] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Yang paling berhak memberi adalah ibumu, bapakmu, saudara perempuanmu, dan saudara lelakimu, kemudian orang yang ada di bawahmu kebawah.\" Seorang laki-laki berkata; \" Wahai Rasulullah, mereka itu adalah Bani Yarbu` orang yang telah membunuh si Fulan.\" Beliau berkata: \"Ketahuilah, janganlah seseorang membuat kecelakaan bagi orang lain.\" Bapakku berkata; Abu An Nadlr berkata dalam haditsnya; aku masuk ke dalam masjid ketika itu Rasulullah Shallallahu 'alaihi wa Salam sedang berkhutbah, beliau berkata; \"orang yang paling berhak memberi\""
            },
            {
                "number": 209,
                "arab": "حَدَّثَنَا يُونُسُ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ حَدَّثَنَا إِيَادُ بْنُ لَقِيطٍ عَنْ أَبِي رِمْثَةَ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَهُ نَاسٌ مِنْ رَبِيعَةَ يَخْتَصِمُونَ فِي دَمٍ فَقَالَ الْيَدُ الْعُلْيَا أُمُّكَ وَأَبُوكَ وَأُخْتُكَ وَأَخُوكَ وَأَدْنَاكَ أَدْنَاكَ قَالَ فَنَظَرَ فَقَالَ مَنْ هَذَا مَعَكَ أَبَا رِمْثَةَ قَالَ قُلْتُ ابْنِي قَالَ أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِوَذَكَرَ قِصَّةَ الْخَاتَمِ",
                "id": "Telah menceritakan kepada kami [Yunus] telah menceritakan kepada kami [Hammad] -yaitu Ibnu Salamah- dari [Abdul Malik bin Umair], dia berkata; telah menceritakan kepada kami [Iyad bin laqith] dari [Abu Rimtsah], dia berkata: aku mendatangi Nabi Shallallahu 'alaihi wa Salam sedang di sisi beliau orang-orang dari suku Rabi'ah, mereka memperdebatkan tentang dam (denda), maka beliau bersabda: \"Yang paling berhak memberi adalah ibumu, bapakmu, saudara perempuanmu, saudara lelakimu, dan orang yang ada di bawahmu kebawah.\" Kemudian beliau melihat lalu bersabda, \"Siapa orang yang bersama kamu ini?\" Dia berkata; aku menjawab: \"Ini anakku.\" Beliau bersabda: \"Adapun dia tidak akan berbuat jahat kepadamu dan kamu tidak akan berbuat jahat kepadanya.\" Kemudian disebutlah hadits tersebut diatas."
            },
            {
                "number": 210,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ إِيَادِ بْنِ لَقِيطٍ السَّدُوسِيِّ قَالَ سَمِعْتُ أَبَا رِمْثَةَ التَّيْمِيَّ قَالَجِئْتُ مَعَ أَبِي إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ابْنُكَ هَذَا قُلْتُ نَعَمْ قَالَ أَتُحِبُّهُ قُلْتُ نَعَمْ قَالَ أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Iyad bin laqith As Sadusi], dia berkata: Aku mendengar [Abu Rimtsah At Taimi] berkata: Aku datang bersama dengan bapakku kepada Nabi Shallallahu 'alaihi wa Salam, maka beliau bersabda: \"Apakah ini anakmu?\" 'Iya\" jawabku. Beliau bersabda: \"Apakah engkau menyayanginya?\" \"Iya\" jawabku. Beliau bersabda: \"Adapun dia (anak tersebut) tidak akan berbuat jahat kepadamu dan kamu tidak akan berbuat jahat kepadanya.\""
            },
            {
                "number": 211,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ وَعَفَّانُ قَالَا حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادٍ حَدَّثَنَا إِيَادٌ عَنْ أَبِي رِمْثَةَقَالَ انْطَلَقْتُ مَعَ أَبِي نَحْوَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَأَيْتُهُ قَالَ لِي أَبِي هَلْ تَدْرِي مَنْ هَذَا قُلْتُ لَا فَقَالَ لِي أَبِي هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاقْشَعْرَرْتُ حِينَ قَالَ ذَاكَ وَكُنْتُ أَظُنُّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا لَا يُشْبِهُ النَّاسَ فَإِذَا بَشَرٌ لَهُ وَفْرَةٌ قَالَ عَفَّانُ فِي حَدِيثِهِ ذُو وَفْرَةٍ وَبِهَا رَدْعٌ مِنْ حِنَّاءٍ عَلَيْهِ ثَوْبَانِ أَخْضَرَانِ فَسَلَّمَ عَلَيْهِ أَبِي ثُمَّ جَلَسْنَا فَتَحَدَّثْنَا سَاعَةً ثُمَّ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي ابْنُكَ هَذَا قَالَ إِي وَرَبِّ الْكَعْبَةِ قَالَ حَقًّا قَالَ أَشْهَدُ بِهِ فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَاحِكًا مِنْ ثَبْتِ شَبَهِي بِأَبِي وَمِنْ حَلِفِ أَبِي عَلَيَّ ثُمَّ قَالَ أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ قَالَ وَقَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ{ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى }قَالَ ثُمَّ نَظَرَ إِلَى مِثْلِ السِّلْعَةِ بَيْنَ كَتِفَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي لَأَطَبُّ الرِّجَالِ أَلَا أُعَالِجُهَا لَكَ قَالَ لَا طَبِيبُهَا الَّذِي خَلَقَهَا",
                "id": "Telah menceritakan kepada kami [Hisyam bin Abdul Malik] dan ['Affan] mereka berkata; telah menceritakan kepada kami [ubaidhullah bin Iyadl] telah menceritakan kepada kami [Iyadl] dari [Abu Rimtsah], dia berkata: aku bersama bapakku bertolak menuju Rasulullah Shallallahu 'alaihi wa Salam, maka ketika aku melihatnya, bapakku berkata kepadaku; \"Tahukah engkau siapa orang ini?\"Tidak\" jawabku. Bapakku berkata: \"Dia adalah Muhammad Rasulullah Shallallahu 'alaihi wa Salam.\" Dia berkata; \"maka aku pun bergetar ketika bapakku mengatakan begitu, aku mengira bahwa Rasulullah Shallallahu 'alaihi wa Salam adalah seorang laki-laki yang tidak sama dengan kebanyakkan manusia, ternyata dia adalah seorang laki-laki yang rambutnya menyentuh daun telinganya.\" Affan berkata di dalam haditsnya; \"Mempunyai rambut yang menyentuh daun telinga, rambutnya ada inai, dan mengenakan dua lembar selendang berwarna biru. Kemudian bapakku mengucapkan salam kepadanya, kemudian kamu duduk dan berbicang-bincang selama satu jam. Lalu Rasulullah Shallallahu 'alaihi wa Salam berkata kepada bapakku: \"Apakah ini anakmu? ' Dia menjawab, \"Ya, demi Rabbul Ka'bah.\" Dia berkata; \"Ini benar.\" Lalu berkata lagi, \"Aku berani bersaksi atasnya.\" Maka tersenyumlah Rasulullah Shallallahu 'alaihi wa Salam kepada bapakku yang menguatkan kemiripanku dengannya dan juga karena sumpahnya kepada Allah atas diriku. Kemudian beliau bersabda: \"Adapun dia, sungguh tidak akan berbuat jahat kepadamu dan kamu tidak akan berbuat jahat padanya.\" Lalu beliau membaca ayat: \"dan seorang yang berdosa tidak akan memikul dosa orang lain.\" Kemudian bapakku melihat semisal luka yang ada pada pundak Rasulullah Shallallahu 'alaihi wa Salam, dan berkata; \"wahai Rasulullah, sesungguhnya aku adalah orang yang paling paham tentang kedokteran di antara orang-orang, maka bolehkan aku mengobati lukamu?\" \"Tidak, dokternya adalah yang telah menciptakannya (Allah).\" Jawab beliau. "
            },
            {
                "number": 212,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ عَنِ ابْنِ أَبْجَرَ عَنْ إِيَادِ بْنِ لَقِيطٍ عَنْ أَبِي رِمْثَةَ قَالَانْطَلَقْتُ مَعَ أَبِي وَأَنَا غُلَامٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقَالَ لَهُ أَبِي إِنِّي رَجُلٌ طَبِيبٌ فَأَرِنِي هَذِهِ السِّلْعَةَ الَّتِي بِظَهْرِكَ قَالَ وَمَا تَصْنَعُ بِهَا قَالَ أَقْطَعُهَا قَالَ لَسْتَ بِطَبِيبٍ وَلَكِنَّكَ رَفِيقٌ طَبِيبُهَا الَّذِي وَضَعَهَا وَقَالَ غَيْرُهُ الَّذِي خَلَقَهَا",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Abu Bakr bin Abi Syaibah] telah menceritakan kepada kami [Husain bin Ali] dari [Ibnu Abjar] dari [Iyad bin Laqith] dari [Abu Rimtsah], dia berkata: aku bersama dengan ayahku pergi kepada Rasulullah Shallallahu 'alaihi wa Salam sedang aku masih seorang bocah. Dia berkata; maka ayahku berkata kepada Rasulullah Shallallahu 'alaihi wa Salam; \"sesungguhnya aku adalah seorang laki-laki yang paham ilmu kedokteran, maka perlihatkanlah kepadaku luka yang ada di punggungmu.\" Beliau bersabda: \"Apa yang akan kamu lakukan?\" \"Aku akan membelahnya.\" Jawabnya. Beliau bersabda: \"Sesungguhnya engkau bukan seorang dokter, engkau hanya bisa membantu memberinkan manfaat, dokternya adalah Dzat yang telah menjadikannya terluka.\" Yang lain berkata: \"yang menciptakannya.\""
            },
            {
                "number": 213,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ عَنْ عَلِيِّ بْنِ صَالِحٍ حَدَّثَنِي إِيَادُ بْنُ لَقِيطٍ عَنْ أَبِي رِمْثَةَ قَالَحَجَجْتُ فَرَأَيْتُ رَجُلًا جَالِسًا فِي ظِلِّ الْكَعْبَةِ فَقَالَ أَبِي تَدْرِي مَنْ هَذَا هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا انْتَهَيْنَا إِلَيْهِ إِذَا رَجُلٌ ذُو وَفْرَةٍ بِهِ رَدْعٌ وَعَلَيْهِ ثَوْبَانِ أَخْضَرَانِ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepadaku [Abu Bakr bin Abi Syaibah] telah menceritakan kepada kami [Muhammad bin Bisyr] dari [Ali bin Shalih] telah menceritakan kepadaku [Iyad bin Laqith] dari [Abi Rimtsah], dia berkata; \"aku pernah melakukan ibadah haji dan aku lihat seorang laki-laki duduk di bawah bayang-bayang Ka'bah, lalu bapakku berkata; 'Tahukah kamu siapa orang ini, ini adalah Rasulullah Shallallahu 'alaihi wa Salam.' Maka ketika kami sampai dihadapannya, aku lihat bahwa dia adalah seorang laki-laki yang mempunyai rambut yang menyentuh daun telinga, berbau harum, dan mengenakan dua selendang berwana biru.\""
            },
            {
                "number": 214,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي عَمْرُو بْنُ مُحَمَّدِ بْنِ بُكَيْرٍ النَّاقِدُ حَدَّثَنَا هُشَيْمٌ غَيْرَ مَرَّةٍ قَالَ أَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ عَنْ إِيَادِ بْنِ لَقِيطٍ عَنْ أَبِي رِمْثَةَ التَّيْمِيِّأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعِي ابْنٌ لِي فَقَالَ ابْنُكَ هَذَا قُلْتُ أَشْهَدُ بِهِ قَالَ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ قَالَ وَرَأَيْتُ الشَّيْبَ أَحْمَرَ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepadaku [Amru bin Muhammad bin Bukair An Naqid] telah menceritakan kepada kami [Husyaim] telah mengkabarkan kepadaku [Abdul Malik bin Umair] dari [Iyad bin Laqith] dari [Abu Rimtsah At Taimi], dia berkata; aku datang kepada Nabi Shallallahu 'alaihi wa Salam sedang aku bersama dengan anakku, maka beliaupun berkata; \"Apakah ini putramu?\" Aku menjawab: \"Aku bersaksi dengannya.\" Beliau berkata; \"Dia tidak akan berbuat jahat kepadamu dan kamu tidak akan berbuat jahat kepadanya.\" Dia berkata; \"dan aku melihat uban (beliau) berwarna merah.\""
            },
            {
                "number": 215,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي شَيْبَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ إِبْرَاهِيمَ التُّسْتَرِيُّ حَدَّثَنَا صَدَقَةُ بْنُ أَبِي عِمْرَانَ عَنْ رَجُلٍ هُوَ ثَابِتُ بْنُ مُنْقِذٍ عَنْ أَبِي رِمْثَةَ قَالَانْطَلَقْتُ أَنَا وَأَبِي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا كُنَّا فِي بَعْضِ الطَّرِيقِ فَلَقِينَاهُ فَقَالَ لِي أَبِي يَا بُنَيَّ هَذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَكُنْتُ أَحْسَبُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُشْبِهُ النَّاسَ فَإِذَا رَجُلٌ لَهُ وَفْرَةٌ بِهَا رَدْعٌ مِنْ حِنَّاءٍ عَلَيْهِ بُرْدَانِ أَخْضَرَانِ قَالَ كَأَنِّي أَنْظُرُ إِلَى سَاقَيْهِ قَالَ فَقَالَ لِأَبِي مَنْ هَذَا مَعَكَ قَالَ هَذَا وَاللَّهِ ابْنِي قَالَ فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحَلِفِ أَبِي عَلَيَّ ثُمَّ قَالَ صَدَقْتَ أَمَا إِنَّكَ لَا تَجْنِي عَلَيْهِ وَلَا يَجْنِي عَلَيْكَ قَالَ وَتَلَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ{ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى }",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Syaiban bin Abi Syaibah] telah menceritakan kepada kami [Yazid] -yaitu Ibnu Ibrahim At Tustari telah menceritakan kepada kami [Shodaqoh bin Abi Imron] dari seorang lelaki yaitu [Tsabit bin Munqidz] dari [Abu Rimtsah], dia berkata: \"aku bersama dengan bapakku pergi kepada Rasulullah Shallallahu 'alaihi wa Salam, maka ketika kami sedang berada pada salah satu jalan kami bertemu dengannya (Shallallahu 'alaihi wa Salam), lalu bapakku berkata kepadaku, 'Wahai anakku, ini adalah Rasulullah Shallallahu 'alaihi wa Salam.'\" Dia berkata; \"aku mengira bahwa Rasulullah Shallallahu 'alaihi wa Salam adalah seseorang yang tidak mirip dengan kebanyakkan manusia, padahal beliau adalah seorang laki-laki yang mempunyai rambut yang menyentuh daun telinga, mengenakan inai, dan mengenakan dua selendang berwana biru.\" Dia berkata; \"seakan aku melihat pada kedua betisnya.\" Dia berkata; Rasulullah berkata kepada bapakku: \"Siapa yang bersamamu ini?\" Dia menjawab, \"Demi Allah ini adalah putraku.\" Dia berkata; Rasulullah Shallallahu 'alaihi wa Salam tertawa karena bapakku bersumpah kepada Allah atas aku. Kemudian beliau bersabda: \"Engkau telah berkata benar, adapun dia, sungguh tidak akan berbuat jahat kepadamu dan kamu tidak akan berbuat jahat kepadanya.\" Dia berkata; kemudian Rasulullah Shallallahu 'alaihi wa Salam membaca ayat; \"dan seorang yang berdosa tidak akan memikul dosa orang lain\"."
            },
            {
                "number": 216,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي جَعْفَرُ بْنُ حُمَيْدٍ الْكُوفِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادِ بْنِ لَقِيطٍ عَنْ أَبِيهِ عَنْ أَبِي رِمْثَةَ قَالَانْطَلَقْتُ مَعَ أَبِي نَحْوَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا رَأَيْتُهُ قَالَ أَبِي هَلْ تَدْرِي مَنْ هَذَا قُلْتُ لَا قَالَ هَذَا مُحَمَّدٌ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَاقْشَعْرَرْتُ حِينَ قَالَ ذَلِكَ وَكُنْتُ أَظُنُّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ لَا يُشْبِهُ النَّاسَ فَإِذَا بَشَرٌ ذُو وَفْرَةٍ وَبِهَا رَدْعُ حِنَّاءٍ وَعَلَيْهِ بُرَدَانِ أَخْضَرَانِ فَسَلَّمَ عَلَيْهِ أَبِي ثُمَّ جَلَسْنَا فَتَحَدَّثْنَا سَاعَةً ثُمَّ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَبِي ابْنُكَ هَذَا قَالَ إِي وَرَبِّ الْكَعْبَةِ قَالَ حَقًّا قَالَ أَشْهَدُ بِهِ فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَاحِكًا مِنْ تَثْبِيتِ شَبَهِي بِأَبِي وَمِنْ حَلِفِ أَبِي عَلَيَّ ثُمَّ قَالَ أَمَا إِنَّهُ لَا يَجْنِي عَلَيْكَ وَلَا تَجْنِي عَلَيْهِ وَقَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ{ وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَى }ثُمَّ نَظَرَ إِلَى مِثْلِ السِّلْعَةِ بَيْنَ كَتِفَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي كَأَطَبِّ الرِّجَالِ أَلَا أُعَالِجُهَا لَكَ قَالَ لَا طَبِيبُهَا الَّذِي خَلَقَهَا",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepadaku [Ja'far bin Humaid Al Kufi] telah menceritakan kepada kami [ubaidhullah bin Iyad bin laqith] dari [bapaknya] dari [Abu Rimtsah], dia berkata: aku bersama bapakku bertolak menuju Rasulullah Shallallahu 'alaihi wa Salam, maka ketika aku melihatnya, bapakku berkata kepadaku; \"Tahukah kamu siapa orang ini?\" \"Tidak\" jawabku. Bapakku berkata; \"Dia adalah Muhammad Rasulullah Shallallahu 'alaihi wa Salam.\" Dia berkata; maka aku pun bergetar ketika bapakku mengatakan kepadaku begitu, aku mengira bahwa Rasulullah Shallallahu 'alaihi wa Salam adalah seorang laki-laki yang tidak sama dengan kebanyakkan manusia, ternyata dia adalah seorang laki-laki yang rambutnya menyentuh daun telinganya, pada rambutnya terdapat inai dan mengenakan dua lembar selendang berwarna biru. Lalu bapakku mengucapkan salam kepadanya. Kemudian kami duduk dan berbincang selama satu jam. kemudian Rasulullah Shallallahu 'alaihi wa Salam berkata kepada bapakku, \"Apakah ini anakmu?\" dia menjawab, \"Ya, demi Rabbul Ka'bah.\" Dia berkata; \"Ini benar.\" Lalu berkata lagi, \"Aku berani bersaksi atasnya.\" Maka tersenyumlah Rasulullah Shallallahu 'alaihi wa Salam kepada bapakku yang menguatkan kemiripanku dengannya dan juga karena sumpahnya kepada Allah atas diriku. Kemudian beliau bersabda: \"Adapun dia, sungguh tidak akan berbuat jahat kepadamu dan kamu tidak akan berbuat jahat padanya.\" Lalu beliau membaca ayat: \"dan seorang yang berdosa tidak akan memikul dosa orang lain.\" Kemudian bapakku melihat semisal luka yang ada pada pundak Rasulullah Shallallahu 'alaihi wa Salam, dan berkata; \"wahai Rasulullah, sesungguihnya aku adalah orang yang paling paham tentang kedokteran di antara orang-orang, maka bolehkan aku mengobati lukamu?\" \"Tidak, dokternya adalah yang telah menciptakannya (Allah).\" Jawab beliau. "
            },
            {
                "number": 217,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي أَبِي وَأَبُو خَيْثَمَةَ زُهَيْرُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادِ بْنِ لَقِيطٍ عَنْ أَبِيهِ عَنْ أَبِي رِمْثَةَ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ بُرْدَانِ أَخْضَرَانِ",
                "id": "Telah menceritakan kepada kami Abdullah telah menceritakan kepadaku bapakku dan [Abu Khaitsamah Zuhair bin Harb] mereka berkata; telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [ubaidhullah bin Iyad bin laqith] dari [bapaknya], dari [Abu Rimtsah], dia berkata; \"Aku mendatangi Rasulullah Shallallahu 'alaihi wa Salam sedang beliau mengenakan dua selendang hijau.\""
            },
            {
                "number": 218,
                "arab": "أَخْبَرَنَا هُشَيْمُ بْنُ بَشِيرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ أَبِي صَالِحٍ ذَكْوَانُ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمِينُكَ عَلَى مَا يُصَدِّقُكَ بِهِ صَاحِبُكَ",
                "id": "Telah mengkabarkan kepada kami [Husyaim bin Basyir] telah mengkabarkan kepada kami [Abdullah bin Abu Shalih Dzakwan] dari [bapaknya] dari [Abu Hurairah], dia berkata; Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Sumpahmu itu tergantung pada pembenaran yang dilakukan oleh temanmu kepadamu.\""
            },
            {
                "number": 219,
                "arab": "حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا مَنْصُورٌ وَهِشَامٌ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبِئْرُ جُبَارٌ وَالْمَعْدِنُ جُبَارٌ وَالْعَجْمَاءُ جُبَارٌ وَفِي الرِّكَازِ الْخُمُسُ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah menceritakan kepada kami [Manshur] dan [Hisyam] dari [Ibnu Sirin] dari [Abu Hurairah], dia berkata; Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Mati karena tercebur ke dalam sumur adalah sia-sia, mati karena kecelakaan dalam penambangan adalah sia-sia, binatang yang mati tertanduk adalah sia-sia, dan pada harta terpendam yang ditemukan terdapat kewajiban mengeluarkan zakat seperlimanya.\""
            },
            {
                "number": 220,
                "arab": "أَخْبَرَنَا هُشَيْمٌ عَنِ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَدَخَلَ عُيَيْنَةُ بْنُ حِصْنٍ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَآهُ يُقَبِّلُ حَسَنًا أَوْ حُسَيْنًا فَقَالَ لَهُ لَا تُقَبِّلْهُ يَا رَسُولَ اللَّهِ لَقَدْ وُلِدَ لِي عَشَرَةٌ مَا قَبَّلْتُ أَحَدًا مِنْهُمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مَنْ لَا يَرْحَمُ لَا يُرْحَمُ",
                "id": "Telah mengkabarkan kepada kami [Husyaim] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] dia berkata; 'Uyainah bin Hishn pernah mengunjungi Rasulullah Shallallahu 'alaihi wa Salam, lalu ia melihat beliau mencium Hasan dan Husain, maka iapun berkata kepada beliau: \"Wahai Rasulullah, jangan engkau menciumnya, sesungguhnya aku telah dikaruniai anak sebanyak sepuluh orang, dan satupun dari mereka tidak ada yang pernah aku cium.\" Maka Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya barangsiapa yang tidak mencintai maka ia tidak berhak untuk dicintai.\""
            },
            {
                "number": 221,
                "arab": "حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا أَبُو بِشْرٍ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ أُمَّتِي الْقَرْنُ الَّذِي بُعِثْتُ فِيهِمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ وَاللَّهُ أَعْلَمُ أَقَالَ الثَّالِثَةَ أَمْ لَا ثُمَّ يَجِيءُ قَوْمٌ يُحِبُّونَ السَّمَانَةَ يَشْهَدُونَ قَبْلَ أَنْ يُسْتَشْهَدُوا",
                "id": "Telah menceritakan kepada kami [Husyaim] telah menceritakan kepada kami [Abu Bisyr] dari [Abdullah bin Syaqiq] dari [Abu Hurairah], dia berkata; Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Sebaik-baik ummatku ialah orang-orang yang aku diutus ditengah-tengah mereka, kemudian generasi setelahnya, kemudian generasi setelahnya.\" Allahu a'lam, apakah beliau mengatakannya hingga tiga kali ataukah tidak?\" \"Kemudian setelah itu datang satu generasi yang suka menggemukkan badan, dan mereka akan memberi kesaksian sebelum mereka diminta untuk memberi kesaksian.\""
            },
            {
                "number": 222,
                "arab": "حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ يَعْنِي ابْنَ عَمْرِو بْنِ حَزْمٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ وَجَدَ عَيْنَ مَالِهِ عِنْدَ رَجُلٍ قَدْ أَفْلَسَ فَهُوَ أَحَقُّ بِهِ مِمَّنْ سِوَاهُ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Abu Bakar bin Muhammad] -yaitu Ibnu 'Amru bin Hazm dari [Umar bin Abdul Aziz] dari [Abu Bakr bin Abdurrahman bin Al Harits bin Hisyam] dari [Abu Hurairah], dia berkata; Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa mendapati harta bendanya ada pada seseorang yang sedang pailit, maka ia lebih berhak atasnya daripada selainnya.\""
            },
            {
                "number": 223,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا خَالِدٌ عَنْ يُوسُفَ أَوْ عَنْ أَبِيهِ عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا اخْتَلَفُوا فِي الطَّرِيقِ رُفِعَ مِنْ بَيْنِهِمْ سَبْعَةُ أَذْرُعٍ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah mengkabarkan kepada kami [Khalid] dari [Yusuf] atau dari bapaknya dari [Abdullah bin Al Harits] dari [Abu Hurairah], bahwa Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Jika orang-orang bertengkar mengenai (tanah) yang ada di jalanan maka ambillah dari setiap mereka tujuh hasta.\""
            },
            {
                "number": 224,
                "arab": "حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا أَبُو الْجُهَيْمِ الْوَاسِطِيُّ عَنِ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ امْرُؤُ الْقَيْسِ صَاحِبُ لِوَاءِ الشُّعَرَاءِ إِلَى النَّارِ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah menceritakan kepada kami [Abul Juhaim Al Wasithiy] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah], dia berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Umru-u Al Qois adalah pembawa bendera para penyair menuju ke neraka.\""
            },
            {
                "number": 225,
                "arab": "حَدَّثَنَا هُشَيْمٌ عَنْ سَيَّارٍ عَنْ جَبْرِ بْنِ عَبِيدَةَ عَنْ أَبِي هُرَيْرَةَ قَالَوَعَدَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ الْهِنْدِ فَإِنْ اسْتُشْهِدْتُ كُنْتُ مِنْ خَيْرِ الشُّهَدَاءِ وَإِنْ رَجَعْتُ فَأَنَا أَبُو هُرَيْرَةَ الْمُحَرَّرُ",
                "id": "Telah menceritakan kepada kami [Husyaim] dari [Sayyar] dari [Jabr bin Abidah] dari [Abu Hurairah], dia berkata; \"Pada perang Al hind Rasulullah Shallallahu 'alaihi wa Salam menjanjikan kepada kami, jika aku mati syahid maka aku adalah sebaik-baik para syuhada', dan jika aku pulang kembali maka aku adalah Abu Hurairah yang merdeka.\""
            },
            {
                "number": 226,
                "arab": "حَدَّثَنَا هُشَيْمٌ عَنْ هِشَامٍ عَنْ ابْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ شِدَّةُ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ فَأَبْرِدُوا بِالصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Husyaim] dari [Hisyam] dari [Ibnu Sirin] dari [Abu Hurairah] dari Nabi Shallallahu 'alaihi wa Salam, beliau bersabda: \"Panas yang terik datang dari jilatan api neraka jahannam, maka dinginkanlah ia dengan sholat.\""
            },
            {
                "number": 227,
                "arab": "حَدَّثَنَا هُشَيْمٌ عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبِكْرُ تُسْتَأْمَرُ وَالثَّيِّبُ تُشَاوَرُ قِيلَ يَا رَسُولَ اللَّهِ إِنَّ الْبِكْرَ تَسْتَحِي قَالَ سُكُوتُهَا رِضَاهَا",
                "id": "Telah menceritakan kepada kami [Husyaim] dari [Umar bin Abu Salamah] dari [bapaknya] dari [Abu Hurairah], dia berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Seorang gadis itu dimintai izinnya (untuk dinikahi) dan seorang janda itu diajak bermusyawarah.\" Dikatakan kepada Rasulullah: \"Wahai Rasulullah, sesungguhnya seorang gadis itu merasa malu.\" Beliau berkata: \"Diamnya adalah tanda setujunya.\""
            },
            {
                "number": 228,
                "arab": "حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا أَبُو بِشْرٍ عَنْ أَبِي الْمُتَوَكِّلِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانُوا فِي سَفَرٍ فَمَرُّوا بِحَيٍّ مِنْ أَحْيَاءِ الْعَرَبِ فَاسْتَضَافُوهُمْ فَأَبَوْا أَنْ يُضَيِّفُوهُمْ فَعَرَضَ لِإِنْسَانٍ مِنْهُمْ فِي عَقْلِهِ أَوْ لُدِغَ قَالَ فَقَالُوا لِأَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ فِيكُمْ مِنْ رَاقٍ فَقَالَ رَجُلٌ مِنْهُمْ نَعَمْ فَأَتَى صَاحِبَهُمْ فَرَقَاهُ بِفَاتِحَةِ الْكِتَابِ فَبَرَأَ فَأُعْطِيَ قَطِيعًا مِنْ غَنَمٍ فَأَبَى أَنْ يَقْبَلَ حَتَّى أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ يَا رَسُولَ اللَّهِ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا رَقَيْتُهُ إِلَّا بِفَاتِحَةِ الْكِتَابِ قَالَ فَضَحِكَ وَقَالَ مَا يُدْرِيكَ أَنَّهَا رُقْيَةٌ قَالَ ثُمَّ قَالَ خُذُوا وَاضْرِبُوا لِي بِسَهْمٍ مَعَكُمْ",
                "id": "Telah menceritakan kepada kami [Husyaim] berkata; telah menceritakan kepada kami [Abu Bisyr] dari [Abu Al Mutawakkil] dari [Abu Sa'id Al Khudri] berkata; Beberapa orang sahabat Nabi shallallahu 'alaihi wasallam mengadakan safar, ketika mereka melewati salah satu perkampungan arab, mereka hendak bertamu namun mereka enggan menerimanya. Lalu ada diantara penduduk itu terkena sengatan, dan akhirnya mereka bertanya kepada sahabat Rasulullah shallallahu 'alaihi wasallam; \"Apakah ada di antara kalian yang bisa meruqyah?\" maka seorang sabahat Nabi menjawab; \"Ya, \" kemudian ia menemui orang yang terkena sengatan dan meruqyahnya dengan membacakan surat Al Fatihah, dan orang itu pun sembuh. Maka ia pun diberi beberapa kambing, namun ia enggan menerimanya hingga ia bertemu dengan Nabi shallallahu 'alaihi wasallam, ketika sampai, ia pun menceritakan kejadian tersebut kepada beliau, dan berkata; \"Wahai Rasulullah, demi Dzat yang mengutusmu dengan kebenaran, aku tidak meruqyahnya kecuali hanya dengan membacakan surat Al Fatihah, \" Abu Sa'id Al Khudri berkata; Beliau lalu tertawa, dan bersabda: \"Apa engkau tahu bahwa surat Al Fatihah adalah ruqyah?\" Abu Sa'id Al Khudri berkata; \"Kemudian beliau bersabda: \"Ambillah pemberian itu dan berikan untukku satu bagian bersama kalian.\""
            },
            {
                "number": 229,
                "arab": "حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا عَلِيُّ بْنُ زَيْدٍ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا سَيِّدُ وَلَدِ آدَمَ يَوْمَ الْقِيَامَةِ وَلَا فَخْرَ وَأَنَا أَوَّلُ مَنْ تَنْشَقُّ عَنْهُ الْأَرْضُ يَوْمَ الْقِيَامَةِ وَلَا فَخْرَ وَأَنَا أَوَّلُ شَافِعٍ يَوْمَ الْقِيَامَةِ وَلَا فَخْرَ",
                "id": "Telah menceritakan kepada kami [Husyaim] berkata; telah menceritakan kepada kami [Ali bin Zaid] dari [Abu Nadhrah] dari [Abu Sa'id] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku adalah pemimpin anak Adam pada hari kiamat, dan ini bukannya aku sombong, aku adalah orang yang pertama kali dibuka kuburnya pada hari kiamat dan ini bukannya aku sombong, serta aku yang pertama kali yang memberi syafa'at dan ini bukannya aku sombong.\""
            },
            {
                "number": 230,
                "arab": "حَدَّثَنَا هُشَيْمٌ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّقَالَ جَاءَ مَاعِزُ بْنُ مَالِكٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ أَنَّهُ أَتَى فَاحِشَةً فَرَدَّهُ مِرَارًا قَالَ ثُمَّ أَمَرَ بِهِ فَرُجِمَ قَالَ فَانْطَلَقْنَا فَرَجَمْنَاهُ قَالَ فَانْطَلَقْنَا إِلَى الْحَرَّةِ فَرَجَمْنَاهُ ثُمَّ وَلَّيْنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْنَاهُ فَلَمَّا كَانَ مِنْ الْعَشِيِّ قَالَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ مَا بَالُ أَقْوَامٍسَقَطَتْ عَلَى أَبِي كَلِمَةٌ",
                "id": "Telah menceritakan kepada kami [Husyaim] dari [Dawud bin Abu Hind] dari [Abu Nadhrah] dari [Abu Sa'id Al Khudri] ia berkata; \"Maiz bin Malik menemui Rasulullah shallallahu 'alaihi wasallam untuk memberitahukan kepada beliau, bahwa dirinya telah berzina, namun beliau menolaknya berulang-ulang, tapi akhirnya beliau memerintahkan agar ia dirajam, lalu kami pun membawanya menuju ke padang pasir dan merajamnya, setelah itu kami kembali kepada Rasulullah shallallahu 'alaihi wasallam dan mengabarkan hal itu, pada sore harinya Rasulullah bersabda, memuji kepada Allah dan menyanjung-Nya kemudian bersabda; \"Bagaimana keadaan suatu kaum yang tidak terhina karena satu kalimat.\""
            },
            {
                "number": 231,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يَزِيدُ بْنُ أَبِي زِيَادٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي نُعْمٍ الْبَجَلِيُّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ مَا يَقْتُلُ الْمُحْرِمُ قَالَ الْحَيَّةَ وَالْعَقْرَبَ وَالْفُوَيْسِقَةَ وَيَرْمِي الْغُرَابَ وَلَا يَقْتُلُهُ وَالْكَلْبَ الْعَقُورَ وَالْحِدَأَةَ وَالسَّبُعَ الْعَادِيَ",
                "id": "Telah menceritakan kepada kami [Husyaim] berkata; telah mengabarkan kepada kami [Yazid bin Abu Ziyad] berkata; telah menceritakan kepada kami [Abdurrahman bin Abu Nu'm Al Bajali] dari [Abu Sa'id Al Khudri], dia menuturkan; Nabi shallallahu 'alaihi wasallam ditanya; \"binatang apa saja yang diperbolehkan bagi orang yang sedang ihram untuk membunuhnya?\" maka beliau bersabda: \"Ular, kalajengking, tikus, melempari burung gagak tetapi tidak membunuhnya, anjing galak dan liar serta hewan buas lainnya.\""
            },
            {
                "number": 232,
                "arab": "حَدَّثَنَا مُعْتَمِرٌ قَالَ حَدَّثَنَا أَبِي أَخْبَرَنَا أَبُو نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْجَرِّ أَنْ يُنْبَذَ فِيهِ وَعَنْ التَّمْرِ وَالْبُسْرِ وَعَنْ التَّمْرِ وَالزَّبِيبِ أَنْ يُخْلَطَ بَيْنَهُمَا",
                "id": "Telah menceritakan kepada kami [Mu'tamir] berkata; [bapakku] telah menceritakan kepada kami, ia berkata; telah mengabarkan kepada kami [Abu Nadhrah] dari [Abu Sa'id], ia berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang dari membuat an nabidz di al jarr, dan kurma matang dengan kurma mentah, atau kurma dengan kismis jika keduanya dicampur.\" "
            },
            {
                "number": 233,
                "arab": "حَدَّثَنَا مُعْتَمِرٌ عَنْ أَبِيهِ قَالَ أَنْبَأَنِي أَبُو نَضْرَةَ عَنْ أَبِي سَعِيدٍأَنَّ صَاحِبَ التَّمْرِ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِتَمْرَةٍ فَأَنْكَرَهَا قَالَ أَنَّى لَكَ هَذَا فَقَالَ اشْتَرَيْنَا بِصَاعَيْنِ مِنْ تَمْرِنَا صَاعًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَيْتُمْ",
                "id": "Telah menceritakan kepada kami [Mu'tamir] dari [bapaknya], ia berkata; telah memberitakan kepadaku [Abu Nadhrah] dari [Abu Sa'id] berkata; \"Bahwasannya seorang pemilik kurma menemui Rasulullah shallallahu 'alaihi wasallam dengan membawa kurma namun beliau mengingkarinya, beliau bersabda: \"Dari mana kamu dapatkan ini?\" ia menjawab, \"Kami membelinya (menukar) satu sho` dengan dua sho` kurma kami, \" maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Engkau telah melakukan riba.\""
            },
            {
                "number": 234,
                "arab": "حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو حَدَّثَنَا زُهَيْرٌ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَا أَدُلُّكُمْ عَلَى مَا يُكَفِّرُ اللَّهُ بِهِ الْخَطَايَا وَيَزِيدُ بِهِ فِي الْحَسَنَاتِ قَالُوا بَلَى يَا رَسُولَ اللَّهِ قَالَ إِسْبَاغُ الْوُضُوءِ عَلَى الْمَكَارِهِ وَكَثْرَةُ الْخُطَا إِلَى هَذِهِ الْمَسَاجِدِ وَانْتِظَارُ الصَّلَاةِ بَعْدَ الصَّلَاةِ مَا مِنْكُمْ مِنْ رَجُلٍ يَخْرُجُ مِنْ بَيْتِهِ مُتَطَهِّرًا فَيُصَلِّي مَعَ الْمُسْلِمِينَ الصَّلَاةَ ثُمَّ يَجْلِسُ فِي الْمَجْلِسِ يَنْتَظِرُ الصَّلَاةَ الْأُخْرَى إِنَّ الْمَلَائِكَةَ تَقُولُ اللَّهُمَّ اغْفِرْ لَهُ اللَّهُمَّ ارْحَمْهُ فَإِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاعْدِلُوا صُفُوفَكُمْ وَأَقِيمُوهَا وَسُدُّوا الْفُرَجَ فَإِنِّي أَرَاكُمْ مِنْ وَرَاءِ ظَهْرِي فَإِذَا قَالَ إِمَامُكُمْ اللَّهُ أَكْبَرُ فَقُولُوا اللَّهُ أَكْبَرُ وَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ وَإِنَّ خَيْرَ الصُّفُوفِ صُفُوفِ الرِّجَالِ الْمُقَدَّمُ وَشَرُّهَا الْمُؤَخَّرُ وَخَيْرُ صُفُوفِ النِّسَاءِ الْمُؤَخَّرُ وَشَرُّهَا الْمُقَدَّمُ يَا مَعْشَرَ النِّسَاءِ إِذَا سَجَدَ الرِّجَالُ فَاغْضُضْنَ أَبْصَارَكُنَّ لَا تَرَيْنَ عَوْرَاتِ الرِّجَالِ مِنْ ضِيقِ الْأُزُرِ",
                "id": "Telah menceritakan kepada kami [Abu 'Amir Abdul Malik bin 'Amru] berkata; telah menceritakan kepada kami [Zuhair] -yaitu Ibnu Muhammad- dari [Abdullah bin Muhammad bin 'Aqil] dari [Sa'id Ibnul Musayyab] dari [Abu Sa'id Al Khudri] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maukah aku tunjukkan kepada kalian sesuatu yang dengannya Allah akan menghapus kesalahan dan menambah kebaikan?\" para sahabat menjawab, \"Tentu, wahai Rasulullah, \" maka beliau bersabda: \"Sempurnakanlah wudlu di waktu yang tidak mengenakkan, memperbanyak langkah menuju masjid dan menunggu sholat setelah sholat. Tidaklah seorang dari kalian keluar dari rumahnya dalam keadaan suci lalu sholat bersama kaum muslimin, kemudian ia duduk menunggu sholat berikutnya, kecuali malaikat akan berdoa; 'Ya Allah ampunilah ia, ya Allah rahmatilah ia.' Jika kalian akan menegakkan sholat maka luruskan barisan sholat kalian dan rapatkanlah, serta penuhilah tempat yang kosong, karena sesungguhnya aku dapat melihat kalian dari belakang punggungku. Jika imam kalian mengucapkan; 'ALLAHUAKBAR' maka ucapkanlah; 'ALLAHUAKBAR, ' jika ia ruku' maka ruku'lah, jika ia mengucapkan 'SAMI'A ALLAHU LIMAN HAMIDAH' maka ucapkanlah RABBANA LAKALHAMDU.' Dan sesungguh sebaik-baik shaf laki-laki adalah yang paling depan dan yang paling jelek adalah yang paling belakang, dan sebaik-baik shaf wanita adalah yang paling belakang dan yang paling buruk adalah yang paling depan. Wahai kaum wanita, jika para laki-laki bersujud maka tundukanlah pandangan kalian, janganlah kalian melihat aurat laki-laki karena sempitnya sarung.\""
            },
            {
                "number": 235,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو حَدَّثَنَا عَبَّادٌ يَعْنِي ابْنَ رَاشِدٍ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ قَالَإِنَّكُمْ لَتَعْمَلُونَ أَعْمَالًا هِيَ أَدَقُّ فِي أَعْيُنِكُمْ مِنْ الشَّعْرِ كُنَّا نَعُدُّهَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمُوبِقَاتِ",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin 'Amru] berkata; telah menceritakan kepada kami [Abbad] -yaitu Ibnu Rasyid- dari [Dawud bin Abu hind] dari [Abu Nadhrah] dari [Abu Sa'id] berkata; \"Sungguh, kalian benar-benar akan melakukan amalan yang ia lebih tipis dimata kalian daripada rambut, kami menghitungnya pada masa Rasulullah shallallahu 'alaihi wasallam sebagai amalan yang membinasakan.\""
            },
            {
                "number": 236,
                "arab": "حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ حَسَنٍ الْحَارِثِيُّ حَدَّثَنَا سَعِيدُ بْنُ عَمْرِو بْنِ سُلَيْمٍ قَالَ سَمِعْتُ رَجُلًا مِنَّا قَالَ عَبْدُ الْمَلِكِ نَسِيتُ اسْمَهُ وَلَكِنْ اسْمُهُ مُعَاوِيَةُ أَوْ ابْنُ مُعَاوِيَةَ يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْمَيِّتَ يَعْرِفُ مَنْ يَحْمِلُهُ وَمَنْ يُغَسِّلُهُ وَمَنْ يُدَلِّيهِ فِي قَبْرِهِفَقَالَ ابْنُ عُمَرَ وَهُوَ فِي الْمَجْلِسِ مِمَّنْ سَمِعْتَ هَذَا قَالَ مِنْ أَبِي سَعِيدٍ فَانْطَلَقَ ابْنُ عُمَرَ إِلَى أَبِي سَعِيدٍ فَقَالَ يَا أَبَا سَعِيدٍ مِمَّنْ سَمِعْتَ هَذَا قَالَ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abu 'Amir] berkata; telah menceritakan kepada kami [Abdul Malik bin Hasan Al Haritsi] berkata; telah menceritakan kepada kami [Sa'id bin 'Amru bin Sulaim] berkata; aku mendengar seorang lelaki dari kami, -Abdul Malik berkata; aku lupa namanya, tetapi kira-kira namanya adalah [Mu'awiyah] atau Ibnu Mu'awiyah, - ia menceritakan dari [Abu Sa'id Al Khudri], bahwasanya Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang yang meninggal dunia itu mengetahui siapa yang mengusungnya, memandikan dan memasukkannya ke liang kubur.\" Lalu Ibnu Umar yang sedang berada di majlis berkata; \"Dari mana engkau mendengar itu?\" Ia berkata; \"Dari Abu Sa'id, \" maka pergilah Ibnu Umar menemui Abu Sa'id, dan bertanya; \"Wahai Abu Sa'id, dari mana engkau mendapatkan hadits itu?\" ia menjawab, \"Dari Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 237,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍأَمَرَنَا نَبِيُّنَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَقْرَأَ بِفَاتِحَةِ الْكِتَابِ وَمَا تَيَسَّرَ",
                "id": "Telah menceritakan kepada kami [Abdush Shamad] berkata; telah menceritakan kepada kami [Hammam] berkata; telah menceritakan kepada kami [Qotadah] dari [Abu Nadhrah] dari [Abu Sa'id] ia berkata; \"Nabi kita memerintahkan kepada kita agar kita membaca Al Fatihah dan surat yang ringan bagi kita.\""
            },
            {
                "number": 238,
                "arab": "حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ وَإِسْمَاعِيلُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ",
                "id": "Telah menceritakan kepada kami [Husyaim] berkata, telah menceritakan kepada kami [Abdul Aziz bin Shuhaib]. Dan [Isma'il] berkata, telah menceritakan kepada kami [Abdul Aziz bin Shuhaib] dari [Anas bin Malik] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa sengaja berdusta atas namaku maka hendaklah dia mempersiapkan tempat duduknya di dalam neraka.\""
            },
            {
                "number": 239,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا حُمَيْدٌ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَلَمَّا دَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِزَيْنَبَ ابْنَةِ جَحْشٍ أَوْلَمَ قَالَ فَأَطْعَمَنَا خُبْزًا وَلَحْمًا",
                "id": "Telah menceritakan kepada kami [Husyaim] berkata, telah mengabarkan kepada kami [Humaid] bin [Anas bin Malik] berkata; \"Ketika malam pertama Rasulullah shallallahu 'alaihi wasallam di rumah Zainab binti Jahsy, beliau mengadakan walimah, dan kami memakan roti beserta daging pada walimah tersebut.\""
            },
            {
                "number": 240,
                "arab": "حَدَّثَنَا هُشَيْمٌ عَنْ حُمَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ تَعَالَى عَنْهُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي بُرْدَةِ حِبَرَةٍ قَالَ أَحْسَبُهُ عَقَدَ بَيْنَ طَرَفَيْهَا",
                "id": "Telah menceritakan kepada kami [Husyaim] dari [Humaid] dari [Anas bin Malik] Radhiyallahu Ta'ala 'anhu, bahwasanya Nabi shallallahu 'alaihi wasallam sholat memakai selendang yang bercampur dengan wol. Anas berkata; \"Menurutku beliau menggabungkan kedua ujungnya.\""
            },
            {
                "number": 241,
                "arab": "حَدَّثَنَا هُشَيْمٌ عَنْ حُمَيْدٍ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَطُوفُ عَلَى جَمِيعِ نِسَائِهِ فِي لَيْلَةٍ بِغُسْلٍ وَاحِدٍ",
                "id": "Telah menceritakan kepada kami [Husyaim] [Humaid] dari [Anas] bahwa Nabi shallallahu 'alaihi wasallam pernah berkeliling menggilir semua istrinya dalam satu malam dengan satu kali mandi.\""
            },
            {
                "number": 242,
                "arab": "حَدَّثَنَا هُشَيْمٌ عَنْ عَبْدِ الْعَزِيزِ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ الْخَلَاءَ قَالَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْخُبْثِ وَالْخَبَائِثِ",
                "id": "Telah menceritakan kepada kami [Husyaim] dari [Abdul Aziz] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam apabila hendak memasuki kamar mandi, beliau mengucapkan: \"ALLAAHUMMA INNI A'UUDZU BIKA MINAL KHUBUTSI WAL KHABAA`ITSI (Ya Allah, aku berlindung kepada-Mu dari setan laki-laki dan setan perempuan).\""
            },
            {
                "number": 243,
                "arab": "حَدَّثَنَا هُشَيْمٌ قَالَ عُبَيْدُ اللَّهِ بْنُ أَبِي بَكْرٍ أَخْبَرَنَا عَنْ أَنَسٍ وَيُونُسُ عَنْ الْحَسَنِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْصُرْ أَخَاكَ ظَالِمًا أَوْ مَظْلُومًا قِيلَ يَا رَسُولَ اللَّهِ هَذَا أَنْصُرُهُ مَظْلُومًا فَكَيْفَ أَنْصُرُهُ إِذَا كَانَ ظَالِمًا قَالَ تَحْجُزُهُ تَمْنَعُهُ فَإِنَّ ذَلِكَ نَصْرُهُ",
                "id": "Telah menceritakan kepada kami [Husyaim] berkata; [ubaidhullah bin Abu Bakr] berkata; telah mengabarkan kepada kami dari [Anas bin Malik], dan [Yunus] dari [Al Hasan] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tolonglah saudaramu baik yang terzhalimi atau yang menzhalimi, \" mereka bertanya; \"Kalau yang terzhalimi kami memahaminya, tapi bagaimana kami menolong saudara kami yang menzhalimi?\" beliau menjawab: \"Menahan dan melarangnya dari berbuat kezhaliman, itulah bentuk pertolongan untuknya.\""
            },
            {
                "number": 244,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا عَبْدُ الْعَزِيزِ وَإِسْمَاعِيلُ عَنْ عَبْدِ الْعَزِيزِ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَسَحَّرُوا فَإِنَّ فِي السُّحُورِ بَرَكَةً",
                "id": "Telah menceritakan kepada kami [Husyaim] berkata, telah mengabarkan kepada kami [Abdul Aziz] dan [Isma'il] dari [Abdul Aziz] dari [Anas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Makan sahurlah kalian! Karena dalam makan sahur terdapat keberkahan.\""
            },
            {
                "number": 245,
                "arab": "حَدَّثَنَا هُشَيْمٌ عَنْ حُمَيْدٍ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ قَالَلَمَّا اتَّخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَفِيَّةَ أَقَامَ عِنْدَهَا ثَلَاثًا وَكَانَتْ ثَيِّبًا",
                "id": "Telah menceritakan kepada kami [Husyaim] dari [Humaid] berkata, telah menceritakan kepada kami [Anas bin Malik] ia berkata; \"Ketika Rasulullah shallallahu 'alaihi wasallam menikahi Shafiyyah beliau tinggal bersamanya selama tiga hari, dan Shafiyyah adalah seorang janda.\""
            },
            {
                "number": 246,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا عَلِيُّ بْنُ زَيْدٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ سَمِعْتُهُ يُحَدِّثُ قَالَشَهِدْتُ وَلِيمَتَيْنِ مِنْ نِسَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَمَا أَطْعَمَنَا فِيهَا خُبْزًا وَلَا لَحْمًا قَالَ قُلْتُ فَمَهْ قَالَ الْحَيْسَ يَعْنِي التَّمْرَ وَالْأَقِطَ بِالسَّمْنِ",
                "id": "Telah menceritakan kepada kami [Husyaim] berkata, telah mengabarkan kepada kami ['Ali bin Zaid] dari [Anas bin Malik] ia berkata; \"Aku mendengarnya menceritakan, ia berkata; \"Aku dua kali menghadiri walimah yang dilakukan oleh Rasulullah shallallahu 'alaihi wasallam ketika menikahi istri-istrinya, \" Anas berkata; \"Beliau tidak memberi kami makanan roti ataupun daging\" Ali bin Zaid bertanya; \"Lalu apa?\" Anas menjawab; \"Yang ada hanya hayyis (kurma, dan susu kering yang dicampur dengan minyak samin).\""
            },
            {
                "number": 247,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا الْعَوَّامُ حَدَّثَنَا الْأَزْهَرُ بْنُ رَاشِدٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَسْتَضِيئُوا بِنَارِ الْمُشْرِكِينَ وَلَا تَنْقُشُوا خَوَاتِيمَكُمْ عَرَبِيًّا",
                "id": "Telah menceritakan kepada kami [Husyaim] berkata, telah mengabarkan kepada kami [Al Awwam] berkata, telah menceritakan kepada kami [Al Azhar bin Rasyid] dari [Anas bin Malik] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian mengambil penerangan dari apinya orang musyrik, dan jangan mengukir cincin kalian dengan tulisan arab.\""
            },
            {
                "number": 248,
                "arab": "حَدَّثَنَا حَسَنٌ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍأَنَّهُمْ غَزَوْا غَزْوَةً فِيمَا بَيْنَ مَكَّةَ وَالْمَدِينَةِ فَهَاجَتْ عَلَيْهِمْ رِيحٌ شَدِيدَةٌ حَتَّى دَفَعَتْ الرِّجَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا لِمَوْتِ الْمُنَافِقِ فَرَجَعْنَا إِلَى الْمَدِينَةِ فَوَجَدْنَاهُ مُنَافِقًا عَظِيمَ النِّفَاقِ قَدْ مَاتَ",
                "id": "Telah menceritakan kepada kami [Hasan] telah menceritakan kepada kami [Ibnu Lahi'ah] telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] Sesungguhnya mereka berperang dalam suatu peperangan antara Makkah dan Madinah, lalu bertiuplah angin yang sangat kencang sampai angin tersebut bisa menjadikan seseorang terjengkang. Rasulullah shallallahu 'alaihi wasallam lantas bersabda: \"Ini adalah untuk kematian seorang munafiq\" lalu kami pulang ke Madinah dan mendapati seorang dedengkot munafiq yang telah tewas."
            },
            {
                "number": 249,
                "arab": "حَدَّثَنَا حَسَنٌ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا أَبُو الزُّبَيْرِ قَالَسَأَلْتُ جَابِرًا عَنْ الْعَقَبَةِ فَقَالَ شَهِدَهَا سَبْعُونَ فَوَافَقَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ آخِذٌ بِيَدِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذْتُ وَأَعْطَيْتُ",
                "id": "Telah menceritakan kepada kami [Hasan] telah menceritakan kepada kami [Ibnu Lahi'ah] telah menceritakan kepada kami [Abu Az Zubair] berkata; saya telah bertanya kepada [Jabir] tentang Al 'aqobah maka dia menjawab, \"Yang menyaksikan adalah tujuh puluh orang lalu Rasulullah shallallahu 'alaihi wasallam menyetujuinya dan Al 'Abbas Bin Abdul Muthollib memegang tangan beliau, lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya terima dan saya berikan\"."
            },
            {
                "number": 250,
                "arab": "حَدَّثَنَا حَسَنٌ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا أَبُو الزُّبَيْرِ قَالَ أَخْبَرَنِي جَابِرٌأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَيَتْرُكَنَّهَا أَهْلُهَا مُرْطِبَةً قَالُوا فَمَنْ يَأْكُلُهَا يَا رَسُولَ اللَّهِ قَالَ عَافِيَةُ الطَّيْرِ وَالسِّبَاعِ",
                "id": "Telah menceritakan kepada kami [Hasan] telah menceritakan kepada kami [Ibnu Lahi'ah] telah menceritakan kepada kami [Abu Az Zubair] berkata; telah mengabarkan kepadaku [Jabir] telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh penduduknya akan meninggalkannya dalam keadaan basah dan segar\" mereka bertanya, siapa yang memakannya Wahai Rasulullah! Beliau menjawab, burung-burung dan hewan buas\"."
            },
            {
                "number": 251,
                "arab": "حَدَّثَنَا حَسَنٌ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا أَبُو الزُّبَيْرِ أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللَّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيَأْتِيَنَّ عَلَى الْمَدِينَةِ زَمَانٌ يَنْطَلِقُ النَّاسُ فِيهَا إِلَى الْآفَاقِ يَلْتَمِسُونَ الرَّخَاءَ فَيَجِدُونَ رَخَاءً ثُمَّ يَأْتُونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ إِلَى الرَّخَاءِ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ",
                "id": "Telah menceritakan kepada kami [Hasan] telah menceritakan kepada kami [Ibnu Lahi'ah] telah menceritakan kepada kami [Abu Az Zubair] telah mengabarkan kepadaku [Jabir bin Abdullah] Sesungguhnya Rasulullah shallallahu 'alaihi wasallam berkata; \"Akan datang suatu masa di Madinah, Penduduknya akan menuju ke arah yang terpencil, lalu mereka mendapatkan padang yang luas kemudian mereka membawa keluarganya ke tempat tersebut. Dan Madinah adalah lebih baik bagi mereka seandainya mereka mengetahuinya\"."
            },
            {
                "number": 252,
                "arab": "حَدَّثَنَا حَسَنٌ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا أَبُو الزُّبَيْرِ قَالَسَأَلْتُ جَابِرًا عَنْ مِيثَرَةِ الْأُرْجُوَانِ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا أَرْكَبُهَا وَلَا أَلْبَسُ قَمِيصًا مَكْفُوفًا بِحَرِيرٍ وَلَا أَلْبَسُ الْقَسِّيَّ",
                "id": "Telah menceritakan kepada kami [Hasan] telah menceritakan kepada kami [Ibnu Lahi'ah] telah menceritakan kepada kami [Abu Az Zubair] berkata; saya telah bertanya kepada [Jabir] tentang 'pelana sutra yang kemerah-merahan', maka ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya tidak akan menaikinya, saya tidak memakai gamis yang terselip sutra dan saya juga tidak memakai baju dari kapas yang bercampur sutra\"."
            },
            {
                "number": 253,
                "arab": "حَدَّثَنَا حَسَنٌ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا أَبُو الزُّبَيْرِ قَالَسَأَلْتُ جَابِرًا عَنْ الْفَأْرَةِ تَمُوتُ فِي الطَّعَامِ أَوْ الشَّرَابِ أَطْعَمُهُ قَالَ لَا زَجَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ كُنَّا نَضَعُ السَّمْنَ فِي الْجِرَارِ فَقَالَ إِذَا مَاتَتْ الْفَأْرَةُ فِيهِ فَلَا تَطْعَمُوهُ",
                "id": "Telah menceritakan kepada kami [Hasan] telah menceritakan kepada kami [Ibnu Lahi'ah] telah menceritakan kepada kami [Abu Az Zubair] berkata; saya telah bertanya kepada [Jabir] tentang tikus yang mati pada makanan atau minuman apakah saya (boleh) memakannya?, maka ia berkata; Jangan! Rasulullah shallallahu 'alaihi wasallam melarang hal itu. Kami meletakkan minyak samin dalam bejana tanah lalu (Rasulullah shallallahu 'alaihi wasallam) bersabda: \"Jika ada tikus yang mati di dalamnya maka janganlah kalian memakannya\"."
            },
            {
                "number": 254,
                "arab": "حَدَّثَنَا حَسَنٌ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا أَبُو الزُّبَيْرِ قَالَسَأَلْتُ جَابِرًا عَنْ الضَّبِّ فَقَالَ أُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِهِ فَقَالَ لَا أَطْعَمُهُ وَقَذِرَهُفَقَالَ عُمَرُ بْنُ الْخَطَّابِ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يُحَرِّمْهُ وَإِنَّ اللَّهَ عَزَّ وَجَلَّ لَيَنْفَعُ بِهِ غَيْرَ وَاحِدٍ وَهُوَ طَعَامُ عَامَّةِ الرِّعَاءِ وَلَوْ كَانَ عِنْدِي لَطَعِمْتُهُ",
                "id": "Telah menceritakan kepada kami [Hasan] telah menceritakan kepada kami [Ibnu Lahi'ah] telah menceritakan kepada kami [Abu Az Zubair] berkata; saya telah bertanya kepada [Jabir] tentang tentang biawak, maka ia berkata; pernah diberikan kepada Rasulullah shallallahu 'alaihi wasallam barang itu, maka beliau bersabda: saya tidak memakannya. Beliau merasa jijik dengannya, lalu ['Umar bin Al Khatthab] berkata; \"Rasulullah shallallahu 'alaihi wasallam tidaklah mengharamkannya, dan Allah AzzaWaJalla memberi manfaat dengannya bukan hanya pada seorang, akan tetapi dia adalah makanan para pengembala, kalau ada padaku niscaya saya akan memakannya\"."
            },
            {
                "number": 255,
                "arab": "حَدَّثَنَا حَسَنٌ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا أَبُو الزُّبَيْرِ قَالَسَأَلْتُ جَابِرًا عَنْ الرَّجُلِ يَتَوَلَّى مَوْلَى الرَّجُلِ بِغَيْرِ إِذْنِهِ فَقَالَ كَتَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى كُلِّ بَطْنٍ عُقُولَهُمْ ثُمَّ كَتَبَ إِنَّهُ لَا يَحِلُّ أَنْ يُتَوَلَّى مَوْلَى رَجُلٍ مُسْلِمٍ بِغَيْرِ إِذْنِهِ",
                "id": "Telah menceritakan kepada kami [Hasan] telah menceritakan kepada kami [Ibnu Lahi'ah] telah menceritakan kepada kami [Abu Az Zubair] berkata; saya telah bertanya kepada [Jabir] tentang seorang laki-laki yang mengambil pelayan orang tanpa seijin majikannya, maka dia menjawab, Rasulullah shallallahu 'alaihi wasallam menetapkan untuk setiap tubuh diyatnya kemudian sesungguhnya (Rasulullah shallallahu 'alaihi wasallam) juga menetapkan bahwa tidak halal mengambil pembantu seorang muslim tanpa seijin majikannya."
            },
            {
                "number": 256,
                "arab": "حَدَّثَنَا حَسَنٌ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَنَ فِي صَحِيفَتِهِ مَنْ فَعَلَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Hasan] telah menceritakan kepada kami [Ibnu Lahi'ah] telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] Sesungguhnya Rasulullah shallallahu 'alaihi wasallam melaknat di lembarannya, \"Siapa yang telah melakukannya!\"."
            },
            {
                "number": 257,
                "arab": "حَدَّثَنَا حَسَنٌ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا أَبُو الزُّبَيْرِ عَنْ جَابِرٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ تَرَكَ دِينَارًا فَهُوَ كَيَّةٌ",
                "id": "Telah menceritakan kepada kami [Hasan] telah menceritakan kepada kami [Ibnu Lahi'ah] telah menceritakan kepada kami [Abu Az Zubair] dari [Jabir] berkata; saya telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang meninggalkan satu dinar maka itu adalah bara api\"."
            },
            {
                "number": 258,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ الْكَرِيمِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ قَالَزَوَّجَنِي أَبِي فِي إِمَارَةِ عُثْمَانَ فَدَعَا نَفَرًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَاءَ صَفْوَانُ بْنُ أُمَيَّةَ وَهُوَ شَيْخٌ كَبِيرٌ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ انْهَسُوا اللَّحْمَ نَهْسًا فَإِنَّهُ أَهْنَأُ وَأَمْرَأُ أَوْ أَشْهَى وَأَمْرَأُ قَالَ سُفْيَانُ الشَّكُّ مِنِّي أَوْ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Abdul Karim] dari [Abdullah bin Al Harits] berkata; bapakku menikahkanku pada masa pemerintahan 'Utsman lalu dia mengundang beberapa orang sahabat Rasulullah Shallallahu'alaihiwasallam. Datanglah [Shafwan bin Umayyah], dia sudah tua renta lalu dia berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Gigitlah daging, itu lebih enak dan lebih bermanfaat\" atau \"Lebih lezat dan lebih bermanfaat.\" Sufyan berkata; --kepastian redaksi lebih enak atau lebih lezat tersebut dariku atau darinya (Abdul Karim Radliyallahu'anhu)."
            },
            {
                "number": 259,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ التَّيْمِيِّ يَعْنِي سُلَيْمَانَ عَنْ أَبِي عُثْمَانَ يَعْنِي النَّهْدِيَّ عَنْ عَامِرِ بْنِ مَالِكٍ عَنْ صَفْوَانَ بْنِ أُمَيَّةَ قَالَالطَّاعُونُ وَالْبَطْنُ وَالْغَرَقُ وَالنُّفَسَاءُ شَهَادَةٌحَدَّثَنَا بِهِ أَبُو عُثْمَانَ مِرَارًا وَقَدْ رَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّةً",
                "id": "Telah menceritakan kepada kami [Yazid bin Sa'id] dari [At Taimi] yaitu Sulaiman dari [Abu 'Utsman] yaitu An-Nahdi dari ['Amir Bin Malik] dari [Shafwan bin Umayyah] berkata; (orang yang mati karena) wabah tho'un, sakit perut, orang yang mati karena tenggelam dan melahirkan adalah mati syahid. Telah menceritakan kepada kami dengan hadits ini, Abu 'Utsman berulang-ulang, dan sesekali dia memarfu'kannya kepada Nabi Shallallahu'alaihiwasallam."
            },
            {
                "number": 260,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا شَرِيكٌ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ أُمَيَّةَ بْنِ صَفْوَانَ بْنِ أُمَيَّةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَعَارَ مِنْهُ يَوْمَ خَيْبَرَ أَدْرَاعًا فَقَالَ أَغَصْبًا يَا مُحَمَّدُ فَقَالَ بَلْ عَارِيَةٌ مَضْمُونَةٌ قَالَ فَضَاعَ بَعْضُهَا فَعَرَضَ عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَضْمَنَهَا لَهُ فَقَالَ أَنَا الْيَوْمَ يَا رَسُولَ اللَّهِ فِي الْإِسْلَامِ أَرْغَبُ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata; telah mengabarkan kepada kami [Syarik] dari [Abdul Aziz bin Rofi'] dari [Umayyah bin Shafwan] dari [bapaknya] Rasulullah Shallallahu'alaihiwasallam meminjam darinya pada Perang Khaibar baju besi. Dia berkata; apakah sebagai rampasan Wahai Rasulullah Shallallahu'alaihiwasallam? beliau bersabda: \"Itu adalah sebagai pinjaman yang ada jaminannya.\" (Shafwan bin Umayyah radliyallahu'anhu) berkata; lalu sebagiannya hilang lalu Rasulullah Shallallahu'alaihiwasallam menyanggupi untuk menjaminnya. (Shafwan bin Umayyah radliyallahu'anhu) berkata; Wahai Rasulullah saya pada hari ini, sangat senang kepada Islam."
            },
            {
                "number": 261,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي حَفْصَةَ حَدَّثَنَا الزُّهْرِيُّ عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ بْنِ صَفْوَانَ عَنْ أَبِيهِأَنَّ صَفْوَانَ بْنَ أُمَيَّةَ بْنِ خَلَفٍ قِيلَ لَهُ هَلَكَ مَنْ لَمْ يُهَاجِرْ قَالَ فَقُلْتُ لَا أَصِلُ إِلَى أَهْلِي حَتَّى آتِيَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَكِبْتُ رَاحِلَتِي فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ زَعَمُوا أَنَّهُ هَلَكَ مَنْ لَمْ يُهَاجِرْ قَالَ كَلَّا أَبَا وَهْبٍ فَارْجِعْ إِلَى أَبَاطِحِ مَكَّةَ قَالَ فَبَيْنَمَا أَنَا رَاقِدٌ إِذْ جَاءَ السَّارِقُ فَأَخَذَ ثَوْبِي مِنْ تَحْتِ رَأْسِي فَأَدْرَكْتُهُ فَأَتَيْتُ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنَّ هَذَا سَرَقَ ثَوْبِي فَأَمَرَ بِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُقْطَعَ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ لَيْسَ هَذَا أَرَدْتُ هُوَ عَلَيْهِ صَدَقَةٌ قَالَ فَهَلَّا قَبْلَ أَنْ تَأْتِيَنِي بِهِ",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Muhammad bin Abu Hafshah] telah menceritakan kepada kami [Az-Zuhri] dari [Shafwan bin Abdillah bin Shafwan] dari [bapaknya] dikatakan kepada Shafwan bin Umayyah bin Khalaf, celakalah orang yang tidak berhijrah. (Shafwan bin Umayyah radliyallahu'anhu) berkata; saya tidak akan menemui keluargaku hingga saya datang kepada Rasulullah Shallallahu'alaihiwasallam, lalu saya menunggang kendaraanku, saya temui Rasulullah Shallallahu'alaihiwasallam saya tanyakan, wahai Rasulullah! Orang-orang mengatakan 'Celaka orang yang tidak berhijrah. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Sekali-kali tidak, wahai Abu Wahab! kembalilah ke tanah Makkah!\" (Shafwan bin Umayyah radliyallahu'anhu) berkata; ketika saya sedang tidur, tiba-tiba datang seorang pencuri yang mengambil bajuku dari bawah kepalaku, lalu saya mendapatkannya hingga saya membawanya kepada Nabi Shallallahu'alaihiwasallam. Saya katakan, orang ini mencuri bajuku. Beliau Shallallahu'alaihiwasallam menyuruh untuk memotong tangannya. (Shafwan bin Umayyah radliyallahu'anhu) berkata; Wahai Rasulullah Shallallahu'alaihiwasallam, 'Bukanlah ini yang saya inginkan, akan tetapi saya ingin menjadikan baju itu sebagai sedekah padanya.' (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Kenapa kamu tidak mengatakannya sebelum kamu membawanya kepadaku?\""
            },
            {
                "number": 262,
                "arab": "حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ عَنْ ابْنِ الْمُبَارَكِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ صَفْوَانَ بْنِ أُمَيَّةَ قَالَأَعْطَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ حُنَيْنٍ وَإِنَّهُ لَأَبْغَضُ النَّاسِ إِلَيَّ فَمَا زَالَ يُعْطِينِي حَتَّى صَارَ وَإِنَّهُ أَحَبُّ النَّاسِ إِلَيَّ",
                "id": "Telah menceritakan kepada kami [Zakariya bin 'Adi] dari [Ibnu Mubarok] dari [Yunus] dari [Az-Zuhri] dari [Sa'id bin Musayyab] dari [Shafwan bin Umayyah] berkata; Rasulullah Shallallahu'alaihiwasallam pada Perang Hunain memberi harta rampasan kepadaku, padahal dia adalah orang yang paling saya benci. (Rasulullah Shallallahu'alaihiwasallam) tiada berhenti memberiku hingga beliau menjadi orang yang paling saya cintai."
            },
            {
                "number": 263,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا سَعِيدٌ يَعْنِي ابْنَ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ عَطَاءٍ عَنْ طَارِقِ بْنِ مُرَقَّعٍ عَنْ صَفْوَانَ بْنِ أُمَيَّةَأَنَّ رَجُلًا سَرَقَ بُرْدَهُ فَرَفَعَهُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِقَطْعِهِ فَقَالَ يَا رَسُولَ اللَّهِ قَدْ تَجَاوَزْتُ عَنْهُ قَالَ فَلَوْلَا كَانَ هَذَا قَبْلَ أَنْ تَأْتِيَنِي بِهِ يَا أَبَا وَهْبٍ فَقَطَعَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Sa'id] yaitu Ibnu Abu 'Arubah, dari [Qatadah] dari ['Atho'] dari [Thoriq bin Muroqqi'] dari [Shafwan bin Umayyah] seseorang mencuri mantelnya lalu dibawa kepada Nabi Shallallahu'alaihiwasallam, lalu beliau menyuruh untuk memotongnya. Lalu (Shafwan bin Umayyah radliyallahu'anhu) berkata; 'Wahai Rasulullah saya telah memaafkannya.' (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Kalau saja itu sebelum kamu membawanya kepadaku Wahai Abu Wahb?.\" Lalu Rasulullah Shallallahu'alaihiwasallam memotongnya."
            },
            {
                "number": 264,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا ابْنُ طَاوُسٍ عَنْ أَبِيهِ عَنْ صَفْوَانَ بْنِ أُمَيَّةَأَنَّهُ قِيلَ لَهُ لَا يَدْخُلُ الْجَنَّةَ إِلَّا مَنْ هَاجَرَ قَالَ فَقُلْتُ لَا أَدْخُلُ مَنْزِلِي حَتَّى آتِيَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْأَلَهُ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ هَذَا سَرَقَ خَمِيصَةً لِي لِرَجُلٍ مَعَهُ فَأَمَرَ بِقَطْعِهِ فَقُلْتُ يَا رَسُولَ اللَّهِ فَإِنِّي قَدْ وَهَبْتُهَا لَهُ قَالَ فَهَلَّا قَبْلَ أَنْ تَأْتِيَنِي بِهِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّهُمْ يَقُولُونَ لَا يَدْخُلُ الْجَنَّةَ إِلَّا مَنْ هَاجَرَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا هِجْرَةَ بَعْدَ فَتْحِ مَكَّةَ وَلَكِنْ جِهَادٌ وَنِيَّةٌ فَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ibnu Thawus] dari [bapaknya] dari [Shafwan bin Umayyah] dikatakan kepadanya, tidak akan masuk surga kecuali orang yang berhijrah. (Shafwan bin Umayyah radliyallahu'anhu) berkata; saya tidak akan memasuki rumahku sampai saya menemui Rasulullah Shallallahu'alaihiwasallam dan menanyakannya. Lalu saya mendatangi Nabi Shallallahu'alaihiwasallam dan berkata; Wahai Rasulullah orang ini telah mencuri khomishoh (pakaian yang jahitannya ada yang terbuat dari sutra) milikku untuk temannya yang bersamanya. Lalu (Rasulullah Shallallahu'alaihiwasallam) menyuruh untuk memotongnya. Lalu saya berkata; Wahai Rasulullah, saya telah memberikan kepadanya. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Kenapa tidak kau katakan sebelum dibawa ke hadapanku?.\" (Shafwan bin Umayyah radliyallahu'anhu) berkata; 'Wahai Rasulullah, mereka mengatakan tidak akan masuk surga kecuali orang yang telah berhijrah.' Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidak ada hijrah setelah Fathu Makkah, tapi jihad dan niat, jika kalian diminta untuk datang ke medan perang maka berangkatlah.\""
            },
            {
                "number": 265,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا سُلَيْمَانُ يَعْنِي التَّيْمِيَّ عَنْ أَبِي عُثْمَانَ يَعْنِي النَّهْدِيَّ عَنْ عَامِرٍ يَعْنِي ابْنَ مَالِكٍ عَنْ صَفْوَانَ بْنِ أُمَيَّةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الطَّاعُونُ شَهَادَةٌ وَالْغَرَقُ شَهَادَةٌ وَالْبَطْنُ شَهَادَةٌ وَالنُّفَسَاءُ شَهَادَةٌ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata; telah mengabarkan kepada kami [Sulaiman] yaitu At Taimi, dari [Abu 'Utsman] yaitu An-Nahdi dari ['Amir] yaitu Ibnu Malik dari [Shafwan bin Umayyah] dari Nabi Shallallahu'alaihiwasallam bersabda: \"(korban penyakit) Thaun adalah syahid, tenggelam adalah syahid, mati karena penyakit perut adalah syahid dan orang yang meninggal karena melahirkan juga syahid.\""
            },
            {
                "number": 266,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ عَنْ سُلَيْمَانَ عَنْ أَبِي عُثْمَانَ عَنْ عَامِرِ بْنِ مَالِكٍ عَنْ صَفْوَانَ بْنِ أُمَيَّةَقَالَ الطَّاعُونُ وَالْبَطْنُ وَالْغَرَقُ وَالنُّفَسَاءُ شَهَادَةٌقَالَ سُلَيْمَانُ حَدَّثَنَا بِهِ يَعْنِي أَبَا عُثْمَانَ مِرَارًا وَرَفَعَهُ مَرَّةً إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu 'Utsman] dari [Sulaiman] dari [Abu 'Utsman] dari ['Amir Bin Malik] dari [Shafwan bin Umayyah] berkata; \"(korban penyakit) Thaun adalah syahid, tenggelam adalah syahid, orang yang meninggal karena melahirkan juga syahid.\" Sulaiman berkata; telah menceritakannya kepada kami yaitu Abu 'Utsman berkali-kali dan sesekali memarfu'kannya kepada Nabi Shallallahu'alaihiwasallam."
            },
            {
                "number": 267,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مُعَاوِيَةَ عَنْ عُثْمَانَ بْنِ أَبِي سُلَيْمَانَ قَالَ قَالَ صَفْوَانُ بْنُ أُمَيَّةَرَآنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا آخُذُ اللَّحْمَ عَنْ الْعَظْمِ بِيَدِي فَقَالَ يَا صَفْوَانُ قُلْتُ لَبَّيْكَ قَالَ قَرِّبْ اللَّحْمَ مِنْ فِيكَ فَإِنَّهُ أَهْنَأُ وَأَمْرَأُ",
                "id": "Telah menceritakan kepada kami [Isma'il Bin Ibrahim] telah menceritakan kepada kami [Abdurrahman bin Ishaq] dari [Abdurrahman bin Mu'awiyah] dari ['Utsman bin Abu Sulaiman] berkata; [Shafwan bin Umayyah] berkata; Rasulullah Shallallahu'alaihiwasallam melihatku ketika saya sedang mengambil daging dari tulangnya dengan tanganku, lalu bersabda: \"Wahai Shafwan\" saya menjawab 'Ya.' Beliau bersabda: \"Dekatkanlah daging dari mulutmu, itu lebih lezat dan lebih bermanfaat.\""
            },
            {
                "number": 268,
                "arab": "حَدَّثَنَا هُشَيْمُ بْنُ بَشِيرٍ عَنْ أَبِي بِشْرٍ جَعْفَرِ بْنِ إِيَاسٍ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ حَكِيمِ بْنِ حِزَامٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ يَأْتِينِي الرَّجُلُ يَسْأَلُنِي الْبَيْعَ لَيْسَ عِنْدِي مَا أَبِيعُهُ ثُمَّ أَبِيعُهُ مِنْ السُّوقِ فَقَالَ لَا تَبِعْ مَا لَيْسَ عِنْدَكَ",
                "id": "Telah menceritakan kepada kami [Husyaim bin Basyir] dari [Abu Bisr Ja'far bin Iyas] dari [Yusuf bin Mahak] dari [Hakim bin Hizam] berkata; wahai Rasulullah! ada seorang laki-laki yang datang kepadaku dan memintaku untuk menjual sesuatu yang bukan hakku untuk menjualnya, kemudian saya menjualnya di pasar, maka (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Janganlah kamu menjual sesuatu yang bukan hak kamu.\""
            },
            {
                "number": 269,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ يُوسُفَ بْنِ مَاهَكَ يُحَدِّثُ عَنْ حَكِيمِ بْنِ حِزَامٍ قَالَبَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَنْ لَا أَخِرَّ إِلَّا قَائِمًا قَالَ قُلْتُ يَا رَسُولَ اللَّهِ الرَّجُلُ يَسْأَلُنِي الْبَيْعَ وَلَيْسَ عِنْدِي أَفَأَبِيعُهُ قَالَ لَا تَبِعْ مَا لَيْسَ عِنْدَكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abu Bisyr] dari [Yusuf bin Mahak] menceritakan dari [Hakim bin Hizam] berkata; saya berbaiat kepada Rasulullah Shallallahu'alaihiwasallam untuk tidak akan meninggal kecuali dalam keadaan menegakkan Islam. (Hakim bin Hizam Radliyallahu'anhu) berkata; Wahai Rasulullah, seseorang memintaku untuk menjual kepadanya yang bukan milikku, apakah saya harus menjualnya?. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Janganlah kau jual barang yang bukan milikmu!\""
            },
            {
                "number": 270,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَيُّوبُ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ حَكِيمِ بْنِ حِزَامٍ قَالَنَهَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَبِيعَ مَا لَيْسَ عِنْدِي قَالَ أَيُّوبُ أَوْ قَالَ سِلْعَةً لَيْسَتْ عِنْدِي",
                "id": "Telah menceritakan kepada kami [Isma'il Bin Ibrahim] telah mengabarkan kepada kami [Ayyub] dari [Yusuf Bin Mahak] dari [Hakim bin Hizam] berkata; Rasulullah Shallallahu'alaihiwasallam melarangku menjual apa yang bukan milikku. Ayyub berkata; atau bersabda: \"Dagangan yang bukan milikku.\""
            },
            {
                "number": 271,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ شُعْبَةَ حَدَّثَنَا أَبُو بِشْرٍ عَنْ يُوسُفَ بْنِ مَاهَكَ عَنْ حَكِيمِ بْنِ حِزَامٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ يُطْلَبُ مِنِّي الْمَتَاعُ وَلَيْسَ عِنْدِي أَفَأَبِيعُهُ لَهُ قَالَ لَا تَبِعْ مَا لَيْسَ عِنْدَكَ",
                "id": "Telah menceritakan kepada kami [Yahya bin 'Adam] dari [Syu'bah] telah menceritakan kepada kami [Abu Bisyr] dari [Yusuf Bin Mahak] dari [Hakim Bin Hizam] berkata; Wahai Rasulullah, saya membawa dagangan dan mau dibeli seseorang, padahal itu bukan milikku apakah saya boleh menjualnya untuk pemiliknya?. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Janganlah kau jual barang yang bukan milikmu.\""
            },
            {
                "number": 272,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا هِشَامٌ يَعْنِي الدَّسْتُوَائِيَّ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ رَجُلٍ أَنَّ يُوسُفَ بْنَ مَاهَكَ أَخْبَرَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَصْمَةَ أَخْبَرَهُ أَنَّ حَكِيمَ بْنَ حِزَامٍ أَخْبَرَهُ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أَشْتَرِي بُيُوعًا فَمَا يَحِلُّ لِي مِنْهَا وَمَا يُحَرَّمُ عَلَيَّ قَالَ فَإِذَا اشْتَرَيْتَ بَيْعًا فَلَا تَبِعْهُ حَتَّى تَقْبِضَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Hisyam] yaitu Ad Dastuwa'i, telah menceritakan kepadaku [Yahya bin Abu Katsir] dari [seseorang] [Yusuf Bin Mahak] mengabarinya, [Abdullah bin 'Ashmar] mengabarinya, [Hakim Bin Hizam] mengabarinya. (Hakim Bin Hizam Radliyallahu'anhu) berkata; Wahai Rasulullah, saya telah membeli dagangan, mana yang halal bagiku dan mana yang haram bagiku?. (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Jika kamu membeli barang janganlah kau jual lagi sehingga kau membawanya.\" "
            },
            {
                "number": 273,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ حَكِيمِ بْنِ حِزَامٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ أُمُورًا كُنْتُ أَتَحَنَّثُ بِهَا فِي الْجَاهِلِيَّةِ مِنْ عَتَاقَةٍ وَصِلَةِ رَحِمٍ هَلْ لِي فِيهَا أَجْرٌ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْلَمْتَ عَلَى مَا أَسْلَفْتَ مِنْ خَيْرٍ",
                "id": "Telah menceritakan kepada kami [Abdurrozaq] telah menceritakan kepada kami [Ma'mar] dari [Az-Zuhri] dari ['Urwah Az-Zubair] dari [Hakim bin Hizam] berkata; Wahai Rasulullah, bagaimana pendapat anda tentang perkara-perkara kebaikan yang pernah saya lakukan pada masa Jahiliyyah seperti memerdekakan budak dan menyambung kekerabatan, apakah saya mendapatkan pahala darinya? Nabi Shallallahu'alaihiwasallam bersabda kepadanya, \"Setelah kamu masuk Islam, kamu akan mendapatkan pahala atas kebaikan yang pernah kamu lakukan.\""
            },
            {
                "number": 274,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ أَخْبَرَنَا يُونُسُ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ أَنَّ حَكِيمَ بْنَ حِزَامٍ أَخْبَرَهُ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ أُمُورًا كُنْتُ أَتَحَنَّثُ بِهَا فِي الْجَاهِلِيَّةِ فَقَالَ أَسْلَمْتَ عَلَى مَا أَسْلَفْتَ وَالتَّحَنُّثُ التَّعَبُّدُ",
                "id": "Telah menceritakan kepada kami ['Utsman bin 'Umar] telah mengabarkan kepada kami [Yunus] dari [Az-Zuhri] dari ['Urwah] [Hakim bin Hizam] mengabarinya, berkata; Wahai Rasulullah, bagaimana pendapat anda tentang perkara-perkara kebaikan yang pernah saya lakukan pada masa Jahiliyyah?. (Nabi Shallallahu'alaihiwasallam) bersabda: \"Setelah kamu masuk Islam, kamu akan mendapatkan pahala atas apa yang pernah kamu lakukan\" dan tahannuts adalah beribadah."
            },
            {
                "number": 275,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ قَالَ وَجَدْتُ فِي كِتَابِ أَبِي بِخَطِّ يَدِهِ حَدَّثَنَا سَعِيدٌ يَعْنِي ابْنَ سُلَيْمَانَ حَدَّثَنَا عَبَّادٌ يَعْنِي ابْنَ الْعَوَّامِ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ أَيُّوبَ بْنِ بَشِيرٍ الْأَنْصَارِيِّ عَنْ حَكِيمِ بْنِ حِزَامٍأَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّدَقَاتِ أَيُّهَا أَفْضَلُ قَالَ عَلَى ذِي الرَّحِمِ الْكَاشِحِ",
                "id": "Telah menceritakan kepada kami Abdullah berkata; saya telah mendapatkan dalam tulisan bapakku dengan tulisan dia sendiri, telah menceritakan kepada kami [Sa'id] yaitu Ibnu Sulaiman, telah menceritakan kepada kami ['Abbad] yaitu Ibnu Al 'Awwam, dari [Sufyan bin Husain] dari [Az-Zuhri] dari [Ayyub bin Bisyr Al Anshori] dari [Hakim bin Hizam] ada seorang laki-laki yang bertanya kepada Rasulullah Shallallahu'alaihiwasallam tentang sedekah mana yang paling afdhal? (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Sedekah atas sanak keluarga yang membutuhkan.\""
            },
            {
                "number": 276,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا قَتَادَةُ عَنْ أَبِي الْخَلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ عَنْ حَكِيمِ بْنِ حِزَامٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَيِّعَانِ بِالْخِيَارِ مَا لَمْ يَتَفَرَّقَا فَإِنْ صَدَقَا وَبَيَّنَا بُورِكَ لَهُمَا فِي بَيْعِهِمَا وَإِنْ كَذَبَا وَكَتَمَا مُحِقَتْ بَرَكَةُ بَيْعِهِمَا",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] telah mengabarkan kepada kami [Qatadah] dari [Abu Al kholil] dari [Abdullah bin Al Harits bin Nufail] dari [Hakim bin Hizam] Rasulullah Shallallahu'alaihiwasallam bersabda: \"Kedua orang yang melakukan akad jual beli berhak khiyar (pilihan antara mengambil barang atau mengembalikannya karena adanya cacat) selama keduanya belum berpisah. Jika keduanya jujur dan menjelaskan barangnya maka keduanya akan di berkahi pada jual belinya, namun jika keduanya berdusta dan menyembunyikan maka barakah jual belinya akan dihapus.\""
            },
            {
                "number": 277,
                "arab": "حَدَّثَنَا عَتَّابُ بْنُ زِيَادٍ حَدَّثَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ مُبَارَكٍ أَخْبَرَنَا لَيْثُ بْنُ سَعْدٍ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ الْمُغِيرَةِ عَنْ عِرَاكِ بْنِ مَالِكٍ أَنَّ حَكِيمَ بْنَ حِزَامٍ قَالَكَانَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَبَّ رَجُلٍ فِي النَّاسِ إِلَيَّ فِي الْجَاهِلِيَّةِ فَلَمَّا تَنَبَّأَ وَخَرَجَ إِلَى الْمَدِينَةِ شَهِدَ حَكِيمُ بْنُ حِزَامٍ الْمَوْسِمَ وَهُوَ كَافِرٌ فَوَجَدَ حُلَّةً لِذِي يَزَنَ تُبَاعُ فَاشْتَرَاهَا بِخَمْسِينَ دِينَارًا لِيُهْدِيَهَا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَدِمَ بِهَا عَلَيْهِ الْمَدِينَةَ فَأَرَادَهُ عَلَى قَبْضِهَا هَدِيَّةً فَأَبَى قَالَ عُبَيْدُ اللَّهِ حَسِبْتُ أَنَّهُ قَالَ إِنَّا لَا نَقْبَلُ شَيْئًا مِنْ الْمُشْرِكِينَ وَلَكِنْ إِنْ شِئْتَ أَخَذْنَاهَا بِالثَّمَنِ فَأَعْطَيْتُهُ حِينَ أَبَى عَلَيَّ الْهَدِيَّةَ",
                "id": "Telah menceritakan kepada kami ['Attab bin Ziyad] telah menceritakan kepada kami [Abdullah] yaitu Ibnu Mubarok, telah menceritakan kepada kami [Laits bin Sa'd] telah menceritakan kepadaku ['ubaidhullah bin Al Mugirah] dari ['Irak bin Malik] [Hakim bin Hizam] berkata; Muhammad Shallallahu'alaihiwasallam adalah orang paling saya cintai pada masa Jahiliyyah. Ketika dia mencari berita dengan keluar menuju Madinah, Hakim bin Hizam mengikuti haji padahal dia masih kafir, maka dia menemukan baju Dziyazan yang sedang dijual lalu dia membelinya dengan lima puluh dinar, untuk dihadiahkan kepada Rasulullah Shallallahu'alaihiwasallam. Dia membawanya ke Madinah dengan maksud memberikannya dan berharap beliau menerimanya sebagai hadiah namun beliau menolak. 'Ubaidillah berkata; saya kira dia berkata; \"kami tidak menerima sesuatu dari orang musyrik, namun jika kamu mau, saya akan mengambilnya dengan membayarkan uang.\" (Hizam Radliyallahu'anhu berkata), lalu saya tetap memberikannya ketika beliau menolak hadiah dari saya."
            },
            {
                "number": 278,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنِ ابْنِ حِزَامٍأَنَّهُ مَرَّ بِأُنَاسٍ مِنْ أَهْلِ الذِّمَّةِ قَدْ أُقِيمُوا فِي الشَّمْسِ بِالشَّامِ فَقَالَ مَا هَؤُلَاءِ قَالُوا بَقِيَ عَلَيْهِمْ شَيْءٌ مِنْ الْخَرَاجِ فَقَالَ إِنِّي أَشْهَدُ أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ عَزَّ وَجَلَّ يُعَذِّبُ يَوْمَ الْقِيَامَةِ الَّذِينَ يُعَذِّبُونَ النَّاسَقَالَ وَأَمِيرُ النَّاسِ يَوْمَئِذٍ عُمَيْرُ بْنُ سَعْدٍ عَلَى فِلَسْطِينَ قَالَ فَدَخَلَ عَلَيْهِ فَحَدَّثَهُ فَخَلَّى سَبِيلَهُمْ حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنْ هِشَامِ بْنِ حَكِيمٍ أَنَّهُ مَرَّ بِالشَّامِ عَلَى قَوْمٍ مِنْ الْأَنْبَاطِ وَقَدْ أُقِيمُوا فِي الشَّمْسِ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [bapaknya] dari [Ibnu Hizam] dia pernah melewati orang-orang dzimmi yang dijemur di bawah matahari di Syam. Lalu dia bertanya, ada apa dengan mereka? Mereka menjawab, mereka masih memiliki tanggungan khoroj (pajak yang dibebankan kepada para orang kafir yang berada di bawah kekuasaan Islam). Lalu (Hakim bin Hizam Radliyallahu'anhuma) berkata; saya bersaksi saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \" Allah 'Azzawajalla pada Hari Kiamat menyiksa orang-orang yang menyiksa manusia\" (Hisyam Radliyallahu'anhu) berkata; Amir mereka di Palestina pada waktu itu adalah 'Umair bin Sa'ad. Hisyam berkata; lalu (Hakim Radliyallahu'anhu) menemuinya dan menceritakannnya hingga melepaskan mereka. Telah berbicara kepada kami [Ibnu Numair] telah berbicara kepada kami [Hisyam] dari [bapaknya] dari [Hisyam bin Hakim] dia melewati sebuah kaum dari Anbath di Syam yang dijemur di bawah terik matahari, lalu ia menyebutkan makna hadits (seperti yang di atas)."
            },
            {
                "number": 279,
                "arab": "حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ وَهِشَامِ بْنِ عُرْوَةَ أَنَّهُمَا حَدَّثَاهُ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِأَنَّ هِشَامَ بْنَ حَكِيمٍ رَأَى نَاسًا مِنْ أَهْلِ الذِّمَّةِ قِيَامًا فِي الشَّمْسِ فَقَالَ مَا هَؤُلَاءِ فَقَالُوا مِنْ أَهْلِ الْجِزْيَةِ فَدَخَلَ عَلَى عُمَيْرِ بْنِ سَعْدٍ وَكَانَ عَلَى طَائِفَةِ الشَّامِ فَقَالَ هِشَامٌ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ عَذَّبَ النَّاسَ فِي الدُّنْيَا عَذَّبَهُ اللَّهُ تَبَارَكَ وَتَعَالَىفَقَالَ عُمَيْرٌ خَلُّوا عَنْهُمْ",
                "id": "Telah menceritakan kepada kami [Abdul A'la] dari [Ma'mar] dari [Az-Zuhri] dan [Hisyam bin 'Urwah] keduanya menceritakannya dari ['Urwah bin Zubair] dari [Hisyam bin Hakim] melihat beberapa orang dari ahli Dzimmah dijemur di bawah Matahari. Lalu dia bertanya, siapakah mereka?. Mereka menjawab, dari ahlu jizyah. Lalu dia menemui 'Umair bin Sa'd, dia sedang berada di Syam. Hisyam berkata; saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Barang siapa yang menyiksa manusia di dunia, maka Allah subhanahu wata'ala akan menyiksanya. Umair berkata; lepaskankanlah mereka."
            },
            {
                "number": 280,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا صَفْوَانُ حَدَّثَنِي شُرَيْحُ بْنُ عُبَيْدٍ الْحَضْرَمِيُّ وَغَيْرُهُ قَالَجَلَدَ عِيَاضُ بْنُ غَنْمٍ صَاحِبَ دَارِيَا حِينَ فُتِحَتْ فَأَغْلَظَ لَهُ هِشَامُ بْنُ حَكِيمٍ الْقَوْلَ حَتَّى غَضِبَ عِيَاضٌ ثُمَّ مَكَثَ لَيَالِيَ فَأَتَاهُ هِشَامُ بْنُ حَكِيمٍ فَاعْتَذَرَ إِلَيْهِ ثُمَّ قَالَ هِشَامٌ لِعِيَاضٍ أَلَمْ تَسْمَعْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ مِنْ أَشَدِّ النَّاسِ عَذَابًا أَشَدَّهُمْ عَذَابًا فِي الدُّنْيَا لِلنَّاسِ فَقَالَ عِيَاضُ بْنُ غَنْمٍ يَا هِشَامُ بْنَ حَكِيمٍ قَدْ سَمِعْنَا مَا سَمِعْتَ وَرَأَيْنَا مَا رَأَيْتَ أَوَلَمْ تَسْمَعْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَرَادَ أَنْ يَنْصَحَ لِسُلْطَانٍ بِأَمْرٍ فَلَا يُبْدِ لَهُ عَلَانِيَةً وَلَكِنْ لِيَأْخُذْ بِيَدِهِ فَيَخْلُوَ بِهِ فَإِنْ قَبِلَ مِنْهُ فَذَاكَ وَإِلَّا كَانَ قَدْ أَدَّى الَّذِي عَلَيْهِ لَهُوَإِنَّكَ يَا هِشَامُ لَأَنْتَ الْجَرِيءُ إِذْ تَجْتَرِئُ عَلَى سُلْطَانِ اللَّهِ فَهَلَّا خَشِيتَ أَنْ يَقْتُلَكَ السُّلْطَانُ فَتَكُونَ قَتِيلَ سُلْطَانِ اللَّهِ تَبَارَكَ وَتَعَالَى",
                "id": "Telah menceritakan kepada kami [Abu Al Mughiroh] telah menceritakan kepada kami [Shafwan] telah menceritakan kepadaku [Syuraih bin 'Ubaid Al Hadlromi] dan yang lainnya berkata; ['Iyadl bin Ghonim] mencambuk orang Dariya ketika ditaklukkan. [Hisyam bin Hakim] meninggikan suaranya kepadanya untuk menegur sehingga 'Iyadl marah. ('Iyadl Radliyallahu'anhu) tinggal beberapa hari, lalu Hisyam bin Hakim mendatanginya, memberikan alasan. Hisyam berkata kepada 'Iyadl, tidakkah kau mendengar Nabi Shallallahu'alaihiwasallam bersabda: \" Orang yang paling keras siksaannya adalah orang-orang yang paling keras menyiksa manusia di dunia?.\" 'Iyadl bin ghanim berkata; Wahai Hisyam bin Hakim, kami pernah mendengar apa yang kau dengar dan kami juga melihat apa yang kau lihat, namun tidakkah kau mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Barangsiapa yang hendak menasehati penguasa dengan suatu perkara, maka jangan dilakukan dengan terang-terangan, tapi gandenglah tangannya dan menyepilah berdua. Jika diterima memang begitu, jika tidak maka dia telah melaksakan kewajibannya\", kamu Wahai Hisyam, kamu sungguh orang yang berani, jika kamu berani kepada penguasa Allah, kenapa kamu tidak takut dibunuh penguasa dan kau menjadi korban penguasa Allah subhanahu wata'ala?. "
            },
            {
                "number": 281,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ أَخْبَرَنَا يُونُسُ عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ أَنَّهُ بَلَغَهُأَنَّ عِيَاضَ بْنَ غَنْمٍ رَأَى نَبَطًا يُشَمَّسُونَ فِي الْجِزْيَةِ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يُعَذِّبُ الَّذِينَ يُعَذِّبُونَ النَّاسَ فِي الدُّنْيَا",
                "id": "Telah menceritakan kepada kami ['Utsman bin 'Umar] berkata; telah mengabarkan kepada kami [Yunus] dari [Az-Zuhri] dari ['Urwah] telah sampai kepadanya [dari seseorang] bahwa, ['Iyadl bin Ghanim] melihat rakyat jelata yang dijemur karena masalah jizyah. Lalu berkata; saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \" Allah subhanahu wata'ala menyiksa orang yang menyiksa manusia di dunia.\""
            },
            {
                "number": 282,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ أَخْبَرَنَا شُعَيْبٌ عَنِ الزُّهْرِيِّ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِأَنَّ هِشَامَ بْنَ حَكِيمِ بْنِ حِزَامٍ وَجَدَ عِيَاضَ بْنَ غَنْمٍ وَهُوَ عَلَى حِمْصَ يُشَمِّسُ نَاسًا مِنْ النَّبَطِ فِي أَدَاءِ الْجِزْيَةِ فَقَالَ لَهُ هِشَامٌ مَا هَذَا يَا عِيَاضُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يُعَذِّبُ الَّذِينَ يُعَذِّبُونَ النَّاسَ فِي الدُّنْيَا",
                "id": "Telah menceritakan kepada kami [Abu Al Yaman] telah mengabarkan kepada kami [Syua'ib] dari [Az-Zuhri] telah mengabarkan kepadaku ['Urwah bin Az-Zubair] [Hisyam bin Hakim bin Hizam] mendapatkan 'Iyadl bin Ghanim di Himsh menjemur rakyat jelata dalam masalah pembayaran jizyah, lalu Hisyam berkata kepadanya, Wahai 'Iyadl, saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \" Allah subhanahu wata'ala menyiksa orang yang menyiksa manusia di dunia.\""
            },
            {
                "number": 283,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ عَنْ عَمِّهِ قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِأَنَّ عِيَاضَ بْنَ غَنْمٍ وَهِشَامَ بْنَ حَكِيمِ بْنِ حِزَامٍ مَرَّا بِعَامِلِ حِمْصَ وَهُوَ يُشَمِّسُ أَنْبَاطًا فِي الشَّمْسِ فَقَالَ أَحَدُهُمَا لِلْعَامِلِ مَا هَذَا يَا فُلَانُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يُعَذِّبُ الَّذِينَ يُعَذِّبُونَ النَّاسَ فِي الدُّنْيَا",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim bin Sa'd] telah menceritakan kepada kami [anak saudara Ibnu Syihab] dari [pamannya] berkata; telah mengabarkan kepadaku ['Urwah bin Az-Zubair] ['Iyadl bin Ghonm] dan [Hisyam bin Hakim bin Hizam] melewati pejabat Himsh yang sedang mennjemur rakyat jelata di matahari, lalu salah satunya berkata kepada pejabat tadi, kenapa itu wahai fulan saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Allah subhanahu wata'ala akan menyiksa orang yang menyiksa manusia di dunia.\""
            },
            {
                "number": 284,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ رَبِيعِ بْنِ سَبْرَةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ الْفَتْحِ",
                "id": "Telah menceritakan kepada kami [Isma'il Bin Ibrahim] telah menceritakan kepada kami [Ma'mar] dari [Az-Zuhri] dari [Rabi' bin Sabrah] dari [Bapaknya] Rasulullah Shallallahu'alaihiwasallam melarang menikahi wanita secara Mut'ah pada peristiwa Fathu Makkah."
            },
            {
                "number": 285,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ الرَّبِيعِ بْنِ سَبْرَةَ الْجُهَنِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَلَغَ الْغُلَامُ سَبْعَ سِنِينَ أُمِرَ بِالصَّلَاةِ فَإِذَا بَلَغَ عَشْرًا ضُرِبَ عَلَيْهَا",
                "id": "Telah menceritakan kepada kami [Zaid bin Al Habhab] telah menceritakan kepadaku [Abdul Malik bin Rabi' bin Sabrah Al Juhani] dari [bapaknya] dari [kakeknya] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Apabila seorang anak telah mencapai tujuh tahun, maka ia diperintahkan untuk sholat, dan apabila ia telah mencapai sepuluh tahun, maka ia dipukul untuk sholat.\""
            },
            {
                "number": 286,
                "arab": "حَدَّثَنَا زَيْدٌ أَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ الرَّبِيعِ بْنِ سَبْرَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى أَحَدُكُمْ فَلْيَسْتَتِرْ لِصَلَاتِهِ وَلَوْ بِسَهْمٍ",
                "id": "Telah menceritakan kepada kami [Zaid] telah mengabarkan kepadaku [Abdul Malik bin Rabi' bin Sabrah] dari [bapaknya] dari [kakeknya] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Jika salah satu dari kalian sholat, ambillah pembatas di depannya walau dengan anak panah.\""
            },
            {
                "number": 287,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الرَّبِيعِ بْنِ سَبْرَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُتْرَةُ الرَّجُلِ فِي الصَّلَاةِ السَّهْمُ وَإِذَا صَلَّى أَحَدُكُمْ فَلْيَسْتَتِرْ بِسَهْمٍ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim] telah menceritakan kepada kami [Abdul Malik bin Rabi' bin Sabrah] dari [Bapaknya] dari [kakeknya] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Pembatas laki-laki dalam sholatnya adalah anak panah, jika salah seorang diantara kalian sholat, ambillah anak panah sebagai pembatas.\""
            },
            {
                "number": 288,
                "arab": "قَالَ حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الرَّبِيعِ بْنِ سَبْرَةَ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّهُ قَالَ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نُصَلِّيَ فِي أَعْطَانِ الْإِبِلِ وَرَخَّصَ أَنْ نُصَلِّيَ فِي مُرَاحِ الْغَنَمِ وَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمُتْعَةِ",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [Abdul Malik bin Rabi' bin Sabrah] dari [Bapaknya] dari [Kakeknya] dia berkata; Rasulullah Shallallahu'alaihiwasallam melarang kita sholat di kandang unta dan memberi keringanan untuk sholat di kandang kambing. Rasulullah Shallallahu'alaihiwasallam juga melarang nikah Mut'ah."
            },
            {
                "number": 289,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ الْأَنْصَارِيُّ قَالَ حَدَّثَنَا الرَّبِيعُ بْنُ سَبْرَةَ الْجُهَنِيُّ عَنْ أَبِيهِ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ فَأَقَمْنَا خَمْسَ عَشْرَةَ مِنْ بَيْنِ لَيْلَةٍ وَيَوْمٍ قَالَ قَالَ فَأَذِنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمُتْعَةِ قَالَ وَخَرَجْتُ أَنَا وَابْنُ عَمٍّ لِي فِي أَسْفَلِ مَكَّةَ أَوْ قَالَ فِي أَعْلَى مَكَّةَ فَلَقِينَا فَتَاةً مِنْ بَنِي عَامِرِ بْنِ صَعْصَعَةَ كَأَنَّهَا الْبَكْرَةُ الْعَنَطْنَطَةُ قَالَ وَأَنَا قَرِيبٌ مِنْ الدَّمَامَةِ وَعَلَيَّ بُرْدٌ جَدِيدٌ غَضٌّ وَعَلَى ابْنِ عَمِّي بُرْدٌ خَلَقٌ قَالَ فَقُلْنَا لَهَا هَلْ لَكِ أَنْ يَسْتَمْتِعَ مِنْكِ أَحَدُنَا قَالَتْ وَهَلْ يَصْلُحُ ذَلِكَ قَالَ قُلْنَا نَعَمْ قَالَ فَجَعَلَتْ تَنْظُرُ إِلَى ابْنِ عَمِّي فَقُلْتُ لَهَا إِنَّ بُرْدِي هَذَا جَدِيدٌ غَضٌّ وَبُرْدَ ابْنِ عَمِّي هَذَا خَلَقٌ مَحٌّ قَالَتْ بُرْدُ ابْنِ عَمِّكَ هَذَا لَا بَأْسَ بِهِ قَالَ فَاسْتَمْتَعَ مِنْهَا فَلَمْ نَخْرُجْ مِنْ مَكَّةَ حَتَّى حَرَّمَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Wuhaib] berkata; telah menceritakan kepada kami ['Umaroh bin Ghoziyyah Al Anshori] berkata; telah menceritakan kepada kami [Rabi' bin Sabrah Al Juhani] dari [Bapaknya] berkata; Kami berangkat bersama Rasulullah Shallallahu'alaihiwasallam pada Fathu Makkah. Kami tinggal selama lima belas hari dan satu malam. (Rabi' bin Sabrah Al Juhani Radliyallahu'anhu) berkata; (Bapaknya) berkata; Rasulullah Shallallahu'alaihiwasallam mengijinkan nikah Mut'ah. Saya dan anak pamanku keluar ke daerah yang rendah di Makkah atau daerah yang tinggi, lalu kami bertemu seorang wanita muda dari Bani 'Amir bin Sho'sho'ah, sepertinya dia adalah unta muda yang sangat bagus dan berleher panjang (maksudnya gadis belia yang berperawakan menarik). Saya orang termasuk orang buruk rupa, namun saya memakai mantel baru yang sangat bagus, sedang anak pamanku membawa mantel yang sudah usang. Kami mengatakan kepadanya, maukah kau menikah mut'ah dengan salah satu dari kami? Lalu wanita itu bertanya, apakah hal itu boleh? Ya, jawabku. Lalu dia melihat ke anak pamanku, lalu saya katakan kepadanya, mantelku ini baru dan bagus sedangkan mantel anak pamanku itu sudah usang dan lusuh. (wanita itu) berkata; mantel anak pamanmu itu tidak masalah. Lalu (anak pamannya) menikahinya secara mut'ah. Kami tidak berangkat lagi ke Makkah sampai Rasulullah Shallallahu'alaihiwasallam mengharamkannya."
            },
            {
                "number": 290,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عَبْدَ رَبِّهِ بْنَ سَعِيدٍ يُحَدِّثُ عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنِ الرَّبِيعِ بْنِ سَبْرَةَ عَنْ أَبِيهِ يُقَالُ لَهُ السَّبْرِيُّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَمَرَهُمْ بِالْمُتْعَةِ قَالَ فَخَطَبْتُ أَنَا وَرَجُلٌ امْرَأَةً قَالَ فَلَقِيتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ ثَلَاثٍ فَإِذَا هُوَ يُحَرِّمُهَا أَشَدَّ التَّحْرِيمِ وَيَقُولُ فِيهَا أَشَدَّ الْقَوْلِ وَيَنْهَى عَنْهَا أَشَدَّ النَّهْيِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] berkata; saya telah mendengar ['Abdu rabbihi bin Sa'id] menceritakan dari [Abdul Aziz bin 'Umar bin Abdul Aziz] dari [Rabi' bin Sabrah] dari [Bapaknya] yang bernama As-Sabri dari Nabi Shallallahu'alaihiwasallam beliau menyuruh mereka nikah Mut'ah. (Bapak Rabi') berkata; lantas saya dan seorang temanku melamar seorang wanita. Lalu saya bertemu Nabi Shallallahu'alaihiwasallam setelah tiga hari, ternyata beliau telah mengharamkannya dengan sangat, mengatakannya dengan sangat serius dan melarangnya dengan larangan yang keras."
            },
            {
                "number": 291,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الرَّبِيعِ بْنِ سَبْرَةَ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يُصَلَّى فِي أَعْطَانِ الْإِبِلِ وَرَخَّصَ أَنْ يُصَلَّى فِي مُرَاحِ الْغَنَمِ",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [Abdul Malik bin Rabi' bin Sabrah] dari [Bapaknya] dari [kakeknya] Rasulullah Shallallahu'alaihiwasallam melarang sholat di kandang unta dan memberi keringanan sholat di kandang kambing."
            },
            {
                "number": 292,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ عَنِ الرَّبِيعِ بْنِ سَبْرَةَ عَنْ أَبِيهِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نِكَاحِ الْمُتْعَةِ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az-Zuhri] dari [Rabi' bin Sabrah] dari [Bapaknya] berkata; Rasulullah Shallallahu'alaihiwasallam melarang nikah Mut'ah (menikahi wanita untuk jangka waktu tertentu)."
            },
            {
                "number": 293,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عَبْدُ الْعَزِيزِ قَالَ أَخْبَرَنِي الرَّبِيعُ بْنُ سَبْرَةَ الْجُهَنِيُّ عَنْ أَبِيهِ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا قَضَيْنَا عُمْرَتَنَا قَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتَمْتِعُوا مِنْ هَذِهِ النِّسَاءِ قَالَ وَالِاسْتِمْتَاعُ عِنْدَنَا يَوْمُ التَّزْوِيجِ قَالَ فَعَرَضْنَا ذَلِكَ عَلَى النِّسَاءِ فَأَبَيْنَ إِلَّا أَنْ يُضْرَبَ بَيْنَنَا وَبَيْنَهُنَّ أَجَلًا قَالَ فَذَكَرْنَا ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ افْعَلُوا فَانْطَلَقْتُ أَنَا وَابْنُ عَمٍّ لِي وَمَعَهُ بُرْدَةٌ وَمَعِي بُرْدَةٌ وَبُرْدَتُهُ أَجْوَدُ مِنْ بُرْدَتِي وَأَنَا أَشَبُّ مِنْهُ فَأَتَيْنَا امْرَأَةً فَعَرَضْنَا ذَلِكَ عَلَيْهَا فَأَعْجَبَهَا شَبَابِي وَأَعْجَبَهَا بُرْدُ ابْنِ عَمِّي فَقَالَتْ بُرْدٌ كَبُرْدٍ قَالَ فَتَزَوَّجْتُهَا فَكَانَ الْأَجَلُ بَيْنِي وَبَيْنَهَا عَشْرًا قَالَ فَبِتُّ عِنْدَهَا تِلْكَ اللَّيْلَةَ ثُمَّ أَصْبَحْتُ غَادِيًا إِلَى الْمَسْجِدِ فَإِذَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ الْبَابِ وَالْحَجَرِ يَخْطُبُ النَّاسَ يَقُولُ أَلَا أَيُّهَا النَّاسُ قَدْ كُنْتُ أَذِنْتُ لَكُمْ فِي الِاسْتِمْتَاعِ مِنْ هَذِهِ النِّسَاءِ أَلَا وَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَدْ حَرَّمَ ذَلِكَ إِلَى يَوْمِ الْقِيَامَةِ فَمَنْ كَانَ عِنْدَهُ مِنْهُنَّ شَيْءٌ فَلْيُخَلِّ سَبِيلَهَا وَلَا تَأْخُذُوا مِمَّا آتَيْتُمُوهُنَّ شَيْئًا",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Abdul Aziz] berkata; telah mengabarkan kepadaku [Rabi' bin Sabrah Al Juhani] dari [Bapaknya] berkata; kami keluar bersama Rasulullah Shallallahu'alaihiwasallam. Setelah kami melaksanakan Umrah, Rasulullah Shallallahu'alaihiwasallam bersabda kepada kami, \"Nikahilah para wanita itu dengan cara mut'ah (nikah dalam jangka waktu tertentu).\" (Sabrah Al Juhani Radliyallahu'anhu) berkata; istimta' menurut kami adalah hari pernikahan. Lalu kami menawarkan hal itu kepada para wanita, namun mereka menolaknya kecuali ditentukan jangka waktunya. Lalu hal ltu kami sampaikan kepada Nabi Shallallahu'alaihiwasallam. Beliau bersabda: \"Lakukanlah\", lalu saya berangkat bersama dengan anak pamanku dengan membawa mantel, namun mantelnya lebih baik daripada mantelku, hanya saya lebih muda darinya. Kami menemui wanita dan menawarkan diri kami, ternyata dia suka dengan kemudaanku namun dia juga suka dengan mantel temanku. (wanita itu) berkata; mantel itu sebagaimana mantel yang lainnya. Lalu saya menikahinya, dengan masa waku sepuluh hari. Saya tinggal bersama dengannya pada malam itu, lalu pada pagi hari saya berangkat ke masjid, ternyata Rasulullah Shallallahu'alaihiwasallam sedang berada di antara pintu dan kamar, beliau berkhutbah dan bersabda: \"Ketahuilah wahai manusia, dahulu saya mengijinkan kepada kalian nikah mut'ah. Namun sekarang Allah subhanahu wata'ala telah mengharamkannya sampai Hari Kiamat. Siapa yang telah memilikinya maka lepaskanlah dan jangan kalian ambil apa yang telah kalian berikan kepada mereka sedikitpun."
            },
            {
                "number": 294,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ وَحَجَّاجٌ قَالَ حَدَّثَنِي شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ زُرَارَةَ قَالَ حَجَّاجٌ فِي حَدِيثِهِ قَالَ سَمِعْتُ زُرَارَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَىعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يُوتِرُ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dan [Hajjaj] berkata telah menceritakan kepadaku [Syu'bah] berkata; saya telah mendengar [Qatadah] menceritakan dari [Zurarah] [Hajjaj] berkata; dalam haditsnya. Berkata; saya telah mendengar [Zurarah] dari [Abdurrahman bin Abza] dari Nabi Shallallahu'alaihiwasallam berwitir dengan surat, SABBIHISMA ROBBIKAL A'LA."
            },
            {
                "number": 295,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سَلَمَةَ بْنِ كُهَيْلٍ وَزُبَيْدٍ الْإِيَامِيِّ عَنْ ذَرٍّ عَنِ ابْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقْرَأُ فِي الْوِتْرِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ فَإِذَا سَلَّمَ قَالَ سُبْحَانَ الْمَلِكِ الْقُدُّوسِ سُبْحَانَ الْمَلِكِ الْقُدُّوسِ سُبْحَانَ الْمَلِكِ الْقُدُّوسِ وَرَفَعَ بِهَا صَوْتَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Salamah bin Kuhail] dan [Zubaid Al Iyami] dari [Dzar] dari [Abu Abdurrahman bin Abza] dari [Bapaknya] dari Nabi Shallallahu'alaihiwasallam beliau membaca dalam witir dengan surat, Sucikanlah nama Tuhanmu yang Maha Tingi, dan Katakanlah: \"Hai orang-orang kafir dan Katakanlah: \"Dia-lah Allah, yang Maha Esa. jika telah selesai salam beliau bersabda: \"Maha Suci Raja Yang Maha Suci, Maha Suci Raja Yang Maha Suci Maha Suci Raja Yang Maha Suci\" dan mengangkat suaranya."
            },
            {
                "number": 296,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا هَمَّامٌ أَخْبَرَنَا قَتَادَةُ عَنْ عَزْرَةَ عَنْ سَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الْوِتْرِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَقُلْ يَا أَيُّهَا الْكَافِرُونَ وَقُلْ هُوَ اللَّهُ أَحَدٌ وَكَانَ إِذَا سَلَّمَ قَالَ سُبْحَانَ الْمَلِكِ الْقُدُّوسِ يُطَوِّلُهَا ثَلَاثًا",
                "id": "Telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Hammam] telah mengabarkan kepada kami [Qatadah] dari ['Azroh] dari [Sa'id bin Abdurrahman bin Abza] dari [Bapaknya] dari Nabi Shallallahu'alaihiwasallam, beliau membaca dalam sholat witirnya, dengan Sucikanlah nama Tuhanmu yang Maha Tingi, dan Katakanlah: \"Hai orang-orang kafir dan Katakanlah: \"Dia-lah Allah, yang Maha Esa. jika telah selesai salam beliau bersabda: \"Maha Suci Raja Yang Maha Suci\" dan memanjangkannya tiga kali."
            }
        ]
    }
}