{
    "status": true,
    "data": {
        "start": 4145,
        "end": 4292,
        "total": 148,
        "book": "ahmad",
        "hadits": [
            {
                "number": 4145,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ قَالَ حَدَّثَنِي مَنْ سَمِعَ ابْنَ عَبَّاسٍ يَقُولُ حَدَّثَتْنِي ضُبَاعَةُ أَنَّهَاقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ الْحَجَّ فَقَالَ لَهَا حُجِّي وَاشْتَرِطِي",
                "id": "Telah menceritakan kepada kami [Muhammad bin Mush'ab] dia berkata, telah menceritakan kepada kami [Al Auza'i] dari ['Abdul Karim Al Jazari] dia berkata, telah menceritakan kepadaku [seseorang] yang mendengar [Ibnu Abbas] berkata, telah menceritakan kepadaku [Dluba'ah] bahwa dia bertanya, \"Wahai Rasulullah, sesungguhnya aku ingin melaksanakan haji, \" maka beliau pun bersabda kepadanya: \"Berhaji dan tentukanlah syarat.\""
            },
            {
                "number": 4146,
                "arab": "حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ عَنِ الْمُنْذِرِ بْنِ الْمُغِيرَةِ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ أَنَّ فَاطِمَةَ بِنْتَ أَبِي حُبَيْشٍ حَدَّثَتْهُأَنَّهَا أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَكَتْ إِلَيْهِ الدَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ ذَلِكَ عِرْقٌ فَانْظُرِي فَإِذَا أَتَاكِ قُرْؤُكِ فَلَا تُصَلِّي فَإِذَا مَرَّ الْقُرْءُ فَتَطَهَّرِي ثُمَّ صَلِّي مَا بَيْنَ الْقُرْءِ إِلَى الْقُرْءِ",
                "id": "Telah menceritakan kepada kami [Yunus bin Muhammad] dia berkata, telah menceritakan kepada kami [Laits bin Sa'd] dia berkata, telah menceritakan kepadaku [Yazid bin Abu Habib] dari [Bukair bin 'Abdullah] dari [Mundzir bin Mughirah] dari ['Urwah bin Zubair] bahwa [Fatimah binti Abu Hubaisi] telah menceritakan kepadanya, bahwa dia datang menemui Nabi shallallahu 'alaihi wasallam dan mengadukan kepadanya mengenai darah kebiasaan wanita, Rasulullah shallallahu 'alaihi wasallam kemudian menjawab: \"Itu adalah darah kotor (keringat), lihatlah jika datang kepadamu masa Quru' (masa haid) maka jangan kamu melaksanakan sholat, dan jika telah selesai masa haidmu maka bersucilah kemudian laksanakan sholat antara masa haid dengan masa haid berikutnya.\""
            },
            {
                "number": 4147,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي سُفْيَانَ قَالَ سَمِعْتُ جَابِرًا قَالَ حَدَّثَتْنِي أُمُّ مُبَشِّرٍ امْرَأَةِ زَيْدِ بْنِ حَارِثَةَ قَالَتْدَخَلْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَائِطٍ فَقَالَ لَكِ هَذَا فَقُلْتُ نَعَمْ فَقَالَ مَنْ غَرَسَهُ مُسْلِمٌ أَوْ كَافِرٌ قُلْتُ مُسْلِمٌ قَالَ مَا مِنْ مُسْلِمٍ يَزْرَعُ أَوْ يَغْرِسُ غَرْسًا فَيَأْكُلُ مِنْهُ طَائِرٌ أَوْ إِنْسَانٌ أَوْ سَبُعٌ أَوْ شَيْءٌ إِلَّا كَانَ لَهُ صَدَقَةًقَالَ أَبِي وَلَمْ يَكُنْ فِي النُّسْخَةِ سَمِعْتُ جَابِرًا فَقَالَ ابْنُ نُمَيْرٍ سَمِعْتَ عَامِرًا",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] dia berkata, telah menceritakan kepada kami [Al A'masy] dari [Abu Sufyan] dia berkata, aku mendengar [Jabir] berkata, telah menceritakan kepadaku [Ummu Mubasyir] isteri Zaid bin Haritsah, dia berkata, \"Aku menemui Rasulullah shallallahu 'alaihi wasallam di sebuah kebuh, beliaulalu bertanya: \"Apakah ini milikmu?\" aku menjawab, \"Ya.\" Beliau bertanya lagi: \"Apakah orang yang menanam ini seorang Muslim ataukah kafir?\" aku menjawab, \"Seorang Muslim.\" Beliau bersabda: \"Tidaklah seorang Muslim yang menanam tanaman, kemudian burung-burung memakannya, atau orang lain, atau hewan, atau sesuatu memakannya kecuali itu akan menjadi sedekah baginya.\" Bapakku berkata, \"Dalam dalam lembaran catatan, aku tidak mendengar Jabir.\" Sedangkan Ibnu Numair berkata, \"Aku mendengar Amir.\""
            },
            {
                "number": 4148,
                "arab": "حَدَّثَنَا حَجَّاجٌ قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرًا قَالَ حَدَّثَتْنِي أُمُّ مُبَشِّرٍ أَنَّهاسَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ حَفْصَةَ يَقُولُ لَا يَدْخُلُ النَّارَ إِنْ شَاءَ اللَّهُ مِنْ أَصْحَابِ الشَّجَرَةِ أَحَدٌ الَّذِينَ بَايَعُوا تَحْتَهَا فَقَالَتْ بَلَى يَا رَسُولَ اللَّهِ فَانْتَهَرَهَا فَقَالَتْ حَفْصَةُ{ وَإِنْ مِنْكُمْ إِلَّا وَارِدُهَا }فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ قَالَ اللَّهُ عَزَّ وَجَلَّ{ ثُمَّ نُنَجِّي الَّذِينَ اتَّقَوْا وَنَذَرُ الظَّالِمِينَ فِيهَا جِثِيًّا }",
                "id": "Telah menceritakan kepada kami [Hajjaj] dia berkata, telah mengabarkan kepadaku [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Abu Zubair] bahwa dia mendengar [Jabir] berkata, telah menceritakan kepadaku [Ummu Mubasyir] bahwa dia mendengar Rasulullah shallallahu 'alaihi wasallam waktu berada di samping Hafshah, beliau bersabda: \"Insyaallah tidak akan masuk Neraka orang-orang yang pernah berbaiat di bawah pohon.\" Hafshah berkata, \"Tentu wahai Rasulullah, \" namun beliau menghardiknya hingga Hafshah pun membaca: '(Dan tidak ada seorang pun dari padamu, melainkan mendatangi neraka itu) ' (Qs. Maryam: 71), lantas Nabi shallallahu 'alaihi wasallam bersabda: \"Sungguh Allah Azza Wa Jalla telah berfirman: '(Kemudian Kami akan menyelamatkan orang-orang yang bertaqwa dan membiarkan orang-orang yang lalim di dalam neraka dalam keadaan berlutut) ' (Qs. Maryam: 72)."
            },
            {
                "number": 4149,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ قَالَ حَدَّثَنَا سَعْدُ بْنُ إِسْحَاقَ بْنِ كَعْبِ بْنِ عُجْرَةَ الْأَنْصَارِيُّ عَنْ عَمَّتِهِ زَيْنَبَ بِنْتِ كَعْبٍ أَنَّ فُرَيْعَةَ بِنْتَ مَالِكِ بْنِ سِنَانٍ أُخْتَ أَبِي سَعِيدٍ الْخُدْرِيِّ حَدَّثَتْهَاأَنَّ زَوْجَهَا خَرَجَ فِي طَلَبِ أَعْلَاجٍ لَهُمْ فَأَدْرَكَهُمْ بِطَرَفِ الْقَدُومِ فَقَتَلُوهُ فَأَتَاهَا نَعْيُهُ وَهِيَ فِي دَارٍ مِنْ دُورِ الْأَنْصَارِ شَاسِعَةٍ عَنْ دَارِ أَهْلِهَا فَكَرِهَتْ الْعِدَّةَ فِيهَا فَأَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ أَتَانِي نَعْيُ زَوْجِي وَأَنَا فِي دَارٍ مِنْ دُورِ الْأَنْصَارِ شَاسِعَةٍ عَنْ دُورِ أَهْلِي إِنَّمَا تَرَكَنِي فِي مَسْكَنٍ لَا يَمْلِكُهُ وَلَمْ يَتْرُكْنِي فِي نَفَقَةٍ يُنْفَقُ عَلَيَّ وَلَمْ أَرِثْ مِنْهُ مَالًا فَإِنْ رَأَيْتَ أَنْ أَلْحَقَ بِإِخْوَتِي وَأَهِلِي فَيَكُونَ أَمَرُنَا جَمِيعًا فَإِنَّهُ أَحَبُّ إِلَيَّ فَأَذِنَ لِي أَنْ أَلْحَقَ بِأَهْلِي فَخَرَجْتُ مَسْرُورَةً بِذَلِكَ حَتَّى إِذَا كُنْتُ فِي الْحُجْرَةِ أَوْ الْمَسْجِدِ دَعَانِي أَوْ أَمَرَ بِي فَدُعِيتُ فَقَالَ لِي كَيْفَ زَعَمْتِ فَأَعَدْتُ عَلَيْهِ فَقَالَ امْكُثِي فِي مَسْكَنِ زَوْجِكِ الَّذِي جَاءَكِ فِيهِ نَعْيُهُ حَتَّى يَبْلُغَ الْكِتَابُ أَجَلَهُ قَالَتْ فَاعْتَدَدْتُ فِيهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا",
                "id": "Telah menceritakan kepada kami [Bisyr bin Mufadlal] dia berkata, telah menceritakan kepada kami [Ibnu Ishaq bin Ka'b bin 'Ujrah Al Anshari] dari bibinya [Zainab binti Ka'b] bahwa [Furai'ah binti Malik bin Sinan] saudarinya Abu Sa'id Al Khudri, bahwa dia telah menceritakan kepadanya, bahwa suaminya keluar untuk mencari budaknya, namun kemudian mereka membunuhnya dengan kapak. Kemudian saat berita duka itu datang ia berada di salah satu rumah orang-orang Anshar yang sangat jauh dari rumah keluarganya, sehingga ia tidak ingin saat iddah berada di rumah tersebut (rumah suami). Kemudian dia menemui Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, saat berita kematian suamiku datang aku berada di salah satu rumah orang-orang Anshar, dan jauh dari rumah keluargaku. Suamiku meninggalkan aku di rumah yang bukan miliknya, dan ia juga tidak meninggalkan nafkah untukku, bahkan tidak ada yang bisa aku warisi dari hartanya. Bagaimana pendapat tuan jika aku pindah ke rumah saudara dan keluargaku, sehingga perkara semuanya mudah, dan itu lebih aku cintai?\" kemudian beliau mengizinkan aku untuk tinggal bersama saudara dan keluargaku, akupun keluar dengan perasaan gembira. Sehingga ketika aku sampai di kamar atau di masjid, beliau memanggilku, atau menyuruh utusan untuk memanggilku, beliau bersabda kepadaku: \"Bagaimana perasaanmu, \" maka aku kembali menegaskan kepada beliau (tentang keinginanku) kepada beliau.\" Beliau kemudian bersabda: \"Tinggallah kamu di tempat suamimu, sehingga selesai masa iddahmu.\" Furai'ah berkata, \"Kemudian aku menunggu masa iddah di rumahnya selama empat bulan sepuluh hari.\""
            },
            {
                "number": 4150,
                "arab": "حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ أَخْبَرَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ عَنْ مَكْحُولٍ عَنْ أُمِّ أَيْمَنَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَتْرُكْ الصَّلَاةَ مُتَعَمِّدًا فَإِنَّهُ مَنْ تَرَكَ الصَّلَاةَ مُتَعَمِّدًا فَقَدْ بَرِئَتْ مِنْهُ ذِمَّةُ اللَّهِ وَرَسُولِهِ",
                "id": "Telah menceritakan kepada kami [Walid bin Muslim] dia berkata, telah mengabarkan kepada kami [Sa'id bin 'Abdul Aziz] dari [Makhul] dari [Ummu Aiman] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kamu meninggalkan sholat dengan sengaja, karena siapa yang meninggalkan sholat dengan sengaja maka perlindungan Allah dan Rasul-Nya akan terlepas darinya.\""
            },
            {
                "number": 4151,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنِ ابْنِ جُرَيْجٍ قَالَ أَخْبَرَنِي عَبْدُ الْحَمِيدِ بْنُ جُبَيْرِ بْنِ شَيْبَةَ وَابْنُ بَكْرٍ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ وَرَوْحٌ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جُبَيْرِ بْنِ شَيْبَةَ أَنَّ ابْنَ الْمُسَيَّبِ أَخْبَرَهُ أَنَّ أُمَّ شَرِيكٍ أَخْبَرَتْهُأَنَّهَا اسْتَأْمَرَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَتْلِ الْوَزَغَاتِ فَأَمَرَهَا بِقَتْلِ الْوَزَغَاتِقَالَ ابْنُ بَكْرٍ وَرَوْحٌ وَأُمُّ شَرِيكٍ إِحْدَى نِسَاءِ بَنِي عَامِرِ بْنِ لُؤَىٍّ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] berkata, telah menceritakan kepada kami Yahya bin Sa'id dari Ibnu Juraij dia berkata, telah menceritakan kepada kami [Abdul Hamid bin Jubair bin Syaibah], dan [Ibnu Bakar] dia berkata, telah menceritakan kepada kami [Ibnu Juraij], dan [Rauh] dia berkata, telah bercerita kepada kami [Ibnu Juraij] dia berkata, telah menceritakan kepada kami [Abdul Hamid bin Jubair bin Syaibah] bahwa [Ibnul Musayyab] menceritakan kepadanya bahwa, [Ummu Syarik] mengabarkan kepadanya, bahwa ia pernah minta tolong kepada Nabi shallallahu 'alaihi wasallam untuk membunuh cicak, kemudian Nabi menyuruhnya untuk membunuhnya.\" [Ibnu Bakar], dan [Rauh] berkata, \"Ummu Syarik adalah salah seorang wanita bani Amir Bin Lu'Abu Isa berkata, \".\""
            },
            {
                "number": 4152,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ قَالَ حَدَّثَنِي دَيْلَمٌ أَبُو غَالِبٍ الْقَطَّانُ قَالَ حَدَّثَنِي الْحَكَمُ بْنُ جَحْلٍ قَالَ حَدَّثَتْنِي أُمُّ الْكِرَامِأَنَّهَا حَجَّتْ قَالَتْ فَلَقِيتُ امْرَأَةً بِمَكَّةَ كَثِيرَةَ الْحَشَمِ لَيْسَ عَلَيْهِنَّ حُلِيٌّ إِلَّا الْفِضَّةُ فَقُلْتُ لَهَا مَا لِي لَا أَرَى عَلَى أَحَدٍ مِنْ حَشَمِكِ حُلِيًّا إِلَّا الْفِضَّةَ قَالَتْ كَانَ جَدِّي عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مَعَهُ عَلَيَّ قُرْطَانِ مِنْ ذَهَبٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شِهَابَانِ مِنْ نَارٍ فَنَحْنُ أَهْلَ الْبَيْتِ لَيْسَ أَحَدٌ مِنَّا يَلْبَسُ حُلِيًّا إِلَّا الْفِضَّةَ",
                "id": "Telah menceritakan kepada kami ['Abdus Shamad] berkata, telah menceritakan kepadaku [Dailam Abu Ghalib AL Qatthan] berkata, telah menceritakan kepadaku [Al Hakam bin Jahl] berkata, telah menceritakan kepadaku [Ummul Kiram], bahwa dia melaksanakan haji.\" Kemudian dia berkata, \"Aku lalu bertemu dengan [seorang wanita] di Makkah yang memiliki banyak pelayan, dia tidak memiliki perhiasan kecuali perak, maka aku bertanya kepadanya, 'Kenapa aku tidak melihat salah seorang dari pelayanmu memakai perhiasan kecuali dari perak? ' dia menjawab, 'Dulu ketika kakekku ada di sisi Rasulullah shallallahu 'alaihi wasallam, sementara aku yang saat itu bersamanya mengenakan anting-anting, Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Dua kilauan api neraka! Kami adalah Ahlul Bait, dan tidak ada satu orangpun dari kami yang memakai perhiasan kecuali dari perak.\""
            },
            {
                "number": 4153,
                "arab": "حَدَّثَنَا يُونُسُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُؤَمَّلِ عَنْ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا عَطَاءٌ عَنْ حَبِيبَةَ بِنْتِ أَبِي تَجْرَاةَ قَالَتْدَخَلْنَا دَارَ أَبِي حُسَيْنٍ فِي نِسْوَةٍ مِنْ قُرَيْشٍ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَطُوفَ بَيْنَ الصَّفَا وَالْمَرْوَةِ قَالَتْ وَهُوَ يَسْعَى يَدُورُ بِهِ إِزَارُهُ مِنْ شِدَّةِ السَّعْيِ وَهُوَ يَقُولُ لِأَصْحَابِهِ اسْعَوْا فَإِنَّ اللَّهَ كَتَبَ عَلَيْكُمْ السَّعْيَ",
                "id": "Telah menceritakan kepada kami [Yunus] berkata, telah menceritakan kepada kami [Abdullah bin Al Muammal] dari [Umar bin Abdurrahman] berkata, telah menceritakan kepada kami [Atha'] dari [Habibah binti Abu Tajrah] dia berkata, \"Kami masuk ke dalam rumah Abu Husain yang sedang berkumpul di dalamnya para wanita Quraisy, sementara Nabi shallallahu 'alaihi wasallam sedang melaksanakan Sa'i antara shafa dan Marwah.\" Habibah berkata, \"Beliau melaksanakan sa'i sambil melingkarkan kain ihramnya karena payahnya melaksanakan sa'I, dan beliau berkata kepada para sahabatnya: \"Lakukanlah sa'i karena Allah akan mencatat pahala sa'i kalian.\""
            },
            {
                "number": 4154,
                "arab": "حَدَّثَنَا سُرَيْجٌ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُؤَمَّلِ عَنْ عُمَرَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ حَبِيبَةَ بِنْتِ أَبِي تَجْرَاةَ قَالَتْرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَطُوفُ بَيْنَ الصَّفَا وَالْمَرْوَةِ وَالنَّاسُ بَيْنَ يَدَيْهِ وَهُوَ وَرَاءَهُمْ وَهُوَ يَسْعَى حَتَّى أَرَى رُكْبَتَيْهِ مِنْ شِدَّةِ السَّعْيِ يَدُورُ بِهِ إِزَارُهُ وَهُوَ يَقُولُ اسْعَوْا فَإِنَّ اللَّهَ كَتَبَ عَلَيْكُمْ السَّعْيَ",
                "id": "Telah menceritakan kepada kami [Suraij] berkata, telah menceritakan kepada kami [Abdullah bin Al Muammal] dari Umar bin Abdurrahman dari [Atha' bin Rabah] dari [Shafiyah binti Syaibah] dari [Habibah binti Abu Tajrah] dia berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam thawaf antara Shafa dan Marwa, sedangkan orang-orang berada di samping kanan dan kirinya, dan Beliau berada di belakang mereka. Aku melihat beliau melakukan sa'i sambil melingkarkan kain ihramnya di kedua lututnya karena payahnya melaksanakan sa'i. Kemudian beliau berkata kepada para sahabatnya: \"Lakukanlah sa'i karena Allah akan mencatat pahala sa'i kalian.\""
            },
            {
                "number": 4155,
                "arab": "حَدَّثَنَا هُشَيْمٌ قَالَ أَخْبَرَنَا مَنْصُورٌ عَنْ عَطَاءٍ عَنْ حَبِيبَةَ بِنْتِ مَيْسَرَةَ عَنْ أُمِّ كُرْزٍ الْكَعْبِيَّةِ الْخُزَاعِيَّةِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْعَقِيقَةِ فَقَالَ عَنْ الْغُلَامِ شَاتَانِ مُكَافَأَتَانِ وَعَنْ الْجَارِيَةِ شَاةٌ",
                "id": "Telah menceritakan kepada kami [Husyaim] berkata, telah mengabarkan kepada kami [Manshur] dari [Atha'] dari [Habibah binti Maisarah] dari [Ummu Kurz Al Ka'biyyah Al Khuzaiyyah] dari Nabi shallallahu 'alaihi wasallam tentang akikah: \"Anak laki-laki dengan dua kambing dan anak perempuan dengan satu kambing.\""
            },
            {
                "number": 4156,
                "arab": "حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ قَالَ حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أُمِّ كُرْزٍ الْخُزَاعِيَّةِ قَالَتْأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِغُلَامٍ فَبَالَ عَلَيْهِ فَأَمَرَ بِهِ فَنُضِحَ وَأُتِيَ بِجَارِيَةٍ فَبَالَتْ عَلَيْهِ فَأَمَرَ بِهِ فَغُسِلَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar Al Hanafi] berkata; telah menceritakan kepada kami [Usamah bin Zaid] dari [Amru Bin Syu'aib] dari [Ummu Kurzi Al Khuza'i] dia berkata, \"Dihadapkan kepada Nabi shallallahu 'alaihi wasallam seorang bayi laki laki yang kemudian megencinginya, beliau lalu memerintahkan untuk memercikinya, lantas sisa kencingnya itu pun diperciki air. Dan dihadapkan pula seorang bayi perempuan, ketika bayi itu mengencinginya, beliau memerintahkan untuk mencucinya, maka sisa kencingnya pun dicuci.\""
            },
            {
                "number": 4157,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنِ ابْنِ جُرَيْجٍ حَدَّثَنِي عَطَاءٌ عَنْ حَبِيبَةَ بِنْتِ مَيْسَرَةَ عَنْ أُمِّ بَنِي كُرْزٍ الْكَعْبِيَّةِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْغُلَامِ شَاتَانِ وَعَنْ الْجَارِيَةِ شَاةٌ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu Juraij] telah menceritakan kepadaku [Atha'] dari [Habibah binti Maisarah] dari [Ummu Bani Kurz Al Ka'biyah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Untuk bayi laki-laki dua ekor kambing dan untuk bayi perempuan satu ekor kambing.\""
            },
            {
                "number": 4158,
                "arab": "حَدَّثَنَا حَجَّاجٌ عَنِ ابْنِ جُرَيْجٍ وَعَبْدِ الرَّزَّاقِ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عَطَاءٌ عَنْ حَبِيبَةَ بِنْتِ مَيْسَرَةَ بْنِ أَبِي خُثَيْمٍ عَنْ أُمِّ بَنِي كُرْزٍ الْكَعْبِيَّةِ أَنَّهَاسَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْعَقِيقَةِ فَقَالَ عَنْ الْغُلَامِ شَاتَانِ مُكَافَأَتَانِ وَعَنْ الْجَارِيَةِ شَاةٌقُلْتُ لِعَطَاءٍ مَا الْمُكَافَأَتَانِ قَالَ الْمِثْلَانِ قَالَ حَجَّاجٌ فِي حَدِيثِهِ وَالضَّأْنُ أَحَبُّ إِلَيَّ مِنْ الْمَعْزِ وَذَكَرَ أَنَّهَا أَحَبُّ إِلَيَّ مِنْ إِنَاثِهَا قَالَ وَنُحِبُّ أَنْ يَجْعَلَهُ سَوَادَهَا مِنْهُ",
                "id": "Telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] dan [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ibnu Juraij] berkata, telah mengabarkan kepadaku [Atha'] dari [Habibah binti Maisarah bin Abu Hutsaim] dari [Ummu Bani Kurz Al Ka'biyah] bahwa dia bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan akikah, maka beliau bersabda: \"Untuk anak laki-laki dua ekor kambing yang layak, sedangkan untuk anak perempuan satu ekor kambing.\" Aku bertanya kepada Atha', \"Apa maksud dari mukafatani (yang layak)?\" Dia lalu menjawab, \"Yaitu yang sama.\" [Hajjaj] menyebutkan dalam haditsnya, \"Dan domba lebih aku sukai daripada kambing kacang (sejenis kambing yang kecil), dan jantan lebih aku sukai daripada yang betina.\" Dia berkata, \"kami lebih suka jika jumlahnya lebih banyak darinya.\""
            },
            {
                "number": 4159,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ عَنْ سِبَاعِ بْنِ ثَابِتٍ أَنَّ مُحَمَّدَ بْنَ ثَابِتِ بْنِ سِبَاعٍ أَخْبَرَهُ أَنَّ أُمَّ كُرْزٍ أَخْبَرَتْهُ أَنَّهَاسَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْعَقِيقَةِ فَقَالَ يُعَقُّ عَنْ الْغُلَامِ شَاتَانِ وَعَنْ الْأُنْثَى وَاحِدَةٌ وَلَا يَضُرُّكُمْ أَذُكْرَانًا كُنَّ أَوْ إِنَاثًاحَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ أَنَّ سِبَاعَ بْنَ ثَابِتِ بْنِ عَمْرٍو عَنْ مُحَمَّدِ بْنِ ثَابِتِ بْنِ سِبَاعٍ أَخْبَرَهُ أَنَّ أُمَّ كُرْزٍ أَخْبَرَتْهُ أَنَّهَا سَأَلَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْعَقِيقَةِ فَذَكَرَهُ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ibnu Juraij] berkata, telah mengabarkan kepadaku [ubaidhullah bin Abu Yazid] dari [Siba' bin Tsabit] bahwa [Muhammad bin Tsabit bin Siba'] telah mengabarkan kepadanya, bahwa [Ummu Kurz] telah mengabarkan kepadanya, bahwa dia bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai hewan akikah, maka beliau bersabda: \"Anak laki-laki diakikahi dengan dua ekor kambing sedangkan anak perempuan dengan satu ekor kambing. Dan kalian tidak berdosa apakah kambing iti jantan atau betina.\" Telah menceritakan kepada kami [Muhammad bin Bakr] berkata, telah mengabarkan kepada kami [Ibnu Juraij] berkata, telah mengabarkan kepadaku [ubaidhullah bin Abu Yazid] bahwa [Siba' bin Tsabit bin Amru] dari [Muhammad bin Tsabit bin Siba'] telah mengabarkan kepadanya, bahwa [Ummu Kurz] telah mengabarkan kepadanya, bahwa dia bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai hewan akikah…kemudian dia menyebutkan hadits tersebut.\""
            },
            {
                "number": 4160,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ عَنْ رَجُلٍ مِنْ الْأَنْصَارِ عَنْ أُمِّهِ سَلْمَى بِنْتِ قَيْسٍ قَالَتْبَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نِسْوَةٍ مِنْ الْأَنْصَارِ قَالَتْ كَانَ فِيمَا أَخَذَ عَلَيْنَا أَنْ لَا تَغُشَّنَّ أَزْوَاجَكُنَّ قَالَتْ فَلَمَّا انْصَرَفْنَا قُلْنَا وَاللَّهِ لَوْ سَأَلْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا غِشُّ أَزْوَاجِنَا قَالَتْ فَرَجَعْنَا فَسَأَلْنَاهُ قَالَ أَنْ تُحَابِينَ أَوْ تُهَادِينَ بِمَالِهِ غَيْرَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin ubaidhullah] berkata, telah menceritakan kepada kami [Muhammad bin Ishaq] dari [seorang laki-laki Anshar] dari ibunya [Salma binti Qais] dia berkata, \"Aku berbaiat kepada Rasulullah shallallahu 'alaihi wasallam bersama dengan beberapa wanita dari Anshar.\" Salma berkata, \"Dan yang beliau ambil janjinya dari kami adalah; 'hendaknya kalian tidak menipu suami-suami kalian', \" Salma berkata, \"Ketika kami telah berlalu pergi, kami pun berkata, \"Demi Allah, sekiranya kita bertanya kepada Rasulullah shallallahu 'alaihi wasallam apa maksud dari 'tidak menipu suami-suami kami? ' Maka kami kembali kepada beliau dan bertanya, beliau lalu menjawab: \"Kalian mencintainya, atau menggunakan hartanya untuk selain dia (suami).\""
            },
            {
                "number": 4161,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ قَالَ حَدَّثَنَا الْحُرُّ بْنُ الصَّيَّاحِ عَنْ هُنَيْدَةَ بْنِ خَالِدٍ عَنِ امْرَأَتِهِ عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ تِسْعَ ذِي الْحِجَّةِ وَيَوْمَ عَاشُورَاءَ وَثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ أَوَّلَ اثْنَيْنِ مِنْ الشَّهْرِ وَخَمِيسَيْنِ",
                "id": "Telah menceritakan kepada kami [Affan] berkata, telah menceritakan kepada kami [Abu Awanah] berkata, telah menceritakan kepada kami [Al Hurr bin As Shayyah] dari [Hunaidah bin Khalid] dari [isterinya] dari [sebagian isteri] Nabi shallallahu 'alaihi wasallam, dia berkata, \"Rasulullah shallallahu 'alaihi wasallam melaksanakan puasa pada tanggal sembilan Dzul Hijah, hari Asyura, tiga hari pada tiap bulan dan hari Senin dan Kamis tiap awal bulan.\""
            },
            {
                "number": 4162,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ قَالَ حَدَّثَنِي أَبِي قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ حَبَّانَ قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ عَنْ أُمِّ حَرَامٍ بِنْتِ مِلْحَانَ وَهِيَ خَالَتُهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَامَ أَوْ قَالَ فِي بَيْتِهَا فَاسْتَيْقَظَ وَهُوَ يَضْحَكُ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا يُضْحِكُكَ فَقَالَ عُرِضَ عَلَيَّ نَاسٌ مِنْ أُمَّتِي يَرْكَبُونَ ظَهْرَ هَذَا الْبَحْرِ الْأَخْضَرِ كَالْمُلُوكِ عَلَى الْأَسِرَّةِ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ فَقَالَ إِنَّكِ مِنْهُمْ ثُمَّ نَامَ فَاسْتَيْقَظَ وَهُوَ يَضْحَكُ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا أَضْحَكَكَ قَالَ عُرِضَ عَلَيَّ نَاسٌ مِنْ أُمَّتِي يَرْكَبُونَ ظَهْرَ هَذَا الْبَحْرِ الْأَخْضَرِ كَالْمُلُوكِ عَلَى الْأَسِرَّةِ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ قَالَ أَنْتِ مِنْ الْأَوَّلِينَقَالَ فَتَزَوَّجَهَا عُبَادَةُ بْنُ الصَّامِتِ فَأَخْرَجَهَا مَعَهُ فَلَمَّا جَازَ الْبَحْرَ بِهَا رَكِبَتْ دَابَّةً فَصَرَعَتْهَا فَقَتَلَتْهَا حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ حَدَّثَتْنِي أُمُّ حَرَامٍ بِنْتُ مِلْحَانَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي بَيْتِهَا يَوْمًا فَاسْتَيْقَظَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَضْحَكُ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Abdus Shamad] berkata, telah menceritakan kepadaku [ayahku] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] berkata, telah menceritakan kepadaku [Muhammad bin Yahya bin Habban] berkata, telah menceritakan kepadaku [Anas bin Malik] dari [Ummu Haram binti Milhan] dan dia adalah bibinya, bahwa Rasulullah shallallahu 'alaihi wasallam tidur -atau dia menyebutkan- tidur siang di rumahnya, tiba-tiba beliau bangun dan tertawa, Maka aku berkata, \"Wahai Rasulullah, apa yang menyebabkan tuan tertawa?\" Beliau bersabda: \"Ditampakkan kepadaku sekelompok manusia dari ummatku, mereka berlayar di laut hijau ini seperti para raja di atas singgasana.\" Ummu Haram lalu berkata, \"Aku berkata, \"Wahai Rasulullah, do'akanlah agar aku menjadi bagian dari mereka.\" Beliau pun bersabda: \"Sesungguhnya kamu termasuk dari mereka.\" Kemudian Beliau tertidur kembali dan bangun dengan tertawa, maka aku bertanya, \"Wahai Rasulullah, apa yang menyebabkan tuan tertawa?\" Beliau menjawab: \"Ditampakkan kepadaku sekelompok manusia dari ummatku, mereka berlayar di laut hijau ini seperti raja-raja di atas singgasana.\" Ummu Haram berkata, \"Kemudian aku berkata, \"Wahai Rasulullah, do'akanlah agar aku menjadi bagian dari mereka.\" Beliau pun bersabda: \"Kamu adalah termasuk yang pertama-tama.\" Anas berkata, \"Kemudian Ummu Haram menikah dengan Ubadah bin Shamit dan ikut berperang bersamanya, tatkala dia menyeberangi lautan, dia menaiki seekor bighal dan terjatuh hingga ia pun gugur.\" Telah menceritakan kepada kami [Sulaiman bin Harb] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari [Anas bin Malik] berkata, telah menceritakan kepadaku [Ummu Haram binti Milhan], bahwa suatu hari Nabi shallallahu 'alaihi wasallam bersabda di dalam rumahnya, tiba-tiba Rasulullah shallallahu 'alaihi wasallam bangun dari tudurnya dengan tertawa…kemudian dia menyebutkan maknanya.\""
            },
            {
                "number": 4163,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ مَالِكٍ عَنْ أَبِي النَّضْرِ عَنْ أَبِي مُرَّةَ مَوْلَى عَقِيلِ بْنِ أَبِي طَالِبٍ عَنْ أُمِّ هَانِئٍأَنَّهَا ذَهَبَتْ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ قَالَتْ فَوَجَدْتُهُ يَغْتَسِلُ وَفَاطِمَةُ تَسْتُرُهُ بِثَوْبٍ فَسَلَّمْتُ وَذَلِكَ ضُحًى فَقَالَ مَنْ هَذَا قُلْتُ أَنَا أُمُّ هَانِئٍ قُلْتُ يَا رَسُولَ اللَّهِ زَعَمَ ابْنُ أُمِّي أَنَّهُ قَاتِلٌ رَجُلًا أَجَرْتُهُ فُلَانَ ابْنَ هُبَيْرَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَجَرْنَا مَنْ أَجَرْتِ يَا أُمَّ هَانِئٍ فَلَمَّا فَرَغَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غُسْلِهِ قَامَ فَصَلَّى ثَمَانِ رَكَعَاتٍ مُلْتَحِفًا فِي ثَوْبٍ",
                "id": "Telah menceritakan kepada kami [Abdurrahman] dari [Malik] dari [Abu An Nadlr] dari [Abu Murrah] bekas budak Aqil bin Abu Thalib, dari [Ummu Hani'] bahwa dia pergi menemui Nabi shallallahu 'alaihi wasallam pada hari penaklukan kota Makkah.\" Ummu Hani` berkata, \"Kemudian aku mendapati beliau sedang mandi sementara Fatimah menutupinya dengan kain, kemudian aku mengucapkan salam kepadanya, dan ketika itu adalah waktu dluha. Nabi lalu bertanya: \"Siapa ini?\" aku menjawab, \"Aku Ummu Hani', \" aku lalu berkata, \"Wahai Rasulullah, anak laki-laki dari ibuku mengaku telah membunuh seseorang yang aku berikan perlindungan kepadanya, Fulan Ibnu Hubairah?\" Rasulullah shallallahu 'alaihi wasallam kemudian menjawab: \"Kami telah memberikan perlindungan kepada siapa yang kamu beri perlindungan wahai Ummu Hani'.\" maka ketika Rasulullah shallallahu 'alaihi wasallam selesai dari mandinya, beliau berdiri dan melaksanakan sholat delapan rakaat dengan berselimutkan pakaian.\""
            },
            {
                "number": 4164,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنِ ابْنِ عَجْلَانَ عَنْ سَعِيدٍ عَنْ أَبِي مُرَّةَ مَوْلَى عَقِيلٍ عَنْ أُمِّ هَانِئٍ قَالَتْأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِأَعْلَى مَكَّةَ فَلَمْ أَجِدْهُ وَوَجَدْتُ فَاطِمَةَ فَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ أَثَرُ الْغُبَارِ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي قَدْ أَجَرْتُ حَمْوَيْنِ لِي وَزَعَمَ ابْنُ أُمِّي أَنَّهُ قَاتِلُهُمَا قَالَ قَدْ أَجَرْنَا مَنْ أَجَرْتِ وَوُضِعَ لَهُ غُسْلٌ فِي جَفْنَةٍ فَلَقَدْ رَأَيْتُ أَثَرَ الْعَجِينِ فِيهَا فَتَوَضَّأَ أَوْ قَالَ اغْتَسَلَ أَنَا أَشُكُّ وَصَلَّى الْفَجْرَ فِي ثَوْبٍ مُشْتَمِلًا بِهِ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Ibnu Ajlan] dari [Sa'id] dari [Abu Murrah] bekas budak Aqil, dari [Ummu Hani'] dia berkata, \"Aku menemui Rasulullah shallallahu 'alaihi wasallam yang saat itu berada di ujung kota Makkah, aku pun tidak menemukan beliau dan hanya menemukan Fatimah. Rasulullah shallallahu 'alaihi wasallam lalu datang dengan bekas debu, lantas aku berkata, \"Wahai Rasulullah, sesungguhnya aku telah menanggung kedua saudara iparku, sedangkan anak laki-laki dari ibuku mengaku akan membunuh keduanya?\" Beliau pun bersabda: \"Sungguh, aku telah menjamin siapa saja yang kamu jamin.\" Kemudian beliau diberi air dalam bejana untuk mandi, dan sungguh aku melihat bekas adonan dalam bejana tersebut. Kemudian beliau berwudlu atau mandi -aku ragu-, kemudian beliau sholat fajar dengan berselimutkan kain.\""
            },
            {
                "number": 4165,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا مِسْعَرٌ عَنْ أَبِي الْعَلَاءِ الْعَبْدِيِّ عَنْ ابْنِ جَعْدَةَ بْنِ هُبَيْرَةَ عَنْ أُمِّ هَانِئٍ قَالَتْكُنْتُ أَسْمَعُ قِرَاءَةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا عَلَى عَرِيشِي",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Mis'ar] dari [Abu Al Ala' Al Abdi] dari [Abu Ja'dah bin Hubairah] dari [Ummu Hani'] dia berkata, \"Aku mendengar bacaan Nabi shallallahu 'alaihi wasallam, sedangkan aku berada di ruanganku.\""
            },
            {
                "number": 4166,
                "arab": "حَدَّثَنَا أَبُو أُسَامَةَ قَالَ أَخْبَرَنِي حَاتِمُ بْنُ أَبِي صَغِيرَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ أَبِي صَالِحٍ مَوْلَى أُمِّ هَانِئٍ عَنْ أُمِّ هَانِئٍ قَالَتْسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَوْلِهِ تَعَالَى{ وَتَأْتُونَ فِي نَادِيكُمْ الْمُنْكَرَ }قَالَ كَانُوا يَخْذِفُونَ أَهْلَ الطَّرِيقِ وَيَسْخَرُونَ مِنْهُمْ فَذَلِكَ الْمُنْكَرُ الَّذِي كَانُوا يَأْتُونَ",
                "id": "Telah menceritakan kepada kami [Abu Usamah] berkata, telah mengabarkan kepadaku [Hatim bin Abu Shaghirah] dari [Simak bin Harb] dari [Abu Shalih] bekas budak Ummu Hani', dari [Ummu Hani'] dia berkata, \"Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai firman-Nya: '(menyamun dan mengerjakan kemungkaran di tempat-tempat pertemuanmu?) ' (Qs. Al Ankabuut: 29), beliau bersabda: \"Mereka mencela orang-orang yang berjalan dan mengejeknya, itulah kemungkaran yang mereka perbuat.\""
            },
            {
                "number": 4167,
                "arab": "حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى قَالَ حَدَّثَنَا أَبُو يُونُسَ الْقُشَيْرِيُّ حَاتِمُ بْنُ أَبِي صَغِيرَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ أَبِي صَالِحٍ عَنْ أُمِّ هَانِئٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا يَوْمَ الْفَتْحِ فَأَتَتْهُ بِشَرَابٍ فَشَرِبَ مِنْهُ ثُمَّ فَضُلَتْ مِنْهُ فَضْلَةً فَنَاوَلَهَا فَشَرِبَتْهُ ثُمَّ قَالَتْ يَا رَسُولَ اللَّهِ لَقَدْ فَعَلْتُ شَيْئًا مَا أَدْرِي يُوَافِقُكَ أَمْ لَا قَالَ وَمَا ذَاكَ يَا أُمَّ هَانِئٍ قَالَتْ كُنْتُ صَائِمَةً فَكَرِهْتُ أَنْ أَرُدَّ فَضْلَكَ فَشَرِبْتُهُ قَالَ تَطَوُّعًا أَوْ فَرِيضَةً قَالَتْ قُلْتُ بَلْ تَطَوُّعًا قَالَ فَإِنَّ الصَّائِمَ الْمُتَطَوِّعَ بِالْخِيَارِ إِنْ شَاءَ صَامَ وَإِنْ شَاءَ أَفْطَرَ",
                "id": "Telah menceritakan kepada kami [Shafwan bin Isa] berkata, telah menceritakan kepada kami [Abu Yunus Al Qusyairi Hatim bin Abu Shaghirah] dari [Simak bin Harb] dari [Abu Shalih] dari [Ummu Hani'] bahwa Nabi shallallahu 'alaihi wasallam menemuinya pada waktu penaklukan kota Makkah, Ummu Hani' lalu menyuguhkan air minum untuk beliau dan beliau pun meminumnya. Kemudian beliau memberikan sisanya kepada Ummu Hani', dan ia pun meminumnya. Setelah itu ia berkata, \"Wahai Rasulullah, sesungguhnya aku telah melakukan tindakan yang aku sendiri tidak tahu apakah tuan menyetujuinya atau tidak?\" Beliau balik bertanya: \"Apa itu wahai Ummu Hani`?\" Ummu Hani' menjawab, \"Sebetulnya aku sedang berpuasa, akan tetapi aku tidak suka jika aku mengembalikan sisa (minuman) tuan, oleh karenanya aku meminumnya.\" Beliau bersabda: \"Apakah kamu puasa sunnah ataukah wajib?\" Ummu Hani' berkata, \"Aku menjawab, \"Puasa sunnah.\" Beliau bersabda: \"Sesungguhnya orang yang puasa sunnah boleh menentukan dua pilihan, jika ia berkehendak maka boleh berpuasa dan jika berkehendak dia boleh berbuka.\""
            },
            {
                "number": 4168,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا زُهَيْرٌ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ بْنِ خُثَيْمٍ قَالَ حَدَّثَنِي يُوسُفُ بْنُ مَاهَكَ أَنَّهُدَخَلَ عَلَى أُمِّ هَانِئٍ بِنْتِ أَبِي طَالِبٍ فَسَأَلَهَا عَنْ مَدْخَلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْفَتْحِ فَسَأَلَهَا هَلْ صَلَّى عِنْدَكِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ دَخَلَ فِي الضُّحَى فَسَكَبْتُ لَهُ فِي صَحْفَةٍ لَنَا مَاءً إِنِّي لَأَرَى فِيهَا وَضَرَ الْعَجِينِ قَالَ يُوسُفُ مَا أَدْرِي أَيَّ ذَلِكَ أَخْبَرَتْنِي أَتَوَضَّأَ أَمْ اغْتَسَلَ ثُمَّ رَكَعَ فِي هَذَا الْمَسْجِدِ مَسْجِدٍ فِي بَيْتِهَا أَرْبَعَ رَكَعَاتٍقَالَ يُوسُفُ فَقُمْتُ فَتَوَضَّأْتُ مِنْ قِرْبَةٍ لَهَا وَصَلَّيْتُ فِي ذَاكَ الْمَسْجِدِ أَرْبَعَ رَكَعَاتٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Adam] berkata, telah menceritakan kepada kami [Zuhair] dari [Abdullah bin Utsman bin Hutsaim] berkata, telah menceritakan kepadaku [Yusuf bin Mahak] bahwa dia menemui [Ummu Hani' binti Abu Thalib] dan bertanya perihal masuknya Rasulullah shallallahu 'alaihi wasallam pada waktu penaklukan kota Makkah.\" Yusuf tanyakan, \"Apakah Nabi shallallahu 'alaihi wasallam sholat di sisimu?\" Ummu Hani` lalu menjawab, \"Beliau masuk (Makkah) pada waktu Dluha, kemudian aku menuangkan air ke dalam bejana untuk beliau. Sungguh, aku melihat di dalamnya ada bekas adonan -Yusuf berkata; aku tidak tahu apakah Ummu Hani' mengabarkan kepadaku bahwa Nabi hanya sekedar wudlu ataukah mandi-, kemudian beliau mendirikan sholat empat rakaat di dalam masjid ini, yaitu masjid yang ada di dalam rumahnya.\" Yusuf berkata, \"Kemudian aku bangun dan berwudlu dari bejana miliknya (Ummu Hani`), lalu aku sholat empat rakaat di masjid tersebut.\""
            },
            {
                "number": 4169,
                "arab": "حَدَّثَنَا حَسَنٌ قَالَ حَدَّثَنَا ابْنُ لَهِيعَةَ قَالَ حَدَّثَنَا أَبُو الْأَسْوَدِ مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ أَنَّهُ سَمِعَ دُرَّةَ بِنْتَ مُعَاذٍ تُحَدِّثُ عَنْ أُمِّ هَانِئٍ أَنَّهَاسَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَتَزَاوَرُ إِذَا مِتْنَا وَيَرَى بَعْضُنَا بَعْضًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَكُونُ النَّسَمُ طَيْرًا تَعْلُقُ بِالشَّجَرِ حَتَّى إِذَا كَانُوا يَوْمَ الْقِيَامَةِ دَخَلَتْ كُلُّ نَفْسٍ فِي جَسَدِهَا",
                "id": "Telah menceritakan kepada kami [Hasan] berkata, telah menceritakan kepada kami [Ibnu Lahi'ah] berkata, telah menceritakan kepada kami [Abu Al Aswad Muhammad bin Abdurrahman bin Naufal] bahwa dia mendengar [Durrah binti Mu'adz] menceritakan dari [Ummu Hani'], bahwa dia bertanya kepada Rasulullah shallallahu 'alaihi wasallam, apakah ketika sudah meninggal kita bisa saling mengunjungi dan melihat satu sama yang lain? Kemudian Rasulullah shallallahu 'alaihi wasallam menjawab: \"Suatu saat nanti ruh akan menjadi burung yang menggantung di pohon sehingga apabila Kiamat tiba, maka tiap jiwa akan masuk kembali ke jasadnya.\""
            },
            {
                "number": 4170,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنِ ابْنِ أَبِي نَجِيحٍ عَنْ مُجَاهِدٍ عَنْ أُمِّ هَانِئٍ قَالَتْقَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَكَّةَ مَرَّةً وَلَهُ أَرْبَعُ غَدَائِرَ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Najih] dari [Mujahid] dari [Ummu Hani'] dia berkata, \"Suatu saat Nabi shallallahu 'alaihi wasallam datang ke Makkah, sedangkan beliau saat itu menawan empat pendusta.\""
            },
            {
                "number": 4171,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ نَافِعٍ قَالَ سَمِعْتُ ابْنَ أَبِي نَجِيحٍ يَذْكُرُ عَنْ مُجَاهِدٍ عَنْ أُمِّ هَانِئٍ قَالَتْرَأَيْتُ فِي رَأْسِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَفَائِرَ أَرْبَعًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Abu Bukair] berkata, telah menceritakan kepada kami [Ibrahim bin Nafi'] berkata, aku mendengar [Ibnu Abu Najih] menyebutkan dari [Mujahid] dari [Ummu Hani'] dia berkata, \"Aku melihat di kepala Rasulullah shallallahu 'alaihi wasallam terdapat empat jalinan rambut.\""
            },
            {
                "number": 4172,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ حَدَّثَنَا مَالِكٌ عَنْ مُوسَى بْنِ مَيْسَرَةَ عَنْ أَبِي مُرَّةَ أَنَّهُ سَمِعَ أُمَّ هَانِئٍ تَقُولُصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَنْزِلِي ثَمَانِيَ رَكَعَاتٍ فِي ثَوْبٍ وَاحِدٍ مُلْتَحِفًا بِهِ",
                "id": "Telah menceritakan kepada kami [Ustman bin Umar] berkata, telah menceritakan kepada kami [Malik] dari [Musa bin Maisarah] dari [Abu Murrah] bahwa dia mendengar [Ummu Hani'] berkata, \"Rasulullah shallallahu 'alaihi wasallam mendirikan sholat delapan rakaat di rumahku dengan berselimutkan satu kain.\""
            },
            {
                "number": 4173,
                "arab": "حَدَّثَنَا هُشَيْمٌ عَنْ أَبِي بِشْرٍ عَنْ أَبِي الْمَلِيحِ بْنِ أُسَامَةَ قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ عُتْبَةَ بْنِ أَبِي سُفْيَانَ حَدَّثَتْنِي عَمَّتِي أُمُّ حَبِيبَةَ بِنْتُ أَبِي سُفْيَانَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا كَانَ عِنْدَهَا فِي يَوْمِهَا أَوْ لَيْلَتِهَا فَسَمِعَ الْمُؤَذِّنَ قَالَ كَمَا يَقُولُ الْمُؤَذِّنُ",
                "id": "Telah menceritakan kepada kami [Husyaim] dari [Abu Bisyr] dari [Abu Al Malih bin Usamah] berkata, telah menceritakan kepadaku [Abdullah bin Utbah bin Abu Sufyan] telah menceritakan kepadaku bibiku [Ummu Habibah binti Abu Sufyan] bahwa Rasulullah shallallahu 'alaihi wasallam apabila berada di sisinya baik di siang atau malam pada hari gilirannya, bila mendengar suara Mu'adzin maka beliau mengucapkan apa yang diucapkan Mu'adzin.\""
            },
            {
                "number": 4174,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو قَالَ سَمِعْتُ سَالِمَ بْنَ شَوَّالٍ يَقُولُ عَنْ أُمِّ حَبِيبَةَ قَالَتْكُنَّا نُغَلِّسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ جَمْعٍ إِلَى مِنًى وَقَالَ سَمُرَةُ كُنَّا نُغَلِّسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمُزْدَلِفَةِ إِلَى مِنًى",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Amru] berkata; aku mendengar [Salim bin Syawwal] berkata dari [Ummu Habibah] dia berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam kami berpagi-pagi meninggalkan Jam' (nama tempat) menuju Mina.\" Dan Samurah berkata, \"Pada masa Rasulullah shallallahu 'alaihi wasallam kami berpagi-pagi bertolak dari Muzdalifah menuju Mina.\""
            },
            {
                "number": 4175,
                "arab": "حَدَّثَنَا عُبَيْدَةُ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنْ سَالِمٍ عَنْ أَبِي الْجَرَّاحِ عَنْ أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَصْحَبُ الْمَلَائِكَةُ رُفْقَةً فِيهَا جَرَسٌ",
                "id": "Telah menceritakan kepada kami [Ubaidah] berkata, telah menceritakan kepada kami [ubaidhullah] dari [Nafi'] dari [Salim] dari [Abu Al Jarrah] dari [Ummu Habibah] isteri Nabi shallallahu 'alaihi wasallam, dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Para Malaikat tidak akan menyertai rombongan yang di dalamnya ada lonceng.\""
            },
            {
                "number": 4176,
                "arab": "حَدَّثَنَا يَحْيَى عَنِ ابْنِ أَبِي ذِئْبٍ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي سُفْيَانَ بْنِ سَعِيدٍ عَنْ أُمِّ حَبِيبَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّئُوا مِمَّا مَسَّتْ النَّارُ",
                "id": "Telah menceritakan kepada kami [Yahya] dari [Ibnu Abu Dzi'b] berkata, telah menceritakan kepadaku [Az Zuhri] dari [Abu Salamah] dari [Abu Sufyan bin Sa'id] dari [Ummu Habibah] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Berwudlulah dari sesuatu yang disentuh oleh Api.\""
            },
            {
                "number": 4177,
                "arab": "حَدَّثَنَا يَحْيَى عَنْ عُبَيْدِ اللَّهِ قَالَ أَخْبَرَنِي نَافِعٌ عَنْ سَالِمٍ عَنْ أَبِي الْجَرَّاحِ عَنْ أُمِّ حَبِيبَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَصْحَبُ الْمَلَائِكَةُ رُفْقَةً فِيهَا جَرَسٌ",
                "id": "Telah menceritakan kepada kami [Yahya] dari [ubaidhullah] berkata, telah mengabarkan kepadaku [Nafi'] dari [Salim] dari [Abu Al Jarrah] dari [Ummu Habibah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Para Malaikat tidak akan menyertai suatu rombongan yang di dalamnya ada lonceng.\""
            },
            {
                "number": 4178,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلَّادٍ قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ قَالَ حَدَّثَ سُفْيَانُ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَصْحَبُ الْمَلَائِكَةُ رُفْقَةً فِيهَا جَرَسٌقَالَ فَقُلْتُ لَهُ تَعِسْتَ يَا أَبَا عَبْدِ اللَّهِ قَالَ لِي كَيْفَ هُوَ قُلْتُ حَدَّثَنِي عُبَيْدُ اللَّهِ قَالَ حَدَّثَنِي نَافِعٌ عَنْ سَالِمٍ عَنْ أَبِي الْجَرَّاحِ عَنْ أُمِّ حَبِيبَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَدَقْتَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Khallad] berkata, aku mendengar [Yahya bin Sa'id] berkata, Sufyan telah menceritakan dari ['ubaidhullah bin 'Umar] dari [Nafi'] dari Ibnu Umar dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Malaikat tidak akan menyertai perkumpulan yang di dalamnya terdapat lonceng.\" Nafi' lalu berkata, \"Aku lalu berkata kepadanya, \"Celaka kamu wahai Abu Abdullah.\" Kemudian dia ganti bertanya kepadaku, \"Terus bagaimana (yang benar)?\" Aku lalu menyebutkan, \"Telah menceritakan kepada kami ['ubaidhullah] dia berkata, telah menceritakan kepadaku [Nafi'] dari [Salim] dari [Abu Al Jarrah] dari [Ummu Habibah] dari Nabi shallallahu 'alaihi wasallam.\" Lalu Abdullah bin Umar berkata, \"Kamu benar.\""
            },
            {
                "number": 4179,
                "arab": "حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِيُّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الشُّعَيْثِيُّ وَيَزِيدُ قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الشُّعَيْثِيُّ عَنْ أَبِيهِ عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ عَنْ أُخْتِهِ أُمِّ حَبِيبَةَ قَالَ يَزِيدُ بِنْتِ أَبِي سُفْيَانَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ الْمُقْرِيُّ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَاسَمِعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ صَلَّى أَرْبَعَ رَكَعَاتٍ قَبْلَ الظُّهْرِ وَأَرْبَعًا بَعْدَهَا حَرَّمَ اللَّهُ عَلَيْهِ النَّارَ",
                "id": "Telah menceritakan kepada kami [Abu Abdurrahman Al Muqri] berkata, telah menceritakan kepada kami [Muhammad bin Abdullah Asy Syu'aitsi], dan [Yazid] berkata; telah mengabarkan kepada kami [Muhammad bin Abdullah Asy Syu'aitsi] dari [ayahnya] dari [Anbasah bin Abu Sufyan] dari sudara perempuannya [Ummu Habibah], [Yazid] berkata; (Ummu Habibah adalah) [Binti Abu Sufyan] dari Nabi shallallahu 'alaihi wasallam, dan [Al Muqri] berkata, (Ummu Habibah) adalah [isteri Nabi] shallallahu 'alaihi wasallam, bahwa dia telah mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa melaksanakan sholat empat rakaat sebelum zhuhur dan empat rakaat setelahnya, maka Allah akan mengharamkan Neraka kepadanya.\""
            },
            {
                "number": 4180,
                "arab": "حَدَّثَنَا حَجَّاجٌ وَشُعَيْبُ بْنُ حَرْبٍ قَالَا حَدَّثَنَا لَيْثٌ قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ سُوَيْدِ بْنِ قَيْسٍ عَنْ مُعَاوِيَةَ بْنِ حُدَيْجٍ عَنْ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ أَنَّهُسَأَلَ أُخْتَهُ أُمَّ حَبِيبَةَ زَوْجَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي الثَّوْبِ الْوَاحِدِ الَّذِي يُجَامِعُهَا فِيهِ قَالَتْ نَعَمْ إِذَا لَمْ يَكُنْ فِيهِ أَذًى",
                "id": "Telah menceritakan kepada kami [Hajjaj] dan [Syua'ib bin Harb] keduanya berkata, telah menceritakan kepada kami [Laits] berkata, telah menceritakan kepadaku [Yazid bin Abu Habib] dari [Suwaid bin Qais] dari [Mu'awiyah bin Hudaij] dari [Mu'awiyah bin Abu Sufyan] bahwa dia bertanya kepada saudara perempuannya [Ummu Habibah] isteri Nabi shallallahu 'alaihi wasallam, apakah Rasulullah shallallahu 'alaihi wasallam pernah sholat dengan menggunakan satu pakaian yang dipakainya untuk bersetubuh?\" Dia menjawab, \"Ya, jika tidak terdapat kotoran padanya.\""
            },
            {
                "number": 4181,
                "arab": "حَدَّثَنَا يَحْيَى عَنِ ابْنِ جُرَيْجٍ وَرَوْحٌ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ وَمُحَمَّدُ بْنُ بَكْرٍ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عَطَاءٌ أَنَّهُ أَخْبَرَهُ ابْنُ شَوَّالٍ أَنَّهُدَخَلَ عَلَى أُمِّ حَبِيبَةَ بِنْتِ أَبِي سُفْيَانَ فَأَخْبَرَتْهُ أَنَّهَا بَعَثَ وَقَالَ ابْنُ بَكْرٍ أَنَّهُ بَعَثَ بِهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ جَمْعٍ بِلَيْلٍ وَقَالَ يَحْيَى قَدَّمَهَا مِنْ جَمْعٍ بِلَيْلٍ",
                "id": "Telah menceritakan kepada kami [Yahya] dari [Ibnu Juraij] dan [Rauh] berkata, telah menceritakan kepada kami [Ibnu Juraij] dan [Muhammad bin Bakr] berkata, telah menceritakan kepada kami [Ibnu Juraij] berkata, telah mengabarkan kepadaku [Atha'] bahwa [Ibnu Syawal] telah mengabarkan kepadanya, bahwa dia menemui [Ummu Habibah binti Abu Sufyan], lalu Ummu Habibah mengabarkan kepadanya bahwa dia berangkat, sedangkan [Ibnu Bakr] menyebutkan, bahwa Nabi shallallahu 'alaihi wasallam berangkat menuju Mina dari Jam' semenjak malam hari.\" Dan [Yahya] menyebutkan bahwa beliau berangkat menuju Mina dari Jam' sejak malam.\""
            },
            {
                "number": 4182,
                "arab": "حَدَّثَنَا حَسَنٌ قَالَ حَدَّثَنَا ابْنُ لَهِيعَةَ قَالَ حَدَّثَنَا دَرَّاجٌ عَنْ عُمَرَ بْنِ الْحَكَمِ أَنَّهُ حَدَّثَهُ عَنْ أُمِّ حَبِيبَةَ بِنْتِ أَبِي سُفْيَانَأَنَّ أُنَاسًا مِنْ أَهْلِ الْيَمَنِ قَدِمُوا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْلَمَهُمْ الصَّلَاةَ وَالسُّنَنَ وَالْفَرَائِضَ ثُمَّ قَالُوا يَا رَسُولَ اللَّهِ إِنَّ لَنَا شَرَابًا نَصْنَعُهُ مِنْ الْقَمْحِ وَالشَّعِيرِ قَالَ فَقَالَ الْغُبَيْرَاءُ قَالُوا نَعَمْ قَالَ لَا تَطْعَمُوهُ ثُمَّ لَمَّا كَانَ بَعْدَ ذَلِكَ بِيَوْمَيْنِ ذَكَرُوهُمَا لَهُ أَيْضًا فَقَالَ الْغُبَيْرَاءُ قَالُوا نَعَمْ قَالَ لَا تَطْعَمُوهُ ثُمَّ لَمَّا أَرَادُوا أَنْ يَنْطَلِقُوا سَأَلُوهُ عَنْهُ فَقَالَ الْغُبَيْرَاءُ قَالُوا نَعَمْ قَالَ لَا تَطْعَمُوهُ قَالُوا فَإِنَّهُمْ لَا يَدَعُونَهَا قَالَ مَنْ لَمْ يَتْرُكْهَا فَاضْرِبُوا عُنُقَهُ",
                "id": "Telah menceritakan kepada kami [Hasan] dia berkata, telah menceritakan kepada kami [Ibnu Lahi'ah] berkata, telah menceritakan kepada kami [Darraj] dari [Umar bin Hakam] bahwa dia telah menceritakan kepadanya dari [Ummu Habibah binti Abu Sufyan], bahwa orang-orang dari penduduk Yaman datang kepada Rasulullah shallallahu 'alaihi wasallam, kemudian beliau mengajarkan kepada mereka tentang sholat, sunnah-sunnah dan kewajiban-kewajiban. Mereka kemudian berkata, \"Wahai Rasulullah, sesungguhnya kami memiliki minuman yang terbuat dari gandum dan tepung?\" Beliau balik bertanya: \"Al Ghubaira'?\" mereka menjawab, \"Ya.\" Nabi lalu bersabda: \"Jangan kalian mengkonsumsinya.\" Dua hari setelah itu mereka menanyakan hal itu lagi kepada beliau, maka beliau pun bertanya: \"Al Ghubaira'?\" mereka menjawab, \"Ya.\" Lantas beliau bersabda: \"Jangan kalian mengkonsumsinya.\" Hingga ketika mereka hendak pergi, mereka masih bertanya tentang minuman itu kepada beliau, dan beliau bertanya lagi: \"Al Ghubaira'?\" mereka menjawab, \"Ya.\" Nabi pun bersabda: \"Jangan kalian mengkonsumsinya.\" Kemudian para sahabat berkomentar, \"Sungguh, mereka adalah suatu kaum yang susah untuk meninggalkannya.\" Maka beliau pun bersabda: \"Barangsiapa tidak meninggalkannya maka potonglah lehernya.\""
            },
            {
                "number": 4183,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ عَنْ حَبِيبَةَ بِنْتِ أُمِّ حَبِيبَةَ بِنْتِ أَبِي سُفْيَانَ عَنْ أُمِّهَا أُمِّ حَبِيبَةَ عَنْ زَيْنَبَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سُفْيَانُ أَرْبَعُ نِسْوَةٍ قَالَتِاسْتَيْقَظَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ نَوْمٍ وَهُوَ مُحْمَرٌّ وَجْهُهُ وَهُوَ يَقُولُ لَا إِلَهَ إِلَّا اللَّهُ وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدْ اقْتَرَبَ فُتِحَ الْيَوْمَ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذِهِ وَحَلَّقَ قُلْتُ يَا رَسُولَ اللَّهِ أَنَهْلِكُ وَفِينَا الصَّالِحُونَ قَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَمْ إِذَا كَثُرَ الْخَبَثُ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Urwah] dari [Zainab binti Abu Salamah] dari [Habibah binti Ummu Habibah biti Abu Sufyan] dari ibunya [Ummu Habibah] dari [Zainab] isteri Nabi shallallahu 'alaihi wasallam, Sufyan menyebutkan, \"Empat orang wanita.\" Ia (isteri Nabi) Berkata, \"Nabi shallallahu 'alaihi wasallam bangun dari tidurnya dengan wajah merah sambil bersabda: \"LAA ILAAHA ILLALLAAH (Tidak ada tuhan yang berhak untuk disembah selain Allah), celakalah orang-orang arab dari keburukan yang telah dekat, hari ini telah dibukakan pemisah antara Ya'juj dan Ma'juj seperti ini, \" kemudian Nabi membuat lingkaran, maka aku bertanya, \"Wahai Rasulullah, apakah kita akan dibinasakan padahal ada orang-orang shalih di tengah-tengah kita?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Ya, apabila kerusakan sudah merajalela.\""
            },
            {
                "number": 4184,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنْ صَالِحٍ يَعْنِي ابْنَ كَيْسَانَ قَالَ ابْنُ شِهَابٍ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ أَنَّ زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ أَخْبَرَتْ عَنْ أُمِّ حَبِيبَةَ بِنْتِ أَبِي سُفْيَانَ عَنْ زَيْنَبَ بِنْتِ جَحْشٍ قَالَتْإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا فَزِعًا يَقُولُ لَا إِلَهَ إِلَّا اللَّهُ وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدْ اقْتَرَبَ فُتِحَ الْيَوْمَ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ هَذَا قَالَ وَحَلَّقَ بِأُصْبُعَيْهِ الْإِبْهَامِ وَالَّتِي تَلِيهَا قَالَتْ زَيْنَبُ بِنْتُ جَحْشٍ فَقُلْتُ يَا رَسُولَ اللَّهِ أَنَهْلِكُ وَفِينَا الصَّالِحُونَ قَالَ نَعَمْ إِذَا كَثُرَ الْخَبَثُ",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [ayahku] dari [Shalih] -yakni Ibnu Kaisan-, [Ibnu Syihab] berkata, telah menceritakan kepadaku [Urwah bin Zubair] bahwa [Zainab binti Abu Salamah] mengabarkan dari [Ummu Habibah binti Abu Sufyan] dari [Zainab binti Jahsy] dia berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam menemuinya dalam keadaan terkejut seraya bersabda: \"LAA ILAAHA ILLALLAAH (Tidak ada tuhan yang berhak untuk disembah selain Allah), celakalah orang-orang arab dari keburukan yang telah dekat, hari ini telah dibukakan pemisah antara Ya'juj dan Ma'juj seperti ini, \" dia berkata, kemudian beliau melingkarkan kedua jarinya, yaitu ibu jari dengan jari telunjuk.\" Zainab binti Jahsy berkata, \"Lalu aku pun bertanya, \"Wahai Rasulullah, apakah kita akan dibinasakan padahal ada orang-orang shalih di tengah-tengah kita?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Ya, apabila kerusakan sudah merajalela.\""
            },
            {
                "number": 4185,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ حَدَّثَنِي مُحَمَّدُ بْنُ طَلْحَةَ بْنِ يَزِيدَ بْنِ رُكَانَةَ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِي الْجَرَّاحِ مَوْلَى أُمِّ حَبِيبَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أُمِّ حَبِيبَةَ أَنَّهَا حَدَّثَتْهُ عَنْ زَيْنَبَ بِنْتِ جَحْشٍ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَمَرْتُهُمْ بِالسِّوَاكِ عِنْدَ كُلِّ صَلَاةٍ كَمَا يَتَوَضَّئُونَ",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [ayahku] dari [Ibnu Ishaq] telah menceritakan kepadaku [Muhammad bin Thalhah bin Yazid bin Rukanah] dari [Salim bin Abdullah bin Umar] dari [Abu Al Jarrah] bekas budak Ummu Habibah, isteri Nabi shallallahu 'alaihi wasallam, dari [Ummu Habibah] bahwa dia menceritakan kepadanya dari [Zainab binti Jahsy] dia berkata, \"Aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seandainya tidak memberatkan terhadap ummatku pasti aku perintahkan kepada mereka untuk bersiwak pada setiap waktu sholat sebagaimana mereka melakukan wudlu.\""
            },
            {
                "number": 4186,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ ذَكَرَ ابْنُ شِهَابٍ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ عَنْ أُمِّ حَبِيبَةَ بِنْتِ أَبِي سُفْيَانَ عَنْ زَيْنَبَ بِنْتِ جَحْشٍ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَاقِدٌ بِأُصْبُعَيْهِ السَّبَّابَةِ بِالْإِبْهَامِ وَهُوَ يَقُولُ وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدْ اقْتَرَبَ فُتِحَ الْيَوْمَ مِنْ رَدْمِ يَأْجُوجَ وَمَأْجُوجَ مِثْلُ مَوْضِعِ الدِّرْهَمِ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ أَنَهْلِكُ وَفِينَا الصَّالِحُونَ قَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعَمْ إِذَا كَثُرَ الْخَبَثُ",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [ayahku] dari [Ibnu Ishaq] berkata, [Ibnu Syihab] menyebutkan dari [Urwah bin Zubair] dari [Zainab binti Abu Salamah] dari [Ummu Habibah binti Abu Sufyan] dari [Zainab binti Jahsy] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam menemuiku sedangkan beliau melingkarkan kedua jarinya, yaitu jari telunjuk dengan ibu jari seraya bersabda: \"Celakalah orang-orang arab dari keburukan yang telah dekat, hari ini telah dibukakan pemisah antara Ya'juj dan Ma'juj seperti wadah mata uang perak, \" dia menyebutkan, \"Lantas aku bertanya, \"Wahai Rasulullah, apakah kita akan dibinasakan padahal ada orang-orang shalih di tengah-tengah kita?\" beliau shallallahu 'alaihi wasallam menjawab: \"Ya, apabila kerusakan sudah merajalela.\""
            },
            {
                "number": 4187,
                "arab": "حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ الْعَمِّيُّ أَبُو عَبْدِ الصَّمَدِ حَدَّثَنَا مَنْصُورٌ عَنْ مُجَاهِدٍ عَنْ مَوْلًى لِابْنِ الزُّبَيْرِ يُقَالُ لَهُ يُوسُفُ بْنُ الزُّبَيْرِ أَوْ الزُّبَيْرُ بْنُ يُوسُفَ عَنِ ابْنِ الزُّبَيْرِ عَنْ سَوْدَةَ بِنْتِ زَمْعَةَ قَالَتْجَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أَبِي شَيْخٌ كَبِيرٌ لَا يَسْتَطِيعُ أَنْ يَحُجَّ قَالَ أَرَأَيْتَكَ لَوْ كَانَ عَلَى أَبِيكَ دَيْنٌ فَقَضَيْتَهُ عَنْهُ قُبِلَ مِنْكَ قَالَ نَعَمْ قَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاللَّهُ أَرْحَمُ حُجَّ عَنْ أَبِيكَ",
                "id": "Telah menceritakan kepada kami [Abdul Aziz bin Abdus Shamad Al 'Amiy Abu Abdus Shamad] telah menceritakan kepada kami [Manshur] dari [Mujahid] dari budak milik Ibnu Zubair yang biasa disebut [Yusuf bin Zubair] atau Zubair bin Yusuf dari [Ibnu Zubair] dari [Saudah Binti Zam'ah] dia berkata, \"Seseorang datang kepada Rasulullah shallallahu 'alaihi wasallam kemudian dia berkata, \"Sesungguhnya bapakku adalah seorang yang sudah tua dan tidak mampu lagi untuk melaksanakan haji.\" Beliau menjawab: \"Apa pedapatmu sekiranya bapakmu mempunyai hutang, apakah kamu akan melunasinya?\" dia menjawab, \"Ya.\" Kemudian beliau shallallahu 'alaihi wasallam bersabda: \"Allah lebih penyayang, maka lakukanlah haji untuk bapakmu.\""
            },
            {
                "number": 4188,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ إِسْمَاعِيلَ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ عَنْ سَوْدَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْمَاتَتْ شَاةٌ لَنَا فَدَبَغْنَا مَسْكَهَا فَمَا زِلْنَا نَنْبِذُ بِهِ حَتَّى صَارَ شَنًّا",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] dari [Isma'il] dari [Ikrimah] dari [Ibnu Abbas] dari [Saudah] isteri Nabi shallallahu 'alaihi wasallam, dia berkata, \"Seekor kambing milik kami mati kemudian kulitnya kami samak, dan kami terus saja mengerjakannya hingga menjadi geribah (wadah air dari kulit).\""
            },
            {
                "number": 4189,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا إِسْرَائِيلُ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ مَوْلًى لِآلِ الزُّبَيْرِ قَالَإِنَّ بِنْتَ زَمْعَةَ قَالَتْ أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنَّ أَبِي زَمْعَةَ مَاتَ وَتَرَكَ أُمَّ وَلَدٍ لَهُ وَإِنَّا كُنَّا نَظُنُّهَا بِرَجُلٍ وَإِنَّهَا وَلَدَتْ فَخَرَجَ وَلَدُهَا يُشْبِهُ الرَّجُلَ الَّذِي ظَنَنَّاهَا بِهِ قَالَ فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهَا أَمَّا أَنْتِ فَاحْتَجِبِي مِنْهُ فَلَيْسَ بِأَخِيكِ وَلَهُ الْمِيرَاثُ",
                "id": "Telah menceritakan kepada kami [Aswad bin Amir] telah meceritakan kepada kami [Isra'il] dari [Manshur] dari [Mujahid] dari [seorang budak] milik keluarga Zubair, dia berkata bahwa [anak perempuan Zam'ah] berkata, \"Aku menemui Rasulullah shallallahu 'alaihi wasallam, kemudian aku berkata, \"Sesungguhnya ayahku, Zam'ah, telah wafat dan meninggalkan Ummu Walad. Dan kami mencurigai dia telah melakukan perselingkuhan dengan laki-laki lain hingga melahirkan seorang anak, yang juga mirip dengan lelaki selingkuhannya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam berkata kepada anak perempuan Zam'ah: \"Hendaklah kamu berhijab darinya, ia bukan saudaramu, namun ia masih mempunyai hak waris.\" "
            },
            {
                "number": 4190,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ بْنِ السَّبَّاقِ عَنْ جُوَيْرِيَةَ بِنْتِ الْحَارِثِ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ فَقَالَ هَلْ مِنْ طَعَامٍ قُلْتُ لَا إِلَّا عَظْمًا أُعْطِيَتْهُ مَوْلَاةٌ لَنَا مِنْ الصَّدَقَةِ قَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرِّبِيهِ فَقَدْ بَلَغَتْ مَحِلَّهَا",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari [Ubaid bin Sabaq] dari [Juwairiyah binti Al Harits] dia berkata, \"Pada suatu hari Rasulullah shallallahu 'alaihi wasallam datang kepadaku lantas bertanya \"Apakah ada makanan?\" Aku menjawab, \"Tidak, kecuali tulang pemberian budak kita dari harta sedekah.\" Beliau kemudian bersabda: \"Dekatkanlah kepadaku karena dia telah sampai kepada tempatnya.\""
            },
            {
                "number": 4191,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ مَوْلَى آلِ طَلْحَةَ قَالَ سَمِعْتُ كُرَيْبًا يُحَدِّثُ عَنِ ابْنِ عَبَّاسٍ عَنْ جُوَيْرِيَةَ قَالَتْإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ عَلَى جُوَيْرِيَةَ بَكَرًا وَهِيَ فِي الْمَسْجِدِ تَدْعُو ثُمَّ مَرَّ عَلَيْهَا قَرِيبًا مِنْ نِصْفِ النَّهَارِ فَقَالَ مَا زِلْتِ عَلَى حَالِكِ قَالَتْ نَعَمْ قَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أُعَلِّمُكِ كَلِمَاتٍ تَعْدِلُهُنَّ بِهِنَّ وَلَوْ وُزِنَ بِهِنَّ وُزِنَ سُبْحَانَ اللَّهِ عَدَدَ خَلْقِهِ سُبْحَانَ اللَّهِ عَدَدَ خَلْقِهِ ثَلَاثًا سُبْحَانَ اللَّهِ رِضَا نَفْسِهِ سُبْحَانَ اللَّهِ رِضَا نَفْسِهِ سُبْحَانَ اللَّهِ رِضَا نَفْسِهِ سُبْحَانَ اللَّهِ زِنَةَ عَرْشِهِ سُبْحَانَ اللَّهِ زِنَةَ عَرْشِهِ سُبْحَانَ اللَّهِ زِنَةَ عَرْشِهِ سُبْحَانَ اللَّهِ مِدَادَ كَلِمَاتِهِ سُبْحَانَ اللَّهِ مِدَادَ كَلِمَاتِهِ سُبْحَانَ اللَّهِ مِدَادَ كَلِمَاتِهِ وَكَانَ اسْمُهَا بَرَّةَ فَسَمَّاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جُوَيْرِيَةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin Abdurrahman] bekas budak keluarga Thalhah, berkata; aku pernah mendengar [Kuraib] menceritakan dari [Ibnu Abbas] dari [Juwairiyah] dia berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam melewati Juwairiyah di pagi hari, ketika itu dia berada di masjid sedang berdo'a. Kemudian menjelang tengah hari beliau kembali melewatinya seraya bertanya: \"Apakah kamu masih pada posisimu?\" dia menjawab, \"Ya.\" Belaiu lalu bersabda: \"Maukah aku beritahukan kepadamu beberapa kalimat yang dapat menyamainya, yang seandainya ditimbang maka akan menyamainya, yaitu; SUBHAANALLAAH 'ADADA KHALQIHI, SUBHAANALLAAH 'ADADA KHALQIHI (Maha suci Allah sebanyak ciptaan-Nya, Maha suci Allah sebanyak ciptaan-Nya) tiga kali, SUBHAANALLAAH RIDLAA NAFSIHI, SUBHAANALLAAH RIDLAA NAFSIHI, SUBHAANALLAAH RIDLA NAFSIHI (Maha suci Allah sebagaimna Dia ridla terhadap diri-Nya) tiga kali, SUBHAANALLAAH ZINATA 'ARSYIHI, SUBHAANALLAAH ZINATA 'ARSYIHI, SUBHAANALLAAH ZINATA 'ARSYIHI (Maha suci Allah sebanyak hiasan yang ada di atas Arsy-Nya) tiga kali, SUBHAANALLAAH MIDAADA KALIMAATIHI, SUBHAANALLAAH MIDAADA KALIMAATIHI, SUBHAANALLAH MIDAADA KALIMAATIHI (Maha suci Allah sebanyak tinta kalimat-Nya) tiga kali.\" Dulu namanya adalah Barrah, kemudian Rasulullah shallallahu 'alaihi wasallam memberinya nama dengan Juwairiyah.\""
            },
            {
                "number": 4192,
                "arab": "حَدَّثَنَا مُحَمَّدٌ وَحَجَّاجٌ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَبِي أَيُّوبَ عَنْ جُوَيْرِيَةَ بِنْتِ الْحَارِثِ قَالَتْإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا فِي يَوْمِ جُمُعَةٍ وَهِيَ صَائِمَةٌ فَقَالَ لَهَا أَصُمْتِ أَمْسِ قَالَتْ لَا قَالَ أَفَتُرِيدِينَ أَنْ تَصُومِي غَدًا قَالَتْ لَا قَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَفْطِرِي إِذًا",
                "id": "Telah menceritakan kepada kami [Muhammad] dan [Hajjaj] keduanya berkata, telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Abu Ayyub] dari [Juwairiyah binti Al Harits] dia berkata, \"Sesungguhnya Nabi shallallahu 'alaihi wasallam pada hari Jum'at datang menemuinya, yang ketika itu dia sedang berpuasa. Beliau kemudian bertanya kepadanya: \"Apakah kamu kemarin berpuasa?\" dia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Apakah kamu besok mau berpuasa?\" dia menjawab, \"Tidak.\" Maka beliau pun bersabda: \"Berbukalah kamu.\""
            },
            {
                "number": 4193,
                "arab": "حَدَّثَنَا أَسْوَدُ يَعْنِي ابْنَ عَامِرٍ حَدَّثَنَا شَرِيكٌ عَنْ جَابِرٍ عَنْ خَالَتِهِ أُمِّ عُثْمَانَ عَنِ الطُّفَيْلِ ابْنِ أَخِي جُوَيْرِيَةَ عَنْ جُوَيْرِيَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَبِسَ ثَوْبَ حَرِيرٍ فِي الدُّنْيَا أَلْبَسَهُ اللَّهُ تَعَالَى ثَوْبَ مَذَلَّةٍ أَوْ ثَوْبًا مِنْ نَارٍ",
                "id": "Telah menceritakan kepada kami [Aswad] -yakni Ibnu Amir- telah menceritakan kepada kami [Syarik] dari [Jabir] dari bibinya [Ummu Utsman] dari [Thufail] anak laki-laki, dari saudaranya Juwairiyah dari [Juwairiyah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa mengenakan pakaian dari sutera di dunia, maka Allah Ta'ala akan memakaikan kepadanya pakaian kehinaan, atau pakaian dari api Neraka.\""
            },
            {
                "number": 4194,
                "arab": "حَدَّثَنَا عَاصِمٌ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ حَدَّثَنِي ابْنُ شِهَابٍ قَالَ إِنَّ عُبَيْدَ بْنَ السَّبَّاقِ يَزْعُمُ أَنَّ جُوَيْرِيَةَ زَوْجَ النَّبِىِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا فَقَالَ هَلْ مِنْ طَعَامٍ قَالَتْ لَا وَاللَّهِ مَا عِنْدَنَا طَعَامٌ إِلَّا عَظْمًا مِنْ شَاةٍ أُعْطِيَتْهَا مَوْلَاتِي مِنْ الصَّدَقَةِ فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرِّبِيهِ فَقَدْ بَلَغَتْ مَحِلَّهَا",
                "id": "Telah menceritakan kepada kami [Ashim] telah menceritakan kepada kami [Laits bin Sa'd] telah menceritakan kepadaku [Ibnu Syihab] berkata, bahwa [Ubaid bin Sabbaq] menyakini bahwa [Juwairiyah] isteri Nabi shallallahu 'alaihi wasallam telah mengabarkan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam pernah menemuinya, kemudian beliau bersabda: \"Apakah ada makanan?\" Juwairiyah menjawab, \"Kami tidak memiliki makanan, kecuali tulang kambing pemberian budakku dari harta sedekah.\" Beliau lantas bersabda: \"Dekatkanlah kepadaku karena dia telah sampai kepada tempatnya.\""
            },
            {
                "number": 4195,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ حَدَّثَنِى أَبُو أَيُّوبَ الْعَتَكِىُّ عَنْ جُوَيْرِيَةَ بِنْتِ الْحَارِثِ قَالَتْإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا يَوْمَ جُمُعَةٍ وَهِيَ صَائِمَةٌ فَقَالَ لَهَا أَصُمْتِ أَمْسِ قَالَتْ لَا قَالَ أَتُرِيدِينَ أَنْ تَصُومِي غَدًا قَالَتْ لَا قَالَ فَأَفْطِرِي",
                "id": "Telah menceritakan kepada kami [Affan] telah menceritakan kepada kami [Hammam] telah menceritakan kepada kami [Qatadah] telah menceritakan kepadaku [Abu Ayyub Al Ataki] dari [Juwairiyah binti Al Harits] dia berkata, \"Sesungguhnya Nabi shallallahu 'alaihi wasallam pernah menemuinya pada hari Jum'at, yang saat itu dia sedang berpuasa. Beliau lalu bertanya kepadanya: \"Apakah kemarin kamu berpuasa?\" dia menjawab, \"Tidak.\" Beliau bertanya lagi: \"Apakah kamu besok hendak berpuasa?\" dia menjawab, \"Tidak.\" Maka beliau pun bersabda: \"Berbukalah.\""
            },
            {
                "number": 4196,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ وَحَجَّاجٌ حَدَّثَنِي شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أُمِّ سُلَيْمٍ أَنَّهَاقَالَتْ يَا رَسُولَ اللَّهِ أَنَسٌ خَادِمُكَ ادْعُ اللَّهَ لَهُ قَالَ فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ أَكْثِرْ مَالَهُ وَوَلَدَهُ وَبَارِكْ لَهُ فِيمَا أَعْطَيْتَهُقَالَ حَجَّاجٌ فِي حَدِيثِهِ قَالَ فَقَالَ أَنَسٌ أَخْبَرَنِي بَعْضُ وَلَدِي أَنَّهُ قَدْ دُفِنَ مِنْ وَلَدِي وَوَلَدِ وَلَدِي أَكْثَرُ مِنْ مِائَةٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dan [Hajjaj] telah menceritakan kepadaku [Syu'bah] berkata, aku mendengar [Qatadah] telah menceritakan dari [Anas bin Malik] dari [Ummu Sulaim] bahwa dia berkata, \"Wahai Rasulullah, Anas pelayanmu, do'akanlah kepada Allah untuknya.\" Anas lalu berkata, \"Maka Nabi shallallahu 'alaihi wasallam pun berdo'a: \"Ya Allah, berilah dia harta dan anak yang banyak, dan berkahilah apa yang telah Engkau berikan padanya.\" Hajjaj menyebutkan dalam haditsnya, dia berkata, \"Anas lalu berkata, \"Sebagian anakku mengabarkan kepadaku, bahwa anak dan cucu-cucuku yang sudah dimakamkan lebih dari seratus.\""
            },
            {
                "number": 4197,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَرَوْحٌ الْمَعْنَى قَالَا حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ أَنَّهُكَانَ بَيْنَ ابْنِ عَبَّاسٍ وَزَيْدِ بْنِ ثَابِتٍ فِي الْمَرْأَةِ تَحِيضُ بَعْدَمَا تَطُوفُ بِالْبَيْتِ يَوْمَ النَّحْرِ مُقَاوَلَةٌ فِي ذَلِكَ فَقَالَ زَيْدٌ لَا تَنْفِرُ حَتَّى يَكُونَ آخِرُ عَهْدِهَا بِالْبَيْتِ وَقَالَ ابْنُ عَبَّاسٍ إِذَا طَافَتْ يَوْمَ النَّحْرِ وَحَلَّتْ لِزَوْجِهَا نَفَرَتْ إِنْ شَاءَتْ وَلَا تَنْتَظِرُ فَقَالَتْ الْأَنْصَارُ يَا ابْنَ عَبَّاسٍ إِنَّكَ إِذَا خَالَفْتَ زَيْدًا لَمْ نُتَابِعْكَ فَقَالَ ابْنُ عَبَّاسٍ سَلُوا أُمَّ سُلَيْمٍ فَسَأَلُوهَا عَنْ ذَلِكَ فَأَخْبَرَتْ أَنَّ صَفِيَّةَ بِنْتَ حُيَيِّ بْنِ أَخْطَبَ أَصَابَهَا ذَلِكَ فَقَالَتْ عَائِشَةُ الْخَيْبَةُ لَكِ حَبَسْتِينَا فَذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهَا أَنْ تَنْفِرَ وَأَخْبَرَتْ أُمُّ سُلَيْمٍ أَنَّهَا لَقِيَتْ ذَلِكَ فَأَمَرَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ تَنْفِرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] dan [Rauh] secara makna, keduanya berkata, telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Ikrimah], bahwa telah terjadi perdebatan di antara [Ibnu Abbas] dan Zaid bin Tsabit tentang seorang wanita yang datang masa haidnya setelah dia melakukan Thawaf di Ka'bah pada hari Nahr (idul Adla). Zaid berpendapat, \"Janganlah kamu meninggalkan (Makkah) sehingga akhir yang kamu lakukan adalah Thawaf di Ka'bah.\" Sedangkan Ibnu Abbas berkata, \"Jika ia (seorang wanita) Telah melakukan thawaf dan halal untuk suaminya, maka jika mau ia sudah boleh meninggalkan Makkah dan tidak perlu menunggu.\" Orang-orang Anshar lalu berkata kepada Ibnu Abbas, \"Wahai Ibnu Abbas, jika kamu menyelisihi Zaid maka kami tidak akan mengikutimu!\" Kemudian Ibnu Abbas berkata, \"Tanyakanlah kepada Ummu Sulaim.\" Maka mereka menanyakan tentang hal itu kepada Ummu Sulaim, lalu [Ummu Sulaim] memberitahukan bahwa Shafiyah binti Huyay bin Akhtab pernah mengalami hal itu, lalu 'Aisyah berkata, \"Kerugian atas kamu! Kamu telah menahan kami.\" Maka hal itu disampaikan kepada Rasulullah shallallahu 'alaihi wasallam, sehingga beliau memerintahkan untuk meninggalkan Makkah, dan Ummu Sulaim menceritakan bahwa dia menemui hal yang sama kemudian Rasulullah shallallahu 'alaihi wasallam memerintahkannya untuk meninggalkan Makkah.\""
            },
            {
                "number": 4198,
                "arab": "حَدَّثَنَا حَجَّاجٌ عَنِ ابْنِ جُرَيْجٍ وَرَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي عَبْدُ الْكَرِيمِ أَنَّ الْبَرَاءَ بْنَ زَيْدِ ابْنِ بِنْتِ أَنَسِ بْنِ مَالِكٍ أَخْبَرَهُ أَنَّ أَنَسَ بْنَ مَالِكٍ يُحَدِّثُ عَنْ أُمِّ أَنَسِ بْنِ مَالِكٍ قَالَتْدَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْنَا وَقِرْبَةٌ مُعَلَّقَةٌ فِيهَا مَاءٌ فَشَرِبَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِمًا مِنْ فِي الْقِرْبَةِ فَقَامَتْ أُمُّ سُلَيْمٍ إِلَى فِي الْقِرْبَةِ فَقَطَعَتْهُ",
                "id": "Telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] dan [Rauh] telah menceritakan kepada kami [Ibnu Juraij] berkata, telah mengabarkan kepadaku [Abdul Karim] bahwa [Barra' bin Zaid] cucunya Anas bin Malik, telah mengabarkan kepadanya, bahwa [Anas bin Malik] telah menceritakan dari [Ummu Anas bin Malik] dia berkata, \"Nabi shallallahu 'alaihi wasallam pernah menemui kami, sedangkan geribah yang berisikan air mengantung, kemudian Nabi shallallahu 'alaihi wasallam pun meminumnya sambil berdiri melalui mulut geriba.\" Ummu Sulaim lalu bangun dan memotong mulut geribah.\""
            },
            {
                "number": 4199,
                "arab": "حَدَّثَنَا يَعْلَى وَمُحَمَّدٌ قَالَا حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ عَنْ عَمْرٍو الْأَنْصَارِيِّ عَنْ أُمِّ سُلَيْمٍ بِنْتِ مِلْحَانَ وَهِيَ أُمُّ أَنَسِ بْنِ مَالِكٍ قَالَ مُحَمَّدٌ أَخْبَرَتْهُ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ مُسْلِمَيْنِ يَمُوتُ لَهُمَا ثَلَاثَةُ أَوْلَادٍ لَمْ يَبْلُغُوا الْحِنْثَ إِلَّا أَدْخَلَهُمَا اللَّهُ الْجَنَّةَ بِفَضْلِ رَحْمَتِهِ قَالَهَا ثَلَاثًا قِيلَ يَا رَسُولَ اللَّهِ وَاثْنَانِ قَالَ وَاثْنَانِ",
                "id": "Telah menceritakan kepada kami [Ya'la] dan [Muhammad] keduanya berkata, telah menceritakan kepada kami [Utsman bin Hakim] dari [Amru Al Anshari] dari [Ummu Sulaim binti Milhan] dia adalah ibunya Anas bin Malik, [Muhammad] berkata, \"Ummu Sulaim mengabarkan kepadanya, dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah dua orang muslim ditinggal mati oleh ketiga anaknya yang belum berumur baligh, melainkan Allah akan memasukkan keduanya ke dalam surga dengan karuania dan rahmatnya.\" Beliau mengucapkannya hingga tiga kali. Maka ditanyakan kepada beliau, \"Wahai Rasulullah, bagaimana jika hanya dua?\" Beliau menjawab: \"Meskipun dua.\""
            },
            {
                "number": 4200,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا زُهَيْرٌ حَدَّثَنَا عَبْدُ الْكَرِيمِ الْجَزَرِيُّ عَنِ الْبَرَاءِ ابْنِ بِنْتِ أَنَسٍ عَنْ أَنَسٍ عَنْ أُمِّهِ قَالَتْدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي الْبَيْتِ قِرْبَةٌ مُعَلَّقَةٌ فَشَرِبَ مِنْهَا قَائِمًا فَقَطَعْتُ فَاهَا وَإِنَّهُ لَعِنْدِي",
                "id": "Telah menceritakan kepada kami [Abu Kamil] telah menceritakan kepada kami [Zuhair] telah menceritakan kepada kami [Abdul Karim Al Jazari] dari [Barra'] cucunya Anas, dari [Anas] dari [ibunya] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah menemuinya, sedangkan di dalam rumahnya terdapat geribah yang menggantung, kemudian beliau minum darinya dengan berdiri, maka aku memotong mulut geriba tersebut, dan geriba itu sekarang bersamaku.\""
            },
            {
                "number": 4201,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ وَقَالَ عِكْرِمَةُ بْنُ خَالِدٍ عَنْ زَيْدٍ وَابْنِ عَبَّاسٍ قَالَ ابْنُ عَبَّاسٍ لِزَيْدٍ فَاسْأَلْ نِسَاءَكَ أُمَّ سُلَيْمٍ وَصَوَاحِبَهَا هَلْ أَمَرَهُنَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُنَّ زَيْدٌ فَقُلْنَ نَعَمْ قَدْ أَمَرَنَا بِذَلِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ عِكْرِمَةَ قَالَإِنَّ زَيْدَ بْنَ ثَابِتٍ وَابْنَ عَبَّاسٍ اخْتَلَفَا فِي الْمَرْأَةِ تَحِيضُ بَعْدَ الزِّيَارَةِ فِي يَوْمِ النَّحْرِ بَعْدَمَا طَافَتْ بِالْبَيْتِ فَقَالَ زَيْدٌ يَكُونُ آخِرَ عَهْدِهَا الطَّوَافُ بِالْبَيْتِ وَقَالَ ابْنُ عَبَّاسٍ تَنْفِرُ إِنْ شَاءَتْ فَقَالَ الْأَنْصَارُ لَا نُتَابِعُكَ يَا ابْنَ عَبَّاسٍ وَأَنْتَ تُخَالِفُ زَيْدًا وَقَالَ وَاسْأَلُوا صَاحِبَتَكُمْ أُمَّ سُلَيْمٍ فَقَالَتْ حِضْتُ بَعْدَمَا طُفْتُ بِالْبَيْتِ يَوْمَ النَّحْرِ فَأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَنْفِرَ وَحَاضَتْ صَفِيَّةُ فَقَالَتْ لَهَا عَائِشَةُ الْخَيْبَةُ لَكِ إِنَّكِ لَحَابِسَتُنَا فَذُكِرَ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مُرُوهَا فَلْتَنْفِرْ",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Ibnu Juraij] berkata, dan [Ikrimah bin Khalid] berkata dari [Zaid] dan [Ibnu Abbas], Ibnu Abbas berkata kepada Zaid; tanyalah kepada isterimu [Ummu Sulaim] dan sahabat-sahabatnya, apakah Rasulullah shallallahu 'alaihi wasallam menyuruh mereka?\" Maka Zaid pun menanyakannya kepada kami, dan kami pun menjawab, \"Benar, Rasulullah shallallahu 'alaihi wasallam telah memerintahkan seperti itu.\" Telah menceritakan kepada kami [Abdus Shamad] telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Ikrimah] dia berkata, \"Sesungguhnya Zaid bin Tsabit berselisih dengan Ibnu Abbas mengenai seorang wanita yang haid setelah ia melakukan Ziyarah di hari raya nahr (idul Adla) setelah melakukan Thawaf di Ka'bah. Zaid berkata, \"Amalan yang terakhir dilakukan adalah Thawaf di Ka'bah.\" Sedangkan Ibnu Abbas berkata, \"Ia boleh meninggalkan Makkah jika ia menghendaki.\" Maka orang-orang Anshar berkata, \"Kami tidak akan mengikutimu wahai Ibnu Abbas, selagi kamu menyelisihi Zaid.\" Kemudian [Ibnu Abbas] berkata, \"Tanyakanlah kepada saudari kalian, [Ummu Sulaim].\" Ummu Sulaim lalu menerangkan, \"Aku pernah haid sehabis Thawaf di Ka'bah pada hari Nahr (Idul Adla), Rasulullah shallallahu 'alaihi wasallam kemudian menyuruhku untuk meninggalkan (Makkah), dan Shafiyah juga pernah mengalami haid, maka 'Aisyah berkata kepadanya, 'Kerugian atas kamu! Kamu telah menahan kami.' Maka hal itu disampaikan kepada Rasulullah shallallahu 'alaihi wasallam, lantas beliau pun bersabda: \"Perintahkanlah agar dia meninggalkan Makkah.\""
            },
            {
                "number": 4202,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ أَخْبَرَنَا شَرِيكٌ عَنْ سِمَاكٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَيْرَةَ عَنْ دُرَّةَ بِنْتِ أَبِي لَهَبٍ قَالَتْكُنْتُ عِنْدَ عَائِشَةَ فَدَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ائْتُونِي بِوَضُوءٍ قَالَتْ فَابْتَدَرْتُ أَنَا وَعَائِشَةُ الْكُوزَ فَأَخَذْتُهُ أَنَا فَتَوَضَّأَ فَرَفَعَ بَصَرَهُ إِلَيَّ أَوْ طَرْفَهُ إِلَيَّ وَقَالَ أَنْتِ مِنِّي وَأَنَا مِنْكِ قَالَتْ فَأُتِيَ بِرَجُلٍ فَقَالَ مَا أَنَا فَعَلْتُهُ إِنَّمَا قِيلَ لِي قَالَتْ وَكَانَ سَأَلَهُ عَلَى الْمِنْبَرِ مَنْ خَيْرُ النَّاسِ فَقَالَ أَفْقَهُهُمْ فِي دِينِ اللَّهِ وَأَوْصَلُهُمْ لِرَحِمِهِذَكَرَ فِيهِ شَرِيكٌ شَيْئَيْنِ آخَرَيْنِ لَمْ أَحْفَظْهُمَا",
                "id": "Telah menceritakan kepada kami [Aswad bin Amir] telah mengabarkan kepada kami [Syarik] dari [Simak] dari [Abdullah bin Umairah] dari [Durrah binti Abu Lahab] dia berkata, \"Saat aku berada disisi 'Aisyah, tiba-tiba Nabi shallallahu 'alaihi wasallam masuk dan bersabda: \"Berilah aku air untuk berwudlu.\" Durrah berkata, \"Maka aku dan 'Aisyah segera mengambil bejana, lalu beliau berwudlu' dan melihat aku, atau melirik aku. Beliau lalu bersabda: \"Kamu termasuk dari bagianku dan aku termasuk dari bagianmu.\" Durrah berkata, --kemudian ada seseorang disidangkan kepada beliau, namun ia menyatakan 'Aku tidak melakukan, itu hanya sebuah berita saja.\" Durrah berkata, \"Kemudian saat masih berada di mimbar beliau ditanya 'Siapakah orang yang paling baik? ' Beliau menjawab: \"Mereka yang fakih dalam agama Allah dan yang paling sering menyambung tali silatur rahmi.\" Kemudian dalam hadits tersebut menyebutkan dua hal yang aku tidak menghafalnya.\""
            },
            {
                "number": 4203,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا شَرِيكٌ عَنْ سِمَاكٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَيْرَةَ عَنْ زَوْجِ دُرَّةَ بِنْتِ أَبِي لَهَبٍ عَنْ دُرَّةَ بِنْتِ أَبِي لَهَبٍ قَالَتْقَامَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى الْمِنْبَرِ فَقَالَ يَا رَسُولَ اللَّهِ أَيُّ النَّاسِ خَيْرٌ فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ النَّاسِ أَقْرَؤُهُمْ وَأَتْقَاهُمْ وَآمَرُهُمْ بِالْمَعْرُوفِ وَأَنْهَاهُمْ عَنْ الْمُنْكَرِ وَأَوْصَلُهُمْ لِلرَّحِمِ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdul Malik] telah menceritakan kepada kami [Syarik] dari [Simak] dari [Abdullah bin Umairah] dari [Suaminya Durrah binti Abu Lahab] dari [Durrah binti Abu Lahab] dia berkata, \"Seorang laki-laki berdiri di hadapan Nabi shallallahu 'alaihi wasallam, sedangkan beliau berada di atas mimbar. Laki-laki itu bertanya, \"Wahai Rasulullah, siapakah manusia yang paling baik?\" Beliau bersabda: \"Manusia yang paling baik adalah yang paling mengerti (kitabullah), paling bertaqwa, paling sering amar ma'ruf nahi munkar, dan yang paling sering menjalin tali silatur rahmi.\""
            },
            {
                "number": 4204,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ قَالَأَرْسَلَ مَرْوَانُ عَبْدَ اللَّهِ بْنَ عُتْبَةَ إِلَى سُبَيْعَةَ بِنْتِ الْحَارِثِ يَسْأَلُهَا عَمَّا أَفْتَاهَا بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَتْهُ أَنَّهَا كَانَتْ تَحْتَ سَعْدِ ابْنِ خَوْلَةَ فَتُوُفِّيَ عَنْهَا فِي حَجَّةِ الْوَدَاعِ وَكَانَ بَدْرِيًّا فَوَضَعَتْ حَمْلَهَا قَبْلَ أَنْ يَنْقَضِيَ أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ مِنْ وَفَاتِهِ فَلَقِيَهَا أَبُو السَّنَابِلِ يَعْنِي ابْنَ بَعْكَكٍ حِينَ تَعَلَّتْ مِنْ نِفَاسِهَا وَقَدْ اكْتَحَلَتْ فَقَالَ لَهَا ارْبَعِي عَلَى نَفْسِكِ أَوْ نَحْوَ هَذَا لَعَلَّكِ تُرِيدِينَ النِّكَاحَ إِنَّهَا أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ مِنْ وَفَاةِ زَوْجِكِ قَالَتْ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ لَهُ مَا قَالَ أَبُو السَّنَابِلِ بْنُ بَعْكَكٍ فَقَالَ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ حَلَلْتِ حِينَ وَضَعْتِ حَمْلَكِحَدَّثَنَا إِبْرَاهِيمُ بْنُ خَالِدٍ حَدَّثَنَا رَبَاحٌ عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ قَالَ إِنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ كَتَبَ إِلَى عَبْدِ اللَّهِ بْنِ الْأَرْقَمِ يَأْمُرُهُ أَنْ يَدْخُلَ عَلَى سُبَيْعَةَ بِنْتِ الْحَارِثِ يَسْأَلُهَا عَمَّا أَفْتَاهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَزَعَمَتْ أَنَّهَا كَانَتْ تَحْتَ سَعْدِ ابْنِ خَوْلَةَ فَذَكَرَ مَعْنَاهُ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أَبِيهِ قَالَ كَتَبْتُ إِلَى عَبْدِ اللَّهِ بْنِ الْأَرْقَمِ آمُرُهُ أَنْ يَدْخُلَ عَلَى سُبَيْعَةَ الْأَسْلَمِيَّةِ فَيَسْأَلَهَا عَنْ شَأْنِهَا قَالَ فَدَخَلَ عَلَيْهَا فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [ubaidhullah bin Abdullah] dia berkata, Marwan mengutus [Abdullah bin Utbah] kepada [Subai'ah binti Al Harits] untuk menanyakan tentang sesuatu yang Rasulullah shallallahu 'alaihi wasallam fatwakan kepadanya, lalu Subai'ah menceritakan, bahwa dirinya adalah isteri dari Sa'ad bin Khaulah, kemudian dia ditinggal mati olehnya pada saat haji Wada' dan dia termasuk orang yang ikut serta dalam perang Badar. Kemudian dia melahirkan sebelum berlalu masa empat bulan sepuluh hari dari kematian suaminya, lalu dia bertemu dengan Abu As Sanabil -yaitu Ibnu Ba'kak- setelah suci dari nifasnya dan menggunakan celak. Kemudian Abu As Sanabil berkata kepadanya, \"Tahanlah dirimu -atau kalimat yang serupa dengannya-, mungkin kamu menghendaki nikah, sesungguhnya masa iddahmu adalah empat bulan sepuluh hari dari kematian suamimu.\" Subai'ah lalu berkata, \"Maka aku menemui Nabi shallallahu 'alaihi wasallam dan menceritakan kepada beliau apa yang telah dikatakan oleh Abu As Sanabil bin Ba'kak.\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Kamu telah halal untuk menikah sejak kamu melahirkan kandunganmu.\" Telah menceritakan kepada kami [Ibrahim bin Khalid] dia berkata telah menceritakan kepada kami [Rabah] dari [Ma'mar] dari [Az Zuhri] dari [ubaidhullah bin Abdullah bin Uthbah] dia berkata, \"ubaidhullah bin Abdullah bin Utsbah telah menulis surat kepada Abdullah bin Al Arqam, memerintahkan kepadanya untuk datang menemui [Subai'ah binti Al Harits], untuk bertanya kepadanya tentang sesuatu yang telah Rasulullah shallallahu 'alaihi wasallam fatwakan kepadanya. Kemudian Subai'ah mengaku bahwa dia adalah isteri dari Sa'ad bin Khaulah…kemudian dia menyebutkan hadits yang semakna dengannya.\" Telah menceritakan kepada kami [Ya'qub bin Ibrahim] dia berkata, telah menceritakan kepada kami [bapakku] dari [Ibnu Ishaq] dia berkata, telah menceritakan kepadaku [Az Zuhri] dari [ubaidhullah bin Abdullah bin Uthbah] dari [bapaknya] dia berkata, \"Aku telah menulis surat kepada Abdullah bin Al Arqam, memerintahkan kepadanya untuk datang menemui [Subai'ah Al Aslamiyah] dan menanyakan tentang perkara dia.\" Perawi berkata, \"Kemudian Abdullah datang menemui Subai'ah…lalu dia menyebutkan hadits tersebut.\""
            },
            {
                "number": 4205,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ بْنِ الْحَارِثِ التَّيْمِيُّ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالَدَخَلْتُ عَلَى سُبَيْعَةَ بِنْتِ أَبِي بَرْزَةَ الْأَسْلَمِيَّةِ فَسَأَلْتُهَا عَنْ أَمْرِهَا فَقَالَتْ كُنْتُ عِنْدَ سَعْدِ ابْنِ خَوْلَةَ فَتُوُفِّيَ عَنِّي فَلَمْ أَمْكُثْ إِلَّا شَهْرَيْنِ حَتَّى وَضَعْتُ قَالَتْ فَخَطَبَنِي أَبُو السَّنَابِلِ بْنُ بَعْكَكٍ أَخُو بَنِي عَبْدِ الدَّارِ فَتَهَيَّأْتُ لِلنِّكَاحِ قَالَتْ فَدَخَلَ عَلَيَّ حَمَوَيَّ وَقَدْ اخْتَضَبْتُ وَتَهَيَّأْتُ فَقَالَ مَاذَا تُرِيدِينَ يَا سُبَيْعَةُ قَالَتْ فَقُلْتُ أُرِيدُ أَنْ أَتَزَوَّجَ قَالَ وَاللَّهِ مَا لَكِ مِنْ زَوْجٍ حَتَّى تَعْتَدِّينَ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا قَالَتْ فَجِئْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِي قَدْ حَلَلْتِ فَتَزَوَّجِي",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [ayahku] dari [Ibnu Ishaq] berkata, telah menceritakan kepadaku [Muhammad bin Ibrahim bin Al Harits At Taimi] dari [Abu Salamah bin Abdurrahman] berkata, \"Aku menemui [Subai'ah binti Abu Barzah Al Aslamiyah], kemudian aku bertanya kepadanya tentang masalahnya, ia pun berkata, \"Aku adalah isteri Sa'd bin Khaulah, kemudian dia wafat, tidak sampai dua bulan aku berdiam diri (iddah), aku pun melahirkan.\" Subai'ah melanjutkan, \"Kemudian Abu As Sanabil bin Ba'kak, saudara bani Abdu Daar datang melamar dan aku pun telah siap.\" Subai'ah melanjutkan, \"Kemudian kedua saudara iparku datang kepadaku, sungguh aku telah menyiapkan dan berhias diri, iparku berkata, \"Apa yang kamu kehendaki wahai Subai'ah?\" Aku menjawab, \"Aku hendak menikah.\" Iparku lalu berkata, \"Demi Allah, kamu tidak akan mendapatkan suami sehingga kamu selesai dari masa iddahmu, yaitu empat bulan sepuluh hari.\" Kemudian Subai'ah berkata, \"Maka aku menemui Rasulullah shallallahu 'alaihi wasallam dan menyebutkan hal itu kepada beliau, beliau kemudian bersabda kepadaku: \"Sungguh, kamu telah halal, maka menikahlah.\""
            },
            {
                "number": 4206,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا شُعْبَةُ عَنْ خُبَيْبٍ قَالَ سَمِعْتُ عَمَّتِي تَقُولُ وَكَانَتْ حَجَّتْ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ ابْنَ أُمِّ مَكْتُومٍ يُنَادِي بِلَيْلٍ فَكُلُوا وَاشْرَبُوا حَتَّى يُنَادِيَ بِلَالٌ أَوْ إِنَّ بِلَالًا يُنَادِي بِلَيْلٍ فَكُلُوا وَاشْرَبُوا حَتَّى يُنَادِيَ ابْنُ أُمِّ مَكْتُومٍوَكَانَ يَصْعَدُ هَذَا وَيَنْزِلُ هَذَا فَنَتَعَلَّقُ بِهِ فَنَقُولُ كَمَا أَنْتَ حَتَّى نَتَسَحَّرَ",
                "id": "Telah menceritakan kepada kami [Affan] telah menceritakan kepada kami [Syu'bah] dari [Hubaib] berkata, saya mendengar [bibiku] berkata -saat itu ia sedang berhaji bersama Rasulullah shallallahu 'alaihi wasallam-, dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Ibnu Ummi Maktum mengumandangkan adzan pada malam hari, maka makan dan minumlah kalian sehingga Bilal mengumandangkan adzan, atau sesungguhnya Bilal mengumandangkan adzan di malam hari, maka makan dan minumlah kalian sehingga Ibnu Ummi Maktum mengumandangkan adzan. Terkadang yang ini naik dan yang lain turun, maka kita berpegangan padanya, kami mengatakan sebagaimana kamu sehingga kami makan sahur.\""
            },
            {
                "number": 4207,
                "arab": "حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا مَنْصُورٌ يَعْنِي ابْنَ زَاذَانَ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَمَّتِهِ أُنَيْسَةَ بِنْتِ خُبَيْبٍ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَذَّنَ ابْنُ أُمِّ مَكْتُومٍ فَكُلُوا وَاشْرَبُوا وَإِذَا أَذَّنَ بِلَالٌ فَلَا تَأْكُلُوا وَلَا تَشْرَبُواقَالَتْ وَإِنْ كَانَتْ الْمَرْأَةُ لَيَبْقَى عَلَيْهَا مِنْ سُحُورِهَا فَنَقُولُ لِبِلَالٍ أَمْهِلْ حَتَّى أَفْرُغَ مِنْ سُحُورِي",
                "id": "Telah menceritakan kepada kami [Husyaim] telah menceritakan kepada kami [Manshur] -yakni Ibnu Zadzan- dari [Hubaib bin Abdurrahman] dari bibinya [Unaisah binti Khubaib] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika Ibnu Ummi Maktum mengumandangkan adzan, maka makan dan minumlah kalian, namun jika Bilal mengumandangkan adzan, maka janganlah kalian makan dan minum.\" Ia (perawi) Berkata, \"Jika ada seorang wanita masih makan sahur, maka kami mengatakan kepada Bilal, pelan-pelanlah sehingga dia selesai sahur.\""
            },
            {
                "number": 4208,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَمَّتِهِ قَالَتْإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ ابْنَ أُمِّ مَكْتُومٍ أَوْ بِلَالًا يُنَادِي بِلَيْلٍ فَكُلُوا وَاشْرَبُوا حَتَّى يُنَادِيَ بِلَالٌ أَوْ ابْنُ أُمِّ مَكْتُومٍفَمَا كَانَ إِلَّا أَنْ يُؤَذِّنَ أَحَدُهُمَا وَيَصْعَدَ الْآخَرُ فَنَأْخُذَهُ بِيَدِهِ وَنَقُولَ كَمَا أَنْتَ حَتَّى نَتَسَحَّرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Khubaib bin Abdurrahman] dari [bibinya] dia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Ibnu Ummi Maktum atau Bilal menyerukan adzan di malam hari, maka makan dan minumlah kalian sehingga Bilal atau Ibnu Ummi Maktum mengumandangkan (adzan).\" Maka tidaklah salah seorang dari keduanya adzan melainkan yang lainnya akan naik, maka kami menarik tangannya dan berkata sebagaimana kamu, sehingga kami selesai makan sahur.\""
            },
            {
                "number": 4209,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ أَخْبَرَهُ أَبُوهُ قَالَ نَزَلْتُ عَلَى أُمِّ أَيُّوبَ الَّذِي نَزَلَ عَلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَزَلْتُ عَلَيْهَا فَحَدَّثَتْنِي بِهَذَاعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُمْ تَكَلَّفُوا طَعَامًا فِيهِ بَعْضُ هَذِهِ الْبُقُولِ فَقَرَّبُوهُ فَكَرِهَهُ وَقَالَ لِأَصْحَابِهِ كُلُوا إِنِّي لَسْتُ كَأَحَدٍ مِنْكُمْ إِنِّي أَخَافُ أَنْ أُوذِيَ صَاحِبِي يَعْنِي الْمَلَكَ",
                "id": "Telah menceritakan kepada kami [Shafyan bin 'Uyainah] telah menceritakan kepada kami ['ubaidhullah bin Abu Yazid] yang [bapaknya] telah menceritakan kepadanya, bahwa dia berkata, \"Aku singgah di tempatnya [Ummu Ayyub], setiap tempat yang Rasulullah shallallahu 'alaihi wasallam pernah singgah kepada mereka, maka akupun menyinggahinya. Kemudian Ummu Ayyub menceritakan hadits ini kepadaku dari Rasulullah shallallahu 'alaihi wasallam. Bahwa para sahabat bersusah payah menyiapkan makanan yang di dalamnya ada sayuran, ketika mereka mendekatkannya kepada beliau, ternyata beliau tidak menyukainya seranya mengatakan: \"Makanlah oleh kalian, sesungguhnya aku tidak seperti salah seorang dari kalian, aku khawatir akan mengganggu sahabatku, yaitu Malaikat.\""
            },
            {
                "number": 4210,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ عُبَيْدِ اللَّهِ عَنْ أَبِيهِ عَنْ أُمِّ أَيُّوبَ قَالَتْإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَزَلَ الْقُرْآنُ عَلَى سَبْعَةِ أَحْرُفٍ أَيُّهَا قَرَأْتَ أَجْزَأَكَ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari ['ubaidhullah] dari [ayahnya] dari [Ummu Ayyub] dia berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"al-qur'an diturunkan dengan tujuh huruf, mana saja yang kamu baca maka itu berpahala bagimu.\""
            },
            {
                "number": 4211,
                "arab": "قَالَ قَرَأْتُ عَلَى عَبْدِ الرَّحْمَنِ بْنِ مَهْدِيٍّ : مَالِكٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ بْنِ سَعْدِ بْنِ زُرَارَةَ الْأَنْصَارِيَّةِ أَنَّهَا أَخْبَرَتْهُ عَنْ حَبِيبَةَ بِنْتِ سَهْلٍ الْأَنْصَارِيَّةِ قَالَتْ إِنَّهَاكَانَتْ تَحْتَ ثَابِتِ بْنِ قَيْسِ بْنِ شَمَّاسٍ وَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ إِلَى الصُّبْحِ فَوَجَدَ حَبِيبَةَ بِنْتَ سَهْلٍ عَلَى بَابِهِ بِالْغَلَسِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ هَذِهِ قَالَتْ أَنَا حَبِيبَةُ بِنْتُ سَهْلٍ فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لَكِ قَالَتْ لَا أَنَا وَلَا ثَابِتُ بْنُ قَيْسٍ لِزَوْجِهَا فَلَمَّا جَاءَ ثَابِتٌ قَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذِهِ حَبِيبَةُ بِنْتُ سَهْلٍ قَدْ ذَكَرَتْ مَا شَاءَ اللَّهُ أَنْ تَذْكُرَ قَالَتْ حَبِيبَةُ يَا رَسُولَ اللَّهِ كُلُّ مَا أَعْطَانِي عِنْدِي فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِثَابِتٍ خُذْ مِنْهَا فَأَخَذَ مِنْهَا وَجَلَسَتْ فِي أَهْلِهَا",
                "id": "Abdullah berkata; Aku bacakan di hadapan ['Abdurrahman bin Mahdi]; [Malik] dari [Yahya bin Sa'id] dari ['Amrah binti 'Abdurrahman bin Sa'd bin Zurarah Al Anshariyah] bahwa dia telah mengabarkan dari [Habibah binti Sahal Al Anshariyah] dia mengatakan bahwa dia adalah isteri dari Tsabit Bin Qais bin Syammas, ketika Nabi shallallahu 'alaihi wasallam keluar menuju masjid untuk sholat Shubuh, beliau mendapati Habibah binti Sahal berada di depan pintu, lantas Nabi shallallahu 'alaihi wasallam pun bertanya: \"Siapa ini?\" dia menjawab, \"Aku Habibah binti Sahl.\" Nabi shallallahu 'alaihi wasallam lalu bertanya: \"Ada apa denganmu?\" dia menjawab, \"Antara aku dan Tsabit bin Qais tidak ada kecocokan.\" Maka ketika Tsabit datang, Nabi berkata kepadanya: \"Ini Habibah binti Sahl, ia telah menyebutkan Atas kehendak Allah untuk menyebutkannya.\" Habibah berkata, \"Wahai Rasulullah, seluruh apa yang telah dia berikan ada padaku.\" Maka Nabi shallallahu 'alaihi wasallam pun bersabda kepada Tsabit: \"Ambillah milikmu.\" Kemudian Tsabit mengambilnya dari Habibah dan dia (Habibah) kembali tinggal di rumah keluarganya.\""
            },
            {
                "number": 4212,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْحَرَّانِيُّ عَنْ ابْنِ إِسْحَاقَ عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ أُمِّ حَبِيبَةَ بِنْتِ جَحْشٍ أَنَّهَااسْتُحِيضَتْ فَسَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهَا بِالْغُسْلِ عِنْدَ كُلِّ صَلَاةٍ وَإِنْ كَانَتْ لَتَخْرُجُ مِنْ الْمِرْكَنِ وَقَدْ عَلَتْ حُمْرَةُ الدَّمِ عَلَى الْمَاءِ فَتُصَلِّي",
                "id": "Telah menceritakan kepada kami [Muhammad bin Salamah Al Harrani] dari [Ibnu Ishaq] dari [Az Zuhri] dari ['Urwah] dari [Ummu Habibah binti Jahsy] bahwa dia mengalami istahadlah (darah penyakit), kemudian dia menanyakannya kepada Rasulullah shallallahu 'alaihi wasallam, lantas beliau pun memerintahkan dia untuk mandi pada setiap kali mau melaksanakan sholat, yaitu: \"Jika keluar darah dari bejana dan warna merah darah sudah hilang di atas air maka sholatlah.\""
            },
            {
                "number": 4213,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عَمْرَةَ عَنْ أُمِّ حَبِيبَةَ بِنْتِ جَحْشٍ قَالَتْاسْتُحِضْتُ سَبْعَ سِنِينَ فَاشْتَكَيْتُ ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَتْ تِلْكَ بِالْحَيْضَةِ وَلَكِنْ عِرْقٌ فَاغْتَسِلِي فَكَانَتْ تَغْتَسِلُ عِنْدَ كُلِّ صَلَاةٍ فَكَانَتْ تَغْتَسِلُ فِي الْمِرْكَنِ فَنَرَى صُفْرَةَ الدَّمِ فِي الْمِرْكَنِ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Amrah] dari [Ummu Habibah binti Jahsy] dia berkata, \"Aku pernah mengalami istihadlah selama tujuh tahun, kemudian aku mengadukan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, maka Nabi shallallahu 'alaihi wasallam pun bersabda: \"Itu bukanlah darah haid, tetapi itu adalah darah kotor, maka mandilah.\" Ummu Habibah lalu mandi setiap hendak sholat, dan dia mandi di dalam bejana hingga kami dapat melihat warna merah darah di dalam air bak.\""
            },
            {
                "number": 4214,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا سَعِيدٌ يَعْنِي ابْنَ أَبِي أَيُّوبَ قَالَ حَدَّثَنِي أَبُو الْأَسْوَدِ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ جُدَامَةَ بِنْتِ وَهْبٍ أُخْتِ عُكَّاشَةَ قَالَتْحَضَرْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَاسٍ وَهُوَ يَقُولُ لَقَدْ هَمَمْتُ أَنْ أَنْهَى عَنْ الْغِيلَةِ فَنَظَرْتُ فِي الرُّومِ وَفَارِسَ فَإِذَا هُمْ يُغِيلُونَ أَوْلَادَهُمْ وَلَا يَضُرُّ أَوْلَادَهُمْ ذَلِكَ شَيْئًا ثُمَّ سَأَلُوهُ عَنْ الْعَزْلِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاكَ الْوَأْدُ الْخَفِيُّ وَهُوَ{ وَإِذَا الْمَوْءُودَةُ سُئِلَتْ }",
                "id": "Telah menceritakan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami [Sa'id] -yakni Ibnu Abu Ayyub- dia berkata, telah menceritakan kepadaku [Abul Aswad] dari ['Urwah] dari ['Aisyah] dari [Judamah binti Wahb] saudari perempuan 'Ukasyah, dia berkata, \"Aku menghadiri Rasulullah shallallahu 'alaihi wasallam saat beliau bersama orang banyak, beliau mengatakan: \"Sesungguhnya aku berkeinginan untuk melarang dari perbuatan Ghilah, kemudian aku melihat orang-orang Romawi dan Persi melakukan perbuatan Ghilah kepada anak-anak mereka dan tidak membahayakan anak-anak mereka sedikitpun.\" Kemudian para sahabat bertanya kepada Nabi tentang 'Azl (menumpahkan air mani di luar kemaluan wanita), maka beliau menjawab: \"Itu adalah Al Wa'dul Khafi (pembunuhan terselubung), itu seperti firman Allah; '(Dan apabila bayi-bayi perempuan yang dikubur hidup-hidup ditanya) ' (Qs. At Takwiir: 8)."
            },
            {
                "number": 4215,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ يَزِيدَ بْنِ يَزِيدَ بْنِ جَابِرٍ الْأَنْصَارِيِّ عَنْ جَدَّةٍ لَهُ قَالَتْإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَعِنْدَهَا قِرْبَةٌ فَشَرِبَ مِنْ فِيهَا وَهُوَ قَائِمٌوَقُرِئَ عَلَيْهِ هَذَا الْحَدِيثُ يَعْنِي سُفْيَانَ سَمِعْتُ يَزِيدَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ عَنْ جَدَّتِي وَهِيَ كُبَيْشَةُ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Yazid bin Yazid bin Jabir Al Anshari] dari [neneknya] dia berkata, \"Sesungguhnya Nabi shallallahu 'alaihi wasallam masuk menemuinya sedangkan di sisinya ada sebuah Qirbah (bejana dari kulit), kemudian beliau minum dari mulut geriba tersebut sambil berdiri.\" Lalu hadits ini dibacakan di hadapannya, yakni [Sufyan] dia berkata, \"Aku mendengar [Yazid] dari ['Abdurrahman bin Abu 'Amrah] dari nenekku, yaitu [Kubaisyah].\""
            },
            {
                "number": 4216,
                "arab": "حَدَّثَنَا رَوْحٌ أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَمْرِو بْنِ مُعَاذٍ الْأَشْهَلِيِّ عَنْ جَدَّتِهِ أَنَّهَا قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا نِسَاءَ الْمُؤْمِنَاتِ لَا تَحْقِرَنَّ إِحْدَاكُنَّ لِجَارَتِهَا وَلَوْ كُرَاعُ شَاةٍ مُحْرَقٌ",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Malik bin Anas] dari [Zaid bin Aslam] dari ['Amru bin Mu'adz Al Asyhali] dari [neneknya] bahwa dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai para wanita mukminah, janganlah salah seorang dari kalian meremehkan untuk berbuat baik kepada tetangganya meskipun dengan memberi kaki kambing bakar.\""
            },
            {
                "number": 4217,
                "arab": "حَدَّثَنَا رَوْحٌ أَخْبَرَنَا مَالِكٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنِ ابْنِ بُجَيْدٍ الْأَنْصَارِيِّ عَنْ جَدَّتِهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رُدُّوا السَّائِلَ وَلَوْ بِظِلْفٍ مُحْرَقٍ",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Malik] dari [Zaid bin Aslam] dari [Ibnu Bujaid Al Anshari] dari [neneknya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berilah kepada orang yang meminta-minta walaupun sekalipun hanya secuil daging bakar.\""
            },
            {
                "number": 4218,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ عَنْ زَيْدٍ عَنْ عَمْرِو بْنِ مُعَاذٍ الْأَنْصَارِيِّ قَالَإِنَّ سَائِلًا وَقَفَ عَلَى بَابِهِمْ فَقَالَتْ لَهُ جَدَّتُهُ حَوَّاءُ أَطْعِمُوهُ تَمْرًا قَالُوا لَيْسَ عِنْدَنَا قَالَتْ فَاسْقُوهُ سَوِيقًا قَالُوا الْعَجَبُ لَكِ نَسْتَطِيعُ أَنْ نُطْعِمَهُ مَا لَيْسَ عِنْدَنَا قَالَتْ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَرُدُّوا السَّائِلَ وَلَوْ بِظِلْفٍ مُحْرَقٍ",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin Amru] telah menceritakan kepada kami [Zuhair bin Muhammad] dari [Zaid] dari [Amru bin Mu'adz Al Anshari] berkata, \"Sungguh, seorang peminta-minta berhenti di depan pintu mereka, lantas neneknya, [Hawwa'], berkata kepadanya, \"Berilah ia kurma.\" Mereka berkata, \"Kami tidak memilikinya.\" Hawwa' lalu berkata, \"Berilah ia minum sawiq.\" Mereka berkata, \"Aku heran denganmu, bagaimana kami disuruh untuk memberinya makan dari sesuatu yang kami tidak memilikinya.\" Hawwa` berkata, \"Sesungguhnya aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kamu menolak peminta walaupun dengan secuil daging panggang.\""
            },
            {
                "number": 4219,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا زُهَيْرٌ يَعْنِي ابْنَ مُعَاوِيَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عِيسَى عَنْ مُوسَى بْنِ عَبْدِ اللَّهِ قَالَ وَكَانَ رَجُلَ صِدْقٍ عَنِ امْرَأَةٍ مِنْ بَنِى عَبْدِ الْأَشْهَلِ قَالَتْقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ لَنَا طَرِيقًا إِلَى الْمَسْجِدِ مُنْتِنَةً فَكَيْفَ نَصْنَعُ إِذَا مُطِرْنَا قَالَ أَلَيْسَ بَعْدَهَا طَرِيقٌ هِيَ أَطْيَبُ مِنْهَا قَالَتْ قُلْتُ بَلَى قَالَ فَهَذِهِ بِهَذِهِ",
                "id": "Telah menceritakan kepada kami [Abu Kamil] telah menceritakan kepada kami [Zuhair] -yakni Ibnu Mu'awiyah- telah menceritakan kepada kami [Abdullah bin 'Isa] dari [Musa bin Abdullah] -dia adalah seorang lelaki yang jujur- dari [seorang wanita Bani 'Abdul Asyhal] bahwa dia berkata, \"Aku bertanya, \"Wahai Rasulullah, jalan kami menuju masjid bejek, bagaimana jika hujan?\" Beliau lalu menjawab: \"Bukankah ada jalan yang lebih baik darinya.\" Wanita itu lalu berkata, \"Maka aku menjawab, \"Tentu.\" Beliau bersabda: \"Maka yang ini di ganti dengan ini.\""
            },
            {
                "number": 4220,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا إِسْرَائِيلُ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى عَنْ مُوسَى بْنِ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنِ امْرَأَةٍ مِنْ بَنِي عَبْدِ الْأَشْهَلِ أَنَّهَا قَالَتْقُلْتُ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أَمُرُّ فِي طَرِيقٍ لَيْسَ بِطَيِّبٍ فَقَالَ أَلَيْسَ مَا بَعْدَهُ أَطْيَبُ مِنْهُ قَالَتْ بَلَى قَالَ إِنَّ هَذِهِ تَذْهَبُ بِذَلِكَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Isra'il] dari [Abdullah bin 'Isa] dari dari [Musa bin Abdullah bin Yazid] dari [seorang wanita Bani 'Abdul Asyhal] bahwa dia berkata, \"Aku berkata kepada Rasulullah shallallahu 'alaihi wasallam, \"Sungguh, aku melintasi jalan yang rusak!\" Beliau lalu menjawab: \"Bukankah setelah itu ada jalan yang lebih baik?\" dia menjawab, \"Ya.\" Kemudian beliau bersabda: \"Sesungguhnya ini akan hilang dengan hal itu.\""
            },
            {
                "number": 4221,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ أَنَّ امْرَأَةً حَدَّثَتْهُ قَالَتْنَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ اسْتَيْقَظَ وَهُوَ يَضْحَكُ فَقُلْتُ تَضْحَكُ مِنِّي يَا رَسُولَ اللَّهِ قَالَ لَا وَلَكِنْ مِنْ قَوْمٍ مِنْ أُمَّتِي يَخْرُجُونَ غُزَاةً فِي الْبَحْرِ مَثَلُهُمْ مَثَلُ الْمُلُوكِ عَلَى الْأَسِرَّةِ قَالَتْ ثُمَّ نَامَ ثُمَّ اسْتَيْقَظَ أَيْضًا يَضْحَكُ فَقُلْتُ تَضْحَكُ يَا رَسُولَ اللَّهِ مِنِّي قَالَ لَا وَلَكِنْ مِنْ قَوْمٍ مِنْ أُمَّتِي يَخْرُجُونَ غُزَاةً فِي الْبَحْرِ فَيَرْجِعُونَ قَلِيلَةً غَنَائِمُهُمْ مَغْفُورًا لَهُمْ قَالَتْ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ فَدَعَا لَهَاقَالَ فَأَخْبَرَنِي عَطَاءُ بْنُ يَسَارٍ قَالَ فَرَأَيْتُهَا فِي غَزَاةٍ غَزَاهَا الْمُنْذِرُ بْنُ الزُّبَيْرِ إِلَى أَرْضِ الرُّومِ هِيَ مَعَنَا فَمَاتَتْ بِأَرْضِ الرُّومِ",
                "id": "Telah menceritakan kepada kami ['Abdurrazaq] telah menceritakan kepada kami [Ma'mar] dari [Zaid bin Aslam] dari [Atha' bin Yasar] bahwa [seorang wanita] telah menceritakan kepadanya, dia berkata, \"Rasulullah shallallahu 'alaihi wasallam tidur kemudian terbangun sambil tertawa, maka aku bertanya, \"Wahai Rasulullah, apakah tuan mentertawakan aku?\" beliau menjawab: \"Tidak, akan tetapi suatu kaum dari ummatku yang mereka keluar berperang di lautan, perumpamaan mereka seperti para raja di atas singgasana.\" Wanita itu lalu berkata, \"Kemudian beliau tidur dan bangun kembali sambil tertawa, maka aku pun bertanya, \"Wahai Rasulullah, apakah tuan mentertawakan aku?\" Beliau menjawab: \"Tidak, akan tetapi suatu kaum dari ummatku yang mereka keluar berperang di lautan kemudian mereka kembali dengan membawa sedikit Ghanimah (harta rampasan perang) dalam keadaan diampuni oleh Allah.\" Wanita itu lalu berkata, \"Berdo'alah kepada Allah agar aku termasuk dari mereka.\" Kemudian beliau mendo'akan untuknya.\" Zaid bin Aslam berkata, \" 'Atha' bin Yasar mengabarkan kepadaku, ia berkata, \"Aku pernah melihat wanita itu dalam pertempuran yang dipimpin oleh Al Mundzir bin Az Zubair menuju negeri Romawi, wanita itu bersama kami dan meninggal di bumi Romawi.\""
            },
            {
                "number": 4222,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَعْدِ بْنِ زُرَارَةَ ابْنِ أَخِي عَمْرَةَ سَمِعْتُهُ مِنْهُ قَبْلَ أَنْ يَجِيءَ الزُّهْرِيُّ عَنْ امْرَأَةٍ مِنَ الْأَنْصَارِ قَالَتْكَانَ تَنُّورُنَا وَتَنُّورُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاحِدًا فَمَا حَفِظْتُ ق إِلَّا مِنْهُ كَانَ يَقْرَؤُهَا",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Muhammad bin 'Abdurrahman bin Sa'd bin Zurarah] anak laki-laki saudara 'Amrah -aku mendengar darinya sebelum kedatangan Az Zuhri-, dari [seorang wanita Anshar] dia berkata, \"Tungku masakku bergabung dengan tungku masak Nabi shallallahu 'alaihi wasallam, sehingga aku tidak hafal surat Qaaf kecuali darinya yang beliau bacakan.\""
            },
            {
                "number": 4223,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سَعْدِ بْنِ زُرَارَةَ عَنْ أُمِّ هِشَامٍ بِنْتِ حَارِثَةَ قَالَتْلَقَدْ كَانَ تَنُّورُنَا وَتَنُّورُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاحِدًا سَنَتَيْنِ أَوْ سَنَةً وَبَعْضَ سَنَةٍ وَمَا أَخَذْتُ ق وَالْقُرْآنِ الْمَجِيدِ إِلَّا عَلَى لِسَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ بِهَا كُلَّ يَوْمِ جُمُعَةٍ عَلَى الْمِنْبَرِ إِذَا خَطَبَ النَّاسَ",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [ayahku] dari [Ibnu Ishaq] telah menceritakan kepadaku [Abdullah bin Muhammad bin Abu Bakr bin Muhammad bin 'Amru bin Hazm] dari [Yahya bin Abdullah bin 'Abdurrahman bin Sa'ad bin Zurarah] dari [Ummu Hisyam binti Haritsah] dia berkata, \"Dahulu tungku masakku bergabung dengan tungku masak Nabi shallallahu 'alaihi wasallam selama dua tahun, atau satu tahun beberapa bulan, dan tidaklah aku mendapatkan surat 'Qaaf Wal Qur'aanil majiid', kecuali dari lisan Rasulullah shallallahu 'alaihi wasallam yang beliau bacakan setiap hari jumat di atas mimbar saat berkhutbah di hadapan manusia.\""
            },
            {
                "number": 4224,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ حَدَّثَنَا ابْنُ شِهَابٍ وَيَعْقُوبُ حَدَّثَنَا أَبِي عَنِ ابْنِ شِهَابٍ عَنْ خَارِجَةَ بْنِ زَيْدِ بْنِ ثَابِتٍ عَنْ أُمِّ الْعَلَاءِ الْأَنْصَارِيَّةِ وَهِيَ امْرَأَةٌ مِنْ نِسَائِهِمْ قَالَ يَعْقُوبُ أَخْبَرْتُهُأَنَّهَا بَايَعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عُثْمَانُ بْنُ مَظْعُونٍ فِي السُّكْنَى قَالَ يَعْقُوبُ طَارَ لَهُمْ فِي السُّكْنَى حِينَ اقْتَرَعَتْ الْأَنْصَارُ عَلَى سُكْنَى الْمُهَاجِرِينَ قَالَتْ أُمُّ الْعَلَاءِ فَاشْتَكَى عُثْمَانُ بْنُ مَظْعُونٍ عِنْدَنَا فَمَرَّضْنَاهُ حَتَّى إِذَا تُوُفِّيَ أَدْرَجْنَاهُ فِي أَثْوَابِهِ فَدَخَلَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ رَحْمَةُ اللَّهِ عَلَيْكَ يَا أَبَا السَّائِبِ شَهَادَتِي عَلَيْكَ لَقَدْ أَكْرَمَكَ اللَّهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا يُدْرِيكِ أَنَّ اللَّهَ أَكْرَمَهُ قَالَتْ فَقُلْتُ لَا أَدْرِي بِأَبِي أَنْتَ وَأُمِّي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا هُوَ فَقَدْ جَاءَهُ الْيَقِينُ مِنْ رَبِّهِ وَإِنِّي لَأَرْجُو الْخَيْرَ لَهُ وَاللَّهِ مَا أَدْرِي وَأَنَا رَسُولُ اللَّهِ مَا يُفْعَلُ بِي قَالَ يَعْقُوبُ بِهِ قَالَتْ وَاللَّهِ لَا أُزَكِّي أَحَدًا بَعْدَهُ أَبَدًا فَأَحْزَنَنِي ذَلِكَ فَنِمْتُ فَأُرِيتُ لِعُثْمَانَ عَيْنًا تَجْرِي فَجِئْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ ذَلِكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاكَ عَمَلُهُحَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ خَارِجَةَ بْنِ زَيْدٍ قَالَ كَانَتْ أُمُّ الْعَلَاءِ الْأَنْصَارِيَّةُ تَقُولُ لَمَّا قَدِمَ الْمُهَاجِرُونَ الْمَدِينَةَ اقْتَرَعَتْ الْأَنْصَارُ عَلَى سَكَنِهِمْ فَطَارَ لَنَا عُثْمَانُ بْنُ مَظْعُونٍ فِي السُّكْنَى فَذَكَرَتْ الْحَدِيثَ إِلَّا أَنَّهُ قَالَ مَا أَدْرِي وَأَنَا رَسُولُ اللَّهِ مَا يُفْعَلُ بِي وَلَا بِكُمْ",
                "id": "Telah menceritakan kepada kami [Abu Kamil] telah menceritakan kepada kami [Ibrahim bin Sa'd] telah menceritakan kepada kami [Ibnu Syihab], dan [Ya'qub] telah menceritakan kepada kami [ayahku] dari [Ibnu Syihab] dari [Kharijah bin Zaid bin Tsabit] dari [Ummul 'Ala' Al Anshariyah] -dia adalah salah seorang wanita dari mereka-, [Ya'qub] berkata, \"Aku menceritakan kepadanya, bahwa wanita itu adalah orang yang pernah berbaiat kepada Rasulullah shallallahu 'alaihi wasallam.\" Sedangkan 'Utsman bin Madz'un menyebutkan, (bahwa hal itu berkaitan dengan) Sukna (tempat tinggal).\" Ya'qub berkata, \"Panah undian itu mengarah kepada mereka ketika orang-orang Anshar melakukan undian tentang tempat tinggal orang-orang Muhajirin.\" [Ummul 'Ala'] berkata, \"Selanjutnya Utsman bin Madz'un mengeluhkan sakitnya di sisi kami kemudian kami merawatnya sampai ketika dia meninggal kami menyelimutinya dengan bajunya, kemudian datanglah Rasulullah shallallahu 'alaihi wasallam kepada kami, dan akupun berkata, \"Semoga Rahmat Allah senantiasa di curahkan kepadamu wahai Abu As Sa'ib. Aku bersaksi atas kamu. Sungguh, Allah telah memuliakanmu.\" Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Dari mana kamu tahu bahwa Allah telah memuliakannya?\" Ummul 'Ala` berkata, \"Maka aku menjawab, \"Bapak dan ibuku sebagai tebusanmu. Aku tidak tahu.\" Lantas Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kematian dari Rabbnya telah datang kepadanya, aku berharap dia mendapatkan kebaikan. Demi Allah, mekipun aku seorang Nabi, aku tidak tahu apa yang akan aku rasakan.\" Ya'qub berkata, \"Karena ucapan itu, maka Ummu 'Ala` itu pun berkata, \"Demi Allah, aku tidak akan lagi memuji seseorang setelahnya, sehingga hal itu membuat aku sedih. Kemudian aku bermimpi dan diperlihatkan kepadaku bahwa 'Utsman mendapatkan mata air yang mengalir, maka aku mendatangi Rasulullah shallallahu 'alaihi wasallam dan menceritakan hal itu kepadanya, beliau lalu bersabda: \"Itu adalah amalan Utsman.\" Telah menceritakan kepada kami [Abdurrazaq] dia berkata telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Kharijah bin Zaid] dia berkata, [Ummul 'Ala' Al Anshariyah] pernah berkata, \"Ketika orang-orang Muhajirin tiba di Madinah, maka orang-orang Anshar melakukan Qur'ah (undian) untuk menentukan tempat tinggal mereka, maka keluarlah pilihan untuk kami 'Utsman bin Madz'un…kemudian dia menyebutkan lafadz hadits. Hanya saja dia menyebutkan lafadz, \"Meskipun aku Rasulullah, aku tidak tahu apa yang akan Allah terhadap aku dan juga kalian.\""
            },
            {
                "number": 4225,
                "arab": "حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ حَدَّثَنَا يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ أَبِي النَّضْرِ عَنْ خَارِجَةَ بْنِ زَيْدٍ عَنْ أُمِّهِ قَالَتْإِنَّ عُثْمَانَ بْنَ مَظْعُونٍ لَمَّا قُبِضَ قَالَتْ أُمُّ خَارِجَةَ بِنْتُ زَيْدٍ طِبْتَ أَبَا السَّائِبِ خَيْرُ أَيَّامِكَ الْخَيْرُ فَسَمِعَهَا نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَنْ هَذِهِ قَالَتْ أَنَا قَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا يُدْرِيكِ فَقُلْتُ يَا رَسُولَ اللَّهِ عُثْمَانُ بْنُ مَظْعُونٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَجَلْ عُثْمَانُ بْنُ مَظْعُونٍ مَا رَأَيْنَا إِلَّا خَيْرًا وَهَذَا أَنَا رَسُولُ اللَّهِ وَاللَّهِ مَا أَدْرِي مَا يُصْنَعُ بِي",
                "id": "Telah menceritakan kepada kami [Yunus bin Muhammad] telah menceritakan kepada kami [Laits bin Sa'd] telah menceritakan kepada kami [Yazid bin Abu Habib] dari [Abu An Nadlr] dari [Kharijah bin Zaid] dari [Ibunya] dia berkata, \"Ketika 'Utsman bin Madz'un wafat, Ummu Kharijah binti Zaid berkata, \"Alangkah baiknya kamu wahai Abu Sa'ib, semua hari-harimu adalah baik.\" Kemudian ucapan itu terdengar oleh Nabi Allah shallallahu 'alaihi wasallam, kemudian beliau bertanya: \"Siapa ini?\" dia menjawab, \"Aku.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Ada apa dengan kamu?\" Aku berkata, \"Wahai Rasulullah, 'Utsman bin Madz'un.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Benar, Utsman bin Madz'un. Kami tidak melihatnya kecuali kebaikan, Aku adalah utusan Allah, demi Allah aku tidak tahu apa yang akan terjadi padaku.\""
            },
            {
                "number": 4226,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ طَارِقِ بْنِ عَلْقَمَةَ أَخْبَرَهُ عَنْ أُمِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ مَكَانًا مِنْ دَارِ يَعْلَى نَسَبَهُ عُبَيْدُ اللَّهِ اسْتَقْبَلَ الْبَيْتَ فَدَعَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Bakar] dia berkata, telah mengabarkan kepada kami [Ibnu Juraij] dia berkata, telah mengabarkan kepadaku ['ubaidhullah bin Abu Yazid] bahwa ['Abdurrahman bin Thariq bin Al Qamah] telah menceritakan kepadanya dari [ibunya] bahwa apabila Nabi shallallahu 'alaihi wasallam memasuki suatu tempat di rumah Ya'la -'ubaidhullah lupa dimana tempatnya-, beliau menghadap kiblat dan berdo'a.\""
            },
            {
                "number": 4227,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ قَالَ إِنَّ عَبْدَ الرَّحْمَنِ بْنَ طَارِقِ بْنِ عَلْقَمَةَ أَخْبَرَهُ عَنْ أُمِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ مَكَانًا فِي دَارِ يَعْلَى نَسَبَهُ عُبَيْدُ اللَّهِ اسْتَقْبَلَ الْبَيْتَ فَدَعَا",
                "id": "Telah menceritakan kepada kami ['Abdurrazaq] dia berkata, telah mengabarkan kepada kami [Ibnu Juraij] dia berkata, telah mengabarkan kepadaku ['ubaidhullah bin Abu Yazid] dia berkata, bahwa ['Abdurrahman bin Thariq bin Al Qamah] telah mengabarkan kepadanya dari [ibunya] bahwa apabila Nabi shallallahu 'alaihi wasallam memasuki suatu tempat di rumah Ya'la -'ubaidhullah lupa dimana tempatnya-, beliau menghadap kiblat dan berdo'a.\""
            },
            {
                "number": 4228,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَجَّاجِ حَدَّثَنَا عَبْدُ اللَّهِ وَعَلِيُّ بْنُ إِسْحَاقَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ طَارِقِ بْنِ عَلْقَمَةَ أَخْبَرَهُ عَنْ أُمِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا دَخَلَ مَكَانًا مِنْ دَارِ يَعْلَى نَسَبَهُ عُبَيْدُ اللَّهِ اسْتَقْبَلَ الْبَيْتَ فَدَعَاقَالَ وَكُنْتُ أَنَا وَعَبْدُ اللَّهِ بْنُ كَثِيرٍ إِذَا جِئْنَا ذَلِكَ الْمَوْضِعَ اسْتَقْبَلَ الْبَيْتَ فَدَعَا",
                "id": "Telah menceritakan kepada kami [Ahmad bin Hajjaj] dia berkata, telah menceritakan kepada kami [Abdullah] dan ['Ali bin Ishaq] dia berkata, telah mengabarkan kepada kami [Abdullah bin Mubarak] dia berkata, telah mengabarkan kepada kami [Ibnu Juraij] dia berkata, telah mengabarkan kepadaku ['ubaidhullah bin Abu Yazid] dia berkata, bahwa ['Abdurrahman bin Thariq bin Alqamah] mengabarkan kepadanya dari [ibunya], bahwa apabila Nabi shallallahu 'alaihi wasallam memasuki tempat di kediaman Ya'la -'ubaidhullah lupa dimana tempatnya-, beliau menghadap kiblat dan berdo'a.\" 'ubaidhullah berkata, \"Aku dan Abdullah bin Katsir apabila datang ke tempat itu, maka kami menghadap kiblat dan berdo'a.\""
            },
            {
                "number": 4229,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ وَاصِلٍ مَوْلَى أَبِي عُيَيْنَةَ عَنْ مُوسَى بْنِ عُبَيْدٍ عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ أَنَّ امْرَأَةً أَخْبَرَتْهَا أَنَّهَاسَمِعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ الصَّفَا وَالْمَرْوَةِ يَقُولُ كُتِبَ عَلَيْكُمْ السَّعْيُ فَاسْعَوْا",
                "id": "Telah menceritakan kepada kami ['Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Washil] bekas budak Abu 'Uyainah, dari [Musa bin Ubaid] dari [Shafiyah binti Syaibah] bahwa [seorang wanita] menceritakan kepadanya, bahwa dia telah mendengar Nabi shallallahu 'alaihi wasallam bersabda ketika di Shafa dan Marwah: \"Sa'i telah diwajibkan atas kalian, maka laksanakanlah.\""
            },
            {
                "number": 4230,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْحَاقَ عَنِ ضَمْرَةَ بْنِ سَعِيدٍ عَنْ جَدَّتِهِ عَنِ امْرَأَةٍ مِنْ نِسَائِهِمْ وَكَانَتْ قَدْ صَلَّتْ الْقِبْلَتَيْنِ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اخْتَضِبِي تَتْرُكُ إِحْدَاكُنَّ الْخِضَابَ حَتَّى تَكُونَ يَدُهَا كَيَدِ الرَّجُلِقَالَتْ فَمَا تَرَكَتْ الْخِضَابَ حَتَّى لَقِيَتْ اللَّهَ تَعَالَى وَإِنْ كَانَتْ لَتَخْتَضِبُ وَهِيَ بِنْتُ ثَمَانِينَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Muhammad bin Ishaq] dari [Dlamrah bin Sa'id] dari [neneknya] dari [seorang wanita] di antara para wanita Dlamrah, bahwa dia telah sholat bersama Nabi shallallahu 'alaihi wasallam di masjid Qiblatain. Wanita itu berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam datang menemuiku dan bersabda: \"Hendaklah kalian cat kuku kalian, jika kalian tidak lakukan itu maka kuku kalian seperti kuku lelaki.\" Wanita itu lalu berkata, \"Setelah itu ia tidak lagi meninggalkan untuk mengecat kukunya hingga ia berjumpa dengan Allah, dan dia tetap mengecat kukunya walaupun berumur delapan puluh tahun.\""
            },
            {
                "number": 4231,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ سُفْيَانَ عَنْ حَبِيبٍ يَعْنِي ابْنَ أَبِي ثَابِتٍ عَنْ رَجُلٍ عَنْ أُمِّ مُسْلِمٍ الْأَشْجَعِيَّةِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَاهَا وَهِيَ فِي قُبَّةٍ فَقَالَ مَا أَحْسَنَهَا إِنْ لَمْ يَكُنْ فِيهَا مَيْتَةٌ قَالَتْ فَجَعَلْتُ أَتَتَبَّعُهَا",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Mahdi] dari [Sufyan] dari [Habib] -yakni Ibnu Abu Tsabit- dari [seorang laki-laki] dari [Ummu Muslim Al Asyja'iyah] bahwa Nabi shallallahu 'alaihi wasallam datang menemuinya, yang saat itu ia sedang berada di tenda. Beliau bersabda: \"Alangkah bagusnya jika di dalamnya tidak ada bangkai, \" kemudian aku mencari-carinya.\""
            },
            {
                "number": 4232,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْعَبَّاسِ وَيُونُسُ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عُثْمَانَ قَالَ إِبْرَاهِيمُ بْنُ أَبِي الْعَبَّاسِ ابْنَ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ حَاطِبٍ قَالَ حَدَّثَنِي أَبِي عَنْ جَدِّهِ مُحَمَّدِ بْنِ حَاطِبٍ عَنْ أُمِّهِ أُمِّ جَمِيلٍ بِنْتِ الْمُجَلِّلِ قَالَتْأَقْبَلْتُ بِكَ مِنْ أَرْضِ الْحَبَشَةِ حَتَّى إِذَا كُنْتُ مِنْ الْمَدِينَةِ عَلَى لَيْلَةٍ أَوْ لَيْلَتَيْنِ طَبَخْتُ لَكَ طَبِيخًا فَفَنِيَ الْحَطَبُ فَخَرَجْتُ أَطْلُبُهُ فَتَنَاوَلْتُ الْقِدْرَ فَانْكَفَأَتْ عَلَى ذِرَاعِكَ فَأَتَيْتُ بِكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ هَذَا مُحَمَّدُ بْنُ حَاطِبٍ فَتَفَلَ فِي فَاكَ وَمَسَحَ عَلَى رَأْسِكَ وَدَعَا لَكَ وَجَعَلَ يَتْفُلُ عَلَى يَدِكَ وَيَقُولُ أَذْهِبْ الْبَاسَ رَبَّ النَّاسِ وَاشْفِ وَأَنْتَ الشَّافِي لَا شِفَاءَ إِلَّا شِفَاؤُكَ شِفَاءً لَا يُغَادِرُ سَقَمًاقَالَتْ فَمَا قُمْتُ بِكَ مِنْ عِنْدِهِ حَتَّى بَرَأَتْ يَدُكَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Abul Abbas] dan [Yunus bin Muhammad] keduanya berkata, telah menceritakan kepada kami ['Abdurrahman bin 'Utsman] bahwa [Ibrahim bin Abul Abbas bin Ibrahim] bin Muhammad bin Hatib dia berkata, telah menceritakan kepadaku [ayahku] dari kakeknya [Muhammad bin Hatib] dari ibunya [Ummu Jamil binti Al Mujallil] dia berkata, \"Aku datang denganmu dari negeri Habasyah sehingga ketika aku singgah di Madinah pada satu malam, atau dua malam, aku membuat masakkan untukmu namun kehabisan kayu bakar, kemudian aku keluar mencari kayu bakar dan kuambil panci, namun panci itu tumpah dan mengenai lenganmu. Kemudian aku membawamu menemui Nabi shallallahu 'alaihi wasallam, aku lalu sampaikan kepada beliau, \"Demi bapak dan ibuku sebagai tebusanmu, Wahai Rasulullah, ini adalah Muhammad bin Hatib.\" Kemudian beliau meludah ke mulutmu dan mengusap kepalamu sambil mendo'akanmu, kemudian beliau meludah ke tanganmu sambil membaca \"ADZHIBIL BA'SA RABBIN NAAS WASYFI WA ANTASY SYAAFI LAA SYIFAA'A ILLAA SYIFAA'UKA SYIFAA'AN LAA YUGHAADIRU SAQAMA (Hilangkanlah penyakit wahai Rabb manusia dan sembuhkanlah, Engkaulah Dzat yang Maha menyembuhkan, tidak ada kesembuhan kecuali dari Engkau kesembuhan yang tidak meninggalkan bekas kepada orang yang sakit) '.\" Ummu Jamil lalu berkata, \"Maka belum lagi aku membawamu pergi dari sisi beliau kecuali tanganmu telah sembuh.\""
            },
            {
                "number": 4233,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ قَالَ حَدَّثَنَا مُوسَى الْجُهَنِيُّ قَالَ حَدَّثَتْنِي فَاطِمَةُ بِنْتُ عَلِيٍّ قَالَتْ حَدَّثَتْنِي أَسْمَاءُ بِنْتُ عُمَيْسٍ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَا عَلِيُّ أَنْتَ مِنِّي بِمَنْزِلَةِ هَارُونَ مِنْ مُوسَى إِلَّا أَنَّهُ لَيْسَ بَعْدِي نَبِيٌّ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Numair] dia berkata, telah menceritakan kepada kami [Musa Al Juhani] dia berkata, telah menceritakan kepadaku [Fatimah binti Ali] dia berkata, telah menceritakan kepadaku [Asma' binti Umais] dia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Ali, kedudukanmu dariku sebagaimana kedudukan Harun dari Musa, hanya saja tidak ada Nabi setelahku.\""
            },
            {
                "number": 4234,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ وَيَزِيدُ بْنُ هَارُونَ وَعَفَّانُ قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ قَالَ يَزِيدُ فِي حَدِيثِهِ حَدَّثَنَا الْحَكَمُ وَقَالَ عَفَّانُ فِي حَدِيثِهِ سَمِعْتُ الْحَكَمَ بْنَ عُتَيْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنِ أَسْمَاءَ بِنْتِ عُمَيْسٍ قَالَتْلَمَّا أُصِيبَ جَعْفَرٌ أَتَانَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أُمِّي الْبَسِي ثَوْبَ الْحِدَادِ ثَلَاثًا ثُمَّ اصْنَعِي مَا شِئْتِقَالَ عَبْد اللَّهِ و حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ طَلْحَةَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu Kamil] dan [Yazid bin Harun] dan ['Affan] mereka berkata, telah menceritakan kepada kami [Muhammad bin Thalhah], [Yazid] menyebutkan dalam haditsnya, telah menceritakan kepada kami [Al Hakam], dan ['Affan] menyebutkan dalam haditsnya, aku mendengar [Al Hakam bin 'Utaibah] dari [Abdullah bin Syaddad] dari [Asma' binti Umais] dia berkata, \"Ketika Ja'far meninggal dunia, Nabi shallallahu 'alaihi wasallam datang kepada kami seraya bersabda: \"Wahai ibuku, pakailah pakaian berkabung (tidak warna warni) selama tiga hari, setelah itu silahkan lakukan apa yang kamu kehendaki.\" Abdullah berkata; telah menceritakan kepada kami [Muhammad bin Bakkar] dia berkata; telah menceritakan kepada kami [Muhammad bin Thalhah] dengan riwayat yang seperti itu.\""
            },
            {
                "number": 4235,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنِ الزُهْرِىِّ قَالَ أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ قَالَتْأَوَّلُ مَا اشْتَكَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِ مَيْمُونَةَ فَاشْتَدَّ مَرَضُهُ حَتَّى أُغْمِيَ عَلَيْهِ فَتَشَاوَرَ نِسَاؤُهُ فِي لَدِّهِ فَلَدُّوهُ فَلَمَّا أَفَاقَ قَالَ مَا هَذَا فَقُلْنَا هَذَا فِعْلُ نِسَاءٍ جِئْنَ مِنْ هَاهُنَا وَأَشَارَ إِلَى أَرْضِ الْحَبَشَةِ وَكَانَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ فِيهِنَّ قَالُوا كُنَّا نَتَّهِمُ فِيكَ ذَاتَ الْجَنْبِ يَا رَسُولَ اللَّهِ قَالَ إِنَّ ذَلِكَ لَدَاءٌ مَا كَانَ اللَّهُ عَزَّ وَجَلَّ لَيَقْرَفُنِي بِهِ لَا يَبْقَيَنَّ فِي هَذَا الْبَيْتِ أَحَدٌ إِلَّا الْتَدَّ إِلَّا عَمُّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي الْعَبَّاسَ قَالَ فَلَقَدْ الْتَدَّتْ مَيْمُونَةُ يَوْمَئِذٍ وَإِنَّهَا لَصَائِمَةٌ لِعَزْمَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami ['Abdurrazaq] dia berkata, telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dia berkata, telah mengabarkan kepadaku [Abu Bakar bin 'Abdurrahman bin Harits bin Hisyam] dari [Asma' binti 'Umais] dia berkata, \"Pertama kali Rasulullah shallallahu 'alaihi wasallam merasakan sakit, beliau berada di rumah Maimunah, saat sakitnya semakin parah dan tidak sadarkan diri, maka para isteri beliau bermusyawarah untuk mengobatinya dengan meminumkan obat melalui mulut sampingnya, kemudian mereka pun melakukannya. Setelah sadarkan diri beliau bertanya: \"Apa ini?\" kami menjawab, \"Ini adalah perbuatan para wanita yang datang dari sini -kemudian ia menunjuk ke arah Habasyah-, dan ketika itu Asma' binti 'Umais ada bersama mereka. Mereka lalu berkata, \"Kami menganggap bahwa tuan terkena penykit TBC wahai Rasulullah.\" Beliau bersabda: \"Sungguh, itu adalah penyakit berbahaya, tidaklah Allah 'azza wajalla menjadikan menular terhadapku, maka janganlah seseorang tinggal di rumah ini kecuali dia harus meminum obat, kecuali paman Rasulullah shallallahu 'alaihi wasallam, Al Abbas.\" Abu Bakar bin 'Abdurrahman berkata, \"Sungguh, pada hari itu Maimunah meminum obat, padahal dia sedang berpuasa, karena anjuran Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 4236,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عُرْوَةَ بْنِ عَامِرٍ عَنْ عُبَيْدِ بْنِ رِفَاعَةَ الزُّرَقِيِّ قَالَ قَالَتْ أَسْمَاءُيَا رَسُولَ اللَّهِ إِنَّ بَنِي جَعْفَرٍ تُصِيبُهُمْ الْعَيْنُ أَفَأَسْتَرْقِي لَهُمْ قَالَ نَعَمْ فَلَوْ كَانَ شَيْءٌ سَابِقٌ الْقَدَرَ لَسَبَقَتْهُ الْعَيْنُ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari ['Amru bin Dinar] dari ['Urwah bin 'Amir] dari ['Ubaid bin Rifa'ah Az Zuraqi] dia berkata, [Asma'] berkata, \"Wahai Rasulullah, sesungguhnya Bani Ja'far terkena penyakit 'Ain, bolehkah aku membacakan ruqyah untuk mereka?\" beliau menjawab: \"Ya, sekiranya ada sesuatu yang mendahului takdir, maka itu adalah penyakit ain.\""
            },
            {
                "number": 4237,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ حَدَّثَنَا يُونُسُ يَعْنِى ابْنَ يَزِيدَ الْأَيْلِيَّ قَالَ حَدَّثَنَا أَبُو شَدَّادٍ عَنْ مُجَاهِدٍ عَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ قَالَتْكُنْتُ صَاحِبَةَ عَائِشَةَ الَّتِي هَيَّأَتْهَا وَأَدْخَلَتْهَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعِي نِسْوَةٌ قَالَتْ فَوَاللَّهِ مَا وَجَدْنَا عِنْدَهُ قِرًى إِلَّا قَدَحًا مِنْ لَبَنٍ قَالَتْ فَشَرِبَ مِنْهُ ثُمَّ نَاوَلَهُ عَائِشَةَ فَاسْتَحْيَتْ الْجَارِيَةُ فَقُلْنَا لَا تَرُدِّي يَدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذِي مِنْهُ فَأَخَذَتْهُ عَلَى حَيَاءٍ فَشَرِبَتْ مِنْهُ ثُمَّ قَالَ نَاوِلِي صَوَاحِبَكِ فَقُلْنَا لَا نَشْتَهِهِ فَقَالَ لَا تَجْمَعْنَ جُوعًا وَكَذِبًا قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنْ قَالَتْ إِحْدَانَا لِشَيْءٍ تَشْتَهِيهِ لَا أَشْتَهِيهِ يُعَدُّ ذَلِكَ كَذِبًا قَالَ إِنَّ الْكَذِبَ يُكْتَبُ كَذِبًا حَتَّى تُكْتَبَ الْكُذَيْبَةُ كُذَيْبَةً",
                "id": "Telah menceritakan kepada kami ['Utsman bin 'Umar] dia berkata, telah menceritakan kepada kami [Yunus] -yakni Ibnu Yazid Al Aila- dia berkata, telah menceritakan kepada kami [Abu Syaddad] dari [Mujahid] dari [Asma' binti 'Umais] dia berkata, \"Aku menemani A'isyah untuk meriasnya sebelum bertemu dengan Rasulullah, sedangkan aku bersama beberapa wanita.\" Asma berkata, \"Demi Allah, kami tidak mendapatkan hidangan dari sisi beliau (Nabi) kecuali sebuah mangkuk berisi susu.\" Asma berkata, \"Kemudian beliau meminumnya lalu memberikannya kepada A'isyah, namun A'isyah malu-malu, maka kami pun berkata, \"Jangan kamu tolak pemberian dari Rasulullah shallallahu 'alaihi wasallam, ambillah darinya.\" Kemudian dia mengambilnya sambil tersipu malu untuk kemudian meminumnya. Setelah itu beliau bersabda: \"Ambilkan untuk sahabat-sahabatmu.\" Namun kami menjawab, \"Kami tidak menginginkannya.\" Beliau bersabda: \"Jangan kalian kumpulkan rasa lapar dengan kebohongan.\" Asma berkata, \"Lalu aku bertanya, \"Wahai Rasulullah, jika salah seorang dari kami mengatakan 'aku tidak menginginkannya', padahal sebenarnya dia menginginkan sesuatu itu, apakah itu termasuk berbohong? ' Beliau menjawab: \"Sesungguhnya setiap bohong itu pasti akan ditulis sebagai kebohongan, sehingga seseorang perempuan yang berbohong akan disebut sebagai tukang bohong.\""
            },
            {
                "number": 4238,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ حَبِيبٍ رَجُلٍ مِنْ الْأَنْصَارِ عَنْ مَوْلَاةٍ لَهُمْ يُقَالُ لَهَا لَيْلَى تُحَدِّثُ عَنْ جَدَّتِي وَهِيَ أُمُّ عُمَارَةَ بِنْتُ كَعْبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا فَقَرَّبَتْ إِلَيْهِ طَعَامًا فَقَالَ لَهَا كُلِي فَقَالَتْ إِنِّي صَائِمَةٌ فَقَالَ إِنَّ الْمَلَائِكَةَ تُصَلِّي عَلَى الصَّائِمِ إِذَا أُكِلَ عِنْدَهُ حَتَّى يَفْرُغُوا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Habib] seorang laki-laki Anshar, dari budak mereka yang biasa disebut dengan [Laila] dia menceritakan dari nenekku [Ummu Amarah binti Ka'b] bahwa Rasulullah shallallahu 'alaihi wasallam menemuinya, kemudian dia mendekatkan makanan kepada beliau, beliau lalu bersabda kepadanya: \"Makanlah.\" Ummu Amarah berkata, \"Sesungguhnya aku sedang berpuasa, \" maka beliau bersabda: \"Sesungguhnya Malaikat mendo'akan orang yang berpuasa, ketika di sisinya ada orang yang makan hingga (orang yang makan itu) selesai.\""
            },
            {
                "number": 4239,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ حَبِيبِ بْنِ زَيْدٍ الْأَنْصَارِيِّ عَنْ امْرَأَةٍ يُقَالُ لَهَا لَيْلَى عَنْ أُمِّ عُمَارَةَ قَالَتْأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرَّبْنَا إِلَيْهِ طَعَامًا فَكَانَ بَعْضُ مَنْ عِنْدَهُ صَائِمًا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُكِلَ عِنْدَ الصَّائِمِ الطَّعَامُ صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ",
                "id": "Telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Syu'bah] dari [Habib bin Zaid Al Anshari] dari seorang wanita yang dipanggil dengan sebutan [Laila] dari [Ummu Imarah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam menemui kami, maka kami pun menyediakan makanan untuk beliau, sementara sebagian orang yang ada di sisi beliau sedang berpuasa. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Jika ada makanan yang dimakan di sampingnya orang-orang yang berpuasa, maka para Malaikat akan bershalawat kepadanya.\""
            },
            {
                "number": 4240,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو قَالَ حَدَّثَنَا زُهَيْرٌ يَعْنِي ابْنَ مُحَمَّدٍ الْخُرَاسَانِيَّ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ يَعْنِي ابْنَ عَقِيلِ بْنِ أَبِي طَالِبٍ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ طَلْحَةَ عَنْ عَمِّهِ عِمْرَانَ بْنِ طَلْحَةَ عَنْ أُمِّهِ حَمْنَةَ بِنْتِ جَحْشٍ قَالَتْكُنْتُ أُسْتَحَاضُ حَيْضَةً شَدِيدَةً كَثِيرَةً فَجِئْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْتَفْتِيهِ وَأُخْبِرُهُ فَوَجَدْتُهُ فِي بَيْتِ أُخْتِي زَيْنَبَ بِنْتِ جَحْشٍ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ لِي إِلَيْكَ حَاجَةً فَقَالَ وَمَا هِيَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُسْتَحَاضُ حَيْضَةً كَثِيرَةً شَدِيدَةً فَمَا تَرَى فِيهَا قَدْ مَنَعَتْنِي الصَّلَاةَ وَالصِّيَامَ قَالَ أَنْعَتُ لَكِ الْكُرْسُفَ فَإِنَّهُ يُذْهِبُ الدَّمَ قَالَتْ هُوَ أَكْثَرُ مِنْ ذَلِكَ قَالَ فَتَلَجَّمِي قَالَتْ إِنَّمَا أَثُجُّ ثَجًّا فَقَالَ لَهَا سَآمُرُكِ بِأَمْرَيْنِ أَيَّهُمَا فَعَلْتِ فَقَدْ أَجْزَأَ عَنْكِ مِنْ الْآخَرِ فَإِنْ قَوِيتِ عَلَيْهِمَا فَأَنْتِ أَعْلَمُ فَقَالَ لَهَا إِنَّمَا هَذِهِ رَكْضَةٌ مِنْ رَكَضَاتِ الشَّيْطَانِ فَتَحَيَّضِي سِتَّةَ أَيَّامٍ أَوْ سَبْعَةً فِي عِلْمِ اللَّهِ ثُمَّ اغْتَسِلِي حَتَّى إِذَا رَأَيْتِ أَنَّكِ قَدْ طَهُرْتِ وَاسْتَيْقَنْتِ وَاسْتَنْقَأْتِ فَصَلِّي أَرْبَعًا وَعِشْرِينَ لَيْلَةً أَوْ ثَلَاثًا وَعِشْرِينَ لَيْلَةً وَأَيَّامَهَا وَصُومِي فَإِنَّ ذَلِكَ يُجْزِئُكِ وَكَذَلِكَ فَافْعَلِي فِي كُلِّ شَهْرٍ كَمَا تَحِيضُ النِّسَاءُ وَكَمَا يَطْهُرْنَ بِمِيقَاتِ حَيْضِهِنَّ وَطُهْرِهِنَّ وَإِنْ قَوِيتِ عَلَى أَنْ تُؤَخِّرِي الظُّهْرَ وَتُعَجِّلِي الْعَصْرَ فَتَغْتَسِلِينَ ثُمَّ تُصَلِّينَ الظُّهْرَ وَالْعَصْرَ جَمِيعًا ثُمَّ تُؤَخِّرِينَ الْمَغْرِبَ وَتُعَجِّلِينَ الْعِشَاءَ ثُمَّ تَغْتَسِلِينَ وَتَجْمَعِينَ بَيْنَ الصَّلَاتَيْنِ فَافْعَلِي وَتَغْتَسِلِينَ مَعَ الْفَجْرِ وَتُصَلِّينَ وَكَذَلِكَ فَافْعَلِي وَصَلِّي وَصُومِي إِنْ قَدَرْتِ عَلَى ذَلِكَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهَذَا أَعْجَبُ الْأَمْرَيْنِ إِلَيَّ",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin Amru] berkata, telah menceritakan kepada kami [Zuhair] -yakni Ibnu Muhammad Al Khurrasani, dari [Abdullah bin Muhammad] -yakni Ibnu Aqil bin Abu Thalib- dari [Ibrahim bin Muhammad bin Thalhah] dari pamannya [Imran bin Thalhah] dari Ibunya [Hamnah binti Jahsi] dia berkata, \"Aku berkata, \"Aku mengeluarkan darah istihadlah (darah penyakit yang keluar setelah selesai masa haid) dengan banyak sekali, maka aku datang menghadap Rasulullah shallallahu 'alaihi wasallam untuk meminta fatwa dan menceritakan hal itu kepadanya. Maka aku pun menemui beliau saat berada di rumah saudariku, Zainab binti Jahsy.\" Hamnah berkata, \"Lantas aku bertanya, \"Wahai Rasulullah, aku ada perlu dengan tuan.\" Beliau menjawab: \"Apa keperluanmu?\" Aku berkata, \"Wahai Rasulullah, aku mengeluarkan darah istihadlah banyak sekali, maka apa yang tuan sarankan kepadaku, karena dia telah menghalangiku dari melaksanakan sholat dan puasa?\" Beliau menjawab: \"Aku sarankan kepadamu untuk menggunakan kain kapas karena dia dapat mencegah keluarnya darah.\" Hamnah bertanya lagi, \"(Namun) darahnya lebih banyak keluar.\" Beliau menjawab: \"Maka balutlah tempat keluarnya darah.\" Hamnah berkata lagi, \"Darahnya keluar dengan deras!\" Beliau bersabda: \"Aku perintahkan kepadamu dua hal, mana saja kamu lakukan dari keduanya maka itu sudah sah bagimu (sudah mewakili dari yang lain), jika kamu mampu melakukan keduanya maka kamu lebih mengetahuinya.\" Kemudian beliau berkata kepadanya: \"Ini hanyalah penyakit dari setan, maka tetapkanlah masa haidmu enam atau tujuh hari menurut ilmu Allah, kemudian hendaklah kamu mandi, sehingga apabila kamu merasa sudah suci dan yakin untuk membersihkan diri, maka laksanakanlah sholat yang dua puluh empat atau dua puluh tiga hari dan malamnya, dan laksanakanlah puasa karena itu sudah sah bagimu. Dan lakukanlah pada setiap bulannya sebagaimana umumnya para wanita mengalami haid, masa haid mereka dan masa suci mereka, jika kamu mampu untuk mengakhirkan sholat zhuhur dan mensegerakan sholat ashar maka kamu mandi lalu melaksanakan sholat zhuhur dan ashar dengan menggabungnya, kemudian kamu akhirkan sholat Maghrib dan mensegerakan sholat Isya' lalu kamu mandi dan melaksanakan dua sholat (Maghrib dan Isya') dengan menggabungnya maka lakukanlah, kemudian kamu mandi pada waktu shubuh lalu laksanakan sholat shubuh, demikian juga jika kamu mampu, maka lakukanlah sholat dan puasa.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dan ini adalah dua hal yang paling mengagumkan bagiku.\""
            },
            {
                "number": 4241,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ طَلْحَةَ عَنْ عَمِّهِ عِمْرَانَ بْنِ طَلْحَةَ عَنْ أُمِّهِ حَمْنَةَ بِنْتِ جَحْشٍأَنَّهَا اسْتُحِيضَتْ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي اسْتَحَضْتُ حَيْضَةً مُنْكَرَةً شَدِيدَةً فَقَالَ لَهَا احْتَشِي كُرْسُفًا قَالَتْ إِنِّي أَشَدُّ مِنْ ذَلِكَ إِنِّي أَثُجُّ ثَجًّا قَالَ تَلَجَّمِي وَتَحَيَّضِي فِي كُلِّ شَهْرٍ فِي عِلْمِ اللَّهِ سِتَّةَ أَيَّامٍ أَوْ سَبْعَةً ثُمَّ اغْتَسِلِي غُسْلًا وَصَلِّي وَصُومِي ثَلَاثًا وَعِشْرِينَ أَوْ أَرْبَعًا وَعِشْرِينَ وَأَخِّرِي الظُّهْرَ وَقَدِّمِي الْعَصْرَ وَاغْتَسِلِي لَهُمَا غُسْلًا وَأَخِّرِي الْمَغْرِبَ وَقَدِّمِي الْعِشَاءَ وَاغْتَسِلِي لَهُمَا غُسْلًا وَهَذَا أَحَبُّ الْأَمْرَيْنِ إِلَيَّ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Syarik bin Abdullah] dari [Abdullah bin Muhammad bin Aqil] dari [Ibrahim bin Muhammad bin Thalhah] dari pamannya [Imran bin Thalhah] dari ibunya [Hamnah binti Jahsi] bahwa dia mengeluarkan darah istihadlah pada masa Rasulullah shallallahu 'alaihi wasallam, maka dia mendatangi Rasulullah shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, sesungguhnya aku sedang istihadlah dengan mengeluarkan darah yang deras?\" maka beliau bersabda kepadanya: \"Balutlah dengan kapas.\" Hamnah berkata, \"Bahkan darahnya lebih dari itu, sesungguhnya ia keluar dengan deras.\" Beliau bersabda: \"Balutlah tempat keluarnya darah dengan kapas, dan tetapkanlah masa haidmu enam atau tujuh hari menurut ilmu Allah kemudian hendaklah kamu mandi lalu laksanakanlah sholat dan puasa yang dua puluh tiga atau dua puluh empat harinya. Kemudian kamu mandi dan sholat dengan mengakhirkan sholat zhuhur dan mensegerakan sholat ashar, lalu kamu mandi lagi untuk mengerjakan sholat dengan mengakhirkan sholat Maghrib dan mensegerakan sholat Isya' dengan satu kali mandi.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dan ini adalah dua hal yang paling mengagumkan bagiku.\""
            },
            {
                "number": 4242,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ عَنِ الْقَاسِمِ بْنِ غَنَّامٍ عَنْ أَهْلِ بَيْتِهِ عَنْ جَدَّتِهِ أُمِّ فَرْوَةَ أَنَّهَاسَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَأَلَهُ رَجُلٌ عَنْ أَفْضَلِ الْأَعْمَالِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةُ لِأَوَّلِ وَقْتِهَا",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Abdullah bin Umar] dari [Qasim bin Ghannam] dari [anggota keluarganya] dari neneknya [Ummu Farwah] bahwa dia telah mendengar Rasulullah shallallahu 'alaihi wasallam, ditanya oleh seorang lelaki tentang amalan yang paling utama, maka Rasulullah shallallahu 'alaihi wasallam menjawab: \"sholat pada awal waktunya.\""
            },
            {
                "number": 4243,
                "arab": "حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ قَالَ حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أُمِّ كُرْزٍ الْخُزَاعِيَّةِ قَالَتْأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِغُلَامٍ فَبَالَ عَلَيْهِ فَأَمَرَ بِهِ فَنُضِحَ وَأُتِيَ بِجَارِيَةٍ فَبَالَتْ عَلَيْهِ فَأَمَرَ بِهِ فَغُسِلَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar Al Hanafi] berkata, telah menceritakan kepada kami [Usamah bin Zaid] dari ['Amru bin Syu'aib] dari [Ummu Kurz Al Khuzaiyah] dia berkata, didatangkan kepada Nabi shallallahu 'alaihi wasallam bayi laki-laki, lalu bayi tersebut mengencingi beliau, maka beliau menyuruhnya untuk memerciki sisa kencingnya. Dan dihadapkan juga seorang bayi perempuan kepada Nabi shallallahu 'alaihi wasallam, lalu bayi tersebut mengencingi beliau, maka beliau menyuruh untuk mencucinya.\""
            },
            {
                "number": 4244,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي مَرْيَمَ الْغَسَّانِيُّ قَالَ حَدَّثَنَا أَبُو الْأَحْوَصِ حَكِيمُ بْنُ عُمَيْرٍ وَحَبِيبُ بْنُ عُبَيْدٍ عَنْ أَبِي الدَّرْدَاءِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَدَعْ رَجُلٌ مِنْكُمْ أَنْ يَعْمَلَ لِلَّهِ أَلْفَ حَسَنَةٍ حِينَ يُصْبِحُ يَقُولُ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ مِائَةَ مَرَّةٍ فَإِنَّهَا أَلْفُ حَسَنَةٍ فَإِنَّهُ لَا يَعْمَلُ إِنْ شَاءَ اللَّهُ مِثْلَ ذَلِكَ فِي يَوْمِهِ مِنْ الذُّنُوبِ وَيَكُونُ مَا عَمِلَ مِنْ خَيْرٍ سِوَى ذَلِكَ وَافِرًا",
                "id": "Telah menceritakan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami [Abu Bakar bin Abdullah bin Abu Maryam Al Ghassani] berkata, telah menceritakan kepada kami [Abu Al Ahwash Hakim bin Umair] dan [Habib bin Ubaid] dari [Abu Darda'] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian meninggalkan untuk beramal karena Allah pada waktu pagi dengan pahala seribu kebaikan; mengucapkan SUBHAANALLAH WABIHAMDIHI sebanyak seratus kali, maka ia telah mendapatkan seribu kebaikan. Insyaallah ia tidak akan melakukan dosa sebanyak itu (maksudnya seribu dosa) dalam seharinya, dan kebaikan yang dilakukannya justru lebih melimpah dari dosa yang dilakukannya.\""
            },
            {
                "number": 4245,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ قَالَ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي مَرْيَمَ قَالَ حَدَّثَنِي حُمَيْدُ بْنُ عُقْبَةَ بْنِ رُومَانَ عَنْ أَبِي الدَّرْدَاءِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ زَحْزَحَ عَنْ طَرِيقِ الْمُسْلِمِينَ شَيْئًا يُؤْذِيهِمْ كَتَبَ اللَّهُ لَهُ بِهِ حَسَنَةً وَمَنْ كُتِبَ لَهُ عِنْدَهُ حَسَنَةٌ أَدْخَلَهُ اللَّهُ بِهَا الْجَنَّةَ",
                "id": "Telah menceritakan kepada kami [Abu Al Mughirah] berkata, telah menceritakan kepada kami [Abu Bakar bin Abu Maryam] berkata, telah menceritakan kepadaku [Humaid bin Uqbah bin Ruman] dari [Abu Darda'] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Barangsiapa membuang sesuatu yang mengganggu jalan kaum muslimin maka Allah mencatat baginya satu kebaikan. Dan barangsiapa yang Allah catat satu kebaikan baginya di sisi-Nya maka Allah akan memasukkan dengannya ke Surga.\""
            },
            {
                "number": 4246,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ قَالَ حَدَّثَنَا صَفْوَانُ قَالَ حَدَّثَنِي بَعْضُ الْمَشْيَخَةِ عَنْ أَبِي إِدْرِيسَ السَّكُونِيِّ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِي الدَّرْدَاءِ قَالَأَوْصَانِي خَلِيلِي أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِثَلَاثٍ لَا أَدَعُهُنَّ لِشَيْءٍ أَوْصَانِي بِصِيَامِ بِثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَأَنْ لَا أَنَامَ إِلَّا عَلَى وِتْرٍ وَسُبْحَةِ الضُّحَى فِي الْحَضَرِ وَالسَّفَرِ",
                "id": "Telah menceritakan kepada kami [Abu Al Mughirah] berkata, telah menceritakan kepada kami [Shafwan] berkata, telah menceritakan kepadaku [sebagian Syaikh] dari [Abu Idris As Sakuni] dari [Jubair bin Nufair] dari [Abu Darda'] dia berkata, \"Kekasihkau, Abul Qasim shallallahu 'alaihi wasallam, memberiku nasihat dengan tiga hal, yang aku tidak akan meninggalkannya. Beliau nasihatkan kepadaku untuk puasa tiga hari setiap bulan, agar aku tidak tidur kecuali setelah melaksanakan sholat witir dan untuk selalu melaksankan sholat sunnah dluha baik dalam keadaan mukim atau safar.\""
            },
            {
                "number": 4247,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ حَدَّثَنَا أَبُو بَكْرٍ عَنْ ضَمْرَةَ بْنِ حَبِيبٍ عَنْ أَبِي الدَّرْدَاءِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ اللَّهَ تَصَدَّقَ عَلَيْكُمْ بِثُلُثِ أَمْوَالِكُمْ عِنْدَ وَفَاتِكُمْ",
                "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah menceritakan kepada kami [Abu Bakar] dari [Dlamrah bin Habib] dari [Abu Darda'] dari Rasulullah shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Sesungguhnya Allah bersedekah kepada kalian dengan sepertiga harta kalian ketika kalian wafat.\""
            },
            {
                "number": 4248,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ قَالَ حَدَّثَنِي أَبُو بَكْرٍ عَنْ زَيْدِ بْنِ أَرْطَاةَ عَنْ بَعْضِ إِخْوَانِهِ عَنْ أَبِي الدَّرْدَاءِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ شَيْءٍ يَنْقُصُ إِلَّا الشَّرَّ فَإِنَّهُ يُزَادُ فِيهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Mush'ab] berkata, telah menceritakan kepadaku [Abu Bakar] dari [Zaid bin Arthah] dari [sebagian saudaranya] dari [Abu Darda'] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Setiap sesuatu pasti akan berkurang kecuali kejahatan, ia akan terus bertambah.\""
            },
            {
                "number": 4249,
                "arab": "حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنِي أَبِي عَنْ أَبِيهِ قَالَ حَدَّثَنِي أَخٌ لِعَدِيِّ بْنِ أَرْطَاةَ عَنْ رَجُلٍ عَنْ أَبِي الدَّرْدَاءِ قَالَعَهِدَ إِلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ أَخْوَفَ مَا أَخَافُ عَلَيْكُمْ الْأَئِمَّةُ الْمُضِلُّونَ",
                "id": "Telah menceritakan kepada kami [Ya'qub] berkata, telah menceritakan kepadaku [ayahku] dia berkata, telah menceritakan kepadaku [saudaranya Adi bin Arthah] dari [seorang laki-laki] dari [Abu Darda] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah mewasiatkan kepada kami: \"Sesuatu yang paling aku takutkan atas kalian adalah para pemimpin yang menyesatkan.\""
            },
            {
                "number": 4250,
                "arab": "حَدَّثَنَا هَيْثَمُ بْنُ خَارِجَةَ قَالَ أَخْبَرَنَا أَبُو الرَّبِيعِ سُلَيْمَانُ بْنُ عُتْبَةَ السُّلَمِيُّ عَنْ يُونُسَ بْنِ مَيْسَرَةَ بْنِ حَلْبَسٍ عَنْ أَبِي إِدْرِيسَ عَنْ أَبِي الدَّرْدَاءِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ غُفِرَ لَكُمْ مَا تَأْتُونَ إِلَى الْبَهَائِمِ لَغُفِرَ لَكُمْ كَثِيرًا",
                "id": "Telah menceritakan kepada kami [Husyaim bin Kharijah] berkata, telah mengabarkan kepada kami [Abu Ar Rabi' Sulaiman bin Utbah As Sulamii] dari [Yunus bin Maisarah bin Halbas] dari [Abu Idris] dari [Abu Darda'] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seandainya kalian mendatangi hewan dan kalian akan diampuni, maka pasti kalian akan banyak diampuni.\""
            },
            {
                "number": 4251,
                "arab": "حَدَّثَنَا هَيْثَمٌ وَسَمِعْتُهُ أَنَا مِنْهُ قَالَ حَدَّثَنَا أَبُو الرَّبِيعِ عَنْ يُونُسَ عَنْ أَبِي إِدْرِيسَ عَنْ أَبِي الدَّرْدَاءِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَلَقَ اللَّهُ آدَمَ حِينَ خَلَقَهُ فَضَرَبَ كَتِفَهُ الْيُمْنَى فَأَخْرَجَ ذُرِّيَّةً بَيْضَاءَ كَأَنَّهُمْ الذَّرُّ وَضَرَبَ كَتِفَهُ الْيُسْرَى فَأَخْرَجَ ذُرِّيَّةً سَوْدَاءَ كَأَنَّهُمْ الْحُمَمُ فَقَالَ لِلَّذِي فِي يَمِينِهِ إِلَى الْجَنَّةِ وَلَا أُبَالِي وَقَالَ لِلَّذِي فِي كَفِّهِ الْيُسْرَى إِلَى النَّارِ وَلَا أُبَالِي",
                "id": "Telah menceritakan kepada kami [Haitsam] dan aku telah mendengar darinya, dia berkata, telah menceritakan kepada kami [Abu Ar Rabi'] dari [Yunus] dari [Abu Idris] dari [Abu Darda'] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ketika Allah menciptakan Adam, Allah memukul bahunya yang sebelah kanan, maka keluarlah keturunan berkulit putih seperti molekul, dan memukul bahu bagian kirinya kemudian keluar keturunan yang berkulit hitam seperti arang, maka Allah berkata kepada yang di bagian kanannya, 'Masuklah ke Surga dan Aku tidak perduli'. Kemudian berkata kepada yang di bagian kirinya, 'Masuklah ke dalam Neraka dan Aku tidak perduli'.\""
            },
            {
                "number": 4252,
                "arab": "حَدَّثَنَا هَيْثَمٌ قَالَ أَخْبَرَنَا أَبُو الرَّبِيعِ عَنْ يُونُسَ عَنْ أَبِي إِدْرِيسَ عَنْ أَبِي الدَّرْدَاءِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ تَعَالَى يَقُولُ يَوْمَ الْقِيَامَةِ لِآدَمَ عَلَيْهِ السَّلَام قُمْ فَجَهِّزْ مِنْ ذُرِّيَّتِكَ تِسْعَ مِائَةٍ وَتِسْعَةً وَتِسْعِينَ إِلَى النَّارِ وَوَاحِدًا إِلَى الْجَنَّةِ فَبَكَى أَصْحَابُهُ وَبَكَوْا ثُمَّ قَالَ لَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ارْفَعُوا رُءُوسَكُمْ فَوَالَّذِي نَفْسِي بِيَدِهِ مَا أُمَّتِي فِي الْأُمَمِ إِلَّا كَالشَّعْرَةِ الْبَيْضَاءِ فِي جِلْدِ الثَّوْرِ الْأَسْوَدِ فَخَفَّفَ ذَلِكَ عَنْهُمْ",
                "id": "Telah menceritakan kepada kami [Haitsam] berkata, telah mengabarkan kepada kami [Abu Ar Rabi'] dari [Yunus] dari [Abu Idris] dari [Abu Darda'] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya Allah Ta'ala pada hari Qiyamat berkata kepada Adam Alaihis Salam, 'Bangkit dan siapkan dari keturunanmu, sembilan ratus sembilan puluh sembilan orang untuk masuk ke dalam Neraka dan satu masuk Surga.\" Maka para sahabatpun menangis, lantas Rasulullah shallallahu 'alaihi wasallam bersabda kepada mereka: \"Angkatlah kepala kalian, maka demi Dzat yang jiwaku ada di tangan-Nya, tidaklah ummatku dari ummat-ummat yang lain kecuali seperti seutas rambut putih yang ada di kulit seekor sapi hitam, \" dan beliaupun meredakan tangis mereka.\""
            },
            {
                "number": 4253,
                "arab": "حَدَّثَنَا هَيْثَمٌ قَالَ حَدَّثَنَا أَبُو الرَّبِيعِ عَنْ يُونُسَ عَنْ أَبِي إِدْرِيسَ عَنْ أَبِي الدَّرْدَاءِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِكُلِّ شَيْءٍ حَقِيقَةٌ وَمَا بَلَغَ عَبْدٌ حَقِيقَةَ الْإِيمَانِ حَتَّى يَعْلَمَ أَنَّ مَا أَصَابَهُ لَمْ يَكُنْ لِيُخْطِئَهُ وَمَا أَخْطَأَهُ لَمْ يَكُنْ لِيُصِيبَهُقَالَ أَبُو عَبْد الرَّحْمَنِ حَدَّثَنِي الْهَيْثَمُ بْنُ خَارِجَةَ عَنْ أَبِي الرَّبِيعِ بِهَذِهِ الْأَحَادِيثِ كُلِّهَا إِلَّا أَنَّهُ أَوْقَفَ مِنْهَا حَدِيثَ لَوْ غُفِرَ لَكُمْ مَا تَأْتُونَ إِلَى الْبَهَائِمِ وَقَدْ حَدَّثَنَاهُ أَبِي عَنْهُ مَرْفُوعًا",
                "id": "Telah menceritakan kepada kami [Haitsam] berkata, telah menceritakan kepada kami [Abu Ar Rabi'] dari [Yunus] dari [Abu Idris] dari [Abu Darda'] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Setiap sesuatu ada hakekatnya, dan seorang hamba tidak akan sampai pada hakekat Iman sehingga dia mengetahui bahwa apa saja yang telah ditetapkannya, tidak mungkin akan menyalahinya, dan apa yang tidak mengenainya tidak mungkin akan menimpanya.\" Abu Abdurrahman berkata; telah menceritakan kepadaku [Al Haitsam bin Kharijah] dari [Abu Rabi'] dengan hadits-hadits ini semuanya, hanya saja ia me-mauqufkan (sampai kepada sahabat) hadits berikut ini, \"Seandainya kalian mendatangi hewan kalian akan diampuni, \" dan bapakku telah menceritakan hadits ini kepada kami secara marfu' (sampai kepada Nabi).\""
            },
            {
                "number": 4254,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ زَائِدَةَ بْنِ قُدَامَةَ وَوَكِيعٌ قَالَ حَدَّثَنِي زَائِدَةُ بْنُ قُدَامَةَ عَنِ السَّائِبِ قَالَ وَكِيعٌ ابْنِ حُبَيْشٍ الْكَلَاعِيِّ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ الْيَعْمُرِيِّ قَالَقَالَ لِي أَبُو الدَّرْدَاءِ أَيْنَ مَسْكَنُكَ قَالَ قُلْتُ فِي قَرْيَةٍ دُونَ حِمْصَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ ثَلَاثَةٍ فِي قَرْيَةٍ فَلَا يُؤَذَّنُ وَلَا تُقَامُ فِيهِمْ الصَّلَوَاتُ إِلَّا اسْتَحْوَذَ عَلَيْهِمْ الشَّيْطَانُ عَلَيْكَ بِالْجَمَاعَةِ فَإِنَّمَا يَأْكُلُ الذِّئْبُ الْقَاصِيَةَقَالَ ابْنُ مَهْدِيٍّ قَالَ السَّائِبُ يَعْنِي بِالْجَمَاعَةِ فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Zaidah bin Qudamah] dan [Waki'] berkata, telah menceritakan kepadaku [Zaidah bin Qudamah] dari [As Saib], [Waki' bin Hubais Al Kala'i] berkata, dari [Ma'dan bin Abu Thalhah Al Ya'marii] berkata, \" [Abu Darda'] berkata kepadaku, \"Dimanakah tempat tinggalmu?\" Ma'dan berkata, \"Aku berkata, \"Aku tinggal di kampung, bukan di kota.\" Abu Darda berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah tiga (keluarga) di sebuah perkampungan yang tidak dikumandangkan (adzan) dan tidak pula didirikan sholat (lima waktu) melainkan setan akan menguasai mereka, hendaklah kamu berjama'ah, hanyasanya serigala akan memangsa (kambing) yang hidup sendirian.\" [Ibnu Mahdi] berkata; [As Tsaib] berkata; \"Yaitu dengan sholat berjama'ah.\""
            },
            {
                "number": 4255,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنِ الْحَكَمِ قَالَ سَمِعْتُ أَبَا عُمَرَ الصِّينِيَّ عَنْ أَبِي الدَّرْدَاءِأَنَّهُ إِذَا كَانَ نَزَلَ بِهِ ضَيْفٌ قَالَ يَقُولُ لَهُ أَبُو الدَّرْدَاءِ مُقِيمٌ فَنُسْرِجُ أَوْ ظَاعِنٌ فَنَعْلِفُ قَالَ فَإِنْ قَالَ لَهُ ظَاعِنٌ قَالَ لَهُ مَا أَجِدُ لَكَ شَيْئًا خَيْرًا مِنْ شَيْءٍ أَمَرَنَا بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْنَا يَا رَسُولَ اللَّهِ ذَهَبَ الْأَغْنِيَاءُ بِالْأَجْرِ يَحُجُّونَ وَلَا نَحُجُّ وَيُجَاهِدُونَ وَلَا نُجَاهِدُ وَكَذَا وَكَذَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أَدُلُّكُمْ عَلَى شَيْءٍ إِنْ أَخَذْتُمْ بِهِ جِئْتُمْ مِنْ أَفْضَلِ مَا يَجِيءُ بِهِ أَحَدٌ مِنْهُمْ أَنْ تُكَبِّرُوا اللَّهَ أَرْبَعًا وَثَلَاثِينَ وَتُسَبِّحُوهُ ثَلَاثًا وَثَلَاثِينَ وَتَحْمَدُوهُ ثَلَاثًا وَثَلَاثِينَ فِي دُبُرِ كُلِّ صَلَاةٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] berkata, aku mendengar [Abu Umar As Shini] dari [Abu Darda'] bahwa jika dia kedatangan tamu, Abu Darda' berkata kepadanya, \"Apakah kamu bermukim, maka aku akan memberimu jamuan? Ataukah langsung berangkat, sehingga kami akan memberimu bekal?\" Jika tamu tersebut menjawab, \"Melanjutkan perjalanan, \" maka Abu Darda' berkata kepadanya, \"Aku tidak mendapati pada dirimu kebaikan pun dari apa yang pernah Rasulullah shallallahu 'alaihi wasallam perintahkan. Kami berkata, \"Wahai Rasulullah, orang-orang kaya telah pergi dengan membawa pahala, mereka berhaji sedangkan kami tidak bisa berhaji, mereka berjihad sedangkan kami tidak mampu untuk berangkat jihad, seperti ini dan seperti ini, maka beliau pun bersabda: \"Maukah kalian aku tunjukkan terhadap sesuatu, jika kalian melakukannya maka kalian mendapatkan keutamaan yang lebih dari apa yang mereka kerjakan? Hendaknya kalian bertakbir kepada Allah sebanyak tiga puluh empat kali, bertasbih tiga puluh tiga kali dan bertahmid tiga puluh tiga kali di setiap selesai sholat.\""
            },
            {
                "number": 4256,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ الْقَاسِمَ بْنَ أَبِي بَزَّةَ عَنْ عَطَاءٍ الْكَيْخَارَانِيِّ عَنْ أُمِّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا مِنْ شَيْءٍ أَثْقَلُ فِي الْمِيزَانِ مِنْ خُلُقٍ حَسَنٍحَدَّثَنَاه يَزِيدُ قَالَ أَخْبَرَنَا شُعْبَةُ عَنِ الْكَيْخَارَانِيِّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] berkata, aku mendengar [Al Qasim bin Abu Bazzah] dari [Atha' Al Kaikharani] dari [Ummu Darda'] dari [Abu Darda'] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada sesuatu yang memberatkan dalam timbangan selain akhlak yang bagus.\" Telah menceritakan kepada kami [Yazid] berkata; telah mengabarkan kepada kami [Syu'bah] dari [Al Kaikharani].\""
            },
            {
                "number": 4257,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ بْنِ خُمَيْرٍ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ جُبَيْرِ بْنِ نُفَيْرٍ يُحَدِّثُ عَنْ أَبِيهِ عَنْ أَبِي الدَّرْدَاءِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ مَرَّ بِامْرَأَةٍ مُجِحٍّ عَلَى بَابِ فُسْطَاطٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَلَّهُ يُرِيدُ أَنْ يُلِمَّ بِهَا فَقَالُوا نَعَمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ هَمَمْتُ أَنْ أَلْعَنَهُ لَعْنًا يَدْخُلُ مَعَهُ قَبْرَهُ كَيْفَ يُوَرِّثُهُ وَهُوَ لَا يَحِلُّ لَهُ كَيْفَ يَسْتَخْدِمُهُ وَهُوَ لَا يَحِلُّ لَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Yazid bin Khumair] berkata, aku mendengar [Abdurrahman bin Jubair bin Nufair] menceritakan dari [ayahnya] dari [Abu Darda'] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau melewati seorang wanita yang hamil berada di depan pintu tenda besar. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Mungkin (seseorang) Telah menggaulinya.\" Mereka menjawab, \"Benar.\" Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Sungguh, aku ingin melaknat (seseorang) dengan laknat yang akan masuk bersamanya ke dalam kubur. Bagaimana mungkin dia menggaulinya padahal ia tidak halal baginya, bagaimana mungkin dia memanfaatkannya padahal ia tidak halal baginya.\""
            },
            {
                "number": 4258,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ عَنْ ذَكْوَانَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ شَيْخٍ عَنْ أَبِي الدَّرْدَاءِأَنَّهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ هَذِهِ الْآيَةِ{ الَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ لَهُمْ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا }قَالَ الرُّؤْيَا الصَّالِحَةُ يَرَاهَا الْمُسْلِمُ أَوْ تُرَى لَهُحَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ ابْنِ الْمُنْكَدِرِ سَمِعَهُ مِنْ عَطَاءِ بْنِ يَسَارٍ وَعَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ أَبِي صَالِحٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ رَجُلٍ مِنْ أَهْلِ مِصْرَ سَأَلْتُ أَبَا الدَّرْدَاءِ فَذَكَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَكَرَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Sulaiman] dari [Dzakwan] dari [Atha' bin Yasar] dari [seorang Syaikh] dari [Abu Darda'] bahwa dia bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai ayat ini: '((Yaitu) orang-orang yang beriman dan mereka selalu bertaqwa. Bagi mereka berita gembira di dalam kehidupan di dunia) ' (Qs. Yunus: 63-64), Beliau bersabda: \"Yaitu mimpi yang benar dari seorang Muslim, atau yang dimimpikan oleh orang Muslim.\" Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Ibnu Munkadir] dia telah mendengarnya dari [Atha' bin Yasar] dan [Abdul Aziz bin Rufai'] dari [Abu Shalih] dari [Atha' bin Yasar] dari [seorang laki-laki] penduduk Mesir, \"Aku bertanya kepada [Abu Darda'], kemudian dia menyebutkannya dari Nabi shallallahu 'alaihi wasallam, lalu ia menyebutkan (riwayat) yang semisalnya.\""
            },
            {
                "number": 4259,
                "arab": "حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو مَعْشَرٍ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ زِيَادِ بْنِ أَبِي زِيَادٍ مَوْلَى ابْنِ عَيَّاشٍ عَنْ أَبِي الدَّرْدَاءِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أُخْبِرُكُمْ بِخَيْرِ أَعْمَالِكُمْ وَأَزْكَاهَا عِنْدَ مَلِيكِكُمْ وَأَرْفَعِهَا لِدَرَجَاتِكُمْ وَخَيْرٍ لَكُمْ مِنْ إِعْطَاءِ الذَّهَبِ وَالْوَرِقِ وَخَيْرٍ لَكُمْ مِنْ أَنْ تَلْقَوْا عَدُوَّكُمْ فَتَضْرِبُوا رِقَابَهُمْ وَيَضْرِبُونَ رِقَابَكُمْ ذِكْرُ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Hajjaj bin Muhammad] telah menceritakan kepada kami [Abu Ma'syar] dari [Musa bin Uqbah] dari [Ziyad bin Abu Ziyad] bekas budak Ibnu Ayyas, dari [Abu Darda'] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidakkah kalian mau aku kabarkan amalan yang paling baik buat kalian amalkan? Dan yang paling bersih di sisi Raja (Allah) kalian, yang bisa mengangkat derajat kalian, lebih baik dari emas dan harta yang kalian berikan, dan lebih baik dari melawan musuh hingga kalian bisa menebas lutut musuh kalian, atau kalian ditebas lutut kalian oleh musuh kalian? Yaitu berdzikir kepada Allah Azza Wa Jalla.\""
            },
            {
                "number": 4260,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ ثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ رَجُلٍ مِنْ أَهْلِ مِصْرَ عَنْ أَبِي الدَّرْدَاءِ قَالَأَتَاهُ رَجُلٌ فَقَالَ مَا تَقُولُ فِي قَوْلِ اللَّهِ{ لَهُمْ الْبُشْرَى فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ }قَالَ لَقَدْ سَأَلْتَ عَنْ شَيْءٍ مَا سَمِعْتُ أَحَدًا سَأَلَ عَنْهُ بَعْدَ رَجُلٍ سَأَلَ عَنْهُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بُشْرَاهُمْ فِي الْحَيَاةِ الدُّنْيَا الرُّؤْيَا الصَّالِحَةُ يَرَاهَا الْمُسْلِمُ أَوْ تُرَى لَهُ وَبُشْرَاهُمْ فِي الْآخِرَةِ الْجَنَّةُ",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] berkata, telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Atha' bin Yasar] dari [seorang laki-laki] penduduk Mesir, dari [Abu Darda'] dia berkata, \"Seorang laki-laki datang kepadanya dan berkata, \"Apa pendatamu dengan firman Allah: '(Bagi mereka berita gembira di dalam kehidupan di dunia dan Akhirat) ' Abu Darda' berkata, \"Sungguh kamu telah menanyakan sesuatu yang belum pernah aku mendengar seorang pun bertanya seperti itu, setelah laki-laki yang bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang hal itu, beliau bersabda: \"Bagi mereka berita gembira di dalam kehidupan dunia, yaitu mimpi benarnya seorang muslim atau yang dimimpikan oleh seorang Muslim, sedangkan kabar gembira dikehidupan akhirat adalah dengan surga.\""
            },
            {
                "number": 4261,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا سُفْيَانُ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ قَالَكَانَ فِينَا رَجُلٌ فَذَكَرَ الْحَدِيثَ قَالَ فَرَحَلَ إِلَى أَبِي الدَّرْدَاءِ فَقَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْوَالِدُ أَوْسَطُ أَبْوَابِ الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Sufyan] dari ['Atha' bin As Saib] dari [Abu Abdurrahman As Sulami] berkata, \"Di antara kami ada seorang laki-laki……kemudian dia menyebutkan hadits. Dia berkata, \"Kemudian dia pergi menemui [Abu Darda'], lalu Abu Darda' berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Orang tua ibarat pusat dari pintu-pintu surga.\""
            },
            {
                "number": 4262,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ زَيْدِ بْنِ أَسْلَمَ قَالَكَانَ عَبْدُ الْمَلِكِ بْنُ مَرْوَانَ يُرْسِلُ إِلَى أُمِّ الدَّرْدَاءِ فَتَبِيتُ عِنْدَ نِسَائِهِ وَيَسْأَلُهَا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقَامَ لَيْلَةً فَدَعَا خَادِمَهُ فَأَبْطَأَتْ عَلَيْهِ فَلَعَنَهَا فَقَالَتْ لَا تَلْعَنْ فَإِنَّ أَبَا الدَّرْدَاءِ حَدَّثَنِي أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّعَّانِينَ لَا يَكُونُونَ يَوْمَ الْقِيَامَةِ شُهَدَاءَ وَلَا شُفَعَاءَ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] telah menceritakan kepada kami [Ma'mar] dari [Zaid bin Aslam] berkata, Abdul Malik bin Marwan mengutus utusan kepada [Ummu Darda'], utusan itu kemudian bermalam di rumah isteri-isterinya dan menanyakan perihal Nabi shallallahu 'alaihi wasallam. Zaid Bin Aslam berkata, \"Suatu malam Abdul Malik bangun dan memanggil pembantunya namun pembantunya terlambat datang kepadanya sehingga dia melaknatnya, maka Ummu Darda' berkata, \"Janganlah kamu melaknat, karena aku telah mendengar [Abu Darda'] menceritakan kepadaku, bahwa dia telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya orang-orang yang suka melaknat, mereka tidak akan menjadi saksi dan memberi syafaat pada hari kiyamat.\""
            },
            {
                "number": 4263,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ حَدَّثَنِي أَبُو الزَّاهِرِيَّةِ حُدَيْرُ بْنُ كُرَيْبٍ عَنْ كَثِيرِ بْنِ مُرَّةَ الْحَضْرَمِيِّ قَالَ سَمِعْتُ أَبَا الدَّرْدَاءِ يَقُولُسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفِي كُلِّ صَلَاةٍ قِرَاءَةٌ قَالَ نَعَمْ فَقَالَ رَجُلٌ مِنْ الْأَنْصَارِ وَجَبَتْ هَذِهِفَالْتَفَتَ إِلَيَّ أَبُو الدَّرْدَاءِ وَكُنْتُ أَقْرَبَ الْقَوْمِ مِنْهُ فَقَالَ يَا ابْنَ أَخِي مَا أَرَى الْإِمَامَ إِذَا أَمَّ الْقَوْمَ إِلَّا قَدْ كَفَاهُمْ",
                "id": "Telah menceritakan kepada kami [Zaid bin Khubab] telah menceritakan kepada kami [Mu'awiyah bin Shalih] telah menceritakan kepadaku [Abu Az Zahiriyyah Hudair bin Kuraib] dari [Katsir bin Murrah Al hadhrami] dia berkata, \"Aku mendengar [Abu Darda'] berkata, \"Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam, apakah disetiap sholat ada bacaan? Beliau menjawab: \"Ya, \" maka seorang laki-laki dari Anshar"
            },
            {
                "number": 4264,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا فُضَيْلٌ يَعْنِي ابْنَ غَزْوَانَ قَالَ سَمِعْتُ طَلْحَةَ بْنَ عُبَيْدِ اللَّهِ بْنِ كَرِيزٍ قَالَ سَمِعْتُ أُمَّ الدَّرْدَاءِ قَالَتْ سَمِعْتُ أَبَا الدَّرْدَاءِ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّهُ يُسْتَجَابُ لِلْمَرْءِ بِظَهْرِ الْغَيْبِ لِأَخِيهِ فَمَا دَعَا لِأَخِيهِ بِدَعْوَةٍ إِلَّا قَالَ الْمَلَكُ وَلَكَ بِمِثْلٍ",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Fudlail] -yakni Ibnu Ghazwan- berkata, aku mendengar [Thalhah bin ubaidhullah bin Kariz] berkata, aku telah mendengar [Ummu Darda'] berkata, \"Aku mendengar [Abu Darda'] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya akan dikabulkan do'a seseorang untuk saudaranya tanpa sepengetahuannya, tidaklah dia berdo'a untuk saudaranya dengan sebuah do'a kecuali pasti para Malaikat akan berkata, 'Dan bagimu yang semisalnya'.\""
            },
            {
                "number": 4265,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا عَبْدُ الْمَلِكِ عَنْ أَبِي الزُّبَيْرِ عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِوَكَانَتْ تَحْتَهُ أُمُّ الدَّرْدَاءِ فَأَتَاهُمْ فَوَجَدَ أُمَّ الدَّرْدَاءِ فَقَالَتْ لَهُ أَتُرِيدُ الْحَجَّ الْعَامَ فَقَالَ نَعَمْ قَالَتْ فَادْعُ لَنَا بِخَيْرٍ فَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ إِنَّ دَعْوَةَ الْمَرْءِ الْمُسْلِمِ مُسْتَجَابَةٌ لِأَخِيهِ بِظَهْرِ الْغَيْبِ عِنْدَ رَأْسِهِ مَلَكٌ مُوَكَّلٌ بِهِ كُلَّمَا دَعَا لِأَخِيهِ بِخَيْرٍ قَالَ آمِينَ وَلَكَ بِمِثْلٍقَالَ فَخَرَجْتُ إِلَى السُّوقِ فَلَقِيتُ أَبَا الدَّرْدَاءِ فَحَدَّثَنِي عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Abdul Malik] dari [Abu Zubair] dari [Shafwan bin Abdullah] -yang dia menanggung Ummu Darda', kemudian dia mendatangi mereka- dan mendapati Ummu Darda', maka [Ummu Darda'] berkata kepadanya, \"Apakah kamu hendak melaksanakan haji tahun ini?\" Dia menjawab, \"Ya.\" Ummu Darda' lalu berkata, \"Tolong do'akan kebaikan untuk kami, karena Nabi shallallahu 'alaihi wasallam pernah bersabda: \"Sesungguhnya do'anya seorang Muslim kepada saudaranya yang berada di tempat yang jauh adalah dikabulkan, dan di sisikepalanya ada para Malaikat yang ditugaskan kepadanya, setiap kali berdo'a kepada saudaranya dengan kebaikan para Malaikat berkata, 'Amiin, dan bagimu yang semisalnya'.\" Shafwan berkata, \"Kemudian aku keluar ke pasar dan bertemu dengan [Abu Darda'], lalu ia menceritakan kepadaku tentang hadits dari Nabi shallallahu 'alaihi wasallam seperti itu.\""
            },
            {
                "number": 4266,
                "arab": "حَدَّثَنَا سُفْيَانُ قَالَ أَبِي وَقُرِئَ عَلَى سُفْيَانَ سَمِعْتُ ابْنَ أَبِي حُسَيْنٍ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ حَدَّثَنَا سُفْيَانُ عَنِ ابْنِ أَبِي حُسَيْنٍ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَجْمَعْنَ جُوعًا وَكَذِبًا",
                "id": "Telah menceritakan kepada kami [Sufyan], ayahku berkata; dan dibacakan kepada [Sufyan]; aku mendengar [Ibnu Abu Husain] dari [Syahr bin Hausyab] dari [Asma' binti Yazid]. Telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Husain] dari [Syahr bin Hausyab] dari [Asma'], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kamu menggabungkan rasa lapar dan kedustaan.\""
            },
            {
                "number": 4267,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنِ ابْنِ أَبِي حُسَيْنٍ سَمِعَ شَهْرًا يَقُولُ سَمِعْتُ أَسْمَاءَ بِنْتَ يَزِيدَ إِحْدَى نِسَاءِ بَنِي عَبْدِ الْأَشْهَلِ تَقُولُمَرَّ بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ فِي نِسْوَةٍ فَسَلَّمَ عَلَيْنَا وَقَالَ إِيَّاكُنَّ وَكُفْرَ الْمُنَعَّمِينَ فَقُلْنَا يَا رَسُولَ اللَّهِ وَمَا كُفْرُ الْمُنَعَّمِينَ قَالَ لَعَلَّ إِحْدَاكُنَّ أَنْ تَطُولَ أَيْمَتُهَا بَيْنَ أَبَوَيْهَا وَتَعْنُسَ فَيَرْزُقَهَا اللَّهُ عَزَّ وَجَلَّ زَوْجًا وَيَرْزُقَهَا مِنْهُ مَالًا وَوَلَدًا فَتَغْضَبَ الْغَضْبَةَ فَرَاحَتْ تَقُولُ مَا رَأَيْتُ مِنْهُ يَوْمًا خَيْرًا قَطُّ وَقَالَ مَرَّةً خَيْرًا قَطُّ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Ibnu Abu Husain] dia mendengar [Syahr] berkata, aku mendengar dari [Asma' binti Yazid] salah seorang isteri bani Abdul Asyhal, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melewati kami yang sedang berkumpul bersama para wanita, kemudian beliau memberikan salam kepada kami seraya bersabda: \"Jauhilah oleh kalian kufrul Muna'amin, \" Maka kami bertanya, \"Wahai Rasulullah, apa itu kufrul Muna'amin?\" beliau menjawab: \"Mungkin salah seorang di antara kalian mengundur-undur masa perawannya di antara kedua orang tuanya, kemudian Allah memberinya seorang suami dan Allah beri rizki berupa harta dan anak. Kemudian ia marah dan pergi sambil berkata, 'Sungguh, sehari punaku tidak pernah melihatnya berbuat baik sama sekali.\" Dan sekali waktu ia menyebutkan, \"Kebaikan sama sekali.\""
            },
            {
                "number": 4268,
                "arab": "حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ حَدَّثَنَا ابْنُ أَبِي غَنِيَّةَ عَنْ مُحَمَّدِ بْنِ مُهَاجِرٍ عَنْ أَبِيهِ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَقْتُلُوا أَوْلَادَكُمْ سِرًّا فَإِنَّ قَتْلَ الْغَيْلِ يُدْرِكُ الْفَارِسَ فَيُدَعْثِرُهُ عَنْ ظَهْرِ فَرَسِهِ",
                "id": "Telah menceritakan kepada kami [Al Fadll bin Dukain] telah menceritakan kepada kami [Ibnu Abu Ghanayah] dari [Muhammad bin Muhajir] dari [ayahnya] dari [Asma' binti Yazid] dia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian membunuh anak-anak kalian dengan sembunyi-sembunyi, sesungguhnya ghilah dapat menjadikan seorang penunggang kuda menjadi lemah dan jatuh dari atas kuda.\" "
            },
            {
                "number": 4269,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا دَاوُدُ يَعْنِى ابْنَ يَزِيدَ الْأَوْدِيَّ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَصْلُحُ مِنْ الذَّهَبِ شَيْءٌ وَلَا بَصِيصُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid] telah menceritakan kepada kami [Daud] -yakni Ibnu Yazid Al Audi- dari [Syahr bin Hausyab] dari [Asma' binti Yazid] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada kebaikan sesuatupun dari emas dan tidak pula kilauannya.\""
            },
            {
                "number": 4270,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عَبْدُ الْحَمِيدِ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَ قَالَتْتُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدِرْعُهُ مَرْهُونَةٌحَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارٍ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَهْرَامَ الْفَزَارِيُّ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Abdul Hamid] dari [Syahr bin Hausyab] dari [Asma'] dia berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam wafat, baju besi beliau masih tergadaikan.\" Telah menceritakan kepada kami Abdullah telah menceritakan kepada kami [Muhammad bin Bakkar] telah menceritakan kepada kami [Abdul Hamid bin Bahram Al Fazari] dari [Syahr Bin Hausyab] dari [Asma' binti Yazid] dengan hadits yang semisalnya.\""
            },
            {
                "number": 4271,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ قَتَادَةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ قَالَتْكُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِهِ فَقَالَ إِذَا كَانَ قَبْلَ خُرُوجِ الدَّجَّالِ بِثَلَاثِ سِنِينَ حَبَسَتْ السَّمَاءُ ثُلُثَ قَطْرِهَا وَحَبَسَتْ الْأَرْضُ ثُلُثَ نَبَاتِهَا فَإِذَا كَانَتْ السَّنَةُ الثَّانِيَةُ حَبَسَتْ السَّمَاءُ ثُلُثَيْ قَطْرِهَا وَحَبَسَتْ الْأَرْضُ ثُلُثَيْ نَبَاتِهَا فَإِذَا كَانَتْ السَّنَةُ الثَّالِثَةُ حَبَسَتْ السَّمَاءُ قَطْرَهَا كُلَّهُ وَحَبَسَتْ الْأَرْضُ نَبَاتَهَا كُلَّهُ فَلَا يَبْقَى ذُو خُفٍّ وَلَا ظِلْفٍ إِلَّا هَلَكَ فَيَقُولُ الدَّجَّالُ لِلرَّجُلِ مِنْ أَهْلِ الْبَادِيَةِ أَرَأَيْتَ إِنْ بَعَثْتُ إِبِلَكَ ضِخَامًا ضُرُوعُهَا عِظَامًا أَسْنِمَتُهَا أَتَعْلَمُ أَنِّي رَبُّكَ فَيَقُولُ نَعَمْ فَتَمَثَّلُ لَهُ الشَّيَاطِينُ عَلَى صُورَةِ إِبِلِهِ فَيَتَّبِعُهُ وَيَقُولُ لِلرَّجُلِ أَرَأَيْتَ إِنْ بَعَثْتُ أَبَاكَ وَابْنَكَ وَمَنْ تَعْرِفُ مِنْ أَهْلِكَ أَتَعْلَمُ أَنِّي رَبُّكَ فَيَقُولُ نَعَمْ فَيُمَثِّلُ لَهُ الشَّيَاطِينَ عَلَى صُوَرِهِمْ فَيَتَّبِعُهُ ثُمَّ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبَكَى أَهْلُ الْبَيْتِ ثُمَّ رَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَبْكِي فَقَالَ مَا يُبْكِيكُمْ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا ذَكَرْتَ مِنْ الدَّجَّالِ فَوَاللَّهِ إِنَّ أَمَةَ أَهْلِي لَتَعْجِنُ عَجِينَهَا فَمَا تَبْلُغُ حَتَّى تَكَادَ تَفَتَّتُ مِنْ الْجُوعِ فَكَيْفَ نَصْنَعُ يَوْمَئِذٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكْفِي الْمُؤْمِنِينَ عَنْ الطَّعَامِ وَالشَّرَابِ يَوْمَئِذٍ التَّكْبِيرُ وَالتَّسْبِيحُ وَالتَّحْمِيدُ ثُمَّ قَالَ لَا تَبْكُوا فَإِنْ يَخْرُجْ الدَّجَّالُ وَأَنَا فِيكُمْ فَأَنَا حَجِيجُهُ وَإِنْ يَخْرُجْ بَعْدِي فَاللَّهُ خَلِيفَتِي عَلَى كُلِّ مُسْلِمٍ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Jarir bin Hazim] dari [Qatadah] dari [Syahr bin Hausyab] dari [Asma' binti Yazid] dia berkata, \"Kami bersama Nabi shallallahu 'alaihi wasallam di rumahnya, kemudian beliau bersabda: \"Tiga tahun sebelum keluarnya Dajjal, langit akan menahan sepertiga dari air hujannya, dan bumi menahan sepertiga dari tumbuh-tumbuhannya. Pada tahun yang kedua, langit akan menahan dua pertiga dari air hujannya dan bumi akan menahan dua pertiga dari tumbuh-tumbuhannya. Pada tahun yang ketiga langit akan menahan air hujan semuanya dan bumi juga akan menahan tumbuh-tumbuhan semuanya, maka tidaklah yang memiliki sepatu atau tapak kaki (pada hewan) kecuali akan binasa. Kemudian Dajjal berkata kepada seorang lelaki dari penduduk kampung, 'Bagaimana pendapatmu jika aku bangkitkan untamu dengan susu yang besar dan punuknya besar, apakah kamu tahu bahwa aku adalah Rabbmu? Lelaki itu menjawab, 'Ya.' Lalu setan berubah bentuk seperti untanya dan mengikutinya. Kemudian Dajjal berkata kepada orang tadi, 'Bagaimana pendapatmu jika aku bangkitkan bapak dan anakmu dan siapa yang kamu ketahui dari keluargamu, apakah kamu tahu bahwa aku adalah Rabbmu? ' maka lelaki itu menjawab, 'Ya'. Maka setan berubah bentuk seperti keluarganya dan mengikutinya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam keluar sedangkan anggota keluarga sama menangis, lalu Rasulullah shallallahu 'alaihi wasallam kembali sedangkan kami sedang menangis, beliau bertanya: \"Apa yang menyebabkan kalian menangis?\" Aku menjawab, \"Wahai Rasulullah, karena sesuatu yang tuan sebutkan tentang Dajjal. Demi Allah, sungguh, budak keluargaku membuat adonan tepung namun tidak jadi hingga aku hampir mati karena lapar. Maka apa yang harus kami lakukan pada hari itu? Rasulullah shallallahu 'alaihi wasallam menjawab: \"Cukup makanan dan minuman bagi orang-orang beriman pada hari itu dengan Takbir (bacaan Allahu Akbar), tasbih (bacaan subhaanallah) dan tahmid (bacaan Al Hamdulillah).\" Kemudian beliau bersabda: \"Janganlah kalian menangis, jika Dajjal keluar dan aku bersama kalian maka aku yang akan melawannya, namun jika dia keluar setelah aku meninggal, maka Allah adalah pelindungku bagi setiap kaum muslimin.\""
            },
            {
                "number": 4272,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ{ إِنَّهُ عَمِلَ غَيْرَ صَالِحٍ }وَسَمِعْتُهُ يَقْرَأُ{ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا }وَلَا يُبَالِي{ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ }",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Hammad bin Salamah] dari [Tsabit] dari [Syahr bin Hausyab] dari [Asma' binti Yazid] dia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam membaca ayat: INNAHU 'AMILA GHAIRU SHAALIH (Sesungguhnya (perbuatan) nya perbuatan yang tidak baik) ' (Qs. Huud: 46), dan aku mendengarnya membaca: YA 'IBAADIYAL LADZIINA ASRAFUU 'ALAA ANFUSIHIM LAA TAQNATHUU MIN RAHMATILLAAH INNALLAAHA YAGHFIRUDZ DZUNUUBA JAMII'A (Hai hamba-hamba-Ku yang malampaui batas terhadap diri mereka sendiri, janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya) ' (Qs. Az Zummar: 53), dan tidak memperdulikan; INNAHU HUWAL GHAFUURUR RAHIM (Sesungguhnya Dia-lah yang Maha Pengampun lagi Maha Penyayang) ' (Qs. Az Zummar: 53)."
            },
            {
                "number": 4273,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ عَنِ ابْنِ خُثَيْمٍ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَسْمَاءَ بِنْتِ يَزِيدَ أَنَّهَاسَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَقُولُ أَيُّهَا النَّاسُ مَا يَحْمِلُكُمْ عَلَى أَنْ تَتَابَعُوا فِي الْكَذِبِ كَمَا يَتَتَابَعُ الْفَرَاشُ فِي النَّارِ كُلُّ الْكَذِبِ يُكْتَبُ عَلَى ابْنِ آدَمَ إِلَّا ثَلَاثَ خِصَالٍ رَجُلٌ كَذَبَ عَلَى امْرَأَتِهِ لِيُرْضِيَهَا أَوْ رَجُلٌ كَذَبَ فِي خَدِيعَةِ حَرْبٍ أَوْ رَجُلٌ كَذَبَ بَيْنَ امْرَأَيْنِ مُسْلِمَيْنِ لِيُصْلِحَ بَيْنَهُمَا",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdii] telah menceritakan kepada kami [Daud bin Abdurrahman] dari [Ibnu Hutsaim] dari [Syahr bin Hausyab] dari [Asma' binti Yazid] bahwa dia telah mendengar Rasulullah shallallahu 'alaihi wasallam berkhutbah, kemudian beliau bersabda: \"Wahai sekalian manusia, apa yang mendorong kalian ikut-ikutan berdusta sebagaimana anai-anai berebut ke api, setiap perbuatan dusta akan dicatat atas anak adam kecuali tiga hal; seorang suami yang berbohong kepada isterinya supaya isterinya ridla, atau seseorang yang berdusta dalam rangka strategi perang dan seseorang yang berbohong di antara kedua belah pihak dari kaum muslimin untuk mendamaikan keduanya.\""
            },
            {
                "number": 4274,
                "arab": "حَدَّثَنَا هَاشِمٌ هُوَ ابْنُ الْقَاسِمِ حَدَّثَنَا عَبْدُ الْحَمِيدِ قَالَ حَدَّثَنَا شَهْرُ بْنُ حَوْشَبٍ قَالَ حَدَّثَتْنِي أَسْمَاءُ بِنْتُ يَزِيدَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ نِسَاءَ الْمُسْلِمِينَ لِلْبَيْعَةِ فَقَالَتْ لَهُ أَسْمَاءُ أَلَا تَحْسُرُ لَنَا عَنْ يَدِكَ يَا رَسُولَ اللَّهِ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَسْتُ أُصَافِحُ النِّسَاءَ وَلَكِنْ آخُذُ عَلَيْهِنَّ وَفِي النِّسَاءِ خَالَةٌ لَهَا عَلَيْهَا قُلْبَانِ مِنْ ذَهَبٍ وَخَوَاتِيمُ مِنْ ذَهَبٍ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا هَذِهِ هَلْ يَسُرُّكِ أَنْ يُحَلِّيَكِ اللَّهُ يَوْمَ الْقِيَامَةِ مِنْ جَمْرِ جَهَنَّمَ سِوَارَيْنِ وَخَوَاتِيمَ فَقَالَتْ أَعُوذُ بِاللَّهِ يَا نَبِيَّ اللَّهِ قَالَتْ قُلْتُ يَا خَالَتِي اطْرَحِي مَا عَلَيْكِ فَطَرَحَتْهُ فَحَدَّثَتْنِي أَسْمَاءُ وَاللَّهِ يَا بُنَيَّ لَقَدْ طَرَحَتْهُ فَمَا أَدْرِي مَنْ لَقَطَهُ مِنْ مَكَانِهِ وَلَا الْتَفَتَ مِنَّا أَحَدٌ إِلَيْهِ قَالَتْ أَسْمَاءُ فَقُلْتُ يَا نَبِيَّ اللَّهِ إِنَّ إِحْدَاهُنَّ تَصْلَفُ عِنْدَ زَوْجِهَا إِذَا لَمْ تُمَلَّحْ لَهُ أَوْ تَحَلَّى لَهُ قَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا عَلَى إِحْدَاكُنَّ أَنْ تَتَّخِذَ قُرْطَيْنِ مِنْ فِضَّةٍ وَتَتَّخِذَ لَهَا جُمَانَتَيْنِ مِنْ فِضَّةٍ فَتُدْرِجَهُ بَيْنَ أَنَامِلِهَا بِشَيْءٍ مِنْ زَعْفَرَانٍ فَإِذَا هُوَ كَالذَّهَبِ يَبْرُقُ",
                "id": "Telah menceritakan kepada kami [Hasyim] -yaitu Ibnu Qasim- telah menceritakan kepada kami [Abdul Hamid] berkata, telah menceritakan kepada kami [Syahr bin Hausyab] berkata, telah menceritakan kepadaku [Asma' binti Yazid] bahwa Rasulullah shallallahu 'alaihi wasallam mengumpulkan para wanita kaum Muslimin untuk berbaiat, maka Asma' berkata kepada beliau, \"Tidakkah tuan mengulurkan tanganmu wahai Rasulullah?\" Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Sesungguhnya aku tidak berjabat tangan dengan wanita, akan tetapi aku hanya sekedar mengambil sumpah dari mereka.\" Dan di antara para wanita itu ada bibinya, ia mengenakan gelang dan cincin dari emas, maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Apakah kamu suka jika Allah mengenakanmu gelang dan cincin dari api neraka pada hari Kiamat kelak?\" maka dia berkata, \"Aku berlindung diri kepada Allah wahai Nabi Allah.\" Asma' berkata, \"Lantas aku berkata kepada bibiku, \"Buanglah sesuatu yang ada padamu, \" lalu dia membuangnya.\" Asma mendengar kepadaku, \"Demi Allah, wahai anakku, sungguh dia telah membuangnya, dan aku tidak tahu siapa yang mengambil dari tempatnya, dan tidak ada satupun dari kami yang hendak mengambilnya.\" Asma' berkata, \"Maka aku berkata, \"Wahai Nabi Allah, sesungguhnya salah satu dari kami merasa tidak enak bersama suaminya jika tidak mengenakannya atau berhias dengannya?\" Nabi shallallahu 'alaihi wasallam pun bersabda: \"Kenapa salah seorang dari kalian tidak membuat anting dari perak, atau membuat kedua cincinya dari perak lalu memasukkannya di antara jari-jarinya dan dicampur dengan Za'faran, sehingga ia seperti emas yang mengkilap.\""
            },
            {
                "number": 4275,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ ابْنُ جُرَيْجٍإِنَّ مَعْمَرًا شَرِبَ مِنْ الْعِلْمِ بِأَنْفَعَقَالَ أَبِي وَمَاتَ مَعْمَرٌ وَلَهُ ثَمَانٍ وَخَمْسُونَ سَنَةً",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] berkata, [Ibnu Juraij] telah berkata, \"Sungguh Ma'mar telah menyerap ilmu yang sangat bermanfaat.\" Abdullah berkata, \"Ma'mar meninggal dalam usia lima puluh delapan tahun.\""
            },
            {
                "number": 4276,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ أَبِيهِ عَنْ أُمِّهِ سَلْمَى قَالَتْاشْتَكَتْ فَاطِمَةُ شَكْوَاهَا الَّتِي قُبِضَتْ فِيهِ فَكُنْتُ أُمَرِّضُهَا فَأَصْبَحَتْ يَوْمًا كَأَمْثَلِ مَا رَأَيْتُهَا فِي شَكْوَاهَا تِلْكَ قَالَتْ وَخَرَجَ عَلِيٌّ لِبَعْضِ حَاجَتِهِ فَقَالَتْ يَا أُمَّهْ اسْكُبِي لِي غُسْلًا فَسَكَبْتُ لَهَا غُسْلًا فَاغْتَسَلَتْ كَأَحْسَنِ مَا رَأَيْتُهَا تَغْتَسِلُ ثُمَّ قَالَتْ يَا أُمَّهْ أَعْطِينِي ثِيَابِيَ الْجُدُدَ فَأَعْطَيْتُهَا فَلَبِسَتْهَا ثُمَّ قَالَتْ يَا أُمَّهْ قَدِّمِي لِي فِرَاشِي وَسَطَ الْبَيْتِ فَفَعَلْتُ وَاضْطَجَعَتْ وَاسْتَقْبَلَتْ الْقِبْلَةَ وَجَعَلَتْ يَدَهَا تَحْتَ خَدِّهَا ثُمَّ قَالَتْ يَا أُمَّهْ إِنِّي مَقْبُوضَةٌ الْآنَ إِنِّي مَقْبُوضَةٌ الْآنَ وَقَدْ تَطَهَّرْتُ فَلَا يَكْشِفُنِي أَحَدٌ فَقُبِضَتْ مَكَانَهَا قَالَتْ فَجَاءَ عَلِيٌّ فَأَخْبَرْتُهُقَالَ عَبْد اللَّهِ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ الْوَرَكَانِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ فَذَكَرَ نَحْوَهُ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu An Nadlr] telah menceritakan kepada kami [Ibrahim bin Sa'd] dari [Muhammad bin Ishaq] dari [ubaidhullah bin Abu Rafi'] dari [Ayahnya] dari ibunya [Salma] dia berkata, \"Fatimah mengalami sakit yang membawanya kepada kematian, dan akulah yang merawatnya. Suatu hari aku lihat ia merasakan rasa sakit itu kembali, sebagaimana yang biasa aku lihat.\" Salma berkata, \"Ali kemudian keluar untuk suatu keperluan, kemudian Fatimah berkata, \"Wahai ibu, tuangkanlah air untuk mandiku.\" Kemudian aku tuangkan air untuknya, lalu dia pun mandi dengan sebaik-baiknya sebagaimana yang aku lihat. Kemudian dia berkata, \"Wahai ibu, berikan kepadaku bajuku yang baru.\" Lalu aku memberikannya dan dia pun memakainya. Setelah itu ia berkata lagi, \"Wahai ibu, letakkan tempat tidurku ke tengah-tengah rumah.\" Maka aku pun melakukannya, lalu dia berbaring dan menghadap ke kiblat sambil meletakkan tangannya di bawah pipinya, kemudian ia berkata, \"Wahai ibu, sungguh sekarang tiba waktunya. Sungguh, sekarang tiba waktunya. Dan aku telah bersuci maka jangan ada seorangpun yang menyingkapku.\" Kemudian dia wafat di tempat tidurnya.\" Salma berkata, \"Kemudian Ali datang lalu aku kabarkan hal itu kepadanya.\" Abdullah berkata; telah menceritakan kepada kami [Muhammad bin Ja'far Al Warakani] dia berkata, telah bercerita kepada kami [Ibrahim bin Sa'ad] dari [Muhammad bin Ishaq] kemudian dia menyebutkan hadits seperti itu.\""
            },
            {
                "number": 4277,
                "arab": "حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ أَبِي الْمَوَالِي عَنْ أَيُّوبَ بْنِ حَسَنِ بْنِ عَلِيِّ بْنِ أَبِي رَافِعٍ عَنْ جَدَّتِهِ سَلْمَى خَادِمِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْمَا سَمِعْتُ أَحَدًا قَطُّ يَشْكُو إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَعًا فِي رَأْسِهِ إِلَّا قَالَ احْتَجِمْ وَلَا وَجَعًا فِي رِجْلَيْهِ إِلَّا قَالَ اخْضِبْهُمَا بِالْحِنَّاءِ",
                "id": "Telah menceritakan kepada kami [Abu Amir] telah menceritakan kepada kami [Abdurrahman] -yakni Ibnu Abu Al Mawali- dari [Ayyub bin Hasan bin Ali bin Abu Rafi'] dari neneknya [Salma] pelayan Rasulullah shallallahu 'alaihi wasallam, dia berkata, \"Aku tidak pernah mendengar seseorang mengadu tentang sakit yang ada di kepalanya kepada Rasulullah shallallahu 'alaihi wasallam, kecuali beliau mengatakan kepadanya agar berbekam, dan tidaklah sakit di kedua kaki kecuali beliau mengatakan agar mengecat keduanya dengan daun pacar.\""
            },
            {
                "number": 4278,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الْمَوَالِي حَدَّثَنَا فَائِدٌ مَوْلَى بَنِي رَافِعٍ عَنْ عَلِيِّ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ عَمَّتِهِ سَلْمَى قَالَتْمَا اشْتَكَى أَحَدٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَجَعًا فِي رَأْسِهِ إِلَّا قَالَ احْتَجِمْ وَلَا اشْتَكَى إِلَيْهِ أَحَدٌ وَجَعًا فِي رِجْلَيْهِ إِلَّا قَالَ اخْضِبْ رِجْلَيْكَ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id] bekas budak bani Hasyim, telah menceritakan kepada kami [Abdurrahman bin Abu Al Mawali] telah menceritakan kepada kami [Faid] bekas budak bani Rafi', dari [Ali bin ubaidhullah bin Abu Rafi'] dari bibinya [Salma] dia berkata, \"Tidak ada seorang pun yang mengadu sakit kepala kepada Rasulullah shallallahu 'alaihi wasallam, kecuali beliau mengatakan kepadanya agar berbekam, dan tidaklah sakit di kedua kaki kecuali beliau mengatakan agar mengecat keduanya dengan daun pacar.\""
            },
            {
                "number": 4279,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَبْدِ الْحَمِيدِ بْنِ جُبَيْرِ بْنِ شَيْبَةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أُمِّ شَرِيكٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهَا بِقَتْلِ الْأَوْزَاغِ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Abdul Hamid bin Jubair bin Syaibah] dari [Sa'id bin Al Musayyab] dari [Ummu Syarik] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau memerintahkan untuk membunuh cicak.\""
            },
            {
                "number": 4280,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ أَخْبَرَتْنِي أُمُّ شَرِيكٍ أَنَّهَاسَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَيَفِرَّنَّ النَّاسُ مِنْ الدَّجَّالِ فِي الْجِبَالِ قَالَتْ أُمُّ شَرِيكٍ يَا رَسُولَ اللَّهِ فَأَيْنَ الْعَرَبُ يَوْمَئِذٍ قَالَ كُلُّهُمْ قَلِيلٌ",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Ibnu Juraij] dia berkata, telah menceritakan kepadaku [Abu Zubair] bahwa dia telah mendengar [Jabir bin Abdullah] berkata, telah menceritakan kepadaku [Ummu Syarik], bahwa dia telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hendaklah manusia berlari dari Dajjal menuju gunung-gunung.\" Ummu Syarik bertanya, \"Wahai Rasulullah, di manakah orang-orang Arab pada hari itu?\" Beliau menjawab: \"Jumlah mereka sangat sedikit.\""
            },
            {
                "number": 4281,
                "arab": "حَدَّثَنَا يُونُسُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ عُرْوَةَ عَنْ أُمِّ شَرِيكٍ أَنَّهَاكَانَتْ مِمَّنْ وَهَبَتْ نَفْسَهَا لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yunus] telah menceritakan kepada kami [Hammad bin Salamah] dari [Hisyam bin Urwah] dari [Urwah] dari [Ummu Syarik], bahwa dia termasuk orang yang menawarkan dirinya kepada Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 4282,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ أَخْبَرَهُ أَبُوهُ قَالَنَزَلْتُ عَلَى أُمِّ أَيُّوبَ الَّذِينَ نَزَلَ عَلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَزَلْتُ عَلَيْهَا فَحَدَّثَتْنِي بِهَذَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُمْ تَكَلَّفُوا طَعَامًا فِيهِ بَعْضُ هَذِهِ الْبُقُولِ فَقَرَّبُوهُ فَكَرِهَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ لِأَصْحَابِهِ كُلُوا إِنِّي لَسْتُ كَأَحَدٍ مِنْكُمْ إِنِّي أَخَافُ أَنْ أُوذِيَ صَاحِبِي يَعْنِي الْمَلَكَ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] telah menceritakan kepada kami [ubaidhullah bin Abu Yazid] dari [Bapaknya] berkata; \"Aku singgah ke tempat [Ummu Ayyub], yaitu orang yang Rasulullah shallallahu 'alaihi wasallam pernah singgah kepada mereka. Ketika aku singgah, ia menceritakan kepadaku seperti ini dari Rasulullah shallallahu 'alaihi wasallam, bahwa para sahabat pernah membawa makanan yang di dalamnya banyak sayurannya, kemudian mereka mendekatkan kepada beliau, akan tetapi Rasulullah shallallahu 'alaihi wasallam tidak suka seraya bersabda kepada para sahabatnya: \"Makanlah, sesungguhnya aku tidak seperti salah seorang di antara kalian, aku khawatir jika aku menyakiti sahabatku ini, yakni malaikat.\""
            },
            {
                "number": 4283,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عُبَيْدِ اللَّهِ يَعْنِى ابْنَ أَبِي يَزِيدَ عَنْ أَبِيهِ عَنْ أُمِّ أَيُّوبَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَزَلَ الْقُرْآنُ عَلَى سَبْعَةِ أَحْرُفٍ أَيَّهَا قَرَأْتَ أَجْزَأَكَ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [ubaidhullah] -yakni Ibnu Abu Yazid- dari [Ayahnya] dari [Ummu Ayyub] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"al-qur'an turun dengan tujuh huruf, mana saja yang kamu baca, niscaya kamu aka mendapat pahala.\""
            },
            {
                "number": 4284,
                "arab": "حَدَّثَنَا حُسَيْنٌ وَأَبُو نُعَيْمٍ قَالَا ثَنَا إِسْرَائِيلُ عَنْ زَيْدِ بْنِ جُبَيْرٍ عَنْ أَبِي يَزِيدَ الضَّنِّيِّ عَنْ مَيْمُونَةَ بِنْتِ سَعْدٍ مَوْلَاةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ وَلَدِ الزِّنَا قَالَ لَا خَيْرَ فِيهِ نَعْلَانِ أُجَاهِدُ بِهِمَا فِي سَبِيلِ اللَّهِ أَحَبُّ إِلَيَّ مِنْ أَنْ أُعْتِقَ وَلَدَ زِنًا",
                "id": "Telah menceritakan kepada kami [Husain] dan [Abu Nu'aim] keduanya berkata, telah menceritakan kepada kami [Israil] dari [Zaid bin Jubair] dari [Abu Yazid Adl Dlanni] dari [Maimunah] bekas budak Nabi shallallahu 'alaihi wasallam, dia berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah ditanya tentang anak hasil zina, maka beliau menjawab: \"Tidak ada kebaikan padanya, dua sandal yang aku pergunakan berjihad di jalan Allah lebih aku sukai dari pada aku memerdekakan anak hasil zina.\""
            },
            {
                "number": 4285,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا إِسْرَائِيلُ عَنْ زَيْدِ بْنِ جُبَيْرٍ عَنْ أَبِي يَزِيدَ الضَّنِّيِّ عَنْ مَيْمُونَةَ مَوْلَاةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ رَجُلٍ قَبَّلَ امْرَأَتَهُ وَهُوَ صَائِمٌ قَالَ قَدْ أَفْطَرَ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Isra'il] dari [Zaid bin Jubair] dari [Abu Yazid Adl Dlanni] dari [Maimunah] bekas budak Rasulullah shallallahu 'alaihi wasallam, dia berkata, \"Rasulullah shallallahu 'alaihi wasallam ditanya tentang seorang suami yang mencium isterinya, padahal dia sedang berpuasa. Maka beliau menjawab: \"Dia telah berbuka.\""
            },
            {
                "number": 4286,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ قَالَ ثَنَا عِيسَى قَالَ ثَنَا ثَوْرٌ عَنْ زِيَادِ بْنِ أَبِي سَوْدَةَ عَنْ أَخِيهِ أَنَّ مَيْمُونَةَ مَوْلَاةَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْيَا نَبِيَّ اللَّهِ أَفْتِنَا فِي بَيْتِ الْمَقْدِسِ فَقَالَ أَرْضُ الْمَنْشَرِ وَالْمَحْشَرِ ائْتُوهُ فَصَلُّوا فِيهِ فَإِنَّ صَلَاةً فِيهِ كَأَلْفِ صَلَاةٍ فِيمَا سِوَاهُ قَالَتْ أَرَأَيْتَ مَنْ لَمْ يُطِقْ أَنْ يَتَحَمَّلَ إِلَيْهِ أَوْ يَأْتِيَهُ قَالَ فَلْيُهْدِ إِلَيْهِ زَيْتًا يُسْرَجُ فِيهِ فَإِنَّ مَنْ أَهْدَى لَهُ كَانَ كَمَنْ صَلَّى فِيهِحَدَّثَنَا أَبُو مُوسَى الْهَرَوِيُّ قَالَ ثَنَا عِيسَى بْنُ يُونُسَ بِإِسْنَادِهِ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Ali bin Bahr] berkata, telah menceritakan kepada kami [Isa] berkata, telah menceritakan kepada kami [Tsaur] dari [Ziyad bin Abu Saudah] dari [saudara laki-lakinya] bahwa [Maimunah] bekas budak Nabi shallallahu 'alaihi wasallam, berkata, \"Wahai Nabi Allah, berilah kami fatwa tentang Baitul Maqdis.\" Beliau menjawab: \"Itu adalah bumi yang terbentang dan mahsyar (perkumpulan), datanglah ke sana dan laksanakan sholat di sana, karena sholat di sana sama dengan melaksanakan seribu sholat di tempat lainnya.\" Beliau bertanya, \"Bagaimana pendapat tuan jika seseorang tidak mampu untuk datang ke sana?\" Nabi menjawab: \"Hendaklah dia menginfakkan minyak untuk penerangan di sana karena barangsiapa yang memberikan minyak untuk penerangan di dalamnya, maka ia seperti orang yang melaksanakan sholat di dalamnya.\" Telah menceritakan kepada kami [Abu Musa Al Harawi] dia berkata, telah menceritakan kepada kami [Isa bin Yunus] dengan sanadnya, kemudian dia menyebutkan hadits seperti itu.\""
            },
            {
                "number": 4287,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ ثَنَا شُعْبَةُ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ مَعْنٍ عَنِ ابْنَةِ حَارِثَةَ بْنِ النُّعْمَانِ قَالَتْمَا حَفِظْتُ ق إِلَّا مِنْ فِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَخْطُبُ يَوْمَ الْجُمُعَةِ قَالَتْ وَكَانَ تَنُّورُنَا وَتَنُّورُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاحِدًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Hubaib bin Abdurrahman] dari [Abdullah bin Muhammad bin Ma'n] dari [Anak perempuan Haritsah bin Nu'an] dia berkata, \"Aku hafal surat Qaaf langsung dari Rasulullah shallallahu 'alaihi wasallam sewaktu beliau khutbah Jum'at, dia berkata, \"Karena kompor kami dan kompor Rasulullah shallallahu 'alaihi wasallam itu satu.\""
            },
            {
                "number": 4288,
                "arab": "حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى قَالَ عَبْد اللَّهِ وَسَمِعْتُهُ أَنَا مِنْ الْحَكَمِ قَالَ ثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الرِّجَالِ قَالَ ذَكَرَهُ يَحْيَى بْنُ سَعِيدٍ عَنْ عَمْرَةَ عَنْ أُمِّ هِشَامٍ بِنْتِ حَارِثَةَ بْنِ النُّعْمَانِ قَالَتْمَا أَخَذْتُ ق وَالْقُرْآنِ الْمَجِيدِ إِلَّا مِنْ وَرَاءِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بِهَا فِي الصُّبْحِ",
                "id": "Telah menceritakan kepada kami [Hakam bin Musa] -Abdullah berkata; dan aku telah mendengarnya- dari [Hakam] berkata, telah menceritakan kepada kami [Abdurrahman bin Abu Ar Rijal] berkata, [Yahya bin Sa'id] telah menyebutkan kepadanya dari [Amrah] dari [Ummu Hisyam binti Haritsah bin Nu'man] dia berkata, \"Aku tidak mengambil QAAF Wal-qur'anIL MAJIID (surat Qaaf) kecuali di belakang Nabi shallallahu 'alaihi wasallam, sewaktu beliau membacanya pada saat sholat subuh.\""
            },
            {
                "number": 4289,
                "arab": "حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ قَالَ ثَنَا لَيْثٌ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ عَنِ الْمُنْذِرِ بْنِ الْمُغِيرَةِ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ أَنَّ فَاطِمَةَ بِنْتَ أَبِي حُبَيْشٍ حَدَّثَتْهُأَنَّهَا أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَكَتْ إِلَيْهِ الدَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا ذَلِكَ عِرْقٌ فَانْظُرِي إِذَا أَتَى قُرْؤُكِ فَلَا تُصَلِّي فَإِذَا مَرَّ الْقُرْءُ فَتَطَهَّرِي ثُمَّ صَلِّي مَا بَيْنَ الْقُرْءِ إِلَى الْقُرْءِ",
                "id": "Telah menceritakan kepada kami [Yunus bin Muhammad] berkata, telah menceritakan kepada kami [Laits] dari [Yazid bin Abu Habib] dari [Bukair bin Abdullah] dari [Al Mundzir bin Al Mughirah] dari [Urwah bin Zubair] bahwa [Fatimah binti Abu Qubais] telah menceriatakan kepadanya, bahwa dirinya menemui Rasulullah shallallahu 'alaihi wasallam dan mengadukan kepada beliau mengenai darah (kebiasaan wanita), maka beliau bersabda: \"Hanyasannya ia adalah darah kotor, maka lihatlah jika telah datang masa quru`mu (haid), janganlah kamu mengerjakan sholat, dan jika telah berlalu masa quru'mu (haid), maka bersucilah kemudian tunaikan sholat antara haid pertama dengan masa haid kedua.\""
            },
            {
                "number": 4290,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ قَالَ ثَنَا إِسْرَائِيلُ عَنْ عُثْمَانَ بْنِ سَعْدٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ قَالَ حَدَّثَتْنِي خَالَتِي فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ قَالَتْأَتَيْتُ عَائِشَةَ فَقُلْتُ لَهَا يَا أُمَّ الْمُؤْمِنِينَ قَدْ خَشِيتُ أَنْ لَا يَكُونَ لِي حَظٌّ فِي الْإِسْلَامِ وَأَنْ أَكُونَ مِنْ أَهْلِ النَّارِ أَمْكُثُ مَا شَاءَ اللَّهُ مِنْ يَوْمِ أُسْتَحَاضُ فَلَا أُصَلِّي لِلَّهِ عَزَّ وَجَلَّ صَلَاةً قَالَتْ اجْلِسِي حَتَّى يَجِيءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا جَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ يَا رَسُولَ اللَّهِ هَذِهِ فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ تَخْشَى أَنْ لَا يَكُونَ لَهَا حَظٌّ فِي الْإِسْلَامِ وَأَنْ تَكُونَ مِنْ أَهْلِ النَّارِ تَمْكُثُ مَا شَاءَ اللَّهُ مِنْ يَوْمِ تُسْتَحَاضُ فَلَا تُصَلِّي لِلَّهِ عَزَّ وَجَلَّ صَلَاةً فَقَالَ مُرِي فَاطِمَةَ بِنْتَ أَبِي حُبَيْشٍ فَلْتُمْسِكْ كُلَّ شَهْرٍ عَدَدَ أَيَّامِ أَقْرَائِهَا ثُمَّ تَغْتَسِلُ وَتَحْتَشِي وَتَسْتَثْفِرُ وَتَنَظَّفُ ثُمَّ تَطَهَّرُ عِنْدَ كُلِّ صَلَاةٍ وَتُصَلِّي فَإِنَّمَا ذَلِكَ رَكْضَةٌ مِنْ الشَّيْطَانِ أَوْ عِرْقٌ انْقَطَعَ أَوْ دَاءٌ عَرَضَ لَهَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Abu Bukair] berkata, telah menceritakan kepada kami [Israil] dari [Utsman bin Sa'd] dari [Abdullah bin Abu Mulaikah] berkata, telah menceritakan kepadaku bibiku [Fatimah binti Abu Hubaisy] dia berkata, \"Aku datang kepada 'Aisyah, maka aku berkata kepadanya, \"Wahai Ummul Mukminin, aku khawatir jika aku mempunyai lagi bagian dari Islam sehingga aku termasuk dari penghuni neraka, aku berdiam diri sesuai dengan kehendak Allah (lamanya), semenjak aku mengeluarkan darah istihadlah aku tidak pernah melaksanakan sholat sama sekali.\" Aisyah lalu berkata, \"Duduklah kamu sampai Nabi shallallahu 'alaihi wasallam datang.\" Maka tatkala Nabi shallallahu 'alaihi wasallam datang, Aisyah berkata, \"Wahai Rasulullah, ini adalah Fatimah binti Abu Hubais, dia khawatir jika dirinya tidak lagi memiliki bagian dari Islam dan termasuk dari penghuni neraka. Dia berdiam diri sesuai dengan kehendak Allah (lamanya), semenjak dia mengeluarkan darah istihadlah dia tidak pernah melaksanakan sholat sama sekali.\" Maka beliau bersabda: \"Suruhlah Fatimah binti Abu Hubais untuk menghitung setiap bulannya berapa hari dia biasa menjalani masa haidnya, kemudian suruhlah dia mandi.\""
            },
            {
                "number": 4291,
                "arab": "حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ قَالَ ثَنَا أُسَامَةُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أُمِّ كُرْزٍ الْخُزَاعِيَّةِ قَالَتْأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِغُلَامٍ فَبَالَ عَلَيْهِ فَأَمَرَ بِهِ فَنُضِحَ وَأُتِيَ بِجَارِيَةٍ فَبَالَتْ عَلَيْهِ فَأَمَرَ بِهِ فَغُسِلَ",
                "id": "Telah menceritakan kepada kami [Abu Bakar Al Hanafi] berkata, telah menceritakan kepada kami [Usamah bin Zaid] dari [Amru bin Syu'aib] dari [Ummu Kurz Al Khuza'iyyah] dia berkata, \"Dihadapkan kepada Nabi shallallahu 'alaihi wasallam seorang bayi laki-laki, yang kemudian mengencinginya. Beliau lalu memerintahkan untuk memercikinya. Dan dihadapkan pula seorang bayi perempuan, ketika bayi itu kencing maka beliau memerintahkan untuk mencuci (bekas kencingnya).\""
            },
            {
                "number": 4292,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ عُمَارَةَ عَنْ أَبِي الشَّعْثَاءِ قَالَخَرَجْتُ حَاجًّا فَجِئْتُ حَتَّى دَخَلْتُ الْبَيْتَ فَلَمَّا كُنْتُ بَيْنَ السَّارِيَتَيْنِ مَضَيْتُ حَتَّى لَزِقْتُ بِالْحَائِطِ فَجَاءَ ابْنُ عُمَرَ فَصَلَّى إِلَى جَنْبِي فَصَلَّى أَرْبَعًا فَلَمَّا صَلَّى قُلْتُ أَيْنَ صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْبَيْتِ قَالَ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ أَنَّهُ صَلَّى هَاهُنَا فَقُلْتُ كَمْ صَلَّى قَالَ عَلَى هَذَا أَجِدُنِي أَلُومُ نَفْسِي إِنِّي مَكَثْتُ مَعَهُ عُمُرًا لَمْ أَسْأَلْهُ كَمْ صَلَّىثُمَّ حَجَجْتُ مِنْ الْعَامِ الْمُقْبِلِ فَجِئْتُ فَقُمْتُ فِي مَقَامِهِ فَجَاءَ ابْنُ الزُّبَيْرِ فَصَلَّى فِيهِ أَرْبَعًا",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy] dari [Umarah] dari [Abu Sya'tsa`] dia berkata, \"Aku keluar melaksanakan haji, lalu aku datang hingga masuk ke dalam Ka'bah, ketika aku berada di antara dua tiang aku berlalu hingga menyentuh dinding. Kemudian [Ibnu Umar] datang dan melaksanakan sholat empat rakaat di sampingku, selesai sholat aku bertanya kepadanya, 'Di bagian manakah Rasulullah shallallahu 'alaihi wasallam melaksanakan sholat di dalam Ka'bah? ' dia menjawab, ['Usamah Bin Zaid] telah bercerita kepada kami bahwa beliau melaksanakan sholat di sini.\" Kemudian aku bertanya, \"Berapa rakaat beliau sholat?\" dia menjawab, \"Karena inilah aku marah dengan diriku sendiri, sekian lama aku hidup bersama beliau namun aku tidak pernah menanyakannya.\" Kemudian aku melaksanakan haji pada tahun berikutnya, lalu aku datang dan sholat di tempat yang Ibnu Abbas gunakan untuk sholat, lalu Ibnu Zubair datang dan melaksanakan sholat empat rakaat di tempat tersebut.\""
            }
        ]
    }
}