{
    "status": true,
    "data": {
        "start": 2665,
        "end": 2812,
        "total": 148,
        "book": "ahmad",
        "hadits": [
            {
                "number": 2665,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ حَدَّثَنَا قَتَادَةُ عَنْ نَصْرِ بْنِ عَاصِمٍ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْفَعُ يَدَيْهِ إِذَا دَخَلَ فِي الصَّلَاةِ وَإِذَا رَكَعَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ إِلَى أُذُنَيْهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah], telah menceritakan kepada kami [Qatadah] dari [Nashr bin 'Ashim] dari [Malik bin Al Huwairits] -ia termasuk dari sahabat Nabi Shalallahu 'Alaihi Wasallam- katanya; Nabi Shalallahu 'Alaihi Wasallam mengangkat tangannya ketika memulai sholat, ruku' dan saat mengangkat kepala (`I'tidal) dari ruku', hingga kedua telinganya.\""
            },
            {
                "number": 2666,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ الْعُقَيْلِيِّ عَنْ رَجُلٍ مِنْهُمْ يُكَنَّى أَبَا عَطِيَّةَ قَالَ كَانَ مَالِكُ بْنُ الْحُوَيْرِثِيَأْتِينَا فِي مُصَلَّانَا يَتَحَدَّثُ قَالَ فَحَضَرَتْ الصَّلَاةُ يَوْمًا فَقُلْنَا تَقَدَّمْ فَقَالَ لَا لِيَتَقَدَّمْ بَعْضُكُمْ حَتَّى أُحَدِّثَكُمْ لِمَ لَا أَتَقَدَّمُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ مَنْ زَارَ قَوْمًا فَلَا يَؤُمَّهُمْ وَلْيَؤُمَّهُمْ رَجُلٌ مِنْهُمْحَدَّثَنَا عَبْد اللَّهِ قَالَ حَدَّثَنَاه إِبْرَاهِيمُ بْنُ الْحَجَّاجِ وَمُحَمَّدُ بْنُ أَبَانَ الْوَاسِطِيُّ قَالَا حَدَّثَنَا أَبَانُ حَدَّثَنَا بُدَيْلٌ مِثْلَهُ حَدَّثَنَا يَزِيدُ قَالَ أَخْبَرَنَا أَبَانُ بْنُ يَزِيدَ الْعَطَّارُ عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ حَدَّثَنِي أَبُو عَطِيَّةَ مَوْلًى لَنَا قَالَ كَانَ مَالِكُ بْنُ الْحُوَيْرِثِ يَأْتِينَا فِي مُصَلَّانَا فَذَكَرَ الْحَدِيثَ يَعْنِي حَدِيثَ أَبِي",
                "id": "Telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami [Aban bin Yazid] dari [Budail bin Maisarah Al 'Uqaili] dari seseorang yang biasa dijuluki dengan [Abu 'Athiyyah] ia berkata; Suatu ketika [Malik bin Huwairits] datang dan bercerita kepada kami di mushalla, lalu tibalah waktu sholat, kami pun berkata; \"Majulah (untuk jadi imam)!.\" ia berkata; \"Tidak, jadilah imam salah seorang diantara kalian, hingga aku akan ceritakan satu hadits yang menyebabkan aku tidak maju untuk mengimami, saya mendengar Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Barangsiapa berziarah pada suatu kaum, maka janganlah ia menjadi imam dan tunjuklah salah seorang dari kaum tersebut menjadi imam.\" Telah menceritakan kepada kami Abdullah, ia berkata; telah menceritakan kepada kami [Ibrahimm bin Hajjaj] dan [Muhammad bin Aban Al Washiti], keduanya berkata; telah menceritakan kepada kami [Aban], telah menceritakan kepada kami [Budail] seperti hadits diatas. Dan telah menceritakan kepada kami [Yazid], ia berkata; telah mengabarkan kepada kami [Aban bin Yazid Al 'Athar] dari [Budail bin Maisarah], telah menceritakan kepadaku [Abu 'Athiyyah] bekas budak kami, ia berkata; \"Suatu ketika [Malik bin Huwairits] mendatangi kami di mushala…\" lalu ia ceritakan hadits tersebut yaitu hadits dari ayahku.\""
            },
            {
                "number": 2667,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ وَأَبُو عَامِرٍ قَالَا حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنْ نَصْرِ بْنِ عَاصِمٍ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا كَبَّرَ رَفَعَ يَدَيْهِ حَتَّى يَجْعَلَهُمَا قَرِيبًا مِنْ أُذُنَيْهِ وَإِذَا رَكَعَ صَنَعَ مِثْلَ ذَلِكَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ فَعَلَ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Abdushamad] dan [Abu Amir] keduanya berkata; telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Nashr bin 'Ashim] dari [Malik bin Huwairits] bahwa apabila Rasulullah Shallalahu 'Alaihi Wasallam bertakbir, beliau mengangkat kedua tangannya hingga mendekati kedua telinganya, apabila ruku, serta ketika bangkit dari ruku'.\""
            },
            {
                "number": 2668,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ نَصْرِ بْنِ عَاصِمٍ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ فِي الصَّلَاةِ رَفَعَ يَدَيْهِ وَإِذَا رَكَعَ وَإِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ حَتَّى حَاذَتَا فُرُوعَ أُذُنَيْهِ",
                "id": "Telah menceritakan kepada kami [Isma'il] dari [Sa'id bin Abu Arubah] dari [Qatadah] dari [Nashr bin 'Ashim] dari [Malik bin Huwairits] ia berkata; \"Aku melihat Rasulullah Shallalahu 'Alaihi Wasallam mengangkat kedua tangannya ketika memulai sholat, ketika ruku dan bangkit dari ruku' hingga sejajar dengan kedua daun telinga beliau.\""
            },
            {
                "number": 2669,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ نَصْرِ بْنِ عَاصِمٍ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَرْفَعُ يَدَيْهِ حِيَالَ فُرُوعِ أُذُنَيْهِ فِي الرُّكُوعِ وَالسُّجُودِ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammam], telah menceritakan kepada kami [Qatadah] dari [Nashr bin 'Ashim] dari [Malik bin Huwairits] bahwa Nabi Shalallahu 'Alaihi Wasallam mengangkat kedua tangan sejajar dengan kedua telinganya, demikian juga ketika hendak ruku' dan sujud.\""
            },
            {
                "number": 2670,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا أَبَانُ الْعَطَّارُ حَدَّثَنَا بُدَيْلُ بْنُ مَيْسَرَةَ حَدَّثَنَا أَبُو عَطِيَّةَ مَوْلًى مِنَّا عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ قَالَكَانَ يَأْتِينَا فِي مُصَلَّانَا فَلَمَّا أُقِيمَتْ الصَّلَاةُ قِيلَ لَهُ تَقَدَّمْ فَصَلِّهْ قَالَ لِيُصَلِّ بَعْضُكُمْ حَتَّى أُحَدِّثَكُمْ لِمَ لَا أُصَلِّي بِكُمْ فَلَمَّا صَلَّى الْقَوْمُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا زَارَ أَحَدُكُمْ قَوْمًا فَلَا يُصَلِّيَنَّ بِهِمْ يُصَلِّي بِهِمْ رَجُلٌ مِنْهُمْ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Abaan bin Athar], telah menceritakan kepada kami [Budail bin Maisarah], telah menceritakan kepada kami [Abu 'Athiyah] bekas budak kami, dari [Malik bin Al Huwairits] ia berkata; bahwa ia pernah datang ke mushala kami, ketika iqamah telah di kumandangkan, dikatakan padanya; \"Silahkan maju untuk mengimami sholat kami!.\" Malik berkata; \"Suruhlah di antara kalian menjadi imam sholat, akan aku ceritakan satu hadits yang menyebabkan aku tidak mau menjadi imam sholat kalian.\" Seusai orang-orang mengerjakan sholat, ia berkata; \"Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Barangsiapa berziarah pada suatu kaum, hendaknya ia tidak menjadi imam dan suruhlah salah seorang dari kalian menjadi imam.\""
            },
            {
                "number": 2671,
                "arab": "حَدَّثَنَا يُونُسُ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ اللَّيْثِيِّ أَنَّهُقَالَ لِأَصْحَابِهِ يَوْمًا أَلَا أُرِيكُمْ كَيْفَ كَانَتْ صَلَاةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَذَلِكَ فِي غَيْرِ حِينِ صَلَاةٍ فَقَامَ فَأَمْكَنَ الْقِيَامَ ثُمَّ رَكَعَ فَأَمْكَنَ الرُّكُوعَ ثُمَّ رَفَعَ رَأْسَهُ وَانْتَصَبَ قَائِمًا هُنَيَّةً ثُمَّ سَجَدَ ثُمَّ رَفَعَ رَأْسَهُ وَيُكَبِّرُ فِي الْجُلُوسِ ثُمَّ انْتَظَرَ هُنَيَّةً ثُمَّ سَجَدَقَالَ أَبُو قِلَابَةَ فَصَلَّى صَلَاةً كَصَلَاةِ شَيْخِنَا هَذَا يَعْنِي عَمْرَو بْنَ سَلِمَةَ الْجَرْمِيَّ وَكَانَ يَؤُمُّ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّوبُ فَرَأَيْتُ عَمْرَو بْنَ سَلِمَةَ يَصْنَعُ شَيْئًا لَا أَرَاكُمْ تَصْنَعُونَهُ كَانَ إِذَا رَفَعَ رَأْسَهُ مِنْ السَّجْدَتَيْنِ اسْتَوَى قَاعِدًا ثُمَّ قَامَ مِنْ الرَّكْعَةِ الْأُولَى وَالثَّانِيَةِ",
                "id": "Telah menceritakan kepada kami [Yunus], telah menceritakan kepada kami [Hammad yaitu Ibnu Zaid], telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dari [Malik bin Al Huwairits Al Laitsi] bahwa suatu hari ia pernah berkata kepada para sahabatnya; \"Maukah kalian aku perlihatkan bagaimana sholat Rasulullah Shallalahu 'Alaihi Wasallam?.\" Abu Qilabah berkata; \"Ketika itu bukan di waktu sholat, \" lalu Malik berdiri dan memantapkan berdirinya lalu ruku' dan hingga benar-benar ruku' lalu mangangkat kepalanya dan tegak berdiri dengan tenang kemudian sujud, lalu mengangkat kepalanya seraya bertakbir di waktu duduk kemudian bersimpuh dengan tenang lalu sujud kembali.\" [Abu Qilabah] berkata; \"Lalu Malik bin AL Huwairits mempraktekkan sholat sebagaimana sholatnya guru kami ini yaitu [Amru bin Salamah Al Jarmi] dan ia telah menjadi imam di masa Nabi Shalallahu 'Alaihi Wasallam, [Ayyub] berkata; \"Lalu aku melihat [Amru bin Salimah] mengerjakan sesuatau yang aku tidak melihat kalian mengerjakannya, yaitu apabila ia mengangkat kepalanya dari dua sujud, ia duduk dengan simbang lalu berdiri di raka'at pertama dan kedua.\""
            },
            {
                "number": 2672,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ وَمُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا قَتَادَةُ عَنْ عُقْبَةَ بْنِ صُهْبَانَ عَنِ ابْنِ مُغَفَّلٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْخَذْفِ وَقَالَ إِنَّهُ لَا يَنْكَأُ عَدُوًّا وَلَا يَصِيدُ وَلَكِنَّهُ يَكْسِرُ السِّنَّ وَيَفْقَأُ الْعَيْنَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] -dari [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] - telah menceritakan kepada kami [Qatadah] dari [Uqbah bin Shuhban] dari [Ibnu Mughaffal] bahwa Rasulullah Shallalahu 'Alaihi Wasallam melarang 'khadzaf.' Ibnu Mughaffal berkata; \"Karena khadzaf tidak akan mengalahkan musuh atau memburunya, akan tetapi hanya mematahkan gigi dan membutakan mata.' "
            },
            {
                "number": 2673,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ أَبِي سُفْيَانَ بْنِ الْعَلَاءِ عَنِ الْحَسَنِ عَنِ ابْنِ مُغَفَّلٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا حَضَرَتْ الصَّلَاةُ وَأَنْتُمْ فِي مَرَابِضِ الْغَنَمِ فَصَلُّوا وَإِذَا حَضَرَتْ وَأَنْتُمْ فِي أَعْطَانِ الْإِبِلِ فَلَا تُصَلُّوا فَإِنَّهَا خُلِقَتْ مِنْ الشَّيَاطِينِ",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Abu Sufyan bin 'Ala`] dari [Al Hasan] dari [Ibnu Mughaffal] ia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Apabila datang waktu sholat, sementara kalian berada di kandang kambing, maka sholatlah kalian. Apabila telah tiba waktu sholat, sementara kalian berada di kandang unta, maka janganlah kalian sholat (di tempat tersebut), karena ia diciptakan dari setan.\""
            },
            {
                "number": 2674,
                "arab": "حَدَّثَنَا وَكِيعٌ وَابْنُ جَعْفَرٍ قَالَا ثَنَا كَهْمَسُ بْنُ الْحَسَنِ عَنِ ابْنِ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ كُلِّ أَذَانَيْنِ صَلَاةٌ ثَلَاثَ مَرَّاتٍ لِمَنْ شَاءَ",
                "id": "Telah menceritakan kepada kami [Waki'] dan [Ibnu Ja'far] keduanya berkata; telah menceritakan kepada kami [Kahmas bin Hasan] dari [Ibnu Buraidah] dari [Abdullah bin Mughaffal] ia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Di antara dua adzan ada sholat -beliau mengucapkan hingga tiga kali- bagi yang menghendakinya.\""
            },
            {
                "number": 2675,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُثْمَانَ بْنِ غِيَاثٍ حَدَّثَنِي أَبُو نَعَامَةَ عَنِ ابْنِ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ قَالَكَانَ أَبُونَا إِذَا سَمِعَ أَحَدًا مِنَّا يَقُولُ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ يَقُولُ إِهِي إِهِي صَلَّيْتُ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ فَلَمْ أَسْمَعْ أَحَدًا مِنْهُمْ يَقُولُ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Utsman bin Ghiyats]; telah menceritakan kepadaku [Abu Na'amah] dari [Ibnu Abdullah bin Al Mughaffal] dia berkata; \"Apabila [ayah kami] mendengar salah seorang dari kami membaca \"BISMILLAAHIR RAHMAANIR RAHIIM, \" dia berkata; \"ihi…ihi…, aku telah sholat di belakang Rasulullah Shallalahu 'Alaihi Wasallam, Abu Bakar dan Umar, namun aku tidak mendengar dari seorangpun dari mereka yang membaca \"BISMILLAAHIR RAHMAANIR RAHIIM.\""
            },
            {
                "number": 2676,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ أَبِي جَعْفَرٍ الرَّازِيِّ عَنِ الرَّبِيعِ بْنِ أَنَسٍ عَنْ أَبِي الْعَالِيَةِ أَوْ عَنْ غَيْرِهِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ وَكَانَ أَحَدَ الرَّهْطِ الَّذِينَ نَزَلَتْ فِيهِمْ هَذِهِ الْآيَةُ{ وَلَا عَلَى الَّذِينَ إِذَا مَا أَتَوْكَ لِتَحْمِلَهُمْ }إِلَى آخِرِ الْآيَةِ قَالَإِنِّي لَآخِذٌ بِغُصْنٍ مِنْ أَغْصَانِ الشَّجَرَةِ أُظِلُّ بِهِ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُمْ يُبَايِعُونَهُ فَقَالُوا نُبَايِعُكَ عَلَى الْمَوْتِ قَالَ لَا وَلَكِنْ لَا تَفِرُّوا",
                "id": "Telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami [Abu Ja'far Ar Razi] dari [Rabi' bin Anas] dari [Abu 'Aliyah] atau yang lain dari [Abdullah bin Mughaffal] -dia adalah salah seorang yang diturunkan ayat ini kepada mereka, yaitu; \"WALAA 'ALAL LADZIINA IDZA MAA ATAUKA LITAHMILAHUM (Dan tiada pula berdosa atas orang-orang yang apabila mereka datang kepadamu, supaya kamu memberi mereka kendaraan).\" (QS At Taubah: 92) sampai akhir ayat, Abdullah bin Mughaffal berkata; \"Sesungguhnya aku pernah mengambil dahan pohon untuk kujadikan tempat naungan Nabi shallallahu 'alaihi wasallam dan para sahabat ketika mereka berbai'at kepada beliau, lalu mereka berkata; \"Apakah kami berbai'at kepadamu untuk mati.\" beliau bersabda: \"Akan tetapi (berbai'atlah) untuk tidak lari.\""
            },
            {
                "number": 2677,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ أَبِي سُفْيَانَ بْنِ الْعَلَاءِ قَالَ سَمِعْتُ الْحَسَنَ يُحَدِّثُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْلَا أَنَّ الْكِلَابَ أُمَّةٌ مِنْ الْأُمَمِ لَأَمَرْتُ بِقَتْلِهَا فَاقْتُلُوا مِنْهَا كُلَّ أَسْوَدَ بَهِيمٍ قَالَ فَقَالَ لَهُ رَجُلٌ يَا أَبَا سَعِيدٍ مِمَّنْ سَمِعْتَ هَذَا قَالَ فَقَالَ حَدَّثَنِيهِ وَحَلَفَ عَبْدُ اللَّهِ بْنُ مُغَفَّلٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُنْذُ كَذَا وَكَذَا وَلَقَدْ حَدَّثَنَا فِي ذَلِكَ الْمَجْلِسِ",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Abu Sufyan bin 'Ala`] ia berkata; \"aku mendengar [Al Hasan] menceritakan bahwa Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Kalau sekiranya anjing-anjing itu bukan termasuk dari golongan umat (dari hewan), tentulah aku perintahkan kalian membunuhnya, oleh karena itu bunuhlah yang berwarna hitam legam.\" Sufyan berkata; \"lalu seseorang bertanya kepada Al Hasan; \"Wahai Abu Sa'id, dari siapakah kalian mendengar hadits ini? Ceritakanlah padaku!.\" Lalu [Abdullah bin Mughaffal] bersumpah bahwa itu dari Nabi Shalallahu 'Alaihi Wasallam sejak sekian dan sekian, sungguh dua telah menceritakan kepada kami di majelis itu.\""
            },
            {
                "number": 2678,
                "arab": "حَدَّثَنَا سَعْدُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا عَبِيدَةُ بْنُ أَبِي رَائِطَةَ الْحَذَّاءُ التَّمِيمِيُّ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ زِيَادٍ أَوْ عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ الْمُزَنِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهَ اللَّهَ فِي أَصْحَابِي اللَّهَ اللَّهَ فِي أَصْحَابِي لَا تَتَّخِذُوهُمْ غَرَضًا بَعْدِي فَمَنْ أَحَبَّهُمْ فَبِحُبِّي أَحَبَّهُمْ وَمَنْ أَبْغَضَهُمْ فَبِبُغْضِي أَبْغَضَهُمْ وَمَنْ آذَاهُمْ فَقَدْ آذَانِي وَمَنْ آذَانِي فَقَدْ آذَى اللَّهَ تَبَارَكَ وَتَعَالَى وَمَنْ آذَى اللَّهَ فَيُوشِكُ أَنْ يَأْخُذَهُحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَوْنٍ الْخَرَّازُ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ عَبِيدَةَ بْنِ أَبِي رَائِطَةَ بِمِثْلِ هَذَا الْحَدِيثِ",
                "id": "Telah menceritakan kepada kami [Sa'ad bin Ibrahim bin Sa'ad], telah menceritakan kepada kami ['Abidah bin Abu Ra`ithah Al Hadza` At Tamimi], ia berkata; telah menceritakan kepadaku [Abdurrahman bin Ziyad] atau Abdurrahman bin Abdullah dari [Abdullah bin Mughaffal Al Muzani] dia berkata; \"Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Takutlah kepada Allah terhadap para sahabatku, takutlah kepada Allah terhadap para sahabatku, janganlah kalian menjadikan mereka sebagai sasaran (cacian dan cercaan) sepeninggalku, barangsiapa mencintai mereka maka dengan kecintaanku aku pun mencintai mereka (yang mencintai sahabat), dan barangsiapa membenci mereka, maka dengan kebencianku aku pun membenci mereka (orang yang membenci para sahabat), dan barangsiapaa menyakiti mereka berarti dia telah menyakitiku dan barangsiapa yang menyakitiku berarti dia telah menyakiti Allah Tabaraka Wata'ala, dan barangsiapa menyakiti Allah, maka hampir saja Allah menyiksanya.\" Telah menceritakan kepada kami [Abdullah bin 'Aun Al Kharraz] telah menceritakan kepada kami [Ibrahim bin Sa'ad] dari ['Abidah bin Abu Ra`ithah] seperti hadits di atas.\""
            },
            {
                "number": 2679,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنِي أَبِي وَحَدَّثَنَا حَسَنٌ وَعَفَّانُ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا حُسَيْنٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ الْمُزَنِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلُّوا قَبْلَ الْمَغْرِبِ رَكْعَتَيْنِ ثُمَّ قَالَ صَلُّوا قَبْلَ الْمَغْرِبِ رَكْعَتَيْنِ ثُمَّ قَالَ عِنْدَ الثَّالِثَةِ لِمَنْ شَاءَ كَرَاهِيَةَ أَنْ يَتَّخِذَهَا النَّاسُ سُنَّةً",
                "id": "Telah menceritakan kepada kami [Abdussamad], telah menceritakan kepadaku [Ayahku] dan telah menceritakan kepada kami [Al Hasan] dan [Affan], telah menceritakan kepada kami [Abdul Warits], telah menceritakan kepada kami [Husain], telah menceritakan kepada kami [Abdullah bin Buraidah] dari [Abdullah Al Muzani] bahwa Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Laksanakanlah sholat (sunnah) dua raka'at sebelum Maghrib.\" kemudian beliau bersabda: \"Laksanakanlah sholat (sunnah) dua raka'at sebelum Maghrib.\" Kemudian yang ketiga kalinya beliau bersabda: \"Bagi siapa yang berkendak.\" Karena dikhawatir orang-orang menganggap sebagai kebiasaan.\""
            },
            {
                "number": 2680,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنِي أَبِي حَدَّثَنَا حُسَيْنٌ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ حَدَّثَنِي عَبْدُ اللَّهِ الْمُزَنِيُّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَغْلِبَنَّكُمْ الْأَعْرَابُ عَلَى اسْمِ صَلَاةِ الْمَغْرِبِقَالَ وَتَقُولُ الْأَعْرَابُ هِيَ الْعِشَاءُ",
                "id": "Telah menceritakan kepada kami [Abdussamad], telah menceritakan kepada kami [Ayahku] telah menceritakan kepada kami [Al Husain] dari [Abdullah bin Buraidah] telah menceritakan kepadaku [Abdullah Al Muzani] bahwa Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Janganlah kalian terkecoh dengan orang-orang badui ketika menyebut sholat Maghrib, \" Perawi berkata; orang-orang badui biasa menyebutnya dengan sholat Isya'.\""
            },
            {
                "number": 2681,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ وَعَفَّانُ قَالَا ثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنِ الْجُرَيْرِيِّ وَقَالَ عَفَّانُ فِي حَدِيثِهِ أَخْبَرَنَا الْجُرَيْرِيُّ عَنْ أَبِي نَعَامَةَأَنَّ عَبْدَ اللَّهِ بْنَ مُغَفَّلٍ سَمِعَ ابْنَهُ يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْقَصْرَ الْأَبْيَضَ عَنْ يَمِينِ الْجَنَّةِ إِذَا دَخَلْتُهَا فَقَالَ يَا بُنَيَّ سَلْ اللَّهَ تَبَارَكَ وَتَعَالَى الْجَنَّةَ وَعُذْ بِهِ مِنْ النَّارِ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَكُونُ قَوْمٌ يَعْتَدُونَ فِي الدُّعَاءِ وَالطَّهُورِ",
                "id": "Telah menceritakan kepada kami [Abdussamad] dan ['Affan] keduanya berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Al Jurairi], - ['Affan] berkata dalam haditsnya; telah mengabarkan kepadaku [Al Jurairi] - dari [Abu Na'amah] bahwa [Abdullah bin Mughaffal] mendengar anaknya berkata; 'ALLAHUMMA INNI AS`ALUKA QASHRA' ABYADH 'AN YAMINIL JANNAH, IDZA DAKHALTUHA (Ya Allah aku bermohon istana putih dari sisi kanan surga bila aku memasukinya).' Lalu ia berkata pada anaknya; 'Wahai anakkku, mintalah pada Allah Tabaraka Wa Ta'ala surga dan berlindunglah pada-Nya dari neraka, karena aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Akan ada suatu kaum yang berlebihan dalam do'a dan bersuci.'"
            },
            {
                "number": 2682,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ أَبِي عُمَيْرِ بْنِ أَنَسٍ عَنْ عُمُومَتِهِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُجَاءَ رَكْبٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَشَهِدُوا أَنَّهُمْ رَأَوْهُ بِالْأَمْسِ يَعْنُونَ الْهِلَالَ فَأَمَرَهُمْ أَنْ يُفْطِرُوا وَأَنْ يَخْرُجُوا مِنْ الْغَدِقَالَ شُعْبَةُ أُرَاهُ مِنْ آخِرِ النَّهَارِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah] dari [Abu Bisyr] dari [Abu Umair bin Anas] dari [kebanyakan para sahabat Nabi] shallallahu 'alaihi wasallam, bahwa serombongan orang datang kepada Nabi shallallahu 'alaihi wasallam, kemudian mereka bersaksi bahwa mereka kemarin melihat yaitu melihat hilal (bulan sabit), lalu beliau menyuruh orang-orang untuk berbuka dan agar besoknya mereka keluar (untuk sholat ied).\" Syu'bah berkata; \"Aku mengiranya di akhir siang.\""
            },
            {
                "number": 2683,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ أَبِي عُمَيْرِ بْنِ أَنَسٍ عَنْ عُمُومَةٍ لَهُ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَا يَشْهَدُهُمَا مُنَافِقٌ يَعْنِي صَلَاةَ الصُّبْحِ وَالْعِشَاءِقَالَ أَبُو بِشْرٍ يَعْنِي لَا يُوَاظِبُ عَلَيْهِمَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah] dari [Abu Bisyr] dari [Abu Umair bin Anas] dari [beberapa sahabat Nabi] shallallahu 'alaihi wasallam dari Nabi shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Orang munafiq tidak akan menghadiri keduanya yaitu sholat Shubuh dan Isya'.\" [Abu Bisyr] berkata (dengan redaksi); \"Tidak membiasakan keduanya.\""
            },
            {
                "number": 2684,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ وَحَجَّاجٌ قَالَا أَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ عَنْ سَلَّامِ بْنِ عَمْرٍو عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِخْوَانُكُمْ فَأَحْسِنُوا إِلَيْهِمْ أَوْ فَأَصْلِحُوا إِلَيْهِمْ وَاسْتَعِينُوهُمْ عَلَى مَا غَلَبَكُمْ وَأَعِينُوهُمْ عَلَى مَا غَلَبَهُمْ قَالَ حَجَّاجٌ فِي حَدِيثِهِ قَالَ سَمِعْتُ سَلَّامَ بْنَ عَمْرٍو وَرَجُلًا مِنْ قَوْمِهِ وَقَالَ حَجَّاجٌ وَأَصْلِحُوا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah] -dan [Hajjaj]; keduanya berkata; telah menceritakan kepada kami [Syu'bah] - dari [Abu Bisyr] dari [Sallam bin 'Amr] dari [salah seorang sahabat Nabi] shallallahu 'alaihi wasallam dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Berbuat baiklah kalian terhadap saudara-saudara kalian, atau perbaikilah (hubungan) kepada mereka dan bantulah mereka atas sesuatu yang kalian mampu dan bantulah mereka terhadap sesuatu yang menimpa mereka.\" [Hajjaj] berkata dalam haditsnya; \"Aku mendengar [Sallam bin Amr] dan [salah seorang] dari kaumnya, dan [Hajjaj] mengatakan; \"Dan perbaikilah (hubungan).\""
            },
            {
                "number": 2685,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا سَعِيدٌ عَنْ مَطَرٍ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ رَجُلٍ مِنَ الْأَنْصَارِأَنَّ رَجُلًا أَوْطَأَ بَعِيرَهُ أُدْحِيَّ نَعَامٍ وَهُوَ مُحْرِمٌ فَكَسَرَ بَيْضَهَا فَانْطَلَقَ إِلَى عَلِيٍّ رَضِيَ اللَّهُ تَعَالَى عَنْهُ فَسَأَلَهُ عَنْ ذَلِكَ فَقَالَ لَهُ عَلِيٌّ عَلَيْكَ بِكُلِّ بَيْضَةٍ جَنِينُ نَاقَةٍ أَوْ ضِرَابُ نَاقَةٍ فَانْطَلَقَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ ذَلِكَ لَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ قَالَ عَلِيٌّ بِمَا سَمِعْتَ وَلَكِنْ هَلُمَّ إِلَى الرُّخْصَةِ عَلَيْكَ بِكُلِّ بَيْضَةٍ صَوْمٌ أَوْ إِطْعَامُ مِسْكِينٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Sa'id] dari [Mathar] dari [Mu'awiyah bin Qurrah] dari [seorang laki-laki dari Anshar] bahwa seorang lelaki yang menderumkan untanya di tempat yang biasa di gunakan binatang bertelur, sementara dia dalam keadaan ihram, tanpa sengaja dia memecahakan telur binatang, kemudian dia pergi menemui Ali radliallahu 'anhu dan menanyakannya tentang hal itu, lalu Ali menjawab; \"Kamu harus mengganti setiap telur dengan satu janin unta atau anak unta, kemudian dia pergi menemui Rasulullah Shallalahu 'Alaihi Wasallam dan menceritakan hal itu, lalu Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Ali telah menjawab sebagaimana yang telah kamu dengar, akan tetapi kemarilah untuk meringankanmu, kamu harus menggantinya setiap telur dengan berpuasa atau memberi makan orang miskin.\""
            },
            {
                "number": 2686,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا عَوْفٌ عَنْ حَسْنَاءَ امْرَأَةٍ مِنْ بَنِي صُرَيْمٍ عَنْ عَمِّهَا قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ النَّبِيُّ فِي الْجَنَّةِ وَالشَّهِيدُ فِي الْجَنَّةِ وَالْمَوْلُودُ فِي الْجَنَّةِ وَالْوَئِيدُ فِي الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami ['Auf] dari [Hasna`] salah seorang wanita dari Bani Shuraim dari [Pamannya] dia berkata; aku mendengar Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Para Nabi akan berada di Syurga, orang yang mati Syahid akan berada di syurga, bayi yang lahir akan berada di Syurga dan orang orang yang dikubur hidup-hidup akan berada di Syurga.\""
            },
            {
                "number": 2687,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا أَبُو بِشْرٍ عَنْ أَبِي عُمَيْرِ بْنِ أَنَسٍ حَدَّثَنِي عُمُومَةٌ لِي مِنَ الْأَنْصَارِ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَغُمَّ عَلَيْنَا هِلَالُ شَوَّالٍ فَأَصْبَحْنَا صِيَامًا فَجَاءَ رَكْبٌ مِنْ آخِرِ النَّهَارِ فَشَهِدُوا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُمْ رَأَوْا الْهِلَالَ بِالْأَمْسِ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُفْطِرُوا مِنْ يَوْمِهِمْ وَأَنْ يَخْرُجُوا لِعِيدِهِمْ مِنْ الْغَدِ",
                "id": "Telah menceritakan kepada kami [Husyaim], telah mengabarkan kepada kami [Abu Bisyr] dari [Abu Umair bin Anas], telah menceritakan kepadaku [kebanyakan para sahabat Anshar] dari sahabat Rasulullah Shallalahu 'Alaihi Wasallam bahwa ia berkata; \"Hilal bulan Syawal telah tertutup awan, maka kami pun berpuasa, lalu seorang pengendara di akhir siang datang sambil bersaksi dihadapan Rasulullah Shallalahu 'Alaihi Wasallam bahwa kemarin mereka telah menyaksikan hilal, kemudian Rasulullah Shallalahu 'Alaihi Wasallam menyuruh orang-orang berbuka di hari itu, dan agar di esok hari mereka keluar untuk berhari raya.\""
            },
            {
                "number": 2688,
                "arab": "حَدَّثَنَا إِسْحَاقُ يَعْنِي الْأَزْرَقَ أَخْبَرَنَا عَوْفٌ حَدَّثَتْنِي حَسْنَاءُ ابْنَةُ مُعَاوِيَةَ الصُّرَيْمِيَّةُ عَنْ عَمِّهَا قَالَقُلْتُ يَا رَسُولَ اللَّهِ مَنْ فِي الْجَنَّةِ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّبِيُّ فِي الْجَنَّةِ وَالشَّهِيدُ فِي الْجَنَّةِ وَالْمَوْلُودُ فِي الْجَنَّةِ وَالْمَوْءُودَةُ فِي الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Ishaq yaitu Al `Azraq], telah mengabarkan kepada kami ['Auf], telah menceritakan kepadaku [Hasna` binti Mu'awiyah Ash Shuraimiyyah] dari [Pamannya] ia berkata; Aku berkata; \"Wahai RAsulullah, siapa saja yang berada di surga?.\" Nabi shallallahu 'alaihi wasallam bersabda: \"Para Nabi akan berada di Syurga, orang yang mati Syahid akan berada di syurga, bayi yang lahir akan berada di Syurga dan orang orang yang dikubur hidup-hidup akan berada di Syurga.\""
            },
            {
                "number": 2689,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ إِسْحَاقَ بْنَ سُوَيْدٍ قَالَ سَمِعْتُ مُطَرِّفَ بْنَ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ يُحَدِّثُ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَكَانَ بِالْكُوفَةِ أَمِيرٌ قَالَ فَخَطَبَ يَوْمًا فَقَالَ إِنَّ فِي إِعْطَاءِ هَذَا الْمَالِ فِتْنَةً وَفِي إِمْسَاكِهِ فِتْنَةً وَبِذَلِكَ قَامَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي خُطْبَتِهِ حَتَّى فَرَغَ ثُمَّ نَزَلَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah] ia berkata; aku mendengar [Ishaq bin Suwaid] berkata; Aku mendengar [Mutharrif bin Abdullah bin Syikhkhir] bercerita dari [salah seorang sahabat Nabi] shallallahu 'alaihi wasallam, dia berkata; \"Dahulu di Kufah ada seorang gubernur, dia melanjutkan; \"Pada suatu hari, gubernur itu berkhutbah dan berkata; \"Sesungguhnya pada pemberian harta ini adalah fitnah (ujian) dan menyimpannya juga fitnah, oleh karena itulah Nabi shallallahu 'alaihi wasallam berdiri dalam khutbahnya, sehingga beliau selesai dan turun dari mimbar.\""
            },
            {
                "number": 2690,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ حُمَيْدَ بْنَ هِلَالٍ يُحَدِّثُ عَنْ مُطَرِّفٍ عَنْ أَعْرَابِيٍّ أَنَّهُرَأَى عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعْلَيْنِ مَخْصُوفَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah] ia berkata; Aku mendengar [Humaid bin Hilal] bercerita dari [Mutharrif] dari [seorang badui] bahwa ia melihat Nabi Shalallahu 'Alaihi Wasallam memakai sandal yang ditambal (dijahit).\""
            },
            {
                "number": 2691,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا عُثْمَانُ بْنُ غِيَاثٍ قَالَ سَمِعْتُ أَبَا السَّلِيلِ قَالَكَانَ رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحَدِّثُ النَّاسَ حَتَّى يُكْثَرَ عَلَيْهِ فَيَصْعَدَ عَلَى ظَهْرِ بَيْتٍ فَيُحَدِّثَ النَّاسَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ آيَةٍ فِي الْقُرْآنِ أَعْظَمُ قَالَ فَقَالَ رَجُلٌ{ اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ }قَالَ فَوَضَعَ يَدَهُ بَيْنَ كَتِفَيَّ قَالَ فَوَجَدْتُ بَرْدَهَا بَيْنَ ثَدْيَيَّ أَوْ قَالَ فَوَضَعَ يَدَهُ بَيْنَ ثَدْيَيَّ فَوَجَدْتُ بَرْدَهَا بَيْنَ كَتِفَيَّ قَالَ يَهْنِكَ يَا أَبَا الْمُنْذِرِ الْعِلْمَ الْعِلْمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Utsman bin Ghiyats], dia berkata; aku mendengar [Abu As Salil] berkata; [Salah seorang sahabat Nabi] shallallahu 'alaihi wasallam menyampaikan hadits kepada khalayak sehingga orang-orang banyak berkumpul disekitarnya, kemudian dia naik ke atap rumah dan menyampaikan hadits kepada orang-orang, dia berkata; \"Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Ayat apakah yang paling agung dalam Al Qur'an?.\" Sahabat Nabi itu berkata; \"kemudian salah seorang lelaki menjawab: \"Allaahu laa ilaaha illaa huwal hayyul qoyyuum\" dia berkata lagi; \"lalu beliau meletakkan tangannya di antara kedua bahuku, dia berkata; \"Maka aku rasakan dingin di antara kedua dadaku.\" atau dia berkata; \"Lalu dia meletakkan tangannya di antara dadaku, maka aku merasakan dinginnya di antara kedua bahuku, \" lalu beliau bersabda; \"Berbahagialah kamu wahai [Abul Mundzir], itulah ilmu, itulah ilmu.\""
            },
            {
                "number": 2692,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا ابْنُ عَوْنٍ حَدَّثَنَا رَجُلٌ مِنْ أَهْلِ الْبَادِيَةِ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّهُ حَجَّ مَعَ ذِي قَرَابَةٍ لَهُ مُقْتَرِنًا بِهِ فَرَآهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا هَذَا قَالَ إِنَّهُ نَذْرٌ فَأَمَرَ بِالْقِرَانِ أَنْ يُقْطَعَ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah menceritakan kepada kami [Ibnu 'Aun] telah menceritakan kepada kami [seorang lelaki] dari penduduk dusun dari [Ayahnya] dari [Kakeknya] bahwa dia pernah melaksanakan haji diiringi dengan kerabatnya, lalu Nabi shallallahu 'alaihi wasallam melihatnya dan beliau bertanya: \"Ada apa ini?\" dia menjawab; \"Ini adalah Nadzar, \" kemudian beliau memerintahkan untuk memutuskan (memulangkan) orang yang menyertainya.\""
            },
            {
                "number": 2693,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ وَعَبْدَةُ قَالَا ثَنَا عَاصِمٌ عَنْ أَبِي الْعَالِيَةِ قَالَ حَدَّثَنِي مَنْ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُأَعْطُوا كُلَّ سُورَةٍ حَظَّهَا مِنْ الرُّكُوعِ وَالسُّجُودِ",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] dan ['Abdah], keduanya berkata; telah menceritakan kepada kami ['Ashim] dari [Abu 'Aliyah] dia berkata; telah menceritakan kepadaku [orang yang mendengar Nabi] shallallahu 'alaihi wasallam bahwa beliau bersabda: \"Berikanlah setiap surat haknya dari Ruku' dan sujud.\""
            },
            {
                "number": 2694,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ عَاصِمٍ عَنْ أَبِي تَمِيمَةَ الْهُجَيْمِيِّ عَمَّنْ كَانَ رَدِيفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَكُنْتُ رَدِيفَهُ عَلَى حِمَارٍ فَعَثَرَ الْحِمَارُ فَقُلْتُ تَعِسَ الشَّيْطَانُ فَقَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقُلْ تَعِسَ الشَّيْطَانُ فَإِنَّكَ إِذَا قُلْتَ تَعِسَ الشَّيْطَانُ تَعَاظَمَ الشَّيْطَانُ فِي نَفْسِهِ وَقَالَ صَرَعْتُهُ بِقُوَّتِي فَإِذَا قُلْتَ بِسْمِ اللَّهِ تَصَاغَرَتْ إِلَيْهِ نَفْسُهُ حَتَّى يَكُونَ أَصْغَرَ مِنْ ذُبَابٍ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq], telah menceritakan kepada kami [Ma'mar] dari ['Ashim] dari [Abu Tamimah Al Hujaimi] dari [orang yang pernah membonceng Nabi] shallallahu 'alaihi wasallam dia berkata; \"Aku pernah memboncengkan beliau menunggang keledai, kemudian keledai itu tergelincir, maka aku berkata; \"Celakalah syetan, \" Kemudian Nabi shallallahu 'alaihi wasallam bersabda kepadaku: \"Janganlah kamu katakan celakalah syetan, karena jika kamu mengatakan celakalah syetan, maka syetan akan membanggakan dirinya. Syetan berkata; \"Aku telah melawannya dengan kekuatanku, \" dan jika kamu membaca BISMILLAAH maka syetan akan merasa dirinya kecil hingga lebih kecil dari seekor lalat.\""
            },
            {
                "number": 2695,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ قَالَ سَمِعْتُ أَبَا تَمِيمَةَ يُحَدِّثُ عَنْ رَدِيفِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ شُعْبَةُ قَالَ عَاصِمٌ عَنْ أَبِي تَمِيمَةَ عَنْ رَجُلٍ عَنْ رَدِيفِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَعَثَرَ بِالنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِمَارُهُ فَقُلْتُ تَعِسَ الشَّيْطَانُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقُلْ تَعِسَ الشَّيْطَانُ فَإِنَّكَ إِذَا قُلْتَ تَعِسَ الشَّيْطَانُ تَعَاظَمَ وَقَالَ بِقُوَّتِي صَرَعْتُهُ وَإِذَا قُلْتَ بِسْمِ اللَّهِ تَصَاغَرَ حَتَّى يَصِيرَ مِثْلَ الذُّبَابِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah] dari ['Ashim] ia berkata; Aku mendengar [Abu Tamimah] menceritakan dari [seorang yang membonceng Nabi] Shalallahu 'Alaihi Wasallam. [Syu'bah] mengatakan; telah menceritakan kepada kami ['Ashim] dari [Abu Tamimah] dari [seseorang yang membonceng keledai Nabi] Shalallahu 'Alaihi Wasallam, kemudian keledai itu tergelincir, maka aku berkata; \"Celakalah syetan, \" maka Nabi shallallahu 'alaihi wasallam bersabda: \"Janganlah kamu katakan celakalah syetan, karena jika kamu mengatakan celakalah syetan, maka syetan akan membanggakan dirinya. Syetan akan berkata; \"Aku telah melawannya dengan kekuatanku, \" namun jika kamu membaca BISMILLAAH, maka syetan akan merasa kecil dirinya sehingga lebih kecil dari seekor lalat.\""
            },
            {
                "number": 2696,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا جَرِيرُ بْنُ حَازِمٍ حَدَّثَنَا الْحَسَنُ عَنْ صَعْصَعَةَ بْنِ مُعَاوِيَةَ عَمِّ الْفَرَزْدَقِأَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَرَأَ عَلَيْهِ{ فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ }قَالَ حَسْبِي لَا أُبَالِ أَنْ لَا أَسْمَعَ غَيْرَهَاحَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا جَرِيرٌ قَالَ سَمِعْتُ الْحَسَنَ قَالَ ثَنَا صَعْصَعَةُ بْنُ مُعَاوِيَةَ عَمُّ الْفَرَزْدَقِ قَالَ قَدِمْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمِعْتُهُ يَقْرَأُ هَذِهِ الْآيَةَ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun], telah menceritakan kepada kami [Jarir bin Hazim], telah menceritakan kepada kami [Al Hasan] dari [Sha'sha'ah bin Mu'awiyah] pamannya Farazdaq bahwa dia datang kepada Nabi shallallahu 'alaihi wasallam lalu beliau membacakan kepadanya: \"Faman Ya'mal Mitsqaala Dzarratin Khairay Yarah Wa Man Ya'mal Mitsqaala Dzaratin Syarray Yarah (Barangsiapa yang mengerjakan kebaikan seberat dzarrahpun, niscaya dia akan melihat (balasan) nya. Dan barangsiapa yang mengerjakan kejahatan sebesar dzarrahpun, niscaya dia akan melihat (balasan) nya pula) QS Al Zalzalah; 7-8. Dia berkata; \"cukuplah bagiku, aku tidak perduli dan tidak akan mendengarkan yang lainnya.\" Telah menceritakan kepada kami [Aswad bin Amir] telah menceritakan kepada kami [Jarir] ia berkata; \"Aku mendengar [Al Hasan] berkata; telah menceritakan kepada kami [Sha'sha'ah bin Mu'awiyah] pamannya Al Farazdaq, dia berkata; \"Aku datang kepada Nabi shallallahu 'alaihi wasallam, kemudian aku mendengar beliau membaca ayat ini, lalu dia menyebutkan hadits yang semakna.\""
            },
            {
                "number": 2697,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ قَالَ سَمِعْتُ الْحَسَنَ قَالَقَدِمَ عَمُّ الْفَرَزْدَقِ صَعْصَعَةُ الْمَدِينَةَ لَمَّا سَمِعَ{ مَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَهُ }قَالَ حَسْبِي لَا أُبَالِ أَنْ لَا أَسْمَعَ غَيْرَ هَذَا",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Jarir bin Hazim], ia berkata; Aku mendengar [Al Hasan] berkata; Ketika Pamannya Farazdaq yaitu [Sha'sha'ah] tiba di Madinah, ia mendengar; \"Faman Ya'mal Mitsqaala Dzarratin Khairay Yarah Wa Man Ya'mal Mitsqaala Dzarratin Syarray Yarah (Barangsiapa yang mengerjakan kebaikan seberat dzarrahpun, niscaya dia akan melihat (balasan) nya. Dan barangsiapa yang mengerjakan kejahatan sebesar dzarrahpun, niscaya dia akan melihat (balasan) nya pula) QS Al Zalzalah; 7-8. Dia berkata; \"cukuplah bagiku, aku tidak perduli akan mendengarkan yang lainnya.\""
            },
            {
                "number": 2698,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا مَنْصُورُ بْنُ سَعْدٍ عَنْ بُدَيْلٍ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ مَيْسَرَةَ الْفَجْرِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ مَتَى كُتِبْتَ نَبِيًّا قَالَ وآدَمُ عَلَيْهِ السَّلَام بَيْنَ الرُّوحِ وَالْجَسَدِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi], telah menceritakan kepada kami [Manshur bin Sa'd] dari [Budail] dari [Abdullah bin Syaqiq] dari [Maysarah Al Fajr] dia berkata; aku bertanya; \"Wahai Rasulullah, kapankah engkau dicatat sebagai seorang Nabi?\" Beliau bersabda: \"Ketika Adam 'alaihis salam antara Ruh dan Jasad.\""
            },
            {
                "number": 2699,
                "arab": "حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ سُلَيْمَانَ يَعْنِي التَّيْمِيَّ عَنْ أَنَسٍ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيْلَةَ أُسْرِيَ بِهِ مَرَرْتُ عَلَى مُوسَى صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي فِي قَبْرِهِ",
                "id": "Telah menceritakan kepada kami [Ibnu Abi 'Adi] dari [Sulaiman yaitu At Taimi] dari [Anas] dari [sebagian sahabat Nabi] shallallahu 'alaihi wasallam bahwa Nabi shallallahu 'alaihi wasallam bersabda pada malam Isra`: \"Aku melewati Musa 'alaihis salam, ketikaitu Musa tengah melaksanakan sholat di kuburannya.\""
            },
            {
                "number": 2700,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنِي عُمَرُ بْنُ فَرُّوخَ حَدَّثَنِي بِسْطَامُ عَنْ أَعْرَابِيٍّ تَضَيَّفَهُمْأَنَّهُ صَلَّى مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمَ تَسْلِيمَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Abdusshamad], telah menceritakan kepada kami [Amr bin Farrukh] telah menceritakan kepadaku [Bistham] dari [seorang arab badui] yang menjamu mereka bahwa dia melaksanakan sholat bersama Nabi shallallahu 'alaihi wasallam, lalu beliau salam dengan dua kali salam.\""
            },
            {
                "number": 2701,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ حَدَّثَنَا عُمَرُ بْنُ فَرُّوخَ حَدَّثَنَا بِسْطَامُ الْكُوفِيُّ قَالَتَضَيَّفَنَا أَعْرَابِيٌّ فَحَدَّثَ الْأَعْرَابِيُّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَلَّمَ تَسْلِيمَتَيْنِ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id], telah menceritakan kepada kami [Umar bin Farrukh] telah menceritakan kepada kami [Bistham Al Kufi] ia berkata; seorang badui pernah menjamu kami, lalu [seorang badui] bercerita dari Nabi shallallahu 'alaihi wasallam, bahwa dirinya pernah melaksanakan sholat bersama Nabi shallallahu 'alaihi wasallam, lalu beliau salam dengan dua kali salam, ke kanan dan ke kiri.\""
            },
            {
                "number": 2702,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا سُفْيَانُ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ عَنْ مُحَمَّدِ بْنِ أَبِي عَائِشَةَ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَعَلَّكُمْ تَقْرَءُونَ خَلْفَ الْإِمَامِ وَالْإِمَامُ يَقْرَأُ قَالُوا إِنَّا لَنَفْعَلُ ذَلِكَ قَالَ فَلَا تَفْعَلُوا إِلَّا أَنْ يَقْرَأَ أَحَدُكُمْ بِأُمِّ الْكِتَابِ أَوْ قَالَ فَاتِحَةِ الْكِتَابِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Adam], telah menceritakan kepada kami [Sufyan] dari [Khalid] dari [Abu Qilabah] dari [Muhammad bin Abu 'Aisyah] dari [seorang sahabat Nabi] Shalallahu 'Alaihi Wasallam, ia berkata; \"Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Apakah kalian membaca di belakang imam sedang imam jiga membaca (ayat)?\" Mereka menjawab; \"Ya, sungguh kami melakukan hal itu.\" Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Janganlah kalian lakukan lagi, kecuali kalian membaca Ummul Kitab -atau bersabda- membaca Al Fatihah.\""
            },
            {
                "number": 2703,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ أَخْبَرَنَا أَيُّوبُ عَنْ هَارُونَ بْنِ رِئَابٍ عَنْ كِنَانَةَ بْنِ نُعَيْمٍ عَنْ قَبِيصَةَ بْنِ الْمُخَارِقِ قَالَحُمِّلْتُ حَمَالَةً فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْتُهُ فِيهَا فَقَالَ أَقِمْ حَتَّى تَأْتِيَنَا الصَّدَقَةُ فَإِمَّا أَنْ نَحْمِلَهَا وَإِمَّا أَنْ نُعِينَكَ فِيهَا وَقَالَ إِنَّ الْمَسْأَلَةَ لَا تَحِلُّ إِلَّا لِثَلَاثَةٍ لِرَجُلٍ تَحَمَّلَ حَمَالَةَ قَوْمٍ فَيَسْأَلُ فِيهَا حَتَّى يُؤَدِّيَهَا ثُمَّ يُمْسِكُ وَرَجُلٍ أَصَابَتْهُ جَائِحَةٌ اجْتَاحَتْ مَالَهُ فَيَسْأَلُ فِيهَا حَتَّى يُصِيبَ قَوَامًا مِنْ عَيْشٍ أَوْ سِدَادًا مِنْ عَيْشٍ ثُمَّ يُمْسِكُ وَرَجُلٍ أَصَابَتْهُ فَاقَةٌ فَيَسْأَلُ حَتَّى يُصِيبَ قَوَامًا مِنْ عَيْشٍ أَوْ سِدَادًا مِنْ عَيْشٍ ثُمَّ يُمْسِكُ وَمَا سِوَى ذَلِكَ مِنْ الْمَسَائِلِ سُحْتًا يَا قَبِيصَةُ يَأْكُلُهُ صَاحِبُهُ سُحْتًا",
                "id": "Telah menceritakan kepada kami [Isma'il], telah mengabarkan kepada kami [Ayyub] dari [Harun bin Ri`ab] dari [Kinanah bin Nu'aim] dari [Qabishah bin Al Mukhariq] ia berkata; \"Saya mempunyai tanggungan hutang, maka kutemui Nabi shallallahu 'alaihi wasallam dan kuminta beliau untuk memberesi hutangku. Kata beliau: \"Tetaplah engkau berdiam disini, nanti kami yang akan memberesi tanggunganmu atau aku sekedar menolongmu.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Qabishah, meminta-minta tidak halal kecuali bagi salah satu dari tiga orang yaitu; Pertama, orang yang mempunyai tanggungan (hutang) yang menjadikannya terpaksa meminta sehingga bisa ia melunasi tanggungannya, lalu ia menahan diri (tidak meminta), kedua, seseorang yang tertekan oleh keterbatasan (pailit) yang menjadikan hartanya ludes sehingga ia terpaksa meminta hingga ia memperoleh penopang kehidupan atau solusi kehidupan, kemudian ia menahan diri (tidak meminta), dan ketiga, seseorang yang betul-betul terhimpit kefakiran atau kebutuhan mendesak, sehingga ia terpaksa meminta, sampai ia peroleh penopang kehidupan atau solusi kehidupan, selanjutnya ia menahan diri, adapun meminta-minta selain karena tiga alasan ini, wahai Qabishah, adalah dosa yang disantap oleh pelakunya.\""
            },
            {
                "number": 2704,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنِ الْحَسَنِ عَنْ أَبِي كَرِيمَةَ حَدَّثَنِي رَجُلٌ مِنْ أَهْلِ الْبَصْرَةِ عَنْ قَبِيصَةَ بْنِ الْمُخَارِقِ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِي يَا قَبِيصَةُ مَا جَاءَ بِكَ قُلْتُ كَبِرَتْ سِنِّي وَرَقَّ عَظْمِي فَأَتَيْتُكَ لِتُعَلِّمَنِي مَا يَنْفَعُنِي اللَّهُ عَزَّ وَجَلَّ بِهِ قَالَ يَا قَبِيصَةُ مَا مَرَرْتَ بِحَجَرٍ وَلَا شَجَرٍ وَلَا مَدَرٍ إِلَّا اسْتَغْفَرَ لَكَ يَا قَبِيصَةُ إِذَا صَلَّيْتَ الْفَجْرَ فَقُلْ ثَلَاثًا سُبْحَانَ اللَّهِ الْعَظِيمِ وَبِحَمْدِهِ تُعَافَى مِنْ الْعَمَى وَالْجُذَامِ وَالْفَالِجِ يَا قَبِيصَةُ قُلْ اللَّهُمَّ إِنِّي أَسْأَلُكَ مِمَّا عِنْدَكَ وَأَفِضْ عَلَيَّ مِنْ فَضْلِكَ وَانْشُرْ عَلَيَّ رَحْمَتَكَ وَأَنْزِلْ عَلَيَّ مِنْ بَرَكَاتِكَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] dari [Al Hasan] dari [Abu Karimah] telah menceritakan kepadaku [seorang lelaki] dari penduduk Bashrah, dari [Qabishah bin Al Mukhariq], dia berkata; \"Aku datang menemui Rasulullah Shallalahu 'Alaihi Wasallam, lalu beliau bertanya kepadaku: \"Wahai Qobishah, apa yang membuatmu datang kesini?.\" aku menjawab; \"Usiaku semakin tua, tulang-tulangku mulai rapuh, maka aku datang kepadamu agar supaya engkau mengajariku sesuatu yang bermanfaat bagiku kepada Allah Azza Wa Jalla.\" Beliau lalu bersabda: \"Wahai Qabishah, tidaklah kamu melewati sebongkah batu atau sebatang pohon atau perkampungan, melainkan mereka akan memohonkan ampun untukmu, wahai Qabishah, apabila kamu (selesai) mengerjakan sholat Shubuh, maka bacalah tiga kali \"subhaanallaahal 'adziim wa bihamdihi (Maha suci Allah lagi maha Agung, dan segala puji bagi-Mu) \" niscaya kamu akan terhindar dari kebutaan, penyakit kusta dan setruk, wahai Qabishah bacalah \"Allaahumma innii as'aluka mimmaa 'indaka wa afidl 'alaiya min fadlika wansyur 'alaiya rahmataka wa anzil 'alaiya min barakaatika.\" (ya Allah, sesungguhnya aku memohon kepadaMu apa apa yang ada di sisiMu, berikanlah kemurahan-Mu kepadaku, curahkanlah rahmatMu kepadaku dan turunkanlah keberkahanMu kepadaku).\""
            },
            {
                "number": 2705,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا عَوْفٌ عَنْ حَيَّانَ أَبِي الْعَلَاءِ عَنْ قَطَنِ بْنِ قَبِيصَةَ عَنْ قَبِيصَةَ بْنِ الْمُخَارِقِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْعِيَافَةَ وَالطِّيَرَةَ وَالطَّرْقَ مِنْ الْجِبْتِ",
                "id": "Telah menceritakan kepada kami [Rauh], telah menceritakan kepada kami ['Auf] dari [Hayyan Abul Ala`] dari [Qathan bin Qabishah] dari [Qabishah bin Mukhariq] dari Nabi Shalallahu 'Alaihi Wasallam, beliau bersabda: \"Sesungguhnya 'iyafah, thayarah dan tharq termasuk jibt.\" "
            },
            {
                "number": 2706,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا عَوْفٌ عَنْ حَيَّانَ حَدَّثَنِي قَطَنُ بْنُ قَبِيصَةَ عَنْ أَبِيهِأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْعِيَافَةَ وَالطَّرْقَ وَالطِّيَرَةَ مِنْ الْجِبْتِقَالَ عَوْفٌ الْعِيَافَةُ زَجْرُ الطَّيْرِ وَالطَّرْقُ الْخَطُّ يُخَطُّ فِي الْأَرْضِ وَالْجِبْتُ قَالَ الْحَسَنُ إِنَّهُ الشَّيْطَانُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami ['Auf] dari [Hayyan], telah menceritakan kepadaku [Qathan bin Qabishah] dari [Qabishah bin Al Mukharriq] dari Nabi Shalallahu 'Alaihi Wasallam, beliau bersabda: \"Sesungguhnya 'iyafah, thayarah dan tharq termasuk jibt.\" ['Auf] berkata; \"'iyafah adalah meramal dengan burung, sedangkan tharq adalah mempercayai garis-garis yang digambar di atas tanah, kata Al Hasan al Jibt adalah setan.\" "
            },
            {
                "number": 2707,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا التَّيْمِيُّ عَنْ أَبِي عُثْمَانَ عَنْ قَبِيصَةَ بْنِ مُخَارِقٍ وَزُهَيْرِ بْنِ عَمْرٍو قَالَلَمَّا نَزَلَتْ{ وَأَنْذِرْ عَشِيرَتَكَ الْأَقْرَبِينَ }صَعِدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَقْمَةً مِنْ جَبَلٍ عَلَى أَعْلَاهَا حَجَرٌ فَجَعَلَ يُنَادِي يَا بَنِي عَبْدِ مَنَافٍ إِنَّمَا أَنَا نَذِيرٌ إِنَّمَا مَثَلِي وَمَثَلُكُمْ كَرَجُلٍ رَأَى الْعَدُوَّ فَذَهَبَ يَرْبَأُ أَهْلَهُ فَخَشِيَ أَنْ يَسْبِقُوهُ فَجَعَلَ يُنَادِي وَيَهْتِفُ يَا صَبَاحَاهْحَدَّثَنَا إِسْمَاعِيلُ عَنِ التَّيْمِيِّ عَنْ أَبِي عُثْمَانَ عَنْ قَبِيصَةَ بْنِ مُخَارِقٍ وَزُهَيْرِ بْنِ عَمْرٍو قَالَا لَمَّا نَزَلَتْ{ وَأَنْذِرْ عَشِيرَتَكَ الْأَقْرَبِينَ }فَذَكَرَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id], telah menceritakan kepada kami [At Taimi] dari [Abu Utsman] dari [Qabishah bin Mukhariq] dan [Zuhair bin 'Amru] berkata; \"Ketika turun ayat wa andzir 'asyirataka wal `aqrabiin (dan serulah keluarga dan sanak dekatmu!) Rasulullah Shallalahu 'Alaihi Wasallam langsung naik bukit yang disekitarnya bebatuan, beliau menyeru: \"Wahai bani Abdu Manaf, sungguh aku hanyalah pemberi peringatan, permisalan aku dengan kalian adalah semisal seorang yang melihat musuhnya, lalu ia pergi dan menjaga keselamatan keluarganya, dan ia khawatir jika musuh tersebut akan mendahului (menyerang), lalu berteriak dengan suara yang lantang; \"Pagi yang berbahaya.\" Telah menceritakan kepada kami [Isma'il] dari [At Taimi] dari [Abu Utsman] dari [Qabishah bin Mukhariq] dan [Zuhair bin 'Amru] ia berkata; \"Ketika turun ayat wa andzir 'syirataka wal `aqrabiin (dan serulah keluarga dan sanak dekatmu!), lalu ia menyebutkan hadits yang serupa."
            },
            {
                "number": 2708,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ عَنْ قَبِيصَةَ قَالَانْكَسَفَتْ الشَّمْسُ فَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى رَكْعَتَيْنِ فَأَطَالَ فِيهِمَا الْقِرَاءَةَ فَانْجَلَتْ فَقَالَ إِنَّ الشَّمْسَ وَالْقَمَرَ آيَتَانِ مِنْ آيَاتِ اللَّهِ تَبَارَكَ وَتَعَالَى يُخَوِّفُ بِهِمَا عِبَادَهُ فَإِذَا رَأَيْتُمْ ذَلِكَ فَصَلُّوا كَأَحْدَثِ صَلَاةٍ صَلَّيْتُمُوهَا مِنْ الْمَكْتُوبَةِحَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ عَنْ قَبِيصَةَ الْهِلَالِيِّ قَالَ انْكَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا يَوْمَئِذٍ مَعَهُ بِالْمَدِينَةِ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Abdul Wahab Ats Tsaqafi], telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dari [Qabishah] dia berkata; \"Telah terjadi gerhana matahari, lalu Rasulullah Shallalahu 'Alaihi Wasallam keluar untuk melaksanakan sholat dua raka'at, beliau memanjangkan bacaannya dalam dua raka'at tersebut, hingga matahari nampak kembali, lalu beliau bersabda: \"Sesungguhnya matahari dan bulan adalah dua tanda di antara tanda-tanda kekuasaan Allah Tabaraka wa Ta'ala, dengan maksud memberikan rasa takut kepada hamba-hambaNya, apabila kalian melihat gerhana (matahari atau bulan), maka laksanakanlah sholat seperti sholat yang pertama kali kalian lakukan dari sholat wajib.\" Telah menceritakan kepada kami [Abu Sa'id] bekas budak Bani Hasyim, telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dari [Qabishah Al Hilali] dia berkata; \"Pernah terjadi gerhana matahari pada masa Rasulullah Shallalahu 'Alaihi Wasallam, ketika itu aku bersama beliau di Madinah, kemudian dia menyebutkan hadits yang semakna.\""
            },
            {
                "number": 2709,
                "arab": "حَدَّثَنِي وَكِيعٌ حَدَّثَنَا قُرَّةُ عَنْ حُمَيْدِ بْنِ هِلَالٍ الْعَدَوِيِّ عَنْ رَجُلٍ مِنْهُمْ يُقَالُ لَهُ خَالِدُ بْنُ عُمَيْرٍ فَقَالَ أَبُو نَعَامَةَ سَمِعْتُهُ مِنْ خَالِدِ بْنِ عُمَيْرٍ قَالَخَطَبَنَا عُتْبَةُ بْنُ غَزْوَانَ قَالَ أَبُو نَعَامَةَ عَلَى الْمِنْبَرِ وَلَمْ يَقُلْهُ قُرَّةُ فَقَالَ أَلَا إِنَّ الدُّنْيَا قَدْ آذَنَتْ بِصَرْمٍ وَوَلَّتْ حَذَّاءَ وَلَمْ يَبْقَ مِنْهَا إِلَّا صُبَابَةٌ كَصُبَابَةِ الْإِنَاءِ وَأَنْتُمْ فِي دَارٍ مُنْتَقِلُونَ عَنْهَا فَانْتَقِلُوا بِخَيْرِ مَا بِحَضْرَتِكُمْ فَلَقَدْ رَأَيْتُنِي سَابِعَ سَبْعَةٍ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لَنَا طَعَامٌ نَأْكُلُهُ إِلَّا وَرَقُ الشَّجَرِ حَتَّى قَرِحَتْ أَشْدَاقُنَاقَالَ أَبُو عَبْد الرَّحْمَنِ سَمِعْت أَبِي يَقُولُ مَا حَدَّثَ بِهَذَا الْحَدِيثِ غَيْرُ وَكِيعٍ يَعْنِي أَنَّهُ غَرِيبٌ حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا أَيُّوبُ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ رَجُلٍ قَالَ أَيُّوبُ أُرَاهُ خَالِدَ بْنَ عُمَيْرٍ قَالَ سَمِعْتُ عُتْبَةَ بْنَ غَزْوَانَ يَخْطُبُ فَذَكَرَ الْحَدِيثَ قَالَ وَلَقَدْ رَأَيْتُنِي سَابِعَ سَبْعَةٍ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ قَالَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا لَنَا طَعَامٌ إِلَّا الشَّجَرَ أَوْ قَالَ وَرَقَ الشَّجَرِ حَتَّى قَرِحَتْ أَشْدَاقُنَا قَالَ أَبِي أَبُو نَعَامَةَ هَذَا عَمْرُو بْنُ عِيسَى وَأَبُو نَعَامَةَ السَّعْدِيُّ آخَرُ أَقْدَمُ مِنْ هَذَا وَهَذَا أَكْبَرُ مِنْ ذَاكَ",
                "id": "Telah menceritakan padaku [Waki'], telah menceritakan kepada kami [Qurrah] dari [Humaid bin Hilal Al 'Adawi] dari seseorang dari mereka yang dikenal dengan [Khalid bin 'Umair]. - [Abu Na'amah] berkata; Aku mendengranya dari [Khalid bin 'Umair] - berkata; [Utbah bin Ghazwan] pernah berkhutbah dihadapan kami; - [Abu Na'amah] mengatakan; di atas mimbar- namun [Qurrah] tidak menyebutkan (diatas mimbar), lalu Utbah berkata; \"Sungguh dunia itu fana dan akan sirna dengan cepat, dan tidak ada yang tersisa kecuali seperti sisa air di dalam bejana, sementara kalian akan berpindah darinya, maka berpindahlah dengan kebaikan dari yang telah kalian dapat, aku telah mendapatkan bersama Rasulullah shallallahu 'alaihi wasallam selama tujuh hari berturut, tidak mendapatkan makanan kecuali dedaunan pohon, hingga mulut-mulut kami terluka.\" Abu Abdurrahman berkata; Aku mendengar ayahku mengatakan; 'Tidaklah menceritakan hadits ini selain Waki' yaitu bahwa hadits ini gharib. Telah menceritakan kepada kami [Isma'il], telah menceritakan kepada kami [Ayyub] dari [Humaid bin Hilal] dari seseorang, [Ayyub] mengatakan; menurutku dia adalah [Khalid bin 'Umair], ia berkata; Aku mendengar [Utbah bin Ghazwan] berkhutbah dan ia menyebutkan hadits ini, ia berkata; \"Kami pernah bersama Nabi shallallahu 'alaihi wasallam selama tujuh hari berturut-turut.\" Atau (dengan redaksi yang lain) salah seorang sahabat Nabi shallallahu 'alaihi wasallam berkata; 'Dan tidaklah kami mendapat makanan kecuali pohon -atau berkata; dedaunan pohon- hingga mulut-mulut kami terluka.' Ayahku berkata; Abu 'Na'amah adalah 'Amru bin Isa, sedangkan Abu Na'amah As Sa'di adalah orang lain, ia lebih didahulukan karena ia lebih tua darinya."
            },
            {
                "number": 2710,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنِ الْأَغَرِّ عَنْ خَلِيفَةَ بْنِ حُصَيْنٍ عَنْ جَدِّهِ قَيْسِ بْنِ عَاصِمٍأَنَّهُ أَسْلَمَ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَغْتَسِلَ بِمَاءٍ وَسِدْرٍ",
                "id": "Telah menceritakan kepada kami [Abdurrahman], telah menceritakan kepada kami [Sufyan] dari [Aghar] dari [Khalifah bin Hushain] dari kakeknya yaitu [Qais bin 'Ashim] bahwa dia masuk Islam, kemudian Nabi shallallahu 'alaihi wasallam memerintahkannya agar mandi dengan air yang di campur dengan daun bidara.\""
            },
            {
                "number": 2711,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ مُطَرِّفِ بْنِ الشِّخِّيرِ وَحَجَّاجٌ قَالَ حَدَّثَنِي شُعْبَةُ قَالَ حَجَّاجٌ فِي حَدِيثِهِ سَمِعْتُ مُطَرِّفَ بْنَ الشِّخِّيرِ يُحَدِّثُ عَنْ حَكِيمِ بْنِ قَيْسِ بْنِ عَاصِمٍ عَنْ أَبِيهِأَنَّهُ أَوْصَى وَلَدَهُ عِنْدَ مَوْتِهِ قَالَ اتَّقُوا اللَّهَ عَزَّ وَجَلَّ وَسَوِّدُوا أَكْبَرَكُمْ فَإِنَّ الْقَوْمَ إِذَا سَوَّدُوا أَكْبَرَهُمْ خَلَفُوا أَبَاهُمْ فَذَكَرَ الْحَدِيثَ وَإِذَا مُتُّ فَلَا تَنُوحُوا عَلَيَّ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يُنَحْ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah] ia berkata; Aku mendengar [Qatadah] menceritakan dari [Mutharrif bin Asy Syikhir] -dan [Hajjaj] berkata; [Syu'bah] telah bercerita kepadaku, [Hajjaj] mengatakan dalam haditsnya; \"Aku mendengar [Mutharrif bin Asy Syikhir] bercerita- dari [Hakim bin Qais bin 'Ashim] dari [Ayahnya] bahwa menjelang wafat, dia sempat berwasiat kepada anak-anaknya, katanya; \"Bertaqwalah kalian kepada Allah 'azza wajalla dan jadikanlah orang yang paling tua di antara kalian sebagai pemimpin, karena bila suatu kaum menjadikan orang yang paling tua sebagai pemimpin, maka mereka mewakili bapak-bapak mereka.\" Kemudian dia menyebutkan hadits, dan jika aku meninggal, maka janganlah kalian meratapiku, karena Rasulullah shallallahu 'alaihi wasallam tidaklah diratapi.\""
            },
            {
                "number": 2712,
                "arab": "حَدَّثَنَا هُشَيْمٌ قَالَ مُغِيرَةُ أَخْبَرَ عَنْ أَبِيهِ عَنْ شُعْبَةَ بْنِ التَّوْأَمِ عَنْ قَيْسِ بْنِ عَاصِمٍأَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْحِلْفِ فَقَالَ مَا كَانَ مِنْ حِلْفٍ فِي الْجَاهِلِيَّةِ فَتَمَسَّكُوا بِهِ وَلَا حِلْفَ فِي الْإِسْلَامِحَدَّثَنَا إِبْرَاهِيمُ بْنُ زِيَادٍ سَبَلَانُ حَدَّثَنَا عَبَّادُ بْنُ عَبَّادٍ عَنْ شُعْبَةَ عَنْ مُغِيرَةَ عَنْ أَبِيهِ عَنْ شُعْبَةَ بْنِ التَّوْأَمِ عَنْ قَيْسِ بْنِ عَاصِمٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Husyaim]. [Mughirah] mengatakan; ia dikabari dari [Ayahnya] dari [Syu'bah bin Tau`am] dari [Qais bin 'Ashim] bahwa dia bertanya kepada Nabi shallallahu 'alaihi wasallam tentang sumpah.\" Kemudian beliau bersabda: \"(Sekarang) tak berlaku lagi ikrar kesepakatan (koalisi) yang terjadi semasa jahiliyah lantas mereka pertahankan, dan tak ada ikrar kesepakatan (koalisi) karena dorongan kejahiliyahan dalam Islam.\" Telah menceritakan kepada kami [Ibrahim bin Ziyad Sabalan], telah menceritakan kepada kami ['Abbad bin 'Abbad] dari [Syu'bah] dari [Mughirah] dari [Ayahnya] dari [Syu'bah bin At Tau'am] dari [Qais bin 'Ashim] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas.\""
            },
            {
                "number": 2713,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ الْأَغَرِّ الْمِنْقَرِيِّ عَنْ خَلِيفَةَ بْنِ حُصَيْنِ بْنِ قَيْسِ بْنِ عَاصِمٍ عَنْ أَبِيهِأَنَّ جَدَّهُ أَسْلَمَ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهُ أَنْ يَغْتَسِلَ بِمَاءٍ وَسِدْرٍ",
                "id": "Telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami [Sufyan] dari [Al Aghar Al Minqari] dari [Khalifah bin Hushain bin Qais bin 'Ashim] dari [Ayahnya] bahwa Kakeknya, dia masuk Islam di zaman Nabi Shalallahu 'Alaihi Wasallam, lalu beliau memerintahkannya untuk mandi dengan air dan daun bidara.\""
            },
            {
                "number": 2714,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا مَنْصُورٌ وَيُونُسُ عَنِ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَقَالَ لِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَبْدَ الرَّحْمَنِ بْنَ سَمُرَةَ إِذَا آلَيْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَأْتِ الَّذِي هُوَ خَيْرٌ وَكَفِّرْ عَنْ يَمِينِكَ",
                "id": "Telah menceritakan kepada kami [Husyaim], telah mengabarkan kepada kami [Manshur] dan [Yunus] dari [Al Hasan] dari [Abdurrahman bin Samurah] dia berkata; \"Nabi Shallalahu 'Alaihi Wasallam bersabda kepadaku: \"Wahai Abdurrahman bin Samurah, jika kamu telah bersumpah, kemudian melihat ada yang lebih baik darinya, maka lakukanlah yang lebih baik darinya dan bayarlah kafarat sumpahmu.\""
            },
            {
                "number": 2715,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا الْجُرَيْرِيُّ عَنْ حَيَّانَ بْنِ عُمَيْرٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ قَالَبَيْنَمَا أَنَا أَتَرَامَى بِأَسْهُمِي فِي حَيَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاللَّهِ إِذْ كُسِفَتِ الشَّمْسُ فَنَبَذْتُهُنَّ وَسَعَيْتُ أَنْظُرُ مَا حَدَثَ كُسُوفِ الشَّمْسِ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِذَا هُوَ رَافِعٌ يَدَيْهِ يُسَبِّحُ اللَّهَ عَزَّ وَجَلَّ وَيَحْمَدُ وَيُهَلِّلُ وَيُكَبِّرُ وَيَدْعُو فَلَمْ يَزَلْ كَذَلِكَ حَتَّى حُسِرَ عَنْ الشَّمْسِ فَقَرَأَ سُورَتَيْنِ وَرَكَعَ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Ibrahim], telah menceritakan kepada kami [Al Jurairi] dari [Hayyan bin Umair] bahwa [Abdurrahman bin Samurah] telah menceritakan kepada kami, dia berkata; \"Ketika aku sedang latihan melempar anak panah pada masa Rasulullah Shallalahu 'Alaihi Wasallam, tiba-tiba terjadi gerhana matahari, kemudian aku lemparkan anak panah itu dan berusaha untuk melihat apa yang dilakukan oleh Rasulullah Shallalahu 'Alaihi Wasallam dengan gerhana matahari itu, ternyata beliau mengangkat kedua tangannya bertasbih kepada Allah 'azza wajalla, bertahmid, bertahlil, bertakbir dan berdo'a, beliau terus-menerus tak henti-hentinya melaksanakan hal itu hingga matahari nampak kembali, kemudian beliau membaca dua surat dan melaksanakan sholat dua raka'at.\""
            },
            {
                "number": 2716,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا يُونُسُ عَنِ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَبْدَ الرَّحْمَنِ لَا تَسْأَلْ الْإِمَارَةَ فَإِنَّكَ إِنْ أُعْطِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا وَإِنْ أُعْطِيتَهَا عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَأْتِ الَّذِي هُوَ خَيْرٌ وَكَفِّرْ عَنْ يَمِينِكَ",
                "id": "Telah menceritakan kepada kami [Isma'il], telah menceritakan kepada kami [Yunus] dari [Al Hasan] dari [Abdurrahman bin Samurah] ia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda kepadaku: \"Wahai Abdurrahman, janganlah kamu meminta jabatan, sebab jika engkau diberi karena meminta, kamu akan ditelantarkan, dan jika kamu diberi karena tidak meminta, maka kamu akan ditolong, dan jika kamu melakukan sumpah, lantas kamu melihat suatu hal yang lebih baik, maka lakukanlah yang lebih baik dan bayarlah kaffarat sumpahmu.\""
            },
            {
                "number": 2717,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ يَعْلَى بْنِ حَكِيمٍ عَنْ أَبِي لَبِيدٍ قَالَغَزَوْنَا مَعَ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ كَابُلَ فَأَصَابَ النَّاسُ غَنَمًا فَانْتَهَبُوهَا فَأَمَرَ عَبْدُ الرَّحْمَنِ مُنَادِيًا يُنَادِي إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ انْتَهَبَ نُهْبَةً فَلَيْسَ مِنَّا فَرُدُّوا هَذِهِ الْغَنَمَ فَرَدُّوهَا فَقَسَمَهَا بِالسَّوِيَّةِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi], telah menceritakan kepada kami [Jarir bin Hazim] dari [Ya'la bin Hakim] dari [Abu Lubaid] dia berkata; \"Kami pernah ikut berperang bersama Abdurrahman bin Samurah di Kabul, kemudian kaum muslimin mendapatkan ghanimah, lalu mereka berebut mengambilnya, maka [Abdurrahman] menyuruh salah seorang untuk menyeru; \"Sesungguhnya aku mendengar Rasulullah Shallalahu 'Alaihi Wasallam bersabda: 'Barangsiapa mengambil ghanimah (sebelum dibagi), maka bukan termasuk dari golongan kami, ' maka kembalikanlah ghanimah ini, \" lalu mereka mengembalikannya kemudian Abdurrahman membagikannya dengan rata.\""
            },
            {
                "number": 2718,
                "arab": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا الْمُبَارَكُ حَدَّثَنَا الْحَسَنُ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ الْقُرَشِيُّ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَبْدَ الرَّحْمَنِ لَا تَسْأَلْ الْإِمَارَةَ فَإِنَّكَ إِنْ أُعْطِيتَهَا عَنْ مَسْأَلَةٍ أُوكِلْتَ إِلَيْهَا وَإِنْ أُعْطِيتَهَا عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَأْتِ الَّذِي هُوَ خَيْرٌ وَكَفِّرْ عَنْ يَمِينِكَحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا سِمَاكُ بْنُ عَطِيَّةَ وَيُونُسُ بْنُ عُبَيْدٍ عَنِ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim], telah menceritakan kepada kami [Al Mubarak], telah menceritakan kepada kami [Al Hasan], telah menceritakan kepadaku [Abdurrahman bin Samurah Al Qurasyi] ia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda kepadaku: \"Wahai Abdurrahman, janganlah kamu meminta jabatan, sebab jika engkau diberi karena meminta, kamu akan ditelantarkan, dan jika kamu diberi karena tidak meminta, maka kamu akan ditolong, dan jika kamu melakukan sumpah, lantas kamu melihat ada suatu hal yang lebih baik, maka lakukanlah yang lebih baik dan bayarlah kafarat sumpahmu.\" Telah menceritakan kepada kami [Abu Kamil Al Jahdari], telah menceritakan kepada kami [Hammad bin Zaid], telah menceritakan kepada kami [Simak bin 'Athiyah] dan [Yunus bin 'Ubaid] dari [Al Hasan] dari [Abdurrahman bin Samurah] dari Nabi Shalallahu 'Alaihi Wasallam seperti hadits di atas."
            },
            {
                "number": 2719,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هِشَامٌ عَنِ الْحَسَنِ عَنِ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَحْلِفُوا بِآبَائِكُمْ وَلَا بِالطَّوَاغِيتِ وَقَالَ يَزِيدُ وَالطَّوَاغِي",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun], telah menceritakan kepada kami [Hisyam] dari [Al Hasan] dari [Abdurrahman bin Samurah] dari Nabi Shallalahu 'Alaihi Wasallam beliau bersabda: \"Janganlah kalian bersumpah dengan (nama) bapak-bapak kalian, dan jangan pula dengan para thagut.\" [Yazid] berkata (dengan redaksi); \"At Thawaghi (thagut).\" "
            },
            {
                "number": 2720,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ عَنِ ابْنِ عَوْنٍ عَنِ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَذَكَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَقَالَ لَا تَسْأَلْ الْإِمَارَةَ فَإِنَّكَ إِنْ تُعْطَهَا عَنْ غَيْرِ مَسْأَلَةٍ تُعَنْ عَلَيْهَا وَإِنْ تُعْطَهَا عَنْ مَسْأَلَةٍ تُكَلْ إِلَيْهَا وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَأْتِ الَّذِي هُوَ خَيْرٌ وَكَفِّرْ عَنْ يَمِينِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu 'Adi] dari [Ibnu 'Aun] dari [Al Hasan] dari [Abdurrahman bin Samurah] ia berkata; Nabi Shalallahu 'Alaihi Wasallam pernah menyebutkan sesuatu, lalu beliau bersabda: \"Janganlah kamu meminta jabatan, sebab jika engkau diberi karena tidak memintanya, maka kamu akan ditolong, dan jika kamu diberi karena memintanya, maka kamu akan ditelantarkan, dan jika kamu bersumpah, lantas kamu melihat ada suatu hal yang lebih baik, maka lakukanlah yang lebih baik dan bayarlah kafarat sumpahmu.\""
            },
            {
                "number": 2721,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ حَدَّثَنَا هِشَامٌ عَنِ الْحَسَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ لَهُ يَا عَبْدَ الرَّحْمَنِ لَا تَسْأَلْ الْإِمَارَةَ فَإِنَّكَ إِنْ أُعْطِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا وَإِنْ أُعْطِيتَهَا عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَكَفِّرْ عَنْ يَمِينِكَ وَأْتِ الَّذِي هُوَ خَيْرٌ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Bakar], telah menceritakan kepada kami [Hisyam] dari [Al Hasan] dari [Abdurrahman bin Samurah] dari Nabi Shalallahu 'Alaihi Wasallam beliau bersabda: \"Wahai Abdurrahman, janganlah kamu meminta jabatan, sebab jika kamu diberi karena memintanya, maka kamu akan ditelantarkan, dan jika kamu diberi karena tidak memintanya, maka kamu akan ditolong, dan jika kamu bersumpah, lalu kamu melihat ada suatu hal yang lebih baik, maka bayarlah kafarat sumpahmu dan lakukanlah yang lebih baik.\""
            },
            {
                "number": 2722,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ وَعَفَّانُ قَالَا ثَنَا جَرِيرُ بْنُ حَازِمٍ قَالَ سَمِعْتُ الْحَسَنَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَبْدَ الرَّحْمَنِ لَا تَسْأَلْ الْإِمَارَةَ فَإِنَّكَ إِنْ أُوتِيتَهَا عَنْ مَسْأَلَةٍ وُكِلْتَ إِلَيْهَا وَإِنْ أُوتِيتَهَا عَنْ غَيْرِ مَسْأَلَةٍ أُعِنْتَ عَلَيْهَا وَإِذَا حَلَفْتَ عَلَى يَمِينٍ فَرَأَيْتَ غَيْرَهَا خَيْرًا مِنْهَا فَكَفِّرْ عَنْ يَمِينِكَ وَأْتِ الَّذِي هُوَ خَيْرٌقَالَ أَبِي اتَّفَقَ عَفَّانُ وَأَسْوَدُ فِي حَدِيثِهِمَا فَقَالَ فَكَفِّرْ عَنْ يَمِينِكَ ثُمَّ ائْتِ الَّذِي هُوَ خَيْرٌ و قَالَ أَبُو الْأَشْهَبِ عَنِ الْحَسَنِ فِي هَذَا الْحَدِيثِ فَبَدَأَ بِالْكَفَّارَةِ حَدَّثَنَا حُسَيْنٌ حَدَّثَنَا الْمُبَارَكُ عَنِ الْحَسَنِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ الْقُرَشِيُّ وَنَحْنُ بِكَابُلَ قَالَ قَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَبْدَ الرَّحْمَنِ لَا تَسْأَلْ الْإِمَارَةَ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Aswad bin 'Amir] dan ['Affan] keduanya berkata; telah menceritakan kepada kami [Jarir bin Hazim], ia berkata; Aku mendengar hadits ini dari [Al Hasan] dari [Abdurrahman bin Samurah] berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda kepadaku: \"Wahai Abdurrahman, janganlah kamu meminta jabatan, sebab jika kamu diberi karena memintanya, maka kamu akan diterlantarkan, dan jika kamu diberi karena tidak memintanya, maka kamu akan ditolong, dan jika kamu bersumpah, lantas kamu melihat ada suatu hal yang lebih baik, maka bayarlah kafarat sumpahmu dan lakukanlah yang lebih baik.\" Ayahku berkata; Affan dan Aswad sepakat dalam hadits keduanya, maka ayahku berkata; \"Bayarlah kafarat sumpahmu, lalu kerjakanlah yang lebih baik darinya.\" [Abul Asyhab] berkata dari [Al Hasan] mengenai hadits ini, ia memulainya dengan \"kafarat\" Telah menceritakan kepada kami [Husain], telah menceritakan kepada kami [Al Mubarak] dari [Al Hasan], telah menceritakan kepada kami [Abdurrahman bin Samurah Al Quraisyi] seadngkan ketika itu kami berada di Kabul, ia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda padaku: \"Wahai Abdurrahman, janganlah kamu meminta jawaban, \" Lalu menyebutkan hadits tersebut."
            },
            {
                "number": 2723,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ حَدَّثَنَا يَعْلَى بْنُ حَكِيمٍ عَنْ أَبِي لَبِيدٍ قَالَغَزَوْنَا مَعَ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ كَابُلَ قَالَ فَأَصَابَ النَّاسُ غَنِيمَةً فَانْتَهَبُوهَا فَأَمَرَ عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ مُنَادِيًا يُنَادِي فَنَادَى فَاجْتَمَعَ النَّاسُ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ انْتَهَبَ فَلَيْسَ مِنَّا رُدُّوهَا فَرَدُّوهَا فَقَسَمَهَا بَيْنَهُمْ بِالسَّوِيَّةِ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Jarir bin Hazim], telah menceritakan kepada kami [Ya'la bin Hakim] dari [Abu Labid] ia berkata; \"Aku pernah berperang bersama Abdurrahman bin Samurah di Kabul, kemudian kaum muslimin mendapatkan ghanimah, lantas mereka berebut mengambilnya, maka [Abdurrahman bin Samurah] menyuruh salah seorang untuk menyeru, hingga orang-orang berkumpul, ia menyeru; \"Aku mendengar Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Barangsiapa mengambil ghanimah (sebelum dibagi), maka bukan termasuk dari golongan kami, oleh karena itu kembalikanlah ghanimah ini, \" lalu mereka mengembalikannya, kemudian Abdurrahman membagikannya dengan rata.\""
            },
            {
                "number": 2724,
                "arab": "حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا يُونُسُ بْنُ عُبَيْدٍ عَنْ عَبْدِ رَبِّهِ الْهُجَيْمِيِّ عَنْ جَابِرِ بْنِ سُلَيْمٍ أَوْ سُلَيْمٍ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا هُوَ جَالِسٌ مَعَ أَصْحَابِهِ قَالَ فَقُلْتُ أَيُّكُمْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَإِمَّا أَنْ يَكُونَ أَوْمَأَ إِلَى نَفْسِهِ وَإِمَّا أَنْ يَكُونَ أَشَارَ إِلَيْهِ الْقَوْمُ قَالَ فَإِذَا هُوَ مُحْتَبٍ بِبُرْدَةٍ قَدْ وَقَعَ هُدْبُهَا عَلَى قَدَمَيْهِ قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَجْفُو عَنْ أَشْيَاءَ فَعَلِّمْنِي قَالَ اتَّقِ اللَّهَ عَزَّ وَجَلَّ وَلَا تَحْقِرَنَّ مِنْ الْمَعْرُوفِ شَيْئًا وَلَوْ أَنْ تُفْرِغَ مِنْ دَلْوِكَ فِي إِنَاءِ الْمُسْتَسْقِي وَإِيَّاكَ وَالْمَخِيلَةَ فَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى لَا يُحِبُّ الْمَخِيلَةَ وَإِنْ امْرُؤٌ شَتَمَكَ وَعَيَّرَكَ بِأَمْرٍ يَعْلَمُهُ فِيكَ فَلَا تُعَيِّرْهُ بِأَمْرٍ تَعْلَمُهُ فِيهِ فَيَكُونَ لَكَ أَجْرُهُ وَعَلَيْهِ إِثْمُهُ وَلَا تَشْتُمَنَّ أَحَدًا",
                "id": "Telah menceritakan kepada kami [Husyaim], telah menceritakan kepada kami [Yunus bin Ubaid], dari [Abdurrabbih Al Hujaimi] dari [Jabir bin Sulaim] atau Sulaim dia berkata; \"Aku datang kepada Nabi Shallalahu 'Alaihi Wasallam ketika beliau sedang duduk bersama para sahabatnya, Sulaim berkata; kemudian aku bertanya; \"Siapakah di antara kalian yang disebut sebagai Nabi Shallalahu 'Alaihi Wasallam?, Sulaim melanjutkan; -Beliau waktu itu menunjuk dirinya sendiri atau mungkin ditunjuk oleh para sahabatnya- dan ternyata dia berselimutkan selendang yang ujungnya sampai menyentuh kedua kakinya.\" Sulaim berkata; maka aku bertanya; \"Wahai Rasulullah, aku merasa bodoh terhadap banyak hal, maka ajarilah aku!\" beliau menjawab: \"Bertaqwalah kepada Allah 'azza wajalla, dan janganlah meremehkan kebaikan sekecil apapun, sekalipun hanya dengan menuangkan ember airmu ke bejana orang yang membutuhkan air, dan jauhilah olehmu kesombongan, karena Allah Tabaraka Wata'ala menykai kesombongan, jika ada seseorang yang mencacimu dan menghinamu karena dia tahu tentang dirimu, maka janganlah kamu membalas menghinanya karena kamu tahu tentang dia, maka itu akan menjadi pahalamu dan akan menjadi dosa baginya, dan janganlah kamu sekali-kali mencaci seseorang.\""
            },
            {
                "number": 2725,
                "arab": "حَدَّثَنَا يَزِيدُ أَخْبَرَنَا سَلَّامُ بْنُ مِسْكِينٍ عَنْ عَقِيلِ بْنِ طَلْحَةَ حَدَّثَنَا أَبُو جُرَىٍّ الْهُجَيْمِيُّ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا قَوْمٌ مِنْ أَهْلِ الْبَادِيَةِ فَعَلِّمْنَا شَيْئًا يَنْفَعُنَا اللَّهُ تَبَارَكَ وَتَعَالَى بِهِ قَالَ لَا تَحْقِرَنَّ مِنْ الْمَعْرُوفِ شَيْئًا وَلَوْ أَنْ تُفْرِغَ مِنْ دَلْوِكَ فِي إِنَاءِ الْمُسْتَسْقِي وَلَوْ أَنْ تُكَلِّمَ أَخَاكَ وَوَجْهُكَ إِلَيْهِ مُنْبَسِطٌ وَإِيَّاكَ وَتَسْبِيلَ الْإِزَارِ فَإِنَّهُ مِنْ الْخُيَلَاءِ وَالْخُيَلَاءُ لَا يُحِبُّهَا اللَّهُ عَزَّ وَجَلَّ وَإِنْ امْرُؤٌ سَبَّكَ بِمَا يَعْلَمُ فِيكَ فَلَا تَسُبَّهُ بِمَا تَعْلَمُ فِيهِ فَإِنَّ أَجْرَهُ لَكَ وَوَبَالَهُ عَلَى مَنْ قَالَهُحَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا سَلَّامٌ حَدَّثَنَا عَقِيلُ بْنُ طَلْحَةَ عَنْ أَبِي جُرَيٍّ الْهُجَيْمِيِّ أَنَّهُ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أُنَاسٍ مِنْ أَهْلِ الْبَادِيَةِ فَقَالُوا إِنَّا مِنْ أَهْلِ الْبَادِيَةِ فَذَكَرَ الْحَدِيثَ إِلَّا أَنَّهُ قَالَ فَلَا تَشْتُمْهُ بِمَا تَعْلَمُ فِيهِ فَإِنَّ أَجْرَ ذَلِكَ لَكَ وَوَبَالَهُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Yazid], telah mengabarkan kepada kami [Sallam bin Miskin] dari ['Aqil bin Thalhah], telah menceritakan kepada kami [Abu Jurai Al Hujaimi] ia berkata; Aku datang kepada Rasulullah Shallalahu 'Alaihi Wasallam, lalu aku bertanya; \"Wahai Rasulullah, sesungguhnya kami adalah satu kaum dari penduduk dusun, maka ajarkanlah pada kami seseuatu yang Allah Tabaraka wa Ta'ala akan memberikan manfaat buat kami!.\" Beliau bersabda: \"Janganlah meremehkan kebaikan sekecil apapun, sekalipun hanya dengan menuangkan ember airmu ke bejana orang yang membutuhkan air, dan sekalipun kamu berbicara dengan saudaramu dengan wajah berseri-seri, dan janganlah engkau menurunkan kain di bawah mata kaki (isbal) karena ia bagian dari sifat sombong, sementara Allah 'azza wajalla tidak menyukai menyukai sifat sombong, jika ada seseorang yang mencacimu dan menghinamu karena dia tahu tentang dirimu, maka janganlah kamu menghinanya karena kamu tahu tentang dia, maka itu akan menjadi pahalamu dan akan menjadi dosa baginya.\" Telah menceritakan kepada kami [Abdushamad], telah menceritakan kepada kami [Sallam], telah menceritakan kepada kami ['Aqil bin Thalhah] dari [Abu Jurai Al Hujaimi] bahwa ia datang bersama dengan penduduk dusun kepada Rasulullah Shallalahu 'Alaihi Wasallam, lalu mereka berkata; \"Sugguh kami dari penduduk dusun… lalu ia menyebutkan hadits, kecuali ada tambahan dengan redaksi; \"Maka janganlah kamu menghinanya dengan apa yang engkau tahu, karena pahalanya untukmu dan dosanya untuknya.\""
            },
            {
                "number": 2726,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا يُونُسُ حَدَّثَنَا عَبِيدَةُ الْهُجَيْمِيُّ عَنْ أَبِي تَمِيمَةَ الْهُجَيْمِيِّ عَنْ أَبِي جُرَيٍّ جَابِرِ بْنِ سُلَيْمٍ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ مُحْتَبٍ بِشَمْلَةٍ لَهُ وَقَدْ وَقَعَ هُدْبُهَا عَلَى قَدَمَيْهِ فَقُلْتُ أَيُّكُمْ مُحَمَّدٌ أَوْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَوْمَأَ بِيَدِهِ إِلَى نَفْسِهِ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي مِنْ أَهْلِ الْبَادِيَةِ وَفِيَّ جَفَاؤُهُمْ فَأَوْصِنِي فَقَالَ لَا تَحْقِرَنَّ مِنْ الْمَعْرُوفِ شَيْئًا وَلَوْ أَنْ تَلْقَى أَخَاكَ وَوَجْهُكَ مُنْبَسِطٌ وَلَوْ أَنْ تُفْرِغَ مِنْ دَلْوِكَ فِي إِنَاءِ الْمُسْتَسْقِي وَإِنْ امْرُؤٌ شَتَمَكَ بِمَا يَعْلَمُ فِيكَ فَلَا تَشْتُمْهُ بِمَا تَعْلَمُ فِيهِ فَإِنَّهُ يَكُونُ لَكَ أَجْرُهُ وَعَلَيْهِ وِزْرُهُ وَإِيَّاكَ وَإِسْبَالَ الْإِزَارِ فَإِنَّ إِسْبَالَ الْإِزَارِ مِنْ الْمَخِيلَةِ وَإِنَّ اللَّهَ عَزَّ وَجَلَّ لَا يُحِبُّ الْمَخِيلَةَ وَلَا تَسُبَّنَّ أَحَدًا فَمَا سَبَبْتُ بَعْدَهُ أَحَدًا وَلَا شَاةً وَلَا بَعِيرًا",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammad bin Salamah], telah menceritakan kepada kami [Yunus], telah menceritakan kepada kami ['Abidah Al Hujaimi] dari [Abu Tamimah Al Hujaimi] dari [Abu Jurai Jabir bin Sulaim] ia berkata; Aku datang kepada Rasulullah Shallalahu 'Alaihi Wasallam, waktu itu beliau tengah berselimutkan selendang yang ujungnya sampai menyentuh kedua kakinya, kemudian aku bertanya; \"Siapakah yang bernama Muhammad atau Rasulullah shallallahu 'alaihi wasallam di antara kalian?, lalu beliau menunjuk pada dirinya. aku pun berkata; \"Wahai Rasulullah, sesungguhnya aku dari penduduk dusun, sementara diriku adalah orang yang bodoh diantara mereka, maka berilah aku wasiat!\" beliau bersabda: \"Janganlah kamu meremehkan kebaikan sekecil apapun, sekalipun hanya dengan menuangkan ember airmu ke bejana orang yang membutuhkan air. Jika ada seseorang yang mencacimu dan menghinamu karena dia tahu tentang dirimu, maka janganlah kamu membalas menghinanya, dengan sesuatu yang kamu tahu dengan dia, karena itu akan menjadi pahalamu dan akan menjadi dosa baginya. Janganlah kamu sekali-kali mencaci seseorang, dan jauhilah olehmu isbal (menurunkan kain dibawah mata kaki), karena isbal adalah bagian dari kesombongan, karena Allah Azza wa Jalla sangat membencinya, dan janganlah kamu menghina seseorang!.\" Setelah itu aku tidak pernah menghina seorang pun, tidak juga menghina kambing atau keledai.\""
            },
            {
                "number": 2727,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَاهُ وُهَيْبٌ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي تَمِيمَةَ الْهُجَيْمِيِّ عَنْ رَجُلٍ مِنْ بَلْهُجَيْمٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِلَامَ تَدْعُو قَالَ أَدْعُو إِلَى اللَّهِ وَحْدَهُ الَّذِي إِنْ مَسَّكَ ضُرٌّ فَدَعَوْتَهُ كَشَفَ عَنْكَ وَالَّذِي إِنْ ضَلَلْتَ بِأَرْضٍ قَفْرٍ دَعَوْتَهُ رَدَّ عَلَيْكَ وَالَّذِي إِنْ أَصَابَتْكَ سَنَةٌ فَدَعَوْتَهُ أَنْبَتَ عَلَيْكَ قَالَ قُلْتُ فَأَوْصِنِي قَالَ لَا تَسُبَّنَّ أَحَدًا وَلَا تَزْهَدَنَّ فِي الْمَعْرُوفِ وَلَوْ أَنْ تَلْقَى أَخَاكَ وَأَنْتَ مُنْبَسِطٌ إِلَيْهِ وَجْهُكَ وَلَوْ أَنْ تُفْرِغَ مِنْ دَلْوِكَ فِي إِنَاءِ الْمُسْتَسْقِي وَاتَّزِرْ إِلَى نِصْفِ السَّاقِ فَإِنْ أَبَيْتَ فَإِلَى الْكَعْبَيْنِ وَإِيَّاكَ وَإِسْبَالَ الْإِزَارِ فَإِنَّ إِسْبَالَ الْإِزَارِ مِنْ الْمَخِيلَةِ وَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى لَا يُحِبُّ الْمَخِيلَةَ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Wuhaib], telah menceritakan kepada kami [Khalid Al Hadza`] dari [Abu Tamimah Al Hujaimi] dari [seorang] yang berasal dari pendudukl Balhujaim, ia berkata; Aku bertanya; \"Wahai Rasulullah, kepada siapakah engkau menyeru?.\" Rasulullah Shallalahu 'Alaihi Wasallam menjawab: \"Aku menyeru kepada Allah semata, Dzat yang apabila kamu terkena bencana lalu kamu memohon pada-Nya, maka Dia akan menjauhkanmu dari bencana tersebut, Dzat yang apabila kamu tersesat di suatu padang tandus, lalu kamu meminta-Nya, maka Dia akan menunjukimu, Dzat yang apabila kamu terkena paceklik, lalu kamu memohon kepada-Nya, maka Dia akan tumbuhkan tanaman-tanaman untukmu.\" Aku berkata; \"Lalu wasiatkanlah untukku!.\" Beliau menjawab: \"Janganlah kamu menghina seseorang dan jangan meremehkan kebaikan sedikit pun, walau dengan memberi senyuman kepada saudaramu bila bertemu, atau hanya dengan menuangkan ember airmu ke bejana orang yang membutuhkan air, dan bercelanalah setangah betis, bila kamu merasa enggan, maka (bercelanalah) hingga mata kaki. Janganlah engkau berbuat isbal karena isbal merupakan bagian dari kesombongan dan Allah membenci kesombongan.\""
            },
            {
                "number": 2728,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ قَالَ سَمِعْتُ الْحَسَنَ يَقُولُ وَيَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا جَرِيرُ بْنُ حَازِمٍ حَدَّثَنَا الْحَسَنُ قَالَدَخَلَ عَائِذُ بْنُ عَمْرٍو قَالَ يَزِيدُ وَكَانَ مِنْ صَالِحِي أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى عُبَيْدِ اللَّهِ بْنِ زِيَادٍ فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ شَرُّ الرِّعَاءِ الْحُطَمَةُ قَالَ عَبْدُ الرَّحْمَنِ فَأَظُنُّهُ قَالَ إِيَّاكَ أَنْ تَكُونَ مِنْهُمْ وَلَمْ يَشُكَّ يَزِيدُ فَقَالَ اجْلِسْ إِنَّمَا أَنْتَ مِنْ نُخَالَةِ أَصْحَابِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ وَهَلْ كَانَتْ لَهُمْ أَوْ فِيهِمْ نُخَالَةٌ إِنَّمَا كَانَتْ النُّخَالَةُ بَعْدَهُمْ وَفِي غَيْرِهِمْ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Jarir bin Hazim] ia berkata; aku mendengar [Al Hasan] ia berkata; -dan [Yazid bin Harun] mengatakan; telah mengabarkan kepada kami [Jarir bin Hazim] telah menceritakan kepada kami [Al Hasan] - ia berkata; [A'idz bin Amru] datang -sedangkan Yazid mengatakan; A'idz bin 'Amru termasuk salah seorang yang paling shalih di antara sahabat Nabi Shallalahu 'Alaihi Wasallam- menemui Ubaidillah bin Ziyad, kemudian dia berkata; \"Sesungguhnya aku mendengar Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Sejahat-jahat penguasa adalah yang berlaku dzalim.\" Abdurrahman mengatakan; \"Aku mengira A'idz mengatakan: \"Dan janganlah kalian termasuk dari mereka.\" dan Yazid tidak ragu (mengenai redaksi haditsnya), lalu ubaidhullah bin Ziyad berkata; \"Duduklah, karena kamu termasuk dari pemuka nukhalah para sahabat Muhammad Shallalahu 'Alaihi Wasallam.\" 'Aidz bertanya; \"Apakah di antara mereka memiliki nukhalah atau di antara mereka ada nukhalah? hanyasannya nukhalah itu untuk (generasi) setelah mereka dan untuk selain mereka.\" "
            },
            {
                "number": 2729,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي شِمْرٍ الضُّبَعِيِّ قَالَسَمِعْتُ عَائِذَ بْنَ عَمْرٍو يَنْهَى عَنْ الدُّبَّاءِ وَالْحَنْتَمِ وَالْمُزَفَّتِ وَالنَّقِيرِ فَقُلْتُ لَهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abu Syimr Adluba'i], dia berkata; aku mendengar [A'idz bin 'Amru] melarang dari dubba', Hantam, Al Muzaffat, dan An Naqir.\" Lalu aku bertanya; \"Apakah ini dari Nabi Shalallahu 'Alaihi Wasallam?.\" Ia menjawab; \"Ya.\" "
            },
            {
                "number": 2730,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ عَنْ سُلَيْمَانَ يَعْنِي التَّيْمِيَّ عَنْ شَيْخٍ فِي مَجْلِسِ أَبِي عُثْمَانَ عَنْ عَائِذِ بْنِ عَمْرٍو قَالَكَانَ فِي الْمَاءِ قِلَّةٌ فَتَوَضَّأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَدَحٍ أَوْ فِي جَفْنَةٍ فَنَصَحَنَا بِهِ قَالَ وَالسَّعِيدُ فِي أَنْفُسِنَا مَنْ أَصَابَهُ وَلَا نُرَاهُ إِلَّا قَدْ أَصَابَ الْقَوْمَ كُلَّهُمْ قَالَ ثُمَّ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الضُّحَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Adi] dari [Sulaiman At Taimi] dari [seorang syaikh] di majelisnya Abu Utsman dari [A'idz bin 'Amru] dia berkata; \"Ketika krisis air, Rasulullah Shallalahu 'Alaihi Wasallam biasa berwudlu menggunakan cangkir atau mangkok besar, kemudian beliau menganjurkan kami menggunakannya, beliau bersabda: \"Dan kebahagiaan yang ada di dalam jiwa kami adalah orang yang telah berwudlu dan kami tidak mengiranya kecuali dia telah memberikan wudlu kepada semua kaum, \" A'idz berkata; \"Kemudian Rasulullah Shallalahu 'Alaihi Wasallam sholat bersama kami diwaktu Dluha.\""
            },
            {
                "number": 2731,
                "arab": "حَدَّثَنَا مُهَنَّأُ بْنُ عَبْدِ الْحَمِيدِ أَبُو شِبْلٍ وَحَسَنٌ يَعْنِي ابْنَ مُوسَى قَالَا ثَنَا حَمَّادُ بْنُ سَلَمَةَ الْمَعْنَى عَنْ ثَابِتٍ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ عَائِذِ بْنِ عَمْرٍوأَنَّ سَلْمَانَ وَصُهَيْبًا وبِلَالًا كَانُوا قُعُودًا فِي أُنَاسٍ فَمَرَّ بِهِمْ أَبُو سُفْيَانَ بْنُ حَرْبٍ فَقَالُوا مَا أَخَذَتْ سُيُوفُ اللَّهِ تَبَارَكَ وَتَعَالَى مِنْ عُنُقِ عَدُوِّ اللَّهِ مَأْخَذَهَا بَعْدُ فَقَالَ أَبُو بَكْرٍ أَتَقُولُونَ هَذَا لِشَيْخِ قُرَيْشٍ وَسَيِّدِهَا قَالَ فَأُخْبِرَ بِذَلِكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا أَبَا بَكْرٍ لَعَلَّكَ أَغْضَبْتَهُمْ فَلَئِنْ كُنْتَ أَغْضَبْتَهُمْ لَقَدْ أَغْضَبْتَ رَبَّكَ تَبَارَكَ وَتَعَالَى فَرَجَعَ إِلَيْهِمْ فَقَالَ أَيْ إِخْوَتَنَا لَعَلَّكُمْ غَضِبْتُمْ فَقَالُوا لَا يَا أَبَا بَكْرٍ يَغْفِرُ اللَّهُ لَكَحَدَّثَنَا هُدْبَةُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ مِثْلَهُ بِإِسْنَادِهِ",
                "id": "Telah menceritakan kepada kami [Muhanna` bin Abdul Hamid Abu Syibl] dan [Hasan yaitu Ibnu Musa], keduanya berkata; telah menceritakan kepada kami [Hammad bin Salamah] dengan maksud yang sama, dari [Tsabit] dari [Mu'awiyah bin Qurrah] dari [A'idz bin 'Amru] bahwa Salman, Shuhaib dan Bilal tengah duduk-duduk di antara kerumunan orang banyak, kemudian Abu Sufyan bin Harb lewat di hadapan mereka, lalu mereka berkata; \"Pedang-pedang Allah Tabaraka Wata'ala tidak akan di cabut dari tempatnya dari leher musuh Allah selamnya, maka Abu Bakar berkata; \"Apakah kalian mengatakan seperti ini kepada sesepuh Quraisy dan pemimpinnya?.\" A'idz berkata; \"Lantas hal itu diberitahukan kepada Nabi Shallalahu 'Alaihi Wasallam, beliau bersabda: \"Wahai Abu Bakar, mungkin saja kamu memarahi mereka, jika kamu memarahi mereka berarti kamu telah memarahi Rabbmu Tabaraka wa Ta'ala.\" Kemudian Abu Bakar kembali menemui mereka dan berkata; \"Wahai saudara kami, barangkali kalian kalian marah.\" Mereka menjawab; \"Tidak, wahai Abu Bakar, semoga Allah mengampunimu.\" Telah menceritakan kepada kami [Hudbah] telah menceritakan kepada kami [Hammad bin Salamah] dengan hadits dan sanad seperti di atas.\""
            },
            {
                "number": 2732,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا أَبُو الْأَشْهَبِ حَدَّثَنَا عَامِرٌ الْأَحْولُ شَيْخٌ لَهُ عَنْ عَائِذِ بْنِ عَمْرٍو قَالَأَحْسَبُهُ رَفَعَهُ قَالَ مَنْ عَرَضَ لَهُ شَيْءٌ مِنْ هَذَا الرِّزْقِ فَلْيُوَسِّعْ بِهِ فِي رِزْقِهِ فَإِنْ كَانَ عَنْهُ غَنِيًّا فَلْيُوَجِّهْهُ إِلَى مَنْ هُوَ أَحْوَجُ إِلَيْهِ مِنْهُحَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا ثَابِتٌ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ عَائِذِ بْنِ عَمْرٍو أَنَّ صُهَيْبًا وَسَلْمَانَ وَبِلَالًا كَانُوا قُعُودًا فَذَكَرَ نَحْوَهُ إِلَّا أَنَّهُ قَالَ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ بِذَلِكَ فَقَالَ يَا أَبَا بَكْرٍ حَدَّثَنَا رَوْحٌ حَدَّثَنَا بِسْطَامُ بْنُ مُسْلِمٍ قَالَ سَمِعْتُ خَلِيفَةَ بْنَ عَبْدِ اللَّهِ الْغُبَرِيَّ يَقُولُ سَمِعْتُ عَائِذَ بْنَ عَمْرٍو الْمُزَنِيَّ قَالَ بَيْنَا نَحْنُ مَعَ نَبِيِّنَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ حَدِيثَ الْمَسْأَلَةِ",
                "id": "Telah menceritakan kepada kami [Abdushamad], telah menceritakan kepada kami [Abul Asyhab], telah menceritakan kepada kami guru mereka [Amir Al Ahwal] dari [A'idz bin 'Amru] dia berkata; -Aku mengira 'Aidz merafa'kan hadits ini- Dia berkata; \"Barangsiapa mendapatkan sesuatu dari anugerah ini (rizqi), hendaklah ia berlapang-lapang dengan rizqinya, jika dia tidak membutuhkannya lagi, hendaknya ia berikan kepada orang yang lebih membutuhkannya.\" Telah menceritakan kepada kami 'Affan telah menceritakan kepada kami Hammad telah mengabarkan kepada kami Tsabit dari Mu'awiyah bin Qurrah dari A'idz bin 'Amru bahwa Shuhaib, Salman dan Bilal tengah duduk-duduk, kemudian dia menyebutkan hadits yang semakna, namun Aidz mengatakan; \"Kemudian Abu Bakar datang menemui Nabi Shallalahu 'Alaihi Wasallam, dan memberitahukan hal itu kepada beliau, lalu beliau bersabda: \"Wahai Abu Bakar...\" telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Bistham bin Muslim] dia berkata; saya mendengar [Khalifah bin Abdullah Al Ghubari] berkata; aku mendengar [A'idz bin 'Amru Al Muzani] berkata; \"Ketika kami sedang bersama Nabi kami Shallalahu 'Alaihi Wasallam, lalu dia menyebutkan hadits tentang masalah tersebut.\""
            },
            {
                "number": 2733,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ قَالَ سَمِعْتُ أَبَا شِمْرٍ الضُّبَعِيَّ قَالَ سَمِعْتُ عَائِذَ بْنَ عَمْرٍو قَالَ أَبُو عَبْد الرَّحْمَنِ قَالَ أَبِي قُلْتُ لِيَحْيَى بْنِ سَعِيدٍ الْمُزَنِيِّ قَالَ نَعَمْإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْحَنْتَمِ وَالدُّبَّاءِ وَالنَّقِيرِ وَالْمُزَفَّتِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] ia berkata; Aku mendengar [Abu Syimr Adh Dhuba'i] ia berkata; Aku mendengar [A'idz bin 'Amru] ia berkata. -Abu Abdurrahman berkata; ayahku berkata; aku bertanya kepada Yahya bin Sa'id Al Muzanni, ia menjawab; Ya- Nabi Shalallahu 'Alaihi Wasallam telah melarang Hantam, Ad dubba', An Naqir dan Al Muzaffat.\" "
            },
            {
                "number": 2734,
                "arab": "حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا بِسْطَامُ بْنُ مُسْلِمٍ قَالَ سَمِعْتُ خَلِيفَةَ بْنَ عَبْدِ اللَّهِ الْغُبَرِيَّ يَقُولُ سَمِعْتُ عَائِذَ بْنَ عَمْرٍو الْمُزَنِيَّ قَالَبَيْنَمَا نَحْنُ مَعَ نَبِيِّنَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَعْرَابِيٌّ قَدْ أَلَحَّ عَلَيْهِ فِي الْمَسْأَلَةِ يَقُولُ يَا رَسُولَ اللَّهِ أَطْعِمْنِي يَا رَسُولَ اللَّهِ أَعْطِنِي قَالَ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَخَلَ الْمَنْزِلَ وَأَخَذَ بِعِضَادَتَيْ الْحُجْرَةِ وَأَقْبَلَ عَلَيْنَا بِوَجْهِهِ وَقَالَ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ تَعْلَمُونَ مَا أَعْلَمُ فِي الْمَسْأَلَةِ مَا سَأَلَ رَجُلٌ رَجُلًا وَهُوَ يَجِدُ لَيْلَةً تُبِيتُهُ فَأَمَرَ لَهُ بِطَعَامٍ",
                "id": "Telah menceritakan kepada kami [Rauh bin 'Ubadah], telah menceritakan kepada kami [Bistham bin Muslim], ia berkata; Aku mendengar [Khalifah bin Abdullah Al Ghubari] berkata; Aku mendengar [A'idz bin 'Amru Al Muzani] berkata; \"Ketika kami tengah bersama Nabi kami Shallalahu 'Alaihi Wasallam, tiba-tiba seorang Arab badui meminta kepada beliau setengah memaksa, dia berkata; \"Wahai Rasulullah berilah aku makan, wahai Rasulullah berilah aku.\" A'idz berkata; \"Kemudian Rasulullah Shallalahu 'Alaihi Wasallam berdiri dan masuk ke dalam rumah, dan mengambil sesuatu di sebelah kamar beliau, setelah itu beliau menghadapkan wajahnya ke arah kami sambil bersabda: \"Demi Dzat yang jiwa Muhammad berada di tangannya, seandainya kalian tahu apa yang aku ketahui dalam masalah meminta-minta, niscaya tidak akan ada seorangpun yang meminta kepada orang lain, sementara dirinya masih bisa untuk bermalam, \" lalu beliau memerintahkan untuk memberi makan kepada orang tersebut.\""
            },
            {
                "number": 2735,
                "arab": "حَدَّثَنَا يُونُسُ وَعَبْدُ الصَّمَدِ قَالَا ثَنَا أَبُو الْأَشْهَبِ حَدَّثَنَا عَامِرٌ الْأَحْوَلُ قَالَ عَبْدُ الصَّمَدِ شَيْخٌ لَهُ عَنْ عَائِذِ بْنِ عَمْرٍوعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَبْدُ الصَّمَدِ أَحْسَبُهُ رَفَعَهُ قَالَ مَنْ عَرَضَ لَهُ شَيْءٌ مِنْ هَذَا الرِّزْقِ وَقَالَ يُونُسُ مِنْ غَيْرِ مَسْأَلَةٍ وَلَا إِشْرَافٍ فَلْيُوَسِّعْ بِهِ فِي رِزْقِهِ فَإِنْ كَانَ عَنْهُ غَنِيًّا فَلْيُوَجِّهْهُ إِلَى مَنْ هُوَ أَحْوَجُ إِلَيْهِ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Yunus] dan [Abdushamad], keduanya berkata; telah menceritakan kepada kami [Abul Asyhab], telah menceritakan kepada kami [Amir Al Ahwal], syaikhnya Abdushamad, dari [A'idz bin 'Amru] dari Nabi Shalallahu 'Alaihi Wasallam. - [Abdushamad] mengatakan; aku kira hadits ini marfu'- bahwa Nabi Shalallahu 'Alaihi Wasallam bersabda: \"Barangsiapa mendapatkan sesuatu dari anugerah ini (rizqi) tanpa meminta-minta dan berlebihan, hendaklah ia berlapang-lapang dengan rizqinya, jika dia tidak membutuhkannya lagi, hendaknya ia berikan kepada orang yang lebih membutuhkannya.\""
            },
            {
                "number": 2736,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى حَدَّثَنَا أَبُو الْأَشْهَبِ عَنْ عَامِرٍ الْأَحْوَلِ قَالَ قَالَ عَائِذُ بْنُ عَمْرٍوعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ عَرَضَ لَهُ شَيْءٌ مِنْ هَذَا الرِّزْقِ مِنْ غَيْرِ مَسْأَلَةٍ وَلَا إِشْرَافٍ فَلْيُوَسِّعْ بِهِ فِي رِزْقِهِ فَإِنْ كَانَ عَنْهُ غَنِيًّا فَلْيُوَجِّهْهُ إِلَى مَنْ هُوَ أَحْوَجُ إِلَيْهِ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Hasan bin Musa], telah menceritakan kepada kami [Abul Asyhab] dari [Amir Al Ahwal] ia berkata; [A'idz bin 'Amru] berkata dari Nabi Shalallahu 'Alaihi Wasallam, beliau bersabda: \"Barangsiapa mendapatkan sesuatu dari anugerah ini (rizqi) tanpa meminta-minta dan berlebihan, hendaklah ia berlapang-lapang dengan rizqinya, jika dia tidak membutuhkannya lagi, hendaknya ia berikan kepada orang yang lebih membutuhkannya.\""
            },
            {
                "number": 2737,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا أَبُو الْأَشْهَبِ عَنْ عَامِرٍ الْأَحْوَلِ عَنْ عَائِذِ بْنِ عَمْرٍو قَالَ أَبُو الْأَشْهَبِ أُرَاهُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ آتَاهُ اللَّهُ تَبَارَكَ وَتَعَالَى رِزْقًا مِنْ غَيْرِ مَسْأَلَةٍ فَلْيَقْبَلْهُقَالَ عَبْد اللَّهِ سَأَلْتُ أَبِي مَا الْإِشْرَافُ قَالَ تَقُولُ فِي نَفْسِكَ سَيَبْعَثُ إِلَيَّ فُلَانٌ سَيَصِلُنِي فُلَانٌ",
                "id": "Telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami [Abul Asyhab] dari ['Amir Al Ahwal] dari [A'idz bin 'Amru] dia berkata; bahwa [Abul `Asyhab] berkata; aku kira dia mengatakan; Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Barangsiapa dianugerahi rizqi oleh Allah Tabaraka wa Ta'ala tanpa meminta-minta, maka terimalah.\" Abdullah berkata; Aku bertanya kepada ayahku \"Apa yang dimaksud dengan Isyraf?\" ayahku menjawab; \"Yaitu kamu mengatakan pada dirimu \"si Fulan akan mengirimku, si Fulan akan menghampiriku.\""
            },
            {
                "number": 2738,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا مُشْمَعِلُّ بْنُ إِيَاسٍ قَالَ سَمِعْتُ عَمْرَو بْنَ سُلَيْمٍ الْمُزَنِيَّ يَقُولُ سَمِعْتُ رَافِعَ بْنَ عَمْرٍو الْمُزَنِيَّ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْعَجْوَةُ وَالصَّخْرَةُ مِنْ الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi], telah menceritakan kepada kami [Musyma'il bin Iyas], ia berkata; Aku mendengar ['Amru bin Sulaim] ia berkata; Aku mendengar [Rafi' bin 'Amru Al Muzanni] berkata; Aku mendengar Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Ajwah (kurma terbaik) dan Shahrah (batu yang berada di Baitul Maqdis) berasal dari surga.\""
            },
            {
                "number": 2739,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْأُمَوِيُّ عَنْ عَاصِمٍ قَالَ ثَنَا أَبُو الْعَالِيَةِ قَالَ أَخْبَرَنِي مَنْ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُلِكُلِّ سُورَةٍ حَظُّهَا مِنْ الرُّكُوعِ وَالسُّجُودِقَالَ ثُمَّ لَقِيتُهُ بَعْدُ فَقُلْتُ لَهُ إِنَّ ابْنَ عُمَرَ كَانَ يَقْرَأُ فِي الرَّكْعَةِ بِالسُّوَرِ فَتَعْرِفُ مَنْ حَدَّثَكَ هَذَا الْحَدِيثَ قَالَ إِنِّي لَأَعْرِفُهُ وَأَعْرِفُ مُنْذُ كَمْ حَدَّثَنِيهِ حَدَّثَنِي مُنْذُ خَمْسِينَ سَنَةٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id Al Umawi] dari ['Ashim] ia berkata; telah menceritakan kepada kami [Abul 'Aliyah] ia berkata; telah mengabarkan kepadaku [seseorang yang mendengar Rasulullah] Shallalahu 'Alaihi Wasallam bersabda: \"Setiap surat ada haknya di waktu sujud dan ruku'.\" Perawi berkata; \"Kemudian aku bertemu dengan orang tersebut, lalu aku mengatakan kepadanya bahwa Ibnu Umar telah membaca surat-surat (dari Al qur`an di tiap raka'atnya, \"Siapa yang menceritakan hadits ini padamu?.\" Laki-laki itu berkata; \"Sungguh aku telah mengetahuinya dan aku tahu semenjak hadits itu disampaikan yaitu sejak lima puluh tahun.\""
            },
            {
                "number": 2740,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ حَدَّثَنِي نَافِعٌ قَالَرُبَّمَا أَمَّنَا ابْنُ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا بِالسُّورَتَيْنِ وَالثَّلَاثِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari ['ubaidhullah] telah menceritakan kepadaku [Nafi'] dia berkata; \"Mungkin saja [Ibnu Umar] radliallahu 'anhu mengimmi kami dengan dua surat atau tiga surat.\""
            },
            {
                "number": 2741,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ مُحَمَّدٍ قَالَاسْتُعْمِلَ الْحَكَمُ بْنُ عَمْرٍو الْغِفَارِيُّ عَلَى خُرَاسَانَ قَالَ فَتَمَنَّاهُ عِمْرَانُ بْنُ حُصَيْنٍ حَتَّى قِيلَ لَهُ يَا أَبَا نُجَيْدٍ أَلَا نَدْعُوهُ لَكَ قَالَ لَا فَقَامَ عِمْرَانُ بْنُ حُصَيْنٍ فَلَقِيَهُ بَيْنَ النَّاسِ قَالَ تَذْكُرُ يَوْمَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا طَاعَةَ لِمَخْلُوقٍ فِي مَعْصِيَةِ اللَّهِ قَالَ نَعَمْقَالَ عِمْرَانُ اللَّهُ أَكْبَرُ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Harb], telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Muhammad] dia berkata; [Al Hakam bin 'Amru Al Ghifari] pernah di utus ke daerah Khurasan, Muhammad berkata; \"Maka Imran bin Hushain termenung hingga dikatakan kepadanya; \"Wahai Abu Nujaid (panggilan Imran), perlukah kami memanggilkan untukmu?.\" dia menjawab; \"Tidak, \" lalu [Imran bin Hushain] berdiri dan menemuinya di antara kerumunan orang-orang, dia berkata; \"Ingatkah kamu pada hari Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Tidak ada ketaatan kepada mahluk dalam bermaksiat kepada Allah?\" dia menjawab; \"Ya.\" Imran berkata; \"Allahu akbar.\""
            },
            {
                "number": 2742,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ حَدَّثَنَا حُمَيْدٌ يَعْنِي ابْنَ هِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ قَالَأَرَادَ زِيَادٌ أَنْ يَبْعَثَ عِمْرَانَ بْنَ حُصَيْنٍ عَلَى خُرَاسَانَ فَأَبَى عَلَيْهِمْ فَقَالَ لَهُ أَصْحَابُهُ أَتَرَكْتَ خُرَاسَانَ أَنْ تَكُونَ عَلَيْهَا قَالَ فَقَالَ إِنِّي وَاللَّهِ مَا يَسُرُّنِي أَنْ أُصَلِّيَ بِحَرِّهَا وَتُصَلُّونَ بِبَرْدِهَا إِنِّي أَخَافُ إِذَا كُنْتُ فِي نُحُورِ الْعَدُوِّ أَنْ يَأْتِيَنِي كِتَابٌ مِنْ زِيَادٍ فَإِنْ أَنَا مَضَيْتُ هَلَكْتُ وَإِنْ رَجَعْتُ ضُرِبَتْ عُنُقِي قَالَ فَأَرَادَ الْحَكَمَ بْنَ عَمْرٍو الْغِفَارِيَّ عَلَيْهَا قَالَ فَانْقَادَ لِأَمْرِهِ قَالَ فَقَالَ عِمْرَانُ أَلَا أَحَدٌ يَدْعُو لِي الْحَكَمَ قَالَ فَانْطَلَقَ الرَّسُولُ قَالَ فَأَقْبَلَ الْحَكَمُ إِلَيْهِ قَالَ فَدَخَلَ عَلَيْهِ قَالَ فَقَالَ عِمْرَانُ لِلْحَكَمِ أَسَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا طَاعَةَ لِأَحَدٍ فِي مَعْصِيَةِ اللَّهِ تَبَارَكَ وَتَعَالَى قَالَ نَعَمْفَقَالَ عِمْرَانُ لِلَّهِ الْحَمْدُ أَوْ اللَّهُ أَكْبَرُ",
                "id": "Telah menceritakan kepada kami [Bahz], telah menceritakan kepada kami [Sulaiman bin Mughirah], telah menceritakan kepada kami [Humaid yaitu Ibnu Hilal] dari [Abdulah bin Shamit] ia berkata; Ziyad pernah menunjuk 'Imran bin Hushain untuk mengurusi daerah Khurasan, namun ia menolaknya, lantas para sahabatnya berkata padanya; \"Akankah engkau tinggalkan khurasan dan engkau tiada akan ke sana?.\" 'Imran menjawab; \"Demi Allah, aku tiada hendak melaksanakan sholat di musim panasnya sedang kalian sholat di musim dingin, aku takut bila aku berada pada pertempuran dengan musuh, lalu datanglah surat dari Ziyad, bila aku teruskan maka aku akan hancur dan bila aku pulang maka aku akan mati.\" Perawi berkata; Maka Hakam bin Amru Al Ghifari bermaksud menerima tawaran itu, setelah itu Hakam berangkat melaksanakann titah Ziyad, 'Imran berkata; \"Adakah seseorang yang mau memanggilkan Al Hakam?, lalu datanglah seorang utusan hingga bertemu dengan Al Hakam, lalu Al Hakam menemui Imran. Lalu ['Imran] berkata kepada [Al Hakam]; \"Tidakkah engkau mendengar Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Tiada ketaatan bagi seseorang dalam bermaksiat pada Allah Tabaraka Wata'ala?.\" Hakam menjawab; \"Ya.\" ['Imran] langsung berkata; \"Segala piuji bagi Allah\" atau \"Allahu Akbar.\""
            },
            {
                "number": 2743,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا سُلَيْمَانُ التَّيْمِيُّ عَنْ أَبِي حَاجِبٍ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ بَنِي غِفَارٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَتَوَضَّأَ الرَّجُلُ مِنْ فَضْلِ طَهُورِ الْمَرْأَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Sulaiman At Taimi] dari [Abu Hajib] dari [seseorang sahabat Nabi] Shalallahu 'Alaihi Wasallam dari bani Ghifar bahwa Rasulullah Shallalahu 'Alaihi Wasallam melarang seseorang berwudhu' dari sisa air wudlu' wanita.\""
            },
            {
                "number": 2744,
                "arab": "حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ هَارُونَ أَخْبَرَنَا هِشَامٌ عَنْ مُحَمَّدٍ قَالَجَاءَ رَجُلٌ إِلَى عِمْرَانَ بْنِ حُصَيْنٍ وَنَحْنُ عِنْدَهُ فَقَالَ اسْتُعْمِلَ الْحَكَمُ بْنُ عَمْرٍو الْغِفَارِيُّ عَلَى خُرَاسَانَ فَتَمَنَّاهُ عِمْرَانُ حَتَّى قَالَ لَهُ رَجُلٌ مِنْ الْقَوْمِ أَلَا نَدْعُوهُ لَكَ فَقَالَ لَهُ لَا ثُمَّ قَامَ عِمْرَانُ فَلَقِيَهُ بَيْنَ النَّاسِ فَقَالَ عِمْرَانُ إِنَّكَ قَدْ وُلِّيتَ أَمْرًا مِنْ أَمْرِ الْمُسْلِمِينَ عَظِيمًا ثُمَّ أَمَرَهُ وَنَهَاهُ وَوَعَظَهُ ثُمَّ قَالَ هَلْ تَذْكُرُ يَوْمَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا طَاعَةَ لِمَخْلُوقٍ فِي مَعْصِيَةِ اللَّهِ تَبَارَكَ وَتَعَالَى قَالَ الْحَكَمُ نَعَمْقَالَ عِمْرَانُ اللَّهُ أَكْبَرُ",
                "id": "Telah menceritakan kepada kami [Yazid] yaitu Ibnu Harun, telah mengabarkan kepada kami [Hisyam] dari [Muhammad] ia berkata; \"Seseorang datang menmui ['Imran bin Hushain], ketika itu kami tengah bersamanya, orang itu mengatakan bahwa [Al Hakam bin Amru Al Ghifari] di utus menuju daerah Khurasan, tiba-tiba Imran termenung, hingga seseorang berkata kepadanya; \"Perlukah kami memanggilkannya untukmu?.\" dia menjawab; \"Tidak, \" lalu Imran berdiri dan menemuinya di antara kerumunan orang-orang, [Imran] berkata; \"Ingatkah kamu pada hari Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Tidak ada ketaatan kepada mahluk dalam bermaksiat kepada Allah Tabaraka wa Ta'ala?\" Al Hakam menjawab; \"Ya.\" Imran berkata; \"Allahu Akbar.\""
            },
            {
                "number": 2745,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ الْأَحْوَلِ قَالَ سَمِعْتُ أَبَا حَاجِبٍ يُحَدِّثُ عَنِ الْحَكَمِ بْنِ عَمْرٍو الْغِفَارِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَتَوَضَّأَ الرَّجُلُ مِنْ فَضْلِ وَضُوءِ الْمَرْأَةِ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Dawud]; telah menceritakan kepada kami [Syu'bah] dari ['Ashim Al Ahwal] berkata; \"Aku mendengar [Abu Hajib] menceritakan dari [Al Hakam bin 'Amru Al Ghifari] bahwa Rasulullah Shallalahu 'Alaihi Wasallam melarang seseorang berwudhu' dari bekas air wudlu' wanita.\""
            },
            {
                "number": 2746,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ إِبْرَاهِيمَ قَالَسَأَلْتُ مُحَمَّدًا عَنْ حَدِيثِ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ نُبِّئْتُ أَنَّ عِمْرَانَ بْنَ حُصَيْنٍ قَالَ لِلْحَكَمِ الْغِفَارِيِّ وَكِلَاهُمَا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ تَعْلَمُ يَوْمَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا طَاعَةَ فِي مَعْصِيَةِ اللَّهِ تَبَارَكَ وَتَعَالَى قَالَ نَعَمْقَالَ عِمْرَانُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ",
                "id": "Telah menceritakan kepada kami [Abdushamad], telah menceritakan kepada kami [Yazid yaitu Ibnu Ibrahim] ia berkata; Aku bertanya kepada [Muhammad] tentang hadits 'Imran bin Hushain, ia; [telah diberitakan kepadaku] bahwa ['Imran bin Hushain] berkata kepada [Al Hakam Al Ghifari] -keduanya adalah sahabat Rasulullah Shallalahu 'Alaihi Wasallam- \"Apakah kamu ingat hari ketika Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Tidak ada ketaatan kepada mahluk dalam bermaksiat kepada Allah Tabaraka wa Ta'ala?\" Al Hakam menjawab; \"Ya\" [Imran] berkata; \"Allahu Akbar, Allahu Akbar.\""
            },
            {
                "number": 2747,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا يُونُسُ وَحُمَيْدٌ عَنِ الْحَسَنِأَنَّ زِيَادًا اسْتَعْمَلَ الْحَكَمَ الْغِفَارِيَّ عَلَى جَيْشٍ فَأَتَاهُ عِمْرَانُ بْنُ حُصَيْنٍ فَلَقِيَهُ بَيْنَ النَّاسِ فَقَالَ أَتَدْرِي لِمَ جِئْتُكَ فَقَالَ لَهُ لِمَ قَالَ هَلْ تَذْكُرُ قَوْلَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلرَّجُلِ الَّذِي قَالَ لَهُ أَمِيرُهُ قَعْ فِي النَّارِ فَأَدْرَكَ فَاحْتَبَسَ فَأُخْبِرَ بِذَلِكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَوْ وَقَعَ فِيهَا لَدَخَلَا النَّارَ جَمِيعًا لَا طَاعَةَ فِي مَعْصِيَةِ اللَّهِ تَبَارَكَ وَتَعَالَى قَالَ نَعَمْ قَالَ إِنَّمَا أَرَدْتُ أَنْ أُذَكِّرَكَ هَذَا الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Abdushamad], telah menceritakan kepada kami [Hammad], telah mengabarkan kepada kami [Yunus] dan [Humaid] dari [Al Hasan] bahwa Ziyad menunjuk [Al Hakam Al Ghifari] untuk membawahi sekelmpok pasukan, lalu ['Imran bin Hushain] datang menemuinya diantara kerumunan orang-orang, Imran berkata; \"Tahukah kamu, kenapa aku menemuimu?.\" Hakam menimpali; \"Memangnya ada apa?\" 'Imran berkata; \"Apakah engkau ingat ketika Rasulullah Shallalahu 'Alaihi Wasallam bersabda pada seseorang yang disuruh oleh pemimpinnya; \"Terjunlah kamu ke api!, orang itu berfikir dan menahan diri darinya, setelah kejadian tersebut dilaporkan kepada Rasulullah Shallalahu 'Alaihi Wasallam, beliau bersabda: \"Sekiranya ia sampai masuk ke dalam api, niscaya mereka semua akan masuk ke dalam neraka, tidak ada ketaatan kepada mahluk dalam bermaksiat kepada Allah Tabaraka wa Ta'ala?\" Hakam menjawab; \"Ya.\" Imran berkata; \"Aku hanya ingin mengingatkanmu tantang hadits ini.\""
            },
            {
                "number": 2748,
                "arab": "حَدَّثَنَا هَاشِمٌ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ حَبِيبِ بْنِ عَبْدِ اللَّهِ الْأَزْدِيُّ قَالَ حَدَّثَنِي أَبِي عَنِ الْحَكَمِ بْنِ عَمْرٍو الْغِفَارِيِّ قَالَدَخَلْتُ أَنَا وَأَخِي رَافِعُ بْنُ عَمْرٍو عَلَى أَمِيرِ الْمُؤْمِنِينَ عُمَرَ بْنِ الْخَطَّابِ وَأَنَا مَخْضُوبٌ بِالْحِنَّاءِ وَأَخِي مَخْضُوبٌ بِالصُّفْرَةِ فَقَالَ لِي عُمَرُ بْنُ الْخَطَّابِ هَذَا خِضَابُ الْإِسْلَامِ وَقَالَ لِأَخِي رَافِعٍ هَذَا خِضَابُ الْإِيمَانِ",
                "id": "Telah menceritakan kepada kami [Hasyim], telah menceritakan kepada kami [Abdushamad bin Habib bin Abdullah Al Azdi] ia berkata; telah menceritakan kepada kami [Ayahku], dari [Al Hakam bin 'Amru Al Ghifari] dia berkata; \"Aku dan saudaraku yaitu Rafi' bin Amru masuk menemui Amirul mukminin [Umar bin Al Khattab], ketika itu aku tengah mewarnai (rambutku) dengan inai, sedangkan saudaraku mewarnai (rambutnya) dengan Za'faran, lalu Umar bin Al Khattab berkata kepadaku; \"Ini adalah pewarna Islam, \" dia berkata kepada saudaraku; \"Ini adalah pewarna Iman.\""
            },
            {
                "number": 2749,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ غَيْرِ وَاحِدٍ مِنْهُمْ أَيُّوبُ عَنِ ابْنِ سِيرِينَأَنَّ زِيَادًا اسْتَعْمَلَ الْحَكَمَ بْنَ عَمْرٍو الْغِفَارِيَّ فَقَالَ عِمْرَانُ بْنُ حُصَيْنٍ وَدِدْتُ أَنِّي أَلْقَهُ قَبْلَ أَنْ يَخْرُجَ قَالَ فَلَقِيَهُ فَقَالَ لَهُ عِمْرَانُ أَمَا عَلِمْتَ أَوَمَا سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا طَاعَةَ لِأَحَدٍ فِي مَعْصِيَةِ اللَّهِ تَبَارَكَ وَتَعَالَى قَالَ بَلَى قَالَ فَذَاكَ الَّذِي أَرَدْتُ أَنْ أَقُولَ لَكَ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq], telah mengabarkan kepada kami [Ma'mar] dari beberapa sumber, diantaranya [Ayyub] dari [Ibnu Sirin] bahwa Ziyad pernah mengutus [Al Hakam bin 'Amru Al Ghifari], maka 'Imran bin Hushain berkata; \"Aku ingin bertemu dengannya sebelum ia berangkat.\" Ibnu Sirin berkata; \"Lalu [Imran] menemuinya dan berkata padanya; \"Tidakkah kamu kamu ingat atau mendengar ketika Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Tidak ada ketaatan kepada mahluk dalam bermaksiat kepada Allah Tabaraka wa Ta'ala?\" dia menjawab; \"Tentu.\" Imran berkata; \"Begitulah, aku hanya ingin mengatakan hal itu kepadamu.\""
            },
            {
                "number": 2750,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْأَسْوَدُ بْنُ شَيْبَانَ عَنْ أَبِي نَوْفَلِ بْنِ أَبِي عَقْرَبٍ عَنْ أَبِيهِأَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّوْمِ فَقَالَ صُمْ يَوْمًا مِنْ كُلِّ شَهْرٍ فَاسْتَزَادَهُ فَقَالَ بِأَبِي وَأُمِّي إِنِّي أَجِدُنِي أَقْوَى فَزِدْنِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أَجِدُنِي قَوِيًّا إِنِّي أَجِدُنِي قَوِيًّا فَمَا كَانَ أَنْ يَزِيدَهُ فَاسْتَزَادَهُ فَقَالَ صُمْ يَوْمَيْنِ مِنْ كُلِّ شَهْرٍ قَالَ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ إِنِّي أَجِدُنِي قَوِيًّا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أَجِدُنِي قَوِيًّا إِنِّي أَجِدُنِي قَوِيًّا فَمَا كَانَ أَنْ يَزِيدَهُ فَلَمَّا أَلْحَمَ عَلَيْهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صُمْ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun], telah mengabarkan kepada kami [Al Aswad bin Syaiban] dari [Abu Naufal bin Abu 'Aqrab] dari [Ayahnya] bahwa ia bertanya kepada Nabi Shalallahu 'Alaihi Wasallam tentang puasa, lalu beliau bersabda: \"Berpuasalah sehari setiap bulan.\" Namun ia minta tambah, seraya berkata; 'Bapak dan ibuku sebagai tebusannya, aku masih kuat -melakukan lebih dari itu-.' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sungguh aku masih kuat, sungguh aku masih kuat.' Hampir saja beliau tidak menambahkan untuknya. Namun dia tetap Lalu beliau menambahinya seraya bersabda: 'Berpuasalah dua hari setiap bulan.' ia berkata; 'Bapak dan ibuku sebagai tebusannya, wahai Rasulullah, sungguh aku masih kuat! ' Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sungguh aku masih kuat, sungguh aku masih kuat.' Hampir saja beliau tidak menambahkan untuknya. Setelah ia mendesak terus, Rasulullah shallallahu 'alaihi wasallam bersabda: 'Berpuasalah tiga hari setiap bulan.'"
            },
            {
                "number": 2751,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا الْأَسْوَدُ بْنُ شَيْبَانَ قَالَ سَمِعْتُ أَبَا نَوْفَلِ بْنَ أَبِي عَقْرَبٍ يَقُولُسَأَلَ أَبِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّوْمِ فَقَالَ صُمْ يَوْمًا مِنْ كُلِّ شَهْرٍ فَقَالَ يَا رَسُولَ اللَّهِ بِأَبِي وَأُمِّي زِدْنِي قَالَ يَقُولُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زِدْنِي زِدْنِي صُمْ يَوْمَيْنِ مِنْ كُلِّ شَهْرٍ فَقَالَ يَا رَسُولَ اللَّهِ بِأَبِي وَأُمِّي زِدْنِي فَإِنِّي أَجِدُنِي قَوِيًّا قَالَ يَقُولُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أَجِدُنِي قَوِيًّا إِنِّي أَجِدُنِي قَوِيًّا إِنِّي أَجِدُنِي قَوِيًّا قَالَ فَأَلْحَمَ أَيْ أَمْسَكَ حَتَّى ظَنَنْتُ أَنَّهُ لَنْ يَزِيدَنِي قَالَ ثُمَّ قَالَ صُمْ ثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ",
                "id": "Telah menceritakan kepada kami ['Affan], telah mengabarkan kepada kami [Al Aswad bin Syaiban] ia berkata; aku mendengar [Abu Naufal bin Abu 'Aqrab] berkata; [Ayahku] bertanya kepada Nabi Shalallahu 'Alaihi Wasallam tentang puasa, lalu beliau bersabda: \"Puasalah sehari setiap bulan!.\" Lalu ia meminta tambah seraya berkata; \"Wahai Rasulullah, demi ayah dan ibuku, aku lebih kuat -melakukan lebih dari itu- maka tambahkanlah untukku!.\" Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"tambahkan, tambahkan, berpuasalah dua hari setiap bulan.\" Dia berkata lagi; \"Wahai Rasulullah, demi ayah dan ibuku, tambahkanlah untukku, karena aku lebih kuat -melakukan lebih dari itu-.\" Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sungguh aku masih kuat, sungguh aku masih kuat, sungguh aku masih kuat.' Beliau tetap mendesak maksudnya menahan hingga aku menyangka beliau tidak akan menambahkan lagi untukku, \" ayahku berkata; \"Kemudian beliau bersabda: \"Puasalah tiga hari setiap bulan.\""
            },
            {
                "number": 2752,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا سُلَيْمَانُ يَعْنِي ابْنَ الْمُغِيرَةِ عَنْ حُمَيْدٍ يَعْنِي ابْنَ هِلَالٍ قَالَكَانَ رَجُلٌ مِنْ الطُّفَاوَةِ طَرِيقُهُ عَلَيْنَا فَأَتَى عَلَى الْحَيِّ فَحَدَّثَهُمْ قَالَ قَدِمْتُ الْمَدِينَةَ فِي عِيرٍ لَنَا فَبِعْنَا بِيَاعَتَنَا ثُمَّ قُلْتُ لَأَنْطَلِقَنَّ إِلَى هَذَا الرَّجُلِ فَلَآتِيَنَّ مَنْ بَعْدِي بِخَبَرِهِ قَالَ فَانْتَهَيْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا هُوَ يُرِينِي بَيْتًا قَالَ إِنَّ امْرَأَةً كَانَتْ فِيهِ فَخَرَجَتْ فِي سَرِيَّةٍ مِنْ الْمُسْلِمِينَ وَتَرَكَتْ ثِنْتَيْ عَشْرَةَ عَنْزًا لَهَا وَصِيصِيَتَهَا كَانَتْ تَنْسِجُ بِهَا قَالَ فَفَقَدَتْ عَنْزًا مِنْ غَنَمِهَا وَصِيصِيَتَهَا فَقَالَتْ يَا رَبِّ إِنَّكَ قَدْ ضَمِنْتَ لِمَنْ خَرَجَ فِي سَبِيلِكَ أَنْ تَحْفَظَ عَلَيْهِ وَإِنِّي قَدْ فَقَدْتُ عَنْزًا مِنْ غَنَمِي وَصِيصِيَتِي وَإِنِّي أَنْشُدُكَ عَنْزِي وَصِيصِيَتِي قَالَ فَجَعَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُ شِدَّةَ مُنَاشَدَتِهَا لِرَبِّهَا تَبَارَكَ وَتَعَالَى قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَصْبَحَتْ عَنْزُهَا وَمِثْلُهَا وَصِيصِيَتُهَا وَمِثْلُهَا وَهَاتِيكَ فَأْتِهَا فَاسْأَلْهَا إِنْ شِئْتَ قَالَ قُلْتُ بَلْ أُصَدِّقُكَ",
                "id": "Telah menceritakan kepada kami [Abdushamad bin Abdul Warits], telah menceritakan kepada kami [Sulaiman yaitu Ibnu Mughirah] dari [Humaid yaitu Ibnu Hilal] dia berkata; [Seorang lelaki] dari Thufawithah yang jalannya melewati (tempat) kami, kemudian dia datang ke perkampungan dan bercerita kepada penduduk kampung, dia berkata; \"Aku tiba di Madinah dengan kafilah dagang kami, kemudian kami menjual barang dagangan kami, lalu aku berkata; \"Aku harus pergi menemui laki-laki ini, supaya orang setelahku datang membawa berita tentang dia, \" laki-laki itu berkata; \"Kemudian aku sampai kepada Rasulullah Shallalahu 'Alaihi Wasallam dan beliau memperlihatkan kepadaku suatu rumah.\" Beliau bersabda: \"Sesungguhnya di dalamnya ada seorang wanita, dia keluar ikut dalam pasukan kaum muslimin dan meinggalkan dua belas kambing miliknya dan tali-tali yang dia gunakan untuk memintal, beliau melanjutkan: \"Kemudian salah satu kambingnya dan alat pintalnya juga hilang, lalu dia berkata; \"Wahai Rabbku, sesungguhnya Engkau telah menjamin bagi orang yang keluar berperang di jalan-Mu bahwa Engkau akan menjaganya, dan sesungguhnya aku telah kehilangan seekor kambing dan alat pintalku, dan sesungguhnya aku mengadukan perihal kambing dan alat pintalku kepadaMu.\" Laki-laki itu melanjutkan; \"Maka Rasulullah Shallalahu 'Alaihi Wasallam menyebutkan kesungguhan (keseriusan) wanita itu dalam mengadu kepada Rabbnya Tabaraka Wata'ala.\" Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Maka wanita itu menemukan kambingnya dengan yang semisalnya dan menemukan alat pintalnya dengan yang semisalnya.\" Dan inilah, aku telah beritakan maka datangilah wanita itu dan tanyakan padanya jika kamu menghendaki!.\" Laki-laki itu berkata; \"Maka aku menjawab: \"Bahkan aku sudah percaya kepadamu.\""
            },
            {
                "number": 2753,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا ذَيَّالُ بْنُ عُبَيْدِ بْنِ حَنْظَلَةَ قَالَ سَمِعْتُ حَنْظَلَةَ بَنَ حِذْيَمٍ جَدِّيأَنَّ جَدَّهُ حَنِيفَةَ قَالَ لِحِذْيَمٍ اجْمَعْ لِي بَنِيَّ فَإِنِّي أُرِيدُ أَنْ أُوصِيَ فَجَمَعَهُمْ فَقَالَ إِنَّ أَوَّلَ مَا أُوصِي أَنَّ لِيَتِيمِي هَذَا الَّذِي فِي حِجْرِي مِائَةً مِنْ الْإِبِلِ الَّتِي كُنَّا نُسَمِّيهَا فِي الْجَاهِلِيَّةِ الْمُطَيَّبَةَ فَقَالَ حِذْيَمٌ يَا أَبَتْ إِنِّي سَمِعْتُ بَنِيكَ يَقُولُونَ إِنَّمَا نُقِرُّ بِهَذَا عِنْدَ أَبِينَا فَإِذَا مَاتَ رَجَعْنَا فِيهِ قَالَ فَبَيْنِي وَبَيْنَكُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ حِذْيَمٌ رَضِينَا فَارْتَفَعَ حِذْيَمٌ وَحَنِيفَةُ وحَنْظَلَةُ مَعَهُمْ غُلَامٌ وَهُوَ رَدِيفٌ لِحِذْيَمٍ فَلَمَّا أَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَلَّمُوا عَلَيْهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا رَفَعَكَ يَا أَبَا حِذْيَمٍ قَالَ هَذَا وَضَرَبَ بِيَدِهِ عَلَى فَخِذِ حِذْيَمٍ فَقَالَ إِنِّي خَشِيتُ أَنْ يَفْجَأَنِي الْكِبَرُ أَوْ الْمَوْتُ فَأَرَدْتُ أَنْ أُوصِيَ وَإِنِّي قُلْتُ إِنَّ أَوَّلَ مَا أُوصِي أَنَّ لِيَتِيمِي هَذَا الَّذِي فِي حِجْرِي مِائَةً مِنْ الْإِبِلِ كُنَّا نُسَمِّيهَا فِي الْجَاهِلِيَّةِ الْمُطَيَّبَةَ فَغَضِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى رَأَيْنَا الْغَضَبَ فِي وَجْهِهِ وَكَانَ قَاعِدًا فَجَثَا عَلَى رُكْبَتَيْهِ وَقَالَ لَا لَا لَا الصَّدَقَةُ خَمْسٌ وَإِلَّا فَعَشْرٌ وَإِلَّا فَخَمْسَ عَشْرَةَ وَإِلَّا فَعِشْرُونَ وَإِلَّا فَخَمْسٌ وَعِشْرُونَ وَإِلَّا فَثَلَاثُونَ وَإِلَّا فَخَمْسٌ وَثَلَاثُونَ فَإِنْ كَثُرَتْ فَأَرْبَعُونَ قَالَ فَوَدَعُوهُ وَمَعَ الْيَتِيمِ عَصًا وَهُوَ يَضْرِبُ جَمَلًا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَظُمَتْ هَذِهِ هِرَاوَةُ يَتِيمٍ قَالَ حَنْظَلَةُ فَدَنَا بِي إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ لِي بَنِينَ ذَوِي لِحًى وَدُونَ ذَلِكَ وَإِنَّ ذَا أَصْغَرُهُمْ فَادْعُ اللَّهَ لَهُ فَمَسَحَ رَأْسَهُ وَقَالَ بَارَكَ اللَّهُ فِيكَ أَوْ بُورِكَ فِيهِقَالَ ذَيَّالٌ فَلَقَدْ رَأَيْتُ حَنْظَلَةَ يُؤْتَى بِالْإِنْسَانِ الْوَارِمِ وَجْهُهُ أَوْ الْبَهِيمَةِ الْوَارِمَةِ الضَّرْعُ فَيَتْفُلُ عَلَى يَدَيْهِ وَيَقُولُ بِسْمِ اللَّهِ وَيَضَعُ يَدَهُ عَلَى رَأْسِهِ وَيَقُولُ عَلَى مَوْضِعِ كَفِّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَمْسَحُهُ عَلَيْهِ وَقَالَ ذَيَّالٌ فَيَذْهَبُ الْوَرَمُ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id] bekas budak bani Hasyim, telah menceritakan kepada kami [Dzayyal bin Ubaid bin Handzalah] ia berkata; saya mendengar [Hadzalah bin Hidzyam] kakekku, bahwa kakeknya yaitu Hanifah berkata kepada Hidzyam; \"Kumpulkan kepadaku anak-anakku, karena aku ingin berwasiat!.\" Lalu dia mengumpulkan mereka, kemudian Hanifah berkata; \"Sesungguhnya yang pertama kali aku wasiatkan untuk anak yatim yang menjadi tanggunganku adalah seratus ekor unta, yang pada masa Jahiliyah kami menamakannya dengan \"Al Muthayyabah.\" kemudian Hidzyam berkata; \"Wahai ayahku, sesungguhnya aku mendengar anak-anakmu mengatakan; \"Hanyasannya kami mengakui ini di sisi ayah kami, bila ia meninggal kami akan kembali (mengambil seratus unta).\" Ia berkata; \"Dan antara aku dan kalian ada Rasulullah Shallalahu 'Alaihi Wasallam (sebagai saksi).\" Judzyam berkata; \"Kami ridha.\" Setelah itu Hidzyam, Hanifah dan Handzalah bersama dengan seorang anak yang membonceng kendaraan Hidzyam beranjak pergi, hingga ketika mereka menjumpai Nabi Shalallahu 'Alaihi Wasallam, mereka memberi salam dan Nabi Shalallahu 'Alaihi Wasallam bersabda: \"Ada apa denganmu wahai Abu Hidzyam?.\" Abu Hidzam berkata; \"Ini.\" Sambil menepuk paha Hidzyam dengan tangannya. Ia berkata; \"Aku takut bila aku tua nanti atau kematian menjemputku, aku telah berwasiat dan aku telah mengatakan bahwa wasiat yang pertama aku sampaikan pada anak yatimku dengan memberikan seratus unta yang aku miliki, yang di masa jahiliyah kami menyebutnya dengan \"Al Muthayyibah.\" Maka Rasulullah Shallalahu 'Alaihi Wasallam marah hingga kami melihat kemarahan di wajah beliau, beliau lalu duduk sambil bertumpu pada lututnya seraya bersabda: \"Tidak, tidak, tidak, sedekah itu hanya seperlima, kalau tidak maka sepersepuluh, kalau tidak maka seperlima belas, kalau tidak maka seperduapuluh, kalau tidak maka seperdua puluh lima, kalau tidak maka sepertiga puluh, kalau tidak maka seper tiga puluh lima, dan bila hartanya banyak maka seperempat puluh.\" Lalu aku menitipkan kepada mereka dan aku berikan tongkat untuk memukul unta kepada si yatim. Lalu Nabi Shalallahu 'Alaihi Wasallam bersabda: \"Alangkah besar tongkat anak yatim ini.\" Handzalah berkata; \"Lalu aku mendekati Rasulullah Shallalahu 'Alaihi Wasallam dan mengadu; \"Sungguh aku punya banyak anak yang sudah dewasa dan selainnya dan mereka juga punya anak-anak mereka, maka berdo'alah pada Allah untuknya!.\" Maka beliau mengusap kepalanya dan bersabda: \"Barakallah fiik au burika fiihi (semoga Allah memberi keberkahan padamu atau diberkai padanya.\" [Dzayyal] berkata; \"Aku telah melihat [Handzalah] didatangkan seseorang yang wajahnya bengkak atau bintang yang susunya bengkak, lalu ia meludahi kedua tangannya dan berkata; \"Bismillah (dengan menyebut nama Allah) dan meletakkan tangannya di atas kepala orang atau binatang yang bengkak, dan mengucapkan sambil meletakkan tangannya persis di tempat tangan Rasulullah Shalallahu 'Alaihi Wasallam dahulu meletakkan, lalu beliau mengusapnya. Dzayyal berkata; \"Maka bengkaknya pun sembuh.\""
            },
            {
                "number": 2754,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ وَعَفَّانُ قَالَا ثَنَا رَبِيعَةُ بْنُ كُلْثُومٍ حَدَّثَنِي أَبِي قَالَ سَمِعْتُ أَبَا غَادِيةَ يَقُولُبَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو سَعِيدٍ فَقُلْتُ لَهُ بِيَمِينِكَ قَالَ نَعَمْ قَالَا جَمِيعًا فِي الْحَدِيثِ وَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْعَقَبَةِ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ عَلَيْكُمْ حَرَامٌ إِلَى يَوْمِ تَلْقَوْنَ رَبَّكُمْ عَزَّ وَجَلَّ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا أَلَا هَلْ بَلَّغْتُ قَالُوا نَعَمْ قَالَ اللَّهُمَّ اشْهَدْ ثُمَّ قَالَ أَلَا لَا تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id] dan ['Affan], keduanya berkata; telah menceritakan kepada kami [Rabi'ah bin Kultsum] telah menceritakan kepadaku [Ayahku] ia berkata; saya mendengar [Abu Ghadiyah] berkata; \"Aku berbai'at kepada Rasulullah Shallalahu 'Alaihi Wasallam, \" Abu Sa'id mengatakan; kemudian aku berkata kepadanya; \"Dengan sumpahmu kah?.\" Dia menjawab; \"Ya.\" Keduanya sama berkata dalam hadits mereka; \"Dan Rasulullah Shallalahu 'Alaihi Wasallam berkhutbah di hadapan kami pada hari Bai'at 'Aqabah, lalu beliau bersabda: \"Wahai manusia, sesungguhnya darah kalian dan harta kalian adalah haram atas kalian sampai kalian bertemu dengan Rabb kalian 'azza wajalla, sebagaimana haramnya hari kalian ini, di bulan kalian ini dan di negeri kalian ini, ketahuilah bukankah aku telah menyampaikan?.\" Para sahabat menjawab; \"ya\" beliau bersabda: \"Yaa Allah saksikanlah!.\" beliau melanjutkan: \"Ketahuilah, janganlah kalian kembali kepada kekafiran sepeninggalku, dengan saling membunuh satu sama lain.\""
            },
            {
                "number": 2755,
                "arab": "حَدَّثَنَا يُونُسُ وَحُسَيْنٌ قَالَا ثَنَا شَيْبَانُ عَنْ قَتَادَةَ قَالَ وَجَدْتُ مِرْثَدَ بْنَ ظَبْيَانَ قَالَجَاءَنَا كِتَابٌ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا وَجَدْنَا لَهُ كَاتِبًا يَقْرَؤُهُ عَلَيْنَا حَتَّى قَرَأَهُ رَجُلٌ مِنْ بَنِي ضُبَيْعَةَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى بَكْرِ بْنِ وَائِلٍ أَسْلِمُوا تَسْلَمُوا",
                "id": "Telah menceritakan kepada kami [Yunus] dan [Husain] keduanya berkata; telah menceritakan kepada kami [Syaiban] dari [Qatadah] dia berkata; Aku mendapati [Mirtsad bin Dlabyan] berkata; telah datang kepada kami surat dari Rasulullah Shallalahu 'Alaihi Wasallam, dan kami tidak menemukan seorang penulis yang dapat membacakannya kepada kami, sampai seorang lelaki dari Bani Dlubai'ah membacanya; \"Dari Rasulullah Shallalahu 'Alaihi Wasallam kepada Bakar bin Wa`il, masuk Islamlah kalian niscaya kalian akan aman.\""
            },
            {
                "number": 2756,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا سَعِيدٌ الْجُرَيْرِيُّ عَنْ أَبِي نَضْرَةَ قَالَمَرِضَ رَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَخَلَ عَلَيْهِ أَصْحَابُهُ يَعُودُونَهُ فَبَكَى فَقِيلَ لَهُ مَا يُبْكِيكَ يَا عَبْدَ اللَّهِ أَلَمْ يَقُلْ لَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذْ مِنْ شَارِبِكَ ثُمَّ اقْرِرْهُ حَتَّى تَلْقَانِي قَالَ بَلَى وَلَكِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَبَضَ قَبْضَةً بِيَمِينِهِ فَقَالَ هَذِهِ لِهَذِهِ وَلَا أُبَالِ وَقَبْضَةً أُخْرَى يَعْنِي بِيَدِهِ الْأُخْرَى فَقَالَ هَذِهِ لِهَذِهِ وَلَا أُبَالِ فَلَا أَدْرِي فِي أَيِّ الْقَبْضَتَيْنِ أَنَا",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammad bin Salamah], telah mengabarkan kepada kami [Sa'id Al Jurairi] dari [Abu Nadhrah] ia berkata; [Seorang sahabat Nabi] Shalallahu 'Alaihi Wasallam sakit hingga para sahabat berduyun-duyun menjenguknya, lalu ia menangis, dikatakan padanya; \"Apa yang menyebabkanmu menangis wahai Abdullah, bukankan Rasulullah Shallalahu 'Alaihi Wasallam telah bersabda padamu: \"Ambillah minummu hingga sembuh sampai kamu bertemu denganku!.\" Ia menjawab; \"Ya, tetapi aku pernah mendengar Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Sesungguhnya Allah telah mencabut nyawa dengan tangan kanan-Nya lalu berfirman: \"ini untuk ini dan Aku tidak peduli, \" lalu Dia mencabut yang lain dengan tangan-Nya yang lain dan berfirman: \"ini untuk ini dan Aku tidak peduli, \" dan aku tidak tahu aku akan dicabut dengan tangan yang mana.\""
            },
            {
                "number": 2757,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا عَاصِمُ بْنُ هِلَالٍ حَدَّثَنَا غَاضِرَةُ بْنُ عُرْوَةَ الْفُقَيْمِيُّ حَدَّثَنِي أَبُو عُرْوَةَ قَالَكُنَّا نَنْتَظِرُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَخَرَجَ رَجِلًا يَقْطُرُ رَأْسُهُ مِنْ وُضُوءٍ أَوْ غُسْلٍ فَصَلَّى فَلَمَّا قَضَى الصَّلَاةَ جَعَلَ النَّاسُ يَسْأَلُونَهُ يَا رَسُولَ اللَّهِ أَعَلَيْنَا حَرَجٌ فِي كَذَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا أَيُّهَا النَّاسُ إِنَّ دِينَ اللَّهِ عَزَّ وَجَلَّ فِي يُسْرٍ ثَلَاثًا يَقُولُهَا وَقَالَ يَزِيدُ مَرَّةً جَعَلَ النَّاسُ يَقُولُونَ يَا رَسُولَ اللَّهِ مَا نَقُولُ فِي كَذَا مَا نَقُولُ فِي كَذَا",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami ['Ashim bin Hilal] telah mengabarkan kepada kami [Ghadirah bin Urwah Al Fuqaimi] telah menceritakan kepadaku [Abu 'Urwah] dia berkata; \"Kami tengah menunggu Nabi Shallalahu 'Alaihi Wasallam, tiba-tiba keluarlah seorang lelaki yang kepalanya basah karena berwudlu atau mandi, lalu dia sholat, seusai sholat orang-orang bertanya tentang dia; \"Wahai Rasulullah, apakah ada dosa bagi kami dalam hal ini?\" Rasulullah Shallalahu 'Alaihi Wasallam menjawab: \"Tidak, wahai sekalian manusia, sesungguhnya Agama Allah 'azza wajalla itu mudah.\" beliau mengatakannya hingga tiga kali, pada kesempatan yang lain [Yazid] mengatakan; \"Orang-orang berkata; \"Wahai Rasulullah, apa yang kami katakan dalam masalah ini, apa yang kami katakan dalam masalah ini.\""
            },
            {
                "number": 2758,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُبَيْدٍ الدِّيلِيُّ عَنْ عُدَيْسَةَ ابْنَةِ أُهْبَانَ بْنِ صَيْفِيٍّأَنَّهَا كَانَتْ مَعَ أَبِيهَا فِي مَنْزِلِهِ فَمَرِضَ فَأَفَاقَ مِنْ مَرَضِهِ ذَلِكَ فَقَامَ عَلِيُّ بْنُ أَبِي طَالِبٍ بِالْبَصْرَةِ فَأَتَاهُ فِي مَنْزِلِهِ حَتَّى قَامَ عَلَى بَابِ حُجْرَتِهِ فَسَلَّمَ وَرَدَّ عَلَيْهِ الشَّيْخُ السَّلَامَ فَقَالَ لَهُ عَلِيٌّ كَيْفَ أَنْتَ يَا أَبَا مُسْلِمٍ قَالَ بِخَيْرٍ فَقَالَ عَلِيٌّ أَلَا تَخْرُجُ مَعِي إِلَى هَؤُلَاءِ الْقَوْمِ فَتُعِينَنِي قَالَ بَلَى إِنْ رَضِيتَ بِمَا أُعْطِيكَ قَالَ عَلِيٌّ وَمَا هُوَ فَقَالَ الشَّيْخُ يَا جَارِيَةُ هَاتِ سَيْفِي فَأَخْرَجَتْ إِلَيْهِ غِمْدًا فَوَضَعَتْهُ فِي حِجْرِهِ فَاسْتَلَّ مِنْهُ طَائِفَةً ثُمَّ رَفَعَ رَأْسَهُ إِلَى عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ فَقَالَ إِنَّ خَلِيلِي عَلَيْهِ السَّلَام وَابْنَ عَمِّكَ عَهِدَ إِلَيَّ إِذَا كَانَتْ فِتْنَةٌ بَيْنَ الْمُسْلِمِينَ أَنْ اتَّخِذْ سَيْفًا مِنْ خَشَبٍ فَهَذَا سَيْفِي فَإِنْ شِئْتَ خَرَجْتُ بِهِ مَعَكَ فَقَالَ عَلِيٌّ رَضِيَ اللَّهُ عَنْهُ لَا حَاجَةَ لَنَا فِيكَ وَلَا فِي سَيْفِكَ فَرَجَعَ مِنْ بَابِ الْحُجْرَةِ وَلَمْ يَدْخُلْ",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Abdullah bin Ubaid Ad Daili] dari ['Udaisah binti Uhban bin Shaifi] bahwa dia pernah bersama [Ayahnya] di rumah, kemudian ayahnya sakit, setelah sembuh dari sakitnya, Ali bin Abu Thalib yang berada di Bashrah menjenguknya di rumah, ketika ia berdiri di depan pintu kamarnya, ia mengucapkan salam, maka orang tua itu menjawab salamnya, kemudian Ali bertanya kepadanya; \"Bagaimana kondsisimu wahai Abu Muslim?\" dia menjawab; \"Baik.\" Kemudian Ali berkata; \"Tidakkah kamu keluar bersamaku menemui orang-orang itu untuk menolongku?\" dia menjawab; \"Tentu, jika kamu ridla dengan apa yang aku berikan kepadamu.\" Ali berkata; \"Apakah itu?\" orang tua itu berkata; \"Wahai anakku, berikan pedangku.\" Lalu anak gadisnya mengeluarkan pedang yang masih dalam sarungnya kepadanya, lalu dia meletakkan di pangkuannya, maka sekelompok orang membuka pedang dengan hati-hati, lalu dia mengangkat kepalanya ke Ali radliallahu 'anhu dan berkata; \"Sesungguhnya kekasihku dan anak pamanmu telah menasehatiku, apabila terjadi fitnah di antara kaum muslimin supaya mengambil pedang dari kayu, maka ini adalah pedangku, jika kamu berkehendak aku keluar bersamamu dengan membawanya.\" Maka Ali radliallahu 'anhu menjawab; \"Kami tidak butuh kepada kamu dan kepada pedangmu.\" kemudian dia keluar kamar dan tidak masuk lagi.\""
            },
            {
                "number": 2759,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي عَمْرٍو الْقَسْمَلِيِّ عَنْ ابْنَةِ أُهْبَانَأَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ أَتَى أُهْبَانَ فَقَالَ مَا يَمْنَعُكَ مِنْ اتِّبَاعِي فَقَالَ أَوْصَانِي خَلِيلِي وَابْنُ عَمِّكِ يَعْنِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ سَتَكُونُ فِتَنٌ وَفُرْقَةٌ فَإِذَا كَانَ ذَلِكَ فَاكْسِرْ سَيْفَكَ وَاتَّخِذْ سَيْفًا مِنْ خَشَبٍ فَقَدْ وَقَعَتْ الْفِتْنَةُ وَالْفُرْقَةُ وَكَسَرْتُ سَيْفِي وَاتَّخَذْتُ سَيْفًا مِنْ خَشَبٍ وَأَمَرَ أَهْلَهُ حِينَ ثَقُلَ أَنْ يُكَفِّنُوهُ وَلَا يُلْبِسُوهُ قَمِيصًا قَالَ فَأَلْبَسْنَاهُ قَمِيصًا فَأَصْبَحْنَا وَالْقَمِيصُ عَلَى الْمِشْجَبِ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammad bin Salamah] dari [Abu 'Amru Al Qasmali] dari [putrinya Uhban] bahwa Ali bin Abu Thalib datang menemui [Uhban] dan berkata; \"Apa yang menghalangimu tidak ikut denganku?.\" Uhban menjawab; \"Kekasihku dan anak pamanmu telah mewasiatkan kepadaku yaitu Rasulullah Shallalahu 'Alaihi Wasallam, beliau bersabda: \"Akan terjadi fitnah dan perpecahan, apabila hal itu telah terjadi, maka patahkanlah pedangmu dan buatlah pedang dari kayu.\" Sungguh saat ini telah terjadi fitnah dan perpecahan, dan aku telah mematahkan pedangku serta membuat pedang dari kayu, \" lalu Uhban menyuruh keluarganya untuk mengkafaninya dan tidak memakaikan gamis, setelah itu kami memakaikannya gamis, dan kami gantungkan gamis itu ke hangernya.\""
            },
            {
                "number": 2760,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ قَالَ سَمِعْتُ الْحَسَنَ حَدَّثَنَا عَمْرُو بْنُ تَغْلِبَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَاهُ شَيْءٌ فَأَعْطَاهُ نَاسًا وَتَرَكَ نَاسًا وَقَالَ جَرِيرٌ أَعْطَى رِجَالًا وَتَرَكَ رِجَالًا قَالَ فَبَلَغَهُ عَنْ الَّذِينَ تَرَكَ أَنَّهُمْ عَتِبُوا وَقَالُوا قَالَ فَصَعِدَ الْمِنْبَرَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ إِنِّي أُعْطِي نَاسًا وَأَدَعُ نَاسًا وَأُعْطِي رِجَالًا وَأَدَعُ رِجَالًا قَالَ عَفَّانُ قَالَ ذِي وَذِي وَالَّذِي أَدَعُ أَحَبُّ إِلَيَّ مِنْ الَّذِي أُعْطِي أُعْطِي أُنَاسًا لِمَا فِي قُلُوبِهِمْ مِنْ الْجَزَعِ وَالْهَلَعِ وَأَكِلُ قَوْمًا إِلَى مَا جَعَلَ اللَّهُ فِي قُلُوبِهِمْ مِنْ الْغِنَى وَالْخَيْرِ مِنْهُمْ عَمْرُو بْنُ تَغْلِبَ قَالَ وَكُنْتُ جَالِسًا تِلْقَاءَ وَجْهِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا أُحِبُّ أَنَّ لِي بِكَلِمَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُمْرَ النَّعَمِ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Jarir bin Hazim] dia berkata; aku mendengar [Al Hasan], telah menceritakan kepada kami [Amr bin Taghlib] bahwa Rasulullah Shallalahu 'Alaihi Wasallam mendapat kiriman sesuatu, lalu beliau memberikannya kepada orang tertentu dan tidak beliau berikan kepada yang lain. Jarir mengatakan; \"Beliau memberikan kepada beberapa orang dan tidak memberikan kepada yang lain. Lantas sampailah berita kepada beliau tentang orang-orang yang tidak beliau beri bagian, mereka telah mencela dan ngomel. Maka beliau naik mimbar, setelah memuji Allah dan mengagungkanNya, beliau bersabda: \"Sesungguhnya aku memberikan kepada orang-orang tertentu dan tidak memberikan yang lain, aku memberikan kepada beberapa orang dan tidak memberikan kepada yang lain.\" 'Affan mengatakan; beliau bersabda: \"Memberi ini dan ini, dan orang yang tidak saya beri lebih aku cintai dari orang yang aku beri, aku memberikan kepada orang-orang itu karena di hati mereka ada keluh dan kesah, dan aku pasrahkan kepada ketetapan Allah dalam hati orang-orang yang merasa cukup dan baik di antara mereka.\" Amr bin Taghlib berkata; \"Ketika itu aku duduk di hadapan Rasulullah Shallalahu 'Alaihi Wasallam, lalu dia berkata; \"Kalimat yang Rasulullah ucapkan untuk saya lebih aku cintai dari pada unta merah.\""
            },
            {
                "number": 2761,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ الْحَسَنَ قَالَ ثَنَا عَمْرُو بْنُ تَغْلِبَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي أُعْطِي أَقْوَامًا وَأَرُدُّ آخَرِينَ وَالَّذِينَ أَدَعُ أَحَبُّ إِلَيَّ مِنْ الَّذِينَ أُعْطِي أُعْطِي أَقْوَامًا لِمَا أَخَافُ مِنْ هَلَعِهِمْ قَالَ وَأَكِلُ أَقْوَامًا إِلَى مَا جَعَلَ اللَّهُ عَزَّ وَجَلَّ فِي قُلُوبِهِمْ مِنْ الْغِنَى وَالْخَيْرِ مِنْهُمْ عَمْرُو بْنُ تَغْلِبَ قَالَ قَالَ عَمْرٌو فَوَاللَّهِ مَا أُحِبُّ أَنَّ لِي بِكَلِمَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حُمْرَ النَّعَمِ",
                "id": "Telah menceritakan kepada kami [Wahab bin Jarir]; telah menceritakan kepada kami [ayahku], ia berkata; \"Aku mendengar [Al Hasan] berkata; telah menceritakan kepada kami [Amr bin Taghlib], ia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Sesungguhnya aku memberi orang-orang tertentu dan tidak memberi yang lain, orang yang tidak saya beri adalah lebih aku cintai dari orang yang aku beri, aku memberikan kepada orang-orang itu karena di hati mereka ada keluh dan kesah, dan aku pasrahkan kepada ketetapan Allah dalam hati orang-orang yang merasa kaya dan baik di antara mereka.\" Amr bin Taghlib berkata; \"Dan aku duduk di hadapan Rasulullah Shallalahu 'Alaihi Wasallam, lalu dia berkata; \"Kalimat yang Rasulullah ucapkan untuk saya lebih aku cintai dari pada unta merah.\""
            },
            {
                "number": 2762,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ الْحَسَنَ يَقُولُ ثَنَا عَمْرُو بْنُ تَغْلِبَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُقَاتِلُونَ بَيْنَ يَدَيْ السَّاعَةِ قَوْمًا يَنْتَعِلُونَ الشَّعَرَ وَلَتُقَاتِلُنَّ قَوْمًا كَأَنَّ وُجُوهَهُمْ الْمَجَانُّ الْمُطْرَقَةُ",
                "id": "Telah menceritakan kepada kami [Wahab bin Jarir] telah menceritakan kepada kami [Ayahku] dia berkata; saya mendengar [Al Hasan] berkata; telah menceritakan kepada kami [Amr bin Taghlib] dia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Menjelang hari kiamat, kalian akan memerangi suatu kaum yang memakai sandal dari rambut (bulu), dan kalian akan memerangi suatu kaum seakan-akan wajah mereka seperti tameng.\""
            },
            {
                "number": 2763,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ حَدَّثَنَا الْحَسَنُ حَدَّثَنَا عَمْرُو بْنُ تَغْلِبَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ تُقَاتِلُوا قَوْمًا عِرَاضَ الْوُجُوهِ كَأَنَّ وُجُوهَهُمْ الْمَجَانُّ الْمُطْرَقَةُ",
                "id": "Telah menceritakan kepada kami [Aswad bin 'Amir], telah menceritakan kepada kami [Jarir bin Hazim], telah menceritakan kepada kami [Al Hasan], ia berkata; telah menceritakan kepada kami [Amr bin Taghlib] dia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Di antara tanda-tanda hari Kiamat adalah kalian memerangi suatu kaum yang lebar wajahnya seakan-akan wajah mereka seperti tameng.\""
            },
            {
                "number": 2764,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا جَرِيرٌ عَنِ الْحَسَنِ عَنْ عَمْرِو بْنِ تَغْلِبَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ تُقَاتِلُوا أَقْوَامًا يَنْتَعِلُونَ الشَّعْرَ",
                "id": "Telah menceritakan kepada kami [Aswad bin Amir], telah menceritakan kepada kami [Jarir], telah menceritakan kepada kami [Al Hasan], ia berkata; telah menceritakan kepada kami [Amr bin Taghlib] dia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Di antara tanda-tanda hari Kiamat adalah kalian memerangi suatu kaum yang mengenakan sandal dari rambut (bulu).\""
            },
            {
                "number": 2765,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ قَالَ سَمِعْتُ الْحَسَنَ حَدَّثَنَا عَمْرُو بْنُ تَغْلِبَ قَالَسَمَعَتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ تُقَاتِلُوا قَوْمًا نِعَالُهُمْ الشَّعْرُ أَوْ يَنْتَعِلُونَ الشَّعَرَ وَإِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ تُقَاتِلُوا قَوْمًا عِرَاضَ الْوُجُوهِ كَأَنَّ وُجُوهَهُمْ الْمَجَانُّ الْمُطْرَقَةُ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Jarir bin Hazim], telah menceritakan kepada kami [Al Hasan], ia berkata; telah menceritakan kepada kami [Amr bin Taghlib] dia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Sesungguhnya diantara tanda-tanda dekatnya hari Kiamat adalah kalian memerangi suatu kaum yang sandal mereka terbuat dari rambut (bulu) atau mengenakan sandal dari rambut (bulu), dan diantara tanda-tanda dekatnya hari Kiamat adalah kalian memerangi suatu kaum yang berwajah lebar, seakan-akan wajah mereka seperti tameng.\""
            },
            {
                "number": 2766,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ هَوْذَةَ الْقُرَيْعِيُّ أَنَّهُ قَالَ حَدَّثَنِي رَجُلٌ سَمِعَ جَرْمُوزًا الْهُجَيْمِيَّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَوْصِنِي قَالَ أُوصِيكَ أَنْ لَا تَكُونَ لَعَّانًا",
                "id": "Telah menceritakan kepada kami [Abdusshamad] telah menceritakan kepada kami ['ubaidhullah bin Haudah Al Qurai'i] dia berkata; telah menceritakan kepadaku [seorang lelaki] yang mendengar [Jarmuzan Al Hujaimi] bahwa dia berkata; \"Aku berkata; \"Wahai Rasulullah, berilah aku nasehat!.\" beliau menjawab: \"Aku nasehatkan kepadamu supaya jangan menjadi orang yang suka melaknat.\""
            },
            {
                "number": 2767,
                "arab": "حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا عَلِيٌّ يَعْنِي ابْنَ مُبَارَكٍ عَنْ يَحْيَى حَدَّثَنِي حَيَّةُ التَّمِيمِيُّ أَنَّ أَبَاهُ أَخْبَرَهُأَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا شَيْءَ فِي الْهَامِ وَالْعَيْنُ حَقٌّ وَأَصْدَقُ الطِّيَرِ الْفَأْلُ",
                "id": "Telah menceritakan kepada kami [Abu Amir], telah menceritakan kepada kami [Ali yaitu Ibnu Mubarak] dari [Yahya], telah menceritakan padaku [Hayyat bin Habis At Tamimi] bahwa [ayahnya] telah mengabarkan kepadanya bahwa dia mendengar Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Tidak ada ham, sedangkan 'Ain adalah benar, dan firasat yang paling baik adalah sikap optomis.\" "
            },
            {
                "number": 2768,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا حَرْبٌ حَدَّثَنَا يَحْيَى حَدَّثَنِي حَيَّةُ بْنُ حَابِسٍ التَّمِيمِيُّ أَنَّ أَبَاهُ أَخْبَرَهُأَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا شَيْءَ فِي الْهَامِ وَالْعَيْنُ حَقٌّ وَأَصْدَقُ الطِّيَرَةِ الْفَأْلُ",
                "id": "Telah menceritakan kepada kami [Abdushamad], telah menceritakan kepada kami [Harb], telah menceritakan kepada kami [Yahya] telah menceritakan kepadaku [Hayyah bin Habis At Tamimi] bahwa [Ayahnya] telah mengabarkan kepadanya, bahwa Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Tidak ada ham, sedangkan 'Ain adalah benar, dan firasat yang paling baik adalah sikap optomis.\" "
            },
            {
                "number": 2769,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ وَحَدَّثَنَا حَسَنُ بْنُ مُوسَى وَحُسَيْنُ بْنُ مُحَمَّدٍ قَالَا ثَنَا شَيْبَانُ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ حَيَّةَ حَدَّثَهُ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا شَيْءَ فِي الْهَامِ وَالْعَيْنُ حَقٌّ وَأَصْدَقُ الطِّيَرِ الْفَأْلُ",
                "id": "Telah menceritakan kepada kami [Abdushamad], dan telah menceritakan kepada kami [Hasan bin Musa] dan [Husain bin Muhammad], keduanya berkata; telah menceritakan kepada kami [Syaiban] dari [Yahya bin Abu Katsir] dari [Hayyah] bahwa dia telah menceritakan dari [Ayahnya] dari [Abu Hurairah] bahwa Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Tidak ada ham, sedangkan 'Ain adalah benar, dan firasat yang paling baik adalah sikap optomis.\" "
            },
            {
                "number": 2770,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا عَطَاءُ بْنُ السَّائِبِ عَنْ بِلَالِ بْنِ يَقْطُرَأَنَّ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اسْتُعْمِلَ عَلَى سِجِسْتَانَ فَلَقِيَهُ رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ تَذْكُرُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَيْثُ اسْتَعْمَلَ رَجُلًا عَلَى جَيْشٍ وَعِنْدَهُ نَارٌ قَدْ أُجِّجَتْ فَقَالَ لِرَجُلٍ مِنْ أَصْحَابِهِ قُمْ فَانْزُهَا فَقَامَ فَنَزَاهَا فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَوْ وَقَعَ فِيهَا لَدَخَلَا النَّارَ إِنَّهُ لَا طَاعَةَ فِي مَعْصِيَةِ اللَّهِ تَبَارَكَ وَتَعَالَى وَإِنَّمَا أَرَدْتُ أَنْ أُذَكِّرَكَ هَذَا وَقَالَ حَمَّادٌ أَيْضًا قُمْ فَانْزِهَا فَأَبَى فَعَزَمَ عَلَيْهِ وَقَدْ قَالَ حَمَّادٌ أَيْضًا لَا طَاعَةَ فِي مَعْصِيَةِ اللَّهِ تَعَالَى قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammad bin Salamah], telah mengabarkan kepada kami ['Atha` bin Sa`ib] dari [Bilal bin Yaqthur] bahwa seorang lelaki dari Sahabat Nabi Shallalahu 'Alaihi Wasallam diangkat menjadi pejabat di Sijistan, kemudian dia bertemu dengan [salah seorang] sahabat Nabi Shallalahu 'Alaihi Wasallam, laki-laki itu berkata; \"Ingatkah kamu ketika Rasulullah Shallalahu 'Alaihi Wasallam mengangkat seorang lelaki untuk memimpin suatu pasukan, sementara di sisinya ada api yang telah dinyalakan?, kemudian komandan itu berkata kepada salah seorang sahabatnya; \"Bangun dan lompatlah!.\" laki-laki tadi bangun dan melompat, \" Setelah perkara ini disampaikan kepada Rasulullah Shallalahu 'Alaihi Wasallam, beliau bersabda: \"Seandainya dia benar-benar menceburkan dirinya ke dalam api, niscaya keduanya akan masuk neraka, sesungguhnya tidak ada ketaatan dalam bermaksiat kepada Allah Tabaraka wa Ta'ala, \" hanyasannya aku ingin mengingatkanmu tentang hal ini.\" Dan [Hammad] mengatakan (dalam riwayatnya); \"Bangunlah dan lompatlah!.\" Laki-laki itu menolak, namun dia tetap dipaksa.\" Dan dalam riwayat yang lain [Hammad] mengatakan; \"Tidak ada ketaatan dalam bermaksiat kepada Allah Ta'ala, \" dia menjawab \"Ya.\""
            },
            {
                "number": 2771,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ أَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ قَالَ حَدَّثَنِي الْحَسَنُ بِحَدِيثِ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ عُمَرَ فِي الدِّيبَاجِ قَالَ فَقَالَ الْحَسَنُ أَخْبَرَنِي رَجُلٌ مِنَ الْحَيِّأَنَّهُ دَخَلَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيْهِ جُبَّةٌ لَبِنَتُهَا دِيبَاجٌ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَبِنَةٌ مِنْ نَارٍ",
                "id": "Telah menceritakan kepada kami [Ali bin 'Ashim] telah mengabarkan kepada kami [Sulaiman At Taimi] -dia berkata; telah menceritakan kepadaku Al Hasan, dengan dengan haditsnya Abu Utsman An Nahdi dari Umar tentang masalah sutera- dia berkata; [Al Hasan] berkata; telah menceritakan kepadaku [seseorang lelaki dari penduduk kampong] bahwa dia masuk menemui Rasulullah Shallalahu 'Alaihi Wasallam, sementara laki-laki itu mengenakan jubah yang kantongnya terbuat dari sutera, Al Hasan berkata; maka Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Kantong dari api neraka.\""
            },
            {
                "number": 2772,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي عُثْمَانَ عَنْ مُجَاشِعِ بْنِ مَسْعُودٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا مُجَالِدُ بْنُ مَسْعُودٍ يُبَايِعُكَ عَلَى الْهِجْرَةِ فَقَالَ لَا هِجْرَةَ بَعْدَ فَتْحِ مَكَّةَ وَلَكِنْ أُبَايِعُهُ عَلَى الْإِسْلَامِ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Yazid bin Zura'i], telah menceritakan kepada kami [Khalid Al Khadza`] dari [Abu Utsman] dari [Mujasyi' bin Mas'ud] dia berkata; aku berkata; \"Wahai Rasulullah, inilah Mujalid bin Mas'ud berbai'at kepadamu untuk berhijrah, \" beliau menjawab: \"Tidak ada hijrah setelah penaklukan kota Makkah, akan tetapi aku membai'atnya atas Islam.\""
            },
            {
                "number": 2773,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا شُعْبَةُ حَدَّثَنِي أَيُّوبُ قَالَ سَمِعْتُ عَمْرَو بْنَ سَلِمَةَ قَالَلَمَّا كَانَ يَوْمُ الْفَتْحِ جَعَلَ النَّاسُ يَمُرُّونَ عَلَيْنَا قَدْ جَاءُوا مِنْ عِنْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكُنْتُ أَقْرَأُ وَأَنَا غُلَامٌ فَجَاءَ أَبِي بِإِسْلَامِ قَوْمِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَؤُمُّكُمْ أَكْثَرُكُمْ قُرْآنًا فَنَظَرُوا فَكُنْتُ أَكْثَرَهُمْ قُرْآنًا قَالَ فَقَالَتْ امْرَأَةٌ غَطُّوا اسْتَ قَارِئِكُمْ قَالَ فَاشْتَرَوْا لَهُ بُرْدَةً قَالَ فَمَا فَرِحْتُ أَشَدَّ مِنْ فَرَحِي بِذَلِكَ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Syu'bah], telah menceritakan kepadaku [Ayyub] ia berkata; aku mendengar ['Amru bin Salamah] berkata; \"Ketika terjadi penaklukan kota Makkah, orang-orang banyak yang lewat berlalu-lalang di depan (perkampungan) kami, mereka datang dari sisi Rasulullah Shallalahu 'Alaihi Wasallam, sementara aku termasuk orang yang banyak hafalan Qur`an, ketika itu aku masih kecil. Lalu ayahku datang kepada Rasulullah Shallalahu 'Alaihi Wasallam untuk keIslaman kaumku, maka Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Hendaklah orang yang paling banyak hafalannya diantara kalian menjadi imam.\" Mereka lalu saling melihat, sementara aku termasuk dari orang yang banyak hafalannya. 'Amru berkata; Lalu seorang wanita berkata; \"Tutuplah pantat imam kalian.\" Amru berkata; \"Lantas mereka membelikan kain burdah, 'Amru mengatakan; \"Tidaklah aku sangat bahagia dibanding waktu itu.\""
            },
            {
                "number": 2774,
                "arab": "حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ وَاصِلٍ الْحَدَّادُّ حَدَّثَنَا مِسْعَرٌ أَبُو الْحَارِثِ الْجَرْمِيُّ قَالَ سَمِعْتُ عَمْرَو بْنَ سَلِمَةَ الْجَرْمِيَّيُحَدِّثُ أَنَّ أَبَاهُ وَنَفَرًا مِنْ قَوْمِهِ وَفَدُوا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ ظَهَرَ أَمْرُهُ وَتَعَلَّمَ النَّاسُ فَقَضَوْا حَوَائِجَهُمْ ثُمَّ سَأَلُوهُ مَنْ يُصَلِّي لَنَا أَوْ يُصَلِّي بِنَا فَقَالَ يُصَلِّي لَكُمْ أَوْ بِكُمْ أَكْثَرُكُمْ جَمْعًا لِلْقُرْآنِ أَوْ أَخْذًا لِلْقُرْآنِفَقَدِمُوا عَلَى قَوْمِهِمْ فَسَأَلُوا فِي الْحَيِّ فَلَمْ يَجِدُوا أَحَدًا جَمَعَ أَكْثَرَ مِمَّا جَمَعْتُ فَقَدَّمُونِي بَيْنَ أَيْدِيهِمْ فَصَلَّيْتُ بِهِمْ وَأَنَا غُلَامٌ عَلَيَّ شَمْلَةٌ لِي قَالَ فَمَا شَهِدْتُ مَجْمَعًا مِنْ جَرْمٍ إِلَّا كُنْتُ إِمَامَهُمْ إِلَى يَوْمِي هَذَا",
                "id": "Telah menceritakan kepada kami [Abdul Wahid bin Washil Al Haddad], telah menceritakan kepada kami [Mis'ar Abul Harits Al Jarmi] ia berkata; aku mendengar ['Amru bin Salamah Al Jarmi] bercerita bahwa ayahnya bersama beberapa orang dari kaumnya mengutus utusan kepada Rasulullah Shallalahu 'Alaihi Wasallam, ketika banyak sekali masalah dan manusia banyak belajar serta menyelesaikan hajat mereka, mereka bertanya; \"Siapakah kiranya yang pantas menjadi imam kami atau mengimami kami?, \" beliau bersabda: \"Yang menjadi imam (sholat) kalian atau yang mengimami kalian adalah yang paling banyak mengumpulkan al Qur'an atau hafalan Al Qur`annya.\" Kemudian mereka kembali ke kaumnya dan mencari seseorang yang sekiranya cocok, namuan mereka tidak menemukan seorang pun yang lebih banyak mengumpulkan (menghafal) al qur'an selain aku, akhirnya mereka menyuruhku kedepan untuk menjadi imam sholat mereka, padahal aku masih kecil dan tengah mengenakan kain, tidaklah aku melihat setiap manusia kecuali akulah yang mengimami mereka hingga hari ini.\""
            },
            {
                "number": 2775,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي قِلَابَةَ عَنْ عَمْرِو بْنِ سَلِمَةَ قَالَكَانُوا يَأْتُونَا الرُّكْبَانُ مِنْ قِبَلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَسْتَقْرِئُهُمْ فَيُحَدِّثُونَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِيَؤُمَّكُمْ أَكْثَرُكُمْ قُرْآنًا",
                "id": "Telah menceritakan kepada kami [Ali bin 'Ashim], telah menceritakan kepada kami [Khalid Al Hadza`] dari [Abu Qilabah] dari [Amru bin Salimah] ia berkata; \"Mereka mendatangi [para pengendara] dari arah Rasulullah Shallalahu 'Alaihi Wasallam, lantas kami mengumpulkan mereka, lantas mereka menceritakannya kepada kami bahwa Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Hendaklah orang yang banyak hafalan Qur`annya menjadi imam diantara kalian.\""
            },
            {
                "number": 2776,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا الْمُبَارَكُ بْنُ فَضَالَةَ حَدَّثَنَا الْحَسَنُ أَخْبَرَنِي شَيْخٌ مَنْ بَنِي سَلِيطٍ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُكَلِّمُهُ فِي سَبْيٍ أُصِيبَ لَنَا فِي الْجَاهِلِيَّةِ فَإِذَا هُوَ يُحَدِّثُ الْقَوْمَ وَحَلْقَةٌ قَدْ أَطَافَتْ بِهِ فَإِذَا هُوَ قَاعِدٌ عَلَيْهِ إِزَارُ قِطْرٍ لَهُ غَلِيظٌ أَوَّلُ شَيْءٍ سَمِعْتُهُ مِنْهُ يَقُولُ وَهُوَ يَقُولُ بِيَدِهِ هَكَذَا وَأَشَارَ الْمُبَارَكُ بِإِصْبَعِهِ السَّبَّابَةِ الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَظْلِمُهُ وَلَا يَخْذُلُهُ التَّقْوَى هَاهُنَا التَّقْوَى هَاهُنَا أَيْ فِي الْقَلْبِ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Al Mubarak bin Fadhalah], telah menceritakan kepada kami [Al Hasan], telah mengabarkan kepadaku [seorang syaikh] dari bani Salith, ia berkata; \"Aku pernah datang menemui Nabi Shalallahu 'Alaihi Wasallam, lalu saya berbincang kepada beliau mengenai tawanan perang dari kalangan anak-anak dan wanita yang kami dapatkan pada masa jahiliyah. Saat itu beliau sedang bercerita kepada jama'ah, sementara mereka duduk mengelilingi beliau, dan beliau memakai sarung katun tebal miliki beliau. Hal yang pertama kali aku dengar dari beliau adalah, dan beliau memberi isyarat dengan tangannya seperti ini, -Mubarrak memberi isyarat dengan jari telunjuknya- \"Seorang muslim itu saudara muslim lainnya, tidak boleh menganiayanya dan tidak boleh merendahkannya. taqwa itu letaknya di sini, taqwa itu letaknya di sini.\" maksudnya di hati."
            },
            {
                "number": 2777,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا عَلِيُّ بْنُ زَيْدٍ عَنِ الْحَسَنِ حَدَّثَنِي رَجُلٌ مِنْ بَنِي سَلِيطٍ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي أَزْفَلَةٍ مِنْ النَّاسِ فَسَمِعْتُهُ يَقُولُ الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَظْلِمُهُ وَلَا يَخْذُلُهُ التَّقْوَى هَاهُنَا قَالَ حَمَّادٌ وَقَالَ بِيَدِهِ إِلَى صَدْرِهِ وَمَا تَوَادَّ اثْنَانِ فِي اللَّهِ عَزَّ وَجَلَّ لَا يُفَرِّقُ بَيْنَهُمَا إِلَّا حَدَثٌ يُحْدِثُهُ أَحَدُهُمَا وَالْمُحْدِثُ شَرٌّ وَالْمُحْدِثُ شَرٌّ وَالْمُحْدِثُ شَرٌّ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammad], telah mengabarkan kepada kami [Ali bin Zaid] dari [Al Hasan], telah menceritakan kepadaku [seseorang] dari bani Salith, ia berkata; \"Aku mendatangi Rasulullah Shallalahu 'Alaihi Wasallam ketika beliau berada dikerumunan orang-orang, lalu aku mendengar beliau bersabda: \"Muslim itu saudara muslim lainnya, tidak boleh menzhaliminya dan tidak boleh merendahkannya, taqwa itu di sini!, \" - [Hammad] berkata; Beliau menunjuk ke dadanya- Dan tidaklah dua orang yang mencintai karena Allah 'azza wajalla, keduanya tidak akan berpisah kecuali karena perkataan yang menyakitkan dari salah satunya, maka yang berkata-kata itu jahat, yang berkata-kata itu jahat, dan yang berkata-kata itu jahat.\""
            },
            {
                "number": 2778,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ أَبِي تَمِيمَةَ عَنْ رِدْفِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ عَنْ رَجُلٍ عَنْ رِدْفِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهُ كَانَ عَلَى حِمَارٍ فَعَثَرَ فَقَالَ الَّذِي خَلْفَهُ تَعِسَ الشَّيْطَانُ فَقَالَ لَا تَقُلْ تَعِسَ الشَّيْطَانُ فَإِنَّكَ إِذَا قُلْتَ تَعِسَ الشَّيْطَانُ تَعَاظَمَ وَقَالَ بِعِزَّتِي صَرَعْتُكَ وَإِذَا قُلْتَ بِسْمِ اللَّهِ تَصَاغَرَ حَتَّى يَصِيرَ مِثْلَ ذُبَابٍ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Syu'bah] dari [Ashim Al Ahwal] dari [Abu Tamimah] dari [seorang yang membonceng Nabi] Shalallahu 'Alaihi Wasallam, bahwa beliau pernah berada di atas keledai, lalu keledainya jatuh tergelincir, serentak orang yang membonceng di belakang beliau berkata; \"Celakalah setan, \" Maka beliau bersabda: \"Janganlah kamu katakan \"celakalah setan, \" sebab jika kamu mengatakan \"celakalah setan, \" maka setan akan membanggakan dirinya, setan akan berkata; \"Aku telah melawannya dengan kekuatanku, \" namuan bila kamu membaca BISMILLAAH maka setan akan menjadi kecil, lebih kecil dari seekor lalat.\""
            },
            {
                "number": 2779,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَمَّنْسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ{ فَيَوْمَئِذٍ لَا يُعَذِّبُ عَذَابَهُ أَحَدٌ وَلَا يُوثِقُ وَثَاقَهُ أَحَدٌ }يَعْنِي يَفْعَلُ بِهِقَالَ خَالِدٌ وَسَأَلْتُ عَبْدَ الرَّحْمَنِ بْنَ أَبِي بَكْرَةَ قَالَ{ فَيَوْمَئِذٍ لَا يُعَذِّبُ }أَيْ يَفْعَلُ بِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah] dari [Khalid Al Hadza`] dari [Abu Qilabah] dari [seseorang] yang pernah mendengar Nabi Shallalahu 'Alaihi Wasallam ketika beliau membaca ayat \"FAYAUMA'IDZIN LAA YU'ADZABU 'ADZAABAHU AHAD WALAA YUU TSIQU WATSAAQOHU AHAD (Maka pada hari itu tiada seorangpun yang menyiksa seperti siksa-Nya. Dan tiada seorangpun yang mengikat seperti ikatan-Nya) \". QS Al fajr: 25-26, maksudnya mengerjakannya.\" [Khalid] berkata; \"Aku bertanya kepada [Abdurrahman bin Abu Bakrah], dia menjawab; \"fayauma'idzin laa yu'adzabu\" maksudnya melakukannya.\""
            },
            {
                "number": 2780,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا الْأَزْرَقُ بْنُ قَيْسٍ عَنْ يَحْيَى بْنِ يَعْمُرَ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَأَوَّلُ مَا يُحَاسَبُ بِهِ الْعَبْدُ يَوْمَ الْقِيَامَةِ صَلَاتُهُ فَإِنْ أَتَمَّهَا كُتِبَتْ لَهُ تَامَّةً وَإِنْ لَمْ يَكُنْ أَتَمَّهَا قَالَ انْظُرُوا تَجِدُونَ لِعَبْدِي مِنْ تَطَوُّعٍ فَأَكْمِلُوا مَا ضَيَّعَ مِنْ فَرِيضَتِهِ ثُمَّ الزَّكَاةُ ثُمَّ تُؤْخَذُ الْأَعْمَالُ عَلَى حَسَبِ ذَلِكَ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammad bin Salamah] telah menceritakan kepada kami [Al Azraq bin Qais] dari [Yahya bin Ya'mar] dari [salah seorang sahabat Nabi] Shalallahu 'Alaihi Wasallam beliau bersabda: \"Amalan yang pertama kali dihisab dari seorang hamba pada hari kiamat adalah sholatnya, bila sempurna maka ditulis dengan lengkap, bila tidak maka Allah berfirman: \"Lihatlah apakah dia memiliki sholat sunah, lengkapilah sesuatu yang kurang sempurna dari sholat wajibnya, kemudian zakat, setelah itu semua amal dihitung sesuai kadarnya.\""
            },
            {
                "number": 2781,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ قَالَجَلَسَ إِلَيْنَا شَيْخٌ فِي مَكَانِ أَيُّوبَ فَسَمِعَ الْقَوْمَ يَتَحَدَّثُونَ فَقَالَ حَدَّثَنِي مَوْلَايَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ مَا اسْمُهُ قَالَ قُرَّةُ بْنُ دَعْمُوصٍ النُّمَيْرِيُّ قَالَ قَدِمْتُ الْمَدِينَةَ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحَوْلَهُ النَّاسُ فَجَعَلْتُ أُرِيدُ أَنْ أَدْنُوَ مِنْهُ فَلَمْ أَسْتَطِعْ فَنَادَيْتُهُ يَا رَسُولَ اللَّهِ اسْتَغْفِرْ لِلْغُلَامِ النُّمَيْرِيِّ فَقَالَ غَفَرَ اللَّهُ لَكَ قَالَ وَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الضَّحَّاكَ بْنَ قَيْسٍ سَاعِيًا فَلَمَّا رَجَعَ رَجَعَ بِإِبِلٍ جُلَّةٍ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَيْتَ هِلَالَ بْنَ عَامِرٍ وَنُمَيْرَ بْنَ عَامِرٍ وَعَامِرَ بْنَ رَبِيعَةَ فَأَخَذْتَ جُلَّةَ أَمْوَالِهِمْ قَالَ يَا رَسُولَ اللَّهِ إِنَّنِي سَمِعْتُكَ تَذْكُرُ الْغَزْوَ فَأَحْبَبْتُ أَنْ آتِيَكَ بِإِبِلٍ تَرْكَبُهَا وَتَحْمِلُ عَلَيْهَا فَقَالَ وَاللَّهِ لَلَّذِي تَرَكْتَ أَحَبُّ إِلَيَّ مِنْ الَّذِي أَخَذْتَ ارْدُدْهَا وَخُذْ مِنْ حَوَاشِي أَمْوَالِهِمْ صَدَقَاتِهِمْ قَالَ فَسَمِعْتُ الْمُسْلِمِينَ يُسَمُّونَ تِلْكَ الْإِبِلَ الْمَسَانَّ الْمُجَاهِدَاتِ",
                "id": "Telah bercerita kepada kami ['Affan] telah menceritakan kepada kami [Jarir bin Hazim] dia berkata; seorang [Syeikh] duduk bersama kami ditempatnya Ayyub, lalu ia mendengar orang-orang tengah berbicara, ia berkata; telah menceritakan kepadaku budakku dari Rasulullah Shallalahu 'Alaihi Wasallam, aku bertanya \"Siapa namanya?.\" Syaikh itu menjawab; [Qurrah bin Da'mus An Numairi], dia berkata; Aku datang ke Madinah untuk menemui Rasulullah Shallalahu 'Alaihi Wasallam, sementara di sekitar beliau berkumpul banyak orang, aku ingin mendekat kepadanya namun tidak bisa, maka aku memanggil beliau; \"Wahai Rasulullah, mohonkanlah ampunan untuk anak lelaki An Numairi!.\" Beliau menjawab: \"Semoga Allah mengampunimu.\" Qurrah berkata; lalu Rasulullah Shallalahu 'Alaihi Wasallam mengutus Ad Dlahhak bin Qais untuk memungut zakat, ketika kembali ia membawa seekor unta terbaik, lalu Rasulullah Shallalahu 'Alaihi Wasallam bersabda kepadanya: \"Kamu mendatangi Hilal bin Amir, Numair bin Amir dan Amir bin Rabi'ah, kemudian kamu mengambil harta mereka yang terbaik.\" Dia menjawab; \"Wahai Rasulullah sungguh aku mendengar engkau menyebutkan suatu peperangan, maka aku ingin membawakan kepadamu seekor unta yang dapat engkau kendarai dan dapat engkau isi muatan.\" Beliau bersabda: \"Demi Allah, sesuatu yang kamu tinggalkan (harta atau unta) lebih aku cintai daripada yang kamu ambil, oleh karena itu kembalikanlah unta terbaik dan ambilah dari bagian harta mereka (harta biasa) sebagai zakat mereka!.\" [Qurrah] berkata; \"Maka aku mendengar kaum muslimin menamakan unta itu dengan Al Massan Al Mujahidat.\""
            },
            {
                "number": 2782,
                "arab": "حَدَّثَنَا بَهْزٌ وَعَفَّانُ قَالَا ثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ طُفَيْلِ بْنِ سَخْبَرَةَ أَخِي عَائِشَةَ لِأُمِّهَاأَنَّهُ رَأَى فِيمَا يَرَى النَّائِمُ كَأَنَّهُ مَرَّ بِرَهْطٍ مِنْ الْيَهُودِ فَقَالَ مَنْ أَنْتُمْ قَالُوا نَحْنُ الْيَهُودُ قَالَ إِنَّكُمْ أَنْتُمْ الْقَوْمُ لَوْلَا أَنَّكُمْ تَزْعُمُونَ أَنَّ عُزَيْرًا ابْنُ اللَّهِ فَقَالَتْ الْيَهُودُ وَأَنْتُمْ الْقَوْمُ لَوْلَا أَنَّكُمْ تَقُولُونَ مَا شَاءَ اللَّهُ وَشَاءَ مُحَمَّدٌ ثُمَّ مَرَّ بِرَهْطٍ مِنْ النَّصَارَى فَقَالَ مَنْ أَنْتُمْ قَالُوا نَحْنُ النَّصَارَى فَقَالَ إِنَّكُمْ أَنْتُمْ الْقَوْمُ لَوْلَا أَنَّكُمْ تَقُولُونَ الْمَسِيحُ ابْنُ اللَّهِ قَالُوا وَإِنَّكُمْ أَنْتُمْ الْقَوْمُ لَوْلَا أَنَّكُمْ تَقُولُونَ مَا شَاءَ اللَّهُ وَمَا شَاءَ مُحَمَّدٌ فَلَمَّا أَصْبَحَ أَخْبَرَ بِهَا مَنْ أَخْبَرَ ثُمَّ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ فَقَالَ هَلْ أَخْبَرْتَ بِهَا أَحَدًا قَالَ عَفَّانُ قَالَ نَعَمْ فَلَمَّا صَلَّوْا خَطَبَهُمْ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ إِنَّ طُفَيْلًا رَأَى رُؤْيَا فَأَخْبَرَ بِهَا مَنْ أَخْبَرَ مِنْكُمْ وَإِنَّكُمْ كُنْتُمْ تَقُولُونَ كَلِمَةً كَانَ يَمْنُعُنِي الْحَيَاءُ مِنْكُمْ أَنْ أَنْهَاكُمْ عَنْهَا قَالَ لَا تَقُولُوا مَا شَاءَ اللَّهُ وَمَا شَاءَ مُحَمَّدٌ",
                "id": "Telah menceritakan kepada kami [Bahz] dan ['Affan], keduanya berkata; telah menceritakan kepada kami [Hammad bin Salamah] dari [Abdul Malik bin 'Umair] dari [Rib'i bin Hirasy] dari [Thufail bin Sakhbarah] saudara seibu A'isyah, bahwa dia pernah bermimpi sebagaimana orang yang tidur bermimpi, seakan akan dia melewati sekelompok pemuka Yahudi, lalu dia berkata; \"Siapakah kalian?\" mereka menjawab; \"Kami adalah orang-orang Yahudi.\" ia berkata; \"Sungguh kalian adalah kaum yang meyakini bahwa Uzair adalah anak Allah.\" Orang-orang Yahudi pun menjawab; \"Dan kalian adalah kaum yang mengatakan apa yang Allah kehendaki dan Muhammad kehendaki.\" Lalu ia melewati sekelompok pemuka Nasrani dan bertanya; \"Siapakah kalian?.\" Mereka menjawab; \"Kami orang-orang Nasrani.\" ia pun berkata; \"Sungguh kalian adalah kaum yang mengatakan Al Masih adalah anak Allah.\" Mereka menjawab; \"Dan kalian adalah kaum yang mengatakan apa yang Allah dan Muhammad kehendaki.\" Keesokan harinya, seseorang memberitakan mimpi itu kepada Nabi Shallalahu 'Alaihi Wasallam, kemudian beliau bertanya; \"Apakah kamu telah menceritakannya kepada seseorang?\" 'Affan mengatakan; Dia menjawab; \"ya, \" Seusai sholat, beliau pun berkhutbah kepada para sahabat, lalu memuji Allah dan menyucikannya, seraya bersabda: \"Sungguh Thufail telah bermimpi sesuatu, kemudian dia menceritakannya kepada beberapa orang diantara kalian, Sungguh kalian mengatakan suatu kalimat, karena sebab malu menghalangiku untuk melarang kalian mengatakannya, beliau bersabda: \"Janganlah kalian mengatakan; \"apa yang Allah kehendaki dan apa yang Muhammad kehendaki.\""
            },
            {
                "number": 2783,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا عَلِيُّ بْنُ زَيْدٍ عَنْ أَبِي حُرَّةَ الرَّقَاشِيِّ عَنْ عَمِّهِ قَالَكُنْتُ آخِذًا بِزِمَامِ نَاقَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَوْسَطِ أَيَّامِ التَّشْرِيقِ أَذُودُ عَنْهُ النَّاسَ فَقَالَ يَا أَيُّهَا النَّاسُ أَتَدْرُونَ فِي أَيِّ شَهْرٍ أَنْتُمْ وَفِي أَيِّ يَوْمٍ أَنْتُمْ وَفِي أَيِّ بَلَدٍ أَنْتُمْ قَالُوا فِي يَوْمٍ حَرَامٍ وَشَهْرٍ حَرَامٍ وَبَلَدٍ حَرَامٍ قَالَ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ وَأَعْرَاضَكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا إِلَى يَوْمِ تَلْقَوْنَهُ ثُمَّ قَالَ اسْمَعُوا مِنِّي تَعِيشُوا أَلَا لَا تَظْلِمُوا أَلَا لَا تَظْلِمُوا أَلَا لَا تَظْلِمُوا إِنَّهُ لَا يَحِلُّ مَالُ امْرِئٍ إِلَّا بِطِيبِ نَفْسٍ مِنْهُ أَلَا وَإِنَّ كُلَّ دَمٍ وَمَالٍ وَمَأْثَرَةٍ كَانَتْ فِي الْجَاهِلِيَّةِ تَحْتَ قَدَمِي هَذِهِ إِلَى يَوْمِ الْقِيَامَةِ وَإِنَّ أَوَّلَ دَمٍ يُوضَعُ دَمُ رَبِيعَةَ بْنِ الْحَارِثِ بْنِ عَبْدِ الْمُطَّلِبِ كَانَ مُسْتَرْضِعًا فِي بَنِي لَيْثٍ فَقَتَلَتْهُ هُذَيْلٌ أَلَا وَإِنَّ كُلَّ رِبًا كَانَ فِي الْجَاهِلِيَّةِ مَوْضُوعٌ وَإِنَّ اللَّهَ عَزَّ وَجَلَّ قَضَى أَنَّ أَوَّلَ رِبًا يُوضَعُ رِبَا الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ لَكُمْ رُءُوسُ أَمْوَالِكُمْ لَا تَظْلِمُونَ وَلَا تُظْلَمُونَ أَلَا وَإِنَّ الزَّمَانَ قَدْ اسْتَدَارَ كَهَيْئَتِهِ يَوْمَ خَلَقَ اللَّهُ السَّمَوَاتِ وَالْأَرْضَ ثُمَّ قَرَأَ{ إِنَّ عِدَّةَ الشُّهُورِ عِنْدَ اللَّهِ اثْنَا عَشَرَ شَهْرًا فِي كِتَابِ اللَّهِ يَوْمَ خَلَقَ السَّمَوَاتِ وَالْأَرْضَ مِنْهَا أَرْبَعَةٌ حُرُمٌ ذَلِكَ الدِّينُ الْقَيِّمُ فَلَا تَظْلِمُوا فِيهِنَّ أَنْفُسَكُمْ }أَلَا لَا تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ أَلَا إِنَّ الشَّيْطَانَ قَدْ أَيِسَ أَنْ يَعْبُدَهُ الْمُصَلُّونَ وَلَكِنَّهُ فِي التَّحْرِيشِ بَيْنَكُمْ فَاتَّقُوا اللَّهَ عَزَّ وَجَلَّ فِي النِّسَاءِ فَإِنَّهُنَّ عِنْدَكُمْ عَوَانٌ لَا يَمْلِكْنَ لِأَنْفُسِهِنَّ شَيْئًا وَإِنَّ لَهُنَّ عَلَيْكُمْ وَلَكُمْ عَلَيْهِنَّ حَقًّا أَنْ لَا يُوطِئْنَ فُرُشَكُمْ أَحَدًا غَيْرَكُمْ وَلَا يَأْذَنَّ فِي بُيُوتِكُمْ لِأَحَدٍ تَكْرَهُونَهُ فَإِنْ خِفْتُمْ نُشُوزَهُنَّ فَعِظُوهُنَّ وَاهْجُرُوهُنَّ فِي الْمَضَاجِعِ وَاضْرِبُوهُنَّ ضَرْبًا غَيْرَ مُبَرِّحٍ قَالَ حُمَيْدٌ قُلْتُ لِلْحَسَنِ مَا الْمُبَرِّحُ قَالَ الْمُؤَثِّرُ وَلَهُنَّ رِزْقُهُنَّ وَكِسْوَتُهُنَّ بِالْمَعْرُوفِ وَإِنَّمَا أَخَذْتُمُوهُنَّ بِأَمَانَةِ اللَّهِ وَاسْتَحْلَلْتُمْ فُرُوجَهُنَّ بِكَلِمَةِ اللَّهِ عَزَّ وَجَلَّ وَمَنْ كَانَتْ عِنْدَهُ أَمَانَةٌ فَلْيُؤَدِّهَا إِلَى مَنْ ائْتَمَنَهُ عَلَيْهَا وَبَسَطَ يَدَيْهِ فَقَالَ أَلَا هَلْ بَلَّغْتُ أَلَا هَلْ بَلَّغْتُ أَلَا هَلْ بَلَّغْتُ ثُمَّ قَالَ لِيُبَلِّغْ الشَّاهِدُ الْغَائِبَ فَإِنَّهُ رُبَّ مُبَلَّغٍ أَسْعَدُ مِنْ سَامِعٍقَالَ حُمَيْدٌ قَالَ الْحَسَنُ حِينَ بَلَّغَ هَذِهِ الْكَلِمَةَ قَدْ وَاللَّهِ بَلَّغُوا أَقْوَامًا كَانُوا أَسْعَدَ بِهِ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammad bin Salamah], telah mengabarkan kepada kami [Ali bin Zaid] dari [Abu Hurrah Ar Raqasyi] dari [Pamannya] dia berkata; \"Aku memegang tali kekang unta Rasulullah Shallalahu 'Alaihi Wasallam pada pertengahan hari Tasyrik (yaitu tanggal sebelas, dua belas dan tiga belas Dzulhijjah), aku mendesak orang-orang dari beliau, beliau bertanya: \"Wahai manusia, tahukah kalian di bulan apa kalian sekarang, di hari dan negeri mana kalian sekarang?.\" Para sahabat menjawab; \"Di hari haram, bulan haram dan negeri haram, \" beliau bersabda: \"Sungguh darah, harta dan kehormatan kalian adalah haram atas kalian, sebagaimana sucinya hari, bulan dan negeri kalian ini sampai datangnya hari kalian bertemu Allah.\" Beliau melanjutkan: \"Dengarkanlah aku, hiduplah kalian dan janganlah berbuat kezhaliman, ingatlah jangan berbuat dzalim, Sungguh tidak halal harta seseorang kecuali dengan kerelaan hati darinya, ketahuilah sesungguhnya setiap darah, harta dan kebanggaan yang ada pada masa jahiliyah, berada di bawah telapak kakiku ini sampai hari Kiamat, dan sesungguhnya darah yang pertama kali akan diletakkan adalah darah Rabi'ah bin Al Harits bin Abdul Muthallib, dia mencari seorang wanita yang bisa menyusui di Bani Laits, kemudian dibunuh oleh orang-orang Hudzail, ketahuilah sesungguhnya setiap riba di masa jahiliyah adalah jelek, dan sesungguhnya Allah 'azza wajalla telah memutuskan bahwa riba yang pertama kali akan diletakkan adalah riba Al Abbas bin Abdul Muthallib, bagi kalian adalah pokok harta kalian, janganlah kalian menzhalimi dan jangan pula terzhalimi, ketahuilah sesungguhnya zaman telah berputar sebagaimana perputaran pada hari Allah menciptakan langit dan bumi, kemudian beliau membaca ayat \"INNA 'IDDATASY SYUHUURI 'INDALLAAHI ITSNAA 'ASYARA SYAHRAN FII KITAABILLAAHI YAUMA KHOLAQAS SAMAAWAATI WAL ARDLA MINHAA ARBA'ATUN HURUM DZAALIKAD DIINUL QAYYIMU FALAA TADLIMUU FIIHINNA ANFUSAKUM (Sesungguhnya bilangan bulan pada sisi Allah adalah dua belas bulan, dalam ketetapan Allah di waktu dia menciptakan langit dan bumi, di antaranya empat bulan haram. Itulah (ketetapan) agama yang lurus, Maka janganlah kamu menganiaya diri kamu dalam bulan yang empat itu) \". QS At Taubah: 36, ketahuilah janganlah kalian kembali kepada kekafiran sepeninggalku, dengan saling membunuh satu sama lain, ketahuilah sesungguhnya setan telah putus asa untuk disembah oleh orang-orang yang sholat, akan tetapi dia tidak berputus asa untuk mengadu domba diantara kalian, maka takutlah kepada Allah 'azza wajalla dalam masalah wanita, karena sesungguhnya mereka di sisi kalian ibarat tawanan yang tidak dapat menguasai diri mereka sedikitpun, dan sungguh mereka mempunyai hak dari kalian dan kalianpun mempunyai hak atas mereka, janganlah mereka memasukkan kedalam rumah kalian selain kalian sendiri, janganlah mereka mengizinkan masuk ke dalam rumah kalian seseorang yang tidak kalian sukai, jika kalian khawatir akan nusyuz (durhaka) mereka, maka nasehatilah mereka lalu jauhilah mereka di tempat tidur dan pukulah mereka dengan pukulan yang tidak menyakitkan.\" [Humaid] berkata; Aku bertanya kepada [Al Hasan]; \"Apa yang dimaksud dengan \"Al Mubarrih?.\" dia menjawab; \"Yang membekas, \" dan hak bagi mereka adalah mendapatkan makan dan pakaian dengan cara ma'ruf, hanyasannya kalian mengambil mereka adalah dengan amanat dari Allah dan kalian menghalalkan farji (kehormatan) mereka adalah dengan kalimat Allah 'azza wajalla, dan barangsiapa mendapat amanat, maka sampaikanlah amanat itu kepada orang yang diamanati.\" Kemudian beliau membentangkan kedua tangannya seraya bersabda; \"ketahuilah bukankah aku telah menyampaikan, ketahuilah bukankah aku telah menyampaikan, ketahuilah bukankah aku telah menyampaikan?.\" Kemudian beliau melanjutkan sabdanya: \"Hendaknya orang yang hadir menyampaikan kepada yang tidak hadir, karena betapa banyak orang yang disampaikan berita kepadanya, dia lebih faham dari orang yang mendengar langsung.\" Humaid berkata; \" Al Hasan berkata ketika menyampaikan kalimat ini; \"Sungguh, demi Allah, mereka menyampaikan kepada suatu kaum dan mereka lebih bahagia dengannya.\""
            },
            {
                "number": 2784,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ عَنْ رَجُلٍ مِنْ أَهْلِ الشَّامِ يُقَالُ لَهُ عَمَّارٌ قَالَأَدْرَبْنَا عَامًا ثُمَّ قَفَلْنَا وَفِينَا شَيْخٌ مِنْ خَثْعَمٍ فَذُكِرَ الْحَجَّاجُ فَوَقَعَ فِيهِ وَشَتَمَهُ فَقُلْتُ لَهُ لِمَ تَسُبُّهُ وَهُوَ يُقَاتِلُ أَهْلَ الْعِرَاقِ فِي طَاعَةِ أَمِيرِ الْمُؤْمِنِينَ فَقَالَ إِنَّهُ هُوَ الَّذِي أَكْفَرَهُمْ ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَكُونُ فِي هَذِهِ الْأُمَّةِ خَمْسُ فِتَنٍ فَقَدْ مَضَتْ أَرْبَعٌ وَبَقِيَتْ وَاحِدَةٌ وَهِيَ الصَّيْلَمُ وَهِيَ فِيكُمْ يَا أَهْلَ الشَّامِ فَإِنْ أَدْرَكْتَهَا فَإِنْ اسْتَطَعْتَ أَنْ تَكُونَ حَجَرًا فَكُنْهُ وَلَا تَكُنْ مَعَ وَاحِدٍ مِنْ الْفَرِيقَيْنِ أَلَا فَاتَّخِذْ نَفَقًا فِي الْأَرْضِ وَقَدْ قَالَ حَمَّادٌ وَلَا تَكُنْوَقَدْ حَدَّثَنَا بِهِ حَمَّادٌ قَبْلَ ذَا قُلْتُ أَأَنْتَ سَمِعْتَهُ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ قُلْتُ يَرْحَمُكَ اللَّهُ أَفَلَا كُنْتَ أَعْلَمْتَنِي أَنَّكَ رَأَيْتَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى أُسَائِلَكَ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammad bin Salamah], telah mengabarkan kepada kami [Daud bin Abu Hind] dari seorang lelaki penduduk Syam yang biasa dipanggil dengan [Ammar] dia berkata; selama setahun, kami terbiasa tak ada masalah kemudian kami merasa gersang, sedangkan di antara kami ada seorang [syeikh] dari Khats'am, ketika disebut nama Al Hajjaj, serta merta dia mencelanya, maka aku bertanya kepadanya; \"Kenapa kamu mencelanya, padahal dia memerangi orang-orang Irak dalam rangka taat kepada Amirul Mukminin?.\" Syaikh itu menjawab; \"Sungguh dialah yang telah mengkafirkan mereka, lalu dia berkata; \"Aku mendengar Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Akan terjadi lima fitnah pada umat ini, yang empat telah terjadi dan yang tersisa satu lagi yaitu Ash Shailam (perpecahan yang hebat), dan akan terjadi pada kalian wahai penduduk Syam, jika kamu menjumpainya, sementara dirimu dapat menjadi batu, lebih baik menjadi batu dan janganlah kamu bergabung dengan salah satu dari dua golongan, ketahuilah ambilah nafkahmu di bumi.\" Hammad berkata;; \"Janganlah kamu menjadi.\" Dan telah menceritakan kepada kami Hammad sebelum ini, aku berkata; \"Apakah kamu mendengarnya dari Nabi Shallalahu 'Alaihi Wasallam?.\" dia menjawab; \"ya.\" Aku berkata; \"Semoga Allah merahmatimu, kenapa kamu tidak memberitahuku bahwa kamu pernah melihat Nabi Shallalahu 'Alaihi Wasallam sehingga aku bisa bertanya banyak hal kepadamu.\""
            },
            {
                "number": 2785,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ أَخْبَرَنَا عَمَّارٌ يَعْنِي ابْنَ أَبِي عَمَّارٍ عَنِ ابْنِ عَبَّاسٍ قَالَأَتَى عَلَيَّ زَمَانٌ وَأَنَا أَقُولُ أَوْلَادُ الْمُسْلِمِينَ مَعَ الْمُسْلِمِينَ وَأَوْلَادُ الْمُشْرِكِينَ مَعَ الْمُشْرِكِينَ حَتَّى حَدَّثَنِي فُلَانٌ عَنْ فُلَانٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْهُمْ فَقَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ قَالَ فَلَقِيتُ الرَّجُلَ فَأَخْبَرَنِي فَأَمْسَكْتُ عَنْ قَوْلِي",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammad yaitu Ibnu Salamah], telah mengabarkan kepada kami [Ammar yaitu Ibnu Abu Amar] dari [Ibnu Abbas] dia berkata; telah tiba masaku untuk mengatakan; \"Anak-anak kaum muslimin bersama kaum muslimin sedangkan anak-anak kaum musyrikin bersama orang-orang musyrik, \" hingga si fulan bercerita kepadaku dari [fulan] bahwa Rasulullah Shallalahu 'Alaihi Wasallam pernah ditanya tentang mereka (anak-anak tersebut), beliau menjawab: \"Allah yang lebih tahu terhadap apa yang mereka lakukan.\" Ibnu Abbas berkata; \"Kemudian aku bertemu dengan seorang lelaki, lalu dia mengabarkan kepadaku, namun aku menahan ucapanku.\""
            },
            {
                "number": 2786,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ سَمِعْتُ شَيْخًا مِنْ قَيْسٍ يُحَدِّثُ عَنْ أَبِيهِ أَنَّهُ قَالَجَاءَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَنَا بَكْرَةٌ صَعْبَةٌ لَا يُقْدَرُ عَلَيْهَا قَالَ فَدَنَا مِنْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَسَحَ ضَرْعَهَا فَحَفَلَ فَاحْتَلَبَ قَالَ وَلَمَّا مَاتَ أَبِي جَاءَ وَقَدْ شَدَدْتُهُ فِي كَفَنِهِ وَأَخَذْتُ سُلَّاءَةً فَشَدَدْتُ بِهَا الْكَفَنَ فَقَالَ لَا تُعَذِّبْ أَبَاكَ بِالسُّلَّى قَالَهَا حَمَّادٌ ثَلَاثًا قَالَ ثُمَّ كَشَفَ عَنْ صَدْرِهِ وَأَلْقَى السُّلَّى ثُمَّ بَزَقَ عَلَى صَدْرِهِ حَتَّى رَأَيْتُ رُضَاضَ بُزَاقِهِ عَلَى صَدْرِهِ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah], dia berkata; aku mendengar [seorang syaikh] dari bani Qais yang bercerita dari [Ayahnya] bahwa dia berkata; Nabi Shallalahu 'Alaihi Wasallam datang kepada kami, sementara kami hanya memiliki seekor unta muda yang payah dan tidak termanfaatkan, dia berkata; \"Kemudian Rasulullah Shallalahu 'Alaihi Wasallam mendekatinya lalu mengusap susunya, menampung dan memerahnya, ketika ayahku wafat, beliau datang sementara aku tengah mengencangkan kafannya, aku mengambil duri pohon kurma yang aku gunakan sebagai pengencang kafan, lalu beliau bersabda: \"Janganlah kamu menyiksa bapakmu dengan duri kurma!.\" [Hammad] berkata (dalam riwayat); \"Beliau mengatakannya hingga tiga kali, \" dia berkata; \"Kemudian beliau membuka bagian dadanya dan membuang duri kurma, dan meludahi dadanya, sehingga aku melihat tetesan ludah beliau di atas dada ayahku.\""
            },
            {
                "number": 2787,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا وُهَيْبٌ حَدَّثَنَا عَمْرُو بْنُ يَحْيَى عَنْ مُعَاذِ بْنِ رِفَاعَةَ الْأَنْصَارِيِّ عَنْ رَجُلٍ مِنْ بَنِي سَلِمَةَ يُقَالُ لَهُ سُلَيْمٌأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ مُعَاذَ بْنَ جَبَلٍ يَأْتِينَا بَعْدَمَا نَنَامُ وَنَكُونُ فِي أَعْمَالِنَا بِالنَّهَارِ فَيُنَادِي بِالصَّلَاةِ فَنَخْرُجُ إِلَيْهِ فَيُطَوِّلُ عَلَيْنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا مُعَاذُ بْنَ جَبَلٍ لَا تَكُنْ فَتَّانًا إِمَّا أَنْ تُصَلِّيَ مَعِي وَإِمَّا أَنْ تُخَفِّفَ عَلَى قَوْمِكَ ثُمَّ قَالَ يَا سُلَيْمُ مَاذَا مَعَكَ مِنْ الْقُرْآنِ قَالَ إِنِّي أَسْأَلُ اللَّهَ الْجَنَّةَ وَأَعُوذُ بِهِ مِنْ النَّارِ وَاللَّهِ مَا أُحْسِنُ دَنْدَنَتَكَ وَلَا دَنْدَنَةَ مُعَاذٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهَلْ تَصِيرُ دَنْدَنَتِي وَدَنْدَنَةُ مُعَاذٍ إِلَّا أَنْ نَسْأَلَ اللَّهَ الْجَنَّةَ وَنَعُوذَ بِهِ مِنْ النَّارِثُمَّ قَالَ سُلَيْمٌ سَتَرَوْنَ غَدًا إِذَا الْتَقَى الْقَوْمُ إِنْ شَاءَ اللَّهُ قَالَ وَالنَّاسُ يَتَجَهَّزُونَ إِلَى أُحُدٍ فَخَرَجَ وَكَانَ فِي الشُّهَدَاءِ رَحْمَةُ اللَّهِ وَرِضْوَانُهُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami ['Amru bin Yahya] dari [Mu'adz bin Rifa'ah Al Anshari] dari seorang lelaki bani Salamah yang dipanggil dengan [Sulaim], dia pernah datang kepada Rasulullah Shallalahu 'Alaihi Wasallam seraya berkata; \"Wahai Rasulullah, sungguh Mu'adz bin Jabal datang kepada kami ketika kami sedang tertidur, dan ketika kami tengah bekerja di siang hari, kemudian dia menyeru untuk sholat, lantas kami pun keluar menemuinya, namun dia malah memanjangkan (sholatnya).\" Rasulullah Shallalahu 'Alaihi Wasallam lalu bersabda: \"Wahai Mu'adz, janganlah kamu menjadi pembuat fitnah, hendaknya jika kamu sholat dengan aku maka ringankanlah (sholatmu) atas kaummu!.\" kemudian beliau bertanya: \"Wahai Sulaim, apa yang kamu hafal dari Al Qur'an?.\" Dia menjawab; \"Sesungguhnya aku memohon Surga kepada Allah dan berlindung kepadaNya dari api neraka, demi Allah aku tidak bisa seperti bacaan engkau dan tidak juga bacaan Mu'adz.\" Kemudian Rasulullah Shallalahu 'Alaihi Wasallam bertanya: \"Bukankah bacaanku dan bacaan Mu'adz tidak lain agar kita memohon Surga kepada Allah dan berlindung kepadanya dari api neraka?.\" Kemudian Sulaim berkata; 'Besok insya`allah (jika Allah menghendaki) kalian akan melihat apabila dua pasukan telah berhadapan.' Mu'adz berkata; Orang-orang bersiap siap menuju Uhud, kemudian ia keluar (ikut bertempur), dan dia termasuk dalam kelompok orang-orang yang mati Syahid, semoga Rahmat Allah dan keridla`anNya di berikan kepadanya."
            },
            {
                "number": 2788,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنْ أَبِي الْمَلِيحِ عَنْ أَبِيهِأَنَّ يَوْمَ حُنَيْنٍ كَانَ مَطِيرًا قَالَ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُنَادِيَهُ أَنَّ الصَّلَاةَ فِي الرِّحَالِحَدَّثَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ سَمُرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ سَوَاءً",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammam], telah menceritakan kepada kami [Qatadah] dari [Abu Malih] dari [Ayahnya] bahwa terjadi hujan lebat pada saat perang Hunain, maka Rasulullah Shallalahu 'Alaihi Wasallam memerintahkan mu`adzinnya supaya menyerukan sholat di persinggahan masing-masing.\" Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammam], telah menceritakan kepada kami [Qatadah] dari [Al Hasan] dari [Samurah] dari Nabi Shalallahu 'Alaihi Wasallam dengan lafadz yang sama.\""
            },
            {
                "number": 2789,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا أَبَانُ حَدَّثَنَا قَتَادَةُ حَدَّثَنَا أَبُو الْمَلِيحِ عَنْ أَبِيهِأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَوْمَ حُنَيْنٍ فِي يَوْمٍ مَطِيرٍ الصَّلَاةُ فِي الرِّحَالِ",
                "id": "Telah menceritakan kepada kami [Bahz], telah menceritakan kepada kami [Aban], telah menceritakan kepada kami [Qatadah] dari [Abu Malih] dari [Ayahnya] bahwa Nabi Shalallahu 'Alaihi Wasallam bersabda pada saat perang Hunain di waktu turun hujan: \"sholatlah di persinggahan masing-masing.\""
            },
            {
                "number": 2790,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا سُفْيَانُ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمَلِيحِ قَالَصَلَّيْتُ الْعِشَاءَ الْآخِرَةَ بِالْبَصْرَةِ وَمُطِرْنَا ثُمَّ جِئْتُ أَسْتَفْتِحُ قَالَ فَقَالَ لِي أَبُو أُسَامَةَ رَأَيْتُنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَمَنَ الْحُدَيْبِيَةِ مُطِرْنَا فَلَمْ تَبُلَّ السَّمَاءُ أَسَافِلَ نِعَالِنَا فَنَادَى مُنَادِي النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ صَلُّوا فِي رِحَالِكُمْ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq], telah mengabarkan kepada kami [Sufyan] dari [Khalid Al Hadza`] dari [Abu Qilabah] dari [Abu Malih] ia berkata; Saya pernah sholat isya' di Bashrah, karena kehujanan aku datang meminta dibukakan pintu. Abu Malih berkata; lantas [Abu Usamah] berkata kepadaku; \"Aku pernah mengalami saat bersama Rasulullah Shallalahu 'Alaihi Wasallam di peristiwa Hudaibiyah, saat itu juga terjadi hujan, padahal air langit tidak membasahi sandal-sandal kami, namun mu`adzin Rasulullah Shallalahu 'Alaihi Wasallam menyerukan untuk sholat di rumah persinggahan masing-masing."
            },
            {
                "number": 2791,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ أَخْبَرَنَا سَعِيدٌ وَابْنُ جَعْفَرٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ بْنِ أُسَامَةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ جُلُودِ السِّبَاعِ",
                "id": "Telah menceritakan kepada kami [Isma'il], telah mengabarkan kepada kami [Sa'id] -dan [Ibnu Ja'far] telah menceritakan kepada kami [Sa'id] - dari [Qatadah] dari [Abu Malih bin Usamah] dari [Ayahnya] bahwa Rasulullah Shallalahu 'Alaihi Wasallam melarang (mengkonsumsi) kulit binatang buas.\""
            },
            {
                "number": 2792,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ أَخْبَرَنَا خَالِدٌ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمَلِيحِ بْنِ أُسَامَةَ قَالَخَرَجْتُ إِلَى الْمَسْجِدِ فِي لَيْلَةٍ مَطِيرَةٍ فَلَمَّا رَجَعْتُ اسْتَفْتَحْتُ فَقَالَ أَبِي مَنْ هَذَا قَالُوا أَبُو الْمَلِيحِ قَالَ لَقَدْ رَأَيْتُنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَمَنَ الْحُدَيْبِيَةِ وَأَصَابَتْنَا سَمَاءٌ لَمْ تَبُلَّ أَسَافِلَ نِعَالِنَا فَنَادَى مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ صَلُّوا فِي رِحَالِكُمْ",
                "id": "Telah menceritakan kepada kami [Isma'il], telah menceritakan kepada kami [Khalid] dari [Abu Qilabah] dari [Abu MAlih bin Usamah] ia berkata; Aku keluar di saat malam turunnya hujan menuju masjid, ketika aku pulang dan minta dibukakan pintu, [Ayahku] bertanya; \"Siapa ini?.\" Mereka menjawab; \"Abu Malih.\" Ayahkku berkata; \"Sungguh kami telah menyaksikan bersama Nabi Shalallahu 'Alaihi Wasallam saat perjanjian Hudaibiyah, kami kehujanan padahal hujan tidak sampai membasahi sandal-sandal kami, lantas mu`adzin Rasulullah Shallalahu 'Alaihi Wasallam menyerukan; \"sholatlah kalian di persinggahan masing-masing.\""
            },
            {
                "number": 2793,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ وَحَجَّاجٌ حَدَّثَنِي شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ أَبَا الْمَلِيحِ يُحَدِّثُ عَنْ أَبِيهِ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتٍ يَقُولُ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَا يَقْبَلُ صَلَاةً بِغَيْرِ طُهُورٍ وَلَا صَدَقَةً مِنْ غُلُولٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah] -dan [Hajjaj] telah menceritakan kepadaku [Syu'bah] - dari [Qatadah] dia berkata; saya mendengar [Abul Malih] bercerita dari [Ayahnya] bahwa dia mendengar Nabi Shallalahu 'Alaihi Wasallam ketika berada dalam rumah, beliau bersabda: \"Sesungguhnya Allah 'azza wajalla tidak menerima sholat tanpa bersuci dan tidak menerima harta sedekah dari hasil Ghulul (mengambil harta ghanimah sebelum dibagi).\""
            },
            {
                "number": 2794,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا هَمَّامٌ أَخْبَرَنَا قَتَادَةُ أَنَّ أَبَا الْمَلِيحِ أَخْبَرَهُ عَنْ أَبِيهِأَنَّ يَوْمَ حُنَيْنٍ كَانَ يَوْمًا مَطِيرًا فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُنَادِيَهُ يُنَادِي الصَّلَاةُ فِي الرِّحَالِ",
                "id": "Telah menceritakan kepada kami [Bahz], telah menceritakan kepada kami [Hammam], telah mengabarkan kepada kami [Qatadah] bahwa [Abu Malih] telah mengabarkan kepadanya, dari [Ayahnya] bahwa terjadi hujan pada saat perang Hunain, lalu Nabi Shallalahu 'Alaihi Wasallam memerintahkan mu`adzinnya supaya menyerukan sholat di persinggahan masing-masing."
            },
            {
                "number": 2795,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ جُلُودِ السِّبَاعِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sa'id] dari [Qatadah] dari [Abu Malih] dari [Ayahnya] bahwa Rasulullah Shallalahu 'Alaihi Wasallam melarang (menkonsumsi) kulit binatang buas.\""
            },
            {
                "number": 2796,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سَعِيدٍ حَدَّثَنَا قَتَادَةُ قَالَ سَمِعْتُ أَبَا الْمَلِيحِ يُحَدِّثُ عَنْ أَبِيهِ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَا يَقْبَلُ صَدَقَةً مِنْ غُلُولٍ وَلَا صَلَاةً بِغَيْرِ طُهُورٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sa'id], telah menceritakan kepada kami [Qatadah] ia berkata; aku mendengar [Abul Malih] bercerita dari [Ayahnya] bahwa dia mendengar Nabi Shallalahu 'Alaihi Wasallam bersabda: \"Sesungguhnya Allah 'azza wajalla tidak menerima harta sedekah dari hasil Ghulul (mengambil harta ghanimah sebelum dibagi) dan tidak menerima sholat tanpa bersuci.\""
            },
            {
                "number": 2797,
                "arab": "حَدَّثَنَا مُحَمَّدٌ وَهُوَ ابْنُ جَعْفَرٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ عَنْ أَبِيهِأَنَّهُ شَهِدَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِحُنَيْنٍ فِي يَوْمٍ مَطِيرٍ أَمَرَ مُنَادِيَهُ فَيُنَادِي إِنَّ الصَّلَاةَ فِي الرِّحَالِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Sa'id] dari [Qatadah] bahwa [Abu Malih] dari [Ayahnya] bahwa ia pernah menyaksikan Rasulullah Shallalahu 'Alaihi Wasallam pada perang Hunain di saat terjadi hujan, lalu beliau menyuruh mu`adzinnya, lantas mu`adzinnya menyeru; \"Sesungguhnya sholat di kerjakan di persinggahan masing-masing.\""
            },
            {
                "number": 2798,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ إِسْحَاقَ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا يُونُسُ بْنُ زَيْدٍ عَنْ عَطَاءٍ الْخُرَاسَانِيِّ قَالَكَانَ نُبَيْشَةُ الْهُذَلِيُّ يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ الْمُسْلِمَ إِذَا اغْتَسَلَ يَوْمَ الْجُمُعَةِ ثُمَّ أَقْبَلَ إِلَى الْمَسْجِدِ لَا يُؤْذِي أَحَدًا فَإِنْ لَمْ يَجِدْ الْإِمَامَ خَرَجَ صَلَّى مَا بَدَا لَهُ وَإِنْ وَجَدَ الْإِمَامَ قَدْ خَرَجَ جَلَسَ فَاسْتَمَعَ وَأَنْصَتَ حَتَّى يَقْضِيَ الْإِمَامُ جُمُعَتَهُ وَكَلَامَهُ إِنْ لَمْ يُغْفَرْ لَهُ فِي جُمُعَتِهِ تِلْكَ ذُنُوبُهُ كُلُّهَا أَنْ تَكُونَ كَفَّارَةً لِلْجُمُعَةِ الَّتِي قَبْلَهَا",
                "id": "Telah menceritakan kepada kami [Ali bin Ishaq], telah mengabarkan kepada kami [Abdullah], telah mengabarkan kepada kami [Yunus bin Zaid] dari [Atha` Al Khurasani] dia berkata; [Nubaisyah Al Hudzali] bercerita dari Rasulullah Shallalahu 'Alaihi Wasallam bahwa apabila seorang muslim mandi pada hari Jum'at, lalu menuju masjid dan tidak menyakiti seseorang, dan ia mendapati Imam belum muncul, maka dia telah melaksanakan sholat dengan sempurna, dan apabila mendapati imam sudah muncul, lalu ia duduk, mendengarkan dan merenungkan sehingga imam menyelesaikan khutbah Jum'atnya dan ucapannya, jika dosa-dosanya seluruhnya tidak diampuni pada hari jum'atnya itu, niscaya hal itu akan menjadi penghapus dosa-dosanya pada hari Jum'at sebelumnya.\""
            },
            {
                "number": 2799,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا خَالِدٌ عَنْ أَبِي الْمَلِيحِ عَنْ نُبَيْشَةَ الْهُذَلِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيَّامُ التَّشْرِيقِ أَيَّامُ أَكْلٍ وَشُرْبٍ وَذِكْرِ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Husyaim], telah mengabarkan kepada kami [Khalid] dari [Abul Malih] dari [Nubaisyah Al Hudzali] dia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Hari-hari Tasyrik (tanggal sebelas, dua belas dan tiga belas Dzulhijah) adalah hari-hari untuk makan, minum, dan berdzikir kepada Allah 'azza wajalla.\""
            },
            {
                "number": 2800,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي الْمَلِيحِ بْنِ أُسَامَةَ عَنْ نُبَيْشَةَ الْهُذَلِيِّ قَالَقَالُوا يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نَعْتِرُ عَتِيرَةً فِي الْجَاهِلِيَّةِ فَمَا تَأْمُرُنَا قَالَ اذْبَحُوا لِلَّهِ عَزَّ وَجَلَّ فِي أَيِّ شَهْرٍ مَا كَانَ وَبَرُّوا اللَّهَ تَبَارَكَ وَتَعَالَى وَأَطْعِمُوا قَالُوا يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نُفَرِّعُ فِي الْجَاهِلِيَّةِ فَرَعًا فَمَا تَأْمُرُنَا قَالَ فِي كُلِّ سَائِمَةٍ فَرَعٌ تَغْذُوهُ مَاشِيَتُكَ حَتَّى إِذَا اسْتَحْمَلَ ذَبَحْتَهُ فَتَصَدَّقْتَ بِلَحْمِهِ قَالَ خَالِدٌ أُرَاهُ قَالَ عَلَى ابْنِ السَّبِيلِ فَإِنَّ ذَلِكَ هُوَ خَيْرٌ قَالَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّا كُنَّا نَهَيْنَاكُمْ أَنْ تَأْكُلُوا لُحُومَهَا فَوْقَ ثَلَاثٍ كَيْ تَسَعَكُمْ فَقَدْ جَاءَ اللَّهُ بِالسَّعَةِ فَكُلُوا وَادَّخِرُوا وَاتَّجِرُوا أَلَا وَإِنَّ هَذِهِ الْأَيَّامَ أَيَّامُ أَكْلٍ وَشُرْبٍ وَذِكْرِ اللَّهِ تَبَارَكَ وَتَعَالَىقَالَ خَالِدٌ قُلْتُ لِأَبِي قِلَابَةَ كَمْ السَّائِمَةُ قَالَ مِائَةٌ",
                "id": "Telah menceritakan kepada kami [Isma'il] dari [Khalid Al Hadza`] dari [Abul Malih bin Usamah] dari [Nubaisyah Al Hudzali] ia berkata; orang-orang bertanya; \"Wahai Rasulullah, dahulu kami biasa menyembelih hewan sembelihan di bulan Rajab pada zaman jahiliyah, lantas apa yang engkau perintahkan kepada kami?.\" beliau bersabda: \"Sembelihlah sembelihan karena Allah Tabaraka Wata'ala di bulan manapun, berbuat baiklah kepada Allah dan berilah makan (dari daging sembelihan)!.\" Mereka bertanya lagi; \"Wahai Rasulullah, kamipun biasa menyembelih anak unta di zaman jahiliyah, bagaimana pendapatmu?.\" Beliau bersabda: \"Di setiap sa`imah yang kalian gembalakan dan telah cukup umur untuk di sembelih, maka sembelihdan sedekahkanlah dagingnya.\" Khalid berkata; \"Aku mengira belaiu bersabda; \"Pada ibnu sabiil (orang-orang yang mengadakan perjalanan), maka itu merupakan kebaikan buat kalian, \" Nubaisyah berlata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku melarang kalian memakan dagingnya (daging sembelihan kurban) melewati tiga hari supaya kalian merasa lapang, sekarang Allah telah melapangkan kalian, oleh karena itu makanlah, simpanlah dan sedekahkanlah untuk memperoleh pahala, ketahuilah sesungguhnya hari ini adalah hari makan, minum dan berzikir kepada Allah Tabaraka wa Ta'ala.\" Khalid berkata; Aku berktanya kepada Abu Qilabah; \"Berapa sa`imah-kah (yang disembelih saat itu)?.\" Ia menjawab; \"Seratus.\" "
            },
            {
                "number": 2801,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا الْمُعَلَّى بْنُ رَاشِدٍ الْهُذَلِيُّ قَالَ حَدَّثَتْنِي جَدَّتِي أُمُّ عَاصِمٍ عَنْ رَجُلٍ مِنْ هُذَيْلٍ يُقَالُ لَهُ نُبَيْشَةُ الْخَيْرِ وَكَانَتْ لَهُ صُحْبَةٌ قَالَتْدَخَلَ عَلَيْنَا نُبَيْشَةُ وَنَحْنُ نَأْكُلُ فِي قَصْعَةٍ فَقَالَ لَنَا حَدَّثَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ مَنْ أَكَلَ فِي قَصْعَةٍ ثُمَّ لَحَسَهَا اسْتَغْفَرَتْ لَهُ الْقَصْعَةُحَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا رَوْحُ بْنُ عَبْدِ المُؤْمِنِ وَعُبَيْدُ اللَّهِ الْقَوَارِيرِيُّ حَدَّثَنَا عَبْد اللَّهِ قَالَ وَحَدَّثَنِي مُحَمَّدُ بْنُ صُدْرَانَ قَالُوا ثَنَا الْمُعَلَّى بْنُ رَاشِدٍ قَالَ أَحَدُ الْمُحَدِّثِينَ فِيهِ أَبُو الْيَمَانِ النَبَّالُ قَالَ حَدَّثَتْنِي جَدَّتِي أُمُّ عَاصِمٍ عَنْ نُبَيْشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِهِ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Al Mu'alla bin Rasyid Al Hudzali] ia berkata; telah menceritakan kepadaku nenekku yaitu [Ummu 'Ashim] dari seorang laki-laki dari bani Hudzail yang disebut [Nubaisyah Al Khair] -dia termasuk dari sahabat Nabi shallallahu 'alaihi wasallam- dia berkata; Nubaisyah pernah menemuiku ketika kami tengah makan dengan nampan, lalu ia berkata kepada kami; Nabi Shalallahu 'Alaihi Wasallam telah menceritakan kepada kami bahwa: \"Barangsiapa makan dengan nampan, lalu ia menjilatinya, maka nampan tersebut akan memohon ampunan untuknya.\" Telah menceritakan kepada kami Abdullah, telah menceritakan kepada kami [Rauh bin Abdul Mukmin] dan [ubaidhullah Al Qawariri] telah menceritakan kepada kami Abdullah dia berkata; telah menceritakan kepadaku [Muhammad bin Shudran], mereka berkata; telah menceritakan kepada kami [Al Mu'alla bin Rasyid], telah berkata salah seorang ahli hadits diantaranya adalah Abul Yaman An Nabal, ia berkata; telah menceritakan kepadaku nenekku yaitu [Ummu 'Ashim] dari [Nubaisyah] dari Nabi Shalallahu 'Alaihi Wasallam seperti itu."
            },
            {
                "number": 2802,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ قَالَ ابْنُ عَوْنٍ حَدَّثَنَا عَنْ جَمِيلٍ عَنْ أَبِي مَلِيحٍ عَنْ نُبَيْشَةَ قَالَذُكِرَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُنَّا نَعْتِرُ فِي الْجَاهِلِيَّةِ قَالَ اذْبَحُوا لِلَّهِ تَبَارَكَ وَتَعَالَى فِي أَيِّ شَهْرٍ مَا كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Adi], [Ibnu 'Aun] berkata; telah menceritakan kepada kami [Jamil] dari [Abul Malih] dari [Nusyaibah] berkata; ia menyebutkan kepada Nabi Shalallahu 'Alaihi Wasallam; Dahulu kami biasa menyembelih hewan kurban pada bulan rajab di zaman jahiliyah, lalu beliau bersabda: \"Sembelihlah sembelihan karena Allah Tabaraka wa Ta'ala di bulan manapun, berbuat baiklah kepada Allah dan berilah makan (dari daging sembelihan tersebut)!.\""
            },
            {
                "number": 2803,
                "arab": "حَدَّثَنَا هُشَيْمٌ حَدَّثَنَا خَالِدٌ عَنْ أَبِي مَلِيحٍ عَنْ نُبَيْشَةَ الْهُذَلِيِّ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ إِنَّا كُنَّا نَعْتِرُ عَتِيرَةً لَنَا فِي الْجَاهِلِيَّةِ فَمَا تَأْمُرُنَا قَالَ قَالَ اذْبَحُوا فِي أَيِّ شَهْرٍ مَا كَانَ وَبَرُّوا اللَّهَ تَبَارَكَ وَتَعَالَى وَأَطْعِمُوا قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نُفَرِّعُ فَرَعًا فِي الْجَاهِلِيَّةِ فَمَا تَأْمُرُنَا قَالَ فِي كُلِّ سَائِمَةٍ فَرَعٌ تَغْذُوهُ مَاشِيَتُكَ فَإِذَا اسْتَحْمَلَ ذَبَحْتَهُ وَتَصَدَّقْتَ بِلَحْمِهِ قَالَ أَحْسَبُهُ قَالَ عَلَى ابْنِ السَّبِيلِ فَإِنَّ ذَلِكَ خَيْرٌ",
                "id": "Telah menceritakan kepada kami [Husyaim], telah menceritakan kepada kami [Khalid] dari [Abu Malih] dari [Nubaisyah Al Hudzali] ia berkata; Aku bertanya kepada Rasulullah Shallalahu 'Alaihi Wasallam; \"Sesunguhnya kami dulu biasa menyembelih hewan sembelihan (di bulan Rajab) pada zaman jahiliyah, lantas apa yang engkau perintahkan pada kami?.\" beliau bersabda: \"Sembelihlah sembelihan di bulan manapun, berbuat baiklah kepada Allah Tabaraka Wata'ala dan bagi-bagikanlah makanan (sembelihan) tersebut!.\" Mereka bertanya lagi; \"Wahai Rasulullah, kamipun biasa menyembelih domba (untuk Tuhan-tuhan) di zaman jahiliyah, bagaimana pendapatmu?.\" Beliau bersabda: \"Di setiap sa`imah dari far' yang kalian gembalakan, dan ketika sudah cukup umur untuk di sembelih, maka sedekahkanlah dagingnya kepada orang-orang yang dalam perjalanan.\" Aku menyangka beliau bersabda: \"Pada ibnu sabil (orang-orang yang mengadakan perjalanan), karena hal itu lebih baik.\" "
            },
            {
                "number": 2804,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا خَالِدٌ عَنْ أَبِي مَلِيحِ بْنِ أُسَامَةَ عَنْ نُبَيْشَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّا كُنَّا نَهَيْنَاكُمْ أَنْ تَأْكُلُوا لُحُومَهَا فَوْقَ ثَلَاثٍ كَيْ يَسَعَكُمْ فَقَدْ جَاءَ اللَّهُ تَبَارَكَ وَتَعَالَى بِالسَّعَةِ فَكُلُوا وَادَّخِرُوا وَاتَّجِرُوا أَلَا وَإِنَّ هَذِهِ الْأَيَّامَ أَيَّامُ أَكْلٍ وَشُرْبٍ وَذِكْرِ اللَّهِ تَبَارَكَ وَتَعَالَى",
                "id": "Telah menceritakan kepada kami [Isma'il], telah menceritakan kepada kami [Khalid] dari [Abu Malih bin Usamah] dari [Nubaisyah] ia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"sesungguhnya kami telah melarang kalian memakan daging kurban lebih dari tiga hari, agar kalian menjadi lapang, dan sungguh Allah Tabaraka wa Ta'ala telah datang dengan kelapangan, maka makanlah, dan simpanlah serta bersedekahlah untuk memperoleh pahala darinya. Ketahuilah hari ini adalah hari makan, minum dan berzikir kepada Allah Tabaraka Wata'ala.\""
            },
            {
                "number": 2805,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي الْمَلِيحِ قَالَ خَالِدٌ وَأَحْسَبُنِي قَدْ سَمِعْتُهُ عَنْ أَبِي الْمَلِيحِ عَنْ نُبَيْشَةَ رَجُلٍ مِنْ هُذَيْلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّهُ قَالَ إِنِّي كُنْتُ نَهَيْتُكُمْ عَنْ لُحُومِ الْأَضَاحِيِّ فَوْقَ ثَلَاثٍ كَيْمَا تَسَعَكُمْ فَقَدْ جَاءَ اللَّهُ تَعَالَى بِالْخَيْرِ فَكُلُوا وَادَّخِرُوا وَاتَّجِرُوا وَإِنَّ هَذِهِ الْأَيَّامَ أَيَّامُ أَكْلٍ وَشُرْبٍ وَذِكْرٍ لِلَّهِ تَعَالَى فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نَعْتِرُ عَتِيرَةً فِي الْجَاهِلِيَّةِ فِي رَجَبٍ فَمَا تَأْمُرُنَا فَقَالَ اذْبَحُوا لِلَّهِ تَبَارَكَ وَتَعَالَى فِي أَيِّ شَهْرٍ مَا كَانَ وَبَرُّوا اللَّهَ عَزَّ وَجَلَّ وَأَطْعِمُوا فَقَالَ رَجُلٌ آخَرُ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا نُفَرِّعُ فَرَعًا فِي الْجَاهِلِيَّةِ فَمَا تَأْمُرُنَا قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي كُلِّ سَائِمَةٍ مِنْ الْغَنَمِ فَرَعٌ تَغْذُوهُ غَنَمُكَ حَتَّى إِذَا اسْتَحْمَلَ ذَبَحْتَهُ فَتَصَدَّقْتَ بِلَحْمِهِ عَلَى ابْنِ السَّبِيلِ فَإِنَّ ذَلِكَ هُوَ خَيْرٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah] dari [Khalid] dari [Abu Qilabah] dari [Abu Malih bin Usamah] dari [Nubaisyah] -seorang laki-laki dari penduduk Hudzail dan termasuk dari sahbat Nabi shallallahu 'alaihi wasallam-, bahwa beliau (Nabi) bersabda; \"Hanyasanya aku melarang kalian memakan daging kurban lebih dari tiga hari hingga kalian merasa lapang, dan (sekarang) Allah Ta'ala telah mendatangkan kebaikan. Oleh Karena itu, makanlah, dan simpanlah serta bersedekahlah untuk memperoleh pahala darinya, karena hari ini adalah hari makan, minum dan berzikir kepada Allah Ta'ala.\" Lalu seseorang bertanya; \"Wahai Rasulullah, kami biasa menyembelih hewan sembelihan (di bulan Rajab) pada zaman jahiliyah, lantas apa yang engkau perintahkan (sekarang) kepada kami?.\" beliau bersabda: \"Sembelihlah karena Allah Tabrakan wa Ta'ala di bulan manapun, berbuat baiklah kepada Allah Azza wa Jalla dan bagi-bagikanlah daging sembelihannya!.\" Mereka bertanya lagi; \"Wahai Rasulullah, kamipun biasa menyembelih domba (untuk Tuhan-tuhan) di zaman jahiliyah, bagaimana pendapatmu?.\" Maka Raasulullah shallallahu 'alaihi wasallam bersabda: \"Di setiap sa`imah dari far' yang kalian gembalakan, dan ketika sudah cukup umur untuk di sembelih, maka sedekahkanlah dagingnya kepada orang-orang yang dalam perjalanan, karena hal itu lebih baik.\" "
            },
            {
                "number": 2806,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَبْدُ الْكَرِيمِ عَنْ حَبِيبِ بْنِ مِخْنَفٍ قَالَانْتَهَيْتُ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ عَرَفَةَ قَالَ وَهُوَ يَقُولُ هَلْ تَعْرِفُونَهَا قَالَ فَمَا أَدْرِي مَا رَجَعُوا عَلَيْهِ قَالَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى كُلِّ بَيْتٍ أَنْ يَذْبَحُوا شَاةً فِي كُلِّ رَجَبٍ وَكُلِّ أَضْحَى شَاةً",
                "id": "Telah menceritakan kepada kami [Abdurrazaq], telah menceritakan kepada kami [Ibnu Juraij], telah mengabarkan kepadaku [Abdul Karim] dari [Habib bin Mikhnaf] IA berkata; Aku menemui Nabi Shalallahu 'Alaihi Wasallam di hari Arafah, lalu beliau bertanya; \"Tahukah kalian?.\" Dia berkata; 'Aku tidak mengerti apa yang mereka kembalikan.\" Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Hendaklah setiap rumah menyembelih seekor kambing di setiap bulan Rajab dan hari Adha (Dzulhijjah) seekor kambing juga.\""
            },
            {
                "number": 2807,
                "arab": "حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٌٍ حَدَّثَنَا ابْنُ عَوْنٍ قَالَ أَنْبَأَنِي أَبُو رَمْلَةَ عَنْ مِخْنَفِ بْنِ سُلَيْمٍ قَالَ رَوْحٌ الْغَامِدِيُّ قَالَوَنَحْنُ وُقُوفٌ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَةَ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ عَلَى أَهْلِ كُلِّ بَيْتٍ فِي كُلِّ عَامٍ أَضْحَاةً وَعَتِيرَةً أَتَدْرُونَ مَا الْعَتِيرَةُ هِيَ الَّتِي يُسَمِّيهَا النَّاسُ الرَّجَبِيَّةُ",
                "id": "Telah menceritakan kepada kami [Mu'adz bin Mu'adz], telah menceritakan kepada kami [Ibnu 'Aun], ia berkata; telah memberitakan kepadaku [Abu Ramlah] dari [Mikhnaf bin Sulaim], [Rauh Al Ghamidi] berkata; \"Kami sedang wukuf bersama Nabi Shalallahu 'Alaihi Wasallam di Arafah, lalu beliau bersabda: \"Wahai manusia, hendaklah setiap penghuni rumah di tiap tahunnya berkurban dengan satu kurban dan 'atirah, tahukah kalian apa itu 'atirah? Yaitu yang biasa di sebut orang-orang dengan rajabiyah.\" "
            },
            {
                "number": 2808,
                "arab": "حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ قَالَ حَدَّثَنِي عَزْرَةُ الْأَنْصَارِيُّ حَدَّثَنَا عِلْبَاءُ بْنُ أَحْمَرَ حَدَّثَنَا أَبُو زَيْدٍ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اقْتَرِبْ مِنِّي فَاقْتَرَبْتُ مِنْهُ فَقَالَ أَدْخِلْ يَدَكَ فَامْسَحْ ظَهْرِي قَالَ فَأَدْخَلْتُ يَدِي فِي قَمِيصِهِ فَمَسَحْتُ ظَهْرَهُ فَوَقَعَ خَاتَمُ النُّبُوَّةِ بَيْنَ إِصْبَعَيَّ قَالَ فَسُئِلَ عَنْ خَاتَمِ النُّبُوَّةِ فَقَالَ شَعَرَاتٌ بَيْنَ كَتِفَيْهِ",
                "id": "Telah menceritakan kepada kami [Harami bin Umarah] ia berkata; telah menceritakan padaku ['Azrah Al Anshari], telah menceritakan kepada kami ['Ilba' bin Ahmar] telah menceritakan kepada kami [Abu Zaid], ia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda kepadaku: \"Mendekatlah padaku!.\" Akupun mendekat ke beliau, beliau bersabda: \"Masukkanlah tanganmu dan usaplah punggungku!.\" Akupun memasukkan tanganku ke gamis beliau, aku mengusap punggung beliau hingga jari-jemariku menyentuh tanda kenabian, \" 'Ilba` berkata; kemudian Abu Zaid di tanya mengenai tanda kenabian tersebut, ia menjawab; \"Yaitu rambut-rambut halus yang Itumbuh) diantara dua pundak beliau.\""
            },
            {
                "number": 2809,
                "arab": "حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ الْأَنْصَارِيُّ حَدَّثَنَا عِلْبَاءُ بْنُ أَحْمَرَ حَدَّثَنَا أَبُو زَيْدٍ الْأَنْصَارِيُّ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ادْنُ مِنِّي قَالَ فَمَسَحَ بِيَدِهِ عَلَى رَأْسِهِ وَلِحْيَتِهِ قَالَ ثُمَّ قَالَ اللَّهُمَّ جَمِّلْهُ وَأَدِمْ جَمَالَهُقَالَ فَلَقَدْ بَلَغَ بِضْعًا وَمِائَةَ سَنَةٍ وَمَا فِي رَأْسِهِ وَلِحْيَتِهِ بَيَاضٌ إِلَّا نَبْذٌ يَسِيرٌ وَلَقَدْ كَانَ مُنْبَسِطَ الْوَجْهِ وَلَمْ يَنْقَبِضْ وَجْهُهُ حَتَّى مَاتَ",
                "id": "Telah menceritakan kepada kami [Harami bin Umarah] ia berkata; telah menceritakan kepadaku ['Azrah bin Tsabit Al Anshari], telah menceritakan kepada kami ['Ilba` bin Ahmar] telah menceritakan kepada kami [Abu Zaid Al Anshari], ia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda kepadaku: \"Mendekatlah padaku!.\" Lalu beliau mengusap rambut kepalanya dan jenggotnya dengan tangan beliau, Abu Zaid berkata; kemudian beliau berdo'a: \"Ya Allah, indahkanlah dan kekalkan keindahannya.\" Perawi berkata; \"Sungguh umurnya (Abu Zaid) Telah mencapai seratus tahun lebih, namun tiada warna putih di rambut dan jenggotnya kecuali sedikit, ia adalah sosok yang bermuka ceria, dan wajahnya tidak berubah hingga ia meninggal.\""
            },
            {
                "number": 2810,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا عَبْدُ الْوَارِثِ حَدَّثَنَا خَالِدٌ عَنْ أَبِي قِلَابَةَ عَنْ عَمْرِو بْنِ بُجْدَانَ عَنْ أَبِي زَيْدٍ الْأَنْصَارِيِّ قَالَمَرَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ أَظْهُرِ دِيَارِنَا فَوَجَدَ قُتَارًا فَقَالَ مَنْ هَذَا الَّذِي ذَبَحَ قَالَ فَخَرَجَ إِلَيْهِ رَجُلٌ مِنَّا فَقَالَ يَا رَسُولَ اللَّهِ كَانَ هَذَا يَوْمٌ الطَّعَامُ فِيهِ كَرِيهٌ فَذَبَحْتُ لِآكُلَ وَأُطْعِمَ جِيرَانِي قَالَ فَأَعِدْ قَالَ لَا وَالَّذِي لَا إِلَهَ إِلَّا هُوَ مَا عِنْدِي إِلَّا جَذَعٌ مِنْ الضَّأْنِ أَوْ حَمَلٌ قَالَهَا ثَلَاثَ مِرَارٍ قَالَ فَاذْبَحْهَا وَلَا تُجْزِئُ عَنْ أَحَدٍ بَعْدَكَ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Abdul Warits], telah menceritakan kepada kami [Khalid] dari [Abu Qilabah] dari ['Amru bin Bujdan] dari [Abu Zaid Al Anshari] dia berkata; \"Rasulullah Shallalahu 'Alaihi Wasallam pernah melewati belakang rumah-rumah kami dan mencium bau masakan, maka beliau bertanya: \"Siapa yang telah menyembelih (hewan kurban)?.\" maka salah seorang lelaki dari kami keluar dan berkata; \"Wahai Rasulullah, hari ini adalah hari makan-makan, maka aku menyembelih untuk aku makan dan aku berikan kepada tetanggaku.\" beliau bersabda: \"Ulangilah (kurbanmu).\" dia menjawab; \"Tidak, demi Dzat yang tidak ada Ilah selain Dia, aku tidak punya lagi selain Jadza'ah, atau kambing yang tengah hamil.\" dia mengatakannya hingga tiga kali, beliau lalu bersabda: \"Sembelihlah, dan (ini) tidak berlaku untuk orang lain setelahmu.\" "
            },
            {
                "number": 2811,
                "arab": "حَدَّثَنَا يُونُسُ وَعَفَّانُ قَالَا ثَنَا غَسَّانُ بْنُ بُرْزِينَ حَدَّثَنَا سَيَّارُ بْنُ سَلَامَةَ الرِّيَاحِيُّ عَنِ الْبَرَاءِ السَّلِيطِيِّ عَنْ نُقَادَةَ الْأَسَدِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ بَعَثَ نُقَادَةَ الْأَسَدِيَّ إِلَى رَجُلٍ يَسْتَمْنِحُهُ نَاقَةً لَهُ وَأَنَّ الرَّجُلَ رَدَّهُ فَأَرْسَلَ بِهِ إِلَى رَجُلٍ آخَرَ سِوَاهُ فَبَعَثَ إِلَيْهِ بِنَاقَةٍ فَلَمَّا أَبْصَرَ بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ جَاءَ بِهَا نُقَادَةُ يَقُودُهَا قَالَ اللَّهُمَّ بَارِكْ فِيهَا وَفِيمَنْ أَرْسَلَ بِهَا قَالَ نُقَادَةُ يَا رَسُولَ اللَّهِ وَفِيمَنْ جَاءَ بِهَا قَالَ وَفِيمَنْ جَاءَ بِهَا فَأَمَرَ بِهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحُلِبَتْ فَدَرَّتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ أَكْثِرْ مَالَ فُلَانٍ وَوَلَدَهُ يَعْنِي الْمَانِعَ الْأَوَّلَ اللَّهُمَّ اجْعَلْ رِزْقَ فُلَانٍ يَوْمًا بِيَوْمٍ يَعْنِي صَاحِبَ النَّاقَةِ الَّذِي أَرْسَلَ بِهَا",
                "id": "Telah menceritakan kepada kami [Yunus] dan ['Affan], keduanya berkata; telah menceritakan kepada kami [Ghassan bin Burzin], telah menceritakan kepada kami [Sayyar bin Salamah Ar Riyahi] dari [Al Bara' As Salithi] dari [Nuqadah Al Asadi] bahwa Rasulullah Shallalahu 'Alaihi Wasallam pernah mengutus Nuqadah Al Asadi menemui seorang lelaki yang meminta seekor untanya kepada beliau, dan lelaki tadi menolaknya kemudian diberikan kepada orang lain selain dia, kemudian dia mengirimkan kepadanya seekor unta, maka ketika Rasulullah Shallalahu 'Alaihi Wasallam melihat Nuqadah datang dengan membawanya kembali, beliau bersabda: \"Ya Allah berkahilah dalam unta ini dan orang yang mengirimkannya.\" Nuqadah berkata; \"Wahai Rasulullah, dan juga orang yang datang membawanya?.\" Beliau menjawab: \"Dan juga orang yang datang membawanya, \" Kemudian Rasulullah Shallalahu 'Alaihi Wasallam memerintahkan agar unta diperah dan ketika diperah susunya mengeluarkan banyak, maka Rasulullah Shallalahu 'Alaihi Wasallam berdo'a: \"Ya Allah perbanyaklah harta fulan dan anaknya.\" (yaitu orang yang pertama kali menolak), \"Ya Allah jadikanlah rizqi Fulan terus menerus setiap hari, \" yaitu pemilik unta yang mengirimkannya."
            },
            {
                "number": 2812,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ بُدَيْلٍ الْعُقَيْلِيِّ قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ شَقِيقٍ أَنَّهُ أَخْبَرَهُ مَنْسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِوَادِي الْقُرَى وَهُوَ عَلَى فَرَسِهِ وَسَأَلَهُ رَجُلٌ مِنْ بُلْقِينٍ فَقَالَ يَا رَسُولَ اللَّهِ مَنْ هَؤُلَاءِ قَالَ هَؤُلَاءِ الْمَغْضُوبُ عَلَيْهِمْ فَأَشَارَ إِلَى الْيَهُودِ فَقَالَ مَنْ هَؤُلَاءِ قَالَ هَؤُلَاءِ الضَّالُّونَ يَعْنِي النَّصَارَى قَالَ وَجَاءَهُ رَجُلٌ فَقَالَ اسْتُشْهِدَ مَوْلَاكَ أَوْ قَالَ غُلَامُكَ فُلَانٌ قَالَ بَلْ هُوَ يُجَرُّ إِلَى النَّارِ فِي عَبَاءَةٍ غَلَّهَا",
                "id": "Telah menceritakan kepada kami [Abdurrazaq], telah mengabarkan pada kami [Ma'mar] dari [Budail Al 'Uqaili], ia berkata; telah mengabarkan kepadaku [Abdullah bin Syaqiq] bahwa [seseorang] yang mendengar Nabi Shallalahu 'Alaihi Wasallam pernah mengabarkan kepadanya, ketika beliau berada di Wadil Qura' tengah mengendarai kudanya, lalu salah seorang lelaki dari Bulqin bertanya kepadanya; \"Wahai Rasulullah siapakah mereka?.\" Beliau menjawab: \"Mereka adalah orang-orang yang mendapat laknat.\" -Sambil menunjuk ke arah orang-orang Yahudi- kemudian laki-laki itu bertanya lagi; \"Siapakah mereka?.\" Beliau menjawab: \"Mereka adalah orang-orang yang sesat yaitu Nasrani.\" Abdullah bin Syaqiq berkata; \"Lalu seorang lelaki datang kepada laki-laki dari Bulqin seraya berkata; \"Bekas budakmu si fulan telah syahid, \" atau dia mengatakan; \"Budakmu si fulan.\" Beliau menimpali: \"Bahkan dia di seret ke dalam api neraka karena mantel yang ia ambil.\""
            }
        ]
    }
}