{
    "status": true,
    "data": {
        "start": 2369,
        "end": 2516,
        "total": 148,
        "book": "ahmad",
        "hadits": [
            {
                "number": 2369,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنِ الزُّهْرِيِّ قَالَ وَكَانَ عَبْدُ الرَّحْمَنِ بْنُ أَزْهَرَ يُحَدِّثُعَنْ خَالِدِ بْنِ الْوَلِيدِ بْنِ الْمُغِيرَةِ خَرَجَ يَوْمَئِذٍ وَكَانَ عَلَى الْخَيْلِ خَيْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ابْنُ أَزْهَرَ فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَمَا هَزَمَ اللَّهُ الْكُفَّارَ وَرَجَعَ الْمُسْلِمُونَ إِلَى رِحَالِهِمْ يَمْشِي فِي الْمُسْلِمِينَ وَيَقُولُ مَنْ يَدُلُّ عَلَى رَحْلِ خَالِدِ بْنِ الْوَلِيدِ قَالَ فَمَشَيْتُ أَوْ فَسَعَيْتُ بَيْنَ يَدَيْهِ وَأَنَا مُحْتَلِمٌ أَقُولُ مَنْ يَدُلُّ عَلَى رَحْلِ خَالِدِ بْنِ الْوَلِيدِ حَتَّى تَخَلَّلْنَا عَلَى رَحْلِهِ فَإِذَا خَالِدٌ مُسْتَنِدٌ إِلَى مُؤْخِرَةِ رَحْلِهِ فَأَتَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَظَرَ إِلَى جُرْحِهِ قَالَ الزُّهْرِيُّ وَحَسِبْتُ أَنَّهُ قَالَ وَنَفَثَ فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Az Zuhri] ia berkata, bahwa [Abdurrahman bin Azhar] menceritakan dari Khalid bin Al Warid bin Al Mughirah bahwa suatu ia keluar dan saat itu, ia berada di atas kuda, yakni kuda milik Rasulullah shallallahu 'alaihi wasallam. Ibnu Azhar berkata; Kemudian saya melihat Rasulullah shallallahu 'alaihi wasallam setelah Allah menghancurkan kaum kuffar dan kaum muslimin pun telah kembali ke rumah-rumah mereka, beliau berjalan di tengah-tengah kaum muslimin seraya bertanya: \"Siapa yang dapat menunjukkan kediaman Khalid bin Al Walid?\" Maka saya pun berjalan dan berjalan agak cepat di depannya -saat itu, saya sudah muhtalim (aqil balig) - seraya berkata, \"Siapa yang dapat menunjukkan kediaman Khalid bin Al Walid?\" hingga kami pun sampai di kediamannya, sementara Khalid sedang bersandar di belakang rumahnya. Maka Rasulullah shallallahu 'alaihi wasallam pun mendatanginya dan melihat lukanya. Az Zuhri berkata; Dan saya menduga bahwa ia mengatakan; \"Dan Rasulullah shallallahu 'alaihi wasallam meniup ke dalam (lukanya).\""
            },
            {
                "number": 2370,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ وَحَدَّثَ ابْنُ شِهَابٍ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ أَزْهَرَ كَانَ يُحَدِّثُأَنَّهُ حَضَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ كَانَ يَحْثِي فِي وُجُوهِهِمْ التُّرَابَقَالَ أَبِي وَهَذَا يَتْلُو حَدِيثَ الزُّهْرِيِّ عَنْ قَبِيصَةَ فِي شَارِبِ الْخَمْرِ",
                "id": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim] Telah menceritakan kepada kami [bapakku] dari [Shalih] Dan -dalam riwayat lain- Telah menceritakan kepada kami [Ibnu Syihab] bahwa [Abdurrahman bin Azhar] menceritakan bahwasanya; \"Ia pernah menghadiri Rasulullah shallallahu 'alaihi wasallam, saat beliau menaburkan pasir pada wajah-wajah mereka.\" Bapakku berkata; Dan orang ini telah membaca hadits Zuhri dari Qabishah mengenai minum khamer."
            },
            {
                "number": 2371,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَوَكِيعٌ قَالَا ثَنَا إِسْمَاعِيلُ قَالَ حَدَّثَنِي قَيْسٌ عَنِ الصُّنَابِحِيِّ الْأَحْمَسِيِّ قَالَ وَكِيعٌ فِي حَدِيثِهِ الصُّنَابِحِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا فَرَطُكُمْ عَلَى الْحَوْضِ وَإِنِّي مُكَاثِرٌ بِكُمْ الْأُمَمَ فَلَا تَقْتَتِلُنَّ بَعْدِي",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dan [Waki'] keduanya berkata, Telah menceritakan kepada kami [Isma'il] ia berkata, telah menceritakan kepadaku [Qais] dari [Ash Shunabihi Al Ahmasi] -Waki' berkata dalam haditsnya- Ash Shunabihi, ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sayalah yang akan mendahului kalian untuk memasuki Haudl (telaga), dan saya adalah Nabi yang membanggakan banyaknya jumlah kalian. maka janganlah kalian saling berbunuh-bunuhan setelahku.\""
            },
            {
                "number": 2372,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ قَالَ سَمِعْتُ قَيْسَ بْنَ أَبِي حَازِمٍ قَالَ سَمِعْتُ الصُّنَابِحِيَّ الْبَجَلِيَّ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَنَا فَرَطُكُمْ عَلَى الْحَوْضِ وَمُكَاثِرٌ بِكُمْ الْأُمَمَ قَالَ شُعْبَةُ أَوْ قَالَ النَّاسَ فَلَا تَقْتَتِلُنَّ بَعْدِيحَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ إِسْمَاعِيلَ عَنْ قَيْسٍ عَنِ الصُّنَابِحِيِّ الْأَحْمَسِيِّ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Isma'il bin Abu Khalid] ia berkata, saya mendengar [Qais bin Abu Hazim] ia berkata, saya mendengar [Ash Shunabihi Al Bajali] ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akulah yang akan mendahului dan menjemput kalian di Telaga, dan saya berbangga dengan banyaknya jumlah kalian terhadap umat yang lain.\" Syu'bah berkata; Atau beliau mengatakan, \"(Terhadap) manusia yang lain. Karena itu, janganlah kalian saling berbunuhan sepeninggalku.\" Telah menceritakan kepada kami [Ibnu Numair] dari [Isma'il] dari [Qais] dari [Ash Shunabihi Al Ahmasi] semisalnya."
            },
            {
                "number": 2373,
                "arab": "حَدَّثَنَا عَبَّادُ بْنُ عَبَّادِ بْنِ حَبِيبِ بْنِ الْمُهَلَّبِ بْنِ أَبِي صُفْرَةَ الْمُهَلَّبِيِّ أَبُو مُعَاوِيَةَ عَنْ مُجَالِدِ بْنِ سَعِيدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنِ الصُّنَابِحِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي مُكَاثِرٌ بِكُمْ الْأُمَمَ فَلَا تَرْجِعُنَّ بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍحَدَّثَنَا يُونُسُ عَنْ حَمَّادِ بْنِ زَيْدٍ عَنِ الصُّنَابِحِيِّ وَرُبَّمَا قَالَ الصُّنَابِحِ",
                "id": "Telah menceritakan kepada kami [Abbad bin Abbad bin Habib bin Al Muhallab bin Shufrah Al Muhallabi Abu Mu'awiyah] dari [Mujalid bin Sa'id] dari [Qais bin Abu Hazim] dari [Ash Shunabihi] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya berbangga dengan banyaknya jumlah kalian terhadap umat-umat yang lain. Karena itu, janganlah sekali-kali kalian kembali kepada kekafiran sepeninggalku, yaitu sebagian kalian menebas leher sebagian yang lain.\" Telah menceritakan kepada kami [Yunus] dari [Hammad bin Zaid] dari [Ash Shunabihi] dan terkadang ia mengatakan, Ash Shunabih."
            },
            {
                "number": 2374,
                "arab": "قَالَ قُرِئَ عَلَى سُفْيَانَ وَأَنَا شَاهِدٌ سَمِعْتُ مَعْمَرًا يُحَدِّثُ عَنِ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَزْهَرَ قَالَجُرِحَ خَالِدُ بْنُ الْوَلِيدِ فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْأَلُ عَنْ رَحْلِهِ قُلْتُ وَأَنَا غُلَامٌ مَنْ يَدُلُّ عَلَى رَحْلِ خَالِدٍ فَأَتَاهُ وَهُوَ مَجْرُوحٌ فَجَلَسَ عِنْدَهُ",
                "id": "(Imam Ahmad) Berkata; Telah dibacakan kepada [Sufyan] sementara saya menyaksikannya, saya mendengar [Ma'mar] menceritakan dari [Zuhri] dari [Abdurrahman bin Azhar] ia berkata; Khalid bin Walid terluka dan saya melihat Rasulullah shallallahu 'alaihi wasallam menanyakan kediamannya. Saya berkata - dan saat itu saya adalah seorang anak muda--, \"Siapa yang bisa menunjukkan tempat kediaman Khalid?\" kemudian beliau pun mendatanginya, sedangkan Khalid bin Walid dalam keadaan terluka, maka beliau pun duduk di sisinya."
            },
            {
                "number": 2375,
                "arab": "حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى أَخْبَرَنَا أُسَامَةُ بْنُ زَيْدٍ عَنِ الزُّهْرِيِّ قَالَ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ أَزْهَرَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ حُنَيْنٍ وَهُوَ يَتَخَلَّلُ النَّاسَ يَسْأَلُ عَنْ رَحْلِ خَالِدِ بْنِ الْوَلِيدِ فَأُتِيَ بِسَكْرَانَ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ عِنْدَهُ أَنْ يَضْرِبُوهُ بِمَا كَانَ فِي أَيْدِيهِمْ وَحَثَا عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ التُّرَابَحَدَّثَنَا رَوْحٌ حَدَّثَنَا أُسَامَةُ بْنُ زَيْدٍ حَدَّثَنَا الزُّهْرِيُّ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ أَزْهَرَ الزُّهْرِيُّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَخَلَّلُ النَّاسَ يَسْأَلُ عَنْ مَنْزِلِ خَالِدِ بْنِ الْوَلِيدِ فَذَكَرَهُ حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنِي أَبِي عَنِ ابْنِ إِسْحَاقَ وَثَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ الْمُبَارَكِ أَخْبَرَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنِ الصُّنَابِحِيِّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فَذَكَرَهُ قَالَ يَزِيدُ بْنُ هَارُونَ الصُّنَابِحِيُّ رَجُلٌ مِنْ بَجِيلَةَ مِنْ أَحْمَسَ",
                "id": "Telah menceritakan kepada kami [Shafwan bin 'Isa] Telah mengabarkan kepada kami [Usamah bin Zaid] dari [Az Zuhri] mengatakan, Telah mengabarkan kepada kami [Abdurrahman bin Azhar] mengatakan, Pernah kulihat Rasulullah Shallallahu'alaihiwasallam pada perang Hunain menerobos kerumunan para sahabat, rupanya beliau bertanya kemah Khalid bin alwalid. Lantas seorang pemabuk dikeler. Kemudian Rasulullah Shallallahu'alaihiwasallam menyuruh siapa saja yang disisinya untuk memukulinya dengan benda apa saja yang mereka punyai, dan beliau menaburinya dengan tanah. Telah menceritakan kepada kami [Rauh] Telah menceritakan kepada kami [Usamah bin Zaid] Telah menceritakan kepada kami [Az Zuhri] telah menceritakan kepadaku [Abdurrahman bin Azhar Azzuhri] mengatakan, pernah aku melihat Rasulullah shallallahu 'alaihi wasallam menerobos kerumunan para shabaat bertanya persinggahan Khalid bin alwalid, lantas ia mengishakan. Telah menceritakan kepada kami Ya'qub mengatakan, telah menceritakan kepadaku Ayahku dari Ibn Ishaq, dan Telah menceritakan kepada kami Abdullah, maksudnya Ibnul Mubarak Telah mengabarkan kepada kami Ismail bin Abi Khalid dari Qais bin Abi hazim dari Ashshunabihi mengatakan, kudengar Rasulullah shallallahu 'alaihi wasallam bersabda: \" bersabda, lantas ia sebutkan. Sedang Yazid bin harun Assunabihi mengatakan dengan redaksi seorang dari Bajilah dari Ahmas."
            },
            {
                "number": 2376,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أُسَيْدِ بْنِ حُضَيْرٍ رَضِيَ اللَّهُ تَعَالَى عَنْهُ قَالَقَالَ رَجُلٌ مِنْ الْأَنْصَارِ يَا رَسُولَ اللَّهِ أَلَا تَسْتَعْمِلُنِي كَمَا اسْتَعْمَلْتَ فُلَانًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَتَلْقَوْنَ بَعْدِي أَثَرَةً فَاصْبِرُوا حَتَّى تَلْقَوْنِي غَدًا عَلَى الْحَوْضِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] Telah mengabarkan kepada kami [Syu'bah] dari [Qatadah] dari [Anas bin Malik] dari [Usaid bin Hudlair] Radliallahu Ta'ala 'Anhu, ia berkata, seorang laki-laki dari Anshar bertanya, \"Wahai Rasulullah, tidakkah tuan mempekerjakanku, sebagai tuan telah mempekerjakan si Fulan?\" maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sepeninggalku, kalian akan menemui sikap-sikap keegoisan, maka bersabarlah hingga kalian menemuiku kelak di telaga (Al Haudl).\""
            },
            {
                "number": 2377,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ إِسْحَاقَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا يَحْيَى بْنُ أَيُّوبَ عَنْ عُمَارَةَ بْنِ غَزِيَّةَ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنْ أُمِّهِ فَاطِمَةَ ابْنَةِ حُسَيْنٍ عَنْ عَائِشَةَ أَنَّهَا كَانَتْ تَقُولُكَانَ أُسَيْدُ بْنُ حُضَيْرٍ مِنْ أَفَاضِلِ النَّاسِ وَكَانَ يَقُولُ لَوْ أَنِّي أَكُونُ كَمَا أَكُونُ عَلَى أَحْوَالٍ ثَلَاثٍ مِنْ أَحْوَالِي لَكُنْتُ حِينَ أَقْرَأُ الْقُرْآنَ وَحِينَ أَسْمَعُهُ يُقْرَأُ وَإِذَا سَمِعْتُ خُطْبَةَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِذَا شَهِدْتُ جِنَازَةً وَمَا شَهِدْتُ جِنَازَةً قَطُّ فَحَدَّثْتُ نَفْسِي بِسِوَى مَا هُوَ مَفْعُولٌ بِهَا وَمَا هِيَ صَائِرَةٌ إِلَيْهِ",
                "id": "Telah menceritakan kepada kami [Ali bin Ishaq] Telah menceritakan kepada kami [Abdullah bin Mubarak] Telah mengabarkan kepada kami [Yahya bin Ayyub] dari [Umarah bin Ghaziyyah] dari [Muhammad bin Abdullah bin Amr] dari [Ibunya yakni Fathimah binti Husain], dari [Aisyah] bahwa ia berkata, \" [Usaid bin Khudair] adalah diantara sahabat yang hebat. Pernah ia katakan; Seandainya aku menghimpun tiga keadaan sekaligus, aku pun bisa melakukannya. Keadaan ketika aku membaca alquran dan saat aku mendengar alquran itu dibaca, ketika aku mendengar khutbah Rasulullah Shallallahu'alaihiwasallam, dan ketika aku menghadiri jenazah. Tidak pernah aku menghadiri jenazah, lantas kubayangkan hatiku dengan selain bagaimana jenazah itu diperlakukan dan apa yang bakalan ditemuinya."
            },
            {
                "number": 2378,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أُسَيْدِ بْنِ حُضَيْرٍ رَضِيَ اللَّهُ تَعَالَى عَنْهُ قَالَإِنَّ رَجُلًا مِنْ الْأَنْصَارِ تَخَلَّى بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلَا تَسْتَعْمِلُنِي كَمَا اسْتَعْمَلْتَ فُلَانًا قَالَ إِنَّكُمْ سَتَلْقَوْنَ بَعْدِي أَثَرَةً فَاصْبِرُوا حَتَّى تَلْقَوْنِي عَلَى الْحَوْضِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] ia berkata, saya mendengar [Qatadah] menceritakan dari [Anas bin Malik] dari [Usaid bin Hudlair] radliallahu 'anhu, ia berkata; Seorang laki-laki dari Anshar menyendiri bersama Rasulullah shallallahu 'alaihi wasallam, maka ia berkata, \"Tidakkah tuan mempekerjakanku, sebagaimana tuan telah memperkejakan si Fulan?\" beliau bersabda: \"Sesungguhnya akan kalian temui sikap-sikap keegoisan. Karena itu, bersabarlah, hingga kalian menjumpaiku di telaga (Al Haudl).\""
            },
            {
                "number": 2379,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِيهِ عَنْ جَدِّهِ عَلْقَمَةَ عَنْ عَائِشَةَ قَالَتْقَدِمْنَا مِنْ حَجٍّ أَوْ عُمْرَةٍ فَتُلُقِّينَا بِذِي الْحُلَيْفَةِ وَكَانَ غِلْمَانٌ مِنْ الْأَنْصَارِ تَلَقَّوْا أَهْلِيهِمْ فَلَقُوا أُسَيْدَ بْنَ حُضَيْرٍ فَنَعَوْا لَهُ امْرَأَتَهُ فَتَقَنَّعَ وَجَعَلَ يَبْكِي قَالَتْ فَقُلْتُ لَهُ غَفَرَ اللَّهُ لَكَ أَنْتَ صَاحِبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَكَ مِنْ السَّابِقَةِ وَالْقِدَمِ مَا لَكَ تَبْكِي عَلَى امْرَأَةٍ فَكَشَفَ عَنْ رَأْسِهِ وَقَالَ صَدَقْتِ لَعَمْرِي حَقِّي أَنْ لَا أَبْكِي عَلَى أَحَدٍ بَعْدَ سَعْدِ بْنِ مُعَاذٍ وَقَدْ قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا قَالَ قَالَتْ قُلْتُ لَهُ مَا قَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَقَدْ اهْتَزَّ الْعَرْشُ لِوَفَاةِ سَعْدِ بْنِ مُعَاذٍ قَالَتْ وَهُوَ يَسِيرُ بَيْنِي وَبَيْنَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] Telah mengabarkan kepada kami [Muhammad bin Amru] dari [bapaknya] dari [kakeknya, Alqamah], dari [Aisyah] ia berkata; Kami kembali dari perjalanan menunaikan haji atau umrah. Kemudian kami dijemput di Dzul Hulaifah. Dan para pemuda dari kalangan Anshar menemui keluarganya, dan mereka pun menjumpai [Usaid bin Hudlair] dan mengabarkan kematian isterinya. Ia pun menutupi kepalanya dan menangis. Aisyah berkata; Saya berkata padanya, \"Semoga Allah mengampunimu. Anda adalah sahabat Rasulullah shallallahu 'alaihi wasallam, Anda juga termasuk mereka yang pertama kali memeluk Islam, lalu kenapa Anda menangis lantaran seorang wanita?\" ia menyingkap kembali penutup kepalanya dan berkata, \"Anda telah berkata benar. Sesungguhnya, hidupku adalah hakku, saya tidak akan menangisi seorang pun setelah Sa'adz bin Mua'dz, dan Rasulullah shallallahu 'alaihi wasallam telah bersabda tentangnya. Aisyah berkata; Saya bertanya kepadanya, \"Apa yang disabdakan Rasulullah shallallahu 'alaihi wasallam tentangnya?\" beliau bersabda: \"Sunggu, Arsy telah bergoncang karena kewafatan Sa'd bin Mu'adz.\" Aisyah berkata, \"Dan ia berjalan di antara aku dan Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 2380,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ ثَنَا حَمَّادُ بْنُ سَلَمَةَ أَنْبَأَنَا الْحَجَّاجُ بْنُ أَرْطَأَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أُسَيْدِ بْنِ حُضَيْرٍ قَالَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَوَضَّئُوا مِنْ لُحُومِ الْإِبِلِ وَلَا تَوَضَّئُوا مِنْ لُحُومِ الْغَنَمِ وَصَلُّوا فِي مَرَابِضِ الْغَنَمِ وَلَا تُصَلُّوا فِي مَبَارِكِ الْإِبِلِ",
                "id": "Telah menceritakan kepada kami [Affan] ia berkata, Telah menceritakan kepada kami [Hammad bin Salamah] Telah memberitakan kepada kami [Al Hajjaj bin Artha`ah] dari [Abdullah bin Abdullah] dari [Abdurrahman bin Abu Laila] dari [Usaid bin Hudlair] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berwudlulah kalian setelah memakan daging Unta, dan janganlah berwudlu setelah mengomsumsi daging kambing. Dan sholatlah di kandang kambing, akan tetapi janganlah kalian sholat di kandang Unta.\" "
            },
            {
                "number": 2381,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ الْمَرْوَزِيُّ أَخْبَرَنَا عَبَّادُ بْنُ الْعَوَّامِ حَدَّثَنَا الْحَجَّاجُ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ مَوْلَى بَنِي هَاشِمٍ قَالَ وَكَانَ ثِقَةً قَالَ وَكَانَ الْحَكَمُ يَأْخُذُ عَنْهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أُسَيْدِ بْنِ حُضَيْرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ سُئِلَ عَنْ أَلْبَانِ الْإِبِلِ قَالَ تَوَضَّئُوا مِنْ أَلْبَانِهَا وَسُئِلَ عَنْ أَلْبَانِ الْغَنَمِ فَقَالَ لَا تَوَضَّئُوا مِنْ أَلْبَانِهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Muqatil Al Marwazi] Telah mengabarkan kepada kami [Abbad bin Awwam] Telah menceritakan kepada kami [Al Hajjaj] dari [Abdullah bin Abdullah] bekas budak Bani Hasyim, ia berkata -dan ia adalah seorang yang Tsiqqah dan Al Hakam juga mengambil hadits darinya-, dari [Abdurrahman bin Abu Laila] dari [Usaid bin Hudlair] dari Nabi shallallahu 'alaihi wasallam, bahwasanya beliau pernah ditanya tentang susu Unta. Maka beliau bersabda: \"Berwudlulah kalian setelah meminum susunya.\" Kemudian beliau ditanya tentang susu kambing, maka beliau menjawab: \"Janganlah kalian berwudlu lagi setelah meminumnya.\""
            },
            {
                "number": 2382,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ سِمَاكٍ عَنْ سُوَيْدِ بْنِ قَيْسٍ قَالَجَلَبْتُ أَنَا وَمَخْرَمَةُ الْعَبْدِيُّ ثِيَابًا مِنْ هَجَرَ قَالَ فَأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَاوَمَنَا فِي سَرَاوِيلَ وَعِنْدَنَا وَزَّانُونَ يَزِنُونَ بِالْأَجْرِ فَقَالَ لِلْوَزَّانِ زِنْ وَأَرْجِحْ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Sufyan] dari [Simak] dari [Suwaid bin Qais] ia berkata; Saya dan Makhramah Al Abdi membawa pakaian dari Hajar, kemudian Rasulullah shallallahu 'alaihi wasallam mendatangi kami, lalu beliau melakukan penawaran celana pada kami. Saat itu, kami memiliki tukang timbang yang menimbang dengan mengambil upah. Maka beliau bersabda kepada seorang penimbang: \"Timbanglah dan berilah kelebihan.\""
            },
            {
                "number": 2383,
                "arab": "حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكٍ عَنْ مَالِكٍ أَبِي صَفْوَانَ بْنِ عَمِيرَةَ قَالَبِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رِجْلَ سَرَاوِيلَ قَبْلَ الْهِجْرَةِ فَأَرْجَحَ لِي",
                "id": "Telah menceritakan kepada kami [Hajjaj] Telah menceritakan kepada kami [Syu'bah] dari [Simak] dari [Malik Abu Safwan bin Amirah] ia berkata; \"Saya pernah menjual celana kepada Rasulullah shallallahu 'alaihi wasallam sebelum hijrah, maka beliau pun melebihkannya.\""
            },
            {
                "number": 2384,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ إِسْمَاعِيلَ يَعْنِي ابْنَ أَبِي خَالِدٍ عَنْ حَكِيمِ بْنِ جَابِرٍ عَنْ أَبِيهِ قَالَدَخَلْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَهُ الدُّبَّاءُ فَقُلْتُ مَا هَذَا قَالَ نُكَثِّرُ بِهِ طَعَامَنَا",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Isma'il] yakni Ibnu Abu Khalid, dari [Hakim bin Jabir] dari [bapaknya] ia berkata; Saya pernah menemui Rasulullah shallallahu 'alaihi wasallam dan saat itu, beliau mempunyai Ad Dubaa` (benaja yang terbuat dari labu). Maka saya pun bertanya, \"Apakah ini?\" beliau menjawab: \"Dengan itu, kami memperbanyak makanan kami.\""
            },
            {
                "number": 2385,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ عَنْ حَكِيمِ بْنِ جَابِرٍ عَنْ أَبِيهِ قَالَدَخَلْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِهِ فَرَأَيْتُ عِنْدَهُ قَرْعًا فَقُلْتُ يَا رَسُولَ اللَّهِ مَا هَذَا قَالَ هَذَا قَرْعٌ نُكَثِّرُ بِهِ طَعَامَنَا",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Isma'il bin Abu Khalid] dari [Hakim bin Jabir] dari [bapaknya] ia berkata; Saya pernah menemui Nabi shallallahu 'alaihi wasallam di dalam rumahnya, lalu saya melihat buah labu berada di sisinya, maka saya pun bertanya, \"Wahai Rasulullah, apakah ini?\" beliau menjawab: \"Buah labu, untuk memperbanyak makanan kami.\""
            },
            {
                "number": 2386,
                "arab": "حَدَّثَنَا يَحْيَى هُوَ ابْنُ سَعِيدٍ حَدَّثَنَا شُعْبَةُ عَنْ فِرَاسٍ عَنْ مُدْرِكِ بْنِ عُمَارَةَ عَنِ ابْنِ أَبِي أَوْفَىعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ وَلَا يَزْنِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ وَلَا يَنْتَهِبُ نُهْبَةً ذَاتَ شَرَفٍ أَوْ سَرَفٍ وَهُوَ مُؤْمِنٌ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] Telah menceritakan kepada kami [Syu'bah] dari [Firas] dari [Mudrik bin Imarah] dari [Ibnu Abu Aufa] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang yang meminum khamar tidak sempurna imannya saat ia meminumnya. Dan seorang pezina tidak sempurna imannya saat ia berzina. Dan seorang yang merampas harta tidak sempurna imannya ketika merampas.\""
            },
            {
                "number": 2387,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ عُبَيْدِ بْنِ الْحَسَنِ الْمُزَنِيِّ قَالَ سَمِعْتُ ابْنَ أَبِي أَوْفَى يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا رَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَاوَاتِ وَمِلْءَ الْأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُحَدَّثَنَا وَكِيعٌ حَدَّثَنَا مِسْعَرٌ حَدَّثَنَا عُبَيْدُ بْنُ حَسَنٍ عَنِ ابْنِ أَبِي أَوْفَى أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ ذَلِكَ وَلَمْ يَقُلْ فِي الصَّلَاةِ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Al A'masy] dari [Ubaid bin Al Hasan Al Mazani] ia berkata, saya mendengar [Ibnu Abu Aufa] berkata; Jika Rasulullah shallallahu 'alaihi wasallam mengangkat kepalanya dari posisi ruku', maka beliau membaca: \"SAMI'ALLAHU LIMAN HAMIDAH, ALLAHUMMA RABBANAA LAKAL HAMDU MIL`AS SAMAAWAATI WA MIL`AL ARDLI, WA MIL`A MAA SYI`TA MIN SYAI`IN BA'DU (Ya Allah, bagi-Mu pujian seluas langit dan bumi, serta bagi-Mu pujian seluas apa yang Engkau kehendaki setelah itu).\" Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Mis'ar] Telah menceritakan kepada kami [Ubaid bin Hasan] dari [Ibnu Abu Aufa] bahwa Nabi shallallahu 'alaihi wasallam mengucapkan bacaan itu, namun beliau tidak membacanya di dalam sholat."
            },
            {
                "number": 2388,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ حَدَّثَنِي الشَّيْبَانِيُّ قَالَ سَمِعْتُ ابْنَ أَبِي أَوْفَى قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَبِيذِ الْجَرِّ الْأَخْضَرِقَالَ قُلْتُ فَالْأَبْيَضُ قَالَ لَا أَدْرِي",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Al A'masy] telah menceritakan kepadaku [Asy Syaiban] ia berkata, me [Ibnu Abu Aufa] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang Nabidz Al Jarr Al Akhdlar (sejenis rendaman anggur yang kemudian disimpan dalam bejana yang terbuat dari tanah liat) yakni yang masih berwana hijau. Asy Syaibani berkata; Saya bertanya, \"Bagaimana dengan Nabidz yang telah berwarna putih?\" Ibnu Abu Aufa menjawab: \"Saya tidak tahu.\""
            },
            {
                "number": 2389,
                "arab": "حَدَّثَنَا وَكِيعٌ وَيَعْلَى هُوَ ابْنُ عُبَيْدٍ قَالَا ثَنَا ابْنُ أَبِي خَالِدٍ وَهُوَ إِسْمَاعِيلُ قَالَ سَمِعْتُ ابْنَ أَبِي أَوْفَى يَقُولُدَعَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْأَحْزَابِ فَقَالَ اللَّهُمَّ مُنْزِلَ الْكِتَابِ سَرِيعَ الْحِسَابِ اهْزِمْ الْأَحْزَابِ اهْزِمْهُمْ وَزَلْزِلْهُمْ",
                "id": "Telah menceritakan kepada kami [Waki'] dan [Ya'la] ia adalah Ibnu Ubaid, keduanya berkata, Telah menceritakan kepada kami [Ibnu Abu Khalid] ia adalah Isma'il, ia berkata, saya mendengar [Ibnu Abu Aufa] berkata; Rasulullah shallallahu 'alaihi wasallam mendo'akan kehancuran atas pasukan Ahzab, maka beliau membaca: \"ALLAHUMMA MUNZILAL KITAAB SARII'AL HISAAB, AHZIMIL AHZAAB, AHZIMHUM, WA ZALZILHUM (Ya Allah, Yang telah menurunkan kitab, yang maha cepat hisab-Nya, hancur-leburkanlah pasukan Ahzab, hancurkan dan goncanglah mereka).\""
            },
            {
                "number": 2390,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا ابْنُ أَبِي خَالِدٍ قَالَ سَمِعْتُ ابْنَ أَبِي أَوْفَى يَقُولُلَوْ كَانَ بَعْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيٌّ مَا مَاتَ ابْنُهُ إِبْرَاهِيمُ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Ibnu Abu Khalid] ia berkata, saya mendengar [Ibnu Abu Aufa] berkata; Sekiranya sepeninggal Nabi shallallahu 'alaihi wasallam akan ada lagi seorang Nabi, niscaya putranya, yaitu Ibrahim tidaklah meninggal."
            },
            {
                "number": 2391,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ يَزِيدَ أَبِي خَالِدٍ الدَّالَانِيِّ عَنْ إِبْرَاهِيمَ السَّكْسَكِيِّ عَنِ ابْنِ أَبِي أَوْفَى قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي لَا أَسْتَطِيعُ أَخْذَ شَيْءٍ مِنْ الْقُرْآنِ فَعَلِّمْنِي مَا يُجْزِئُنِي قَالَ قُلْ سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ قَالَ يَا رَسُولَ اللَّهِ هَذَا لِلَّهِ عَزَّ وَجَلَّ فَمَا لِي قَالَ قُلْ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَعَافِنِي وَاهْدِنِي وَارْزُقْنِي ثُمَّ أَدْبَرَ وَهُوَ مُمْسِكُ كَفَّيْهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا هَذَا فَقَدْ مَلَأَ يَدَيْهِ مِنْ الْخَيْرِقَالَ مِسْعَرٌ فَسَمِعْتُ هَذَا الْحَدِيثَ مِنْ إِبْرَاهِيمَ السَّكْسَكِيِّ عَنِ ابْنِ أَبِي أَوْفَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَثَبَّتَنِي فِيهِ غَيْرِي",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Sufyan] dari [Yazid bin Abu Khalid Ad Dalani] dari [Ibrahim As Saksaki] dari [Ibnu Abu Aufa] ia berkata; Seorang laki-laki mendatangi Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, sesungguhnya saya tidak bisa membaca sedikit pun dari Al Qur`an, karena itu, ajarilah aku sesuatu yang dapat menggantikannya.\" Beliau bersabdas: \"Bacalah, 'SUBHAANALLAH WAL HAMDULILLAH, WA LAA ILAAHA ILLALLAH, WALLAHU AKBAR, WALAA HAULA WALAA QUWWATA ILLAA BILLAH (Maha Suci Allah dan Segala puji bagi Allah, Tidak ada Ilah yang berhak disembah selain Allah, Allah Maha Besar. Tidak ada daya dan upaya kecuali atas izin Allah).'\" Laki-laki itu berkata, \"Wahai Rasulullah, ini semua hanya untuk Allah 'azza wajalla, maka apakah bagiku?\" beliau menjawab: \"Bacalah, 'ALLAHUMMAGHFIR LII, WAR HAMNII, WA 'AAFINI, WAHDINII, WARZUQNII (Ya Allah ampunilah aku, kasihanilah aku, dan maafkanlah aku. Berilah petunjuk dan curahkanlah rizki untukku).'\" Kemudian laki-laki itu berpaling sambil menggenggam kedua telapak tangannya, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Adapun orang ini, maka sungguh, ia telah memenuhi kedua tangannya dengan kebaikan.\" [Mis'ar] bekata; Saya mendengar hadits ini dari [Ibrahim As Saksaki], dari [Ibnu Abu Aufa] dari Nabi shallallahu 'alaihi wasallam."
            },
            {
                "number": 2392,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي يَعْفُورٍ الْعَبْدِيِّ قَالَ سَمِعْتُ ابْنَ أَبِي أَوْفَى قَالَغَزَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَبْعَ غَزَوَاتٍ فَكُنَّا نَأْكُلُ فِيهَا الْجَرَادَ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Sufyan] dari [Abu Ya'fur Al Abdi] ia berkata, saya mendengar [Ibnu Abu Aufa] berkata; Kami pernah berperang bersama Rasulullah shallallahu 'alaihi wasallam sebanyak tujuh kali peperangan. Dan dalam peperangan itu kami sempat makan belalang."
            },
            {
                "number": 2393,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ هُوَ ابْنُ مَهْدِيٍّ حَدَّثَنَا شُعْبَةُ عَنْ شَيْخٍ مِنْ بَجِيلَةَ قَالَ سَمِعْتُ ابْنَ أَبِي أَوْفَى يَقُولُاسْتَأْذَنَ أَبُو بَكْرٍ رَضِيَ اللَّهُ تَعَالَى عَنْهُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَهُ جَارِيَةٌ تَضْرِبُ بِالدُّفِّ ثُمَّ اسْتَأْذَنَ عُمَرُ رَضِيَ اللَّهُ تَعَالَى عَنْهُ فَدَخَلَ ثُمَّ اسْتَأْذَنَ عُثْمَانُ رَضِيَ اللَّهُ تَعَالَى عَنْهُ فَأَمْسَكَتْ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ عُثْمَانَ رَجُلٌ حَيِيٌّ",
                "id": "Telah menceritakan kepada kami [Abdurrahman] ia adalah Ibnu Mahdi Telah menceritakan kepada kami [Syu'bah] dari [seoran Syaikh] dari Bakhilah, ia berkata, saya mendengar [Ibnu Abu Aufa] berkata; Abu Bakar radliallahu 'anhu meminta izin kepada Nabi shallallahu 'alaihi wasallam, sementara di sisi beliau terdapat seorang budak wanita yang sedang memukul rebana. Kemudian Umar radliallahu 'anhum meminta izin, lalu ia pun masuk. Setelah itu, Utsman radliallahu 'anhu juga meminta izin, dan tiba-tiba budak wanita itu berhenti memukul rebana. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Utsman adalah seorang laki-laki yang sangat pemalu.\""
            },
            {
                "number": 2394,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ هُوَ ابْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبُو حَيَّانَ قَالَسَمِعْتُ شَيْخًا بِالْمَدِينَةِ يُحَدِّثُ أَنَّ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى كَتَبَ إِلَى عُبَيْدِ اللَّهِ إِذْ أَرَادَ أَنْ يَغْزُوَ الْحَرُورِيَّةَ فَقُلْتُ لِكَاتِبِهِ وَكَانَ لِي صَدِيقًا انْسَخْهُ لِي فَفَعَلَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ لَا تَمَنَّوْا لِقَاءَ الْعَدُوِّ وَسَلُوا اللَّهَ عَزَّ وَجَلَّ الْعَافِيَةَ فَإِذَا لَقِيتُمُوهُمْ فَاصْبِرُوا وَاعْلَمُوا أَنَّ الْجَنَّةَ تَحْتَ ظِلَالِ السُّيُوفِ قَالَ فَيَنْظُرُ إِذَا زَالَتْ الشَّمْسُ نَهَدَ إِلَى عَدُوِّهِ ثُمَّ قَالَ اللَّهُمَّ مُنْزِلَ الْكِتَابِ وَمُجْرِيَ السَّحَابِ وَهَازِمَ الْأَحْزَابِ اهْزِمْهُمْ وَانْصُرْنَا عَلَيْهِمْ",
                "id": "Telah menceritakan kepada kami [Isma'il] ia adalah Ibnu Ibrahim, Telah menceritakan kepada kami [Ibnu Hayyan] ia berkata, saya mendengar [seorang Syaikh] di Madinah yang menceritakan bahwa [Abdullah bin Abu Aufa] menulis surat kepada ubaidhullah ketika ia akan memerangi Al Haruriyyah. Maka saya pun berkata kepada juru tulisnya -yang ia juga temanku-, \"Tuliskanlah untukku.\" Maka ia pun melakukannya. Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"Janganlah kalian berangan-angan untuk bertemu dengan musuh, dan mohon keselamatanlah kepada Allah. Jika kalian menghadapi mereka, maka bersabarlah. Dan ketahuilah, bahwa surga itu berada di bawah naungan pedang.\" Kemudian Beliau mencermati, jika matahari telah terbenam, maka beliau pun menyongsong untuk melawan musuh. Kemudian beliau membaca: \"ALLAHUMMA MUNZILAL KITAAB, WA MUJRIYAS SAHAAB, WA HAAZIMAL AHZAAB, IHZIMHUM WAN SHURNAA 'ALAIHIM (Ya Allah, Yang telah menurunkan kitab, Yang menggerakkan awan, pemusnah Ahzab, binasakanlah mereka dan menangkanlah kami atas mereka).\""
            },
            {
                "number": 2395,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَبَهْزٌ قَالَا ثَنَا شُعْبَةُ عَنْ عَدِيٍّ قَالَ بَهْزٌ أَخْبَرَنِي عَدِيُّ بْنُ ثَابِتٍ قَالَ ابْنُ جَعْفَرٍ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ وَابْنَ أَبِي أَوْفَى قَالَاأَصَابُوا حُمُرًا يَوْمَ خَيْبَرَ فَنَادَى مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُكْفِئُوا الْقُدُورَ وَقَالَ بَهْزٌ عَنْ عَدِيٍّ عَنِ الْبَرَاءِ وَابْنِ أَبِي أوْفَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] dan [Bahz] keduanya berkata, Telah menceritakan kepada kami [Syu'bah] dari [Adi] -dalam riwayat lain Bahz- berkata, telah mengabarakan kepadaku Adi bin Tsabit -Ibnu Ja'far berkata- saya mendengar [Al Baraa` bin Azib] dan [Ibnu Abu Aufa] keduanya berkata; Pada hari Khaibar, pada sahabat mendapat harta ghanimah berupa Himar (keledai), maka sang Munadi (penyeru) Rasulullah shallallahu 'alaihi wasallam pun menyerukan agar menumpahkan periuk. Bahz berkata; Dari Adi dari Al Baraa` dan Ibnu Abu Aufa."
            },
            {
                "number": 2396,
                "arab": "حَدَّثَنَا عَفَّانُ عَنْ أَبِي عَوَانَةَ حَدَّثَنَا زِيَادُ بْنُ عِلَاقَةَ قَالَسَمِعْتُ جَرِيرَ بْنَ عَبْدِ اللَّهِ قَامَ يَخْطُبُ يَوْمَ تُوُفِّيَ الْمُغِيرَةُ بْنُ شُعْبَةَ فَقَالَ عَلَيْكُمْ بِاتِّقَاءِ اللَّهِ عَزَّ وَجَلَّ وَالْوَقَارِ وَالسَّكِينَةِ حَتَّى يَأْتِيَكُمْ أَمِيرٌ فَإِنَّمَا يَأْتِيكُمْ الْآنَ ثُمَّ قَالَ اشْفَعُوا لِأَمِيرِكُمْ فَإِنَّهُ كَانَ يُحِبُّ الْعَفْوَ وَقَالَ أَمَّا بَعْدُ فَإِنِّي أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ أُبَايِعُكَ عَلَى الْإِسْلَامِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَشْتَرِطُ عَلَى النُّصْحِ لِكُلِّ مُسْلِمٍ فَبَايَعْتُهُ عَلَى هَذَا وَرَبِّ هَذَا الْمَسْجِدِ إِنِّي لَكُمْ لَنَاصِحٌ جَمِيعًا ثُمَّ اسْتَغْفَرَ وَنَزَلَ",
                "id": "Telah menceritakan kepada kami ['Affan] dari [Abu 'Awanah] Telah menceritakan kepada kami [Ziyad bin Ilaqah] ia berkata, saya mendengar [Jarir bin Abdullah] berkhutbah pada hari wafatnya Al Mughirah bin Syu'bah, ia berkata, \"Hendaklah kalian bertaqwa kepada Allah 'azza wajalla, bersikap tenang, bersahaja, sampai pemimpin kalian datang, karena ia akan datang sekarang.\" Kemudian ia berkata lagi, \"Minta maaflah kalian kepada Amir kalian, karena ia menyukai untuk memaafkan.\" Ia berkata lagi, \"Amma Ba'du, sesungguhnya saya pernah mendatangi Rasulullah shallallahu 'alaihi wasallam dan berkata, 'Saya berbai'at kepadamu atas dasar Islam.' Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya memberi syarat 'Untuk berbakti kepada setiap muslim.\" Kemudian saya pun berbai'at kepada beliau atas dasar ini, dan Rabb masjid ini. Sesungguhnya saya adalah seorang pemberi nasehat kepada kalian semua.\" Ia pun meminta ampun kepada Allah dan turun."
            },
            {
                "number": 2397,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادٌ أَخْبَرَنَا عَاصِمُ بْنُ بَهْدَلَةَ عَنْ أَبِي وَائِلٍ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ اشْتَرِطْ عَلَيَّ فَقَالَ تَعْبُدُ اللَّهَ وَلَا تُشْرِكُ بِهِ شَيْئًا وَتُصَلِّي الصَّلَاةَ الْمَكْتُوبَةَ وَتُؤَدِّي الزَّكَاةَ الْمَفْرُوضَةَ وَتَنْصَحُ لِلْمُسْلِمِ وَتَبْرَأُ مِنْ الْكَافِرِ",
                "id": "Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Hammad] telah mengabarkan kepada kami [Ashim bin Bahdalah] dari [Abu Wa`il] dari [Jarir bin Abdullah Al Bajali] ia berkata, saya berkata, \"Wahai Rasulullah, tetapkanlah syarat atasku.\" Maka beliau bersabda: \"Kamu beribadah kepada Allah, janganlah kamu menyekutukan-Nya dengan sesuatu apa pun, hendaklah kamu menunaikan sholat wajib, membayar zakat wajib, dan selalu berbakti kepada setiap muslim serta berlepas diri dari orang kafir.\""
            },
            {
                "number": 2398,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ حَبِيبٍ عَنِ الْمُغِيرَةِ بْنِ شُبَيْلٍ أَوْ شِبْلٍ قَالَ أَبُو نُعَيْمٍ الْمُغِيرَةُ بْنُ شُبَيْلٍ يَعْنِي ابْنَ عَوْفٍ فِي هَذَا الْحَدِيثِ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا عَبْدٍ أَبَقَ فَقَدْ بَرِئَتْ مِنْهُ الذِّمَّةُ",
                "id": "Telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dari [Habib] dari [Al Mughirah bin Syubail] atau Syibl telah berkata [Abu Nu'aim]; [Al Mughirah bin Syubail] yakni Ibnu 'Auf dalam hadits ini, dari [Jarir bin Abdullah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang budak yang melarikan diri, maka telah terlepas darinya Adz Dzimmah (jaminan keamanan dan tanggungan).\""
            },
            {
                "number": 2399,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا شُعْبَةُ عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ عَنِ الْمُنْذِرِ بْنِ جَرِيرٍ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ سَنَّ فِي الْإِسْلَامِ سُنَّةً حَسَنَةً كَانَ لَهُ أَجْرُهَا وَأَجْرُ مَنْ عَمِلَ بِهَا مِنْ بَعْدِهِ مِنْ غَيْرِ أَنْ يُنْتَقَصَ مِنْ أُجُورِهِمْ شَيْءٌ وَمَنْ سَنَّ فِي الْإِسْلَامِ سُنَّةً سَيِّئَةً كَانَ عَلَيْهِ وِزْرُهَا وَوِزْرُ مَنْ عَمِلَ بِهَا مِنْ بَعْدِهِ مِنْ غَيْرِ أَنْ يُنْتَقَصَ مِنْ أَوْزَارِهِمْ شَيْءٌحَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عَوْنَ بْنَ أَبِي جَحْفَةَ عَنِ الْمُنْذِرِ بْنِ جَرِيرٍ الْبَجَلِيِّ عَنْ أَبِيهِ قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَدْرِ النَّهَارِ فَذَكَرَهُ إِلَّا أَنَّهُ قَالَ فَأَمَرَ بِلَالًا فَأَذَّنَ ثُمَّ دَخَلَ ثُمَّ خَرَجَ يُصَلِّي وَقَالَ كَأَنَّهُ مُذْهَبَةٌ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] Telah menceritakan kepada kami [Syu'bah] dari [Aun bin Abu Juhaifah] dari [Al Mundzir bin Jarir] dari [bapaknya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barangsiapa memulai kebaikan dalam Islam, ia memperoleh pahala dan pahala siapa saja yang emnirunya sesudahnya dnegan tidak mengurangi pahala mereka sama seklai. Sebaliknya barangsiapa memulai kebiasaan buruk dalam Islam, ia mendapat dosanya dan dosa yang menirunya dengan tidak mengurangi dosa mereka sedikitpun. Telah menceritakan kepada kami [Hasyim bin Al Qasim] Telah menceritakan kepada kami [Syu'bah] mengatakan, aku mendengar ['Aun bin Abi Jahafah] dari [Almundzir bin Jarir Al Bajali] dari [ayahnya] mengatakan, kami berada di sisi Rasulullah Shallallahu'alaihiwasallam di awal siang, lantas ia sebut redaksinya. Hanya ia mengatakan, lantas beliau menyuruh Bilal mengumandangkan adzan, kemudian beliau masuk kamar dan keluar kamarnya dan mendirikan sholat. Kata ayah Jarir, seolah-olah beliau disepuh emas (maksudnya beliau bersinar-sinar wajahnya karena gembira melihat kesegeraan sahabat taat kepada Allah)."
            },
            {
                "number": 2400,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنِ الْحَجَّاجِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ زَاذَانَ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّأَنَّ رَجُلًا جَاءَ فَدَخَلَ فِي الْإِسْلَامِ فَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُهُ الْإِسْلَامَ وَهُوَ فِي مَسِيرِهِ فَدَخَلَ خُفُّ بَعِيرِهِ فِي جُحْرِ يَرْبُوعٍ فَوَقَصَهُ بَعِيرُهُ فَمَاتَ فَأَتَى عَلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ عَمِلَ قَلِيلًا وَأُجِرَ كَثِيرًا قَالَهَا حَمَّادٌ ثَلَاثًا اللَّحْدُ لَنَا وَالشَّقُّ لِغَيْرِنَاحَدَّثَنَا عَفَّانُ حَدَّثَنَا عَبْدُ الْوَاحِدِ حَدَّثَنَا حَجَّاجُ بْنُ أَرْطَاةَ حَدَّثَنَا عُثْمَانُ الْبَجَلِيُّ عَنْ زَاذَانَ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Hammad bin Salamah] dari [Al Hajjaj] dari [Amru bin Murrah] dari [Zadzan] dari [Jarir bin Abdullah Al Bajali] bahwa seorang laki-laki datang dan menyatakan masuk Islam. Maka Rasulullah shallallahu 'alaihi wasallam pun mengajarkan Islam kepadanya, saat itu ia masih berada dalam perjalanan. Tiba-tiba telapak kaki Unta miliknya masuk ke dalam sarang Yarbu' (sejenis hewan yang menyerupai tikus dan berekor panjang lagi berbulu), sehingga Untanya itu mematahkan lehernya dan ia pun meninggal. Kemudian Rasulullah shallallahu 'alaihi wasallam mendatanginya dan bersabda: \"Ia beramal sedikit, namun diberi ganjaran pahala yang banyak.\" Hammad mengatakannya sebanyak tiga kali, \"Lahad adalah untuk kita, sedakang Asy Syaq adalah untuk selain kita.\" Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Abdul Wahid] Telah menceritakan kepada kami [Hajjaj bin Arthah] Telah menceritakan kepada kami [Utsman Al Bajali] dari [Zadzan] ia pun menyebutkan hadits. "
            },
            {
                "number": 2401,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ عُبَيْدِ اللَّهِ بْنِ جَرِيرٍ عَنْ جَرِيرٍ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ أُبَايِعُكَ عَلَى الْإِسْلَامِ فَقَبَضَ يَدَهُ وَقَالَ النُّصْحُ لِكُلِّ مُسْلِمٍ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ مَنْ لَمْ يَرْحَمْ النَّاسَ لَمْ يَرْحَمْهُ اللَّهُ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Simak bin Harb] dari [ubaidhullah bin Jarir] dari [Jarir] ia berkata; Saya mendatangi Rasulullah shallallahu 'alaihi wasallam dan berkata; \"Saya berbaiat kepada Anda di atas Islam.\" Beliau pun menjabat tangannya dan bersabda: \"Untuk berbakti kepada setiap muslim.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang tidak mengasihi manusia, maka ia tidak akan dikasihi Allah 'azza wajalla.\""
            },
            {
                "number": 2402,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ قَالَ سَمِعْتُ أَبَا وَائِلٍ يُحَدِّثُ عَنْ رَجُلٍ عَنْ جَرِيرٍ أَنَّهُ قَالَبَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى إِقَامِ الصَّلَاةِ وَإِيتَاءِ الزَّكَاةِ وَالنُّصْحِ لِلْمُسْلِمِ وَعَلَى فِرَاقِ الْمُشْرِكِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Manshur] ia berkata, saya mendengar [Abu Wa`il] menceritakan dari [seorang laki-laki] dari [Jarir] bahwa ia berkata; \"Saya telah berbai'at kepada Rasulullah shallallahu 'alaihi wasallam untuk (senantiasa) mendirikan sholat, mengeluarkan zakat, berbakti kepada setiap muslim dan berlepas diri dari orang musyrik.\""
            },
            {
                "number": 2403,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ قَالَ سَمِعْتُ أَبَا ظَبْيَانَ يُحَدِّثُ عَنْ جَرِيرٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ لَمْ يَرْحَمْ النَّاسَ لَمْ يَرْحَمْهُ اللَّهُ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Sulaiman] ia berkata, saya mendengar [Abu Zhabyan] menceritakan dari [Jarir] ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang tidak mengasihi manusia, maka Allah 'azza wajalla tidak akan mengasihinya.\""
            },
            {
                "number": 2404,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا عَاصِمُ بْنُ بَهْدَلَةَ عَنْ أَبِي وَائِلٍ أَنَّ جَرِيرًا قَالَيَا رَسُولَ اللَّهِ اشْتَرِطْ عَلَيَّ قَالَ تَعْبُدُ اللَّهَ لَا تُشْرِكُ بِهِ شَيْئًا وَتُصَلِّي الصَّلَاةَ الْمَكْتُوبَةَ وَتُؤَدِّي الزَّكَاةَ الْمَفْرُوضَةَ وَتَنْصَحُ الْمُسْلِمَ وَتَبْرَأُ مِنْ الْكَافِرِ",
                "id": "Telah menceritakan kepada kami [Bahz] Telah menceritakan kepada kami [Hammad bin Salamah] Telah menceritakan kepada kami [Ashim bin Bahdalah] dari [Abu Wa`il] bahwa [Jarir] berkata, \"Wahai Rasulullah, tetapkan syarat atasku.\" Beliau bersabda: \"Kamu beribadah kepada Allah, janganlah kamu menyekutukan-Nya dengan sesuatu apa pun, hendaklah kamu menunaikan sholat wajib, membayar zakat wajib, dan selalu berbakti kepada setiap muslim serta berlepas diri dari orang kafir.\""
            },
            {
                "number": 2405,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ جَرِيرٍ عَنْ أَبِيهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَا يَرْحَمُ مَنْ لَا يَرْحَمُ النَّاسَ",
                "id": "Telah menceritakan kepada kami [Bahz] Telah menceritakan kepada kami [Hammad bin Salamah] dari [Abdul Malik bin Umair] dari [ubaidhullah bin Jarir] dari [bapaknya] ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah 'azza wajalla tidak akan mengasihi seorang yang tidak mengasihi manusia.\""
            },
            {
                "number": 2406,
                "arab": "حَدَّثَنَا يَحْيَى عَنْ يُوسُفَ بْنِ صُهَيْبٍ وَوَكِيعٌ حَدَّثَنَا يُوسُفُ عَنْ حَبِيبِ بْنِ يَسَارٍ عَنْ زَيْدِ بْنِ أَرْقَمَ رَضِيَ اللَّهُ تَعَالَى عَنْهُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَمْ يَأْخُذْ مِنْ شَارِبِهِ فَلَيْسَ مِنَّا",
                "id": "Telah menceritakan kepada kami [Yahya] dari [Yusuf bin Suhaib] dan [Waki'] Telah menceritakan kepada kami [Yusuf] dari [Habib bin Yasar] dari [Zaid bin Arqam] radliallahu 'anhu dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Siapa yang tidak dapat mengambil minuman dari Al Haudl (telaga Nabi di surga), maka ia bukanlah golongan kami.\""
            },
            {
                "number": 2407,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا هِشَامٌ الدَّسْتُوَائِيُّ عَنِ الْقَاسِمِ بْنِ عَوْفٍ الشَّيْبَانِيِّ عَنْ زَيْدِ بْنِ أَرْقَمَ قَالَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَهْلِ قُبَاءَ وَهُمْ يُصَلُّونَ الضُّحَى فَقَالَ صَلَاةُ الْأَوَّابِينَ إِذَا رَمِضَتْ الْفِصَالُ مِنْ الضُّحَى",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Hisyam Ad Dastuwa`i] dari [Al Qasim bin Auf Asy Syaibani] dari [Zaid bin Arqam] ia berkata; Rasulullah shallallahu 'alaihi wasallam keluar menemui penghuni Quba` yang saat itu mereka sedang sholat. maka beliau bersabda: \"sholat orang-orang yang bertaubat adalah ketika anak-anak unta telah menderum (karena panas).\""
            },
            {
                "number": 2408,
                "arab": "قَالَ يَزِيدُ بْنُ حَيَّانَ حَدَّثَنَا زَيْدُ بْنُ أَرْقَمَ فِي مَجْلِسِهِ ذَلِكَ قَالَبَعَثَ إِلَيَّ عُبَيْدُ اللَّهِ بْنُ زِيَادٍ فَأَتَيْتُهُ فَقَالَ مَا أَحَادِيثُ تُحَدِّثُهَا وَتَرْوِيهَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نَجِدُهَا فِي كِتَابِ اللَّهِ تُحَدِّثُ أَنَّ لَهُ حَوْضًا فِي الْجَنَّةِ قَالَ قَدْ حَدَّثَنَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَوَعَدَنَاهُ قَالَ كَذَبْتَ وَلَكِنَّكَ شَيْخٌ قَدْ خَرِفْتَ قَالَ إِنِّي قَدْ سَمِعَتْهُ أُذُنَايَ وَوَعَاهُ قَلْبِي مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ جَهَنَّمَ وَمَا كَذَبْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Hayyan] Telah menceritakan kepada kami [Zaid bin Arqam] di dalam majelisnya, ia berkata; ubaidhullah bin Ziyad mengutus seseorang kepadaku, lalu saya pun mendatanginya. Kemudian ia bertanya; \"Hadits apa saja yang kamu ceritakan dan riwayatkan dari Rasulullah shallallahu 'alaihi wasallam yang tidak kami dapatkan di dalam Kitabullah, kamu menceritakan bahwa beliau memiliki Haudl (telaga) di surge?.\" Ia berkata; Rasulullah shallallahu 'alaihi wasallam telah menceritakan dan menjanjikannya kepada kami.\" Ubaid berkata, \"Kamu telah berdusta, kamu adalah seorang yang telah tua dan pikun.\" Zaid berkata, \"Sesungguhnya kedua telingaku telah mendengarnya dan hatiku telah menghafalnya dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: 'Barangsiapa yang berdusta atas namaku, maka hendaklah ia mempersiapkan tempat duduknya di neraka jahannam.' Tidaklah saya berdusta atas nama Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 2409,
                "arab": "وَحَدَّثَنَا زَيْدٌ فِي مَجْلِسِهِ قَالَإِنَّ الرَّجُلَ مِنْ أَهْلِ النَّارِ لَيَعْظُمُ لِلنَّارِ حَتَّى يَكُونَ الضِّرْسُ مِنْ أَضْرَاسِهِ كَأُحُدٍ",
                "id": "Dan Telah menceritakan kepada kami [Zaid] di dalam majelisnya, ia berkata; Sesungguhnya seorang laki-laki penghuni neraka, benar-benar akan dibesarkan di neraka hingga besar gigi gerahamnya seperti gunung Uhud."
            },
            {
                "number": 2410,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ يَزِيدَ بْنِ حَيَّانَ عَنْ زَيْدِ بْنِ أَرْقَمَ قَالَسَحَرَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ مِنْ الْيَهُودِ قَالَ فَاشْتَكَى لِذَلِكَ أَيَّامًا قَالَ فَجَاءَهُ جِبْرِيلُ عَلَيْهِ السَّلَام فَقَالَ إِنَّ رَجُلًا مِنْ الْيَهُودِ سَحَرَكَ عَقَدَ لَكَ عُقَدًا عُقَدًا فِي بِئْرِ كَذَا وَكَذَا فَأَرْسَلَ إِلَيْهَا مَنْ يَجِيءُ بِهَا فَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلِيًّا رَضِيَ اللَّهُ تَعَالَى عَنْهُ فَاسْتَخْرَجَهَا فَجَاءَ بِهَا فَحَلَّلَهَا قَالَ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَأَنَّمَا نُشِطَ مِنْ عِقَالٍ فَمَا ذَكَرَ لِذَلِكَ الْيَهُودِيِّ وَلَا رَآهُ فِي وَجْهِهِ قَطُّ حَتَّى مَاتَ",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] Telah menceritakan kepada kami [Al A'masy] dari [Yazid bin Hayyan] dari [Zaid bin Arqam] ia berkata; Seorang laki-laki menyihir Nabi shallallahu 'alaihi wasallam, sebab itu beliau pun jatuh sakit berhari-hari. Kemudian Jibril 'Alaihis Salam mendatangi beliau dan berkata, \" Sesungguhnya seorang laki-laki dari kalangan Yahudi telah meyihirmu. Ia telah membuat beberapa buhul untukmu di sumur. Utuslah seorang yang akan mengambilnya.\" Maka Rasulullah shallallahu 'alaihi wasallam mengutus Ali radliallahu 'anhu. Ia pun mengeluarkannya kemudian membawanya dan mengurainya. Setelah itu, Rasulullah shallallahu 'alaihi wasallam pun berdiri seolah beliau baru saja terbebaskan dari belenggu. Beliau tidak lagi menyebut orang Yahudi itu, dan beliau pun tidak pernah melihatnya hingga meninggal."
            },
            {
                "number": 2411,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ ثُمَامَةَ بْنِ عُقْبَةَ عَنْ زَيْدِ بْنِ أَرْقَمَ قَالَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ مِنْ الْيَهُودِ فَقَالَ يَا أَبَا الْقَاسِمِ أَلَسْتَ تَزْعُمُ أَنَّ أَهْلَ الْجَنَّةِ يَأْكُلُونِ فِيهَا وَيَشْرَبُونَ وَقَالَ لِأَصْحَابِهِ إِنْ أَقَرَّ لِي بِهَذِهِ خَصَمْتُهُ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَلَى وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ أَحَدَهُمْ لَيُعْطَى قُوَّةَ مِائَةِ رَجُلٍ فِي الْمَطْعَمِ وَالْمَشْرَبِ وَالشَّهْوَةِ وَالْجِمَاعِ قَالَ فَقَالَ لَهُ الْيَهُودِيُّ فَإِنَّ الَّذِي يَأْكُلُ وَيَشْرَبُ تَكُونُ لَهُ الْحَاجَةُ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَاجَةُ أَحَدِهِمْ عَرَقٌ يَفِيضُ مِنْ جُلُودِهِمْ مِثْلُ رِيحِ الْمِسْكِ فَإِذَا الْبَطْنُ قَدْ ضَمُرَ",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] Telah menceritakan kepada kami [Al A'masy] dari [Tsumamah bin Uqbah] dari [Zaid bin Arqam] ia berkata; Seorang Yahudi mendatangi Nabi shallallahu 'alaihi wasallam dan bertanya, \"Wahai Abu Qasim, bukankah Anda telah berdalih bahwa penghuni surga makan dan minum di dalamnya?\" Kemudian laki-laki itu berkata kepada temannya, \"Jika ia menetapkan hal ini, maka saya akan membantahnya.\" Maka Nabi shallallahu 'alaihi wasallam menjawab: \"Ya, demi Dzat yang jiwaku berada di Tangan-Nya, salah seorang dari mereka benar-benar akan diberi kekuatan seratus laki-laki, yakni dalam makanan, minuman, syahwat dan jima'.\" Orang Yahudi itu bertanya, \"Maka yang makan dan minum, mestinya akan memiliki hajat (buang air).\" maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hajat salah seorang dari mereka adalah keringat yang keluar dari kulit-kulit mereka yang wanginya seharum Misk, dan perut pun mengecil kembali.\""
            },
            {
                "number": 2412,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ أَخْبَرَنَا أَيُّوبُ عَنِ الْقَاسِمِ الشَّيْبَانِيِّأَنَّ زَيْدَ بْنَ أَرْقَمَ رَأَى قَوْمًا يُصَلُّونَ فِي مَسْجِدِ قُبَاءَ مِنْ الضُّحَى فَقَالَ أَمَا لَقَدْ عَلِمُوا أَنَّ الصَّلَاةَ فِي غَيْرِ هَذِهِ السَّاعَةِ أَفْضَلُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ صَلَاةَ الْأَوَّابِينَ حِينَ تَرْمَضُ الْفِصَالُ وَقَالَ مَرَّةً وَأُنَاسٌ يُصَلُّونَ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Ulyah] telah mengabarkan kepada kami [Ayyub] dari [Al Qasim Asy Syaibani] bahwa [Zaid bin Arqam] melihat suatu kaum yang sedang sholat di Masjid Quba` pada waktu Dluha, maka ia pun berkata; \"Bukankah mereka tahu, bahwa sholat yang dilakukan di luar waktu ini adalah lebih utama?, Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah bersabda: \"sholat orang-orang yang bertaubat adalah saat anak-anak Unta menderum (karena panasnya matahari).\" Dan sekali waktu Zaid berkata; \"Sementara orang-orang sedang sholat.\""
            },
            {
                "number": 2413,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ حَدَّثَنِي عَمْرُو بْنُ مُرَّةَ عَنِ ابْنِ أَبِي لَيْلَىأَنَّ زَيْدَ بْنَ أَرْقَمَ كَانَ يُكَبِّرُ عَلَى جَنَائِزِنَا أَرْبَعًا وَأَنَّهُ كَبَّرَ عَلَى جِنَازَةٍ خَمْسًا فَسَأَلُوهُ فَقَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَبِّرُهَا أَوْ كَبَّرَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] telah menceritakan kepadaku [Amru bin Murrah] dari [Ibnu Abu Laila] bahwa [Zaid bin Arqam] bertakbir (mensholati jenazah) sebanyak empat kali takbir, kemudian ia bertakbir lagi hingga (takbirnya menjadi) lima kali. Maka orang-orang pun bertanya. Kemudian ia berkata; Rasulullah shallallahu 'alaihi wasallam pernah melakukan takbir yang kelima. Atau Nabi shallallahu 'alaihi wasallam telah mengucapkan takbir itu."
            },
            {
                "number": 2414,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ يُوسُفَ بْنِ صُهَيْبٍ عَنْ حَبِيبِ بْنِ يَسَارٍ عَنْ زَيْدِ بْنِ أَرْقَمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ لَمْ يَأْخُذْ مِنْ شَارِبِهِ فَلَيْسَ مِنَّا",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Yusuf bin Shuhaib] dari [Habib bin Yasar] dari [Zaid bin Arqam] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Siapa yang tidak dapat mengamil minuman dari (telaga Al Haudl) maka ia bukanlah termasuk dari golongan kami.\""
            },
            {
                "number": 2415,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ عَنْ حَبِيبٍ يَعْنِي ابْنَ أَبِي ثَابِتٍ عَنْ أَبِي الْمِنْهَالِ قَالَ سَمِعْتُ زَيْدَ بْنَ أَرْقَمَ وَالْبَرَاءَ بْنَ عَازِبٍ يَقُولَانِنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ بَيْعِ الذَّهَبِ بِالْوَرِقِ دَيْنًاحَدَّثَنَا بَهْزٌ وَعَفَّانُ قَالَا ثَنَا شُعْبَةُ قَالَ بَهْزٌ فِي حَدِيثِهِ حَدَّثَنِي حَبِيبُ بْنُ أَبِي ثَابِتٍ قَالَ سَمِعْتُ أَبَا الْمِنْهَالِ رَجُلًا مِنْ بَنِي كِنَانَةَ قَالَ سَأَلْتُ الْبَرَاءَ عَنْ الصَّرْفِ فَقَالَ سَلْ زَيْدَ بْنَ أَرْقَمَ فَإِنَّهُ خَيْرٌ مِنِّي وَأَعْلَمُ قَالَ سَأَلْتُ زَيْدًا فَذَكَرَ الْحَدِيثَ حَدَّثَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ وَعَامِرُ بْنُ مُصْعَبٍ سَمِعَا أَبَا الْمِنْهَالِ قَالَ سَأَلْتُ الْبَرَاءَ وَزَيْدَ بْنَ أَرْقَمَ فَذَكَرَ نَحْوَهُ حَدَّثَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي حَسَنُ بْنُ مُسْلِمٍ عَنْ أَبِي الْمِنْهَالِ وَلَمْ يَسْمَعْهُ مِنْهُ أَنَّهُ سَمِعَ زَيْدًا وَالْبَرَاءَ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] dari [Habib] yakni Ibnu Abu Tsabit, dari [Abul Minhal] ia berkata, saya mendengar [Zaid bin Arqam] dan [Al Baraa` bin Azib] berkata; \"Rasulullah shallallahu 'alaihi wasallam melarang jual beli emas dengan Wariq (uang dirham) secara hutang.\" Telah menceritakan kepada kami [Bahz] dan ['Affan] keduanya berkata, Telah menceritakan kepada kami [Syu'bah] -Bahz berkata dalam haditsnya- telah menceritakan kepadaku [Habib bin Abu Tsabit] ia berkata, saya mendengar [Abu Minhal] yakni seorang laki-laki dari Bani Kinanah, ia berkata; Saya bertanya kepada Al Baraa` tentang Ash Sharf (jual beli emas dengan perask dan semisal). Ia pun berkata, \"Tanyakanlah kepada Zaid bin Arqam, karena ia adalah lebih baik dan lebih tahu dariku.\" Maka saya pun bertanya kepada [Zaid]. Ia pun menyebutkan hadits itu. Telah menceritakan kepada kami [Rauh] Telah menceritakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Amru bin Dinar] dan [Amir bin Mush'ab] keduanya mendengar [Abu Minhal] berkata; Saya bertanya kepada [Al Bara`] dan [Zaid bin Arqam]. Maka ia pun menyebutkan hadits semisalnya. Telah menceritakan kepada kami [Rauh] Telah menceritakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Hasan bin Muslim] dari [Abu Minhal] namun ia belum mendengar darinya, bahwa ia mendengar Zaid dan Al Baraa`, kemudian ia pun menyebutkan hadits."
            },
            {
                "number": 2416,
                "arab": "حَدَّثَنَا مُعَاوِيَةُ بْنُ عَبْدِ اللَّهِ بْنِ مُعَاوِيَةَ بْنِ عَاصِمِ بْنِ الْمُنْذِرِ بْنِ الزُّبَيْرِ حَدَّثَنَا سَلَّامٌ أَبُو الْمُنْذِرِ الْقَارِئُ حَدَّثَنَا عَاصِمُ بْنُ بَهْدَلَةَ عَنِ الشَّعْبِيِّ أَوْ خَيْثَمَةَ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا مَثَلُ الْمُسْلِمِينَ كَالرَّجُلِ الْوَاحِدِ إِذَا وَجِعَ مِنْهُ شَيْءٌ تَدَاعَى لَهُ سَائِرُ جَسَدِهِ",
                "id": "Telah menceritakan kepada kami [Mu'awiyah bin Abdullah bin Mu'awiyah bin Ashim bin Mundzir bin Az Zubair] Telah menceritakan kepada kami [Sallam Abu Mundzir Al Qori'] Telah menceritakan kepada kami [Ashim bin Bahdalah] dari [Asy Sya'bi] atau [Khaitsamah] dari [An Nu'man bin Basyir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya perumpamaan kaum muslimin, adalah seperti satu tubuh, jika ada bagian tubuhnya yang sakit, maka seluruh jasadnya turut merasakan.\""
            },
            {
                "number": 2417,
                "arab": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ قَالَ حَدَّثَنَا أَبُو وَكِيعٍ الْجَرَّاحُ بْنُ مَلِيحٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَنِ الشَّعْبِيِّ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ مَنْ لَمْ يَشْكُرْ الْقَلِيلَ لَمْ يَشْكُرْ الْكَثِيرَ وَمَنْ لَمْ يَشْكُرْ النَّاسَ لَمْ يَشْكُرْ اللَّهَ عَزَّ وَجَلَّ وَالتَّحَدُّثُ بِنِعْمَةِ اللَّهِ شُكْرٌ وَتَرْكُهَا كُفْرٌ وَالْجَمَاعَةُ رَحْمَةٌ وَالْفُرْقَةُ عَذَابٌ",
                "id": "Telah menceritakan kepada kami [Manshur bin Abu Muzahim] ia berkata, Telah menceritakan kepada kami [Abu Waki' Al Jarrah bin Malih] dari [Abu Abdurrahman] dari [Asy Sya'bi] dari [An Nu'aman bin Basyir] ia berkata; Nabi shallallahu 'alaihi wasallam bersabda di mimbar ini: \"Siapa yang tidak mampu mensyukuri nikmat yang sedikit, maka ia tidak akan mampu mensyukuri nikmat yang banyak. Dan siapa yang tidak mampu berterimah kasih kepada manusia, maka ia tidak akan mampu bersyukur kepada Allah 'azza wajalla. Membicarakan nikmat Allah adalah syukur, sedangkan meninggalkannya adalah kufur. Hidup berjama'ah adalah rahmat, sedangkan perpecahan adalah adzab.\""
            },
            {
                "number": 2418,
                "arab": "قَالَ عَبْد اللَّهِ حَدَّثَنِي يَحْيَى بْنُ عَبْدِ رَبِّهِ مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا أَبُو وَكِيعٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَنِ الشَّعْبِيِّ عَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى هَذِهِ الْأَعْوَادِ أَوْ عَلَى هَذَا الْمِنْبَرِ مَنْ لَمْ يَشْكُرْ الْقَلِيلَ لَمْ يَشْكُرْ الْكَثِيرَ وَمَنْ لَمْ يَشْكُرْ النَّاسَ لَمْ يَشْكُرْ اللَّهَ عَزَّ وَجَلَّ وَالتَّحَدُّثُ بِنِعْمَةِ اللَّهِ شُكْرٌ وَتَرْكُهَا كُفْرٌ وَالْجَمَاعَةُ رَحْمَةٌ وَالْفُرْقَةُ عَذَابٌقَالَ فَقَالَ أَبُو أُمَامَةَ الْبَاهِلِيُّ عَلَيْكُمْ بِالسَّوَادِ الْأَعْظَمِ قَالَ فَقَالَ رَجُلٌ مَا السَّوَادُ الْأَعْظَمُ فَنَادَى أَبُو أُمَامَةَ هَذِهِ الْآيَةَ الَّتِي فِي سُورَةِ النُّورِ{ فَإِنْ تَوَلَّوْا فَإِنَّمَا عَلَيْهِ مَا حُمِّلَ وَعَلَيْكُمْ مَا حُمِّلْتُمْ }",
                "id": "Telah berkata Abdullah telah menceritakan kepadaku [Yahya bin Abdu Rabbih] bekas budak Bani Hasyim, Telah menceritakan kepada kami [Abu Waki'] dari [Abu Abdurrahman] dari [Asy Sya'bi] dari [An Nu'man bin Basyir] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda di atas mimbar ini: \"Siapa yang tidak mampu mensyukuri yang sedikit, maka ia tidak akan mampu mensyukuri sesuatu yang banyak. Dan siapa yang bisa berterima kasih kepada manusia, maka ia tidak akan bersyukur kepada Allah 'azza wajalla. Membicarakan nikmat Allah adalah syukur, sedangkan meninggalkannya adalah kufur. Berjama'ah adalah rahmat, sedangkan perpecahan adalah adzab.\" [Abu Umamah Al Bahili] berkata; \"Hendaklah kalian bersama golongan mayoritas muslimin.\" Kemudian Abu Umamah membacakan ayat ini, yang terdapat dalam surat An Nur: \"Dan jika kamu berpaling, Maka Sesungguhnya kewajiban Rasul itu adalah apa yang dibebankan kepadanya, dan kewajiban kamu sekalian adalah semata-mata apa yang dibebankan kepadamu.\" (QS. Annur 54)."
            },
            {
                "number": 2419,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ هُوَ الْقَوَارِيرِيُّ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ حَدَّثَنَا حَاجِبُ بْنُ الْمُفَضَّلِ يَعْنِي ابْنَ الْمُهَلَّبِ عَنْ أَبِيهِ عَنِ النُّعْمَانِ بْنِ بَشِيرٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَارِبُوا بَيْنَ أَبْنَائِكُمْ يَعْنِي سَوُّوا بَيْنَهُمْ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Umar Al Qawariri] Telah menceritakan kepada kami [Hammad] yakni Ibnu Zaid, Telah menceritakan kepada kami [Hajib bin Al Mufadldlal] yakni Ibnul Muhallab, dari [bapaknya] dari [An Nu'man bin Basyir], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Berlaku adillah di antara anak-anak kalian.\""
            },
            {
                "number": 2420,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ الْبَاهِلِيُّ وَعُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ وَمُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ قَالُوا ثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ حَاجِبِ بْنِ الْمُفَضَّلِ بْنِ الْمُهَلَّبِ عَنْ أَبِيهِ أَنَّهُ سَمِعَ النُّعْمَانَ بْنَ بَشِيرٍ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اعْدِلُوا بَيْنَ أَبْنَائِكُمْ اعْدِلُوا بَيْنَ أَبْنَائِكُمْ",
                "id": "Telah menceritakan kepada kami Abdullah Telah menceritakan kepada kami [Ibrahim bin Al Hasan Al Bahili] dan [ubaidhullah bin Umar Al Fawariri] dan [Muhammad bin Abu Bakr Al Muqaddami] mereka berkata, Telah menceritakan kepada kami [Hammad bin Zaid] dsari [Hajib bin Al Mufadldlal bin Al Muhallab] dari [bapaknya] bahwa mendengar [An Nu'man bin Basyir] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berlaku adillah terhadap anak-anak kalian. Berlaku adillah terhadap anak-anak kalian.\""
            },
            {
                "number": 2421,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا حُصَيْنٌ عَنِ الشَّعْبِيِّ عَنْ عُرْوَةَ الْبَارِقِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْخَيْلُ مَعْقُودٌ بِنَوَاصِيهَا الْخَيْرُ وَالْأَجْرُ وَالْمَغْنَمُ إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Hushain] dari [Asy Sya'bi] dari [Urwah Al Bariqi] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada ubun-ubun kuda itu, terikat kebaikan, pahala dan harta ghanimah hingga hari kiamat.\""
            },
            {
                "number": 2422,
                "arab": "حَدَّثَنَا سُفْيَانُ أَخْبَرَنَا الْبَارِقِيُّ شَبِيبٌ أَنَّهُ سَمِعَ عُرْوَةَ الْبَارِقِيَّ يَقُولُسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُوَرَأَيْتُ فِي دَارِهِ سَبْعِينَ فَرَسًا",
                "id": "Telah menceritakan kepada kami [Sufyan] telah mengabarkan kepada kami [Al Bariqi Syabib] bahwa ia mendengar [Urwah Al Bariqi] berkata, saya mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Pada ubun-ubun kuda itu, terikat kebaikan, pahala dan harta ghanimah hingga hari kiamat.\" Dan di rumahnya, saya melihat tujuh puluh ekor kuda."
            },
            {
                "number": 2423,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي السَّفَرِ عَنْ الشَّعْبِيِّ عَنْ عُرْوَةَ بْنِ أَبِي الْجَعْدِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْخَيْلُ مَعْقُودٌ بِنَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ الْأَجْرُ وَالْمَغْنَمُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Abdullah bin Abu Safar] dari [Asy Sya'bi] dari [Urwah bin Abul Ja'dari] ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada ubun-ubun kuda itu, terdapat kebaikan, pahala dan harta ghanimah hingga hari kiamat tiba.\""
            },
            {
                "number": 2424,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ زَكَرِيَّا وَوَكِيعٌ قَالَ حَدَّثَنَا زَكَرِيَّا عَنْ عَامِرٍ عَنْ عُرْوَةَ قَالَ يَحْيَى ابْنِ أَبِي الْجَعْدِ الْبَارِقِيُّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ وَكِيعٌ فِي حَدِيثِهِ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ الْأَجْرُ وَالْمَغْنَمُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Zakariya] dan [Waki'] ia berkata, Telah menceritakan kepada kami [Zakariya] dari [Amir] dari [Urwah] telah berkata [Yahya] [Ibnu Abul Ja'dari Al Bariqi] dari Nabi shallallahu 'alaihi wasallam. Dan [Waki'] berkata dalam haditsnya; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada ubun-ubun kuda itu, terdapat kebaikan, pahala dan harta ghanimah hingga hari kiamat tiba.\""
            },
            {
                "number": 2425,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَاقَ عَنِ الْعَيْزَارِ عَنْ عُرْوَةَ بْنِ جَعْدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari [Al 'Aizar] dari [Amru bin Ja'd] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Pada ubun-ubun kuda, selalu terdapat kebaikan.\""
            },
            {
                "number": 2426,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا سَعِيدُ بْنُ زَيْدٍ حَدَّثَنَا الزُّبَيْرُ بْنُ الْخِرِّيتِ حَدَّثَنَا أَبُو لَبِيدٍ عَنْ عُرْوَةَ بْنِ أَبِي الْجَعْدِ الْبَارِقِيِّ قَالَعَرَضَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَلَبٌ فَأَعْطَانِي دِينَارًا وَقَالَ أَيْ عُرْوَةُ ائْتِ الْجَلَبَ فَاشْتَرِ لَنَا شَاةً فَأَتَيْتُ الْجَلَبَ فَسَاوَمْتُ صَاحِبَهُ فَاشْتَرَيْتُ مِنْهُ شَاتَيْنِ بِدِينَارٍ فَجِئْتُ أَسُوقُهُمَا أَوْ قَالَ أَقُودُهُمَا فَلَقِيَنِي رَجُلٌ فَسَاوَمَنِي فَأَبِيعُهُ شَاةً بِدِينَارٍ فَجِئْتُ بِالدِّينَارِ وَجِئْتُ بِالشَّاةِ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا دِينَارُكُمْ وَهَذِهِ شَاتُكُمْ قَالَ وَصَنَعْتَ كَيْفَ قَالَ فَحَدَّثْتُهُ الْحَدِيثَ فَقَالَ اللَّهُمَّ بَارِكْ لَهُ فِي صَفْقَةِ يَمِينِهِفَلَقَدْ رَأَيْتُنِي أَقِفُ بِكُنَاسَةِ الْكُوفَةِ فَأَرْبَحُ أَرْبَعِينَ أَلْفًا قَبْلَ أَنْ أَصِلَ إِلَى أَهْلِي وَكَانَ يَشْتَرِي الْجَوَارِيَ وَيَبِيعُ حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْحَجَّاجِ حَدَّثَنَا سَعِيدُ بْنُ زَيْدٍ حَدَّثَنَا الزُّبَيْرُ بْنُ الْخِرِّيتِ عَنْ أَبِي لَبِيدٍ وَهُوَ لُمَازَةُ بْنُ زَبَّارٍ عَنْ عُرْوَةَ بْنِ أَبِي الْجَعْدِ الْبَارِقِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu Kamil] Telah menceritakan kepada kami [Sa'id bin Zaid] Telah menceritakan kepada kami [Az Zubair bin Al Khirrit] Telah menceritakan kepada kami [Abu Labid] dari [Urwah bin Abul Ja'd Al Bariqi] ia berkata; Suatu ketika Nabi shallallahu 'alaihi wasallam melihat barang-barang impor, maka beliau pun memberiku satu Dinar seraya bersabda: \"Wahai Urwah, datangilah barang impor itu, dan belilah untuk kami satu ekor kambing.\" Saya pun mendatangi barang-barang impor itu, dan melakukan tawar menawar dengan pemiliknya hingga saya dapat membeli dua ekor kambing darinya dengan harga satu Dinar. Akhirnya saya segera menuntunnya, lalu seorang laki-laki menjumpaiku dan menawar kambing itu, maka saya pun menjual satu ekor kambing dengan harga satu Dinar. Akhirnya saya kembali dengan membawa kembali satu Dinar dan satu ekor kambing. Saya berkata, \"Wahai Rasulullah, ini uang Dinar kalian, dan ini kambing kalian.\" beliau bertanya: \"Apa yang kamu lakukan?\" Maka saya pun menceritakan alur kejadiannya. Beliau berdo'a: \"ALLAHUMMA BAARIK LAHU FI SHAFQATI YAMIINIH (Ya Allah, berilah keberkahan dalam ikrar dan janjinya).\" Maka kalian telah melihatku saat berada di TPS (Tempat pembuangan Sampah) di Kufah, saya telah meraih keuntungan empat puluh ribu sebelum sampai ke keluargaku. Saat itu, Urwah membeli budak-budak wanita dan menjualnya. Telah menceritakan kepada kami [Ibrahim bin Hajjaj] Telah menceritakan kepada kami [Sa'id bin Zaid] Telah menceritakan kepada kami [Az Zubair bin Hirrit] dari [Abu Labid] ia adalah Lumazah bin Zabbar dari [Urwah bin Abul Ja'd Al Bariqi] dari Nabi shallallahu 'alaihi wasallam semisalnya."
            },
            {
                "number": 2427,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا شُعْبَةُ أَخْبَرَنَا أَبُو إِسْحَاقَ قَالَ سَمِعْتُ الْعَيْزَارَ بْنَ حُرَيْثٍ يُحَدِّثُ عَنْ عُرْوَةَ بْنِ أَبِي الْجَعْدِ الْأَزْدِيِّ أَنَّهُسَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ",
                "id": "Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepada kami [Abu Ishaq] ia berkata, saya mendengar [Al 'Aizar bin Huraits] menceritakan dari [Urwah bin Abul Ja'd Al Azdi] bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada ubun-ubun kuda itu, terdapat kebaikan.\""
            },
            {
                "number": 2428,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زَكَرِيَّا عَنِ الشَّعْبِيِّ حَدَّثَنِي عُرْوَةُ الْبَارِقِيُّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ الْأَجْرُ وَالْمَغْنَمُ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] Telah menceritakan kepada kami [Zakariya] dari [Asy Sya'bi] telah menceritakan kepadaku [Urwah Al Bariqi] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada ubun-ubun kuda itu, terdapat kebaikan, yaitu berupa pahala dan harta ghanimah hingga hari kiamat.\""
            },
            {
                "number": 2429,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا سَعِيدُ بْنُ زَيْدٍ حَدَّثَنَا الزُّبَيْرُ بْنُ الْخِرِّيتِ عَنْ أَبِي لَبِيدٍ قَالَ كَانَ عُرْوَةُ بْنُ أَبِي الْجَعْدِ الْبَارِقِيُّ نَازِلًا بَيْنَ أَظْهُرِنَا فَحَدَّثَ عَنْهُ أَبُو لَبِيدٍ لُمَازَةُ بْنُ زَبَّارٍ عَنْ عُرْوَةَ بْنِ أَبِي الْجَعْدِ قَالَعَرَضَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَلَبٌ فَأَعْطَانِي دِينَارًا فَقَالَ أَيْ عُرْوَةُ ائْتِ الْجَلَبَ فَاشْتَرِ لَنَا شَاةً قَالَ فَأَتَيْتُ الْجَلَبَ فَسَاوَمْتُ صَاحِبَهُ فَاشْتَرَيْتُ مِنْهُ شَاتَيْنِ بِدِينَارٍ فَجِئْتُ أَسُوقُهُمَا أَوْ قَالَ أَقُودُهُمَا فَلَقِيَنِي رَجُلٌ فَسَاوَمَنِي فَأَبِيعُهُ شَاةً بِدِينَارٍ فَجِئْتُ بِالدِّينَارِ وَجِئْتُ بِالشَّاةِ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا دِينَارُكُمْ وَهَذِهِ شَاتُكُمْ قَالَ وَصَنَعْتَ كَيْفَ فَحَدَّثْتُهُ الْحَدِيثَ فَقَالَ اللَّهُمَّ بَارِكْ لَهُ فِي صَفْقَةِ يَمِينِهِفَلَقَدْ رَأَيْتُنِي أَقِفُ بِكُنَاسَةِ الْكُوفَةِ فَأَرْبَحُ أَرْبَعِينَ أَلْفًا قَبْلَ أَنْ أَصِلَ إِلَى أَهْلِي وَكَانَ يَشْتَرِي الْجَوَارِيَ وَيَبِيعُ",
                "id": "Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Sa'id bin Zaid] Telah menceritakan kepada kami [Az Zubair bin Khirrit] dari [Abu Labid] ia berkata; Urwah bin Abul Ja'd singgah di tengah-tengah kami. Lantas Abu Labid Lumazah bin Zabbar menceritakan (hadits) dari [Urwah bin Abul Ja'd Albariqi], ia berkata; Rasulullah shallallahu 'alaihi wasallam mendapatkan barang-barang imporan, kemudian beliau memberiku sedinar seraya beliau katakana kepada pembaginya; \" Tolong si Urwah berilah barang imporan itu dan belilah kambing untuk kita-kita. Kata 'Urwah, lantas kubeli seekor kambing dan kutawar penjualnya, sehingga kubeli dua ekor kambing seharga sedinar. Aku giring keduanya -atau dengan redaksi 'aku menuntunnya, bukan menggiring--, kemudian seseorang menemuiku dan menawarku dan kujual satu ekor daripadanya dengan harga sedinar. Maka aku bawa satu dinar dan seekor kambing, lantas kukatakan 'Ya Rasulullah, ini dinarmu dan ini kambingmu. Kata Nabi, tadi kamu lakukan bagaimana kok bisa seperti ini? Maka kuceritakan kisahnya. Maka beliau memanjatkan doa \"alloohumma baarik lahu fi shofqoti yamiinihi\" (ya Allah, berilah barakah dalam ikrar atau akad jual belinya), hingga di kemudian hari aku melihatku berdiri di tempat pembuangan sampah di Kufah dan aku dapatkan laba sebanyak empat puluh ribu sebelum aku sampai ke kelurgaku. Dengan uang itu ia membeli hamba sahaya dan berbisnis."
            },
            {
                "number": 2430,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ حُصَيْنٍ عَنِ الشَّعْبِيِّ قَالَ سَمِعْتُ عُرْوَةَ بْنَ أَبِي الْجَعْدِ الْبَارِقِيَّ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْخَيْلُ مَعْقُودٌ فِي نَوَاصِيهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ الْأَجْرُ وَالْمَغْنَمُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Hushain] dari [Asy Sya'bi] ia berkata, saya mendengar [Urwah bin Abul Ja'd Al Bariqi] berkata; Saya mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Pada ubun-ubun kuda itu, terdapat kebaikan, yaitu berupa pahala dan harta ghanimah hingga hari kiamat.\""
            },
            {
                "number": 2431,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا حُصَيْنٌ عَنِ الشَّعْبِيِّ أَخْبَرَنَا عَدِيُّ بْنُ حَاتِمٍ قَالَلَمَّا نَزَلَتْ هَذِهِ الْآيَةُ{ وَكُلُوا وَاشْرَبُوا حَتَّى يَتَبَيَّنَ لَكُمْ الْخَيْطُ الْأَبْيَضُ مِنْ الْخَيْطِ الْأَسْوَدِ }قَالَ عَمَدْتُ إِلَى عِقَالَيْنِ أَحَدُهُمَا أَسْوَدُ وَالْآخَرُ أَبْيَضُ فَجَعَلْتُهُمَا تَحْتَ وِسَادِي قَالَ ثُمَّ جَعَلْتُ أَنْظُرُ إِلَيْهِمَا فَلَا تُبِينُ لِي الْأَسْوَدَ مِنْ الْأَبْيَضِ وَلَا الْأَبْيَضَ مِنْ الْأَسْوَدِ فَلَمَّا أَصْبَحْتُ غَدَوْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرْتُهُ بِالَّذِي صَنَعْتُ فَقَالَ إِنْ كَانَ وِسَادُكَ إِذًا لَعَرِيضٌ إِنَّمَا ذَلِكَ بَيَاضُ النَّهَارِ مِنْ سَوَادِ اللَّيْلِ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Hushain] dari [Asy Sya'bi] telah mengabarkan kepada kami [Adi bin Hatim] ia berkata; Ketika ayat ini turun: \"Dan makan minumlah hingga terang bagimu benang putih dari benang hitam, yaitu fajar.\" (QS. Albaqarah 187), Saya pun pergi mengambil dua benang yang satu berwarna putih sedang yang satunya lagi berwarna hitam. Lalu saya meletakkan di bawah bantalku, kemudian saya mencoba melihatnya, namun bagiku tidak tampak jelas antara yang putih dan hitam atau pun sebaliknya. Pada pagi harinya, saya mendatangi Rasulullah shallallahu 'alaihi wasallam dan mengabarkan hal apa yang telah saya perbuat. Maka beliau bersabda: \"Kalau begitu, bantalmu panjang sekali. Hanyasanya maksudnya adalah putihnya siang daripada kegelapan malam.\""
            },
            {
                "number": 2432,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا مُجَالِدٌ وَزَكَرِيَّا وَغَيْرُهُمَا عَنِ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ مَا أَصَابَ بِحَدِّهِ فَخَرَقَ فَكُلْ وَمَا أَصَابَ بِعَرْضِهِ فَقَتَلَ فَإِنَّهُ وَقِيذٌ فَلَا تَأْكُلْ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Mujalid] dan [Zakariya] dan selain keduanya, dari [Asy Sya'bi] dari [Adi bin Hatim] ia berkata; Saya bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang Shaidul Mi'radl (hewan buruan yang terkena lemparan tombak, namun yang mengenai sasaran bukan bagian tajamnya). Maka beliau menjawab: \"Hewan buruan yang terkena oleh bagian ujung (mata) tombak, kemudian mati, maka makanlah. Dan hewan yang terkena oleh bagian tombak yang lain sehingga mati, maka ia adalah Waqidz (hewan yang dibunuh dengan menggunakan alat yang tidak tajam alais tumpul), karena itu, janganlah kamu memakannya.\""
            },
            {
                "number": 2433,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ خَيْثَمَةَ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْكُمْ مِنْ أَحَدٍ إِلَّا سَيُكَلِّمُهُ اللَّهُ عَزَّ وَجَلَّ لَيْسَ بَيْنَهُ وَبَيْنَهُ تَرْجُمَانٌ ثُمَّ يَنْظُرُ أَيْمَنَ مِنْهُ فَلَا يَرَى إِلَّا شَيْئًا قَدَّمَهُ ثُمَّ يَنْظُرُ أَشْأَمَ مِنْهُ فَلَا يَرَى إِلَّا شَيْئًا قَدَّمَهُ ثُمَّ يَنْظُرُ تِلْقَاءَ وَجْهِهِ فَتَسْتَقْبِلُهُ النَّارُ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اسْتَطَاعَ مِنْكُمْ أَنْ يَقِيَ وَجْهَهُ النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ فَلْيَفْعَلْ",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] Telah menceritakan kepada kami [Al A'masy] dari [Khaitsamah] dari [Adi bin Hatim] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak seorang pun dari kalian, kecuali Allah 'azza wajalla akan mengajaknya berbicara, sementara tidak ada perantara antara dia dan Allah. Kemudian ia melihat ke sebelah kirinya, maka ia pun tidak melihat, kecuali sesuatu yang telah ia perbuatnya. Dan ia melihat ke sebelah kanannya, maka ia pun tidak melihat kecuali sesuatu yang telah diperbuatnya. Kemudian ia melihat ke arah depan, dan ternyata neraka telah berada di depannya.\" kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa di antara kalian yang mampu menyelamatkan wajahnya dari api neraka meskipun hanya dengan satu biji kurma, maka lakukanlah.\""
            },
            {
                "number": 2434,
                "arab": "حَدَّثَنَا يَحْيَى حَدَّثَنَا شُعْبَةُ حَدَّثَنَا سِمَاكٌ عَنْ مُرَيِّ بْنِ قَطَرِىٍّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أَبِي كَانَ يَصِلُ الرَّحِمَ وَيَقْرِي الضَّيْفَ وَيَفْعَلُ كَذَا قَالَ إِنَّ أَبَاكَ أَرَادَ شَيْئًا فَأَدْرَكَهُ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَرْمِي الصَّيْدَ وَلَا أَجِدُ مَا أُذَكِّيهِ بِهِ إِلَّا الْمَرْوَةَ وَالْعَصَا قَالَ أَمَرَّ الدَّمَ بِمَا شِئْتَ ثُمَّ اذْكُرْ اسْمَ اللَّهِ عَزَّ وَجَلَّ قُلْتُ طَعَامٌ مَا أَدَعُهُ إِلَّا تَحَرُّجًا قَالَ مَا ضَارَعْتَ فِيهِ نَصْرَانِيَّةً فَلَا فَدَعْهُ",
                "id": "Telah menceritakan kepada kami [Yahya] Telah menceritakan kepada kami [Syu'bah] Telah menceritakan kepada kami [Simak] dari [Muray bin Qathari] dari [Adi bin Hatim] ia berkata; Saya berkata, \"Wahai Rasulullah, sesungguhnya, bapakku telah menyambung shilaturahim, ia juga memuliakan tamu dan juga berbuat ini dan itu.\" beliau bersabda: \"Sesungguhya bapakmu menginginkan sesuatu, dan ia pun mendapatkannya.\" Saya berkata lagi, \"Wahai Rasulullah, jika saya melempar hewan buruan, namun saya tidak mendapatkan sesuatu yang dapat saya gunakan untuk menyembelihnya kecuali batu runcing dan sebatang kayu, bagaimana tanggapan baginda?.\" Beliau bersabda: \"Alirkanlah darahnya dengan menggunakan alat apa saja, kemudian bacalah nama Allah 'azza wajalla.\" Saya berkata, \"Bagaimana tanggapan anda tentang makanan yang saya tidak bisa meninggalkannya, selain karena terpaksa?.\" Beliau bersabda; \"Sesuatu yang kamu lakukan dan menyerupai orang Nasrani, itu jangan, tinggalkanlah itu semua.\""
            },
            {
                "number": 2435,
                "arab": "حَدَّثَنَا يَحْيَى عَنْ مُجَالِدٍ أَخْبَرَنِي عَامِرٌ حَدَّثَنِي عَدِيُّ بْنُ حَاتِمٍ قَالَعَلَّمَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّلَاةَ وَالصِّيَامَ قَالَ صَلِّ كَذَا وَكَذَا وَصُمْ فَإِذَا غَابَتْ الشَّمْسُ فَكُلْ وَاشْرَبْ حَتَّى يَتَبَيَّنَ لَكَ الْخَيْطُ الْأَبْيَضُ مِنْ الْخَيْطِ الْأَسْوَدِ وَصُمْ ثَلَاثِينَ يَوْمًا إِلَّا أَنْ تَرَى الْهِلَالَ قَبْلَ ذَلِكَ فَأَخَذْتُ خَيْطَيْنِ مِنْ شَعْرٍ أَسْوَدَ وَأَبْيَضَ فَكُنْتُ أَنْظُرُ فِيهِمَا فَلَا يَتَبَيَّنُ لِي فَذَكَرْتُ ذَلِكَ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَضَحِكَ وَقَالَ يَا ابْنَ حَاتِمٍ إِنَّمَا ذَاكَ بَيَاضُ النَّهَارِ مِنْ سَوَادِ اللَّيْلِ",
                "id": "Telah menceritakan kepada kami [Yahya] dari [Majalid] telah mengabarkan kepadaku [Amir] telah menceritakan kepadaku [Adi bin Hatim] ia berkata; Rasulullah shallallahu 'alaihi wasallam mengajariku sholat dan puasa. Beliau bersabda: \"Tunaikanlah sholat pada saat begini dan begitu. Kemudian berpuasalah, dan ketika matahari telah terbenam, maka makan dan minumlah kamu hingga tampak bagimu benang putih daripada benang hitam. Berpuasalah selama tiga puluh hari, kecuali sebelum itu, kamu telah melihat Hilal.\" Akhirnya saya pun mengambil dua helai rambut yang hitam dan yang putih, lalu saya pun melihat kepada keduanya, namun belum juga tampak bagiku. Maka saya mengungkapkan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, beliau pu tertawa dan bersabda: \"Wahai ibnu Hatim, maksud sebenarnya adalah putihnya siang daripada kegelapan malam.\""
            },
            {
                "number": 2436,
                "arab": "حَدَّثَنَا يَحْيَى حَدَّثَنَا شُعْبَةُ حَدَّثَنَا أَبُو إِسْحَاقَ عَنْ عَبْدِ اللَّهِ بْنِ مَعْقِلٍ قَالَ سَمِعْتُ عَدِيَّ بْنَ حَاتِمٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ",
                "id": "Telah menceritakan kepada kami [Yahya] Telah menceritakan kepada kami [Syu'bah] Telah menceritakan kepada kami [Abu Ishaq] dari [Abdullah bin Ma'qil] ia berkata, saya mendengar [Adi bin Hatim] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jauhkanlah diri kalian dari api neraka, meskipun hanya dengan sebiji kurma.\""
            },
            {
                "number": 2437,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ عَنِ ابْنِ عَوْنٍ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ ابْنِ حُذَيْفَةَ قَالَ كُنْتُ أُحَدَّثُ حَدِيثًا عَنْ عَدِيِّ بْنِ حَاتِمٍ فَقُلْتُ هَذَا عَدِيٌّ فِي نَاحِيَةِ الْكُوفَةِ فَلَوْ أَتَيْتُهُ فَكُنْتُ أَنَا الَّذِي أَسْمَعُهُ مِنْهُ فَأَتَيْتُهُ فَقُلْتُ إِنِّي كُنْتُ أُحَدَّثُ عَنْكَ حَدِيثًا فَأَرَدْتُ أَنْ أَكُونَ أَنَا الَّذِي أَسْمَعُهُ مِنْكَ قَالَلَمَّا بَعَثَ اللَّهُ عَزَّ وَجَلَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَرْتُ مِنْهُ حَتَّى كُنْتُ فِي أَقْصَى أَرْضِ الْمُسْلِمِينَ مِمَّا يَلِي الرُّومَ قَالَ فَكَرِهْتُ مَكَانِي الَّذِي أَنَا فِيهِ حَتَّى كُنْتُ لَهُ أَشَدَّ كَرَاهِيَةً لَهُ مِنِّي مِنْ حَيْثُ جِئْتُ قَالَ قُلْتُ لَآتِيَنَّ هَذَا الرَّجُلَ فَوَاللَّهِ إِنْ كَانَ صَادِقًا فَلَأَسْمَعَنَّ مِنْهُ وَإِنْ كَانَ كَاذِبًا مَا هُوَ بِضَائِرِي قَالَ فَأَتَيْتُهُ وَاسْتَشْرَفَنِي النَّاسُ وَقَالُوا عَدِيُّ بْنُ حَاتِمٍ عَدِيُّ بْنُ حَاتِمٍ قَالَ أَظُنُّهُ قَالَ ثَلَاثَ مِرَارٍ قَالَ فَقَالَ لِي يَا عَدِيُّ بْنَ حَاتِمٍ أَسْلِمْ تَسْلَمْ قَالَ قُلْتُ إِنِّي مِنْ أَهْلِ دِينٍ قَالَ يَا عَدِيُّ بْنَ حَاتِمٍ أَسْلِمْ تَسْلَمْ قَالَ قُلْتُ إِنِّي مِنْ أَهْلِ دِينٍ قَالَهَا ثَلَاثًا قَالَ أَنَا أَعْلَمُ بِدِينِكَ مِنْكَ قَالَ قُلْتُ أَنْتَ أَعْلَمُ بِدِينِي مِنِّي قَالَ نَعَمْ قَالَ أَلَيْسَ تَرْأَسُ قَوْمَكَ قَالَ قُلْتُ بَلَى قَالَ فَذَكَرَ مُحَمَّدٌ الرَّكُوسِيَّةَ قَالَ كَلِمَةً الْتَمَسَهَا يُقِيمُهَا فَتَرَكَهَا قَالَ فَإِنَّهُ لَا يَحِلُّ فِي دِينِكَ الْمِرْبَاعُ قَالَ فَلَمَّا قَالَهَا تَوَاضَعَتْ مِنِّي هُنَيَّةٌ قَالَ وَإِنِّي قَدْ أَرَى أَنَّ مِمَّا يَمْنَعُكَ خَصَاصَةٌ تَرَاهَا مِمَّنْ حَوْلِي وَإِنَّ النَّاسَ عَلَيْنَا أَلْبًا وَاحِدًا هَلْ تَعْلَمُ مَكَانَ الْحِيرَةِ قَالَ قُلْتُ قَدْ سَمِعْتُ بِهَا وَلَمْ آتِهَا قَالَ لَتُوشِكَنَّ الظَّعِينَةُ أَنْ تَخْرُجَ مِنْهَا بِغَيْرِ جِوَارٍ حَتَّى تَطُوفَ قَالَ يَزِيدُ بْنُ هَارُونَ جَوْرٍ وَقَالَ يُونُسُ عَنْ حَمَّادٍ جَوَازٍ ثُمَّ رَجَعَ إِلَى حَدِيثِ عَدِيِّ بْنِ حَاتِمٍ حَتَّى تَطُوفَ بِالْكَعْبَةِ وَلَتُوشِكَنَّ كُنُوزُ كِسْرَى بْنِ هُرْمُزَ أَنْ تُفْتَحَ قَالَ قُلْتُ كِسْرَى بْنُ هُرْمُزَ قَالَ كِسْرَى بْنُ هُرْمُزَ قَالَ قُلْتُ كِسْرَى بْنُ هُرْمُزَ قَالَ كِسْرَى بْنُ هُرْمُزَ ثَلَاثَ مَرَّاتٍ وَلَيُوشِكَنَّ أَنْ يَبْتَغِيَ مَنْ يَقْبَلُ مَالَهُ مِنْهُ صَدَقَةً فَلَا يَجِدُ قَالَ فَلَقَدْ رَأَيْتُ ثِنْتَيْنِ قَدْ رَأَيْتُ الظَّعِينَةَ تَخْرُجُ مِنْ الْحِيرَةِ بِغَيْرِ جِوَارٍ حَتَّى تَطُوفَ بِالْكَعْبَةِ وَكُنْتُ فِي الْخَيْلِ الَّتِي غَارَتْ وَقَالَ يُونُسُ عَنْ حَمَّادٍ أَغَارَتْ عَلَى الْمَدَائِنِ وَايْمُ اللَّهِ لَتَكُونَنَّ الثَّالِثَةُ إِنَّهُ لَحَدِيثُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنِيهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Adi] dari [Ibnu 'Aun] dari [Muhammad bin Sirin] dari [Ibnu Hudzaifah] ia berkata, saya menceritakan suatu hadits dari [Adi bin Hatim]. Saya berkata; \"Akulah Adi yang berada di ujung Kufah, sekiranya saya mendatanginya, maka sayalah yang akan mendengar langsung darinya.\" Maka saya pun mendatanginya dan berkata, \"Sesungguhnya saya menceritakan suatu hadits darimu, dan saya ingin mendengarnya langsung darimu.\" Ia berkata; Ketika Allah 'azza wajalla mengutus Nabi shallallahu 'alaihi wasallam, saya lari darinya hingga saya berada di penghujung tanah kaum muslimin mendekati Romawi. Lalu saya merasa benci berada di tempat yang aku tempati, hingga kebencianku terhadapnya melebihi kebencianku terhadap tempatku dahulu. Akhirnya saya berkata, \"Saya akan benar-benar mendatangi laki-laki ini. Demi Allah, jika ia adalah seorang yang Shadiq (benar), saya benar-benar akan mendengarnya. Namun, jika ia adalah seorang pendusta, maka ia tidak akan mampu melukaiku.\" Maka saya mendatanginya dan orang -orang pun mengawasiku. Mereka berkata, \"Tolong awasi si Adi bin Hatim, Tolong awasi si Adi bin Hatim.\" Saya menduga mereka mengatakannya hingga tiga kali. Kemudian beliau bersabda padaku: \"Wahai Adi, masuk Islamlah, niscaya kamu akan selamat.\" Saya berkata, \"Sesungguhnya saya adalah seorang yang telah beragama.\" Beliau bersabda lagi: \"Wahai Adi, masuk Islamlah, niscaya kamu akan selamat.\" Saya berkata, \"Sesungguhnya saya adalah seorang yang telah beragama.\" Beliau mengatakannya hingga tiga kali. Kemudian beliau bersabda: \"Sesungguhnya saya lebih tahu tentang agamamu daripada kamu.\" Saya bertanya, \"Anda lebih tahu tentang agamaku daripada aku?\" beliau menjawab: \"Ya.\" Beliau bertanya lagi: \"Bukankah kamu memimpin kaummu?\" saya menjawab, \"Ya, benar.\" Kata Adi, lantas nabi Muhammad menyebut-nyebut agama Rakusiyah, yaitu sebuah agama campuran antara majusi dan Kristen. Kata Adi, itulah sebuah istilah yang beliau ambil, beliau luruskan, lantas beliau tinggalkan. Kemudian beliau bersabda: \"Sesungguhnya di dalam agamamu tidak dihalalkan seperempat dari harta ghanimah.\" Saat beliau mengatakannya, saya pun diam beberapa saat. Beliau bersabda lagi: \"Dan sungguh, saya melihat bahwa salah satu yang menghalangimu (untuk memeluk Islam) adalah kesusahan yang dialami oleh orang di sekelilingku. Dan sesungguhnya orang-orang merupakan satu koalisi yang bersatu padu memusuhi kami. Apakah kamu tahu daerah Al Hirah?\" saya menjawab, \"Saya pernah mendengarnya, namun saya belum ke sana.\" Beliau bersabda: \"Nyaris aka nada seorang wanita berangkat darinya dengan tanpa perlindungan, hingga kamu melakukan thawaf -Yazid bin Harun berkata dengan redaksi; 'dengan tanpa penganiayaan'. Sedang Yunus berkata, dari Hammad dengan redaksi; 'dengan tanpa dibolehkan'. Kemudian ia kembali pada hadits Adi bin Hatim, yakni; Hingga kamu melakukan thawaf- di Ka'bah. Dan diprediksikan Istana Kisra bin Hurmus akan ditaklukkan.\" Saya balik bertanya, \"Kisra bin Hurmuz?\" beliau menjawab: \"Ya, benar, Kisra bin Hurmuz.\" Saya balik bertanya lagi, \"Kisra bin Hurmuz?\" beliau menjawab: \"Ya, benar, Kisra bin Hurmuz.\" Saya mengulanginya hingga tiga kali. Beliau bersabda lagi: \"Dan diprediksikan akan datang sebuah masa yang ketika itu seseorang berangan-angan agar ada yang mau menerima sedekah darinya, namun ia tidak mendapatkannya.\" Adi bin Hatim berkata; Sungguh, saya telah melihat dua hal (dari apa yang beliau sabdakan). Saya telah melihat seorang wanita yang melakukan perjalanan, ia berangkat dari Hirah tanpa seorang pengawal pun hingga ia melakukan thawaf di Ka'bah, sementara saya berada di atas kuda yang sedang menyerbu pasukan musuh. -Yunus berkata, dari Hammad- (Kuda) yang menyerbu Mada'in. Demi Allah, yang ketiga benar-benar akan terjadi. Sungguh, itu adalah hadits Rasulullah shallallahu 'alaihi wasallam yang telah beliau ceritakan kepadaku."
            },
            {
                "number": 2438,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو يُحَدِّثُ عَنْ عَدِيِّ بْنِ حَاتِمٍأَنَّ رَجُلًا جَاءَهُ يَسْأَلُهُ عَنْ شَيْءٍ اسْتَقَلَّهُ فَحَلَفَ ثُمَّ قَالَ لَوْلَا أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ حَلَفَ عَلَى يَمِينٍ فَرَأَى غَيْرًا خَيْرًا مِنْهَا فَلْيَأْتِ الَّذِي هُوَ خَيْرٌ وَلْيُكَفِّرْ عَنْ يَمِينِهِقَالَ أَبُو عَبْد الرَّحْمَنِ هَذَا حَدِيثٌ مَا سَمِعْتُهُ قَطُّ مِنْ أَحَدٍ إِلَّا مِنْ أَبِي",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Amru bin Murrah] ia berkata, saya mendengar [Abdullah bin Amr] menceritakan dari [Adi bin Hatim] bahwa seorang laki-laki mendatanginya dan meminta sesuatu yang ia anggap hanya sedikit. Lalu ia bersumpah (untuk tidak memberikannya). Lantas ia berkata; \"Duh sekiranya aku tidak mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang bersumpah, kemudian ia melihat sesuatu yang lebih baik darinya, maka hendaklah ia lakukan yang lebih baik dan membayar kaffarat sumpahnya.\" Abu Abdurrahman berkata; Saya tidak pernah mendengar hadits ini dari seorang pun, kecuali dari bapakku."
            },
            {
                "number": 2439,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ سِمَاكَ بْنَ حَرْبٍ قَالَ سَمِعْتُ عَبَّادَ بْنَ حُبَيْشٍ يُحَدِّثُ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَجَاءَتْ خَيْلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ قَالَ رُسُلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا بِعَقْرَبٍ فَأَخَذُوا عَمَّتِي وَنَاسًا قَالَ فَلَمَّا أَتَوْا بِهِمْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَصَفُّوا لَهُ قُلْتُ يَا رَسُولَ اللَّهِ نَأَى الْوَافِدُ وَانْقَطَعَ الْوَلَدُ وَأَنَا عَجُوزٌ كَبِيرَةٌ مَا بِي مِنْ خِدْمَةٍ فَمُنَّ عَلَيَّ مَنَّ اللَّهُ عَلَيْكَ قَالَ مَنْ وَافِدُكِ قَالَتْ عَدِيُّ بْنُ حَاتِمٍ قَالَ الَّذِي فَرَّ مِنْ اللَّهِ وَرَسُولِهِ قَالَتْ فَمَنَّ عَلَيَّ قَالَتْ فَلَمَّا رَجَعَ وَرَجُلٌ إِلَى جَنْبِهِ نَرَى أَنَّهُ عَلِىٌّ قَالَ سَلِيهِ حِمْلَانًا قَالَ فَسَأَلَتْهُ فَأَمَرَ لَهَا قَالَتْ فَأَتَتْنِي فَقَالَتْ لَقَدْ فَعَلْتَ فَعْلَةً مَا كَانَ أَبُوكَ يَفْعَلُهَا قَالَتْ ائْتِهِ رَاغِبًا أَوْ رَاهِبًا فَقَدْ أَتَاهُ فُلَانٌ فَأَصَابَ مِنْهُ وَأَتَاهُ فُلَانٌ فَأَصَابَ مِنْهُ قَالَ فَأَتَيْتُهُ فَإِذَا عِنْدَهُ امْرَأَةٌ وَصِبْيَانٌ أَوْ صَبِيٌّ فَذَكَرَ قُرْبَهُمْ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَرَفْتُ أَنَّهُ لَيْسَ مُلْكُ كِسْرَى وَلَا قَيْصَرَ فَقَالَ لَهُ يَا عَدِيُّ بْنَ حَاتِمٍ مَا أَفَرَّكَ أَنْ يُقَالَ لَا إِلَهَ إِلَّا اللَّهُ فَهَلْ مِنْ إِلَهٍ إِلَّا اللَّهُ مَا أَفَرَّكَ أَنْ يُقَالَ اللَّهُ أَكْبَرُ فَهَلْ شَيْءٌ هُوَ أَكْبَرُ مِنْ اللَّهِ عَزَّ وَجَلَّ قَالَ فَأَسْلَمْتُ فَرَأَيْتُ وَجْهَهُ اسْتَبْشَرَ وَقَالَ إِنَّ الْمَغْضُوبَ عَلَيْهِمْ الْيَهُودُ وَ الضَّالِّينَ النَّصَارَي ثُمَّ سَأَلُوهُ فَحَمِدَ اللَّهَ تَعَالَى وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ أَمَّا بَعْدُ فَلَكُمْ أَيُّهَا النَّاسُ أَنْ تَرْضَخُوا مِنْ الْفَضْلِ ارْتَضَخَ امْرُؤٌ بِصَاعٍ بِبَعْضِ صَاعٍ بِقَبْضَةٍ بِبَعْضِ قَبْضَةٍ قَالَ شُعْبَةُ وَأَكْثَرُ عِلْمِي أَنَّهُ قَالَ بِتَمْرَةٍ بِشِقِّ تَمْرَةٍ إِنَّ أَحَدَكُمْ لَاقِي اللَّهَ عَزَّ وَجَلَّ فَقَائِلٌ مَا أَقُولُ أَلَمْ أَجْعَلْكَ سَمِيعًا بَصِيرًا أَلَمْ أَجْعَلْ لَكَ مَالًا وَوَلَدًا فَمَاذَا قَدَّمْتَ فَيَنْظُرُ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ وَعَنْ يَمِينِهِ وَعَنْ شِمَالِهِ فَلَا يَجِدُ شَيْئًا فَمَا يَتَّقِي النَّارَ إِلَّا بِوَجْهِهِ فَاتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ فَإِنْ لَمْ تَجِدُوهُ فَبِكَلِمَةٍ لَيِّنَةٍ إِنِّي لَا أَخْشَى عَلَيْكُمْ الْفَاقَةَ لَيَنْصُرَنَّكُمْ اللَّهُ تَعَالَى وَلَيُعْطِيَنَّكُمْ أَوْ لَيَفْتَحَنَّ لَكُمْ حَتَّى تَسِيرَ الظَّعِينَةُ بَيْنَ الْحِيرَةِ ويَثْرِبَ أَوْ أَكْثَرَ مَا تَخَافُ السَّرَقَ عَلَى ظَعِينَتِهَاقَالَ مُحَمَّدُ بْنُ جَعْفَرٍ ثَنَاهُ شُعْبَةُ مَا لَا أُحْصِيهِ وَقَرَأْتُهُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] ia berkata, saya mendengar [Simak bin Harb] berkata, saya mendengar [Abbad bin Khubaisy] menceritakan dari [Adi bin Hatim] ia berkata; Suatu ketika datanglah pasukan berkuda milik Rasulullah shallallahu 'alaihi wasallam atau ia mengatakan; para utusan Rasulullah shallallahu 'alaihi wasallam, yang ketika itu saya berada di 'Aqrab. Mereka kemudian menangkap (dan menawan) bibiku dan beberapa orang. Ketika mereka (pasukan berkuda muslimin) membawa para tawanan kepada Rasulullah shallallahu 'alaihi wasallam, mereka pun dibariskan di hadapan beliau. Saya berkata, \"Wahai Rasulullah, utusan kami telah pergi jauh, dan anak-anak pun terputus dari keluarganya, sementara saya adalah seorang wanita tua yang lemah. Tak bisa melayani apa-apa. Berbuat baiklah padaku, semoga Allah berbuat baik pada Anda.\" Beliau bertanya: \"Siapakah utusanmu?\" wanita itu menjawab, \" Itu si 'Adi bin Hatim.\" Beliau bersabda: \"Orang yang telah lari dari Allah dan Rasul-Nya?\" wanita itu berkata, \"Berbuat baiklah padaku.\" Ketika seorang laki-laki kembali ke sisinya -kami lihat laki-laki itu adalah Ali-, ia berkata, \"Mintalah biaya kepada beliau.\" (Adi bin Hatim) Berkata; kemudian wanita itu pun meminta kepada beliau dan beliau pun memerintahkan untuk memberinya. Kemudian wanita itu mendatangiku dan berkata, \"Kamu telah berbuat sesuatu yang sebelumnya tidak pernah dilakukan oleh bapakmu. Datangilah ia denga perasaan suka atau benci. Dan sungguh, si Fulan telah mendatanginya dan ia pun mendapatkan bagian darinya. Dan si Fulan juga telah mendatanginya dan ia pun mendapatkan bagian darinya.\" (Adi) Berkata; Akhirnya aku pun mendatangi beliau dan ternyata di sisi beliau ada wanita dan anak-anak kecil. Ia menyebutkan kedekatan mereka dengan Nabi shallallahu 'alaihi wasallam, akhirnya aku tahu, bahwa watak beliau bukan seperti raja Kisra dan bukan pula Kaisar. Kemudian beliau bertanya kepadanya: \"Wahai Adi bin Hatim, apa yang menyebabkanmu enggan untuk diikrarkan bahwa, tidak ada Tuhan yang berhak disembah selain Allah? Apakah ada Tuhan lain selain Allah? Apakah yang menyebabkanmu enggan untuk dikatakan, 'ALLAHU AKBAR (Allah Maha Besar)? Adakah yang lebih besar dari Allah 'azza wajalla?\" Akhirnya (Adi bin Hatim) Berkata; Maka saya pun memeluk Islam. Dan saya pun melihat wajah beliau dipenuhi kegembiraan. Kemudian beliau bersabda: \"Sesungguhnya yang dimaksud mereka yang dimurkai adalah kaum Yahudi, dan yang dimaksud mereka yang tersesat adalah kaum Nasrani.\" Mereka (orang-orang yang berada di sekeliling beliau) pun meminta sesuatu kepada beliau. Maka beliau memuji Allah, dan membaca puji-pujian atas-Nya. Setelah itu beliau bersabda: \"Wahai sekalian manusia, hendaklah kalian memberi dari kelebihan harta (yang dikaruniakan kepada kalian). Seorang yang mempunyai satu sha' memberi setengah sha', yang mempunyai satu genggam memberi setengah gengam, -Syu'bah berkata; sejauh apa aku ketahui, beliau berkata- (bahkan) yang memiliki satu biji kurma, memberi dengan setengah biji kurma. Sesungguhnya salah seorang dari kalian akan menjumpai Allah 'azza wajalla, sehingga Dia pun akan bertanya, 'Bukankah Aku telah menjadikanmu mendengar dan melihat? Bukankah Aku telah mengaruniakanmu harta dan anak? Lalu apa yang telah kamu persembahkan? ' Ia pun melihat ke depannya, ke belakang, ke samping kanannya dan ke samping kirinya, namun ia tidak mendapatkan sesuatu pun. Dan tidak ada yang bisa menjaga dari api neraka selain beramal karena mencari wajah-Nya. Karena itu, jauhkanlah diri kalian dari neraka meskipun hanya dengan setengah biji kurma. Dan jika kalian tidak mendapati, maka hendaklah berkata-kata dengan kalimat yang baik. Sesungguhnya saya tidak khawatir kefakiran akan menimpa kalian, Allah benar-benar akan menolong dan memberi kalian atau benar-benar akan membuka rezeki untuk kalian hingga seorang wanita melakukan safar dengan hewan tunggangannya antara Hirat dan Yatsrib -atau dengan redaksi- Yang banyak kalian khawatirkan yaitu pencurian terhadap wanita penggangnya.\" Muhammad bin Ja'far berkata; Syu'bah menceritakannya kepada kami hingga saya tidak lagi menghitungnya (seberapa kali ia menceritakannya), dan saya telah membacakan hadits itu kepadanya."
            },
            {
                "number": 2440,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ تَمِيمِ بْنِ طَرَفَةَ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَجَاءَ رَجُلَانِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَشَهَّدَ أَحَدُهُمَا فَقَالَ مَنْ يُطِعْ اللَّهَ وَرَسُولَهُ فَقَدْ رَشَدَ وَمَنْ يَعْصِهِمَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِئْسَ الْخَطِيبُ أَنْتَ قُمْ",
                "id": "Telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dari [Abdul Aziz bin Rufai'] dari [Tamim bin Tharafah] dari [Adi bin Hatim] ia berkata; Dua orang laki-laki mendatangi Rasulullah shallallahu 'alaihi wasallam. Kemudian salah seorang dari bertasyahadat lantas berkata, \"Barangsiapa yang mentaati Allah dan Rasul-Nya, maka sungguh ia telah mendapat petunjuk. Dan siapa yang bermaksiat kepada keduanya...\" maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Seburuk-buruk khatib adalah kamu, berdirilah.\""
            },
            {
                "number": 2441,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا الشَّيْبَانِيُّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فِي شَهْرِ رَمَضَانَ فَلَمَّا غَابَتْ الشَّمْسُ قَالَ انْزِلْ يَا فُلَانُ فَاجْدَحْ لَنَا قَالَ يَا رَسُولَ اللَّهِ عَلَيْكَ نَهَارٌ قَالَ انْزِلْ فَاجْدَحْ قَالَ فَفَعَلَ فَنَاوَلَهُ فَشَرِبَ فَلَمَّا شَرِبَ أَوْمَأَ بِيَدِهِ إِلَى الْمَغْرِبِ فَقَالَ إِذَا غَرَبَتْ الشَّمْسُ هَاهُنَا جَاءَ اللَّيْلُ مِنْ هَاهُنَا فَقَدْ أَفْطَرَ الصَّائِمُ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Asy Syaibani] dari [Abdullah bin Abu Aufa] ia berkata; Kami pernah bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan pada bulan ramadhan. Ketika matahari terbenam beliau bersabda: \"Wahai Fulan, sediakanlah minuman untuk kami.\" Ia berkata, \"Wahai Rasulullah, hari masih terang.\" Beliau bersabda: \"Sediakanlah minuman untuk kami.\" Maka ia pun menyiapkannya dan beliau minum. Setelah itu, beliau memberi isyarat dengan tangannya ke arah barat seraya bersabda: \"Jika matahari telah terbenam di sebelah ini, maka malam telah tiba dari sini dan orang yang berpuasa pun telah berbuka.\""
            },
            {
                "number": 2442,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَنْبَأَنَا الشَّيْبَانِيُّ عَنْ مُحَمَّدِ بْنِ أَبِي الْمُجَالِدِ مَوْلَى بَنِي هَاشِمٍ قَالَأَرْسَلَنِي ابْنُ شَدَّادٍ وَأَبُو بُرْدَةَ فَقَالَا انْطَلِقْ إِلَى ابْنِ أَبِي أَوْفَى فَقُلْ لَهُ إِنَّ عَبْدَ اللَّهِ بْنَ شَدَّادٍ وَأَبَا بُرْدَةَ يُقْرِئَانِكَ السَّلَامَ وَيَقُولَانِ هَلْ كُنْتُمْ تُسَلِّفُونَ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْبُرِّ وَالشَّعِيرِ وَالزَّبِيبِ قَالَ نَعَمْ كُنَّا نُصِيبُ غَنَائِمَ فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنُسَلِّفُهَا فِي الْبُرِّ وَالشَّعِيرِ وَالتَّمْرِ وَالزَّبِيبِ فَقُلْتُ عِنْدَ مَنْ كَانَ لَهُ زَرْعٌ أَوْ عِنْدَ مَنْ لَيْسَ لَهُ زَرْعٌ فَقَالَ مَا كُنَّا نَسْأَلُهُمْ عَنْ ذَلِكَ قَالَ وَقَالَا لِي انْطَلِقْ إِلَى عَبْدِ الرَّحْمَنِ بْنِ أَبْزَى فَاسْأَلْهُ قَالَ فَانْطَلَقَ فَسَأَلَهُ فَقَالَ مِثْلَ مَا قَالَ ابْنُ أَبِي أَوْفَىقَالَ وَكَذَا حَدَّثَنَاهُ أَبُو مُعَاوِيَةَ عَنْ زَائِدَةَ عَنِ الشَّيْبَانِيِّ قَالَ وَالزَّيْتِ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah memberitakan kepada kami [Asy Syaibani] dari [Muhammad bin Abul Mujalid] bekas budak Bani Mujalid, ia berkata; Ibnu Syaddad dan Abu Burdah mengutusku, mereka berdua berkata, \"Pergi dan temuilah [Ibnu Abu Aufa] kemudian katakan bahwa, Abdullah bin Syaddad dan Abu Burdah menyampaikan salam atasmu, dan keduanya bertanya, 'Apakah pada masa Rasulullah shallallahu 'alaihi wasallam, kalian memberi pinjaman harta pada pertanian gandum, dan anggur?\" ia menjawab, \"Ya. Kami pernah mendapatkan harta ghanimah pada masa Rasulullah shallallahu 'alaihi wasallam lalu kami menjadikannya sebagai pinjaman pada usaha gandum, kurma dan anggur.\" Saya bertanya, \"Kepada siapa?\" ia menjawab, \"Bagi yang memiliki lahan pertanian atau juga bagi yang tidak memiliki lahan.\" Ia berkata, \"Kami tidak menanyakan yang itu.\" Ibnu Abu Aufa berkata, \"Temuilah [Abdurrahman bin Abza] dan bertanyalah padanya.\" ia pun pergi dan bertanya kepadanya, maka Abdurrahman pun memberikan jawaban sebagai jawaban Ibnu Abu Aufa. Ia pun berkata; Seperti inilah yang telah diceritakan oleh [Abu Mu'awiyah] dari [Za`idah] dari [Asy Syaibani]; Ia berkata; \"Dan (juga) minyak Zaitun.\""
            },
            {
                "number": 2443,
                "arab": "حَدَّثَنَا سُفْيَانُ حَدَّثَنَا أَبُو يَعْفُورٍ عَبْدِيٌّ مَوْلًى لَهُمْ قَالَذَهَبْتُ إِلَى ابْنِ أَبِي أَوْفَى أَسْأَلُهُ عَنْ الْجَرَادِ قَالَ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سِتَّ غَزَوَاتٍ نَأْكُلُ الْجَرَادَ",
                "id": "Telah menceritakan kepada kami [Sufyan] Telah menceritakan kepada kami [Abu Ya'fur] bekas budak mereka, ia berkata; saya menemui [Ibnu Abu Aufa] untuk menanyakan tentang belalang. Ia menjawab, \"Saya telah ikut berperang bersama Rasulullah shallallahu 'alaihi wasallam sebanyak enam kali peperangan, dan kami makan belalang.\""
            },
            {
                "number": 2444,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَاقَ الشَّيْبَانِيِّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي أَوْفَى قَالَكُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَقَالَ لِرَجُلٍ انْزِلْ فَاجْدَحْ لَنَا وَقَالَ سُفْيَانُ مَرَّةً يَا رَسُولَ اللَّهِ قَالَ اجْدَحْ قَالَ يَا رَسُولَ اللَّهِ قَالَ اجْدَحْ فَجَدَحَ فَشَرِبَ فَلَمَّا شَرِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْمَأَ بِيَدِهِ نَحْوَ اللَّيْلِ إِذَا رَأَيْتُمْ اللَّيْلَ قَدْ أَقْبَلَ مِنْ هَاهُنَا فَقَدْ أَفْطَرَ الصَّائِمُ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq Asy Syaibani] ia berkata, saya mendengar [Abdullah bin Abu Aufa] berkata; Kami pernah bersama Nabi shallallahu 'alaihi wasallam dalam suatu perjalanan. Kemudian beliau berkata kepada seseorang: \"Singgah dan siapkanlah minuman untuk kami.\" Dan sekali waktu Sufyan berkata; \"Wahai Rasulullah.\" Beliau bersabda: \"Siapkanlah minuman.\" Ia berkata, \"Wahai Rasulullah.\" Beliau bersabda: \"Siapkanlah minuman.\" Maka ia pun menyediakan minuman. Beliau kemudian minum. Dan setelah Rasulullah shallallahu 'alaihi wasallam minum, beliau menunjuk dengan tangannya ke arah datangnya malam, \"Jika kalian telah melihat malam masuk dari sini, maka orang yang berpuasa sudah mulai berbuka.\""
            },
            {
                "number": 2445,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنِ الشَّيْبَانِيِّ عَنِ ابْنِ أَبِي أَوْفَى قَالَأَصَبْنَا حُمُرًا خَارِجًا مِنْ الْقَرْيَةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكْفِئُوا الْقُدُورَ بِمَا فِيهَافَذَكَرْتُ ذَلِكَ لِسَعِيدِ بْنِ جُبَيْرٍ فَقَالَ إِنَّمَا نَهَى عَنْهَا أَنَّهَا كَانَتْ تَأْكُلُ الْعَذِرَةَ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Asy Syaibani] dari [Ibnu Abu Aufa] ia berkata; Kami mendapatkan harta ghanimah berupa Himar yang muncul dari pedesaan. Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Tumpahkanlah bejana dan beserta isinya.\" Saya pun menuturkan hal itu kepada Sa'id bin Jubair, ia berkata, \"Beliau melarangnya, karena himar itu selalu makan sisa makanan manusia.\""
            },
            {
                "number": 2446,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ أَخْبَرَنَا لَيْثٌ عَنْ مُدْرِكٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَىأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَدْعُو فَيَقُولُ اللَّهُمَّ طَهِّرْنِي بِالثَّلْجِ وَالْبَرَدِ وَالْمَاءِ الْبَارِدِ اللَّهُمَّ طَهِّرْ قَلْبِي مِنْ الْخَطَايَا كَمَا طَهَّرْتَ الثَّوْبَ الْأَبْيَضَ مِنْ الدَّنَسِ وَبَاعِدْ بَيْنِي وَبَيْنَ ذُنُوبِي كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ قَلْبٍ لَا يَخْشَعُ وَمِنْ نَفْسٍ لَا تَشْبَعُ وَدُعَاءٍ لَا يُسْمَعُ وَعِلْمٍ لَا يَنْفَعُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ هَؤُلَاءِ الْأَرْبَعِ اللَّهُمَّ إِنِّي أَسْأَلُكَ عِيشَةً تَقِيَّةً وَمِيتَةً سَوِيَّةً وَمَرَدًّا غَيْرَ مُخْزٍ",
                "id": "Telah menceritakan kepada kami [Isma'il] telah mengabarkan kepada kami [Laits] dari [Mudrik] dari [Abdullah bin Abu Aufa] bahwa Rasulullah shallallahu 'alaihi wasallam berdo'a: \"ALLAHUMMA THAHHIRNII BITS TSALJI WAL BARADI WAL MAA`IL BAARID, ALLAHUMMA THAHHIR QALBI, MINAL KHATHAAYAA KAMAA THAHHARTATS TSAUBAL ABYADLA MINAD DANASI WA BAA'ID BAINII WA BAINA DZUNUUBI KAMAA BAA'ADTA BAINAL MASYRIQI WAL MAGHRIBI, ALLAHUMMA INNI `A'UUDZU BIKA MIN QALBIN LAA YAKHSYA' WA MIN NAFSIN LAA TASYBA' WA DU'AA`IN LAA YUSMA' WA 'ILMIN LAA YANFA'. ALLAHUMMA INNII A'UUDZU BIKA MIN HAA`ULAA`IL ARBA', ALLAHUMMA INNII AS`ALUKA 'IISYATAN TAQIYYAH WA MIITATAN SAWIYYAH WA MARADDAN GHAIRA MUKHZIN (Ya Allah, sucikanlah aku dengan salju dan (air) yang sejuk. Ya Allah sucikanlah hatiku dari segala dosa, sebagaimana Engkau membersihkan kain putih dari kotoran. Dan jauhkanlah antara diriku dengan dosa-dosaku, sebagaimana Engkau telah menjauhkan antara timur dan barat. Ya Allah, aku berlindung kepada-Mu, dari hati yang tak pernah khyusu', nafsu yang tak pernah puas, do'a yang tidak pernah terkabul dan ilmu tidak bermanfaat. Ya Allah, aku berlindung kepada-Mu dari keempat hal itu. Ya Allah, aku meminta pada-Mu kehidupan yang penuh dengan ketaqwaan, kematian yang penuh kedamaian dan tempat kembali tanpa ada kehinaan di dalamnya).\""
            },
            {
                "number": 2447,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا أَيُّوبُ عَنِ القَاسِمِ الشَّيْبَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى قَالَقَدِمَ مُعَاذٌ الْيَمَنَ أَوْ قَالَ الشَّامَ فَرَأَى النَّصَارَى تَسْجُدُ لِبَطَارِقَتِهَا وَأَسَاقِفَتِهَا فَرَوَّأَ فِي نَفْسِهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَقُّ أَنْ يُعَظَّمَ فَلَمَّا قَدِمَ قَالَ يَا رَسُولَ اللَّهِ رَأَيْتُ النَّصَارَى تَسْجُدُ لِبَطَارِقَتِهَا وَأَسَاقِفَتِهَا فَرَوَّأْتُ فِي نَفْسِي أَنَّكَ أَحَقُّ أَنْ تُعَظَّمَ فَقَالَ لَوْ كُنْتُ آمِرًا أَحَدًا أَنْ يَسْجُدَ لِأَحَدٍ لَأَمَرْتُ الْمَرْأَةَ أَنْ تَسْجُدَ لِزَوْجِهَا وَلَا تُؤَدِّي الْمَرْأَةُ حَقَّ اللَّهِ عَزَّ وَجَلَّ عَلَيْهَا كُلَّهُ حَتَّى تُؤَدِّيَ حَقَّ زَوْجِهَا عَلَيْهَا كُلَّهُ حَتَّى لَوْ سَأَلَهَا نَفْسَهَا وَهِيَ عَلَى ظَهْرِ قَتَبٍ لَأَعْطَتْهُ إِيَّاهُحَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنِ الْقَاسِمِ بْنِ عَوْفٍ رَجُلٍ مِنْ أَهْلِ الْكُوفَةِ أَحَدِ بَنِي مُرَّةَ بْنِ هَمَّامٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أَبِيهِ عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ إِنَّهُ أَتَى الشَّامَ فَرَأَى النَّصَارَى فَذَكَرَ مَعْنَاهُ إِلَّا أَنَّهُ قَالَ فَقُلْتُ لِأَيِّ شَيْءٍ تَصْنَعُونَ هَذَا قَالُوا هَذَا كَانَ تَحِيَّةَ الْأَنْبِيَاءِ قَبْلَنَا فَقُلْتُ نَحْنُ أَحَقُّ أَنْ نَصْنَعَ هَذَا بِنَبِيِّنَا فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُمْ كَذَبُوا عَلَى أَنْبِيَائِهِمْ كَمَا حَرَّفُوا كِتَابَهُمْ إِنَّ اللَّهَ عَزَّ وَجَلَّ أَبْدَلَنَا خَيْرًا مِنْ ذَلِكَ السَّلَامَ تَحِيَّةَ أَهْلِ الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Isma'il] Telah menceritakan kepada kami [Ayub] dari [Al Qasim Asy Syaibani] dari [Abdullah bin Abu Aufa] ia berkata; Ketika Mu'adz sampai di negeri Yaman atau Syam, ia melihat orang-orang Nasrani sujud kepada para komandan dan ulamanya. Lalu terpikirkanlah di dalam hatinya bahwa Rasulullah shallallahu 'alaihi wasallam adalah lebih berhak. Maka ketika ia kembali, ia berkata, \"Wahai Rasulullah, saya telah melihat orang-orang sujud kepada para komandan dan para ulama mereka, lalu terpikirkanlah di dalam hatiku bahwa Anda adalah lebih berhak untuk dimuliakan.\" Maka beliau bersabda: \"Sekiranya saya boleh memerintahkan seseorang untuk sujud kepada orang lain, niscaya saya akan memerintahkan wanita untuk sujud kepada suaminya. Dan seorang wanita tidak akan memenuhi hak Allah 'azza wajalla atas dirinya sepenuhnya, kecuali ia memenuhi hak suaminya atas dirinya. Bahkan sekiranya suaminya meminta dirinya, sementara ia saat itu berada di atas pelana kendaraan, maka ia harus mentaatinya.\" Telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepadaku [bapakku] dari [Qasim bin Auf] seorang laki-laki dari Kufah, yaitu Bani Murrah bin Hammam, dari [Abdurrahman bin Abu Laila] dari [bapaknya] dari [Mu'adz bin Jabal] ia berkata; ia mendatangi negeri Syam, lalu ia melihat orang-orang Nasrani. Ia pun menyebutkan maknanya. Hanya saja ia mengatakan; Saya berkata, \"Untuk apa kalian berbuat seperti ini?\" mereka menjawab, \"Ini adalah bentuk penghormatan kepada para Nabi pada masa sebelum kami.\" Maka saya pun berkata, \"Sesungguhnya kami lebih berhak untuk berbuat seperti ini kepada Nabi kami.\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya mereka telah berdusta kepada Nabi-Nabi mereka, sebagaimana mereka telah merubah Kitab-Kitab mereka. sesungguhnya Allah 'azza wajalla telah menggantikan untuk kita sesuatu yang lebih baik dari itu, yaitu Salam, ucapan selamat bagi penghuni surga.\""
            },
            {
                "number": 2448,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ إِسْمَاعِيلَ يَعْنِي ابْنَ أَبِي خَالِدٍ قَالَقُلْتُ لِعَبْدِ اللَّهِ بنِ أَبِي أَوْفَى هَلْ بَشَّرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَدِيجَةَ قَالَ نَعَمْ بَشَّرَهَا بِبَيْتٍ مِنْ قَصَبٍ لَا صَخَبٌ فِيهِ وَلَا نَصَبٌ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Isma'il] yakni Ibnu Abu Khalid, ia berkata, saya bertanya kepada [Abdullah bin Abu Aufa], \"Apakah Nabi shallallahu 'alaihi wasallam pernah memberi kabar gembira kepada Khadijah?\" ia menjawab, \"Ya, beliau telah menyampaikan berita gembira padanya berupa rumah yang terbuat dari mutiara, yang tiada kebisingan di dalamnya dan tidak pula kepenatan.\""
            },
            {
                "number": 2449,
                "arab": "حَدَّثَنَا يَحْيَى عَنْ إِسْمَاعِيلَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي أَوْفَى قَالَاعْتَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَطَافَ بِالْبَيْتِ ثُمَّ خَرَجَ فَطَافَ بَيْنَ الصَّفَا وَالْمَرْوَةِ وَجَعَلْنَا نَسْتُرُهُ مِنْ أَهْلِ مَكَّةَ أَنْ يَرْمِيَهُ أَحَدٌ أَوْ يُصِيبَهُ بِشَيْءٍ فَسَمِعْتُهُ يَدْعُو عَلَى الْأَحْزَابِ يَقُولُ اللَّهُمَّ مُنْزِلَ الْكِتَابِ سَرِيعَ الْحِسَابِ هَازِمَ الْأَحْزَابِ اللَّهُمَّ اهْزِمْهُمْ وَزَلْزِلْهُمْ",
                "id": "Telah menceritakan kepada kami [Yahya] dari [Isma'il] Telah menceritakan kepada kami [Abdullah bin Abu Aufa] ia berkata; Rasulullah shallallahu 'alaihi wasallam melakukan Umrah, lalu beliau thawaf di Baitullah. Kemudian beliau keluar dan melakukan thawaf antara Shafa dan Marwah, maka kami pun melindungi beliau daripada lemparan kaum musyrikin, atau mencelakainya dengan sesuatu. Kemudian saya mendengar beliau mendo'akan kecelakaan atas pasukan Ahzab: \"ALLAHUMMA MUNZILAL KITAABI SARII'UL HISAABI HAAZIMAL AHZAAB ALLAHUMMAH ZIMHUM WA ZALZILHUM (Ya Allah, yang telah menurunkan kitab, Yang maha cepat hisab-Nya, Ya Allah, binasakan dan goyahkanlah kekuatan mereka).\""
            },
            {
                "number": 2450,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ قَالَقُلْتُ لِعَبْدِ اللَّهِ بْنِ أَبِي أَوْفَى أَوْصَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِشَيْءٍ قَالَ لَا قُلْتُ فَكَيْفَ أَمْرَ الْمُسْلِمِينَ بِالْوَصِيَّةِ قَالَ أَوْصَى بِكِتَابِ اللَّهِ عَزَّ وَجَلَّقَالَ مَالِكُ بْنُ مِغْوَلٍ قَالَ طَلْحَةُ وَقَالَ الْهُزَيْلُ بْنُ شُرَحْبِيلَ أَبُو بَكْرٍ رَضِيَ اللَّهُ تَعَالَى عَنْهُ كَانَ يَتَأَمَّرُ عَلَى وَصِيِّ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَدَّ أَبُو بَكْرٍ رَضِيَ اللَّهُ تَعَالَى عَنْهُ أَنَّهُ وَجَدَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَهْدًا فَخُزِمَ أَنْفُهُ بِخِزَامٍ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Malik bin Mighwal] dari [Thalhah bin Musharrif] ia berkata, saya bertanya kepada [Abdullah bin Abu Aufa], \"Apakah Nabi shallallahu 'alaihi wasallam pernah berwasiat?\" Ia menjawab, \"Tidak.\" Saya bertanya lagi, \"lalu mengapa beliau memerintahkan wasiat kepada kaum muslimin?\" ia menjawab, \"Beliau telah berwasiat dengan Kitabullah 'azza wajalla.\" Malik bin Mighwal berkata, Thalhah berkata, Al Huzail bin Syurahbil berkata; Dan Abu Bakar radliallahu 'anhu memerintah dengan menunaikan wasiat Rasulullah shallallahu 'alaihi wasallam. Juga Abu Bakar Rasulullah shallallahu 'alaihi wasallam merasa senang memperoleh janji dibersamakan dengan Rasulullah shallallahu 'alaihi wasallam, maka hidung untanya ia kalungi dengan gelang dari rambut (sebagai pertanda kegembiraannya)."
            },
            {
                "number": 2451,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ عَنِ الْحَجَّاجِ يَعْنِي الصَّوَّافَ بْنَ أَبِي عُثْمَانَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ وَأَبِي سَلَمَةَ عَنْ أَبِي قَتَادَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِنَا فَيَقْرَأُ فِي الظُّهْرِ وَالْعَصْرِ فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ بِفَاتِحَةِ الْكِتَابِ وَسُورَتَيْنِ وَيُسْمِعُنَا الْآيَةَ أَحْيَانًا وَكَانَ يُطَوِّلُ فِي الرَّكْعَةِ الْأُولَى مِنْ الظُّهْرِ وَيُقَصِّرُ فِي الثَّانِيَةِ وَكَذَا فِي الصُّبْحِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Adi] dari [Al Hajjaj] yakni Ash Shawwaf bin Abu Utsman, dari [Yahya bin Abu Katsir] dari [Abdullah bin Abu Qatadah] dan [Abu Salamah] dari [Abu Qatadah] ia berkata; Rasulullah shallallahu 'alaihi wasallam sholat Zhuhur dan Ashar bersama kami, maka pada dua raka'at pertama beliau membaca Fatihatul Kitab (surat Al Fatihah) dan dua surat. Dan terkadang beliau memperdengarkan bacaan ayatnya pada kami. Kemudian beliau memanjangkan raka'at pertama sholat Zhuhur, dan memendekkan raka'at kedua, seperti inilah yang beliau lakukan pada sholat Subuh."
            },
            {
                "number": 2452,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ عَنِ الْحَجَّاجِ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا شَرِبَ أَحَدُكُمْ فَلَا يَتَنَفَّسْ فِي الْإِنَاءِ وَإِذَا دَخَلَ الْخَلَاءَ فَلَا يَتَمَسَّحْ بِيَمِينِهِ وَإِذَا بَالَ فَلَا يَمَسَّ ذَكَرَهُ بِيَمِينِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Adi] dari [Al Hajjaj] dari [Yahya bin Abu Katsir] dari [Abdullah bin Abu Qatadah] dari [bapaknya] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jika salah seorang dari kalian minum, maka janganlah ia bernafas dalam benjana. Dan jika ia hendak memasuki Kakus, maka janganlah ia membasuh (bersuci) dengan menggunakan tangan kanannya. Jika ia kencing, maka janganlah ia memegang zakarnya dengan tangan kanan.\""
            },
            {
                "number": 2453,
                "arab": "قَالَ يَحْيَى بْنُ أَبِي كَثِيرٍ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي طَلْحَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أَكَلَ أَحَدُكُمْ فَلَا يَأْكُلْ بِشِمَالِهِ وَإِذَا شَرِبَ فَلَا يَشْرَبْ بِشِمَالِهِ وَإِذَا أَخَذَ فَلَا يَأْخُذْ بِشِمَالِهِ وَإِذَا أَعْطَى فَلَا يُعْطِي بِشِمَالِهِ",
                "id": "Telah berkata [Yahya bin Abu Katsir] telah menceritakan kepadaku [Abullah bin Abu Thalhah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang diantara kalian makan, janganlah makan dengan tangan kirinya, dan apabila meminum maka jangan pula dengan tangan kirinya, dan apa bila mengambil sesuatu juga jangan dengan tangan kirinya, dan begitu pula apabila memberikan kepada seseorang, juga jangan dengan tangan kirinya.\""
            },
            {
                "number": 2454,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ عَنْ عَطِيَّةَ الْقُرَظِيِّ قَالَعُرِضْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ قُرَيْظَةَ فَشَكُّوا فِيَّ فَأَمَرَ بِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَنْظُرُوا إِلَيَّ هَلْ أَنْبَتُّ بَعْدُ فَنَظَرُوا فَلَمْ يَجِدُونِي أَنْبَتُّ فَخَلَّى عَنِّي وَأَلْحَقَنِي بِالسَّبْيِ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Abdul Malik bin Umari] dari ['Athiyah Al Qurazhi] ia berkata; \"Saya dihadapkan kepada Rasulullah shallallahu 'alaihi wasallam pada hari Quraizhah, dan mereka (para sahabat) meragukanku (apakah aku sudah baligh ataukah belum). Maka Nabi shallallahu 'alaihi wasallam memerintahkan mereka untuk melihat tubuhku, apakah bulu kemaluanku telah tumbuh. Mereka pun melihatnya, tapi bulu kemaluanku ternyata belum tumbuh. Akhirnya mereka melepaskan dan menggabungkanku bersama anak kecil.\""
            },
            {
                "number": 2455,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الْمَلِكِ أَنَّهُ سَمِعَ عَطِيَّةَ يَقُولُكُنْتُ يَوْمَ حَكَمَ سَعْدٌ فِيهِمْ غُلَامًا فَلَمْ يَجِدُونِي أَنْبَتُّ فَهَا أَنَا ذَا بَيْنَ أَظْهُرِكُمْ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Abdul Malik] bahwa ia mendengar ['Athiyyah] berkata; \"Ketika Sa'd menghukumi (Bani Quraizhah) saya masih kecil, sehingga mereka tidak mendapati bulu kemaluanku tumbuh. Karena itulah, saya bisa hadir di hadapan kalian.\""
            },
            {
                "number": 2456,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَيُّوبُ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ قَالَ حَدَّثَنِي عُبَيْدُ بْنُ أَبِي مَرْيَمَ عَنْ عُقْبَةَ بْنِ الْحَارِثِ قَالَ وَقَدْ سَمِعْتُهُ مِنْ عُقْبَةَ وَلَكِنِّي لِحَدِيثِ عُبَيْدٍ أَحْفَظُ قَالَتَزَوَّجْتُ امْرَأَةً فَجَاءَتْنَا امْرَأَةٌ سَوْدَاءُ فَقَالَتْ إِنِّي قَدْ أَرْضَعْتُكُمَا فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنِّي تَزَوَّجْتُ فُلَانَةَ ابْنَةَ فُلَانٍ فَجَاءَتْنَا امْرَأَةٌ سَوْدَاءُ فَقَالَتْ إِنِّي قَدْ أَرْضَعْتُكُمَا وَهِيَ كَاذِبَةٌ فَأَعْرَضَ عَنِّي فَأَتَيْتُهُ مِنْ قِبَلِ وَجْهِهِ فَقُلْتُ إِنَّهَا كَاذِبَةٌ فَقَالَ فَكَيْفَ بِهَا وَقَدْ زَعَمَتْ أَنَّهَا قَدْ أَرْضَعَتْكُمَا دَعْهَا عَنْكَ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Ibrahim] telah mengabarkan kepada kami [Ayyub] dari [Abdullah bin Abu Mulaikah] ia berkata, telah menceritakan kepadaku [Ubaid bin Abu Maryam] dari [Uqbah bin Harits] -Abdullah berkata; saya telah mendengarnya dari Uqbah, tapi saya lebih menghafal hadits Ubaid- ia berkata; \"Aku menikahi seorang wanita. Lalu datanglah seorang wanita hitam dan berkata, \"Sesungguhnya aku telah menyusui kalian berdua.\" Maka aku segera menemui Nabi shallallahu 'alaihi wasallam dan menuturkan kepadanya bahwa, \"Aku telah menikahi fulanah binti fulan lalu datanglah seorang wanita hitam dan mengatakan, 'Sesungguhnya aku telah menyusui kalian berdua.'\" Wanita itu adalah pendusta. Namun beliau berpaling dariku, maka saya mendatangi beliau dari arah depannya seraya berkata, \"Wanita adalah pendusta.\" Akhirnya beliau bersabda: \"Bagaimana lagi dengan wanita itu, padahal ia telah mengaku bahwa ia telah menyusui kalian berdua. Tinggalkanlah perempuan yang telah engkau nikahi itu.\""
            },
            {
                "number": 2457,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ عُقْبَةَ بْنِ الْحَارِثِ قَالَتَزَوَّجْتُ ابْنَةَ أَبِي إِهَابٍ فَجَاءَتْ امْرَأَةٌ سَوْدَاءُ فَذَكَرَتْ أَنَّهَا أَرْضَعَتْنَا فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُمْتُ بَيْنَ يَدَيْهِ فَكَلَّمْتُهُ فَأَعْرَضَ عَنِّي فَقُمْتُ عَنْ يَمِينِهِ فَأَعْرَضَ عَنِّي فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا هِيَ سَوْدَاءُ قَالَ وَكَيْفَ وَقَدْ قِيلَ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Isma'il bin Umayyah] dari [Ibnu Abu Mulaikah] dari [Uqbah bin Harits] ia berkata; Saya menikahi anak wanita Abu Ihab. Lalu datanglah seorang wanita berkulit hitam dan menuturkan bahwa ia telah menyusui kami. Saya pun segera menemui Rasulullah shallallahu 'alaihi wasallam, saya berdiri di hadapannya dan berbicara kepadanya, namun beliau berpaling dariku. Saya berdiri lagi di sebelah kanannya, namun beliau tetap berpaling dariku. Akhirnya saya berkata, \"Wahai Rasulullah, ia hanyalah seorang wanita hitam.\" Beliau bersabda: \"Lalu bagaimana lagi, sedangkan wanita telah mengatakannya?\""
            },
            {
                "number": 2458,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا أَبِي حَدَّثَنَا أَيُّوبُ عَنْ ابْنِ أَبِي مُلَيْكَةَ قَالَ حَدَّثَنِي عُقْبَةُ بْنُ الْحَارِثِ قَالَأُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالنُّعَيْمَانِ قَدْ شَرِبَ الْخَمْرَ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ فِي الْبَيْتِ فَضَرَبُوهُ بِالْأَيْدِي وَالْجَرِيدِ وَالنِّعَالِ قَالَ وَكُنْتُ فِيمَنْ ضَرَبَهُ",
                "id": "Telah menceritakan kepada kami [Abdush Shamad] Telah menceritakan kepada kami [bapakku] Telah menceritakan kepada kami [Ayyub] dari [Ibnu Abu Mulaikah] ia berkata, telah menceritakan kepadaku [Uqbah bin Harits] ia berkata; An Nu'aiman dihadapkan kepada Rasulullah shallallahu 'alaihi wasallam setelah ia minum khamar. Maka Rasulullah shallallahu 'alaihi wasallam memerintahkan kepada semua yang berada di rumah untuk memukulnya. Dan mereka pun memukulnya dengan tangan, pelepah kurma, dan terompah. Dan waktu itu, saya termasuk orang yang memukulnya."
            },
            {
                "number": 2459,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي حُسَيْنٍ قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ عَنْ عُقْبَةَ بْنِ الْحَارِثِ قَالَصَلَّيْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعَصْرَ فَلَمَّا سَلَّمَ قَامَ سَرِيعًا فَدَخَلَ عَلَى بَعْضِ نِسَائِهِ ثُمَّ خَرَجَ وَرَأَى مَا فِي وُجُوهِ الْقَوْمِ مِنْ تَعَاجُبِهِمْ لِسُرْعَتِهِ قَالَ ذَكَرْتُ وَأَنَا فِي الصَّلَاةِ تِبْرًا عِنْدَنَا فَكَرِهْتُ أَنْ يُمْسِيَ أَوْ يَبِيتَ عِنْدَنَا فَأَمَرْتُ بِقَسْمِهِحَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا عُمَرُ بْنُ سَعِيدٍ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ عُقْبَةَ بْنِ الْحَارِثِ قَالَ انْصَرَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ صَلَّى الْعَصْرَ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Rauh] Telah menceritakan kepada kami [Umar bin Sa'id bin Abu Husain] ia berkata, telah mengabarkan kepadaku [Abdullah bin Abu Mulaikah] dari [Uqbah bin Harits] ia berkata; Saya pernah sholat Ashar bersama Rasulullah shallallahu 'alaihi wasallam. Setelah beliau salam, beliau segera berdiri dan masuk ke dalam rumah salah seorang dari isteri-isterinya. Kemudian beliau keluar dan melihat keheranan pada wajah-wajah sahabatnya. Beliau bersabda: \"Pada saat sholat tadi, saya teringat akan Tibr (batangan emas\/perak) yang ada pada kami, dan saya tidak suka kalau benda itu bersore atau bermalam hari pada kami, sehingga saya memerintahkan untuk membagi-bagikannya.\" Telah menceritakan kepada kami [Abu Ahmad] Telah menceritakan kepada kami [Umar bin Sa'id] dari [Ibnu Abu Mulaikah] dari [Uqbah bin Harits] ia berkata; Rasulullah shallallahu 'alaihi wasallam langsung beranjak setelah beliau menunaikan sholat Ashar. Ia pun menyebutkan maknanya."
            },
            {
                "number": 2460,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامٍ حَدَّثَنَا قَتَادَةُ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ عَنْ أَبِي نَجِيحٍ السُّلَمِيِّ قَالَحَاصَرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِصْنَ الطَّائِفِ أَوْ قَصْرَ الطَّائِفِ فَقَالَ مَنْ بَلَغَ بِسَهْمٍ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ فَلَهُ دَرَجَةٌ فِي الْجَنَّةِ فَبَلَغْتُ يَوْمَئِذٍ سِتَّةَ عَشَرَ سَهْمًا وَمَنْ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ فَهُوَ لَهُ عِدْلُ مُحَرَّرٍ وَمَنْ أَصَابَهُ شَيْبٌ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ فَهُوَ لَهُ نُورٌ يَوْمَ الْقِيَامَةِ وَأَيُّمَا رَجُلٍ أَعْتَقَ رَجُلًا مُسْلِمًا جَعَلَ اللَّهُ عَزَّ وَجَلَّ وِقَاءَ كُلِّ عَظْمٍ مِنْ عِظَامِهِ عَظْمًا مِنْ عِظَامِ مُحَرِّرِهِ مِنْ النَّارِ وَأَيُّمَا امْرَأَةٍ مُسْلِمَةٍ أَعْتَقَتْ امْرَأَةً مُسْلِمَةً فَإِنَّ اللَّهَ عَزَّ وَجَلَّ جَاعِلٌ وِقَاءَ كُلِّ عَظْمٍ مِنْ عِظَامِهَا عَظْمًا مِنْ عِظَامِ مُحَرِّرِهَا مِنْ النَّارِحَدَّثَنَا عَبْدُ الْوَهَّابِ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَن سَالِمِ بْنِ أَبِي الْجَعْدِ الْغَطَفَانِيِّ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ الْيَعْمُرِيِّ عَنْ أَبِي نَجِيحٍ السُّلَمِيِّ قَالَ حَاصَرْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِصْنَ الطَّائِفِ فَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ فَبَلَغَهُ فَلَهُ دَرَجَةٌ فِي الْجَنَّةِ فَقَالَ رَجُلٌ يَا نَبِيَّ اللَّهِ إِنْ رَمَيْتُ فَبَلَغْتُ فَلِي دَرَجَةٌ فِي الْجَنَّةِ قَالَ فَرَمَى فَبَلَغَ قَالَ فَبَلَغْتُ يَوْمَئِذٍ سِتَّةَ عَشَرَ سَهْمًا فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Hisyam] Telah menceritakan kepada kami [Qatadah] dari [Salim bin Abul Ja'd] dari [Ma'dan bin Abu Thalhah] dari [Abu Najih As Sulami] ia berkata; Kami bersama Rasulullah shallallahu 'alaihi wasallam mengepung benteng dan istana Tha`if. Kemudian beliau bersabda: \"Barangsiapa yang meluncurkan satu anak panah di dalan Allah 'azza wajalla, maka baginya satu derajat di dalam surga.\" Maka pada hari itu, saya dapat meluncurkan enam belas anak panah. Beliau bersabda lagi: \"Barangsiapa yang meluncurkan satu anak panah di jalan Allah 'azza wajalla, maka baginya adalah seperti pahala orang yang membebaskan budak. Dan siapa yang sehelai rambutnya menjadi uban di jalan Allah 'azza wajalla, maka hal itu akan menjadi cahaya baginya kelak pada hari kiamat. Dan siapa saja yang membebaskan satu orang budak muslim, maka Allah 'azza wajalla akan menjadikan setiap bagian tubuh budak itu sebagai pembebas dirinya dari api neraka. Dan wanita muslimah mana saja yang membebaskan satu orang budak wanita muslimah, maka Allah 'azza wajalla akan menjadikan dari setiap bagian tubuh budak wanita itu sebagi tebusan dirinya dari neraka.\" Telah menceritakan kepada kami [Abdul Wahhab] dari [Sa'id] dari [Qatadah] dari [Salim bin Abul Ja'd Al Ghathafani] dari [Ma'dan bin Abu Thalhah Al Ya'muri] dari [Abu Najih As Sulami] ia bekata; Kami bersama Nabi shallallahu 'alaihi wasallam mengepung benteng Tha`if, lalu saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang meluncurkan satu anak panah di dalan Allah 'azza wajalla, maka baginya satu derajat di dalam surga.\" Maka seorang laki-laki kemudian berkata, \"Wahai Nabiyullah, jika saya melempar satu anak panah, lalu mengenai sasaran maka saya akan mendapatkan satu derajat di surge?.\" Maka laki-laki itu pun melempar dan mengenai sasaran. Dan pada hari itu, saya pun melempar dan mengenai sasaran sebanyak enam belas anak panah. Kemudian ia pun menyebut makna semisal."
            },
            {
                "number": 2461,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ عُمَارَةَ بْنِ حَدِيدٍ الْبَجَلِيِّ عَنْ صَخْرٍ الْغَامِدِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُمَّ بَارِكْ لِأُمَّتِي فِي بُكُورِهَا قَالَ فَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَعَثَ سَرِيَّةً بَعَثَهَا أَوَّلَ النَّهَارِوَكَانَ صَخْرٌ رَجُلًا تَاجِرًا فَكَانَ لَا يَبْعَثُ غِلْمَانَهُ إِلَّا مِنْ أَوَّلِ النَّهَارِ فَكَثُرَ مَالُهُ حَتَّى لَا يَدْرِيَ أَيْنَ يَضَعُ مَالَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin Atha`] dari [Umarah bin Hadid Al Bajali] dari [Shakhr Al Ghamidi] dari Nabi shallallahu 'alaihi wasallam, beliau berdo'a: \"ALLAHUMMA BAARIK LIUMMATII FI BUKUURIHAA (Ya Allah, berilah keberkahan pada untuk ummatku di waktu pagi mereka).\" Dan jika Nabi shallallahu 'alaihi wasallam mengirim Sariyyah (ekspedisi militer yang dikirim untuk operasi tertentu), maka beliau mengirimnya pada pagi hari. Kemudian Shakhr adalah seorang penjual, dan ia juga tidak pernah mengirim para pelayannya kecuali pada permulaan hari (pagi hari), sehingga hartanya pun semakin berkembang dan banyak, sampai ia tidak tahu lagi di mana ia letakkan hartanya."
            },
            {
                "number": 2462,
                "arab": "حَدَّثَنَا هُشَيْمٌ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بْنِ سُفْيَانَ الثَّقَفِيِّ عَنْ أَبِيهِأَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ وَقَدْ قَالَ هُشَيْمٌ قُلْتُ يَا رَسُولَ اللَّهِ مُرْنِي فِي الْإِسْلَامِ بِأَمْرٍ لَا أَسْأَلُ عَنْهُ أَحَدًا بَعْدَكَ قَالَ قُلْ آمَنْتُ بِاللَّهِ ثُمَّ اسْتَقِمْ قَالَ قُلْتُ فَمَا أَتَّقِي فَأَوْمَأَ إِلَى لِسَانِهِ",
                "id": "Telah menceritakan kepada kami [Husyaim] dari [Ya'la bin Atha`] dari [Abdullah bin Sufyan Ats Tsaqafi] dari [bapaknya] bahwa seorang laki-laki berkata; \"Wahai Rasulullah..\" dan Husyaim berkata; Saya berkata, \"Wahai Rasulullah, perintahkanlah padaku suatu syariat dalam Islam ini, yang tidak akan aku tanyakan kepada seorang pun setelah Anda.\" Beliau bersabda: \"Katakanlah, 'Aku beriman kepada Allah' lalu istiqamahlah (dalam ucapanmu).\" Saya bertanya lagi, \"Lalu apakah yang harus aku waspadai?\" Maka beliau pun memberi isyarat dengan menunjuk ke arah lidahnya."
            },
            {
                "number": 2463,
                "arab": "حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ حَدَّثَنَا نُوحُ بْنُ قَيْسٍ عَنْ أَشْعَثَ بْنِ جَابِرٍ الْحُدَّانِيِّ عَنْ مَكْحُولٍ عَنْ عَمْرِو بْنِ عَبَسَةَ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْخٌ كَبِيرٌ يَدَّعِمُ عَلَى عَصًا لَهُ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ لِي غَدَرَاتٍ وَفَجَرَاتٍ فَهَلْ يُغْفَرُ لِي قَالَ أَلَسْتَ تَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ قَالَ بَلَى وَأَشْهَدُ أَنَّكَ رَسُولُ اللَّهِ قَالَ قَدْ غُفِرَ لَكَ غَدَرَاتُكَ وَفَجَرَاتُكَ",
                "id": "Telah menceritakan kepada kami [Suraij bin Nu'man] Telah menceritakan kepada kami [Nuh bin Qais] dari [Asy'ats bin Jabir Al Huddani] dari [Makhul] dari [Amru bin 'Abasah] ia berkata; Bahwasanya seorang lelaki tua (lansia) datang kepada Nabi shallallahu 'alaihi wasallam sambil bersandar pada tongkatnya dan bertanya, \"Wahai Rasulallah, sesungguhnya aku adalah seorang yang mempunyai dosa karena sering menipu dan berbuat aniaya, apakah aku bisa diampuni?\" Beliau menjawab: \"Bukankah kamu bersaksi bahwa tiada tuhan yang berhak disembah selain Allah?\" Orang tua itu menjawab, \"Ya, dan saya juga bersaksi bahwa Anda adalah utusan Allah.\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh, dosa lantaran penipuan dan aniayamu telah diampuni.\""
            },
            {
                "number": 2464,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا حَرِيزُ بْنُ عُثْمَانَ وَهُوَ الرَّحَبِيُّ حَدَّثَنَا سُلَيْمُ بْنُ عَامِرٍ عَنْ عَمْرِو بْنِ عَبَسَةَ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِعُكَاظٍ فَقُلْتُ مَنْ تَبِعَكَ عَلَى هَذَا الْأَمْرِ فَقَالَ حُرٌّ وَعَبْدٌ وَمَعَهُ أَبُو بَكْرٍ وَبِلَالٌ رَضِيَ اللَّهُ تَعَالَى عَنْهُمَا فَقَالَ لِي ارْجِعْ حَتَّى يُمَكِّنَ اللَّهُ عَزَّ وَجَلَّ لِرَسُولِهِ فَأَتَيْتُهُ بَعْدُ فَقُلْتُ يَا رَسُولَ اللَّهِ جَعَلَنِي اللَّهُ فِدَاءَكَ شَيْئًا تَعْلَمُهُ وَأَجْهَلُهُ لَا يَضُرُّكَ وَيَنْفَعُنِي اللَّهُ عَزَّ وَجَلَّ بِهِ هَلْ مِنْ سَاعَةٍ أَفْضَلُ مِنْ سَاعَةٍ وَهَلْ مِنْ سَاعَةٍ يُتَّقَى فِيهَا فَقَالَ لَقَدْ سَأَلْتَنِي عَنْ شَيْءٍ مَا سَأَلَنِي عَنْهُ أَحَدٌ قَبْلَكَ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَتَدَلَّى فِي جَوْفِ اللَّيْلِ فَيَغْفِرُ إِلَّا مَا كَانَ مِنْ الشِّرْكِ وَالْبَغْيِ فَالصَّلَاةُ مَشْهُودَةٌ مَحْضُورَةٌ فَصَلِّ حَتَّى تَطْلُعَ الشَّمْسُ فَإِذَا طَلَعَتْ فَأَقْصِرْ عَنْ الصَّلَاةِ فَإِنَّهَا تَطْلُعُ بَيْنَ قَرْنَيْ شَيْطَانٍ وَهِيَ صَلَاةُ الْكُفَّارِ حَتَّى تَرْتَفِعَ فَإِذَا اسْتَقَلَّتْ الشَّمْسُ فَصَلِّ فَإِنَّ الصَّلَاةَ مَحْضُورَةٌ مَشْهُودَةٌ حَتَّى يَعْتَدِلَ النَّهَارُ فَإِذَا اعْتَدَلَ النَّهَارُ فَأَقْصِرْ عَنْ الصَّلَاةِ فَإِنَّهَا سَاعَةٌ تُسَجَّرُ فِيهَا جَهَنَّمُ حَتَّى يَفِيءَ الْفَيْءُ فَإِذَا فَاءَ الْفَيْءُ فَصَلِّ فَإِنَّ الصَّلَاةَ مَحْضُورَةٌ مَشْهُودَةٌ حَتَّى تَدَلَّى الشَّمْسُ لِلْغُرُوبِ فَإِذَا تَدَلَّتْ فَأَقْصِرْ عَنْ الصَّلَاةِ حَتَّى تَغِيبَ الشَّمْسُ فَإِنَّهَا تَغِيبُ عَلَى قَرْنَيْ شَيْطَانٍ وَهِيَ صَلَاةُ الْكُفَّارِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] Telah menceritakan kepada kami [Harits bin Utsman] ia adalah Ar Rahabi, Telah menceritakan kepada kami [Sulaim bin Amir] dari [Amru bin Abasah] ia berkata; Saya mendatangi Rasulullah shallallahu 'alaihi wasallam ketika beliau di 'Ukadz, lalu aku bertanya, \"Siapakah orang yang menjadi pengikut Anda dalam perkara ini (Din Islam)?\" Beliau menjawab: \"Seorang yang merdeka dan juga sorang budak.\" Saat itu beliau bersama Abu Bakar dan Bilal radliallahu 'anhuma. Kemudian beliau bersabda kepadaku: \"Pulanglah kamu hingga Allah menguatkan Rasul-Nya.\" Setelah itu, saya mendatangi beliau dan berkata, \"Semoga Allah menjadikanku sebagai tebusanmu. Ajarkanlah aku sesuatu yang Anda ketahui sementara aku tidak mengetahuinya, yaitu sesuatu yang tidak membahayakanmu dan Allah juga memberiku manfaat dengannya. Apakah ada suatu waktu yang lebih utama dari waktu yang lain, dan adakah suatu waktu yang harus kita waspadai?\" Beliau menjawab: \"Sungguh, kamu telah bertanya kepadaku tentang sesuatu yang belum pernah ditanyakan oleh seorang pun sebelummu. Sesungguhnya Allah 'azza wajalla turun pada sepertiga akhir malam, dan Dia mengampuni dosa apa saja kecuali syirik dan perbuatan yang melampaui batas. sholat adalah suatu ibadah yang disaksikan dan dihadiri (oleh para malaikat) maka hendaklah kamu sholat hingga matahari terbit. Dan apabila matahari telah terbit, maka janganlah kamu sholat hingga matahari meninggi, karena matahari terbit diantara dua tanduk syetan, dan sholat pada waktu itu adalah sholatnya orang-orang kafir. Kemudian, jika matahari sudah meninggi, maka sholatlah, karena sholat pada waktu itu disaksikan dan dihadiri (oleh para malaikat) hingga pertengahan siang. Saat matahari berada di pertengahan langit, maka janganlah kamu sholat, karena pada waktu itu api neraka sedang dinyalakan hingga bayangan kembali muncul. Dan apabila bayangan sudah kembali maka sholatlah kamu, karena sholat pada waktu itu disaksikan dan dihadiri (oleh para malaikat) hingga matahari turun untuk terbenam. Ketika matahari hari hendak terbenam, maka janganlah kamu sholat hingga benar-benar terbenam, Karena matahari terbenam diantara dua tanduk syetan dan pada waktu itulah orang-orang kafir beribadah.\""
            },
            {
                "number": 2465,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا حَجَّاجٌ يَعْنِي ابْنَ دِينَارٍ عَنْ مُحَمَّدِ بْنِ ذَكْوَانَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَمْرِو بْنِ عَبَسَةَ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ مَنْ تَبِعَكَ عَلَى هَذَا الْأَمْرِ قَالَ حُرٌّ وَعَبْدٌ قُلْتُ مَا الْإِسْلَامُ قَالَ طِيبُ الْكَلَامِ وَإِطْعَامُ الطَّعَامِ قُلْتُ مَا الْإِيمَانُ قَالَ الصَّبْرُ وَالسَّمَاحَةُ قَالَ قُلْتُ أَيُّ الْإِسْلَامِ أَفْضَلُ قَالَ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ قَالَ قُلْتُ أَيُّ الْإِيمَانِ أَفْضَلُ قَالَ خُلُقٌ حَسَنٌ قَالَ قُلْتُ أَيُّ الصَّلَاةِ أَفْضَلُ قَالَ طُولُ الْقُنُوتِ قَالَ قُلْتُ أَيُّ الْهِجْرَةِ أَفْضَلُ قَالَ أَنْ تَهْجُرَ مَا كَرِهَ رَبُّكَ عَزَّ وَجَلَّ قَالَ قُلْتُ فَأَيُّ الْجِهَادِ أَفْضَلُ قَالَ مَنْ عُقِرَ جَوَادُهُ وَأُهْرِيقَ دَمُهُ قَالَ قُلْتُ أَيُّ السَّاعَاتِ أَفْضَلُ قَالَ جَوْفُ اللَّيْلِ الْآخِرُ ثُمَّ الصَّلَاةُ مَكْتُوبَةٌ مَشْهُودَةٌ حَتَّى يَطْلُعَ الْفَجْرُ فَإِذَا طَلَعَ الْفَجْرُ فَلَا صَلَاةَ إِلَّا الرَّكْعَتَيْنِ حَتَّى تُصَلِّيَ الْفَجْرَ فَإِذَا صَلَّيْتَ صَلَاةَ الصُّبْحِ فَأَمْسِكْ عَنْ الصَّلَاةِ حَتَّى تَطْلُعَ الشَّمْسُ فَإِذَا طَلَعَتْ الشَّمْسُ فَإِنَّهَا تَطْلُعُ فِي قَرْنَيْ شَيْطَانٍ وَإِنَّ الْكُفَّارَ يُصَلُّونَ لَهَا فَأَمْسِكْ عَنْ الصَّلَاةِ حَتَّى تَرْتَفِعَ فَإِذَا ارْتَفَعَتْ فَالصَّلَاةُ مَكْتُوبَةٌ مَشْهُودَةٌ حَتَّى يَقُومَ الظِّلُّ قِيَامَ الرُّمْحِ فَإِذَا كَانَ كَذَلِكَ فَأَمْسِكْ عَنْ الصَّلَاةِ حَتَّى تَمِيلَ فَإِذَا مَالَتْ فَالصَّلَاةُ مَكْتُوبَةٌ مَشْهُودَةٌ حَتَّى تَغْرُبَ الشَّمْسُ فَإِذَا كَانَ عِنْدَ غُرُوبِهَا فَأَمْسِكْ عَنْ الصَّلَاةِ فَإِنَّهَا تَغْرُبُ أَوْ تَغِيبُ فِي قَرْنَيْ شَيْطَانٍ وَإِنَّ الْكُفَّارَ يُصَلُّونَ لَهَا",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] Telah menceritakan kepada kami [Hajjaj] yakni Ibnu Dinar, dari [Muhammad bin Dzakwan] dari [Syahr bin Hausyab] dari [Amru bin 'Asabah] ia berkata; Saya mendatangi Rasulullah shallallahu 'alaihi wasallam dan bertanya, \"Wahai Rasulullah, siapa saja yang mengikuti Anda di atas perkara (Din Islam) ini?\" beliau menjawab: \"Yaitu seorang yang merdeka dan seorang budak.\" Saya bertanya lagi, \"Apakah Islam itu?\" beliau menjawab: \"Yaitu berkata-kata yang baik dan memberi makanan.\" Saya bertanya lagi, \"Apakah iman itu?\" beliau menjawab: \"Yaitu sabar dan As Samaahah (murah hati).\" Saya bertanya kembali, \"Islam seperti apakah yang paling utama?\" beliau menjawab: \"Yaitu seseorang yang kaum muslimin selamat dari lisan dan tangannya.\" aku bertanya lagi, \"Iman seperti apakah yang paling utama?\" beliau menjawab: \"Yaitu akhlak yang baik.\" Saya berta lagi, \"sholat apakah yang paling utama?\" beliau menjawab: \"Yaitu sholat dengan berdiri lama.\" Saya bertanya lagi, \"Hijrah yang manakah yang paling utama?\" beliau menjawab: \"Yaitu kamu berhijrah dari apa-apa yang dibenci oleh Rabb-mu Azza wa Jalla.\" Saya bertanya kembali, \"Jihad yang manakah yang paling utama?\" beliau menjawab: \"Yaitu siapa yang kuda perang miliknya terluka dan darahnya mencucur.\" Saya bertanya lagi, \"Waktu manakah yang paling utama?\" beliau menjawab: \"Yaitu sepertiga akhir malam. Kemudian sholat wajib adalah disaksikan oleh para malaikat hingga waktu fajar menyingsing. Jika fajar telah terbit, maka tidak ada sholat kecuali dua raka'at sampai kamu menunaikan sholat Fajar. Setelah kamu menunaikan sholat Shubuh, maka janganlah kamu sholat hingga matahari terbit. Saat matahari terbit, maka sesungguhnya ia terbit di antara dua tanduk syetan, dan pada waktu itu orang-orang kafir sedang beribadah, karena itu, janganlah kamu sholat hingga matahari meninggi. Ketika Matahari telah meninggi, maka sholatlah, dan sholat di waktu itu adalah berpahala, dan disaksikan oleh para malaikat sampai bayangan seseorang menyerupai panjang tombak, maka pada waktu ini janganlah kamu menunaikan sholat hingga matahari condong. Dan ketika matahari telah condong, maka sholat pada waktu itu akan ditulis pahalanya dan akan disaksikan oleh para malaikat hingga matahari terbenam. Dan saat matahari akan terbenam, maka janganlah kamu sholat, karena ia terbenam di antara dua tanduk syetan dan saat itu, orang-orang kafir sedang beribadah.\""
            },
            {
                "number": 2466,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي الْفَيْضِ عَنْ سُلَيْمِ بْنِ عَامِرٍ قَالَكَانَ بَيْنَ مُعَاوِيَةَ وَبَيْنَ قَوْمٍ مِنْ الرُّومِ عَهْدٌ فَخَرَجَ مُعَاوِيَةُ قَالَ فَجَعَلَ يَسِيرُ فِي أَرْضِهِمْ حَتَّى يَنْقُضُوا فَيُغِيرَ عَلَيْهِمْ فَإِذَا رَجُلٌ يُنَادِي فِي نَاحِيَةِ النَّاسِ وَفَاءٌ لَا غَدْرٌ فَإِذَا هُوَ عَمْرُو بْنُ عَبَسَةَ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ كَانَ بَيْنَهُ وَبَيْنَ قَوْمٍ عَهْدٌ فَلَا يَشِدَّ عُقْدَةً وَلَا يَحُلَّ حَتَّى يَمْضِيَ أَمَدُهَا أَوْ يَنْبِذَ إِلَيْهِمْ عَلَى سَوَاءٍ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Syu'bah] dari [Abu Al Faidl] dari [Sulaim bin Amir] ia berkata; Antara Mu'awiyah dan orang-orang Romawi terdapat suatu perjanjian. Mu'awiyah pun keluar dan berjalan menelusuri perkampungan mereka, hingga jika mereka sampai melanggar perjanjian, maka mereka diserang. Tiba-tiba seorang laki-laki yang berada di kerumunan manusia menyerukan, \"Penuhilah janji dan hendaklah tidak ada pengkhianatan.\" Dan ternyata ia adalah [Amru bin Abasah]. Lalu ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang antara ia dan suatu kaum terdapat suatu perjanjian, maka janganlah ia memperberat perjanjian itu (dengan menambah syarat-syaratnya) atau mencederai ikatannya, hingga batas waktunya berakhir atau hingga mereka sama-sama membatalkannya.\""
            },
            {
                "number": 2467,
                "arab": "حَدَّثَنَا هَاشِمٌ حَدَّثَنِي عَبْدُ الْحَمِيدِ حَدَّثَنِي شَهْرٌ حَدَّثَنِي أَبُو ظَبْيَةَ قَالَإِنَّ شُرَحْبِيلَ بْنَ السِّمْطِ دَعَا عَمْرَو بْنَ عَبَسَةَ السُّلَمِيَّ فَقَالَ يَا ابْنَ عَبَسَةَ هَلْ أَنْتَ مُحَدِّثِي حَدِيثًا سَمِعْتَهُ أَنْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيْسَ فِيهِ تَزَيُّدٌ وَلَا كَذِبٌ وَلَا تُحَدِّثْنِيهِ عَنْ آخَرَ سَمِعَهُ مِنْهُ غَيْرِكَ قَالَ نَعَمْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَقُولُ قَدْ حَقَّتْ مَحَبَّتِي لِلَّذِينَ يَتَحَابُّونَ مِنْ أَجْلِي وَحَقَّتْ مَحَبَّتِي لِلَّذِينَ يَتَصَافُّونَ مِنْ أَجْلِي وَحَقَّتْ مَحَبَّتِي لِلَّذِينَ يَتَزَاوَرُونَ مِنْ أَجْلِي وَحَقَّتْ مَحَبَّتِي لِلَّذِينَ يَتَبَاذَلُونَ مِنْ أَجْلِي وَحَقَّتْ مَحَبَّتِي لِلَّذِينَ يَتَنَاصَرُونَ مِنْ أَجْلِي",
                "id": "Telah menceritakan kepada kami [Hasyim] telah menceritakan kepadaku [Abdul Hamid] telah menceritakan kepadaku [Syahr] telah menceritakan kepadaku [Abu Dzabyah] ia berkata; Bahwasanya Syurahbil bin As Simth memanggil Amru bin Abasah As Sulami dan bertanya, \"Wahai Ibnu Abasah, apakah Anda mau menceritakan kepadaku suatu hadits yang telah Anda dengar dari Rasulullah shallallahu 'alaihi wasallam tanpa ada tambahan ataupun kedustaan? Dan janganlah Anda ceritakan kepadaku suatu hadits dari sahabat lain yang ia mendengarnya dari beliau selain Anda. [Amru bin Abasah] berkata; Baiklah, aku telah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah Ta'ala telah berfirman: 'Sungguh telah berhak mendapatkan kecintaan-Ku orang-orang yang saling mencintai karena Aku, dan sungguh telah berhak mendapatkan kecintaan-Ku orang-orang yang saling merapatkan barisan karena Aku, dan sungguh telah berhak mendapatkan kecintaan-Ku orang-orang yang saling mengunjungi karena Aku, dan sungguh telah berhak mendapatkan kecintaan-Ku orang-orang yang saling berkorban (untuk membantu yang lain) karena Aku, dan sungguh telah berhak mendapatkan kecintaan-Ku orang-orang yang saling menolong karena Aku.'\""
            },
            {
                "number": 2468,
                "arab": "و قَالَ عَمْرُو بْنُ عَبَسَةَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَيُّمَا رَجُلٍ رَمَى بِسَهْمٍ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ فَبَلَغَ مُخْطِئًا أَوْ مُصِيبًا فَلَهُ مِنْ الْأَجْرِ كَرَقَبَةٍ يُعْتِقُهَا مِنْ وَلَدِ إِسْمَاعِيلَ وَأَيُّمَا رَجُلٍ شَابَ شَيْبَةً فِي سَبِيلِ اللَّهِ فَهِيَ لَهُ نُورٌ وَأَيُّمَا رَجُلٍ مُسْلِمٍ أَعْتَقَ رَجُلًا مُسْلِمًا فَكُلُّ عُضْوٍ مِنْ الْمُعْتَقِ بِعُضْوٍ مِنْ الْمُعْتِقِ فِدَاءٌ لَهُ مِنْ النَّارِ وَأَيُّمَا امْرَأَةٍ مُسْلِمَةٍ أَعْتَقَتْ امْرَأَةً مُسْلِمَةً فَكُلُّ عُضْوٍ مِنْ الْمُعْتَقَةِ بِعُضْوٍ مِنْ الْمُعْتِقَةِ فِدَاءٌ لَهَا مِنْ النَّارِ وَأَيُّمَا رَجُلٍ مُسْلِمٍ قَدَّمَ لِلَّهِ عَزَّ وَجَلَّ مِنْ صُلْبِهِ ثَلَاثَةً لَمْ يَبْلُغُوا الْحِنْثَ أَوْ امْرَأَةٍ فَهُمْ لَهُ سُتْرَةٌ مِنْ النَّارِ وَأَيُّمَا رَجُلٍ قَامَ إِلَى وَضُوءٍ يُرِيدُ الصَّلَاةَ فَأَحْصَى الْوَضُوءَ إِلَى أَمَاكِنِهِ سَلِمَ مِنْ كُلِّ ذَنْبٍ أَوْ خَطِيئَةٍ لَهُ فَإِنْ قَامَ إِلَى الصَّلَاةِ رَفَعَهُ اللَّهُ عَزَّ وَجَلَّ بِهَا دَرَجَةً وَإِنْ قَعَدَ قَعَدَ سَالِمًا فَقَالَ شُرَحْبِيلُ بْنُ السِّمْطِ آنْتَ سَمِعْتَ هَذَا الْحَدِيثَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا ابْنَ عَبَسَةَ قَالَ نَعَمْ وَالَّذِي لَا إِلَهَ إِلَّا هُوَ لَوْ أَنِّي لَمْ أَسْمَعْ هَذَا الْحَدِيثَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرَ مَرَّةٍ أَوْ مَرَّتَيْنِ أَوْ ثَلَاثٍ أَوْ أَرْبَعٍ أَوْ خَمْسٍ أَوْ سِتٍّ أَوْ سَبْعٍ فَانْتَهَى عِنْدَ سَبْعٍ مَا حَلَفْتُ يَعْنِي مَا بَالَيْتُ أَنْ لَا أُحَدِّثَ بِهِ أَحَدًا مِنْ النَّاسِ وَلَكِنِّي وَاللَّهِ مَا أَدْرِي عَدَدَ مَا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Dan [Amru bin Abasah] berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang meluncurkan satu anak panah di jalan Allah dengan tepat mengenai sasaran atau tidak, maka baginya pahala seperti orang yang memerdekakan satu budak dari anaknya Isma'il. Dan siapa pun yang miliki sehelai rambut yang beruban di jalan Allah, maka hal itu akan menjadi cahaya baginya. Laki-laki musli m mana pun yang memerdekakan satu orang budak muslim, maka setiap anggota tubuh dari budak itu (yang dimerdekakan itu) akan menjadi tebusan untuk setiap anggota tubuh yang memerdekakan dari api neraka. Dan wanita muslimah mana pun yang membebaskan satu orang budak wanita muslimah, maka setiap organ tubuh dari budak wanita itu akan menjadi tebusan bagi Mu'tiqah (wanita yang membebaskan) dari api nerakan. Dan laki-laki muslim atau wanita muslimah mana pun yang merelakan (kematian tiga orang anaknya yang belum baligh) kepada Allah, maka ketiganya itu akan menjadi penghalang baginya dari api neraka. Dan barangsiapa yang beranjak ke tempat wudlu untuk menunaikan sholat, lalu ia meratakan air wudlu ke anggota wudlunya, maka seolah telah terbebas dari setiap dosa atau kesalahannya. Dan jika ia beranjak untuk menunaikan sholat, maka Allah akan menjadikan (dari setiap langkahnya) satu derajat (kedudukan di akhirat), dan jika ia duduk, maka ia telah duduk dalam keadaan selamat.\" Syurahbil bin Ash Shimth berkata, \"Apakah Anda mendengar hadits ini langsung dari Rasulullah shallallahu 'alaihi wasallam wahai Ibnu 'Abasah?\" ia menjawab, \"Ya, dan demi Dzat yang tidak ada Tuhan yang berhak disembah selain Dia, sekiranya saya belum mendengar hadits ini dari Rasulullah shallallahu 'alaihi wasallam lebih dari sekali, atau dua, tiga, empat, lima, enam, atau tujuh kali, maka saya tidak akan bersumpah, yang kumaksudkan saya tidak peduli untuk tidak menceritakannya kepada seorang pun dari manusia, akan tetapi demi Allah, saya tidak ingat lagi berapa kali saya mendengarnya dari Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 2469,
                "arab": "حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ حَدَّثَنَا بَقِيَّةُ حَدَّثَنَا بَحِيرُ بْنُ سَعْدٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ كَثِيرِ بْنِ مُرَّةَ عَنْ عَمْرِو بْنِ عَبَسَةَ أَنَّهُ حَدَّثَهُمْأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ بَنَى لِلَّهِ مَسْجِدًا لِيُذْكَرَ اللَّهُ عَزَّ وَجَلَّ فِيهِ بَنَى اللَّهُ لَهُ بَيْتًا فِي الْجَنَّةِ وَمَنْ أَعْتَقَ نَفْسًا مُسْلِمَةً كَانَتْ فِدْيَتَهُ مِنْ جَهَنَّمَ وَمَنْ شَابَ شَيْبَةً فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ كَانَتْ لَهُ نُورًا يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Haiwah bin Syuraih] Telah menceritakan kepada kami [Baqiyyah] Telah menceritakan kepada kami [Bahirah bin Sa'd] dari [Khalid bin Ma'dan] dari [Katsir bin Murrah] dari [Amru bin 'Abasah] bahwa ia telah menceritakan kepada mereka, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang membangun Masjid karena Allah, dengan tujuan agar Allah senantiasa disebut nama-Nya, maka Allah akan membangunkan baginya rumah di surga. Dan barangsiapa yang memerdekakan satu orang budak wanita muslimah, maka wanita itu akan menjadi tebusannya dari api neraka. Dan siapa yang sehelai rambutnya beruban di jalan Allah 'azza wajalla, maka sehelai rambut itu akan menjadi cahaya baginya kelak pada hari kiamat.\""
            },
            {
                "number": 2470,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا عُثْمَانُ بْنُ عُبَيْدٍ أَبُو دَوْسٍ الْيَحْصَبِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَائِذٍ الثُّمَالِيُّ عَنْ عَمْرِو بْنِ عَبَسَةَ السُّلَمِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرُّ قَبِيلَتَيْنِ فِي الْعَرَبِ نَجْرَانُ وَبَنُو تَغْلِبَ",
                "id": "Telah menceritakan kepada kami [Abul Mughirah] Telah menceritakan kepada kami [Utsman bin Ubaid Abu Idris Al Yahshabi] Telah menceritakan kepada kami [Abdurrahman bin A`idz Ats Tsumali] dari [Amru bin Abasah As Sulami] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua kabilah dari bangsa Arab yang paling jelek adalah Najran dan Banu Taghlib.\""
            },
            {
                "number": 2471,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا ابْنُ عَيَّاشٍ حَدَّثَنِي شُرَحْبِيلُ بْنُ مُسْلِمٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ بْنِ مَوْهَبٍ الْأَمْلُوكِيِّ عَنْ عَمْرِو بْنِ عَبَسَةَ السُّلَمِيِّ قَالَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى السَّكُونِ وَالسَّكَاسِكِ وَعَلَى خَوْلَانَ الْعَالِيَةِ وَعَلَى الْأَمْلُوكِ أَمْلُوكِ رَدْمَانِ",
                "id": "Telah menceritakan kepada kami [Abul Mughirah] Telah menceritakan kepada kami [Ibnu Ayyasy] telah menceritakan kepadaku [Syurahbil bin Muslim] dari [Abdurrahman bin Yazid bin Mauhab Al Amluki] dari [Amru bin 'Abasah As Sulami] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam sholat dengan penuh ketenangan, ketundukan, perhatian yang tinggi, dan penuh penghambaan.\""
            },
            {
                "number": 2472,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا صَفْوَانُ بْنُ عَمْرٍو حَدَّثَنِي شُرَيْحُ بْنُ عُبَيْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَائِذٍ الْأَزْدِيِّ عَنْ عَمْرِو بْنِ عَبَسَةَ السُّلَمِيِّ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْرِضُ يَوْمًا خَيْلًا وَعِنْدَهُ عُيَيْنَةُ بْنُ حِصْنِ بْنِ بَدْرٍ الْفَزَارِيُّ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا أَفْرَسُ بِالْخَيْلِ مِنْكَ فَقَالَ عُيَيْنَةُ وَأَنَا أَفْرَسُ بِالرِّجَالِ مِنْكَ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَكَيْفَ ذَاكَ قَالَ خَيْرُ الرِّجَالِ رِجَالٌ يَحْمِلُونَ سُيُوفَهُمْ عَلَى عَوَاتِقِهِمْ جَاعِلِينَ رِمَاحَهُمْ عَلَى مَنَاسِجِ خُيُولِهِمْ لَابِسُو الْبُرُودِ مِنْ أَهْلِ نَجْدٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَذَبْتَ بَلْ خَيْرُ الرِّجَالِ رِجَالُ أَهْلِ الْيَمَنِ وَالْإِيمَانُ يَمَانٍ إِلَى لَخْمٍ وَجُذَامَ وَعَامِلَةَ وَمَأْكُولُ حِمْيَرَ خَيْرٌ مِنْ آكِلِهَا وَحَضْرَمَوْتُ خَيْرٌ مِنْ بَنِي الْحَارِثِ وَقَبِيلَةٌ خَيْرٌ مِنْ قَبِيلَةٍ وَقَبِيلَةٌ شَرٌّ مِنْ قَبِيلَةٍ وَاللَّهِ مَا أُبَالِي أَنْ يَهْلِكَ الْحَارِثَانِ كِلَاهُمَا لَعَنَ اللَّهُ الْمُلُوكَ الْأَرْبَعَةَ جَمَدَاءَ وَمِخْوَسَاءَ وَمِشْرَخَاءَ وَأَبْضَعَةَ وَأُخْتَهُمْ الْعَمَرَّدَةَ ثُمَّ قَالَ أَمَرَنِي رَبِّي عَزَّ وَجَلَّ أَنْ أَلْعَنَ قُرَيْشًا مَرَّتَيْنِ فَلَعَنْتُهُمْ وَأَمَرَنِي أَنْ أُصَلِّيَ عَلَيْهِمْ فَصَلَّيْتُ عَلَيْهِمْ مَرَّتَيْنِ ثُمَّ قَالَ عُصَيَّةُ عَصَتْ اللَّهَ وَرَسُولَهُ غَيْرَ قَيْسٍ وَجَعْدَةَ وَعُصَيَّةَ ثُمَّ قَالَ لَأَسْلَمُ وَغِفَارُ وَمُزَيْنَةُ وَأَخْلَاطُهُمْ مِنْ جُهَيْنَةَ خَيْرٌ مِنْ بَنِي أَسَدٍ وَتَمِيمٍ وَغَطَفَانَ وَهَوَازِنَ عِنْدَ اللَّهِ عَزَّ وَجَلَّ يَوْمَ الْقِيَامَةِ ثُمَّ قَالَ شَرُّ قَبِيلَتَيْنِ فِي الْعَرَبِ نَجْرَانُ وَبَنُو تَغْلِبَ وَأَكْثَرُ الْقَبَائِلِ فِي الْجَنَّةِ مَذْحِجٌ وَمَأْكُولُقَالَ قَالَ أَبُو الْمُغِيرَةِ قَالَ صَفْوَانُ حِمْيَرَ حِمْيَرَ خَيْرٌ مِنْ آكِلِهَا قَالَ مَنْ مَضَى خَيْرٌ مِمَّنْ بَقِيَ",
                "id": "Telah menceritakan kepada kami [Abu Al Mughirah] Telah menceritakan kepada kami [Shafwan bin Amru] telah menceritakan kepadaku [Syuraih bin Ubaid] dari [Abdurrahman bin A'idz Al Azdi] dari [Amru bin Abasah As Sulami] ia berkata; Pada suatu hari Rasulullah shallallahu 'alaihi wasallam menampakkan seekor kuda, dan di sisi beliau terdapat Uyainah bin Hishn bin Badr Al Fazari. Maka Rasulullah shallallahu 'alaihi wasallam bersabda padanya: \"Aku lebih pandai dan lihai bermain kuda darimu.\" Maka Uyainah berkata, \"Dan saya lebih lihai berperang daripada Anda.\" Kemudian Nabi shallallahu 'alaihi wasallam pun bertanya kepadanya, \"Kenapa bisa begitu?\" Ia menjawab, \"Sebaik-baiki pasukan adalah mereka yang membawa pedangnya di atas pundaknya, meletakkan tombaknya di atas pundak kudanya, dan mereka mengenakan Burud (sejenis pakaian luar), dan mereka berasal dari penduduk Najed.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kamu telah berdusta, bahkan sebaik-baik kstaria adalah para ksatria penduduk Yaman. Iman merupakan penisbatan ke negeri Yaman hingga suku Lakhm, Judzam, dan 'Amilah. Ma`kul dari Himyar lebih baik daripada `Akilnya. Khadramaut lebih baik daripada Bani Harits. Ada kabilah yang lebih baik dari kabilah yang lain dan ada juga kabilah yang lebih buruk dari kabilah yang lain. Demi Allah, saya tidak peduli lagi sekiranya dua kabilah Harits binasa. Semoga Allah melaknati Al Muluk Al Arba'ah (raja yang empat) yaitu, Jamada`, Mikhwasa`, Misyrakha` dan Abdla'ah, serta saudara perempuan mereka Al 'Amarradah.\" Kemudian beliau juga bersabda: \"Allah telah memerintahkanku untuk melaknati suku Quraisy sebanyak dua kali, maka aku pun melaknati mereka. Dan Allah juga memerintahkanku untuk bershalawat atas mereka, maka saya pun bershalawat atas mereka sebanyak dua kali. Suku 'Ushayyah telah durhaka kepada Allah dan Rasul-Nya, selain Qais, Ja'dah dan 'Ushayyah.\" Beliau bersabda lagi: \"Bani Aslam, Ghifar, dan Muzainah serta suku yang bergabung bersama mereka dari Juhainah adalah lebih baik daripada Bani Asad, Tamim, Ghathafan dan Hawazin di sisi Allah pada hari kiamat.\" Beliau bersabda lagi: \"Dua kabilah yang paling buruk di negeri Arab adalah Najran dan Bani Taghlib. Dan kabilah yang paling banyak di surga adalah Majhij dan Ma`kul.\" Abul Mughrah berkata; \"Shafwan adalah Himyar, Himyar lebih baik dari `Akilnya. Mereka yang telah berlalu adalah lebih baik dari mereka yang tersisa.\""
            },
            {
                "number": 2473,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا حُصَيْنٌ عَنِ الشَّعْبِيِّ عَنْ مُحَمَّدِ بْنِ صَيْفِيٍّ الْأَنْصَارىِّ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي يَوْمِ عَاشُورَاءَ فَقَالَ أَصُمْتُمْ يَوْمَكُمْ هَذَا فَقَالَ بَعْضُهُمْ نَعَمْ وَقَالَ بَعْضُهُمْ لَا قَالَ فَأَتِمُّوا بَقِيَّةَ يَوْمِكُمْ هَذَا وَأَمَرَهُمْ أَنْ يُؤْذِنُوا أَهْلَ الْعَرُوضِ أَنْ يُتِمُّوا يَوْمَهُمْ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Husyain] telah mengabarkan kepada kami [Hushain] dari [Asy Sya'bi] dari [Muhammad bin Shaifi Al Anshari] ia berkata; Pada hari 'Asyuraa` Rasulullah shallallahu 'alaihi wasallam menemui kami, kemudian beliau bertanya: \"Apakah kalian berpuasa pada hari ini?\" Sebagian mereka menjawab: \"Ya.\" Dan sebagian yang lain menjawab, \"Tidak.\" Beliau bersabda: \"Sempurnakanlah puasa dari sisa hari kalian ini.\" Lalu beliau memerintahkan mereka untuk mngumumkan kepada penduduk 'Arudh (penduduk Makkah dan Madinah) agar mereka menyempurnakan puasa pada hari itu."
            },
            {
                "number": 2474,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا عُثْمَانُ بْنُ حَكِيمٍ الْأَنْصَارِيُّ عَنْ خَارِجَةَ بْنِ زَيْدٍ عَنْ عَمِّهِ يَزِيدَ بْنِ ثَابِتٍ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا وَرَدْنَا الْبَقِيعَ إِذَا هُوَ بِقَبْرٍ جَدِيدٍ فَسَأَلَ عَنْهُ فَقِيلَ فُلَانَةُ فَعَرَفَهَا فَقَالَ أَلَا آذَنْتُمُونِي بِهَا قَالُوا يَا رَسُولَ اللَّهِ كُنْتَ قَائِلًا صَائِمًا فَكَرِهْنَا أَنْ نُؤْذِنَكَ فَقَالَ لَا تَفْعَلُوا لَا يَمُوتَنَّ فِيكُمْ مَيِّتٌ مَا كُنْتُ بَيْنَ أَظْهُرِكُمْ أَلَا آذَنْتُمُونِي بِهِ فَإِنَّ صَلَاتِي عَلَيْهِ لَهُ رَحْمَةٌ قَالَ ثُمَّ أَتَى الْقَبْرَ فَصَفَّنَا خَلْفَهُ وَكَبَّرَ عَلَيْهِ أَرْبَعًا",
                "id": "Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Utsman bin Hakim Al Anshari] dari [Kharijah bin Zaid] dari [pamannya] yakni Yazid bin Tsabit, ia berkata; Kami pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam, ketika kami melewati Baqi' beliau melihat ada sebuah kuburan baru, maka beliau menanyakannya. Kemudian disampaikan bahwa itu si Fulanah, dan beliau ternyata mengenalnya. Maka beliau bersabda: \"Mengapa kalian tidak memberitahukan aku (tentang kematiannya)?\" para sahabat menjawab, \"Ya Rasulallah, ketika itu Anda sedang sedang Qailulah (tidur siang) dan berpuasa, sehingga kami enggan untuk memberitahukanmu.\" Beliau bersabda: \"Jangan demikian. Dan janganlah sekali-kali salah seorang di antara ada yang mati sedang saya masih berada ditengah-tengah kalian, kemudian kalian tidak memberitahukanku. Sebab sholat-ku atasnya adalah rahmat.\" Akhirnya beliau mendatangi kubur tadi dan membariskan kami dibelakangnya lalu beliau takbir dengan empat kali takbir."
            },
            {
                "number": 2475,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ عُثْمَانَ يَعْنِي ابْنَ حَكِيمٍ عَنْ خَارِجَةَ بْنِ زَيْدٍ عَنْ عَمِّهِ يَزِيدَ بْنِ ثَابِتٍ أَنَّهُكَانَ جَالِسًا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَصْحَابِهِ فَطَلَعَتْ جِنَازَةٌ فَلَمَّا رَآهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَارَ وَثَارَ أَصْحَابُهُ مَعَهُ فَلَمْ يَزَالُوا قِيَامًا حَتَّى نَفَذَتْ قَالَ وَاللَّهِ مَا أَدْرِي مِنْ تَأَذٍّ بِهَا أَوْ مِنْ تَضَايُقِ الْمَكَانِ وَلَا أَحْسِبُهَا إِلَّا يَهُودِيًّا أَوْ يَهُودِيَّةً وَمَا سَأَلْنَا عَنْ قِيَامِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] dari [Utsman] yakni Ibnu Hakim, dari [Kharijah bin Zaid] dari [pamannya] yakni Yazid bin Tsabit, bahwa ia pernah duduk bersama Rasulullah shallallahu 'alaihi wasallam beserta para sahabatnya. Kemudian muncullah sekelompok orang yang sedang mengusung jenazah. Ketika Rasulullah shallallahu 'alaihi wasallam melihatnya, beliau minggir seraya berdiri yang diikuti oleh para sahabat, mereka tetap dalam keadaan berdiri hingga para pengusung janazah tersebut berlalu. Yazid bin Tsabit berkata; \"Aku tidak tahu (sebab Rasul berdiri), apakah karena khawatir kami menyakiti jenazah, ataukah karena sempitnya tempat itu. Dan saya duga, beliau lakukan demikian tidak lain kecuali itu adalah jenazah seorang wanita Yahudi. Dan kami tidak bertanya sebab berdirinya Rasulullah shallallahu 'alaihi wasallam."
            },
            {
                "number": 2476,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ أَخْبَرَنَا ابْنُ جُرَيْجٍ عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ عَنْ عَمْرِو بْنِ شَرِيدٍ عَنْ أَبِيهِ الشَّرِيدِ بْنِ سُوَيْدٍ قَالَمَرَّ بِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا جَالِسٌ هَكَذَا وَقَدْ وَضَعْتُ يَدِي الْيُسْرَى خَلْفَ ظَهْرِي وَاتَّكَأْتُ عَلَى أَلْيَةِ يَدِي فَقَالَ أَتَقْعُدُ قَعْدَةَ الْمَغْضُوبِ عَلَيْهِمْ",
                "id": "Telah menceritakan kepada kami [Ali bin Bahr] Telah menceritakan kepada kami [Isa bin Yunus] telah mengabarkan kepada kami [Ibnu Juraij] dari [Ibrahim bin Maisarah] dari [Amru bin Syarid] dari [bapaknya, Asy Syarid] bin Suwaid, ia berkata; Rasulullah shallallahu 'alaihi wasallam melintas didepanku sementara aku sedang duduk dengan posisi tangan kiri dibelakang punggungku dan aku bersandar kepada jempol tanganku, lalu beliau berkata kepadaku: \"Apakah kamu duduk dengan cara duduknya AL MAGDHUUBI 'ALAIHIM (orang yang dimurkai Allah)?\""
            },
            {
                "number": 2477,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنِ الشَّرِيدِأَنَّ أُمَّهُ أَوْصَتْ أَنْ يُعْتِقُوا عَنْهَا رَقَبَةً مُؤْمِنَةً فَسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَقَالَ عِنْدِي جَارِيَةٌ سَوْدَاءُ نُوبِيَّةٌ فَأُعْتِقُهَا عَنْهَا فَقَالَ ائْتِ بِهَا فَدَعَوْتُهَا فَجَاءَتْ فَقَالَ لَهَا مَنْ رَبُّكِ قَالَتْ اللَّهُ قَالَ مَنْ أَنَا قَالَتْ أَنْتَ رَسُولُ اللَّهِ قَالَ أَعْتِقْهَا فَإِنَّهَا مُؤْمِنَةٌ",
                "id": "Telah menceritakan kepada kami [Abdush Shamad] Telah menceritakan kepada kami [Hammad bin Salamah] Telah menceritakan kepada kami [Muhammad bin Amru] dari [Abu Salamah] dari [Asy Syarid] bahwa ibunya telah berwasiat agar mereka memerdekakan untuknya seorang budak wanita mukminah. Maka ia pun menanyakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, dan ia berkata, \"Saya memiliki seorang budak wanita hitam Nubiyyah, apakah dia yang saya bebaskan?\" beliau bersabda: \"Datangkanlah ia kemari.\" Budak wanita itu pun datang dan beliau langsung bertanya: \"Siapakah Rabb-mu?\" ia menjawab, \"Allah.\" Beliau bertanya lagi: \"Siapakah saya?\" ia menjawab: \"Anda adalah Rasulullah.\" Beliau bersabda: \"Merdekakanlah wanita itu, karena ia adalah seorang wanita mukminah.\""
            },
            {
                "number": 2478,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا وَبْرُ بْنُ أَبِي دُلَيْلَةَ شَيْخٌ مِنْ أَهْلِ الطَّائِفِ عَنِ مُحَمَّدِ بْنِ مَيْمُونِ بْنِ مُسَيْكَةَ وَأَثْنَى عَلَيْهِ خَيْرًا عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيُّ الْوَاجِدِ يُحِلُّ عِرْضَهُ وَعُقُوبَتَهُقَالَ وَكِيعٌ عِرْضُهُ شِكَايَتُهُ وَعُقُوبَتُهُ حَبْسُهُ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Wabr bin Abu Dulailah] yakni seorang syaikh dari Tha`if, dari [Muhammad bin Maimun bin Musaikah] -ia pun memujinya dengan kebaikan- dari [Amru bin Syarid] dari [bapaknya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penangguhan (hutang) seorang yang mampu, menghalalkan kehormatan dan hukumannya.\" Waki' berkata; Kehormatannya adalah diadukan (kepada hakim) sedangkan hukumannya adalah dipenjara."
            },
            {
                "number": 2479,
                "arab": "حَدَّثَنَا مَكِّيُّ بْنُ إِبْرَاهِيمَ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي إِبْرَاهِيمُ بْنُ مَيْسَرَةَ عَنْ عَمْرٍو عَنِ الشَّرِيدِ أَنَّهُ سَمِعَهُ يُخْبِرُهُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا وَجَدَ الرَّجُلَ رَاقِدًا عَلَى وَجْهِهِ لَيْسَ عَلَى عَجُزِهِ شَيْءٌ رَكَضَهُ بِرِجْلِهِ وَقَالَ هِيَ أَبْغَضُ الرِّقْدَةِ إِلَى اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Makki bin Ibrahim] Telah menceritakan kepada kami [Ibnu Juraij] ia berkata, telah mengabarkan kepadaku [Ibrahim bin Maisarah] dari [Amru bin Asy Syarid] dari [Asy Syarid] bahwa ia mendengarnya mengabarkan kepadanya dari Nabi shallallahu 'alaihi wasallam bahwasanya; Bila beliau mendapatkan seseorang yang sedang tidur dengan menelungkupkan wajahnya, dengan pantat tidak diselimuti kain yang bisa disepaknya dengan kaki, beliau bersabda: \"Itu adalah posisi tidur yang paling dibenci Allah 'azza wajalla.\""
            },
            {
                "number": 2480,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ أَخْبَرَنَا قَتَادَةُ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنِ الشَّرِيدِ بْنِ سُوَيْدٍ الثَّقَفِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ جَارُ الدَّارِ أَحَقُّ بِالدَّارِ مِنْ غَيْرِهِ",
                "id": "Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Hammam] telah mengabarkan kepada kami [Qatadah] dari [Amru bin Syu'aib] dari [Asy Syarid bin Suwaid Ats Tsaqafi] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Tetangga rumah lebih berhak untuk ditawari membeli rumah (hak syuf'ah) dari pada yang lainnya.\""
            },
            {
                "number": 2481,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ أَخْبَرَنَا حُسَيْنٌ الْمُعَلِّمُ عَنْ عَمْرِو بْنِ شُعَيْبٍ حَدَّثَنِي عَمْرُو بْنُ الشَّرِيدِ عَنْ أَبِيهِ الشَّرِيدِ بْنِ سُوَيْدٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَرْضٌ لَيْسَ لِأَحَدٍ فِيهَا شِرْكٌ وَلَا قَسْمٌ إِلَّا الْجِوَارُ قَالَ الْجَارُ أَحَقُّ بِسَقَبِهِ مَا كَانَ",
                "id": "Telah menceritakan kepada kami [Abdul Wahhab bin Atha`] telah mengabarkan kepada kami [Husain Al Mu'allim] dari [Amru bin Syu'aib] telah menceritakan kepadaku [Amru bin Asy Syarid] dari [bapaknya] yakni Syarid bin Suwaid, ia berkata; Saya bertanya, \"Wahai Rasulullah, bagaimana dengan tanah (pribadi) yang padanya tidak ada persekutuan dan tidak pula pembagian kecuali tetangga?\" berliau menjawab: \"Tetangga itu lebih berhak ditawari untuk membeli tanah itu daripada yang lain.\""
            },
            {
                "number": 2482,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ وَالْخَفَّافُ أَخْبَرَنَا حُسَيْنٌ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ عَمْرِو بْنِ الشَّرِيدِ عَنْ أَبِيهِ الشَّرِيدِ بْنِ سُوَيْدٍأَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ قَالَ الْخَفَّافُ قُلْتُ يَا رَسُولَ اللَّهِ أَرْضٌ لَيْسَ لِأَحَدٍ فِيهَا شِرْكٌ وَلَا قَسْمٌ إِلَّا الْجِوَارُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْجَارُ أَحَقُّ بِسَقَبِهِ مَا كَانَ",
                "id": "Telah menceritakan kepada kami [Rauh] Telah menceritakan kepada kami [Husain Al Mu'allim] dan [Al Khaffaf] telah mengabarkan kepada kami [Husain] dari [Amru bin Syu'aib] dari [Amru bin Syarid] dari [bapaknya] yakni Syarid bin Suwaid, bahwa seorang laki-laki berkata; \"Wahai Rasulullah, itu Al Khaffaf.\" Saya bertanya, \"Wahai Rasulullah, bagaimana dengan tanah (milik priadi) yang padanya tidak ada persekutuan dan tidak pula pembagian kecuali tetangga?\" beliau menjawab: \"Tetangga itu lebih berhak untuk ditawari membeli tanah itu daripada yang lain.\""
            },
            {
                "number": 2483,
                "arab": "حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ أَخْبَرَنِي وَبْرُ بْنُ أَبِي دُلَيْلَةَ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ مَيْمُونِ بْنِ مُسَيْكَةَ قَالَ حَدَّثَنِي عَمْرُو بْنُ الشَّرِيدِ قَالَ حَدَّثَنِي أَبِي قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَيُّ الْوَاجِدِ يُحِلُّ عِرْضَهُ وَعُقُوبَتَهُ",
                "id": "Telah menceritakan kepada kami [Adl Dlahak bin Makhlad] telah mengabarkan kepadaku [Wabr bin Abu Dulailah] ia berkata, telah mengabarkan kepadaku [Muhammad bin Abdullah bin Maimun bin Musaikah] ia berkata, telah menceritakan kepadaku [Amru bin Syarid] ia berkata, telah menceritakan kepadaku [bapakku] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Penangguhan (hutang) seorang yang mampu, menghalalkan kehormatan dan hukumannya.\" "
            },
            {
                "number": 2484,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَاقَ أَخْبَرَنَا إِبْرَاهِيمُ بْنُ مَيْسَرَةَ أَنَّهُ سَمِعَ يَعْقُوبَ بْنَ عَاصِمِ بْنِ عُرْوَةَ يَقُولُ سَمِعْتُ الشَّرِيدَ يَقُولُأَشْهَدُ لَوَقَفْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرَفَاتٍ قَالَ فَمَا مَسَّتْ قَدَمَاهُ الْأَرْضَ حَتَّى أَتَى جَمْعًا",
                "id": "Telah menceritakan kepada kami [Rauh] Telah menceritakan kepada kami [Zakariya bin Ishaq] telah mengabarkan kepada kami [Ibrahim bin Maisarah] bahwa ia mendengar [Ya'qub bin Ashim bin Urwah] berkata, saya mendengar [Asy Syarid] berkata; \"Saya bersaksi bahwa saya benar-benar telah wukuf bersama Rasulullah shallallahu 'alaihi wasallam di Arafah. Kaki beliau sama sekali tidak menyentuh tanah hingga beliau datang ke Jam' (Muzdalifah).\""
            },
            {
                "number": 2485,
                "arab": "حَدَّثَنَا مُهَنَّأُ بْنُ عَبْدِ الْحَمِيدِ قَالَ أَبِي كُنْيَتُهُ أَبُو شِبْلٍ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنِ الشَّرِيدِأَنَّ أُمَّهُ أَوْصَتْ أَنْ يُعْتَقَ عَنْهَا رَقَبَةٌ مُؤْمِنَةٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمِّي أَوْصَتْ أَنْ يُعْتَقَ عَنْهَا رَقَبَةٌ مُؤْمِنَةٌ وَعِنْدِي جَارِيَةٌ نُوبِيَّةٌ سَوْدَاءُ فَقَالَ ادْعُ بِهَا فَجَاءَ بِهَا فَقَالَ لَهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ رَبُّكِ قَالَتْ اللَّهُ قَالَ مَنْ أَنَا قَالَتْ أَنْتَ رَسُولُ اللَّهِ قَالَ أَعْتِقْهَا فَإِنَّهَا مُؤْمِنَةٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Hamid] telah berkata bapakku kunyahnya adalah Abu Syibl, Telah menceritakan kepada kami [Hammad bin Salamah] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Asy Syarid] bahwa ibunya telah berwasiat agar kemudian hari satu orang budak wanita mukminah dimerdekakn baginya, maka ia pun berkata, \"Wahai Rasulullah, Ibuku telah berwasiat, agar dimerdekakan baginya seorang budak wanita mukminah. Sementara saya hanya memiliki budak wanita Nubiyyah berkulit hitam. Beliau bersabda: \"Panggillah ia.\" Maka ia pun membawanya. Nabi shallallahu 'alaihi wasallam bertanya pada budak wanita itu, \"Siapa Rabb-mu.\" Budak Wanita itu menjawab, \"Allah.\" Beliau bertanya lagi: \"Siapakah aku?\" wanita itu pun menjawab, \"Anda adalah Rasulullah.\" Maka beliau bersabda: \"Merdekakanlah ia, karena wanita itu adalah wanita mukminah.\""
            },
            {
                "number": 2486,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ اللَّهِ بْنِ ثَعْلَبَةَ الْأَنْصَارِيِّ عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ الْأَنْصَارِيِّ عَنْ مُجَمِّعِ بْنِ جَارِيَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَيَقْتُلَنَّ ابْنُ مَرْيَمَ الدَّجَّالَ بِبَاب لُدٍّ أَوْ إِلَى جَانِبِ لُدٍّ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abdullah bin ubaidhullah bin Tsa'labah Al Anshari] dari [Abdullah bin Zaid Al Anshari] dari [Mujammi' bin Jariyah] ia berkata; Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ibnu Maryam benar-benar akan membunuh Dajjal di Bab ludd atau dengan redaksi \"di Janibb Ludd\".\" "
            },
            {
                "number": 2487,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يَعْلَى بْنُ عَطَاءٍ عَنْ عُمَارَةَ بْنِ حَدِيدٍ عَنْ صَخْرٍ الْغَامِدِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ بَارِكْ لِأُمَّتِي فِي بُكُورِهَا قَالَ وَكَانَ إِذَا بَعَثَ سَرِيَّةً أَوْ جَيْشًا بَعَثَهُمْ مِنْ أَوَّلِ النَّهَارِقَالَ وَكَانَ صَخْرٌ رَجُلًا تَاجِرًا فَكَانَ يَبْعَثُ تِجَارَتَهُ مِنْ أَوَّلِ النَّهَارِ قَالَ فَأَثْرَى وَكَثُرَ مَالُهُ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Ya'la bin Atha`] dari [Umarah bin Hadid] dari [Shakhr Al Ghamidi] berkata; Rasulullah shallallahu 'alaihi wasallam berdo'a: \"ALLAHUMMA BAARIK LUMMATII FI BUKUURIHAA (Ya Allah, berilah keberkahan pada umatku di waktu padi harinya).\" Dan jika beliau hendak mengutus Sariyyah (pasukan khusus untuk operasi tertentu), maka beliau akan mengutusnya pada permulaan hari (waktu pagi). Shakhr adalah seorang pedagang dan dia selalu mengirim barang dagangannya sejak pagi hari. Karenanya ia kaya dan hartanya berlimpah."
            },
            {
                "number": 2488,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا شُعْبَةُ قَالَ يَعْلَى بْنُ عَطَاءٍ أَنْبَأَنِي قَالَ سَمِعْتُ عُمَارَةَ بْنَ حَدِيدٍ رَجُلًا مِنْ بَجِيلَةَ قَالَ سَمِعْتُ صَخْرًا الْغَامِدِيَّ رَجُلًا مِنْ الْأَزْدِ يَقُولُإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُمَّ بَارِكْ لِأُمَّتِي فِي بُكُورِهَا قَالَ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَعَثَ سَرِيَّةً بَعَثَهُمْ مِنْ أَوَّلِ النَّهَارِوَكَانَ صَخْرٌ رَجُلًا تَاجِرًا وَكَانَ لَهُ غِلْمَانٌ فَكَانَ يَبْعَثُ غِلْمَانَهُ مِنْ أَوَّلِ النَّهَارِ قَالَ فَكَثُرَ مَالُهُ حَتَّى كَانَ لَا يَدْرِي أَيْنَ يَضَعُهُ",
                "id": "Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Syu'bah] ia berkata, telah memberitakan kepadaku [Ya'la bin Atha`] ia berkata, saya mendengar [Umarah bin Hadid] seorang dari Bajilah, ia berkata, saya mendengar [Shakhr Al Ghamidi] seorang laki-laki dari Al Azd, berkata; Bahwa Nabi shallallahu 'alaihi wasallam berdo'a: \"ALLAHUMMA BAARIK LIUMMATII FI BUKUURIHAA (Ya Allah, berilah keberkahan pada untuk ummatku di waktu pagi mereka).\" Dan jika Nabi shallallahu 'alaihi wasallam mengirim Sariyyah (pasukan khusus yang dikirim untuk operasi tertentu), maka belia mengirimnya pada pagi hari. Kemudian Shakhr adalah seorang penjual, dan ia juga tidak pernah mengirim para pelayannya kecuali pada permulaan hari (pagi hari), sehingga hartanya pun semakin berkembang dan banyak, sampai ia tidak tahu lagi di mana ia letakkan hartanya."
            },
            {
                "number": 2489,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ عُمَارَةَ بْنِ حَدِيدٍ الْبَجَلِيِّ عَنْ صَخْرٍ الْغَامِدِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ اللَّهُمَّ بَارِكْ لِأُمَّتِي فِي بُكُورِهَا قَالَ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا بَعَثَ سَرِيَّةً بَعَثَهَا أَوَّلَ النَّهَارِوَكَانَ صَخْرٌ تَاجِرًا فَكَانَ لَا يَبْعَثُ غِلْمَانَهُ إِلَّا مِنْ أَوَّلِ النَّهَارِ فَكَثُرَ مَالُهُ حَتَّى كَانَ لَا يَدْرِي أَيْنَ يَضَعُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin Atha`] dari [Umarah bin Hadid Al Bajali] dari [Shakhr Al Ghamidi] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau pernah berdo'a: \"ALLAHUMMA BAARIK LIUMMATII FI BUKUURIHAA (Ya Allah, berilah keberkahan pada untuk ummatku di waktu pagi mereka).\" Dan jika Nabi shallallahu 'alaihi wasallam mengirim Sariyyah (pasukan khusus yang dikirim untuk operasi tertentu), maka belia mengirimnya pada pagi hari. Kemudian Shakhr adalah seorang penjual, dan ia juga tidak pernah mengirim para pelayannya kecuali pada permulaan hari (pagi hari), sehingga hartanya pun semakin berkembang dan banyak, sampai ia tidak tahu lagi di mana ia letakkan hartanya."
            },
            {
                "number": 2490,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ الْمَرْوَزِيُّ قَالَ حَدَّثَنَا يُوسُفُ بْنُ يَعْقُوبَ الْمَاجِشُونُ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ قَالَدَخَلْتُ عَلَى جَابِرِ بْنِ عَبْدِ اللَّهِ وَهُوَ يَمُوتُ فَقُلْتُ أَقْرِئْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنِّي السَّلَامَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Muqatil Al Marwazi] ia berkata, Telah menceritakan kepada kami [Yusuf bin Ya'qub Al Majisyun] ia berkata, telah mengabarkan kepadaku [Muhammad bin Al Munkadir] ia berkata; Aku menemui [Jabir bin Abdullah] yang saat itu telah meninggal. Aku pun berkata, \"Sampaikanlah salam dariku kepada Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 2491,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَخْبَرَنَا عَبَّادُ بْنُ الْعَوَّامِ حَدَّثَنَا الْحَجَّاجُ عَنْ عَبْدِ اللَّهِ مَوْلَى بَنِي هَاشِمٍ قَالَ وَكَانَ ثِقَةً قَالَ وَكَانَ الْحَكَمُ يَأْخُذُ عَنْهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ أُسَيْدِ بْنِ حُضَيْرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ أَلْبَانِ الْإِبِلِ فَقَالَ تَوَضَّئُوا مِنْ أَلْبَانِهَا وَسُئِلَ عَنْ أَلْبَانِ الْغَنَمِ فَقَالَ لَا تَوَضَّئُوا مِنْ أَلْبَانِهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Muqatil] telah mengabarkan kepada kami [Abbad bin Al Awwam] Telah menceritakan kepada kami [Al Hajjaj] dari [Abdullah] bekas budak Bani Hasyim, ia berkata; ia adalah seorang yang Tsiqqah, ia berkata, Al Hakam meriwayatkan darinya, dari [Abdurrahman bin Abu Laila] dari [Usaid bin Hudlair] dari Nabi shallallahu 'alaihi wasallam, beliau ditanya tentang air susu Unta, maka beliau bersabda: \"Berwudlulah kalian setelah meminum susu Unta.\" Kemudian beliau ditanya tentang susu kambing, maka beliau bersabda: \"Janganlah kalian berwudlu setelah meminumnya.\""
            },
            {
                "number": 2492,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ حَدَّثَنَا ابْنُ الْمُبَارَكِ أَخْبَرَنَا مِسْعَرٌ عَنْ حَمَّادٍ قَالَالْبَوْلُ عِنْدَنَا بِمَنْزِلَةِ الدَّمِ مَا لَمْ يَكُنْ قَدْرَ الدِّرْهَمِ فَلَا بَأْسَ بِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Muqatil] Telah menceritakan kepada kami [Ibnul Mubarak] telah mengabarkan kepada kami [Mis'ar] dari [Hammad] ia berkata; \"Air kencing menurut kami sama dengan darah, apabila tidak sampai ukuran uang dirham maka tidaklah mengapa.\""
            },
            {
                "number": 2493,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ إِنَّ الْمَعْرُوفَ وَالْمُنْكَرَ خَلِيقَتَانِ يُنْصَبَانِ لِلنَّاسِ يَوْمَ الْقِيَامَةِ فَأَمَّا الْمَعْرُوفُ فَيُبَشِّرُ أَصْحَابَهُ وَيُوعِدُهُمْ الْخَيْرَ وَأَمَّا الْمُنْكَرُ فَيَقُولُ إِلَيْكُمْ إِلَيْكُمْ وَمَا يَسْتَطِيعُونَ لَهُ إِلَّا لُزُومًا",
                "id": "Telah menceritakan kepada kami [Abdush Shamad] Telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Hasan] dari [Abu Musa Al Asy'ari] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwa muhammad berada ditangan-Nya, sesungguhnya sesuatu yang ma'ruf dan yang munkar pada hari kiamat nanti akan menjadi makhluk seperti manusia, adapun suatu yang ma'ruf, maka dia akan memberikan kabar gembira kepada para pelakunya dan memberikan janji-janji berupa kebaikan, sementara suatu yang munkar maka dia akan berkata, 'Pergilah kalian-pergilah kalian.' namun mereka tidak mampu kecuali mereka akan menetapinya.\""
            },
            {
                "number": 2494,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ إِبْرَاهِيمَ أَخْبَرَنَا لَيْثٌ عَنْ أَبِي بُرْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ قَيْسٍ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةً ثُمَّ قَالَ عَلَى مَكَانِكُمْ اثْبُتُوا ثُمَّ أَتَى الرِّجَالَ فَقَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَأْمُرُنِي أَنْ آمُرَكُمْ أَنْ تَتَّقُوا اللَّهَ تَعَالَى وَأَنْ تَقُولُوا قَوْلًا سَدِيدًا ثُمَّ تَخَلَّلَ إِلَى النِّسَاءِ فَقَالَ لَهُنَّ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَأْمُرُنِي أَنْ آمُرَكُنَّ أَنْ تَتَّقُوا اللَّهَ وَأَنْ تَقُولُوا قَوْلًا سَدِيدًا قَالَ ثُمَّ رَجَعَ حَتَّى أَتَى الرِّجَالَ فَقَالَ إِذَا دَخَلْتُمْ مَسَاجِدَ الْمُسْلِمِينَ وَأَسْوَاقَهُمْ وَمَعَكُمْ النَّبْلُ فَخُذُوا بِنُصُولِهَا لَا تُصِيبُوا بِهَا أَحَدًا فَتُؤْذُوهُ أَوْ تَجْرَحُوهُ",
                "id": "Telah menceritakan kepada kami [Abdush Shamad] Telah menceritakan kepada kami [Yazid] yakni Ibnu Ibrahim, telah mengabarkan kepada kami [Laits] dari [Abu Burdah] dari [Abdullah bin Qais] ia berkata; Suatu ketika Rasulullah shallallahu 'alaihi wasallam sholat mengimami kami, kemudian beliau bersabda: \"Kalian tetaplah berada di tempat.\" Beliau kemudian mendatangi tempat kaum laki-laki dan bersabda: \"Sesungguhnya Allah 'azza wajalla telah memerintahkan aku untuk memerintahkan kalian agar kalian selalu betaqwa kepada Allah dan selalu berkata dengan kata-kata yang baik.\" Setelah itu, beliau berjalan menuju kaum wanita, kemudian beliau bersabda: \"Sesungguhnya Allah 'azza wajalla telah memerintahkan aku untuk memerintahkan kalian agar kalian selalu bertaqwa kepada Allah dan selalu berkata dengan kata-kata yang baik.\" kemudian beliau kembali lagi ketempat kaum laki-laki dan bersabda: \"Apabila kalian masuk ke dalam masjid atau pasar kaum muslimin sementara kalian membawa tombak, maka peganglah ujungnya (matanya), janganlah sampai kalian mencelakai atau melukai seseorang.\""
            },
            {
                "number": 2495,
                "arab": "حَدَّثَنَا هُشَيْمٌ عَنْ مُجَالِدٍ عَنِ الشَّعْبِيِّ قَالَكَتَبَ عُمَرُ فِي وَصِيَّتِهِ أَنْ لَا يُقَرَّ لِي عَامِلٌ أَكْثَرَ مِنْ سَنَةٍ وَأَقِرُّوا الْأَشْعَرِيَّ يَعْنِي أَبَا مُوسَى أَرْبَعَ سِنِينَ",
                "id": "Telah menceritakan kepada kami [Husyaim] dari [Mujalid] dari [Asy Sya'bi] ia berkata; [Umar] menulis dalam wasiatnya: \"Pejabat-pejabatku untuk tidak dilantik menjabat melebihi setahun.\" Sementara mereka melantik al- Alasy'ari yakni Abu Musa untuk masa jabatan empat tahun."
            },
            {
                "number": 2496,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا لَيْثٌ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَىأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا مَرَّتْ بِكُمْ جِنَازَةُ يَهُودِيٍّ أَوْ نَصْرَانِيٍّ أَوْ مُسْلِمٍ فَقُومُوا لَهَا فَلَسْتُمْ لَهَا تَقُومُونَ إِنَّمَا تَقُومُونَ لِمَنْ مَعَهَا مِنْ الْمَلَائِكَةِ",
                "id": "Telah menceritakan kepada kami [Abdush Shamad] Telah menceritakan kepada kami [Laits] dari [Abu Burdah] dari [Abu Musa] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila dihadapan kalian lewat jenazah orang yahudi atau nasrani atau muslim, maka hendaklah kalian berdiri! Berdiri tersebut bukan untuk menghormati jenazah itu, akan tetapi untuk yang bersamanya yaitu para malaikat.\""
            },
            {
                "number": 2497,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ وَعَفَّانُ قَالَا حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا عَلِيُّ بْنُ زَيْدٍ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ الرَّقَاشِيِّ عَنِ الْأَشْعَرِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ بَيْنَ يَدَيْ السَّاعَةِ الْهَرْجَ قَالُوا وَمَا الْهَرْجُ قَالَ الْقَتْلُ قَالُوا أَكْثَرُ مِمَّا نَقْتُلُ إِنَّا لَنَقْتُلُ كُلَّ عَامٍ أَكْثَرَ مِنْ سَبْعِينَ أَلْفًا قَالَ إِنَّهُ لَيْسَ بِقَتْلِكُمْ الْمُشْرِكِينَ وَلَكِنْ قَتْلُ بَعْضِكُمْ بَعْضًا قَالُوا وَمَعَنَا عُقُولُنَا يَوْمَئِذٍ قَالَ إِنَّهُ لَتُنْزَعُ عُقُولُ أَهْلِ ذَلِكَ الزَّمَانِ وَيُخَلَّفُ لَهُ هَبَاءٌ مِنْ النَّاسِ يَحْسِبُ أَكْثَرُهُمْ أَنَّهُمْ عَلَى شَيْءٍ وَلَيْسُوا عَلَى شَيْءٍقَالَ عَفَّانُ فِي حَدِيثِهِ قَالَ أَبُو مُوسَى وَالَّذِي نَفْسِي بِيَدِهِ مَا أَجِدُ لِي وَلَكُمْ مِنْهَا مَخْرَجًا إِنْ أَدْرَكَتْنِي وَإِيَّاكُمْ إِلَّا أَنْ نَخْرُجَ مِنْهَا كَمَا دَخَلْنَا فِيهَا لَمْ نُصِبْ مِنْهَا دَمًا وَلَا مَالًا",
                "id": "Telah menceritakan kepada kami [Abdush Shamad] dan [Affan] ia berkata, Telah menceritakan kepada kami [Hammad bin Salamah] telah mengabarkan kepada kami [Ali bin Zaid] dari [Hiththan bin Abdullah Ar Raqasyi] dari [Al Asy'ari] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya menjelang datangnya hari kiamat, akan terjadi banyak sekali Al Haraj.\" Mereka (para sahabat) bertanya, \"Apa maksud istilah Al Haraj?\" Beliau menjawab: \"(Yaitu) pembunuhan.\" Mereka bertanya: \"Apakah lebih banyak dari yang kami lakukan, karena kami setiap tahun membunuh lebih dari tujuh puluh ribu orang?.\" Beliau bersabda: \"Bukan seperti yang kalian lakukan yaitu (memerangi) kaum musyrikin. Akan tetapi (pembunuhan yang terjadi) antara sebagian kalian dengan sebagian yang lain (peperangan sesama muslimin).\" Mereka bertanya lagi, \"Apakah pada hari itu, kami masih bersama dengan orang-orang yang berakal?\" Beliau menjawab: \"Sesungguhnya orang-orang yang berakal pada masa itu telah banyak yang meninggal, lalu digantikan dengan orang yang tidak memiliki kemampuan apa-apa dari manusia, kelompok yang banyak menyangka mereka mempunyai dasar yang kuat, padahal mereka tidak mempunyai pegangan apa-apa.\" Affan berkata dalam haditsnya; Abu musa berkata: \"Demi Dzat yang jiwaku berada ditangan-Nya, aku tidak mendapatkan jalan keluar untukku dan juga untuk kalian jika aku dan kalian menemuinya kecuali kita harus keluar darinya sebagaimana kita masuk didalamnya dan jangan sampai kita menumpahkan darah ataupun menjarah harta (orang lain).\""
            },
            {
                "number": 2498,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَاقَ عَنِ الْأَسْوَدِ قَالَ قَالَ أَبُو مُوسَىلَقَدْ ذَكَّرَنَا عَلِيُّ بْنُ أَبِي طَالِبٍ صَلَاةً كُنَّا نُصَلِّيهَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِمَّا نَسِينَاهَا وَإِمَّا تَرَكْنَاهَا عَمْدًا يُكَبِّرُ كُلَّمَا رَكَعَ وَكُلَّمَا رَفَعَ وَكُلَّمَا سَجَدَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Adam] Telah menceritakan kepada kami [Isra`il] dari [Abu Ishaq] dari [Al Aswad] ia berkata, [Abu Musa] berkata; \"Ali bin Abi Thalib telah mengingatkan kami tentang sholat yang pernah kami tunaikan bersama Rasulullah shallallahu 'alaihi wasallam. Bisa jadi karena kami lupa atau karena kami meninggalkannya dengan sengaja. Beliau selalu bertakbir setiap hendak ruku' dan setiap kali bangkit dari ruku' dan setiap kali beliau sujud.\""
            },
            {
                "number": 2499,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ قَالَ سَمِعْتُ رَجُلًا مِنْ قُرَيْشٍ يُقَالُ لَهُ أَبُو عَبْدِ اللَّهِ كَانَ يُجَالِسُ جَعْفَرَ بْنَ رَبِيعَةَ قَالَ سَمِعْتُ أَبَا بُرْدَةَ الْأَشْعَرِيَّ يُحَدِّثُ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَعْظَمَ الذُّنُوبِ عِنْدَ اللَّهِ عَزَّ وَجَلَّ أَنْ يَلْقَاهُ عَبْدٌ بِهَا بَعْدَ الْكَبَائِرِ الَّتِي نَهَى عَنْهَا أَنْ يَمُوتَ الرَّجُلُ وَعَلَيْهِ دَيْنٌ لَا يَدَعُ قَضَاءً",
                "id": "Telah menceritakan kepada kami [Abdullah bin Yazid] Telah menceritakan kepada kami [Sa'id bin Abu Ayyub] ia berkata; Saya mendengar seorang laki-laki Quraisy yang biasa dipanggil [Abu Abdullah] yang selalu bermajelis bersama Ja'far bin Rabi'ah, ia berkata, saya mendengar [Abu Burdah Al Asy'ari] menceritakan dari [bapaknya] dari Nabi shallallahu 'alaihi wasallam beliau bersabda: \"Sesungguhnya dosa yang paling besar disisi Allah 'azza wajalla yang didapatkan seorang hamba setelah Al Kabaa`ir (dosa-dosa besar) yang dilarang untuk melakukannya, adalah seorang meninggal, sementara ia masih memiliki hutang dan tidak meninggalkan sesuatu untuk membayarnya.\""
            },
            {
                "number": 2500,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ قَالَكَانَ عَبْدُ اللَّهِ وَأَبُو مُوسَى جَالِسَيْنِ وَهُمَا يَتَذَاكَرَانِ الْحَدِيثَ فَقَالَ أَبُو مُوسَى قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ يَدَيْ السَّاعَةِ أَيَّامٌ يُرْفَعُ فِيهَا الْعِلْمُ وَيَنْزِلُ فِيهَا الْجَهْلُ وَيَكْثُرُ فِيهَا الْهَرْجُ وَالْهَرْجُ الْقَتْلُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid] Telah menceritakan kepada kami [Al A'masy] dari [Syaqiq] ia berkata; Abdullah dan Abu Musa duduk-duduk saling mengingatkan hadits. [Abu Musa] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Menjelang kiamat tiba, terdapat hari-hari yang pada hari itu ilmu diangkat, dan kebodohan merajalela. Serta akan banyak terjadi Al Haraj, yaitu pembunuhan.\""
            },
            {
                "number": 2501,
                "arab": "حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ آدَمَ حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ عَنْ أَبِي إِسْحَاقَ عَنْ يَزِيدَ بْنِ أَبِي مَرْيَمَ عَنِ الْأَشْعَرِيِّ قَالَلَقَدْ ذَكَّرَنَا ابْنُ أَبِي طَالِبٍ وَنَحْنُ بِالْبَصْرَةِ صَلَاةً كُنَّا نُصَلِّيهَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَبِّرُ إِذَا سَجَدَ وَإِذَا قَامَ فَلَا أَدْرِي أَنَسِينَاهَا أَمْ تَرَكْنَاهَا عَمْدًاحَدَّثَنَا يُونُسُ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ يُونُسَ وَثَابِتٍ وَحُمَيْدٍ وَحَبِيبٍ عَنِ الْحَسَنِ عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ الرَّقَاشِيِّ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ بَيْنَ يَدَيْ السَّاعَةِ فَذَكَرَ نَحْوًا مِنْ حَدِيثِ عَبْدِ الصَّمَدِ عَنْ حَمَّادٍ عَنْ عَلِيِّ بْنِ زَيْدٍ إِلَّا أَنَّهُ قَالَ قَالَ أَبُو مُوسَى وَالَّذِي نَفْسِي بِيَدِهِ لَا أَجِدُ لِي وَلَكُمْ إِنْ أَدْرَكْتُهُنَّ إِلَّا أَنْ نَخْرُجَ مِنْهَا كَمَا دَخَلْنَاهَا لَمْ نُصِبْ فِيهَا دَمًا وَلَا مَالًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Adam] yakni Ibnu Adam, Telah menceritakan kepada kami [Ammar bin Ruzaiq] dari [Abu Ishaq] dari [Yazid bin Abu Maryam] dari [Al Asy'ari] ia berkata; \" [Ibnu Abu Thalib] mengingatkan kami di Bashrah tentang sholat yang pernah kami tunaikan bersama Rasulullah shallallahu 'alaihi wasallam. beliau selalu bertakbir ketika hendak sujud, dan berdiri. Saya tidak tahu, apakah waktu itu kami lupa, ataukah sengaja meninggalkannya.\" Telah menceritakan kepada kami [Yunus] Telah menceritakan kepada kami [Hammad] yakni Ibnu Salamah, dari [Yunus] dan [Tsabit] dan [Humaid] dan [Habib] dari [Al Hasan] dari [Hiththan bin Abdullah Ar Raqasyi] dari [Abu Musa Al Asy'ari] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya menjelang datangnya hari kiamat.\" Ia pun menyebutkan hadits semisal haditsnya Abdush Shamad dari Hammad dari Ali bin Zaid, hanya saja ia mengatakan; Abu Musa berkata, \"Demi Dzat yang jiwaku berada di tangan-Nya, saya tidak mendapatkan lagi sesuatu bagiku dan bagi kalian setelah mendapatkan hari-hari fitnah itu, kecuali kita harus keluar darinya sebagaimana kita telah memasukinya. Kita tidak menumpahkan darah dan tidak pula menjarah harta.\""
            },
            {
                "number": 2502,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا سُفْيَانُ عَنْ لَيْثٍ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَىعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا مَرَرْتُمْ بِالسِّهَامِ فِي أَسْوَاقِ الْمُسْلِمِينَ أَوْ فِي مَسَاجِدِهِمْ فَأَمْسِكُوا بِالْأَنْصَالِ لَا تَجْرَحُوا بِهَا أَحَدًا",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Sufyan] dari [Laits] dari [Abu Burdah] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika kalian lewat di pasar-pasar kaum muslimin atau di dalam masjid-masjid mereka dengan membawa tombak, maka jagalah mata tombaknya, jangan sampai kalian melukai seorang pun.\""
            },
            {
                "number": 2503,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا مَعْمَرٌ عَنْ مَطَرٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ الْأَسْلَمِيِّ قَالَشَكَّ عُبَيْدُ اللَّهِ بْنُ زِيَادٍ فِي الْحَوْضِ فَأَرْسَلَ إِلَى أَبِي بَرْزَةَ الْأَسْلَمِيِّ فَأَتَاهُ فَقَالَ لَهُ جُلَسَاءُ عُبَيْدِ اللَّهِ إِنَّمَا أَرْسَلَ إِلَيْكَ الْأَمِيرُ لِيَسْأَلَكَ عَنْ الْحَوْضِ هَلْ سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِ شَيْئًا قَالَ نَعَمْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَذْكُرُهُ فَمَنْ كَذَّبَ بِهِ فَلَا سَقَاهُ اللَّهُ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] telah memberitakan pada kami [Ma'mar] dari [Mathar] dari [Abdullah bin Buraidah Al Aslamy] berkata; ubaidhullah bin Ziyad masih ragu-ragu tentang Al Haudh (telaga di surga) maka dia pun mengutus seseorang ke Abu Barzah Al Aslamy yang menyampaikan pesan agar menemui Ubaidillah bin Ziyad. Lalu utusan tersebut mendatanginya, sesampainya di sana, para sahabat ubaidhullah bertanya kepada [Abu Barzah al-aslamy]; \"Sang amir (pemimpin) kita mengutus utusan kepadamu, dalam rangka menanyakan kepadamu tentang Al Haudh (telaga di surga), apakah engkau pernah mendengar dari Rasulullah shallallahu 'alaihi wasallam tentang hal itu?.\" Dia menjawab; \"Ya, aku telah mendengar Rasulullah shallallahu 'alaihi wasallam menyebutkannya bahwa barangsiapa yang mendustakannya(Al Haudh) maka Allah tidak akan memberi minum darinya.\""
            },
            {
                "number": 2504,
                "arab": "حَدَّثَنَا مُعْتَمِرٌ قَالَ أَنْبَأَنِي أَبِي عَنْ أَبِي الْمِنْهَالِ عَنْ أَبِي بَرْزَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقْرَأُ فِي الْغَدَاةِ بِالْمِائَةِ إِلَى السِّتِّينَ وَالسِّتِّينَ إِلَى الْمِائَةِ",
                "id": "Telah menceritakan kepada kami [Mu'tamar] ia berkata; telah mengkabarkan kepada kami [ayahku] dari [Abul Minhal] dari [Abu Barzah] bahwa sesungguhnya Rasulullah shallallahu 'alaihi wasallam membaca di sholat zhuhur seratus sampai enam puluh ayat dan enam puluh hingga seratus ayat."
            },
            {
                "number": 2505,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ عَنْ سُلَيْمَانَ عَنْ أَبِي عُثْمَانَ عَنْ أَبِي بَرْزَةَ قَالَكَانَتْ رَاحِلَةٌ أَوْ نَاقَةٌ أَوْ بَعِيرٌ عَلَيْهَا بَعْضُ مَتَاعِ الْقَوْمِ وَعَلَيْهَا جَارِيَةٌ فَأَخَذُوا بَيْنَ جَبَلَيْنِ فَتَضَايَقَ بِهِمْ الطَّرِيقُ فَأَبْصَرَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ حَلْ حَلْ اللَّهُمَّ الْعَنْهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَاحِبُ هَذِهِ الْجَارِيَةِ لَا تَصْحَبُنَا رَاحِلَةٌ أَوْ نَاقَةٌ أَوْ بَعِيرٌ عَلَيْهَا مِنْ لَعْنَةِ اللَّهِ تَبَارَكَ وَتَعَالَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu 'Adi] dari [Sulaiman] dari [Abu Utsman] dari [Abu Barzah] berkata bahwasanya ada seekor unta atau unta yang biasa digunakan buat perjalanan, di atasnya terdapat perbekalan empunya juga ada seorang budak wanita, ketika mereka sampai diantara dua gunung maka jalan terasa sulit dan sempit bagi mereka, lantas dia (budak wanita tersebut) melihat Rasulullah shallallahu 'alaihi wasallam, lalu dia berkata; \"Hus..hus...ya Allah laknatlah unta itu!.\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Siapakah yang mempunyai budak wanita ini?, janganlah mengikuti kami unta atau kendaraan yang telah dilaknat.\""
            },
            {
                "number": 2506,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَوَكِيعٌ قَالَا ثَنَا أَبَانُ بْنُ صَمْعَةَ عَنْ أَبِي الْوَازِعِ عَنْ أَبِي بَرْزَةَ قَالَقُلْتُ يَا رَسُولَ اللَّهِ عَلِّمْنِي شَيْئًا أَنْتَفِعُ بِهِ قَالَ اعْزِلْ الْأَذَى عَنْ طَرِيقِ الْمُسْلِمِينَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dan [Waki'], keduanya berkata; telah menceritakan kepada kami [Aban bin Sham'ah] dari [Abi Wazi'] dari [Abu Barzah] berkata; Aku bertanya; \"Wahai Rasulullah, ajarkanlah padaku sesuatu yang dapat bermanfaat bagiku!.\" Beliau menjawab: \"Singkirkanlah sesuatu yang membahayakan dari jalan orang Islam.\""
            },
            {
                "number": 2507,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ أَنْبَأَنَا حَجَّاجٌ عَنْ أَبِي هَاشِمٍ الْوَاسِطِيِّ عَنْ رُفَيْعٍ أَبِي الْعَالِيَةِ عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِآخِرَةٍ إِذَا طَالَ الْمَجْلِسُ فَقَامَ قَالَ سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ فَقَالَ لَهُ بَعْضُنَا إِنَّ هَذَا قَوْلٌ مَا كُنَّا نَسْمَعُهُ مِنْكَ فِيمَا خَلَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا كَفَّارَةُ مَا يَكُونُ فِي الْمَجْلِسِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Numair]; telah mengkabarkan kepada kami [Hajjaj] dari [Abu Hasyim al Wasithi] dari [Rufa'I Abul 'Aliyah] dari [Abu Barzah Al Aslamy] berkata; bahwasanya Nabi shallallahu 'alaihi wasallam diakhir majlis berdo'a \"Subhanaka Allahumma wabihamdika asyhadu alla ilaaha illa anta astaghfiruka waatubu ilaika\" (mahasuci Engkau ya Allah dan segala puji bagi-Mu, aku bersaksi bahwa tidak ada tuhan yang berhak untuk disembah kecuali Engkau, aku memohon ampun kepada-Mu dan bertaubat kepada-Mu).\" Sebagian kami berkata; \"Sungguh ini adalah perkataan yang belum pernah kami dengar dari anda setiap kali selesai majlis.\" Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ini adalah sebuah penghapus dosa terhadap dosa yang terjadi di dalam majlis.\""
            },
            {
                "number": 2508,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ الْأَزْرَقِ بْنِ قَيْسٍ قَالَكَانَ أَبُو بَرْزَةَ بِالْأَهْوَازِ عَلَى جَرْفِ نَهْرٍ وَقَدْ جَعَلَ اللِّجَامَ فِي يَدِهِ وَجَعَلَ يُصَلِّي فَجَعَلَتْ الدَّابَّةُ تَنْكُصُ وَجَعَلَ يَتَأَخَّرُ مَعَهَا فَجَعَلَ رَجُلٌ مِنْ الْخَوَارِجِ يَقُولُ اللَّهُمَّ اخْزِ هَذَا الشَّيْخَ كَيْفَ يُصَلِّي فَلَمَّا صَلَّى قَالَ قَدْ سَمِعْتُ مَقَالَتَكُمْ غَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سِتًّا أَوْ سَبْعًا أَوْ ثَمَانِيًا فَشَهِدْتُ أَمْرَهُ وَتَيْسِيرَهُ فَكَانَ رُجُوعِي مَعَ دَابَّتِي أَهْوَنَ عَلَيَّ مِنْ تَرْكِهَا فَتَنْزِعُ إِلَى مَأْلَفِهَا فَيَشُقُّ عَلَيَّ وَصَلَّى أَبُو بَرْزَةَ الْعَصْرَ رَكْعَتَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far]; telah menceritakan kepada kami [Syu'bah] dari [Al Azraq bin Qais] berkata; bahwasanya [Abu Barzah] ketika di daerah Ahwaz di tepian sungai, sedang tali kekang binatang tunggangannya berada di tangannya, sambil ia melaksanakan sholat. Lantas binatang kendaraannya tersebut berjalan mundur sehingga ia ikut mundur bersamanya. Lalu seorang dari Khawarij mendo'akannya; \"Ya Allah, hinakanlah orang tua ini, bagaimana dia melaksanakan sholatnya ini. Ketika ia selesai melaksanakan sholat, ia berkata; \"Aku telah mendengar perkataan kalian, aku telah berperang bersama Rasulullah shallallahu 'alaihi wasallam enam, tujuh atau delapan kali, dan aku menyaksikan urusannya dan Kemudahannya, mundurnya aku dan kendaraanku lebih mudah bagiku dari pada aku meninggalkan untaku sehingga perlu dijinakkan kembali dan itu sangat sangat menyulitkanku.\" (Waktu itu) Abu Barzah melaksanakan sholat 'ashar dua rakaat."
            },
            {
                "number": 2509,
                "arab": "حَدَّثَنَا يُونُسُ حَدَّثَنَا أَبُو الْأَشْهَبِ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ قَالَ أَبُو الْأَشْهَبِ لَا أَعْلَمُهُ إِلَّا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَإِنَّ مِمَّا أَخْشَى عَلَيْكُمْ شَهَوَاتِ الْغَيِّ فِي بُطُونِكُمْ وَفُرُوجِكُمْ وَمُضِلَّاتِ الْفِتَنِ",
                "id": "Telah menceritakan kepada kami [Yunus] telah menceritakan kepada kami [Abul Asyhab] dari [Ali bin Al Hakam] dari [Abu Barzah Al Aslamy]. Abul Asyhab berkata; \"Aku tidak mengetahuinya kecuali dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya yang paling aku takutkan dari kalian adalah syahwat menyimpang yang terdapat dalam perut, dan kemaluan kalian, dan juga fitnah-fitnah yang menyesatkan.\""
            },
            {
                "number": 2510,
                "arab": "حَدَّثَنَاه يَزِيدُ قَالَ أَخْبَرَنَا أَبُو الْأَشْهَبِ عَنْ أَبِي الْحَكَمِ الْبُنَانِيِّ عَنْ أَبِي بَرْزَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ مِمَّا أَخْشَى عَلَيْكُمْ شَهَوَاتِ الْغَيِّ فِي بُطُونِكُمْ وَفُرُوجِكُمْ وَمُضِلَّاتِ الْهَوَى",
                "id": "Telah menceritakan sebuah hadits pada kami [Yazid] telah mengkabarkan kepada kami [Abul Asyhab] dari [Abul Hakam Al Bunany] dari [Abu Barzah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sungguh yang sangat aku takutkan dari kalian adalah syahwat keji dari perut, dan kemaluan kalian, serta hawa nafsu yang menyesatkan.\""
            },
            {
                "number": 2511,
                "arab": "حَدَّثَنَا حَجَّاجٌ أَخْبَرَنَا شُعْبَةُ عَنْ أَبِي حَمْزَةَ جَارِهِمْ قَالَ سَمِعْتُ حُمَيْدَ بْنَ هِلَالٍ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ مُطَرِّفٍ عَنْ أَبِي بَرْزَةَ قَالَكَانَ أَبْغَضَ النَّاسِ أَوْ أَبْغَضَ الْأَحْيَاءِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَقِيفُ وَبَنُو حَنِيفَةَ",
                "id": "Telah menceritakan kepada kami [Hajjaj] telah mengkabarkan kepada kami [Syu'bah] dari [Abu Hamzah Jarihim] berkata; aku mendengar [Humaid bin Hilal] menceritakan dari [Abdullah bin Mutharrif] dari [Abu Barzah] berkata; \"Manusia atau kabilah yang paling dibenci Rasulullah shallallahu 'alaihi wasallam adalah bani Tsaqif dan bani Hanifah.\""
            },
            {
                "number": 2512,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ شَاذَانُ أَخْبَرَنَا أَبُو بَكْرٍ يَعْنِي ابْنَ عَيَّاشٍ عَنْ الْأَعْمَشِ عَنْ سَعِيدِ بْنِ عَبْدِ اللَّهِ بْنِ جُرَيْجٍ عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا مَعْشَرَ مَنْ آمَنَ بِلِسَانِهِ وَلَمْ يَدْخُلْ الْإِيمَانُ قَلْبَهُ لَا تَغْتَابُوا الْمُسْلِمِينَ وَلَا تَتَّبِعُوا عَوْرَاتِهِمْ فَإِنَّهُ مَنْ يَتَّبِعْ عَوْرَاتِهِمْ يَتَّبِعْ اللَّهُ عَوْرَتَهُ وَمَنْ يَتَّبِعْ اللَّهُ عَوْرَتَهُ يَفْضَحْهُ فِي بَيْتِهِ",
                "id": "Telah menceritakan kepada kami [Aswad bin Amir bin Syadzan]; telah mengkabarkan kepada kami [Abu Bakar] yaitu Ibnu 'Ayyasy dari [Al A'masy] dari [Sa'id bin Abdillah bin Juraij] dari [Abu Barzah Al Aslamy] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai orang yang imannya masih sebatas lisannya dan belum masuk ke hati, janganlah kalian menggunjing orang-orang muslim, janganlah kalian mencari-cari aurat ('aib) mereka. Karena barang siapa yang selalu mencari-cari kesalahan mereka, maka Allah akan membongkar kesalahannya, serta barang siapa yang diungkap auratnya oleh Allah, maka Dia akan memperlihatkannya (aibnya) di rumahnya.\""
            },
            {
                "number": 2513,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنِ ابْنِ أَخِي مُطَرِّفِ بْنِ الشِّخِّيرِ قَالَ سَمِعْتُ مُطَرِّفًا يُحَدِّثُ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِرَجُلٍ هَلْ صُمْتَ مِنْ سُرَرِ هَذَا الشَّهْرِ شَيْئًا يَعْنِي شَعْبَانَ فَقَالَ لَا قَالَ فَقَالَ لَهُ إِذَا أَفْطَرْتَ رَمَضَانَ فَصُمْ يَوْمًا أَوْ يَوْمَيْنِ شَكَّ الَّذِي شَكَّ فِيهِ قَالَ وَأَظُنُّهُ قَالَ يَوْمَيْنِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far]; telah menceritakan kepada kami [Syu'bah] dari [Ibnu Akhi Mutharrif bin Syikhir] dari [Mutharrif bin Syikhkhir] berkata; \"Aku mendengar sebuah hadits dari [Imran bin Hushain] radliallahu 'anhu bahwasanya Nabi shallallahu 'alaihi wasallam bersabda kepada seseorang: \"Apakah kamu berpuasa pada pertengahan bulan ini yaitu Sya'ban?.\" Dia menjawab; \"Tidak!.\" Beliau bersabda kepadanya lagi: \"Apabila kamu telah selesai puasa pada bulan ramadhan, maka berpuasalah sehari atau dua hari. -dia ragu kepastiannya--, sementara aku mengiranya dua hari.\""
            },
            {
                "number": 2514,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا سَعِيدٌ عَنْ غَيْلَانَ بْنِ جَرِيرٍ وَعَبْدُ الْوَهَّابِ عَنِ صَاحِبٍ لَهُ عَنْ غَيْلَانَ بْنِ جَرِيرٍ عَنْ مُطَرِّفِ بْنِ الشِّخِّيرِ أَنَّهُ قَالَكُنْتُ مَعَ عِمْرَانَ بْنِ حُصَيْنٍ بِالْكُوفَةِ فَصَلَّى بِنَا عَلِيُّ بْنُ أَبِي طَالِبٍ فَجَعَلَ يُكَبِّرُ كُلَّمَا سَجَدَ وَكُلَّمَا رَفَعَ رَأْسَهُ فَلَمَّا فَرَغَ قَالَ عِمْرَانُ صَلَّى بِنَا هَذَا مِثْلَ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Sa'id bin Ghailan bin Jabir] dan [Abdul Wahhab] dari [sahabatnya] dari [Ghailan bin Jarir] dari [Mutharrif bin Asy Syikhir] berkata; \"Aku bersama Imran bin Hushain radliallahu 'anhu di Kufah, lalu Ali bin Abu Thalib radliallahu 'anhu sholat mengimami kami, dia bertakbir setiap bersujud dan bangun dari sujud. Setelah selesai, [Imran bin Hushain] radliallahu 'anhu berkata; \"Dia sholat mengimami kami ini sebagaimana sholat Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 2515,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَابْنُ نُمَيْرٍ قَالَا ثَنَا سَعِيدٌ وَيَزِيدُ أَخْبَرَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ رَجُلًا عَضَّ رَجُلًا عَلَى ذِرَاعِهِ قَالَ ابْنُ نُمَيْرٍ فَنَزَعَ يَدَهُ مِنْهُ فَسَقَطَتْ ثَنِيَّتَاهُ فَجَذَبَهَا فَانْتَزَعَتْ ثَنِيَّتَهُ فَرُفِعَ ذَلِكَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَبْطَلَهَا وَقَالَ أَرَدْتَ أَنْ تَقْضَمَ لَحْمَ أَخِيكَ كَمَا يَقْضَمُ الْفَحْلُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] dan [Ibnu Numair] keduanya berkata; telah menceritakan kepada kami [Sa'id] dan [Yazid] telah mengkabarkan kepada kami [Sa'id] dari [Qatadah] dari [Zurarah bin `Aufa] dari ['Imron bin Hushain] bahwa ada seseorang yang telah menggigit lengan orang lain. Ibnu Numair berkata; Lantas ia menarik tangannya sehingga rontok dua gigi serinya. Namun di kemudian hari berkata dengan redaksi \"Menariknya hingga giginya (bukan dua gigi) tersebut terlepas. Kemudian hal itu dilaporkan kehadapan Rasulullah dan beliau pun membatalkannya (maksudnya tidak ada diyat) dan beliau bersabda: \"Kalian menginginkan merobek daging saudara kalian sebagaimana kuda merobeknya?.\""
            },
            {
                "number": 2516,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِأَنَّ هَيَّاجَ بْنَ عِمْرَانَ أَتَى عِمْرَانَ بْنَ حُصَيْنٍ فَقَالَ إِنَّ أَبِي قَدْ نَذَرَ لَئِنْ قَدَرَ عَلَى غُلَامِهِ لَيَقْطَعَنَّ مِنْهُ طَابِقًا أَوْ لَيَقْطَعَنَّ يَدَهُ فَقَالَ قُلْ لِأَبِيكَ يُكَفِّرْ عَنْ يَمِينِهِ وَلَا يَقْطَعْ مِنْهُ طَابِقًا فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَحُثُّ فِي خُطْبَتِهِ عَلَى الصَّدَقَةِ وَيَنْهَى عَنْ الْمُثْلَةِثُمَّ أَتَى سَمُرَةَ بْنَ جُنْدُبٍ فَقَالَ لَهُ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] bahwa Hayyaj bin 'Imran datang menemui ['Imran bin Hushain] dan bertanya; \"Sesungguhnya ayahku telah bernazar, apabila dia mendapatkan budaknya, maka dia akan memotong tangannya?.\" 'Imran berkata; \"Katakanlah kepada ayahmu, hendaknya dia membayar kafarat dari sumpahnya dan janganlah dia memotong tangan budaknya karena dalam khutbahnya, Rasulullah shallallahu 'alaihi wasallam selalu memotivasi untuk bersedekah dan melarang melakukan mutilasi.\" Setelah itu, dia mendatangi [Samurah bin Jundub], ternyata Samurah juga mengatakan hal yang sama.\""
            }
        ]
    }
}