{
    "status": true,
    "data": {
        "start": 3109,
        "end": 3256,
        "total": 148,
        "book": "ahmad",
        "hadits": [
            {
                "number": 3109,
                "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ الْهَاشِمِيُّ أَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ جَعْفَرٍ أَخْبَرَنِي يَزِيدُ بْنُ خُصَيْفَةَ أَنَّ بُسْرَ بْنَ سَعِيدٍ أَخْبَرَهُأَنَّهُ سَمِعَ فِي مَجْلِسِ اللَّيْثِيِّينَ يَذْكُرُونَ أَنَّ سُفْيَانَ أَخْبَرَهُمْ أَنَّ فَرَسَهُ أَعْيَتْ بِالْعَقِيقِ وَهُوَ فِي بَعْثٍ بَعَثَهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَجَعَ إِلَيْهِ يَسْتَحْمِلُهُ فَزَعَمَ سُفْيَانُ كَمَا ذَكَرُوا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مَعَهُ يَبْتَغِي لَهُ بَعِيرًا فَلَمْ يَجِدْ إِلَّا عِنْدَ أَبِي جَهْمِ بْنِ حُذَيْفَةَ الْعَدَوِيِّ فَسَامَهُ لَهُ فَقَالَ لَهُ أَبُو جَهْمٍ لَا أَبِيعُكَهُ يَا رَسُولَ اللَّهِ وَلَكِنْ خُذْهُ فَاحْمِلْ عَلَيْهِ مَنْ شِئْتَ فَزَعَمَ أَنَّهُ أَخَذَهُ مِنْهُ ثُمَّ خَرَجَ حَتَّى إِذَا بَلَغَ بِئْرَ الْإِهَابِ زَعَمَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُوشِكُ الْبُنْيَانُ أَنْ يَأْتِيَ هَذَا الْمَكَانَ وَيُوشِكُ الشَّامُ أَنْ يُفْتَتَحَ فَيَأْتِيَهُ رِجَالٌ مِنْ أَهْلِ هَذَا الْبَلَدِ فَيُعْجِبَهُمْ رِيفُهُ وَرَخَاؤُهُ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ ثُمَّ يُفْتَحُ الْعِرَاقُ فَيَأْتِي قَوْمٌ يَبُسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَ إِنَّ إِبْرَاهِيمَ دَعَا لِأَهْلِ مَكَّةَ وَإِنِّي أَسْأَلُ اللَّهَ تَبَارَكَ وَتَعَالَى أَنْ يُبَارِكَ لَنَا فِي صَاعِنَا وَأَنْ يُبَارِكَ لَنَا فِي مُدِّنَا مِثْلَ مَا بَارَكَ لِأَهْلِ مَكَّةَ",
                "id": "Telah menceritakan kepada kami [Sulaiman bin Dawud Al Hasyimi] telah memberitakan kepada kami [Isma'il bin Ja'far] telah mengabarkan kepadaku [Yazid bin Khushaifah] bahwa [Busr bin Sa'id] memberitakan padanya, ia mendengar [di majlis Al Laitsain], mereka menyebutkan bahwa [Sufyan] memberitakan kepada mereka bahwa kudanya lemah saat berada di 'Aqiq saat ia tengah diutus Rasulullah Shallallahu'alaihi wasallam, kemudian ia kembali kepada beliau seraya meminta agar dibawa serta. Kemudian Sufyan mengira seperti yang mereka sebutkan bahwa Nabi Shallallahu'alaihi wasallam keluar bersamanya untuk mencari unta milik beliau tapi tidak menemukannya kecuali ditempat Abu Jahm bin Hudzaifah Al 'Adawi. Kemudian Abu Jahm berkata kepadanya; Aku tidak menjualnya kepada tuan wahai Rasulullah Shallallahu'alaihi wasallam! Tapi silahkan tuan ambil dan silahkan perintahkan siapa saja yang tuan kehendaki untuk membawanya. Sufyan mengira Rasulullah Shallallahu'alaihi wasallam mengambila unta itu dari Abu Jahm. Kemudian ia pergi hingga tiba di sumur Ihab, ia mengira Rasulullah Shallallahu'alaihi wasallam bersabda: \"Hampir saja bangunan-bangunan mendatangi tempat ini dan hampir saja Syam akan ditaklukkan.\" Kemudian beberapa penduduk tempat itu mendatangi beliau, kesederhanaan dan keleluasaan Rasulullah Shallallahu'alaihi wasallam membuat mereka kagum dan Madinah lebih baik bagi mereka, andai saja mereka mengetahui. Selanjutnya Irak ditaklukkan lalu sekelompok kaum datang seraya membujuk manusia untuk meninggalkan MAdinah dengan membawa serta keluarga mereka, juga orang-orang yang menaati mereka, padahal Madinah lebih baik bagi mereka andai saja mereka mengetahui, karena Ibrahim telah mendo'akan kebaikan penduduk Makkah sedang aku memohon kepada Allah untuk memberkahi kami dalam sha' kami serta memberkahi mud kami (Sha' dan Mud Madinah) seperti berkah yang diberikan kepada penduduk Makkah."
            },
            {
                "number": 3110,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ سُفْيَانَ بْنِ أَبِي زُهَيْرٍ الْبَهْزِيِّ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُفْتَحُ الْيَمَنُ فَيَأْتِي قَوْمٌ يَبُسُّونَ فَيَتَحَمَّلُونَ بِأَهْلِيهِمْ وَمَنْ أَطَاعَهُمْ وَالْمَدِينَةُ خَيْرٌ لَهُمْ لَوْ كَانُوا يَعْلَمُونَحَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى أَخْبَرَنِي مَالِكٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ سُفْيَانَ بْنِ أَبِي زُهَيْرٍ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُفْتَحُ الْيَمَنُ فَيَأْتِي قَوْمٌ يَبُسُّونَ فَذَكَرَ الْحَدِيثَ حَدَّثَنَا يُونُسُ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ سُفْيَانَ بْنِ أَبِي زُهَيْرٍ قَالَ ابْنُ الزُّبَيْرِ أُخْبِرْتُ أَنَّهُ بِالْمَوْسِمِ فَأَتَيْتُهُ فَسَأَلْتُهُ فَأَخْبَرَنِي فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ تَفْتَحُونَ الشَّامَ فَيَجِيءُ أَقْوَامٌ يَبُسُّونَ قَالَ كُلُّهَا فَتَحُوا وَقَالَ يَبُسُّونَ",
                "id": "Telah menceritakan kepada kami ['Abdur Rozzaq] telah memberitakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Hisyam bin 'Urwah] dari [ayahnya] dari ['Abdullah bin Az Zubair] dari [Sufyan bin Abu Zuhair Al Bahzi], ia berkata; aku mendengar Rasulullah Shallallahu'alaihi wasallam bersabda; \"Yaman ditaklukkan kemudian datanglah suatu kaum yang mereka membujuk manusia untuk meninggalkan Madinah dan membawa serta keluarga mereka, juga siapapun yang menaati mereka padahal Madinah lebih baik bagi mereka, andai mereka tahu.\" Telah menceritakan kepada kami [Ishaq bin 'Isa] telah mengabarkan kepadaku [Malik] dari [Hisyam bin 'Urwah] dari [ayahnya] dari ['Abdullah bin Az Zubair] dari [Sufyan bin Abu Zuhair], ia berkata; aku mendengar Rasulullah Shallallahu'alaihi wasallam bersabda: \"Yaman ditaklukkan kemudian datanglah suatu kaum yang membujuk manusia untuk meninggalkan Madinah dengan membawa serta keluarga mereka.\" Lantas Ia menyebutkan hadits. Telah menceritakan kepada kami [Yunus] telah menceritakan kepada kami [Hammad bin Zaid] dari [Hisyam bin 'Urwah] dari [ayahnya] dari ['Abdullah bin Az Zubair] dari [Sufyan bin Abu Zuhair]. Berkata Ibnu Az Zubair; saya dikhabari bahwa Sufyan tengah menunaikan haji kemudian saya mendatanginya dan bertanya kepadanya, ia mengabarkan kepada saya lalu berkata; saya mendengar Rasulullah Shallallahu'alaihi wasallam bersabda: \"Kalian akan menaklukkan Syam kemudian beberapa kaum membujuk keluarganya untuk meninggalkan Madinah.\" Sofyan berkata; semua hadis dengan redaksi: \"Mereka menaklukkan.\" Dan ia berkata: \"Mereka membujuk.\""
            },
            {
                "number": 3111,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ يَزِيدَ بْنِ خُصَيْفَةَ عَنِ السَّائِبِ بْنِ يَزِيدَ أَنَّهُ أَخْبَرَهُ أَنَّهُ سَمِعَ سُفْيَانَ بْنَ أَبِي زُهَيْرٍ وَهُوَ رَجُلٌ مِنْ شَنُوءَةَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحَدِّثُ نَاسًا مَعَهُ عِنْدَ بَابِ الْمَسْجِدِ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ اقْتَنَى كَلْبًا لَا يُغْنِي عَنْهُ زَرْعًا وَلَا ضَرْعًا نَقَصَ مِنْ عَمَلِهِ كُلَّ يَوْمٍ قِيرَاطٌ قَالَ أَنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِي وَرَبِّ هَذَا الْمَسْجِدِ",
                "id": "Telah menceritakan kepada kami [Rouh] telah menceritakan kepada kami [Malik bin Anas] dari [Yazid bin Khushaifah] dari [As Sa`ib bin Yazid] bahwa ia memberitahukan padanya, ia mendengar [Sufyan bin Abu Zuhair] -ia adalah sahabat Nabi Shallallahu'alaihi wasallam dari Syanu`ah- bercerita kepada orang-orang yang ada bersamanya didekat pintu masjid, ia berkata; saya mendengar Rasulullah Shallallahu'alaihi wasallam bersabda: \"Barangsiapa memelihara anjing yang bukan untuk keperluan tanaman atau susu binatang, maka amalnya berkurang satu qirath setiap hari.\" Ia ditanya; Kau mendengar hadits ini dari Rasulullah Shallallahu'alaihi wasallam? Sufyan menjawab; Ya, demi Rabb masjid ini."
            },
            {
                "number": 3112,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا سَعِيدُ بْنُ جُمْهَانَ ح وَعَبْدُ الصَّمَدِ حَدَّثَنِي سَعِيدُ بْنُ جُمْهَانَ عَنْ سَفِينَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْخِلَافَةُ ثَلَاثُونَ عَامًا ثُمَّ يَكُونُ بَعْدَ ذَلِكَ الْمُلْكُقَالَ سَفِينَةُ أَمْسِكْ خِلَافَةَ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ سَنَتَيْنِ وَخِلَافَةَ عُمَرَ رَضِيَ اللَّهُ عَنْهُ عَشْرَ سِنِينَ وَخِلَافَةَ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ اثْنَيْ عَشْرَ سَنَةً وَخِلَافَةَ عَلِيٍّ سِتَّ سِنِينَ رَضِيَ اللَّهُ عَنْهُمْ",
                "id": "Telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Hammad bin Salamah] telah menceritakan kepada kami [Sa'id bin Jumhan]. Dan ['Abdush Shamad] berkata, telah menceritakan kepadaku [Sa'id bin Jumhan] dari [Safinah], ia berkata; aku mendengar Rasulullah Shallallahu'alaihi wasallam bersabda: \"(Masa) khilafah selama tigapuluh tahun, kemudian setelah itu kerajaan.\" Berkata Safinah; peganglah khilafah Abu Bakar Radliyallahu'anhu selama dua tahun, khilafah 'Umar Radliyallahu'anhu sepuluh tahun, khilafah 'Utsman Radliyallahu'anhu duabelas tahun dan khilafah 'Ali Radliyallahu'anhu enam tahun."
            },
            {
                "number": 3113,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ عَلِيٍّ يَعْنِي ابْنَ مُبَارَكٍ عَنْ يَحْيَى عَنْ سَفِينَةَأَنَّ رَجُلًا سَاطَ نَاقَتَهُ بِجِذْلٍ فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهُمْ بِأَكْلِهَا",
                "id": "Telah menceritakan kepada kami [Waki'] dari ['Ali bin Mubarak] dari [Yahya] dari [Safinah] bahwa pernah ada seorang laki-laki mencambuk untanya dengan pangkal pohon, unta itu membawa bawaan yang banyak, kemudian Rasulullah Shallallahu'alaihi wasallam menanyakannya kemudian memerintahkan mereka untuk memakan pangkal pohon tersebut."
            },
            {
                "number": 3114,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ سَعِيدِ بْنِ جُمْهَانَ قَالَ سَمِعْتُ سَفِينَةَيُحَدِّثُ أَنَّ رَجُلًا ضَافَ عَلِيَّ بْنَ أَبِي طَالِبٍ فَصَنَعُوا لَهُ طَعَامًا فَقَالَتْ فَاطِمَةُ رَضِيَ اللَّهُ عَنْهَا لَوْ دَعْونَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكَلَ مَعَنَا فَأَرْسَلُوا إِلَيْهِ فَجَاءَ فَأَخَذَ بِعِضَادَتَيْ الْبَابِ فَإِذَا قِرَامٌ قَدْ ضُرِبَ بِهِ فِي نَاحِيَةِ الْبَيْتِ فَلَمَّا رَآهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجَعَ فَقَالَتْ فَاطِمَةُ لِعَلِيٍّ اتْبَعْهُ فَقُلْ لَهُ مَا رَجَعَكَ قَالَ فَتَبِعَهُ فَقَالَ مَا رَجَعَكَ يَا رَسُولَ اللَّهِ قَالَ إِنَّهُ لَيْسَ لِي أَوْ لَيْسَ لِنَبِيٍّ أَنْ يَدْخُلَ بَيْتًا مُزَوَّقًاحَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنِي حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ سَعِيدِ بْنِ جُمْهَانَ حَدَّثَنِي سَفِينَةُ أَبُو عَبْدِ الرَّحْمَنِ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْخِلَافَةُ ثَلَاثُونَ عَامًا ثُمَّ الْمُلْكُ فَذَكَرَهُ",
                "id": "Telah menceritakan kepada kami [Abu Kamil] telah menceritakan kepada kami [Hammad bin Salamah] dari [Sa'id bin Jumhan] ia berkata; aku mendengar [Safinah] bercerita, bahwa seseorang menjamu 'Ali bin Abi Thalib, mereka membuatkan makanan untuknya kemudian Fathimah Radliyallahu'anha berkata; Andai saja kita mengajak Rasulullah Shallallahu'alaihi wasallam kemudian beliau makan bersama kami. Kemudian mereka mendatangi Rasulullah Shallallahu'alaihi wasallam dan beliau pun datang. Rasulullah Shallallahu'alaihi wasallam kemudian menarik dua sisi pintu, ternyata di salah satu sisi rumah ada kain tipis berbordir beraneka warna. Begitu melihatnya, Rasulullah Shallallahu'alaihi wasallam langsung balik. Kemudian Fathimah berkata kepada 'Ali; Ikutilah beliau dan tanyakan kenapa beliau balik. 'Ali pun mengikuti beliau dan bertanya; Apa yang membuat Tuan balik wahai Rasulullah Shallallahu'alaihi wasallam? Rasulullah Shallallahu'alaihi wasallam bersabda: \"Sesungguhnya saya atau nabi tidak boleh masuk rumah yang disana ada gambar bordir beraneka warni.\" Telah menceritakan kepadaku [Zaid bin Al Hubab], telah menceritakan kepada kami [Hammad bin Salamah] dari [Sa'id bin Jumhan], telah menceritakan kepada kami [Safinah Abu 'Abdur Rahman], ia berkata; saya mendengar Nabi Shallallahu'alaihi wasallam bersabda; \"(Masa) khilafah tiga puluh tahun kemudian (setelah itu) kerajaan.\" Maka Safinah menyebutkan hadits."
            },
            {
                "number": 3115,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا شَرِيكٌ عَنْ عِمْرَانَ النَّخْلِيِّ عَنْ مَوْلًى لِأُمِّ سَلَمَةَ قَالَكُنْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَانْتَهَيْنَا إِلَى وَادٍ قَالَ فَجَعَلْتُ أَعْبُرُ النَّاسَ أَوْ أَحْمِلُهُمْ قَالَ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا كُنْتَ الْيَوْمَ إِلَّا سَفِينَةً أَوْ مَا أَنْتَ إِلَّا سَفِينَةٌقِيلَ لِشَرِيكٍ هُوَ سَفِينَةُ مَوْلَى أُمِّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَا",
                "id": "Telah menceritakan kepada kami [Aswad bin 'Amir] telah menceritakan kepada kami [Syarik] dari ['Imron An Nakhli] dari [budak milik Ummu Salamah] ia berkata; saya pernah bersama Nabi Shallallahu'alaihi wasallam dalam suatu perjalanan hingga kami tiba disebuah lembah. Saya kemudian saya melintasi orang-orang atau membawa mereka kemudian Rasulullah Shallallahu'alaihi wasallam bersabda kepadaku; \"Engkau hari ini tidak lain adalah Safinah, \" atau \"Engkau tidak lain adalah Safinah.\" Dikatakan kepada Syarik; Dia adalah Safinah, budak milik Ummu Salamah Radliyallahu'anha."
            },
            {
                "number": 3116,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا سَعِيدُ بْنُ جُمْهَانَ حَدَّثَنَا سَفِينَةُ أَبُو عَبْدِ الرَّحْمَنِأَنَّ رَجُلًا أَضَافَهُ عَلِيُّ بْنُ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ فَصَنَعَ لَهُ طَعَامًا فَقَالَتْ فَاطِمَةُ لَوْ دَعَوْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ نَحْوَ حَدِيثِ أَبِي كَامِلٍ فَدَعَوْهُ فَجَاءَ فَوَضَعَ يَدَهُ عَلَى عِضَادَتَيْ الْبَابِ فَرَأَى قِرَامًا فِي نَاحِيَةِ الْبَيْتِ فَرَجَعَ فَقَالَتْ فَاطِمَةُ لِعَلِيٍّ الْحَقْهُ فَقُلْ لَهُ لِمَ رَجَعْتَ يَا رَسُولَ اللَّهِ فَقَالَ إِنَّهُ لَيْسَ لِي أَنْ أَدْخُلَ بَيْتًا مُزَوَّقًا",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] telah menceritakan kepada kami [Sa'id bin Jumhan] telah menceritakan kepada kami [Safinah Abu 'Abdur Rahman]; Bahwa 'Ali bin Abi Thalib menjamu seseorang kemudian ia membuatkan makanan untuknya kemudian Fathimah berkata; Andai kita mengajak Rasulullah Shallallahu'alaihi wasallam, kemudian ia menyebutkan yang sama seperti hadits Abu Kamil; kemudian mereka mengajak beliau lalu beliau datang. Beliau meletakkan tangan beliau diatas dua sisi pintu kemudian melihat kain tipis disalah satu sisi rumah kemudian beliau kembali. Fathimah berkata kepada 'Ali; Susullah beliau dan tanyakan kenapa engkau kembali wahai Rasulullah Shallallahu'alaihi wasallam? Kemudian Rasulullah Shallallahu'alaihi wasallam bersabda: \"Saya tidak boleh masuk rumah yang disana terdapat pahatan beraneka-warni.\""
            },
            {
                "number": 3117,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا سَعِيدُ بْنُ جُمْهَانَ عَنْ سَفِينَةَ أَبِي عَبْدِ الرَّحْمَنِ قَالَأَعْتَقَتْنِي أُمُّ سَلَمَةَ وَاشْتَرَطَتْ عَلَيَّ أَنْ أَخْدُمَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا عَاشَ",
                "id": "Telah menceritakan kepada kami [Abu Kamil] telah menceritakan kepada kami [Hammad bin Salamah] telah menceritakan kepada kami [Sa'id bin Jumhan] dari [Safinah Abu 'Abdur Rahman] ia berkata; Ummu Salamah memerdekakanku dan mensyaratkan kepadaku agar melayani Nabi Shallallahu'alaihi wasallam selama hidup beliau."
            },
            {
                "number": 3118,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا حَشْرَجُ ابْنُ نُبَاتَةَ الْعَبْسِيُّ كُوفِيٌّ حَدَّثَنَا سَعِيدُ بْنُ جُمْهَانَ حَدَّثَنِي سَفِينَةُ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْخِلَافَةُ فِي أُمَّتِي ثَلَاثُونَ سَنَةً ثُمَّ مُلْكًا بَعْدَ ذَلِكَ ثُمَّ قَالَ لِي سَفِينَةُ أَمْسِكْ خِلَافَةَ أَبِي بَكْرٍ وَخِلَافَةَ عُمَرَ وَخِلَافَةَ عُثْمَانَ وَأَمْسِكْ خِلَافَةَ عَلِيٍّ رَضِيَ اللَّهُ تَعَالَى عَنْهُمْ قَالَ فَوَجَدْنَاهَا ثَلَاثِينَ سَنَةً ثُمَّ نَظَرْتُ بَعْدَ ذَلِكَ فِي الْخُلَفَاءِ فَلَمْ أَجِدْهُ يَتَّفِقُ لَهُمْ ثَلَاثُونَ فَقُلْتُ لِسَعِيدٍ أَيْنَ لَقِيتَ سَفِينَةَ قَالَ لَقِيتُهُ بِبَطْنِ نَخْلٍ فِي زَمَنِ الْحَجَّاجِ فَأَقَمْتُ عِنْدَهُ ثَمَانِ لَيَالٍ أَسْأَلُهُ عَنْ أَحَادِيثِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُلْتُ لَهُ مَا اسْمُكَ قَالَ مَا أَنَا بِمُخْبِرِكَ سَمَّانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَفِينَةَ قُلْتُ وَلِمَ سَمَّاكَ سَفِينَةَ قَالَ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ أَصْحَابُهُ فَثَقُلَ عَلَيْهِمْ مَتَاعُهُمْ فَقَالَ لِي ابْسُطْ كِسَاءَكَ فَبَسَطْتُهُ فَجَعَلُوا فِيهِ مَتَاعَهُمْ ثُمَّ حَمَلُوهُ عَلَيَّ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْمِلْ فَإِنَّمَا أَنْتَ سَفِينَةُ فَلَوْ حَمَلْتُ يَوْمَئِذٍ وِقْرَ بَعِيرٍ أَوْ بَعِيرَيْنِ أَوْ ثَلَاثَةٍ أَوْ أَرْبَعَةٍ أَوْ خَمْسَةٍ أَوْ سِتَّةٍ أَوْ سَبْعَةٍ مَا ثَقُلَ عَلَيَّ إِلَّا أَنْ يَجْفُوا",
                "id": "Telah menceritakan kepada kami [Abu An Nadhr] telah menceritakan kepada kami [Hasyraj bin Nubatah Al 'Absi Kufi] telah menceritakan kepada kami [Sa'id bin Jumhan] telah menceritakan kepadaku [Safinah], ia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Masa khilafah dalam ummatku tiga puluh tahun kemudian setelah itu kerajaan.\" Kemudian Safinah berkata kepadaku; Peganglah khilafah Abu Bakar, 'Umar, 'Utsman dan Ali Radliyallahu'anhum. Kemudian kami menghitungnya tepat tigapuluh tahun dan setelah itu saya memperhatikan pada khalifah tapi saya tidak menemukannya sesuai selama tiga puluh tahun lalu saya bertanya kepada Sa'id; Dimana kau temui Safinah? Ia menjawab; Saya bertemu dengannya di Bathn Nakhl dimasa Al Hajjaj, kemudian saya tinggal disana selama delapan hari untuk menanyakan hadits-hadits Rasulullah Shallallahu'alaihi wasallam padanya. Saya bertanya padanya; Siapa namamu? Ia menjawab; Bukankah telah kuberitahukan kepadamu? Rasulullah Shallallahu'alaihi wasallam memberiku nama Safinah. Saya bertanya; 'Kenapa beliau memberimu nama Safinah? ' Ia menjawab; Rasulullah Shallallahu'alaihi wasallam bepergian bersama sahabat-sahabat beliau, barang bawaan mereka memberatkan mereka kemudian Rasulullah Shallallahu'alaihi wasallam bersabda kepadaku; \"Bentangkan selendangmu.\" Saya pun membentangkan selendangku, kemudian mereka meletakkan barang-barang mereka diselendangku. Mereka menyuruhku membawanya kemudian Rasulullah Shallallahu'alaihi wasallam bersabda: \"Bawalah, engkau adalah Safinah.\" Andai saat ini aku membawa bawaan satu unta, dua unta, tiga unta, tiga unta, empat unta, lima unta, enam unta atau tujuh unta pastilah tidak memberatkanku kecuali bila mereka membanting ke tanah."
            },
            {
                "number": 3119,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ حَدَّثَنِي أَبُو رَيْحَانَةَ قَالَ أَبِي وَسَمَّاهُ عَلِيٌّ عَبْدَ اللَّهِ بْنَ مَطَرٍ قَالَ أَخْبَرَنِي سَفِينَةُ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُوَضِّئُهُ الْمُدُّ وَيَغْسِلُهُ الصَّاعُ مِنْ الْجَنَابَةِ",
                "id": "Telah menceritakan kepada kami ['Ali bin 'Ashim] telah menceritakan kepadaku [Abu Raihanah]. -Berkata ayah saya; Dan Ali menamainya Abdullah bin Mathar- ia berkata; [Safinah] -pelayan Rasulullah Shallallahu'alaihi wasallam- telah mengabarkan kepadaku bahwa Rasulullah Shallallahu'alaihi wasallam memberinya air untuk wudhu sebanyak satu mud dan memandikannya dengan satu sha' air karena junub."
            },
            {
                "number": 3120,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبُو رَيْحَانَةَ عَنْ سَفِينَةَ صَاحِبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَغْتَسِلُ بِالصَّاعِ وَيَتَطَهَّرُ بِالْمُدِّ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Ibrahim] telah menceritakan kepada kami [Abu Raihanah] dari [Safinah] sahabat Rasulullah Shallallahu'alaihi wasallam, ia berkata; Rasulullah Shallallahu'alaihi wasallam mandi dengan satu sha' air dan bersuci dengan satu mud air."
            },
            {
                "number": 3121,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا حَمَّادٌ أَنَا سَعِيدُ بْنُ جُمْهَانَ حَدَّثَنِي سَفِينَةُأَنَّ رَجُلًا ضَافَ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ فَصَنَعَ لَهُ طَعَامًا فَقَالَتْ فَاطِمَةُ لِعَلِيٍّ لَوْ دَعَوْتَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَكَلَ مَعَنَا فَدَعَوْنَاهُ فَجَاءَ فَأَخَذَ بِعِضَادَتَيْ الْبَابِ وَقَدْ ضَرَبْنَا قِرَامًا فِي نَاحِيَةِ الْبَيْتِ فَلَمَّا رَآهُ رَجَعَ قَالَتْ فَاطِمَةُ لِعَلِيٍّ الْحَقْهُ فَانْظُرْ مَا رَجَعَهُ قَالَ مَا رَدَّكَ يَا نَبِيَّ اللَّهِ قَالَ لَيْسَ لِنَبِيٍّ أَنْ يَدْخُلَ بَيْتًا مُزَوَّقًاحَدَّثَنَا أَبُو كَامِلٍ بِمَعْنَاهُ قَالَ إِنَّهُ لَيْسَ لِي أَوْ قَالَ لَيْسَ لِنَبِيٍّ أَنْ يَدْخُلَ بَيْتًا مُزَوَّقًا",
                "id": "Telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Hammad] telah memberitakan kepada kami [Sa'id bin Jumhan] telah menceritakan kepadaku [Safinah] bahwa seseorang menjamu 'Ali Radliyallahu'anhu kemudian ia membuatkan makanan untuknya, lalu Fathimah berkata kepada 'Ali; Andai engkau memanggail Rasulullah Shallallahu'alaihi wasallam untuk makan bersama kita. Kemudian kami memanggil beliau, beliau datang kemudian meraih dua sisi pintu, kami memasang kain tipis disudut rumah. Saat Rasulullah Shallallahu'alaihi wasallam melihatnya, beliau langsung membalikkan tubuhnya. Fathimah berkata kepada 'Ali; Susullah beliau dan tanyakan apa yang membuat beliau berbalik. Bertanya 'Ali; Apa yang membuat tuan kembali wahai nabi Allah? Beliau menjawab; \"Seorang nabi tidak boleh masuk rumah yang disana terdapat gambar beraneka warni.\" Telah menceritakan kepada kami [Abu Kamil] dengan maknanya, Rasulullah Shallallahu'alaihi wasallam bersabda: \"Sesungguhnya tidak boleh bagi seorang nabi untuk memasuki rumah yang disana terdapat gambar beraneka warni.\""
            },
            {
                "number": 3122,
                "arab": "حَدَّثَنَا حَجَّاجٌ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَاقَ عَنْ فَرْوَةَ بْنِ نَوْفَلٍ عَنْ جَبَلَةَ بْنِ حَارِثَةَ قَالَقُلْتُ يَا رَسُولَ اللَّهِ عَلِّمْنِي شَيْئًا أَقُولُهُ عِنْدَ مَنَامِي قَالَ إِذَا أَخَذْتَ مَضْجَعَكَ فَقُلْ يَا أَيُّهَا الْكَافِرُونَ حَتَّى تَخْتِمَهَا فَإِنَّهَا بَرَاءَةٌ مِنْ الشِّرْكِحَدَّثَنَا أَسْوَدُ قَالَ حَدَّثَنَا شَرِيكٌ قَالَ جَبَلَةُ وَلَمْ يَشُكَّ وَقَالَ عَلِيٌّ يَعْنِي ابْنَ الْمَدِينِيِّ جَبَلَةُ بْنُ حَارِثَةَ الْكلْبِيُّ قَالَ عَلِيٌّ سَمِعْتُهُ مِنْ ابْنِ أَبِي الْوَزِيرِ قَالَ عَبْد اللَّهِ و حَدَّثَنَاه أَبِي عَنْ عَلِيٍّ قَبْلَ أَنْ يُمْتَحَنَ بِالْقُرْآنِ",
                "id": "Telah menceritakan kepada kami [Hajjaj] ia berkata; telah menceritakan kepada kami [Syarik] dari [Abu Ishak] dari [Farwah bin Naufal] dari [Jabalah bin Haritsah] ia berkata; aku berkata; Wahai Rasulullah! Ajarkanlah sesuatu padaku yang aku ucapkan saat hendak tidur. Rasulullah Shallallahu'alaihi wasallam bersabda: \"Bila kau hendak tidur, bacalah qul yaa `ayyuhal kaafirun hingga usai, karena itu membebaskan dari kesyirikan'.\" Telah menceritakan kepada kami [Aswad], ia berkata; telah menceritakan kepada kami [Syarik], -ia menyebutkan Jabalah dan ia tidak ragu. Sedang 'Ali bin Al Madini berkata Jabalah bin Haritsah Al Kalbi-. Berkata ['Ali]; saya mendengarnya dari [Ibnu Abi Al Wazir], berkata 'Abdullah dan kami bercerita kepadanya dari 'Ali sebelum diuji dengan Al Qur`an."
            },
            {
                "number": 3123,
                "arab": "حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ إِسْحَاقَ عَنْ يَعْقُوبَ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلٍ عَنْ سَعِيدِ بْنِ سَعْدِ بْنِ عُبَادَةَ قَالَكَانَ بَيْنَ أَبْيَاتِنَا إِنْسَانٌ مُخْدَجٌ ضَعِيفٌ لَمْ يُرَعْ أَهْلُ الدَّارِ إِلَّا وَهُوَ عَلَى أَمَةٍ مِنْ إِمَاءِ الدَّارِ يَخْبُثُ بِهَا وَكَانَ مُسْلِمًا فَرَفَعَ شَأْنَهُ سَعْدٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اضْرِبُوهُ حَدَّهُ قَالُوا يَا رَسُولَ اللَّهِ إِنَّهُ أَضْعَفُ مِنْ ذَلِكَ إِنْ ضَرَبْنَاهُ مِائَةً قَتَلْنَاهُ قَالَ فَخُذُوا لَهُ عِثْكَالًا فِيهِ مِائَةُ شِمْرَاخٍ فَاضْرِبُوهُ بِهِ ضَرْبَةً وَاحِدَةً وَخَلُّوا سَبِيلَهُ",
                "id": "Telah menceritakan kepada kami [Ya'la bin 'Ubaid] telah menceritakan kepada kami [Muhammad bin Ishak] dari [Ya'qub bin 'Abdullah bin Al Asyuj] dari [Abu Umamah bin Sahl] dari [Sa'id bin Sa'ad bin 'Ubadah], ia berkata; Kami memiliki seorang tetangga yang pendek dan lemah, penghuni rumah tidak memperhatikannya hingga ia bercumbu rayu dengan budak wanita dirumah itu dan melakukan kekejian terhadapnya, padahal ia adalah muslim. Kemudian Sa'ad melaporkannya kepada Rasulullah Shallallahu'alaihi wasallam kemudian beliau bersabda; \"Cambuklah dia sebagai hukumannya.\" Mereka berkata; Wahai Rasulullah! Ia lebih lemah dari hal itu, bila kami mencambuknya seratus kali pasti dia mati. Rasulullah Shallallahu'alaihi wasallam bersabda: \"Ambillah rumbai sebanyak seratus tangkai lalu cambukkan padanya sekali saja kemudian lepaskan dia.\""
            },
            {
                "number": 3124,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ عَنْ سَعِيدٍ قَالَمَرَّ عُمَرُ رَضِيَ اللَّهُ عَنْهُ بِحَسَّانَ وَهُوَ يُنْشِدُ فِي الْمَسْجِدِ فَلَحَظَ إِلَيْهِ قَالَ كُنْتُ أُنْشِدُ وَفِيهِ مَنْ هُوَ خَيْرٌ مِنْكَ ثُمَّ الْتَفَتَ إِلَى أَبِي هُرَيْرَةَ فَقَالَ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَجِبْ عَنِّي اللَّهُمَّ أَيِّدْهُ بِرُوحِ الْقُدُسِ قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari [Sa'id] ia berkata; Umar Radliyallahu'anhu melintasi Hassan yang tengah bersyair di masjid, Umar meliriknya, lalu [Hassan] berkata; Disini orang yang lebih baik darimu pernah bersyair. Kemudian Umar melirik [Abu Hurairah] dan bertanya; \"Kau pernah mendengar Rasulullah Shallallahu'alaihi wasallam bersabda: \"Kabulkanlah aku ya Allah! Teguhkanlah ia dengan Jibril. Ia menjawab; Ya."
            },
            {
                "number": 3125,
                "arab": "حَدَّثَنَا يَعْلَى حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ يَحْيَى بْنِ عَبْدِ الرَّحْمَنِ قَالَمَرَّ عُمَرُ رَضِيَ اللَّهُ عَنْهُ عَلَى حَسَّانَ وَهُوَ يُنْشِدُ الشِّعْرَ فِي الْمَسْجِدِ فَقَالَ فِي مَسْجِدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُنْشِدُ الشِّعْرَ قَالَ كُنْتُ أُنْشِدُ وَفِيهِ مَنْ هُوَ خَيْرٌ مِنْكَ أَوْ كُنْتُ أُنْشِدُ فِيهِ وَفِيهِ مَنْ هُوَ خَيْرٌ مِنْكَ",
                "id": "Telah menceritakan kepada kami [Ya'la] telah menceritakan kepada kami [Muhammad bin 'Amr] dari [Yahya bin 'Abdur Rahman], ia berkata; 'Umar Radliyallahu'anhu melawati Hassan saat tengah bersyair di masjid kemudian 'Umar berkata; Di masjid Rasulullah Shallallahu'alaihi wasallam syair disenandungkan? [Hassan] berkata; 'Saya pernah bersyair dan di dalam masjid ada orang yang lebih baik darimu (yaitu Nabi Shallallahu 'alaihi wa Salam).'"
            },
            {
                "number": 3126,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا إِبْرَاهِيمُ يَعْنِي ابْنَ سَعْدٍ حَدَّثَنَا ابْنُ شِهَابٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ قَالَمَرَّ عُمَرُ عَلَى حَسَّانَ وَهُوَ يُنْشِدُ فِي الْمَسْجِدِ فَقَالَ مَهْ قَالَ لَهُ حَسَّانُ قَدْ كُنْتُ أُنْشِدُ وَفِيهِ مَنْ هُوَ خَيْرٌ مِنْكَ قَالَ فَانْصَرَفَ عُمَرُ وَهُوَ يَعْرِفُ أَنَّهُ يُرِيدُ رَسُولَ اللَّهِ",
                "id": "Telah menceritakan kepada kami [Abu Kamil] telah menceritakan kepada kami [Ibrahim bin Sa'ad] telah menceritakan kepada kami [Ibnu Syihab] dari [Sa'id bin Al Musayyib], ia berkata; 'Umar melintasi Hassan saat ia tengah bersyair di masjid kemudian 'Umar berkata; 'Heih'. Kemudian [Hassan] berkata padanya; 'Saya pernah bersyair dan dimasjid ada orang yang lebih baik darimu'. Sa'id melanjutkan; 'Umar pun pergi dan ia tahu bahwa yang dimaksudkan Hassan adalah Rasulullah Shallallahu'alaihi wasallam."
            },
            {
                "number": 3127,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنِ ابْنِ الْمُسَيَّبِ قَالَأَنْشَدَ حَسَّانُ بْنُ ثَابِتٍ وَهُوَ فِي الْمَسْجِدِ فَمَرَّ عُمَرُ بِهِ فَلَحَظَهُ فَقَالَ حَسَّانُ وَاللَّهِ لَقَدْ أَنْشَدْتُ فِيهِ مَنْ هُوَ خَيْرٌ مِنْكَ فَخَشِيَ أَنْ يَرْمِيَهُ بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجَازَ وَتَرَكَهُ",
                "id": "Telah menceritakan kepada kami ['Abdur Rozzaq] telah memberitakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Ibnu Al Musayyib], ia berkata; Hassan bin Tsabit bersyair dimasjid kemudian 'Umar lewat dan meliriknya, [Hassan] berkata; Demi Allah, saya pernah bersyair dimasjid dan didalamnya ada orang yang lebih baik darimu. 'Umar khawatir bahwa yang dimaksudkan adalah Rasulullah Shallallahu'alaihi wasallam kemudian 'Umar membolehkan dan membiarkannya."
            },
            {
                "number": 3128,
                "arab": "حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ عَنْ أَبِي بَكْرِ بْنِ حَزْمٍ أَنَّ النَّضْرَ بْنَ عَبْدِ اللَّهِ أَخْبَرَهُ عَنْ عَمْرِو بْنِ حَزْمٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَقْعُدُوا عَلَى الْقُبُورِ",
                "id": "Telah menceritakan kepada kami [Mu'awiyah bin 'Amr] telah menceritakan kepada kami ['Abdullah bin Wahb] dari [Sa'id bin Abu Hilal] dari [Abu Bakr bin Hazm] bahwa [An Nadhr bin 'Abdullah] memberi khabar padanya dari ['Amr bin Hazm] dari Rasulullah Shallallahu'alaihi wasallam, beliau bersabda; \"Janganlah kalian duduk diatas kuburan.\""
            },
            {
                "number": 3129,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا ابْنُ وَهْبٍ أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ وَحَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ أَخْبَرَنَا ابْنُ لَهِيعَةَ عَنْ بَكْرِ بْنِ سَوَادَةَ عَنْ زِيَادِ بْنِ نُعَيْمٍ عَنْ عَمْرِو بْنِ حَزْمٍقَالَ رَآنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُتَّكِئًا عَلَى قَبْرٍ فَقَالَ لَا تُؤْذِ صَاحِبَ هَذَا الْقَبْرِ أَوْ لَا تُؤْذِهِ",
                "id": "Telah menceritakan kepada kami ['Ali bin 'Abdullah] telah menceritakan kepada kami [Ibnu Wahb] telah memberitakan kepada kami ['Amr bin Al Harits]. Dan telah menceritakan kepada kami [Yahya bin Ishaq] telah memberitakan kepada kami [Ibnu Lahi'ah] dari [Bakr bin Sawadah] dari [Ziyad bin Nu'aim] dari ['Amr bin Hazm], ia berkata; Rasulullah Shallallahu'alaihi wasallam melihatku bersandar diatas kuburan kemudian beliau bersabda; \"Jangan ganggu penghuni kubur ini, \" atau, \"Jangan ganggu dia.\""
            },
            {
                "number": 3130,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ حَدَّثَنِي أَبُو بَكْرِ بْنُ عَمْرِو بْنِ حَزْمٍ عَنْ عَمْرِو بْنِ حَزْمٍ قَالَعُرِضَتْ النَّهْشَةُ مِنْ الْحَيَّةِ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَ بِهَا",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami ['Abdul Wahid bin Ziyad] telah menceritakan kepada kami ['Utsman bin Hakim] telah menceritakan kepadaku [Abu Bakr bin 'Amr bin Hazm] dari ['Amr bin Hazm], ia berkata; Seekor ular mematikan diperlihatkan dihadapan Rasulullah Shallallahu'alaihi wasallam kemudian beliau memerintahkan agar dibunuh."
            },
            {
                "number": 3131,
                "arab": "حَدَّثَنَا يَعْقُوبُ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ الْمُطَّلِبِ عَنْ سَعِيدِ بْنِ عَمْرِو بْنِ شُرَحْبِيلَ عَنْ جَدِّهِ أَنَّهُ قَالَ وَجَدْتُ فِي كُتُبِ سِعِيدِ بْنِ سَعْدِ بْنِ عُبَادَةَ أَنَّ عُمَارَةَ بْنَ حَزْمٍ شَهِدَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah memberitakan kepada kami ['Abdul 'Aziz bin Al Muthallib] dari [Sa'id bin 'Amr bin Syurahbil] dari [kakeknya], ia berkata; saya temukan dalam kitab-kitab milik Sa'id bin Sa'ad bin 'Ubadah bahwa ['Umarah bin Hazm] menyaksikan bahwa Rasulullah Shallallahu'alaihi wasallam memutuskan sumpah harus disaksikan seorang saksi."
            },
            {
                "number": 3132,
                "arab": "حَدَّثَنَا حَسَنٌ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا بَكْرُ بْنُ سَوَادَةَ عَنْ زِيَادِ بْنِ نُعَيْمٍ الْحَضْرَمِيِّ أَنَّ ابْنَ حَزْمٍ إِمَّا عَمْرٌو وَإِمَّا عُمَارَةُ قَالَرَآنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا مُتَّكِئٌ عَلَى قَبْرٍ فَقَالَ انْزِلْ عَنْ الْقَبْرِ لَا تُؤْذِ صَاحِبَ الْقَبْرِ وَلَا يُؤْذِيكَ",
                "id": "Telah menceritakan kepada kami [Hasan] telah menceritakan kepada kami [Ibnu Lahi'ah] telah menceritakan kepada kami [Bakr bin Sawadah] dari [Ziyad bin Nu'aim Al Hadhrami] bahwa [Ibnu Hazm], kemungkinan 'Amr atau ['Umaroh], berkata; Rasulullah Shallallahu'alaihi wasallam melihatku saat aku bersandar diatas makam, kemudian Rasulullah Shallallahu'alaihi wasallam bersabda: \"Turunlah, jangan engkau ganggu penghuni kubur ini dan ia tidak mengganggumu.\""
            },
            {
                "number": 3133,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ مُحَمَّدِ بْنِ زَيْدٍ حَدَّثَنِي عُمَيْرٌ مَوْلَى آبِي اللَّحْمِ قَالَشَهِدْتُ خَيْبَرَ مَعَ سَادَتِي فَكَلَّمُوا فِيَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَنِي فَقُلِّدْتُ سَيْفًا فَإِذَا أَنَا أَجُرُّهُ فَأُخْبِرَ أَنِّي مَمْلُوكٌ فَأَمَرَ لِي بِشَيْءٍ مِنْ خُرْثِيِّ الْمَتَاعِ",
                "id": "Telah menceritakan kepada kami [Bisyr bin Al Mufadhdhal] dari [Muhammad bin Zaid] telah menceritakan kepadaku ['Umair] budak Abu Al Lahm, ia berkata; Saya turut serta dalam perang Khaibar bersama para pemimpinku, mereka berbicara kepadaku tentang Rasulullah Shallallahu'alaihi wasallam, kemudian aku mengaitkan pedang dan ternyata aku menyeretnya kemudian aku diberitahu bahwa aku adalah budak, kemudian saya diperintahkan untuk membawa perkakas."
            },
            {
                "number": 3134,
                "arab": "حَدَّثَنَا رِبْعِيُّ بْنُ إِبْرَاهِيمَ أَخُو إِسْمَاعِيلَ ابْنِ عُلَيَّةَ وَأَثْنَى عَلَيْهِ خَيْرًا قَالَ وَكَانَ يَفْضُلُ عَلَى إِسْمَاعِيلَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَاقَ عَنْ مُحَمَّدِ بْنِ زَيْدِ بْنِ الْمُهَاجِرِ عَنْ عُمَيْرٍ مَوْلَى آبِي اللَّحْمِ قَالَشَهِدْتُ مَعَ سَادَتِي خَيْبَرَ فَأَمَرَ بِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلِّدْتُ سَيْفًا فَإِذَا أَنَا أَجُرُّهُ قَالَ فَقِيلَ لَهُ إِنَّهُ عَبْدٌ مَمْلُوكٌ قَالَ فَأَمَرَ لِي بِشَيْءٍ مِنْ خُرْثِيِّ الْمَتَاعِ قَالَ وَعَرَضْتُ عَلَيْهِ رُقْيَةً كُنْتُ أَرْقِي بِهَا الْمَجَانِينَ فِي الْجَاهِلِيَّةِ قَالَ اطْرَحْ مِنْهَا كَذَا وَكَذَا وَارْقِ بِمَا بَقِيَقَالَ مُحَمَّدُ بْنُ زَيْدٍ وَأَدْرَكْتُهُ وَهُوَ يَرْقِي بِهَا الْمَجَانِينَ",
                "id": "Telah menceritakan kepada kami [Rib'iy bin Ibrahim] -saudara Isma'il bin 'Ulaiyyah, ia memujinya dengan baik, ia berkata; Ia lebih mulia dari Isma'il- telah menceritakan kepada kami ['Abdur Rahman bin Ishak] dari [Muhammad bin Zaid bin Al Muhajir] dari ['Umair] budak Abu Al Lahm, ia berkata; saya bersama para pemimpin-pemimpin saya turut serta dalam perang Khaibar, kemudian Rasulullah Shallallahu'alaihi wasallam memerintahkanku, lalu aku mengaitkan pedang dan ternyata aku menyeretnya. Kemudian ada yang berkata padanya; 'Ia adalah budak. Kemudian Rasulullah Shallallahu'alaihi wasallam memerintahkanku membawa beberapa perkakas. Kemudian saya memperlihatkan ruqyah kepada beliau yang pernah aku pakai untuk meruqyah orang-orang gila dimasa jahiliyah, Rasulullah Shallallahu'alaihi wasallam bersabda: \"Buanglah ini dan itu, dan selebihnya pakailah untuk meruqyah.\" Berkata Muhammad bin Zaid; saya bertemu dengannya saat ia meruqyah orang-orang gila dengan bacaan-bacaan itu."
            },
            {
                "number": 3135,
                "arab": "حَدَّثَنَا رِبْعِيُّ بْنُ إِبْرَاهِيمَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ إِسْحَاقَ حَدَّثَنِي أَبِي عَنْ عَمِّهِ وَعَنْ مُحَمَّدِ بْنِ زَيْدِ بْنِ الْمُهَاجِرِ أَنَّهُمَا سَمِعَا عُمَيْرًا مَوْلَى آبِي اللَّحْمِ قَالَأَقْبَلْتُ مَعَ سَادَتِي نُرِيدُ الْهِجْرَةَ حَتَّى أَنْ دَنَوْنَا مِنْ الْمَدِينَةِ قَالَ فَدَخَلُوا الْمَدِينَةَ وَخَلَّفُونِي فِي ظَهْرِهِمْ قَالَ قَالَ فَأَصَابَنِي مَجَاعَةٌ شَدِيدَةٌ قَالَ فَمَرَّ بِي بَعْضُ مَنْ يَخْرُجُ مِنْ الْمَدِينَةِ فَقَالُوا لِي لَوْ دَخَلْتَ الْمَدِينَةَ فَأَصَبْتَ مِنْ ثَمَرِ حَوَائِطِهَا فَدَخَلْتُ حَائِطًا فَقَطَعْتُ مِنْهُ قِنْوَيْنِ فَأَتَانِي صَاحِبُ الْحَائِطِ فَأَتَى بِي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَخْبَرَهُ خَبَرِي وَعَلَيَّ ثَوْبَانِ فَقَالَ لِي أَيُّهُمَا أَفْضَلُ فَأَشَرْتُ لَهُ إِلَى أَحَدِهِمَا فَقَالَ خُذْهُ وَأَعْطِي صَاحِبَ الْحَائِطِ الْآخَرَ وَخَلَّى سَبِيلِي",
                "id": "Telah menceritakan kepada kami [Rib'i bin Ibrahim] telah menceritakan kepada kami ['Abdur Rahman bin Ishak] telah menceritakan kepadaku [ayahku] dari [pamannya] dan dari [Muhammad bin Zaid bin Al Muhajir], keduanya mendengar ['Umair] budak Abu Al Lahm berkata; Saya pergi bersama para pemimpinku, kami hendak berhijrah hingga kami mendekati Madinah. Mereka pun masuk Madinah sementara aku ditinggal dibelakang mereka. Kemudian saya kelaparan. Lalu sebagian orang yang meninggalkan Madinah melewatiku, dan berujar; 'Oh,,, andai saja engkau masuk ke Madinah lalu memakan buah-buahan kebunnya'. Kemudian saya masuk ke salah satu kebun, aku memetik dua tandan. Namun pemilik kebun mendatangiku dan membawaku ke hadapan Rasulullah Shallallahu'alaihi wasallam, ia mengutarakan masalahku kepada beliau. Saat itu aku mengenakan dua pakaian, kemudian Rasulullah Shallallahu'alaihi wasallam bersabda: \"Mana diantara keduanya yang lebih baik?\" kemudian saya menunjukkan salah satunya, lalu Rasulullah Shallallahu'alaihi wasallam bersabda: \"Ambillah dan berikan pada pemilik kebun.\" Setelah itu saya dilepaskan."
            },
            {
                "number": 3136,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ عَنْ خَالِدِ بْنِ يَزِيدَ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ عَنْ عُمَيْرٍ مَوْلَى آبِي اللَّحْمِ عَنْ آبِي اللَّحْمِ أَنَّهُرَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ أَحْجَارِ الزَّيْتِ يَسْتَسْقِي وَهُوَ مُقْنِعٌ بِكَفَّيْهِ يَدْعُو",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits bin Sa'ad] dari [Kholid bin Yazid] dari [Sa'id bin Abu Hilal] dari [Yazid bin 'Abdullah] dari ['Umair] budak Abu Al Lahm, dari [Abu Al Lahm]; ia melihat Rasulullah Shallallahu'alaihi wasallam di dekat Ahjar Zait seraya meminta hujan, beliau mengangkat kedua tangan dengan telapak tangan ditelungkupkan, dan beliau berdo'a."
            },
            {
                "number": 3137,
                "arab": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ قَالَ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ قَالَ حَيْوَةُ عَنِ ابْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ عُمَيْرٍ مَوْلَى آبِي اللَّحْمِ أَنَّهُرَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَسْقِي عِنْدَ أَحْجَارِ الزَّيْتِ قَرِيبًا مِنْ الزَّوْرَاءِ قَائِمًا يَدْعُو يَسْتَسْقِي رَافِعًا كَفَّيْهِ لَا يُجَاوِزُ بِهِمَا رَأْسَهُ مُقْبِلٌ بِبَاطِنِ كَفَّيْهِ إِلَى وَجْهِهِحَدَّثَنَا هَارُونُ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ وَأَخْبَرَنِي حَيْوَةُ عَنْ عُمَرَ بْنِ مَالِكٍ عَنِ ابْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ عُمَيْرٍ مَوْلَى آبِي اللَّحْمِ أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Harun bin Ma'ruf], ia berkata; telah menceritakan kepada kami [Ibnu Wahab], ia berkata; berkata [Haiwah] dari [Ibnu Al Had] dari [Muhammad bin Ibrahim At Taimi] dari ['Umair] budak Abu Al Lahm; Bahwasanya ia melihat Rasulullah Shallallahu'alaihi wasallam di Ahjar Zait didekat Zarwa`, beliau berdiri berdo'a meminta hujan seraya mengangkat kedua tangan tidak sampai sebatas kepala, telapak tangan beliau dihadapkan ke wajah. Telah menceritakan kepada kami [Harun] dari [Ibnu Wahb], ia berkata; telah menceritakan kepadaku [Haiwah] dari ['Umar bin Malik] dari [Ibnu Al Had] dari [Muhammad bin Ibrahim] dari ['Umair] budak Abu Al Lahm; ia melihat Rasulullah Shallallahu'alaihi wasallam, ia menyebut hadis serupa."
            },
            {
                "number": 3138,
                "arab": "حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ رِفَاعَةَ بْنِ شَدَّادٍ قَالَكُنْتُ أَقُومُ عَلَى رَأْسِ الْمُخْتَارِ فَلَمَّا تَبَيَّنْتُ كِذَابَتَهُ هَمَمْتُ وَايْمُ اللَّهِ أَنْ أَسُلَّ سَيْفِي فَأَضْرِبَ عُنُقَهُ حَتَّى ذَكَرْتُ حَدِيثًا حَدَّثَنِيهِ عَمْرُو بْنُ الْحَمِقِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَمَّنَ رَجُلًا عَلَى نَفْسِهِ فَقَتَلَهُ أُعْطِيَ لِوَاءَ الْغَدْرِ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Bahz bin Asad] telah menceritakan kepada kami [Hammad bin Salamah] dari ['Abdul Malik bin 'Umair] dari [Rifa'ah bin Syaddad], ia berkata; Saya pernah berdiri diatas kepala Al Mukhtar, saat saya mengetahui kebohongannya, saya ingin -demi Allah- menghunuskan pedang lalu saya tebaskan ke lehernya hingga saya teringat hadits yang diceritakan ['Amr bin Al Hamiq] kepadaku, ia berkata; saya mendengar Rasulullah Shallallahu'alaihi wasallam bersabda: \"Barangsiapa yang memberi jaminan keamanan kepada seseorang kemudian membunuhnya, aku memberinya bendera pengkhianatan pada hari kiamat.\""
            },
            {
                "number": 3139,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا عِيسَى الْقَارِئُ أَبُو عُمَرَ بْنُ عُمَرَ حَدَّثَنَا السُّدِّيُّ عَنْ رِفَاعَةَ الْقِتْبَانِيِّ قَالَدَخَلْتُ عَلَى الْمُخْتَارِ فَأَلْقَى لِي وِسَادَةً وَقَالَ لَوْلَا أَنَّ أَخِي جِبْرِيلَ قَامَ عَنْ هَذِهِ لَأَلْقَيْتُهَا لَكَ قَالَ فَأَرَدْتُ أَنْ أَضْرِبَ عُنُقَهُ فَذَكَرْتُ حَدِيثًا حَدَّثَنِيهِ أَخِي عَمْرُو بْنُ الْحَمِقِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا مُؤْمِنٍ أَمَّنَ مُؤْمِنًا عَلَى دَمِهِ فَقَتَلَهُ فَأَنَا مِنْ الْقَاتِلِ بَرِيءٌ",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami ['Isa Al Qori` Abu Umar bin Umar] telah menceritakan kepada kami [As Suddi] dari [Rifa'ah Al Qibtani], ia berkata; 'Saya memasuki kediaman Al Mukhtar kemudian ia memberiku bantal dan berkata; 'Andaikan saudaraku Jibril, tidak berdiri dari bantal ini, pastilah aku tetapkan memberikan bantal itu untukmu.' Saya ingin menebas lehernya, hanya saya ingat hadits yang diceritakan saudaraku ['Amr bin Al Hamiq], ia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Siapapun mukmin yang telah memberi jaminan keamanan kepada orang mukmin lain atas nyawanya kemudian ia membunuhnya, maka saya terbebas dari si pembunuh itu.\""
            },
            {
                "number": 3140,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ عَنْ حَمَّادِ بْنِ سَلَمَةَ حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ عَنْ رِفَاعَةَ بْنِ شَدَّادٍ قَالَكُنْتُ أَقُومُ عَلَى رَأْسِ الْمُخْتَارِ فَلَمَّا عَرَفْتُ كَذِبَهُ هَمَمْتُ أَنْ أَسُلَّ سَيْفِي فَأَضْرِبَ عُنُقَهُ فَذَكَرْتُ حَدِيثًا حَدَّثَنَاهُ عَمْرُو بْنُ الْحَمِقِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَمَّنَ رَجُلًا عَلَى نَفْسِهِ فَقَتَلَهُ أُعْطِيَ لِوَاءَ الْغَدْرِ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id Al Qhoththon] dari [Hammad bin Salamah] telah menceritakan kepadaku ['Abdul Malik bin 'Umair] dari [Rifa'ah bin Syaddad], ia berkata; Aku pernah berdiri diatas kepala Al Mukhtar, saat saya mengetahui kebohongannya, saya ingin menghunuskan pedangku lalu aku tebaskan ke lehernya, kemudian saya teringat hadits yang diceritakan ['Amr bin Al Hamiq], ia berkata; Aku mendengar Rasulullah Shallallahu'alaihi wasallam bersabda: \"Barangsiapa memberi jaminan keamanan kepada seseorang atas nama dirinya, kemudian ia membunuhnya, aku memberinya bendera pengkhianatan pada hari kiamat.\""
            },
            {
                "number": 3141,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ الْحَمِقِ الْخُزَاعِيِّ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا أَرَادَ اللَّهُ بِعَبْدٍ خَيْرًا اسْتَعْمَلَهُ قِيلَ وَمَا اسْتَعْمَلَهُ قَالَ يُفْتَحُ لَهُ عَمَلٌ صَالِحٌ بَيْنَ يَدَيْ مَوْتِهِ حَتَّى يَرْضَى عَنْهُ مَنْ حَوْلَهُ",
                "id": "Telah menceritakan kepada kami [Zaid bin Al Hubab] telah menceritakan kepada kami [Mu'awiyah bin Shalih] telah menceritakan kepada kami ['Abdur Rahman bin Jubair bin Nufair] dari [ayahnya] dari ['Amr bin Al Hamiq Al Khuza'i], bahwa ia mendengar Nabi Shallallahu'alaihi wasallam bersabda; \"BIla Allah menghendaki kebaikan kepada seorang hamba, Allah akan menggunakannya.\" Ada yang bertanya; Digunakan untuk apa? Rasulullah Shallallahu'alaihi wasallam bersabda: \"Dibukakan baginya amal shalih dihadapan kematiannya hingga orang-orang sekelilingnya meridhainya.\""
            },
            {
                "number": 3142,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ مَسْعُودِ بْنِ الْحَكَمِ الْأَنْصَارِيِّ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدَ اللَّهِ بْنَ حُذَافَةَ السَّهْمِيَّ أَنْ يَرْكَبَ رَاحِلَتَهُ أَيَّامَ مِنًى فَيَصِيحَ فِي النَّاسِ لَا يَصُومَنَّ أَحَدٌ فَإِنَّهَا أَيَّامُ أَكْلٍ وَشُرْبٍقَالَ فَلَقَدْ رَأَيْتُهُ عَلَى رَاحِلَتِهِ يُنَادِي بِذَلِكَ",
                "id": "Telah menceritakan kepada kami ['Abdur Rozzaq] telah memberitakan kepada kami [Ma'mar], dari [Az Zuhri] dari [Mas'ud bin Al Hakam Al Anshori] dari [seseorang sahabat Nabi Shallallahu'alaihi wasallam], ia berkata; Rasulullah Shallallahu'alaihi wasallam memerintahkan 'Abdullah bin Hudzafah As Sahmi untuk naik kendaraan beliau saat di Mina, kemudian ia berkata lantang ditengah-tengah kerumunan orang; 'Jangan ada seorang pun puasa, karena sesungguhnya ini adalah hari-hari makan dan minum. Saya melihatnya berada diatas kendaraan Rasulullah Shallallahu'alaihi wasallam menyerukan hal itu."
            },
            {
                "number": 3143,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ قَالَ قَالَ الزُّهْرِيُّ وَأَخْبَرَنِي عَبْدُ الرَّحْمَنِ بْنُ كَعْبِ بْنِ مَالِكٍ وَكَانَ أَبُوهُ أَحَدَ الثَّلَاثَةِ الَّذِينَ تِيبَ عَلَيْهِمْ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ يَوْمَئِذٍ خَطِيبًا فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَاسْتَغْفَرَ لِلشُّهَدَاءِ الَّذِينَ قُتِلُوا يَوْمَ أُحُدٍ ثُمَّ قَالَ إِنَّكُمْ يَا مَعْشَرَ الْمُهَاجِرِينَ تَزِيدُونَ وَإِنَّ الْأَنْصَارَ لَا يَزِيدُونَ وَإِنَّ الْأَنْصَارَ عَيْبَتِي الَّتِي أَوَيْتُ إِلَيْهَا أَكْرِمُوا كَرِيمَهُمْ وَتَجَاوَزُوا عَنْ مُسِيئِهِمْ فَإِنَّهُمْ قَدْ قَضَوْا الَّذِي عَلَيْهِمْ وَبَقِيَ الَّذِي لَهُمْ",
                "id": "Telah menceritakan kepada kami ['Abdur Rozzaq] dari [Ma'mar], ia berkata; berkata [Az Zuhri], telah memberitakan kepadaku ['Abdur Rohman bin Ka'ab bin Malik], ayahnya adalah salah satu dari tiga orang yang taubatnya diterima, dari [salah seorang sahabat Nabi Shallallahu'alaihi wasallam]; bahwa Nabi Shallallahu'alaihi wasallam saat itu berdiri berkhutbah, beliau memuja dan memuji Allah dan memintakan ampunan kepada para syuhada` yang terbunuh dalam perang Uhud, selanjutnya beliau bersabda; \"Wahai sekalian kaum Muhajirin, kalian akan bertambah sementara kaum Anshar tidak bertambah. Sesungguhnya Anshar adalah tempatku berlindung. Muliakanlah orang mulia mereka dan maafkanlah kesalahan-kesalahan mereka karena mereka telah menunaikan kewajiban mereka dan yang masih tersisa tinggal hak mereka."
            },
            {
                "number": 3144,
                "arab": "حَدَّثَنَا زَكَرِيَّا بْنُ عَدِيٍّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَمْرٍو يَعْنِي الرَّقِّيَّ عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ حَدَّثَنَا جَبَلَةُ بْنُ سُحَيْمٍ عَنْ أَبِي الْمُثَنَّى الْعَبْدِيِّ قَالَ سَمِعْتُ السَّدُوسِيَّ يَعْنِي ابْنَ الْخَصَاصِيَّةِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُبَايِعَهُ قَالَ فَاشْتَرَطَ عَلَيَّ شَهَادَةَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ وَأَنْ أُقِيمَ الصَّلَاةَ وَأَنْ أُؤَدِّيَ الزَّكَاةَ وَأَنْ أَحُجَّ حَجَّةَ الْإِسْلَامِ وَأَنْ أَصُومَ شَهْرَ رَمَضَانَ وَأَنْ أُجَاهِدَ فِي سَبِيلِ اللَّهِ فَقُلْتُ يَا رَسُولَ اللَّهِ أَمَّا اثْنَتَانِ فَوَاللَّهِ مَا أُطِيقُهُمَا الْجِهَادُ وَالصَّدَقَةُ فَإِنَّهُمْ زَعَمُوا أَنَّهُ مَنْ وَلَّى الدُّبُرَ فَقَدْ بَاءَ بِغَضَبٍ مِنْ اللَّهِ فَأَخَافُ إِنْ حَضَرْتُ تِلْكَ جَشِعَتْ نَفْسِي وَكَرِهَتْ الْمَوْتَ وَالصَّدَقَةُ فَوَاللَّهِ مَا لِي إِلَّا غُنَيْمَةٌ وَعَشْرُ ذَوْدٍ هُنَّ رَسَلُ أَهْلِي وَحَمُولَتُهُمْ قَالَ فَقَبَضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَهُ ثُمَّ حَرَّكَ يَدَهُ ثُمَّ قَالَ فَلَا جِهَادَ وَلَا صَدَقَةَ فَلِمَ تَدْخُلُ الْجَنَّةَ إِذًا قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَنَا أُبَايِعُكَ قَالَ فَبَايَعْتُ عَلَيْهِنَّ كُلِّهِنَّ",
                "id": "Telah menceritakan kepada kami [Zakariya bin 'Adi] telah menceritakan kepada kami ['Ubaidillah bin Amr Ar Roqqi] dari [Zaid bin Abu Unaisah] telah menceritakan kepada kami [Jabalah bin Suhaim] dari [Abu Al Mutsanna Al 'Abdi], ia berkata; Saya mendengar [As Sadusi bin Al Khashashiyyah] berkata; Aku mendatangi Nabi Shallallahu'alaihi wasallam untuk berbaiat, kemudian beliau mensyaratkanku agar bersaksi bahwa tidak ada Ilah (yang haq) kecuali Allah dan bahwa Muhammad adalah hamba dan utusan-Nya, agar saya mendirikan sholat, menunaikan zakat, menunaikan haji Islam, puasa dibulan Ramadhan dan berjihad di jalan Allah. Kemudian aku berkata; Wahai Rasulullah! Demi Allah, dua diantaranya aku tidak mampu; jihad dan zakat, karena mereka menduga bahwa siapa pun yang lari meninggalkan peperangan maka ia kembali dengan kemurkaan Allah, karena itu aku khawatir bila berperang diriku akan serakah dan aku takut mati. Sementara zakat, demi Allah aku hanya sedikit harta rampasan perang dan sepuluh ekor unta, semuanya adalah penggembalaan dan bawaan keluargaku. Kemudian Rasulullah Shallallahu'alaihi wasallam menjabat tanganku, beliau menggerakkan tangan beliau lalu bersabda; \"Tidak ada jihad dan zakat, lalu kenapa kau masuk surga?\" aku berkata; Wahai Rasulullah! Aku berbaiat kepada tuan. Kemudian aku berbaiat atas semua itu."
            },
            {
                "number": 3145,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنِي الْأَسْوَدُ بْنُ شَيْبَانَ عَنْ خَالِدِ بْنِ سُمَيْرٍ عَنْ بَشِيرِ بْنِ نَهِيكٍ عَنْ بَشِيرِ ابْنِ الْخَصَاصِيَّةِ بَشِيرِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى رَجُلًا يَمْشِي فِي نَعْلَيْنِ بَيْنَ الْقُبُورِ فَقَالَ يَا صَاحِبَ السِّبْتِيَّتَيْنِ أَلْقِهِمَا",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepadaku [Al Aswad bin Syaiban] dari [Khalid bin Sumair] dari [Basyir bin Nahik] dari [Basyir bin Al Khoshoshiyyah, penyampai kabar gembira Rasulullah Shallallahu'alaihi wasallam], ia berkata; 'Nabi Shallallahu'alaihi wasallam melihat seseorang berjalan mengenakan sandal diantara pemakaman, kemudian Rasulullah Shallallahu'alaihi wasallam bersabda: \"Hai pemilik dua sandal bagus, lemparkan keduanya!\""
            },
            {
                "number": 3146,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ وَعَفَّانُ قَالَا ثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادِ بْنِ لَقِيطٍ سَمِعْتُ إِيَادَ بْنَ لَقِيطٍ يَقُولُ سَمِعْتُ لَيْلَى امْرَأَةَ بَشِيرٍ تَقُولُإِنَّ بَشِيرًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصُومُ يَوْمَ الْجُمُعَةِ وَلَا أُكَلِّمُ ذَلِكَ الْيَوْمَ أَحَدًا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَصُمْ يَوْمَ الْجُمُعَةِ إِلَّا فِي أَيَّامٍ هُوَ أَحَدُهَا أَوْ فِي شَهْرٍ وَأَمَّا أَنْ لَا تُكَلِّمَ أَحَدًا فَلَعَمْرِي لَأَنْ تَكَلَّمَ بِمَعْرُوفٍ وَتَنْهَى عَنْ مُنْكَرٍ خَيْرٌ مِنْ أَنْ تَسْكُتَ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid] dan ['Affan], keduanya berkata; telah menceritakan kepada kami ['ubaidhullah bin Iyad bin Laqith], ia berkata; Saya mendengar [Iyad bin Laqith] berkata; saya mendengar [Laila, istri Basyir] berkata; Basyir bertanya kepada Nabi Shallallahu'alaihi wasallam; 'Bolehkan saya puasa pada hari jum'at dan tidak berbicara pada hari itu pada siapa pun.' Nabi Shallallahu'alaihi wasallam bersabda; \"Jangan puasa khusus hari jum'at, kecuali puasa beberapa hari dan jumat menjadi salah satunya atau puasa sebulan. Adapun masalahmu engkau berniat tidak berbicara kepada siapa pun, sungguh bila kau berbicara kebaikan dan mencegah kemungkaran itu lebih baik dari pada diam.\""
            },
            {
                "number": 3147,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدُ وَعَفَّانُ قَالَا ثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادٍ حَدَّثَنَا إِيَادٌ يَعْنِي ابْنَ لَقِيطٍ عَنْ لَيْلَى امْرَأَةِ بَشِيرٍ قَالَتْأَرَدْتُ أَنْ أَصُومَ يَوْمَيْنِ مُوَاصِلَةً فَمَنَعَنِي بَشِيرٌ وَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهُ وَقَالَ يَفْعَلُ ذَلِكَ النَّصَارَى وَقَالَ عَفَّانُ يَفْعَلُ ذَلِكَ النَّصَارَى وَلَكِنْ صُومُوا كَمَا أَمَرَكُمْ اللَّهُ عَزَّ وَجَلَّ وَأَتِمُّوا الصِّيَامَ إِلَى اللَّيْلِ فَإِذَا كَانَ اللَّيْلُ فَأَفْطِرُوا",
                "id": "Telah menceritakan kepada kami [Abu Al Walid] dan ['Affan] keduanya berkata; telah menceritakan kepada kami ['ubaidhullah bin Iyad], telah menceritakan kepada kami [Iyad bin Laqith] dari [Laila, istri Basyir], ia berkata; Saya ingin puasa dua hari secara berturut-turut, kemudian [Basyir] melarangku dan berkata; Rasulullah Shallallahu'alaihi wasallam melarangnya. Perawi menuturkan; Orang-orang Anshar melakukannya. Berkata 'Affan; Orang-orang Anshar melakukannya, tapi berpuasalah seperti yang diperintahkan Allah kepada kalian dan sempurnakanlah puasa hingga malam, bila sudah malam berbukalah."
            },
            {
                "number": 3148,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادِ بْنِ لَقِيطٍ الشَّيْبَانِيُّ عَنْ أَبِيهِ عَنْ لَيْلَى امْرَأَةِ بَشِيرِ ابْنِ الْخَصَاصِيَّةِ عَنْ بَشِيرٍ قَالَوَكَانَ قَدْ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اسْمُهُ زَحْمٌ فَسَمَّاهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَشِيرًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Abu Bukair] telah menceritakan kepada kami ['ubaidhullah bin Iyad bin Laqith Asy Syaibani] dari [ayahnya] dari [Laila, istri Basyir bin Al Khoshoshiyyah] dari [Basyir] ia berkata, bahwasanya ia pernah mendatangi Nabi Shallallahu'alaihi wasallam; (pada waktu itu) ia bernama Zahm. Kemudian Nabi Shallallahu'alaihi wasallam memberinya nama Basyir."
            },
            {
                "number": 3149,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ عَنْ أَيُّوبَ عَنِ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَبْدِ اللَّهِ بْنِ حَنْظَلَةَ غَسِيلِ الْمَلَائِكَةِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِرْهَمٌ رِبًا يَأْكُلُهُ الرَّجُلُ وَهُوَ يَعْلَمُ أَشَدُّ مِنْ سِتَّةٍ وَثَلَاثِينَ زَنْيَةً",
                "id": "Telah menceritakan kepada kami [Husain bin Muhammad] telah menceritakan kepada kami [Jarir bin Hazim] dari [Ayyub] dari [Ibnu Abi Mulaikah] dari ['Abdullah bin Hanzhalah, yang dimandikan oleh para malaikat], ia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Satu dirham hasil riba yang dimakan seseorang sementara ia mengetahuinya, itu lebih buruk dari tigapuluh kali berzina.\""
            },
            {
                "number": 3150,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ الْعَزِيزِ بْنِ رُفَيْعٍ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنِ ابْنِ حَنْظَلَةَ بْنِ الرَّاهِبِ عَنْ كَعْبٍ قَالَلَأَنْ أَزْنِيَ ثَلَاثًا وَثَلَاثِينَ زَنْيَةً أَحَبُّ إِلَيَّ مِنْ أَنْ آكُلَ دِرْهَمَ رِبًا يَعْلَمُ اللَّهُ أَنِّي أَكَلْتُهُ حِينَ أَكَلْتُهُ رِبًا",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan] dari ['Abdul 'Aziz bin Rofi'] dari [Ibnu Abi Mulaikah] dari [Ibnu Hanzhalah bin Ar Rohib] dari [Ka'ab], ia berkata; 'Sungguh bila saya berzina tigapuluh tiga kali itu lebih aku sukai dari pada memakan satu dirham hasil riba, dan Allah mengetahui saat aku memakannya itu hasil riba.'"
            },
            {
                "number": 3151,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا سَعِيدٌ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ رَجُلٍ عَنْ عَبْدِ اللَّهِ بْنِ حَنْظَلَةَ بْنِ الرَّاهِبِأَنَّ رَجُلًا سَلَّمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ بَالَ فَلَمْ يَرُدَّ عَلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى قَالَ بِيَدِهِ إِلَى الْحَائِطِ يَعْنِي أَنَّهُ تَيَمَّمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah], telah menceritakan kepada kami [Sa'id], dari [Muhammad bin Al Munkadir] dari [seseorang] dari ['Abdullah bin Hanzhalah bin Ar Rahib] bahwa seseorang mengucapkan salam pada Nabi Shallallahu'alaihi wasallam dan ia habis buang air kecil, Nabi Shallallahu'alaihi wasallam tidak menjawab salamnya hingga beliau mengisyaratkan tangannya ke sebuah dinding. Maksud beliau, 'agar bertayammum.'"
            },
            {
                "number": 3152,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ حَدَّثَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ حَبَّانَ الْأَنْصَارِيُّ ثُمَّ الْمَازِنِيُّ مَازِنُ بَنِي النَّجَّارِ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ قُلْتُ لَهُ أَرَأَيْتَ وُضُوءَ عَبْدِ اللَّهِ بْنِ عُمَرَ لِكُلِّ صَلَاةٍ طَاهِرًا كَانَ أَوْ غَيْرَ طَاهِرٍ عَمَّ هُوَ فَقَالَ حَدَّثَتْهُ أَسْمَاءُ بِنْتُ زَيْدِ بْنِ الْخَطَّابِ أَنَّ عَبْدَ اللَّهِ بْنَ حَنْظَلَةَ بْنِ أَبِي عَامِرِ ابْنَ الْغَّسِيلِ حَدَّثَهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ أُمِرَ بِالْوُضُوءِ لِكُلِّ صَلَاةٍ طَاهِرًا كَانَ أَوْ غَيْرَ طَاهِرٍ فَلَمَّا شَقَّ ذَلِكَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمِرَ بِالسِّوَاكِ عِنْدَ كُلِّ صَلَاةٍ وَوُضِعَ عَنْهُ الْوُضُوءُ إِلَّا مِنْ حَدَثٍقَالَ فَكَانَ عَبْدُ اللَّهِ يَرَى أَنَّ بِهِ قُوَّةً عَلَى ذَلِكَ كَانَ يَفْعَلُهُ حَتَّى مَاتَ",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [ayahku] dari [Ibnu Ishak] telah menceritakan kepadaku [Muhammad bin Yahya bin Habban Al Anshori Al Mazini Mazin Bani An Najar] dari ['ubaidhullah bin 'Abdullah bin 'Umar]; (Muhammad) Berkata: saya bertanya padanya; Apa kau pernah melihat wudhu 'Abdullah bin 'Umar, ia bersuci setiap sholat ataukah tidak?. Kemudian ia menjawab; [Asma` binti Zaid bin Al Khaththab] telah bercerita kepadanya bahwa ['Abdullah bin Hanzhalah bin Abu 'Amir bin Al Ghasil] bercerita kepadanya bahwa Rasulullah Shallallahu'alaihi wasallam diperintahkan untuk berwudhu setiap sholat ataukah tidak. Saat hal itu memberatkan Rasulullah Shallallahu'alaihi wasallam, Rasulullah Shallallahu'alaihi wasallam diperintahkan untuk bersiwak setiap kali sholat dan wudhu tidak diberlakukan pada beliau kecuali karena hadats. Kemudian 'Abdullah menaksir dirinya mampu melakukan yang demikian hingga ia meninggal dunia."
            },
            {
                "number": 3153,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُحَمَّدٍ وَهُوَ أَبُو إِبْرَاهِيمَ الْمُعَقِّبُ حَدَّثَنَا مَرْوَانُ يَعْنِي ابْنَ مُعَاوِيَةَ الْفَزَارِيَّ حَدَّثَنَا مَنْصُورُ بْنُ حَيَّانَ الْأَسَدِيُّ عَنْ سُلَيْمَانَ بْنِ بِشْرٍ الْخُزَاعِيِّ عَنْ خَالِهِ مَالِكِ بْنِ عَبْدِ اللَّهِ قَالَغَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ أُصَلِّ خَلْفَ إِمَامٍ كَانَ أَوْجَزَ مِنْهُ صَلَاةً فِي تَمَامِ الرُّكُوعِ وَالسُّجُودِ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Muhammad Abu Ibrahim Al Mu'aqqab] telah menceritakan kepada kami [Marwan bin Mua'wiyah Al Fazari] telah menceritakan kepada kami [Manshur bin Hayyan Al Asadi] dari [Sulaiman bin Bisyr Al Khuza'i] dari pamannya - [Malik bin 'Abdullah] -, ia berkata; saya perang bersama Rasulullah Shallallahu'alaihi wasallam, saya tidak sholat dibelakang imam yang mempercepat sholatnya dalam ruku' dan sujud."
            },
            {
                "number": 3154,
                "arab": "حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا ابْنُ جَابِرٍ أَنَّ أَبَا الْمُصَبِّحِ الْأَوْزَاعِيَّ حَدَّثَهُمْ قَالَبَيْنَا نَسِيرُ فِي دَرْبِ قَلَمْيَةَ إِذْ نَادَى الْأَمِيرَ مَالِكَ بْنَ عَبْدِ اللَّهِ الْخَثْعَمِيَّ رَجُلٌ يَقُودُ فَرَسَهُ فِي عِرَاضِ الْجَبَلِ يَا أَبَا عَبْدِ اللَّهِ أَلَا تَرْكَبُ قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ اغْبَرَّتْ قَدَمَاهُ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ سَاعَةً مِنْ نَهَارٍ فَهُمَا حَرَامٌ عَلَى النَّارِ",
                "id": "Telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Ibnu Jabir] bahwa [Abu Al Mushobbih Al Auza'i] bercerita kepada mereka, ia berkata; Saat kami berjalan digerbang Qolaimah, seseorang yang tengah menuntun kudanya dari arah gunung memanggil sang pemimpin [Malik bin 'Abdullah Al Khots'ami]; Hai Abu Abdullah, apa kau tidak naik. Ia berkata; 'Aku mendengar Rasulullah Shallallahu'alaihi wasallam bersabda: \"Barangsiapa yang kedua kakinya berdebu dijalan Allah Azza wa jalla sesaat, keduanya haram bagi neraka.\""
            },
            {
                "number": 3155,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الشُّعَيْثِيُّ عَنْ لَيْثِ بْنِ الْمُتَوَكِّلِ عَنْ مَالِكِ بْنِ عَبْدِ اللَّهِ الْخَثْعَمِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اغْبَرَّتْ قَدَمَاهُ فِي سَبِيلِ اللَّهِ حَرَّمَهُ اللَّهُ عَلَى النَّارِ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Muhammad bin 'Abdullah Asy Syu'aitsi] dari [Laits bin Al Mutawakkil] dari [Malik bin 'Abdullah Al Khats'ami], ia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Barangsiapa yang keduanya kakinya berdebu dijalan Allah, Allah mengharamkannya dari neraka.\""
            },
            {
                "number": 3156,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا مَنْصُورُ بْنُ حَيَّانَ حَدَّثَنِي سُلَيْمَانُ الْخُزَاعِيُّ عَنْ خَالِهِ مَالِكِ بْنِ عَبْدِ اللَّهِ قَالَغَزَوْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا صَلَّيْتُ خَلْفَ إِمَامٍ يَؤُمُّ النَّاسَ أَخَفَّ صَلَاةً مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami ['Abdul Wahid bin Ziyad] telah menceritakan kepada kami [Manshur bin Hayyan] telah menceritakan kepadaku [Sulaiman Al Khuza'i] dari pamannya - [Malik bin 'Abdullah] -, ia berkata; Saya berperang bersama Rasulullah Shallallahu'alaihi wasallam, saya tidak sholat dibelakang imam yang mengimami orang yang paling cepat sholatnya melebihi Rasulullah Shallallahu'alaihi wasallam."
            },
            {
                "number": 3157,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ مُظَفَّرُ بْنُ مُدْرِكٍ حَدَّثَنَا زُهَيْرٌ حَدَّثَنِي سِمَاكُ بْنُ حَرْبٍ حَدَّثَنِي قَبِيصَةُ بْنُ هُلْبٍ عَنْ أَبِيهِ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَسَأَلَهُ رَجُلٌ فَقَالَ إِنَّ مِنْ الطَّعَامِ طَعَامًا أَتَحَرَّجُ مِنْهُ فَقَالَ لَا يَخْتَلِجَنَّ فِي نَفْسِكَ شَيْءٌ ضَارَعْتَ فِيهِ النَّصْرَانِيَّةَ",
                "id": "Telah menceritakan kepada kami [Abu Kamil Muzhaffar bin Mudrik] telah menceritakan kepada kami [Zuhair] telah menceritakan kepadaku [Simak bin Harb] telah menceritakan kepadaku [Qabishah bin Hulb] dari [ayahnya], ia berkata; Saya mendengar Rasulullah Shallallahu'alaihi wasallam bersabda saat seseorang berkata kepada beliau; Diantara berbagai makanan ada satu makanan yang tidak saya sukai. Rasulullah Shallallahu'alaihi wasallam bersabda: \"Jangan sampai ada sesuatu menggelisahkan dirimu, yang itu menyamai Nasrani.\""
            },
            {
                "number": 3158,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ قَبِيصَةَ بْنِ هُلْبٍ عَنْ أَبِيهِ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ طَعَامِ النَّصَارَى فَقَالَ لَا يَخْتَلِجَنَّ فِي صَدْرِكَ طَعَامٌ ضَارَعْتَ فِيهِ النَّصْرَانِيَّةَ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan] dari [Simak bin Harb] dari [Qabishoh bin Hulb] dari [ayahnya], ia berkata; Saya bertanya kepada Rasulullah Shallallahu'alaihi wasallam tentang makanan kaum Nasrani, lalu beliau bersabda; \"Jangan sampai ada satu makanan pun yang menggelisahkan hatimu, yang itu menyamai Nasrani.\""
            },
            {
                "number": 3159,
                "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ قَبِيصَةَ بْنِ الْهُلْبِ عَنْ أَبِيهِ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاضِعًا يَمِينَهُ عَلَى شِمَالِهِ فِي الصَّلَاةِ وَرَأَيْتُهُ يَنْصَرِفُ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ",
                "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Simak bin Harb] dari [Qabishah bin Al Hulb] dari [ayahnya], ia berkata; Saya melihat Nabi Shallallahu'alaihi wasallam meletakkan tangan kanan beliau diatas tangan kiri saat sholat dan saya melihat beliau menoleh ke kanan dan ke kiri."
            },
            {
                "number": 3160,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ الْوَرَكَانِيُّ حَدَّثَنَا شَرِيكٌ عَنْ سِمَاكٍ عَنْ قَبِيصَةَ بْنِ هُلْبٍ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَأَلْتُهُ عَنْ طَعَامِ النَّصَارَى فَقَالَ لَا يَخْتَلِجَنَّ أَوْ لَا يَحِيكَنَّ فِي صَدْرِكَ طَعَامٌ ضَارَعْتَ فِيهِ النَّصْرَانِيَّةَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far Al Warakani] telah menceritakan kepada kami [Syarik] dari [Simak] dari [Qabishah bin Hulb] dari [ayahnya] dari Nabi Shallallahu'alaihi wasallam; Aku bertanya kepada beliau tentang makanan orang-orang Nasrani, beliau bersabda: \"Jangan ada makanan yang meresahkan di dadamu, yang menyamai Nasrani.\""
            },
            {
                "number": 3161,
                "arab": "حَدَّثَنَا أَبُو مُوسَى مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو دَاوُدَ عَنْ شُعْبَةَ أَخْبَرَنِي سِمَاكُ بْنُ حَرْبٍ قَالَ سَمِعْتُ قَبِيصَةَ بْنَ هُلْبٍ يُحَدِّثُ عَنْ أَبِيهِسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَذَكَرَ الصَّدَقَةَ قَالَ لَا يَجِيئَنَّ أَحَدُكُمْ بِشَاةٍ لَهَا يُعَارٌ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Abu Musa Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abu Dawud] dari [Syu'bah] telah mengabarkan kepadaku [Simak bin Harb], ia berkata; Saya mendengar [Qobishoh bin Hulb] menceritakan dari [ayahnya], ia mendengar Nabi Shallallahu'alaihi wasallam menyebutkan sedekah, beliau bersabda; \"Janganlah salah satu dari kalian datang membawa seekor kambing yang ada cacatnya pada hari kiamat.\""
            },
            {
                "number": 3162,
                "arab": "حَدَّثَنَا زَكَرِيَّا بْنُ يَحْيَى بْنِ صُبَيْحٍ حَدَّثَنَا شَرِيكٌ عَنْ سِمَاكٍ عَنْ قَبِيصَةَ بْنِ الْهُلْبِ عَنْ أَبِيهِ قَالَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ طَعَامِ النَّصَارَى فَقَالَ لَا يَحِيكَنَّ فِي صَدْرِكَ طَعَامٌ ضَارَعْتَ فِيهِ النَّصْرَانِيَّةَ قَالَ وَرَأَيْتُهُ يَضَعُ إِحْدَى يَدَيْهِ عَلَى الْأُخْرَى",
                "id": "Telah menceritakan kepada kami [Zakariya bin Yahya bin Shubaih] telah menceritakan kepada kami [Syarik] dari [Simak] dari [Qobishoh bin Al Hulb] dari [ayahnya], ia berkata; saya bertanya kepada Nabi Shallallahu'alaihi wasallam tentang makanan orang-orang Nasrani, beliau bersabda; \"Jangan sampai ada satu makanan pun yang meresahkan dadamu yang menyamai Nasrani.\" Ia berkata; dan saya melihat beliau meletakkan salah satu tangan beliau diatas tangan yang lain."
            },
            {
                "number": 3163,
                "arab": "قَالَوَرَأَيْتُهُ يَنْصَرِفُ مَرَّةً عَنْ يَمِينِهِ وَمَرَّةً عَنْ شِمَالِهِ",
                "id": "(Masih dari jalur yang sama dengan hadits sebelumnya, dari [Hulub]) Ia berkata; Dan saya melihat beliau menoleh ke kanan sekali dan menoleh ke kiri sekali."
            },
            {
                "number": 3164,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ عَنْ سِمَاكٍ عَنْ قَبِيصَةَ بْنِ هُلْبٍ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْصَرِفُ عَنْ شِقَّيْهِ",
                "id": "Telah menceritakan kepada kami 'Abdullah telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Ghundar] dari [Syu'bah] dari [Simak] dari [Qobishoh bin Hulb] dari [ayahnya], ia berkata; Saya melihat Rasulullah Shallallahu'alaihi wasallam menoleh ke kedua sisi beliau."
            },
            {
                "number": 3165,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ النَّرْسِيُّ وَهَنَّادُ بْنُ السَّرِيِّ قَالَا ثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ عَنْ قَبِيصَةَ بْنِ هُلْبٍ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَؤُمُّنَا فَيَأْخُذُ شِمَالَهُ بِيَمِينِهِ وَكَانَ يَنْصَرِفُ عَنْ جَانِبَيْهِ جَمِيعًا عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ",
                "id": "Telah menceritakan kepada kami 'Abdullah telah menceritakan kepada kami [Al 'Abbas bin Al Walid An Narsi] dan [Hannad bin Al Sari] keduanya berkata; telah menceritakan kepada kami [Abu Al Ahwash] dari [Simak] dari [Qobishoh bin Hulb] dari [ayahnya], ia berkata; Rasulullah Shallallahu'alaihi wasallam mengimami kami, beliau memegang tangan kiri dengan tangan kanan dan beliau menoleh ke kedua sisinya; kanan dan kiri."
            },
            {
                "number": 3166,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكٍ عَنْ قَبِيصَةَ بْنِ هُلْبٍ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَؤُمُّنَا فَيَأْخُذُ شِمَالَهُ بِيَمِينِهِ وَكَانَ يَنْصَرِفُ عَلَى جَانِبَيْهِ جَمِيعًا",
                "id": "Telah menceritakan kepada kami ['Utsman bin Abu Syaibah] telah menceritakan kepada kami [Abu Al Ahwash] dari [Simak] dari [Qobishoh bin Hulb] dari [ayahnya], ia berkata; Rasulullah Shallallahu'alaihi wasallam mengimami kami, beliau memegang tangan kiri dengan tangan kanan dan menoleh ke kedua sisi beliau."
            },
            {
                "number": 3167,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَاقَ عَنْ مَطَرِ بْنِ عُكَامِسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَضَى اللَّهُ مِيتَةَ عَبْدٍ بِأَرْضٍ جَعَلَ لَهُ إِلَيْهَا حَاجَةً",
                "id": "Telah menceritakan kepada kami 'Abdullah telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Dawud Al Hafari] dari [Sufyan] dari [Abu Ishaq] dari [Mathor bin 'Ukamis], ia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Bila Allah menetapkan kematian seorang hamba disuatu bumi, Allah menjadikan ia memerlukan tempat itu.\""
            },
            {
                "number": 3168,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ الْوَرَكَانِيُّ حَدَّثَنَا حُدَيْجٌ أَبُو سُلَيْمَانَ عَنْ أَبِي إِسْحَاقَ عَنْ مَطَرِ بْنِ عُكَامِسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُقَدَّرُ لِأَحَدٍ يَمُوتُ بِأَرْضٍ إِلَّا حُبِّبَتْ إِلَيْهِ وَجُعِلَ لَهُ إِلَيْهَا حَاجَةٌ",
                "id": "Telah menceritakan kepada kami 'Abdullah telah menceritakan kepada kami [Muhammad bin Ja'far Al Warokani] telah menceritakan kepada kami [Hudaij Abu Sulaiman] dari [Abu Ishak] dari [Mathor bin 'Ukamis], ia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Tidak seorang pun meninggal disuatu tempat melainkan ia pasti dibuat senang pada tempat itu dan ia memerlukan tempat tersebut.\""
            },
            {
                "number": 3169,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا أَبُو أَيُّوبَ صَاحِبُ الْبَصْرِيِّ سُلَيْمَانُ بْنُ أَيُّوبَ حَدَّثَنَا هَارُونُ بْنُ دِينَارٍ عَنْ أَبِيهِ قَالَ سَمِعْتُ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَالُ لَهُ مَيْمُونُ بْنُ سُنْبَادَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِوَامُ أُمَّتِي بِشِرَارِهَا قَالَهَا ثَلَاثًا",
                "id": "Telah menceritakan kepada kami 'Abdullah telah menceritakan kepada kami [Abu Ayyub, temannya Al Bashri -Sulaiman bin Ayyub-] telah menceritakan kepada kami [Harun bin Dinar] dari [ayahnya], ia berkata; Saya mendengar salah seorang sahabat Nabi Shallallahu'alaihi wasallam bernama [Maimun bin Sunbad] berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Tegaknya ummatku karena orang-orang jeleknya.\" Rasulullah Shallallahu'alaihi wasallam mengucapkannya tiga kali."
            },
            {
                "number": 3170,
                "arab": "فِي سَنَةِ ثَمَانٍ وَعِشْرِينَ وَمِائَتَيْنِ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي ظَبْيَانَ عَنْ مُعَاذِ بْنِ جَبَلٍأَنَّهُ لَمَّا رَجَعَ مِنْ الْيَمَنِ قَالَ يَا رَسُولَ اللَّهِ رَأَيْتُ رِجَالًا بِالْيَمَنِ يَسْجُدُ بَعْضُهُمْ لِبَعْضِهِمْ أَفَلَا نَسْجُدُ لَكَ قَالَ لَوْ كُنْتُ آمِرًا بَشَرًا يَسْجُدُ لِبَشَرٍ لَأَمَرْتُ الْمَرْأَةَ أَنْ تَسْجُدَ لِزَوْجِهَاحَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا الْأَعْمَشُ قَالَ سَمِعْتُ أَبَا ظَبْيَانَ يُحَدِّثُ عَنْ رَجُلٍ مِنْ الْأَنْصَارِ عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ أَقْبَلَ مُعَاذٌ مِنْ الْيَمَنِ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي رَأَيْتُ رِجَالًا فَذَكَرَ مَعْنَاهُ",
                "id": "Pada tahun duaratus duapuluh delapan, telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami [Al A'masy] dari [Abu Zhabyan] dari [Mu'adz bin Jabal]; bahwasanya saat ia kembali dari Yaman, ia berkata; Wahai Rasulullah! Saya melihat orang-orang di Yaman saling sujud satu sama lain, bolehkan kami bersujud pada baginda. Rasulullah Shallallahu'alaihi wasallam bersabda: \"Andaikan aku memerintahkan manusia sujud kepada sesama manusia, pastilah aku perintahkan wanita bersujud kepada suaminya.\" Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Al A'masy] dari [Abu Zhabyan] ia menceritakan dari [seorang Anshar] dari [Mu'adz bin Jabal], ia datang dari Yaman dan berkata; Wahai Rasulullah! Saya melihat orang-orang. Ia menyebutkan maknanya."
            },
            {
                "number": 3171,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ عَنْ مُعَاذٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ يَا مُعَاذُ أَتْبِعْ السَّيِّئَةَ بِالْحَسَنَةِ تَمْحُهَا وَخَالِقْ النَّاسَ بِخُلُقٍ حَسَنٍفَقَالَ وَقَالَ وَكِيعٌ وَجَدْتُهُ فِي كِتَابِي عَنْ أَبِي ذَرٍّ وَهُوَ السَّمَاعُ الْأَوَّلُ قَالَ أَبِي وَقَالَ وَكِيعٌ قَالَ سُفْيَانُ مَرَّةً عَنْ مُعَاذٍ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan] dari [Habib bin Abu Tsabit] dari [Maimun bin Abu Syabib] dari [Mu'adz] bahwa Rasulullah Shallallahu'alaihi wasallam bersabda padanya; \"Hai Mu'adz! Ikutilah keburukan dengan kebaikan niscaya akan menghapusnya dan perlakukan orang dengan akhlak yang baik.\" Berkata [Waki']; saya menemukannya dalam buku saya dari [Abu Dzarr], itu adalah pendengaran pertama, berkata ayah saya; berkata Waki'; berkata Sufyan dari Mu'adz sekali."
            },
            {
                "number": 3172,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ جَابِرٍ عَنْ مُحَمَّدِ بْنِ زَيْدٍ عَنْ مُعَاذٍ قَالَبَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى قُرًى عَرَبِيَّةٍ فَأَمَرَنِي أَنْ آخُذَ حَظَّ الْأَرْضِو قَالَ عَبْدُ الرَّزَّاقِ يَعْنِي عَنْ سُفْيَانَ عَنْ جَابِرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ مُحَمَّدِ بْنِ زَيْدٍ يَعْنِي فِي حَدِيثِ مُعَاذٍ",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Jabir] dari [Muhammad bin Zaid] dari [Mu'adz], ia berkata; Rasulullah Shallallahu'alaihi wasallam mengutusku ke suatu perkampungan arab, beliau memerintahkanku untuk memunggut bagian bumi. Berkata ['Abdur Razzaq] dari ['Sufyan] dari [Jabir] dari ['Abdur Rahman bin Al Aswad] dari [Muhammad bin Zaid], maksudnya dalam hadits [Mu'adz]."
            },
            {
                "number": 3173,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَاقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ مُعَاذٍ قَالَكُنْتُ رِدْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا مُعَاذُ أَتَدْرِي مَا حَقُّ اللَّهِ عَلَى الْعِبَادِ قَالَ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ أَنْ تَعْبُدُوهُ وَلَا تُشْرِكُوا بِهِ شَيْئًا قَالَ فَهَلْ تَدْرِي مَا حَقُّ الْعِبَادِ عَلَى اللَّهِ إِذَا هُمْ فَعَلُوا ذَلِكَ قَالَ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ لَا يُعَذِّبُهُمْ",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Isra`il] dari [Abu Ishaq] dari ['Amr bin Maimun] dari [Mu'adz], ia berkata; Saya pernah membonceng Rasulullah Shallallahu'alaihi wasallam, beliau bersabda; \"Hai Mu'adz! Apa hak Allah atas manusia?\" saya menjawab; Allah dan RasulNya yang lebih tahu. Rasulullah Shallallahu'alaihi wasallam bersabda: \"Bahwa kalian menyembahnya dan tidak menyekutukan-Nya dengan sesuatu pun.\" Rasulullah Shallallahu'alaihi wasallam bersabda: \"Apa kau tahu hak manusia atas Allah bila mereka melakukan hal itu?\" saya menjawab; Allah dan RasulNya yang lebih tahu. Rasulullah Shallallahu'alaihi wasallam bersabda: \"Allah tidak menyiksa mereka.\""
            },
            {
                "number": 3174,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنِ النَّهَّاسِ بْنِ قَهْمٍ حَدَّثَنِي شَدَّادٌ أَبُو عَمَّارٍ عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سِتٌّ مِنْ أَشْرَاطِ السَّاعَةِ مَوْتِي وَفَتْحُ بَيْتِ الْمَقْدِسِ وَمَوْتٌ يَأْخُذُ فِي النَّاسِ كَقُعَاصِ الْغَنَمِ وَفِتْنَةٌ يَدْخُلُ حَرْبُهَا بَيْتَ كُلِّ مُسْلِمٍ وَأَنْ يُعْطَى الرَّجُلُ أَلْفَ دِينَارٍ فَيَتَسَخَّطَهَا وَأَنْ تَغْدِرَ الرُّومُ فَيَسِيرُونَ فِي ثَمَانِينَ بَنْدًا تَحْتَ كُلِّ بَنْدٍ اثْنَا عَشَرَ أَلْفًا",
                "id": "Telah menceritakan kepada kami [Waki'] dari [An Nahhas bin Qahm] telah menceritakan kepada kami [Syaddad Abu 'Ammar] dari [Mu'adz bin Jabal], ia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Enam tanda-tanda kiamat; kematianku, penaklukkan Baitul Maqdis, kematian yang menyerang manusia laksana kematian kambing yang cepat, muncul fitnah yang serangannya masuk ke rumah setiap orang muslim, orang diberi seribu dinar kemudian ia marah, Romawi berkhianat kemudian mereka pergi dalam delapan bendera, dibawa setiap bendera ada duabelas (pasukan).\""
            },
            {
                "number": 3175,
                "arab": "حَدَّثَنَاه عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ وَعَبْدُ الرَّزَّاقِ قَالَ ثَنَا مَعْمَرٌ عَنْ أَبِي إِسْحَاقَ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَكُنْتُ رِدْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هَلْ تَدْرِي مَا حَقُّ اللَّهِ عَزَّ وَجَلَّ عَلَى عِبَادِهِ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ أَنْ يَعْبُدُوهُ وَلَا يُشْرِكُوا بِهِ شَيْئًا قَالَ هَلْ تَدْرِي مَا حَقُّ الْعِبَادِ عَلَى اللَّهِ إِذَا فَعَلُوا ذَلِكَ أَنْ يَغْفِرَ لَهُمْ وَلَا يُعَذِّبَهُمْ قَالَ مَعْمَرٌ فِي حَدِيثِهِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَلَا أُبَشِّرُ النَّاسَ قَالَ دَعْهُمْ يَعْمَلُواحَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي حَصِينٍ عَنِ الْأَسْوَدِ بْنِ هِلَالٍ عَنْ مُعَاذٍ بِنَحْوِهِ",
                "id": "Telah menceritakan kepada kami ['Abdur Rahman] telah menceritakan kepada kami [Sufyan] dan ['Abdur Razzaq], ia berkata; telah menceritakan kepada kami [Ma'mar] dari [Abu Ishak] dari ['Amr bin Maimun] dari [Mu'adz bin Jabal], ia berkata; Saya pernah membonceng Rasulullah Shallallahu'alaihi wasallam diatas keledai, beliau bersabda; \" Apa hak Allah Azza wa Jalla atas manusia?\" saya menjawab; Allah dan RasulNya yang lebih tahu. Rasulullah Shallallahu'alaihi wasallam bersabda: \"Bahwa kalian menyembahnya dan tidak menyekutukannya dengan sesuatu pun.\" Rasulullah Shallallahu'alaihi wasallam bersabda: \" Apa kau tahu hak manusia atas Allah bila mereka melakukan hal itu?\" saya menjawab; Allah dan RasulNya yang lebih tahu. Rasulullah Shallallahu'alaihi wasallam bersabda: \"Mengampuni mereka dan tidak menyiksa mereka.\" Berkata Ma'mar dalam haditsnya, Mu'adz berkata; Wahai Rasulullah! Bolehkah saya sampaikan khabar gembira ini kepada orang-orang. Rasulullah Shallallahu'alaihi wasallam bersabda: \"Biarlah mereka beramal.\" Telah menceritakan kepada kami ['Abdur Rahman] telah menceritakan kepada kami [Sufyan] dari [Abu Hushain] dari [Al Aswad bin Hilal] dari [Mua'dz] hadits serupa."
            },
            {
                "number": 3176,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِي رَزِينٍ عَنْ مُعَاذٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَا أَدُلُّكَ عَلَى بَابٍ مِنْ أَبْوَابِ الْجَنَّةِ قَالَ وَمَا هُوَ قَالَ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
                "id": "Telah menceritakan kepada kami ['Abdur Rahman] telah menceritakan kepada kami [Hammad bin Salamah] dari [Atho` bin As Sa`ib] dari [Abu Rozin] dari [Mu'adz], bahwa Nabi Shallallahu'alaihi wasallam bersabda; \"Maukah kau aku tunjukkan salah satu pintu surga?\" ia bertanya; Apa itu? Rasulullah Shallallahu'alaihi wasallam bersabda: \"Laa haula wa laa quwwata illa billaah.\""
            },
            {
                "number": 3177,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ عَنْ أَبِي الزُّبَيْرِ حَدَّثَنَا أَبُو الطُّفَيْلِ حَدَّثَنَا مُعَاذُ بْنُ جَبَلٍ قَالَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفْرَةٍ سَافَرَهَا وَذَلِكَ فِي غَزْوَةِ تَبُوكَ فَجَمَعَ بَيْنَ الظُّهْرِ وَالْعَصْرِ وَالْمَغْرِبِ وَالْعِشَاءِ قُلْتُ مَا حَمَلَهُ عَلَى ذَلِكَ قَالَ أَرَادَ أَنْ لَا يُحْرِجَ أُمَّتَهُ",
                "id": "Telah menceritakan kepada kami ['Abdur Rahman] telah menceritakan kepada kami [Qurroh bin Kholid] dari [Abu Az Zubair] telah menceritakan kepada kami [Abu Ath Thufail] telah menceritakan kepada kami [Mu'adz bin Jabal], ia berkata; Rasulullah Shallallahu'alaihi wasallam pergi dalam salah satu perjalanan beliau saat perang Tabuk, beliau menjamak dhuhur dan ashar, maghrib dan isya'. Saya bertanya; Apa yang menyebabkan beliau melakukannya. Ia menjawab; Agar tidak memberatkan ummat beliau."
            },
            {
                "number": 3178,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ عَنِ الْحَجَّاجِ يَعْنِي ابْنَ أَبِي عُثْمَانَ حَدَّثَنِي حُمَيْدُ بْنُ هِلَالٍ حَدَّثَنَا هِصَّانُ بْنُ الْكَاهِنِ الْعَدَوِيُّ قَالَ جَلَسْتُ مَجْلِسًا فِيهِ عَبْدُ الرَّحْمَنِ بْنُ سَمُرَةَ وَلَا أَعْرِفُهُ قَالَ ثَنَا مُعَاذُ بْنُ جَبَلٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا عَلَى الْأَرْضِ نَفْسٌ تَمُوتُ لَا تُشْرِكُ بِاللَّهِ شَيْئًا تَشْهَدُ أَنِّي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْجِعُ ذَاكُمْ إِلَى قَلْبٍ مُوقِنٍ إِلَّا غُفِرَ لَهَا قَالَ قُلْتُ أَنْتَ سَمِعْتَ هَذَا مِنْ مُعَاذِ بْنِ جَبَلٍ قَالَ فَعَنَّفَنِي الْقَوْمُ فَقَالَ دَعُوهُ فَإِنَّهُ لَمْ يُسِئْ الْقَوْلَ نَعَمْ أَنَا سَمِعْتُهُ مِنْ مُعَاذٍ زَعَمَ أَنَّهُ سَمِعَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَحَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ حَبِيبِ بْنِ الشَّهِيدِ عَنْ حُمَيْدِ بْنِ هِلَالٍ عَنْ هِصَّانَ بْنِ الْكَاهِنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ عَنْ مُعَاذٍ مِثْلَهُ نَحْوَ قَوْلِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu 'Adi] dari [Al Hajjaj bin Abu 'Utsman] telah menceritakan kepadaku [Humaid bin Hilal] telah menceritakan kepada kami [Hishshan bin Al Kahin Al 'Adawi], ia berkata; Saya duduk disuatu majlis disana ada ['Abdur Rahman bin Samurah] dan saya tidak mengetahuinya, ia berkata; Telah menceritakan kepada kami [Mu'adz bin Jabal], ia berkata; Rasulullah Shallallahu'alaihi wasallam bersabda: \"Tidaklah ada suatu jiwa diatas muka bumi yang meninggal dunia dengan tidak menyekutukan Allah dengan sesuatu pun dan bersaksi bahwa sesungguhnya aku adalah utusan Allah, dan semua itu kembali ke hati yang meyakini, melainkan ia akan diampuni.\" Saya berkata; Engkau mendengar hadits itu dari Mu'adz bin Jabal? Kemudian orang-orang memperlakukanku dengan sikap kasar Orang tua itu berkata; 'Biarkan dia karena ia tidak berkata buruk. Ya, saya mendengarnya dari Mu'adz bin Jabal, ia mengira mendengarnya dari Rasulullah Shallallahu'alaihi wasallam. Telah menceritakan kepada kami [Ibnu Abi 'Adi] dari [Habib bin Asy-Syahid] dari [Humaid bin Hilal] dari [Hishshan bin Al Kahin] dari ['Abdur Rahman bin Samurah] dari [Mu'adz] perkataan serupa."
            },
            {
                "number": 3179,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءِ بْنِ الْوَلِيدِ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ أَبِي إِدْرِيسَ الْعَبْدِيِّ أَوْ الْخَوْلَانِيِّ قَالَجَلَسْتُ مَجْلِسًا فِيهِ عِشْرُونَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِذَا فِيهِمْ شَابٌّ حَدِيثُ السِّنِّ حَسَنُ الْوَجْهِ أَدْعَجُ الْعَيْنَيْنِ أَغَرُّ الثَّنَايَا فَإِذَا اخْتَلَفُوا فِي شَيْءٍ فَقَالَ قَوْلًا انْتَهَوْا إِلَى قَوْلِهِ فَإِذَا هُوَ مُعَاذُ بْنُ جَبَلٍ فَلَمَّا كَانَ مِنْ الْغَدِ جِئْتُ فَإِذَا هُوَ يُصَلِّي إِلَى سَارِيَةٍ قَالَ فَحَذَفَ مِنْ صَلَاتِهِ ثُمَّ احْتَبَى فَسَكَتَ قَالَ فَقُلْتُ وَاللَّهِ إِنِّي لَأُحِبُّكَ مِنْ جَلَالِ اللَّهِ قَالَ أَاللَّهِ قَالَ قُلْتُ أَاللَّهِ قَالَ فَإِنَّ مِنْ الْمُتَحَابِّينَ فِي اللَّهِ فِيمَا أَحْسَبُ أَنَّهُ قَالَ فِي ظِلِّ اللَّهِ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّهُ ثُمَّ لَيْسَ فِي بَقِيَّتِهِ شَكٌّ يَعْنِي فِي بَقِيَّةِ الْحَدِيثِ يُوضَعُ لَهُمْ كَرَاسٍ مِنْ نُورٍ يَغْبِطُهُمْ بِمَجْلِسِهِمْ مِنْ الرَّبِّ عَزَّ وَجَلَّ النَّبِيُّونَ وَالصِّدِّيقُونَ وَالشُّهَدَاءُ قَالَ فَحَدَّثْتُهُ عُبَادَةَ بْنَ الصَّامِتِ فَقَالَ لَا أُحَدِّثُكَ إِلَّا مَا سَمِعْتُ عَنْ لِسَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَقَّتْ مَحَبَّتِي لِلْمُتَحَابِّينَ فِيَّ وَحَقَّتْ لِلْمُتَبَاذِلِينَ فِيَّ وَحَقَّتْ مَحَبَّتِي لِلْمُتَصَادِقِينَ فِيَّ وَالْمُتَوَاصِلِينَ شَكَّ شُعْبَةُ فِي الْمُتَوَاصِلِينَ أَوْ الْمُتَزَاوِرِينَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin 'Atho` bin Al Walid bin Abu 'Abdur Rahman] dari [Abu Idris Al 'Abdi atau Al Khoulani], ia berkata; Saya duduk disuatu majlis, disana ada duapuluh sahabat Nabi Shallallahu'alaihi wasallam, ditengah-tengah mereka ada pemuda, berusia muda, elok rupanya, hitam matanya, putih giginya. Bila mereka berbeda pendapat tentang suatu hal, ia mengatakan kata-kata pamungkas. Ternyata ia adalah [Mu'adz bin Jabal]. Keesokan harinya saya datang dan ia tengah sholat menghadap seseorang yang berjalan. Mu'adz menghentikan sholat lalu duduk memeluk lutut kemudian diam. Kemudian saya berkata; 'Demi Allah, aku mencintaimu karena keagungan Allah. Ia berkata; Allah. Saya berkata; Engkau mengucapkan; Allah. Ia berkata; Karena orang-orang yang saling mencintai karena Allah -menurut saya ia berkata- maka ia berada didalam naungan Allah pada saat tidak ada naungan selain naungan-Nya. Selanjutnya tidak ada keraguan pada kelanjutannya -maksudnya kelanjutan hadits- Kursi-kursi dari cahaya diletakkan untuk mereka, pertemuan mereka dengan Allah membuat iri para nabi, orang-orang jujur dan para syuhada. Ia berkata; Kemudian saya menceritakannya kepada ['Ubadah bin Ash Shamit], ia berkata; Aku tidak menceritakan kepadamu selain yang telah aku dengar dari lisan Rasulullah Shallallahu'alaihi wasallam'; \"Wajiblah cintaKu untuk orang-orang yang saling mencintai karena Aku, bagi orang-orang yang berkorban karena Aku, bagi orang-orang yang saling berteman dan menyambung sillalurrahim -Syu'bah ragu tentang orang-orang yang menyambung sillaturrahim ataukah orang-orang yang saling mengunjungi.\""
            },
            {
                "number": 3180,
                "arab": "حَدَّثَنَا مُوسَى بْنُ دَاوُدَ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنْ أَيْمَنَ عَنْ أَبِي أُمَامَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طُوبَى لِمَنْ رَآنِي وَآمَنَ بِي وَطُوبَى لِمَنْ آمَنَ بِي وَلَمْ يَرَنِي سَبْعَ مِرَارٍحَدَّثَنَا هُدْبَةُ بْنُ خَالِدٍ حَدَّثَنَا هَمَّامُ بَنُ يَحْيَى وَحَمَّادُ بْنُ الْجَعْدِ عَنْ قَتَادَةَ عَنْ أَيْمَنَ عَنْ أَبِي أُمَامَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ أَوْ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Musa bin Dawud] telah menceritakan kepada kami [Hammam] dari [Qotadah] dari [Aiman] dari [Abu Umamah] berkata; Rasulullah Shallallahu'alaihiWasallam bersabda; \"Beruntunglah orang yang melihatku dan beriman padaku, beruntunglah orang yang beriman padaku namun tidak melihatku.\" Beliau mengucapkannya tujuh kali. Telah menceritakan kepada kami [Hudbah bin Kholid] telah menceritakan kepada kami [Hammam bin Yahya] dan [Hammad bin Al Ja'ad] dari [Qotadah] dari [Aiman] dari [Abu Umamah] dari Nabi Shallallahu'alaihiWasallam sepertinya."
            },
            {
                "number": 3181,
                "arab": "حَدَّثَنَا رَوْحٌ عَنْ هِشَامٍ عَنْ وَاصِلٍ مَوْلَى أَبِي عُيَيْنَةَ عَنْ مُحَمَّدِ بْنِ أَبِي يَعْقُوبَ عَنْ رَجَاءِ بْنِ حَيْوَةَ عَنْ أَبِي أُمَامَةَ قَالَأَنْشَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزْوَةً فَأَتَيْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ لِي بِالشَّهَادَةِ فَقَالَ اللَّهُمَّ سَلِّمْهُمْ وَغَنِّمْهُمْ قَالَ فَسَلِمْنَا وَغَنِمْنَا قَالَ ثُمَّ أَنْشَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزْوًا ثَانِيًا فَأَتَيْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ لِي بِالشَّهَادَةِ فَقَالَ اللَّهُمَّ سَلِّمْهُمْ وَغَنِّمْهُمْ قَالَ ثُمَّ أَنْشَأَ غَزْوًا ثَالِثًا فَأَتَيْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أَتَيْتُكَ مَرَّتَيْنِ قَبْلَ مَرَّتِي هَذِهِ فَسَأَلْتُكَ أَنْ تَدْعُوَ اللَّهَ لِي بِالشَّهَادَةِ فَدَعَوْتَ اللَّهَ عَزَّ وَجَلَّ أَنْ يُسَلِّمَنَا وَيُغَنِّمَنَا فَسَلِمْنَا وَغَنِمْنَا يَا رَسُولَ اللَّهِ فَادْعُ اللَّهَ لِي بِالشَّهَادَةِ فَقَالَ اللَّهُمَّ سَلِّمْهُمْ وَغَنِّمْهُمْ قَالَ فَسَلِمْنَا وَغَنِمْنَا ثُمَّ أَتَيْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ مُرْنِي بِعَمَلٍ قَالَ عَلَيْكَ بِالصَّوْمِ فَإِنَّهُ لَا مِثْلَ لَهُ قَالَ فَمَا رُئِيَ أَبُو أُمَامَةَ وَلَا امْرَأَتُهُ وَلَا خَادِمُهُ إِلَّا صُيَّامًا قَالَ فَكَانَ إِذَا رُئِيَ فِي دَارِهِمْ دُخَانٌ بِالنَّهَارِ قِيلَ اعْتَرَاهُمْ ضَيْفٌ نَزَلَ بِهِمْ نَازِلٌ قَالَ فَلَبِثَ بِذَلِكَ مَا شَاءَ اللَّهُ ثُمَّ أَتَيْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ أَمَرْتَنَا بِالصِّيَامِ فَأَرْجُو أَنْ يَكُونَ قَدْ بَارَكَ اللَّهُ لَنَا فِيهِ يَا رَسُولَ اللَّهِ فَمُرْنِي بِعَمَلٍ آخَرَ قَالَ اعْلَمْ أَنَّكَ لَنْ تَسْجُدَ لِلَّهِ سَجْدَةً إِلَّا رَفَعَ اللَّهُ لَكَ بِهَا دَرَجَةً وَحَطَّ عَنْكَ بِهَا خَطِيئَةًحَدَّثَنَا رَوْحٌ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي يَعْقُوبَ عَنْ رَجَاءِ بْنِ حَيْوَةَ عَنْ أَبِي أُمَامَةَ قَالَ أَنْشَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَزْوًا فَأَتَيْتُهُ فَذَكَرَ مَعْنَاهُ إِلَّا أَنَّهُ قَالَ مُرْنِي بِعَمَلٍ آخُذُهُ عَنْكَ يَنْفَعُنِي اللَّهُ بِهِ قَالَ عَلَيْكَ بِالصَّوْمِ حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا فِطْرُ بْنُ حَمَّادِ بْنِ وَاقِدٍ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ عَنِ رَجَاءِ بْنِ حَيْوَةَ عَنْ أَبِي أُمَامَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ أَوْ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Rouh] dari [Hisyam] dari [Washil, budak Abu 'Uyainah] dari [Muhammad bin Abu Ya'qub] dari [Raja` bin Haiwah] dari [Abu Umamah] berkata; 'Rasulullah Shallallahu'alaihiWasallam mengadakan peperangan, saya mendatangi beliau dan saya berkata; Wahai Rasulullah! Berdo'alah kepada Allah untuk saya agar mati syahid. Rasulullah Shallallahu'alaihiWasallam bersabda; \"Ya Allah! Berilah mereka keselamatan dan harta rampasan perang.\" Berkata Abu Umamah; Kami menang dan mendapatkan harta rampasan perang. Kemudian Rasulullah Shallallahu'alaihiWasallam mengadakan perang selanjutnya, saya mendatangi beliau lalu berkata; Wahai Rasulullah! Berdo'alah pada Allah untuk saya agar saya mati syahid. Rasulullah Shallallahu'alaihiWasallam bersabda; \"Ya Allah! Berilah mereka keselamatan dan harta rampasan perang.\" Berkata Abu Umamah; Kami menang dan mendapatkan harta rampasan perang. Kemudian Rasulullah Shallallahu'alaihiWasallam mengadakan perang selanjutnya, lalu saya berkata; wahai Rasulullah! aku mendatangi baginda dua kali sebelumnya, aku meminta baginda berdo'a untuk saya agar saya mati syahid lalu baginda berdo'a; \"Ya Allah! Berilah mereka keselamatan dan harta rampasan perang.\" Kami pun menang dan mendapatkan harta rampasan perang. Berkata Abu Umamah kemudian saya mendatangi beliau dan berkata; Wahai Rasulullah! Perintahkanlah aku untuk melakukan suatu amalan. Rasulullah Shallallahu'alaihiWasallam bersabda; \"Berpuasalah karena tidak ada amalan lain sepertinya.\" Semenjak itu Abu Umamah, istri dan pembantunya tidak pernah terlihat melainkan gemar puasa. Bila di siang hari ada asap dirumahnya, ada yang berkata; Ada tamu yang datang atau mereka ada keperluan. Hal itu terus berlangsung sampai waktu yang dikehendaki Allah subhanahu wata'ala kemudian aku (Abu Umamah) mendatangi Rasulullah Shallallahu'alaihiWasallam dan berkata; Wahai Rasulullah! baginda memerintahkanku untuk berpuasa, saya harap Allah memberkahi kami. Wahai Rasulullah! Perintahkanlah kami untuk melakukan amalan lain. Rasulullah Shallallahu'alaihiWasallam bersabda; \"Ketahuilah! Tidaklah engkau sujud karena Allah satu kali melainkan Allah akan mengangkat satu derajat karenanya dan menghapus satu kesalahan karenanya.\" Telah menceritakan kepada kami [Rouh] telah menceritakan kepada kami [Mahdi bin Maimun] telah menceritakan kepada kami [Muhammad bin Abu Ya'qub] dari [Roja` bin Haiwah] dari [Abu Umamah] berkata; Rasulullah Shallallahu'alaihiWasallam mengadakan peperangan kemudian saya mendatangi beliau. Ia menyebutkan makna hadits hanya saja ia berkata; Perintahkanlah aku untuk melakukan suatu amalan yang saya ambil darimu yang dengannya Allah memanfaatkanku. Rasulullah Shallallahu'alaihiWasallam bersabda; \"Berpuasalah.\" Telah menceritakan kepada kami 'Abdullah, telah menceritakan kepada kami [Fithr bin Hammad bin Waqid] telah menceritakan kepada kami [Mahdi bin Maimun] dari [Muhammad bin 'Abdullah bin Abu Ya'qub] dari [Roja` bin Haiwah] dari [Abu Umamah] dari Nabi Shallallahu'alaihiWasallam sepertinya."
            },
            {
                "number": 3182,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا فِطْرُ بْنُ حَمَّادٍ حَدَّثَنَا أَبِي قَالَ سَمِعْتُ مَالِكَ بْنَ دِينَارٍ يَقُولُيَقُولُ النَّاسُ مَالِكُ بْنُ دِينَارٍ يَعْنِي مَالِكَ بْنَ دِينَارٍ زَاهِدٌ إِنَّمَا الزَّاهِدُ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ الَّذِي أَتَتْهُ الدُّنْيَا فَتَرَكَهَا",
                "id": "Telah menceritakan kepada kami 'Abdullah telah menceritakan kepada kami [Fithr bin Hammad] telah menceritakan kepada kami [ayahku] berkata; Saya mendengar [Malik bin Dinar] berkata; Orang-orang berkata bahwa Malik bin Dinar orang zuhud, sesungguhnya orang yang zuhud hanyalah 'Umar bin 'Abdul 'Azzi, yang dunia datang kepadanya tapi justru ia meninggalkannya."
            },
            {
                "number": 3183,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا حَمَّادٌ عَنِ الْجُرَيْرِيِّ عَنْ أَبِي الْمَشَّاءِ وَهُوَ لَقِيطُ بْنُ الْمَشَّاءِ عَنْ أَبِي أُمَامَةَ قَالَلَا تَقُومُ السَّاعَةُ حَتَّى يَتَحَوَّلَ خِيَارُ أَهْلِ الْعِرَاقِ إِلَى الشَّامِ وَيَتَحَوَّلَ شِرَارُ أَهْلِ الشَّامِ إِلَى الْعِرَاقِ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْكُمْ بِالشَّامِقَالَ أَبُو عَبْد الرَّحْمَنِ أَبُو الْمُثَنَّى يُقَالُ لَهُ لَقِيطٌ وَيَقُولُونَ ابْنُ الْمُثَنَّى وَأَبُو الْمُثَنَّى",
                "id": "Telah menceritakan kepada kami ['Abdush Shomad] telah menceritakan kepada kami [Hammad] dari [Al Jurairi] dari [Abu Al Masysya`, anak pungutan Ibnu Al Masysya`] dari [Abu Umamah] berkata; Kiamat tidaklah terjadi hingga penduduk Irak yang terbaik pindah ke Syam dan penduduk jahat Syam pindah ke Irak. Rasulullah Shallallahu'alaihiWasallam bersabda; \"Hendaklah kalian ke Syam.\" Berkata Abu 'Abdur Rahman; Abu Al Mutsanna, disebut-sebut sebagai anak pungutan mereka berkata Ibnu Al Mutsanna dan Abu Al Mutsanna."
            },
            {
                "number": 3184,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو حَدَّثَنَا هِشَامٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ زَيْدٍ عَنْ أَبِي سَلَّامٍ عَنْ أَبِي أُمَامَةَ حَدَّثَهُ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اقْرَءُوا الْقُرْآنَ فَإِنَّهُ شَافِعٌ لِأَصْحَابِهِ يَوْمَ الْقِيَامَةِ اقْرَءُوا الزَّهْرَاوَيْنِ الْبَقَرَةَ وَآلَ عِمْرَانَ فَإِنَّهُمَا يَأْتِيَانِ يَوْمَ الْقِيَامَةِ كَأَنَّهُمَا غَمَامَتَانِ أَوْ كَأَنَّهُمَا غَيَايَتَانِ أَوْ كَأَنَّهُمَا فِرْقَانِ مِنْ طَيْرٍ صَوَافَّ يُحَاجَّانِ عَنْ أَهْلِهِمَا ثُمَّ قَالَ اقْرَءُوا الْبَقَرَةَ فَإِنَّ أَخْذَهَا بَرَكَةٌ وَتَرْكَهَا حَسْرَةٌ وَلَا يَسْتَطِيعُهَا الْبَطَلَةُحَدَّثَنَا عَفَّانُ حَدَّثَنَا أَبَانُ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ زَيْدٍ عَنْ أَبِي سَلَّامٍ عَنْ أَبِي أُمَامَةَ أَنَّ رَسُولَ اللَّهِ قَالَ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami ['Abdul Malik bin 'Amr] telah menceritakan kepada kami [Hisyam] dari [Yahya bin Abu Katsir] dari [Zaid] dari [Abu Sallam] dari [Abu Umamah] telah menceritakan padanya, ia berkata; Saya mendengar Rasulullah Shallallahu'alaihiWasallam bersabda; \"Bacalah al-qur'an karena ia memberi syafaat pada para pembacanya pada hari kiamat, bacalah zahrawain; Albaqarah dan Ali 'Imran, karena keduanya datang pada hari kiamat seperti dua awan, naungan atau seperti dua kumpulan burung yang berjajar berhujjah untuk membela para pemiliknya.\" Selanjutnya Rasulullah Shallallahu'alaihiWasallam bersabda; \"Bacalah Albaqarah karena mengambilnya berkah dan meninggalkannya rugi dan tidak bisa dikalahkan oleh tukang-tukang sihir.\" Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Aban], telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Zaid] dari [Abu Sallam] dari [Abu Umamah] bahwa Rasulullah Shallallahu'alaihiWasallam bersabda; ia (Abu Umamah) menyebutkan hadits serupa."
            },
            {
                "number": 3185,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي يَعْقُوبَ الضَّبِّيُّ قَالَ سَمِعْتُ أَبَا نَصْرٍ يُحَدِّثُ عَنْ رَجَاءِ بْنِ حَيْوَةَ عَنْ أَبِي أُمَامَةَ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ مُرْنِي بِعَمَلٍ يُدْخِلُنِي الْجَنَّةَ قَالَ عَلَيْكَ بِالصَّوْمِ فَإِنَّهُ لَا عِدْلَ لَهُ ثُمَّ أَتَيْتُهُ الثَّانِيَةَ فَقَالَ عَلَيْكَ بِالصِّيَامِ",
                "id": "Telah menceritakan kepada kami ['Abdush Shomad] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Muhammad bin Abu Ya'qub Adh Dhoby] berkata; Saya mendengar [Abu Nashr] menceritakan dari [Roja` bin Haiwah] dari [Abu Umamah] berkata; Saya mendatangi Rasulullah Shallallahu'alaihiWasallam, kemudian saya berkata; Perintahkanlah aku suatu amalan yang bisa memasukkanku ke surga. Rasulullah Shallallahu'alaihiWasallam bersabda; \"Berpuasalah karena ia tidak ada tandingannya.\" Kemudian saya mendatangi beliau lagi, beliau bersabda; \"Berpuasalah.\""
            },
            {
                "number": 3186,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَحِيرٍ حَدَّثَنَا سَيَّارٌ أَنَّ أَبَا أُمَامَةَ ذَكَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَكُونُ فِي هَذِهِ الْأُمَّةِ فِي آخِرِ الزَّمَانِ رِجَالٌ أَوْ قَالَ يَخْرُجُ رِجَالٌ مِنْ هَذِهِ الْأُمَّةِ فِي آخِرِ الزَّمَانِ مَعَهُمْ أَسْيَاطٌ كَأَنَّهَا أَذْنَابُ الْبَقَرِ يَغْدُونَ فِي سَخَطِ اللَّهِ وَيَرُوحُونَ فِي غَضَبِهِ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id] telah menceritakan kepada kami ['Abdullah bin Bahir] telah menceritakan kepada kami [Sayyar] bahwa [Abu Umamah] menyebutkan bahwa Rasulullah Shallallahu'alaihiWasallam bersabda; \"Di akhir zaman di ummat ini ada beberapa orang -atau beliau bersabda; \"Akan muncul beberapa orang dari ummat ini diakhir zaman\"- membawa cambuk seperti ekor sapi, dipagi hari mereka berada didalam kemurkaan Allah dan disore hari mereka berada di dalam kemarahan Allah.\""
            },
            {
                "number": 3187,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَحِيرٍ حَدَّثَنَا سَيَّارٌ قَالَجِيءَ بِرُءُوسٍ مِنْ قِبَلِ الْعِرَاقِ فَنُصِبَتْ عِنْدَ بَابِ الْمَسْجِدِ وَجَاءَ أَبُو أُمَامَةَ فَدَخَلَ الْمَسْجِدَ فَرَكَعَ رَكْعَتَيْنِ ثُمَّ خَرَجَ إِلَيْهِمْ فَنَظَرَ إِلَيْهِمْ فَرَفَعَ رَأْسَهُ فَقَالَ شَرُّ قَتْلَى تَحْتَ ظِلِّ السَّمَاءِ ثَلَاثًا وَخَيْرُ قَتْلَى تَحْتَ ظِلِّ السَّمَاءِ مَنْ قَتَلُوهُ وَقَالَ كِلَابُ النَّارِ ثَلَاثًا ثُمَّ إِنَّهُ بَكَى ثُمَّ انْصَرَفَ عَنْهُمْ فَقَالَ لَهُ قَائِلٌ يَا أَبَا أُمَامَةَ أَرَأَيْتَ هَذَا الْحَدِيثَ حَيْثُ قُلْتَ كِلَابُ النَّارِ شَيْءٌ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ شَيْءٌ تَقُولُهُ بِرَأْيِكَ قَالَ سُبْحَانَ اللَّهِ إِنِّي إِذًا لَجَرِيءٌ لَوْ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّةً أَوْ مَرَّتَيْنِ حَتَّى ذَكَرَ سَبْعًا لَخِلْتُ أَنْ لَا أَذْكُرَهُ فَقَالَ الرَّجُلُ لِأَيِّ شَيْءٍ بَكَيْتَ قَالَ رَحْمَةً لَهُمْ أَوْ مِنْ رَحْمَتِهِمْ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id] telah menceritakan kepada kami ['Abdullah bin Bahir] telah menceritakan kepada kami [Sayyar] berkata; Beberapa kepala didatangkan dari Irak kemudian dipasang didekat pintu masjid. [Abu Umamah] datang lalu masuk masjid, ia sholat dua rakaat kemudian keluar dan melihat kepala-kepala itu, ia mengangkat kepala dan berkata; Korban-korban terburuk yang ada dibawah naungan langit. Ia mengucapkannya tiga kali. Kemudian ia berkata; Dan sebaik-baik korban yang ada dibawah naungan langit adalah orang-orang yang mereka bunuh. Ia berkata; Anjing-anjing neraka, sebanyak tiga kali. Ia menangis lalu pergi meninggalkan kepala-kepala itu. Ada yang berkata padanya; Hai Abu Umamah, apa kau mengetahui suatu hadits yang kau dengar dari Rasulullah Shallallahu'alaihiWasallam saat kau katakan; Anjing-anjing neraka, ataukah hanya kau katakan berdasarkan pendapatmu sendiri? Ia berkata; Subhanallah! Kalau begitu aku gegabah, andai aku mendengarnya dari Rasulullah Shallallahu'alaihiWasallam sekali, dua kali hingga tujuh kali kemudian tidak aku sebutkan dari Nabi. Seseorang berkata; Kenapa kau menangis? Ia berkata; Sebagai kasih sayang untuk mereka atau karena menyayangi mereka."
            },
            {
                "number": 3188,
                "arab": "حَدَّثَنَا أَبُو إِسْحَاقَ الطَّالَقَانِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ يَحْيَى بْنِ أَيُّوبَ عَنْ عُبَيْدِ اللَّهِ بْنِ زَحْرٍ عَنْ عَلِيِّ بْنِ يَزِيدَ عَنِ الْقَاسِمِ عَنْ أَبِي أُمَامَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ مَسَحَ رَأْسَ يَتِيمٍ لَمْ يَمْسَحْهُ إِلَّا لِلَّهِ كَانَ لَهُ بِكُلِّ شَعْرَةٍ مَرَّتْ عَلَيْهَا يَدُهُ حَسَنَاتٌ وَمَنْ أَحْسَنَ إِلَى يَتِيمَةٍ أَوْ يَتِيمٍ عِنْدَهُ كُنْتُ أَنَا وَهُوَ فِي الْجَنَّةِ كَهَاتَيْنِ وَفَرَّقَ بَيْنَ أُصْبُعَيْهِ السَّبَّابَةِ وَالْوُسْطَى",
                "id": "Telah menceritakan kepada kami [Abu Ishak Ath Tholaqoni] telah menceritakan kepada kami ['Abdullah bin Al Mubarok] dari [Yahya bin Ayyub] dari ['Ubaidillah bin Zahr] dari ['Ali bin Yazid] dari [Al Qosim] dari [Abu Umamah] bahwa Rasulullah Shallallahu'alaihiWasallam bersabda; \"Barangsiapa mengusap kepala seorang anak yatim, dengan tidak ada dorongan mengusapnya kecuali karena Allah, ia mendapatkan beberapa kebaikan untuk setiap rambut yang dilalui tangannya. Barangsiapa berbuat baik kepada anak yatim perempuan atau yatim lelaki didekatnya, aku dan dia di surga seperti dua ini.\" Beliau memisahkan antara jari telunjuk dan jari tengah."
            },
            {
                "number": 3189,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى وَعَفَّانُ قَالَا حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ عَفَّانُ أَخْبَرَنَا أَبُو غَالِبٍ عَنْ أَبِي أُمَامَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْبَلَ مِنْ خَيْبَرَ وَمَعَهُ غُلَامَانِ وَهَبَ أَحَدَهُمَا لِعَلِيِّ بْنِ أَبِي طَالِبٍ وَقَالَ لَا تَضْرِبْهُ فَإِنِّي قَدْ نَهَيْتُ عَنْ ضَرْبِ أَهْلِ الصَّلَاةِ وَقَدْ رَأَيْتُهُ يُصَلِّي قَالَ عَفَّانُ فِي حَدِيثِهِ أَخْبَرَنَا أَبُو طَالِبٍ عَنْ أَبِي أُمَامَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْبَلَ مِنْ خَيْبَرَ وَمَعَهُ غُلَامَانِ فَقَالَ عَلِيٌّ يَا رَسُولَ اللَّهِ أَخْدِمْنَا قَالَ خُذْ أَيَّهُمَا شِئْتَ قَالَ خِرْ لِي قَالَ خُذْ هَذَا وَلَا تَضْرِبْهُ فَإِنِّي قَدْ رَأَيْتُهُ يُصَلِّي مَقْبَلَنَا مِنْ خَيْبَرَ وَإِنِّي قَدْ نَهَيْتُ وَأَعْطَى أَبَا ذَرٍّ غُلَامًا وَقَالَ اسْتَوْصِ بِهِ مَعْرُوفًا فَأَعْتَقَهُ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا فَعَلَ الْغُلَامُ قَالَ يَا رَسُولَ اللَّهِ أَمَرْتَنِي أَنْ أَسْتَوْصِيَ بِهِ مَعْرُوفًا فَأَعْتَقْتُهُ",
                "id": "Telah menceritakan kepada kami [Hasan bin Musa] dan ['Affan] keduanya berkata; Telah menceritakan kepada kami [Hammad bin Salamah]. Berkata 'Affan; Telah mengabarkan kepada kami [Abu Ghalib] dari [Abu Umamah] bahwa Rasulullah Shallallahu'alaihiWasallam kembali dari Khaibar bersama dua budak, salah satunya milik 'Ali bin Abi Tholib, beliau bersabda; \"Jangan pukul dia karena aku melarang memukul orang yang mendirikan sholat dan aku pernah melihatnya sholat.\" Berkata 'Affan dalam haditsnya; Telah mengabarkan kepada kami Abu Tholib dari Abu Umamah bahwa Nabi Shallallahu'alaihiWasallam kembali dari Khaibar bersama dua budak lalu 'Ali berkata; Wahai Rasulullah! Layanilah kami. Rasulullah Shallallahu'alaihiWasallam bersabda; \"Ambillah salah satu dari keduanya yang kau mau. 'Ali berkata; Pilihkan untukku. Rasulullah Shallallahu'alaihiWasallam bersabda; \"Ambillah ini dan jangan pukul dia karena aku pernah melihatnya sholat saat kami pulang dari Khaibar dan aku melarang.\" Beliau memberi Abu Dzarr seorang budak dan bersabda; \"Wasiatkan kebaikan padanya.\" Abu Dzarr memerdekakannya kemudian Nabi Shallallahu'alaihiWasallam bersabda padanya; \"Bagaimana khabar budak itu?\" ia berkata; Wahai Rasulullah! baginda memerintahkanku untuk mempergaulinya dengan baik, maka aku memerdekakannya."
            },
            {
                "number": 3190,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى قَالَ أَخْبَرَنِي مَالِكٌ عَنِ الْعَلَاءِ عَنْ مَعْبَدِ بْنِ كَعْبٍ السَّلَمِيِّ عَنْ أَخِيهِ عَبْدِ اللَّهِ بْنِ كَعْبٍ عَنْ أَبِي أُمَامَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اقْتَطَعَ حَقَّ امْرِئٍ مُسْلِمٍ بِيَمِينِهِ فَقَدْ أَوْجَبَ اللَّهُ لَهُ النَّارَ وَحَرَّمَ عَلَيْهِ الْجَنَّةَ فَقَالَ لَهُ رَجُلٌ وَإِنْ كَانَ شَيْئًا يَسِيرًا يَا رَسُولَ اللَّهِ قَالَ وَإِنْ كَانَ قَضِيبًا مِنْ أَرَاكٍ",
                "id": "Telah bercerita kepada kami [Ishaq bin 'Isa] berkata; Telah mengkhabarkan kepadaku [Malik] dari [Al 'Alaa] dari [Ma'bad bin Ka'ab As Salami] dari saudaranya ['Abdullah bin Ka'ab] dari [Abu Umamah] bahwa Rasulullah Shallallahu'alaihiWasallam bersabda; \"Barangsiapa merampas hak seorang muslim dengan sumpahnya maka dengannya Allah mewajibkan neraka dan mengharamkan surga baginya. Seseorang berkata pada beliau; Meski hal sepele wahai Rasulullah! Rasulullah Shallallahu'alaihiWasallam bersabda; \"Meski sepotong dahan arok.\""
            },
            {
                "number": 3191,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ زُهَيْرٍ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ صَالِحٍ يَعْنِي ابْنَ كَيْسَانَ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي أُمَامَةَ الْحَارِثِيِّ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبَذَاذَةُ مِنْ الْإِيمَانِ",
                "id": "Telah bercerita kepada kami ['Abdur Rahman bin Mahdi] dari [Zuhair bin Muhammad] dari [Shalih bin Kaisan] dari ['Abdullah bin Abu Umamah Al Haritsi] dari [ayahnya] berkata; Rasulullah Shallallahu'alaihiWasallam bersabda; \"Kesederhanaan adalah bagian dari iman.\""
            },
            {
                "number": 3192,
                "arab": "حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِي عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا حَيْوَةُ حَدَّثَنَا أَبُو صَخْرٍ أَنَّهُ سَمِعَ مَكْحُولًا يَقُولُ حَدَّثَنِي أَبُو هِنْدٍ الدَّارِيُّ أَنَّهُسَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ قَامَ مَقَامَ رِيَاءٍ وَسُمْعَةٍ رَايَا اللَّهُ تَعَالَى بِهِ يَوْمَ الْقِيَامَةِ وَسَمَّعَ",
                "id": "Telah bercerita kepada kami [Abu 'Abdur Rahman Al Muqri 'Abdullah bin Yazid] telah bercerita kepada kami [Haiwah] telah bercerita kepada kami [Abu Shakhr] bahwa ia mendengar [Makhul] berkata; Telah bercerita kepadaku [Abu Hind Ad Daari] bahwa ia mendengar Rasulullah Shallallahu'alaihiWasallam bersabda; \"Barangsiapa berdiri ditempat riya' dan sum'ah, Allah akan memperlihatkan dan menyiarkan aibnya pada hari kiamat.\""
            },
            {
                "number": 3193,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ حَدَّثَنَا أَبُو بَكْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَيُفْتَحُ عَلَيْكُمْ الشَّامُ وَإِنَّ بِهَا مَكَانًا يُقَالُ لَهُ الْغُوطَةُ يَعْنِي دِمَشْقَ مِنْ خَيْرِ مَنَازِلِ الْمُسْلِمِينَ يَعْنِي فِي الْمَلَاحِمِ",
                "id": "Telah bercerita kepada kami [Muhammad bin Mush'ab] telah bercerita kepada kami [Abu Bakr] dari ['Abdur Rahman bin Jubair] dari [ayahnya] dari [seorang sahabat Nabi Shallallahu'alaihiWasallam] dari Nabi Shallallahu'alaihiWasallam bersabda; \"Syam akan ditaklukkan untuk kalian, disana ada sebuah tempat bernama Ghouthoh -yaitu Damaskus- salah satu tempat kaum muslimin terbaik.\" Yaitu dalam peperangan."
            },
            {
                "number": 3194,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ عَنْ عَطَاءٍ الْخُرَاسَانِيِّ حَدَّثَنِي ابْنُ مُحَيْرِيزٍ عَنْ عَبْدِ اللَّهِ بْنِ السَّعْدِيِّ رَجُلٍ مِنْ بَنِي مَالِكِ بْنِ حَنْبَلٍأَنَّهُ قَدِمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نَاسٍ مِنْ أَصْحَابِهِ فَقَالُوا لَهُ احْفَظْ رِحَالَنَا ثُمَّ تَدْخُلُ وَكَانَ أَصْغَرَ الْقَوْمِ فَقَضَى لَهُمْ حَاجَتَهُمْ ثُمَّ قَالُوا لَهُ ادْخُلْ فَدَخَلَ فَقَالَ حَاجَتُكَ قَالَ حَاجَتِي تُحَدِّثُنِي أَنْقَضَتْ الْهِجْرَةُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَاجَتُكَ خَيْرٌ مِنْ حَوَائِجِهِمْ لَا تَنْقَطِعُ الْهِجْرَةُ مَا قُوتِلَ الْعَدُوُّ",
                "id": "Telah bercerita kepada kami [Ishaq bin 'Isa] telah bercerita kepada kami [Yahya bin Hamzah] dari ['Atho` Al Khurasani] telah bercerita kepadaku [Ibnu Muhairiz] dari ['Abdullah bin As Sa'di] salah seorang Bani Malik bin Hambal, bahwa ia mendatangi Nabi Shallallahu'alaihiWasallam saat bersama beberapa sahabat, mereka berkata padanya; Jagalah perjalanan kita kemudian masuklah. Ia adalah yang paling muda lalu ia memebereskan keperluan mereka, lalu mereka berkata padanya; Masuklah. Ia pun masuk. Setelah masuk nabi Shallallahu 'alaihi wa Salam bertanya; Apa keperluanmu?. Abdullah menjawab; \"Keperluanku, tolong baginda berkomentar kepadaku, apakah hijrah telah berakhir?.' Lalu Rasulullah Shallallahu'alaihiWasallam bersabda; \"Keperluanmu lebih baik dari keperluan mereka, hijrah tidak berakhir selama musuh masih diperangi.\""
            },
            {
                "number": 3195,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي مَسْعُودٍ عَنْ أَبِي السَّلِيلِ عَنْ عَجُوزٍ مِنْ بَنِي نُمَيْرٍ أَنَّهَاسَمِعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي بِالنَّاسِ وَوَجْهُهُ إِلَى الْبَيْتِ قَالَ فَحَفِظَتْ مِنْهُ رَبِّ اغْفِرْ لِي خَطَايَايَ وَجَهْلِي",
                "id": "Telah bercerita kepada kami [Muhammad bin Ja'far] telah bercerita kepada kami [Syu'bah] dari [Abu Mas'ud] dari [Abu As Salil] dari [seorang wanita tua dari Bani Numair] ia mendengar Nabi Shallallahu'alaihiWasallam saat beliau sholat bersama orang-orang dan wajah beliau menghadap ke baitullah, aku menghafal dari beliau; Ya Allah! Ampunilah kesalahan-kesalahan dan kejahilanku."
            },
            {
                "number": 3196,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ أَبِي فُدَيْكٍ حَدَّثَنَا الضَّحَّاكُ بْنُ عَبْدِ اللَّهِ عَمَّنْ حَدَّثَهُ عَنْ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ كَعْبٍ عَنِ الْمَرْأَةِ مِنَ الْمُبَايِعَاتِ أَنَّهَا قَالَتْجَاءَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ أَصْحَابُهُ فِي بَنِي سَلِمَةَ فَقَرَّبْنَا إِلَيْهِ طَعَامًا فَأَكَلَ وَمَعَهُ أَصْحَابُهُ ثُمَّ قَرَّبْنَا إِلَيْهِ وَضُوءًا فَتَوَضَّأَ ثُمَّ أَقْبَلَ عَلَى أَصْحَابِهِ فَقَالَ أَلَا أُخْبِرُكُمْ بِمُكَفِّرَاتِ الْخَطَايَا قَالُوا بَلَى قَالَ إِسْبَاغُ الْوُضُوءِ عَلَى الْمَكَارِهِ وَكَثْرَةُ الْخُطَى إِلَى الْمَسَاجِدِ وَانْتِظَارُ الصَّلَاةِ بَعْدَ الصَّلَاةِ",
                "id": "Telah bercerita kepada kami [Muhammad bin Isma'il bin Abu Fudaik] telah bercerita kepada kami [Adh Dhahhak bin 'Abdullah] dari [orang yang bercerita padanya] dari ['Amr bin 'Abdullah bin Ka'ab] dari [seorang wanita] yang pernah berbaiat, ia berkata; Rasulullah Shallallahu'alaihiWasallam mendatangi kami bersama para sahabat beliau dari Bani Salamah, kami menyuguhkan makanan pada beliau, beliau makan bersama para sahabat beliau, kami menyuguhkan air wudhu, beliau berwudhu kemudian menghadap ke para sahabat lalu bersabda; \"Maukah kalian aku beritahu penghapus-penghapus kesalahan?\" mereka menjawab; Ya. Rasulullah Shallallahu'alaihiWasallam bersabda; \"Menyempurnakan wudhu saat-saat tidak menyenangkan, memperbanyak langkah ke masjid dan menunggu sholat setelah sholat.\" "
            },
            {
                "number": 3197,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ عَنْ أُمِّهِأَنَّهَا شَهِدَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ جَمْرَةِ الْعَقَبَةِ وَالنَّاسُ يَرْمُونَ فَقَالَ يَا أَيُّهَا النَّاسُ لَا تَقْتُلُوا أَوْ لَا تُهْلِكُوا أَنْفُسَكُمْ وَارْمُوا الْجَمْرَةَ أَوْ الْجَمَرَاتِ بِمِثْلِ حَصَى الْخَذْفِوَأَشَارَ شُعْبَةُ بِطَرَفِ إِصْبَعِهِ السَّبَّابَةِ",
                "id": "Telah bercerita kepada kami [Muhammad bin Ja'far] telah bercerita kepada kami [Syu'bah] dari [Yazid bin Abu Ziyad] dari [Sulaiman bin 'Amr bin Al Ahwash] dari [ibunya] bahwa ia menyaksikan Nabi Shallallahu'alaihiWasallam saat melempar jumroh 'aqobah dan orang-orang juga tengah melempar, beliau bersabda; \"Wahai sekalian manusia! Janganlah kalian membunuh -atau membinasakan diri kalian- dan lemparlah jumrah -atau jamarat- seperti kerikil pelempar.\" Beliau berisyarat dengan ujung jari telunjuk."
            },
            {
                "number": 3198,
                "arab": "حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ يَعْنِي الْمُقْرِي حَدَّثَنَا سَعِيدٌ يَعْنِي ابْنَ أَبِي أَيُّوبَ حَدَّثَنِي أَبُو عِيسَى الْخُرَاسَانِيُّ عَنْ عَبْدِ اللَّهِ بْنِ الْقَاسِمِ قَالَ حَدَّثَتْنِي جَارَةٌ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَاكَانَتْ تَسْمَعُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ عِنْدَ طُلُوعِ الْفَجْرِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَمِنْ فِتْنَةِ الْقَبْرِقَالَ أَبُو عِيسَى فَقُلْتُ لِعَبْدِ اللَّهِ أَرَأَيْتَ إِنْ جَمَعَهُمَا إِنْسَانٌ قَالَ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا قَالَ",
                "id": "Telah bercerita kepada kami [Abu 'Abdur Rahman Al Muqri] telah bercerita kepada kami [Sa'id bin Abu Ayyub] telah bercerita kepadaku [Abu 'Isa Al Khurasani] dari ['Abdullah bin Al Qasim] berkata; Telah bercerita kepadaku [tetangga Nabi ShallallahuAlaihiWasallam], bahwa ia mendengar Rasulullah Shallallahu'alaihiWasallam bersabda saat fajar menyingsing; \"Ya Allah! Sesungguhnya aku berlindung kepadaMu dari adzab kubur dan fitnah kubur.\" Berkata Abu 'Isa; Aku berkata kepada 'Abdullah; Bagaimana menurutmu bila keduanya disatukan oleh seseorang? Ia berkata; Rasulullah Shallallahu'alaihiWasallam mengutarakan sabda yang beliau sampaikan."
            },
            {
                "number": 3199,
                "arab": "حَدَّثَنَا خَلَفُ بْنُ الْوَلِيدِ حَدَّثَنَا خَالِدٌ عَنْ سَعِيدٍ الْجُرَيْرِيِّ عَنِ السَّعْدِيِّ عَنْ أَبِيهِ أَوْ عَمِّهِ قَالَرَمَقْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاتِهِ فَكَانَ يَمْكُثُ فِي رُكُوعِهِ وَسُجُودِهِ قَدْرَ مَا يَقُولُ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ثَلَاثًا",
                "id": "Telah bercerita kepada kami [Khalaf bin Al Walid] telah bercerita kepada kami [Khalid] dari [Sa'id Al Jurairi] dari [As Sa'di] dari [ayahnya] atau [pamannya], berkata; Saya melihat Rasulullah Shallallahu'alaihiWasallam saat sholat, beliau diam saat ruku' dan sujud seukuran membaca; Subnaanallaah wa bihamdihi, tiga kali."
            },
            {
                "number": 3200,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا أَبُو جَعْفَرٍ عَنْ يَحْيَى الْبَكَّاءِ عَنْ أَبِي رَافِعٍ قَالَكُنْتُ أَصُوغُ لِأَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَحَدَّثْنَنِي أَنَّهُنَّ لَسَمِعْنَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الذَّهَبُ بِالذَّهَبِ وَالْفِضَّةُ بِالْفِضَّةِ وَزْنًا بِوَزْنٍ فَمَنْ زَادَ أَوْ اسْتَزَادَ فَقَدْ أَرْبَى",
                "id": "Telah bercerita kepada kami [Abu An Nadhr] telah bercerita kepada kami [Abu Ja'far] dari [Yahya Al Bakka`] dari [Abu Rafi'] berkata; Aku pernah membuat (perhiasan) untuk istri-istri Nabi ShallallahuAalaihiWasallam, [mereka] bercerita kepadaku bahwa mereka mendengar Rasulullah Shallallahu'alaihiWasallam bersabda; \"Emas ditukar dengan emas, perak ditukar dengan perak, timbangan ditukar dengan timbangan, barangsiapa menambah atau meminta ditambah berarti telah melakukan riba.\""
            },
            {
                "number": 3201,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ عَمْرٍو حَدَّثَنَا خَالِدُ بْنُ عَمْرٍو عَنِ ابْنِ حَرْمَلَةَ عَنْ خَالَتِهِ قَالَتْخَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَاصِبٌ إِصْبَعَهُ مِنْ لَدْغَةِ عَقْرَبٍ فَقَالَ إِنَّكُمْ تَقُولُونَ لَا عَدُوَّ وَإِنَّكُمْ لَا تَزَالُونَ تُقَاتِلُونَ عَدُوًّا حَتَّى يَأْتِيَ يَأْجُوجُ وَمَأْجُوجُ عِرَاضُ الْوُجُوهِ صِغَارُ الْعُيُونِ شُهْبُ الشِّعَافِ مِنْ كُلِّ حَدَبٍ يَنْسِلُونَ كَأَنَّ وُجُوهَهُمْ الْمَجَانُّ الْمُطْرَقَةُ",
                "id": "Telah bercerita kepada kami [Muhammad bin Bisyr] telah bercerita kepada kami [Muhammad bin 'Amr] telah bercerita kepada kami Khalid bin 'Amr dari [Ibnu Harmalah] dari [bibinya] berkata; \"Rasulullah Shallallahu'alaihiWasallam berkhutbah seraya menegakkan jari beliau karena disengat kalajengking, beliau bersabda; \"Sesungguhnya kalian mengatakan tidak ada musuh dan sesungguhnya kalian akan senantiasa memerangi musuh hingga Ya`juj dan Ma`juj muncul, mukanya lebar, matanya sipit, jambul rambutnya berwarna putih, mereka turun dari tempat-tempat tinggi, wajah mereka seperti perisai yang ditempa (tebal dan keras)."
            },
            {
                "number": 3202,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا رَافِعُ بْنُ سَلَمَةَ الْأَشْجَعِيُّ حَدَّثَنِي حَشْرَجُ بْنُ زِيَادٍ الْأَشْجَعِيُّ عَنْ جَدَّتِهِ أُمِّ أَبِيهِ أَنَّهَا قَالَتْخَرَجْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزَاةِ خَيْبَرَ وَأَنَا سَادِسُ سِتِّ نِسْوَةٍ فَبَلَغَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ مَعَهُ نِسَاءً فَأَرْسَلَ إِلَيْنَا فَقَالَ مَا أَخْرَجَكُنَّ وَبِأَمْرِ مَنْ خَرَجْتُنَّ فَقُلْنَا خَرَجْنَا نُنَاوِلُ السِّهَامَ وَنَسْقِي النَّاسَ السَّوِيقَ وَمَعَنَا مَا نُدَاوِي بِهِ الْجَرْحَى وَنَغْزِلُ الشَّعْرَ وَنُعِينُ بِهِ فِي سَبِيلِ اللَّهِ قَالَ قُمْنَ فَانْصَرِفْنَ فَلَمَّا فَتَحَ اللَّهُ عَلَيْهِ خَيْبَرَ أَخْرَجَ لَنَا سِهَامًا كَسِهَامِ الرَّجُلِ قُلْتُ يَا جَدَّةُ مَا أَخْرَجَ لَكُنَّ قَالَتْ تَمْرًا",
                "id": "Telah bercerita kepada kami ['Abdush Shamad bin 'Abdul Warits] telah bercerita kepada kami [Rafi' bin Salamah Al Asyja'i] telah bercerita kepadaku [Hasyraj bin Ziyad Al Asyja'i] dari [neneknya] (ibu ayahnya), bahwa ia berkata; Saya pergi bersama Rasulullah Shallallahu'alaihiWasallam dalam perang Khoibar dan aku adalah keenam dan enam wanita. Terdengarlah oleh Rasulullah Shallallahu'alaihiWasallam bahwa ada wanita-wanita yang turut serta bersama beliau, beliau mendatangi kami lalu bersabda; \"Kenapa kalian pergi dan dengan perintah siapa kalian pergi.\" Kami menjawab; Kami pergi untuk menyediakan anak panah, memberikan adonan tepung untuk para prajurit, kami membawa obat bagi yang luka-luka, kami memintal rambut dan dengan obat-obatan itu kami membantu dijalan Allah. Rasulullah Shallallahu'alaihiWasallam bersabda; \"Berdirilah kalian dan pulanglah.\" Saat Allah subhanahu wata'ala menaklukkan Khoibar, beliau memberi kami satu bagian seperti bagian seorang lelaki. Aku bertanya; Nenek! Apa yang diberikan untuk kalian? Ia menjawab; Kurma."
            },
            {
                "number": 3203,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا أَبَانُ حَدَّثَنَا أَبُو عِمْرَانَ حَدَّثَنَا زُهَيْرُ بْنُ عَبْدِ اللَّهِ وَكَانَ عَامِلًا عَلَى تَوَّجَ وَأَثْنَى عَلَيْهِ خَيْرًا عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ نَامَ عَلَى إِجَّارٍ لَيْسَ عَلَيْهِ مَا يَدْفَعُ قَدَمَيْهِ فَخَرَّ فَقَدْ بَرِئَتْ مِنْهُ الذِّمَّةُ وَمَنْ رَكِبَ الْبَحْرَ إِذَا ارْتَجَّ فَقَدْ بَرِئَتْ مِنْهُ الذِّمَّةُ",
                "id": "Telah menceritakan kepada kami ['Abdush Shamad] telah bercerita kepada kami [Aban] telah bercerita kepada kami [Abu 'Imran] telah bercerita kepada kami [Zuhair bin 'Abdullah] -seorang 'alim dan mendapat pujian baik- dari [sebagaian sahabat Nabi] Shallallahu'alaihiwasallam dari Nabi Shallallahu'alaihiwasallam bahwa beliau bersabda; \"Barangsiapa tidur mengenakan sarung tanpa mengenakan kain penutup kaki lalu sarungnya terlepas maka tanggungan telah terbebas darinya dan barangsiapa mengarungi laut saat bergelombang, maka tanggungan telah terbebas darinya.\""
            },
            {
                "number": 3204,
                "arab": "حَدَّثَنَا سُرَيْجٌ وَعَفَّانُ قَالَا حَدَّثَنَا أَبُو عَوَانَةَ حَدَّثَنَا الْحُرُّ بْنُ الصَّيَّاحِ قَالَ سُرَيْجٌ عَنِ الْحُرِّ عَنْ هُنَيْدَةَ بْنِ خَالِدٍ عَنِ امْرَأَتِهِ عَنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصُومُ تِسْعَ ذِي الْحِجَّةِ وَيَوْمَ عَاشُورَاءَ وَثَلَاثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍقَالَ عَفَّانُ أَوَّلَ اثْنَيْنِ مِنْ الشَّهْرِ وَخَمِيسَيْنِ",
                "id": "Telah menceritakan kepada kami [Suraij] dan ['Affan] keduanya berkata; Telah bercerita kepada kami [Abu 'Awanah] telah bercerita kepada kami [Al Hurr bin Ash Shoyyah]. berkata Suraij, dari [Al Hurr] dari [Hunaidah bin Khalid] dari [istrinya] dari [salah satu istri Nabi] Shallallahu'alaihiwasallam, berkata; Rasulullah Shallallahu'alaihiwasallam puasa pada tanggal sembilan Dzulhijah, hari 'Asyura` dan tiga hari setiap bulan. Berkata 'Affan; Senin pertama setiap bulan dan dua kamis."
            },
            {
                "number": 3205,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي هَمَّامٍ الشَّعْبَانِيِّ قَالَ حَدَّثَنِي رَجُلٌ مِنْ خَثْعَمَ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ فَوَقَفَ ذَاتَ لَيْلَةٍ وَاجْتَمَعَ عَلَيْهِ أَصْحَابُهُ فَقَالَ إِنَّ اللَّهَ أَعْطَانِي اللَّيْلَةَ الْكَنْزَيْنِ كَنْزَ فَارِسَ وَالرُّومِ وَأَمَدَّنِي بِالْمُلُوكِ مُلُوكِ حِمْيَرَ إِلَّا الْأَحْمَرَيْنِ وَلَا مُلْكَ إِلَّا لِلَّهِ يَأْتُونَ يَأْخُذُونَ مِنْ مَالِ اللَّهِ وَيُقَاتِلُونَ فِي سَبِيلِ اللَّهِ قَالَهَا ثَلَاثًا",
                "id": "Telah menceritakan kepada kami ['Abdur Razzaq] telah bercerita kepada kami [Ma'mar] dari [Yahya bin Abu Katsir] dari [Abu Hammam Asy Sya'bani] berkata; Telah bercerita kepadaku [seseorang dari Khots'am] berkata; Kami bersama Rasulullah Shallallahu'alaihiwasallam dalam perang Tabuk. Pada suatu malam beliau berdiri dan para sahabat mengerumuni beliau lalu bersabda; \"Pada malam ini Allah memberiku dua harta simpanan; Harta simpanan Persia dan Romawi dan memberiku pertolongan dengan kerajaan-kerajaan; kerajaan Himyar kecuali dua yang merah. Tidak ada kerajaan kecuali milik Allah, mereka datang mengambil harta Allah dan berperang dijalan Allah.\" Rasulullah Shallallahu'alaihiwasallam mengucapkannya sebanyak tiga kali."
            },
            {
                "number": 3206,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ حَدَّثَنَا حُصَيْنٌ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ رَجُلٍ مِنْ قَوْمِهِ قَالَدَخَلْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيَّ خَاتَمٌ مِنْ ذَهَبٍ فَأَخَذَ جَرِيدَةً فَضَرَبَ بِهَا كَفِّي وَقَالَ اطْرَحْهُ قَالَ فَخَرَجْتُ فَطَرَحْتُهُ ثُمَّ عُدْتُ إِلَيْهِ فَقَالَ مَا فَعَلَ الْخَاتَمُ قَالَ قُلْتُ طَرَحْتُهُ قَالَ إِنَّمَا أَمَرْتُكَ أَنْ تَسْتَمْتِعَ بِهِ وَلَا تَطْرَحَهُ",
                "id": "Telah menceritakan kepada kami ['Ali bin 'Ashim] telah bercerita kepada kami [Hushain] dari [Salim bin Abu Al Ja'd] dari [seseorang dari kaumnya] berkata; Saya bertamu ke kediaman Nabi Shallallahu'alaihiwasallam dan saya mengenakan cincin emas. Beliau mengambil pelepah lalu dipukulkan ke telapak tanganku dan bersabda; \"Buanglah.\" Aku keluar dan membuangnya, lalu kembali menemui beliau, beliau bertanya; \"Bagaimana cincinnya?\" aku menjawab; Aku membuangnya. Rasulullah Shallallahu'alaihiwasallam bersabda; \"Aku hanya memerintahkanmu untuk menikmatinya, bukan membuangnya.\""
            },
            {
                "number": 3207,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ عَنْ عَطَاءِ بْنِ السَّائِبِ قَالَكُنْتُ جَالِسًا مَعَ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ الْمُزَنِيِّ فَدَخَلَ شَابَّانِ مِنْ وَلَدِ عُمَرَ فَصَلَّيَا رَكْعَتَيْنِ بَعْدَ الْعَصْرِ فَأَرْسَلَ إِلَيْهِمَا فَدَعَاهُمَا فَقَالَ مَا هَذِهِ الصَّلَاةُ الَّتِي صَلَّيْتُمَاهَا وَقَدْ كَانَ أَبُوكُمَا يَنْهَى عَنْهَا قَالَا حَدَّثَتْنَا عَائِشَةُ رَضِيَ اللَّهُ تَعَالَى عَنْهَا أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّاهُمَا عِنْدَهَا فَسَكَتَ وَلَمْ يَرُدَّ عَلَيْهِمَا شَيْئًا",
                "id": "Telah menceritakan kepada kami ['Ali bin 'Ashim] dari ['Atho` bin As Sa`ib] berkata; Saya duduk bersama 'Abdullah bin Mughoffal kemudian dua pemuda putra 'Umar masuk kemudian sholat dua rakaat setelah ashar, 'Abdullah mengirim utusan untuk menemui keduanya lalu memanggil keduanya dan berkata; sholat apa yang kalian lakukan, ayah kalian melarangnya. [Keduanya] berkata; Telah bercerita kepada kami ['Aisyah] bahwa Nabi Shallallahu'alaihiwasallam melakukannya saat berada didekat 'Aisyah lalu 'Abdullah diam dan tidak menanggapi apa pun."
            },
            {
                "number": 3208,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو الْمَلِيحِ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ جَدِّهِ وَكَانَ لِجَدِّهِ صُحْبَةٌأَنَّهُ خَرَجَ زَائِرًا لِرَجُلٍ مِنْ إِخْوَانِهِ فَبَلَغَهُ شَكَاتُهُ قَالَ فَدَخَلَ عَلَيْهِ فَقَالَ أَتَيْتُكَ زَائِرًا عَائِدًا وَمُبَشِّرًا قَالَ كَيْفَ جَمَعْتَ هَذَا كُلَّهُ قَالَ خَرَجْتُ وَأَنَا أُرِيدُ زِيَارَتَكَ فَبَلَغَتْنِي شَكَاتُكَ فَكَانَتْ عِيَادَةً وَأُبَشِّرُكَ بِشَيْءٍ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا سَبَقَتْ لِلْعَبْدِ مِنْ اللَّهِ مَنْزِلَةٌ لَمْ يَبْلُغْهَا بِعَمَلِهِ ابْتَلَاهُ اللَّهُ فِي جَسَدِهِ أَوْ فِي مَالِهِ أَوْ فِي وَلَدِهِ ثُمَّ صَبَّرَهُ حَتَّى يُبْلِغَهُ الْمَنْزِلَةَ الَّتِي سَبَقَتْ لَهُ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Husain bin Muhammad] telah bercerita kepada kami [Abu Al Malih] dari [Muhammad bin Khalid] dari [ayahnya] dari [kakeknya] dan ia adalah seorang sahabat, ia pergi mengunjungi salah seorang saudaranya, keluhannya terdengar olehnya. Berkata Muhammad bin Khalid; ia masuk lalu berkata; Aku mengunjungimu untuk menjengukmu dan memberi berita gembira. saudaranya bertanya; Bagaimana kau menyatukan semua itu? Ia menjawab; Aku pergi untuk mengunjungimu, aku mendengar keluhanmu, kunjunganku ini adalah untuk menjenguk dan menyampaikan khabar gembira tentang sesuatu yang pernah aku dengar dari Rasulullah Shallallahu'alaihiwasallam, beliau bersabda; \"Bila seorang hamba memperoleh kedudukan tinggi disisi Allah dan ia tidak bisa meraihnya dengan amalannya, Allah mengujinya pada diri, harta, atau anaknya kemudian ia bersabar hingga mengantarkannya kepada kedudukan yang diraihnya.\""
            },
            {
                "number": 3209,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ قَالَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أُبْدِعَ بِي فَاحْمِلْنِي قَالَ فَقَالَ لَيْسَ عِنْدِي قَالَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَفَلَا أَدُلُّهُ عَلَى مَنْ يَحْمِلُهُ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ دَلَّ عَلَى خَيْرٍ فَلَهُ مِثْلُ أَجْرِ فَاعِلِهِ",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] telah bercerita kepada kami [Al A'masy] dari [Abu 'Amr Asy Syaibani] dari [Abu Mas'ud Al Anshari] berkata; Seseorang mendatangi Nabi Shallallahu'alaihiwasallam lalu berkata; Wahai Rasulullah! Aku letih, tolong boponglah aku. Rasulullah Shallallahu'alaihiwasallam bersabda; \"Aku tidak bisa.\" Kemudian seseorang berkata kepada beliau; Bolehkan aku menunjukkannya pada seseorang yang akan membopongnya? Rasulullah Shallallahu'alaihiwasallam bersabda; \"Barangsiapa yang menunjukkan kebaikan maka ia mendapatkan pahala seperti orang yang melakukannya.\""
            },
            {
                "number": 3210,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ قَالَ أَخْبَرَنَا الدَّسْتُوَائِيُّ وَيَزِيدُ أَخْبَرَنَا الدَّسْتُوَائِيُّ حَدَّثَنَا حَمَّادٌ عَنْ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ الْجَدَلِيِّ عَنْ عُقْبَةَ بْنِ عَمْرٍو أَبِي مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يُوتِرُ مِنْ أَوَّلِ اللَّيْلِ وَأَوْسَطِهِ وَآخِرِهِ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Ibrahim] ia berkata, telah mengabarkan kepada kami [Ad Dastuwa`i]. Dan [Yazid] berkata, telah mengabarkan kepada kami [Ad Dastuwa`i] telah bercerita kepada kami [Hammad] dari [Ibrahim] dari [Abu 'Abdullah Al Jadali] dari ['Uqbah bin 'Amr Abu Mas'ud] dari Nabi Shallallahu'alaihiwasallam, bahwa beliau sholat witir di permulaan malam, pertengahan dan diakhir malam."
            },
            {
                "number": 3211,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ حَدَّثَنِي أَبِي عَنْ حَكِيمِ بْنِ أَفْلَحَ عَنْ أَبِي مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْمُسْلِمِ عَلَى الْمُسْلِمِ أَرْبَعُ خِلَالٍ أَنْ يُجِيبَهُ إِذَا دَعَاهُ وَيُشَمِّتَهُ إِذَا عَطَسَ وَإِذَا مَرِضَ أَنْ يَعُودَهُ وَإِذَا مَاتَ أَنْ يَشْهَدَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari ['Abdul Hamid bin Ja'far] telah bercerita kepadaku [ayahku] dari [Hakim bin Aflah] dari [Abu Mas'ud] dari Nabi Shallallahu'alaihiwasallam, beliau bersabda; \"Seorang muslim memilik empat hak atas muslim lain; hadir bila diundang, mendo'akan bila bersin, menjenguk bila sakit dan mengantarkan jenazah bila meninggal.\""
            },
            {
                "number": 3212,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنِي قَيْسُ بْنُ أَبِي حَازِمٍ عَنْ أَبِي مَسْعُودٍ عُقْبَةَ بْنِ عَمْرٍو قَالَأَتَى رَجُلٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي أَتَأَخَّرُ عَنْ صَلَاةِ الْغَدَاةِ مِنْ أَجْلِ فُلَانٍ مِمَّا يُطِيلُ بِنَا فَمَا رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشَدَّ غَضَبًا فِي مَوْعِظَةٍ مِنْهُ يَوْمَئِذٍ فَقَالَ يَا أَيُّهَا النَّاسُ إِنَّ مِنْكُمْ لَمُنَفِّرِينَ فَأَيُّكُمْ مَا صَلَّى بِالنَّاسِ فَلْيَتَجَوَّزْ فَإِنَّ فِيهِمْ الضَّعِيفَ وَالْكَبِيرَ وَذَا الْحَاجَةِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] telah bercerita kepada kami [Isma'il] telah bercerita kepadaku [Qais bin Abu Hazim] dari [Abu Mas'ud 'Uqbah bin 'Amr] berkata; Seseorang mendatangi Nabi Shallallahu'alaihiwasallam lalu berkata; Aku sengaja melambatkan diri pada sholat shubuh karena si fulan yang memperlama sholatnya bersama kami. Aku tidak pernah melihat Rasulullah Shallallahu'alaihiwasallam begitu marah seperti saat itu, beliau bersabda; \"Wahai sekalian manusia! Sesungguhnya diantara kalian ada yang menyusahkan. Siapa saja diantara kalian yang mengimami sholat hendaklah mempercepat karena diantara mereka ada yang lemah, tua dan punya keperluan.\""
            },
            {
                "number": 3213,
                "arab": "حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ حَدَّثَنَا مَنْصُورٌ عَنْ رِبْعِيٍّ عَنْ أَبِي مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلَامِ النُّبُوَّةِ الْأُولَى إِذَا لَمْ تَسْتَحِ فَاصْنَعْ مَا شِئْتَ",
                "id": "Telah menceritakan kepada kami [Yahya] dari [Sufyan] telah bercerita kepada kami [Manshur] dari [Rib'iy] dari [Abu Mas'ud] dari Nabi Shallallahu'alaihiwasallam bersabda; \"Diantara kata-kata nubuwwah pertama yang ditemukan orang adalah bila kau tidak malu maka lakukan sesukamu.\""
            },
            {
                "number": 3214,
                "arab": "زِيَادَات الْقُطَيْعِيِّ قَالَ ابْنُ مَالِكٍ حَدَّثَنَا الْفَضْلُ بْنُ الْحُبَابِ حَدَّثَنَا الْقَعْنَبِيُّ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا مَنْصُورٌ عَنْ رِبْعِيٍّ عَنْ أَبِي مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلَامِ النُّبُوَّةِ الْأُولَى إِذَا لَمْ تَسْتَحِ فَاصْنَعْ مَا شِئْتَ",
                "id": "-Tambahan-tambahan dari Al Qutho'i- Ibnu Malik berkata; Telah bercerita kepada kami [Al Fadhl bin Al Hubab] telah bercerita kepada kami [Al Qo'nabi] telah bercerita kepada kami [Syu'bah] telah bercerita kepada kami [Manshur] dari [Rib'iy] dari [Abu Mas'ud] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Diantara kata-kata nubuwah pertama yang ditemukan orang adalah; bila kau tidak malu maka lakukanlah sesukamu\"."
            },
            {
                "number": 3215,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا شُعْبَةُ عَنْ عَدِيِّ بْنِ ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَفَقَةُ الرَّجُلِ عَلَى أَهْلِهِ يَحْتَسِبُهَا صَدَقَةٌ",
                "id": "Telah menceritakan kepada kami [Waki'] telah bercerita kepada kami [Syu'bah] dari ['Adi bin Tsabit] dari ['Abdullah bin Yazid] dari [Abu Mas'ud Al Anshari] berkata; Nabi Shallallahu'alaihiwasallam bersabda; \"Nafkah seseorang untuk keluarganya jika disertai harapan memperoleh ganjaran, maka terhitung sebagai sedekah.\""
            },
            {
                "number": 3216,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ سَلَمَةَ عَنْ عِيَاضِ بْنِ عِيَاضٍ عَنْ أَبِيهِ عَنْ أَبِي مَسْعُودٍ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُطْبَةً فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ إِنَّ فِيكُمْ مُنَافِقِينَ فَمَنْ سَمَّيْتُ فَلْيَقُمْ ثُمَّ قَالَ قُمْ يَا فُلَانُ قُمْ يَا فُلَانُ قُمْ يَا فُلَانُ حَتَّى سَمَّى سِتَّةً وَثَلَاثِينَ رَجُلًا ثُمَّ قَالَ إِنَّ فِيكُمْ أَوْ مِنْكُمْ فَاتَّقُوا اللَّهَ قَالَ فَمَرَّ عُمَرُ عَلَى رَجُلٍ مِمَّنْ سَمَّى مُقَنَّعٍ قَدْ كَانَ يَعْرِفُهُ قَالَ مَا لَكَ قَالَ فَحَدَّثَهُ بِمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بُعْدًا لَكَ سَائِرَ الْيَوْمِحَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ سَلَمَةَ عَنْ رَجُلٍ عَنْ أَبِيهِ قَالَ سُفْيَانُ أُرَاهُ عِيَاضَ بْنَ عِيَاضٍ عَنْ أَبِيهِ عَنْ أَبِي مَسْعُودٍ قَالَ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Waki'] telah bercerita kepada kami [Sufyan] dari [Salamah] dari ['Iyadh bin 'Iyadh] dari [ayahnya] dari [Abu Mas'ud] berkata; Rasulullah Shallallahu'alaihiwasallam berkhutbah pada kami, beliau memuja dan memuji Allah subhanahu wata'ala kemudian bersabda; \"Diantara kalian ada orang-orang munafik. Siapa pun yang namanya aku sebut hendaklah berdiri.\" Selanjutnya Rasulullah Shallallahu'alaihiwasallam bersabda; \"Berdirilah hai fulan, berdirilah hai fulan, berdirilah hai fulan, \" hingga beliau menyebut tigapuluh enam nama. Setelah itu beliau bersabda; \"Sesungguhnya diantara kalian -atau sebagaian dari kalian- bertaqwalah kepada Allah.\" Lalu 'Umar melintasi seseorang yang namanya disebut Rasulullah Shallallahu'alaihiwasallam yang mengenakan penutup kepala yang ia kenal. Ia berkata; Ada apa denganmu? Ia mengatakan yang disampaikan Rasulullah Shallallahu'alaihiwasallam lalu 'Umar berkata; 'Celakalah kamu seharian ini.' Telah bercerita kepada kami [Abu Nu'aim] telah bercerita kepada kami [Sufyan] dari [Salamah] dari seseorang dari ayahnya. Sufyan berkata, ia memperlihatkannya pada ['Iyadh bin 'Iyadh] dari [ayahnya] dari [Abu Mas'ud] berkata; Rasulullah Shallallahu'alaihiwasallam berkhutbah. Lalu ia menyebutkan maknanya."
            },
            {
                "number": 3217,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ سُلَيْمَانَ عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ عَنْ أَبِي مَسْعُودٍ أَنَّهُ قَالَأَتَى رَجُلٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ فَقَالَ مَا عِنْدِي مَا أُعْطِيكَ وَلَكِنْ ائْتِ فُلَانًا فَأَتَى الرَّجُلَ فَأَعْطَاهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ دَلَّ عَلَى خَيْرٍ فَلَهُ مِثْلُ أَجْرِ فَاعِلِهِ أَوْ عَامِلِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah bercerita kepada kami [Syu'bah] dari [Sulaiman] dari [Abu 'Amr Asy Syaibani] dari [Abu Mas'ud] bahwa ia berkata; Seseorang mendatangi Nabi Shallallahu'alaihiwasallam lalu meminta beliau, beliau bersabda; \"Aku tidak punya sesuatu yang bisa aku berikan padamu, tolong datangilah si fulan saja.\" Orang itu mendatangi si fulan lalu diberi, kemudian Rasulullah Shallallahu'alaihiwasallam bersabda; \"Barangsiapa menunjukkan pada kebaikan maka ia mendapatkan seperti pahala pelakunya atau orang yang mengerjakannya.\""
            },
            {
                "number": 3218,
                "arab": "قَالَ قَرَأْتُ عَلَى عَبْدِ الرَّحْمَنِ : مَالِكٌ وَحَدَّثَنَا إِسْحَاقُ أَخْبَرَنِي مَالِكٌ عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ أَنَّ مُحَمَّدَ بْنَ عَبْدِ اللَّهِ بْنِ زَيْدٍ الْأَنْصَارِيَّ فِي حَدِيثِ عَبْدِ الرَّحْمَنِ وَعَبْدُ اللَّهِ بْنُ زَيْدٍ هُوَ الَّذِي كَانَ أُرِيَ النِّدَاءَ بِالصَّلَاةِ أَخْبَرَهُ عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ أَنَّهُ قَالَأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَجْلِسِ سَعْدِ بْنِ عُبَادَةَ فَقَالَ لَهُ بَشِيرُ بْنُ سَعْدٍ أَمَرَنَا اللَّهُ أَنْ نُصَلِّيَ عَلَيْكَ يَا رَسُولَ اللَّهِ فَكَيْفَ نُصَلِّي عَلَيْكَ قَالَ فَسَكَتَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى تَمَنَّيْنَا أَنَّهُ لَمْ يَسْأَلْهُ ثُمَّ قَالَ قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ وَالسَّلَامُ كَمَا قَدْ عَلِمْتُمْ",
                "id": "Berkata (Muhammad bin Ja'far); Saya membaca dihadapan ['Abdur Rahman]; [Malik] dan telah bercerita kepada kami [Ishaq] telah bercerita kepadaku [Malik] dari [Nu'aim bin 'Abdullah Al Mujmir] bahwa [Muhammad bin 'Abdullah bin Zaid Al Anshari] dalam hadits 'Abdur Rahman dan 'Abdullah bin Zaid, yang pernah bermimpi diberitahu cara dan kalimat-kalimat adzan memberitahunya dari [Abu Mas'ud Al Anshari] bahwa ia berkata; Rasulullah Shallallahu'alaihiwasallam mendatangi kami di majlis Sa'ad bin 'Ubadah lalu Basyir bin Sa'ad berkata pada beliau; Allah memerintahkan kami untuk bershalawat untuk baginda wahai Rasulullah! Lalu bagaimana caranya kami bershalawat untuk baginda? Rasulullah Shallallahu'alaihiwasallam diam hingga kami berharap andai saja ia (Basyir) tidak bertanya. Setelah itu Rasulullah Shallallahu'alaihiwasallam bersabda; \"Ucapkan; Ya Allah! Limpahkanlah kesejahteraan kepada Muhammad dan keluarga Muhammad seperti Engkau melimpahkan kesejahteraan kepada Ibrahim, berkahilah Muhammad seperti Engkau memberkahi Ibrahim dan keluarga Ibrahim, diseluruh alam sesungguhnya Engkau Maha Terpuji dan Agung\" wassalam, seperti yang telah kalian ketahui.\""
            },
            {
                "number": 3219,
                "arab": "حَدَّثَنَا حَسَنٌ وَحَجَّاجٌ قَالَا حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا أَبُو قَبِيلٍ قَالَ سَمِعْتُ أَبَا عَبْدِ الرَّحْمَنِ الْمُقْرِئَ يَقُولُ قَالَ حَجَّاجٌ عَنْ أَبِي قَبِيلٍ حَدَّثَنِي أَبُو عَبْدِ الرَّحْمَنِ الْجُبْلَانِيُّ أَنَّهُ سَمِعَ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا أُحِبُّ أَنَّ لِي الدُّنْيَا وَمَا فِيهَا بِهَذِهِ الْآيَةِ{ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ }فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ فَمَنْ أَشْرَكَ فَسَكَتَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ إِلَّا مَنْ أَشْرَكَ ثَلَاثَ مَرَّاتِ",
                "id": "Telah menceritakan kepada kami [Hasan] dan [Hajjaj] keduanya berkata; Telah bercerita kepada kami [Ibnu Lahi'ah] telah bercerita kepada kami [Abu Qobil], ia berkata; Saya mendengar [Abu 'Abdur Rahman Al Muqri`]. Berkata Hajjaj dari [Abu Qobil] telah bercerita kepadaku [Abu 'Abdur Rahman Al Jublani] bahwa ia mendengar [Tsauban], pelayan Rasulullah Shallallahu'alaihiwasallam berkata; Saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda; \"Ayat ini lebih aku sukai dari pada dunia seisinya; 'Hai hamba-hambaKu yang berlebih-lebihan atas dirinya, janganlah kamu berputus asa dari rahmat Allah, sesungguhnya Allah mengampuni seluruh dosa-dosa, sesungguhnya Ia Maha Pengampun lagi Penyayang'.\" Kemudian seseorang bertanya; Wahai Rasulullah! Lalu orang yang menyekutukan Allah? Nabi Shallallahu'alaihiwasallam diam lalu bersabda; \"Kecuali orang yang menyekutukan.\" Beliau mengucapkannya sebanyak tiga kali."
            },
            {
                "number": 3220,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى وَأَبُو الْيَمَانِ وَهَذَا حَدِيثُ إِسْحَاقَ قَالَا حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ عَنْ رَاشِدِ بْنِ دَاوُدَ الْأُمْلُوكِيِّ عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ عَنْ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَسِيرٍ لَهُ إِنَّا مُدْلِجُونَ فَلَا يُدْلِجَنَّ مُصْعِبٌ وَلَا مُضْعِفٌ فَأَدْلَجَ رَجُلٌ عَلَى نَاقَةٍ لَهُ صَعْبَةٍ فَسَقَطَ فَانْدَقَّتْ فَخِذُهُ فَمَاتَ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالصَّلَاةِ عَلَيْهِ ثُمَّ أَمَرَ مُنَادِيًا يُنَادِي فِي النَّاسِ إِنَّ الْجَنَّةَ لَا تَحِلُّ لِعَاصٍ إِنَّ الْجَنَّةَ لَا تَحِلُّ لِعَاصٍ ثَلَاثَ مَرَّاتٍ",
                "id": "Telah menceritakan kepada kami [Ishaq bin 'Isa] dan [Abu Al Yaman] dan ini adalah hadits Ishaq, keduanya berkata; Telah bercerita kepada kami [Isma'il bin 'Ayyasy] dari [Rasyid bin Dawud Al Amluki] dari [Abu Asma` Ar Rohabi] dari [Tsauban], pelayan Rasulullah Shallallahu'alaihiwasallam berkata; Rasulullah Shallallahu'alaihiwasallam bersabda dalam sebuah perjalanan beliau; \"Kami berjalan semalaman, maka janganlah tunggangan yang bermasalah dan lemah berjalan semalaman.\" Lalu seseorang berjalan semalaman dengan mengendarai unta yang bermasalah, ia terjatuh dan lututnya terbentur lalu mati. Kemudian Rasulullah Shallallahu'alaihiwasallam memerintahkan agar disholati lalu memerintahkan seseorang menyerukan; Surga tidak halal bagi orang yang durhaka, surga tidak halal bagi orang yang durhaka. Sebanyak tiga kali."
            },
            {
                "number": 3221,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ أَبِي عَمَّارٍ شَدَّادٍ عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ عَنْ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ أَنْ يَنْصَرِفَ مِنْ صَلَاتِهِ اسْتَغْفَرَ ثَلَاثَ مَرَّاتٍ ثُمَّ قَالَ اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ",
                "id": "Telah menceritakan kepada kami [Abu Al Mughiroh] telah bercerita kepada kami [Al Awza'i] dari [Abu 'Ammar Syaddad] dari [Abu Asma` Ar Rohabi] dari [Tsauban], pelayan Rasulullah Shallallahu'alaihiwasallam; Bila hendak beranjak dari sholat, Rasulullah Shallallahu'alaihiwasallam beristighfar tiga kali lalu bersabda; Ya Allah! Engkau Maha Selamat, dariMu-lah keselamatan, Maha Berbarokah Engkau wahai Pemilik Keagungan dan Kemuliaan.\""
            },
            {
                "number": 3222,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ حَدَّثَنَا ابْنُ عَيَّاشٍ عَنْ مُحَمَّدِ بْنِ المُهَاجِرِ عَنِ الْعَبَّاسِ بْنِ سَالِمٍ اللَّخْمِيِّ قَالَبَعَثَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ إِلَى أَبِي سَلَّامٍ الْحَبَشِيِّ فَحُمِلَ إِلَيْهِ عَلَى الْبَرِيدِ يَسْأَلُهُ عَنْ الْحَوْضِ فَقُدِمَ بِهِ عَلَيْهِ فَسَأَلَهُ فَقَالَ سَمِعْتُ ثَوْبَانَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ حَوْضِي مِنْ عَدَنَ إِلَى عَمَّانَ الْبَلْقَاءِ مَاؤُهُ أَشَدُّ بَيَاضًا مِنْ اللَّبَنِ وَأَحْلَى مِنْ الْعَسَلِ وَأَكَاوِيبُهُ عَدَدُ النُّجُومِ مَنْ شَرِبَ مِنْهُ شَرْبَةً لَمْ يَظْمَأْ بَعْدَهَا أَبَدًا أَوَّلُ النَّاسِ وُرُودًا عَلَيْهِ فُقَرَاءُ الْمُهَاجِرِينَ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ تَعَالَى عَنْهُ مَنْ هُمْ يَا رَسُولَ اللَّهِ قَالَ هُمْ الشُّعْثُ رُءُوسًا الدُّنْسُ ثِيَابًا الَّذِينَ لَا يَنْكِحُونَ الْمُتَنَعِّمَاتِ وَلَا تُفْتَحُ لَهُمْ أَبْوَابُ السُّدَدِ فَقَالَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ لَقَدْ نَكَحْتُ الْمُتَنَعِّمَاتِ وَفُتِحَتْ لِي السُّدَدُ إِلَّا أَنْ يَرْحَمَنِي اللَّهُ وَاللَّهِ لَا جَرَمَ أَنْ لَا أَدْهُنَ رَأْسِي حَتَّى يَشْعَثَ وَلَا أَغْسِلَ ثَوْبِي الَّذِي يَلِي جَسَدِي حَتَّى يَتَّسِخَ",
                "id": "Telah menceritakan kepada kami [Husain bin Muhammad] telah bercerita kepada kami [Ibnu 'Ayyasy] dari [Muhammad bin Al Muhajir] dari [Al 'Abbas bin Salim Al Lakhmi] berkata; 'Umar bin 'Abdul 'Aziz mengirim utusan membawa surat ke Abu Sallam Al Habasy lalu dibawa petugas pos untuk menanyakan tentang telaga. Surat diberikan lalu ia menanyakannya. Berkata [Abu Sallam]; Aku mendengar [Tsauban] berkata; Aku mendengar Rasulullah Shallallahu'alaihiwasallam bersabda; \"Sesungguhnya telagaku (seluas antara) Adn hingga Omman Al Baqla`, airnya lebih putih dari susu, lebih manis dari madu dan gelas-gelasnya sejumlah bintang, barangsiapa meminum satu tegukan tidak akan dahaga setelahnya selamanya. Orang-orang pertama yang mendatanginya adalah orang-orang fakir Muhajirin.\" Lalu 'Umar bin Al Khoththob Radliyallahu'anhu bertanya; Siapa mereka wahai Rasulullah Shallallahu'alaihiwasallam! Rasulullah Shallallahu'alaihiwasallam bersabda; \"Mereka adalah rakyat jelata yang berbaju lusuh yang tidak menikahi wanita-wanita berharta, dan pintu-pintu rumah tertutup untuk mereka, tidak dibukakan bagi mereka.\" Lalu 'Umar bin 'Abdul 'Aziz berkata; Aku menikahi wanita-wanita berharta dan pintu-pintu tertutup dibuka untukku, kecuali bila Allah merahmatiku. Demi Allah tidak masalah bila aku tidak meminyaki rambutku hingga acak-acakan dan aku tidak mencuci baju yang melilit tubuhku hingga lusuh. "
            },
            {
                "number": 3223,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ مِنْ كِتَابِهِ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا شَيْخٌ عَنْ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُسَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ قَتَلَ صَغِيرًا أَوْ كَبِيرًا أَوْ أَحْرَقَ نَخْلًا أَوْ قَطَعَ شَجَرَةً مُثْمِرَةً أَوْ ذَبَحَ شَاةً لِإِهَابِهَا لَمْ يَرْجِعْ كَفَافًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Ishaq] dari bukunya; Telah bercerita kepada kami [Ibnu Lahi'ah] telah bercerita kepada kami [seorang guru] dari [Tsauban], pelayan Rasulullah Shallallahu'alaihiwasallam bahwa ia mendengar Rasulullah Shallallahu'alaihiwasallam bersabda; \"Barangsiapa membunuh anak kecil, orang tua, membakar pohon kurma, menebang pohon berbuah atau menyembelih kambing untuk menakut-nakutinya maka ia tidak kembali dengan sekedarnya.\""
            },
            {
                "number": 3224,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ وَأَبَانُ قَالَا حَدَّثَنَا قَتَادَةُ عَنْ سَالِمٍ عَنْ مَعْدَانَ عَنْ ثَوْبَانَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ فَارَقَ الرُّوحُ الْجَسَدَ وَهُوَ بَرِيءٌ مِنْ ثَلَاثٍ دَخَلَ الْجَنَّةَ الْكِبْرِ وَالدَّيْنِ وَالْغُلُولِ",
                "id": "Telah menceritakan kepada kami ['Affan] telah bercerita kepada kami [Hammam] dan [Aban] keduanya berkata; Telah bercerita kepada kami [Qotadah] dari [Salim] dari [Ma'dan] dari [Tsauban] dari Nabi Shallallahu'alaihiwasallam bersabda; \"Barangsiapa yang nyawanya meninggalkan raganya dan ia terbebas dari tiga (hal) maka ia masuk surga; kesombongan, hutang dan pengkhianatan.\""
            },
            {
                "number": 3225,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ عَنْ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah bercerita kepada kami [Syu'bah] dari [Qotadah] dari [Syahr bin Hausyab] dari ['Abdur Rahman bin Ghonm] dari [Tsauban], pelayan Rasulullah Shallallahu'alaihiwasallam bahwa Rasulullah Shallallahu'alaihiwasallam bersabda; \"Orang yang berbekam dan yang dibekam, berarti telah batal puasanya.\""
            },
            {
                "number": 3226,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي الْجُودِيِّ عَنْ بَلْجٍ عَنْ أَبِي شَيْبَةَ الْمَهْرِيِّ قَالَ وَكَانَ قَاصَّ النَّاسِ بِقُسْطَنْطِينِيَّةَ قَالَقِيلَ لِثَوْبَانَ حَدِّثْنَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَاءَ فَأَفْطَرَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah bercerita kepada kami [Syu'bah] dari [Abu Al Judi] dari [Balj] dari [Abu Syaibah Al Mahri] -ahli ceramah di Kostantinopel- berkata; Dikatakan kepada [Tsauban]; Ceritakan kepada kami dari Rasulullah Shallallahu'alaihiwasallam. Ia berkata; Aku melihat Rasulullah Shallallahu'alaihiwasallam muntah lalu beliau berbuka."
            },
            {
                "number": 3227,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ قَالَقُلْتُ لِأَبِي الْعَالِيَةِ مَا ثَوْبَانُ قَالَ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَكَفَّلَ لِي أَنْ لَا يَسْأَلَ شَيْئًا وَأَتَكَفَّلُ لَهُ بِالْجَنَّةِ فَقَالَ ثَوْبَانُ أَنَافَكَانَ لَا يَسْأَلُ أَحَدًا شَيْئًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah bercerita kepada kami [Syu'bah] dari ['Ashim] ia berkata; Saya bertanya kepada [Abu Al 'Aliyah]; Tsauban siapa? Ia menjawab; Pelayan Rasulullah Shallallahu'alaihiwasallam. Berkata [Tsauban]; Rasulullah Shallallahu'alaihiwasallam bersabda; \"Barangsiapa menjamin untukku untuk tidak meminta-minta apa pun, aku akan menjaminnya surga.\" Tsauban berkata; Saya. Lalu ia tidak meminta-minta apa pun pada siapa pun."
            },
            {
                "number": 3228,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي أَسْمَاءَ الرَّحَبِيِّ عَنْ ثَوْبَانَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِذَا عَادَ الرَّجُلُ أَخَاهُ فَإِنَّهُ فِي أَخْرَافِ الْجَنَّةِ حَتَّى يَرْجِعَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah bercerita kepada kami [Syu'bah] dari [Khalid] dari [Abu Qilabah] dari [Abu Asma` Ar Rohabi] dari [Tsauban] dari Rasulullah Shallallahu'alaihiwasallam bahwa beliau bersabda; \"Bila seseorang menjenguk saudaranya, ia berada dalam dinding surga hingga ia kembali.\""
            },
            {
                "number": 3229,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عِيسَى بْنِ فَائِدٍ عَنْ رَجُلٍ عَنْ سَعْدِ بْنِ عُبَادَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَا مِنْ أَمِيرِ عَشَرَةٍ إِلَّا أَتَى اللَّهَ عَزَّ وَجَلَّ مَغْلُولًا يَوْمَ الْقِيَامَةِ لَا يُطْلِقُهُ إِلَّا الْعَدْلُ وَمَا مِنْ أَحَدٍ يَتَعَلَّمُ الْقُرْآنَ ثُمَّ نَسِيَهُ إِلَّا لَقِيَ اللَّهَ عَزَّ وَجَلَّ أَجْذَمَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Yazid bin Abu Ziyad] dari ['Isa bin Fa`id] dari [seseorang] dari [Sa'ad bin 'Ubadah] dari Nabi Shallallahu'alaihiWasallam bahwa beliau bersabda; \"Tidaklah seorang yang memimpin sepuluh orang melainkan akan mendatangi Allah Azzawajalla dalam keadaan terbelenggu pada hari kiamat, tidak ada yang melepaskannya kecuali keadilan dan tidaklah seseorang mempelajari al-qur'an kemudian melupakannnya melainkan akan bertemu Allah dalam keadaan buntung tangannya.\""
            },
            {
                "number": 3230,
                "arab": "حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا زُهَيْرٌ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ عَمْرِو بْنِ شُرَحْبِيلَ بْنِ سَعِيدِ بْنِ سَعْدِ بْنِ عُبَادَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ سَعْدِ بْنِ عُبَادَةَأَنَّ رَجُلًا مِنْ الْأَنْصَارِ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَخْبِرْنَا عَنْ يَوْمِ الْجُمُعَةِ مَاذَا فِيهِ مِنْ الْخَيْرِ قَالَ فِيهِ خَمْسُ خِلَالٍ فِيهِ خُلِقَ آدَمُ وَفِيهِ هَبَطَ آدَمُ وَفِيهِ تُوُفِّيَ آدَمُ وَفِيهِ سَاعَةٌ لَا يَسْأَلُ اللَّهَ عَبْدٌ فِيهَا شَيْئًا إِلَّا آتَاهُ اللَّهُ إِيَّاهُ مَا لَمْ يَسْأَلْ مَأْثَمًا أَوْ قَطِيعَةَ رَحِمٍ وَفِيهِ تَقُومُ السَّاعَةُ مَا مِنْ مَلَكٍ مُقَرَّبٍ وَلَا سَمَاءٍ وَلَا أَرْضٍ وَلَا جِبَالٍ وَلَا حَجَرٍ إِلَّا وَهُوَ يُشْفِقُ مِنْ يَوْمِ الْجُمُعَةِ",
                "id": "Telah menceritakan kepada kami [Abu 'Amir] telah menceritakan kepada kami [Zuhair] dari ['Abdullah bin Muhammad] dari ['Amr bin Syurahbil bin Sa'id bin Sa'ad bin 'Ubadah] dari [ayahnya] dari [kakeknya] dari [Sa'id bin 'Ubadah] bahwa seseorang dari Anshor mendatangi Nabi Shallallahu'alaihiWasallam lalu berkata; Beritahukan kepada kami tentang hari jum'at, kebaikan apa yang ada padanya? Rasulullah Shallallahu'alaihiWasallam bersabda; \"Didalamnya ada lima kejadian; di hari itu Adam diciptakan, Adam turun ke bumi, Adam wafat, dan di hari itu terjadi kiamat. Tidaklah seorang hamba meminta sesuatu kepada Allah pada hari itu melainkan pasti diberi, selama tidak meminta perbuatan dosa atau memutus silaturrahim dan dihari itu terjadi kiamat. Tidaklah malaikat yang dekat, tidaklah langit, bumi, gunung dan batu melainkan bersimpati kepada hari Jum'at.\""
            },
            {
                "number": 3231,
                "arab": "حَدَّثَنَا هَاشِمٌ أَخْبَرَنَا الْمُبَارَكُ عَنِ الْحَسَنِ عَنْ سَعْدِ بْنِ عُبَادَةَ قَالَمَرَّ بِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا رَسُولَ اللَّهِ دُلَّنِي عَلَى صَدَقَةٍ قَالَ اسْقِ الْمَاءَ",
                "id": "Telah menceritakan kepada kami [Hasyim] telah mengkhabarkan kepada kami [Al Mubarak] dari [Al Hasan] dari [Sa'ad bin 'Ubadah] berkata; Rasulullah Shallallahu'alaihiWasallam melintasiku lalu aku berkata; Wahai Rasulullah! Tunjukkan aku pada suatu sedekah? Rasulullah Shallallahu'alaihiWasallam bersabda; \"Berilah air minum.\""
            },
            {
                "number": 3232,
                "arab": "حَدَّثَنَا حَجَّاجٌ قَالَ سَمِعْتُ شُعْبَةَ يُحَدِّثُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ الْحَسَنَ يُحَدِّثُ عَنْ سَعْدِ بْنِ عُبَادَةَأَنَّ أُمَّهُ مَاتَتْ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمِّي مَاتَتْ فَأَتَصَدَّقُ عَنْهَا قَالَ نَعَمْ قَالَ فَأَيُّ الصَّدَقَةِ أَفْضَلُ قَالَ سَقْيُ الْمَاءِقَالَ فَتِلْكَ سِقَايَةُ آلِ سَعْدٍ بِالْمَدِينَةِ",
                "id": "Telah menceritakan kepada kami [Hajjaj], ia berkata; Saya mendengar [Syu'bah] menceritakan dari [Qatadah], ia berkata; Saya mendengar [Al Hasan] menceritakan dari [Sa'ad bin 'Ubadah]; bahwasanya ibunya meninggal dunia, ia berkata; Wahai Rasulullah! ibuku meninggal dunia, bolehkah aku bersedekah untuknya? Rasulullah Shallallahu'alaihiWasallam bersabda; \"Ya.\" Ia bertanya; Sedekah apa yang paling utama? Rasulullah Shallallahu'alaihiWasallam bersabda; \"Memberi air minum.\" Berkata Al Hasan; Itulah air minum keluarga Sa'ad di Madinah."
            },
            {
                "number": 3233,
                "arab": "حَدَّثَنَا أَبُو سَلَمَةَ الْخُزَاعِيُّ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ إِسْمَاعِيلَ بْنِ عَمْرِو بْنِ قَيْسِ بْنِ سَعْدِ بْنِ عُبَادَةَ عَنْ أَبِيهِأَنَّهُمْ وَجَدُوا فِي كُتُبِ أَوْ فِي كِتَابِ سَعْدِ بْنِ عُبَادَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَضَى بِالْيَمِينِ مَعَ الشَّاهِدِ",
                "id": "Telah menceritakan kepada kami [Abu Salamah Al Khuza'i] telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Rabi'ah bin Abu 'Abdur Rahman] dari [Isma'il bin 'Amr bin Qais bin Sa'ad bin 'Ubadah] dari [ayahnya], bahwa mereka menemukan dibuku Sa'ad bin 'Ubadah bahwa Rasulullah Shallallahu'alaihiWasallam memutuskan berdasarkan sumpah dan seorang saksi."
            },
            {
                "number": 3234,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ حَدَّثَنَا حُمَيْدُ بْنُ هِلَالٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ سَعْدِ بْنِ عُبَادَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ قُمْ عَلَى صَدَقَةِ بَنِي فُلَانٍ وَانْظُرْ لَا تَأْتِي يَوْمَ الْقِيَامَةِ بِبَكْرٍ تَحْمِلُهُ عَلَى عَاتِقِكَ أَوْ عَلَى كَاهِلِكَ لَهُ رُغَاءٌ يَوْمَ الْقِيَامَةِ قَالَ يَا رَسُولَ اللَّهِ اصْرِفْهَا عَنِّي فَصَرَفَهَا عَنْهُ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id, budak Bani Hasyim], telah menceritakan kepada kami [Sulaiman bin Al Mughirah] telah menceritakan kepada kami [Humaid bin Hilal] dari [Sa'id bin Al Musayyib] dari [Sa'ad bin 'Ubadah] dari Rasulullah Shallallahu'alaihiWasallam bersabda kepadanya; \"Pungutlah zakat dari Bani Fulan dan telitilah dengan benar, agar supaya pada hari Kiamat kelak, kamu tidak datang pada hari kiamat dengan memanggul anak unta yang mengeluh-eluh diatas pundakmu atau diatas punggungmu.\" Sa'ad berkata; Wahai Rasulullah! Palingkanlah hal itu dariku. Lalu Beliau memalingkan darinya.\""
            },
            {
                "number": 3235,
                "arab": "حَدَّثَنَا يُونُسُ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي شُمَيْلَةَ عَنْ رَجُلٍ رَدَّهُ إِلَى سَعِيدٍ الصَّرَّافِ عَنْ إِسْحَاقَ بْنِ سَعْدِ بْنِ عُبَادَةَ عَنْ أَبِيهِ سَعْدِ بْنِ عُبَادَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ هَذَا الْحَيَّ مِنْ الْأَنْصَارِ مِحْنَةٌ حُبُّهُمْ إِيمَانٌ وَبُغْضُهُمْ نِفَاقٌ",
                "id": "Telah menceritakan kepada kami [Yunus], telah menceritakan kepada kami [Hammad bin Zaid], telah menceritakan kepada kami ['Abdur Rahman bin Abu Syumailah] dari [seseorang] yang menyandarkannya kepada [Sa'id Ash Shorrof] dari [Ishaq bin Sa'ad bin 'Ubadah] dari [ayahnya -Sa'ad bin 'Ubadah-], ia berkata; Rasulullah Shallallahu'alaihiWasallam bersabda; \"Perkampungan Anshar ini adalah ujian, mencintai mereka adalah keimanan dan membenci mereka adalah tanda kemunafikan.\""
            },
            {
                "number": 3236,
                "arab": "حَدَّثَنَا خَلَفُ بْنُ الْوَلِيدِ حَدَّثَنَا خَالِدٌ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عِيسَى بْنِ فَائدٍ عَنْ رَجُلٍ عَنْ سَعْدِ بْنِ عُبَادَةَ قَالَ سَمِعْتُ غَيْرَ مَرَّةٍ وَلَا مَرَّتَيْنِ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ أَمِيرِ عَشَرَةٍ إِلَّا يُؤْتَى بِهِ يَوْمَ الْقِيَامَةِ مَغْلُولٌ لَا يَفُكُّهُ مِنْ ذَلِكَ الْغُلِّ إِلَّا الْعَدْلُ وَمَا مِنْ رَجُلٍ قَرَأَ الْقُرْآنَ فَنَسِيَهُ إِلَّا لَقِيَ اللَّهَ يَوْمَ يَلْقَاهُ وَهُوَ أَجْذَمُ",
                "id": "Telah menceritakan kepada kami [Khalaf bin Al Walid] telah menceritakan kepada kami [Khalid] dari [Yazid bin Abu Ziyad] dari ['Isa bin Fa`id] dari [seseorang] dari [Sa'ad bin 'Ubadah] berkata; Aku mendengar seseorang berkata bukan hanya sekali dua kali; Rasulullah Shallallahu'alaihiWasallam bersabda; \"Tidaklah seorang yang memimpin sepuluh orang melainkan akan mendatangi Allah Azzawajalla dalam keadaan terbelenggu pada hari kiamat, tidak ada yang melepaskannya dari belenggu itu kecuali keadilan dan tidaklah seseorang mempelajari al-qur'an kemudian melupakannnya melainkan bertemu Allah dalam keadaan putus tangannya.\""
            },
            {
                "number": 3237,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا أَبُو مُعَاوِيَةَ يَعْنِي شَيْبَانَ عَنْ مَنْصُورٍ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ سَلَمَةَ بْنِ نُعَيْمٍ وَكَانَ مِنْ أَصْحَابِ الرَّسُولِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ لَقِيَ اللَّهَ لَا يُشْرِكُ بِهِ شَيْئًا دَخَلَ الْجَنَّةَ وَإِنْ زَنَى وَإِنْ سَرَقَ",
                "id": "Telah menceritakan kepada kami [Abu An Nadhr] telah menceritakan kepada kami [Abu Mu'awiyah Sayiban] dari [Manshur] dari [Salim bin Abu Al Ja'd] dari [Salamah bin Nu'aim] -salah seorang sahabat Rasulullah Shallallahu'alaihiwasallam-, berkata; Rasulullah Shallallahu'alaihiWasallam bersabda; \"Barangsiapa bertemu Allah tanpa menyekutukanNya dengan sesuatu pun, ia masuk surga meski berzina dan meski mencuri.\""
            },
            {
                "number": 3238,
                "arab": "حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو حَدَّثَنَا أَبُو إِسْحَاقَ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَاقَ عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ قَالَجَاءَ رِعْيَةُ السُّحَيْمِيُّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أُغِيرَ عَلَى وَلَدِي وَمَالِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا الْمَالُ فَقَدْ اقْتُسِمَ وَأَمَّا الْوَلَدُ فَاذْهَبْ مَعَهُ يَا بِلَالُ فَإِنْ عَرَفَ وَلَدَهُ فَادْفَعْهُ إِلَيْهِ قَالَ فَذَهَبَ مَعَهُ فَأَرَاهُ إِيَّاهُ فَقَالَ تَعْرِفُهُ قَالَ نَعَمْ فَدَفَعَهُ فَذَهَبَ إِلَيْهِقَالَ سُفْيَانُ يَرَوْنَ أَنَّهُ أَسْلَمَ قَبْلَ أَنْ يُغَارَ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Mu'awiyah bin 'Amr] telah menceritakan kepada kami [Abu Ishaq] dari [Sufyan] dari [Abu Ishaq] dari [Abu 'Amr Asy Syaibani] berkata; [Ri'yah As Suhaimi] mendatangi Nabi Shallallahu'alaihiWasallam lalu berkata; Anak dan hartaku diserang. Rasulullah Shallallahu'alaihiWasallam bersabda; \"Harta telah dibagi, sedangkan anak, hai Bilal pergilah bersamanya. Bila ia mengenali anaknya, serahkan padanya.\" Bilal pergi bersama Ri'yah, Bilal memperlihatkan anak pada Ri'yah lalu bertanya; Kau mengenalinya. Ia menjawab; Ya. Lalu Bilal menyerahkan anak itu pada Ri'yah lalu pergi. Berkata Sufyan; Mereka meriwayatkan bahwa Ri'yah masuk Islam sebelum penyerangan."
            },
            {
                "number": 3239,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ حَدَّثَنَا إِسْرَائِيلُ حَدَّثَنَا أَبُو إِسْحَاقَ عَنِ الشَّعْبِيِّ عَنْ رِعْيَةَ السُّحَيْمِيِّ قَالَكَتَبَ إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَدِيمٍ أَحْمَرَ فَأَخَذَ كِتَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَقَعَ بِهِ دَلْوَهُ فَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً فَلَمْ يَدَعُوا لَهُ رَائِحَةً وَلَا سَارِحَةً وَلَا أَهْلًا وَلَا مَالًا إِلَّا أَخَذُوهُ وَانْفَلَتَ عُرْيَانًا عَلَى فَرَسٍ لَهُ لَيْسَ عَلَيْهِ قِشْرَةٌ حَتَّى يَنْتَهِيَ إِلَى ابْنَتِهِ وَهِيَ مُتَزَوِّجَةٌ فِي بَنِي هِلَالٍ وَقَدْ أَسْلَمَتْ وَأَسْلَمَ أَهْلُهَا وَكَانَ مَجْلِسُ الْقَوْمِ بِفِنَاءِ بَيْتِهَا فَدَارَ حَتَّى دَخَلَ عَلَيْهَا مِنْ وَرَاءِ الْبَيْتِ قَالَ فَلَمَّا رَأَتْهُ أَلْقَتْ عَلَيْهِ ثَوْبًا قَالَتْ مَا لَكَ قَالَ كُلُّ الشَّرِّ نَزَلَ بِأَبِيكِ مَا تُرِكَ لَهُ رَائِحَةٌ وَلَا سَارِحَةٌ وَلَا أَهْلٌ وَلَا مَالٌ إِلَّا وَقَدْ أُخِذَ قَالَتْ دُعِيتَ إِلَى الْإِسْلَامِ قَالَ أَيْنَ بَعْلُكِ قَالَتْ فِي الْإِبِلِ قَالَ فَأَتَاهُ فَقَالَ مَا لَكَ قَالَ كُلُّ الشَّرِّ قَدْ نَزَلَ بِهِ مَا تُرِكَتْ لَهُ رَائِحَةٌ وَلَا سَارِحَةٌ وَلَا أَهْلٌ وَلَا مَالٌ إِلَّا وَقَدْ أُخِذَ وَأَنَا أُرِيدُ مُحَمَّدًا أُبَادِرُهُ قَبْلَ أَنْ يُقَسِّمَ أَهْلِي وَمَالِي قَالَ فَخُذْ رَاحِلَتِي بِرَحْلِهَا قَالَ لَا حَاجَةَ لِي فِيهَا قَالَ فَأَخَذَ قَعُودَ الرَّاعِي وَزَوَّدَهُ إِدَاوَةً مِنْ مَاءٍ قَالَ وَعَلَيْهِ ثَوْبٌ إِذَا غَطَّى بِهِ وَجْهَهُ خَرَجَتْ اسْتُهُ وَإِذَا غَطَّى اسْتَهُ خَرَجَ وَجْهُهُ وَهُوَ يَكْرَهُ أَنْ يُعْرَفَ حَتَّى انْتَهَى إِلَى الْمَدِينَةِ فَعَقَلَ رَاحِلَتَهُ ثُمَّ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَ بِحِذَائِهِ حَيْثُ يُصَلِّي فَلَمَّا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْفَجْرَ قَالَ يَا رَسُولَ اللَّهِ ابْسُطْ يَدَيْكَ فَلْأُبَايِعْكَ فَبَسَطَهَا فَلَمَّا أَرَادَ أَنْ يَضْرِبَ عَلَيْهَا قَبَضَهَا إِلَيْهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَفَعَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَلِكَ ثَلَاثًا قَبَضَهَا إِلَيْهِ وَيَفْعَلُهُ فَلَمَّا كَانَتْ الثَّالِثَةُ قَالَ مَنْ أَنْتَ قَالَ رِعْيَةُ السُّحَيْمِيُّ قَالَ فَتَنَاوَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَضُدَهُ ثُمَّ رَفَعَهُ ثُمَّ قَالَ يَا مَعْشَرَ الْمُسْلِمِينَ هَذَا رِعْيَةُ السُّحَيْمِيُّ الَّذِي كَتَبْتُ إِلَيْهِ فَأَخَذَ كِتَابِي فَرَقَعَ بِهِ دَلْوَهُ فَأَخَذَ يَتَضَرَّعُ إِلَيْهِ قُلْتُ يَا رَسُولَ اللَّهِ أَهْلِي وَمَالِي قَالَ أَمَّا مَالُكَ فَقَدْ قُسِّمَ وَأَمَّا أَهْلُكَ فَمَنْ قَدَرْتَ عَلَيْهِ مِنْهُمْ فَخَرَجَ فَإِذَا ابْنُهُ قَدْ عَرَفَ الرَّاحِلَةَ وَهُوَ قَائِمٌ عِنْدَهَا فَرَجَعَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هَذَا ابْنِي فَقَالَ يَا بِلَالُ اخْرُجْ مَعَهُ فَسَلْهُ أَبُوكَ هَذَا فَإِنْ قَالَ نَعَمْ فَادْفَعْهُ إِلَيْهِ فَخَرَجَ بِلَالٌ إِلَيْهِ فَقَالَ أَبُوكَ هَذَا قَالَ نَعَمْ فَرَجَعَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ مَا رَأَيْتُ أَحَدًا اسْتَعْبَرَ إِلَى صَاحِبِهِ فَقَالَ ذَاكَ جَفَاءُ الْأَعْرَابِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Bakr] telah menceritakan kepada kami [Isra`il] telah menceritakan kepada kami [Abu Ishaq] dari [Asy Sya'bi] dari [Ri'yah As Suhaimi] berkata; Rasulullah Shallallahu'alaihiWasallam mengirim surat padanya dalam kulit merah, ia mengambil surat Rasulullah Shallallahu'alaihiWasallam kemudian dipakai untuk menambal gayungnya. Kemudian Rasulullah Shallallahu'alaihiWasallam mengirim tentara sariyah (ekspedisi militer yang tanpa diikutsertai Rasulullah Shallallahu'alaihiwasallam), Tidaklah mereka meninggalkan angin, ternak, keluarga dan hartanya, melainkan mereka pasti mengambilnya. Ri'yah melarikan diri dengan telanjang mengendarai kuda miliknya yang tidak ada pelananya hingga tiba di hadapan putrinya yang sudah memiliki suami di Bani Hilal, putrinya sudah masuk Islam dan keluarganya juga. Majelis kaum diselenggarakan di halaman rumahnya. Ia berputar keliling hingga masuk ke rumah putrinya dari belakang. Saat purinya melihatnya, ia memberinya baju. Putrinya berkata; Ada apa denganmu? Ia menjawab; Semua keburukan menimpa ayahmu. Aku tidak ditinggali angin, binatang ternak, keluarga dan harta, semuanya diambil. Putrinya berkata; 'Kau diseru untuk masuk Islam? Ia balik bertanya; Mana suamimu? Putrinya menjawab; Sedang mengurus unta. Lalu Ri'yah mendatangi suami putrinya, suami putrinya bertanya; Ada apa denganmu? Ri'yah menjawab; Semua keburukan menimpaku. Aku tidak ditinggali angin, binatang ternak, keluarga dan harta, semuanya diambil dan aku menginginkan Muhammad, aku akan bergegas menemuinya sebelum membagi-bagikan keluarga dan hartaku. suami putrinya berkata; Ambillah kendaraanku sebagai gantinya. Ri'yah berkata; Aku tidak membutuhkannya. suami putrinya mengambil perbekalan dan membekalinya dengan sekantong air, ia mengenakan baju yang bila wajahnya ditutupi, pantatnya kelihatan dan bila pantatnya ditutupi, mukanya terlihat sementara ia tidak mau dikenali. Ia pergi hingga tiba di Madinah lalu mengikat tunggangannya kemudian mendatangi Rasulullah Shallallahu'alaihiwasallam, saat itu beliau tengah sholat. Seusai Rasulullah Shallallahu'alaihiWasallam sholat fajar, Ri'yah berkata; Wahai Rasulullah! Bentangkan tanganmu, aku akan berbaiat pada baginda. Rasulullah Shallallahu'alaihiWasallam membentangkan tangan beliau. Saat Ri'yah hendak memukul tangan Rasulullah Shallallahu'alaihiwasallam, Rasulullah Shallallahu'alaihiWasallam meraihnya, Rasulullah Shallallahu'alaihiWasallam melakukan hal itu sebanyak tiga kali. Pada kali ketiganya Rasulullah Shallallahu'alaihiWasallam bersabda; \"Siapa kamu?\" ia menjawab; Ri'yah As Suhaimi. Rasulullah Shallallahu'alaihiWasallam meraih lengan atasnya dan mengangkatnya lalu bersabda; \"Hai sekalian kaum muslimin! Ini Ri'yah As Suhaimi yang saya kirimi surat lalu suratku dipakai untuk menambal gayungnya.\" Ri'yah pun menunduk-nunduk pada beliau dan berkata; wahai Rasulullah! Keluarga dan hartaku. Rasulullah Shallallahu'alaihiWasallam bersabda; \"Harta sudah dibagi, sementara keluargamu, siapa yang bisa kau kenali dari mereka?\" ia keluar, ternyata putranya telah mengenali kendaraannya, ia tengah berdiri didekatnya ia lalu kembali menemui Rasulullah Shallallahu'alaihiwasallam, ia berkata; Ini putraku. Rasulullah Shallallahu'alaihiWasallam bersabda; \"Hai Bilal! Keluarlah bersamanya dan tanyakan siapa ayahnya, bila ia mengiyakan serahkan pada ayahnya.\" Bilal keluar menemuinya dan bertanya; Ini ayahmu? Ia menjawab; Ya. Kemudian Bilal kembali menemui Rasulullah Shallallahu'alaihiWasallam dan berkata; Wahai Rasulullah! Aku tidak melihat seorang pun yang bersedih hati pada temannya. Rasulullah Shallallahu'alaihiWasallam bersabda; \"Itulah kasarnya tabiat orang badui.\""
            },
            {
                "number": 3240,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنِي يَعْلَى بْنُ عَطَاءٍ عَنْ أَبِي هَمَّامٍ قَالَ أَبُو الْأَسْوَدِ هُوَ عَبْدُ اللَّهِ بْنُ يَسَارٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْفِهْرِيِّ قَالَكُنْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ حُنَيْنٍ فَسِرْنَا فِي يَوْمٍ قَائِظٍ شَدِيدِ الْحَرِّ فَنَزَلْنَا تَحْتَ ظِلَالِ الشَّجَرِ فَلَمَّا زَالَتْ الشَّمْسُ لَبِسْتُ لَأْمَتِي وَرَكِبْتُ فَرَسِي فَانْطَلَقْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ فِي فُسْطَاطِهِ فَقُلْتُ السَّلَامُ عَلَيْكَ يَا رَسُولَ اللَّهِ وَرَحْمَةُ اللَّهِ حَانَ الرَّوَاحُ فَقَالَ أَجَلْ فَقَالَ يَا بِلَالُ فَثَارَ مِنْ تَحْتِ سَمُرَةٍ كَأَنَّ ظِلَّهُ ظِلُّ طَائِرٍ فَقَالَ لَبَّيْكَ وَسَعْدَيْكَ وَأَنَا فِدَاؤُكَ فَقَالَ أَسْرِجْ لِي فَرَسِي فَأَخْرَجَ سَرْجًا دَفَّتَاهُ مِنْ لِيفٍ لَيْسَ فِيهِمَا أَشَرٌ وَلَا بَطَرٌ قَالَ فَأَسْرَجَ قَالَ فَرَكِبَ وَرَكِبْنَا فَصَافَفْنَاهُمْ عَشِيَّتَنَا وَلَيْلَتَنَا فَتَشَامَّتِ الْخَيْلَانِ فَوَلَّى الْمُسْلِمُونَ مُدْبِرِينَ كَمَا قَالَ اللَّهُ عَزَّ وَجَلَّ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عِبَادَ اللَّهِ أَنَا عَبْدُ اللَّهِ وَرَسُولُهُ ثُمَّ قَالَ يَا مَعْشَرَ الْمُهَاجِرِينَ أَنَا عَبْدُ اللَّهِ وَرَسُولُهُ قَالَ ثُمَّ اقْتَحَمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ فَرَسِهِ فَأَخَذَ كَفًّا مِنْ تُرَابٍ فَأَخْبَرَنِي الَّذِي كَانَ أَدْنَى إِلَيْهِ مِنِّي ضَرَبَ بِهِ وُجُوهَهُمْ وَقَالَ شَاهَتْ الْوُجُوهُ فَهَزَمَهُمْ اللَّهُ عَزَّ وَجَلَّقَالَ يَعْلَى بْنُ عَطَاءٍ فَحَدَّثَنِي أَبْنَاؤُهُمْ عَنْ آبَائِهِمْ أَنَّهُمْ قَالُوا لَمْ يَبْقَ مِنَّا أَحَدٌ إِلَّا امْتَلَأَتْ عَيْنَاهُ وَفَمُهُ تُرَابًا وَسَمِعْنَا صَلْصَلَةً بَيْنَ السَّمَاءِ وَالْأَرْضِ كَإِمْرَارِ الْحَدِيدِ عَلَى الطَّسْتِ الْحَدِيدِ حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا يَعْلَى بْنُ عَطَاءٍ عَنْ عَبْدِ اللَّهِ بْنِ يَسَارٍ أَبِي هَمَّامٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْفِهْرِيِّ قَالَ كُنْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ حُنَيْنٍ فَسِرْنَا فِي يَوْمٍ قَائِظٍ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Hammad bin Salamah] telah mengkhabarkan kepadaku [Ya'la bin 'Atho`] dari [Abu Hammam] -berkata Abu Al Aswad: Abu Hammam adalah 'Abdullah bin Yasar- dari [Abu 'Abdur Rahman Al Fihri] berkata; Aku bersama Rasulullah Shallallahu'alaihiWasallam dalam perang Hunain, kami berjalan di hari yang sangat panas, kami singgah dibawah naungan pohon. Saat matahari menghilang, aku mengenakan baju besiku lalu naik kuda. Aku pergi menghampiri Rasulullah Shallallahu'alaihiwasallam, beliau berada di tenda, aku mengucapkan salam; Assalamu'alaika wa rohmatullaah wahai Rasulullah, sudah saatnya jalan. Rasulullah Shallallahu'alaihiWasallam bersabda; \"Baik.\" Lalu beliau bersabda; \"Hai Bilal, tolong pasang pelana kudaku.\" Bilal mengeluarkan pelana yang ditambali sabut, tidak ada kesombongan pada keduanya. Bilal pun memasangkan pelana. Beliau naik dan kami pun naik. Kami mengatur baris mereka di pagi dan malam hari. Ada dua kuda jatuh lalu kaum muslimin mundur seperti yang difirmankan Allah subhanahu wata'ala lalu Rasulullah Shallallahu'alaihiWasallam bersabda; \"Hai hamba-hamba Allah! Aku adalah hamba Allah dan rasulNya.\" Selanjutnya beliau bersabda; \"Hai sekalian kaum Muhajirin! Aku adalah hamba Allah dan rasulNya.\" Kemudian Rasulullah Shallallahu'alaihiWasallam masuk ke medan perang tanpa berkuda lalu mengambil segenggam pasir. Orang yang ada didekat beliau memberitahkan padaku; Rasulullah Shallallahu'alaihiWasallam melemparkannya ke muka orang-orang kafir dan bersabda; \"Buruklah wajah-wajah musuh.\" Allah Azzawajalla mengalahkan mereka. Berkata Ya'la bin 'Atho`; Anak-anak mereka bercerita kepadaku dari ayah-ayah mereka bahwa mereka berkata; Tidak seorang pun dari kami yang mata dan mulutnya tidak penuh dengan pasir. Kami mendengar suara berdering diantara langit dan bumi seperti hantaman besi mengenai baskom besi. Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] telah mengkhabarkan kepada kami [Ya'la bin 'Atho`] dari ['Abdullah bin Yasar Abu Hammam] dari [Abu 'Abdur Rahman Al Fihri] berkata; Aku bersama Rasulullah Shallallahu'alaihiWasallam saat perang Hunain, kami berjalan dihari yang sangat panas. Ia menyebutkan hadits serupa."
            },
            {
                "number": 3241,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا مُعَاوِيَةُ يَعْنِي ابْنَ صَالِحٍ عَنْ أَبِي الزَّاهِرِيَّةِ عَنْ كَثِيرِ بْنِ مُرَّةَ عَنْ نُعَيْمِ بْنِ هَمَّارٍ الْغَطَفَانِيِّ أَنَّهُسَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَالَ اللَّهُ عَزَّ وَجَلَّ يَا ابْنَ آدَمَ لَا تَعْجِزْ عَنْ أَرْبَعِ رَكَعَاتٍ مِنْ أَوَّلِ النَّهَارِ أَكْفِكَ آخِرَهُ",
                "id": "Telah menceritakan kepada kami ['Abdur Rahman bin Mahdi] telah menceritakan kepada kami [Mu'awiyah bin Shalih] dari [Abu Az Zahiriyyah] dari [Katsir bin Murrah] dari [Nu'aim bin Hammar Al Ghothofani] bahwa ia mendengar Rasulullah Shallallahu'alaihiWasallam bersabda; \"Allah Azzawajalla berfirman; 'Hai anak cucu Adam! Jangan kau lemah untuk melaksanakan empat rakaat di permulaan siang, niscaya Aku mencukupimu pada sore harinya'.\""
            },
            {
                "number": 3242,
                "arab": "حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا سَعِيدٌ يَعْنِي ابْنَ عَبْدِ الْعَزِيزِ حَدَّثَنَا مَكْحُولٌ عَنْ نُعَيْمِ بْنِ هَمَّارٍ الْغَطَفَانِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُ عَزَّ وَجَلَّ يَا ابْنَ آدَمَ لَا تَعْجِزْ عَنْ أَرْبَعِ رَكَعَاتٍ مِنْ أَوَّلِ النَّهَارِ أَكْفِكَ آخِرَهُ",
                "id": "Telah menceritakan kepada kami [Al Walid bin Muslim] telah menceritakan kepada kami [Sa'id bin 'Abdul 'Aziz] telah menceritakan kepada kami [Makhul] dari [Nu'aim bin Hammar Al Ghothofani] berkata; Rasulullah Shallallahu'alaihiWasallam bersabda; \"Allah Azzawajalla berfirman; 'Hai anak cucu Adam! Janganlah kau malas melaksanakan empat rakaat di permulaan siang niscaya Aku mencukupimu pada sore harinya'.\""
            },
            {
                "number": 3243,
                "arab": "حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو حَدَّثَنَا أَبُو زَيْدٍ يَعْنِي ثَابِتَ بْنَ يَزِيدَ عَنْ بَرْدٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ مَكْحُولٍ عَنِ ابْنِ مُرَّةَ عَنْ قَيْسٍ الْجُذَامِيِّ عَنْ نُعَيْمٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ يَا ابْنَ آدَمَ صَلِّ لِي أَرْبَعَ رَكَعَاتٍ أَوَّلَ النَّهَارِ أَكْفِكَ آخِرَهُ",
                "id": "Telah menceritakan kepada kami [Mu'awiyah bin 'Amr] telah menceritakan kepada kami [Abu Zaid Tsabit bin Yazid] dari [Bard] dari [Sulaiman bin Musa] dari [Makhul] dari [Ibnu Murrah] dari [Qais Al Judzami] dari [Nu'aim] dari Rasulullah Shallallahu'alaihiWasallam bahwa beliau bersabda; \"Hai anak cucu Adam! sholatlah untukKu empat rakaat dipermulaan siang untukku, nicaya aku menukupimu pada sore harinya.\""
            },
            {
                "number": 3244,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ وَعَبْدُ الصَّمَدِ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ عَنْ مَكْحُولٍ عَنْ كَثِيرِ بْنِ مُرَّةَ الْحَضْرَمِيِّ عَنْ نُعَيْمِ بْنِ هَمَّارٍ أَنَّهُسَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَالَ رَبُّكُمْ عَزَّ وَجَلَّ صَلِّ لِي يَا ابْنَ آدَمَ أَرْبَعًا فِي أَوَّلِ النَّهَارِ أَكْفِكَ آخِرَهُ",
                "id": "Telah menceritakan kepada kami [Abu An Nadhr] dan ['Abdush Shamad] berkata; Telah menceritakan kepada kami [Muhammad bin Rosyid] dari [Makhul] dari [Katsir bin Murrah Al Hadhromi] dari [Nua'im bin Hammar] bahwa ia mendengar Rasulullah Shallallahu'alaihiWasallam bersabda; \"Rabb kalian Azzawajalla berfirman; 'Hai anak cucu Adam! sholatlah untukKu empat rakaat dipermulaan siang niscaya Aku mencukupimu pada sore harinya'.\""
            },
            {
                "number": 3245,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ أَخْبَرَنِي سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ عَنْ مَكْحُولٍ عَنِ ابْنِ مُرَّةَ عَنْ نُعَيمِ بْنِ هَمِّارٍ الْغَطَفَانِيِّ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَالَ اللَّهُ عَزَّ وَجَلَّ يَا ابْنَ آدَمَ صَلِّ لِي أَرْبَعَ رَكَعَاتٍ مِنْ أَوَّلِ النَّهَارِ أَكْفِكَ آخِرَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ishaq] Telah mengkhabarkan kepadaku [Sa'id bin 'Abdul 'Aziz] dari [Makhul] dari [Ibnu Murrah] dari [Nua'im bin Hammar Al Ghothofani] berkata; Aku mendengar Nabi Shallallahu'alaihiWasallam bersabda; \"Hai anak cucu Adam! sholatlah untukKu empat rakaat di permulaan siang niscaya Aku mencukupimu pada sore harinya'.\""
            },
            {
                "number": 3246,
                "arab": "حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ حَدَّثَنَا مُعَاوِيَةُ عَنْ أَبِي الزَّاهِرِيَّةِ عَنْ كَثِيرِ بْنِ مُرَّةَ عَنْ نُعَيْمِ بْنِ هَمَّارٍ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ ابْنَ آدَمَ لَا تَعْجِزْ عَنْ أَرْبَعِ رَكَعَاتٍ أَوَّلَ النَّهَارِ أَكْفِكَ آخِرَهُ",
                "id": "Telah menceritakan kepada kami [Hammad bin Khalid] telah menceritakan kepada kami [Mu'awiyah] dari [Abu Az Zahiriyyah] dari [Katsir bin Murrah] dari [Nu'aim bin Hammar] berkata; Aku mendengar Nabi Shallallahu'alaihiWasallam bersabda; \"Hai anak cucu Adam! Janganlah kau malas untuk melaksanakan empat rakaat di permulaan siang niscaya Aku mencukupimu di akhir siang'.\""
            },
            {
                "number": 3247,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ الدِّمَشْقِيُّ حَدَّثَنَا مَكْحُولٌ عَنْ كَثِيرِ بْنِ مُرَّةَ الْحَضْرَمِيِّ عَنْ نُعَيْمِ بْنِ هَمَّارٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ رَبُّكُمْ تَبَارَكَ وَتَعَالَى ابْنَ آدَمَ صَلِّ لِي أَرْبَعَ رَكَعَاتٍ أَوَّلَ النَّهَارِ أَكْفِكَ آخِرَهُلَيْسَ بِالشَّامِ رَجُلٌ أَصَحُّ حَدِيثًا مِنْ سَعِيدِ بْنِ عَبْدِ الْعَزِيزِ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id, budak Bani Hasyim] telah menceritakan kepada kami [Muhammad bin Rasyid Ad Dimasyqi] telah menceritakan kepada kami [Makhul] dari [Katsir bin Murrah Al Hadhromi] dari [Nu'aim bin Hammar] bahwa Rasulullah Shallallahu'alaihiWasallam bersabda; \"Rabb kalian berfirman, 'Hai anak cucu Adam! sholatlah untukKu empat rakaat di permulaan siang niscaya Aku mencukupimu di akhir siang'.\" Di Syam tidak ada seorang pun yang haditsnya lebih shahih melebihi Sa'id bin 'Abdul 'Aziz."
            },
            {
                "number": 3248,
                "arab": "حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ عَنْ بَحِيرِ بْنِ سَعْدٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ كَثِيرِ بْنِ مُرَّةَ عَنْ نُعَيْمِ بْنِ هَمَّارٍأَنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الشُّهَدَاءِ أَفْضَلُ قَالَ الَّذِينَ إِنْ يُلْقَوْا فِي الصَّفِّ يَلْفِتُونَ وُجُوهَهُمْ حَتَّى يُقْتَلُوا أُولَئِكَ يَنْطَلِقُونَ فِي الْغُرَفِ الْعُلَى مِنْ الْجَنَّةِ وَيَضْحَكُ إِلَيْهِمْ رَبُّهُمْ وَإِذَا ضَحِكَ رَبُّكَ إِلَى عَبْدٍ فِي الدُّنْيَا فَلَا حِسَابَ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Al Hakam bin Nafi'] telah menceritakan kepada kami [Isma'il bin 'Ayyasy] dari [Bahir bin Sa'ad] dari [Khalid bin Ma'dan] dari [Katsir bin Murrah] dari [Nu'aim bin Hammar] bahwa seseorang bertanya kepada Nabi Shallallahu'alaihiwasallam; 'Siapa syuhada yang paling utama? Rasulullah Shallallahu'alaihiWasallam bersabda; \"Orang-orang yang bila masuk ke barisan perang mereka memfokuskan pandangan mereka hingga terbunuh, mereka itulah orang-orang yang pergi menuju kamar-kamar disurga yang tinggi, Rabb mereka tertawa kepada mereka. Dan bila Rabbmu tertawa kepada seorang hamba didunia, maka ia tidak dihisab.\""
            },
            {
                "number": 3249,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ وَسَمِعْتُهُ أَنَا مِنْ ابْنِ أَبِي شَيْبَةَ بِالْكُوفَةِ وَقَالَ لَنَا فِيهِ ابْنُ أَبِي شَيْبَةَ عَنِ الزُّهْرِيِّ وَأَمَّا أَبِي فَحَدَّثَنَاهُ عَنْهُ وَلَمْ يَذْكُرْ الزُّهْرِيَّ وَحَدَّثَنَاهُ بِالْكُوفَةِ جَعَلَهُ لَنَا عَنْ الزُّهْرِيِّ ثُمَّ رَجَعَ إِلَى حَدِيثِ أَبِي حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ عَنْ إِبْرَاهِيمَ بْنِ إِسْمَاعِيلَ أَخْبَرَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَهُ وَحْدَهُ عَيْنًا إِلَى قُرَيْشٍ قَالَ فَجِئْتُ إِلَى خَشَبَةِ خُبَيْبٍ وَأَنَا أَتَخَوَّفُ الْعُيُونَ فَرَقَيْتُ فِيهَا فَحَلَلْتُ خُبَيْبًا فَوَقَعَ إِلَى الْأَرْضِ فَانْتَبَذْتُ غَيْرَ بَعِيدٍ ثُمَّ الْتَفَتُّ فَلَمْ أَرَ خُبَيْبًا وَلَا كَأَنَّمَا ابْتَلَعَتْهُ الْأَرْضُ فَلَمْ يُرَ لِخُبَيْبٍ أَثَرٌ حَتَّى السَّاعَةِ",
                "id": "Telah menceritakan kepada kami ['Abdullah bin Muhammad bin Abu Syaibah] dan saya mendengar dari Ibnu Abu Syaibah di Kufah. Ibnu Abu Syaibah berkata kepada kami dari [Az Zuhri] sementara ayahku, aku (Ibnu Abi Syaibah) menceritakan kepadanya dari 'Abdullah tapi Az Zuhri tidak menyebutkan dan kami menceritakan kepadanya (Abu Syaibah) di Kufah, ia menceritakan kepada kami dari Az Zuhri kemudian kembali ke hadits ayahku; Telah menceritakan kepada kami [Ja'far bin 'Aun] dari [Ibrahim bin Isma'il] telah mengkhabarkan kepadaku [Ja'far bin 'Amr bin Umaiyah] dari [ayahnya] bahwa Nabi Shallallahu'alaihi Wasallam mengutusnya (Ja'far) seorang diri sebagai mata-mata ke Quraisy. Ja'far berkata; Saya mendatangi rumah kayu milik Khubaib dan saya mengkhawatirkan adanya mata-mata, saya naik dan tinggal dikediaman Khubaib. Ia jatuh ke bawah lalu aku (Ja'far) meloncat tidak jauh lalu aku menoleh, saya tidak melihat Khubaib atau sepertinya sudah ditelan bumi. Tidak diketahui jejak Khubaib hingga saat ini."
            },
            {
                "number": 3250,
                "arab": "حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا عَلِيٌّ عَنْ يَحْيَى عَنْ أَبِي سَلَمَةَ أَخْبَرَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ عَنْ أَبِيهِ أَنَّهُرَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْسَحُ عَلَى الْخُفَّيْنِ",
                "id": "Telah menceritakan kepada kami [Abu 'Amir] telah menceritakan kepada kami ['Ali] dari Yahya dari [Abu Salamah] telah mengabarkan kepadaku [Ja'far bin 'Amr bin Umaiyah] dari [ayahnya] bahwa ia melihat Nabi Shallallahu'alaihiWasallam membasuh diatas dua sepatu."
            },
            {
                "number": 3251,
                "arab": "حَدَّثَنَا أَبُو عَامِرٍ حَدَّثَنَا فُلَيْحٌ عَنِ الزُّهْرِيِّ حَدَّثَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ عَنْ أَبِيهِ أَنَّهُرَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَلَ عُضْوًا فِي الْمُصَلَّى وَلَمْ يَتَوَضَّأْ",
                "id": "Telah menceritakan kepada kami [Abu 'Amir] telah menceritakan kepada kami [Fulaih] dari [Az Zuhri] telah menceritakan kepadaku [Ja'far bin 'Amr bin Umaiyah] dari [ayahnya] bahwa ia melihat Nabi Shallallahu'alaihiWasallam memakan daging di musholla dan tidak berwudhu."
            },
            {
                "number": 3252,
                "arab": "حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ حَدَّثَنَا حَيْوَةُ أَخْبَرَنَا عَيَّاشُ بْنُ عَبَّاسٍ أَنَّ كُلَيْبَ بْنَ صُبْحٍ حَدَّثَهُ أَنَّ الزِّبْرِقَانَ حَدَّثَهُ عَنْ عَمِّهِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَعْضِ أَسْفَارِهِ فَنَامَ عَنْ صَلَاةِ الصُّبْحِ حَتَّى طَلَعَتْ الشَّمْسُ لَمْ يَسْتَيْقِظُوا وَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَدَأَ بِالرَّكْعَتَيْنِ فَرَكَعَهُمَا ثُمَّ أَقَامَ الصَّلَاةَ فَصَلَّى",
                "id": "Telah menceritakan kepada kami [Abu 'Abdur Rahman] telah menceritakan kepada kami [Haiwah] telah mengkhabarkan kepada kami ['Ayyasy bin 'Abbas] bahwa [Kulaib bin Shubh] menceritakan padanya bahwa [Az Zibriqon] menceritakan padanya dari [pamannya -'Amr bin Umaiyah Adh Dhamiri-] berkata; Kami bersama Rasulullah Shallallahu'alaihiWasallam dalam salah satu perjalanan beliau. Beliau tertidur dan tidak sholat shubuh hingga matahari terbit, mereka tidak bangun. Rasulullah Shallallahu'alaihiWasallam memulai sholat sunnah dua rakaat, lalu sholat diiqamati kemudian beliau sholat."
            },
            {
                "number": 3253,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو الْأَوْزَاعِيُّ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ الْيَمَانِيُّ عَنْ أَبِي سَلَمَةَ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ عَنْ أَبِيهِ أَنَّهُرَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَسَحَ عَلَى الْخُفَّيْنِ وَالْعِمَامَةِ",
                "id": "Telah menceritakan kepada kami [Abu Al Mughirah] telah menceritakan kepada kami ['Abdur Rahman bin 'Amr Al Auza'i] telah menceritakan kepadaku [Yahya bin Abu Katsir Al Yamani] dari [Abu Salamah] dari [Ja'far bin 'Amr bin Umaiyah Adh Dhamri] dari [ayahnya], bahwa ia melihat Rasulullah Shallallahu'alaihiWasallam mengusap bagian atas dua sepatu dan selendang."
            },
            {
                "number": 3254,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ حَدَّثَنَا الْأَوْزَاعِيُّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْسَحُ عَلَى الْخُفَّيْنِ وَالْخِمَارِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Mush'ab] telah menceritakan kepada kami [Al Auza'i] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Ja'far bin 'Amr bin Umaiyah Adh Dhamri] dari [ayahnya] berkata; Aku melihat Rasulullah Shallallahu'alaihiWasallam mengusap bagian atas dua sepatunya dan tudung kepalanya."
            },
            {
                "number": 3255,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ حَدَّثَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْسَحُ عَلَى الْخُفَّيْنِ",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [ayahku] dari [Ibnu Ishaq] telah menceritakan kepadaku [Ja'far bin 'Amr bin Umaiyah] dari [ayahnya] berkata; Aku melihat Rasulullah Shallallahu'alaihiWasallam mengusap bagian atas dua sepatunya."
            },
            {
                "number": 3256,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنْ صَالِحٍ قَالَ ابْنُ شِهَابٍ حَدَّثَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ أَنَّ أَبَاهُ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْتَزُّ مِنْ كَتِفِ شَاةٍ فَدُعِيَ إِلَى الصَّلَاةِ فَطَرَحَ السِّكِّينَ وَلَمْ يَتَوَضَّأْ",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [ayahku] dari [Shalih] berkata [Ibnu Syihab] telah menceritakan kepadaku [Ja'far bin 'Amr bin Umaiyah] bahwa [ayahnya] berkata; Aku melihat Rasulullah Shallallahu'alaihiWasallam memotong ketiak kambing kemudian sholat diserukan, beliau melempar pisau dan tidak berwudhu."
            }
        ]
    }
}