{
    "status": true,
    "data": {
        "start": 2517,
        "end": 2664,
        "total": 148,
        "book": "ahmad",
        "hadits": [
            {
                "number": 2517,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ عِمْرَانَ بْنِ الْحُصَيْنِأَنَّ رَجُلًا مِنْ الْأَنْصَارِ أَعْتَقَ رُءُوسًا سِتَّةً عِنْدَ مَوْتِهِ وَلَمْ يَكُنْ لَهُ مَالٌ غَيْرُهُمْ فَبَلَغَ ذَلِكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَغْلَظَ لَهُ فَدَعَا بِهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَقْرَعَ بَيْنَهُمْ فَأَعْتَقَ اثْنَيْنِ وَرَدَّ أَرْبَعَةً فِي الرِّقِّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Al Hasan] dari ['Imran bin Hushain] bahwa ada seorang dari Anshar membebaskan enam budaknya ketika hendak meninggal dunia, namun ia tidak memiliki harta selain budak tersebut. Ketika hal itu dilaporkan pada Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah menyalahkannya dan memanggil seluruh budak itu, kemudian budak-budak tersebut diundi hingga dua orang budak menjadi merdeka sedang empat lainnya tetap menjadi budak.\""
            },
            {
                "number": 2518,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ حَدَّثَنَا الْحَسَنُ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ رَجُلًا أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ ابْنِي مَاتَ فَمَا لِي مِنْ مِيرَاثِهِ قَالَ لَكَ السُّدُسُ قَالَ فَلَمَّا أَدْبَرَ دَعَاهُ قَالَ لَكَ آخَرُ فَلَمَّا أَدْبَرَ دَعَاهُ قَالَ إِنَّ السُّدُسَ الْآخَرَ طُعْمَةٌ",
                "id": "Telah menceritakan kepada kami [Bahz], telah menceritakan kepada kami [Hammam], telah menceritakan kepada kami [Qatadah] dari [Al Hasan] dari ['Imran bin Hushain] bahwa seseorang datang menemui Rasulullah shallallahu 'alaihi wasallam sambil berkata; \"Anakku telah meninggal, lantas berapa bagiankah yang aku dapatkan dari harta peninggalannya?.\" Beliau menjawab: \"Kamu mendapatkan seperenam.\" Ketika dia beranjak pulang, beliau memanggilnya lagi lalu bersabda: \"Bagimu ada yang lain (sisa).\" Ketika dia beranjak pulang, beliau memanggilnya lagi lalu bersabda: \"Sesungguhnya seperenam yang lain merupakan harta pemberian.\""
            },
            {
                "number": 2519,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ حَدَّثَنَا قَتَادَةُ عَنْ أَبِي نَضْرَةَ عَنْ أَبِي سَعِيدٍ أَوْ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ أَنَّهُ قَالَأَشْهَدُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ نَهَانَا عَنْ لُبْسِ الْحَرِيرِ وَعَنْ الشُّرْبِ فِي الْحَنَاتِمِ",
                "id": "Telah menceritakan kepada kami [Bahz], telah menceritakan kepada kami [Aban bin Yazid], telah menceritakan kepada kami [Qatadah] dari [Abu Nadlrah] dari [Abu Sa'id] atau dari ['Imran bin Hushain] bahwa ia berkata; \"Aku bersaksi atas nama Rasulullah shallallahu 'alaihi wasallam bahwa beliau melarang kita memakai pakaian sutera dan meminum dari hanatim.\" "
            },
            {
                "number": 2520,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا قَتَادَةُ عَنْ مُطَرِّفٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي عَلَى الْحَقِّ ظَاهِرِينَ عَلَى مَنْ نَاوَأَهُمْ حَتَّى يَأْتِيَ أَمْرُ اللَّهِ تَبَارَكَ وَتَعَالَى وَيَنْزِلَ عِيسَى ابْنُ مَرْيَمَ عَلَيْهِ السَّلَام",
                "id": "Telah menceritakan kepada kami [Bahz], telah menceritakan kepada kami [Hammad bin Salamah] telah mengabarkan kepada kami [Qatadah] dari [Mutharrif] dari ['Imran bin Hushain] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekelompok dari umatku akan senantiasa berada diatas kebenaran dan selalu menang terhadap orang yang memusuhi mereka, hingga datang urusan Allah tabaraka wata'ala dan turunnya Isa bin Maryam 'alaihissalam.\""
            },
            {
                "number": 2521,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا عَوْفٌ عَنْ أَبِي رَجَاءٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ وَاطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَحَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا سَلْمُ بْنُ زَرِيرٍ حَدَّثَنَا أَبُو رَجَاءٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اطَّلَعْتُ فَذَكَرَ مِثْلَهُ حَدَّثَنَا الْخَفَّافُ أَخْبَرَنَا سَعِيدٌ عَنْ أَبِي رَجَاءٍ عَنِ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami ['Auf] dari [Abu Raja'] dari ['Imran bin Hushain] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku melongok keneraka, maka aku melihat kebanyakan penghuninya adalah wanita. Dan aku melongok kesurga, maka aku melihat kebanyakan penghuninya adalah orang-orang fakir.\" Telah berkata kepada kami [Abdusshamad] telah berkata kepada kami [Salam bin Zarir] telah berkata kepada kami [Abu Raja`] dari ['Imran bin Hushain] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku melongok…-seperti hadits diatas-. Telah menceritakan kepada kami [Al Khaffaf] telah mengabarkan kepada kami [Sa'id] dari [Abu Raja'] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam seperti hadits di atas."
            },
            {
                "number": 2522,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي قَزَعَةَ عَنِ الْحَسَنِ عَنْ عِمْرَانَ بْنِ حُصَيْنٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا جَلَبَ وَلَا جَنَبَ وَلَا شِغَارَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah] dari [Abu Qaza'ah] dari [Al Hasan] dari ['Imran bin Hushain] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada jalb, tidak ada janab dan tidak ada nikah syighar.\" "
            },
            {
                "number": 2523,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ حَدَّثَنِي شِبْلُ بْنُ عَبَّادٍ وَابْنُ أَبِي بُكَيْرٍ يَعْنِي يَحْيَى بْنَ أَبِي بُكَيْرٍ حَدَّثَنَا شِبْلُ بْنُ عَبَّادٍ الْمَعْنَى قَالَ سَمِعْتُ أَبَا قَزَعَةَ يُحَدِّثُ عَمْرَو بْنَ دِيْنَارٍ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ الْبَهْزِيِّ عَنْ أَبِيهِ أَنَّهُقَالَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي حَلَفْتُ هَكَذَا وَنَشَرَ أَصَابِعَ يَدَيْهِ حَتَّى تُخْبِرَنِي مَا الَّذِي بَعَثَكَ اللَّهُ تَبَارَكَ وَتَعَالَى بِهِ قَالَ بَعَثَنِي اللَّهُ تَبَارَكَ وَتَعَالَى بِالْإِسْلَامِ قَالَ وَمَا الْإِسْلَامُ قَالَ شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ وَتُقِيمُ الصَّلَاةَ وَتُؤْتِي الزَّكَاةَ أَخَوَانِ نَصِيرَانِ لَا يَقْبَلُ اللَّهُ عَزَّ وَجَلَّ مِنْ أَحَدٍ تَوْبَةً أَشْرَكَ بَعْدَ إِسْلَامِهِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَا حَقُّ زَوْجِ أَحَدِنَا عَلَيْهِ قَالَ تُطْعِمُهَا إِذَا أَكَلْتَ وَتَكْسُوهَا إِذَا اكْتَسَيْتَ وَلَا تَضْرِبْ الْوَجْهَ وَلَا تُقَبِّحْ وَلَا تَهْجُرْ إِلَّا فِي الْبَيْتِ ثُمَّ قَالَ هَاهُنَا تُحْشَرُونَ هَاهُنَا تُحْشَرُونَ هَاهُنَا تُحْشَرُونَ ثَلَاثًا رُكْبَانًا وَمُشَاةً وَعَلَى وُجُوهِكُمْ تُوفُونَ يَوْمَ الْقِيَامَةِ سَبْعِينَ أُمَّةً أَنْتُمْ آخِرُ الْأُمَمِ وَأَكْرَمُهَا عَلَى اللَّهِ تَبَارَكَ وَتَعَالَى تَأْتُونَ يَوْمَ الْقِيَامَةِ وَعَلَى أَفْوَاهِكُمْ الْفِدَامُ أَوَّلُ مَا يُعْرِبُ عَنْ أَحَدِكُمْ فَخِذُهُ قَالَ ابْنُ أَبِي بُكَيْرٍ فَأَشَارَ بِيَدِهِ إِلَى الشَّامِ فَقَالَ إِلَى هَاهُنَا تُحْشَرُونَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Harits], telah menceritakan padaku [Syibl bin 'Abbad] dan [Ibnu Abu Bukair yaitu Yahya bin Abu Bukair], telah menceritakan kepada kami [Syibl bin 'Abbad] secara makna, ia berkata; Aku mendengar [Abu Qaza'ah] menceritakan kepada 'Amru bin Dinar dari [Hakim bin Mu'awiyah Al Bahzi] dari [Ayahnya] bahwa ia berkata pada Nabi Shalallahu 'alaihi wasallam; \"Sungguh aku telah bersumpah seperti ini, -sambil merekahkan jarinya- hingga engkau mengabariku untuk apa Allah Tabaraka wa Ta'ala mengutusmu?.\" Beliau bersabda: \"Allah Tabaraka Wata'ala mengutusku dengan Islam.\" Mu'awiyah bertanya; \"Apakah Islam itu?.\" Beliau menjawab: \"Syahadat Laa Ilaaha Illallah wa Anna Muhammadan 'Abduhu Wa Rasuluhu (bersaksi bahwa tiada Ilah kecuali Allah dan Muhammad adalah hamba dan utusan-Nya), kamu mendirikan sholat, menunaikan zakat, ia merupakan dua hal yang selalu bersambung, dan Allah Azza Wa Jalla tidak akan menerima taubat seorang hamba yang menyekutukan-Nya setelah ia masuk Islam.\" Mu'awiyah berkata; Aku bertanya pada Rasulullah shallallahu 'alaihi wasallam; \"Wahai Rasulullah, apa hak seorang istri terhadap suami?.\" Beliau bersabda: \"Memberinya makan bila kamu makan, memberinya pakaian bila kamu berpakaian, jangan kamu pukul wajahnya, jangan kamu jelekkan dan jangan kamu menghajr (memisahkan diri dari kamar tidur) kecuali di satu rumah.\" Kemudian beliau melanjutkan: \"Di sinilah kalian akan dikumpulkan, di sinilah kalian akan dikumpulkan dan di sinilah kalian akan di kumpulkan -sebanyak tiga kali-, dalam keadaan berkendaraan dan tak berjalan kaki dan kalian akan dikumpulkan di hari kiamat selepas kematian kalian di antara tujuh puluh umat, sedangkan kalian adalah umat yang paling terakhir dari mereka, sementara kalian adalah ummat yang dimuliakan disisi Allah Tabaraka Wata'ala. Kalian datang di hari kiamat dalam keadaan mulut kalian terkunci, dan yang pertama kali berbicara adalah kaki-kaki kalian (paha).\" Ibnu Abu Bukair berkata; Lalu beliau menunjukkan dengan isyarat tangannya ke arah Syam sambil bersabda: \"Kesanalah kalian akan dikumpulkan.\""
            },
            {
                "number": 2524,
                "arab": "حَدَّثَنَا مُهَنَّأُ بْنُ عَبْدِ الْحَمِيدِ أَبُو شِبْلٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي قَزَعَةَ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ رَجُلًا كَانَ فِيمَنْ كَانَ قَبْلَكُمْ رَغَسَهُ اللَّهُ تَبَارَكَ وَتَعَالَى مَالًا وَوَلَدًا حَتَّى ذَهَبَ عَصْرٌ وَجَاءَ عَصْرٌ فَلَمَّا حَضَرَتْهُ الْوَفَاةُ قَالَ أَيْ بَنِيَّ أَيَّ أَبٍ كُنْتُ لَكُمْ قَالُوا خَيْرَ أَبٍ قَالَ فَهَلْ أَنْتُمْ مُطِيعِيَّ قَالُوا نَعَمْ قَالَ انْظُرُوا إِذَا مُتُّ أَنْ تُحَرِّقُونِي حَتَّى تَدَعُونِي فَحْمًا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَفَعَلُوا ذَلِكَ ثُمَّ اهْرُسُونِي بِالْمِهْرَاسِ يُومِئُ بِيَدِهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَفَعَلُوا وَاللَّهِ ذَلِكَ ثُمَّ اذْرُونِي فِي الْبَحْرِ فِي يَوْمِ رِيحٍ لَعَلِّي أَضِلُّ اللَّهَ تَبَارَكَ وَتَعَالَى قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَفَعَلُوا وَاللَّهِ ذَلِكَ فَإِذَا هُوَ فِي قَبْضَةِ اللَّهِ تَبَارَكَ وَتَعَالَى فَقَالَ يَا ابْنَ آدَمَ مَا حَمَلَكَ عَلَى مَا صَنَعْتَ قَالَ أَيْ رَبِّ مَخَافَتُكَ قَالَ فَتَلَافَاهُ اللَّهُ تَبَارَكَ وَتَعَالَى بِهَا",
                "id": "Telah menceritakan kepada kami [Muhanna` bin Abdul Hamid Abu Syibl], telah menceritakan kepada kami [Hammad bin Salamah] dari [Abu Qaza'ah] dari [Hakim bin Mu'awiyah] dari [Ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya seorang lelaki dari kaum sebelum kalian ada yang Allah berikan kepadanya harta dan anak yang banyak hingga generasi silih berganti. Ketika hendak meninggal, laki-laki berkata; 'Wahai anak-anakku, menurut kalian, aku ini ayah macam apa?.' Mereka berkata; 'Ayah adalah orang yang terbaik!.' Dia berkata lagi; 'Apakah kalian akan mentaatiku?.' Mereka berkata; 'Ya!.' Dia bertanya lagi; 'Nanti kalau aku telah meninggal, bakarlah aku dan biarkanlah aku hingga menjadi arang.' -Rasulullah shallallahu 'alaihi wasallam bersabda: \"Maka anak-anaknya pun melakukan wasiat ayahnya.\"- (kata laki-laki itu selanjutnya) Kemudian tumbuklah arangku dengan alat penumbuk.' -seraya memberi isyarat dengan tangannya, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Lalu merekapun melakukannya.\"- 'Kemudian buanglah aku ke tengah lautan di hari-hari yang anginnya kencang agar Allah Tabaraka Wa Ta'ala tidak dapat menemukanku.' Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Allah, merekapun melakukan perintah itu. Ternyata laki-laki itu sudah berada dalam genggaman Allah Tabaraka Wata'ala. Maka Allah berkata kepadanya: 'Wahai anak Adam, apakah yang membuatmu melakukan demikian (menyuruh membakar diri)?.' Dia menjawab; 'Ya Rabb-ku, karena takut kepada-Mu!.' Maka Allah Tabaraka Wa Ta'ala mengampuninya.\""
            },
            {
                "number": 2525,
                "arab": "حَدَّثَنَا يَزِيدُ أَخْبَرَنَا شُعْبَةُ عَنْ أَبِي قَزَعَةَ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَأَلَهُ رَجُلٌ مَا حَقُّ الْمَرْأَةِ عَلَى الزَّوْجِ قَالَ تُطْعِمُهَا إِذَا طَعِمْتَ وَتَكْسُوهَا إِذَا اكْتَسَيْتَ وَلَا تَضْرِبْ الْوَجْهَ وَلَا تُقَبِّحْ وَلَا تَهْجُرْ إِلَّا فِي الْبَيْتِ",
                "id": "Telah menceritakan kepada kami [Yazid], telah mengabarkan pada kami [Syu'bah], dari [Abu Qaza'ah] dari [Hakim bin Mu'awiyah] dari [Ayahnya] dari Nabi Shalallahu 'alaihi wasallam, Seseorang bertanya kepada beliau; \"Apa hak seorang istri dari suaminya?.\" beliau menjawab: \"Kamu memberinya makan sebagaimana kamu makan, memberinya pakaian sebagaimana kamu berpakaian, tidak memukul wajahnya, tidak menjelek-jelekkannya dan tidak menghajrnya (memisahkan dari tempat tidur) kecuali di dalam rumah.\""
            },
            {
                "number": 2526,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا أَبُو قَزَعَةَ سُوَيْدُ بْنُ حُجَيْرٍ الْبَاهِلِيُّ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ عَنْ أَبِيهِأَنَّ أَخَاهُ مَالِكًا قَالَ يَا مُعَاوِيَةُ إِنَّ مُحَمَّدًا أَخَذَ جِيرَانِي فَانْطَلِقْ إِلَيْهِ فَإِنَّهُ قَدْ عَرَفَكَ وَكَلَّمَكَ قَالَ فَانْطَلَقْتُ مَعَهُ فَقَالَ دَعْ لِي جِيرَانِي فَإِنَّهُمْ قَدْ كَانُوا أَسْلَمُوا فَأَعْرَضَ عَنْهُ فَقَامَ مُتَمَعِّطًا فَقَالَ أَمْ وَاللَّهِ لَئِنْ فَعَلْتَ إِنَّ النَّاسَ لَيَزْعُمُونَ أَنَّكَ تَأْمُرُ بِالْأَمْرِ وَتَخْلُفُ إِلَى غَيْرِهِ وَجَعَلْتُ أَجُرُّهُ وَهُوَ يَتَكَلَّمُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا تَقُولُ فَقَالُوا إِنَّكَ وَاللَّهِ لَئِنْ فَعَلْتَ ذَلِكَ إِنَّ النَّاسَ لَيَزْعُمُونَ أَنَّكَ لَتَأْمُرُ بِالْأَمْرِ وَتُخَالِفُ إِلَى غَيْرِهِ قَالَ فَقَالَ أَوَ قَدْ قَالُوهَا أَوْ قَائِلُهُمْ فَلَئِنْ فَعَلْتُ ذَاكَ وَمَا ذَاكَ إِلَّا عَلَيَّ وَمَا عَلَيْهِمْ مِنْ ذَلِكَ مِنْ شَيْءٍ أَرْسِلُوا لَهُ جِيرَانَهُ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammad bin Salamah], telah mengabarkan pada kami [Abu Qaza'ah Suwaid bin Hujair Al Bahili] dari [Hakim bin Mu'awiyah] dari [Ayahnya] bahwa saudaranya Malik berkata kepadanya; \"Wahai Muawiyah, sesungguhnya Muhammad telah menawan tetanggaku maka marilah kita pergi karena dia mengenalmu dan telah berbicara kepadamu, \" Mu'awiyah berkata; \"Lalu aku pergi bersamanya, (sesampainya di hadapan Rasulullah Shallalahu 'alaihi wasallam) Malik berkata; \"Biarkanlah tetanggaku bersamaku karena dia telah masuk Islam sebelumnya!.\" Akan tetapi beliau menolaknya, maka Malik berdiri seraya menghunuskan pedang, sambil berkata; \"Demi Allah, sungguh jika kamu tetap melakukan itu, orang-orang pasti akan menganggap bahwa kamu memerintahkan yang ma'ruf tetapi kamu sendiri menyelisihinya.\" Maka aku menariknya, namun dia tetap berbicara. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa yang kamu katakan?.\" Mereka menjawab; \"Demi Allah, sungguh jika kamu tetap melakukan itu, orang-orang pasti akan menganggap bahwa kamu memerintahkan yang ma'ruf tetapi kamu sendiri menyelisihinya.\" Beliau pun bersabda: \"Apakah mereka telah mengatakan itu kalau aku melakukannya? Dan itu bukan kewajibanku dan mereka juga tidak dipaksa sedikitpun, kerimlah tetangganya kepadanya (maksudnya melepaskan)!.\""
            },
            {
                "number": 2527,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنِ الْجُرَيْرِيِّ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَأَنْتُمْ تُوفُونَ سَبْعِينَ أُمَّةً أَنْتُمْ خَيْرُهَا وَأَكْرَمُهَا عَلَى اللَّهِ تَبَارَكَ وَتَعَالَى",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammad bin Salamah] dari [Al Jurari] dari [Hakim bin Mu'awiyah] dari [Ayahnya] bahwa Rasulullah Shallalahu 'alaihi wasallam bersabda: \"Sungguh kalian sebanding dengan tujuh puluh umat, sedang kalian adalah yang terbaik dan mulia diantara mereka di hadapan Allah Tabaraka Wa Ta'ala.\""
            },
            {
                "number": 2528,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ أَخْبَرَنَا بَهْزُ بْنُ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ أَبَاهُ أَوْ عَمَّهَ قَامَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ جِيرَانِي بِمَ أُخِذُوا فَأَعْرَضَ عَنْهُ ثُمَّ قَالَ أَخْبِرْنِي بِمَ أُخِذُوا فَأَعْرَضَ عَنْهُ فَقَالَ لَئِنْ قُلْتُ ذَاكَ إِنَّهُمْ لَيَزْعُمُونَ أَنَّكَ تَنْهَى عَنْ الْغَيِّ وَتَسْتَخْلِي بِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا قَالَ فَقَامَ أَخُوهُ أَوْ ابْنُ أَخِيهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهُ قَالَ فَقَالَ لَقَدْ قُلْتُمُوهَا أَوْ قَائِلُكُمْ وَلَئِنْ كُنْتُ أَفْعَلُ ذَلِكَ إِنَّهُ لَعَلَيَّ وَمَا هُوَ عَلَيْكُمْ خَلُّوا لَهُ عَنْ جِيرَانِهِ",
                "id": "Telah menceritakan kepada kami [Isma'il] telah mengabarkan kepada kami [Bahz bin Hakim] dari [Ayahnya] dari [kakeknya], bahwa ayah atau kakeknya pernah menemui Nabi shallallahu 'alaihi wasallam, lantas ayah atau kakeknya berujar; \"Dengan alasan apa tetanggaku ditangkap (ditahan)? Beliau kemudian berpaling darinya. Kemudian ayah atau kakeknya berujar lagi; \"Beritahukanlah kepadaku, karena alasan apa mereka ditahan?\" Beliau masih tetap berpaling. Maka ayah atau kakeknya berujar; \"Kalau aku katakan sesuatu, maka orang-orang akan beranggapan bahwa anda melarang kejahatan (penyimpangan), namun anda sendiri melakukannya.\" Lantas Nabi shallallahu 'alaihi wasallam mengucapkan sebagaimana yang beliau ucapkan. Lantas saudara atau keponakan dari ayah atau kakeknya melaporkan; \"Hai Rasulullah, ia telah berkata demikian-demikian.\" Beliau bersabda: \"Kalian atau salah seorang dari kalian telah mengomel sedemikian rupa, kalaulah aku lakukan yang demikian, itu tanggung jawabku bukan tanggung jawab kalian, dan sekarang tolong suruh ia melepaskan tetangganya.\""
            },
            {
                "number": 2529,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ عَنْ حَمَّادٍ حَدَّثَنَا أَبُو قَزَعَةَ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ عَنْ أَبِيهِ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى لَا يَقْبَلُ تَوْبَةَ عَبْدٍ كَفَرَ بَعْدَ إِسْلَامِهِ",
                "id": "Telah menceritakan kepada kami [Abu Kamil] dari [Hammad], telah menceritakan kepada kami [Abu Qaza'ah] dari [Hakim bin Mu'awiyah] dari [Ayahnya] ia berkata; Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah Tabaraka Wa Ta'ala tidak menerima taubat seseorang yang kafir (murtad) setelah keIslamannya.\""
            },
            {
                "number": 2530,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ سَأَلَهُ مَوْلَاهُ فَضْلَ مَالِهِ فَلَمْ يُعْطِهِ جُعِلَ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq], telah mengabarkan kepada kami [Ma'mar] dari [Bahz bin Hakim] dari [Ayahnya] dari [Kakeknya] bahwa ia mendengar Rasulullah Shallalahu 'alaihi wasallam bersabda: \"Barangsiapa yang budaknya meminta sedikit kelebihan hartanya, namun ia menolak, maka akan didatangkan untuknya di hari kiamat seekor ular raksasa.\""
            },
            {
                "number": 2531,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَيْلٌ لِلَّذِي يُحَدِّثُ الْقَوْمَ ثُمَّ يَكْذِبُ لِيُضْحِكَهُمْ وَيْلٌ لَهُ وَوَيْلٌ لَهُ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq], telah mengabarkan kepada kami [Ma'mar] dari [Bahz bin Hakim] dari [Ayahnya] dari [Kakeknya] ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Celakalah orang yang berbicara kemudian berbohong agar orang lain mentertawakannya, celakalah dia, celakalah dia.\""
            },
            {
                "number": 2532,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا أَبُو قَزَعَةَ الْبَاهِلِيُّ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ عَنْ أَبِيهِ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ مَا أَتَيْتُكَ حَتَّى حَلَفْتُ عَدَدَ أَصَابِعِي هَذِهِ أَنْ لَا آتِيَكَ أَرَانَا عَفَّانُ وَطَبَّقَ كَفَّيْهِ فَبِالَّذِي بَعَثَكَ بِالْحَقِّ مَا الَّذِي بَعَثَكَ بِهِ قَالَ الْإِسْلَامُ قَالَ وَمَا الْإِسْلَامُ قَالَ أَنْ يُسْلِمَ قَلْبُكَ لِلَّهِ تَعَالَى وَأَنْ تُوَجِّهَ وَجْهَكَ إِلَى اللَّهِ تَعَالَى وَتُصَلِّيَ الصَّلَاةَ الْمَكْتُوبَةَ وَتُؤَدِّيَ الزَّكَاةَ الْمَفْرُوضَةَ أَخَوَانِ نَصِيرَانِ لَا يَقْبَلُ اللَّهُ عَزَّ وَجَلَّ مِنْ أَحَدٍ تَوْبَةً أَشْرَكَ بَعْدَ إِسْلَامِهِ قُلْتُ مَا حَقُّ زَوْجَةِ أَحَدِنَا عَلَيْهِ قَالَ تُطْعِمُهَا إِذَا طَعِمْتَ وَتَكْسُوهَا إِذَا اكْتَسَيْتَ وَلَا تَضْرِبْ الْوَجْهَ وَلَا تُقَبِّحْ وَلَا تَهْجُرْ إِلَّا فِي الْبَيْتِ قَالَ تُحْشَرُونَ هَاهُنَا وَأَوْمَأَ بِيَدِهِ إِلَى نَحْوِ الشَّامِ مُشَاةً وَرُكْبَانًا وَعَلَى وُجُوهِكُمْ تُعْرَضُونَ عَلَى اللَّهِ تَعَالَى وَعَلَى أَفْوَاهِكُمْ الْفِدَامُ وَأَوَّلُ مَا يُعْرِبُ عَنْ أَحَدِكُمْ فَخِذُهُ وَقَالَ مَا مِنْ مَوْلًى يَأْتِي مَوْلًى لَهُ فَيَسْأَلُهُ مِنْ فَضْلٍ عِنْدَهُ فَيَمْنَعُهُ إِلَّا جَعَلَهُ اللَّهُ تَعَالَى عَلَيْهِ شُجَاعًا يَنْهَسُهُ قَبْلَ الْقَضَاءِ قَالَ عَفَّانُ يَعْنِي بِالْمَوْلَى ابْنَ عَمِّهِ قَالَ وَقَالَ إِنَّ رَجُلًا مِمَّنْ كَانَ قَبْلَكُمْ رَغَسَهُ اللَّهُ تَعَالَى مَالًا وَوَلَدًا حَتَّى ذَهَبَ عَصْرٌ وَجَاءَ آخَرُ فَلَمَّا احْتُضِرَ قَالَ لِوَلَدِهِ أَيَّ أَبٍ كُنْتُ لَكُمْ قَالُوا خَيْرَ أَبٍ فَقَالَ هَلْ أَنْتُمْ مُطِيعِيَّ وَإِلَّا أَخَذْتُ مَالِي مِنْكُمْ انْظُرُوا إِذَا أَنَا مُتُّ أَنْ تُحَرِّقُونِي حَتَّى تَدَعُونِي حُمَمًا ثُمَّ اهْرُسُونِي بِالْمِهْرَاسِ وَأَدَارَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدَيْهِ حِذَاءَ رُكْبَتَيْهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَفَعَلُوا وَاللَّهِ وَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ هَكَذَا ثُمَّ اذْرُونِي فِي يَوْمٍ رَاحٍ لَعَلِّي أَضِلُّ اللَّهَ تَعَالَى كَذَا قَالَ عَفَّانُ قَالَ أَبِي وَقَالَ مُهَنَّا أَبُو شِبْلٍ عَنْ حَمَّادٍ أَضِلُّ اللَّهَ فَفَعَلُوا وَاللَّهِ ذَاكَ فَإِذَا هُوَ قَائِمٌ فِي قَبْضَةِ اللَّهِ تَعَالَى فَقَالَ يَا ابْنَ آدَمَ مَا حَمَلَكَ عَلَى مَا فَعَلْتَهُ قَالَ مِنْ مَخَافَتِكَ قَالَ فَتَلَافَاهُ اللَّهُ تَعَالَى بِهَا",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammad bin Salamah], telah mengabarkan pada kami [Abu Qar'ah Al Bahili] dari [Hakim bin Mu'awiyah] dari [Ayahnya] ia berkata; Aku datang kepada Rasulullah shallallahu 'alaihi wasallam, lalu aku berkata; \"Tidaklah aku datang kepadamu kecuali aku telah bersumpah dengan beberapa jariku ini bahwa aku tidak akan datang kepadamu -'Affan memperlihatkan dan menengadahkan telapaknya- Demi dzat yang mengutusmu dengan kebenaran, dengan apakah kamu di utus?.\" Beliau menjawab: \"Dengan Islam.\" Mu'awiyah bertanya; \"Apakah Islam itu?.\" Beliau menjawab: \"Hendaknya engkau serahkan jiwamu sepenuhnya hanya pada Allah Ta'ala dan engkau menghadapkan wajahmu hanya kepada Allah saja, engkau mengerjakan sholat, menunaikan zakat, itulah dua hal yang tidak bisa dipisahkan dan Allah Azza Wa Jalla tidak akan menerima taubat seorang hamba yang menyekutukan-Nya setelah ia masuk Islam.\" Aku bertanya; \"Lalu apa hak istri terhadap kita (suami)?.\" Beliau menjawab: \"Engkau memberinya makan apabila engkau makan, memberinya pakaian apabila engkau berpakaian, jangan memukul wajah, jangan menjelekkannya dan jangan memisahkan tempat tidur kecuali dalam satu rumah.\" Beliau melanjutkan: \"Kalian akan dikumpulkan di sana, (seraya menunjukkan tangannya ke arah Syam) dalam keadaan berjalan kaki dan berkendaraan, wajah kalian akan ditampakkan semua dihadapan Allah, mulut-mulut kalian akan dikunci dan yang pertama kali akan berkomentar adalah paha (kaki-kaki) kalian.\" Beliau melanjutkan lagi: \"Dan siapa saja dari seorang budak yang meminta kelebihan dari harta tuannya, namun tuannya tidak memberinya, melainkan Allah Ta'ala akan menjadikan untuknya seekor ular besar bernama Syuja', dan Ular itu akan menghancurkannya sebelum diputuskannya perkara.\" ['Affan] seorang budak milik anak pamannya berkata; \"Sesungguhnya sebelum kalian ada seseorang yang Allah Ta'ala karuniai harta dan anak-anak, hingga zaman berganti dengan generasi setelahnya. Sewaktu ayahnya hendak meninggal, ia berkata kepada anaknya; \"Buat kalian, ayah macam apakah aku ini? Mereka berkata; 'Ayah adalah orang yang terbaik!.' Dia berkata lagi; 'Apakah kalian akan mentaatiku?, kalau tidak, maka aku akan mengambil semua hartaku dari kalian!.' 'Lihatlah oleh kalian, jika nanti aku telah meninggal dunia, maka bakarlah aku hingga diriku menjadi arang.' Kemudian tumbuklah (arangku) hingga halus dengan alat penumbuk -Rasulullah shallallahu 'alaihi wasallam sambil mendemontrasikan dengan memutar-mutar dengan kedua tangannya sejajar kedua lututnya- Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Kemudian mereka melakukan wasiat ayahnya.\" Demi Allah Nabiyullah shallallahu 'alaihi wasallam mempraktekkan dengan tangannya seperti ini, - 'Kemudian tebarkanlah (abuku) pada hari yang anginya kencang, supaya Allah Ta'ala tidak dapat menemukanku.' -demikianlah yang di katakan 'Affan, Ayahku berkata; dan Muhanna Abu Syibl mengatakan dari Hammad dengan redaksi -supaya diriku tidak dapat di temukan Allah- lalu anak-anaknya melaksanakan perintah ayahnya, demi Allah, ternyata dirinya telah berdiri tegak dalam genggaman Allah Ta'ala. Maka Allah bertanya kepadanya: 'Wahai anak Adam, apa yang membuatmu melakukan hal ini (membakar diri)?.' Lak-laki itu menjawab; 'Ya Rabb-ku, karena aku takut kepada-Mu!.' Maka Allah Ta'ala pun mengampuni perbuatannya.\""
            },
            {
                "number": 2533,
                "arab": "حَدَّثَنَا يَزِيدُ أَخْبَرَنَا الْجُرَيْرِيُّ أَبُو مَسْعُودٍ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ تَجِيئُونَ يَوْمَ الْقِيَامَةِ عَلَى أَفْوَاهِكُمْ الْفِدَامُ وَإِنَّ أَوَّلَ مَا يَتَكَلَّمُ مِنْ الْآدَمِيِّ فَخِذُهُ وَكَفُّهُ",
                "id": "Telah menceritakan kepada kami [Yazid], telah mengabarkan pada kami [Al Jurairi Abu Mas'ud] dari [Hakim bin Mu'awiyah] dari [Ayahnya] dari Nabi Shalallahu 'alaihi wasallam, beliau bersabda: \"Kalian akan datang pada hari kiamat dalam keadaan mulut terkunci, sedangkan yang pertama kali berbicara dari anak cucu Adam adalah paha dan telapak tangannya (yaitu kaki dan tangannya).\""
            },
            {
                "number": 2534,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنَا أَبُو قَزَعَةَ عَنْ رَجُلٍ مِنْ بَنِي قُشَيْرٍ عَنْ أَبِيهِ أَنَّهُسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا حَقُّ امْرَأَتِي عَلَيَّ قَالَ تُطْعِمُهَا إِذَا طَعِمْتَ وَتَكْسُوهَا إِذَا اكْتَسَيْتَ وَلَا تَضْرِبْ الْوَجْهَ وَلَا تَهْجُرْ إِلَّا فِي الْبَيْتِ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq], telah mengabarkan kepada kami [Ibnu Juraij], telah mengabarkan kepada kami [Abu Qaza'ah] dari [seorang laki-laki] dari bani Qusyair dari [Ayahnya] bahwa ia bertanya kepada Nabi Shalallahu 'alaihi wasallam; \"Apakah hak seorang istri terhadapku?.\" Beliau menjawab: \"Kamu memberinya makan sebagaimana kamu makan, memberinya pakaian sebagaimana kamu berpakaian, tidak memukul wajahnya, tidak menjelekkannya dan tidak menghajrnya (memisahkan dari tempat tidur) kecuali di dalam rumah.\""
            },
            {
                "number": 2535,
                "arab": "حَدَّثَنَا يَزِيدُ أَخْبَرَنَا بَهْزٌ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَسَمِعْتُ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَلَا إِنَّكُمْ تُوفُونَ سَبْعِينَ أُمَّةً أَنْتُمْ خَيْرُهَا وَأَكْرَمُهَا عَلَى اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Yazid], telah menceritakan kepada kami [Bahz] dari [Ayahnya] dari [Kakeknya] ia berkata; Aku mendengar Rasulullah Shallalahu 'alaihi wasallam bersabda: \"Sungguh (jumlah) kalian sebanding dengan tujuh puluh umat, sedangkan kalian adalah ummat yang terbaik dan mulia diantara mereka di hadapan Allah Azza Wa Jalla.\""
            },
            {
                "number": 2536,
                "arab": "حَدَّثَنَا يَزِيدُ أَخْبَرَنَا بَهْزُ بْنُ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقُلْتُ يَا نَبِيَّ اللَّهِ نِسَاؤُنَا مَا نَأْتِي مِنْهَا وَمَا نَذَرُ قَالَ حَرْثُكَ ائْتِ حَرْثَكَ أَنَّى شِئْتَ غَيْرَ أَنْ لَا تَضْرِبَ الْوَجْهَ وَلَا تُقَبِّحْ وَلَا تَهْجُرْ إِلَّا فِي الْبَيْتِ وَأَطْعِمْ إِذَا طَعِمْتَ وَاكْسُ إِذَا اكْتَسَيْتَ كَيْفَ وَقَدْ أَفْضَى بَعْضُكُمْ إِلَى بَعْضٍ إِلَّا بِمَا حَلَّ عَلَيْهَا",
                "id": "Telah menceritakan kepada kami [Yazid], telah mengabarkan pada kami [Bahz bin Hakim] dari [Ayahnya] dari [Kakeknya] ia berkata; \"Aku bertanya pada Rasulullah Shallalahu 'alaihi wasallam; \"Wahai Nabiyullah, terhadap siteri-isteri kami, apa yang harus kami lakukan dan apa yang harus kami tinggalkan?.\" Beliau menjawab: \"Isteri-siterimu adalah ladang bagimu, datangilah ladang kalian dari mana saja kalian suka, jangan memukul wajahnya, jangan menjelekkannya dan jangan menghajrnya (memisahkan dari tempat tidur) kecuali dalam satu rumah, kamu memberinya makan sebagaimana kamu makan, memberinya pakaian sebagaimana kamu berpakaian, bagaimana lagi, kalian juga telah bersebadan antara satu sama lain, selain sesuatu yang telah di halalkan baginya.\""
            },
            {
                "number": 2537,
                "arab": "حَدَّثَنَا يَزِيدُ أَخْبَرَنَا بَهْزٌ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَيْنَ تَأْمُرُنِي قَالَ هَاهُنَا وَنَحَا بِيَدِهِ نَحْوَ الشَّامِ قَالَ إِنَّكُمْ مَحْشُورُونَ رِجَالًا وَرُكْبَانًا وَتُجَرُّونَ عَلَى وُجُوهِكُمْ",
                "id": "Telah menceritakan kepada kami [Yazid], telah mengabarkan pada kami [Bahz bin Hakim] dari [Ayahnya] dari [Kakeknya] ia berkata; Aku bertanya pada Rasulullah Shallalahu 'alaihi wasallam; \"Wahai Rasulullah, kemana engkau akan menyuruhku?.\" Beliau bersabda: \"Ke sini -seraya menunjukkan dengan tangan beliau ke arah Syam- Beliau melanjutkan: \"Sungguh kalian akan dikumpulkan dalam keadaan berjalan kaki dan berkendaraan dan wajah-wajah kalian juga akan dihela (secara berurutan atau satu persatu).\""
            },
            {
                "number": 2538,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ عَنْ بَهْزِ بْنِ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ عَوْرَاتُنَا مَا نَأْتِي مِنْهَا وَمَا نَذَرُ قَالَ احْفَظْ عَوْرَتَكَ إِلَّا مِنْ زَوْجَتِكَ أَوْ مَا مَلَكَتْ يَمِينُكَ قُلْتُ أَرَأَيْتَ إِنْ كَانَ الْقَوْمُ بَعْضُهُمْ فِي بَعْضٍ قَالَ إِنْ اسْتَطَعْتَ أَنْ لَا يَرَاهَا أَحَدٌ فَلَا يَرَاهَا قُلْتُ أَرَأَيْتَ إِنْ كَانَ أَحَدُنَا خَالِيًا قَالَ فَاللَّهُ تَبَارَكَ وَتَعَالَى أَحَقُّ أَنْ يُسْتَحْيَا مِنْ النَّاسِ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Ibrahim], telah menceritakan kepada kami [Bahz bin Hakim] dari [Ayahnya] dari [Kakeknya] dia berkata; Aku bertanya: \"Wahai Rasulullah, dimanakah kami harus menutup aurat kami dan dimana kami boleh menanggalkannya (tidak terjaga)?.\" Beliau bersabda: \"Jagalah auratmu kecuali dihadapan istrimu atau budak wanitamu.\" Aku berkata lagi; \"Kalau di hadapan sejenis?.\" Beliau menjawab: \"Jika kamu mampu, maka jangan sampai ada orang yang melihatnya!.\" Aku berkata lagi; \"Bagaimana pendapat anda bila kami dalam keaadaan sendiri? Beliau pun menjawab: \"Di hadapan Allah Tabaraka Wa Ta'ala hendaknya kamu lebih berhak untuk malu daripada di hadapan manusia!.\""
            },
            {
                "number": 2539,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ أَخْبَرَنَا بَهْزُ بْنُ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ أَخَاهُ أَوْ عَمَّهُ قَامَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ جِيرَانِي بِمَا أُخِذُوا فَأَعْرَضَ عَنْهُ قَالَ جِيرَانِي بِمَا أُخِذُوا فَأَعْرَضَ عَنْهُ ثُمَّ قَالَ جِيرَانِي بِمَا أُخِذُوا فَأَعْرَضَ عَنْهُ قَالَ لَئِنْ قُلْتُ ذَاكَ لَقَدْ زَعَمَ النَّاسُ أَنَّ مُحَمَّدًا يَنْهَى عَنْ الْغَيِّ وَيَسْتَخْلِي بِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا قَالَ فَقَامَ أَخُوهُ أَوْ ابْنُ أَخِيهِ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهُ إِنَّهُ فَقَالَ أَمَا لَقَدْ قُلْتُمُوهَا أَوْ قَالَ قَائِلُكُمْ وَلَئِنْ كُنْتُ أَفْعَلُ ذَلِكَ إِنَّهُ لَعَلَيَّ وَمَا هُوَ عَلَيْكُمْ خَلُّوا لَهُ عَنْ جِيرَانِهِ",
                "id": "Telah menceritakan kepada kami [Isma'il], telah menceritakan kepada kami [Bahz bin Hakim] dari [Ayahnya] dari [Kakenya] bahwa saudaranya atau pamannya pernah datang kepada Rasulullah Shallalahu 'alaihi wasallam sambil berkata; \"Dengan alasan apa tetanggaku ditangkap (ditahan)? Beliau kemudian berpaling darinya. Kemudian ayah atau kakeknya berujar lagi; \"Beritahukanlah kepadaku, karena alasan apa mereka ditahan?\" Beliau masih tetap berpaling. Maka ayah atau kakeknya berujar; \"Kalau aku katakan sesuatu, maka orang-orang akan beranggapan bahwa anda melarang kejahatan (penyimpangan), namun anda sendiri melakukannya.\" Nabi shallallahu 'alaihi wasallam mengucapkan sebagaimana yang beliau ucapkan. Lantas saudara atau keponakan dari ayah atau kakeknya melaporkan; \"Hai Rasulullah, ia telah berkata demikian-demikian.\" Beliau bersabda: \"Kalian atau salah seorang dari kalian telah mengomel sedemikian rupa, kalaulah aku lakukan yang demikian, itu tanggung jawabku bukan tanggung jawab kalian, dan sekarang tolong suruh ia melepaskan tetangganya.\""
            },
            {
                "number": 2540,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ أَخْبَرَنَا بَهْزُ بْنُ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ أَتَيْتُهُ فَقُلْتُ وَاللَّهِ مَا أَتَيْتُكَ حَتَّى حَلَفْتُ أَكْثَرَ مِنْ عَدَدِ أُولَاءِ أَنْ لَا آتِيَكَ وَلَا آتِيَ دِينَكَ وَجَمَعَ بَهْزٌ بَيْنَ كَفَّيْهِ وَقَدْ جِئْتُ امْرَأً لَا أَعْقِلُ شَيْئًا إِلَّا مَا عَلَّمَنِي اللَّهُ تَبَارَكَ وَتَعَالَى وَرَسُولُهُ وَإِنِّي أَسْأَلُكَ بِوَجْهِ اللَّهِ بِمَ بَعَثَكَ اللَّهُ إِلَيْنَا قَالَ بِالْإِسْلَامِ قُلْتُ وَمَا آيَاتُ الْإِسْلَامِ قَالَ أَنْ تَقُولَ أَسْلَمْتُ وَجْهِيَ لِلَّهِ وَتَخَلَّيْتُ وَتُقِيمَ الصَّلَاةَ وَتُؤْتِيَ الزَّكَاةَ كُلُّ مُسْلِمٍ عَلَى مُسْلِمٍ مُحَرَّمٌ أَخَوَانِ نَصِيرَانِ لَا يَقْبَلُ اللَّهُ مِنْ مُشْرِكٍ أَشْرَكَ بَعْدَ مَا أَسْلَمَ عَمَلًا وَتُفَارِقَ الْمُشْرِكِينَ إِلَى الْمُسْلِمِينَ مَا لِي أُمْسِكُ بِحُجَزِكُمْ عَنْ النَّارِ أَلَا إِنَّ رَبِّي عَزَّ وَجَلَّ دَاعِيَّ وَإِنَّهُ سَائِلِي هَلْ بَلَّغْتُ عِبَادَهُ وَإِنِّي قَائِلٌ رَبِّ إِنِّي قَدْ بَلَّغْتُهُمْ فَلْيُبَلِّغْ الشَّاهِدُ مِنْكُمْ الْغَائِبَ ثُمَّ إِنَّكُمْ مَدْعُوُّونَ مُفَدَّمَةً أَفْوَاهُكُمْ بِالْفِدَامِ ثُمَّ إِنَّ أَوَّلَ مَا يُبِينُ عَنْ أَحَدِكُمْ لَفَخِذُهُ وَكَفُّهُ قُلْتُ يَا نَبِيَّ اللَّهِ هَذَا دِينُنَا قَالَ هَذَا دِينُكُمْ وَأَيْنَمَا تُحْسِنْ يَكْفِكَ",
                "id": "Telah menceritakan kepada kami [Isma'il], telah mengabarkan kepada kami [Bahz bin Hakim] dari [Ayahnya] dari [kakeknya], dia berkata; Aku datang menemui Nabi Shallalahu 'alaihi wasallam. Ketika aku bertemu dengan beliau, aku berkata; \"Demi Allah, dulu aku bersumpah tidak akan menemuimu, hingga aku bersumpah sebanyak mungkin untuk tidak mendatangimu dan tidak akan memeluk agamamu. -Bahz mengepalkan tangannya-, sekarang aku datang tanpa mengetahui sesuatu pun kecuali agar Allah Tabaraka wa Ta'ala dan Rasul-Nya mengajariku, dan aku bertanya kepadamu dengan mengharap wajah Allah, dengan apakah Allah mengutus anda kepada kami?.\" Beliau bersabda: \"Dengan agama Islam.\" Aku bertanya; \"Wahai Rasulullah, apa ciri-ciri Islam?.\" Beliau menjawab: \"Hendaklah kamu mengucapkan; Aku menyerahkan diri pada Allah dengan sepenuhnya dan membuang sesembahan selain Allah, mendirikan sholat, menunaikan zakat. Setiap muslim dengan muslim yang lain adalah haram (kehormatannya), (ibarat) dua saudara yang saling membela. Allah tidak akan menerima taubat seseorang yang menyekutukan-Nya setelah keIslamannya secara amalan atau hingga ia memisahkan diri dari orang-orang musyrik menuju (kumpulan) orang-orang muslim, sungguh aku tidak bisa menolong kalian dari Neraka, ketahuilah Tuhanku memanggilku dan bertanya: \"Apakah engkau telah menyampaikannya kepada hamba-hamba-Ku?, \"aku menjawab: \"Wahai rabbku, sungguh aku telah menyampaikannya pada mereka. Dan agar orang yang hadir di antara kalian menyampaikan pada yang tidak hadir, lalu mulut-mulut kalian akan terkunci dengan tutup, sesungguhnya yang pertama kali menjelaskan (berbicara) tentang diri kalian adalah pahanya (kakinya) dan telapak tangannya.\" aku pun bertanya; \"Wahai Nabiyullah, apakah ini termasuk dari perkara agama kita?\" beliau menjawab: \"Ini termasuk dari perkara agama kalian, dan manasaja kebaikan yang kamu perbuat, itu sudah cukup bagimu.\""
            },
            {
                "number": 2541,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ بَهْزِ بْنِ حَكِيمِ بْنِ مُعَاوِيَةَ بْنِ حَيْدَةَ الْقُشَيْرِيِّ حَدَّثَنِي أَبِي عَنْ جَدِّي قَالَقُلْتُ يَا رَسُولَ اللَّهِ نِسَاؤُنَا مَا نَأْتِي مِنْهُنَّ وَمَا نَذَرُ قَالَ حَرْثُكَ ائْتِ حَرْثَكَ أَنَّى شِئْتَ فِي أَنْ لَا تَضْرِبَ الْوَجْهَ وَلَا تُقَبِّحْ وَأَطْعِمْ إِذَا أُطْعِمْتَ وَاكْسُ إِذَا اكْتَسَيْتَ وَلَا تَهْجُرْ إِلَّا فِي الْبَيْتِ كَيْفَ وَقَدْ أَفْضَى بَعْضُكُمْ إِلَى بَعْضٍ إِلَّا بِمَا حَلَّ عَلَيْهِنَّ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Bahz bin Hakim bin Mu'awiyah bin Haidah Al Qusyairi], telah menceritakan kepadaku [Ayahku] dari [kakekku] ia berkata; Aku bertanya; \"Wahai Rasulullah, terhadap siteri-isteri kami, apa yang harus kami lakukan dan apa yang harus kami tinggalkan?.\" Beliau menjawab: \"Isteri-siterimu adalah ladang bagimu, datangilah ladang kalian dari mana saja kalian suka, namun jangan kamu memukul wajahnya, jangan menjelekkannya, kamu memberinya makan sebagaimana kamu makan, memberinya pakaian sebagaimana kamu berpakaian, dan jangan menghajrnya (memisahkan dari tempat tidur) kecuali dalam satu rumah, lalu bagaimana lagi, kalian juga telah bersebadan antara satu sama lain, selain sesuatu yang telah di halalkan baginya.\""
            },
            {
                "number": 2542,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ بَهْزِ بْنِ حَكِيمٍ حَدَّثَنِي أَبِي عَنْ جَدِّي قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَيْلٌ لِلَّذِي يُحَدِّثُ فَيَكْذِبُ لِيُضْحِكَ بِهِ الْقَوْمَ وَيْلٌ لَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Bahz bin Hakim], telah menceritakan kepadaku [Ayahku] dari [kakekku], ia berkata; \" Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Celakalah orang yang berbicara kemudian berbohong agar orang lain mentertawakannya, celakalah dia, celakalah dia.\""
            },
            {
                "number": 2543,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ بَهْزِ بْنِ حَكِيمٍ حَدَّثَنِي أَبِي عَنْ جَدِّي قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَأْتِي رَجُلٌ مَوْلًى لَهُ يَسْأَلُهُ مِنْ فَضْلٍ عِنْدَهُ فَيَمْنَعُهُ إِلَّا دُعِيَ لَهُ يَوْمَ الْقِيَامَةِ شُجَاعٌ يَتَلَمَّظُ فَضْلَهُ الَّذِي مَنَعَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Bahz bin Hakim], telah menceritakan kepadaku [Ayahku] dari [kakekku] ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang yang memiliki budak, lalu budak tersebut dating kepadanya untuk meminta (sedikit) dari kelebihan hartanya, namun ia menolaknya, maka akan didatangkan untuknya di hari kiamat seekor ular raksasa (Syuja' Al 'Aqra') yang akan merebut kelebihan (harta) yang ia tahan.\""
            },
            {
                "number": 2544,
                "arab": "حَدَّثَنَا يَحْيَى عَنْ بَهْزٍ حَدَّثَنِي أَبِي عَنْ جَدِّي قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّكُمْ وَفَيْتُمْ سَبْعِينَ أُمَّةً أَنْتُمْ آخِرُهَا وَأَكْرَمُهَا عَلَى اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Yahya] dari [Bahz], telah menceritakan kepadaku [Ayahku] dari [kakekku] dia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"(Jumlah) Kalian sebanding dengan tujuh puluh ummat, kalian adalah yang terakhir dan yang paling mulia di sisi Allah Azza Wa Jalla.\""
            },
            {
                "number": 2545,
                "arab": "حَدَّثَنَا يَحْيَى عَنْ بَهْزٍ حَدَّثَنِي أَبِي عَنْ جَدِّي قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَيْنَ تَأْمُرُنِي خِرْ لِي فَقَالَ بِيَدِهِ نَحْوَ الشَّامِ وَقَالَ إِنَّكُمْ مَحْشُورُونَ رِجَالًا وَرُكْبَانًا وَتُجَرُّونَ عَلَى وُجُوهِكُمْ",
                "id": "Telah menceritakan kepada kami [Yahya] dari [Bahz], telah menceritakan kepadaku [Ayahku] dari [Kakekku] berkata; aku bertanya; \"Wahai Rasulullah, kemanakah engkau akan menyuruhku, dan pilihlah (tempat yang cocok) untukku!.' Maka beliau menunjukkan tangan beliau ke arah Syam sambil bersabda: \"Sungguh kalian akan dikumpulkan, baik yang berjalan kaki dan berkendaraan serta diseretlah wajah-wajah kalian.\""
            },
            {
                "number": 2546,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْجُرَيْرِيُّ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ أَبِي بَهْزٍ عَنْ أَبِيهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي الْجَنَّةِ بَحْرُ اللَّبَنِ وَبَحْرُ الْمَاءِ وَبَحْرُ الْعَسَلِ وَبَحْرُ الْخَمْرِ ثُمَّ تَشَقَّقُ الْأَنْهَارُ مِنْهَا بَعْدَهُ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun], telah mengabarkan pada kami [Al Jurairi] dari [Hakim bin Mu'awiyah Abu Bahz] dari [Ayahnya] ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya di surga ada lautan susu, lautan air, lautan madu dan lautan khamr, kemudian dari situlah sungai-sungai dialirkan.\""
            },
            {
                "number": 2547,
                "arab": "حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي قَزَعَةَ الْبَاهِلِيِّ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَقْبَلُ اللَّهُ عَزَّ وَجَلَّ تَوْبَةَ عَبْدٍ أَشْرَكَ بِاللَّهِ بَعْدَ إِسْلَامِهِ",
                "id": "Telah menceritakan kepada kami [Yunus bin Muhammad], telah menceritakan kepada kami [Hammad bin Salamah] dari [Abu Qaza'ah Al Bahili] dari [Hakim bin Mu'awiyah] dari [Ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah Azza Wa Jalla tidak menerima taubat seorang hamba yang menyekutukan Allah setelah keIslamannya.\""
            },
            {
                "number": 2548,
                "arab": "حَدَّثَنَا هَاشِمٌ وَبَهْزٌ قَالَا حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ عَنْ حُمَيْدِ بْنِ هِلَالٍ قَالَ حَدَّثَنِي مَنْ سَمِعَ الْأَعْرَابِيَّ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي قَالَ فَرَفَعَ رَأْسَهُ مِنْ الرُّكُوعِ فَرَفَعَ كَفَّيْهِ حَتَّى حَاذَتَا أَوْ بَلَغَتَا فُرُوعَ أُذُنَيْهِ كَأَنَّهُمَا مِرْوَحَتَانِ",
                "id": "Telah menceritakan kepada kami [Hasyim] dan [Bahz], keduanya berkata; telah menceritakan kepada kami [Sulaiman bin Al Mughirah] dari [Humaid bin Hilal], dia berkata; 'Aku diberitahu oleh orang yang pernah mendengar [seorang Arab Badui] dia mengatakan; \"Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam sedang sholat.' Dia berkata lagi, 'Beliau kemudian mengangkat kepalanya dari rukuk lalu mengangkat kedua telapak tangannya hingga sejajar atau sampai kedua daun telinganya, seakan-akan seperti kipas.\""
            },
            {
                "number": 2549,
                "arab": "حَدَّثَنَا هَاشِمٌ وَبَهْزٌ قَالَا حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ عَنْ حُمَيْدٍ قَالَ وَحَدَّثَنِي مَنْ سَمِعَ الْأَعْرَابِيَّ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصَلِّي وَعَلَيْهِ نَعْلَانِ مِنْ بَقَرٍ قَالَ فَتَفَلَ عَنْ يَسَارِهِ ثُمَّ حَكَّ حَيْثُ تَفَلَ بِنَعْلِهِ",
                "id": "Telah menceritakan kepada kami [Hasyim] dan [Bahz], keduanya berkata; telah telah menceritakan kepada kami [Sulaiman bin Al Mughirah] dari [Humaid], dia berkata; 'Aku diberitahu oleh orang yang pernah mendengar [seorang Arab Badui] mengatakan; \"Aku pernah melihat Rasulullah shallallahu 'alaihi wasallam sedang sholat dengan mengenakan sandal dari kulit sapi.\" Katanya lagi, \"Beliau kemudian meludah ke kiri lalu menggosok tempat beliau meludah tadi dengan sandalnya.\""
            },
            {
                "number": 2550,
                "arab": "حَدَّثَنَا أَبُو أَحْمَدَ حَدَّثَنَا سُفْيَانُ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ يَزِيدَ بْنِ الشِّخِّيرِ عَنْ مُطَرِّفِ بْنِ الشِّخِّيرِ قَالَ أَخْبَرَنِي أَعْرَابِيٌّ لَنَا قَالَرَأَيْتُ نَعْلَ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَخْصُوفَةً",
                "id": "Telah menceritakan kepada kami [Abu Ahmad]; telah telah menceritakan kepada kami [Sufyan] dari [Khalid Al Khadza`] dari [Yazid bin Syikhkhir] dari [Mutharrif bin Syikhkhir], dia berkata; \"Seorang [Arab Badui] pernah mengabari kami, katanya, \"Kulihat sandal Nabi kalian shallallahu 'alaihi wasallam ada jahitannya.\""
            },
            {
                "number": 2551,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ الطُّفَاوِيُّ حَدَّثَنَا سَعِيدٌ الْجُرَيْرِيُّ عَنْ رَجُلٍ مِنْ بَنِي تَمِيمٍ وَأَحْسَنَ الثَّنَاءَ عَلَيْهِ عَنْ أَبِيهِ أَوْ عَمِّهِ قَالَصَلَّيْتُ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْنَاهُ عَنْ قَدْرِ رُكُوعِهِ وَسُجُودِهِ فَقَالَ قَدْرُ مَا يَقُولُ الرَّجُلُ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ثَلَاثًا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdurrahman Ath Thufawy] dari [Sa'id Al Jurairy], dari [seorang laki-laki] dari Bani Tamim -dia memujinya dengan pujian yang baik- dari [Ayahnya], atau [Pamannya], dia berkata; \"Aku pernah sholat di belakang Rasulullah shallallahu 'alaihi wasallam, lantas kami bertanya kepada beliau tentang kadar lama rukuk dan sujudnya.\" Beliau menjawab: \"Sebagaimana seseorang mengucapkan subhanallahi wa bihamdihi (Maha suci Allah dan segala puji bagi-Nya), sebanyak tiga kali.\""
            },
            {
                "number": 2552,
                "arab": "حَدَّثَنَا عَفَّانُ أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ حَدَّثَنَا عَمْرُو بْنُ دِينَارٍ قَالَ سَمِعْتُ الْحَسَنَ عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِأَنَّ رَجُلًا وَقَعَ عَلَى جَارِيَةِ امْرَأَتِهِ فَرُفِعَ ذَاكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنْ كَانَتْ طَاوَعَتْهُ فَهِيَ لَهُ وَعَلَيْهِ مِثْلُهَا لَهَا وَإِنْ كَانَ اسْتَكْرَهَهَا فَهِيَ حُرَّةٌ وَعَلَيْهِ مِثْلُهَا لَهَا",
                "id": "Telah menceritakan kepada kami ['Affan], telah mengabarkan kepada kami [Hammad bin Zaid]; telah telah menceritakan kepada kami ['Amru bin Dinar]; ia berkata; Aku mendengar [Al Hasan] dari [Salamah bin Al Muhabbiq], bahwa seorang laki-laki menyetubuhi budak perempuan istrinya. Perkara itu lalu diajukan kepada Nabi shallallahu 'alaihi wasallam. Beliau bersabda: \"Jika ia (budak) menurutinya (tidak ada paksaan), maka ia tetap milik laki-laki tersebut dengan kewajiban memberi mahar seperti kepada isterinya (yang lain). Akan tetapi, jika laki-laki memaksanya, maka budak itu merdeka dan ia wajib memberikan mahar seperti kepada isterinya.\""
            },
            {
                "number": 2553,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنِ الْحَسَنِ عَنْ جَوْنِ بْنِ قَتَادَةَ عَنْ سَلَمَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى عَلَى بَيْتٍ قُدَّامُهُ قِرْبَةٌ مُعَلَّقَةٌ فَسَأَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الشَّرَابَ فَقَالُوا إِنَّهَا مَيْتَةٌ فَقَالَ دِبَاغُهَا ذَكَاتُهَا",
                "id": "Telah menceritakan kepada kami ['Affan], dari [Hammam] telah menceritakan kepada kami [Qatadah] dari [Al Hasan] dari [Jaun bin Qatadah] dari [Salamah], bahwa Nabi shallallahu 'alaihi wasallam pernah singgah kerumah yang bagian depannya terdapat qirbah (kantong air dari kulit) yang tergantung. Lalu Nabi shallallahu 'alaihi wasallam meminta minum. Mereka berkata; \"Wahai Rasulullah, sesungguhnya qirbah itu (terbuat dari kulit) bangkai.\" Beliau bersabda: \"Disamaknya ia (kulit tersebut) adalah penyuciannya.\""
            },
            {
                "number": 2554,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَكْرٍ حَدَّثَنَا سَعِيدٌ يَعْنِي ابْنَ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِأَنَّ رَجُلًا غَشِيَ جَارِيَةَ امْرَأَتِهِ وَهُوَ فِي غَزْوٍ فَرُفِعَ ذَلِكَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنْ كَانَ اسْتَكْرَهَهَا فَهِيَ حُرَّةٌ مِنْ مَالِهِ وَعَلَيْهِ شِرَاؤُهَا لِسَيِّدَتِهَا وَإِنْ كَانَتْ طَاوَعَتْهُ فَمِثْلُهَا مِنْ مَالِهِ لِسَيِّدَتِهَا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Bakr], telah menceritakan kepada kami [Sa'id yaitu Ibnu Abu 'Arubah] dari [Qatadah] dari [Al Hasan] dari [Salamah bin Al Muhabbiq] bahwa seseorang laki-laki telah menyetubuhi budak perempuan istrinya ketika dalam peperangan. Perkara itu lalu diajukan kepada Nabi shallallahu 'alaihi wasallam. Beliau bersabda: \"Jika laki-laki itu memaksanya, maka budak tersebut merdeka, dan ia wajib memberikan mahar kepada istrinya. Namun jika budak tersebut menurutinya, maka budak tersebut tetap miliknya (laki-laki itu) dengan kewajiban memberi mahar kepada istrinya.\""
            },
            {
                "number": 2555,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ عَنْ يُونُسَ عَنِ الْحَسَنِ عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِأَنَّ رَجُلًا خَرَجَ فِي غَزَاةٍ وَمَعَهُ جَارِيَةٌ لِامْرَأَتِهِ فَوَقَعَ بِهَا فَذُكِرَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنْ كَانَ اسْتَكْرَهَهَا فَهِيَ عَتِيقَةٌ وَلَهَا عَلَيْهِ مِثْلُهَا وَإِنْ كَانَتْ طَاوَعَتْهُ فَهِيَ أَمَتُهُ وَلَهَا عَلَيْهِ مِثْلُهَا وَقَالَ إِسْمَاعِيلُ مَرَّةً إِنَّ رَجُلًا كَانَ فِي غَزْوَةٍحَدَّثَنَا هُشَيْمٌ عَنْ يُونُسَ عَنِ الْحَسَنِ عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مَعْنَاهُ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Isma'il] dari [Yunus] dari [Al Hasan] dari [Salamah bin Al Muhabbiq] bahwa seseorang seorang laki-laki mengikuti peperangan, sementara seorang budak wanita milik istrinya ikut dengannya, ternyata laki-laki itu telah menyetubuhi budak wanita milik isterinya. Perkara itu lalu diajukan kepada Nabi shallallahu 'alaihi wasallam. Beliau bersabda: \"Jika laki-laki itu memaksanya, maka ia (budak itu) merdeka dan laki-laki itu wajib memberikan mahar yang semisal kepadanya. Tapi jika budak tersebut menurutinya, maka ia tetap milik laki-laki itu dengan kewajiban memberi mahar semisal kepadanya. Sesekali [Isma'il] berkata; \"Pernah seorang lelaki yang sedang mengikuti peperangan...\" Telah menceritakan kepada kami [Hasyim] dari [Yunus] dari [Al Hasan] dari [Salamah bin Al Muhabbiq] dari Nabi Shallalahu 'alaihi wasalam lalu menyebutkan makna haditsnya. Telah menceritakan kepada kami [Muhammad bin Ja'far], telah telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Al Hasan] dari [Salamah bin Al Muhabbiq] dari Nabi Shallallahu 'alaihi wasalam seperti itu."
            },
            {
                "number": 2556,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ جَوْنِ بْنِ قَتَادَةَ عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَى عَلَى قِرْبَةٍ يَوْمَ حُنَيْنٍ فَدَعَا مِنْهَا بِمَاءٍ وَعِنْدَهَا امْرَأَةٌ فَقَالَتْ إِنَّهَا مَيْتَةٌ فَقَالَ سَلُوهَا أَلَيْسَ قَدْ دُبِغَتْ فَقَالَتْ بَلَى فَأَتَى مِنْهَا لِحَاجَتِهِ فَقَالَ ذَكَاةُ الْأَدِيمِ دِبَاغُهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far]; telah telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Jaun bin Qatadah] dari [Salamah bin Al Muhabbiq] bahwa pada saat perang Hunain, Nabiyullah Shallallahu 'alaihi wasalam pernah mendatangi rumah seorang wanita yang memiliki qirbah, lalu wanita itu berkata; \"Itu terbuat dari (kulit) bangkai.\" Rasulullah Shallallahu 'alaihi wasalam bersabda: \"Tanyakan padanya apakah sudah disamak?.\" Wanita itu berkata; \"Ya.\" Setelah hajat beliau terpenuhi, beliau bersabda: \"Kulit bangkai sucinya dengan disamak.\" "
            },
            {
                "number": 2557,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنِ الْحَسَنِ عَنْ جَوْنِ بْنِ قَتَادَةَ عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِ أَنَّهُكَانَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ تَبُوكَ فَأَتَى عَلَى بَيْتٍ قُدَّامُهُ قِرْبَةٌ مُعَلَّقَةٌ فَسَأَلَ الشَّرَابَ فَقِيلَ إِنَّهَا مَيْتَةٌ فَقَالَ ذَكَاتُهَا دِبَاغُهَا",
                "id": "Telah menceritakan kepada kami [Bahz]; telah telah menceritakan kepada kami [Hammam]; telah menceritakan kepada kami [Qatadah] dari [Al Hasan] dari [Jaun bin Qatadah] dari [Salamah bin Al Muhabbiq] bahwa ia pernah bersama Nabi Shallallahu 'alaihi wasalam pada saat perang Tabuk, lalu beliau mendatangi rumah yang didepannya tergantung sebuah qirbah untuk meminta minum, lalu beritahukan bahwa qirbah itu terbuat dari (kulit) bangkai, maka Rasulullah Shallallahu 'alaihi wasalam bersabda: \"Sucinya adalah dengan disamak.\""
            },
            {
                "number": 2558,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ قَبِيصَةَ بْنِ حُرَيْثٍ عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِ قَالَقَضَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَجُلٍ وَطِئَ جَارِيَةَ امْرَأَتِهِ إِنْ كَانَ اسْتَكْرَهَهَا فَهِيَ حُرَّةٌ وَعَلَيْهِ لِسَيِّدَتِهَا مِثْلُهَا",
                "id": "Telah menceritakan kepada kami [Abdurrazaq], telah menceritakan kepada kami [Ma'mar] dari [Qatadah] dari [Al Hasan] dari [Qabishah bin Huraits] dari [Salamah bin Al Muhabbiq] dia berkata; \"Rasulullah Shallallahu 'alaihi wasalam pernah menghukumi seseorang yang telah menyetubuhi budak istrinya, yaitu; apabila ia terpaksa maka ia merdeka dan suaminya harus membayar mahar kepada istrinya.\""
            },
            {
                "number": 2559,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي عَبْدُ الْكَرِيمِ بْنُ أَبِي الْمُخَارِقِ عَنْ مُعَاذِ بْنِ سَعْوَةَ الرَّاسِبِيِّ عَنْ سِنَانِ بْنِ سَلَمَةَ الْهُذَلِيِّ عَنْ أَبِيهِ سَلَمَةَ وَكَانَ قَدْ صَحِبَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ بَعَثَ بَدَنَتَيْنِ مَعَ رَجُلٍ وَقَالَ إِنْ عَرَضَ لَهُمَا فَانْحَرْهُمَا وَاغْمِسْ النَّعْلَ فِي دِمَائِهِمَا ثُمَّ اضْرِبْ بِهِ صَفْحَتَيْهِمَا حَتَّى يُعْلَمَ أَنَّهُمَا بَدَنَتَانِ قَالَ صَفْحَتَيْ كُلِّ وَاحِدَةٍ قَالَ وَلَا تَأْكُلْ مِنْهَا أَنْتَ وَلَا أَحَدٌ مِنْ رُفْقَتِكَ وَدَعْهَا لِمَنْ بَعْدَكُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Bakr], telah mengabarkan kepada kami [Ibnu Juraij], telah telah mengabarkan padaku [Abdul Karim bin Abul Mukhariq] dari [Mu'adz bin Sa'wah Arrasibi] dari [Sinan bin Salamah Al Hudzali], dari ayahnya [Salamah] -dia adalah salah seorang sahabat Nabi shallallahu 'alaihi wasallam-, dari Nabi shallallahu 'alaihi wasallam, bahwa beliau pernah mengirim dua unta qurban bersama seorang laki-laki. Beliau berpesan, \"Jika bisa, sembelihlah keduanya dan celupkanlah sandal pada darah keduanya. Setelah itu, pukulkanlah pada kedua sisi tubuh kedua unta tersebut hingga diketahui bahwa keduanya adalah unta qurban.\" Dia mengatakan; \"Kedua sisi masing-masing.\" beliau bersabda lagi: \"Janganlah kalian dan orang yang menyertai kalian ikut memakannya. Tinggalkanlah ia untuk orang selain kalian.\""
            },
            {
                "number": 2560,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ الْهَيْثَمِ وَأَبُو دَاوُدَ وَعَبْدُ الصَّمَدِ الْمَعْنَى قَالُوا أَخْبَرَنَا هِشَامٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ جَوْنِ بْنِ قَتَادَةَ عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعَا بِمَاءٍ مِنْ قِرْبَةٍ عِنْدَ امْرَأَةٍ فَقَالَتْ إِنَّهَا مَيْتَةٌ فَقَالَ أَلَيْسَ قَدْ دَبَغْتِهَا قَالَتْ بَلَى قَالَ دِبَاغُهَا ذَكَاتُهَا",
                "id": "Telah menceritakan kepada kami ['Amru bin Al Haitsam] dan [Abu Dawud] dan [Abdushamad], maksudnya sama, mereka berkata; telah mengabarkan kepada kami [Hisyam] dari [Qatadah] dari [Al Hasan] dari [Jaun bin Qatadah] dari [Salamah bin Al Muhabbiq] bahwa Nabi Shallallahu 'alaihi wasalam pernah meminta air dari qirbah milik seorang wanita, lalu wanita itu berkata; \"Qirbah itu terbuat dari (kulit) bangkai.\" Maka Rasululah Shallallahu 'alaihi wasalam bersabda: \"Bukankah kamu telah menyamaknya?.\" Ia menjawab; \"Ya.\" Rasulullah Shallallahu 'alaihi wasalam bersabda: \"Menyamaknya telah menjadikan ia suci.\" "
            },
            {
                "number": 2561,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ حَبِيبٍ الْعَوْذِيُّ حَدَّثَنِي أَبِي قَالَ غَزَوْنَا مَعَ سِنَانِ بْنِ سَلَمَةَ مُكْرَانَ فَقَالَ سِنَانُ بْنُ سَلَمَةَ حَدَّثَنِي أَبِي سَلَمَةُ بْنُ الْمُحَبِّقِ أَنَّهُسَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَدْرَكَهُ رَمَضَانُ لَهُ حُمُولَةٌ يَأْوِي إِلَى شِبَعٍ فَلْيَصُمْ رَمَضَانَ حَيْثُ أَدْرَكَهُو قَالَ سِنَانٌ وُلِدْتُ يَوْمَ حُنَيْنٍ فَبُشِّرَ بِي أَبِي فَقَالُوا لَهُ وُلِدَ لَكَ غُلَامٌ فَقَالَ سَهْمٌ أَرْمِي بِهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَبُّ إِلَيَّ مِمَّا بَشَّرْتُمُونِي بِهِ وَسَمَّانِي سِنَانًا",
                "id": "Telah menceritakan kepada kami [Abdusshamad] dia berkata; telah menceritakan kepada kami [Abdussamad bin Habib Al Audzi]; telah menceritakan padaku [Ayahku], ia berkata, Kami pernah berperang bersama [Sinan bin Salamah] telah telah menceritakan kepada kami dari [Salamah bin Al Muhabbiq], bahwa ia pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berada di bulan Ramadhan, sementara ia memiliki muatan (makanan) yang dapat menjadikannya tenang, maka hendaklah berpuasa Ramadhan ketika memasukinya.\" [Sinan] menuturkan; \"Aku dilahirkan pada hari Hunain. Ayahku diberi kabar gembira tentang (kelahiran) ku. Mereka berkata, \"Anak laki-lakimu telah lahir.\" [Ayahku] malah berujar: \"Satu anak panah yang kulesatkan demi membela Rasulullah shallallahu 'alaihi wasallam lebih aku sukai daripada apa yang kalian kabarkan kepadaku.' kemudian ayahku memberiku nama Sinan.\""
            },
            {
                "number": 2562,
                "arab": "حَدَّثَنَا يَزِيدُ أَخْبَرَنَا بَهْزٌ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَيْلٌ لِلَّذِي يُحَدِّثُ فَيَكْذِبُ لِيُضْحِكَ بِهِ الْقَوْمَ وَيْلٌ لَهُ وَيْلٌ لَهُ",
                "id": "Telah telah menceritakan kepada kami [Yazid], telah telah menceritakan kepada kami [Bahz] dari [Ayahnya] dari [Kakeknya] ia berkata; Aku mendengar Rasuslullah Shallallahu 'alaihi wasalam bersabda: \" Celaka orang yang berbicara lalu berdusta agar orang lain tertawa, celakalah ia, celakalah ia!.\""
            },
            {
                "number": 2563,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ حَدَّثَنَا الْهِرْمَاسُ بْنُ زِيَادٍ الْبَاهِلِيُّ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي مُرْدِفِي خَلْفَهُ عَلَى حِمَارٍ وَأَنَا صَغِيرٌ فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ بِمِنًى عَلَى نَاقَتِهِ الْعَضْبَاءِ",
                "id": "Telah menceritakan kepada kami [Bahz], telah telah menceritakan kepada kami [Ikrimah bin 'Amar], telah telah menceritakan kepada kami [Al Hirmaz bin Ziyad Al Bahili] berkata; 'Aku pernah melihat Rasulullah Shallallahu 'alaihi wasalam sedangkan ayahku memboncengkanku di belakangnya di atas keledai, ketika itu aku masih kecil dan aku sempat melihat Rasulullah Shallallahu 'alaihi wasalam berada diatas untanya Al Adlba' tengah berkhutbah di Mina.'"
            },
            {
                "number": 2564,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ حَدَّثَنَا الْهِرْمَاسُ بْنُ زِيَادٍ الْبَاهِلِيُّ قَالَكَانَ أَبِي مُرْدِفِي فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ النَّاسَ يَوْمَ النَّحْرِ بِمِنًى عَلَى نَاقَتِهِ الْعَضْبَاءِ",
                "id": "Telah menceritakan kepada kami [Abdusshamad]; telah mengabarkan kepada kami [Ikrimah bin 'Ammar], telah menceritakan kepada kami [Al Hirmas bin Ziyad Al Bahili] ia berkata; \"Ayahku pernah memboncengkanku di belakangnya, maka aku melihat Rasulullah Shallallahu 'alaihi wasalam di atas untanya Al Adlba' tengah berkutbah di hadapan orang-orang pada hari kurban di Mina.\""
            },
            {
                "number": 2565,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ أَخْبَرَنَا عَبْدُ الْمَلِكِ أَبُو جَعْفَرٍ عَنْ أَبِي نَضْرَةَ عَنْ سَعْدِ بْنِ الْأَطْوَلِأَنَّ أَخَاهُ مَاتَ وَتَرْكَ ثَلَاثَ مِائَةِ دِرْهَمٍ وَتَرَكَ عِيَالًا فَأَرَدْتُ أَنْ أُنْفِقَهَا عَلَى عِيَالِهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَخَاكَ مَحْبُوسٌ بِدَيْنِهِ فَاقْضِ عَنْهُ فَقَالَ يَا رَسُولَ اللَّهِ فَقَدْ أَدَّيْتُ عَنْهُ إِلَّا دِينَارَيْنِ ادَّعَتْهُمَا امْرَأَةٌ وَلَيْسَ لَهَا بَيِّنَةٌ قَالَ فَأَعْطِهَا فَإِنَّهَا مُحِقَّةٌحَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنِ الْجُرَيْرِيِّ عَنْ أَبِي نَضْرَةَ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammad bin Salamah], telah mengabarkan kepada kami [Abdul Malik Abu Ja'far] dari [Abu Nadhrah] dari [Sa'id bin Al Athwal] bahwa saudara laki-lakinya telah meninggal dunia dengan meninggalkan tiga ratus dirham dan keluarga (anak dan isteri). Maka aku ingin mensedekahkannya kepada keluarganya, Nabi Shallallahu 'alaihi wasalam bersabda: \"Sesungguhnya saudara lelakimu tertahan karena hutangnya, maka bayarlah hutangnya.\" Lalu aku berkata; \"Wahai Rasululah, aku telah melunasinya, kecuali dua dinar yang diklaim oleh seorang wanita sementara ia tidak memiliki bukti yang jelas.\" Beliau bersabda: \"Bayarkanlah kepada wanita itu, karena ia lebih berhak.\" Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Hammad bin Salamah] dari [Al Jurairi] dari [Abu Nadhrah] dari [seorang] sahabat Nabi Shallallahu 'alaihi wasalam seperti hadits di atas."
            },
            {
                "number": 2566,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ هِلَالِ بْنِ يَسَافٍ عَنْ رَبِيعِ بْنِ عَمِيلَةَ عَنْ سَمُرَةَ بْنِ جُنْدُبٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُسَمِّ غُلَامَكَ أَفْلَحَ وَلَا نَجِيحًا وَلَا يَسَارًا وَلَا رَبَاحًا فَإِنَّكَ إِذَا قُلْتَ أَثَمَّ هُوَ أَوْ أَثَمَّ فُلَانٌ قَالُوا لَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah telah menceritakan kepada kami [Syu'bah] dari [Manshur] dari [Hilal bin Yasaf] dari [Rabi' bin 'Amilah] dari [Samurah bin Jundub], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Jangan kamu beri nama anak laki-lakimu Aflah, Najih, Yasar, ataupun Rabah. Sebab kalau kamu bertanya; 'Apakah disana ada orang yang bernama demikian?, ' atau 'Apakah di sana ada Fulan? ' Mereka akan menjawab; 'Tidak.\""
            },
            {
                "number": 2567,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَرَوْحٌ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ شَيْخٍ مِنْ بَنِيٍ قُشَيْرٍ قَالَ رَوْحٌ قَالَ سَمِعْتُ سَوَادَةَ الْقُشَيْرِيَّ وَكَانَ إِمَامَهُمْ قَالَ سَمِعْتُ سَمُرَةَ بْنَ جُنْدُبٍ يَخْطُبُ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَغُرَّنَّكُمْ نِدَاءُ بِلَالٍ وَهَذَا الْبَيَاضُ حَتَّى يَنْفَجِرَ الْفَجْرُ أَوْ يَطْلُعَ الْفَجْرُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] dan [Rauh] keduanya berkata, telah mengabarkan kepada kami [Syu'bah] dari seorang syaikh dari Bani Qusyair. -Rauh berkata; Aku mendengar [Sawadah Al Qusyairi] - ia adalah pemimpin kaum tersebut, ia berkata; \"Aku mendengar [Samurah bin Jundub] sedang berkhutbah, katanya; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah adzan Bilal dan warna putih ini (mendung) mengecoh kalian, hingga fajar telah menyingsing atau fajar telah terbit.\""
            },
            {
                "number": 2568,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنِ سَمُرَةَ بْنِ جُنْدُبٍ قَالَكَانَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَكْتَتَانِ فِي صَلَاتِهِوَقَالَ عِمْرَانُ بْنُ حُصَيْنٍ أَنَا مَا أَحْفَظُهُمَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَتَبُوا فِي ذَلِكَ إِلَى أُبَيِّ بْنِ كَعْبٍ يَسْأَلُونَهُ عَنْهُ فَكَتَبَ أُبَيٌّ أَنَّ سَمُرَةَ قَدْ حَفِظَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Samurah bin Jundub], dia berkata; \"Rasulullah shallallahu 'alaihi wasallam diam sejenak pada dua tempat dalam sholatnya.\" Imran bin Hushain berkata; \"Aku belum pernah mendengar kedua tempat tersebut dari Rasulullah shallallahu 'alaihi wasallam. Mereka lalu mengirim surat kepada [Ubay bin Ka'ab] untuk menanyakan hal itu. Ubay membalas bahwa Samurah pernah menghafalnya.\""
            },
            {
                "number": 2569,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَرَوْحٌ قَالَا حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدُبٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ هِيَ الْعَصْرُ قَالَ ابْنُ جَعْفَرٍ سُئِلَ عَنْ صَلَاةِ الْوُسْطَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] dan [Rauh], keduanya berkata; telah telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Samurah bin Jundub], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Itu adalah (sholat) Ashar.\" [Ibnu Ja'far] mengatakan; \"Yaitu ketika beliau ditanya tentang sholat al-Wustha.\""
            },
            {
                "number": 2570,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا سَعِيدٌ وَبَهْزٌ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنِ الْحَسَنِ عَنْ سَمُرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعُمْرَى جَائِزَةٌ لِأَهْلِهَا قَالَ ابْنُ جَعْفَرٍ فِي حَدِيثِهِ لِأَهْلِهَا أَوْ مِيرَاثٌ لِأَهْلِهَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Sa'id] dan [Bahz], telah menceritakan kepada kami [Hammam]; telah menceritakan kepada kami [Qatadah] dari [Al Hasan] dari [Samurah], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Al Umra adalah hadiah bagi keluarganya.\" Dalam haditsnya, Ibnu Ja'far mengatakan; \"Bagi keluarganyanya, atau warisan bagi keluarganya.\" "
            },
            {
                "number": 2571,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ سَمُرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَشَكَّ فِيهِ فِي كِتَابِ الْبُيُوعِ فَقَالَ عَنْ عُقْبَةَ أَوْ سَمُرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَيُّمَا امْرَأَةٍ زَوَّجَهَا وَلِيَّانِ فَهِيَ لِلْأَوَّلِ مِنْهُمَا وَمَنْ بَاعَ بَيْعًا مِنْ رَجُلَيْنِ فَهُوَ لِلْأَوَّلِ مِنْهُمَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Samurah] dari Nabi Shallallahu 'alaihi wasalam -Ia ragu di dalam kitab Al Buyu'-, ia berkata dari ['Uqbah] atau [Samurah] bahwa Nabi Shallallahu 'alaihi wasalam bersabda: \"Wanita manasaja yang dinikahkan oleh dua orang walinya, maka ia bagi yang pertama dari keduanya dan barangsiapa membeli barang dari dua orang maka yang berhak adalah yang pertama.\""
            },
            {
                "number": 2572,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَمُحَمَّدُ بْنُ بِشْرٍ قَالَا حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدُبٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَلَى الْيَدِ مَا أَخَذَتْ حَتَّى تُؤَدِّيَهُ وَقَالَ ابْنُ بِشْرٍ حَتَّى تُؤَدِّيَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] dan [Muhammad bin Bisyr], keduanya berkata; telah mengabarkan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Samurah bin Jundub] dari Nabi Shallallahu 'alaihi wasalam bersabda: \"Bagi tangan bertanggung jawab terhadap apa yang diambil hingga ia menunaikannya (mengembalikannya).\" [Ibnu Bisyr] berkata; \"Hingga kamu menunaikannya.\""
            },
            {
                "number": 2573,
                "arab": "حَدَّثَنَا بَهْزٌ وَعَفَّانُ قَالَا حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ سَمُرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَارُ الدَّارِ أَحَقُّ بِالدَّارِ مِنْ غَيْرِهِ",
                "id": "Telah menceritakan kepada kami [Bahz] dan ['Affan], keduanya berkata; telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Al Hasan] dari [Samurah], ia berkata; Nabi Shallallahu 'alaihi wasalam bersabda: \"Tetangga rumah lebih berhak (ditawari terlebih dahulu untuk membeli) rumah sebelahnya dari yang lain.\""
            },
            {
                "number": 2574,
                "arab": "حَدَّثَنَا بَهْزٌ وَعَبْدُ الصَّمَدِ قَالَا حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ سَمُرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَوَضَّأَ فَبِهَا وَنِعْمَتْ وَمَنْ اغْتَسَلَ فَذَلِكَ أَفْضَلُ قَالَ عَبْدُ الصَّمَدِ فِي حَدِيثِهِ حَدَّثَنَا قَتَادَةُ",
                "id": "Telah menceritakan kepada kami [Bahz] dan [Abdusshamad], keduanya berkata; telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Al Hasan] dari [Samurah] dia berkata; Rasulullah Shallallahu 'alaihi wasalam bersabda: \"Barangsiapa berwudlu, maka itu baik dan barangsiapa mandi (pada hari Jum'at) maka itu lebih utama.\" [Abdusshamad] berkata dalam haditsnya; telah menceritakan kepada kami [Qatadah]."
            },
            {
                "number": 2575,
                "arab": "حَدَّثَنَا بَهْزٌ وَعَفَّانُ قَالَا حَدَّثَنَا أَبَانُ حَدَّثَنَا قَتَادَةُ عَنِ الْحَسَنِ عَنْ سَمُرَةَأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حَافِظُوا عَلَى الصَّلَوَاتِ قَالَ عَفَّانُ الصَّلَاةِ وَالصَّلَاةِ الْوُسْطَى وَسَمَّاهَا لَنَا إِنَّمَا هِيَ صَلَاةُ الْعَصْرِ",
                "id": "Telah menceritakan kepada kami [Bahz] dan ['Affan], keduanya berkata; telah menceritakan kepada kami [Aban]; telah bercerita kepada kami [Qatadah] dari [Al Hasan] dari [Samurah] bahwa Nabiyallah Shallallahu 'alaihi wasalam bersabda: \"Jagalah sholat-sholat kalian.\" 'Affan berkata; \"sholat yaitu sholat wustha, \" Dan beliau menyebutkan sholat wustha adalah sholat Ashar.\""
            },
            {
                "number": 2576,
                "arab": "حَدَّثَنَا أَبُو عُبَيْدَةَ عَبْدُ الْوَاحِدِ بْنُ وَاصِلٍ حَدَّثَنَا سَلْمٌ يَعْنِي ابْنَ زَرِيرٍ وَأَبُو الْأَشْهَبِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ طَرَفَةَأَنَّ جَدَّهُ عَرْفَجَةَ بْنَ أَسْعَدَ أُصِيبَ أَنْفُهُ فِي الْجَاهِلِيَّةِ يَوْمَ الْكُلَابِ فَاتَّخَذَ أَنْفًا مِنْ وَرِقٍ فَأَنْتَنَ عَلَيْهِ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَّخِذَ أَنْفًا يَعْنِي مِنْ ذَهَبٍحَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا أَبُو الْأَشْهَبِ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ طَرَفَةَ عَنْ جَدِّهِ عَرْفَجَةَ بْنِ أَسْعَدَ أَنَّهُ أُصِيبَ أَنْفُهُ يَوْمَ الْكُلَابِ فِي الْجَاهِلِيَّةِ فَذَكَرَ الْحَدِيثَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abu 'Ubaidah Abdul Wahid bin Washil], telah menceritakan kepada kami [Salm yaitu Ibnu Zarir] dan [Abul Asyhab] dari [Abdurrahman bin Tharafah] bahwa kakeknya yaitu [Arfajah bin As'ad] Bahwa hidungnya terluka saat terjadi perang Kulab pada masa Jahiliyah. Kemudian ia memakai hidung palsu dari perak, namun hal itu menimbulkan bau busuk. Maka Nabi shallallahu 'alaihi wasallam memerintahkannya untuk memakai hidung dari emas.\" Telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Abu Al Asyhab] telah menceritakan kepada kami [Abdurrahman bin Tharfah] dari [Kakeknya] bahwa hidungnya pernah terluka pada perang Kulab di masa Jahiliyah…\" kemudian ia menyebutkan hadits tersebut."
            },
            {
                "number": 2577,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا شَيْبَانُ حَدَّثَنَا أَبُو الْأَشْهَبِ الْعُطَارِدِيُّ جَعْفَرُ بْنُ حَيَّانَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ طَرَفَةَ بْنِ عَرْفَجَةَ قَالَ وَزَعَمَ عَبْدُ الرَّحْمَنِ أَنَّهُ رَأَى عَرْفَجَةَ قَالَأُصِيبَ أَنْفُ عَرْفَجَةَ يَوْمَ الْكُلَابِ فَاتَّخَذَ أَنْفًا مِنْ وَرِقٍ فَأَنْتَنَ عَلَيْهِ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَّخِذَ أَنْفًا مِنْ ذَهَبٍحَدَّثَنَا أَبُو عَامِرٍ الْعَدَوِيُّ حَوْثَرَةُ بْنُ أَشْرَسَ أَخْبَرَنِي أَبُو الْأَشْهَبِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ طَرَفَةَ بْنِ عَرْفَجَةَ بْنِ أَسْعَدَ أَنَّ جَدَّهُ عَرْفَجَةَ بْنَ أَسْعَدَ أُصِيبَ أَنْفُهُ فِي الْجَاهِلِيَّةِ يَوْمَ الْكُلَابِ فَذَكَرَ الْحَدِيثَ قَالَ أَبُو الْأَشْهَبِ وَزَعَمَ عَبْدُ الرَّحْمَنِ أَنَّهُ قَدْ رَأَى جَدَّهُ يَعْنِي عَرْفَجَةَ حَدَّثَنَا مُحَمَّدُ بْنُ تَمِيمٍ النَّهْشَلِيُّ حَدَّثَنِي أَبُو الْأَشْهَبِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ طَرَفَةَ بْنِ عَرْفَجَةَ بْنِ أَسْعَدَ عَنْ جَدِّهِ عَرْفَجَةَ بْنِ أَسْعَدَ أَنَّ أَنْفَهُ أُصِيبَ يَوْمَ الْكُلَابِ فِي الْجَاهِلِيَّةِ فَذَكَرَ مِثْلَهُ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ جَعْفَرِ بْنِ حَيَّانَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ طَرَفَةَ بْنِ عَرْفَجَةَ أَنَّ جَدَّهُ عَرْفَجَةَ أُصِيبَ أَنْفُهُ يَوْمَ الْكِلَابِ فَذَكَرَ الْحَدِيثَ حَدَّثَنَا يَحْيَى بْنُ عُثْمَانَ يَعْنِي الْجَرْمِىَّ السِّمْسَارَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ عَنْ جَعْفَرِ بْنِ حَيَّانَ الْعُطَارِدِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ طَرَفَةَ بْنِ عَرْفَجَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ أُصِيبَ أَنْفُهُ يَوْمَ الْكُلَابِ يَعْنِي مَاءً اقْتَتَلُوا عَلَيْهِ فِي الْجَاهِلِيَّةِ فَذَكَرَ مِثْلَهُ قَالَ فَمَا أَنْتَنَ عَلَيَّ",
                "id": "Telah menceritakan kepada kami Abdullah, telah menceritakan kepada kami [Syaiban], telah menceritakan kepada kami [Abul Asyhab Al 'Utharidi Ja'far bin Hayyan], telah menceritakan kepada kami [Abdurrahman bin Tharafah bin Arfajah] ia berkata -sedangkan Abdurrahman menyangka bila dirinya pernah melihat [Arfajah] - ia berkata; \"Hidung Arfajah terluka pada peristiwa Yaum Kulab, lalu ia menggantinya dengan hidung dari perak, ternyata hal itu menimbulkan bau busuk, lalu Rasulullah Shallalahu 'alaihi wasallam memerintahkannya supaya mengenakan hidung dari emas.\" Telah menceritakan kepada kami [Abu 'Amir Al 'Adawi Hautsarah bin Asyras], telah menceritakan kepadaku [Abul Asyhab] dari [Abdurrahman bin Tharafah bin Arfajah bin As'ad] bahwa hidungnya terluka pada peristiwa Yaum Kulab di masa Jahiliyah, lalu ia menyebutkan hadits tersebut. [Abul Asyhab] mengatakan; bahwa ia pernah melihat kakeknya yaitu 'Arfajah. Telah menceritakan kepada kami [Muhammad bin Tamim An Nahsyali] telah menceritakan kepadaku [Abu Al Asyhab] dari [Abdurrahman bin Tharfah bin 'Arfajah bin As'ad] dari kakeknya ['Arfajah bin As'ad] bahwa hidungnya pernah terluka (terpotong) pada hari Yaum Kulab di masa Jahiliyah, lalu ia sebutkan hadits seperti itu. Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah], telah menceritakan kepada kami [Abdullah bin Mubarak] dari [Ja'far bin Hayyan], telah menceritakan kepadaku [Abdurrahman bin Tharafah bin 'Arfajah] bahwa kakeknya ['Arfajah] hidungnya pernah terluka (terpotong) dalam peristiwa Yaum Kilab, lalu ia menyebutkan hadits. Telah menceritakan kepada kami [Yahya bin Utsman yaitu Al Jarmii As Simsara], telah menceritakan kepada kami [Isma'il bin 'Ayyasy] dari [Ja'far bin Hayyan Al 'Utharidi] dari [Abdurrahman bin Tharafah bin 'Arfajah] dari [Ayahnya] dari [kakeknya] ia berkata; bahwa Hidungnya terluka pada Yaum Kulab yaitu peperangan di atas air di masa jahiliyah, lalu ia menyebutkan hadits tersebut, ia berkata; \"Tanpa lafadz 'antana 'alayya' (menimbulkan bau busuk).\""
            },
            {
                "number": 2578,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا شَيْبَانُ حَدَّثَنَا أَبُو الْأَشْهَبِ عَنْ حَمَّادِ بْنِ أَبِي سُلَيْمَانَ الْكُوفِيِّ قَالَرَأَيْتُ الْمُغِيرَةَ بْنَ عَبْدِ اللَّهِ قَدْ شَدَّ أَسْنَانَهُ بِالذَّهَبِ فَذُكِرَ مِثْلَ ذَلِكَ لِإِبْرَاهِيمَ فَقَالَ لَا بَأْسَ بِهِحَدَّثَنَا عَبْد اللَّهِ أَبُو عَبْد الرَّحْمَنِ قَالَ سَمِعْت أَبِي يَقُولُ جَاءَ قَوْمٌ مِنْ أَصْحَابِ الْحَدِيثِ فَاسْتَأْذَنُوا عَلَى أَبِي الْأَشْهَبِ فَأَذِنَ لَهُمْ فَقَالُوا حَدِّثْنَا قَالَ سَلُوا فَقَالُوا مَا مَعَنَا شَيْءٌ نَسْأَلُكَ عَنْهُ فَقَالَتْ ابْنَتُهُ مِنْ وَرَاءِ السِّتْرِ سَلُوهُ عَنْ حَدِيثِ عَرْفَجَةَ بْنِ أَسْعَدَ أُصِيبَ أَنْفُهُ يَوْمَ الْكُلَابِ",
                "id": "Telah menceritakan kepada kami Abdullah, telah menceritakan kepada kami [Syaiban], telah menceritakan kepada kami [Abul Asyhab] dari [Hammad bin Abu Sulaiman Al Kufi] ia berkata; saya melihat Al Mughirah bin Abdullah telah mengganti giginya dengan emas, maka hal itu disebutkan kepada [Ibrahim], namun ia berkata; 'Tidak mengapa.\" Telah menceritakan kepada kami Abdulah Abu Abdurrahman, ia berkata; saya mendengar Ayahku berkata; \"Telah datang suatu kaum dari ahli hadits kepada Abul Al Asyhab, mereka meminta izin menemuinya, setelah Abu Al Asyhab mengizinkannya, mereka bertanya; \"Sampaikanlah hadits kepada kami!.\" Ia bekata; \"Tanyakanlah!.\" Mereka menjawab; \"Tidak ada sesuatu yang kami tanyakan padamu.\" putrinya yang berada di balik satir berkata; \"Tanyakanlah kepadanya tentang hadits 'Arfajah bin As'ad yang hidungnya terluka dalam peristiwa Kulab.\""
            },
            {
                "number": 2579,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ زِيَادِ بْنِ عِلَاقَةَ قَالَ سَمِعْتُ عَرْفَجَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّهُ سَتَكُونُ هَنَاتٌ وَهَنَاتٌ فَمَنْ أَرَادَ أَنْ يُفَرِّقَ أَمْرَ هَذِهِ الْأُمَّةَ وَهُمْ جَمِيعٌ فَاضْرِبُوهُ بِالسَّيْفِ كَائِنًا مَنْ كَانَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah] dari [Ziyad bin 'Ilaqah] ia berkata, saya mendengar ['Arfajah] berkata; \"Aku mendengar Rasulullah Shallalahu 'alaihi wasallam bersabda: 'Akan datang gelombang fitnah yang diteruskan dengan fitnah-fitnah, barangsiapa ingin memecah belah urusan umat ini sedang mereka dalam keadaan bersatu, maka bunuhlah ia dengan pedang kapan dan dimanapun saja.\""
            },
            {
                "number": 2580,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا عَبَّادُ بْنُ رَاشِدٍ قَالَ سَمِعْتُ الْحَسَنَ يَقُولُ حَدَّثَنِي رَجُلٌ مِنْ بَنِي سَلِيطٍأَنَّهُ مَرَّ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ جَالِسٌ عَلَى بَابِ الْمَسْجِدِ وَعَلَيْهِ ثَوْبٌ قِطْرِيٌّ لَيْسَ عَلَيْهِ غَيْرُهُ مُحْتَبٍ بِهِ وَهُوَ يَقُولُ الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَظْلِمُهُ وَلَا يَخْذُلُهُ التَّقْوَى هَاهُنَا وَيُشِيرُ بِيَدِهِ إِلَى صَدْرِهِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman], telah menceritakan kepada kami ['Abbad bin Rasyid], ia berkata; Aku mendengar [Al Hasan] berkata; telah menceritakan kepadaku [seseorang] dari bani Salith bahwa ia pernah melewati Rasulullah Shallalahu 'alaihi wasallam ketika beliau tengah duduk ihtiba' (duduk dengan meletakan kedua lutut pada dada) di pintu masjid sambil mengenakan pakaian katun yang tebal, tanpa mengenakan pakaian yang lain, beliau bersabda: \"Seorang muslim adalah saudara muslim lainnya, janganlah ia menzhalimi saudaranya, jangan menghinanya, taqwa itu disini!.\" -beliau sambil menunjuk ke dadanya-."
            },
            {
                "number": 2581,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ عَنْ يُونُسَ حَدَّثَنِي أَبُو الْعَلَاءِ بْنُ الشِّخِّيرِ حَدَّثَنِي أَحَدُ بَنِي سُلَيْمٍ وَلَا أَحْسَبُهُ إِلَّا قَدْرَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَبْتَلِي عَبْدَهُ بِمَا أَعْطَاهُ فَمَنْ رَضِيَ بِمَا قَسَمَ اللَّهُ عَزَّ وَجَلَّ لَهُ بَارَكَ اللَّهُ لَهُ فِيهِ وَوَسَّعَهُ وَمَنْ لَمْ يَرْضَ لَمْ يُبَارِكْ لَهُ",
                "id": "Telah menceritakan kepada kami [Isma'il] dari [Yunus], telah menceritakan padaku [Abul 'Alaa' bin Syikhir], telah menceritakan kepadaku [seseorang] dari bani Sulaim, dan aku tidak pernah menyangka kecuali telah melihat Rasulullah Shallalahu 'alaihi wasallam bahwa Allah Tabaraka Wa Ta'ala akan menguji hamba-Nya dengan pemberian, barangsiapa ridha terhadap pemberian Allah Azza wa Jalla, maka Allah akan memberkahinya dan barangsiapa tidak ridha maka Allah tidak akan memberkahinya.\""
            },
            {
                "number": 2582,
                "arab": "حَدَّثَنَا دَاوُدُ بْنُ عَمْرٍو الضَّبِّيُّ حَدَّثَنَا عَلِيُّ بْنُ هَاشِمٍ يَعْنِي ابْنَ الْبَرِيدِ عَنْ أَبِي بِشْرٍ الْحَلَبِيِّ عَنْ أَبِي مَلِيحِ بْنِ أُسَامَةَ عَنْ أَبِيهِ قَالَأَصَابَ النَّاسَ فِي يَوْمِ جُمُعَةٍ يَعْنِي مَطَرًا فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنُودِيَ أَنَّ الصَّلَاةَ الْيَوْمَ أَوْ الْجُمُعَةَ الْيَوْمَ فِي الرِّحَالِحَدَّثَنَا دَاوُدُ بْنُ عَمْرٍو حَدَّثَنَا نَافِعُ بْنُ عُمَرَ بْنِ جَمِيلٍ الْجُمَحِيُّ قَالَ رَأَيْتُ عَطَاءً وَابْنَ أَبِي مُلَيْكَةَ وَعِكْرِمَةَ بْنَ خَالِدٍ يَرْمُونَ الْجَمْرَةَ قَبْلَ الْفَجْرِ يَوْمَ النَّحْرِ فَقَالَ لَهُ أَبِي يَا أَبَا سُلَيْمَانَ فِي أَيِّ سَنَةٍ سَمِعْتَ مِنْ نَافِعِ بْنِ عُمَرَ قَالَ سَنَةَ تِسْعٍ وَسِتِّينَ وَمِائَةٍ سَنَةَ وَقْعَةِ الْحُسَيْنِ",
                "id": "Telah menceritakan kepada kami [Dawud bin 'Amru Adh Dhabbi], telah menceritakan kepada kami [Ali bin Hasyim yaitu Ibnul Barid] dari [Abu Bisyr Al Halabi] dari [Abu Malih bin Usamah] dari [Ayahnya] ia berkata; \"Pernah hujan turun di hari Jum'at, maka Nabi Shalallahu 'alaihi wasallam memerintahkan supaya sholat Jum'at hari itu dikerjakan di persinggahan masing-masing.\" Telah menceritakan kepada kami Dawud bin 'Amru, telah menceritakan kepada kami Nafi' bin Umar bin Jamil Al Jumahi ia berkata; saya pernah melihat 'Atha` dan Abu Mulaikah serta Ikrimah bin Khalid melempar jumrah sebelum fajar pada hari Idul Qurban, lantas ayahku berkata; \"Wahai Abu Sulaiman, pada tahun berapakah anda mendengar dari Nafi' bin Umar?.\" Ia berkata; \"Ketika terjadi peristiwa pembunuhan Husain di tahun seratus enam puluh sembilan.\""
            },
            {
                "number": 2583,
                "arab": "حَدَّثَنَا دَاوُدُ بْنُ عَمْرٍو حَدَّثَنَا نَافِعُ بْنُ عُمَرَ الْجُمَحِيُّ عَنِ الْقَاسِمِ بْنِ أَبِي بَزَّةَفِي قَوْلِهِ تَبَارَكَ وَتَعَالَى{ وَلَا تَمْنُنْ تَسْتَكْثِرُ }قَالَ لَا تُعْطِي شَيْئًا تَطْلُبُ أَكْثَرَ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Dawud bin 'Amru], telah menceritakan kepada kami [Nafi' bin Umar Al Jumahi] dari [Al Qasim bin Abu Bazzah], tentang firman Allah Tabaraka wa Ta'ala, \"Dan janganlah kamu memberi (dengan maksud) memperoleh (balasan) yang lebih banyak.\" Dia berkata; \"Janganlah engkau memberi sesuatu untuk meminta lebih banyak dari pemberian tersebut.\""
            },
            {
                "number": 2584,
                "arab": "حَدَّثَنَا نُوحُ بْنُ حَبِيبٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثِ بْنِ طَلْقِ بْنِ مُعَاوِيَةَ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ ثَعْلَبَةَ بْنِ عَاصِمٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَجَبًا لِلْمُؤْمِنِ لَا يَقْضِي اللَّهُ لَهُ شَيْئًا إِلَّا كَانَ خَيْرًا لَهُ",
                "id": "Telah menceritakan kepada kami [Nuh bin Habib], telah menceritakan kepada kami [Hafsh bin Ghiyats bin Thalq bin Mu'awiyah] dari ['Ashim Al Ahwal] dari [Tsa'labah bin 'Ashim] dari [Anas bin Malik] ia berkata; Rasulullah Shallalahu 'alaihi wasallam bersabda: \"Sungguh mengherankan orang mukmin itu, tidaklah Allah menetapkan sesuatu kecuali baik baginya.\""
            },
            {
                "number": 2585,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ أَخْبَرَنَا الْجُرَيْرِيُّ عَنْ أَبِي الْعَلَاءِ قَالَ قَالَ رَجُلٌكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ وَالنَّاسُ يَعْتَقِبُونَ وَفِي الظَّهْرِ قِلَّةٌ فَحَانَتْ نَزْلَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَزْلَتِي فَلَحِقَنِي مِنْ بَعْدِي فَضَرَبَ مَنْكِبَيَّ فَقَالَ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ فَقُلْتُ أَعُوذُ بِرَبِّ الْفَلَقِ فَقَرَأَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَرَأْتُهَا مَعَهُ ثُمَّ قَالَ قُلْ أَعُوذُ بِرَبِّ النَّاسِ فَقَرَأَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَرَأْتُهَا مَعَهُ قَالَ إِذَا أَنْتَ صَلَّيْتَ فَاقْرَأْ بِهِمَا",
                "id": "Telah menceritakan kepada kami [Isma'il], telah mengabarkan kepada kami [Al Jurairi] dari [Abul Alaa`] ia berkata; [seseorang] berkata; \"Kami bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan. Sementara orang-orang mengitari beliau. Ketika waktu zhuhur telah dekat, Rasulullah shallallahu 'alaihi wasallam turun dan aku pun ikut turun. Beliau menemuiku lalu menepuk kedua pundakku. Sabda beliau: \"Ucapkanlah, 'Qul a'udzu birabbil falaq.\" Maka aku pun mengucapkan, \"A'udzu birabbil falaq.\" Rasulullah shallallahu 'alaihi wasallam membacanya lagi lalu aku pun membacanya bersama beliau. Beliau lantas bersabda: \"Ucapkanlah 'Qul a'udzu birabbinnas'!, Rasulullah shallallahu 'alaihi wasallam membacanya dan aku pun membacanya bersama beliau. Sabda beliau: \"Jika kau sholat, bacalah kedua surat tersebut.\""
            },
            {
                "number": 2586,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ عَلْقَمَةَ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ عَنْ رِجَالٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَتَّقِ اللَّهَ عَزَّ وَجَلَّ وَلْيُكْرِمْ جَارَهُ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَتَّقِ اللَّهَ وَلْيُكْرِمْ ضَيْفَهُ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَتَّقِ اللَّهَ وَلْيَقُلْ حَقًّا أَوْ لِيَسْكُتْحَدَّثَنَا حَجَّاجٌ حَدَّثَنِي شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ عَلْقَمَةَ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ عَنْ رِجَالٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah], ia berkata; Aku mendengar [Qatadah] menceritakan dari ['Alqamah bin Abdullah Al Muzanni] dari [beberapa sahabat] Rasulullah Shallalahu 'alaihi wasallam bahwa beliau bersabda: \"Barangsiapa beriman kepada Allah dan hari akhir, hendaklah ia bertaqwa kepada Allah 'azza wajalla dan memuliakan tetangganya. Barangsiapa beriman kepada Allah dan hari akhir, hendaklah ia bertaqwa kepada Allah dan memuliakan tamunya. Barangsiapa beriman kepada Allah dan hari akhir, hendaklah ia bertaqwa kepada Allah dan berkata benar atau diam.\" Telah menceritakan kepada kami [Hajjaj], telah menceritakan kepadaku [Syu'bah], dia berkata; \"Aku mendengar [Qatadah] menceritakan dari ['Alqamah bin 'Abdillah al-Muzanni] dari [beberapa orang] sahabat Nabi shallallahu 'alaihi wasallam dari Nabi shallallahu 'alaihi wasallam, lalu ia menyebutkan yang hadits semisal itu."
            },
            {
                "number": 2587,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ نَصْرِ بْنِ عَاصِمٍ عَنْ رَجُلٍ مِنْهُمْأَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْلَمَ عَلَى أَنَّهُ لَا يُصَلِّي إِلَّا صَلَاتَيْنِ فَقَبِلَ ذَلِكَ مِنْهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Nashr bin 'Ashim] dari seorang [laki-laki] di antara mereka, bahwa laki-laki itu pernah dating menemui Nabi shallallahu 'alaihi wasallam dan menyatakan keIslamannya dengan syarat tidak mengerjakan sholat kecuali dua sholat, beliau pun menerima hal itu.\""
            },
            {
                "number": 2588,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا عَلِيُّ بْنُ زَيْدٍ حَدَّثَنَا الْحَسَنُ قَالَ وَأَخْبَرَنِي رَجُلٌ مِنْ بَنِي سَلِيطٍ قَالَدُفِعْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَمِعْتُهُ يَقُولُ الْمُسْلِمُ أَخُو الْمُسْلِمِ لَا يَظْلِمُهُ وَلَا يَخْذُلُهُ التَّقْوَى هَاهُنَا التَّقْوَى هَاهُنَا مَرَّتَيْنِ أَوْ ثَلَاثًا وَأَشَارَ بِيَدِهِ إِلَى صَدْرِهِ",
                "id": "Telah menceritakan kepada kami [Husyaim], telah mengabarkan kepada kami [Ali bin Zaid]; telah menceritakan kepada kami [Al Hasan], ia berkata; telah mengabarkan kepadaku [seseorang] dari bani Salith, ia berkata; aku telah di laporkan kepada Rasulullah shallallahu 'alaihi wasallam, lalu aku mendengar beliau bersabda: \"Seorang muslim adalah saudara muslim lainnya, maka janganlah ia menzhaliminya dan jangan menghinanya, taqwa itu di sini.\" -beliau menyebutkan dua atau tiga kali sambil menunjuk ke dadanya.-"
            },
            {
                "number": 2589,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سَوَادَةُ بْنُ أَبِي الْأَسْوَدِ عَنْ أَبِيهِ عَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا رَاعٍ اسْتُرْعِيَ رَعِيَّةً فَغَشَّهَا فَهُوَ فِي النَّارِ",
                "id": "Telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami [Sawadah bin Abul Aswad] dari [Ayahnya] dari [Ma'qil bin Yasar], dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pemimpin mana saja yang dipercaya memimpin rakyat, lalu ia menipu mereka, maka ia akan masuk Neraka.\""
            },
            {
                "number": 2590,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ قَالَ سَمِعْتُ إِسْمَاعِيلَ الْبَصْرِيَّ يُحَدِّثُ عَنْ ابْنَةِ مَعْقِلِ بْنِ يَسَارٍ عَنْ أَبِيهَا مَعْقِلٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَيْسَ مِنْ وَالِي أُمَّةٍ قَلَّتْ أَوْ كَثُرَتْ لَا يَعْدِلُ فِيهَا إِلَّا كَبَّهُ اللَّهُ تَبَارَكَ وَتَعَالَى عَلَى وَجْهِهِ فِي النَّارِ",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Isma'il bin Abu Khalid] ia berkata; saya mendengar [Isma'il Al Bashri] menceritakan dari [putrinya Ma'qil bin Yasar] dari ayahnya yaitu [Ma'qil] ia berkata; Aku mendengar Rasulullah Shallalahu 'alaihi wasallam bersabda: \"Tidaklah seorang pemimpin kaum baik sedikit atau banyak, kemudian ia tidak adil kecuali Allah akan melemparkan wajahnya ke Neraka.\""
            },
            {
                "number": 2591,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ عَنْ يُونُسَ عَنِ الْحَسَنِ أَنَّ مَعْقِلَ بْنَ يَسَارٍ اشْتَكَى فَدَخَلَ عَلَيْهِ عَبْدُ اللَّهِ بْنُ زِيَادٍ يَعْنِي يَعُودُهُ فَقَالَ أَمَا إِنِّي سَأُحَدِّثُكَ حَدِيثًا لَمْ أَكُنْ حَدَّثْتُكَ بِهِ إِنِّيسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَسْتَرْعِي اللَّهُ تَبَارَكَ وَتَعَالَى عَبْدًا رَعِيَّةً فَيَمُوتُ يَوْمَ يَمُوتُ وَهُوَ لَهَا غَاشٌّ إِلَّا حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ",
                "id": "Telah menceritakan kepada kami [Isma'il] dari [Yunus] dari [Al Hasan] bahwa [Ma'qil bin Yasar] pernah menemuinya karena suatu kepentingan, lalu datanglah Abdullah bin Ziyad menjenguknya dan berkata; Aku akan menceritakan kepadamu satu hadits yang belum pernah aku sampaikan padamu, sesungguhnya aku mendengar Rasulullah Shallalahu 'alaihi wasallam bersabda -atau sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda-: \"Tidaklah Allah Tabaraka wa Ta'ala memberikan kepemimpinan pada seorang hamba lalu ia mati padahal ia telah menipu, melainkan Allah mengharamkan kepadanya surga.\""
            },
            {
                "number": 2592,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ الثَّقَفِيُّ أَبُو مُحَمَّدٍ حَدَّثَنَا خَالِدٌ عَنِ الْحَكَمِ بْنِ عَبْدِ اللَّهِ الْأَعْرَجِ عَنْ مَعْقِلِ بْنِ يَسَارٍ أَنَّهُشَهِدَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ الْحُدَيْبِيَةِ وَهُوَ رَافِعٌ غُصْنًا مِنْ أَغْصَانِ الشَّجَرَةِ بِيَدِهِ عَنْ رَأْسِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُبَايِعُ النَّاسَ فَبَايَعُوهُ عَلَى أَنْ لَا يَفِرُّوا وَهُمْ يَوْمَئِذٍ أَلْفٌ وَأَرْبَعُ مِائَةٍحَدَّثَنَا عَبْد اللَّهِ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ عَنْ سُفْيَانَ عَنْ خَالِدٍ عَنِ الْحَكَمِ بْنِ الْأَعْرَجِ{ يَدُ اللَّهِ فَوْقَ أَيْدِيهِمْ }قَالَ أَنْ لَا يَفِرُّوا",
                "id": "Telah menceritakan kepada kami [Abdul Wahhab bin Abdul Majid Ats Tsaqafi Abu Muhammad], telah menceritakan kepada kami [Khalid] dari [Al Hakam bin Abdullah Al A'raj] dari [Ma'qil bin Yasar], bahwa ia pernah ikut menyaksikan Rasulullah shallallahu 'alaihi wasallam saat peristiwa Hudaibiyah. Kala itu, ia mengangkat ranting di antara beberapa ranting pohon dengan tangannya untuk menjauhkannya dari kepala Rasulullah shallallahu 'alaihi wasallam, ketika para sahabat sedang berbaiat kepada beliau. Mereka berbai'at untuk tidak melarikan diri. Hari itu mereka berjumlah seribu empat ratus orang.\" Telah menceritakan kepada kami Abdullah, telah menceritakan kepada kami ['ubaidhullah bin 'Umar Al Qawarizmi], telah menceritakan kepada kami [Yahya bin Yaman] dari [Sufyan] dari [Khalid] dari [Al Hakam bin Al A'raj] bahwa \"Tangan Allah di atas tangan mereka\" katanya, \"Agar mereka tidak melarikan diri.\""
            },
            {
                "number": 2593,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ حَدَّثَنِي عِيَاضٌ أَبُو خَالِدٍ قَالَ كَانَ بَيْنَ جَارَيْنِ لمَعْقِلِ بْنِ يَسَارٍ كَلَامٌ فَصَارَتْ الْيَمِينُ عَلَى أَحَدِهِمَا فَسَمِعْتُ مَعْقِلَ بْنَ يَسَارٍ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ عَلَى يَمِينٍ يَقْتَطِعُ بِهَا مَالَ أَخِيهِ لَقِيَ اللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُحَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ أَبِي خَالِدٍ عَنْ إِسْمَاعِيلَ الْأَوْدِيِّ عَنِ ابْنَةِ مَعْقِلٍ الْمُزَنِيِّ قَالَتْ لَمَّا ثَقُلَ أَبِي أَتَاهُ ابْنُ زِيَادٍ وَسَاقَهُ يَعْنِي وَسَاقَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id], dari [Syu'bah], telah menceritakan kepadaku ['Iyadh Abu Khalid] ia berkata; Dua orang tetanga Ma'ql bin Yasar tengah adu mulut, hingga salah seorang diantara keduanya bersumpah atas yang lain, lalu aku mendengar [Ma'qil bin Yasar] mengatakan; Rasulullah Shallalahu 'alaihi wasallam bersabda: \"Barangsiapa mengucapkan sumpah yang dengannya ia mengambil harta saudaranya, niscaya ia akan menemui Allah dalam keadaan murka kepadanya.\" Telah menceritakan kepada kami [Ya'la bin 'Ubaid] telah menceritakan kepada kami [Isma'il yaitu Ibnu Abu Khalid] dari [Isma'il Al Audi] dari [putrinya Ma'qil Al Muzanni] ia berkata; Ketika [Ayahku] sedang dalam keadaan payah, Ibnu Ziyad dating menjenguk lalu ia menyebutkan hadits tersebut.\""
            },
            {
                "number": 2594,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْفَضْلُ بْنُ دَلْهَمٍ عَنِ ابْنِ سِيرِينَ عَنْ مَعْقِلِ بْنِ يَسَارٍأَنَّ رَجُلًا مِنْ الْأَنْصَارِ تَزَوَّجَ امْرَأَةً فَسَقَطَ شَعَرُهَا فَسُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْوِصَالِ فَلَعَنَ الْوَاصِلَةَ وَالْمَوْصُولَةَ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Al Fadhl bin Dalham] dari [Ibnu Sirin] dari [Ma'qil bin Yasar] bahwa seorang laki-laki Anshar menikah dengan seorang wanita. Ternyata rambutnya wanita itu rontok. Ketika Nabi shallallahu 'alaihi wasallam ditanya tentang wishal (menyambung rambut), beliau melaknat wanita yang menyambung dan yang minta disambungkan rambutnya.\""
            },
            {
                "number": 2595,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ وَعَفَّانُ قَالَا حَدَّثَنَا الْمُثَنَّى بْنُ عَوْفٍ حَدَّثَنَا أَبُو عَبْدِ اللَّهِ الْجَسْرِيُّ قَالَ سَأَلْتُ مَعْقِلَ بْنَ يَسَارٍعَنْ الشَّرَابِ فَقَالَ كُنَّا بِالْمَدِينَةِ وَكَانَتْ كَثِيرَةَ التَّمْرِ فَحَرَّمَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْفَضِيخَوَأَتَاهُ رَجُلٌ فَسَأَلَهُ عَنْ أُمٍّ لَهُ عَجُوزٍ كَبِيرَةٍ أَنَسْقِيهَا النَّبِيذَ فَإِنَّهَا لَا تَأْكُلُ الطَّعَامَ فَنَهَاهُ مَعْقِلٌ",
                "id": "Telah menceritakan kepada kami [Abdushamad] dan ['Affan], keduanya berkata; telah menceritakan kepada kami [Al Mutsanna bin 'Auf], telah menceritakan kepada kami [Abu 'Abdillah Al Jasri] dia berkata; saya pernah bertanya kepada [Ma'qil bin Yasar] tentang minuman, dia menjawab; \"Kami pernah berada di Madinah, saat itu, di sana tengah musim buah kurma, kemudian Rasulullah shallallahu 'alaihi wasallam mengharamkan perasan buah (kurma atau anggur) terhadap kami.\" Beberapada saat kemudian seorang laki-laki datang sambil menanyakan perihal ibunya yang telah tua renta; \"Apakah kami boleh memberinya minuman tersebut? mengingat ia tidak makan makanan? ' Namun Ma'qil tetap melarangnya.\""
            },
            {
                "number": 2596,
                "arab": "حَدَّثَنَا عَارِمٌ حَدَّثَنَا مُعْتَمِرٌ عَنْ أَبِيهِ عَنْ رَجُلٍ عَنْ أَبِيهِ عَنْ مَعْقِلِ بْنِ يَسَارٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْبَقَرَةُ سَنَامُ الْقُرْآنِ وَذُرْوَتُهُ نَزَلَ مَعَ كُلِّ آيَةٍ مِنْهَا ثَمَانُونَ مَلَكًا وَاسْتُخْرِجَتْ{ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ }مِنْ تَحْتِ الْعَرْشِ فَوُصِلَتْ بِهَا أَوْ فَوُصِلَتْ بِسُورَةِ الْبَقَرَةِ وَيس قَلْبُ الْقُرْآنِ لَا يَقْرَؤُهَا رَجُلٌ يُرِيدُ اللَّهَ تَبَارَكَ وَتَعَالَى وَالدَّارَ الْآخِرَةَ إِلَّا غُفِرَ لَهُ وَاقْرَءُوهَا عَلَى مَوْتَاكُمْ",
                "id": "Telah menceritakan kepada kami ['Arim], telah menceritakan kepada kami [Mu'tamir] dari [Ayahnya] dari [Seseorang] dari Ayahnya dari [Ma'qil bin Yasar], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Al Baqarah adalah Al Qur'an kedudukan yang tertinggi dan puncaknya. Delapan puluh Malaikat turun menyertai masing-masing ayatnya. Laa ilaaha illaahu wal hayyul qayyuum di bawah 'Arsy, lalu ia digabungkan dengannya, atau digabungkan dengan surat Al Baqarah. Sedangkan Yasin adalah hati Al Qur'an. Tidaklah seseorang membacanya, sedang ia mengharap (ridla) Allah Tabaraka wa Ta'ala dan akhirat, melainkan dosanya akan di ampuni. Bacakanlah surat tersebut terhadap orang-orang yang mati di antara kalian.\""
            },
            {
                "number": 2597,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ حَدَّثَنَا الْحَكَمُ بْنُ عَطِيَّةَ عَنْ أَبِي الرَّبَابِ قَالَ سَمِعْتُ مَعْقِلَ بْنَ يَسَارٍ يَقُولُكُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَسِيرٍ لَهُ فَنَزَلْنَا فِي مَكَانٍ كَثِيرِ الثُّومِ وَإِنَّ أُنَاسًا مِنْ الْمُسْلِمِينَ أَصَابُوا مِنْهُ ثُمَّ جَاءُوا إِلَى الْمُصَلَّى يُصَلُّونَ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَهَاهُمْ عَنْهَا ثُمَّ جَاءُوا بَعْدَ ذَلِكَ إِلَى الْمُصَلَّى فَنَهَاهُمْ عَنْهَا ثُمَّ جَاءُوا بَعْدَ ذَلِكَ إِلَى الْمُصَلَّى فَنَهَاهُمْ عَنْهَا ثُمَّ جَاءُوا بَعْدَ ذَلِكَ إِلَى الْمُصَلَّى فَوَجَدَ رِيحَهَا مِنْهُمْ فَقَالَ مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ فَلَا يَقْرَبْنَا فِي مَسْجِدِنَاحَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا الْحَكَمُ بْنُ أَبِي الْقَاسِمِ الْحَنَفِيُّ أَبُو عَزَّةَ الدَّبَّاغُ عَنْ أَبِي الرَّبَابِ عَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَسِيرٍ لَهُ فَذَكَرَ مَعْنَاهُ حَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا أَبُو يَعْقُوبَ يَعْنِي إِسْحَاقَ بْنَ عُثْمَانَ حَدَّثَنِي حُمْرَانُ أَوْ حَمْدَانُ مَوْلَى مَعْقِلِ بْنِ يَسَارٍ عَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَ صَحِبْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَذَا وَكَذَا",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Zubair], telah menceritakan kepada kami [Al Hakam bin 'Athiyah] dari [Abu Rabab], dia mengatakan; saya mendengar [Ma'qil bin Yasar] ia berkata; \"Kami pernah bersama Nabi shallallahu 'alaihi wasallam dalam suatu perjalanan. Kami singgah di suatu tempat yang terdapat banyak bawang putihnya, sementara kaum muslimin banyak yang memakannya. Mereka lantas datang ke tempat sholat, dan sholat bersama Nabi shallallahu 'alaihi wasallam, lalu beliau pun melarang mereka memakannya. Setelah itu, mereka datang lagi ke tempat sholat dan beliau mendapati baunya dari mereka. Beliau bersabda: \"Barangsiapa memakan tumbuhan ini, maka janganlah mendekat di masjid kami.\" Telah menceritakan kepada kami [Yunus bin Muhammad] telah menceritakan kepada kami [Al Hakam bin Abu Al Qasim Al Hanafi Abu 'Azzah Ad Dabbagh], dari [Abu Ar Rabbab] dari [Ma'qil bin Yasar] dia berkata; \"Kami pernah bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan.\" Ia kemudian menyebutkan makna serupa. Telah menceritakan kepada kami [Abu Sa'id] bekas budak Bani Hasyim, telah menceritakan kepada kami [Abu Ya'qub yaitu Ishaq bin 'Utsman], telah mengabarkan kepadaku [Humran] atau Hamdan bekas budak Ma'qil bin Yasar, dari [Ma'qil bin Yasar] dia berkata; \"Saya pernah menemani Nabi shallallahu 'alaihi wasallam sekian dan sekian.\""
            },
            {
                "number": 2598,
                "arab": "حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ أَبُو الْيَمَانِ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ عَنْ أَبِي شَيْبَةَ يَحْيَى بْنِ يَزِيدَ عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ نُفَيْعِ بْنِ الْحَارِثِ عَنْ مَعْقِلٍ الْمُزَنِيِّ قَالَأَمَرَنِي النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَقْضِيَ بَيْنَ قَوْمٍ فَقُلْتُ مَا أَحْسَنَ أَنْ أَقْضِيَ يَا رَسُولَ اللَّهِ قَالَ اللَّهُ مَعَ الْقَاضِي مَا لَمْ يَحِفْ عَمْدًا",
                "id": "Telah menceritakan kepada kami [Al Hakam bin Nafi' Abul Yaman], telah menceritakan kepada kami [Isma'il bin 'Ayyasy] dari [Abu Syaibah Yahya bin Yazid] dari [Zaid bin Abu 'Unaisah] dari [Nufai' bin Al Harits] dari [Ma'qil Al Muzani] dia berkata; \"Nabi shallallahu 'alaihi wasallam memerintahkanku mengadili (perkara) beberapa orang, Kukatakan; \"Betapa bagusnya apa yang hendak aku putuskan, wahai Rasulullah.' Beliau bersabda: \"Allah akan bersama seorang hakim, selama tidak berbuat curang dengan sengaja.\""
            },
            {
                "number": 2599,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ عَنْ عَبْدِ الْمَلِكِ بْنِ قَتَادَةَ بْنِ مِلْحَانَ الْقَيْسِيِّ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا بِصِيَامِ لَيَالِي الْبِيضِ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ وَقَالَ هِيَ كَصَوْمِ الدَّهْرِ",
                "id": "Telah menceritakan kepada kami [Abdushamad], telah menceritakan kepada kami [Hammam], telah menceritakan kepada kami [Anas bin Sirin] dari [Abdul Malik bin Qatadah bin Milhan Al Qaissy] dari [Ayahnya] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam dulu pernah memerintahkan kami berpuasa yaumul bidl (pertengahan bulan), yaitu; tanggal tiga belas, empat belas, dan lima belas. Sabda beliau: \"puasa yaumul bidl seperti puasa setahun.\""
            },
            {
                "number": 2600,
                "arab": "حَدَّثَنَا عَارِمٌ حَدَّثَنَا مُعْتَمِرٌ قَالَ وَحَدَّثَ أَبِي عَنِ الْعَلَاءِ بْنِ عُمَيْرٍ قَالَ كُنْتُ عِنْدَ قَتَادَةَ بْنِ مِلْحَانَ حِينَ حُضِرَ فَمَرَّ رَجُلٌ فِي أَقْصَى الدَّارِ قَالَ فَأَبْصَرْتُهُ فِي وَجْهِ قَتَادَةَ قَالَوَكُنْتُ إِذَا رَأَيْتُهُ كَأَنَّ عَلَى وَجْهِهِ الدِّهَانَ قَالَ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَسَحَ عَلَى وَجْهِهِقَالَ أَبُو عَبْد الرَّحْمَنِ حَدَّثَنَا يَحْيَى بْنُ مَعِينٍ وَهُرَيْمٌ أَبُو حَمْزَةَ قَالَا حَدَّثَنَا مُعْتَمِرٌ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami ['Arim], telah menceritakan kepada kami [Mu'tamir] ia berkata; dan [ayahku] telah bercerita kepadaku dari [Al 'Ala` bin 'Umair], dia berkata; 'Aku pernah bersama [Qatadah bin Milhan] ketika ia tengah sekarat. Lalu, lewatlah seorang laki-laki dari dalam rumah, Al 'Alla` berkata; \"Kulihat wajah Qatadah.\" Katanya lagi, \"Ketika aku melihatnya, seakan-akan ada kilapan minyak di wajahnya.\" Katanya; \"Rasulullah shallallahu 'alaihi wasallam dulu pernah mengusap wajahnya.\" Abu Abdurrahman berkata; telah menceritakan kepada kami [Yahya bin Ma'in] dan [Huraim Abu Hamzah] keduanya berkata; telah menceritakan kepada kami [Mu'tamir] lalu ia menyebutkan seperti hadits di atas.\""
            },
            {
                "number": 2601,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا شُعْبَةُ حَدَّثَنِي أَنَسُ بْنُ سِيرِينَ عَنْ عَبْدِ الْمَلِكِ رَجُلٍ مِنْ بَنِي قَيْسِ بْنِ ثَعْلَبَةَ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُهُمْ بِصِيَامِ أَيَّامِ الْبِيضِ وَيَقُولُ هُنَّ صِيَامُ الشَّهْرِ أَوْ قَالَ الدَّهْرِ",
                "id": "Telah menceritakan kepada kami [Bahz], telah menceritakan kepada kami [Syu'bah], telah menceritakan kepada kami [Anas bin Sirin] dari [Abdul Malik] seorang laki-laki dari bani Qais bin Tsa'labah dari [Ayahnya] bahwa Rasulullah Shallalahu 'alaihi wasallam pernah memerintahkan puasa Ayyam Bidh dan beliau bersabda: \"Seperti puasa sebulan atau selama-lamanya.\" "
            },
            {
                "number": 2602,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا هَمَّامٌ عَنْ أَنَسِ بْنِ سِيرِينَ عَنْ عَبْدِ الْمَلِكِ بْنِ قَتَادَةَ بْنِ مِلْحَانَ الْقَيْسِيِّ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا أَنْ نَصُومَ اللَّيَالِي الْبِيضَ ثَلَاثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ وَقَالَ هُنَّ كَهَيْئَةِ الدَّهْرِ",
                "id": "Telah menceritakan kepada kami [Rauh], telah menceritakan kepada kami [Hammam] dari [Anas bin Sirin] dari [Abdul Malik bin Qatadah bin Milhan AL Qaisy] dari [Ayahnya] ia berkata; \"Rasulullah Shallalahu 'alaihi wasallam pernah memerintahkan kami berpuasa yaumul bidh, yaitu; tanggal tiga belas, empat belas dan lima belas, dan beliau bersabda: \"ia seperti puasa selamanya.\" "
            },
            {
                "number": 2603,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ أَنَسَ بْنَ سِيرِينَ قَالَ سَمِعْتُ عَبْدَ الْمَلِكِ بْنَ الْمِنْهَالِ يُحَدِّثُ عَنْ أَبِيهِ قَالَ وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا بِصِيَامِ أَيَّامِ الْبِيضِ الثَّلَاثَةِ وَيَقُولُ هُنَّ صِيَامُ الدَّهْرِ",
                "id": "Telah menceritakan kepada kami [Rauh], telah menceritakan kepada kami [Syu'bah], ia berkata; saya mendengar [Anas bin Sirin] berkata; saya mendengar [Abdul Malik bin Minhal] menceritakan dari [Ayahnya], ia berkata; -dan bapaknya adalah salah seorang sahabat Rasulullah Shallalahu 'alaihi wasallam- Rasulullah Shallalahu 'alaihi wasallam pernah memerintahkan puasa yaumul Bidh, beliau bersabda: \"Ia seperti puasa selama-lamanya.\" "
            },
            {
                "number": 2604,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا شُعْبَةُ عَنْ حُمَيْدِ بْنِ هِلَالٍ قَالَ سَمِعْتُ مُطَرِّفًا يُحَدِّثُ عَنْ أَعْرَابِيٍّ قَالَرَأَيْتُ فِي رِجْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعْلًا مَخْصُوفَةً",
                "id": "Telah menceritakan kepada kami [Abdurrahman], telah menceritakan kepada kami [Syu'bah] dari [Humaid bin Hilal], ia berkata; saya mendengar [Mutharrif] menceritakan dari [seorang Arab badui] ia berkata; \"Saya melihat Rasulullah Shallalahu 'alaihi wasallam mengenakan sandal yang ditambal (dijahit).\""
            },
            {
                "number": 2605,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا الْجُرَيْرِيُّ عَنْ أَبِي السَّلِيلِ قَالَ حَدَّثَتْنِي مُجِيبَةُ عَجُوزٌ مِنْ بِاهِلَةَ عَنْ أَبِيهَا أَوْ عَنْ عَمِّهَا قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحَاجَةٍ مَرَّةً فَقَالَ مَنْ أَنْتَ قَالَ أَوَ مَا تَعْرِفُنِي قَالَ وَمَنْ أَنْتَ قَالَ أَنَا الْبَاهِلِيُّ الَّذِي أَتَيْتُكَ عَامَ أَوَّلٍ قَالَ فَإِنَّكَ أَتَيْتَنِي وَجِسْمُكَ وَلَوْنُكَ وَهَيْئَتُك حَسَنَةٌ فَمَا بَلَغَ بِكَ مَا أَرَى فَقَالَ إِنِّي وَاللَّهِ مَا أَفْطَرْتُ بَعْدَكَ إِلَّا لَيْلًا قَالَ مَنْ أَمَرَكَ أَنْ تُعَذِّبَ نَفْسَكَ مَنْ أَمَرَكَ أَنْ تُعَذِّبَ نَفْسَكَ مَنْ أَمَرَكَ أَنْ تُعَذِّبَ نَفْسَكَ ثَلَاثَ مَرَّاتٍ صُمْ شَهْرَ الصَّبْرِ رَمَضَانَ قُلْتُ إِنِّي أَجِدُ قُوَّةً وَإِنِّي أُحِبُّ أَنْ تَزِيدَنِي فَقَالَ فَصُمْ يَوْمًا مِنْ الشَّهْرِ قُلْتُ إِنِّي أَجِدُ قُوَّةً وَإِنِّي أُحِبُّ أَنْ تَزِيدَنِي قَالَ فَيَوْمَيْنِ مِنْ الشَّهْرِ قُلْتُ إِنِّي أَجِدُ قُوَّةً وَإِنِّي أُحِبُّ أَنْ تَزِيدَنِي قَالَ وَمَا تَبْغِي عَنْ شَهْرِ الصَّبْرِ وَيَوْمَيْنِ فِي الشَّهْرِ قَالَ قُلْتُ إِنِّي أَجِدُ قُوَّةً وَإِنِّي أُحِبُّ أَنْ تَزِيدَنِي قَالَ فَثَلَاثَةَ أَيَّامٍ مِنْ الشَّهْرِ قَالَ وَأَلْحَمَ عِنْدَ الثَّالِثَةِ فَمَا كَادَ قُلْتُ إِنِّي أَجِدُ قُوَّةً وَإِنِّي أُحِبُّ أَنْ تَزِيدَنِي قَالَ فَمِنْ الْحُرُمِ وَأَفْطِرْ",
                "id": "Telah menceritakan kepada kami [Isma'il], telah menceritakan kepada kami [Al Jurairi] dari [Abu Salil] ia berkata; telah menceritakan kepadaku [Mujibah] seorang yang sudah lanjut usia dari Bahilah, dari [Ayahnya] atau dari pamannya, dia berkata; \"Suatu kali, aku pernah datang kepada Rasulullah shallallahu 'alaihi wasallam untuk suatu keperluan. Beliau kemudian bersabda: \"Siapakah kamu?.\" Dia berkata, 'Tidakkah Anda mengenal saya? ' Beliau bersabda lagi: \"Siapakah kamu?.\" Dia berkata; 'Saya adalah orang Bahili yang mendatangi Anda pada tahun pertama.' Beliau bersabda: \"Sesungguhnya kamu dulu mendatangiku dengan badan, warna kulit, dan penampilan yang bagus. Lantas apa yang menyebabkanmu menjadi sebagaimana yang kulihat ini?.\" Dia menjawab; 'Demi Allah, saya tidak pernah makan setelah (aku berpisah dengan) anda kecuali di malam hari.' Sabda beliau: \"Siapakah yang memerintahkanmu menyiksa diri? 'Siapakah yang memerintahkanmu menyiksa diri? 'Siapakah yang memerintahkanmu menyiksa diri?.\" (beliau mengulanginya hingga tiga kali), Berpuasalah pada bulan kesabaran, yaitu Ramadhan.\" Aku berkata; 'Sesungguhnya saya masih kuat dan saya ingin Anda menambahnya untuk saya'. Sabda beliau: \"Berpuasalah satu hari setiap bulan.\" Kukatakan, 'Sesungguhnya saya masih kuat dan saya ingin Anda menambahnya untuk saya.' Beliau bersabda: \"Berpuasalah dua hari setiap bulan.\" Kukatakan; 'Sesungguhnya saya masih kuat dan saya ingin Anda menambahnya untuk saya.' Beliau bersabda: \"Kamu tidak akan mampu melaksanakan pada bulan kesabaran (Ramadhan) dan dua hari pada tiap bulan.\" 'Aku berkata; 'Sesungguhnya saya masih kuat dan saya ingin Anda menambahnya untuk saya.' Beliau bersabda: \"Kalau begitu, tiga hari.\" Beliau berkata sembari menajamkan pandangannya pada kali yang ketiga. Aku tetap saja berkata; 'Sesungguhnya saya masih kuat dan saya ingin Anda menambahnya untuk saya.' Beliau bersabda: \"(Berpuasalah) pada bulan-bulan haram, dan berbukalah.\""
            },
            {
                "number": 2606,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا هَمَّامٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ الثَّقَفِيِّ أَنَّ رَجُلًا أَعْوَرَ مِنْ ثَقِيفٍ قَالَ قَتَادَةُ كَانَ يُقَالُ لَهُ مَعْرُوفٌ أَيْ يُثْنَى عَلَيْهِ خَيْرًا يُقَالُ لَهُ زُهَيْرُ بْنُ عُثْمَانَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْوَلِيمَةُ حَقٌّ وَالْيَوْمُ الثَّانِي مَعْرُوفٌ وَالْيَوْمُ الثَّالِثُ سُمْعَةٌ وَرِيَاءٌ",
                "id": "Telah menceritakan kepada kami [Bahz], telah menceritakan kepada kami [Hammam] dari [Qatadah] dari [Al Hasan] dari [Abdullah bin Utsman Ats TSaqafi] bahwa seorang lelaki juling matanya dari bani Tsaqif, Qatadah mengatakan; Ia biasa dipanggil dengan Ma'ruf -maksudnya ia digelari dengan kebaikan ia disebut juga [Zuhair bin 'Utsman] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Walimah adalah hak, pada hari kedua adalah perbuatan ma'ruf, sedangkan pada hari ketiga adalah sum'ah dan riya.\" "
            },
            {
                "number": 2607,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا هَمَّامٌ حَدَّثَنَا قَتَادَةُ عَنِ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ عُثْمَانَ الثَّقَفِيِّ عَنْ رَجُلٍ أَعْوَرَ مِنْ ثَقِيفٍ قَالَ قَتَادَةُ وَكَانَ يُقَالُ لَهُ مَعْرُوفٌ إِنْ لَمْ يَكُنْ اسْمُهُ زُهَيْرَ بْنَ عُثْمَانَ فَلَا أَدْرِي مَا اسْمُهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْوَلِيمَةُ أَوَّلَ يَوْمٍ حَقٌّ وَالثَّانِي مَعْرُوفٌ وَالْيَوْمَ الثَّالِثَ سُمْعَةٌ وَرِيَاءٌ",
                "id": "Telah menceritakan kepada kami [Abdushamad], telah menceritakan kepada kami [Hammam], telah menceritakan kepada kami [Qatadah] dari [Al Hasan] dari [Abdullah bin Utsman Ats Tsaqafi] dari seorang lelaki juling matanya dari bani Tsaqif, [Qatadah] berkata; Ia biasa dipanggil dengan Ma'ruf kalu tidak salah namanya [Zuhair bin 'Utsman] sebenarnya aku tidak tahu nama aslinya, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Walimah adalah hak, pada hari kedua adalah perbuatan ma'ruf, sedangkan pada hari ketiga adalah sum'ah dan riya.\" "
            },
            {
                "number": 2608,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا أَيُّوبُ قَالَ كَانَ أَبُو قِلَابَةَ حَدَّثَنِي بِهَذَا الْحَدِيثِ ثُمَّ قَالَ لِي هَلْ لَكَ فِي الَّذِي حَدَّثَنِيهِ قَالَ فَدَلَّنِي عَلَيْهِ فَأَتَيْتُهُ فَقَالَ حَدَّثَنِي قَرِيبٌ لِي يُقَالُ لَهُ أَنَسُ بْنُ مَالِكٍ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِبِلٍ لِجَارٍ لِي أُخِذَتْ فَوَافَقْتُهُ وَهُوَ يَأْكُلُ فَدَعَانِي إِلَى طَعَامِهِ فَقُلْتُ إِنِّي صَائِمٌ فَقَالَ ادْنُ أَوْ قَالَ هَلُمَّ أُخْبِرْكَ عَنْ ذَلِكَ إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى وَضَعَ عَنْ الْمُسَافِرِ الصَّوْمَ وَشَطْرَ الصَّلَاةِ وَعَنْ الْحُبْلَى وَالْمُرْضِعِ قَالَ كَانَ بَعْدَ ذَلِكَ يَتَلَهَّفُ يَقُولُ أَلَا أَكُونُ أَكَلْتُ مِنْ طَعَامِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ دَعَانِي إِلَيْهِحَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا أَبُو هِلَالٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَوَادَةَ الْقُشَيْرِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ أَحَدُ بَنِي كَعْبٍ أَخُو بَنِي قُشَيْرٍ قَالَ أَغَارَتْ عَلَيْنَا خَيْلُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْطَلَقْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْتَهَيْتُ إِلَيْهِ وَهُوَ يَأْكُلُ فَقَالَ لِيَ ادْنُ فَكُلْ فَقُلْتُ إِنِّي صَائِمٌ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Isma'il], telah menceritakan kepada kami [Ayyub], ia berkata; [Abu Qilabah] menceritakan padaku dengan hadits ini, lalu ia mengatakan padaku; \"Apakah kamu tahu mengenai [orang] yang telah menyampaikan hadits kepadaku?.\" Ayyub berkata; Lalu Abu Qilabah menunjukiku dan aku mendatangi orang tersebut, lalu orang itu berkata; telah menceritakan padaku orang yang dekat denganku namanya [Anas bin Malik], ia berkata; Aku datang kepada Rasulullah Shallalahu 'alaihi wasallam karena unta tetanggaku yang ditahan. Lalu aku berhenti karena beliau sedang makan dan beliau menawariku makan, namun aku memberitahukannya bila aku sedang berpuasa, beliau bersabda: \"Teruskan atau lanjutkanlah! Aku kabarkan padamu bahwa Allah Tabaraka Wa Ta'ala menjadikan orang yang sedang musafir tapi berpuasa dan meneruskan sholat (tidak mengqasar), demikian juga wanita yang hamil dan menyusui bahwa mereka akan menyesal.\" Anas berkata; \"Ketahuilah, akhirnya aku berbuka dan makan bersama dengan Rasulullah Shallalahu 'alaihi wasallam ketika ia mengundangku untuk makan.\" Telah menceritakan kepada kami [Abdushamad], telah menceritakan kepada kami [Abu Hilal], telah menceritakan kepada kami [Abdullah bin Sawadah Al Qusyairi] dari [Anas bin Malik] salah seorang bani Ka'ab saudara dari bani Qusyair, ia berkata; \"Kami iri dengan kuda Rasulullah Shallalahu 'alaihi wasallam, lalu kami mendatangi beliau, sesampainya di sana beliau tengah keadaan makan, beliau lalu berkata kepadaku: \"Mari makan!.\" Aku berkata; \"Sungguh aku sedang berpuasa.\" Lalu ia menyebutkan hadits tersebut."
            },
            {
                "number": 2609,
                "arab": "حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي قَتَادَةُ وَبَهْزٌ قَالَ وَحَدَّثَنِي شُعْبَةُ عَنْ قَتَادَةَ قَالَ سَمِعْتُ زُرَارَةَ بْنَ أَوْفَى يُحَدِّثُ عَنْ أُبَيِّ بْنِ مَالِكٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ أَدْرَكَ وَالِدَيْهِ أَوْ أَحَدَهُمَا ثُمَّ دَخَلَ النَّارَ مِنْ بَعْدِ ذَلِكَ فَأَبْعَدَهُ اللَّهُ وَأَسْحَقَهُ",
                "id": "Telah menceritakan kepada kami [Hajjaj], telah menceritakan kepada kami [Syu'bah], telah mengabarkan kepadaku [Qatadah] -dan [Bahz] berkata; telah menceritakan kepadaku [Syu'bah] dari [Qatadah] berkata; saya mendengar- [Zurarah bin Aufa] menceritakan dari [Ubay bin Malik] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Barangsiapa mendapati kedua orang tuanya, atau salah satunya, kemudian setelah itu ia masuk Neraka, berarti Allah telah menjauhkan dan membinasakannya.\""
            },
            {
                "number": 2610,
                "arab": "حَدَّثَنَا حَجَّاجٌ حَدَّثَنِي شُعْبَةُ عَنْ قَتَادَةَ عَنْ عَبْدِ الرَّحْمَنِ أَبِي الْمِنْهَالِ بْنِ سَلَمَةَ الْخُزَاعِيِّ عَنْ عَمِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَسْلَمَ صُومُوا الْيَوْمَ فَقَالُوا إِنَّا قَدْ أَكَلْنَا قَالَ صُومُوا بَقِيَّةَ يَوْمِكُمْ يَعْنِي يَوْمَ عَاشُورَاءَ",
                "id": "Telah menceritakan kepada kami [Hajjaj], telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Abdurrahman Abu Al Minhal bin Salamah Al Khuza'i], dari [pamannya] bahwa Nabi shallallahu 'alaihi wasallam bersabda kepada kabilah Aslam, \"Puasalah kalian pada hari ini.\" Mereka berkata; \"Sesungguhnya kami telah makan.\" Beliau bersabda lagi: \"Puasalah kalian pada sisa hari kalian ini.\" Yakni, hari 'Asyura."
            },
            {
                "number": 2611,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ عَلِيَّ بْنَ زَيْدٍ يُحَدِّثُ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ رَجُلٍ مِنْ قَوْمِهِ يُقَالُ لَهُ مَالِكٌ أَوْ ابْنُ مَالِكٍ يُحَدِّثُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ أَيُّمَا مُسْلِمٍ ضَمَّ يَتِيمًا بَيْنَ أَبَوَيْنِ مُسْلِمَيْنِ إِلَى طَعَامِهِ وَشَرَابِهِ حَتَّى يَسْتَغْنِيَ وَجَبَتْ لَهُ الْجَنَّةُ الْبَتَّةَ وَأَيُّمَا مُسْلِمٍ أَعْتَقَ رَقَبَةً أَوْ رَجُلًا مُسْلِمًا كَانَتْ فِكَاكَهُ مِنْ النَّارِ وَمَنْ أَدْرَكَ وَالِدَيْهِ أَوْ أَحَدَهُمَا فَدَخَلَ النَّارَ فَأَبْعَدَهُ اللَّهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah] berkata; Aku mendengar [Ali bin Zaid] menceritakan dari [Zurarah bin `Aufa] dari seseorang dari kaumnya, ada yang menyebutnya [Malik atau Ibnu Malik] menceritakan dari Rasulullah Shallalahu 'alaihi wasallam bahwa beliau bersabda: \"Siapa saja seorang muslim yang menjamin makan dan minum anak yatim karena ditinggal orang tuanya yang muslim, hingga ia mandiri, maka wajib baginya surga. Dan siapa saja dari orang muslim yang memerdekakan budak atau membebaskan seorang muslim, maka ia terbebas dari Neraka, dan barangsiapa mendapatkan kedua orang tuanya atau salah satu dari keduanya masuk Neraka maka Allah telah menjauhkannya.\""
            },
            {
                "number": 2612,
                "arab": "حَدَّثَنَا هُشَيْمٌ قَالَ عَلِيُّ بْنُ زَيْدٍ أَخْبَرَنَا عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ مَالِكِ بْنِ الْحَارِثِ رَجُلٍ مِنْهُمْ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ ضَمَّ يَتِيمًا بَيْنَ أَبَوَيْنِ مُسْلِمَيْنِ إِلَى طَعَامِهِ وَشَرَابِهِ حَتَّى يَسْتَغْنِيَ عَنْهُ وَجَبَتْ لَهُ الْجَنَّةُ الْبَتَّةَ وَمَنْ أَعْتَقَ امْرَأً مُسْلِمًا كَانَ فِكَاكَهُ مِنْ النَّارِ يُجْزَى بِكُلِّ عُضْوٍ مِنْهُ عُضْوًا مِنْهُ",
                "id": "Telah menceritakan kepada kami [Husyaim], berkata [Ali bin Zaid], telah mengabarkan kepada kami [Zurarah bin Aufa] dari [Malik bin Harits] salah seorang dari mereka bahwa ia mendengar Rasulullah Shallalahu 'alaihi wasallam bersabda: \"Barangsiapa menjamin kehidupan seorang yatim yang ditinggal orang tuanya muslim, dengan memberinya makan dan minum hingga ia mandiri, maka wajib baginya surga. Dan barangsiapa seorang muslim yang memerdekakan budak atau membebaskan dari urusan seorang muslimlainnya, maka ia terbebas dari Neraka, dan akan dibalas pada setiap anggota badannya dengan angota badan budak tersebut.\""
            },
            {
                "number": 2613,
                "arab": "سَنَةَ ثَمَانٍ وَعِشْرِينَ وَمِئَتَيْنِ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا مِسْعَرُ بْنُ حَبِيبٍ الْجَرْمِيُّ حَدَّثَنِي عَمْرُو بْنُ سَلِمَةَ عَنْ أَبِيهِأَنَّهُمْ وَفَدُوا إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا أَرَادُوا أَنْ يَنْصَرِفُوا قَالُوا يَا رَسُولَ اللَّهِ مَنْ يَؤُمُّنَا قَالَ أَكْثَرُكُمْ جَمْعًا لِلْقُرْآنِ أَوْ أَخْذًا لِلْقُرْآنِ قَالَ فَلَمْ يَكُنْ أَحَدٌ مِنْ الْقَوْمِ جَمَعَ مِنْ الْقُرْآنِ مَا جَمَعْتُ قَالَ فَقَدَّمُونِي وَأَنَا غُلَامٌ فَكُنْتُ أَؤُمُّهُمْ وَعَلَيَّ شَمْلَةٌ لِي قَالَ فَمَا شَهِدْتُ مَجْمَعًا مِنْ جَرْمٍ إِلَّا كُنْتُ إِمَامَهُمْ وَأُصَلِّي عَلَى جَنَائِزِهِمْ إِلَى يَوْمِي هَذَا",
                "id": "Tahun seratus dua puluh delapan. Telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami [Mis'ar bin Habib Al Jarmi], telah menceritakan kepada kami ['Amru bin Salimah] dari [ayahnya], bahwa mereka datang sebagai utusan kepada Nabi shallallahu 'alaihi wasallam. Ketika hendak beranjak pergi, mereka bertanya; \"Wahai Rasulullah, siapakah yang (berhak) mengimami kami?\" Beliau menjawab: \"Orang yang paling banyak menghafal Al Qur'an, atau mengambil Al Qur'an.\" Salimah berkata; \"Saat itu, di antara orang-orang tersebut, tidak ada yang paling banyak hapalan Al Qur'annya sebagaimana aku.\" Katanya lagi, \"Mereka lantas menyuruhku maju, padahal saat itu aku masih kanak-kanak. Aku mengimami mereka dengan menggunakan jubah.\" Dia berkata lagi, \"Tidaklah aku mendapati sekumpulan orang, melainkan akulah yang menjadi imam mereka. Dan, aku pulalah yang menyalati jenazah mereka hingga hari ini.\""
            },
            {
                "number": 2614,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ أَخْبَرَنَا أَيُّوبُ عَنْ عَمْرِو بْنِ سَلِمَةَ قَالَكُنَّا عَلَى حَاضِرٍ فَكَانَ الرُّكْبَانُ وَقَالَ إِسْمَاعِيلُ مَرَّةً النَّاسُ يَمُرُّونَ بِنَا رَاجِعِينَ مِنْ عِنْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَدْنُو مِنْهُمْ فَأَسْمَعُ حَتَّى حَفِظْتُ قُرْآنًا وَكَانَ النَّاسُ يَنْتَظِرُونَ بِإِسْلَامِهِمْ فَتْحَ مَكَّةَ فَلَمَّا فُتِحَتْ جَعَلَ الرَّجُلُ يَأْتِيهِ فَيَقُولُ يَا رَسُولَ اللَّهِ أَنَا وَافِدُ بَنِي فُلَانٍ وَجِئْتُكَ بِإِسْلَامِهِمْ فَانْطَلَقَ أَبِي بِإِسْلَامِ قَوْمِهِ فَرَجَعَ إِلَيْهِمْ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدِّمُوا أَكْثَرَكُمْ قُرْآنًا قَالَ فَنَظَرُوا وَأَنَا لَعَلَى حِوَاءٍ عَظِيمٍ فَمَا وَجَدُوا فِيهِمْ أَحَدًا أَكْثَرَ قُرْآنًا مِنِّي فَقَدَّمُونِي وَأَنَا غُلَامٌ فَصَلَّيْتُ بِهِمْ وَعَلَيَّ بُرْدَةٌ وَكُنْتُ إِذَا رَكَعْتُ أَوْ سَجَدْتُ قَلَصَتْ فَتَبْدُو عَوْرَتِي فَلَمَّا صَلَّيْنَا تَقُولُ عَجُوزٌ لَنَا دَهْرِيَّةٌ غَطُّوا عَنَّا اسْتَ قَارِئِكُمْ قَالَ فَقَطَعُوا لِي قَمِيصًا فَذَكَرَ أَنَّهُ فَرِحَ بِهِ فَرَحًا شَدِيدًا",
                "id": "Telah menceritakan kepada kami [Isma'il], telah mengabarkan kepada kami [Ayyub] dari ['Amru bin Salimah] ia berkata; Suatu kali kami melewati seseorang yang bermukim di sebuah mata air. Amru bin Salimah ketika itu adalah diantara pasukan pengendara. Pada kesempatan yang lain Isma'il berkata; \"Sering kali orang-orang berlalu lalang berpapasan dengan kami sepulang mereka dari Rasulullah Shallalahu 'alaihi wasallam, lantas aku mendekati mereka dan aku mendengar hingga aku hafal Al Qur`an sedang orang-orang saling menunggu waktu penaklukan kota Makkah dengan keIslaman mereka, hingga ketika Makkah telah ditaklukan, seseorang datang kepada beliau dan berkata; \"Wahai Rasulullah, aku seorang utusan bani fulan dan aku datang kepada anda atas keIslaman mereka, \" maka [Ayahku] juga menyebutkan keIslaman kaumnya lalu ia pulang kepada kaumnya dan berkata; Rasulullah Shallalahu 'alaihi wasallam bersabda: \"Angkatlah yang banyak hafalan Qur`annya sebagai imam.\" Salimah berkata; Maka mereka memandang ke arahku, seolah-olah aku adalah orang yang menyandang kemuliaan tersebut, sementara mereka tiada mendapat orang yang paling banyak hafalannya dibanding aku. Mereka lantas menyuruhku menjadi imam, padahal saat itu aku masih kanak-kanak. Aku mengimami mereka dengan menggunakan mantel (yang sempit), apabila aku ruku' atau sujud, maka tersingkaplah auratku. Seusai kami melaksanakan sholat, seorang wanita tua berkata; \"Tutupilah dari (pandangan) kami belakang (pantat) imam kalian.\" Salimah berkata; \"Lalu mereka (kaumku) menjahitkan jubah untukku.\" Salimah menyebutkan bahwa saat itu dirinya sangat gembira sekali.\""
            },
            {
                "number": 2615,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ قَالَ خَالِدٌ الْحَذَّاءُ أَخْبَرَنِي عَنْ أَبِي قِلَابَةَ عَنْ عَمْرِو بْنِ سَلِمَةَ قَالَكَانَتْ تَأْتِينَا الرُّكْبَانُ مِنْ قِبَلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَسْتَقْرِئُهُمْ فَيُحَدِّثُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِيَؤُمَّكُمْ أَكْثَرُكُمْ قُرْآنًا",
                "id": "Telah menceritakan kepada kami [Ali bin 'Ashim], berkata [Khalid Al Hadza`] telah mengabarkan kepadaku dari [Abu Qilabah] dari ['Amru bin Salimah], ia berkata; \"Telah datang [beberapa pengendara] dari arah Rasulullah Shallalahu 'alaihi wasallam, lalu kami memintanya untuk menceritakan apa yang ia dapat, maka ia menceritakan bahwa Rasulullah Shallalahu 'alaihi wasallam bersabda: \"Hendaklah orang yang banyak (hafalan) Al Qur'an menjadi imam di antara kalian.\""
            },
            {
                "number": 2616,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنِي عَبْدُ الْمَجِيدِ أَبُو عَمْرٍو حَدَّثَنِي الْعَدَّاءُ بْنُ خَالِدِ بْنِ هَوْذَةَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ النَّاسَ يَوْمَ عَرَفَةَ عَلَى بَعِيرٍ قَائِمًا فِي الرِّكَابَيْنِ",
                "id": "Telah menceritakan kepada kami [Waki'], telah menceritakan padaku [Abdul Majid Abu 'Amru], telah menceritakan padaku [Al 'Adda` bin Khalid bin Haudzah], dia berkata; \"Aku melihat Rasulullah shallallahu 'alaihi wasallam tengah berkhutbah di hadapan orang-orang pada hari Arafah di atas unta, beliau berdiri di atas dua pijakan kaki (pada pelana).\""
            },
            {
                "number": 2617,
                "arab": "حَدَّثَنَا يُونُسُ حَدَّثَنَا عُمَرُ بْنُ إِبْرَاهِيمَ الْيَشْكُرِيُّ حَدَّثَنَا شَيْخٌ كَبِيرٌ مِنْ بَنِي عُقَيْلٍ يُقَالُ لَهُ عَبْدُ الْمَجِيدِ الْعُقَيْلِيُّ قَالَانْطَلَقْنَا حُجَّاجًا لَيَالِيَ خَرَجَ يَزِيدُ بْنُ الْمُهَلَّبِ وَقَدْ ذُكِرَ لَنَا أَنَّ مَاءً بِالْعَالِيَةِ يُقَالُ لَهُ الزُّجَيْجُ فَلَمَّا قَضَيْنَا مَنَاسِكَنَا جِئْنَا حَتَّى أَتَيْنَا الزُّجَيْجَ فَأَنَخْنَا رَوَاحِلَنَا قَالَ فَانْطَلَقْنَا حَتَّى أَتَيْنَا عَلَى بِئْرٍ عَلَيْهِ أَشْيَاخٌ مُخَضَّبُونَ يَتَحَدَّثُونَ قَالَ قُلْنَا هَذَا الَّذِي صَحِبَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْنَ بَيْتُهُ قَالُوا نَعَمْ صَحِبَهُ وَهَذَاكَ بَيْتُهُ فَانْطَلَقْنَا حَتَّى أَتَيْنَا الْبَيْتَ فَسَلَّمْنَا قَالَ فَأَذِنَ لَنَا فَإِذَا هُوَ شَيْخٌ كَبِيرٌ مُضْطَجِعٌ يُقَالُ لَهُ الْعَدَّاءُ بْنُ خَالِدٍ الْكِلَابِيُّ قُلْتُ أَنْتَ الَّذِي صَحِبْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَعَمْ وَلَوْلَا أَنَّهُ اللَّيْلُ لَأَقْرَأْتُكُمْ كِتَابَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيَّ قَالَ فَمَنْ أَنْتُمْ قُلْنَا مِنْ أَهْلِ الْبَصْرَةِ قَالَ مَرْحَبًا بِكُمْ مَا فَعَلَ يَزِيدُ بْنُ الْمُهَلَّبِ قُلْنَا هُوَ هُنَاكَ يَدْعُو إِلَى كِتَابِ اللَّهِ تَبَارَكَ وَتَعَالَى وَإِلَى سُنَّةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِيمَا هُوَ مِنْ ذَاكَ فِيمَا هُوَ مِنْ ذَاكَ قَالَ قُلْتُ أَيًّا نَتَّبِعُ هَؤُلَاءِ أَوْ هَؤُلَاءِ يَعْنِي أَهْلَ الشَّامِ أَوْ يَزِيدَ قَالَ إِنْ تَقْعُدُوا تُفْلِحُوا وَتَرْشُدُوا إِنْ تَقْعُدُوا تُفْلِحُوا وَتَرْشُدُوا لَا أَعْلَمُهُ إِلَّا قَالَ ثَلَاثَ مَرَّاتٍ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ عَرَفَةَ وَهُوَ قَائِمٌ فِي الرِّكَابَيْنِ يُنَادِي بِأَعْلَى صَوْتِهِ يَا أَيُّهَا النَّاسُ أَيُّ يَوْمِكُمْ هَذَا قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ فَأَيُّ شَهْرٍ شَهْرُكُمْ هَذَا قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ فَأَيُّ بَلَدٍ بَلَدُكُمْ هَذَا قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ يَوْمُكُمْ يَوْمٌ حَرَامٌ وَشَهْرُكُمْ شَهْرٌ حَرَامٌ وَبَلَدُكُمْ بَلَدٌ حَرَامٌ قَالَ فَقَالَ أَلَا إِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا إِلَى يَوْمِ تَلْقَوْنَ رَبَّكُمْ تَبَارَكَ وَتَعَالَى فَيَسْأَلُكُمْ عَنْ أَعْمَالِكُمْ قَالَ ثُمَّ رَفَعَ يَدَيْهِ إِلَى السَّمَاءِ فَقَالَ اللَّهُمَّ اشْهَدْ عَلَيْهِمْ اللَّهُمَّ اشْهَدْ عَلَيْهِمْ ذَكَرَ مِرَارًا فَلَا أَدْرِي كَمْ ذَكَرَهُ",
                "id": "Telah menceritakan kepada kami [Yunus], telah menceritakan kepada kami [Umar bin Ibrahim Al Yasykuri], telah menceritakan kepada kami seorang guru besar dari bani 'Uqail yang disebut dengan [Abdul Majid Al 'Uqaili], ia berkata; kami bertolak untuk menunaikan haji di malam hari, lalu keluarlah Yazid bin Al Muhallab -telah disebutkan sebelumnya kepada kami mengenai mata air di 'Aliyah yang disebut dengan 'Zujaij'- ketika kami selesai dari manasik, kami mendatangi 'Zujaij', hingga ketika sampai kami beristirahat, sedang aku berjalan-jalan hingga mendapati suatu mata air, ternyata di sana terdapat beberapa orang tua yang tengah berbincang-bincang. kami berkata; 'Orang inikah yang telah menemani Rasulullah shallallahu 'alaihi wasallam, dimanakah rumahnya?, mereka menjawab; 'Ya, dia telah menemani Rasulullah shallallahu 'alaihi wasallam dan itu rumahnya. Akupun beranjak menuju rumahnya hingga sampai di depan pintu, kami memberi salam. Setelah ia mempersilahkan kami masuk, ternyata ada seorang syaikh tergolek di pembaringan, ia biasa dikenal dengan [Al 'Adda` bin Khalid Al Kilabi], aku lalu bertanya; 'Engkaukah yang telah menemani Rasulullah shallallahu 'alaihi wasallam?.' Ia menjawab; 'Ya, kalaulah bukan malam hari, aku akan membacakan padamu hadits-hadits Rasulullah shallallahu 'alaihi wasallam, sebenarnya kalian ini siapa?.' Kami menjawab; 'Kami dari penduduk Bashrah.' Syaikh itu berkata; 'Selamat datang buat kalian, apa yang dikerjakan Yazid bin Muhallab?.' Aku menjawab; 'Ia menyeru kitabullah Tabaraka wa Ta'ala dan sunah Rasulullah shallallahu 'alaihi wasallam, ' Syaikh itu berkata; 'Sejauh mana ia menyampaikan hal itu? Sejauh mana ia menyampaikan hal itu?.' Aku berkata; 'Mari kita ikut mereka, ikut mereka yaitu penduduk Syam atau Yazid.' Syaikh itu berkata; 'Kalau kalian bergaul dengannya, maka kalian akan beruntung dan dapat petunjuk, kalau kalian bergaul denganya, maka kalian akan beruntung dan mendapat petunjuk, ' -Aku tidak mengerti kecuali ia mengulangi perkataan tersebut hingga tiga kali- (syaikh itu melanjutkan); \"Aku melihat Rasulullah shallallahu 'alaihi wasallam berkhutbah di hari Arafah, beliau berdiri di atas dua pikakan kaki (di atas pelananya) sambil berseru dengan suara yang keras: 'Wahai sekailan manusia, hari apakah ini?.' Mereka menjawab; 'Allah dan Rasul-Nya yang lebih tahu.' Kemudian beliau bertanya: 'Bulan apakah ini?.' Mereka menjawab; 'Allah dan Rasul-Nya yang tahu.' Beliau bersabda: 'Dan negeri apakah ini?.' Mereka juga menjawab; 'Allah dan Rasul-Nya yang tahu.' Beliau bersabda: 'Sekarang Ini adalah hari haram kalian, bulan haram kalian dan negeri haram kalian, sesungguhnya darah kalian, harta kalian, adalah haram sebagaimana keharaman hari kalian ini, di bulan kalian ini dan di negeri kalian ini, sampai kalian menemui Rabb kalian Tabraka wa Ta'ala, kemduian Dia akan menanyai kalian tentang amalan-amalan kalian.\" Setelah itu Beliau mengangkat tangannya ke arah langit sambil bersabda: 'Ya Allah, saksikanlah atas mereka?, Ya Allah saksikanlah atas mereka!.\" Beliau mengulang-ulanginya hingga aku tidak tahu berapa kali beliau mengulanginya."
            },
            {
                "number": 2618,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عَبَّادُ بْنُ رَاشِدٍ عَنِ الْحَسَنِ حَدَّثَنَا أَحْمَرُ صَاحِبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَإِنْ كُنَّا لَنَأْوِي لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا يُجَافِي بِيَدَيْهِ عَنْ جَنْبَيْهِ إِذَا سَجَدَحَدَّثَنَا عَفَّانُ حَدَّثَنَا عَبَّادُ بْنُ رَاشِدٍ حَدَّثَنَا الْحَسَنُ حَدَّثَنِي أَحْمَرُ صَاحِبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُنَّا لَيَأْوِي لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِمَّا يُجَافِي بِيَدَيْهِ عَنْ جَنْبَيْهِ إِذَا سَجَدَ",
                "id": "Telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami ['Abbad bin Rasyid] dari [Al Hasan], telah menceritakan kepada kami [Ahmar] salah seorang sahabat Rasulullah Shallalahu 'Alaihi Wasallam, ia berkata; \"Kami mendapati Rasulullah shallallahu 'alaihi wasallam, beliau menjauhkan kedua tangannya dari perut ketika sujud.\" Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami ['Abbad bin Rasyid], telah menceritakan kepada kami [Al Hasan], telah menceritakan kepadaku [Ahmar] seorang sahabat Rasulullah shallallahu 'alaihi wasallam bahwa kami mendapatkan Rasulullah shallallahu 'alaihi wasallam menjauhkan kedua tangannya dari perutnya ketika sujud.\""
            },
            {
                "number": 2619,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الضَّحَّاكُ بْنُ يَسَارٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ صُحَارٍ الْعَبْدِيِّ عَنْ أَبِيهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ مِسْقَامٌ فَأْذَنْ لِي فِي جَرِيرَةٍ أَنْتَبِذُ فِيهَا قَالَ فَأَذِنَ لَهُ فِيهَا",
                "id": "Telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami [Adh Dlahak bin Yasar] dari [Yazid bin Abdullah bin Syikhkhir] dari [Abdurrahman bin Shuhar Al 'Abdi] dari [Ayahnya] ia berkata; Aku bertanya; \"Wahai Rasulullah, aku seorang yang sering sakit, maka izinkanlah aku menaruh perasan (buah) di bejana tembaga, lalu beliau mengizinkanku.'"
            },
            {
                "number": 2620,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْجُرَيْرِيُّ عَنْ أَبِي الْعَلَاءِ بْنِ الشِّخِّيرِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ صُحَارٍ الْعَبْدِيِّ عَنْ أَبِيهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَقُومُ السَّاعَةُ حَتَّى يُخْسَفَ بِقَبَائِلَ حَتَّى يُقَالَ مَنْ بَقِيَ مِنْ بَنِي فُلَانٍفَعَرَفْتُ أَنَّهُ يَعْنِي الْعَرَبَ لِأَنَّ الْعَجَمَ إِنَّمَا تُنْسَبُ إِلَى قُرَاهَا",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun], telah mengabarkan kepada kami [Al Jurairi] dari [Abul 'Ala` bin Syikhkhir] dari [Abdurrahman bin Shuhar Al 'Abdi] dari [Ayahnya] ia berkata; Aku mendengar Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Tidak akan terjadi kiamat hingga para kabilah saling berperang, hingga dikatakan; \"Siapa yang tersisa dari kabilah fulan?\" Dan Aku tahu, ternyata maksud beliau adalah orang-orang Arab, karena orang-orang 'Ajam dinasabkan kepada perkampungannya.\""
            },
            {
                "number": 2621,
                "arab": "حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا الْمُشْمَعِلُّ حَدَّثَنِي عَمْرُو بْنُ سُلَيْمٍ الْمُزَنِيُّ أَنَّهُ سَمِعَ رَافِعَ بْنَ عَمْرٍو الْمُزَنِيَّ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَأَنَا وَصِيفٌ يَقُولُ الْعَجْوَةُ وَالشَّجَرَةُ مِنْ الْجَنَّةِ",
                "id": "Telah menceritakan kepadaku [Yahya bin Sa'id], telah menceritakan kepada kami [Al Musyma'il], telah menceritakan padaku ['Amru bin Sulaim Al Muzanni] bahwa [Rafi' bin 'Amru Al Muzanni] berkata; Aku mendengar Rasulullah Shallalahu 'Alaihi Wasallam bersabda: -Dan ketika itu aku adalah seorang pemuda- beliau bersabda; \"'Ajwah adalah pepohonan dari Surga.\""
            },
            {
                "number": 2622,
                "arab": "حَدَّثَنَا بَهْزٌ وَأَبُو النَّضْرِ وَعَفَّانُ قَالُوا حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ عَنْ حُمَيْدٍ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ بَعْدِي مِنْ أُمَّتِي قَوْمًا يَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ حَلَاقِيمَهُمْ يَخْرُجُونَ مِنْ الدِّينِ كَمَا يَخْرُجُ السَّهْمُ مِنْ الرَّمِيَّةِ ثُمَّ لَا يَعُودُونَ فِيهِ شَرُّ الْخَلْقِ وَالْخَلِيقَةِقَالَ ابْنُ الصَّامِتِ فَلَقِيتُ رَافِعًا قَالَ بَهْزٌ أَخَا الْحَكَمِ بْنِ عَمْرٍو فَحَدَّثْتُهُ هَذَا الْحَدِيثَ قَالَ وَأَنَا أَيْضًا قَدْ سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Bahz] dan [Abu Nasdlr] serta ['Affan] mereka berkata; telah menceritakan kepada kami [Sulaiman bin Mughirah] dari [Humaid] dari [Abdullah bin Shamit] dari [Abu Dzarr], dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya sepeninggalku kelak, akan ada segolongan orang dari umatku yang membaca Al Qur'an, tapi tidak melebihi tenggorokan mereka. Mereka keluar dari agama sebagaimana anak panah melesat dari busurnya. Setelah itu, mereka tidak akan kembali lagi kepadanya (agama). (Mereka adalah) seburuk-buruk makhluk dan ciptaan.\" [Ibnu Shamit] berkata; \"Kutemui [Rafi'], [Bahz] Saudara al-Hakam bin 'Amr mengatkan; lantas hadits ini aku sampaikan kepadanya.\" Dia berkata; \"Aku juga mendengarnya dari Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 2623,
                "arab": "حَدَّثَنَا مُعْتَمِرٌ قَالَ سَمِعْتُ ابْنَ أَبِي الْحَكَمِ الْغِفَارِيَّ يَقُولُ حَدَّثَتْنِي جَدَّتِي عَنْ عَمِّ أَبِيهَا رَافِعِ بْنِ عَمْرٍو الْغِفَارِيِّ قَالَكُنْتُ وَأَنَا غُلَامٌ أَرْمِي نَخْلًا لِلْأَنْصَارِ فَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقِيلَ إِنَّ هَاهُنَا غُلَامًا يَرْمِي نَخْلَنَا فَأُتِيَ بِي إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا غُلَامُ لِمَ تَرْمِي النَّخْلَ قَالَ قُلْتُ آكُلُ قَالَ فَلَا تَرْمِ النَّخْلَ وَكُلْ مَا يَسْقُطُ فِي أَسَافِلِهَا ثُمَّ مَسَحَ رَأْسِي وَقَالَ اللَّهُمَّ أَشْبِعْ بَطْنَهُ",
                "id": "Telah menceritakan kepada kami [Mu'tamir], ia berkata; Aku mendengar [Ibnu Abul Hakam Al Ghifari] berkata; telah menceritakan kepadaku [Nenekku] dari paman ayahnya yaitu [Rafi' bin 'Amr Al Ghifari], dia berkata; \"Saat masih kecil, aku pernah melempari pohon kurma milik orang Anshar. Kemudian Nabi shallallahu 'alaihi wasallam di datangi, dan di beritahukan kepada beliau; \"Sesungguhnya di sini terdapat seorang anak kecil yang suka melempari pohon kurma kami.\" Aku pun dibawa ke hadapan Nabi shallallahu 'alaihi wasallam. Beliau kemudian bersabda: \"Wahai anak kecil, kenapa kau lempari pohon itu?\" Rafi' berkata; \"Kujawab, 'Untuk saya makan.' Sabda beliau: \"Kalau begitu, janganlah kau melempari pohon kurma itu. Makanlah (buah) yang jatuh di bawahnya.\" Beliau lantas mengusap kepalaku dan berdoa; 'Ya Allah, kenyangkanlah perutnya.\""
            },
            {
                "number": 2624,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا الْمُشْمَعِلُّ بْنُ عَمْرٍو الْمُزَنِيُّ حَدَّثَنَا عَمْرُو بْنُ سُلَيْمٍ الْمُزَنِيُّ عَنْ رَافِعِ بْنِ عَمْرٍو الْمُزَنِيِّ يَقُولُ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْعَجْوَةُ وَالصَّخْرَةُ أَوْ قَالَ الْعَجْوَةُ وَالشَّجَرَةُ فِي الْجَنَّةِ شَكَّ الْمُشْمَعِلُّ",
                "id": "Telah menceritakan kepada kami [Abdushamad], telah menceritakan kepada kami [Al Musyma'il bin 'Amru Al Muzanni], telah menceritakan kepada kami ['Amru bin Sulaim Al Muzanni] dari [Rafi' bin 'Amru Al Muzanni] ia berkata; saya mendengar Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Ajwah dan syakhrah -atau beliau bersabda- Ajwah dan syajarah berasal dari Surga.\" Al Musyma'il ragu-ragu. "
            },
            {
                "number": 2625,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا الْمُشْمَعِلُّ بْنُ إِيَاسٍ قَالَ سَمِعْتُ عَمْرَو بْنَ سُلَيْمٍ يَقُولُ سَمِعْتُ رَافِعَ بْنَ عَمْرٍو الْمُزَنِيَّ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْعَجْوَةُ وَالصَّخْرَةُ مِنْ الْجَنَّةِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi], telah menceritakan kepada kami [Al Musyma'il bin Iyyas] ia berkata; saya mendengar ['Amru bin Sulaim] berkata; saya mendengar [Rafi' bin 'Amru Al Muzanni] berkata; saya mendengar Rasulullah Shallalahu 'alaihi wasallam bersabda: \"Ajwah dan Syakhrah berasal dari surga.\" "
            },
            {
                "number": 2626,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ حَدَّثَنَا حُمَيْدٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الصَّامِتِ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ بَعْدِي مِنْ أُمَّتِي قَوْمًا يَقْرَءُونَ الْقُرْآنَ لَا يُجَاوِزُ حَلَاقِيمَهُمْ يَخْرُجُونَ مِنْ الدِّينِ كَمَا يَخْرُجُ السَّهْمُ مِنْ الرَّمِيَّةِ ثُمَّ لَا يَعُودُونَ إِلَيْهِ شَرُّ الْخَلْقِ وَالْخَلِيقَةِقَالَ ابْنُ الصَّامِتِ فَلَقِيتُ رَافِعًا فَحَدَّثْتُهُ فَقَالَ وَأَنَا أَيْضًا قَدْ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami ['Affan], telah menceritakan kepada kami [Sulaiman bin Mughirah], telah menceritakan kepada kami [Humaid], telah menceritakan kepada kami [Abdullah bin Shamit] dari [Abu Dzarr] ia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Sesungguhnya sepeninggalku kelak, akan ada segolongan orang dari umatku yang membaca Al Qur'an, tapi tidak melebihi tenggorokan mereka. Mereka keluar dari agama sebagaimana anak panah melesat dari busurnya. Setelah itu, mereka tidak akan kembali lagi kepadanya (agama). Mereka adalah seburuk-buruk makhluk dan ciptaan.\" [Ibnu Shamit] mengatakan; \"Kutemui [Rafi'], lantas aku sampaikan hadits ini kepadanya.\" Dia berkata; \"Aku juga mendengarnya dari Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 2627,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا كَهْمَسٌ وَيَزِيدُ قَالَ أَخْبَرَنَا كَهْمَسٌ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ شَقِيقٍ قَالَ مِحْجَنُ بْنُ الْأَدْرَعِبَعَثَنِي نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَاجَةٍ ثُمَّ عَرَضَ لِي وَأَنَا خَارِجٌ مِنْ طَرِيقٍ مِنْ طُرُقِ الْمَدِينَةِ قَالَ فَانْطَلَقْتُ مَعَهُ حَتَّى صَعِدْنَا أُحُدًا فَأَقْبَلَ عَلَى الْمَدِينَةِ فَقَالَ وَيْلُ أُمِّهَا قَرْيَةً يَوْمَ يَدَعُهَا أَهْلُهَا قَالَ يَزِيدُ كَأَيْنَعِ مَا تَكُونُ قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ مَنْ يَأْكُلُ ثَمَرَتَهَا قَالَ عَافِيَةُ الطَّيْرِ وَالسِّبَاعُ قَالَ وَلَا يَدْخُلُهَا الدَّجَّالُ كُلَّمَا أَرَادَ أَنْ يَدْخُلَهَا تَلَقَّاهُ بِكُلِّ نَقْبٍ مِنْهَا مَلَكٌ مُصْلِتًا قَالَ ثُمَّ أَقْبَلْنَا حَتَّى إِذَا كُنَّا بِبَابِ الْمَسْجِدِ قَالَ إِذَا رَجُلٌ يُصَلِّي قَالَ أَتَقُولُهُ صَادِقًا قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ هَذَا فُلَانٌ وَهَذَا مِنْ أَحْسَنِ أَهْلِ الْمَدِينَةِ أَوْ قَالَ أَكْثَرِ أَهْلِ الْمَدِينَةِ صَلَاةً قَالَ لَا تُسْمِعْهُ فَتُهْلِكَهُ مَرَّتَيْنِ أَوْ ثَلَاثًا إِنَّكُمْ أُمَّةٌ أُرِيدَ بِكُمْ الْيُسْرُحَدَّثَنَا حَجَّاجٌ حَدَّثَنِي شُعْبَةُ عَنْ أَبِي بِشْرٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ شَقِيقٍ يُحَدِّثُ عَنْ رَجَاءِ بْنِ أَبِي رَجَاءٍ الْبَاهِلِيِّ عَنْ مِحْجَنٍ رَجُلٍ مِنْ أَسْلَمَ فَذَكَرَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Kahmas] -dan [Yazid], dia berkata; telah mengabarkan kepada kami [Kahmas] - ia berkata; Aku mendengar [Abdullah bin Syaqiq] bahwa [Mihjan bin Al `Adra'] berkata; Nabiyullah Shallalahu 'Alaihi Wasallam pernah mengutusku untuk suatu keperluan, kemudian beliau mencegatku ketika aku berada di luar dari salah satu jalan kota Madinah. -Ia melanjutkan; - Lalu aku bertolak bersama beliau hingga kami mendaki gunung Uhud dan kami menghadap ke Madinah, beliau berkata; \"Celakalah induk kampung ini, pada suatu hari ketika penduduknya meninggalkannya, \" -menurut lafadz [Yazid] berkata; seperti buah-buahan yang matang, - Mihjan berkata; aku bertanya; 'Wahai nabi Allah, siapa yang makan buah-buahannya?.' Beliau bersabda: \"Burung-burung yang sehat dan hewan buas.\" Beliau menlanjutkan: \"Dan dajjal tidak akan memasukinya, setiap kali ia hendak memasukinya, maka di setiap jalan setapak ia berhadapan dengan malaikat yang menghunus (pedang), ' kemudian kami kembali hingga sampai di pintu masjid, disana ada seseorang yang sedang sholat, beliau bertanya; \"Apakah kamu mengira ia adalah orang yang jujur?\" Aku berkata; 'Wahai Nabi Allah si fulan ini adalah orang yang baik di Madinah, ' atau dia berkata; 'orang Madinah yang paling banyak sholatnya.' Belaiu bersabda: \"Janganlah engkau memperdengarkannya, hingga kamu dapat merusak sholatnya\" (beliau mengatakannya dua atau tiga kali), \"sungguh kalian adalah umat yang dikehendaki mendapatkan keringanan.\" Telah menceritakan kepada kami [Hajjaj], telah menceritakan kepadaku [Syu'bah] dari [Abu Bisyr] berkata; Aku mendengar [Abdullah bin Syaqiq] menceritakannya dari [Raja` bin Abu Raja` Al Bahili] dari [Mihjan] seseorang dari kalangan Aslam, lalu dia menyebutkan seperti diatas."
            },
            {
                "number": 2628,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا أَبُو عَوَانَةَ حَدَّثَنَا أَبُو بِشْرٍ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ رَجَاءِ بْنِ أَبِي رَجَاءٍ الْبَاهِلِيِّ عَنْ مِحْجَنٍ قَالَ عَفَّانُ وَهُوَ ابْنُ الْأَدْرَعِ قَالَ وَحَدَّثَنَا حَمَّادٌ عَنِ الْجُرَيْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ مِحْجَنِ بْنِ الْأَدْرَعِ قَالَقَالَ رَجَاءٌ أَقْبَلْتُ مَعَ مِحْجَنٍ ذَاتَ يَوْمٍ حَتَّى إِذَا انْتَهَيْنَا إِلَى مَسْجِدِ الْبَصْرَةِ فَوَجَدْنَا بُرَيْدَةَ الْأَسْلَمِيَّ عَلَى بَابٍ مِنْ أَبْوَابِ الْمَسْجِدِ جَالِسًا قَالَ وَكَانَ فِي الْمَسْجِدِ رَجُلٌ يُقَالُ لَهُ سُكْبَةُ يُطِيلُ الصَّلَاةَ فَلَمَّا انْتَهَيْنَا إِلَى بَابِ الْمَسْجِدِ وَعَلَيْهِ بُرَيْدَةُ قَالَ وَكَانَ بُرَيْدَةُ صَاحِبَ مُزَاحَاتٍ قَالَ يَا مِحْجَنُ أَلَا تُصَلِّي كَمَا يُصَلِّي سُكْبَةُ قَالَ فَلَمْ يَرُدَّ عَلَيْهِ مِحْجَنٌ شَيْئًا وَرَجَعَ قَالَ وَقَالَ لِي مِحْجَنٌ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخَذَ بِيَدِي فَانْطَلَقَ يَمْشِي حَتَّى صَعِدَ أُحُدًا فَأَشْرَفَ عَلَى الْمَدِينَةِ فَقَالَ وَيْلُ أُمِّهَا مِنْ قَرْيَةٍ يَتْرُكُهَا أَهْلُهَا كَأَعْمَرِ مَا تَكُونُ يَأْتِيهَا الدَّجَّالُ فَيَجِدُ عَلَى كُلِّ بَابٍ مِنْ أَبْوَابِهَا مَلَكًا مُصْلِتًا فَلَا يَدْخُلُهَا قَالَ ثُمَّ انْحَدَرَ حَتَّى إِذَا كُنَّا بِسُدَّةِ الْمَسْجِدِ رَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا يُصَلِّي فِي الْمَسْجِدِ وَيَسْجُدُ وَيَرْكَعُ وَيَسْجُدُ وَيَرْكَعُ قَالَ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ هَذَا قَالَ فَأَخَذْتُ أُطْرِيهِ لَهُ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ هَذَا فُلَانٌ وَهَذَا وَهَذَا قَالَ اسْكُتْ لَا تُسْمِعْهُ فَتُهْلِكَهُ قَالَ ثُمَّ انْطَلَقَ يَمْشِي حَتَّى إِذَا كُنَّا عِنْدَ حُجْرَةٍ لَكِنَّهُ رَفَضَ يَدِي ثُمَّ قَالَ إِنَّ خَيْرَ دِينِكُمْ أَيْسَرُهُ إِنَّ خَيْرَ دِينِكُمْ أَيْسَرُهُ إِنَّ خَيْرَ دِينِكُمْ أَيْسَرُهُ",
                "id": "Telah menceritakan kepada kami ['Affan]; telah menceritakan kepada kami [Abu 'Awanah]; telah menceritakan kepada kami [Abu Bisyr] dari [Abdullah bin Syaqiq] dari [Raja` bin Abu Raja` Al Bahili] dari [Mihjan], 'Affan menjelaskan; dia adalah Ibnu Al `Adra'. Ahmad bin Hambal berkata; telah menceritakan kepada kami [Hammad] dari [Al Jurairi] dari [Abdullah bin Syaqiq] dari [Mihjan bin Al `Adra'], Raja`menuturkan; Aku berangkat bersama Mihjan di suatu hari hingga ketika kami sampai di masjid Bashrah kami bertemu dengan Buraidah Al Aslami di salah satu pintu masjid sedang duduk, -ia melanjutkan; - dan di dalam masjid ada seseorang yang dipanggil dengan sebutan Subkah, ia memanjangkan sholatnya. Ketika kami sampai di pintu masjid dan Buraidah sedang ada disana, -dan Buraidah adalah orang yang suka berkelakar- dia bertanya; 'Wahai Mihjan, kenapa engkau tidak melaksanakan sholat sebagaimana sholatnya Sukbah? ' Raja` melanjutkan; Mihjan tidak menjawab sepatah kata pun kepadanya dan ia pun pulang. Kemudian [Mihjan] berkata padaku; sesungguhnya Rasulullah Shallalahu 'Alaihi Wasallam pernah menggandeng tanganku menaiki gunung Uhud kemudian menghadap ke arah Madinah dan bersabda: \"Celakalah ibu suatu negri yang di tinggalkan penduduknya, seperti halnya negri yang penuh dengan aktifitas. Kemudian Dajjal datang, akan tetapi dia mendapati di setiap pintunya terdapat Malaikat menghunus senjata, maka dia tidak dapat memasukinya.\" Kemudian beliau turun sehingga kami sampai di pelataran masjid, Rasulullah shallallahu 'alaihi wasallam melihat seseorang yang sholat di masjid, dia bersujud dan ruku, bersujud dan ruku, kemudian beliau bertanya padaku; \"Siapa orang ini?\" maka Aku menghadap beliau dan berkata; 'wahai Rasulullah, dia ini adalah fulan, dia ini seperti ini dan seperti ini.' Beliau bersabda: \"Diam kamu, janganlahkamu memperdengarkan kepadanya, karena bisa jadi kamu merusak (sholat) nya, \" kemudian beliau pergi hingga sampai di rumah, beliau melepas pegangan tanganku seraya bersabda: \"Sungguh kebaikan agama kalian adalah kemudahannya, kebaikan agama kalian adalah kemudahannya, kebaikan agama kalian adalah karena kemudahannya.\""
            },
            {
                "number": 2629,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا هِشَامٌ وَيَزِيدُ قَالَ أَخْبَرَنَا هِشَامٌ عَنْ حَفْصَةَ عَنْ أَبِي الْعَالِيَةِ عَنِ الْأَنْصَارِيِّ قَالَ يَزِيدُ عَنْ رَجُلٍ مِنْ الْأَنْصَارِ قَالَخَرَجْتُ مِنْ أَهْلِي أُرِيدُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا أَنَا بِهِ قَائِمٌ وَرَجُلٌ مَعَهُ مُقْبِلٌ عَلَيْهِ فَظَنَنْتُ أَنَّ لَهُمَا حَاجَةً قَالَ فَقَالَ الْأَنْصَارِيُّ وَاللَّهِ لَقَدْ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى جَعَلْتُ أَرْثِي لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ طُولِ الْقِيَامِ فَلَمَّا انْصَرَفَ قُلْتُ يَا رَسُولَ اللَّهِ لَقَدْ قَامَ بِكَ الرَّجُلُ حَتَّى جَعَلْتُ أَرْثِي لَكَ مِنْ طُولِ الْقِيَامِ قَالَ وَلَقَدْ رَأَيْتُهُ قُلْتُ نَعَمْ قَالَ أَتَدْرِي مَنْ هُوَ قُلْتُ لَا قَالَ ذَاكَ جِبْرِيلُ عَلَيْهِ السَّلَام مَا زَالَ يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ سَيُوَرِّثُهُ ثُمَّ قَالَ أَمَا إِنَّكَ لَوْ سَلَّمْتَ عَلَيْهِ رَدَّ عَلَيْكَ السَّلَامَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Hisyam] dan [Yazid], ia berkata; telah mengabarkan kepada kami [Hisyam] dari [Hafshah] dari [Abu 'Aliyah] dari [Al Anshari], [Yazid] mengatakan dari [seorang laki-laki] Anshar, dia berkata; \"Aku keluar dari keluargaku hendak menemui Nabi shallallahu 'alaihi wasallam. Ketika aku berdiri di sisi beliau, tiba-tiba ada seseorang yang sedang menghadap beliau. Aku mengira ada urusan di antara mereka berdua.\" Orang Anshar tadi berkata; 'Demi Allah, Rasulullah shallallahu 'alaihi wasallam telah berdiri (lama) hingga aku kasihan terhadap Rasulullah shallallahu 'alaihi wasallam karena lamanya berdiri. Ketika akan beranjak, kukatakan; 'Wahai Rasulullah, laki-laki itu telah bersama Anda hingga saya kasihan terhadap Anda karena lamanya berdiri.' Beliau bersabda: \"Apakah kau benar-benar melihatnya.\" Kujawab, 'Ya.' Beliau bertanya: \"Tahukah kau siapa dia?\" Kujawab; 'Tidak.' Beliau bersabda: \"Dia adalah Jibril alaihissalam. Jibril selalu berwasiat kepadaku (suapaya berbuat baik) terhadap tetangga hingga kukira seakan-akan tetangga juga akan memperoleh harta warisan.\" Sabda beliau lagi; \"Ketahuilah, sesungguhnya jika kau mengucap salam kepadanya, niscaya ia akan menjawab salammu.\""
            },
            {
                "number": 2630,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ بُدَيْلٍ الْعُقَيْلِيِّ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ شَقِيقٍ أَنَّهُ أَخْبَرَهُ مَنْسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِوَادِي الْقُرَى وَهُوَ عَلَى فَرَسِهِ فَسَأَلَهُ رَجُلٌ مِنْ بُلْقِينَ فَقَالَ يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ هَؤُلَاءِ قَالَ هَؤُلَاءِ الْمَغْضُوبُ عَلَيْهِمْ وَأَشَارَ إِلَى الْيَهُودِ قَالَ فَمَنْ هَؤُلَاءِ قَالَ هَؤُلَاءِ الضَّالِّينَ يَعْنِي النَّصَارَى قَالَ وَجَاءَهُ رَجُلٌ فَقَالَ اسْتُشْهِدَ مَوْلَاكَ أَوْ قَالَ غُلَامُكَ فُلَانٌ فَقَالَ بَلْ يُجَرُّ إِلَى النَّارِ فِي عَبَاءَةٍ غَلَّهَا",
                "id": "Telah menceritakan kepada kami [Abdurrazaq], telah menceritakan kepada kami [Ma'mar] dari [Budail Al 'Uqaili], telah mengabarkan kepadaku ['Abdullah bin Syaqiq], bahwa ia diberitahu oleh [orang] yang pernah mendengar Nabi shallallahu 'alaihi wasallam ketika di wadi al-Qura, saat itu beliau sedang berada di atas kudanya. Beliau ditanya oleh seorang laki-laki dari Bulqin. Katanya; \"Wahai Rasulullah, siapakah mereka.\" Beliau menjawab; \"Mereka adalah orang-orang yang di murkai\" -sambil menunjuk ke arah orang-orang Yahudi- Dia bertanya lagi, \"Lalu, siapakah orang-orang itu?\" Beliau menjawab: \"Mereka adalah orang-orang yang sesat.\" Yaitu, orang-orang Nashrani. Kata dia; \"Lalu ada seseorang mendatanginya dan mengatakan, 'Maula, atau budakmu Fulan mati syahid.' Beliau bersabda: \"Bahkan, ia diseret ke Neraka karena mantel yang telah ia curi.\""
            },
            {
                "number": 2631,
                "arab": "حَدَّثَنَا بَهْزٌ وَعَبْدُ الصَّمَدِ قَالَا حَدَّثَنَا أَبُو هِلَالٍ عَنْ قَتَادَةَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ مُرَّةَ الْبَهْزِيِّ قَالَكُنْتُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ بَهْزٌ فِي حَدِيثِهِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَهِيجُ فِتْنَةٌ كَالصَّيَاصِي فَهَذَا وَمَنْ مَعَهُ عَلَى الْحَقِّ قَالَ فَذَهَبْتُ فَأَخَذْتُ بِمَجَامِعِ ثَوْبِهِ فَإِذَا هُوَ عُثْمَانُ بْنُ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ",
                "id": "Telah menceritakan kepada kami [Bahz] dan [Abdushamad], keduanya berkata; telah menceritakan kepada kami [Abu Hilal] dari [Qatadah] dari [Abdullah bin Syaqiq] dari [Murrah Al Bahzi], dia berkata; \"Aku pernah berada di sisi Rasulullah shallallahu 'alaihi wasallam. [Bahz] mengatakan dalam haditsnya, dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan terjadi fitnah layaknya tanduk sapi. Sedangkan orang Ini dan orang-orang yang bersamanya berada di atas kebenaran.\" Dia berkata, \"Lalu aku segera bangkit, lalu kutarik semua kainnya, ternyata ia adalah 'Utsman bin 'Affan Radhiyallaahu 'Anhu.\""
            },
            {
                "number": 2632,
                "arab": "حَدَّثَنَا أَبُو أُسَامَةَ قَالَ أَنْبَأَنَا كَهْمَسٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ شَقِيقٍ حَدَّثَنَا هَرَمِيُّ بْنُ الْحَارِثِ وَأُسَامَةُ بْنُ خُرَيْمٍ وَكَانَا يُغَازِيَانِ فَحَدَّثَانِي حَدِيثًا وَلَا يَشْعُرُ كُلُّ وَاحِدٍ مِنْهُمَا أَنَّ صَاحِبَهُ حَدَّثَنِيهِ عَنْ مُرَّةَ الْبَهْزِيِّ قَالَبَيْنَمَا نَحْنُ مَعَ نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي طَرِيقٍ مِنْ طُرُقِ الْمَدِينَةِ فَقَالَ كَيْفَ فِي فِتْنَةٍ تَثُورُ فِي أَقْطَارِ الْأَرْضِ كَأَنَّهَا صَيَاصِي بَقَرٍ قَالُوا نَصْنَعُ مَاذَا يَا نَبِيَّ اللَّهِ قَالَ عَلَيْكُمْ هَذَا وَأَصْحَابَهُ أَوْ اتَّبِعُوا هَذَا وَأَصْحَابَهُ قَالَ فَأَسْرَعْتُ حَتَّى عَطَفْتُ عَلَى الرَّجُلِ فَقُلْتُ هَذَا يَا نَبِيَّ اللَّهِ قَالَ هَذَا فَإِذَا هُوَ عُثْمَانُ بْنُ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ",
                "id": "Telah menceritakan kepada kami [Abu Usamah], ia berkata; telah memberitakan pada kami [Kahmas], telah menceritakan kepada kami [Abdullah bin Syaqiq], telah menceritakan kepada kami [Harami bin Al Harits] dan [Usamah bin Khuraim] -keduanya adalah seorang pejuang- mereka menceritakan satu hadits dan keduanya tidak merasa bila yang mereka ceritakan adalah dari [Murrah Al BAhzi], ia berkata; \"Ketika kami bersama Rasulullah Shallalahu 'Alaihi Wasallam di suatu jalan di jalanan Madinah, beliau bersabda: \"Bagaimana jika terjadi fitnah yang meliputi bumi layaknya tanduk sapi?.\" Mereka bertanya; \"Lalu bagaimana yang harus kami lakukan wahai Nabiyullah?.\" Beliau bersabda: \"Hendaknya kalian bersama orang ini dan para sahabatnya -atau bersabda- ikutilah orang ini dan para sahabatnya.\" Lalu aku segera menoleh ke arah seorang laki-laki, kemudian aku berkata; Orang ini wahai Nabiyullah? Beliau menjawab; \"Ya, orang ini.\" Ternyata ia adalah Utsman bin 'Affan radliallahu 'anhu."
            },
            {
                "number": 2633,
                "arab": "حَدَّثَنَا يَزِيدُ أَخْبَرَنَا كَهْمَسُ بْنُ الْحَسَنِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ شَقِيقٍ حَدَّثَنِي رَجُلٌ مِنْ عَنَزَةَ يُقَالُ لَهُ زَائِدَةُ أَوْ مَزِيدَةُ بْنُ حَوَالَةَ قَالَكُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ مِنْ أَسْفَارِهِ فَنَزَلَ النَّاسُ مَنْزِلًا وَنَزَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ظِلِّ دَوْحَةٍ فَرَآنِي وَأَنَا مُقْبِلٌ مِنْ حَاجَةٍ لِي وَلَيْسَ غَيْرُهُ وَغَيْرُ كَاتِبِهِ فَقَالَ أَنَكْتُبُكَ يَا ابْنَ حَوَالَةَ قُلْتُ عَلَامَ يَا رَسُولَ اللَّهِ قَالَ فَلَهَا عَنِّي وَأَقْبَلَ عَلَى الْكَاتِبِ قَالَ ثُمَّ دَنَوْتُ دُونَ ذَلِكَ قَالَ فَقَالَ أَنَكْتُبُكَ يَا ابْنَ حَوَالَةَ قُلْتُ عَلَامَ يَا رَسُولَ اللَّهِ قَالَ فَلَهَا عَنِّي وَأَقْبَلَ عَلَى الْكَاتِبِ قَالَ ثُمَّ جِئْتُ فَقُمْتُ عَلَيْهِمَا فَإِذَا فِي صَدْرِ الْكِتَابِ أَبُو بَكْرٍ وَعُمَرُ فَظَنَنْتُ أَنَّهُمَا لَنْ يُكْتَبَا إِلَّا فِي خَيْرٍ فَقَالَ أَنَكْتُبُكَ يَا ابْنَ حَوَالَةَ فَقُلْتُ نَعَمْ يَا نَبِيَّ اللَّهِ فَقَالَ يَا ابْنَ حَوَالَةَ كَيْفَ تَصْنَعُ فِي فِتْنَةٍ تَثُورُ فِي أَقْطَارِ الْأَرْضِ كَأَنَّهَا صَيَاصِي بَقَرٍ قَالَ قُلْتُ أَصْنَعُ مَاذَا يَا رَسُولَ اللَّهِ قَالَ عَلَيْكَ بِالشَّامِ ثُمَّ قَالَ كَيْفَ تَصْنَعُ فِي فِتْنَةٍ كَأَنَّ الْأُولَى فِيهَا نَفْجَةُ أَرْنَبٍ قَالَ فَلَا أَدْرِي كَيْفَ قَالَ فِي الْآخِرَةِ وَلَأَنْ أَكُونَ عَلِمْتُ كَيْفَ قَالَ فِي الْآخِرَةِ أَحَبُّ إِلَيَّ مِنْ كَذَا وَكَذَا",
                "id": "Telah menceritakan kepada kami [Yazid], telah mengabarkan kepada kami [Kahmas bin Al Hasan], telah menceritakan kepada kami ['Abdullah bin Syaqiq], telah menceritakan kepada kami seorang laki-laki dari 'Anazah yang bernama [Za`idah] atau Mazidah bin Hawalah ia berkata; \"Kami pernah bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan. Orang-orang singgah di suatu tempat sementara Nabi shallallahu 'alaihi wasallam pun singgah di teteduhan pohon besar. Beliau melihat aku yang baru saja selesai dari suatu hajat. Pada saat itu, tidak ada orang lain selain beliau dan asistennya. Beliau bersabda: \"Maukah kau kami cantumkan, wahai Ibnu Hawalah?\" Kukatakan; \"Untuk apa, wahai Rasulullah?\" Beliau tidak menghiraukanku dan menuju ke juru tulis. Dia berkata; \"Aku lebih mendekat lagi. Katanya; 'Beliau bersabda lagi: \"Maukah kau kami cantumkan, wahai Ibnu Hawalah?\" Kukatakan; \"Untuk apa, wahai Rasulullah?\" Beliau tidak menghiraukanku dan mendatangi juru tulis. Dia berkata; \"Aku datang ke sana dan berdiri di sisi mereka. Di depan pasukan ternyata ada Abu Bakr dan Umar. Menurutku, mereka tidak diikutsertakan melainkan untuk kebaikan. Beliau berkata lagi, 'Maukah kau kami cantumkan, wahai Ibnu Hawalah? ' Kukatakan; 'Mau, wahai Nabi Allah.' Sabda beliau: \"Wahai Ibnu Hawalah, apakah yang akan kau perbuat ketika terjadi suatu fitnah yang menggejolak di seluruh penjuru bumi hingga seolah-olah ia bagaikan tanduk sapi?.' 'Aku balik bertanya; 'Apakah yang harus saya lakukan, wahai Rasulullah?.' Beliau bersabda: \"Tinggallah di Syam.\" Beliau kemudian bersabda: \"Apakah yang akan kau lakukan ketika terjadi fitnah di mana yang paling utama pada saat itu adalah melompat seperti kelinci.\" Dia berkata; 'Saya tidak tahu bagaimana jawaban akhirnya. Sungguh, aku mengetahui apa yang beliau ucapkan di akhir itu lebih kusukai dari pada sekian dan sekian.\""
            },
            {
                "number": 2634,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ رَبِيعَةَ بْنِ لَقِيطٍ عَنْ عَبْدِ اللَّهِ بْنِ حَوَالَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ نَجَا مِنْ ثَلَاثٍ فَقَدْ نَجَا ثَلَاثَ مَرَّاتٍ مَوْتِي وَالدَّجَّالِ وَقَتْلِ خَلِيفَةٍ مُصْطَبِرٍ بِالْحَقِّ مُعْطِيهِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ishaq], telah menceritakan kepada kami [Yahya bin Ayyub], telah menceritakan padaku [Yazid bin Abu Habib] dari [Rabi'ah bin Laqith] dari [Abdullah bin Hawalah] bahwa Nabi Shalallahu 'Alaihi Wasallam bersabda: \"Barang siapa yang selamat dari tiga hal maka ia telah selamat tiga kali; kematianku, Dajjal dan pembunuhan seorang khalifah yang sabat mempertahankan kebenaran, dan khalifah tersebut telah memasrahkan supaya kebenaran dituntaskan.\""
            },
            {
                "number": 2635,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ وَهَاشِمُ بْنُ الْقَاسِمِ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ رَاشِدٍ حَدَّثَنَا مَكْحُولٌ عَنْ عَبْدِ اللَّهِ بْنِ حَوَالَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَيَكُونُ جُنْدٌ بِالشَّامِ وَجُنْدٌ بِالْيَمَنِ فَقَالَ رَجُلٌ فَخِرْ لِي يَا رَسُولَ اللَّهِ إِذَا كَانَ ذَلِكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْكَ بِالشَّامِ عَلَيْكَ بِالشَّامِ ثَلَاثًا عَلَيْكَ بِالشَّامِ فَمَنْ أَبَى فَلْيَلْحَقْ بِيَمَنِهِ وَلْيَسْقِ مِنْ غُدُرِهِ فَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى قَدْ تَكَفَّلَ لِي بِالشَّامِ وَأَهْلِهِ قَالَ أَبُو النَّضْرِ مَرَّتَيْنِ فَلْيَلْحَقْ بِيَمَنِهِ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id] maula bani Hasyim dan [Hasyim bin Al Qasim], keduanya berkata; telah menceritakan kepada kami [Muhammad bin Rasyid], telah menceritakan kepada kami [Makhul] dari [Abdullah bin Hawalah] bahwa Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Akan ada pasukan di Syam dan di Yaman.\" Seseorang berkata; \"Pilihkanlah (antara kedua pasukan) buatku wahai Rasulullah jika keadaannya demikian?.\" Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Ikutlah dengan pasukan Syam, Ikutlah dengan pasukan Syam (sebanyak tiga kali), ikutlah dengan pasukan Syam, maka barangsiapa yang enggan hendaklah bergabung dengan yang di yaman dan minumlah dari telaganya, Karena Allah Tabaraka Wata'ala telah menjamin untukku negri Syam dan penduduknya.\" Dalam lafadz Abu Nadhar berkata; \"Ikutilah Yaman (sebanyak dua kali).\""
            },
            {
                "number": 2636,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا هِشَامٌ عَنْ أَبِيهِ عَنِ الْأَحْنَفِ بْنِ قَيْسٍ عَنْ عَمٍّ يُقَالُ لَهُ جَارِيَةُ بْنُ قُدَامَةَ السَّعْدِيُّ أَنَّهُسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ قُلْ لِي قَوْلًا يَنْفَعُنِي وَأَقْلِلْ عَلَيَّ لَعَلِّي أَعِيهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَغْضَبْ فَأَعَادَ عَلَيْهِ مِرَارًا كُلُّ ذَلِكَ يَقُولُ لَا تَغْضَبْحَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ أَخْبَرَنَا هِشَامٌ أَخْبَرَنِي أَبِي عَنِ الْأَحْنَفِ بْنِ قَيْسٍ عَنْ عَمٍّ لَهُ يُقَالُ لَهُ جَارِيَةُ بْنُ قُدَامَةَ أَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ قُلْ لِي قَوْلًا وَأَقْلِلْ عَلَيَّ وَذَكَرَ الْحَدِيثَ قَالَ حَدَّثَنَا يَحْيَى كَذَا قَالَ هِشَامٌ قُلْتُ يَا رَسُولَ اللَّهِ وَهُمْ يَقُولُونَ لَمْ يُدْرِكْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي يَحْيَى بْنَ سَعِيدٍ يَقُولُ وَهُمْ يَقُولُونَ حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنِ الْأَحْنَفِ بْنِ قَيْسٍ عَنْ جَارِيَةَ بْنِ قُدَامَةَ قَالَ وَحَدَّثَنِي عَمٌّ لِي أَنَّهُ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ عَلِّمْنِي شَيْئًا يَنْفَعُنِي وَأَقْلِلْ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Ibnu Numair], telah menceritakan kepada kami [Hisyam] dari [Ayahnya] dari [Al Ahnaf bin Qais] dari pamannya yang dikenal dengan [Jariyah bin Qudamah As Sa'di] bahwa ia bertanya pada Rasulullah Shallalahu 'Alaihi Wasallam.\"Wahai Rasululah, katakanlah padaku satu kalimat yang dengannya dapat memberi manfaat untukku, dan tunjukan yang tidak baik agar aku dapat berpaling darinya!.\" Beliau bersabda: \"Jangan kamu marah.\" Ia punm mengulangi pertanyaannya terus-menerus.\" Namun Beliau tetap menjawab: \"Jangan kamu marah.\" Telah menceritakan kepada kami [Yahya bin Sa'id], telah mengabarkan kepada kami [Hisyam], telah mengabarkan kepadaku [Ayahku] dari [Ahnaf bin Qais] dari pamannya yang dikenal dengan [Jariyah bin Qudamah As Sa'di] bahwa ia bertanya; \"Wahai Rasululah, katakanlah padaku satu kalimat (yang bermanfaat untukku), dan tunjukan yang tidak baik (agar aku dapat berpaling darinya)!.\" Lalu ia menyebutkan hadits tersebut. perawi berkata; telah menceritakan kepada kami Yahya seperti ini, telah menceritakan kepada kami Hisyam, aku bertanya; \"Wahai Rasulullah….\" Namun mereka mengatakan; \"ia tidak pernah bertemu Nabi shallallahu 'alaihi wasallam yaitu Yahya bin Sa'id, ia berkata dan mereka pun bertutur pula. Telah menceritakan kepada kami [Abu Mu'awiyah]; telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [Ayahnya] dari [Ahnaf bin Qais] dari [Jariyah bin Qudamah] ia berkata; telah menceritakan kepadaku pamanku bahwa ia menemui Rasulullah Shallalahu 'Alaihi Wasallam dan bertanya; \"Wahai Rasululah, katakanlah padaku satu kalimat (yang manfaat untukku), dan tunjukan yang tidak baik (agar aku dapat berpaling darinya)!.\" Lalu ia menyebutkan hadits tersebut."
            },
            {
                "number": 2637,
                "arab": "حَدَّثَنَا يَزِيدُ حَدَّثَنَا الْجُرَيْرِيُّ عَنْ أَبِي السَّلِيلِ قَالَ وَقَفَ عَلَيْنَا رَجُلٌ فِي مَجْلِسِنَا بِالْبَقِيعِ فَقَالَ حَدَّثَنِي أَبِي أَوْ عَمِّي أَنَّهُرَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْبَقِيعِ وَهُوَ يَقُولُ مَنْ يَتَصَدَّقُ بِصَدَقَةٍ أَشْهَدُ لَهُ بِهَا يَوْمَ الْقِيَامَةِ قَالَ فَحَلَلْتُ مِنْ عِمَامَتِي لَوْثًا أَوْ لَوْثَيْنِ وَأَنَا أُرِيدُ أَنْ أَتَصَدَّقَ بِهِمَا فَأَدْرَكَنِي مَا يُدْرِكُ بَنِي آدَمَ فَعَقَدْتُ عَلَيَّ عِمَامَتِي فَجَاءَ رَجُلٌ وَلَمْ أَرَ بِالْبَقِيعِ رَجُلًا أَشَدَّ سَوَادًا أَصْفَرَ مِنْهُ وَلَا آدَمَ يَعْبُرُ بِنَاقَةٍ لَمْ أَرَ بِالْبَقِيعِ نَاقَةً أَحْسَنَ مِنْهَا فَقَالَ يَا رَسُولَ اللَّهِ أَصَدَقَةٌ قَالَ نَعَمْ قَالَ دُونَكَ هَذِهِ النَّاقَةَ قَالَ فَلَزِمَهُ رَجُلٌ فَقَالَ هَذَا يَتَصَدَّقُ بِهَذِهِ فَوَاللَّهِ لَهِيَ خَيْرٌ مِنْهُ قَالَ فَسَمِعَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ كَذَبْتَ بَلْ هُوَ خَيْرٌ مِنْكَ وَمِنْهَا ثَلَاثَ مِرَارٍ ثُمَّ قَالَ وَيْلٌ لِأَصْحَابِ الْمِئِينَ مِنْ الْإِبِلِ ثَلَاثًا قَالُوا إِلَّا مَنْ يَا رَسُولَ اللَّهِ قَالَ إِلَّا مَنْ قَالَ بِالْمَالِ هَكَذَا وَهَكَذَا وَجَمَعَ بَيْنَ كَفَّيْهِ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ ثُمَّ قَالَ قَدْ أَفْلَحَ الْمُزْهِدُ الْمُجْهِدُ ثَلَاثًا الْمُزْهِدُ فِي الْعَيْشِ الْمُجْهِدُ فِي الْعِبَادَةِ",
                "id": "Telah menceritakan kepada kami [Yazid], telah menceritakan kepada kami [Al Jurairi] dari [Abu Salil], dia berkata; \"Seorang laki-laki berhenti di majelis kami di Baqi'. Ia lantas berkata, telah menceritakan kepadaku [Ayahku] atau pamanku bahwa ia pernah melihat Rasulullah shallallahu 'alaihi wasallam di Baqi' tengah bersabda: \"Barang siapa bersedekah dengan suatu sedekah, maka aku akan bersaksi untuknya pada hari Kiamat kelak.\" Ayah atau pamanku berkata; \"Segera kuurai satu atau dua lembar kain surbanku. Aku ingin bersedekah dengan keduanya. Tapi, aku tertimpa sesuatu (sifat kikir) sebagaimana menimpa bani Adam yang lain. Segera kuikat kainku kembali. Tak lama Kemudian datanglah seorang laki-laki yang aku tak pernah melihatnya di Baqi' orang yang lebih legam, kuning, (atau sawo matang) dari pada dia. Ia melaju dengan sebuah unta yang tidak pernah kulihat di Baqi' ini seekor unta yang lebih bagus daripadanya. Ia lantas berkata; \"Wahai Rasulullah, apakah ia (bernilai) sedekah? ' Beliau bersabda: \"Ya.\" Laki-laki itu berkata; 'Ambillah unta ini.\" Ayah atau pamanku berkata; 'Kemudian seorang laki-laki membuntutinya lalu berkata, 'Orang ini telah bersedekah dengannya. Demi Allah, unta itu benar-benar lebih baik daripadanya.\" Dia berkata; 'Ternyata Rasulullah shallallahu 'alaihi wasallam mendengar hal itu lalu bersabda: \"Kau salah, bahkan ia lebih baik daripada kamu dan dari padanya (maksudnya adalah unta disebutkan hingga tiga kali).\" Kemudian beliau bersabda: \"Celakalah para pemilik ratusan unta (beliau mengulangi hingga tiga kali).\" Mereka berkata; \"Kecuali siapa, wahai Rasulullah? ' Beliau bersabda: \"Kecuali orang yang mengeluarkan hartanya seperti ini dan seperti ini.\" Beliau himpun kedua telapak tangannya dari kanan dan kirinya kemudian bersabda: \"Sungguh beruntung orang yang zuhud lagi bekerja keras, \" (beliau mengulangnya sampai tiga kali) Zuhud dalam kehidupan (dunia), bekerja keras dalam ibadah.\""
            },
            {
                "number": 2638,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ حَدَّثَنِي مُعَاوِيَةُ بْنُ قُرَّةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا فَسَدَ أَهْلُ الشَّامِ فَلَا خَيْرَ فِيكُمْ وَلَنْ تَزَالَ طَائِفَةٌ مِنْ أُمَّتِي مَنْصُورِينَ لَا يَضُرُّهُمْ مَنْ خَذَلَهُمْ حَتَّى تَقُومَ السَّاعَةُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah], telah menceritakan kepadaku dari [Mu'awiyah bin Qurrah], dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam, dan [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Mu'awiyah bin Qurrah], dari [ayahnya] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Jika penduduk Syam telah rusak (akhlaknya), maka tidak ada kebaikan pada diri kalian. Dan akan selalu ada sekelompok orang dari umatku yang senantiasa menang, tidak akan membahayakan mereka orang-orang yang menghinakan mereka hingga tiba hari Kiamat.\""
            },
            {
                "number": 2639,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَبِيهِ قَالَمَسَحَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى رَأْسِي",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Syu'bah] dari [Mu'awiyah bin Qurrah] dari [Ayahnya] ia berkata; \"Nabi Shallalahu 'Alaihi Wasallam pernah mengusap kepalaku.\""
            },
            {
                "number": 2640,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا زِيَادُ بْنُ مِخْرَاقٍ حَدَّثَنَا مُعَاوِيَةُ بْنُ قُرَّةَ عَنْ أَبِيهِأَنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ إِنِّي لَأَذْبَحُ الشَّاةَ وَإِنِّي أَرْحَمُهَا أَوْ قَالَ إِنِّي لَأَرْحَمُ الشَّاةَ أَنْ أَذْبَحَهَا فَقَالَ وَالشَّاةُ إِنْ رَحِمْتَهَا رَحِمَكَ اللَّهُ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Ibrahim], telah menceritakan kepada kami [Ziyad bin Mikhraq], telah menceritakan kepada kami [Mu'awiyah bin Qurrah] dari [Ayahnya] bahwa seorang laki-laki berkata; \"Wahai Rasulullah, aku telah menyembelih seekor kambing, akan tetapi aku merasa kasihan padanya -atau berkata; sesungguhnya aku merasa kasihan jika menyembelihnya.\" Rasulullah Shallalahu 'Alaihi Wasallam bersabda: Beliau bersabda: \"Sekiranya engkau menyayangi kambing, maka Allah akan menyayangimu.\""
            },
            {
                "number": 2641,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا شُعْبَةُ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صِيَامُ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ صِيَامُ الدَّهْرِ وَإِفْطَارُهُ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Syu'bah] dari [Mu'awiyah bin Qurrah] dari [Ayahnya] ia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Puasa tiga hari setiap bulan sama halnya dengan puasa dan berbuka sepanjang tahun.\""
            },
            {
                "number": 2642,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا شُعْبَةُ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَبِيهِ قَالَإِنَّ رَجُلًا كَانَ يَأْتِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ ابْنٌ لَهُ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتُحِبُّهُ فَقَالَ يَا رَسُولَ اللَّهِ أَحَبَّكَ اللَّهُ كَمَا أُحِبُّهُ فَفَقَدَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا فَعَلَ ابْنُ فُلَانٍ قَالُوا يَا رَسُولَ اللَّهِ مَاتَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأَبِيهِ أَمَا تُحِبُّ أَنْ لَا تَأْتِيَ بَابًا مِنْ أَبْوَابِ الْجَنَّةِ إِلَّا وَجَدْتَهُ يَنْتَظِرُكَ فَقَالَ الرَّجُلُ يَا رَسُولَ اللَّهِ أَلَهُ خَاصَّةً أَوْ لِكُلِّنَا قَالَ بَلْ لِكُلِّكُمْحَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ أَخْبَرَنَا شُعْبَةُ قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ قُرَّةَ يُحَدِّثُ عَنْ أَبِيهِ أَنَّ رَجُلًا كَانَ يَأْتِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Syu'bah] dari [Mu'awiyah bin Qurrah] dari [Ayahnya] ia berkata; Seseorang mendatangi Rasulullah Shallalahu 'Alaihi Wasallam sambil membawa anaknya, lalu Nabi Shalallahu 'Alaihi Wasallam bertanya padanya: \"Apakah engkau mencintainya?.\" Ia menjawab; \"Wahai Rasulullah, Allah mencintaimu, demikianlah aku mencintainya.\" Rasulullah Shallalahu 'Alaihi Wasallam lama tidak melihatnya lalu beliau bersabda: \"Dimanakah anak si fulan?.\" Orang-orang menjawab; \"Wahai Rasulullah, sesungguhnya ia telah meninggal.\" Rasulullah Shallalahu 'Alaihi Wasallam bersabda pada ayahnya: \"Tidakkah engkau suka, bila engkau memasuki surga dari satu pintu diantara pintu-pintunya kecuali engkau mendapatkan anakmu sedang menungguimu?.\" Seseorang bertanya; \"Wahai Rasulullah, apakah itu khusus buatnya atau buat semuanya?.\" Beliau menjawab: \"Bahkan untuk semua dari kalian.\" Telah menceritakan kepada kami [Muhammad bin Ja'far], telah mengabarkan kepada kami [Syu'bah] dia berkata; saya mendengar [Mu'awiyah bin Qurrah] dari [Ayahnya] ia berkata; seorang laki-laki datang kepada Rasulullah Shallalahu 'Alaihi Wasallam, lalu ia menyebutkan hadits semisal itu."
            },
            {
                "number": 2643,
                "arab": "حَدَّثَنَا يَزِيدُ أَخْبَرَنَا شُعْبَةُ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا فَسَدَ أَهْلُ الشَّامِ فَلَا خَيْرَ فِيكُمْ وَلَا يَزَالُ نَاسٌ مِنْ أُمَّتِي مَنْصُورِينَ لَا يُبَالُونَ مَنْ خَذَلَهُمْ حَتَّى تَقُومَ السَّاعَةُ",
                "id": "Telah menceritakan kepada kami [Yazid], telah menceritakan kepada kami [Syu'bah] dari [Mu'awiyah bin Qurrah] dari [Ayahnya] dia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Apabila penduduk Syam mengalami kerusakan, maka tiada kebaikan bagi kalian. Dan akan ada sekelompok dari umatku yang senantiasa mendapatkan pertolongan, mereka tidak mempedulikan terhadap orang-orang yang merendahkannya hingga datangnya hari kiamat.\""
            },
            {
                "number": 2644,
                "arab": "حَدَّثَنَا حَسَنٌ يَعْنِي الْأَشْيَبَ وَأَبُو النَّضْرِ قَالَا حَدَّثَنَا زُهَيْرٌ عَنْ عُرْوَةَ بْنِ عَبْدِ اللَّهِ بْنِ قُشَيْرٍ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَبِيهِ قَالَ أَبُو النَّضْرِ فِي حَدِيثِهِ حَدَّثَنِي زُهَيْرٌ حَدَّثَنَا عُرْوَةُ بْنُ عَبْدِ اللَّهِ بْنِ قُشَيْرٍ أَبُو مَهَلٍ الْجُعْفِيُّ حَدَّثَنِي مُعَاوِيَةُ بْنُ قُرَّةَ عَنْ أَبِيهِ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَهْطٍ مِنْ مُزَيْنَةَ فَبَايَعْنَاهُ وَإِنَّ قَمِيصَهُ لَمُطْلَقٌ قَالَ فَبَايَعْنَاهُ ثُمَّ أَدْخَلْتُ يَدِي فِي جَيْبِ قَمِيصِهِ فَمَسِسْتُ الْخَاتَمَ قَالَ عُرْوَةُ فَمَا رَأَيْتُ مُعَاوِيَةَ وَلَا ابْنَهُ قَالَ وَأُرَاهُ يَعْنِي إِيَاسًا فِي شِتَاءٍ قَطُّ وَلَا حَرٍّ إِلَّا مُطْلِقَيْ إِزَارِهِمَا لَا يَزُرَّانِ",
                "id": "Telah menceritakan kepada kami [Hasan yaitu Al Asy-yab] dan [Abu Nadhar], keduanya berkata; telah menceritakan kepada kami [Zuhair] dari ['Urwah bin Abdullah bin Qusyair] dari [Mu'awiyah bin Qurrah] dari [Ayahnya] - [Abu Nadhar] berkata dalam haditsnya; telah menceritakan kepada kami [Zuhair], telah menceritakan kepada kami ['Urwah bin Abdullah bin Qusyair Abu Mahal Al Ju'fi], telah menceritakan kepadaku [Mu'awiyah bin Qurrah] dari [Ayahnya] ia berkata; \"Saya datang kepada Rasulullah Shallalahu 'Alaihi Wasallam bersama beberapa orang dari suku Muzainah, lalu kami berbaiat kepada beliau, sungguh (kancing) baju gamis beliau terlepas, Qurrah berkata; \"Lantas kami pun berbai'at kepada beliau, kemudian aku masukkan tanganku ke saku (gamis) beliau dan aku sempat memegang cincinnya.\" [Urwah] berkata; \"Aku belum pernah melihat Mu'awiyah maupun anaknya, -Urwah berkata; dan setahu saya yang di maksud anaknya adalah Iyas- di musim dingin maupun di musim panas, kecuali kancing kain sarungnya (bajunya) terbuka.\""
            },
            {
                "number": 2645,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ قُرَّةَ يُحَدِّثُ عَنْ أَبِيهِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَاسْتَأْذَنْتُهُ أَنْ أُدْخِلَ يَدِي فِي جُرُبَّانِهِ لِيَدْعُوَ لِي فَمَا مَنَعَهُ وَأَنَا أَلْمِسُهُ أَنْ دَعَا لِي قَالَ فَوَجَدْتُ عَلَى نُغْضِ كَتِفِهِ مِثْلَ السِّلْعَةِ",
                "id": "Telah menceritakan kepada kami [Rauh], telah menceritakan kepada kami [Qurrah bin Khalid], ia berkata; saya mendengar [Mu'awiyah bin Qurrah] menceritakan dari [Ayahnya] ia berkata; \"Saya datang kepada Rasulullah Shallalahu 'Alaihi Wasallam untuk meminta izin memasukkan tanganku ke kantong bajunya agar beliau mendoakanku dan beliau tidak melarangnya, kemudian aku memohonnya agar mendoakanku, maka aku menemukan di atas pundaknya terdapat (sesuatu) seperti daging tumbuh.\""
            },
            {
                "number": 2646,
                "arab": "حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِيَاسٍ عَنْ أَبِيهِأَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَدَعَا لَهُ وَمَسَحَ رَأْسَهُ",
                "id": "Telah menceritakan kepada kami [Wahab bin Jarir] dari [Syu'bah] dari [Abu Iyyas] dari [Ayahnya] bahwa ia pernah datang kepada Nabi Shalallahu 'Alaihi Wasallam lalu Rasulullah Shallalahu 'Alaihi Wasallam mendo'akannya sembari mengusap kepalanya.\""
            },
            {
                "number": 2647,
                "arab": "حَدَّثَنَا وَهْبٌ حَدَّثَنَا شُعْبَةُ عَنْ مُعَاوِيَةَ بْنِ قُرَّةَ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي صِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ الشَّهْرِ صَوْمُ الدَّهْرِ وَإِفْطَارُهُ",
                "id": "Telah menceritakan kepada kami [Wahb], telah menceritakan kepada kami [Syu'bah] dari [Mu'awiyah bin Qurrah] dari [Ayahnya] dari Nabi Shalallahu 'Alaihi Wasallam, beliau bersabda: \"Puasa tiga hari di setiap bulan sama halnya dengan puasa dan berbuka sepanjang tahun.\""
            },
            {
                "number": 2648,
                "arab": "حَدَّثَنَا أَبُو أُسَامَةَ حَمَّادُ بْنُ أُسَامَةَ أَخْبَرَنَا كَهْمَسٌ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ حَدَّثَنِي هَرَمِيُّ بْنُ الْحَارِثِ وَأُسَامَةُ بْنُ خُرَيْمٍ وَكَانَا يُغَازِيَانِ فَحَدَّثَانِي حَدِيثًا وَلَمْ يَشْعُرْ كُلُّ وَاحِدٍ مِنْهُمَا أَنَّ صَاحِبَهُ حَدَّثَنِيهِ عَنْ مُرَّةَ الْبَهْزِيِّ قَالَبَيْنَمَا نَحْنُ مَعَ نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي طَرِيقٍ مِنْ طُرُقِ الْمَدِينَةِ فَقَالَ كَيْفَ تَصْنَعُونَ فِي فِتْنَةٍ تَثُورُ فِي أَقْطَارِ الْأَرْضِ كَأَنَّهَا صَيَاصِي بَقَرٍ قَالُوا نَصْنَعُ مَاذَا يَا نَبِيَّ اللَّهِ قَالَ عَلَيْكُمْ هَذَا وَأَصْحَابَهُ أَوْ اتَّبِعُوا هَذَا وَأَصْحَابَهُ قَالَ فَأَسْرَعْتُ حَتَّى عَيِيتُ فَلَحِقْتُ الرَّجُلَ فَقُلْتُ هَذَا يَا رَسُولَ اللَّهِ قَالَ هَذَا فَإِذَا هُوَ عُثْمَانُ بْنُ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ فَقَالَ هَذَا وَأَصْحَابُهُ وَذَكَرَهُ",
                "id": "Telah menceritakan kepada kami [Abu Usamah Hammad bin Usamah], telah mengabarkan kepada kami [Kahmas] dari [Abdullah bin Syaqiq], telah menceritakan kepadaku [Harami bin Al Harits] dan [Usamah bin Khuraim], -keduanya adalah seorang pejuang- mereka menceritakan satu hadits dan keduanya tidak merasa bila hadits yang mereka sampaikan dari [Murrah Al Bahzi], ia berkata; \"Ketika kami bersama Rasulullah Shallalahu 'Alaihi Wasallam di suatu jalan di jalanan Madinah, beliau bersabda: \"Bagaimana jika terjadi fitnah yang meliputi bumi layaknya tanduk sapi?.\" Mereka bertanya; \"Lalu bagaimana yang harus kami lakukan wahai Nabiyullah?.\" Beliau bersabda: \"Hendaknya kalian bersama orang ini dan para sahabatnya -atau bersabda- ikutilah orang ini dan para sahabatnya.\" Murrah Al Bahzi melanjutkan; \"Lalu aku kejar sehingga aku tak kuasa lagi, lalu aku menemui seorang laki-laki, aku berkata; Orang ini wahai Nabiyullah? Beliau menjawab; \"Ya, orang ini.\" Ternyata ia adalah Utsman bin 'Affan radliallahu 'anhu.\""
            },
            {
                "number": 2649,
                "arab": "حَدَّثَنَا يَحْيَى عَنْ عُيَيْنَةَ قَالَ حَدَّثَنِي أَبِي عَنْ أَبِي بَكْرَةَ وَوَكِيعٌ قَالَ حَدَّثَنَا عُيَيْنَةُ وَيَزِيدُ أَخْبَرَنَا عُيَيْنَةُ عَنْ أَبِيهِ عَنْ أَبِي بَكْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ ذَنْبٍ أَحْرَى أَنْ يُعَجِّلَ بِصَاحِبِهِ الْعُقُوبَةَ مَعَ مَا يُؤَخَّرُ لَهُ فِي الْآخِرَةِ مِنْ بَغْيٍ أَوْ قَطِيعَةِ رَحِمٍ قَالَ وَكِيعٌ أَنْ يُعَجِّلَ اللَّهُ وَقَالَ يَزِيدُ يُعَجِّلُ اللَّهُ وَقَالَ مَعَ مَا يُدَّخَرُ لَهُ",
                "id": "Telah menceritakan kepada kami [Yahya] dari ['Uyainah] ia berkata; telah menceritakan kepadaku [Ayahku] dari [Abu Bakrah] dan [Waki'] ia berkata; telah menceritakan kepada kami ['Uyainah] -dan [Yazid] telah mengabarkan kepada kami ['Uyainah] dari [Ayahnya] dari [Abu Bakrah] - dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada dosa yang di segerakan terhadap pelakunya, dengan siksa yang tetap ia terima di akhirat, daripada kezhaliman atau memutus silaturahmi.\" [Waqi'] ia berkata; \"An Yu'ajjilallahu) Allah menyegerakan.\" [Yazid] berkata dengan redaksi; \"Yu'ajjilullah (Disegerakan Allah).\" Katanya lagi, \"Dengan (tetap merasakan) siksa yang ditangguhkan untuknya.\""
            },
            {
                "number": 2650,
                "arab": "حَدَّثَنَا يَحْيَى عَنْ عُيَيْنَةَ وَوَكِيعٌ حَدَّثَنَا عُيَيْنَةُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي بَكْرَةَ قَالَلَقَدْ رَأَيْتُنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَإِنَّا لَنَكَادُ أَنْ نَرْمُلَ بِهَا قَالَ وَكِيعٌ أَنْ نَرْمُلَ بِالْجِنَازَةِ رَمَلًا",
                "id": "Telah menceritakan kepada kami [Yahya] dari [Uyainah] dan [Waki'], telah menceritakan kepada kami ['Uyainah bin Abdurrahman] dari [Ayahnya] dari [Abu Bakrah] dia berkata; \"Sesungguhnya aku sendiri pernah bersama Rasulullah shallallahu 'alaihi wasallam, dan sungguh kami membawanya (jenazah) sambil berlari-lari kecil (cepat).\" [Waqi'] berkata; \"Membawa jenazah sambil berlari-lari kecil.\""
            },
            {
                "number": 2651,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عُيَيْنَةُ عَنْ أَبِيهِ عَنْ أَبِي بَكْرَةَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ لِتِسْعٍ يَبْقَيْنَ أَوْ لِسَبْعٍ يَبْقَيْنَ أَوْ لِخَمْسٍ أَوْ لِثَلَاثٍ أَوْ آخِرِ لَيْلَةٍ",
                "id": "Telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami ['Uyainah] dari [Ayahnya] dari [Abu Bakrah], dia berkata; \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Carilah ia (lailatul Qadr) di sepuluh hari terakhir, pada hari kedua puluh satu, dua puluh tiga, dua puluh lima, dua puluh tujuh, atau akhir malam (dua puluh sembilan).\""
            },
            {
                "number": 2652,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا زَكَرِيَّا أَبُو عِمْرَانَ شَيْخٌ بَصْرِيٌّ قَالَ سَمِعْتُ شَيْخًا يُحَدِّثُ عَنِ ابْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجَمَ امْرَأَةً فَحَفَرَ لَهَا إِلَى الثَّنْدُوَةِ",
                "id": "Telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami [Zakaria Abu Imran] seorang guru besar di Bashrah, ia berkata; saya mendengar seorang [Syaikh] menceritakan dari [Ibnu Abu Bakrah] dari [Ayahnya] bahwa Nabi shallallahu 'alaihi wasallam pernah merajam seorang wanita, beliau menggali lubang untuknya hingga (setinggi) dada.\""
            },
            {
                "number": 2653,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ وَعَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِ أَنَّهُ كَتَبَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَقْضِي الْحَاكِمُ بَيْنَ اثْنَيْنِ وَهُوَ غَضْبَانُ",
                "id": "Telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami [Sufyan] dan [Abdurrahman] dari [Sufyan] dari [Abdul Malik bin Umair] dari [Abdurrahman bin Abi Bakrah] dari [Ayahnya] ia pernah menulis bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah seorang hakim mengadili dua orang (yang bersengketa) dalam keadaan marah.\""
            },
            {
                "number": 2654,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنِي عُثْمَانُ الشَّحَّامُ عَنْ مُسْلِمِ بْنِ أَبِي بَكْرَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْكُفْرِ وَالْفَقْرِ وَعَذَابِ الْقَبْرِ",
                "id": "Telah menceritakan kepada kami [Waki'], telah menceritakan padaku [Utsman Asy Syakham] dari [Muslim bin Abu Bakrah] dari [Ayahnya] bahwa Nabi shallallahu 'alaihi wasallam biasa berdo'a: \"ALLAHUMMA INNI A'UUDZUBIKA MINAL KUFRI WAL FAQRI WA 'ADZAABIL QABRI. (Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kekufuran, kefakiran, dan adzab kubur).\""
            },
            {
                "number": 2655,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عُثْمَانُ أَبُو سَلَمَةَ الشَّحَّامُ حَدَّثَنِي مُسْلِمُ بْنُ أَبِي بَكْرَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَيَخْرُجُ قَوْمٌ أَحْدَاثٌ أَحِدَّاءُ أَشِدَّاءُ ذَلِقَةٌ أَلْسِنَتُهُمْ بِالْقُرْآنِ يَقْرَءُونَهُ لَا يُجَاوِزُ تَرَاقِيَهُمْ فَإِذَا لَقِيتُمُوهُمْ فَأَنِيمُوهُمْ ثُمَّ إِذَا لَقِيتُمُوهُمْ فَاقْتُلُوهُمْ فَإِنَّهُ يُؤْجَرُ قَاتِلُهُمْ",
                "id": "Telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami [Utsman Abu Salamah Asy Syakham], telah menceritakan kepadaku [Muslim bin Abu Bakrah] dari [Ayahnya] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan keluar sekelompok orang muda usia, bengis, dan keras. Lisan mereka fasih dengan Al Qur'an. Mereka membacanya, tapi tidak sampai tenggorokan mereka. Jika kalian bertemu dengan mereka, maka bunuhlah mereka. Kemudian jika kalian bertemu dengan mereka, maka bunuhlah mereka, karena sesungguhnya membunuh mereka akan mendapatkan pahala.\""
            },
            {
                "number": 2656,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ يُونُسَ بْنِ عُبَيْدٍ عَنِ الْحَكَمِ بْنِ الْأَعْرَجِ عَنِ الْأَشْعَثِ بْنِ ثُرْمُلَةَ عَنْ أَبِي بَكْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ قَتَلَ نَفْسًا مُعَاهَدَةً بِغَيْرِ حِلِّهَا حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ أَنْ يَجِدَ رِيحَهَا",
                "id": "Telah menceritakan kepada kami [Waki'], telah menceritakan kepada kami [Sufyan] dari [Yunus bin 'Ubaid] dari [Al Hakam bin Al A'raj] dari [Al Asy'ats bin Turmulah] dari [Abu Bakrah] ia berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Barangsiapa membunuh jiwa yang berada dalam perjanjian (mu'ahad) tanpa sebab yang di halalkan, maka Allah mengharamkan baginya surga dan tiada mencium baunya.\""
            },
            {
                "number": 2657,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنَا الْجُرَيْرِيُّ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ عَنْ أَبِيهِ قَالَ وَقَالَ إِسْمَاعِيلُ مَرَّةً كُنَّا جُلُوسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَلَا أُنَبِّئُكُمْ بِأَكْبَرِ الْكَبَائِرِ ثَلَاثًا الْإِشْرَاكُ بِاللَّهِ عَزَّ وَجَلَّ قَالَوَذُكِرَ الْكَبَائِرُ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ الْإِشْرَاكُ بِاللَّهِ عَزَّ وَجَلَّ وَعُقُوقُ الْوَالِدَيْنِ وَكَانَ مُتَّكِئًا فَجَلَسَ وَقَالَ وَشَهَادَةُ الزُّورِ وَشَهَادَةُ الزُّورِ وَشَهَادَةُ الزُّورِ أَوْ قَوْلُ الزُّورِ وَشَهَادَةُ الزُّورِ فَمَا زَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَرِّرُهَا حَتَّى قُلْنَا لَيْتَهُ سَكَتَ",
                "id": "Telah menceritakan kepada kami [Isma'il], telah menceritakan kepada kami [Al Jurairi], telah menceritakan kepada kami [Abdurrahman bin Abu Bakrah] dari [Ayahnya] ia berkata; dan di kesempatan lain [Isma'il] berkata; \"Suatu ketika, kami sedang duduk-duduk bersama Nabi Shalallahu 'Alaihi Wasallam, lalu beliau bersabda: \"Maukah aku ceritakan kepada kalian tentang dosa besar yang paling besar?. -beliau mengulanginya hingga tiga kali- yaitu menyekutukan Allah Azza Wa Jalla.\" Isma'il berkata; Lalu disebutkan dosa-dosa besar di sisi Rasulullah Shallalahu 'Alaihi Wasallam, maka beliau bersabda: \"Mempersekutukan Allah dan durhaka kepada orang tua.\" Beliau bersabda demikian sambil bersandar, lalu beliau duduk dan bersabda: \"Persaksian palsu, persaksian palsu, persaksian palsu, atau perkataan palsu dan persaksian palsu.\" Rasulullah Shallalahu 'Alaihi Wasallam mengulang-ulanginya hingga kami mengira beliau tidak akan berhenti (diam)."
            },
            {
                "number": 2658,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ أَخْبَرَنَا أَيُّوبُ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي بَكْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ فِي حَجَّتِهِ فَقَالَ أَلَا إِنَّ الزَّمَانَ قَدْ اسْتَدَارَ كَهَيْئَتِهِ يَوْمَ خَلَقَ اللَّهُ السَّمَوَاتِ وَالْأَرْضَ السَّنَةُ اثْنَا عَشَرَ شَهْرًا مِنْهَا أَرْبَعَةٌ حُرُمٌ ثَلَاثٌ مُتَوَالِيَاتٌ ذُو الْقَعْدَةِ وَذُو الْحِجَّةِ وَالْمُحَرَّمُ وَرَجَبُ مُضَرَ الَّذِي بَيْنَ جُمَادَى وَشَعْبَانَ ثُمَّ قَالَ أَلَا أَيُّ يَوْمٍ هَذَا قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ قَالَ أَلَيْسَ يَوْمَ النَّحْرِ قُلْنَا بَلَى ثُمَّ قَالَ أَيُّ شَهْرٍ هَذَا قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ فَقَالَ أَلَيْسَ ذَا الْحِجَّةِ قُلْنَا بَلَى ثُمَّ قَالَ أَيُّ بَلَدٍ هَذَا قُلْنَا اللَّهُ وَرَسُولُهُ أَعْلَمُ فَسَكَتَ حَتَّى ظَنَنَّا أَنَّهُ سَيُسَمِّيهِ بِغَيْرِ اسْمِهِ قَالَ أَلَيْسَتْ الْبَلْدَةَ قُلْنَا بَلَى قَالَ فَإِنَّ دِمَاءَكُمْ وَأَمْوَالَكُمْ قَالَ وَأَحْسَبُهُ قَالَ وَأَعْرَاضَكُمْ عَلَيْكُمْ حَرَامٌ كَحُرْمَةِ يَوْمِكُمْ هَذَا فِي شَهْرِكُمْ هَذَا فِي بَلَدِكُمْ هَذَا وَسَتَلْقَوْنَ رَبَّكُمْ فَيَسْأَلُكُمْ عَنْ أَعْمَالِكُمْ أَلَا لَا تَرْجِعُوا بَعْدِي ضُلَّالًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ أَلَا هَلْ بَلَّغْتُ أَلَا لِيُبَلِّغْ الشَّاهِدُ الْغَائِبَ مِنْكُمْ فَلَعَلَّ مَنْ يُبَلَّغُهُ يَكُونُ أَوْعَى لَهُ مِنْ بَعْضِ مَنْ يَسْمَعُهُقَالَ مُحَمَّدٌ وَقَدْ كَانَ ذَاكَ قَالَ قَدْ كَانَ بَعْضُ مَنْ بُلِّغَهُ أَوْعَى لَهُ مِنْ بَعْضِ مَنْ سَمِعَهُ",
                "id": "Telah menceritakan kepada kami [Isma'il], telah mengabarkan kepada kami [Ayyub] dari [Muhamad bin Sirin] dari [Abu Bakrah] bahwa Nabi Shalallahu 'Alaihi Wasallam berkhutbah di musim haji, beliau bersabda: \"Ketahuilah bahwa zaman telah berputar sebagaimana mestinya sebagaimana hari ketika Allah menciptakan langit dan bumi, setahun ada dua belas bulan, diantaranya adalah empat bulan haram, tiga bulan berturut-turut, yaitu; Dzul Qa'dah, Dzul Hijjah dan Muharram, sedangkan bulan Rajab terpisah, antara bulan Jumadil (akhir) dan Sya'ban.\" Rasulullah Shallalahu 'Alaihi Wasallam bertanya: \"Hari apakah ini?.\" Mereka menjawab; \"Allah dan Rasul-Nya yang lebih tahu.\" Kemudian beliau terdiam, kami menyangka beliau hendak menyebutkan dengan nama yang lain, beliau bertanya: \"Bukankah ini hari Nahr (penyembelihan hewan kurban)?.\" Kami berkata; \"Ya, benar.\" Lalu beliau bertanya lagi: \"Bulan apakah ini?.\" Mereka menjawab; \"Allah dan Rasul-Nya yang lebih tahu.\" Kemudian beliau terdiam, hingga kami menyangka beliau akan menyebutkan dengan nama yang lain, Beliau lalu bersabda: \"Bukankah ini bulan Dzul Hijjah?.\" Kami pun menjawab; \"Ya, benar.\" Dan beliau bertanya lagi: \"Negeri apakah ini?.\" Mereka menjawab; \"Allah dan Rasul-Nya yang lebih tahu.\" Kemudian beliau terdiam hingga kami menyangka bila beliau akan menyebutkan dengan nama yang lain. Kemudian beliau bersabda: \"Bukankah ini tanah (haram)?.\" Kami menjawab; \"ya.\" Beliau melanjutkan: \"Sesungguhnya darah kalian, harta kalian, -dan aku menyangka beliau bersabda; kehormatan kalian- adalah haram, sebagaimana keharaman hari kalian ini, di bulan kalian ini dan di tanah kalian ini, kalian akan menemui Rabb kalian lalu Dia akan bertanya tentang amalan-amalan kalian, oleh karena itu, ketahuilah… janganlah kalian menjadi sesat sepeninggalku, dengan saling berperang diantara kalian. Ketahuilah, bukankah aku telah menyampaikannya?. Dan hendaklah yang hadir menyampaikan pada yang tidak hadir diantara kalian?. Dan semoga yang menyampaikannya lebih memperhatikan dari orang yang hanya mendengarnya.\" Muhammad berkata; \"Dan waktu itu beliau juga bersabda: \"Sungguh telah ada sebagian yang menyampaikan lebih perhatian daripada yang hanya mendengarkan.\""
            },
            {
                "number": 2659,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا ابْنُ جُرَيْجٍ وَابْنُ بَكْرٍ أَخْبَرَنَا ابْنُ جُرَيْجٍ وَأَبُو عَاصِمٍ عَنِ ابْنِ جُرَيْجٍ أَخْبَرَنِي إِسْمَاعِيلُ بْنُ مُحَمَّدِ بْنِ سَعِيدٍ أَنَّهُ أَخْبَرَهُ حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّ السَّائِبَ بْنَ يَزِيدَ أَخْبَرَهُ أَنَّهُ سَمِعَ الْعَلَاءَ بْنَ الْحَضْرَمِيِّ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْكُثُ الْمُهَاجِرُ بِمَكَّةَ بَعْدَ قَضَاءِ نُسُكِهِ ثَلَاثًا قَالَ أَبُو عَاصِمٍ ثَلَاثَ لَيَالٍ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq], telah menceritakan kepada kami [Ibnu Juraij] dan [Ibnu Bakr] bahwa [Isma'il bin Muhammad bin Sa'id] telah menceritakan kepadaku bahwa [Humaid bin Abdurrahman bin 'Auf] telah menceritakan kepadanya bahwa [As Sa'ib bin Yazid] telah menceritakan kepadanya bahwa dia mendengar [Al 'Ala` Bin Al Hadlrami] berkata; Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Orang-orang muhajirin tinggal di Makkah selama tiga hari setelah menyelesaikan Ibadah haji mereka.\" [Abu 'Ashim] mengatakan; \"Tiga malam.\""
            },
            {
                "number": 2660,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ قَالَ سَمِعْتُ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ يَسْأَلُ السَّائِبَ مَا سَمِعْتَ فِي السُّكْنَى بِمَكَّةَ فَقَالَ حَدَّثَنِي الْعَلَاءُ بْنُ الْحَضْرَمِيِّأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِلْمُهَاجِرِ ثَلَاثًا بَعْدَ الصَّدَرِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Abdurrahman bin Humaid] ia berkata; Aku mendengar Umar bin Abdul 'Aziz bertanya pada [Sa`ib]; \"Apa yang pernah kamu dengar tentang menginap di Makkah?\" Sa`ib menjawab; telah menceritakan kepadaku [Al 'Ala` Bin Al Hadlrami] bahwa Nabi Shalallahu 'Alaihi Wasallam bersabda kepada orang-orang Muhajirin yaitu (untuk tinngal) tiga hari tiga malam setelah mengerjakan ibadah haji.\""
            },
            {
                "number": 2661,
                "arab": "حَدَّثَنَا عَبْد اللَّهِ حَدَّثَنِي أَبِي وَيَحْيَى بْنُ مَعِينٍ قَالَا حَدَّثَنَا عَتَّابُ بْنُ زِيَادٍ حَدَّثَنَا أَبُو حَمْزَةَ قَالَ سَمِعْتُ الْمُغِيرَةَ الْأَزْدِيَّ عَنْ مُحَمَّدِ بْنِ زَيْدٍ عَنْ حَيَّانَ الْأَعْرَجِ عَنِ الْعَلَاءِ بْنِ الْحَضْرَمِيِّ قَالَبَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الْبَحْرَيْنِ أَوْ أَهْلِ هَجَرَ شَكَّ أَبُو حَمْزَةَ قَالَ وَكُنْتُ آتِي الْحَائِطَ يَكُونُ بَيْنَ الْإِخْوَةِ فَيُسْلِمُ أَحَدُهُمْ فَآخُذُ مِنْ الْمُسْلِمِ الْعُشْرَ وَمِنْ الْآخَرِ الْخَرَاجَ",
                "id": "Telah menceritakan kepada kami Abdullah; telah menceritakan kepadaku ayahku dan [Yahya bin Ma'in], keduanya berkata; telah menceritakan kepada kami ['Attab bin Ziyad], telah menceritakan kepada kami [Abu Hamzah], ia berkata; Aku mendengar [Al Mugirah Al `Azdy] dari [Muhammad bin Zaid] dari [Hayyan Al A'raj] dari [Al 'Ala` Bin Al Hadlrami] dia berkata; \"Rasulullah Shallalahu 'Alaihi Wasallam pernah mengutusku ke negeri Bahrain atau penduduk Hajar -Abu Hamzah ragu (mengenai redaksinya) - Al 'Ala` berkata; \"Lalu aku datang ke suatu kebun yang dimiliki oleh beberapa orang bersaudara, lalu salah seorang dari mereka masuk Islam, maka aku mengambil dari seorang muslim sepersepuluh sedangkan dari yang lain sebagai kharaj (pajak).\""
            },
            {
                "number": 2662,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا عَوْفٌ عَنْ عَلْقَمَةَ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ قَالَ حَدَّثَنِي رَجُلٌ قَالَكُنْتُ فِي مَجْلِسٍ فِيهِ عُمَرُ بْنُ الْخَطَّابِ بِالْمَدِينَةِ فَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ لِرَجُلٍ مِنْ جُلَسَائِهِ كَيْفَ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الْإِسْلَامَ بَدَأَ جَذَعًا ثُمَّ ثَنِيًّا ثُمَّ رَبَاعِيًا ثُمَّ سَدَاسِيًّا ثُمَّ بَازِلًا قَالَ فَقَالَ عُمَرُ فَمَا بَعْدَ الْبُزُولِ إِلَّا النُّقْصَانُ",
                "id": "Telah menceritakan kepada kami [Rauh], telah menceritakan kepada kami ['Auf] dari ['Alqamah bin Abdullah Al Muzanni] ia berkata; telah menceritakan padaku [seseorang] ia berkata; Aku pernah bermajlis di Madinah, sedangkan Umar bin Khathab berada di majlis tersebut, lalu Umar radliallahu 'anhu berkata kepada seseorang dari orang yang bermajlis; \"Bagaimana engkau pernah mendengar Rasulullah Shallalahu 'Alaihi Wasallam bersabda?\" laki-laki itu berkata; Aku mendengar Rasulullah Shallalahu 'Alaihi Wasallam bersabda: \"Islam berawal mula (ibarat) unta yang berumur enam tahun, tujuh tahun, delapan tahun, kemudian sembilan tahun. Kata Umar, tak ada harapan setelah sembilan tahun kecuali melemah (kurang kekuatannya)."
            },
            {
                "number": 2663,
                "arab": "حَدَّثَنَا سُرَيْجٌ وَيُونُسُ قَالَا حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ اللَّيْثِيِّ قَالَقَدِمْنَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ شَبَبَةٌ قَالَ فَأَقَمْنَا عِنْدَهُ نَحْوًا مِنْ عِشْرِينَ لَيْلَةً فَقَالَ لَنَا لَوْ رَجَعْتُمْ إِلَى بِلَادِكُمْ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَحِيمًا فَعَلَّمْتُمُوهُمْ قَالَ سُرَيْجٌ وَأَمَرْتُمُوهُمْ أَنْ يُصَلُّوا صَلَاةَ كَذَا حِينَ كَذَا قَالَ يُونُسُ وَمُرُوهُمْ فَلْيُصَلُّوا صَلَاةَ كَذَا فِي حِينِ كَذَا وَصَلَاةَ كَذَا فِي حِينِ كَذَا فَإِذَا حَضَرَتْ الصَّلَاةُ فَلْيُؤَذِّنْ لَكُمْ أَحَدُكُمْ وَلْيَؤُمَّكُمْ أَكْبَرُكُمْ",
                "id": "Telah menceritakan kepada kami [Suraij] dan [Yunus] keduanya berkata; telah menceritakan kepada kami [Hammad yaitu Ibnu Zaid], telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dari [Malik bin Huwairits Al Laitsi] ia berkata; \"Kami datang kepada Nabi Shalallahu 'Alaihi Wasallam ketika itu kami masih muda, lalu kami menginap selama dua puluh malam. Lalu beliau bersabda: \"Kalaulah nanti kalian kembali ke negeri kalian -Rasulullah Shallalahu 'Alaihi Wasallam adalah sosok yang belas kasih- maka ajarkanlah kepada kaum kalian.\" [Suraij] mengatakan (dengan tambahan redaksi); \"Dan suruhlah mereka sholat ini di waktu ini, \" Sedangkan [Yunus] mengatakan (dengan redaksi); \"Dan ajarilah mereka sholat ini di waktu ini serta sholat itu di waktu ini, apabila telah datang waktu sholat, maka hendaklah salah seorang dari kalian mengumandangkan adzan dan yang paling tua menjadi imam kalian.\""
            },
            {
                "number": 2664,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ خَالِدٍ عَنْ أَبِي قِلَابَةَ عَنْ مَالِكِ بْنِ الْحُوَيْرِثِ وَهُوَ أَبُو سُلَيْمَانَأَنَّهُمْ أَتَوْا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ وَصَاحِبٌ لَهُ أَوْ صَاحِبَانِ لَهُ فَقَالَ أَحَدُهُمَا صَاحِبَيْنِ لَهُ أَيُّوبُ أَوْ خَالِدٌ فَقَالَ لَهُمَا إِذَا حَضَرَتْ الصَّلَاةُ فَأَذِّنَا وَأَقِيمَا وَلْيَؤُمَّكُمَا أَكْبَرُكُمَا وَصَلُّوا كَمَا تَرَوْنِي أُصَلِّي",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far], telah menceritakan kepada kami [Syu'bah] dari [Khalid] dari [Abu Qilabah] dari [Malik bin Huwairits yaitu Abu Sulaiman] bahwa mereka datang menemui Nabi Shalallahu 'Alaihi Wasallam, ketika itu disamping beliau ada seorang sahabat, -atau dua orang sahabat, lalu salah satu dari keduanya berkata -Ayyub atau Khalid-, lalu beliau bersabda kepada keduanya: \"Apabila datang waktu sholat, maka kumandangkanlah, dan dirikanlah sholat, hendaklah orang yang lebih tua diantara kalian menjadi imam, lalu sholatlah kalian sebagaimana kalian melihat aku sholat.\""
            }
        ]
    }
}