{
    "status": true,
    "data": {
        "start": 593,
        "end": 740,
        "total": 148,
        "book": "ahmad",
        "hadits": [
            {
                "number": 593,
                "arab": "قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ وَإِسْحَاقَ عَنْ سُفْيَانَ قَالَ سُفْيَانُ عَنْ عَبْدِ الْكَرِيمِ الْجَزَرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ عَنْ عَمِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَجْمَعُوا اسْمِي وَكُنْيَتِي",
                "id": "(Ahmad bin Hanbal Radliyallahu'anhu) berkata; telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dan [Ishaq] dari [Sufyan] Sufyan berkata; dari [Abdul Karim Al Jazari] dari [Abdurrahman bin Abu 'Amrah] dari [pamannya] Rasulullah Shallallahu'alaihiwasallam bersabda: \"Janganlah kalian mengumpulkan antara namaku dan kuniyahku (nama yang disandarkan pada nama anaknya).\""
            },
            {
                "number": 594,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ يَعْنِي ابْنَ أَبِي بَكْرٍ وَسَالِمٍ أَبِي النَّضْرِ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَبْدِ اللَّهِ بْنِ حُذَافَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَهُ أَنْ يُنَادِيَ فِي أَيَّامِ التَّشْرِيقِ أَنَّهَا أَيَّامُ أَكْلٍ وَشُرْبٍ",
                "id": "Telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dari [Abdullah] yaitu Ibnu Abu Karim dan [Salim Abu Nadlr] dari [Sulaiman bin Yasar] dari [Abdullah bin Hudzafah] Nabi Shallallahu'alaihiwasallam menyuruhnya agar mengumumkan pada Hari Tasyriq bahwa hari-hari tersebut adalah hari untuk makan dan minum."
            },
            {
                "number": 595,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ حَدَّثَنَا سُفْيَانُ عَنْ حُمَيْدٍ الْأَعْرَجِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ رَوَاحَةَأَنَّهُ قَدِمَ مِنْ سَفَرٍ لَيْلًا فَتَعَجَّلَ إِلَى امْرَأَتِهِ فَإِذَا فِي بَيْتِهِ مِصْبَاحٌ وَإِذَا مَعَ امْرَأَتِهِ شَيْءٌ فَأَخَذَ السَّيْفَ فَقَالَتْ امْرَأَتُهُ إِلَيْكَ إِلَيْكَ عَنِّي فُلَانَةُ تُمَشِّطُنِي فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ فَنَهَى أَنْ يَطْرُقَ الرَّجُلُ أَهْلَهُ لَيْلًا",
                "id": "Telah menceritakan kepada kami [Abdurrahman] telah menceritakan kepada kami [Sufyan] dari [Humaid Al A'raj] dari [Muhammad bin Ibrahim] dari [Abu Salamah] dari [Abdullah bin Rawahah] dia baru datang dari perjalanan pada malam hari, lalu dia tergesa-gesa menuju istrinya, yang ternyata di rumahnya ada lampu. Istrinya di sana sedang bersama bayang-bayang yang mencurigakan. Kontan Abdullah bin Rawahah mengambil pedang. Maka istrinya berkata; 'Maaf, menjauhlah dariku, menjauhlah dariku, ini adalah seorang wanita yang sedang menyisiri rambutku.' Lalu dia (Abdullah bin Rawahah Radliyallahu'anhu) menemui Nabi Shallallahu'alaihiwasallam dan menceritakannya. Lalu Nabi Shallallahu'alaihiwasallammelarang seseorang mendatangi keluarganya secara mendadak pada malam hari."
            },
            {
                "number": 596,
                "arab": "حَدَّثَنَا يَعْمَرُ بْنُ بِشْرٍ حَدَّثَنَا عَبْدُ اللَّهِ قَالَ أَخْبَرَنَا يُونُسُ عَنِ الزُّهْرِيِّ قَالَ سَمِعْتُ سِنَانَ بْنَ أَبِي سِنَانٍ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُ قَائِمًا فِي قَصَصِهِإِنَّ أَخًا لَكُمْ كَانَ لَا يَقُولُ الرَّفَثَ يَعْنِي ابْنَ رَوَاحَةَ قَالَ وَفِينَا رَسُولُ اللَّهِ يَتْلُو كِتَابَهُإِذَا انْشَقَّ مَعْرُوفٌ مِنْ اللَّيْلِ سَاطِعُيَبِيتُ يُجَافِي جَنْبَهُ عَنْ فِرَاشِهِإِذَا اسْتَثْقَلَتْ بِالْكَافِرِينَ الْمَضَاجِعُأَرَانَا الْهُدَى بَعْدَ الْعَمَى فَقُلُوبُنَابِهِ مُوقِنَاتٌ أَنَّ مَا قَالَ وَاقِعُ",
                "id": "Telah menceritakan kepada kami [Ya'mar bin Bisyr] telah menceritakan kepada kami [Abdullah] berkata; telah mengabarkan kepada kami [Yunus] dari [Az Zuhri] berkata; saya telah mendengar [Sinan bin Abu Sinan] berkata; saya telah mendengar [Abu Hurairah] menceritakan kisahnya sambil berdiri 'Sudara kalian (Ibnu rawahah maksudnya) tidak mengucapkan rafats (perkataan jelek). Bahkan dia berkata 'Di antara kita ada Rasulullah Shallallahu'alaihiwasallam yang membaca kitabnya, saat malam merekah terang. Ia bermalam dengan menjauhkan punggungnya dari tempat tidurnya, saat tempat tidur terasa berat bagi orang-orang kafir. (Rasulullah Shallallahu'alaihiwasallam) memperlihatkan petunjuk kepada kita. Yang karenanya hati kita menjadi yakin, setelah nyata apa yang diucapkannya musti terjadi."
            },
            {
                "number": 597,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ أَخْبَرَنَا بَكْرُ بْنُ مُضَرَ عَنِ ابْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ سَعِيدِ بْنِ الصَّلْتِ عَنْ سُهَيْلِ ابْنِ الْبَيْضَاءِ قَالَبَيْنَمَا نَحْنُ فِي سَفَرٍ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا رَدِيفُهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا سُهَيْلُ ابْنَ الْبَيْضَاءِ وَرَفَعَ صَوْتَهُ مَرَّتَيْنِ أَوْ ثَلَاثًا كُلُّ ذَلِكَ يُجِيبُهُ سُهَيْلٌ فَسَمِعَ النَّاسُ صَوْتَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَظَنُّوا أَنَّهُ يُرِيدُهُمْ فَحُبِسَ مَنْ كَانَ بَيْنَ يَدَيْهِ وَلَحِقَهُ مَنْ كَانَ خَلْفَهُ حَتَّى إِذَا اجْتَمَعُوا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ مَنْ شَهِدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ حَرَّمَهُ اللَّهُ عَلَى النَّارِ وَأَوْجَبَ لَهُ الْجَنَّةَحَدَّثَنَا هَارُونُ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ حَيْوَةُ حَدَّثَنِي ابْنُ الْهَادِ عَنْ مُحَمَّدٍ يَعْنِي ابْنَ إِبْرَاهِيمَ عَنْ سَعِيدِ بْنِ الصَّلْتِ عَنْ سُهَيْلِ ابْنِ الْبَيْضَاءِ مِنْ بَنِي عَبْدِ الدَّارِ قَالَ بَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata; telah mengabarkan kepada kami [Bakr bin Mudlar] dari [Ibnu Al Had] dari [Muhammad bin Ibrahim] dari [Sa'id bin As Shalt] dari [Suhail bin Al Baidla] berkata; tatkala kami sedang dalam perjalanan bersama Rasulullah Shallallahu'alaihiwasallam, saya membonceng beliau. Rasulullah Shallallahu'alaihiwasallam bersabda: \"Wahai Suhail bin Al Baidla!\" beliau mengangkat suaranya dua atau tiga kali, semuanya Suhail menjawabnya. Orang-orang mendengar suara Rasulullah Shallallahu'alaihiwasallam dan mereka menyangka menginginkan mereka, lalu orang yang berada di hadapan beliau berhenti dan orang yang berada di belakang beliau mengejarnya. Setelah mereka terkumpul, Rasulullah Shallallahu'alaihiwasallam bersabda: \" Barangsiapa yang bersaksi bahwa tidak ada sesembahan yang hak selain Allah, niscaya Allah mengharamkan neraka atasnya dan wajib baginya surga.\" Telah menceritakan kepada kami [Harun] telah menceritakan kepada kami [Ibnu Wahb], [Haiwah] berkata; telah menceritakan kepadaku [Ibnu Al Had] dari [Muhammad] yaitu Ibnu Ibrahim dari [Sa'id bin As Shalt] dari [Suhail bin Al Baidla] dari Bani Abdul Dar berkata; tatkala kami bersama Rasulullah Shallallahu'alaihiwasallam dalam sebuah perjalanan, lalu menyebutkan secara makna."
            },
            {
                "number": 598,
                "arab": "حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ قَالَتَزَوَّجَ عَقِيلُ بْنُ أَبِي طَالِبٍ فَخَرَجَ عَلَيْنَا فَقُلْنَا بِالرَّفَاءِ وَالْبَنِينَ فَقَالَ مَهْ لَا تَقُولُوا ذَلِكَ فَإِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ نَهَانَا عَنْ ذَلِكَ وَقَالَ قُولُوا بَارَكَ اللَّهُ لَكَ وَبَارَكَ عَلَيْكَ وَبَارَكَ لَكَ فِيهَا",
                "id": "Telah menceritakan kepada kami [Al Hakam bin Nafi'] berkata; telah menceritakan kepada kami [Isma'il bin 'Ayyasy] dari [Salim bin Abdullah] dari [Abdullah bin Muhammad bin 'Aqil] berkata; ['Aqil bin Abu Thalib] menikah, lalu dia keluar menemui kami. Kami berkata; BIR ROFA`'I WA AL BANIN (semoga kamu mendapat berbarakah, menyatu dan banyak anak). Lalu dia berkata; jangan! Jangan kalian mengatakan hal itu. Nabi Shallallahu'alaihiwasallam telah melarang kami dengan hal itu, namun beliau bersabda: \"Katakanlah 'Semoga Allah memberi barakah kepada kalian berdua baik saat suka maupun duka, dan memberi barakah kepadamu di alam pernikahan'.\""
            },
            {
                "number": 599,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا يُونُسُ عَنْ الْحَسَنِأَنَّ عَقِيلَ بْنَ أَبِي طَالِبٍ تَزَوَّجَ امْرَأَةً مِنْ بَنِي جُشَمٍ فَدَخَلَ عَلَيْهِ الْقَوْمُ فَقَالُوا بِالرَّفَاءِ وَالْبَنِينَ فَقَالَ لَا تَقُولُوا ذَاكُمْ قَالُوا فَمَا نَقُولُ يَا أَبَا يَزِيدَ قَالَ قُولُوا بَارَكَ اللَّهُ لَكُمْ وَبَارَكَ عَلَيْكُمْ إِنَّا كَذَلِكَ كُنَّا نُؤْمَرُ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Ibrahim] telah menceritakan kepada kami [Yunus] dari [Al Hasan] ['Aqil bin Abu Thalib] menikahi seorang wanita dari Jusyam, lalu kaumnya menemuinya dan berkata; BIR ROFA'I WA AL BANIN (Semoga kamu mendapat barakah, menyatu dan mendapat banyak anak). Lalu beliau berkata 'Jangan kalian mengatakan hal itu!. Mereka berkata; bagaimana kami harus mengatakannya, Wahai Abu Yazid? Dia berkata; \"Katakanlah 'Semoga Allah memberi barakah kepada kalian baik saat suka maupun duka' demikianlah kami diperintah.\""
            },
            {
                "number": 600,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا مَعْمَرٌ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ بَحِيرٍ قَالَ أَخْبَرَنِي مَنْ سَمِعَ فَرْوَةَ بْنَ مُسَيْكٍ الْمُرَادِيَّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ أَرْضًا عِنْدَنَا يُقَالُ لَهَا أَرْضُ أَبْيَنَ هِيَ أَرْضُ رُفْقَتِنَا وَمِيرَتِنَا وَإِنَّهَا وَبِئَةٌ أَوْ قَالَ إِنَّ بِهَا وَبَاءً شَدِيدًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعْهَا عَنْكَ فَإِنَّ مِنْ الْقَرَفِ التَّلَفَ",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] berkata; telah mengabarkan kepada kami [Ma'mar] dari [Yahya bin Abdullah bin Bahir] berkata; telah mengabarkan kepadaku [seseorang] yang telah mendengar [Farwah bin Musaik Al Muradi], berkata; saya bertanya Wahai Rasulullah, tanah yang di tempat kami yang bernama 'Abyan' itu adalah tempat kesayangan kami dan harta pusaka yang kami dapatkan dari negeri lain, namun sekarang terjangkiti wabah, atau berkata di dalamnya ada wabah yang sangat dahsyat. Lalu Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tinggalkan saja, karena mendekati lokasi yang terkena penyakit sama artinya dengan kehancuran.\""
            },
            {
                "number": 601,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ رَجُلٍ مِنْ الْأَنْصَارِأَنَّهُ جَاءَ بِأَمَةٍ سَوْدَاءَ وَقَالَ يَا رَسُولَ اللَّهِ إِنَّ عَلَيَّ رَقَبَةً مُؤْمِنَةً فَإِنْ كُنْتَ تَرَى هَذِهِ مُؤْمِنَةً أَعْتَقْتُهَا فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَشْهَدِينَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ قَالَتْ نَعَمْ قَالَ أَتَشْهَدِينَ أَنِّي رَسُولُ اللَّهِ قَالَتْ نَعَمْ قَالَ أَتُؤْمِنِينَ بِالْبَعْثِ بَعْدَ الْمَوْتِ قَالَتْ نَعَمْ قَالَ أَعْتِقْهَا",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari ['ubaidhullah bin Abdullah] dari [seseorang dari Anshar], dia datang dengan membawa seorang budak perempuan yang hitam dan berkata; Wahai Rasulullah, saya memiliki seorang budak mukmin, jika menurut anda ini adalah orang yang beriman maka saya akan membebaskannya. Rasulullah Shallallahu'alaihiwasallam bertanya kepada budak tersebut, apakah kau bersaksi bahwa tidak ada tuhan selain Allah?. Dia menjawab, 'Ya.' (Rasulullah Shallallahu'alaihiwasallam) bertanya, apakah kau bersaksi bahwa saya adalah Rasulullah?. Dia menjawab 'Ya.' Beliau bertanya, apakah kau percaya dengan kebangkitan setelah mati?. Dia menjawab, 'ya.' (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Bebaskanlah dia.\""
            },
            {
                "number": 602,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا يَحْيَى أَنَّ مُحَمَّدَ بْنَ إِبْرَاهِيمَ التَّيْمِيَّ أَخْبَرَهُ أَنَّ عِيسَى بْنَ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ أَخْبَرَهُ أَنَّ عُمَيْرَ بْنَ سَلَمَةَ الضَّمْرِيَّ أَخْبَرَهُ عَنْ رَجُلٍ مِنْ بَهْزٍأَنَّهُ خَرَجَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُرِيدُ مَكَّةَ حَتَّى إِذَا كَانُوا فِي بَعْضِ وَادِي الرَّوْحَاءِ وَجَدَ النَّاسُ حِمَارَ وَحْشٍ عَقِيرًا فَذَكَرُوا لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَقِرُّوهُ حَتَّى يَأْتِيَ صَاحِبُهُ فَأَتَى الْبَهْزِيُّ وَكَانَ صَاحِبَهُ فَقَالَ يَا رَسُولَ اللَّهِ شَأْنَكُمْ بِهَذَا الْحِمَارِ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَا بَكْرٍ فَقَسَمَهُ فِي الرِّفَاقِ وَهُمْ مُحْرِمُونَ قَالَ ثُمَّ مَرَرْنَا حَتَّى إِذَا كُنَّا بِالْأُثَايَةِ إِذَا نَحْنُ بِظَبْيٍ حَاقِفٍ فِي ظِلٍّ فِيهِ سَهْمٌ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا أَنْ يَقِفَ عِنْدَهُ حَتَّى يُجِيزَ النَّاسُ عَنْهُ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata; telah mengabarkan kepada kami, [Yahya] bahwa [Muhammad bin Ibrahim At-Taimi] mengabarinya ['Isa bin Thalhah bin 'ubaidhullah] menghabarinya dari ['Umair bin Salamah Adl-Dlamri] menghabarinya, dari [seorang laki-laki dari Bahz] dia keluar bersama Rasulullah Shallallahu'alaihiwasallam menuju Makah. Sampai ketika mereka telah sampai pada sebagian bukit Rauha', orang-orang mendapatkan keledai Wahsy dalam keadaan terlepas. Mereka sampaikan kasus itu kepada Nabi Shallallahu'alaihiwasallam, lalu beliau bersabda: \"Lepaskanlah kalian sampai datang pemiliknya.\" lalu Al Bahzi datang dan dia adalah sahabatnya, lalu bertanya Wahai Rasulullah, bagaimana menurut anda keledai ini?. Rasulullah Shallallahu'alaihiwasallam menyuruh Abu Bakar lalu membaginya kepada orang-orang, sedang mereka dalam keadaan ihram. (Al Bahzi) berkata; lalu kami melewati sampai di Utsayah, kami melewati rusa yang tertidur, di bawah mulutnya ada anak panah. Nabi Shallallahu'alaihiwasallam memerintahkan seorang laki-laki mendatanginya sehingga orang-orang melewatinya."
            },
            {
                "number": 603,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِأَنَّ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ تَعَالَى عَنْهُ قَالَ مَا أَرَى الدِّيَةَ إِلَّا لِلْعَصَبَةِ لِأَنَّهُمْ يَعْقِلُونَ عَنْهُ فَهَلْ سَمِعَ أَحَدٌ مِنْكُمْ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ شَيْئًا فَقَالَ الضَّحَّاكُ بْنُ سُفْيَانَ الْكِلَابِيُّ وَكَانَ اسْتَعْمَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْأَعْرَابِ كَتَبَ إِلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أُوَرِّثَ امْرَأَةَ أَشْيَمَ الضَّبَابِيِّ مِنْ دِيَةِ زَوْجِهَا فَأَخَذَ بِذَلِكَ عُمَرُ بْنُ الْخَطَّابِ رَضِيَ اللَّهُ تَعَالَى عَنْهُ",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Sa'id bin Musayyab] 'Umar bin Al Khottob RA berkata; Saya tidak melihat diat kecuali bagi ashobah (kerabat dari pihak ayah) karena mereka mendapatkan sisa harta secara syar'i. Apakah ada seseorang yang telah mendengar dari Rasulullah Shallallahu'alaihiwasallam dalam masalah itu?. Lalu [Al Dlahak bin Sufyan Al Kilabi] berkata; dia adalah salah satu pegawai Rasulullah Shallallahu'alaihiwasallam untuk memimpin orang-orang Arab pedesaan. Rasulullah Shallallahu'alaihiwasallam menulis surat kepadaku agar aku memberi warisan istri Asyyam Adl-Dlababi dari diyat suaminya. Lalu 'Umar bin Al Khattab mengambil hal itu sebagai ketetapan."
            },
            {
                "number": 604,
                "arab": "حَدَّثَنَا سُفْيَانُ قَالَ سَمِعْتُهُ مِنَ الزُّهْرِيِّ عَنْ سَعِيدٍأَنَّ عُمَرَ قَالَ الدِّيَةُ لِلْعَاقِلَةِ وَلَا تَرِثُ الْمَرْأَةُ مِنْ دِيَةِ زَوْجِهَا حَتَّى أَخْبَرَهُ الضَّحَّاكُ بْنُ سُفْيَانَ الْكِلَابِيُّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَتَبَ إِلَيَّ أَنْ أُوَرِّثَ امْرَأَةَ أَشْيَمَ الضَّبَابِيِّ مِنْ دِيَةِ زَوْجِهَا فَرَجَعَ عُمَرُ عَنْ قَوْلِهِ",
                "id": "Telah menceritakan kepada kami [Sufyan] berkata; saya telah mendengarnya dari [Az Zuhri] dari [Sa'id] 'Umar berkata; diyat itu untuk wanita yang berakal, dan seorang istri tidak mewarisi diyat suaminya sampai [Al Dlahak bin Sufyan Al Kalbi] mengabarinya bahwa Rasulullah Shallallahu'alaihiwasallam menulis surat kepadaku agar aku memberi warisan istri Asyyam Adl-Dlababi dari diyat suaminya, lalu 'Umar menarik kembali perkataannya."
            },
            {
                "number": 605,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْمَلِكِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَلِيِّ بْنِ جُدْعَانَ عَنِ الْحَسَنِ عَنِ الضَّحَّاكِ بْنِ سُفْيَانَ الْكِلَابِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهُ يَا ضَحَّاكُ مَا طَعَامُكَ قَالَ يَا رَسُولَ اللَّهِ اللَّحْمُ وَاللَّبَنُ قَالَ ثُمَّ يَصِيرُ إِلَى مَاذَا قَالَ إِلَى مَا قَدْ عَلِمْتَ قَالَ فَإِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى ضَرَبَ مَا يَخْرُجُ مِنْ ابْنِ آدَمَ مَثَلًا لِلدُّنْيَا",
                "id": "Telah menceritakan kepada kami hamad bin [Abdul Malik] telah menceritakan kepada kami [Hammad bin Zaid] dari ['Ali bin Jud'an] dari [Al Hasan] dari [Adl-Dlahak bin Sufyan Al Kilabi] Rasulullah Shallallahu'alaihiwasallam bersabda kepadanya, \"Wahai Dlahak, apakah makananmu?.\" Dia menjawab, Wahai Rasulullah, daging dan susu!. Beliau bertanya, lantas yang kau makan itu menjadi apa?. Dia menjawab 'Sebagaimana yang anda ketahui.' Beliau bersabda: \" Allah Tabaroka Wa Ta'ala membuat contoh apa yang telah keluar dari anak Adam sebagai pemisalan di dunia.\""
            },
            {
                "number": 606,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ سَالِمٍ عَنِ ابْنِ عُمَرَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اقْتُلُوا الْحَيَّاتِ وَاقْتُلُوا ذَا الطُّفْيَتَيْنِ وَالْأَبْتَرَ فَإِنَّهُمَا يُسْقِطَانِ الْحَبَلَ وَيَطْمِسَانِ الْبَصَرَ قَالَ ابْنُ عُمَرَ فَرَآنِي أَبُو لُبَابَةَ أَوْ زَيْدُ بْنُ الْخَطَّابِ وَأَنَا أُطَارِدُ حَيَّةً لِأَقْتُلَهَا فَنَهَانِي فَقُلْتُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَمَرَ بِقَتْلِهِنَّ فَقَالَ إِنَّهُ قَدْ نَهَى بَعْدَ ذَلِكَ عَنْ قَتْلِ ذَوَاتِ الْبُيُوتِقَالَ الزُّهْرِيُّ وَهِيَ الْعَوَامِرُ",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [Ibnu 'Umar] berkata; saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Bunuhlah ular-ular dan bunuhlah dzitthufyatain (ular yang pada pungungnya ada dua garis putih) dan Al abtar (ular yang ekornya pendek), karena keduanya akan menggugurkan kandungan dan mengaburkan penglihatan.\" Ibnu 'Umar berkata; [Abu Lubabah] atau [Zaid bin Al Khattab] melihatku ketika saya sedang mengejar ular untuk saya bunuh, lalu dia melarangku. Lalu saya berkata 'Rasulullah Shallallahu'alaihiwasallam telah menyuruh untuk membunuhnya.' (Abu Lubabah bin Abdul Mundzir Radliyallahu'anhu) berkata; 'Rasulullah Shallallahu'alaihiwasallam sungguh telah menyuruh membunuhnya.' Maka dia menjawab 'Setelah itu beliau melarang membunuh ular yang berada di rumah.' [Az Zuhri] berkata; itu adalah ular yang hanya tinggal di rumah dan biasanya dari jin."
            },
            {
                "number": 607,
                "arab": "حَدَّثَنَا يَزِيدُ قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْحَاقَ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يَقُولُ اقْتُلُوا الْحَيَّةَ وَاقْتُلُوا ذَا الطُّفْيَتَيْنِ وَالْأَبْتَرَ فَإِنَّهُمَا يَلْتَمِعَانِ الْبَصَرَ وَيَسْتَسْقِطَانِ الْحَبَلَ قَالَ فَكُنْتُ لَا أَرَى حَيَّةً إِلَّا قَتَلْتُهَا قَالَ لِي أَبُو لُبَابَةَ بْنُ عَبْدِ الْمُنْذِرِ أَلَا تَفْتَحُ بَيْنِي وَبَيْنَكَ خَوْخَةٌ فَقُلْتُ بَلَى قَالَ فَقُمْتُ أَنَا وَهُوَ فَفَتَحْنَاهَا فَخَرَجَتْ حَيَّةٌ فَعَدَوْتُ عَلَيْهَا لِأَقْتُلَهَا فَقَالَ لِي مَهْلًا فَقُلْتُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَمَرَ بِقَتْلِهِنَّ قَالَ إِنَّهُ قَدْ نَهَى عَنْ قَتْلِ ذَوَاتِ الْبُيُوتِ",
                "id": "Telah menceritakan kepada kami [Yazid] berkata; telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Nafi'] dari [Ibnu 'Umar] berkata; saya telah mendengar Rasulullah Shallallahu'alaihiwasallam di atas mimbar bersabda: \"Bunuhlah ular dan bunuhlah dzitthufyatain (ular yang pada pungungnya ada dua garis putih) dan Al abtar (ular yang ekornya pendek), karena keduanya bisa mengaburkan penglihatan dan menggugurkan kandungan.\" (Ibnu 'Umar Radliyallahu'anhuma) berkata; maka saya tidak melihat satu pun ular kecuali saya bunuh. [Abu Lubabah bin Abdul Mundzir] berkata kepadaku, maukah kau bukakan pintu kecil?. Saya menjawab, Ya. (Ibnu 'Umar Radliyallahu'anhuma) berkata; saya dan dia membukanya lalu keluarlah seekor ular, lalu saya menuju ke tempatnya untuk membunuhnya, lalu dia berkata; 'Berhentilah.' Lalu saya berkata; Rasulullah Shallallahu'alaihiwasallam telah menyuruh untuk membunuhnya. (Abu Lubabah bin Abdul Mundzir Radliyallahu'anhuma) berkata; (Rasulullah Shallallahu'alaihiwasallam) melarang membunuh ular yang menghuni rumah-rumah."
            },
            {
                "number": 608,
                "arab": "حَدَّثَنَا رَوْحٌ قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ أَنَّ الْحُسَيْنَ بْنَ السَّائِبِ بْنِ أَبِي لُبَابَةَ أَخْبَرَأَنَّ أَبَا لُبَابَةَ بْنَ عَبْدِ الْمُنْذِرِ لَمَّا تَابَ اللَّهُ عَلَيْهِ قَالَ يَا رَسُولَ اللَّهِ إِنَّ مِنْ تَوْبَتِي أَنْ أَهْجُرَ دَارَ قَوْمِي وَأُسَاكِنَكَ وَإِنِّي أَنْخَلِعُ مِنْ مَالِي صَدَقَةً لِلَّهِ وَلِرَسُولِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُجْزِئُ عَنْكَ الثُّلُثُ",
                "id": "Telah menceritakan kepada kami [Rauh] berkata; telah menceritakan kepada kami [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Ibnu Syihab] [Al Husain bin As Sa'ib bin Abu Lubabah] mengabarkan [Abu Lubabah bin Abdul Mundzir] ketika Allah menerima taubatnya. Dia berkata; \"Wahai Rasulullah, sebagai konsekuensi taubatku, saya akan menghindari rumah kaumku dan saya akan tinggal bersama anda, saya akan melepaskan hartaku sebagai sedekah kepada Allah dan rasul-Nya.\" Rasulullah Shallallahu'alaihiwasallam bersabda: \"Cukuplah bagimu sepertiganya.\""
            },
            {
                "number": 609,
                "arab": "حَدَّثَنَا مُحَمَّدٌ حَدَّثَنَا شُعْبَةُ قَالَ عَنْ عَبْدِ رَبٍّ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَأَنَّهُ كَانَ يَأْمُرُ بِقَتْلِ الْحَيَّاتِ كُلِّهِنَّ فَاسْتَأْذَنَهُ أَبُو لُبَابَةَ أَنْ يَدْخُلَ مِنْ خَوْخَةٍ لَهُمْ إِلَى الْمَسْجِدِ فَرَآهُمْ يَقْتُلُونَ حَيَّةً فَقَالَ لَهُمْ أَبُو لُبَابَةَ أَمَا بَلَغَكُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ قَتْلِ أُولَاتِ الْبُيُوتِ وَالدُّورِ وَأَمَرَ بِقَتْلِ ذِي الطُّفْيَتَيْنِ وَالْأَبْتَرِ",
                "id": "Telah menceritakan kepada kami [Muhammad] telah menceritakan kepada kami [Syu'bah] berkata; dari ['Abdu Rab] dari [Nafi'] dari [Abdullah bin 'Umar] dia menyuruh untuk membunuh ular semuanya. Lalu [Abu Lubabah] meminta ijin untuk masuk lewat pintu kecil disela-sela rumah mereka yang tembus ke masjid, lalu dia melihat mereka sedang membunuh seekor ular. Abu Lubabah serta merta berkata kepada mereka 'Belumkah sampai kepada kalian bahwa Rasulullah Shallallahu'alaihiwasallam melarang membunuh ular yang menghuni rumah dan menyuruh membunuh dzitthufyatain (ular yang pada pungungnya ada dua garis putihnya) dan Al abtar (ular yang ekornya pendek)?."
            },
            {
                "number": 610,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَأَنَّهُ فَتَحَ بَابًا فَخَرَجَتْ مِنْهُ حَيَّةٌ فَأَمَرَ بِقَتْلِهَا فَقَالَ لَهُ أَبُو لُبَابَةَ لَا تَفْعَلْ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ نَهَى عَنْ قَتْلِ الْحَيَّاتِ الَّتِي تَكُونُ فِي الْبُيُوتِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid] berkata; telah menceritakan kepada kami ['ubaidhullah] dari [Nafi'] dari [Ibnu 'Umar] dia membuka pintu lalu keluar seekor ular, lalu dia menyuruh untuk membunuhnya. [Abu Lubabah] berkata kepadanya 'Janganlah kau melakukannya, Rasulullah Shallallahu'alaihiwasallam sungguh telah melarang membunuh ular yang menghuni rumah-rumah.'"
            },
            {
                "number": 611,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ أَخْبَرَنَا عَلِيُّ بْنُ زَيْدٍ عَنِ الْحَسَنِ أَنَّ الضَّحَّاكَ بْنَ قَيْسٍكَتَبَ إِلَى قَيْسِ بْنِ الْهَيْثَمِ حِينَ مَاتَ يَزِيدُ بْنُ مُعَاوِيَةَ سَلَامٌ عَلَيْكَ أَمَّا بَعْدُ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ بَيْنَ يَدَيْ السَّاعَةِ فِتَنًا كَقِطَعِ اللَّيْلِ الْمُظْلِمِ فِتَنًا كَقِطَعِ الدُّخَانِ يَمُوتُ فِيهَا قَلْبُ الرَّجُلِ كَمَا يَمُوتُ بَدَنُهُ يُصْبِحُ الرَّجُلُ مُؤْمِنًا وَيُمْسِي كَافِرًا وَيُمْسِي مُؤْمِنًا وَيُصْبِحُ كَافِرًا يَبِيعُ أَقْوَامٌ خَلَاقَهُمْ وَدِينَهُمْ بِعَرَضٍ مِنْ الدُّنْيَا وَإِنَّ يَزِيدَ بْنَ مُعَاوِيَةَ قَدْ مَاتَ وَأَنْتُمْ إِخْوَانُنَا وَأَشِقَّاؤُنَا فَلَا تَسْبِقُونَا حَتَّى نَخْتَارَ لِأَنْفُسِنَا",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Hammad bin Salamah] berkata; telah mengabarkan kepada kami ['Ali bin Zaid] dari [Al Hasan] [Dlahak bin Qais] menulis kepada Qais bin Al Hutsaim ketika meninggalnya Yazid bin Mu'awiyah, \"Semoga keselamatan atas anda, saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda Sebelum terjadinya hari kiamat akan terjadi beberapa fitnah seperti gelapnya malam, fitnah seperti asap. Ketika itu hati seseorang menjadi mati seperti halnya badan jika mati. Pagi hari seseorang masih dalam keadaan mukmin namun sore harinya sudah kafir, atau pada sorenya dia masih mukmin namun pagi harinya sudah kafir. Manusia menjual akhlak dan agamanya dengan sedikit kenikmatan dunia'. Yazid bin Mu'awiyah telah meninggal dan kamu adalah saudara kami dan saudara kandung kami, janganlah kamu mendahului kami sampai kami memilih untuk diri kami sendiri.\""
            },
            {
                "number": 612,
                "arab": "حَدَّثَنَا يَزِيدُ قَالَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ أَنَّ مُحَمَّدَ بْنَ يَحْيَى بْنِ حَبَّانَ أَخْبَرَهُ أَنَّ عَمَّهُ أَبَا صِرْمَةَ كَانَ يُحَدِّثُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ غِنَايَ وَغِنَى مَوْلَايَ",
                "id": "Telah menceritakan kepada kami [Yazid] berkata; telah mengabarkan kepada kami [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] menghabarinya pamannya, [Abu Shirmah] menceritakan Rasulullah Shallallahu'alaihiwasallam bersabda: \"Ya Allah, saya meminta kepada-Mu kekayaan jiwaku dan kecukupan para waliku.\""
            },
            {
                "number": 613,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا لَيْثٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ لُؤْلُؤَةَ عَنْ أَبِي صِرْمَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ ضَارَّ أَضَرَّ اللَّهُ بِهِ وَمَنْ شَاقَّ شَقَّ اللَّهُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Laits] dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari [lu'lu'ah] dari [Abu Shirmah] dari Rasulullah Shallallahu'alaihiwasallam beliau bersabda: \"Barangsiapa mendatangkan mara-bahaya, Allah mendatangkan mara bahaya baginya, dan barangsiapa menimpakan kesulitan kepada manusia, Allah mendatangkan kesulitan baginya.\""
            },
            {
                "number": 614,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا لَيْثٌ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ لُؤْلُؤَةَ عَنْ أَبِي صِرْمَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ اللَّهُمَّ إِنِّي أَسْأَلُكَ غِنَايَ وَغِنَى مَوْلَايَ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata; telah menceritakan kepada kami [Laits] dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari [lu'lu'ah] dari [Abu Shirmah] dari Rasulullah Shallallahu'alaihiwasallam beliau bersabda: \"Ya Allah, saya meminta kepada-Mu kekayaan (kekayaan jiwa bukan harta) dan kecukupan para waliku.\""
            },
            {
                "number": 615,
                "arab": "حَدَّثَنَا يَزِيدُ قَالَ أَخْبَرَنَا ابْنُ أَبِي ذِئْبٍ عَنْ سَعِيدِ بْنِ خَالِدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عُثْمَانَ قَالَذَكَرَ طَبِيبٌ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَوَاءً وَذَكَرَ الضُّفْدَعَ يُجْعَلُ فِيهِ فَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَتْلِ الضُّفْدَعِ",
                "id": "Telah menceritakan kepada kami [Yazid] berkata; telah mengabarkan kepada kami [Ibnu Abu Dzi'b] dari [Sa'id bin Khalid] dari [Sa'id bin Musayyab] dari [Abdurrahman bin 'Utsman] berkata; ada seorang tabib di sisi Rasulullah Shallallahu'alaihiwasallam menyebutkan suatu obat, yaitu berupa katak. Lalu Rasulullah Shallallahu'alaihiwasallam melarang membunuh katak."
            },
            {
                "number": 616,
                "arab": "حَدَّثَنَا يَزِيدُ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ مَعْمَرِ بْنِ عَبْدِ اللَّهِ بْنِ نَضْلَةَ الْقُرَشِيِّ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَحْتَكِرُ إِلَّا الْأَخَاطُ",
                "id": "Telah menceritakan kepada kami [Yazid] berkata; telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Muhammad bin Ibrahim At-Taimi] dari [Sa'id bin Musayyab] dari [Ma'mar bin Abdullah bin Nadllah Al Qurasyi] berkata; saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidak boleh ditimbun kecuali minyak.\""
            },
            {
                "number": 617,
                "arab": "حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ مَعْمَرِ بْنِ عَبْدِ اللَّهِ الْعَدَوِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحْتَكِرُ إِلَّا الْأَخَاطُ",
                "id": "Telah menceritakan kepada kami ['Abdah bin Sulaiman] berkata; telah menceritakan kepada kami [Muhammad bin Ishaq] dari [Muhammad bin Ibrahim] dari [Sa'id bin Musayyab] dari [Ma'mar bin Abdullah Al 'Adawi] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidak boleh ditimbun kecuali minyak.\""
            },
            {
                "number": 618,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ مَعْمَرٍ رَجُلٍ مِنْ قُرَيْشٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحْتَكِرُ إِلَّا الْأَخَاطُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin Ishaq] dari [Muhammad bin Ibrahim At-Taimi] dari [Sa'id bin Musayyab] dari [Ma'mar] seorang laki-laki dari Quraish, berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidak boleh ditimbun kecuali minyak.\""
            },
            {
                "number": 619,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْأُمَوِيُّ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ مَعْمَرٍ الْعَدَوِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَحْتَكِرُ إِلَّا الْأَخَاطُوَكَانَ سَعِيدُ بْنُ الْمُسَيَّبِ يَحْتَكِرُ الزَّيْتَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id Al Umawi] berkata; telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sa'id bin Musayyab] dari [Ma'mar Al 'Adawi] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidak boleh ditimbun kecuali minyak\". Dan Sa'id bin Musayyab menimbun minyak."
            },
            {
                "number": 620,
                "arab": "حَدَّثَنَا يَزِيدُ قَالَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ عَبَّادِ بْنِ تَمِيمٍ أَخْبَرَهُ عَنْ عُوَيْمِرِ بْنِ أَشْقَرَأَنَّهُ ذَبَحَ قَبْلَ أَنْ يَغْدُوَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرَ ذَلِكَ لَهُ فَأَمَرَهُ أَنْ يُعِيدَ أُضْحِيَّتَهُ",
                "id": "Telah menceritakan kepada kami [Yazid] berkata; telah mengabarkan kepada kami [Yahya bin Sa'id] dari ['Abbad bin Tamim] mengabarinya dari ['Uwaimir bin Asyqor] dia telah menyembelih sebelum Rasulullah Shallallahu'alaihiwasallam berangkat sholat. Tatkala Rasulullah Shallallahu'alaihiwasallam telah menunaikan sholat hari raya, hal itu dilaporkan kepada beliau, dan beliau menyuruh agar mengulangi penyembelihannya."
            },
            {
                "number": 621,
                "arab": "حَدَّثَنَا يَزِيدُ قَالَ أَخْبَرَنَا الْمُسْتَلِمُ بْنُ سَعِيدٍ حَدَّثَنَا خُبَيْبُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُرِيدُ غَزْوًا أَنَا وَرَجُلٌ مِنْ قَوْمِي وَلَمْ نُسْلِمْ فَقُلْنَا إِنَّا نَسْتَحْيِي أَنْ يَشْهَدَ قَوْمُنَا مَشْهَدًا لَا نَشْهَدُهُ مَعَهُمْ قَالَ أَوَ أَسْلَمْتُمَا قُلْنَا لَا قَالَ فَإِنَّا لَا نَسْتَعِينُ بِالْمُشْرِكِينَ عَلَى الْمُشْرِكِينَ قَالَ فَأَسْلَمْنَا وَشَهِدْنَا مَعَهُ فَقَتَلْتُ رَجُلًا وَضَرَبَنِي ضَرْبَةً وَتَزَوَّجْتُ بِابْنَتِهِ بَعْدَ ذَلِكَ فَكَانَتْ تَقُولُ لَا عَدِمْتَ رَجُلًا وَشَّحَكَ هَذَا الْوِشَاحَ فَأَقُولُ لَا عَدِمْتِ رَجُلًا عَجَّلَ أَبَاكِ النَّارَ",
                "id": "Telah menceritakan kepada kami [Yazid] berkata; telah menceritakan kepada kami [Al Mustalim bin Sa'id] telah menceritakan kepada kami [Khubaib bin Abdurrahman] dari [Bapaknya] dari [kakeknya] berkata; saya menemui Rasulullah Shallallahu'alaihiwasallam ketika beliau hendak berperang, saya bersama dengan salah seorang dari kaumku. Ketika itu kami belum masuk Islam. Kami berkata; kami malu kalau kaum kami mengikuti sebuah peristiwa sebaliknya kami tidak mengikutinya bersama mereka. Beliau bertanya, apakah kalian telah masuk Islam?. kami menjawab, belum. Beliau bersabda: \"Kami tidak akan meminta tolong kepada orang musyrik untuk memerangi orang musyrik\". Kami pun masuk Islam dan kami ikut bersama beliau. Lalu saya membunuh seorang laki-laki dan dia memukulku satu pukulan, lalu saya menikahi anak perempuanya setelah itu. Wanita itu menolak seraya mengatakan 'Tidak, kamu telah menghilangkan (membunuh) seseorang yang memberimu pedang.' Saya menjawab 'Tidak, engkau telah menghilangkan (menolak kesempatan diperistri) seseorang yang mempercepat ayahmu ke neraka."
            },
            {
                "number": 622,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ أُسَامَةَ بْنِ زَيْدٍ عَنِ الزُّهْرِيِّ عَنِ ابْنِ كَعْبِ بْنِ مَالِكٍأَنَّ جَارِيَةً لِكَعْبٍ كَانَتْ تَرْعَى غَنَمًا لَهُ بِسَلْعٍ فَعَدَا الذِّئْبُ عَلَى شَاةٍ مِنْ شَائِهَا فَأَدْرَكَتْهَا الرَّاعِيَةُ فَذَكَّتْهَا بِمَرْوَةٍ فَسَأَلَ كَعْبُ بْنُ مَالِكٍ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهُ بِأَكْلِهَا",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Usamah bin Zaid] dari [Az Zuhri] dari [Ibnu Ka'ab bin Malik], pembantu perempuan milik Ka'b mengembala kambing miliknya. Ada seekor serigala menyerang salah satu kambingnya, wanita itu mendapatkan kambingnya (yang belum tewas) dan menyembelihnya dengan memakai batu tajam. Lalu [Ka'ab bin Malik] bertanya kepada Nabi Shallallahu'alaihiwasallam, dan beliau menyuruh untuk memakannya."
            },
            {
                "number": 623,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا زَمْعَةُ عَنِ الزُّهْرِيِّ عَنِ ابْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ وَهُوَ مُلَازِمٌ رَجُلًا فِي أُوقِيَّتَيْنِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلرَّجُلِ هَكَذَا أَيْ ضَعْ عَنْهُ الشَّطْرَ قَالَ الرَّجُلُ نَعَمْ يَا رَسُولَ اللَّهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلرَّجُلِ أَدِّ إِلَيْهِ مَا بَقِيَ مِنْ حَقِّهِ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Zam'ah] dari [Az Zuhri] dari [Ibnu Ka'ab bin Malik] dari [Bapaknya], Nabi Shallallahu'alaihiwasallam pernah melewatinya ketika dia sedang menagih hutang seorang laki-laki sebesar dua uqiyah (empat puluh dirham perak). Nabi Shallallahu'alaihiwasallam bersabda kepada laki-laki itu 'Lakukanlah begini' maksudnya lunasilah separoh hutangnya. Laki-laki itu berkata; ya Wahai Rasulullah. Lalu Nabi Shallallahu'alaihiwasallam bersabda kepada laki-laki itu, 'Besok penuhilah separoh haknya lagi.'"
            },
            {
                "number": 624,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا حَجَّاجٌ عَنْ نَافِعٍ عَنِ ابْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِأَنَّ جَارِيَةً لَهُمْ سَوْدَاءَ ذَكَّتْ شَاةً لَهُمْ بِمَرْوَةٍ فَسَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَأَمَرَهُ بِأَكْلِهَا",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Hajjaj] dari [Nafi'] dari [Ibnu Ka'ab bin Malik] dari [Bapaknya] budak wanitanya yang berwarna hitam menyembelih seekor kambing mereka dengan batu tajam. Dia bertanya kepada Nabi Shallallahu'alaihiwasallam tentang hal itu, dan beliau menyuruh untuk memakannya."
            },
            {
                "number": 625,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ سَعْدٍ عَنْ عَبْدِ اللَّهِ أَوْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ قَالَ عَبْدُ الرَّحْمَنِ هُوَ شَكَّ يَعْنِي سُفْيَانَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْمُؤْمِنِ كَمَثَلِ الْخَامَةِ مِنْ الزَّرْعِ تُقِيمُهَا الرِّيَاحُ تَعْدِلُهَا مَرَّةً وَتَصْرَعُهَا أُخْرَى حَتَّى يَأْتِيَهُ أَجَلُهُ وَمَثَلُ الْكَافِرِ مَثَلُ الْأَرْزَةِ الْمُجْذِيَةِ عَلَى أَصْلِهَا لَا يُقِلُّهَا شَيْءٌ حَتَّى يَكُونَ انْجِعَافُهَا يَخْتَلِعُهَا أَوْ انْجِعَافُهَا مَرَّةً وَاحِدَةً شَكَّ عَبْدُ الرَّحْمَنِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dari [Sa'd] dari [Abdullah] atau [Abdurrahman bin Ka'ab bin Malik] Abdurrahman berkata; Sufyan ragu dari [Bapaknya] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Permisalan seorang mukmin seperti dahan yang masih basah dalam pohon, terkadang angin menjadikannya berdiri, lurus dan terkadang bengkok sampai tiba ajalnya. Sebaliknya permisalan orang kafir seperti tanaman padi yang senantiasa berdiri tegak pada akarnya, tidak ada yang bisa menggoyahkannya sesuatupun, hingga sekali ia jatuh, ia langsung roboh. Atau roboh secara langsung --Abdurrahman ragu kepastian redaksinya--."
            },
            {
                "number": 626,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍأَنَّ كَعْبَ بْنَ مَالِكٍ لَمَّا تَابَ اللَّهُ عَلَيْهِ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ اللَّهَ لَمْ يُنْجِنِي إِلَّا بِالصِّدْقِ وَإِنَّ مِنْ تَوْبَتِي إِلَى اللَّهِ أَنْ لَا أَكْذِبَ أَبَدًا وَإِنِّي أَنْخَلِعُ مِنْ مَالِي صَدَقَةً لِلَّهِ تَعَالَى وَرَسُولِهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمْسِكْ عَلَيْكَ بَعْضَ مَالِكَ فَإِنَّهُ خَيْرٌ لَكَ قَالَ فَإِنِّي أُمْسِكُ سَهْمِي مِنْ خَيْبَرَ",
                "id": "Telah menceritakan kepada kami [Rauh] telah menceritakan kepada kami [Ibnu Juraij] berkata; telah mengabarkan kepadaku [Ibnu Syihab] dari [Abdurrahman bin Abdullah bin Ka'ab bin Malik], [Ka'ab bin Malik] ketika Allah menerima taubatnya, dia menemui Rasulullah Shallallahu'alaihiwasallam lalu berkata; Allah tidak menyelamatkanku kecuali dengan kejujuran, dan termasuk dari taubatku kepada Allah, saya tidak akan berdusta selamanya, saya akan melepaskan hartaku sebagai sedekah kepada Allah Ta'ala dan Rasulullah-Nya. Lalu Rasulullah Shallallahu'alaihiwasallam bersabda kepadanya: tahanlah sebagian hartamu, itu lebih baik bagimu. (Ka'ab bin Malik Radliyallahu'anhu) berkata; lalu saya menahan sahamku dari Khaibar."
            },
            {
                "number": 627,
                "arab": "حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا لَيْثٌ قَالَ حَدَّثَنِي عُقَيْلٌ عَنِ ابْنِ شِهَابٍ عَنِ ابْنِ كَعْبِ بْنِ مَالِكٍ أَحَدُ الثَّلَاثَةِ الَّذِينَ تِيبَ عَلَيْهِمْ أَنَّ كَعْبَ بْنَ مَالِكٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَدِمَ مِنْ سَفَرٍ بَدَأَ بِالْمَسْجِدِ فَسَبَّحَ فِيهِ رَكْعَتَيْنِ ثُمَّ سَلَّمَ فَجَلَسَ فِي مُصَلَّاهُ فَيَأْتِيهِ النَّاسُ فَيُسَلِّمُونَ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Hajjaj] telah menceritakan kepada kami [Laits] berkata; telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab] dari [Ibnu Ka'ab bin Malik] salah seorang yang diterima taubatnya. [Ka'ab bin Malik] berkata; Rasulullah Shallallahu'alaihiwasallam jika baru datang dari suatu perjalanan, beliau terlebih dahulu mendatangi masjid, sholat dua rekaat, mengucapkan salam dan duduk di tempat sholatnya, lalu datanglah orang-orang dan mengucapkan salam kepada beliau."
            },
            {
                "number": 628,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدِمَ مِنْ غَزْوَةِ تَبُوكَ ضُحًى فَصَلَّى فِي الْمَسْجِدِ رَكْعَتَيْنِ وَكَانَ إِذَا جَاءَ مِنْ سَفَرٍ فَعَلَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] berkata; telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abdurrahman bin Ka'ab bin Malik] dari [Bapaknya] Nabi Shallallahu'alaihiwasallam datang dari Perang Tabuk pada waktu dhuha lalu beliau sholat di masjid dua rekaat, dan beliau jika datang dari perjalanan melakukan seperti itu (sholat dua rakaat di masjid sebelum ke rumah)."
            },
            {
                "number": 629,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ وَابْنُ بَكْرٍ قَالَا أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ حَدَّثَنِي ابْنُ شِهَابٍ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ حَدَّثَهُ عَنْ أَبِيهِ عَبْدِ اللَّهِ بْنِ كَعْبٍ وَعَنْ عَمِّهِ عُبَيْدِ اللَّهِ بْنِ كَعْبٍ عَنْ كَعْبِ بْنِ مَالِكٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَقْدَمُ مِنْ سَفَرٍ إِلَّا نَهَارًا فِي الضُّحَى فَإِذَا قَدِمَ بَدَأَ بِالْمَسْجِدِ فَصَلَّى فِيهِ رَكْعَتَيْنِ ثُمَّ جَلَسَ فِيهِ وَقَالَ ابْنُ بَكْرٍ فِي حَدِيثِهِ عَنْ أَبِيهِ عَبْدِ اللَّهِ بْنِ كَعْبِ بْنِ مَالِكٍ عَنْ عَمِّهِ",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] dan [Ibnu Bakr] berkata; telah mengabarkan kepada kami [Ibnu Juraij] berkata; telah menceritakan kepadaku [Ibnu Syihab] [Abdurrahman bin Abdullah bin Ka'ab bin Malik] menceritakannya dari [Bapaknya, Abdullah bin Ka'ab bin Malik] dan dari pamannya ['ubaidhullah bin Ka'ab] dari [Ka'ab bin Malik] berkata; Nabi Shallallahu'alaihiwasallam tidak datang dari perjalanan kecuali pada siang hari, pada waktu dhuha. Jika beliau datang maka menuju masjid lalu sholat dua rekaat dan setelahnya duduk. Ibnu Bakr berkata dalam hadisnya dari Bapaknya, Abdullah bin Ka'ab bin Malik dari pamannya."
            },
            {
                "number": 630,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ كَعْبِ بْنِ مَالِكٍ قَالَقَالَتْ أُمُّ مُبَشِّرٍ لِكَعْبِ بْنِ مَالِكٍ وَهُوَ شَاكٍ اقْرَأْ عَلَى ابْنِي السَّلَامَ تَعْنِي مُبَشِّرًا فَقَالَ يَغْفِرُ اللَّهُ لَكِ يَا أُمَّ مُبَشِّرٍ أَوَلَمْ تَسْمَعِي مَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا نَسَمَةُ الْمُسْلِمِ طَيْرٌ تَعْلُقُ فِي شَجَرِ الْجَنَّةِ حَتَّى يُرْجِعَهَا اللَّهُ عَزَّ وَجَلَّ إِلَى جَسَدِهِ يَوْمَ الْقِيَامَةِ قَالَتْ صَدَقْتَ فَأَسْتَغْفِرُ اللَّهَ",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] berkata; telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Abdurrahman bin Ka'ab bin Malik] berkata; [Umu Mubasyir] berkata kepada [Ka'ab bin Malik] sedang dia dalam keadaan sakit, bacakan kepada anakku salam yaitu Mubasyir. Lalu (Ka'ab bin Malik Radliyallhu'anhu) berkata; semoga Allah mengampunimu Wahai Umu Mubasyir, tidakkah kau mendengar apa yang telah disabdakan Rasulullah Shallallahu'alaihiwasallam: \"Roh seorang muslim itu akan terbang lalu bertengger di pohon surga sampai Allah Azzawajalla mengembalikan ke jasadnya pada Hari Kiamat. Dia berkata; kamu benar, saya memohon ampun kepada Allah."
            },
            {
                "number": 631,
                "arab": "حَدَّثَنَا سَعْدُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنِ ابْنِ شِهَابٍ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ كَعْبٍ أَنَّهُ بَلَغَهُ أَنَّ كَعْبَ بْنَ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَسَمَةُ الْمُؤْمِنِ إِذَا مَاتَ طَائِرٌ يَعْلُقُ بِشَجَرِ الْجَنَّةِ حَتَّى يُرْجِعَهُ اللَّهُ تَبَارَكَ وَتَعَالَى إِلَى جَسَدِهِ يَوْمَ يَبْعَثُهُ اللَّهُ",
                "id": "Telah menceritakan kepada kami [Sa'd bin Ibrahim] telah menceritakan kepada kami [bapakku] dari [Shalih] dari [Ibnu Syihab] berkata; telah menceritakan kepadaku [Abdurrahman bin Abdullah bin Ka'ab bin Malik] sampai berita kepadanya (dari [seseorang]), [Ka'ab bin Malik] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Ruh seorang mukmin jika meninggal, akan terbang dan bergantung di pohon surga sampai Allah Tabaroka Wa Ta'ala mengembalikan kepada jasadnya pada Hari Allah membangkitkannya.\""
            },
            {
                "number": 632,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَحْيَى بْنِ سَعِيدٍ قَالَ سَمِعْتُ بُشَيْرَ بْنَ يَسَارٍ قَالَ سَمِعْتُ سُوَيْدَ بْنَ النُّعْمَانِ رَجُلًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَصْحَابِ الشَّجَرَةِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَلَمْ يَكُنْ عِنْدَهُمْ طَعَامٌ قَالَ فَأَتَوْا بِسَوِيقٍ فَلَاكُوا مِنْهُ وَشَرِبُوا مِنْهُ ثُمَّ أَتَوْا بِمَاءٍ فَمَضْمَضُوا ثُمَّ قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Yahya bin Sa'id] berkata; saya mendengar [Busyair bin Yasar] berkata; saya mendengar [Suwaid bin An-Nu'man] seseorang yang termasuk dari sahabat Rasulullah Shallallahu'alaihiwasallam, sahabat yang ikut dalam peristiwa Bai'at dibawah pohon' berkata; Rasulullah Shallallahu'alaihiwasallam berada dalam sebuah perjalanan, namun mereka tidak memiliki makanan. Selanjutnya mereka membawa sawiq (makanan yang terbuat dari tepung gandum), mereka kunyah dan minum darinya, lalu mereka membawa air yang mereka jadikan untuk berkumur-kumur, lalu Rasulullah Shallallahu'alaihiwasallam bangun dan sholat."
            },
            {
                "number": 633,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا يَحْيَى عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ سُوَيْدِ بْنِ النُّعْمَانِ قَالَخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ خَيْبَرَ حَتَّى إِذَا كُنَّا بِالصَّهْبَاءِ وَصَلَّى الْعَصْرَ دَعَا بِالْأَطْعِمَةِ فَمَا أُتِيَ إِلَّا بِسَوِيقٍ فَأَكَلُوا وَشَرِبُوا مِنْهُ ثُمَّ قَامَ إِلَى الْمَغْرِبِ فَمَضْمَضَ وَمَضْمَضْنَا مَعَهُ وَمَا مَسَّ مَاءً",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] telah menceritakan kepada kami [Yahya] dari [Busyair bin Yassar] dari [Suwaid bin An-Nu'man] berkata; kami keluar bersama Rasulullah Shallallahu'alaihiwasallam pada tahun terjadinya Khaibar sampai kami di daerah Shahba' dan sholat ashar, beliau meminta makanan, beliau tidak diberi saji-sajian apa-apa kecuali hanya sawiq (makanan yang terbuat dari tepung gandum), lalu mereka menyantap dan meminumnya, lalu berdiri untuk sholat maghrib. Kami berkumur-kumur bersama beliau dan tidak menyentuh air."
            },
            {
                "number": 634,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ أَبَا مَالِكٍ الْأَشْجَعِيَّ يُحَدِّثُ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ قَالَ أَخْبَرَنِي مَنْرَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي ثَوْبٍ وَاحِدٍ قَدْ خَالَفَ بَيْنَ طَرَفَيْهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] berkata; saya mendengar [Abu Malik Al Asyja'i] menceritakan dari [Abu Salamah bin Abdurrahman] berkata; telah mengabarkan kepadaku [seseorang yang melihat Nabi Shallallahu'alaihiwasallam] sholat dalam satu kain dengan menyelendangkan kedua ujungnya."
            },
            {
                "number": 635,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا عَوْفٌ قَالَ حَدَّثَنِي عَلْقَمَةُ الْمُزَنِيُّ قَالَ حَدَّثَنِي رَجُلٌ قَالَكُنْتُ فِي مَجْلِسٍ فِيهِ عُمَرُ بْنُ الْخَطَّابِ بِالْمَدِينَةِ فَقَالَ لِرَجُلٍ مِنْ الْقَوْمِ يَا فُلَانُ كَيْفَ سَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَنْعَتُ الْإِسْلَامَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الْإِسْلَامَ بَدَأَ جَذَعًا ثُمَّ ثَنِيًّا ثُمَّ رَبَاعِيًا ثُمَّ سَدِيسِيًّا ثُمَّ بَازِلًاقَالَ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ فَمَا بَعْدَ الْبُزُولِ إِلَّا النُّقْصَانُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami ['Auf] berkata; telah menceritakan kepadaku [Al Qamah Al Muzani] berkata; telah menceritakan kepadaku [seseorang], berkata; saya berada pada sebuah majlis yang di dalamnya ada 'Umar bin Khattab di Madinah, dia berkata kepada seorang dari suatu kaum, Wahai Fulan, bagaimana kamu mendengar Rasulullah Shallallahu'alaihiwasallam menggambarkan Islam? Dia menjawab, saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \" Islam datang seperti unta yang berumur enam bulan sampai satu tahun, kemudian seperti unta yang berumur tiga tahun, lalu tujuh tahun, lalu delapan tahun, lalu sembilan tahun.\" Orang itu berkata; 'Umar bin Khattab berkata; bukankah setelah menjadi buzul (unta yang berumur sembilan tahun) akan mengalami kekurangan?."
            },
            {
                "number": 636,
                "arab": "حَدَّثَنَا سُفْيَانُ قَالَ سَمِعْتُ عَمْرًا سَمِعَ ابْنَ عُمَرَ قَالَكُنَّا نُخَابِرُ وَلَا نَرَى بِذَلِكَ بَأْسًا حَتَّى زَعَمَ رَافِعُ بْنُ خَدِيجٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْهُ فَتَرَكْنَاهُ",
                "id": "Telah menceritakan kepada kami [Sufyan] berkata; saya telah mendengar ['Amr] telah mendengar [Ibnu 'Umar] berkata; kami pernah melakukan mukhabarah dan kami melihatnya tidak ada masalah sehingga [Rafi' bin Khadij] yakin bahwa Rasulullah Shallallahu'alaihiwasallam melarangnya, lalu kami meninggalkannya. "
            },
            {
                "number": 637,
                "arab": "حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ عَنْ عَبْدِ الْوَاحِدِ بْنِ نَافِعٍ الْكَلَاعِيِّ مِنْ أَهْلِ الْبَصْرَةِ قَالَمَرَرْتُ بِمَسْجِدٍ بِالْمَدِينَةِ فَأُقِيمَتْ الصَّلَاةُ فَإِذَا شَيْخٌ فَلَامَ الْمُؤَذِّنَ وَقَالَ أَمَا عَلِمْتَ أَنَّ أَبِي أَخْبَرَنِي أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْمُرُ بِتَأْخِيرِ هَذِهِ الصَّلَاةِقَالَ قُلْتُ مَنْ هَذَا الشَّيْخُ قَالُوا هَذَا عَبْدُ اللَّهِ بْنُ رَافِعِ بْنِ خَدِيجٍ",
                "id": "Telah menceritakan kepada kami [Adl-Dlahak bin Makhlad] dari [Abdul Wahid bin Nafi' Al Kala'i] dari Basrah berkata; saya melewati suatu masjid di Madinah. sholat selanjutnya ditegakkan, maka ada [orang tua] yang mencela muadzin dan berkata; tidakkah kau tahu [bapakku] telah mengabarkan kepadaku bahwa Rasulullah Shallallahu'alaihiwasallam memerintahkan agar mengakhirkan sholat ini?. (Abdul Wahid bin Nafi' Al Kala'i Radliyallahu'anhu) berkata; saya bertanya, siapakah orang tua itu? Mereka menjawab, dia adalah Abdullah bin Rafi' bin Khadij."
            },
            {
                "number": 638,
                "arab": "حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعِ بْنِ خَدِيجٍ عَنْ جَدِّهِ رَافِعِ بْنِ خَدِيجٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا لَاقُو الْعَدُوِّ غَدًا وَلَيْسَ مَعَنَا مُدًى قَالَ مَا أَنْهَرَ الدَّمَ وَذُكِرَ عَلَيْهِ اسْمُ اللَّهِ فَكُلْ لَيْسَ السِّنَّ وَالظُّفُرَ وَسَأُحَدِّثُكَ أَمَّا السِّنُّ فَعَظْمٌ وَأَمَّا الظُّفُرُ فَمُدَى الْحَبَشَةِ قَالَ وَأَصَابَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهْبًا فَنَدَّ مِنْهَا بَعِيرٌ فَسَعَوْا لَهُ فَلَمْ يَسْتَطِيعُوا فَرَمَاهُ رَجُلٌ بِسَهْمٍ فَحَبَسَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِهَذِهِ الْإِبِلِ أَوْ قَالَ لِهَذِهِ النَّعَمِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَمَا غَلَبَكُمْ فَاصْنَعُوا بِهِ هَكَذَا",
                "id": "Telah menceritakan kepada kami [Sa'id bin 'Amir] berkata; telah menceritakan kepada kami [Syu'bah] dari [Sa'id bin Masruq] dari ['Abayah bin Rifa'ah bin Rafi' bin Khadij] dari [kakeknya Rafi' bin Khadij] berkata; \"Wahai Rasulullah, kita bertemu dengan musuh pada esok hari dan kita tidak memiliki pisau (untuk menyembelih) \" Rasulullah bersabda: \"Darah yang mengalir dan disebut nama Allah, makanlah selain bagian gigi dan kuku, saya beritahukan kepada kalian, gigi termasuk dari tulang. Sedang kuku termasuk pisau orang Habasyah\". (Rafi' Radliyallahu'anhu) berkata; Rasulullah pernah mendapatkan rampasan perang, yang salah satunya adalah unta yang kabur, mereka berusaha menangkapnya tapi tidak ada yang berhasil, lalu ada seorang laki-laki yang melemparnya dengan panah dan berhasil menangkapnya. Rasulullah Shallallahu'alaihiwasallam bersabda: \" dalam unta ini atau hewan ternak ini terdapat suatu rampasan yang buas, jika kalian mendapatkannya lakukan seperti ini.\""
            },
            {
                "number": 639,
                "arab": "حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنَا أَبِي عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ أَنَّ رَجُلًا مِنْ بَنِي حَارِثَةَ حَدَّثَهُ أَنَّ رَافِعَ بْنَ خَدِيجٍ حَدَّثَهُمْأَنَّهُمْ خَرَجُوا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ قَالَ فَلَمَّا نَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِلْغَدَاءِ قَالَ عَلَّقَ كُلُّ رَجُلٍ بِخِطَامِ نَاقَتِهِ ثُمَّ أَرْسَلَهَا تَهُزُّ فِي الشَّجَرِ قَالَ ثُمَّ جَلَسْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَرِحَالُنَا عَلَى أَبَاعِرِنَا قَالَ فَرَفَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأْسَهُ فَرَأَى أَكْسِيَةً لَنَا فِيهَا خُيُوطٌ مِنْ عِهْنٍ أَحْمَرَ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أَرَى هَذِهِ الْحُمْرَةَ قَدْ عَلَتْكُمْ قَالَ فَقُمْنَا سِرَاعًا لِقَوْلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى نَفَرَ بَعْضُ إِبِلِنَا فَأَخَذْنَا الْأَكْسِيَةَ فَنَزَعْنَاهَا مِنْهَا",
                "id": "Telah menceritakan kepada kami [Ya'qub] berkata; telah menceritakan kepada kami [bapakku] dari [Muhammad bin Ishaq] berkata; telah menceritakan kepadaku [Muhammad bin 'Amr bin 'Atho'] [ada seorang laki-laki] dari Bani Haritsah menceritakannya, [Rafi' bin Khadij] menceritakannya, mereka bepergian bersama Rasulullah dalam sebuah perjalanan. Tatkala Rasululllah berhenti berhenti untuk makan siang, para sahabat menggantungkan tali kekang unta mereka pada sebuah pohon dan membiarkannya bergerak-gerak, kemudian kami duduk bersama Rasulullah. (Rafi' bin Khadij Radliyallahu'anhu) berkata; perbekalan kami diatas unta, lalu Rasulullah mengangkat kepalanya dan melihat kain-kain kami yang terdapat pintalan dari bahan yang berwarna merah. Rasulullah bersabda: \"Kenapa saya banyak melihat warna merah diantara kalian?\" (Rafi' bin Khadij Radliyallahu'anhu) berkata; kami bergegas berdiri karena sabda Rasulullah Shallallahu'alaihiwasallam tersebut, yang menyebabkan sebagian unta kami kabur. Kami mengambil pakaian itu dan kami lepaskan unta-unta itu dengan terikat pakaian."
            },
            {
                "number": 640,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ حَنْظَلَةَ الزُّرَقِيِّ عَنْ رَافِعِ بْنِ خَدِيجٍأَنَّ النَّاسَ كَانُوا يُكْرُونَ الْمَزَارِعَ فِي زَمَانِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَاذِيَانَاتِ وَمَا سَقَى الرَّبِيعُ وَشَيْئًا مِنْ التِّبْنِ فَكَرِهَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كِرَاءَ الْمَزَارِعِ بِهَذَا وَنَهَى عَنْهَاو قَالَ رَافِعٌ لَا بَأْسَ بِكِرَائِهَا بِالدَّرَاهِمِ وَالدَّنَانِيرِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata; telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Rabi'ah bin Abu Abdurrahman] dari [Handlalah Az Zuroqi] dari [Rafi' bin Khadij] orang-orang menyewakan ladang pada masa Rasulullah Shallallahu'alaihiwasallam dengan pembayaran sesayuran yang tumbuh di anak-anak sungai, segala yang tumbuh akibat siraman kanal dan batu bata. Kemudian hari Rasulullah Shallallahu'alaihiwasallam membenci mukhabarah tanah dan melarangnya. Rafi' berkata; tidak apa menyewanya dengan dirham dan dinar."
            },
            {
                "number": 641,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا أَبُو الْأَحْوَصِ قَالَ حَدَّثَنَا سَعِيدُ بْنُ مَسْرُوقٍ عَنْ عَبَايَةَ بْنِ رِفَاعَةَ عَنْ جَدِّهِ رَافِعِ بْنِ خَدِيجٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ الْحُمَّى فَوْرُ جَهَنَّمَ فَابْرُدُوهَا بِالْمَاءِ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Abu Al Ahwash] berkata; telah menceritakan kepada kami [Sa'id bin Masruq] dari ['Abayah bin Rifa'ah] dari kakeknya, [Rafi' bin Khadij] berkata; saya mendengar Rasulullah bersabda: \" penyakit demam adalah bagian dari hembusan api neraka Jahanam, maka dinginkanlah dengan air\"."
            },
            {
                "number": 642,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا أَبَانُ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ إِبْرَاهِيمَ بْنِ قَارِظٍ عَنْ السَّائِبِ بْنِ يَزِيدَ عَنْ رَافِعِ بْنِ خَدِيجٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَسْبُ الْحَجَّامِ خَبِيثٌ وَمَهْرُ الْبَغِيِّ خَبِيثٌ وَثَمَنُ الْكَلْبِ خَبِيثٌ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Aban] berkata; telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Ibrahim bin Qarizh] dari [As-Sa'ib bin Yazid] dari [Rafi' bin Khadij] Rasulullah Shallallahu'alaihiwasallambersabda: \"Upah orang yang membekam adalah keji, penghasilan pezina adalah keji dan keuntungan dari juAl beli anjing juga keji\""
            },
            {
                "number": 643,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ سَعِيدِ بْنِ مَسْرُوقٍ عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعٍ عَنْ رَافِعِ بْنِ خَدِيجٍ جَدِّهِأَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِنَّا لَاقُو الْعَدُوِّ غَدًا وَلَيْسَ مَعَنَا مُدًى قَالَ مَا أَنْهَرَ الدَّمَ وَذُكِرَ اسْمُ اللَّهِ عَلَيْهِ فَكُلْ لَيْسَ السِّنَّ وَالظُّفُرَ وَسَأُحَدِّثُكَ أَمَّا السِّنُّ فَعَظْمٌ وَأَمَّا الظُّفُرُ فَمُدَى الْحَبَشَةِ",
                "id": "Telah menceritakan kepada kami ['Affan] berkata; telah menceritakan kepada kami [Syu'bah] dari [Sa'id bin Masruq] dari ['Abayah bin Rifa'ah bin Rafi'] dari [Rafi' bin Khadij] yaitu kakeknya bahwa dia berkata; Wahai Rasulullah, kita besok akan bertemu musuh dan kita tidak mempunyai bekal walau satu mud. Beliau bersabda: \"Makanlah yang telah disembelih dan disebut nama Allah selain tulang dan kukunya. Saya beritahukan sesuatu, yang dimaksudkan dengan 'assin' adalah tulang dan 'adldlufru' adalah pisau Habasyah.\""
            },
            {
                "number": 644,
                "arab": "وَأَصَابَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهْبًا فَنَدَّ بَعِيرٌ مِنْهَا فَسَعَوْا فَلَمْ يَسْتَطِيعُوهُ فَرَمَاهُ رَجُلٌ مِنْ الْقَوْمِ بِسَهْمٍ فَحَبَسَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِهَذِهِ الْإِبِلِ أَوْ النَّعَمِ أَوَابِدَ كَأَوَابِدِ الْوَحْشِ فَإِذَا غَلَبَكُمْ شَيْءٌ مِنْهَا فَاصْنَعُوا بِهِ هَكَذَا",
                "id": "Masih melalui jalur periwayatan yang sama seperti hadits sebelumnya, dari [Rafi' bin Khudaij]; Rasulullah Shallallahu'alaihiwasallam mendapatkan rampasan namun untanya lari, mereka mengejarnya namun mereka tidak mampu. Ada seseorang yang melemparnya dengan anak panah dan mengenainya. Rasulullah Shallallahu'alaihiwasallam bersabda: \" unta ini\", atau \"hewan ternak ini mempunyai sifat-sifat liar sebagaimana binatang buas. Jika kalian menjumpai hal seperti itu maka perlakukankanlah demikian\"."
            },
            {
                "number": 645,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ قَالَسَرَقَ غُلَامٌ لِنُعْمَانَ الْأَنْصَارِيِّ نَخْلًا صِغَارًا فَرُفِعَ إِلَى مَرْوَانَ فَأَرَادَ أَنْ يَقْطَعَهُ فَقَالَ رَافِعُ بْنُ خَدِيجٍ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُقْطَعُ فِي الثَّمَرِ وَلَا فِي الْكَثَرِقَالَ قُلْتُ لِيَحْيَى مَا الْكَثَرُ قَالَ الْجُمَّارُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] berkata; budak laki-laki milik Nu'man Al Anshari mencuri sebuah pohon kurma kecil. Kasus itu dilaporkan kepada Marwan, dia hendak memotong (tangan) nya. [Rafi' bin Khadij] mengajukan protes dengan berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidak ada potong tangan dalam pencurian buah dan juga tidak pula pada mayang kurma\". (Rafi' bin Khadij radliyallahu'anhu) berkata; saya bertanya kepada Yahya, apakah Al katsar? Dia menjawab, yaitu bagian atas pada pohon kurma."
            },
            {
                "number": 646,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ بُشَيْرِ بْنِ يَسَارٍ عَنْ أَبِي بُرْدَةَ بْنِ نِيَارٍأَنَّهُ ذَبَحَ قَبْلَ أَنْ يَذْبَحَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهُ أَنْ يُعِيدَ قَالَ إِنِّي لَا أَجِدُ إِلَّا جَذَعَةً فَأَمَرَهُ أَنْ يَذْبَحَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Yahya bin Sa'id] dari [Busyair bin Yasar] dari [Abu Burdah bin Niyar] dia menyembelih sebelum Nabi Shallallahu'alaihiwasallam menyembelih, maka beliau menyuruhnya mengulanginya. Dia berkata; \"Saya tidak mendapatkannya lagi selain jadza'ah (unta yang berumur antara enam bulan sampai satu tahun) \" lalu (Rasulullah Shallallahu'alaihiwasallam) menyuruhnya agar menyembelihnya."
            },
            {
                "number": 647,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْوَلِيدُ بْنُ عَبْدِ اللَّهِ بْنِ جُمَيْعٍ عَنِ الْجَهْمِ بْنِ أَبِي الْجَهْمِ عَنِ ابْنِ نِيَارٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَذْهَبُ الدُّنْيَا حَتَّى تَكُونَ لِلُكَعِ ابْنِ لُكَعٍ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Al Walid bin Abdullah bin Jumai'] dari [Al Jahm bin Abu Al Jahm] dari [Ibnu Niyar] berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Dunia tidak akan lenyap kecuali setelah muncul orang yang tercela, bodoh, lagi tak berilmu\""
            },
            {
                "number": 648,
                "arab": "حَدَّثَنَا هَاشِمٌ وَحَجَّاجٌ قَالَا حَدَّثَنَا لَيْثٌ يَعْنِي ابْنَ سَعْدٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي بُرْدَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُجْلَدُ فَوْقَ عَشْرِ جَلَدَاتٍ إِلَّا فِي حَدٍّ مِنْ حُدُودِ اللَّهِ تَعَالَى",
                "id": "Telah menceritakan kepada kami [Hasyim] dan [Hajjaj] berkata; telah menceritakan kepada kami [Laits] yaitu Ibnu Sa'd berkata; telah menceritakan kepada kami [Yazid bin Abu Habib] dari [Bukair bin Abdullah bin Al Assyaj] dari [Sulaiman bin Yasar] dari [Abdurrahman bin Jabir bin Abdullah] dari [Abu Burdah] Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidak diperkenankan seseorang dicambuk lebih dari sepuluh kali kecuali pada hukuman syara' dari Allah Ta'ala\"."
            },
            {
                "number": 649,
                "arab": "حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا شَرِيكٌ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى عَنْ جُمَيْعِ بْنِ عُمَيْرٍ وَلَمْ يَشُكَّ عَنْ خَالِهِ أَبِي بُرْدَةَ بْنِ نِيَارٍ قَالَانْطَلَقْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى نَقِيعِ الْمُصَلَّى فَأَدْخَلَ يَدَهُ فِي طَعَامٍ ثُمَّ أَخْرَجَهَا فَإِذَا هُوَ مَغْشُوشٌ أَوْ مُخْتَلِفٌ فَقَالَ لَيْسَ مِنَّا مَنْ غَشَّنَا",
                "id": "Telah menceritakan kepada kami [Hajjaj] telah menceritakan kepada kami [Syarik] dari [Abdullah bin 'Isa] dari [Jumai' bin 'Umair] dan tidak ragu dari [pamannya, Abu Burdah bin Niyar] berkata; saya berangkat bersama Nabi Shallallahu'alaihiwasallam ke suatu pasar, lalu beliau memasukkan tangannya ke dalam makanan dan mengeluarkannya. Ternyata makanan tersebut yang baik hanya di bagian luar atau permukaan (tidak sesuai antara sifat makanan yang tampak diatas dengan yang dibawah) lalu beliau berkomentar, \"Bukan termasuk dari golongan kita orang yang menipu.\""
            },
            {
                "number": 650,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ قَالَ أَخْبَرَنَا ابْنُ لَهِيعَةَ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ قَالَ قَالَ سُلَيْمَانُ لِعَبْدِ الرَّحْمَنِ بْنِ جَابِرٍ حَدِّثْ فَحَدَّثَ عَنْ أَبِي بُرْدَةَ بْنِ نِيَارٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا جَلْدَ فَوْقَ عَشْرِ جَلَدَاتٍ إِلَّا فِي حَدٍّ مِنْ حُدُودِ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ishaq] berkata; telah mengabarkan kepada kami [Ibnu Lahi'ah] dari [Bukair bin Abdullah] berkata; [Sulaiman] berkata kepada [Abdurrahman bin Jabir] ceritakan! Lalu dia menceritakan dari [Abu Burdah bin Niyar] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidak ada hukuman cambuk lebih dari sepuluh kali kecuali pada hukuman syara' dari Allah Azzawajalla\"."
            },
            {
                "number": 651,
                "arab": "حَدَّثَنَا أَبُو سَلَمَةَ الْخُزَاعِيُّ حَدَّثَنَا لَيْثٌ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جَابِرٍ عَنْ أَبِي بُرْدَةَ بْنِ نِيَارٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يُجْلَدُ فَوْقَ عَشْرِ جَلَدَاتٍ إِلَّا فِي حَدٍّ مِنْ حُدُودِ اللَّهِ عَزَّ وَجَلَّوَكَانَ لَيْثٌ حَدَّثَنَاهُ بِبَغْدَادَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ بُكَيْرٍ عَنْ سُلَيْمَانَ فَلَمَّا كُنَّا بِمِصْرَ أَخْبَرَنَا بُكَيْرُ بْنُ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ",
                "id": "Telah menceritakan kepada kami [Abu Salamah Al Khuza'i] telah menceritakan kepada kami [Laits] dari [Bukair bin Abdullah bin Al Asyaj] dari [Sulaiman bin Yasar] dari [Abdurrahman bin Jabir] dari [Abu Burdah bin Niyar] berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidak boleh seseorang dicambuk lebih dari sepuluh kali kecuali pada hukuman syara' dari Allah Azzawajalla\". [Laits] menceritakannya di Baghdad, dari [Yazid bin Habib] dari [Bukair] dari [Sulaiman] tatkala kami di Mesir, telah mengabarkan kepada kami Bukair bin Abdullah bin Al Asyaj"
            },
            {
                "number": 652,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ وَائِلٍ عَنْ جُمَيْعِ بْنِ عُمَيْرٍ عَنْ خَالِهِ قَالَسُئِلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَفْضَلِ الْكَسْبِ فَقَالَ بَيْعٌ مَبْرُورٌ وَعَمَلُ الرَّجُلِ بِيَدِهِ",
                "id": "Telah menceritakan kepada kami [Aswad bin 'Amir] berkata; telah menceritakan kepada kami [Syarik] dari [Wa'il] dari [Jumai' bin 'Umair] dari [pamannya] Nabi Shallallahu'alaihiwasallam ditanya tentang penghasilan yang paling utama. Beliau bersabda: \"Sebaik-baik penghasilan adalah juAl beli yang sah, tidak terdapat unsur penipuan dan usaha seseorang dengan tangannya.\""
            },
            {
                "number": 653,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا الْوَلِيدُ يَعْنِي ابْنَ عَبْدِ اللَّهِ بْنِ جُمَيْعٍ قَالَ حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي الْجَهْمِ قَالَأَقْبَلْتُ أَنَا وَزَيْدُ بْنُ حَسَنٍ بَيْنَنَا ابْنُ رُمَّانَةَ مَوْلَى عَبْدِ الْعَزِيزِ بْنِ مَرْوَانَ قَدْ نَصَبْنَا لَهُ أَيْدِيَنَا فَهُوَ مُتَّكِئٌ عَلَيْهَا دَاخِلَ الْمَسْجِدِ مَسْجِدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَهَى ابْنَ نِيَارٍ رَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَرْسَلَ إِلَى أَبِي بَكْرٍ ائْتِنِي فَأَتَاهُ فَقَالَ رَأَيْتُ ابْنَ رُمَّانَةَ بَيْنَكُمَا يَتَوَكَّأُ عَلَيْكَ وَعَلَى زَيْدِ بْنِ حَسَنٍ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَنْ تَذْهَبَ الدُّنْيَا حَتَّى تَكُونَ عِنْدَ لُكَعِ ابْنِ لُكَعٍ",
                "id": "Telah menceritakan kepada kami [Abu Nua'im] telah menceritakan kepada kami [Al Walid] yaitu Ibnu Abdullah bin Jumai', berkata; telah menceritakan kepadaku [Abu Bakar bin Abu Al Jahm] berkata; saya menemui Ibnu Rumanah mantan budak Abdul Aziz bin Marwan sedang Zaid bin Hasan ada diantara kami, kami menegakkan tangan kami, selanjutnya (Ibnu Rumanah) sedang bersandar pada tangan kami dalam masjid, yaitu masjid Rasulullah Shallallahu'alaihiwasallam. Lantas ada seseorang dari kalangan sahabat yang bernama [Ibnu Niyar] melarang, lalu dia mengutus seseorang kepada Abu Bakar dengan mengatakan 'Datangilah aku.' Abu Bakar pun mendatangi Ibnu Niyar, lalu Ibnu Niyar berkata 'Saya melihat Ibnu Rumanah ada di antara kalian berdua, bersandar padamu dan pada Zaid bin Hasan, padahal saya telah mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Dunia tidak akan sirna kecuali setelah berada pada orang yang tercela, bodoh lagi tak berilmu\"."
            },
            {
                "number": 654,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ الْبُرْسَانِيُّ قَالَ أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ قَالَ أَخْبَرَنَا أَبِي عَنْ زِيَادِ بْنِ مِينَاءَ عَنْ أَبِي سَعْدِ بْنِ أَبِي فَضَالَةَ الْأَنْصَارِيِّ وَكَانَ مِنْ الصَّحَابَةِ أَنَّهُ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا جَمَعَ اللَّهُ عَزَّ وَجَلَّ الْأَوَّلِينَ وَالْآخِرِينَ لِيَوْمٍ لَا رَيْبَ فِيهِ نَادَى مُنَادٍ مَنْ كَانَ أَشْرَكَ فِي عَمَلٍ عَمِلَهُ لِلَّهِ تَبَارَكَ وَتَعَالَى أَحَدًا فَلْيَطْلُبْ ثَوَابَهُ مِنْ عِنْدِ غَيْرِ اللَّهِ عَزَّ وَجَلَّ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ أَغْنَى الشُّرَكَاءِ عَنْ الشِّرْكِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Bakr Al Bursani] berkata; telah mengabarkan kepada kami [Abdul Hamid bin Ja'far] berkata; telah mengabarkan kepada kami [bapakku] dari [Ziyad bin Mina'] dari [Abu Saad bin Abu Fadlalah Al Anshari, salah seorang sahabat] dia berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Jika Allah menghimpun manusia dari generasi pertama dan generasi terakhir pada hari yang tidak diragukan lagi, ada seorang penyeru yang menyerukan, 'Barangsiapa menyekutukan Allah dengan seseorang dalam suatu amalan yang seharusnya dia kerjakan untuk Allah Tabaraka Wa Ta'ala, mintalah balasannya kepada selain Allah Azzawajalla. Sebab Allah adalah Dzat yang paling tidak membutuhkan tandingan.\""
            },
            {
                "number": 655,
                "arab": "حَدَّثَنِي أَبِي عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ الزُّهْرِيِّ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ يَزِيدَ يَعْنِي ابْنَ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ عَنْ سُهَيْلِ ابْنِ بَيْضَاءَ أَنَّهُ قَالَنَادَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ لَيْلَةٍ وَأَنَا رَدِيفُهُ يَا سُهَيْلُ ابْنَ بَيْضَاءَ رَافِعًا بِهَا صَوْتَهُ مِرَارًا حَتَّى سَمِعَ مَنْ خَلْفَنَا وَأَمَامَنَا فَاجْتَمَعُوا وَعَلِمُوا أَنَّهُ يُرِيدُ أَنْ يَتَكَلَّمَ بِشَيْءٍ إِنَّهُ مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ أَوْجَبَ اللَّهُ عَزَّ وَجَلَّ لَهُ بِهَا الْجَنَّةَ وَأَعْتَقَهُ بِهَا مِنْ النَّارِحَدَّثَنَا هَارُونُ حَدَّثَنَا ابْنُ وَهْبٍ قَالَ حَيْوَةُ حَدَّثَنِي يَزِيدُ بْنُ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ سَعِيدِ بْنِ الصَّلْتِ عَنْ سُهَيْلِ ابْنِ الْبَيْضَاءِ مِنْ بَنِي عَبْدِ الدَّارِ قَالَ بَيْنَمَا نَحْنُ فِي سَفَرٍ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami bapakku dari [Ya'qub bin Ibrahim Az Zuhri] berkata; saya telah mendengar [bapakku] menceritakan dari [Yazid] yaitu Ibnu Al Had, dari [Muhammad bin Ibrahim bin Al Harits] dari [Suhail bin Baidla'] dia berkata; suatu malam Rasulullah Shallallahu'alaihiwasallam memanggil sedang saya membonceng beliau, Wahai Suhail bin Baidla'!, beliau mengangkat suaranya beberapa kali, sampai orang yang berada di belakang dan depan kami mendengarnya. Mereka berkumpul dan mereka mengetahui bahwa beliau hendak mengatakan, 'Barangsiapa bersaksi bahwa tidak ada tuhan kecuali Allah, Allah Azzawajalla mewajibkan surga baginya dan menyelamatkannya dari neraka. Telah menceritakan kepada kami [Harun] telah menceritakan kepada kami [Ibnu Wahb] [Haiwah] berkata; telah menceritakan kepadaku [Yazid bin Al Had] dari [Muhammad bin Ibrahim] dari [Sa'id Al Shalt] dari [Suhail bin Baidla'] dari Bani Abdu Dar, berkata; tatkala kami dalam sebuah perjalanan bersama Rasulullah Shallallahu'alaihiwasallam, lalu menyebutkan secara makna."
            },
            {
                "number": 656,
                "arab": "حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنِي أَبِي عَنْ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي صَالِحُ بْنُ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ عَنْ مَحْمُودِ بْنِ لَبِيدٍ أَخِي بَنِي عَبْدِ الْأَشْهَلِ عَنْ سَلَمَةَ بْنِ سَلَامَةَ بْنِ وَقْشٍ وَكَانَ مِنْ أَصْحَابِ بَدْرٍ قَالَكَانَ لَنَا جَارٌ مِنْ يَهُودَ فِي بَنِي عَبْدِ الْأَشْهَلِ قَالَ فَخَرَجَ عَلَيْنَا يَوْمًا مِنْ بَيْتِهِ قَبْلَ مَبْعَثِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَسِيرٍ فَوَقَفَ عَلَى مَجْلِسِ عَبْدِ الْأَشْهَلِ قَالَ سَلَمَةُ وَأَنَا يَوْمَئِذٍ أَحْدَثُ مَنْ فِيهِ سِنًّا عَلَيَّ بُرْدَةٌ مُضْطَجِعًا فِيهَا بِفِنَاءِ أَهْلِي فَذَكَرَ الْبَعْثَ وَالْقِيَامَةَ وَالْحِسَابَ وَالْمِيزَانَ وَالْجَنَّةَ وَالنَّارَ فَقَالَ ذَلِكَ لِقَوْمٍ أَهْلِ شِرْكٍ أَصْحَابِ أَوْثَانٍ لَا يَرَوْنَ أَنَّ بَعْثًا كَائِنٌ بَعْدَ الْمَوْتِ فَقَالُوا لَهُ وَيْحَكَ يَا فُلَانُ تَرَى هَذَا كَائِنًا إِنَّ النَّاسَ يُبْعَثُونَ بَعْدَ مَوْتِهِمْ إِلَى دَارٍ فِيهَا جَنَّةٌ وَنَارٌ يُجْزَوْنَ فِيهَا بِأَعْمَالِهِمْ قَالَ نَعَمْ وَالَّذِي يُحْلَفُ بِهِ لَوَدَّ أَنَّ لَهُ بِحَظِّهِ مِنْ تِلْكَ النَّارِ أَعْظَمَ تَنُّورٍ فِي الدُّنْيَا يُحَمُّونَهُ ثُمَّ يُدْخِلُونَهُ إِيَّاهُ فَيُطْبَقُ بِهِ عَلَيْهِ وَأَنْ يَنْجُوَ مِنْ تِلْكَ النَّارِ غَدًا قَالُوا لَهُ وَيْحَكَ وَمَا آيَةُ ذَلِكَ قَالَ نَبِيٌّ يُبْعَثُ مِنْ نَحْوِ هَذِهِ الْبِلَادِ وَأَشَارَ بِيَدِهِ نَحْوَ مَكَّةَ وَالْيَمَنِ قَالُوا وَمَتَى تَرَاهُ قَالَ فَنَظَرَ إِلَيَّ وَأَنَا مِنْ أَحْدَثِهِمْ سِنًّا فَقَالَ إِنْ يَسْتَنْفِدْ هَذَا الْغُلَامُ عُمُرَهُ يُدْرِكْهُ قَالَ سَلَمَةُ فَوَاللَّهِ مَا ذَهَبَ اللَّيْلُ وَالنَّهَارُ حَتَّى بَعَثَ اللَّهُ تَعَالَى رَسُولَهُ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ حَيٌّ بَيْنَ أَظْهُرِنَا فَآمَنَّا بِهِ وَكَفَرَ بِهِ بَغْيًا وَحَسَدًا فَقُلْنَا وَيْلَكَ يَا فُلَانُ أَلَسْتَ بِالَّذِي قُلْتَ لَنَا فِيهِ مَا قُلْتَ قَالَ بَلَى وَلَيْسَ بِهِ",
                "id": "Telah menceritakan kepada kami [Ya'qub] berkata; telah menceritakan kepadaku [bapakku] dari [Ibnu Ishaq] berkata; telah menceritakan kepadaku [Shalih bin Ibrahim bin Abdurrahman bin 'Auf] dari [Mahmud bin Labid, dari bani Abdul Ashal] dari [Salamah bin Salamah bin Waqsy] salah seorang yang mengikuti Perang Badar, dia berkata; Kami mempunyai seorang tetangga Yahudi dari Bani Abdul Asyhal. (Salamah bin Salamah bin Waqsy Radliyallahu'anhu) berkata; pada suatu saat dia keluar dari rumahnya menjelang diutusnya Nabi Shallallahu'alaihiwasallam, dia ikut dalam sebuah majlis Bani Abdul Asyhal. Pada hari itu saya dalam majlis yang termuda umurnya, saya memakai selendang dengan bersandar di halaman rumahku, (orang yahudi tersebut) menjelaskan tentang Hari Kebangkitan, Hari Kiamat, Hari Perhitungan, Timbangan, surga dan neraka, lalu berkata 'Siksaan itu adalah untuk kaum musyrikin, yang menyembah berhala yang berpendapat bahwa tidak ada hari kebangkitan setelah kematian. Mereka berkata kepadanya, \"Celakalah kamu wahai fulan, kamu menganggap manusia akan dibangkitkan setelah kematian, untuk menuju suatu tempat yang bernama surga dan neraka, mereka diberi balasan sesuai dengan amalan yang telah mereka kerjakan? Maka (orang Yahudi tersebut) berkata; \"Benar, demi Zat yang dengan-Nya dijadikan bersumpah, sungguh seseorang menginginkan jika bagiannya dari neraka, menjadi tungku terbesar di dunia, lantas orang-orang memanggangnya dan memasukkannya dalam neraka itu, dan orang itu ditutup di neraka itu. Mereka berkata kepadanya, \"Huss kamu, apa tanda-tanda dari semua itu\"? Maka dia berkata; \"Seorang nabi yang diutus dari negeri ini\", maka dia menunjuk dengan telunjuknya ke arah Makah dan Yaman. Mereka bertanya, kapan kamu melihatnya? (Salamah Radliyallahu'anhu) berkata; orang Yahudi itu melihat kepadanya, saya adalah yang paling muda umurnya, \"Jika anak ini telah mencapai dewasa, maka dia akan mengetahuinya\". Salamah berkata; \"Demi Allah, tidaklah berganti siang dan malam kecuali Allah Ta'ala mengutus seorang rasul-Nya Shallallahu'alaihiwasallam dan beliau hidup di antara kita dan kami beriman kepadanya, adapun (Yahudi tersebut) mengafiri (Rasulullah Shallallahu'alaihiwasallam) dengan penuh kebencian dan hasad. Kami berkata; \"Celakalah engkau wahai fulan, bukankah engkau yang telah menerangkan kepada kami urusan ini\"? (orang Yahudi tersebut) berkata; \"Benar, tetapi yang dimaksud bukanlah dia\"."
            },
            {
                "number": 657,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ يَعْنِي ابْنَ مُهَاجِرٍ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ عَمْرِو بْنِ حُرَيْثٍ قَالَ حَدَّثَنِي أَخِي سَعِيدُ بْنُ حُرَيْثٍ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ بَاعَ عَقَارًا كَانَ قَمِنًا أَنْ لَا يُبَارَكَ لَهُ إِلَّا أَنْ يَجْعَلَهُ فِي مِثْلِهِ أَوْ غَيْرِهِ",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] berkata; telah menceritakan kepada kami [Isma'il bin Ibrahim] yaitu Ibnu Muhajir, dari [Abdul Malik bin 'Umair] dari ['Amr bin Huraits] berkata; telah menceritakan kepadaku [saudaraku, Sa'id bin Huraits] berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \"Barangsiapa menjual tanah maka dia tidak pantas untuk mendapat berkah kecuali dia menjadikannya semisal atau dengan lainnya\"."
            },
            {
                "number": 658,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ مِنْ كِتَابِهِ قَالَ أَخْبَرَنَا ابْنُ لَهِيعَةَ عَنْ عَبْدِ اللَّهِ بْنِ هُبَيْرَةَ عَنْ حَسَّانَ بْنِ كُرَيْبٍأَنَّ غُلَامًا مِنْهُمْ تُوُفِّيَ فَوَجَدَ عَلَيْهِ أَبَوَاهُ أَشَدَّ الْوَجْدِ فَقَالَ حَوْشَبٌ صَاحِبُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أُخْبِرُكُمْ بِمَا سَمِعْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي مِثْلِ ابْنِكَ إِنَّ رَجُلًا مِنْ أَصْحَابِهِ كَانَ لَهُ ابْنٌ قَدْ أَدَبَّ أَوْ دَبَّ وَكَانَ يَأْتِي مَعَ أَبِيهِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ إِنَّ ابْنَهُ تُوُفِّيَ فَوَجَدَ عَلَيْهِ أَبُوهُ قَرِيبًا مِنْ سِتَّةِ أَيَّامٍ لَا يَأْتِي النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا أَرَى فُلَانًا قَالُوا يَا رَسُولَ اللَّهِ إِنَّ ابْنَهُ تُوُفِّيَ فَوَجَدَ عَلَيْهِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا فُلَانُ أَتُحِبُّ لَوْ أَنَّ ابْنَكَ عِنْدَكَ الْآنَ كَأَنْشَطِ الصِّبْيَانِ نَشَاطًا أَتُحِبُّ أَنَّ ابْنَكَ عِنْدَكَ أَحَرُّ الْغِلْمَانِ جَرَاءَةً أَتُحِبُّ أَنَّ ابْنَكَ عِنْدَكَ كَهْلًا كَأَفْضَلِ الْكُهُولِ أَوْ يُقَالُ لَكَ ادْخُلْ الْجَنَّةَ ثَوَابَ مَا أُخِذَ مِنْكَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ishaq] dari tulisannya, berkata; telah mengabarkan kepada kami [Ibnu Lahi'ah] dari [Abdullah bin Hubairah] dari [Hassan bin Kuraib] ada seorang pemuda dari mereka yang meninggal, kedua orang tuanya pun sangat sedih. [Hausyab], seorang sahabat Nabi Shallallahu'alaihiwasallam berkata; \"Maukah kuberitahukan kepada kalian sesuatu yang saya dengar dari Rasulullah Shallallahu'alaihiwasallam tentang kasus seperti yang menimpa anakmu?.\" ada seorang laki-laki dari sahabatnya mempunyai seorang anak yang baru bisa merangkak, dia datang bersama bapaknya kepada Nabi Shallallahu'alaihiwasallam. Kemudian hari anaknya meninggal, hingga bapaknya bersedih atas meninggalnya anaknya sampai sekitar enam hari dia tidak menemui Nabi Shallallahu'alaihiwasallam. Nabi Shallallahu'alaihiwasallam bersabda: \"Mengapa saya tidak melihat si Fulan?\" Mereka menjawab, \"Wahai Rasulullah, sungguh anaknya meninggal, dan dia sangat bersedih karenanya\". Rasulullah Shallallahu'alaihiwasallam bersabda kepadanya, \"Wahai fulan, tidaklah engkau senang jikalau anakmu sekarang sedang bermain bebas sebagaimana anak kecil lainnya, apakah engkau tidak senang jikalau anakmu menjadi anak yang bebas dan berani, dan apakah engkau tidak senang bahwa anakmu menjadi orang dewasa dan utama, atau dikatakan kepada kamu \"Masuklah surga sebagai balasan atas sesuatu yang diambil darimu?? "
            },
            {
                "number": 659,
                "arab": "حَدَّثَنَا يَعْقُوبُ قَالَ قَالَ أَبِي كَمَا حَدَّثَنِي ابْنُ إِسْحَاقَ عَنْ يَعْقُوبَ بْنِ عُتْبَةَ عَنْ مُسْلِمِ بْنِ عَبْدِ اللَّهِ بْنِ جُنْدُبٍ الْجُهَنِيِّ عَنْ جُنْدُبِ بْنِ مَكِيثٍ الْجُهَنِيِّ قَالَبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَالِبَ بْنَ عَبْدِ اللَّهِ الْكَلْبِيَّ كَلْبَ لَيْثٍ إِلَى بَنِي مُلَوَّحٍ بِالْكَدِيدِ وَأَمَرَهُ أَنْ يُغِيرَ عَلَيْهِمْ فَخَرَجَ فَكُنْتُ فِي سَرِيَّتِهِ فَمَضَيْنَا حَتَّى إِذَا كُنَّا بِقُدَيْدٍ لَقِينَا بِهِ الْحَارِثَ بْنَ مَالِكٍ وَهُوَ ابْنُ الْبَرْصَاءِ اللَّيْثِيُّ فَأَخَذْنَاهُ فَقَالَ إِنَّمَا جِئْتُ لِأُسْلِمَ فَقَالَ غَالِبُ بْنُ عَبْدِ اللَّهِ إِنْ كُنْتَ إِنَّمَا جِئْتَ مُسْلِمًا فَلَنْ يَضُرَّكَ رِبَاطُ يَوْمٍ وَلَيْلَةٍ وَإِنْ كُنْتَ عَلَى غَيْرِ ذَلِكَ اسْتَوْثَقْنَا مِنْكَ قَالَ فَأَوْثَقَهُ رِبَاطًا ثُمَّ خَلَّفَ عَلَيْهِ رَجُلًا أَسْوَدَ كَانَ مَعَنَا فَقَالَ امْكُثْ مَعَهُ حَتَّى نَمُرَّ عَلَيْكَ فَإِنْ نَازَعَكَ فَاجْتَزَّ رَأْسَهُ قَالَ ثُمَّ مَضَيْنَا حَتَّى أَتَيْنَا بَطْنَ الْكَدِيدِ فَنَزَلْنَا عُشَيْشِيَةً بَعْدَ الْعَصْرِ فَبَعَثَنِي أَصْحَابِي فِي رَبِيئَةٍ فَعَمَدْتُ إِلَى تَلٍّ يُطْلِعُنِي عَلَى الْحَاضِرِ فَانْبَطَحْتُ عَلَيْهِ وَذَلِكَ الْمَغْرِبَ فَخَرَجَ رَجُلٌ مِنْهُمْ فَنَظَرَ فَرَآنِي مُنْبَطِحًا عَلَى التَّلِّ فَقَالَ لِامْرَأَتِهِ وَاللَّهِ إِنِّي لَأَرَى عَلَى هَذَا التَّلِّ سَوَادًا مَا رَأَيْتُهُ أَوَّلَ النَّهَارِ فَانْظُرِي لَا تَكُونُ الْكِلَابُ اجْتَرَّتْ بَعْضَ أَوْعِيَتِكِ قَالَ فَنَظَرَتْ فَقَالَتْ لَا وَاللَّهِ مَا أَفْقِدُ شَيْئًا قَالَ فَنَاوِلِينِي قَوْسِي وَسَهْمَيْنِ مِنْ كِنَانَتِي قَالَ فَنَاوَلَتْهُ فَرَمَانِي بِسَهْمٍ فَوَضَعَهُ فِي جَنْبِي قَالَ فَنَزَعْتُهُ فَوَضَعْتُهُ وَلَمْ أَتَحَرَّكْ ثُمَّ رَمَانِي بِآخَرَ فَوَضَعَهُ فِي رَأْسِ مَنْكِبِي فَنَزَعْتُهُ فَوَضَعْتُهُ وَلَمْ أَتَحَرَّكْ فَقَالَ لِامْرَأَتِهِ وَاللَّهِ لَقَدْ خَالَطَهُ سَهْمَايَ وَلَوْ كَانَ دَابَّةً لَتَحَرَّكَ فَإِذَا أَصْبَحْتِ فَابْتَغِي سَهْمَيَّ فَخُذِيهِمَا لَا تَمْضُغُهُمَا عَلَيَّ الْكِلَابُ قَالَ وَأَمْهَلْنَاهُمْ حَتَّى رَاحَتْ رَائِحَتُهُمْ حَتَّى إِذَا احْتَلَبُوا وَعَطَنُوا أَوْ سَكَنُوا وَذَهَبَتْ عَتَمَةٌ مِنْ اللَّيْلِ شَنَنَّا عَلَيْهِمْ الْغَارَةَ فَقَتَلْنَا مَنْ قَتَلْنَا مِنْهُمْ وَاسْتَقْنَا النَّعَمَ فَتَوَجَّهْنَا قَافِلِينَ وَخَرَجَ صَرِيخُ الْقَوْمِ إِلَى قَوْمِهِمْ مُغَوِّثًا وَخَرَجْنَا سِرَاعًا حَتَّى نَمُرَّ بِالْحَارِثِ ابْنِ الْبَرْصَاءِ وَصَاحِبِهِ فَانْطَلَقْنَا بِهِ مَعَنَا وَأَتَانَا صَرِيخُ النَّاسِ فَجَاءَنَا مَا لَا قِبَلَ لَنَا بِهِ حَتَّى إِذَا لَمْ يَكُنْ بَيْنَنَا وَبَيْنَهُمْ إِلَّا بَطْنُ الْوَادِي أَقْبَلَ سَيْلٌ حَالَ بَيْنَنَا وَبَيْنَهُمْ بَعَثَهُ اللَّهُ تَعَالَى مِنْ حَيْثُ شَاءَ مَا رَأَيْنَا قَبْلَ ذَلِكَ مَطَرًا وَلَا حَالًا فَجَاءَ بِمَا لَا يَقْدِرُ أَحَدٌ أَنْ يَقُومَ عَلَيْهِ فَلَقَدْ رَأَيْنَاهُمْ وُقُوفًا يَنْظُرُونَ إِلَيْنَا مَا يَقْدِرُ أَحَدٌ مِنْهُمْ أَنْ يَتَقَدَّمَ وَنَحْنُ نُحَوِّزُهَا سِرَاعًا حَتَّى أَسْنَدْنَاهَا فِي الْمَشْلَلِ ثُمَّ حَدَرْنَاهَا عَنَّا فَأَعْجَزْنَا الْقَوْمَ بِمَا فِي أَيْدِينَا",
                "id": "Telah menceritakan kepada kami [Ya'qub] berkata; [bapakku] berkata; sebagaimana telah menceritakan kepadaku [Ibnu Ishaq] dari [Ya'qub bin 'Utbah] dari [Muslim bin Abdullah bin Jundub Al Juhani] dari [Jundub bin Makits Al Juhani] berkata; Rasulullah Shallallahu'alaihiwasallam mengutus Ghalib bin Abdullah Al Kalbi yang dijuluki 'kalb laits' ke Bani Mulawwah di Kadid dan memerintahkan untuk menyerang mereka secara tiba-tiba. Dia pun berangkat, dan saya termasuk dalam pasukannya. Kami berangkat hingga setelah sampai di sampai di Qadid, kami bertemu Al Harits Bin Malik, dia anak Al Barsha' Al Laitsi, kami menawannya. Dia berkata 'Saya datang untuk masuk Islam.' Ghalib bin Abdullah berkata; \"Jika engkau datang sebagai seorang muslim, tidaklah mengapa bagimu untuk berjaga siang dan malam, tapi kalau engkau belum masuk Islam, maka kami meminta janji kesetiaan darimu\".(Jundub bin Makits Al Juhani) berkata; Alharits bin Malik memberi janji kesetiaan dengan ribath (berjaga di perbatasan), Ghalib bin Abdullah alkalbi mempercayakan seorang laki-laki hitam untuk berada di belakangnya. Ghalib bin Abdullah berpesan, \"Tetaplah bersamanya, sampai kami melewatimu nanti, kalau dia khianat, maka potonglah kepalanya\". (Jundub bin Makits Al Juhani) berkata; kami berangkat sehingga kami sampai di tengah daerah Kadid, kami singgah sebentar selepas ashar. Lantas sahabatku mengutusku sebagai pasukan pengintai, hingga aku naik daerah yang tinggi sehingga aku bisa mengintai siapa saja yang datang. Aku-pun menelungkupkan wajahku yang saat itu adalah waktu maghrib. Tiba-tiba keluarlah laki-laki di antara mereka sambil melihat, ternyata dia melihatku tertelungkup di atas dataran tinggi. Dia berkata kepada istrinya, \"Demi Allah, saya melihat sesuatu yang berwarna hitam di atas dataran itu, yang tidak saya lihat pada waktu siang tadi. Lihatlah, jangan sampai ada anjing-anjing yang memangsa sebagian gembalaanmu\". (Jundub bin Makits Al Juhani) berkata; (istri laki-laki tadi) lantas memeriksa dan mengecek gembalaannya dan berkata 'Tidak, demi Allah, saya tidak kehilangan apa-apa.' (Laki-laki itu) berkata; berikan panahku dan dua anak panahnya dari tempatnya. (Jundub bin Makits Al Juhani) berkata; (wanita itu) menyerahkannya, lalu dia memanahku dan mengenai pinggangku.Saya mencabutnya dan saya letakkan dengan tidak sedikitpun bergerak. Dia melemparkan panahnya untuk keduakalinya ke arah pundakku, segera saya mencabutnya dengan tanpa gerak. Laki-laki tadi berkata kepada istrinya, \"Demi Allah, telah saya lemparkan dua panah ke arah benda tersebut, jika itu adalah hewan melata, pastilah bergerak. Besok pagi, telusurilah di mana letak dua panahku serta ambillah keduanya supaya tidak diambil anjing\". (Jundub bin Makits Al Juhani) berkata; ketika gembalaan sudah mulai balik kandang dari tempat minumnya, mereka telah memerah susunya, mengandangkan hewannya ke tempat semula, dan telah datang kegelapan malam, kami dengan perlahan-lahan menyerang mereka dan berhasil membunuh beberapa orang mereka. Kami mendapatkan hewan ternak, lalu kami pulang. Tiba-tiba kami mendengar suara yang berteriak minta tolong, dengan segera kami bergegas pergi ngacir, sampai kami melewati Al Harits bin Barsha' dan temannya, kami bersama-bersama pergi. Orang yang meminta tolong tadi mendatangi kami, tiba-tiba datanglah sekelompok yang bukan dari pihak kami. Hingga saat jarak antara kita dengan mereka (musuh) hanyalah dipisah pertengahan bukit yang menghadap saluran mata air, Allah Ta'ala dengan kehendak-Nya menurunkan air hujan yang sebelumnya tidak pernah aku melihat hujan dan lumpur hitam sederas itu. Derasnya hujan dan lumpur menyebabkan suatu hal yang tak seorang pun bisa melawannya. Kita melihat mereka (musuh) dalam keadaan berdiri memandang kami, tapi tidak ada seorangpun dari mereka yang mampu untuk maju. Kami dengan segera mengumpulkan unta-unta rampasan, kami pinggirkan di daerah air terjun, lantas kami gelincirkan dari kami, sehingga gagallah mereka merampas barang yang telah kami ambil."
            },
            {
                "number": 660,
                "arab": "حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ قَالَ حَدَّثَنَا أَبُو نَعَامَةَ الْعَدَوِيُّ عَنْ مُسْلِمِ بْنِ بُدَيْلٍ عَنْ إِيَاسِ بْنِ زُهَيْرٍ عَنْ سُوَيْدِ بْنِ هُبَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَيْرُ مَالِ الْمَرْءِ لَهُ مُهْرَةٌ مَأْمُورَةٌ أَوْ سِكَّةٌ مَأْبُورَةٌ وَقَالَ رَوْحٌ فِي بَيْتِهِوَقِيلَ لَهُ إِنَّكَ قُلْتَ لَنَا سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Rauh bin 'Ubadah] berkata; telah menceritakan kepada kami [Abu Na'amah Al 'Adawi] dari [Muslim bin Budail] dari [Iyas bin Zuhair] dari [Suwaid bin Hubairah] dari Nabi Shallallahu'alaihiwasallam bersabda: \"Sebaik-baik harta seseorang adalah anak kuda yang penurut atau pohon yang diserbukkan\". Rauh berkata di rumahnya, ada yang berkata; kamu telah berkata kepada kami, saya mendengar Rasulullah Shallallahu'alaihiwasallam, dia berkata; saya mendengar Nabi Shallallahu'alaihiwasallam."
            },
            {
                "number": 661,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ هِشَامِ بْنِ حَكِيمِ بْنِ حِزَامٍ قَالَمَرَّ بِقَوْمٍ يُعَذَّبُونَ فِي الْجِزْيَةِ بِفِلَسْطِينَ قَالَ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ عَزَّ وَجَلَّ يُعَذِّبُ يَوْمَ الْقِيَامَةِ الَّذِينَ يُعَذِّبُونَ النَّاسَ فِي الدُّنْيَا",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] dari [Hisyam bin 'Urwah] dari [Bapaknya] dari [Hisyam bin Hakim bin Hizam] berkata; dia melewati suatu kaum yang sedang disiksa karena masalah jizyah di Palestina. Dia berkata; saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: \" Pada Hari Kiamat Allah Azzawajalla menyiksa orang-orang yang menyiksa manusia di dunia\"."
            },
            {
                "number": 662,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا أَبُو مُعَاوِيَةَ يَعْنِي شَيْبَانَ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ يَحْيَى بْنِ إِسْحَاقَ عَنْ مُجَاشِعِ بْنِ مَسْعُودٍأَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِابْنِ أَخٍ لَهُ يُبَايِعُهُ عَلَى الْهِجْرَةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا بَلْ يُبَايِعُ عَلَى الْإِسْلَامِ فَإِنَّهُ لَا هِجْرَةَ بَعْدَ الْفَتْحِ وَيَكُونُ مِنْ التَّابِعِينَ بِإِحْسَانٍ",
                "id": "Telah menceritakan kepada kami [Abu Nadlr] telah menceritakan kepada kami [Abu Mu'awiyah] yaitu Syaiban, dari [Yahya bin Abu Katsir] dari [Yahya bin Ishaq] dari [Mujasyi' bin Mas'ud] dia datang kepada Nabi Shallallahu'alaihiwasallam bersama keponakannya untuk berbaiat atas hijrah. Rasulullah Shallallahu'alaihiwasallam bersabda: \"Tidak, tapi berbai'at atas Islam, karena tidak ada hijrah setelah Fathul Makkah\", di kemudian hari dia termasuk tabi'in yang baik."
            },
            {
                "number": 663,
                "arab": "حَدَّثَنَا بَكْرُ بْنُ عِيسَى قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ مُجَاشِعِ بْنِ مَسْعُودٍ قَالَانْطَلَقْتُ بِأَخِي مَعْبَدٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ الْفَتْحِ فَقُلْتُ يَا رَسُولَ اللَّهِ بَايِعْهُ عَلَى الْهِجْرَةِ فَقَالَ مَضَتْ الْهِجْرَةُ لِأَهْلِهَا قَالَ فَقُلْتُ فَمَاذَا قَالَ عَلَى الْإِسْلَامِ وَالْجِهَادِ",
                "id": "Telah menceritakan kepada kami [Bakr bin 'Isa] berkata; telah menceritakan kepada kami [Abu 'Awanah] dari ['Ashim Al Ahwal] dari [Abu 'Utsman An-Nahdi] dari [Mujasyi 'bin Mas'ud] berkata; saya pergi bersama saudaraku, Ma'bad kepada Rasulullah Shallallahu'alaihiwasallam setelah Fathu Makah. Saya berkata; Wahai Rasulullah, baiatlah dia untuk hijrah. Beliau bersabda: \"Hijrah telah berlalu\". (Mujasyi' bin Mas'ud Radliyallahu'anhu) berkata; lalu untuk apa? Beliau bersabda: \"Untuk Islam dan berjihad\"."
            },
            {
                "number": 664,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى قَالَ حَدَّثَنَا شَيْبَانُ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ يَحْيَى بْنِ إِسْحَاقَ أَنَّهُ أَخْبَرَهُ عَنْ مُجَاشِعِ بْنِ مَسْعُودٍ الْبَهْزِيِّأَنَّهُ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِابْنِ أَخِيهِ لِيُبَايِعَهُ عَلَى الْهِجْرَةِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا بَلْ يُبَايِعُ عَلَى الْإِسْلَامِ فَإِنَّهُ لَا هِجْرَةَ بَعْدَ الْفَتْحِ قَالَ وَيَكُونُ مِنْ التَّابِعِينَ بِإِحْسَانٍ",
                "id": "Telah menceritakan kepada kami [Hasan bin Musa] berkata; telah menceritakan kepada kami [Syaiban] dari [Yahya bin Abu Katsir] dari [Yahya bin Ishaq] dia mengabari dari [Mujasyi' bin Mas'ud Al Bahzi] dia datang kepada Rasulullah Shallallahu'alaihiwasallam dengan anak pamannya agar beliau membaiatnya untuk hijrah. Rasulullah Shallallahu'alaihiwasallam bersabda kepadanya, \"Tidak, tapi baiat atas Islam, tidak ada hijrah setelah Fathu Makah.\" Kemudian hari dia menjadi tabiin yang baik."
            },
            {
                "number": 665,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ قَالَ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي عُثْمَانَ عَنْ مُجَاشِعِ بْنِ مَسْعُودٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا مُجَالِدُ بْنُ مَسْعُودٍ يُبَايِعُكَ عَلَى الْهِجْرَةِ قَالَ لَا هِجْرَةَ بَعْدَ فَتْحِ مَكَّةَ وَلَكِنْ أُبَايِعُهُ عَلَى الْإِسْلَامِ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Yazid bin Zurai'] berkata; telah menceritakan kepada kami [Khalid Al Khadza'] dari [Abu 'Utsman] dari [Mujasyi 'bin Mas'ud] berkata; saya berkata; Wahai Rasulullah, ini adalah Mujalid 'bin Mas'ud berbaiat kepada anda untuk berhijrah. Beliau bersabda: \"Tidak ada hijrah setelah Fathu Makah tapi saya membaiatnya untuk Islam\"."
            },
            {
                "number": 666,
                "arab": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الْمَلِكِ بْنِ وَاقِدٍ قَالَ حَدَّثَنَا زُهَيْرٌ قَالَ حَدَّثَنَا عَاصِمٌ الْأَحْوَلُ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ مُجَاشِعٍ قَالَقَدِمْتُ بِأَخِي مَعْبَدٍ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ الْفَتْحِ فَقُلْتُ يَا رَسُولَ اللَّهِ جِئْتُكَ بِأَخِي لِتُبَايِعَهُ عَلَى الْهِجْرَةِ فَقَالَ ذَهَبَ أَهْلُ الْهِجْرَةِ بِمَا فِيهَا فَقُلْتُ عَلَى أَيِّ شَيْءٍ تُبَايِعُهُ قَالَ عَلَى الْإِسْلَامِ وَالْإِيمَانِ وَالْجِهَادِقَالَ فَلَقِيتُ مَعْبَدًا بَعْدُ وَكَانَ هُوَ أَكْبَرُهُمَا فَسَأَلْتُهُ فَقَالَ صَدَقَ مُجَاشِعٌ",
                "id": "Telah menceritakan kepada kami [Ahmad bin Abdul Malik bin Waqid] berkata; telah menceritakan kepada kami [Zuhair] berkata; telah menceritakan kepada kami ['Ashim Al Ahwal] dari [Abu 'Utsman An-Nahdi] dari [Mujasyi] berkata; saya bersama saudaraku Ma'bad, menemui Nabi Shallallahu'alaihiwasallam setelah Fathu Makah, lalu saya berkata; Wahai Rasulullah, saya membawa saudaraku agar anda membaiatnya untuk hijrah. Beliau bersabda: \"Orang yang berhijrah telah selesai dengan hijrahnya?\". Lalu saya berkata; terus untuk apa baiat anda kepadanya?. Beliau bersabda: \"Untuk Islam, iman dan jihad\". (Mujasyi Radliyallahu'anhu) berkata; saya bertemu [Ma'bad] setelah waktu yang lama, dia adalah orang yang paling dewasa di antara mereka, saya bertanya kepadanya, maka dia menjawab, Mujasyi' benar."
            },
            {
                "number": 667,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَلْقَمَةَ اللَّيْثِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِ عَلْقَمَةَ عَنْ بِلَالِ بْنِ الْحَارِثِ الْمُزَنِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الرَّجُلَ لَيَتَكَلَّمُ بِالْكَلِمَةِ مِنْ رِضْوَانِ اللَّهِ عَزَّ وَجَلَّ مَا يَظُنُّ أَنْ تَبْلُغَ مَا بَلَغَتْ يَكْتُبُ اللَّهُ عَزَّ وَجَلَّ لَهُ بِهَا رِضْوَانَهُ إِلَى يَوْمِ الْقِيَامَةِ وَإِنَّ الرَّجُلَ لَيَتَكَلَّمُ بِالْكَلِمَةِ مِنْ سَخَطِ اللَّهِ عَزَّ وَجَلَّ مَا يَظُنُّ أَنْ تَبْلُغَ مَا بَلَغَتْ يَكْتُبُ اللَّهُ عَزَّ وَجَلَّ بِهَا عَلَيْهِ سَخَطَهُ إِلَى يَوْمِ الْقِيَامَةِقَالَ فَكَانَ عَلْقَمَةُ يَقُولُ كَمْ مِنْ كَلَامٍ قَدْ مَنَعَنِيهِ حَدِيثُ بِلَالِ بْنِ الْحَارِثِ",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Muhammad bin 'Amr bin 'Alqamah Al Laitsi] dari [Bapaknya] dari [kakeknya] dari [Bilal bin Al Harits Al Muzni] berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \" ada seorang laki-laki yang hanya mengucapkan sepatah kata yang diridlai Allah Azzawajalla, dia tidak menduga (perkataan tersebut) pengaruhnya sampai sedemikian rupa hingga Allah Azzawajalla mencatatnya dalam keridlaan-Nya sampai Hari Kiamat. Sebaliknya ada seseorang yang mengucapkan sepatah kata yang dibenci Allah Azzawajalla, dia tidak menduga akibatnya sedemikian rupa hingga Allah menetapkan kemurkaan-Nya karena ucapan itu sampai Hari Kiamat\" (Bilal bin Al Harits Al Muzni Radliallahu'anhu) berkata; 'Alqamah berkata; berapa banyak perkataan yang saya tahan karena hadis Bilal bin Al Harits tersebut."
            },
            {
                "number": 668,
                "arab": "حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ قَالَ أَخْبَرَنِي ابْنُ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ عَنْ الْحَارِثِ بْنِ بِلَالٍ عَنْ أَبِيهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ فَسْخُ الْحَجِّ لَنَا خَاصَّةً أَمْ لِلنَّاسِ عَامَّةً قَالَ بَلْ لَنَا خَاصَّةً",
                "id": "Telah menceritakan kepada kami [Suraij bin An-Nu'man] berkata; telah menceritakan kepada kami [Abdul Aziz] yaitu Ibnu Muhammad, berkata; telah mengabarkan kepadaku [Ibnu Rabi'ah bin Abu Abdurrahman] dari [Al Harits bin Bilal] dari [Bapaknya] berkata; Saya berkata; \"Wahai Rasulullah, apakah perkara membatalkan haji dengan sengaja adalah sesuatu yang khusus buat kita atau untuk ummat secara umum?\" (Rasulullah Shallallahu'alaihiwasallam) menjawab, \"Itu hanya untuk kita secara khusus\""
            },
            {
                "number": 669,
                "arab": "حَدَّثَنِي قُرَيْشُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ الدَّرَاوَرْدِيُّ قَالَ أَخْبَرَنِي رَبِيعَةُ بْنُ أَبِي عَبْدِ الرَّحْمَنِ قَالَ سَمِعْتُ الْحَارِثَ بْنَ بِلَالِ بْنِ الْحَارِثِ يُحَدِّثُ عَنْ أَبِيهِ قَالَيَا رَسُولَ اللَّهِ أَرَأَيْتَ مُتْعَةَ الْحَجِّ لَنَا خَاصَّةً أَمْ لِلنَّاسِ عَامَّةً فَقَالَ لَا بَلْ لَنَا خَاصَّةً",
                "id": "Telah menceritakan kepadaku [Quraisy bin Ibrahim] berkata; telah menceritakan kepada kami [Abdul Aziz bin Ad-Darawardi] berkata; telah menceritakan kepadaku [Rabi'ah bin Abu Abdurrahman] berkata; saya telah mendengar [Al Harits bin Bilal bin Al Harits] menceritakan dari [Bapaknya] berkata; Wahai Rasulullah, bagaimana pendapat anda tentang Haji tamattu`, apakah khusus bagi kami atau untuk semua manusia?. Beliau bersabda: \"Itu hanya bagi kita\"."
            },
            {
                "number": 670,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ سَلَّامِ بْنِ شُرَحْبِيلَ عَنْ حَبَّةَ وَسَوَاءَ ابْنَيْ خَالِدٍ قَالَادَخَلْنَا عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يُصْلِحُ شَيْئًا فَأَعَنَّاهُ فَقَالَ لَا تَأْيَسَا مِنْ الرِّزْقِ مَا تَهَزَّزَتْ رُءُوسُكُمَا فَإِنَّ الْإِنْسَانَ تَلِدُهُ أُمُّهُ أَحْمَرَ لَيْسَ عَلَيْهِ قِشْرَةٌ ثُمَّ يَرْزُقُهُ اللَّهُ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] berkata; telah menceritakan kepada kami [Al A'masy] dari [Sallam bin Syurahbil] dari [Habbah] dan [Sawa'], dua anak Khalid berkata; Kami berdua menemui Nabi Shallallahu'alaihiwasallam, beliau sedang memperbaiki sesuatu, kami berkeluh kesah kepadanya, beliau bersabda: \"Janganlah kalian berputus asa dari rizqi Allah selama kepala kalian masih bergerak. manusia itu dilahirkan oleh ibunya dalam keadaan merah, tidak memiliki suatu apapun, lalu Allah Azzawajalla memberinya rizqi\""
            },
            {
                "number": 671,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ سَلَّامٍ أَبِي شُرَحْبِيلَ قَالَ سَمِعْتُ حَبَّةَ وَسَوَاءَ ابْنَيْ خَالِدٍ يَقُولَانِأَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَعْمَلُ عَمَلًا أَوْ يَبْنِي بِنَاءً فَأَعَنَّاهُ عَلَيْهِ فَلَمَّا فَرَغَ دَعَا لَنَا وَقَالَ لَا تَأْيَسَا مِنْ الْخَيْرِ مَا تَهَزَّزَتْ رُءُوسُكُمَا إِنَّ الْإِنْسَانَ تَلِدُهُ أُمُّهُ أَحْمَرَ لَيْسَ عَلَيْهِ قِشْرَةٌ ثُمَّ يُعْطِيهِ اللَّهُ وَيَرْزُقُهُ",
                "id": "Telah menceritakan kepada kami [Waki'] berkata; telah menceritakan kepada kami [Al A'masy] dari [Sallam Abu Syurahbil] berkata; saya telah mendengar [Habbah] dan [Sawa',] dua anak Khalid berkata; Kami berdua menemui Nabi Shallallahu'alaihiwasallam, beliau sedang memperbaiki sesuatu atau sedang membangun suatu bangunan, kami berkeluh kesah kepadanya. Tatkala beliau selesai, beliau memanggil kami dan beliau bersabda: \"Janganlah kalian berputus asa dari kebaikan, selama kepala kalian masih bisa bergerak. Manusia itu dilahirkan oleh ibunya dalam keadaan merah, tidak memiliki suatu apapun, lalu Allah Azzawajalla memberinya rizqi\""
            },
            {
                "number": 672,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا خَالِدٌ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَجَلَسْتُ إِلَى رَهْطٍ أَنَا رَابِعُهُمْ بِإِيلِيَاءَ فَقَالَ أَحَدُهُمْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَيَدْخُلَنَّ الْجَنَّةَ بِشَفَاعَةِ رَجُلٍ مِنْ أُمَّتِي أَكْثَرُ مِنْ بَنِي تَمِيمٍ قُلْنَا سِوَاكَ يَا رَسُولَ اللَّهِ قَالَ سِوَايَ قُلْتُ أَنْتَ سَمِعْتَهُ قَالَ نَعَمْ فَلَمَّا قَامَ قُلْتُ مَنْ هَذَا قَالُوا ابْنُ أَبِي الْجَدْعَاءِ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Ibrahim] berkata; telah menceritakan kepada kami [Khalid] dari [Abdullah bin Syaqiq] berkata; saya duduk bergabung dengan sekelompok orang, saya adalah orang yang keempat di Iliya', salah dari mereka berkata; saya mendengar Rasulullah bersabda: 'Akan masuk surga lantaran syafa'at seorang laki-laki dari umatku, yang jumlahnya lebih banyak dari Bani tamim\". Kami berkata; itu bukan anda Wahai Rasulullah? (Rasulullah Shallallahu'alaihiwasallam) bersabda: \"Ya, selainku\". Saya (Abdullah bin Syaqiq Radliyallahu'anhu) bertanya, apakah kamu mendengarnya langsung? Dia menjawab, Ya. Ketika dia berdiri, saya bertanya, \"Siapakah dia?\" mereka berkata; \"Itu adalah [Ibnu Abu Al Jad'a] '\"."
            },
            {
                "number": 673,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا خَالِدٌ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي الْجَدْعَاءِ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَيَدْخُلَنَّ الْجَنَّةَ بِشَفَاعَةِ رَجُلٍ مِنْ أُمَّتِي أَكْثَرُ مِنْ بَنِي تَمِيمٍ فَقَالُوا يَا رَسُولَ اللَّهِ سِوَاكَ قَالَ سِوَايَ سِوَايَقُلْتُ أَنْتَ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَنَا سَمِعْتُهُ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Wuhaib] berkata; telah menceritakan kepada kami [Khalid] dari [Abdullah bin Syaqiq] dari [Abdullah bin Abu Al Jad'a'] telah mendengar Nabi Shallallahu'alaihiwasallam bersabda: \"Sungguh akan masuk surga karena syafa'at seorang dari umatku jumlah yang lebih banyak daripada Bani tamim\". Mereka bertanya, Wahai Rasulullah, orang itu bukan anda? Beliau bersabda: \"Bukan saya, bukan saya\". (Khalid Radliyallahu'anhu) bertanya, apakah kamu mendengarnya dari Rasulullah Shallallahu'alaihiwasallam?. dia menjawab, ya saya mendengarnya langsung dari beliau."
            },
            {
                "number": 674,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ قَالَ أَخْبَرَنَا أَيُّوبُ عَنْ حُمَيْدِ بْنِ هِلَالٍ قَالَ قَالَ عُبَادَةُ بْنُ قُرْطٍإِنَّكُمْ لَتَأْتُونَ أُمُورًا هِيَ أَدَقُّ فِي أَعْيُنِكُمْ مِنْ الشَّعَرِ كُنَّا نَعُدُّهَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُوبِقَاتِقَالَ فَذُكِرَ ذَلِكَ لِمُحَمَّدِ بْنِ سِيرِينَ فَقَالَ صَدَقَ وَأَرَى جَرَّ الْإِزَارِ مِنْهَا",
                "id": "Telah menceritakan kepada kami [Isma'il] berkata; telah mengabarkan kepada kami [Ayyub] dari [Humaid bin Hilal] berkata; ['Ubadah bin Qurth] berkata; kalian akan menemui suatu urusan-urusan yang menurut pandangan kalian lebih sepele daripada halusnya rambut, padahal kami menganggapnya pada masa Rasulullah Shallallahu'alaihiwasallam termasuk hal yang membinasakan. ('Ubadah bin Qurth Radliyallahu'anhu) berkata; hal tersebut disampaikan kepada Muhammad bin Sirin, lalu dia berkata; \"Hal itu benar adanya, dan saya anggap memanjangkan sarung diatas mata kaki (diantara urusan yang dianggap sepele tersebut).\""
            },
            {
                "number": 675,
                "arab": "حَدَّثَنَا مُصْعَبُ بْنُ الْمِقْدَامِ وَمُحَمَّدُ بْنُ سَابِقٍ قَالَا حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي الْجُوَيْرِيَةِ أَنَّ مَعْنَ بْنَ يَزِيدَ حَدَّثَهُ قَالَبَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَأَبِي وَجَدِّي وَخَطَبَ عَلَيَّ فَأَنْكَحَنِي وَخَاصَمْتُ إِلَيْهِ فَكَانَ أَبِي يَزِيدُ خَرَجَ بِدَنَانِيرَ يَتَصَدَّقُ بِهَا فَوَضَعَهَا عِنْدَ رَجُلٍ فِي الْمَسْجِدِ فَأَخَذْتُهَا فَأَتَيْتُهُ بِهَا فَقَالَ وَاللَّهِ مَا إِيَّاكَ أَرَدْتُ بِهَا فَخَاصَمْتُهُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَكَ مَا نَوَيْتَ يَا يَزِيدُ وَلَكَ يَا مَعْنُ مَا أَخَذْتَ",
                "id": "Telah menceritakan kepada kami [Mush'ab bin Al Miqdam] dan [Muhammad bin Sabiq] berkata; telah menceritakan kepada kami [Isra'il] dari [Abu Al Juwairiyah] [Ma'n bin Yazid] menceritakannya, berkata; saya berbaiat kepada Rasulullah Shallallahu'alaihiwasallam bersama bapakku dan kakekku. (Rasulullah Shallallahu'alaihiwasallam) melamarkan untukku dan menikahkanku. Suatu ketika saya melapor kepada beliau, bapakku, Yazid keluar dari rumah dengan membawa beberapa dinar untuk bersedekah dengannya, dia meletakkannya di samping seorang laki-laki di masjid. Saya datang dan mengambil dinar tersebut, dan membawanya kembali kepadanya. Dia berkata; Demi Allah, saya tidak bermaksud untuk bersedekah kepadamu. Saya laporkan hal tersebut kepada Rasulullah Shallallahu'alaihiwasallam, beliau bersabda: \"Kamu mendapatkan pahala seperti yang kamu niatkan Wahai Yazid, dan kamu Ya Ma'n, kamu mendapatkan apa yang telah kau ambil\"."
            },
            {
                "number": 676,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَاصِمِ بْنِ كُلَيْبٍ قَالَ حَدَّثَنِي سُهَيْلُ بْنُ ذِرَاعٍ أَنَّهُ سَمِعَ مَعْنَ بْنَ يَزِيدَ أَوْ أَبَا مَعْنٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اجْتَمِعُوا فِي مَسَاجِدِكُمْ فَإِذَا اجْتَمَعَ قَوْمٌ فَلْيُؤْذِنُونِي قَالَ فَاجْتَمَعْنَا أَوَّلَ النَّاسِ فَأَتَيْنَاهُ فَجَاءَ يَمْشِي مَعَنَا حَتَّى جَلَسَ إِلَيْنَا فَتَكَلَّمَ مُتَكَلِّمٌ مِنَّا فَقَالَ الْحَمْدُ لِلَّهِ الَّذِي لَيْسَ لِلْحَمْدِ دُونَهُ مُقْتَصَرٌ وَلَيْسَ وَرَاءَهُ مَنْفَذٌ وَنَحْوًا مِنْ هَذَا فَغَضِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَامَ فَتَلَاوَمْنَا وَلَامَ بَعْضُنَا بَعْضًا فَقُلْنَا خَصَّنَا اللَّهُ بِهِ أَنْ أَتَانَا أَوَّلَ النَّاسِ وَأَنْ فَعَلَ وَفَعَلَ قَالَ فَأَتَيْنَاهُ فَوَجَدْنَاهُ فِي مَسْجِدِ بَنِي فُلَانٍ فَكَلَّمْنَاهُ فَأَقْبَلَ يَمْشِي مَعَنَا حَتَّى جَلَسَ فِي مَجْلِسِهِ الَّذِي كَانَ فِيهِ أَوْ قَرِيبًا مِنْهُ ثُمَّ قَالَ إِنَّ الْحَمْدَ لِلَّهِ مَا شَاءَ اللَّهُ جَعَلَ بَيْنَ يَدَيْهِ وَمَا شَاءَ جَعَلَ خَلْفَهُ وَإِنَّ مِنْ الْبَيَانِ سِحْرًا ثُمَّ أَقْبَلَ عَلَيْنَا فَأَمَرَنَا وَكَلَّمَنَا وَعَلَّمَنَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Hammad] berkata; telah menceritakan kepada kami [Abu 'Awanah] dari ['Ashim bin Kulaib] berkata; telah menceritakan kepadaku [Suhail bin Dzira'] dia mendengar [Ma'n bin Yazid] atau Abu Ma'n berkata; Rasulullah Shallallahu'alaihiwasallam bersabda: \"Berkumpullah kalian di masjid kalian, jika telah berkumpul suatu kaum maka mintalah izin kepadaku\". (Ma'an bin Yazid Radliyallahu'anhu) berkata; maka kita-lah orang pertama kali berkumpul lalu kami mendatangi beliau. Beliau datang dengan berjalan bersama kami, lalu duduk. Ada seseorang dari kami berkata; \"Segala puji bagi Allah, tidak ada bagi pujian selainnya\", --Ia mengucapkannya dengan di singkat-- dan setelahnya tidak ada jalan dan yang semisalnya. Rasulullah marah, beliau berdiri. Lalu kami saling mencela, dan saling menyalahkan satu kepada yang lainnya. lalu kami berkata; \"Allah mengkhususkan kita untuk datang pertama kali dan terjadilah ini semua\" (Ma'an bin Yazid radliyallahu'anhu) berkata; lalu kami mendatangi (Rasulullah Shallallahu'alaihiwasallam) dan kami mendapatinya di masjid Bani Fulan, lalu kami mengajak beliau berbicara, beliau berjalan bersama kami sehingga sampai di tempat yang beliau duduk sebelumnya atau dekat dengan itu, lalu beliau bersabda: \"Pujian itu bagi Allah, terserah kehendak-Nya, dijadikan-Nya di hadapan-Nya atau di belakang-Nya, dan di antara lafadz yang indah terdapat apa yang disebut sihir\", lalu beliau berdiri, menemui kami dan memerintahkan kepada kami serta berbicara dan mengajari kami."
            },
            {
                "number": 677,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ قَالَ حَدَّثَنَا عَاصِمُ بْنُ كُلَيْبٍ قَالَ حَدَّثَنِي أَبُو الْجُوَيْرِيَةِ قَالَأَصَبْتُ جَرَّةً حَمْرَاءَ فِيهَا دَنَانِيرُ فِي إِمَارَةِ مُعَاوِيَةَ فِي أَرْضِ الرُّومِ قَالَ وَعَلَيْنَا رَجُلٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ بَنِي سُلَيْمٍ يُقَالُ لَهُ مَعْنُ بْنُ يَزِيدَ قَالَ فَأَتَيْتُ بِهَا يَقْسِمُهَا بَيْنَ الْمُسْلِمِينَ فَأَعْطَانِي مِثْلَ مَا أَعْطَى رَجُلًا مِنْهُمْ ثُمَّ قَالَ لَوْلَا أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَأَيْتُهُ يَفْعَلُهُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا نَفْلَ إِلَّا بَعْدَ الْخُمُسِ إِذًا لَأَعْطَيْتُكَ قَالَ ثُمَّ أَخَذَ فَعَرَضَ عَلَيَّ مِنْ نَصِيبِهِ فَأَبَيْتُ عَلَيْهِ قُلْتُ مَا أَنَا بِأَحَقَّ بِهِ مِنْكَ",
                "id": "Telah menceritakan kepada kami ['Affan] berkata; telah menceritakan kepada kami [Abu 'Awanah] berkata; telah menceritakan kepada kami ['Ashim bin Kulaib] berkata telah menceritakan kepadaku [Abu Al Juwairiyah] berkata; Saya mendapat sebuah bejana mewah, berisi dinar yang banyak pada pemerintahan Mu'awiyah di tanah Rum. Kami dipimpin seorang sahabat dari Bani Sulaim yang bernama [Ma'an bin Yazid]. Saya mendatanginya dengan membawa bejana tersebut untuk dibagi kepada kaum muslimin, dia memberiku sebagaimana dia memberi kepada yang lainnya, lalu berkata; kalaulah saja saya tidak mendengar Rasulullah Shallallahu'alaihiwasallam -dan aku melihat beliau melakukan demikian-, saya mendengar Rasulullah Shallallahu'alaihiwasallam bersabda: 'Tidak ada rampasan perang kecuali setelah pembagian seperlima', niscaya saya akan memberimu\". (Abu Al Juwairiyah Radliyallahu'anhu) berkata; lalu dia menunjukkan bagiannya kepadaku, namun saya menolaknya dan saya katakan, saya tidaklah lebih berhak darimu."
            },
            {
                "number": 678,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ وَسُرَيْجُ بْنُ النُّعْمَانِ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ أَبِي الْجُوَيْرِيَةِ قَالَ حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ قَالَ حَدَّثَنَا أَبُو الْجُوَيْرِيَةِ عَنْ مَعْنِ بْنِ يَزِيدَ قَالَبَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا وَأَبِي وَجَدِّي وَخَاصَمْتُ إِلَيْهِ فَأَفْلَجَنِي وَخَطَبَ عَلَيَّ فَأَنْكَحَنِي",
                "id": "Telah menceritakan kepada kami [Hisyam bin Abdul Malik] dan [Suraij bin An-Nu'man] berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Abu Al Juwairiyah] berkata; Telah menceritakan kepada kami ['Affan] berkata; telah menceritakan kepada kami [Abu 'Awanah] berkata; telah menceritakan kepada kami [Abu Al Juwairiyah] dari [Ma'n bin Yazid] berkata; saya berbaiat kepada Rasulullah Shallallahu'alahiwasallam bersama dengan bapakku dan kakekku, saya membantah beliau, hanya beliau mengalahkanku, bahkan melamarkan untukku dan menikahkanku."
            },
            {
                "number": 679,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَنْبَأَنَا سُفْيَانُ عَنْ جَابِرٍ عَنْ الشَّعْبِيِّ عَنْ عَبْدِ اللَّهِ بْنِ ثَابِتٍ قَالَجَاءَ عُمَرُ بْنُ الْخَطَّابِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي مَرَرْتُ بِأَخٍ لِي مِنْ بَنِي قُرَيْظَةَ فَكَتَبَ لِي جَوَامِعَ مِنْ التَّوْرَاةِ أَلَا أَعْرِضُهَا عَلَيْكَ قَالَ فَتَغَيَّرَ وَجْهُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَبْدُ اللَّهِ فَقُلْتُ لَهُ أَلَا تَرَى مَا بِوَجْهِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ عُمَرُ رَضِينَا بِاللَّهِ رَبًّا وَبِالْإِسْلَامِ دِينًا وَبِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَسُولًا قَالَ فَسُرِّيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَوْ أَصْبَحَ فِيكُمْ مُوسَى ثُمَّ اتَّبَعْتُمُوهُ وَتَرَكْتُمُونِي لَضَلَلْتُمْ إِنَّكُمْ حَظِّي مِنْ الْأُمَمِ وَأَنَا حَظُّكُمْ مِنْ النَّبِيِّينَ",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] berkata; telah memberitakan kepada kami [Sufyan] dari [Jabir] dari [Asy-Sya'bi] dari [Abdullah bin Tsabit] berkata; 'Umar bin Khathab datang kepada Nabi Shallallahu'alaihiwasallam lalu berkata; \"Wahai Rasulullah, saya pernah bertemu dengan saudaraku dari Bani Quraidzah, lalu dia mencatatkan untukku ringkasan kitab Taurat, maukah saya tunjukkan kepada anda? (Abdullah bin Tsabit Radliyallahu'anhu) berkata; kontan wajah Rasulullah Shallallahu'alahiwasallam berubah. Saya bertanya kepada ('Umar Radliyallahu'anhu) tidakkah kau melihat gerangan yang terjadi pada wajah Rasulullah Shallallahu'alahiwasallam? Umar bergegas berkata; \" Kami ridla Allah sebagai Rabb kami, Islam sebagai agama dan Muhammad Shallallahu'alaihiwasallam sebagai seorang Rasul\". Serta merta hilanglah kesedihan dari Nabi Shallallahu'alaihiwasallam lalu bersabda: \"Sungguh Demi Dzat yang jiwaku berada di tangan-Nya, kalaulah di antara kalian terdapat Musa, lalu kalian mengikutinya dan meninggalkanku, sungguh kalian sesat. Sungguh kalian adalah umat yang diperuntukkan bagiku, dan aku adalah nabi yang diperuntukkan bagi kalian'."
            },
            {
                "number": 680,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَاقَ عَنْ رَجُلٍ مِنْ جُهَيْنَةَ قَالَسَمِعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَقُولُ يَا حَرَامُ فَقَالَ يَا حَلَالُ",
                "id": "Telah menceritakan kepada kami [Yahya bin 'Adam] berkata; telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [seorang laki-laki dari Juhainah] berkata; Nabi Shallallahu'alaihiwasallam mendengarnya berkata; 'Wahai Haram', beliau bersabda: 'Wahai Halal.'"
            },
            {
                "number": 681,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ آدَمَ قَالَ حَدَّثَنَا عِصَامُ بْنُ قُدَامَةَ الْبَجَلِيُّ قَالَ حَدَّثَنِي مَالِكُ بْنُ نُمَيْرٍ الْخُزَاعِيُّ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ قَاعِدٌ فِي الصَّلَاةِ قَدْ وَضَعَ ذِرَاعَهُ الْيُمْنَى عَلَى فَخِذِهِ الْيُمْنَى رَافِعًا بِأُصْبُعِهِ السَّبَّابَةِ قَدْ حَنَاهَا شَيْئًا وَهُوَ يَدْعُو",
                "id": "Telah menceritakan kepada kami [Yahya bin 'Adam] berkata; telah menceritakan kepada kami [Isham bin Qudamah Al Bajali] berkata; telah menceritakan kepadaku [Malik bin Numair Al Khuza'i] dari [bapaknya] berkata; saya melihat Rasulullah Shallallahu'alahiwasallam sholat dalam keadaan duduk dan meletakkan lengan kanan tangan beliau diatas paha kanan dengan mengangkat jari tengahnya dan memiringkannya, beliau dalam keadaan berdo'a."
            },
            {
                "number": 682,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عِصَامُ بْنُ قُدَامَةَ عَنْ مَالِكِ بْنِ نُمَيْرٍ الْخُزَاعِيِّ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاضِعًا يَدَهُ الْيُمْنَى عَلَى فَخِذِهِ الْيُمْنَى فِي الصَّلَاةِ يُشِيرُ بِأُصْبُعِهِ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Isham bin Qudamah] dari [Malik bin Numair Al Khuza'i] dari [bapaknya] berkata; saya melihat Rasulullah Shallallahu'alahiwasallam meletakkan tangan kanannya diatas paha kanan dalam sholat dengan memberi isyarat dengan jarinya."
            },
            {
                "number": 683,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ أَبَا إِسْرَائِيلَ قَالَ سَمِعْتُ جَعْدَةَ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَأَى رَجُلًا سَمِينًا فَجَعَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُومِئُ إِلَى بَطْنِهِ بِيَدِهِ وَيَقُولُ لَوْ كَانَ هَذَا فِي غَيْرِ هَذَا الْمَكَانِ لَكَانَ خَيْرًا لَكَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] berkata; saya telah mendengar [Abu Isra'il] berkata; saya telah mendengar [Ja'dah] berkata; saya telah mendengar Nabi Shallallahu'alaihiwasallam, beliau melihat seorang laki-laki yang gemuk, lalu Nabi Shallallahu'alaihiwasallam menunjuk ke arah perutnya dengan tangannya bersabda: \"Duhh, kalau kegemukannya tidak di perut, niscaya lebih bagus bagimu\""
            },
            {
                "number": 684,
                "arab": "قَالَوَأُتِيَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِرَجُلٍ فَقَالُوا هَذَا أَرَادَ أَنْ يَقْتُلَكَ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ تُرَعْ لَمْ تُرَعْ وَلَوْ أَرَدْتَ ذَلِكَ لَمْ يُسَلِّطْكَ اللَّهُ عَلَيَّ",
                "id": "[Ja'dah Radliyallahu'anhu] berkata; diserahkan kepada Nabi Shallallahu'alaihiwasallam seorang laki-laki, lalu mereka berkata; 'Orang ini hendak membunuh anda.' Nabi Shallallahu'alaihiwasallam bersabda kepadanya, \"Tidakkah kau takut, tidakkah kau takut, kalau kau menghendaki hal itu, niscaya Allah tidak akan memberimu jalan untuk menguasaiku\"."
            },
            {
                "number": 685,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا شُعْبَةُ حَدَّثَنَا أَبُو إِسْرَائِيلَ فِي بَيْتِ قَتَادَةَ قَالَ سَمِعْتُ جَعْدَةَ وَهُوَ مَوْلَى أَبِي إِسْرَائِيلَ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَجُلٌ يَقُصُّ عَلَيْهِ رُؤْيَا وَذَكَرَ سِمَنَهُ وَعِظَمَهُ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ كَانَ هَذَا فِي غَيْرِ هَذَا كَانَ خَيْرًا لَكَ",
                "id": "Telah menceritakan kepada kami [Abdusshamad] telah menceritakan kepada kami [Syu'bah] telah menceritakan kepada kami [Abu Isra'il] di rumah Qatadah, berkata; saya mendengar [Ja'dah] yaitu budak bani Isra'il, berkata; saya pernah melihat Rasulullah Shallallahu'alahiwasallam dan seorang laki-laki yang menceritakan mimpinya, dia menyebutkan kegemukan dan kebesaran badannya. Lalu Rasulullah Shallallahu'alahiwasallam bersabda kepadanya, \"Duhh, kalau saja kegemukannya tidak di perut, itu lebih baik bagimu.\""
            },
            {
                "number": 686,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ الشَّعْبِيِّ عَنْ مُحَمَّدِ بْنِ صَفْوَانَأَنَّهُ صَادَ أَرْنَبَيْنِ فَلَمْ يَجِدْ حَدِيدَةً يَذْبَحُهُمَا بِهَا فَذَبَحَهُمَا بِمَرْوَةٍ فَأَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَرَهُ بِأَكْلِهِمَاحَدَّثَنَا يَزِيدُ قَالَ أَخْبَرَنَا دَاوُدُ يَعْنِي ابْنَ أَبِي هِنْدٍ عَنْ عَامِرٍ عَنْ مُحَمَّدِ بْنِ صَفْوَانَ أَنَّهُ مَرَّ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَرْنَبَيْنِ مُعَلِّقُهُمَا فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Ja'far] telah menceritakan kepada kami [Syu'bah] dari ['Ashim Al Ahwal] dari [Asy-Sya'bi] dari [Muhammad bin Shafwan], dia pernah berburu dua ekor kelinci, lalu tidak mendapatkan besi untuk menyembelihnya, dia pun menyembelihnya dengan sebuah batu putih yang tajam, ia datang menemui Rasulullah Shallallahu'alahiwasallam, beliau memerintahkanya untuk memakan buruannya. Telah menceritakan kepada kami [Yazid] berkata; telah mengabarkan kepada kami [Daud] yaitu Ibnu Abu Hind, dari ['Amir] dari [Muhammad bin Shafwan] sesungguhnya dia melewati Rasulullah Shallallahu'alahiwasallam dengan membawa dua buah kelinci yang tergantung\", lalu menyebutkan secara makna."
            },
            {
                "number": 687,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ عَنْ شَرِيكٍ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ أَبِي رَوْحٍ الْكَلَاعِيِّ قَالَصَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةً فَقَرَأَ فِيهَا سُورَةَ الرُّومِ فَلَبَسَ عَلَيْهِ بَعْضُهَا قَالَ إِنَّمَا لَبَسَ عَلَيْنَا الشَّيْطَانُ الْقِرَاءَةَ مِنْ أَجْلِ أَقْوَامٍ يَأْتُونَ الصَّلَاةَ بِغَيْرِ وُضُوءٍ فَإِذَا أَتَيْتُمْ الصَّلَاةَ فَأَحْسِنُوا الْوُضُوءَحَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ قَالَ سَمِعْتُ شَبِيبًا أَبَا رَوْحٍ يُحَدِّثُ عَنْ رَجُلٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى الصُّبْحَ فَقَرَأَ فِيهَا الرُّومَ فَأَوْهَمَ فَذَكَرَهُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Yunus] dari [Syarik] dari [Abdul Malik bin 'Umair] dari [Abu Rauh Al Kalla'i] berkata; Rasulullah Shallallahu'alahiwasallam sholat bersama kami, membaca surat Ar Rum. Beliau mengalami kebingungan pada sebagian surat yang dibaca, dan bersabda: \"Yang membuat kita bingung pada waktu membaca surat dalam sholat adalah setan, disebabkan kaum yang mendirikan sholat tanpa berwudlu. Jika kalian mendatangi sholat, perbaguslah wudlu \" Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abdul Malik bin 'Umair] berkata; saya telah mendengar [Syabib, Abu Rauh] menceritakan dari [salah seorang sahabat Nabi Shallallahu'alaihiwasallam], dari Nabi Shallallahu'alaihiwasallam, beliau sholat subuh, membaca surat Ar Rum, lalu beliau mengalami kebingungan, lalu dia menyebutkan secara lengkap."
            },
            {
                "number": 688,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا زَائِدَةُ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ قَالَ سَمِعْتُ شَبِيبًا أَبَا رَوْحٍ مِنْ ذِي الْكَلَاعِ عَنْ رَجُلٍأَنَّهُ صَلَّى مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصُّبْحَ فَقَرَأَ بِالرُّومِ فَتَرَدَّدَ فِي آيَةٍ فَلَمَّا انْصَرَفَ قَالَ إِنَّهُ يَلْبِسُ عَلَيْنَا الْقُرْآنَ أَنَّ أَقْوَامًا مِنْكُمْ يُصَلُّونَ مَعَنَا لَا يُحْسِنُونَ الْوُضُوءَ فَمَنْ شَهِدَ الصَّلَاةَ مَعَنَا فَلْيُحْسِنْ الْوُضُوءَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Abu Sa'id] budak Bani Hasyim telah menceritakan kepada kami [Za'idah] telah menceritakan kepada kami [Abdul Malik bin 'Umair] berkata; saya mendengar [Syabib, Abu Rauh, dari Dzil Kala'i] dari seseorang, ia sholat subuh bersama Nabi Shallallahu'alaihiwasallam, lalu beliau membaca surat Ar Rum, beliau mengalami keragu-raguan pada beberapa ayat. Tatkala selesai, beliau bersabda: \"(Setan) itu mengganggu pada bacaan al-qur'an, sungguh ada satu kaum dari kalian yang sholat bersama kami namun tidak melakukan wudlu dengan baik. Barangsiapa yang mengikuti sholat bersama kami, tolong perbaguslah wudlunya\"."
            },
            {
                "number": 689,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا أَبُو مَالِكٍ الْأَشْجَعِيُّ عَنْ أَبِيهِ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَقُولُ لِقَوْمٍ مَنْ وَحَّدَ اللَّهَ تَعَالَى وَكَفَرَ بِمَا يُعْبَدُ مِنْ دُونِهِ حَرُمَ مَالُهُ وَدَمُهُ وَحِسَابُهُ عَلَى اللَّهِ عَزَّ وَجَلَّقَالَ أَبِي حَدَّثَنَا بِهِ يَزِيدُ بِوَاسِطٍ وَبَغْدَادَ قَالَ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata; telah mengabarkan kepada kami [Abu Malik Al Asyja'i] dari [Bapaknya] sesungguhnya dia mendengar Nabi Shallallahu'alaihiwasallam bersabda kepada suatu kaum: 'Barangsiapa memurnikan ibadah hanya kepada Allah dan mengufuri apa yang disembah selain-Nya, haram harta dan darahnya, dan perhitungannya menjadi urusan Allah Azzawajalla. Bapaknya berkata; telah menceritakan kepada kami dengan hadits itu, Yazid di Wasith dan Bahgdad. Dia berkata; mendengar Nabi Shallallahu'alaihiwasallam."
            },
            {
                "number": 690,
                "arab": "قَالَ أَبِي حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ بِبَغْدَادَ أَنْبَأَنَا أَبُو مَالِكٍ الْأَشْجَعِيُّ سَعْدُ بْنُ طَارِقٍ عَنْ أَبِيهِأَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِحَسْبِ أَصْحَابِي الْقَتْلُ",
                "id": "bapakku berkata; telah menceritakan kepada kami [Yazid bin Harun] di Baghdad, telah memberitakan kepada kami [Abu Malik Al Asyja'i, Sa'd bin Thariq] dari [bapaknya] sesungguhnya dia mendengar Nabi Shallallahu'alaihiwasallam bersabda: \"Perkara yang menyibukkan para sahabatku adalah perang\""
            },
            {
                "number": 691,
                "arab": "قَالَ أَبِي حَدَّثَنَا يَزِيدُ قَالَ أَخْبَرَنَا أَبُو مَالِكٍ الْأَشْجَعِيُّ قَالَ حَدَّثَنِي أَبِيأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا أَتَاهُ الْإِنْسَانُ يَقُولُ كَيْفَ يَا رَسُولَ اللَّهِ أَقُولُ حِينَ أَسْأَلُ رَبِّي قَالَ قُلْ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَاهْدِنِي وَارْزُقْنِي وَقَبَضَ أَصَابِعَهُ الْأَرْبَعَ إِلَّا الْإِبْهَامَ فَإِنَّ هَؤُلَاءِ يَجْمَعْنَ لَكَ دُنْيَاكَ وَآخِرَتَكَ",
                "id": "bapakku berkata; telah menceritakan kepada kami [Yazid] telah mengabarkan kepada kami [Abu Malik Al Asyja'i] berkata; telah menceritakan kepadaku [bapakku] sesungguhnya dia mendengar Rasulullah Shallallahu'alahiwasallam bersabda ketika datang padanya seseorang, \"Bagaimana Rasulullah, apa yang harus saya katakan ketika berdo'a meminta kepada Rabbku?\". Beliau bersabda: \"Ya Allah, ampunilah aku, kasihanilah aku, tunjukilah aku dan berilah aku rizqi\" dengan menggenggam keempat jarinya kecuali jempolnya. Keempat hal itu telah menghimpun perkara dunia dan akheratmu."
            },
            {
                "number": 692,
                "arab": "قَالَوَسَمِعْتُهُ يَقُولُ لِلْقَوْمِ مَنْ وَحَّدَ اللَّهَ وَكَفَرَ بِمَا يُعْبَدُ مِنْ دُونِهِ حَرُمَ مَالُهُ وَدَمُهُ وَحِسَابُهُ عَلَى اللَّهِ عَزَّ وَجَلَّ",
                "id": "[Thariq Radliyallahu'anhu] berkata; saya telah mendengar (Rasulullah Shallallahu'alahiwasallam) bersabda kepada suatun kaum, \"Barangsiapa yang mengesakan Allah dan mengingkari apa yang disembah selain Dia, harta dan darahnya haram. Adapun hisabnya adalah kewajiban Allah Azzawajalla\"."
            },
            {
                "number": 693,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا أَبُو مَالِكٍ قَالَقُلْتُ لِأَبِي يَا أَبَتِ إِنَّكَ قَدْ صَلَّيْتَ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ وَعَلِيٍّ هَاهُنَا بِالْكُوفَةِ قَرِيبًا مِنْ خَمْسِ سِنِينَ أَكَانُوا يَقْنُتُونَ قَالَ أَيْ بُنَيَّ مُحْدَثٌ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata; telah mengabarkan kepada kami [Abu Malik] berkata; Saya berkata kepada [bapakku], Wahai bapakku, engkau pernah sholat di belakang Rasulullah Shallallahu'alahiwasallam, Abu Bakar, 'Umar, 'Utsman dan 'Ali waktu di Kufah selama hampir lima tahun, lalu apakah mereka melakukan Qunut? Dia berkata; 'Wahai anakku, itu adalah perkara yang baru."
            },
            {
                "number": 694,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ حَدَّثَنَا خَلَفٌ يَعْنِي ابْنَ خَلِيفَةَ عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ رَآنِي فِي الْمَنَامِ فَقَدْ رَآنِي",
                "id": "Telah menceritakan kepada kami [Husain bin Muhammad] telah menceritakan kepada kami [Khalaf] yaitu Ibnu Khalifah, dari [Abu Malik Al Asja'i] dari [Bapaknya] berkata; Rasulullah Shallallahu'alahiwasallam bersabda: \"Barangsiapa melihatku dalam mimpi, sungguh dia telah melihatku\"."
            },
            {
                "number": 695,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ حَدَّثَنَا أَبُو مَالِكٍ الْأَشْجَعِيُّ قَالَ حَدَّثَنِي أَبِي طَارِقُ بْنُ أَشْيَمَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَلِّمُ مَنْ أَسْلَمَ يَقُولُ اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَارْزُقْنِي وَهُوَ يَقُولُ هَؤُلَاءِ يَجْمَعْنَ لَكَ خَيْرَ الدُّنْيَا وَالْآخِرَةِ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Abdul Wahid] yaitu Ibnu Ziyad, telah menceritakan kepada kami [Abu Malik Al Asyja'i] dari [Abu Thariq bin Asyyam] berkata saya mendengar Rasulullah Shallallahu'alahiwasallam mengajar orang-orang yang masuk Islam untuk mengatakan, \"Ya Allah, ampunilah aku, kasihanilah aku dan berilah aku rizqi\" dan beliau berkata; semua hal itu telah menghimpun kebaikan dunia dan akheratmu."
            },
            {
                "number": 696,
                "arab": "حَدَّثَنَا بَكْرُ بْنُ عِيسَى أَبُو بِشْرٍ الْبَصْرِيُّ الرَّاسِبِيُّ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ قَالَ حَدَّثَنَا أَبُو مَالِكٍ الْأَشْجَعِيُّ قَالَ سَمِعْتُ أَبِي وَسَأَلْتُهُ فَقَالَكَانَ خِضَابُنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْوَرْسَ وَالزَّعْفَرَانَ",
                "id": "Telah menceritakan kepada kami [Bakr bin 'Isa, Abu Bisyr Al Bashri Ar Rasibi] berkata; telah menceritakan kepada kami [Abu 'Awanah] berkata; telah menceritakan kepada kami [Abu Malik Al Asyja'i] berkata; saya mendengar [bapakku] dan saya menanyakannya, maka dia berkata; semir rambut kami bersama Rasulullah Shallallahu'alahiwasallam adalah waras (sejenis tanaman berwarna kuning yang mempunyai bau wangi) dan Za'faran."
            },
            {
                "number": 697,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ عَمْرِو بْنِ حَسَّانَ يَعْنِي الْمُسْلِيَّ قَالَ حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ اللَّهِ الْيَشْكُرِيُّ عَنْ أَبِيهِ قَالَدَخَلْتُ مَسْجِدَ الْكُوفَةِ أَوَّلَ مَا بُنِيَ مَسْجِدُهَا وَهُوَ فِي أَصْحَابِ التَّمْرِ يَوْمَئِذٍ وَجُدُرُهُ مِنْ سِهْلَةٍ فَإِذَا رَجُلٌ يُحَدِّثُ النَّاسَ قَالَ بَلَغَنِي حَجَّةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَجَّةُ الْوَدَاعِ فَاسْتَتْبَعْتُ رَاحِلَةً مِنْ إِبِلِي ثُمَّ خَرَجْتُ حَتَّى جَلَسْتُ لَهُ فِي طَرِيقِ عَرَفَةَ أَوْ وَقَفْتُ لَهُ فِي طَرِيقِ عَرَفَةَ قَالَ فَإِذَا رَكْبٌ عَرَفْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِمْ بِالصِّفَةِ فَقَالَ رَجُلٌ أَمَامَهُ خَلِّ لِي عَنْ طَرِيقِ الرِّكَابِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيْحَهُ فَأَرَبٌ مَا لَهُ فَدَنَوْتُ مِنْهُ حَتَّى اخْتَلَفَتْ رَأْسُ النَّاقَتَيْنِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ دُلَّنِي عَلَى عَمَلٍ يُدْخِلُنِي الْجَنَّةَ وَيُنْجِينِي مِنْ النَّارِ قَالَ بَخٍ بَخٍ لَئِنْ كُنْتَ قَصَّرْتَ فِي الْخُطْبَةِ لَقَدْ أَبْلَغْتَ فِي الْمَسْأَلَةِ افْقَهْ إِذًا تَعْبُدُ اللَّهَ عَزَّ وَجَلَّ لَا تُشْرِكُ بِهِ شَيْئًا وَتُقِيمُ الصَّلَاةَ وَتُؤَدِّي الزَّكَاةَ وَتَحُجُّ الْبَيْتَ وَتَصُومُ رَمَضَانَ خَلِّ طَرِيقَ الرِّكَابِحَدَّثَنَا وَكِيعٌ عَنْ يُونُسَ قَالَ سَمِعْتُ هَذَا الْحَدِيثَ مِنْ الْمُغِيرَةِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ نَحْوَهُ حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ أَبِي إِسْحَاقَ عَنِ الْمُغِيرَةِ عَنْ أَبِيهِ قَالَ انْتَهَيْتُ إِلَى رَجُلٍ يُحَدِّثُ قَوْمًا فَجَلَسْتُ فَقَالَ وُصِفَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا بِمِنًى غَادِيًا إِلَى عَرَفَاتٍ فَذَكَرَ الْحَدِيثَ فَقُلْتُ يَا رَسُولَ اللَّهِ خَبِّرْنِي بِعَمَلٍ يُقَرِّبُنِي مِنْ الْجَنَّةِ وَيُبَاعِدُنِي مِنْ النَّارِ قَالَ تُقِيمُ الصَّلَاةَ وَتُؤْتِي الزَّكَاةَ وَتَحُجُّ الْبَيْتَ وَتَصُومُ رَمَضَانَ وَتُحِبُّ لِلنَّاسِ مَا تُحِبُّ أَنْ يُؤْتَى إِلَيْكَ وَتَكْرَهُ لَهُمْ مَا تَكْرَهُ أَنْ يُؤْتَى إِلَيْكَ خَلِّ عَنْ وُجُوهِ الرِّكَابِ",
                "id": "Telah menceritakan kepada kami [Waki'] dari ['Amr bin Hassan] yaitu Al Musli, berkata; telah menceritakan kepada kami [Al Mughirah bin Abdullah Al Yaskuri] dari [bapaknya] berkata; saya masuk masjid Kufah ketika pertama kali dibangun, ketika itu berada di kebun-kebun pemilik kurma, dindingnya dari tanah liat. Tiba-tiba ada seorang laki-laki yang berbicara kepada orang-orang. Ia berkata; telah sampai kabar kepadaku rencana haji Rasulullah Shallallahu'alahiwasallam tepatnya haji wada'. Saya pun ingin mengikutinya dengan untaku, saya keluar sampai saya bisa duduk menunggu di sebuah jalan Arafah, atau saya menunggunya di jalan Arafah. (laki-laki itu) berkata; ternyata ada serombongan orang yang saya tahu persis bahwa Rasulullah Shallallahu'alahiwasallam bersamanya. Lalu ada seorang laki-laki di depan beliau yang berkata 'Kosongkanlah jalan untukku dari para penunggang.' Nabi Shallallahu'alaihiwasallam bersabda: \"Celakalah dia, apa hak dia?\" lalu saya mendekati beliau sehingga kepala dua unta kami bertemu. Saya berkata; \"Wahai Rasulullah, tunjukkan kepadaku suatu amal yang dapat memasukkanku ke surga dan menyelamatkanku dari api neraka?\" (Rasulullah Shallallahu'alahiwasallam) bersabda: \"Yah, yah, kamu telah meringkas isi khutbah, kamu menanyakan hal yang sangat mengena, kalau begitu, pahamilah. Kamu beribadah kepada Allah Azzawajalla dan kamu tidak menyekutukan-nya dengan suatu apapun, kamu mendirikan sholat, menunaikan zakat, berhaji ke Baitullah, serta puasa ramadhan, berikanlah jalan untukku\". Telah menceritakan kepada kami [Waki'] dari [Yunus] berkata; saya mendengar hadis ini dari [Al Mughirah bin Abdullah] dari [bapaknya] sama yang di atas. Telah menceritakan kepada kami [Abdurrazzaq] berkata; telah menceritakan kepada kami [Ma'mar] dari [Abu Ishaq] dari [Al Mughirah bin Abdullah] dari [bapaknya] berkata; sampai selesai periwayatan hadis kepada [seorang laki-laki] yang bercerita tentang suatu kaum, lalu saya duduk, dia berkata; disebutkan sifat Rasulullah Shallallahu'alahiwasallam, dan saya berada di Mina untuk menuju ke Arafah, lalu menyebutkan hadits seperti diatas. Saya berkata; \"Wahai Rasulullah, kabarkanlah kepadaku suatu amalan yang mendekatkan diriku kepada surga dan menjauhkan diriku dari neraka\", beliau bersabda: \"Kamu mendirikan sholat, menunaikan zakat, berhaji ke Baitullah, puasa ramadhan, serta kamu menyukai manusia memperoleh suatu hal yang menyenangkan sebagaimana jika diberikan kepadamu, dan kamu susah seandainya manusia mendapat suatu hal menyusahkan sebagaimana jika ditimpakan kepadamu, minggirlah dari jalan ini\"."
            },
            {
                "number": 698,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ مُرَّةَ الطَّيِّبِ قَالَ حَدَّثَنِي رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غُرْفَتِي هَذِهِ حَسِبْتُ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ النَّحْرِ عَلَى نَاقَةٍ لَهُ حَمْرَاءَ مُخَضْرَمَةٍ فَقَالَ هَذَا يَوْمُ النَّحْرِ وَهَذَا يَوْمُ الْحَجِّ الْأَكْبَرِ",
                "id": "Telah menceritakan kepada kami [Waki'] berkata; telah menceritakan kepada kami [Syu'bah] dari ['Amr bin Murrah] dari [Murrah Ath-Tayib] berkata; telah menceritakan kepadaku, [salah seorang sahabat] Nabi Shallallahu'alaihiwasallam di kamarku menurutku, dia berkata; Rasulullah Shallallahu'alahiwasallam berpidato kepada kami, pada Hari Nahr di atas untanya yang berwarna merah yang dipotong ujung telinganya, beliau bersabda: \"Sekarang ini adalah Hari Nahr (penyembelihan) dan ini adalah Hari Haji terbesar\""
            },
            {
                "number": 699,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا مَعْمَرٌ عَنْ أَبِي إِسْحَاقَ عَنْ أَبِي الْأَحْوَصِ الْجُشَمِيِّ عَنْ أَبِيهِ قَالَ رَآنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَيَّ أَطْمَارٌ فَقَالَ هَلْ لَكَ مَالٌ قُلْتُ نَعَمْ قَالَ مِنْ أَيِّ الْمَالِ قُلْتُ مِنْ كُلِّ الْمَالِ قَدْ آتَانِي اللَّهُ عَزَّ وَجَلَّ مِنْ الشَّاءِ وَالْإِبِلِ قَالَ فَلْتُرَ نِعَمُ اللَّهِ وَكَرَامَتُهُ عَلَيْكَ فَذَكَرَ نَحْوَ حَدِيثِ شُعْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَاقَ قَالَ سَمِعْتُ أَبَا الْأَحْوَصِ يُحَدِّثُ عَنْ أَبِيهِ قَالَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا قَشِفُ الْهَيْئَةِ فَقَالَ هَلْ لَكَ مَالٌ قَالَ قُلْتُ نَعَمْ قَالَ مِنْ أَيِّ الْمَالِ قَالَ قُلْتُ مِنْ كُلِّ الْمَالِ مِنْ الْإِبِلِ وَالرَّقِيقِ وَالْخَيْلِ وَالْغَنَمِ فَقَالَ إِذَا آتَاكَ اللَّهُ مَالًا فَلْيُرَ عَلَيْكَ ثُمَّ قَالَ هَلْ تُنْتِجُ إِبِلُ قَوْمِكَ صِحَاحًا آذَانُهَا فَتَعْمَدُ إِلَى مُوسَى فَتَقْطَعُ آذَانَهَا فَتَقُولُ هَذِهِ بُحُرٌ وَتَشُقُّهَا أَوْ تَشُقُّ جُلُودَهَا وَتَقُولُ هَذِهِ صُرُمٌ وَتُحَرِّمُهَا عَلَيْكَ وَعَلَى أَهْلِكَ قَالَ نَعَمْ قَالَ فَإِنَّ مَا آتَاكَ اللَّهُ عَزَّ وَجَلَّ لَكَ وَسَاعِدُ اللَّهِ أَشَدُّ وَمُوسَى اللَّهِ أَحَدُّ وَرُبَّمَا قَالَ سَاعِدُ اللَّهِ أَشَدُّ مِنْ سَاعِدِكَ وَمُوسَى اللَّهِ أَحَدُّ مِنْ مُوسَاكَ قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رَجُلًا نَزَلْتُ بِهِ فَلَمْ يُكْرِمْنِي وَلَمْ يَقْرِنِي ثُمَّ نَزَلَ بِي أَجْزِيهِ بِمَا صَنَعَ أَمْ أَقْرِيهِ قَالَ اقْرِهِ",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] berkata; telah mengabarkan kepada kami [Ma'mar] dari [Abu Ishaq] dari [Abu Al Ahwash Al Jusami] dari [bapaknya] berkata; Rasulullah Shallallahu'alahiwasallam melihatku ketika saya memakai kain yang lusuh, lalu beliau bersabda kepadaku, \"Apakah engkau mempunyai harta?\" saya menjawab, \"Ya\". Beliau bertanya, dari mana harta itu semua?. Saya menjawab, \"Harta itu dari segala macam, sebagaimana Allah Azzawajalla telah memberiku dari kambing dan unta\", beliau bersabda: \"Perlihatkanlah, bahwa Allah telah memberimu nikmAt Nya dan dermawan-Nya kepadamu. Lalu ia menyebutkan seperti hadits Syu'bah. Telah menceritakan kepada kami [Muhammad bin Jafar] berkata; telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] berkata saya telah mendengar [Abu Al Ahwas] menceritakan dari [Bapaknya] berkata; Saya mendatangi Rasulullah Shallallahu'alahiwasallam dalam keadaan yang amburadul, lalu beliau bertanya, \"Apakah engkau mempunyai harta?\" lalu saya jawab, Ya. Beliau bertanya, dari mana saja hartamu? Saya menjawab, \"Dari banyak jalan, dari unta, gandum, kuda dan kambing\". Beliau bersabda: \"Jika Allah memberimu harta, maka perlihatkanlah\", beliau bersabda: \"Apakah unta pada kaummu melahirkan dalam keadaan sehat telinganya, lalu kamu mengambil pemotong lalu kamu potong telinganya, lalu kalian berkilah ini adalah suatu penyakit, lalu kamu membelahnya atau membelah kulitnya, dan kau katakan ini adalah adalah unta yang terpotong telinganya dan kamu haramkan atas diri kalian dan atas keluarga kalian?. Mereka menjawab, ya. (Rasulullah Shallallahu'alahiwasallam) bersabda: \"Sesungguhnya apa yang Allah Azzawajalla berikan kepadamu, itu adalah bagian untukmu, dan lengan Allah itu lebih keras, gunting Allah lebih tajam daripada guntingmu\" (Bapaknya Abu Al Ahwas Radliyallahu'anhu) berkata; Wahai Rasulullah, bagaimana pendapat anda tentang seseorang yang saya menginap dirumahnya namun dia tidak memuliakanku, dan tidak menyambutku?. Lalu dia mampir ke tempatku apakah saya membalas sebagaimana yang dia perbuat terhadapku atau saya sambut dia dengan baik?. Beliau bersabda: \"Sambutlah dengan baik.\""
            },
            {
                "number": 700,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا أَبِي وَإِسْرَائِيلُ عَنْ أَبِي إِسْحَاقَ عَنْ أَبِي الْأَحْوَصِ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ لَكَ مِنْ مَالٍ قَالَ قُلْتُ نَعَمْ مِنْ كُلِّ الْمَالِ قَدْ آتَانِي اللَّهُ عَزَّ وَجَلَّ مِنْ الْإِبِلِ وَمِنْ الْخَيْلِ وَالرَّقِيقِ قَالَ فَإِذَا آتَاكَ اللَّهُ عَزَّ وَجَلَّ خَيْرًا فَلْيُرَ عَلَيْكَ",
                "id": "Telah menceritakan kepada kami [Waki'] berkata; telah menceritakan kepada kami [bapakku] dan [Isra'il] dari [Abu Ishaq] dari [Abu Al Ahwash] dari [Bapaknya] berkata; Rasulullah Shallallahu'alahiwasallam bersabda: \"Apakah kamu memiliki harta?\" Dia menjawab, Ya. Dari harta yang Allah Azzawajalla memberikannya kepadaku, dari unta, dari kuda dan dari budak. Beliau bersabda: \"Jika Allah Azzawajalla memberikan kebaikan maka perlihatkanlah\"."
            },
            {
                "number": 701,
                "arab": "حَدَّثَنَا عُبَيْدَةُ بْنُ حُمَيْدٍ أَبُو عَبْدِ الرَّحْمَنِ التَّيْمِيُّ قَالَ حَدَّثَنَا أَبُو الزَّعْرَاءِ عَنْ أَبِي الْأَحْوَصِ عَنْ أَبِيهِ مَالِكِ بْنِ نَضْلَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَيْدِي ثَلَاثَةٌ فَيَدُ اللَّهِ الْعُلْيَا وَيَدُ الْمُعْطِي الَّتِي تَلِيهَا وَيَدُ السَّائِلِ السُّفْلَى فَأَعْطِ الْفَضْلَ وَلَا تَعْجَزْ عَنْ نَفْسِكَ",
                "id": "Telah menceritakan kepada kami ['Ubaidah bin Humaid, Abu Abdurrahman At Taimi] berkata; telah menceritakan kepada kami [Abu Za'ra] dari [Abu Al Ahwash] dari [Bapaknya, Malik bin Nadlah] berkata; Rasulullah Shallallahu'alahiwasallam bersabda: \"Tangan itu ada tiga: Tangan Allah paling tinggi, tangan orang yang memberi dan ini berada di tengah, lalu tangan orang yang meminta yang paling bawah, maka berikanlah kelebihan dan janganlah merasa dirimu lemah\"."
            },
            {
                "number": 702,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا شُعْبَةُ قَالَ أَبُو إِسْحَاقَ أَنْبَأَنَا قَالَ سَمِعْتُ أَبَا الْأَحْوَصِ يُحَدِّثُ عَنْ أَبِيهِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا قَشِيفُ الْهَيْئَةِ فَقَالَ هَلْ لَكَ مَالٌ قَالَ قُلْتُ نَعَمْ قَالَ فَمَا مَالُكَ فَقَالَ مِنْ كُلِّ الْمَالِ مِنْ الْخَيْلِ وَالْإِبِلِ وَالرَّقِيقِ وَالْغَنَمِ قَالَ فَإِذَا آتَاكَ اللَّهُ عَزَّ وَجَلَّ مَالًا فَلْيُرَ عَلَيْكَ فَقَالَ هَلْ تُنْتِجُ إِبِلُ قَوْمِكَ صِحَاحًا آذَانُهَا فَتَعْمَدُ إِلَى الْمُوسَى فَتَقْطَعُهَا أَوْ تَقْطَعُهَا وَتَقُولُ هَذِهِ بُحُرٌ وَتَشُقُّ جُلُودَهَا وَتَقُولُ هَذِهِ صُرُمٌ فَتُحَرِّمُهَا عَلَيْكَ وَعَلَى أَهْلِكَ قَالَ قُلْتُ نَعَمْ قَالَ كُلُّ مَا آتَاكَ اللَّهُ عَزَّ وَجَلَّ لَكَ حِلٌّ وَسَاعِدُ اللَّهِ أَشَدُّ وَمُوسَى اللَّهِ أَحَدُّ وَرُبَّمَا قَالَهَا وَرُبَّمَا لَمْ يَقُلْهَا وَرُبَّمَا قَالَ سَاعِدُ اللَّهِ أَشَدُّ مِنْ سَاعِدِكَ وَمُوسَى اللَّهِ أَحَدُّ مِنْ مُوسَاكَ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ رَجُلٌ نَزَلْتُ بِهِ فَلَمْ يَقْرِنِي وَلَمْ يُكْرِمْنِي ثُمَّ نَزَلَ بِي أَقْرِيهِ أَوْ أَجْزِيهِ بِمَا صَنَعَ قَالَ بَلْ اقْرِهِ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Syu'bah] [Abu Ishaq] berkata; telah memberitakan kepada kami, berkata; saya telah mendengar [Abu Al Ahwash] menceritakan dari [Bapaknya] berkata; saya menemui Nabi Shallallahu'alaihiwasallam dan saya keadaan sangat acak-acakan. Lalu beliau bertanya, \"Apakah engkau mempunyai harta?\" lalu saya menjawab, \"Ya\". Beliau bertanya, apa hartamu itu? Saya menjawab, \"Harta itu dari segala macam, dari kuda, dari unta, dari budak dan dari kambing \", beliau bersabda: \"Jika Allah Azzawajalla memberimu harta, tolong perlihatkanlah\". Lalu beliau bersabda: \"Apakah unta pada kaummu melahirkan dalam keadaan sehat telinganya, lalu kamu mengambil pemotong dan kamu potong telinganya, lalu kalian berkilah ini adalah suatu penyakit, lalu kamu membelahnya atau membelah kulitnya, dan kau katakan ini adalah adalah unta yang terpotong telinganya dan kamu haramkan atas dirimu dan atas keluargamu?. Saya menjawab, ya. (Rasulullah Shallallahu'alahiwasallam) bersabda: \"Sesungguhnya apa yang Allah Azzawajalla berikan kepadamu adalah halal bagimu, dan lengan Allah itu lebih keras, gunting Allah lebih tajam\" Terkadang menyebutnya dan terkadang tidak. Terkadang menyebutkan lengan Allah lebih keras daripada lenganmu, dan pemotong Allah lebih tajam daripada pemotongmu. (Bapaknya Abu Al Ahwas Radliyallahu'anhu) berkata; saya berkata; Wahai Rasulullah, bagaimana pendapat anda tentang seseorang yang saya menginap di rumahnya namun dia tidak memuliakanku, dan tidak menyambutku. Lalu dia mampir ke tempatku apakah saya membalas sebagaimana yang dia perbuat terhadapku atau saya sambut dia dengan baik?. Beliau bersabda: Sambutlah dengan baik\"."
            },
            {
                "number": 703,
                "arab": "حَدَّثَنَا بَهْزُ بْنُ أَسَدٍ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ عَنْ أَبِي الْأَحْوَصِأَنَّ أَبَاهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ أَشْعَثُ سَيِّئُ الْهَيْئَةِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَا لَكَ مَالٌ قَالَ مِنْ كُلِّ الْمَالِ قَدْ آتَانِي اللَّهُ عَزَّ وَجَلَّ قَالَ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ إِذَا أَنْعَمَ عَلَى عَبْدٍ نِعْمَةً أَحَبَّ أَنْ تُرَى عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Bahz bin 'Asad] berkata; telah menceritakan kepada kami [Hammad bin Salamah] berkata; telah mengabarkan kepada kami [Abdul Malik bin 'Umair] dari [Abu Al Ahwash] dari Bapaknya menemui Nabi Shallallahu'alaihiwasallam dan dia dalam kedaan berdebu dan sangat jelek keadaannya. Lalu Rasulullah Shallallahu'alahiwasallam bersabda kepadanya, tidak adakah harta padamu? Dia menjawab, dari setiap harta sungguh Allah Azzawajalla telah memberikan kepadaku. Beliau bersabda: \"Allah Azzawajalla jika memberi nikmat kepada hamba-Nya suka jika diperlihatkannya\"."
            },
            {
                "number": 704,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا ابْنُ أَبِي خَالِدٍ يَعْنِي إِسْمَاعِيلَ عَنْ أَبِيهِ قَالَدَخَلْتُ عَلَى رَجُلٍ وَهُوَ يَتَمَجَّعُ لَبَنًا بِتَمْرٍ فَقَالَ ادْنُ فَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمَّاهُمَا الْأَطْيَبَيْنِ",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Ibnu Abu Khalid] yaitu Isma'il, dari [Bapaknya] berkata; Saya menemui [seorang laki-laki yang sedang makan kurma] dengan susu, maka (Ismail Radliyallahu'anhu) berkata; \"Mendekatlah, sesungguhnya Rasulullah Shallallahu'alahiwasallam menamakan kedua barang tersebut (kurma dan susu) dengan dua yang paling baik\""
            },
            {
                "number": 705,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ زَاذَانَ أَبِي عُمَرَ قَالَ حَدَّثَنِي مَنْ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَيَقُولُ مَنْ لُقِّنَ عِنْدَ الْمَوْتِ لَا إِلَهَ إِلَّا اللَّهُ دَخَلَ الْجَنَّةَ",
                "id": "Telah menceritakan kepada kami [Hasan bin Musa] berkata; telah menceritakan kepada kami [Hammad bin Salamah bin Sa'ib] dari [Atho' bin Sa'ib] dari [Zadan Abu 'Umar] berkata; telah menceritakan kepadaku [seseorang yang mendengar Nabi] Shallallahu'alaihiwasallam bersabda: \"Barangsiapa yang di ditalqin pada waktu menjelang mati dengan LAA ILAAHA ILLAHLAAH, dia masuk surga\""
            },
            {
                "number": 706,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ عَنْ سُفْيَانَ عَنْ عَطَاءٍ يَعْنِي ابْنَ السَّائِبِ عَنْ رَجُلٍ مِنْ بَكْرِ بْنِ وَائِلٍ عَنْ خَالِهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَعْشِرُ قَوْمِي قَالَ إِنَّمَا الْعُشُورُ عَلَى الْيَهُودِ وَالنَّصَارَى وَلَيْسَ عَلَى أَهْلِ الْإِسْلَامِ عُشُورٌ",
                "id": "Telah menceritakan kepada kami [Abdurrahman] dari [Sufyan] dari ['Atho'] yaitu Ibnu As-Sa'ib dari [seseorang dari Bakr bin Wa'il] dari [pamannya] berkata; saya berkata; Wahai Rasulullah, apakah saya mengambil sepersepuluh harta kaumku?. Beliau bersabda: \"Sesungguhnya sepersepuluh itu hanya pada orang Yahudi dan Nasrani. Tidak ada pada pemeluk Islam diambil sepersepuluh\"."
            },
            {
                "number": 707,
                "arab": "قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ عَطَاءٍ عَنْ حَرْبِ بْنِ عُبَيْدِ اللَّهِ الثَّقَفِيِّ عَنْ خَالِهِ قَالَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ لَهُ أَشْيَاءَ فَسَأَلَهُ فَقَالَ أَعْشِرُهَا فَقَالَ إِنَّمَا الْعُشُورُ عَلَى الْيَهُودِ وَالنَّصَارَى وَلَيْسَ عَلَى أَهْلِ الْإِسْلَامِ عُشُورٌ",
                "id": "(Ahmad bin Hanbal Radliyallahu'anhu) berkata; telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari ['Atho'] dari [Harab 'ubaidhullah Ats-Staqafi] dari [pamannya] berkata; saya menemui Nabi Shallallahu'alaihiwasallam lalu disebutkan pada beliau sesuatu, pamanku bertanya kepada beliau dengan berkata; 'Apakah saya mengambil sepersepuluhnya?. Beliau bersabda: \"Sesungguhnya sepersepuluh itu hanya pada orang Yahudi dan Nasrani. Tidak ada pada pemeluk Islam diambil sepersepuluh hartanya\"."
            },
            {
                "number": 708,
                "arab": "حَدَّثَنَا جَرِيرٌ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ حَرْبِ بْنِ هِلَالٍ الثَّقَفِيِّ عَنْ أَبِي أُمِّهِ رَجُلٌ مِنْ بَنِي تَغْلِبَ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَيْسَ عَلَى الْمُسْلِمِينَ عُشُورٌ إِنَّمَا الْعُشُورُ عَلَى الْيَهُودِ وَالنَّصَارَى",
                "id": "Telah menceritakan kepada kami [Jarir] dari ['Atho' bin As-Sa'ib] dari [Harb bin Hilal Ats-Atsaqafi] dari [Bapak dari ibunya], yaitu seorang laki-laki dari Bani Taghlib, sesungguhnya telah mendengar Nabi Shallallahu'alaihiwasallam bersabda: \"Tidak ada atas kaum muslimin sepersepuluh Sesungguhnya sepersepuluh itu hanya pada orang Yahudi dan Nasrani\"."
            },
            {
                "number": 709,
                "arab": "حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو قَالَ حَدَّثَنَا زَائِدَةُ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِرَجُلٍ كَيْفَ تَقُولُ فِي الصَّلَاةِ قَالَ أَتَشَهَّدُ ثُمَّ أَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنْ النَّارِ أَمَا إِنِّي لَا أُحْسِنُ دَنْدَنَتَكَ وَلَا دَنْدَنَةَ مُعَاذٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَوْلَهَا نُدَنْدِنُ",
                "id": "Telah menceritakan kepada kami [Mu'awiyah bin 'Amr] berkata; telah menceritakan kepada kami [Za'idah] dari [Al 'Amsy] dari [Abu Shalih] dari [sebagian sahabat] Nabi Shallallahu'alaihiwasallam berkata; Nabi Shallallahu'alaihiwasallam bertanya kepada seorang laki-laki, \"Apa yang kau ucapkan dalam sholat\", maka dia menjawab, \"Saya bersyahadat lalu saya mengucapkan, 'Ya Allah, sesungguhnya saya meminta kepada-Mu surga dan berlindung diri kepada-Mu dari api neraka', saya tidak begitu tahu tentang yang ucapkan anda secara komat kamit apa yang dibaca Mu'adz\". Nabi Shallallahu'alaihiwasallam bersabda: \"Kurang lebih sebagaimana yang kau baca\"."
            },
            {
                "number": 710,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي عَبْدُ الْمَلِكِ بْنُ مَيْسَرَةَ قَالَ سَمِعْتُ كُرْدُوسًا قَالَ أَخْبَرَنِي رَجُلٌ مِنْ أَصْحَابِ بَدْرٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَأَنْ أَقْعُدَ فِي مِثْلِ هَذَا الْمَجْلِسِ أَحَبُّ إِلَيَّ مِنْ أَنْ أُعْتِقَ أَرْبَعَ رِقَابٍ",
                "id": "Telah menceritakan kepada kami [Bahz] telah menceritakan kepada kami [Syu'bah] berkata; telah menceritakan kepadaku [Abdul Malik bin Maisarah] berkata; saya mendengar [Kurdus] berkata; telah mengabarkan kepadaku [salah seorang ahli Badar], dari Rasulullah Shallallahu'alahiwasallam bersabda: \"Duduk dalam suatu majlis semacam ini lebih saya senangi dari pada membebaskan empat orang budak.\""
            },
            {
                "number": 711,
                "arab": "حَدَّثَنَا هَاشِمٌ حَدَّثَنَا شُعْبَةُ عَنْ عَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ قَالَ سَمِعْتُ كُرْدُوسَ بْنَ قَيْسٍ وَكَانَ قَاصَّ الْعَامَّةِ بِالْكُوفَةِ قَالَ أَخْبَرَنِي رَجُلٌ مِنْ أَصْحَابِ بَدْرٍ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَأَنْ أَقْعُدَ فِي مِثْلِ هَذَا الْمَجْلِسِ أَحَبُّ إِلَيَّ مِنْ أَنْ أُعْتِقَ أَرْبَعَ رِقَابٍقَالَ شُعْبَةُ فَقُلْتُ أَيَّ مَجْلِسٍ تَعْنِي قَالَ كَانَ قَاصًّا",
                "id": "Telah menceritakan kepada kami [Hasyim] telah menceritakan kepada kami [Syu'bah] dari [Abdul Malik bin Maisarah] berkata; saya telah mendengar [Kurdus bin Qais] dia adalah orang yang bercerita secara umum di Kufah, berkata; telah mengabarkan kepadaku [salah seorang Ahli Badar], ia mendengar Nabi Shallallahu'alaihiwasallam bersabda: \"Duduk dalam suatu majlis semacam ini lebih saya senangi dari pada membebaskan empat orang budak\" Syu'bah berkata; sasya bertanya, majlis apakah yang kau maksud?, dia menjawab, yaitu majlis tentang kisah atau nasehat."
            },
            {
                "number": 712,
                "arab": "حَدَّثَنَا أَبُو الْجَوَّابِ حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ عَنْ عَطَاءِ بْنِ السَّائِبِ قَالَ حَدَّثَنِي نَفَرٌ مِنْ أَهْلِ الْبَصْرَةِ مِنْهُمْ الْحَسَنُ عَنْ مَعْقِلِ بْنِ سِنَانٍ الْأَشْجَعِيِّ أَنَّهُ قَالَمَرَّ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَحْتَجِمُ فِي ثَمَانِ عَشْرَةَ لَيْلَةً خَلَتْ مِنْ شَهْرِ رَمَضَانَ فَقَالَ أَفْطَرَ الْحَاجِمُ وَالْمَحْجُومُ",
                "id": "Telah menceritakan kepada kami [Abu Al Jawwab] telah menceritakan kepada kami ['Ammar bin Ruzaiq] dari [Atha' bin Saib] berkata; telah menceritakan kepadaku beberapa orang dari penduduk Bashrah di antaranya [Al Hasan] dari [Ma'qil bin Sinan Al Asyja'i] sesungguhnya dia berkata; Rasulullah Shallallahu'alahiwasallam melewatiku ketika saya sedang berbekam pada malam ke delapan belas dari bulan ramadhan, beliau bersabda: \" Orang yang membekam dan dibekam berarti telah batal puasanya\"."
            },
            {
                "number": 713,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ قَالَ خَالِدٌ الْحَذَّاءُ أَخْبَرَنِي عَنْ أَبِي قِلَابَةَ عَنْ عَمْرِو بْنِ سَلِمَةَ قَالَكَانَ تَأْتِينَا الرُّكْبَانُ مِنْ قِبَلِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَسْتَقْرِئُهُمْ فَيُحَدِّثُونَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِيَؤُمَّكُمْ أَكْثَرُكُمْ قُرْآنًا",
                "id": "Telah menceritakan kepada kami ['Ali bin 'Ashim] [khalid Al Hadza'] berkata; telah mengabarkan kepadaku, dari [Abu Qilabah] dari ['Amr bin Salimah] berkata; datang kepada kami [para penunggang kuda] selepas bertemu Rasulullah Shallallahu'alahiwasallam, kami meminta mereka untuk melantunkan bacaan al-qur'an untuk kami, lalu mereka menceritakan kepada kami bahwa Rasulullah Shallallahu'alahiwasallam bersabda: 'Hendaklah yang menjadi imam di antara kalian adalah yang paling banyak hafalan Qur'annya\""
            },
            {
                "number": 714,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى قَالَ أَخْبَرَنِي مَالِكٌ عَنْ سُمَيٍّ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ بَعْضِ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ النَّاسَ بِالْفِطْرِ عَامَ الْفَتْحِ وَقَالَ تَقَوَّوْا لِعَدُوِّكُمْ وَصَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو بَكْرٍ قَالَ الَّذِي حَدَّثَنِي لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْعَرْجِ يَصُبُّ عَلَى رَأْسِهِ الْمَاءَ مِنْ الْعَطَشِ أَوْ مِنْ الْحَرِّ ثُمَّ قِيلَ يَا رَسُولَ اللَّهِ إِنَّ طَائِفَةً مِنْ النَّاسِ قَدْ صَامُوا حِينَ صُمْتَ فَلَمَّا كَانَ بِالْكَدِيدِ دَعَا بِقَدَحٍ فَشَرِبَ فَأَفْطَرَ النَّاسُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin 'Isa] berkata; telah mengabarkan kepadaku [Malik] dari [Suma] dari [Abu Bakr bin Abdurrahman bin Al Harits bin Hisyam] dari [sebagian sahabat Nabi Shallallahu'alaihiwasallam], Rasulullah Shallallahu'alahiwasallam memerintahkan kepada manusia pada Fathul Makkah untuk berbuka puasa, beliau bersabda: \"Perlihatkanlah kekuatan kalian di hadapan musuh kalian\". Sedangkan Rasulullah Shallallahu'alahiwasallam berpuasa pada hari itu. Abu Bakar berkata; telah berkata orang yang menceritakan kepadaku, sungguh saya melihat Rasulullah Shallallahu'alahiwasallam berhenti dan menuangkan air di atas kepalanya, karena rasa haus atau panas. Lalu ada yang bertanya, Wahai Rasulullah, sesungguhnya sebagian kelompok sahabat berpuasa ketika anda berpuasa, ketika sampai di Kadid, beliau meminta bejana air minum lalu meminumnya, maka para sahabAt pun membatalkan puasanya."
            },
            {
                "number": 715,
                "arab": "قَالَ حَدَّثَنَا أَبُو أَحْمَدَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الزُّبَيْرِيُّ حَدَّثَنَا سَعْدٌ يَعْنِي ابْنَ أَوْسٍ الْعَبْسِيَّ عَنْ بِلَالٍ الْعَبْسِيِّ قَالَ أَخْبَرَنَا عِمْرَانُ بْنُ حُصَيْنٍ الضَّبِّيُّأَنَّهُ أَتَى الْبَصْرَةَ وَبِهَا عَبْدُ اللَّهِ بْنُ عَبَّاسٍ أَمِيرًا فَإِذَا هُوَ بِرَجُلٍ قَائِمٍ فِي ظِلِّ الْقَصْرِ يَقُولُ صَدَقَ اللَّهُ وَرَسُولُهُ صَدَقَ اللَّهُ وَرَسُولُهُ لَا يَزِيدُ عَلَى ذَلِكَ فَدَنَوْتُ مِنْهُ شَيْئًا فَقُلْتُ لَهُ لَقَدْ أَكْثَرْتَ مِنْ قَوْلِكَ صَدَقَ اللَّهُ وَرَسُولُهُ فَقَالَ أَمَا وَاللَّهِ لَئِنْ شِئْتَ لَأَخْبَرْتُكَ فَقُلْتُ أَجَلْ فَقَالَ اجْلِسْ إِذًا فَقَالَ إِنِّي أَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِالْمَدِينَةِ فِي زَمَانِ كَذَا وَكَذَا وَقَدْ كَانَ شَيْخَانِ لِلْحَيِّ قَدْ انْطَلَقَ ابْنٌ لَهُمَا فَلَحِقَ بِهِ فَقَالَا إِنَّكَ قَادِمٌ الْمَدِينَةَ وَإِنَّ ابْنًا لَنَا قَدْ لَحِقَ بِهَذَا الرَّجُلِ فَأْتِهِ فَاطْلُبْهُ مِنْهُ فَإِنْ أَبَى إِلَّا الِافْتِدَاءَ فَافْتَدِهِ فَأَتَيْتُ الْمَدِينَةَ فَدَخَلْتُ عَلَى نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ يَا نَبِيَّ اللَّهِ إِنَّ شَيْخَيْنِ لِلْحَيِّ أَمَرَانِي أَنْ أَطْلُبَ ابْنًا لَهُمَا عِنْدَكَ فَقَالَ تَعْرِفُهُ فَقَالَ أَعْرِفُ نَسَبَهُ فَدَعَا الْغُلَامَ فَجَاءَ فَقَالَ هُوَ ذَا فَأْتِ بِهِ أَبَوَيْهِ فَقُلْتُ الْفِدَاءَ يَا نَبِيَّ اللَّهِ قَالَ إِنَّهُ لَا يَصْلُحُ لَنَا آلُ مُحَمَّدٍ أَنْ نَأْكُلَ ثَمَنَ أَحَدٍ مِنْ وَلَدِ إِسْمَاعِيلَ ثُمَّ ضَرَبَ عَلَى كَتِفِي ثُمَّ قَالَ لَا أَخْشَى عَلَى قُرَيْشٍ إِلَّا أَنْفُسَهَا قُلْتُ وَمَا لَهُمْ يَا نَبِيَّ اللَّهِ قَالَ إِنْ طَالَ بِكَ الْعُمُرُ رَأَيْتَهُمْ هَاهُنَا حَتَّى تَرَى النَّاسَ بَيْنَهُمَا كَالْغَنَمِ بَيْنَ حَوْضَيْنِ مَرَّةً إِلَى هَذَا وَمَرَّةً إِلَى هَذَافَأَنَا أَرَى نَاسًا يَسْتَأْذِنُونَ عَلَى ابْنِ عَبَّاسٍ رَأَيْتُهُمْ الْعَامَ يَسْتَأْذِنُونَ عَلَى مُعَاوِيَةَ فَذَكَرْتُ مَا قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Abu Ahmad, Muhammad bin Abdullah Az Zubairi] telah menceritakan kepada kami [Sa'd] yaitu Ibnu Aus Al 'Abasi dari [Bilal Al 'Abasi] berkata; telah mengabarkan kepada kami ['Imran bin Husain Adzabby], dia datang ke Bashrah, pada waktu itu Abdullah bin Abbas menjabat sebagai Amir di wilayah itu. Tiba-tiba ada [seorang laki-laki] yang berdiri disamping istana dan berkata; \"BenAr lah Allah dan Rasul-Nya, BenAr lah Allah dan Rasul-Nya\", tidak menambah apapun kalimat tersebut, lalu saya mendekatinya dan berkata padanya, \"Engkau banyak menyebut lafadz, 'Benarlah Allah dan Rasul-Nya' mengapa? dia menjawab, Demi Allah kalau kamu mau, saya akan beritahukan kepadamu. Saya menjawab, Ya. dia berkata; duduklah. Dia berkata; saya pernah mendatangi Rasulullah Shallallahu'alahiwasallam di Madinah pada suatu waktu ini dan itu, ada dua orang tua dari suatu desa, anak mereka berdua telah pergi dan anak tersebut menemui Rasulullah shallallahu'alaihi wasallam. Kedua orang tua tersebut lantas berkata kepada saya 'Sesungguhnya kamu telah sampai di Madinah ini, sedang anak kami telah menyusul orang ini (Maksudnya nabi Shallallahu 'alaihi wa Salam Muhammad), maka bawalah kemari dan mintalah dia. Jika dia menolak kecuali harus dengan tebusan maka tebuslah. Lalu saya pergi ke Madinah untuk menemui Nabiyullah ShallallahuAlaihiWasallam. Saya sampaikan, 'Wahai Nabiyullah, ada dua orang tua yang dari desa, keduanya menyuruhku untuk meminta anak mereka berdua yang bersama anda. Beliau bertanya, 'Kamu mengenalnya?. Orang itu berkata; 'Saya mengenal nasabnya', dia lantas memanggil anak yang dimaksud, dan anak itu pun datang. Beliau bersabda: \"Ini orangnya, bawalah kepada kedua orang tunya\". Lalu saya bertanya, 'Apakah dengan tebusan Wahai Nabiyullah?\" Beliau bersabda: \"Sesungguhnya tidak selayaknya bagi keluarga Muhammad memakan hasil penjualan orang dari keturunan Isma'il\", lalu beliau memukul pundakku, dan bersabda: \"Saya tidak khawatir terhadap Quraisy kecuali diri mereka\" Saya bertanya, kenapa demikian Wahai Nabiyullah?. Beliau menjawab, jika umurmu panjang maka kamu akan melihatnya di sini, sehingga kamu melihat manusia antara keduanya seperti antara dua telaga, sekali pergi ke sini dan sekali pergi ke sana. Lalu saya melihat orang-orang meminta ijin kepada Ibnu 'Abbas. Di kemudian hari saya melihat mereka meminta ijin kepada Ibnu Abbas lalu saya sebutkan apa yang telah disabdakan Nabi Shallallahu'alaihiwasallam."
            },
            {
                "number": 716,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ إِسْحَاقَ حَدَّثَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ مُبَارَكٍ قَالَ أَخْبَرَنَا سَعِيدُ بْنُ يَزِيدَ وَهُوَ أَبُو شُجَاعٍ قَالَ سَمِعْتُ الْحَارِثَ بْنَ يَزِيدَ الْحَضْرَمِيَّ يُحَدِّثُ عَنْ عَلِيِّ بْنِ رَبَاحٍ عَنْ نَاشِرَةَ بْنِ سُمَيٍّ الْيَزَنِيِّ قَالَسَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ رَضِيَ اللَّهُ تَعَالَى عَنْهُ يَقُولُ فِي يَوْمِ الْجَابِيَةِ وَهُوَ يَخْطُبُ النَّاسَ إِنَّ اللَّهَ عَزَّ وَجَلَّ جَعَلَنِي خَازِنًا لِهَذَا الْمَالِ وَقَاسِمَهُ لَهُ ثُمَّ قَالَ بَلْ اللَّهُ يَقْسِمُهُ وَأَنَا بَادِئٌ بِأَهْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ أَشْرَفِهِمْ فَفَرَضَ لِأَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَشْرَةَ آلَافٍ إِلَّا جُوَيْرِيَةَ وَصَفِيَّةَ ومَيْمُونَةَ فَقَالَتْ عَائِشَةُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَعْدِلُ بَيْنَنَا فَعَدَلَ بَيْنَهُنَّ عُمَرُ ثُمَّ قَالَ إِنِّي بَادِئٌ بِأَصْحَابِي الْمُهَاجِرِينَ الْأَوَّلِينَ فَإِنَّا أُخْرِجْنَا مِنْ دِيَارِنَا ظُلْمًا وَعُدْوَانًا ثُمَّ أَشْرَفِهِمْ فَفَرَضَ لِأَصْحَابِ بَدْرٍ مِنْهُمْ خَمْسَةَ آلَافٍ وَلِمَنْ كَانَ شَهِدَ بَدْرًا مِنْ الْأَنْصَارِ أَرْبَعَةَ آلَافٍ وَلِمَنْ شَهِدَ أُحُدًا ثَلَاثَةَ آلَافٍ قَالَ وَمَنْ أَسْرَعَ فِي الْهِجْرَةِ أَسْرَعَ بِهِ الْعَطَاءُ وَمَنْ أَبْطَأَ فِي الْهِجْرَةِ أَبْطَأَ بِهِ الْعَطَاءُ فَلَا يَلُومَنَّ رَجُلٌ إِلَّا مُنَاخَ رَاحِلَتِهِ وَإِنِّي أَعْتَذِرُ إِلَيْكُمْ مِنْ خَالِدِ بْنِ الْوَلِيدِ إِنِّي أَمَرْتُهُ أَنْ يَحْبِسَ هَذَا الْمَالَ عَلَى ضَعَفَةِ الْمُهَاجِرِينَ فَأَعْطَى ذَا الْبَأْسِ وَذَا الشَّرَفِ وَذَا اللَّسَانَةِ فَنَزَعْتُهُ وَأَمَّرْتُ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ فَقَالَ أَبُو عَمْرِو بْنُ حَفْصِ بْنِ الْمُغِيرَةِ وَاللَّهِ مَا أَعْذَرْتَ يَا عُمَرُ بْنَ الْخَطَّابِ لَقَدْ نَزَعْتَ عَامِلًا اسْتَعْمَلَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَمَدْتَ سَيْفًا سَلَّهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَوَضَعْتَ لِوَاءً نَصَبَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَقَدْ قَطَعْتَ الرَّحِمَ وَحَسَدْتَ ابْنَ الْعَمِّ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ إِنَّكَ قَرِيبُ الْقَرَابَةِ حَدِيثُ السِّنِّ مُغْضَبٌ مِنْ ابْنِ عَمِّكَ",
                "id": "Telah menceritakan kepada kami ['Ali bin Ishaq] telah menceritakan kepada kami [Abdullah] yaitu Ibnu Mubarak, berkata; telah mengabarkan kepada kami [Sa'id bin Yazid] yaitu Abu Syuja', berkata; saya telah mendengar [Al Harits bin Yazid Al Hadlrami] menceritakan dari ['Ali bin Rabah] dari [Nasyirah bin Sumay Al Yazani] berkata; saya telah mendengar 'Umar bin Khattab Radliyallahu'anhu pada Peristiwa Hudaibiyah, berkhotbah di hadapan manusia, ' Allah Azzawajalla telah menjadikanku penjaga harta ini dan yang berhak untuk membagikannya. Lalu berkata; sungguh Allah-lah yang membaginya, saya memulai pembagian ini untuk keluarga Nabi Shallallahu'alaihiwasallam, selanjutnya yang terdekat dengan mereka. Dia pun lantas membagi untuk para istri Nabi Shallallahu'alaihiwasallam sebesar sepuluh ribu kecuali Juwairiyah, Shafiyyah dan Maimunah. Kata 'Aisyah, Rasulullah Shallallahu'alahiwasallam berbuat adil terhadap kami, 'Umar pun membaginya dengan adil. Lalu dia berkata; saya akan membaginya kepada para sahabatku dari kalangan Muhajirin generasi pertama, karena kami telah diusir dari rumah-rumah karena didhalimi dan dimusuhi. Diikuti orang yang terdekat dengan mereka. Mula-mula dia membagi kepada pengikut Perang Badar, mereka mendapatkan lima ribu. Dan Kaum Anshar yang mengikuti Perang Badar, mendapatkan empat ribu. Orang yang ikut pada perang uhud mendapatkan tiga ribu. ('Umar Radliyallahu'anhu) berkata; Siapa yang dahulu bersegera dalam berhijrah, dia mendapatkan pemberian lebih cepat dari yang berhijrah setelahnya. Maka janganlah ada yang mencela kecuali karena sesuatu dalam pelana kudanya, saya memohon ampun atas apa yang saya lakukan terhadap Khalid bin Walid, karena saya memerintahkannya untuk menahan semua harta ini untuk kalangan yang lemah dari kaum Muhajirin, tapi dia malah memberikan harta ini kepada orang yang mempunyai kekuatan, kemuliaan dan yang fasih bicara, sehingga saya memecatnya lalu saya angkat Abu 'Ubaidah bin Al Jarrah sebagai pimpinan. Lalu ['Amr bin Hafsh bin Al Mughirah] berkata; \"Demi Allah, wahai 'Umar bin Al Khattab, engkau tidak bisa beralasan, karena kamu telah memecat pekerja yang telah diangkat oleh Rasulullah Shallallahu'alahiwasallam, kamu telah menyarungkan kembali pedang yang telah Rasulullah Shallallahu'alahiwasallam menghunuskannya, kamu telah mencabut bendera yang telah ditancapkan Rasulullah Shallallahu'alahiwasallam, kamu telah memutus silaturahmi dan kamu dengki kepada anak pamanku. 'Umar bin Khattab berkata; \"Sesunguhnya kamu orang yang dekat persaudarannya, masih muda umurnya, kamu marah atas apa yang telah menimpa sepupumu\""
            },
            {
                "number": 717,
                "arab": "حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ حَدَّثَنَا أَبُو النُّعْمَانِ عَبْدُ الرَّحْمَنِ بْنِ النُّعْمَانِ الْأَنْصَارِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِ وَكَانَ قَدْ أَدْرَكَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اكْتَحِلُوا بِالْإِثْمِدِ الْمُرَوَّحِ فَإِنَّهُ يَجْلُو الْبَصَرَ وَيُنْبِتُ الشَّعْرَ",
                "id": "Telah menceritakan kepada kami [Abu Ahmad Az Zubari] telah menceritakan kepada kami [Abu Nu'man Abdurrahman bin Nu'man Al Anshori] dari [Bapaknya] dari [kakeknya] dia mendapati masa Nabi Shallallahu'alaihiwasallam berkata; Rasulullah Shallallahu'alahiwasallam bersabda: \"Pakailah celak kalian semua dengan memakai Itsmid (bahan celak yang terbaik) yang bercampur dengan wangi-wangian, sesungguhnya hal tersebut dapat membuat penglihatan menjadi terang dan menumbuhkan rambut\"."
            },
            {
                "number": 718,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ حَدَّثَنَا يَحْيَى يَعْنِي ابْنَ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي نَحَّازُ بْنُ جُدَيٍّ الْحَنَفِيُّ عَنْ سِنَانِ بْنِ سَلَمَةَ أَنَّ أَبَاهُ حَدَّثَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِالْقُدُورِ فَأُكْفِئَتْ يَوْمَ خَيْبَرَ وَكَانَ فِيهَا لُحُومُ حُمُرِ النَّاسِ",
                "id": "Telah menceritakan kepada kami [Abdushamad] dari [Harb bin Syadad] telah menceritakan kepada kami [Yahya bin Abu Katsir] berkata; telah menceritakan kepadaku [Nahhaz bin Juda Al Hanafi] dari [Sinan bin Salamah] sesungguhnya [bapaknya] menceritakan, Rasulullah Shallallahu'alahiwasallam meminta kuali lalu ditumpahkan pada Peristiwa Khaibar yang isinya terdapat daging keledai."
            },
            {
                "number": 719,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا هِشَامٌ وَهَمَّامٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ جَوْنِ بْنِ قَتَادَةَ عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِبَيْتٍ بِفِنَائِهِ قِرْبَةٌ مُعَلَّقَةٌ فَاسْتَسْقَى فَقِيلَ إِنَّهَا مَيْتَةٌ قَالَ ذَكَاةُ الْأَدِيمِ دِبَاغُهُ",
                "id": "Telah menceritakan kepada kami [Abdushamad] telah menceritakan kepada kami [Hisyam] dan [Hammam] dari [Qatadah] dari [Al Hasan] dari [Jaun bin Qatadah] dari [Salamah bin Al Mujabbiq], Rasulullah Shallallahu'alahiwasallam melewati suatu rumah yang dalam terasnya terdapat ada gerimba dari kulit yang tergantung, beliau meminta air, lalu ada yang menjawab, itu adalah bangkai. Beliau bersabda: \"Penyembelihan secara syar'i pada kulit yang disamak adalah dengan menyamaknya\"."
            },
            {
                "number": 720,
                "arab": "حَدَّثَنَا عَمْرُو بْنُ الْهَيْثَمِ أَبُو قَطَنٍ قَالَ حَدَّثَنَا هِشَامٌ عَنْ قَتَادَةَ عَنِ الْحَسَنِ عَنْ جَوْنِ بْنِ قَتَادَةَ عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِبَاغُهَا طُهُورُهَا أَوْ ذَكَاتُهَا",
                "id": "Telah menceritakan kepada kami ['Amr bin Al Haitsam, Abu Qathan] berkata; telah menceritakan kepada kami [Hisyam] dari [Qatadah] dari [Al Hasan] dari [Jaun bin Qatadah] dari [Salamah bin Al Muhabbiq] dari Rasulullah Shallallahu'alahiwasallam, penyamakannya adalah penyuciannya atau penyembilahan secara syar'inya."
            },
            {
                "number": 721,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا الْفَضْلُ بْنُ دَلْهَمٍ عَنْ الْحَسَنِ عَنْ قَبِيصَةَ بْنِ حُرَيْثٍ عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خُذُوا عَنِّي خُذُوا عَنِّي قَدْ جَعَلَ اللَّهُ لَهُنَّ سَبِيلًا الْبِكْرُ بِالْبِكْرِ جَلْدُ مِائَةٍ وَنَفْيُ سَنَةٍ وَالثَّيِّبُ بِالثَّيِّبِ جَلْدُ مِائَةٍ وَالرَّجْمُ",
                "id": "Telah menceritakan kepada kami [Waki'] berkata; telah menceritakan kepada kami [Al Fadl bin Dalham] dari [Al Hasan] dari [Qabishah bin Huraits] dari [Salamah bin Muhabbiq] berkata; Rasulullah bersabda: \"Ambillah (contoh) dariku, ambillah dariku. Sungguh Allah telah menjadikan urusan kaum perempuan, bahwa laki-laki (perjaka) dan perempuan (gadis) di cambuk seratus kali dan diasingkan selama setahun. Orang yang sudah menikah laki-laki dengan orang yang sudah menikah perempuan, hukumannya dicambuk seratus kali dan dirajam (dilempar dengan batu) sampai meninggal\"."
            },
            {
                "number": 722,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا الْمُبَارَكُ عَنْ الْحَسَنِ عَنْ سَلَمَةَ بْنِ الْمُحَبِّقِ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الرَّجُلِ يُوَاقِعُ جَارِيَةَ امْرَأَتِهِ قَالَ إِنْ أَكْرَهَهَا فَهِيَ حُرَّةٌ وَلَهَا عَلَيْهِ مِثْلُهَا وَإِنْ طَاوَعَتْهُ فَهِيَ أَمَتُهُ وَلَهَا عَلَيْهِ مِثْلُهَا",
                "id": "Telah menceritakan kepada kami [Abu Nadlr] telah menceritakan kepada kami [Al Mubarak] dari [Al Hasan] dari [Salamah bin Al Muhabbiq] berkata; Rasulullah Shallallahu'alahiwasallam ditanya tentang seorang laki-laki yang menggauli budak perempuan istrinya. Jika dia (laki-laki itu) memaksanya maka budak itu menjadi merdeka dan berhak mendapatkan sesuatu yang sama (harta) dengan istrinya (dari hartanya laki-laki), adapun jika budak itu menyerahkan dirinya secara sukarela maka dia tetap budak, dan mendapatkan (harta) yang sama dari (laki-laki itu) dalam jumlah yang sama."
            },
            {
                "number": 723,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ حَبِيبِ بْنِ عَبْدِ اللَّهِ الْأَزْدِيِّ ثُمَّ النُّمَيْرِيِّ قَالَ حَدَّثَنِي حَبِيبُ بْنُ عَبْدِ اللَّهِ يَعْنِي أَبَاهُ قَالَ سَمِعْتُ سِنَانَ بْنَ سَلَمَةَ بْنِ الْمُحَبِّقِ الْهُذَلِيَّ يُحَدِّثُ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَتْ لَهُ حَمُولَةٌ تَأْوِي إِلَى شِبَعٍ فَلْيَصُمْ رَمَضَانَ حَيْثُ أَدْرَكَهُ",
                "id": "Telah menceritakan kepada kami [Abu Nadlr] berkata; telah menceritakan kepada kami [Abdusshomad bin Habib bin Abdullah Al Azdi, An-Numairi] berkata; telah menceritakan kepadaku [Habib bin Abdullah] yaitu Bapaknya berkata; saya mendengar [Sinan bin Salamah bin Al Muhabbiq Al Hudzali] menceritakan dari [Bapaknya] berkata; Rasulullah Shallallahu'alahiwasallam bersabda: \"Barangsiapa memiliki tukang angkut (porter) yang membawa ke satu kelompok perjalanan maka berpuasalah ramadhan, kalau dia menjumpai Ramadhan itu\"."
            },
            {
                "number": 724,
                "arab": "حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ قَالَ حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنِ النَّحَّازِ الْحَنَفِيِّ أَنَّ سِنَانَ بْنَ سَلَمَةَ أَخْبَرَهُ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِلُحُومِ حُمُرِ النَّاسِ يَوْمَ خَيْبَرَ وَهِيَ فِي الْقُدُورِ فَأُكْفِئَتْ",
                "id": "Telah menceritakan kepada kami [Abu Daud Ath-Thayalisi] berkata; telah menceritakan kepada kami [Harb bin Syaddad] dari [Yahya bin Abu Katsir] dari [An-Nahaz Al Hanafi] sesungguhnya [Sinan bin Salamah] mengabarinya dari [Bapaknya], Rasulullah Shallallahu'alahiwasallam memerintahkan daging keledai pada perang Khaibar yang terletak di kuali-kuali, agar kesemuanya ditumpahkan."
            },
            {
                "number": 725,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ عَنْ سُلَيْمَانَ يَعْنِي التَّيْمِيَّ عَنْ أَبِي عُثْمَانَ يَعْنِي النَّهْدِيَّ عَنْ قَبِيصَةَ بْنِ مُخَارِقٍ قَالَلَمَّا نَزَلَتْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ{ وَأَنْذِرْ عَشِيرَتَكَ الْأَقْرَبِينَ }انْطَلَقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى رَضْمَةٍ مِنْ جَبَلٍ فَعَلَا أَعْلَاهَا ثُمَّ نَادَى أَوْ قَالَ قَالَ يَا آلَ عَبْدِ مَنَافَاهُ إِنِّي نَذِيرٌ إِنَّ مَثَلِي وَمَثَلَكُمْ كَمَثَلِ رَجُلٍ رَأَى الْعَدُوَّ فَانْطَلَقَ يَرْبَأُ أَهْلَهُ يُنَادِي أَوْ قَالَ يَهْتِفُ يَا صَبَاحَاهْقَالَ أَبِي قَالَ ابْنُ أَبِي عَدِيٍّ فِي هَذَا الْحَدِيثِ عَنْ قَبِيصَةَ بْنِ مُخَارِقٍ أَوْ وَهْبِ بْنِ عَمْرٍو وَهُوَ خَطَأٌ إِنَّمَا هُوَ زُهَيْرُ بْنُ عَمْرٍو فَلَمَّا أَخْطَأَ تَرَكْتُ وَهْبَ بْنَ عَمْرٍو",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu 'Adi] sesungguhnya [Sulaiman] yaitu At Taimi, dari [Abu 'Utsman] yaitu An-Nahdi, dari [Qabishah bin Muhariq] berkata; ketika turun ayat kepada Rasulullah Shallallahu'alahiwasallam, berilah peringatan keluargamu dan kerabatmu, beliau mendaki bebatuan pada suatu gunung lalu berdiri pada bagian atasnya dan berseru atau berkata; \"Wahai segenap keluarga Abdul Manaf, saya adalah pemberi peringatan. Permisalanku dengan permisalan kalian sebagaimana seorang laki-laki yang melihat musuh lalu bersegera memperingatkan keluarganya dengan menyeru atau berkata; Wahai segenap saudaraku. bapakku berkata; Ibnu Abu 'Ady berkata tentang hadits ini, dari Qabishah bin Muhariq ataukah dari Wahab bin 'Amr, dan ternyata dia salah, karena yang benar adalah [Zuhair bin 'Amr], ketika dia salah menerangkan hal tersebut, saya tinggalkan Wahab bin 'Amr."
            },
            {
                "number": 726,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنِي عَوْفٌ قَالَ حَدَّثَنِي حَيَّانُ قَالَ حَدَّثَنِي قَطَنُ بْنُ قَبِيصَةَ عَنْ أَبِيهِ قَبِيصَةَ بْنِ مُخَارِقٍأَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْعِيَافَةُ وَالطِّيَرَةُ وَالطَّرْقُ مِنْ الْجِبْتِ قَالَ الْعِيَافَةُ مِنْ الزَّجْرِ وَالطَّرْقُ مِنْ الْخَطِّ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] berkata; telah menceritakan kepadaku ['Auf] berkata; telah menceritakan kepadaku [Hayyan] berkata; telah menceritakan kepadaku [Qatn bin Qabishah] dari [Bapaknya, Qabishah bin Muhariq], ia mendengar Nabi Shallallahu'alaihiwasallam bersabda: \"Al Iyafah (menerbangkan atau mengusir burung lalu meramal arah terbang dan siulnya), tiyaroh (mengurungkan pekerjaan karena melihat hewan dengan alasan takut ada sesuatu yang buruk menimpa) dan At taraq (memukulkan tongkat ke tanah atau membuat garis di pasir untuk peramalan, yaitu suatu bentuk perdukunan) adalah termasuk sihir.\" (Qabishah bin Muhariq Radliyallahu'anhu) berkata; Al Iyafah adalah peramalan dengan cara menggertak burung atau hewan, sebaliknya At taraq adalah peramalan dengan menggunakan garis-garis."
            },
            {
                "number": 727,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ هَارُونَ بْنِ رِئَابٍ عَنْ كِنَانَةَ بْنِ نُعَيْمٍ عَنْ قَبِيصَةَ بْنِ الْمُخَارِقِ الْهِلَالِيِّتَحَمَّلْتُ بِحَمَالَةٍ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْأَلُهُ فِيهَا فَقَالَ نُؤَدِّهَا عَنْكَ وَنُخْرِجُهَا مِنْ نَعَمْ الصَّدَقَةِ وَقَالَ مَرَّةً وَنُخْرِجُهَا إِذَا جَاءَتْنَا الصَّدَقَةُ أَوْ إِذَا جَاءَ نَعَمُ الصَّدَقَةِ وَقَالَ يَا قَبِيصَةُ إِنَّ الْمَسْأَلَةَ لَا تَصْلُحُ وَقَالَ مَرَّةً حُرِّمَتْ إِلَّا فِي ثَلَاثٍ رَجُلٍ تَحَمَّلَ بِحَمَالَةٍ حَلَّتْ لَهُ الْمَسْأَلَةُ حَتَّى يُؤَدِّيَهَا ثُمَّ يُمْسِكَ وَرَجُلٍ أَصَابَتْهُ حَاجَةٌ وَفَاقَةٌ حَتَّى يَشْهَدَ لَهُ ثَلَاثَةٌ مِنْ ذَوِي الْحِجَا مِنْ قَوْمِهِ وَقَالَ مَرَّةً رَجُلٍ أَصَابَتْهُ فَاقَةٌ أَوْ حَاجَةٌ حَتَّى يَشْهَدَ لَهُ أَوْ يَكَلَّمَ ثَلَاثَةٌ مِنْ ذَوِي الْحِجَا مِنْ قَوْمِهِ أَنَّهُ قَدْ أَصَابَتْهُ حَاجَةٌ أَوْ فَاقَةٌ إِلَّا قَدْ حَلَّتْ لَهُ الْمَسْأَلَةُ فَيَسْأَلُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ سِدَادًا مِنْ عَيْشٍ ثُمَّ يُمْسِكَ وَرَجُلٍ أَصَابَتْهُ جَائِحَةٌ اجْتَاحَتْ مَالَهُ حَلَّتْ لَهُ الْمَسْأَلَةُ فَيَسْأَلُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ أَوْ سَدَادًا مِنْ عَيْشٍ ثُمَّ يُمْسِكَ وَمَا كَانَ سِوَى ذَلِكَ مِنْ الْمَسْأَلَةِ سُحْتٌ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Harun bin Ri'ab] dari [Kinanah bin Nuaim] dari [Qabishah bin Muhariq Al Hilali] saya mempunyai banyak tanggungan, lalu saya mendatangi Rasulullah Shallallahu'alahiwasallam dan meminta bantuan, Lalu beliau bersabda: \"Kami akan menyelesaikan tanggunganmu dan mengambilkan dari ternak-ternak sedekah\" Pada lain kesempatan, bersabda: \"Kami akan membantumu jika sedekah telah datang atau jika atau kita mendapatkan ternak-ternak sedekah\". Lalu beliau bersabda: \"Wahai Qabishah, meminta-minta itu tidak boleh, --dalam lain kesempatan dengan redaksi diharamkan-- kecuali dalam tiga kondisi, yaitu kondisi seseorang karena mempunyai tanggungan maka diperbolehkan untuk meminta-minta sampai dia mampu untuk menyelesaikan tanggungannya lantas berhenti. Seseorang yang sedang terdesak karena kebutuhan dan kefakiran hingga disaksikan oleh tiga orang dari kaumnya yang berakal, --dalam kesempatan lain dengan redaksi 'Seseorang yang sedang terdesak karena kefakiran dan kebutuhan hingga tiga orang berakal dari kaumnya bersaksi atau mengucapkan ucapan bahwa ia terdesak kebutuhan atau kefakiran, sehingga meminta dihalalkan baginya, lalu dia meminta hingga memperoleh penopang hidup atau kecukupan hidupnya lantas ia menahan diri, dan ketiga, seseorang yang tertimpa musibah (kebangkrutan) sehingga menghabiskan hartanya, maka meminta diperbolehkan baginya hingga memperoleh penopang atau kecukupan hidup lalu ia menahan diri, adapun selain dari tiga kondisi tersebut meminta-minta adalah haram."
            },
            {
                "number": 728,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ كُرْزِ بْنِ عَلْقَمَةَ الْخُزَاعِيِّ قَالَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ هَلْ لِلْإِسْلَامِ مِنْ مُنْتَهَى قَالَ أَيُّمَا أَهْلِ بَيْتٍ وَقَالَ فِي مَوْضِعٍ آخَرَ قَالَ نَعَمْ أَيُّمَا أَهْلِ بَيْتٍ مِنْ الْعَرَبِ أَوْ الْعُجْمِ أَرَادَ اللَّهُ بِهِمْ خَيْرًا أَدْخَلَ عَلَيْهِمْ الْإِسْلَامَ قَالَ ثُمَّ مَهْ قَالَ ثُمَّ تَقَعُ الْفِتَنُ كَأَنَّهَا الظُّلَلُ قَالَ كَلَّا وَاللَّهِ إِنْ شَاءَ اللَّهُ قَالَ بَلَى وَالَّذِي نَفْسِي بِيَدِهِ ثُمَّ تَعُودُونَ فِيهَا أَسَاوِدَ صُبًّا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍوَقَرَأَ عَلَيَّ سُفْيَانُ قَالَ الزُّهْرِيُّ أَسَاوِدَ صُبًّا قَالَ سُفْيَانُ الْحَيَّةُ السَّوْدَاءُ تُنْصَبُ أَيْ تَرْتَفِعُ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Az Zuhri] dari ['Urwah] dari [Kurz bin 'Alqamah Al Khuza'i] berkata; Ada seseorang yang berkata; \"Wahai Rasulullah, apakah Islam itu ada habisnya?\" Beliau bertanya, \"Dimanakah Ahli Bait\"? Pada tempat lain, beliau bersabda: \"Ya, mana saja Ahli Bait penduduk Arab ataupun bukan Arab, apabila Allah menghendaki kebaikan atas mereka, Allah memasukan mereka ke dalam Islam\". lalu ('Alqamah Radliyallahu'anhu) bertanya kembali, \"Lalu apa, Wahai Rasulullah\", beliau bersabda: lalu akan datang fitnah sebagaimana mendung. Dia berkata; \"Sekali-kali tidak, Demi Allah, jika Allah menghendaki\". Beliau bersabda: \"Ya. Demi yang jiwaku yang berada ditangan-Nya, akan datang kembali ulAr ular hitam (cobra) yang memangsa kalian semua, dan kalian akan saling membunuh\". Sufyan membaca kepadaku ('Alqomah), Az Zuhri berkata; ulAr ular hitam yang berdiri. Sufyan berkata; \"Ular hitam yang tegak berdiri\"."
            },
            {
                "number": 729,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ كُرْزِ بْنِ عَلْقَمَةَ الْخُزَاعِيِّ قَالَقَالَ أَعْرَابِيٌّ يَا رَسُولَ اللَّهِ هَلْ لِلْإِسْلَامِ مِنْ مُنْتَهَى قَالَ نَعَمْ أَيُّمَا أَهْلِ بَيْتٍ مِنْ الْعَرَبِ أَوْ الْعُجْمِ أَرَادَ اللَّهُ عَزَّ وَجَلَّ بِهِمْ خَيْرًا أَدْخَلَ عَلَيْهِمْ الْإِسْلَامَ قَالَ ثُمَّ مَاذَا يَا رَسُولَ اللَّهِ قَالَ ثُمَّ تَقَعُ فِتَنٌ كَأَنَّهَا الظُّلَلُ فَقَالَ الْأَعْرَابِيُّ كَلَّا يَا رَسُولَ اللَّهِ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَلَى وَالَّذِي نَفْسِي بِيَدِهِ لَتَعُودُنَّ فِيهَا أَسَاوِدَ صُبًّا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] berkata; telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Urwah bin Zubair] dari [Kurz bin 'Alqamah Al Khuza'i] berkata; ada seorang Badui berkata; Wahai Rasulullah, apakah Islam ada habisnya?. Beliau bersabda: \"Ya. Ahlu Bait mana saja baik dari Arab atau Non Arab jika Allah Azzawajalla menghendaki kebaikan pada mereka, maka (Allah Azzawajalla) memasukkan mereka ke agama Islam.\"(orang Badui) berkata; lalu apa lagi Wahai Rasulullah, Beliau bersabda: \"Lalu akan terjadi banyak fitnah, seperti mendung\". Orang Badui berkata; sekali-kali tidak Wahai Rasulullah, Nabi Shallallahu'alaihiwasallam bersabda: \"Ya Demi Dzat yang jiwaku berada di tangan-Nya, akan datang kembali ulAr ular hitam (cobra) yang memangsa kalian semua, dan sebagian kalian akan saling membunuh dengan menebas leher lainnya\"."
            },
            {
                "number": 730,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ قَيْسٍ قَالَ حَدَّثَنَا عُرْوَةُ بْنُ الزُّبَيْرِ عَنْ كُرْزٍ الْخُزَاعِيِّ قَالَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْرَابِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ هَلْ لِهَذَا الْأَمْرِ مِنْ مُنْتَهَى قَالَ نَعَمْ فَمَنْ أَرَادَ اللَّهُ بِهِ خَيْرًا مِنْ أَعْجَمٍ أَوْ عُرْبٍ أَدْخَلَهُ عَلَيْهِمْ ثُمَّ تَقَعُ فِتَنٌ كَالظُّلَلِ يَعُودُونَ فِيهَا أَسَاوِدَ صُبًّا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ وَأَفْضَلُ النَّاسِ يَوْمَئِذٍ مُؤْمِنٌ مُعْتَزِلٌ فِي شِعْبٍ مِنْ الشِّعَابِ يَتَّقِي رَبَّهُ تَبَارَكَ وَتَعَالَى وَيَدَعُ النَّاسَ مِنْ شَرِّهِقَالَ أَبِي و حَدَّثَنِي مُحَمَّدُ بْنُ مُصْعَبٍ الْقُرْقُسَانِيُّ مِثْلَ حَدِيثِ ابْنِ الْمُغِيرَةِ إِلَّا أَنَّهُ قَالَ كُرْزُ بْنُ حُبَيْشٍ الْخُزَاعِيُّ",
                "id": "Telah menceritakan kepada kami [Abu Al Mughirah] berkata; telah menceritakan kepada kami [Al 'Auza'i] telah menceritakan kepada kami [Abdul Wahid bin Qais] berkata; telah menceritakan kepada kami ['Urwah bin Zubair] dari [Kurs Al Khuza'i] berkata; ada seorang Badui mendatangi Nabi Shallallahu'alaihiwasallam lalu berkata; Wahai Rasulullah, apakah urusan ini akan ada habisnya?. Beliau menjawab, ya. Barangsiapa siapa yang Allah kehendaki baik dari Arab maupun non Arab, Allah memasukkan mereka ke dalam (Islam), lalu akan terjadi banyak fitnah seperti awan atau gunung. Akan datang kembali ulAr ular hitam (cobra) yang memangsa kalian semua, dan sebagian kalian akan saling membunuh dengan menebas leher lainnya\". Bapakku berkata; dan telah menceritakan kepadaku [Muhammad bin Mush'ab Al Qurqusani] sebagaimana hadits Ibnu Al Mughirah kecuali dengan tambahan, [Kurz bin Hubaisy Al Khuza'i] berkata."
            },
            {
                "number": 731,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا هِلَالُ بْنُ عَامِرٍ الْمُزَنِيُّ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ النَّاسَ بِمِنًى عَلَى بَغْلَةٍ وَعَلَيْهِ بُرْدٌ أَحْمَرُ قَالَ وَرَجُلٌ مِنْ أَهْلِ بَدْرٍ بَيْنَ يَدَيْهِ يُعَبِّرُ عَنْهُ قَالَ فَجِئْتُ حَتَّى أَدْخَلْتُ يَدِي بَيْنَ قَدَمِهِ وَشِرَاكِهِ قَالَ فَجَعَلْتُ أَعْجَبُ مِنْ بَرَدِهَا",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] berkata; telah menceritakan kepada kami [Hilal bin 'Amir Al Muzni] dari [Bapaknya] berkata; saya melihat Rasulullah Shallallahu'alahiwasallam sedang berkhotbah di atas keledainya di Mina dengan memakai selendang merah. ('Amir Al Muzni Radliyallahu'anhu) berkata; seorang laki-laki dari Ahli Badar di hadapan beliau menyampaikan dari beliau. Saya datang lalu kumasukkan tanganku di antara kaki dan tali sandalnya. Dan saya kagum dengan selendangnya."
            },
            {
                "number": 732,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا شَيْخٌ مِنْ بَنِي فَزَارَةَ عَنْ هِلَالِ بْنِ عَامِرٍ الْمُزَنِيِّ عَنْ أَبِيهِ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ النَّاسَ عَلَى بَغْلَةٍ شَهْبَاءَ وَعَلِيٌّ يُعَبِّرُ عَنْهُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid] berkata; telah menceritakan kepada kami [seorang syaikh dari Bani Fazarah] dari [Hilal bin 'Amir Al Muzani] dari [Bapaknya] berkata; saya melihat Rasulullah Shallallahu'alahiwasallam berkhutbah kepada orang-orang di atas bighal yang diberi nama Syahba' dan 'Ali mengeraskannya."
            },
            {
                "number": 733,
                "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ هِشَامٌ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ عَبْدِ الْمَلِكِ عَنِ ابْنِ أَبِي الْمُعَلَّى عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ يَوْمًا فَقَالَ إِنَّ رَجُلًا خَيَّرَهُ رَبُّهُ عَزَّ وَجَلَّ بَيْنَ أَنْ يَعِيشَ فِي الدُّنْيَا مَا شَاءَ أَنْ يَعِيشَ فِيهَا يَأْكُلُ مِنْ الدُّنْيَا مَا شَاءَ أَنْ يَأْكُلَ مِنْهَا وَبَيْنَ لِقَاءِ رَبِّهِ عَزَّ وَجَلَّ فَاخْتَارَ لِقَاءَ رَبِّهِ قَالَ فَبَكَى أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ فَقَالَ أَصْحَابُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا تَعْجَبُونَ مِنْ هَذَا الشَّيْخِ أَنْ ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا صَالِحًا خَيَّرَهُ رَبُّهُ تَبَارَكَ وَتَعَالَى بَيْنَ الدُّنْيَا وَبَيْنَ لِقَاءِ رَبِّهِ تَبَارَكَ وَتَعَالَى فَاخْتَارَ لِقَاءَ رَبِّهِ عَزَّ وَجَلَّ وَكَانَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ أَعْلَمَهُمْ بِمَا قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَبُو بَكْرٍ رَضِيَ اللَّهُ عَنْهُ بَلْ نَفْدِيكَ بِأَمْوَالِنَا وَأَبْنَائِنَا أَوْ بِآبَائِنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ النَّاسِ أَحَدٌ أَمَنُّ عَلَيْنَا فِي صُحْبَتِهِ وَذَاتِ يَدِهِ مِنْ ابْنِ أَبِي قُحَافَةَ وَلَوْ كُنْتُ مُتَّخِذًا خَلِيلًا لَاتَّخَذْتُ ابْنَ أَبِي قُحَافَةَ وَلَكِنْ وُدٌّ وَإِخَاءُ إِيمَانٍ وَلَكِنْ وُدٌّ وَإِخَاءُ إِيمَانٍ مَرَّتَيْنِ وَإِنَّ صَاحِبَكُمْ خَلِيلُ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Abu Al Walid, Hisyam] berkata; telah menceritakan kepada kami [Abu 'Awanah] dari [Abdul Malik] dari [Ibnu Abu Al Mu'alla] dari [bapaknya] sesungguhnya Rasulullah Shallallahu'alahiwasallam berkhutbah pada suatu hari bersabda: \"Ada seorang laki-laki yang diberi pilihan oleh Allah Azzawajalla antara hidup di dunia sesuai yang dikehendakinya dan makan sesuka hatinya dengan bertemu dengan Rabbinya Azzawajalla. Dia memilih bertemu dengan Rabbinya\". (Abu Al Mu'alla Radliyallahu'anhu) berkata; lalu Abu Bakar Radliyallahu'anhu menangis. Para sahabat Rasulullah Shallallahu'alahiwasallam berkata; \"Apakah kalian tidak heran dengan orang yang tua ini (Para sahbaat saat itu belum tahu orang tua yang dimaksudkan), Rasulullah Shallallahu'alahiwasallam menyebutkan seorang lelaki shalih yang diberi pilihan oleh Rabbinya Tabaroka Wa Ta'ala, antara kenikmatan dunia dan bertemu Robnya Tabaraka Wa Ta'ala, lalu dia memilih untuk bertemu dengan Rabnya Tabaraka Wa Ta'ala, padahal Abu Bakar adalah orang yang paling mengetahui detail tentang perkataan Rasulullah Shallallahu'alahiwasallam\". Abu Bakar Radliyallahu'anhu berkata; \"Kami akan menebus anda dengan harta kami, anak kami dan bapak-bapak kami\"? Rasulullah Shallallahu'alahiwasallam bersabda: \"Tidak ada manusia yang lebih akrab persahabatannya denganku melebihi Ibnu Abu Quhafah, kalaulah saya boleh mengambil seorang kekasih pastilah saya mengambil Ibnu Abu Quhafah sebagai kekasih, tapi yang ada adalah cinta kasih, persaudaraan seiman, tapi yang ada adalah cinta kasih, persaudaraan seiman. Beliau mengucapkannya dua kali. Dan saudara kalian ini (Rasulullah Shallallahu'alahiwasallam) adalah kekasih Allah\""
            },
            {
                "number": 734,
                "arab": "حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنِ الشَّعْبِيِّ عَنْ عَلْقَمَةَ عَنْ سَلَمَةَ بْنِ يَزِيدَ الْجُعْفِيِّ قَالَانْطَلَقْتُ أَنَا وَأَخِي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قُلْنَا يَا رَسُولَ اللَّهِ إِنَّ أُمَّنَا مُلَيْكَةَ كَانَتْ تَصِلُ الرَّحِمَ وَتَقْرِي الضَّيْفَ وَتَفْعَلُ وَتَفْعَلُ هَلَكَتْ فِي الْجَاهِلِيَّةِ فَهَلْ ذَلِكَ نَافِعُهَا شَيْئًا قَالَ لَا قَالَ قُلْنَا فَإِنَّهَا كَانَتْ وَأَدَتْ أُخْتًا لَنَا فِي الْجَاهِلِيَّةِ فَهَلْ ذَلِكَ نَافِعُهَا شَيْئًا قَالَ الْوَائِدَةُ وَالْمَوْءُودَةُ فِي النَّارِ إِلَّا أَنْ تُدْرِكَ الْوَائِدَةُ الْإِسْلَامَ فَيَعْفُوَ اللَّهُ عَنْهَا",
                "id": "Telah menceritakan kepada kami [Ibnu Abu 'Adi] dari [Daud bin Abu Hind] dari [Asy-Sya'bi] dari ['Alqamah] dari [Salamah bin Yazid Al Ju'fi] berkata; Saya dan saudaraku pergi menemui Rasulullah Shallallahu'alahiwasallam lalu kami berkata; \"Wahai Rasulullah, Sesungguhnya ibu kami, Mulaikah, adalah orang yang menyambung silaturahmi dan memuliakan tamu, dan banyak berbuat kebaikan namun dia meninggal dalam keadaan Jahiliyah, lalu apakah hal itu bermanfaat baginya?\" (Rasulullah Shallallahu'alahiwasallam) bersabda: \" Tidak\". (Salamah bin Yazid Al Ju'fi Radliyallahu'anhu) berkata; lalu kami berkata; sesungguhnya ibu kami pada waktu jahiliyah menanam hidup-hidup saudara perempuan kami, apakah itu juga membawa pengaruh baginya? (Rasulullah Shallallahu'alahiwasallam) bersabda: \"Orang yang mengubur dan yang dikubur di neraka, kecuali orang yang mengubur tersebut masuk Islam, lalu Allah mengampuninya\"."
            },
            {
                "number": 735,
                "arab": "حَدَّثَنَا أَبُو سَلَمَةَ الْخُزَاعِيُّ حَدَّثَنَا بَكْرُ بْنُ مُضَرَ قَالَ حَدَّثَنِي مُوسَى بْنُ جُبَيْرٍ عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ عَنْ عَاصِمِ بْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَلَّقَ حَفْصَةَ بِنْتَ عُمَرَ بْنِ الْخَطَّابِ ثُمَّ رَاجَعَهَا",
                "id": "Telah menceritakan kepada kami [Abu Salamah Al Khuza'i] telah menceritakan kepada kami [Bakr bin Mudlar] berkata; telah menceritakan kepadaku [Musa bin Jubair] dari [Abu Umamah bin Sahl bin Hunaif] dari ['Ashim bin 'Umar], Rasulullah Shallallahu'alahiwasallam pernah mentalak Hafshah binti 'Umar lalu merujuk kembali\""
            },
            {
                "number": 736,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى بْنِ الطَّبَّاعِ قَالَ حَدَّثَنَا جَرِيرٌ يَعْنِي ابْنَ حَازِمٍ عَنْ وَاصِلٍ الْأَحْدَبِ عَنْ أَبِي وَائِلٍ عَنْ شُرَيْحٍ قَالَ سَمِعْتُ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ اللَّهُ تَعَالَى يَا ابْنَ آدَمَ قُمْ إِلَيَّ أَمْشِ إِلَيْكَ وَامْشِ إِلَيَّ أُهَرْوِلْ إِلَيْكَ",
                "id": "Telah menceritakan kepada kami [Ishaq bin 'Isa bin Al Thaba'] berkata; telah menceritakan kepada kami [Jarir] yaitu Ibnu Hazim, dari [Wasil Al Ahdab] dari [Abu Wa'il] dari [Syuraih] berkata; saya telah mendengar [seorang sahabat] Nabi Shallallahu'alaihiwasallam berkata; Nabi Shallallahu'alaihiwasallam bersabda: Allah Ta'ala berfirman, \"Wahai anak Adam, berdirilah kepada-Ku, Aku akan menghampirimu dengan berjalan, berjalanlah untuk-Ku, Aku akan menghampirimu dengan berlari-lari\""
            },
            {
                "number": 737,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ أَبِي النَّضْرِ عَنْ زُرْعَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ جَرْهَدٍ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ بِهِ وَهُوَ كَاشِفٌ عَنْ فَخِذِهِ فَقَالَ أَمَا عَلِمْتَ أَنَّ الْفَخِذَ عَوْرَةٌ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Malik bin Anas] dari [Abu Nadlr] dari [Zur'ah bin Abdurrahman bin Jarhad] dari [bapaknya] dari [kakeknya] sesungguhnya Nabi Shallallahu'alaihiwasallam pernah melewatinya dan saat itu tersingkap pahanya, maka beliau bersabda: \"Tidaklah kau tahu, sesungguhnya paha adalah termasuk aurat\""
            },
            {
                "number": 738,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ أَبِي النَّضْرِ عَنْ زُرْعَةَ بْنِ مُسْلِمِ بْنِ جَرْهَدٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَأَى جَرْهَدًا فِي الْمَسْجِدِ وَعَلَيْهِ بُرْدَةٌ قَدْ انْكَشَفَ فَخِذُهُ فَقَالَ الْفَخِذُ عَوْرَةٌ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Abu Nadlr] dari [Zur'ah Muslim bin Jarhad] sesungguhnya Nabi Shallallahu'alaihiwasallam melihat Jarhad dalam masjid dengan memakai selendang dan pahanya tersingkap. Beliau bersabda: \"Paha adalah aurat\"."
            },
            {
                "number": 739,
                "arab": "حَدَّثَنَا سُفْيَانُ حَدَّثَنَا أَبُو الزِّنَادِ وَقَالَ أَخْبَرَنِي آلُ جَرْهَدٍ عَنْ جَرْهَدٍ قَالَالْفَخِذُ عَوْرَةٌ",
                "id": "Telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami [Abu Az Zanad] dan berkata; telah mengabarkan kepadaku [keluarga Jarhad] dari [Jarhad] berkata; paha adalah aurat."
            },
            {
                "number": 740,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنْ أَبِي الزِّنَادِ عَنِ ابْنِ جَرْهَدٍ عَنْ أَبِيهِ قَالَمَرَّ بِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا كَاشِفٌ فَخِذِي فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَطِّهَا فَإِنَّهَا مِنْ الْعَوْرَةِ",
                "id": "Telah menceritakan kepada kami [Abdurrazzaq] berkata; telah menceritakan kepada kami [Ma'mar] dari [Abu Ziyad] dari [Ibnu Jarhad] dari [Bapaknya] berkata; Rasulullah Shallallahu'alahiwasallam melewatiku dan saya dalam keadaan terbuka pahaku, lalu Nabi Shallallahu'alaihiwasallam bersabda: \"Tutuplah, sesungguhnya itu adalah bagian dari aurat\"."
            }
        ]
    }
}