{
    "status": true,
    "data": {
        "start": 3849,
        "end": 3996,
        "total": 148,
        "book": "ahmad",
        "hadits": [
            {
                "number": 3849,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ أُخْتِ عُكَّاشَةَ بْنِ مِحْصَنٍ قَالَتْدَخَلْتُ بِابْنٍ لِي عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمْ يَأْكُلْ الطَّعَامَ فَبَالَ فَدَعَا بِمَاءٍ فَرَشَّهُ وَدَخَلْتُ بِابْنٍ لِي قَدْ أَعْلَقْتُ عَنْهُ وَقَالَ مَرَّةً عَلَيْهِ مِنْ الْعُذْرَةِ فَقَالَ عَلَامَ تَدْغَرْنَ أَوْلَادَكُنَّ بِهَذَا الْعِلَاقِ عَلَيْكُمْ بِهَذَا الْقُسْطِ وَقَالَ مَرَّةً سُفْيَانُ الْعُودِ الْهِنْدِيِّ فَإِنَّ بِهِ سَبْعَةَ أَشْفِيَةٍ مِنْهَا ذَاتُ الْجَنْبِ يُسْعَطُ مِنْ الْعُذْرَةِ وَيُلَدُّ مِنْ ذَاتِ الْجَنْبِ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [AzZuhri] dari ['ubaidhullah] dari [Ummu Qais binti Mihshan] saudara perempuannya Ukasah bin Mihshan, dia berkata, \"Aku menemui Rasulullah shallallahu 'alaihi wasallam bersama anak laki-lakiku yang belum bisa makan, kemudian dia kencing, maka beliau meminta air lalu menyiramnya. Aku juga pernah menemui beliau dengan anak laki-lakiku yang aku memakaikan kalung di lehernya -sekali waktu ia menyebutkan; karena sakit-, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kenapa kalian menggantungkankan kalung ini pada anak kalian yang sakit? Hendaknya kalian memakai kust (sejenis kayu) ini.\" Sekali waktu Sufyan menyebutkan, \"Kayu Hindi, karena di dalamnya ada tujuh macam kesembuhan, di antaranya; penyakit tulang rusuk, bisa menyembuhkan penyakit dan menghilangkan penyakit tulang rusuk.\""
            },
            {
                "number": 3850,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ قَالَ حَدَّثَنِي ثَابِتٌ أَبُو الْمِقْدَامِ قَالَ حَدَّثَنِي عَدِيُّ بْنُ دِينَارٍ قَالَ سَمِعْتُ أُمَّ قَيْسٍ بِنْتَ مِحْصَنٍ قَالَتْسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الثَّوْبِ يُصِيبُهُ دَمُ الْحَيْضِ قَالَ حُكِّيهِ بِضِلَعٍ وَاغْسِلِيهِ بِالْمَاءِ وَالنَّدِّ وَسِدْرٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] berkata, telah menceritakan kepadaku [Tsabit Abu Miqdam] berkata, telah menceritakan kepadaku ['Ady bin Dinar] berkata kepadaku, dia berkata, \"Aku mendengar [Ummi Qais binti Mihshan] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam tentang pakaian yang terkena darah haid, beliau bersabda: \"Keriklah ia dengan kayu dan cucilah dengan air, wewangian dan daun bidara.\""
            },
            {
                "number": 3851,
                "arab": "حَدَّثَنَا حَجَّاجٌ وهَاشِمٌ قَالَا حَدَّثَنَا لَيْثٌ قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنْ أَبِي الْحَسَنِ مَوْلَى أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ عَنْ أُمِّ قَيْسٍ أَنَّها قَالَتْتُوُفِّيَ ابْنِي فَجَزِعْتُ عَلَيْهِ فَقُلْتُ لِلَّذِي يَغْسِلُهُ لَا تَغْسِلْ ابْنِي بِالْمَاءِ الْبَارِدِ فَتَقْتُلَهُ فَانْطَلَقَ عُكَّاشَةُ بْنُ مِحْصَنٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ بِقَوْلِهَا فَتَبَسَّمَ ثُمَّ قَالَ مَا قَالَتْ طَالَ عُمْرُهَاقَالَ فَلَا أَعْلَمُ امْرَأَةً عُمِّرَتْ مَا عُمِّرَتْ",
                "id": "Telah menceritakan kepada kami [Hajjaj] dan [Hasyim] keduanya berkata, telah menceritakan kepada kami [Laits] berkata, telah menceritakan kepadaku [Yazid bin Abu Habib] dari [Abu Al Hasan] bekas budaknya Ummu Qais, dari [Ummi Qais] dia berkata, anakku meninggal dan aku menderita sakit karenanya, lalu aku berkata kepada yang memandikannya, \"Janganlah kamu memandikan anakku dengan air yang dingin karena kamu bisa membunuhnya.\" kemudian 'Ukasyah bin Mihshan pergi menemui Rasulullah shallallahu 'alaihi wasallam dan mengabari beliau apa yang dikatakannya, maka beliaupun tersenyum kemudian bersabda: \"Dia tidak mengatakan umurnya akan panjang.\" Ukasyah berkata, \"Aku tidak tahu wanita lain yang diberi umur seperti umurnya.\""
            },
            {
                "number": 3852,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ أُمِّْ قَيْسٍ بِنْتِ مِحْصَنٍ الْأَسَدِيَّةِ أُخْتِ عُكَّاشَةَ قَالَتْجِئْتُ بِابْنٍ لِي قَدْ أَعْلَقْتُ عَنْهُ أَخَافُ أَنْ يَكُونَ بِهِ الْعُذْرَةُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَامَ تَدْغَرْنَ أَوْلَادَكُنَّ بِهَذِهِ الْعَلَائِقِ عَلَيْكُنَّ بِهَذَا الْعُودِ الْهِنْدِيِّ قَالَ يَعْنِي الْكُسْتَ فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ مِنْهَا ذَاتُ الْجَنْبِ ثُمَّ أَخَذَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَبِيَّهَا فَوَضَعَهُ فِي حِجْرِهِ فَبَالَ عَلَيْهِ فَدَعَا بِمَاءٍ فَنَضَحَهُ وَلَمْ يَكُنْ الصَّبِيُّ بَلَغَ أَنْ يَأْكُلَ الطَّعَامَقَالَ الزُّهْرِيُّ فَمَضَتْ السُّنَّةُ بِأَنْ يُرَشَّ بَوْلُ الصَّبِيِّ وَيُغْسَلَ بَوْلُ الْجَارِيَةِ قَالَ الزُّهْرِيُّ فَيُسْتَسْعَطُ لِلْعُذْرَةِ وَيُلَدُّ لِذَاتِ الْجَنْبِ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] berkata, telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [ubaidhullah bin Abdullah bin Utbah] dari [Ummu Qais binti Mihshan Al Asadiyah] saudara perempuannya Ukasah, dia berkata, \"Aku datang bersama anak laki-lakiku yang aku pakaikan kalung di lehernya, karena khawatir jika ia terkena penyakit. Nabi shallallahu 'alaihi wasallam lalu bersabda: \"Kenapa kalian menggantungkankan kalung ini di bagian yang sakit pada anak kalian, hendaknya kalian memakai kayu Hindy ini.\" -perawi berkata; yakni al kust (sejenis kayu beraroma wangi) - karena di dalamnya ada tujuh macam kesembuhan, di antaranya penyakit tulang rusuk.\" Kemudian Nabi shallallahu 'alaihi wasallam mengambil anak tersebut dan meletakkannya pangkuan beliau, namun anak itu mengencinginya hingga beliau minta diambilkan air seraya memercikinya, dan anak itu belum memakan makanan.\" Az Zuhry berkata, \"Maka berlakulah sunnah bahwa kencingnya bayi laki-laki itu cukup diperciki, sedangkan anak perempuan dicucui.\" Az Zuhry berkata, \"Maka ia (kayu Hindi) dapat menyembuhkan penyakit dan mencegah penyakit tulang rusuk.\""
            },
            {
                "number": 3853,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلُ عَنْ ثَابِتٍ أَبِي الْمِقْدَامِ عَنْ عَدِيِّ بْنِ دِينَارٍ عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ قَالَتْسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ دَمِ الْحَيْضِ يُصِيبُ الثَّوْبَ فَقَالَ حُكِّيهِ وَلَوْ بِضِلَعٍ",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Israil] dari [Tsabit Abu Miqdam] dari [Adi bin Dinar] dari [Ummu Qais binti Mihshan] dia berkata, \"Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang darah haid yang mengenai pakaian, beliau bersabda: \"Keriklah ia walaupun dengan kayu.\""
            },
            {
                "number": 3854,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ ثَابِتٍ عَنْ عَدِيِّ بْنِ دِينَارٍ مَوْلَى أُمِّ قَيْسٍ عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ قَالَتْسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ دَمِ الْحَيْضِ يُصِيبُ الثَّوْبَ فَقَالَ اغْسِلِيهِ بِمَاءٍ وَسِدْرٍ وَحُكِّيهِ بِضِلَعٍ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Mahdi] berkata, telah menceritakan kepada kami [Sufyan] dari [Tsabit] dari [Adi bin Dinar] bekas budak Ummu Qais, dari [Ummu Qais binti Mihshan] dia berkata, \"Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang darah haid yang mengenai pakaian, beliau bersabda: \"Cucilah ia dengan air yang dicampur daun bidara dan gosoklah dengan kayu.\""
            },
            {
                "number": 3855,
                "arab": "حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ قَالَ أَخْبَرَنَا يُونُسُ عَنِ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ أَنَّ أُمَّ قَيْسٍ بِنْتَ مِحْصَنٍ إِحْدَى بَنِي أَسَدِ بْنِ خُزَيْمَةَ وَكَانَتْ مِنْ الْمُهَاجِرَاتِ الْأُوَلِ اللَّائِي بَايَعْنَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فَأَخْبَرَتْنِي أَنَّهَا أَتَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِابْنٍ لَهَا لَمْ يَبْلُغْ أَنْ يَأْكُلَ الطَّعَامَ فَذَكَرَ الْحَدِيثَ وَقَالَ عَلَامَ تَدْغَرْنَ أَوْلَادَكُنَّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَقَالَ حَدَّثَنَا مَعْمَرٌ قَالَ حَدَّثَنَا الزُّهْرِيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ عَنْ أُمِّْ قَيْسٍ بِنْتِ مِحْصَنٍأَنَّهَا جَاءَتْ بِابْنٍ لَهَا وَقَدْ أَعْلَقَتْ عَلَيْهِ مِنْ الْعُذْرَةِ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَامَ تَدْغَرْنَ أَوْلَادَكُنَّ بِهَذِهِ الْعُلُقِ عَلَيْكُنَّ بِهَذَا الْعُودِ الْهِنْدِيِّ فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ مِنْهَا ذَاتُ الْجَنْبِ ثُمَّ أَخَذَ الصَّبِيَّ فَبَالَ عَلَيْهِ فَدَعَا بِمَاءٍ فَنَضَحَهُقَالَ ابْنُ شِهَابٍ مَضَتْ السُّنَّةُ بِذَلِكَ",
                "id": "Telah menceritakan kepada kami [Utsman bin Umar] berkatam telah mengabarkan kepada kami [Yunus] dari [Az Zuhri] dari [ubaidhullah bin Abdullah bin Utbah] bahwa [Ummu Qais binti Mihshan] -seorang wanita dari Bani Asad bin Khuzaimah, dan dia termasuk wanita yang pertama kali berhijrah, yang berbaiat kepada Rasulullah shallallahu 'alaihi wasallam- dia berkata, \"Ummu Qais mengabarkan kepadaku bahwa dia pernah menemui Rasulullah shallallahu 'alaihi wasallam dengan anaknya yang belum bisa menelan makanan, lalu dia menyebutkan hadits. Beliau bersabda: \"Atas dasar apa kalian menekan bagian yang sakit pada anak kalian?\" Abdullah berkata; telah menceritakan kepada kami [Muhammad bin Ja'far], dan telah menceritakan kepada kami [Ma'mar] berkata; telah menceritakan kepada kami [Az Zuhr] dari [Ubidullah bin Utbah bin Mas'ud] dari [Ummu Qais binti Mihshan] bahwa dia datang dengan anaknya dan dia memakaikan kalung dilehernya karena sakit di tenggorokannya, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Atas dasar apa kalian menekah pada bagian yang sakit anak kalian dengan mengantungkan benda ini? hendaklah kalian pakaikan kayu Hindi ini, karena di dalamnya tujuh macam kesembuhan, di antaranya penyakit tulang rusuk.\" Lalu beliau meraih anak itu, namun ia mengencingi beliau, beliau lantas minta air dan menyiramnya.\" Ibnu Syihab berkata, \"Maka berlakukan sunnah seperti itu.\""
            },
            {
                "number": 3856,
                "arab": "حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سَهْلَةَ امْرَأَةِ أَبِي حُذَيْفَةَ أَنَّهَا قَالَتْقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ سَالِمًا مَوْلَى أَبِي حُذَيْفَةَ يَدْخُلُ عَلَيَّ وَهُوَ ذُو لِحْيَةٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْضِعِيهِ فَقَالَتْ كَيْفَ أُرْضِعُهُ وَهُوَ ذُو لِحْيَةٍ فَأَرْضَعَتْهُ فَكَانَ يَدْخُلُ عَلَيْهَا",
                "id": "Telah menceritakan kepada kami [Yunus bin Muhammad] berkata, telah menceritakan kepada kami [Hammad] -yakni Ibnu Salamah- dari ['Abdurrahman bin Al Qasim] dari [Al Qasim bin Muhammad] dari [Shalah] istri Abu Hudzaifah, dia berkata, \"Aku berkata, \"Wahai Rasulullah, sesungguhnya Salim, bekas budak Abu Hudzaifah, masuk rumahku sedang dia sudah tumbuh jenggotnya. Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Susuilah dia.\" Isteri Abu Hudzaifah berkata, \"Bagaimana aku menyusuinya sedangkan jenggotnya telah tumbuh?\" Namuan kemudian ia menyusuinya sehingga Salim pun bisa masuk ke dalam rumahnya.\""
            },
            {
                "number": 3857,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ قَالَ سَمِعَ ابْنُ الْمُنْكَدِرِ أُمَيْمَةَ بِنْتَ رُقَيْقَةَ تَقُولُبَايَعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نِسْوَةٍ فَلَقَّنَنَا فِيمَا اسْتَطَعْتُنَّ وَأَطَقْتُنَّ قُلْتُ اللَّهُ وَرَسُولُهُ أَرْحَمُ مِنَّا مِنْ أَنْفُسِنَا قُلْتُ يَا رَسُولَ اللَّهِ بَايِعْنَا قَالَ إِنِّي لَا أُصَافِحُ النِّسَاءَ إِنَّمَا قَوْلِي لِامْرَأَةٍ قَوْلِي لِمِائَةِ امْرَأَةٍ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] berkata; [Ibnu Munkadir] mendengar [Umaimah binti Ruqaiqah] berkata, \"Aku membaiat Rasulullah shallallahu 'alaihi wasallam dengan beberapa wanita, lalu beliau mentalqin kami pada apa yang kami bisa dan mampu. Aku berkata, \"Allah dan Rasul-Nya lebih menyayangi kita daripada diri kita. Aku pun berkata, \"Wahai Rasulullah, baatlah kami!\" Beliau bersabda: 'Sesungguhnya aku tidak menjabat tangan wanita, hanyasanya perkataanku untuk seorang wanita sebagaimana perkataanku untuk seratus wanita.\""
            },
            {
                "number": 3858,
                "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنِي أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ عَنْ أُمَيْمَةَ بِنْتِ رُقَيْقَةَ التَّيْمِيَّةِ قَالَتْأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نِسْوَةٍ مِنْ الْمُسْلِمِينَ لِنُبَايِعَهُ فَقُلْنَا يَا رَسُولَ اللَّهِ جِئْنَا لِنُبَايِعَكَ عَلَى أَنْ لَا نُشْرِكَ بِاللَّهِ شَيْئًا وَلَا نَسْرِقَ وَلَا نَزْنِيَ وَلَا نَقْتُلَ أَوْلَادَنَا وَلَا نَأْتِيَ بِبُهْتَانٍ نَفْتَرِيهِ بَيْنَ أَيْدِينَا وَأَرْجُلِنَا وَلَا نَعْصِيَكَ فِي مَعْرُوفٍ قَالَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيمَا اسْتَطَعْتُنَّ وَأَطَعْتُنَّ قَالَتْ قُلْنَا اللَّهُ وَرَسُولُهُ أَرْحَمُ بِنَا مِنْ أَنْفُسِنَا بَايِعْنَا يَا رَسُولَ اللَّهِ قَالَ اذْهَبْنَ فَقَدْ بَايَعْتُكُنَّ إِنَّمَا قَوْلِي لِمِائَةِ امْرَأَةٍ كَقَوْلِي لِامْرَأَةٍ وَاحِدَةٍ قَالَتْ وَلَمْ يُصَافِحْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنَّا امْرَأَةً",
                "id": "Telah menceritakan kepada kami [Ya'kub bin Ibrahim] berkata, telah menceritakan kepadaku [Bapakku] dari [Ibnu Ishaq] berkata, telah menceritakan kepadaku [Muhammad bin Al Munkadir] dari [Umaimah binti Ruqaiqah At Taimiyah] dia berkata, \"Aku menemui Rasulullah shallallahu 'alaihi wasallam dengan beberapa wanita dari kaum Muslimin untuk berbaiat kepada beliau, kami berkata, \"Wahai Rasulullah, kami datang membaiatmu untuk tidak menyekutukan Allah dengan sesutu pun, tidak mencuri, tidak berzina, tidak akan membunuh anak-anak kami, tidak akan berbuat dusta yang mereka ada-adakan antara tangan dan kaki kami dan tidak akan mendurhakaimu dalam urusan yang baik.\" Umaimah berkata, \"Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Menurut kemampuan kalian dan ketaatan kalian.\" Umaimah berkata, \"Kami berkata, \"Allah dan Rasul-Nya lebih menyayangi kita daripada diri kita, wahai Rasulullah, baiatlah kami!\" Beliau bersabda: \"Pergilah, sesungguhnya aku telah membaiat kalian semua, hanyasanya perkataanku untuk seratus wanita sebagaimana perkatanku untuk satu orang wanita.\" Umaimah berkata, \"Rasulullah shallallahu 'alaihi wasallam tidak menjabat tangan wanita dari kami.\""
            },
            {
                "number": 3859,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى قَالَ أَخْبَرَنَا مَالِكٌ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ أُمَيْمَةَ بِنْتِ رُقَيْقَةَ أَنَّها قَالَتْأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نِسْوَةٍ نُبَايِعُهُ فَقُلْنَا يَا رَسُولَ اللَّهِ نُبَايِعُكَ عَلَى أَنْ لَا نُشْرِكَ بِاللَّهِ شَيْئًا وَلَا نَسْرِقَ وَلَا نَزْنِيَ وَلَا نَأْتِيَ بِبُهْتَانٍ نَفْتَرِيهِ بَيْنَ أَيْدِينَا وَأَرْجُلِنَا وَلَا نَعْصِيَكَ فِي مَعْرُوفٍ قَالَ قَالَ فِيمَا اسْتَطَعْتُنَّ وَأَطَعْتُنَّ قَالَتْ فَقُلْنَا اللَّهُ وَرَسُولُهُ أَرْحَمُ بِنَا مِنَّا بِأَنْفُسِنَا هَلُمَّ نُبَايِعُكَ يَا رَسُولَ اللَّهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَا أُصَافِحُ النِّسَاءَ إِنَّمَا قَوْلِي لِمِائَةِ امْرَأَةٍ كَقَوْلِي لِامْرَأَةٍ وَاحِدَةٍ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Isa] berkata, telah mengabarkan kepada kami [Malik] dari [Muhammad bin Al Munkadir] dari [Umaimah binti Ruqaiqah] bahwa dia berkata, \"Aku menemui Rasulullah shallallahu 'alaihi wasallam bersama para wanita untuk membaiatnya. Kami katakanm \"Wahai Rasulullah, kami membaiatmu untuk tidak menyekutukan Allah dengan sesuatu apapun, tidak mencuri, tidak berzina, tidak berdusta yang kami ada-adakan antara tangan dan kaki kami, dan tidak durhaka terhadap tuan dalam hal yang ma'ruf.\" Umaimah berkata, \"Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Menurut kemampuan dan ketaatan kalian.\" Umaimah berkata, \"Kemudian kami berkata, \"Allah dan Rasul-Nya lebih menyayangi kita daripada diri kita, kemarilah wahai Rasulullah, kami akan membaiatmu. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku tidak berjabat tangan wanita, hanyasanya perkataanku untuk seratus wanita sebagaimana perkataanku untuk satu orang wanita.\""
            },
            {
                "number": 3860,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدٍ يَعْنِي ابْنَ الْمُنْكَدِرِ عَنْ أُمَيْمَةَ بِنْتِ رُقَيْقَةَ قَالَتْأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نِسَاءٍ نُبَايِعُهُ فَأَخَذَ عَلَيْنَا مَا فِي الْقُرْآنِ أَنْ لَا نُشْرِكَ بِاللَّهِ شَيْئًا الْآيَةَ قَالَ فِيمَا اسْتَطَعْتُنَّ وَأَطَعْتُنَّ قُلْنَا اللَّهُ وَرَسُولُهُ أَرْحَمُ بِنَا مِنْ أَنْفُسِنَا قُلْنَا يَا رَسُولَ اللَّهِ أَلَا تُصَافِحُنَا قَالَ إِنِّي لَا أُصَافِحُ النِّسَاءَ إِنَّمَا قَوْلِي لِامْرَأَةٍ وَاحِدَةٍ كَقَوْلِي لِمِائَةِ امْرَأَةٍ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Mahdi] berkata, telah menceritakan kepada kami [Sufyan] dari [Muhammad] -yakni Ibnu Munkadir- dari [Umaimah binti Ruqaiqah] dia berkata, \"Aku mendatangi Nabi shallallahu 'alaihi wasallam bersama dengan para wanita untuk membaiatnya, maka beliau mengambil (membaiat) atas kami sebagaimana yang ada dalam al-qur'an '(kami tidak menyekutukan Allah dengan sesuatu pun) ', beliau bersabda: \"Menurut kemampuan dan ketaatan kalian.\" Kami berkata, \"Allah dan Rasul-Nya lebih menyayangi kita daripada diri kita, kami berkata, \"Wahai Rasulullah, tidakkah tuan menjabat tangan kami?\" Beliau bersabda: \"Sesungguhnya perkataanku untuk satu orang wanita sebagaimana perkataanku untuk seratus wanita.\""
            },
            {
                "number": 3861,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ قَالَ سَمِعْتُ أُمَيْمَةَ بِنْتَ رُقَيْقَةَ تُحَدِّثُأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَسْتُ أُصَافِحُ النِّسَاءَ إِنَّمَا قَوْلِي لِامْرَأَةٍ وَاحِدَةٍ كَقَوْلِي لِمِائَةِ امْرَأَةٍ",
                "id": "Telah menceritakan kepada kami [Waki'] dia berkata, telah menceritakan kepada kami [Sufyan] dari [Muhammad bin Al Munkadir] dia berkata, aku mendengar [Umaimah binti Ruqaiqah] menceritakan, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Aku tidak menjabat tangan seorang wanita, hanyasanya perkataanku untuk satu orang wanita sebagaimana perkataanku untuk seratus orang wanita.\""
            },
            {
                "number": 3862,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنِي سُفْيَانُ عَنْ مَنْصُورٍ عَنْ رِبْعِيٍّ عَنِ امْرَأَتِهِ عَنْ أُخْتِ حُذَيْفَةَ قَالَتْخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا مَعْشَرَ النِّسَاءِ أَمَا لَكُنَّ فِي الْفِضَّةِ مَا تَحَلَّيْنَ أَمَا إِنَّهُ لَيْسَ مِنْكُنَّ امْرَأَةٌ تَحَلَّى ذَهَبًا تُظْهِرُهُ إِلَّا عُذِّبَتْ بِهِحَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ امْرَأَتِهِ عَنِ أُخْتِ خُذَيْفَةَ قَالَتْ خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَهُ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] berkata, telah menceritakan kepadaku [Sufyan] dari [Manshur] dari [Rib'i] dari [istrinya] dari [saudara perempuannya Khudzaifah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada kami, beliau bersabda: \"Wahai para wanita, silahkan kalian berhias dengan perak terserah kalian, namun ketahuilah bahwa tidaklah seseorang diantara kalian berhias dengan emas, kemudian ia tampakkan, kecuali ia akan disiksa.\" Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata; telah menceritakan kepada kami [Syu'bah] dari [Mansur] dari [Rib'i bin Hirasy] dari [istrinya] dari [saudari Hudzaifah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada kami….lalu dia menyebutkan (hadits) semisalnya.\""
            },
            {
                "number": 3863,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَ أَخْبَرَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ رِبْعِيٍّ عَنْ امْرَأَتِهِ عَنْ أُخْتِ حُذَيْفَةَ وَكُنَّ لَهُ أَخَوَاتٌ قَدْ أَدْرَكْنَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْخَطَبَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا مَعْشَرَ النِّسَاءِ أَلَيْسَ لَكُنَّ فِي الْفِضَّةِ مَا تَحَلَّيْنَ أَمَا إِنَّهُ لَيْسَتْ مِنْكُنَّ امْرَأَةٌ تَتَحَلَّى ذَهَبًا تُظْهِرُهُ إِلَّا عُذِّبَتْ بِهِ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Sufyan] dari [Manshur] dari [Rib'i] dari [istrinya] dari [saudarinya Khudzaifah] dan dia mempunyai beberapa saudari perempuan, \"Sungguh mereka telah bertemu Nabi shallallahu 'alaihi wasallam, dia berkata, \"Nabi shallallahu 'alaihi wasallam berkhutbah kepada kami, beliau katakan: \"Wahai para wanita, silahkan kalian berhias dengan perak terserah kalian, namun ketahuilah bahwa tidaklah seseorang diantara kalian berhias dengan emas, kemudian ia tampakkan, kecuali ia akan disiksa.\""
            },
            {
                "number": 3864,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ النُّعْمَانِ قَالَ سَمِعْتُ طَلْحَةَ الْأَيَامِيَّ يُحَدِّثُ وَيَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ النُّعْمَانِ عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ عَنِ امْرَأَةٍ مِنْ بَنِي عَبْدِ الْقَيْسِ عَنْ أُخْتِ عَبْدِ اللَّهِ بْنِ رَوَاحَةَ الْأَنْصَارِيِّعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ وَجَبَ الْخُرُوجُ عَلَى كُلِّ ذَاتِ نِطَاقٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] berkata, telah menceritakan kepada kami [Syu'bah] dari [Muhammad bin Nu'man] berkata, aku mendengar [Thalhah Al Ayyamiy] menceritakan, dan [Yahya bin Sa'id] dari [Syu'bah] berkata, telah mengabarkan kepadaku [Muhammad bin An Nu'man] dari [Thalhah bin Musharif] dari [seorang wanita] dari bani 'Abdul Qais, dari [saudarinya Abdullah bin Rawahah Al Anshari] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Wajib keluar yang telah menggunakan ikat pinggang.\""
            },
            {
                "number": 3865,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ قَالَ حَدَّثَتْنِي الرُّبَيِّعُ بِنْتُ مُعَوِّذِ ابْنِ عَفْرَاءَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْتِينَا فَيُكْثِرُ فَأَتَانَا فَوَضَعْنَا لَهُ الْمِيضَأَةَ فَتَوَضَّأَ فَغَسَلَ كَفَّيْهِ ثَلَاثًا وَمَضْمَضَ وَاسْتَنْشَقَ مَرَّةً مَرَّةً وَغَسَلَ وَجْهَهُ ثَلَاثًا وَذِرَاعَيْهِ ثَلَاثًا وَمَسَحَ رَأْسَهُ بِمَا بَقِيَ مِنْ وَضُوئِهِ فِي يَدَيْهِ مَرَّتَيْنِ بَدَأَ بِمُؤَخَّرِهِ ثُمَّ رَدَّ يَدَهُ إِلَى نَاصِيَتِهِ وَغَسَلَ رِجْلَيْهِ ثَلَاثًا وَمَسَحَ أُذُنَيْهِ مُقَدَّمَهُمَا وَمُؤَخَّرَهُمَا",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abdullah bin Muhammad bin Aqil] berkata, telah menceritakan kepadaku [Ar Rubayi' binti Mu'awidz bin Afra'] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam mendatangi kami dalam keadaan berdebu, kemudian kami menaruh untuknya bejana untuk berwudlu, maka beliau pun berwudlu. Beliau mencuci kedua telapaknya tangannya tiga kali, berkumur-kumur dan memasukkan air ke hidung (istinsyaq) sekali-sekali, kemudian membasuh mukanya tiga kali dan lengannya tiga kali, lalu mengusap kepalanya dari air sisa wudlunya yang ada di tangannya dua kali, beliau memulai dari pangkalnya kemudian mengembalikan tangannya sampai ke ujungnya, kemudian beliau mencuci kakinya tiga kali dan membasuh kedua telinganya dari pangkal dan akhirnya.\""
            },
            {
                "number": 3866,
                "arab": "حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ خَالِدِ بْنِ ذَكْوَانَ عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذِ ابْنِ عَفْرَاءَ قَالَتْكُنَّا نَغْزُو مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَسْقِي الْقَوْمَ وَنَخْدُمُهُمْ وَنَرُدُّ الْجَرْحَى وَالْقَتْلَى إِلَى الْمَدِينَةِ",
                "id": "Telah menceritakan kepada kami [Bisyr bin Al Mufadlal] dari [Khalid bin Dzakwan] dari [Rubayi' binti Mu'awidz bin 'Afra'] dia berkata, \"Kami berperang bersama Rasulullah shallallahu 'alaihi wasallam, kami memberi minum orang-orang dan membantu keperluan mereka, mengembalikan yang terluka dan yang gugur ke Madinah.\""
            },
            {
                "number": 3867,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذِ ابْنِ عَفْرَاءَ قَالَتْأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَوَضَعْنَا لَهُ الْمِيضَأَةَ فَتَوَضَّأَ ثَلَاثًا ثَلَاثًا وَمَسَحَ بِرَأْسِهِ مَرَّتَيْنِ بَدَأَ بِمُؤَخَّرِهِ وَأَدْخَلَ أُصْبُعَيْهِ فِي أُذُنَيْهِ",
                "id": "Telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Sufyan] dari [Abdullah bin Muhammad bin Aqil] dari [Ar Rubayi' binti Muawidz bin Afra'] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam menemui kami, kemudian kami meletakkan untuknya sebuah tempat wudlu hingga beliau pun tiga kali-tiga kali dan membasuh kepalanya dua kali. Beliau memulainya dari ujungnya, kemudian memasukkan kedua jarinya pada kedua telinganya.\""
            },
            {
                "number": 3868,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ شَرِيكٍ عَنِ ابْنِ عَقِيلٍ عَنْ الرُّبَيِّعِ بِنْتِ مُعَوِّذٍ قَالَتْأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقِنَاعٍ فِيهِ رُطَبٌ وَأَجْرُ زُغْبٍ فَوَضَعَ فِي يَدِي شَيْئًا فَقَالَ تَحَلَّيْ بِهَذَا وَاكْتَسِي بِهَذَا",
                "id": "Telah menceritakan kepada kami [Waki'] dari [Syarik] dari [Ibnu Aqil] dari [Rubayi' binti Mu'widz] dia berkata, \"Aku mendatangi Rasulullah shallallahu 'alaihi wasallam dengan membawa keranjang kurma ruthab dan ketimun yang masih muda, lalu beliau meletakkan di tanganku sesuatu dan bersabda: \"Berhiaslah dengan ini dan pakailah ini.\""
            },
            {
                "number": 3869,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ وَمُهَنَّأُ بْنُ عَبْدِ الْحَمِيدِ أَبُو شِبْلٍ قَالَا حَدَّثَنَا حَمَّادٌ عَنْ خَالِدِ بْنِ ذَكْوَانَ قَالَ عَبْدُ الصَّمَدِ فِي حَدِيثِهِ حَدَّثَنَا أَبُو الْحُسَيْنِ عَنِ الرُّبَيِّعِ وَقَالَ خَالِدٌ فِي حَدِيثِهِ قَالَ حَدَّثَتْنِي الرُّبَيِّعُ بِنْتُ مُعَوِّذِ ابْنِ عَفْرَاءَ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ عُرْسِي فَقَعَدَ فِي مَوْضِعِ فِرَاشِي هَذَا وَعِنْدِي جَارِيَتَانِ تَضْرِبَانِ بِالدُّفِّ وَتَنْدُبَانِ آبَائِي الَّذِينَ قُتِلُوا يَوْمَ بَدْرٍ فَقَالَتَا فِيمَا تَقُولَانِ وَفِينَا نَبِيٌّ يَعْلَمُ مَا يَكُونُ فِي الْيَوْمِ وَفِي غَدٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا هَذَا فَلَا تَقُولَاهُ",
                "id": "Telah menceritakan kepada kami [Abdus Shamad] dan [Muhanna' bin Abdul Hamid Abu Syibl] keduanya berkata, telah menceritakan kepada kami [Hammad] dari [Khalid bin Dzakwan], [Abdus Shamad] menyebutkan dalam haditsnya; telah menceritakan kepada kami [Abu Al Husain] dari [Rubayi'], dan [Khalid] menyebutkan dalam haditsnya, dia berkata, \"Rubayi' bin Mu'awidz bin 'Afra' menceritakan kepadaku, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam datang di hari pernikahanku, beliau duduk di kasurku ini. sementara aku mempunyai dua budak wanita yang sedang menabuh duff (gendang) dan mengisahkan tentang orang tuaku yang terbunuh pada perang Badar, di antara yang mereka dendangkan adalah, 'Di antara kita ada seorang Nabi yang mengetahui kejadian pada hari ini dan esok hari', kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Adapun tentang ini maka janganlah kalian mengatakannya.\""
            },
            {
                "number": 3870,
                "arab": "حَدَّثَنَا أَبُو سَلَمَةَ الْخُزَاعِيُّ قَالَ أَخْبَرَنَا شَرِيكٌ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذِ ابْنِ عَفْرَاءَ قَالَتْأَهْدَيْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قِنَاعًا مِنْ رُطَبٍ وَأَجْرٍ زُغْبٍ قَالَتْ فَأَعْطَانِي مِلْءَ كَفَّيْهِ حُلِيًّا أَوْ قَالَ ذَهَبًا فَقَالَ تَحَلَّيْ بِهَذَا",
                "id": "Telah menceritakan kepada kami [Abu Salamah Al Khuza'i] berkata, telah mengabarkan kepada kami [Syarik] dari [Abdullah bin Muhammad bin Aqil] dari [Ar Rubayi' binti Al Mu'awidz bin Afra'] dia berkata, \"Aku memberi hadiah kepada Rasulullah shallallahu 'alaihi wasallam satu keranjang kurma segar dan mentimun yang masih muda, kemudian beliau meletakkan di tanganku satu genggam batu permata -atau ia mengatakan; emas- seraya bersabda: \"Berhiaslah dengan ini.\""
            },
            {
                "number": 3871,
                "arab": "حَدَّثَنَا يُونُسُ قَالَ حَدَّثَنَا لَيْثٌ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلِ بْنِ أَبِي طَالِبٍ عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذِ ابْنِ عَفْرَاءَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ عِنْدَهَا فَمَسَحَ الرَّأْسَ كُلَّهُ مِنْ فَوْقِ الشَّعْرِ كُلِّ نَاحِيَةٍ لِمُنْصَبِّ الشَّعْرِ لَا يُحَرِّكُ الشَّعْرَ عَنْ هَيْئَتِهِ",
                "id": "Telah menceritakan kepada kami [Yunus] berkata, telah menceritakan kepada kami [Laits] dari [Muhammad bin Ajlan] dari [Abdullah bin Muhammad bin Aqil bin Abu Thalib] dari [Ar Rubayi' binti Mu'awidz bin 'Afra'] bahwa Rasulullah shallallahu 'alaihi wasallam berwudlu di sampingnya, maka beliau membasuh kepala semuanya dari atas rambut sampai kecelah-celah rambutnya, beliau tidak merubah posisi rambut dari asalnya.\""
            },
            {
                "number": 3872,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ قَالَ حَدَّثَنَا خَالِدُ بْنُ ذَكْوَانَ قَالَ حَدَّثَتْنِي رُبَيِّعُ بِنْتُ مُعَوِّذٍ قَالَتْبَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قُرَى الْأَنْصَارِ قَالَ مَنْ كَانَ مِنْكُمْ صَائِمًا فَلْيُتِمَّ صَوْمَهُ وَمَنْ كَانَ أَكَلَ فَلْيَصُمْ بَقِيَّةَ يَوْمِهِ",
                "id": "Telah menceritakan kepada kami ['Affan] dia berkata, telah menceritakan kepada kami ['Abdul Wahid bin Ziyad] dia berkata, telah menceritakan kepada kami [Khalid bin Dzakwan] dia berkata, telah menceritakan kepadaku [Rubayi' binti Mu'awidz] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutus pada perkampungan Anshar seraya bersabda: \"Barangsiapa di antara kalian berpuasa hendaknya ia menyempurnakan puasanya, barangsiapa telah makan maka hendaknya ia berpuasa pada sisa harinya.\""
            },
            {
                "number": 3873,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ حَدَّثَنَا أَبُو حُسَيْنٍ قَالَكَانَ يَوْمٌ لِأَهْلِ الْمَدِينَةِ يَلْعَبُونَ فَدَخَلْتُ عَلَى الرُّبَيِّعِ بِنْتِ مُعَوِّذِ ابْنِ عَفْرَاءَ فَقَالَتْ دَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَعَدَ عَلَى مَوْضِعَ فِرَاشِي هَذَا وَعِنْدِي جَارِيَتَانِ تَنْدُبَانِ آبَائِي الَّذِينَ قُتِلُوا يَوْمَ بَدْرٍ تَضْرِبَانِ بِالدُّفُوفِ وَقَالَ عَفَّانُ مَرَّةً بِالدُّفِّ فَقَالَتَا فِيمَا تَقُولَانِ وَفِينَا نَبِيٌّ يَعْلَمُ مَا يَكُونُ فِي غَدٍ فَقَالَ أَمَّا هَذَا فَلَا تَقُولَاهُ",
                "id": "Telah menceritakan kepada kami [Affan] berkata, telah menceritakan kepada kami [Hammad bin Salamah] berkata, telah menceritakan kepada kami [Abu Husain] berkata, \"Suatu hari penduduk Madinah mengadakan permainan, kemudian aku menemui [Rubayi' binti Mu'awidz bin Afra'], dia berkata, \"Rasulullah shallallahu 'alaihi wasallam menemuiku, kemudian beliau duduk di salah satu dipanku ini, sedangkan aku memiliki dua orang pelayan perempuan yang sedang menabuh rebana mengenang para bapak-bapak mereka yang terbunuh pada waktu perang Badar. -Sekali waktu Affan menyebutkan 'rebana'- Dan di antara yang mereka dendangkan adalah, 'Di antara kami ada seorang nabi yang mengetahui perihal esok hari', maka beliau bersabda: \"Adapun yang ini, hendaklah kalian berdua tidak mengucapkannya.\""
            },
            {
                "number": 3874,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا لَيْثٌ عَنِ ابْنِ عَجْلَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنِ الرُّبَيِّعِ بِنْتِ مُعَوِّذٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ عِنْدَهَا فَمَسَحَ بِرَأْسِهِ الرَّأْسِ كُلِّهِ مِنْ وَرَاءِ الشَّعْرِ كُلَّ نَاحِيَةٍ لِمُنْصَبِّ الشَّعْرِ لَا يُحَرِّكُ الشَّعْرَ عَنْ هَيْئَتِهِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Laits] dari [Ibnu Ajlan] dari [Abdullah bin Muhammad bin Aqil] dari [Ar Rubayi' binti Mu'awidz] bahwa Rasulullah shallallahu 'alaihi wasallam berwudlu di sisinya, beliau lalu membasuh kepala semuanya, dari belakang rambut sampai sisi rambut, sedangkan beliau tidak menggeser posisi rambutnya.\""
            },
            {
                "number": 3875,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الرَّازِيُّ قَالَ حَدَّثَنَا سَلَمَةُ بْنُ الْفَضْلِ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ إِسْحَاقَ عَنِ الْخَطَّابِ بْنِ صَالِحٍ عَنْ أُمِّهِ قَالَتْ حَدَّثَتْنِي سَلَامَةُ بِنْتُ مَعْقِلٍ قَالَتْكُنْتُ لِلْحُبَابِ بْنِ عَمْرٍو وَلِي مِنْهُ غُلَامٌ فَقَالَتْ لِيَ امْرَأَتُهُ الْآنَ تُبَاعِينَ فِي دَيْنِهِ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَاحِبُ تَرِكَةِ الْحُبَابِ بْنِ عَمْرٍو فَقَالُوا أَخُوهُ أَبُو الْيُسْرِ كَعْبُ بْنُ عَمْرٍو فَدَعَاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَا تَبِيعُوهَا وَأَعْتِقُوهَا فَإِذَا سَمِعْتُمْ بِرَقِيقٍ قَدْ حَسَبَنِي فَأْتُونِي أُعَوِّضُكُمْ فَفَعَلُوا فَاخْتَلَفُوا فِيمَا بَيْنَهُمْ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ قَوْمٌ أُمُّ الْوَلَدِ مَمْلُوكَةٌ لَوْلَا ذَلِكَ لَمْ يُعَوِّضْهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْهَا وَقَالَ بَعْضُهُمْ هِيَ حُرَّةٌ قَدْ أَعْتَقَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَفِيَّ كَانَ الِاخْتِلَافُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim Ar Razi] berkata, telah menceritakan kepada kami [Salamah bin Al Fadll] berkata, telah menceritakan kepadaku [Muhammad bin Ishaq] dari [Khatthab bin Shalih] dari [Ibunya] dia berkata, \" [Salamah binti Ma'qil] menceritakan kepadaku, ia berkata, \"Aku adalah budak Hubab bin Amru bersama seorang pemuda lain, lalu istrinya berkata kepadaku, 'Sekarang kamu akan dijual untuk memenuhi hutangnya', lalu aku mendatangi Rasulullah shallallahu 'alaihi wasallam dan menyampaikan hal itu pada beliau, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapakah pemilik warisan Hubab bin Amru?\" para shabat menjawab, \"Saudaranya, Abu Yusr Ka'ab bin Amru.\" Kemudian Rasulullah shallallahu 'alaihi wasallam memanggilnya dan bersabda: \"Janganlah kamu menjualnya, namun bebaskanlah dia. Jika kamu mendengar ada budak telah menahanku, maka datanglah kepadaku maka aku akan menggantikannya.\" Maka mereka pun melakukannya, lalu di antara mereka berselisih setelah wafatnya Rasulullah shallallahu 'alaihi wasallam, sekelompok orang berkata, 'Ummul Walad (budak yang melahirkan dari benih tuannya) itu dimilikinya, karena kalau tidak seperti itu maka Rasulullah shallallahu 'alaihi wasallam tidak akan menggantikannya.' Dan sebagian lain berkata, 'Dia mereka. Sebab Rasulullah shallallahu 'alaihi wasallam telah membebaskannya.' Maka status diriku ini masih diperselisihkan.\""
            },
            {
                "number": 3876,
                "arab": "حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ عَنْ هِلَالٍ يَعْنِي ابْنَ خَبَّابٍ عَنْ عِكْرِمَةَ عَنِ ابْنِ عَبَّاسٍ أَنَّ ضُبَاعَةَ بِنْتَ الزُّبَيْرِ بْنِ عَبْدِ الْمُطَّلِبِأَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ أَنْ أَحُجَّ فَأَشْتَرِطُ قَالَ نَعَمْ قَالَتْ فَكَيْفَ أَقُولُ قَالَ قُولِي لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ مَحِلِّي مِنْ الْأَرْضِ حَيْثُ تَحْبِسُنِي",
                "id": "Telah menceritakan kepada kami [Abbad bin Al Awwam] dari [Hilal] -yakni Ibnu Khabbab- dari [Ikrimah] dari [Ibnu Abbas] bahwa [Dluba'ah binti Zubair bin Abdul Mutthalib] menemui Nabi shallallahu 'alaihi wasallam, dia berkata, \"Wahai Rasulullah, sesungguhnya aku ingin pergi haji, bolehkah aku memberi syarat?\" Beliau menjawab: \"Ya.\" Dluba'ah lalu bertanya, \"Lantas apa yang harus aku ucapkan?\" Beliau menjawab: \"Ucapkanlah 'LABBAIK ALLAAHUMMA LABBAIK MAHALLI MINAL ARDLI HAITSU TAHBISUNI (Aku penuhi panggilan-Mu ya Allah, aku penuhi panggilan-Mu dari bumi hingga ia menghalangiku) '.\""
            },
            {
                "number": 3877,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ إِسْحَاقَ قَالَ حَدَّثَنِي ابْنُ مُبَارَكٍ عَنْ أُسَامَةَ بْنِ زَيْدٍ وَعَلِيُّ بْنُ إِسْحَاقَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ قَالَ أَخْبَرَنَا أُسَامَةُ بْنُ زَيْدٍ عَنِ الْفَضْلِ بْنِ الْفَضْلِ عَنْ عَبْدِ الرَّحْمَنِ الْأَعْرَجِ عَنْ ضُبَاعَةَ بِنْتِ الزُّبَيْرِ بْنِ عَبْدِ الْمُطَّلِبِأَنَّهَا ذَبَحَتْ فِي بَيْتِهَا شَاةً فَأَرْسَلَ إِلَيْهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَطْعِمِينَا مِنْ شَاتِكُمْ فَقَالَتْ لِلرَّسُولِ وَاللَّهِ مَا بَقِيَ عِنْدَنَا إِلَّا الرَّقَبَةُ وَإِنِّي أَسْتَحِي أَنْ أُرْسِلَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالرَّقَبَةِ فَرَجَعَ الرَّسُولُ فَأَخْبَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ ارْجِعْ إِلَيْهَا فَقُلْ لَهَا أَرْسِلِي بِهَا فَإِنَّهَا هَادِيَةٌ وَأَقْرَبُ الشَّاةِ إِلَى الْخَيْرِ وَأَبْعَدُهَا مِنْ الْأَذَى",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Ishaq] berkata, telah menceritakan kepadaku [Ibnu Mubarak] dari [Usamah bin Zaid] dan [Ali bin Ishaq] berkata, telah menceritakan kepada kami [Abdullah] berkata, telah mengabarkan kepada kami [Usamah bin Zaid] dari [Fadll bin Fadll] dari ['Abdurrahman Al A'raj] dari [Dluba'ah binti Zubair bin Abdul Mutthalib], bahwa dia menyembelih seekor kambing di rumahnya, lalu Rasulullah shallallahu 'alaihi wasallam mengirimkan utusan kepadanya agar kalian memberi makan kami dengan daging kambingmu, lalu Dluba'ah berkata kepada utusan beliau, \"Demi Allah, tidak ada sisa lagi kecuali hanya kakinya, dan aku malu jika aku mengirimkannya kepada Rasulullah shallallahu 'alaihi wasallam.\" Utusan itupun kembali dan mengabarkannya kepada Rasulullah shallallahu 'alaihi wasallam. Beliau lantas bersabda: \"Kembalilah kepadanya dan katakan 'kirimkanlah daging itu', sesungguhnya kambing itu adalah hadiah dan ia adalah daging kambing yang paling dekat kepada kebaikan dan yang paling jauh dari penyakit.\""
            },
            {
                "number": 3878,
                "arab": "حَدَّثَنَا رَوْحٌ قَالَ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أُمِّ حَرَامٍ أَنَّهَا قَالَتْبَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَائِلًا فِي بَيْتِي إِذْ اسْتَيْقَظَ وَهُوَ يَضْحَكُ فَقُلْتُ بِأَبِي وَأُمِّي أَنْتَ مَا يُضْحِكُكَ فَقَالَ عُرِضَ عَلَيَّ نَاسٌ مِنْ أُمَّتِي يَرْكَبُونَ ظَهْرَ هَذَا الْبَحْرِ كَالْمُلُوكِ عَلَى الْأَسِرَّةِ فَقُلْتُ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ قَالَ اللَّهُمَّ اجْعَلْهَا مِنْهُمْ ثُمَّ نَامَ أَيْضًا فَاسْتَيْقَظَ وَهُوَ يَضْحَكُ فَقُلْتُ بِأَبِي وَأُمِّي مَا يُضْحِكُكَ قَالَ عُرِضَ عَلَيَّ نَاسٌ مِنْ أُمَّتِي يَرْكَبُونَ هَذَا الْبَحْرَ كَالْمُلُوكِ عَلَى الْأَسِرَّةِ فَقُلْتُ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ قَالَ أَنْتِ مِنْ الْأَوَّلِينَفَغَزَتْ مَعَ عُبَادَةَ بْنِ الصَّامِتِ وَكَانَ زَوْجَهَا فَوَقَصَتْهَا بَغْلَةٌ لَهَا شَهْبَاءُ فَوَقَعَتْ فَمَاتَتْ حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أُمِّ حَرَامٍ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِي فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Rauh] berkata, telah menceritakan kepada kami [Hammad] -yakni Ibnu Salamah- dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Hiban] dari [Anas bin Malik] dari [Ummu Haram] dia berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam tidur siang di rumahku, tiba-tiba beliau bangun dan tertawa, aku lalu berkata, \"Demi ayah dan ibuku sebagai tebusanmu, kenapa tuan tertawa?\" Beliau menjawab: \"Ditampakkan orang-orang dari umatku yang mereka barlayar di atas laut ini seperti raja-raja atas tawanannya.\" Aku berkata do'akanlah agar aku menjadi bagian dari mereka, beliau pun bersabda: \"Ya Allah, jadikanlah dia bagian darinya.\" Kemudian Beliau tertidur kembali dan bangun dengan tertawa, aku lalu bertanya, \"Demi ayah dan ibuku sebagai tebusanmu, kenapa tuan tertawa?\" Beliau menjawab: \"Ditampakkan orang-orang dari umatku yang mereka barlayar di atas laut ini seperti raja-raja atas tawanannya.\" Aku pun berkata lagi, \"Do'akanlah agar aku menjadi bagian dari mereka.\" Beliau lalu bersabda: \"Kamu adalah termasuk yang pertama-tama.\" Maka Ummu Haram pun berperang bersama Ubadah bin Shamit suaminya, lalu bighal betinanya yang putih memecahkan lehernya hingga ia pun terjatuh dan gugur.\"Telah menceritakan kepada kami ['Affan] berkata; telah menceritakan kepada kami [Hammad bin Salamah] ia berkata; telah mengabarkan kepadaku [Yahya bin Sa'id] dari [Muhammad bin yahya bin Habban] dari [Anas bin Malik] dari [Ummu Haram] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam berada di rumahk….lalu dia menyebutkan (hadits) yang semakna dengannya.\""
            },
            {
                "number": 3879,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مَالِكٍ عَنْ أَبِي الْأَسْوَدِ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّ جُدَامَةَ بِنْتَ وَهْبٍ حَدَّثَتْهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَقَدْ هَمَمْتُ أَنْ أَنْهَى عَنْ الْغِيلَةِ حَتَّى ذَكَرْتُ أَنَّ فَارِسَ وَالرُّومَ يَصْنَعُونَهُ فَلَا يَضُرُّ أَوْلَادَهُمْ",
                "id": "Telah menceritakan kepada kami ['Abdurrahman bin Mahdi] dari [Malik] dari [Abu Al Aswad] dari [Urwah] dari [Aisyah] bahwa [Judamah binti Wahab] berkata kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh, tadinya aku ingin melarang dari ghilah, namun aku teringat bahwa orang-orang Persi dan Romawi malkukannya dan itu tidak membahayakan anak-anak mereka.\""
            },
            {
                "number": 3880,
                "arab": "حَدَّثَنَا أَبُو سَلَمَةَ الْخُزَاعِيُّ قَالَ أَخْبَرَنَا مَالِكٌ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ جُدَامَةَ بِنْتِ وَهْبٍ الْأَسَدِيَّةِ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَقَدْ هَمَمْتُ أَنْ أَنْهَى عَنْ الْغِيلَةِ حَتَّى ذَكَرْتُ أَنَّ فَارِسَ وَالرُّومَ يَفْعَلُونَ ذَلِكَ فَلَا يَضُرُّ أَوْلَادَهُمْ",
                "id": "Telah menceritakan kepada kami [Abu Salamah Al Khuza'i] berkata, telah mengabarkan kepada kami [Malik] dari [Muhammad bin 'Abdurrahman bin Naufal] dari [Urwah] dari ['Aisyah] dari [Judamah binti Wahb Al Asadiyah] dia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh, tadinya aku ingin melarang dari ghilah, namun aku teringat bahwa orang-orang Persi dan Romawi malkukannya dan itu tidak membahayakan anak-anak mereka.\""
            },
            {
                "number": 3881,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ أَخْبَرَنَا ابْنُ لَهِيعَةَ عَنْ أَبِي الْأَسْوَدِ عَنْ عُرْوَةَ عَنْ عَائِشَةَ عَنْ جُدَامَةَ بِنْتِ وَهْبٍ الْأَسَدِيَّةِ وَكَانَتْ مِنْ الْمُهَاجِرَاتِ الْأُوَلِ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الْعَزْلِ فَقَالَ هُوَ الْوَأْدُ الْخَفِيُّحَدَّثَنَا أبُو عَبدِ الْرَحَمَنِ قَالَ حَدَّثَنَا سَعِيدٌ يَعْنِي ابْنَ أَبِي أَيُّوبَ قَالَ حَدَّثَنِي أَبُو الْأَسْوَدِ فَذَكَرَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ishaq] telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Abu Al Aswad] dari [Urwah] dari [Aisyah] dari [Judamah binti Wahb Al Asadiyah] dan dia adalah wanita yang turut berhijrah pertama kali, dia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam ditanya mengenai 'Azl (mengeluarkan mani diluar kemaluan ketika berjima'), lalu beliau bersabda: \"Itu adalah pembunuhan terselubung.\" Telah menceritakan kepada kami Abu 'Abdurrahman ia berkata; telah menceritakan kepada kami Sa'id -yakni Ibn Abu Ayyub- ia berkata; telah menceritakan kepadaku Abu Aswad lalu ia menyebutkan (hadits tersebut).\""
            },
            {
                "number": 3882,
                "arab": "حَدَّثَنَا حَسَنٌ قَالَ حَدَّثَنَا ابْنُ لَهِيعَةَ قَالَ حَدَّثَنَا زَبَّانُ عَنْ سَهْلٍ عَنْ أَبِيهِ أَنَّهُ سَمِعَ أُمَّ الدَّرْدَاءِ تَقُولُخَرَجْتُ مِنْ الْحَمَّامِ فَلَقِيَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مِنْ أَيْنَ يَا أُمَّ الدَّرْدَاءِ قَالَتْ مِنْ الْحَمَّامِ فَقَالَ وَالَّذِي نَفْسِي بِيَدِهِ مَا مِنْ امْرَأَةٍ تَضَعُ ثِيَابَهَا فِي غَيْرِ بَيْتِ أَحَدٍ مِنْ أُمَّهَاتِهَا إِلَّا وَهِيَ هَاتِكَةٌ كُلَّ سِتْرٍ بَيْنَهَا وَبَيْنَ الرَّحْمَنِحَدَّثَنَا يَحْيَى بْنُ غَيْلَانَ قَالَ حَدَّثَنَا رِشْدِينُ قَالَ حَدَّثَنِي زَبَّانُ عَنْ سَهْلِ بْنِ مُعَاذٍ عَنْ أَبِيهِ أَنَّهُ سَمِعَ أُمَّ الدَّرْدَاءِ تَقُولُ خَرَجْتُ مِنْ الْحَمَّامِ فَلَقِيَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَهُ",
                "id": "Telah menceritakan kepada kami [Hasan] berkata, telah menceritakan kepada kami [Ibnu Lahi'ah] berkata, telah menceritakan kepada kami [Zabban] dari [Sahl] dari [Bapaknya] bahwa dia mendengar [Ummu Darda'] berkata, \"Aku keluar dari tempat pemandian umum, lalu aku bertemu dengan Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Darimana kamu wahai Ummi Darda'?\" dia menjawab, \"Dari tempat pemandian umum.\" Beliau bersabda: \"Tidaklah seorang wanita yang meletakkan bajunya di rumah selain dari rumah ibu-ibunya kecuali ia hanya membuka aibnya antara ia dengan Ar Rahman.\" Telah menceritakan kepada kami [Yahya bin Ghailan] ia berkata; telah menceritakan kepada kami [Risydin] ia berkata; telah menceritakan kepadaku [Zabban] dari [Sahl bin Muadz] dari [ayahnya] bahwa dia mendengar [Ummi Darda'] berkata, \"Aku keluar dari tempat pemandian umum dan bertemu dengan Rasulullah shallallahu 'alaihi wasallam….kemudian dia menyebutkan hadistnya.\""
            },
            {
                "number": 3883,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَلْحَلَةَ الدُّؤَلِيِّ عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ عَنْ أُمِّ الدَّرْدَاءِتَرْفَعُ الْحَدِيثَ قَالَتْ مَنْ رَابَطَ فِي شَيْءٍ مِنْ سَوَاحِلِ الْمُسْلِمِينَ ثَلَاثَةَ أَيَّامٍ أَجْزَأَتْ عَنْهُ رِبَاطَ سَنَةٍ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Isa] berkata, telah menceritakan kepada kami [Isma'il bin Iyyas] dari [Muhammad bin Amru bin Halhalah Ad Duali] dari [Ishaq bin Abdullah] dari [Ummu Darda'] yang dia marfu'kan haditsnya, dia berkata, \"Barangsiapa melakukan ribath di perbatasan-perbatasan kaum muslimin selama tiga hari, maka itu cukup baginya seperti ribath setahun.\""
            },
            {
                "number": 3884,
                "arab": "حَدَّثَنَا هَارُونُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ وَقَالَ حَيْوَةُ أَخْبَرَنِي أَبُو صَخْرٍ أَنَّ يُحَنَّسَ أَبَا مُوسَى حَدَّثَهُ أَنَّ أُمَّ الدَّرْدَاءِ حَدَّثَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقِيَهَا يَوْمًا فَقَالَ مِنْ أَيْنَ جِئْتِ يَا أُمَّ الدَّرْدَاءِ فَقَالَتْ مِنْ الْحَمَّامِ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ امْرَأَةٍ تَنْزِعُ ثِيَابَهَا إِلَّا هَتَكَتْ مَا بَيْنَهَا وَبَيْنَ اللَّهِ عَزَّ وَجَلَّ مِنْ سِتْرٍ",
                "id": "Telah menceritakan kepada kami [Harun] berkata, telah menceritakan kepada kami [Abdullah bin Wahb] berkata, dan [Haiwah] berkata, telah mengabarkan kepadaku [Abu Shahr] bahwa [Yuhannas Abu Musa] menceritakan kepadanya bahwa [Ummu Darda'] telah menceritakan kepadanya, bahwa suatu hari Rasulullah shallallahu 'alaihi wasallam bertemu dengannya, maka beliau bersabda: \"Dari mana kamu wahai Ummu Darda?\" Ummu Darda lalu menjawab, \"Dari tempat pemandian umum?\" kemudian beliau bersabda: \"Tidaklah seorang wanita yang melepas pakaiannya, kecuali ia membuka aibnya dari tabir antara dia dengan Allah Azza Wa Jalla.\""
            },
            {
                "number": 3885,
                "arab": "حَدَّثَنَا ابْنُ إِدْرِيسَ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ عَنْ أُمِّ مُبَشِّرٍ امْرَأَةِ زَيْدِ بْنِ حَارِثَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِ حَفْصَةَ فَقَالَ لَا يَدْخُلُ النَّارَ أَحَدٌ شَهِدَ بَدْرًا وَالْحُدَيْبِيَةَ قَالَتْ حَفْصَةُ أَلَيْسَ اللَّهُ عَزَّ وَجَلَّ يَقُولُ{ وَإِنْ مِنْكُمْ إِلَّا وَارِدُهَا }قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَهْ{ ثُمَّ نُنَجِّي الَّذِينَ اتَّقَوْا }",
                "id": "Telah menceritakan kepada kami [Ibnu Idris] berkata, telah menceritakan kepada kami [Al A'masy] dari [Abu Sufyan] dari [Jabir] dari [Ummu Mubasyir] isteri Zaid bin Haritsah, ia berkata, \"Saat Rasulullah shallallahu 'alaihi wasallam berada di rumah Hafshah, beliau bersabda: \"Tidak akan masuk neraka seseorang yang mengikuti perang Badar dan Hudaibiyah.\" Hafshah berkata, \"Bukankah Allah Azza Wa Jalla berfirman: '(Dan tidak ada seorangpun dari padamu, melainkan mendatangi neraka itu) ' (Qs. Maryam: 71). Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Lalu bagaimana dengan firman Allah Ta'ala: '(Kemudian kami akan menyelamatkan orang-orang yang bertaqwa) ' (Qs. Maryam: 72)."
            },
            {
                "number": 3886,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ أُمِّ مُبَشِّرٍ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ غَرَسَ غَرْسًا أَوْ زَرَعَ زَرْعًا فَأَكَلَ مِنْهُ إِنْسَانٌ أَوْ سَبُعٌ أَوْ دَابَّةٌ أَوْ طَيْرٌ فَهُوَ لَهُ صَدَقَةٌ",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masy] dari [Abu Sufyan] dari [Jabir bin Abdullah] dari [Ummu Mubasyir] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menanam tanaman, kemudian ada orang, atau binatang buas, atau hewan ternak, atau burung memakannya kecuali itu akan menjadi sedekah baginya.\""
            },
            {
                "number": 3887,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ عَنْ أُمِّ مُبَشِّرٍ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا فِي حَائِطٍ مِنْ حَوَائِطِ بَنِي النَّجَّارِ فِيهِ قُبُورٌ مِنْهُمْ قَدْ مَاتُوا فِي الْجَاهِلِيَّةِ فَسَمِعَهُمْ وَهُمْ يُعَذَّبُونَ فَخَرَجَ وَهُوَ يَقُولُ اسْتَعِيذُوا بِاللَّهِ مِنْ عَذَابِ الْقَبْرِ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ وَإِنَّهُمْ لَيُعَذَّبُونَ فِي قُبُورِهِمْ قَالَ نَعَمْ عَذَابًا تَسْمَعُهُ الْبَهَائِمُ",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] berkata, telah menceritakan kepada kami [Al A'masy] dari [Abu Sufyan] dari [Jabir] dari [Ummu Mubasyir] dia berkata, \"Saat Rasulullah shallallahu 'alaihi wasallam menemuiku, aku berada di salah satu kebun milik Bani Najjar yang di dalamnya banyak terdapat kuburan, yang di antara mereka ada yang telah mati si masa Jahiliyah. Ketika mendengar penghuni kubur tersebut disiksa, beliau pun keluar dan bersabda: \"Mintalah perlindungan kepada Allah dari adzab kubur.\" Ummu Mubasyir berkata, \"Wahai Rasulullah, apakah mereka diadzab dikuburan mereka?\" Beliau bersabda: \"Ya, adzab yang bisa didengar oleh hewan.\""
            },
            {
                "number": 3888,
                "arab": "حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو قَالَ حَدَّثَنَا زَائِدَةُ عَنْ سُلَيْمَانَ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ عَنْ أُمِّ مُبَشِّرٍ قَالَتْجَاءَ غُلَامُ حَاطِبٍ فَقَالَ وَاللَّهِ لَا يَدْخُلُ حَاطِبٌ الْجَنَّةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَذَبْتَ قَدْ شَهِدَ بَدْرًا وَالْحُدَيْبِيَةَ",
                "id": "Telah menceritakan kepada kami [Mu'awiyah bin Amru] berkata, telah menceritakan kepada kami [Zaidah] dari [Sulaiman] dari [Abu Sufyan] dari [Jabir] dari [Ummu mubasyir] dia berkata, \"Budak laki-lakinya Hatib datang dan berkata, \"Demi Allah, Hathib tidak akan masuk surga!\" Lalu Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kamu telah berdusta! Sungguh, dia telah menyaksikan perang badar dan juga peristiwa Hudaibiyyah.\""
            },
            {
                "number": 3889,
                "arab": "حَدَّثَنَا يَحْيَى عَنِ ابْنِ عَجْلَانَ قَالَ حَدَّثَنَا بُكَيْرُ بْنُ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَإِذَا شَهِدَتْ إِحْدَاكُنَّ الْعِشَاءَ فَلَا تَمَسَّ طِيبًا",
                "id": "Telah menceritakan kepada kami [Yahya] dari [Ibnu Ajlan] berkata, telah menceritakan kepada kami [Bukair bin Abdullah bin Al Asyaj] dari [Busr bin Sa'id] dari [Zainab] isteri Abdullah, dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Jika kalian mengikuti sholat isya' maka janganlah memakai minyak wangi.\""
            },
            {
                "number": 3890,
                "arab": "قَالَ حَدَّثَنَا يَعْقُوبُ وَسَعْدٌ قَالَا حَدَّثَنَا أَبِي عَنْ صَالِحٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ هِشَامٍ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ بُسْرِ بْنِ سَعِيدٍ قَالَ أَخْبَرَتْنِي زَيْنَبُ الثَّقَفِيَّةُ امْرَأَةُ عَبْدِ اللَّهِ بْنِ مَسْعُودٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَهَا إِذَا خَرَجَتْ إِحْدَاكُنَّ إِلَى الْعِشَاءِ فَلَا تَمَسَّ طِيبًا",
                "id": "Berkata, telah menceritakan kepada kami [Ya'kub] dan [Sa'd] keduanya berkata, telah menceritakan kepada kami [Bapakku] dari [Shalih] dari [Muhammad bin Abdullah bin Amru bin Hisyam] dari [Bukair bin Abdullah bin Al Asyaj] dari [Busr bin Sa'id] dia berkata, [Zainab As Tsaqafiyah] isteri Abdullah bin Mas'ud, mengabarkan kepadaku bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Jika di antara kalian mengikuti sholat isya' maka janganlah memakai minyak wangi.\""
            },
            {
                "number": 3891,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ عَمْرِو بْنِ الْحَارِثِ بْنِ الْمُصْطَلِقِ عَنِ ابْنِ أَخِي زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ عَنْ زَيْنَبَ قَالَتْخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا مَعْشَرَ النِّسَاءِ تَصَدَّقْنَ وَلَوْ مِنْ حُلِيِّكُنَّ فَإِنَّكُنَّ أَكْثَرُ أَهْلِ جَهَنَّمَ يَوْمَ الْقِيَامَةِ قَالَتْ وَكَانَ عَبْدُ اللَّهِ رَجُلًا خَفِيفَ ذَاتِ الْيَدِ فَقُلْتُ لَهُ سَلْ لِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُجْزِئُ عَنِّي مِنْ الصَّدَقَةِ النَّفَقَةُ عَلَى زَوْجِي وَأَيْتَامٍ فِي حِجْرِي قَالَتْ وَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أُلْقِيَتْ عَلَيْهِ الْمَهَابَةُ فَقَالَ اذْهَبِي أَنْتِ فَاسْأَلِيهِ قَالَتْ فَانْطَلَقْتُ فَانْتَهَيْتُ إِلَى بَابِهِ فَإِذَا عَلَيْهِ امْرَأَةٌ مِنْ الْأَنْصَارِ اسْمُهَا زَيْنَبُ حَاجَتِي حَاجَتُهَا قَالَتْ فَخَرَجَ عَلَيْنَا بِلَالٌ قَالَتْ فَقُلْنَا لَهُ سَلْ لَنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُجْزِئُ عَنَّا مِنْ الصَّدَقَةِ النَّفَقَةُ عَلَى أَزْوَاجِنَا وَأَيْتَامٍ فِي حُجُورِنَا قَالَتْ فَدَخَلَ عَلَيْهِ بِلَالٌ فَقَالَ عَلَى الْبَابِ زَيْنَبُ فَقَالَ أَيُّ الزَّيَانِبِ قَالَ فَقَالَ زَيْنَبُ امْرَأَةُ عَبْدِ اللَّهِ وَزَيْنَبُ امْرَأَةٌ مِنْ الْأَنْصَارِ تَسْأَلَانِكَ عَنْ النَّفَقَةِ عَلَى أَزْوَاجِهِمَا وَأَيْتَامٍ فِي حُجُورِهِمَا أَيُجْزِئُ ذَلِكَ عَنْهُمَا مِنْ الصَّدَقَةِ قَالَتْ فَخَرَجَ إِلَيْنَا فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهُمَا أَجْرَانِ أَجْرُ الْقَرَابَةِ وَأَجْرُ الصَّدَقَةِ",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Al A'masi] dari [Syaqiq] dari [Amru bin Al Harits bin Al Musthaliq] dari [anak] saudaranya Zainab isterinya Abdullah dari [Zainab] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada kami, beliau bersabda: \"Wahai para wanita bersedekahlah walaupun dengan perhiasan kalian, sesungguh kalian adalah penduduk Jahannam yang paling banyak pada hari Kiamat.\" Zainab berkata, \"Abdullah adalah seorang laki-laki yang kurus yang tangannya panjang, lalu aku berkata kepadanya, \"Tanyakan untukku pada Rasulullah shallallahu 'alaihi wasallam apakah cukup bagiku bersedekah dengan memberi nafkah pada suamiku dan anak-anak yatim yang aku asuh?\" Zainab berkata, \"Rasulullah shallallahu 'alaihi wasallam telah diberi pemberian, \" Ibnu Mas'ud lalu berkata, \"Pergilah kamu sendiri dan tanyakanlah.\" Maka aku pun pergi, hingga ketika aku sampai di pintu rumah beliau, ternyata di rumah beliau ada seorang wanita Anshar yang namanya Zainab. Keperluanku seperti keperluannya juga.\" Zainab berkata, \"Bilal kemudian keluar menemui kami.\" Zainab berkata, \"Kami lalu berkata kepadanya, 'Tanyakan kepada Rasulullah shallallahu 'alaihi wasallam apakah cukup bagi kami sedekah dengan memberi nafkah kepada suami-suami kami dan anak-anak yatim yang kami asuh? ' lalu Bilal pun masuk menemui Rasulullah shallallahu 'alaihi wasallam lalu dia berkata di pintu, \"Ada Zainab!\" Beliau bertanya: \"Zainab yang mana?\" Bilal menjawab, \"Zainab isteri Abdullah dan Zainab wanita Anshar. Keduanya bertanya tentang nafkah yang mereka berikan kepada suami-suami mereka dan anak-anak yatim yang mereka asuh, apakah mencukupi sedekah mereka (sah)?\" Zinab (isteri Abdullah bin Mas'ud) Berkata, \"Lalu Bilal keluar dan kepada kami, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Bagi mereka dua pahala, pahala karib kerabat dan pahala sedekah.\""
            },
            {
                "number": 3892,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا شَرِيكٌ عَنِ الْأَعْمَشِ عَنْ جَامِعِ بْنِ شَدَّادٍ عَنْ كُلْثُومٍ عَنْ زَيْنَبَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَّثَ النِّسَاءَ خِطَطَهُنَّ",
                "id": "Telah menceritakan kepada kami [Aswad bin Amir] berkata, telah menceritakan kepada kami [Syarik] dari [Al A'masy] dari [Jami' bin Syaddad] dari [Kultsum] dari [Zainab] bahwa Nabi shallallahu 'alaihi wasallam mewariskan untuk isteri-isteri beliau berupa tanah-tanah mereka.\""
            },
            {
                "number": 3893,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ حَدَّثَنَا الْأَعْمَشُ عَنْ جَامِعِ بْنِ شَدَّادٍ عَنْ كُلْثُومٍ قَالَتْكَانَتْ زَيْنَبُ تَفْلِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَهُ امْرَأَةُ عُثْمَانَ بْنِ مَظْعُونٍ وَنِسَاءٌ مِنْ الْمُهَاجِرَاتِ يَشْكُونَ مَنَازِلَهُنَّ وَأَنَّهُنَّ يَخْرُجْنَ مِنْهُ وَيُضَيَّقُ عَلَيْهِنَّ فِيهِ فَتَكَلَّمَتْ زَيْنَبُ وَتَرَكَتْ رَأْسَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّكِ لَسْتِ تَكَلَّمِينَ بِعَيْنَيْكِ تَكَلَّمِي وَاعْمَلِي عَمَلَكِ فَأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَئِذٍ أَنْ يُوَرَّثَ مِنْ الْمُهَاجِرِينَ النِّسَاءُ فَمَاتَ عَبْدُ اللَّهِ فَوَرِثَتْهُ امْرَأَتُهُ دَارًا بِالْمَدِينَةِ",
                "id": "Telah menceritakan kepada kami [Affan] telah menceritakan kepada kami [Abdul Wahid bin Ziyad] telah menceritakan kepada kami [Al A'masy] dari [Jami' bin Syaddad] dari [Kultsum] dia berkata, \"Zainab membersihkan kepala Rasulullah shallallahu 'alaihi wasallam sementara di sisinya ada isteri Utsman bin Madz'un dan beberapa wanita muhajirin, mereka mengeluhkan rumah-rumah mereka, mereka keluar darinya karena merasa sempit di dalamnya. Lalu Zainab berhenti sejenak dari membersihkan kepala Rasulullah shallallahu 'alaihi wasallam dan berkata kepada mereka, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya kamu tidak berkata dengan kedua matamu, maka katakan dan amalkanlah.\" Rasulullah shallallahu 'alaihi wasallam memerintahkan pada hari itu agar para wanita mendapatkan warisan dari kaum muhajirin, ketika Abdullah meninggal, maka isterinya mendapatkan warisan rumah di Madinah.\""
            },
            {
                "number": 3894,
                "arab": "حَدَّثَنَا أَبُو عَامِرٍ قَالَ حَدَّثَنَا فُلَيْحٌ عَنْ أَيُّوبَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ صَعْصَعَةَ عَنْ يَعْقُوبَ بْنِ أَبِي يَعْقُوبَ عَنْ أُمِّ الْمُنْذِرِ بِنْتِ قَيْسٍ الْأَنْصَارِيَّةِ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ عَلِيٌّ وَعَلِيٌّ نَاقِهٌ مِنْ مَرَضٍ وَلَنَا دَوَالٍ مُعَلَّقَةٌ فَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ مِنْهَا وَقَامَ عَلِيٌّ يَأْكُلُ مِنْهَا فَطَفِقَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لِعَلِيٍّ مَهْ إِنَّكَ نَاقِهٌ حَتَّى كَفَّ قَالَتْ وَصَنَعْتُ شَعِيرًا وَسِلْقًا فَجِئْتُ بِهِ قَالَ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَلِيٍّ مِنْ هَذَا أَصِبْ فَهُوَ أَنْفَعُ لَكَحَدَّثَنَا يُونُسُ قَالَ حَدَّثَنَا فُلَيْحٌ عَنْ أَيُّوبَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ يَعْقُوبَ بْنِ أَبِي يَعْقُوبَ عَنْ أُمِّ الْمُنْذِرِ الْعَدَوِيَّةِ قَالَتْ دَخَلَ عَلَيَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ عَلِيٌّ وَعَلِيٌّ نَاقِهٌ فَذَكَرَ الْحَدِيثَ إِلَّا أَنَّهُ قَالَ ثُمَّ جَعَلْتُ لَهُمْ سِلْقًا وَشَعِيرًا قَالَ أَبِي وَكَذَلِكَ قَالَ فَزَارَةُ بْنُ عَمْرٍو سِلْقًا",
                "id": "Telah menceritakan kepada kami [Abu Amir] berkata, telah menceritakan kepada kami [Fulaih] dari [Ayyub bin Abdurrahman bin Sha'sha'ah] dari [Ya'qub bin Abu Ya'qub] dari [Ummi Mundzir binti Qais Al Anshariyah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam mendatangiku bersama Ali, sedangkan Ali baru sembuh dari penyakitnya. Ketika itu kami mempunyai tangkai-tangkai kurma yang belum matang yang kami gantungkan, Rasulullah shallallahu 'alaihi wasallam pun berdiri dan memakannya, maka Ali pun ikut berdiri dan memakannya. Nabi shallallahu 'alaihi wasallam kemudian bersabda kepada Ali: \"Hai, kamu baru saja sembuh!, \" sampai dia berhenti memakannya.\" Ummul Mundzir berkata, \"Aku lalu membuat (makanan dari) gandum dan ubi kemudian kubawa kepada beliau.\" Ya'qub berkata, \"Nabi shallallahu 'alaihi wasallam lalu bersabda kepada Ali: \"Makanlah ini, sebab itu lebih bermanfaat bagi kamu.\" Telah menceritakan kepada kami [Yunus] berkata; telah menceritakan kepada kami [Fulaih] dari [Ayyub bin Abdurrahman] dari [Ya'qub bin Abu Ya'qub] dari [Ummu Mundzir Al Adawiyah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam mendatangiku bersama Ali, sedangkan Ali ketika itu baru sembuh dari penyakitnya…. lalu dia menyebutkan hadist, hanya saja ia menyebutkan, \"kemudian aku membuatkan untuk mereka gandum dan ubi.\" Bapakku (Imam Ahmad) Berkata demikian, [Fazarah bin Amru] juga menyebutkan, 'ubi'.\""
            },
            {
                "number": 3895,
                "arab": "حَدَّثَنَا سُرَيْجٌ قَالَ حَدَّثَنَا فُلَيْحٌ عَنْ أَيُّوبَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ صَعْصَعَةَ الْأَنْصَارِيِّ عَنْ يَعْقُوبَ بْنِ أَبِي يَعْقُوبَ عَنْ أُمِّ الْمُنْذِرِ بِنْتِ قَيْسٍ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ عَلِيُّ بْنُ أَبِي طَالِبٍ وَعَلِيٌّ نَاقِهٌ مِنْ مَرَضٍ قَالَتْ وَلَنَا دَوَالٍ مُعَلَّقَةٌ فَقَامَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلِيٌّ يَأْكُلَانِ مِنْهَا فَطَفِقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَهْلًا فَإِنَّكَ نَاقِهٌ حَتَّى كَفَّ عَلِيٌّ قَالَتْ وَقَدْ صَنَعْتُ شَعِيرًا وَسِلْقًا فَلَمَّا جِئْنَا بِهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِعَلِيٍّ مِنْ هَذَا أَصِبْ فَهُوَ أَوْفَقُ لَكَ فَأَكَلَا ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Suraij] berkata, telah menceritakan kepada kami [Fulaih] dari [Ayyub bin Abdurrahman bin Sha'sha'ah Al Anshari] dari [Ya'qub bin Abu Ya'qub] dari [Ummu Mundzir binti Qais] berkata, \"Rasulullah shallallahu 'alaihi wasallam menemuiku bersama Ali bin Abu Thalib yang saat itu bari sembuh dari penyakitnya.\" Ummul Mundzir berkata, \"Ketika itu kami mempunyai tangkai-tangkai kurma yang belum matang dan masih menggantung, kemudian Nabi shallallahu 'alaihi wasallam dan Ali berdiri untuk memakannya, tiba-tiba-tiba Rasulullah shallallahu 'alaihi wasallam besabda: 'Hati-hati, sesungguhnya kamu baru saja sembuh'. Maka Ali pun menahan dirinya.\" Ummul Mundzir melanjutkan, \"Lalu aku membuat (makanan dari) gandum dan ubi, tatkala aku menyuguhkan kepadanya, Rasulullah shallallahu 'alaihi wasallam bersabda kepada Ali: \"Makanlah ini, karena ia lebih bermanfaat (buatmu).\" Kemudian keduanya memakannya."
            },
            {
                "number": 3896,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا يَحْيَى بْنُ سَعِيدٍ أَنَّ عُمَرَ بْنَ كَثِيرِ بْنِ أَفْلَحَ مَوْلَى أَبِي أَيُّوبَ الْأَنْصَارِيِّ أَخْبَرَهُ أَنَّهُ سَمِعَ عُبَيْدَ سَنُوطَا يُحَدِّثُ عَنْ خَوْلَةَ بِنْتِ قَيْسٍ امْرَأَةِ حَمْزَةَ بْنِ عَبْدِ الْمُطَّلِبِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى حَمْزَةَ فَتَذَاكَرَا الدُّنْيَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الدُّنْيَا خَضِرَةٌ حُلْوَةٌ مَنْ أَخَذَهَا بِحَقِّهَا بُورِكَ لَهُ فِيهَا وَرُبَّ مُتَخَوِّضٍ فِي مَالِ اللَّهِ وَمَالِ رَسُولِهِ لَهُ النَّارُ يَوْمَ يَلْقَى اللَّهَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Yahya bin Sa'id] bahwa [Umar bin Katsir bin Aflah] bekas budak Abu Ayyub Al Anshari, mengabarkan kepadanya, bahwa dirinya mendengar [Ubaid bin Sanuth] menceritakan dari [Khaulah binti Qais] isteri Hamzah bin Abdul Muthalib, bahwa Rasulullah shallallahu 'alaihi wasallam bertemu dengan Hamzah, lalu keduanya bercerita mengenai dunia, Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Sesungguhnya dunia itu hijau dan manis, barangsiapa mengambilnya dengan hak maka ia akan diberkahi, dan berapa banyak orang yang mengambil harta Allah dan harta Rasul-Nya tanpa hak, maka baginya neraka pada saat bertemu dengan-Nya kelak.\""
            },
            {
                "number": 3897,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ عُمَرَ بْنِ كَثِيرِ بْنِ أَفْلَحَ عَنْ عُبَيْدِ سَنُوطَا عَنْ خَوْلَةَأَنَّهَا سَمِعَتْ حَمْزَةَ يُذَاكِرُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الدُّنْيَا فَقَالَ إِنَّ الدُّنْيَا حُلْوَةٌ خَضِرَةٌ وَرُبَّ مُتَخَوِّضٍ فِي مَالِ اللَّهِ وَرَسُولِهِ لَهُ النَّارُ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Yahya bin Sa'id] dari [Umar bin Katsir bin Aflah] dari [Ubaid Sanutha] dari [Khaulah] bahwa dirinya mendengar dari Hamzah menyebutkan kepada Nabi shallallahu 'alaihi wasallam tentang dunia, maka beliau bersabda: \"Sesungguhnya dunia itu manis dan hijau, dan berapa banyak orang yang mengambil harta Allah dan harta Rasul-Nya tanpa hak kemudian masuk neraka.\""
            },
            {
                "number": 3898,
                "arab": "حَدَّثَنَا أَبُو قُرَّةَ مُوسَى بْنُ طَارِقٍ الزُّبَيْدِيُّ قَالَ حَدَّثَنَا مُوسَى بْنُ عُرْوَةَ عَنْ أُمِّ خَالِدٍ بِنْتِ خَالِدٍ أَنَّهَاسَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنْ عَذَابِ الْقَبْرِ",
                "id": "Telah menceritakan kepada kami [Abu Qurrah Musa bin Thariq Az Zubaidi] dia berkata, telah menceritakan kepada kami [Musa bin Urwah] dari [Ummi Khalid binti Khalid] bahwa dia mendengar Rasulullah shallallahu 'alaihi wasallam memohon perlindungan dari adzab kubur.\""
            },
            {
                "number": 3899,
                "arab": "حَدَّثَنَا أَبُو النَّضْرِ قَالَ حَدَّثَنَا إِسْحَاقُ بْنُ سَعِيدٍ عَنْ أَبِيهِ عَنْ أُمِّ خَالِدٍ بِنْتِ خَالِدِ بْنِ سَعِيدِ بْنِ الْعَاصِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُتِيَ بِكِسْوَةٍ فِيهَا خَمِيصَةٌ صَغِيرَةٌ فَقَالَ مَنْ تَرَوْنَ أَحَقَّ بِهَذِهِ فَسَكَتَ الْقَوْمُ فَقَالَ ائْتُونِي بِأُمِّ خَالِدٍ فَأُتِيَ بِهَا فَأَلْبَسَهَا إِيَّاهَا ثُمَّ قَالَ لَهَا مَرَّتَيْنِ أَبْلِي وَأَخْلِقِي وَجَعَلَ يَنْظُرُ إِلَى عَلَمٍ فِي الْخَمِيصَةِ أَحْمَرَ أَوْ أَصْفَرَ وَيَقُولُ سَنَاهْ سَنَاهْ يَا أُمَّ خَالِدٍوَسَنَاهْ فِي كَلَامِ الْحَبَشِ الْحَسَنُ",
                "id": "Telah menceritakan kepada kami [Abu An Nadlr] berkata, telah menceritakan kepada kami [Ishaq bin Sa'id] dari [ayahnya] dari [Ummu Khalid binti Khalid bin Sa'id bin Ash], bahwa telah didatangkan kepada Rasulullah shallallahu 'alaihi wasallam sebuah bungkusan yang di dalamnya terdapat kain sutera yang kecil, beliau bersabda: \"Menurut kalian siapa yang berhak menggunakan ini?\" lalu orang-orang terdiam, beliau bersabda lagi: \"Datangkan kepadaku Ummu Khalid, \" lalu didatangkanlah Ummu Khalid kepada beliau, lalu beliau memakaikannya dan bersabda kepadanya dua kali: \"Kamu pantas dan cocok memakainya, \" beliau lalu memerhatikan kain sutera kecil yang berwarna merah atau kuning seraya berkata: \"Sanah, sanah wahai Ummi Khalid.\" Sanah dalam bahasa Habasy berarti bagus.\""
            },
            {
                "number": 3900,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مُوسَى بْنِ عُقْبَةَ سَمِعَ أُمَّ خَالِدٍ بِنْتَ خَالِدٍ قَالَ وَلَمْ أَسْمَعْ أَحَدًا يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرَهَاسَمِعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَوَّذُ مِنْ عَذَابِ الْقَبْرِ",
                "id": "Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Musa bin Uqbah] ia mendengar [Ummu Khalid binti Khalid], Musa berkata, \"Aku belum pernah mendengar seorang pun yang berkata 'aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam' selain dia, bahwa dia mendengar Nabi shallallahu 'alaihi wasallam memohon perlindungan dari adzab kubur.\""
            },
            {
                "number": 3901,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ قَالَ حَدَّثَنَا شَرِيكٌ عَنْ حَبِيبِ بْنِ زَيْدٍ عَنْ مَوْلَاتِهِمْ لَيْلَى عَنْ عَمَّتِهِ أُمِّ عُمَارَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا قَالَ وَثَابَ إِلَيْهَا رِجَالٌ مِنْ قَوْمِهَا قَالَ فَقَدَّمَتْ إِلَيْهِمْ تَمْرًا فَأَكَلُوا فَتَنَحَّى رَجُلٌ مِنْهُمْ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا شَأْنُهُ فَقَالَ إِنِّي صَائِمٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَا إِنَّهُ مَا مِنْ صَائِمٍ يَأْكُلُ عِنْدَهُ فَوَاطِرُ إِلَّا صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ حَتَّى يَقُومُوا",
                "id": "Telah menceritakan kepada kami [Aswad bin Amir] berkata, telah menceritakan kepada kami [Syarik] dari [Habib bin Zaid] dari bekas budak mereka [Laila] dari bibinya [Ummu Umarah] bahwa Rasulullah shallallahu 'alaihi wasallam pernah datang kepadanya, Habib berkata, \"Orang-orang dari kaumnya ikut berkumpul ke rumah Ummu Umarah bersama beliau.\" Habib melanjutkan, \"Kemudian Ummu Umarah menyuguhi mereka dengan kurma dan mereka pun memakannya, namuan ada seorang laki-laki dari mereka menyingkir, maka Nabi shallallahu 'alaihi wasallam pun bersabda: \"Ada apa dengannya?\" Laki-laki itu lalu menjawab, \"Aku sedang berpuasa.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Sungguh, tidaklah seorang yang berpuasa berada di sisi orang-orang yang sedang makan kecuali malaikat akan bershalawat kepadanya hingga mereka berdiri.\""
            },
            {
                "number": 3902,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ شُعْبَةَ قَالَ حَدَّثَنِي حَبِيبٌ الْأَنْصَارِيُّ عَنْ لَيْلَى عَنْ جَدَّتِهِ أُمِّ عُمَارَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا فَقَرَّبَتْ إِلَيْهِ طَعَامًا قَالَ ادْنِي فَكُلِي قَالَتْ إِنِّي صَائِمَةٌ قَالَ الصَّائِمُ إِذَا أُكِلَ عِنْدَهُ صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Syu'bah] berkata, telah menceritakan kepadaku [Habib Al Anshari] dari [Laila] dari neneknya [Ummu Umarah] bahwa Nabi shallallahu 'alaihi wasallam pernah menemuinya, lalu dia mendekatkan makanan untuk beliau, beliau pun bersabda: \"Kemari dan makanlah.\" Ummu Umarah lantas berkata, \"Sesungguhnya aku sedang berpuasa.\" Beliau kemudian bersabda: \"Jika ada seseorang yang makan di sisinya (orang yang puasa), maka Malaikat akan bershalawat kepadanya.\""
            },
            {
                "number": 3903,
                "arab": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ حَبِيبٍ الْأَنْصَارِيِّ قَالَ سَمِعْتُ مَوْلَاةً لَنَا يُقَالُ لَهَا لَيْلَى تُحَدِّثُ عَنْ جَدَّتِهِ أُمِّ عُمَارَةَ بِنْتِ كَعْبٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا فَدَعَتْ لَهُ بِطَعَامٍ فَقَالَ لَهَا كُلِي فَقَالَتْ إِنِّي صَائِمَةٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الصَّائِمَ إِذَا أُكِلَ عِنْدَهُ صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ حَتَّى يَفْرَغُوا وَرُبَّمَا قَالَ حَتَّى يَقْضُوا أَكْلَهُمْ",
                "id": "Telah menceritakan kepada kami [Hasyn bin Al Qasim] berkata, telah menceritakan kepada kami [Syu'bah] dari [Habib Al Anshari] berkata; Aku mendengar budak kami yang bernama [Laila] menceritakan dari neneknya [Ummu Umarah binti Ka'b] bahwa Rasulullah shallallahu 'alaihi wasallam menemuinya, kemudian dia menyuguhkan makanan kepada beliau, lalu beliau bersabda kepadanya: \"Makanlah.\" Ummu Umarah lalu menjawab, \"Sesungguhnya aku sedang berpuasa.\" Nabi shallallahu 'alaihi wasallam pun bersabda: \"Sesungguhnya orang yang sedang berpuasa, jika ada orang lain makan di sisinya, maka Malaikat akan bershalawat kepadanya sampai mereka selesai (makan).\" Dan mungkin beliau bersabda: \"Sampai mereka menghabiskan makanannya.\""
            },
            {
                "number": 3904,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْعَبَّاسِ وَيُونُسُ الْمَعْنَى قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ يَعْنِي ابْنَ عُثْمَانَ بْنِ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْحَاطِبِ قَالَ حَدَّثَنِي أَبِي عَنْ أُمِّهِ عَائِشَةَ بِنْتِ قُدَامَةَ قَالَتْكُنْتُ أَنَا مَعَ أُمِّي رَائِطَةَ بِنْتِ سُفْيَانَ الْخُزَاعِيَّةِ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُبَايِعُ النِّسْوَةَ وَيَقُولُ أُبَايِعُكُنَّ عَلَى أَنْ لَا تُشْرِكْنَ بِاللَّهِ شَيْئًا وَلَا تَسْرِقْنَ وَلَا تَزْنِينَ وَلَا تَقْتُلْنَ أَوْلَادَكُنَّ وَلَا تَأْتِينَ بِبُهْتَانٍ تَفْتَرِينَهُ بَيْنَ أَيْدِيكُنَّ وَأَرْجُلِكُنَّ وَلَا تَعْصِينَ فِي مَعْرُوفٍ قَالَتْ فَأَطْرَقْنَ فَقَالَ لَهُنَّ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْنَ نَعَمْ فِيمَا اسْتَطَعْتُنَّ فَكُنَّ يَقُلْنَ وَأَقُولُ مَعَهُنَّ وَأُمِّي تُلَقِّنُنِي قُولِي أَيْ بُنَيَّةُ نَعَمْ فِيمَا اسْتَطَعْتُ فَكُنْتُ أَقُولُ كَمَا يَقُلْنَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Abu Abbas] dan [Yunus Al Makna] keduanya berkata, telah menceritakan kepada kami [Abdurrahman] -yakni Ibnu Utsman bin Ibrahim bin Muhammad bin Hathib- dia berkata, telah menceritakan kepadaku [ayahku] dari ibunya ['Aisyah binti Qudamah] dia berkata, \"Saat aku bersama ibuku, Raithah binti Sufyan Al Khuza'iyah, Nabi shallallahu 'alaihi wasallam sedang membaiat para wanita, beliau bersabda: \"Aku membaiat kalian agar kalian tidak menyekutukan Allah dengan sesuatupun, tidak mencuri dan tidak berzina, tidak membunuh anak-anak kalian, tidak mengada-ngada dengan kedustaan yang diperbuat oleh tangan-tangan dan kaki-kaki kalian serta tidak durhaka di dalam hal yang ma'ruf.\" Aisyah berkata, \"Mereka lalu mengangguk, kemudian Nabi shallallahu 'alaihi wasallam bersabda kepada mereka: \"Katakanlah 'Ya', sebatas apa yang kalian mampui, \" lalu mereka mengatakannya dan aku mengatakan bersama mereka, sementara ibuku mendiktekan untukku, 'Katakanlah hai anakku, 'Ya semampuku', maka aku mengatakan sebagaimana mereka katakan.\""
            },
            {
                "number": 3905,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ وَيُونُسُ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ قَالَ وَحَدَّثَنِي أَبِي عَنْ أُمِّهِ عَائِشَةَ بِنْتِ قُدَامَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَزِيزٌ عَلَى اللَّهِ عَزَّ وَجَلَّ أَنْ يَأْخُذَ كَرِيمَتَيْ مُسْلِمٍ ثُمَّ يُدْخِلَهُ النَّارَقَالَ يُونُسُ يَعْنِي عَيْنَيْهِ",
                "id": "Telah menceritakan kepada kami [Ibrahim] dan [Yunus] keduanya berkata, telah menceritakan kepada kami [Abdurrahman] dia berkata, dan telah menceritakan kepadaku [ayahku] dari ibunya ['Aisyah binti Qudamah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah merasa keberatan jika mengambil dua mata seorang muslim lantas memasukkan orang itu ke neraka, \" Yunus berkata, \"Yakni kedua matanya.\""
            },
            {
                "number": 3906,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ بْنِ مِقْسَمٍ قَالَ حَدَّثَتْنِي عَمَّتِي سَارَةُ بِنْتُ مِقْسَمٍ عَنْ مَيْمُونَةَ بِنْتِ كَرْدَمٍ قَالَتْرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ وَهُوَ عَلَى نَاقَتِهِ وَأَنَا مَعَ أَبِي وَبِيَدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دِرَّةٌ كَدِرَّةِ الْكُتَّابِ فَسَمِعْتُ الْأَعْرَابَ وَالنَّاسَ يَقُولُونَ الطَّبْطَبِيَّةَ فَدَنَا مِنْهُ أَبِي فَأَخَذَ بِقَدَمِهِ فَأَقَرَّ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ فَمَا نَسِيتُ فِيمَا نَسِيتُ طُولَ أُصْبُعِ قَدَمِهِ السَّبَّابَةِ عَلَى سَائِرِ أَصَابِعِهِ قَالَتْ فَقَالَ لَهُ أَبِي إِنِّي شَهِدْتُ جَيْشَ عِثْرَانَ قَالَتْ فَعَرَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَلِكَ الْجَيْشَ فَقَالَ طَارِقُ بْنُ الْمُرَقَّعِ مَنْ يُعْطِينِي رُمْحًا بِثَوَابِهِ قَالَ فَقُلْتُ وَمَا ثَوَابُهُ قَالَ أُزَوِّجُهُ أَوَّلَ بِنْتٍ تَكُونُ لِي قَالَ فَأَعْطَيْتُهُ رُمْحِي ثُمَّ تَرَكْتُهُ حَتَّى وُلِدَتْ لَهُ ابْنَةٌ وَبَلَغَتْ فَأَتَيْتُهُ فَقُلْتُ لَهُ جَهِّزْ لِي أَهْلِي فَقَالَ لَا وَاللَّهِ لَا أُجَهِّزُهَا حَتَّى تُحْدِثَ صَدَاقًا غَيْرَ ذَلِكَ فَحَلَفْتُ أَنْ لَا أَفْعَلَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَبِقَدْرِ أَيِّ النِّسَاءِ هِيَ قَالَ قَدْ رَأَتْ الْقَتِيرَ قَالَ فَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعْهَا عَنْكَ لَا خَيْرَ لَكَ فِيهَا قَالَ فَرَاعَنِي ذَلِكَ وَنَظَرْتُ لَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَأْثَمُ وَلَا يَأْثَمُ صَاحِبُكَ قَالَتْ فَقَالَ لَهُ أَبِي فِي ذَلِكَ الْمَقَامِ إِنِّي نَذَرْتُ أَنْ أَذْبَحَ عَدَدًا مِنْ الْغَنَمِ قَالَ لَا أَعْلَمُهُ إِلَّا قَالَ خَمْسِينَ شَاةً عَلَى رَأْسِ بُوَانَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَلْ عَلَيْهَا مِنْ هَذِهِ الْأَوْثَانِ شَيْءٌ قَالَ لَا قَالَ فَأَوْفِ لِلَّهِ بِمَا نَذَرْتَ لَهُ قَالَتْ فَجَمَعَهَا أَبِي فَجَعَلَ يَذْبَحُهَا وَانْفَلَتَتْ مِنْهُ شَاةٌ فَطَلَبَهَا وَهُوَ يَقُولُ اللَّهُمَّ أَوْفِ عَنِّي بِنَذْرِي حَتَّى أَخَذَهَا فَذَبَحَهَاحَدَّثَنَا عَبْدُ الصَّمَدِ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ بْنِ ضَبَّةَ الطَّائِفِيُّ قَالَ حَدَّثَتْنِي عَمَّةٌ لِي يُقَالُ لَهَا سَارَةُ بِنْتُ مِقْسَمٍ عَنْ مَوْلَاتِهَا مَيْمُونَةَ بِنْتِ كَرْدَمٍ أَنَّهَا كَانَتْ مَعَ أَبِيهَا فَذَكَرَتْ أَنَّهَا رَأَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى نَاقَةٍ وَبِيَدِهِ دِرَّةٌ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Abdullah bin Yazid bin Miqsam] berkata, telah menceritakan kepadaku bibiku [Sarah binti Miqsam] dari [Maimunah binti Kardam] dia berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam di Makkah dan beliau berada di atas untanya, sedangkan aku bersama ayahku. Pada tangan Rasulullah shallallahu 'alaihi wasallam terdapat tongkat seperti tongkat seorang penulis. Aku lalu mendengar orang-orang mengatakan At thabtiyah (tongkat), lalu ayahku mendekati tongkat tersebut dan mengambilnya dengan kakinya, dan Rasulullah shallallahu 'alaihi wasallam melihatnya (seakan setuju).\" Maimunah berkata, \"Maka aku tidak akan lupa apa yang aku lihat bahwa panjang jari telunjuk kakinya melebihi yang lain. Lalu ayahku berkata kepada beliau, \"Sesungguhnya aku pernah bergabung dengan pasukan 'Itsron!\" Dan Rasulullah shallallahu 'alaihi wasallam mengetahui akan pasukan itu.\" Thariq bin Muraqqa' berkata, \"Siapakah yang mampu memberiku tombak maka ia akan memperoleh imbalan?\" Ayah Maimunah berkata, 'Aku bertanya, 'Apa balasannya? ' Thariq menjawab, 'Aku akan menikahkannya dengan putri pertama yang aku miliki, \" Ayahku berkata, 'Lalu aku memberikan tombakku, kemudian aku tinggalkan hingga isterinya melahirkan anak perempuan. Ketika anaknya sampai umur baligh aku mendatanginya dan berkata, 'Siapkan calom isteriku, ' namun Thariq berkata, 'Tidak, aku tidak akan menyiapkannya untukmu hingga kamu memberikan mahar kepadanya, ' maka aku bersumpah tidak akan melakukannya, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wanita seperti apa dia?\" dia (ayah Maimunah) menjawab, \"Ia terlihat beruban.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Tinggalkan ia, karena ia tidak ada kebaikannya bagimu.\" Dia (ayah Maimunah) Berkata, \"Hal itu membuatku lega, dan aku menunggunya, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kamu berbuat dosa, dan temanmu itu tidak berdosa.\" Maimunah berkata, \"Lalu ayahku berkata di tempat itu, \"Aku bernadzar (janji) akan menyembelih beberapa kambing -perawi berkata; aku tidak mengetahui kecuali dia mengatakan; lima puluh ekor kambing- di atas Buwanah (tempat orang musyrik menyembelih). Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah ia bermaksud menyembelih sesuatu pada berhala ini?\" dia (ayah Maimunah) menjawab, \"Tidak.\" Beliau lalu bersabda: \"Laksanakanlah nadzar yang kau niatkan untuk Allah tersebut.\" Maimunah berkata, \"Lalu ayahku mengumpulkan kambing-kambingnya dan mulai menyembelihnya, lalu seekor kambing terlepas darinya hingga ia pun mencarinya, kemudian dia berdo'a, \"Allahumma aufi 'anny binadzri (Ya Allah penuhilah dariku nadzarku) ', hingga menemukannya dan menyembelihnya.\" Telah menceritakan kepada kami [Abdus Shamad] berkata; telah menceritakan kepada kami [Abdullah bin Yazid bin Dlabbah Atthaifi] berkata, \"Bibiku yang bernama [Sarah binti Miqsam] menceritakan kepadaku dari bekas budaknya [Maimunah binti Kardam], bahwa saat bersama ayahnya ia meyebutkan bahwa ia melihat Rasulullah shallallahu 'alaihi wasallam berada di atas untanya dan di tangannya ada tongkat…lalu dia menyebutkan hadistnya.\""
            },
            {
                "number": 3907,
                "arab": "حَدَّثَنَا أَبُو أَحْمَدَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ بْنِ يَعْلَى الطَّائِفِيَّ عَنْ يَزِيدَ بْنِ مِقْسَمٍ عَنْ مَوْلَاتِهِ مَيْمُونَةَ بِنْتِ كَرْدَمٍ قَالَتْكُنْتُ رِدْفَ أَبِي فَسَمِعْتُهُ يَسْأَلُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي نَذَرْتُ أَنْ أَنْحَرَ بِبُوَانَةَ فَقَالَ أَبِهَا وَثَنٌ أَمْ طَاغِيَةٌ فَقَالَ لَا قَالَ أَوْفِ بِنَذْرِكَ",
                "id": "Telah menceritakan kepada kami [Abu Ahmad] berkata, telah menceritakan kepada kami [Abdullah] -yakni Ibnu Abdurrahman bin Ya'la At Taha'ifi- dari [Yazid bin Miqsam] dari bekas budaknya [Maimunah binti Kirdam] dia berkata, \"Aku memboceng ayahku, maka aku mendengar dia bertanya kepada Nabi shallallahu 'alaihi wasallam, \"Wahai Rasulullah, sesungguhnya aku bernadzar untuk menyembelih di Buwanah (tempat penyembelihan orang-orang musyrik).\" Maka beliau bersabda: \"Apakah si sana ada patung atau sesembahan?\" dia (ayah Maimunah) menjawab, \"Tidak.\" Beliau lalu bersabda: \"Tepatilah nadzarmu.\""
            },
            {
                "number": 3908,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنِي خَارِجَةُ بْنُ الْحَارِثِ الْمُزَنِيُّ قَالَ حَدَّثَنِي سَالِمُ بْنُ سَرْجٍ قَالَ سَمِعْتُ أُمَّ صُبَيَّةَ الْجُهَنِيَّةِ تَقُولُاخْتَلَفَتْ يَدِي وَيَدُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْوُضُوءِ مِنْ إِنَاءٍ وَاحِدٍ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] berkata, telah menceritakan kepadaku [Kharijah bin Harits Al Muzanni] berkata, telah menceritakan kepadaku [Salim bin Sarj] ia berkata, \"Aku mendengar [Ummu Subayyah Al Juhaniyah] berkata, \"Tanganku dan tangan Rasulullah shallallahu 'alaihi wasallam masuk dalam satu bejana ketika wudlu.\""
            },
            {
                "number": 3909,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ أُسَامَةَ بْنِ يَزِيدَ قَالَ حَدَّثَنِي سَالِمٌ أَبُو النُّعْمَانِ عَنْ أُمِّ صُبَيَّةَ قَالَتْاخْتَلَفَتْ يَدِي وَيَدُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي إِنَاءٍ وَاحِدٍ فِي الْوُضُوءِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Usamah bin yazid] berkata, telah menceritakan kepadaku [Salim Abu An Nu'man] dari [Ummu Subayyah] dia berkata, \"Tanganku dan tangan Rasulullah shallallahu 'alaihi wasallam masuk dalam satu bejana ketika wudlu.\""
            },
            {
                "number": 3910,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ قَالَ حَدَّثَنَا بَشَّارُ بْنُ عَبْدِ الْمَلِكِ وَقَالَ حَدَّثَتْنِي أُمُّ حَكِيمٍ بِنْتُ دِينَارٍ عَنْ مَوْلَاتِهَا أُمِّ إِسْحَاقَأَنَّهَا كَانَتْ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأُتِيَ بِقَصْعَةٍ مِنْ ثَرِيدٍ فَأَكَلَتْ مَعَهُ وَمَعَهُ ذُو الْيَدَيْنِ فَنَاوَلَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَرْقًا فَقَالَ يَا أُمَّ إِسْحَاقَ أَصِيبِي مِنْ هَذَا فَذَكَرْتُ أَنِّي كُنْتُ صَائِمَةً فَرَدَدْتُ يَدِي لَا أُقَدِّمُهَا وَلَا أُؤَخِّرُهَا فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لَكِ قَالَتْ كُنْتُ صَائِمَةً فَنَسِيتُ فَقَالَ ذُو الْيَدَيْنِ الْآنَ بَعْدَمَا شَبِعْتِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتِمِّي صَوْمَكِ فَإِنَّمَا هُوَ رِزْقٌ سَاقَهُ اللَّهُ إِلَيْكِ",
                "id": "Telah menceritakan kepada kami [Abdus Shamad] berkata, telah menceritakan kepada kami [Basyar bin Abdul Malik], dan berkata telah menceritakan kepadaku [Ummu Hakim binti Dinar] dari bekas budaknya [Ummi Ishaq], bahwa dia berada di samping Rasulullah shallallahu 'alaihi wasallam lalu dihidangkan satu nampan roti, dan ia pun makan bersama beliau yang saat itu bersama Dzul Yadain. Rasulullah shallallahu 'alaihi wasallam kemudian memberinya air susu seraya bersabda: \"Wahai Ummu Ishaq, minumlah air ini.\" Lalu aku teringat bahwa aku sedang berpuasa, maka tanganku aku tahan, tidak maju dan tidak mundur. Rasulullah shallallahu 'alaihi wasallam pun bertanya: \"Ada apa denganmu?\" Ummu Ishaq menjawab, \"Aku sedang berpuasa, dan lalu aku lupa.\" Lalu Dzul Yadain berkata, \"Sekarang baru kamu ingat setelah kenyang!\" Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Sempurnakanlah puasamu, sesungguhnya ia adalah rizki dari Allah yang diberikan kepadamu.\""
            },
            {
                "number": 3911,
                "arab": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ قَالَ حَدَّثَنَا أَبُو جَعْفَرٍ يَعْنِي الرَّازِيَّ عَنْ حُصَيْنٍ عَنْ شَقِيقِ بْنِ سَلَمَةَ عَنْ مَسْرُوقٍ عَنْ أُمِّ رُومَانَ وَهِيَ أُمُّ عَائِشَةَ قَالَتْكُنْتُ أَنَا وَعَائِشَةُ قَاعِدَةٌ فَدَخَلَتْ امْرَأَةٌ مِنْ الْأَنْصَارِ فَقَالَتْ فَعَلَ اللَّهُ بِفُلَانٍ وَفَعَلَ تَعْنِي ابْنَهَا قَالَتْ فَقُلْتُ لَهَا وَمَا ذَلِكَ قَالَتْ ابْنِي كَانَ فِيمَنْ حَدَّثَ الْحَدِيثَ قَالَتْ فَقُلْتُ لَهَا وَمَا الْحَدِيثُ قَالَتْ كَذَا وَكَذَا فَقَالَتْ عَائِشَةُ أَسَمِعَ بِذَلِكَ أَبُو بَكْرٍ قَالَتْ نَعَمْ قَالَتْ أَسَمِعَ بِذَلِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ نَعَمْ فَوَقَعَتْ أَوْ سَقَطَتْ مَغْشِيًّا عَلَيْهَا فَأَفَاقَتْ حُمَّى بِنَافِضٍ فَأَلْقَيْتُ عَلَيْهَا الثِّيَابَ فَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا لِهَذِهِ قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ أَخَذَتْهَا حُمَّى بِنَافِضٍ قَالَ لَعَلَّهُ مِنْ الْحَدِيثِ الَّذِي تُحُدِّثَ بِهِ قَالَتْ قُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ فَرَفَعَتْ عَائِشَةُ رَأْسَهَا وَقَالَتْ إِنْ قُلْتُ لَمْ تَعْذِرُونِي وَإِنْ حَلَفْتُ لَمْ تُصَدِّقُونِي وَمَثَلِي وَمَثَلُكُمْ كَمَثَلِ يَعْقُوبَ وَبَنِيهِ حِينَ قَالَ{ فَصَبْرٌ جَمِيلٌ وَاللَّهُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ }فَلَمَّا نَزَلَ عُذْرُهَا أَتَاهَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهَا بِذَلِكَ فَقَالَتْ بِحَمْدِ اللَّهِ لَا بِحَمْدِكَ أَوْ قَالَتْ وَلَا بِحَمْدِ أَحَدٍ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Al Qasim] berkata, telah menceritakan kepada kami [Abu Ja'far] -yakni Ar Razi- dari [Hushain] dari [Syaqiq bin Salamah] dari [Masruq] dari [Ummu Rumman] dia adalah ibu 'Aisyah, dia berkata, \"Aku duduk bersama 'Aisyah, tiba-tiba masuklah seorang wanita Anshar dan berkata, \"Allah telah melakukan sesuatu terhadap fulan -yang dia maksud fulan ialah anaknya-. Ummu Rumman berkata, \"Aku lalu bertanya kepadanya, \"Apa itu?\" Dia menjawab, \"Anakku termasuk orang yang mengucapkan perkataan itu.\" Ummu Rumman berkata, \"Aku lalu bertanya, \"Perkataan apa itu?\" ia menjawab, \"Seperti ini dan seperti ini.\" 'Aisyah lalu berkata, \"Apakah Abu Bakar telah mendengar hal itu?\" Dia menjawab, \"Ya.\" Aisyah bertanya lagi, \"Apakah Rasulullah shallallahu 'alaihi wasallam telah mendengar hal itu?\" dia menjawab, \"Ya.\" Maka 'Aisyah pun tersungkur, atau jatuh pingsan. Kemudian dia siuman dengan demam dan gemetar, lalu aku menyelimutinya dengan kain, setelah itu masuklah Rasulullah shallallahu 'alaihi wasallam seraya bersabda: \"Kenapa dia?\" Ummu Rumman berkata, \"Aku lalu menjawab, \"Wahai Rasulullah, dia terkena demam dan badannya gemetaran.\" Beliau bersabda: \"Barangkali dari kejadian yang dia dengar.\" Ummu Rumman berkata, \"Aku lalu menjawab, \"Benar wahai Rasulullah.\" 'Aisyah lantas mengangkat kepalanya dan berkata, \"Jika aku berkata maka tuan tidak akan memberiku udzur, jika aku bersumpah tuan tidak akan mempercayaiku. Permisalanku dengan kalian adalah seperti kisah Ya'qub dengan anak-anaknya ketika dia mengatakan: '(Maka kesabaran yang baik Itulah (kesabaranku), dan Allah sajalah yang dimohon pertolongan-Nya terhadap apa yang kamu ceritakan) '. (Qs. Yusuf: 18). Ketika (ayat) yang memaafkannya turun, Rasulullah shallallahu 'alaihi wasallam mendatangi Aisyah dan mengabarkan kepadanya, kemudian Aisyah berkata, \"Segala puji milik Allah tidak dengan memujimu, \" atau dia mengatakan, \"Tidak dengan memuji seorangpun.\""
            },
            {
                "number": 3912,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ قَالَ حَدَّثَنَا حُصَيْنٌ عَنْ أَبِي وَائِلٍ عَنْ مَسْرُوقٍ عَنْ أُمِّ رُومَانَ قَالَتْبَيْنَا أَنَا عِنْدَ عَائِشَةَ إِذْ دَخَلَتْ عَلَيْنَا امْرَأَةٌ مِنْ الْأَنْصَارِ فَقَالَتْ فَعَلَ اللَّهُ بِابْنِهَا وَفَعَلَ قَالَتْ عَائِشَةُ وَلِمَ قَالَتْ إِنَّهُ كَانَ فِيمَنْ حَدَّثَ الْحَدِيثَ قَالَتْ عَائِشَةُ وَأَيُّ حَدِيثٍ قَالَتْ كَذَا وَكَذَا قَالَتْ وَقَدْ بَلَغَ ذَاكَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ نَعَمْ وَبَلَغَ أَبَا بَكْرٍ قَالَتْ نَعَمْ قَالَتْ فَخَرَّتْ عَائِشَةُ مَغْشِيًّا عَلَيْهَا فَمَا أَفَاقَتْ إِلَّا وَعَلَيْهَا حُمَّى بِنَافِضٍ قَالَتْ فَقُمْتُ فَدَثَّرْتُهَا قَالَتْ وَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ مَا شَأْنُ هَذِهِ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ أَخَذَتْهَا حُمَّى بِنَافِضٍ قَالَ لَعَلَّهُ فِي حَدِيثٍ تُحُدِّثَ بِهِ قَالَتْ فَاسْتَوَتْ لَهُ عَائِشَةُ قَاعِدَةً فَقَالَتْ وَاللَّهِ لَئِنْ حَلَفْتُ لَكُمْ لَا تُصَدِّقُونِي وَلَئِنْ اعْتَذَرْتُ إِلَيْكُمْ لَا تَعْذِرُونِي فَمَثَلِي وَمَثَلُكُمْ كَمَثَلِ يَعْقُوبَ وَبَنِيهِ{ وَاللَّهُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ }قَالَتْ وَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ وَأَنْزَلَ اللَّهُ عُذْرَهَا فَرَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعَهُ أَبُو بَكْرٍ فَدَخَلَ فَقَالَ يَا عَائِشَةُ إِنَّ اللَّهَ عَزَّ وَجَلَّ قَدْ أَنْزَلَ عُذْرَكِ قَالَتْ بِحَمْدِ اللَّهِ لَا بِحَمْدِكَ قَالَتْ قَالَ لَهَا أَبُو بَكْرٍ تَقُولِينَ هَذَا لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ نَعَمْ قَالَتْ فَكَانَ فِيمَنْ حَدَّثَ الْحَدِيثَ رَجُلٌ كَانَ يَعُولُهُ أَبُو بَكْرٍ فَحَلَفَ أَبُو بَكْرٍ أَنْ لَا يَصِلَهُ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ{ وَلَا يَأْتَلِ أُولُوا الْفَضْلِ مِنْكُمْ وَالسَّعَةِ }إِلَى آخِرِ الْآيَةِ قَالَ أَبُو بَكْرٍ بَلَى فَوَصَلَهُ",
                "id": "Telah menceritakan kepada kami [Ali bin Ashim] berkata, telah menceritakan kepada kami [Hushain] dari [Abu Wail] dari [Masruq] dari [Ummu Rumman] dia berkata, \"Ketika aku berada di sisi 'Aisyah tiba-tiba masuklah seorang wanita Anshar kepada kami, dia mengatakan bahwa Allah telah melakukan sesuatu kepada anaknya. 'Aisyah pun bertanya, \"Ada apa?\" Wanita itu menjawab, \"Sesungguhnya dia termasuk dari orang yang mengatakan kejadian itu (berita bohong).\" 'Aisyah bertanya lagi, \"Kejadian apa?\" Wanita itu menjawab, \"Seperti ini dan seperti ini.\" Aisyah terus bertanya, \"Apakah hal itu telah sampai pada Rasulullah shallallahu 'alaihi wasallam?\" Wanita itu menjawab, \"Ya.\" Aisyah bertanya lagi, \"Apakah telah sampai kepada Abu Bakar?\" Wanita itu menjawab, \"Ya.\" Ummu Rumman berkata, \"Aisyah lalu jatuh pingsan karena berita tersebut, dan dia tidak siuman kecuali dengan demam dan badan gemetar.\" Ummu Rumman melanjutkan, \"Lalu aku bangun dan menyelimutinya. Kemudian Rasulullah shallallahu 'alaihi wasallam pun masuk seraya bersabda: \"Ada apa dengan orang ini?\" Ummu Rumman menjawab, \"Wahai Rasulullah, dia terserang demam dan badannya gemetar.\" Beliau lalu bersabda: \"Barangkali dari kabar yang ia ceritakan.\" Ummu Rumman lalu mendudukkan 'Aisyah hingga 'Aisyah pun berkata, \"Demi Allah, jika aku bersumpah kepada kalian, kalian tidak akan mempercayaiku, dan jika aku meminta udzur kepada kalian, maka kalian tidak akan memberiku udzur. Permisalanku dengan kalian adalah seperti kisah Ya'qub dengan anak-anaknya ketika dia mengatakan: '(Dan Allah sajalah yang dimohon pertolongan-Nya terhadap apa yang kamu ceritakan) ' (Qs. Yusuf: 18). Ummu Rumman berkata, \"Lalu Rasulullah shallallahu 'alaihi wasallam keluar. Setelah itu Allah menurunkan pembersihan (pembelaan) atas diri Aisyah, lalu Rasulullah shallallahu 'alaihi wasallam kembali bersama Abu Bakar dan masuk seraya bersabda: \"Wahai 'Aisyah, sesungguhnya Allah Azza wa Jalla telah menurunkan udzurmu.\" Aisyah menjawab, \"Dengan memuji Allah tidak dengan memujimu.\" Ummu Rumman berkata, \"Abu Bakar lantas berkata kepada Aisyah, \"Akankah kamu mengatakan seperti ini kepada Rasulullah shallallahu 'alaihi wasallam?\" Aisyah menjawab, \"Ya.\" Dan di antara yang menyebarkan kejadian itu adalah seseorang yang sering dibantu oleh Abu Bakar, maka Abu Bakar bersumpah untuk tidak mambantunya lagi. Maka Allah Azza Wa Jalla menurunkan ayat: '(Dan janganlah orang-orang yang mempunyai kelebihan dan kelapangan di antara kamu bersumpah bahwa mereka (tidak) akan memberi (bantuan) kepada kaum kerabatnya...) ' (Qs. An Nuur: 22) sampai akhir ayat. Maka Abu Bakar pun berkata, \"Tentu.\" Lalu diapun membantunya lagi.\""
            },
            {
                "number": 3913,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ أَبِي يَحْيَى قَالَ حَدَّثَتْنِي أُمِّي عَنْ أُمِّ بِلَالٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ضَحُّوا بِالْجَذَعِ مِنْ الضَّأْنِ فَإِنَّهُ جَائِزٌ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Muhammad bin Abu Yahya] berkata, telah menceritakan kepadaku [Ibuku] dari [Ummu Bilal] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sembelihlah jadza' (unta atau sapi yang masuk tahun kedua) dari hewan ternak dan hal itu boleh.\""
            },
            {
                "number": 3914,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ حَدَّثَنَا أَبُو ضَمْرَةَ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي يَحْيَى مَوْلَى الْأَسْلَمِيِّينَ عَنْ أُمِّهِ قَالَ أَخْبَرَتْنِي أُمُّ بِلَالٍ ابْنَةُ هِلَالٍ عَنْ أَبِيهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَجُوزُ الْجَذَعُ مِنْ الضَّأْنِ أُضْحِيَّةً",
                "id": "Telah menceritakan kepada kami [Ali bin Bahr] telah menceritakan kepada kami [Abu Dlamrah] berkata, telah menceritakan kepada kami [Muhammad bin Abu Yahya] bekas budak Al Aslamiyyin, dari [Ibunya] dia berkata, telah menceritakan kepadaku [Ummu Bilal] dari [putrinya Hilal] dari ayahnya bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Diperbolehkan berkurban dengan menyembelih jadza' (unta atau sapi yang masuk tahun kedua) dari hewan ternak.\""
            },
            {
                "number": 3915,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى قَالَ حَدَّثَنَا ابْنُ لَهِيعَةَ قَالَ حَدَّثَنَا مُوسَى بْنُ وَرْدَانَ قَالَ أَخْبَرَنِي عُبَيْدُ بْنُ حُنَيْنٍ مَوْلَى خَارِجَةَأَنَّ الْمَرْأَةَ الَّتِي سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صِيَامِ يَوْمِ السَّبْتِ حَدَّثَتْهُ أَنَّهَا سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ ذَلِكَ فَقَالَ لَا لَكِ وَلَا عَلَيْكِ",
                "id": "Telah menceritakan kepada kami [Hasan bin Musa] berkata, telah menceritakan kepada kami [Ibnu Lahi'ah] berkata, telah menceritakan kepada kami [Musa bin Wardan] berkata, telah mengabarkan kepadaku ['Ubaid bin Hunain] bekas budak Kharijah, bahwa [wanita yang bertanya kepada Rasulullah shallallahu 'alaihi wasallam] tentang puasa pada hari sabtu, menceritakan kepadanya bahwa dia pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang hal itu. Beliau lalu menjawab: \"Tidak terhadapmu dan tidak pula atasmu.\""
            },
            {
                "number": 3916,
                "arab": "حَدَّثَنَا أَبُو عَاصِمٍ قَالَ حَدَّثَنَا ثَوْرٌ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ عَنْ أُخْتِهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَصُومُوا يَوْمَ السَّبْتِ إِلَّا مَا افْتُرِضَ عَلَيْكُمْ فَإِنْ لَمْ يَجِدْ أَحَدُكُمْ إِلَّا عُودَ عِنَبٍ أَوْ لِحَى شَجَرَةٍ فَلْيَمْضُغْهَا",
                "id": "Telah menceritakan kepada kami [Abu Ashim] berkata, telah menceritakan kepada kami [Tsaur] dari [Khalid bin Ma'dan] dari [Abdullah bin Busr] dari [Saudarinya] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian berpuasa pada hari sabtu kecuali kalau hal itu diwajibkan atas kalian, jika di antara kalian tidak mendapatkan kecuali setangkai anggur atau kulit tanaman maka hendaknya ia menelannya.\""
            },
            {
                "number": 3917,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ قَالَ أَخْبَرَنَا ابْنُ لَهِيعَةَ قَالَ أَخْبَرَنَا مُوسَى بْنُ وَرْدَانَ عَنْ عُبَيْدٍ الْأَعْرَجِ قَالَ حَدَّثَتْنِي جَدَّتِيأَنَّهَا دَخَلَتْ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَتَغَدَّى وَذَلِكَ يَوْمَ السَّبْتِ فَقَالَ تَعَالَيْ فَكُلِي فَقَالَتْ إِنِّي صَائِمَةٌ فَقَالَ لَهَا صُمْتِ أَمْسِ فَقَالَتْ لَا قَالَ فَكُلِي فَإِنَّ صِيَامَ يَوْمِ السَّبْتِ لَا لَكِ وَلَا عَلَيْكِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ishaq] berkata, telah mengabarkan kepada kami [Ibnu Lahi'ah] berkata, telah mengabarkan kepada kami [Musa bin Wardan] dari [Ubaid Al A'raj] berkata, telah menceritakan kepadaku [nenekku] bahwa dia menemui Rasulullah shallallahu 'alaihi wasallam saat beliau sedang makan siang, dan saat itu adalah hari sabtu. Beliau lalu bersabda: \"Kemari dan ikutlah makan.\" Maka aku menjawab, \"Sesungguhnya aku sedang berpuasa.\" Lantas beliau bersabda kepadanya: \"Apakah kemarin kamu berpuasa?\" dia menjawab, \"Tidak.\" Beliau bersabda: \"Makanlah, sesungguhnya puasa hari sabtu bukanlah untukmu dan tidak pula (menjadi kewajiban) atasmu.\""
            },
            {
                "number": 3918,
                "arab": "حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ الزُّبَيْدِيِّ عَنْ لُقْمَانَ بْنِ عَامِرٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ عَنْ أُخْتِهِ الصَّمَّاءِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَصُومَنَّ أَحَدُكُمْ يَوْمَ السَّبْتِ إِلَّا فِي فَرِيضَةٍ وَإِنْ لَمْ يَجِدْ إِلَّا لِحَى شَجَرَةٍ فَلْيُفْطِرْ عَلَيْهَا",
                "id": "Telah menceritakan kepada kami [Al Hakam bin Nafi'] berkata, telah menceritakan kepada kami [Isma'il bin 'Ayyasy] dari [Muhammad bin Walid Az Zubaidi] dari [Luqman bin Amir] dari [Khalid bin Ma'dan] dari [Abdullah bin Busr] dari saudarinya [Ash Shamma'] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Janganlah kalian berpuasa pada hari sabtu kecuali kalau hal itu diwajibkan atas kalian, jika di antara kalian tidak mendapatkan kecuali kulit tanaman maka hendaknya ia menelannya.\""
            },
            {
                "number": 3919,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ عَنْ رِبْعِيٍّ عَنِ امْرَأَتِهِ عَنْ أُخْتٍ لِحُذَيْفَةَ قَالَتْخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا مَعْشَرَ النِّسَاءِ لَا تَحَلَّيْنَ الذَّهَبَ أَمَا لَكُنَّ فِي الْفِضَّةِ مَا تَحَلَّيْنَ بِهِ مَا مِنْكُنَّ امْرَأَةٌ تَحَلَّى ذَهَبًا تُظْهِرُهُ إِلَّا عُذِّبَتْ بِهِ",
                "id": "Telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Sufyan] dari [Manshur] dari [Rib'i] dari [isterinya] dari [saudari Hudzaifah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam berkhutbah kepada kami, beliau bersabda: \"Wahai para wanita janganlah kalian berhias dengan emas, dan tidak mengapa kalian berhias dengan perak, tidaklah di antara kalian para wanita yang berhias dengan emas dan menampakkannya kecuali ia akan diadzab dengannya.\""
            },
            {
                "number": 3920,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ حُصَيْنٍ عَنْ أَبِي عُبَيْدَةَ بْنِ حُذَيْفَةَ عَنْ عَمَّتِهِ فَاطِمَةَ أَنَّهَا قَالَتْأَتَيْنَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَعُودُهُ فِي نِسَاءٍ فَإِذَا سِقَاءٌ مُعَلَّقٌ نَحْوَهُ يَقْطُرُ مَاؤُهُ عَلَيْهِ مِنْ شِدَّةِ مَا يَجِدُ مِنْ حَرِّ الْحُمَّى قُلْنَا يَا رَسُولَ اللَّهِ لَوْ دَعَوْتَ اللَّهَ فَشَفَاكَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ مِنْ أَشَدِّ النَّاسِ بَلَاءً الْأَنْبِيَاءَ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Hushain] dari [Abu Ubaidah bin Hudzaifah] dari bibinya [Fatimah] bahwa dia berkata, \"Kami mendatangi Rasulullah shallallahu 'alaihi wasallam bersama beberapa wanita untuk mengunjungi beliau, ternyata ada tempat minum yang menggantung di sampingnya, yang airnya menetesi beliau disebabkan oleh panas karena demam yang beliau derita. Kami lalu berkata kepada beliau, \"Wahai Rasulullah, seandainya tuan berdo'a kepada Allah hingga Dia menyembuhkanmu.\" Rasulullah shallallahu 'alaihi wasallam kemudian bersabda: \"Sesungguhnya manusia yang paling besar ujiannya adalah para Nabi, kemudian orang-orang yang mengikutinya, kemudian orang-orang yang mengikuti mereka, kemudian orang-orang yang mengikuti mereka.\""
            },
            {
                "number": 3921,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ وَسَمِعْتُهُ أَنَا مِنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ عَنْ زُرْعَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مَوْلًى لِمَعْمَرٍ التَّيْمِيِّ عَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ قَالَتْقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَاذَا كُنْتِ تَسْتَشْفِينَ قَالَتْ بِالشُّبْرُمِ قَالَ حَارٌّ جَارٌّ ثُمَّ اسْتَشْفَيْتُ بِالسَّنَا قَالَ لَوْ كَانَ شَيْءٌ يَشْفِي مِنْ الْمَوْتِ كَانَ السَّنَا أَوْ السَّنَا شِفَاءٌ مِنْ الْمَوْتِ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad], dan aku telah mendengarnya dari [Abdullah bin Muhammad bin Abu Syaibah] dia berkata, telah menceritakan kepada kami [Abu Usamah] dari [Abdul Hamid bin Ja'far] dari [Zur'ah bin Abdurrahman] dari [bekas budaknya Ma'mar at Taimi], dari [Asma binti 'Umais] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Dengan apa kamu berobat?\" dia menjawab, \"Dengan Syubrum (sejenis tumbuhan berbiji).\" Beliau bersabda, \"Panas, panas.\" Lalu aku berobat dengan Sana (sejenis tumbuhan), beliau bersabda: \"Jika ada yang bisa menyembuhkan dari kematian, maka itu adalah Sana.\" Atau, \"Sana adalah penyembuh dari kematian.\""
            },
            {
                "number": 3922,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مُوسَى الْجُهَنِيِّ قَالَدَخَلْتُ عَلَى فَاطِمَةَ بِنْتِ عَلِيٍّ فَقَالَ لَهَا رَفِيقِي أَبُو سَهْلٍ كَمْ لَكِ قَالَتْ سِتَّةٌ وَثَمَانُونَ سَنَةً قَالَ مَا سَمِعْتِ مِنْ أَبِيكِ شَيْئًا قَالَتْ حَدَّثَتْنِي أَسْمَاءُ بِنْتُ عُمَيْسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِعَلِيٍّ أَنْتَ مِنِّي بِمَنْزِلَةِ هَارُونَ مِنْ مُوسَى إِلَّا أَنَّهُ لَيْسَ بَعْدِي نَبِيٌّ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Musa Al Juhani] dia berkata, aku menemui [Fatimah binti 'Ali], lalu temanku, Abu Sahl, berkata kepadanya, \"Berapa umurmu?\" Fatimah menjawab, \"Delapan puluh enam tahun.\" Sahl bertanya lagi, \"Sesuatu apakah yang kamu dengan dari bapakmu?\" Fatimah menjawab, \" [Asma binti Umais] menceritakan kepadaku, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda kepada Ali: \"Kamu bagiku seperti kedudukan Harun bagi Musa, hanyasanya tidak ada Nabi setelahku.\""
            },
            {
                "number": 3923,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا عَبْدُ الْعَزِيزِ قَالَ حَدَّثَنَا هِلَالٌ مَوْلَانَا عَنِ أَبِي عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ عَنْ أُمِّهِ أَسْمَاءَ بِنْتِ عُمَيْسٍ قَالَتْعَلَّمَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَلِمَاتٍ أَقُولُهَا عِنْدَ الْكَرْبِ اللَّهُ رَبِّي لَا أُشْرِكُ بِهِ شَيْئًا",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Abdul Aziz] berkata, telah menceritakan kepada kami budak kami [Hilal] dari [Umar bin Abdul Aziz] dari [Abdullah bin Ja'far] dari ibunya [Asma binti Umais] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengajariku beberapa kalimat yang aku katakan ketika terkena bencana, yaitu: 'ALLAHU RABBI LAA USYRIKU BIHI SYAI`A (Allah adalah Rabbku yang aku tidak sekutukan dengan apapun) '.\""
            },
            {
                "number": 3924,
                "arab": "حَدَّثَنَا يَزِيدُ قَالَ أَنْبَأَنَا مُحَمَّدُ بْنُ طَلْحَةَ قَالَ حَدَّثَنَا الْحَكَمُ بْنُ عُتَيْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ قَالَتْدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْيَوْمَ الثَّالِثَ مِنْ قَتْلِ جَعْفَرٍ فَقَالَ لَا تَحِدِّي بَعْدَ يَوْمِكِ هَذَا",
                "id": "Telah menceritakan kepada kami [Yazid] berkata, telah memberitakan kepada kami [Muhammad bin Thalhah] berkata, telah menceritakan kepada kami [Al Hakam bin Utaibah] dari [Abdullah bin Syaddad] dari [Asma' binti Umais] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam menemuiku pada hari ketiga dari kematian Ja'far, suamiku. Beliau bersabda: \"Janganlah kamu melakukan ihdad (meninggalkan perhiasan dan berhias) setelah harimu ini.\""
            },
            {
                "number": 3925,
                "arab": "قَالَ قَرَأْتُ عَلَى عَبْدِ الرَّحْمَنِ : مَالِكٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍأَنَّهَا وَلَدَتْ مُحَمَّدَ بْنَ أَبِي بَكْرٍ بِالْبَيْدَاءِ فَذَكَرَ ذَلِكَ أَبُو بَكْرٍ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْهَا فَلْتَغْتَسِلْ ثُمَّ لِتُهِلَّ",
                "id": "Abdullah berkata; aku bacakan kepada [Abdurrahman]: [Malik] dari [Abdurrahman bin Qasim] dari [Ayahnya] dari [Asma' binti Umais] bahwa dia melahirkan Muhammad bin Abu Bakar di Baida', lalu Abu Bakar menceritakan hal itu kepada Rasulullah shallallahu 'alaihi wasallam, maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Perintahkan dia mandi, lalu berniat untuk berhaji.\""
            },
            {
                "number": 3926,
                "arab": "حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنِي أَبِي عَنِ الْوَلِيدِ بْنِ كَثِيرٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُسْلِمٍ الطَّوِيلُ صَاحِبُ الْمَصَاحِفِ أَنَّ كِلَابَ بْنَ تَلِيدٍ أَخَا بَنِي سَعْدِ بْنِ لَيْثٍ أَنَّهُ بَيْنَا هُوَ جَالِسٌ مَعَ سَعِيدِ بْنِ الْمُسَيَّبِ جَاءَهُ رَسُولُ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمِ بْنِ عَدِيٍّ يَقُولُ إِنَّ ابْنَ خَالَتِكَ يَقْرَأُ عَلَيْكَ السَّلَامَ وَيَقُولُ أَخْبِرْنِي كَيْفَ الْحَدِيثُ الَّذِي كُنْتَ حَدَّثْتَنِي عَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ فَقَالَ سَعِيدُ بْنُ الْمُسَيَّبِ أَخْبِرْهُ أَنَّ أَسْمَاءَ بِنْتَ عُمَيْسٍ أَخْبَرَتْنِيأَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَصْبِرُ عَلَى لَأْوَاءِ الْمَدِينَةِ وَشِدَّتِهَا أَحَدٌ إِلَّا كُنْتُ لَهُ شَفِيعًا أَوْ شَهِيدًا يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Ya'qub] berkata, telah menceritakan kepadaku [ayahku] dari [Walid bin Katsir] berkata, telah menceritakan kepada kami [Abdullah bin Muslim At Thawil] pemilik kitab Mushannif, bahwa Kilab bin Talid saudara Bani Sa'ad bin Laits, ketika dia duduk bersama [Sa'id Ibnul Musayyab] datanglah utusan Nafi' bin Jubair bin Mut'im bin Adi. Dia berkata, \"Sesungguhnya anak bibimu menyampaikan salam untukmu dan dia berkata, \"Kabarkanlah padaku bagaimana hadits yang kamu riwayatkan dari [Asma binti Umais] kepadaku?\" lalu Sa'id Ibnul Musayyab berkata, \"Kabarkan padanya bahwa Asma binti Umais mengabariku, bahwa dia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seseorang bersabar terhadap sempit dan kerasnya (iklim) Madinah, kecuali aku akan menjadi saksi baginya atau memberikan syafa'at untuknya pada hari kiamat.\""
            },
            {
                "number": 3927,
                "arab": "حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنِي أَبِي عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ عَنْ أُمِّ عِيسَى الْجَزَّارِ عَنْ أُمِّ جَعْفَرٍ بِنْتِ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ أَبِي طَالِبٍ عَنْ جَدَّتِهَا أَسْمَاءَ بِنْتِ عُمَيْسٍ قَالَتْلَمَّا أُصِيبَ جَعْفَرٌ وَأَصْحَابُهُ دَخَلْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ دَبَغْتُ أَرْبَعِينَ مَنِيئَةً وَعَجَنْتُ عَجِينِي وَغَسَّلْتُ بَنِيَّ وَدَهَنْتُهُمْ وَنَظَّفْتُهُمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ائْتِينِي بِبَنِي جَعْفَرٍ قَالَتْ فَأَتَيْتُهُ بِهِمْ فَشَمَّهُمْ وَذَرَفَتْ عَيْنَاهُ فَقُلْتُ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي مَا يُبْكِيكَ أَبَلَغَكَ عَنْ جَعْفَرٍ وَأَصْحَابِهِ شَيْءٌ قَالَ نَعَمْ أُصِيبُوا هَذَا الْيَوْمَ قَالَتْ فَقُمْتُ أَصِيحُ وَاجْتَمَعَ إِلَيَّ النِّسَاءُ وَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى أَهْلِهِ فَقَالَ لَا تُغْفِلُوا آلَ جَعْفَرٍ مِنْ أَنْ تَصْنَعُوا لَهُمْ طَعَامًا فَإِنَّهُمْ قَدْ شُغِلُوا بِأَمْرِ صَاحِبِهِمْ",
                "id": "Telah menceritakan kepada kami [Ya'qub] berkata, telah menceritakan kepadaku [ayahku] dari [Muhammad bin Ishaq] berkata, telah menceritakan kepada kami [Abdullah bin Abu Bakr] dari [Ummu Isa Al Jazzar] dari [Ummu Ja'far binti Muhammad bin Ja'far bin Abu Thalib] dari neneknya [Asma binti Umais] dia berkata, \"Ketika Ja'far dan beberapa saudara-saudaranya terkena musibah, aku menemui Rasulullah shallallahu 'alaihi wasallam, sedangkan aku telah menyamak empat puluh kulit hewan dan membuat adonan roti. Aku telah memandikan anak-anakku dan aku telah menyisir rambut dan merapikan mereka semua, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Datangkanlah kepadaku anak-anak Ja'far.\" Asma berkata, \"Lalu aku membawa mereka semua dan Rasulullah pun menciumi mereka, lantas meneteslah air mata beliau. Aku bertanya, \"Wahai Rasulullah, apa yang menyebabkanmu menangis, apakah telah sampai kabar kepadamu tentang Ja'far dan beberapa sahabatnya?\" Beliau menjawab: \"Ya, mereka mendapatkan musibah pada hari ini.\" Asma berkata, \"Lalu aku berdiri dan berteriak kemudian para wanita mengelilingiku, dan Rasulullah shallallahu 'alaihi wasallam keluar menuju keluarga beliau dan bersabda: \"Jangan kalian biarkan keluarga Ja'far membuatkan makanan untuk mereka, karena mereka sedang tersibukkan dengan perkara teman mereka.\""
            },
            {
                "number": 3928,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سَعْدِ بْنِ إِسْحَاقَ قَالَ حَدَّثَتْنِي زَيْنَبُ بِنْتُ كَعْبٍ عَنْ فُرَيْعَةَ بِنْتِ مَالِكٍ قَالَتْخَرَجَ زَوْجِي فِي طَلَبِ أَعْلَاجٍ لَهُ فَأَدْرَكَهُمْ بِطَرَفِ الْقَدُومِ فَقَتَلُوهُ فَأَتَانِي نَعْيُهُ وَأَنَا فِي دَارٍ شَاسِعَةٍ مِنْ دُورِ أَهْلِي فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقُلْتُ إِنَّ نَعْيَ زَوْجِي أَتَانِي فِي دَارٍ شَاسِعَةٍ مِنْ دُورِ أَهْلِي وَلَمْ يَدَعْ لِي نَفَقَةً وَلَا مَالًا لِوَرَثَتِهِ وَلَيْسَ الْمَسْكَنُ لَهُ فَلَوْ تَحَوَّلْتُ إِلَى أَهْلِي وَأَخْوَالِي لَكَانَ أَرْفَقَ بِي فِي بَعْضِ شَأْنِي قَالَ تَحَوَّلِي فَلَمَّا خَرَجْتُ إِلَى الْمَسْجِدِ أَوْ إِلَى الْحُجْرَةِ دَعَانِي أَوْ أَمَرَ بِي فَدُعِيتُ فَقَالَ امْكُثِي فِي بَيْتِكِ الَّذِي أَتَاكِ فِيهِ نَعْيُ زَوْجِكِ حَتَّى يَبْلُغَ الْكِتَابُ أَجَلَهُ قَالَتْ فَاعْتَدَدْتُ فِيهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا قَالَتْ فَأَرْسَلَ إِلَيَّ عُثْمَانُ فَأَخْبَرْتُهُ فَأَخَذَ بِهِحَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ سَعْدِ بْنِ إِسْحَاقَ قَالَ حَدَّثَتْنِي زَيْنَبُ بِنْتُ كَعْبٍ عَنْ فُرَيْعَةَ بِنْتِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sa'd bin Ishaq] berkata, telah menceritakan kepadaku [Zainab binti Ka'b] dari [Furai'ah binti Malik] dia berkata, \"Suamiku keluar untuk meminta pertolongan kepada orang-orang kafir, ketika dia sampai dipenghujung jalan, mereka membunuhnya, lalu datanglah pembawa kabar kematiannya kepadaku, sedangkan rumahku jauh dari rumah-rumah keluargaku. Lantas aku menemui Rasulullah shallallahu 'alaihi wasallam dan menceritakan akan hal itu, aku katakan, 'Sesungguhnya pembawa kabar kematian suamiku datang kepadaku, sedangkan aku berada di rumah yang jauh dari rumah-rumah keluargaku, dan suamiku tidak meninggalkan untukku nafkah apalagi harta yang akan diwariskannya. Dan dia tidak mempunyai rumah, jika aku pindah ke rumah keluargaku, atau paman-pamanku niscaya akan mempermudah beberapa urusanku.\" Beliau bersabda: \"Pindahlah, \" ketika aku keluar masjid, atau keruanganku, beliau memanggilku atau menyuruh seeorang memanggilku. Maka aku pun dipanggil, beliau lantas bersabda: \"Tetaplah di rumah saat pembawa kabar itu datang hingga habis masa iddahnya.\" Asma berkata, \"Lalu aku menunggu di sana empat bulan sepuluh hari. Kemudian Utsman mengirim kepadaku sesuatu, lalu aku mengabarkannya dan iapun mengambilnya.\" Telah menceritakan kepada kami [Bisyr bin Mufadlal] dari [Sa'd bin Ishaq] dia berkata; telah menceritakan kepadaku [Zainab binti Ka'b] dari [Furai'ah binti Malik] dari Nabi shallallahu 'alaihi wasallam seperti itu.\""
            },
            {
                "number": 3929,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ قَالَ حَدَّثَنَا هَانِئُ بْنُ عُثْمَانَ الْجُهَنِيُّ عَنْ أُمِّهِ حُمَيْضَةَ بِنْتِ يَاسِرٍ عَنْ جَدَّتِهَا يُسَيْرَةَ وَكَانَتْ مِنْ الْمُهَاجِرَاتِ قَالَتْقَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا نِسَاءَ الْمُؤْمِنَاتِ عَلَيْكُنَّ بِالتَّهْلِيلِ وَالتَّسْبِيحِ وَالتَّقْدِيسِ وَلَا تَغْفُلْنَ فَتَنْسَيْنَ الرَّحْمَةَ وَاعْقِدْنَ بِالْأَنَامِلِ فَإِنَّهُنَّ مَسْئُولَاتٌ مُسْتَنْطَقَاتٌ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Bisyr] berkata, telah menceritakan kepada kami [Hani' bin Utsman Al Juhani] dari ibunya [Humaidlah binti Yasir] dari neneknya [Yusairah] dia adalah seorang wanita muhajirin, dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda kepada kami: \"Wahai kaum wanita yang beriman, bertahlillah, bertasbihlah, dan bertaqdislah (mensucikan Allah) dan janganlah kalian lalai, sehingga kalian lupa akan rahmat (Allah). Dan ikatlah pada ujung jari-jari, karena hal itu akan ditanya dan akan menjawab.\""
            },
            {
                "number": 3930,
                "arab": "حَدَّثَنَا هَارُونُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ حَدَّثَنِي دَاوُدُ بْنُ قَيْسٍ عَنْ عَبْدِ اللَّهِ بْنِ سُوَيْدٍ الْأَنْصَارِيِّ عَنْ عَمَّتِهِ أُمِّ حُمَيْدٍ امْرَأَةِ أَبِي حُمَيْدٍ السَّاعِدِيِّأَنَّهَا جَاءَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنِّي أُحِبُّ الصَّلَاةَ مَعَكَ قَالَ قَدْ عَلِمْتُ أَنَّكِ تُحِبِّينَ الصَّلَاةَ مَعِي وَصَلَاتُكِ فِي بَيْتِكِ خَيْرٌ لَكِ مِنْ صَلَاتِكِ فِي حُجْرَتِكِ وَصَلَاتُكِ فِي حُجْرَتِكِ خَيْرٌ مِنْ صَلَاتِكِ فِي دَارِكِ وَصَلَاتُكِ فِي دَارِكِ خَيْرٌ لَكِ مِنْ صَلَاتِكِ فِي مَسْجِدِ قَوْمِكِ وَصَلَاتُكِ فِي مَسْجِدِ قَوْمِكِ خَيْرٌ لَكِ مِنْ صَلَاتِكِ فِي مَسْجِدِيقَالَ فَأَمَرَتْ فَبُنِيَ لَهَا مَسْجِدٌ فِي أَقْصَى شَيْءٍ مِنْ بَيْتِهَا وَأَظْلَمِهِ فَكَانَتْ تُصَلِّي فِيهِ حَتَّى لَقِيَتْ اللَّهَ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Harun] telah menceritakan kepada kami [Abdullah bin Wahb] berkata, telah menceritakan kepadaku [Daud bin Qais] dari [Abdullah bin Suwaid Al Anshari] dari bibinya [Ummu Humaid] isteri Abu Humaid As Sa'di, bahwa dia menemui Nabi shallallahu 'alaihi wasallam lalu berkata, \"Wahai Rasulullah, sesungguhnya aku menyukai sholat bersamamu!\" Beliau bersabda: \"Aku sudah tahu jika kamu suka sholat denganku, namun sholatmu di rumahmu lebih baik daripada sholatmu di kamarmu, dan sholatmu di kamarmu lebih baik daripda sholat di rumahmu, dan sholatmu di rumahmu lebih baik daripada sholatmu di masjid kaummu, dan sholatmu di masjid kaummu lebih baik daripada sholat di masjidku.\" Ummu Humaid berkata, \"Lalu dia diperintahkan untuk membuat masjid di tempat yang paling pojok dalam rumahnya dan yang paling gelap, setelah itu dia sholat di sana hingga dia menemui Allah Azza Wa Jalla.\""
            },
            {
                "number": 3931,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ أَنَّ صَالِحًا أَبَا الْخَلِيلِ حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ أَنَّ أُمَّ حَكِيمٍ بِنْتَ الزُّبَيْرِ حَدَّثَتْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَى ضُبَاعَةَ بِنْتِ الزُّبَيْرِ فَنَهَسَ مِنْ كَتِفٍ عِنْدَهَا ثُمَّ صَلَّى وَمَا تَوَضَّأَ مِنْ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata, telah menceritakan kepada kami [Sa'id bin Abu Urubah] dari [Qatadah] bahwa [Shalih Abu Khalil] telah menceritakan kepadanya dari [Abdullah bin Harits bin Naufal] bahwa [Ummu Hakim binti Zubair] menceritakan kepadanya, bahwa Rasulullah shallallahu 'alaihi wasallam mendatangi Dluba'ah binti Zubair, beliau lalu memakan daging (pundak kambing) kemudian sholat dan tidak berwudlu karenanya.\""
            },
            {
                "number": 3932,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى قَالَ حَدَّثَنَا رَافِعُ بْنُ سَلَمَةَ الْأَشْجَعِيُّ قَالَ حَدَّثَنِي حَشْرَجُ بْنُ زِيَادٍ عَنْ جَدَّتِهِ أُمِّ أَبِيهِ قَالَتْخَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةِ خَيْبَرَ وَأَنَا سَادِسَةُ سِتِّ نِسْوَةٍ قَالَتْ فَبَلَغَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ مَعَهُ نِسَاءً قَالَتْ فَأَرْسَلَ إِلَيْنَا فَدَعَانَا قَالَتْ فَرَأَيْنَا فِي وَجْهِهِ الْغَضَبَ فَقَالَ مَا أَخْرَجَكُنَّ وَبِأَمْرِ مَنْ خَرَجْتُنَّ قُلْنَا خَرَجْنَا مَعَكَ نُنَاوِلُ السِّهَامَ وَنَسْقِي السَّوِيقَ وَمَعَنَا دَوَاءٌ لِلْجُرْحِ وَنَغْزِلُ الشَّعْرَ فَنُعِينُ بِهِ فِي سَبِيلِ اللَّهِ قَالَ قُمْنَ فَانْصَرِفْنَ قَالَتْ فَلَمَّا فَتَحَ اللَّهُ عَلَيْهِ خَيْبَرَ أَخْرَجَ لَنَا مِنْهَا سِهَامًا كَسِهَامِ الرِّجَالِفَقُلْتُ لَهَا يَا جَدَّتِي وَمَا الَّذِي أَخْرَجَ لَكُنَّ قَالَتْ تَمْرٌ",
                "id": "Telah menceritakan kepada kami [Hasan bin Musa] berkata, telah menceritakan kepada kami [Rafi' bin Salamah Al Asyja'i] berkata, telah menceritakan kepadaku [Hasyraj bin Ziyad] dari [neneknya] ibu dari ayahnya, dia berkata, \"Kami keluar bersama Rasulullah shallallahu 'alaihi wasallam pada perang Khaibar dan aku adalah orang keenam dari enam wanita.\" Dia berkata, \"Kemudian sampailah kabar kepada Nabi shallallahu 'alaihi wasallam bahwasanya ada beberapa wanita yang ikut bersama beliau, lalu beliau mengirim seseorang kepada kami untuk memanggil kami. Dan kami melihat kemarahan pada wajah beliau, beliau bersabda: \"Apa yang menyebabkan kalian keluar dan atas perintah siapa kalian keluar?\" kami menjawab, \"Kami keluar bersama tuan setelah melakukan undian, membawakan air, dan kami membawa obat-obatan bagi yang terluka, kami pintal rambut dan kami beri pertolongan dengannya di jalan Allah.\" Beliau bersabda: \"Berdiri dan pergilah, \" dia berkata, \"Ketika Allah membukakan Khaibar beliau mengeluarkan untuk kami undian seperti yang dilakukan untuk kaum lelaki.\" Aku lalu berkata kepadanya, \"Hai nenekku, apa yang beliau keluarkan untuk kalian.\" Dia menjawab, \"Kurma.\""
            },
            {
                "number": 3933,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا الْمَسْعُودِيُّ قَالَ حَدَّثَنِي مَعْبَدُ بْنُ خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ يَسَارٍ عَنْ قُتَيْلَةَ بِنْتِ صَيْفِيٍّ الْجُهَيْنِيَّةِ قَالَتْأَتَى حَبْرٌ مِنْ الْأَحْبَارِ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا مُحَمَّدُ نِعْمَ الْقَوْمُ أَنْتُمْ لَوْلَا أَنَّكُمْ تُشْرِكُونَ قَالَ سُبْحَانَ اللَّهِ وَمَا ذَاكَ قَالَ تَقُولُونَ إِذَا حَلَفْتُمْ وَالْكَعْبَةِ قَالَتْ فَأَمْهَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا ثُمَّ قَالَ إِنَّهُ قَدْ قَالَ فَمَنْ حَلَفَ فَلْيَحْلِفْ بِرَبِّ الْكَعْبَةِ قَالَ يَا مُحَمَّدُ نِعْمَ الْقَوْمُ أَنْتُمْ لَوْلَا أَنَّكُمْ تَجْعَلُونَ لِلَّهِ نِدًّا قَالَ سُبْحَانَ اللَّهِ وَمَا ذَاكَ قَالَ تَقُولُونَ مَا شَاءَ اللَّهُ وَشِئْتَ قَالَ فَأَمْهَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا ثُمَّ قَالَ إِنَّهُ قَدْ قَالَ فَمَنْ قَالَ مَا شَاءَ اللَّهُ فَلْيَفْصِلْ بَيْنَهُمَا ثُمَّ شِئْتَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] berkata, telah menceritakan kepada kami [Mas'udi] berkata, telah menceritakan kepadaku [Ma'bad bin Khalid] dari [Abdullah bin Yasar] dari [Qutailah binti Shafi Al Juhainah] dia berkata, \"Seorang rahib datang menemui Rasulullah shallallahu 'alaihi wasallam lalu berkata, \"Wahai Muhammad, sebaik-baik kaum adalah kalian, jika kalian tidak berbuat syirik.\" Beliau pun bersabda: \"Subhanallah, apa yang kau maksud?\" Qutailah menjawab, \"Jika bersumpah kalian mengatakan 'Demi Ka'bah'.\" Qutailah berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam menunggu sesuatu, lalu beliau bersabda: \"Sesungguhnya telah dikatakan bahwa barangsiapa yang hendak bersumpah maka bersumpahlah dengan pemilik Ka'bah.\" Rahib itu berkata, \"Wahai Muhammad, sebaik-baik kaum adalah kalian jika kalian tidak menjadikan bagi Allah sekutu.\" Beliau bersabda: \"Subhanallah apa yang kau maksud?\" ia menjawab, \"Kalian mengatakan 'Maa syaallah wa syi'ta (Atas kehendak Allah dan atas kehendakmu) '.\" Qutailah berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam menunggu sesuatu lalu beliau bersabda: \"Sesungguhnya telah dikatakan bahwa, barangsiapa mengatakan 'Maa syaallah', maka hendaknya (jika ia meneruskan) ia meneruskan dengan mengatakan 'tsumma syi'ta (kemudian atas kehendak kamu) '.\""
            },
            {
                "number": 3934,
                "arab": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ قَالَ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ رَجُلٍ مِنْ آلِ أَبِي حَثْمَةَ عَنِ الشِّفَاءِ بِنْتِ عَبْدِ اللَّهِ وَكَانَتْ امْرَأَةً مِنْ الْمُهَاجِرَاتِ قَالَتْإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ أَفْضَلِ الْأَعْمَالِ فَقَالَ إِيمَانٌ بِاللَّهِ وَجِهَادٌ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ وَحَجٌّ مَبْرُورٌ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Qasim] berkata, telah menceritakan kepada kami [Al Mas'udi] dari [Abdul Malik bin Umair] dari [seorang laki-laki] dari keluarga Hatsmah, dari [Syifa' binti Abdullah] dia adalah orang yang pernah ikut berhijrah, ia berkata \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam ditanya tentang sebaik-baik amalan, beliau menjawab: \"Iman kepada Allah, berjihad di jalan Allah Azza Wa Jalla dan haji mabrur.\""
            },
            {
                "number": 3935,
                "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ عَبْدِ الْعَزِيزِ بْنِ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ سُلَيْمَانَ بْنِ أَبِي حَثْمَةَ عَنِ الشِّفَاءِ بِنْتِ عَبْدِ اللَّهِ قَالَتْدَخَلَ عَلَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا عِنْدَ حَفْصَةَ فَقَالَ لِي أَلَا تُعَلِّمِينَ هَذِهِ رُقْيَةَ النَّمْلَةِ كَمَا عَلَّمْتِيهَا الْكِتَابَةَ",
                "id": "Telah menceritakan kepada kami [Ibrahim bin Mahdi] berkata, telah menceritakan kepada kami [Ali bin Mushir] dari [Abdul Aziz bin Umar bin Abdul Aziz] dari [Shalih bin Kaisan] dari [Abu Bakr bin Abdurrahman bin Sulaiman bin Abu Hatsmah] dari [Syifa' binti Abdullah] dia berkata, \"Nabi shallallahu 'alaihi wasallam menemui kami saat aku berada di samping Hafshah, beliau bersabda kepadaku: \"Tidakkah kamu mengajarkan ruqyah untuk luka ini sebagaimana kamu mengajarinya menulis.\""
            },
            {
                "number": 3936,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا الْمَسْعُودِيُّ وَأَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ قَالَ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ عَنْ رَجُلٍ مِنْ آلِ أَبِي حَثْمَةَ عَنِ الشِّفَاءِ بِنْتِ عَبْدِ اللَّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ أَيُّ الْأَعْمَالِ أَفْضَلُ قَالَ الْإِيمَانُ بِاللَّهِ وَالْجِهَادُ فِي سَبِيلِ اللَّهِ وَحَجٌّ مَبْرُورٌ قَالَ أَبُو عَبْدِ الرَّحْمَنِ أَوْ حَجٌّ مَبْرُورٌ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Al Mas'udi] dan [Abu Abdurrahman Al Muqri'] berkata, telah menceritakan kepada kami [Al Mas'udi] dari [Abdul Malik bin Umair] dari [seorang laki-laki] dari keluarga Abu Hatsmah, dari [Syifa' binti Abdullah] bahwa Nabi shallallahu 'alaihi wasallam ditanya mengenai amalan apakah yang paling utama? Beliau menjawab: \"Iman kepada Allah, berjihad di jalan Allah dan haji mabrur.\" Abu Abdurrahman menyebutkan, \"Atau haji mabrur.\""
            },
            {
                "number": 3937,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي إِسْحَاقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ الْفَائِشِيِّ عَنِ ابْنَةٍ لِخَبَّابٍ قَالَتْخَرَجَ خَبَّابٌ فِي سَرِيَّةٍ فَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَعَاهَدُنَا حَتَّى كَانَ يَحْلُبُ عَنْزًا لَنَا قَالَتْ فَكَانَ يَحْلُبُهَا حَتَّى يَطْفَحَ أَوْ يَفِيضَ فَلَمَّا رَجَعَ خَبَّابٌ حَلَبَهَا فَرَجَعَ حِلَابُهَا إِلَى مَا كَانَ فَقُلْنَا لَهُ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَحْلُبُهَا حَتَّى يَفِيضَ وَقَالَ مَرَّةً حَتَّى تَمْتَلِئَ فَلَمَّا حَلَبْتَهَا رَجَعَ حِلَابُهَاحَدَّثَنَا خَلَفُ بْنُ الْوَلِيدِ قَالَ حَدَّثَنَا إِسْرَائِيلُ عَنْ أَبِي إِسْحَاقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ مَالِكٍ الْأَحْمَسِيِّ عَنِ ابْنَةٍ لِخَبَّابِ بْنِ الْأَرَتِّ قَالَتْ خَرَجَ أَبِي فِي غَزَاةٍ وَلَمْ يَتْرُكْ إِلَّا شَاةً فَذَكَرَ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Al A'masi] dari [Abu Ishaq] dari [Abdurrahman bin Zaid Al Faisyi] dari [seorang anak perempuan Khabbab] dia berkata, \"Khabbab keluar pada suatu ekspedisi, dan Nabi shallallahu 'alaihi wasallam mengadakan perjanjian kepada kami hingga beliau memerah seekor kambing untuk kami, beliau memerah susunya hingga memenuhi tempatnya. Ketika Khabbab pulang, dia memerah susu lalu mengembalikan bejananya ke tempat semula, kami lalu berkata kepadanya, \"Jika Rasulullah shallallahu 'alaihi wasallam memerah susu maka beliau melakukannya hingga penuh terisi, atau dia berkata, 'hingga bejana terisi seluruhnya, namun ketika kamu memerah susu, bejananya tidak terisi penuh.\" Telah menceritakan kepada kami [Khalaf bin Walid] berkata; telah menceritakan kepada kami [Israil] dari [Abu Ishaq] dari [Abdurrahman bin Malik Al Ahmasyi] dari [seorang anak perempuan Khabbab bin Al Arats] dia berkata, \"Ayahku keluar pada suatu peperangan dan dia tidak meninggalkan kecuali hanya seekor kambing….lalu dia menyebutkan hadistnya.\""
            },
            {
                "number": 3938,
                "arab": "حَدَّثَنَا أَبُو عَامِرٍ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ إِسْمَاعِيلَ بْنِ أَبِي حَبِيبَةَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ الْأَشْهَلِيُّ عَنْ أُمِّ عَامِرٍ بِنْتِ يَزِيدَ امْرَأَةٍ مِنْ الْمُبَايِعَاتِأَنَّهَا أَتَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعَرْقٍ فِي مَسْجِدِ بَنِي فُلَانٍ فَتَعَرَّقَهُ ثُمَّ قَامَ فَصَلَّى وَلَمْ يَتَوَضَّأْ",
                "id": "Telah menceritakan kepada kami [Abu Amir] berkata, telah menceritakan kepada kami [Ibrahim bin Isma'il bin Abu Habibah] berkata, telah menceritakan kepada kami [Abdurrahman bin Abdullah Al Asyhali] dari [Ummi 'Amir bin Yazid], bahwa di antara para wanita yang berbaiat, ada seseorang dari mereka datang kepada Nabi shallallahu 'alaihi wasallam dengan membawa daging di masjid Bani Fulan, lalu beliau memakannya kemudian berdiri sholat dan tidak berwudlu.\""
            },
            {
                "number": 3939,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا مُجَالِدٌ قَالَ حَدَّثَنَا عَامِرٌ قَالَقَدِمْتُ الْمَدِينَةَ فَأَتَيْتُ فَاطِمَةَ بِنْتَ قَيْسٍ فَحَدَّثَتْنِي أَنَّ زَوْجَهَا طَلَّقَهَا عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَعَثَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَرِيَّةٍ قَالَتْ فَقَالَ لِي أَخُوهُ اخْرُجِي مِنْ الدَّارِ فَقُلْتُ إِنَّ لِي نَفَقَةً وَسُكْنَى حَتَّى يَحِلَّ الْأَجَلُ قَالَ لَا قَالَتْ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنَّ فُلَانًا طَلَّقَنِي وَإِنَّ أَخَاهُ أَخْرَجَنِي وَمَنَعَنِي السُّكْنَى وَالنَّفَقَةَ فَأَرْسَلَ إِلَيْهِ فَقَالَ مَا لَكَ وَلِابْنَةِ آلِ قَيْسٍ قَالَ يَا رَسُولَ اللَّهِ إِنَّ أَخِي طَلَّقَهَا ثَلَاثًا جَمِيعًا قَالَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْظُرِي يَا ابْنَةَ آلِ قَيْسٍ إِنَّمَا النَّفَقَةُ وَالسُّكْنَى لِلْمَرْأَةِ عَلَى زَوْجِهَا مَا كَانَتْ لَهُ عَلَيْهَا رَجْعَةٌ فَإِذَا لَمْ يَكُنْ لَهُ عَلَيْهَا رَجْعَةٌ فَلَا نَفَقَةَ وَلَا سُكْنَى اخْرُجِي فَانْزِلِي عَلَى فُلَانَةَ ثُمَّ قَالَ إِنَّهُ يُتَحَدَّثُ إِلَيْهَا انْزِلِي عَلَى ابْنِ أُمِّ مَكْتُومٍ فَإِنَّهُ أَعْمَى لَا يَرَاكِ ثُمَّ لَا تَنْكِحِي حَتَّى أَكُونَ أُنْكِحُكِ قَالَتْ فَخَطَبَنِي رَجُلٌ مِنْ قُرَيْشٍ فَأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَسْتَأْمِرُهُ فَقَالَ أَلَا تَنْكِحِينَ مَنْ هُوَ أَحَبُّ إِلَيَّ مِنْهُ فَقُلْتُ بَلَى يَا رَسُولَ اللَّهِ فَأَنْكِحْنِي مَنْ أَحْبَبْتَ قَالَتْ فَأَنْكَحَنِي أُسَامَةَ بْنَ زَيْدٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] berkata, telah menceritakan kepada kami [Mujalid] berkata, telah menceritakan kepada kami [Amir] dia berkata, \"Saat memasuki Madinah, aku menemui [Fatimah binti Qais] dia mengatakan kepadaku bahwa suaminya telah menceraikannya pada masa Rasulullah shallallahu 'alaihi wasallam, lalu Rasulullah shallallahu 'alaihi wasallam mengutusnya (suami) pada suatu ekspedisi.\" Fatimah berkata, \"Kemudian saudaranya berkata kepadaku, \"Keluarlah dari rumah.\" Aku pun berkata, \"Sesungguhnya aku memiliki hak untuk dinafkahi dan tempat tinggal hingga selesai masanya.\" Dia (saudaranya) Berkata, \"Tidak bisa.\" Lalu aku menemui Rasulullah shallallahu 'alaihi wasallam, aku sampaikan kepada beliau, \"Sesungguhnya fulan menceraikan aku dan saudaranya mengeluarkan aku dari rumahnya, ia menghalangiku untuk bertempat tinggal dan tidak memberiku nafkah?\" Kemudian beliau mengirim seseorang menemuinya, beliau bersabda: \"Apa urusanmu dengan anak perempuan keluarga Qais?\" dia menjawab, \"Wahai Rasulullah, sesungguhnya saudaraku telah mentalaknya tiga kali sekaligus.\" Fatimah berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Lihatlah hai anak perempuan keluarga Qais, hanyasanya tempat tinggal dan nafkah itu untuk isteri yang ditalak suaminya namun ia masih bisa rujuk kepadanya, apabila ditalak yang tidak bisa rujuk lagi maka tidak ada nafkah dan tempat tinggal, oleh karena itu keluarlah dan tinggallah di rumah fulanah.\" Kemudian beliau berkata -ini ditujukan kepada wanita tersebut-: \"Tinggallah di rumah Ibnu Ummi Maktum karena sesungguhnya ia buta dan tidak melihatmu, lalu janganlah menikah hingga aku menikahkanmu.\" Fatimah berkata, \"Lalu datanglah seorang Quraisy untuk melamarku, kemudian aku mendatangi Rasulullah shallallahu 'alaihi wasallam menanyakan hal itu, beliau bersabda: \"Tidakkah kamu menikahi orang yang lebih aku cintai daripadanya?\" aku menjawab, \"Baik ya Rasulullah, nikahkan aku dengan siapapun yang tuan cintai.\" Fatimah melanjutkan, \"Lalu beliau menikahkanku dengan Usamah bin Zaid.\""
            },
            {
                "number": 3940,
                "arab": "قَالَ فَلَمَّا أَرَدْتُ أَنْ أَخْرُجَ قَالَتْ اجْلِسْ حَتَّى أُحَدِّثَكَ حَدِيثًا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا مِنْ الْأَيَّامِ فَصَلَّى صَلَاةَ الْهَاجِرَةِ ثُمَّ قَعَدَ فَفَزِعَ النَّاسُ فَقَالَ اجْلِسُوا أَيُّهَا النَّاسُ فَإِنِّي لَمْ أَقُمْ مَقَامِي هَذَا لِفَزَعٍ وَلَكِنَّ تَمِيمًا الدَّارِيَّ أَتَانِي فَأَخْبَرَنِي خَبَرًا مَنَعَنِي الْقَيْلُولَةَ مِنْ الْفَرَحِ وَقُرَّةِ الْعَيْنِ فَأَحْبَبْتُ أَنْ أَنْشُرَ عَلَيْكُمْ فَرَحَ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَنِي أَنَّ رَهْطًا مِنْ بَنِي عَمِّهِ رَكِبُوا الْبَحْرَ فَأَصَابَتْهُمْ رِيحٌ عَاصِفٌ فَأَلْجَأَتْهُمْ الرِّيحُ إِلَى جَزِيرَةٍ لَا يَعْرِفُونَهَا فَقَعَدُوا فِي قُوَيْرِبٍ بِالسَّفِينَةِ حَتَّى خَرَجُوا إِلَى الْجَزِيرَةِ فَإِذَا هُمْ بِشَيْءٍ أَهْلَبَ كَثِيرِ الشَّعْرِ لَا يَدْرُونَ أَرَجُلٌ هُوَ أَوْ امْرَأَةٌ فَسَلَّمُوا عَلَيْهِ فَرَدَّ عَلَيْهِمْ السَّلَامَ قَالُوا أَلَا تُخْبِرُنَا قَالَ مَا أَنَا بِمُخْبِرِكُمْ وَلَا بِمُسْتَخْبِرِكُمْ وَلَكِنْ هَذَا الدَّيْرَ قَدْ رَهِقْتُمُوهُ فَفِيهِ مَنْ هُوَ إِلَى خَبَرِكُمْ بِالْأَشْوَاقِ أَنْ يُخْبِرَكُمْ وَيَسْتَخْبِرَكُمْ قَالَ قُلْنَا فَمَا أَنْتَ قَالَ أَنَا الْجَسَّاسَةُ فَانْطَلَقُوا حَتَّى أَتَوْا الدَّيْرَ فَإِذَا هُمْ بِرَجُلٍ مُوثَقٍ شَدِيدِ الْوَثَاقِ مُظْهِرٍ الْحُزْنَ كَثِيرِ التَّشَكِّي فَسَلَّمُوا عَلَيْهِ فَرَدَّ عَلَيْهِمْ فَقَالَ مِمَّنْ أَنْتُمْ قَالُوا مِنْ الْعَرَبِ قَالَ مَا فَعَلَتْ الْعَرَبُ أَخَرَجَ نَبِيُّهُمْ بَعْدُ قَالُوا نَعَمْ قَالَ فَمَا فَعَلُوا قَالُوا خَيْرًا آمَنُوا بِهِ وَصَدَّقُوهُ قَالَ ذَلِكَ خَيْرٌ لَهُمْ وَكَانَ لَهُ عَدُوٌّ فَأَظْهَرَهُ اللَّهُ عَلَيْهِمْ قَالَ فَالْعَرَبُ الْيَوْمَ إِلَهُهُمْ وَاحِدٌ وَدِينُهُمْ وَاحِدٌ وَكَلِمَتُهُمْ وَاحِدَةٌ قَالُوا نَعَمْ قَالَ فَمَا فَعَلَتْ عَيْنُ زُغَرَ قَالُوا صَالِحَةٌ يَشْرَبُ مِنْهَا أَهْلُهَا لِشَفَتِهِمْ وَيَسْقُونَ مِنْهَا زَرْعَهُمْ قَالَ فَمَا فَعَلَ نَخْلٌ بَيْنَ عَمَّانَ وَبَيْسَانَ قَالُوا صَالِحٌ يُطْعِمُ جَنَاهُ كُلَّ عَامٍ قَالَ فَمَا فَعَلَتْ بُحَيْرَةُ الطَّبَرِيَّةِ قَالُوا مَلْأَى قَالَ فَزَفَرَ ثُمَّ زَفَرَ ثُمَّ زَفَرَ ثُمَّ حَلَفَ لَوْ خَرَجْتُ مِنْ مَكَانِي هَذَا مَا تَرَكْتُ أَرْضًا مِنْ أَرْضِ اللَّهِ إِلَّا وَطِئْتُهَا غَيْرَ طَيْبَةَ لَيْسَ لِي عَلَيْهَا سُلْطَانٌ قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى هَذَا انْتَهَى فَرَحِي ثَلَاثَ مِرَارٍ إِنَّ طَيْبَةَ الْمَدِينَةَ إِنَّ اللَّهَ حَرَّمَ حَرَمِي عَلَى الدَّجَّالِ أَنْ يَدْخُلَهَا ثُمَّ حَلَفَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي لَا إِلَهَ إِلَّا هُوَ مَا لَهَا طَرِيقٌ ضَيِّقٌ وَلَا وَاسِعٌ فِي سَهْلٍ وَلَا فِي جَبَلٍ إِلَّا عَلَيْهِ مَلَكٌ شَاهِرٌ بِالسَّيْفِ إِلَى يَوْمِ الْقِيَامَةِ مَا يَسْتَطِيعُ الدَّجَّالُ أَنْ يَدْخُلَهَا عَلَى أَهْلِهَاقَالَ عَامِرٌ فَلَقِيتُ الْمُحَرَّرَ بْنَ أَبِي هُرَيْرَةَ فَحَدَّثْتُهُ حَدِيثَ فَاطِمَةَ بِنْتِ قَيْسٍ فَقَالَ أَشْهَدُ عَلَى أَبِي أَنَّهُ حَدَّثَنِي كَمَا حَدَّثَتْكَ فَاطِمَةُ غَيْرَ أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّهُ نَحْوَ الْمَشْرِقِ قَالَ ثُمَّ لَقِيتُ الْقَاسِمَ بْنَ مُحَمَّدٍ فَذَكَرْتُ لَهُ حَدِيثَ فَاطِمَةَ فَقَالَ أَشْهَدُ عَلَى عَائِشَةَ أَنَّهَا حَدَّثَتْنِي كَمَا حَدَّثَتْكَ فَاطِمَةُ غَيْرَ أَنَّهَا قَالَتْ الْحَرَمَانِ عَلَيْهِ حَرَامٌ مَكَّةُ وَالْمَدِينَةُ",
                "id": "(Masih dari jalur periwayatan yang sama dengan hadits sebelumnya), Abdullah berkata -Tatkala aku ingin keluar, dia berkata; duduklah sehingga aku bisa menceritakan kepadamu hadits dari Rasulullah shallallahu 'alaihi wasallam- [Fatimah bin Qais] berkata, \"Suatu hari Rasulullah shallallahu 'alaihi wasallam keluar lalu beliau mengerjakan sholat hajirah (waktu dluha) kemudian beliau duduk, maka orang-orang sama terkejut, lalu beliau bersabda: \"Duduklah wahai manusia, sesungguhnya aku berdiri di tempatku ini tidak untuk mengejutkan kalian, akan tetapi Tamim Ad Dari telah menemuiku dan mengabarkan kepadaku sehingga aku tidak bisa Qailulah (tidur siang) karena sangat menyenangkan dan menyejukkan hati, oleh karenanya aku ingin menyebarkan kepada kalian berita senangnya Nabi kalian. Tamim telah mengabarkan kepadaku bahwa sekelompok orang dari keturunan pamannya yang mengarungi lautan kemudian mereka diterpa oleh angin topan sehingga membuat mereka terdampar di sebuah pulau yang asing bagi mereka, kemudian mereka duduk di sampan sampai keluar menuju pulau, tiba tiba mereka bertemu dengan makluq yang berparas sangat kasar dan berambut gondrong sehingga tidak katahuan apakah dia laki laki atau perempuan. Kemudian mereka mengucapkan salam kepadanya dan dia menjawab salam, mereka bertanya, 'Mahukah kamu bercerita kepada kami? ' Makhluk itu menjawab, 'Aku bukanlah orang yang bercerita dan bukan pula yang meminta cerita kepada kalian, akan tetapi pergilah ke tempat peribadatan ini, yang kalian telah mendekatinya, di dalamnya ada orang yang sangat menanti berita kalian, dia akan bercerita dan meminta cerita kepada kalian'. Kemudian mereka bertanya, 'Maka kami bertanya, 'Siapa kamu? ' dia menjawab, 'Aku adalah Jassasah'. Lalu mereka berjalan sampai tiba di tempat peribadatan, akhirnya mereka mendapatkan seorang lelaki yang penuh dengan rantai, berpenampilan sedih dan banyak mengeluh. Mereka kemudian mengucapkan salam kepadanya, dan dia pun menjawab salam mereka. Lalu dia bertanya, 'Siapa kalian? ' mereka menjawab, 'Kami orang-orang dari bangsa Arab.' Dia bertanya lagi, 'Tidakkah orang-orang arab saat ini mengusir Nabi mereka? ' mereka menjawab, 'Ya, ' dia bertanya lagi, 'Maka apa yang dilakukan oleh orang orang Arab? ' mereka menjawab, 'Mereka melakukan sesuatu yang baik, beriman kepadanya dan membenarkannya.' Dia berkata, 'Itu adalah lebih baik bagi mereka, dan dia mempunyai musuh namun Allah memenangkannya dari mereka.' Lelaki itu kemudian bertanya lagi, 'Berarti orang-orang arab hari ini tuhan mereka satu, agama mereka satu dan kalimat mereka satu? ' mereka menjawab, 'Ya.' Dia bertanya lagi, 'Maka apa yang terjadi dengan 'Ainu Zughar (nama mata air)? ' mereka menjawab, 'Terjadi sesuatu yang baik, para penduduk mengambil air darinya untuk minum, dan menyiram tanaman mereka darinya, ' kemudian dia bertanya lagi, 'Maka apa yang terjadi dengan pohon kurma yang ada di antara Aman dan Baisan? ' mereka menjawab, 'Terjadi sesuatu yang baik, hasil panen darinya dapat memberikan kecukupan makanan setiap tahunnya, ' dia bertanya, 'Kemudian apa yang terjadi dengan perahu Tabariyah? ' mereka menjawab, 'Penuh.\" Tamim berkata, 'Kemudian lelaki itu mengeluarkan nafas, kemudian mengeluarkan nafas lagi dan kemudian mengeluarkan nafas lalu bersumpah, 'Seandainya aku keluar dari tempatku ini, pasti tidak aku tinggalkan satu bumipun dari bumi Allah melainkan akan aku lalui kecuali, Thaibah (nama kota Madinah), tidak ada kekuasaan bagiku atasnya.\" Amir bin Syarahil berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sampai di sini selesai kegembiraanku -tiga kali-. Sesungguhnya kebaikan kota Madinah ialah karena Allah Azza Wa Jalla telah mengharamkan kepada Dajjal untuk memasukinya.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersumpah: \"Demi Allah, yang tidak ada tuhan yang berhak disembah selain Dia, tidak ada jalan di dataran maupun perbukitan baik sempit maupun luas kacuali dijaga oleh Malaikat dengan pedang terhunus sampai hari Qiyamat, dan Dajjal tidak akan dapat masuk menemui penduduknya.\" [Amir] berkata, \"Aku lalu bertemu dengan [Al Muharrar bin Abu Hurairah], lalu aku ceritakan kepadanya hadits Fatimah binti Qais hingga ia pun berkata, \"Aku bersaksi atas [bapakku], bahwa dia telah menceritakan kepadaku sebagaimana Fatimah telah menceritakan kepadamu, hanya saja bapakku berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dia (Dajjal) akan muncul dari arah timur.\" Amir berkata, \"Kemudian aku bertemu dengan [Al Qasim bin Muhammad] kemudian aku menceritakan kepadanya hadits Fatimah dan dia berkata, \"Aku bersaksi atas ['Aisyah] bahwa dia telah menceritakan kepadaku sebagaimana Fatimah telah menceritakan kepadamu, hanya saja 'Aisyah menyebutkan, \"Dua tanah haram, yaitu Makkah dan Madinah.\""
            },
            {
                "number": 3941,
                "arab": "حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ سَلَمَةَ عَنْ دَاوُدَ يَعْنِي ابْنَ أَبِي هِنْدٍ عَنِ الشَّعْبِيِّ عَنْ فَاطِمَةَ بِنْتِ قَيْسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَاءَ ذَاتَ يَوْمٍ مُسْرِعًا فَصَعِدَ الْمِنْبَرَ وَنُودِيَ فِي النَّاسِ الصَّلَاةُ جَامِعَةٌ فَاجْتَمَعَ النَّاسُ فَقَالَ يَا أَيُّهَا النَّاسُ إِنِّي لَمْ أَدْعُكُمْ لِرَغْبَةٍ نَزَلَتْ وَلَا لِرَهْبَةٍ وَلَكِنَّ تَمِيمًا الدَّارِيَّ أَخْبَرَنِي أَنَّ نَفَرًا مِنْ أَهْلِ فِلَسْطِينَ رَكِبُوا الْبَحْرَ فَقَذَفَتْهُمْ الرِّيحُ إِلَى جَزِيرَةٍ مِنْ جَزَائِرِ الْبَحْرِ فَإِذَا هُمْ بِدَابَّةٍ أَشْعَرَ مَا يُدْرَى أَذَكَرٌ هُوَ أَمْ أُنْثَى لِكَثْرَةِ شَعْرِهِ قَالُوا مَنْ أَنْتَ فَقَالَتْ أَنَا الْجَسَّاسَةُ فَقَالُوا فَأَخْبِرِينَا فَقَالَتْ مَا أَنَا بِمُخْبِرَتِكُمْ وَلَا مُسْتَخْبِرَتِكُمْ وَلَكِنْ فِي هَذَا الدَّيْرِ رَجُلٌ فَقِيرٌ إِلَى أَنْ يُخْبِرَكُمْ وَإِلَى أَنْ يَسْتَخْبِرَكُمْ فَدَخَلُوا الدَّيْرَ فَإِذَا رَجُلٌ أَعْوَرُ مُصَفَّدٌ فِي الْحَدِيدِ فَقَالَ مَنْ أَنْتُمْ قُلْنَا نَحْنُ الْعَرَبُ فَقَالَ هَلْ بُعِثَ فِيكُمْ النَّبِيُّ قَالُوا نَعَمْ قَالَ فَهَلْ اتَّبَعَتْهُ الْعَرَبُ قَالُوا نَعَمْ قَالَ ذَلِكَ خَيْرٌ لَهُمْ قَالَ مَا فَعَلَتْ فَارِسُ هَلْ ظَهَرَ عَلَيْهَا قَالُوا لَمْ يَظْهَرْ عَلَيْهَا بَعْدُ فَقَالَ أَمَا إِنَّهُ سَيَظْهَرُ عَلَيْهَا ثُمَّ قَالَ مَا فَعَلَتْ عَيْنُ زُغَرَ قَالُوا هِيَ تَدْفُقُ مَلْأَى قَالَ فَمَا فَعَلَ نَخْلُ بَيْسَانَ هَلْ أَطْعَمَ قَالُوا قَدْ أَطْعَمَ أَوَائِلُهُ قَالَ فَوَثَبَ وَثْبَةً حَتَّى ظَنَنَّا أَنَّهُ سَيَفْلِتُ فَقُلْنَا مَنْ أَنْتَ قَالَ أَنَا الدَّجَّالُ أَمَا إِنِّي سَأَطَأُ الْأَرْضَ كُلَّهَا غَيْرَ مَكَّةَ وَطَيْبَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبْشِرُوا يَا مَعْشَرَ الْمُسْلِمِينَ هَذِهِ طَيْبَةُ لَا يَدْخُلُهَا يَعْنِي الدَّجَّالَ",
                "id": "Telah menceritakan kepada kami [Yunus bin Muhammad] berkata, telah menceritakan kepada kami [Hammad] -yakni Ibnu Salamah- dari [Daud] -yakni Ibnu Abu Hindi- dari [As Sya'bi] dari [Fatimah binti Qais], bahwa suatu hari Rasulullah shallallahu 'alaihi wasallam datang dengan tergesa-gesa, kemudian beliau naik minbar dan diserukan kepada manusia 'Hendaklah sholat berjamaah'. Orang-orang pun berkumpul, lantas beliau bersabda: \"Wahai sekalian manusia, sesungguhnya aku menyeru kalian bukan karena ada perkara yang mengejutkan atau menyenangkan, akan tetapi Tamim Ad-Dari telah mengabarkan kepadaku bahwa sekelompok penduduk Palestina berlayar di tengah laut, kemudian mereka diombang-ambingkan oleh angin hingga terdampat disebuah pulau dari beberapa pulau di tengah laut. Tiba-tiba ia dikejutkan oleh seekor binatang yang berambut gondrong, tidak diketahui laki-laki ataukah perempuan, disebabkan rambutnya yang terlalu lebat, mereka bertanya, 'Siapakah kamu? ' Ia (binatang) menjawab, 'Aku adalah Jassasah, ' mereka bertanya lagi, 'Mahukah kamu bercerita kepada kami? ' dia menjawab, 'Aku bukanlah orang yang bercerita dan bukan pula yang meminta cerita kepada kalian, akan tetapi pergilah ke tempat peribadatan ini kalian akan menemui seorang laki-laki yang fakir, dia akan bercerita dan meminta cerita kepada kalian.' Lalu mereka memasuki biara, dan ternyata di sana ada seorang laki-laki buta telah terantai dengan besi, dia berkata, 'Siapa kalian? ' kami berkata, 'Kami dari penduduk Arab.' Dia berkata, 'Apakah di antara kalian telah diutus seorang Nabi? ' mereka menjawab, 'Ya.' Dia bertanya lagi, 'Apakah orang-orang Arab mengikutinya? ' mereka menjawab, 'Ya.' Dia lalu berkata, 'Itu lebih baik buat mereka.' Dia bertanya lagi, 'Apa yang diperbuat orang-orang Persia? Apakah dia (Nabi) Telah mengalahkannya? ' Mereka menjawab, 'Dia tidak akan mampu mengalahkannya.' Laki-laki itu pun berkata, 'Sesungguhnya dia (nabi) akan mengalahkannya (menguasainya).' Kemudian dia bertanya lagi, 'Apa yang terjadi dengan mata air Zughar? ' Mereka menjawab, 'Ia penuh dengan air'. Dia bertanya lagi, 'Apa yang terjadi dengan Kurma Baisan? Apakah ia memberikan kecukupan makanan? ' Mereka menjawab, 'Sungguh ia telah memberikan kecukupan makanan untuk penduduknya', tiba-tiba ia melompat dengan sekali lompatan, kami mengira dia akan lepas.' Lantas kami bertanya, 'Siapakah kamu? ' Dia menjawab, 'Aku adalah Dajjal, dan sesungguhnya aku akan melalui bumi semuanya selain Makkah dan Thayyibah.' Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Aku sampaikan kabar gembira untuk kalian wahai kaum Muslimin, inilah Thayibah yang dia tidak akan memasukinya yakni Dajjal.\""
            },
            {
                "number": 3942,
                "arab": "حَدَّثَنَا أَبُو عَاصِمٍ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ عَنِ الْقَاسِمِ بْنِ غَنَّامٍ عَنْ عَمَّاتِهِ عَنْ أُمِّ فَرْوَةَ قَالَتْسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْأَعْمَالِ أَفْضَلُ قَالَ الصَّلَاةُ لِأَوَّلِ وَقْتِهَا",
                "id": "Telah menceritakan kepada kami [Abu Ashim] berkata, telah mengabarkan kepada kami [Abdullah bin Umar] dari [Qasim bin Ghannam] dari [bibinya] dari [Ummu Farwah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam ditanya apakah amalan yang paling utama? Beliau menjawab: \"sholat di awal waktu.\""
            },
            {
                "number": 3943,
                "arab": "حَدَّثَنَا الْخُزَاعِيُّ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ الْعُمَرِيُّ عَنِ الْقَاسِمِ بْنِ غَنَّامٍ عَنْ جَدَّتِهِ الدُّنْيَا عَنْ أُمِّ فَرْوَةَ وَكَانَتْ قَدْ بَايَعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَفْضَلِ الْعَمَلِ فَقَالَ الصَّلَاةُ لِأَوَّلِ وَقْتِهَا",
                "id": "Telah menceritakan kepada kami [Al Khuza'i] telah mengabarkan kepada kami [Abdullah bin Umar Al Umari] dari [Al Qasim bin Ghannam] dari neneknya [Ad Dunya] dari [Ummu Farwah] dan dia telah membai'at Rasulullah shallallahu 'alaihi wasallam, dia berkata, \"Rasulullah shallallahu 'alaihi wasallam ditanya mengenai amalan yang paling utama, maka beliau bersabda: \"sholat di awal waktu.\""
            },
            {
                "number": 3944,
                "arab": "حَدَّثَنَا يُونُسُ قَالَ حَدَّثَنَا لَيْثٌ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ بْنِ حَفْصِ بْنِ عَاصِمِ بْنِ عُمَرَ بْنِ الْخَطَّابِ عَنِ الْقَاسِمِ بْنِ غَنَّامٍ عَنْ جَدَّتِهِ أُمِّ أَبِيهِ الدُّنْيَا عَنْ جَدَّتِهِ أُمِّ فَرْوَةَ وَكَانَتْ مِمَّنْ بَايَعَ أَنَّهاسَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَكَرَ الْأَعْمَالَ فَقَالَ أَحَبُّ الْعَمَلِ إِلَى اللَّهِ عَزَّ وَجَلَّ تَعْجِيلُ الصَّلَاةِ لِأَوَّلِ وَقْتِهَا",
                "id": "Telah menceritakan kepada kami [Yunus] berkata, telah menceritakan kepada kami [Laits] dari [ubaidhullah bin Umar bin Hafsh bin Ashim bin Umar bin Khatthab] dari [Qasim bin Ghannam] dari [neneknya] ibu ayahnya, Ad Dunya, dari neneknya [Ummu Farwah] dan dia adalah wanita yang ikut berbaiat, bahwa dirinya mendengar Rasulullah shallallahu 'alaihi wasallam menyebutkan amalan-amalan, maka beliau bersabda: \"Amalan yang paling dicintai Allah Azza Wa Jalla adalah mendahulukan sholat di awal waktu.\""
            },
            {
                "number": 3945,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامٍ قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ مَعْقِلِ بْنِ أُمِّ مَعْقِلٍ الْأَسَدِيَّةِ قَالَأَرَادَتْ أُمِّي الْحَجَّ وَكَانَ جَمَلُهَا أَعْجَفَ فَذَكَرَتْ ذَلِكَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ اعْتَمِرِي فِي رَمَضَانَ فَإِنَّ عُمْرَةً فِي رَمَضَانَ كَحَجَّةٍ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Hisyam] berkata, telah menceritakan kepadaku [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Ma'qil bin Ummu Ma'qil Al Asadiyah] dia berkata, \"Ibuku ingin melaksanakan haji sedangkan untanya kurus, lalu dia menceritakan hal itu kepada Nabi shallallahu 'alaihi wasallam, lantas beliau pun bersabda: \"Umrahlah pada bulan Ramadan karena Umrah pada bulan Ramadan seperti haji.\""
            },
            {
                "number": 3946,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ قَالَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُهَاجِرٍ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ قَالَ أَخْبَرَنِي رَسُولُ مَرْوَانَ الَّذِي أُرْسِلَ إِلَى أُمِّ مَعْقِلٍ قَالَقَالَتْ جَاءَ أَبُو مَعْقِلٍ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَاجًّا فَلَمَّا قَدِمَ أَبُو مَعْقِلٍ قَالَ قَالَتْ أُمُّ مَعْقِلٍ قَدْ عَلِمْتُ أَنَّ عَلَيَّ حَجَّةً وَأَنَّ عِنْدَكَ بَكْرًا فَأَعْطِنِي فَلْأَحُجَّ عَلَيْهِ قَالَ فَقَالَ لَهَا إِنَّكِ قَدْ عَلِمْتِ أَنِّي قَدْ جَعَلْتُهُ فِي سَبِيلِ اللَّهِ قَالَتْ فَأَعْطِنِي صِرَامَ نَخْلِكَ قَالَ قَدْ عَلِمْتِ أَنَّهُ قُوتُ أَهْلِي قَالَتْ فَإِنِّي مُكَلِّمَةٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذَاكِرَتُهُ لَهُ قَالَ فَانْطَلَقَا يَمْشِيَانِ حَتَّى دَخَلَا عَلَيْهِ قَالَ فَقَالَتْ لَهُ يَا رَسُولَ اللَّهِ إِنَّ عَلَيَّ حَجَّةً وَإِنَّ لِأَبِي مَعْقِلٍ بَكْرًا قَالَ أَبُو مَعْقِلٍ صَدَقَتْ جَعَلْتُهُ فِي سَبِيلِ اللَّهِ قَالَ أَعْطِهَا فَلْتَحُجَّ عَلَيْهِ فَإِنَّهُ فِي سَبِيلِ اللَّهِ قَالَ فَلَمَّا أَعْطَاهَا الْبَكْرَ قَالَتْ يَا رَسُولَ اللَّهِ إِنِّي امْرَأَةٌ قَدْ كَبِرْتُ وَسَقِمْتُ فَهَلْ مِنْ عَمَلٍ يُجْزِئُ عَنِّي عَنْ حَجَّتِي قَالَ فَقَالَ عُمْرَةٌ فِي رَمَضَانَ تُجْزِئُ لِحَجَّتِكِ",
                "id": "Telah menceritakan kepada kami [Affan] berkata, telah menceritakan kepada kami [Abu Awanah] berkata, telah menceritakan kepada kami [Ibrahim bin Muhajir] dari [Abu Bakar bin Abdurrahman bin Al Harits bin Hisyam] berkata, telah mengabarkan kepadaku [utusannya] Marwan yang diutus untuk menemui [Ummu Ma'qil], dia berkata, \"Ummu Ma'qil berkata, \"Abu Ma'qil datang bersama Rasulullah shallallahu 'alaihi wasallam untuk berhaji, tatkala Abu Ma'qil datang, utusan Marwan berkata, \"Ummu Ma'qil berkata, \"Sungguh aku tahu bahwa aku berkewajiban untuk berhaji, sesungguhnya kamu memliki seekor unta yang masih muda, maka berikanlah kepadaku supaya aku bisa berhaji.\" Utusan itu berkata, \"Maka Abu Ma'qil berkata kepadanya, \"Sesungguhnya kamu telah mengetahui bahwasannya ia dijadikan sebagai penopang keluargaku.\" Ummu Ma'qil berkata, \"Kemudian aku berbicara kepada Rasulullah shallallahu 'alaihi wasallam untuk mengadukan kepada beliau, lalu utusan itu berkata, \"Maka keduanya pergi berjalan kaki sampai menemui beliau.\" Utusan itu berkata, \"Maka Ummu Salamah berkata kepada beliau, 'Wahai Rasulullah, sesungguhnya aku berkewajiban menunaikan ibadah haji, sedangkan Abu Ma'qil memiliki seekor unta yang masih muda.\" Abu Ma'qil berkata, \"Dia benar, akan tetapi ia telah aku sedekahkan untuk di jalan Allah.\" Beliau bersabda: \"Berikanlah kepadanya agar dia bisa menunaikan hajinya, karena ia juga di jalan Allah.\" Utusan itu berkata, \"Tatkala untanya dikasihkan kepadanya, maka Ummu Ma'qil berkata, 'Wahai Rasulullah, sesungguhnya aku adalah wanita yang sudah lanjut usia dan lemah, apakah ada amalan yang bisa menggantikanku dari ibadah haji? ' Beliau bersabda: \"Umrah pada bulan Ramadan, itu yang bisa menyamai pahala hajimu.\""
            },
            {
                "number": 3947,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى قَالَ أَخْبَرَنِي ابْنُ لَهِيعَةَ عَنْ بُكَيْرٍ عَنْ بُسْرِ بْنِ سَعِيدٍ عَنْ أُبَيِّ بْنِ كَعْبٍ قَالَنَازَعَنِي عُمَرُ بْنُ الْخَطَّابِ فِي الْمُتَوَفَّى عَنْهَا زَوْجُهَا وَهِيَ حَامِلٌ فَقُلْتُ تُزَوَّجُ إِذَا وَضَعَتْ فَقَالَتْ أُمُّ الطُّفَيْلِ أُمُّ وَلَدِي لِعُمَرَ وَلِي قَدْ أَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُبَيْعَةَ الْأَسْلَمِيَّةَ أَنْ تَنْكِحَ إِذَا وَضَعَتْ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Isa] dia berkata, telah mengabarkan kepadaku [Ibnu Lahi'ah] dari [Bukair] dari [Busr bin Sa'id] dari [Ubay bin Ka'ab] dia berkata, \"Umar bin Khattab berselisih denganku tentang isteri yang ditinggal mati suaminya dalam keadaan hamil. Aku berpendapat, \"Dia boleh dinikahi jika telah melahirkan.\" Lantas [Ummu Thufail], ibu anaku, berkata kepadaku dan kepada Umar, \"Rasulullah shallallahu 'alaihi wasallam telah menyuruh Syubai'ah Al Aslamiyah agar dia menikah jika telah melahirkan.\""
            },
            {
                "number": 3948,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالَا حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ بُكَيْرِ بْنِ عَبْدِ اللَّهِ بْنِ الْأَشَجِّ عَنْ بُسْرِ بْنِ سَعِيدٍ قَالَ سَمِعْتُ أُمَّ الطُّفَيْلِ قَالَ قُتَيْبَةُ امْرَأَةُ أُبَيِّ بْنِ كَعْبٍأَنَّهَا سَمِعَتْ عُمَرَ بْنَ الْخَطَّابِ وَأُبَيَّ بْنَ كَعْبٍ يَخْتَصِمَانِ فَقَالَتْ أُمُّ الطُّفَيْلِ أَفَلَا يَسْأَلُ عُمَرُ بْنُ الْخَطَّابِ سُبَيْعَةَ الْأَسْلَمِيَّةَ تُوُفِّيَ عَنْهَا زَوْجُهَا وَهِيَ حَامِلٌ فَوَضَعَتْ بَعْدَ ذَلِكَ بِأَيَّامٍ فَأَنْكَحَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ishaq] dan [Qutaibah bin Sa'id] keduanya berkata, telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Bukair bin 'Abdullah bin Al Asyaj] dari [Busr bin Sa'id] dia berkata, aku mendengar [Ummu Thufail], Qutaibah isterinya Ubay bin Ka'b, mengatakan bahwa dia mendengar Umar bin Khatthab dan Ubay bin Ka'b sedang berselisih, maka Ummu Thufail berkata, \"Kenapa Umar bin Khatthab bertanya langsung kepada Subai'ah Al Aslamiyah?\" Dia telah ditinggal mati oleh suaminya dalam konsidi mengandung dan melahirkan anaknya setelah beberapa hari, lalu Rasulullah shallallahu 'alaihi wasallam menikahkannya.\""
            },
            {
                "number": 3949,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ حَدَّثَنَا الْحَجَّاجُ بْنُ أَرْطَاةَ عَنْ أَبِي يَزِيدَ مَوْلَى عَبْدِ اللَّهِ بْنِ الْحَارِثِ عَنْ أُمِّ جُنْدُبٍ الْأَزْدِيَّةِ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّهَا النَّاسُ لَا تَقْتُلُوا أَنْفُسَكُمْ عِنْدَ جَمْرَةِ الْعَقَبَةِ وَعَلَيْكُمْ بِمِثْلِ حَصَى الْخَذْفِ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] dia berkata, telah menceritakan kepada kami [Hajjaj bin Arthah] dari [Abu Yazid] bekas budak 'Abdullah bin Harits, dari [Ummu Jundub Al Azdiyah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hai manusia, janganlah kalian bunuh diri kalian ketika Jumrah 'Aqabah, dan lemparlah dengan kerikil di antara dua jari.\""
            },
            {
                "number": 3950,
                "arab": "حَدَّثَنَا هُشَيْمٌ قَالَ أَخْبَرَنَا لَيْثٌ عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ عَنْ أُمِّ جُنْدُبٍ الْأَزْدِيَّةِ أَنَّهَاسَمِعَتْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَيْثُ أَفَاضَ قَالَ يَا أَيُّهَا النَّاسُ عَلَيْكُمْ بِالسَّكِينَةِ وَالْوَقَارِ وَعَلَيْكُمْ بِمِثْلِ حَصَى الْخَذْفِ",
                "id": "Telah menceritakan kepada kami [Husyaim] dia berkata, telah mengabarkan kepada kami [Laits] dari ['Abdullah bin Syaddad] dari [Ummu Jundub Al Azdiyah] bahwa dia mendengar Nabi shallallahu 'alaihi wasallam sewaktu ifadlah, beliau bersabda: \"Wahai sekalian manusia, hendaklah kalian tetap tenang, dan lemparlah dengan kerikil di antara dua jari.\""
            },
            {
                "number": 3951,
                "arab": "حَدَّثَنَا سُفْيَانُ قَالَيَا أَيُّهَا النَّاسُ لَا يَقْتُلْ بَعْضُكُمْ بَعْضًا إِذَا رَمَيْتُمْ الْجَمْرَةَ فَارْمُوهَا بِمِثْلِ حَصَى الْخَذْفِقَالَ أَبِي وَقُرِئَ عَلَيْهِ يَزِيدُ يَعْنِي ابْنَ أَبِي زِيَادٍ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ عَنْ أُمِّهِ يَعْنِي عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Sufyan] dia berkata, \"Wahai sekalian manusia, sebagian kalian membunuh sebagian yang lain ketika melempar Jumrah 'Aqabah, dan lemparlah dengan kerikil di antara dua jari.\" ayahku berkata, dan telah dibacakan kepadanya oleh [Yazid] -yakni Ibnu Abu Ziyad- dari [Sulaiman bin 'Amru bin Al Ahwash] dari [ibunya], yakni dari Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 3952,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ قَالَ حَدَّثَنَا عُثْمَانُ يَعْنِي ابْنَ حَكِيمٍ قَالَ حَدَّثَنِي عَمْرُو الْأَنْصَارِيُّ عَنْ أُمِّ سُلَيْمٍ بِنْتِ مِلْحَانَ وَهِيَ أُمُّ أَنَسِ بْنِ مَالِكٍ أَنَّهَاسَمِعَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ امْرَأَيْنِ مُسْلِمَيْنِ يَمُوتُ لَهُمَا ثَلَاثَةُ أَوْلَادٍ لَمْ يَبْلُغُوا الْحِنْثَ إِلَّا أَدْخَلَهُمْ اللَّهُ الْجَنَّةَ بِفَضْلِ اللَّهِ وَرَحْمَتِهِ إِيَّاهُمْ",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] dia berkata, telah menceritakan kepada kami ['Utsman] -yakni Ibnu Hakim- dia berkata, telah menceritakan kepadaku ['Amru Al Anshari] dari [Ummu Sulaim binti Milhan] dia adalah ibu Anas bin Malik, bahwa dia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah dua orang muslim yang ditinggal mati oleh tiga anaknya yang belum baligh, kecuali Allah akan memasukkan mereka ke dalam surga dengan keutamaan Allah dan rahmat-Nya kepada mereka.\""
            },
            {
                "number": 3953,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ قَالَ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ عَمْرٍو قَالَ حَدَّثَنَا أَبُو سَلَمَةَ عَنْ أُمِّ سُلَيْمٍ قَالَتْدَخَلْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِ أُمِّ سَلَمَةَ فَقَالَتْ يَا رَسُولَ اللَّهِ أَرَأَيْتَكَ الْمَرْأَةَ تَرَى فِي مَنَامِهَا مَا يَرَى الرَّجُلُ قَالَتْ أُمُّ سَلَمَةَ فَضَحْتِ النِّسَاءَ قَالَتْ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَا يَسْتَحْيِي مِنْ الْحَقِّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ رَأَى ذَلِكَ مِنْكُنَّ فَلْتَغْتَسِلْ",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] dia berkata, telah menceritakan kepada kami [Muhammad] -yakni Ibnu 'Amru- dia berkata, telah menceritakan kepada kami [Abu Salamah] dari [Ummu Sulaim] dia berkata, \"Aku menemui Rasulullah shallallahu 'alaihi wasallam di rumah Ummu Salamah, dia berkata, \"Wahai Rasulullah, bagaimana jika wanita bermimpi seperti apa yang dimimpikan lelaki?\" Ummu Salamah berkata, \"Kamu telah membuka aib wanita.\" Ummu Sulaim berkata, \"Sesungguhnya Allah Azza wa Jalla tidak malu kepada kebenaran.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Jika salah seorang dari kalian bermimpi seperti itu maka mandilah.\""
            },
            {
                "number": 3954,
                "arab": "حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الرُّؤَاسِيُّ قَالَ حَدَّثَنَا زُهَيْرٌ عَنْ عَبْدِ الْكَرِيمِ عَنِ الْبَرَاءِ ابْنِ ابْنَةِ أَنَسٍ وَهُوَ ابْنُ زَيْدٍ عَنْ أَنَسٍ قَالَ حَدَّثَتْنِي أُمِّيأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَخَلَ عَلَيْهَا وَفِي بَيْتِهَا قِرْبَةٌ مُعَلَّقَةٌ قَالَتْ فَشَرِبَ مِنْ الْقِرْبَةِ قَائِمًا قَالَتْ فَعَمَدْتُ إِلَى فَمِ الْقِرْبَةِ فَقَطَعْتُهَا",
                "id": "Telah menceritakan kepada kami [Humaid bin 'Abdurrahman Ar Ru'asi] dia berkata, telah menceritakan kepada kami [Zuhair] dari ['Abdul Karim] dari [Barra'] anak dari anak perempuan Anas, dia adalah anak laki-lakinya Zaid, dari [Anas] dia berkata, telah menceritakan kepadaku [ibuku], bahwa Rasulullah shallallahu 'alaihi wasallam menemuinya sedangkan di rumahnya ada kantung air yang digantung, lalu beliau minum dari kantung tersebut dengan berdiri.\" Ummu Anas berkata, \"Lalu aku meraih mulut kantung itu dan memotongnya.\""
            },
            {
                "number": 3955,
                "arab": "حَدَّثَنَا حَسَنٌ يَعْنِي ابْنَ مُوسَى قَالَ حَدَّثَنَا زُهَيْرٌ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أُمِّ سُلَيْمٍأَنَّهَا كَانَتْ مَعَ نِسَاءِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُنَّ يَسُوقُ بِهِنَّ سَوَّاقٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيْ أَنْجَشَةُ رُوَيْدَكَ سَوْقَكَ بِالْقَوَارِيرِ",
                "id": "Telah menceritakan kepada kami [Hasan] -yakni Ibnu Musa- dia berkata, telah menceritakan kepada kami [Zuhair] dari [Sulaiman At Taimi] dari [Anas bin Malik] dari [Ummu Sulaim], bahwa dia pernah bersama dengan isteri-isteri Nabi shallallahu 'alaihi wasallam (dalam sekedup), yang ditutun oleh para penuntun (unta yang di atasnya di pasang sekedup). Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai Anjasyah, pelanlah kamu (membawa mereka) sebagaimana kamu membawa bejana dari kaca.\""
            },
            {
                "number": 3956,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أُمِّ سُلَيْمٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَأْتِيهَا فَيَقِيلُ عِنْدَهَا فَتَبْسُطُ لَهُ نِطَعًا فَيَقِيلُ عِنْدَهَا وَكَانَ كَثِيرَ الْعَرَقِ فَتَجْمَعُ عَرَقَهُ فَتَجْعَلُهُ فِي الطِّيبِ وَالْقَوَارِيرِ قَالَتْ وَكَانَ يُصَلِّي عَلَى الْخُمْرَةِ",
                "id": "Telah menceritakan kepada kami ['Affan] dia berkata, telah menceritakan kepada kami [Wuhaib] dia berkata, telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dari [Anas bin Malik] dari [Ummu Sulaim] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau berkunjung ke rumahnya dan berniat (menumpang untuk) tidur siang di sana. Ummu Sulaim lalu menghamparkan tikar untuk beliau, lantas beliau pun tidur di atasnya. Beliau banyak mengeluarkan keringat, maka Ummu Sulaim pun mengumpulkannya dalam botol untuk minyak wangi.\" Ummu Sulaim berkata, \"Kemudian beliau sholat di atas tikar kecil.\""
            },
            {
                "number": 3957,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ قَالَ حَدَّثَنَا الْأَوْزَاعِيُّ قَالَ حَدَّثَنِي إِسْحَاقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ الْأَنْصَارِيُّ عَنْ جَدَّتِهِ أُمِّ سُلَيْمٍ قَالَتْكَانَتْ مُجَاوِرَةَ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَتْ تَدْخُلُ عَلَيْهَا فَدَخَلَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ أُمُّ سُلَيْمٍ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِذَا رَأَتْ الْمَرْأَةُ أَنَّ زَوْجَهَا يُجَامِعُهَا فِي الْمَنَامِ أَتَغْتَسِلُ فَقَالَتْ أُمُّ سَلَمَةَ تَرِبَتْ يَدَاكِ يَا أُمَّ سُلَيْمٍ فَضَحْتِ النِّسَاءَ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَتْ أُمُّ سُلَيْمٍ إِنَّ اللَّهَ لَا يَسْتَحِي مِنْ الْحَقِّ وَإِنَّا إِنْ نَسْأَلْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَمَّا أَشْكَلَ عَلَيْنَا خَيْرٌ مِنْ أَنْ نَكُونَ مِنْهُ عَلَى عَمْيَاءَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِأُمِّ سَلَمَةَ بَلْ أَنْتِ تَرِبَتْ يَدَاكِ نَعَمْ يَا أُمَّ سُلَيْمٍ عَلَيْهَا الْغُسْلُ إِذَا وَجَدَتْ الْمَاءَ فَقَالَتْ أُمُّ سَلَمَةَ يَا رَسُولَ اللَّهِ وَهَلْ لِلْمَرْأَةِ مَاءٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَنَّى يُشْبِهُهَا وَلَدُهَا هُنَّ شَقَائِقُ الرِّجَالِ",
                "id": "Telah menceritakan kepada kami [Abu Mughirah] dia berkata, telah menceritakan kepada kami [Al Auza'i] dia berkata, telah menceritakan kepadaku [Ishaq bin 'Abdullah bin Abu Thalhah Al Anshari] dari neneknya [Ummu Sulaim] dia mengatakan, bahwa dia bertetangga dengan Ummu Salamah, isteri Nabi shallallahu 'alaihi wasallam, dia pernah masuk manemuinya, setelah itu Nabi shallallahu 'alaihi wasallam masuk.\" Ummu Sulaim berkata, \"Wahai Rasulullah, bagaimana pendapatmu jika seorang isteri bermimpi bahwa suaminya telah menggaulinya? Apakah ia wajib mandi?\" Ummu Salamah berkata, \"celaka kamu wahai Ummu Sulaim, kamu telah membuka aib seorang wanita di hadapan Rasulullah shallallahu 'alaihi wasallam.\" Ummu Sulaim pun berkata, \"Sesungguhnya Allah tidak malu dari kebenaran, dan lebih baik kita bertanya kepada Nabi shallallahu 'alaihi wasallam tentang suatu hal yang masih rancu daripada kita dalam ketidaktahuan.\" Maka Nabi shallallahu 'alaihi wasallam bersabda kepada Ummu Salamah: \"Justru kamulah yang celaka wahai wahai Ummu Sulaim, ia wajib mandi jika mendapati cairan.\" Maka Ummu Salamah berkata, \"Wahai Rasulullah, apakah seorang wanita juga memiliki cairan?\" Lantas Nabi shallallahu 'alaihi wasallam menjawab: \"(Jika tidak) lalu dari mana seorang anak bisa menyerupai ibunya, wanita adalah saudara laki-laki.\""
            },
            {
                "number": 3958,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي قِلَابَةَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ أُمِّ سُلَيْمٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي عَلَى الْخُمْرَةِ",
                "id": "Telah menceritakan kepada kami ['Affan] telah menceritakan kepada kami [Wuhaib] dia berkata, telah menceritakan kepada kami [Ayyub] dari [Abu Qilabah] dari [Anas bin Malik] dari [Ummu Sulaim] bahwa Rasulullah shallallahu 'alaihi wasallam sholat di atas tikar kecil.\""
            },
            {
                "number": 3959,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ قَالَ حَدَّثَنَا ابْنُ لَهِيعَةَ قَالَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنِ الْحَارِثِ بْنِ يَعْقُوبَ عَنْ يَعْقُوبَ بْنِ الْأَشَجِّ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ سَعْدٍ عَنْ خَوْلَةَ قَالَتْسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ نَزَلَ مَنْزِلًا فَقَالَ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ شَرِّ مَا خَلَقَ لَمْ يَضُرَّهُ شَيْءٌ حَتَّى يَظْعَنَ مِنْهُحَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ قَالَ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ يَعْقُوبَ بْنِ الْأَشَجِّ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ سَعْدٍ عَنْ خَوْلَةَ قَالَتْ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ishaq] dia berkata, telah menceritakan kepada kami [Ibnu Lahi'ah] dia berkata, telah menceritakan kepada kami [Yazid bin Abu Habib] dari [Harits bin Ya'qub] dari [Ya'qub bin Al Asyaj] dari ['Amir bin Sa'ad] dari [Sa'd] dari [Khaulah] dia berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa singgah di suatu tempat lalu ia mengatakan A'UUDZU BIKALIMAATILLAHIT TAAMMAH MIN SYARRI MAA KHALAQ (Aku berlindung dengan kalimat-kalimat Allah dari keburukan yang Dia ciptakan) ', maka ia tidak akan diganggu sesuatu pun hingga ia pergi darinya.\" Telah menceritakan kepada kami [Yahya bin Ishaq] dia berkata, telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Ja'far bin Rabi'ah] dari [Ya'qub bin Asyaj] dari ['Amir bin Sa'd] dari [Sa'd] dari [Khaulah] dia berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda seperti itu.\""
            },
            {
                "number": 3960,
                "arab": "حَدَّثَنَا حَجَّاجٌ قَالَ أَخْبَرَنَا لَيْثٌ قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ عَنِ الْحَارِثِ عَنْ يَعْقُوبَ بْنِ عَبْدِ اللَّهِ حَدَّثَهُ أَنَّهُ سَمِعَ بُسْرَ بْنَ سَعِيدٍ يَقُولُ سَمِعْتُ سَعْدَ بْنَ أَبِي وَقَّاصٍ يَقُولُ سَمِعْتُ خَوْلَةَ بِنْتَ حَكِيمٍ السُّلَمِيَّةَ تَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ نَزَلَ مَنْزِلًا ثُمَّ قَالَ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ كُلِّهَا مِنْ شَرِّ مَا خَلَقَ لَمْ يَضُرَّهُ شَيْءٌ حَتَّى يَرْتَحِلَ مِنْ مَنْزِلِهِ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Hajjaj] dia berkata, telah mengabarkan kepada kami [Laits] dia berkata, telah menceritakan kepadaku [Yazid bin Abu Habib] dari [Harits] dari [Ya'qub bin 'Abdullah] bahwa dia telah mengabarkan kepadanya, bahwa dia mendengar [Busr bin Sa'id] berkata, saya mendengar [Sa'd bin Abu Waqash] berkata, aku mendengar [Khaulah binti Hakim As Sulamiyah] dia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa singgah di suatu tempat kemudian dia mengucapkan A'UUDZU BIKALIMAATILLAHIT TAAMMAH KULLIHA MIN SYARRI MAA KHALAQ (Aku berlindung dengan kalimat-kalimat Allah yang sempurna semuanya dari keburukan yang Dia ciptakan) ', maka ia tidak akan diganggu sesuatu pun hingga ia pergi darinya.\""
            },
            {
                "number": 3961,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا حَجَّاجٌ عَنِ الرَّبِيعِ بْنِ مَالِكٍ عَنْ خَوْلَةَ بِنْتِ حَكِيمٍ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَزَلَ مَنْزِلًا فَقَالَ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ كُلِّهَا مِنْ شَرِّ مَا خَلَقَ لَمْ يَضُرَّهُ فِي مَنْزِلِهِ ذَلِكَ شَيْءٌ حَتَّى يَظْعَنَ عَنْهُ",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] dia berkata, telah menceritakan kepada kami [Hajjaj] dari [Ar Rabi' bin Malik] dari [Khaulah binti Hakim] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa singgah di suatu tempat kemudian dia mengucapkan A'UUDZU BIKALIMAATILLAHIT TAAMMAH KULLIHA MIN SYARRI MAA KHALAQ (Aku berlindung dengan kalimat-kalimat Allah yang sempurna semuanya dari keburukan yang Dia ciptakan) ', maka ia tidak akan diganggu sesuatupun hingga ia pergi darinya.\""
            },
            {
                "number": 3962,
                "arab": "حَدَّثَنَا هَاشِمٌ قَالَ حَدَّثَنَا لَيْثٌ قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ عَنْ عُبَيْدِ سَنُوطَا أَبِي الْوَلِيدِ قَالَ سَمِعْتُ خَوْلَةَ بِنْتَ قَيْسِ بْنِ قَهْدٍ وَكَانَتْ تَحْتَ حَمْزَةَ بْنِ عَبْدِ الْمُطَّلِبِ تَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ مَنْ أَصَابَهُ بِحَقِّهِ بُورِكَ لَهُ فِيهِ وَرُبَّ مُتَخَوِّضٍ فِيمَا شَاءَتْ نَفْسُهُ مِنْ مَالِ اللَّهِ وَرَسُولِهِ لَيْسَ لَهُ يَوْمَ الْقِيَامَةِ إِلَّا النَّارُ",
                "id": "Telah menceritakan kepada kami [Hasyim] dia berkata, telah menceritakan kepada kami [Laits] dia berkata, telah menceritakan kepadaku [Sa'id bin Abu Sa'id] dari ['Ubaid Sanuth Abu Al Walid] dia berkata, aku mendengar [Khaulah binti Qais bin Qahd] dan dia berada dalam pemeliharaan Hamzah bin 'Abdul Muthalib, dia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya harta ini hijau dan manis, barangsiapa mendapatkan dengan haknya maka ia akan diberkahi. Berapa banyak orang yang mengambil harta Allah dan rasul-Nya tanpa haknya sesuai keinginannya, pada hari kiamat nanti ia tidak memilikinya kecuali neraka.\""
            },
            {
                "number": 3963,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ قَالَ أَخْبَرَنَا ابْنُ لَهِيعَةَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنِ الْحَارِثِ بْنِ يَعْقُوبَ عَنْ يَعْقُوبَ بْنِ الْأَشَجِّ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ سَعْدٍ عَنْ خَوْلَةَ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ نَزَلَ مَنْزِلًا فَقَالَ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ لَمْ يَضُرَّهُ فِيهِ شَيْءٌ حَتَّى يَرْتَحِلَ مِنْهُحَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ قَالَ أَخْبَرَنَا ابْنُ لَهِيعَةَ عَنْ جَعْفَرِ بْنِ رَبِيعَةَ عَنْ يَعْقُوبَ بْنِ الْأَشَجِّ عَنْ عَامِرِ بْنِ سَعْدٍ عَنْ سَعْدٍ عَنْ خَوْلَةَ قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مِثْلَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ishaq] dia berkata, telah mengabarkan kepada kami [Ibnu Lahi'ah] dari [Yazid bin Abu Habib] dari [Al Harits bin Ya'qub] dari [Ya'qub bin Al Asyaj] dari ['Amir bin Sa'd] dari [Sa'd] dari [Khaulah] dia berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa singgah di suatu tempat, lalu ia mengatakan A'UUDZU BIKALIMAATILLAHIT TAMMAH MIN SYARRI MAA KHALAQ (Aku berlindung dengan kalimat-kalimat Allah dari keburukan yang Dia ciptakan) ', maka ia tidak akan diganggu sesuatupun hingga ia pergi darinya.\" Telah menceritakan kepada kami [Yahya bin Ishaq] dia berkata, telah mengabarkan kepada kami [Ibn Lahi'ah] dari [Ja'far bin Rabi'ah] dari [Ya'qub bin Asyaj] dari ['Amir bin Sa'd] dari [Sa'd] dari [Khaulah] dia berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda seperti itu.\""
            },
            {
                "number": 3964,
                "arab": "حَدَّثَنَا يَعْلَى بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ جَعْفَرِ بْنِ عَبْدِ الرَّحْمَنِ الْأَنْصَارِيِّ عَنْ أُمِّ طَارِقٍ مَوْلَاةِ سَعْدٍ قَالَتْجَاءَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى سَعْدٍ فَاسْتَأْذَنَ فَسَكَتَ سَعْدٌ ثُمَّ أَعَادَ فَسَكَتَ سَعْدٌ ثُمَّ عَادَ فَسَكَتَ سَعْدٌ فَانْصَرَفَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْ فَأَرْسَلَنِي إِلَيْهِ سَعْدٌ أَنَّهُ لَمْ يَمْنَعْنَا أَنْ نَأْذَنَ لَكَ إِلَّا أَنَّا أَرَدْنَا أَنْ تَزِيدَنَا قَالَتْ فَسَمِعْتُ صَوْتًا عَلَى الْبَابِ يَسْتَأْذِنُ وَلَا أَرَى شَيْئًا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَنْتِ قَالَتْ أُمُّ مِلْدَمٍ قَالَ لَا مَرْحَبًا بِكِ وَلَا أَهْلًا أَتُهْدِينَ إِلَى أَهْلِ قُبَا قَالَتْ نَعَمْ قَالَ فَاذْهَبِي إِلَيْهِمْ",
                "id": "Telah menceritakan kepada kami [Ya'la bin 'Ubaid] dia berkata, telah menceritakan kepada kami [Al A'masy] dari [Ja'far bin 'Abdurrahman Al Anshari] dari [Ummu Thariq] bekas budak Sa'd, dia berkata, \"Nabi datang kepada Sa'd, saat beliau mengucapkan salam Sa'd diam, lalu beliau mengulanginya dan Sa'd tetap diam, lalu beliau mengulanginya dan Sa'd pun tetap diam. Maka Nabi shallallahu 'alaihi wasallam pun beranjak pergi.\" Ummu Thariq berkata, \"Kemudian Sa'd mengutusku menemui beliau, dia mengatakan bahwa sebenarnya kami tidak melarang tuan untuk masuk, hanya saja kami berharap tuan akan memperbanyak (ucapan salam) kepada kami.\" Ummu Thariq melanjutkan, \"Lalu aku mendengar suara di pintu namun aku tidak melihat apapun, kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa kamu?\" dia menjawab, \"Ummu Mildam.\" Beliau bersabda: \"Tidak ada selamat datang untukmu, apakah kamu memberi hadiah kepada penduduk Quba'?\" Dia menjawab, \"Ya.\" Beliau pun bersabda: \"Pergilah kepada mereka.\""
            },
            {
                "number": 3965,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى وَعَفَّانُ قَالَا حَدَّثَنَا عَمْرُو بْنُ مَرْزُوقٍ قَالَ أَخْبَرَنِي يَحْيَى بْنُ عَبْدِ الْحَمِيدِ بْنِ رَافِعِ بْنِ خَدِيجٍ قَالَ أَخْبَرَتْنِي جَدَّتِي يَعْنِي امْرَأَةَ رَافِعِ بْنِ خَدِيجٍ قَالَ عَفَّانُ عَنْ جَدَّتِهِ أُمِّ أَبِيهِ امْرَأَةِ رَافِعِ بْنِ خَدِيجٍأَنَّ رَافِعًا رَمَى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ أُحُدٍ وَيَوْمَ خَيْبَرَ قَالَ أَنَا أَشُكُّ بِسَهْمٍ فِي ثَنْدُوَتِهِ فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ انْزِعْ السَّهْمَ قَالَ يَا رَافِعُ إِنْ شِئْتَ نَزَعْتُ السَّهْمَ وَالْقُطْبَةَ جَمِيعًا وَإِنْ شِئْتَ نَزَعْتُ السَّهْمَ وَتَرَكْتُ الْقُطْبَةَ وَشَهِدْتُ لَكَ يَوْمَ الْقِيَامَةِ أَنَّكَ شَهِيدٌ قَالَ يَا رَسُولَ اللَّهِ بَلْ انْزِعْ السَّهْمَ وَاتْرُكْ الْقُطْبَةَ وَاشْهَدْ لِي يَوْمَ الْقِيَامَةِ أَنِّي شَهِيدٌ قَالَ فَنَزَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السَّهْمَ وَتَرَكَ الْقُطْبَةَ",
                "id": "Telah menceritakan kepada kami [Hasan bin Musa] dan ['Affan] keduanya berkata, telah menceritakan kepada kami ['Amru bin Marzuq] dia berkata, telah mengabarkan kepadaku [Yahya bin 'Abdul Hamid bin Rafi' bin Khudaij] dia berkata, telah mengabarkan kepadaku nenekku [Isterinya Rafi' bin Hudaij], [Affan] berkata dari neneknya, yaitu ibnu bapaknya [Isteri Rafi' bin Khadij], bahwa Rafi' melempar bersama Rasulullah shallallahu 'alaihi wasallam ketika perang Uhud dan Khaibar.\" Rafi' berkata, \"Aku menusukkan panah di dadanya.\" Lalu dia mendatangi Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, lepaslah anak panahnya.\" Beliau bersabda: Wahai Rafi', jika kamu mau maka aku akan melepaskan anak dan mata panahnya sekaligus, dan jika engkau mau maka aku akan melepaskan anak panah dan aku tinggalkan mata panahnya, dan aku akan bersaksi untukmu hari kiamat bahwa kamu syahid.\" Rafi' berkata, \"Wahai Rasulullah, lepaslah anak panahnya dan tinggalkan mata panahnya, bersaksilah untukku pada hari kiamat bahwa aku syahid.\" Perawi berkata, \"Kemudian Rasulullah shallallahu 'alaihi wasallam melepaskan anak panah itu dan meninggalkan matanya.\""
            },
            {
                "number": 3966,
                "arab": "حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنِ ابْنِ إِسْحَاقَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ قَالَ سَمِعْتُ بُقَيْرَةَ امْرَأَةَ الْقَعْقَاعِ بْنِ أَبِي حَدْرَدٍ تَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ وَهُوَ يَقُولُ إِذَا سَمِعْتُمْ بِجَيْشٍ قَدْ خُسِفَ بِهِ قَرِيبًا فَقَدْ أَظَلَّتْ السَّاعَةُ",
                "id": "Telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Ibnu Ishaq] dari [Muhammad bin Ibrahim At Taimi] dia berkata, aku mendengar [Buqairah] isteri Qa'qa' bin Abu Hadrad dia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda di atas mimbar: \"Jika kalian mendengar ada tentara yang ditenggelamkan dekat kalian, maka hal itu menunjukkan bahwa kiamat telah dekat.\""
            },
            {
                "number": 3967,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الرَّازِيُّ قَالَ حَدَّثَنَا سَلَمَةُ بْنُ الْفَضْلِ قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ إِسْحَاقَ عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ عَنْ بُقَيْرَةَ امْرَأَةِ الْقَعْقَاعِ قَالَتْإِنِّي لَجَالِسَةٌ فِي صُفَّةِ النِّسَاءِ فَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ وَهُوَ يُشِيرُ بِيَدِهِ الْيُسْرَى فَقَالَ يَا أَيُّهَا النَّاسُ إِذَا سَمِعْتُمْ بِخَسْفٍ هَاهُنَا قَرِيبًا فَقَدْ أَظَلَّتْ السَّاعَةُ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Ibrahim Ar Razi] dia berkata, telah menceritakan kepada kami [Salamah bin Al Fadll] dia berkata, telah menceritakan kepadaku [Muhammad bin Ishaq] dari [Muhammad bin 'Amru bin 'Atha'] dari [Buqairah] isterinya Qa'qa', dia berkata, \"Sungguh, aku duduk di shafnya para wanita, maka aku mendengar Rasulullah shallallahu 'alaihi wasallam berkhutbah sambil mengisyaratkan dengan tangan kirinya, beliau katakan: \"Wahai sekalian manusia, jika kalian mendengar ada tentara yang ditenggelamkan dekat kalian, maka hal itu menunjukkan bahwa kiamat telah dekat.\""
            },
            {
                "number": 3968,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا يَزِيدُ بْنُ عَطَاءٍ عَنْ يَزِيدَ يَعْنِي ابْنَ أَبِي زِيَادٍ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ الْأَزْدِيِّ قَالَ حَدَّثَتْنِي أُمِّيأَنَّهَا رَأَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمِي جَمْرَةَ الْعَقَبَةِ مِنْ بَطْنِ الْوَادِي وَخَلْفَهُ إِنْسَانٌ يَسْتُرُهُ مِنْ النَّاسِ أَنْ يُصِيبُوهُ بِالْحِجَارَةِ وَهُوَ يَقُولُ أَيُّهَا النَّاسُ لَا يَقْتُلْ بَعْضُكُمْ بَعْضًا وَإِذَا رَمَيْتُمْ فَارْمُوا بِمِثْلِ حَصَى الْخَذْفِ ثُمَّ أَقْبَلَ فَأَتَتْهُ امْرَأَةٌ بِابْنٍ لَهَا فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنِي هَذَا ذَاهِبُ الْعَقْلِ فَادْعُ اللَّهَ لَهُ قَالَ لَهَا ائْتِينِي بِمَاءٍ فَأَتَتْهُ بِمَاءٍ فِي تَوْرٍ مِنْ حِجَارَةٍ فَتَفَلَ فِيهِ وَغَسَلَ وَجْهَهُ ثُمَّ دَعَا فِيهِ ثُمَّ قَالَ اذْهَبِي فَاغْسِلِيهِ بِهِ وَاسْتَشْفِي اللَّهَ عَزَّ وَجَلَّ فَقُلْتُ لَهَا هَبِي لِي مِنْهُ قَلِيلًا لِابْنِي هَذَا فَأَخَذْتُ مِنْهُ قَلِيلًا بِأَصَابِعِي فَمَسَحْتُ بِهَا شِقَّةَ ابْنِي فَكَانَ مِنْ أَبَرِّ النَّاسِ فَسَأَلْتُ الْمَرْأَةَ بَعْدُ مَا فَعَلَ ابْنُهَا قَالَتْ بَرِئَ أَحْسَنَ بَرْءٍ",
                "id": "Telah menceritakan kepada kami [Husain bin Muhammad] dia berkata, telah menceritakan kepada kami [Yazid bin Atha'] dari [Yazid] -yakni Ibnu Abu Ziyad- dari [Sulaiman bin 'Amru bin Al Ahwash Al Azdi] dia berkata, telah menceritakan kepadaku [ibuku] bahwa dia melihat Rasulullah shallallahu 'alaihi wasallam melempar jumrah Aqabah dari tengah lembah, sedangkan di belakang beliau ada orang yang melindunginya dari orang-orang yang melempar sehingga tidak mengenainya. Beliau bersabda: \"Hai manusia, janganlah sebagian kalian membunuh sebagian yang lain, jika kalian melempar maka lemparlah dengan batu kerikil antara dua jari.\" Lalu beliau berbalik, kemudian datanglah seorang wanita dengan membawa anaknya, wanita itu berkata, \"Wahai Rasulullah, sesungguhnya anakku ini hilang akalnya, maka do'akanlah dia.\" Beliau bersabda kepadanya: \"Ambilkan air untukku, \" lalu wanita itu membawakan untuk beliau periuk dari batu, kemudian beliau meludah ke dalamnya, beliau lalu basuh wajah anak itu dan mendo'akannya. Lantas beliau bersabda: \"Pergi dan mandikan ia dengannya, lalu mintalah kesembuhan kepada Allah Azza wa Jalla.\" Aku berkata kepadanya, \"Berikan padaku sedikit untuk anakku ini.\" Lalu aku mengambil sedikit dengan tanganku dan aku mengusapkan setengahnya pada anakku, maka dia menjadi sebaik-baik manusia, lalu aku bertanya kepada wanita tersebut, apa yang terjadi dengan anakknya, maka dia menjawab, \"Dia sembuh dengan sempurna.\""
            },
            {
                "number": 3969,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ قَالَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي زِيَادٍ عَنْ سُلَيْمَانَ بْنِ عَمْرِو بْنِ الْأَحْوَصِ عَنْ أُمِّهِ قَالَتْرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَرْمِي جَمْرَةَ الْعَقَبَةِ يَوْمَ النَّحْرِ مِنْ بَطْنِ الْوَادِي وَهُوَ يَقُولُ يَا أَيُّهَا النَّاسُ لَا يَقْتُلَنَّ بَعْضُكُمْ بَعْضًا وَإِذَا رَمَيْتُمْ الْجِمَارَ فَارْمُوا بِمِثْلِ حَصَى الْخَذْفِ قَالَتْ فَرَمَى سَبْعًا ثُمَّ انْصَرَفَ وَلَمْ يَقِفْ قَالَتْ وَخَلْفَهُ رَجُلٌ يَسْتُرُهُ مِنْ النَّاسِ فَسَأَلْتُ عَنْهُ فَقَالُوا هُوَ الْفَضْلُ بْنُ عَبَّاسٍ",
                "id": "Telah menceritakan kepada kami ['Affan] dia berkata, telah menceritakan kepada kami [Abu 'Awanah] dia berkata, telah menceritakan kepada kami [Yazid bin Abu Ziyad] dari [Sulaiman bin 'Amru bin Al Ahwash] dari [Ibunya] dia berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam melempar Jumrah Aqabah pada hari raya nahr (Idul adha) dari tengah lembah sembari bersabda: \"Wahai sekalian manusia, janganlah sebagian kalian membunuh sebagian yang lain, jika kalian melempar Jumrah maka lemparlah dengan dan kerikil di antara dua jari.\""
            },
            {
                "number": 3970,
                "arab": "حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي سَلِيطُ بْنُ أَيُّوبَ بْنِ الْحَكَمِ بْنِ سُلَيْمٍ عَنْ أُمِّهِ عَنْ سَلْمَى بِنْتِ قَيْسٍ وَكَانَتْ إِحْدَى خَالَاتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ صَلَّتْ مَعَهُ الْقِبْلَتَيْنِ وَكَانَتْ إِحْدَى نِسَاءِ بَنِي عَدِيِّ بْنِ النَّجَّارِ قَالَتْجِئْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَبَايَعْتُهُ فِي نِسْوَةٍ مِنْ الْأَنْصَارِ فَلَمَّا شَرَطَ عَلَيْنَا أَنْ لَا نُشْرِكَ بِاللَّهِ شَيْئًا وَلَا نَسْرِقَ وَلَا نَزْنِيَ وَلَا نَقْتُلَ أَوْلَادَنَا وَلَا نَأْتِيَ بِبُهْتَانٍ نَفْتَرِيهِ بَيْنَ أَيْدِينَا وَأَرْجُلِنَا وَلَا نَعْصِيَهُ فِي مَعْرُوفٍ قَالَ قَالَ وَلَا تَغْشُشْنَ أَزْوَاجَكُنَّ قَالَتْ فَبَايَعْنَاهُ ثُمَّ انْصَرَفْنَا فَقُلْتُ لِامْرَأَةٍ مِنْهُنَّ ارْجِعِي فَاسْأَلِي رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا غِشُّ أَزْوَاجِنَا قَالَتْ فَسَأَلَتْهُ فَقَالَ تَأْخُذُ مَالَهُ فَتُحَابِي بِهِ غَيْرَهُ",
                "id": "Telah menceritakan kepada kami [Ya'qub] berkata, telah menceritakan kepada kami [ayahku] dari [Ibnu Ishaq] dia berkata, telah menceritakan kepadaku [Salith bin Ayyub bin Al Hakam bin Sulaim] dari [Ibunya] dari [Salma binti Qais] dia adalah salah satu bibi Rasulullah shallallahu 'alaihi wasallam, bahwa dia pernah sholat bersama beliau menghadap dua kiblat, dan termasuk salah satu wanita Bani 'Adi bin Najjar. Dia berkata, \"Aku menemui Rasulullah shallallahu 'alaihi wasallam untuk berbait kepada beliau bersama para wanita Anshar, ketika itu beliau memberi kami syarat agar kami tidak menyekutukan Allah dengan sesuatupun, tidak mencuri, tidak berzina, tidak membunuh anak-anak kami, tidak mendatangi keburukan yang kami perbuat antara kedua tangan dan kaki kami, dan tidak bermaksiat dalam kebaikan.\" Salith berkata, \"Rasulullah bersabda: \"Janganlah kalian berbuat curang pada suami-suami kalian.\" Salma binti Qais berkata, \"Maka kami berbaiat kepada beliau kemudian kami beranjak pergi, lalu aku berkata kepada seorang wanita di antara mereka, 'Kembali dan tanyakanlah kepada Rasulullah shallallahu 'alaihi wasallam, apa yang dimaksud berbuat curang kepada suami-suami kami? ' Salma bin Qais berkata, \"Wanita itu lalu kembali dan menanyakannya, kemudian beliau bersabda: \"Kamu mengambil hartanya sedangkan kamu lebih mengutamakan selainnya.\""
            },
            {
                "number": 3971,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ قَالَ حَدَّثَنَا زَيْدُ بْنُ جُبَيْرٍوَسَأَلَهُ رَجُلٌ يَعْنِي ابْنَ عُمَرَ عَمَّا يَقْتُلُ الْمُحْرِمُ مِنْ الدَّوَابِّ فَقَالَ أَخْبَرَتْنِي إِحْدَى نِسْوَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَمَرَ بِقَتْلِ الْفَأْرَةِ وَالْعَقْرَبِ وَالْكَلْبِ الْعَقُورِ وَالْحُدَيَّا وَالْغُرَابِ",
                "id": "Telah menceritakan kepada kami ['Affan] berkata, telah menceritakan kepada kami [Abu 'Awanah] berkata, telah menceritakan kepada kami [Zaid bin Jubair] berkata, dan seorang laki-laki telah bertanya kepadanya -yaitu [Ibn Umar] - tentang hewan apa yang boleh dibunuh oleh seorang yang sedang berihram? dia lalu menjawab, \" [Salah seorang isteri Rasulullah shallallahu 'alaihi wasallam] mengabarkan kepadaku bahwa beliau memerintahkan agar membunuh tikus, kalajengking, anjing buas, hudai (nama burung) dan gagak.\""
            },
            {
                "number": 3972,
                "arab": "حَدَّثَنَا يَعْقُوبُ قَالَ حَدَّثَنَا أَبِي عَنِ ابْنِ إِسْحَاقَ قَالَ حَدَّثَنِي نُوحُ بْنُ حَكِيمٍ الثَّقَفِيُّ وَكَانَ قَارِئًا لِلْقُرْآنِ عَنْ رَجُلٍ مِنْ بَنِي عُرْوَةَ بْنِ مَسْعُودٍ يُقَالُ لَهُ دَاوُدُ قَدْ وَلَّدَتْهُ أُمُّ حَبِيبَةَ بِنْتُ أَبِي سُفْيَانَ زَوْجُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ لَيْلَى ابْنَةِ قَانِفٍ الثَّقَفِيَّةِ قَالَتْكُنْتُ فِيمَنْ غَسَّلَ أُمَّ كُلْثُومٍ بِنْتَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ وَفَاتِهَا وَكَانَ أَوَّلُ مَا أَعْطَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْحِقَاءَ ثُمَّ الدِّرْعَ ثُمَّ الْخِمَارَ ثُمَّ الْمِلْحَفَةَ ثُمَّ أُدْرِجَتْ بَعْدُ فِي الثَّوْبِ الْآخِرِ قَالَتْ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ الْبَابِ مَعَهُ كَفَنُهَا يُنَاوِلُنَاهُ ثَوْبًا ثَوْبًا",
                "id": "Telah menceritakan kepada kami [Ya'qub] berkata, telah menceritakan kepada kami [ayahku] dari [Ibnu Ishaq] dia berkata, telah menceritakan kepadaku [Nuh bin Hakim At Tsaqafi] dia adalah orang yang mahir dalam al-qur'an, dari seorang laki-laki dari Bani 'Urwah bin Mas'ud yang biasa dipanggil [Daud] -seorang yang telah dilahirkan oleh Ummu Habibah binti Abu Sufyan, salah satu dari isteri Nabi shallallahu 'alaihi wasallam- dari [Laila binti Qanif At Tsaqafiyah] dia berkata, \"Aku adalah salah satu orang yang memandikan Ummu Kultsum binti Rasulullah shallallahu 'alaihi wasallam ketika wafat, yang pertama kali diberikan Rasulullah shallallahu 'alaihi wasallam kepada kami adalah sarung, lalu gamis, lalu kerudung, lalu selimut (kain penutup) dan dilipat (bungkus) dengan kain yang terakhir.\" Laila berkata, \"Saat itu Rasulullah shallallahu 'alaihi wasallam berdiri di samping pintu membawa kafan dan memberikan kepada kami satu persatu.\""
            },
            {
                "number": 3973,
                "arab": "حَدَّثَنَا يَعْقُوبُ حَدَّثَنَا أَبِي عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ سُحَيْمٍ عَنْ أُمَيَّةَ بِنْتِ أَبِي الصَّلْتِ عَنِ امْرَأَةٍ مِنْ بَنِي غِفَارٍ وَقَدْ سَمَّاهَا لِي قَالَتْأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي نِسْوَةٍ مِنْ بَنِي غِفَارٍ فَقُلْنَا لَهُ يَا رَسُولَ اللَّهِ قَدْ أَرَدْنَا أَنْ نَخْرُجَ مَعَكَ إِلَى وَجْهِكَ هَذَا وَهُوَ يَسِيرُ إِلَى خَيْبَرَ فَنُدَاوِيَ الْجَرْحَى وَنُعِينَ الْمُسْلِمِينَ بِمَا اسْتَطَعْنَا فَقَالَ عَلَى بَرَكَةِ اللَّهِ قَالَتْ فَخَرَجْنَا مَعَهُ وَكُنْتُ جَارِيَةً حَدِيثَةً فَأَرْدَفَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى حَقِيبَةِ رَحْلِهِ قَالَتْ فَوَاللَّهِ لَنَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى الصُّبْحِ فَأَنَاخَ وَنَزَلْتُ عَنْ حَقِيبَةِ رَحْلِهِ وَإِذَا بِهَا دَمٌ مِنِّي فَكَانَتْ أَوَّلَ حَيْضَةٍ حِضْتُهَا قَالَتْ فَتَقَبَّضْتُ إِلَى النَّاقَةِ وَاسْتَحْيَيْتُ فَلَمَّا رَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بِي وَرَأَى الدَّمَ قَالَ مَا لَكِ لَعَلَّكِ نَفِسْتِ قَالَتْ قُلْتُ نَعَمْ قَالَ فَأَصْلِحِي مِنْ نَفْسِكِ وَخُذِي إِنَاءً مِنْ مَاءٍ فَاطْرَحِي فِيهِ مِلْحًا ثُمَّ اغْسِلِي مَا أَصَابَ الْحَقِيبَةَ مِنْ الدَّمِ ثُمَّ عُودِي لِمَرْكَبِكِ قَالَتْ فَلَمَّا فَتَحَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْبَرَ رَضَخَ لَنَا مِنْ الْفَيْءِ وَأَخَذَ هَذِهِ الْقِلَادَةَ الَّتِي تَرَيْنَ فِي عُنُقِي فَأَعْطَانِيهَا وَجَعَلَهَا بِيَدِهِ فِي عُنُقِي فَوَاللَّهِ لَا تُفَارِقُنِي أَبَدًا قَالَ وَكَانَتْ فِي عُنُقِهَا حَتَّى مَاتَتْ ثُمَّ أَوْصَتْ أَنْ تُدْفَنَ مَعَهَا فَكَانَتْ لَا تَطْهُرُ مِنْ حَيْضَةٍ إِلَّا جَعَلَتْ فِي طَهُورِهَا مِلْحًا وَأَوْصَتْ أَنْ يُجْعَلَ فِي غُسْلِهَا حِينَ مَاتَتْ",
                "id": "Telah menceritakan kepada kami [Ya'qub] telah menceritakan kepada kami [ayahku] dari [Muhammad bin Ishaq] dia berkata, telah menceritakan kepadaku [Sulaiman bin Suhaim] dari [Umayyah binti Abu Shalt] dari [seorang wanita] dari Bani Ghifar, dia menyebutkan namanya kepadaku, dia berkata, \"Aku menemui Rasulullah shallallahu 'alaihi wasallam dengan beberapa wanita Bani Ghiffar, kami berkata kepada beliau, \"Wahai Rasulullah, sesungguhnya kami ingin berperang bersama tuan pada perang ini -ketika itu beliau dalam perjalanan ke Khaibar-, sehingga kami dapat mengobati yang terluka dan kami membantu kaum muslimin semampu kami.\" Lantas beliau bersabda: \"Semoga diberkahi Allah.\" Lalu kami berangkat bersama beliau, ketika itu aku seorang gadis yang baru tumbuh, maka Rasulullah shallallahu 'alaihi wasallam memboncengkanku di karung perbekalannya.\" Wanita itu berkata, \"Demi Allah, Rasulullah shallallahu 'alaihi wasallam turun pada waktu subuh, lalu menderumkan untanya dan akupun turun dari karung perbekalannya. Tiba-tiba ada darah dariku dan aku haid untuk pertama kalinya. Lalu aku menepi pada unta karena malu, ketika Rasulullah shallallahu 'alaihi wasallam melihat apa yang terjadi denganku dan beliau melihat darah, beliau bersabda: \"Apa yang terjadi denganmu, apakah kamu baru saja haid?\" aku menjawab, \"Ya.\" Beliau bersabda: \"Bersihkan haidmu dan ambillah satu bejana air, lalu masukkan garam ke dalamnya dan cucilah darah yang mengenai karung perbekalan, setelah itu kembalilah naik.\" Wanita itu berkata, \"Ketika Rasulullah shallallahu 'alaihi wasallam menaklukkan Khaibar, beliau membagikan Fai' (rampasan perang) kepada kami, beliau lalu mengambil kalung yang kamu lihat di leherku ini, beliau berikan ini kepadaku dan beliau telakkan di leherku. Demi Allah, kalung tersebut tidak pernah berpisah dariku.\" Sulaiman berkata, \"Kalung itu tetap bersamanya sampai dia wafat, dan dia berwasiat agar kalung itu dikubur bersamanya. Dan dia tidak suci dari haidnya kecuali dia mensucikannya dengan garam, maka ia berwasiat agar memandikan dengan garam saat meninggal.\""
            },
            {
                "number": 3974,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَتْنِي أُمُّ غُرَابٍ عَنِ امْرَأَةٍ يُقَالُ لَهَا عَقِيلَةُ عَنْ سَلَامَةَ ابْنَةِ الْحُرِّ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَأْتِي عَلَى النَّاسِ زَمَانٌ يَقُومُونَ سَاعَةً لَا يَجِدُونَ إِمَامًا يُصَلِّي بِهِمْ",
                "id": "Telah menceritakan kepada kami [Waki'] dia berkata, telah menceritakan kepadaku [Ummu Ghurab] dari seorang wanita yang disebut ['Aqilah] dari [Salamah binti Hur] dia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan datang pada manusia suatu masa yang mereka berdiri sesaat untuk sholat namun tidak mendapatkan seseorang yang mengimami mereka.\""
            },
            {
                "number": 3975,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُحَمَّدٍ قَالَ حَدَّثَنَا مَرْوَانُ قَالَ حَدَّثَتْنَا امْرَأَةٌ يُقَالُ لَهَا طَلْحَةُ مَوْلَاةُ بَنِي فَزَارَةَ عَنْ مَوْلَاةٍ لَهُمْ يُقَالُ لَهَا عَقِيلَةُ عَنْ سَلَامَةَ ابْنَةِ الْحُرِّ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَوْ فِي شِرَارِ الْخَلْقِ أَنْ يَتَدَافَعَ أَهْلُ الْمَسْجِدِ لَا يَجِدُونَ إِمَامًا يُصَلِّي بِهِمْ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Muhammad] dia berkata, telah menceritakan kepada kami [Marwan] dia berkata, telah menceritakan kepada kami seorang wanita yang benama [Thalhah] bekas budak bani Fazarah, dari seorang budak mereka yang bernama ['Aqilah] dari [Salamah binti Hur] dia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh, di antara tanda-tanda hari Kiamat, atau sejelek-jelek manusia adalah ketika Jamaah masjid saling menolak untuk maju menjadi imam (karena tidak adanya ilmu) hingga mereka tidak mendapati seorang imam yang memimpin mereka sholat.\""
            },
            {
                "number": 3976,
                "arab": "حَدَّثَنَا سُفْيَانُ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ عَنْ أَبِيهِ عَنْ سِبَاعِ بْنِ ثَابِتٍ سَمِعْتُ مِنْ أُمِّ كُرْزٍ الْكَعْبِيَّةِ الَّتِي تُحَدِّثُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَتْسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْحُدَيْبِيَةِ وَذَهَبْتُ أَطْلُبُ مِنْ اللَّحْمِ عَنْ الْغُلَامِ شَاتَانِ وَعَنْ الْجَارِيَةِ شَاةٌ لَا يَضُرُّكُمْ ذُكْرَانًا كُنَّ أَوْ إِنَاثًا قَالَتْ وَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَقِرُّوا الطَّيْرَ عَلَى مَكِنَاتِهَا",
                "id": "Telah menceritakan kepada kami [Sufyan] telah menceritakan kepada kami ['Ubaidillah bin Abu Yazid] dari [ayahnya] dari [Siba' bin Tsabit] aku mendengar dari [Ummu Kurz Al Ka'biyah] yang menceritakan dari Rasulullah shallallahu 'alaihi wasallam, dia berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam berada di Hudaibiyah, sedangkan aku pergi meminta daging, untuk anak lelaki dua ekor kambing, dan untuk anak perempuan satu ekor kambing, tidak mengapa apakah (kambing) jantan maupun betina. Dia berkata dan aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Biarkanlah burung tetap berada pada sangkarnya.\""
            },
            {
                "number": 3977,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ عَنْ أَبِيهِ عَنْ سِبَاعِ بْنِ ثَابِتٍ قَالَسَمِعْتُ أَهْلَ الْجَاهِلِيَّةِ يَطُوفُونَ وَهُمْ يَقُولُونَ الْيَوْمُ قَرْنَا عَيْنَانَقْرَعُ الْمَرْوَتَيْنَا",
                "id": "Telah menceritakan kepada kami [Sufyan] dari ['ubaidhullah bin Abu Yazid] dari [ayahnya] dari [Siba' bin Tsabit] dia berkata, \"Aku mendengar orang-orang Jahiliyah thawaf sambil berkata, \"Pada hari ini mata kami bergembira, kami undi dua Marwa kami.\""
            },
            {
                "number": 3978,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ عُبَيْدِ اللَّهِ عَنْ أَبِيهِ عَنْ سِبَاعِ بْنِ ثَابِتٍ عَنْ أُمِّ كُرْزٍ الْكَعْبِيَّةِ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَقَالَ سُفْيَانُ مَرَّةً أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ذَهَبَتْ النُّبُوَّةُ وَبَقِيَتْ الْمُبَشِّرَاتُ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari ['ubaidhullah] dari [ayahnya] dari [Siba' bin Tsabit] dari [Ummu Kurz Al Ka'biyah] dia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda, sekali waktu [Sufyan] menyebutkan, bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Kenabian akan pergi dan tinggallah pemberi kabar gembira.\""
            },
            {
                "number": 3979,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ عَطَاءٍ عَنْ حَبِيبَةَ بِنْتِ مَيْسَرَةَ عَنْ أُمِّ كُرْزٍ الْكَعْبِيَّةِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ عَنْ الْغُلَامِ شَاتَانِ مُكَافَأَتَانِ وَعَنْ الْجَارِيَةِ شَاةٌقَالَ أَبُو عَبْد الرَّحْمَنِ سَمِعْت أَبِي يَقُولُ سُفْيَانُ يَهِمُ فِي هَذِهِ الْأَحَادِيثِ عُبَيْدُ اللَّهِ سَمِعَهَا مِنْ سِبَاعِ بْنِ ثَابِتٍ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari ['Amru] dari [Atha'] dari [Habibah binti Maisarah] dari [Ummu Kurz Al Ka'biyah] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau bersabda: \"Untuk anak laki-laki dua ekor kambing yang sama sedangkan untuk anak perempuan satu ekor kambing.\" Abu 'Abdurrahman berkata, \"Aku mendengar ayahku berkata, \"Sufyan menyangkan 'ubaidhullah mendengar hadits ini dari Siba' bin Tsabit.\""
            },
            {
                "number": 3980,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ قَالَ حَدَّثَنِي سِبَاعُ بْنُ ثَابِتٍ عَنْ أُمِّ كُرْزٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْعَقِيقَةِ عَنْ الْغُلَامِ شَاتَانِ مِثْلَانِ وَعَنْ الْجَارِيَةِ شَاةٌ",
                "id": "Telah menceritakan kepada kami ['Affan] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dia berkata, telah menceritakan kepadaku ['ubaidhullah bin Abu Yazid] dia berkata, telah menceritakan kepadaku [Siba' bin Tsabit] dari [Ummu Kurz] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda mengenai 'Akikah: \"Untuk anak laki-laki dua ekor kambing yang sama, sedangkan untuk anak perempuan satu ekor kambing.\""
            },
            {
                "number": 3981,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ طَلْحَةَ عَنْ عَمِّهِ عِمْرَانَ بْنِ طَلْحَةَ عَنْ أُمِّهِ حَمْنَةَ بِنْتِ جَحْشٍ قَالَتْأَتَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ إِنِّي قَدْ اسْتَحَضْتُ حَيْضَةً مُنْكَرَةً شَدِيدَةً فَقَالَ احْتَشِي كُرْسُفًا قُلْتُ إِنَّهُ أَشَدُّ مِنْ ذَاكَ إِنِّي أَثُجُّهُ ثَجًّا قَالَ تَلَجَّمِي وَتَحَيَّضِي فِي كُلِّ شَهْرٍ فِي عِلْمِ اللَّهِ سِتَّةَ أَيَّامٍ أَوْ سَبْعَةَ أَيَّامٍ ثُمَّ اغْتَسِلِي غُسْلًا وَصُومِي وَصَلِّي ثَلَاثًا وَعِشْرِينَ أَوْ أَرْبَعًا وَعِشْرِينَ وَاغْتَسِلِي لِلْفَجْرِ غُسْلًا وَأَخِّرِي الظُّهْرَ وَعَجِّلِي الْعَصْرَ وَاغْتَسِلِي غُسْلًا وَأَخِّرِي الْمَغْرِبَ وَعَجِّلِي الْعِشَاءَ وَاغْتَسِلِي غُسْلًا وَهَذَا أَحَبُّ الْأَمْرَيْنِ إِلَيَّ وَلَمْ يَقُلْ يَزِيدُ مَرَّةً وَاغْتَسِلِي لِلْفَجْرِ غُسْلًا",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Syarik bin 'Abdullah] dari ['Abdullah bin Muhammad bin 'Aqil] dari [Ibrahim bin Muhammad bin Thalhah] dari pamannya [Imran bin Thalhah] dari ibunya [Hamnah binti Jahsi] dia berkata, \"Aku menemui Rasulullah shallallahu 'alaihi wasallam dan berkata, 'Sesungguhnya aku mengeluarkan darah haid yang keruh dan deras? ' lalu beliau bersabda: \"Tutupilah dengan kapas.\" Aku berkata lagi, 'Sungguh, dia lebih deras darinya, aku mengeluarkan darah dengan deras sekali! ' Beliau bersabda: \"Kamu balut dan hitunglah haidmu setiap bulan dalam ilmu Allah selama enam atau tujuh hari kemudian mandilah, lalu berpuasa dan sholatlah dua puluh tiga atau dua puluh empat (hari). Mandilah kamu untuk sholat fajar, akhirkan zhuhur dan segerakan sholat asar lalu mandilah, akhirkan maghrib dan segerakan isya' lalu mandilah, dan inilah antara dua perkara yang aku sukai.\" Namun Yazid tidak menyebutkan, \"Mandilah untuk sholat.\""
            },
            {
                "number": 3982,
                "arab": "حَدَّثَنَا هَيْثَمُ يَعْنِي ابْنَ خَارِجَةَ قَالَ حَدَّثَنَا حَفْصُ بْنُ مَيْسَرَةَ عَنِ ابْنِ حَرْمَلَةَ عَنْ أَبِي ثِفَالٍ الْمُرِّيِّ أَنَّهُ قَالَ سَمِعْتُ رَبَاحَ بْنَ عَبْدِ الرَّحْمَنِ بْنِ حُوَيْطِبٍ يَقُولُ حَدَّثَتْنِي جَدَّتِي أَنَّهَا سَمِعَتْ أَبَاهَا يَقُولُسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا صَلَاةَ لِمَنْ لَا وُضُوءَ لَهُ وَلَا وُضُوءَ لِمَنْ لَمْ يَذْكُرْ اسْمَ اللَّهِ عَلَيْهِ وَلَا يُؤْمِنُ بِاللَّهِ مَنْ لَا يُؤْمِنُ بِي وَلَا يُؤْمِنُ بِي مَنْ لَا يُحِبُّ الْأَنْصَارَ",
                "id": "Telah menceritakan kepada kami [Haitsam] -yakni Ibnu Kharijah- dia berkata, telah menceritakan kepada kami [Hafsh bin Maisarah] dari [Ibnu Marhalah] dari [Abu Tsifal Al Murri] bahwa dia berkata, aku mendengar [Rabah bin 'Abdurrahman bin Huwaithib] berkata, telah menceritakan kepadaku [nenekku] bahwa dia mendengar [ayahnya] berkata, \"Aku mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak sah sholat seseorang yang tidak berwudlu, tidak ada wudlu bagi yang tidak menyebut asma Allah, tidak beriman kepada Allah orang yang tidak beriman kepadaku dan tidak beriman kepadaku orang yang tidak mencintai orang Anshar.\""
            },
            {
                "number": 3983,
                "arab": "حَدَّثَنَا يُونُسُ حَدَّثَنَا أَبُو مَعْشَرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ حَرْمَلَةَ عَنْ أَبِي ثِفَالٍ الْمُرِّيِّ عَنْ رَبَاحِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ حُوَيْطِبٍ عَنْ جَدَّتِهِ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يُؤْمِنُ بِاللَّهِ مَنْ لَمْ يُؤْمِنْ بِي وَلَمْ يُؤْمِنْ بِي مَنْ لَا يُحِبُّ الْأَنْصَارَ وَلَا صَلَاةَ لِمَنْ لَا وُضُوءَ لَهُ وَلَا وُضُوءَ لِمَنْ لَمْ يَذْكُرْ اسْمَ اللَّهِ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Yunus] telah menceritakan kepada kami [Abu Ma'syar] dari ['Abdurrahman bin Harmalah] dari [Abu Tsifal Al Muri] dari [Rabah bin 'Abdurrahman bin Huwaithib] dari [neneknya] dia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak beriman kepada Allah orang yang tidak beriman kepadaku, dan tidak beriman kepadaku orang yang tidak mencintai orang Anshar, tidak sah sholat seseorang yang tidak berwudlu, tidak ada wudlu bagi yang tidak menyebut nama Allah.\""
            },
            {
                "number": 3984,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا وُهَيْبٌ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ حَرْمَلَةَ أَنَّهُ سَمِعَ أَبَا ثِفَالٍ يُحَدِّثُ يَقُولُ سَمِعْتُ رَبَاحَ بْنَ عَبْدِ الرَّحْمَنِ وَلَمْ يَقُلْ عَفَّانُ مَرَّةً ابْنَ أَبِي سُفْيَانَ بْنِ حُوَيْطِبٍ يَقُولُ حَدَّثَتْنِي جَدَّتِي أَنَّهَا سَمِعَتْ أَبَاهَا يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا صَلَاةَ لِمَنْ لَا وُضُوءَ لَهُ وَلَا وُضُوءَ لِمَنْ لَمْ يَذْكُرْ اسْمَ اللَّهِ عَلَيْهِ وَلَا يُؤْمِنُ بِاللَّهِ مَنْ لَا يُؤْمِنُ بِي وَلَا يُؤْمِنُ بِي مَنْ لَا يُحِبُّ الْأَنْصَارَ",
                "id": "Telah menceritakan kepada kami ['Affan] berkata, telah menceritakan kepada kami [Wuhaib] berkata, telah menceritakan kepada kami ['Abdurrahman bin Harmalah] bahwa dia mendengar [Abu Tsifal] bercerita, dia berkata; aku mendengar [Rabah bin 'Abdurrahman], sekali waktu 'Affan tidak menyebutkan Ibnu Abu Sufyan bin Huwaithib ia berkata, telah menceritakan kepadaku [nenekku] bahwa dia mendengar [Bapaknya] berkata; saya telah mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Tidak sah sholat seseorang yang tidak berwudlu, tidak ada wudlu bagi yang tidak menyebut nama Allah, tidak beriman kepada Allah orang yang tidak beriman kepadaku, dan tidak beriman kepadaku orang yang tidak mencintai orang Anshar.\""
            },
            {
                "number": 3985,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا ابْنُ أَبِي ذِئْبٍ عَنْ الْمَقْبُرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ بُجَيْدٍ عَنْ جَدَّتِهِ أُمِّ بُجَيْدٍ قَالَتْقُلْتُ يَا رَسُولَ اللَّهِ وَاللَّهِ إِنَّ الْمِسْكِينَ لَيَقِفُ عَلَى بَابِي حَتَّى أَسْتَحْيِيَ فَلَا أَجِدُ فِي بَيْتِي مَا أَرْفَعُ فِي يَدِهِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ارْفَعِي فِي يَدِهِ وَلَوْ ظِلْفًا مُحْرَقًاحَدَّثَنَا حَجَّاجٌ وَأَبُو كَامِلٍ قَالَا حَدَّثَنَا لَيْثٌ يَعْنِي ابْنَ سَعْدٍ قَالَ حَدَّثَنِي سَعِيدٌ يَعْنِي الْمَقْبُرِيَّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ بُجَيْدٍ أَخِي بَنِي حَارِثَةَ أَنَّهُ حَدَّثَتْهُ جَدَّتُهُ وَهِيَ امْرَأَةُ بُجَيْدٍ وَكَانَتْ تُزْعَمُ مِمَّنْ بَايَعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مَعْنَاهُ",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] berkata, telah mengabarkan kepada kami [Ibnu Abu Dzi'b] dari [Al Muqbiri] dari ['Abdurrahman bin Bujaid] dari neneknya [Ummu Bujaid] dia berkata, aku berkata, \"Wahai Rasulullah, demi Allah, orang-orang miskin berdiri di depan pintu rumahku hingga aku malu, sedangkan aku tidak mendapati di rumahku apa yang bisa aku berikan?\" maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berilah dia walau dengan secuil daging panggang.\" Telah menceritakan kepada kami [Hajjaj] dan [Abu Kamil] keduanya berkata, telah menceritakan kepada kami [Laits] -yakni Ibnu Sa'ad- berkata, telah menceritakan kepadaku [Sa'id] -yakni Al Makburi- dari ['Abdurrahman bin Bujaid] saudara Bani Haritsah, bahwa neneknya telah menceritakan kepada kepadanya, dia adalah [isteri Bujaid]. Dan ia mengaku termasuk orang yang pernah berbaiat kepada Rasulullah shallallahu 'alaihi wasallam, dia berkata kepada Rasulullah shallallahu 'alaihi wasallam… lalu dia menyebutkan maknanya.\""
            },
            {
                "number": 3986,
                "arab": "حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا اللَّيْثُ حَدَّثَنِي سَعِيدٌ يَعْنِي الْمَقْبُرِيَّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ بُجَيْدٍ أَخِي بَنِي حَارِثَةَ أَنَّهُ حَدَّثَتْهُ جَدَّتُهُ وَهِيَ أُمُّ بُجَيْدٍ وَكَانَتْ مِمَّنْ بَايَعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاللَّهِ إِنَّ الْمِسْكِينَ لَيَقُومُ عَلَى بَابِي فَمَا أَجِدُ لَهُ شَيْئًا أُعْطِيهِ إِيَّاهُ فَقَالَ لَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ لَمْ تَجِدِي لَهُ شَيْئًا تُعْطِينَهُ إِيَّاهُ إِلَّا ظِلْفًا مُحْرَقًا فَادْفَعِيهِ إِلَيْهِ فِي يَدِهِ",
                "id": "Telah menceritakan kepada kami [Hasyim bin Qasim] telah menceritakan kepada kami [Laits] telah menceritakan kepadaku [Sa'id] -yakni Al Maqburi- dari ['Abdurrahman bin Bujaid] saudara Bani Haritsah, bahwa neneknya telah menceritakan kepadanya, neneknya adalah [Ummu Bujaid] salah seorang wanita yang berbaiat kepada Nabi shallallahu 'alaihi wasallam. Dia berkata kepada Rasulullah shallallahu 'alaihi wasallam, \"Demi Allah, orang-orang miskin berdiri di depan pintuku, sedangkan aku tidak memiliki sesuatupun untuk aku berikan kepadanya?\" Maka beliau bersabda kepadanya: \"Jika kamu tidak mendapatkan sesuatu yang bisa kamu berikan kepadanya melainkan hanya secuil daging panggang, maka berikanlah itu ke dalam genggaman tangannya.\""
            },
            {
                "number": 3987,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ بُجَيْدٍ عَنْ جَدَّتِهِ أُمِّ بُجَيْدٍ أَنَّهَا قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْتِينَا فِي بَنِي عَمْرِو بْنِ عَوْفٍ فَأَتَّخِذُ لَهُ سَوِيقَةً فِي قَعْبَةٍ لِي فَإِذَا جَاءَ سَقَيْتُهَا إِيَّاهُ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّهُ يَأْتِينِي السَّائِلُ فَأَتَزَهَّدُ لَهُ بَعْضَ مَا عِنْدِي فَقَالَ ضَعِي فِي يَدِ الْمِسْكِينِ وَلَوْ ظِلْفًا مُحْرَقًا",
                "id": "Telah menceritakan kepada kami ['Affan] dia berkata, telah menceritakan kepada kami [Hammad bin Salamah] dari [Muhammad bin Ishaq] dari [Sa'id bin Abu Sa'id Al Muqbiri] dari ['Abdurrahman bin Bujaid] dari neneknya [Ummu Bujaid] bahwa dia berkata, \"Rasulullah shallallahu 'alaihi wasallam mendatangi kami sewaktu di Bani 'Amru bin 'Auf, kemudian aku mengambilkan untuk beliau adonan sawiq dalam bejana milikku. Sewaktu beliau datang, aku langsung menuangkannya.\" Ummu Bujaid berkata, \"Aku katakan, \"Wahai Rasulullah, sesungguhnya seorang pengemis datang kepadaku sedangkan aku ingin tidak mempunyai sesuatu?\" maka beliau bersabda: \"Taruhlah pada tangan si miskin itu walaupun dengan secuil daging panggang.\""
            },
            {
                "number": 3988,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورِ بْنِ حَيَّانَ الْأَسَدِيِّ عَنِ ابْنِ بِجَادٍ عَنْ جَدَّتِهِ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُدُّوا السَّائِلَ وَلَوْ بِظِلْفِ شَاةٍ مُحْرَقٍ أَوْ مُحْتَرِقٍ",
                "id": "Telah menceritakan kepada kami [Waki'] berkata, telah menceritakan kepada kami [Sufyan] dari [Manshur bin Hayyan Al Asadi] dari [Ibnu Bijad] dari [neneknya] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berilah orang yang meminta walau dengan secuil daging kambing yang telah dipanggang, atau terpanggang.\""
            },
            {
                "number": 3989,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا هَمَّامٌ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جُحَادَةَ قَالَ حَدَّثَنِي الْمُغِيرَةُ بْنُ عَبْدِ اللَّهِ الْيَشْكُرِيُّ عَنْ أَبِيهِ قَالَانْطَلَقْتُ إِلَى الْكُوفَةِ لِأَجْلِبَ بِغَالًا قَالَ فَأَتَيْتُ السُّوقَ وَلَمْ تُقَمْ قَالَ قُلْتُ لِصَاحِبٍ لِي لَوْ دَخَلْنَا الْمَسْجِدَ وَمَوْضِعُهُ يَوْمَئِذٍ فِي أَصْحَابِ التَّمْرِ فَإِذَا فِيهِ رَجُلٌ مِنْ قَيْسٍ يُقَالُ لَهُ ابْنُ الْمُنْتَفِقِ وَهُوَ يَقُولُ وُصِفَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحُلِّيَ فَطَلَبْتُهُ بِمِنًى فَقِيلَ لِي هُوَ بِعَرَفَاتٍ فَانْتَهَيْتُ إِلَيْهِ فَزَاحَمْتُ عَلَيْهِ فَقِيلَ لِي إِلَيْكَ عَنْ طَرِيقِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ دَعُوا الرَّجُلَ أَرِبَ مَا لَهُ قَالَ فَزَاحَمْتُ عَلَيْهِ حَتَّى خَلَصْتُ إِلَيْهِ قَالَ فَأَخَذْتُ بِخِطَامِ رَاحِلَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ قَالَ زِمَامِهَا هَكَذَا حَدَّثَ مُحَمَّدٌ حَتَّى اخْتَلَفَتْ أَعْنَاقُ رَاحِلَتَيْنَا قَالَ فَمَا يَزَعُنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ قَالَ مَا غَيَّرَ عَلَيَّ هَكَذَا حَدَّثَ مُحَمَّدٌ قَالَ قُلْتُ ثِنْتَانِ أَسْأَلُكَ عَنْهُمَا مَا يُنَجِّينِي مِنْ النَّارِ وَمَا يُدْخِلُنِي الْجَنَّةَ قَالَ فَنَظَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى السَّمَاءِ ثُمَّ نَكَسَ رَأْسَهُ ثُمَّ أَقْبَلَ عَلَيَّ بِوَجْهِهِ قَالَ لَئِنْ كُنْتَ أَوْجَزْتَ فِي الْمَسْأَلَةِ لَقَدْ أَعْظَمْتَ وَأَطْوَلْتَ فَاعْقِلْ عَنِّي إِذًا اعْبُدْ اللَّهَ لَا تُشْرِكْ بِهِ شَيْئًا وَأَقِمْ الصَّلَاةَ الْمَكْتُوبَةَ وَأَدِّ الزَّكَاةَ الْمَفْرُوضَةَ وَصُمْ رَمَضَانَ وَمَا تُحِبُّ أَنْ يَفْعَلَهُ بِكَ النَّاسُ فَافْعَلْهُ بِهِمْ وَمَا تَكْرَهُ أَنْ يَأْتِيَ إِلَيْكَ النَّاسُ فَذَرْ النَّاسَ مِنْهُ ثُمَّ قَالَ خَلِّ سَبِيلَ الرَّاحِلَةِ",
                "id": "Telah menceritakan kepada kami [Affan] telah menceritakan kepada kami [Hammam] berkata, telah menceritakan kepada kami [Muhammad bin Juhadah] berkata, telah menceritakan kepadaku [Al Mughirah bin Abdullah Al Yasykuri] dari [Ayahnya] dia berkata, \"Aku pergi ke Kufah untuk mengambil keledai.\" Abdullah berkata, \"Lalu aku mendatangi pasar, dan ternyata pasar belum dimulai. Kemudian aku berkata kepada sahabatku, 'Bagaimana jika kita masuk ke masjid, pada hari itu adalah pasarannya pedagang kurma', ternyata di dalam masjid ada seorang laki-laki yang bernama Qa'is bin Al Muntafiq. Laki-laki itu berkata, \"Telah diterangkan kepadku tentang sifat Rasulullah shallallahu 'alaihi wasallam, kemudian aku mencarinta di Mina, lantas dikatakan kepadaku bahwa beliau berada di Arafah, akhirnya aku menemukan beliau. Kemudian aku berdesak-desakkan untuk menemui beliau, dikatakan kepadaku, 'Menjauhlah dari jalan Rasulullah shallallahu 'alaihi wasallam', kemudian beliau bersabda: \"Biarkan orang itu, biarkan apa yang diinginkan, \" [Ibnul Muntafiq] lalu berkata, \"Kemudian aku bergegas menemui beliau hingga aku berada di depannya. Kemudian aku mengambil tali kekang tunggangan Rasulullah shallallahu 'alaihi wasallam, atau dia berkata; tali pengikatnya -seperti ini yang diriwayatkan Muhammad- hingga kedua leher tunggangan kami beriringan.\" Ibnul Muntafiq berkata, \"Dan Rasulullah shallallahu 'alaihi wasallam tidak mengeluhkan kepadaku, atau dia mengatakan, beliau tidak berubah raut mukanya padaku -seperti ini yang diriwayatkan Muhammad-. Aku lalu berkata, \"Dua hal yang aku tanyakan kepada tuan; apa yang menyebabkan aku bebas dari neraka, dan apa yang menyebabkan aku masuk surga? ' Lalu Rasulullah shallallahu 'alaihi wasallam menengadahkan kepalanya ke langit dan menurunkannya lagi, kemudian menatapku dengan wajahnya, beliau bersabda: \"Jika kamu meringankan soal ini, maka kamu telah menjadikannya perkara besar dan lama, pergi dan sembahlah Allah dan jangan kamu sekutukan dengan sesuatupun, dirikan sholat wajib, tunaikan zakat, dan berpuasalah pada bulan Ramadan. Jika kamu suka orang-orang melakukan sesuatu (kebaikan) kepadamu, maka lakukanlah kebaikan itu kepada mereka, dan jika kamu benci orang-orang melakukan keburukan itu kepadamu, maka jangan kamu lakukan keburukan itu kepada mereka.\" Kemudian beliau bersabda: \"Berikan jalan untukku.\""
            },
            {
                "number": 3990,
                "arab": "حَدَّثَنَا وَكِيعٌ عَنْ عَمْرِو بْنِ حَسَّانَ يَعْنِي الْمَسْلِيَّ قَالَ حَدَّثَنِي الْمُغِيرَةُ بْنُ عَبْدِ اللَّهِ الْيَشْكُرِيُّ عَنْ أَبِيهِ قَالَدَخَلْتُ مَسْجِدَ الْكُوفَةِ أَوَّلَ مَا بُنِيَ مَسْجِدُهَا وَهُوَ فِي أَصْحَابِ التَّمْرِ يَوْمَئِذٍ وَجُدُرُهُ مِنْ سِهْلَةٍ فَإِذَا رَجُلٌ يُحَدِّثُ النَّاسَ قَالَ بَلَغَنِي حَجَّةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَجَّةُ الْوَدَاعِ قَالَ فَاسْتَتْبَعْتُ رَاحِلَةً مِنْ إِبِلِي ثُمَّ خَرَجْتُ حَتَّى جَلَسْتُ لَهُ فِي طَرِيقِ عَرَفَةَ أَوْ وَقَفْتُ لَهُ فِي طَرِيقِ عَرَفَةَ قَالَ فَإِذَا رَكْبٌ عَرَفْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِمْ بِالصِّفَةِ فَقَالَ رَجُلٌ أَمَامَهُ خَلِّ عَنْ طَرِيقِ الرِّكَابِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَيْحَهُ دَعْهُ فَأَرِبَ مَا لَهُ فَدَنَوْتُ مِنْهُ حَتَّى اخْتَلَفَتْ رَأْسُ النَّاقَتَيْنِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ دُلَّنِي عَلَى عَمَلٍ يُدْخِلُنِي الْجَنَّةَ وَيُنَجِّينِي مِنْ النَّارِ قَالَ بَخٍ بَخٍ لَئِنْ كُنْتَ قَصَّرْتَ فِي الْخُطْبَةِ لَقَدْ أَبْلَغْتَ فِي الْمَسْأَلَةِ اتَّقِ اللَّهَ لَا تُشْرِكْ بِاللَّهِ وَتُقِيمُ الصَّلَاةَ وَتُؤَدِّي الزَّكَاةَ وَتَحُجُّ الْبَيْتَ وَتَصُومُ رَمَضَانَ خَلِّ عَنْ طَرِيقِ الرِّكَابِقَالَ حَدَّثَنَا وَكِيعٌ عَنْ يُونُسَ يَعْنِي ابْنَ أَبِي إِسْحَاقَ قَالَ سَمِعْتُ هَذَا الْحَدِيثَ مِنْ الْمُغِيرَةِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ نَحْوَهُ",
                "id": "Telah menceritakan kepada kami [Waki'] dari ['Amru bin Hasan] -yakni Al Masli- dia berkata, telah menceritakan kepadaku [Al Mughirah bin 'Abdullah Al Yasykuri] dari [ayahnya] dia berkata, \"Aku masuk masjid Kufah waktu pertama kali dibangun masjidnya, sedagkan waktu itu ia digunakan oleh para penjual kurma, dan dindingnya terbuat dari pasir yang mudah hancur. Tiba-tiba ada [seorang laki-laki] yang meriwayatkan hadits kepada orang-orang, laki-laki itu berkata, \"Telah sampai berita kepadaku hajinya Rasulullah shallallahu 'alaihi wasallam, yaitu haji wada'.\" Kemudian aku menyusulnya dengan berkendaraan untaku, kemudian aku keluar sampai akhirnya aku duduk di jalan 'Arafah, atau aku berhenti di jalan 'Arafah.\" Abdullah berkata, \"Kemudian muncul satu rombongan, dan aku tahu bahwa dalamrombongan tersebut ada Rasulullah shallallahu 'alaihi wasallam. Lalu seorang laki-laki yang ada di depannya berkata, \"Minggirlah dari jalan pengendara, \" maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Celaka kamu! Biarkanlah dia.\" Kemudian aku menyeru mendekat hingga kedua unta (untaku dan unta beliau) kepalanya saling bersentuhan.\" Abdullah berkata, \"Aku lalu berkata, \"Wahai Rasulullah, tunjukkanlah kepadaku amalan yang bisa memasukkan aku ke dalam surga dan menyelamatkan aku dari Neraka.\" Beliau menjawab: \"Bagus, bagus, sekiranya kamu singkat dalam khutbah (do'a) sungguh kamu telah sampai pada apa yang kamu minta. Bertaqwalah kepada Allah dan jangan menyekutukan Allah, dirikanlah sholat, tunaikanlah zakat, berhaji ke Baitul Haram, dan berpuasa pada bulan Ramadan. Sekarang minggirlah dari jalan pengendara.\" Abdullah berkata, \"Telah menceritakan kepada kami [Waki'] dari [Yunus] -yakni Ibnu Abu Ishaq- dia berkata, aku mendengar hadits ini dari [Mughirah bin 'Abdullah] dari [ayahnya] seperti itu.\""
            },
            {
                "number": 3991,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا زُهَيْرٌ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ أَبِيهِ وَعَمِّهِ قَتَادَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُوا لُحُومَ الْأَضَاحِيِّ وَادَّخِرُوا",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin 'Amru] dan [Abdurrahman bin Mahdi] keduanya berkata, telah menceritakan kepada kami [Zuhair] -yakni Ibnu Muhammad- dari [Syarik bin Abdullah] dari [Abdurrahman bin Abu Sa'id al Khudri] dari [Ayahnya] dan pamannya [Qatadah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Makanlah oleh kalian daging kurban dan simpanlah ia.\""
            },
            {
                "number": 3992,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ قَالَ حَدَّثَنَا يَزِيدُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ سِيرِينَ عَنْ أَبِي الْعَلَانِيَةِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَأَتَيْتُ هَذِهِ يَعْنِي امْرَأَتَهُ وَعِنْدَهَا لَحْمٌ مِنْ لُحُومِ الْأَضَاحِيِّ قَدْ رَفَعَتْهُ فَرَفَعْتُ عَلَيْهَا الْعَصَا فَقَالَتْ إِنَّ فُلَانًا أَتَانَا فَأَخْبَرَنَا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنِّي كُنْتُ نَهَيْتُكُمْ أَنْ تُمْسِكُوا لُحُومَ الْأَضَاحِيِّ فَوْقَ ثَلَاثَةِ أَيَّامٍ فَكُلُوا وَادَّخِرُوا",
                "id": "Telah menceritakan kepada kami [Abdus Shamad] berkata, telah menceritakan kepada kami [Yazid bin Ibrahim] berkata, telah menceritakan kepada kami [Muhammad] -yakni Ibnu Sirin- dari [Abu Al Alaniyah] dari [Abu Sa'id Al Khudri] berkata, \"Aku menemui ini -yakni isterinya-, sedangkan di sisinya ada daging kurban yang ia telah mengangkatnya, maka aku pun mengangkatnya dengan tongkat. Isteriku lalu berkata, \"Fulan telah datang dan mengabarkan kepada kami bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku pernah melarang kalian untuk menahan daging kurban lebih dari tiga hari, maka sekarang makanlah dan simpanlah.\""
            },
            {
                "number": 3993,
                "arab": "حَدَّثَنَا يُونُسُ قَالَ حَدَّثَنَا لَيْثٌ عَنْ يَزِيدَ يَعْنِي ابْنَ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَأَنَّ قَتَادَةَ بْنَ النُّعْمَانِ الظَّفَرِيَّ وَقَعَ بِقُرَيْشٍ فَكَأَنَّهُ نَالَ مِنْهُمْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا قَتَادَةُ لَا تَسُبَّنَّ قُرَيْشًا فَلَعَلَّكَ أَنْ تَرَى مِنْهُمْ رِجَالًا تَزْدَرِي عَمَلَكَ مَعَ أَعْمَالِهِمْ وَفِعْلَكَ مَعَ أَفْعَالِهِمْ وَتَغْبِطُهُمْ إِذَا رَأَيْتَهُمْ لَوْلَا أَنْ تَطْغَى قُرَيْشٌ لَأَخْبَرْتُهُمْ بِالَّذِي لَهُمْ عِنْدَ اللَّهِ عَزَّ وَجَلَّقَالَ يَزِيدُ سَمِعَنِي جَعْفَرُ بْنُ عَبْدِ اللَّهِ بْنِ أَسْلَمَ وَأَنَا أُحَدِّثُ هَذَا الْحَدِيثَ فَقَالَ هَكَذَا حَدَّثَنِي عَاصِمُ بْنُ عُمَرَ بْنِ قَتَادَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ",
                "id": "Telah menceritakan kepada kami [Yunus] berkata, Telah menceritakan kepada kami [Laits] dari [Yazid] -yakni Ibnul Hadi- dari [Muhammad bin Ibrahim], bahwa Qatadah bin Nu'man Azh Zhafari bertikai dengan kaum Quraisy seakan-akan ia menjelekkan mereka, maka Nabi shallallahu 'alaihi wasallam bersabda: \"Hai Qatadah, janganlah kamu menghina kaum Quraisy, barangkali kamu melihat di antara mereka terdapat orang-orang yang amalanmu lebih rendah dari amalan mereka, perbuatanmu lebih rendah daripada perbuatan mereka, dan kamu iri jika kamu melihat mereka. Jika saja orang-orang Quraisy tidak melampaui batas, maka akan aku kabarkan apa yang Allah Azza Wa Jalla siapkan untuk mereka.\" [Yazid] berkata; [Ja'far bin Abdullah bin Aslam] mendengarku mengatakan hadits ini, dan aku meriwayatkan hadits ini. Lalu dia berkata, seperti ini yang aku dengar dari [Ashim bin Umar bin Qatadah] dari [ayahnya] dari [kakeknya.] "
            },
            {
                "number": 3994,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو عَنْ نَافِعِ بْنِ جُبَيْرِ بْنِ مُطْعِمٍ عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُحْسِنْ إِلَى جَارِهِ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ",
                "id": "Telah mengabarkan kepada kami [Sufyan] dari ['Amru] dari [Nafi' bin Jubair bin Muth'im] dari [Abu Syuraij Al khuza'i] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa beriman kepada Allah dan hari akhir hendaknya ia menghormati tamunya, barangsiapa beriman kepada Allah dan hari akhir hendaknya berbuat baik terhadap tetangganya, dan barangsiapa beriman kepada Allah dan hari akhir hendaklah ia berkata baik atau diam.\""
            },
            {
                "number": 3995,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ قَالَ حَدَّثَنَا سَعِيدٌ يَعْنِي الْمَقْبُرِيَّ قَالَ سَمِعْتُ أَبَا شُرَيْحٍ الْكَعْبِيَّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ فَتْحِ مَكَّةَ إِنَّ اللَّهَ عَزَّ وَجَلَّ حَرَّمَ مَكَّةَ وَلَمْ يُحَرِّمْهَا النَّاسُ فَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلَا يَسْفِكَنَّ فِيهَا دَمًا وَلَا يَعْضِدَنَّ فِيهَا شَجَرًا فَإِنْ تَرَخَّصَ مُتَرَخِّصٌ فَقَالَ أُحِلَّتْ لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنَّ اللَّهَ أَحَلَّهَا لِي وَلَمْ يُحِلَّهَا لِلنَّاسِ وَهِيَ سَاعَتِي هَذِهِ حَرَامٌ إِلَى أَنْ تَقُومَ السَّاعَةُ إِنَّكُمْ مَعْشَرَ خُزَاعَةَ قَتَلْتُمْ هَذَا الْقَتِيلَ وَإِنِّي عَاقِلُهُ فَمَنْ قُتِلَ لَهُ قَتِيلٌ بَعْدَ مَقَالَتِي هَذِهِ فَأَهْلُهُ بَيْنَ خِيرَتَيْنِ إِمَّا أَنْ يَقْتُلُوا أَوْ يَأْخُذُوا الْعَقْلَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] berkata, telah menceritakan kepada kami [Ibnu Abu Dzi'b] berkata, telah menceritakan kepada kami [Sa'id] -yakni Al Maqbri berkata, aku mendengar [Abu Syuraih Al Ka'bi] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda pada saat penaklukan kota Makkah: \"Sesungguhnya Allah Azza Wa Jalla telah mengharamkan kota Makkah dan manusia belum mengharamkannya, maka barangsiapa beriman kepada Allah dan hari akhir, hendaknya tidak menumpahkan darah di dalamnya, dan tidak menebang pepohonan di dalamnya meskipun dari orang yang meremehkan.\" Abu Syuraih berkata, \"Telah dihalalkan buat Rasulullah shallallahu 'alaihi wasallam, \"Sesungguhnya Allah telah menghalalkan buatku dan tidak menghalalkan buat yang lain, ia haram dari sekarang ini hingga hari Kiamat kelak. Sesungguhnya kalian wahai bani Khuza'ah, telah membunuh orang ini, dan sesungguhnya akulah yag menebus diatnya, maka barangsiapa membunuh seseorang setelah perkataanku ini, maka keluarganya berhak untuk memilih antara dua pilihan; balas bunuh atau mengambil diyatnya.\""
            },
            {
                "number": 3996,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ قَالَ حَدَّثَنَا مَالِكٌ قَالَ حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ عَنْ أَبِي شُرَيْحٍ الْكَعْبِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ جَارَهُ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ جَائِزَتُهُ يَوْمٌ وَلَيْلَةٌ الضِّيَافَةُ ثَلَاثَةُ أَيَّامٍ فَمَا كَانَ بَعْدَ ذَلِكَ فَهُوَ صَدَقَةٌ لَا يَحِلُّ لَهُ أَنْ يَثْوِيَ عِنْدَهُ حَتَّى يُخْرِجَهُ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] berkata, Telah menceritakan kepada kami [Malik] berkata, Telah menceritakan kepadaku [Sa'id bin Abu Sa'id] dari [Abu Syuraih Al Ka'bi] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa beriman kepada Allah dan hari akhir hendaknya ia memuliakan tetangganya, barangsiapa beriman kepada Allah dan hari akhir hendaknya ia berkata dengan perkataan yang baik atau diam, dan barangsiapa beriman kepada Allah dan hari akhir hendaknya ia memuliakan tamunya, yaitu melayaninya tiap hari dan malam. Dan masa bertamu itu adalah tiga hari, jika lebih dari itu maka ia menjadi sedekah, dan tidak halal baginya untuk menginap hingga ia (pemilik rumah) mengeluarkannya.\""
            }
        ]
    }
}