{
    "status": true,
    "data": {
        "start": 1629,
        "end": 1776,
        "total": 148,
        "book": "ahmad",
        "hadits": [
            {
                "number": 1629,
                "arab": "حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ أَنْبَأَنَا سُفْيَانُ بْنُ زِيَادٍ عَنْ فَاتِكِ بْنِ فَضَالَةَ عَنْ أَيْمَنَ بْنِ خُرَيْمٍ قَالَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطِيبًا فَقَالَ يَا أَيُّهَا النَّاسُ عَدَلَتْ شَهَادَةُ الزُّورِ إِشْرَاكًا بِاللَّهِ ثَلَاثًا ثُمَّ قَرَأَ{ فَاجْتَنِبُوا الرِّجْسَ مِنْ الْأَوْثَانِ وَاجْتَنِبُوا قَوْلَ الزُّورِ }",
                "id": "Telah menceritakan kepada kami [Marwan bin Mu'awiyah Al Fazari] telah memberitakan kepada kami [Sufyan bin Ziyad] dari [Fatik bin Fadlalah] dari [Aiman bin Khuraim] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam berdiri menyampaikan khutbah seraya bersabda: \"Wahai sekalian manusia, saksi palsu itu sama dengan syirik kepada Allah.\" Beliau mengucapkannya tiga kali, kemudian beliau membaca ayat: '(Maka jauhilah olehmu berhala-berhala yang najis itu dan jauhilah perkataan-perkataan dusta) ' (Qs. Al Hajj: 30)."
            },
            {
                "number": 1630,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنِي يُونُسُ بْنُ أَبِي إِسْحَاقَ عَنْ خَيْثَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ قَالَكَانَ اسْمُ أَبِي فِي الْجَاهِلِيَّةِ عَزِيزًا فَسَمَّاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدَ الرَّحْمَنِ",
                "id": "Telah menceritakan kepada kami [Waki'] telah menceritakan kepadaku [Yunus bin Abi Ishaq] dari [Khaitsamah bin Abdurrahman] dari [Bapaknya] ia berkata, \"Nama bapakku pada masa jahiliyah adalah Aziz, lalu Rasulullah shallallahu 'alaihi wasallam memberikannya nama Abdurrahman.\""
            },
            {
                "number": 1631,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا أَبِي عَنْ أَبِي إِسْحَاقَ عَنْ خَيْثَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ مِنْ خَيْرِ أَسْمَائِكُمْ عَبْدَ اللَّهِ وَعَبْدَ الرَّحْمَنِ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Bapakku] dari [Abu Ishaq] dari [Khaitsamah bin Abdurrahman] dari Bapaknya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya sebai-baik nama kalian adalah Abdullah dan Abdurrahman.\""
            },
            {
                "number": 1632,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ حَدَّثَنَا أَبُو وَكِيعٍ عَنْ أَبِي إِسْحَاقَ عَنْ خَيْثَمَةَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي سَبْرَةَ أَنَّ أَبَاهُ عَبْدَ الرَّحْمَنِذَهَبَ مَعَ جَدِّهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا اسْمُ ابْنِكَ قَالَ عَزِيزٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُسَمِّهِ عَزِيزًا وَلَكِنْ سَمِّهِ عَبْدَ الرَّحْمَنِ ثُمَّ قَالَ إِنَّ خَيْرَ الْأَسْمَاءِ عَبْدُ اللَّهِ وَعَبْدُ الرَّحْمَنِ وَالْحَارِثُ",
                "id": "Telah menceritakan kepada kami [Husain bin Muhammad] telah menceritakan kepada kami [Abu Waki'] dari [Abu Ishaq] dari [Khaitsamah bin Abdurrahman bin Abu Sabrah], bahwa bapaknya, Abdurrahman, pergi bersama kakeknya menghadap Rasulullah shallallahu 'alaihi wasallam. Beliau lalu bertanya kepadanya, \"Siapa nama anakmu?\" ia menjawab, \"Aziz.\" Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Jangan kamu menamainya Aziz, tetapi namailah ia Abdurrahman.\" Kemudian beliau bersabda: \"Sesungguhnya sebaik-baik nama adalah Abdullah, Abdurrahman dan Al Harits.\""
            },
            {
                "number": 1633,
                "arab": "حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ حَدَّثَنَا زِيَادٌ أَوْ عَبَّادٌ عَنْ الْحَجَّاجِ عَنْ عُمَيْرِ بْنِ سَعِيدٍ عَنْ سَبْرَةَ بْنِ أَبِي سَبْرَةَ عَنْ أَبِيهِأَنَّهُ أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا وَلَدُكَ قَالَ فُلَانُ وَفُلَانُ وَعَبْدُ الْعُزَّى فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ عَبْدُ الرَّحْمَنِ إِنَّ أَحَقَّ أَسْمَائِكُمْ أَوْ مِنْ خَيْرِ أَسْمَائِكُمْ إِنْ سَمَّيْتُمْ عَبْدَ اللَّهِ وَعَبْدُ الرَّحْمَنِ وَالْحَارِثَ",
                "id": "Telah menceritakan kepada kami [Suraij bin Nu'man] Telah menceritakan kepada kami [Ziyad] atau [Abbad] dari [Hajjaj] dari [Umair bin Sa'id] dari [Sabrah bin Abu Sabrah] dari [Bapaknya], bahwa ia pernah datang menemui Nabi shallallahu 'alaihi wasallam, beliau lalu bertanya, \"Siapa nama anakmu?\" ia menjawab, \"Fulan, Fulan dan Abdul Uzza.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ia adalah Abdurrahman. Sesungguhnya nama yang paling berhak untuk kalian pakai, atau sebaik-baik nama untuk kalian pakai adalah Abdullah, Abdurrahman dan Al Harits.\""
            },
            {
                "number": 1634,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا يُونُسُ عَنْ أَبِي إِسْحَاقَ عَنْ خَيْثَمَةَ قَالَوَلَدَ جَدِّي غُلَامًا فَسَمَّاهُ عَزِيزًا فَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ وُلِدَ لِي غُلَامٌ قَالَ فَمَا سَمَّيْتَهُ قَالَ قُلْتُ عَزِيزًا قَالَ لَا بَلْ هُوَ عَبْدُ الرَّحْمَنِقَالَ أَبِي فَهُوَ",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] Telah menceritakan kepada kami [Yunus] dari [Abu Ishaq] dari [Haitsamah] ia berkata, \"Kakekku mempunyai seorang anak, lalu ia memberikannya nama Aziz. Kemudian ia menemui Nabi shallallahu 'alaihi wasallam dan berkata, \"Seorang anak telah dilahirkan untukku.\" Beliau bertanya: \"Dengan apa kamu menamainya?\" Aku berkata, \"Aziz.\" Berliau bersabda: \"Tidak, akan tetapi ia adalah Abdurrahman.\" Bapakku berkata, \"Maka itulah namanya.\""
            },
            {
                "number": 1635,
                "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ سَعِيدٍ الْجُرَيْرِيِّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ حَنْظَلَةَ التَّمِيمِيِّ الْأُسَيْدِيِّ الْكَاتِبِ قَالَكُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْنَا الْجَنَّةَ وَالنَّارَ حَتَّى كَأَنَّا رَأْيَ عَيْنٍ فَأَتَيْتُ أَهْلِي وَوَلَدِي فَضَحِكْتُ وَلَعِبْتُ وَذَكَرْتُ الَّذِي كُنَّا فِيهِ فَخَرَجْتُ فَلَقِيتُ أَبَا بَكْرٍ فَقُلْتُ نَافَقْتُ نَافَقْتُ فَقَالَ إِنَّا لَنَفْعَلُهُ فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ يَا حَنْظَلَةُ لَوْ كُنْتُمْ تَكُونُونَ كَمَا تَكُونُونَ عِنْدِي لَصَافَحَتْكُمْ الْمَلَائِكَةُ عَلَى فُرُشِكُمْ أَوْ فِي طُرُقِكُمْ أَوْ كَلِمَةً نَحْوَ هَذَا هَكَذَاقَالَ هُوَ يَعْنِي سُفْيَانَ يَا حَنْظَلَةُ سَاعَةً وَسَاعَةً",
                "id": "Telah menceritakan kepada kami [Abu Nu'aim] Telah menceritakan kepada kami [Sufyan] dari [Sa'id Al Jurairi] dari [Abu Utsman An Nahdi] dari [Hanzhalah At Tamimi Al Usaidi Al katib] ia berkata, \"Kami berada di sisi Rasulullah shallallahu 'alaihi wasallam, lalu beliau menuturkan kepada kami tentang surga dan neraka hingga seolah-olah kami melihatnya dengan pandangan mata. Setelah itu aku mendatangi keluarku dan anak-anakku hingga aku pun tertawa dan bermain-main. Lantas aku teringat akan peristiwa yang kami alami (ketika bersama Rasulullah), maka aku pun keluar dan menemui dengan Abu Bakar. Aku berkata, \"Aku telah berlaku munafik, aku telah berlaku munafik!\" Abu Bakar berkata, \"Sesungguhnya kita juga melakukannya.\" Maka aku mendatangi Nabi shallallahu 'alaihi wasallam, kemudian aku ceritakan hal itu kepada beliau. Beliau pun bersabda: \"Wahai Hanzhalah, sekiranya keadaan kalian adalah sebagaimana keadaan kalian saat bersamaku, niscaya para malaikat akan menyalami kalian di atas tempat tidur kalian atau di perjalanan kalian.\" Atau kalimat yang semisal dengan itu. Dan seperti inilah apa yang dikatakan oleh Sufyan, \"Wahai Hanzhalah, sesaat dan sesaat.\""
            },
            {
                "number": 1636,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي الزِّنَادِ عَنْ الْمُرَقَّعِ بْنِ صَيْفِيِّ عَنْ حَنْظَلَةَ الْكَاتِبِ قَالَغَزَوْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَرَرْنَا عَلَى امْرَأَةٍ مَقْتُولَةٍ وَقَدْ اجْتَمَعَ عَلَيْهَا النَّاسُ قَالَ فَأَفْرَجُوا لَهُ فَقَالَ مَا كَانَتْ هَذِهِ تُقَاتَلُ ثُمَّ قَالَ لِرَجُلٍ انْطَلِقْ إِلَى خَالِدِ بْنِ الْوَلِيدِ فَقُلْ لَهُ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُكَ أَنْ لَا تَقْتُلَ ذُرِّيَّةً وَلَا عَسِيفًاحَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ قَالَ أَخْبَرَنِي الْمُرَقَّعُ بْنُ صَيْفِيِّ بْنِ رَبَاحٍ أَخِي حَنْظَلَةَ الْكَاتِبِ قَالَ أَخْبَرَنِي جَدِّي أَنَّهُ خَرَجَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ الْحَدِيثَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْعَبَّاسِ حَدَّثَنَا ابْنُ أَبِي الزِّنَادِ عَنْ أَبِي الزِّنَادِ قَالَ أَخْبَرَنِي الْمُرَقَّعُ بْنُ صَيْفِيِّ بْنِ رَبَاحٍ أَنَّ جَدَّهُ رَبَاحَ بْنَ رَبِيعٍ أَخْبَرَهُ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Sufyan] dari [Abu Ziyad] dari [Muraqqa' bin Shaifi] dari [Hanzhalah Al Katib] ia berkata, \"Kami pernah berperang bersama Nabi shallallahu 'alaihi wasallam lalu kami melewati seorang wanita yang terbunuh sementara manusia telah mengerumuninya, orang-orang lalu membukakan jalan untuk beliau. Beliau kemudian bersabda: \"Bukan ini yang akan kita perangi.\" Kemudian beliau berkata kepada seorang laki-laki: \"Pergilah kepada Khalid bin Walid dan katakan padanya, 'Sesungguhnya Rasulullah shallallahu 'alaihi wasallam memerintahkanmu untuk tidak membunuh Dzurriyah (para wanita dan anak-anak) dan Al Asif (para pelayan).'\" Telah menceritakan kepada kami [Husain bin Muhammad] Telah menceritakan kepada kami [Ibnu Abu Zinad] dari [Bapaknya] ia berkata, telah mengabarkan kepadaku [Al Muraqqa' bin Shaifi bin Rabah Akhi Hanzhalah Al Katib] ia berkata, \"Kakakku mengabarkan kepadaku bahwa ia pernah keluar bersama Rasulullah shallallahu 'alaihi wasallam…lalu ia menyebutkan hadits tersebut.\" Telah menceritakan kepada kami Ibrahim bin Abul Abas Telah menceritakan kepada kami [Ibnu Abu Zinad] dari [Abu Zinad] ia berkata, telah mengabarkan kepadaku [Al Muraqqa' bin Shaifi bin Rabah] bahwa kakeknya [Rabah bin Rabi'] telah mengabarkan kepadanya…lalu ia menyebutkan hadits tersebut.\""
            },
            {
                "number": 1637,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ هِشَامِ بْنِ عُرْوَةَ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ فُلَانِ بْنِ عَمْرِو بْنِ أُمَيَّةَ عَنْ أَبِيهِ قَالَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَلَ لَحْمًا أَوْ عَرْقًا فَلَمْ يُمَضْمِضْ وَلَمْ يَمَسَّ مَاءً فَصَلَّى",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Hisyam bin Urwah] ia berkata, telah menceritakan kepadaku [Az Zuhri] dari [Fulan bin Amru bin Umayyah] dari [Bapaknya] ia berkata, \"Aku pernah melihat Nabi shallallahu 'alaihi wasallam makan daging kemudian beliau tidak berkumur-kumur dan tidak pula menyentuh air, setelah itu beliau sholat.\""
            },
            {
                "number": 1638,
                "arab": "حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ حَدَّثَنَا ابْنُ شِهَابٍ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ عَنْ أَبِيهِ أَنَّهُرَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْكُلُ مِنْ كَتِفٍ يَحْتَزُّ مِنْهَا ثُمَّ دُعِيَ إِلَى الصَّلَاةِ فَصَلَّى وَلَمْ يَتَوَضَّأْ",
                "id": "Telah menceritakan kepada kami [Abu Kamil] Telah menceritakan kepada kami [Ibrahim bin Sa'd] Telah menceritakan kepada kami [Ibnu Syihab] dari [Ja'far bin Amru bin Umayyah Adl Dlamari] dari [Bapaknya], bahwa ia pernah melihat Nabi shallallahu 'alaihi wasallam makan bahu kambing yang beliau potong darinya, lalu beliau diseru untuk menunaikan sholat, maka beliau pun sholat tanpa berwudlu terlebih dahulu.\""
            },
            {
                "number": 1639,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْسَحُ عَلَى الْخُفَّيْنِ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] Telah menceritakan kepada kami [Ma'mar] dari [Yahya bin Abu Katsir] dari [Abu Salamah bin Abdurrahman] dari [Amr bin Umayyah Adl Dlamri] ia berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam mengusap khuf.\""
            },
            {
                "number": 1640,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ الْيَمَامِيُّ عَنْ أَبِي سَلَمَةَ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ عَنْ أَبِيهِ أَنَّهُرَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْسَحُ عَلَى الْخُفَّيْنِ وَالْعِمَامَةِ",
                "id": "Telah menceritakan kepada kami [Abul Mughirah] Telah menceritakan kepada kami [Al Auza'i] Telah menceritakan kepada kami [Yahya bin Abu Katsir Al Yamami] dari [Abu Salamah] dari [Ja'far bin Amru bin Umayyah Adl Dlamri] dari [Bapaknya], bahwa ia pernah melihat Nabi shallallahu 'alaihi wasallam mengusap khuf dan Imamah (sejenis surban penutup kepala).\""
            },
            {
                "number": 1641,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ هَمَّامٍ أَخُو عَبْدِ الرَّزَّاقِ قَالَ سَمِعْتُ مُحَمَّدَ بْنَ أَبِي حُمَيْدٍ الْمَدَنِيَّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ أُمَيَّةَ عَنْ أَبِيهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا أَعْطَى الرَّجُلُ امْرَأَتَهُ فَهُوَ صَدَقَةٌقَالَ أَبُو عَبْد الرَّحْمَنِ عَبْدُ الْوَهَّابِ بْنُ هَمَّامٍ أَخُو عَبْدِ الرَّزَّاقِ",
                "id": "Telah menceritakan kepada kami [Abdul Wahab bin Hammam] saudaranya Abdurrazaq, ia berkata, aku mendengar [Muhammad bin Abu Humaid Al Madani] ia berkata, Telah menceritakan kepada kami [Abdullah bin Amru bin Umayyah] dari [Bapaknya] ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apa yang diberikan oleh seorang laki-laki kepada isterinya adalah sedekah.\" 'Abu Abdurrahman Abdul Wahab bin Hammam adalah saudara Abdurrazaq."
            },
            {
                "number": 1642,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ جَعْفَرِ بْنِ أُمَيَّةَ الضَّمْرِيِّ عَنْ أَبِيهِأَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَزَّ مِنْ كَتِفٍ فَأَكَلَ فَأَتَاهُ الْمُؤَذِّنُ فَأَلْقَى السِّكِّينَ ثُمَّ قَامَ إِلَى الصَّلَاةِ وَلَمْ يَتَوَضَّأْ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] Telah menceritakan kepada kami [Ma'mar] dari [Zuhri] dari [Ja'far bin Umayyah Adl Dlamari] dari [Bapaknya], bahwa ia pernah melihat Rasulullah shallallahu 'alaihi wasallam memotong pundak kambing lalu beliau memakannya. Kemudian sang muadzdzin pun mengumandangkan adzan, maka beliau segera menanggalkan pisau dan beranjak menunaikan sholat sementara tidak lagi berwudlu.\""
            },
            {
                "number": 1643,
                "arab": "حَدَّثَنَا يُونُسُ حَدَّثَنَا أَبَانُ عَنْ يَحْيَى يَعْنِي ابْنَ أَبِي كَثِيرٍ قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ أُمَيَّةَ أَنَّ أَبَاهُ حَدَّثَهُأَنَّهُ أَبْصَرَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَمْسَحُ عَلَى الْخُفَّيْنِ",
                "id": "Telah menceritakan kepada kami [Yunus] Telah menceritakan kepada kami [Aban] dari [Yahya] -yakni Ibnu Abu Katsir- ia berkata, telah menceritakan kepadaku [Abu Salamah bin Abdurrahman] dari [Ja'far bin Amru bin Umayyah] bahwa [Bapaknya] menceritakan kepadanya, bahwa ia pernah melihat Rasulullah shallallahu 'alaihi wasallam mengusap kedua khufnya.\""
            },
            {
                "number": 1644,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ حَدَّثَنِي مَنْصُورٌ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا سُفْيَانُ وَزَائِدَةُ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنِ الْحَكَمِ بْنِ سُفْيَانَ أَوْ سُفْيَانَ بْنِ الْحَكَمِ قَالَ عَبْدُ الرَّحْمَنِ فِي حَدِيثِهِرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَالَ وَتَوَضَّأَ وَنَضَحَ فَرْجَهُ بِالْمَاءِ قَالَ يَحْيَى فِي حَدِيثِهِ إِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَالَ وَنَضَحَحَدَّثَنَا الْأَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا شَرِيكٌ قَالَ سَأَلْتُ أَهْلَ الْحَكَمِ بْنِ سُفْيَانَ فَذَكَرُوا أَنَّهُ لَمْ يُدْرِكْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو عَبْد الرَّحْمَنِ وَرَوَاهُ شُعْبَةُ وَوُهَيْبٌ عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ الْحَكَمِ بْنِ سُفْيَانَ عَنْ أَبِيهِ أَنَّهُ رَأَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ و قَالَ غَيْرُهُمَا عَنْ مَنْصُورٍ عَنْ مُجَاهِدٍ عَنْ الْحَكَمِ بْنِ سُفْيَانَ قَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] telah menceritakan kepadaku [Manshur] dan [Abdurrahman bin Mahdi] ia berkata, Telah menceritakan kepada kami [Sufyan] dan [Zaidah] dari [Manshur] dari [Mujahid] dari [Al Hakam bin Sufyan] atau [Sufyan bin Al Hakam], [Abdurrahman] menyebutkan dalam haditsnya, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam buang air kecil, lalu beliau berwudlu dan memercikkan air pada kemaluannya.\" Yahya menyebutkan dalam haditsnya, bahwa Nabi shallallahu 'alaihi wasallam buang air kecil, lalu beliau berwudlu dan memercikkan air pada kemaluannya.\" Telah menceritakan kepada kami Al Aswad bin Amir Telah menceritakan kepada kami Syarik ia berkata, \"Aku bertanya kepada keluarga Al Hakam bin Sufyan, lalu mereka menyebutkan bahwa ia belum pernah bertemu dengan Nabi shallallahu 'alaihi wasallam.\" Abu Abdurrahman berkata, \" [Syu'bah] dan [Wuhaib] menceritakannya dari [Manshur] dari [Mujahid] dari [Al Hakam bin Sufyan] dari [Bapaknya], bahwa ia pernah melihat Nabi shallallahu 'alaihi wasallam.\" Dan selain keduanya juga telah menceritakan dari [Manshur] dari [Mujahid] dari [Al Hakam bin Sufyan] ia berkata, \"Aku melihat Nabi shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 1645,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو أَبُو عَامِرٍ قَالَ حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ قَالَ حَدَّثَنَا قَيْسُ بْنُ بِشْرٍ التَّغْلِبِيُّ قَالَ أَخْبَرَنِي أَبِي وَكَانَ جَلِيسًا لِأَبِي الدَّرْدَاءِ قَالَكَانَ بِدِمَشْقَ رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقَالُ لَهُ ابْنُ الْحَنْظَلِيَّةِ وَكَانَ رَجُلًا مُتَوَحِّدًا قَلَّمَا يُجَالِسُ النَّاسَ إِنَّمَا هُوَ فِي صَلَاةٍ فَإِذَا فَرَغَ فَإِنَّمَا يُسَبِّحُ وَيُكَبِّرُ حَتَّى يَأْتِيَ أَهْلَهُ فَمَرَّ بِنَا يَوْمًا وَنَحْنُ عِنْدَ أَبِي الدَّرْدَاءِ فَقَالَ لَهُ أَبُو الدَّرْدَاءِ كَلِمَةً تَنْفَعُنَا وَلَا تَضُرُّكَ قَالَ بَعَثَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَرِيَّةً فَقَدِمْتُ فَجَاءَ رَجُلٌ مِنْهُمْ فَجَلَسَ فِي الْمَجْلِسِ الَّذِي فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لِرَجُلٍ إِلَى جَنْبِهِ لَوْ رَأَيْتَنَا حِينَ الْتَقَيْنَا نَحْنُ وَالْعَدُوَّ فَحَمَلَ فُلَانٌ فَطَعَنَ فَقَالَ خُذْهَا وَأَنَا الْغُلَامُ الْغِفَارِيُّ كَيْفَ تَرَى فِي قَوْلِهِ قَالَ مَا أُرَاهُ إِلَّا قَدْ أَبْطَلَ أَجْرَهُ فَسَمِعَ ذَلِكَ آخَرُ فَقَالَ مَا أَرَى بِذَلِكَ بَأْسًا فَتَنَازَعَا حَتَّى سَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ سُبْحَانَ اللَّهِ لَا بَأْسَ أَنْ يُحْمَدَ وَيُؤْجَرَقَالَ فَرَأَيْتُ أَبَا الدَّرْدَاءِ سُرَّ بِذَلِكَ وَجَعَلَ يَرْفَعُ رَأْسَهُ إِلَيْهِ وَيَقُولُ آنْتَ سَمِعْتَ ذَلِكَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَقُولُ نَعَمْ فَمَا زَالَ يُعِيدُ عَلَيْهِ حَتَّى إِنِّي لَأَقُولُ لَيَبْرُكَنَّ عَلَى رُكْبَتَيْهِ",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin Amru Abu Amir] ia berkata, Telah menceritakan kepada kami [Hisyam bin Sa'd] Telah menceritakan kepada kami [Qais bin Bisyr At Taghlibi] ia berkata, telah mengabarkan kepadaku [Bapakku] -ia pernah duduk dalam majlis Abu Darda- Ia berkata, \"Di Damaskus ada seorang laki-laki yang termasuk sahabat Nabi shallallahu 'alaihi wasallam, laki-laki itu biasa dipanggil dengan [Ibnu Al Hanzhaliyyah]. Ia adalah seorang yang suka menyendiri, tidak suka duduk bersama manusia. Aktivitasnya hanya sholat, jika telah selesai ia membaca tasbih dan takbir hingga ia kembali mendatangi keluarganya. Suatu harilaki-laki itu lewat saat kami sedang bersama Abu Darda, lalu Abu Darda berkata kepdanya, \"(Kami berharap darimu) satu kata yang bermanfaat bagi kami dan tidak memberikan mudlarat kepadamu.\" Laki-laki itu pun berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengutus kami dalam salah satu ekspedisi. Ketika kami telah tiba (di Madinah), lalu datanglah seorang laki-laki dari orang-orang yang pernah ikut dalam ekspedisi tersebut, ia lalu duduk di majelis yang di situ ada Rasulullah shallallahu 'alaihi wasallam. Lelaki itu lantas berkata kepada orang yang ada di sampingnya, \"Sekiranya kamu melihat saat kami dan pasukan musuh berhadap-hadapan! Laki-laki itu lantas menikam musuhnya, lalu ia berkata, \"Maju dan hadapilah aku, aku adalah pangeran dari Al Ghifari.' Bagaimana pendapatmu terkait dengan perkataannya?\" ia menjawab, \"Aku tidak berpendapat, kecuali pahala amalannya telah batal.\" Dan orang lain yang mendengar hal itu berkata, \"Menurutku hal itu tidaklah mengapa.\" Maka mereka pun saling berbantah-bantahan, hingga Nabi shallallahu 'alaihi wasallam mendengarnya, beliau bersabda: \"Subhanallah, tidaklah mengapa, bahkan ia dipuji dan diberi ganjaran pahala.\" Bisyr At Taghlibi berkata, \"Aku lihat Abu Darda gembira riang akan hal itu dan ia pun mengangkat kepalanya kepada Al Hanzhaliyyah, lalu berkata, \"Kamu yang mendengar hadits itu dari Rasulullah shallallahu 'alaihi wasallam?\" Laki-laki sahabat Nabi itu menjawab, \"Ya, benar.\" Abu Darda selalu mengulangi pertanyaannya hingga aku berkata, \"Sungguh ia akan jatuh di atas dua lututnya.\""
            },
            {
                "number": 1646,
                "arab": "قَالَثُمَّ مَرَّ بِنَا يَوْمًا آخَرَ فَقَالَ لَهُ أَبُو الدَّرْدَاءِ كَلِمَةً تَنْفَعُنَا وَلَا تَضُرُّكَ قَالَ قَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ النَّفَقَةَ عَلَى الْخَيْلِ فِي سَبِيلِ اللَّهِ كَبَاسِطِ يَدِهِ بِالصَّدَقَةِ لَا يَقْبِضُهَا",
                "id": "Masih melalui jalur periwayatan yang sama seperti hadits sebelumnya, dari [Sahal bin Amru]; berkata, \"Kemudian pada hari yang lain, (Ibnu Hanzhaliyah) melewati kami, maka Abu Darda berkata kepadanya, \"(Berbicalah) satu kata yang bermanfaat bagi kami dan tidak memberikan mudlarat kepadamu.\" Ibnu Hanzhaliyah berkata, \"Rasulullah shallallahu 'alaihi wasallam telah berkata kepada kami: 'Sesungguhnya memberi nafkah kepada kuda di jalan Allah seperti seseorang yang membentangkan tangannya untuk sedekah dan tidak pernah menahannya.\""
            },
            {
                "number": 1647,
                "arab": "قَالَثُمَّ مَرَّ بِنَا يَوْمًا آخَرَ فَقَالَ لَهُ أَبُو الدَّرْدَاءِ كَلِمَةً تَنْفَعُنَا وَلَا تَضُرُّكَ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نِعْمَ الرَّجُلُ خُرَيْمٌ الْأَسَدِيُّ لَوْلَا طُولُ جُمَّتِهِ وَإِسْبَالُ إِزَارِهِ فَبَلَغَ ذَلِكَ خُرَيْمًا فَجَعَلَ يَأْخُذُ شَفْرَةً يَقْطَعُ بِهَا شَعَرَهُ إِلَى أَنْصَافِ أُذُنَيْهِ وَرَفَعَ إِزَارَهُ إِلَى أَنْصَافِ سَاقَيْهِقَالَ فَأَخْبَرَنِي أَبِي قَالَ دَخَلْتُ بَعْدَ ذَلِكَ عَلَى مُعَاوِيَةَ فَإِذَا عِنْدَهُ شَيْخٌ جُمَّتُهُ فَوْقَ أُذُنَيْهِ وَرِدَاؤُهُ إِلَى سَاقَيْهِ فَسَأَلْتُ عَنْهُ فَقَالُوا هَذَا خُرَيْمٌ الْأَسَدِيُّ",
                "id": "Masih melalui jalur periwayatan yang sama seperti hadits sebelumnya, dari [Sahal bin Amru]; berkata, \"Kemudian pada hari yang lain, (Ibnu Hanzhaliyah) melewati kami, maka Abu Darda berkata kepadanya, \"(Berbicalah) satu kata yang bermanfaat bagi kami dan tidak memberikan mudlarat kepadamu.\" Ibnu Hanzhaliyah berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya bukan karena rambutnya yang panjang hingga bahu dan kain sarungnya yang isbal, maka sebaik-baik lelaki adalah Khuraim Al Asadi.\" Maka hal itu pun sampai kepada Khuraim, sehingga ia pun mengambil gunting dan memangkas rambutnya hingga pertengahan kedua telinganya dan memotong kainnya hingga setengah betisnya. Ia berkata, \"Bapakku mengabarkan kepadaku, ia mengatakan, \"Setelah itu aku menemui Mu'awiyah, ternyata di sisinya ada seorang syaikh yang panjang rambutnya di atas kedua telinganya, sedangkan kainnya terangkat hingga pertengahan kedua betisnya. Maka aku pun bertanya siapakah ia, orang-orang menjawab, \"Ini adalah Khuraim Al Asadi.\""
            },
            {
                "number": 1648,
                "arab": "قَالَثُمَّ مَرَّ بِنَا يَوْمًا آخَرَ وَنَحْنُ عِنْدَ أَبِي الدَّرْدَاءِ فَقَالَ لَهُ أَبُو الدَّرْدَاءِ كَلِمَةً تَنْفَعُنَا وَلَا تَضُرُّكَ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّكُمْ قَادِمُونَ عَلَى إِخْوَانِكُمْ فَأَصْلِحُوا رِحَالَكُمْ وَأَصْلِحُوا لِبَاسَكُمْ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ لَا يُحِبُّ الْفُحْشَ وَلَا التَّفَحُّشَ",
                "id": "Masih melalui jalur periwayatan yang sama seperti hadits sebelumnya, dari [Sahal bin Amru]; \"Kemudian pada hari yang lain, (Ibnu Hanzhaliyah) melewati kami, dan saat itu kami sedang berada di sisi Abu Dardaa. Abu Darda lalu berkata kepadanya, \"(Berbicalah) satu kata yang bermanfaat bagi kami dan tidak memberikan mudlarat kepadamu.\" Ibnu Hanzhaliyah lantas berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya kalian akan mendatangi saudara-saudara kalian, maka perbaikilah kendaraan dan perbaguslah pakaian kalian, karena Allah 'azza wajalla tidak menyukai perbuatan keji dan tidak pula kata-kata kotor.\""
            },
            {
                "number": 1649,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا مُعَاوِيَةُ يَعْنِي ابْنَ صَالِحٍ عَنْ سُلَيْمَانَ أَبِي الرَّبِيعِ قَالَ أَبِي هُوَ سُلَيْمَانُ بْنُ عَبْدِ الرَّحْمَنِ الَّذِي رَوَى عَنْهُ شُعْبَةُ وَلَيْثُ بْنُ سَعْدٍ عَنْ الْقَاسِمِ مَوْلَى مُعَاوِيَةَ قَالَدَخَلْتُ مَسْجِدَ دِمَشْقَ فَرَأَيْتُ أُنَاسًا مُجْتَمِعِينَ وَشَيْخًا يُحَدِّثُهُمْ قُلْتُ مَنْ هَذَا قَالُوا سَهْلُ ابْنُ الْحَنْظَلِيَّةِ فَسَمِعْتُهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَكَلَ لَحْمًا فَلْيَتَوَضَّأْ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] ia berkata, Telah menceritakan kepada kami [Mu'awiyah bin Shalih] dari [Sulaiman Abu Ar Rabi'], -Bapakku berkata; ia adalah Sulaiman bin Abdurrahman yang telah meriwayatkan darinya Syu'bah dan Laits- dari [Al Qasim] budaknya Mu'awiyah, ia berkata, \"Ketika masuk masjid Damaskus, aku melihat orang-orang sedang berkumpul, sementara dan seorang Syaikh sedang menceritakan (hadits) kepada mereka. Aku lantas bertanya, \"Siapa orang ini?\" mereka menjawab, \" [Sahal bin Al Hanzhaliyyah].\" Kemudian aku mendengar ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa makan daging hendaklah ia berwudlu.\""
            },
            {
                "number": 1650,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ حَدَّثَنِي قَيْسُ بْنُ بِشْرٍ التَّغْلِبِيُّ عَنْ أَبِيهِ وَكَانَ جَلِيسًا لِأَبِي الدَّرْدَاءِ بِدِمَشْقَ قَالَكَانَ بِدِمَشْقَ رَجُلٌ يُقَالُ لَهُ ابْنُ الْحَنْظَلِيَّةِ مُتَوَحِّدًا لَا يَكَادُ يُكَلِّمُ أَحَدًا إِنَّمَا هُوَ فِي صَلَاةٍ فَإِذَا فَرَغَ يُسَبِّحُ وَيُكَبِّرُ وَيُهَلِّلُ حَتَّى يَرْجِعَ إِلَى أَهْلِهِ قَالَ فَمَرَّ عَلَيْنَا ذَاتَ يَوْمٍ وَنَحْنُ عِنْدَ أَبِي الدَّرْدَاءِ فَقَالَ لَهُ أَبُو الدَّرْدَاءِ كَلِمَةً مِنْكَ تَنْفَعُنَا وَلَا تَضُرُّكَ قَالَ بَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَرِيَّةٍ فَلَمَّا أَنْ قَدِمْنَا جَلَسَ رَجُلٌ مِنْهُمْ فِي مَجْلِسٍ فِيهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ يَا فُلَانُ لَوْ رَأَيْتَ فُلَانًا طَعَنَ ثُمَّ قَالَ خُذْهَا وَأَنَا الْغُلَامُ الْغِفَارِيُّ فَمَا تَرَى قَالَ مَا أُرَاهُ إِلَّا قَدْ حَبِطَ أَجْرُهُ قَالَ فَتَكَلَّمُوا فِي ذَلِكَ حَتَّى سَمِعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصْوَاتَهُمْ فَقَالَ بَلْ يُحْمَدُ وَيُؤْجَرُقَالَ فَسُرَّ بِذَلِكَ أَبُو الدَّرْدَاءِ حَتَّى هَمَّ أَنْ يَجْثُوَ عَلَى رُكْبَتَيْهِ فَقَالَ آنْتَ سَمِعْتَهُ مِرَارًا قَالَ نَعَمْ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Hisyam bin Sa'dari] telah menceritakan kepadaku [Qais bin Bisyr At Taghlibi] dari [Bapaknya] ia pernah duduk di majlis Abu Darda di Damaskus. Ia berkata, \"Di Damaskus ada seorang laki-laki yang biasa dipanggil [Ibnu Hanzhaliyah], dia selalu menyendiri dan tidak mau berbincang-bincang dengan seorang pun. Perhatiannya hanya tertuju pada sholat, jika selesai dari sholatnya ia pun membaca tasbih, takbir dan tahlil hingga ia kembali kepada keluarganya. Kemudian pada suatu hari, ia melewati kami, dan saat itu kami sedang berada di sisi Abu Darda. Lalu Abu Darda berkata kepadanya, \"(Kami berharap) satu kata darimu, yang mana kata itu bermanfaat bagi kami dan tidak membahayakanmu.\" Laki-laki itu berkata, \"Rasulullah shallallahu 'alaihi wasallam pernah mengutus kami dalam suatu ekspedisi. Ketika kami kembali, seorang laki-laki dari mereka duduk dalam majelis di tempat dimana Rasulullah shallallahu 'alaihi wasallam duduk. Orang itu kemudian berkata, \"Wahai Fulan, jika kamu melihat si Fulan menikam musuh lalu ia berkata, 'Hadapilah aku, aku adalah seorang Al Ghifari.' Bagaimanakah pendapatmu?\" ia menjawa, \"Sungguh, ganjaran pahalanya akan terhapus.\" Al Hanzhaliyyah berkata, \"Maka mereka pun berdiskusi mengenai hal itu hingga Nabi shallallahu 'alaihi wasallam mendengar suara mereka, beliau lalu bersabda: \"Bahkan si Fulan itu akan dipuji dan diberi ganjarang pahala.\" Mendengar itu, Abu Darda pun gembira hingga ia ingin duduk di atas lututnya, kemudian bertanya, \"Apakah kamu mendengarnya?\" ia ulangi pertanyaan itu berulang-ulang, Al Hanzhaliyyah menjawab, \"Ya.\""
            },
            {
                "number": 1651,
                "arab": "ثُمَّ مَرَّ عَلَيْنَا يَوْمًا آخَرَ فَقَالَ أَبُو الدَّرْدَاءِ كَلِمَةً تَنْفَعُنَا وَلَا تَضُرُّكَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ نِعْمَ الرَّجُلُ خُرَيْمٌ الْأَسَدِيُّ لَوْ قَصَّ مِنْ شَعَرِهِ وَقَصَّرَ إِزَارَهُفَبَلَغَ ذَلِكَ خُرَيْمًا فَعَجَّلَ فَأَخَذَ الشَّفْرَةَ فَقَصَّرَ مِنْ جُمَّتِهِ وَرَفَعَ إِزَارَهُ إِلَى أَنْصَافِ سَاقَيْهِ قَالَ أَبِي فَدَخَلْتُ عَلَى مُعَاوِيَةَ فَرَأَيْتُ رَجُلًا مَعَهُ عَلَى السَّرِيرِ شَعَرُهُ فَوْقَ أُذُنَيْهِ مُؤْتَزِرًا إِلَى أَنْصَافِ سَاقَيْهِ قُلْتُ مَنْ هَذَا قَالُوا خُرَيْمٌ الْأَسَدِيُّ",
                "id": "Masih melalui jalur periwayatan yang sama seperti hadits sebelumnya, dari [Sahal bin Amru]; Kemudian (Ibnu Al Hanzhliyyah) melewati kami pada hari yang lain, Abu Darda lalu berkata, \"(Berbicalah) meskipun hanya satu kata yang kata itu bermanfaat bagi kami dan tidak menimbulkan mudlarat bagimu.\" Ibnu Al Hanzhaliyyah berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik lelaki adalah Khuraim Al Asadi, jika ia memendekkan rambut dan kain sarungnya.\" Ucapan itu akhirnya kepada Khuraim, maka ia segera mengambil gunting dan memotong rambutnya dan meninggikan kainnya hingga setengah betisnya. Bapakku berkata, \"Saat aku menemui Mu'awiyah, aku mendapati seseorang bersamanya di atas kasur, rambutnya (dipangkas) hingga di atas kedua telinganya dan memakai kain hingga pertengahan betisnya, maka aku pun bertanya, \"Siapakah ini?\" mereka menjawab, \"Ia adalah Khuraim Al Asadi.\""
            },
            {
                "number": 1652,
                "arab": "قَالَثُمَّ مَرَّ عَلَيْنَا يَوْمًا آخَرَ فَقَالَ أَبُو الدَّرْدَاءِ كَلِمَةً مِنْكَ تَنْفَعُنَا وَلَا تَضُرُّكَ قَالَ نَعَمْ كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَنَا إِنَّكُمْ قَادِمُونَ عَلَى إِخْوَانِكُمْ فَأَصْلِحُوا رِحَالَكُمْ وَلِبَاسَكُمْ حَتَّى تَكُونُوا فِي النَّاسِ كَأَنَّكُمْ شَامَةٌ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ لَا يُحِبُّ الْفُحْشَ وَلَا التَّفَحُّشَ",
                "id": "Masih melalui jalur periwayatan yang sama seperti hadits sebelumnya, dari [Sahal bin Amru];  berkata, \"Kemudian pada hari yang lain, (Ibnu Hanzhaliyah) melewati kami, lalu Abu Darda berkata kepadanya, \"(Berbicalah) satu kata yang bermanfaat bagi kami dan tidak memberikan mudlarat kepadamu.\" Ibnu Hanzhaliyah menjawab, \"Baik. Suatu ketika kami sedang bersama Rasulullah shallallahu 'alaihi wasallam, beliau lalu bersabda kepada kami: \"Sesungguhnya kalian akan menemui saudara-saudara kalian, maka perbaikilah kendaraan dan pakaian kalian hingga kalian berada di tengah-tengah manusia dalam keadaan indah. Sesungguhnya Allah 'azza wajalla tidak menyukai sesuatu yang keji atau melakukan perbuatan kotor dan keji.\""
            },
            {
                "number": 1653,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنِي الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ قَالَ حَدَّثَنِي رَبِيعَةُ بْنُ يَزِيدَ حَدَّثَنِي أَبُو كَبْشَةَ السَّلُولِيُّ أَنَّهُ سَمِعَ سَهْلَ ابْنَ الْحَنْظَلِيَّةِ الْأَنْصَارِيَّ صَاحِبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَأَنَّ عُيَيْنَةَ والْأَقْرَعَ سَأَلَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا فَأَمَرَ مُعَاوِيَةَ أَنْ يَكْتُبَ بِهِ لَهُمَا فَفَعَلَ وَخَتَمَهَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَمَرَ بِدَفْعِهِ إِلَيْهِمَا فَأَمَّا عُيَيْنَةُ فَقَالَ مَا فِيهِ قَالَ فِيهِ الَّذِي أُمِرْتُ بِهِ فَقَبَّلَهُ وَعَقَدَهُ فِي عِمَامَتِهِ وَكَانَ أَحْكَمَ الرَّجُلَيْنِ وَأَمَّا الْأَقْرَعُ فَقَالَ أَحْمِلُ صَحِيفَةً لَا أَدْرِي مَا فِيهَا كَصَحِيفَةِ الْمُتَلَمِّسِ فَأَخْبَرَ مُعَاوِيَةُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِقَوْلِهِمَا وَخَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَاجَةٍ فَمَرَّ بِبَعِيرٍ مُنَاخٍ عَلَى بَابِ الْمَسْجِدِ مِنْ أَوَّلِ النَّهَارِ ثُمَّ مَرَّ بِهِ آخِرَ النَّهَارِ وَهُوَ عَلَى حَالِهِ فَقَالَ أَيْنَ صَاحِبُ هَذَا الْبَعِيرِ فَابْتُغِيَ فَلَمْ يُوجَدْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اتَّقُوا اللَّهَ فِي هَذِهِ الْبَهَائِمِ ثُمَّ ارْكَبُوهَا صِحَاحًا وَارْكَبُوهَا سِمَانًا كَالْمُتَسَخِّطِ آنِفًا إِنَّهُ مَنْ سَأَلَ وَعِنْدَهُ مَا يُغْنِيهِ فَإِنَّمَا يَسْتَكْثِرُ مِنْ نَارِ جَهَنَّمَ قَالُوا يَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا يُغْنِيهِ قَالَ مَا يُغَدِّيهِ أَوْ يُعَشِّيهِ",
                "id": "Telah menceritakan kepada kami [Ali bin Abdullah] telah menceritakan kepadaku [Al Walid bin Muslim] telah menceritakan kepadaku [Abdurrahman bin Yazid bin Jabir] ia berkata, telah menceritakan kepadaku [Rabi'ah bin Yazid] telah menceritakan kepadaku [Abu Kasybah As Saluli] bahwa ia telah mendengar [Sahl bin Al Hanzhaliyyah Al Anshari] salah seorang sahabat Rasulullah shallallahu 'alaihi wasallam, bahwa Uyainah dan Al Aqra' bertanya sesuatu kepada Rasulullah shallallahu 'alaihi wasallam. Maka beliau memerintahkan Mu'awiyah menulis untuk (diserahkan pada) keduanya, Mu'awiyah kemudian menulisnya lalu distempel oleh Rasulullah shallallahu 'alaihi wasallam. Setelah itu beliau memerintahkan agar surat dikirim kepada keduanya. Berkenaan dengan surat yang akan dikirim kepada Uyainah, Uyainah bertanya, \"Apa di dalamnya?\" Mu'awiyah menjawab, \"Di dalamnya terdapat sesuatu yang aku diperintah untuk melakukannya.\" Maka Uyainah pun menciumnya seraya mengikatkannya dalam imamahnya, dan Uyainah adalah orang paling adil dari kedua laki-laki itu (dari Al Aqra'). Adapun berkenaan dengan surat yang dikirim untuk Al Aqra', maka A Aqra' pun berkata, \"Aku membawa lembaran, tetapi aku sendiri tidak tahu apa yang tertulis di dalamnya, seperti lembaran Al Mutalammis.\" Mu'awiyah kemudian mengabarkan komentar keduanya kepada Rasulullah shallallahu 'alaihi wasallam. Kemudian Rasulullah shallallahu 'alaihi wasallam keluar untuk menunaikan hajatnya, lalu beliau melewati seekor unta yang sedang menderum di depan pintu Masjid sejak awal hari. Kemudian beliau melewatinya lagi saat waktu telah senja, dan unta itu tetap menderum di tempatnya. Maka beliau bertanya: \"Di manakah pemilik unta ini?\" beliau mencarinya namun tidak menemukan pemiliknya. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Takutlah kalian kepada Allah berkenaan dengan binatang ini. Naikilah saat ia dalam keadaan sehat, dan kendarailah saat ia kekar (gemuk) sebagaimana yang tadi lagi mengabek. Dan sesungguhnya siapa meminta-minta sementara ia memiliki sesuatu yang dapat mencukupi kebutuhannya, maka sesungguhnya ia hanya menambah banyaknya api neraka jahannam.\" Para sahabat bertanya, \"Wahai Rasulullah, sesuatu apakah yang mencukupinya?\" beliau menjawab: \"Sesuatu yang dapat ia komsumsi untuk makan siang dan makan malamnya.\""
            },
            {
                "number": 1654,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى حَدَّثَنَا عَبْدُ اللَّهِ بْنُ لَهِيعَةَ حَدَّثَنَا عَيَّاشُ بْنُ عَبَّاسٍ عَنْ شِيَيْمِ بْنِ بَيْتَانَ عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَأَنَّهُ قَالَ عَلَى الْمِنْبَرِ بِرُودِسَ حِينَ جَلَدَ الرَّجُلَيْنِ اللَّذَيْنِ سَرَقَا غَنَائِمَ النَّاسِ فَقَالَ إِنَّهُ لَمْ يَمْنَعْنِي مِنْ قَطْعِهِمَا إِلَّا أَنَّ بُسْرَ بْنَ أَرْطَأَةَ وَجَدَ رَجُلًا سَرَقَ فِي الْغَزْوِ يُقَالُ لَهُ مَصْدَرٌ فَجَلَدَهُ وَلَمْ يَقْطَعْ يَدَهُ وَقَالَ نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْقَطْعِ فِي الْغَزْوِ",
                "id": "Telah menceritakan kepada kami [Hasan bin Musa] Telah menceritakan kepada kami [Abdullah bin Lahi'ah] Telah menceritakan kepada kami [Ayyasy bin Abbas] dari [Syiyaim bin Baitan] dari [Junadah bin Abu Umayyah] bahwasanya ia pernah berkhutbh di atas mimbar di Rudis (nama tempat) saat ia mendera dua orang laki-laki yang mencuri ghanimah. Ia katakan, \"Sesungguhnya tidak ada sesuatu pun yang menghalangiku untuk memotong tangan keduanya, kecuali karena Yusra bin Arthah pernah mendapati seorang laki-laki yang bernama Mashdar mencuri dalam peperangan, namun ia hanya mendera dan tidak memotong tangannya. setelah itu ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang kami untuk memotong tangan dalam peperangan.\""
            },
            {
                "number": 1655,
                "arab": "حَدَّثَنَا عَتَّابُ بْنُ زِيَادٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ قَالَ أَخْبَرَنَا سَعِيدُ بْنُ يَزِيدَ قَالَ حَدَّثَنَا عَيَّاشُ بْنُ عَبَّاسٍ عَنْ شِيَيْمِ بْنِ بَيْتَانَ عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ قَالَكُنْتُ عِنْدَ بُسْرِ بْنِ أَرْطَأَةَ فَأُتِيَ بِمَصْدَرٍ قَدْ سَرَقَ بُخْتِيَّةً فَقَالَ لَوْلَا أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَانَا عَنْ الْقَطْعِ فِي الْغَزْوِ لَقَطَعْتُكَ فَجُلِدَ ثُمَّ خُلِّيَ سَبِيلُهُ",
                "id": "Telah menceritakan kepada kami [Attab bin Ziyad] ia berkata, Telah menceritakan kepada kami [Abdullah] ia berkata, Telah mengabarkan kepada kami [Sa'id bin Yazid] ia berkata, Telah menceritakan kepada kami [Ayyasy bin Abbas] dari [Syiyaim bin Baitan] dari [Junadah bin Abu Umayyah] ia berkata, \"Aku berada di sisi Busr bin Artha`ah. Kemudian di datangkanlah Mashdar yang telah mencuri Bukhtiyyah (Unta yang panjang lehernya), maka ia pun berkata, \"Seandainya saja aku tidak mendengar Rasulullah shallallahu 'alaihi wasallam bersabda melarang kami untuk memotong tangan saat terjadi peperangan, niscaya aku akan memotong tanganmu.\" Maka pencuri itu pun hanya didera lalu dibebaskan.\""
            },
            {
                "number": 1656,
                "arab": "حَدَّثَنَا هَيْثَمُ بْنُ خَارِجَةَ حَدَّثَنَا مُحَمَّدُ بْنُ أَيُّوبَ بْنِ مَيْسَرَةَ بْنِ حَلْبَسٍ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ بُسْرِ بْنِ أَرْطَاةَ الْقُرَشِيِّ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَدْعُو اللَّهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الْأُمُورِ كُلِّهَا وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الْآخِرَةِقَالَ عَبْد اللَّهِ وَسَمِعْتُهُ أَنَا مِنْ هَيْثَمٍ",
                "id": "Telah menceritakan kepada kami [Haitsam bin Kharijah] Telah menceritakan kepada kami [Muhammad bin Ayyub bin Maisarah bin Halbas] ia berkata, aku mendengar [Bapakku] menceritakan dari [Busr bin Artha`ah Al Qurasyi] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam berdo'a: \"ALLAHUMMA AHSIN 'AAQIBATANAA FIL UMUURI KULLIHAA, WA AJIRNAA MIN HIZYID DUNYAA WA 'ADZAABIL AAKHIRAH (Ya Allah, perbaikilah kesudahan dari amalan kami dalam setiap perkata seluruhnya. Dan peliharalah kami dari kehinaan dunia dan adzab akhirat).\" Abdullah berkata, \"Aku mendengarnya dari Haitsam.\""
            },
            {
                "number": 1657,
                "arab": "حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ أَبُو الْعَبَّاسِ الدِّمَشْقِيُّ بِمَكَّةَ إِمْلَاءً قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ قَالَ حَدَّثَنِي يَحْيَى بْنُ جَابِرٍ الطَّائِيُّ قَاضِي حِمْصَ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ جُبَيْرِ بْنِ نُفَيْرٍ الْحَضْرَمِيُّ عَنْ أَبِيهِ أَنَّهُ سَمِعَ النَّوَّاسَ بْنَ سَمْعَانَ الْكِلَابِيَّ قَالَذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الدَّجَّالَ ذَاتَ غَدَاةٍ فَخَفَّضَ فِيهِ وَرَفَّعَ حَتَّى ظَنَنَّاهُ فِي طَائِفَةِ النَّخْلِ فَلَمَّا رُحْنَا إِلَيْهِ عَرَفَ ذَلِكَ فِي وُجُوهِنَا فَسَأَلْنَاهُ فَقُلْنَا يَا رَسُولَ اللَّهِ ذَكَرْتَ الدَّجَّالَ الْغَدَاةَ فَخَفَّضْتَ فِيهِ وَرَفَّعْتَ حَتَّى ظَنَنَّاهُ فِي طَائِفَةِ النَّخْلِ قَالَ غَيْرُ الدَّجَّالِ أَخْوَفُنِي عَلَيْكُمْ فَإِنْ يَخْرُجْ وَأَنَا فِيكُمْ فَأَنَا حَجِيجُهُ دُونَكُمْ وَإِنْ يَخْرُجْ وَلَسْتُ فِيكُمْ فَامْرُؤٌ حَجِيجُ نَفْسِهِ وَاللَّهُ خَلِيفَتِي عَلَى كُلِّ مُسْلِمٍ إِنَّهُ شَابٌّ جَعْدٌ قَطَطٌ عَيْنُهُ طَافِيَةٌ وَإِنَّهُ يَخْرُجُ مِنْ خِلَّةٍ بَيْنَ الشَّامِ وَالْعِرَاقِ فَعَاثَ يَمِينًا وَشِمَالًا يَا عِبَادَ اللَّهِ اثْبُتُوا قُلْنَا يَا رَسُولَ اللَّهِ مَا لُبْثُهُ فِي الْأَرْضِ قَالَ أَرْبَعِينَ يَوْمًا يَوْمٌ كَسَنَةٍ وَيَوْمٌ كَشَهْرٍ وَيَوْمٌ كَجُمُعَةٍ وَسَائِرُ أَيَّامِهِ كَأَيَّامِكُمْ قُلْنَا يَا رَسُولَ اللَّهِ فَذَلِكَ الْيَوْمُ الَّذِي هُوَ كَسَنَةٍ أَيَكْفِينَا فِيهِ صَلَاةُ يَوْمٍ وَلَيْلَةٍ قَالَ لَا اقْدُرُوا لَهُ قَدْرَهُ قُلْنَا يَا رَسُولَ اللَّهِ فَمَا إِسْرَاعُهُ فِي الْأَرْضِ قَالَ كَالْغَيْثِ اسْتَدْبَرَتْهُ الرِّيحُ قَالَ فَيَمُرُّ بِالْحَيِّ فَيَدْعُوهُمْ فَيَسْتَجِيبُونَ لَهُ فَيَأْمُرُ السَّمَاءَ فَتُمْطِرُ وَالْأَرْضَ فَتُنْبِتُ وَتَرُوحُ عَلَيْهِمْ سَارِحَتُهُمْ وَهِيَ أَطْوَلُ مَا كَانَتْ ذُرًى وَأَمَدُّهُ خَوَاصِرَ وَأَسْبَغُهُ ضُرُوعًا وَيَمُرُّ بِالْحَيِّ فَيَدْعُوهُمْ فَيَرُدُّوا عَلَيْهِ قَوْلَهُ فَتَتْبَعُهُ أَمْوَالُهُمْ فَيُصْبِحُونَ مُمْحِلِينَ لَيْسَ لَهُمْ مِنْ أَمْوَالِهِمْ شَيْءٌ وَيَمُرُّ بِالْخَرِبَةِ فَيَقُولُ لَهَا أَخْرِجِي كُنُوزَكِ فَتَتْبَعُهُ كُنُوزُهَا كَيَعَاسِيبِ النَّحْلِ قَالَ وَيَأْمُرُ بِرَجُلٍ فَيُقْتَلُ فَيَضْرِبُهُ بِالسَّيْفِ فَيَقْطَعُهُ جِزْلَتَيْنِ رَمْيَةَ الْغَرَضِ ثُمَّ يَدْعُوهُ فَيُقْبِلُ إِلَيْهِ يَتَهَلَّلُ وَجْهُهُ قَالَ فَبَيْنَا هُوَ عَلَى ذَلِكَ إِذْ بَعَثَ اللَّهُ عَزَّ وَجَلَّ الْمَسِيحَ ابْنَ مَرْيَمَ عَلَيْهِ السَّلَام فَيَنْزِلُ عِنْدَ الْمَنَارَةِ الْبَيْضَاءِ شَرْقِيَّ دِمَشْقَ بَيْنَ مَهْرُودَتَيْنِ وَاضِعًا يَدَهُ عَلَى أَجْنِحَةِ مَلَكَيْنِ فَيَتْبَعُهُ فَيُدْرِكُهُ فَيَقْتُلُهُ عِنْدَ بَابِ لُدٍّ الشَّرْقِيِّ قَالَ فَبَيْنَمَا هُمْ كَذَلِكَ إِذْ أَوْحَى اللَّهُ عَزَّ وَجَلَّ إِلَى عِيسَى ابْنِ مَرْيَمَ عَلَيْهِ السَّلَام أَنِّي قَدْ أَخْرَجْتُ عِبَادًا مِنْ عِبَادِي لَا يَدَانِ لَكَ بِقِتَالِهِمْ فَحَوِّزْ عِبَادِي إِلَى الطُّورِ فَيَبْعَثُ اللَّهُ عَزَّ وَجَلَّ يَأْجُوجَ وَمَأْجُوجَ وَهُمْ كَمَا قَالَ اللَّهُ عَزَّ وَجَلَّ{ مِنْ كُلِّ حَدَبٍ يَنْسِلُونَ }فَيَرْغَبُ عِيسَى وَأَصْحَابُهُ إِلَى اللَّهِ عَزَّ وَجَلَّ فَيُرْسِلُ عَلَيْهِمْ نَغَفًا فِي رِقَابِهِمْ فَيُصْبِحُونَ فَرْسَى كَمَوْتِ نَفْسٍ وَاحِدَةٍ فَيَهْبِطُ عِيسَى وَأَصْحَابُهُ فَلَا يَجِدُونَ فِي الْأَرْضِ بَيْتًا إِلَّا قَدْ مَلَأَهُ زَهَمُهُمْ وَنَتِنُهُمْ فَيَرْغَبُ عِيسَى وَأَصْحَابُهُ إِلَى اللَّهِ عَزَّ وَجَلَّ فَيُرْسِلُ عَلَيْهِمْ طَيْرًا كَأَعْنَاقِ الْبُخْتِ فَتَحْمِلُهُمْ فَتَطْرَحُهُمْ حَيْثُ شَاءَ اللَّهُ عَزَّ وَجَلَّ قَالَ ابْنُ جَابِرٍ فَحَدَّثَنِي عَطَاءُ بْنُ يَزِيدَ السَّكْسَكِيُّ عَنْ كَعْبٍ أَوْ غَيْرِهِ قَالَ فَتَطْرَحُهُمْ بِالْمُهَبَّلِ قَالَ ابْنُ جَابِرٍ فَقُلْتُ يَا أَبَا يَزِيدَ وَأَيْنَ الْمُهَبَّلُ قَالَ مَطْلَعُ الشَّمْسِ قَالَ وَيُرْسِلُ اللَّهُ عَزَّ وَجَلَّ مَطَرًا لَا يَكُنْ مِنْهُ بَيْتُ وَبَرٍ وَلَا مَدَرٍ أَرْبَعِينَ يَوْمًا فَيَغْسِلُ الْأَرْضَ حَتَّى يَتْرُكَهَا كَالزَّلَفَةِ وَيُقَالُ لِلْأَرْضِ أَنْبِتِي ثَمَرَتَكِ وَرُدِّي بَرَكَتَكِ قَالَ فَيَوْمَئِذٍ يَأْكُلُ النَّفَرُ مِنْ الرُّمَّانَةِ وَيَسْتَظِلُّونَ بِقِحْفِهَا وَيُبَارَكُ فِي الرِّسْلِ حَتَّى أَنَّ اللَّقْحَةَ مِنْ الْإِبِلِ لَتَكْفِي الْفِئَامَ مِنْ النَّاسِ وَاللَّقْحَةَ مِنْ الْبَقَرِ تَكْفِي الْفَخِذَ وَالشَّاةَ مِنْ الْغَنَمِ تَكْفِي أَهْلَ الْبَيْتِ قَالَ فَبَيْنَا هُمْ عَلَى ذَلِكَ إِذْ بَعَثَ اللَّهُ عَزَّ وَجَلَّ رِيحًا طَيِّبَةً تَحْتَ آبَاطِهِمْ فَتَقْبِضُ رُوحَ كُلِّ مُسْلِمٍ أَوْ قَالَ كُلِّ مُؤْمِنٍ وَيَبْقَى شِرَارُ النَّاسِ يَتَهَارَجُونَ تَهَارُجَ الْحَمِيرِ وَعَلَيْهِمْ أَوْ قَالَ وَعَلَيْهِ تَقُومُ السَّاعَةُ",
                "id": "Telah menceritakan kepada kami [Al Walid bin Muslim Abu Abbas Ad Dimasyqi] di Makkah dengan mendiktekan, ia berkata, telah menceritakan kepadaku [Abdurrahman bin Yazid bin Jabir] ia berkata, telah menceritakan kepadaku [Yahya bin Jabir Ath Tha`i] ia adalah seorang Qadli di Himsh, ia berkata, telah menceritakan kepadaku [Abdurrahman bin Jubair bin Nufair Al Hadlromi] dari [bapaknya], bahwa ia mendengar [Nawwas bin Sam'an Al Kilabi] ia berkata, Dalam sebuah perjalanan Rasulullah Shallallahu 'Alaihi Wasallam mengisahkan dajjal. Beliau terkadang meninggikan volume suaranya, namun terkadang merendahkannya hingga kami sangka beliau berada di tengah rerimbunan pohon kurma. Ketika kami temui beliau, beliau tahu kesemuanya dari wajah kami.  Serta merta kami tanyakan kepada beliau perihal dajjal. Tanya kami “Wahai rasulullah, sepertinya telah engkau kisahkan dajjal di suatu perjalanan, dan engkau rendahkan volume suaramu namun terkadang engkau tinggikan, hingga kami sangka engkau di tengah rerimbunan kurma ! Rasulullah Shallallahu'alaihiwasallam jawab “Disamping karena dajjal paling saya takutkan atas kalian.” Nabi meneruskan, kalaulah dajjal itu muncul dan aku berada di tengah-tengah kalian,  maka akulah yang menghadapinya untuk membela kalian, namun kalaulah ia muncul sedang aku sudah tak lagi bersama kalian, masing-masing akan menghadapinya sendiri. Ketika itu, Allah adalah wakilku (maksudnya Pembela dan Penolongnya) bagi setiap muslim. Kethauilah bahwa cirri dajjal adalah  masih muda, rambutnya keriting kasar, matanya menjorok, ia muncul dari sebuah jalan antara Syam dan Irak, lantas ia  berbuat keonaran ke sebelahkanan dan kiri. Wahai hamba Allah, bersikap teguhlah kalian. Kami bertanya “Wahai Rasulullah, berapa lama dajjal tinggal di muka bumi ? “Empat puluh hari” Tukas Nabi. Sehari ada yang bagaikan setahun, ada yang bagaikan sebulan, ada yang bagaikan sejumat (seminggu), ada yang bagaikan hari-hari biasa, bagaikan hari  yang kalian kenal. Kami semua bertanya “ Wahai Rasulullah, sehari yang bagaikan setahun, apakah kami cukup sholat sehari semalam  saja ?  rasulullah menjawab “Oh tidak, namun taksirlah saja dengan cara seksama.” Kami bertanya “Wahai rasulullah, bagaimana kecepatan dajjal berkeliaran di muka bumi ?  jawab Nabi, bagaikan hujan yang diterbangkan oleh angin, ia lewati sebuah perkampungan dan diajaknya mereka hingga mereka pun menerima, lantas dajjal perintahkan langit dan otomatis menurunkan hujan, dajjal perintahkan bumi dan otomatis  mengeluarkan tetumbuhan, hewan-hewan ternak mereka juga mengandang sendiri  dan punuknya lebih tinggi,  ukurannya lebih panjang, dan air susunya lebih melimpah. Sebaliknya lantas dajjal lewati sebuah perkampungan  dan penduduknya menolak petuah-petuahnya sehingga dengan aneh harta kekayaan mereka mengikuti dajjal, dan mereka ditimpa musim kemarau sangat dahsyat, dan mereka tak punya harta lagi. Kemudian dajjal lewati sebuah perkampungan yang telah roboh dan berujar “Tolong keluarkanlah harta karun yang ada padamu.” Anehnya harta karun itu tiba-tiba mengikutinya bagaikan lebah yang mengikuti ratunya. Kata  Nawas, lantas dajjal perintahkan untuk didatangkan seseorang dan dibunuh.  Dajjal kemudian menyabetnya dengan pedangnya hingga jasadnya terpotong menjadi dua bagian, bagaikan seseorang yang menjadi sasaran anak panah. Kemudian dajjal memanggilnya, tiba-tiba orang itu datang dengan wajahnya yang berseri-seri. Kata Nawas, ketika dajjal melakukan sihirnya seperti itu, tiba-tiba Allah mengutus almasih Isa bin maryam ‘alaihissalam. Isa singgah di menara putih di sebelah timur Damaskus  diantara dua kain  yang diberi minyak wangi za’faran, Isa letakkan tangannya di sayap sayap dua malaikat. Isa tiada henti mengikuti dajjal, ia temui dan dajjal dibantainya di “Bab Ludd” sebelah timur. Ketika situasi seperti ini, Allah mewahyukan kepada Isa bin maryam “Sungguh telah Aku munculkan para hamba diantara hamba-Ku yang engkau tak bakalan mampu mengalahkan mereka, maka persilahkanlah hamba-hamba-Ku itu hingga sampai Tursina.” Kemudian Alalhmengutus Ya’juj dan Ma’juj dan mereka ini sebagaimana difirmankan Allah “Mereka turun dari setiap benteng-benteng yang tinggi”  (QS. Al-Anbiya’ 96), kemudian  Isa  dan para sahabatnya memohon Allah Azza wa jalla dan Allah secara spontan mengirimkan ingus dari leher-leher mereka hingga mereka tiba-tiba terbunuh sebagaimana kematian mendadak . Isa dan para sahbatnya pun turun, dan tak mereka temukan satu rumah pun dimuka bumi selain  bumi telah penuh dengan bau busuk dan bau anyir  bangkai-bangkai ya’juj dan ma’juj.  Isa dan para sahabatnya terus memohon Allah ‘azza wa jalla dan segera Allah kirimkan kawanan burung bagaikan leher-leher  unta, mereka  angkut bangkai-bangkai ya’juj-ma’juj  dan mereka buang ke lokasi yang Allah saja yang maha tahu. Kata Ibn jabir, Telah menceritakan kepada kami  ‘Atho’ bin yazid Assaksaki dari Ka’b  atau lainnya, katanya lantas Allah membuang ya’juj dan ma’juj ke sebuah jurang dalam. Ibn jarir katakana, aku katakana “Wahai Abu yazid, lantas dimana jurang itu ? Ia jawab “Di mat di tempat matahari terbit.” Kata dia, lantas Allah ‘azza wa jalla mengirimkan hujan  selama empat puluh hari yang karenanya tak menyisakan lagi stau rumah pun baik di perkotaan maupun di pedesaan, lantas Allah biarkan bumi dan Dia tinggalkan bagaikan air, lantas dikatakan kepada bumi “Tumbuhkanlah buahanmu kmbalikanlah barakahmu. Kata Yazid, ketika itu ma beberapa orang menyantap buah delima dan berlindung dengan  kulitnya dan diberi barakah pada keluasan dan kemakmurannya, hingga unta perahan cukup sekian banyak orang, dan sapi perahan cukup untuk sekian banyak keluarga dan satu ekor kambing cukup untuk seisi rumah. Kata Nawas, ketika mereka dalam kondisi makmur seperti itu, tiba-tiba Allah Azza wa jalla mengirimkan angin menyenangkan dibawah ketiak mereka sehingga mencabut roh setiap muslim atau sepertinya ia katakan mukmin, dan yang tinggal hanyalah manusia-manusia bréngsék, mereka melakukan zina secara terang-terangan bagaikan keledai melakukan hubungan seksual, maka kepada orang –orang seperti ini –atau ia katakan dengan redaksi kepada orang ini (dengan bentuk tunggal) kiamat terjadi."
            },
            {
                "number": 1658,
                "arab": "حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ سَمِعْتُ يَعْنِي ابْنَ جَابِرٍ يَقُولُ حَدَّثَنِي بُسْرُ بْنُ عُبَيْدِ اللَّهِ الْحَضْرَمِيُّ أَنَّهُ سَمِعَ أَبَا إِدْرِيسَ الْخَوْلَانِيَّ يَقُولُ سَمِعْتُ النَّوَّاسَ بْنَ سَمْعَانَ الْكِلَابِيَّ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ قَلْبٍ إِلَّا وَهُوَ بَيْنَ أُصْبُعَيْنِ مِنْ أَصَابِعِ رَبِّ الْعَالَمِينَ إِنْ شَاءَ أَنْ يُقِيمَهُ أَقَامَهُ وَإِنْ شَاءَ أَنْ يُزِيغَهُ أَزَاغَهُ وَكَانَ يَقُولُ يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قُلُوبَنَا عَلَى دِينِكَ وَالْمِيزَانُ بِيَدِ الرَّحْمَنِ عَزَّ وَجَلَّ يَخْفِضُهُ وَيَرْفَعُهُ",
                "id": "Telah menceritakan kepada kami [Al Walid bin Muslim] ia berkata, aku mendengar [Ibnu Jabir] berkata, telah menceritakan kepadaku [Busr bin ubaidhullah Al Hadlrami] bahwa ia mendengar [Abu Idris Al Khaulaani] berkata, aku mendengar [Nawwas bin Sam'an Al Kilabi] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada satu hati pun kecuali ia berada di antara dua jari dari Jari-Jemari Rabb semesta alam. Jika Dia ingin memberikannya keistiqamahan niscaya Ia akan berikan keistiqamahan padanya. Dan jika Dia ingin memalingkannya (dari Islam) niscaya akan dipalingkan-Nya dari Islam.\" Dan beliau berdo'a: \"YAA MUQALLIBAL QULUUB TSABBIT QULUUBANAA 'ALAA DIINIK (Wahai Dzat yang membulak-balikkan hati tetapkanlah hati kami di atas agama-Mu). Dan Al Mizan juga berada di Jari Ar Rahman 'azza wajalla Dia lah yang meringankan dan mengangkatnya.\""
            },
            {
                "number": 1659,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مُعَاوِيَةَ يَعْنِي ابْنَ صَالِحٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ عَنْ أَبِيهِ أَنَّ النَّوَّاسَ بْنَ سَمْعَانَ الْأَنْصَارِىَّ قَالَ وَكَذَا قَالَ زَيْدُ بْنُ الْحُبَابِ الْأَنْصَارِيُّ قَالَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْبِرِّ وَالْإِثْمِ فَقَالَ الْبِرُّ حُسْنُ الْخُلُقِ وَالْإِثْمُ مَا حَاكَ فِي صَدْرِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ النَّاسُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Mu'awiyah] -yakni Ibnu Shalih- dari [Abdurrahman bin Jubair] dari [Bapaknya] bahwa [Nawwas bin Sam'an Al Anshari] berkata, seperti ini pula apa yang dikatakan oleh Zaid bin Hubab Al Anshari, ia berkata, \"Aku bertanya kepada Nabi shallallahu 'alaihi wasallam tentang kebaikan dan keburukan (dosa), maka beliau bersabda: \"Kebaikan itu adalah akhlak yang baik, sementara keburukan (dosa) itu adalah apa yang mengganjal dalam dadamu dan kamu benci sekiranya manusia mengetahuinya.\""
            },
            {
                "number": 1660,
                "arab": "حَدَّثَنَا عَبْدُ الْقُدُّوسِ أَبُو الْمُغِيرَةِ الْخَوْلَانِيُّ قَالَ حَدَّثَنَا صَفْوَانُ يَعْنِي ابْنَ عَمْرٍو حَدَّثَنَا يَحْيَى بْنُ جَابِرٍ الطَّائِيُّ عَنْ النَّوَّاسِ بْنِ سَمْعَانَ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْبِرِّ وَالْإِثْمِ فَقَالَ الْبِرُّ حُسْنُ الْخُلُقِ وَالْإِثْمُ مَا حَاكَ فِي نَفْسِكَ وَكَرِهْتَ أَنْ يَعْلَمَهُ النَّاسُ",
                "id": "Telah menceritakan kepada kami [Abdul Kudus Abul Mughirah Al Khaulani] ia berkata, Telah menceritakan kepada kami [Shafwan] -yakni Ibnu Amru- Telah menceritakan kepada kami [Yahya bin Jabir Ath Tha`i] dari [Nawwas bin Sam'an] ia berkata, \"Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam mengenai kebaikan dan keburukan (dosa), maka beliau bersabda: \"Kebaikan itu adalah akhlak yang baik, sedangkan keburukan (dosa) itu adalah sesuatu yang mengganjal dalam dirimu dan kamu benci jika manusia mengetahuinya.\""
            },
            {
                "number": 1661,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ جُبَيْرِ بْنِ نُفَيْرٍ الْحَضْرَمِيَّ يَذْكُرُ عَنْ أَبِيهِ عَنْ النَّوَّاسِ بْنِ سَمْعَانَ الْأَنْصَارِيِّ أَنَّهُسَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْبِرِّ وَالْإِثْمِ فَقَالَ الْبِرُّ حُسْنُ الْخُلُقِ وَالْإِثْمُ مَا حَاكَ فِي نَفْسِكَ وَكَرِهْتَ أَنْ يَطَّلِعَ النَّاسُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Zaid bin Hubab] Telah menceritakan kepada kami [Mu'awiyah bin Shalih] ia berkata, aku mendengar [Abdurrahman bin Jubair bin Nufair Al Hadlrami] menuturkan dari [Bapaknya] dari [Nawwas bin Sam'an Al Anshari], bahwa ia pernah bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang kebaikan dan dosa. Maka beliau bersabda: \"Sesungguhnya kebaikan itu adalah akhlak yang baik, sedangkan dosa itu adalah apa yang menggelisahkan hatimu dan kamu benci jika manusia mengetahuinya.\""
            },
            {
                "number": 1662,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ سَوَّارٍ أَبُو الْعَلَاءِ حَدَّثَنَا لَيْثٌ يَعْنِي ابْنَ سَعْدٍ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ جُبَيْرٍ حَدَّثَهُ عَنْ أَبِيهِ عَنْ النَّوَّاسِ بْنِ سَمْعَانَ الْأَنْصَارِيِّعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ضَرَبَ اللَّهُ مَثَلًا صِرَاطًا مُسْتَقِيمًا وَعَلَى جَنْبَتَيْ الصِّرَاطِ سُورَانِ فِيهِمَا أَبْوَابٌ مُفَتَّحَةٌ وَعَلَى الْأَبْوَابِ سُتُورٌ مُرْخَاةٌ وَعَلَى بَابِ الصِّرَاطِ دَاعٍ يَقُولُ أَيُّهَا النَّاسُ ادْخُلُوا الصِّرَاطَ جَمِيعًا وَلَا تَتَفَرَّجُوا وَدَاعٍ يَدْعُو مِنْ جَوْفِ الصِّرَاطِ فَإِذَا أَرَادَ يَفْتَحُ شَيْئًا مِنْ تِلْكَ الْأَبْوَابِ قَالَ وَيْحَكَ لَا تَفْتَحْهُ فَإِنَّكَ إِنْ تَفْتَحْهُ تَلِجْهُ وَالصِّرَاطُ الْإِسْلَامُ وَالسُّورَانِ حُدُودُ اللَّهِ تَعَالَى وَالْأَبْوَابُ الْمُفَتَّحَةُ مَحَارِمُ اللَّهِ تَعَالَى وَذَلِكَ الدَّاعِي عَلَى رَأْسِ الصِّرَاطِ كِتَابُ اللَّهِ عَزَّ وَجَلَّ وَالدَّاعِي فَوْقَ الصِّرَاطِ وَاعِظُ اللَّهِ فِي قَلْبِ كُلِّ مُسْلِمٍ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Sawwar Abul Ala`] Telah menceritakan kepada kami [Laits] -yakni Ibnu Sa'dari- dari [Mu'awiyah bin Shalih] bahwa [Abdurrahman bin Jubair] telah menceritakan kepadanya, dari [Bapaknya] dari [Nawwas bin Sam'an] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Allah memberikan perumpamaan berupa jalan yang lurus. Kemudian di atas kedua sisi jalan itu terdapat dua dinding. Dan pada kedua dinding itu terdapat pintu-pintu yang terbuka lebar. Kemudian di atas setiap pintu terdapat tabir penutup yang halus. Dan di atas pintu jalan terdapat penyeru yang berkata, 'Wahai sekalian manusia, masuklah kalian semua ke dalam shirath dan janganlah kalian menoleh kesana kemari.' Sementara di bagian dalam dari Shirath juga terdapat penyeru yang selalu mengajak untuk menapaki Shirath, dan jika seseorang hendak membuka pintu-pintu yang berada di sampingnya, maka ia berkata, 'Celak kamu, jangan sekali-kali kamu membukanya. Karena jika kamu membukanya maka kamu akan masuk kedalamnya.' Ash Shirath itu adalah Al Islam. Kedua dinding itu merupakan batasan-batasan Allah Ta'ala. Sementara pintu-pintu yang terbuka adalah hal-hal yang diharamkan oleh Allah. Dan adapun penyeru di depan shirath itu adalah Kitabullah (Al Qur`an) 'azza wajalla. Sedangkan penyeru dari atas shirath adalah penasihat Allah (naluri) yang terdapat pada setiap kalbu seorang mukmin.\""
            },
            {
                "number": 1663,
                "arab": "حَدَّثَنَا عُمَرُ بْنُ هَارُونَ عَنْ ثَوْرِ بْنِ يَزِيدَ عَنْ شُرَيْحٍ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ الْحَضْرَمِيِّ عَنْ نَوَّاسِ بْنِ سَمْعَانَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبُرَتْ خِيَانَةً تُحَدِّثُ أَخَاكَ حَدِيثًا هُوَ لَكَ مُصَدِّقٌ وَأَنْتَ بِهِ كَاذِبٌ",
                "id": "Telah menceritakan kepada kami [Umar bin Harun] dari [Tsaur bin Yazid] dari [Syuraih] dari [Jubair bin Nufair Al Hadlrami] dari [Nawwas bin Sam'an] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pengkhiatan yang terbesar adalah kamu berbicara kepada saudaramu, ia membenarkan perkataanmu, padahal kamu sedang berdusta kepadanya.\""
            },
            {
                "number": 1664,
                "arab": "حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ حَدَّثَنَا بَقِيَّةُ قَالَ حَدَّثَنِي بَحِيرُ بْنُ سَعْدٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ النَّوَّاسِ بْنِ سَمْعَانَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ عَزَّ وَجَلَّ ضَرَبَ مَثَلًا صِرَاطًا مُسْتَقِيمًا عَلَى كَنَفَيْ الصِّرَاطِ سُورَانِ فِيهِمَا أَبْوَابٌ مُفَتَّحَةٌ وَعَلَى الْأَبْوَابِ سُتُورٌ وَدَاعٍ يَدْعُو عَلَى رَأْسِ الصِّرَاطِ وَدَاعٍ يَدْعُو مِنْ فَوْقِهِ{ وَاللَّهُ يَدْعُو إِلَى دَارِ السَّلَامِ وَيَهْدِي مَنْ يَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ }فَالْأَبْوَابُ الَّتِي عَلَى كَنَفَيْ الصِّرَاطِ حُدُودُ اللَّهِ لَا يَقَعُ أَحَدٌ فِي حُدُودِ اللَّهِ حَتَّى يُكْشَفَ سِتْرُ اللَّهِ وَالَّذِي يَدْعُو مِنْ فَوْقِهِ وَاعِظُ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Haiwah bin Syuraih] Telah menceritakan kepada kami [Baqiyyah] ia berkata, telah menceritakan kepadaku [Bahir bin Sa'd] dari [Khalid bin Ma'dan] dari [Jubair bin Nufair] dari [Nawwas bin Sam'an] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah 'azza wajalla memberikan perumpamaan mengenai Shirath Mustaqim (jalan yang lurus) berada di atas dua sisi jalan. Pada kedua sisi jalan itu terdapat pintu-pintu yang terbuka lebar. Pada setiap pintu terdapat tabir dan penyeru yang mengajak di depannya. Sedangkan dari atasnya terdapat satu penyeru pula yang selalu mengajaknya, dan Allah senantiasa mengajak ke negeri keselamatan (Darus salam) dan memberikan hidayah kepada siapa saja yang Dia kehendaki untuk menapaki shirath mustaqim. Pintu-pintu yang berada di kedua sisi jalan itu merupakan batasan-batasan Allah hingga batasan Allah itu dilanggar. Sedang yang menyeru dari atasnya adalah Wa'izhullah (penasehat agar mereka kepada jalan) Allah 'azza wajalla.\""
            },
            {
                "number": 1665,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ رَبِّهِ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ عَنْ مُحَمَّدِ بْنِ مُهَاجِرٍ عَنْ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ الْجُرَشِيِّ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ قَالَ سَمِعْتُ النَّوَّاسَ بْنَ سَمْعَانَ الْكِلَابِيَّ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُؤْتَى بِالْقُرْآنِ يَوْمَ الْقِيَامَةِ وَأَهْلِهِ الَّذِينَ كَانُوا يَعْمَلُونَ بِهِ تَقَدَّمُهُمْ سُورَةُ الْبَقَرَةِ وَآلِ عِمْرَانَ وَضَرَبَ لَهُمَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةَ أَمْثَالٍ مَا نَسِيتُهُنَّ بَعْدُ قَالَ كَأَنَّهُمَا غَمَامَتَانِ أَوْ ظُلَّتَانِ أَوْ سَوْدَاوَانِ بَيْنَهُمَا شَرْقٌ كَأَنَّهُمَا فِرْقَانِ مِنْ طَيْرٍ صَوَافَّ يُحَاجَّانِ عَنْ صَاحِبِهِمَا",
                "id": "Telah menceritakan kepada kami [Yazid bin Abdu Rabbih] ia berkata, Telah menceritakan kepada kami [Al Walid bin Muslim] dari [Muhammad bin Muhajir] dari [Walid bin Abdurrahman Al Jurasyi] dari [Jubair bin Nufair] ia berkata, aku mendengar [Nawwas bin Sam'an Al Kilabi] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Al Qur`an akan didatangkan pada hari kiamat bersama ahlinya, yaitu mereka yang beramal dengannya. Dan yang akan didahulukan dari mereka adalah surat Al Baqarah dan Ali Imran.\" Kemudian Rasulullah shallallahu 'alaihi wasallam memberikan tiga permisalan terhadap keduanya, yang tidak pernah melupakannya setelah itu. Beliau mengatakan: \"Kedua surat itu seperti awan kelabu yang menaungi atau mendung yang di antara keduanya terdapat cahaya, keduanya laksana dua kelompok burung yang membentangkan sayapnya membela orang yang membacanya.\""
            },
            {
                "number": 1666,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَنْبَأَنَا سُفْيَانُ عَنْ ثَوْرِ بْنِ يَزِيدَ عَنْ نَصْرٍ عَنْ رَجُلٍ عَنْ عُتْبَةَ بْنِ عَبْدٍ السُّلَمِيِّ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ نَتْفِ أَذْنَابِ الْخَيْلِ وَأَعْرَافِهَا وَنَوَاصِيهَا وَقَالَ أَذْنَابُهَا مَذَابُّهَا وَأَعْرَافُهَا إِدْفَاؤُهَا وَنَوَاصِيهَا مَعْقُودٌ بِهَا الْخَيْرُ إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] telah memberitakan kepada kami [Sufyan] dari [Tsaur bin Yazid] dari [Nashr] dari [seorang laki-laki] dari [Utbah bin Abdu As Sulami] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah melarang mencabut bulu ekor kuda, lehernya, dan juga pada keningnya.\" Dan beliau bersabda: \"Pada bulu ekor adalah alat pengusir lalat, bulu leher adalah tempat kematiannya (penyembelihan) dan bulu kening (kepala bagiandepan) adalah karena padanya terikat kebaikan hingga datangnya hari kiamat.\""
            },
            {
                "number": 1667,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عُمَرَ وَحَسَنُ بْنُ مُوسَى قَالَا حَدَّثَنَا حَرِيزٌ عَنْ شُرَحْبِيلَ ابْنِ شُفْعَةَ الرَّحَبِيِّ قَالَ سَمِعْتُ عُتْبَةَ بْنَ عَبْدٍ السُّلَمِيِّ صَاحِبَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُسَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ يَمُوتُ وَقَالَ حَسَنٌ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ رَجُلٍ مُسْلِمٍ يُتَوَفَّى لَهُ ثَلَاثَةٌ مِنْ الْوَلَدِ لَمْ يَبْلُغُوا الْحِنْثَ إِلَّا تَلَقَّوْهُ مِنْ أَبْوَابِ الْجَنَّةِ الثَّمَانِيَةِ مِنْ أَيِّهَا شَاءَ دَخَلَ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Amru] dan [Hasan bin Musa] keduanya berkata, [Hariz] dari [Syurahbil bin Syuf'ah Ar Rahabi] ia berkata, aku mendengar [Utbah bin Abdu As Sulami] salah seorang sahabat Nabi shallallahu 'alaihi wasallam, bahwa ia mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa meninggal.\" Dan Hasan berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang laki-laki muslim memiliki tiga orang anak yang meninggal dunia sebelum baligh, kecuali mereka akan menjemputnya dari delapan pintu surga, dari pintu mana saja yang ia kehendaki.\""
            },
            {
                "number": 1668,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ حَدَّثَنِي ثَوْرُ بْنُ يَزِيدَ عَنْ نَصْرٍ عَنْ رَجُلٍ مِنْ بَنِي سُلَيْمٍ عَنْ عُتْبَةَ بْنِ عَبْدٍ السُّلَمِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ جَزِّ أَعْرَافِ الْخَيْلِ وَنَتْفِ أَذْنَابِهَا وَجَزِّ نَوَاصِيهَا وَقَالَ أَمَّا أَذْنَابُهَا فَإِنَّهَا مَذَابُّهَا وَأَمَّا أَعْرَافُهَا فَإِنَّهَا إِدْفَاؤُهَا وَأَمَّا نَوَاصِيهَا فَإِنَّ الْخَيْرَ مَعْقُودٌ فِيهَا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Harits] telah menceritakan kepadaku [Tsaur bin Yazid] dari [Nashr] dari [seorang laki-laki] dari Bani Sulaim, dari [Utbah bin Abdu As Sulami], bahwa Nabi shallallahu 'alaihi wasallam melarang untuk memotong rambut yang terdapat pada leher kuda, ekor dan keningnya.\" Utbah berkata, \"Adapun ekor maka itu adalah alat untuk mengusir lalat dari tubuhnya, bulu leher maka itu adalah tempat kematiannya (sembelihan), dan bulu pada kening karena di situlah terikat kebaikan.\""
            },
            {
                "number": 1669,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ حَدَّثَنَا هِشَامُ بْنُ يُوسُفَ حَدَّثَنَا مَعْمَرٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَامِرِ بْنِ زَيْدٍ الْبُكَالِيِّ أَنَّهُ سَمِعَ عُتْبَةَ بْنَ عَبْدٍ السُّلَمِيِّ يَقُولُجَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ عَنْ الْحَوْضِ وَذَكَرَ الْجَنَّةَ ثُمَّ قَالَ الْأَعْرَابِيُّ فِيهَا فَاكِهَةٌ قَالَ نَعَمْ وَفِيهَا شَجَرَةٌ تُدْعَى طُوبَى فَذَكَرَ شَيْئًا لَا أَدْرِي مَا هُوَ قَالَ أَيُّ شَجَرِ أَرْضِنَا تُشْبِهُ قَالَ لَيْسَتْ تُشْبِهُ شَيْئًا مِنْ شَجَرِ أَرْضِكَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَيْتَ الشَّامَ فَقَالَ لَا قَالَ تُشْبِهُ شَجَرَةً بِالشَّامِ تُدْعَى الْجَوْزَةُ تَنْبُتُ عَلَى سَاقٍ وَاحِدٍ وَيَنْفَرِشُ أَعْلَاهَا قَالَ مَا عِظَمُ أَصْلِهَا قَالَ لَوْ ارْتَحَلَتْ جَذَعَةٌ مِنْ إِبِلِ أَهْلِكَ مَا أَحَاطَتْ بِأَصْلِهَا حَتَّى تَنْكَسِرَ تَرْقُوَتُهَا هَرَمًا قَالَ فِيهَا عِنَبٌ قَالَ نَعَمْ قَالَ فَمَا عِظَمُ الْعُنْقُودِ قَالَ مَسِيرَةُ شَهْرٍ لِلْغُرَابِ الْأَبْقَعِ وَلَا يَعْثُرُ قَالَ فَمَا عِظَمُ الْحَبَّةِ قَالَ هَلْ ذَبَحَ أَبُوكَ تَيْسًا مِنْ غَنَمِهِ قَطُّ عَظِيمًا قَالَ نَعَمْ قَالَ فَسَلَخَ إِهَابَهُ فَأَعْطَاهُ أُمَّكَ قَالَ اتَّخِذِي لَنَا مِنْهُ دَلْوًا قَالَ نَعَمْ قَالَ الْأَعْرَابِيُّ فَإِنَّ تِلْكَ الْحَبَّةَ لَتُشْبِعُنِي وَأَهْلَ بَيْتِي قَالَ نَعَمْ وَعَامَّةَ عَشِيرَتِكَ",
                "id": "Telah menceritakan kepada kami [Ali bin Bahr] Telah menceritakan kepada kami [Hisyam bin Yusuf] Telah menceritakan kepada kami [Ma'mar] dari [Yahya bin Abu Katsir] dari [Amir bin Zaid Al Bukali] bahwa ia mendengar [Utbah bin Abdu As Sulami] berkata, \"Seorang arab dusun datang menemui Nabi shallallahu 'alaihi wasallam dan bertanya tentang Haudl (telaga Nabi shallallahu 'alaihi wasallam), dan beliau pun menyebutkan tentang surga. Kemudian arab dusun itu bertanya lagi, \"Apakah di dalamnya terdapat buah-buahan?\" beliau menjawab, \"Ya, di dalamnya juga terdapat pohon yang disebut Thuba.\" Kemudian beliau menyebutkan tentang sesuatu, namun aku tidak tahu sesuatu apakah itu. Arab dusun itu bertanya lagi, \"Pohon apakah di dunia ini yang menyerupainya?\" beliau menjawab: \"Tiada sesuatu pun di duniamu ini yang menyerupainya.\" Lalu Nabi shallallahu 'alaihi wasallam melanjutkan sabdanya: \"Apakah kamu pernah mendatangi Syam?\" ia menjawab, \"Tidak pernah.\" Beliau berkata: \"Terdapat satu pohon yang menyerupainya di Syam yaitu pohon Jauzah yang tumbuh di atas satu batang dan bagian atasnya terbentang luas.\" Arab dusun itu bertanya, \"Sebesar apakah akarnya?\" beliau menjawab, \"Sekiranya Jadza'ah (Unta betina yang berumur lima tahun) milik keluargamu berjalan sampai tulangnya selangkanya patah atau tua renta niscaya tidak akan mampu mengelilingi akarnya.\" Arab dusun itu bertanya lagi, \"Apakah di dalamnya juga terdapat buah anggur?\" beliau menjawab: \"Ya.\" Laki-laki itu kemudian bertanya, \"Lalu sebesar apakah tandannya?\" beliau bersabda: \"Yaitu sejauh satu bulan perjalanan yang dilakukan oleh burung gagak (berbelang puting di bagian perutnya) tanpa berhenti atau singgah.\" Arab dusun itu bertanya kembali, \"Maka sebesar apakah bijinya?\" beliau menjelaskan, \"Apakah bapakmu pernah menyembelih kambing hutan yang besar?\" ia menjawab, \"Ya.\" Beliau melanjutkan: \"Lalu bapakmu mengulitinya dan memberikannya kepada ibumu, hingga ibumu berkata, 'Ambilkan satu ember daging untuk kami.'\" Arab dusun itu menjawab, \"Ya.\" Kemudian Arab dusun itu bertanya lagi, \"Kalau begitu, apakah sebiji anggur itu akan mengenyangkanku dan juga keluargaku?\" beliau menjawab; \"Tentu, bahkan untuk semua kerabatmu.\""
            },
            {
                "number": 1670,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ حَدَّثَنَا بَقِيَّةُ بْنُ الْوَلِيدِ حَدَّثَنِي نَصْرُ بْنُ عَلْقَمَةَ قَالَ حَدَّثَنِي رَجُلٌ مِنْ بَنِي سُلَيْمٍ عَنْ عُتْبَةَ بْنِ عَبْدٍ السُّلَمِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَقُصُّوا نَوَاصِيَ الْخَيْلِ فَإِنَّ فِيهَا الْبَرَكَةَ وَلَا تَجُزُّوا أَعْرَافَهَا فَإِنَّهُ إِدْفَاؤُهَا وَلَا تَقُصُّوا أَذْنَابَهَا فَإِنَّهَا مَذَابُّهَا",
                "id": "Telah menceritakan kepada kami [Ali bin Bahr] Telah menceritakan kepada kami [Baqiyyah bin Walid] telah menceritakan kepadaku [Nashr bin Alqamah] ia berkata, telah menceritakan kepadaku [seorang laki-laki] dari Bani Sulaim, dari [Utbah bin Abdu As Sulami] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah kalian memangkas rambut yang tumbuh di kening kuda, karena padanya terdapat barakah. Jangan pula kalian memangkas rambut yang tumbuh di lehernya, karena padanya adalah tempat penyembelihannya. Dan janganlah kalian memotong ekornya karena ia adalah alat untuk mengusir lalat.\""
            },
            {
                "number": 1671,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ سَعِيدٍ حَدَّثَنَا حَسَنُ بْنُ أَيُّوبَ الْحَضْرَمِيُّ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ نَاسِجٍ الْحَضْرَمِيُّ وَكَانَ قَدْ أَدْرَكَ أَبَا بَكْرٍ وَعُمَرَ رَضِيَ اللَّهُ عَنْهُمَا فَمَنْ دُونَهُمَا عَنْ عُتْبَةَ بْنِ عَبْدٍ السُّلَمِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَصْحَابِهِ قُومُوا فَقَاتِلُوا قَالُوا نَعَمْ يَا رَسُولَ اللَّهِ وَلَا نَقُولُ كَمَا قَالَتْ بَنُو إِسْرَائِيلَ لِمُوسَى عَلَيْهِ السَّلَام انْطَلِقْ أَنْتَ وَرَبُّكَ فَقَاتِلَا إِنَّا هَاهُنَا قَاعِدُونَ وَلَكِنْ انْطَلِقْ أَنْتَ وَرَبُّكَ يَا مُحَمَّدُ فَقَاتِلَا وَإِنَّا مَعَكُمَا نُقَاتِلُ",
                "id": "Telah menceritakan kepada kami [Hisyam bin Sa'id] Telah menceritakan kepada kami [Hasan bin Ayyub Al Hadlrami] telah menceritakan kepadaku [Abdullah bin Nasij Al Hadlrami] -ia pernah bertemu dengan Abu Bakar dan Umar Radiallahu 'Anhuma dan orang-orang selain keduanya- dari Utbah bin Abdu As Sulami, bahwa Nabi shallallahu 'alaihi wasallam bersabda kepada para sahabatnya: \"Berdiri dan berperanglah kalian!\" para sahabat menjawab, \"Kami siap wahai Rasulullah. Kami tidak akan mengatakan sebagaimana yang dikatakan oleh Banu Isara`il kepada Musa, '(Pergilah kamu bersama Tuhanmu, dan berperanglah kamu berdua, Sesungguhnya kami Hanya duduk menanti disini saja) ' (Qs. Al Maidah: 34). Akan tetapi, (kami akan katakan) pergilah kamu bersama Tuhanmu wahai Muhammad dan berperanglah, sesungguhnya kami bersamamu untuk berperang.\""
            },
            {
                "number": 1672,
                "arab": "حَدَّثَنَا هِشَامُ بْنُ سَعِيدٍ حَدَّثَنَا الْحَسَنُ بْنُ أَيُّوبَ الْحَضْرَمِيُّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَاسِجٍ الْحَضْرَمِيُّ عَنْ عُتْبَةَ بْنِ عَبْدٍ السُّلَمِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِأَصْحَابِهِ قُومُوا فَقَاتِلُوا قَالَ فَرُمِيَ رَجُلٌ بِسَهْمٍ قَالَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْجَبَ هَذَا",
                "id": "Telah menceritakan kepada kami [Hisyam bin Sa'id] Telah menceritakan kepada kami [Al Hasan bin Ayyub Al Hadlrami] ia berkata, Telah menceritakan kepada kami [Abdullah bin Nasij Al Hadlrami] dari [Utbah bin Abdu As Sulami], bahwa Nabi shallallahu 'alaihi wasallam bersabda kepada para sahabatnya: \"Berdiri dan berperanglah kalian!\" Abdullah berkata, \"Lalu salah seorang laki-laki terkena anak panah. Abdullah berkata, \"Nabi shallallahu 'alaihi wasallam pun bersabda: \"Telah wajib bagi orang ini (masuk surga).\""
            },
            {
                "number": 1673,
                "arab": "حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ حَدَّثَنِي بَقِيَّةُ حَدَّثَنِي بَحِيرُ بْنُ سَعْدٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ عُتْبَةَ بْنِ عَبْدٍ أَنَّهُ قَالَإِنَّ رَجُلًا قَالَ يَا رَسُولَ اللَّهِ الْعَنْ أَهْلَ الْيَمَنِ فَإِنَّهُمْ شَدِيدٌ بَأْسُهُمْ كَثِيرٌ عَدَدُهُمْ حَصِينَةٌ حُصُونُهُمْ فَقَالَ لَا ثُمَّ لَعَنَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْأَعْجَمِيِّينَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا مَرُّوا بِكُمْ يَسُوقُونَ نِسَاءَهُمْ يَحْمِلُونَ أَبْنَاءَهُمْ عَلَى عَوَاتِقِهِمْ فَإِنَّهُمْ مِنِّي وَأَنَا مِنْهُمْ",
                "id": "Telah menceritakan kepada kami [Haiwah bin Syuraih] telah menceritakan kepadaku [Baqiyyah] telah menceritakan kepadaku [Bahir bin Sa'id] dari [Khalid bin Ma'dan] dari [Utbah bin Abd] bahwa ia berkata, \"Seorang laki-laki berkata, \"Wahai Rasulullah, laknatilah penduduk Yaman itu, karena mereka itu kuat dan jumlah mereka banyak lagi kokoh bentengnya.\" Maka beliau bersabda: \"Tidak.\" Kemudian Rasulullah shallallahu 'alaihi wasallam justru melaknati Al A'jamiyyin. Dan Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika ada orang-orang yang melewati kalian dengan menuntun isteri dan membawa anak-anak mereka di atas pundak mereka, maka mereka adalah dariku dan aku pun termasuk bagian dari mereka.\""
            },
            {
                "number": 1674,
                "arab": "حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ حَدَّثَنَا بَقِيَّةُ حَدَّثَنِي بَحِيرُ بْنُ سَعْدٍ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ عُتْبَةَ بْنِ عَبْدٍ قَالَإِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَنَّ رَجُلًا يُجَرُّ عَلَى وَجْهِهِ مِنْ يَوْمِ وُلِدَ إِلَى يَوْمِ يَمُوتُ هَرَمًا فِي مَرْضَاةِ اللَّهِ عَزَّ وَجَلَّ لَحَقَّرَهُ يَوْمَ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Haiwah bin Syuraih] Telah menceritakan kepada kami [Baqiyyah] telah menceritakan kepadaku [Bahir bin Sa'd] dari [Khalid bin Ma'dan] dari [Utbah bin Abd] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sekiranya seorang laki-laki diseret di atas wajahnya semenjak hari ia dilahirkan hingga ia meninggal dunia di hari tuanya, sedang ia dalam keridlaan Allah 'azza wajalla, niscaya pada hari kiamat ia akan menganggap remeh kesengsaraan itu.\""
            },
            {
                "number": 1675,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ إِسْحَاقَ حَدَّثَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ الْمُبَارَكِ حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ جُبَيْرِ بْنِ نُفَيْرٍ عَنْ مُحَمَّدِ بْنِ أَبِي عُمَيْرَةَ وَكَانَ مِنْ أَصْحَابِ النِّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَلَوْ أَنَّ عَبْدًا خَرَّ عَلَى وَجْهِهِ مِنْ يَوْمِ وُلِدَ إِلَى أَنْ يَمُوتَ هَرَمًا فِي طَاعَةِ اللَّهِ لَحَقَّرَهُ ذَلِكَ الْيَوْمَ وَلَوَدَّ أَنَّهُ يُرَدُّ إِلَى الدُّنْيَا كَيْمَا يَزْدَادَ مِنْ الْأَجْرِ وَالثَّوَابِ",
                "id": "Telah menceritakan kepada kami [Ali bin Ishaq] Telah menceritakan kepada kami [Abdullah] -yakni Ibnul Mubarak- Telah menceritakan kepada kami [Tsaur bin Yazid] dari [Khalid bin Ma'dan] dar [Jubair bin Nufair] dari [Muhammad bin Abu Umairah] ia adalah salah seorang dari sahabat Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sekiranya seorang hamba jatuh tersungkur di atas wajahnya sejak hari ia dilahirkan hingga ia meninggal dunia di hari tuanya dalam ketaatan kepada Allah, niscaya ia akan menganggap kesengsaraan pada hari itu remeh (jika dibandingkan dengan siksa akhirat). Dan ia benar-benar ingin agar dikembalikan ke dunia karena bertambahnya ganjaran pahala dan kebaikan.\""
            },
            {
                "number": 1676,
                "arab": "حَدَّثَنَا الْحَسَنُ بْنُ سَوَّارٍ حَدَّثَنَا لَيْثٌ يَعْنِي ابْنَ سَعْدٍ عَنْ مُعَاوِيَةَ عَنْ رَاشِدِ بْنِ سَعْدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ قَتَادَةَ السُّلَمِيِّ أَنَّهُ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ عَزَّ وَجَلَّ خَلَقَ آدَمَ ثُمَّ أَخَذَ الْخَلْقَ مِنْ ظَهْرِهِ وَقَالَ هَؤُلَاءِ فِي الْجَنَّةِ وَلَا أُبَالِي وَهَؤُلَاءِ فِي النَّارِ وَلَا أُبَالِي قَالَ فَقَالَ قَائِلٌ يَا رَسُولَ اللَّهِ فَعَلَى مَاذَا نَعْمَلُ قَالَ عَلَى مَوَاقِعِ الْقَدَرِ",
                "id": "Telah menceritakan kepada kami [Al Hasan bin Sawwar] Telah menceritakan kepada kami [Laits] -yakni Ibnu Sa'd- dari [Mu'awiyah] dari [Rasyid bin Sa'd] dari [Abdurrahman bin Qatadah As Sulami] bahwa ia berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah 'azza wajalla menciptakan Adam, setelah itu Ia menciptakan manusia dari tulang pungguh Adam lalu seraya berfiman, 'Mereka itu akan berada di dalam Surga dan Aku tidak memperdulikannya. Kemudian yang itu adalah di dalam neraka dan Aku pun tidak memperdulikannya.'\" Kemudian seorang laki-laki bertanya, \"Wahai Rasulullah, lantas atas landasan apa kita beramal?\" beliau bersabda: \"Di atas pijakan takdir.\""
            },
            {
                "number": 1677,
                "arab": "حَدَّثَنَا وَكِيعٌ قَالَ قَالَ سُفْيَانُ عَنْ بَيَانٍ وَجَابِرٍ عَنْ عَامِرٍ عَنْ وَهْبِ بْنِ خَنْبَشٍ الطَّائِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عُمْرَةٌ فِي رَمَضَانَ تَعْدِلُ حَجَّةً",
                "id": "Telah menceritakan kepada kami [Waki'] ia berkata, telah berkata [Sufyan] dari [Bayan] dan [Jabir] dari [Amir] dari [Wahb bin Khanbasy Ath Tha`i] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Ibadah Umrah pada bulan ramadhan menyamai ibadah haji.\""
            },
            {
                "number": 1678,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ قَالَ أَخْبَرَنَا عِكْرِمَةُ بْنُ خَالِدٍ الْمَخْزُومِيُّ عَنْ أَبِيهِ أَوْ عَنْ عَمِّهِ عَنْ جَدِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي غَزْوَةِ تَبُوكَ إِذَا وَقَعَ الطَّاعُونُ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلَا تَخْرُجُوا مِنْهَا وَإِذَا وَقَعَ بِأَرْضٍ وَلَسْتُمْ بِهَا فَلَا تَقْدَمُوا عَلَيْهِ",
                "id": "Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Hammad bin Salamah] ia berkata, telah mengabarkan kepada kami [Ikrimah bin khalid Al Makhzumi] dari [Bapaknya] atau Pamannya dari Kakeknya, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda ketika perang Tabuk: \"Jika penyakit Tha'un melanda suatu negeri sedangkan kalian berada di dalamnya, maka janganlah kalian keluar darinya. Dan jika penyakit itu menimpa suatu negeri sedangkan kalian tidak bermukim di dalamnya, maka janganlah kalian mendatanginya.\""
            },
            {
                "number": 1679,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا سُفْيَانُ عَنْ لَيْثٍ عَنْ شَهْرِ بْنِ حَوْشَبٍ قَالَ أَخْبَرَنِي مَنْ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ و عَنْ ابْنِ أَبِي لَيْلَى أَنَّهُ سَمِعَ عَمْرَو بْنَ خَارِجَةَ قَالَ لَيْثٌ فِي حَدِيثِهِخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى نَاقَتِهِ فَقَالَ أَلَا إِنَّ الصَّدَقَةَ لَا تَحِلُّ لِي وَلَا لِأَهْلِ بَيْتِي وَأَخَذَ وَبَرَةً مِنْ كَاهِلِ نَاقَتِهِ فَقَالَ وَلَا مَا يُسَاوِي هَذِهِ أَوْ مَا يَزِنُ هَذِهِ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Sufyan] dari [Laits] dari [Syahr bin Hausyab] ia berkata, telah mengabarkan kepadaku [seseorang] yang mendengar Nabi shallallahu 'alaihi wasallam. Dan dari [Ibnu Abu Laila] bahwa ia mendengar [Amru bin Kharijah] -Laits menyebutkan dalam haditsnya-, \"Rasulullah shallallahu 'alaihi wasallam di atas untanya berkhutbah di hadapan kami, beliau mengatakan: \"Ketahuilah, sesungguhnya sedekah tidak halal bagiku dan bagi ahli baitku.\" Kemudian beliau mengambil bulu rambut dari pundak Untanya seraya bersabda: \"Meskipun itu senilai bulu ini, atau seberat bulu ini.\""
            },
            {
                "number": 1680,
                "arab": "لَعَنَ اللَّهُ مَنْ ادَّعَى إِلَى غَيْرِ أَبِيهِ أَوْ تَوَلَّى غَيْرَ مَوَالِيهِ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ إِنَّ اللَّهَ أَعْطَى كُلَّ ذِي حَقٍّ حَقَّهُ وَلَا وَصِيَّةَ لِوَارِثٍ",
                "id": "Masih melalui jalur periwayatan yang sama seperti hadits sebelumnya dari [Amru bin Kharijah]; \"Allah melaknat orang yang menyandarkan dirinya kepada selain bapaknya, atau (bagi seorang budak) kepada tuan yang bukan tuannya. Anak itu untuk sang suami, sedangkan bagi seorang pezina adalah batu (hukum rajam). Sesungguhnya Allah memberikan kepada setiap orang apa yang menjadi haknya. Dan tidak ada wasiat bagi ahli waris.\""
            },
            {
                "number": 1681,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا سَعِيدٌ وَيَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ عَنْ عَمْرِو بْنِ خَارِجَةَ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِنًى وَهُوَ عَلَى رَاحِلَتِهِ وَهِيَ تَقْصَعُ بِجِرَّتِهَا وَلُعَابُهَا يَسِيلُ بَيْنَ كَتِفَيَّ فَقَالَ إِنَّ اللَّهَ قَسَمَ لِكُلِّ إِنْسَانٍ نَصِيبَهُ مِنْ الْمِيرَاثِ فَلَا تَجُوزُ لِوَارِثٍ وَصِيَّةٌ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ أَلَا وَمَنْ ادَّعَى إِلَى غَيْرِ أَبِيهِ أَوْ تَوَلَّى غَيْرَ مَوَالِيهِ رَغْبَةً عَنْهُمْ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَقَالَ ابْنُ جَعْفَرٍ وَقَالَ يَزِيدُ وَقَالَ مَطَرٌ وَلَا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عَدْلٌ أَوْ عَدْلٌ وَلَا صَرْفٌ قَالَ أَبِي قَالَ يَزِيدُ فِي حَدِيثِهِ وَلَا عَدْلٌ إِنَّ عَمْرَو بْنَ خَارِجَةَ حَدَّثَهُمْ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَهُمْ عَلَى رَاحِلَتِهِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Sa'id] dan [Yazid bin Harun] ia berkata, telah mengabarkan kepada kami [Sa'id] dari [Qatadah] dari [Syahr bin Hausyab] dari [Abdurrahman bin Ghanm] dari [Amru bin Kharijah] ia berkata, \"Di Mina Rasulullah shallallahu 'alaihi wasallam pernah berkhutbah kepada kami, sementara beliau berada di atas kendaraannya yang sedang mengunyah makanan dan air liurnya menetes di antara dua pundakku. Beliau bersabda: \"Sesungguhnya Allah telah menetapkan untuk setiap orang bagiannya dari harta warisan. Karena itu wasiat tidak diperbolehkan bagi ahli waris. Anak adalah milik sang suami sedangkan bagi seorang pezina adalah batu (hukum rajam). Siapa yang menisbatkan kepada selain bapaknya atau seorang budak menisbatkan diri pada seorang majikan yang bukan majikannya karena benci, maka bagi mereka adalah laknat Allah, malaikat dan seluruh manusia.\" [Ibnu Ja'far] berkata, [Yazid] berkata, [Mathar] berkata, \"Dan tidak diterima lagi amalan sunnah darinya dan tidak pula amalan wajibnya. atau amalan wajibnya dan tidak pula amalan sunnahnya.\" Bapakku berkata, Yazid menyebutkan dalam haditsnya, \"Dan tidak pula diterima amalan wajibnya.\" Amru bin Kharijah telah menceritakan kepada mereka bahwa Nabi shallallahu 'alaihi wasallam berkhutbah kepada mereka sedang beliau berada di atas kendaraannya.\""
            },
            {
                "number": 1682,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ قَالَ أَخْبَرَنَا قَتَادَةُ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ عَنْ عَمْرِو بْنِ خَارِجَةَ قَالَكُنْتُ آخِذًا بِزِمَامِ نَاقَةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهِيَ تَقْصَعُ بِجِرَّتِهَا وَلُعَابُهَا يَسِيلُ بَيْنَ كَتِفَيَّ فَقَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ أَعْطَى لِكُلِّ ذِي حَقٍّ حَقَّهُ وَلَيْسَ لِوَارِثٍ وَصِيَّةٌ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ وَمَنْ ادَّعَى إِلَى غَيْرِ أَبِيهِ أَوْ انْتَمَى إِلَى غَيْرِ مَوَالِيهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَقَالَ عَفَّانُ وَزَادَ فِيهِ هَمَّامٌ بِهَذَا الْإِسْنَادِ وَلَمْ يُذْكَرْ عَبْدُ الرَّحْمَنِ بْنُ غَنْمٍ وَإِنِّي لَتَحْتَ جِرَانِ رَاحِلَتِهِ وَزَادَ فِيهِ لَا يُقْبَلُ مِنْهُ عَدْلٌ وَلَا صَرْفٌ وَفِي حَدِيثِ هَمَّامٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَ وَقَالَ رَغْبَةً عَنْهُمْ",
                "id": "Telah menceritakan kepada kami [Affan] ia berkata, Telah menceritakan kepada kami [Abu Awanah] ia berkata, telah mengabarkan kepada kami [Qatadah] dari [Syahr bin Hausyab] dari [Abdurrahman bin Ghanm] dari [Amru bin Kharijah] ia berkata, \"Saya mengambil tali kekang unta Rasulullah shallallahu 'alaihi wasallam yang sedang mengunyah makanan dan air liurnya menetes antara kedua pundakku. Beliau bersabda: \"Sesungguhnya Allah 'azza wajalla telah memberikan kepada setiap orang apa yang menjadi haknya. Dan tidak wasiat bagi ahli haris, anak itu untuk sang suami, sedangkan bagi seorang pezina adalah batu (hukuman rajam). Siapa yang menisbatkan dirinya kepada selain bapaknya, atau (budak) menisbatkan dirinya kepada orang yang bukan tuannya, maka ia akan mendapatkan laknat Allah, malaikat dan seluruh manusia.\" [Affan] berkata, \"Dalam hadits tersebut [Hammam] menambahkan sanad ini, tetapi tidak disebutkan bahwa Abdurrahman bin Ghanm berkata, \"Dan saya berada di bawah leher kendaraannya (unta milik Rasulullah).\" Dan ia juga menambahkan di dalamnya, \"Tidak akan diterima darinya amalan sunah atau wajib.\" Kemudian dalam hadits Hammam disebutkan, bahwa Rasulullah shallallahu 'alaihi wasallam berkhutbah. Dan beliau berkata, \"Karena benci mereka.\""
            },
            {
                "number": 1683,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا حَمَّادٌ عَنْ قَتَادَةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ عَنْ عَمْرِو بْنِ خَارِجَةَ قَالَخَطَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ عَلَى نَاقَتِهِ وَأَنَا تَحْتَ جِرَانِهَا وَهِيَ تَقْصَعُ بِجِرَّتِهَا وَلُعَابُهَا يَسِيلُ بَيْنَ كَتِفَيَّ قَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ أَعْطَى لِكُلِّ ذِي حَقٍّ حَقَّهُ وَلَا وَصِيَّةَ لِوَارِثٍ وَالْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ وَمَنْ ادَّعَى إِلَى غَيْرِ أَبِيهِ أَوْ انْتَمَى إِلَى غَيْرِ مَوَالِيهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ لَا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عَدْلٌ",
                "id": "Telah menceritakan kepada kami [Affan] Telah menceritakan kepada kami [Hammad] dari [Qatadah] dari [Syahr bin Hausyab] dari [Abdurrahman bin Ghanm] dari [Amru bin Kharijah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam berkhutbah di atas untanya, sementara saya berada di bawah leher unta tersebut. Unta itu sedang mengunyah makanan dan air liurnya menetes di antara kedua pundakku. Beliau bersabda: \"Sesungguhnya Allah 'azza wajalla telah memberikan kepada setiap orang apa yang menjadi haknya. Dan tidak ada wasiat bagi ahli waris, anak adalah hak bagi sang suami, sedangkan bagi seorang pezina adalah batu (hukuman rajam). Dan barangsiapa menisbatkan dirinya kepada selain bapaknya atau (budak) menisbatkan diri kepada selain tuannya, maka ia akan mendapatkan Allah, malaikat dan seluruh manusia. Allah tidak akan menerima amalan sunnah dan tidak pula amalan wajib, atau amalan sunnah dan tidak pula amalan wajibnya.\""
            },
            {
                "number": 1684,
                "arab": "حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ حَدَّثَنَا شَرِيكٌ عَنْ لَيْثٍ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَمْرِو بْنِ خَارِجَةَ الثُّمَالِيِّ قَالَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْهَدْيِ يَعْطَبُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْحَرْ وَاصْبُغْ نَعْلَهُ فِي دَمِهِ وَاضْرِبْ بِهِ عَلَى صَفْحَتِهِ أَوْ قَالَ عَلَى جَنْبِهِ وَلَا تَأْكُلَنَّ مِنْهُ شَيْئًا أَنْتَ وَلَا أَهْلُ رُفْقَتِكَ",
                "id": "Telah menceritakan kepada kami [Husain bin Muhammad] Telah menceritakan kepada kami [Syarik] dari [Laits] dari [Syahr bin Hausyab] dari [Amru bin Kharijah Ats Tsumali] ia berkata, \"Saya bertanya kepada Nabi shallallahu 'alaihi wasallam tentang Hadyu (hewan kurban) yang sekarat. Nabi shallallahu 'alaihi wasallam menjawab: \"Sembelihlah dan lemparkan telapak kakinya pada darahnya, kemudian tandailah (dengan telapak kaki itu) pada bagian sampingnya. Atau beliau mengatakan: \"Pada bagian sisinya, dan janganlah kamu dan keluargamu memakan dagingnya.\""
            },
            {
                "number": 1685,
                "arab": "حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا شَرِيكٌ عَنْ لَيْثٍ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَمْرٍو الثُّمَالِيِّ قَالَبَعَثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَعِي هَدْيًا وَقَالَ إِذَا عَطِبَ شَيْءٌ مِنْهَا فَانْحَرْهُ ثُمَّ اضْرِبْ نَعْلَهُ فِي دَمِهِ ثُمَّ اضْرِبْ بِهِ صَفْحَتَهُ وَلَا تَأْكُلْ أَنْتَ وَلَا أَهْلُ رُفْقَتِكَ وَخَلِّ بَيْنَهُ وَبَيْنَ النَّاسِ",
                "id": "Telah menceritakan kepada kami [Abu Aswad bin Amir] Telah menceritakan kepada kami [Syarik] dari [Laits] dari [Syahr bin Hausyab] dari [Amru bin Ats Tsumali] ia berkata, \"Nabi shallallahu 'alaihi wasallam menitipkan hewan kurban kepadaku seraya bersabda: \"Jika ia hampir mati (sekarat) maka sembelihlah dan lemparkan telapak kakinya pada darahnya, kemudian tandailah (dengan telapak kaki itu) pada bagian sampingnya. Dan janganlah kamu dan keluargamu memakan dagingnya. Lalu biarkanlah dagingnya berada di tengah-tengah manusia, agar mereka memakannya.\""
            },
            {
                "number": 1686,
                "arab": "حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا سَعِيدٌ يَعْنِي ابْنَ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ أَنَّ عَمْرَو بْنَ خَارِجَةَ الْخُشَنِيَّ حَدَّثَهُمْأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَطَبَهُمْ عَلَى رَاحِلَتِهِ وَإِنَّ رَاحِلَتَهُ لَتَقْصَعُ بِجِرَّتِهَا وَإِنَّ لُعَابَهَا لَيَسِيلُ بَيْنَ كَتِفَيَّ فَقَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ قَسَمَ لِكُلِّ إِنْسَانٍ نَصِيبَهُ مِنْ الْمِيرَاثِ وَلَا تَجُوزُ وَصِيَّةٌ لِلْوَارِثِ الْوَلَدُ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ أَلَا وَمَنْ ادَّعَى إِلَى غَيْرِ أَبِيهِ أَوْ تَوَلَّى غَيْرَ مَوَالِيهِ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَ لَا يَقْبَلُ اللَّهُ مِنْهُ صَرْفًا وَلَا عَدْلًا أَوْ عَدْلًا وَلَا صَرْفًا",
                "id": "Telah menceritakan kepada kami [Yazid bin Harun] telah mengabarkan kepada kami [Sa'id] -yakni Ibnu Abu Arubah- dari [Qatadah] dari [Syahr bin Hausyab] dari [Abdurrahman bin Ghanm] bahwa [Amru bin Kharijah Al Khusyani] menceritakan kepada mereka, bahwa Nabi shallallahu 'alaihi wasallam berkhutbah kepada mereka sedangkan beliau berada di atas untanya. Saat itu unta beliau sedang mengunyah makanan dan air liurnya menetes di antara kedua pundakku. Beliau bersabda: \"Sesungguhnya Allah 'azza wajalla telah menetapkan bagian setiap orang dalam harta warisan. Anak adalah hak sang suami, sedangkan bagi seorang pezina adalah batu (hukuman rajam). Barangsiapa menisbatkan dirinya kepada selain bapaknya atau (budak) menisbatkan diri kepada selain tuannya, maka ia akan mendapatkan laknat Allah, malaikat dan seluruh manusia. Allah tidak akan menerima amalan sunnah dan tidak pula amalan wajib, atau amalan sunnahnya dan tidak pula amalan wajibnya.\""
            },
            {
                "number": 1687,
                "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ الْخَفَّافُ قَالَ أَخْبَرَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ عَنْ عَمْرِو بْنِ خَارِجَةَ قَالَخَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ بِمِنًى عَلَى رَاحِلَتِهِ وَإِنِّي لَتَحْتَ جِرَانِ نَاقَتِهِ وَهِيَ تَقْصَعُ بِجِرَّتِهَا وَلُعَابُهَا يَسِيلُ بَيْنَ كَتِفَيَّ فَقَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ قَدْ قَسَمَ لِكُلِّ إِنْسَانٍ نَصِيبَهُ مِنْ الْمِيرَاثِ وَلَا تَجُوزُ لِوَارِثٍ وَصِيَّةٌ أَلَا وَإِنَّ الْوَلَدَ لِلْفِرَاشِ وَلِلْعَاهِرِ الْحَجَرُ أَلَا وَمَنْ ادَّعَى إِلَى غَيْرِ أَبِيهِ أَوْ تَوَلَّى غَيْرَ مَوَالِيهِ رَغْبَةً عَنْهُمْ فَعَلَيْهِ لَعْنَةُ اللَّهِ وَالْمَلَائِكَةِ وَالنَّاسِ أَجْمَعِينَقَالَ سَعِيدٌ وَحَدَّثَنَا مَطَرٌ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ عَنْ عَمْرِو بْنِ خَارِجَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ وَزَادَ مَطَرٌ فِي الْحَدِيثِ وَلَا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عَدْلٌ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا سَعِيدٌ فَذَكَرَ الْحَدِيثَ وَقَالَ قَالَ مَطَرٌ وَلَا يُقْبَلُ مِنْهُ صَرْفٌ وَلَا عَدْلٌ",
                "id": "Telah menceritakan kepada kami [Abdul Wahb Al Khaffaf] ia berkata, telah mengabarkan kepada kami [Sa'id] dari [Qatadah] dari [Syahr bin Hausyab] dari [Abdurrahman bin Ghanm] dari [Amru bin Kharijah] ia berkata, \"Di Mina Rasulullah shallallahu 'alaihi wasallam pernah berkhutbah di hadapan kami di atas unta miliknya. Saat itu aku berada tetap di bawah leher untanya yang sedang mengunyah makanan hingga airl liurnya menetes di antara kedua pundakku. Beliau bersabda: \"Sesungguhnya Allah 'azza wajalla telah menetapkan bagian setiap orang dalam harta warisan. Karena itu, wasiat tidak boleh bagi ahli waris. Anak adalah hak sang suami, sedangkan bagi seorang pezina adalah batu (hukuman rajam). Barangsiapa menisbatkan dirinya kepada selain bapaknya atau (budak) menisbatkan dirinya kepada selain tuannya, maka ia akan mendapatkan laknat Allah, malaikat dan seluruh manusia. Allah tidak akan menerima amalan sunnah dan tidak pula amalan wajib, atau amalan sunnahnya dan tidak pula amalan wajibnya.\" Sa'id berkata; Telah menceritakan kepada kami [Mathar] dari [Syahr bin Hausyab] dari [Abdurrahman bin Ghanm] dari [Amru bin Kharijah] dari Nabi shallallahu 'alaihi wasallam, seperti hadits tersebut. Dan [Mathar] menambahkan di dalam hadits itu, \"Dan tidak akan diterima amalan sunnah dan tidak pula amalan wajibnya.\" Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Sa'id] …lalu ia menyebutkan hadits tersebut.\" Sa'id berkata; Mathar menyebutkan, \"Dan tidak akan diterima amalan sunnah atau amalan wajibnya.\""
            },
            {
                "number": 1688,
                "arab": "حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ بُسْرٍ يُحَدِّثُأَنَّ أَبَاهُ صَنَعَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامًا فَدَعَاهُ فَأَجَابَهُ فَلَمَّا فَرَغَ مِنْ طَعَامِهِ قَالَ اللَّهُمَّ اغْفِرْ لَهُمْ وَارْحَمْهُمْ وَبَارِكْ لَهُمْ فِيمَا رَزَقْتَهُمْ",
                "id": "Telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Hisyam bin Yusuf] ia berkata, saya mendengar [Abdullah bin Busr] menceritakan bahwa bapaknya pernah membuat makanan untuk Nabi shallallahu 'alaihi wasallam. Lalu ia mengundang beliau, dan beliau pun memenuhi undnagan tersebut. Setelah beliau makan, beliau berdo'a: \"ALLAHUMMAGHFIR LAHUM, WARHAMHUM, WA BAARIK LAHUM FIIMAA RAZAQTAHUM (Ya Allah, ampunilah mereka, sayangi mereka dan berikanlah keberkahan pada rezeki yang Engkau berikan pada mereka).\""
            },
            {
                "number": 1689,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ قَالَ حَدَّثَنِي أَبُو الزَّاهِرِيَّةِ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍأَنَّ رَجُلًا جَاءَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَخْطُبُ النَّاسَ يَوْمَ الْجُمُعَةِ فَقَالَ اجْلِسْ فَقَدْ آذَيْتَ وَآنَيْتَ",
                "id": "Telah menceritakan kepada kami [Zaid bin Al Hubab] Telah menceritakan kepada kami [Mu'awiyah bin Shalih] ia berkata, telah menceritakan kepadaku [Abu Az Zahiriyyah] dari [Abdullah bin Busr], bahwa seorang laki-laki mendatangi Nabi shallallahu 'alaihi wasallam yang sedang berkhutbah di hadapan manusia pada hari jum'at. Beliau lalu bersabda: \"Duduklah. Sungguh, kamu telah membuat orang susah dan mengurangi kesempurnaan sholat mereka.\""
            },
            {
                "number": 1690,
                "arab": "حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنِ ابْنِ عَبْدِ اللَّهِ بْنِ بُسْرٍ عَنْ أَبِيهِ قَالَأَتَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَدَّمَتْ إِلَيْهِ جَدَّتِي تَمْرًا يُقَلِّلُهُ وَطَبَخَتْ لَهُ وَسَقَيْنَاهُمْ فَنَفِدَ الْقَدَحُ فَجِئْتُ بِقَدَحٍ آخَرَ وَكُنْتُ أَنَا الْخَادِمَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطِ الْقَدَحَ الَّذِي انْتَهَى إِلَيْهِ",
                "id": "Telah menceritakan kepada kami [Hammad bin Khalid] dari [Mu'awiyah bin Shalih] dari [Ibnu Abdullah bin Busr] dari [Bapaknya] ia berkata, \"Kami mendatangi Rasulullah shallallahu 'alaihi wasallam. Kemudian nenekku menyuguhkan buah kurma kepada beliau dan beliau pun menguranginya. Lalu nenekku memasak makanan untuk beliau dan kami juga menyuguhkan minuman kepada para sahabat yang lain hingga air yang di ceret habis. Saya pun datang dengan membawa ceret lain (yang berisi air). Saya saat itu adalah seorang pelayan. Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Berikanlah ceret itu kepada orang yang tadi mendapat giliran terakhir.\""
            },
            {
                "number": 1691,
                "arab": "حَدَّثَنَا عِصَامُ بْنُ خَالِدٍ حَدَّثَنَا الْحَسَنُ بْنُ أَيُّوبَ الْحَضْرَمِيُّ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُسْرٍ قَالَكَانَتْ أُخْتِي رُبَّمَا بَعَثَتْنِي بِالشَّيْءِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تُطْرِفُهُ إِيَّاهُ فَيَقْبَلُهُ مِنِّي",
                "id": "Telah menceritakan kepada kami [Isham bin Khalid] Telah menceritakan kepada kami [Al Hasan bin Ayyub Al Hadlrami] ia berkata, telah menceritakan kepadaku [Abdullah bin Busr] ia berkata, \"Saudara perempuanku mengutusku membawa sesuatu untuk dipersembahkan kepada Nabi shallallahu 'alaihi wasallam, maka beliau pun menerimanya dariku.\""
            },
            {
                "number": 1692,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا صَفْوَانُ بْنُ عَمْرٍو قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ بُسْرٍ الْمَازِنِيُّ قَالَبَعَثَنِي أَبِي إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَدْعُوهُ إِلَى الطَّعَامِ فَجَاءَ مَعِي فَلَمَّا دَنَوْتُ مِنْ الْمَنْزِلِ أَسْرَعْتُ فَأَعْلَمْتُ أَبَوَيَّ فَخَرَجَا فَتَلَقَّيَا رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَحَّبَا بِهِ وَوَضَعْنَا لَهُ قَطِيفَةً كَانَتْ عِنْدَنَا زِئْبِرِيَّةً فَقَعَدَ عَلَيْهَا ثُمَّ قَالَ أَبِي لِأُمِّي هَاتِ طَعَامَكِ فَجَاءَتْ بِقَصْعَةٍ فِيهَا دَقِيقٌ قَدْ عَصَدَتْهُ بِمَاءٍ وَمِلْحٍ فَوَضَعْتُهُ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ خُذُوا بِسْمِ اللَّهِ مِنْ حَوَالَيْهَا وَذَرُوا ذُرْوَتَهَا فَإِنَّ الْبَرَكَةَ فِيهَا فَأَكَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَكَلْنَا مَعَهُ وَفَضَلَ مِنْهَا فَضْلَةٌ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اللَّهُمَّ اغْفِرْ لَهُمْ وَارْحَمْهُمْ وَبَارِكْ عَلَيْهِمْ وَوَسِّعْ عَلَيْهِمْ فِي أَرْزَاقِهِمْ",
                "id": "Telah menceritakan kepada kami [Abul Mughirah] Telah menceritakan kepada kami [Shafwan bin Amru] ia berkata, telah menceritakan kepadaku [Abdullah bin Busr Al Mazini] ia berkata, \"Bapakku mengutusku kepada Rasulullah shallallahu 'alaihi wasallam untuk mengundang beliau makan. Beliau kemudian datang bersamaku, ketika hampir tiba di rumah aku bergegas memberitahukan kepada kedua orang tuaku. Keduanya lantas keluar dan menemui Rasulullah shallallahu 'alaihi wasallam, kami lantas menyiapkan tempat dengan menghamparkan tikar yang terbuat dari kulit domba, maka beliau pun duduk di atasnya. Kemudian bapakku berkata kepada ibuku, \"Bawakanlah makananmu.\" Maka ia pun datang dengan membawa mangkuk besar berisi tepung yang sudah dicampur dengan air dan garam. Aku lalu meletakkannya di hadapan Rasulullah shallallahu 'alaihi wasallam. Beliau bersabda: \"Ambillah dengan membaca 'Bismillah.' Ambillah dari sekelilingnya dan tinggalkanlah bagian atasnya. Karena sesungguhnya barakah itu terdapat di sekelilingnya.\" Rasulullah shallallahu 'alaihi wasallam kemudian makan dan kami pun makan bersamanya, beliau lalu menyisakan sedikit makanan tersebut. Setelah itu Rasulullah shallallahu 'alaihi wasallam berdo'a: \"ALLAHUMMAGHFIR LAHUM, WARHAMHUM, WA BAARIK LAHUM FIIMAA RAZAQTAHUM (Ya Allah, ampunilah mereka, sayangilah mereka, dan berikanlah keberkahan atas mereka serta lapangkanlah rezeki atas mereka.\""
            },
            {
                "number": 1693,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ حَدَّثَنَا حَسَّانُ بْنُ نُوحٍ عَنْ عَمْرِو بْنِ قَيْسٍ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ قَالَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْرَابِيَّانِ فَقَالَ أَحَدُهُمَا مَنْ خَيْرُ الرِّجَالِ يَا مُحَمَّدُ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ طَالَ عُمْرُهُ وَحَسُنَ عَمَلُهُ وَقَالَ الْآخَرُ إِنَّ شَرَائِعَ الْإِسْلَامِ قَدْ كَثُرَتْ عَلَيْنَا فَبَابٌ نَتَمَسَّكُ بِهِ جَامِعٌ قَالَ لَا يَزَالُ لِسَانُكَ رَطْبًا مِنْ ذِكْرِ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Ali bin Ayyasy] Telah menceritakan kepada kami [Hasan bin Nuh] dari [Amru bin Qais] dari [Abdullah bin Busr] ia berkata, \"Dua orang Arab dusun datang menemui Nabi shallallahu 'alaihi wasallam. Lalu salah seorang dari mereka bertanya, \"Siapakah laki-laki yang paling baik wahai Muhammad?\" Nabi shallallahu 'alaihi wasallam menjawab: \"Orang yang panjang umurnya dan baik amalnya.\" Kemudian laki-laki yang satunya lagi berkata, \"Kami telah banyak mendapatkan banyak pengajaran tentang syariat Islam, maka ajarkanlah kepada kami satu pintu yang menghimpun seluruh kebaikan yang bisa kami jadikan pedoman.\" Beliau bersabda: \"Hendaknya lisanmu selalu basah dengan dzikir kepada Allah.\""
            },
            {
                "number": 1694,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ حَدَّثَنَا حَرِيزٌ قَالَسَأَلْتُ عَبْدَ اللَّهِ بْنَ بُسْرٍ الْمَازِنِيَّ صَاحِبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ أَرَأَيْتَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشَيْخًا كَانَ قَالَ كَانَ فِي عَنْفَقَتِهِ شَعَرَاتٌ بِيضٌ",
                "id": "Telah menceritakan kepada kami [Abul Mughirah] Telah menceritakan kepada kami [Hariz] ia berkata, saya bertanya [Abdullah bin Busr] salah seorang sahabat Rasulullah shallallahu 'alaihi wasallam. Saya bertanya, \"Apakah kamu melihat bahwa Nabi shallallahu 'alaihi wasallam telah lanjut usia?\" ia menjawab: \"Di bahwa bibir beliau ada beberapa bulu yang telah memutih.\""
            },
            {
                "number": 1695,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ بْنِ خُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ قَالَجَاءَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى أَبِي فَنَزَلَ عَلَيْهِ أَوْ قَالَ لَهُ أَبِي انْزِلْ عَلَيَّ قَالَ فَأَتَاهُ بِطَعَامٍ وَحَيْسَةٍ وَسَوِيقٍ فَأَكَلَهُ وَكَانَ يَأْكُلُ التَّمْرَ وَيُلْقِي النَّوَى وَصَفَ بِأُصْبُعَيْهِ السَّبَّابَةِ وَالْوُسْطَى بِظَهْرِهِمَا مِنْ فِيهِ ثُمَّ أَتَاهُ بِشَرَابٍ فَشَرِبَ ثُمَّ نَاوَلَهُ مَنْ عَنْ يَمِينِهِ فَقَامَ فَأَخَذَ بِلِجَامِ دَابَّتِهِ فَقَالَ ادْعُ اللَّهَ عَزَّ وَجَلَّ لِي فَقَالَ اللَّهُمَّ بَارِكْ لَهُمْ فِيمَا رَزَقْتَهُمْ وَاغْفِرْ لَهُمْ وَارْحَمْهُمْ",
                "id": "Telah menceritakan kepada kami ['Affan] Telah menceritakan kepada kami [Syu'bah] dari [Yazid bin Khumair] dari [Abdullah bin Busr] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam datang menemui bapakku dan beliau singgah (di rumahnya), atau bapakku berkata kepada beliau, \"Singgahlah di tempatku.\" Kemudian bapakku menyuguhkan beberapa makanan, haisah dan sawiq, lalu beliau pun memakannya. Kemudian beliau makan kurma dan membuang biji kurma dari dlam mulutnya dengan menggunakan dua jari tangannya, jari tengah dan jari telunjuk. Bapakku kemudian menyuguhkan minuman, dan beliau pun meminumnya. Setelah itu beliau memberikan bekas air minumnya kepada orang yang ada di sebelah kanannya. Beliau kemudian bangkit dari duduknya, lantas bapakku mengmabil tali kekang unta seraya berkata, \"Berdo'alah kepada Allah 'azza wajalla untukku.\" Maka beliau pun berdo'a: \"ALLAHUMMA BAARIK LAHUM FIIMAA RAZAQTAHUM, WAGHFIR LAHUM, WARHAMHUM (Ya Allah, berkahilah rizki yang Engkau karuniakan kepada mereka, ampuni dan sayangilah mereka).\" "
            },
            {
                "number": 1696,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا شُعْبَةُ أَخْبَرَنِي يَزِيدُ بْنُ خُمَيْرٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ بُسْرٍ قَالَنَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أَبِي أَوْ قَالَ أَبِي لِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْزِلْ عَلَيَّ قَالَ فَنَزَلَ عَلَيْهِ فَأَتَاهُ بِطَعَامٍ أَوْ بِحَيْسٍ قَالَ فَأَكَلَ ثُمَّ أَتَاهُ بِشَرَابٍ قَالَ فَشَرِبَ قَالَ ثُمَّ نَاوَلَ مَنْ عَنْ يَمِينِهِ قَالَ وَكَانَ إِذَا أَكَلَ أَلْقَى النَّوَاةَ وَصَفَ شُعْبَةُ أَنَّهُ وَضَعَ النَّوَاةَ عَلَى السَّبَّابَةِ وَالْوُسْطَى ثُمَّ رَمَى بِهَا فَقَالَ لَهُ أَبِي يَا رَسُولَ اللَّهِ ادْعُ لَنَا فَقَالَ اللَّهُمَّ بَارِكْ لَهُمْ فِيمَا رَزَقْتَهُمْ وَاغْفِرْ لَهُمْ وَارْحَمْهُمْ",
                "id": "Telah menceritakan kepada kami [Bahz] Telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepadaku [Yazid bin Khumair] ia berkata, saya mendengar [Abdullah bin Busr] berkata, \"Rasulullah shallallahu 'alaihi wasallam singgah di tempat bapakku. Atau bapakku berkata kepada Rasulullah shallallahu 'alaihi wasallam.\"Singgahlah di tempatku.\" Maka beliau pun singgah. Bapakku kemudian menyuguhkan hais, beliau pun memakannya. Setelah itu bapakku membawakan minuman untuk beliau, dan beliau pun meminumnya. Kemudian beliau memberikan sisa minuman tersebut kepada orang yang berada di samping kanannya. Abdullah bin Busr berkata, \"Jika makan kurma beliau membuang bijinya dengan menjepitnya dengan kedua jarinya; yaitu jari telunjuk dan jari tengah, baru kemudian membuangnya. Bapakku kemudian berkata kepada beliau, \"Wahai Rasulullah, berdo'alah untuk kami.\" Maka beliau pun berdo'a: \"ALLAHUMMA BAARIK LAHUM FIIMAA RAZAQTAHUM, WAGHFIR LAHUM, WARHAMHUM (Ya Allah, berkahilah rizki yang Engkau karuniakan kepada mereka, ampuni dan sayangilah mereka).\" "
            },
            {
                "number": 1697,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ قَالَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ يَعْنِي ابْنَ جَابِرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ زِيَادٍ عَنِ ابْنَيْ بُسْرٍ السَّلْمَيَيْنِ قَالَدَخَلْتُ عَلَيْهِمَا فَقُلْتُ يَرْحَمُكُمَا اللَّهُ الرَّجُلُ مِنَّا يَرْكَبُ دَابَّتَهُ فَيَضْرِبُهَا بِالسَّوْطِ وَيَكْفَحُهَا بِاللِّجَامِ هَلْ سَمِعْتُمَا مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي ذَلِكَ شَيْئًا قَالَا لَا مَا سَمِعْنَا مِنْهُ فِي ذَلِكَ شَيْئًا فَإِذَا امْرَأَةٌ قَدْ نَادَتْ مِنْ جَوْفِ الْبَيْتِ أَيُّهَا السَّائِلُ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَقُولُ{ وَمَا مِنْ دَابَّةٍ فِي الْأَرْضِ وَلَا طَائِرٍ يَطِيرُ بِجَنَاحَيْهِ إِلَّا أُمَمٌ أَمْثَالُكُمْ مَا فَرَّطْنَا فِي الْكِتَابِ مِنْ شَيْءٍ }فَقَالَا هَذِهِ أُخْتُنَا وَهِيَ أَكْبَرُ مِنَّا وَقَدْ أَدْرَكَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Ali bin Bahr] ia berkata, Telah menceritakan kepada kami [Isa bin Yunus] ia berkata, Telah menceritakan kepada kami [Abdurrahman bin Yazid] -yakni Ibnu Jabir- dari [ubaidhullah bin Ziyad] dari [kedua anak Busr As Salmayaini], ubaidhullah berkata, \"Saya masuk menemui keduanya dan berkata, \"Semoga Allah merahmati kalian berdua. Seorang laki-laki dari kami menaiki kendaraannya lalu ia memukulnya dengan cemeti dan menarik tali kekangnya. Apakah kalian berdua pernah mendengar dari Rasulullah shallallahu 'alaihi wasallam, bahwa dalam hal itu terdapat dosa?\" keduanya menjawab, \"Tidak, kami tidak pernah mendengar dari beliau bahwa hal yang demikian itu termasuk dosa.\" Tiba-tiba seorang wanita menyahut dari dalam rumah, \"Wahai orang yang bertanya! Sesungguhnya Allah 'azza wajalla telah berfirman: '(Dan tiadalah binatang-binatang yang ada di bumi dan burung-burung yang terbang dengan kedua sayapnya, melainkan umat (juga) seperti kamu, tiadalah kami alpakan sesuatupun dalam Al-Kitab.' (Qs. Al An'am: 32) Kedua laki-laki itu pun berkata, \"Ini adalah saudara perempuan kami, ia lebih tua dari kami, dan ia juga telah mendapati Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 1698,
                "arab": "حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا لَيْثٌ يَعْنِي ابْنَ سَعْدٍ عَنْ يَزِيدَ يَعْنِي ابْنَ أَبِي حَبِيبٍ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ الْحَارِثِ الزُّبَيْدِيَّ يَقُولُأَنَا أَوَّلُ مَنْ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَبُولُ أَحَدُكُمْ مُسْتَقْبِلَ الْقِبْلَةِوَأَنَا أَوَّلُ مَنْ حَدَّثَ النَّاسَ بِذَلِكَ",
                "id": "Telah menceritakan kepada kami [Yunus bin Muhammad] Telah menceritakan kepada kami [Laits] -yakni Ibnu Sa'd- dari [Yazid] -yakni Ibnu Abu Habib- bahwa ia mendengar [Abdullah bin Harits Az Zubaidi] berkata, \"Saya adalah orang yang pertama kali mendengar Nabi shallallahu 'alaihi wasallam bersabda: 'Janganlah salah seorang dari kalian kencing dengan menghadap kiblat.' Dan saya juga orang yang pertama kali menceritakan hadits itu kepada manusia.\""
            },
            {
                "number": 1699,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا سُلَيْمَانُ بْنُ زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ جَزْءٍ الزُّبَيْدِيِّ قَالَأَكَلْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شِوَاءً فِي الْمَسْجِدِ فَأُقِيمَتْ الصَّلَاةُ فَأَدْخَلْنَا أَيْدِيَنَا فِي الْحَصَى ثُمَّ قُمْنَا نُصَلِّي وَلَمْ نَتَوَضَّأْ",
                "id": "Telah menceritakan kepada kami [Hasan bin Musa] Telah menceritakan kepada kami [Ibnu Lahi'ah] Telah menceritakan kepada kami [Sulaiman bin Ziyad] dari [Abdullah bin Harits bin Juz` Az Zubaidi] ia berkata, \"Kami makan daging bersama Rasulullah shallallahu 'alaihi wasallam di Masjid, kemudian iqamah sholat dikumandangkan, Maka kami pun memasukkan tangan kami ke dalam pasir kemudian berdiri untuk sholat dengan tanpa berwudlu lagi.\""
            },
            {
                "number": 1700,
                "arab": "حَدَّثَنَا حَسَنٌ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا سُلَيْمَانُ بْنُ زِيَادٍ الْحَضْرَمِيُّ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ الْحَارِثِ بْنِ جَزْءٍ الزُّبَيْدِيَّ صَاحِبَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَبُولَ أَحَدُنَا مُسْتَقْبِلَ الْقِبْلَةِ",
                "id": "Telah menceritakan kepada kami [Hasan] Telah menceritakan kepada kami [Ibnu Lahi'ah] Telah menceritakan kepada kami [Sulaiman bin Ziyad Al Hadlrami] bahwa ia mendengar [Abdullah bin Harits bin Juz` Az Zubaidi] salah seorang sahabat Nabi shallallahu 'alaihi wasallam, ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang salah seorang dari kami kencing dengan menghadap kiblat.\""
            },
            {
                "number": 1701,
                "arab": "حَدَّثَنَا هَارُونُ قَالَ أَبُو عَبْد الرَّحْمَنِ وَسَمِعْتُ أَنَا مِنْ هَارُونَ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ أَخْبَرَنِي حَيْوَةُ بْنُ شُرَيْحٍ قَالَ أَخْبَرَنِي عُقْبَةُ بْنُ مُسْلِمٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ جَزْءٍ الزُّبَيْدِيِّ قَالَكُنَّا يَوْمًا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الصُّفَّةِ فَوُضِعَ لَنَا طَعَامٌ فَأَكَلْنَا فَأُقِيمَتْ الصَّلَاةُ فَصَلَّيْنَا وَلَمْ نَتَوَضَّأْ",
                "id": "Telah menceritakan kepada kami Harun, Abu Abdurrahman berkata, aku mendengar dari [Harun] ia berkata, Telah menceritakan kepada kami [Abdullah bin Wahb] ia berkata, telah mengabarkan kepadaku [Haiwah bin Syuraih] ia berkata, telah mengabarkan kepadaku [Uqbah bin Muslim] dari [Abdullah bin Harits bin Juz` Az Zubaidi] ia berkata, \"Pada suatu hari kami berada di sisi Rasulullah shallallahu 'alaihi wasallam di Shuffah, lalu dihidangkan makanan untuk kami dan kami pun memakannya. Setelah itu iqamah sholat dikumandangkan, maka kami pun sholat dan tidak berwudlu lagi.\""
            },
            {
                "number": 1702,
                "arab": "حَدَّثَنَا هَارُونَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ حَدَّثَنِي حَيْوَةُ عَنْ عُقْبَةَ بْنِ مُسْلِمٍ التُّجِيبِيِّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْحَارِثِ بْنِ جَزْءٍ الزُّبَيْدِيَّ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُوَيْلٌ لِلْأَعْقَابِ وَبُطُونِ الْأَقْدَامِ مِنْ النَّارِ يَوْمَ الْقِيَامَةِقَالَ عَبْد اللَّهِ وَلَمْ يَرْفَعْهُ قَالَ عَبْد اللَّهِ وَسَمِعْتُهُ أَنَا مِنْ هَارُونَ",
                "id": "Telah menceritakan kepada kami [Harun] Telah menceritakan kepada kami [Abdullah bin Wahb] ia berkata, telah menceritakan kepadaku [Haiwah] dari [Uqbah bin Muslim At Tujibi] ia berkata, saya mendengar [Abdullah bin Harits bin Juz` Az Zubaidi] salah seorang dari sahabat Nabi shallallahu 'alaihi wasallam, ia berkata, \"Tumit-tumit dan telapak kaki yang tidak terbasuh air wudlu pada hari kiamat masuk ke dalam neraka.\" Abdullah berkata, \"Abdullah bin Harits tidak memarfukkan hadits tersebut.\" Abdullah kembali berkata, \"Aku mendengarnya dari Harun.\""
            },
            {
                "number": 1703,
                "arab": "حَدَّثَنَا حَسَنٌ حَدَّثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ عَنْ عُقْبَةَ بْنِ مُسْلِمٍ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْحَارِثِ بْنِ جَزْءٍ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَيْلٌ لِلْأَعْقَابِ وَبُطُونِ الْأَقْدَامِ مِنْ النَّارِ",
                "id": "Telah menceritakan kepada kami [Hasan] Telah menceritakan kepada kami [Ibnu Lahi'ah] Telah menceritakan kepada kami [Haiwah bin Syuraih] dari [Uqbah bin Muslim] ia berkata, saya mendengar [Abdullah bin Harits bin Juz`] berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tumit-tumit dan telapak kaki yang tidak terbasuh air wudlu masuk neraka.\""
            },
            {
                "number": 1704,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ قَالَ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ الْمُغِيرَةِ قَالَ أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ الْحَارِثِ بْنِ جَزْءٍ الزُّبَيْدِيُّ قَالَيَقُولُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَبُولُ أَحَدُكُمْ مُسْتَقْبِلَ الْقِبْلَةِوَأَنَا أَوَّلُ مَنْ حَدَّثَ النَّاسَ بِذَلِكَ",
                "id": "Telah menceritakan kepada kami [Yahya bin Ishaq] ia berkata, Telah menceritakan kepada kami [Ibnu Lahi'ah] dari [ubaidhullah bin Al Mughirah] ia berkata, telah mengabarkan kepadaku [Abdullah bin Harits bin Juz` Az Zubaidi] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: 'Janganlah salah seorang dari kalian kencing dengan menghadap kiblat.' Dan saya adalah orang yang pertama kali menceritakan hadits itu kepada manusia.\""
            },
            {
                "number": 1705,
                "arab": "حَدَّثَنَا مُوسَى حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ خَالِدِ بْنِ أَبِي عِمْرَانَ وَسُلَيْمَانَ بْنِ زِيَادٍ الْحَضْرَمِيِّ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ جَزْءٍ الزُّبَيْدِيِّ قَالَأَكَلْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شِوَاءً فِي الْمَسْجِدِ ثُمَّ أُقِيمَتْ الصَّلَاةُ فَضَرَبْنَا أَيْدِيَنَا فِي الْحَصَى ثُمَّ قُمْنَا فَصَلَّيْنَا وَلَمْ نَتَوَضَّأْ",
                "id": "Telah menceritakan kepada kami [Musa] Telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Khalid bin Abi Imran] dan [Sulaiman bin Ziyad Al Hadlrami] dari [Abdullah bin Harits bin Juz` Az Zubaidi] ia berkata, \"Kami makan daging bersama Rasulullah shallallahu 'alaihi wasallam di Masjid, lalu Iqamah sholat dikumandangkan, maka kami pun mengusapkan kedua tangan kami ke pasir lalu sholat tanpa berwudlu lagi.\""
            },
            {
                "number": 1706,
                "arab": "حَدَّثَنَا هَارُونُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ حَدَّثَنَا عَمْرٌو أَنَّ سُلَيْمَانَ بْنَ زِيَادٍ الْحَضْرَمِيَّ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ الْحَارِثِ بْنِ جَزْءٍ الزُّبَيْدِيَّ حَدَّثَهُأَنَّهُ مَرَّ وَصَاحِبٌ لَهُ بِأَيْمَنَ وَفِئَةٍ مِنْ قُرَيْشٍ قَدْ حَلُّوا أُزُرَهُمْ فَجَعَلُوهَا مَخَارِيقَ يَجْتَلِدُونَ بِهَا وَهُمْ عُرَاةٌ قَالَ عَبْدُ اللَّهِ فَلَمَّا مَرَرْنَا بِهِمْ قَالُوا إِنَّ هَؤُلَاءِ قِسِّيسُونَ فَدَعُوهُمْ ثُمَّ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ عَلَيْهِمْ فَلَمَّا أَبْصَرُوهُ تَبَدَّدُوا فَرَجَعَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُغْضَبًا حَتَّى دَخَلَ وَكُنْتُ أَنَا وَرَاءَ الْحُجْرَةِ فَسَمِعْتُهُ يَقُولُ سُبْحَانَ اللَّهِ لَا مِنْ اللَّهِ اسْتَحْيَوْا وَلَا مِنْ رَسُولِهِ اسْتَتَرُوا وَأُمُّ أَيْمَنَ عِنْدَهُ تَقُولُ اسْتَغْفِرْ لَهُمْ يَا رَسُولَ اللَّهِقَالَ عَبْدُ اللَّهِ فَبِلَأْيٍ مَا أَسْتَغْفِرُ لَهُمْ قَالَ عَبْد اللَّهِ وَسَمِعْتُهُ أَنَا مِنْ هَارُونَ",
                "id": "Telah menceritakan kepada kami [Harun] Telah menceritakan kepada kami [Abdullah bin Wahb] Telah menceritakan kepada kami [Amru] bahwa [Sulaiman bin Ziyad Al Hadlrami] menceritakan kepadanya, bahwa [Abdullah bin Harits bin Juz` Az Zubaidi] menceritakan kepadanya, bahwa ia dan seorang temannya pernah melewati Aiman dan sekelompok orang Quraisy yang melepas kain penutup tubuh mereka, lalu kain tersebut mereka jadikan sebagai alat untuk memukul, sedang mereka dalam keadaan telanjang. Abdullah berkata, \"Saat kami melewati mereka, orang-orang berkata, \"Sesungguhnya mereka itu adalah para pendeta, maka tinggalkanlah mereka.\" Kemudian Rasulullah shallallahu 'alaihi wasallam keluar menemui mereka, saat melihat beliau, mereka pun menyebar dan bercerai-berai. Setelah itu, Rasulullah shallallahu 'alaihi wasallam kembali dan masuk ke dalam rumah dengan perasaan marah, sementara saya berada di belakang rumah. Kemudian saya mendengar beliau bersabda: \"Maha Suci Allah! Terhadap Allah mereka tidak merasa malu, dan kepada Rasul-Nya mereka tidak memakai satir.\" Lalu Ummu Aiman yang berada di sisinya berkata, \"Mintakanlah ampunan bagi mereka wahai Rasulullah.\" Abdullah berkata, \"Setelah kesusahan dan kesempitan, saya tidak akan memintakan ampunan bagi mereka.\" Abdullah berkata, \"Dan saya mendengarnya dari Harun.\""
            },
            {
                "number": 1707,
                "arab": "حَدَّثَنَا مُوسَى بْنُ دَاوُدَ وَحَسَنُ بْنُ مُوسَى قَالَا حَدَّثَنَا ابْنُ لَهِيعَةَ وَحَسَنُ بْنُ مُوسَى قَالَ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ دَرَّاجٍ قَالَ مُوسَى فِي حَدِيثِهِ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْحَارِثِ بْنِ جَزْءٍ الزُّبَيْدِيَّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فِي النَّارِ حَيَّاتٍ كَأَمْثَالِ أَعْنَاقِ الْبُخْتِ تَلْسَعُ إِحْدَاهُنَّ اللَّسْعَةَ فَيَجِدُ حَمْوَتَهَا أَرْبَعِينَ خَرِيفًا وَإِنَّ فِي النَّارِ عَقَارِبَ كَأَمْثَالِ الْبِغَالِ الْمُوكَفَةِ تَلْسَعُ إِحْدَاهُنَّ اللَّسْعَةَ فَيَجِدُ حَمْوَتَهَا أَرْبَعِينَ سَنَةً",
                "id": "Telah menceritakan kepada kami [Musa bin Dawud] dan [Hasan bin Musa] keduanya berkata, Telah menceritakan kepada kami [Ibnu Lahi'ah], dan [Hasan bin Musa] berkata, telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Darraj]. [Musa] menyebutkan dalam haditsnya, ia berkata; aku mendengar [Abdullah bin Harits bin Juz` Az Zubaidi] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya di dalam Neraka terdapat beberapa ekor ular yang menyerupai leher Bukhtu (unta yang panjang lehernya). Jika ular tersebut mematuk, maka bekas patukannya akan tetap ada hingga empat puluh kali musim gugur. Dan dalam neraka juga terdapat kalajengking yang besarnya menyerupai Bighal beserta tali kekangnya. Jika ia menyengat dengan satu sengatan, maka bekasnya akan tetap ada hingga empat puluh kali musim gugur.\""
            },
            {
                "number": 1708,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ جَرِيرِ بْنِ حَازِمٍ قَالَ حَدَّثَنَا عَدِيُّ بْنُ عَدِيٍّ قَالَ أَخْبَرَنِي رَجَاءُ بْنُ حَيْوَةَ وَالْعُرْسُ ابْنُ عَمِيرَةَ عَنْ أَبِيهِ عَدِيٍّ قَالَخَاصَمَ رَجُلٌ مِنْ كِنْدَةَ يُقَالُ لَهُ امْرُؤُ الْقَيْسِ بْنُ عَابِسٍ رَجُلًا مِنْ حَضَرَمَوْتَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَرْضٍ فَقَضَى عَلَى الْحَضْرَمِيِّ بِالْبَيِّنَةِ فَلَمْ تَكُنْ لَهُ بَيِّنَةٌ فَقَضَى عَلَى امْرِئِ الْقَيْسِ بِالْيَمِينِ فَقَالَ الْحَضْرَمِيُّ إِنْ أَمْكَنْتَهُ مِنْ الْيَمِينِ يَا رَسُولَ اللَّهِ ذَهَبَتْ وَاللَّهِ أَوْ وَرَبِّ الْكَعْبَةِ أَرْضِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ حَلَفَ عَلَى يَمِينٍ كَاذِبَةٍ لِيَقْتَطِعَ بِهَا مَالَ أَخِيهِ لَقِيَ اللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ قَالَ رَجَاءُ وَتَلَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ{ إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا }فَقَالَ امْرُؤُ الْقَيْسِ مَاذَا لِمَنْ تَرَكَهَا يَا رَسُولَ اللَّهِ قَالَ الْجَنَّةُ قَالَ فَاشْهَدْ أَنِّي قَدْ تَرَكْتُهَا لَهُ كُلَّهَا",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Jarir bin Hazim] ia berkata, Telah menceritakan kepada kami [Adi bin Adi] ia berkata, telah mengabarkan kepadaku [Raja` bin Haiwah] dan [Al Urs bin Amirah] dari bapaknya [Adi] ia berkata, \"Seorang laki-laki dari Kindah yang biasa dipanggil Umru`ul Qais bin Abis bersengketa dengan seorang laki-laki dari Hadhramut, mereka mengadukan kepada Rasulullah shallallahu 'alaihi wasallam prihal tanah. Maka beliau memberi putusan kepada Al Hadlrami agar ia menunjukkan bukti, namun ia tidak dapat menunjukkan bukti apapun. Kemudian Rasulullah shallallahu 'alaihi wasallam memberi putusan kepada Al Qais agar ia bersumpah. Al Hadlrami pun berkata, \"Jika tuan memberi keluasan baginya untuk bersumpah, niscaya tanah itu akan menjadi miliknya. Demi Allah, atau demi Rabb-nya Ka'bah, tanah itu adalah milikku.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa bersumpah dengan sumpah palsu untuk mengambil harta saudaranya, maka ia akan menemui Allah, sedang Allah dalam keadaan murka atasnya.\" Raja` berkata, \"Lalu Rasulullah shallallahu 'alaihi wasallam membacakan ayat: '(Sesungguhnya orang-orang yang menukar janji (nya dengan) Allah dan sumpah-sumpah mereka dengan harga yang sedikit,..) ' (Qs. Ali Imran: 77). Maka Umru`ul Qais berkata, \"Wahai Rasulullah, lalu apa balasan bagi orang yang meninggalkannya?\" beliau menjawab: \"Baginya surga.\" Ia berkata, \"Saksikanlah, saya telah meninggalkannya (menyerahkan tanah itu) semua untuknya.\""
            },
            {
                "number": 1709,
                "arab": "مَرَّتَيْنِ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ قَالَ حَدَّثَنِي قَيْسٌ عَنْ عَدِيِّ ابْنِ عَمِيرَةَ الْكِنْدِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَيُّهَا النَّاسُ مَنْ عَمِلَ مِنْكُمْ لَنَا عَلَى عَمَلٍ فَكَتَمَنَا مِنْهُ مَخِيطًا فَمَا فَوْقَهُ فَهُوَ غُلٌّ يَأْتِي بِهِ يَوْمَ الْقِيَامَةِ قَالَ فَقَامَ رَجُلٌ مِنْ الْأَنْصَارِ أَسْوَدُ قَالَ مُجَالِدٌ هُوَ سَعْدُ بْنُ عُبَادَةَ كَأَنِّي أَنْظُرُ إِلَيْهِ قَالَ يَا رَسُولَ اللَّهِ اقْبَلْ عَنِّي عَمَلَكَ فَقَالَ وَمَا ذَاكَ قَالَ سَمِعْتُكَ تَقُولُ كَذَا وَكَذَا قَالَ وَأَنَا أَقُولُ ذَلِكَ الْآنَ مَنْ اسْتَعْمَلْنَاهُ عَلَى عَمَلٍ فَلْيَجِئْ بِقَلِيلِهِ وَكَثِيرِهِ فَمَا أُوتِيَ مِنْهُ أَخَذَهُ وَمَا نُهِيَ عَنْه انْتَهَىحَدَّثَنَا يَزِيدُ بْنُ هَارُونَ قَالَ أَخْبَرَنَا إِسْمَاعِيلُ عَنْ قَيْسٍ قَالَ حَدَّثَنِي عَدِيُّ ابْنُ عَمِيرَةَ فَذَكَرَ الْحَدِيثَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا ابْنُ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ عَدِيِّ ابْنِ عَمِيرَةَ الْكِنْدِيِّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ اسْتَعْمَلْنَاهُ عَلَى عَمَلٍ فَذَكَرَ مَعْنَاهُ",
                "id": "(dua kali) Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Isma'il bin Abu Khalid] ia berkata; telah menceritakan kepadaku [Qais] dari [Adi bin Amirah Al Kindi] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai sekalian manusia, siapa di antara kalian yang bekerja untuk kami, lalu ia menyembunyikan sesuatu darinya meskipun hanya benang jahit atau lebih rendah dari itu, maka hal itu adalah pengkhiatan yang akan dibawanya kelak pada hari kiamat.\" Adi bin Amirah Al Kindi berkata, \"Seorang laki-laki hitam dari kalangan Anshar kemudian berdiri, Mujalid berkata, 'Laki-laki itu adalah Sa'd bin Ubadah, ' seolah-olah saya melihatnya, ia berkata, \"Wahai Rasulullah, saya tidak mau menangani pekerjaanmu.\" Beliau bertanya: \"Kenapa begitu?\" laki-laki itu menjawab, \"Saya telah mendengarmu berkata begini dan begini.\" Beliau bersabda: \"Dan saya mengatakannya sekarang, siapa yang kami pekerjaan untuk melaksanakan suatu pekerjaan, hendaklah ia membawakannya baik sedikit maupun banyak. Apa yang diberikan hendaklah ia mengambilnya dan apa yang dilarang hendaklah ia meninggalkannya.\" Telah menceritakan kepada kami [Yazid bin Harun] ia berkata, telah mengabarkan kepada kami [Isma'il] dari [Qais] ia berkata, telah menceritakan kepadaku [Adi bin Amirah] lalu ia menyebutkan hadits tersebut.\" Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Ibnu Abu Khalid] dari [Qais bin Abu Hazim] dari [Adi bin Amirah Al Kindi] ia berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Siapa yang kami pekerjaan untuk melaksanakan suatu pekerjaan.... lalu ia menyebutkan makna hadits tersebut.\""
            },
            {
                "number": 1710,
                "arab": "حَدَّثَنَا ابْنُ نُمَيْرٍ حَدَّثَنَا سَيْفٌ قَالَ سَمِعْتُ عَدِيَّ بْنَ عَدِيٍّ الْكِنْدِيَّ يُحَدِّثُ عَنْ مُجَاهِدٍ قَالَ حَدَّثَنِي مَوْلًى لَنَا أَنَّهُ سَمِعَ عَدِيًّا يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَا يُعَذِّبُ الْعَامَّةَ بِعَمَلِ الْخَاصَّةِ حَتَّى يَرَوْا الْمُنْكَرَ بَيْنَ ظَهْرَانَيْهِمْ وَهُمْ قَادِرُونَ عَلَى أَنْ يُنْكِرُوهُ فَلَا يُنْكِرُوهُ فَإِذَا فَعَلُوا ذَلِكَ عَذَّبَ اللَّهُ الْخَاصَّةَ وَالْعَامَّةَحَدَّثَنَا يَزِيدُ بْنُ هَارُونَ عَنْ جَرِيرُ بْنُ حَازِمٍ قَالَ حَدَّثَنِي عَدِيُّ بْنُ عَدِيٍّ عَنْ رَجَاءِ بْنِ حَيْوَةَ وَالْعُرْسِ ابْنِ عَمِيرَةَ عَنْ أَبِيهِ عَدِيٍّ فَذَكَرَ الْحَدِيثَ قَالَ جَرِيرٌ وَزَادَنِي أَيُّوبُ وَكُنَّا جَمِيعًا حِينَ سَمِعْنَا الْحَدِيثَ مِنْ عَدِيٍّ قَالَ قَالَ عَدِيٌّ وَحَدَّثَنَا الْعُرْسُ ابْنُ عَمِيرَةَ فَنَزَلَتْ هَذِهِ الْآيَةُ{ إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلًا }إِلَى آخِرِهَا وَلَمْ أَحْفَظْهُ أَنَا يَوْمَئِذٍ مِنْ عَدِيٍّ",
                "id": "Telah menceritakan kepada kami [Ibnu Numair] Telah menceritakan kepada kami [Saif] ia berkata, saya mendengar [Adi bin Adi Al Kindi] menceritakan dari [Mujahid] ia berkata, telah menceritakan kepadaku [Budak milik kami] bahwa ia mendengar [Adi] berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah 'azza wajalla tidak mengadzab manusia secara umum hanya karena perbuatan dosa segelintir orang, sehingga mereka melihat kemungkaran dan mereka pun mampu untuk mengingkarinya, namun mereka tidak mengingkarinya. Jika mereka telah melakukan hal itu, maka Allah akan menyiksa segelintir orang itu dan juga manusia secara menyeluruh.\" Telah menceritakan kepada kami [Yazid bin Harun] dari [Jarir bin Hazim] ia berkata, telah menceritakan kepadaku [Adi bin Adi] dari [Raja` bin Haiwah] dan [Al Urs bin Amirah] dari bapaknya [Adi] lalu ia menyebutkan hadits tersebut.\" [Jarir] berkata, \" [Ayyub] menambahkan kepadaku, \"Ketika kami semua mendengar hadits itu dari Adi, ia berkata, \"Dan telah menceritakan kepada kami Al Ursu bin Amirah; Maka turunlah ayat ini: '(Sesungguhnya orang-orang yang menukar janji (nya dengan) Allah dan sumpah-sumpah mereka dengan harga yang sedikit..) ' (Qs. Ali Imran: 77) -hingga akhir ayat- Saat itu aku belum menghafalnya dari Adi.\""
            },
            {
                "number": 1711,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى قَالَ حَدَّثَنِي لَيْثٌ يَعْنِي ابْنَ سَعْدٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ عَنْ عَدِيِّ بْنِ عَدِيٍّ الْكِنْدِيِّ عَنْ أَبِيهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الثَّيِّبُ تُعْرِبُ عَنْ نَفْسِهَا وَالْبِكْرُ رِضَاهَا صَمْتُهَا",
                "id": "Telah menceritakan kepada kami [Ishaq bin Isa] ia berkata, telah menceritakan kepadaku [Laits] -yakni Ibnu Sa'd- ia berkata, telah menceritakan kepadaku [Abdullah bin Abdurrahman bin Abu Husain] dari [Adi bin Adi Al Kindi] dari [Bapaknya] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Seorang janda diminta pernyataan atas (keridlaan) dirinya, sedangkan keridlaan seorang gadis adalah dengan sikap diamnya.\""
            },
            {
                "number": 1712,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ إِسْمَاعِيلَ قَالَ سَمِعْتُ قَيْسًا يُحَدِّثُ عَنْ عَدِيِّ ابْنِ عَمِيرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ مَنْ اسْتَعْمَلْنَاهُ مِنْكُمْ عَلَى عَمَلٍ فَكَتَمَنَا مَخِيطًا فَهُوَ غُلٌّ يَأْتِي بِهِ يَوْمَ الْقِيَامَةِ فَقَامَ رَجُلٌ مِنْ الْقَوْمِ آدَمُ طُوَالٌ مِنْ الْأَنْصَارِ فَقَالَ لَا حَاجَةَ لِي فِي عَمَلِكَ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِمَ قَالَ إِنِّي سَمِعْتُكَ آنِفًا تَقُولُ قَالَ فَأَنَا أَقُولُ الْآنَ مَنْ اسْتَعْمَلْنَاهُ مِنْكُمْ عَلَى عَمَلٍ فَلْيَأْتِ بِقَلِيلِهِ وَكَثِيرِهِ فَإِنْ أُتِيَ بِشَيْءٍ أَخَذَهُ وَإِنْ نُهِيَ عَنْهُ انْتَهَى",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] ia berkata, Telah menceritakan kepada kami [Syu'bah] dari [Isma'il] ia berkata, saya mendengar [Qais] menceritakan dari [Adi bin Ibnu Amirah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Siapa pun dari kalian yang kami pekerjakan untuk melakukan sesuatu kemudian ia menyembunyikan sesuatu meskipun seutas benang, maka itu merupakan pengkhianatan yang akan dibawanya kelak pada hari kiamat.\" Seorang laki-laki Anshar berkulit sawo matang dengan postur tubuh yang tinggi berdiri seraya berkata, \"Saya tidak berminat sedikit pun terhadap tawaran pekerjaanmu.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda kepadanya: \"Kenapa?\" laki-laki itu menjawab, \"Saya telah mendengar apa yang tuan katakan.\" Beliau berkata: \"Jika demikian maka saya katakan, bahwa barangsiapa dari kalian yang kami pekerjakan atas suatu amalan, hendaklah ia datang dengan hasilnya, baik sedikit atau banyaknya. Jika diberi sesuatu hendaklah ia ambil, jika dilarang dari sesuatu maka hendaklah ia tinggalkan.\""
            },
            {
                "number": 1713,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ وَإِسْحَاقُ بْنُ عِيسَى وَهَذَا حَدِيثُ عَلِيٍّ قَالَ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ الْمَكِّيُّ عَنْ عَدِيِّ بْنِ عَدِيٍّ الْكِنْدِيِّ عَنْ أَبِيهِعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَشِيرُوا عَلَى النِّسَاءِ فِي أَنْفُسِهِنَّ فَقَالُوا إِنَّ الْبِكْرَ تَسْتَحِي يَا رَسُولَ اللَّهِ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الثَّيِّبُ تُعْرِبُ عَنْ نَفْسِهَا بِلِسَانِهَا وَالْبِكْرُ رِضَاهَا صَمْتُهَاحَدَّثَنَا أَحْمَدُ بْنُ الْحَجَّاجِ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ مُبَارَكٍ قَالَ أَخْبَرَنَا سَيْفُ بْنُ أَبِي سُلَيْمَانَ قَالَ سَمِعْتُ عَدِيَّ بْنَ عَدِيٍّ الْكِنْدِيَّ يَقُولُ حَدَّثَنِي مَوْلًى لَنَا أَنَّهُ سَمِعَ جَدِّي يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ عَزَّ وَجَلَّ لَا يُعَذِّبُ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Ali bin Ayyasy] dan [Ishaq bin Isa] -dan ini adalah haditsnya riwayat Ali- ia berkata, Telah menceritakan kepada kami [Laits bin Sa'd] ia berkata, telah menceritakan kepadaku [Abdullah bin Abdurrahman bin Husain Al Makki] dari [Adi bin Adi Al Kindi] dari [Bapaknya] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Beritahukanlah kepada para wanita tentang diri mereka (berkenaan dengan kesiapan mereka untuk menikah).\" Para sahabat berkata, \"Wahai Rasulullah, sesungguhnya seorang gadis itu sangat pemalu!\" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang janda dimintai persetujuan dengan lisannya. Sedangkan seorang gadis, maka keridlaannya adalah diamnya.\" Telah menceritakan kepada kami [Ahmad bin Hajjaj] ia berkata, Telah menceritakan kepada kami [Abdullah] -yakni Ibnu Mubarak- ia berkata, telah mengabarkan kepada kami [Saif bin Abu Sulaiman] ia berkata, saya mendengar [Adi bin Adi Al Kindi] berkata, telah menceritakan kepadaku budak milik kami bahwa ia mendengar Kakekku berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah 'azza wajalla tidak akan menyiksa…lalu ia menyebutkan hadits tersebut.\""
            },
            {
                "number": 1714,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ قَالَ قَرَأْتُ عَلَى الْفُضَيْلِ بْنِ مَيْسَرَةَ قَالَ حَدَّثَنِي أَبُو حَرِيزٍ أَنَّ قَيْسَ بْنَ أَبِي حَازِمٍ حَدَّثَهُ أَنَّ عَدِيَّ ابْنَ عَمِيرَةَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا سَجَدَ يُرَى بَيَاضُ إِبْطِهِ ثُمَّ إِذَا سَلَّمَ أَقْبَلَ بِوَجْهِهِ عَنْ يَمِينِهِ حَتَّى يُرَى بَيَاضُ خَدِّهِ ثُمَّ يُسَلِّمُ عَنْ يَسَارِهِ وَيُقْبِلُ بِوَجْهِهِ حَتَّى يُرَى بَيَاضُ خَدِّهِ عَنْ يَسَارِهِقَالَ أَبُو عَبْد الرَّحْمَنِ و حَدَّثَنِي يَحْيَى بْنُ مَعِينٍ قَالَ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ فَذَكَرَ الْحَدِيثَ",
                "id": "Telah menceritakan kepada kami [Ali bin Abdullah] Telah menceritakan kepada kami [Mu'tamir bin Sulaiman] ia berkata, saya telah membacakannya dihadapan [Al Fudlail bin Maisarah] ia berkata, telah menceritakan kepadaku [Abu Hariz] bahwa [Qais bin Abu Hazim] ia menceritakan kepadanya, bahwa [Adi bin Amirah] berkata, \"Jika Nabi shallallahu 'alaihi wasallam sujud makan akan terlihat pipinya yang putih. Kemudian beliau mengucapkan salam ke sebelah kirinya lalu menghadapkan wajahnya hingga putih pipinya pun kelihatan dari sebelah kirinya.\" Abu Abdurrahman berkata, telah menceritakan kepadaku [Yahya bin Ma'in] ia berkata, Telah menceritakan kepada kami [Mu'tamir bin Sulaiman] kemudian ia pun menyebutkan hadits itu."
            },
            {
                "number": 1715,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ قَالَ حَدَّثَنَا إِسْمَاعِيلُ عَنْ قَيْسٍ عَنْ مِرْدَاسٍ الْأَسْلَمِيِّ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يُقْبَضُ الصَّالِحُ الْأَوَّلُ فَالْأَوَّلُ وَيَبْقَى كَحُثَالَةِ التَّمْرِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ubaid] ia berkata, Telah menceritakan kepada kami [Isma'il] dari [Qais] dari [Mirdas Al Aslami] ia berkata, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang-orang shalih akan diwafatkan satu demi satu, hingga yang tersisa adalah orang-orang yang kuwalitasnya seperti buah kurma yang telah busuk.\""
            },
            {
                "number": 1716,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا إِسْمَاعِيلُ حَدَّثَنِي قَيْسٌ قَالَ سَمِعْتُ مِرْدَاسًا الْأَسْلَمِيَّ قَالَيُقْبَضُ الصَّالِحُونَ الْأَوَّلُ فَالْأَوَّلُ حَتَّى يَبْقَى كَحُثَالَةِ التَّمْرِ أَوْ الشَّعِيرِ لَا يُبَالِي اللَّهُ بِهِمْ شَيْئًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] Telah menceritakan kepada kami [Isma'il] telah menceritakan kepadaku [Qais] ia berkata, saya mendengar [Mirdas Al Aslami] berkata, \"Orang-orang shalih akan diwafatkan satu persatu hingga hingga yang tersisa adalah orang-orang yang kuwalitasnya seperti buah kurma atau gandum yang telah busuk. Dan Allah tidak akan memperdulikan mereka sedikit pun.\""
            },
            {
                "number": 1717,
                "arab": "حَدَّثَنَا يَعْلَى قَالَ حَدَّثَنَا إِسْمَاعِيلُ عَنْ قَيْسٍ عَنْ مِرْدَاسٍ الْأَسْلَمِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُقْبَضُ الصَّالِحُونَ الْأَوَّلُ فَالْأَوَّلُ حَتَّى يَبْقَى كَحُثَالَةِ التَّمْرِ أَوْ الشَّعِيرِ لَا يُبَالِي اللَّهُ بِهِمْ شَيْئًا",
                "id": "Telah menceritakan kepada kami [Ya'la] ia berkata, Telah menceritakan kepada kami [Isma'il] dari [Qais] dari [Mirdas Al Aslami] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang-orang shalih akan diwafatkan satu persatu hingga hingga yang tersisa adalah orang-orang yang kuwalitasnya seperti buah kurma atau gandum yang telah busuk. Dan Allah tidak akan memperdulikan mereka sedikit pun."
            },
            {
                "number": 1718,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ أَيُّوبَ عَنْ أَبِي قِلَابَةَ عَنْ أَبِي ثَعْلَبَةَأَنَّهُ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قُدُورِ أَهْلِ الْكِتَابِ فَقَالَ إِنْ لَمْ تَجِدُوا غَيْرَهَا فَاغْسِلْ وَاطْبُخْ وَسَأَلَهُ عَنْ لُحُومِ الْحُمُرِ فَنَهَاهُ عَنْ ذَلِكَ وَعَنْ كُلِّ سَبُعٍ ذِي نَابٍ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] ia berkata, Telah menceritakan kepada kami [Syu'bah] dari [Ayyub] dari [Abu Qilabah] dari [Abu Tsa'labah], bahwa ia bertanya kepada Nabi shallallahu 'alaihi wasallam mengenai bejana-bejana milik Ahli Kitab, maka beliau bersabda: \"Jika kalian tidak menemukan kecuali bejana-bejana mereka itu, maka cuci dan memasklah dengannya.\" Dia juga bertanya kepada beliau mengenai daging Himar yang jinak, lalu beliau melarangnya, serta semua daging binatang yang buas dan bertaring.\""
            },
            {
                "number": 1719,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ عَنْ دَاوُدَ عَنْ مَكْحُولٍ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَحَبَّكُمْ إِلَيَّ وَأَقْرَبَكُمْ مِنِّي فِي الْآخِرَةِ مَحَاسِنُكُمْ أَخْلَاقًا وَإِنَّ أَبْغَضَكُمْ إِلَيَّ وَأَبْعَدَكُمْ مِنِّي فِي الْآخِرَةِ مَسَاوِيكُمْ أَخْلَاقًا الثَّرْثَارُونَ الْمُتَفَيْهِقُونَ الْمُتَشَدِّقُونَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Abu Adi] dari [Dawud] dari [Makhul] dari [Abu Tsa'labah Al Khasyani] ia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pada hari kiamat orang paling saya cintai dan yang paling dekat denganku dari kalian adalah orang yang paling baik akhlaknya di antara kalian. Sedangkan orang yang saya benci dan paling jauh denganku dari kalian kelak di akhirat adalah orang yang paling buruk akhlaknya di antara kalian. Yaitu mereka yang banyak berbicara dan suka mencemooh manusia dengan kata-katanya.\""
            },
            {
                "number": 1720,
                "arab": "حَدَّثَنَا يَزِيدُ حَدَّثَنَا الْحَجَّاجُ بْنُ أَرْطَأَةَ عَنْ مَكْحُولٍ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ يَقُولُقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا أَهْلُ صَيْدٍ فَقَالَ إِذَا أَرْسَلْتَ كَلْبَكَ وَذَكَرْتَ اسْمَ اللَّهِ فَأَمْسَكَ عَلَيْكَ فَكُلْ قَالَ قُلْتُ وَإِنْ قَتَلَ قَالَ وَإِنْ قَتَلَ قَالَ قُلْتُ إِنَّا أَهْلُ رَمْيٍ قَالَ مَا رَدَّتْ عَلَيْكَ قَوْسُكَ فَكُلْ قَالَ قُلْتُ إِنَّا أَهْلُ سَفَرٍ نَمُرُّ بِالْيَهُودِ وَالنَّصَارَى وَالْمَجُوسِ وَلَا نَجِدُ غَيْرَ آنِيَتِهِمْ قَالَ فَإِنْ لَمْ تَجِدُوا غَيْرَهَا فَاغْسِلُوهَا بِالْمَاءِ ثُمَّ كُلُوا فِيهَا وَاشْرَبُوا",
                "id": "Telah menceritakan kepada kami [Yazid] Telah menceritakan kepada kami [Al Hajjaj bin Arthah] dari [Makhul] dari [Abu Tsa'labah Al Khusyani] berkata, \"Saya bertanya, \"Wahai Rasulullah, kami adalah orang-orang yang suka berburu?\" Maka beliau bersabda: \"Jika kamu melepas anjingmu dengan membaca nama Allah, lalu anjing tersebut mendapatkan hasil, maka makanlah.\" Saya bertanya lagi, \"Meskipun anjing itu membunuhnya?\" beliau menjawab: \"Ya, meskipun membunuhnya.\" Saya bertanya lagi, \"Kami juga suka pandai memanah?\" Beliau bersabda: \"Apa yang terkena oleh anak panahmu, maka makanlah.\" Saya berkata lagi, \"Kami bisa melakukan perjalanan, dan kami sering melewati orang-orang Yahudi, Nasrani dan Majusi. Dan kami tidak mendapatkan bejana kecuali bejana-bejana mereka.\" beliau bersabda: \"Jika kalian tidak lagi mendapatkan selain bejana-bejana itu, maka cucilah dengan air lalu makan dan minumlah kalian dengannya.\""
            },
            {
                "number": 1721,
                "arab": "حَدَّثَنَا حَجَّاجٌ حَدَّثَنَا لَيْثٌ قَالَ حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ عَنِ ابْنِ شِهَابٍ عَنْ أَبِي إِدْرِيسَ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ صَاحِبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُقَالَ حَرَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لُحُومَ الْحُمُرِ الْأَهْلِيَّةِ وَلَحْمَ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِ",
                "id": "Telah menceritakan kepada kami [Hajjaj] Telah menceritakan kepada kami [Laits] ia berkata, telah menceritakan kepadaku [Uqail bin Khalid] dari [Ibnu Syihab] dari [Abu Idris] dari [Abu Tsa'labah Al Khusyani] salah seorang sahabat Rasulullah shallallahu 'alaihi wasallam, bahwa ia berkata, \"Rasulullah shallallahu 'alaihi wasallam telah mengharamkan daging Himar yang jinak dan daging binatang buas yang bertaring.\""
            },
            {
                "number": 1722,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ بَحْرٍ قَالَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا عَبْدُ اللَّهِ يَعْنِي ابْنَ زَبْرٍ أَنَّهُ سَمِعَ مُسْلِمَ بْنَ مِشْكَمٍ يَقُولُ حَدَّثَنَا أَبُو ثَعْلَبَةَ الْخُشَنِيُّ قَالَكَانَ النَّاسُ إِذَا نَزَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْزِلًا فَعَسْكَرَ تَفَرَّقُوا عَنْهُ فِي الشِّعَابِ وَالْأَوْدِيَةِ فَقَامَ فِي فَقَالَ إِنَّ تَفَرُّقَكُمْ فِي الشِّعَابِ إِنَّمَا ذَلِكُمْ مِنْ الشَّيْطَانِ قَالَ فَكَانُوا بَعْدَ ذَلِكَ إِذَا نَزَلُوا انْضَمَّ بَعْضُهُمْ إِلَى بَعْضٍ حَتَّى إِنَّكَ لَتَقُولُ لَوْ بَسَطْتُ عَلَيْهِمْ كِسَاءً لَعَمَّهُمْ أَوْ نَحْوَ ذَلِكَ",
                "id": "Telah menceritakan kepada kami [Ali bin Bahr] ia berkata, Telah menceritakan kepada kami [Al Walid bin Muslim] Telah menceritakan kepada kami [Abdullah] -yakni Ibnu Zabr bahwa ia mendengar [Muslim bin Misykam] berkata, Telah menceritakan kepada kami [Abu Tsa'labah Al Khusyani] ia berkata, \"Jika Rasulullah shallallahu 'alaihi wasallam singgah di suatu tempat dan hendak mengumpulkan (para sahabat), mereka memisahkan diri darinya di bukit-bukit dan lembah. Maka beliau berdiri di hadapanku seraya bersabda: \"Berpencar-pencarnya kalian di bukit-bukit hanyalah dari setan.\" Abu Tsa'labah berkata, \"Setelah itu jika mereka singgah di suatu tempat, maka mereka saling mendekat satu sama lain, hingga kamu benar-benar akan mengatakan, 'Sekiranya saya membentangkan sehelai kain untuk mereka, niscaya kain tersebut akan dapat menampung mereka semua.' Atau ungkapan yang senada dengan itu.\""
            },
            {
                "number": 1723,
                "arab": "حَدَّثَنَا عَبْدُ الرَّزَّاقِ حَدَّثَنَا مَعْمَرٌ عَنِ الزُّهْرِيِّ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِ",
                "id": "Telah menceritakan kepada kami [Abdurrazaq] Telah menceritakan kepada kami [Ma'mar] dari [Zuhri] dari [Abu Idris Al Khaulani] dari [Abu Tsa'labah Al Khasyani] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang memakan daging binatang buas yang bertaring.\""
            },
            {
                "number": 1724,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ قَالَ أَخْبَرَنَا ابْنُ جُرَيْجٍ قَالَ أَخْبَرَنِي ابْنُ شِهَابٍ عَنْ حَدِيثِ أَبِي إِدْرِيسَ بْنِ عَبْدِ اللَّهِ فِي خِلَافَةِ عَبْدِ الْمَلِكِ أَنَّ أَبَا ثَعْلَبَةَ الْخُشَنِيَّ حَدَّثَهُأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Bakr] ia berkata, telah mengabarkan kepada kami [Ibnu Juraij] ia berkata, telah mengabarkan kepadaku [Ibnu Syihab] tentang hadits [Abu Idris bin Abdullah] pada masa kekhilafahan Abdul Malik, bahwa [Abu Tsa'labah Al Khusyani] ia menceritakan kepadanya, bahwa ia pernah mendengar Rasulullah shallallahu 'alaihi wasallam melarang (memakan daging) semua binatang buas yang bertaring.\""
            },
            {
                "number": 1725,
                "arab": "حَدَّثَنَا سُفْيَانُ عَنِ الزُّهْرِيِّ عَنْ أَبِي إِدْرِيسَ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ أَكْلِ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِ",
                "id": "Telah menceritakan kepada kami [Sufyan] dari [Zuhri] dari [Abu Idris] dari [Abu Tsa'labah Al Khusyani], bahwa Nabi shallallahu 'alaihi wasallam telah melarang makan daging setiap binatang buas yang bertaring.\""
            },
            {
                "number": 1726,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ يَحْيَى الدِّمَشْقِيُّ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْعَلَاءِ قَالَ سَمِعْتُ مُسْلِمَ بْنَ مِشْكَمٍ قَالَ سَمِعْتُ الْخُشَنِيَّ يَقُولُقُلْتُ يَا رَسُولَ اللَّهِ أَخْبِرْنِي بِمَا يَحِلُّ لِي وَيُحَرَّمُ عَلَيَّ قَالَ فَصَعَّدَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصَوَّبَ فِيَّ النَّظَرَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبِرُّ مَا سَكَنَتْ إِلَيْهِ النَّفْسُ وَاطْمَأَنَّ إِلَيْهِ الْقَلْبُ وَالْإِثْمُ مَا لَمْ تَسْكُنْ إِلَيْهِ النَّفْسُ وَلَمْ يَطْمَئِنَّ إِلَيْهِ الْقَلْبُ وَإِنْ أَفْتَاكَ الْمُفْتُونَ وَقَالَ لَا تَقْرَبْ لَحْمَ الْحِمَارِ الْأَهْلِيِّ وَلَا ذَا نَابٍ مِنْ السِّبَاعِ",
                "id": "Telah menceritakan kepada kami [Zaid bin Yahya Ad Dimasyqi] ia berkata, Telah menceritakan kepada kami [Abdullah bin Ala`] saya mendengar [Muslim bin Misykam] ia berkata, saya mendengar [Al Khusyani] berkata, \"Saya berkata, 'Wahai Rasulullah, kabarkanlah kepadaku apa yang dihalalkan bagiku dan apa yang diharamkan atasku.\" Kemudian Nabi shallallahu 'alaihi wasallam mengarahkan pandangannya kepadanku dengan tatapan yang serius. Nabi shallallahu 'alaihi wasallam lalu bersabda: \"Kebaikan itu adalah sesuatu yang menjadikan jiwa tenang dan hati merasa tentram. Sedangkan keburukan itu adalah sesuatu yang tidak dapat menjadikan jiwa tenang dan hati yang tentram, meskipun hasil sebuah fatwa.\" Beliau melanjutkan: \"Dan janganlah kamu memakan daging Himar yang jinak dan jangan pula binatang buas yang bertaring.\""
            },
            {
                "number": 1727,
                "arab": "حَدَّثَنَا يَزِيدُ قَالَ أَخْبَرَنَا دَاوُدُ عَنْ مَكْحُولٍ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَحَبُّكُمْ إِلَيَّ وَأَقْرَبُكُمْ مِنِّي مَحَاسِنُكُمْ أَخْلَاقًا وَإِنَّ أَبْغَضَكُمْ إِلَيَّ وَأَبْعَدَكُمْ مِنِّي مَسَاوِيكُمْ أَخْلَاقًا الثَّرْثَارُونَ الْمُتَشَدِّقُونَ الْمُتَفَيْهِقُونَ",
                "id": "Telah menceritakan kepada kami [Yazid] ia berkata, telah mengabarkan kepada kami [Dawud] dari [Makhul] dari [Abu Tsa'labah Al Khusyani], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang paling saya cintai dan yang paling dekat denganku (kelak di akhirat) adalah orang yang paling baik akhlaknya. Dan orang yang paling saya benci dan paling jauh denganku (kelak di akhirat) adalah orang yang paling buruk akhlaknya. Yaitu mereka yang banyak berbicara dan suka mencemooh manusia dengan kata-katanya.\""
            },
            {
                "number": 1728,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا هَمَّامٌ قَالَ حَدَّثَنَا قَتَادَةُ عَنْ شَهْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ قَالَلَمَّا وَقَعَ الطَّاعُونُ بِالشَّامِ خَطَبَ عَمْرُو بْنُ الْعَاصِ النَّاسَ فَقَالَ إِنَّ هَذَا الطَّاعُونَ رِجْسٌ فَتَفَرَّقُوا عَنْهُ فِي هَذِهِ الشِّعَابِ وَفِي هَذِهِ الْأَوْدِيَةِ فَبَلَغَ ذَلِكَ شُرَحْبِيلَ ابْنَ حَسَنَةَ قَالَ فَغَضِبَ فَجَاءَ وَهُوَ يَجُرُّ ثَوْبَهُ مُعَلِّقٌ نَعْلَهُ بِيَدِهِ وَقَالَ صَحِبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَمْرٌو أَضَلُّ مِنْ حِمَارِ أَهْلِهِ وَلَكِنَّهُ رَحْمَةُ رَبِّكُمْ وَدَعْوَةُ نَبِيِّكُمْ وَوَفَاةُ الصَّالِحِينَ قَبْلَكُمْ",
                "id": "Telah menceritakan kepada kami [Abdushshamad] Telah menceritakan kepada kami [Hammam] ia berkata, Telah menceritakan kepada kami [Qatadah] dari [Syahr] dari [Abdurrahman bin Ghanm] ia berkata, \"Ketika penyakit tha'un melanda negeri Syam, maka Amru bin Ash berkhutbah seraya mengatakan, \"Sesungguhnya penyakit tha'un ini adalah kotoran. Maka hendaklah kalian menghindar darinya dengan berpencar bukit-bukit dan lembah-lembah ini.\" Hal itu lalu sampai ke telinga [Syurahbil bin Hasanah], maka ia pun marah dan datang dengan menyeret kain dan menenteng sandalnya seraya berkata, \"Saya telah berteman dengan Rasulullah shallallahu 'alaihi wasallam. Amru itu lebih sesat daripada himar milik keluarganya. Akan tetapi hal itu adalah rahmat dari Rabb kalian, do'a dari Nabi kalian dan wafatnya orang-orang shalih sebelum kalian.\""
            },
            {
                "number": 1729,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ يَزِيدَ بْنِ خُمَيْرٍ عَنْ شُرَحْبِيلَ ابْنِ شُفْعَةَ قَالَوَقَعَ الطَّاعُونُ فَقَالَ عَمْرُو بْنُ الْعَاصِ إِنَّهُ رِجْسٌ فَتَفَرَّقُوا عَنْهُ فَبَلَغَ ذَلِكَ شُرَحْبِيلَ ابْنَ حَسَنَةَ فَقَالَ لَقَدْ صَحِبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَمْرٌو أَضَلُّ مِنْ بَعِيرِ أَهْلِهِ إِنَّهُ دَعْوَةُ نَبِيِّكُمْ وَرَحْمَةُ رَبِّكُمْ وَمَوْتُ الصَّالِحِينَ قَبْلَكُمْ فَاجْتَمِعُوا لَهُ وَلَا تَفَرَّقُوا عَنْهُ فَبَلَغَ ذَلِكَ عَمْرَو بْنَ الْعَاصِ فَقَالَ صَدَقَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Yazid bin Khumair] dari [Syurahbil bin Syuf'ah] ia berkata, \"Penyakit tha'un telah merajalela, maka Amru bin Ash berkata, \"Sesungguhnya penyakit tha'un itu adalah kotoran. Karena itu, berpencarlah kalian darinya.\" Kemudian ungkapan itu pun sampai kepada [Syurahbil bin Hasanah], maka ia berkata, \"Sungguh, saya telah bersahabat dengan Rasulullah shallallahu 'alaihi wasallam. Dan Amru lebih sesat daripada unta milik keluarganya. Sesungguhnya tha'un itu adalah do'a Nabi kalian, rahmat dari Rabb kalian dan wafatnya orang-orang shalih sebelum kalian. Maka berkumpullah kalian dan jangan kalian lari darinya.\" Perkataan Syurahbil itu pun sampai kepada Amru bin Ash, maka Amru pun berkata, \"Ia benar.\""
            },
            {
                "number": 1730,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا شُعْبَةُ قَالَ يَزِيدُ بْنُ خُمَيْرٍ أَخْبَرَنِي قَالَ سَمِعْتُ شُرَحْبِيلَ ابْنَ شُفْعَةَ يُحَدِّثُ عَنْ عَمْرِو بْنِ الْعَاصِ أَنَّ الطَّاعُونَ وَقَعَ فَقَالَ عَمْرُو بْنُ الْعَاصِ إِنَّهُ رِجْسٌ فَتَفَرَّقُوا عَنْهُ وَقَالَ شُرَحْبِيلُ ابْنُ حَسَنَةَإِنِّي قَدْ صَحِبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَمْرٌو أَضَلُّ مِنْ جَمَلِ أَهْلِهِ وَرُبَّمَا قَالَ شُعْبَةُ أَضَلُّ مِنْ بَعِيرِ أَهْلِهِ وَأَنَّهُ قَالَ إِنَّهَا رَحْمَةُ رَبِّكُمْ وَدَعْوَةُ نَبِيِّكُمْ وَمَوْتُ الصَّالِحِينَ قَبْلَكُمْ فَاجْتَمِعُوا وَلَا تَفَرَّقُوا عَنْهُ قَالَ فَبَلَغَ ذَلِكَ عَمْرَو بْنَ الْعَاصِ فَقَالَ صَدَقَ",
                "id": "Telah menceritakan kepada kami [Affan] Telah menceritakan kepada kami [Syu'bah] ia berkata, telah mengabarkan kepadaku [Yazid bin Khumair] ia berkata, saya mendengar [Syurahbil bin Syuf'ah] menceritakan dari [Amru bin Ash], bahwa penyakit tha'un telah merajalela, Amru bin Al Ash lalu berkata, \"Penyakit tha'un itu adalah kotoran. Karena itu, berpencarlah kalian darinya.\" Maka [Syurahbil bin Hasanah] berkata, \"Sesungguhnya saya telah bersahabat dengan Rasulullah shallallahu 'alaihi wasallam, dan Amru lebih sesat daripada unta milik keluarganya.\" Atau, sepertinya Syu'bah mengatakan, \"Lebih sesat daripada Ba'ir (unta) milik keluarganya.\" Kemudian Syurahbil mengatakan, \"Sesungguhnya tha'un itu adalah rahmat dari Rabb kalian, do'a dari Nabi kalian dan (sebab) wafatnya orang-orang shalih sebelum kalian. Maka berkumpullah kalian dan jangan berpencar (lari) darinya.\" Perkataan Syurahbil tersebut kemudian sampai kepada [Amru bin Ash], maka ia pun berkata, \"Ia benar.\""
            },
            {
                "number": 1731,
                "arab": "حَدَّثَنَا أَبُو سَعِيدٍ مَوْلَى بَنِي هَاشِمٍ حَدَّثَنَا ثَابِتٌ حَدَّثَنَا عَاصِمٌ عَنْ أَبِي مُنِيبٍأَنَّ عَمْرَو بْنَ الْعَاصِ قَالَ فِي الطَّاعُونِ فِي آخِرِ خُطْبَةٍ خَطَبَ النَّاسَ فَقَالَ إِنَّ هَذَا رِجْسٌ مِثْلُ السَّيْلِ مَنْ يَنْكُبْهُ أَخْطَأَهُ وَمِثْلُ النَّارِ مَنْ يَنْكُبْهَا أَخْطَأَتْهُ وَمَنْ أَقَامَ أَحْرَقَتْهُ وَآذَتْهُ فَقَالَ شُرَحْبِيلُ ابْنُ حَسَنَةَ إِنَّ هَذَا رَحْمَةُ رَبِّكُمْ وَدَعْوَةُ نَبِيِّكُمْ وَقَبْضُ الصَّالِحِينَ قَبْلَكُمْ",
                "id": "Telah menceritakan kepada kami [Abu Sa'id] budak bani Hasyim, Telah menceritakan kepada kami [Tsabit] Telah menceritakan kepada kami [Ashim] dari [Abu Munib] bahwa [Amru bin Ash] pernah berkata tentang penyakit tha'un di akhir khutbahnya di hadapan orang banyak, \"Sesungguhnya penyakit tha'un ini adalah sesuatu yang kotor sebagaimana aliran air, siapa yang tertimpa maka air itu akan merusaknya. Ia juga seperti api, siapa yang tertimpa maka api itu akan melumatnya. Barangsiapa berdiam diri (mukim), maka ia akan membakar dan menyakitinya.\" [Syurahbil bin Hasanah] lalu berkata, \"Sesungguhnya tha'un ini adalah rahmat dari Rabb kalian, do'a dari Nabi kalian dan (sebab) wafatnya orang-orang shalih sebelum kalian.\""
            },
            {
                "number": 1732,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ زَيْدِ بْنِ وَهْبٍ عَنْ عَبْدِ الرَّحْمَنِ ابْنِ حَسَنَةَ قَالَكُنَّا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي سَفَرٍ فَنَزَلْنَا أَرْضًا كَثِيرَةَ الضِّبَابِ قَالَ فَأَصَبْنَا مِنْهَا وَذَبَحْنَا قَالَ فَبَيْنَا الْقُدُورُ تَغْلِي بِهَا إِذْ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنَّ أُمَّةً مِنْ بَنِي إِسْرَائِيلَ فُقِدَتْ وَإِنِّي أَخَافُ أَنْ تَكُونَ هِيَ فَأَكْفِئُوهَا فَأَكْفَأْنَاهَا",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] Telah menceritakan kepada kami [Al A'masy] dari [Zaid bin Wahb] dari [Abdurrahman bin Hasanah] ia berkata, \"Kami pernah bersama Rasulullah shallallahu 'alaihi wasallam dalam suatu perjalanan. Lalu kami singgah di suatu tempat yang banyak biawaknya. Kemudian kami menangkap seekor darinya dan menyembelihnya. Saat direbus dalam bejana, tiba-tiba Rasulullah shallallahu 'alaihi wasallam keluar menemui kami. Beliau bersabda: \"Sesungguhnya umat dari bani Isra'il telah dikutuk, dan saya khawatir bahwa mereka dikutuk menjadi Biawak. Karena itu tumpahkanlah biawak itu?\" maka kami pun menumpahkannya.\""
            },
            {
                "number": 1733,
                "arab": "حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الْأَعْمَشُ عَنْ زَيْدِ بْنِ وَهْبٍ عَنْ عَبْدِ الرَّحْمَنِ ابْنِ حَسَنَةَ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي يَدِهِ كَهَيْئَةِ الدَّرَقَةِ قَالَ فَوَضَعَهَا ثُمَّ جَلَسَ فَبَالَ إِلَيْهِ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ بَعْضُ الْقَوْمِ انْظُرُوا إِلَيْهِ يَبُولُ كَمَا تَبُولُ الْمَرْأَةُ قَالَ فَسَمِعَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ وَيْحَكَ أَمَا عَلِمْتَ مَا أَصَابَ صَاحِبَ بَنِي إِسْرَائِيلَ كَانُوا إِذَا أَصَابَهُمْ شَيْءٌ مِنْ الْبَوْلِ قَرَضُوهُ بِالْمَقَارِيضِ فَنَهَاهُمْ فَعُذِّبَ فِي قَبْرِهِ",
                "id": "Telah menceritakan kepada kami [Abu Mu'awiyah] Telah menceritakan kepada kami [Al A'masy] dari [Zaid bin Wahb] dari [Abdurrahman bin Hasanah] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam keluar menemui kami dengan membawa perisai dari kulit.\" 'Abdurrahman berkata, \"Kemudian beliau meletakkan perisai tersebut duduk. Baru kemudian Nabi shallallahu 'alaihi wasallam kencing dengan menghadap ka arah perisai itu. Lantas sebagian orang berkata, \"Lihatlah kepadanya, ia kencing sebagaimana kencingnya seorang wanita.\" Ucapan tersebut didengar oleh Nabi shallallahu 'alaihi wasallam, maka beliau pun bersabda: \"Celaka kamu! Apakah kamu tidak tahu apa yang telah menimpa salah seorang dari bani Isra`il? Jika mereka terkena percikan air seni maka mereka memotongnya dengan gunting, lalu orang tersebut melarangnya, hingga ia pun disiksa di dalam kuburnya.\""
            },
            {
                "number": 1734,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنِ الْأَعْمَشِ وَحَدَّثَنَا وَكِيعٌ قَالَ حَدَّثَنِي الْأَعْمَشُ الْمَعْنَى عَنْ زَيْدِ بْنِ وَهْبٍ عَنْ عَبْدِ الرَّحْمَنِ ابْنِ حَسَنَةَ قَالَ وَكِيعٌ الْجُهَنِيُّ قَالَغَزَوْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَصَابَتْنَا مَجَاعَةٌ فَنَزَلْنَا بِأَرْضٍ كَثِيرَةِ الضِّبَابِ فَاتَّخَذْنَا مِنْهَا فَطَبَخْنَا فِي قُدُورِنَا فَسَأَلْنَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أُمَّةٌ فُقِدَتْ أَوْ مُسِخَتْ شَكَّ يَحْيَى وَاللَّهُ أَعْلَمُ فَأَمَرَنَا فَأَكْفَأْنَا الْقُدُورَ قَالَ وَكِيعٌ مُسِخَتْ فَأَخْشَى أَنْ تَكُونَ هَذِهِ فَأَكْفَأْنَاهَا وَإِنَّا لَجِيَاعٌ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Al A'masy]. Dan Telah menceritakan kepada kami [Waki'] ia berkata, telah menceritakan kepadaku [Al A'masy Al Ma'na] secara makna, dari [Yazid bin Wahb] dari [Abdurrahman bin Hasanah]. [Waki'] berkata; [Al Juhani] berkata, \"Kami berperang bersama Rasulullah shallallahu 'alaihi wasallam, lalu kami tertimpa kelaparan. Maka singgahlah kami di suatu tempat yang banyak biawaknya. Lalu kami mengambil beberapa ekor darinya dan memasaknya dalam bejana-bejana kami. Saat kami tanyakan hal itu kepada Nabi shallallahu 'alaihi wasallam, maka beliau menjawab: \"(Itu) adalah umat yang pernah hilang, atau diubah wujudnya.\" -Yahya masih merasa ragu, Wallahu A'lam- Kemudian beliau menyuruh (untuk membuangnya), maka kami pun menumpahkan bejana-bejana itu.\" Waki' berkata, \"Mereka telah diubah wujudnya, maka aku khawatir mereka itu adalah hewan ini. Maka kami pun menumpahkannya padahal kami dalam keadaan lapar.\""
            },
            {
                "number": 1735,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا الْأَعْمَشُ عَنْ زَيْدِ بْنِ وَهْبٍ عَنْ عَبْدِ الرَّحْمَنِ ابْنِ حَسَنَةَ قَالَكُنْتُ أَنَا وَعَمْرُو بْنُ الْعَاصِ جَالِسَيْنِ قَالَ فَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَعَهُ دَرَقَةٌ أَوْ شِبْهُهَا فَاسْتَتَرَ بِهَا فَبَالَ جَالِسًا قَالَ فَقُلْنَا أَيَبُولُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَمَا تَبُولُ الْمَرْأَةُ قَالَ فَجَاءَنَا فَقَالَ أَوَمَا عَلِمْتُمْ مَا أَصَابَ صَاحِبَ بَنِي إِسْرَائِيلَ كَانَ الرَّجُلُ مِنْهُمْ إِذَا أَصَابَهُ الشَّيْءُ مِنْ الْبَوْلِ قَرَضَهُ فَنَهَاهُمْ عَنْ ذَلِكَ فَعُذِّبَ فِي قَبْرِهِ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Al A'masy] dari [Zaid bin Wahb] dari [Abdurrahman bin Hasanah] ia berkata, \"Saya sedang duduk bersama Amru bin Ash, kemudian Rasulullah shallallahu 'alaihi wasallam keluar menemui kami dengan membawa perisai yang terbuat dari kulit. Beliau lalu berlindung di baliknya dan kencing sambil duduk. Maka kami pun bertanya: \"Apakah Rasulullah shallallahu 'alaihi wasallam kencing sebagaimana kencingnya seorang wanita. Lalu 'Abdurrahman berkata, \"Nabi shallallahu 'alaihi wasallam kemudian mendatangi kami dan bersabda: \"Apakah kalian tidak tahu apa yang telah menimpa salah seorang dari bani Isra`il, jika seorang laki-laki dari mereka terkena percikan air kencing niscaya ia akan mengguntingnya, lalu orang tersebut melarang mereka untuk melakukan hal itu, maka ia pun disiksa dalam kuburnya.\""
            },
            {
                "number": 1736,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنِ الْأَعْمَشِ قَالَ سَمِعْتُ أَبَا صَالِحٍ عَنْ عَمْرِو بْنِ الْعَاصِ قَالَنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَدْخُلَ عَلَى الْمُغَيَّبَاتِ",
                "id": "Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Al A'masy] ia berkata, saya mendengar [Abu Shalih] dari [Amru bin Ash] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam melarang kami masuk menemui para wanita yang tinggal pergi oleh suaminya.\""
            },
            {
                "number": 1737,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا مُوسَى عَنْ أَبِيهِ عَنْ أَبِي قَيْسٍ مَوْلَى عَمْرِو بْنِ الْعَاصِ عَن عَمْرِو بْنِ الْعَاصِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فَصْلًا مَا بَيْنَ صِيَامِنَا وَصِيَامِ أَهْلِ الْكِتَابِ أَكْلَةُ السَّحَرِ",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] Telah menceritakan kepada kami [Musa] dari [Bapaknya] dari [Abu Qais] budak Amru bin Ash, dari [Amru bin Ash] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya yang membedakan antara puasa kita dengan puasanya Ahli Kitab adalah makan di waktu sahur.\""
            },
            {
                "number": 1738,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَحَجَّاجٌ قَالَا حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ رَجُلٍ مِنْ أَهْلِ مِصْرَ يُحَدِّثُ عَنْ عَمْرِو بْنِ الْعَاصِ أَنَّهُ قَالَأُسِرَ مُحَمَّدُ بْنُ أَبِي بَكْرٍ فَأَبَى قَالَ فَجَعَلَ عَمْرٌو يَسْأَلُهُ يُعْجِبُهُ أَنْ يَدَّعِيَ أَمَانًا قَالَ فَقَالَ عَمْرٌو قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُجِيرُ عَلَى الْمُسْلِمِينَ أَدْنَاهُمْ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] dan [Hajjaj] keduanya berkata, Telah menceritakan kepada kami [Syu'bah] dari [Amru bin Dinar] dari [seorang laki-laki penduduk Mesir] ia menceritakan dari [Amru bin Ash] bahwa ia berkata, \"Pernah Muhammad bin Abu Bakr ditahan, namun ia menolak. Maka Amru bertanya kepadanya karena heran, Muhammad bin Abu Bakar mengklaim memiliki jaminan keamanan. Amru kemudian berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kaum muslimin yang paling rendah kedudukannya (punya hak) untuk memberi perlindungan.\""
            },
            {
                "number": 1739,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ وَحَجَّاجٌ قَالَا حَدَّثَنَا شُعْبَةُ أَخْبَرَنَا عَمْرُو بْنُ دِينَارٍ عَنْ رَجُلٍ مِنْ أَهْلِ مِصْرَ يُحَدِّثُأَنَّ عَمْرَو بْنَ الْعَاصِ أَهْدَى إِلَى نَاسٍ هَدَايَا فَفَضَّلَ عَمَّارَ بْنَ يَاسِرٍ فَقِيلَ لَهُ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ تَقْتُلُهُ الْفِئَةُ الْبَاغِيَةُ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] dan [Hajjaj] keduanya berkata, telah menceritakan kepada kami [Syu'bah] telah mengabarkan kepada kami [Amru bin Dinar] dari [seorang laki Mesir] ia menceritakan, bahwa [Amru bin Ash] memberikan hadiah kepada orang-orang, namun ia lebih mengutamakan mendahulukan Ammar bin Yasir. Maka hal itu pun ditanyakan kepadanya. Amru lantas menjawab, \"Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ia akan dibunuh oleh kelompok pemberontak.\""
            },
            {
                "number": 1740,
                "arab": "حَدَّثَنَا بَهْزٌ حَدَّثَنَا شُعْبَةُ قَالَ أَخْبَرَنِي الْحَكَمُ قَالَ سَمِعْتُ ذَكْوَانَ أَبَا صَالِحٍ يُحَدِّثُ عَنْ مَوْلًى لِعَمْرِو بْنِ الْعَاصِأَنَّ عَمْرَو بْنَ الْعَاصِ أَرْسَلَهُ إِلَى عَلِيٍّ يَسْتَأْذِنُهُ عَلَى امْرَأَتِهِ أَسْمَاءَ بِنْتِ عُمَيْسٍ فَأَذِنَ لَهُ فَتَكَلَّمَا فِي حَاجَةٍ فَلَمَّا خَرَجَ الْمَوْلَى سَأَلَهُ عَنْ ذَلِكَ فَقَالَ عَمْرٌو نَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَسْتَأْذِنَ عَلَى النِّسَاءِ إِلَّا بِإِذْنِ أَزْوَاجِهِنَّ",
                "id": "Telah menceritakan kepada kami [Bahz] Telah menceritakan kepada kami [Syu'bah] ia berkata, telah mengabarkan kepadaku [Al Hakam] ia berkata, saya mendengar [Dzakwan Abu Shalih] menceritakan dari [Budak Amru bin Ash], bahwa [Amru bin Ash] pernah mengutusnya menemui Ali untuk meminta izin agar dapat menemui isterinya, Asma binti Umais. Ali pun kemudian memberinya izin. Lalu keduanya berbicara dalam suatu keperluan, ketika budak tersebut keluar, ia pun menanyakan perihal (perizinan itu) kepada Amru. Amru kemudian menjawab, \"Rasulullah shallallahu 'alaihi wasallam telah melarang kami untuk menemui para wanita kecuali atas izin suami mereka.\""
            },
            {
                "number": 1741,
                "arab": "حَدَّثَنَا رَوْحٌ حَدَّثَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي سَعِيدُ بْنُ كَثِيرٍ أَنَّ جَعْفَرَ بْنَ الْمُطَّلِبِ أَخْبَرَهُأَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ دَخَلَ عَلَى عَمْرِو بْنِ الْعَاصِ فَدَعَاهُ إِلَى الْغَدَاءِ فَقَالَ إِنِّي صَائِمٌ ثُمَّ الثَّانِيَةَ كَذَلِكَ ثُمَّ الثَّالِثَةَ كَذَلِكَ فَقَالَ لَا إِلَّا أَنْ تَكُونَ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ إِنِّي سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
                "id": "Telah menceritakan kepada kami [Rauh] Telah menceritakan kepada kami [Ibnu Juraij] telah mengabarkan kepadaku [Sa'id bin Katsir] bahwa [Ja'far bin Muthalib] mengabarkan kepadanya, bahwa Abdullah bin Amru bin Ash pernah menemui [Amru bin Ash], lalu Amru pun mengajaknya makan siang. Abdullah lantas berkata, \"Saya sedang berpuasa.\" Kemudian Amru mengajaknya dua sampai tiga kali, namun Abdullah tetap menjawab dengan jawaban yang sama. Abdullah berkata, \"Aku tetap tidak maun, kecuali jika engkau mendengarnya dari Rasulullah shallallahu 'alaihi wasallam.\" Maka Amru bin Ash pun berkata, \"Sungguh, aku mendengarnya dari dari Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 1742,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ حَدَّثَنَا حَمَّادٌ قَالَ حَدَّثَنَا أَبُو جَعْفَرٍ الْخَطْمِيُّ عَنْ عُمَارَةَ بْنِ خُزَيْمَةَ قَالَبَيْنَا نَحْنُ مَعَ عَمْرِو بْنِ الْعَاصِ فِي حَجٍّ أَوْ عُمْرَةٍ فَقَالَ بَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا الشِّعْبِ إِذْ قَالَ انْظُرُوا هَلْ تَرَوْنَ شَيْئًا فَقُلْنَا نَرَى غِرْبَانًا فِيهَا غُرَابٌ أَعْصَمُ أَحْمَرُ الْمِنْقَارِ وَالرِّجْلَيْنِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَدْخُلُ الْجَنَّةَ مِنْ النِّسَاءِ إِلَّا مَنْ كَانَ مِنْهُنَّ مِثْلَ هَذَا الْغُرَابِ فِي الْغِرْبَانِ",
                "id": "Telah menceritakan kepada kami [Abdushshamad] Telah menceritakan kepada kami [Hammad] ia berkata, Telah menceritakan kepada kami [Abu Ja'far Al Khathmi] dari [Umarah bin Khuzaimah] ia berkata, \"Saat kami bersama [Amru bin Ash] melaksanakan haji dan umrah, ia berkata, \"Ketika kami bersama Rasulullah shallallahu 'alaihi wasallam berada di jalan bukit ini, tiba-tiba beliau bersabda: \"Lihatlah, apakah kalian melihat sesuatu?\" kami menjawab, \"Kami melihat beberapa ekor burung gagak di antaranya ada yang sayapnya berwarna putih, paruh dan kakinya berwarna merah.\" Rasulullah shallallahu 'alaihi wasallam lalu bersabda: \"Para wanita tidak akan masuk surga kecuali beberapa orang dari mereka, seperti burung gagak ini di antara burung-burung gagak lainnya.\""
            },
            {
                "number": 1743,
                "arab": "حَدَّثَنَا يَزِيدُ حَدَّثَنَا مُوسَى قَالَ سَمِعْتُ أَبِي يَقُولُ حَدَّثَنِي أَبُو قَيْسٍ مَوْلَى عَمْرِو بْنِ الْعَاصِأَنَّ عَمْرَو بْنَ الْعَاصِ كَانَ يَسْرُدُ الصَّوْمَ وَقَلَّمَا كَانَ يُصِيبُ مِنْ الْعَشَاءِ أَوَّلَ اللَّيْلِ أَكْثَرَ مَا كَانَ يُصِيبُ مِنْ السَّحَرِ قَالَ وَسَمِعْتُهُ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ فَصْلًا بَيْنَ صِيَامِنَا وَصِيَامِ أَهْلِ الْكِتَابِ أَكْلَةُ السَّحَرِ",
                "id": "Telah menceritakan kepada kami [Yazid] Telah menceritakan kepada kami [Musa] ia berkata, saya mendengar [Bapakku] berkata, telah menceritakan kepadaku [Abu Qais] budak Amru bin Ash, bahwa [Amru bin Ash] pernah melakukan puasa berturut-turut, dan ia lebih banyak makan di awal malam daripada di akhir malam. Abu Qais berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam Amru bin Ash berkata, \"Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Yang membedakan antara puasa kita dengan puasanya Ahli Kitab adalah makan di waktu sahur.'\""
            },
            {
                "number": 1744,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ قَالَ حَدَّثَنَا مُوسَى قَالَ سَمِعْتُ أَبِي يَقُولُسَمِعْتُ عَمْرَو بْنَ الْعَاصِ يَخْطُبُ النَّاسَ بِمِصْرَ يَقُولُ مَا أَبْعَدَ هَدْيَكُمْ مِنْ هَدْيِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا هُوَ فَكَانَ أَزْهَدَ النَّاسِ فِي الدُّنْيَا وَأَمَّا أَنْتُمْ فَأَرْغَبُ النَّاسِ فِيهَا",
                "id": "Telah menceritakan kepada kami [Abdullah bin Yazid] ia berkata, Telah menceritakan kepada kami [Musa] ia berkata, saya mendengar [Bapakku] berkata, saya mendengar [Amru bin Ash] berkhutbah di hadapan manusia di Mesir, ia mengatakan, \"Alangkah jauhnya perilaku kalian terhadap perilaku Nabi kalian shallallahu 'alaihi wasallam. Nabi shallallahu 'alaihi wasallam seorang yang paling zuhud di dunia, sementara kalian adalah orang-orang yang lebih mengutamakan dunia.\""
            },
            {
                "number": 1745,
                "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا حَيْوَةُ حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ عَنْ بُسْرِ بْنِ سَعَيدٍ عَنْ أَبِي قَيْسٍ مَوْلَى عَمْرِو بْنِ الْعَاصِ عَنْ عَمْرِو بْنِ الْعَاصِ أَنَّهُسَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا حَكَمَ الْحَاكِمُ فَاجْتَهَدَ فَأَصَابَ فَلَهُ أَجْرَانِ وَإِذَا حَكَمَ فَاجْتَهَدَ فَأَخْطَأَ فَلَهُ أَجْرٌقَالَ فَحَدَّثْتُ بِهَذَا الْحَدِيثِ أَبَا بَكْرِ بْنَ عَمْرِو بْنِ حَزْمٍ قَالَ هَكَذَا حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ",
                "id": "Telah menceritakan kepada kami [Abdullah bin Yazid] Telah menceritakan kepada kami [Haiwah] telah menceritakan kepadaku [Yazid bin Abdullah bin Hadi] dari [Muhammad bin Ibrahim bin Harits] dari [Busr bin Sa'id] dari [Abu Qais] budak Amru bin Ash, dari [Amru bin Ash], bahwa ia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika seorang hakim memutuskan perkara, lalu ia berijtihad dan benar dalam berijtihad, maka baginya dua pahala. Dan jika ia memutuskan suatu perkara, lalu ia berijtihad dan salah dalam ijtihadnya, maka baginya satu pahala.\" Abdullah bin Ahmad berkata, \"Saya menceritakan hadits ini kepada [Abu Bakr bin Amru bin Hazm], ia berkata, \"Seperti inilah [Abu Salamah bin 'Abdurrahman] menceritakan dari [Abu Hurairah].\""
            },
            {
                "number": 1746,
                "arab": "حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ حَدَّثَنَا الْوَلِيدُ بْنُ سُلَيْمَانَ أَنَّ الْقَاسِمَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُمْ عَنْ عَمْرِو بْنِ فُلَانٍ الْأَنْصَارِيِّ قَالَبَيْنَا هُوَ يَمْشِي قَدْ أَسْبَلَ إِزَارَهُ إِذْ لَحِقَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ أَخَذَ بِنَاصِيَةِ نَفْسِهِ وَهُوَ يَقُولُ اللَّهُمَّ عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ قَالَ عَمْرٌو فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ حَمْشُ السَّاقَيْنِ فَقَالَ يَا عَمْرُو إِنَّ اللَّهَ عَزَّ وَجَلَّ قَدْ أَحْسَنَ كُلَّ شَيْءٍ خَلَقَهُ يَا عَمْرُو وَضَرَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَرْبَعِ أَصَابِعَ مِنْ كَفِّهِ الْيُمْنَى تَحْتَ رُكْبَةِ عَمْرٍو فَقَالَ يَا عَمْرُو هَذَا مَوْضِعُ الْإِزَارِ ثُمَّ رَفَعَهَا ثُمَّ وَضَعَهَا تَحْتَ الثَّانِيَةِ فَقَالَ يَا عَمْرُو هَذَا مَوْضِعُ الْإِزَارِ",
                "id": "Telah menceritakan kepada kami [Al Walid bin Muslim] Telah menceritakan kepada kami [Al Walid bin Sulaiman] bahwa [Al Qasim bin Abdurrahman] telah menceritakan kepada mereka, dari [Amru bin Fulan Al Anshari] ia berkata, \"Bahwa saat Amru berjalan dengan kainnya yang musbil (melebihi kedua mata kaki), tiba-tiba Rasulullah shallallahu 'alaihi wasallam menjumpainya, maka beliau memegang ubun-ubunnya seraya mengatakan: \"ALLAHUMMA 'ABDUKA IBNU 'ABDIKA IBNU AMATIKA (Ya Allah! Hamba-Mu, anak hamba-Mu, dan anak hamba perempuan-Mu.\" Amru berkata, \"Aku lalu berkata, \"Wahai Rasulullah, aku adalah seorang yang kecil betisnya.\" Maka beliau bersabda: \"Wahai Amru, sesungguhnya Allah 'azza wajalla telah memperbaiki penciptaan segala sesuatu. Wahai Amru, Rasulullah shallallahu 'alaihi wasallam sambil menepuk bagian belakang lutut Amru dengan empat jari tangannya yang sebelah kanan seraya berkata, 'Wahai Amru, di sinilah posisi kain.\" Kemudian beliau pun mengangkat dan meletakkannya di bawah jarinya yang kedua seraya bersabda: \"Wahai Amru, di sinilah posisi kain.\""
            },
            {
                "number": 1747,
                "arab": "حَدَّثَنَا زَيْدُ بْنُ يَحْيَى الدِّمَشْقِيُّ قَالَ حَدَّثَنَا ابْنُ ثَوْبَانَ عَنْ أَبِيهِ عَنْ مَكْحُولٍ عَنْ كَثِيرِ بْنِ مُرَّةَ عَنْ قَيْسٍ الْجُذَامِيِّ رَجُلٍ كَانَتْ لَهُ صُحْبَةٌ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْطَى الشَّهِيدُ سِتَّ خِصَالٍ عِنْدَ أَوَّلِ قَطْرَةٍ مِنْ دَمِهِ يُكَفَّرُ عَنْهُ كُلُّ خَطِيئَةٍ وَيُرَى مَقْعَدَهُ مِنْ الْجَنَّةِ وَيُزَوَّجُ مِنْ الْحُورِ الْعِينِ وَيُؤَمَّنُ مِنْ الْفَزَعِ الْأَكْبَرِ وَمِنْ عَذَابِ الْقَبْرِ وَيُحَلَّى حُلَّةَ الْإِيمَانِ",
                "id": "Telah menceritakan kepada kami [Zaid bin Yahya Ad Dimasyqi] ia berkata, Telah menceritakan kepada kami [Ibnu Tsauban] dari [Bapaknya] dari [Makhul] dari [Katsir bin Murrah] dari [Qais Al Judzami] seorang yang pernah bersahabat dengan Nabi, ia berkata, \"Nabi shallallahu 'alaihi wasallam bersabda: \" Orang yang mati syahid akan diberikan enam hal sejak pertama kali darahnya menetes; semua dosanya akan diampuni, diperlihatkan tempat duduknya dari surga, dinikahkan dengan bidadari, diselamatkan dari kedahsyatan hari kiamat dan pedihnya adzab kubur, serta akan dipakaikan kepadanya pakaian iman.\""
            },
            {
                "number": 1748,
                "arab": "حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ قَالَ حَدَّثَنَا بَقِيَّةُ عَنْ مُحَمَّدِ بْنِ زِيَادٍ الْأَلْهَانِيِّ قَالَ حَدَّثَنِي أَبُو عِنَبَةَ قَالَ سُرَيْجٌ وَلَهُ صُحْبَةٌ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ اللَّهُ عَزَّ وَجَلَّ بِعَبْدٍ خَيْرًا عَسَلَهُ قِيلَ وَمَا عَسَلُهُ قَالَ يَفْتَحُ اللَّهُ عَزَّ وَجَلَّ لَهُ عَمَلًا صَالِحًا قَبْلَ مَوْتِهِ ثُمَّ يَقْبِضُهُ عَلَيْهِ",
                "id": "Telah menceritakan kepada kami [Syuraij bin Nu'man] ia berkata, Telah menceritakan kepada kami [Baqiyyah] dari [Muhammad bin Ziyad Al Alhani] ia berkata, telah menceritakan kepadaku [Abu Inabah] -Syuraih berkata; ia termasuk seorang sahabat- ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika Allah 'azza wajalla menginginkan kebaikan bagi seorang hamba, maka Dia akan memberinya bekal.\" Lalu ditanyakan kepada beliau, \"Bekal seperti apa yang akan diberikan-Nya.\" Beliau menjawab, \"Allah 'azza wajalla akan membukakan baginya kesempatan untuk beramal shalih sebelum ia meninggal, setelah itu Allah mewafatkannya.\""
            },
            {
                "number": 1749,
                "arab": "حَدَّثَنَا أَبُو الْمُغِيرَةِ قَالَ حَدَّثَنَا ابْنُ عَيَّاشٍ قَالَ حَدَّثَنِي شُرَحْبِيلُ بْنُ مُسْلِمٍ الْخَوْلَانِيُّ قَالَرَأَيْتُ سَبْعَةَ نَفَرٍ خَمْسَةً قَدْ صَحِبُوا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاثْنَيْنِ قَدْ أَكَلَا الدَّمَ فِي الْجَاهِلِيَّةِ وَلَمْ يَصْحَبَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَمَّا اللَّذَانِ لَمْ يَصْحَبَا النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَبُو عِنَبَةَ الْخَوْلَانِيُّ وَأَبُو فَاتِحٍ الْأَنْمَارِيُّ",
                "id": "Telah menceritakan kepada kami [Abul Mughirah] ia berkata, Telah menceritakan kepada kami [Ibnu Ayyasy] ia berkata, telah menceritakan kepadaku [Syurahbil bin Muslim Al Khaulani] ia berkata, \"Saya melihat tujuh orang, lima di antaranya pernah bersahabat dengan Nabi shallallahu 'alaihi wasallam, sedangkan yang dua orang pernah menumpahkan darah pada masa jahiliyah dan belum bersahabat dengan Nabi shallallahu 'alaihi wasallam. Adapun dua orang yang belum sempat bersahabat dengan Nabi shallallahu 'alaihi wasallam adalah Abu Inabah Al Khaulani dan Abu Fatih Al Anmari.\""
            },
            {
                "number": 1750,
                "arab": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ عَنْ مُحَمَّدِ بْنِ زِيَادٍ الْأَلْهَانِيِّ قَالَذُكِرَ عِنْدَ أَبِي عِنَبَةَ الْخَوْلَانِيِّ الشُّهَدَاءُ فَذَكَرُوا الْمَبْطُونَ وَالْمَطْعُونَ وَالنُّفَسَاءَ فَغَضِبَ أَبُو عِنَبَةَ وَقَالَ حَدَّثَنَا أَصْحَابُ نَبِيِّنَا عَنْ نَبِيِّنَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ شُهَدَاءَ اللَّهِ فِي الْأَرْضِ أُمَنَاءُ اللَّهِ فِي الْأَرْضِ فِي خَلْقِهِ قُتِلُوا أَوْ مَاتُوا",
                "id": "Telah menceritakan kepada kami [Abul Yaman] ia berkata, Telah menceritakan kepada kami [Isma'il bin Ayyasy] dari [Muhammad bin Ziyad Al Alhani] ia berkata, \"Disebutkan di sisi [Abu Inabah Al Khaulani] tentang orang yang mati syahid, lalu orang-orang pun menyebutkan orang yang mati karena sakit perut, orang yang mati karena penyakit tha'un, dan orang yang mati karena melahirkan. Abu Inabah kemudian marah dan berkata, \" [Para sahabat Rasulullah shallallahu 'alaihi wasallam] telah menceritakan kepada kami, bahwa beliau bersabda: \"Sesungguhnya hamba-hamba Allah yang mati syahid adalah orang-orang yang terpercaya di bumi, baik mati karena dibunuh atau mati dengan sendirinya.\""
            },
            {
                "number": 1751,
                "arab": "حَدَّثَنَا الْهَيْثَمُ بْنُ خَارِجَةَ قَالَ أَخْبَرَنَا الْجَرَّاحُ بْنُ مَلِيحٍ الْبَهْرَانِيُّ حِمْصِيٌّ عَنْ بَكْرِ بْنِ زُرْعَةَ الْخَوْلَانِيِّ قَالَ سَمِعْتُ أَبَا عِنَبَةَ الْخَوْلَانِيَّ يَقُولُسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يَزَالُ اللَّهُ عَزَّ وَجَلَّ يَغْرِسُ فِي هَذَا الدِّينِ بِغَرْسٍ يَسْتَعْمِلُهُمْ فِي طَاعَتِهِ",
                "id": "Telah menceritakan kepada kami [Al Haitsam bin Kharijah] ia berkata, telah mengabarkan kepada kami [Al Kharraj bin Malih Al Bahrani Himshi] dari [Bakr bin Zur'ah Al Khaulani] ia berkata, saya mendengar [Abu Inabah Al Khaulani] berkata, \"Saya mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Allah 'azza wajalla akan senantiasa menjadikan dalam agama ini seseorang (pembaharu) yang akan Dia berdayagunakan untuk ketaatan kepada-Nya.\""
            },
            {
                "number": 1752,
                "arab": "حَدَّثَنَا يَعْمَرُ بْنُ بِشْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ قَالَ حَدَّثَنَا هُشَيْمُ بْنُ بَشِيْرٍ عَنْ دَاوُدَ بْنِ عَمْرٍو عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ عَنْ سَمُرَةَ بْنِ فَاتِكٍ الْأَسَدِيِّ فَذَكَرَ حَدِيثًا قَالَ حَدَّثَنَا يَعْمَرُ بْنُ بِشْرٍ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ قَالَ حَدَّثَنَا هُشَيْمٌ عَنْ دَاوُدَ بْنِ عَمْرٍو عَنْ بُسْرِ بْنِ عُبَيْدِ اللَّهِ عَنْ سَمُرَةَ بْنِ فَاتِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نِعْمَ الْفَتَى سَمُرَةُ لَوْ أَخَذَ مِنْ لِمَّتِهِ وَشَمَّرَ مِنْ مِئْزَرِهِفَفَعَلَ ذَلِكَ سَمُرَةُ أَخَذَ مِنْ لِمَّتِهِ وَشَمَّرَ مِنْ مِئْزَرِهِ",
                "id": "Telah menceritakan kepada kami [Ya'mar bin Bisyr] ia berkata, Telah menceritakan kepada kami [Abdullah] ia berkata, Telah menceritakan kepada kami [Husyaim bin Basyir] dari [Dawud bin Amru] dari [Busr bin ubaidhullah] dari [Samurah bin Fatik Al Asadi] -lalu ia menyebutkan hadits tersebut, ia berkata- Telah menceritakan kepada kami [Ya'mar bin Bisyr] ia berkata, Telah menceritakan kepada kami [Abdullah] ia berkata, Telah menceritakan kepada kami [Husyaim] dari [Dawud bin Amru] dari [Busr bin ubaidhullah] dari [Samurah bin Fatik], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sebaik-baik pemuda adalah Samurah, sekiranya ia memangkas rambutnya yang sudah menyentuh cuping telinga, dan mau menyingsing ikatan kainnya.\" Maka Samurah pun melakukan hal itu, ia memotong rambutnya yang sudah menyentuh cuping telinga dan menyingsingkan lipatan kainnya.\""
            },
            {
                "number": 1753,
                "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ قَالَ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي مَرْزُوقٍ عَنِ الْمُغِيرَةِ بْنِ أَبِي بُرْدَةَ عَنْ زِيَادِ بْنِ نُعَيْمٍ الْحَضْرَمِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَرْبَعٌ فَرَضَهُنَّ اللَّهُ فِي الْإِسْلَامِ فَمَنْ جَاءَ بِثَلَاثٍ لَمْ يُغْنِينَ عَنْهُ شَيْئًا حَتَّى يَأْتِيَ بِهِنَّ جَمِيعًا الصَّلَاةُ وَالزَّكَاةُ وَصِيَامُ رَمَضَانَ وَحَجُّ الْبَيْتِ",
                "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] ia berkata, Telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Yazid bin Abu Habib] dari [Abu Marzuq] dari [Al Mughirah bin Abu Burdah] dari [Ziyad bin Nu'aim Al Hadlrami] ia berkata, \" Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ada empat perkara yang telah Allah wajibkan dalam Islam, siapa yang menunaikan tiga darinya, maka ketiga perkara itu belum mendatangkan kemaslahatan baginya sedikit pun hingga ia menunaikan semuanya. Yaitu sholat, zakat, puasa ramadhan dan haji ke Baitullah (Ka'bah).\""
            },
            {
                "number": 1754,
                "arab": "حَدَّثَنَا هَارُونُ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ أَنَّ أَبَا عُشَّانَةَ حَدَّثَهُ أَنَّهُ سَمِعَ عُقْبَةَ بْنَ عَامِرٍ يَقُولُ لَا أَقُولُ الْيَوْمَ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا لَمْ يَقُلْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ كَذَبَ عَلَيَّ مَا لَمْ أَقُلْ فَلْيَتَبَوَّأْ بَيْتًا مِنْ جَهَنَّمَ",
                "id": "Telah menceritakan kepada kami [Harun] ia berkata, Telah menceritakan kepada kami [Abdullah bin Wahb] dari [Amru bin Al Harits] bahwa [Abu Usysyanah] ia menceritakan kepadanya, bahwa ia telah mendengar [Uqbah bin Amir] berkata, \"Pada hari ini, saya tidak akan mengatakan terhadap Rasulullah shallallahu 'alaihi wasallam sesuatu yang tidak beliau katakan. Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa berdusta atasku dengan sesuatu yang tidak pernah aku katakan, maka hendaklah ia mempersiapkan rumahnya di neraka.\""
            },
            {
                "number": 1755,
                "arab": "وَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ رَجُلَانِ مِنْ أُمَّتِي يَقُومُ أَحَدُهُمَا اللَّيْلَ يُعَالِجُ نَفْسَهُ إِلَى الطَّهُورِ وَعَلَيْهِ عُقَدُهُ فَيَتَوَضَّأُ فَإِذَا وَضَّأَ يَدَيْهِ انْحَلَّتْ عُقْدَةٌ وَإِذَا وَضَّأَ وَجْهَهُ انْحَلَّتْ عُقْدَةٌ وَإِذَا مَسَحَ بِرَأْسِهِ انْحَلَّتْ عُقْدَةٌ وَإِذَا وَضَّأَ رِجْلَيْهِ انْحَلَّتْ عُقْدَةٌ فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ لِلَّذِينَ وَرَاءَ الْحِجَابِ انْظُرُوا إِلَى عَبْدِي هَذَا يُعَالِجُ نَفْسَهُ يَسْأَلُنِي مَا سَأَلَنِي عَبْدِي فَهُوَ لَهُ",
                "id": "Masih melalui jalur periwayatan yang sama seperti hadits sebelumnya dari [Uqbah bin Amir]; Dan saya mendengar Nabi shallallahu 'alaihi wasallam bersabda: \"Ada dua orang laki-laki dari umatku. Salah seorang bangun malam untuk membenahi dirinya, namun pada dirinya masih terdapat ikatan (syetan). Lalu ia berwudlu, dan ketika ia membasuh kedua tangannya lepaslah satu ikatan. Saat ia membasuh wajahnya lepaslah satu ikatan lagi, dan saat ia membasuh kepalanya, lepaslah satu ikatan lagi. Kemudian saat ia membasuh kakinya maka lepaslah ikatan yang terakhir dan Allah 'azza wajalla berfirman dari belakang hijab, 'Lihatlah kepada hamba-Ku ini, ia membenahi jiwanya dan memohon kepada-Ku. Apa yang diminta oleh hamba-Ku, maka hal itu adalah untukku.'\""
            },
            {
                "number": 1756,
                "arab": "حَدَّثَنَا هَارُونُ حَدَّثَنَا ابْنُ وَهْبٍ حَدَّثَنِي اللَّيْثُ عَنْ حُنَيْنِ بْنِ أَبِي حَكِيمٍ حَدَّثَهُ عَنْ عَلِيِّ بْنِ رَبَاحٍ اللَّخْمِيِّ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ قَالَأَمَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ أَقْرَأَ بِالْمُعَوِّذَاتِ دُبُرَ كُلِّ صَلَاةٍ",
                "id": "Telah menceritakan kepada kami [Harun] Telah menceritakan kepada kami [Ibnu Wahb] telah menceritakan kepadaku [Laits] dari [Hunain bin Abu Hakim] telah mengabarkan kepadanya, dari [Ali bin Rabah Al Lakhmi] dari [Uqbah bin Amir Al Juhani] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam memerintahkan kepadaku untuk membaca Al Mu'awwidzat setiap selesai sholat.\" "
            },
            {
                "number": 1757,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ قَالَ حَدَّثَنَا مُطَرِّفٌ عَنْ عِكْرِمَةَ عَنْ عُقْبَةَ بْنِ عَامِرٍ الْجُهَنِيِّ قَالَنَذَرَتْ أُخْتِي أَنْ تَمْشِيَ إِلَى الْكَعْبَةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ لَغَنِيٌّ عَنْ مَشْيِهَا لِتَرْكَبْ وَلْتُهْدِ بَدَنَةً",
                "id": "Telah menceritakan kepada kami [Affan] ia berkata, Telah menceritakan kepada kami [Abdul Aziz bin Muslim] ia berkata, Telah menceritakan kepada kami [Mutharrif] dari [Ikrimah] dari [Uqbah bin Amir Al Juhani] ia berkata, \"Saudara perempuanku bernadzar untuk berjalan kaki menuju Ka'bah, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah, benar-benar tidak membutuhkan (nadzarnya) berjalan kaki, hendaklah berkendaraan dan menyembelih kurban.\""
            },
            {
                "number": 1758,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ أَخْبَرَنَا أَبَانُ قَالَ حَدَّثَنَا قَتَادَةُ قَالَ حَدَّثَنَا نُعَيْمُ بْنُ هَمَّارٍ عَنْ عُقْبَةَ بْنِ عَامِرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ قَالَ رَبُّكُمْ أَتَعْجَزُ يَا ابْنَ آدَمَ أَنْ تُصَلِّيَ أَوَّلَ النَّهَارِ أَرْبَعَ رَكَعَاتٍ أَكْفِكَ بِهِنَّ آخِرَ يَوْمِكَ",
                "id": "Telah menceritakan kepada kami [Affan] ia berkata, telah mengabarkan kepada kami [Aban] ia berkata, Telah menceritakan kepada kami [Qatadah] ia berkata, Telah menceritakan kepada kami [Nu'aim bin Hammar] dari [Uqbah bin Amir], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Rabb kalian berfirman: 'Wahai Anak Adam, apakah kamu tidak mampu untuk menunaikan sholat empat rakaat di pagi hari? Dengannya Aku akan mencukupi kalian pada akhir hari kalian.'\""
            },
            {
                "number": 1759,
                "arab": "حَدَّثَنَا عَلِيُّ بْنُ عَاصِمٍ قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ حَرْمَلَةَ عَنْ أَبِي عَلِيٍّ الْهَمْدَانِيِّ قَالَصَحِبَنَا عُقْبَةُ بْنُ عَامِرٍ فِي سَفَرٍ فَجَعَلَ لَا يَؤُمُّنَا قَالَ فَقُلْنَا لَهُ رَحِمَكَ اللَّهُ أَلَا تَؤُمُّنَا وَأَنْتَ مِنْ أَصْحَابِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَمَّ النَّاسَ فَأَصَابَ الْوَقْتَ وَأَتَمَّ الصَّلَاةَ فَلَهُ وَلَهُمْ وَمَنْ انْتَقَصَ مِنْ ذَلِكَ فَعَلَيْهِ وَلَا عَلَيْهِمْ",
                "id": "Telah menceritakan kepada kami [Ali bin Ashim] ia berkata, telah menceritakan kepadaku [Abdurrahman bin Harmalah] dari [Abu Ali Al Hamdani] ia berkata, \"Kami menemani [Uqbah bin Amir] dalam suatu perjalanan, namun ia tidak mau menjadi imam kami (saat sholat). Maka kami pun berkata, \"Semoga Allah merahmatimu, kenapa engkau tidak ingin menjadi imam bagi kami, padahal engkau adalah sahabat Muhammad shallallahu 'alaihi wasallam? ' ia menjawab, \"Tidak, karena aku pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa menjadi imam sholat bagi manusia, lalu ia tunaikan sesuai dengan waktu dan menyempurnakan sholatnya, maka ganjaran pahalanya akan diberikan kepadanya dan kepada mereka. Namun siapa yang mengurangi kesempurnaan itu, maka kekurangan itu akan ditimpakan ke atasnya, dan bukan ke atas mereka.\""
            },
            {
                "number": 1760,
                "arab": "قَالَ أَبُو عَبْد الرَّحْمَنِ وَجَدْتُ هَذَا الْحَدِيثَ فِي كِتَابِ أَبِي بِخَطِّ يَدِهِ كَتَبَ إِلَيَّ الرَّبِيعُ بْنُ نَافِعٍ أَبُو تَوْبَةَ وَكَانَ فِي كِتَابِهِ حَدَّثَنَا الْهَيْثَمُ بْنُ حُمَيْدٍ عَنْ زَيْدِ بْنِ وَاقِدٍ عَنْ سُلَيْمَانَ بْنِ مُوسَى عَنْ كَثِيرِ بْنِ مُرَّةَ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُسِرُّ بِالْقُرْآنِ كَالْمُسِرِّ بِالصَّدَقَةِ وَالْمُجْهِرُ بِالْقُرْآنِ كَالْمُجْهِرِ بِالصَّدَقَةِ",
                "id": "Abu Abdurrahman berkata, saya mendapatkan hadits ini dalam kitab bapakku dengan tulisan tangannya sendiri; [Rabi' bin Nafi' Abu Naubah] telah menuliskan kepadaku -dan dalam kitabnya- Telah menceritakan kepada kami [Al Haitsam bin Humaid] dari [Zaid bin Waqid] dari [Sulaiman bin Musa] dari [Katsir bin Murrah] dari [Uqbah bin Amir] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Orang yang membaca al-qur'an dengan suara pelan, seperti seorang yang bersedekah secara diam-diam. Dan orang yang membaca al-qur'an dengan suara keras, seperti orang yang bersedekah dengan terang-terangan.\""
            },
            {
                "number": 1761,
                "arab": "حَدَّثَنَا عَفَّانُ قَالَ حَدَّثَنَا شُعْبَةُ قَالَ أَبُو بَكْرِ بْنُ حَفْصٍ قَالَ أَخْبَرَنِي قَالَ سَمِعْتُ أَبَا مُصَبِّحٍ أَوْ ابْنَ مُصَبِّحٍ شَكَّ أَبُو بَكْرٍ عَنِ ابْنِ السِّمْطِ عَنْ عُبَادَةَ بْنِ الصَّامِتِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَادَ عَبْدَ اللَّهِ بْنَ رَوَاحَةَ قَالَ فَمَا تَحَوَّزَ لَهُ عَنْ فِرَاشِهِ فَقَالَ أَتَدْرُونَ مَنْ شُهَدَاءُ أُمَّتِي قَالُوا قَتْلُ الْمُسْلِمِ شَهَادَةٌ قَالَ إِنَّ شُهَدَاءَ أُمَّتِي إِذًا لَقَلِيلٌ قَتْلُ الْمُسْلِمِ شَهَادَةٌ وَالطَّاعُونُ شَهَادَةٌ وَالْمَرْأَةُ يَقْتُلُهَا وَلَدُهَا جَمْعَاءَ",
                "id": "Telah menceritakan kepada kami [Affan] ia berkata, Telah menceritakan kepada kami [Syu'bah] berkata, [Abu Bakr bin Hafsh] berkata, telah mengabarkan kepadaku, ia berkata; saya mendengar [Abu Mushabbih] atau Ibnu Mushabbih -Abu Bakr ragu- dari [Ibnu As Simth] dari [Ubadah bin Shamit], bahwa Rasulullah shallallahu 'alaihi wasallam pernah menjenguk Abdullah bin Rawahah. Ubadah berkata, \"Namun ia tidak beranjak sedikitpun dari tempat tidurnya. Kemudian Nabi shallallahu 'alaihi wasallam bersabda: \"Apakah kalian tahu siapa Syuhada` (orang-orang yang mati syahid dari) dari umatku?\" para sahabat menjawab, \"Terbunuhnya seorang muslim adalah syahid.\" Beliau bersabda: \"Kalau begitu orang yang mati syahid dari umatku sedikit sekali! Terbunuhnya seorang Muslim adalah syahid, orang yang mati karena penyakit tha'un adalah syahid, dan wanita yang meninggal saat melahirkan anaknya juga syahid.\""
            },
            {
                "number": 1762,
                "arab": "حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ قَالَ حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ حَدَّثَنَا عَلِيُّ بْنُ مُدْرِكٍ عَنْ أَبِي عَامِرٍ الْأَشْعَرِيِّكَانَ رَجُلٌ قُتِلَ مِنْهُمْ بِأَوْطَاسٍ فَقَالَ لَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا أَبَا عَامِرٍ أَلَا غَيَّرْتَ فَتَلَا هَذِهِ الْآيَةَ{ يَا أَيُّهَا الَّذِينَ آمَنُوا عَلَيْكُمْ أَنْفُسَكُمْ لَا يَضُرُّكُمْ مَنْ ضَلَّ إِذَا اهْتَدَيْتُمْ }فَغَضِبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالَ أَيْنَ ذَهَبْتُمْ إِنَّمَا هِيَ يَا أَيُّهَا الَّذِينَ آمَنُوا لَا يَضُرُّكُمْ مَنْ ضَلَّ مِنْ الْكُفَّارِ إِذَا اهْتَدَيْتُمْ",
                "id": "Telah menceritakan kepada kami [Abdushshamad bin Abdul Waris] ia berkata, Telah menceritakan kepada kami [Malik bin Mighwal] Telah menceritakan kepada kami [Ali bin Mudrik] dari [Abu Amir Al Asy'ari] termasuk sahabat yang terbunuh di Authas, bahwa Nabi shallallahu 'alaihi wasallam bersabda kepadanya: \"Wahai Abu Amir, tidakkah kamu telah merubahnya?\" lalu Abu Amir pun membaca ayat: \"Hai orang-orang yang beriman, jagalah dirimu; tiadalah orang yang sesat itu akan memberi mudlarat kepadamu apabila kamu Telah mendapat petunjuk.\" (Al Maidah: 105) Maka Rasulullah shallallahu 'alaihi wasallam marah dan berkata: \"Kemana kalian ini! Sesungguhnya bunyi ayat adalah: 'Hai orang-orang yang beriman, tiadalah orang yang sesat (dari kalangan orang-orang kafir itu) akan memberi mudharat kepadamu apabila kamu telah mendapat petunjuk.'\""
            },
            {
                "number": 1763,
                "arab": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو قَالَ حَدَّثَنَا زُهَيْرٌ يَعْنِي ابْنَ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي مَالِكٍ الْأَشْجَعِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَعْظَمُ الْغُلُولِ عِنْدَ اللَّهِ ذِرَاعٌ مِنْ الْأَرْضِ تَجِدُونَ الرَّجُلَيْنِ جَارَيْنِ فِي الْأَرْضِ أَوْ فِي الدَّارِ فَيَقْتَطِعُ أَحَدُهُمَا مِنْ حَظِّ صَاحِبِهِ ذِرَاعًا فَإِذَا اقْتَطَعَهُ طُوِّقَهُ مِنْ سَبْعِ أَرَضِينَ إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Abdul Malik bin Amru] ia berkata, Telah menceritakan kepada kami [Zuhair] -yakni Ibnu Muhammad- dari [Abdullah bin Muhammad] dari [Atha bin Yasar] dari [Abu Malik Al Asyja'i] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Pengkhianatan paling besar di sisi Allah adalah terkait sehasta tanah. Kalian dapati dua orang yang laki-laki saling bertetangga, baik bertetangga dalam lahan atau tetangga rumah, lalu salah seorang dari keduanya mengambil satu hasta tanah milik saudaranya. Maka jika tetap mengambilnya, ia akan dihimpit dengan tujuh lapis bumi hingga hari kiamat.\""
            },
            {
                "number": 1764,
                "arab": "حَدَّثَنَا عَفَّانُ حَدَّثَنَا أَبُو خَلَفٍ مُوسَى بْنُ خَلَفٍ كَانَ يُعَدُّ مِنْ الْبُدَلَاءِ قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ عَنْ زَيْدِ بْنِ سَلَّامٍ عَنْ جَدِّهِ مَمْطُورٍ عَنِ الْحَارِثِ الْأَشْعَرِيِّأَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ أَمَرَ يَحْيَى بْنَ زَكَرِيَّا بِخَمْسِ كَلِمَاتٍ أَنْ يَعْمَلَ بِهِنَّ وَأَنْ يَأْمُرَ بَنِي إِسْرَائِيلَ أَنْ يَعْمَلُوا بِهِنَّ فَكَادَ أَنْ يُبْطِئَ فَقَالَ لَهُ عِيسَى إِنَّكَ قَدْ أُمِرْتَ بِخَمْسِ كَلِمَاتٍ أَنْ تَعْمَلَ بِهِنَّ وَأَنْ تَأْمُرَ بَنِي إِسْرَائِيلَ أَنْ يَعْمَلُوا بِهِنَّ فَإِمَّا أَنْ تُبَلِّغَهُنَّ وَإِمَّا أُبَلِّغَهُنَّ فَقَالَ لَهُ يَا أَخِي إِنِّي أَخْشَى إِنْ سَبَقْتَنِي أَنْ أُعَذَّبَ أَوْ يُخْسَفَ بِي قَالَ فَجَمَعَ يَحْيَى بَنِي إِسْرَائِيلَ فِي بَيْتِ الْمَقْدِسِ حَتَّى امْتَلَأَ الْمَسْجِدُ وَقُعِدَ عَلَى الشُّرَفِ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ أَمَرَنِي بِخَمْسِ كَلِمَاتٍ أَنْ أَعْمَلَ بِهِنَّ وَآمُرَكُمْ أَنْ تَعْمَلُوا بِهِنَّ أَوَّلُهُنَّ أَنْ تَعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا بِهِ شَيْئًا فَإِنَّ مَثَلَ ذَلِكَ مَثَلُ رَجُلٍ اشْتَرَى عَبْدًا مِنْ خَالِصِ مَالِهِ بِوَرِقٍ أَوْ ذَهَبٍ فَجَعَلَ يَعْمَلُ وَيُؤَدِّي عَمَلَهُ إِلَى غَيْرِ سَيِّدِهِ فَأَيُّكُمْ يَسُرُّهُ أَنْ يَكُونَ عَبْدُهُ كَذَلِكَ وَإِنَّ اللَّهَ عَزَّ وَجَلَّ خَلَقَكُمْ وَرَزَقَكُمْ فَاعْبُدُوهُ وَلَا تُشْرِكُوا بِهِ شَيْئًا وَأَمَرَكُمْ بِالصَّلَاةِ فَإِنَّ اللَّهَ عَزَّ وَجَلَّ يَنْصِبُ وَجْهَهُ لِوَجْهِ عَبْدِهِ مَا لَمْ يَلْتَفِتْ فَإِذَا صَلَّيْتُمْ فَلَا تَلْتَفِتُوا وَأَمَرَكُمْ بِالصِّيَامِ فَإِنَّ مَثَلَ ذَلِكَ كَمَثَلِ رَجُلٍ مَعَهُ صُرَّةٌ مِنْ مِسْكٍ فِي عِصَابَةٍ كُلُّهُمْ يَجِدُ رِيحَ الْمِسْكِ وَإِنَّ خُلُوفَ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ وَأَمَرَكُمْ بِالصَّدَقَةِ فَإِنَّ مَثَلَ ذَلِكَ كَمَثَلِ رَجُلٍ أَسَرَهُ الْعَدُوُّ فَشَدُّوا يَدَيْهِ إِلَى عُنُقِهِ وَقَرَّبُوهُ لِيَضْرِبُوا عُنُقَهُ فَقَالَ هَلْ لَكُمْ أَنْ أَفْتَدِيَ نَفْسِي مِنْكُمْ فَجَعَلَ يَفْتَدِي نَفْسَهُ مِنْهُمْ بِالْقَلِيلِ وَالْكَثِيرِ حَتَّى فَكَّ نَفْسَهُ وَأَمَرَكُمْ بِذِكْرِ اللَّهِ كَثِيرًا وَإِنَّ مَثَلَ ذَلِكَ كَمَثَلِ رَجُلٍ طَلَبَهُ الْعَدُوُّ سِرَاعًا فِي أَثَرِهِ فَأَتَى حِصْنًا حَصِينًا فَتَحَصَّنَ فِيهِ وَإِنَّ الْعَبْدَ أَحْصَنَ مَا يَكُونُ مِنْ الشَّيْطَانِ إِذَا كَانَ فِي ذِكْرِ اللَّهِ عَزَّ وَجَلَّ قَالَ وَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَا آمُرُكُمْ بِخَمْسٍ اللَّهُ أَمَرَنِي بِهِنَّ بِالْجَمَاعَةِ وَبِالسَّمْعِ وَالطَّاعَةِ وَالْهِجْرَةِ وَالْجِهَادِ فِي سَبِيلِ اللَّهِ فَإِنَّهُ مَنْ خَرَجَ مِنْ الْجَمَاعَةِ قِيدَ شِبْرٍ فَقَدْ خَلَعَ رِبْقَةَ الْإِسْلَامِ مِنْ عُنُقِهِ إِلَى أَنْ يَرْجِعَ وَمَنْ دَعَا بِدَعْوَى الْجَاهِلِيَّةِ فَهُوَ مِنْ جُثَا جَهَنَّمَ قَالُوا يَا رَسُولَ اللَّهِ وَإِنْ صَامَ وَصَلَّى قَالَ وَإِنْ صَامَ وَصَلَّى وَزَعَمَ أَنَّهُ مُسْلِمٌ فَادْعُوا الْمُسْلِمِينَ بِمَا سَمَّاهُمْ الْمُسْلِمِينَ الْمُؤْمِنِينَ عِبَادَ اللَّهِ عَزَّ وَجَلَّ",
                "id": "Telah menceritakan kepada kami [Affan] Telah menceritakan kepada kami [Abu Khalaf Musa bin Khalaf] seorang yang berasal dari jama'ah Balda`, ia berkata, Telah menceritakan kepada kami [Yahya bin Abu Katsir] dari [Zaid bin Sallam] dari kakeknya [Mamthur] dari [Al Harits Al Asy'ari], bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah 'azza wajalla telah memerintah Yahya bin Zakariya untuk mengamalkan lima perkara, dan agar ia juga perintahkan hal itu kepada Bani Isra`il untuk mengamalkannya, namun hal itu agaknya hampir terabaikan. Maka Isa pun berkata kepada Yahya, 'Kamu telah diperintahkan untuk mengamalkan lima perkara, dan juga memerintahkan Bani Isra`il agar mereka beramal dengannya. Karena itu, terserah padamu, apakah kamu yang akan menyampaikannya atau aku yang menyampaikannya.' Yahya berkata, 'Wahai saudaraku, sesungguhnya saya khawatir akan mendapat siksa atau ditenggelamkan jika kamu mendahuluiku dalam menyampaikannya.' Maka Yahya pun mengumpulkan Bani Isra`il di dalam Baitul Maqdis, hingga Masjid itu pun penuh. Kemudian Yahya duduk di atas tempat yang tinggi, ia lalu mengucapkan pujian dan sanjungan kepada Allah. Setelah itu Yahya berkata, 'Sesungguhnya Allah 'azza wajalla telah memerintahkan kepadaku dengan lima kalimat, yaitu agar aku beramal dengannya. Dan saya memerintahkan kalian untuk beramal dengannya. Yang pertama, hendaklah kalian beribadah kepada Allah dan tidak menyekutukan-Nya dengan sesuatu apapun. Dan perumpamaan hal itu adalah seperti seorang laki-laki yang membeli seorang budak dengan perak atau emas dari hartanya sendiri, lalu budak itu pun bekerja dan menyerahkan hasil pekerjaan kepada selain tuannya. Maka siapakah di antara kalian yang senang jika budaknya seperti itu? Dan sungguh, Allah 'azza wajalla telah menciptakan kalian dan memberi rizki kepada kalian, karena itu, beribadahlah kalian kepadanya, dan janganlah kalian menyekutukan-Nya dengan sesuatu apapun. Kedua, Allah memerintahkan kalian untuk menunaikan sholat. Dan sesungguhnya Allah 'azza wajalla menghadapkan wajah-Nya ke hadapan wajah hamba-Nya selama ia tidak menoleh. Maka jika kalian sholat, janganlah kalian memalingkan muka (menoleh kesana kemari). Ketiga, Allah memerintahkan kalian untuk berpuasa. Dan permisalan hal itu adalah, seperti seorang laki-laki yang memiliki wadah berisi misk (minyak wangi) di tengah-tengah rombongan, hingga semua orang akan mendapatkan wangi semerbaknya. Sesungguhnya bau mulut seorang yang sedang berpuasa adalah lebih wangi di sisi Allah daripada wanginya Misk. Keempat, Allah memerintahkan kalian untuk mengeluarkan Zakat. Dan perumpamaan zakat itu adalah seperti seorang laki-laki yang ditawan oleh musuh, lalu mereka mengikat kedua tangan laki-laki itu dan meletakkannya dileher, lalu mereka menyeretnya untuk menebas batang lehernya. Kemudian laki-laki itu berkata, 'Apakah kalian mau, agar aku menebus diriku dari tekanan kalian.' maka laki-laki itu pun menebus dirinya dari musuh dengan seluruh hartanya, hingga ia pun bebas. Kelima, Allah memerintahkan kalian untuk banyak berdzikir kepada Allah. Dan perumpamaan Dzikir itu adalah seperti seorang laki-laki yang dikejar oleh pasukan musuh untuk mencari jejaknya. Lalu laki-laki itu mendatangi benteng yang kuat lagi kokoh, maka ia pun berlindung di dalamnya. Dan seorang hamba akan terbebas dari gangguan setan, jika ia senantiasa berdzikir kepada Allah 'azza wajalla.'\" Al Haris berkata; Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku perintahkan kepada kalian lima perkara yang Allah telah memerintahkannya kepadaku untuk mengamalkannya; berjama'ah, siap mendengar dan taat, hijrah serta jihad di jalan Allah. Karena itu, siapa yang keluar dari jama'ah meskipun satu jengkal, maka ia telah melepas tali ikatan Islam dari lehernya hingga ia kembali. Dan barangsiapa menyeru dengan seruan jahiliyah, maka ia akan menjadi bagian batu dari batu-batu neraka jahannam.\" Para sahabat bertanya, \"Wahai Rasulullah, meskipun ia puasa dan sholat.\" beliau menjawab, \"Meskipun ia puasa dan sholat serta mengaku sebagai muslim. Karena itu, panggillah kaum muslimin dengan sebutan yang telah diberikan Allah yakni Al Muslimin, Al Mukminin, hamba-hamba Allah 'azza wajalla.\""
            },
            {
                "number": 1765,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا مُوسَى بْنُ عَلِيِّ بْنِ رَبَاحٍ عَن أَبِيهِ عَن أَبِي قَيْسٍ مَوْلَى عَمْرِو بْنِ الْعَاصِ عَن عَمْرِو بْنِ الْعَاصِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصْلُ مَا بَيْنَ صِيَامِكُمْ وَبَيْنَ صِيَامِ أَهْلِ الْكِتَابِ أَكْلَةُ السَّحَرِ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Musa bin Ali bin Rabah] dari [Bapaknya] dari [Abu Qais] budak Amru bin Ash, dari [Amru bin Ash] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Pembeda antara puasa kita dengan puasanya Ahli Kitab adalah makan di waktu sahur.\""
            },
            {
                "number": 1766,
                "arab": "حَدَّثَنَا وَكِيعٌ حَدَّثَنَا مُوسَى بْنُ عَلِيِّ بْنِ رَبَاحٍ ذَاكَ اللَّخْمِيُّ عَن أَبِيهِ قَالَ سَمِعْتُ عَمْرَو بْنَ الْعَاصِ يَقُولُقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا عَمْرُو اشْدُدْ عَلَيْكَ سِلَاحَكَ وَثِيَابَكَ وَأْتِنِي فَفَعَلْتُ فَجِئْتُهُ وَهُوَ يَتَوَضَّأُ فَصَعَّدَ فِيَّ الْبَصَرَ وَصَوَّبَهُ وَقَالَ يَا عَمْرُو إِنِّي أُرِيدُ أَنْ أَبْعَثَكَ وَجْهًا فَيُسَلِّمَكَ اللَّهُ وَيُغْنِمَكَ وَأَرْغَبُ لَكَ مِنْ الْمَالِ رَغْبَةً صَالِحَةً قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي لَمْ أُسْلِمْ رَغْبَةً فِي الْمَالِ إِنَّمَا أَسْلَمْتُ رَغْبَةً فِي الْجِهَادِ وَالْكَيْنُونَةِ مَعَكَ قَالَ يَا عَمْرُو نَعِمَّا بِالْمَالِ الصَّالِحِ لِلرَّجُلِ الصَّالِحِقَالَ كَذَا فِي النُّسْخَةِ نَعِمَّا بِنَصْبِ النُّونِ وَكَسْرِ الْعَيْنِ قَالَ أَبُو عُبَيْدٍ بِكَسْرِ النُّونِ وَالْعَيْنِ",
                "id": "Telah menceritakan kepada kami [Waki'] Telah menceritakan kepada kami [Musa bin Ali bin Rabah Al Lakhmi] dari [Bapaknya] ia berkata, saya mendengar [Amru bin Ash] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Wahai Amru, persiapkanlah senjata dan pakaianmu, lalu temuilah aku.\" Maka saya pun melakukannya dan menemui beliau yang saat itu sedang berwudlu, beliau lalu memandangiku dengan pandangan yang serius seraya berkata: \"Wahai Amru, aku akan mengutusmu dalam suatu pasukan perang, semoga Allah memberi keselamatan dan harta ghanimah, dan memberimu kesukaan pada harta dengan kesukaan yang baik.\" Amru berkata; Saya berkata, \"Wahai Rasulullah, saya memeluk Islam bukan karena kecintaanku pada harta. Akan tetapi, saya memeluk Islam karena kecintaanku terhadap jihad persahabatan denganmu.\" Beliau bersabda: \"Wahai Amru, sebaik-baik harta adalah harta yang dimiliki oleh seorang laki-laki shalih.\" Perawi berkata, \"Seperti inilah yang tercantum dalam naskah, 'Na'imma.' Dengan huruf nun yang manshub (harakat fathah) dan 'Ain yang maksur (harakat kasrah).\" Abu Ubaid berkata, \"Huruf Nun dan 'Ain adalah maksur (berharakat kasrah).\""
            },
            {
                "number": 1767,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ ثَنَا شُعْبَةُ عَن إِسْمَاعِيلَ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَن عَمْرِو بْنِ الْعَاصِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جِهَارًا غَيْرَ سِرٍّ يَقُولُ إِنَّ آلَ أَبِي فُلَانٍ لَيْسُوا لِي بِأَوْلِيَاءَ إِنَّمَا وَلِيِّيَ اللَّهُ وَصَالِحُ الْمُؤْمِنِينَ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] ia berkata, Telah menceritakan kepada kami [Syu'bah] dari [Isma'il] dari [Qais bin Abu Hazim] dari [Amru bin Ash] ia berkata, \"Saya mendengar secara terang-terangan Rasulullah shallallahu 'alaihi wasallam bersabda: \"Keluarga Abu Fulan bukanlah wali-waliku, waliku hanyalah Allah dan orang-orang shalih dari kaum mukminin.\""
            },
            {
                "number": 1768,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ ثَنَا شُعْبَةُ عَنِ الْحَكَمِ قَالَ سَمِعْتُ ذَكْوَانَ يُحَدِّثُ عَنْ مَوْلًى لِعَمْرِو بْنِ الْعَاصِأَنَّهُ أَرْسَلَهُ إِلَى عَلِيٍّ يَسْتَأْذِنُهُ عَلَى أَسْمَاءَ بِنْتِ عُمَيْسٍ فَأَذِنَ لَهُ حَتَّى إِذَا فَرَغَ مِنْ حَاجَتِهِ سَأَلَ الْمَوْلَى عَمْرًا عَنْ ذَلِكَ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَانَا أَوْ نَهَى أَنْ نَدْخُلَ عَلَى النِّسَاءِ بِغَيْرِ إِذْنِ أَزْوَاجِهِنَّ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] ia berkata, Telah menceritakan kepada kami [Syu'bah] dari [Al Hakam] ia berkata, saya mendengar [Dzakwan] menceritakan dari [budaknya Amru bin Ash], bahwa [Amru] pernah mengutusnya kepada Ali untuk minta izin agar ia dapat menemui Asma bin Umais, maka Ali pun mengizinkannya. Setelah hajatnya selesai, sang budak pun menanyakan hal itu kepada Amru. Amru lantas menjawab, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam telah melarang kami untuk menemui para wanita tanpa seizin suami-suami mereka.\""
            },
            {
                "number": 1769,
                "arab": "حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى قَالَ حَدَّثَنِي ابْنُ لَهِيعَةَ عَنْ أَبِي قَبِيلٍ عَنْ عَمْرِو بْنِ الْعَاصِ قَالَعَقَلْتُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلْفَ مَثَلٍ",
                "id": "Telah menceritakan kepada kami [Ishaq bin Isa] ia berkata, telah menceritakan kepadaku [Ibnu Lahi'ah] dari [Abu Qabil] dari [Amru bin Ash] ia berkata, \"Saya menghafal seribu perumpamaan dari Rasulullah shallallahu 'alaihi wasallam.\""
            },
            {
                "number": 1770,
                "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ خُبَيْبِ بْنِ الزُّبَيْرِ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي الْهُذَيْلِ قَالَكَانَ عَمْرُو بْنُ الْعَاصِ يَتَخَوَّلُنَا فَقَالَ رَجُلٌ مِنْ بَكْرِ بْنِ وَائِلٍ لَئِنْ لَمْ تَنْتَهِ قُرَيْشٌ لَيَضَعَنَّ اللَّهُ هَذَا الْأَمْرَ فِي جُمْهُورٍ مِنْ جَمَاهِيرِ الْعَرَبِ سِوَاهُمْ فَقَالَ عَمْرُو بْنُ الْعَاصِ كَذَبْتَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قُرَيْشٌ وُلَاةُ النَّاسِ فِي الْخَيْرِ وَالشَّرِّ إِلَى يَوْمِ الْقِيَامَةِ",
                "id": "Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami [Syu'bah] dari [Khubaib bin Zubair] ia berkata, saya mendengar [Abdullah bin Abu Al Hudzaili] berkata, \" [Amru bin Ash] memilih-milih waktu yang tetap untuk memberikan nasehat kepada kami, lalu seorang laki-laki dari Bani Bakr bin Wa`il berkata, \"Sekiranya orang-orang Quraisy tidak berhenti berbuat kemungkaran dan kemaksiatan, niscaya Allah akan meletakkan (kekhilafahan ini) di atas pundak orang-orang Arab selain mereka.\" kemudian Amru bin Ash berkata, \"Kamu dusta! Saya mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Quraisy adalah pemimpin manusia hingga hari kiamat baik dalam kebaikan maupun keburukkan.\""
            },
            {
                "number": 1771,
                "arab": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا مُوسَى يَعْنِي ابْنَ عَلِيٍّ عَن أَبِيهِ قَالَ سَمِعْتُ عَمْرَو بْنَ الْعَاصِ يَقُولُمَا أَبْعَدَ هَدْيَكُمْ مِنْ هَدْيِ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَّا هُوَ فَكَانَ أَزْهَدَ النَّاسِ فِي الدُّنْيَا وَأَنْتُمْ أَرْغَبُ النَّاسِ فِيهَا",
                "id": "Telah menceritakan kepada kami [Abdurrahman bin Mahdi] ia berkata, Telah menceritakan kepada kami [Musa] -yakni Ibnu Ali- dari [Bapaknya] ia berkata, saya mendengar [Amru bin Ash] berkata, \"Alangkah jauhnya perilaku kalian terhadap perilaku Nabi kalian shallallahu 'alaihi wasallam. Nabi shallallahu 'alaihi wasallam adalah orang yang paling zuhud terhadap dunia, sedangkan kalian adalah orang yang paling cinta terhadap dunia.\""
            },
            {
                "number": 1772,
                "arab": "حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ قَالَ أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنِ الْمُخْتَارِ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ أَبِي عُثْمَانَ قَالَ حَدَّثَنِي عَمْرُو بْنُ الْعَاصِ قَالَبَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى جَيْشِ ذَاتِ السَّلَاسِلِ قَالَ فَأَتَيْتُهُ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَيُّ النَّاسِ أَحَبُّ إِلَيْكَ قَالَ عَائِشَةُ قَالَ قُلْتُ فَمِنْ الرِّجَالِ قَالَ أَبُوهَا إِذًا قَالَ قُلْتُ ثُمَّ مَنْ قَالَ عُمَرُ قَالَ فَعَدَّ رِجَالًا",
                "id": "Telah menceritakan kepada kami [Yahya bin Hammad] ia berkata, telah mengabarkan kepada kami [Abdul Aziz bin Mukhtar] dari [Khalid Al Hadzdza`] dari [Abu Utsman] ia berkata, telah menceritakan kepadaku [Amru bin Ash] ia berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutusku dalam suatu pasukan di Dzatu Salasil, lalu saya menemui beliau dan bertanya, \"Wahai Rasulullah, siapakah di antara manusia orang yang paling anda cintai?\" beliau menjawab: \"Aisyah.\" Saya bertanya lagi, \"Kalau dari kalangan laki-laki?\" beliau menjawab: \"Bapaknya.\" Saya bertanya lagi, \"Lalu siapa lagi?\" beliau menjawab: \"Umar.\" Beliau lalu menyebutkan beberapa nama.\""
            },
            {
                "number": 1773,
                "arab": "حَدَّثَنَا حَسَنُ بْنُ مُوسَى قَالَ ثَنَا ابْنُ لَهِيعَةَ حَدَّثَنَا يَزِيدُ بْنُ أَبِي حَبِيبٍ عَن عِمْرَانَ بْنِ أَبِي أَنَسٍ عَن عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ عَن عَمْرِو بْنِ الْعَاصِ أَنَّهُ قَالَلَمَّا بَعَثَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَامَ ذَاتِ السَّلَاسِلِ قَالَ احْتَلَمْتُ فِي لَيْلَةٍ بَارِدَةٍ شَدِيدَةِ الْبَرْدِ فَأَشْفَقْتُ إِنْ اغْتَسَلْتُ أَنْ أَهْلَكَ فَتَيَمَّمْتُ ثُمَّ صَلَّيْتُ بِأَصْحَابِي صَلَاةَ الصُّبْحِ قَالَ فَلَمَّا قَدِمْنَا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَكَرْتُ ذَلِكَ لَهُ فَقَالَ يَا عَمْرُو صَلَّيْتَ بِأَصْحَابِكَ وَأَنْتَ جُنُبٌ قَالَ قُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ إِنِّي احْتَلَمْتُ فِي لَيْلَةٍ بَارِدَةٍ شَدِيدَةِ الْبَرْدِ فَأَشْفَقْتُ إِنْ اغْتَسَلْتُ أَنْ أَهْلَكَ وَذَكَرْتُ قَوْلَ اللَّهِ عَزَّ وَجَلَّ{ وَلَا تَقْتُلُوا أَنْفُسَكُمْ إِنَّ اللَّهَ كَانَ بِكُمْ رَحِيمًا }فَتَيَمَّمْتُ ثُمَّ صَلَّيْتُ فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَقُلْ شَيْئًا",
                "id": "Telah menceritakan kepada kami [Hasan bin Musa] ia berkata, Telah menceritakan kepada kami [Ibnu Lahi'ah] Telah menceritakan kepada kami [Yazid bin Abu Habib] dari [Imran bin Abu Anas] dari [Abdurrahman bin Jubair] dari [Amru bin Ash] berkata saat Rasulullah shallallahu 'alaihi wasallam mengutusnya pada tahun Dzatu Salasil, \"Pada suatu malam yang sangat dingin saya mimpi basah, jika mandi maka saya khawatir akan jatuh sakit. Maka saya pun bertayammum kemudian sholat Subuh berjama'ah bersama sahabat-sahabatku. Saat kami menemui Rasulullah shallallahu 'alaihi wasallam, maka saya pun menuturkan hal itu kepada beliau. Beliau bertanya: \"Wahai Amru, apakah kamu sholat bersama sahabat-sahabatmu sedangkan kamu dalam keadaan junub?\" saya menjawab, \"Benar. Wahai Rasulullah, saya mimpi basah pada malam yang sangat dingin sekali, jika mandi saya khawatir akan jatuh sakit. Lalu saya teringat firman Allah, '(Dan janganlah kamu membunuh dirimu. Sesungguhnya Allah adalah Maha Penyayang kepadamu) ' (Qs. An Nisa: 29) Maka saya pun bertayammum dan sholat.\" Rasulullah shallallahu 'alaihi wasallam tertawa dan beliau tidak berkata sesuatu pun."
            },
            {
                "number": 1774,
                "arab": "حَدَّثَنَا حَسَنٌ قَالَ ثَنَا ابْنُ لَهِيعَةَ قَالَ ثَنَا يَزِيدُ بْنُ أَبِي حَبِيبٍ قَالَ أَخْبَرَنِي سُوَيْدُ بْنُ قَيْسٍ عَنْ قَيْسِ بْنِ سُمَيٍّ أَنَّ عَمْرَو بْنَ الْعَاصِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أُبَايِعُكَ عَلَى أَنْ تَغْفِرَ لِي مَا تَقَدَّمَ مِنْ ذَنْبِي فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْإِسْلَامَ يَجُبُّ مَا كَانَ قَبْلَهُ وَإِنَّ الْهِجْرَةَ تَجُبُّ مَا كَانَ قَبْلَهَا قَالَ عَمْرٌو فَوَاللَّهِ إِنْ كُنْتُ لَأَشَدَّ النَّاسِ حَيَاءً مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا مَلَأْتُ عَيْنِي مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا رَاجَعْتُهُ بِمَا أُرِيدُ حَتَّى لَحِقَ بِاللَّهِ عَزَّ وَجَلَّ حَيَاءً مِنْهُ",
                "id": "Telah menceritakan kepada kami [Hasan] ia berkata, Telah menceritakan kepada kami [Ibnu Lahi'ah] ia berkata, Telah menceritakan kepada kami [Yazid bin Abu Habib] ia berkata, telah mengabarkan kepadaku [Suwaid bin Qais] dari [Qais bin Summi] bahwa [Amru bin Ash] berkata; Saya berkata, \"Wahai Rasulullah, saya berba'iat kepadamu agar engkau mengampuni dosa-dosaku yang telah lalu.\" Maka Rasulullah shallallahu 'alaihi wasallam pun bersabda: \"Sesungguhnya Islam itu menghapus dosa-dosa yang telah lalu, dan hijrah juga menghapus dosa-dosa yang telah lalu.\" Amru berkata, \"Demi Allah, saya adalah orang yang paling malu terhadap beliau, saya tidak pernah memandang Rasulullah shallallahu 'alaihi wasallam dan tidak pula meminta pertimbangan beliau terhadap sesuatu yang saya inginkan hingga beliau meninggal.\""
            },
            {
                "number": 1775,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ قَالَ حَدَّثَنَا يُونُسُ قَالَ زَعَمَ عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ قَالَ قَالَ أَشَجُّ بْنُ عَصَرٍقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فِيكَ خُلَّتَيْنِ يُحِبُّهُمَا اللَّهُ عَزَّ وَجَلَّ قُلْتُ مَا هُمَا قَالَ الْحِلْمُ وَالْحَيَاءُ قُلْتُ أَقَدِيمًا كَانَ فِيَّ أَمْ حَدِيثًا قَالَ بَلْ قَدِيمًا قُلْتُ الْحَمْدُ لِلَّهِ الَّذِي جَبَلَنِي عَلَى خُلَّتَيْنِ يُحِبُّهُمَا",
                "id": "Telah menceritakan kepada kami [Isma'il] ia berkata, Telah menceritakan kepada kami [Yunus] ia berkata, [Abdurrahman bin Ubay] berdalih dengan berkata, [Asyajj bin Ashr] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda kepadaku: \"Sesungguhnya pada dirimu terdapat dua sifat yang keduanya dicintai oleh Allah 'azza wajalla.\" Saya bertanya, \"Sifat apakah itu?\" beliau menjawab, \"Al Hilmu (santun) dan rasa malu.\" Saya bertanya lagi, \"Apakah kedua sifat itu telah ada padaku sejak lama atau baru melekat?\" beliau menjawab: \"Sejak lama.\" Saya berkata, \"Segala puji Allah yang telah memberiku dua sifat yang dicintai-Nya.\""
            },
            {
                "number": 1776,
                "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا عَوْفٌ حَدَّثَنِي أَبُو الْقَمُوصِ زَيْدُ بْنُ عَلِيٍّ قَالَ حَدَّثَنِي أَحَدُ الْوَفْدِ الَّذِينَ وَفَدُوا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ عَبْدِ الْقَيْسِ قَالَوَأَهْدَيْنَا لَهُ فِيمَا يُهْدَى نَوْطًا أَوْ قِرْبَةً مِنْ تَعْضُوضٍ أَوْ بَرْنِيٍّ فَقَالَ مَا هَذَا قُلْنَا هَذِهِ هَدِيَّةٌ قَالَ وَأَحْسِبُهُ نَظَرَ إِلَى تَمْرَةٍ مِنْهَا فَأَعَادَهَا مَكَانَهَا وَقَالَ أَبْلِغُوهَا آلَ مُحَمَّدٍ قَالَ فَسَأَلَهُ الْقَوْمُ عَنْ أَشْيَاءَ حَتَّى سَأَلُوهُ عَنْ الشَّرَابِ فَقَالَ لَا تَشْرَبُوا فِي دُبَّاءٍ وَلَا حَنْتَمٍ وَلَا نَقِيرٍ وَلَا مُزَفَّتٍ اشْرَبُوا فِي الْحَلَالِ الْمُوكَى عَلَيْهِ فَقَالَ لَهُ قَائِلُنَا يَا رَسُولَ اللَّهِ وَمَا يُدْرِيكَ مَا الدُّبَّاءُ وَالْحَنْتَمُ وَالنَّقِيرُ وَالْمُزَفَّتُ قَالَ أَنَا لَا أَدْرِي مَا هِيَهْ أَيُّ هَجَرٍ أَعَزُّ قُلْنَا الْمُشَقَّرُ قَالَ فَوَاللَّهِ لَقَدْ دَخَلْتُهَا وَأَخَذْتُ إِقْلِيدَهَا قَالَ وَكُنْتُ قَدْ نَسِيتُ مِنْ حَدِيثِهِ شَيْئًا فَأَذْكَرَنِيهِ عُبَيْدُ اللَّهِ بْنُ أَبِي جَرْوَةَ قَالَ وَقَفْتُ عَلَى عَيْنِ الزَّارَةِ ثُمَّ قَالَ اللَّهُمَّ اغْفِرْ لِعَبْدِ الْقَيْسِ إِذْ أَسْلَمُوا طَائِعِينَ غَيْرَ كَارِهِينَ غَيْرَ خَزَايَا وَلَا مَوْتُورِينَ إِذْ بَعْضُ قَوْمِنَا لَا يُسْلِمُونَ حَتَّى يُخْزَوْا وَيُوتَرُوا قَالَ وَابْتَهَلَ وَجْهُهُ هَاهُنَا مِنْ الْقِبْلَةِ يَعْنِي عَنْ يَمِينِ الْقِبْلَةِ حَتَّى اسْتَقْبَلَ الْقِبْلَةَ ثُمَّ يَدْعُو لِعَبْدِ الْقَيْسِ ثُمَّ قَالَ إِنَّ خَيْرَ أَهْلِ الْمَشْرِقِ عَبْدُ الْقَيْسِحَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا عَوْفٌ عَنْ أَبِي الْقَمُوصِ قَالَ حَدَّثَنِي أَحَدُ الْوَفْدِ الَّذِينَ وَفَدُوا عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِنْ لَا يَكُنْ قَالَ قَيْسَ بْنَ النُّعْمَانِ فَإِنِّي أُنْسِيتُ اسْمَهُ فَذَكَرَ الْحَدِيثَ قَالَ وَابْتَهَلَ حَتَّى اسْتَقْبَلَ الْقِبْلَةَ ثُمَّ يَدْعُو لِعَبْدِ الْقَيْسِ ثُمَّ قَالَ إِنَّ خَيْرَ أَهْلِ الْمَشْرِقِ نِسَاءً عَبْدُ الْقَيْسِ",
                "id": "Telah menceritakan kepada kami [Isma'il bin Ibrahim] ia berkata, Telah menceritakan kepada kami [Auf] telah menceritakan kepadaku [Abul Qamush Zaid bin Ali] ia berkata, telah menceritakan kepadaku [salah seorang utusan] -yang mendatangi Rasulullah shallallahu 'alaihi wasallam dari Abdullah bin Qais- ia berkata; Kami menghadiahkan kepada beliau berupa bejana kecil berisi kurma, atau Qirbah (sejenis bejana yang terbuat dari kulit) berisi tumbukan kurma atau Barniy (jenis kurma yang bagus).\" Beliau bertanya: \"Apakah ini?\" kami menjawab, \"Ini adalah hadiah.\" Dan saya menduga bahwa beliau melihat satu di antara kurma itu kemudian mengembalikannya lagi ke tempatnya semula. Dan beliau bersabda: \"Berikanlah kepada keluarganya Muhammad.\" Setelah itu, orang-orang bertanya kepada beliau mengenai beberapa persoalan hingga mereka pun sempat menanyatakan tentang minuman. Maka beliau bersabda: \"Janganlah kalian minum pada Ad Duba`, Al Hantam, An Naqir dan jangan pula pada Muzaffat. Minumlah yang halal pada tempat minum yang terikat bagian atasnya.\" Seorang dari kami bertanya kepada beliau, \"Wahai Rasulullah, apa maksud tuan, apa itu Ad Duba`, Al Hantam, An Naqir dan Al Muzaffat?\" beliau menjawab: \"Aku tidak tahu apa itu. Tempat apakah yang paling panas?\" kami menjawab, \"Yaitu Al Musyaqqar.\" Beliau bersabda: \"Demi Allah, aku telah memasukinya dan mengambil airnya.\" Aku lupa akan redaksi hadits itu, lalu aku diingatkan oleh ubaidhullah bin abu Jarwah, ia berkata; Aku pernah berdiri di atas 'Ain Az Zarah, kemudian beliau bersabda: \"Ya Allah berilah ampunan bagi Abdul Qais. Sebab, mereka masuk Islam dengan penuh ketaatan dan tanpa paksaan, tanpa kehinaan sebelumnya dan tanpa perang. Dan pada sebagian kaum kami, bahwa tidaklah mereka masuk Islam kecuali setelah dipaksa dan dihinakkan dan diperangi.\" Disinilah beliau hadapkan wajahnya saat berdo'a, yakni tepat berada di sebelah kanan kiblat hingga kemudian beliau menghadap kiblat. Lalu beliau berdo'a untuk Abdul Qais dan sesudah itu beliau bersabda: \"Sesungguhnya sebaik-baik penduduk Masyriq (timur) adalah Abdul Qais.\" Telah menceritakan kepada kami [Muhammad bin Ja'far] Telah menceritakan kepada kami ['Auf] dari [Abul Qamush] ia berkata; Telah menceritakan kepadaku salah [seorang utusan] dari para utusan yang diutus kepada Rasulullah shallallahu 'alaihi wasallam -jika ia tidak menyebutkan [Qais bin An Nu'man], maka aku telah dilupakan untuk mengingat namanya- lalu ia pun menyebutkan hadits. Ia berkata; Beliau berdo'a dengan sepenuh hati, hingga beliau menghadap ke arah kiblat. Sesudah itu, beliau berdo'a untuk Abdul Qais kemudian bersabda: \"Sesungguhnya sebaik-baik penduduk Masyriq (daerah bagian timur) adalah para kaum wanitanya bani Abdul Qais.\""
            }
        ]
    }
}